{"riiES5Omf02utz1MM1DMow":{"text":"Had some time to kill so I stopped here to have a beer. The place was crowded while most o","useful":0,"cool":0},"Rg6DqCdb8_qOaRsDZtGExg":{"text":"Yes to finding a microbrewery in the French Quarter. Excellent place to get your day drunk","useful":0,"cool":0},"tzjB5VVybpfBD-S8kjieXg":{"text":"Ate here a few evenings ago. Just two of us at a high-top near the bar. Admittedly, the se","useful":0,"cool":0},"W5RLfe5FTzskQ4puRR7pRw":{"text":"Great food and even better service. Very glad we chose this place to eat dinner tonight. T","useful":0,"cool":0},"T4HOp8BdGXSo5v0TnkjXNg":{"text":"Came here from out of town last Thursday night since it was close to our hotel room.\nWe sa","useful":0,"cool":0},"4VBnVeTdpvL1vesvcyajHA":{"text":"Everything about my dining experience was perfect. The waiter. The ipa. The gator sausage ","useful":0,"cool":0},"EzS4jf5f7fvCEdGQ4fhp7g":{"text":"We stopped here for lunch on our day out on the town. We sat out on the balcony, which was","useful":2,"cool":1},"HTVPXf8SaDHpuwFPyKM7uQ":{"text":"This is a review of the beer/bar area and not the food.\n\nWe stopped in here on Mardi Gras,","useful":5,"cool":5},"xBMRhLplITp6hVTzB7RrBg":{"text":"Great seafood appetizers specially the seafood cheesecake and the crab cakes.  Pair it wit","useful":0,"cool":0},"6lV0pD2RU5NksSRpLWA6Ow":{"text":"This is what a brewpub should be.  Welcoming people, great beer, great food, and live musi","useful":0,"cool":0},"qOt6vL4z7o5ee1fKizsRFQ":{"text":"I liked this place when I lived in Louisiana, because the food is good and authentic and r","useful":0,"cool":0},"YMWcrrW3Ud4934WQB4iMVw":{"text":"Josh is the manager and he completely blew off our party of 10. We were trying to get a co","useful":0,"cool":0},"MUqK5lH_eRQ5Ji7uEzc_LQ":{"text":"Just ok food & beer in a convenient location.  We had MUCH better food elsewhere in town, ","useful":0,"cool":0},"jMR-_yvBxW7L3VGK4ZgIJg":{"text":"A great place to sit at the bar. The beers are great and jazz when they play is nice to li","useful":1,"cool":0},"560OIekl7Q1NPB5dFy7d8w":{"text":"My husband and I stopped here because he's a picky eater and we saw they had some simple f","useful":0,"cool":0},"4Zw-wNIJ1XGtMbv5N2hJsw":{"text":"A group of 6 of us went there on New Years Day and it was horrible.  First off our waitres","useful":0,"cool":0},"sKVnRefWy4Kh33_QFFBu1g":{"text":"Visited this place after getting a Bogo entree coupon from the visitors center and it was ","useful":0,"cool":0},"y87d8O5o7aNOgJUpqXHzQA":{"text":"Brewery house. ... is it a joke.  Very,  very limited beer selection.  4 beers: kolch, pil","useful":4,"cool":0},"0A_k6rfuw9n2V4jgcBfEuQ":{"text":"Ordered the DeCatur St. Burger and it was not great, but the blue cheese was good.  The be","useful":0,"cool":0},"MNUrf4gXmMx64TkkC7eKWQ":{"text":"Below average beer for a microbrewery! I was on vacation and as a beer snob, I love trying","useful":2,"cool":1},"WuebSYD5xINg5JVXeen_bQ":{"text":"We just stopped for a beer after finishing a carriage tour.  The ambiance was great!  You ","useful":0,"cool":0},"_be89Y9cm2-wmT6EZvB4ig":{"text":"Ducked in here quickly during a down pour outside.\nWe grabbed a seat at the very vintage (","useful":0,"cool":0},"J-VD1JT7CAhlBpR_lt3bNg":{"text":"Recommended by the concierge at my hotel so I stopped in just to try the beers.  The atmos","useful":0,"cool":0},"dLTJKBPc5O3REs3gs6MeEw":{"text":"COME HERE FOR FOOD... not for beer.\n\nBeer is bad... we didn't like a single one they offer","useful":0,"cool":0},"UwYjx1D9P-AxvIccgBf4vw":{"text":"Just finished an amazing slab of the brew house ribs. No wait to get in. They brew their o","useful":0,"cool":0},"x8vvf9uPejHEkbEfoXsoeA":{"text":"Beer - 0.5 Stars\nFood - 4.5 Stars\nService - 5 Stars\n\nAmerica makes some of the best beers ","useful":0,"cool":0},"0T85pvhDC0w0rOwfN2S9kg":{"text":"Good food, good drinks and good people watching location. Come here to relax and watch som","useful":0,"cool":0},"SK5xbS9USmls866kQUA0jw":{"text":"I went back to Crescent City for a second time and had another enjoyable visit!  My sis an","useful":0,"cool":0},"rOdi-ugFP5ntmQ70eoXFcA":{"text":"Not the first time here, we always enjoy our lunch. At the table for 6 on the second floor","useful":0,"cool":0},"egIoliZ8Fcn8pBnKXV1eng":{"text":"Pilsner is awesome, rest of beers good/ok. Seafood cheesecake was unique and tasty! Great ","useful":0,"cool":0},"uic8ktKLqZKm3Y08EM9Z-A":{"text":"The food is not that great; small portions and over priced. No drink specials and the serv","useful":0,"cool":0},"9I6knH_bF1eyFFyquSsFwQ":{"text":"Love the ambient and the wait staff. They are knowledgeable with great atmosphere.  We are","useful":0,"cool":0},"caLnBCrLt30DbsGK6uNZgA":{"text":"After a failed \"wine and cheese tour\" we took out bachelorette party to this brew house. T","useful":1,"cool":0},"dwpjbBSlSzgFj3bjwj91lw":{"text":"The Wing's are sooooo amazing. The drinks are great. I enjoyed the flight of beers. Friend","useful":0,"cool":0},"RGAqDAL8gqsx0QBmwXSnLQ":{"text":"My husband and I stopped in this place over the weekend after Jazz Fest.  The food was awf","useful":0,"cool":0},"UekwDNMIwmJg6KRu_dFt0A":{"text":"Stopped in here for a few beers our first night in New Orleans. Didn't try any of the food","useful":1,"cool":0},"8M8nCwjAQRu5_Jhj8gYSIQ":{"text":"Had lunch there today while in town for the holiday, brews were ok but the food and the se","useful":1,"cool":1},"NhFwUXYkPnd6JaRUGtx_Ag":{"text":"Not bad, not bad at all.\n\nHot, humid days in New Orleans when you are a Coloradoan not use","useful":0,"cool":0},"9fs-zZ1r6jq4bF2_SC6WIg":{"text":"Local beer was excellent, Red Stallion is a superb beer goes great with the Shrimpand Grit","useful":0,"cool":0},"eoZigfIyaPBMBizNZmXFLw":{"text":"Food is good.   Beer was ok.  Atmosphere is good.  Blackened redfish with soft shell crab ","useful":1,"cool":0},"X03T73CHiz8rreqFvyqJiA":{"text":"Food was edible, beer ok. We went here so our kids could hear some live jazz - not a lot o","useful":0,"cool":0},"sqMi70c8sOQEHpotJCvlCA":{"text":"Usually Crescent City Brewhouse has a buy one get one free coupon in the visitors guide. T","useful":0,"cool":0},"bQOoJ2FBSjLyNOQqwNSSNg":{"text":"Go there at least once a month since I work downtown.  menu is diverse, food is consistent","useful":0,"cool":0},"qK2K5QIEGVlDW11NAkp8qQ":{"text":"We got here at 7:30 and we got drinks and food, the hostesses were nice our waiter was gre","useful":0,"cool":0},"ZqKF3shgJP8myTw4IrrHIQ":{"text":"Great place! It was recommended by the concierge at our hotel. We were looking for a light","useful":0,"cool":0},"ujZ8TCcqKvD8GXny0ySODg":{"text":"We ate dinner and were well pleased with the courteous staff and the efficient way they ha","useful":0,"cool":0},"4NwDfsFY1iIgEY6tdbncGA":{"text":"Great location, great interior look, but everything else was mediocre. Stopped here for lu","useful":1,"cool":0},"JbLH9qhoGjvK742Ooyzjlg":{"text":"Good jazz band, great location, pleasant atmosphere, pretty good beer. 3 star\n\nFood was no","useful":3,"cool":1},"VLqJ88SpwPoM6pUt69XCcw":{"text":"This is a below average brewery with poor service. For as many craft brews available these","useful":0,"cool":0},"ygF9KRqg7bsJjznSRvsiKA":{"text":"There is one thing new englanders know and that is seafood. The oysters there are biggest ","useful":0,"cool":0},"j5Jnpdtdx1DMcpydo_x6Zg":{"text":"Beer was decent, food was meh. The place looks like TGI Fridays did a brewery. Very touris","useful":0,"cool":0},"tqftcfvIONz5A8TF7G6yvw":{"text":"Good beer, average food. Nothing to rave about but if i ever come back it'd be only for th","useful":1,"cool":1},"QIxiWnWeDBbkTEEsFAK-Cw":{"text":"This was our first meal in NOLA. I got the fried shrimp poboy which was delicious and perf","useful":0,"cool":0},"lX9vTw2jt4hkJJKfpEG31g":{"text":"I was drawn to The Crescent City Brewhouse by a menu item--shrimp beignets--for my last Ne","useful":0,"cool":0},"K0GP_OFrkFz52_DRgDWKJw":{"text":"We stopped in for a beer/drinks and snack on the way to dinner.  I love craft beers and wa","useful":0,"cool":0},"qvFZs-26QWrucAm6J59q-g":{"text":"Dining Date January 18, 2015\nOrdered the 5 beer sampler and was not disappointed with any ","useful":0,"cool":0},"7gMPMFGh7cuQmvLE0MzIWQ":{"text":"While the service, food, and ambiance were all acceptable to above average I can't give yo","useful":1,"cool":1},"e2yT208MhqPnaGLZbGXcBg":{"text":"This was the first place we ate at when we visited NO.  We got there kind of late as we dr","useful":0,"cool":0},"DNkv_YiZeeVpwa4L31Y4Ig":{"text":"We started with some beers and baked oysters for appetizer. The oysters were delicious!  T","useful":1,"cool":0},"8yVmeIHp4UbedbeddD--Qw":{"text":"A walk up window for adult beverages \"to geaux\"!!!  WHAT!?!????!!!!!  I'M IN!\n\nI see the r","useful":1,"cool":1},"kTIiZaJu-lUFxbdLoZ1Pyw":{"text":"It's probably more like 3.5 stars, but certainly not four stars. Came in with a group and ","useful":0,"cool":0},"TFyDOzIWtadeskepemcd6g":{"text":"Just had a wonderful Oktoberfest meal at Crescent city brewhouse. My waiter, Peter, was fa","useful":0,"cool":0},"uixyvOor66xHOlfu65Pzyg":{"text":"Red Fish and stuffed shrimp was amazing!  Also make sure you get the brie appetizer. \nMy h","useful":0,"cool":0},"U3i9cM4G4AoJ3GdYVfswSg":{"text":"Really great service! We started with the Brie  platter and then had chicken Caesar salad ","useful":0,"cool":0},"m9-XIXz8mqFO1ZUaxm2ZdA":{"text":"Room my hubby to NOLA for the first time (for him) I had been countless times before and w","useful":0,"cool":0},"0LDYac4v4cAWA_EtBgVKCg":{"text":"The food and drink was average compared to the other restaurants.  Fried Alligator and thr","useful":0,"cool":0},"Iy4tOMsv6Miu6YEcDrFoIg":{"text":"Oyster club was good and the beers were fine.  Nothing noteworthy though.  Enjoyed the liv","useful":0,"cool":0},"b2LKhtHKkvO5cMQ2hVUszQ":{"text":"Experience was mediocre at best. I ordered the IPA and would've been certain it was the Pi","useful":0,"cool":0},"kxUqejFbPPFBKY2_fnibSA":{"text":"Party of 9 and we are having the time of our lives!\nService and food is SPECTACULAR. \nCrab","useful":0,"cool":0},"3EA-NGDBBehq7AQk9h0Ifw":{"text":"Perfect place to be  live Jazz music with German beer and awesome wings!","useful":0,"cool":0},"D4r4QACy40dgp6I0Hv3giA":{"text":"I went to New Orleans with a couple of friends over the first weekend of November 2013. Th","useful":0,"cool":0},"ezSH47ujLJ-Nh3oIrKUc2A":{"text":"Stopped in for lunch.  Did a full flight of their beers and had a bowl of shrimp and grits","useful":0,"cool":0},"MkqQwcQYNEyF-Ih9yG4_9g":{"text":"Stopped in here, hungry, thirsty, and hot. Lunchtime, decided to sit at the bar. Bartender","useful":0,"cool":0},"2CnltIaWXHtnzC5sdqBX0w":{"text":"The food itself was very good and well presented.  Great flavors!  However, their service ","useful":1,"cool":1},"kttO9AkzTacfU6qO21205w":{"text":"The food was delicious! Carefully prepared and no ingredient missed. So carefully prepared","useful":0,"cool":0},"p26253EAeu4ES4cwIsPwwg":{"text":"Wow.  I've never been this disappointed with beer before!  This is the only brew house in ","useful":1,"cool":1},"7M7MD4GJ4m9J3eUMef8qOQ":{"text":"We started with the angry muscles which are a great appetizer.  Save the sauce to dip the ","useful":0,"cool":0},"Y11ss25M8OK5KlC1ryxfCQ":{"text":"The beer is what I expected of brewpubs ten years ago. Sorry guys, but the bar has been ra","useful":0,"cool":0},"WuF1Qq87JDugF-qEC9Tk8w":{"text":"The seafood cheesecake is one of the best things that I have ever eaten, and that is sayin","useful":0,"cool":0},"L4Px9XgfVns-hqMT2hMMOg":{"text":"Great atmosphere!   Friendly, attentive staff and good music.   That food was yummy too.  ","useful":0,"cool":0},"_AZfXvRs76hjEYUgkey1Qw":{"text":"Their hours say they close at 10. At 9:45, in desperate need of more happy juice, it was c","useful":4,"cool":3},"-_4S-kcoK9W70ido_jvwHQ":{"text":"At first I wasn't sure about this place, really busy and they didn't want to seat a large ","useful":0,"cool":0},"nB6UEZBnjFIwj3OD3IV55Q":{"text":"Came here 17 years ago and just returned last week. Food is still excellent, beers are tas","useful":0,"cool":0},"z2D4Sfk2dvUKJx4wP-BMJg":{"text":"The service was not hospitable, as all of the other dining experiences in New Orleans has ","useful":0,"cool":0},"fxHbDyJD3GwpBS9ZGSbFhw":{"text":"Great food in a beautiful atmosphere. The live music was a very enjoyable addition to the ","useful":0,"cool":0},"ZJRDs9FI6TIyVhVtFuEGRQ":{"text":"We love the view from the balcony where you can see the riverboat leave.  We had the pulle","useful":0,"cool":0},"lp1TcV46swUQ_pQoeqASPQ":{"text":"We had a wonderful meal here. Megan was our server and she was fun, knowledgeable and acco","useful":0,"cool":0},"s088QPw4bkwfJKLUxJKw-g":{"text":"We were walking by looking for a cosy restaurant with live music because we are here for 5","useful":0,"cool":0},"-rsZn-rf12XgoPS846AB8w":{"text":"All the food that our party selected was excellent! The meat pies and boudin balls for app","useful":0,"cool":0},"-6tyT9wQKCHt8H2OhZooUg":{"text":"Long wait for a table and for our food. We were a group of 8 but long wait for dinner was ","useful":0,"cool":0},"eJd9YycLuGckogTJwyInfw":{"text":"Not my choice for dining this evening, we had a coupon though from our bell man at the hot","useful":0,"cool":0},"-JSqzoxHAlOzp0-vrRUQNQ":{"text":"Good food and solid beer. I love the bbq sauce.","useful":0,"cool":0},"OWwy1lQ04x2lTtYfaR9Cng":{"text":"This place had a good etouffe and great crawfish Mac and cheese. An appetizer and entree p","useful":0,"cool":0},"ZGb5M-_QwJ-7QhIh3GU16g":{"text":"All around disappointment. This place is here to serve as nothing more than a meeting plac","useful":2,"cool":2},"PCO6jyCMBz4XNBFdz4lrWg":{"text":"Food here was very good.  The beer is even better.  They have in house drafts that are gre","useful":0,"cool":0},"509SCdrEMTNQGB_PdTZ0wQ":{"text":"Not impressed at all. Horrible service! Food is just ok. Beer was good. Don't waste your t","useful":0,"cool":0},"lKpg7-yxDGeJAL1G2wKCcQ":{"text":"Party of 6 ate dinner here on a Friday night.  They only serve their own beers and we trie","useful":2,"cool":1},"agc2ZXBUo7f15UAA2YnLMQ":{"text":"Great location for a brewpub and amazing jazz in the heart of action.   Had a couple brews","useful":0,"cool":0},"Jqd_-CX7xcWufVsznWyh9Q":{"text":"The 5 stars is for our bar experience with a fabulous Drexler- this dude ROCKS!  We came i","useful":0,"cool":0},"9ZyHyEuUnGfVMa_mQmJeOw":{"text":"Over priced and ok service. What really upset us was that we tried to go up on the balcony","useful":0,"cool":0},"CChvsB_jJ7o3LBLTP-Bwng":{"text":"Been here a few times typically with pickle eaters. The menu has an option for everyone. I","useful":2,"cool":0},"4vYMfWvsS83gJQDSZ22lEw":{"text":"NOLA has disappointingly few breweries: in fact, this was the only one we were able to vis","useful":0,"cool":0},"FQDbBfqGx9SRoyq_5LPe4A":{"text":"Large brew pub in a nice, relaxing space,\nI was sipping fresh brew with a smile on my face","useful":0,"cool":0},"WXQB1zq0MW_lCK296I7PpQ":{"text":"This was our only unplanned meal of our recent trip to New Orleans.  We needed a quick pla","useful":0,"cool":0},"45cU-TX9l1n0LIMT9aX9gA":{"text":"The concierge at our hotel suggested this place claiming it would be great for families. H","useful":0,"cool":0},"DS1mjLMd3proSZiNMX7rcw":{"text":"Food was good! Had shrimp and grits/ pork empanadas and a few other things. Very good -ser","useful":0,"cool":0},"noWVENalXUm7JlSlGqVC4A":{"text":"This place is a blast in a glass! I love to take my family here to go eat for my birthday ","useful":0,"cool":0},"BKD59QAJs6uh8IXfhispeA":{"text":"Honestly, I would rate this place a 3.5 star average. There were good items, and there wer","useful":0,"cool":0},"XTgTj-ly7mXI9xsnNP4pXQ":{"text":"I am very surprised that this place garnered as many stars as it did. Poor service, bland ","useful":1,"cool":1},"ialZX-HviRF-AwxaDdqpcg":{"text":"I had the ribs and it was pretty good. It went well with their in house craft beer","useful":0,"cool":0},"H_T8zErc401C_gReq5MU5g":{"text":"Fantastic shrimp and grits!  And the stuffed shrimp were pretty dang good too!  Even tried","useful":0,"cool":0},"q2fGujvY8ZU_zNXCeXnkjg":{"text":"The hot wings were INCREDIBLE!!!  Some of the best we've ever had, seriously delicious!  T","useful":0,"cool":0},"0KbjCt9KiLlIHl1QHxabJQ":{"text":"I'm a huge fan of microbreweries and always try to lend my support, but this place produce","useful":2,"cool":1},"fGSOH0osS4ELprDTCqxn7Q":{"text":"I met a group of people at the Crescent City Brewhouse for some dinner and drinks.  If you","useful":0,"cool":0},"ZFtFkAPedpHIvpqs8uGjEg":{"text":"Large and comfortable spot with character.  Food was ok, didnt blow me away, and brews wer","useful":0,"cool":0},"6fBe73-FweBh2lUmnS7EJg":{"text":"Stopped in here for lunch last weekend. I got the Pasta Jambalaya and it was great. Just t","useful":0,"cool":0},"npr3xfa43MP1e4L9KrnA0Q":{"text":"The seafood here is outstanding. Best raw oysters ever. Stuffed shrimp outstanding.  Alway","useful":0,"cool":0},"RHMOWUlfeMKRlPkbRJKmPA":{"text":"Got the 5 beer sampler and a half dozen raw oysters. Having been in New Orleans many times","useful":0,"cool":0},"KqrQ0_MrozoRIJLoC3jj1Q":{"text":"Nothing special. The staff was unpleasant, they were laughing at the group of 3 women next","useful":0,"cool":0},"p3QsRHWXaipzc7mdhOxDrQ":{"text":"It was an OK food experience, great restaurant experience.  I had the wings and the Shrimp","useful":0,"cool":0},"pr7TIXDLX2-0yhznBmO76w":{"text":"Well, I was really hoping for a fantastic brewpub experience, but this seemed like a phone","useful":1,"cool":1},"OWfxxUL6cnkbaZInvi_j6g":{"text":"I had the displeasure of dining at this restaurant on Saturday night. I will say the food ","useful":8,"cool":1},"PnMEed05Ojrh1gPiGq0MHg":{"text":"Food was good but I was dissapointed by the portion size.  My $24 entree was shrimp stuffe","useful":2,"cool":1},"GtyavJpPAh2pvgTwIsWGcw":{"text":"I have come here twice on vacation and would come back again. Super friendly staff. Very p","useful":0,"cool":0},"LN9m3lLuQgiku2JMt8QTig":{"text":"Best pub in NOLA. The five brew sampler was a tasty treat to go with the baked brie appeti","useful":2,"cool":2},"OwP0OVRkWV88iDtLJk-knQ":{"text":"The beer was excellent and the menu selection was good at a reasonable price. I got the pa","useful":0,"cool":0},"Orr0hklIBpS7qgYYYSPgtg":{"text":"This brewhouse has a great location.  I sat on the upstairs patio which overlooks the shop","useful":1,"cool":1},"0Mu3q_fg3P3BYylt3XxQ3w":{"text":"This was a great first stop on our trip to New Orleans. We went on a Friday afternoon and ","useful":0,"cool":0},"V1iRToXt9c3g1ZZZElLfwQ":{"text":"Ohhhhh nawwwwwleans, why do you have to be such an amazing city, with even better food.  M","useful":0,"cool":0},"sg5OS9w3l2aUpiYyY9bGqA":{"text":"Solid 4 stars here. Shrimp po boy, BLT and pulled pork sandwiches were delish. Loved the l","useful":0,"cool":0},"8nWGlFJqozhMkiIk-QVZjA":{"text":"Well then, let us take a time machine back to the late 1980s when craft beer was just star","useful":2,"cool":0},"lctr1K2e4z41qwdxgTO0og":{"text":"The food here was off the chart good. We had the baked Brie appetizer and it was fantastic","useful":1,"cool":0},"BB0E0pjBI2RPUn4wMHqS_w":{"text":"The beer is good, although not exceptional, but I come here for the total experience, whic","useful":0,"cool":0},"3itosquhOHV3rGHA9A8_vw":{"text":"I'm surprised by some of the other reviews because our experience was great! The waitress ","useful":1,"cool":1},"GU0wmmR3JAp415W1yJ_vUQ":{"text":"A friend and I sat on the balcony to enjoy the beer and food.  The stout and IPA were amaz","useful":0,"cool":0},"brdppu1LLXMne6UFnGWTqw":{"text":"Loved it just as much this time as I did the first, but this time I actually tried the foo","useful":0,"cool":0},"jRgDCDD2gR5CeOjgMNCj4g":{"text":"Service was good.  Chef was kinda rude about our requests, though.  Whole place smells lik","useful":0,"cool":0},"t2qoFiJYfAVmeTRUI9kD0w":{"text":"Eat oysters! Love the oysters! And enjoy the oysters! It was Saturday night in the French ","useful":0,"cool":0},"hrCguapoOqrNNsHafLoDgA":{"text":"Two stars because our server was amazing. Unfortunately, after the wonderful food we've ha","useful":0,"cool":0},"vqJnJvmw9DhVc_YOnbrWyg":{"text":"I had an AWFUL EXPERIENCE at Crescent City Brewhouse today. I ordered a dozen of wings for","useful":1,"cool":0},"dW5HIjI2hgTpIdf89PvXuw":{"text":"MEH! I wanted to like this place just because it was funky and had a different vibe with a","useful":0,"cool":0},"aNe8c1JCgXYXp29KVv-uvw":{"text":"We had lunch here on a bright sunny day on the balcony up top. It was a real treat. I had ","useful":0,"cool":0},"16XWGqqYzK1iYT02lD8R5Q":{"text":"If you're gonna brew your own beer, it better be great.  This wasn't anyting special. $10 ","useful":1,"cool":1},"j65fjdjES5E2hNiBd---3A":{"text":"My boyfriend and I were vacationing in New Orleans and we were trying to find a restaurant","useful":0,"cool":0},"Zcf0_qB2kV2GFFCQMutHng":{"text":"Over $8 for a shitty pint of their own brew. Why the hell would you go here and buy one wh","useful":3,"cool":1},"WUhU5vtYpMapDdBYXRTYdw":{"text":"You're paying for the location. Which is odd since your \"view\" is a busy street and parkin","useful":0,"cool":0},"y8KM5_bKYXGmr4vUBU4tOg":{"text":"First time in the French Quarter. We were starving. Food looked good on the menu outside. ","useful":0,"cool":0},"bjGdiNKSSISQUzYgloqmMQ":{"text":"We came here as a recommendation from family and used yelp to help determine the best dish","useful":2,"cool":0},"poLOrtkUY--RyPKSfu1HcA":{"text":"Wow, we were having a great experience here. Waiter was on point, gumbo was great. Ombienc","useful":6,"cool":0},"JqQSYgIzcxgYHpiWWC3CqA":{"text":"I must admit I have a soft spot for this place as it was the only restaurant on New Year's","useful":2,"cool":2},"dBsyPluVoKHF4dtVFO6jbQ":{"text":"Loved it! Started with the best crab cake I've ever had. Perfect proportions with a fried ","useful":0,"cool":0},"WcgET91UgBAhbFhJYljSkA":{"text":"The beer is excellent but food options were limited. Come for the beer and go somewhere el","useful":0,"cool":0},"xxVCMJX-OoYRnZhV-u19Ew":{"text":"Service was great and friendly. We were seated promptly and everything came out as ordered","useful":1,"cool":0},"VjR5oPWWPvv4oMzNLQP_bw":{"text":"All-around unpleasant experience. The waiter didn't manage to get waters to our table unti","useful":1,"cool":1},"JQA042TO0WQRONxm_z--bA":{"text":"I love the band that plays on Friday night and I love the décor, but there isn't much more","useful":0,"cool":0},"S1_5cNPJCVzhXTuNQUZ9Iw":{"text":"Delicious food with a good selection of beer, a full bar, friendly staff and great jazz mu","useful":0,"cool":0},"Wh3ZV--5f1b1bJKZRZrGKA":{"text":"I really wanted to give this place a good review.  The beer was at best mediocre. The serv","useful":0,"cool":0},"0G8qExxyWuqIDPLhGY8YTQ":{"text":"I ordered a special menu option with gumbo and crab cakes... sounded great was a little pr","useful":0,"cool":0},"pa7WEW8HxVgtRnN8tF2uZw":{"text":"Rude & inattentive bartenders. Value your time and get a drink elsewhere. I came here sinc","useful":0,"cool":0},"due70P8FhgCPDys2jEb_jQ":{"text":"Stay away from here!\n\nI stopped into this place on my random drunken bar hopping across do","useful":5,"cool":2},"C04wLF5NzftMbwm4bwgskA":{"text":"We chose to come here based on other yelp reviews and the menu. However, this is Not the m","useful":0,"cool":0},"4iDrd4gbO0JhPFJ3Y---xA":{"text":"We sat at the bar had sparkling wine, beer, salad, oysters and wings. Amazing quality food","useful":0,"cool":0},"hHuNvy5JIaCECEBtaD721A":{"text":"I swear this was the best meal we had in new Orleans! I really just went there for the bee","useful":0,"cool":1},"AuB3dAIN0B6l7q7M1RVdMA":{"text":"Lots of flys and the beers were so-so. Wouldn't come back.","useful":1,"cool":1},"0MP6h6YaqoKYfmPiOKtxUQ":{"text":"This place has some of the best beer I've ever drank.  I ate a couple of dozen oysters raw","useful":0,"cool":0},"LfIupY50cSV_2cb31IhPng":{"text":"We stopped in for a late lunch and were blown away. The baked Brie was very good and the c","useful":1,"cool":1},"IekQKURX0eiQ4euhz3vcgA":{"text":"Their beer is OK, nothing to write home about.  The food is the same.  The location is gre","useful":1,"cool":1},"nscjLvhbZAM8D-RTCpdTAA":{"text":"Great brewery restaurant with all the NOLA feels. The oysters were fantastic and the seafo","useful":0,"cool":0},"7P2FpaEWDy3UCdXE0JvmtQ":{"text":"My family and I are here visiting for the first time. We decided to try this place out aft","useful":1,"cool":1},"I62FkGLTYWqf8rdg3REu7w":{"text":"After doing the \"Legendary Ghost Tour,\" our group happened upon this place. It was excelle","useful":0,"cool":0},"JBATYylUzzbzzvb9bcKFOQ":{"text":"We came here for our first dinner in NOLA. I got the shrimp poboy and a vodka tonic (not a","useful":0,"cool":0},"yK1g6gcxBCzMQkZgaFSsHA":{"text":"I organized a small get together for my boyfriends birthday with about 12 people. When I f","useful":0,"cool":0},"EZ25GDRkDwaZQu_dUADZLQ":{"text":"My wife and I made our first visit to the Brewhouse.  My burger was delicious and my wife'","useful":1,"cool":0},"svSnmJvkFh7GiUyfJsG7eQ":{"text":"The beer isn't horrible but it's not special either. And what brewery doesn't serve beer b","useful":1,"cool":1},"H1G0xlwkI8n6q7xiYPM2Ug":{"text":"We stopped at the Crescent City Brewhouse for a few drinks and a snack post-parade and pre","useful":2,"cool":1},"NHubwG7vNxkySil_gWkphw":{"text":"The food is pretty good here if you're looking for a great atmosphere and some decent Caju","useful":0,"cool":0},"bmTIHq1RB93i_Nvp6_JeaA":{"text":"The biggest draw for me here is the beer, specifically the beer sampler.  I love that I ca","useful":1,"cool":2},"CoB9BJPfbDtJ4QNozjXKGw":{"text":"This is my \"go to\" spot anytime I'm in the French Quarter. Freshly brewed German beer and ","useful":0,"cool":0},"uTbPm91fWlo_DBvut4hkHA":{"text":"Food was excellent despite the long wait for the food. The Red Fish St Louis was fantastic","useful":0,"cool":0},"MBtAc0ueCGC1k-XHI_lTNA":{"text":"Spent a good amount of time here one afternoon. By that I mean we ran up a $750 dollar tab","useful":0,"cool":0},"nl3DJjRY1xa4IW4Y1t4iwA":{"text":"The vibe is really nice,  the drinks are good, my server is a sweetheart, but my food is a","useful":0,"cool":0},"90dl4LBcmT-4mlDL1W0EYQ":{"text":"If you get a chance to go here, do it! Best meal I've had since being in NOLA for 4 days, ","useful":0,"cool":0},"0izgBbpEpAvoYqUTGdVKaw":{"text":"Went on a Friday evening, and they had live music. It is definitely a \"classier\" bar. A fr","useful":0,"cool":0},"fsAqpGgtzU8UeARUkqcuLg":{"text":"Amazing filet and jumbalaya!  No seasoning needed.  To the tee perfect!","useful":0,"cool":0},"zaaMSsmAN_4ZDkPMPYEKWA":{"text":"Came here while on a working vaca and did my pre-vaca research to find local brews while I","useful":1,"cool":0},"WPESVCCMQrODAlRZQF32dA":{"text":"Nice clean place and quit atmosphere. Good size juicy hamburgers and home brewed beer.","useful":0,"cool":0},"0Q1cRviKvivuhEwXJjWSSg":{"text":"Short review for a short visit.\n\nMy wife and I stopped in for a drink. Glad we did. Great ","useful":1,"cool":1},"jMvgFk5k8eE2NMiwJY0FQw":{"text":"This place is right next to the French Market Inn where we happened to be staying, and aft","useful":0,"cool":0},"rbpGFQHo95uUxleAeQFpbA":{"text":"I make it a personal goal of mine to attend a brewery or brewpub in every location I visit","useful":0,"cool":0},"laXvaPyatj2UdaTlMpXFcg":{"text":"There beer is awesome and the service is A+++. They really try to accommodate anything you","useful":0,"cool":0},"WXW4A2vV7ohoEt1nUr5U0A":{"text":"Get the seafood cheesecake, just avoid the boudin balls.  Everything else on the menu is g","useful":0,"cool":0},"jjPyHnW9E9h4HpYQ3thZ_Q":{"text":"This place was on the fly. No yelp use to find this place \n\nNow my rating is based on the ","useful":1,"cool":0},"Xq_yd5KmuSE2sCCck6SXGg":{"text":"Good appetizers and brew their own beer,  enjoyed the seafood cheesecake and the sauce in ","useful":0,"cool":0},"epNR9fPpEc6qmsuu7qySHA":{"text":"Not bad.  Went here for a work reception and had catered appetizers.  Wish we could have o","useful":0,"cool":0},"aJysBDNvLOt5yXVzld51MA":{"text":"Excellent experience!  Had a flight of beers - all good, most really good.  A dozen oyster","useful":0,"cool":0},"MwBFDClwcmoQJYfPfHcznw":{"text":"Couldn't have asked for better food, service, music and beer for the price. We made New Ye","useful":2,"cool":1},"oI4QBMX9aKj-AOJZo3YHIw":{"text":"Met a college friend and her husband.  The Brewhouse 'summer bock' was great. I had more g","useful":0,"cool":0},"0xLxXM41LnqbBOKAPRR1GA":{"text":"First things first, the Cajun michelada brewtail is perfection.\n\nThey have some pretty dec","useful":0,"cool":0},"LPN5h_ezZWK7sPQ7-PXsRQ":{"text":"This restaurant is awesome!  Everything we had there was delicious! The manager there told","useful":0,"cool":0},"W6I7mFfU6J3Z8RgmOfYJfQ":{"text":"Good beer & nice displays of local artists' work. I've never tried the food as it's pretty","useful":2,"cool":0},"gYQke0_PMZVCv01-ZVDfzw":{"text":"This review was a borderline 3 because of the prententious rude waiter.We wanted the balco","useful":0,"cool":0},"Hi2rcytfyTi8yMhw3A4NPA":{"text":"Not very flavorful/bland and wasn't impressed with their brewed beers.  Pass on this one -","useful":0,"cool":0},"-mopXHBReQgcq9gKeO66ZA":{"text":"First time I visited this place two years ago i was very impressed. The beer was awesome( ","useful":0,"cool":0},"jMSSBz042ss1FORdiJzWzw":{"text":"You can cut the steak WITH A BUTTER KNIFE OMG!! Almost lost my mind.. Service was great fo","useful":0,"cool":0},"IquYowglHg4s6c27TIrGsA":{"text":"We didn't eat at this place, but from the looks of it - the food must be great because the","useful":0,"cool":0},"YCZeFr7FAFa3g7fBqoEtEg":{"text":"Mediocre, overpriced food. I got the alligator sausage po boy. It was bland and needed at ","useful":0,"cool":0},"K5dQdFNK2GC6XBCzEe0h-Q":{"text":"Decided to come here after my wife and I saw some live jazz playing while walking by. unfo","useful":1,"cool":1},"S56Ozi7BXVk9_e7KeXSqpg":{"text":"This is one of those places that you remember by the decor alone - the jelly fish lights r","useful":1,"cool":0},"iaTHKx2OlmPdPNJqe5nDug":{"text":"We have been visiting this place for 15+ years.  We love the location and prefer to dine o","useful":0,"cool":0},"jEsnuTjzsptEjYMTur-MWQ":{"text":"I'm not sure why this has earned such high remarks.\nThe food is bland, at best. Wait staff","useful":0,"cool":0},"PbCPles6G47bX6W0cUE6JA":{"text":"Extremely friendly and helpful staff, and the brunch deal we had was top-notch - appetizer","useful":0,"cool":0},"KSPYoBuZ4hsa17Xbwhm6Og":{"text":"If you are looking for good beer this is the place! The beer flight was a generous portion","useful":1,"cool":1},"xNvdAi-moyxkPbdDSBltjA":{"text":"I am rating on the beer & one appetizer: the seafood cheesecake (you must try it)! Also th","useful":0,"cool":0},"ik1d3tLkoiSkuLqIvKJx7g":{"text":"Went here with a group of my girlfriends (10 of us). Had a great time, our server was amaz","useful":0,"cool":0},"IexKIyEZHfnfvjAc6V31og":{"text":"I hadn't been in this place since the early 90's and decided to return and sample some of ","useful":3,"cool":1},"8hK0kf06ACN8hp_-jdOrKg":{"text":"My boyfriend and I tried Fried Alligator bits for the first time here at  Crescent City an","useful":0,"cool":0},"WpbzoJrERB-aKUNuSh6_tw":{"text":"Only grabbed a beer to go here - it was super hot out and the beer was refreshing however ","useful":0,"cool":0},"3ri6w9iUMWXzNhsFgNqM3g":{"text":"Mediocre beer at a place that has the audacity to say they are  fine dining.  I was told b","useful":4,"cool":1},"w6-QcDIuaZe5BEqZXdkrQQ":{"text":"Delicious food. Laid back atmosphere. Loved that they brew their own beer. We went here to","useful":0,"cool":0},"NVv-Z3ZB0zcUyT_9EeOoOQ":{"text":"Good service from our waitress Sadie. She was quick with our high maintenance requests and","useful":0,"cool":0},"6zIr9Z5F-y-m9jnSySM5iA":{"text":"Came here for dinner place was very nice with a great atmosphere. The lights above the bar","useful":0,"cool":0},"2e2XSfdK_GKtOHarbANLDA":{"text":"I don't know why there are so many bad reviews of this place.  The duck dish I had here wa","useful":0,"cool":0},"fTt7RcTKv7WPFY6y8LN-gg":{"text":"Was really impressed with this Brew Pub.  Helpers have mixed reviews so that actually info","useful":1,"cool":1},"gt9uYSR5t6jtZzVYMF5_FQ":{"text":"Nous avons fait un dîner en famille dans ce restaurant.\nTrès bon service irréprochable, qu","useful":0,"cool":0},"rSLnlx9vgGv6VjZy5xsAVQ":{"text":"Excellent appetizers! Good for watching football while having a drink. Recommend the red s","useful":0,"cool":0},"zshBNLqV3k_B8xZOMBrbhw":{"text":"One of the few breweries in the direct French Quarter area. Very small quantity of beer se","useful":0,"cool":0},"92aKoMfh8lsSQnqXlj_aBQ":{"text":"My friends and I are on a road trip, and as we near New Orleans, I decide to check Yelp fo","useful":1,"cool":1},"9W-CjanXaDrPDAVSug6elQ":{"text":"Tourist trap with very mediocre beer that costs an arm, leg, and penis. Oysters were ok.","useful":0,"cool":1},"RJSsC__UneFUKLkW5shh3A":{"text":"Great food!!! The best!! Cheesecake shrimp!!  friendly staff!! Very busy place but so nice","useful":0,"cool":0},"MZ2M5R7lNHYPCOQR3IzpIQ":{"text":"Talk about a great restaurant. Some local friends took us to this place and what a great p","useful":0,"cool":0},"TUgvFqLrOlxaBaeQGfnXog":{"text":"Came here for Valentine's Day.  Had the shrimp po boy, which was just OK.  My wife had the","useful":0,"cool":0},"BIPayHPLfMdVhjQA4rhkoA":{"text":"I normally loathe touristy places, but this restaurant is pretty darn good. First off, the","useful":3,"cool":2},"AOyR51PVHpAVpI_aJx43hg":{"text":"Maryann is hands down the most informative server I've ever met! Food was more like 3 star","useful":0,"cool":0},"7ts4m7GtAoAp5zSHaimHXA":{"text":"We stopped in here for a snack and a beer and were sadly disspointed. The space was tight ","useful":0,"cool":0},"QrM6BZRZz3oencMGywexhg":{"text":"Crescent City Brewhouse was just ok. The food orders for our group were all messed up and ","useful":0,"cool":0},"UvUrVjwmROC-2sZo2Eoexw":{"text":"They were willing to seat us a half hour before closing. Imperial Pilsner was excellent, a","useful":0,"cool":0},"wBfBRK7g5skVX49DzNUjpg":{"text":"The house-brewed beer was really great. The location is nice but kinda touristy. Just know","useful":0,"cool":0},"K315-v0uCRXsZb2GBGk-Mg":{"text":"I'm surprised by the bad reviews for this place so far.  It could be that these people hav","useful":2,"cool":0},"A5NieGE7zjcu0F1uAZyskw":{"text":"Buyer beware!  Our waitress here ran my debit card for more money than our tab was for and","useful":0,"cool":0},"dK93nm8L3Ofb1Zhvj7KtiQ":{"text":"Met up with some friends here for drinks and conversation. Sat at the bar downstairs while","useful":0,"cool":0},"h89IMafRdxnz-kHiBm0iPw":{"text":"Service is great at the bar. The bartender made me a special drink with Tito's! She was so","useful":0,"cool":1},"JoVup2EPC9fLi1XcyBMRLA":{"text":"I ate here for a rehearsal dinner. Restaurant has a great atmosphere and is 2 stories. We ","useful":0,"cool":0},"ZZo3dyv5sgKWdC6nvjMiFg":{"text":"The service was really bad, but maybe she had a bad day.  I ordered a gator and sausage po","useful":0,"cool":0},"rarJ_ScmH2ZG2cGT0y3FHQ":{"text":"Went for lunch upstairs and sat at bar. Bartender was an idiot and food was sloppy and bla","useful":0,"cool":0},"tQzl9CT7UEVP0i4M2sKf3A":{"text":"We ate here twice on our trip, both times because of the gallery dining.  It was busy on b","useful":0,"cool":1},"sRoULJop4UEjsOQfUQvXRg":{"text":"The restaurant brewed beer was great - I recommend the amber bock.  Wish I could say the s","useful":3,"cool":1},"HziP91g1GCDPoEIrjUdQ_Q":{"text":"We have been here before and it was great! We got the baked brie plate and one of the spec","useful":0,"cool":0},"Lmtg6a0nyaK6ehXp8HYgOA":{"text":"The only brewhouse in the French quarter For over 70 years. I had the pork ribs and the wi","useful":0,"cool":0},"SLtlnWFxSG-slp1LJi0VkQ":{"text":"I had a great seat on the balcony, where I could take photos of mule-drawn carts and peopl","useful":0,"cool":1},"BVUltKf79EUIhuZMvdT2JQ":{"text":"I've been here plenty of times, the food not so bad. After Katrina they shortened their me","useful":0,"cool":0},"iBY6hA74nAyFLGIZc99VrQ":{"text":"We love Crescent City Brewhouse! We ended up coming here twice during our short 4 night st","useful":0,"cool":0},"HkWs3TovECyoFDBCFNzRKQ":{"text":"On a recent visit to New Orleans this was the only place where the service was beyond poor","useful":1,"cool":1},"_-2aMkF4vWDb3yTFRjmzrw":{"text":"Perhaps one of the best, if not the best meals we had during our stay. The Pan Roasted Shr","useful":0,"cool":0},"racFkbbfGtAYu9KbSaQg4g":{"text":"Our first trip to NOLA, and we just happened upon this place..... On a very busy night, th","useful":0,"cool":0},"CqghvUtqvcKZURPNEqhk0Q":{"text":"Not bad. Could have been better. The alligator sausage po' boy was the highlight. The pota","useful":0,"cool":0},"amA-Fp4YIZPLrVmb_htUcA":{"text":"Oystermania.  Get shucked!","useful":0,"cool":0},"GfMgEZGqwcsNE3a64TH1LQ":{"text":"As an out of town visitor from Portland, Oregon, I found the beer to be very mediocre at b","useful":0,"cool":0},"28FAeX8xvQvZHk1dI-0sOQ":{"text":"Came here after a 1/5 experience at the Burger place next door that we walked out on. I wi","useful":0,"cool":0},"9cLN3JOiITJkui15zMLxoA":{"text":"Great food and service. A little pricey\n\nOrdered the ny strip which was very good but over","useful":1,"cool":1},"ndyiz5aElfXn7PB7x-7txw":{"text":"Stopped in for a sampler on our way to another location for a late lunch.  Place was packe","useful":0,"cool":0},"MYeSnNvPzeWCjqsk4WF9Vw":{"text":"This is based on the beer only.  \nI was surprised by the beer quality.  Most of the time w","useful":0,"cool":0},"afyC-askBIGgJdDZQKvYqw":{"text":"Go to the bar when Allen the oyster shucker is there! You will be entertained and fed and ","useful":0,"cool":0},"zNle8Ma37H0fU5UZWI_XQQ":{"text":"For a brewhouse, the beers are way off. If not for their tourist location it would be out ","useful":0,"cool":0},"qqfCBF2ERkC139LtGVmlkQ":{"text":"My partner and I had a good time here, sitting in the courtyard near one of the heaters, e","useful":0,"cool":0},"Urfe5MPcWgEW9BGKCc5vwA":{"text":"I had the ABSOLUTE WORST SERVICE at this restaurant!\n\nMy girlfriends and I were in town fo","useful":4,"cool":1},"WvNhXMvUV1xbrQFQRI2d3g":{"text":"Expected the good beer, but surprised by how good the food was.  My wife and I had the Gro","useful":0,"cool":0},"azT1RrJcWKju8nzuH4eEIw":{"text":"This has been our regular first stop in New Orleans and again, it did not disappoint. The ","useful":0,"cool":0},"vpOghUM6ju5cXRZSsy2lfg":{"text":"\"What is the difference between a pick pocket and a peeping Tom?\"\n\"One snatches watches, a","useful":0,"cool":0},"FO_zTwibiC4iUWMYA6tKzQ":{"text":"I had a bacon cheese burger and i could barely finish it. It tasted so bad. The beer was o","useful":0,"cool":0},"_qn4NSbMJ1sdVhUXIa6JzA":{"text":"I've been coming to Crescent City Brewhouse for years, but it's gone down hill. The servic","useful":3,"cool":0},"AJ5eO1r2V-9BX81j0CKIpw":{"text":"The beer flight is a great value and showcases a variety of good local brews. Staff is ver","useful":0,"cool":0},"7cejJGDSAUW2V20U4zu2nQ":{"text":"Great venue...open air..lively..great music, beer, oyster club is one of a kind. The home ","useful":0,"cool":1},"AlHP4mRFXGRZzGfU64iMyQ":{"text":"This was a pleasant surprise to find. This brewery has lots of seating, with an upper leve","useful":1,"cool":1},"ofrLH5dS8tIVQSHk_-epVQ":{"text":"After walking around all morning, we decided to stop in and enjoy a round in the upstairs ","useful":1,"cool":1},"3Dj27ncnOaAq9NQQ1_GFng":{"text":"Not horrible, but not worth the wait or price. Meh. On future visits we won't come here.","useful":0,"cool":0},"D6URZhUvTJWbVmYSsWIPlA":{"text":"This restaurant was a life saver when we were desperately looking for a place to eat one n","useful":1,"cool":1},"vTjwaOndepWKYyILR1xbPA":{"text":"Was looking forward to this place because they brew their own beer. Deeply disappointed in","useful":0,"cool":0},"roMOZV3YjHpbX6pz8EmEng":{"text":"This place was lameee!!! For a brewhouse and live Jazz music playing, this place had a sta","useful":3,"cool":2},"9UQUgNoR4qewdRYE534gLQ":{"text":"We stopped in for a couple of beers, and our expectations were exceeded! We've had the gum","useful":0,"cool":0},"yRVUFd8VY8893y8xteaVfQ":{"text":"Great atmosphere, awesome beer, and really delicious and well presented food.  I recommend","useful":0,"cool":0},"2m_qrgU7Wf5O6mQRLcn0sw":{"text":"Blah, nothing special unless you are just coming for beers, oysters and atmosphere for spo","useful":0,"cool":0},"RL3GjOpTyVU3M07BtfNHoQ":{"text":"Beer was warm. Food was ok but overpriced. Had a coupon from our hotel and they wouldn't h","useful":0,"cool":0},"kSgM8YN9vWMflNbdPh7YHg":{"text":"The BLT and home made chips were amazing. I had a couple of craft brews from their bar... ","useful":0,"cool":0},"n2Sv0E4AnVxp6RY5jix60w":{"text":"This place is AMAZE-BALLS! Seriously! BLOODY MARY'S anyone! Their food options were great,","useful":0,"cool":0},"kEIPnNykowbhQO2EInnctQ":{"text":"Came here with a group on a busy Friday night during the French Quarter Festival.  We were","useful":0,"cool":0},"-HB2l_m0exqCAmRDTYEBUA":{"text":"We just stopped in for a beer- the place was really crowded and there was live music, whic","useful":0,"cool":0},"-VM_2jNGIGS-BFivHadbyA":{"text":"Warm flavorless beer for $7.  Cochon de Lait po' boy was nasty and barely had any meat.  F","useful":0,"cool":0},"UiinlBEyk0sG46X32EbX9w":{"text":"Our server was really nice. The food was expensive. The beer was forgettable. Nothing that","useful":0,"cool":0},"W4v3fmGQ_eZdLiYaXE19Xw":{"text":"Worst meal we have had in New Orleans in six days. The waitress was rude and snarky. The a","useful":0,"cool":0},"8pQIDJHKXRL-Epsv4E9WpA":{"text":"The food was enjoyable, the beer was good, and the service was solid.  Ordered the fried o","useful":1,"cool":1},"O2m2DTQSYr2IUy0ba917jw":{"text":"I'm only one reviewer with a brief experience at Crescent.  Didn't care for the pilsner.  ","useful":1,"cool":1},"ubUExPthoGHkc9FXx3PzAg":{"text":"Good times. Great atmosphere, good service, food was good. The cheesecake with shrimp and ","useful":0,"cool":0},"NJinTiGEWby518j_ZqJ5cA":{"text":"I enjoyed this place. Granted I order a boring burger, nothing to shout about, but the ser","useful":0,"cool":0},"hjSw4ufDNbpfuqewqiM3eg":{"text":"Great food, the crab cakes were delicious, the salads were fresh and big and the roast bee","useful":0,"cool":0},"fdEYxvSk5ilTRK6OmyVkZA":{"text":"We were looking for a place to watch the game , served good food, and listen to live music","useful":0,"cool":0},"iMn2_ym76j3Aka0qMEwsOQ":{"text":"oyster club\navocado, bacon, dressed, with herbsaint aoli?  and parmesan fries?  need I say","useful":1,"cool":2},"IkiQoMs-Z0IPqnm1fLAKjg":{"text":"The French Quarter has dozens of places to eat and drink and it's hard to know which ones ","useful":1,"cool":0},"GWr9y-Q2HHZKZDionmrNOg":{"text":"I have had several good experiences at this restaurant, but the last was so poor I had to ","useful":0,"cool":0},"SKqoyHVgAS58q6KFxJiTjA":{"text":"Food was very bad drinks okay and okay service. Oysters were tough and shrimp were def fro","useful":0,"cool":0},"64XYZSVjF7W2q9KhxdHgFg":{"text":"When in New Orleans - and looking for good oysters - go no further than this spot.  During","useful":0,"cool":0},"H9Mq02Qi5trRZ59D1ZqOXw":{"text":"Great local micro brewhouse. Definitely a must stop for flight and pint. Each beer was ver","useful":0,"cool":0},"Ynb4y8QirAZLt43pThpNyg":{"text":"Stopped in for a beer. Decided to grab a quick bite and escape the 20 degree weather.  Gre","useful":0,"cool":0},"hYGrZrkrBfHZ89qQafmRVQ":{"text":"Excellent food and beer. We had Boudin Balls, baked brie, shrimp and grits, gumbo and crem","useful":0,"cool":0},"jMjZxvDZ8t3BBQYKAunjGQ":{"text":"My husband and I always go to a local brewery/distillery/winery if available when we trave","useful":0,"cool":0},"y5nsRMHTaf4UD-vPUYb_Pw":{"text":"The food the atmosphere was all first rate. On vacation I rarely go back to the same place","useful":0,"cool":0},"TAJ7B0j99kr9BL8RQCPwNA":{"text":"We just moved to New Orleans and this was our first trip over to the French Quarter. We we","useful":0,"cool":0},"IEoPIx_fmFurXz8jAiMt0Q":{"text":"Great location for a brewpub in the heart of action.   Had a couple brews at the bar on a ","useful":0,"cool":0},"D3HioWXzj7ECaip9a7w3Mg":{"text":"Great food, beer.....and music..... \nWe had Imperial Seafood Noodles and Southern Crispy D","useful":0,"cool":0},"MNXyXEMiWre8zJLWq7h9Eg":{"text":"I ventured down here from my hotel one night after I had been walking by this place since ","useful":1,"cool":1},"7GEVrEIh2b740oOGAFdo3g":{"text":"The smokies are excellent!  The Toulouse and the Cherise are great too!  Get the mixed gri","useful":1,"cool":1},"i-ETAzfss2yYItJW2xxziQ":{"text":"This place is so wonderful.  The first thing you notice is the delightful decor, with art ","useful":0,"cool":0},"Q-_eJ2To_VNb4WEMeKCyKA":{"text":"This place is (in a high pitched voice) AWESOME!\n\nCame upon this place very randomly, and ","useful":0,"cool":0},"GQ6JFmdbktqPn_CpT_-giQ":{"text":"For a busy section of the quarter, this place is well managed and a great oasis to chill o","useful":0,"cool":0},"dSKIdt9LFuG2FCtc9Tm21Q":{"text":"The beer is great, bartender is friendly, food is delicious! Very relaxing and chill. Not ","useful":0,"cool":0},"W36rSGKyAH6_22cifpOZ2A":{"text":"i was in town for the 1/2 marathon. Had the jambalalya and the red stallion ale. Neither w","useful":0,"cool":0},"hJYs3SqFrdg4XyAWLsS-cw":{"text":"first stop in NO- we all got gumbo and apps: alligator, the seafood cheesecake, meat pies,","useful":0,"cool":0},"7BhCXE4-q_SRHOlXSGHe2w":{"text":"This is my go-to place in New Orleans. A great casual atmosphere, and some of the best oys","useful":0,"cool":0},"boIArQOOnGsiBQwShH8izQ":{"text":"Stopped in with my wife for a couple beers. Really enjoyed the bar. Beer was decent, but n","useful":0,"cool":0},"BP_wZoUQhI3ikLLik1ANtg":{"text":"This was a great place. On the night that I came great live jazz band and oysters from the","useful":0,"cool":0},"38WuLbp7fddiMPmZpqbz_Q":{"text":"Nice place, very friendly staff, and great atmosphere. You know I had to try the beer samp","useful":0,"cool":0},"EMdb5EnHyyuGpnYu-hUb7w":{"text":"Live modern jazz for music, a nice change compared to the canned old-time standards elsewh","useful":0,"cool":0},"3t9PkRngiQbQ4DxqfdVtSg":{"text":"I don't know why it is 3 stars. This place is definitely 4.5. The seafood cheesecake and c","useful":0,"cool":0},"JL87wFpXLjuai_5e1UGtOA":{"text":"Best meal of this trip to the French Quarter.  Cory was a knowledgeable waiter.  Very atte","useful":1,"cool":1},"0CJtp_Pe7qo_xwvGrqdg7A":{"text":"Cool environment and good options on the menu, but not the best food in New Orleans. Many ","useful":0,"cool":0},"9G9mtBNK9gachNtg5kdufA":{"text":"Best gumbo in had in NOLA. Good beers too. Get the potato salad side and mix with a the gu","useful":0,"cool":0},"gq_b_340Q3Fu1M-4aeSGQA":{"text":"Very good service Brittany was amazing and even  gave us other local recommendations. Woul","useful":0,"cool":0},"uQFmMxcdWdDiG3l1muAXhw":{"text":"We had a very nice dinner here, upstairs on the balcony, My shrimps and grits were delicio","useful":0,"cool":0},"r-MW9nwiVmY2GczKniWLAA":{"text":"I  was excited about tasting the local brew and hearing some jazz, as it advertises it's a","useful":1,"cool":1},"zgTZ7a1DAkqGxk1-htfs9g":{"text":"Service was horrible. The waiter spilt a full beer on my friend... didn't apologize or try","useful":0,"cool":0},"1SOfjjlVMp2Bjgw44nbBFA":{"text":"I only gave it 3 stars because all I beer and osyters. The beer was great, they brew their","useful":0,"cool":0},"gJQQ2mdMGrANpNjMvbNqZg":{"text":"\"And you'll be left with the proverbial wish....that you were never born\" ... Amanda from ","useful":1,"cool":0},"9ErAc7xXxdzG8f0yZLX9RQ":{"text":"Omg.  I love this place.  Don't want to embarrass myself for gushing.   We always get seaf","useful":0,"cool":0},"gkS866i4FIx-J63J-DSwWA":{"text":"Fantastic fall off the bone ribs. Walked right in on a Saturday night with no reservation.","useful":0,"cool":0},"M_78cMCcoRQJPWaQjSMMFw":{"text":"Place was above average. \n\nWent in with 18 guys for a bach party. Food was really tasty. B","useful":0,"cool":0},"WBxcn4iVbxMwO3683lsVvw":{"text":"I came here with some friends and we asked to sit on the balcony. They said we had to orde","useful":0,"cool":0},"efH_pPLuM4wDw6nXadRUqw":{"text":"Service here made it a worthwhile spot. \n\nHowever, when the food isn't memorable, an A-OK ","useful":0,"cool":0},"QFT9FevkvQf7g8chp59hcQ":{"text":"We stopped here after our tour guide from the Hop On, Hop off Bus Tours suggested we check","useful":0,"cool":0},"by2LUSY2QZ1J5cQxeFBfbA":{"text":"3.5 stars\n\nWhat drew us in - a live jazz band playing good music and they are serving craw","useful":1,"cool":1},"NRSV9rONrYZo0U9w9Zy-mA":{"text":"Weiss very good. Light for a warmer day. Smooth. I can taste just enough spice. The balcon","useful":1,"cool":1},"tjI0BcdqXajeNTXTefa_Hg":{"text":"After a visit to the French Market, we stopped off here for lunch. \n\nI got the prime beef ","useful":1,"cool":1},"gI3h6L72qZ-G81y6Zg_BVQ":{"text":"Good ambiance good beers, live jazz, raw and baked oysters were tasty.","useful":0,"cool":0},"WZfoAAH8GpqcsF01CfnkVA":{"text":"Can't go wrong with this American traditional food on a busy street in the French quarter.","useful":0,"cool":0},"PR8_QJJS5sUzUhEGGg2ldA":{"text":"Just stopped here for a beer and some cool shade from the heat. Nice sample of house brews","useful":0,"cool":0},"s6hXK3AfXLxRfk5GJh4g8Q":{"text":"Great place to stop and get a beer. Good selection of beer to choose from depending on you","useful":0,"cool":0},"-l6azt2WZon8oqYITHE2Ew":{"text":"Ehhhhh food is okay. Waiter was somewhat attentive, but had to ask for refills. Wouldn't g","useful":0,"cool":0},"3m7rR1sZ2GHavPAkzmICyw":{"text":"Came here as a large group for a bachelorette party. Definitely make reservations early so","useful":4,"cool":1},"YH5Sg6JuN35x16nejCvTVA":{"text":"Everyone talks about acme oyster house and how amazing it is.... no no no! This place has ","useful":0,"cool":0},"Bph2I_sZkvmtWcEtj4maaA":{"text":"This place turned out to be a pleasant surprise & am grateful they were able to accommodat","useful":0,"cool":0},"ydaeq7c21ovlqFllIq5gSQ":{"text":"Advertise balcony seating, not open. Advertise courtyard seating, not open. Seat us in a f","useful":0,"cool":0},"77FpXS_dSpg1tH83lDJisQ":{"text":"My wife and I have never been here before so we decided to try it out. We ordered the Ribe","useful":0,"cool":0},"xfYCHqZDLA8tY7dhLZNmYA":{"text":"I enjoyed the food very much, and we went on a night when there was live music playing whi","useful":0,"cool":0},"URjjUJxPmB96mK02qsr7Uw":{"text":"This is the first restaurant I went to when visiting New Orleans. It came highly recommend","useful":1,"cool":0},"r3hDoQHncYMqvD5ENK-UGg":{"text":"We had the boudin balls as appetizer, red fish, and southern duck.  The duck paired well w","useful":0,"cool":0},"pNtjSIk0wNrvPyuGkLfPeQ":{"text":"Went here because it is a brewery with live music and is kid friendly. We were not disappo","useful":1,"cool":1},"BMoQNR0_O8XZVPqUBNk5tw":{"text":"I want to not like this place. It is touristy. It could be tacky. And the menu is unexciti","useful":3,"cool":1},"O56LVtvq6CtqTebYChbsGg":{"text":"First time eating here at CCB and I will definitely be back. The gumbo is to die for and t","useful":0,"cool":0},"xhWdSlFw4WwjmplratrR5g":{"text":"Just wanted a quick lunch and found this place almost empty. Nice change, since most place","useful":0,"cool":0},"sNjBQSpcTMWi_nBt1RXL6g":{"text":"Stopped in on a rainy day. Got the 5 samplers. The Pilsner and Black Forest were ok. The f","useful":0,"cool":0},"SHCSNKvsTOnAYAspd8gatw":{"text":"Today was hydration day to help us recover after last night, so we didn't have any beer. \n","useful":0,"cool":0},"qOqrbAcVn3BAugAHACxIOQ":{"text":"I had the wings. They were delicious. Had the Weiss beer. That was awesome. Other people o","useful":0,"cool":0},"fAYBtqSdeIA_Ez0QgFm0LQ":{"text":"Shrimp and grits were fantastic. My dining companion really liked their house beer. Very e","useful":0,"cool":0},"VOX3QvZEuVTmOKjaA9cVGQ":{"text":"It was somewhat quick and it was kinda great for groups but overall it was costly for exam","useful":0,"cool":0},"DGHu2WpFY_-KAUGvCxS4qw":{"text":"Their beer selection was wonderful. The food was also very tasty and filling. The oysters ","useful":0,"cool":0},"h1cIcYDRAPM_LQ0y3xgMUg":{"text":"Enjoyed this brewery. Dropped in during a rain storm. Got a flight and a dozen raw oysters","useful":0,"cool":0},"eIuyrsFz4cM72nACqWZyOA":{"text":"Great beer and amazing seafood. We had a dozen of the huge oysters. They were very fresh a","useful":1,"cool":0},"7zo4INJqBDjxqEFYAyoFpg":{"text":"The German sausage and rack of ribs were awesome. They make THE BEST Mac 'n cheese. Beers ","useful":1,"cool":0},"y4k1w-jjmNPvKBml_ZJ_zg":{"text":"We checked this place out mostly because we like brew pubs not out of hunger.  I would con","useful":1,"cool":1},"r3cFlH5B7iniJ8uIF-rAcQ":{"text":"My husband and I enjoyed our lunch here and the atmosphere, food and beer were all 3-stars","useful":0,"cool":0},"lwuVHkX3gNb1vpoHjeZ0ZA":{"text":"We're both home brewers and foodies. When on vacation, we regularly tour breweries and eat","useful":2,"cool":1},"32mpj-J2FAyhBSYe58TyQQ":{"text":"Four of us dropped in for a late lunch on a Saturday in April. The weather was sunny & war","useful":0,"cool":0},"5-gJcKBUVRs8-xEWS0fbqw":{"text":"Not bad at all. Beers are great. Wings are a buttery based sauce. Awesome if you like prob","useful":0,"cool":0},"Jt8deqDEursnQ8MjRBfq_g":{"text":"Didn't expect this good of food from a \"Brewhouse.\"  Not typical pub food...very good!  I ","useful":0,"cool":0},"dbLLVrqb538Kpcx-GsHsEg":{"text":"Stopped in and sat at the bar for a few beers and some oysters, hoping to cool off from a ","useful":0,"cool":0},"GYqat6-Rqvt4CPETdRBcvg":{"text":"The beer, lager in traditional German styles, is less than spectacular. It's about average","useful":2,"cool":1},"PLvlyyToCQmOxirUpnaLBg":{"text":"Went here for appetizers and drinks. They have a house band that plays beautiful jazz each","useful":2,"cool":0},"Kb--SDO-kedkW5J5xRdNjA":{"text":"Nice little brewery/bar in New Orleans. Beer was okay, with live music in the corner near ","useful":0,"cool":0},"URcv1WAPQs7I0C9RANYk5w":{"text":"Crawfish mac and cheese with tasso ham. That is all you need to know.  Eat upstairs on the","useful":0,"cool":0},"RQTldLlZG1xutNZV9_6jrw":{"text":"Had to check this place out by suggestion.  So happy with the decision!  While the Brewery","useful":0,"cool":0},"HvC1fG_DuB3fZJkSLO_duw":{"text":"Hmm... where do I begin.\n\nComing here was my boyfriend's idea. I work in the French Quarte","useful":2,"cool":1},"lNvV_8sBoNhG5OTHFPmPzw":{"text":"The beer selection is pretty tame.  They only have about 5 different styles, but at least ","useful":0,"cool":0},"R4eEPRYB0W_LKSy2DeKcsg":{"text":"Crescent City Brewhouse has really large, tasty beers that are brewed on site. The restaur","useful":0,"cool":0},"hlTyHF1DoTCcmbajIkvPGg":{"text":"Not bad for a tourist destination. Of course their beers can't be compared to those of Nol","useful":0,"cool":0},"NyJdK-b4tPa0DsT2wQXTzg":{"text":"It's the only brewhouse in the French Quarter.\nWe only came for the beer although it's a f","useful":0,"cool":1},"I2snucq7LypiIYE8W1pMVg":{"text":"Just left this place 5 minutes ago.  The bartender upstairs was rude and had an attitude l","useful":0,"cool":1},"jDZqJpTwsPzAmq3M8EhmgQ":{"text":"Had the red stallion beer, which was pretty tasty,\n\nHad (for the first time ever), a savou","useful":0,"cool":0},"D971-2FKAM5pPMYMpgUruQ":{"text":"We came here with Nola Beer Tours and tried the sampler as well as some delicious appetize","useful":0,"cool":0},"kprNPE0Q4mV0rpV46O8tcA":{"text":"Great place for lunch/dinner and to just pick up a beer to go. The service is excellent. O","useful":0,"cool":0},"5nSW5nvzesNVlyEYfkNgNA":{"text":"I don't think anything was super great, but also nothing was super bad. I do like the fact","useful":0,"cool":0},"Ca_nEjxaFnxelfZqvpGXRA":{"text":"Stopped here after getting a buy one get one free from the hotel we were staying at. We go","useful":0,"cool":0},"edaG6S4EviJ1Ykrw5rAmSA":{"text":"We stopped here thinking they would have good beer and good food. Wrong on both counts. Al","useful":3,"cool":2},"Oz-rdpcZeA4hS1M66BLEfA":{"text":"We had the fried alligator and it was amazing. So good. \n\nWe did not have a full meal so I","useful":0,"cool":0},"ZHfFYPtY_63VPNXk6jU9Sw":{"text":"We, my friend and I, chanced upon this place and I'm so glad we did. We each got the beer ","useful":0,"cool":0},"lPF1pw7GL8QlthmeW75csQ":{"text":"A nice spot for a New Orleans lunch. The balcony is a great way to get up above the crowd ","useful":0,"cool":0},"DG853r5TBvA_zlrW1Z5IiA":{"text":"The food was excellent. The beer and service were better. If you get there early on a nice","useful":0,"cool":0},"VovW76Kxu6VimCyO4eEEaw":{"text":"We ate here in January and it's my second time at the restaurant. The food is good. Baked ","useful":0,"cool":0},"tK_lFNe6oFXtaXIS7OfYJQ":{"text":"Stopped here with the family after touring the French Quarter.  Good food, excellent beer.","useful":0,"cool":0},"0Rkr4tvMctPBamfDmBEpmQ":{"text":"The food here is not good. Cookie cutter tourist trap near Jackson square. With all the fr","useful":0,"cool":0},"7HSZCYlie_shZKCttoOdgQ":{"text":"My husband and I had not only great brews, but also great food. While they don't have an e","useful":0,"cool":0},"sWMosbhpG7e-4JzvaFI5lQ":{"text":"Solid brew house food and beers. The pasta jambalaya was amazing. Also tried the alligator","useful":1,"cool":0},"_QEWbZ0yvU6kdkCynwCe9Q":{"text":"So far one of the best restaurants in New Orleans that we've eaten at so far. The food was","useful":0,"cool":0},"bhIiUyKqsKyI7SIeljc1kA":{"text":"Friendly staff, has an oyster bar my friend was really into but oysters aren't my thing. L","useful":0,"cool":0},"qGu6-USZVI24WMAJxXr80A":{"text":"Crescent City Brewhouse was right next door to our hotel,  so we didn't travel far. Howeve","useful":0,"cool":0},"57EsNlSUspQfZs87qewW5Q":{"text":"Positives: wings are good\n\nNegatives: seafood not great.  waiter said a lot of stuff is fr","useful":4,"cool":1},"YwtIZVqnPvOAS5zZJr-Mig":{"text":"Went here for a light dinner with 3 friends. They had the sampler of beer and a few drinks","useful":1,"cool":0},"zCAkd3aiWDqhMtV9k6aTIg":{"text":"Good food and good beer for a lazy last day in the Quarter.  I got the IPA and enjoyed it ","useful":0,"cool":0},"NA_sO03it2WaGpBIqb0TEQ":{"text":"Walked in to have a beer, sat at the oyster bar without even thinking about it... Was hand","useful":2,"cool":2},"DjhybBnNeusKyhH-1Fcizw":{"text":"Had a fantastic meal with great freshly brewed beer. The oyster club was so amazing and th","useful":0,"cool":0},"LmNN4zKAU9KO_OYi-LpS5A":{"text":"I have been here twice for lunch and had excellent experiences both times.  The outdoor pa","useful":1,"cool":1},"Kut-pGom-hmaJHw5Xk8TKQ":{"text":"One of a very few places on the touristy Decatur that is good. The in-house brew is very g","useful":1,"cool":0},"Kq-enu4osGPSHLbLqYZ9Jg":{"text":"I remember liking this place better a few years ago.  Not that anything here has changed, ","useful":0,"cool":0},"X258G2T-mdQKNhF2V73FMg":{"text":"Went for drinks on a hot day. Sat at the upstairs bar which had a great view. The Red Stal","useful":1,"cool":1},"ZJ344PKKyPUQl2WrhV9kIw":{"text":"I was so pumped about this place originally, despite mediocre reviews, because I come from","useful":1,"cool":1},"pgVWjkubtcmInxHDuhlmWw":{"text":"Stopped here on the recommendation of the concierge at the Sheraton.  She said she had eat","useful":1,"cool":1},"XY40WiHi5e01wWVAkDz9fw":{"text":"Do NOT waste your time or your money here. My boyfriend and I were visiting NOLA from out ","useful":0,"cool":0},"0snMU0W6HScZm8KwhBwY2g":{"text":"Made a reservation for 5 people and was seated right away upon entering the restaurant in ","useful":1,"cool":1},"S0V7oLyFZgsVl3gO1Pa3DA":{"text":"My craft beer junkies love it here. Great live music and a beautiful bar. I can come here ","useful":0,"cool":0},"7Npmzp6PNHq3hTGABT9qjQ":{"text":"My husband and friends love this place. We went today for the second time. They say that t","useful":0,"cool":0},"DOaHNtYz_2vKk4mpSlX7VQ":{"text":"They brew their own beer, which is braggable.  The sampler seems to be everyones favorite,","useful":1,"cool":0},"hJI2m64RbG6ntJiOiw5nNw":{"text":"We came here last time we were in New Orleans a few years ago, and the last time we were h","useful":1,"cool":0},"LPovTy-R5emQmh3sAkfN_g":{"text":"Foods meh. Service sucks. Beer sucks. I want to get the hell out of here and yet we wait a","useful":0,"cool":0},"UhyZi97-pZIa_A2GPoZRVA":{"text":"We walked past the place, thought it looked intriguing but said we'll walk around a bit mo","useful":1,"cool":1},"9qpV7SuErtVPbiLf2wGmXA":{"text":"Came here for some grub before heading out and I was not disappointed in the least. I was ","useful":0,"cool":0},"e40VpR_Nq-lslGaq20hSGQ":{"text":"This was the first restaurant we tried in New Orleans. Overall, a great experience -- it h","useful":0,"cool":0},"bwfclguQr0q5rQ4o5t1Lhw":{"text":"The selection on the menu was okay, but not as good as I expected, given that this place w","useful":0,"cool":0},"LdntSUGkqja3eQoeq279ug":{"text":"The Cochon de Lait is bravo! Feels like eating an authentic Puerto Rican \"Sandwich de Pern","useful":0,"cool":0},"4KS7yVKEqOvWxeldZJi5bw":{"text":"Was visiting the French Quarter Jan 7-12, 2018 and had the pleasure of eating at the Cresc","useful":0,"cool":0},"22MaB5_Mc5VT0kxgWbUr7A":{"text":"We usually love this place but this time we had a TERRIBLE experience. Worst Bloody Mary E","useful":1,"cool":0},"K3PvSEBXLrFlMgv0YGf2wg":{"text":"It seemed like a nice place at first.  However the beer sampler was some of the worst ever","useful":1,"cool":1},"AWhlW9ta6Yhe7tCbQmQrow":{"text":"Great little brewery with an equally great restaurant in the heart of the French Quarter. ","useful":1,"cool":1},"y6yaoY9GI7JSH5SzN1bBCQ":{"text":"a solid place to grab a beer and some appetizers.\nthe oyster club was quite good.\nthe balc","useful":1,"cool":0},"3uPP3n2C3tlwkXAzuqq4WA":{"text":"We tried the 5 beer sampler (they were out of the seasonal). They were all your run of the","useful":0,"cool":0},"XhJiirxn4D49I1vmyMEwwg":{"text":"OK place to kick back, slurp on something after work and watch the tourists to get a laugh","useful":0,"cool":0},"626FVOCgSQ0liCVtCMum5g":{"text":"The beer is great. My friend had the flight of beer and loved it. The wings were flavorful","useful":0,"cool":0},"TSNFRB9zQy6YQFySr4Gv9Q":{"text":"A must stop spot if you're visiting NOLA! The oysters were amazing! Service is quick and f","useful":0,"cool":0},"mx4gTi7NLwUMN4aPv5AojQ":{"text":"We came here today for some lunch and the beer sampler- $8.50- my boyfriend enjoyed most o","useful":1,"cool":1},"XS1l2kZ7pXte1tIFjBMuDg":{"text":"Good beer, skip the food.  \nOr at least skip the non-shellfish food.  I don't eat shellfis","useful":1,"cool":2},"0nDpBOJtT_qTmrdlW9Wg4w":{"text":"Great place with solid brews and good food. We had reservations for a big crew (12 people)","useful":0,"cool":0},"ZksD2syf8XdPhVQZHc_k6Q":{"text":"I went here the other night specifically for the balcony.   The whole time I felt like a t","useful":1,"cool":1},"q5riErD-cCsts6inbzFtMQ":{"text":"We visited on our first night in New Orleans. The bell hop at our hotel suggested it, we w","useful":1,"cool":1},"SRqC9NvuooG9lFo-gtzvDA":{"text":"Service was great !  Food was so good ,  flounder on flat bread was like something I've ne","useful":0,"cool":0},"bqGJrg2EpqlJTTbJBAeV_Q":{"text":"Average quality beer, below average food. I had fried chicken, my wife had a shrimp po' bo","useful":1,"cool":1},"ewdiu1ZgWKaXYm3jqcZBrg":{"text":"Not worth the price for below average burger that was well done when ordered medium. Oyste","useful":0,"cool":0},"1FAIps1sQUkjutckPQtgzQ":{"text":"Microbrewery / Restaurant for sure.  I was excited to try a new place to me, we went on a ","useful":1,"cool":1},"xxu4SY-XEfWgzeej0jpxBg":{"text":"We got a flight of beer- tried them all, even the seasonal.  The beer was meh.  Nothing cr","useful":0,"cool":0},"bwFuwAl3jUBlwXZ_JZiG9Q":{"text":"Came here on a saturday with some girl friends.  Now we aren't from new orleans, but we wa","useful":3,"cool":1},"iSPFIpoWRTExzzmLBWPREQ":{"text":"Came here with another family while in town for a volleyball tournament.  The girls hostin","useful":0,"cool":0},"b8lx1C_onbouNreF8GODzw":{"text":"It's been several years since I last ate here. My previous experience wasn't great- the fo","useful":0,"cool":0},"gYD1SuYyQRRLouaV8OrKjg":{"text":"Stopped in for a snack and a drink. Sat at the bar. It felt rushed and service was a bit l","useful":0,"cool":0},"oRZuwEMg1JUJT0ITFXRTVw":{"text":"Decent establishment .  Real jazz overhead. Sitting by the bar with the pot stills in the ","useful":0,"cool":0},"d6wdm-pXgMOILvzZZ33v0g":{"text":"I've been traveling through Texas and Louisiana the past few weeks and have been trying th","useful":0,"cool":0},"43XXoPQTpN4NzZ_Dm5MDmw":{"text":"Daniel was a great waiter. Shrimp poboys were highlighted when adding cocktail sauce. My s","useful":0,"cool":0},"kwt7DloJG05M60Y4X5beIg":{"text":"I kind of feel like the word \"meh\" is overused these days, but can't think of a better one","useful":2,"cool":1},"wim3pSY5V0qrfR517O7FfQ":{"text":"Highly recommend. Large bar and restaurant. Well-lit inside. Loud and poppin'. Live music ","useful":0,"cool":0},"imQXAhYaR7SSN2JPsygS6w":{"text":"This was my first restaurant in NO....luckily my trip got better! I wasn't impressed with ","useful":0,"cool":0},"d2qwRV-0HLusvkkcoiAZGA":{"text":"i'd give the food only 1 star, but that's more my fault for being a picky vegetarian than ","useful":1,"cool":1},"kmJrGxANXjXva8Reczw4XQ":{"text":"Probably my least favorite place in the French Quarter area.  Over priced and slow service","useful":0,"cool":0},"4fA1uaJFO7Z977iaqVZwDg":{"text":"run-of-the-mill food, and average beer.  Way way way better places to go while in the Fren","useful":1,"cool":0},"D0IuvR4ICyYBHnWpzBDHjA":{"text":"Great beer! Seafood cheesecake was amazing! Service was on point. We sat on the patio so i","useful":0,"cool":0},"fyk0lUqXmKfWMAeR4F4JtQ":{"text":"Benn'a was a great waitress, as we enjoyed a wonderful atmosphere and really great food an","useful":0,"cool":0},"NMkPNWyY4qxfESei6tCy9A":{"text":"At the Brewhouse for a drink and snack.  Needed something to drink so decided to grab a sn","useful":1,"cool":0},"DuQ4Xsiwpu0CCCp0YX53zA":{"text":"I wanted oysters, my friend wanted a burger, and our other friend wanted live music =Cresc","useful":0,"cool":0},"0MIWvll176ALeV4-NK3LpQ":{"text":"Good beer! I loved the Weiss","useful":0,"cool":0},"B5CsWph1qV7KONzuFrPTFw":{"text":"I've been to Crescent City Brewhouse a few times over the years and usually on my last day","useful":1,"cool":1},"ANrMRMLGbOAcypolqDwGww":{"text":"We went to check out the local brew. Beer was good. Staff was friendly and helpful.","useful":0,"cool":0},"b7sVrTeQwP8Xxv7EA8ZqCg":{"text":"This place has a lot of potential - I love a place that brews their own beer, and a glass ","useful":1,"cool":1},"kX7slRU5EWIXL9WliPbRAA":{"text":"If I could leave a 0 star review, I would. We visited this place around noon on January 1s","useful":0,"cool":0},"nVRh0MZu5a3TKk1SWs_ziw":{"text":"This restaurant had live jazz, fantastic food, great service and ambiance. We spent the we","useful":1,"cool":1},"nCvGtKMfHBus8IsLCSMi0g":{"text":"The beer tastes weird and is overpriced. The service is among the worst I have ever experi","useful":1,"cool":2},"wGqxbrZ2YI66XYlf_qEAYA":{"text":"Exceeded our expectations. Stopped in for a beer and quick bite. We got the wings and the ","useful":0,"cool":0},"ygUgz8ce7eHOUofL4BTbPQ":{"text":"Great service and OK food, but the beer? Meh.\n\nI had a BLT, which I assumed would be on th","useful":0,"cool":0},"eOzh5dkZ-y0CEbb6oNtaiQ":{"text":"I had originally visited many years ago when it was a relative newcomer.  Returned last we","useful":3,"cool":0},"pWV3HXtl18llgwbfx5XB_A":{"text":"Stopped here for a late dinner with a few friends the first day of our trip. We ordered a ","useful":1,"cool":0},"IhErnkE63r7nwQ7nRFBITg":{"text":"Beer at the bar only (oh ya and shrimp beignets which were tasty).  I had the weiss and en","useful":0,"cool":1},"Kh189y_cX-TqvgQGV70vLA":{"text":"Went here on the recommendation of a friend. It was a Saturday night and they had an ok ja","useful":1,"cool":1},"l-rgCxt_Sn6h-8h3BL0DIA":{"text":"Crescent City Brewhouse can be described like this: the beer and everything else. If you'r","useful":1,"cool":1},"AjMYEeX-_eb_aPZ0a7fr5Q":{"text":"We've been stopping here for a beer, oysters, lunch or Bloody Mary since 1996. I used to r","useful":3,"cool":1},"5tIO_nuHfPwX9Z44pnDEuA":{"text":"Seafood cheesecake and stuffed shrimp were both delicious. Friendly server and great live ","useful":0,"cool":0},"JOuPMh_8XemXKyxKUtx-Ng":{"text":"We are here last night.  Food was good and I really enjoyed the beer flight.  Our waitress","useful":0,"cool":0},"Uhd3K5a2p4qumS5RMpRkJg":{"text":"Christmas Eve, walked in to eat dinner, sat at the bar as they were kinda busy, asked the ","useful":1,"cool":1},"RnrgOCyYF-HYqi10kLxfqg":{"text":"Awesome experience today with excellent service by Caitlin. She was super friendly, excite","useful":0,"cool":0},"fOlOsl6eh-Ehzm046ljVGQ":{"text":"The brewery had an awesome vibe but Denzel is by far the reason we are coming back! He is ","useful":0,"cool":0},"4mcPl3ItpXW3hvOc1G3SdQ":{"text":"This is  the third time we have eaten at the Crescent City Brewhouse. The beer is excellen","useful":0,"cool":0},"FOUmMDV9iyzmMEehRFn1rA":{"text":"Get the shrimp & grits! I haven't found another restaurant in NOLA (or TX) that makes them","useful":0,"cool":0},"JJSjLhahJ31eeGz8B1mZlg":{"text":"I see all these pictures of seafood, but don't sleep on the wings!!  I don't like buffalo ","useful":0,"cool":0},"tNWHUqqk7_UERLw8XG7exw":{"text":"The grilled shrimp are amazing! Some of the best I've ever had, even living on the gulf co","useful":0,"cool":0},"jPh1urQ1TtzY3tk864ziSQ":{"text":"Crescent City Brewhouse has been around for quite a while and one of my favorite places fo","useful":1,"cool":0},"WMUoyWYqEPyaFYnJNVbHJw":{"text":"We stopped here for alligator bites and beer.  They had a good jazz band too.  I liked the","useful":0,"cool":0},"R43hYlCVCG3HpIPUMJTcFw":{"text":"great deals on beers. always a seat available. i just wish they had a better selection of ","useful":7,"cool":5},"GXWFa93TiqivNXYC9mU-dg":{"text":"This place totally surprised me. I had originally came in just to get a beer as it is a br","useful":2,"cool":0},"EoeQ9KXwzEyMUCoGZUFSfw":{"text":"The food was food. The beer was beer. That's the simplest way I can describe it. I wasn't ","useful":0,"cool":0},"tPLh_PspgGIkcCtAAKaWjA":{"text":"I am not a fan of this place. I was excited to check it out and try a new place while visi","useful":2,"cool":1},"4cLbFhb1ppaK5bQuGX-MwQ":{"text":"The beers are a little pricey and they're not always that good.  The interior is nice and ","useful":0,"cool":0},"mzMdXGRDbDpERHaW2Hqthg":{"text":"Terrible restaurant.  Came to watch a football game and they wouldn't put the game on the ","useful":0,"cool":0},"e23A2HeAqiyRD2lh0T1mSA":{"text":"Enjoyed our lunch our first day there. Beer was good, food was good, and service was good.","useful":0,"cool":0},"7osP7VuwVk35WpASepAfEg":{"text":"I was in the market for a descent night out/dinner for a few friends at short notice while","useful":0,"cool":0},"kz2cUeoeGJVE8qHWjJFvow":{"text":"I am sorry but the beer is meh... The location is great, the service was very friendly (th","useful":0,"cool":0},"zq71Zrczyj2uHCoQ81yWPg":{"text":"Pass. Have a glass of beer to rehydrate and keep walking. Food is room temp and just taste","useful":0,"cool":0},"kK9Dy987aN9CBH0toOHcNQ":{"text":"What can sum the food up, average. \n\nWe ordered the southern fish tacos, garden salad, and","useful":0,"cool":0},"lsg11wS-xYf35h1Ln250uw":{"text":"Nov 09, 2009\nOkay.... A bit pricey and in house brews are okay.. Then again it is the Fren","useful":1,"cool":0},"0xTarZIFtTGwEp5eU9lKLQ":{"text":"Easily the most disappointing meal we had while visiting New Orleans. The pulled pork sand","useful":0,"cool":0},"W8BUf57jU04N9lGcFx1tZQ":{"text":"I've only been here twice but always had great service. In my last time there I had alread","useful":1,"cool":0},"b0aJgevlpK4Jdj0JM7IKZA":{"text":"Great food, good beer and great service.\n\nThe food was delish, I tried the soft shell crab","useful":2,"cool":0},"zHN04IESHLx8XZMI39iQPg":{"text":"First brewpub of the trip and a solid choice. Despite a busy Thursday night on Halloween w","useful":4,"cool":2},"rPd1-Ql2InZ27guJnZNtXw":{"text":"Omg what a great time sat at the bar Allen who shucked are oyster for us was amazing we ha","useful":0,"cool":0},"EJWrCaxC0k27yPwTm1daIw":{"text":"I picked up a buy one and get one free coupon from the tourist information office.  I orde","useful":6,"cool":6},"TSnh7OQxQK3UcmTtKAD98g":{"text":"Allow this to be your splurge. Micro-breweries are fun to visit, but very particular to in","useful":0,"cool":0},"TE4tZBnL1evAkMrHnLUI-Q":{"text":"Their in house brewed seasonal boch was very good. The BLT was a nice take on a classic wi","useful":0,"cool":0},"7LZiaRNEh6fnRUkbwKoG0A":{"text":"Woah...amazing jazz and food in the midst of the French quarter fest madness!  If u know m","useful":1,"cool":0},"feDl3YKQvLxu5pQDl7yfww":{"text":"My husband and I will walk MILES just to make sure we stop by this window and get their ph","useful":0,"cool":0},"_B5BfY5Y3NPB4N1zPTlu9g":{"text":"I was recently staying near Crescent City Brewhouse, so it was a convenient place to grab ","useful":0,"cool":0},"1inUfHwDaFzSVuVfH8dk_g":{"text":"An Okay place! Service was okay! \n\nMac & Cheese was good! \n\nSandwhich was okay.... \n\nTo be","useful":0,"cool":0},"ug_Qy--cD2EJoOYNU6s3ag":{"text":"I'll be honest, I went here because my cousin works here. And I wasn't enthused at all. Fo","useful":2,"cool":1},"X5BwcBVF8McuW9yo2RuQfQ":{"text":"Wasn't feeling this place!  Beer was not good and we ordered a flight.  There wasn't a bee","useful":0,"cool":0},"15zNPO-IG9QpQhDFLZHpqA":{"text":"2 levels. Nice balcony. Live music. \nPatronized on other trips. Always sat on balcony whic","useful":2,"cool":0},"ysnBSqv5CCgaupNGj5CWzA":{"text":"I will start off by saying I am a local who has been to the Brewhouse many times over the ","useful":0,"cool":0},"Jn7MyJQSOMuUMhiLGjgvgg":{"text":"A group of us came here two nights in a row for great appetizers and beer and a solid hous","useful":0,"cool":0},"vteh8xc-rtC2UVlSOmPCDQ":{"text":"Great food and even better service!  Try the wings they are fantastic paired with the Pils","useful":0,"cool":0},"G3qyNQzwHbtGdvKbWzSUDw":{"text":"Awesome place for a quick bite. Nice selection of beers. Food reasonable for the area. Sta","useful":0,"cool":0},"bDQTwbsQGiClvL0Gfrw4dg":{"text":"Stopped by with the kids on Tuesday in search of cooked oysters.  Walked in and was told t","useful":0,"cool":0},"JiwP2dyMhWmPuSek8XsnVA":{"text":"I ended up at Crescent City Brewhouse twice during my trip to New Orleans. Between the thr","useful":0,"cool":0},"htQUU-4zadQj3kE0ZzPp7g":{"text":"Great NOLA vibe, solid beers and great NOLA food. Jazz band in the evening, super cool atm","useful":0,"cool":0},"AZDVuZub_SPdT-yse16FYA":{"text":"I wish I had checked online before walking in here. This place is an overpriced tourist tr","useful":1,"cool":1},"klIxKhatLCxYWmnZs103wA":{"text":"We were there during the water outage, so we couldn't get tea or fountain soda.  They prov","useful":0,"cool":0},"ZxCdXH1wEVyWnLapzbTNPg":{"text":"Ok, so the negatives first:\n\n-- I didn't like the beer. Sorry, maybe it's just me. Somethi","useful":0,"cool":1},"3R11rzXEXwdIahwJXLD-ag":{"text":"Very friendly bartender Richie. Had the fried alligator and wings. Both were delicious. Dr","useful":0,"cool":0},"PpLLROns6FXenhpJ6vGAGw":{"text":"Great atmosphere and it saved my life...or at least this brewhouse saved me from the heat.","useful":0,"cool":0},"iHKtoRu2f5EqPFflhURclw":{"text":"If you are a beer lover I think this is a great place for you.....if you want a good selec","useful":0,"cool":0},"lW_G10uAfF5BBiCsPTeTJg":{"text":"Great beer. The guy doing oysters made sure to find a half dozen nice oysters among the fe","useful":0,"cool":0},"dZof-R7rtQ1lM9UtMuCOSA":{"text":"The food was fabulous. Had a mish mash of sides (ratatouille, crawfish dirty rice, alligat","useful":2,"cool":1},"9v-NAlYK-ybAg442dFRTIA":{"text":"We stopped in to try the craft beers. I got the Sampler including one of the specialty bee","useful":0,"cool":0},"gIbZdMalGdTLza54mS_lmQ":{"text":": although this place doesn't have a fancy French name like most of the restaurants in the","useful":0,"cool":0},"30RrIx5FuIHJxugABwB3fw":{"text":"Well I definitely will not be returning here. We waited forever for the food and when it f","useful":4,"cool":1},"eqngi7G4LM2wSErebyCExA":{"text":"This was horrible. My fish was smothered in mayo sauce and the pilsner was dry and tasted ","useful":2,"cool":1},"y531R_rusWCjsyTR-fsTmw":{"text":"Nice beers and a delicious Brie appetizer. Good bartender and jazz band that's not too ove","useful":0,"cool":0},"oZVQuuo4u_YkqDAzGQYNTw":{"text":"The atmosphere is fun, but there beer is just OK. I prefer Abita and wish I had a chance t","useful":0,"cool":0},"0-6QTkTQU9z4H7Xv16oU7Q":{"text":"Came here to eat, and then looked at the menu and talked to another couple about the food ","useful":1,"cool":0},"el6dmDFL0vUyuvEGflJezA":{"text":"Great place with local beer selection and some interesting plates! Food and service were g","useful":0,"cool":0},"93td6GVRJggWvUdm_Mu0Ww":{"text":"Awesome Alt and oysters. Great bartender. Had me in and out in under twenty to catch my fl","useful":0,"cool":0},"4NAOqTIHZFUTL-ZElXN4JQ":{"text":"This is a fun atmosphere restaurant. The building looks historic and the art on the walls ","useful":0,"cool":0},"5PgcX43OZxkAnUQeLZ7BYQ":{"text":"The shrimp poboy was good until I found a bug feasting in my lettuce right when I was abou","useful":0,"cool":0},"ABbsZWP2gucRPBZ-WxXaIw":{"text":"This place has the best oysters I've ever had! They were so fresh and so cleanly shucked. ","useful":0,"cool":0},"M6YExyDgdqhCmCu6jHpk0g":{"text":"My husband ordered the jambalaya pasta which had zero flavor. We sent it back for the duck","useful":0,"cool":0},"YfdEC9gpF-sI5yWCosFX_A":{"text":"Meh. Just Meh.\nThey serve food and beer; neither of which is particularly good. Don't wast","useful":2,"cool":1},"ZHP5tilrYoIHVJ_E2xk4vQ":{"text":"After being away for several years, I came back for a new try. Sadly, the beer was mediocr","useful":0,"cool":0},"e0qJYEW39-Qpt8cWBzyRVw":{"text":"get the duck!  everything is excellent; crispy skin, tender meat, greens and corn bread/cr","useful":1,"cool":0},"wGKzlhMK9Yp1QGGNm4juLw":{"text":"Forget those higher priced restaurants in the quarter and go to Crescent City Brewhouse in","useful":1,"cool":0},"PWJL64nbWl0bVi7WEU6xgw":{"text":"There was nothing wrong with Crescent City Brewhouse, but there was nothing overly excitin","useful":2,"cool":1},"tOA1mJQw8bwne8WP5Pmifg":{"text":"Crescent City has a great location and is busy because of that, but the beer fell flat for","useful":0,"cool":0},"FIHY6k9rXcdFzm02mF1wNQ":{"text":"We came to eat here for lunch. The restaurant was not full but the service was SLOW. The h","useful":1,"cool":0},"XEd1O6jFAX02DrShX30WwQ":{"text":"I've only had beer here and was glad for it. The menu itself reads well, but I opted to st","useful":0,"cool":0},"aUpMBue6MmEaAKQVZdtfDw":{"text":"I thought the food was good, the patio had a good view and service was attentive and frien","useful":0,"cool":0},"zfy9ab_ZU93wjzuvO4dBXQ":{"text":"Although the reviews for this place are mixed, we had a very enjoyable experience. We stop","useful":0,"cool":0},"-AA0tKNTNJ5bbNmQmyBYGA":{"text":"It was a nice and quite place. Service was quick as well as the food. I got the pulled por","useful":1,"cool":1},"IJBnJ7JO4u_GzveL_fwrhA":{"text":"Went here for dinner after arriving at our hotel,we got the oyster to start. Which were ve","useful":1,"cool":1},"4oFy7-lzXMyfumol5GxqIA":{"text":"Had a great night out with a group of co-workers, 16 of us total.  normally, with a group ","useful":0,"cool":1},"EAp46H_SVQhFbBVIN1qlIA":{"text":"We are giving this one star because zero wasn't an option. Having been to Crescent City in","useful":0,"cool":0},"sfcnOvm5gHT4lTGk4nzQ7A":{"text":"Meh....not good , not bad.... just so so. You go here for the music. \n\nThe oysters are dec","useful":0,"cool":0},"Hnm94Sdg4YTCt2tYFRyIWg":{"text":"i'm quite shocked by the negative reviews.  i am from philadelphia and have spent much tim","useful":0,"cool":0},"5NQrX-OH33AUps0ypXN-2w":{"text":"Do NOT waste your time or your money here. My boyfriend and I were visiting NOLA from out ","useful":0,"cool":0},"wmC3oUA0Li0aXK9sgQDMmg":{"text":"Bf loved it. He loves beer. Me? Mmmm it was good. Its for a beer person I think. They know","useful":0,"cool":0},"pd8t9hAV-n9BhdX-ARiRVQ":{"text":"Really enjoyed my meal and the beer sampler.  Reasonable prices for the quarter and good s","useful":1,"cool":0},"xUAsQ5jMQ9BDu8cSlqQslA":{"text":"We popped in here to watch a soccer game (which they did have on so points there), but the","useful":0,"cool":0},"OQpIXHRMW1XDmm18P4-whQ":{"text":"Overpriced, got the red fish which was pretty over cooked and not seasoned, came with craw","useful":1,"cool":0},"jJAh7O94IMDfRVtFxjadww":{"text":"I first ate here in 1993 and went there for lunch today. It has been 19 years between visi","useful":0,"cool":0},"oCK9BdkxjgrQy9mSZVTDFg":{"text":"Amazing food and delicious beer!!! Our sever was awesome too! The oysters three ways are a","useful":0,"cool":0},"zSGuHcpt7ZhEmiCZf5-0Ag":{"text":"Spent a week in New Orleans at the end of August and absolutely LOVED the Crescent City Br","useful":0,"cool":0},"JMtoA-zgxluwedqo8HfG1g":{"text":"First time in New Orleans.  First meal combined with my wifes birthday.  \n\nLoved the food!","useful":1,"cool":1},"WQTPORnMD_eLGYVTrFjHGA":{"text":"In house brew samples 6 for $10 can't be beat. The fried chicken sandwich is amazing!  Ser","useful":0,"cool":0},"c8RFTUKkukvtYLGf0nqZyQ":{"text":"The service was good but the food was not great. The oyster trio was really disappointing ","useful":0,"cool":0},"0VaiXi-bpJxkGWB-G2lTTw":{"text":"This hip gastro-pub has some live jazz, often noisy, tasty gumbo and alligator po-boy!\n\nIt","useful":0,"cool":0},"A9v5e3HsDc1Ju7yYPUBGSw":{"text":"Not to be misled by the rating, the food and the ambiance was great.  The one star is beca","useful":0,"cool":0},"zCREebtumEJosIHpl9k7cQ":{"text":"The food and service were amazing.  I'm thankful for the recommendation. We had the Beer f","useful":0,"cool":0},"eX-xoBg1bmagXPb2jtfLMw":{"text":"Good beer selection and everybody at my table who ordered flights loved the tasting option","useful":1,"cool":0},"mDF_BVpy8yRL9LcGY5FwoQ":{"text":"Horrible service! Food was ok but it was Overpriced. Will never recommend or come back. Co","useful":0,"cool":0},"qFaV7DbVINOSC-YY5PCmuA":{"text":"Great little pub with terrific food & drinks. We sampled the boudin balls & stuffed shrimp","useful":0,"cool":0},"JmCLuPAsPqWmGinYndxc3Q":{"text":"Their beer and food are both mediocre.  Skip this place.","useful":2,"cool":1},"YoGhOm4hYOq8iiFYPFawdg":{"text":"I wanted to go to a brewery, and this seemed as good as any in New Orleans. It was during ","useful":0,"cool":0},"DLVx6BWSnPqVedYFK36L-Q":{"text":"Only stopped by for a couple beers to escape the rain. Upstairs bar and ambiance on point.","useful":0,"cool":0},"jpRT7_BVFYvCD0BXajFYsw":{"text":"Brought family here while they were visiting from out of state. The space is really pretty","useful":0,"cool":0},"4xubTbPbsYxItP3-fjXDOA":{"text":"Awesome place great beer.   The seafood cheese cake was so good   Came here for lunch.  Th","useful":0,"cool":0},"YgKVcxfOGSbPgi9yEdTVFw":{"text":"Comfortable setting.  Relaxing vibe away from the busyness of the street.  I didn't like s","useful":0,"cool":0},"yIbiRONrRcQS00dCJHPhVA":{"text":"This place is awesome! Beer is great, oysters rock and the staff are really friendly! The ","useful":0,"cool":0},"6NRB4WgD-EXcYrJ2za3JtQ":{"text":"What a great meal and what great service. I had Boudin balls that I shared with the table.","useful":1,"cool":0},"Dt-VYjLvq9qrZoWXFfabfQ":{"text":"The food and service were excellent. It was recommended to my by a friend I served in Viet","useful":0,"cool":0},"H_gTKHD-n_i4KX1k4OEiww":{"text":"Nice small brewpub located in the French Quarter. They do some very nice versions of Germa","useful":0,"cool":0},"X-yhyCW-xDzksHtr7pbztg":{"text":"We had a bad experience at Slyvains (see review) and went here to chill. Amazing raw oyste","useful":0,"cool":0},"zTL2ti23WCESbiET_jJYGg":{"text":"Cool atmosphere. Relatively inexpensive menu. Pretty good craft beers. The seasonal was ex","useful":0,"cool":0},"bYN032VWGJMiOpKRQN8cHg":{"text":"Very good service. Our waiter took care of a group of 20 of us and did a fantastic job! Th","useful":1,"cool":0},"jj1prkI-v3EDYk9F6R00jg":{"text":"We just happened by this place when our first stop was closed. We were starving, besides t","useful":0,"cool":0},"JWb3OrHdrW_M9iUBKFWkIw":{"text":"Should have listened to my friend Danon about this place.  I got together with some family","useful":4,"cool":1},"2p2wtK97RIi4SgR5_pIPxQ":{"text":"Terrible service. Literally the worst I've ever had. It felt like our server was angry wit","useful":0,"cool":0},"I5357XU7MUe99I_0QZ4Xbw":{"text":"Nice spot out in new Orleans especially if you just wanna chil ..the vibe was nice the atm","useful":0,"cool":0},"CIn_BeQKy8k_2vi_JN4xlg":{"text":"Expected better bear. Was ok but nothing special for 7,5$\nNot a place i will visit again\nS","useful":0,"cool":0},"HbR44Ri4CZVj_VreAcxiXw":{"text":"Walking down the street needing my first hurricane of the day we wandered in for a beverag","useful":1,"cool":1},"V8ut2lHK7sQQ5U8FTSr_TQ":{"text":"First off, I will say the beer was ok.  Food is fair, but way overpriced for the quality. ","useful":0,"cool":0},"nUTECNFT1PsKfqCkc9R0rA":{"text":"We actually did not eat here since we already ate but the beer was very good. My partner h","useful":0,"cool":0},"L3oiblBa-XCpviFx-Qe-sA":{"text":"We were looking for a place without a line and good food. We found it. The fried shrimp we","useful":0,"cool":0},"3URv3Wj0MgDMNMwBVY_vfg":{"text":"Cool location on the edge of the French Quarter. The oysters are delicious and the ambianc","useful":0,"cool":0},"mw78kFA01nsbhwOfJhWxfw":{"text":"First time in this beautiful city and as my friends shopped my other buddy and I snuck awa","useful":1,"cool":1},"6wnuC9Ua_WG3ztd4a1b4-Q":{"text":"We had to stop by and visit after we saw the German flag  hanging on the outside patio. My","useful":0,"cool":0},"LSFuGSoZlQ52Y8xrZD0lqQ":{"text":"We stopped in for lunch the day we were getting married and was very happy with the server","useful":0,"cool":0},"SW5yvQurLLObzPfuTAzybg":{"text":"Great value - you get great service and yummy, casual dining at a nice price point.  After","useful":0,"cool":0},"hppPxrIwJYZBTwtOFFTa7Q":{"text":"Great place for big groups!! You have the ability to make a reservation or walk in... we w","useful":3,"cool":3},"enZh-Tuzu2w1CzaK8B4tAQ":{"text":"Overpriced food that wasn't very good. Beer was average and only filled growler halfway.","useful":2,"cool":1},"EwKKPD47fJD3Liz56dBz7A":{"text":"Decent spot for beers and lunch. \n\nI prefer my beers hops heavy but I learned early on tha","useful":3,"cool":2},"KemaOvYgWMe5_PAu1DdZow":{"text":"Good grub, good service. I had seared ahi with portobello mushrooms, tomatoes and shrimp. ","useful":0,"cool":0},"-z_WSgkTprik3-pnQSl6SQ":{"text":"We come here every time we come to New Orleans. The oysters are always wonderful. The guy ","useful":0,"cool":0},"U5pynJSRkPDw6-mtXsfkpg":{"text":"Great beer and food. Not an inexpensive place, but definitely a good value.\n\nWe had the be","useful":1,"cool":0},"gWqDsZDD7iIU5mj8x9c0hw":{"text":"We arrived around fourish for drinks. When we told the hostess that we were just having dr","useful":2,"cool":1},"YVxUgSWR2xwrLFSRuq7lwg":{"text":"I'm in New Orleans for my sorority conference and they host our Onyx Hour here, 3 hours op","useful":1,"cool":1},"WFE_G4NgjPoy0ekHEGAgfg":{"text":"GET THE SEAFOOD CHEESECAKE...I REPEAT....GET THE SEAFOOD CHEESECAKE!!! It's the best thing","useful":0,"cool":0},"CWhB1zbbVwJyQhllU-BM8Q":{"text":"Overpriced street beer with too much foam. At least it's easy but still not even that quic","useful":0,"cool":0},"HSDJbOw3gkHvCJ1_E7EjNA":{"text":"The drinks and ambience at this place are fantastic, and the staff are all very profession","useful":0,"cool":0},"QSw3zy8f29IvpOKBgzdUMg":{"text":"Their beer isn't good. Coming from Portland, home of good microbrews, the beer was mediocr","useful":3,"cool":2},"yBz_Bt37hOR4jpNVgwE34Q":{"text":"We were out and about when we saw this place.  We decided to have a looky.  The hostess wa","useful":1,"cool":0},"9e_HmfRfGY5l5mPoP3_5OQ":{"text":"These guys have some decent beers for sure, I'm more of a cocktail guy personally.  Food w","useful":1,"cool":0},"66g2lVssJACV5pZcBNAJMQ":{"text":"Weiss beer was pretty good.  Food was just okay.  I had the fried oyster sandwich.  Really","useful":0,"cool":0},"0KncrKh9H7C4PcAG01-_zA":{"text":"This place is amazing! From the outside and being located in the heart of the French quart","useful":0,"cool":0},"mCE-yGZQhGvQVvu0XRl3ug":{"text":"The Oyster 3 way was excellent;  it was cooked to perfection, not chewy. They melted in th","useful":0,"cool":0},"TG9yN_YqDtDVj5SVmL34fg":{"text":"Do you like BLT's?  Have you ever had a BLT with 10 + pieces of bacon?\nOMG :)   Our server","useful":0,"cool":0},"fdx6If_LzKem_saOWpEOlA":{"text":"The BLT sandwich was phenomenal. Definitely hit the spot. Brad did a great job making our ","useful":0,"cool":0},"dQ6GM3PLJCSuKCEFtOvqjw":{"text":"My husband and I stumbled across this place while walking around New Orleans. We decided t","useful":1,"cool":0},"V19IMfnpag55WSs7jkzklQ":{"text":"Bad service, rude staff and mediocre food at best. Small portions that were WAY overpriced","useful":3,"cool":1},"Sp2UuecwXconRKx72yBs7w":{"text":"Another great visit here. Great oysters, good beer, wonderful food! Definitely a great spo","useful":0,"cool":0},"sBVnnZZX96fbwC0cti-wMg":{"text":"I am rating the drinks only. They have seriously collection of good beers here. I only dra","useful":1,"cool":0},"cLVS6aslPtO6qsX6jRtldQ":{"text":"Loved it here! Great food, drinks, ambiance, and music. Jack was a fantastic! Be sure to o","useful":1,"cool":1},"6hnvLNzc2VajEUAA1UlHbQ":{"text":"Awesome awesome awesome did I say awesome already well it was.  We came for the dinner cro","useful":4,"cool":0},"4e3rx277WV5wrSJ7CWlaog":{"text":"I would not even give it a star if I could. I ordered the light beer and gagged, I asked t","useful":1,"cool":1},"atHmb5Jl0niPxscrUklxiQ":{"text":"Good atmosphere, live music, excellent service. Been here every year I've done to New Orle","useful":0,"cool":0},"2Tfsk_gIpxwzajW2RkNbTw":{"text":"It would have been two stars if it wasn't for the mussels appetizer which was a lovely lit","useful":2,"cool":0},"686guIeg4zirhxaH__6OhQ":{"text":"I can't tell you anything about the food because I honestly just came in to have a cold be","useful":1,"cool":1},"WC6lqmIUePicKz2vhuWlow":{"text":"Just came in for drinks, but the Pils Cup was amazing!!","useful":0,"cool":0},"PEdX2dQwLUSv5nslnmnqVw":{"text":"We stopped by for a mid-afternoon beer...but ended up ordering this boudin balls. Somethin","useful":1,"cool":0},"mcuwJ4fHiUMK-SIqAb6T0g":{"text":"Had the Weiss beer. Not bad. But it is so hot that it does not stay cold for long. You nee","useful":0,"cool":0},"qPTPg8EtjJRgLn3A3kzaiA":{"text":"Nasty as hell. The only thing I enjoyed was the cole slaw. I ordered a pork po boy.... Sog","useful":0,"cool":0},"rNSX6XhabOv7Dld9N2Y3vA":{"text":"The beer is OK nothing great. And it is also the ONLY beer they have there. We wanted to t","useful":0,"cool":0},"0CknO4gxGu9tX_e-s-mn3Q":{"text":"Atmosphere was nice. They brew there own beers. I had the pilsner. It was good. Food took ","useful":0,"cool":0},"FPgVWwcqHLwPYaa5yVi0Qg":{"text":"i'm a little surprised by some of the reviews on here.  we went here partly to taste the b","useful":0,"cool":0},"JVr9N-3UdFwmjj8HVf-8ig":{"text":"Food was ok here. Nothing that really stood out compared to other places. The beers here w","useful":0,"cool":0},"AI6S4UuHf5zs-I_0hbThdg":{"text":"This place is the definition of \"tourist trap.\" Mediocre beer, terrible service, boring (a","useful":1,"cool":1},"-kreb8GFrc1PF0480t2u_A":{"text":"This place is a little more than your typical Brewhouse.  The food was delicious, but the ","useful":0,"cool":0},"tslCvwkSbFotFNGqxJVBdg":{"text":"If I could give this place a negative number review, I would put -10. Three of us born and","useful":1,"cool":1},"RsOFIBwTnJ0r8eD9hu5G9w":{"text":"Went there for a drink. Service was extremely poor and the beer was bad. We didn't even fi","useful":0,"cool":0},"4Bg-BmBCchp7DOVWdLQskg":{"text":"Visited the Crescent City Brewhouse while in NO on business. They have five of their own c","useful":1,"cool":0},"eL2B_dGkdQgbXuqWLxbDoA":{"text":"The menu selection was nice. \n\nThe Caesar salad was good. The Mac and cheese was ok. It wa","useful":0,"cool":0},"ZOESzUQmTTwp-TB0LC0I5g":{"text":"I don't get the bad reviews for this place.  It's awesome!  Fast service, good selection o","useful":0,"cool":0},"nLx2oxPeAzIcIT8oee1rcg":{"text":"Had a fun time here close to closing time watching the Kansas City Royals play in the post","useful":1,"cool":1},"IVmYz-8DUooPp4m43mDKQw":{"text":"The shrimp and grits were amazing!!!! Q was our server and was very attentive and helpful ","useful":0,"cool":1},"eAIlQyJzFnTu31vsvV9FWg":{"text":"Anytime I get to New Orleans, I try to get by CCB at least once. Even though it can appear","useful":2,"cool":0},"U2H1OBd75XhxaB5Pea1iPg":{"text":"Very attentive waiter. Great guidance and recommendations on menu items. Food was excellen","useful":2,"cool":0},"FTSZaNZ3YKORq3khpmekjw":{"text":"Came in for oyster but their Shucker was out. Waiter suggested the seafood cheesecake. Omg","useful":0,"cool":0},"tgxudW7PHFIVUrnk9i-NHg":{"text":"Came here with a 2 for 1 coupon from the NOLA visitors bureau magazine. Ate late lunch on ","useful":0,"cool":0},"Y2X3oOUdkW0N9NubEAUjUA":{"text":"Good bar...I was looking for a tasty porter to down so I came into here since this bar loo","useful":0,"cool":0},"ySuf-bJ_DVjlj8SdjDouOQ":{"text":"Awesome Oysters! I had two dozen! Great service and super friendly staff! They had a very ","useful":0,"cool":0},"ZohHqhjfgVjBtl-l0NQbyA":{"text":"Very pleasant dining experience. Food was all good. Served hot and without delay. Server w","useful":0,"cool":1},"iqP8ReSSx4hQ3y6loZbuxw":{"text":"im sorry but im from Louisiana and this is NOT creole food. everything was so unflavorful!","useful":0,"cool":0},"SoxPVr9CC9kkilm95mTVJw":{"text":"Awesome atmosphere, and great beer staff is truly friendly.Brent was extremely courteous a","useful":0,"cool":0},"CiW4eOCD1o27-ayeT-hwWA":{"text":"We spent a lot of money for lunch...came downstairs and it was pouring rain and thundering","useful":0,"cool":0},"CYWXNDRosjooFdA3YrZMaw":{"text":"A welcome option in the French quarter for something not liqueur related. \nHailing from We","useful":5,"cool":5},"x1WvYGb3FxhWjoIzQoO_JQ":{"text":"A great brewery restaurant in NOLA.  We are in town for a spur of the moment 5 day trip an","useful":1,"cool":0},"YMptHSHRE3bzs9Z5W-qsRw":{"text":"This building has some old world charm to it, that's probably why we enjoyed going there. ","useful":1,"cool":0},"aQao8hzIbuH1DhyyTDUBuw":{"text":"Skip the food here and just have a beer. Red Stallion is the best. If you're in town when ","useful":3,"cool":3},"iQ-9ch-6PmTH73Ol1uX87Q":{"text":"Great service, knowledgeable staff, huge restaurant with relaxed vibe. Crawfish Mac & Chee","useful":1,"cool":1},"0nEA75lwdiJsPkcj6DhaGg":{"text":"Love the live music, ambience and decor. Fun place for casual to upscale dining in an unpr","useful":1,"cool":1},"GsqWRfCM7Jaj-iqOJmpKPA":{"text":"I love it when I can ask the server what their favorite dish is and they will honestly tel","useful":1,"cool":1},"gLqAWqJEVTCfmc5tMP10Uw":{"text":"The only place I visited twice on my trip to New Orleans, mostly because their beer is qui","useful":0,"cool":0},"kepS7UjOMwD_6vMVZP6W2w":{"text":"If I were to rate the ambiance and staff, I would give this place a solid 5 stars! Everyon","useful":4,"cool":0},"zcH87hIS0bGAtdsK7S9hdw":{"text":"Came here on the recommendation of a friend who used to live in NOLA.  Started with Pimm's","useful":0,"cool":0},"1d-euFd--Irp8HflegR24Q":{"text":"Only because I can not give zero.  Had the worst experience that I have had in years at an","useful":4,"cool":1},"9fn-5BqVa3Es7bVCq2sJTw":{"text":"We went here for lunch and were able to get a balcony seat. Our server, Brian, was awesome","useful":0,"cool":0},"1bY-ZLPNwnFnGJAGu_TRLw":{"text":"Came here for dinner with a large group. Almost gave this place two points, but thought un","useful":0,"cool":0},"owiuH4dn7NpewYebH2X1yQ":{"text":"Water, the best thing on the menu.\n\nFirst time visit, nice ambience and great for large gr","useful":1,"cool":0},"f8_lOgqYFH5gs9V16HGZ_w":{"text":"An utter disappointment - one expects more from a brewery that brews their nectar of life ","useful":1,"cool":1},"x2ySdeYf7dfE09yiSwI6CQ":{"text":"Great oysters and local cuisine. The soft  jass music lured us in and it was so worth the ","useful":0,"cool":0},"2oZP7BDyIbNXsabIy4t58g":{"text":"Excellent food & excellent service!!\nGlasses were refilled faster than we could drink.Frie","useful":0,"cool":0},"fyYMjTucVfnL7VqGLeFKAg":{"text":"Oysters were amazing,  food great. Bar service terrible. Bartenders complained about in su","useful":0,"cool":0},"tj8ok6XvsxlShbCH21yfWQ":{"text":"Brent our bartender was great!  Food looks delish.  Will definitely try Evelyn's Boudin Ba","useful":6,"cool":9},"SLomXC6bMHPJYV5q2Oe-WQ":{"text":"Looking for a brewery with good food. This is the place. Beers run from pilsners to Stouts","useful":0,"cool":0},"eW6g7yRDl4rEWNtEbbdNIA":{"text":"We had a group of about 40 and they were great with all the chaos. I had the shrimp and gr","useful":1,"cool":1},"uApqRoTZplfe9gqq3loZsA":{"text":"This was my Husbands favorite place to eat at on our recent trip to NOLA.  \n\nWe had a 30 m","useful":0,"cool":1},"gE4tI2vHgMCjaGbUJuBPjw":{"text":"Stopped here in our adventure to find a good brewery in NOLA. The website was a bit mislea","useful":0,"cool":0},"6hGTyFDS9I5kwCRGSdq8Xw":{"text":"For some reason, I was under the impression that I'd heard good things about this place, b","useful":2,"cool":2},"K5H6kc2TxUz5HnWRcpqd7w":{"text":"Good beer, good burgers, skip the rest.  Crowded, and felt it.  A little on the touristy s","useful":2,"cool":1},"8TTG-GaIdyk1fi4T7fUH_A":{"text":"This place was the perfect spot for some tasty food in the Quarter. I highly recommend the","useful":0,"cool":0},"sq9RO0iDDFHyrWMxSn1cww":{"text":"You'll drop into a couple different places as you walk through New Orleans and you should ","useful":0,"cool":0},"2O1ApR3RKOx7q_GBke8x1A":{"text":"Outside of the beer it's not somewhere I would recommend you spending your money.  It's ed","useful":4,"cool":0},"1fw3EV6pcDPOQTbIsHurlg":{"text":"This French Quarter brewhouse offers to the Big Easy the typical restaurant-brewery that e","useful":0,"cool":0},"36k3PDYOeW1bTevV9C2y2A":{"text":"Stopped in for an easy and early dinner, since the place is pretty much adjacent to the Fr","useful":0,"cool":1},"daMszwJbhQ0UYU_kZ0CVxQ":{"text":"This was recommended by a shuttle driver, and it assuredly did not disappoint.  It's locat","useful":1,"cool":1},"qMgF7WUqt0SRpZ1iirPRow":{"text":"This looks like exactly the sort of entry-level-upscale shiny bar that I expect to find fu","useful":2,"cool":4},"E7Dogxe2VGAMxrwatXW9RA":{"text":"I ate at Crescent City Brewhouse for lunch not too long ago and was less than impressed. T","useful":3,"cool":1},"Y2v9HHAGSzHNu5evjfJ1gA":{"text":"A friend and I decided to spend the evening walking around the Quarter and we started disc","useful":3,"cool":1},"SeCMMyzn16NCZwITk2Q2Zg":{"text":"We visit New Orleans often, and always need at least one meal here. So many delicious item","useful":0,"cool":0},"vvlnVrP6unR7Y-jAH39sOw":{"text":"Visited Crescent City Brewhouse per a friend's recommendation (they raved about the jambal","useful":0,"cool":0},"KmyzINU04plDfkmeEGxKog":{"text":"Wow! What a surprise! Delicious, baked oysters appetizer to start and followed by BLT(we a","useful":2,"cool":1},"IS6Hq_WnDSE9UENxIUVCHQ":{"text":"We just stopped into Crescent City Brewhouse for a drink and a few appetizers. We initiall","useful":0,"cool":0},"TvUC50XXHaAi28nZ4hUG2g":{"text":"After walking forever, my wife and I were thirsty and starving so we thought we'd give thi","useful":1,"cool":1},"tgADjJEWvFpry2P7GRL4Ig":{"text":"Being a beer snob, I always enjoy trying different styles especially from microbreweries. ","useful":0,"cool":0},"FbqXQUqIoUnqP8YpgOnRUg":{"text":"Order a Spicy Bloody Mary pull up a bar stool and some fresh gulf oysters and forget the w","useful":0,"cool":0},"p3Rfs10zRFLnWZLzJjkPyg":{"text":"Stopped here on a quick detour to NOLA to visit family.  This was our first stop for dinne","useful":0,"cool":2},"CVS5UjvSLeF5DhaIVca5vg":{"text":"Chill, chill, chill... that was this place. We sat at the bar. They had the windows open, ","useful":1,"cool":1},"I0L2h4N9dwWVUnYYlU207g":{"text":"Went there for our 3rd Annual Family Day in the Quarter,  The Oyster Club and Shrimp and G","useful":0,"cool":0},"IqPmWPVjpEgNjBofNSHiSQ":{"text":"Standard beers and very friendly service. Handy for a quick drink as you amble up the Miss","useful":0,"cool":0},"q6vqOIhr2cC4b5AbAwQrSw":{"text":"As a visitor, we enjoyed our lunch at Crescent City Brewhouse. We planned to each get a sa","useful":1,"cool":2},"SWcqYhjOuhW6Gjt6PwSiXg":{"text":"I'm not a beer girl and came really close to getting the Riesling. But it was the day befo","useful":0,"cool":0},"J7Ez_x87jiYENKEzTvMNBA":{"text":"We went in with no expectations. Happy we did because it was just ok. We were seated quick","useful":0,"cool":0},"VQBWd28m6mSIVe9U-FdBjQ":{"text":"I found the interior to be modern and sophisticated. I definitely felt comfortable and rel","useful":0,"cool":0},"s57_GpyDBkajxUTXhdOEDg":{"text":"I am beyond horrified with the experience my niece and her friends just had there. It was ","useful":1,"cool":0},"8k_KEdVRlTQDIPthI1WT2A":{"text":"Gross food and terrible service can all be yours in this tourist trap!\n\nWhen we first arri","useful":2,"cool":2},"NV4MIijNXxVblEVYQJw5Fw":{"text":"The atmosphere was really good but the service and my meal were \"meh.\"  My 2 companions en","useful":0,"cool":0},"RiFwKiMtWTm569M_upGkhg":{"text":"Really fun place, great location.  Across from jackson brewery. Sat upstairs on the balcon","useful":0,"cool":0},"CE5srFrrRCYM96h-zJ8NQQ":{"text":"Came in kinda late after a long drive to Nawlins. Our server Chelsea was really nice and a","useful":0,"cool":0},"hzj_8kdwseVuUe1DuK0UMw":{"text":"One of our rare misses while in NOLA. Stopped in late after seeing some shows on Frenchmen","useful":0,"cool":0},"YSriKovAyRkzdXoOmBHqqw":{"text":"We had to make last minute reservations for a bachelor party dinner for a group of 15.  No","useful":1,"cool":0},"2jqi-XAXvMj_GG7EIrpMyw":{"text":"Came with a large group for an early dinner.  I was excited to visit a brewhouse, but very","useful":0,"cool":0},"dhpbf9koqPEPZLq8lkbGCw":{"text":"Easily the best Jambalaya I had in New Orleans. Very spicy but the sweating was worth it. ","useful":0,"cool":0},"pBvst86UGQcuPjDczuiOEQ":{"text":"Great service. Our oyster shucker found us a pearl! \nBeer was on point, live music was ver","useful":0,"cool":0},"o331ev6Kp5ycDAQ0H5nVRQ":{"text":"Great apps! We tried the deviled eggs, yummy, the alligator bites, so good and the Boudin ","useful":1,"cool":1},"lOlzPiFmWMyXiGBVo8hVbA":{"text":"The staff were super friendly the moment I stepped into the establishment.  I didn't get t","useful":0,"cool":1},"2lJhFZxOl8HQWdVrTAtQjg":{"text":"Stopped in on a fluke. Had the flight of beers. Had the baked brie. Amazing food, atmosphe","useful":0,"cool":0},"Px5x4mXuEcI-Js9hrAb6WQ":{"text":"Arrived for our 7:15pm reservation. Got our table and waited a while to be greeted. Waitre","useful":0,"cool":0},"y1x9uppvojFPqbD0GAPpTA":{"text":"A fun New Orleans brew house with good menu choices.  A little high priced menu items, but","useful":0,"cool":0},"Zq8pZMvPA_Ci93K5nn1qmQ":{"text":"Awful honestly. They played games with menu prices. Po boys were trash. Drinks were the be","useful":0,"cool":0},"SjH2Vt2p7tWlO2NfZflWmQ":{"text":"The beer here was so good and brewed in house. Food was delicious and they have such a wid","useful":1,"cool":1},"XIf60eDFYS78IgUbyI9r2w":{"text":"Stopped by for a quick drink and sat at the bar, where the bartender took our order and di","useful":0,"cool":0},"yPgdRVdjy9IW_mp7glSN5g":{"text":"Service at the bar,\nFresh shucked oysters,\nAnd beer made within, this place is a draw for ","useful":0,"cool":0},"S5Vu4sFQoNRzIGLHRun26A":{"text":"Popped in here on the way to Frenchmen Street and decided to do like all in NOLA and grab ","useful":0,"cool":0},"CNDQtw4AikomB6tVoWXeBA":{"text":"We came here when we were very hungry on a Saturday night.  We waited for a few minutes an","useful":1,"cool":0},"dDCrrjJl1hYSkd1bwDf9ew":{"text":"Big fan of the paintings displayed by local artist. Our server Kerry was not only a profes","useful":0,"cool":1},"WF61U2Q17J8nqGmsSr5u_A":{"text":"This was our first stop in NOLA. Fresh off the plane, our friend takes us to the French Qu","useful":7,"cool":4},"Z0pAY02pYttSxrRxWhs0jA":{"text":"Oh my gosh I can't believe I waited this long to post the review, but good things are wort","useful":1,"cool":0},"lcVMlTZJb95yLqwVZSJ0pA":{"text":"This was my first stop to eat when I arrived in New Orleans. I ordered a shrimp po-boy san","useful":0,"cool":0},"ml3xGTWaThWoxcuoKvz1Hw":{"text":"The food was fantastic. Ordered the Seafood Cheesecake due to all the rave reviews and it ","useful":0,"cool":0},"ws0rhX--zvhFfhV9HF86nA":{"text":"I was expecting a very commercial brewhouse experience, but the bartenders are great, witt","useful":0,"cool":0},"kGN9vy6O7amK636dyqObNg":{"text":"I talked my mom beer drinking friend into lunch here and was stunned at the divine lunch w","useful":1,"cool":1},"D_AT2jflhquAWh2oL_jNWA":{"text":"Like most others have said, the red stallion is good.\nNice give in here, good chill music.","useful":0,"cool":1},"DPs5Qb3PF3Yu-iNz4MmIZA":{"text":"My husband and I came here out of convenience because it was next door to our hotel and ha","useful":1,"cool":0},"Po36MqWUYbBA4KZXSG3kOQ":{"text":"This place was recommended by a tour guide, we were looking for a place that had good food","useful":1,"cool":1},"CS83q00OAuLujbiPUo9TaQ":{"text":"As a home-brewer, I like to make a special effort to try local beers where I travel. I don","useful":0,"cool":0},"pCa3_SggglMCa_s-4F-ONQ":{"text":"An absolute great place to have a beer and enjoy the moment! My wife and I got the seasona","useful":0,"cool":0},"VvesVEutSDDrQQ50wlJW1Q":{"text":"Review style: kind of Back 2 the Future remixed featuring new special characters w/ food s","useful":107,"cool":97},"fpxJfttMOIzlihzjY6aE3Q":{"text":"Stop by the Crescent City Brewhouse for a sampler- 4 samples for $7.50 or 5 samples for $8","useful":1,"cool":2},"IJUmyXnmEiCtallbx3sKzQ":{"text":"It's a brew place right in the French Quarter.. The beer is okay, the food is okay and ser","useful":2,"cool":1},"jXDhnhWbIuPIarFD_MHY5w":{"text":"Cool atmosphere. Helpful attentive staff. Try the BLT. Amazing twist on a classic sandwich","useful":0,"cool":0},"JwvH8CJYmRBVTakaKP3gCg":{"text":"The beer has a very metal like taste and their food was horrible. The staff seemed ok","useful":0,"cool":0},"p5UwRSf0fTNNMARcfb_p-Q":{"text":"I walked passed this place multiple times during my trip to NOLA and finally made my way i","useful":2,"cool":1},"CIXh06NkZDvpueDswz7Cng":{"text":"Came from Baltimore and saw they had shrimp and grits. My mom and I wanted to try them and","useful":0,"cool":0},"V7rLplqfiYUp2ASF48AELg":{"text":"Cool vibe...next door to hotel French Market Inn)..so bring it on.\nJazz playing...football","useful":0,"cool":0},"EXmeoXbZWKRj-T1Iawy3PQ":{"text":"It was not crowded at all, but we felt somewhat rushed by our waiter. Their version of the","useful":0,"cool":0},"ttirkgOk30vIuW3A0EhgOQ":{"text":"only had beer here but I wanted to share that it was really really good. And the price was","useful":2,"cool":1},"MpgS9rHWfBhXS7F91G_qKQ":{"text":"Oh yes please I had the shrimp and grits in my wife had the red fish which was amazing","useful":0,"cool":0},"5bK8XCoUfKxKOwJcsGpHTQ":{"text":"Live music, friendly staff, clean restrooms and delicious oysters- what more could you wan","useful":1,"cool":0},"sA-NAKzSDEY_Ph6WTcN6bQ":{"text":"This place was horrible.\nWe picked it because there was no way, we found out why.\nWe order","useful":0,"cool":0},"APn6uIKGFsfC8kg7RUaDPg":{"text":"came here for my sorority's \"onyx hour\" which was from 7-9 open bar with few appetizers. w","useful":2,"cool":1},"de2H7v4jEmoal2gNxiVClA":{"text":"OK - here's the pros and cons of this establishment:\n\nPros: very friendly staff, speedy ki","useful":3,"cool":3},"nGEXVEa27dnKSQW8MdF91Q":{"text":"Stopped here on recommendation of a friend who lives here.  Food was delicious. My friends","useful":0,"cool":0},"jVbLx_XgIOC7TvJTlGGdBw":{"text":"Had a great time from Mimi and Nicolette setting us up to Steven taking us to a better lev","useful":0,"cool":0},"twN8_wEFfNrRvJnniJxjBw":{"text":"We enjoyed the cold beer, live music and very pleasant staff. The bartender was very atten","useful":1,"cool":1},"9t6pzrFUSAvuwedE54uNXQ":{"text":"The second star is only for the decent beer. The food and service were horrible. I dropped","useful":5,"cool":2},"gAU8nSk8PxEHEuYe40MwqQ":{"text":"After I had a good experience here, I went back twice to try some other menu items. I had ","useful":4,"cool":2},"eLQv9R49synDAM5tc-UIVA":{"text":"Stopped in for dinner as part of our wandering the french quarter.\n\nI had the Jambalaya, a","useful":0,"cool":0},"MxmeI8E14l8Ef1eUg3BD5w":{"text":"We went there because of the coupon that we got from our hotel. It was such a good deal to","useful":1,"cool":1},"okigyZS4kOqpO-aWGBRRpA":{"text":"Great location with balcony seating. We were really looking forward to the beer. It was no","useful":0,"cool":0},"z_gBWlFge1c2Ao8czIaHrQ":{"text":"When we arrived we asked for a table in the shade and we were seated in the part sun with ","useful":0,"cool":0},"XPpaFJyAL90kYpgxEyKg3A":{"text":"PROS:\n\nLocation, location, location\nFriendly staff\nGood service\n....and did I mention loca","useful":1,"cool":1},"89iFjA-E7QZ40tlbTUtfmA":{"text":"Came in just before 2 large groups of 30+ eachbut they had fixed menus.\nTherefore, food to","useful":0,"cool":0},"WrS6Mg-3BU9FnlDxQT3FLw":{"text":"Best crab cakes and beer! Enjoyed the whole atmosphere and very friendly waiting staff!","useful":1,"cool":0},"Qlsf-x0GTI_DghEG-nmoNA":{"text":"Food: 4 stars. I have been to this restaurant many times. Their Bloody Marys are spicy, th","useful":0,"cool":0},"qMgZPPic58DHqo4pcMrgwQ":{"text":"The beer was good, the food was average,  the \"New Orleans\" trio was almost inedible.  Sti","useful":0,"cool":0},"uFNTejcc8Hk4COuozfQ3_Q":{"text":"Decent food, decent(ish) beer, but nothing magical.  Especially for the heftier than I exp","useful":2,"cool":1},"fUdW40LRODEHpvVu2_6O3g":{"text":"Great place if you're looking for a nice meal but is still casual (and not \"fine dining\" p","useful":0,"cool":0},"_lz94C-XfiUApgAKUJ-5KQ":{"text":"Excellent place for relaxed, casual family dining.   We loved the courtyard setting in Mar","useful":0,"cool":0},"ZzsI_dC2R3LbCoAdPb6SjA":{"text":"After trying to lunch at Bubba Gump's (mistake!), I happened along the Brewhouse and decid","useful":0,"cool":0},"JnSLVXb3YGEy-08xQu0Vkg":{"text":"A great brewery restaurant in NOLA.  We are in town for a spur of the moment 5 day trip an","useful":4,"cool":1},"IAKO-esymRJP8-yL2n-bCQ":{"text":"Have been coming here for many years and always enjoyed eating and drinking at Crescent Ci","useful":1,"cool":0},"d5_LHDbbiBi-Z-yQyCmalg":{"text":"Very good dining experience I tried duck for the first time in my life and it was excellen","useful":0,"cool":0},"-mNEcmST0_wlE29AFmzlGQ":{"text":"My friends and I Stopped in to Crescent City Brewhouse for a drink on the cutest back pati","useful":3,"cool":2},"niKzV2FVx4SXoC_rXfhcIQ":{"text":"Have been coming here for many years and always enjoyed eating and drinking at Crescent Ci","useful":0,"cool":0},"tzUFRMzjoyH1NsFf5V1rqQ":{"text":"Enjoyed the food and atmosphere.   Apps were great and the service was good.  Had the shri","useful":0,"cool":0},"K0PcXtcbfjIcXWhwg9tL2A":{"text":"We went with a large group. Made a reservation. They started off by seating us at a large ","useful":2,"cool":0},"DP__AgKH_BJLa4zPMF4atg":{"text":"I really enjoyed my time here. My favorite house beer was definitely the pilsner. It had a","useful":1,"cool":1},"oRX0au6xwGczmkpPM3l-UQ":{"text":"I wish I had read some of these reviews before going in. This place is so-so on food, dece","useful":1,"cool":1},"SByot5NbqdIrqgZU6M7rEA":{"text":"My party and I made reservations through OpenTable and we were immediately seated after we","useful":2,"cool":1},"_2yq1fmkD0BigR1AuCTYTQ":{"text":"While strolling through the quarter, my friend and I came across what seemed like a promis","useful":2,"cool":0},"kuVNk8ich22C-zXY4k-WRw":{"text":"The Caesar salad is rather basic but has a good dressing, lots of Parmesan and amazing bla","useful":1,"cool":0},"Vu_-Hirt4AHVfQPjCFe4Dw":{"text":"I didn't eat here, I just came for the beer. And the beer was fantastic. Don't expect a bu","useful":0,"cool":0},"10BoTJMmy_w3OeMalo-9EQ":{"text":"The food was excellent and the service was outstanding. The ribs were cooked to perfection","useful":0,"cool":0},"MzmC2btn0oUND4EvEpWUAg":{"text":"Best beer in the city.  Must have the brew house wings!!!!!!  Also give the ribs a try. Se","useful":0,"cool":0},"Ibe4m2qIwKmzj1H4QfGQpg":{"text":"The manager at the front is a total jackass. First class rude person. I believe his name i","useful":1,"cool":1},"7CYvw4oiHGf8btUBlc-WOA":{"text":"Such a cool building!! So neat, all the dark wood, the balcony, the brewery vats, so respe","useful":9,"cool":8},"_fyYmRt1qzELfF9vfUiAUA":{"text":"It was okay. \n\nI had a lovely salad. Very fresh and tasty but pricey for what it was.(comp","useful":1,"cool":1},"5sZPxEaARUdTfXYJO6Ws0A":{"text":"Great beer and sandwiches.  We ordered the chicken sandwich with pimento cheese and the BL","useful":0,"cool":0},"tY_XHZVTTUuJUaAWarMi9A":{"text":"The food was solid pub food and service was average-ly pleasant. In general, I was quite h","useful":1,"cool":1},"Tq3iRLYf9tmAjUQjk5mLYA":{"text":"The seasonal Weiss was very nice! The meat pie appetizer is an empanada - but very nice an","useful":0,"cool":0},"LYDt9v3B0yaKYu_RGL6Zag":{"text":"I really like their beer! The food is decent and one time I had a sandwich where they deep","useful":0,"cool":0},"PiZdsfxGTMThbFqJdWXyrA":{"text":"Nothing spectacular.  Beer was ok at best.  We came here with a large party, ordered some ","useful":0,"cool":0},"0raySMJPS6V0QC0AUjfphg":{"text":"After getting kicked out of Galitoire's (because us low-lifes had some \"faded\" jeans in ou","useful":2,"cool":1},"A4vKSg5ymSElZtDCZbyYRQ":{"text":"Really good selection of beer. Great atmosphere and location. Came way before covid. Would","useful":1,"cool":0},"yNspcgcUvmOn_e75d02DiQ":{"text":"Good beer, ok food but not enough to come back.  BBQ shrimp was very good and would be a r","useful":1,"cool":0},"2nw7RtEbDT3Qpkdguv2kYQ":{"text":"Went here on vacation as it was right next to my hotel. The decor is nice and its a huge p","useful":0,"cool":0},"1gqYGzzhxSENFJvnTZmWbQ":{"text":"We just settled on this place because we were short on time and the prices looked decent.\n","useful":0,"cool":0},"9c6e3ytrCiOXeOMQpxqmBQ":{"text":"Excellent crafted beers - the Black Forest was my fav!!  Must try.  The crab cake appetize","useful":1,"cool":0},"otnGwhIEyBTeGe_Fjo5l3w":{"text":"I made a a reservation for 10: the doors were locked.  I snuck into the exit when a custom","useful":0,"cool":0},"XvfVERo9h1BPkj4KgY___g":{"text":"Most excellent! Was very busy on a weeknight but service was great and we were fans. I got","useful":0,"cool":1},"EOat1NrId35zfi7XYYdKWA":{"text":"Great service by Maryann!  She's got personality plus and really made our night.  The drin","useful":0,"cool":0},"laS1Kq2x_8VVxmjxysUXzg":{"text":"Maybe it was a bad time but I would recommend you bypass this place.  The beer was mediocr","useful":0,"cool":0},"6P7_NtE8VTVU4PzCD-HzZg":{"text":"This was our third time here, and as usual, the service was lacking, as is the food. The c","useful":0,"cool":0},"vb57V7Z45pkhKcgvSfHlig":{"text":"I got the steak and my boyfriend got the Jambalaya Risotto. He loved his and my steak was ","useful":0,"cool":0},"wSgIq4FO4-_g5zZ4RDI7kw":{"text":"Great beer! Great food! Service was decent. Try the seafood cheesecake. You'll be glad you","useful":0,"cool":0},"TB-Zuev7PaCGz-NjFZG3Rg":{"text":"Very good lunch here today. The seafood cheesecake was surprisingly good!  And the burger ","useful":0,"cool":0},"6o4d6cH0ghJxrCHF0RX1ww":{"text":"Three stars for the great staff. Tried the beer sampler, they are very watered down. Nothi","useful":0,"cool":0},"N5EkuyAZr0nxCKVs9leWWQ":{"text":"THANK THE GOOD LORT IN HEAVEN that Crescent City Brewhouse is open again. So I loved the a","useful":0,"cool":0},"LVTJdcuvIj9X5-5iQNs9sw":{"text":"10 dollars for a \"pretty good\" beer? I had the red stallion because I was thirsty. now I w","useful":1,"cool":1},"X3sDzkoYFVnuOPpxkEI6Lg":{"text":"We had fun trying the different beer at the brewery. There was live jazz music playing and","useful":0,"cool":0},"gVi8E2ZAnmrFYq8jNY7C1Q":{"text":"Oyster bar was delightful and not badly priced. Bar is the best seat in the house and the ","useful":0,"cool":0},"pPKj1LsfZXHqtuxOoJVf8g":{"text":"Mucha elegancia, pero la cerveza un toque floja, re del montón y para nada especial. Sí, C","useful":0,"cool":0},"Dvy-rRr_e4hz7FhRqmpmvg":{"text":"Pluses\n- ability book a same day reservation on Open Table and our table was ready for us ","useful":0,"cool":0},"Jj2IPwS8tzYlr4YtopOsCg":{"text":"Good appetizers. Got a flight and it was kind of bland the be honest. But I come from the ","useful":0,"cool":0},"_XRBbM6gCiBqRLmr0r9JuA":{"text":"Fantastic food, friendly staff. Went early had a beer flight. Quality at New Orleans prici","useful":0,"cool":0},"gWJ2InNOqovfqNpfoY0xmw":{"text":"Came here with a big group on a Thurs. night, had an ok time. Service was fast and attenti","useful":1,"cool":1},"Nb8viGLv1lEE4ffCX-6aHg":{"text":"Delicious. My husband loved the German sausage platter said he had this in Germany years a","useful":0,"cool":0},"fZ92yrSRoyQ8xhnTJEaqoQ":{"text":"Came here the first time for burgers and were they huge! Cooked just right and very big. S","useful":1,"cool":0},"L6ZKqmYXLdIR96aSB4ru3w":{"text":"The location of Crescent City Brewing could not be better, but the beer sure could be. Loc","useful":0,"cool":1},"vx6HNNyXgBj6kyb_JfK_Vg":{"text":"This place is great! We went as a large group and they accommodated us very easily. I was ","useful":1,"cool":0},"nn7qPMFwIkasNNOr8KXHXw":{"text":"Worst service ever!! Never reserve a large party because they can not handle it. Wait staf","useful":0,"cool":0},"QfnJrdPlCuNjQJWlai8hdw":{"text":"My wife and I were in a hurry and ordered teh fried calamari and a couple of beers.  We to","useful":0,"cool":0},"WOriplxakrzFVaolw6_ZJw":{"text":"Stopped by for a beer. Menu didn't impress but beer was great","useful":0,"cool":0},"QnLGQex-EylUmfk8rSp2dA":{"text":"Bit of a tourist trap, the food was just okay. The beer was heavy on German influence if I","useful":0,"cool":0},"Yk4smjyUScRvOm7-e6FJTg":{"text":"We seen the BIGGEST COCKROACH,well eating last night my 9 year old said eww we look over a","useful":0,"cool":0},"TaBcP4oblZCpIrB5bR21kg":{"text":"We came here because of the amazing bartender in the street. She was friendly and knowledg","useful":0,"cool":0},"IFItI5v-oYbuAdyYM10gxw":{"text":"The vibe was decent. Fried Alligator was good. Oysters were advertised outside but were no","useful":0,"cool":0},"NgtZu9QKGRkIVL4lb4k7OA":{"text":"Menu is very limited to basic bar foods, probably due to covid. It was a little disappoint","useful":0,"cool":0},"1_MG0V2Y5u_sHQgn9jQdSg":{"text":"I went here for drinks and appetizers only so my experience was a little limited.  The bee","useful":3,"cool":1},"iahyq8QmQ21U9jBm1WL8aQ":{"text":"Stopped in here for lunch and had some of their beer flights and appetizers. I definitely ","useful":0,"cool":0},"lHWeztvzyXCIvVxNbRxvVA":{"text":"I came in to Crescent City Brewhouse with lowered expectations after seeing the Yelp revie","useful":2,"cool":2},"TkCGrAYDG_xlHtbo-erNmw":{"text":"Good spot for dinner. Live Nola music. The highlight of my evening was when the waitress b","useful":0,"cool":0},"WsD_ENKz39zBvsXXfrn-DA":{"text":"Sat at the bar and had good service.  Drinks were good. \nI had the Chicken Sandwich with p","useful":0,"cool":0},"DR8JdU7V35cN6kVdV4cYJA":{"text":"I ordered a Pour Over and a Mountain Town Burrito. The coffee was great. Burrito was tasty","useful":0,"cool":0},"DNnpi9aZ8UMABW9CT4vCRQ":{"text":"Amazing food and service! Our waitress Jessie was so awesome and friendly and made a great","useful":1,"cool":1},"AAbSsMvAd6pYw6cuvXscGg":{"text":"This was a great place to stop for lunch and beer! First, it's an authentic brewery so it ","useful":1,"cool":0},"j021-WzTAGBcVqXiJ-Nmkw":{"text":"This place is conveniently located and easy to find. As a tourist, I think those are requi","useful":0,"cool":0},"0pdAVoMgRnxUUBqhq9lNzA":{"text":"Always a delight when in New Orleans to dine at this pub. Our family stops at every trip a","useful":0,"cool":0},"LRDI5N9cQd8KN2_5kNOzBQ":{"text":"First ever visit and Sunday afternoon lunch is the occasion. Ate inside versus their patio","useful":1,"cool":0},"KxT1uz3_pM6RgrdC-wmXfw":{"text":"Another very welcome surprise when needing an early dinner before catching our evening fli","useful":0,"cool":0},"ciluWs0H6uD0Y-jUiZ_JNQ":{"text":"Decent place to grab a beer and some grub.  Friendly service.  Appetizers were good and fa","useful":0,"cool":0},"vq0tOe0ggy4Bs5TboujWVw":{"text":"We stopped in for drinks and to cool off after being outside on a hot summer day exploring","useful":37,"cool":29},"0QhYG3iZtQRKhGzq5a7ZMw":{"text":"Cant speak for the quality of food 1) because it was overpriced and 2) the only vegetarian","useful":0,"cool":0},"mZpAG87IkLByNqhYP8cm_g":{"text":"Overpriced food with a lack in beer selections. Granted they brew their own beer but c'mon","useful":2,"cool":1},"5xGhWPReKGERNjJ6tNxVvg":{"text":"Kim is the best! BLT is like you've never had. Also grouper on house made flatbread to die","useful":0,"cool":0},"LyisdF-FIQIEujoxLkkaGg":{"text":"This place makes its own beer. I got a flight of six beers to try. It's strange that you c","useful":0,"cool":0},"rz2CxmYFghYM0NpxPuv2qQ":{"text":"Fair bar fare. I needed a break from the wild streets off Bourbon St, and settled into the","useful":1,"cool":0},"3nHmGWflk3Gdz5EDnrTNyQ":{"text":"Excellent Service, food was average but I would go back to try something new, as the servi","useful":0,"cool":0},"T4Ok7SN2rj40P8-moRxLPQ":{"text":"We stopped in for a beer because truly we needed to use the restroom.  Bought a beer.  WOW","useful":0,"cool":0},"9pOggqvzUvH4aHUDf6ncpw":{"text":"Need a quick bite before a night in the Quarter? Want to sample basic but tasty local fare","useful":4,"cool":4},"lfbGQRsc-zcRlDpf9ZEp6g":{"text":"SHAME! As a local I have been treated ruder here than any other eatery;\nGOUGING TRAP: pric","useful":3,"cool":1},"m16aoGV_CyyY5SOxj-7qsQ":{"text":"My wife through a graduation party for her son at crescent city brew house.  The establish","useful":0,"cool":0},"mKtMu2SDQ2zc3RB0FECW6w":{"text":"New Orleans is a great restaurant city. The Crescent City Brewhouse does excellent pub foo","useful":0,"cool":0},"fsZHnM0dJGZ5jRy1sBd83A":{"text":"The food was delicious... I'm still thinking about it.! Service was friendly however the w","useful":1,"cool":3},"fER0p_A9Bl-x1vDO0vcFmw":{"text":"I;'m  a local and 3rd time here. 1st was baked oysters which were excellent- went upstairs","useful":2,"cool":1},"JAN-KL33S6D8anXmXcG7Kw":{"text":"The beer was alright, I did like the fact that they only brewed German style beers however","useful":0,"cool":0},"qCXLtZfaB3Z08edwtfEA6w":{"text":"Nothing left wanting. This was one if those unplanned evenings that become a night to reme","useful":1,"cool":0},"vdzxMF4chlQ7Yrr8iXXymw":{"text":"Alone in the French Quarter and looking for a place that I could people watch and get some","useful":2,"cool":1},"B6ObwPz1eUO-RYi6q2_0DQ":{"text":"If you like craft beer, this is a must-visit in the quarter.  Warning, they will make you ","useful":2,"cool":2},"FJr0vRhollRiFQnqFwfKjA":{"text":"We stopped in here for dinner after a pub crawl and went back the next night for the great","useful":0,"cool":0},"LHKKPbSuU7jFpOpAwpKfEQ":{"text":"The staff was absolutely wonderful.  I loved the raw oysters and my family loved the straw","useful":1,"cool":1},"ZumDnE3HHMS9tfeTKxjAfA":{"text":"on our continuing bloody mary tour of the French Quarter we stopped at CCBH for a hand mix","useful":0,"cool":0},"QVPqoSFCyHYS_zv7WGg8ww":{"text":"So you wouldn't think to stop into this place because it's on a pretty busy street but man","useful":2,"cool":3},"prbNtm_Dun5bj4gixR2AjQ":{"text":"Service was excellent but food was not... I got the boudin grilled cheese. It was the drie","useful":0,"cool":0},"_yRfz3-q-ClDYPIVMLbA8A":{"text":"Still  a great place to go eat when you're down in the city. Food is still great prices ar","useful":0,"cool":0},"GAfq-V16FS2FwFCI6snVFw":{"text":"Had a great time here! Love the ambiance. There was a live band playing on the lower level","useful":2,"cool":2},"3LoiNWyKc59DXR-jGDskvw":{"text":"They were out several menu items. The seafood gumbo had NO \"seafood\". The red beans and ri","useful":0,"cool":0},"LTwuenEHfgBbmj7kMnY_tA":{"text":"Unexpectedly good, in a town full of tourist traps.  The food was excellent and beautifull","useful":0,"cool":0},"U9nS4ySvifDHXz-4wwcW8w":{"text":"I ordered the redfish and it was really good.  My husband was disappointed that they didn'","useful":0,"cool":0},"CDTKgIq7FAM3dT_YPLfvdw":{"text":"My wife and I stopped here on Sunday morning after getting hungry while doing some sightse","useful":0,"cool":0},"ShiGpVdJwLxQouucLDn-qg":{"text":"Good people, hit-and-miss food for our large group\n\nWhen our group of 40+ was recently in ","useful":1,"cool":1},"C6UuKbNfqwsjr0CST3ncSQ":{"text":"Stopped in for a beer. I found the bartender to be surly and totally uniformed about his b","useful":0,"cool":0},"UPlHZB70s-P7y4OKTby6Mw":{"text":"Ok.  Been here a couple of times as I live in Biloxi, ms area.  I always stop by the Louis","useful":0,"cool":0},"MDBshv8k-gbrZAs7MFhwHw":{"text":"The service here is what makes this place great. Our waitress (her name escapes me at the ","useful":0,"cool":0},"yysyq01m-Sw7QSMkU0U-Sw":{"text":"The bartender was rude. We asked about a specific beer and he responded \"well yeah this is","useful":0,"cool":0},"ROejdAbnNEEX-CCVyGeuPA":{"text":"I always visited CCB every time that I visited New Orleans. They used to have great servic","useful":0,"cool":0},"UEkLNBaWx9fHvrd8wAD6WA":{"text":"Crescent city brewhouse was better than I expected although I did not have very much to ea","useful":1,"cool":1},"_hT02hDB0CF0RY8sOB17FQ":{"text":"Lunch there with the family --  little one had the kids burger.  The burger was \"slider\" s","useful":0,"cool":0},"1PrIVOdyheillOKWNXATOQ":{"text":"Didn't have the food, not because I wasn't willing to try something, more because I didn't","useful":1,"cool":0},"YRMMQXnJ1UKmOvhml56iSg":{"text":"Don't be fooled by the trendy, modern look of this place -- the food is serious. It's the ","useful":2,"cool":1},"EAUHlaihRxxkbWd1CMAzvg":{"text":"I went to Crescent City Brewhouse when I was in town for a conference. We had reservations","useful":0,"cool":0},"V6GPVMpCKQ4Vx0O80ndDIQ":{"text":"My hubby and I came to the Big Easy looking for an authentic place to eat in the French Qu","useful":1,"cool":1},"H0cOU_dQVYjDsn_pxYuM-g":{"text":"Terrible. Rude. Unprofessional. Waste of time. We came to eat there on 12/31/18 around 12:","useful":0,"cool":0},"lweb0vkmF2mxJjrllaLYiw":{"text":"Had another good meal, a beer sampler and White  Zinfandel.  The seafood cheesecake was de","useful":0,"cool":0},"73NAsOyccwYab2FfTTwV7A":{"text":"The upstairs area is cool, the beers are decent. i wouldn't go out of my way to stop in th","useful":0,"cool":0},"5J2j78aiHh4jTQZ7IGlP-w":{"text":"Stumbled across this place and loved the atmosphere so we decided to stop in for a couple ","useful":0,"cool":0},"V2xQK2TV2FEMKrvZu7Tf_g":{"text":"The drinks were great. I ordered the Fried Shrimp Poboy, though, and was very unimpressed.","useful":0,"cool":0},"iVXfl0MVQLA40gFq5H6YgQ":{"text":"This is a spot that I wanted to check out every time I've been to NOLA but never got the c","useful":0,"cool":0},"OHPjg6DnZxqeRURsN3W3pw":{"text":"We loved this place. It has this eclectic collection of lamps without being messy. The mus","useful":1,"cool":0},"Bo4Utx3yAnH73UkU0xAG2A":{"text":"The Brewhouse was right next to my hotel, so I stopped by for dinner. Great NOLA atmospher","useful":0,"cool":0},"053fPRRw_BZR62jc6u9-eA":{"text":"the beer was mediocre and so was the hostess.\n\nthe seafood cheesecake was excellent and so","useful":1,"cool":1},"7Brv-tYBRhGLrOuepw9pCg":{"text":"We had a very bad experience with this place. We made a reservation for a group of 8 and h","useful":0,"cool":0},"4s2aUhn0fleB8cXcDmPxEQ":{"text":"Great hang out place with a variety of drinks and food selections. Had the Cajun Michelada","useful":2,"cool":1},"TxIT8-leexBcZcoDW8ah2A":{"text":"We have been coming to NOLA for about 10 years for my husband's birthday weekend and had a","useful":0,"cool":0},"UT_o3ehGEZrkA9mZBY_5sw":{"text":"Awful place that you expect in tourist section.  Attitude was rude when I requested gluten","useful":0,"cool":0},"5_39ptHt0fj8JDBJCYx17g":{"text":"We came to the brew house on NYE and the food was good, although I asked for \"medium\" but ","useful":0,"cool":0},"HjZ7FQcdyaY81bLEqOWPaQ":{"text":"Fantastic atmosphere with live music and unique art. Diverse menu with local choices plus ","useful":0,"cool":0},"-v4vdQRbUt5uJalwgYpCsA":{"text":"After walking around the french quarter for awhile in the heat, we seen this place and tho","useful":3,"cool":2},"kOmTMU_2VSRUxMpBxgj6ag":{"text":"First time in NOLA and last day here. The manager Mike is so amazing and let us in with ou","useful":3,"cool":2},"68QK9rLxWg6eTKpkX4x8TQ":{"text":"Really cool spot with a great selection of beers. Very spacious , clean, and they also hav","useful":0,"cool":1},"QkR8Wm9xs2ZJ2LMQiP_RoQ":{"text":"Very Disappointed \nI called the restaurant on Friday July 2 to make a reservation for Sund","useful":0,"cool":0},"ZEs5AqvUtKgPxWtLeuJSaQ":{"text":"We stopped here for a beverage and I realized this was the same place I had seen a coupon ","useful":0,"cool":1},"Ny_EOyAmqECxaGW3X-8Kzg":{"text":"I would absolutely recommend this restaurant to anyone (and I do). We had 4 adults and 2 c","useful":2,"cool":1},"B3vx9bYqZHuYbhPYafzTow":{"text":"There was a nice crowd last night after the Joan of Arc parade. We walked right into the r","useful":3,"cool":3},"onrgPcZMau1_1d9IlhG11g":{"text":"We wanted a microbrewery and a bit quieter. This was great and fig what we were looking fo","useful":0,"cool":0},"KRa0b6Blw9do5Pbpzc3vAQ":{"text":"Many, many, many beer options.  They are a local brewery and Hubby loved the \"Flight of Fo","useful":3,"cool":2},"lLjKcMcYVdJi5uGOnZQjGQ":{"text":"Had another good meal, a beer sampler and White  Zinfandel.  The seafood cheesecake was de","useful":0,"cool":0},"jvdUgqXsQnicp60cLqDT-Q":{"text":"Ate here with a group of 20 that had a pre-determined menu. Drinks were good, price was ri","useful":0,"cool":0},"UdmkS5NrFHMrO-zENRgGJA":{"text":"We were walking along Decatur looking at shops and saw this place that had a live band pla","useful":1,"cool":0},"sMu2nTdajGXOLpY1zSpX-g":{"text":"Food was bland, had the trio  and the red beans and rice, etoufee and jambalaya all lackin","useful":0,"cool":0},"XiwCjoipT1qNEcL_1WF9BA":{"text":"Had a delicious meal. Boudin balls were really good. The pretzels and beer cheese delish. ","useful":1,"cool":1},"0DyjBxqQMxqAts4xNvC8qg":{"text":"Stopped in here as my wife and I walked by. Loved the ambiance and the live music. Order a","useful":1,"cool":0},"fli5Nr2RihkkwFyD5o5gzQ":{"text":"Had another good meal, a beer sampler and White  Zinfandel.  The seafood cheesecake was de","useful":0,"cool":0},"L89zekfuU1P1Sp1k9ITNHQ":{"text":"Expensive weak drinks.... oysters are good. $18 / dozen. Beers are good. Garlic parm fries","useful":0,"cool":0},"k7T5ta8N6l5sowlaAe8jlg":{"text":"Ordered a burger medium well. It came out medium rare. The server asked how my food was ju","useful":0,"cool":0},"m4m0omNtlxaOmKmhIBJjHA":{"text":"We had a descent meal here. After reviewing the menu we decided to give it a try. From all","useful":6,"cool":2},"ashN_oqlqRx9OxzXmZr8hg":{"text":"Well popped into this place had such a good meal. Oysters are so good have a great oyster ","useful":1,"cool":0},"cw7u9yaDIJTnC76sgWVTUg":{"text":"Average all the way around here. I got a beer sampler here but none of the ales really sto","useful":1,"cool":1},"tQvvA1MAydRhh_Rcm02VeA":{"text":"The buildings and atmosphere were great. We sat in the balcony overlooking the river and F","useful":0,"cool":0},"ss-zJRnI7e43Q5kmMjkF-A":{"text":"Really cool spot with a great selection of beers. Very spacious , clean, and they also hav","useful":0,"cool":1},"b65nQOb6j9xct_gbHz9a8g":{"text":"Holy cow... the Smoked Fish Dip... husband was cautious and it turned out to be AMAZING!!!","useful":0,"cool":0},"tf_dTcR5e1x6BzLPEq5MfQ":{"text":"Touristy, tacky, light beer, terrible shrimp poboy, decent wings. Sorry but not impressed ","useful":2,"cool":0},"5UgtgvKFqq9pIcFA4Eubjw":{"text":"Went here for a big group dinner when were in NOLA for a conference, and although I didn't","useful":2,"cool":1},"uRq_ehNtL9lblDPuSvitTQ":{"text":"We came in for for a party event. We had a separate section the staff was great, lovely sm","useful":3,"cool":0},"wq8hWPnbZIL2EqAt-nku6A":{"text":"This is a good brewhouse located in the heart of Nola. \n\nThey brew their own beer that you","useful":0,"cool":0},"1GjfJ7tX8M4gCR_tr_oNfw":{"text":"Crescent City Brewhouse is a surprisingly massive facility right in the heart of French Qu","useful":22,"cool":17},"KjGOzLOWiDIoki3_VJ_HZA":{"text":"We have been coming to Crescent City every time we visit New Orleans. They used to have a ","useful":0,"cool":0},"eezndu_9mYH7l0GESYLIag":{"text":"Nice quiet spot off of Bourbon St. Our waitress was lovely.  Hence the 4 stars. She made o","useful":0,"cool":0},"UuaWmYSF4vlZd4YsvcsihA":{"text":"Great food, great beers, great atmosphere! I would highly recommend the raw shucked oyster","useful":2,"cool":0},"2Yubo3HkLshGIixEUCtuxA":{"text":"Food was okay but only that. I ordered a drink which never came.this with the not really g","useful":0,"cool":0},"_tSlpUoYxIfHHrtsbvdRgg":{"text":"If you want to feel like you're bothering your bartender or literally anyone working there","useful":0,"cool":0},"BzQNwzc8SyN0Gpqm4AJnEQ":{"text":"It was our first day in NOLA and stumbled upon this place.  I had lived in NOLA back in th","useful":3,"cool":4},"ymvPFNBTiRgDpEI9HdDClw":{"text":"Had the gumbo soup at lunch.   They don't serve oysters during the week.   Clearly under s","useful":0,"cool":0},"u1p93-RgvvmWVFyzcu-OQg":{"text":"Solid recommendation by the concierge at our hotel. I needed laid back casual, not a typic","useful":8,"cool":7},"sloNu5Dk9FgmOcXBmTYdWA":{"text":"Stepped in for a quick drink and respite from heat then ended up sitting for a couple of h","useful":0,"cool":0},"7u4iXMcgTtSFEUFGvdCKFg":{"text":"Food was very \"meh.\" I ordered a shrimp Po'boy and he ordered the boudin grilled cheese. T","useful":0,"cool":0}}