{"cdxncZLYm3dv0VsEGIu35w":{"text":"This is the shortest review I will ever write. Get off the couch, go there NOW, and order ","useful":0,"cool":0},"W7ZmINZ7L7HplUfNKohfgQ":{"text":"It breaks my heart to give a John Besh restaurant 3 stars...\n\nAtmosphere: fabulous\n\nDrinks","useful":2,"cool":1},"1G7DdHoOF80ZQk4mG9_gog":{"text":"2nd time I've been here where the kitchen was fantastic and the front of house complete id","useful":3,"cool":1},"BmbbclmMX_2ZeLweMo3x7w":{"text":"Knot - Not - Knotts (as in Knotts Berry Farm) - Or, how about Garlic Knots ? Bite of heave","useful":1,"cool":0},"rGS-jnb0QguufuMswJRPQw":{"text":"Wonderful pizza place located on Magazine Street. The pizza was good, but the cocktails an","useful":2,"cool":2},"I2D_wZFJQuU65U5e5GvctA":{"text":"Best pizza in NOLA.\n\nWe heard the hype and avoided going for as long as we could hold out.","useful":2,"cool":2},"f5aTtdqTxXWnpuxBGRYUSQ":{"text":"Ok so I am Pizza Critic... I consider myself an expert on pizza since it is my favorite fo","useful":1,"cool":0},"tLpQra8j22_RobCM_JNAlA":{"text":"I eat here every time I visit my brother The service and food are always exceptional I wil","useful":0,"cool":0},"O01soWZYDlfrg91Z0zLBJA":{"text":"We had heard good things about Pizza Domenica and while the garlic knots were very good, t","useful":1,"cool":1},"S_GuCCv7mcm1DMyEy39pZA":{"text":"Very delicious food, friendly staff, and cute inside! My only complaint very cold inside. ","useful":0,"cool":1},"nW_VLJDTSydG3XeYmm-NVQ":{"text":"Great pizza great service (super great service) great happy hour. I work in the service in","useful":0,"cool":0},"2DSFxfhVXw71_s-b65MIwg":{"text":"3.5 Stars\n\nI've only been to Pizza Domenica for the Happy Hour special, which I find is an","useful":1,"cool":0},"MEsQfLAdCpd85W5M7yJVbw":{"text":"The pizza was below average.  The crust had a strange taste and there was barely any chees","useful":2,"cool":1},"YXZoGO10P07G_vHsFWD__w":{"text":"Service was good and pizza was brought out fast. Flavors were decent, but crust was soggy ","useful":0,"cool":0},"_hkcjdnwS8Uvj0uAHwx0RA":{"text":"The service, food and cocktails are out of this world. I have the pleasure of meeting the ","useful":0,"cool":0},"P-2KWVUhrEngo63ACpg64g":{"text":"Delicious...wow!  we had the garlic knots with the  garlic provolone fonduta, and the clam","useful":0,"cool":0},"vYL9hQC7-DvsWSB4c6n23g":{"text":"Great happy hour!  3-6 everyday...even on the weekends!  Happy hour will get you 1/2 price","useful":5,"cool":2},"OjICjxoHwosmtOBmu-E4Fg":{"text":"This place is the yums.  I have been here on a few occasions, and have not been disappoint","useful":0,"cool":0},"XBPcVQI83RtpUZNS6R3oSA":{"text":"Like other people have said, the food is very yummy. The service could be better. The caul","useful":1,"cool":0},"0MBD8Xk2G82LIuytlDLLpA":{"text":"This  pizza place is the best I have ever had. Let me start off with the garlic knots. You","useful":8,"cool":7},"RFp7SOx9J7R5XBx-OH7LlQ":{"text":"AFTER: the waiter came back and gave us the discount after all and he checked up on us oft","useful":0,"cool":0},"DPoXuyHrwxXwtkZZQGpqJw":{"text":"I placed an order through Uber Eats, which had been perfect in the past. Today, I received","useful":1,"cool":0},"jMH1uO4sWum6JUdYhvHaaQ":{"text":"Not the best pizza I've ever had but 100% the best pizza in town! I love all the artisan f","useful":0,"cool":0},"opXDylQJyyPiriA6aRiEWQ":{"text":"We ordered pizza and salads. My husband ordered the Caesar salad. He enjoyed the taste, bu","useful":0,"cool":0},"0_9LxPtT20ABvi6untwvUg":{"text":"Absolutely amazing pizzas. Good and convenient location and great customer service","useful":1,"cool":0},"Ytwadz_4F0OYRU6-MYYdKw":{"text":"Best pizza in uptown. Awesome apps and cocktails too great vibe in uptown restaurant. Crus","useful":0,"cool":0},"P4TWc3yrxzywUwB0ejX0SA":{"text":"Came for lunch. Great meatballs and polenta. Tried a Tutto Carne Pizze.  \nGreat flavor. A ","useful":0,"cool":0},"ObNWHSCUSefkLkcHtTLLCg":{"text":"Went to dinner here one night while visiting New Orleans. I'm a big fan of pizza and I eat","useful":0,"cool":0},"TiirdsbHSpNBebKL2IUcHA":{"text":"One of my favorite fast-casual restaurants in New Orleans. The garlic knots are my favorit","useful":0,"cool":0},"cHyz846LXL4hSSnoRGn7BQ":{"text":"Take-out unimpressive.  System was 'down' - which led to an extra 15 minute wait.  Althoug","useful":1,"cool":1},"kH-hZoDOLZOefXsMx9moJQ":{"text":"The garlic knots are Amazing! Light, charred bread dipped in a creamy garlic fluff!!!??? I","useful":0,"cool":0},"YUgFHq-G6E9ofMY0oSsaLg":{"text":"Like many have said below I wouldn't go here unless it was for the happy hour pizza. If yo","useful":1,"cool":1},"bROX99VDxCV_wrW3GaB0Tg":{"text":"I have fallen in love with Pizza again.  The meaty Tutto Carne is probably the best pizza ","useful":1,"cool":1},"Mm9nZKXXfeZbHg_OGXZBew":{"text":"Half price happy hour pizzas were really great.  Each one feeds about 1.5 people.  Fresh a","useful":0,"cool":0},"rNMdWitiRblLp73tk3aRzw":{"text":"I didn't mean to end up here, but I did. Attempting to go to Domenica with a group of food","useful":13,"cool":8},"5O5akX0Wp7Q5FBSKv_5F_g":{"text":"Had lunch in the neighborhood and noted not very busy at lunch time. The drinks were great","useful":0,"cool":0},"PtciqjvBuWCeGidWcu23kg":{"text":"Cool atmosphere and delicious pizza. We fought over the cauliflower steak app and margheri","useful":0,"cool":0},"JHMXCHeh-NA6kfQg7YuwIA":{"text":"Pleasant and with good service. One big TV over the bar didn't work. We came at 2PM on Chr","useful":0,"cool":0},"RnRXsMaHu4uukCd3S9a1rw":{"text":"Who would have thought balls of meat could be so good?!\n\nThe Polenta served with the meatb","useful":0,"cool":0},"gAhrZOsOHzR8rWnkEp_fnQ":{"text":"I'm a big fan of the Domenica downtown, so I figured I would try this new one.  It's a nea","useful":3,"cool":2},"RygiC1IJ5MQ17IyVIofpXA":{"text":"The GARLIC KNOTS are phenomenal! It's a popular pizza restaurant, service is quick, I reco","useful":0,"cool":0},"8HCXVpoHqHSXk7z2j6PRlA":{"text":"This is the best pizza ever had. I had the Pesto Chicken and am in love. It didn't take lo","useful":1,"cool":1},"-WxGSgEbg_R86JiYwINR2w":{"text":"The happy hour is a great deal and snagging a spot at the bar is the best seat in the hous","useful":4,"cool":2},"Lb3CPa6ZAWASRKrtvAFZ6w":{"text":"5 stars solely on account of the whipped cheese. I don't even like pizza but I miss these ","useful":2,"cool":2},"kv82Na1hTOOlj9vyBytazg":{"text":"Great place (as we all expect from a JB establishment). \n\nGreat location and great vibe. I","useful":1,"cool":2},"I0fL2nzoYHI3-24Ij30C9w":{"text":"Let's get this out of the way - the food was awesome! I went with my wife and 2 young chil","useful":3,"cool":1},"k_34lqkgbTwFLC6fq5FgBA":{"text":"I could have eaten two. Yes, two whole pizzas. Absolutely delicious. They have a great bee","useful":1,"cool":1},"IfSl4jqXBtFMZyc5IxkaQg":{"text":"Wow!! Ordered the garlic knots with the most amazing whipped provolone cheese. Our pizza w","useful":0,"cool":0},"hgqBGux6E-3MpYcx-T1oQA":{"text":"The square slice has great flavor.  The thick crust has a tight crumb, but retains a light","useful":1,"cool":1},"po9tBQWJzMx6GNr1SdlVEQ":{"text":"My favorite spot! Amazing drinks, apps, pizza and the desserts are delicious!! Can't wait ","useful":0,"cool":0},"9ifKDSODliHmDeENDuVd2Q":{"text":"Stopped here with some friends on a Monday night while traveling through New Orleans. It w","useful":2,"cool":0},"uU6iyT_7HdU7oRsmvZi0Pg":{"text":"What's not to love!  Daily happy hour of half off pizzas certainly can't be passed up in o","useful":0,"cool":1},"wEsXeK_6Tygj2wPDXoALTw":{"text":"I can't believe anyone would give this place less than 5 stars. It was so delicious! The s","useful":1,"cool":0},"fm4WS4DCbzce7jWcB-t7qA":{"text":"In all honesty, I have had a hard time finding a solid pizza joint in NOLA.  Luckily, Pizz","useful":2,"cool":1},"9clCAKfyqWxJt3FTc1ywTQ":{"text":"I have been a HUGE fan since day one, and a regular at Domenica (the Mothership). My guess","useful":1,"cool":1},"ff7ZDU8eNZGG4ONxu_OZ1w":{"text":"I actually love Pizza Domenica. So much so that I decided to eat here with my boyfriend la","useful":1,"cool":1},"sVIWgmcgtXFmvvu-QNm8ig":{"text":"Yeah....Pizza Domenica was VERY disappointing in terms of the food, ordering process, and ","useful":1,"cool":1},"oM5Zcgzq0aTdO7WJ3VdnHA":{"text":"This pizza simply was not very good. First off, if you have tables and servers, why make p","useful":2,"cool":1},"_XOL-GGQlRqKLZ3_H3hgrA":{"text":"Half price at Happy Hour. Ordered a cheese pie and a margherita pie. I preferred the crust","useful":0,"cool":0},"ux9KEbvkflFg73ds16LDUQ":{"text":"Chicken lived and amazing garlicky crostini were divine, kids love the garlic knots--way b","useful":0,"cool":0},"mIue526N720t_m1LAq-7tw":{"text":"First things first: looking through these reviews, it appears that most people didn't rate","useful":9,"cool":4},"R7yrV7RXOftPuZg-QZz_vA":{"text":"Awesome casual extension of the Domenica brand uptown.  Great pizza, drink selection at re","useful":1,"cool":0},"168EnvMbI6SrHAx5SO43Kg":{"text":"The Garlic Knots, the Burrata, the Tutto Carne pizza....each dish equally as yummy as the ","useful":0,"cool":0},"YtX5bglW4sa5F-0YiQ1VKA":{"text":"I absolutely love this place. The pizza is delicious and they have a very healthy selectio","useful":0,"cool":0},"nt2ISP6PVwmzB_jDP16ecQ":{"text":"Firstly, the space is beautiful. It has an ambiance that you'll crave long after you leave","useful":0,"cool":1},"c0a8H1eVT-TGkEtZCOPexg":{"text":"It really pains me to leave a two-star review of Domenica on Magazine. I really enjoyed th","useful":2,"cool":2},"M6sTr_StTZmv938RqjQUOg":{"text":"Had the pleasure of dining here the other day for lunch. It was a great experience! The fo","useful":0,"cool":0},"tLGpV4D52fDouSDHOABozg":{"text":"It was just ok. Went with a party of 4. The service was better than the for. We had the Ca","useful":0,"cool":0},"wlwUjBlAo612MUXPiI4jXQ":{"text":"New Orleans used to be such an awful pizza town when I lived there; now, post Katrina, the","useful":0,"cool":0},"zKWMOluWMk4x3ip-Afp8qQ":{"text":"Fun to sit at the bar! Prosciutto pizza & shaved Brussels sprouts salad hit the spot.","useful":0,"cool":0},"AHhl4nsVKJCj649uvPqmdg":{"text":"The 2 time was even better than the 1st time. But then again the 1st time was amazing as w","useful":0,"cool":0},"VfeFE5iXJxhjj1z81a0V2w":{"text":"Great pizza, excellent appetizers (try the cauliflower steak and/or meatballs).  Excellent","useful":0,"cool":0},"_OaSQk-CBtsnxcVK0PQP5w":{"text":"Xmas day we were looking for a good place in New orleans to eat at and called them\nUp. The","useful":0,"cool":0},"M9hJ1WVC8qOW_qTLFLdiqQ":{"text":"Been too many times already! Great location (for me at least) and food is awesome! Pancett","useful":0,"cool":0},"9pfsk7i50p3xoYt-77UaTA":{"text":"I am going with a \"2-star\" review based SOLELY on a single appetizer - the garlic knots wi","useful":8,"cool":2},"KfEhJt_ts9Zy3iVvgevaWA":{"text":"Burrata Bruschetta was the best I ever had. We had the zucchini pizza and it was pretty go","useful":1,"cool":0},"Imm8BOxU2UfSfvSmlgkeJA":{"text":"Stop. Look no further. This is the place you've never known you've been craving. All this ","useful":6,"cool":3},"CAQ3UwS9yE4My_plQczT_g":{"text":"Pizza is hands down my favorite food.  I could eat it every day.  I have been waiting to t","useful":2,"cool":1},"3gUXH2ipw_T7skCcfieRTg":{"text":"Yelp-\n\nOur Host/ hostess- \n\nDoes not seem to have a friendly welcoming.  Maybe because we ","useful":1,"cool":0},"KupWfq3yCVfZ0PyV3P1mIQ":{"text":"Went again last night and was happy to see that they now take reservations and have stoppe","useful":0,"cool":0},"explHkcc3TIOozYvT02FNg":{"text":"What's the deal with the service here. One waiter covering about 10 tables. Never came ove","useful":1,"cool":1},"8JMEhNCHaSCAcXlGuYQzig":{"text":"I've lived in NYC...eaten pizza at some amazing places all over the world. That said I gue","useful":7,"cool":2},"-O5buWVl6y4SFv4_qsyURA":{"text":"This place is amazing! I'm from California and I was visiting the city for the weekend and","useful":1,"cool":0},"NzOffAIcK6GtNVSL0k_aNA":{"text":"I really wanted to like this place. The first time I was here, 4 months ago, I had the mos","useful":0,"cool":0},"KV2rhOIMQqXLl54KQAj_Jg":{"text":"Happy hour specials are great.  Highly recommend the clam pizza and the prosciutto pizza. ","useful":0,"cool":0},"QyvBXrZw_hgJNZkb2MmCcg":{"text":"Fun unique pizza place still open after the parades end so a great life saver during Mardi","useful":0,"cool":0},"gbE4fLMu-FNpa-51BjKuBQ":{"text":"Nice to find such delicious pizza for the whole family in this casual uptown spot.\n\nCheese","useful":0,"cool":0},"ekKg460rC4yN_AINGKBBWQ":{"text":"I came here to try the infamous garlic knots that I hear my friends rave about. \n\nSetting:","useful":1,"cool":1},"Dfpi3jEqh7M9-Pav3HLiug":{"text":"When Pizza Domenica first opened, I would have given it five stars. It has nice decor, tas","useful":2,"cool":1},"cno0xOIEDy39vX-SvKFQWg":{"text":"When your business is hosting a \"private event\" during rush hour lunch time, please put ou","useful":0,"cool":0},"mz0Yb9lTCdMEGMNgO_suRw":{"text":"I don't get out to nearly enough pizza places, so when I had an opportunity to try Pizza D","useful":6,"cool":5},"G4ovYlTWW8TeqpRr7vo1Zg":{"text":"I've been to Pizza Domenica before...I consider myself a foodie...few of my local friends ","useful":0,"cool":0},"0LTA0cueC24KG3lCr6dO3w":{"text":"We had each of the four appetizers and loved each one: roasted cauliflower with feta dip, ","useful":0,"cool":0},"nYwO34xbhml6L3L2M0SUZw":{"text":"Love this place! The atmosphere, the menu, the open kitchen! My favorite appetizers are th","useful":0,"cool":0},"54pPkGS7gkLdIkVRzRqBqw":{"text":"No point in even commenting on how good the pizza is so ill move on. Got wings again tonig","useful":0,"cool":0},"qJeXUhPSjbzAnZMZmsZOEw":{"text":"This is our fave spot when we're in town! The whipped provolone served with the garlic kno","useful":2,"cool":1},"PHzOpQQAVy8w8ycEOtTkPA":{"text":"Greatest pizza I have had in a long time. This crust is the best crust I have ever had ben","useful":0,"cool":0},"LdUQ-2ODs2cnKjkbN1aXdg":{"text":"I'd venture to say this would have been a 5 star experience, but the wait staff dropped it","useful":0,"cool":0},"RwH63NsXBzBeTZgwl1_dqQ":{"text":"Our pizzas were excellent! Try the Basil pesto pizza with the dipping sauces... You'll tha","useful":0,"cool":0},"6rNWyZbU3R75Y1RkIh2SFg":{"text":"Some of my friends an I came here after Art for Art Sake Festival, and it was absolutely d","useful":1,"cool":0},"f5MAW4b1V2MZ3nuP3p_o-A":{"text":"The pizza and food are decent, the experience is not.  Noisy-loud, not particularly clean ","useful":1,"cool":1},"TGbXrq1lIUKVrWK5HVLx3A":{"text":"Garlic Knots, Garlic Knots, Garlic Knots! Get it!\nA great pizza place on Magazine Street. ","useful":1,"cool":0},"j2DXfLatwRCLJT31Zds3YA":{"text":"Way over priced! I'm a fan of Domenica in The Roosevelt, but was dissappinted by Pizza Dom","useful":1,"cool":0},"NvfOR0rJiuWmIhBU_P0-Og":{"text":"The first thing I liked about this place was that normally you order at the register when ","useful":2,"cool":1},"PMPQqhzEKk8EuLfDEQhFJg":{"text":"The garlic knots are the best thing I have EVER eaten. Absolute heaven! Pizza was average.","useful":0,"cool":0},"ZDQbVPoC1lQI3WTvEKj35g":{"text":"My daughter and I went to PD on Christmas Eve and ordered the kale salad and the tutto car","useful":0,"cool":0},"GYzPpAsqc0YLwDIEorzrFQ":{"text":"Dined on the garlic knots and delicious pizza during happy hour.  It was a ridiculously in","useful":2,"cool":0},"npZQCRA_xcbgHn4ItbsWoA":{"text":"I just called to order take-out. The person who answered told me they aren't accepting tak","useful":3,"cool":2},"pKgAmdB0aoTf4YRHu7MODQ":{"text":"Great pizzas. Awesome appetizers. Good prices. Great happy hour. \n\nThis is like the baby b","useful":4,"cool":1},"Oni4R46fsNm_DGx8hK0Gwg":{"text":"This place is a gem! Kayla our bartender made us a special cocktail & it was awesome. The ","useful":0,"cool":0},"UUdigPTX0pl3GX4YUMmwBA":{"text":"Some of the best pizza I have had since I moved to the south. I highly recommended the gar","useful":1,"cool":0},"f_sTzRm-DPO8uRvRLWt4mQ":{"text":"Was so happy to find a place I actually liked in NOLA, as I don't eat seafood. We had pros","useful":0,"cool":0},"68iEHwD7T7Gx3zQfnkX80g":{"text":"I'm so glad to have ordered the garlic knots with whipped cheese! Amazing eats, simple yet","useful":0,"cool":0},"bgw8bezfOXwx6Tj2cJjf6g":{"text":"The garlic knots with the funduta!!!! sooooo good!!! Pizza is great, other apps are wonder","useful":0,"cool":0},"XD5bvOgtmrbvraXhsPYUGg":{"text":"Great place in a great area. \nI was walking down Magazine, looking for a bar or place to w","useful":3,"cool":1},"6dE6CEKlj_4fXWyTT37bkw":{"text":"Pizza knots. PIZZA KNOTS. Ahhh why are they so great and bad for me!?! \n\nI love this place","useful":0,"cool":0},"F6a_TbDLN3Cnm2gEap6Q1Q":{"text":"Five stars because I can't think of anything that was not good!  Great food, good selectio","useful":0,"cool":0},"L6ow5nbjNI5xLrNojXXM_g":{"text":"Highly recommend the garlic knots, roasted cauliflower and the wild mushroom pizza. All th","useful":0,"cool":0},"X7eAqXPf0KQO90rlBDd5lg":{"text":"It's my go to place for true Neapolitan pizza...but Alon..why have you taken my whole roas","useful":0,"cool":0},"V08CGDLLbOyO_CQl6xSstw":{"text":"I am THE BIGGEST fan of Domenica downtown. I LOVE it. However, my love for good food will ","useful":5,"cool":0},"364_y59Z1eNqXU0gAsqN6g":{"text":"True rating: 3.5 stars\n\nI came here on a Thursday night with a group of about 20 people, a","useful":0,"cool":0},"2pRrBCdvzdKglWh1lb-8Pw":{"text":"This is such a great local pizza restaurant! Really unique pie options. I went with two ot","useful":0,"cool":0},"lU9aBtNdlCrSGG_9ZnqB8Q":{"text":"So glad this place opened uptown! I love the original Domenica, but the CBD is just...the ","useful":1,"cool":2},"SS9BKRTZo3-opfzjJBwpYA":{"text":"This is not your average pizza. The brews on tap, pizzas, and salads are the highest quali","useful":0,"cool":0},"JSsFVpRQPulsKqqzvJ5Lwg":{"text":"I ate here a couple weeks ago and I'm still thinking about the delicious sauce that comes ","useful":0,"cool":0},"zMYYKjAHrVV8qwJQCWfs6g":{"text":"I ordered through ubereats tonight. Wish I would have gotten a frozen pizza. Undercooked s","useful":0,"cool":0},"DCgBdfUQIbylkHJMmACBRg":{"text":"Not the best pizza place, but maybe I'm a little biased because I'm from Chicago. They hav","useful":0,"cool":0},"z5U9iFJSt4xddSbGvBDdDg":{"text":"Pizza is so good. The garlic knots are a must. Honestly the best happy hour in town. For f","useful":0,"cool":0},"8j7HNlE8UL-04s-TPG_nZQ":{"text":"Yum!  On a recent visit, we shared the cauliflower appetizer and a calabrese pizza and it ","useful":0,"cool":0},"O8PS6aS7wRduI1xngwl2dg":{"text":"Domenica has been one of our favorite places to have happy hour for a while now and now th","useful":1,"cool":2},"ANpLFMRFi5QcLfgpZn2jSg":{"text":"We're big fans of Reginellis and so that's our basis of comparison.  In short, Domenica ha","useful":0,"cool":0},"TKtnx_weSijSnV_u6KoDIQ":{"text":"I've been several times and giving this place anything less than 5 stars would be an injus","useful":0,"cool":0},"F-GDi52PQCz486SOtZRVUA":{"text":"Finally had an opportunity to make it to Pizza Domenica. As a mom, I love that I can now g","useful":6,"cool":0},"y-Ax0YCGnZmKC3lI2YG4vQ":{"text":"Garlic knots were great! The pizza we got  was actually kind of weird. I was in the mood f","useful":0,"cool":0},"U0TGy-Hbt0jK3r-1eirkAA":{"text":"Checked this place out on my quest to find the best pizza in New Orleans. The host was ver","useful":0,"cool":0},"n_YoxeV2YmZFOaXUOwyAFg":{"text":"Was packed with children on a Friday night, but the food will make you forget any misbehav","useful":1,"cool":0},"wt9zG8EKCvWcoIylVdW7QA":{"text":"We enjoyed Happy Hour on Sunday- 1/2 off drafts as well as 1/2 off pizzas. We had the garl","useful":0,"cool":0},"TLAaTpDwxwJAuL5zbBzhSA":{"text":"By far one of my favorite pizzas to date, and I absolutely love pizza, have tried from all","useful":0,"cool":0},"NxnfhoX1lEhzQb2jjCP9eA":{"text":"I ate at pizza domenica a couple weeks ago while visiting from LA. I wasn't too set on piz","useful":0,"cool":0},"kn42F2i5De_5P3v5LYDUfA":{"text":"Yummy!!! Loved sitting at the pizza bar...gave me a deeper appreciation for the art of piz","useful":0,"cool":0},"tK1MZImmR-HIloGgqCsufQ":{"text":"The happy hour here is amazing: 1/2 price pizzas and 1/2 price bottle beer.  I think this ","useful":4,"cool":2},"wxikrXw8n3drwZGKqHyJqw":{"text":"Have you heard of Domenica? It's a John Besh establishment and I have a lot of respect for","useful":0,"cool":0},"K6XKZEETLuWT92Huz0sjUg":{"text":"On our trip to Pizza Domenica, we decided to split a margarita pizza between the two of us","useful":0,"cool":0},"rLiABU6uq-UxESf6gMVQwQ":{"text":"Wow!! \nPizza Domenica was absolutely amazing! They close at 9pm, but we had reservations f","useful":0,"cool":0},"by9HoRBV2Qy5YoAdpZ2YIg":{"text":"Almost everything was great here! The food was great, same fantastic pizzas as the domenic","useful":1,"cool":0},"FdwOHV4ELDQt8b2YvMG6aA":{"text":"They say there's no such thing as bad pizza or great Chinese food. Well, this place gives ","useful":1,"cool":1},"ImUYUu5rkn7kkZxnf58hpw":{"text":"Seating was surprising long with half of the tables open, 40 minute wait.. We were luckily","useful":0,"cool":1},"zcyobHwSUI4bnI1MyA-uYg":{"text":"SO SO GOOD. My boyfriend and I went there the other day and the food was GLORIOUS! He has ","useful":2,"cool":1},"TfwNuzsxUYzQZ4l2BsMtJQ":{"text":"Dined here with friends, a first visit for all of us.  Had a great experience enjoying the","useful":0,"cool":0},"NmF_a1Kmabsav7JY7dlZ-Q":{"text":"I have had better crust.  It is so humid here I wonder that anything rises properly and pe","useful":0,"cool":0},"7kMynxi48iWpheoMDLkO9w":{"text":"Great menu! Excellent service! I strongly suggest the raisin carrot pizza and the cauliflo","useful":1,"cool":0},"ateZiyJxuZFLB5V08Qzkvw":{"text":"The pizza was tasty but extremely salty (I love salt, but too much is too much).  Both the","useful":0,"cool":0},"RHgSOTfO4ITBNBCrokG5iA":{"text":"Pizza Dominica is a high end pizza place that is definitely one of the better options for ","useful":0,"cool":0},"knsKZc1WTHIkXTvVIy40Xg":{"text":"Great dinner.  The garlic knots and the pizza was outstanding.  They also have a great dra","useful":0,"cool":0},"LKTdCVndzINoqekKfX3oIw":{"text":"Been here several times and the food is on point, y'all.\n\nThe garlic knots are pornographi","useful":3,"cool":0},"EX8dYGQR7a4fJ6-Uzd_oKw":{"text":"Incredible pizza and the freshest ingredients of any pizza in town. I had the pizza Enzo w","useful":1,"cool":1},"N4z9fgQUz4p1q6K-IBr3aw":{"text":"Happy hour is the best!!! 3-5pm M-F half price pizza, wine and draft pizza!   Oh and it's ","useful":0,"cool":0},"4X9HSjFjJ6tkuAyVMeuErA":{"text":"We love this place but have to mark down our score just because they took our favorite ite","useful":0,"cool":0},"TtwOQ3xlnkCnrih21IttUQ":{"text":"I have loved Domenica's Pizzas for a long time, and was very excited to see the spot open ","useful":0,"cool":0},"OYEFdHsqrDHaAYy6OfcEaQ":{"text":"What a wonderful evening, went in with a large group and shared a ton of pizzas and had aw","useful":0,"cool":0},"9_CtnhmEoqjV6Ya3ycZtLg":{"text":"The food is a 5 and service is a 2.\n\nAs most people have already said- you must order at t","useful":2,"cool":0},"uMd5iEdd7HvYPT6C4WWBOA":{"text":"Reeeaaallly didn't like the \"interesting\" pizzas we tried--and I usually like unexpected t","useful":1,"cool":1},"z4JfSv6fj83NpnsSplucHw":{"text":"PD has very big shoes to fill because everyone who has had Domenica knows how well execute","useful":5,"cool":2},"iDnkAFecp3gc8P2CUPrcHQ":{"text":"Friendly staff, fresh ingredients, simple menu. Good pizza if you're in the area. The roas","useful":1,"cool":0},"C7X8VCpbBwTP2lFR354EIA":{"text":"This place has a trendy vibe but it doesn't hit you over the head with pretentiousness.  D","useful":1,"cool":1},"jyYda2bwwyoFllO2gk6bgw":{"text":"On my second visit, there was a NAIL in the pizza. They gave us free desserts and comped t","useful":2,"cool":2},"cHlHjoryRP938vS9e9fk4g":{"text":"Amazing!! We loved the garlic knots. You must try these! It comes with a whipped cheese di","useful":0,"cool":0},"fmTrhmWwM9REUfA4k5q7pA":{"text":"I've been a fan of pizza domenica, but my most recent visit was very disappointing. Ordere","useful":2,"cool":0},"iUIcz1fhGI6sZLvxosaZMw":{"text":"It's a cluster. They tell you to wait to sit until after you've ordered. When we were in l","useful":1,"cool":1},"EozKajvtgudFnqU_K7ToVw":{"text":"Really good prosciutto pizza, literally carved right in front of you!","useful":0,"cool":0},"aYZs-HhlF1_UiSaTvuE7MA":{"text":"I was really happy y'all were open for Christmas, but the only thing not burned was the Ca","useful":0,"cool":0},"9nYS2NyLxumI2wbqcArYPw":{"text":"Even the cauliflower was great. Of course the garlic knots. We didn't even have room for t","useful":0,"cool":0},"02l7m5K0hfdbmFpL0WvRqA":{"text":"I'm so torn... I LOVE the food. And the cocktails. The space is lovely (if loud). The loca","useful":8,"cool":6},"O7IQFY3kpquQVxt5-e8pJg":{"text":"Amazing pizza, with a wide selection of topics that are all great: meatballs, mushroom, an","useful":0,"cool":0},"9lwIiCvMIskWNJyimKlrMg":{"text":"THE WINGS!\n\nYes, I know you love Domenica for the pizza during happy hour, but those smoke","useful":3,"cool":2},"gEIwGlo-a3IZ-FJYi6gERg":{"text":"Ok so mabie I was hyped up on how the pizza was sooo good but not the case at all After lo","useful":0,"cool":0},"HlcLNw-c4AtXhHrakHIkBg":{"text":"Food is great. Service is lacking most days we go- we've gone about 10 times now so I feel","useful":0,"cool":0},"7qcG3ohJy69-Dz__dtntyQ":{"text":"One of the best happy hours in New Orleans featuring some of the best pizza but the roaste","useful":4,"cool":2},"fOaLruXLSoB8PczqQSwWMw":{"text":"Alright. So I returned again for another try for their Happy Hour. Why not try their pizza","useful":0,"cool":0},"hF50qKCq8B2MbF-7LuNdYg":{"text":"I was going to Domenica off Baroone St regularly until this place came on my radar. Pizza ","useful":0,"cool":0},"qZJdCCAyTOX4EDufqnrVxg":{"text":"The pizza was OK. We got a margherita and a carne. \n\nThe garlic knots and the CAULIFLOWER ","useful":2,"cool":1},"8-3CaiDQOTnWZmjxpxUdSA":{"text":"I tried Pizza Dominica for the first time tonight, as it was highly recommended to me from","useful":1,"cool":1},"8lFIkDRbfwvGhRKkctMJuA":{"text":"I easily give this place 4 stars on the garlic knots alone.  Came here right after I lande","useful":2,"cool":1},"j1FglRLCCqIx-gE_--_cNA":{"text":"The Clam Pizza was a definite must try. If you have a crowd, I recommend getting one of ev","useful":0,"cool":0},"KxbHJ_nxBv_9tFjRmcFTmA":{"text":"Words cannot express how wonderful it is to have Pizza Dominica in the neighborhood now!!!","useful":2,"cool":1},"-S0m4OMaIwi344csSRfjRQ":{"text":"Pizza Dominica in New Orleans on Magazine St. \nMe with 2 others arrived around4:30pm on a ","useful":2,"cool":2},"1Npy8nqH8W9K38Nh70uiZA":{"text":"Well, I hate to say it, but I just wasn't all that  impressed with Pizza Domenica. \n\nI cut","useful":2,"cool":1},"1LYxzBJ0h6dGWXikvwhCbA":{"text":"Amazing place. Pretty quick bringing the pizzas out and the staff is very friendly. The pi","useful":1,"cool":1},"iVIVBCFtQdryM6cD2Xus3Q":{"text":"The pizza is wonderful and it's so great to have a place open after 10pm in this area.  Th","useful":2,"cool":0},"LEAN4fad-YANaU25QIz-UQ":{"text":"SQUARE SLICES! Why is this on the menu and NOT identified as bread (focaccia) not pizza?  ","useful":0,"cool":0},"1N-5_STsguDoon7Ssx3gbg":{"text":"I really love the creative pizzas found here! I particularly love the Brussels sprouts piz","useful":0,"cool":0},"C-cKTO61pVmYbl5fOw69-g":{"text":"This place has the best Margarita pizza in New Orleans.  Super simple, fresh tomato sauce,","useful":0,"cool":0},"3AC23g1l4fMoJYEiPVY3iQ":{"text":"Always excellent food. My favorite is the roasted cauliflower steal and the chicken salad.","useful":1,"cool":0},"cUlbD7sWAd8iA7jjGQ1jow":{"text":"So many changes since my last review! Okay, really just two, but they're big ones. \n\n1) Wa","useful":5,"cool":2},"5R_mEIbyyqgM90VrUgwnww":{"text":"Great pizza and ambiance at Pizza Domenica. However, I long for the days of their happy ho","useful":0,"cool":0},"XNzkv5P7c0xFzF3551FwNg":{"text":"To start we arrived early, before they opened. They saw us outside and let us in. We start","useful":0,"cool":0},"tE5ilih-MqSLswV1_DoVAQ":{"text":"It amazes me how this place gets any good reviews.  We live Uptown and have tried this pla","useful":1,"cool":1},"Rr9u6ok21IpdchK43WCo5A":{"text":"Place will sneak up on you.  Large open area in the middle of the more residential section","useful":1,"cool":1},"aky9mQJybggzKO0wl_KE5Q":{"text":"Started with the chicken paté followed with the pizza. Half prosciutto half tutto carne. N","useful":1,"cool":1},"sNL9O74OL6rJsjD1bhHUVA":{"text":"5 star place!  Roasted Cauliflower with cheese was great, four people, four different pizz","useful":0,"cool":0},"aHCR9r3lspnbaAmTIfvaAQ":{"text":"We ended up coming here by accident because another restaurant we wanted to go to was clos","useful":2,"cool":1},"B40z4hlfvxNIi0k38PKpuQ":{"text":"Wow! What a great experience! Service was kind, friendly, and super accommodating, even th","useful":0,"cool":0},"3BVLGcGZEu8tJtGZVvxR9w":{"text":"3 stars because the service was lacking.  The restaurant was not full but the abundant wai","useful":0,"cool":0},"6zOBKsaG5aVZL9OSipEUeQ":{"text":"The four stars are directed towards the pizza only. Taking into account their organization","useful":2,"cool":0},"0A5JnnA7Ppd4-5udbfI94A":{"text":"Pizza Domenica is just as great as its sister location! I live right around the corner fro","useful":0,"cool":0},"q_UN1A4MHYP1gttmIREtkA":{"text":"UPDATE: It's mainly the hostesses that are sassy. Almost every time EXCEPT the African Ame","useful":0,"cool":0},"3NvK6wxlq_hypKyf-K1gpA":{"text":"I was visiting from California and after eating seafood for 2 days straight I was craving ","useful":2,"cool":0},"NzFXfwQ8cSYQ4pJFq8DZpA":{"text":"Two words, garlic knots. Probably the tastiest item I have eaten in years, and not necessa","useful":0,"cool":0},"_pCXnqxQkNnL9mCHI_plAg":{"text":"Great food great atmosphere overall pleasant experience. The ordering is a little weird an","useful":0,"cool":0},"CLjYM71EGhb6C2skNL1JBQ":{"text":"This was a surprisingly wonderful experience - one that I plan to repeat!  Next time I wil","useful":1,"cool":0},"r0ng22DF7pFxa5tcjW94kg":{"text":"If you are looking for good pizza in New Orleans, this is the best! I always make sure to ","useful":1,"cool":0},"1CEY73ZO6bn1Y1vPbQo3Lg":{"text":"I ate here again today and was pretty unimpressed. The only reason why it gets 3 stars is ","useful":1,"cool":1},"RsXy12KY0_YJjRGPsdBLig":{"text":"This is such a great local pizza restaurant! Really unique pie options. I went with two ot","useful":0,"cool":0},"2mmBth6jKS8itpDHsjt5Kw":{"text":"Friday Happy Hour...... \n\n1/2 off Pizzas and 1/2 off draft beer is by far the greatest dea","useful":6,"cool":4},"j9aYbfRZLRHeeJvASMKkbA":{"text":"I'm always on the hunt for great pizza in New Orleans, and was thrilled when Pizza Domenic","useful":2,"cool":1},"Zo3Uh0V9hXQ6cwVy9Gz-bg":{"text":"Meh, it was okay.... I'd say it was good by New Orleans standards, but pretty average comp","useful":0,"cool":0},"U6hXN-Wav2X0WvxNq7JJxA":{"text":"I thought the pizza was excellent.  Beautiful thin crust and fresh, tasty and imaginative ","useful":0,"cool":0},"DbA9um_cL_X8B5pAD9-s7Q":{"text":"The hostess was very friendly our waiter wasn't crazy friendly but also wasn't rude so I g","useful":0,"cool":0},"eByYDJKnGt6ARYyRWScsxA":{"text":"I live a couple blocks away and just ordered take out. The  roasted carrot pizza was reall","useful":2,"cool":0},"4Fkrz21QjU4PQwoP9DoFmQ":{"text":"I went for happy hour - half priced pizzas 2-5 and drink specials.  everything was just li","useful":0,"cool":0},"QUbazUsL_2RQ2GfJ5pfSeA":{"text":"Do yourselves a favor go in and order the garlic knots YOU WILL NOT BE DISAPPOINTED!\nI was","useful":0,"cool":0},"e9tbl1afiAD_qsQFO9WaOw":{"text":"Thanks to a very sharp Uber driver, my girlfriends and I opted for Pizza Domenica after ru","useful":0,"cool":0},"v9Vd0OFvrBbNxuc30CL9UA":{"text":"The offspring of Domenica in downtown New Orleans, this little (and it is... little) place","useful":3,"cool":1},"8CvHR71m_wlACEMwM1yjFg":{"text":"I'd definitely take advantage of the happy hour on weekdays. They have drink specials and ","useful":2,"cool":2},"t-tnEoIJFXB76CLCfvgHew":{"text":"Lovely environment. The garlic knots are awesome and the butter is delicious! Ordered lemo","useful":0,"cool":0},"rReyjxWOs6-EieLuv62nkg":{"text":"This place is incredible. The atmosphere is sharp, clean and great service. Daniel H waite","useful":0,"cool":0},"CglY8inHxV7hjw2LT_IkfA":{"text":"One of the best pizza places in the city. We tried the margarita, the prosciutto, and the ","useful":0,"cool":0},"iPhl-lwKC1RZIEJ8G80Xtg":{"text":"Painful for me to only give a three star review because the margarita pizza I had was exce","useful":1,"cool":1},"4uWTJHCRmqcjYOxVz75hvQ":{"text":"Yesssss. Before I write anything- Just order the garlic knots with the fonduta cheese stuf","useful":3,"cool":1},"y5Rb4Ka7m-ciixVf1t26KQ":{"text":"Great atmosphere and fresh and flavorful food! I really want to give 3 1/2 stars but that'","useful":0,"cool":0},"8mP5ify4DlYgM53LfvjWlQ":{"text":"Second or third time here. Had to try the chicken sandwich o have been seeing them show on","useful":0,"cool":0},"m44gSVdUrGvi7aSlfFqqUQ":{"text":"If you have free time between 2-5 PM on a weekday in NOLA, Id suggest the happy hour at Pi","useful":1,"cool":1},"VHA-lAozwp40J6oi6O5p8A":{"text":"Mamma Mia! Ayyyy carramba! If I gain 10 pounds I blame this place. Their garlic knots are ","useful":2,"cool":2},"rC0cRnVFYraqvKxQhnVlcA":{"text":"Tonight I sat at the bar- my friend and I had a great evening filled with amazing drinks a","useful":0,"cool":0},"Lhx4WMN0JyBnX1lqPUP78g":{"text":"Always have enjoyed eating pizza, garlic knots & salad here. We also ordered pizza when th","useful":2,"cool":0},"Ck9s6Jtc9O_l7BIfh-eKvg":{"text":"Clean and staff are extremely nice.  The atmosphere is fun.  I like the meatball.  My daug","useful":0,"cool":0},"e6cxu7Hz7oktolmph32cjQ":{"text":"The food was good, and as a fan of the original Domenica's in the Roosevelt, I expected no","useful":2,"cool":1},"3pXgJDkRaCpZYXX1mGk4qg":{"text":"I was almost positive the old happy hour at Domenica couldn't get any better. Then Pizza D","useful":11,"cool":7},"aZPR3mGJc5Bq49SO4BPDiA":{"text":"Been here a few times and ordered delivery a couple of times via uber eats. Food is very t","useful":2,"cool":1},"6-uVMUK_pKVUPld91LOJMA":{"text":"The pizza is so good!  Atmosphere is wonderful and a great selection of appetizers.  Mixed","useful":0,"cool":0},"9KG9gp836P7Xs1n6nzoOZQ":{"text":"Top 5 Best Pizza in New Orleans! You haven't had Garlic Knots until you've had these!","useful":0,"cool":0},"l0YFNszMlPRvieCcS5ozDw":{"text":"So I'm not much of a pizza person (as you'll see in a minute) but my friends wanted to eat","useful":0,"cool":0},"ZougYrvAubN1w2Kvu4Xlqg":{"text":"We had our Christmas dinner here and absolutely loved it. Food, service and atmosphere wer","useful":0,"cool":0},"vPtXAbxWIY28yQRr3Fi88g":{"text":"Loved this place...ESPECIALLY since they had a happy hour with the pizzas half off from 3-","useful":3,"cool":0},"FoQanMrOroKPZeglY9DaWQ":{"text":"Service has really declined over the last few months. We ordered a Caesar salad as an appe","useful":0,"cool":0},"IcdJqq74z9b2_KgGR8rqbQ":{"text":"The Uptown location was my first time experiencing Domenica after hearing rave reviews abo","useful":0,"cool":0},"CmXVusQtBlQ6ZHPd6Ggh9Q":{"text":"Oh my goodness, this place is delicious! I went with a group of my friends for lunch and e","useful":0,"cool":0},"KvvBxIJXk2vBo3iWAfTJMQ":{"text":"as always love the pizza here. not cheap though. pizza and cauliflower with some dipping s","useful":0,"cool":0},"w24bMOvu-AKFZeYbK8I4zw":{"text":"Wanted to try one of John Besh's restaurants in New Orleans. Was soooo disappointed. The s","useful":4,"cool":1},"QaJSNVdYu0A51xmHDVE8NQ":{"text":"Ordered in one night over our trip after a long day and not wanting to go back out. Found ","useful":1,"cool":0},"G02LrFi4VQZtkj-EeZDAsw":{"text":"We had the Garlic knots, the chicken sandwich, and the roasted chicken calzone, Amazingly ","useful":0,"cool":0},"-Sm2qrshzKXHoD57aG0hyQ":{"text":"This place is not good. I honestly can't believe people think this is even comparable to D","useful":0,"cool":1},"yAjbIs37dZ63U2qRNe8flQ":{"text":"I want to give this place 5 stars since I eat there almost once a week but there are some ","useful":0,"cool":0},"ck_SFOeq5djygjUyL0qbTw":{"text":"The garlic knots and provolone fonduta is the reason to go to this restaurant! The cheese ","useful":3,"cool":2},"iGlb3XSfILdTZemD1k7XMw":{"text":"I have been to Pizza Domenica many times, but today was different. I had the pleasure of h","useful":0,"cool":0},"f-uSuFhsS2QUB-Fkb8kU-A":{"text":"I'm definitely a fan of Pizza Domenica, which is a lovely pizza restaurant on Magazine Str","useful":4,"cool":4},"kSmI3mTjRYLR-DAGejtCqQ":{"text":"The pizza I ordered was very good but I was disappointed with the very small selection of ","useful":0,"cool":0},"YHcwTnhX9BxdphH9XquaWQ":{"text":"I live in the neighborhood and have eaten here a few times and it was \"okay\". More recentl","useful":0,"cool":0},"KqNVpQBf12UNjfO1r32dyw":{"text":"So I emailed the general manager and corporate email about our experience 2 days ago and g","useful":0,"cool":0},"-zJ0_kQM2c_hDUexRpGJ_w":{"text":"If you do it right, you can really get a great experience out of pizza domenica.\n\nFirst of","useful":2,"cool":0},"FNTTOSsEL32DS_sRJQUUXA":{"text":"Cool little spot swung by for Happy Hour since it was close to my job. Anything around mag","useful":1,"cool":0},"Xx37qEwjquPpqRE4c7O2OQ":{"text":"The pizza is always amazing and never burnt; it's flooded with toppings and flavor. My onl","useful":0,"cool":0},"8McKptQgVJbBdAmunrn7Bw":{"text":"This is my favorite spot for Happy Hour Pizza! Half off pizzas and drink specials. The gar","useful":0,"cool":0},"Ipb-hjgz4x_PUUwkYM6k1A":{"text":"Delicious REAL pizza! They offer takeout if you aren't in the mood for dining in, but the ","useful":1,"cool":1},"JbxuwAWFb3P40Lfbzh_vWw":{"text":"My favorite pizza place in all of New Orleans. Classic Neapolitan style pizza with an amaz","useful":0,"cool":0},"kjTZIe3X4ad3G_40fpD82g":{"text":"First time here with my family for my boyfriend & I's birthday! As an appetizer we ordered","useful":0,"cool":0},"Hsko9DyPeiJPV3_aLqtdcA":{"text":"Have been here a few times and returned tonight with a party of 6.  We were waited on quic","useful":0,"cool":0},"gp2iwMqfdfqgVnHdGT4u7Q":{"text":"Love love love it here!!  The pizza is quality for New Orleans (sorry native Philly girl) ","useful":3,"cool":0},"B42dfXOmm942PmrYxhIP2A":{"text":"The garlic knots are to die for! The pizza is pretty good too! But don't bring a big party","useful":0,"cool":0},"tBkXM6rOqKUHsdJAWXQpuw":{"text":"Where have you been? I can't believe this was my first time. My Daughter suggested it and ","useful":1,"cool":0},"-yjiETyF5QMLzsdmV1aDBQ":{"text":"One of the best pizzeria eateries I've been to in years. My husband is a pizza connoisseur","useful":0,"cool":0},"equ16RS120005OpBt4Zu1Q":{"text":"WHAT happened to this place? SHORT VERSION :GO TO ANCORA INSTEAD!!!! \n\nThis restuarant has","useful":0,"cool":1},"p0SaDJkQyNbLmU6CW0zM1w":{"text":"I love this place! It's-a good food! A concept restaurant from the restauranteurs who brou","useful":5,"cool":3},"1-3zpmqWA1gKyz774eBZsg":{"text":"Pizza Domenica is one of the best Napoli style pizza place in town.  It is a branch out fr","useful":1,"cool":0},"h9hYUlmKaPeftOfwNGBCZw":{"text":"So, we were looking for a happy hour yesterday (4th of July) and Sake Cafe's website said ","useful":0,"cool":0},"4ogRMdc3M2JA6pVWx_Ts6w":{"text":"Great overall experience. We had the pepperoni pizza, garlic knots - fantastic, mushroom p","useful":0,"cool":0},"AJfWmCbFQRQGep8j1pAYWg":{"text":"Order the garlic knots... Say it with me, gar-lic knotsssssss! Your belly will be so happy","useful":2,"cool":1},"6uxUJJpfH87kwr_4S7msLA":{"text":"I disappointed to say that as a long-time customer and fan of Pizza Domenica's, I experien","useful":0,"cool":0},"8FF4WSt54oPslPdDMLIlLA":{"text":"Meatballs with polenta was awesome. Didn't care for the caesar salad since it had too much","useful":0,"cool":0},"4a-mqRrcroyF5LKur7Ey1Q":{"text":"I have always loved PIZZA domenica, the food is great!! However, the last time we went the","useful":0,"cool":0},"pnhd3X3X_1xvxa5K-VysFw":{"text":"The more simple the pizza the better. Stick to the classics and you'll be fine. Garlic kno","useful":0,"cool":0},"AmW8DY_Eygpp1Qn9rAdyJA":{"text":"I come here all the time and always love it. I have to admit I only go during happy hour. ","useful":1,"cool":0},"5TnfPCNEOaw283EdGyid-g":{"text":"On a rainy Saturday evening, it was felt that pizza and beers on the front porch would be ","useful":3,"cool":2},"QqUmS-ClSSOanj38PtuR-Q":{"text":"I was excited to try a more casual, conveniently located Domenica so I convinced my foodie","useful":6,"cool":2},"Jo66QXGhNTmgWk12LfqQQA":{"text":"First time here, and I've been missing out! The interior was beautiful: elegant and cozy a","useful":3,"cool":1},"5Idkq3X61aeZ2os-gKNSKQ":{"text":"Let's make one thing clear, I continue coming for the BOMB garlic knots. So good! You have","useful":2,"cool":1},"Il9zwlfVZavWArfdlccthg":{"text":"First of all this place makes good pizza but they need to train their servers. Called to f","useful":0,"cool":0},"kS15jAjoqJKI2AwANW40uA":{"text":"Honestly LOVED the pizza..... But\n\nMy coworker got pizza for the team yesterday and as I w","useful":0,"cool":0},"DoLDZR6Dt2uFNwx5oqeUTA":{"text":"I tried this place for the first time last night and it was delicious! I went with 3 frien","useful":0,"cool":0},"A89EN4jo_g4BNrFC_2m-Pw":{"text":"Hands down BEST pizza I found in NOLA! A friend recommended it and we had to try. We got s","useful":1,"cool":0},"9EUYq5ySbG0n5Jwmvjqtvg":{"text":"Visited Dominica's last night and sat at the bar. Ordered the calabrese pizza. It was like","useful":0,"cool":0},"2Qo6mofn1GeEaVHhFa2lXg":{"text":"The space is great. Much nicer than my go to pizza spot Ancora. However, the pizza isn't t","useful":0,"cool":0},"93Ngy7yvzcaOswLEahRTeA":{"text":"I really enjoyed my food! I actually enjoyed everything about this place except for one th","useful":3,"cool":1},"yl30_d5-AucVn1jwFwHy3Q":{"text":"Love the place. Good atmosphere for a date or just a get-together. The spicy meatballs are","useful":3,"cool":0},"BOfkZhtxApD_vKNNePp_qA":{"text":"Love many things about Pizza Domenica.  Just one request, please.  Bring back the White Cl","useful":0,"cool":0},"Fn9_C3Gb-LfIWmIyBAF1KQ":{"text":"Got over charged for salad dressing $2 per dressing for 6 dressings. Called to get clarifi","useful":0,"cool":0},"2zFl7M87yJABzmDoY8jscw":{"text":"The pizza and appetizers were very good, we especially enjoyed the Garlic Knots. However, ","useful":0,"cool":0},"UjMTcdFdfv6eIJs8hDhH6A":{"text":"Same great service and pizza as the original one. But this one is WAY more fun. Its more c","useful":4,"cool":2},"NOoNInvlQmK0GEeZJnNP1w":{"text":"Great service when last i went, and the happy hour special is legit. Here is my gripe, thi","useful":0,"cool":0},"Jy53Ua3yisFZHATcvNy8gQ":{"text":"Nestled on the eclectic strip that is Magazine Street, uptown in New Orleans, is this wond","useful":4,"cool":2},"7g7u9HCyxOMZ53L8JKc3qQ":{"text":"The Happy hour specials are awesome! Would go here at least once a week! Great atmosphere.","useful":1,"cool":1},"gISk5BtGI5lymQ-yZ1XWZA":{"text":"So good!  Will eat here again!  Atmosphere and the staff were friendly and helpful. Food w","useful":0,"cool":0},"yGx-b-oHzmqy_Qft__Gfzg":{"text":"Well known casual pizza spot on magazine, mostly renowned for their happy hour (3-5 pm, 1/","useful":0,"cool":0},"HB4rJcf30A6wL_Dw42QPug":{"text":"We went on a Friday to celebrate my daughter's birthday. We made a reservation and were se","useful":7,"cool":1},"AonCTHWY-aIiIbIu8QuTPA":{"text":"Great atmosphere. Outstanding pizza!\n\nOne of our favorite pizza spots in the country. Crus","useful":0,"cool":0},"L5O87HnPlzf9t-5_YIccFw":{"text":"I just received my order from uber eats for two Caesar salads that were supposed to have s","useful":0,"cool":0},"IArCNCjxgrRCvjF8gtI9ig":{"text":"This place, along with the *other* Pizza D, is is one of my favorite pizza places in town.","useful":1,"cool":0},"HfOes4e2Xnet6gPSkdK2LA":{"text":"This is my favorite pizza in the whole city. I even like it more than Pizza Delicious, whi","useful":2,"cool":1},"7I6pVtJ-JAVbruhreQlEiA":{"text":"Such a cute and clean interior! Garlic knots were  also for the burrata caprese and Brusse","useful":1,"cool":0},"RFB1mHEDdihHDiPvMPcpRw":{"text":"I feel passionately about pizza. I've had multiple heated arguments about pizza. Most of t","useful":3,"cool":0},"xd0-ACWavgttemaIAGIT9g":{"text":"I was totally underwhelmed by Pizza Domenica. The place was nice enough but the pizzas wer","useful":1,"cool":2},"yWMXcKDGmenj1rvx-EqPng":{"text":"We had our Christmas dinner here and absolutely loved it. Food, service and atmosphere wer","useful":0,"cool":0},"pnptNnZMVUp1i2TMrvBoCg":{"text":"You truly can't go wrong with Pizza Dominica! Not only can you place an order for delivery","useful":13,"cool":15},"L3NtuOOzKSY-tyeriBghCA":{"text":"Yummy appetizers and even yummier pizza! The roasted cauliflower with the whipped feta is ","useful":1,"cool":1},"4R15XilTbwm76D7bnujYhg":{"text":"Can't beat the happy hour. 1/2 pizzas and draft beer. By far the best za i've had in the c","useful":0,"cool":0},"4aTBndKVbYk4hudYlEu0wg":{"text":"I ordered pizza domenica (usually amazing!!) but to my extreme disappointment when I bit i","useful":1,"cool":0},"QUdO8vbWgTHFHnKOUeJddw":{"text":"Open on Christmas Day! And the place was pretty packed on the dine in side as well as for ","useful":0,"cool":0},"qcvluaHyTtuuiDSoRzJQYA":{"text":"Not too bad as far as being  a \" real italian \" pizza, the wood fired oven is a must and t","useful":1,"cool":0},"w6boD5yLo5RFkqkLUmWZ3g":{"text":"Vibe is really nice, pizza is reasonably priced and unique compared to other pizza places ","useful":1,"cool":0},"KCLy8RgPmN1bhTBTA8Hf3A":{"text":"Everything was absolutely perfect, yummy food, great drinks, attentive/amazing service, th","useful":0,"cool":0},"g0EMOdpwwHnL19MyCZrbyw":{"text":"I've had amazing pizzas here before, many many times. The last two have been disappointing","useful":0,"cool":0},"3PWeAtOugCHx0QHJDAXPKQ":{"text":"Garlic knot appetizer is awesome.  The \"butter\" is whipped, airy and light and amazing.  P","useful":0,"cool":0},"ZWg9qFg3KejLvmalj-DzIQ":{"text":"Dominica is handily the best pizza around.  Very impressive.  Went for an early weekday di","useful":4,"cool":1},"KVC2aOTPb6lWSSy-hkG36A":{"text":"I wanted to love it but too many things went wrong.  Ordered a Caesar salad and pizza. Piz","useful":0,"cool":0},"KfnQIiwd9xzdH3oSK6H8Jw":{"text":"This is the case of where the hype outweighs the product. Ordered a double pep and double ","useful":0,"cool":0},"OHQCHUKqaQTyAaUHpUSAtA":{"text":"Strange times we're living in right now, so we called ahead to make sure dining in was an ","useful":1,"cool":1},"LTGVxpFYhXRMHEBgC1-Otg":{"text":"No changes to the food here, which is still the best pizza in New Orleans, my Girlfriend a","useful":4,"cool":1},"cz1NaAFMWHrpqNT1u_BArA":{"text":"Don't think of this as a pizza restaurant. One glance at the menu will tell you it's much ","useful":0,"cool":0},"c2u22selxO23nJHR0nFuCw":{"text":"Excellent.  Well run restaurant.  You can tell that the Manager is on top of operations.","useful":0,"cool":0},"FuyNuUxBrCb26QWXZowG6A":{"text":"Pizza Domenica is my go to favorite meal in New Orleans! Amazing food, never too crowded (","useful":2,"cool":1},"QTNVpeUX57G3MxiWhaNSqQ":{"text":"First time here. The first impression is impressive. The options available for pies are go","useful":0,"cool":0},"-UveBV9ARAg20em7plIX-A":{"text":"I love this restaurant I come here often. I called in today to reserve a table for two-the","useful":0,"cool":1},"FeSTuscXIC3nW6w8H9Z4Bw":{"text":"Wow! My wife and I went in on a busy Saturday night and was blown away with how good the f","useful":0,"cool":0},"PznEwbs79mcBGRlidqauEA":{"text":"Came here with a friend last night!  Tried to order 2 glasses of rose.  they were out...We","useful":3,"cool":1},"1BZKP7ozP0O1uJg5nabxlA":{"text":"i love pizza so much and this one was great. but tbh i liked the ziti more than the pizza.","useful":0,"cool":0},"NGf2LP3Qwu5AKBunmux4kg":{"text":"Great pizza,good garlic knots and fast service,and good atmosphere.The price is reasonable","useful":0,"cool":0},"R4Lgdky9Yf2RLWJIm0OJeQ":{"text":"I liked the atmosphere, service, and the food. I enjoyed the Margherita and Cheese Pizza, ","useful":0,"cool":0},"O3rzTPB-r240UeW0DbJHww":{"text":"I ordered 2 pizzas two times and had delivered. Growing up in Boston and living in NYC I h","useful":0,"cool":0},"evIjPfXpxgcwb2QzIDT0Ww":{"text":"Happy Hour is really the only time worth coming here. Half priced pizza and wine was good,","useful":3,"cool":1},"FisbvPaa1_EZe5lzPD73LQ":{"text":"IMO the best pizza delivery in NOLA. Their margherita and tutto carne pizzas are delicious","useful":0,"cool":0},"QHykSYwAPgQGI-SmSofalg":{"text":"Really good pizza, a tad overpriced but still really good pizza. Came here to support loca","useful":2,"cool":0},"7aS17A41phoSr6LLi7NQqA":{"text":"Nice assortment of creative-recipe pizzas, especially if you like thin crust.  They may be","useful":0,"cool":0},"SsM4g1KBaBD3iFyPTiECnQ":{"text":"First time trying and let's just say won't be back. First I find   black ants inside my pi","useful":0,"cool":0},"YLZsIx-fQL7NcV5ZbuEHuA":{"text":"Excellent pizza and cocktails.  Pizza crust comes out perfect and is crispy. We had the tu","useful":1,"cool":1},"uI0g314CvGAYkQGWdfm4vg":{"text":"Honestly, we order this pizza for takeout because my husband likes it.  I don't like it at","useful":0,"cool":0},"r-FLhjKT7Y6ej2AvMaSGOA":{"text":"Sat at the bar with another couple. Unfortunately, they served our pizzas at the same time","useful":0,"cool":0},"qaWoAOt6c871DVaIY2mPJg":{"text":"Solid gourmet pizza experience that doesn't disappoint. Ordered take out for a girls night","useful":1,"cool":1},"AvBLdaTmCesmg8wNGXUrzg":{"text":"At 7:30pm on Valentine's Day, they were out of meatballs and chicken so calzones and the m","useful":1,"cool":1},"3PBzA9Sj_JUNC2L46gJDPg":{"text":"Look, this wasn't my first time here but this visit was terrible. We came at a decent hour","useful":1,"cool":1},"Qb3RL6CTg4uG59VtTPbwPw":{"text":"There is only one thing you must know about Pizza Domenica: \n\nThe garlic knots will change","useful":5,"cool":0},"svG7xiE1VEy1weHfB-v9jw":{"text":"We stopped into Pizza Domenica on a Wednesday night around 8pm and the place was packed! I","useful":3,"cool":0},"VpIVjUsi0ippEsZAWtd9DA":{"text":"I know from previous experience that this place can make an awesome pizza. Sadly, our last","useful":0,"cool":0},"ASbmPmYOTeb1jLuva75Dtg":{"text":"Pizzas didn't knock my socks off but can you go wrong with half priced pizza and wine for ","useful":2,"cool":1},"J7uepXG7SplX4-LczRKA5A":{"text":"Great pizza place in uptown! Pizza Domenica is the more casual version of their sister res","useful":2,"cool":0},"jhZDRYLWHfBa1YSUVws9JA":{"text":"I went to Pizza Domenica for a nice afternoon lunch, I was greeted promptly by the hostess","useful":2,"cool":1},"-oXlb7HNB2kgp5y1XgWiEg":{"text":"The Burratta appetizer, the shaved Brussel Sprout Salad, and Pizza Margherita are the pref","useful":2,"cool":0},"OyFkI4Zun9tHjzLDwtwClw":{"text":"Well, we stopped in during happy hour around 5pm before I had to be at a work meeting. \n\nI","useful":5,"cool":2},"-M6i6bJqP3wFFqNvPMnWzg":{"text":"Ok , will keep it short.  Grew up eating Neapolitan style pizza from the New Haven, CT and","useful":1,"cool":1},"UeSXELu7GYvYypTvbYKoZQ":{"text":"This place is great if you want to try pizzas with a unique topping twist. We went on a Sa","useful":2,"cool":1},"LMEmhRCFEqk685NCvzwn8Q":{"text":"Cool spot. Place your order up front then they give you a number. Usually this bugs me wit","useful":1,"cool":2},"NzERa4lYHj6f6brIPUATOw":{"text":"Great, innovative pizza!  During our last night in NOLA we were looking for something easy","useful":0,"cool":0},"c-4PLG5ZMpZWuo_tUoMv0A":{"text":"Edit 2 : the pizza we got today was good like the old time .\n\nEdit 1: they reach out to of","useful":0,"cool":0},"GBDMcoEMFv-84v0GrNL-Og":{"text":"Came in for a friend's birthday and was wowed by great service and amazing food! First of ","useful":3,"cool":1},"CiAbkFkAHKvNXvgp0GEgvQ":{"text":"Talk about a cool pizza spot on Magazine!!! I got to the city on a Thursday night and I wa","useful":3,"cool":2},"p3Y2Gucm_vdJZJQR-GK7Ug":{"text":"We got some pizzas to go the night of Druids and Nyx, and caught the parades up the street","useful":1,"cool":1},"cLOL3KvSSJmUYUAkgM9cDg":{"text":"Every single time we visit my sister in New Orleans, we always take advantage of their hap","useful":0,"cool":0},"ts5HitJcGqKEFBoifwd9Yg":{"text":"First time here, never again. Sat down at table, waited and wait for server. Had to ask an","useful":0,"cool":0},"sjl1eDwe8T42mo0Ibyc9gw":{"text":"I would give this place a 0 if I could- just had a pizza delivered and it's not only raw a","useful":0,"cool":0},"_1YnykGRBTLCQZo_EMsVUg":{"text":"3.5 stars.\n\nSeveral months ago, I ordered a clam pizza carryout from here.  I was less tha","useful":4,"cool":2},"nnR8nLrcIQX2SopZcI9_Cw":{"text":"Had a delicious mushroom pizza from here, with roasted garlic on top & ranch to dip in (do","useful":1,"cool":2},"ts9Ves0r2WsM96jnUvZLXA":{"text":"I've been both here and the Domenica downtown, and I feel like the one downtown is better.","useful":1,"cool":0},"mT74rbC7vhnD9731qAyUrA":{"text":"The latest addition to the John Besh family of restaurants has finally hit Uptown. If you ","useful":3,"cool":2},"AssI3FwU6K6vlU6ZNj5DUw":{"text":"Went there to see football game and grab some food at the same time. Garlic knot is wonder","useful":0,"cool":0},"tLbqxoH9STAnX01TtknKTA":{"text":"If there was a 4.5 stars, that's what I'd give. \n\nGood pizza.\n\nOrdering online is so easy.","useful":0,"cool":0},"SGWEFfD-pEngpozGsuVTrw":{"text":"Love this place!  Specialty pizzas and happy hour pizzas!  It's always delicious.  You mus","useful":2,"cool":1},"GZVvWNHGWJonW_ctCOaCCA":{"text":"Pizza Domenica! Yay! This is my first time at the new offset location. I've always origina","useful":1,"cool":0},"1ZvwVqcp_uoNtT-KDYkGgg":{"text":"Ordered a white pizza and added chicken from door dash. When the pizza arrived, I took a b","useful":0,"cool":0},"obPl4mP2DPzU4pmGOEGeFA":{"text":"We came in to Pizza Domenica right before a show with minutes to close. The staff was tire","useful":0,"cool":0},"nOuR0wsf963MoUXCAwum4Q":{"text":"No more Ham & American Cheese Rolls?! No! That's the reason I visited but they don't want ","useful":1,"cool":1},"56t1v4bKn3Ak-5Xq913O1g":{"text":"New Orleans Trip; cute pizzeria super clean. \n\nFood; Appetizers were delicious ordered the","useful":2,"cool":2},"tiv4woVFPJVxKNoPCR59tQ":{"text":"This place has some great food and drink specials, including half off pizzas and $15 pitch","useful":2,"cool":1},"TbdrfnTPRc_1sq7Hsa_kqQ":{"text":"Came for dinner, so good! Had the margherita pizza and mushroom pizza. Delicious! For appe","useful":0,"cool":0},"RN6hO8YpHnrBRGuoILu5gA":{"text":"I ate a pizza here one time and remembered it for the rest of my life. I remembered I was ","useful":0,"cool":0},"5Jlni4RECsYQsi1PSmOMYA":{"text":"Hands down one of my favorite pizza places! I've tried many different pizzas on there menu","useful":0,"cool":0},"2Exmkp5bt3MR-36OkWsQMA":{"text":"*chants* garlic knots, garlic knots, garlic knots!\n\nUgh i literally want the garlic knots ","useful":1,"cool":0},"oSG3H5JlNn93rhSEoeLO4w":{"text":"Go to favorite for pizza night Fridays. Their appetizers & salads (garlic knots, meatball,","useful":0,"cool":0},"Wia_I2RSfBBBki68kY3sZw":{"text":"I came to this lunch spot with a good friend. The service was amazing, really fast, and ov","useful":2,"cool":1},"SnEwB4A93hzzfnYs-D21Ng":{"text":"I've been here a few times in the past and have always had a good experience. Their happy ","useful":1,"cool":1},"cy3vdKIhhWvLOXgiolwRkQ":{"text":"Update! Went again - service was great and we got a special pizza of the day and the garli","useful":1,"cool":0},"Pvl1dolex2LOtAPV9GDueg":{"text":"I saw this place on YouTube and decided to give it a try since it was associated with Shay","useful":0,"cool":0},"YjoqJt7haRNMphWv6u1K6w":{"text":"Tasty pizza, with a doughy, thin crust that picks up some nice scorch marks from the oven.","useful":0,"cool":0},"uFKw6MhSgQudgRDTS2iJVg":{"text":"Can never go wrong with this place. Pizzas are amazing along with the roasted cauliflower ","useful":1,"cool":0},"JwEDUlXb3ikffg75kfW8Hg":{"text":"GARLIC KNOTS=yes.\nGood place for a group. One of the best pizza spots in the city. I have ","useful":0,"cool":1},"tAY3sR2hacRJgPbjwdNhNA":{"text":"The pizza was hands down the best pizza I've had in a while, maybe even ever. Every bit of","useful":0,"cool":1},"W7Rw3xH-9jn8BMqCB2Eyzg":{"text":"I visited Domenica once before but I couldn't remember what I had so I decided to give it ","useful":2,"cool":1},"MfG1Y4X7wDrbUw8bH6T_Kw":{"text":"Well, this is very disappointing, I had high hopes for pizza Dominica, but I'm here to be ","useful":1,"cool":0},"bTIEfW32vywls1BdkOR1Wg":{"text":"Whenever anyone says some place is the best I immediately become the biggest pessimist eve","useful":1,"cool":1},"b2VGd62jrQ2nzyB_7lEMOA":{"text":"The pizza is pretty good. Fresh but a little under seasoned. The food and decor get a 4. T","useful":2,"cool":0},"Y80-rLYAFH_2KEWjGYg6JA":{"text":"It's crowded, but excellent.  Order at the counter.  I had the pizza with roasted carrots,","useful":3,"cool":0},"e3O2p7xYCpU2vuiGwwBfQw":{"text":"Very yummy! Caesar and caprese salads were delicious. Shared pepperoni pizza. Would defini","useful":0,"cool":0},"OcZFSfC0_CYz5tDTBEUJVg":{"text":"First time here with my family for my boyfriend & I's birthday! As an appetizer we ordered","useful":0,"cool":0},"RcXawunroghlYHg0xOYFVg":{"text":"I really liked the atmosphere. I really wish I enjoyed the pizzas we ordered, but it was j","useful":1,"cool":0},"YgjqlFWvitKoiyQy915V8g":{"text":"Pizza is not the food that comes to mind when one visits NOLA, but it should be! The reaso","useful":5,"cool":1},"GgdXTHSB-0OIm6eLH15now":{"text":"Great service! Good food! It's a must try! Our server was super sweet and very attentive! ","useful":0,"cool":0},"YrMaxe6RaJycH5AZUDZqaA":{"text":"I'm not sure what's going on but the last 4-5 times the pies have been off. Specifically a","useful":0,"cool":0},"b2Zc0xoVP1jZNyjPYvid8w":{"text":"Took a pizza to go last night and unfortunately didn't have the best experience. The pizza","useful":1,"cool":0},"WXrjHlDLX9s0BGv3Qt39DQ":{"text":"We ordered the wood roasted cauliflower, garlic knots, and the clam pizza. The aged provol","useful":1,"cool":0},"1G0zYPT-de9wK2xNYVoWnw":{"text":"Calling all Pizza Lovers, this place is a must-try! Why? Because from M-F,  3-5 PM, Pizza ","useful":5,"cool":2},"c8Bzc8ehWyITxsr9qdCflg":{"text":"Came for the garlic knots and whipped sauce. Got a piece of shit with a tiny amount of flu","useful":0,"cool":0},"Udd9W5D3uCGui9GI43vmBA":{"text":"Mamma Mia this is legit pizza! It's one of my favorite spots in the city to grab some pizz","useful":0,"cool":0},"Irq90SWJKnl6hqCbSh5q9w":{"text":"I went to this place for the first time during their happy hour.  I will say they have a g","useful":2,"cool":2},"D_l_D44nLN00I1iO2X2qiQ":{"text":"Delicious pizzas. Good beer. Nice folks. What more could you ask for? Lids for beers on ta","useful":0,"cool":0},"UMIaQvUrvYjLyL_UwNJnuQ":{"text":"We had a later dinner here. The pizza and pasta were tasty and nicely prepared. Our server","useful":0,"cool":0},"DgxVB_xN2rvY3p8_mw4VOA":{"text":"First time coming to this restaurant here. The service was great - I like the concept of o","useful":1,"cool":1},"tOJi3l8M3YfdkV4kw-zBFA":{"text":"One of my favorite spots for happy hour in New Orleans. Their deals are half off pizzas an","useful":0,"cool":0},"jOuYyEvOFecPzTURrkCA4A":{"text":"The perfect place to pop in after a beautiful walk in Audubon park. They had this rarity o","useful":0,"cool":0},"YGD36aihnU_a0kVFbo17VQ":{"text":"It was soooooooooo delicious!!! Everything I ordered had me dancing in my seat. The flavor","useful":0,"cool":0},"vZiPLcGGwhbHjVGR52n0lg":{"text":"I was soooooo close to giving 5 stars! Let me tell you what happened...\n\nWe arrived last n","useful":1,"cool":0},"OFoMfwKx0mEXBZp--nmuHQ":{"text":"Pizza Domenica is my favorite pizza spot in New Orleans- their crust is the best. You can'","useful":1,"cool":1},"JU8NonSZQu2aQCwhpRUKcA":{"text":"It has been a while since I have been by.  They were too busy pre Covid.  Afraid of the en","useful":0,"cool":0},"XkZvGXdXr7B0qQ2NGdqfzw":{"text":"Favourite spot for pizza in the city!! They have a great selection and it is very fairly p","useful":1,"cool":0},"7F-PuNkj4r683qc9pgc_iQ":{"text":"I ordered the margherita pizza and garlic knots. The garlic knots are amazing with their w","useful":0,"cool":0},"PkBesL5kTrzkJ4mfOFWzlA":{"text":"Great pizza and great garlic knots!! Seating is really close but the crust is so good","useful":1,"cool":1},"B15hBjLhQpjk4qq5RCE5pQ":{"text":"As I love Dominica's original spot, I had to try this one too.\n\nWe arrived at a little pas","useful":13,"cool":8},"z2KQj6PEmztG7sEsKW2AFQ":{"text":"I loved my first visit to Pizza Domenica. Everything that was ordered was made fresh and d","useful":1,"cool":0},"x56Z3BYTgvla7FdQy3sWdg":{"text":"I love Pizza Domenica! They have a great happy hour and the pizzas are awesome. Their loca","useful":4,"cool":1},"BucCfUZKA6VvkxT5IRylFw":{"text":"Loved this place earlier this year, but what happened?! I ordered two pizzas. One was cold","useful":1,"cool":0},"2knAd-TUKPiDy8fvSKCxgQ":{"text":"Domenica's CBD location has always been one of my favorite restaurants in town, with what ","useful":1,"cool":0},"Cj-6koVzmt6Jx4ecsGyDGg":{"text":"Pizza Domenica is a quaint little joint with all kind of subtle nuances to discover. From ","useful":1,"cool":2},"wscl43wbeD-NtQoIdAA4Og":{"text":"Sub mediocre experience here. I came here on a research trip, trying to find good pizza in","useful":1,"cool":2},"1Rvp-CoiEOArA5M0S7E01g":{"text":"This is going to be a mixed review--maybe even ambiguous. This review is based on one visi","useful":0,"cool":0},"xzrM_6YaHjf388LwlmMq9A":{"text":"We ordered a pizza and salad to pick and go. Was ready on time and pizza was hot and ok th","useful":0,"cool":0}}