{"PZjFGUJI-8jvFgm0op1x8A":{"text":"Gorgeous setting and very hospitable staff. They have a good Happy Hour with cheap prices!","useful":1,"cool":0},"V_Wah3uZiitwsnCPTC55tA":{"text":"I left this place feeling so disappointed. I was excited to try a new Caribbean spot. I wa","useful":7,"cool":1},"vXLbQDYfR9Xtowm7lFMvfQ":{"text":"This place is AMAZING. Right when you walk through the doors you can tell you've found an ","useful":0,"cool":0},"kaeqd6Xmz-HtAOg8PSzEWg":{"text":"My friend and I have been scavenging the city looking for the hidden jewels and I think we","useful":1,"cool":0},"dbApuDBl2CMwsn3VMUquQA":{"text":"We stopped in for happy hour while ambling down Magazine Street and loved this place. Supe","useful":1,"cool":0},"3Y8G2cb0Fv2cAjJeIwgy9w":{"text":"We stumbled upon this amazing eatery and was pleasantly surprised and completely satisfied","useful":1,"cool":0},"JkUKd0NwDLJRcWc-ka5UHg":{"text":"Now I will say I was fairly pleased with not only the food here but the very welcoming & a","useful":5,"cool":1},"vb96CRhzGi2fgYNYKp-OdQ":{"text":"This food was so delicious. The jerk chicken was moist and seasoned with a heavenly jerk s","useful":1,"cool":0},"IkvzLD5fG-ZrMQEQ_9xNug":{"text":"I really wanted to enjoy everything this place had to offer. Dropped in one day for lunch ","useful":0,"cool":0},"EuX6HT51rg679eV9oR8jdA":{"text":"Can we celebrate how amazing this place is. The food is mouthwatering. I have never had su","useful":0,"cool":0},"wGTs7hBLuioWmbI4-bvuVw":{"text":"Try the Crawfish Mac & Cheese, amazing. Friendly staff. Would def try this place again.","useful":1,"cool":0},"B_7lnlbHesBWHW_f8K-G9g":{"text":"Excellent food and service! The jerk rolls are AMAZING and my wings were fried to perfecti","useful":0,"cool":0},"dlvZw4Exvlife0ngzmJZEg":{"text":"I ended up stumbling upon bonnets because I wasn't aware that the hookah place was closed ","useful":9,"cool":5},"INGuRyn-ezzNs7XW_L_gNQ":{"text":"Stumbled in while walking down Magazine street. Both the drinks and the food were deliciou","useful":2,"cool":0},"OUDhZ9ES70wWke5LkWAyQg":{"text":"I just got in town Bonnets popped up on hot & new. The place had a nice size  crowd .The O","useful":1,"cool":0},"t95DwIBt_-N9yvbt3ym2Gw":{"text":"Months ago I read an article on Nola.com about this restaurant and I made up in my mind th","useful":3,"cool":1},"1KNidvkH7BEkSjsP51FgKA":{"text":"This place was absolutely terrible! My friends and I went here for the first time last nig","useful":0,"cool":0},"pcnwrjRoiD9m4Vuf4J7jWg":{"text":"Absolutely great experience. Servers, bartender, food AND the owner\n\nI had the jerk chicke","useful":5,"cool":1},"i0wtvrZo0-xIMAdCUg9QwA":{"text":"Outside of the long wait to be waited on everything was most definitely worth the wait!!!!","useful":1,"cool":1},"beV3TqDCHiIysVBP-o9QvQ":{"text":"We thought we would try this restaurant and were so sorry we did. The waitress highly reco","useful":0,"cool":0},"O0vdHCt_DIqgfueROuZL2w":{"text":"Stumbled into this lovely spot. The jerk rolls were the perfect appetizer to get us going.","useful":1,"cool":0},"k7s6GcyCNyB_1HRb4ajY9A":{"text":"This place is disgusting. I've seen the bartender pour wine back into the bottle. This was","useful":0,"cool":0},"HEpe5nCZLEThCh6jIGqpzg":{"text":"New restaurant in the Big Easy offering a varied menu of soul and vegan selections with a ","useful":1,"cool":0},"r4fjxY-7G_ZhwHU1RDZA1Q":{"text":"I was recommended to go to this new restaurant and I must say that they did not disappoint","useful":2,"cool":1},"u8CnAhLSLyKYKZS44B7DDg":{"text":"The place has been open for about 3/4 months but hands down, the food was to die for! Seas","useful":2,"cool":0},"_F5vr8B0oPc5KBhbXfYwbw":{"text":"You have to eat here!! We had an AMAZING time here! Christian was our waitress and she was","useful":1,"cool":0},"9JxYblqxHSHDDsUR_Thw7w":{"text":"What a treat. Was in the mood for Caribbean food and discovered this gem. From the moment ","useful":1,"cool":0},"Pl-5vFm5WcqPfX-BhfVN9w":{"text":"The jerk chicken is literally the best chicken I've ever had!  Bonnets is a super friendly","useful":1,"cool":0},"acGdXY8KjaXaZSmF2voUVg":{"text":"The Crawfish Mac and cheese was amazing! Comes as a side but is a good size meal for one p","useful":0,"cool":0},"hhmHtD4Z8L1TiiutIkhRAw":{"text":"My current favorite spot great service beautiful restaurant food is amazing great spices e","useful":1,"cool":0},"xkjfLnTwLxx_murtxGsszQ":{"text":"My new favorite restaurant in New Orleans. Incredibly moist fried chicken and the best mac","useful":1,"cool":0},"_rdM2lod4kiDzG7XOZSSCA":{"text":"Short & Sweet: The food is incredible! Perfectly seasoned, spicy and well executed. The ox","useful":1,"cool":0},"INpzgCV6ZFv-26_F5khXPA":{"text":"Our order was forgotten and we waited at least half an hour. $25 for one leg of fried chic","useful":0,"cool":0},"taIkAzPPiw8JWCyD1KLgWA":{"text":"We've been in New Orleans for a week now and this is our favorite place to eat. We ate the","useful":1,"cool":0},"b60vwbm6NTbsDZgR3-lY0Q":{"text":"We enjoyed ourselves at Bonnets NOLA! The food was GREAT! We ordered OXTAILS, FRIED GREEN ","useful":1,"cool":0},"TSNss8aJhzRF3xBIgzNw8w":{"text":"They have a DJ on Fridays, so bring a group of friends to enjoy a Friday evening dinner an","useful":2,"cool":2},"9nf-pNsVWbZUB7kSmBTcpg":{"text":"Good jerk chicken tacos on Taco Tuesday, weird clear plastic furniture and awkward service","useful":2,"cool":2},"flINJON63NeMW_hbl7kZrw":{"text":"This place is great, great service, great music and great food. I can't compliment them en","useful":0,"cool":1},"t0dHIkGqd2yuzgGgjJNz_g":{"text":"Here on vacation and this is the first place that from the second we walked in everything ","useful":1,"cool":0},"-putNG1U-VarsB6Jfi1YfQ":{"text":"I'm giving it 5 stars because not only is this place cute, the service is great the ladies","useful":2,"cool":1},"p57OwGbAvfpO0hCNVXSTDA":{"text":"So damn delicious!!!!! Was in the neighborhood to take pictures, needed to waste time so I","useful":0,"cool":0},"0teWCpoyI1EfiQ-_2NCBfQ":{"text":"This place is so fantastic. I came here a couple of months ago and I guess forgot to put m","useful":0,"cool":0},"Q-MdY_bxHerMDE9VijL6lQ":{"text":"Normally closed on Mondays, these folks opened their doors to a San Diego family who appar","useful":1,"cool":0},"cIKfBI_nPC3cdlFKXWmG_w":{"text":"This was our first dining experience in New Orleans. We were wandering around on Magazine ","useful":4,"cool":1},"tHmpuaMrQTnFe1uhP3hsZw":{"text":"Best conch fritters I've had in a long time! The jerk chicken wraps were delish as well. F","useful":1,"cool":0}}