{"_S44Jm2gCyvhO0pDAq-kWw":{"text":"Walked by and my son and I got the scent of fresh fried seafood and we had to stop.  Servi","useful":0,"cool":0},"eHa9yxiZR6kcGF68ttyzzQ":{"text":"Discovered Mr. Ed's in the in February as my wife and I are always in search of a good cha","useful":0,"cool":0},"Eoun5qTCkSuUypJ7EEbtjQ":{"text":"Service:   Very professional yet laid back. \nAtmosphere:  Quiet but not weird. Clean enoug","useful":0,"cool":0},"CKQ-2MfNSVxolwpMLoaq6Q":{"text":"They have best food in town! My friend ate a dozen of raw oysters by herself, I had the cr","useful":0,"cool":0},"Jch21TaJxWVw4st01ipFMg":{"text":"The charbroiled oysters are the best I've ever had! Also got the crab cake alfredo meal. S","useful":0,"cool":0},"4ZahAA1P2OMBi2MPKIqlBA":{"text":"The food and service was very awesome. The Southwest Oysters and the Shrimp n Grits were a","useful":0,"cool":0},"dt5x5of6NyrbhPkZDk7AhQ":{"text":"Great food and great service... I highly recommend it.  We had the Charbroiled oysters, se","useful":0,"cool":0},"VNyBR2ZogvMLN-XbvxZVVA":{"text":"dropped in for lunch. ordered shrimp poboy and a couple beers. poboy was classic! so good!","useful":0,"cool":0},"Bd3Wqtzp7VNrR02EmOd4qA":{"text":"Nicole our waitress was great, our Appitizer was taking a little longer so she brought us ","useful":0,"cool":0},"4nJ-3fyDGLlWaoaB_AP5fg":{"text":"Omg this place has amazing service and food.  Highly recommended.  We had the fried alliga","useful":0,"cool":0},"6SE-J5YqTPU5XGLMSnBggw":{"text":"Had a bowl of Creole gumbo, it was delicious. Another time i had the taste of Nola, again ","useful":3,"cool":1},"pJ3ALFTJM8ICupQTyzeu1g":{"text":"Great fresh seafood. Waitress was very friendly and knowledgeable about the food. The oyst","useful":0,"cool":0},"ARTDicmtbwepLp57Z6cgag":{"text":"After a very enlightening three-hour New Orleans Cocktail History Walking tour through the","useful":1,"cool":2},"dTq_wMPHxrVIK66t5du6GA":{"text":"The food here was stellar. We had the crawfish stuffed bread...amazing, fried alligator wa","useful":0,"cool":0},"ovxjOIY4IIBMm14ZXu3row":{"text":"Although I do not eat seafood, the atmosphere and staff made the meal for us! My crew LOVE","useful":0,"cool":0},"6R0o1bZs66IBcxB1M_Eneg":{"text":"Two words... Crab Cakes!!  This is a quaint little place in the French Quarter.  I was sea","useful":0,"cool":0},"nay-40YfzdXDJFry8TqNJQ":{"text":"After careful consideration we picked Mr Ed's oyster bar for dinner tonight. As it worked ","useful":0,"cool":0},"m60YJqXSmAGPLXCVbl4Cow":{"text":"Thanks to Joy at Kezic Gallery for telling us about this restaurant! The chicken and andou","useful":0,"cool":0},"bAmmAoG7Z8zjeTO2uFs5xQ":{"text":"Took a group of 8 in for lunch....made to wait 20 minutes for another group to leave with ","useful":0,"cool":0},"5r7SQC5wWZH0NhLeezSGAw":{"text":"The food was acceptable, nothing to write home about, but it took 15 minutes to get a wait","useful":1,"cool":0},"W88SfHcbuhAN_k1lW44DCA":{"text":"First stop arriving in Nola. Came with the wifey to the french quarter and ordered couple ","useful":0,"cool":0},"cFe_u_V0WaJOS_XAdgjwDw":{"text":"Blackened salmon and veggies were amazing!  This restaurant was recommended by a local and","useful":0,"cool":0},"CGaHlDTfrslAMrWw7wFcPQ":{"text":"Stopped in for a quick lunch and was pleasantly surprised. I had the oysters and they were","useful":1,"cool":0},"8yNItmecZCuId3Xfu8GJOQ":{"text":"Mr. Ed's Oyster House is a local chain of restaurants.  The French Quarter location is on ","useful":2,"cool":0},"O2_0F56OrYeQRGFMwyg9KA":{"text":"Had the oysters Rockefeller boy was it delicious. Seasoned  well with a big chunk of bread","useful":0,"cool":0},"mEd-Jg9r9NbQMP_V16vVlA":{"text":"Great food!  The real stuff.  Etoufee (sp), red beans and rice were on point.  BBQ shrimp ","useful":0,"cool":0},"4w1kXfSgBz9_oTgnkfDogQ":{"text":"Visited here while in New Orleans for the Falcons vs. Saints game. Food was really good. A","useful":1,"cool":0},"0anIi8PZ1vM6B-Q33bMgaA":{"text":"While on the way to the Acme Oyster House, we were greeted by a nice guy who worked here. ","useful":0,"cool":0},"qQb_UIFFUWNu20quIlLnOQ":{"text":"Crawfish bread is by far one of the best dishes I've ever had!!! Charbroiled oysetwrs are ","useful":0,"cool":0},"SjFOLgQGLzj_2WdO_UqXqg":{"text":"We stopped in for some drinks and appetizers.  Loved the set up,. Very friendly staff, gre","useful":0,"cool":0},"ncd-QV94dD-VZz7JznV9ew":{"text":"Great food and excellent customer service!!! The charbroiled oysters are absolutely amazin","useful":0,"cool":0},"1Fx9gnD9YWhH77ipHNib0g":{"text":"Friendly service and great eats. This place was recommended by someone who lives in Alabam","useful":0,"cool":0},"upvE9t0h5OqxP_zqjGCVkg":{"text":"The food was great! This is our first to New Orleans so we asked around where to get authe","useful":0,"cool":0},"EhNK1KvdezYzByL2wJYxzw":{"text":"So i just want to put out a public disclosure that I enjoy going to alot of restaurants an","useful":2,"cool":0},"GQDwMTkMu2aGacSSF8FHfw":{"text":"This was my first meal in NOLA, and by far the worst. I dropped my suitcase off at the hot","useful":0,"cool":0},"iOqBnDfKFegPdvVUiJIY1w":{"text":"I was completely underwhelmed. The food looked tasty, but it was \"meh\". \n\nWe ordered the b","useful":1,"cool":0},"J1N8dRLNTGk_1NbRvEFwkA":{"text":"We came here from a recommendation of our concierge who told us it's just like Acme Oyster","useful":0,"cool":0},"iZXn3e6KUTiVEw1REZg6Zg":{"text":"Every time we go the food and service is great.  I've had the fried alligator, Shrimp and ","useful":0,"cool":0},"qT-hJMmVmchtBC12b1ezpA":{"text":"During our week in New Orleans, Mr. Ed's was the only place we visited multiple times beca","useful":0,"cool":0},"4r1M68An_Jpx1oIObtlnHQ":{"text":"Great oysters (both raw and char grilled). Very friendly staff.  They do allow dogs at the","useful":0,"cool":0},"su8l8RACsiCxlZQsCF8ilg":{"text":"If you want FAT oysters, this is the place to go!!\n\nI was in NOLA with the family, and I w","useful":1,"cool":0},"ftzowlGnC19QDdqBkL6USg":{"text":"The food was good but my wife's fish was undercooked.  Kind of ruined the meal.  Shout out","useful":0,"cool":0},"BY_yb0_3_XX7ser_wXyTuQ":{"text":"My first time trying charbroiled oysters, and they were out of this world. Got the crab ca","useful":0,"cool":0},"0cXYqbWL70tQrE9qUwxOnQ":{"text":"The airport limo driver suggested this place and he was spot on. The oysters are fresh and","useful":0,"cool":0},"MDLSwOjSvaz1Zi_X_S4tFw":{"text":"Our Lyft driver sent us here after giving us the 411 on how Acme house is overrated. We th","useful":0,"cool":0},"yLiQP8ngX41oS-hNlPD4qg":{"text":"Fun place, great food, Theresa is the BEST waitress!!!! The crayfish bread is delicious,  ","useful":0,"cool":0},"fk8s6Ok8GVBOeafkJMBzjw":{"text":"The Southwest charbroiled oysters were phenomenal. I had the red beans and rice with the c","useful":0,"cool":0},"Im-qxokQZyRGDFYPLDYJAQ":{"text":"Mr. Ed's was a great choice during our visit to New Orleans. Firstly, the establishment is","useful":1,"cool":0},"ptTBaCKrkzhB7243uWlxHg":{"text":"OMG! Charbroiled oysters!  These were incredible!  We got in pretty quickly and were serve","useful":1,"cool":1},"tQDxArc8VDB5uVgnp1h-3g":{"text":"I left this place in absolute pain from my stomach being stretch to its absolute limits. F","useful":1,"cool":1},"jT7sHq3gH2mjZUHWHGMmrQ":{"text":"The baked oysters were amazing, the snapper and red fish it so much. Bloody marry was good","useful":0,"cool":0},"rv3YSr8WhsYAkk2UYLGifg":{"text":"Wings arrived fresh out of the fryer. The heat was perfect, tons of flavor and even the cr","useful":0,"cool":0},"7rH0-yAELJ21jzJXXQRnng":{"text":"What a way to end my trip!  I went to Mr. Ed's on my last of 6 days in New Orleans.  I wan","useful":0,"cool":0},"EL523WFJWpODm-RVwLmvDw":{"text":"Great joint with friendly staff and dynamic service and delicious food. Highly recommend b","useful":0,"cool":0},"x80ZgzkgBAM75hXo7EkRfg":{"text":"This was our favorite place in town.  As visitors from Texas, we came to NOLA looking for ","useful":0,"cool":0},"wcCfaV8kFGfT_XZopD8iZA":{"text":"This was my first visit to New Orleans and I wanted to really experience a very good place","useful":0,"cool":0},"OwBGOQGt9p_v1bPf9sqH4Q":{"text":"The portions are very large here so sharing is easy to do. The best Item on the menu that ","useful":0,"cool":0},"6yDQaFKF-pOqTi8axnctGw":{"text":"Really good southern food. The charbroiled oysters were amazing. Service was quick and the","useful":0,"cool":0},"xaGZp2pVveLTrs6Mk55r1Q":{"text":"Reviews were on point.  Had both raw and cheesy oysters and they were delicious.  Fried gr","useful":0,"cool":0},"s7vmBnkubqWPTMIRcc13lA":{"text":"Came here for our first experience with crawfish, and we were not disappointed!! The servi","useful":0,"cool":0},"gd8M19_1u14hXqwne_uB-w":{"text":"This place was great. The hostess was so sweet and our waitress Latoya? put up with our sh","useful":0,"cool":0},"jeUADiaHikBueaiNHvkyzA":{"text":"Best attentive, friendly and warm service we've had this weekend ( thanks Theresa! ). Seaf","useful":1,"cool":0},"mkAPIF82WxVKSb73lkuKHQ":{"text":"Went there for dinner tonight and food was good. A little bit too seasoned. Wait time was ","useful":0,"cool":0},"Mv15OlnIExXCMfu8h0JF9Q":{"text":"Amazing service, authentic vibes, and delicious fresh food that's moderately priced! We lo","useful":0,"cool":0},"SXHaFORWjB17jHDLJaaxwA":{"text":"Best raw oysters in town. The Fish House  Seafood platter is great and big enough for too.","useful":0,"cool":0},"yyGQUW4ZHUjIVxm9pa-3Lg":{"text":"Probably the best raw oysters I've ever had. Meaty and flavorful. We ordered a dozen and t","useful":0,"cool":0},"IJNZUF7zrqVtFiHm1TUUWg":{"text":"Went here on a Saturday night when visiting NOLA for the first time, and the food was just","useful":2,"cool":1},"ityeuow4ZhluMyKr_1Cy5w":{"text":"Had dinner at Mr. Ed's in late-February during my vacation in New Orleans.  Started with a","useful":0,"cool":0},"2a8VWmw1eiLwnh8wERUfCg":{"text":"Loved the red beans and rice!! The bartender Mike was awesome! He took really good care of","useful":0,"cool":0},"ErH-5uZf71lFI__eWXFdLg":{"text":"I'm so glad I ordered something that was out of my norm. The Charbroiled Oysters are absol","useful":0,"cool":0},"KP2h3jPsQUcefsPA_jW3Zw":{"text":"I liked this place, yes it's a bit corny and a tourist kind of joint but the food is good ","useful":0,"cool":0},"tUn1_XYZIX_ODZl_ADmZ4g":{"text":"Wonderful! Fun!  Yummy!  These are a few words I'd use to describe our dining experience h","useful":0,"cool":0},"EwuBidDJtB92nlm2WFMLLA":{"text":"The oysters were definitely a 5 Star. The cocktails However SUCKED!!!! Don't eve bother ge","useful":0,"cool":0},"s8FpjJXKp-_ZXkXMLz54Mw":{"text":"If you're going to indulge in New Orleans' oysters, Mr. Ed's is the place to be. There are","useful":4,"cool":0},"Mr25971MVp-pWwKqh5fcxw":{"text":"The food is sooooo New Orleans... love it! \nThe hospitality is welcoming and, just remembe","useful":0,"cool":0},"qMG1ZDoueFIiKJxBgmSNtQ":{"text":"We pulled into New Orleans and we were starving so we stopped here, the first place we saw","useful":0,"cool":0},"8g3dMlKCb7bOP3kwV4qQ4A":{"text":"It only was the food absolutely amazing and very well priced for the city, but Lyndsie our","useful":0,"cool":0},"Cu9BVwDuerBARTRj4l4IIg":{"text":"Mr Ed's exemplifies a great culinary experience!  From welcoming staff upon entry, to tale","useful":3,"cool":3},"NC2Tyg1ix7mTg32UVukDGw":{"text":"Alright....\nForget Acme.\nFelix's had their turn too. \n\nThe reign of Ed has begun. \n\nBask i","useful":2,"cool":1},"an7D_UyNDmBOk0aFp8WAWw":{"text":"This was our second time visiting Mr. Ed's and it was just as delicious as the first. I or","useful":0,"cool":0},"A_Ev9VrGTHmYMZxs2fyAhA":{"text":"This was our last meal before heading out of town, and it was a doozy. The softshell was g","useful":0,"cool":0},"DV4A8meeEAd0tepBWz9NGA":{"text":"Yummy!! Nice ambience right off Bourbon St. Great selections and grilled oysters with Chip","useful":0,"cool":0},"s9QqOMLbLmMJGLs9ufilpw":{"text":"We found this place last year while heading somewhere else, we were invited in by the host","useful":0,"cool":0},"ChO_TK3slsjHOh9o8q--jw":{"text":"The food and the staff here are fantastic. I came here 3 times during my 4 day trip to NOL","useful":0,"cool":0},"OEdNwFYzAoKMf1grq85CQA":{"text":"Our favorite NOLA restaurant by far!  My husband and I ate here three times during our wee","useful":2,"cool":0},"yUUrcBz4z9P4ZMOfeDvNHQ":{"text":"First time here. It's right near where we stay in NOLA so hoping it's a winner!  \n\nOrdered","useful":1,"cool":1},"6emN8s4iTPZc_Y8KnPKVDw":{"text":"I stopped into Mr Ed's for the Crawfish Bread to go which I had read was \"life-changing.\" ","useful":2,"cool":0},"dPqVkMwGuIOR9ii-fCQGQg":{"text":"Oh my....the red beans n rice, alligator & charbroiled oysters were soooooo good.  The cus","useful":0,"cool":0},"7DKyZtPGCdiBoo9WOe6eWQ":{"text":"Wow so impressed. The charbroiled oysters were amazing. I went to Acme the night before an","useful":1,"cool":1},"oq3t07pWiMBUOet2gfhbCQ":{"text":"Being in the French Quarter, I was afraid this would be a tourist trap but I was very happ","useful":0,"cool":0},"jqkkLETAsNBJyDdf22pMYQ":{"text":"Food was good and the waitress was sweet but she made paying our bill really annoying, the","useful":0,"cool":0},"K5nJGPnK3kaZMpRs0EmPwA":{"text":"Loved it! Wait staff was friendly with a great variety of personalities. Best raw oysters ","useful":0,"cool":0},"ZAk_jUDl6JjZDKu4WbHbzQ":{"text":"This place was hidden off of Bienville closer to the Riverwalk. I've been going to NOLA fo","useful":0,"cool":0},"1u2dFv6-ESi1O9VQRrXaxQ":{"text":"It was ok tourist place. The only complaint would be the waiter charged us $5 for hot wate","useful":0,"cool":0},"ne-vwFGWRXTPZ2poN3vLtw":{"text":"Blackened red fish was a welcomed delight. I thought it was a tourist trap but I walked ou","useful":0,"cool":0},"JBsLFjndBuigJ2Z73kDqOQ":{"text":"Absolutely, THEE best char grilled oysters and Hurricane drinks \nGreat wait staff!  (Ask f","useful":1,"cool":0},"Jy74A6itVUYO-W0_hmG7_w":{"text":"I was recommended to go here by a young bartender from Felix. Thanks thanks thanks iT was ","useful":0,"cool":0},"X39ZXUf2LlnU9sFb8O3uvA":{"text":"Just finished lunch. Had the fried gator appetizer and fried fish plater. Any fresher and ","useful":0,"cool":0},"dacPfF3qdmP6sEbNA1PkEg":{"text":"Excellent.  Amazing bbq shrimp and grilled oysters\nThe fried red snapper is flakey.  The f","useful":0,"cool":0},"1-3eWiRh2tnpnREyUvvMFQ":{"text":"Oh My Lawwwwwwddddd!!!!! That was some great food!!!! The raw oysters were so smooth! Mehn","useful":0,"cool":0},"Ze1IXqmyBkdbK5cw7Ah_kA":{"text":"I think this restaurant is a chain and not a unique hole in the wall, but!  It was delicio","useful":0,"cool":0},"R6C1i271FlJdvo9kQRTg-w":{"text":"Amazing. A true authentic taste of New Orleans. From the shrimp and grits to the shrimp cr","useful":0,"cool":0},"T96YIt0-yvfJdMMxYjlHyQ":{"text":"Found on Yelp and although off the \"strip\" this restaurant is a must stop for oyster lover","useful":0,"cool":0},"1jkAu2IEmwGgqRsls_XuOw":{"text":"Best place in town to eat delicious, reasonably-priced raw oysters. Not much to the decor,","useful":6,"cool":3},"U_QFFvhh9iEJsweI2g_Mbg":{"text":"Mr. Ed's had a very nice vibe from the moment I stepped in the door. The menu was very bro","useful":0,"cool":0},"yeW82rsW8vocPP312fRfMg":{"text":"Great food, great service I highly recommend the fried cat fish also the jimbalaya Cajun r","useful":0,"cool":0},"i1ywECZCNX-AMvTd56T6EA":{"text":"What a wonderful place. Small, funky, and so full of charm and character. And now let's ta","useful":0,"cool":0},"6l3CRyzYso8XBRP_hiRj8w":{"text":"Ed my waiter was absolutely amazing... food was . Would definitely come back again. We had","useful":0,"cool":0},"yQ4d628CFaTcFhalp_jX7Q":{"text":"Good location, fast service, good food. A few more oysters on the Po Boy would have been g","useful":0,"cool":0},"4wN-g7cmMXrlCDPCM7FETA":{"text":"Awesome grilled oysters, Gator that actually tastes like gator instead of fried something,","useful":0,"cool":0},"cDvj_bbnYHKKJxcwzTAJKA":{"text":"So, I heard about Mr Ed's in passing, and was very glad I did. After being warmly welcomed","useful":0,"cool":0},"aKpJmCiyaeBVxdBtLMaa9g":{"text":"Fantastic little restaurant. Hands-down the best barbecue oysters I have ever had. Fun atm","useful":0,"cool":0},"80pwxo-eEr7q53ictQiR1w":{"text":"My wife and I had their roast beef po boy sandwich.  We were excited to have one for the f","useful":0,"cool":0},"XNS98eJCmIspjdREA4qbwQ":{"text":"Really good, nice big clean oysters and a phenomenal banana creme pie. It's a must have.","useful":0,"cool":0},"hknsywhJPQ0wbq6xHRBquQ":{"text":"This unassuming spot was the best meal I had in New Orleans. We had just finished a swamp ","useful":2,"cool":1},"rnNrCIiVqsx2TXmf6whNug":{"text":"had an issue with the roast beef po'boy. Had an odd flavor that might be described as star","useful":0,"cool":0},"zTmnEHtDdIL1ejkEDuBKvw":{"text":"I wasn't an oyster fan at all however by the time I left New Orleans I am in love!! Michae","useful":0,"cool":0},"hM7gHjA4c0wfMHwQr2oNRQ":{"text":"Went in for lunch on Saturday. We were seated right away. Our Server was great. Helped us ","useful":0,"cool":0},"j39blNtDUfzLWUY5fq0mGw":{"text":"We went to Felix and ACME - both lines too long. Came her - service was fantastic and food","useful":0,"cool":0},"FIXhvFyR9mzl2te7kLSjSQ":{"text":"The crawfish bread was DELISH! The gumbo was okay to me. The service was good and it was f","useful":0,"cool":0},"7C331rE00zXMHrnfeSwH0A":{"text":"The oysters were fresh, plump and delicious! We got a dozen each of raw & grilled. So good","useful":0,"cool":0},"a35yzra-KkkQQNh5jr8B9Q":{"text":"Awesome oysters. Did not disappoint. Great service by our kooky and entertaining host Greg","useful":0,"cool":0},"dHnB66y3OJqB_S5Gd2wIcw":{"text":"Yet another place that will be remembered for the ambience more than the service.  The ins","useful":0,"cool":0},"EwBQ40qwhCv5UNTg2xCBTQ":{"text":"Charbroiled oysters here were WAY better than the ones we had at Drago's yesterday. Plump ","useful":0,"cool":0},"5jOOZ2nH9PQujurMwkIB1A":{"text":"I am rating this restaurant on my last day of my vacation. When compared to other similar ","useful":0,"cool":0},"Vx1pVjA0GnRHucJ7u_B6Og":{"text":"This was the last really good meal we ate in New Orleans and we saved one of the best for ","useful":0,"cool":0},"Ikws_KFE3Camcpykqfe7-Q":{"text":"Service was good. We tried the ettoufee, jambalaya, red beans and rice, and gumbo. The gum","useful":0,"cool":0},"8JdlVv4xcULHmwt7RVFc-A":{"text":"I'm from Baltimore and we LOVE our seafood! So when i ordered the Fish House Seafood Platt","useful":0,"cool":0},"ttIhlVcKw6X4mf5BTWEmkg":{"text":"Mr. Eds was right on point, with Everything!!!!!\nTHIS IS NOT A TOURIST TRAP LOL!!! \nSo we ","useful":1,"cool":1},"GCHWlyNsJOD8ZZxlGVVJGw":{"text":"Unfortunately the food was rather disappointing. However 5 stars to our server Russel and ","useful":0,"cool":0},"E-hFOKUPAMK6pGlz9Bpujw":{"text":"Creole plate was great! Shrimp Creole, Crawfish Étouffée and Jambalaya. Fried Green Tomato","useful":0,"cool":0},"NvHLS8arlxBdZnBoKiwYQg":{"text":"Best fried catfish and oysters around. Lightly breaded and crispy. Great gumbo. Nice size ","useful":0,"cool":0},"j4QehqHvue1sTjlMpWYtng":{"text":"I was super excited to come here when I saw the reviews.  But my dining experience was A-O","useful":0,"cool":0},"kW5WoiyAMOC7y8K3BZBI1Q":{"text":"Grilled oysters were great. Wasn't a fan of the Southwest ones with the jalapeño. I was ex","useful":1,"cool":0},"60fjXy_TerwGnsfu8XDLzA":{"text":"The bartenders and regulars at Chart Room are always recommending this joint, so i finally","useful":0,"cool":0},"qRhUSDWuZ3c9lfq7OXNt9g":{"text":"I was very pleasantly surprised with our dinner at Mr Ed's.  The staff was super welcoming","useful":0,"cool":0},"s91-D-X_uYDJaMJWiy52bQ":{"text":"To set the stage: this is the French Quarter in N'awlins where gulf oysters and mudbugs ar","useful":0,"cool":0},"GQkW54e87WjcmVBQf7Mlew":{"text":"We tried Mr. Ed's based on good Yelp reviews and we were very happy. The fried alligator, ","useful":0,"cool":0},"73dWOFrEZlgQOGTYavqw3Q":{"text":"Great food. A little expensive but good for what you get.  Great service and good ambiance","useful":0,"cool":0},"Vq61ToVKHCMBJrcW7eJYww":{"text":"Great for Oysters. Always consistent with the food, but service could use a little pep in ","useful":0,"cool":0},"EVLG3HbYyK0uxVdtf7diyQ":{"text":"The food was definitely 5 star worthy, but the overall experience was 4 stars because of t","useful":1,"cool":1},"LLVG5VWccJg3AomFKqyiBQ":{"text":"Our favorite dinner place! Oysters on the half shell were the best! Crawfish crab cakes, j","useful":0,"cool":0},"ueBo_6YrR29OhIGeNH3Hag":{"text":"First off...Chris was a wonderful waitress!  She is a walking ad for the restaurant!  The ","useful":0,"cool":0},"Ktj1-j5NiSl-OkSaDReDag":{"text":"What an amazing find! Stopped here on a whim and found a treasure. I've had the chargrille","useful":1,"cool":0},"SR9f33USmj1KgHWv2TLOqA":{"text":"We enjoyed mr. Ed's that we actually ended up coming here twice. Our first stop was for lu","useful":0,"cool":0},"kufqVjzH2TVT9tg-3Jw7MA":{"text":"We went to Mr Ed's oyster bar as we heard it was great for charbroiled oysters.\n\nThe charb","useful":1,"cool":0},"0qwpMV9j_mcHyol9Cba3NQ":{"text":"Tried to go to Acme but the line was around the block. Got seated almost immediately here.","useful":0,"cool":0},"jYXQu-QXc3-mYmvPSL533Q":{"text":"Came here for an impromptu B-Day dinner not expecting much but it was really very good!- G","useful":0,"cool":0},"7N5gG_-iiCKoTVEBRQnDXw":{"text":"Terrible service. Waited over an hour for our food. Was informed they were out of bread fo","useful":0,"cool":0},"P_UXJPTRm-jSS_-XZQDrhA":{"text":"Came here bc we were starving. Sat at the bar with Steve as our bartender. He showed us th","useful":0,"cool":0},"UO4OZBG41L1LZ1pkgjfi5w":{"text":"WORST restaurant in the French Quarter!! We began our night by sitting down with a table o","useful":0,"cool":0},"dPovzIU-pBtoHZJQnmHxYA":{"text":"Oyster fest this year was basically rained out so we headed out in search of some raw on t","useful":0,"cool":0},"TZG_k3HacgFftDNBTMB7Vw":{"text":"The food was delicious but the service needs a little work. The oysters were good but for ","useful":0,"cool":0},"qadoZl-RdXSpEYZbFPxdtA":{"text":"Food was good but the service was terrible\n\nI ate here on March 6, 2016 and was very displ","useful":0,"cool":0},"s_1I6iU4_VRKFIHmo7hgWQ":{"text":"The best barbecue shrimp in New Orleans!! The gumbo was among the best I have ever had, bu","useful":0,"cool":0},"E3FOjlI3rcvJVII6RN4Rfg":{"text":"For our last supper in New Orleans, we wanted to eat some oysters. This place was nearby a","useful":1,"cool":0},"mG5oXiesA_m4MI0VhGYkUw":{"text":"This place exudes what the Quarter brings as far as quality service and ambiance.  The pla","useful":0,"cool":0},"cjYlFjZyUmj_C_Zo3E5GEQ":{"text":"Great experience! Southwestern charbroiled oysters were a hit! Some of the best gumbo I've","useful":1,"cool":0},"t3_HtUoGt7d4ZYa_dWEYwQ":{"text":"Excellent Service the minute we walked in the door.  Server and manager were friendly frie","useful":0,"cool":0},"Hn_ZqRI8c2j7mezY_iG8wA":{"text":"I would give it a ZERO if I could. The only nice person was the hostess. It was not busy a","useful":0,"cool":0},"1_lpLVZ1iTECTWqTiyl1fQ":{"text":"This place was definitely a great choice as we made it a point to have charbroiled oysters","useful":3,"cool":2},"SS_Ve1PRTU1bL0nnfpaNUg":{"text":"Fried Alligator and Crawfish Crabcakes! Stopped by this place while walking around the Fre","useful":0,"cool":0},"U2x_Vorcpi998mAf_VNB8A":{"text":"The catfish is wonderful and you can't beat the customer service.   I sat at the bar and M","useful":0,"cool":0},"9rG0XzlJDVSBdvmjN65l7w":{"text":"Best oysters Bienville I've had since Katrina!  NOAL Blond draft and a salad wedge balance","useful":0,"cool":0},"FyNKCnvxgjqm16j0ZhYvPA":{"text":"We had a great experience at Mr. Ed's with good food and good service.  We ordered fresh o","useful":0,"cool":0},"jIDUMpcWIfW00AGvPT29Eg":{"text":"We went here for dinner with a group of six on a Saturday night around 830 and didn't have","useful":0,"cool":0},"nmmR_6OVMqF-uCst7R3asQ":{"text":"The BBQ shrimp appetizer was delicious! \n\nI had the seafood gumbo, which seemed a little l","useful":0,"cool":0},"_vxop22npUmdU1B-qPeP_g":{"text":"This was a pretty random stop on the way to somewhere else. Steve the bartender hooked us ","useful":0,"cool":0},"INPWZOjlClWjdt1JGhn6nA":{"text":"Awesome, generous chargrilled oysters, come with plenty of parm and garlic and a nice hunk","useful":0,"cool":0},"OFU5Z_ZQXQVAJD-WyVeOGQ":{"text":"Everything was delish!\nFrom the raw oysters, grilled oysters, fried shrimp to the crabmeat","useful":1,"cool":0},"tjs1fob5z4Uxs1PiAlPzig":{"text":"Noooooooo! Why do I keep having off experiences at restaurants that are rated higher than ","useful":0,"cool":0},"Nu36oGNpBGBM6nWEFtigzQ":{"text":"The only redeeming feature of dinner was the fact that we did get food and that the compan","useful":0,"cool":0},"C6Ntbrlkwd5UiVwE7gcW6w":{"text":"food here was just... decent.\n\nalligator was just a simple fried appetizer with dipping sa","useful":2,"cool":0},"JLe8aJPgE97fLtx4Cunhdw":{"text":"We stayed in New Orleans for three nights and Mr. Ed's was one of the highlights of our tr","useful":0,"cool":0},"V8lbpEq241ULxjlsxZ0OGg":{"text":"Wow. The grilled oysters are amazing, as were the onion rings. We ate at a lot of places o","useful":0,"cool":0},"zH7lFqiSWMNhlybsAQjkPg":{"text":"Came here for dinner. Service started out great but went down hill. Drinks were never refi","useful":1,"cool":0},"R9pARv5gdzEyEC0pNqlC1A":{"text":"This place was amazing.  Food was authentic and delicious.  Try the crawfish bread.  It is","useful":0,"cool":0},"Ei9kEmyV5Fovw3qlabyeuA":{"text":"Ridiculously good food at a fair price. My gf said they were the best oysters she has EVER","useful":0,"cool":0},"ShfCjpLV2V4IuDgcG8sUrw":{"text":"The staff at Ed's are great!  Very attentive and pleasant. The wedge salad is a very healt","useful":0,"cool":1},"HyOy5-WcT6_K6PRyR7RwNg":{"text":"We ordered 2 dozen char broiled oysters and they were delicious. We also ordered a side of","useful":0,"cool":0},"2PewSsEZ83iuvZmq05z-Sw":{"text":"Great food, great host, very good servers. Try the crawfish bread. It's cheesy, creamy and","useful":0,"cool":0},"HfHF3QMBSF6krfgmSmM0uQ":{"text":"When we walked through the door the greeter told us we would not be disappointed and he wa","useful":0,"cool":0},"IIxaKyU5x3zVs-qgKWchzQ":{"text":"The Food was good. It was recommended to us by a server from another restaurant. One tip, ","useful":0,"cool":0},"kerzIQwNbBHj5Ii6IJffbw":{"text":"I just had dinner here with my family and the food and service was great. Brian was helpfu","useful":0,"cool":0},"Di9_14PRkfFtBP0UCu7J6Q":{"text":"Our dinner here was the best food experience thus far in New Orleans. The host on duty was","useful":0,"cool":0},"xzjiPrhmayN3BazLKMoaSA":{"text":"Okay, here goes...\nWe went into the restaurant and was asked if we would mind placing our ","useful":1,"cool":1},"pm9DS9rMfSP6jjYJLxRREA":{"text":"The oysters. Absolutely amazing. I had the charboiled oysters, which were covered in butte","useful":12,"cool":12},"npIGnNXK8N0oNpHHn9sm2g":{"text":"Mr. Ed's had a nice vibe and there was a small wait when we walked by so we stopped in for","useful":0,"cool":0},"fqwjTsIkE_MmQoLGKNimbg":{"text":"Shrimp po' boy was excellent and the red beans and rice and crawfish patties were too! Lov","useful":0,"cool":0},"ys9BIQGb4mHgpmb47g3Lxg":{"text":"Insane charbroiled oysters, oyster po-boy and probably the best meatball po-boy I have eve","useful":0,"cool":0},"azHIssLbK79mnzIWBXrEjg":{"text":"We ate here our first night in town. The food was great, with large portions!! A must stop","useful":0,"cool":0},"4Bp7JcBlJr1z7dG4nc-Wmg":{"text":"Ridiculously amazing!!! Catfish - meaty, thick and tender - just like I like my man. Shrim","useful":0,"cool":0},"kbh5NjkxvKuznjwUhAhLJQ":{"text":"Great place for seafood. Probably the best place for charbroiled oysters when comparing th","useful":1,"cool":0},"Av23Bsvm07U4k0JbIY1sTA":{"text":"Great casual eatery in the French Quarter with great crawfish etouffee, oysters, blackened","useful":0,"cool":0},"rwm-LpvYlw-WySEl0bFwCw":{"text":"Good food & service. Nicely tucked away off the beaten path and you will miss it if you do","useful":0,"cool":0},"hNx1C_lemj8YV4tWtDoa4A":{"text":"This was a perfect surprise to find this little gem of a place in the Quarter.  We are fro","useful":0,"cool":0},"9fT0ST33VPb037GdJhGA9Q":{"text":"Maybe I've already been to the best places in New Orleans, but this place was not very goo","useful":0,"cool":0},"fpUa4IPfgbkNccqoYmC9yw":{"text":"Delightful charbroiled oysters. Came here during Mardi Gras and only had to wait a bit for","useful":0,"cool":0},"MRFQl_BpToru8w3r93oI3w":{"text":"I went there with a group for my bachelorette party for lunch.  They said they were out of","useful":0,"cool":0},"5cq26L0LRtLNgmg4B3efvA":{"text":"We are locals and frequent the Kenner and Metairie locations which we like. Called to make","useful":0,"cool":0},"r4nHiHLa8HVRK6SJ38wLgw":{"text":"In town visiting New Orleans and a local suggested this place.The service was top notch. O","useful":1,"cool":0},"B0zIuoRJBnkMLXXDGrcdqg":{"text":"First time in New Orleans, and my first pool boy in New Orleans. This is a small place, bu","useful":0,"cool":0},"mZXCtEJAB6pP7R057qV2pg":{"text":"Great food for great prices! Try the seafood platter but make sure it's for 2 of you!","useful":0,"cool":0},"n1jF9dFN6j2km3S2-u6FVw":{"text":"So good! We had the crawfish bread for an app and what is not to love about fresh baked se","useful":1,"cool":0},"NqQpdJzNSsJedcoFrDsDTg":{"text":"I really enjoyed the food and the service. I had the creole gumbo, the crawfish crab cakes","useful":0,"cool":0},"BJMSyqWrsfxv3Nu2KJuvdQ":{"text":"Meh. We went here on a recommendation from several people but it definitely didn't live up","useful":0,"cool":0},"4qu-7OmSQUdTNEeQJzTI4g":{"text":"Friendly staff and great food!! My boyfriend and I really enjoyed this place! First time t","useful":0,"cool":0},"4_0NJAvaGq4nUAmmHj41hg":{"text":"Amazing. Hurricane was great. Chris, our waitress, was delightful. The charbroiled oysters","useful":0,"cool":0},"AFVS10ewN8gQdnWoO6U03w":{"text":"I come to New Orleans twice a year and this is th first time I've been to Mr. Ed's. Amazin","useful":0,"cool":0},"bW6N3jFG7BBYWq_cbLAj_w":{"text":"I ordered three different versions of their baked oysters just waiting to be amazed and fa","useful":0,"cool":0},"p-oiqr2Td647KFHNIW5wEg":{"text":"Not bad, but not the greatest. I went here with my colleagues when we were in town for a c","useful":0,"cool":0},"yl8EonEQf4fjc24Pl24Z-w":{"text":"The drinks were cold the food was great.   The service was a little slow but overall a goo","useful":0,"cool":0},"Kb3us18wQfOeo4yefgloNw":{"text":"This place was great!  Between the boiled crawfish, the jambalaya, red beans and rice & th","useful":0,"cool":0},"dXDrYEECsxUjJoV5u-Yszg":{"text":"So happy I came here! It was recommended by my hotel and they were very right ! The food w","useful":1,"cool":0},"qBGY8m3ZWLnmnd5CpQySDw":{"text":"Greeted immediately upon arrival... seated immediately....waiter came immediately.... plea","useful":1,"cool":0},"aV96CpFEfKa2tZkXFN1J-A":{"text":"Portions were huge. Staff friendly and place was clean.  Excellent oysters and the Po Boy ","useful":0,"cool":0},"5k1iu1KNfyGuXTM4WKQj6Q":{"text":"Mr Ed's was good coming from Florida where I eat oysters a lot....I liked the Char Grilled","useful":0,"cool":0},"jf4m2xpOoYziBIZtL_H9hw":{"text":"Came upon this place by looking for somewhere to eat by a bar we wanted to go too. This pl","useful":0,"cool":0},"cCDbVQ-1Tp08Q1KUGojgjA":{"text":"Grilled Oysters are fresh and as tasty as any I've had. Served with bread and a wide selec","useful":0,"cool":0},"ulC7BTw0B0GMRSIaJ-COqw":{"text":"Fun & funky place to have real seafood! The staff were great our waitress was right on top","useful":0,"cool":0},"e9PekilOJhYzLv9W5fZnQA":{"text":"This place is amazing from the staff to the food. Everything is top notch!!! Makes me want","useful":0,"cool":0},"Y0fVX3vNSM_NorHlZ_UtjA":{"text":"We had a team dinner here on a Wed night this Feb and I had the Creole Redfish and it was ","useful":0,"cool":0},"jPjIgfjCmXPsjqjZ73obag":{"text":"The only thing I felt needed to be improved was the customer service. It wasn't terrible, ","useful":1,"cool":0},"h8EsqInIEjCiI2AzARWkeA":{"text":"This spot is food. All the fried foods including oysters were good. It's a great staple in","useful":0,"cool":0},"SUpVru-H_pAE6KXpcHDK_Q":{"text":"Amazing food, great service. Oysters are legit! Latoya and Lonnie are tons of fun. We had ","useful":0,"cool":0},"83ofJk4oyxCt1Kp7yEjkbA":{"text":"We just arrived in new Orleans and didn't feel like waiting in a line in the rain.  Our ho","useful":0,"cool":0},"DYtXfLblKulG3JL7DZ9-zg":{"text":"Okay option for food in the French quarter, but I wouldn't go out of my way to come back. ","useful":0,"cool":0},"_nxiELFiJ4P7glQSUuu-pw":{"text":"Great service and excellent food in a mom-and-pop atmosphere. I had the shrimp po-boy and ","useful":0,"cool":0},"ySN5AZ3Wjk1yyWYwbGv3Jg":{"text":"Really fresh and tasty oysters. I'd definitely recommend coming here for the oysters and s","useful":0,"cool":0},"lGU3dQj57VONy2XMHl43TQ":{"text":"Was there 10/14/17 had a bowl of shrimp and crab gumbo which was very flavorful despite no","useful":0,"cool":0},"f9xo0JZ5bEuGhNJkF_pylw":{"text":"This restaurant is so delicious! Our waitress Krys was amazing! She made us laugh and had ","useful":1,"cool":1},"ri-Itw6C38ooo714ebrLRA":{"text":"First time in NO and was recommended to try Mr. Ed's. It's a hidden gem. We literally walk","useful":0,"cool":0},"iGswRV4nv2a9l7w7vH5l8A":{"text":"The minute I got to NOLA I was on a oyster po'boy mission.  On day 3 I found it y'all.  Tu","useful":0,"cool":0},"-8sXaqg59EbpIZa6JaHXSg":{"text":"Excellent service, comfortable seating  and some of the biggest oysters I've ever seen can","useful":7,"cool":7},"7yT9zT5vOfjnWvk3imnJnw":{"text":"Oh Yeah, you want a taste of real Nawleans food without all the tourist fanfare.  This is ","useful":1,"cool":0},"n6rnhQ8olT5XeMEGF99kjw":{"text":"After the reviews i wanted to give this place a try the atmosphere was good for a tourist ","useful":0,"cool":0},"Vkr-Iq6gAeC9iVQqjc8-0w":{"text":"Location: Louisiana\n\n1st night in Louisiana and we were walking the streets during Mardi G","useful":1,"cool":0},"LxBrJbEii_y6B7iWa6NKqA":{"text":"Awesome little spot! Stopped in for a snack while touring HOLA streets... I had the Seafoo","useful":0,"cool":0},"HEHm03eIoegKNPzgrBh0xA":{"text":"Great quaint little place. Host wss awesome. Sat outside and visited a bit while they were","useful":0,"cool":0},"n4RRK-6VVZNhia-sZmU9vw":{"text":"Walked by this place on our way back to our hotel. We didn't have the streetcars down yet ","useful":0,"cool":0},"e0gIn-n8aKghr-JqRSwIUQ":{"text":"Catfish platter is delicious.  No dirty taste here.  Fresh juicy perfectly fried catfish a","useful":1,"cool":1},"XWuagb8OStMjINTPF0ucTg":{"text":"The food was awesome! Our server Latoya was very friendly and made our visit very enjoyabl","useful":1,"cool":1},"yA7zBVzT7TKIHJOC_ggs0Q":{"text":"This is for sure my fave restaurant in NOLA! Their chargrilled Oysters are so flavorful, t","useful":0,"cool":0},"uWZb-W8xmZgRgiP4nursdA":{"text":"Where do I start?! Came by on a Tuesday night and sat out on the small patio section. We o","useful":1,"cool":0},"nRs5uve0I41b2orp4BTiUw":{"text":"Food was just ok. I was looking for more flavor. The jambalaya was good. The grilled veget","useful":0,"cool":0},"VuHUs3_O2jajMoLIZvet4Q":{"text":"Given the reviews, I was expecting big things. I had the iceberg lettuce wedge, charbroile","useful":0,"cool":0},"TRiULr0JGfj7ug2XPLDl3A":{"text":"Food was over the top awesome.  Wait staff couldn't have been more helpful and friendly.  ","useful":0,"cool":0},"jtCPuDe6gYZHgmwoDTtlzA":{"text":"We've had many a'chargrilled oysters from all over the Southeast but DANG were these great","useful":0,"cool":0},"hblLgQdBiVcURE0jFMgcfQ":{"text":"I dashed into Mr. Ed's Oyster Bar (that name makes me think of the horse, honestly) before","useful":0,"cool":0},"lHh78iQraLPYW-VoIwPUcA":{"text":"Great meal and staff. Worth every penny and if there is a wait it's well worth it. Taste o","useful":0,"cool":0},"0_zZtbI5M_j0Dcr7EAG7dg":{"text":"Everything we ordered was on point. Seriously, these folks are serious about every detail ","useful":0,"cool":0},"I5Pi4fxifNf_1LR-5lyx_w":{"text":"Our first stop when we arrived. Recommended by Blair at the Hotel Monteleone. We were not ","useful":1,"cool":0},"zwp7mTIwg1kDEJ1qp56Lzw":{"text":"I had the redfish with the crawfish étouffée and it was very good! Some others in the part","useful":0,"cool":0},"eehYye9ulPm5UEbpOYOxgA":{"text":"If you want oysters in NOLA this is the place to go. It is a fun little restaurant with fa","useful":0,"cool":0},"eYkVLgbKCzfD2sEYVO3BGw":{"text":"Found this place by accident when walking down the French quarter with my wife and 3 kids.","useful":0,"cool":0},"0BUGgkw1ia_pVy9PXi42xw":{"text":"One of our regular stops when in Nola. We always stop for the Chargrilled oysters. The fri","useful":0,"cool":0},"icJt9x4yJou4roJwz7Rfpw":{"text":"We got half a dozen oysters and a shrimp poboy. Absolutely loved it!! I am an oyster fanat","useful":0,"cool":0},"Y_jyeMs9y-yHzPDraDQePg":{"text":"My friends, sister and I accidentally fell upon this place. Greeted with smiles and sat in","useful":0,"cool":2},"UueAqhYRu-ochcSMIGQGmw":{"text":"We came here based off of all of the good reviews we saw online.  First time in New Orlean","useful":1,"cool":0},"hZn6yJjTYvJQqCosauiWag":{"text":"My wife discovered Mr. Ed's through the Yelp app and based on the reviews we decided to wa","useful":0,"cool":0},"1iZcC1JVpjdqYlcAWkowCQ":{"text":"A quant place in the French Quarters.  The gentleman at the hostess stand was so nice and ","useful":0,"cool":0},"gv19L8Irqa-0a1voKheaYA":{"text":"This restuarant is great in my opinion. Darryl my waiter was awesome! Great service. Great","useful":0,"cool":0},"HecxQjR8sS0uNkL5fVh_Ew":{"text":"I wasn't expecting much when I stumbled across Mr. Ed's Oyster Bar and Fish House, the ins","useful":1,"cool":1},"WGZjqbP3IXsmUcA_TFzb7w":{"text":"I don't know what to say about this place. The chargrilled oysters were tasty, but the bre","useful":0,"cool":0},"NHGBHf0-ae4W6ryKVCWveA":{"text":"While visiting New Orleans, I decide to try out Mr. Ed's based on the reviews that I read ","useful":0,"cool":0},"nyQz8swSj3wb12jnB5pDKQ":{"text":"We came here for dinner on the recommendation of Yelpers.  We had raw and grilled oysters.","useful":1,"cool":0},"fUspnaru4NXk-tJyoeFN3A":{"text":"Absolutely outstanding food!!!! Great great service!! The gentleman at this restaurant cou","useful":0,"cool":0},"hy1hZ58OZFXnPppsvL-YGQ":{"text":"I will say that the 4.5stars (when I looked the place up) was not enough. Konesha was our ","useful":1,"cool":0},"jYczwdbtn0vTmnF8xiFAIw":{"text":"You have to have the blackened red fish, chargrilled oysters, Louisiana fried shrimp dinne","useful":0,"cool":0},"TPOoV5ul9NuAsYILJKATbQ":{"text":"Overall I enjoyed the experience. The chargrilled oysters were pretty good and I enjoyed m","useful":0,"cool":0},"LA_3Y7oSnuBEWkqYjlPahQ":{"text":"Excellent oysters on the half shell. Jambalaya was excellent! Latoya was an amazing server","useful":0,"cool":0},"QJdQKjGrilVOIv0UXEdvMA":{"text":"In the ocean of oyster bars in the Quarter, I had great incredibly friendly service with s","useful":0,"cool":0},"_Ja_XGycMinBEeNd5bqs7A":{"text":"Great place, portions are perfect size to leave you full but not stuffed. My family are he","useful":0,"cool":0},"IDD21qZiQnScHfhOln2Lew":{"text":"Food: Food was great. I got the oysters, it took a lil long to come out but they were pret","useful":0,"cool":0},"fNLQByVlgrYl2mZg8Zf0cg":{"text":"Place was ammmmazing!!!! Set at bar with Lyndsey and our server and she was fantastic! So ","useful":0,"cool":0},"XHQWPWD0WStisYyo30xytQ":{"text":"Thank you Yelp for getting my wife and I to this amazing place. The entire staff was very ","useful":0,"cool":0},"dJwSeZQeXp63R9hfB9e4mA":{"text":"Awesome place to eat. Service was spot on! Food was excellent! Small cafe seating with bar","useful":0,"cool":0},"lRHdhYG1VZyUO-JRJ1vQTA":{"text":"Where do I start? Refreshing. Exceptional service. Delicious drinks and food. An absolute ","useful":0,"cool":0},"ZoaKCBcI-dB7GkcUawjgnA":{"text":"Great food, super nice waitress bubbly and fun, was able to tell me about the dishes she s","useful":0,"cool":0},"CPMYRW42POjoo4ROfoxqXQ":{"text":"Oyster po'boy, fully dressed! Wonderful crisp fried outside, moist juicy hot oysters insid","useful":0,"cool":0},"ijoa7DZ_eXf2tvE_VmHRuw":{"text":"Fantastic dinner! We loved the authentic La dinner with fried catfish and alligator appeti","useful":0,"cool":0},"39v-PMKrka0DFXuYJLrmdw":{"text":"This was a delightful restaurant with a friendly staff and as crowded as it was when we ar","useful":0,"cool":0},"63EFJCszxnSgoaRc_utasg":{"text":"One of the locals suggested we stop in here for oysters and WOW so glad we did.\nThe servic","useful":1,"cool":0},"DQ4duvdiVpv0u9_Zh-v9HA":{"text":"Delicious filling and authentic. Homey without being dank. It's the place for elegance and","useful":0,"cool":0},"ALQGNwbqhnkPlR4c5txpFg":{"text":"Great!!!! Food. We all had different dishes and they did not disappoint. The oysters were ","useful":0,"cool":0},"mjmU4l3wSByw54MBn9Be2A":{"text":"Loved, loved, loved Mr.Ed's! We went there for lunch and enjoyed Fried Green Tomatoes, cha","useful":0,"cool":0},"7AhL_SSPH5X7hDVP0vOhnQ":{"text":"This was my first real local meal in New Orleans and we had the seafood platter- fried oys","useful":0,"cool":0},"Wz0x6lIRPQMuBk32m9bZZQ":{"text":"Excellent food with an excellent waiter named Terrell!  Service was fast. Ambiance very go","useful":0,"cool":0},"UYM1K12PeCjTSi92B9LUXA":{"text":"I don't understand how this place has such great reviews. Maybe the day I came they had a ","useful":3,"cool":1},"6JHyXl3iENnKm_DAwrjdzw":{"text":"It was a great early birthday for me! Wonderful evening with amazing people! Thank you Ada","useful":0,"cool":0},"DoALp7oMrrvjOeOa0IgeTw":{"text":"Lots of choices in the menu. Love the charbroiled oyster with cheese bread. Crab cake is o","useful":0,"cool":0},"sDZt-7Ovg7oGAZscPFmp8w":{"text":"Charbroiled oysters are amazing. The raw oysters were the biggest I've ever had. They had ","useful":0,"cool":0},"Z4IMw3NeweJPxtO-qlcWmw":{"text":"Everything we ate here was delicious. They didn't have the best BBQ shrimp we ate in New O","useful":1,"cool":1},"wPskD6JJKkt4MeGW2LiPYQ":{"text":"After looking at the reviews, we decided to go here and let's just say it was amazing. The","useful":0,"cool":0},"ibV6zSEvQ868b4SPVeC_FQ":{"text":"A really great off the beaten path spot! We had the shrimp Po boy and red beans and rice b","useful":0,"cool":0},"YAv9X4baohFP3QRV3DG2gQ":{"text":"Had a great experience here! Food was on point.. charbroiled oysters were a little differe","useful":1,"cool":1},"CFzUluBLR83x_PtZAY4_Zg":{"text":"Had their charbroiled oysters based on reviews and they are pretty good. Not spectacular b","useful":0,"cool":0},"SuIPL-yeee2SfmqPwQH4TA":{"text":"Don't wait in line at acme or felix's, these oysters are the cleanest best tasting I've ha","useful":0,"cool":0},"hO0PVUgAI6UW4SYx5yFnzg":{"text":"I went to the restaurant today and I didn't know they cooked in peanut oil and there is no","useful":0,"cool":0},"NeNjp6iao9v1EP4x309bNg":{"text":"Had a dozen oysters and redfish orleans. Oysters were huge, fresh, and delicious. Redfish ","useful":0,"cool":0},"GVth-h8q6cfB0RuXxkcLLA":{"text":"We have been going to Acme for years. On our latest trip to New Orleans the line was just ","useful":0,"cool":0},"Vp8-QPFWmnT0la6eg-GZog":{"text":"We had dinner here last week at the recommendation of the concierge at the Hotel Monteleon","useful":0,"cool":0},"IjvGevRbGNAfO07mqWDhHg":{"text":"Came here specifically for the oysters and I was not disappointed!!! Oyster shooters were ","useful":0,"cool":0},"VU912npIXYu_gmjtFVlB7g":{"text":"The oysters were great!  And the blackened alligator bites were very good!  Cute local res","useful":0,"cool":0},"E-xid5ch1SQKG82dGtxo6A":{"text":"Went here last night based on a recommendation from the concierge at the hotel.  The dress","useful":0,"cool":0},"WuDy0zqKokL_lu5BNnQTig":{"text":"Small but welcoming spot around the corner from our rental. Had 1/2 dozen raw oysters. Ver","useful":0,"cool":0},"bU_9uOTPqxE1i88flcUh7w":{"text":"Very friendly staff! Chargrilled oysters were yummy!! (Heavy on the oil but so good). The ","useful":0,"cool":0},"lG0UOzK8PgHvAHrwmXbjoA":{"text":"What a perfect way to celebrate 11 years of marriage to Bae! The crawfish Rockefeller Char","useful":2,"cool":1},"yoKzvHbTtKwl7AE7cVUxBQ":{"text":"Charbroiled Oysters are amazing! Located in French Quarter, you won't regret it if you are","useful":0,"cool":0},"XROzSmimP16pzPcAFFTrGg":{"text":"Friendly staff.  Great suggestions on the menu.  Had the \"taste of new orleans\".  Great sa","useful":0,"cool":0},"0_NZqYmb-Ymg2LV_meBf_g":{"text":"The food and service here were terrible. \n\nI came here with a group and we were all ready ","useful":1,"cool":0},"Ro2scNZQ55IuPrqItVPniA":{"text":"Met our friend who's a student at Tulane here for lunch. We were seated right away at the ","useful":0,"cool":0},"WGk4Cdnez6P54Ya7dQ0uRw":{"text":"As amazing as everyone says. Yes, the oysters are phenomenal, but GET THE CRAWFISH BREAD O","useful":1,"cool":0},"kyKNfiIKshEJ8Yy6bJSQJQ":{"text":"Best oysters and gumbo I've had in years! Rick was great - charming and the perfect host.","useful":0,"cool":0},"qDjB5QC5MFykPnCgNStUbQ":{"text":"You have to love a place that was closed for 15 minutes, but still let us in on a Sunday n","useful":3,"cool":2},"bn7O5Fsu3fLXYBr1u_qc7A":{"text":"We came here because of the reviews on Yelp and Google... OMG so glad we did!! I've never ","useful":1,"cool":0},"FXQrv2-zJu810d75Rg2YdQ":{"text":"We had the alligator bites, raw oysters, shrimp and grits, and a few other entrees. All we","useful":0,"cool":0},"UVYsACLq6NwiVOe1z66oIw":{"text":"I had a light dinner and drinks here with friends. The mint julep was tasty and the crab c","useful":1,"cool":0},"z-GJnHfrjymBa0BUYW2EVw":{"text":"Great staff!!! Great food! Too many seafood restaurants in the French Quarter as so touris","useful":0,"cool":0},"EPQFcpGej73nZLv8cA1G5g":{"text":"Crab cake was a good size and etouffe was good. Nothing spectacular but our waitress was n","useful":0,"cool":0},"Z5cWECh_g5GXYUURU3y27w":{"text":"A little off the beaten path but soooo worth it. Intimate atmosphere, very clean, friendly","useful":0,"cool":0},"AswlPmLEKeDldFNaCrF1Pw":{"text":"Do it.   Ask for Lonnie.  What great service and amazing food.  \nLonnie was nice enough to","useful":0,"cool":0},"f62MZWU0o2o3t18OIhYyGg":{"text":"Phenomenal shrimp po boy! Very fresh and a perfect balance of taste and texture. It was no","useful":0,"cool":0},"J_Nl1hK72hqULYK8quv66A":{"text":"How on earth did this place get more than 0 stars???  Seated promptly a very pleasant wait","useful":0,"cool":0},"OXjFDMnPq3vP14YBUV3imw":{"text":"Amazing charbroiled oysters.  We don't usually care for cooked oysters, but these were so ","useful":1,"cool":0},"cTVTX9kQaxv83uZSPCjPnQ":{"text":"I was told be a chef that this was the place to get good seafood. I only got the oysters h","useful":1,"cool":0},"4lXp9-oeyGnDu976_-KVDw":{"text":"This place was amazing, one of the best restaurants I have been to before. The service was","useful":1,"cool":0},"LwpSdOpGrzLLJRP9of8FEg":{"text":"The oysters are on point. They're fresh and simple. The seafood gumbo is very flavorful. I","useful":0,"cool":0},"nW8vOk69wrDnKyVy28EGDA":{"text":"Delicious food at reasonable prices.  The Creole gumbo was the right consistency loaded wi","useful":0,"cool":0},"T8JK4Tk3ULWEfImau6D8hA":{"text":"Was in New Orleans for the weekend, and yelp this place \nDecided to try this place charbro","useful":0,"cool":0},"tO21eb5CzuPTwk5NsptUNw":{"text":"This place was great!! We were looking for a good place, with authentic cajun food and thi","useful":0,"cool":0},"_JfjyHBqQkhBr6PGQksihw":{"text":"This place is better than Acme and Felix\nTheir oysters are fresh and crispy\nThe creole gum","useful":0,"cool":0},"kEZkpF0o7vP9pxz9sE1z0g":{"text":"Two things to get out of the way first. 1) You have to go to New Orleans at least once a y","useful":1,"cool":0},"RqTsMxKWgd7vnYEKEpQYDg":{"text":"Was wandering around the french quarter looking for someplace to eat without a huge crowd ","useful":0,"cool":0},"81bcqnNDK3Lbq0R1oLRlaA":{"text":"Service: Good\nFood: Amazing\nMy family and I really loved this restaurant. Super friendly a","useful":0,"cool":0},"Ff7VhuCGu-CWjxjhDXWt6A":{"text":"We went here on a Sunday around 5:00pm. We were greeted and seated right away. I had the s","useful":0,"cool":0},"6WW4uujW-XdWJhYFKVC-zQ":{"text":"Had the pleasure of chatting with the bartender and manager as I enjoyed my late lunch. Th","useful":0,"cool":0},"duBMx4E8-KghastcdxCiuw":{"text":"We made this place our first stop in New Orleans because of the great Yelp reviews and it ","useful":0,"cool":0},"0oimE41sez4LcDyTWhGEdA":{"text":"Went here for lunch as our first stop in New Orleans. Great food and excellent service. Th","useful":1,"cool":0},"60eZOjIR0jKPVE1rZwdzPg":{"text":"Absolutely delicious! That's some good food! Ordered the Gumbolaya, the Seafood Gumbo amd ","useful":0,"cool":0},"ZkiE0VSx171ju-7pWpg3Aw":{"text":"Great local ambiance. Friendly staff and delicious food. Had Jambalaya and Etouffee (New O","useful":0,"cool":0},"n3dGM7bO-mYIghqAi5Cyww":{"text":"Thank you for the quality of food, service and willing to assist the customers.  James our","useful":0,"cool":0},"6rol6pv_RjQGMc-auRZ_OQ":{"text":"We thought the place had steak and seafood, turns out the Bienville location does not, I h","useful":0,"cool":0},"lt92gY5KlauPggqYRoKRnA":{"text":"Get the charbroiled oysters and bloody Mary's! On nom nom. So good. Everyone who works her","useful":1,"cool":0},"uxBYx8yMnKDBje27uSz6-A":{"text":"I'm not usually a person who writes reviews at places they eat, but Mr. Ed's is worth writ","useful":0,"cool":0},"5Eg6_n7UHL0Hwi7uhqNwYA":{"text":"Nice seafood restaurant. Tried the plate of three: shrimp etoufee, jambalaya and creole. A","useful":0,"cool":0},"eQ0fW3mr4o0Dn0-uM8LqWw":{"text":"First stop on our trip to Nola and was not disappointed.  Food was excellent as was the se","useful":0,"cool":0},"jRqdz9-gyjFlBtN1iLnlAw":{"text":"Visiting NOLA on a business trip, The food here is awesome!!  Ate here 3 of 4 nights durin","useful":0,"cool":0},"bPd2EZv8gr8_QdHECM2EgA":{"text":"This place was definitely worth a stop- the shrimp crabcake pasta was good, the barbeque s","useful":0,"cool":0},"cpYRyUcsgt4gRg2kjCp7AQ":{"text":"The food was amazing and our server, Lonnie was the best!  We started with the  crawfish b","useful":0,"cool":0},"0iCOYru7SnwzEleiDe-Ohw":{"text":"Orderedthe seafood gumbo and alligator bites. I was underwhelmed by the quality of the foo","useful":0,"cool":0},"h7x6Cj7pO2gC893E1DVLxQ":{"text":"Our concierge recommended this place to me for a quick bite. I had the best oyster po'boy ","useful":0,"cool":0},"V_FyNb8Zne_j6n0YHzXqig":{"text":"Fresh, delicious baked (Drago-style) and raw oysters! Fried wild-caught catfish and oyster","useful":0,"cool":0},"Wr_7GMuGFW7fg5iQr3myIw":{"text":"The shrimp and grits was really good. The seafood jambalaya had a good flavor. Fried shrim","useful":0,"cool":0},"8WjZevSN5m6meucSd4Kd_g":{"text":"We ordered the crawfish crab cakes, the seafood nachos, a bleu cheese wedge salad and some","useful":1,"cool":0},"DUnvMGp8kUz7vP71xqKd3w":{"text":"Best Etouffee in NOLA! Always need to wait for seat, but it worth!","useful":0,"cool":0},"UsT982U8qS35VEYVLy_JhA":{"text":"Amazing find. Great local place. High quality food and service. Had soft shell crab, wow. ","useful":0,"cool":0},"vyLij5476Px16sow-DchVQ":{"text":"Char-grilled oysters. BBQ shrimp. Creole Redfish. Bread pudding. Great service from P.","useful":1,"cool":0},"BM1NpalR9p1seh1SRGv1-A":{"text":"This place is awesome! The service is fast and attentive and the restaurant (and bathroom)","useful":0,"cool":0},"wh-tZykhiM_boKLNS3tEMw":{"text":"I really like this place. The waitstaff are warm and attentive. The ambiance is cool and c","useful":0,"cool":0},"LOAsFXcdlWnG3JEnX5s6bg":{"text":"Two words.....crawfish bread.  Unique and very tasty. Service was great and the staff all ","useful":1,"cool":0},"WjAMfKTK41EJSydixKGtTA":{"text":"We really loved our meal and experience at Mr. Ed's! Their charbroiled oysters were good a","useful":1,"cool":1},"r2IW7IaWa4IdU2N2HD6HcA":{"text":"Have had two great meals here. Oyster Po-boy was fabulous. Anytime you eat in the same res","useful":0,"cool":0},"azu-ZKFo75Io5YiUCrtt9A":{"text":"I've only been here once, but here was my impression:\n\nFOOD: Awful. My jambalaya was strai","useful":3,"cool":0},"FxyY6EGIu9LAG6Gv85hYIg":{"text":"In New Orleans for Jazz Fest and walked by this place on our way back to the hotel...decid","useful":0,"cool":0},"hP26uyVXHGVVJV8NzW4egw":{"text":"went here on a recommendation from a local. had the crawfish poboy.  the crawfish was good","useful":0,"cool":0},"SdbVOD4729pX8wtPJS9YbA":{"text":"Food was great   Service  was good as well.\n\nCasual dining with good food.\n\nLaid back atmo","useful":0,"cool":0},"zlOWDqdIWIkSTupi7xIAxg":{"text":"Sat at the bar for a quick dinner. The bartender and other patrons were very friendly and ","useful":1,"cool":0},"DoqmACW385cDy_u2qkPBcA":{"text":"For a place that's only been open for a couple of weeks it was suprisingly good. We fell i","useful":2,"cool":0},"QvAG8KpO3o3Wve-JEQMNWw":{"text":"My god the po boy here is to die for and after! Tender juicy oysters and perfect bread! \n\n","useful":0,"cool":0},"QJR_dKVpKh46Vo7ZyMSpnA":{"text":"Ordered the charbroiled oysters and the raw oysters they were fresh, good quality and pret","useful":0,"cool":0},"ONsM9Z-iupyG8809kUEJfw":{"text":"I'm not one to frequent restaurants more than once while on vacation, but this was an exce","useful":0,"cool":0},"Z90Bai96AO5L1Zopa65qnw":{"text":"Catfish Poboy and Creole gumbo for lunch. Both were delish. Love the staff who were kind a","useful":0,"cool":0},"2PrN6LbfWi87uMNpJ_6Aqg":{"text":"This was the big winner on our trip to NOLA!Outstanding food: turtle soup, fried catfish -","useful":0,"cool":0},"1Y7CG6YWa0Iw3nVf09IvRA":{"text":"My husband and I came here last night, we started off with oysters on the half shell. We t","useful":1,"cool":0},"RDxcpGaUO2nlt3kbvTqtbg":{"text":"Forget the bigger and more famous grilled oyster destinations on Iberville or Bourbon St. ","useful":1,"cool":0},"2QkdmPV0L9NtKn4RR2SgOQ":{"text":"I don't usually enjoy oysters, but I loved them here! My waitress was super friendly as we","useful":0,"cool":0},"alA-R4a7CeARsLmPx21KBQ":{"text":"Look  this place has some good food. My only complaint is that I was served raw chicken. I","useful":0,"cool":0},"vPwoPoDQowKoXVK7KRTOgg":{"text":"I ordered a half dozen Bienville oysters at Mr Ed'd. They were so disappointing, just a ba","useful":0,"cool":0},"-783LcTl406FY5gYen042Q":{"text":"This restaurant was awesome. Our server, Eric was very friendly and helpful. The crab cake","useful":0,"cool":0},"s5RSb4gnhtPqnEzW7SdgZA":{"text":"The level of service at this awesome Oyster Bar was unbelievable. Our bartender Brandy was","useful":0,"cool":0},"DYxJ9RvfXxyPF_tn-Zgb_w":{"text":"My friends and I chose this place at random, because we were searching for seafood and gum","useful":1,"cool":0},"sp2fWzB651aLtiVWOW9rZA":{"text":"I wonder if all these great reviews are for the French Quarter location.  Ive been hearing","useful":0,"cool":0},"7o2xiLElcXwjY89pJ5qRdQ":{"text":"Very good red beans and rice with catfish, and of course the oysters were big and fresh. O","useful":0,"cool":0},"p6Ta0zqxuxVR8spykgqrhQ":{"text":"Tried the shrimp creole. Decent portions.  Pretty good. The service was awesome. Food is f","useful":0,"cool":0},"tlc8tCp1SiwTchyrr74h4g":{"text":"Chargrilled oysters! A must eat in New Orleans and this place serves some huge ones! We al","useful":4,"cool":2},"gED8K1Gp6qBBWKmJIQsQVA":{"text":"This restaurant is in the cut, very nice sit down spot, great seating to watch the Tv's at","useful":0,"cool":0},"SxNeQ1FfYa7HsT4leiz-6Q":{"text":"Stopped in ordered char grilled oysters and bloody Mary's , both fantastic.  Quick friendl","useful":0,"cool":0},"EZjWCyeWapnzAztdwB0jVw":{"text":"This place is emblematic of the problem with New Orleans: businesses know that most of the","useful":1,"cool":0},"6W2CfSPD_Os7m2nzGz_69w":{"text":"Really enjoyed this location.  I had the Southwest Charbroiled Oysters and they were perfe","useful":0,"cool":0},"IMCif0tJ05NWhn7dz_oWRQ":{"text":"Found the place on yelp, outstanding food and great service. The oysters were to die for. ","useful":1,"cool":0},"QjAhyJlFqZKSln74CRsSog":{"text":"First meal in new Orleans. It was okay. The oysters were good although I only had one. The","useful":0,"cool":0},"NDHvnjAgiIQrvGZrTSh4lw":{"text":"I had the poboy and my gf had the gumbo both were very good. Service was great from the gr","useful":0,"cool":0},"OfDyN3Bnxd1MqWz4gLSmJg":{"text":"Cute place not far from Bourbon.  Bartender was cool and attentive but the food was a litt","useful":0,"cool":0},"1iS9mkUmmJGqM5mCKKEtBg":{"text":"Went here for our first meal after arriving in New Orleans, and was really disappointed.  ","useful":0,"cool":0},"bX3E6kI-jWeJtYXGYVzrDA":{"text":"Last night I enjoyed a seafood platter that came with fried oysters, fried catfish and fri","useful":0,"cool":0},"Ul9M2kE3oPz4Bgq6dpF4rw":{"text":"Oyster is a must, the best in New Orleans that I have ever tried. Crawfish Spanish articho","useful":0,"cool":0},"4zXobdYCdwLedjkvpIoBHg":{"text":"Food was very good.  went on a Saturday afternoon and was seated immediately.  Had the gum","useful":0,"cool":0},"5X6_U42QgNulNpoDdxD1gA":{"text":"Had an amazing brunch here . Great drinks , great oysters and he crawfish bread was to die","useful":0,"cool":0},"sE-SeRccR2pLAAWj5G2gwQ":{"text":"This place is awesome. My boyfriend and I spent 4 days in New Orleans and ended up here tw","useful":2,"cool":1},"9RbOowggy96UMu0QUDopog":{"text":"Excellent food, very clean, great friendly service... Ate dinner at bar with Pat our serve","useful":0,"cool":0},"NK5uM583lXQ0KLBHnxZP9g":{"text":"We enjoyed dinner at Mr Ed's on a Friday night with 8 people.  We only had to wait 10 minu","useful":1,"cool":1},"eYmE0RHh26GhGmgiZ_P8zQ":{"text":"We found this place by accidentally after stumbling around to find seafood. Glad that we s","useful":0,"cool":1},"DvC-JHiDG8R_NgCMjFjtfA":{"text":"BBQ shrimp. That is all. You're welcome.  Seriously. This stuff is so good. I must figure ","useful":0,"cool":0},"v-Ulez0I_J0kJiuV_1HHHw":{"text":"I was dubious based on the decor walking in. Was immensely pleased with the food and drink","useful":0,"cool":0},"C0-oPKK-mkbnoLYCO1_yzQ":{"text":"I was walking around alone my last day of a work trip, and I needed a final fix of my belo","useful":0,"cool":0},"dLpbz4ZmVeOS3AYJC9vNVQ":{"text":"On a complete whim, we decided to try out Mr. Ed's Oyster bar because we were looking for ","useful":0,"cool":0},"DLqiVZjdCvjXO6RNrhZJaA":{"text":"Oysters were good but I ordered them before my meal and they came out together. So my meal","useful":0,"cool":0},"o0jB5qPg35cIxDya5k-bfw":{"text":"All I can say is you must try this place out. And you must try out the bread appetizer. It","useful":0,"cool":0},"AcBHoCy_egZqG4CVAg78pQ":{"text":"Not sure why this place has more than 3 stars. The food lacked flavor. The service was goo","useful":0,"cool":0},"8Jq1iO0DsNp94usJfZx6Yw":{"text":"Recommended by friends who are regular Nola visitors for seafood. Needed to pace myself fo","useful":0,"cool":0},"9oiPwf0F4eh1yWiRy0m6xQ":{"text":"Spent an hour or so wondering the FQ checking out my crawfish boil options.  Half a dozen ","useful":0,"cool":0},"QWBae0S4Mvp5CpY9AENBFQ":{"text":"Traditional authentic down home southern New Orleans style restaurant where the locals eat","useful":0,"cool":0},"oIKzLWnT5Tq6Mt-ERgk2PQ":{"text":"great seafood and price for New Orleans downtown! service was personable and nice as well!","useful":0,"cool":0},"BGpzF7SmkmksNoMCPsobzg":{"text":"Out of all the reviews in the French Quarter, Mr. Ed's seems like a little known gem. It i","useful":1,"cool":0},"wv3qN3I6P5B8UxgH1JIDkw":{"text":"This place was great and the service was amazing! Zack was so great he was so attentive, h","useful":0,"cool":0},"X3ZrO8Z7XUK1LBigXjDiww":{"text":"Yum! Decently priced - go here !! \nNola has some pricey $$$$ food places . This was decent","useful":0,"cool":0},"5OyOiKo0qMhfKM8EToQB8A":{"text":"BBQ Shrimp was a unique and flavorful treat.  We also had the broiled oysters, which were ","useful":0,"cool":0},"6MsHIN8wWozy4jEZzHbgFg":{"text":"We checked yelp before we went.  When we got there, the prices are higher, the seafood pas","useful":0,"cool":0},"g6Jm8HMVilYZWqZd273CKA":{"text":"Food was cold. took a long time to get it. Waiter dropped plate on a customer.  But the wo","useful":0,"cool":0},"JNIX8u0Y9i7e4V21n57peA":{"text":"Some of my favorite eats on my latest NOLA trip! I didn't care much for the atmosphere but","useful":4,"cool":4},"5GYtKuxjps6Wem8BmrKSfg":{"text":"Another nice establishment in the heart of the quarter. I had a couple of drinks and a not","useful":0,"cool":0},"pbhjB-Fr9ASa08gxB1fD4Q":{"text":"I stopped by Mr. Ed's during my last day in New Orleans and I'm glad I did! The food and s","useful":0,"cool":0},"pd2DfnUbQcYCFdtHGyxS7g":{"text":"Pretty good.  The fried catfish was nice and flaky.  But the fried oysters were small and ","useful":0,"cool":0},"hHyn3x-QAaXEu-lMqE69hw":{"text":"All I can say is CRAWFISH BREAD!!! I read a few reviews about the bread and it did not dis","useful":0,"cool":0},"SjcpAsFgRXxOUpJyke5wQw":{"text":"Found this place when couldn't get into ACME based on a local's recommendation at the Char","useful":0,"cool":0},"XSy-5FTuY6THYolMjY6hXQ":{"text":"We stumbled in here when the place we were looking for was closed and we were so glad we d","useful":1,"cool":0},"JZOxDIDD1rhzAtQBnlNf_Q":{"text":"Oh my God, yes. Turtle soup was one of the top 3 things I've eaten in New Orleans. Full of","useful":0,"cool":1},"9Suq1Ue-bX1d3PFN_k5pXw":{"text":"Absolutely fantastic meal(s). We went here 2-nights. \n\nDon't miss the Crawfish bread or th","useful":1,"cool":1},"C7Bvr8zDpLGhDUJTfIOPIQ":{"text":"DISCLAIMER: My visit was in Nov 2014, and I am just now posting this review because appare","useful":0,"cool":0},"xqLOdPKgAChziTscM9x60w":{"text":"Great service, excellent food and comfortable atmosphere.  We will go back again soon.\n\nTh","useful":0,"cool":0},"CN9YkZ5KGRc3Unm_iBfsRg":{"text":"Service here was excellent and even with a large group and no reservation on a Friday nigh","useful":0,"cool":0},"7X0Q-op8IXsI5cCTsCaByw":{"text":"This is a clean, friendly, upbeat restaurant.  There's upstairs seating for large parties.","useful":0,"cool":0},"WbZPGb5SFLGOvjtcjML14A":{"text":"We only stopped in for a snack, but would definitely go back! The charbroiled oysters were","useful":0,"cool":0},"RkqSi6_4IQF3owdyfGsTwg":{"text":"I enjoyed the wedge salad and 1/2 dozen chargrilled oysters for lunch.  Salad was fresh an","useful":0,"cool":0},"PQzOwXntkNRRMHJSo7-snQ":{"text":"This is a reasonably new addition to the French Quarter, they have another location in Met","useful":1,"cool":0},"KNwt1JmlgV36X6WD7nEPOw":{"text":"Onion rings were excellent.  Redfish was fresh and delicious.  They gave us everything we ","useful":0,"cool":0},"PE-TKBBuyXnybAdy57JWZw":{"text":"Really good food with EXCELLENT SERVICE! We tried apps, entrees and one banana cream pie f","useful":0,"cool":0},"HWMSLWfW9vVpvHiDGGENgA":{"text":"We decided on Mr. Ed's on our one night stop in the French Quarter.  The service and food ","useful":0,"cool":0},"npYifqP8vt8RJMTW9smhhw":{"text":"Great food I had the Gumbo and Thanks to the waiter recomendación I had the charbroiled oy","useful":0,"cool":0},"DVmDnY9ePpLb28kYxns7XQ":{"text":"We are at several restaurants during our visit to New Orleans and Mr Ed's Oyster Bar was o","useful":1,"cool":0},"RSCP1bdP0jb12-z3UtQxfA":{"text":"I love love love this place.  The best chargrilled oysters in town.  Very reasonable price","useful":0,"cool":0},"4tzeZnkZvm853L2iKeUCAw":{"text":"What a fun little place tucked away in the French Quarter.\nAtmosphere was warm and welcomi","useful":0,"cool":0},"p0oTCuZFbp5ciLtQgtSGhw":{"text":"Went there because Yelp listed excellent ratings and listed it had crawfish. Well they had","useful":0,"cool":0},"iMykk6v66mkY-3PP8yp4_g":{"text":"The shrimp creole was good! Spicy and fully loaded with happy little shrimp. They gave us ","useful":0,"cool":0},"C9ImOyDbsbA9dXhHqoySaQ":{"text":"Great food and service by our waitress Ada! I ordered the crab cake meal and chicken gumbo","useful":0,"cool":0},"dgrWElvz1TnSezs9q9d4jg":{"text":"Great food. The charbroiled oysters were awesome. Sever was also nice. Can't wait to go ba","useful":1,"cool":0},"lODPz_PJ8frE8FZ6NjqQrw":{"text":"While aimlessly walking around the French Quarter, we happened upon Mr. Ed's. From the app","useful":1,"cool":0},"GmMV0UQtM1EIY30JGnFJuw":{"text":"Second time we have been in and pleased both times. The wait staff is attentive and barten","useful":0,"cool":0},"gbvP8XfJ59ZY9bDWFIsS7g":{"text":"Been here twice now. It has been a great experience both times.  The food and service were","useful":0,"cool":0},"TmGc4qZBOxrptiLpHY5zYA":{"text":"Worst service ever spent 20 mins waiting for someone anyone to at least bring over some wa","useful":0,"cool":0},"k69aRtkBjnGWVejZo1TMqQ":{"text":"A dozen raw, Creole gumbo, and poboy with roast beef! Wash it all down with cold draft bee","useful":0,"cool":0},"pFFvSqyVzaNy6WcObjVRcw":{"text":"The service was good. The oyster were fresh and the seasoning on the chargrilled oysters a","useful":0,"cool":0},"pUaCb1hBh9fQkWVjQ2JNlA":{"text":"Very good food and a nice quaint place. A solid choice for dinner. The gumbos (seafood, cr","useful":0,"cool":0},"ih8yhBZSnjJyX5pClvMPwQ":{"text":"While in town for a conference last week, we were looking for a more reasonably priced sea","useful":0,"cool":0},"GNpqjdTl0G4K3ctH6Px4iA":{"text":"Yummy. Everything we had was soooo tasty!! We went during an off-time and there was only o","useful":0,"cool":0},"IUGSSGNQoMUcu3eX_Lv6fA":{"text":"Terrell is an amazing waiter and made our experience special with his charm and care while","useful":0,"cool":0},"80uATfYYGZkap8IUc0dx4Q":{"text":"Food was good. Gumbolaya was delicious. Our server, Latoya was only training, but she was ","useful":0,"cool":0},"hiPgPhGnyigApDfrnPGl2Q":{"text":"My family and I visited Mr. Ed's and really enjoyed it. I ate Pasta Jambalaya which was ex","useful":0,"cool":0},"4bPLohMJaEhXRRgszHYsSw":{"text":"Outstanding charbroiled oysters.\n\nVery good shrimp & grits.\n\nA VERY GOOD hurricane.\n\nFrien","useful":1,"cool":1},"dxIeN635jVCCqDIgbFcHmQ":{"text":"Oysters please! A dozen charbroiled didn't stand a chance with this lady! In my belly they","useful":0,"cool":0},"b2XvmqQwA4RcMXOP1iiiWA":{"text":"Great food excellent service. Prices not out the park. Great service as well. Enjoy the gr","useful":0,"cool":0},"hev7dH0amFADbiI8EBUCgg":{"text":"My hubby and I had a very enjoyable meal at Mr Ed's.  We started with the char broiled oys","useful":0,"cool":0},"1ZP3BfsPD0mwIIWmcJ_XQw":{"text":"Chargrilled oysters and po-boys were great.  It took quite a while to get a table and even","useful":0,"cool":0},"WtssSTasNO-tzKcWv3wLEQ":{"text":"Great fried oysters. Great onion rings. We will return, one of our favorite places in New ","useful":0,"cool":0},"y5kIM6_K8Ddo-4URchkxAA":{"text":"We have nothing bad to say... The creole gumbo is AMAZING. Our service was super fast, the","useful":0,"cool":0},"DRJIl5hJCVY20EsNV-bUCA":{"text":"We came in here to relax and have a drink...but someone next to us got the crawfish. Well ","useful":1,"cool":1},"qVJMfPc5fUR6fG4H8bswJw":{"text":"Relaxed, casual feel.  Super yummy and well done!  \nTried the Seafood gumbo, chicken and s","useful":1,"cool":0},"WUKHEhFzkmUnJm6f7OAg7g":{"text":"Over the weekend we visited several \"famous\" NOLA gumbo and oyster restaurants and was ple","useful":0,"cool":0},"gwpqxrWcqoa9DWHaaOtOCA":{"text":"When I came to New Orleans over a month ago,, the first restaurant on my to do list was th","useful":1,"cool":0},"gVUKj5eqXxTU94jaaNp7tQ":{"text":"Delicious. Great value and really loved the Fried Green Tomatoes! Drinks weren't super str","useful":0,"cool":0},"quBnIWfNeWWuoiMa3uziHw":{"text":"The food was good I mean good. I had the BBQ Shrimp served with fantastic sauce over hot F","useful":1,"cool":0},"jR4KE0ZvuVpJSz1dwsYuPg":{"text":"I was very impressed. I had the charbroiled oysters and they were some of the best I have ","useful":0,"cool":0},"RjOrQp8QTFrIGSPTgA_OGQ":{"text":"My first trip to New Orleans, I dont eat seafood, I got a cheeseburger & my husband actual","useful":0,"cool":0},"faA5dZcMLzpL-WqN3CMl1g":{"text":"Love it! Awesome char grilled oysters. Bartender Steve is the bomb. Strongly recommend for","useful":0,"cool":0},"uN-YNsfrinqiCZ9PItNMsw":{"text":"This was definitely our favorite meal while traveling in New Orleans. My husband ordered t","useful":0,"cool":0},"K3dmQCZWokl7H57kTwvyeA":{"text":"I've never had a disappointing time.  The French Quarter Mr. Ed's is fantastic.  Great bar","useful":0,"cool":0},"fVCk--QLtbJGZXu9pQGpug":{"text":"Our Uber driver recommended this place over Acme... so we went with his recommendation.\n\nF","useful":0,"cool":0},"OzEzV1MrZwrUNUVOvVyQLA":{"text":"4.5 stars?? I'm afraid not. Everything was mediocre at very best, except the Coke. The sta","useful":0,"cool":0},"3EyOn216UDrC5i-oXXIsGg":{"text":"Order the char grilled oysters.... they will change your life. This town is amazing for it","useful":0,"cool":0},"lXlEfXzW7eVYNPiBIZXn-g":{"text":"Was very pleased with the oysters here. I came in for lunch and shared a dozen raw, a doze","useful":1,"cool":1},"HRX03siE07y4anmgwXNUsA":{"text":"Shrimp and grits was absolutely delicious! Definitely the flavor I was looking for. Servic","useful":0,"cool":0},"UiQIBumwNkUlrQSUIQV3-A":{"text":"Awesome.  Just a great place.  Great food and spot-on service.  Best blackened redfish I'v","useful":0,"cool":0},"vtIOwrjVDUp_FyhJSnChRw":{"text":"Charbroiled oysters the best I've had!  Louisiana Crawfish Bread is unbelievable!  Excelle","useful":0,"cool":0},"x3qsApB2TiFAritEn-UKDA":{"text":"Best first meal in New Orleans!  We travelled from California today and hadn't eaten since","useful":0,"cool":0},"7hlfbBEok7kg7pPTogC-gg":{"text":"A one star is too good for this place. First of all, we arrived and was told there would b","useful":0,"cool":0},"j711IcuSGYBd2IGnx695fQ":{"text":"I've come to New Orleans once a month for the last 7 months. Every single time I come this","useful":0,"cool":0},"7zKaXAIlAvXsIL0UkKoEBg":{"text":"Friendly service, massive oysters and really hot horseradish. Not much else to say...","useful":0,"cool":0},"GOpna1ORw4741JnEO5VDxw":{"text":"Good place!  Small and nice lights.   Catfish and shrimp was good.\n\nI enjoyed the jambalay","useful":0,"cool":0},"PPEwVIE-SemVCYc6GpWm6g":{"text":"Oysters rockefeller appetizer could be a main dish. It was awesome. I ordered the fried se","useful":0,"cool":0},"2oRc7NOM5tYQ5SPbPyQGXw":{"text":"The best oyster poo boy, great redfish, great chargrilled oysters... I love oysters!  Awes","useful":0,"cool":0},"bgYu06Ex1AasFgWokNElTQ":{"text":"Great food, upbeat staff, enjoyable experience, without the mile-long line at Acme down th","useful":0,"cool":0},"JaWyeJISGeeHXFXOuRDMZA":{"text":"Screw this place. Waited and watched servers walk past us and act like we were invisible. ","useful":1,"cool":0},"5AtwiNlyn_Gko0GRXDe6YA":{"text":"The raw oysters here amazing!  They're pretty huge when you're coming from SF but holy cra","useful":1,"cool":0},"CfyxQZUHZaUrf7qOCOiXuA":{"text":"The char grilled oysters were amazing! My husband and I also had the gumbo. It too was ama","useful":0,"cool":0},"rUKwmObD0hOmkMO-sUX1Pw":{"text":"Food is sooooooooo good! The first time I came I had the crawfish bread and the charbroile","useful":0,"cool":0},"4r_mYln8SN7iIxAklCtP5Q":{"text":"I asked a bartender at a nearby cocktail bar for recommendations for an oyster spot, he qu","useful":0,"cool":0},"PzcpvQ2rnltlyXM3M4Rw9w":{"text":"This is a great choice in the French Quarter. It serves very fresh oysters and excellent j","useful":1,"cool":1},"_MChvTUCvp4uT4FAD5SpRA":{"text":"Stopped in for a quick bite when we were down exploring Bourbon Street. The place was pret","useful":0,"cool":0},"CajlDYspjPotwKQ0YdhwjQ":{"text":"Checked in during French Quarter Fest! Pretty busy time in the quarter! These guys do a gr","useful":0,"cool":0},"Yg9ztg0LHgOEYokImWyxxQ":{"text":"I had the shrimp and grits-my husband had the soft shell crap po boy! Service was great-ve","useful":0,"cool":0},"Un8ou7qzS8As6CQJDDiZkQ":{"text":"Wow...NOLA doesn't stop impressing. As if there aren't enough options already, but this pl","useful":0,"cool":0},"AiFxAqMVOUQabedfV5Kpkg":{"text":"Food that you can write home about and off the main thorough fare so not overly crowded. I","useful":0,"cool":0},"88LeJwqMygQfMlEaqd4Zag":{"text":"Mr. Ed's is a no-nonsense restaurant with delicious food. The oysters were huge and fresh,","useful":0,"cool":0},"4HHf1MFqUq5whdkgYk9ByQ":{"text":"We were in a 40 minute line for Acme when we decided on Mr.Ed's. Food was fantastic! Great","useful":1,"cool":1},"NZnJ_7MdqaJugi3qrWri5g":{"text":"I love love love this place. All of the food is good. I ate here 3 times while in NOLA and","useful":0,"cool":0},"g8SaywVRj9GZ_bRtIoIXDg":{"text":"Went on New Year's Eve dueing sugar bowl with friends. Great scenery. Lovely and playful s","useful":1,"cool":0},"VyLM1Azp03BWZvDccS9RRg":{"text":"What a way to start off our trip in NOLA! This was my family's first stop in the Big Easy,","useful":1,"cool":1},"IF8jOZ9qeDle3RWrYbrqQA":{"text":"Not a big fan of this restaurant. I tried their gumbo which was delicious however the envi","useful":0,"cool":0},"sJx1_UJZ0ctEWi5kZWYzOQ":{"text":"We came here based on our hotel staff's recommendation. We  ordered charcoaled oysters (pa","useful":0,"cool":0},"vvvHmbypIHDyzCxq7gKSgw":{"text":"Came here for the great ratings on charbroiled oysters. And for the fried green tomatoes.\n","useful":1,"cool":0},"70SqhNd2L6qCIMkqiNMXlA":{"text":"I had oysters at several spots in New Orleans, and this is the restaurant that blew me awa","useful":0,"cool":0},"oddzKiLXidmTOzJ3ntcXMg":{"text":"We were undecided on where to go and we went there and saw the table next to us get very l","useful":0,"cool":0},"ddbngdI9i3iMQlOf4cp4AA":{"text":"There are a couple of locations for Mr Ed's so I was a bit hesitant about how much of a ch","useful":1,"cool":0},"e5inzT0HZIf9SFu41L3eNQ":{"text":"I was in town for 30 hours and I ate here twice!     amazing food..my favorite charboiled ","useful":0,"cool":0},"Vh2syp4iftUzsgFo0r5I7w":{"text":"Get the charbroiled garlic butter oysters, jambalaya and crawfish etouffee. I loved the et","useful":0,"cool":0},"LxA30-T6Y8hjJcevvyqfmw":{"text":"Great food, prices, service and atmosphere. Seafood muffuletta was loaded with so much sea","useful":0,"cool":0},"EilxiYTl3Z93NmKOkB8qew":{"text":"Excellent Food - you cannot go wrong here. We waited about 30 minutes but it was worth it.","useful":0,"cool":0},"_nrR7h_QXv4jukmJ9Q5j0A":{"text":"Krystal was our waitress at this awesome restaurant. She was very friendly and informative","useful":0,"cool":0},"2M-gmDYWhP0ijIAy5k4P8g":{"text":"Casual. Excellent food. Chargrilled oysters to die for! Coconut rum punch...amazing. great","useful":0,"cool":0},"AEJsjNOUsviOR2Ns77aUGw":{"text":"The chargrilled oysters were the best so far this long trip in New Orleans and the gumbo h","useful":0,"cool":0},"NhiAzx-z1d97sQ_a_L_BAg":{"text":"Great stop!!  Service was good and friendly. Food was excellent  the oysters were great an","useful":0,"cool":0},"BSUz-sxpsyZTegDCsJfzMg":{"text":"Went here because we thought there was a happy hour, but found out there was none. Ended u","useful":0,"cool":0},"GHZ4TX-1akaINJ1ocJ3y0g":{"text":"Great food and good atmosphere. We we socializing all night and did not notice our food wa","useful":0,"cool":0},"QUpwHSEUW8K30rRH0oxghg":{"text":"Absolutely AMAZING!!! The manger is the best ever! So sweet and definitely takes care of h","useful":0,"cool":0},"ItCwJ0uE-TJTuu2eTQ29tQ":{"text":"Visited this place 3 times in 2 days! Service, food and ambiance all great. We enjoyed cha","useful":1,"cool":0},"YVF2stw99D08iYvPr_J8Sg":{"text":"Awesome every time. Always go more than once when we visit. Crawfish loaded bread and char","useful":0,"cool":0},"AESzwW72g5VTgGeMIuFqEw":{"text":"We decided that this trip to NOLA, would be a char broiled oyster trip. We stopped at Mr E","useful":0,"cool":0},"v1H9KDBjMeGTlTX_V08LJQ":{"text":"WOW, grilled oysters were AMAZING!!! Fried oysters were AMAZING. Jambalaya AMAZING!! Étouf","useful":1,"cool":0},"zvc4xnKiqBWR9RFTKGd7VQ":{"text":"This is for sure my fave restaurant in NOLA! Their charbroiled Oysters are so flavorful, t","useful":1,"cool":0},"ZyIFq8Dmd9xDcZaXyPJLzA":{"text":"This was a great place to have oysters; smaller place than Acme, and didn't have to wait f","useful":0,"cool":0},"SS4dHzFyz0zZAf-zhcWefQ":{"text":"This has to be one of the best restaurants I've been to for my short stay in the French Qu","useful":1,"cool":0},"cj570FXAuyZP0DarGa3zNg":{"text":"Sat at the bar and had my very 1st hurricane that Michael, the bar tender made special jus","useful":0,"cool":0},"IBZkr3muMzrobsAMLGcRpQ":{"text":"This place is quaint and truly reflect the foods and people of New Orleans, best Oyster sp","useful":0,"cool":0},"z3IuIym-jrwaKjcPo26Uqw":{"text":"If you're looking for an authentic taste of New Orleans in a simple, casual (not fancy) se","useful":0,"cool":0},"QjjpnFtH_cngOq7mpA4eqQ":{"text":"I sat at the bar....excellent oysters and gumbo.  I had two dozen and a bowl as dinner was","useful":0,"cool":0},"1vFc9JpPJaznjyaKESWvxA":{"text":"I was very happy with my meal here at Mr. Ed's. I ate the creole combo and blacken alligat","useful":0,"cool":0},"jdeeXVLaetyDy8PHVywZeA":{"text":"Atmosphere was great, service was amazing, and food was great.  Our waitress was the sweet","useful":0,"cool":0},"W_PzBfGbJIZsKivdWh9Z0A":{"text":"This is a small spot that you could almost miss, walking around in the Quarter. The food i","useful":0,"cool":0},"GImvRwGMwuaBI4griFMm6w":{"text":"Absolute best place to eat when in New Orleans. Avoid the other big names couple blocks aw","useful":0,"cool":0},"rmeh37hPMyTnEJfZcyTzsA":{"text":"First time in Louisiana and first food stop I made. Couldn't have made a better choice the","useful":0,"cool":0},"OVsxjHfUv-aZ0kCXLNqgtQ":{"text":"We got here on a Wednesday night at 6pm and it was almost empty, but by the time we left i","useful":0,"cool":0},"re7T_Ujn82y3cisaAz3dAg":{"text":"Mr. Ed's is an unassuming spot, looks aren't everything. Charbroiled oysters were amazing,","useful":0,"cool":0},"K86-VPktOtVS8NmrbBFbpw":{"text":"Love the food here and normally great service but today is not a good day. Sat for 10 min ","useful":0,"cool":0},"5EwdRqFu2XiwXjL4d9oejQ":{"text":"First off our waiter was fantastic, his name is donald i believe.  So on his suggestion we","useful":2,"cool":0},"P-vy07PbUf9wHw-4x4Jaig":{"text":"After exploring the city's iconic chargrilled oyster purveyors, and there are many, I came","useful":0,"cool":0},"GZDgon3Hr1AOd4nJDkcLBw":{"text":"The food was amazing and the waiter was very attentive. I do recommend people stop by and ","useful":0,"cool":0},"MVA4QmENpk7unSNZiFc_ug":{"text":"Tam was our server. She was fun and extremely knowledgeable of the food items. Best meal I","useful":0,"cool":0},"H9wiRFo9CPqcERmo5C3-VA":{"text":"My favorite restaurant in the French quarter!!!! The server recommend a stuffed cheese cra","useful":0,"cool":1},"tklLu7TYi3qD_JmJLtYMew":{"text":"Best gumbo I've ever had.  The raw oysters were fresh and tasty.  Service, top notch.","useful":0,"cool":0},"bLrgv7j49-hZEEnuvnHFig":{"text":"Service was excellent food was even better! I think we tried just about everything on the ","useful":0,"cool":0},"okZelr7hp6lYZaBNoVoQTg":{"text":"We tried many Cajun seafood restaurant in New Orleans during our trip.  This one stands ou","useful":0,"cool":0},"Fw74H8ADmnYmFsfTeJB6TQ":{"text":"So good! My husband had the taste of Louisiana and I had the crawfish étouffée. Both were ","useful":0,"cool":0},"vQ5Yz6iLzp3nEw-14U75WA":{"text":"The charbroiled oysters were actually the best we had in NOLA. But the rest of the food wa","useful":0,"cool":0},"UeOZ-gOrBr74FnaPYuXLAw":{"text":"Oh my. The 'taste of New Orleans' platter. It was delicious. The crawfish etoufee is aweso","useful":1,"cool":0},"YREtVMmpmC0_brrHTMtf5A":{"text":"This was the best Oyster Bar. They had delicious food and the top notch Service. They made","useful":0,"cool":0},"8djMhRne-80Vzb38eanhjg":{"text":"Awesome food across the board. The charbroiled oysters are truly incredible.  And our serv","useful":0,"cool":0},"zJjdkE16qVkenbtO603UJg":{"text":"Our Driver recommended this place to us for good seafood and charbroiled Oyster's. The men","useful":0,"cool":0},"sm-_Yj9TpIh2EEQ8LNQrvg":{"text":"Char broiled oysters were great..  The rest was delicious but very salty.  Worth it for th","useful":0,"cool":0},"NkcpzwJTKvQLAmEb9i23-A":{"text":"Loved Mr. Ed! I ordered the blackened red fish maision and since it was Sunday I had a san","useful":0,"cool":0},"9X1Z_RRVVMNtuYz_WCWN2A":{"text":"Nice little place and excellent food. BBQ shrimp and fried shrimp really tasty and hard to","useful":0,"cool":0},"VZSrB2dIpkbdD8qfJAFfpA":{"text":"The customer service here was impeccable. My waitress, named Lyndsie, was extremely helpfu","useful":0,"cool":0},"izY9e-xTXSHEn4ogNy-j_Q":{"text":"This was the start of our NOLA foodie adventure and were craving oysters! Here are a few t","useful":2,"cool":2},"h5Yuskjpn09N8dEwUReUHA":{"text":"We had the Southwest Oysters and they were awesome. Wife had the seafood nachos which was ","useful":1,"cool":0},"WXCeLgRU9_rYtcF9QzKafg":{"text":"We stumbled onto this place after walking around the  French Quarter looking for a place t","useful":0,"cool":0},"S3VBuIZH3-HIn6K7VOtZtA":{"text":"my boyfriend and i loved it here! super awesome service! we came here recently during our ","useful":2,"cool":1},"fWnhMrxVcjOupZg4FBtGpA":{"text":"Stumbled across and glad we did. Raw oysters fresh and delicious. Fried shrimp flavorful a","useful":0,"cool":0},"-WT_pXLlcu7jv5bB4-BpNQ":{"text":"Our first stop in New Orleans, and I must say it was a great choice! Really does the food ","useful":0,"cool":0},"fFAZaWz0U98qSuXJIa6xog":{"text":"Ordered the crawfish spinach artichoke dip for appetizer. Quite possibly the best I've eve","useful":0,"cool":0},"nAu9jkWU8xusHcbY-AtMHw":{"text":"Ate here recently while in tail and all the food was exceptional. We had BBQ shrimp, oyste","useful":0,"cool":0},"RpGVY9OGzSEL96Buj4Np4A":{"text":"Thanks Russell, \nGreat suggestion of the BBQ shrimp. The horseradish was on fire. Loved it","useful":0,"cool":0},"iDKqA90K17SKMVkLuE7AJg":{"text":"Friendly atmosphere and the food is onolicious (delicious).   First time here in NOLA and ","useful":0,"cool":0},"FCzECWlx-MU6NunIVDAPaA":{"text":"The best place ever. Bartender Michael, was attentive and one of a kind. Oyster shucker, S","useful":0,"cool":0},"ShdIMsk7McoaJJafndN42Q":{"text":"Omg so good. For reference we've been living in California for the last two years and all ","useful":0,"cool":0},"ntukkHiiwG3uXWQK_jOjeg":{"text":"For our 7th anniversary right off the plane we came here first , we were first timers ... ","useful":0,"cool":0},"eouGDP59b2_GIL_kfhpAjw":{"text":"We were recommended to go to Mr. Ed's by a couple people who users to live in New Orleans/","useful":0,"cool":0},"HutuvsaEyCYPqSTGTd6PSg":{"text":"I can't say enough. Darryl our waiter is the best. The food is amazing. Who Dat!!! creole ","useful":0,"cool":0},"ByC7LMitio3iodCCGuMlug":{"text":"Hole in the wall type place.  But excellent seafood.  Service was phenomenal!  Very friend","useful":0,"cool":0},"gmd7gC0vMRVriz1bJJpfHA":{"text":"LOVE Mr.Eds food. Staff is friendly and food is always fresh. I stop here every time Im cl","useful":0,"cool":0},"gHcv6O_JPO4EXGUedJxt4A":{"text":"If I was just reviewing the charbroiled oysters, then I'd definitely give 5 stars. If I wa","useful":0,"cool":0},"SNRUftRrvV98UXNoGBwkCg":{"text":"This was my favorite place for Oysters. I got the Southwestern style, and they were perfec","useful":1,"cool":0},"w0unYjrph1U5mjz-KdYazw":{"text":"Came here thinking we would eat some \"appetizers\" before our main meal and we turned out t","useful":3,"cool":3},"gSGzMvJ94xJa5F6XV_btgQ":{"text":"OOOOOHMYGOOOOOOOOD. The charbroiled oysters were hands-down the most amazing encounter I'v","useful":2,"cool":0},"NFPhgXqzG-OQLXlJ2Gjazg":{"text":"Best Charbroiled oysters in NOLA!!\n\nBut more importantly, our server Konesha W. was seriou","useful":0,"cool":0},"4okArQ68urThEGL1yAw1Cw":{"text":"An obvious trap place for tourist. The only noticeable thing about this place is it has al","useful":0,"cool":0},"uVi_ObfeCEHfpc6yHNeghg":{"text":"5/5 garlic parmesan butter charbroil oysters. Better than Creole House or ACME. Huge fan.\n","useful":2,"cool":0},"a8DzoQj5vOY3uvuNiCiUkw":{"text":"Great food and music, but I'm only giving 3stars due to the fact our server had 2 tables, ","useful":0,"cool":0},"3Gi232RVLIcvypA-dyAwEg":{"text":"Amazing food! And great service!! Definitely recommend! Came across this place as i was wa","useful":0,"cool":0},"poY-O-LX54avQU6yO0-lZA":{"text":"I go back here every time I'm in NOLA. Good food, nothing fancy, but they are always packe","useful":0,"cool":0},"--8eQbA-duiV_V0JGxGSsA":{"text":"We stumbled upon Mr. Ed's tonight - and what a happy turn of fate! We were welcomed into t","useful":0,"cool":0},"sXEqdqSsO4jc04RIYvzxxw":{"text":"Stopped in for dinner after a day of partying it up in the French Quarter. We were greeted","useful":1,"cool":0},"rBSM3Rn6kJqvCnNATPH-Fw":{"text":"We order so much food, we can remember the names of it all... but service was amazing food","useful":1,"cool":1},"ukahiBvcagwvcMTTSe1faQ":{"text":"Food was excellent. Although there was a bit of a wait it was worth it! The charbroiled oy","useful":0,"cool":0},"ARZnG_iv0wRLA8jBrDY3-A":{"text":"We got caught in the rain and just walked into this place. It was packed! We ordered drink","useful":0,"cool":0},"Pjb8nQwOCUpQpZpgFo4Gwg":{"text":"Food was amazing! Fast & friendly service. We got a table on the second door by the window","useful":1,"cool":0},"wRP1MNz32vicfH1HhMBIcg":{"text":"Found out about this place from our food tour guide. Our visit got off to a not so great s","useful":0,"cool":0},"EGf5RyPKCz01hHSswvndbg":{"text":"Very good choice.  Just a small while in the wall but the food was great and the service s","useful":0,"cool":0},"f1FOMu-kYLnpLPG0Bl2-7A":{"text":"If you love seafood, you will love this place.  I was in town for a work conference, and s","useful":0,"cool":0},"19QPYqlcHnFyQNvgyRXZCA":{"text":"Great food and reasonably priced! Not overcrowded like other spots in the area. I eat here","useful":0,"cool":0},"xjx3n0FDQdEEqHgjqt68AQ":{"text":"Had calamari and charcoal grilled oysters.  The calamari was ok.  Nothing special, but the","useful":2,"cool":1},"9fHfKFtfRA02NYi3S50PnQ":{"text":"I cannot say enough fabulous things about this place.  The service was fantastic and the f","useful":0,"cool":0},"IUHFmNQuih69kgPjZGhM-A":{"text":"Thank you Lyndsey for being a such a sweet waitress and helping us find cool things to do ","useful":0,"cool":0},"lTzsK0Q-dlptm0XsgeHo1g":{"text":"This is the second time I have had the pleasure of eating a meal at the establishment. Cha","useful":0,"cool":0},"YqFxB-IZ1Us9bQfhDe1iag":{"text":"Came across Mr. Ed's completely by mistake but it's the best accident I've ever made. Was ","useful":0,"cool":0},"DA1WejopaXUTy4iPic59hQ":{"text":"The oysters are incredible. I think one of the best in town, and we did try lots of places","useful":0,"cool":0},"8Mt7p0kXOwsrCuzKb8XESw":{"text":"We had the Fried Green Tomatoes Napolitano, the Louisiana Crawfish Bread (so cheesy!) and ","useful":0,"cool":0},"FGy4orFH_WNBsYdVDIOPWg":{"text":"We loved our experience at Mr. Ed's! I had the crawfish crab cake pasta and it was absolut","useful":0,"cool":0},"WZKZN37IGN-4fu-gSPjqXA":{"text":"We stopped here on the recommendation of a friend who lives in the area.  Had the Charbroi","useful":1,"cool":1},"CNBMlENHlfn0Wl5k0bN6_A":{"text":"This was my second time at Mr. Ed's, and it was disappointing.  My first time here, I had ","useful":2,"cool":0},"NH8fE7TkE0Vrmn7wRVEOdA":{"text":"Great tasting, freshly shucked oysters. Friendly staff, clean & welcoming ambiance. We sat","useful":0,"cool":0},"L_9bTYFubvy3bf53AU0-FQ":{"text":"Solid three stars for this experience. Our server was very nice, the food was great, and t","useful":0,"cool":0},"dVhlyWs_RWoxBaowA1Xc_A":{"text":"Super friendly customer service! Their Roast Beef Po Boy is the thing to get here! It can ","useful":0,"cool":0},"e__24bU2ovE_RFn90GnfpQ":{"text":"This ended up being our favorite place to eat while in New Orleans. Everything we ordered ","useful":1,"cool":1},"0MqIEcf3jh2fWobWM7E15Q":{"text":"The service was ok but the food was bland and tasteless .. You'd think food in New Orleans","useful":0,"cool":0},"uI72R6x5e_0w5dd3GSmsdA":{"text":"Huge portions! Delicious shrimp po-boys and chargrilled oysters. Loved it! Would definitel","useful":0,"cool":0},"MvMgFL9E-QiJDs0RqABL_g":{"text":"Great seafood restaurant in the French Quarter. I cannot tell you how amazingly fresh the ","useful":0,"cool":0},"-m4FjpTyhyD7RIPcLmH86g":{"text":"**BEWARE** stay away! This is a tourist trap. The high ratings are faked. We arrived aroun","useful":0,"cool":0},"tw3rCJ3KyRy4J5OkQfNRhQ":{"text":"This place is amazing. I had never had gumbo before so I had looked this place up and deci","useful":2,"cool":0},"LKKoM4wk2flOKtddyhAWXw":{"text":"Great service.  Crazy good food.  Will probably go again before we leave and hope we get t","useful":0,"cool":0},"nVkfGJg-KPj9R4oEE24W0A":{"text":"Not like five star fancy but the place is like a secret gem and the value / service was go","useful":0,"cool":0},"VzUk-b1osJ6pI9Fs3bSNBQ":{"text":"We were seated quickly and our server was friendly and helpful. We came here wanting authe","useful":0,"cool":0},"qUBspqFpEi2xLbfxFTuNcA":{"text":"My uber driver recommended this place and it did not disappoint. Great food AND service. V","useful":0,"cool":0},"0DHXWB-jG9543znENfXBeg":{"text":"Best Poboy I've had yet! Their bread is sooo good. We got the crawfish Poboy and it was am","useful":0,"cool":0},"ry6TzQBVQFMmjWB4mLqH6A":{"text":"Sooo good! We were originally planning to go to Acme but the line was atrocious. We walked","useful":0,"cool":0},"RJjwOY3GtqIFocTd4mMUPQ":{"text":"Decided to try Mr Ed's after seeing good reviews but let's just say what a bad idea.  \nSta","useful":1,"cool":0},"oIhSeke5KAkkejjoD91Xxw":{"text":"Excellent service at the bar. The pours are generous and strong. I went to have one drink ","useful":0,"cool":0},"Gl-0bJ9r11j3XFgYmYN5aA":{"text":"While staying in the French Quarter we had walked past this place several times. We finall","useful":0,"cool":0},"89f0CtZzxJ6jBWVObQlkew":{"text":"Wonderful service and even better food. We're big Oyster fans and it was our first time ea","useful":0,"cool":0},"UpB9qCdH66LxvyQXvQuT_w":{"text":"Delicious!!! A hidden gem for sure ! I had barbecue shrimp and a side of cheese grits! It ","useful":0,"cool":0},"PQW3FiXibwhq-vXAAVzqMg":{"text":"Cozy little place with friendly service. I had the seafood beignets and they came with a t","useful":0,"cool":0},"0ljo3IQ8ZuM9eWLxloTQTg":{"text":"Great charbroiled Oysters with Halapeno! We took advantage of a delay in the flight and ca","useful":0,"cool":0},"IlyrW9IrEkf-H8-VyzuUUw":{"text":"My wife and I needed a appetizer to hold us up till dinner 2 hours later,turns out we were","useful":0,"cool":0},"UlSR2Z7C9Aaze87AJQ-1NA":{"text":"In my opinion, this is the best seafood in Louisiana. It is not pretentious, the service i","useful":0,"cool":0},"ywfZ8BW0uBizsj2UONEz8g":{"text":"We had the fried seafood platter and it is amazing...not greasy at all! Shrimp, catfish, o","useful":0,"cool":0},"3D_JHqD6Qc6MWlpiO9dGYA":{"text":"Just sat down and so far, Michael, the bartender had been amazing! The atmosphere is great","useful":0,"cool":1},"gGcIpB-Icu52eijpmGMp-w":{"text":"My first trip to NOLA!!    This was my favorite restaurant we ate at!     Very very friend","useful":0,"cool":0},"BikfngxqzD-TWynG5uILVg":{"text":"Service is always great. Yummy food  high recommend trying charbroiled oysters or crawfish","useful":0,"cool":0},"hoduOfpJoC6KP00FoACa_g":{"text":"Everything was excellent!! Will definitely be back...we tried 2 dozen Charboiled oysters, ","useful":0,"cool":0},"RIuoBATQ4fX9O2aaPn6VGQ":{"text":"Best meal of our NOLA trip.  The charbroiled oysters were great along with the fried green","useful":0,"cool":0},"uXq4IBbwOL8kYb7JuWrtXA":{"text":"We came here because we saw all the good reviews. This place has absolutely HORRIBLE SERVI","useful":0,"cool":0},"vTUi1SbLDOsHUCyTlbY4cw":{"text":"While on my 4 day trip to New Orleans in October, I visited this establishment twice. The ","useful":0,"cool":0},"nlBpwDCJqX_bqvLKytS3Lw":{"text":"Incredible food! Good drinks. Party of 4 and everyone loved their dish. Makes my mouth wat","useful":0,"cool":0},"j6AMn5oMijBWAdsq_fHGaA":{"text":"It was first visit and I/we enjoyed the food. The portions are generous and the service wa","useful":0,"cool":0},"iBtVsRFYnKWEoNyHrl2i9Q":{"text":"Best restaurant experience we had in New Orleans during our vacation. My wife LOVES chargr","useful":0,"cool":0},"RfGVSoNLcV8QBAYMQdEBbg":{"text":"Not agreeing with the hype of this place. Servers where unattending and not helpful. Food ","useful":0,"cool":0},"5jv8s2DGYlKeUF5xPVGDZg":{"text":"Great raw oysters!  Food was good and it felt like that little neighborhood place. I like ","useful":0,"cool":0},"KZkbTFkkY-NxLaDX6RXc8A":{"text":"Local and a good place that represent NOLA beautifully. The smell is the delicious food wa","useful":1,"cool":1},"gQ_osc8p_KZoHLrIrt98Dg":{"text":"We'd definitely hit this place up again.  Our waiter, Lonnie, was a rock star.  Attentive,","useful":0,"cool":0},"IRO3DSBE4c3bQK1I7VwQ6Q":{"text":"I had a pretty good experience. The oysters were by far my favorite thing. Crawfish etouff","useful":0,"cool":0},"oGST4kaWagXKHDxzjimVhQ":{"text":"It was walking distance from where I stayed in French quarters. There were a lot of review","useful":1,"cool":1},"DBTUAiyAkobhF0SCUJej9Q":{"text":"We went here with a large group. The service was good and friendly. I highly recommend the","useful":0,"cool":1},"CpLsNiS0ps8SAjUp4vZjOQ":{"text":"We came strictly for the charbroiled oysters. We were actually on line for Acme and a Mr. ","useful":0,"cool":0},"9t0yJ3tTGVDCoXz-Ixr0Dw":{"text":"My new favorite restaurant in New Orleans. Family friendly (we have a family of six) but l","useful":0,"cool":0},"lj6IleOrVf2CwyRiAguBvA":{"text":"Had chargrilled and Rockefeller oysters both were great. Would have liked them to be bigge","useful":1,"cool":1},"VuXXt4hP1u_93qdNsnHPZQ":{"text":"Amazing find!  Thank you to our Uber driver, Tamika, for your suggestion.  Great food and ","useful":0,"cool":0},"3sL3CitKVCM2C4KnevLEQA":{"text":"This place is great.  Food was awesome and quick.  The place was real busy, some of custom","useful":0,"cool":0},"3x4zMaC5xQbpWELLoja0ZQ":{"text":"This is a true place of garbage.....zero respect for anyone and 0000.0000 New Orleans clas","useful":1,"cool":0},"RbE_VII729AlMfsgCUN80g":{"text":"I'm just going to start off by saying that we almost passed this place up and that would h","useful":1,"cool":0},"QjDCrevQhfar62v7uX7YOg":{"text":"Let me just preface, I don't like raw oysters and honestly, before I came to Mr. Ed's I do","useful":2,"cool":0},"dRmQcaEYz0fgxHLPwBfJcg":{"text":"Delicious oysters of all varieties. We tried one that was topped with crayfish and mushroo","useful":0,"cool":0},"hYvZmV4QmKf-z0C2GLE-UA":{"text":"Our first stop at New Orleans. This review is overdue since Mardi Gras but I still remembe","useful":1,"cool":0},"Kpf4v6zcyC8HaGlY5142og":{"text":"Had my first ever Bloody Mary here and it did not disappoint! They have an original Bloody","useful":0,"cool":0},"ukBtVI_yBrAiiHWcLJuDIA":{"text":"Great place with authentic Louisiana food. The turtle soup is a must - try! It's the best ","useful":3,"cool":0},"MX0kh1r_II_RQok1NgRqQg":{"text":"No complaints, food is excellent with large proportions. Very authentic New Orleans cuisin","useful":0,"cool":0},"ulxkmh0aa7CfP7B2SnzsFw":{"text":"Okay the mixologist, Alen is freaking amazing! The customer service is great. Autumn is su","useful":0,"cool":2},"IeaDRPESEVxke94jO6C_7g":{"text":"To date these are the best oysters that I have had in quite some time. Luckily we walked r","useful":5,"cool":5},"aO9rEhONBo90Jv-J9zmODA":{"text":"We tried Acme oyster house per recommendations and thought their charbroiled oysters were ","useful":0,"cool":0},"MtZGgKYWKmv6099bcYEg6w":{"text":"Holy crawfish, this was one of the best spots we ate in New Orleans. You must sit at the b","useful":2,"cool":2},"j6Mhuj987i7aJHjb5DUQQw":{"text":"Words can not express how wonderful this little local place is.  The food is extremely hot","useful":0,"cool":0},"XO2uEheJTOOB9S_g6tJv_g":{"text":"Loved everything we all ordered!!  Excellent choices and the staff were all very knowledge","useful":0,"cool":0},"_v4gjWBceHDZMzZL5Zt1DA":{"text":"Yummy! Great service! Delicious oysters(char-grilled), shrimp with cheese grits amazing! R","useful":0,"cool":0},"ccK4w0tGR7Ifi9yl_Zd9BQ":{"text":"The day before dining at Mr Ed's I'd sat beside a local who gave this advice:  \"In any res","useful":13,"cool":15},"B_IHr2zqOlbtP_5CrTXP0Q":{"text":"Horrible... read the 4 1/2 star reviews and thought to give it a try. I like Oyster, but e","useful":0,"cool":0},"k6TRqJklQiv07rXjEKBBTw":{"text":"Was looking for a place near our hotel and we really lucked out. Great old fashioned custo","useful":1,"cool":0},"coL7DTbAcygd623_2rXzfw":{"text":"Amazing food & service!!! By far one of the best experiences I had while in NOLA. I had a ","useful":0,"cool":0},"BNZa_4ufK_PYFJs7EleELg":{"text":"Devin, Lele and Manager Brian with an \"I\" cuz that's the only way to spell it are the bomb","useful":0,"cool":0},"5lugOjvKSX8-jIuFL0giwA":{"text":"What a fabulous place!  We ate here 4 times during our trip.   We made it our mission to f","useful":0,"cool":0},"L-7d2Rsm-JgidDS6TX0u4Q":{"text":"Five star service!! The mixologist made us a drink that was fantastic. Service was prompt ","useful":0,"cool":0},"GWlMmxOsZY3RsKOn3HDfaA":{"text":"Outstanding etouffee!  Great raw oysters!  A very lively place with excellent service.  Wi","useful":0,"cool":0},"M6eSjoAFqPQwiBPNpUt1xw":{"text":"Best charbroiled oysters in New Orleans hands down. Wait staff was very friendly and atten","useful":0,"cool":0},"WWDEPtZsCejTW2MqekqI1A":{"text":"Tried to go to the royal st location first.   Due to the long wait we were directed to thi","useful":0,"cool":0},"PCUhcSphM9HAAv53CZ2B7Q":{"text":"Very casual diner that just happens to serve southern food. Expect slow waitresses & medio","useful":1,"cool":0},"7PnnXEZpOylQJfht-T_f6g":{"text":"Wow\n\nWalked in with an 8 top and was seated immediately New Years day. Absolutely incredib","useful":1,"cool":0},"MZngezkgiW80opS7n1v4Kg":{"text":"Almost passed this place by... Glad the outside greeter handed me a menu! I was hesitant a","useful":0,"cool":0},"t923n3F8DZvA4j8elIYQrA":{"text":"The bellhop at the Westin recommended this place for good oysters but what he should have ","useful":0,"cool":0},"7Xm2P9kU4bIg7BLllk23xg":{"text":"This place is awesome! We love coming here every time we visit NOLA. Of course, we try man","useful":1,"cool":0},"FxLJ3JK2xql8Tu8EOxNgSQ":{"text":"I was in New Orleans for my birthday and our Lyft driver recommended this place. My friend","useful":0,"cool":0},"YUssPuxTt7krw11Coq4zmw":{"text":"Before I write this review I must state this: Oh Tammara, you gave my group life. If you a","useful":5,"cool":3},"YMj2jsHwdQEdQ86hx6mx9w":{"text":"Great oysters! Great price! Sat at the bar with friendly staff! There will be lines at tim","useful":0,"cool":0},"iUCOlCmmm2xKTaa5qklOmg":{"text":"This was an excellent find in the French Quarter.  Service and food were both outstanding.","useful":0,"cool":0},"mGcr7iWf1SbnYDZW2VYlhw":{"text":"Great oysters, soups are very good. Servers are attentive but like everything else in the ","useful":0,"cool":0},"YDBfiSkwqADj1tiFcmvI-Q":{"text":"I had the taste of New Orleans and it was delicious. And the shrimp poboy was delicious. T","useful":0,"cool":0},"-4VGiIeQ9hXYGmznL0mmjw":{"text":"Perfect first night meal.  Craving creole and Cajun.  Great draft beer and great service.","useful":0,"cool":0},"0ebkpUnWs-cjicHbgnP2Kg":{"text":"We come to New Orleans approximately once every three months. Mr. Ed's seafood is always o","useful":0,"cool":0},"0Jq1zUiYSMveVf_afQxFQw":{"text":"This place was AMAZING! Granted lots of places in NOLA make delicious charbroiled oysters ","useful":0,"cool":0},"lRovXspDD122Q3tdI8rr6w":{"text":"Came here after having some brunch and wanted to grab some charbroiled oysters before leav","useful":0,"cool":0},"11b6hnbLJBRdzEcn-gHDvg":{"text":"Amazing! Amazing! Amazing! The charbroiled oysters will melt in your mouth. Bursting with ","useful":0,"cool":0},"fIgIwjvMgp2drzGdSC96OA":{"text":"We had an amazing experience at this restaurant. The food and this restaurant were one of ","useful":0,"cool":0},"_FDjebtk9_1fMxVhdnirpA":{"text":"Had the shrimp and grits and it was very good! All the different dishes we had, including ","useful":0,"cool":0},"BP0MMgv3IdXJRob23MIVIg":{"text":"Sat at the bar for lunch. \nGreat spot. \nYummy food.\nLovely service (shout out to Lindsay!)","useful":0,"cool":1},"ZRdAPoMdjpfvQ8EuzMGphw":{"text":"Just landed here, checked into the hotel and asked where I could get a quick bite not at a","useful":0,"cool":0},"pbcqbBvDt8_OVycLH8_FYw":{"text":"After walking out of another restaurant, I was trying to find good char broiled oysters.  ","useful":1,"cool":1},"1bKQy6WT-jQ2A_AKQ_NXTA":{"text":"Charbroiled Oysters!! So Good!!!\nYou will not be disappointed. \nTried several other places","useful":0,"cool":0},"HAUwX-x3Y7L5oCx0mIk6JQ":{"text":"Super long waiting time.... The waitress was watching football game during service time...","useful":0,"cool":0},"nGHZUyRasn7swSqfR7TxGg":{"text":"Had the Charbroiled Oysters and Redfish Orleans while Motown played in the background. So ","useful":0,"cool":0},"K-4h8tl8CZdU2CZ8DVd-TQ":{"text":"Meghan took great care of our big family of six!  Everything she recommended was awesome. ","useful":0,"cool":0},"nwx86xuTvt1xAjdN_bAbnw":{"text":"I need to give Tabitha the highest rating possible at Mr. Ed's. I can't truly describe how","useful":0,"cool":0},"Fn4DlcXSGCW-kWu6uDArKg":{"text":"Fantastic Food and service!! Recommended by our host at the Bed and Breakfast (1809 O Mall","useful":0,"cool":0},"rysC1tMqDsyR9qlI440AHA":{"text":"Best restaurant in new orleans. Charbroiled oysters were AWESOME. Their appetizers are all","useful":0,"cool":0},"KHfgOw8esZ6AwYrEIOfmYQ":{"text":"IN-FCUKING-CREDIBLE! Probably my favorite place I've been to all year. It definitely feels","useful":0,"cool":0},"B0kGcrVU5sa9_YXRQLYLCA":{"text":"The causal place to go for fried seafood in the French Quarter. Not too fancy, not overpri","useful":2,"cool":0},"34YVA9T8UX6XrOl7uIHkxA":{"text":"Mr Ed's Oyster Bar was our last stop in New Orleans before we went back to our daily lives","useful":0,"cool":0},"Cap9yYnb0U4i6jKHZvc0Cw":{"text":"What a little gem. We had just finished some shopping, started talking about lunch and stu","useful":1,"cool":0},"YxXq3YpMUMLYkpvAnNPy4Q":{"text":"Charbroiled oysters were so good!!! A must! Barbecue shrimp was just okay. But the oysters","useful":0,"cool":1},"TOxblsxLQXNPIHD5VToYFw":{"text":"Hands down the best place to come and eat.Wow,I was so impressed by the quality food.The w","useful":0,"cool":0},"97_pg63uYLZPd6VI-W0h3A":{"text":"My husband and I had lunch here.  Very friendly staff and great shrimp po boys.  Also love","useful":0,"cool":0},"_lZzJayd8hyXUvYPckSq7g":{"text":"WONDERFUL.....  I had to think about how to rate this experience because it was that good.","useful":0,"cool":0},"irHPAUCBPrli7s9AmXePkQ":{"text":"My friend and I ended up missing our flight out of New Orleans and I'm so glad we did as I","useful":3,"cool":2},"J7gvqL2_VAso-SCgq3XQyA":{"text":"We decided to try this place out for drinks and dinner and it turnes out to be pretty darn","useful":0,"cool":0},"kuJFfCGyRq86xIjTWugP8A":{"text":"I was roaming around the streets and happened by this little hole in the wall. I just want","useful":1,"cool":1},"yVSHpKDITRg4N-eqLSxRFQ":{"text":"Pros:\nMusic was amazing from beginning to the end.\nWaiter seems to enjoy his job and was b","useful":1,"cool":1},"eWmbmCNFg9rHIuwdfLhaNQ":{"text":"Sometimes you stumble on a hidden gem... the restaurant we intended to go to was closed fo","useful":0,"cool":0},"Y20kLetakllVJ7nY35KbYQ":{"text":"This place I found on yelp and we were so impressed. I've never had grilled oysters before","useful":0,"cool":0},"zdk8uQwQj1dOnnUV24tQ0A":{"text":"By far the best oysters we've had while in New Orleans. Grilled, Rockefeller and Beiunvill","useful":0,"cool":0},"zQlWaIFcFEybZSCcr_9_wg":{"text":"My family and I just left this place and the service was by far the worst we have ever exp","useful":0,"cool":0},"S4kMyZ-aCUuf_9dMJqt_HA":{"text":"Really good food and service. Only thing I wouldn't recommend is the fried green tomatoes.","useful":0,"cool":0},"_p5Pe3_SOjEmfqjyZU1T2Q":{"text":"I'm not sure what to say that hasn't been said already.. but the charbroiled oysters were ","useful":0,"cool":0},"BYeRBg-8NI4We0mVx8Nk3w":{"text":"This has always been one of my favorites until tonight. Traveling alone, I sat at the bar ","useful":0,"cool":0},"UhWN602Gem63Lo9Ls2PJuQ":{"text":"Hole in the wall loaded with homemade goodness. \nHad raw oysters, Creole gumbo, Redfish to","useful":0,"cool":0},"iix2R02jU-Si2H4zYbEkwQ":{"text":"My BF and I came in during a Sunday and the Saints were playing. Lucky for us we went earl","useful":0,"cool":2},"MT9KKjb6y4TRI4jmdaf-UQ":{"text":"I'm so glad yelp did not fail me here. Always feeling pressured when my friends designate ","useful":0,"cool":0},"XQbRsjDaYb4NcDNTpv1fmQ":{"text":"This place is unassuming but delicious! \nI had the charbroiled oysters and the seafood gum","useful":0,"cool":0},"eKbm_oLSHNYFkMbVAFIFLA":{"text":"Oh....My....Word..... I cant even begin to describe how amazing the oysters were here!!!! ","useful":0,"cool":0},"GWoZIVvFxjN5U4jfhmecrA":{"text":"The best oyster bar!! The charbroiled where fantastic! The raw ones where fresh , large an","useful":0,"cool":0},"pLl-39BBUC3YfBF2GrhPtQ":{"text":"Loved this restaurant. Service and food were top notch. Our server Caylie was the best! Th","useful":0,"cool":0},"paHDcLDO1sPF4qQ6MfNJbg":{"text":"I love love love mr Ed's the oysters are to die for!!! The gumbo was soooooooo amazing! I ","useful":0,"cool":0},"dtSxRxVL00gKWe8XVGK3wA":{"text":"We loved Mr. Ed's!  The food, the service and no wait because we went later at night.  The","useful":0,"cool":0},"MqVXNB5v6vAgRCw9Oook3g":{"text":"Absolutely the worst service I've had anywhere this year. Came in for lunch, got seated, o","useful":0,"cool":0},"zAmt_h63XbRwvCSc4HXSlg":{"text":"This place is really great. We had the oysters which were amazing. We sat and ate at the b","useful":0,"cool":0},"v1z9fKOhIBrcAPKa5AkgFQ":{"text":"The staff was very helpful and prompt.  We really loved the shrimp and grits best.  The gr","useful":0,"cool":0},"W_pQ0o8mz6Z5t-qRcPspdA":{"text":"My gf and I came in on a Saturday night around 9. They do not accept reservations. There w","useful":0,"cool":0},"1A_4tVgTHNbbEgG7DoErWg":{"text":"Wow!  This place was recommended by the concierge at our hotel. He said we would not be di","useful":1,"cool":0},"J3iGQX59me8ND2p9yQQ4-g":{"text":"My first restaurant in NO and it was absolutely fabulous.  Tried a combo plate and my favo","useful":0,"cool":0},"wHHppHKxh6aU77ij6Kd4LQ":{"text":"The Best restaurant in Nola.  Charbroiled oysters and crawfish/spinach dip is DELICIOUS!!!","useful":0,"cool":0},"ob1HC8TDmK0hU3VUge7IIQ":{"text":"I'm not sure what all the hype is here. The experience that I read about and saw in other ","useful":11,"cool":8},"Tfht9p2iLMBa266pBRhvFA":{"text":"Out of all the places we had charbroiled oysters, this place was as good as ACME, if not b","useful":0,"cool":0},"6IiiCSOrSFIchHD3HG92KA":{"text":"The food here is mediocre I hade the fried oyster and shrimp platter and the oysters were ","useful":1,"cool":0},"9y0YLxbKsfPJdEyKskD13A":{"text":"Oh Mr. Ed's, your food was delish.. Drooling.  I'm\nstill thinking about the chargrilled oy","useful":0,"cool":0},"syC-IB-EyInCh7QyLWjD8g":{"text":"We headed to Mr Ed's when Acme had a line out the door and we're glad we did. The service ","useful":0,"cool":0},"AhbVkhjf-YuYsaswIgOPQA":{"text":"Nice ambiance. Went during lunch hours. Best gumbo I've tasted since my mother passed in 2","useful":0,"cool":0},"85HyW4j1rWs9JnHntAV_vA":{"text":"Mi restaurante favorito.. las ostras de este lugar son increibles ... un sabor exquisito. ","useful":0,"cool":0},"DezfHGWEtbJY6n_8T2-G6A":{"text":"Food was awesome and the service was even better !! The herb and butter oysters were my fa","useful":0,"cool":0},"MQdkv300WNZZl8n6dle-CQ":{"text":"Just like many of the other reviewers stated, this place is great. Sat at the bar and had ","useful":1,"cool":1},"icB2CzTVUIZKcSycuCYoXA":{"text":"Best char grilled oysters AROUND!!! Tam, the server, treated us so well. Friendly staff, q","useful":0,"cool":0},"B1VhYsoiu7fsie-p6xCOJg":{"text":"This place rocked!   Nice, small, great food and the staff was amazing!","useful":0,"cool":0},"fOO4rGiU9bnAWLIU4ro1iw":{"text":"Good food.  Good value.  We had dinner and tried the charbroiled oyster and the Taste of L","useful":0,"cool":0},"yqROjuk4XyU9jZpp6x5Zdw":{"text":"We had a small late dinner here on our recent trip to NOLA.  Everything was OK but not gre","useful":0,"cool":0},"7GNPwwlLz4q7j-79jJRrlw":{"text":"Go here if u want the best oysters in NOLA. Butt kickin' cajun crawdad's not advertised on","useful":0,"cool":0},"uh6i2rrlIKs8ftais0ROBQ":{"text":"I have to agree, oysters here are as good as it gets. Great service too. I wish I could vi","useful":0,"cool":1},"Ub58GentjoMZheJ15vdTwQ":{"text":"This place held the honor of one of the top 5 meals I've ever had! Not top 5 in New Orlean","useful":5,"cool":3},"__kx4wpmqhUfh84IDIe6oQ":{"text":"Best charbroiled oysters in NOLA.\nEnjoyed the food and staff. Emmy wife and our close frie","useful":0,"cool":0},"AJk9fIsvr5Ub6rvD-ruDVg":{"text":"In New Orleans and just had to get some good old NOLA food, Cajun style and seafood! I lov","useful":9,"cool":7},"UQEdPMpgJqTLDt-19RSS_Q":{"text":"Another MUST DO in New Orleans!  We come back every year, and usually get the same things.","useful":0,"cool":0},"YyvEqcgWVlal_fYc8_XRNg":{"text":"When we arrived we were immediately greeted by the hostess. While walking to our designate","useful":2,"cool":0},"Dds60O_x3Egl8RYh4aYvdQ":{"text":"Had an ok experience. Me and 3 friends went during lunch hours and our waiter took a while","useful":0,"cool":0},"ZHseGxh6b5Fo7YEwtHrkAg":{"text":"The food here is amazing. I had the shrimp platter and it was absolutely divine. The price","useful":0,"cool":0},"a18S8Y_d5x_jGgG3_5oVJQ":{"text":"It's a really small spot, so expect to be packed. The food was great though! And they give","useful":0,"cool":0},"YAQ3kw37vATaxtXkLmREPQ":{"text":"Great spot to escape the muggy heat. Also the FATTEST oysters I've ever had in my entire l","useful":0,"cool":0},"8GmnQInvY4VfANg_lqbUMA":{"text":"Mr Ed's is a nice, cozy place to get some oysters! It's a kind of small restaurant but two","useful":1,"cool":2},"VgcX5-fteqEPaJdLP8bmcQ":{"text":"I had passed by this place a few times and finally on my last night in NOLA decided to go ","useful":0,"cool":0},"IZnRYu_eNWMnJEUyXMxKig":{"text":"Gina is the reason we come here every time we are in New Orleans! The food is to dye for w","useful":0,"cool":0},"VtaQ5uqUietNh9jGm5AXrA":{"text":"This place was the bomb!! I will visit whenever im in New Orleans. The oysters was great a","useful":1,"cool":1},"gqh6L9YLmCb6olyYcH7aPA":{"text":"SOOO GOOD I got the Chargrilled Oysters (to die for) and the side order of the Shrimp Etou","useful":0,"cool":0},"HhtE8CvDKUylrnIIchBivQ":{"text":"Aghhhhhhh where do I start?!!!\n\nAmazing? \n\n- My only negative comment is they didn't give ","useful":1,"cool":0},"UvUogXnFj707Vrhq5A6uig":{"text":"This was my last dinner in New orleans and my favorite out of all the restaurants we dined","useful":9,"cool":11},"Aw3lLRh_dvLt1bHcpCfGuw":{"text":"Very friendly staff and the food was amazing. Definitely try the Louisiana Crawfish Bread ","useful":0,"cool":0},"urd5M3-CyaEv6K1ceTskUg":{"text":"The char grilled oysters are by far the best we have had. Absolutely delicious! They were ","useful":0,"cool":0},"BWGwMZzrCJaRObC123nDSw":{"text":"Dear God it's good!! If you walk out of here hungry, you are an idiot. The service is grea","useful":0,"cool":0},"POUYWKdugFgauIc-bXQ6SQ":{"text":"Best raw and grilled oysters in NO!  The oysters were wild and many had very deep cups. Th","useful":0,"cool":0},"0oxCb2HS3MGT-2jrglBuJQ":{"text":"Tried Mr. Ed's yesterday for the first time with my fiancé and two friends and we were all","useful":1,"cool":0},"cJroZq3zTUzneGa6XUJMag":{"text":"Holy Mother of God and Baby Jesus! Whewee, that was just about the best meal I have had. P","useful":5,"cool":2},"z3ADzY1vbl90F9yXyT2CCQ":{"text":"Everything I've tasted was excellent - charbroiled and fresh oysters, seafood nachos, craw","useful":0,"cool":0},"TmE3fKAYnHyqE-d1EqrJcw":{"text":"Quintasential New Orleans! Terrific food served by caring staff in an easy-going style. Th","useful":1,"cool":0},"J4hOJ-DAtnLeNEuXhRsGqQ":{"text":"Shrimp & Grits/ Server: Gina she's amazing/Great flavor, great music/Reasonable prices/ Ch","useful":0,"cool":0},"ZLi7J1TYQUQBWyhR7OGHZA":{"text":"Excellent and friendly service from our server, Patricia and the manager, Dale. The charbr","useful":0,"cool":0},"YnnfrxJncPA3SmVAK79Jpg":{"text":"Literally the best chargrilled oysters in the entire city. Hands down. If you try only one","useful":0,"cool":0},"OBSCzY5ojPLGv6SvOLLRWg":{"text":"First time in New Orleans and wanted to some authentic food here. Stumbled into this place","useful":0,"cool":0},"nbTZ4l949eOiO6vslydiCw":{"text":"I don't even know how to describe the delight of this place. First time in New Orleans and","useful":0,"cool":1},"CSqBpRLYI4-xBku6KpVPpw":{"text":"Food is amazing!!! I saw the reviews so we came here, I wasn't expecting it to be soooo go","useful":0,"cool":0},"HAVIGuN7QV_BXnQ1mynnyQ":{"text":"OMG if you are in the French Quarter and want REAL CAJUN FOOD, COME HERE!  actually probab","useful":0,"cool":0},"jRcU44kO_2EQB-vwNunMCQ":{"text":"This is a place you must visit.  Off the radar but spot on for Nawlins flavors.   A must h","useful":0,"cool":0},"RIW_AUynpphng86dRCRxtQ":{"text":"Line for Acme was insane so we decided to come here. Did not regret!! The food is amazing.","useful":0,"cool":1},"G2Ib9uIob5-LCdDsye-kxg":{"text":"Just left after waiting 30 minutes. Called and they said \"no wait if you're here soon.\" Go","useful":0,"cool":0},"69TPiKoXSwcicZXzcQoVzw":{"text":"Awesome food, great service and prime location.  You have to try their chargrilled oysters","useful":0,"cool":0},"Zzcs3p4BHb4W-lIQL4MACg":{"text":"Came here on a recommendation- we should have been more specific on what to order. We got ","useful":1,"cool":0},"8-0c0nzuMEdzfOksQXsuMA":{"text":"One of my favorite oyster places this trip though I only got to try the cooked varieties a","useful":2,"cool":1},"hk3OHHbaRWcy-oyupuO1Xg":{"text":"The food was absolutely amazing! I had the barbecue shrimp and sat at the bar. There was n","useful":0,"cool":0},"uIbLrBPI2W482S7NUowBfQ":{"text":"If your looking for a great seafood place and want to try some creole style food, this pla","useful":1,"cool":0},"o_Zi01b_Vr0_8EIqEPDDVQ":{"text":"I had an amazing time at Mr. Ed's and the food was delicious.  The staff was very friendly","useful":2,"cool":3},"UtG_fJfU9JOqP60eZrdKSg":{"text":"Couldn't have had a better experience everyone in the groups food was phenomenal and all a","useful":0,"cool":0},"arrZ3vwKqUlY9_osgXCTLg":{"text":"The food was delicious, especially the charbroiled oysters! The waitress was great with ou","useful":0,"cool":0},"JjKglsNSXT8TdH05TE4DbA":{"text":"This place was just not good at all. My boyfriend and I were one of four occupied tables a","useful":0,"cool":0},"7rLHK4RdCER6QhObnTIbOA":{"text":"Nothing to write home about! Visiting from Atlanta. I really didn't like this meal. I had ","useful":1,"cool":0},"s_6BpWvFA3OIdjNtE-pl5g":{"text":"The chargrilled oysters were delish!  Some of the best we've have in the NOLA!  And the cr","useful":0,"cool":0},"G3EIay61Ih0mchKY6u9zwA":{"text":"This is one the best places to have Charbroiled Oysters. New Orleans is known for good sea","useful":0,"cool":0},"8LkLwbU57yL65mXs6K42Aw":{"text":"This is my favorite place in New Orleans! Everything I ordered was so good! Highly recomme","useful":0,"cool":0},"C5gSbXpf4sLupDej6Vowmg":{"text":"Our waitress Ju was really sweet and attentive. The charbroiled oysters were good but noth","useful":0,"cool":0},"sLx4GYRYQQYRBgBH0rs8Ww":{"text":"Over the past few days we have eaten fresh oysters in Apalachicola, Pensacola and at Mr. E","useful":4,"cool":4},"DHQ0O6uUG6WixMD6G-ngfw":{"text":"Not bad, but Neyow's is still the best in New Orleans food. Check out my reviews on Neyow'","useful":0,"cool":0},"iU3Zf8ic59IUdcxhsMweUw":{"text":"The food here is simply amazing. We got the sampler and everything was awesome. It was my ","useful":0,"cool":0},"SKvZxb9tY0y7K7ZhNXiWeQ":{"text":"The food was excellent. The staff was friendly and the prices were reasonable. I recommend","useful":0,"cool":0},"01SgIfUrcZ-33OM-N3ZrYg":{"text":"Food and service were excellent!  Highly recommend eating here. Loved the atmosphere.   Lo","useful":0,"cool":0},"DH1rTzBh1lbeIsXDJR_ZVA":{"text":"Had the pleasure of going to this restaurant and boy is the food good? \nThere were 4 of us","useful":1,"cool":1},"Mo26w6rZ2bkIdBK7dfigpQ":{"text":"The grilled oysters were good.  I would ask for a little less cheese if I return.","useful":0,"cool":0},"mTPszUjgM0uqrp4ITQ9twA":{"text":"Oysters were very good.  Drinks were great.  Catfish eh...had better (tasted a little fish","useful":0,"cool":0},"6hXRtm_6HpZSzWw8J6phTQ":{"text":"This place was so amazing! We had a taste of New Orleans and the service was so fast and t","useful":0,"cool":0},"ThN3sUy6mg-f4OYJTOhPLA":{"text":"My experience was great Mandy was a awesome server and Juggy did a great job making sure w","useful":0,"cool":0},"xZhN-2AIpi7Ztn1QQAh--g":{"text":"Excellent food and service.  Always Yelp when we first get to town.  Never failed.  I sugg","useful":0,"cool":0},"yOmfqeR2SohD5aYt4Jbbng":{"text":"Un lugar delicioso para probar ostiones y comida tradicional de Nueva Orleans. Pedí la med","useful":0,"cool":0},"N-68RozK0SljPW_5V1f8og":{"text":"I would give this place 5 stars because the food and atmosphere was excellent, except for ","useful":1,"cool":0},"fTTblhjkzSkdfYN6ii_Zwg":{"text":"Their catfish Po Boy was delicious and the service was wonderful even during the craziness","useful":0,"cool":0},"stIDeBN16SbiISMALfPEyA":{"text":"From the moment of arrival, even with a long line we were greeted with a welcoming smile. ","useful":0,"cool":0},"BT6WuKWIkSrwwjtZQy6SbQ":{"text":"Great experience! Awesome oysters, friendly bartender, great well-made drinks, and a happe","useful":0,"cool":0},"3l8nlN0AoB4JQq2Yp1XJeA":{"text":"My go to for oysters when in town. Nice atmosphere. Friendly staff. Great food. Will keep ","useful":0,"cool":0},"vy6hChGW9qPL6u-f5QVnnA":{"text":"I am new to the city and I am not a big fan of Cajun but this place is so delicious and ev","useful":0,"cool":0},"ENKeczpNtTzGW2McOY0vdw":{"text":"Sat at the bar - very friendly service from the bartender.  Simple New Orleans food.  Char","useful":0,"cool":0},"oPju1Mw871bpY3JUmSXWtQ":{"text":"Outstanding Charbroiled Oysters ditto the Raw Oysters  Oct 2018 - We came here for a coupl","useful":0,"cool":0},"pTBL5TiGEHiyXduy7GTT8g":{"text":"Best restaurant of all during our 5 days down in the French Quarter. Good service and food","useful":0,"cool":0},"mB3kL2Xee5N-xa2I2sDCMw":{"text":"AWESOME food and service! Fabulous oysters! Best in the quarter! Tam our server was terrif","useful":0,"cool":0},"OhkNSD5vC024ZqVUNQHq2Q":{"text":"One of our first nights in New Orleans and we were out looking for some good/authentic cui","useful":0,"cool":0},"i3QRT7KXkmx1kgQrZ1ZCXQ":{"text":"Server was very prompt. Went for the oysters because the reviews. These were by far the wo","useful":0,"cool":0},"vGCH91wGCNS6Zc8BY9xZxw":{"text":"Mr. ads was very good. We split an oyster pack with char oysters and Rockefeller oysters t","useful":0,"cool":0},"UDdU4_AWmvLsf1U7B6k_2Q":{"text":"Chargrilled & Rockefeller Oysters were my favorites! I've had better po boys but the batte","useful":0,"cool":0},"8qPQ-vxDYzLLmokSGF2EJQ":{"text":"Pretty mediocre... It was good, but nothing to write home about. At least it is a block or","useful":0,"cool":0},"XrTuihtIAWg6Pk5l4sDTfw":{"text":"Been in New Orleans for four days. Found Ed's on day one. Food is amazing. Best charbroile","useful":0,"cool":0},"ZNlusGcBkqrnWv6Rbbswsg":{"text":"Mr Ed's was recommended to us by our concierge.  He told us that the food was great and re","useful":0,"cool":0},"yggfem4jkoYFpVgc_6JmEA":{"text":"DO. NOT. GO. ANYWHERE. ELSE!!!\nExactly what I love in a restaurant. Although- I'm hesitant","useful":2,"cool":0},"gV0Fr_LQ1jZiscRPGL6xTA":{"text":"We came here twice. Service was great. Food was great. Music was great. I'll definitely be","useful":0,"cool":0},"LVRah4h3iTCoQESfZcVlFg":{"text":"I must say that my group of friends were very excited about eating here for dinner since t","useful":1,"cool":0},"r_JaIyv9zutiVlmFhEkKPg":{"text":"The food was excellent. The staff was friendly and the prices were reasonable. I recommend","useful":0,"cool":0},"y-lU9E_8N1xmPa1L4S5DyQ":{"text":"Came here for the oyster shooter but ended up eating lunch and being very happy about it. ","useful":2,"cool":1},"euKac-GzayrvJwlEjZViaQ":{"text":"Be sure to try out the charbroiled oysters, they're delicious. I had the creole redfish an","useful":0,"cool":0},"z7SbEcVJ7zGFrdWUUl7QJQ":{"text":"Outstanding. Chargrilled oyster were at par or better than Acme, who also are no slouches ","useful":0,"cool":0},"Q-nZjze7GpMidEKjzTRnpQ":{"text":"Came to New Orleans from the northeast and knew I wanted the full experience and Mr Ed's h","useful":0,"cool":0},"qLagSOWbmkGfDpQhQfgxxw":{"text":"Best meal in the city so far. Came in on a rainy afternoon, so we didn't have to wait at a","useful":0,"cool":1},"oEVNU1yCNrXqNFKNLasqvQ":{"text":"A lil small joint but big in food and taste.  My group needed somewhere close to eat and I","useful":0,"cool":0},"jFcX3d2B2T_eVqRqFAYqEA":{"text":"Amazing grilled oysters.... AMAZING! \n\nService was really great. Can't wait to go back!","useful":0,"cool":0},"-Xtbn7WxsudoOV42VAoAXw":{"text":"Me and my fiancée came Friday night for my birthday and we couldn't have chose a better re","useful":0,"cool":0},"YyfYDeyohKVl7Tm2xsgSEA":{"text":"While we were in New Orleans, we were looking forward to trying for the first time Charbro","useful":0,"cool":0},"YZdqssF1YPnyluJA0QVW4w":{"text":"Small restaurant that was a big surprise in The French Quarter. Five stars. Allagator bite","useful":0,"cool":0},"OfTaaS4dpyZS8LUFUm8APw":{"text":"This place  2 thumbs up. So good. It was right next to the French quarter and while we wer","useful":1,"cool":0},"LqY_AgnUFUL9MMVNVxn2ow":{"text":"Food is good. Service is good. Watch for auto-tip if you ask to split the check. I won't b","useful":0,"cool":0},"iH72mIVmokAIMvnDYbqzyw":{"text":"The reason why I'm giving this place 3 stars is because of the cleanliness. \nTo start off ","useful":2,"cool":0},"x8oA9bvG4xby5oGqxYn4ng":{"text":"Fried Calamari, Creole Gumbo, and Seafood Platter \n7/10 everything was reasonably priced. ","useful":0,"cool":0},"NJkmzotlSC1GDg8o4rBu7w":{"text":"We checked out mr. Ed's on advice from a local and it was pretty good. The wait staff was ","useful":1,"cool":1},"dg0ZAIHCux9VLnrGMojrkQ":{"text":"James the bartender treated us  like we were family.   The drinks were out of this world","useful":0,"cool":0},"scOn9lUz89SakTdiTQqB3w":{"text":"Looooooved everything! Nice quaint location, food was varied, plentiful, and delicious!!!!","useful":0,"cool":0},"lEocikx6EK5hhWmCbr1JMA":{"text":"In town for a conference. This was our second choice because the wait at Drago's was an ho","useful":0,"cool":0},"O87Jw6fPh5uKngCgoQgKRw":{"text":"Stopped by here for lunch after reading yelp reviews, and we were glad we did. Ordered an ","useful":0,"cool":0},"n5tSmlhCOG_JQwclXt0D4Q":{"text":"First off the staff member that seated us was hilarious. We ordered the char broiled oyste","useful":0,"cool":0},"viqYsd98dTLSHa7u6w32Hg":{"text":"This location is newer than the others and I think the tourists have yet to catch on.\n\nIts","useful":2,"cool":0},"gvh-s16XFTsi4PQmQmf_3g":{"text":"I'm a couple months late writing this but I made sure to save my receipt because I wrote d","useful":0,"cool":0},"u1MLwDup8QDVmi_ecjeqWQ":{"text":"We were able to get a reservation for 7 people on a Saturday night at the last minute. The","useful":0,"cool":0},"RWYjKVtfESthjKqrtHLkWQ":{"text":"Excellent service and food. Raw oysters without sand and delicious. Artichoke dip is not w","useful":0,"cool":0},"ZAffwYnnqGCjm0gGDoe2QQ":{"text":"Great staff went out if there way to help.  Bartender came out from behind bar to suggest ","useful":0,"cool":0},"66Ogcsg_XgM18aUfeM3Pjw":{"text":"Great choice for eating out when just arriving in New Orleans ! The red beans and rice wit","useful":0,"cool":0},"h5sjNvnaYfTrOhE66oBJkw":{"text":"Everything here was cooked perfectly including the chargrilled oysters. This was one of ou","useful":0,"cool":0},"jbHznkCtcvKYpOhuHEesiA":{"text":"It was so good that we went back again one more time before heading back home. Delicious f","useful":1,"cool":1},"_-TGg0s9IKYBtN-dyN0hfg":{"text":"I am a local New Orleans person. I love most of the Mr. Ed's. I was so disappointed in thi","useful":1,"cool":0},"KSmRWUOViCq_UDR-4vXHPQ":{"text":"First time to Mr. Ed's! Pros - Must have the charbroiled oysters - they are definitely a s","useful":0,"cool":0},"xDS2avIRI5jOXyJ6Ntc8RA":{"text":"fresh shrimp, fresh fish, nice softshell crab, ok crab cake. Great service. Best restauran","useful":0,"cool":0},"H9NvLBVyZNpl2tAL04y-Pw":{"text":"smoked oysters were great. still getting used to the huge raw oysters which are just huge.","useful":0,"cool":0},"aRI89uFp_3MUF5XI9wh9vw":{"text":"This place is seriously underrated. It didn't show up on any restaurant guides but we took","useful":2,"cool":0},"6Pj7GyiIqbsLBgoQCyrYZQ":{"text":"We were on a historical tour and our guide highly recommended this restaurant, and man, I'","useful":0,"cool":0},"WLsMme2GsUFaaKInjg9cxg":{"text":"Food is amazing. Seafood is very fresh and Moscow mule is delicious. The service needs mor","useful":0,"cool":0},"tyV3UE8dKdnLdkbVsohyog":{"text":"A lot better than Royal House. Excellent location close to Canal St and French Quarter. Th","useful":0,"cool":0},"p90HdD1dEJ43XVZvAClJMw":{"text":"Was in New Orleans for a girls trip for my sister cousin's birthday. We saved the best for","useful":0,"cool":0},"wK2cvyE7vNTYY1HLyFsq7g":{"text":"This is probably my favorite place for oysters  my husband had the charbroiled oysters and","useful":0,"cool":0},"TKSkEuWQBOUI4g0udqXB4w":{"text":"What an amazing meal!!! Had a major fail the night before at Drago's Seafood Restaurant, w","useful":0,"cool":0},"8hUFyrUtZhevJSQP8Y8CPQ":{"text":"Amazing food and a wonderful server! Russell was fantastic and recommended some delicious ","useful":0,"cool":0},"cGKBybN9Ijt--qQALSRtXA":{"text":"I am not an oyster eater but my dining companion said they were delicious. My scallops wer","useful":1,"cool":1},"S9i5YPjR7zbVYulDblq3cQ":{"text":"When you want consistently amazing food and great service, no other place like Mr. Ed's. W","useful":0,"cool":0},"ncmqaEpvdAHgUn8n9maALg":{"text":"This place is a must go when visiting everything's fabulous and delicious  had a line but ","useful":0,"cool":0},"jM1tvqyV4kjRqWZ_J5oTfQ":{"text":"Our hotel recommended this restaurant, so we could try their \"famous\" chargrilled oysters.","useful":0,"cool":0},"YXZPj6MStyB9tEnvVyLf9A":{"text":"Gumbo - 4.5. Turtle soup - 3. Jambalaya- 3. Roast beef po boy 4. Atmosphere 4. Server 4. \n","useful":0,"cool":0},"QCq40KcJJnJKoouxhe3yWQ":{"text":"Mr. Ed's had the best chargrilled oysters!! \nIt was our first time trying it, and after tr","useful":2,"cool":1},"hHoM8-PMrQi7HoQM3nsczw":{"text":"The food here is amazing. It is a super busy place and service is ok, but the food is outs","useful":1,"cool":0},"NSSWsMmlB4egtY-OfgQ1Gg":{"text":"Decided to stop in because the Yelp reviews were actually decent on this place. Our server","useful":0,"cool":0},"7IALeBjwnxdUYrIzeHWJ1A":{"text":"This was the highlight of our trip to New Orleans. Absolutely incredible chargrilled oyste","useful":0,"cool":0},"34yh-uuLKFK8oxZmVD2D9Q":{"text":"Loved this place! My friends and I are from California and we know seafood. But authentic ","useful":0,"cool":0},"8IhEX9SMpfus1syM0x9mww":{"text":"I completely overdid it on Oysters and, oh, it was so worth it. The charbroiled Smokey tas","useful":0,"cool":0},"7O67iV7089OF-_HMofNFBg":{"text":"THE best char-grilled oysters!  Actually the best food all around!  We had such a great ex","useful":0,"cool":0},"Ci9NSKAUjuJzWMa6Y64fug":{"text":"We decided to try this place based on their excellent reviews. Our food was served quickly","useful":0,"cool":0},"TDx5iLYd3iqUUVI2fHY37Q":{"text":"The chargrilled Oysters are to die for, the BEST I ever had. This would definitely take me","useful":0,"cool":0},"33uZYm0Y1LCPuK7QRIFU6w":{"text":"Decided to come for dinner before going on a cruise along the Mississippi. We sat right by","useful":0,"cool":0},"L6f1QqkEGMLI_rTcIQyFvg":{"text":"First, the chargrilled oysters were fantastic.  If I stopped there, then it would be a fiv","useful":0,"cool":0},"M80RNTVNSw0_UJJqOeSqMA":{"text":"We LOVE the Garlic and Parmesan oysters from here! We first stumbled across this place dur","useful":1,"cool":0},"_Lxo7IL05xiuSinb8NcH4w":{"text":"This place was AMAZING!!!!!  The girl at the front desk of our hotel recommended this plac","useful":0,"cool":0},"-wA5yxd6LgJ8ljB_9ugdlQ":{"text":"Dropped in here after dragos was too crowded. Glad we did, good and drinks were good, it i","useful":0,"cool":0},"xafBdQWeax-OTkn1dQMtIw":{"text":"Outstanding service, good food and reasonable prices. Had really great charbroiled oysters","useful":0,"cool":0},"2flqwi2T0lbRKQ7rTEpY9g":{"text":"This place is a bit unusual not that it has an upstairs and a downstairs eating area but t","useful":2,"cool":2},"UhgLVQHKMa6YsTGQ_S50Wg":{"text":"The chargrilled ousters are so good. The gumbo was really good too. And the huge crab cake","useful":0,"cool":1},"2K6kMI1NoqDDVbcaB8Nn4A":{"text":"First trip to NOLA & definitely not the last!  Next to getting married to my amazing husba","useful":0,"cool":1},"HqmtIorSpY3vdIIrjYvmhg":{"text":"Visiting french quarter. Yelp did not disappoint! Searched best fried catfish. Followed ro","useful":1,"cool":1},"ntNPjMcbRrC7sRR2ct3jgg":{"text":"We came here before a night out on bourbon. Our drinks were potent and the food was absolu","useful":1,"cool":0},"7a1z6DG2Wf2ZYs4AKQWfFQ":{"text":"This has been a solid spot for us the last two trips. Great, friendly service, quiet(er) a","useful":0,"cool":0},"gNHh2shqg4enZkLlVbEKFQ":{"text":"Came here for my birthday dinner and it was amazing. The raw oysters were so fresh! We def","useful":0,"cool":0},"agHh5gLE13ZUWKuJHdLYjA":{"text":"The food was amazing the charbroiled oysters & the soft shell Orleans was amazing .... the","useful":0,"cool":0},"IBu1kAeAvqkLQGDUqJle8w":{"text":"Stopped in for a late quick lunch. The fried fish Po Boy and Crab cakes were delicious.","useful":0,"cool":0},"SiYumoTVTqTubd9DD29O2w":{"text":"Definitely will go back when i visit . Food and drinks was very good ! You can't go to Mr ","useful":0,"cool":0},"YDZF0MukK8Gw3_4Sx83WlQ":{"text":"Waitress was really friendly and immediately seated us and brought out our orders. We orde","useful":0,"cool":0},"cZUCnef6NeNLbY7yZxUl1g":{"text":"First restaurant in NO visit ended up being one of our favorites.  Great ambiance, charact","useful":0,"cool":0},"eKMZu1thF486YXjOOIAQiQ":{"text":"2nd visit to New Orleans and I came back to Mr Ed's for oysters. Must go to if you're crav","useful":0,"cool":0},"2iBN8yApbiakuAWvTdoPJw":{"text":"Mr. Ed's is usually our first stop when we get into town.  One of our favorite places to e","useful":0,"cool":0},"qM3JVSggcoFIy4tgk8NuTg":{"text":"We needed a place to grab a quick bite before our riverboat cruise. This place accommodate","useful":0,"cool":0},"133yHDu5SY-T7B3HdWrTCQ":{"text":"Best Charbroiled oysters in the city!! I also had the Crawfish crab cake pasta and it was ","useful":0,"cool":0},"256zArZsedQjzX0xqVfp2w":{"text":"My wife proclaimed the fried oysters topping her oyster salad as the best oysters she's ev","useful":0,"cool":0},"pP94WhDZC6N8AcxsiB2KFg":{"text":"I found this place on yelp and I'm so glad I did. It was a cute location, we walked there ","useful":0,"cool":0},"ns0cALI2-ahEDcKUP4akiw":{"text":"Forget Acme and Felix's, if I want oysters in the quarter- I'm headed to Mr.Ed's. Absolute","useful":0,"cool":0},"_aGCf7vwutaHCmSf5QBaug":{"text":"We ate here our last night in New Orleans. The atmosphere doesn't quite stand up to other ","useful":1,"cool":0},"87qW_bGsApm4drcsGa4bmg":{"text":"Amazon food! Amazon service! Mandy was so nice and friendly! Some of the best oysters we h","useful":0,"cool":0},"FVRBsNP__N-hhJP1v56HwQ":{"text":"Delicious ! The best chargrilled oysters in my opinion !!! The turtle soup is surprisingly","useful":0,"cool":0},"4oN9wXPDpfKe3AXhCmM25Q":{"text":"Cash and card accepted. Mr. Ed's is located on Bienville Street and is accessible by foot.","useful":4,"cool":1},"9TVDAJuQPqfJyF1xH_lGng":{"text":"tldr; GO! oysters, cajun, seafood- you will love it.\n\nI literally have no idea where to st","useful":1,"cool":0},"YcRkRv_LZ_GgpVXLuYYjSQ":{"text":"I stacked the Chargrilled Oysters with Garlic Butter & Parmesan from Acme to Mr. Ed's and ","useful":4,"cool":1},"wkT1LtcTwsNVrx_AGv2xtg":{"text":"This place did not disappoint! Carlton was our server and his recommendations were spot on","useful":0,"cool":0},"5y8RuMMChvnjZuc5_uMO1w":{"text":"When you are excited to write a review because you get to relive the wonderful meal and ex","useful":9,"cool":10},"gFx0Ira8Ps7HJnV_HLE9zQ":{"text":"Absolutely amazing, our server Savanna super pleasant. We are definitely come back to Mr. ","useful":0,"cool":0},"j1jYpu03AplZtybdrKN7mg":{"text":"Excellent service, delicious food and drinks. The Hurricane was yummy and the roast beef p","useful":0,"cool":0},"XG5D4uviR0H6aWL5Soc08A":{"text":"This restaurant populated in a \"family friendly restaurant\" search I did, and I was a litt","useful":0,"cool":0},"ECAa3GK3AjIk-7Rt8GtvHg":{"text":"By far the best restaurant and bar we have been to. Spectacular service and the most delic","useful":0,"cool":0},"7cE-6k3ShQFg9yax6lnqiA":{"text":"Me and my girlfriend ordered bbq and shrimp and we found a roach in our sandwich we approa","useful":0,"cool":0},"yQpFpDE2lDm0T4oB1tr5Xw":{"text":"They made us move table for a larger party right as they set our food down. We had pick ou","useful":0,"cool":0},"oaKGH2PJyo0u9GzlLUuuAg":{"text":"Came by on Sunday right after the big Rams vs Saints game ended to beat the crowd. Got sea","useful":0,"cool":0},"CxgMIT7KBC3dgl3SVJ8ViA":{"text":"For cheap oysters with cheap ingredients, they do them decently. The actual oysters themse","useful":0,"cool":0},"1bBM5MYsvBb_M87m8cF8Rg":{"text":"Great BBQ shrimp and Chargrilled mussels!  Came back twice in a 5 night stay! Very friendl","useful":0,"cool":0},"ENNtrNpC-jUzjmkGB6NZrA":{"text":"I tried this restaurant the other night at the recommendation of a husband and wife that w","useful":1,"cool":0},"n5i6k4EU1UV5Hi4p_Kx7Ag":{"text":"You must come here and eat their charbroiled oysters! This place was recommended by one of","useful":0,"cool":0},"UIQCa2bb_IDZlKzdn8P-JA":{"text":"If you are in New Orleans, this place is a must !!!!!  We got charbroiled oysters, which I","useful":0,"cool":0},"xCB_GbmptlZaeGJoSXkjeQ":{"text":"This place was not good.  We had the bbq shrimp appetizer, which was served cold.  It was ","useful":0,"cool":0},"uvpgKG46TTPoCWPKyuE3ug":{"text":"The hotel staff directed us to Mr Ed's.. (in walking distance to the Bienville Hotel)\n\nWe ","useful":12,"cool":11},"XnhYy4MzCNFeUHsxQGiydA":{"text":"This place hands down had the best charbroiled oysters I've ever had! On top of that the s","useful":0,"cool":0},"-BJL3g7sJPHsUF5CbhXDUQ":{"text":"Just meh. \n\nGot a blacked chicken salad was kind of gross and basically just leaves.\n\nGot ","useful":0,"cool":0},"ZrATXLvYAjOr6_GYhPt7_w":{"text":"Mr Ed's has got to be one of my favorite restaurants in New Orleans. I've tried several pl","useful":6,"cool":5},"UeszY9-ZSPZhZF3pyVz3gQ":{"text":"Great food, fast friendly service. Good size oysters on the half shell. The stuffed crawfi","useful":0,"cool":0},"8bcci2Erkzm0OIqprW6kYg":{"text":"We enjoyed Mr Ed's. \n\nWe arrived around 6:45 pm on a Thursday. Got seated right away, thou","useful":3,"cool":2},"7WQbnJ7BHBRyXUTJ8L4Dqg":{"text":"I cannot believe how good the oysters are at this place. These have ruined other oysters f","useful":0,"cool":1},"my3rap1nwmBT2cldGEL7Aw":{"text":"Solid three stars for this experience. Our server was very nice, the food was great, and t","useful":0,"cool":0},"kr3J_HsBClw5qlMS5-5Uwg":{"text":"**YOU MUST GO TO MR ED'S**\n\nI've been to NOLA a dozen or so times and this is the absolute","useful":3,"cool":2},"XlDcECG498svGYk0GXhO2g":{"text":"Excellent food and service. The waiter was friendly and everything he recommended was awes","useful":0,"cool":0},"Lc65gyXzpH__z2vZrm0mWQ":{"text":"Oh. My. God. Wow Mr. Ed's rocked me and my buddies' world. I'd only had Chargrilled oyster","useful":0,"cool":0},"LeD2m8yJNl0jAPZaD7sKKg":{"text":"Excellent food and customer service.  Beautiful ambience.  The Char Grilled Oysters were y","useful":0,"cool":0},"0rh-uVt2pUojioQU78Ky0w":{"text":"Can we say yum yum oyster in my tum? \n\nChargrilled oysters and what else? Nothing. You don","useful":1,"cool":1},"P0-AIc6VDMnQlH9C6LIhGw":{"text":"Amazing service and food!  We were referred by a friend and wow. From the manager to our s","useful":0,"cool":0},"PqplPojj4bXZ1oVQ2gNS0Q":{"text":"Memorial Day Weekend- My group and I discovered Mr Ed's Oyster Bar because we did not have","useful":1,"cool":1},"IS-sealZ6q5_kfbXwQ3LCQ":{"text":"Loved the food and the atmosphere. Device was a bit slow but they were slammed. Can't wait","useful":0,"cool":0},"vXewa0fFCR0fTcTZiP8odg":{"text":"Yummy ! Friendly staff - I do love New Orleans!! Everybody smiling - and being nice - the ","useful":0,"cool":1},"5DstVe9psgqkdv7yaKYZQw":{"text":"We journeyed to NOLA for the long MLK weekend. Stayed at the W, did a yelp check and found","useful":0,"cool":0},"G0L3c_6_ByuyZhoeu0WQoA":{"text":"Omg wow  \nKnocked my socks off honestly, homey but still feels like a restaurant, if you a","useful":0,"cool":0},"iL3qVrLXrTW6QsMMwUpirw":{"text":"Really good food!!\n\nThe charbroiled oysters were killer. I ate jambalaya. Not crazy about ","useful":1,"cool":1},"j9P0CFkiRasM051aIPjilA":{"text":"We stopped here after seeing acme had a massive line. I will say we are glad we did this p","useful":0,"cool":0},"QUPlR3SbA6g_tJPrx9uuRw":{"text":"We walked over 30 minutes to get here under extreme hot weather looking forward in proving","useful":0,"cool":0},"6-qFcDzxbv3unq17LibCzg":{"text":"Amazing experience! Our first evening in New Orleans and AJ gave the most incredible servi","useful":0,"cool":0},"C7YJkkQmFHnAAePIqNK8bg":{"text":"Omggggg phenomenal oysters! I'm not an oyster fan, but these were amazing. We had the char","useful":1,"cool":0},"8x-mIWLGV1ZhbUvg4b8nyg":{"text":"This place is delicious!! Does not look like much from the outside or even inside it looks","useful":0,"cool":0},"43FqakZI1lrlsj2CG_mYQQ":{"text":"Delicious! I wanted to get away from the fried seafood scene so searched for the best char","useful":0,"cool":0},"wS0n0GoCTh6fHrukKACHsA":{"text":"Visited Mr. Ed's on the way to Houston. Picked this location due to the high rating on yel","useful":0,"cool":0},"j0nRFtdVLIrknUqfS_HZ5w":{"text":"Very friendly atmosphere good beer and outstanding food. The Fried oysters is the way to g","useful":0,"cool":0},"sUisVy_SQL1iP8gu7L_Yuw":{"text":"Got carryout.  Red beans and rice.  Servors we're friendly, especially Theresa.  Which was","useful":1,"cool":0},"wqAETyjsdxbttjC1ARn7gg":{"text":"I have to admit I was a very skeptical oyster eater before coming to New Orleans.  Mr. Ed ","useful":3,"cool":2},"UerycngELxKJg1WQGOhZlw":{"text":"Wow! What a great place for Garlic Parmesan Oysters! I came to New Orleans looking for new","useful":0,"cool":0},"Cyr56mkIK5hFkXC8Il_JZg":{"text":"The oysters here are amazing . We ordered a dozen of all three raw charbroiled and jalapeñ","useful":0,"cool":0},"0NnGV2bZ3UYryRGwCRYS0g":{"text":"Ed's was one of the best places we visited on our trip. Super friendly staff, gave us some","useful":0,"cool":0},"nWqMAu6uV5MLAPR0hI5j-A":{"text":"I need to give Tabitha the highest rating possible at Mr. Ed's. I can't truly describe how","useful":0,"cool":0},"y9WbrIccjGLFl4ryBcA1mQ":{"text":"This is my go to oyster house whenever I visit NOLA. The bar service is solid, and the oys","useful":0,"cool":0},"U3pAAEKlTXCm5HOj97WjXQ":{"text":"In all fairness I didn't have oysters. Had crawfish salad.\nBland. Jambalaya was ok. \nNice ","useful":0,"cool":0},"MWIE9m-ZHvqjB6lIvSfj_g":{"text":"Found the pace while walking by and decided to give it a shot. Glad we found it. Food, dri","useful":0,"cool":0},"N9h44DKEN31QMh8L0n1dxg":{"text":"Was honestly disappointed after reading great reviews on this app.  Charbroiled oysters we","useful":0,"cool":0},"1o0RknNQhdWkXsVQU87EEA":{"text":"Best meal we had all weekend. Amazing!!!!! Highly recommend...you must eat here!! I will b","useful":0,"cool":0},"lXc3n2lTZPrJrRqAT3xtCA":{"text":"Mr Ed's Oyster Bar is a must eat place when you go to New Orleans.  My wife and I stop by ","useful":0,"cool":0},"Ls2oTSZjAJs2QKo2OF3bPA":{"text":"I wanted to try this place as my cheat meal one afternoon. I did a to go order of a combin","useful":0,"cool":0},"J7jPRgZ3ZOvYJOi3u86FTg":{"text":"We came with a huge party early afternoon New Year's Eve. Maryann and Dale were wonderful.","useful":0,"cool":0},"37Pi1gacyWzgW_j0rQAY1A":{"text":"Delicious food here all around. Definitely make it a point to try the chargrilled oysters!","useful":0,"cool":0},"aA4V9N1z14nbAfzZOUBm7Q":{"text":"This is the BEST place for charbroiled oysters. The other dishes do not disappoint either.","useful":0,"cool":0},"b9g3aLi7SQldOhHVAVMvcQ":{"text":"Just dropped in get a little food and a drink. Sat at the bar had the grilled oysters and ","useful":0,"cool":0},"1aOaKs6GhLugUxuhn826zw":{"text":"Bartender was fun and lively.  We had a great time.  Felt very welcomed, even from across ","useful":1,"cool":1},"DuXTD3oiO4VPTkWTJWiS9w":{"text":"Restaurant with a retro vibe. Very friendly and attentive service. Our waiter called us \"m","useful":1,"cool":0},"h9M-zL1Y9KVX2l--7cSdcA":{"text":"Everything tasted amazingly good. Definitely the best New Orlean seafood here. We were hes","useful":2,"cool":0},"iFty96_jDkndm6nSWN1j5g":{"text":"Wow!  Stopped in for a short break and had a wonderful snack....a dozen oysters. Noisy and","useful":0,"cool":0},"ZbWWq0ZTCsm9eTeREJti_A":{"text":"Alan the bartender was incredibly awesome!! Great knowledge of the menu and personality ju","useful":0,"cool":0},"6CvKZ-MgrPTKFokHSLwHCw":{"text":"I must say that my group of friends were very excited about eating here for dinner since t","useful":0,"cool":0},"2AM7bPxv5Ft2YPnKTc6aTQ":{"text":"Came here for lunch with a colleague.  Was not impressed.  Like so much of the food in the","useful":0,"cool":0},"ezacyRXW1CoMUlsr0MJ07g":{"text":"The carpet upstairs smelled (at least i think it was the carpet) and my water glass sat em","useful":0,"cool":0},"Q78Ntuu-t_W1U8XSBBznhw":{"text":"It didn't have the charm some of the smaller restaurants have, but the service was good, v","useful":0,"cool":0},"iKzCf7LVho7U5BAPsDvOAQ":{"text":"The Shrimp Po boy was exceptional and I would definitely go back for that. The other dishe","useful":0,"cool":0},"Wb_39Uz5hDEVJ4fbf0UOZw":{"text":"Little hole in the wall place to eat with great food. Hardly any signage, so can be tough ","useful":0,"cool":0},"aAgcY5EEwXegOja1mZc0Ew":{"text":"Excellent service! They seated us right away upon arrival. The host was very excited to sh","useful":1,"cool":0},"3F0mOUj-Ab0U0C_CkPlReA":{"text":"Amazing food, the jumbo shrimp we jumbo. We got the 1/2 & 1/2 with fish and shrimp and als","useful":0,"cool":0},"8J4ifBOopWqSYuu2WSCHdg":{"text":"Wife and I got the charbroiled oysters and iceberg wedge with bleu cheese and bacon. So go","useful":0,"cool":0},"P0vG5_0ZzPQ5vDWrhkxwIw":{"text":"This place was amazing! A friend and I shared a fish and shrimp platter and it was delight","useful":0,"cool":0},"IFG1uw57MIn-oBeicl1V2w":{"text":"OMG. Great food most generous size portions. The gumbo tastes  so good I just wanted to ke","useful":0,"cool":0},"fLkD4eIWThIrCGdRVikm0w":{"text":"OMGOSH I was in heaven when the charbroiled oyster reached my mouth. The oyster just melte","useful":1,"cool":0},"Azo4X2rFGxxs8pB4zK7kcQ":{"text":"Another solid choice , why didn't I find these great restaurants on previous trips? It's a","useful":0,"cool":0},"TD6BO56a0DjBFarHdcSx8Q":{"text":"This is my Im eating her everyday while in New Orleans...lol the garlic bread with charbro","useful":0,"cool":0},"KfY6-WOv53P_TY2XdPu_fA":{"text":"This place was at a short little walk for our Airbnb The Quisby. They were able to set us ","useful":0,"cool":0},"eKrdCRUUWdNteRwzp0nX3w":{"text":"We came just for the charbroiled oysters!  Best that I have had in my life of 62 years!  O","useful":0,"cool":0},"3t0Lb6GmQVLB8p2AjlUQ-w":{"text":"Get some grilled oysters now! Like right now,  and yessssss you need a dozen maybe two!!!","useful":0,"cool":0},"zJfOZqrpAWE694OLO7b_1Q":{"text":"Only 4 stars because my meal was not that great (shrimp creole). Pretty much was 6 small s","useful":0,"cool":0},"Tfyqf61tsuqzqThS9WFW2g":{"text":"Never got to eat the food, tried to get a table and was told 30 minutes, saw an open seat ","useful":0,"cool":0},"q9DD2nDzO62EFBZ5Arfdrw":{"text":"The hospitality was excellent! This was my intro to Cajun type food so I was hesitant to g","useful":0,"cool":0},"sMvTrKWxXknuijXz16Hj9A":{"text":"BBQ shrimp was definitely my favorite! Aaron, our server, was great. He even got me a samp","useful":0,"cool":0},"dMsfHZA_AGVJXk2Ftx7LcQ":{"text":"Char grilled oysters that you can actually taste the char.    Very good. Everything has la","useful":0,"cool":0},"angpC2EUPZYMGa-pLD-yuQ":{"text":"My food was good, my husband's was good but cold but the floors were nasty and there was d","useful":0,"cool":0},"h0-j6MYTKOoWHVpFS2TANg":{"text":"We just happened upon this place, while looking to have lunch. We were outside looking at ","useful":0,"cool":0},"g3hZPUX-jtsfujngSetTJQ":{"text":"A great dinner tasting some of New Orleans most iconic dishes. The waitress was very helpf","useful":0,"cool":0},"X2QmhtT4kls42FKuwbppdQ":{"text":"Wow! Everything was delicious! Beginning with the Chargrilled Oysters, perfection! I order","useful":0,"cool":0},"5p4QPHdJ_kInK7QSpHXzKA":{"text":"Second visit on this quick trip to New Orleans. I couldn't resist coming back for the char","useful":0,"cool":0},"XFNjzLNiaS4x3wcUaO4QWw":{"text":"Oysters in New Orleans are on another level!\n\nIf I had to pick one place to eat oyster, I ","useful":6,"cool":5},"7dUxlbNIvGTApfdCRfHf2Q":{"text":"It was our 2nd time getting chargrilled oyster so we didn't have anything to compare with ","useful":1,"cool":0},"X2_hGvky3EQDfJmiYdo1iA":{"text":"When you visit a city, be careful asking another tourist about places to eat, etc. Mr. Ed'","useful":0,"cool":1},"WhJZZIbPV7EAjrbVdPS_9A":{"text":"Perfect hole in the wall spot! We lost our spot on the waitlist because off traffic but th","useful":0,"cool":1},"JBXbB8aBbxG7XwnMysZzUQ":{"text":"This oyster is easily one of the best restaurants I have ever been to in my life. Not a si","useful":1,"cool":0},"lg7kZB3hcAkNQKysNOpv5w":{"text":"Came for dinner with the family. Overall, tasty and filling at a good value.\n\nBlackened re","useful":0,"cool":1},"FLqM-GZSxfZkM4582OPPTw":{"text":"If you come to New Orleans and don't eat here...we'll it's your loss! We come all the way ","useful":0,"cool":0},"eENHbFvrm7uYYfNYNedMHA":{"text":"You honestly can't get much better than this. I really enjoyed my visit to Mr. Ed's and fo","useful":9,"cool":7},"zQ0xhEq9dmm2MD7FURtC7A":{"text":"This is one of my favorite places to get oysters in the French Quarter! Great atmosphere g","useful":0,"cool":0},"ImkG0LTTIOgFOV_zKWVlgQ":{"text":"A Truly New Orleans  experience.... the oysters are fresh the service is friendly and the ","useful":0,"cool":0},"ffX9GI4bC-ek4cBgMQBgMw":{"text":"Made this our last stop today leaving the French Quarter. Glad we stopped in! Food was gre","useful":0,"cool":0},"rYM7f2bPn_ALC6y4EZUifg":{"text":"Always consistent with their food, great service as my waitress was new about a month and ","useful":0,"cool":0},"CGTxHYrh6lsXplrdi_CqZA":{"text":"The Shrimp Po boy was exceptional and I would definitely go back for that. The other dishe","useful":0,"cool":0},"lRYfvSdjW_XQLAUqqh9OOw":{"text":"It was ok.  We sat upstairs which was more spacious but definitely lacked personality (ver","useful":1,"cool":0},"MAUKBetlb7UmyZjHaamr4Q":{"text":"1st Restaurant we went to when we arrived and it was an amazing experience. Low key restau","useful":0,"cool":0},"cQrEeuKTf3QHRj3Fv5lpZg":{"text":"Great food! Great prices!  My friends and I had lunch here today!  The Nachos were amazing","useful":2,"cool":0},"6aN27r-Aa2qBIS4U6evCcw":{"text":"Staff were very pleasant and attentive. Charbroiled oysters were to die for! \n\n(I am only ","useful":1,"cool":0},"Q2pdwpbA-3dP5TtB4WZllg":{"text":"Came here in a recommendation from one of the locals we ran into at our hotel. We stopped ","useful":0,"cool":0},"L5caE4jowGjedaa9XNDv7w":{"text":"This place was awesome! Good crawfish. Fast service and they also played a good selection ","useful":0,"cool":0},"84OKlgkgwRBpqQ9RG5SB9g":{"text":"If you only have time to read one review, read this one.  Without question, this is the WO","useful":0,"cool":0},"8pMNtnCTnDuybFXeGKzf4g":{"text":"I can't leave New Orleans without eating chargrilled oysters. I was going to order a half ","useful":4,"cool":2},"pF_Hc8an0uFLmU_2ThKOTA":{"text":"John P gave excellent service and hospitality. Must try the Bienville and the Rockefeller ","useful":0,"cool":0},"OP5wyf1hcZev_ovckA6sqQ":{"text":"Mr.Ed's is a great choice when you're in the quarter! I highly recommend the Charbroiled O","useful":0,"cool":0},"bHXiimY4j-uKazPio1-7jg":{"text":"Great staff and great food!! Crawfish crab cakes were delicious and super filling. We had ","useful":0,"cool":0},"glNIc8L6re_7DL9MSzVFig":{"text":"We come here every time we are in New Orleans and this time Alan was behind the bar and di","useful":0,"cool":0},"VOl2gv3Zc57d_hLT535c9g":{"text":"Never disappoints! Whenever I visit the French Quarter, I must stop here for some southwes","useful":1,"cool":1},"Is5adkGn-_prxjHYK1jN6Q":{"text":"Food was just mediocre. Would not recommend ordering the turtle soup. Was really looking f","useful":0,"cool":0},"Iq1SSpye9r2M42Fh-X-Z_A":{"text":"Friday night in the French Quarter and I was with a pack of 6 friends who were starving an","useful":5,"cool":3},"xPD6qxSf13sI_SgGP8WV3Q":{"text":"Oooh baby!\n\nDavid and I stopped in here before a burlesque show at House of Blues, thanks ","useful":11,"cool":7},"8f4bNsdBkBV8kdeEmxpn1g":{"text":"Great lunch spot. We had oysters both raw and charbroiled and they we great. We also had s","useful":0,"cool":0},"dsQilRGaUGGM9Ku3-3AiUw":{"text":"Our Lyft driver told us about Ed's  it was delicious \nWe started with the cheese bread whi","useful":2,"cool":0},"9EnDnnZDH_7-0BNFCP38IQ":{"text":"The wait was about 30 min due to short staff, but we were happy to wait because we underst","useful":0,"cool":0},"pc8jDpHhgAeoQ62ImUiP8A":{"text":"The staff was so friendly and the food was a solid 10/10. I'm from Detroit and needed to t","useful":0,"cool":0},"88RcVlVLSPvfmb07QW94Jg":{"text":"We went there last night, but The service was bad, some of the servers didn't have any mas","useful":0,"cool":0},"6PjOrXPVUNoqdcqaY8nESA":{"text":"I had the blackened redfish with jambalaya and vegetables. Wow. Great food. Fish was perfe","useful":0,"cool":0},"KFW9sr3OeKCc-ZxwHecQDw":{"text":"This place was amazing! The fried alligator and charbroiled oysters were amazing! The brea","useful":1,"cool":0},"0IctUQ2Lrr5-3dZiXgfWYw":{"text":"Oysters are amazing also the Cajun gumbo.  Our waitress Theresa was friendly and did not s","useful":0,"cool":0},"MtDtTCt9Az7mhPui86-siw":{"text":"Excellent food. Order the fried green tomatoes and grilled oysters with extra cheese.","useful":0,"cool":0},"rfwhn-Ayvf1E3GM3XujH4A":{"text":"A must stop when you are in the Bourbon St area - great service and the food is high quali","useful":0,"cool":0},"RcPnhR7jWvksQ-uri6RXyw":{"text":"I'm not going to go into a long explanation. The food is delicious, the raw oysters on the","useful":0,"cool":0},"d6j3UNEoRvvV9WUWxMC14g":{"text":"The host was amazing at seating us right away, and helping us with the must try items on t","useful":0,"cool":0},"FChjHtanTFUw_4e9CDtQ3w":{"text":"From the outside the place doesn't look so great but the food is actually fantastic. This ","useful":0,"cool":0},"P9buhy347DVhc9A1F06xOw":{"text":"So good and so friendly.  We got seated right away on a Thursday for dinner.  Our server L","useful":0,"cool":0},"wnhWU9WAJ6JZrwHP5j3nlQ":{"text":"The service was impeccable and the food was epic! Chef Juggey and our server Gina made our","useful":0,"cool":0},"rwyIz_9vGTMgjt-Z29BJoQ":{"text":"I sincerely enjoyed the food, the service, the ambience and everything in between.   Good ","useful":1,"cool":1},"pCAeuj7uIUF68pJR7YMuXg":{"text":"To all you people waiting in line at other oyster bars nearby... mistake... big mistake. G","useful":0,"cool":0},"iQ7_FthmOo8WGqBxGM5EZA":{"text":"The best Turtle Soup I've had in years. Thick, rich roux, plenty of meat, nice pieces of e","useful":0,"cool":0},"cC4EdmfS7sOhjn_GjleIDw":{"text":"Great ambiance and fantastic food!  The étouffée was to die for!  Be sure to add the redfi","useful":0,"cool":0},"nQMubCp53ap21LMuVHLBww":{"text":"Amazing! It was our first restaurant coming into New Orleans and it didn't disappoint. It ","useful":1,"cool":0},"DcD4QZaQKQWrqkAg1tWAxg":{"text":"Food variety offered us many things we wanted to try in New Orleans. The baked oysters  we","useful":1,"cool":1},"ZMhadFDUCoJYq6L2k-s_Yg":{"text":"Five stars for an overall wonderful experience. I showed up in the French Quarter around 3","useful":1,"cool":1},"CTbuV7zyNtFMj4o9B78Teg":{"text":"**REVIEW FOR 12/17/16**\n\nMy girls and I visited this spot for oysters. I was craving fried","useful":0,"cool":0},"sZ5UVQtpMRvYqbB_fvbeLQ":{"text":"While enjoying a quieter French Quarter experience we decided since there were no lines we","useful":0,"cool":0},"QvncSJ2EWO2nZYMNN9xBZA":{"text":"Before coming to New Orleans and Mr. Ed's, I never liked oysters. Granted, I've only had r","useful":0,"cool":0},"dYmnDaDRl-sjdbfmob38Tg":{"text":"While looking for a place to have a drink and some oysters in the Big Easy, my husband led","useful":1,"cool":0},"XK-mYJ3pCOK1_Pd1MtwA7w":{"text":"Had dinner here after just getting into town for work. Decided to based on reviews here, b","useful":2,"cool":0},"zTS2uinSgjThhB7KR3dz-A":{"text":"Latoya was an excellent waitress and the food awesome.  Had the catfish and shrimp combo a","useful":0,"cool":0},"8om70pxoMvU-jxPlsqO_tg":{"text":"It was so good we went back the next day.\nThe char grilled oysters are the we had.\nService","useful":0,"cool":0},"893cIpVt0gROYcIW_N2VWg":{"text":"Great little spot in the heart of NewOrleans. The raw oysters were super fresh and tasty. ","useful":1,"cool":1},"wSDKihuxdxamkbQxWP18-g":{"text":"This was alright at best. The shrimp poboy had no seasoning on it and was completely flavo","useful":0,"cool":0},"GY7BwNBl46vFz1T3XdUm9Q":{"text":"The service here is TERRIBLE!.  I came alone one evening and they treated me as if I was i","useful":0,"cool":0},"CZHr5wFLbb-FaQJCkSGs3Q":{"text":"I ordered the cheeseburger poboy. It was delivered a few minutes after the rest of the foo","useful":0,"cool":0},"tDMy9d4k-Ao954WvthW1tQ":{"text":"OMG! Everything was good! Ask for Patrick from Brooklyn! He was great! Staff was very acco","useful":0,"cool":0},"uT-1spwUppToYMkghS2u4Q":{"text":"Our party was 15 people on a busy Sunday evening following a Saints game. They don't take ","useful":1,"cool":0},"jGL_y3jEoJ5sv18nnN4Rzw":{"text":"Wow! Delicious chargrilled oysters combination Po-Boy and red beans and rice, definitely t","useful":1,"cool":0},"z6dRILMkkaR0YEOoFlhliA":{"text":"Great Cajun food. Terrell was a fabulous server and made great recommendations.  The Crawf","useful":0,"cool":0},"jx-BCzLL0SUdpFIrtNUq8g":{"text":"Have to been to New Orleans a bunch of times and wanted to try some different restaurant o","useful":2,"cool":1},"B1dOIcNWz92G_blLdqWU6Q":{"text":"Beyond Fantastic!!!!!\nThis is our favorite local NOLA restaurant. The food is amazing but ","useful":0,"cool":0},"X-OD4ptzu-5RIcmyk5Phdw":{"text":"Calamari was only warm. Marinara sauce that came with it was great. Onion rings were hot, ","useful":0,"cool":0},"BU2-2vLGz7SqtcimO6Ox4w":{"text":"First visit & will definitely return. Great food, good service, large portions & decent pr","useful":0,"cool":0},"agVVIY_L-6an0WUP8XB1bA":{"text":"Stopped on a rainy day and was able to sit outside.  The etouffee starter/side was exquisi","useful":0,"cool":0},"kejNtp7aP-71IINyen05Pg":{"text":"Just a tad bit off the beaten path sits a small but very nice place called Mr. Ed's greats","useful":1,"cool":1},"jG6-SNZR0xCdKuAolNKFuA":{"text":"We went to Mr Ed's yesterday and it was amazing. We have two large dogs and the staff was ","useful":0,"cool":1},"TRdVPPXygwlnSMsJzDRc4g":{"text":"If you are lucky enough to stumble upon Mr Ed's, get on your knees and thank your deity of","useful":2,"cool":0},"rwfnoPaYHXVPYT43s4XZMA":{"text":"The staff at Mr. Ed's was fantastic to work with! We had our son's rehearsal supper there ","useful":0,"cool":0},"-JUuys9AOygHx03_eX9oXA":{"text":"Great spot for some casual eats in the quarter. The garlic parmesan charbroiled oysters ar","useful":0,"cool":0},"Vn8ayM7FnEpMrEZf6PtSAA":{"text":"There were six of us looking for lunch and this place was recommended by the hotel. We wer","useful":0,"cool":0},"kcTnQeE-lZgOGUGvAUwYpw":{"text":"I don't eat oysters, so I can't speak for those; but what I had was yummy! The seafood pla","useful":0,"cool":0},"qlhzDWqbKnPlqfXv1_MfGQ":{"text":"Mr. Ed's Oyster Bar is always busy because the food is so good. We had the seafood platter","useful":31,"cool":27},"2gwVzfz8VVOA2N3qyqWEpA":{"text":"Oyster are amazing long wait is worth it along with their bread. Employees are amazing as ","useful":0,"cool":0},"Sa3qHJgt_uSAQLUQAdRTsg":{"text":"This was the highlight of our trip. The food is absolutely amazing and the staff as friend","useful":0,"cool":0},"bsLV2rFzCWxWAphWVdy8Ug":{"text":"Can't say enough amazing things... the food TO DIE for the service TOP notch management ba","useful":0,"cool":0},"8xdKSYePkfgt9CH8yKXDZg":{"text":"Best oysters this week..clean,NOT salty, & tasty. My choice was  half &half and I wasnt di","useful":3,"cool":0},"OUEtAvRwgQlpo948fjIVIQ":{"text":"The best grilled oysters I've ever had, and I mean the best. I've had grilled oysters at a","useful":2,"cool":1},"XoJRapYyh7NDDmXr6DQ7bQ":{"text":"Always amazing!\nLate afternoon lunch of oysters and local fare.  Spectacular food and serv","useful":1,"cool":0},"zFpBARE-azslyeD6o2EA5w":{"text":"Gave this place a 4 because I had 2 different experiences each time. The first time was gr","useful":0,"cool":0},"m3v8O5RoiY7DbYLh8KXjKQ":{"text":"Chargrilled oysters were delicious. Couldn't stop eating them. Bad place for a diet.  Serv","useful":0,"cool":0},"0hYELKwZbIzUm6YAdnnA0w":{"text":"Quality of the food was good, but service was lacking. \n\nWe luckily didn't have to wait to","useful":6,"cool":3},"TvcfqjpgrbG3CDIEOpUQVA":{"text":"The drinks are good and strong however the oysters were not they great. The Rockefeller wa","useful":0,"cool":0},"lZFzeyAMA35EH6Yy0IeGig":{"text":"Super good charbroiled oysters and fried shrimp. Fast service and very attentive staff. Pr","useful":0,"cool":0},"TG90Ou0z7r3Ao6xGa-s4gw":{"text":"Service was good and we had a large party of about 12 of us for a bachelor party. We got s","useful":0,"cool":1},"eBtGhTkDRxC7bkw2ok_PKA":{"text":"Definitely the best crawfish étouffée I've had! The charbroiled oysters were good but the ","useful":0,"cool":0},"xB1PpdSwSxaczCy3OWqCkQ":{"text":"We have been in New Orleans for almost a week now and this is by far our favorite meal! We","useful":1,"cool":1},"krMsmGBTRSYl4-qs-NU5Bw":{"text":"Ursula was so sweet and amazing! She helped us with our selections! Every time we are in t","useful":0,"cool":1},"ewmULmSvOihMw5vBZVfZUg":{"text":"I absolutely love the Southwest oysters here. They are chargrilled to perfection! The staf","useful":0,"cool":1},"X_nJwjTcNhF6lAyCZmcPEg":{"text":"Loved this place! We were wandering around aimlessly, looking for a place for dinner on Sa","useful":2,"cool":1},"2kN2MQ6-3ZN-Z2vxHVOctg":{"text":"This is a usual for us when we come to New Orleans. Service is always great, drinks are ta","useful":0,"cool":0},"PoqvhzG3l28OsaEj7WGsrQ":{"text":"Seafood were fresh. Overall, food were good. But the service was slow even for little requ","useful":0,"cool":0},"7BP-t_DO_zXXG4K4zrrwKg":{"text":"The food and service was simply amazing!  I especially enjoyed the Southern Fried Fish Bo-","useful":0,"cool":0},"oP_LhCEpPQtR-MwuRbcDpQ":{"text":"The Shrimp Po boy was exceptional and I would definitely go back for that. The other dishe","useful":0,"cool":0},"bY0UNjRvbW6EGAQNG7sXpA":{"text":"NOLA is one of the best cities for oysters, and Mr.Ed is definitely one of the best places","useful":2,"cool":1},"i64Aexo3ODuNchmHIvK6pw":{"text":"Our first night in New Orleans, we ate here and had a very nice meal. In fact, the appetiz","useful":1,"cool":1},"314LovkAqipryyA0dLrpaQ":{"text":"Great service amazing food in a low key and laid-back setting. We were there while they we","useful":0,"cool":0},"3ksrZGjIf-siimoOpjh4mw":{"text":"Came here on NY for dinner before heading to Allstate Sugarbowl.  We walked from hotel. Dr","useful":1,"cool":1},"GLmcPNSxBV__1xWAtD22Eg":{"text":"Seached several places near LaPension and Mr Ed's had the best reviews, particularly for t","useful":0,"cool":1},"CqB70ORpb2ty1WKZp1-xHw":{"text":"Ate here twice over Thanksgiving week.  Recommended by local bartender. The oysters are to","useful":0,"cool":0},"i-Tp9GRfowJN0Qj9z2ZwLw":{"text":"Unfortunately Mr. Ed's was just ok to us. We ordered the gumbo, seafood nachos, a \"Louisia","useful":0,"cool":0},"FSipDt8eQ0LcRS4UUZ99sw":{"text":"This was close to our hotel and didn't have a ridiculous wait line so we gave it a go,  Th","useful":0,"cool":0},"wQeBoVfiMDvidU5X2BiDaQ":{"text":"This was the first meal in New Orleans that I was not that impressed by. We had their char","useful":0,"cool":0},"0qZLZVa7jrpBdE1paR9ukQ":{"text":"Wish we would have known about this place but glad we found it on our last stop before hea","useful":0,"cool":0},"2OVpsj4ZtQLLnkR_rhcp9Q":{"text":"Awesome food. Great service and experience. The seafood nachos are well worth trying. Pobo","useful":0,"cool":0},"bTWmtUhKROHgnREuKosDOg":{"text":"Wow what a nice place to eat. I came here on a Sunday and boy it was lively with the game ","useful":1,"cool":2},"J_hM5bifD-gmR20C6tROwQ":{"text":"So very happy we found Mr Ed's Oyster Bar! Oysters, Jambalaya, Fried Alligator, and a Chee","useful":0,"cool":0},"U_zuhAmz99OtXTILul7htw":{"text":"Oysters on the half shell were delicious. Convenient location in the Quarter, sat at the b","useful":0,"cool":0},"lDiUoUMX66HPX1U_kvewEQ":{"text":"The best find my whole trip back home!!! Drinks were great, food was good, and dont get me","useful":0,"cool":0},"f_y0ROHQyAhY4TpZaGSjYw":{"text":"Visited Mr. Ed's on the way to Houston. Picked this location due to the high rating on yel","useful":1,"cool":1},"lfkhkG7-bCAdkUNvrxVXwg":{"text":"With the 4.5 stars and pretty good looking pictures they had here on Yelp... My boyfriend ","useful":0,"cool":0},"KhX79aGcfkBfluTvBBmvsQ":{"text":"Such delicious huge oysters! We picked half bienville and half Rockefeller, they were perf","useful":0,"cool":0},"ij4vG8SHTWlA5AJMemUrfw":{"text":"Delicious. We walked right up and was greeted. And quickly seated. We ordered the calamari","useful":0,"cool":0},"AajCT8sAdYghbB4MW0aKKw":{"text":"TLDR: Just get Mambo's. \n\nThis place had okay oysters. We also had jambalaya, shrimp creol","useful":0,"cool":1},"ctZvhgDmSXQuu69p1Ocg6w":{"text":"My first time in New Orleans and my first taste of New Orleans Cuisine. AMAZING!  Had the ","useful":0,"cool":1},"_ULN2ydxtmNcM38lgjxZUg":{"text":"Honestly, just skip everything else on their menu and get their crawfish bread. It was my ","useful":0,"cool":0},"PxH69JMzb1tUcTh9u9lhRw":{"text":"After spending four days in NOLA we finally found this great un-assuming place for the bes","useful":0,"cool":0},"mUxugBnRdjTvvda1IZHkyw":{"text":"Great tasting food the charbroiled oyster were amazing very good size and the hurricane co","useful":1,"cool":0},"84dcp9c96P_KNibYlryFug":{"text":"Great oysters today both raw and chargrilled, and price is considerably better other joint","useful":0,"cool":1},"PKax-y1m73tOgyn-a6dvuA":{"text":"I placed an order over the phone and was told my order would be ready in 10 minutes I saw ","useful":0,"cool":0},"ChG7PtUNiFBqgzjssI4YhA":{"text":"Absolutely love this place!! It's a clean friendly environment. The food is always cooked ","useful":0,"cool":0},"fsDJhsjoZKuYDMqDSH8Gaw":{"text":"Wow! Crawfish bread is unbelievable! We had to wait to be seated almost 45 mins but it was","useful":2,"cool":1},"p_yIkb36Qtszl_PFFqTEGQ":{"text":"This was our first meal stop in NOLA and it set the bar HIGH!  Service was friendly, warm,","useful":2,"cool":1},"VbjbD9ZPQnX8jpuPBTidEg":{"text":"Only in NO for 2 days, eating way too much in such a short time and all has been delicious","useful":0,"cool":0},"0Bk8Lov9zrGHjR3JYajmSw":{"text":"First time here & just wanted to have a variety of oysters. Ordered raw, Bienville oysters","useful":0,"cool":0},"YjWrdSO8YoEeCioGigyKnQ":{"text":"The food was tasty but nothing you can't find elsewhere. We had the crawfish etoufee, seaf","useful":0,"cool":0},"1SygqHGa_7-q5-Rr_s5_1w":{"text":"First timer! A must visit spot for delicious soul food, southern hospitality, and a nice b","useful":1,"cool":1},"lHbQ2JwuLSgYuIAN_x3zpw":{"text":"Always love eating my way through New Orleans and have never had a bad meal here...until t","useful":0,"cool":0},"DUaOBdWznOA5XzdA5-BiTQ":{"text":"Had dinner here with a big group of girls for a Bachelorette party and the staff and servi","useful":1,"cool":1},"ml7Ri3G1Hjhn6jCfvTuZEA":{"text":"The best meal I've had in a very long time. The charbroiled oysters were the best! The ser","useful":0,"cool":0},"vcw7kfbdxXJAoikJMTX2xg":{"text":"Bienville oysters - was not disappointed.\n\nChargrilled oystetrs and grilled French bread c","useful":3,"cool":0},"tBTdUo92ys_xqDEtkbBEpQ":{"text":"I was so hot and dropped in to have a drink. The people were so nice. They didn't annoy me","useful":10,"cool":8},"tKZ4XHsphSzP5h4K7Gw9fw":{"text":"I have been here a couple of times when I come to New Orleans and Mr.Ed's has to have one ","useful":0,"cool":0},"JpbLLMx5mfALszx51uPQIQ":{"text":"Quoted 10 minutes for wait and then we were skipped over and waited almost 30 minutes. Whe","useful":1,"cool":0},"I5ANrpuebTC2g8ZQ_do12A":{"text":"Place was great, the charbroiled oysters were a dish of buttery amazingness. Super tasty. ","useful":0,"cool":0},"WakhhCINP6LFOzH7NrzCYw":{"text":"Terrible service.  Got our drinks the same time as our apps.  oysters ok.  Chargrilled was","useful":0,"cool":0},"JC-hpIrKIsMn_WmXdqOxnQ":{"text":"Went here on a friends recommendation. I order cheese grits and shrimp , husband ordered c","useful":1,"cool":0},"6KW7PgqpiI7M38ritN0WXA":{"text":"I'm so disappointed and I never leave bad reviews but so worth it. We were recommended thi","useful":0,"cool":0},"13-cs_A9BsBHOiNsVzo3RQ":{"text":"Good was good, the oysters were ok I had better. The shrimp and catfish was really good. S","useful":0,"cool":0},"oafYuboJVXCWIUimvUbvWw":{"text":"This place is amazing! While being here pleasure and eating all the oysters I can all over","useful":0,"cool":0},"_Ar6rFPfZk4xnniPU8icYA":{"text":"Mr. Ed's was a yelp hit.  We were pooped from a day of site seeing (and drinking) and want","useful":1,"cool":1},"Zo1rUWjy3MHYAOi-aQ-PLQ":{"text":"Great food. Chargrilled oysters and bbq shrimp.  Bread is fantastic. Our server Ursula was","useful":0,"cool":0},"EWfC0aWP6V7SrXMymFKXxw":{"text":"We order seafood gumbo & Redfish Orleans.  The food was good. I want to try it southern fo","useful":0,"cool":0},"E0DC1OXetYfvlzuWC2mUsA":{"text":"This was my first time here. Sat down fairly quickly. For starters, I Ordered the hurrican","useful":0,"cool":0},"vvhqXEbcsiHH9hOSDNGfUQ":{"text":"You just know you're in for amazing Cajun food as soon as you walk in! The alligator bites","useful":1,"cool":0},"xjr_NkYTVT_gBL0amq58ew":{"text":"This is a two storied little hole in the wall seafood joint in the French Quarter. It gets","useful":1,"cool":0},"B90swM662JKc3gmKnWmjLw":{"text":"Delicious traditional food. Prompt service.  We had Blackened red fish Creole and Tasting ","useful":0,"cool":0},"gJKDgfemPp4_1MpXDN_NZw":{"text":"Hands down the best chargrilled oysters Ive had in NOLA. Enormous and wonderful taste. \n\n\n","useful":0,"cool":0},"Po6s0S7kifYVkTiEhTJ_Lw":{"text":"Yowza! I'll be damned if this wasn't our best meal in NOLA in our 4 days here. The vibe is","useful":0,"cool":0},"H4-QxrYcPd1cA1tmSSG_2Q":{"text":"The wait time can be long, but for good reason. The bbq shrimp po'boy was amazing, the bre","useful":0,"cool":0},"6YIsXV1lFmVtoprNeTAe4Q":{"text":"We had the 1/2&1/2 oysters, creole combo, and creole redfish. Everything was cooked perfec","useful":0,"cool":0},"NoBoVvbOVka-hzTWbwG4cQ":{"text":"The crawfish here was the best I had in all New Orleans grilled oysters became my brother'","useful":2,"cool":1},"eWXSiqZlYqcXc2CWcBdTzw":{"text":"Great deal on the oysters.  Great charbroiled and raw.  My new spot to eat raw oysters. Ac","useful":0,"cool":0},"NPLi2RbKHrFHkpTi0rTlaQ":{"text":"DELICIOUS!  We decided to try Mr. Ed's because of so many favorable ratings & reviews on Y","useful":3,"cool":1},"fs8jqxNOip4biInBAMBCNA":{"text":"The Chargrilled oysters are amazing. Service was a bit slow, but overall ok. Fried shrimp ","useful":0,"cool":0},"F5G78p9BSxkmPTx5FfdrDA":{"text":"Came here for a Saturday lunch and was not disappointed! We came in around 11 and got seat","useful":2,"cool":2},"SQ_L3KIX-B59liYVuPf1vA":{"text":"Friendly waitress and good food! Tried fried alligator for the first time, had the seafood","useful":1,"cool":0},"TBTHZ2M9YFAHDBjZ8B4Aow":{"text":"I brought my dad here his first night in NOLA. Had to dock a star for the wait time. We sa","useful":0,"cool":0},"EabjsBW-WmVBJqi3DhGh6w":{"text":"I'm so glad that we stopped into this place. The food was great and under the recommendati","useful":0,"cool":0},"Ldzdtm1RR0KsywBVJdTlXw":{"text":"We are from orange Beach AL we have eaten here 2 night in a row the staff and the food is ","useful":0,"cool":0},"TZaJXcRTwtpnaCMoAkCqCQ":{"text":"If I could get Mr Ed's 6 stars, I would.  The Charbroiled Oysters are the best thing I've ","useful":1,"cool":0},"-U3akIboEJDR1yB4L-8tGw":{"text":"Love this place.  Laid back.  All the food is great.  Always have a hard time on choosing.","useful":0,"cool":0},"AYDHRe1p4wKLZW5Wj4KZOA":{"text":"Food was good. Hurricane is SUPER STRONG!\nNote: checks can't be split if you are with a la","useful":0,"cool":0},"EHsslSUTvkGOKczytsZATA":{"text":"Low 3 star overall rating.\nCareless thoughtless  service. \nUntidy table needed good surfac","useful":2,"cool":1},"K01FU_n6zKAVi1xe0njVuw":{"text":"Went there with my mom and daughters for some creole/seafood and I stumbled upon Mr Ed's. ","useful":1,"cool":0},"7vvVeWr3CgQEDSUVrKJ2hQ":{"text":"We came upon this place almost completely by accident. We were looking for a nice casual r","useful":0,"cool":0},"blfCO5EdGll6Mo8hg3J0NQ":{"text":"We have been here four times.  The service has been slow to very slow,  but we came back b","useful":0,"cool":0},"FbrMwKZ3PZ_HB1EPAuSfoQ":{"text":"The food here was incredible. I don't often say that about seafood here in the quarter but","useful":0,"cool":0},"rHJ4-HqxDWYImwvEy0EqUA":{"text":"My husband, son & I went here for my husband's birthday. Although it wasn't our first choi","useful":0,"cool":0},"MI4PwqidjyckSSfUEdJ73Q":{"text":"This place is a casual atmosphere that one may be skeptical about trying out if you are fr","useful":2,"cool":1},"I0AwnvccsT-g8rOapd9iwQ":{"text":"I was pleasantly surprised when I arrived here. Nice quaint spot that would be missed if y","useful":6,"cool":2},"E0jNRqr008mHBfpe2y8bfg":{"text":"The good - great location and friendly service.  And they have a small selection of beer o","useful":1,"cool":0},"D0DszYdhJJTsRlpkmAe-uQ":{"text":"Do yourself a favor and visit this lovely restaurant in New Orleans. The service is unmatc","useful":1,"cool":0},"PGL9jSiRWtj8iQ_Q8tcaFQ":{"text":"I have so many wonderful things to say about Mr. Ed's! My husband and I recently visited N","useful":0,"cool":1},"yO-nZE7mOE70vCl6EczTxw":{"text":"So what I was looking for some oysters while on a trip with my boyfriend and his family an","useful":9,"cool":4},"BCYE71Zcljv5vffV7NXdsw":{"text":"Devin, Lele and Brian with an \"I\" cuz that's the only way to spell it are the bomb diggity","useful":1,"cool":0},"f7AVrQjuv5tH2rM9ryiUYA":{"text":"We had just arrived into a town after a long day of driving, and were walking around the F","useful":6,"cool":3},"JyTSjy34X_H4guDJt3gtgg":{"text":"First stop after a long day of travel from California. My husband and I were starving from","useful":0,"cool":0},"GyfQ0cM23c3uDQN2zimcwQ":{"text":"I have eaten here before pre Covid and had a great time! The crab cake shrimp pasta was aw","useful":3,"cool":0},"xYD6ffugmpJi6cc3JMf0UQ":{"text":"Lawre'll was amazing! The service and food were amazing but she made the whole experience!","useful":0,"cool":0},"_Wwji3zuM_BtHvGNzZV9Ww":{"text":"I found this place randomly walking around New Orleans looking for a good place to have di","useful":0,"cool":0},"zfR9Co89I6eV0lN72xMBXA":{"text":"This was the best restaurant I've tried so far on my visit. Been here for 5 days and tried","useful":0,"cool":0},"IdY7avLliI-0JXoffwh68w":{"text":"My wife and I have tried all of the nearby seafood houses and it seems we gravitate back t","useful":0,"cool":0},"7HjOUxh9-g5YtQMvg4nYOg":{"text":"Mr. Ed's Oyster Bar is a great place to get chargrilled oysters! \nIt was great to get out ","useful":12,"cool":11},"c5MxbYj2Vzw-BiLNsvwk-Q":{"text":"We did take out on a busy night.  Food was waiting for us when we got there.  BUT we had t","useful":0,"cool":0},"UTBjfiaE4dvrXDg39LW_aQ":{"text":"Great food me and my family enjoyed our dinner at my. Ed's . Service was good there was a ","useful":0,"cool":1},"EwgupubrucKv8LoedmgVtw":{"text":"Let me just start off by saying Mr. Ed's has THE BEST CHARGRILLED OYSTERS my fiancé and I'","useful":0,"cool":0},"Rt5FwtJuJbuzfY-u23xX_A":{"text":"Sat at the bar and enjoyed a hurricane beverage before dinner. Bartender was very friendly","useful":1,"cool":1},"WPzqDzAPQghSHaQaBuw5iA":{"text":"I was going through some NOLA pics and I remembered how bomb this place was! Their Charbro","useful":0,"cool":0},"DY29bP5f_e2eDSkV5TSdqg":{"text":"Our last meal in NOLA!! Food was excellent (exquisite chargrilled oysters, delicious crawf","useful":0,"cool":0},"cYru6IW-l3rVx9PTxAVdPQ":{"text":"This place was recommended by our bellman since me and my family are from out of town. Thi","useful":1,"cool":1},"RQUx247PAqxYEFV3Ufz7Hg":{"text":"Oh my word!!! This food was outstanding!!! The charbroiled oysters were phenomenal and the","useful":0,"cool":0},"542feawzON0footG4iysYA":{"text":"In my experience, often times well rated establishments can be a bit of a disappointment. ","useful":2,"cool":1},"1cRWjCg3D9CCesdenmWmjQ":{"text":"Red beans and rice are traditionally eaten on Mondays. It was a great way to utilize Sunda","useful":1,"cool":2},"XjQkvtmmLO3n5ayzd4qS1Q":{"text":"The staff was hilarious and very friendly. We had the broiled oysters.... out of this worl","useful":0,"cool":0},"EWBvB5x-9xptQ4NUmdAuqg":{"text":"Don't let the reviews fool you, there are much better places for food in New Orleans. The ","useful":16,"cool":13},"hbSjmeAwrIdiVqBlW4sH5w":{"text":"Apparently this place gets overlooked by tourists because when other places were \"all book","useful":0,"cool":0},"SmuKcArz-ROxxV1UPtwI3w":{"text":"Not one to usually write a review, but Mr. Ed's is worth my time. I'm a Flight Attendant, ","useful":0,"cool":0},"QPMN9AU1fYITrgqYFLt-tA":{"text":"This spot in the Quarter sits a bit off by itself . . . our 5th trip to the city and we ha","useful":0,"cool":0},"g44obd2muQ-fJUjMuej5RA":{"text":"Every time I think about oysters I of think of Mr. Ed's.  I visited New Orleans back in Au","useful":1,"cool":0},"77j5f9DcN1J4ZaCIHFs3UA":{"text":"Ohhhh Mr Ed's...every time I visit you get a little bit tastier. I researched the heck out","useful":1,"cool":0},"58DFVzLa79WNd7Z78L9sjw":{"text":"Our story begins like I assume many New Orleans stories do: we wandered into the restauran","useful":1,"cool":0},"DMX9LidCsNxyea1XtpHGdg":{"text":"Yummy. \n\nThis was my last meal on my NOLA trip and Mr Ed's did not let me down.\n\nMy husban","useful":3,"cool":1},"EXWGA61VghX9pGT4XLviUA":{"text":"It was dirty at the bar, the bartender actually used the used napkins from the people that","useful":0,"cool":0},"jHU0KActI2gsbtUppC8y9A":{"text":"OK, so I was in the Big Easy last month and I wanted to try a new place in the French Quar","useful":0,"cool":2},"v5v8KHZMd7ivSDy_anhbFw":{"text":"My friend told me about this place and I must say, I'm so glad I went here.\n\nThe service w","useful":1,"cool":0},"uO-WNCLiH6lxJWkPJoDDCg":{"text":"All I can say is we are going back before we leave! We stopped by for drinks and oysters. ","useful":1,"cool":0},"NxAxvRO1FaU6BuSwhNLdcg":{"text":"So we got the Quarter starving and we planned on hitting our usual spot but then my husban","useful":0,"cool":0},"qADwh3myW3VYPzJn5fdJIA":{"text":"Very friendly  staff, server was great. Amazing oysters and barbecue shrimp appetizer! We ","useful":1,"cool":0},"mjN9dfhRVpkvHYQEmHJ85Q":{"text":"With the service we received, normally I would give 1 star, but the food....\n\nThey messed ","useful":0,"cool":0},"ztnOM0QOKw9zws19MnRtZg":{"text":"Came here based on a locals recommendation. Short wait thankfully because we were there in","useful":0,"cool":0},"eMItnl-pqI-IZzzPtuVnLg":{"text":"I stopped in for a quick lunch while in town for work. I ordered the seafood gumbo. It was","useful":2,"cool":2},"tJA2jfHAxRAEpz-Z32I5xw":{"text":"Food was just ok. I was looking for more flavor. The jambalaya was good. The grilled veget","useful":0,"cool":0},"TpM-CVRz77HXs0oa1yxUHQ":{"text":"Just a-ok.  All around food, service, value, ambiance.  All just ok.  I can get this food ","useful":2,"cool":1},"sfgquwy4Jx6F36RUAcgZ-w":{"text":"I do understand that COVID has effected many jobs & everywhere is short staffed, but I'm a","useful":0,"cool":1},"-8SbjMQJ5boXUvB6_yhrJA":{"text":"This was our 2nd favorite joint in New Orleans out of 3.  1st got a 5 star, so naturally t","useful":3,"cool":0},"e1XDCZRZ20dZwtjwagQAWQ":{"text":"Char broiled oysters are out of this world. The redfish was awesome. The service was the b","useful":0,"cool":0},"qmOfEmbGKalj-gKD4NL0fg":{"text":"This place, hands down, was the best restaurant we attended throughout our time in NOLA (5","useful":1,"cool":0},"TZp17_ixfL5UvFXoTp3rlg":{"text":"FIVE stars no question. The taste of nee orleans was a absolute party in my mouth. Happy d","useful":4,"cool":1},"P6T_cw9W6I2juOF7O1BLCQ":{"text":"Great char oyster , along with red beans and rice made a perfect dinner. Staff from Mgr an","useful":0,"cool":0},"iWrTpnc5MM2vfFFfWTzFaA":{"text":"Pasta jambalaya pretty good. Too much sausage, not enough shrimp. Disappointed they didn't","useful":0,"cool":0},"uTdmaL91Nrl340mahztJvA":{"text":"Great service and nice menu as well. They quickly accommodated my party of 6. We started w","useful":0,"cool":0},"0QzRAkckG9YgojRP-ch0TA":{"text":"A local referred us to Mr. Eds for chargrilled oysters and crawfish bread. The restaurant ","useful":1,"cool":0},"H9_Zr-u39a9OfLntXcQMvQ":{"text":"Had a great experience last night for a quick dinner the night we arrived from CT.   Great","useful":0,"cool":0},"ZLSejN35CSIyY-iuI92QZQ":{"text":"My wife called me while out of town on her girls trip. She said she had the most amazing o","useful":0,"cool":0},"yxEOD0dprKnXwaGTrGiecA":{"text":"Started off the NOLA trip here and so glad we did. Great food, ambiance and service. Got o","useful":0,"cool":0},"lhUGLmF-1k7JES4uw_fEBA":{"text":"Highly recommend! Every single one of the staff was so friendly and helpful. Better servic","useful":0,"cool":0},"qkXJSkKEaX-vvLqoADw5fA":{"text":"This was just okay compared to all of the goodness of New Orleans. A few of us went during","useful":2,"cool":1},"9WDSERwQq4ivFWHHBlemmA":{"text":"Worst experience ever.  Ordered food to go...spinach dip and charbroiled oysters.  After w","useful":0,"cool":0},"MHRPHPsEP_pilbNGo2Qgmw":{"text":"Came here on our first night in New Orleans.  Fried Gator was great!  Loved the jambalaya ","useful":0,"cool":0},"NulvsznXz0ZBVQ5xwGtUBA":{"text":"This was a great little gem to find in New Orleans,  the raw oysters were huge, the grille","useful":3,"cool":1},"28C60Ziad0Nm1ERWIiEWaQ":{"text":"Massively overrated. The oysters are decent but nothing to write home about. The gumbo and","useful":1,"cool":0},"cH8W1sSNwhebACSugee3zw":{"text":"OMG!  Recommended restaurant from Carlos from Claire's Pourhouse.  Chargrilled oysters roc","useful":0,"cool":0},"VP2PQvFVNEDn6LtKy-3vTw":{"text":"Ursula our server was so amazing! Food was delicious, best oysters we've ever had! Definit","useful":0,"cool":0},"ipy9Lfmi5YX0pqdV0Oh_zg":{"text":"The service is terrible. we waited almost 2 hours for our food, meanwhile they were servin","useful":0,"cool":0},"aUP7No667x7mhN2MVxItyQ":{"text":"Crawfish salad is delicious. Fried crawfish nestled  on a bed of lettuce! I added hot sauc","useful":1,"cool":0},"Gq7z-skuvmfG0i4OHiSLJw":{"text":"Can't go wrong in just about any of the Nawlins eating establishments. I at so many raw oy","useful":0,"cool":0},"hI8CdgdukRIcM6qsi9XeNA":{"text":"We really enjoyed the oysters and food there. Our server was also super awesome and friend","useful":6,"cool":1},"s4qO7CvwwyQpH5VQoDGO3w":{"text":"I love oysters! Mr. Ed's Oysters were clean and delicious. I will definitely return to Mr.","useful":1,"cool":1},"AylutAzlq_yQIdYutP5efA":{"text":"Stayed at Sheraton on Canal St for work meeting/training/conference. Mr Ed's was close by ","useful":0,"cool":0},"mk_h9kVF7H6-lzDtGnr_lw":{"text":"Well .. for starters... I didn't intend to eat here...  \nI only intended to pee... Then I ","useful":6,"cool":6},"XKex-3YvBbMQVBkGbMCPNQ":{"text":"We searched for \"best oysters\" on Yelp and Mr. Ed's was one if the choices. OMG the oyster","useful":0,"cool":0},"8ODMwHNZ6k2PzNqHo6GSKg":{"text":"First off this place is clean and friendly. The staff works well with each other. They are","useful":0,"cool":1},"1Xkdqg0IyJJ4rCItBKxcHw":{"text":"I am so sorry but let's start with the fact that they were dusting the rug, the black carp","useful":2,"cool":1},"sZv_t_pa-TWrcUUpyXHVUw":{"text":"Best restaurant in New Orleans. Crawfish, Oysters, Jambalaya, Gumbo are all the best that ","useful":0,"cool":1},"Ug5MQg5n4GwmmNqbZNJ_0g":{"text":"Ate here tonight with a large group. Great service our server was wonderful. Everything we","useful":0,"cool":0},"d6wdIuWzlb1Dwr0nhvw54A":{"text":"Fantastic food! Oysters were amazing!  Sat at the bar and had great service, food came out","useful":3,"cool":1},"99LvCIH9GGoC1qjcvxghXQ":{"text":"The best oysters I have ever had. The staff is wonderful. I love this place. Never had bet","useful":0,"cool":0},"JEeQFE_6BSt-gFFMCYFQCw":{"text":"Restaurant was very nice vibe. The host was efficient and our waiter was nice and quick wi","useful":0,"cool":0},"m8elQTd15BeGzld5RmQ6eg":{"text":"We are so glad we found this place. Close to Canal Street. Service was outstanding and the","useful":0,"cool":0},"tOBRocQjBv5jDF6anwGxrw":{"text":"The turtle soup was AMAZING! The fried crawfish pies were glorious(careful they are really","useful":1,"cool":0},"hgDXMJZSWYMDwQLyemwA2w":{"text":"I'm going to give the oysters a 3 because some of them were none existent.. but the season","useful":4,"cool":2},"cZXGnjtc3Q-KtGuX6J5oIw":{"text":"A busy but fast moving restaurant.  Oyster po'boy and a cold beer can't go wrong. Dishes s","useful":0,"cool":0},"Ifmp0rVKXa94Tba9qg6R5w":{"text":"I really enjoyed the food here. The service started off a bit sketchy but at the end we we","useful":0,"cool":0},"MRyHLd2laLdIJA95dIrGLA":{"text":"Living in the San Francisco Bay Area, what constitutes \"Southern\" or \"Creole\" cuisine ofte","useful":2,"cool":2},"u7XkffIRDbzONwA7l5mXug":{"text":"wow! Alan M was my favorite bartender in Nola by far!! he's so enigmatic and bubbly. His d","useful":1,"cool":2},"fxI7OlU4chXwc1nJqpCgXA":{"text":"We were looking to eat some oysters on Super Bowl Sunday. Every other place was closing ea","useful":1,"cool":1},"7fihcraOvr-Y8da4djxP3w":{"text":"Visiting the Big Easy with the family to watch Baylor in the Sugar Bowl vs. Ole Miss.  The","useful":0,"cool":0},"eq_D1V8Osmh_KWHTEZvW0g":{"text":"By far the best service we had in the French Quarter in the five days we were there, and t","useful":0,"cool":0},"VTanAf0hlXeKsrCjM4hFAQ":{"text":"Char grilled oysters, tres bon!!!!  Redfish was equally excellent.  Nice little gem of a r","useful":0,"cool":0},"2iuRSQ3N4e5s_sUR_DCwmQ":{"text":"Awesome food on a Saturday night. Heading on a ghost tour and needed some food first. Port","useful":3,"cool":0},"5Wvimz66jOZ1oyd_onQMvQ":{"text":"Ambiance was great, our sever was an absolute gem. She gave great recommendations, and the","useful":0,"cool":0},"2ITHci_U6O3dE2f7OC8yuA":{"text":"Great food, even better service. We stopped in for drinks and appetizers. We ordered the g","useful":0,"cool":0},"m4AxQVdIXmdBQ8myTKYA2w":{"text":"Visiting from Dallas Tx...All I can say is WOW! This was a last minute decision & I'm so g","useful":0,"cool":0},"7LLwSZg5On0bfZJMDi_lbw":{"text":"I've been going to N.O. since the late seventies and never heard about this place, and the","useful":5,"cool":4},"w7QWdgReYsKpo_hxuKJ6Gg":{"text":"The best oysters! They were soo good. The drinks were strong. I had a delicious crawfish p","useful":0,"cool":0},"2_1X8FIb4VCtfG2gTk_YNA":{"text":"I'm so shocked by the 4 1/2 star rating! It's more like 2 1/2 stars (I rounded it up to 3 ","useful":8,"cool":11},"JRasJU3cplqybDmaTFJMqw":{"text":"I really wanted to like this place, specially after the other reviews.  I had already eate","useful":0,"cool":0},"APEvywILPuc-s1Jhjhn1kw":{"text":"Five stars all the way. I've been wanting to go to NOLA for years and I was finally able t","useful":1,"cool":1},"SIbFe_EuyppD-dPFwicCcg":{"text":"Outstanding. \nFairly priced, big portions\nThe charbroiled oysters were amazing\nWe also tri","useful":1,"cool":1},"ikNF0QlJ1VPrf-54_-K_AQ":{"text":"We stopped in for a quick drink, and discovered a nice swanky vibe with good music, delici","useful":0,"cool":0},"RHTXa-hYqiL1NVBKs0rCRg":{"text":"The oysters are delicious and much bigger than other places, almost twice as big. I had th","useful":0,"cool":0},"MYz2NrmFFaTJSyoiDjkamg":{"text":"First stop in New Orleans on a rainy day. Greeted outside, led right in to a table in the ","useful":0,"cool":0},"a362tYMPPZxNJsX8nvfZDQ":{"text":"Good vibe, 2 blocks off Bourbon St.  Not high end but good place to get food and drinks.","useful":0,"cool":0},"-bFg13xq0lfqU-UP-yu5kA":{"text":"I believe this is the Mr. Ed thar we went to, right across a Walgreens. Never in my life h","useful":0,"cool":0},"0rDor8X7A5gD7AER9qATJQ":{"text":"Mr Ed's Oyster Bar is a quiet little restaurant with great service. The atmosphere is rela","useful":74,"cool":81},"cG65mepxGii8XvCkdDnz9g":{"text":"Wandering around NOLA and literally happened to look up and see this spot across the stree","useful":0,"cool":0},"_8CNREAlk0bKueNmH-NhDw":{"text":"The wait for 5 was about 30-40 min, not too bad for New Year's Eve around 2 p.m. The food ","useful":1,"cool":0},"cLAazP73G8WWfpelaHEg_g":{"text":"Disappointed. I have it a 3 just because we could tell ingredients were fresh however seas","useful":0,"cool":0},"YdruJmsQroc3dpr7o5hnXQ":{"text":"Yum. Had the stuffed blackened redfish which came with veggies and jambalaya. Nice spice a","useful":0,"cool":0},"OPhPGqzm6etLpETtdwGkbg":{"text":"Best Oysters I've had EVER!! Best in New Orleans. Ordered back to back dozens and had oyst","useful":1,"cool":0},"_BILC-vtgTU8yWcraml7ww":{"text":"Okay. Let me say this I love this place good food and great service. Johnny , Michael, and","useful":0,"cool":0},"N7a6EVCHhB20kOiMJzTrFg":{"text":"This place speaks to my soul ! The food , service , and music was right up my alley . We c","useful":2,"cool":2},"B87Ti1tfW4do9uZayNh_Jg":{"text":"So I never post on social media platforms about restaurants but my group went to this rest","useful":2,"cool":0},"VaEn5wfLFyjokpbBk_IsJg":{"text":"WOW! First, these oysters were delicious but holy moly they were HUGE! \nWe got their iced ","useful":3,"cool":3},"GYWTqb8yn1SgM9XUpjdYOQ":{"text":"After several days in Orleans best food yet. Excellent food and service. Small quaint fami","useful":0,"cool":0},"amuEaLMbzHIiOaG6k1QTNw":{"text":"Good solid \"old school\" oyster bar.  I came here twice during my last trip since it was cl","useful":1,"cool":1},"-J7ifY311BKfegG34Q_bEw":{"text":"5 starts because everything was amazing. Drinks and food ! Going to come back time and tim","useful":1,"cool":0},"YUYwYx9K3NwKzDRLp8ghIQ":{"text":"The staff was AMAZING. So kind and funny and such a pleasure to be around - from the host ","useful":0,"cool":0},"mK6j5bVAgJlW3jZmaqKAZA":{"text":"Went to the restaurant due to the reviews but I felt that our meal was subpar.  Our oyster","useful":0,"cool":0},"H806g5S6SGkSOA7Bsfjitw":{"text":"Great grilled oysters on par with acme and dragos . Portions are generous and service was ","useful":0,"cool":0},"JdyritZVNuiSB-fL7A12zA":{"text":"My first time trying Mr. Ed's and trying charbroiled oysters. 20/10!! From the customer se","useful":0,"cool":0},"KGuYBIL1Ioyhxj6OmwLYXA":{"text":"This place is great! My family actually left me for breakfast so i ended up at Mr Ed's at ","useful":3,"cool":3},"CfdA0PAOgol4NOywDly1zA":{"text":"My husband and I recently visited New Orleans. One evening we were looking for a restauran","useful":0,"cool":0},"sBVQafottENFZL0KZ26HMA":{"text":"Let me start by saying, the food was excellent I had the seafood gumbo and it was probably","useful":0,"cool":0},"JuasSEJekQZdGDTTKuVTXw":{"text":"Mr. Ed's Oyster Bar was our group's first meal out in New Orleans and it was an amazing ex","useful":1,"cool":1},"03pqkPVx3nHyJReedI2i2g":{"text":"Had a little trouble finding the place as we were in NOLA for the first time and this was ","useful":0,"cool":0}}