{"KoRXOL8Q9Q7dw88hQ7i9tg":{"text":"This place is soooo good. I really think it may be the best burger in town. I wanted to or","useful":0,"cool":0},"lGkNsP_5VXfkVfv6Z3Bldw":{"text":"Far more than just a \"burger joint\". Creative and amazing flavors.  Wings were tremendous,","useful":0,"cool":0},"Ot-HFL_Rkd_k1TWx1SQoag":{"text":"Food is wonderful and very flavorful!  Staff and service could not be better!\n\nSalads and ","useful":0,"cool":0},"got0iQcb0S0jB2gOjJmlPQ":{"text":"This place is awesome! My favorite is the dr tan burger, by far. Perfect balance of spicy ","useful":0,"cool":0},"vXv2rOB9acYbwuT_bKWapQ":{"text":"Every Friday the chef does a new special so naturally I come every Friday.  This place is ","useful":0,"cool":0},"Ajpbe3EtCyJP9pFh9GW4yQ":{"text":"Ate here yesterday and the food was the best restaurant food I have ate in a very long tim","useful":0,"cool":0},"OjMKs4U5lJ4mqwwP5tyMEg":{"text":"The boudian balls were delicious. The burger was average. The costumer service was terribl","useful":0,"cool":0},"eNqMXn19ZlWdU-LgPAcF7g":{"text":"You can keep your Port O Call now that I've had Fharmacy. Hands down the best burger I've ","useful":1,"cool":1},"v6TdD2F3HTce6pQrJrn4Zw":{"text":"AMAZING burgers! I got the Dr. Tan and it was so good. Nice a juicy and it kept together w","useful":0,"cool":0},"u3DFL03Z20YpaaC79BcZXQ":{"text":"Friendly, welcoming environment! Large bar area with several tables that are suitable for ","useful":2,"cool":0},"OA2O8Dlya4upFMOLHFMlIw":{"text":"Well, I must say, this place is great. I used the Yelp online ordering thing and when I go","useful":3,"cool":1},"H3eGJoxUSMOmzFhC7i8GWA":{"text":"The food here is incredible! Excellent New American style food with a strong Vietamese inf","useful":2,"cool":1},"sPO9xessIq-XJFyaCPGf8Q":{"text":"Food was decent enough but the service was lacking. The servers were a bit nonchalant and ","useful":0,"cool":0},"Y7uCtuo5_D7ChsYKrfMWkg":{"text":"I came here for the first time to support a friend hosting a NOLA tech week event. Fharmac","useful":2,"cool":2},"PFBb7o9ga7ChDA4mC29pxQ":{"text":"Food was out of this world, and the owners were so nice. Chatted with us the whole time an","useful":2,"cool":0},"Gc-VJ6bSWerKmlRcHCe7wg":{"text":"Yeah it's awesome.  I have been quite a few times in past months, including (somewhat emba","useful":1,"cool":0},"ntWDiF7nYmLopN7Mv1zdSQ":{"text":"This place is the best.. ppl are great and the food is awesome. Great place to chill and h","useful":0,"cool":0},"91X5N_6YPjDngW-42D2w1w":{"text":"Awesome!  \nI had the Chicago Itllian Beef and my wife had the Fharmacy burger.  It was the","useful":0,"cool":0},"RYwUkE6estb2NuqqbL2stw":{"text":"Amazing food. Best burger I've ever had. If you don't like the Dr Tan Burger, then just do","useful":0,"cool":0},"wmgsYqPam1yzX9qfHWd7wg":{"text":"LEGIT bar food!\n\nLet's say the area can be a bit questionable, but hey don't let that stop","useful":1,"cool":1},"_mWvDCbZV-2YEiMCzYdAKg":{"text":"Delicious burgers! Wow! I was in the mood for something casual and quick and came across F","useful":2,"cool":0},"3tLyGrJ-sWim1P0elNqAfg":{"text":"Come eat here, the ICU wings are the Shite!!!\nBugers are FANTASTIC!\nChien and Nat rock thi","useful":1,"cool":0},"J5R-LMVVIUm8xoeMkWOqXw":{"text":"This place is amazing. This will be my new Burger and Wing spot. We tried the Lemongrass a","useful":0,"cool":0},"21v0Yqz9Wb61BFRWelBtoQ":{"text":"Fantastic place! Loved the food (lip smacking Boudin Balls ... in New Orleans - unheard of","useful":0,"cool":0},"I4k8h8cZpokHftDeuSl0qQ":{"text":"This place. THIS. PLACE. Such a great bar food meets Asian/ Cajun cuisine experience. On t","useful":2,"cool":1},"doRDjwq-wXAqaxU-28iDNg":{"text":"Literally, everything we had was delicious. The mussel frites, meat pies, poke special and","useful":0,"cool":0},"rCCWy2qM_oxPgGBx-lCynw":{"text":"BEST BURGERS IN TOWN!!! Amazing service! Everything was delicious. New favorite. #DrTanbur","useful":0,"cool":0},"tPob0FBWObVDuNJo9jVgmw":{"text":"Great food, service, 80's music, and chill people! Having the chop salad today! It's yummy","useful":1,"cool":0},"-bLIpuNfJeoO7Hq-UVel3Q":{"text":"Awesome place to come and experience different flavors. People are great, food is amazing,","useful":1,"cool":0},"o-BZMKtBGs-1I0kNLLAkxw":{"text":"Everything about Pharmacy was excellent. First off, their food was amazing! Second, the th","useful":0,"cool":0},"eOYOQy2TDjxOrovgn_fSKg":{"text":"A note of warning: before you come to Fharmacy run a marathon, go on a hunger strike and p","useful":0,"cool":0},"yWjY0UD2zBjLD-IAKBEioQ":{"text":"Two words...Mussels and Fries...drown the fries in the mussel broth and enjoy! Wings are c","useful":1,"cool":1},"Fg_jHbc4gN5jg6EbHmBywA":{"text":"Working across the street provided a perfect opportunity to try the famed restaurant.  I w","useful":1,"cool":1},"oTC8-9MOOG1rDy9eLPc_vA":{"text":"These dudes know what they're doing. Chien did my boy right. That Long island had him acti","useful":0,"cool":0},"sDNU0Ce4vy9aQadk3SxYMw":{"text":"We loved our lunch. I had the Fharmacy burger and my husband had the lemon grass wrap. Bot","useful":0,"cool":0},"lIfhHTTu2VxnfH3zq_5l4A":{"text":"BRO!!!! \n\nThis place is Fhantastic! I'm a burger snob and these burgers rank high up there","useful":0,"cool":0},"zQ_kZLqRa3f_U8Inh7kd0w":{"text":"This place is great!! Their mussels are maybe the best I've ever had. The burgers are big ","useful":0,"cool":0},"leAVu2jVeTnRaAV784vGHQ":{"text":"Cool place with great tasting food. I think we ordered close to everything on the menu and","useful":1,"cool":0},"_Wff9yI8Uk2L35pT7VpNLg":{"text":"Just a short walk from Canal, we Walked in for a late lunch and found two seats at the bar","useful":0,"cool":0},"m2xJRk3FBNYlEG9w1obo3A":{"text":"Amazing food. Quality food and generous portions at a very reasonable price. The service w","useful":0,"cool":0},"T6HU0FChUcQPBJkoRt9iQQ":{"text":"Woah there, I have two words: FUCKING DELICIOUS. came here a couple weeks back and got the","useful":1,"cool":0},"7Hwunr-PuZn92VtJ5E2pzA":{"text":"I seriously cannot stop talking about this place!! We will return over and over again. The","useful":1,"cool":1},"AXD1mWaRqwYEU6edFDGujA":{"text":"Really tasty place and their mushroom veggie burger is sooo delicious. Very kind and cool ","useful":1,"cool":0},"8DMIYv09dVftBPNd97BhPw":{"text":"I've never posted a review on Yelp so that tells you how good this place is! So good. Bike","useful":2,"cool":2},"fghlQYC-1Yi7hzO2rqNOVA":{"text":"What a great little out of the way spot fora bite!  We started with the Boudin Balls, whic","useful":3,"cool":0},"g8NZfXUIZ8DlQtyq01poWw":{"text":"I'm a burger guy and have had some of the best burgers in the country and the incredible s","useful":0,"cool":0},"6NvE_Al6zY3mXIpSrSlm2w":{"text":"Wow, from the setting to the service to the food! This is officially my new spot! The chic","useful":0,"cool":0},"wUuT8-TehfFSGM9J4nC9Tw":{"text":"We got here at 1:00pm and left at 2:03pm and only received water and an Mic Ultra. I have ","useful":1,"cool":0},"SSK-kHTCS2qEk3I0e3TH9g":{"text":"Five of us showed up for a late Saturday lunch. The owners are super easy-going and make y","useful":0,"cool":0},"6cEDRWZIJdbH3AU4hc2MZA":{"text":"Really great mussels and frites, we also had the buffalo wings, which were good, but I  wa","useful":0,"cool":0},"Az50RDtB7BkuVvIthJa-gg":{"text":"This tiny, little, sketchy place packs the BIGGEST flavors! Me and hubby have been here a ","useful":1,"cool":0},"TYDUxkPqpqu6o2pXY4p5Nw":{"text":"Hot damn, I love a good Yelp find. Stopped in last night. This place had freaking fantasti","useful":3,"cool":1},"S99AI75Izc8v3bGfaMXzDw":{"text":"Best burger in town. Always cooked to perfection. Great vibe and great staff. Come here at","useful":0,"cool":0},"3b0pvhm9QvP9-npjyZQP4Q":{"text":"It could have been five stars, but the chef was almost yelling during his belittlement of ","useful":0,"cool":0},"QbUy9sW9mHD0sKKbmUqFZg":{"text":"Friend recommended this place! And we absolutely loved it! Food is so unique with flavor! ","useful":0,"cool":0},"OVNzdsBJVYJKjLkiaMiSxg":{"text":"We love this place. Everything is so fresh and delicious. I mean these guy literally make ","useful":0,"cool":0},"LYyFux8KFoaRuOUG9OOVaQ":{"text":"I had heard so much (great) hype about Fharmacy that I was excited to give them a try. My ","useful":5,"cool":2},"bMdtEgIKsoK9aPP8OspHWg":{"text":"I basically ordered the entire menu.\n\nFirst- the boudin balls. Perfection. On the spicy si","useful":1,"cool":0},"Z7qI4ncf206uUDYRkjl3Gg":{"text":"It was a very fun spot where it looks like the locals hang out at.  My family and I enjoye","useful":0,"cool":0},"WLO2Zj_kYTAxZd4k_vYBPQ":{"text":"My first time here with adults & children. This is a very child friendly place on a Tuesda","useful":0,"cool":0},"k8Wylz6N7hXseAoCbe6ZzQ":{"text":"Been wanting to go for a while and after hearing friends rave about it yesterday finally w","useful":0,"cool":0},"D1xJpZJRkmTNEaiIm6rv9g":{"text":"We had heard about this place from my friend who is a NOLA native, and he said it was his ","useful":0,"cool":0},"aR5CSk4XkM_QR-nucNSoHw":{"text":"Love it, the Chicago Italian Beef is excellent. The owners and waitstaff are very welcomin","useful":0,"cool":0},"atc8SW5fJgdYTonOxtBKFA":{"text":"If you like spice and food full of flavor, this is the spot. Staff all works together and ","useful":1,"cool":0},"V4cyLQ28-DAMva-nEtwEPA":{"text":"AWESOME!! Really great food, very good prices and good menu options. Unpretentious attitud","useful":2,"cool":1},"furp8ldYMFpllnw4vK4l7g":{"text":"Good burgers with unique twist. Very nice peple working. Headed to work so i could not par","useful":0,"cool":0},"mKu3Z6mDASUfdNp0r7oqEw":{"text":"My partner and I tried to like this place but the service was horrible!!!! It took an hour","useful":0,"cool":0},"HzX5f0pvojWOqPtPHph-bQ":{"text":"The food was incredible. Had the Vietnamese lemon grass wings, jerk wings and several of t","useful":1,"cool":0},"RfAGHA9Rg3Q1nmVkuMkKLg":{"text":"The decor of the place was aesthetically pleasing. The place had more of a run-down feel. ","useful":1,"cool":1},"CKiWAbmK1IgvhY7KdM66MA":{"text":"This place is awesome! My favorite is the dr tan burger, by far. Perfect balance of spicy ","useful":0,"cool":0},"Cyte2_gZnaAJ1uMv_L9KjQ":{"text":"This is one of my favorite new places in New Orleans. The burgers are ground fresh and you","useful":0,"cool":0},"udIRXcbhfVmocLIgliZ1ew":{"text":"Holy smokes!!! If you are from Chicago or love Chicago-style beefs, this is the ONLY place","useful":0,"cool":0},"LGBeXVCFuawYoeKeHnKBKg":{"text":"I absolutely recommend the Asian muscles, the best I have ever tasted! Great atmosphere an","useful":0,"cool":0},"gh2OPzyIBFzabJZJPFJQvg":{"text":"I went to Fharmacy for lunch and had a great experience. Not only was the food excellent, ","useful":0,"cool":0},"vreC6fNSMYM7mGIcjggZtQ":{"text":"Fharmacy has the best burger in New Orleans hands down. They grind their own beef and stuf","useful":0,"cool":0},"zl8TVVRh-Mc2UQ6XUQKNBg":{"text":"Fusion comfort food located in a converted home. The staff was super friendly and fast. Bu","useful":1,"cool":0},"BsB1kwTnWqip-KzegTaGAA":{"text":"Seriously amazing. Didn't look like much walking up to it, but it's a cool diner on the in","useful":0,"cool":0},"X0J4hkd6LNnXoTxZWGDJ2w":{"text":"Best buger ever!!!  So flavorful and juice!! I will definitely have to go back before I le","useful":0,"cool":0},"tvLqwPUgjYQrk2_8hQdN8A":{"text":"Back again and it's just as good as the first time.  This place is a hidden gem.\n\nStarted ","useful":0,"cool":0},"7gsr0Xd2ap7kIuviUT9aiw":{"text":"This place is do-o-o-ooooope.\n\nWhen you first look at the menu, it appears to be a mish ma","useful":4,"cool":1},"cDd5qOid5FWBrBiPOG2Ayw":{"text":"Hubby and I had a blast . Service was good . Food was excellent . Atmosphere was laid back","useful":0,"cool":0},"O0Vj74WtU2z0_ERtTOE-jw":{"text":"What a fantastic experience all around. My boyfriend & I shared the Asian mussels & frites","useful":0,"cool":1},"TfrZ9Inhw3RRxqoCU_JIFA":{"text":"Fave food in mid-city. The lemongrass chicken tacos are perfection. We always sit at the b","useful":0,"cool":1},"JWuK8Kk6RQWBEu19nhWsiA":{"text":"I eat here all the time and everything I have tried here is great! Almost all of the food ","useful":0,"cool":0},"pPl2utHdomw_xXziTP8RxQ":{"text":"This was our first time to Fharmacy. We both got specialty burgers and fries. Both burgers","useful":0,"cool":0},"XPf7DZWH88Qm_PmHir2roA":{"text":"One of the best burgers I have had. Definitely add the Cajun spice to the fries for an ext","useful":2,"cool":0},"JWMj7HgFiBGrfZ2ZX_JlIg":{"text":"Low key food and bar near the VA hospital. Relaxing atmosphere, great service, and phenome","useful":0,"cool":0},"WoIX2nG4pC3rNEbgiW9zHA":{"text":"Glad my business contact suggested Fharmacy.  Had boudin balls for appetizer and on the Fh","useful":0,"cool":0},"Pa-KG0b_LCJ2sbeBKtJQwg":{"text":"Ate lunch there. Had the chicken tacos. Enjoyed them immensely. My wife enjoyed the choppe","useful":1,"cool":0},"RfJD87Azg07_n8f6DVDbmg":{"text":"This place is great! Tasty food, great staff and super cute building. We had the boudin ba","useful":0,"cool":0},"jU9jrD-eHaDUWOrI4SF1Eg":{"text":"I'm at least a weekly regular and I've waited quite a while to write this review or even t","useful":0,"cool":0},"TJ92xk-nZQG4Vb1jSVkF2g":{"text":"Must have: Boudin Balls! The house-made boudin is spectacular. Everything we tried was inc","useful":2,"cool":0},"_wApV_fzJEpO53dQj6qSvA":{"text":"Unreal burgers. Absolutely incredible beef quality. The giardinera is better than anything","useful":0,"cool":0},"Uib87PAb74R-z2r-UEcrog":{"text":"Blows company burger and port a call out of the water. Fresh ground beef, nola friendly, c","useful":0,"cool":0},"0HuIzO9ZnF6Z-bdkuSCuTw":{"text":"Dr Tan Burger  literally one of the best burgers I've ever had. Everything is made fresh r","useful":0,"cool":0},"uSZO_FSSQuExlGduN1e56Q":{"text":"Great burgers! There isn't much variety on the menu but what they do have is very good. Th","useful":1,"cool":0},"lx9h48Nz0oUJk_od0yFh5w":{"text":"As many times I have checked in here, you'd think I work here. Where do I start? Walking i","useful":4,"cool":1},"dg44RfhTRXHrTz5-qc4gbA":{"text":"I had high hopes for this place. I heard the burgers were great, I was so excited to go pu","useful":1,"cool":0},"ZRBjOp2_MLnBNt1E0A2F5Q":{"text":"My new favorite place for burgers. The burgers are fresh and prepared perfectly to order. ","useful":0,"cool":0},"G9nJ5cpd6nqARCO-dNn5WQ":{"text":"i got the italian sausage and that thing was way too huge, not like that's a bad thing tho","useful":0,"cool":0},"CVARDKmNpR_yJhETwGzmhg":{"text":"Best burger hands down in the city and I do not make that claim lightly. Mussels were flav","useful":0,"cool":0},"7DN-nR5ls0orpvJ__jO59g":{"text":"Love this place! I go out of my way to come here! The lemongrass chicken in the tacos and ","useful":0,"cool":0},"ZGKIlZXNvzdWsN6edv7CBg":{"text":"Great new spot in the 'south of broad' Tulane area. Pretty well hidden, it's just between ","useful":3,"cool":2},"-IxWN30lxQV_DzAZJ_bTJQ":{"text":"Fharmacy Nola represents the type of burger joint that is necessary for the current food s","useful":0,"cool":0},"he7xFuP_B_0RDb_vGdz0rw":{"text":"Not one complaint. I sat at the bar around 2pm, got an iced tea and the lemongrass chicken","useful":0,"cool":0},"45i-2MVGQp-47SIRDuqXpw":{"text":"Superb service and fantastic food. The lemongrass chicken wrap is my favorite and consiste","useful":0,"cool":0},"fa4o-yUObz2O55XgSyoDPg":{"text":"We stumbled in here after a second line and couldn't have been more pleased with our meal.","useful":0,"cool":0},"g6K3wGMOqhHoM15YaTG3ZA":{"text":"Fabulous service! We had the tacos, boudin balls, tater tots (with everything!), portobell","useful":1,"cool":0},"Asql_rN_Eqz2FZ7WNOroGw":{"text":"We had the Pastrami with tots and no dijon mustard. It was good. The workers were chill an","useful":1,"cool":0},"xQF4mTFrU1w8NxAJcm2ekg":{"text":"I was in NOLA for work for about a month and I tried this place on the last day I was ther","useful":1,"cool":0},"zUo7BJXcb5Tzf47rE18QUw":{"text":"I am blown away by the food here. This was my first time dining in and I had the Dr. Tan b","useful":0,"cool":0},"zipuCe9tqh9YYtRrGYWMTw":{"text":"Stop reading and go!!! This place is amazing. The boudin balls are the best I have ever ha","useful":0,"cool":0},"V06KSvxM8S_RA55bo-odGg":{"text":"This place is off the hook!! I had the Tan burger and was it ever good! This burger didn't","useful":0,"cool":0},"iZHAN9zh0Pm9B09kRS4K0A":{"text":"Came here because of the reviews. Did not leave disappointed!!!! Dr Tan burger was incredi","useful":0,"cool":0},"zCPPlTKn4jgxnz8t5MEILw":{"text":"Fharmacy burger should not be missed.  Been a few times and it's excellent each time.","useful":1,"cool":0},"LOrmM5fVRTMdKN0s5iLegw":{"text":"Burger was great. Caesar salad was sad. I guess a bar can only do one or two things well. ","useful":0,"cool":0},"DN0WF7CXFowl8FqpDEv3Wg":{"text":"Awesome place!  Ask if they have the pork belly appetizer -  it's off-menu and doesn't get","useful":1,"cool":1},"i9Ec7H0hmjmleiM8Fem15A":{"text":"Hands down BEST burgers in Nola. And I love the owners and staff! I always bring friends i","useful":1,"cool":0},"B6I8eteu5TBHXK9AmIOHxw":{"text":"EVERYTHING at the Fharm is amazing! If you skip it it's your loss! The burgers are phenome","useful":0,"cool":0},"HhnutfCvpGfUzMLQ821KVQ":{"text":"Burger is SO fresh! The high quality of ingredients is very obvious. Super nice and friend","useful":0,"cool":0},"zgRzBs1UZzb_Uh459Bf2rA":{"text":"I have been looking for the perfect burger in New Orleans for years now and I finally foun","useful":0,"cool":0},"uwHC9uaSS88dotrZaCEVeA":{"text":"Ate here for lunch on our way back to Nashville and boy did we save the best for last! Wit","useful":0,"cool":0},"SDnriR_bq-ChL2x8C3LmZQ":{"text":"Second time we were there the food and service/attitude was even better than the first. Th","useful":2,"cool":1},"-TJTYsiggsCd6Rl4ZS2cEw":{"text":"Great food. Great service. Wish it was bigger inside, but that's part of it's charm! Nice ","useful":0,"cool":0},"wwlsa3vEhdS9YSeW3xIGGw":{"text":"Hole in the wall with great food. We had the boudin balls and a hamburger and they were sp","useful":1,"cool":1},"cxCaJzmJa6cyqHUNJLdyqQ":{"text":"Amazing food, adorable owners, holler at a Bobby Chien he is a snow bird in Minnesota and ","useful":0,"cool":0},"GeoxUG0w8ZXAE6yF3fk9RA":{"text":"I travel all across the US and abroad in search of unpretentious, flavorful cuisine prepar","useful":0,"cool":1},"lcpG7R062whNGozF5647Og":{"text":"Low key food and bar near the VA hospital. Relaxing atmosphere, great service, and phenome","useful":0,"cool":0},"S79KTeua5x23jpVwgKBR-Q":{"text":"This place is absolutely delicious. So much so that I need to visit them again to be able ","useful":1,"cool":1},"H__3SLeheU1AKWPUgYZ4Fw":{"text":"This is my first review on yelp, I have never had the urge to praise a restaurant until no","useful":1,"cool":1},"9zVCTOVVTgn514SSzKTaFA":{"text":"Great place!  We had the lemongrass Chicken Tacos,boudin balls, BLT and The Roast beef san","useful":0,"cool":0},"qAHIUseF304-sgtKM6fghQ":{"text":"Stopped in on a food crawl around town. The Dr. Tan's Burger is worth every rave review on","useful":0,"cool":0},"4ll3saTwT63PpDq6w36pTg":{"text":"New place just opened days ago. They have fresh made juicy burgers that melts in your mout","useful":1,"cool":0},"EhmDTgts1qXF5ZWfQ5FfZw":{"text":"They deserve more stars.  This place needs to be on your list if you are visiting, or live","useful":0,"cool":0},"PzCngjK-8HcBNKnD7svlEQ":{"text":"Wonderful! The food is done so right here. We had the Fharmacy burger, Dr. Tan's burger, a","useful":0,"cool":0},"rKZ1SUAIL8WVqmlXp73tmw":{"text":"My daughter and I ventured into a new area in search of a good burger. We found ourselves ","useful":0,"cool":1},"URowBTPdnqodJ-YjXDB_yA":{"text":"Brotherly love here. Friendly service with great food.  Great place to chill. Got to try t","useful":0,"cool":0},"QjuFe36CYDR9PE4KqGymLw":{"text":"This place is FANTASTIC. Highly recommend the burgers, almost everything from the patty to","useful":0,"cool":0},"IfSiOE9BlViBNXOsN0RZrw":{"text":"This place is FANTASTIC. Highly recommend the burgers, almost everything from the patty to","useful":1,"cool":1},"7KU-xB-LGGu-R7BXp8VKoQ":{"text":"Not as great as I expected. Slow service, and the food was average. I had the hot sausage ","useful":0,"cool":0},"rBXfk9m2lSiYtZ-EbTKTCw":{"text":"Everything from the classic Cajun cuisine (i.e. boudin balls) to the Vietnamese flare to t","useful":0,"cool":1},"H99r969dEFxa7wcntmiN9Q":{"text":"Sometimes I wish it had a bonus star!!! In a city of great bar food and neighbors eats it ","useful":2,"cool":0},"ugRyxEFybezG9Mp4uj5gRA":{"text":"This is now my favorite place for burgers in New Orleans- better than port of call, compan","useful":0,"cool":0},"qpMl9I47HwEPKBOfoqbvMg":{"text":"WOW awesome place!!  Had Boudin sausage balls for an appetizer then I had Cajun style chic","useful":0,"cool":0},"PmX4sD3ffrkX8lyE1lg1Iw":{"text":"So much flavor in every bite! Great sized portions too. The attentive and fun crew behind ","useful":0,"cool":0},"2IjKSLW6lkRhtYJjmkE5sw":{"text":"Probably one of the best burgers I've ever had! The Cali Burger is no joke. First time vis","useful":0,"cool":0},"qm040tWVX-mRzRyubd3W3w":{"text":"Awesome food and service.  Really love the pharmacy grade tots with pork... been here seve","useful":1,"cool":1},"3G2KGGH3-FaWdjWwIGhj_A":{"text":"My husband and I stumbled upon Fharmacy NOLA during our first visit to New Orleans. We enj","useful":0,"cool":0},"VIPTo73nW43tg1GP10VZNA":{"text":"Everything from the service to the food to the bloody mary was flawless. Great hole in the","useful":1,"cool":0},"fMRdKmIqrZfjQBRK62m_1g":{"text":"I have to review this place again, best kept secret. Food is so so so so good. Best burger","useful":0,"cool":0},"kHeZiDzmFh_vXw7KNJDl2w":{"text":"OH MY GOD....where have those mussels been all my life???  They need to be entered into co","useful":0,"cool":0},"DX3UgMVcW7d8LXvZNUOF6Q":{"text":"The Fharmacy burger is so good. The patty drips with juice and the size of the burger is p","useful":0,"cool":0},"o8_1fGfBB7AXuQhBRVnnxA":{"text":"I dig it. Have been for lunch a few times and while their menu is random AF, it's awesome.","useful":0,"cool":0},"_kVwwSvyVHsXbbyChWtvWA":{"text":"Summary:\nGreat service.\nGreat atmosphere.\nGreat food.\n\n\nLong review:\nI'm about to throw th","useful":0,"cool":0},"7FCDStqOTjerb6Sramt2Jw":{"text":"I love the service, and the food is excellent. Dr. Tan Burger, best specialty burger in NO","useful":2,"cool":2},"I1WubxFvXAkMoCnNyAQQUQ":{"text":"Enjoyed an off the beaten path experience while our family was in New Orleans here at the ","useful":1,"cool":0},"3vc0_AFVULo34c-TfVkJ0g":{"text":"I came here on a whim, and I am glad I did. I had heard that they make all of their sausag","useful":0,"cool":0},"f3J0IB0yFyI8sGqcdeInmA":{"text":"Delicious burgers! I LOVE the homemade ground beef patties! They taste so fresh and differ","useful":0,"cool":0},"nX5FddhvyvTvdj4VdAuBdA":{"text":"Yo this place is bomb.com!!! I went this last Monday afternoon and had the chicken tacos a","useful":0,"cool":0},"hMgAu98m7hL4cSiu5g5lLg":{"text":"Great casual lunch. The food was amazing and the atmosphere was perfectly relaxed. I wish ","useful":0,"cool":0},"qkRCbNLSzaYhzjsfZNkwXA":{"text":"Awesome food, very fresh. Dr. Tan Burger and the lemongrass tacos are nothing short of ton","useful":0,"cool":0},"P90YVX2LKCzCPH6QxqkMtA":{"text":"Fharmacy is great! Quality neighborhood spot. Killer broth on their mussels and fries (whi","useful":2,"cool":1},"8iqSKTsEkBSyyjRoqYkHcg":{"text":"The wings (garlic-Parm) were just ok, but the Dr. Tan burger was amazing, one of the best ","useful":0,"cool":0},"G2s47JvzsvnNrjSd96kzNg":{"text":"I was impressed with Fharmacy Nola. I went on at Sat at 11:20 am; ordered the Fharmacy Clu","useful":0,"cool":0},"cRfffthQvvQmPoZ2wrfhUA":{"text":"Hole in the wall, small menu, great food. The amount of mussels you get for the price is u","useful":0,"cool":0},"IUYI7KMfUseODgYrGknJzw":{"text":"That place is amazing! It's a bit small but intimate. All the chefs serve you with a smile","useful":0,"cool":0},"Fol6aoz7kNU2VFo689ANZQ":{"text":"Holy cow! My friend Jennifer took me to this place for tacos and I love tacos! She said th","useful":1,"cool":1},"aUmf5yzG2lnAComJpFpSZQ":{"text":"Fharmacy was a very pleasant surprise!!! Me and my girlfriends are on a Staycation and pla","useful":0,"cool":0},"6RRxE-zFoVx7_571yg_ToA":{"text":"Ordered the Fharmacy Burger w/ Giardiniera. Moved to New Orleans 4 months ago and this is ","useful":0,"cool":0},"3uEwf-lodyIySIlU2gA5Pg":{"text":"I've been a few times now and I really like Fharmacy. They have a unique combination of tr","useful":0,"cool":0},"vxEEBK6_X_YM8rBg1qxVZQ":{"text":"This place has the tastiest burgers I have ever had in my entire life.\nI've had the Cali b","useful":2,"cool":0},"OJ4C8VdE2Z2TBiNqPKAB8Q":{"text":"AMAZING! Service was phenomenal! Food was flawless! Boudin balls are a must! Would recomme","useful":1,"cool":1},"XfwrKpaXmI2hrjICrR0GjA":{"text":"Great environment. Staff was friendly and service was great. Burger were fresh and tasty. ","useful":0,"cool":0},"iwH5prFUc8X8gp-spFlTlw":{"text":"Service: horrendous \nFood: cold\nI can only review the food we did receive/ate, and that wa","useful":0,"cool":0},"YntvOekzGxVuUBK2lxDbOg":{"text":"OMG - mind blown! The Boudin Balls were great .....but the DrTan burger ..... crazy delici","useful":1,"cool":0},"iqSefRusdx_xMLtJCLZxOw":{"text":"I only tried their burgers but damn it was good ! The burger is full of flavor and it is  ","useful":3,"cool":2},"jy2rYVSmM5VAMygss0bqNQ":{"text":"The place looks a little divey on the outside but inside is an air of happiness and fun. T","useful":0,"cool":0},"i0SP6lGkmxVajTafWfgwbQ":{"text":"Deceiving from the outside. Quant , amazing service and excellent food. We arrived around ","useful":1,"cool":1},"6XSP_EpmWzRKLHEydJYgQw":{"text":"Had an amazing experience here Friday 9/21/18. The staff is very friendly and the food is ","useful":0,"cool":0},"WjhU3bg1MCYKgHvXRPsJyA":{"text":"My husband really enjoyed his burger but I didn't and it wasn't because of the taste, I ju","useful":0,"cool":0},"MFoaBhRNzmcfHEgiDdhh1w":{"text":"Hands down the best burger in new Orleans. Nhat and chien run an incredible establishment.","useful":0,"cool":0},"u_yW8S0gd-cCZYH1p0YWOA":{"text":"Italian beef sandwich was da bomb!!! Must try it and the chicken tacos are amazing mussels","useful":3,"cool":0},"xT-y0kjzTKO8PaKanzwEYw":{"text":"Dr. Dan Burger and the Asian Mussels and Fries were so delicious. Best burger in town!","useful":0,"cool":0},"di26jwO0Pk4bWlnAxA765A":{"text":"My housemate and I go at least once a month! Service is always on point and the food never","useful":0,"cool":0},"uyaDjK-36IlCT9B6QymLyg":{"text":"The food was REALLY good!  I had the club sandwich and my wife had the burger, and the wer","useful":0,"cool":0},"0VQUbSIPQBBr-ETCW5DpJg":{"text":"Seriously one of the best restaurants I've been to. The staff here is also some of the nic","useful":0,"cool":0},"RLAiyuI6597sDH1qlPriZg":{"text":"Food: 3.5 stars\nService: 3.5 stars\nAmbiance: 4 stars\n\nI had the veggie wrap with spicy chi","useful":2,"cool":0},"ZzImBBl7FiOCoGEIphKFJg":{"text":"The sandwiches were great, but the service was so slooooow! It was outside the regular lun","useful":0,"cool":0},"28yGLmtjH5D_bBFkwLW83g":{"text":"This is one of my favorite places to grab a causal dinner/drink with friends these days. H","useful":4,"cool":2},"EgdLuk_peAep0lcgbU871Q":{"text":"Great place for burgers and fries! We went with 4 people, ordered 4 different burgers, eac","useful":0,"cool":0},"tg44cFkW88psu2tkVQpPbQ":{"text":"GREAT burgers and atmosphere. I'm not a huge burger person either so this is saying a lot.","useful":0,"cool":0},"P5q8xK4SrqM1bA9GjJvimA":{"text":"I love this place. It feels like Cheers and this is only our second visit. The food is OUT","useful":0,"cool":1},"ZAnVe-n3bveJWHbobnaAVA":{"text":"I can't say enough about this place. My favorite part is the staff (Chien, Nhat, Vincent, ","useful":3,"cool":2},"bGIYRJ7-DDW0jX6CE4islg":{"text":"Awesome food and a cool atmosphere. We were bored at our house one Saturday morning lookin","useful":2,"cool":1},"dpuTm9iMdTEbvPmRCAEBIQ":{"text":"Great service. Phenomenal Cali burger (*actually* cooked medium). Fries were prefectly sal","useful":0,"cool":0},"pw2zNpYf0fgRmjPmfT3QTw":{"text":"I picked up a to-go order. The food was excellently prepared and delicious. Every single p","useful":0,"cool":0},"dzs_JM8x_534SVOSlD5Yvg":{"text":"THIS PLACE IS SO FREAKING GOOD! My friend is vegetarian and THEY HAVE OPTIONS. I had the D","useful":0,"cool":0},"d7LUR3myKU8Do2xR_fJXEg":{"text":"This is by far the one of the top restaurants to eat at in Mid-City. Fharmacy Nola's burge","useful":0,"cool":0},"OA4GlQqZgWS0ekgZQtShgA":{"text":"First of all, believe everything you've ever heard about their burgers....they are all tha","useful":0,"cool":0},"VxFi45DBbmZB1QXjPPsz5w":{"text":"The best food I have had in while. Everything is made inhouse, even the ground beef. Talke","useful":0,"cool":1},"7bLowAh6w-jHziZaHVbomQ":{"text":"The absolute best.  Every component of theses burgers is well thought out and made from wi","useful":0,"cool":0},"9SMS0B5l_cbothhc_DNZOg":{"text":"Best. Burger. In. Nola. Question it and we fighting. There was a better burger joint in Me","useful":0,"cool":0},"sm4PJo1CHRyoLaDNIkKQ2g":{"text":"The portobello burger one of the best I have ever had. The atmosphere was very welcoming a","useful":2,"cool":1},"_glK5Uh2qjwt0dLrcImNFw":{"text":"Great food. Great service. Wish it was bigger inside, but that's part of it's charm! Nice ","useful":0,"cool":0},"w3d4tm2SornPfL8D9oSV4Q":{"text":"A hidden gem. The staff were not overly friendly since it seemed to be mostly friends insi","useful":0,"cool":0},"5mt-hmlaxVNJCMEOnw9z5g":{"text":"Lemongrass tacos are the bomb. Staff is also really fantastic. Fun happy place. Burgers ar","useful":0,"cool":0},"m0mJO3GtyDNEB6ZGow8b1Q":{"text":"Took 5ever to take the food out. Food was good though... if you're willing to wait an hour","useful":1,"cool":0},"V-YDcMdVKBq5G4eZcdDS1A":{"text":"Wow, these guys are geniuses. THIS place rocks. The burgers are best around. What and Chie","useful":0,"cool":0},"udp9ztch8O_yOxLV3VyXQg":{"text":"Best burgers in town!!! Get the Dr. Tan burger, tacos, fries, everything!!!!\n\nThe beer sel","useful":1,"cool":0},"TR2tfbusAQweOLpnwJUHmg":{"text":"Excellent food and atmosphere. Easily my new favorite restaurant and I don't eat meat but ","useful":0,"cool":0},"MzpccDyFMmXMyjbvQToRlw":{"text":"Long live Fharmacy, their incredible food and staff. We stumbled upon this location a coup","useful":0,"cool":0},"ESwLh1O64sRoLeC3swrVVg":{"text":"One of the best places I hav ever tried ... The burgers , mussels n fries , buffalo flavor","useful":0,"cool":0},"QU5npR9nbVb0CndFGFF0PQ":{"text":"You know that feeling of desperately needing a Chicken Caesar Wrap and NOTHING ELSE will d","useful":0,"cool":0},"0xDA2zTAO-pieuIvSAH9tg":{"text":"This is one of the best spots in New Orleans to get some awesome eats. Gotta try all of th","useful":1,"cool":1},"3OmOvKHpMmcutI54dBmT9g":{"text":"I've only been twice, and I got the same thing both times, yet I am still eagerly giving 5","useful":14,"cool":9},"B2Vhi80uA0P-Gq570yBaaA":{"text":"Delicious! We got the Fharmacy and Dr. Tan burgers and I personally liked the Fharmacy bet","useful":0,"cool":0},"TAfEX7vbTZERx29HtVZxDg":{"text":"I live here in New Orleans, this is one of my go to places for burgers! They have really g","useful":0,"cool":0},"tjHugIqE2ptQx-jwhgkwpw":{"text":"I cannot think of a better burger place in the city.\n\nFirst and foremost I can order my bu","useful":16,"cool":10},"4v4P--cDnwc97vKuIJOYzQ":{"text":"A casual little spot in NOLA where you can just be with your friends and just have a beer ","useful":3,"cool":2},"WO4bZbkrJNH6ni0Q4CoEiw":{"text":"Just showed up and they were closed at 8:45 on a Friday night. Came to the door to say it ","useful":0,"cool":0},"Yv5MmroaT_-L2Z7uBV-G_A":{"text":"One of the most underrated places in the city in my opinion. Delicious food (seriously I d","useful":2,"cool":1},"guqZLp4Yt3-pPgi2Od0gKA":{"text":"Go to the Fharm!!! Been here several times and always get the best food and service. The C","useful":0,"cool":0},"BRTyzp7C02ZmMvnjnAZt8w":{"text":"I love me some Fharmacy seriously. This is where I go when I want to treat myself to somet","useful":7,"cool":3},"nOpj4GbIAKD4AvXpvN0kKg":{"text":"I came here while in New Orleans for my bachelor party, it is a little off the beaten path","useful":0,"cool":0},"WN3Rtngv1rgUt47KJLWHBg":{"text":"THANK GOODNESS FOR THIS PLACE! We had just arrived from the airport and after issues with ","useful":0,"cool":0},"q68THJBgj7uJqKQkCkxHMQ":{"text":"Delicious burgers and tots. Long wait for food though. Almost thought they forgot about us","useful":1,"cool":0},"1mtsTF9z5FH7ruLjIdhijg":{"text":"A MUST HAVE- This is not your average joint: the food here is cooked to perfection and THE","useful":0,"cool":0},"JGPmkIAQP34L_vg1T2Vs0w":{"text":"Located on Banks St (close to Broad), Fharmacy is an amazing little restaurant/bar that ha","useful":4,"cool":4},"7iCz7wW6F__daepd0LGaSw":{"text":"Good burger and beer combo.  \n\nI always love places in NOLA that have a great vibe/food.  ","useful":0,"cool":0},"R-C5QzHqSDi5gzsUIl9n8A":{"text":"Found this place when researching restaurants before our trip to NOLA. Sooooo glad we went","useful":0,"cool":0},"YhLZFBcJT9uW4NnqUJcf5Q":{"text":"They are quite busy on this particular Saturday night, so we had to wait around 30+ minute","useful":3,"cool":1},"8Q7UnWPJqgsL3MzXZ-_tMA":{"text":"I can't say enough good about this place !!!! They treat you like family and prepare AMAZI","useful":1,"cool":1},"K6nudoV3MrTsLIDnCrex6g":{"text":"Wonderful! The food is done so right. We had the Fharmacy burger, Dr. Tan's burger, and th","useful":2,"cool":2},"YENSlsdc4OPgfcxIqNY3LA":{"text":"My first time here with my friend and we only got 2 things to snack on because we always e","useful":2,"cool":1},"4kmon3IErVeFJu-ErTDwyQ":{"text":"Everything all the time!!! My fav are the chicken lemongrass tacos, such an amazing flavor","useful":2,"cool":1},"FKToBWV6SxmwdHf7RufvsQ":{"text":"Oh wow..  the wings are outstanding, the burgers are huge.. a quick walk from the new VA M","useful":2,"cool":0},"xwYs2nEG0oR5IoLy6xXgfg":{"text":"Hidden gem close to University Medical.  Don't be worried about the size and look.  Great ","useful":1,"cool":1},"znnxi3nOlL3qX3jMMNasNw":{"text":"I have been here a few times. The people who work there (including owners) clearly take a ","useful":0,"cool":0},"74rH--IyxOaq0nqINL7iXg":{"text":"Probably the best service I've had yet! Not to mention the food was A-MAZING! A must eat/h","useful":0,"cool":0},"9Wdd_qV2yEzp5Sb0peuXwA":{"text":"Stopped by Fharmacy NOLA during lunch time and was overall satisfied! I ordered the mussel","useful":1,"cool":0},"r69ev0vFKJyHMw8ZJ6sxYw":{"text":"This was OUTSTANDING!!!  The Fharmacy Burger and Tan Burger were just over-the-top delicio","useful":0,"cool":0},"m9EYsIltdCZy-6x3YGJVWQ":{"text":"I've been here twice now , our burger club wanted to have another go around at it . Not th","useful":0,"cool":1},"iaiATWpBjge_11ctYbwm8A":{"text":"Food amazing as always.  Got the tan burger and fries loaded.  Both tasty.  Best burgers i","useful":0,"cool":0},"OppgnzMiU4lya8nHp4nS-w":{"text":"Beat burger I've ever had! Recommended to us by a local, this place blends in with the nei","useful":0,"cool":0},"lupdu2c3E43c3vPCTRKzeQ":{"text":"Food quality: OK...it wasn't bad, but certainly nothing to rave about.\nService: HORRIBLE!!","useful":7,"cool":0},"5CMrXSHZPwFAQDYb9CcO6g":{"text":"First time visiting last week and was extremely impressed. I don't usually give out five s","useful":2,"cool":0},"OLEI4qLWel-kRYXAb41ulQ":{"text":"My friends and I decided to try Fharmacy after a fun time at the NOLA Zoo. We craved some ","useful":0,"cool":0},"aFDC0LZ9lF_LtV5oPf0waw":{"text":"This is a gem! I had the club sandwich and substituted a salad for the fries as I wanted t","useful":0,"cool":0},"pOA5zEIdxtV5nEzEiUUqgA":{"text":"I finally made it here and it did not disappoint. The jalapeño burger was amazing and the ","useful":0,"cool":0},"u0AJMmm78Dav9Fh2zvRaQg":{"text":"I went there with some co-workers... They enjoy the place. I didn't see anything which wou","useful":2,"cool":0},"ZpPxu_VkULsulyXqvBP1Fg":{"text":"Dr Tan is a must, Italian beef combo is great! The boudin is the Best in New Orleans. It's","useful":0,"cool":0},"D7Kb19Icjzw2sF90VwnjbA":{"text":"This is actually a shotgun house now a restaurant. Tiny front porch, picnic table out fron","useful":0,"cool":0},"7u5JTkLZitKtVfsG_BvfrQ":{"text":"Sometimes you read the stories on Facebook.\nAnd you read the reviews on Yelp.\nAnd you get ","useful":2,"cool":0},"HU4F1EW4cR2yeu-_-PM4Zg":{"text":"Farmacy is easily the Best \"Housemade\" burger    one could find in the entire New Orleans ","useful":1,"cool":0},"IYl0jzIpJL1UNEVV27aQgQ":{"text":"I really love Fharmacy for a couple of reasons. With it being off the beaten path, parking","useful":4,"cool":0},"bXrPV7zbZbQEn1JZQlLNFA":{"text":"Cute place - cool old renovated shot gun house.  Family friendly.  Got very crowded.  Food","useful":0,"cool":0},"_PioEC0opGH6eJek45rkYA":{"text":"A coworker of mine insisted I give you all another shot. So glad she did! Food was great!","useful":0,"cool":0},"xzGkVPyi8BEopicgHJGHyQ":{"text":"Best Burger in the City!   I can't say enough good things about the food here . The staff ","useful":1,"cool":1},"Qyq7O8EU-OE_XN8Uk4URlg":{"text":"A bar that serves good food? Count me in, especially when the service is great too! Locate","useful":1,"cool":1},"_wAGV0x6WICshAoI692QPw":{"text":"Delicious food and great chefs! We came in for lunch and sat at the bar. Chefs were very f","useful":0,"cool":0},"TEXV-YLAInpr6W8emzVx5A":{"text":"Came here for the first time when I was stuck at jury duty!! I am now a regular!!! I am a ","useful":0,"cool":0},"5XexoHOBqXP3X81MgHyR5g":{"text":"The food is exceptional, but what really sets this place apart are the co-owner cooks who ","useful":0,"cool":0},"CYUdhlXGxI_sES-nG1kpMQ":{"text":"I gave them 2 stars because we have been here several times. It was always soooooo great, ","useful":0,"cool":0},"s0BG6Uo0vV4Kgueg_VR24Q":{"text":"This place should only see 5 stars. Best burger I've EVER had! 95% of their products are m","useful":0,"cool":0},"5ub1PI-RJDdP4Sb5A2zGCQ":{"text":"A co worker recommended this place 2 months ago and i didn't go then. Today i was in the c","useful":0,"cool":0},"Fj6dzV9KOS7Hshmru2lnhA":{"text":"This place is slinging nice sandwiches and huge burgers.  The prices make this place a pre","useful":7,"cool":6},"_RtNKqzvzVjSIq-wzyZyJw":{"text":"Mussels and fries were amazing, and my husband said the burger was awesome. Super friendly","useful":0,"cool":0},"ffqWKlPGfvGkAyUA1L1-9A":{"text":"This place came highly recommended by friends. We ventured out one afternoon to give it te","useful":5,"cool":2},"5J_eCr7JN1P4bVHV-beLHQ":{"text":"I think it's the best burger spot in the city. My favorite is the California burger, but t","useful":0,"cool":0},"FH3pkGyc8gFSrQ-UPMNzGg":{"text":"Fharmacy Nola has been all of my Yelp feed lately, and so I decided to give it a go last n","useful":0,"cool":0},"hwv2AO9-Oh1v3FwXrH_WGg":{"text":"Is this place fhreaking real?!\n\nHubby and I were bummin' around and checked Yelp to see wh","useful":12,"cool":8},"E2FYUkpmxw7UjCJqVgHLcQ":{"text":"A simple vista el exterior del restaurante parece una casa familiar pero al entrar es defi","useful":0,"cool":0},"Fb3O9bmXAJ-mXj8ZfE2HXQ":{"text":"With all the food we have in New Orleans, we still go here every Saturday. Best burger (Dr","useful":0,"cool":0},"GIrgRipOpM6-IGn8m7WEWA":{"text":"You can't go wrong here! We ordered the boudin balls, lemon grass wings and the er wings. ","useful":1,"cool":0},"PliB3fSGDoQAPB_WJXSRtw":{"text":"Originally our dinner plan intention was a grilled cheese, but due to odd hours and Taste ","useful":3,"cool":1},"oGr11ulUkxSv894kwBn1RA":{"text":"Home of the best burger in NOLA. The creators of Namese have opened up an American food ca","useful":5,"cool":4},"4cPMZyxprJSO6hEgW4dGmw":{"text":"Loved, loved, loved the burger. Voluminous, tasty, big. Not the place for chicken. Not wha","useful":0,"cool":0},"6FCAh5yJa0rN_CBBPAG8eQ":{"text":"Fharmacy has the best burger in New Orleans. They cut, grind, and pack the meat in house, ","useful":0,"cool":0},"9f8zF8rykSfnCTfX-gXD3g":{"text":"The food was good, but the service was a little slow today. But I liked the staff and I wo","useful":0,"cool":0},"P3CyQHMhWxATRqFuVuuiHQ":{"text":"I agree with many fellow yelpers, Fharmacy Nola has the best burger in New Orleans.  In fa","useful":7,"cool":4},"8M7OUYvhlmysWEQk5ua_6A":{"text":"I love a place that makes you feel like family. Fharmacy makes you feel that way. Everyone","useful":1,"cool":1},"O0_bHx6QD78NdaKDsdwzjA":{"text":"If offered tots with my burger I would've said yes....\nFood was great here....my second vi","useful":2,"cool":0},"ZvMwIUk_S9E5kvjTd418sA":{"text":"I had been referred to Fharmacy Nola a few times for their burgers & fries, but never had ","useful":0,"cool":1},"SceFQN95Z8u_Vk4Od5M97Q":{"text":"Y'all they have this veggie wrap that is AMAZING. Filling and delicious and the mushrooms ","useful":10,"cool":5},"plldak25GpPOeF8Zmp75EA":{"text":"I really enjoyed my lunch here. The outside looks a bit sketchy but don't let it scare you","useful":2,"cool":2},"tCTl4pDMwfc4WcLUIYdqSA":{"text":"This was a hidden gem the food was great what a variety if great foods and beer.","useful":0,"cool":0},"JeXwKtWLeyVqKcr2Y2sBEg":{"text":"Italian beef sandwich was da bomb!!! Must try it and the chicken tacos are amazing mussels","useful":1,"cool":0},"c4rl5YUJt3CzDmrJ_DsvxQ":{"text":"Food is always wonderful! Chefs and super sweet. Feels like your in a friends kitchen eati","useful":3,"cool":1},"B2M4x7v5_NBzSeYbWu75Ow":{"text":"This place is bomb! My bf & I were still full from lunch, but what we did try was deliciou","useful":1,"cool":1},"THp0rsEgLDNFs3v0P-hEzw":{"text":"YUMMY YUMMY IN MY TUMMY is all I have to say. The patties could have gone a liiiiitle long","useful":1,"cool":0},"ggOdZDj2eJ7kjlTYKWL_hA":{"text":"Hi my name is Emma and I love this place! 5 stars, Francis and I eat here all the time woa","useful":0,"cool":0},"e2QtKCQcwW1RnbXFbLQPYA":{"text":"Wait time was a little long BUT great things are worth waiting for.  Burgers were big and ","useful":0,"cool":0},"T7Bz0xsUavCTBfXvdScBvg":{"text":"Seriously the best burger I've ever had. In my life. This place is an absolute MUST visit.","useful":0,"cool":0},"_6vdVlpeH_FGVyXrbbyCPw":{"text":"Holy crap was this good. \n\nThe bacon was insanely crispy, and burger was seasoned well, an","useful":0,"cool":0},"TeqsN1ihTplvq4u1z9ALbQ":{"text":"My second time here so far. First time, I had the burgers but this time around I decided t","useful":3,"cool":2},"ilk-Yd1nxpsgzmcOnyp_GQ":{"text":"Hands-down one of the best burgers I've had in a long time. Fharmacy burgers do not disapp","useful":1,"cool":0},"e_gvpbdDUyZyGUBCwkoavA":{"text":"If I want a burger, Fharmacy. If someone asks me for burger suggestions, I tell them Fharm","useful":2,"cool":0},"HAXJg-wuVyjatRi7ioqOJQ":{"text":"New Orleans, Louisiana ---\n\n\"Fharmacy\" is a \"Run-A-Way Bill\" Favorite eatery.\n\nThe food (q","useful":0,"cool":0},"lA18S3R_zN85w5guWi0QLg":{"text":"Amazing flavors. Not a burger person but now I am. Sat at the bar and it's a cool hole in ","useful":0,"cool":0},"3jTHn3UJUXMlrKIz5ZqeAQ":{"text":"The food here is really good--heavy, but good. It all seems appropriately priced. They mak","useful":2,"cool":1},"heVGXY5kPJfR7vbrn6IDJw":{"text":"A gritty but gooood dive that is basically a restaurant made out of an old house.  The ser","useful":2,"cool":1},"-Q9gZnEJoZDWaR28pIykgw":{"text":"The space is small and definitely not fancy but who cares? They make some of the best burg","useful":0,"cool":0},"iEJ_yaI_8Ik5Q5rRYFFNhg":{"text":"I have to say this is my NEW FAVORITE BURGER  place!! We also had the mussels and fritter ","useful":0,"cool":1},"xoVdrOBMryx1HuMKyjF96A":{"text":"Seriously.... and I mean really .... the best place I've been in a very long time!\n\nThe ow","useful":1,"cool":1},"gEaDVx5gogNexXufnaEOSA":{"text":"Funny name. Awesome burger.\n\nWhen my friend Charles says a place has the best burger in Ne","useful":9,"cool":7},"I63pbb-MOs92UktQxjKSvA":{"text":"Hands down one of New Orleans hidden gem burger place. I tried almost everything off the m","useful":0,"cool":0},"E3Q6hxuMQLSqX72IRHr65g":{"text":"Sometimes I'm feeling massively carnivorous, and I can't quell the meat eater in me until ","useful":33,"cool":28},"YtRlsfVv2GQR5lXoSSx2lQ":{"text":"How many times have I passed Fharmacy and never stopped? Too many times. And that's my fir","useful":2,"cool":0},"tBz670uHD4dlEuvxdkf2ZQ":{"text":"I was super excited to try this place because most of its other reviews are bomb, but I ha","useful":1,"cool":0},"djAFyFBT0XHoFt0pAwgg5A":{"text":"As tourist we were a little confused on where to go our first night in town, we found this","useful":0,"cool":0},"kcg1DUfOnby1NIyOWI6t7A":{"text":"The food is great along with the choice of music. For any burger lover this is your place,","useful":1,"cool":1},"XPI_Q91t3KfpQMNd8oi_sg":{"text":"Incredible food and great service. Friendly staff. I had the chicken wings which were grea","useful":1,"cool":0},"hUZHcBKrz_7NKprLKdigCA":{"text":"Fharmacy NOLA is my go-to for a burger in NOLA! Everything here is 100% fresh...absolutely","useful":0,"cool":0},"gCS_V5PGPkGIw7Gq1TXbBA":{"text":"Fharmacy burger and the classic burger were both very good. Nice thick hand formed burger ","useful":0,"cool":0},"8Arw1qsKoU0blda0EGJg3g":{"text":"I absolutely LOVE this place & I adore the staff! I can't get enough of the Garlic Parmesa","useful":0,"cool":0},"9eyVPigQCKHY2laeSZuOIQ":{"text":"Very few places get a 5-star rating from me; this place is one of them. 1) The guys that r","useful":1,"cool":0},"D_0OysLI_AhD3a84cMme9w":{"text":"Everything was super good  the guacamole really did it for me on the Cali burger. Also the","useful":0,"cool":0},"PbXqwDwgG83Cfp9qLPF9SA":{"text":"Fharmacy's burger is fantastic, really diggin' the food. The remoulade here is very addict","useful":3,"cool":1},"Z04MqlzxGoiS1BlfXGTcBw":{"text":"Went to Fharmacy on recommendation and was pleased and would happily go back. The place is","useful":0,"cool":0},"kssYxtwjxV85YjtYmogAtQ":{"text":"BESTEST BURGER IN NOLA!!\n\nYeah, I said it ^.^!\n\nLiving in NOLA, there's plentiful of burge","useful":6,"cool":3},"Qxp3iEkwuDhQuS8qdpnpbw":{"text":"Immediately greeted with great spirits and great food! Terrific service and original recip","useful":0,"cool":0},"FI3VdA1EY-qaSYIUqZQ6rQ":{"text":"I read the reviews ahead of time and knew I would be trying a burger.  I will say that as ","useful":0,"cool":0},"febk9FdQB5pNTB9ZySScHg":{"text":"Had been intending to try out Fharmacy for a while now and yesterday we finally did. I had","useful":0,"cool":0},"VHhMcAjz4XBcQzL-nJsHUQ":{"text":"Good burgers and friendly accomodating staff! Very casual dining, with a full bar and TV t","useful":3,"cool":0},"dF7mxN_P6ma_kassPqesOA":{"text":"I'll be back! They're in the spot that used to be called dis n dem; at the end of banks. W","useful":2,"cool":2},"xyGVB1IPH4cEcfKGAotd3g":{"text":"Such a typical low-key, unassuming PERFECT Nola foodie spot. In this shotgun house turned ","useful":0,"cool":0},"PbW0FnBbf7Efr3Vofq58pQ":{"text":"I have been to Pharmacy Nola 4-5 x's now. It has the Best Wings I have ever eaten. Everyon","useful":2,"cool":2},"c3sdnaQpVC4gTgoYDoGeLQ":{"text":"Definitely a hidden gem!! The Dr Tan burger is a must have! Oh and how could I forget the ","useful":0,"cool":0},"EU4vocn7kbLPGoH2U0gxgw":{"text":"Great food and service, maybe the best burger In town. Would be 5 stars but every time I s","useful":0,"cool":0},"L9QNcaXbshBjViX1toyUYw":{"text":"This place was an unexpected diamond in the rough. I was a little worried by the location ","useful":0,"cool":1},"jjSYuZhkaE-DwfJVLSEoHw":{"text":"Wow ! Everything we ordered was amazing ! From salad with Asian dressing amazing good , to","useful":0,"cool":0},"mAV7uttbPEBj24tfvfaNLQ":{"text":"I've waited way too long to come here! Truly the most amazingly fresh burgers! My hubby go","useful":0,"cool":1},"03-lIpZSIu0KQmEw7GlTUw":{"text":"Hands downs the best burger in new Orleans. But if youre not feeling a burger the wraps an","useful":0,"cool":0},"B-GnreRwb-nuwDAb_0SL7w":{"text":"I saw chef Chien Nguyen on Fox8 local morning show. Chef Chien impressed me so much , I de","useful":8,"cool":9},"5s-zL2fUO_IXQFE-uFLZjA":{"text":"Hole in the wall/ dive certainly gives this place justice.  Started with some boudin balls","useful":1,"cool":0},"woGD1nZMukN9dvzlSi21hg":{"text":"Amazing! Amazing ! Amazing they have great food here! Wings? Out of this world! Burgers? B","useful":0,"cool":0},"pbnSpHH2okHs42o4bPkGlQ":{"text":"Wow. Okay, where to begin? Fharmacy is pretty amazing on multiple food levels.\n\nWe were he","useful":14,"cool":10},"KC_ibQwQ7K54JVRK1aEayQ":{"text":"Updating review as I finally branched out of my tried and trusted and got something new he","useful":3,"cool":2},"NeVppbwSodVX6HH5qe1xMA":{"text":"The red dragon wings are great but very very sweet. Personally I enjoy sweet but if you do","useful":0,"cool":0},"0nrh5nRcWIrYUe0ifdTiPQ":{"text":"Shout out to Fharmacy burger! The burgers were huge, juicy and cooked to perfection with t","useful":0,"cool":0},"3bH-nghv13hAARkvainc5w":{"text":"I LOVE this place. The food is amazing. The wait staff is so nice. We've come here a few t","useful":1,"cool":0},"fXVUFQ89lrmSGooIDyvrWw":{"text":"I must say this is the best burger that I've had in New Orleans!! The best wings and best ","useful":0,"cool":0},"G_2Qn0Mx_GGsy2NMciK_lg":{"text":"Best salad ever! Who would have thought to make a salad with steak and frites? So yummy! I","useful":1,"cool":0},"vCeSa0sr1NlqyokpsXk7Dg":{"text":"My visit to the Fharmacy was a bit of a let down. It was not what I was expecting based in","useful":4,"cool":2},"48HWjHfmxo6G82dA1ULtxg":{"text":"Best Mussel & Frites I have ever had!! \n\nMy boyfriend and I went to Fharmacy for the first","useful":0,"cool":0},"X8ZnA3Hv7Tz8MEeRKMp2uQ":{"text":"This is the coziest hole in the wall restaurant. Definitely recommend sitting at the bar f","useful":0,"cool":0},"rdjmiqfFGD5i-Hk5cpAftA":{"text":"After a regular day at work, I was starving. My husband was starving too.. so we decided t","useful":0,"cool":0},"wPbRcMmc_-eRXLlKqkKX9w":{"text":"They have Friday specials and Taco Tuesdays. The frog legs were part of a Friday special (","useful":3,"cool":2},"p1j6q8TgGGqg1vnDNi0oXQ":{"text":"Love love love it all get the special icu wings if you enjoy a torturous heat to humble yo","useful":0,"cool":0},"-ZwYyf0XG2Ta6CxW2js7WA":{"text":"I came to NOLA with friends for spring break and this was the first restaurant we went to.","useful":0,"cool":0},"Awb895V8TMp_DzYcyS6Ppg":{"text":"An unexpected find. The Doctor Tan's burger was perfection  and the Farmacutical Grade tat","useful":0,"cool":0},"h26W6O_W0a5-CWXpHBhD9g":{"text":"Best wings we have had in the city by far, dive bar atmosphere with awesome service, genui","useful":0,"cool":0},"SF_w4WbcV715pMDJ9N4byQ":{"text":"Update!  Went back and can say - AMAZING AND STRONGLY RECOMMEND!!!!\n\nThese guys have it do","useful":1,"cool":1},"5htuVDpWQsleoWPWc5uHzw":{"text":"Freaking amazing food and customer service. Loved sitting at the bar and watching the cook","useful":0,"cool":0},"g8hrSDvs9SScYHZSzvqMfA":{"text":"Best burger I have ever had. Great fries and sleepy is a great bartender. Gave us shots to","useful":0,"cool":0},"xZzsPNZa5HHsY8M0kkBEDw":{"text":"The best wings ! & dont get me started on the burgers !! Soo yummy ! Deff coming back for ","useful":0,"cool":0},"HLCN0op0wEnlT-2GtLlylw":{"text":"Fharmacy is in a converted shotgun home which sounds quaint (or gentrified - your choice) ","useful":0,"cool":0},"9tQULyfxcWnb25uq5C4qlA":{"text":"My first day in New Orleans, and this is where we decided to stop at first. AMAZING!! Wait","useful":0,"cool":1},"tdjk4Cu0KcB9TMZOKLzpQg":{"text":"So... third time is a charm, right? After my first two attempts, my husband suggested that","useful":0,"cool":1},"8AdPCQ_9N_bTdBacfA3vhQ":{"text":"I came to the restaurant and sat at the bar area. The staff was very personable and made m","useful":0,"cool":1},"NQloaoQnzELMYDUEGKcE6g":{"text":"Worth the hour and a half drive. Everything on the menu is great. One member of our family","useful":1,"cool":0},"LHsf2IC5hcZt41Cp3uHILQ":{"text":"Exceptional burgers.  My husband had a fharmacy burger with fries and a yuengling beer. I ","useful":2,"cool":1},"hFI1h6EK00QUqERY0vE80Q":{"text":"Fantastic Burgers. Our group sat at the bar near the end where the chefs prepared each ord","useful":0,"cool":0},"xISGZRYTE9SUDb6TXai3zQ":{"text":"This restaurant is amazing! Recommended it to my moms book club and they will definitely b","useful":2,"cool":0},"o81YFpQthCr6NQKgs5hkpA":{"text":"Second time we ordered through the Waitr app. We had zero issues the first time and were s","useful":0,"cool":0},"00k1wHHBaQAdSXEjf6zOaA":{"text":"I went here for the first time with my husband at about 7ish on a Saturday night. After we","useful":0,"cool":0},"8SbWxDD_95LOpiwvqV5_6g":{"text":"Love this neighborhood place. Food is incredibly flavorful. You can watch the chefs making","useful":0,"cool":0},"ARpbRS1QNjVc96yGTk6NZA":{"text":"It was my first time visiting NOLA with my boyfriend and friends. We were really hungry on","useful":1,"cool":0},"e1ncVUzxtp-M48-hw1j-VQ":{"text":"I was in NOLA with a group of friends (most hadn't been to NOLA before) and I wanted to sh","useful":2,"cool":1},"iIOhJk5zmYn7q7yf6HDFGg":{"text":"One of the best burgers in New Orleans. Everything I have tried has been great and I have ","useful":0,"cool":0},"n9NHyX8HwXj48n3eO3IqLg":{"text":"I love this place!!  I have only ever sat at the counter, so I can't speak to table servic","useful":1,"cool":1},"A58GK-ef1mSaOxDl-o-Mzg":{"text":"Everything on the menu is worth trying. The mini meat pies are delicious. The lemongrass w","useful":0,"cool":0},"0TSnaGcXTRLiFCuJRfElLA":{"text":"I am slowly but surely eating my way through this menu. I'm about 1/3 done (i'd have more ","useful":11,"cool":9},"qM_HdAFd2apzXJ0EniTeBA":{"text":"We had an amazing eating experience at Fharmacy Burger.  I got the lemongrass taco and my ","useful":0,"cool":0},"_FP79FXpxmMo9tXfAULkfA":{"text":"First time going to Fharmacy Nola, and everything was outstanding from the service to the ","useful":1,"cool":1},"wyCIROYaoHLFXrl5XYJzpA":{"text":"Food is great, but i don't appreciate getting cursed out by the staff bc they forgot Cali ","useful":1,"cool":0},"2z2SW2I6W226GDTkSM-Ksg":{"text":"I really wanna drop four stars on this place, however, I cannot because of the mystery in ","useful":1,"cool":0},"daGt-PMvVdp71Jd1cOrzvQ":{"text":"​Fhamacy is nestled in a neighborhood on Banks street not far from the massive University ","useful":5,"cool":4},"7tVZQN60inlP8ePx9zcQTw":{"text":"AMAZING, I COULD EAT HERE EVERY DAY. \n\nFirst of all, what an amazing staff! The service wa","useful":6,"cool":0},"lsviaBIeclebyNqi2sKQxg":{"text":"Fharmacy Nola has been on my to-do list ever since I moved the neighborhood a month ago, a","useful":1,"cool":0},"Zw62O59Bh7Ir6GXQytOf6A":{"text":"I stopped by for lunch and was serviced quick. The food was delicious and the staff was am","useful":0,"cool":0},"MXy7-p2Xu2Cdl8dF9Y-Rdw":{"text":"This was our first time at Fharmacy. It won't be our last. \nWe started with Cajun Mussels.","useful":1,"cool":0},"lwlmUaeoj0ZgcwunpYG4Og":{"text":"Wow - glad we went back!! What a great menu - and our new favorite place for HoT Wings!! T","useful":2,"cool":0},"tJ21YpC5RyhGn2D_wvI53A":{"text":"Mussels - it tasted like Vietnamese curry. Kind of coconut-ish\n\nWings - I like the garlic ","useful":1,"cool":0},"7fvZd5D4E9pEYZ2AOKoBjQ":{"text":"To be able to keep fries this warm and crispy 20 minutes after picking up my takeout... is","useful":0,"cool":0},"fd6UoEXINXUj8guUCOwcRg":{"text":"Wings were amazing. Burgers were okay bc they were salty but I would come back for their l","useful":0,"cool":0},"Py4HF8vLoHgC6IXR7SpP6w":{"text":"This was my second attempt at Fharmacy. The first time around I placed a to-go order, whic","useful":1,"cool":0},"n7Q1dUpMBz-Z3pJfDT9IPQ":{"text":"I ordered take out and it took an hour for me to get my food. I was told it would be at le","useful":2,"cool":0},"BQGYw_fRedFpz5Zr_qwa_Q":{"text":"I literally cannot stop thinking about the Vietnamese Lemongrass chicken wings.  That's al","useful":0,"cool":1},"CRD275rMAt5WSNvOvKtWBA":{"text":"OH MY GOSH i can't wait to eat here again! My brother suggested I try because he works nea","useful":1,"cool":0},"cj00-dR3_oIiaweQjzLEBA":{"text":"I've come twice now and am very happy with both experiences! So glad that the eatery that ","useful":13,"cool":6},"lfQaMnptDMorEg6AyJLPNw":{"text":"Wonderful food and service. The boudin balls and pharmacy burger are a must! TRY EVERYTHIN","useful":0,"cool":0},"oaDd_g84bhVO2kZRmBAENg":{"text":"I've been hearing awesome reviews about Fharmacy Nola for quite some time but had never ma","useful":1,"cool":1},"UhYDEgpembjlFucNoUGXRA":{"text":"I've been wanting to go to Fharmacy Nola ever since I had their wings during the Wing Wars","useful":0,"cool":0},"A_aGJmlpn5uoX4wfUxc77A":{"text":"Service was terrible, no drink refills offered until meal was done, no coming back to see ","useful":1,"cool":0},"6siVVVLM3VktGnHBPL8JKw":{"text":"I must be on a bad luck roll with eating out. Unfortunately, Fharmacy you did not impress ","useful":3,"cool":1},"1tBj4a7Jz4NMTrSSUMHTAQ":{"text":"Definitely the best burger I have had in a while!\n\nI'm not usually in Mid City but I came ","useful":3,"cool":1},"M86l4LyGr8mNy0T-VoFqUw":{"text":"Nice staff chill place burger was good!","useful":1,"cool":0},"bwPUu6f4qHXT3wMbLsn5RQ":{"text":"Incredible burger and fries.  \nLove this place. \nVery cool vibe. \nGood selection of beers ","useful":0,"cool":1},"lml_lL-ZnQvIhTowHd0_kw":{"text":"Easily one of my favorite restaurants in all of New Orleans.  An Asian/Latin/Cajun/Creole ","useful":4,"cool":2},"dTiSAS_xLIo_7pgwz9l9EA":{"text":"Used to be great, but seems like it's on its way out. The menu becomes smaller, the food l","useful":2,"cool":0},"z17rqobLVK7cfQDjqNvABQ":{"text":"Definite a must have! I've wanted to try this place out for a year now & the chance finall","useful":5,"cool":5},"zxf7mxlP04OItoPPDfThig":{"text":"When we walked in, we noticed that this place was packed! That is always a good sign. Ther","useful":4,"cool":1},"RyHZaGhUuvam-A0IOcLqWQ":{"text":"This is great food at an affordable price point. Love the Italian Beef sandwich.","useful":0,"cool":0},"jfgioiQcihH1ssZRe_rjrA":{"text":"One of New Orleans Gems! I loved the wings. The lemongrass wrap was not my favorite, but i","useful":0,"cool":0},"xcUMS2UcM_Ff-wcs9WYRpw":{"text":"I had a little date night with my sweet hubs Saturday night and we chose Fharmacy, based o","useful":15,"cool":11},"U_ot5qbPRnOFSL0zWlsnuw":{"text":"I went here for the first time for lunch recently and this place was so cool. They remade ","useful":0,"cool":0},"qLTk9htTc73H29qw2369mA":{"text":"I ordered the Cali burger and added an egg.  Super tasty and good!!  Huge 8 oz patty that ","useful":1,"cool":0},"__zSCCAgTci6oHD9ldhevA":{"text":"Came here for a quick lunch between classes one day to see what the hype is about. Their m","useful":3,"cool":1},"U_v4UhhKdeFs2fe7iWaH8A":{"text":"I believe they took over dis&dem. It's pretty small, but they have outside tables that can","useful":13,"cool":10},"aQBBmXo9HVtyXg9q5qFkUA":{"text":"This place is legit. Fixes all the cravings you can have from looking at this menu, my top","useful":0,"cool":0},"fIhw427YokRfq30OwrZocQ":{"text":"I was sleeping on this spot. But lemme tell you, these wings took me to a whole 'nother le","useful":1,"cool":0},"iMNrG8wZ29vSv5nGBiTF6w":{"text":"Delicious burger!!! The meat is freshly ground and well seasoned. The place is a dive bar ","useful":0,"cool":0},"uzikD-ypcNaCqupw9Hm5zg":{"text":"Finally was able to try this place out. We order the garlic Parmesan wings and they were f","useful":1,"cool":2},"EwKHeAEU5vvwH8OGA5vx2A":{"text":"I had the Dr. Tan burger well done jalapenos on the side, the lemon grass chicken tacos an","useful":3,"cool":1},"CNYjS00CcZepAgd7bIUe9w":{"text":"Fhantastic food! We stumbled upon this place because it was across from our AirBnB. The fo","useful":0,"cool":0},"XLVulebXkhPTsWH10_uFXA":{"text":"Amazing burgers and fries! I got the Dr. Suess burger and Cajun fries. Best burger so far!","useful":1,"cool":0},"c95MZzBrchJiXvruKhWxnA":{"text":"We came here for a quick dinner. The red dragon wings were delicious and spicy. My husband","useful":0,"cool":1},"-maxKF0YkyF_I9PFvgPUiA":{"text":"Everything. On. This. Menu. Is. Legit. \n\nYou can't go wrong with anything you want to orde","useful":1,"cool":1},"cm0VKdv6s7eMUrvZaIXqsg":{"text":"This has become my absolute favorite hamburger in New Orleans. The chef is wonderful. Sitt","useful":0,"cool":0},"9DJ2nTZQARETzSfdhjlxbg":{"text":"Everything, repeat EVERYTHING, about this place is fabulous! (I'm really picky, and I don'","useful":1,"cool":3},"ZxNTtjxWz0oOqHsMZUc12w":{"text":"Got the lemongrass tacos. They were fresh and tasty. The sauce was a little too spicy but ","useful":1,"cool":0},"5_uoMenT553eRb6TjfPBHQ":{"text":"Fharmacy was a really pleasant surprise. Not gonna lie, we just ate Willie Mae's right bef","useful":3,"cool":1},"f9BiJVUug4bPsU_vorVqiA":{"text":"I have been wanting to go here for some time but my hubby has been pushing back. Tonight w","useful":2,"cool":2},"TwMDbHZOXW7Gfzn6BoADHQ":{"text":"Love this place. Try to hit it one or two times a month. For anybody that's complaining ab","useful":1,"cool":0},"bpLACbieOS5hM71JcwOaLg":{"text":"No regrets! I'd call this place a \"hole in the wall\" my friend was like \"it's that yellow ","useful":0,"cool":1},"wx4MoDDDrv9OQOqWePRzxw":{"text":"I like many others had heard great things about this place. 3 of us went in for lunch, pla","useful":1,"cool":0},"BqoIoMvye9hBKwdlcc-yJA":{"text":"Farmacy amazing. Call it cajun viet nola food. Great staff and service. Decent prices. Wor","useful":2,"cool":3},"eFimv7E9mENFjSmb1qvTEg":{"text":"BEST BURGER IN NEW ORLEANS!\nFinally a consistently superior sandwich. The \"Fharmacy\" start","useful":14,"cool":6},"u51ZU4z8rhDn9URQZhBAjQ":{"text":"Absolutely delicious food and amazing service! We came in with a family of 6 and there cle","useful":0,"cool":0},"UlTlfxEre77G69L6wzyPZQ":{"text":"Wow that cali burger was AMAZING. Usually I'd say no burger tops my dad's homemade burgers","useful":2,"cool":0},"2knEEF5IElOTf_LihoNrPg":{"text":"Had been intending to try out Fharmacy for a while now and yesterday we finally did. I had","useful":0,"cool":0},"JzaOy3M-Pt18FJgYNrqGVA":{"text":"This spot definitely has some COOL Burgers! I had a burger with avocado, bacon,and cole sl","useful":3,"cool":1},"WeqYtUivbJvm_dT-iOe6OQ":{"text":"Seriously, this place is my favorite. The staff's professionalism and kindness alone is en","useful":0,"cool":0},"OhGvany0ntdM-WlIt2Z5fQ":{"text":"The food is very good. \nI had a mushroom Swiss burger which comes with perfectly cooked fr","useful":2,"cool":2},"MSRbu89yviiKvZrkzQhE5Q":{"text":"If you want a burger... EAT A BURGER. Y'all!!! These burgers were so good!!!! The wings ni","useful":1,"cool":2},"3t9Oq7G8vnZKwUt13bj4NQ":{"text":"This is consistently the best restaurant you could ever eat at in NOLA, and that's saying ","useful":0,"cool":0},"u1xexSJRX8DyDA1S1cdQAg":{"text":"The food here is absolutely amazing! I went the other day with two other guests, and every","useful":0,"cool":1},"HYDtvPFt6CjWDZZfYsxrhQ":{"text":"I loved this place! Got two burgers (the Fharmacy burger and the all american)to go and th","useful":2,"cool":1},"-ouhWOhoMhRosMVR9pJ2RA":{"text":"The best Italian beef and sausage combo outside of Chicago.  Just right amount of spicy pe","useful":0,"cool":0},"oM0E_0fLe6Nej0xGcTnALw":{"text":"I have been hearing for years \" you gotta try the burgers at Fharmacy\", and I've tried a c","useful":3,"cool":1},"Bt_zpGGhzyiMbWCRFWopRQ":{"text":"Walked in on a Monday evening and the place was quiet and empty, within minutes it got bus","useful":1,"cool":1},"3akt0pk6HALa8VawerCI5A":{"text":"I don't know why it took a pandemic for me to finally try Fharmacy but WOW IT WAS SO GOOD!","useful":3,"cool":1},"dxN-uNvURxh6LKj4pXd5cw":{"text":"Pretty cool looking place. Only passed by to try out the ER and ICU buffalo wings and they","useful":1,"cool":0},"fCIpNLCuEf_B7-J3vBDi9g":{"text":"Best burger in New Orleans! Can't wait to come back. Also got the Boudin balls which were ","useful":0,"cool":2},"ks3fmTJUKoLxZoDVwUZi9A":{"text":"Damnit man...Prior to today, I absolutely loved this place.  The burgers are always good, ","useful":7,"cool":1},"B40zN_hWoeUTJNb5zySdHA":{"text":"This place is doing GOOD things.  Halfway through their giardiniere burger I thought to my","useful":1,"cool":0},"7OobFIZikMgY2SGefhV0uQ":{"text":"Decent place. The outside of the building doesn't look great but the inside looked nice. H","useful":0,"cool":0},"hOjHFQHAPFhw4pD_3HMsnQ":{"text":"VIET LEMONGRASS (4/5, $9): Viet lemongrass (loove the cilantro, too) base flavor, added NC","useful":8,"cool":6},"1ZmEMafFUcG2jxldhNRaGA":{"text":"Oh my goodness! What a hidden gem! The space is small but the food is worth it! \n\nGive the","useful":1,"cool":1},"QCsw0lxV_-5QjBBWTzvlSA":{"text":"I previously said company burger was my favorite burger place, but I think Fharmacy Nola m","useful":1,"cool":1},"Vm42H7MXP3xJlm6_tL6__g":{"text":"I went there last night with a friend for his birthday. They got one of my friends orders ","useful":1,"cool":0},"z-VusOeuxWYU5WlWvfUZFQ":{"text":"This place is a pretty rad neighborhood spot. Good food, pretty sure there's msg on the fr","useful":0,"cool":0},"P2fV9D2azlpAQVhmGhQd1A":{"text":"Omg this was highly recommended by a friend who comes to NOLA a lot for work so we had to ","useful":1,"cool":1},"hR_8vtK7g4z2nIIf04XI_Q":{"text":"Came to visit NOLA for some good beer & flavorful food & that's what we got. It's a quaint","useful":0,"cool":0},"lM1J4FB0CyiRD6pBVKaFlg":{"text":"Love and miss my food and drinking hole. Warm inviting, felt like I stay forever. Relaxed ","useful":2,"cool":2},"-oZgRfcdNR7AhYlRYvVNig":{"text":"I love this place. The atmosphere. The employees. I'm giving the stars for that, however, ","useful":0,"cool":0},"4lQbR4415gL5aHvkyXCi4g":{"text":"Our favorite place in Nola for delicious bar food!\n\nWe have been 4 times now and the food,","useful":1,"cool":0},"ah_DNxQ0byV7BpZ50yRAAQ":{"text":"I read really great reviews about this burger joint so I went to check it out.  I will say","useful":0,"cool":0},"gCh7PhDHHzkAUR5VyKDYtA":{"text":"Damn y'all, this place is G O O D!!! Annual holiday supper with one of our out-of-town fri","useful":9,"cool":8},"QY8MTJCz1l8W_z2b5IziBg":{"text":"I had the Dr. Tan burger and my wife had the Fharmacy burger both were so amazing, if you ","useful":0,"cool":0},"tnkCeRn6MlySGnMzD-rUpA":{"text":"I have been seeing sooooo many posts about Fharmacy and how amazing it is that I had to tr","useful":1,"cool":0},"65OOSZz5XCwrPLzuGnjp_A":{"text":"Let me start off by saying I very rarely give anyone five stars! As a professional chef th","useful":0,"cool":0},"G883TzbnZoPljZ_efcp6Xg":{"text":"Roasted beef sandwich, wings,wraps. Magnificent. The sauces are all homemade and you can e","useful":3,"cool":1},"AShSoB9NnGd8IWObHU6Vuw":{"text":"Y'all, they do not disappoint. I LOVE their lemongrass chicken - tacos or wrap or even sal","useful":6,"cool":3},"oRMqxWbDpDU095dT-d34WA":{"text":"Casual, small and delightful restaurant known for their incredible hamburgers. Everyday th","useful":1,"cool":1},"YMDnqfE64pOGUENhDyiNzA":{"text":"First time trying.. Lemongrass tacos were very good. Lemongrass wings delicious. Taste bud","useful":1,"cool":0},"6DYxMWOrXbiQASO0OdulgQ":{"text":"I've been seeking a really good burger in Nola and I haven't found one. But I did find a D","useful":1,"cool":0},"9XPxix9zeIUlLh1xymZkQQ":{"text":"Ordered a few things off the menu. Doctor tan burger was below average. Bun was really dry","useful":0,"cool":0},"_8zq5E-HbR2_5d5tk6w5-g":{"text":"I've been wanting to try Fharmacy for awhile because I've read the reviews and seen the pi","useful":31,"cool":27},"EBEgRCSW_Y8QlkQCDjwxmQ":{"text":"Chien and Nat Nguyen do a phenomenal job cooking behind the diner style counter.  Chien is","useful":2,"cool":2},"JuprHaX7RaajANkQNUqg8Q":{"text":"We went to dinner on a Friday night & this place did not disappoint. Quaint restaurant in ","useful":2,"cool":1},"C_-DHfzgnTEyfk4lgCgR7Q":{"text":"Went there based on reviews and was a little disappointed.  I ordered a burger and fries. ","useful":3,"cool":0},"gnudamBYs_f78Z_A4jb2ag":{"text":"This place is close to my work. It's a great place to go for lunch. They have a nice selec","useful":1,"cool":0},"d1B5l-3Y9y_On9FVLFzplA":{"text":"I haven't been to Fharmacy since a few months after it opened and when a friend of mine wa","useful":2,"cool":1},"TYvKxhlnQ35W1pKRW-UnxQ":{"text":"Was looking for a place to eat with friends that was indoors so we could beat the NOLA hea","useful":4,"cool":3},"_UMBX592KhD8sZP_VNXOXw":{"text":"Born and raised in Chicagoland, I now and again crave the occasional dish. Y'know, Gino's ","useful":0,"cool":0},"OXY4o0QoOEF19pP7FiZgOw":{"text":"This should be a 3.5 star review, but I rounded up since Yelp did not have the option  \n\nT","useful":3,"cool":2},"Kyj8f0BBmeAkwFTk54Z6zQ":{"text":"This is a fun bar and burger joint that is Asian-owned and run. We loved our DELISH burger","useful":1,"cool":2}}