{"N1IWNZhs_DwzgbElhBdk9A":{"text":"In thinking about my lunch at Bub's, I can't really think of anything that wasn't great. T","useful":3,"cool":2},"aP2hTm0qQ2zyWlkDkxW37g":{"text":"Definitely a Shake Shack kinda vibe. High end \"fast food\" kinda burger. So go expecting th","useful":1,"cool":1},"rsibzYhmaZYfOHn31tm9hA":{"text":"So glad I came to check this burger joint out! I usually don't give reviews on burgers but","useful":0,"cool":1},"SU8myVTEOEhNYCnH8rNoGw":{"text":"A classic burger and establishment. Arguably one of the best burgers in NOLA! Will definit","useful":1,"cool":1},"KQH1unw74Zrg4OBACZxTpQ":{"text":"Best new burger spot in the city! New Nola Sausage Burger is great with the fries and hone","useful":1,"cool":0},"RHgTXS9yIQ4F0FQYaX7WnA":{"text":"I saw alot about this place on IG so we decided to go. We ordered the Bub burger and the R","useful":3,"cool":2},"LsaMxMg9nJps_rPZlcs4aA":{"text":"Great new spot. Burgers are very good and their brussel sprouts are even better. Would def","useful":0,"cool":0},"OiZyg7lqhZK2OFLM3fxRcQ":{"text":"Quite literally the best burger I've ever eaten in my life. This is the smashburger to bea","useful":1,"cool":1},"Q70rDDGXfbui6beN9chgJQ":{"text":"My buddy had been raving about this pop up for ages and I didn't see how simple burgers co","useful":1,"cool":1},"-Ir7NV9J2du7piMs_0uzyQ":{"text":"The burgers are FANTASTIC!! The Brussels sprouts were also amazing! The building is very c","useful":1,"cool":0},"j9uZYiUWaHjQsELN9pk25w":{"text":"Are you a thiccc burger or a smashed burger? If you're into thiccc-ys, you are missing out","useful":0,"cool":1},"ENHTEPbYbj4vSNeO9n7KIA":{"text":"Visited NOLA last week and my brother and I hit Bubs. Holy moly! This shit is soooo good. ","useful":4,"cool":6},"2yjoGIcaDmGT57dmEoSYbg":{"text":"I had the Peanut Bubber and Jelly. It was SO good. I was still hungry after tho. \n\nI'll be","useful":0,"cool":0},"4LWxpze8MAKUMqWxHBrG5Q":{"text":"Bub's NOLA is a tasty addition to the New Orleans burger scene.\n\nI love that their burgers","useful":1,"cool":0},"NHEGw4NIvSTKnXLz9v1SbQ":{"text":"The burger was pretty tasty and the the Brussels sprouts were a little too smothered but t","useful":0,"cool":0},"wkcY4PeRsJL4Vs-MMxaGhQ":{"text":"This place is where it's at when it comes to burgers! I'm so glad to see they have an actu","useful":37,"cool":33},"kubkm2EsMg5-g_aeNyBdZw":{"text":"I've been chomping these burgers for a good while now. I looked forward to any pop up they","useful":12,"cool":12},"yz0c90uNm47AUQdWfFW1QA":{"text":"Hmm, I'm all for supporting small businesses and I love a good underdog story, but what's ","useful":2,"cool":1},"Q37JeeiqQEzwJkN4wnS__A":{"text":"Great smash burgers that doesn't make you feel too gross for eating a burger! Their fries ","useful":1,"cool":0},"uh_Irz9F3B9Kn_rt8Y5aRg":{"text":"Yummy burger and fries! The Microdose was big enough for me, although it doesn't come with","useful":0,"cool":0},"vEMwVIoFs38mM7UmSQTCQA":{"text":"Great burger!  Best one I've ever eaten?  No, but still very good.  I went with the Royale","useful":23,"cool":21},"AL3rp2vpwVj09tDyAarS_g":{"text":"Stopped at Bub's on a recommendation from a friend. I ordered the regular Bub's Burger and","useful":3,"cool":4},"SZ8GvgTNdD1FuUktcyZjjA":{"text":"Very good smash burger that I can only have about every other month because I know it clog","useful":2,"cool":1},"PPg6K-zKffLg_j0SPGxakg":{"text":"Great burgers! Cool interior. Friendly staff. Got the bubs burger and it was delicious! Ca","useful":0,"cool":0},"04T7Uk7i1UmW1wM_7-R_kg":{"text":"Checked out tons of reviews and decided I really needed a burger, in the same area there w","useful":0,"cool":1},"Y54kH0tzjqbyWQiZT9Ci-A":{"text":"Holy Smashburger!!! This place was delish!! I have really been hitting the jackpot lately ","useful":3,"cool":4},"oV3zuUP-sqPoTaryB7B3SQ":{"text":"I had been wanting to check out this burger spot  for a few months, but the timing never w","useful":1,"cool":0},"9YdAfMihlECNy_iWClTolw":{"text":"Awesome Burger I was pleasantly surprised with how well seasoned it was\nThis burger was so","useful":1,"cool":0},"m_cafYiOocsZQvzdWaHzvw":{"text":"These are definitely my favorite burgers in the city! The patties are perfectly thin and d","useful":1,"cool":2},"l3VbXDbq9h4c5qiFG6onlQ":{"text":"Bub's, formerly a pop-up on the brewery scene, now occupies the small restaurant space beh","useful":0,"cool":0},"Zdf6XNnos1wNFZDQXG7UdQ":{"text":"Definitely a new favorite for me. This was my first experience and besides the burgers and","useful":3,"cool":3},"whWs48fmLa5dekmaw15EAw":{"text":"I've been a huge fan of Bub's from their pop ups at Second Line Brewery so it was time for","useful":4,"cool":3},"e-cig7G1BE0LZn2JA1D5rA":{"text":"Bub's is a great local, casual hamburger spot in Midcity. I had been to their food truck o","useful":1,"cool":1},"b8m9yN3UZbX6wVmPgIcgHA":{"text":"The Brussels sprouts were probably the best I've ever had. They were sweet but spicy, left","useful":0,"cool":0},"iGQ5ATcc_UPETu6M0uBbyQ":{"text":"Eye catching business for sure, saw the pictures of the food and instantly knew I wanted t","useful":0,"cool":0},"SWDPYRROlGGHoQUzYgGH9A":{"text":"So happy I checked this place out. Once a food truck, now  a brick and mortar location (th","useful":4,"cool":3},"XyCdyj86JQJj0l2CstQsnQ":{"text":"Don't be fooled by the unassuming storefront--this place is LEGIT. The fries are perfectly","useful":0,"cool":0},"ve6KrGysqEbzh67v_rBIvQ":{"text":"First time ordering from here. The fries were nice and salty. Burger nice size. Choice of ","useful":1,"cool":1},"l4nG5wY7RdTfhRiymFSFlA":{"text":"Bussin bussin. Very quick. Friendly service. Burgers were great. Cheese sauce is used thro","useful":0,"cool":0},"vyu0d2EGDMZIeRjvTIBn1A":{"text":"Awesome burgers... your just going to pay $$$ for them but they rival and Freddy burger or","useful":0,"cool":0},"HEi-tSmbPkWbSYJyRWvv7g":{"text":"Everything was good had the Royale single patty, Brussels and Degen fries. Service was fas","useful":1,"cool":1},"VWIpR2oRvIUoeESU8wL-AQ":{"text":"BLUF:  Good burgers and good fries. I'll go back but a little pricy. \n\nFun little place wi","useful":1,"cool":0},"qXTyxuDJagDR7Oc3GbBsUQ":{"text":"Burger did not disappoint! Fries were on point too! Even if you have to park a few blocks ","useful":1,"cool":0},"4dOuisokY1WEJSKOoQYSuQ":{"text":"We found our new burger spot!! This place is awesome! My guy and I both ordered the origin","useful":2,"cool":3},"PYrc3tUp_kKk8k9q4VcTgw":{"text":"2stars is REALLY pushing it. The smash burger style so the patties and I use that plural l","useful":0,"cool":0}}