{"5F7yh1-hmsgBvzXE2HIF_Q":{"text":"I can't believe this was my first year going. I'm really mad at myself for waiting so long","useful":0,"cool":0},"csXhXUWmM-4-KX5D5kJ1ug":{"text":"Sooo fun!\n\nGreat crowd and great performances for free?!? I have no idea how anyone can ra","useful":3,"cool":2},"YczPF16s6gdhoKqKRHhCbg":{"text":"My husband and I came for a quick weekend last May. We found this festival by accident. (T","useful":0,"cool":0},"Vf8Qg9DdsFLlh7iUKD0THw":{"text":"I don't know how people can complain about this festival.   This was our first time here, ","useful":0,"cool":1},"XokPlby1B285AW9FckVF4A":{"text":"YAAY I can't believe I am the first to review the Boogaloo!  Well it is coming up again th","useful":5,"cool":4},"CtN8NuLeJK7Z-CjvFsrcNw":{"text":"This is a cool and laid back fest that is mostly local folks.  The crowd is never crowded ","useful":4,"cool":3},"RcE-pUkqLTk1FCotiCeD0A":{"text":"It's nice walking along the Bayou St. John, and we went to the first day of the 8th annual","useful":0,"cool":0},"s5zDbFLNfLbOlZIXoW2pPw":{"text":"Great festival!  The shade and breeze from the bayou made it bearable in spite of the heat","useful":1,"cool":0},"wcqj4TMlGFYF7eTw3C5z6Q":{"text":"One of the best little festivals in New Orleans thats great because its free. The food sel","useful":0,"cool":0},"U0gdVFqeHR_8jIV6sehXAA":{"text":"A true New Orleans festival! Great music, food and art, like a mini Jazz Fest really.  My ","useful":1,"cool":1},"15-Ala9FXiCfEtDq63IYsQ":{"text":"Where else can you sit along the bayou listening to live music, while eating a Jamaican pa","useful":5,"cool":6},"RMT8oFuxzeBfxOvqjd7rww":{"text":"I've been to the Bayou Boogaloo a couple of times now, and it's a really fun festival! It'","useful":4,"cool":2},"-vPKfBYmu04oKoCfguOuPw":{"text":"On our first day visiting NOLA, one of our Uber driver highly recommended going to the Bay","useful":1,"cool":0},"B3XsPJNHNfzT5opnzGLkVQ":{"text":"Bayou Boogaloo is one of the newer festivals in the area and gets bigger every year.  (Not","useful":1,"cool":1},"VdL1o5ohgMz-oFjTsPsuBg":{"text":"This Festival was so Fun!!!! I really had a great Time. Especially my Son. He enjoyed the ","useful":5,"cool":0},"iNqSlSSLdtU2NoJeYHQ1GQ":{"text":"One of the best things about New Orleans are their uniquely themed festivals. Here in SF B","useful":1,"cool":1},"KsyjFgQ5GDoiLIFhoIaSpA":{"text":"Good time. We went late due to the heat so our favorite place was gone already (I'm lookin","useful":3,"cool":0},"7BsdMrfMyHBvSoXGewrwvQ":{"text":"Had a fantastic time in Mid City yesterday!\n\nLots of people and great food from places lik","useful":2,"cool":2},"Ow0y8-GQTDpcyfVprUEnCQ":{"text":"Great fest on mid city truncated by Weather Friday night couldn't keep a damper on weekend","useful":0,"cool":0},"l1d2MS2IAq2xtV0IkmbY_A":{"text":"Awesome festival that takes place on the banks of Bayou St. John, which happens to be my f","useful":1,"cool":0},"9YopFgeGHQ0K_7uxi_GxOA":{"text":"Setting up!!\nWith Bayou Brew!\nGreat, free festival in New Orleans Louisiana that last thre","useful":3,"cool":3},"e-toSGPcPgFKTjeoxaC0Cw":{"text":"I've said it before, and I'll say it again:\n\nThis FREE festival, that happens on the banks","useful":2,"cool":3},"_1RY_QqzpB9ywk9MxPHAKQ":{"text":"This FREE festival, that happens on the banks of beautiful Bayou St. John near the  end of","useful":3,"cool":2},"JTWRFUHJwnZRRRfhUJyz8Q":{"text":"I'm a fan of the smaller fests.\n2019 opened yesterday Friday 17th 430pm to smallish gather","useful":1,"cool":1},"xeYR8a02H-3MwEukZrv4vQ":{"text":"Tv news last eveng showed a BIG mess a suggested...but NO....ITS ALL CLEANED UP AND GOING ","useful":1,"cool":1},"ne0Vuq90Qina9LsF7x5rqA":{"text":"This is my favorite fest in all of New Orleans, all year long. This year marked my 7th fes","useful":3,"cool":2},"JzyrxahPFwKUjNgxugyOCw":{"text":"This was my first time at Bayou Boogaloo and it definitely won't be my last! Now that I li","useful":8,"cool":6}}