{"1UPNKz_FqVgvPIeNzVP1wQ":{"text":"Was pretty excited about visiting this place.  Heard a commercial for it and couldn't get ","useful":4,"cool":0},"aWkRkaCc4Sps_Sr7IkfHQA":{"text":"This event felt like a well done home haunt. The building is beautiful. The theme is a fun","useful":2,"cool":1},"-lE8At1kd59513j60_U8Og":{"text":"Wasn't too scary, most of the scary parts are just when they try and work you up and trick","useful":5,"cool":0},"BaKQTdewqksd2rDkDIYJcg":{"text":"The Mortuary is an awesome haunted house.  We have been to Universal Studio's in Hollywood","useful":2,"cool":2},"fW-qcmtjoZyktxlG0CNrjQ":{"text":"I went the weekend before halloween 2009.  I was staying in the French Quarter so it was r","useful":0,"cool":0},"cWeu0itQmbCAKNBKIUpRog":{"text":"This haunted attraction is hands down the best in louisiana. They create a new theme each ","useful":0,"cool":0},"aQEBKKL9Ofpn92PAbl9U3A":{"text":"If I had know what I was getting for 40 dollars, I would have strolled down Bourbon St and","useful":0,"cool":0},"kjvpW3NdWCHSh2Mqh5NAFg":{"text":"This is the best haunted house in the city. It changes every year and it is always excitin","useful":0,"cool":0},"zYUn-V8EzizmsMLjnnsBhA":{"text":"We had the most amazing and unique theme wedding here, and our guests are still raving and","useful":3,"cool":0},"7sEDWsh16pmE69OPlu6vlQ":{"text":"Went there hoping to see a haunted mortuary but it is now a Santa workshop. Why no mention","useful":0,"cool":0},"4Ydz5d7YA2pJ7O1Hz1h9tQ":{"text":"Truly, an entertaining experience. We purchased the VIP, and have enjoyed multiple times g","useful":1,"cool":0},"E47Qj-JqM7or5Mq26UIVjg":{"text":"We went to the Mortuary for the Zombie Escape room.  I am not sure where to start!!  The r","useful":2,"cool":2},"8wJpjpCf5AiWFNYZlFE2uQ":{"text":"It's a little tricky to review the Mortuary without giving anything away, but I will do my","useful":7,"cool":4},"Swc_iJXfJqwRrd8mc9mEXA":{"text":"We went through the Zombie Escape room. Great time. Very fun and intense. Also went throug","useful":1,"cool":0},"8WRBtWo-WTAHvkUCHpmEJA":{"text":"Great theme this year, seven deadly sins. You will not be disappointed, unless your too sc","useful":2,"cool":0},"kQaK-qFrPpLGwp3Vpk6QFg":{"text":"I've been wanting to go to this place for years. I guess you can call me a ghost enthusias","useful":4,"cool":2},"rb9j2Kn2WYr8_--2Y4kS5g":{"text":"I REALLY loved this year's visit! It's their anniversary, so it's a very cool combination ","useful":6,"cool":5},"Q5EMkqFuFEFa70zsKjnlhw":{"text":"Last night i went on a haunted mortuary tour got my tickets from 5 star concierge and had ","useful":0,"cool":0},"0EOpbORCEWDo1DVSPjwgww":{"text":"Escape room was an exciting experience with coworkers. The zombie in the zombie room was s","useful":0,"cool":0},"1C6bBX6oKoCPw7AkEASAcA":{"text":"I went this year for the Zombie outbreak and I thought that this was probably one of the b","useful":3,"cool":0},"ybCF0ztoMZjKtCfU6W6KRQ":{"text":"The wait for this place is just not worth it you get in line in the terrible heat and you ","useful":0,"cool":0},"LU_DOR5EGloBrj6Hv_-ctg":{"text":"The haunted house was very nice. I brought two thirteen year olds and they had a blast.","useful":1,"cool":0},"l5Sy_JcbpZRXUAbvuFNVAg":{"text":"I went with a medium sized group to try out the Zombie Escape room. The room is very well ","useful":2,"cool":1},"hckHBiefXFDd0scOCfbWZg":{"text":"Meh. I am a baby and spook easy and with the exception of a few screams here and there thi","useful":0,"cool":0},"tN2VJs1Fyk86bXYYcZFZCQ":{"text":"Well, being from Florida and having access to Halloween horror nights and howl O scream at","useful":9,"cool":1},"h-eK9lYbshYD_pEhe8BdJA":{"text":"The Haunted Mortuary is an awesome place to visit. In the fall they put on a stellar haunt","useful":2,"cool":1},"qOSVfVTEPW7WwvtJVbcQQA":{"text":"I was in NOLA last year around the end of October for my birthday vacation. I had been wai","useful":2,"cool":0},"lHJMwsfs8CjmdKP_j3X7ug":{"text":"Staff in uniform ruined the entire experience. We were looking for something creepy, but t","useful":1,"cool":0},"zaN2PGSbSCL0WrCgpxJ7JA":{"text":"Went for our first time. It was a fun night. I left feeling scared but not traumatized. Gr","useful":1,"cool":1},"-jd7XFFo4NdEG3mXGM9RsA":{"text":"I have tried three times to book a tour for four, they just won't do the courtesy of getti","useful":0,"cool":0},"8S5_zltPlTOKefG0uLFagA":{"text":"I want to start off by saying I'm a tough critic. I took my family to the 2018 haunted hou","useful":1,"cool":1},"kEy__cx911DSkodJYFMMGw":{"text":"While The Mortuary isn't overly frightening, there are some definite very scary,make you j","useful":0,"cool":0},"8uoqO6jD5w4loElEp5GWaQ":{"text":"First time here was in '09. Second time here was last night and it is definitely not worth","useful":7,"cool":4},"2TSk_jW-Y1FHwyOIrmYrzA":{"text":"We went last year in 2013 and wasted our money. The only mildly scary part was the interac","useful":1,"cool":0},"GuH6rDsI-TANdVEPMuHrtg":{"text":"We did the serial killer escape room on difficult level with 8 friends and it was wonderfu","useful":0,"cool":0},"v0EmBfSerMx6Hkknzzk2yw":{"text":"VIP tickets were amazing - we were in in five minutes. I'd say this is a great haunted hou","useful":2,"cool":0},"INBC3GUrnCzza9HUmznE4A":{"text":"Went for Halloween-y during this pandemic. Located in the heart of mid-city this site has ","useful":2,"cool":1},"SLjT5qMrehvHWSiHu_wTaw":{"text":"This haunted house is unlike anything I have seen before! I can't give you all the gorey d","useful":5,"cool":4},"2ejXwy3qlxA-szxv2MaQ_A":{"text":"The Haunted Mortuary is ten times better than I initially anticipated. It's a solid place ","useful":7,"cool":5},"UyiL7IPho2OhfMOxkPOIOA":{"text":"It sucked. No workers. 15 min of nothing walked more then anything. Ending sucked. Don't g","useful":0,"cool":0},"k9tT84lpFKcAd2O9sAZhUA":{"text":"Crushing disappointment. My husband and I have been to the Mortuary the past two years and","useful":0,"cool":0},"aofumQWE7AafLSOniDWzkw":{"text":"Awesome!! This was the best Haunted house I've ever been to. Cool thing is, It's really ha","useful":2,"cool":0},"1CLtLpJBnPiQZkr-pRaSlQ":{"text":"Let me start with the good. Our VIP tickets straight to the front of the line. The house i","useful":2,"cool":0},"uWKu0dAjwkSXA5z7LCZQNw":{"text":"We had SUCH a great time at the Pirate's Cove Escape Room!!!!!!!!! We went with a bachelor","useful":3,"cool":3},"qVkS6_M0j-q3VEHzEW0ZoQ":{"text":"This was the best Laser Tag Haunted House ever! You heard me right. Laser tag in a haunted","useful":1,"cool":1},"b0P5yockKxBSJVMcVus01A":{"text":"We waited almost an hour to donate blood and receive a VIP pass. Both myself and roommate ","useful":3,"cool":1},"iPLIw7IN1dNFt9KJw3U7jA":{"text":"5 solid stars for customer service and staff/management!\n\nbut only 2.5 stars for the escap","useful":2,"cool":0},"nlAvGBua8pQIR4L_rm8GOA":{"text":"Okay I'm going to give an extremely honest review, but I'm ALSO going to tell you what to ","useful":0,"cool":0},"HVo-8nk_aaVHI_FiJusj9g":{"text":"I love, love, love the Mortuary!  A friend of mine rented the entire building for her birt","useful":0,"cool":0},"lS2Xq7uNw84fo77eaKjJGw":{"text":"I went here; it was really scary, some of it was the unexpected scary that you would not t","useful":0,"cool":0},"FG7IOqlG0Ygrho5QqT6WFg":{"text":"Did the \"game room\" yesterday and totally enjoyed it... but a little disappointed that we ","useful":3,"cool":2},"EKtdJWu1wvzPfNuEleh9cw":{"text":"This will be my last year going to the mortuary haunted house. To start out when we went i","useful":3,"cool":0},"eEoOZc3FOk9-Fa6icGGYpw":{"text":"I loved the year when they did circ du fear. I never screamed and got genially frightened ","useful":4,"cool":0},"GXoc9QUlT2y-v2UFtp4gww":{"text":"Did my first Mystère escape room with a group of friends and it was definitely one for the","useful":0,"cool":1},"uE1iN7zL8-sBhme53Wkh0g":{"text":"I loved this place! My group did the Serial Killers lair (10 people) and we escaped it! We","useful":1,"cool":0}}