{"BE0T_4aRNcM8OmZnewOofw":{"text":"All daquiris on Bourbon are the same, pretty much.  Sweet, frozen, and liquor- no matter t","useful":0,"cool":0},"BjcbRKjpmWrLTp0R119thQ":{"text":"YUMMAY!\n\nDelicious tasting drinks that will give you a good buzz.  I got the strawberry an","useful":1,"cool":1},"XCA3zjT2VJiydyQboZ-Rog":{"text":"Pepperoni pizza slice was so good here I had to come twice. There are many pizza and daiqu","useful":0,"cool":1},"R6VSxE1gAiAwNq9iA1YpRA":{"text":"I got the Cajun something, which is apparently the most popular flavor here. It wasn't unt","useful":1,"cool":1},"grhoPnfFOEs3QVIZUdKf9Q":{"text":"Came in here to dodge the unmerciful New Orleans heat. My bff wanted a drink. I on the oth","useful":0,"cool":0},"fyiqs15LUtbDLaL4w2KI7A":{"text":"The person who helped me was far nicer than the woman at the place across the street. Tast","useful":0,"cool":0},"h5cavBvN0qzXe1X2KQDq6g":{"text":"So we walked up and down Bourbon and ended up at this establishment. Mainly due to my frie","useful":0,"cool":0},"o8bmgvh3KkRJSpuAAsAS0w":{"text":"Full discloser: We stopped here because we needed to use the restroom. We were surprised t","useful":1,"cool":1},"oyij7fSnOdUp8OClC2HCBg":{"text":"You ain't going to New Orleans for pizza, and no matter how \"good\" it looks at 3 am after ","useful":1,"cool":1},"xIrDXGfS4rPEdwm_R5sQnQ":{"text":"Not much to say. The drinks are tasty, there was a good amount of seating for a daiquiri b","useful":0,"cool":0},"ii5nFRPPX8L74QaKXTM0lg":{"text":"The pizza here was amazing. The guy that served us our daiquris made my night. Not much el","useful":0,"cool":0},"jiK0EPnaDN1EqlN9yWilKg":{"text":"With so many frozen daiquiri bars to chose from on Bourbon Street, my friends and I determ","useful":1,"cool":1},"Fh1y2QQWLxCOuJPFaQTpwA":{"text":"Not that I expected it to be that strong, but I just drank a large daquiri from this joint","useful":0,"cool":0},"TkQyoOJG7xLjApwmx0heEA":{"text":"Mmmmm pepperoni pizza. So good. Thin buttery crust and perfect ratio of cheese to marinara","useful":0,"cool":0},"oS_0KbMrQO8WxoJJAodv2A":{"text":"One of my favarite things about New Orleans is that there is a frozen daiquiri shop on eve","useful":1,"cool":2},"lEc8AUeQYpi03lUA67_5pQ":{"text":"Wondering which of Bourbon St.'s daiquiri shops is the best? Wonder no more. It's this one","useful":1,"cool":1},"L_XLx4Meutr6vJfap9HU1g":{"text":"This place actually has bomb pizza. We ate here like three times in our five day trip.  Th","useful":0,"cool":0},"J6b1J5Dt0mFMBWSjCD3l5w":{"text":"Horrible food, horrible service, this is not a place to go to. If you have any questions a","useful":0,"cool":0},"7YA2LdadBPXKwuhaGMahRw":{"text":"Last time we visited New Orleans we drunkenly stumbled into a pizza place late at night to","useful":0,"cool":0},"e7hO25Sb7IxDazCbYrtFwQ":{"text":"Worst pizza experience ever! Bad customer service! Tried to kick us out as we were eating!","useful":0,"cool":0},"X-4St2I7VGyDhYfCZGy8Bg":{"text":"This was where I had my first drink in New Orleans therefore it will always hold a special","useful":1,"cool":1},"nCRvgz3IHiX-DoK9f0gX5Q":{"text":"Their drinks are ice cold, delicious, and full of alcohol. I fell in love with the margari","useful":0,"cool":0},"yKJxiUxp8nsk8dfVKzUXLA":{"text":"Early morning daiquiri to start the day on Bourbon street it was good but a little too muc","useful":0,"cool":0},"QuDxovOywea4KWWOLvjH2w":{"text":"This was our last stop on a night of drinking on bourbon street.  We grabbed a pizza and o","useful":0,"cool":0},"BaVFmnMu2EXrjxAEI7DlKQ":{"text":"The service is great! The drinks are delicious, try the jungle juice one, it was my favori","useful":1,"cool":0},"troIgnDCq3eHgQF8MxH0IQ":{"text":"Absolutely disgusting pizza, and I didn't try the Daquiri's, but you might just meet your ","useful":0,"cool":0},"XTwVo5yn7NGfz9S8SEQIsQ":{"text":"Love love love the hurricane!!! Such a fun vibe and well priced. This is a must, strong dr","useful":0,"cool":0},"fALUsVo-LtaSrKZkFkiuyg":{"text":"I stumbled upon this place of course like everybody does while walking on bourbon street. ","useful":0,"cool":0},"1Sjug5ECbZqLxMUmsB7bnQ":{"text":"I usually don't write reviews, but my experience here warranted one. There was only one em","useful":0,"cool":0},"PmDVEtOjqLrooSqCHxVzcQ":{"text":"After about four hurricanes and a couple of hand grenades, I stumbled into this place, inh","useful":1,"cool":1},"hSps-BfOlUkUKlcp-sNp0w":{"text":"Showed up at noon on a Saturday for a quick bite. Only offered cheese or pepperoni (by the","useful":0,"cool":0},"WEiCRCV-eRY0Le006M2JcQ":{"text":"Very cute store but ok drinks. Stopped by to grab a daquiri because of how cute and \"insta","useful":0,"cool":0},"ibui5xlPEeGLqFXvBbOC6g":{"text":"Pretty sure there isn't a drop of liquor in the daiquiri. I'm a glorified light weight so ","useful":0,"cool":0},"4Ro9Y3DIbgTZBY6Y71Yxig":{"text":"I went for a Daquiri but my husband wanted cheese pizza. With left with one. We asked if t","useful":0,"cool":0},"tbRzRhJRfPxPDAJrxemkgQ":{"text":"I ordered a White Russian and I was basically slurping a slushie. I didn't taste any alcoh","useful":0,"cool":0},"eN3YFUH1WaJ_9mxvmAnOpA":{"text":"The strawberry daiquiri is really good. My boyfriend got two of the jello syringes and sai","useful":0,"cool":0},"eT8lvgC6Gf8RsztI0fJ-Lw":{"text":"Love the daquiri's from here! Literally the only thing I drink while in Nola! I definitely","useful":3,"cool":2},"XYhL6vW3l-qH0LhGxNn-3Q":{"text":"I can't believe more people weren't stumbling in here...\n\n\"Completely effed up in 20 oz or","useful":1,"cool":0},"-Aev1mU3rt6JJFeSqJtKdQ":{"text":"Daquiri's were wayyyyyyyyyy too sweet and there was NO ALCOHOL in them!!","useful":0,"cool":0},"1fYofYU8mCJ_vDuYB7jufw":{"text":"I would honestly give them a four out of five but I could not due to the service. We went ","useful":3,"cool":2}}