{"uN4s6lre2erHCiNy9kli2Q":{"text":"The staff was awesome. The experience and art is awesome. The food was beyond none. 5 star","useful":0,"cool":0},"IkpfHSajoR0kWdqmsmtQPg":{"text":"We went here for our Anniversary this year.  We were running late and they still were able","useful":0,"cool":0},"gMKPQuZtWKqf8ftke8Gz_g":{"text":"Reveillon is usually my excuse to venture into some of the city's esteemed restaurants. Th","useful":0,"cool":0},"d5yVbKsK2e56cuu14Ti1Mg":{"text":"The three stars are for the food, which was very good. Paneed fish was excellent, the crab","useful":1,"cool":0},"iaZyZeQPJkmc9ag0Xh_JAg":{"text":"I'm shocked to find so many poor reviews here. Had a recommendation to try this and so gla","useful":0,"cool":0},"glIYx4gKosQwe-z1a5eeXw":{"text":"My wife & I were just in NOLA for the first weekend of Jazz Fest.  We stayed at the Hotel ","useful":1,"cool":1},"kNJjlqR4umlhSaHZzOw8fA":{"text":"Returned to the Pelican Club this weekend and had a wonderful experience. \nCocktails were ","useful":0,"cool":0},"Mw_L_n32xLpW4RNHue8law":{"text":"I had the best thing I've ever ate here and I'll say that proudly. I'm not sure what it wa","useful":1,"cool":0},"MlU1EAHTiLfnLadYddwCXA":{"text":"I'd stopped by here once before for drinks, but did the full dining experience this time.\n","useful":0,"cool":0},"nG3dIgtUvhX-9i3gizFvyg":{"text":"If it weren't for their disappointing level of service, I would've given them 4 stars. The","useful":4,"cool":0},"ph0U1zfdmLy0qnX8FPDT1w":{"text":"Came in here on a whim with my boyfriend and his coworkers on Thursday 9/12 and we sat at ","useful":0,"cool":0},"kLTQceeYSJN-qcCox0yFAw":{"text":"A quick update, not on the food, which is still excellent, but on the ambiance. I went her","useful":7,"cool":3},"pNEgc__n-C_17nOZYaCFyw":{"text":"Traditional fine dining at its best!  This doesn't have the old timey Creole cache of an A","useful":1,"cool":0},"yXo0wwO1QKynoKi82lWG7g":{"text":"This place is so much fun and the food is truly wonderful. Every item on each of our cours","useful":0,"cool":0},"H9gzKTpmWIw8-GaK_XJMiw":{"text":"Extraordinarily loud dining area with rude wait staff. An empty wine glass would be cleare","useful":0,"cool":0},"6xfRXkfmgXKIc9XYPR47XQ":{"text":"I got the filet mignon and crab cakes from the coolinary menu. I liked it just wish it was","useful":0,"cool":0},"bBIxzpD83Ud3v-lEaw3Vvw":{"text":"I am a local and prior to moving here I visited New Orleans yearly for 23 years. I've eate","useful":0,"cool":0},"20TLBbSi2pf1HUXQEXxk1A":{"text":"Crab cakes, escargot, cocktails, lamb chops, fish, dessert, bread, and more.  All under $1","useful":0,"cool":0},"qxJoByP71SR189NvPY5U-w":{"text":"After our first experience, we returned immediately the next night. The menu contained a v","useful":0,"cool":0},"PVDwa-ZBiPfIGvTjjexcJA":{"text":"One of the best meals I have had in a long time. The appetizers of oysters was superb and ","useful":0,"cool":0},"9QstdOw71JVhsr_Ao4YvrQ":{"text":"Found this gem of a restaurant.  The restaurant was very elegant set in a picturesque fren","useful":1,"cool":0},"cQ0v37rZgIaRSh1UGH3fIQ":{"text":"Jason is the absolute best bartender in NOLA.   His knowledge and personality are second t","useful":1,"cool":1},"Q7e3X0ajO7xm4GRX1qub0g":{"text":"We had our new years eve prix fix dinner here. Staff was friendly and attentive and food a","useful":0,"cool":0},"oJnqwXpIb64vLgcnu6UIUQ":{"text":"My wife & I just wandered in here for a drink on our anniversary, thinking we would mosey ","useful":0,"cool":0},"5sV-yAGXhM_ZzQRZ8d766Q":{"text":"Everything here was amaze-balls. We tasted practically everything and it was all delicious","useful":0,"cool":0},"pfP-ORnnco8X-QDnKGBr7Q":{"text":"My favorite place to go in all of New Orleans! It's delicious and the staff is wonderful! ","useful":0,"cool":0},"oPjrWC9lSOsqgDPOmi0KGg":{"text":"Excellent. Worth the price. Wait staff attentive & helpful. We had drinks at the bar befor","useful":1,"cool":1},"aIXRbgDCcx7w1Q1PO351Uw":{"text":"I wish there were more stars to give this restaurant. We went there for their Coolinary me","useful":1,"cool":1},"IemWjhdI-LwgSuckR5avLQ":{"text":"We really enjoyed The P.C.  Locals gave us the heads up and we were able to get in with sh","useful":0,"cool":0},"oTUYjcBu6fJWBmC9ildE-A":{"text":"On a recent week-long stay in NOLA, we tried the Pelican Club. This was the best meal of t","useful":1,"cool":0},"rc5ziDw9OXHfdLYpiCcKPw":{"text":"Had dinner with an old friend who was in town and this was a great pick.  Nice bar to wait","useful":0,"cool":0},"lDps8HYpJ5MDfmLXQZS97A":{"text":"Went with a group to take advantage of the Coolinary menu-food was fabulous but a very lou","useful":0,"cool":0},"dz6lo3ulthhmLN16RYw5tw":{"text":"Probably the best Coolinary dinner so far.  Jason and Felix where excellent servers.  We h","useful":1,"cool":0},"xzMGwBU0OYV7pFAxrF0qqw":{"text":"For whatever reason, no one seems to know about this place--a colleague who's a New Orlean","useful":0,"cool":0},"-TgFuoMcaawbHTpxM7_upg":{"text":"Loser man host was a jerk off. Empty restaurant, tried to join a small group of our friend","useful":0,"cool":0},"4AniozOi833s-cEhMnrqwA":{"text":"The Pelican Club is a rare find. The food, service, and ambiance are great!! John was our ","useful":1,"cool":1},"vGnbmYHHZAsDJPdLnJfKhw":{"text":"Love this spot. Great good and great service. The filet is one of my favorites in the area","useful":0,"cool":0},"9vGLCgej8JwGMXxE_AGWHg":{"text":"Very nice meal. Had the crispy whole gulf fish, cooked perfectly.  Outside crispy inside s","useful":0,"cool":0},"GVsBY4tir7GFFwwTS58MGQ":{"text":"A hidden gem! Jason the bartender is the best in the quarter. Kind, attentive and funny!! ","useful":1,"cool":1},"hF4NFY72VCPL5rgxWlbyXg":{"text":"This was my first time ever at the pelican club and I must say I had extremely high expect","useful":0,"cool":0},"fdeT9hp0kPxjOCp68Ty7eQ":{"text":"Looking for a place in the quarter to escape the craziness of bourbon street? The Pelican ","useful":1,"cool":1},"a6c9LmCIe5BAd5mFr8v8qA":{"text":"The baked oyster appetizer was amazing.  My girlfriend had a surf and turf special which w","useful":0,"cool":0},"ldWsncYIFUO8t18a_RdlzA":{"text":"Crazy expensive of course, but a really nice meal overall. If you come here, get the prix ","useful":1,"cool":1},"AoO2mieGYDBvQklkTm8rHA":{"text":"The Pelican Club is one of those places off the beaten path literally and figuratively. Th","useful":18,"cool":9},"oJcRGN39BP3YphizdPtCcA":{"text":"All You Need to Know:\nDO NOT WASTE YOUR TIME OR MONEY. \n\nI completely regret booking this ","useful":0,"cool":0},"jmqxUqBUiqJ_IoYerPL_wQ":{"text":"Had a wonderful meal here! Came with a friend and split everything, starting with the gumb","useful":0,"cool":0},"zg-eF3uPdfiy_bRmVAwI1g":{"text":"I never leave bad reviews, but for The Pelican Club I'll take my time to do it. So for sta","useful":2,"cool":1},"ExIAFUGYh1FPBw0_EPEWXA":{"text":"My husband and I walked in off the street to The Pelican Club on New Year's Eve 2012.  We ","useful":0,"cool":0},"KDYHZTwuHCvD7Q7N2QVhZw":{"text":"The Pelican Club is definitely a good place to check out if you are visiting New Orleans. ","useful":0,"cool":0},"CnIboHqpfGlfsqP8jVuRhg":{"text":"Wifey and I had already reserved a table at K-Paul's, when it was suggested we come here. ","useful":2,"cool":2},"0zP3Hd45LqgoLEjunFLW9g":{"text":"This place was an amazing find!! We were lucky they were able to seat our large group imme","useful":1,"cool":1},"cHo1Tg5JsMCtSlPi5ZWXJw":{"text":"Amazing restaurant!!  Our first time ever at The Pelican Club was last night. Shame on us ","useful":0,"cool":0},"qV3iNXVV7oS3gJoLvSFNdQ":{"text":"HELLO???!!! HELLO???!!! I REALIZE I'M SITTING RIGHT NEXT TO YOU BUT I CAN'T HEAR YOU!!! DO","useful":1,"cool":0},"QJowMoeFIIWTdq6MVA3mmA":{"text":"Cannot say enough good things about this restaurant. We were in a bit of a bind with no re","useful":1,"cool":1},"8OEMWcHUdhVnLj6XjLEb9g":{"text":"So - I'm the third person to review this place - and the first two reviewers couldn't have","useful":0,"cool":0},"oVDZLf4O2TbDEHY0iZYt4w":{"text":"Wonderful service! Was sitting outside on a windy afternoon and was allowed to take a tabl","useful":0,"cool":0},"PZPA20avtCQ1yH9s2QO2ww":{"text":"Sooooooo good. Had the boudin stuffed pork chop. It was  amazing. Waiter was cool too.","useful":0,"cool":0},"NnF7hADbay92H45UHhIOGA":{"text":"Yeah man, this is the place.  It's old style New Orleans with a clubby atmosphere and abso","useful":1,"cool":1},"pf1oU4p8MHNXCHsLJw3CVA":{"text":"A very classy off-bourbon option on exchange place.\n\namazing service, beautiful art, great","useful":1,"cool":0},"v8be9K8Wp0ecKir5sqDSMw":{"text":"Impeccable service. Had goat cheese salad-perfect. Quail appetizer-delicious!  White choco","useful":0,"cool":0},"6MUb61LJBS0Bx7r-CJF-Gw":{"text":"I'm a foodie and have been to over 100 restaurants in New Orleans. Pelican Club is definit","useful":0,"cool":0},"1KE1DTWENKc23Cr9kGNYzw":{"text":"We only came for dessert here and we're sorry that we didn't have a chance to have a full ","useful":2,"cool":2},"L8c_Ng7gLI8Bq_ad0kHvBg":{"text":"The food was delicious ! I was here for a work dinner so I didn't think it was appropriate","useful":0,"cool":1},"6jnWrCaTn4C7orMupjm85A":{"text":"Went with a big group. Service was very slow and several of the meals were not good... Sur","useful":1,"cool":1},"-YLNC1NWicWEFwhzg4VR2w":{"text":"We had appetizers and drinks in the bar area. Jason made us a sazerac drink that was  pret","useful":1,"cool":1},"wJ5A8kmxJ3DySUqwZbHaNQ":{"text":"The soup (corn and crab bisque) was very tasty, the stuffed ravioli were awesome, the flou","useful":0,"cool":0},"JPVwAIWm_huGsGH-SlNs7A":{"text":"This is the type of place that I consider as \"Fine Dining\". White tablecloths, elegant pic","useful":0,"cool":0},"4KrqbBABcHMnZuh6PFSUDQ":{"text":"Definitely a place Id come to again. The food was great and the ambiance was definitely pl","useful":0,"cool":0},"m0BcQ1Rerk6mIj0HP_9log":{"text":"I was impressed with the look of the restaurant and had high hopes...but the place did not","useful":0,"cool":0},"OZ1n1qvwhWkQa0svNW9-cw":{"text":"ABSOLUTELY AMAZING!  Atmosphere is great, the wine list is extensive, the service was impe","useful":5,"cool":3},"Sze6prQooTFai39OlW1OpQ":{"text":"We had a great meal here.  Drinks were good, waitstaff attentive and dessert yummy. Had th","useful":0,"cool":0},"6Ogyi1g6nujM6fy9cB922w":{"text":"We were short on time so we ate at the bar.  I ordered the scallop stuffed artichoke and s","useful":0,"cool":0},"AaJUolYloYRMaZsO_AOq9Q":{"text":"Three of us went there last night, and it's still a favorite.  We often wait until the las","useful":5,"cool":3},"MwDrTjfaYGNl7bTSGzLgWA":{"text":"The way to go here is the 4-course prix fixe menu, which will set you back about $50 but i","useful":4,"cool":1},"_-lrVwzRR4pbOj1dOcNniQ":{"text":"We ate dinner here tonight.  I will be honest, based on the other yelp reviews I thought t","useful":0,"cool":0},"hzPX2IFA7po5fwAy4fpn9g":{"text":"Food and service were overall excellent.  The pecan pie, however, was disappointing; serve","useful":0,"cool":0},"32nMOO-nZYkbl1Zoa1ljEg":{"text":"Southern, classy ambiance & great food!\n\nWe dined here with a large party on a busy Saturd","useful":0,"cool":0},"tpXh7lspAnvsY5zvltYU_Q":{"text":"My boyfriend and I made last minute reservations Sunday night at the Pelican Club. We spen","useful":1,"cool":1},"5_5mEDNtxHVxfGDZyU89UA":{"text":"Visited in September.  This was the best meal I have ever had.  Everything was wonderful. ","useful":0,"cool":0},"ktvwXjkIRg8H__SUEXBVyw":{"text":"The only reason I'm giving this 1 star is because 0 stars is not an option. This was hands","useful":0,"cool":0},"Ys5R1-JPBGIyK1nClT14ng":{"text":"The food and service were amazing!!!  The lobster was cooked to perfection and the appetiz","useful":0,"cool":0},"WI7nG7arAzSaNaPkkZziAg":{"text":"Most of my meal was good (though not extraordinary) but the lobster, my main dish, was ove","useful":0,"cool":0},"gUsGZY5bp1jc4mdg2jCRtg":{"text":"Adam and Jason were awesome! My wife and I sat at the bar for dinner before a show. The fo","useful":0,"cool":0},"xYe7HbhVEyhc9uIMVeRVGA":{"text":"I've come to the conclusion that having a bad meal in New Orleans is the exception.  I lov","useful":0,"cool":0},"GUN7_WYG02y9NUVuJODt0Q":{"text":"Delish! And HUGE portions, considering how fancy the food is. Whenever my dad comes to vis","useful":0,"cool":0},"u7zNYRzoLYFoVcUDPk7-Xg":{"text":"I have eaten at the Pelican Club for years and never have I had a bad meal. The food is al","useful":0,"cool":0},"0SkcayNJt0Oa25AhdcrJkw":{"text":"Coolinary month is the best time to check out restaurants that you haven't gotten the chan","useful":0,"cool":0},"AB24tCrD064_w5t-Ygc6gQ":{"text":"My husband and I first came here three years prior to our most recent visit. We were visit","useful":2,"cool":0},"nM6gY6hxQPRquewY75KlVg":{"text":"Hoping for a fine dining experience with my foodie wife - what a disappointment. The food ","useful":0,"cool":0},"fd4Q3ODOS1vUDWzZjWHA9w":{"text":"A really spectacular time at a slightly \"off the beaten path\" NOLA restaurant. I've been t","useful":2,"cool":0},"rYJAIDrVZYHXimdnbR5b4w":{"text":"This is always a good option when in New Orleans.  The Pelican Club has been here for year","useful":2,"cool":3},"qZMvcVZMPB1pkjjsucBZXA":{"text":"Weekday amazing food and beers. Great price. Great service. Fun environment. Clean bathroo","useful":0,"cool":0},"xzG3UrsYkXVNu4G4Mtd4dw":{"text":"I ordered the four course meal and was disappointed with my experience for the second time","useful":0,"cool":0},"C4DTll3JUocRD5scElHHqA":{"text":"Four of us had dinner on a Sunday evening. Lots of people eating there made for a noisy di","useful":1,"cool":1},"7BLlU5Fw3a49i7yGw46JdQ":{"text":"Pelican Club; it's prob great if you're having a rehearsal dinner for a lot of people you ","useful":0,"cool":0},"ytYoBf913psRVf7CjNGuEg":{"text":"I was brought here for my birthday and what a gift!  We started with a lagniappe of Champa","useful":1,"cool":0},"rmRWt7_b1P7b2THAb0t0qQ":{"text":"Absolutely incredible and worth every penny! Every morsel was perfection. From the drinks ","useful":1,"cool":1},"zp3PPdZrF8pr-fpDibejrQ":{"text":"Outstanding service!  Outstanding food and fabulous atmosphere!   Most delicious flounder-","useful":0,"cool":0},"WFBnd7WgYB4L-IPmn_bqxw":{"text":"Service was decent, although my table was missing silverware and I had to wait to eat my a","useful":0,"cool":0},"ujSLg4sNg4LK57qwIW46WQ":{"text":"Amazing restaurant. I would give it a 4.5 if I could. I had the 4 course fixed menu with t","useful":1,"cool":0},"D2bl1OW1qUWSlHOoWfWB-w":{"text":"Crispy flounder was done just perfectly and paired well with jasmine rice and asparagus. S","useful":0,"cool":0},"oS050e8YUmzcWNdqc-MT7Q":{"text":"Beautiful bar. Lovely location in the heart of the French Quarter. Knowledgable and friend","useful":0,"cool":0},"z0jU97z3ydR5jAqE1mG8cA":{"text":"This place offers extraordinary value for the quality of food that they offer.  This is a ","useful":2,"cool":2},"0S_cjUUJK4kPEOgElMbGLw":{"text":"I love dinining in this restaurant and bar! My favorite place to eat every appetizer on th","useful":1,"cool":0},"RGuz_yH1dyKv1GwY5X-iTA":{"text":"The service and ambiance was as great as I had recalled.  The food though, I think may hav","useful":0,"cool":1},"VRHT9mFgdTZ2Wgv_8XbgDw":{"text":"My first time to New Orleans and as I was following a wedding march I happened to stumble ","useful":0,"cool":0},"qaaxBppQYtVknVmUvM8haA":{"text":"This place has a fantastic atmosphere and something for everyone. Everything on the menu i","useful":1,"cool":0},"vR5Hy8NT_2UtwRGEB2iENQ":{"text":"We had a private party rehearsal dinner for 40 people to celebrate our son's wedding. The ","useful":0,"cool":0},"4nr9HDw6vuIIn3WIzy5eWQ":{"text":"This restaurant is a truly great representation of New Orleans cooking as well as graceful","useful":0,"cool":0},"YSq_sO05ak5OOQRtx4-lcw":{"text":"The service was incredibly slow- so plan to be patient. It took 30 minutes from the time w","useful":0,"cool":0},"kvO2iyIPy_-Cgp2qoWtkmQ":{"text":"Among  top 2 or 3 restaurants in New Orleans. I've dined here 5 or6 times and every one 5 ","useful":0,"cool":0},"vfnYf2x7OgjI71oo5-wHqg":{"text":"Really enjoyed our food and ambiance. Service was excellent food terrific and price... Wel","useful":0,"cool":0},"uZU3i9UtiXOBPZJUppANJA":{"text":"I have had dinner here every Jazz Fest for the last three year and usually enjoyed the foo","useful":1,"cool":0},"1sMzb0IuouccL6Cc6NVW7Q":{"text":"Came here to celebrate a birthday for a friend, this place has phenomenal service and the ","useful":2,"cool":2},"V1rMpzTY9jkUvi8m4VoDRA":{"text":"It was Sunday evening on pre Mardis Gras weekend.  The service was prompt and attentive.  ","useful":0,"cool":0},"IdT_WML_x9oa2qlc-MuEvA":{"text":"So delicious! The bartender made me a spicy martini and I loved the yellow fish tuna. The ","useful":0,"cool":0},"AoGfVyxyd9ddzHsK6HGRZA":{"text":"Jason and Adam took great care of us last night! Fantastic apps and dessert. Quick service","useful":0,"cool":0},"f1Ui-FLr_cNapiyDpKbYUQ":{"text":"First stop here. I eat in New Orleans about 15 Times a year. Always try to find at least o","useful":1,"cool":1},"0HyGeMFzfLpLhXw9vwMXAg":{"text":"Great dinner.  Food was outstanding and the atmosphere and service were exactly what it sh","useful":0,"cool":0},"F3ibvkEpkIW97PSJPTf9Pw":{"text":"Thoroughly enjoyed my meal this evening. Service was excellent and unobtrusive. Food was g","useful":0,"cool":0},"riKHyD3ScREskshj0k9p8Q":{"text":"The best meal I had in New Orleans during a week long stay so that is saying a lot.  I had","useful":0,"cool":0},"ftvJ5c5pjnUT1st5nE412w":{"text":"Probably one of the best fish dishes I've ever had! If you are in New Orleans don't miss t","useful":0,"cool":0},"zz0Lx6ylTBKa-MhFBXixAg":{"text":"Called at 5:00 p.m. and received a 7:00 p.m. reservation for Saturday, March 20, 2010. Sur","useful":0,"cool":0},"axatG0Mxvgd8QJ3Br3x6WQ":{"text":"Solid southern food in an old school space.  Food was a little on the heavy side, and the ","useful":0,"cool":0},"VwrCs5UZNZPzpU7ccMgZbw":{"text":"Hands down my favorite restaurant in New Orleans. The atmosphere is unbeatable. I love the","useful":0,"cool":0},"zJ3QvhyDauqwZOs5Rra2fw":{"text":"Stopped by last night for an app and a cocktail and now one of my favorite spots in NOLA. ","useful":0,"cool":0},"bPjXmXiF6vj-eJIWOL9uaA":{"text":"New Years Eve in New Orleans, we scheduled a Reveillon Dinner at the Pelican Club. Not che","useful":0,"cool":0},"-GxY5sO6wiRPptYituI_Rw":{"text":"I wish I could say I had a wonderful experience dining at The Pelican Club.  I have enjoye","useful":0,"cool":0},"nRf0eMRjvtd8ibixOTE-Lg":{"text":"Stopped in for a quick bite at the bar before catching a flight. The bartenders Lindsey an","useful":0,"cool":0},"qzvvVn8S0xXVxfOve9V0fQ":{"text":"Perfect! Nothing more to say. We went in on Halloween night and they were really busy. We ","useful":1,"cool":0},"zBYJ_Zf_qJGOqLN_rW4tkQ":{"text":"My husband and I went to celebrate our 6th wedding anniversary. We were running a little l","useful":0,"cool":0},"bkRUa90Sr4oxHS6wc2Ewzg":{"text":"Oyster apppetizer was superb. Maine lobster was great, but the vegetables accompanying it ","useful":0,"cool":0},"sPMrUhuAO_QOdlzpL-6Sxg":{"text":"It's in the French Quarter, but not a tourist restaurant. Get the baked oysters, escargot ","useful":1,"cool":1},"cCHKumkF-1ZhY7wlWjslaw":{"text":"Good food, appalling customer service!! This is a nice restaurant spoiled by its arrogant,","useful":0,"cool":0},"qOj8cKsD-kq8XOHaujybxg":{"text":"Love the it!!! We went to New Orleans for a vacation and the have the best food i ever eat","useful":0,"cool":0},"OtMBZtrfcDuz3oETNjyc_g":{"text":"Ambience was nice. The menu was beautiful and the food was great. \nThe service definitely ","useful":0,"cool":0},"FQZo8uQAJtO3BL05jFIPzg":{"text":"Over the course of three trips to New Orleans my wife and I have dined in well over a doze","useful":2,"cool":0},"xvQxioAhj79c_kwJ2-jb5A":{"text":"Nettes restaurant im french Quartier. Ist mein 2. Besuch dort und war auch dieses Mal sehr","useful":0,"cool":0},"o9RmZd_OAqlMjW1hqF5Vng":{"text":"So why is it that this establishment is rarely mentioned when speaking of the city's amazi","useful":4,"cool":1},"ewpySs-YZvR10JoLUF_RrQ":{"text":"Wife and I love N.O. so we're visiting from Philly for our anniversary, just so happened t","useful":0,"cool":0},"-mCdv0bvx_aO5qfBf7RCVw":{"text":"Awesome appetizer! Get the clay pot bbq shrimp shrimp! The atmosphere is inviting and not ","useful":0,"cool":0},"2OPWtjUpeXpYpZMZSkqWAw":{"text":"A diamond in the rough!  grrrrEAT pomegranate martini, nice atmosphere, amazing service. W","useful":1,"cool":1},"myU7xXIqv6xfa9RZx_P7IQ":{"text":"Of course we tried it from restaurant week! I've heard nothing but how great the pelican c","useful":1,"cool":0},"aNGywgsWyMd9t1-KTfLKmA":{"text":"Jason and Nathan took great care of us, and the food was excellent.  Wonderful duck trio a","useful":0,"cool":0},"__hLCP5tDK9wvU_aOSuG4g":{"text":"My boyfriend and I decided to come here for Restaurant Week.  The menu had some good varie","useful":0,"cool":0},"bNE17ZjfAW78LKYGxc9EoA":{"text":"I usually don't like to bash anywhere, but we had high expectations from this place. It wa","useful":0,"cool":0},"KxeSapMdfSCs_gwfrODcaw":{"text":"Split the four course meal with a gf. It filled us up and was super yummy!","useful":0,"cool":0},"NSpK6j7mNvj-z8jaimZ7NQ":{"text":"Just celebrated my birthday here and it was phenomenal. The food and service were outstand","useful":0,"cool":0},"1Rs9WZ5Z6VdqZe5MkYXW7w":{"text":"A hidden gem, fairly certain you need to know its there, you will not stumble upon it.\nWhi","useful":0,"cool":0},"YIWLHyyHZx7B315-xKJVzg":{"text":"I am surprised to say this was one of the best meals I ever had, and I never admit that li","useful":0,"cool":0},"Rd7RnBifdIn6pOaQiGxvZw":{"text":"The food here was fabulous!!  Currently they have a pre fixe menu for $33 and i was expect","useful":0,"cool":0},"RxVNVB9uOYP6-Uk8giZQZw":{"text":"First trip to NO continued with dinner at Pelican Club..went with a party of 6 and I was w","useful":0,"cool":0},"DT52suNlO0sEBwVGL7sYmA":{"text":"This restaurant never disappoints. A must try in the city. The lobster is fantastic and th","useful":0,"cool":0},"PphmaV1E1xbvAyoEmtB8WQ":{"text":"The 4 course deal: the bomb.\nI had :\nGumbo- very good\nTheir baked oysters app - amazing\nWh","useful":2,"cool":1},"qesJuQaXCaNY8ECN3mB2hw":{"text":"Great little place in the quarter! Staff is super friendly, prices are great, food is awes","useful":0,"cool":0},"itnUn9pFJvhUE3pVkOG1CQ":{"text":"Excellent good portion size great food and wine! Coolinary specials and crab vales are the","useful":0,"cool":0},"CcnhH0vZopbt48HTHg6BBA":{"text":"Will not go back.  Ordered filet and asked if I could have mashed potatoes without truffle","useful":0,"cool":0},"qAKyC16XAl9_MLqti3Xm7g":{"text":"When my food arrived I tasted shrimp that tasted like a mouth full of chlorine, when I tol","useful":0,"cool":0},"8drNUYwRK6epLmkErwc_SQ":{"text":"Just had dinner here and it was excellent! It is Coolinary Week in New Orleans and this lo","useful":0,"cool":0},"-PajW4aP0DhFnjNCEStdiw":{"text":"It's a bar field... We ordered a dozen of chargrilled oyster on happy hr which is $7.50 wi","useful":0,"cool":0},"Ph5QbktlE_s27F-FT349tQ":{"text":"Jason the bartender was exceptional!  He was considerate, attentive and had amazing sugges","useful":1,"cool":1},"XGdZ5_PWlfVPkiCyf1dxTw":{"text":"The food here was okay. I went in for a birthday dinner last night with six guests. Five o","useful":0,"cool":0},"b7tQ_kdBCq4-GFE4yMSDGw":{"text":"I went to this restaurant based on the menu and a few reviews on yelp. I had the duck and ","useful":0,"cool":0},"gBRn-BL3wQAu_Y_QOmRw_g":{"text":"I cannot begin to describe how fab this food was! \n\nI enjoyed the crab cake immensely. But","useful":2,"cool":1},"xtfiDEWCN6Zav1JjztaJAg":{"text":"Amazing atmosphere and terrific service. Our sever was very helpful in all of our selectio","useful":0,"cool":0},"1tR5B2-6y2a1LHxkhFcnVQ":{"text":"So so food, indifferent to non-existant service (we got handed off from one waiter to anot","useful":2,"cool":0},"XHlXK9iwL9R2tGiOlgPTlw":{"text":"Had the 9oz. Revillion Dinner.  Oyster and fennel soup was amazing, quail with grits as we","useful":0,"cool":0},"XBPyAkL6C6Qm1FMgwIGOYw":{"text":"Went here for NYE dinner and the atmosphere was good and server was friendly. However, for","useful":0,"cool":0},"lYCnwV_klBjlkBtcLskqsA":{"text":"Very rare is the occasion that service issues will completely tarnish my view of a restaur","useful":0,"cool":0},"2WROFIZDtnLIDlhGFllUVA":{"text":"Great atmosphere with friendly service. Great seafood at reasonable prices. Had the LOUISI","useful":0,"cool":0},"jC1NaJ1LtfWlqXpL86Jirw":{"text":"Great service and the weightier was super helpful on the wine selection. Made my trip to N","useful":0,"cool":0},"SKHvNka13pB62wNxpo5sNg":{"text":"I have been coming here every few years and in the past it's been great \nI understand it's","useful":0,"cool":0},"-cJsSNHGD_8MCJ-3nYDjrw":{"text":"The Pelican Club is in my top 5 favorite Nola restaurant list.  I've been there countless ","useful":0,"cool":1},"SMTOtBnhi_3giOpa7Hzufg":{"text":"So disappointed:( $140 dinner and was very unpleasant, from the appetizer to our lamb entr","useful":1,"cool":0},"O7o3v_cImPPkxRottmjxkw":{"text":"Hopefully just a bad day...\n\nWe were sadly disappointed by our experience here after it ca","useful":0,"cool":0},"CjtMYKxBuke0p0g4Pv59Eg":{"text":"Do not leave New Orleans without eating at The Pelican Club! Absolutely amazing food, drin","useful":0,"cool":0},"snjmrAL4EMY28baBcE0qEw":{"text":"I have had dinner here every Jazz Fest for the last three year and usually enjoyed the foo","useful":0,"cool":0},"MqkVH76959T4TOYZalkh3w":{"text":"An excellent hidden gem in the French Quarter...They do it right with the pick-three menu ","useful":0,"cool":1},"8PHW8XdTRgWZF5vnRMG2NQ":{"text":"Absolutely fantastic sit-down dinner place with charming old world decor, entertaining and","useful":0,"cool":0},"T9Bqs3qtE5hJU-40N6Qb5w":{"text":"Came here for dinner. Had the following:\n\n- turtle and alligator soup. This was not good. ","useful":0,"cool":0},"GYaHRzCkw68s8NW2oMgf7Q":{"text":"This restaurant is worth the price. I would definitely go with the four course dinner so y","useful":0,"cool":0},"om_2wDtv8s5pe-A3de8tTw":{"text":"The service hands down was horrible. Our waitress never came back to refill any drinks. Ou","useful":0,"cool":0},"INH_oVLT41z2bnQu60EV9w":{"text":"Last week was the second to last week of coolinary and of all of the coolinary menus we ha","useful":0,"cool":0},"JIDZZiv7ApkrhK1OdvCBsQ":{"text":"Made a reservation for last night to sample the Revillon menu. Sometimes you go to a resta","useful":0,"cool":0},"E5lS1Kf-_dEQcEaTcqK8Rg":{"text":"We had Reveillon dinner here last night for Christmas Eve. The restaurant came highly reco","useful":0,"cool":0},"5n5k8JQdb6SA-OhxfCRCFw":{"text":"We had dinner here twice and each time was delicious.  Would like to shout out to Terry, M","useful":0,"cool":0},"32hZ8_TIU4S5B-LvfcMznQ":{"text":"I've been to Pelican Club three times.  Each time I had the same experience.  The hostesse","useful":0,"cool":0},"nSVW6LVVl2Hm09a-N6qIHQ":{"text":"Amazing quality of service, great bar, good menu, great atmosphere, and quality of food.  ","useful":0,"cool":0},"XDxsb3VTsgyI28Y3OscaHA":{"text":"Worst dining experience I might have ever had!   Food was marginal at best.   But,  the pr","useful":0,"cool":0},"KqTyIacCFzEhgFIVTZfZVA":{"text":"Oysters were great. Seafood dinner was ok and the bread pudding to die for.","useful":0,"cool":0},"LV1-PQ1dNQJDpPNvz5TByQ":{"text":"Local friends took us out to dinner at the Pelican Club and it was the best meal we had wh","useful":1,"cool":1},"97eZl0NlEgsthFLU_TR1AA":{"text":"I am a vegetarian... There weren't a whole lot of choices for people who don't eat seafood","useful":0,"cool":0},"w-Wk-zpd5QvkpXvwQ6maTg":{"text":"AVOID AT ALL COSTS. My 3 friends and I came here on NYE and ordered the $100 pre-fixe meal","useful":1,"cool":0},"hzV6kNRnfVpMafewqbY1DQ":{"text":"The service was good. The food was alright. I was expecting a lot more from the food. The ","useful":0,"cool":0},"J3x_NGJEA__Yc3i2YAxUKg":{"text":"Amazing food and atmosphere. Excellent service and if you get the chance to sit in the bar","useful":1,"cool":0},"dqpuYLeBOoyt-I3Qf_sfQQ":{"text":"I ate here with 4 other people on Saturday Jan 29 on the recommendation of a local.  It wa","useful":1,"cool":0},"7vTnvtwJy-IJ6_ppwd-FeQ":{"text":"Something I love about the Pelican club is its consistency. EVERYTIME I go there, I know I","useful":0,"cool":0},"ce6tHK3viGPx7eCw36vMkw":{"text":"It was a tough call between this and the Green Goddess next door, made easier by the fact ","useful":5,"cool":3},"fxBRbR9dVt6BtL1Dr28KMw":{"text":"The food was good the feel of the restaurant is quite upscale but I felt like the food it'","useful":0,"cool":0},"hie4-0POz_Nm_xo_LOzW3Q":{"text":"Jason the bartender is the greatest of all time!!!!!! Amazing food and made us feel at hom","useful":1,"cool":1},"3ExLpwYOThXx7R3I_oRUZQ":{"text":"Warm somewhat formal, clubish atmosphere.   Sat in bar area which was warm and lovely.   S","useful":0,"cool":0},"Bu1GPNRNACjtQzGXQnWCWg":{"text":"Had reservations for a group of 10. We were the first to arrive and the hostess was very r","useful":0,"cool":0},"2iwRKcfgokpltictW67uLQ":{"text":"serveurs très sympathiques et attentionnés, repas très bon, assiettes copieuses, belles pr","useful":2,"cool":1},"q7eqwjDJxJ4CUSs6lL53tQ":{"text":"Awesome restaurant!!! Staff , atmosphere and food are amazing!!!! This should be in your t","useful":0,"cool":0},"X-m6iobgUSymETT8nGEKfg":{"text":"I was very disappointed with The Pelican Club. Two coworkers and I came here and all agree","useful":1,"cool":0},"-080eoA-ftbVMlHIECOz_g":{"text":"I have been to the Pelican Club around 6 times, and I have been impressed every time.  The","useful":0,"cool":0},"BQQnvLzKYZbWD_jFUpJMrQ":{"text":"Granted it was a sun nite and I know the b-team is usually working. Here is all you need t","useful":0,"cool":0},"220EE22hwCd7xBWmsREwBA":{"text":"Nice white-table cloth place in the French Quarter.  TIP: if you park at the hotel next do","useful":3,"cool":0},"2Tfep07Ydo9a4YwdicHZpQ":{"text":"Great bar! Easy to be alone, sit and have a cocktail, and fabulous food!","useful":0,"cool":0},"eLxS2_VPRleELddbyN-kEQ":{"text":"I've been here 3 times. This place is amazing. The crab and corn bisque was delicious. Als","useful":0,"cool":0},"mBg6V2KsaZwFmZ0Vsrr64Q":{"text":"Went 4/12 for dinner. Dinner was great, did the 4 course price fix. My wife got the oyster","useful":1,"cool":1},"BF69WC-QP6if8SH3A_zd1w":{"text":"The portion here are family sizes. The flounder was a whole fish and topped with scallops,","useful":0,"cool":0},"uMR-lAVjjBDrBg1tEbJyUA":{"text":"Hit the pelican club while in town for a conference. Noticed it when at the green goddess ","useful":0,"cool":0},"meqszZpPbQusScm0AQInwA":{"text":"A decent Reveillon menu.  Steaks were good, apps were good, dessert was good and it was al","useful":2,"cool":1},"jzN2mQlkLOM2qmcQU2MZnw":{"text":"It was a great dining experience! The food and service were both amazing. Ask to be seat i","useful":0,"cool":0},"ZjXR2I8IqIfcvV8odR3Z1A":{"text":"Had a really nice meal here tonight. Seafood is the star (or at least it was on the inexpe","useful":1,"cool":0},"QdDIFPMVjMKSdgUug7Z_Ew":{"text":"When you visit New Orleans, you anticipate eating some of the best food in America, and Th","useful":1,"cool":0},"HJ52dDSvnPglhdJtWG3rGg":{"text":"As good as it was when I first visited NOLA 15 years ago. It still reigns as the best meal","useful":0,"cool":0},"QCLXqU01UdvhGwvs0CvCmw":{"text":"Exchange place is a small alley with the restaurant entrance about 30' from the street. Yo","useful":0,"cool":0},"rUyGGyd2YE_OuP62QN1NHQ":{"text":"This is  overhyped and expensive restaurant. It showed up on the Yelp as a restaurant whic","useful":0,"cool":0},"uwO7bs6iFR3c9zpNkX6h6Q":{"text":"Our friends really missed out!  They were the ones that got the rave recommendation from a","useful":0,"cool":0},"jlFk5MlReEPNMWQrpLPO4w":{"text":"Outstanding fixed price dinner. The gumbo was probably the best I've ever had. The crispy ","useful":0,"cool":0},"4xBrCEKSNJUAdsfK6YAGAg":{"text":"By far the best white chocolate bread pudding I had yet! Overall, everything was good.","useful":0,"cool":0},"u6Y-SkLGq17WN5MpI3Bsxg":{"text":"First dinner was a hit.. 4 stars. So good went back for a second time with wife... Saw a m","useful":0,"cool":0},"j1xLCAdWHkKAegpDtaMs9Q":{"text":"We enjoyed the food, especially the black drum entree and the pecan pie dessert. The servi","useful":1,"cool":0},"luljksOKesReBZ0w9Xa6DQ":{"text":"Visiting New Orleans and figured we'd take full advantage of COOLinary and try some restau","useful":0,"cool":0},"7oIbvDezNk0MClAfnJ6usQ":{"text":"Had a fantastic meal at this hidden gem.  The Clay Pot Barbequed Shrimp appetizer was one ","useful":0,"cool":0},"l3V4RQyj2-l4RrRHMRMDcA":{"text":"I have eaten here three times and each time the food was great. The menu and wine were ine","useful":0,"cool":0},"VL5QFMS_7UgqQLyZW0oAoQ":{"text":"This has been one of my favorites for years, and my first trip back post-Katrina was no di","useful":1,"cool":0},"GbAEEe_Fh8KFG55qK3PgFA":{"text":"Mardi Gras weekend and had one of our finest meals at this place. I had the lobster and my","useful":1,"cool":1},"Ukmb41l5Ta27iG99-EsZDA":{"text":"There are two sides to this restaurant\n\n- the food - this was great and would deserve at l","useful":1,"cool":0},"Wv6OAUPev7PADEav2XL0ZA":{"text":"Oh my! Sat at the bar and ordered what looked good. \nMe: corn and crawfish bisque. Clay po","useful":1,"cool":1},"qulu2MSErdHffY4b_5tLKQ":{"text":"As I am preparing to hit GW's this place crossed my mind.  Now I have only dined here once","useful":0,"cool":0},"-d-rXHBJ7fDdMo2b8gS4Ew":{"text":"Exceptional service, food and art.  I can't wait for my next visit.  I have already recomm","useful":0,"cool":0},"DsKFldeCQ7eum8IlkQ-TwA":{"text":"This place was recommended to me by a dear friend because it's one of her favorite restaur","useful":0,"cool":0},"JkgMWZcT14oLAPvzrZmzdA":{"text":"Adam and Jason are the most amazing bartenders ever!! Prego in New Orleans = ughhh. But le","useful":1,"cool":1},"eDr4j-wTnWYnsfrM_DVYoQ":{"text":"My girlfriend and I went to The Pelican Club for dinner on a Monday evening.  The short st","useful":0,"cool":0},"SCJnAqn3PRLEZ0ZJ6t-0iQ":{"text":"Came in for happy hour and sat at the bar with Lindsay. She was so nice and we drank her P","useful":1,"cool":1},"TXse8j5idnWFOQ3IzbWhdw":{"text":"Was wandering around and saw a cute alleyway with lights zigzagging overhead, casting a wa","useful":0,"cool":0},"qjThOPT4_kcV8qIcsKqahg":{"text":"What a disappointment!  This was probably my third or fourth trip to PC after many years o","useful":3,"cool":0},"RsNrWRDbphx1lK1utjsxhw":{"text":"Two local couples for my husbands 50th birthday.  Were seated next to an empty table set f","useful":0,"cool":0},"bLFjtDtfD-0lNJPzMWh9Bw":{"text":"It's good.  Giant portions.  Great pre-fixe menus.  \n\nI felt a little out of place here.  ","useful":1,"cool":0},"adje1axHC2CbO0yyCkfjqA":{"text":"Host was rude. Was not seated on time even with a reservation. According to the host, ever","useful":1,"cool":0},"iN3ocSRGd_cWZzWLUx-Snw":{"text":"On a cozy, safe-feeling alley with galleries, etc. Very charming, Europe feel to front. St","useful":0,"cool":0},"IX8U_aBjoycJ_UGt-T0t7Q":{"text":"I've been here a couple of times and have never been disappointed!\n\nTheir 4 course Prixe f","useful":1,"cool":0},"HXxhi82QR9t1KNL-Rcle1Q":{"text":"Enjoyed the coolinary meal here with a friend and it was very good. I had the baked oyster","useful":2,"cool":1},"TQEKGF82nGUTzEiZvrlSxg":{"text":"Best food I had during my trip to Nola. AJ the bartender was a pleasure. This will be for ","useful":0,"cool":0},"3wRZ3TST01OPAyL89-UXIA":{"text":"Had Revillion dinner here, highly recommend-lots of choices to make everyone happy. Wide v","useful":1,"cool":0},"dFcVPrTa-N8hCD0MZD94lA":{"text":"I was in town for a trade show and found the  Pelican Club on Yelp. It did not disappoint,","useful":0,"cool":0},"cp16stFAzi8z8D_MK2ebYw":{"text":"Amazing! Coolinary menus (August specials in NOLA restaurants) are sometimes lacking... NO","useful":0,"cool":0},"ugpNW8f5dGAJfydj8uH_vQ":{"text":"Just excellent. food, service and ambience. outstanding. at there on 12/28 and they were s","useful":0,"cool":0},"rVtW2sNUezveGburo49Alw":{"text":"We were happy to find outdoor dining and asked for a table.  The hostess acted put out but","useful":0,"cool":0},"H7WdsXjET4doj3uL8gWW8Q":{"text":"This is an elegant place and the food is delicious.  The cioppino had a good balance of se","useful":0,"cool":0},"qmMGhRWm4lgE0FUJxNRu7Q":{"text":"I decided to go here at the last minute as I did not have a reservation anywhere else and ","useful":0,"cool":0},"F3bG4GGW_QU3_YhCsfTiJw":{"text":"Had a really great time at a business dinner. Service was a bit animated but added charact","useful":2,"cool":2},"zp7E6PokI3RaV6ZOON_dgQ":{"text":"Lets just say that i'll be writing an official complaint to the BBB of NOLA and also notif","useful":2,"cool":0},"gxGeVi0HRs_scGbhEbP3ZQ":{"text":"So disappointing! We were told that this was one of the best restaurants around, but not s","useful":0,"cool":0},"o4ojyoArlb521O9iOse8XA":{"text":"Combo Mardi Gras weekend and Valentine's Day Sat. nite wouldn't necessarily bode well for ","useful":0,"cool":0},"PpyPcs0zWq1URbhKCdDT_A":{"text":"5 stars without a doubt! I would like to thank Jason for his amazing customer service. It ","useful":2,"cool":1},"zn8YcYqccCGF-Hx4CPGDjA":{"text":"After having some wonderful dining experiences in New Orleans...we looked forward to a won","useful":0,"cool":0},"-njS84coJeHzMB34Dkjpqg":{"text":"Unbelievable restaurant!! Everything was absolutely amazing! I made online reservations fo","useful":0,"cool":0},"AMbTY3U9frcs3sz5GkZgYw":{"text":"My boyfriend and I recently went for the 'Coolinary Menu' that they offer every year throu","useful":3,"cool":1},"PLp_z9eeQ4wzJqoTEdAjRg":{"text":"This was so disappointing. Our first time in NOLA, and our one dinner out alone. Our hotel","useful":0,"cool":0},"GcvfCZ7d3vGKYUnBkZksTA":{"text":"Was in New Orleans for vacation and came here for dinner on a Sunday night. It was incredi","useful":0,"cool":0},"W5MMXsX6TkfYu9ZXS7HZag":{"text":"Excellent night with my friends! We each had a Coolinary menu meal and none of them disapp","useful":0,"cool":0},"3ZIJBb6aWOEDl47YDSvBJA":{"text":"I order rack of lambs, it was over cooked and not delicious. Food is very overpriced and n","useful":0,"cool":0},"3IzYJqBEikni8CuhpadipQ":{"text":"Expected much more based on the recommendations that locals had given me. I visited with a","useful":0,"cool":0},"wUsdoJ_LwYgD8SqZEzlefg":{"text":"A great place for an authentic New Orleans dinner featuring local fish. I thoroughly enjoy","useful":0,"cool":0},"zoxLSUH3HguUMu0SgvtU7A":{"text":"Nice hidden away spot. Gulf fish was good and BBQ shrimp served in a way you'll probably s","useful":0,"cool":0},"SGBPFKlwOrurLTs8UdEaaQ":{"text":"We found this place by accident walking New Orleans streets looking for an Italian restaur","useful":0,"cool":0},"_ALwpqmeavZBasW6ENy41Q":{"text":"I had the opportunity to visit the Pelican Club for Restaurant week and overall had a very","useful":3,"cool":0},"A6xgQ1212BTp46U3NS8VRA":{"text":"Had a delicious dinner last night. \nMy husband loved the chioppino. My sister had the crab","useful":0,"cool":0},"a2dImVWtOvHe9Hm5DaYjDw":{"text":"Honestly, I first chose the Pelican for the menu and price of the special pre fix Christma","useful":3,"cool":2},"1EACy4ONlCaAgYH4nPpGyw":{"text":"I am very sad that I had to waste a meal here, but that's what my friend and I get for try","useful":1,"cool":1},"GdeDtjH0UgVD_AaXZUi52A":{"text":"The Pelican Club is an annual favorite when Reveillon dinners get announced.  The Potato S","useful":0,"cool":0},"G9aVbGyavCG2zqhVr1FmXA":{"text":"Everything was so delicious! First time here and we went for the Coolinary dinner! $39 for","useful":0,"cool":0},"8dSfCLQ2r-V9KdeO_KKcMg":{"text":"Greeting- yes\nVibe- hunt club\nPrice- average\nService- good\nFood\nGumbo $6 is very good\nShri","useful":1,"cool":2},"l4qgjouubi3XeMYqNYrV0A":{"text":"Best thing I ate for #RestaurantWeek2015 !\n\nAnd my 100th review goes to The Pelican Club! ","useful":3,"cool":1},"yNDhik8g8Nh7_m8NeEXMaw":{"text":"Two experiences at the Pelican Club:\n\n1) Five stars when we came in right at closing time ","useful":0,"cool":0},"pU0xcnCIPzFVgQQMph8rdg":{"text":"Excellent meal and good service. Arrived without reservation on a Saturday night (what WER","useful":1,"cool":0},"A97l5hjoAhSl64KqPkDZVQ":{"text":"Had dinner at PC last night.  The bartender made one of the best Old Fashioned drinks I've","useful":0,"cool":0},"-7Q1qWws6YRfkafHLf1NtQ":{"text":"Don't usually like to write a review about a place until I've been there a few times but t","useful":1,"cool":0},"Pevj8yavBcZVMgMkXy0BRA":{"text":"We were introduced to The Pelican Club about 5 years ago and it is by far one of our most ","useful":1,"cool":1},"AuUsI8xtOwhEd7mhbEq6GQ":{"text":"Excellent food and service \nRelaxing dinner in a cozy atmosphere \nThe carrot and ginger so","useful":0,"cool":0},"W2N10q5jmfb438f2D62tFw":{"text":"Little advice: make reservations! We made reservations 2 weeks in advance and couldn't get","useful":0,"cool":0},"dG7JEZS4Tc3626Qd1r7GMQ":{"text":"Ate here for Reveillon in 2016 and it was a fantastic meal.  The Reveillon menu had three ","useful":2,"cool":3},"sMxCvgLNza9NK0BFoapf_g":{"text":"Incredible seafood, beautiful atmosphere and every dish was prepared perfectly. Loved the ","useful":0,"cool":0},"QmikKIHSPL5NHtXF8u2c8w":{"text":"The food was fabulous, the wine selection excellent and the service by our bartender Jason","useful":1,"cool":1},"DxKlumTrOWVzSjGwnxYK-Q":{"text":"The food and service where good. Getting seated on the other hand was another story: I gav","useful":1,"cool":0},"AE5z_kfj2GRGLBzFqC86CQ":{"text":"Atmosphere is very inviting in the bar area.  The back area is more classy dressy atmosphe","useful":0,"cool":1},"ytRFkooa8uYqAweMwtfD-g":{"text":"Had dinner last night upon a recommendation from a friend who travels here. Was not happy ","useful":1,"cool":1},"S7icUTnZP_8dB2UBhCy2Qw":{"text":"Came here for dinner with my 2 girl friends. One of them was with child. Waiter was so swe","useful":0,"cool":0},"2Jq4Ueh9ZM9kd5PyFYyctQ":{"text":"My wife and I had dinner at The Pelican Club on 8/22/2018 for our anniversary. We initiall","useful":2,"cool":0},"1xXoF4Qn6e-9lyeZ6C2qgw":{"text":"We stopped in for drinks, the strawberry lemonade was delicious! The service was wonderful","useful":0,"cool":0},"bdLJGElPQjJKs7lFFpfSgw":{"text":"Nice atmosphere, good food but poor Service. Drinks tools forever. Things that we asked fo","useful":0,"cool":0},"W7pvX36A19rSJJkWxS_Tzg":{"text":"Where should I start, awesome host and server, atmosphere really conducive. Now the food, ","useful":0,"cool":0},"FBdJEubBGLvTokso7jFzxQ":{"text":"The service was a 5.  The choice classic new Orleans. The wine was a 3-4.. the food was a ","useful":0,"cool":0},"uNNyBU8M3vWyYHX6GHLEJQ":{"text":"Love the ambiance and the food!  We come here every year when we visit NOLA. We had the su","useful":1,"cool":1},"K2HrkFI-mxsUdA6WqzQK2w":{"text":"This is absolutely one of my favorite restaurants in New Orleans! I'm born and raised here","useful":0,"cool":0},"xidM5TR-8n7gu6bifObthA":{"text":"Bring on the party is exactly what we did. I came with family for a birthday dinner and ha","useful":1,"cool":0},"ui_lH5k2Y-dms1EzL6LvTg":{"text":"Best fish in NOLA!!!   It's not noisy at all.  Great piano.   Baked oysters were excellent","useful":0,"cool":0},"CtasazbBhHjXDIZblN_fMA":{"text":"This place is excellent from start to finish.  The garlic focaccia bread is awesome.  We o","useful":0,"cool":0},"hQCYYPpJklbT6KWOgGysWg":{"text":"The best dinning experience in New Orleans! Our Concierge at Hotel Monteleone recommended ","useful":0,"cool":0},"DzJRr-wQmZCULB-aZMVtXA":{"text":"Amazing place!  When you walk in and immediately notice your among locals everything is ok","useful":0,"cool":0},"uFES8ohXUw1km8Qk6wcqtQ":{"text":"I was in New Orleans for a week and visited the Pelican Club twice, so that should tell yo","useful":0,"cool":0},"wTRNq_LCIlIggxqGltBZYw":{"text":"Thoroughly enjoyed my experience here. I had a few things here, lobster, steak and oysters","useful":4,"cool":3},"yTNgmbjA9mK1xYzM3Ydxbg":{"text":"This place was great. The steak was really good and the sauce was amazing. Jason and Bronc","useful":0,"cool":0},"OrHxmP72IypN0IAbqWY-Dg":{"text":"Don't waste your hard-earned $$. There are so many MUCH better restaurants in NOLA, go the","useful":0,"cool":0},"70WGcJiY5jSoHJxMpZ9oqw":{"text":"Excellent service. Very good fixeprix dinner at a decent price for French town. A little h","useful":0,"cool":0},"hPyUfNEMV-j2PuDmspJ1RA":{"text":"Jason and Branko at the bar gave us 5 star service! They made us feel like we were regular","useful":0,"cool":0},"_JLe1mj1dCIv0_Cj_HHnuA":{"text":"We eat here every time we are in NOLA. Delicious food, great service, beautiful ambiance. ","useful":0,"cool":0},"4IJyHeuNAj7xhUkD_S5HXQ":{"text":"Love the ambiance and the food!  We come here every year when we visit NOLA. We had the su","useful":0,"cool":0},"-u0GAHoGr20RWWkVIk9kDg":{"text":"Visited this spot during Coolinary and was thoroughly impressed that the standard dinner s","useful":0,"cool":0},"IuCUziUyBpSeMBkErt2dkg":{"text":"I came here for COOLinary in August for the first time and was extremely impressed. They h","useful":1,"cool":1},"pr7zqNx8blLcwgqSZ_vaOQ":{"text":"I'm so upset that I didn't know this place existed until recently. I stumbled upon their C","useful":2,"cool":2},"9IzpSOGlE803GYOxyTArCw":{"text":"Waste of money.  We came here for a late Easter lunch.  The service was not great and the ","useful":0,"cool":0},"1PvgDi0FvFjfYAtC-xPDyA":{"text":"Wonderful as always  Eddie  was my great server, I feel like a million bucks right now  th","useful":0,"cool":0},"Ijbrw2LJTXMXO8wVzjVVGA":{"text":"Come here, the atmosphere is amazing and be sure to meet Jason, one of the best bar tender","useful":0,"cool":0},"KlGOOXi-mzP32RBgN-epog":{"text":"I love this little hidden gem. We have been on several occasions but this last time was th","useful":0,"cool":0},"zPJa-wweOL4TvWm2aeW7CA":{"text":"Excellent experience and don't miss the lobster. Drinks were excellent and bread is to die","useful":1,"cool":1},"NLNi_kDVrkyOv5OAfAdOOQ":{"text":"Went to Pelican Club for their Coolinary Menu. I had the escargot for my starter which was","useful":0,"cool":0},"cSDG9fZPumdsqJx_1ZDGoQ":{"text":"Awesome dinner in NOLA. Gulf fish with crab was amazing. Jason and Jonathan took great car","useful":1,"cool":1},"p9KqfXvCXWb6XQy10QoV1g":{"text":"Worst, worst, worst dinning experience for a highly rated restaurant!! Save your money and","useful":0,"cool":0},"njcT07WUJDu9LMPIPNA1kA":{"text":"This place is 5 stars 24-7-365. Whether it's their famous Revillion dinners at Christmas, ","useful":0,"cool":1},"AXNHgs0430fFdvSBJX0WQA":{"text":"Extremely disappointed in this restaurant. We had to ask for a waiter after sitting for 15","useful":0,"cool":0},"srbgp3OcBrtwNF6Mn6zlgA":{"text":"Went here with a group of four and a child. Pelican Club was very accommodating for the th","useful":0,"cool":0},"IKDt0Z2dQNhm2vRrYleiIw":{"text":"I appreciated the decor of this restaurant more than anything else. We came here for my co","useful":1,"cool":0},"4ryldoxZhHaoiU024uOs4g":{"text":"We stumbled upon this restaurant when others were filled....cannot understand why this was","useful":0,"cool":0},"vEbvbcPc_kJiBYAppb9bOQ":{"text":"We had to wait a bit although we had reservations. But the wait was worth it. The food was","useful":0,"cool":0},"5ULb7G5wVHr4_As6mN_EyQ":{"text":"The food was spot on. Table service was sorely lacking. Unknowledgeable waitstaff. Slow se","useful":0,"cool":0},"ee8bbPQ7cIrjn1s-btuuqA":{"text":"We were looking for a nice bar in New Orleans (much harder than you think). We found The p","useful":0,"cool":0},"T5dB4LWrhjvfGv8AMjghig":{"text":"Great food and fabulous service! Our group of 12 had a wonderful experience! New Orleans h","useful":1,"cool":1},"pMoPM2qzYsA_Jy_VmSt4vQ":{"text":"Food was excellent - we had the lamb and it was delicious! We did share a dessert and it w","useful":0,"cool":0},"BpvnfyUJ8tm__zk0iy6XDA":{"text":"This place is usually 5 stars. But. We went for a great Revillion Dinner. Five adults. Fiv","useful":0,"cool":0},"pdlhV9tVotPSe5MqaxdWeg":{"text":"The Pelican Club feels like a hidden oasis just a couple blocks away from Bourbon St. The ","useful":0,"cool":0},"MOirF0ZVMrtHGWvtzbpesg":{"text":"Jumbo shrimp with rice noodles, chilies, and pineapples in a spicy sauce served with garli","useful":0,"cool":0},"i4uplmu7FdlhEyo80SgFFQ":{"text":"It was delicious! Everything  i ordered was really really delicious! I had no complaints  ","useful":4,"cool":3},"oskgnKqbqXENl_qNSs-Q7g":{"text":"I've eaten at this restaurant before and had a much better experience.  The server spilled","useful":0,"cool":0},"IqZlCUeh6RqSThgnLJkQjg":{"text":"Great restaurant all around:  excellent food, service, and ambiance.  You can't go wrong w","useful":0,"cool":2},"V9Ay13j1OOmwGlxU-zVBvQ":{"text":"Come on!  This has the be the best kept secret in NOLA!!  Great vibe fantastic service fro","useful":0,"cool":0},"tfabRH-QWnRkyZGp90sobQ":{"text":"Good service. My martini had no alcohol. When I sent it back they brought it back with onl","useful":0,"cool":0},"hgtVq4OdvbW1KXGvZ9z5ng":{"text":"After checking out all of the Coolinary menus in town for the month of August, my girlfrie","useful":1,"cool":1},"r3bVy_LqgqIkqmVIzGShBg":{"text":"My best friend selected this restaurant for her birthday dinner tonight and I had never be","useful":1,"cool":1},"dkk9zxcIPacWRAAx-3uh9Q":{"text":"What a wonderful impromptu adventure! Stopped by for a quick libation and had THE BEST ser","useful":0,"cool":0},"hgqZ7F947lVZmBjAo8t8kQ":{"text":"Absolutely perfect evening at The Pelican Club. My wife and I went there about a week ago ","useful":2,"cool":0},"Nnm7fYhUI2BMJOWg5pG9Bg":{"text":"We dined here at around 7 pm on a Sunday evening.  The chose one of the 4 course meals whi","useful":1,"cool":0},"gteI6Wa1Ypzf9Cao5IwmQA":{"text":"I went here on Wednesday night. This place was busy, but service was excellent. I had the ","useful":0,"cool":0},"QLTCFjjDUdUOHesKNR_68g":{"text":"Ask for Adam at the bar, he makes the best Sazerac  in New Orleans. Had one from the Sazer","useful":0,"cool":0},"Gb4jbppTu8JaHsQQSg8zoQ":{"text":"Horrible service.  The food was ok.  I was looking forward to this place.  I visited the P","useful":0,"cool":0},"tMNjYH36bxbIZN094f4t3w":{"text":"Well we walked into this place and we were thinking rut roh nobody is here we said to ours","useful":2,"cool":2},"caPR7zEBbDjJ5oyl0U-5-w":{"text":"So delicious. We stumbled across this place by luck. Had to sit at the bar without a reser","useful":0,"cool":0},"dBCOEkqfe9KggF47Bz_rIQ":{"text":"Had dinner here for the first time. Overall was a great experience. Started with the Crawf","useful":0,"cool":0},"oRO_PFO4mQg5yx5d6eJLYQ":{"text":"We had the Mardi Gras 4-course meal or never would have eaten as much as we did. We both s","useful":0,"cool":0},"Jm8_3YcI9VjAHEB6v_1i2g":{"text":"The largest coolinary menu in town.  So many choices!  And normal portions too.  Can't say","useful":0,"cool":0},"Wx6OfY-CCQtvPZCOixsQDA":{"text":"Really fancy restaurant. Getting there was a pain since it is located deep downtown.\nYou w","useful":2,"cool":0},"fqJ8H5g-8W8wnVj0obvaZw":{"text":"Reveillon!!!     Im in Nawlins and its all about X'mas and Reveillon.  I love this city!!!","useful":3,"cool":3},"k7bTutaRIrqfGvx0Z6chhA":{"text":"Went for Revillon Dinner and it was fantastic. Great options for pre-fix menu, delicious, ","useful":0,"cool":0},"qdtzx7qLJnBaKbdXMhAiQQ":{"text":"The food was extremely good, the dining room a bit loud, but with ceilings that high, it's","useful":0,"cool":0},"j31PuRqstF-7khku7W3pWQ":{"text":"Me and my bf went here during coolinary month and have to say it was not what I expected. ","useful":0,"cool":0},"VKqIM5Q4__FqWQ720TRArw":{"text":"Let me start off by saying I had really good intentions and was super excited to dine here","useful":2,"cool":0},"i4xVyvpdOs-YAynlP2yOTA":{"text":"Been here several times over the years.  Last night I had the reveillion menu for the firs","useful":1,"cool":1},"k6Dk5ajYc_6AWZDa3-f2Eg":{"text":"Excellent experience from start to finish. I had the Duck, Shrimp & Andouille Gumbo; Surf ","useful":0,"cool":1},"PJb85tRm7REhvGCAMtE-QA":{"text":"Was in NOLA for work and decided this was super close to my hotel and had great reviews. I","useful":7,"cool":8},"qhximw8gxSNcbPGIz9gbzQ":{"text":"The food and service was excellent. We went for our anniversary, and enjoyed the Reveillon","useful":0,"cool":0},"tumBLqIxnu2goHwyEAt9gw":{"text":"I had seen the coolinary menu for The Pelican Club last year and wanted to visit ever sinc","useful":0,"cool":1},"u6zxVW82nmAg4eLUtjaK0w":{"text":"Open table had great reviews. My sister and I with our husbands like to meet in New Orlean","useful":0,"cool":0},"JO4Ji7cFNCZ9_NJ-CE9eig":{"text":"Super underwhelming. Let's \"dive\" right in. The hostess was frosty. I had called and asked","useful":2,"cool":1},"4Sl7duN1foJAfpvh4JjT6w":{"text":"Pre-COVID I thoroughly enjoyed this place, but our most recent experience was during COVID","useful":0,"cool":0},"QqdTEAq8mmddOzJKzvZYcg":{"text":"Went here for restaurant week and could not been anymore happier with this place. This is ","useful":0,"cool":0},"V7el4Yi3s_4ZvzjJ1h6aMA":{"text":"Fun location on a pedestrian street. Nice ambience. Very good food. We loved the cioppino ","useful":0,"cool":0},"5fq29zUM7_kGQABhuiJ1eQ":{"text":"The food was excellent! \n\nCame with our coolinary group to try out the pelican club. Since","useful":0,"cool":0},"q4nHU049AjKhz7dQh6XLzQ":{"text":"The Pelican Club, delivers again! Wrapping up my my Coolinary and Restaurant Week dining e","useful":1,"cool":0},"LQ7Nv27Nc1PlJfYNaZOY_A":{"text":"We are locals and came for COOLinary last night and wow, everything was delicious! The ser","useful":1,"cool":0},"ppGCe7B_KexVnu_nT2Kaww":{"text":"I am here to advise you all that EVERY, SINGLE Good thing you have heard about the Pelican","useful":3,"cool":2},"9IRdmK7iGXEhTZLD5CQJ2A":{"text":"I finally made it over to the Pelican Club for a Coolinary this year. And Yum! I'm sorry i","useful":6,"cool":5},"9N8sZzFXGqc60PF62MykcQ":{"text":"$350 down for Reveillon meal for 4. The food was just BAD. Bland, poorly prepared. The men","useful":0,"cool":0},"sTjbMPK9mtwKM8ZADD0fdw":{"text":"We went for Thanksgiving and we really enjoyed the entire experience. The service was fant","useful":0,"cool":0},"nHZPWAwN7knkxI_5_4GKDQ":{"text":"TL;DR: Great food, nice atmosphere, somewhat judgmental and rude staff. Read on for why.\n\n","useful":1,"cool":0},"YPJe7WDZXLLM0YDXU5P3Mg":{"text":"Went with a few gals for date night since Coolinary Month was extended!!! Everything excee","useful":0,"cool":0},"7mUvvrGJSdaiaMHkchYj1g":{"text":"Had always heard good things about the PC for years and decided to check it out. Started o","useful":1,"cool":0},"1HVzLKM0KE-3EvD3i77bbQ":{"text":"I had seen the coolinary menu for The Pelican Club last year and wanted to visit ever sinc","useful":0,"cool":0},"q0pu9xoYegQMtiCEgmdIhA":{"text":"Came into the bar for Happy Hour. Half priced drinks and $1.50 bakes oysters. Amazing!! \nA","useful":1,"cool":1},"H7rH-pFDLuEWoBgS-_LYZQ":{"text":"Our first time here after many times in NOLA. Everything was better than expected after lo","useful":0,"cool":0},"6J0q4p31r9qA9PvWtGYLpQ":{"text":"The food is always amazing. Catch their coolinary while you can. Best crab cakes. The esca","useful":0,"cool":0},"cv2FidAiOd2U1c7cd6VQRQ":{"text":"In the all the years we have been coming to NOLA  I have walked by this location since it ","useful":0,"cool":0},"Ab0gNisYGE5MXBzQLaLtsQ":{"text":"Went tonight to celebrate a birthday, plus for the free glass of champagne for the birthda","useful":0,"cool":0},"ATtd1139HHHqTQxA-aRCTA":{"text":"My friends and I went here for a nice dinner on the last night we were in New Orleans for ","useful":0,"cool":0},"-Z3osFtqaIqYYMn5YpJUXg":{"text":"If I could give zero stars I would. I went for a surprise birthday party last night and al","useful":1,"cool":1},"WjchSStpHhucTaPoDCnTdA":{"text":"Great Coolinary offering and overall atmosphere! Highly recommended, but be sure to make a","useful":0,"cool":0},"2qSIM85N2-EypQHvARsKvg":{"text":"THE FRENCH QUARTER'S \"CLANCY'S\"\nCurrently the city is going through a massive restaurant p","useful":10,"cool":8},"shdtpFnrbiN4-xC-1O6iRg":{"text":"Second time in one week! Love this place! The 4 course meal special is definitely a deal! ","useful":0,"cool":0},"HYH9z6K-ckCrmAeeygR55Q":{"text":"Would give it no stars if I had the option probably the worst experience I've have in a \"u","useful":0,"cool":0},"ji9KM6eAgdekXrWMmQxkeA":{"text":"This is was a fantastic choice for date night dinner. We did the coolinary menu which had ","useful":3,"cool":4},"_xVmiwgP9JHarDo021zuKw":{"text":"Wow! This meal was fabulous! Four us went for the $39 Coolinary menu.  Our appetizers were","useful":0,"cool":0},"qloofMNylfFlixAWCPAUNQ":{"text":"The food is good, but I think still a little overpriced for what I'm getting. My sister, b","useful":1,"cool":0},"1B666G0awRpvHq0NElDcPw":{"text":"We went with the 4 course option which was definitely expensive, but we were on vacation a","useful":0,"cool":0},"BHto3mgORGttOgNuw4Nllg":{"text":"All I can say is.. WOW! I do not know which part of my experience was my favorite, from th","useful":1,"cool":1},"0uixo6mFGeFTGHcDpX7fsg":{"text":"Oh my gosh what an incredible experience and evening at the Pelican Club courtesy of Ms. D","useful":1,"cool":0},"htk0tm3h3WBom2koSqx2_A":{"text":"Couldn't resist and had to have our last nights dinner 2 weeks later.  Specifically cravin","useful":0,"cool":0},"nS78ST18jeMRwSp7oWo9Bw":{"text":"This place is over-the-top amazing!  If you can get Marcus as your server, you have really","useful":0,"cool":0},"oRTA6qXZGBf2S_F0IYr6Yg":{"text":"I was very satisfied with the way everything looked and tasted. Beautiful restaurant! Eric","useful":0,"cool":0},"n3vV9iZUc4XCj9DcDdNVKQ":{"text":"AH-MAZING! Had a romantic dinner date here thanks to Coolinary month (side note--how freak","useful":9,"cool":6},"NdPg2IECNyrWuI_gry_a7w":{"text":"This was my second visit to Pelican Club, and each has been excellent. Good service, a lot","useful":2,"cool":2},"IeGX5udVgAsTbMmqHRexkQ":{"text":"Really delicious with a great coolinary menu! There are many options to choose from for ap","useful":0,"cool":0},"OIpaCA1l2jQZKwhSMi_vVA":{"text":"The food is really good here.  We tried the baked oysters, surf and turf, paneed fish, and","useful":0,"cool":0},"xPauoVbzoawqCXEhilNB8Q":{"text":"Really great restaurant especially during coolinary! Their whole menu is available for coo","useful":1,"cool":0},"jChekr94jyOBNJi5l3Qmlw":{"text":"Fabulous food and service! We went during restaurant week and got the fixed menu. The jamb","useful":0,"cool":0},"EqgJSMMfeurLxiO2nevWDg":{"text":"I held a business networking event at The Pelican Club for 45 people and it was amazing!  ","useful":1,"cool":1},"UhU3dhLcmILcfArrEzvOhw":{"text":"Stumbled upon this place and so glad I did. The food was amazing, atmosphere was great and","useful":0,"cool":0},"fNVpOgMH_1UGthumYqF82w":{"text":"What more can you say, great location and outdoor seating,great service, great food. The c","useful":0,"cool":0},"QJNVcgl2MsWcMZCiOcgP-A":{"text":"Went to Pelican Club for happy hour! Had a great bar tender named Jason who was wonderful ","useful":1,"cool":1},"2ADHmGkXDGgcb0nPnYAysQ":{"text":"Went to Pelican club during restaurant week, went there in 2018 and again in 2020. I order","useful":1,"cool":0},"45TDPyEIFxufd8JCF5iIVw":{"text":"Got a reservation quickly on Wednesday night. What a great meal and amazing service. Must ","useful":0,"cool":0},"-yfo_13lA4wqR5ixXRWJSg":{"text":"I visited The Pelican Club this year for Coolinary 2020 and I enjoyed myself, the cocktail","useful":0,"cool":1},"1KYdwjdtJeowAs_UdOC8Cg":{"text":"This place will always be special for me because that's where me and my husband celebrated","useful":0,"cool":0},"6-Ky2QhrLWjRszdTu3dKfg":{"text":"First time visiting New Orleans and first time at this restaurant.  We sat in the bar area","useful":1,"cool":3},"HTQ6BSn2WGGjeQ7bIQ93kA":{"text":"Tucked away in a back alley of the French Quarter, The Pelican Club is a beautiful fine-di","useful":0,"cool":0},"33IqRLtr3R_gTbW7Vn3N_A":{"text":"Wow! That sums it up. I saw this place on my last trip and have been dying to try it and i","useful":1,"cool":0},"tvd7agdrStogiqlYBWbGcw":{"text":"Nice location and ambiance.  Service was good.  Food was good, not great.  Lamb was notice","useful":0,"cool":0},"Uc42wN_GjQzer0PNhYLrwg":{"text":"Exceptional from start to finish. What a great experience. The coolinary menu is an incred","useful":0,"cool":0},"GiG_FMgMw5xtd4HJCwwYnw":{"text":"This meal was SO SO good. I got the sauces on the side but pretty much used them all anywa","useful":0,"cool":1},"Y_PJpOwIDPJokxc9pV0aWw":{"text":"Party of four.  The food all around was good. They have a price fixed three course menu.  ","useful":0,"cool":0},"CH3s1vWv3AWC6ZG-0S2ORQ":{"text":"Absolutely incredible experience! My husband and I were celebrating our anniversary and th","useful":1,"cool":0},"oFVExMGE2iQsFmZqz4Xoog":{"text":"This is such a gem! They have probably the best coolinary menu! Amazing dishes and choices","useful":1,"cool":1},"seepgjYMBORB0dQyEs9l2g":{"text":"We had a family reunion in New Orleans.  Three families made reservations using Open Table","useful":0,"cool":0},"mr6xifiMvud1Z4aT8fAufg":{"text":"We wanted our last meal in Nawlins to be a good one, and the Pelican Club delivered!  I ha","useful":1,"cool":0},"D1qhVVrSFubqS241djGmQA":{"text":"This place came recommended to me by a friend. It did not disappoint. Wow! This place was ","useful":1,"cool":1},"ZoTFjSZ_SkjkYREBFPmFXg":{"text":"Authentic New Orleans. Comfortable seating, moderately loud when busy, friendly staff, hea","useful":0,"cool":0},"SSBG_m2LtbXn4s8FPUBmHQ":{"text":"A friend and I chose Pelican Club for the NYE pre fixe menu. We were cautious to order dif","useful":1,"cool":2},"QdI1OUa0yP8KhOKNmbHP1Q":{"text":"DENISE! :-) If you need a reason to come here other than the outstanding food, come here f","useful":0,"cool":0},"UaTbi8vZB1gtOCE8StVfHw":{"text":"We thoroughly enjoyed our Christmas eve dinner. Despite a busy holiday restaurant the staf","useful":0,"cool":0},"ui191L1UXfZnj5Li1dZmCQ":{"text":"We came here for their Christmas Reveillon dinner. Despite the large crowds, we got seated","useful":0,"cool":0},"6ZPXUz_F-beL0uobB8GCGg":{"text":"My wife and I returned to New Orleans after a year of Covid restrictions and went to the P","useful":1,"cool":0},"8XsP-MbbuGl7wOzKG5h41g":{"text":"I dined at Pelican Club with my fishing buddy Keith and my Yelp NOLA friend Shannon S. I w","useful":32,"cool":30},"6Wqn7tX5HKuEpSiqn36bFg":{"text":"Great restaurant with amazing food. We couldn't pick what our favorite dish was. Denise ou","useful":0,"cool":0},"fP_7Jqsqm8GH9yVjXQm6FA":{"text":"My wife and stopped by the Pelican Club as we were celebrating an anniversary. I was a bit","useful":1,"cool":1},"jMrug8-sUPuxSesrDohUEQ":{"text":"Start to finish an excellent meal, one of my best while in N.O. Went with the prix fix whi","useful":0,"cool":0},"zsEpcGXtzMngy4eUk4cG0w":{"text":"We had a wonderful meal last week while in NOLA.  The restaurant, while a \"white table clo","useful":0,"cool":0},"Lyymrynp-4xEc3Ue0OvenQ":{"text":"As a tourist in New Orleans this is the worst dining experience we have had. We have been ","useful":0,"cool":0},"wLuExxyDmkuXcWWTU9SzRg":{"text":"Always excellent food and service Nicole is a gem and always greeted with a smile and welc","useful":0,"cool":0},"1omzOciACUdgro_3utCe-Q":{"text":"My coworker and I were told that The Pelican Club was one of the best restaurants in NOLA ","useful":3,"cool":1},"BYjlRqtQtiFa1akGRxV5sA":{"text":"Wow!!! Excellent meal!!\n\nWe came here last night for dinner and to be honest- we almost wa","useful":1,"cool":0},"SYGqcLFhf0lHaCX9Rbp9CA":{"text":"This place is a gem! Secured a last minute dinner reservation and the food was incredible.","useful":0,"cool":0},"5SyiMqUvKYJP-hiwF3uXcw":{"text":"The service was great this review is solely for the food. \n\nWe had our thanksgiving dinner","useful":0,"cool":0},"NJqEMXTGBLbmM5e9dl464A":{"text":"I really wanted Pelican Club to earn a 5-star rating, but it just wasn't meant to be. Trie","useful":2,"cool":0},"vCQGTqltnpRkt0IQRE5RMg":{"text":"This place came recommended to me by a friend. It did not disappoint. Wow! This place was ","useful":1,"cool":1},"G5KhUDYpC0UMrTeErZu9tw":{"text":"The food was great. Baked oysters and gumbo were awesome. I had a steak with red wine redu","useful":0,"cool":0},"TwIPS4rfBYS4vijZpZ-5PQ":{"text":"Our current favorite place to celebrate with friends. We have had several wonderful meals ","useful":0,"cool":0},"fC78V4KzTWYTAK7AGiylCA":{"text":"Fantastic food and ambiance. A must for anyone visiting New Orleans. Great for celebration","useful":0,"cool":0},"wYKzTl10kHbWtO0p7qfPrQ":{"text":"Our party of four had a miserable night at The Pelican Club Sunday evening, 4/18/2021. We ","useful":2,"cool":0},"WVD_7_0xBUXH2UrVKPldxg":{"text":"We ate outside since they didn't have indoor reservations. We did book over two weeks out.","useful":1,"cool":0},"iJ9LW490xdmJh7O_MMmOKQ":{"text":"Food is amazing but service is even better. Our lovely waitress' name was Denise and her p","useful":0,"cool":0},"9SNxNN5HqXOv22ODqEmSwg":{"text":"Absolutely wonderful evening!  Food was delicious, service outstanding, COVID protocols in","useful":1,"cool":0},"My2ycmxHvIFtZ3oC_Q8kmw":{"text":"JT was the best!!  And the other folks, the food and drinks were also excellent. Had been ","useful":0,"cool":0},"Do9seZxk3WihfQcNxZL4tg":{"text":"Came here for thanksgiving dinner and have to say it was one of the best meals I've ever h","useful":0,"cool":0},"I2ql8GztDkIVHMTMn59WUg":{"text":"Came here with a party of 6 for the Coolinary Dinner Menu.... You choose an appetizer, ent","useful":1,"cool":1},"cvJV8g4b4bqDSP_jg9_-wA":{"text":"What a lovely evening. We sat in the bar and enjoyed delicious food, fish was great. The a","useful":0,"cool":0},"Bc6e0bpQfnNkkJWRE3d3gg":{"text":"We had a wonderful meal here.  Loved the gumbo and carrot coconut ginger soup and crab sal","useful":0,"cool":0},"riBgox5a-UXLDsTbkRbE6Q":{"text":"A group of us went to the restaurant to help a friend celebrate 30 years with the same com","useful":7,"cool":6},"JGcE5YEsi_DieNRMPqXnVg":{"text":"@TravelNTings #TravelNTings great service, food, and drinks.  We like how it's tucked away","useful":1,"cool":0},"0SIFODqBakdEkxwYkezyoQ":{"text":"My friends and I had a great experience!! The food was amazing and so was the staff! The w","useful":0,"cool":0},"8STpCOZrCccBxU18jujBcw":{"text":"Went to the Pelican Club for the first time this weekend and had their Reveillon menu, whi","useful":5,"cool":4},"8FZ2ilGmCLghq9Bap6o_lA":{"text":"Service was great and Pony and Danny were delightful team. They made great suggestions and","useful":0,"cool":0},"R97zZTGNgMkhD20OyAsYug":{"text":"This is was a fantastic choice for date night dinner. We did the coolinary menu which had ","useful":3,"cool":1},"iCO6rFkVlkUJrBVdeOBGWQ":{"text":"what a surprise this place was. We sat outside and liked it was quiet without street traff","useful":0,"cool":0},"XOsRLIpK5F7dFxhEPHXViA":{"text":"Hands down the best meal we have ever had in Nola. Every dish was great and so flavorful. ","useful":0,"cool":0},"2QWQigFMs5ECOtTrg2ZOUw":{"text":"As a vegan with a seafood loving partner, I thought this would be the perfect restaurant c","useful":0,"cool":1},"htT8AgBe1wDmXj8SaoEOkA":{"text":"(This place you need reservations ), we walked in we were greeted ever so pleasantly by th","useful":0,"cool":1},"mOVSPPpbxXFcSqUiryVVRQ":{"text":"You can travel all over the world and not get better cousine. This is the best restautant ","useful":0,"cool":0},"zz8HMDKepZtQXgCFgiwp5g":{"text":"Great restaurant. Was here and did the Coolinary Encore Menu. I tried to make the meals be","useful":0,"cool":0}}