{"dzVLTj-3GssqR5mK3Nfjfg":{"text":"The venue was beautiful, Steve and Darlene did a great job, and our guests loved the weddi","useful":0,"cool":0},"yuxgLI8UHKRdjhTA4yG5Eg":{"text":"We fell in love with Rosy's the moment we walked in. I don't know how we hadn't been to Ro","useful":0,"cool":0},"FKmhUAtMc3PzAfx0i_1i4A":{"text":"OMG!  Steve and Darlene are simply amazing!  We live in SC, and my daughter wanted a weddi","useful":0,"cool":0},"WeS6T7g-Fdj5rJ3ZX8s5yA":{"text":"I just got married at Rosy's in March. Our decision to go with Rosy's was not that difficu","useful":1,"cool":0},"bxLmF7hqs39iW2CB5JU9Mw":{"text":"Our wedding at Rosy's Jazz Hall was AMAZING--I can't recommend this place enough.  The ven","useful":0,"cool":0},"1-5JXJrIkZUTxdXSaj7Iag":{"text":"Ugh! Where do i begin?  I met with Steve and Darlene about a year and a half ago, and fell","useful":0,"cool":0},"RKyUqZCXc9nJ4E5IpSaHuw":{"text":"Since its been a few years (2 to be exact) I feel like I can express my feelings on Rosy's","useful":2,"cool":1},"rh7gV7Yh20wwdguqIHAhSw":{"text":"Darlene and Steve, \nI can't even start to express my gratitude towards you both for creati","useful":0,"cool":0},"wN-fjIHrMCOpT4sCsaSpPg":{"text":"The staff and wedding coordinator at Rosy's was so easy and flexible to work with. They ha","useful":1,"cool":0},"w80WilrXSCkevhlgf57dgg":{"text":"Rosy's is perfect! The atmosphere, the staff, the food-perfection. Every single guest at o","useful":0,"cool":0},"jGsDAABju5Up6xhjKamgTA":{"text":"Darlene (wedding coordinator) and Steve (owner) are masters at their craft.  My husband an","useful":0,"cool":0},"wR2HinUyG28VoHVCOjcLTA":{"text":"We were here for a wedding and the venue couldn't have been better. The interior is full o","useful":4,"cool":0},"0xIHzRmMMctS-q8OMfZt2Q":{"text":"Wonderful place for a wedding!  The wedding area was great, with a natural feel to it--the","useful":4,"cool":1},"C3Yu1i1JcuqQNngixF0cAQ":{"text":"I cannot say enough positive things about Rosy's Jazz Hall as a wedding venue.  The space ","useful":2,"cool":2},"JuDvsKNdHhAEUT6ZTGtnXw":{"text":"The food can be touch and go and the place is a bit to small, but the atmosphere is great.","useful":2,"cool":1},"oa98AugEDEMfx9OCWoU6VA":{"text":"My wife and I had our wedding here on 5/29/15.  This place was spectacular.  We saw 3 othe","useful":0,"cool":0},"ARXulUNXNuj0B4T-XKngjQ":{"text":"I highly recommend Rosy's if you're looking for a place to get hitched in New Orleans.  I ","useful":7,"cool":1},"0UPn8vlvxqZoUKsrbiTRIQ":{"text":"We loved our wedding at Rosy's Jazz Hall! The staff was incredibly helpful and organized a","useful":0,"cool":0},"FS_uYTnShX-kwCnrnVEm0g":{"text":"Rosy's was absolutely amazing!! Our guests have been raving since their first sighting of ","useful":0,"cool":0},"2FevAVFTQMpaP2hYI1hGHw":{"text":"As a wedding officiant I do a lot of weddings in New Orleans so I have the opportunity do ","useful":3,"cool":2},"e5f0Ex5Cytlrx3gqpBRAWQ":{"text":"I'm pretty sure I ate in a restaurant in this location about a million years ago but it's ","useful":5,"cool":3},"7pGpwvZY4aPyXNtcmNdLdA":{"text":"I've been to 2 weddings here in the last 2 years and it's a lovely, intimate event space. ","useful":3,"cool":2},"in8T9D0IDZKIVc-Xa37-3g":{"text":"I've been wanting to post the review that I was looking for when I was trying to decide wh","useful":4,"cool":1},"b_53iNvnmfO9XkGMAkOkWg":{"text":"You know this place is pretty happening when there are 7 reviews that are \"not recommended","useful":1,"cool":0},"1oxXT9L9EpuozqDH4nJX_A":{"text":"We had an absolutely amazing time and are still dreaming about the whole day and night! I ","useful":0,"cool":0},"feTe16sAa3FiDi-EmG3yIw":{"text":"Rosy's was simply the best, most magical experience that we could have hoped for. My (now)","useful":1,"cool":0},"SmuGS-uocY96mz2arHDJRg":{"text":"Rosy's is the absolute best. I did not have the money or the time to shop around at a mill","useful":0,"cool":0},"wSJoopD6sXsD35T-zTpSVQ":{"text":"I was here for a friend's wedding and the venue is really cute!  The surrounding neighborh","useful":7,"cool":1},"dYuJWTE4gv9qa7GfXeKg8Q":{"text":"I can't say enough about Rosy's!! Our wedding was literally perfect. Besides being the mos","useful":4,"cool":0},"V9Sn3YHCrnbm278jSdv9cg":{"text":"We loved everything about our wedding at Rosy's! It was the perfect venue for our wedding ","useful":0,"cool":0},"85-5A5l8ZOvSpIi3zwxcBA":{"text":"We had our ceremony and reception at Rosy's and could not be happier with our choice!! \n\nI","useful":0,"cool":0},"obvrADzh6QnxnfYvEJBEZw":{"text":"I had an amazing time here for a wedding this past month and really enjoyed it! The venue ","useful":0,"cool":0},"0ndD7eGQ91He0I6cgYU6QQ":{"text":"The food, service, location, and just the venue overall are AMAZING. We had our wedding re","useful":0,"cool":0},"zT_Nmujeu07MOIomg8ARnA":{"text":"While we've yet to host our wedding at Rosy's - I just wanted to praise them for how accom","useful":1,"cool":0},"Y9xUDQGEtydalmXBBhZrZg":{"text":"I love this space. It's intimate, has character and a lovely middle courtyard/atrium with ","useful":7,"cool":4},"KKURCBFtOMWEV52jF8fzxg":{"text":"So first of all - kidnap Darlene.   There will be other couples out there that need her se","useful":0,"cool":0},"Gg08L9QgnoXailRZYxyfGw":{"text":"Everything about Rosy's is incredible! First of all, Steve was great to work with. Always ","useful":0,"cool":0},"feMaEn5I7eYJLWi24zPdLA":{"text":"My husband and I had our wedding at Rosy's Jazz Hall on 12/11/21 and it was unforgettable.","useful":0,"cool":0},"d0xvKr_q3mlmLIKwCE5A0g":{"text":"Very recently I attended a small wedding here. The venue is intimate and lovely. The cerem","useful":4,"cool":3},"WaDupT2I_uJrIPohu04eGA":{"text":"The atmosphere of Rosy's is vintage New Orleans, classy  and cozy. The rooms are sectioned","useful":4,"cool":1}}