{"HPE4_SI5HCkKaDwi_tXSGA":{"text":"We ended up staying across the street from Cafe Henri, so it was an easy dinner spot. 3 ou","useful":2,"cool":1},"7b9QlZU94ZZcEFzi6EAJ-g":{"text":"Drink was okay. But the happy hour Tom Collins cost 6 bucks plus tax...6.65 for a happy ho","useful":0,"cool":0},"g24JGuXfvQplKw0I_AYJQQ":{"text":"Opened recently and is one of the closest restaurants to my house.  Great decor and interi","useful":0,"cool":0},"insHnT9aOWJbLLxF-ceRIg":{"text":"Great little spot for dinner! Everything we had was delicious and the service was great. M","useful":0,"cool":0},"5VxwJtjiaXBQNSJXEaTx5A":{"text":"Cafe Henri is a small wstaishmeny with very good service and food. I went there for Sunday","useful":0,"cool":0},"JRoIXIAuOq3LfUdKRXYa7A":{"text":"Cafe Henri does an excellent job of creating a calm, warmly-lit atmosphere for all who enj","useful":0,"cool":0},"-EstKAMMUrdfibFo2SnfNg":{"text":"This place was lackluster at best. We ordered the burgers and they were very dry and overw","useful":3,"cool":0},"m3nz56mM8Yf3BKYtgh192A":{"text":"Ok folks there's a new Sheriff at Cafe Henri and he's laying down the law with some great ","useful":6,"cool":2},"4sxjrRwGo-JYOZ8_wlwznw":{"text":"Manager Matt (beardy) and Bartender Matt were awesome!! Drinks - dope, service - dope, foo","useful":0,"cool":0},"_R_jLv4Ax7tN2i1HTtgugg":{"text":"Cafe Henri came highly recommended but we were disappointed. Food was mediocre and they we","useful":1,"cool":0},"Fvl7RF1n7sje7tk8aZSlSg":{"text":"Not coming back here again. Menu was super small and they were out of items as well. Drink","useful":0,"cool":0},"_1usiRvh2Pts6l4HjinyAw":{"text":"I take guests here on tours of the Bywater restaurants and we're always treated great by t","useful":0,"cool":1},"x9kSagDWqmMjD3j4N0sLrA":{"text":"Underwhelming.\n\nI really don't like writing bad reviews, and Café Henri wasn't BAD, exactl","useful":10,"cool":3},"4oTfiZQYtTrg7ev5sTVKrQ":{"text":"Excellent cocktails and a rotating menu of delicious food.  I have eaten here several time","useful":0,"cool":0},"i_fOu1Xh30ojZycUaAFdLg":{"text":"Came here for brunch this past Saturday with the girls! Definitely a cute little place! I ","useful":0,"cool":0},"YagQaGEmP7XHhfnzt5sOIA":{"text":"I would love to love Café Henri, since I live half a block from it, and I did love my firs","useful":0,"cool":0},"QC5Qen1f_O5OoZfYRIfg2w":{"text":"Had a fantastic dinner. Our table was not ready on time. A mix up. No problem, went to bar","useful":0,"cool":0},"0llZq1W9F2h7NjedIDKkQw":{"text":"Service was great but that was about all that was above average. Food was fine, but nothin","useful":1,"cool":0},"LLbYh-HAY6PHftlujJHXUA":{"text":"Food is great. Drinks are even better. Scott the bartender is knowledgeable and super frie","useful":0,"cool":1},"RsNLGfxJkyzPurTRHPGzIA":{"text":"Service was good went for brunch food was delicious but I had the steak and eggs cooked to","useful":0,"cool":0},"DbUAuDOBctpzFUT4KUPoAg":{"text":"Amazing no frills bar. No drink menu; just ask and ye shall receive recommendations and ki","useful":0,"cool":0},"_tEbRTrtg7V9X0k27diOgg":{"text":"This is my new favorite place to get coffee in the Bywater. The barista, Alex, makes gorge","useful":0,"cool":0},"8ipOheArtZrsj_yt_J4v4w":{"text":"Cafe Henri is a charming gem in the Bywater neighborhood. Here's why:\n1. Everyone who work","useful":0,"cool":0},"fNCY2Fb7lmIcaAF2w3r0ng":{"text":"We had a very weird experience at this restaurant last night. There was only one other par","useful":4,"cool":0},"pvNSs2xqmH_fcLPLsi3mLw":{"text":"First, it is a pretty room, with nice backlighting behind the bar. The chicken liver start","useful":0,"cool":0},"qcCCawTl9uabeeATtLcZIw":{"text":"Great addition to the neighborhood...classics done well (steak frites, martinis) very atte","useful":1,"cool":0},"pl65gtlsVVpWgKwwstXuBQ":{"text":"We came on a random Tuesday night and found one of the best food deals in the city, as wel","useful":1,"cool":0},"6lZ8KMxqpBXJkHL7mzYnYw":{"text":"Absolutely fabulous! It was packed the night we went but the staff treated us like we were","useful":0,"cool":0},"V7hoiCajBMOnuQRwi1YHMw":{"text":"I like the new owners idea craft cocktail simple but upward food. I have tried frozen negr","useful":0,"cool":0},"q-irRSTz9Ux1HVVvTlHeSQ":{"text":"A nice space (not much changed from Boutte's Street Food) with a cute bar. A bit on the lo","useful":5,"cool":1},"KWafh_LkRMKC94TK4jyd6w":{"text":"Definitely one of our favorite places in Marigny/Bywater.\n\nWe've been in for drinks and di","useful":0,"cool":0},"bnOEXjc_Grb9Eg-h9nIT4A":{"text":"Small plates (tomatoes, crab pasta) very bad and too pricey. Hopefully entrées better. Nic","useful":1,"cool":1},"lzxq2p63MAdPWiUj7aHC4w":{"text":"Phenomenal brunch and really attentive service. Highly recommend checking them out for an ","useful":0,"cool":0},"ugfRYl2KYnST8yXNhYWpYg":{"text":"We had a wonderful meal and great service. The buttered radishes and vegetable tempura wer","useful":0,"cool":0},"VRb6vHcMsSHd9NlPsihyTw":{"text":"As I walked into this Bywater bistro, I took one look at the trendy, well-lit space and hi","useful":0,"cool":0},"gUucQyPXNlYVtZ1kWJkefw":{"text":"Staff was exceptionally attentive. Had both the Pate and the anchovy apps and both were de","useful":0,"cool":0},"D53EuBpD8uZhKv6fY4Loaw":{"text":"As I stand watch over the pot of non-boiling water to create tomorrow's half hearted versi","useful":5,"cool":4},"muobh8ocPaRF5PUyyC0FTA":{"text":"Really awesome fries. Great strawberry shortcake. Really good service and interesting arra","useful":0,"cool":0},"y5LSij_O7LLt4ZFBpdlL9A":{"text":"Two words: Frozen Negroni\n\nLet's be clear, this is a neighborhood restaurant (too nice to ","useful":1,"cool":0},"lcclKFn1TbDij7kvPqH_PQ":{"text":"Easter Brunch consisted of avocado toast and fried chicken sliders.  The sliders came with","useful":0,"cool":0},"hLt1AQC5RtQ8MXrEaQRR1A":{"text":"Perfection.  Amazing food.  Great wine.  Excellent service.  Very fair prices. We had a th","useful":0,"cool":0},"W_3bkakQCfWovRWyVUlVuA":{"text":"we went about a month ago. space is cute, slightly improved from booty's. but the food was","useful":1,"cool":0},"aTxW1ESTssXW3vVe0nqXGg":{"text":"Really wanted to love this place. Service was very good (tall male waiter was very attenti","useful":0,"cool":0},"fc4AQGZNbV_8r53TtR2aUw":{"text":"We were told a couple months back to give Cafe Henri another try. Even after their new che","useful":1,"cool":0},"djKGEh4rBMAfH9YdVMQPgA":{"text":"Chicken sandwich,Chicken sandwich,Chicken sandwich. \n\nWe were here 5 days and ate the chic","useful":0,"cool":0},"WTdDytVygs1Ti_ORzBNVFA":{"text":"Just visited this new little gem for lunch. All 3 of us were very pleased with our lunch m","useful":0,"cool":0},"EyJe-2DMiDxoVaj4O2HGng":{"text":"Went here for dinner last Saturday. Went here a couple of times when it was Booty's street","useful":5,"cool":2},"IQorVOhn2Wn3GHiF_gSWTg":{"text":"What a great neighborhood place. The atmosphere is clean and friendly, the concise wine li","useful":0,"cool":0},"CF15rHX3SLib_8qL2DvcaA":{"text":"My husband and I went to Cafe Henri for Saturday brunch and had such a great experience (f","useful":0,"cool":0},"XDoxTm0CksAF7OAgod5Siw":{"text":"The drinks are pretty good.  But they are expensive!  The decor is very nice. I like that ","useful":0,"cool":0},"zRCyVJQf12mL6O41Md3Pcg":{"text":"A few months ago, I wrote a review in which I mentioned several unfortunate meals; however","useful":0,"cool":0},"YrKfmRjsFFoTbvX5MoB5rA":{"text":"Found a piece of disgustingly long hair in the Beef Carpaccio with Fried Oysters. Very uns","useful":2,"cool":0},"tn8HeCeKCN2dJxXV9Ges2g":{"text":"We had the shrimp and grits and they were fantastic, the best during our stay. The trout t","useful":1,"cool":0},"-eYjQhAZla1nIXwHAcncWA":{"text":"Cool crowd , great staff , the food was top-notch and moderately priced. The lighting was ","useful":1,"cool":0},"XxZmABSnFNI5bNNwJklk-w":{"text":"If you read some of the reviews below, they give this place a hard time. My experience was","useful":1,"cool":0},"YHHAf-mQSQOxHfMqaautdQ":{"text":"I've been to Café Henri(I believe it's pronounced \"on-ree\" but this is 'Merica and the 4th","useful":1,"cool":0},"0XRqqdQBOO_vAaaZCYtWqA":{"text":"A new mom, an infant,  a pescetarian, and a gluten/dairy free woman enter a restaurant....","useful":1,"cool":1},"MDz_dCmb7J06PVBGFbhXKg":{"text":"We live in the neighborhood and have been here several times. Sometimes I'm happy; sometim","useful":2,"cool":0}}