{"2W7KSuqa1f8Q1bW8MqybEg":{"text":"In all of New Orleans and all of Materie, this is perhaps the best food I've had here. It'","useful":0,"cool":0},"0-38ND5yYUSmAYkZgH4Lkg":{"text":"Great food , great service - wished we'd walked that way down Oak Street sooner in our vis","useful":0,"cool":1},"cSJLJnR7heU7ONr709BOlg":{"text":"Great off maybe the beaten path where we could\ntake the trolley car back  to Canal.  Menu ","useful":0,"cool":0},"7StWVPkAVlVSd-un4M6hnA":{"text":"I've been to Cowbell twice now, and I must say judging on food, this place was amazing! I ","useful":0,"cool":0},"h6K9ISSiiZLn7t3SfBCy5g":{"text":"Excellent food and atmosphere. The housemade sauces they give are delish. I had the chicke","useful":0,"cool":0},"ZdxlCoxuLA7C87hvC0mpZg":{"text":"Cowbell definitely exceeded our expectations. It was slightly hard to spot at first due to","useful":1,"cool":2},"lyoYdm60wQ9xB-f-JkaSsQ":{"text":"I am late to the Cowbell trough but I hope to make up for lost time. So far, my two visits","useful":2,"cool":1},"1j2TDFGif-52W-IurI6uyA":{"text":"Ok ok this is going to be a big bold statement... but it needs to be stated. The best hamb","useful":3,"cool":1},"FFcU642pREB887lXnDlBzA":{"text":"Very pleased.  What great ambiance.  Small very nola.  I am a local artist and enjoyed you","useful":4,"cool":2},"r_nvAqI1-tEWfFptFYUccg":{"text":"Now since I'm home in California, I just wanted to update that we voted Cowbell as having ","useful":0,"cool":0},"xwvl88oTIwizsz5Dx_qt8w":{"text":"OMG def one of the best mac n cheese in the US!! The dish had 3 types of cheeses and pobla","useful":0,"cool":1},"2wcUbaXCFB7XzL7VUKO3rg":{"text":"Don't call it a burger joint. They're cooking up amazing sauces and entrees. It's an amazi","useful":3,"cool":1},"YOEsTATyh_WmxfajewLb9g":{"text":"Love this place!!!! The food was beyond delicious. Grilled chicken was tender and juice. I","useful":1,"cool":1},"RebBBLgOFQ-0AEkzlj7Peg":{"text":"Service was friendly and fast, burgers were great. Its 10.95 for the standard burger and f","useful":1,"cool":2},"Y-hg8wGvKg0PU2BkxzqBlQ":{"text":"I visited Brack May's Truck Farm Tavern in St. Rose first and was utterly amazed... The ne","useful":1,"cool":1},"iIpcUNJXmZLS0kd80jVNDg":{"text":"Arguably the best burgers in NOLA but I'd say Company Burger gives this place a run for it","useful":5,"cool":2},"mZV-0FS5Qc9IScBTLZZpKA":{"text":"Best burger in New Orleans. I had it with egg, bacon, and cheddar.","useful":1,"cool":1},"lcL9ihrZVUT81Kx5gTSKog":{"text":"The burgers here are awesome: juicy, cooked to request (I ordered medium and it came perfe","useful":2,"cool":2},"3L8SQkpMemrBfvmmz9b3Eg":{"text":"I'm a big fan of a good burger.  I've hit all the local favorites many times over.  I thin","useful":0,"cool":0},"v05hCrWdNNNYaSBBffzUSQ":{"text":"The perfect burger?  Could be.  I had a burger with blue cheese.  As others have noted, th","useful":0,"cool":0},"MDGxG-yo7Rz1goYEvVZgnw":{"text":"The food was very quality, from the creaminess of the Mac & Cheese to the sharp cheddar us","useful":0,"cool":0},"eV6kjnvURNjOEtR3uYl-GA":{"text":"OK so I've been searching for the best burger in New Orleans and well, I know I'll never f","useful":1,"cool":1},"5Qaxhb_hYONJVMuWqLaERA":{"text":"For my first visit to Cowbell, I was on a mission to try their burgers. I wasn't sure if i","useful":4,"cool":4},"od_fXohETTc3fMjHDVoLFQ":{"text":"Tag Team Hospitality with Amazing Food\n\nFrom the minute I walked up to Cowbell I felt like","useful":5,"cool":7},"lvLwBI2UaBkqSh4FjDZrgw":{"text":"Another 5 star place in the N.O. Everyone was nice & accommodating.  The burger was one of","useful":0,"cool":0},"8o3uOkSYYyj2GUpoWsxGNg":{"text":"Great food! We enjoyed everything we got. The quesadillas were the bomb...got Mac and chee","useful":0,"cool":0},"qh1F-MRd0asxyha6XtnwQw":{"text":"Cowbell is an adorable little restaurant with a unique vibe.  It's very relaxed and friend","useful":2,"cool":1},"77sEOt3qcBZLO6SeOlHCRA":{"text":"Another good NoLa recommendation for us Chicagoans. Real cute decor, friendly and colorful","useful":0,"cool":0},"6EY42pp3c5EMTw36o0G_xw":{"text":"After a few visits, it's safe to tip my hat to Cowbell and say this is the best Burger in ","useful":1,"cool":1},"faE7X_o7RSwNAP9cL_b8tQ":{"text":"So I finally got out to try this place and it's true what they say: the agogo sauce is out","useful":3,"cool":3},"VsEwhLEKpHipn2sn0Oufag":{"text":"I've got a fever, and the the only prescription IS MORE COWBELL!\n\nWe moved to New Orleans ","useful":0,"cool":0},"MxsvR6NOHmoiUI3ZAkrDbA":{"text":"Cowbell, I love you!\n\nAppropriate staff training.  That has made all the difference.  Ever","useful":4,"cool":3},"r_Q3fo20_kPJSIMwlisM4g":{"text":"Instant favorite! Best burger I've had since living in LA. Also their homemade ketchup is ","useful":1,"cool":1},"x1bbSNofis8xspIwYLldaQ":{"text":"Cowbell is an eclectic treat both visually and in terms of food. The atmosphere is incredi","useful":1,"cool":1},"lQN8x5znb_pvMiL4lRMJmA":{"text":"Best burger in NOLA.  Short wait at lunch on a Friday.  Staff is friendly (but not too fri","useful":2,"cool":2},"vIZ5JNqoHg2anfqeAsbQzQ":{"text":"I met my darling at Cowbell for lunch yesterday and was extremely satisfied with the exper","useful":2,"cool":0},"KbGUR1MxbAoV2E-lvYlzRg":{"text":"i love how they have their own ketchup AND siracha mayo, i give them 5 stars for that cous","useful":2,"cool":3},"Zim7FyGT4N0ZeqsA5n1qVw":{"text":"Best burger in NOLA for my money. This lovely restaurant is set inside of an old garage wi","useful":5,"cool":2},"SnBxDf0KLxyaKpjq1A67rg":{"text":"Excellent, creative menu. sophisticated twists on old favorites (grilled cheese with aspar","useful":3,"cool":2},"KiXabmPFKsB0dujqOHAuMQ":{"text":"I love the atmosphere and the food is great! Service is always fast and waitstaff is alway","useful":0,"cool":0},"kRZZiql-AMX7XUO4oLL6Tg":{"text":"Came here with a huge group (like 15) and they were super accommodating. Great food, wonde","useful":0,"cool":0},"zlZInGJjvOTQTWz4P6RjSQ":{"text":"The food is good, which is the only reason why I put two stars instead of one, and why my ","useful":0,"cool":0},"3oO-Mz1p6WGxtNu2D08h1Q":{"text":"My Favorite Sat lunch spot for cheeseburgers, mac&cheese, brunch and Ball Sukahs. Best coc","useful":0,"cool":0},"tbkGX1GUVMbXq2iARztRQQ":{"text":"One of the best burgers Ive ever had.  Cheap, nice ambiance, lots of parking.  Can't wait ","useful":0,"cool":0},"8eesG-DnjOhwBBwerMsyHg":{"text":"To die for burgers and fries. Also very fresh and delicious salads and fish tacos. Nice ou","useful":0,"cool":0},"4fiV7xfOq0-wghIcBMBXYA":{"text":"This place is great!! The service was awesome and so was the food. Glad I got the Mac n ch","useful":2,"cool":1},"unvzEG1TN3u1BBtyUkcmew":{"text":"After living in Carrollton for almost two years, I FINALLY made it to Cowbell for Saturday","useful":10,"cool":10},"dQYtWZ9wy17rKSH6JRPjzw":{"text":"One of the best burgers in the city. I went strictly to try the burger, although they have","useful":3,"cool":1},"cZ9B63eWFXMM0L_umq5xZg":{"text":"\"Adult Grilled Cheese\" is my absolute favorite meal off of the menu. Every time I go I hav","useful":0,"cool":0},"ui3kVax2eDJcx7oP9Vi2Bw":{"text":"Ain't the cheapest burger in town, but it's arguably the best. Cowbell is located in the \"","useful":2,"cool":1},"CqcLcDmKjZI7mp6tydgaUQ":{"text":"It wasn't until my third attempt that I actually made it while it was open. I know they ha","useful":1,"cool":1},"u_Jak21tj5gLzeBkakTlEg":{"text":"Damn good burgers, juicy and just the right size. Homemade Ketchup and agogo sauce were ad","useful":3,"cool":2},"fxW6uUAPuXmvlCQ-e_hKsg":{"text":"What an inventive and well executed menu.  \nReturning from a day at the zoo with my family","useful":0,"cool":0},"uXtktY69uxHluEU_RqIbAw":{"text":"The food was very good. We tried the red bean and rice veggie burger. It was great. The fi","useful":2,"cool":0},"jCZ5n26CkMknRCYJp9J8lw":{"text":"We sat at the bar because we didn't feel like waiting for a table. I like sitting at the b","useful":2,"cool":1},"aB8NVQwn9NKnHpEbWg5ejw":{"text":"The space feels open and the vibe is friendly. Good beer selection. The chef definitely ho","useful":2,"cool":0},"d6L1zGBxWQpU_XliITHbOw":{"text":"I really want to love Cowbell. Although after my first visit, I have to say I am only in t","useful":4,"cool":1},"c4adhtOcOAHmKrHiX4XAhg":{"text":"Be prepared to take an epic nap afterwards. I personally like to start off with the chili-","useful":1,"cool":1},"HH48Ju8TXJWrBl-tL0OPkA":{"text":"My favorite burger in New Orleans. I've tried a lot of burgers in the city and Cowbell win","useful":0,"cool":0},"8CMnBZJJGx2OSegta6d0hA":{"text":"This is by for one of the better experiences I have had at a local joint in NOLA.  Before ","useful":2,"cool":1},"XmVYBEWWrBOpCqUC803lRg":{"text":"Brought a out of town business buddy here, after he commented, \"I didn't come to New Orlea","useful":3,"cool":4},"UxJxbAddFSWu4UtXjZUh1g":{"text":"Cast Iron Chickies are some of the best wings I have ever had. I will dream about them whe","useful":0,"cool":0},"ALk03TlZIBbqFQ_Rxlsr6g":{"text":"I really wanted to like Cowbell.  It has such great reviews and I love a good burger.  I t","useful":2,"cool":2},"EU83dalKExuhL6FV8ZdF3w":{"text":"I continue to be amazed at how many establishments destroy so much hard work with vent hoo","useful":3,"cool":0},"eSZSyCAKo-B8g7eftW6-jA":{"text":"Good food and loved the cocktail menu. Their mac and cheese is TO DIE FOR. \n\nWasn't too im","useful":2,"cool":1},"FY4RgvLgE_I0jo-dqPnFCA":{"text":"Ugh cowbell.... How you've let me down... I went last night with four of my friends at 8 p","useful":2,"cool":0},"GgipYwNBHq11WbsN3rub-Q":{"text":"Unless I am out of town, I find myself at Cowbell at least once a week, and they can hones","useful":2,"cool":2},"hefOMQJJcyv2BlLP12KvxQ":{"text":"Cowbell achieves on all levels: the atmosphere, service, food, and drinks/cocktails are al","useful":1,"cool":0},"mziw7n4-j4nBa-AzTkvmgw":{"text":"I'm surprised I haven't written a review for Cowbell yet! I've been here a few times so I ","useful":1,"cool":1},"pY182ANmrRnPGViR3lDbnQ":{"text":"I had fish tacos and were amazing. Will return again and again as everything looks so deli","useful":1,"cool":0},"7REP9NVGDDAUzFV5b_E18w":{"text":"Excellent food, but never ask to pay with more than one card!  Simple math eludes them, th","useful":0,"cool":0},"kiLjvippB38EjEPAuc_fyg":{"text":"This place had me at its decor. Great outdoor seating area, kitschy decorated interior and","useful":4,"cool":3},"DBUfkGCdkKUd5mbejCQWug":{"text":"Ok, so, I avoided this place for a long time because I'm not a big hamburger fan (yes, we ","useful":0,"cool":1},"w7nhfblUiG7eoP9vfih5GA":{"text":"I enjoyed the hell out of my burger... I didn't like the wine reduction compose that much.","useful":0,"cool":0},"a_d1SCJRu13omk_-1TRzqg":{"text":"Very good hamburger.  All the members\nOf our party got the cowbell and everyone was happy.","useful":0,"cool":0},"2-S2JwZ4N5AQT03szxbvSg":{"text":"I was visiting for a few weeks and never had the time to eat in, but was lucky enough to g","useful":0,"cool":0},"vd8cSb3Gl2lwBtb-PpTgHg":{"text":"Burgers were good, fries were great \nSauces were awesome \nMac n cheese was good\nWould love","useful":2,"cool":0},"j6mRy6wvDjyI86gtEjLplQ":{"text":"Mmmmm, cowbell. Everything I've eaten here has been delicious, and at a fair price. There'","useful":1,"cool":0},"1ubjrJjJpw_54mTHB_b69g":{"text":"Food was pretty good and prices were OK, but as other comments pointed out, the tone of th","useful":0,"cool":0},"Gf9FCkTWgiTGVd9dKYztqA":{"text":"I just wanted to give everyone at Cowbell a shout-out, I miss you guys soooo friggin much!","useful":0,"cool":0},"5sElPmp0_vYqoeo5uxOOyg":{"text":"My favorite burger in Nola. Hands down. Keep it up y'all!! \n\nOh and that mac n cheese? Yes","useful":0,"cool":0},"p7TKuE2opVVUw0_KguYT-w":{"text":"This was my best burger in New Orleans.  Biased review alert.  I was training for a race a","useful":4,"cool":2},"X6afihIY6kY9oghvQ2lbTA":{"text":"My husband and I live very nearby and we would order their burgers as takeout ALL THE TIME","useful":0,"cool":0},"34R4nmcpA6JWRYqjY_DDyg":{"text":"The burgers were delicious! I visited there this past weekend. I had the Cowbell burger wi","useful":1,"cool":0},"nhR-sukcUcJQXSh1VwbGUA":{"text":"Great burgers and clam chowder! I got a burger with Swiss cheese and the zinfandel/bacon/o","useful":1,"cool":0},"31Sw7tMPRGKLpdZmFHngOQ":{"text":"This is a FANTABULOUS lunch place!!! Dipping sauces for you hand cut French fries!!! Great","useful":2,"cool":2},"HHFASgL66k7HVyzrTyY-Lg":{"text":"My partner and I enjoyed an evening at Cowbell this past Friday night, the first time for ","useful":0,"cool":0},"Ef-NTZWcRSOIcoA7ouOZpA":{"text":"It has the charm of your aunts farm house and the food of an upscale burger joint.  the ho","useful":3,"cool":0},"ccENErNKMlzZlceFTTRdGw":{"text":"Despite our best efforts, life gets cluttered and stressful and difficult. Pets get sick; ","useful":16,"cool":12},"qwwB-OxbErmpfsBWW-6xwQ":{"text":"I really only have two problems with Cowbell.\n\nThe first is probably nitpicking, and has t","useful":3,"cool":2},"zez5PdcOltdgOmo7oTEkjQ":{"text":"I arrived later than expected, mostly because I couldn't decide where and what I wanted to","useful":0,"cool":0},"66kndgalv0UMEdCeJcYQTA":{"text":"Finally made it here after 6ish years. Mac and cheese was incredible. Burger was excellent","useful":0,"cool":0},"D0yivJLBIuTCcnkFSl2XiQ":{"text":"Burger and fries were good but service was horrible. There is a rule they have that people","useful":3,"cool":0},"W2phJk4548EB0tAk_mFA2w":{"text":"So let me preface this by two facts about myself\n1) I dont really like ground meat (its a ","useful":1,"cool":1},"Xd4P5N1VbinL4U_DgPt0Fw":{"text":"The food here is great! If you can look past the service issues. A little pricey for the p","useful":0,"cool":0},"cSSCFaArXFqImbZleEkqOA":{"text":"Cowbell is quite possibly the best neighborhood restaurant out there. It may help that it ","useful":1,"cool":1},"R4MxKYlGMMs4SSmRHOjsEQ":{"text":"I was in New Orleans for work & met up with a friend for dinner. I was staying in the Fren","useful":3,"cool":1},"MHQ6YOhmkAFWBy5i98P5mw":{"text":"I do not know how to respond back but thank you for your inquiry. I am tryong to recall th","useful":2,"cool":0},"g_mD5VXpw0uvLevItqVS_g":{"text":"Cowbell is amazing! I am mostly vegetarian these days, and I must say, Cowbell makes the b","useful":4,"cool":1},"KOoAnuQYmDNPrrUcxvOoUg":{"text":"Best burger in the city. I've tried Company Buger, Tru burger, Port of Call and Cowbell wa","useful":1,"cool":1},"Sfy0w9eVy9EKBH38tF25mw":{"text":"Everything here is fresh. The burger was still seasoned with a great flavor.  They cook th","useful":0,"cool":0},"u0H0NWkLlHuwNlxw64VYMQ":{"text":"Try the chicken and waffles when it is available(it was on their daily specials list)! Bes","useful":4,"cool":0},"1cmWpmBnei_082ZIfA2nnw":{"text":"Had the special burger of the day. It was an Hawaiian style burger and all the fixins were","useful":3,"cool":1},"RtJ-jq5UvWknJ-zpMRcIEA":{"text":"Excellent burgers with fantastic service.  Without a doubt, we will be back to the Cowbell","useful":0,"cool":0},"mXQE3GK92MQbErpIv9_RyA":{"text":"Start with Mac and Cheese and everything else is as good as that creamy wonderful dish...\n","useful":2,"cool":0},"4yJ0o9MIInpa3mFiWf-oJA":{"text":"This was our third day in New Orleans and we've gone to some of the traditional tourist re","useful":0,"cool":0},"TRyryMD92ibfU13CAWf5YA":{"text":"YUM-O!!\n\nOne of the best burgers I've had in a while!! It was so tasty and I enjoyed every","useful":4,"cool":1},"CIJdXi2de1IBGmEXU9ESzA":{"text":"Their Harvest Burger is easily the best veggie burger I've ever had. Added a piece of whit","useful":0,"cool":0},"I0UbOlMem8Y6m545-ZFJMA":{"text":"We ordered some burgers to go recently and they are back on track! The burger was juicy, b","useful":0,"cool":0},"MDl9TymhRJkjvBtXud0l1g":{"text":"Had a pricey burger in this fun little joint. A tasty burger but a pricey petite one. Bett","useful":3,"cool":0},"hblzxL2MB450XM9W6Vx31g":{"text":"I've tried here a few times because I heard / read all these great reviews and I just work","useful":5,"cool":0},"nz8yRcW4PeAouS_ofezNHw":{"text":"The first star is for the wait staff taking drink orders while we waited for a table outsi","useful":1,"cool":0},"ajE0NxEnDX51HHhXOnFeGQ":{"text":"The best burgers in New Orleans. The drink specials are awesome as well.  The fish tacos a","useful":1,"cool":0},"HduABHaUGzQAuj2FoXAcnA":{"text":"THIS PLACE IS REALLY GOOD AND I WILL BE GOING BACK THERE MANY TIMES.\n\nI could end my revie","useful":1,"cool":1},"WV8gZyLp9342Gf_DqL45Sg":{"text":"I think this place is really overpriced and overrated. The food okay, but is SOOOOO greasy","useful":0,"cool":0},"Cz953oiSQkmGVkyJSwleZA":{"text":"I dream of the cheeseburger and mac n' cheese combo here at night.","useful":0,"cool":0},"3dciwQ4YvjFHyl7g13tVXg":{"text":"Came here around dinner time. It was busy, needless to say, with a few people waiting and ","useful":1,"cool":0},"GX7wRyN51d3xUPclsKN1Ug":{"text":"Cowbell is MY JAM! This was my third visit in nine months, hey I'm a regular! Whoohoo! Tod","useful":9,"cool":7},"0YaBohI17w0EGiEjMUYDLg":{"text":"Can't believe it took me so long to get to Cowbell, but I'm glad I finally made it!\n\nI lov","useful":4,"cool":4},"guqi4ZrYy6v4uwoUIBkKBg":{"text":"Went there a few weeks ago with two friends around lunch time.  The atmosphere is really c","useful":0,"cool":0},"s6B827xkwmIYR1dg7QF5Hg":{"text":"I got a fever and the only cure is more cowbell.\n\nThe best burger I've ever had. It was so","useful":6,"cool":3},"_9dxb306F7-BcVIdlY1Dsw":{"text":"We had the burgers and they were absolutely delicious! The chef brought out our burgers to","useful":2,"cool":2},"VeldFDaIrgQJsgrb0kdxuw":{"text":"The burger is just plain amazing. Best burger in New Orleans period. Freshly ground meat t","useful":2,"cool":0},"G6sI6EIG219dP4GGMjoKlg":{"text":"It was a bit pricey for what it was. The server was very accommodating and the entire staf","useful":5,"cool":0},"JPoM-buMCc-TE6JoIAP60A":{"text":"I had the burger. \nIt was SO Good !!\nI like my burgers rare, and there is an art to produc","useful":5,"cool":2},"5X66YKgTHoGUXsnNS1wsxw":{"text":"This is important! The Mac and Cheese and Homemade Ketchup are a must! We go sometimes jus","useful":1,"cool":1},"93U1XByDoKQ0t1vP3TTE2A":{"text":"This old converted filling station located in the riverbend area makes for a great casual ","useful":0,"cool":0},"YHb7-m-EhJ1bjxOZ-J7zow":{"text":"This is the first time I've felt ever so compelled to leave a review on a restaurant exper","useful":0,"cool":0},"8f-bMbTLv7DlTWMbiiZ_fQ":{"text":"River Bend Fries are awesome. The other items a little pricey for the portion. I'll return","useful":0,"cool":0},"une8H3A8m1ShA4Jy4fC5Ag":{"text":"BYOB for now. Long wooden tables more suited for a group outing than an evening for two. I","useful":11,"cool":9},"njuROxKvsE-o_DZJ5epb7Q":{"text":"Best burger in the city imo. Mac and cheese is very good also. A go go sauce is tasty. 4 s","useful":0,"cool":0},"VwnwFVFmTHv_lXkTEZq52Q":{"text":"I had an awesome burger at this place...with horrendous service. The burger was worth 5 st","useful":1,"cool":0},"vmY6ga8MMmppAZ9fDIh65A":{"text":"I wanted to really love this place. I've driven by plenty and it always looks soooo cute!!","useful":0,"cool":0},"BvVR4hCJipM518ORU6wrTw":{"text":"We were able to sit at the bar with out much wait, but it did take some time to get our fo","useful":0,"cool":0},"-HUy7UpahpA5pBrGnPmLCw":{"text":"Although Cowbell is a little pricy, it NEVER disappoints and it is worth every penny. Abso","useful":0,"cool":0},"rBWGJNU2gvU-anoQYOwIMQ":{"text":"Nice little neighborhood joint offering burgers and a lot more.  The Brussels sprouts are ","useful":0,"cool":0},"1aTKFOpTuNXL8_rvLldrZQ":{"text":"MORE COWBELL! is what you will be saying after you leave here. I have visited several time","useful":4,"cool":6},"YZ6xZrQpZO_7Dq75UMnRbg":{"text":"I like Cowbell. I really enjoyed their burger and the Agogo sauce is delicious. My group s","useful":1,"cool":1},"vkxO2kMbp98E0mA_1I3ahQ":{"text":"My second visit to Cowbell and oh man that was so good!! The onion compote on the burger w","useful":1,"cool":1},"Y3yR0NMbIEg5NY3Qg-TDAQ":{"text":"The food was delicious! I had a burger. It was very good. Perfectly cooked. I also had the","useful":2,"cool":2},"N3KH3zE262heCqLgHg1sHg":{"text":"Everything on the menu (besides the drinks) were $5 higher than they should be. Very antic","useful":0,"cool":0},"4G2cI4Bv0Z6LSlrSY_VEMA":{"text":"I will put it this way, we ate here on a Friday and went back that Saturday.  There were e","useful":2,"cool":0},"-6gO9ol4dANGPlW9G3Ptwg":{"text":"Hmm.. Cowbell... There were so many rants about this place that I had to try it!  They hav","useful":3,"cool":2},"gbj5QiC4rZDqDS0UZ_VEfw":{"text":"After driving by a million times, and reading the great reviews, tonight was the night for","useful":1,"cool":1},"TOs4LGJh1356jwKkPTHn9w":{"text":"The burgers are good but not that big..just adequate size. It was definitely tasty BUT $6 ","useful":1,"cool":1},"Q-IDLbVkZCZwdcHP4UBByQ":{"text":"After months of passing on this place whenever the rare urge for burger strikes, i felt it","useful":2,"cool":1},"vWxz9OxsmVAF-VJsDWCKKg":{"text":"Dude! Hamburger with egg and bacon top is ridiculously good. I love the lime grilled chick","useful":2,"cool":0},"5LR8KSTzxyUA308ZwOaBUQ":{"text":"This used to be my favorite burger spot in the city.   The last few times have been disapp","useful":0,"cool":0},"GzmpXZyr9BRwd20edltubA":{"text":"My husband and I love local, funky restaurants to try when we go to New Orleans. While we ","useful":0,"cool":0},"Qn03KClvSrxyhzZRxjZbRg":{"text":"They aren't lying when they say that the Mac and cheese is worth getting. It's creamy and ","useful":1,"cool":0},"9b0PyAXY4ou-tNbao0A1Rg":{"text":"Not only do they have a great burger, but you've got to try their chowder, it's the best I","useful":0,"cool":0},"NTL0sDUiFSErdcSSb1RlQg":{"text":"Good bread on the burger.  This part of a great burger is often overlooked.  Mine was slig","useful":0,"cool":0},"dFVM2ztXPUE0acCPvIYUIQ":{"text":"I wish my schedule would give me more free time to eat here. The day I visited Cowbell, it","useful":2,"cool":2},"hFzsWcZfwgKSGxOfkUJwUQ":{"text":"It's kind of a random menu. There's not much continuity to it. But rest assured, I'm prett","useful":1,"cool":1},"eI9LMaLPoeUs7W66cYmdJg":{"text":"They've perfected the art of putting meat and cheese between two slices of bread. Be prepa","useful":0,"cool":1},"BrJZxMvIsWWsLIvR3PfCsg":{"text":"One of my favorite restaurants in New Orleans. They have the best burgers in the city, han","useful":1,"cool":1},"I8zFwNGrsVXFHyctYHymJg":{"text":"Everything I've gotten here has been delicious! The service is great too! I go here by mys","useful":0,"cool":0},"hZeLr4MHP2JWzyLJHEuSgg":{"text":"Cowbell is like being cupped in the callused hands of a ranch hand-turned-chef-turned-inte","useful":1,"cool":1},"DRYaI2agQslOKo365u8MjA":{"text":"Super friendly server (from Brazil).  Grass fed burger juicy, tasty and on a light toasted","useful":2,"cool":0},"wS9lHR1ACy5nxbMrCshrMw":{"text":"Cowbell is one of those places where I look at the menu and pretend that I'm going to get ","useful":1,"cool":0},"FM-uHxRisjriH6fjBsZ4zw":{"text":"Had a great lunch with my family the food and service was awesome will be back to try othe","useful":0,"cool":0},"Ff46-r4rBgACZQM_-8hfJg":{"text":"ordered food to go...even their soggy quesadillas (coz of packaging) tasted devine. Just e","useful":0,"cool":0},"enwqtrbGoofnGEe5JkmVxw":{"text":"BEST VEGGIE BURGER IN NEW ORLEANS!!!!\n\nThe mac & cheese is pretty awesome too. I've search","useful":2,"cool":0},"09NUtT7GJLqDvYP3MPC7AA":{"text":"Used to come here for the burger. The past 2 times I've come the burger was small and over","useful":4,"cool":0},"dp7bGmDTvSG3qfuPFXl3rA":{"text":"My tire blew out one night from a nearby pothole so I pulled in to the closest place. Stru","useful":0,"cool":0},"Oi2ActJNz6zMpF0CZ_AnLA":{"text":"For food and service this place is 5*s.  The atmosphere/décor is a strange mix of old and ","useful":0,"cool":0},"2K1FO7YKWQl92mV7XdTiBg":{"text":"The first time I went to Cowbell was when they first opened. I enjoyed myself and remember","useful":1,"cool":0},"mlItitAQjxyrZw5vZvjbgw":{"text":"I usually order the harvest burger ( unique) but today I decided to re-visit the fish taco","useful":1,"cool":0},"Od6YKP1ybZVfruLXkuEVmw":{"text":"Amazing food! Drive out for the crawfish Mac and cheese and was totally worth it also the ","useful":0,"cool":0},"uLPKo9QRLFHrT4-GHnWxSA":{"text":"Great burgers, tuna burgers and fries. Loved the ambience and the service was excellent. C","useful":1,"cool":1},"m3NSEIGgb6ONipOwmP9V9Q":{"text":"Cowbell came highly recommended by someone, so I followed up.  BOY am I glad I did, and I ","useful":3,"cool":2},"M2CqULTbqDaDKqiqtPLxFg":{"text":"Went there for the soft opening - it was fabulous - can't wait for the real opening. Had a","useful":9,"cool":5},"7zzrN1esJr0yk0uBGiSBEA":{"text":"Best Mac and cheese in the city of New Orleans, just YES, don't argue! So many cheeses! Bu","useful":0,"cool":0},"qzSB-uH-WiEKAldtBR5dRw":{"text":"Place has a real cool vibe and the staff is very friendly and attentive. I had a special..","useful":1,"cool":0},"VArNUxhgk0BC-dE4bUA9Ww":{"text":"My friend was looking for somewhere in nola where she could have a really amazing burger s","useful":3,"cool":1},"hYNC1XTNnt2b658C5jHeJw":{"text":"This is a hipster type burgie place; I feel like with this particular type of restaurant t","useful":1,"cool":0},"3X-uyQZiUy-5ImVATQTdCA":{"text":"Best burgers around, hands down.  They are a little pricey and there is not \"just a burger","useful":0,"cool":0},"z6S0LoFaJn3HVykidJh9xg":{"text":"Super cute place!! Driven by it tons of times and finally stopped. The inside is way large","useful":0,"cool":0},"azNkAsNl7lxgW5ZRQVcBMw":{"text":"This is no doubt the best burger that I have had in the city. Sure, it ends up being about","useful":1,"cool":0},"JRPY8kZr0dpj4Jdx2bh_aQ":{"text":"Did not enjoy it as much as I wanted to.\nI love the aesthetic, converted gas station, fami","useful":1,"cool":0},"_eNZejy3IqdmPFlRbgZsDA":{"text":"Well, today's visit was way better than my first visit. The staff was much more pleasant t","useful":0,"cool":0},"jbL_9jJoYT_M4HLqv0PILw":{"text":"Our follow up visit was much better. Merline (sp?) was wonderful & everything went smoothl","useful":0,"cool":0},"WoV4Katx79U3sHtf_GggAQ":{"text":"I recently made a return trip to Cowbell last week when I had some family in town. I had n","useful":5,"cool":5},"WEvaWytkB_t9g1sN-9pP3Q":{"text":"I really enjoyed my overall experience and will definitely be making a return trip.  The p","useful":1,"cool":0},"uf8Xx2Q0uLdtpabTNx7U4g":{"text":"I would really like to give this place more stars, but I had a couple of issues with it.  ","useful":0,"cool":0},"M5ysAH-ejZMdvOOz34dL-w":{"text":"Being a visitor, we were recommended to this restaurant by a friend. \n\nWe ordered the Thai","useful":2,"cool":1},"yxX77Mnunlp4E8JaGy-n7Q":{"text":"This place is pretty cool. Be warned there is communal seating so you might be sitting nex","useful":0,"cool":0},"dtu_YHwPdAv0yN0pO0xutA":{"text":"This is a really random place to have a burger joint as it's in the middle of a residentia","useful":1,"cool":1},"SawwYDGnSMfdalLeK-X-cg":{"text":"Stopped by here for a late lunch this afternoon and was happy to see the place was totally","useful":9,"cool":7},"MYHn1D6sQNsYWneVGfKXww":{"text":"I died with the first bite of my burger. Then, I revived myself and finished that sucker o","useful":2,"cool":2},"FSpFT-OCXxg4qWZEXOS25g":{"text":"I can sum up Cowbell in one word... \"Absolutely awesome!\" Ok, that's two, but the food is ","useful":3,"cool":2},"CL1Ju1Jkmtv0yPybq5i3KA":{"text":"Burger was fantastic and you can tell the meat was high quality however it was small. Serv","useful":1,"cool":0},"5VLiKINpPCU7OAiJGPebIA":{"text":"Tonight was my first time trying the place and I fell in love. Finding Cowbell wasn't diff","useful":3,"cool":1},"skedkkvNoWzFqRzgrzOC7A":{"text":"This place is great.  I love the veggie burger and fries.  It is the best veggie burger ev","useful":2,"cool":2},"BiojTSlY3Xn9igJmzNmHkQ":{"text":"I'd read about the excellent burgers so this was one of the places I'd eat when in NO for ","useful":1,"cool":0},"YDq0QtSCp5A9zfAgBo-Buw":{"text":"Very fun atmosphere and decor. Very nice owner, and great wait staff. Food was yummy. Park","useful":0,"cool":0},"jcV0QWbhQV6mvO0kvnF5xQ":{"text":"This is one of our favorite places for a relaxed dinner in uptown. \nWhile the food is NEVE","useful":1,"cool":1},"fLBkuR94K4KOKs6-hEiGXg":{"text":"It's like Austin meets New Orleans, which is a double helping of the quirky, off-beat, fun","useful":1,"cool":0},"Ak7jIh8l08KRGbHWafxL-g":{"text":"Best burger in NOLA!! The home made ketchup keeps me coming back...","useful":1,"cool":1},"Ad5pAnOdQUoETe0hDnWNOg":{"text":"Wow their burgers are amazing! And the homemade ketchup is outstanding.\n\nGreat drinks too,","useful":0,"cool":0},"IHagHN0ZsP-90zeUSpbjWg":{"text":"Holy Cow...bell!! \n\nI just had one of those moments, hold-the-table it's so good, a little","useful":3,"cool":1},"Vh00-K_zFTE1uq2CGqyqYg":{"text":"Came here for lunch honestly, they serve the best grilled chicken salad I have ever had.  ","useful":1,"cool":1},"VsauAwCsenXzvf_mLH7_TA":{"text":"While I realize it's called Cowbell, I go there for the veggie burger.  Well...it's actual","useful":1,"cool":1},"6TJk3iGRq_Kg9aw-zoaAPw":{"text":"Having never been here and being late for our reservation AND being with a wedding party o","useful":0,"cool":0},"anfylU4kNnMtIPuAzfr5kg":{"text":"WOW! We have lived on Oak st for years and this is a well needed fun and fubulous addition","useful":4,"cool":3},"F6GInGFrLgSkFsEXEM7wXg":{"text":"Food was outstanding ... very creative menu and surroundings. Ate too much, drank way too ","useful":0,"cool":0},"3oopU0TtWTeQYfHKYgn0vA":{"text":"Amazing selection of food and beer.  Burger was phenomenal, sweet potato and shrimp chowde","useful":0,"cool":0},"teLIzrBFiMcQdQghDYgSfw":{"text":"I think Cowbell is a top contender for best burger in Nola. Love the figgy toast, but it s","useful":2,"cool":0},"2qrTDxgMIWAPq5_o6m-zvQ":{"text":"Would give 2.5 stars if allowed.\n\nWe can sum up our feelings for the food here with 2 lett","useful":3,"cool":3},"ndvgmvtab19mcdu188ArQA":{"text":"Very good.  the only reason for a 4 is becuse the menu is so small.  Not a lot of options,","useful":0,"cool":0},"cgG3RLV4QURzEsDUGSjl2A":{"text":"I was going to give this place a 4, because their food is pretty delicious, but I just had","useful":2,"cool":1},"oXSqCLEjlpZRTUgXiIE3xw":{"text":"Cowbell brings a great burger to the city but this restaurant is no \"one trick pony\". The ","useful":2,"cool":2},"6v5dZ0_Sdw1KlfZt21tadQ":{"text":"Okay, so I am not from this lovely state.  Looking for a place with good food and found th","useful":1,"cool":1},"fRevQxtO9wE2DSPP0YdjPQ":{"text":"Wowzer - That was a damn fine burger.  Cannot wait for my opportunity to order another one","useful":1,"cool":1},"cDv35C7MV7jFGKaVHFX_MQ":{"text":"I can't believe I waited so long to come here! My husband and I were just driving around l","useful":2,"cool":1},"cEhV40Qb9JnGMMan0R1xpw":{"text":"The Cowbell is awesome!  The space is nice and cozy!  They have really fresh drinks an the","useful":2,"cool":1},"avBK0EsTrK6WRMlAMVgiiQ":{"text":"I had a group of friends in NOLA for a conference and we call ourselves the Cows.  Needles","useful":1,"cool":1},"zGgOkXeLMsRng9t-sa-L7A":{"text":"So if you have read any of my other reviews on burger joints you will need to take note of","useful":3,"cool":2},"e8aWWC9IpH0enpTv8ccocg":{"text":"After the first bite, I was like \"holy mother of mary, this is the da *beep*.\"\n\nI ordered ","useful":7,"cool":4},"xl2w-zPh3j_Px5gStWPQyw":{"text":"Now I know why everyone raves about this place!\nThe menu isnt overwhelmingly big, but def ","useful":10,"cool":5},"5YpeJHnsj3mxpxe4VKuSvQ":{"text":"Fantastic. After eating here the again the other day, I am overjoyed to say that this rest","useful":1,"cool":0},"6tvMtu98iOZmZGjYxKzLZA":{"text":"We want to give it one star so nobody else will make it hard for us to get a seat or park ","useful":0,"cool":0},"kQlZiqPgR7rajbKRU1PbvQ":{"text":"From outside, it does not look so good, but we had great time at Cowbell!\nI had a burger a","useful":0,"cool":0},"SJ49OwSTLEIodEWzJxSE5A":{"text":"Either I have been living under a rock the last few years or I just don't pay any attentio","useful":3,"cool":1},"7r05jau4Ec45R82-uNQ_fA":{"text":"Unexpected delight! I stopped in for a late lunch and ate at the bar.  The gulf fish tacos","useful":0,"cool":0},"eHyKCvGCs6ECww7aKBu3lg":{"text":"Pricey for what I got, a bowl of chowder & a burger with fries & 2 beers ($37 + tip). Acti","useful":0,"cool":0},"cdaqMyJzOI3MvF_UKKUmOQ":{"text":"It's been a while since I've been to a restaurant with perfect food AND perfect service. U","useful":2,"cool":2},"UNdkMa2URnAyLl4Eo9io2A":{"text":"The buger was awesome!! My wife and I went last Friday for dinner and the food was super!!","useful":0,"cool":0},"hTxb9lQL5RkR-Bbg502QyA":{"text":"I loved the food here. I got the special of the day which was a large portion of fried por","useful":2,"cool":0},"uvKzRYsPWTKvMow2MINjXg":{"text":"Been dying for a burger and wanted to check out the new place.  I am in LOVE with the agog","useful":1,"cool":1},"DAbqVL41sfIwDX3UmF7BOw":{"text":"Went on a Friday night spur of the moment, only had about a 10 minute wait...  Great servi","useful":1,"cool":1},"fsjIoGo5DZTMlCjxCLqQ5g":{"text":"Both times I've been to Cowbell I have been underwhelmed. The mac and cheese, as everyone ","useful":2,"cool":1},"KZ5A3vGcM_6F_dSrr-7-yA":{"text":"Given my relegation to NOLA for upwards of a month, I tasked myself with identifying 'the'","useful":2,"cool":3},"u8Mhs-b4ybEcQsNr18LNuQ":{"text":"This is my first January in NJ/NY since 2009 and I am missing the warm weather, among othe","useful":2,"cool":2},"0Ceo6gRRApq-R9cFmHUZQw":{"text":"Ok people, these are the three things you absolutely need to eat.\n\n1.  The mac n cheese.  ","useful":3,"cool":1},"NW7FkH0H-2u4RWrXC_MM-Q":{"text":"Amazing food and service. The redneck egg rolls are to die for and the zinfandel, bacon an","useful":0,"cool":0},"65RFx0fPXow9272j5csT8g":{"text":"Had a burger with a friend at a table outside. Nice job landscaping what would otherwise b","useful":2,"cool":0},"25KCoZ9vGCahxz1KH6A9uQ":{"text":"This place has their act together. \n\nAmbiance is cool. Place is clean. The food is PERFECT","useful":2,"cool":0},"h2OvP0O2uCjXDeNMU587Cg":{"text":"Been wanting to eat here for a long time, we finally went last night. \nThe atmosphere is g","useful":0,"cool":0},"rob4MtGXMzr_ZGUEXvJ-9w":{"text":"DELCiOUS!  \n\nVery family friendly, warm atmosphere.  There was a lot of eclectic furniture","useful":4,"cool":4},"0MRq8sLazZl5a8hUI2jIHA":{"text":"We tried this place for lunch today! Nice surprise!  Fast courteous service and cool menu ","useful":0,"cool":0},"isKIh3qpyXQBZHJkHbUT5w":{"text":"Stopped in while killing time, waiting on another restaurant. ... boy were we suprized. ..","useful":2,"cool":2},"pMwQbdlevH-GqbQoxhPUGQ":{"text":"Cowbell is delicious.  My sister was so adamant about their having the best burgers in the","useful":2,"cool":1},"Uy6Au5KN-ZjvCtUlrULdfw":{"text":"This place was out of the way and that in itself is attractive from all the french quarter","useful":1,"cool":1},"ihYC7kNFmBQB6cWh2-W7VA":{"text":"Ok.  I really do not understand all the hype about this place.  \n\nFirst we arrived and the","useful":0,"cool":0},"r_xvtTgnefKTA330-oWzzg":{"text":"We had a few friends come into town that wanted something amazing, but a little different.","useful":0,"cool":0},"SR10QvXH7DbziWIQf-46Bw":{"text":"MMM, Cowbell. You sure have a nice place in my heart.\n\nI'm sure by now, you've heard about","useful":1,"cool":2},"o7xkGzqnrqnSiMoJtfKJlQ":{"text":"This is a great place to enjoy some great comfort food. I've had numerous items on the men","useful":0,"cool":0},"mrmUxvRgaGuzHvHFtH_Pgg":{"text":"I live in the neighborhood...and I have ended up here several times since they opened.  I ","useful":2,"cool":0},"ZpCt4EdsABrzfensj7JwWg":{"text":"This was my first time here after moving down to NOLA, and dang, the Cowbell Burger is on ","useful":2,"cool":0},"fIFlQ1YPAMWnZBlOl764UA":{"text":"This may just be my new favorite burger joint!  I got the burger with an egg.  It was cook","useful":2,"cool":2},"GqPTNOo81kYp315o1JvxtQ":{"text":"I love when a restaurant uses the freshest of ingredients.  COWBELL has a fantastic gulf f","useful":3,"cool":2},"6Kg7Tqhz0rx1NGtZQGGjng":{"text":"Absolutely delicious! In town from Pensacola and trying to stay away from the touristy pla","useful":0,"cool":0},"DRuOTORTlduCFOK-EbBEyw":{"text":"Great googly moogly! You've got to get a burger with the compote, egg, and bacon. Hands do","useful":2,"cool":0},"I0AydQ-7u6bhsKaNGAtfmA":{"text":"Ok, went to Cowbell and got the burger with bacon, white cheddar, and bacon. Sorry, but it","useful":1,"cool":1},"_RQaLbhrm0vwPTUUyIN9Hw":{"text":"This review is a 3 only because of the owner's attitude.  Food was great, service was amaz","useful":4,"cool":0},"CAFwEOrUxRi61pYKThl-Kg":{"text":"This is by far one of my favorite restaurants! The Mac and cheese is craveable along with ","useful":0,"cool":0},"L4q_pAliDEUxBIw8D3zQ-g":{"text":"Favorite burger in New Orleans. \n\nThe grilled cheese is another favorite as well as the ma","useful":2,"cool":0},"N4_FrUljOIbBgMBmXUfsGg":{"text":"Fantastisk mad hyggelig atmosfære...! \nVi prøvede deres klassiske burger, en reje burger o","useful":0,"cool":0},"kJ9dUnmbD4u6jXB2NPZE4A":{"text":"This is such a hidden gem! A friend of mine took me here and I wasn't sure what to expect ","useful":0,"cool":0},"tP9ex_csTSLok50gsY9w4g":{"text":"Yes!! I still think this place is overpriced, and I hate the immediate neighborhood, but d","useful":0,"cool":1},"PZ36lYDDgn4BF9agC00tAg":{"text":"Tried the special \"Pigeon Town Banh MI\" and it was the best Banh Mi I have eaten anywhere ","useful":2,"cool":1},"1D9bSnb2750DwJSeaT_9GA":{"text":"I enjoy burgers. Really, I do. These just didn't do it for me. The sauce was weird. Too mu","useful":7,"cool":5},"rqeyanFBPQFj9XISGP39Xw":{"text":"Burger is on point! It had been a couple years since I had eaten here, but I'm so glad I r","useful":1,"cool":1},"ONSMjaMJg4kcag_h4jrTNA":{"text":"This place is a solid 4.5 for me. Service was great and most food was great! Fish/shrimp b","useful":0,"cool":0},"ab2U0CAD1YPmH6T9PWgz0g":{"text":"Moo-oo!  Whatever your calendar says 2011 will be the year of the cow.  Oak Street's newes","useful":10,"cool":9},"Vs4_eW71CL3Ikyie2kql8A":{"text":"I need more cowbell!  Seriously, why am I the first goofball to say that?\n\nJust stopped in","useful":3,"cool":1},"mj4U_VbXBhRu3t9vMXlSRQ":{"text":"The Mac and Cheese is awesomely yummy and the Cowbell Burgers are fabulous!  \n\nExcellent a","useful":0,"cool":0},"0mFS3JZNF_-UF1Ah-BGKZA":{"text":"Things that I don't understand: Magnets, rainbows, black holes, trendy restaurants getting","useful":2,"cool":1},"n8lRxZjBe-8EfJ6lT9SigQ":{"text":"Went in May for my b-day, then again, last Saturday, before hitting the Goatwhore gig. I r","useful":0,"cool":0},"T56Vexo6ktZ8IpJCE66z2g":{"text":"Consistently one of my favorite meals in town and a great vibe. First and foremost, if you","useful":1,"cool":1},"WAwQy9-CPTmAuUZCGmyvBQ":{"text":"we love love love the burger here. i personally find the salads not bad as well. very laid","useful":0,"cool":0},"yyc1BzPMMIGdq0bh8CiKJQ":{"text":"They had really interesting options! The wait staff was super friendly and quick and incre","useful":1,"cool":0},"j0oHssXjHgpYDFoNVz4ahg":{"text":"We didn't order the Mac and cheese but it looked outrageous. \n\nThe burgers were very juicy","useful":1,"cool":0},"3bR8DEpqsssu604xc1lRbg":{"text":"Growing up in New Orleans my whole life, I can confidently say that Cowbell cooks up the b","useful":0,"cool":0},"SbZCCF-pa5wgzusLU8WNNQ":{"text":"Cowbell is my favorite place to eat in New Orleans! Being a vegetarian it's so hard findin","useful":0,"cool":0},"eL2BAp9r_x56act--TS8Bw":{"text":"My ultimate favorite place if im craving  a burger. The place gets packed pretty quickly d","useful":2,"cool":1},"qEYZtlKFZTUnIqirMQ9xXQ":{"text":"Loved the burger! And their sauce is delicious! I ate way past my full-o-meter's limit bec","useful":0,"cool":0},"xmNiPr-ae8249fi56lsH5Q":{"text":"The 5-star is definitely for the burgers, as I've not tried anything else on the limited m","useful":2,"cool":2},"4xeBvOwIF-wsHpaViCoLGA":{"text":"I made of point of trying out Cowbell after a Facebook post circulating their \"hate is not","useful":0,"cool":0},"xeGOOmRXL_AtV-MBmIOrxA":{"text":"Both the burgers and the fries are delicious, and I like the fact that my vegetarian frien","useful":4,"cool":0},"NoiKJQp3XAcrZYtbJeD97A":{"text":"Yum, Yum, Yum...\n\nWhen you are in the mood for a burger, this is the spot! Nice casual atm","useful":1,"cool":1},"DN2_9gCbCw838aZ2wqXbqA":{"text":"Now that's some good cow!\n\nAMAZING! Nothing else I can say about this place, People are ri","useful":2,"cool":2},"vh4pxD39R0XvGUouvKL-bQ":{"text":"The macaroni and cheese is the best I've ever had! The burgers are juicy and have a wonder","useful":0,"cool":0},"tIFl7zCBOUQbqHslCg2voA":{"text":"One of the best soups I've ever had and delicious shrimp and grits. Cute little place with","useful":0,"cool":0},"RuBzsBU7_viRa0pFkbhXkg":{"text":"You can ring my bell.\n\nI would say this place serves a cafe style burger.  It's a solid bu","useful":6,"cool":2},"PERPo9M3FF7g2Ezn7o3jhA":{"text":"Want a delicious burger to your wants and needs? And amazing fries? And sit on a porch wit","useful":0,"cool":0},"c7lARkEUom_eKwKBqBMlAA":{"text":"\"Those are good burgers, Walter.\"\n\"Shut the fuck up Donny.\"\n\n\nSeriously though,  it IS a g","useful":6,"cool":5},"1NmLNyKSiwvCk4WGTeADWg":{"text":"I really enjoyed the dinner we had at this place. I had a cheese burger. it was a quality ","useful":1,"cool":1},"MTRflTux2anAQb3EcBgxMQ":{"text":"After a wonderful long day on a kayak swamp tour, we had a great mac & cheese and hamburge","useful":0,"cool":0},"yBo9gjxPFl2Q89vamzinSA":{"text":"I can't say enough good things about the burgers at Cowbell!  I ordered the burger medium ","useful":1,"cool":1},"YSd9Tl-EzWXXiRixR3ms7A":{"text":"One of my reps suggested this place & was great. Local place in Uptown & has been recogniz","useful":2,"cool":1},"hgIMQhhgwc7u7klEhYT8GA":{"text":"The french fries almost saved this place.  The burger was good.  \n\nThe service ruined it. ","useful":2,"cool":0},"A-TN1ZHc9wqQUV1o4qGhfA":{"text":"Food was amazing. You should try the Mac and Cheese and the specialty sauces that come wit","useful":0,"cool":0},"nevsR_dyYuJqjdKYak5dGQ":{"text":"Best burger in town hands down. They have their own spicy mayo and housemade ketchup that ","useful":2,"cool":0},"ma5obSUZmj8oNPk99nZHPg":{"text":"Great food and great service. \n\nI travel for work and often eat by my lonesome self. I hav","useful":2,"cool":1},"zdCaE3C2hlIYo-2Ck8C5jA":{"text":"Have driven past this place several times and have been curious about it.  My husband and ","useful":1,"cool":1},"HK4m3I3SfaS4zDitTk8jJQ":{"text":"Nice staff. \nVery friendly. \nInteresting decor. \nCasual. \nLots of natural light.\nWaiters w","useful":0,"cool":0},"9jefqNPLH6ncAHtNbauIEg":{"text":"MORE COWBELL!\n\nLook, we love your food -- look at the yelps!  But, dudes, why must you be ","useful":1,"cool":0},"bBDq5xqlDAYXCpRYeyiGWA":{"text":"Wow!! This place is awesome!!  We started with Chili Cheese Fries (my son's request), then","useful":0,"cool":0},"htCtqGFBXpdMATAW2SzCjA":{"text":"Love this place. The adult grilled cheese is my favorite. The service is always awesome. S","useful":2,"cool":1},"t9nmz9AZrLB2GPKIyEzRBA":{"text":"Awesome place! The staff is always so friendly, and the food is incredible. My family and ","useful":0,"cool":0},"y5AxlhrU7MvxAV0RTCCXOg":{"text":"Very very good food. Been here a few times and have gotten a variety of things. The cowbel","useful":2,"cool":2},"3JC3DnOKCV_fe7e9xYGd5A":{"text":"We had a wonderful time at Cowbell!  It has a distinguishing eclectic feel, from the decor","useful":0,"cool":0},"mGtORhv9clkAdkF52WYQSw":{"text":"My favorite thing in the entire universe is a perfectly made cheeseburger. To me, $13+ is ","useful":1,"cool":0},"tQlh_OYT59XkFu1gFKsN8w":{"text":"I was going to give this place 4 stars, but then I remembered how slow the service was and","useful":0,"cool":0},"r9k5MDQHwPy20DstxX3_bw":{"text":"The food was pretty good. We each had a bugger and they were willing to add chili and chee","useful":0,"cool":0},"ulbj0_g5VU8HmFl4ofa09Q":{"text":"After listening to my daughter rant about this place I was ready for some of the best food","useful":0,"cool":0},"Lq5tefVkxvWZSTPyz1hctg":{"text":"Stopped in for the famous burger and it did not disappoint. The \"World Famous\" Cowbell Bur","useful":1,"cool":0},"K4Bp0ynzetMAF356sIzMGQ":{"text":"I'd heard quite a bit of buzz about this place (which looks to be a converted gas station/","useful":0,"cool":0},"MtcjA-QOQkZ29VXF66CysQ":{"text":"Carne Asada plate: Great ambiance, food was super fresh, cooked just right and put togethe","useful":1,"cool":0},"LLX7XWWPYUfVdiqCTrOx6Q":{"text":"Everything on the menu is sooo good there harvest burger is amazing! Brenda is the best wa","useful":0,"cool":0},"xPeWlhDROHwX-_jbnFjuIA":{"text":"Oh my god, their fries are amazing! Cowbell is my current favorite place for fries! And wh","useful":2,"cool":2},"dPn7SOZx5Xzs8MzEPvO6MA":{"text":"Well-known dishes made with a NOLA twist in very unusual ways. The pork chop, cheese grits","useful":0,"cool":0},"mBr8j8hslG2Bj38N0M2fKA":{"text":"I really like the decor this place, I love community seating, they have awesome light fixt","useful":2,"cool":0},"QWl6QY7Q4D6QT6Y7EwvOVQ":{"text":"Cowbell, you're a cute l'il gas station-turned-restaurant. The casual vibe and personable ","useful":4,"cool":2},"5KFE4P11rKpySJwk99aoEA":{"text":"Noms. \n\nFrom burgers to the mac and cheese... my favorite thing is still the chicken and w","useful":0,"cool":0},"d_KkVL5beo5MxLNJKPwtxg":{"text":"Another great place to eat in River Bend. This place is food done well in an unpretentious","useful":1,"cool":0},"4iMZRUhiqB5Ik6xV-MsSIQ":{"text":"My wife wanted to go there for her birthday so we went for lunch.  It was well worth it.  ","useful":0,"cool":0},"8B_N3bGR4KNxs0A2NIJl6Q":{"text":"Totally my kind of place! I love the style and ambiance there. They converted an old gas s","useful":12,"cool":10},"OQ9wXBvNuFao5mdkDMiL7w":{"text":"Owner was on chopped.  Duh the food is good.  Everything on the menu is good.  Worth the w","useful":2,"cool":0},"eoKlOiGfoeldDQRPU1uqpw":{"text":"Went again this past Saturday to give the burger another chance. It was cooked to perfecti","useful":4,"cool":2},"mBFRTonJ2xlNujKSOYjZHQ":{"text":"Gotta have more Cowbell! I can't help myself, I always have to get the Mac n' Cheese. Top ","useful":1,"cool":1},"8U7wxBarIUVgyHOAxrPl7Q":{"text":"When I go again I may be go up to five stars, but having only been once I have to reserve ","useful":1,"cool":0},"NhYs6efPO_wc8PyiRxJDuA":{"text":"I have been here a few times, and every time has been awesome! Their veggie burger was one","useful":0,"cool":0},"RrNFPy8tvyyEaSQWS4222g":{"text":"I have been twice.  I normally try to visit a restaurant twice before a leave a review.  I","useful":2,"cool":0},"f61HoRzPKtubq-jvphsHfg":{"text":"Came here for dinner recently to see my friends. Ordered the burger and mac and cheese and","useful":2,"cool":1},"kr2pQnjDG0lqjvJFzzXBdQ":{"text":"The burgers here are unbelievably delicious. Just come eat one. The service is sometimes a","useful":2,"cool":2},"ew5wcLg94HwSfB4QAAYaGA":{"text":"Been here 3 time and everything I've had was great. I thought they had Milkshakes for some","useful":0,"cool":0},"OyLI0t5UeTx2h_i8BSfQew":{"text":"Absolutely delicious! In town from Pensacola and trying to stay away from the touristy pla","useful":1,"cool":0},"wjIW0Kr2a9vTVyyVg_raRA":{"text":"It was worth trying once - good - but not worth going back. The cowbell burger was just a ","useful":2,"cool":0},"W4T1Smke-1YKFqGgsEPBJQ":{"text":"GREAT food! Great ppl working (esp the bartender). Fast, and cooked perfectly! \n\nDid I men","useful":1,"cool":0},"RcL1tfvWuC05ISeLcNkc-w":{"text":"The casual atmosphere belies some serious food - and prices to match. \nThe Mac and Cheese ","useful":0,"cool":0},"DYKq3nUbkthZRChNXAvq9w":{"text":"Grassfed burgers, I'm in. Exceptionally friendly staff, community oriented owners and hous","useful":1,"cool":0},"2F1pMgl0WEpTC81wB8pa-g":{"text":"I give Cowbell two stars because the food was pretty good. But the only way I would eat th","useful":6,"cool":2},"MO5TI-kbI95Pyf5t0y0bvQ":{"text":"I knew that Cowbell was open after Isaac, due to my friends checking in on Yelp. Thus, whe","useful":5,"cool":4},"OL2gQWA_CXgDr-wUN2oTdg":{"text":"I tried the first bite of the signature cowbell burger and sat back to think, \"when was th","useful":2,"cool":1},"zRjPkjO71yTJ6nnZMsIgNA":{"text":"Great burger, and great little place for lunch or dinner.  Missed out on 5 stars because t","useful":1,"cool":1},"LN257cOeB4yjIAcQEkQg1w":{"text":"Lobster Mac & cheese--- amazing! Must try their apple pie next time- that looks amazing, b","useful":0,"cool":1},"O1BIW-wkSmyiXsAaqeuubA":{"text":"The best burger in New Orleans.\n\nWith all due respect to MVBurger, Bouligny Tavern, La Pet","useful":2,"cool":1},"aZiWiGkz3ehnwF72I9jl9A":{"text":"The rave reviews are definitely correct!  Shared the mac and cheese as an appetizer - and ","useful":2,"cool":1},"dhlCASmqHyErqbhF-xVqtg":{"text":"Just had the special #1 country ham mozzarella arancini with house mead tomato jam appetiz","useful":1,"cool":1},"XEhmlwEovpX3ZxKO_F_Fyg":{"text":"The funky atmosphere and friendly, prompt service unfortunately didn't save our extremely ","useful":0,"cool":0},"b71EFdzxq7VA3Q96Kl2wLg":{"text":"Cowbell was the one burger I hadn't tried, and was very excited to do so. To me, Company B","useful":3,"cool":1},"L5UD1tBzOSKPrROpQXc9yg":{"text":"used to be better when they had specialty burgers.  Now there are two burger options and t","useful":0,"cool":0},"8BvVLt_jQaoe4bNGuMf44w":{"text":"Went here in the middle of the day on vacation. We started either Brussels sprouts n moved","useful":0,"cool":0},"qERywV9hx3EocIY1i9I3rA":{"text":"This was a great bar but recently decided to overhaul their menu and let me tell you, it's","useful":3,"cool":2},"XlAxMkNzh4N3T1Erfqim7g":{"text":"So, yeah, I had a good foodie weekend...Sylvain, Huevos and Cowbell all in one weekend! An","useful":5,"cool":3},"EAFBanMxcI1Mcyv5S4Ok1Q":{"text":"So a friend of mine took me to her \"favorite restaurant\" in NOLA today and I can see why! ","useful":0,"cool":0},"6S1Y_ZRn02Dc1uh03xFzog":{"text":"Still in my top 3 places for burgers in Nola. Kinda sucks that it's so popular now though,","useful":1,"cool":1},"FzMyXl6uMVi-V3bf-PTzVQ":{"text":"Get the Maui Wowi...it takes courage but its worth it.","useful":1,"cool":1},"Yu_-b0M2rgao-wlgZb51iA":{"text":"I've eaten their burgers, salads, and a few other of their menu items. The fish tacos are ","useful":4,"cool":1},"XJo2ulJsqWq-1HN1O2NsxQ":{"text":"After driving by this location for over a year, my fiancee and I finally stopped yesterday","useful":3,"cool":1},"Eq8XdxaDOcFz5-mjLi0XWQ":{"text":"My boyfriend and I started off with the figgy toast.  The combination of sausage, figs, an","useful":2,"cool":1},"LCqcC_1wdAEaCurPNeaJtw":{"text":"Simple, fresh food served by friendly people in a clean and sunny restaurant. Ordered the ","useful":1,"cool":1},"KEtw5dZiFYNBXSVmxAHgJQ":{"text":"If someone from another country asked us what American food tastes like, we would bring th","useful":1,"cool":1},"oQKZ9cGzObo8pb-TF4bKGQ":{"text":"I am a person who really makes every effort not to dine out alone. But of course it happen","useful":15,"cool":13},"slgDpQUMyzgML0XnVzwtww":{"text":"Literally the best burger in NOLA.\nif you think Port of Call has the best burger...you are","useful":1,"cool":1},"92lWEGR_Qwz3GZoQBktVPw":{"text":"Having read so much about the burgers here, I decided to give Cowbell a try early on a Sat","useful":1,"cool":0},"CXras8d8JeHgIJrBk5TicA":{"text":"Everything here is amazing. Both the tacos and the burgers. The garlic sriracha style sauc","useful":0,"cool":0},"z8jmiiuPeMB7nbl4Bw_low":{"text":"This place is a hidden gem in a small off the beaten path neighborhood in New Orleans.  Ri","useful":3,"cool":2},"19wpwQMUOpEbPtE1hbOEbw":{"text":"Finally came back to get the mac'n'cheese!! My SO and I were going to a concert at Southpo","useful":1,"cool":1},"-wd6yM1-s-ppRwJLjPTgCA":{"text":"I consider myself a cool, hip local. And thus, I direct my out of town friends to Cowbell.","useful":3,"cool":2},"YB3MG5qCa96XmMg7Cwh6Vw":{"text":"Favorite part about this place is the atmosphere...cool little joint by the levy. The burg","useful":1,"cool":0},"YMPCk9IwI5hkhS6Ldno1hQ":{"text":"The grass fed beef was cooked properly to temperature, and the homemade fries were fantast","useful":0,"cool":0},"Uag1RuDb3-P3yvgVVJoz0Q":{"text":"Cowbell makes my favorite burger in the city, a position previously held by MV Burger, whi","useful":5,"cool":2},"u7k2NJ8Cu98q21wOTQHt8w":{"text":"Great burger. Unique texture. Ground short rib and brisket. Salmon and fish tacos were spe","useful":0,"cool":0},"0ftSACia461aemdHrMe4nw":{"text":"This place has the best burger I've ever had. So juicy and perfect! And their homemade ket","useful":0,"cool":0},"h6oKaB_T2HdVjdikS4-rUw":{"text":"a really really cute place to eat out. their burgers mean business when it comes to Cowbel","useful":0,"cool":0},"o_OhRABQr0Wbh0aEdN-f0g":{"text":"Just returned from dinner at Cowbell.  It was great!!  Many of my friends know owner/chef ","useful":5,"cool":2},"jgFLNhnPKQAarYKCdxWKEg":{"text":"Lunch Bunch Bust.  Wow Huge disappointment!  Sad to say it was my 3rd time and things have","useful":2,"cool":0},"tMIMcxJ1-fGFPUXjEZ4HPg":{"text":"Everything was omg delicious! Very friendly staff as well as owner. Good service, cool atm","useful":0,"cool":0},"Zho127iKnfPEyQM2nBX0UQ":{"text":"Great addition to the oak street neighborhood.  Love sitting at the bar and watching the s","useful":3,"cool":2},"B7N3_xnlEThVTTS7FOdN2Q":{"text":"I have been here twice. The first time I ordered the grilled shrimp Cobb Salad. It was Del","useful":0,"cool":0},"EwWUxN45BleraS7_zDE07w":{"text":"I really wanted to like the Cowbell. I've met some cool people who worked there and heard ","useful":3,"cool":2},"8v9iLTUrBDVYCVXh_0I9ZQ":{"text":"My dinner choices came highly recommended from Yelpers:\n\nCowbell Burger - Natural, grass-f","useful":3,"cool":0},"UTi6Qhoj5lvri4DRYefnzg":{"text":"Best burger I've tried in NOLA. Very flavorful. Their kid menu is also very tasty. We all ","useful":0,"cool":0},"fUvzVkz7SIJEPJmk8M1o3Q":{"text":"Time for an update...my past few visits were not as stellar and I doubt I will return. I d","useful":12,"cool":1},"Fetcy1JlIj03ywX8BfjeZg":{"text":"Outstanding burgers are just a glimpse of the beautiful creations at Cowbell.  Had a speci","useful":0,"cool":0},"6f4rz5DWaGfrHVGe3AdrZw":{"text":"Awesome!  Loved the veggie burger and the agogo sauce.  Good booze drinks, cute atmosphere","useful":0,"cool":0},"eMrSNqXqQyE_rtMHseQpsw":{"text":"The service is absolutely despicable. If you are a young adult (19-25) they will not treat","useful":0,"cool":0},"6lJgwy1YQwTT3IDLGu6qHQ":{"text":"It seems like we have been saying \"we need to try Cowbell\" for for about ten years, and so","useful":1,"cool":1},"47V7OJ1ry8VMH1yvTKDaVQ":{"text":"Cowbell is outstanding. Brack and Krista really have something special here. Prices are a ","useful":1,"cool":0},"xduvLDoaEJShu9joWGvmwQ":{"text":"Been here on several occasions every time we come to New Orleans. This time was disappoint","useful":0,"cool":0},"902hZOxRitzHpHCXTfAjtQ":{"text":"I first came to Cowbell when it first open and after this visit I am kicking myself for no","useful":11,"cool":6},"K0PVWQMbsjg06o_P3MnqgQ":{"text":"I finally made it here for a burger. Harvest burger, but still. It was good. For my fellow","useful":17,"cool":12},"DVPl9hr7Gu3Ihd1Iz_qDjg":{"text":"Incredible food, great service, cute place. Highly recommend the mac, really awesome. Can'","useful":0,"cool":1},"DvpWiknODGizRFo1fOnr8g":{"text":"The restaurant had a very eclectic feel. I ordered one of their specials, which was the ta","useful":1,"cool":0},"IFcR2KQtKFqbidqUIulrjg":{"text":"I'm going to resist going for the low-hanging fruit here and making a cheesy reference to ","useful":3,"cool":2},"8oifNIz6RAPo9mZvwwh20g":{"text":"I wasn't overwhelmed by the deliciousness of their burger like other Yelpers seem to be, b","useful":1,"cool":1},"eIz4Ra-XxocJ14kW9zobKA":{"text":"Love the atmosphere and food is fabulous! Not sure if it was the buttered bun and mayo sau","useful":1,"cool":1},"RbTau-34OdgBph_nsVTCxw":{"text":"They have revamped their menu and it is impressive.  Still, I get the burger every time.  ","useful":0,"cool":0},"ToZTHcvlxDVx-b3JOR5PGg":{"text":"Must. Have. More. Cowbell!!!\n\nYup. I *went there* Impossible not to as EVERY time I hear a","useful":17,"cool":13},"-xPgB-vhjJFM3l0JH1F86A":{"text":"I'm really sad to write this because I've been waiting  for SO long to try Cowbell. We cam","useful":0,"cool":0},"C2WiRqAfSdf4cyc8hR-vUw":{"text":"The dinner I had tonight was pretty terrible. $26 dollars for very overcooked fish and $15","useful":0,"cool":0},"mt-uKhXUwTbLdbCrrBqIJA":{"text":"My first visit and won't be my last. Very unique food as well as alcoholic drink offerings","useful":0,"cool":1},"PMU0yhYHr8MIPTogPEp2DA":{"text":"Very nice food, personal service, owners come to your table, eclectic, tasty menu selectio","useful":2,"cool":1},"vH1ppnsvixprSsMVuVkU7Q":{"text":"Wanted to test out this place before our parents came to visit because we were told they w","useful":1,"cool":0},"UGe69DbHY5Lgv3KbIYvH6Q":{"text":"Everyone knows New Orleans is world famous for its food. Among foodies in Louisiana, Nola ","useful":2,"cool":1},"uWFvVUQu1GSFeakbYwZhPA":{"text":"I have been coming here for years. The people and the food are just amazing here. \n\nThe pl","useful":2,"cool":1},"XLu1vdVb4RImIcVorEpVPA":{"text":"This restaurant is one of my favorites in Nola. Not only is the food consistently great --","useful":0,"cool":0},"sKEgUHmLCSvb9EKwwnMbsw":{"text":"I will admit that I've only tried a few items on the menu, but there's a reason why. The f","useful":1,"cool":0},"ucZti6rcT978C1D68wDw8w":{"text":"Great food! First time I came here I got the adult grilled cheese which is to die for! And","useful":0,"cool":1},"yI2cGGmJ5NGlkGoFoCdTfQ":{"text":"Awesome - Cowbell contacted me to let me know it's the BBQ sauce that's not veggie and the","useful":1,"cool":1},"ZvVARg1TsGPISo_SzrMl_g":{"text":"I was so excited to visit (i live in DR) and my boyfriend even more to take me there. Nice","useful":0,"cool":0},"4u8W2rNu-J_8rTVZV_qmrg":{"text":"Ding a ling, ding! You so delish.\n\nMy review may be biased due to my voracious appetite af","useful":16,"cool":11},"noVgqUeZx21fkOcUmZJOQg":{"text":"Love the pork sandwich special with hoisin sauce.","useful":0,"cool":0},"uFD-ZRSp0p_SMUJsl0DFMQ":{"text":"You can not leave here without having the mac and cheese. It is one of the best mac and ch","useful":1,"cool":0},"ml7K_cOVL_Ksah_6HiXLfw":{"text":"We ordered the Figgy Toast and bowl (special of the day) with jerk chicken, quinoa, butter","useful":0,"cool":0},"A7eOPeNzJns3zA_mKQVA6Q":{"text":"Great food , great atmosphere, they rushed a bit and my mother in laws burger wasn't cooke","useful":0,"cool":0},"2ARglIrV7GJPYsEIEk0rug":{"text":"I sing Cowbell's praises. Their veggie burger is easily the best veggie burger I've ever h","useful":0,"cool":1},"PRiU6LDdRcjzK30QmsFjVg":{"text":"Love the atmosphere here. Burger was excellent as usual. Spring for the lobster in the Mac","useful":2,"cool":1},"CQ3y8FcUWPUdV1lAWTaaJQ":{"text":"Oh Cowbell, I have dreams of you and my dreams will have to be where it stays as I do not ","useful":0,"cool":0},"yJLTUPjgYFnIXb828G696Q":{"text":"This is by far one of my favorite burger places in New Orleans! I always get the Mac & che","useful":0,"cool":0},"u5DS_pE-4nbwxEMqP0qcxQ":{"text":"I'm gonna start by saying that Cowbell has beer now, and will have liquor soon, because th","useful":13,"cool":6},"mL5jQtDlhIVruLE504rPRQ":{"text":"Went to Cowbell again last week. Still excellent food but our service this visit was a lit","useful":1,"cool":0},"3F5grMn--88pfyaScCznAQ":{"text":"I'd heard a lot of hype about this place, which made me nervous because that usually means","useful":0,"cool":0},"BpSrWxAXAad3TYlcata5aw":{"text":"Okay, so I know what you're thinking. Cowbell? This review is of course going to be writte","useful":7,"cool":8},"sTn3abz3khmPuik2okZmiA":{"text":"So damn good.   Progressive values with top quality food and hand crafted cocktails that a","useful":0,"cool":0},"KH1DIokyvWVU_dX2pfDs2w":{"text":"Yes, I've secretly camped out in the kitchen...\n\nWent back (again) with another out of tow","useful":3,"cool":4},"_jyfgb70XSkVeH74OqwBPg":{"text":"This place is pretty eclectic. I love the vibe of the establishment. And the service was s","useful":1,"cool":1},"7wHPfkiYtuNpZil5aVTgUw":{"text":"Great service! I got the famous burger and I can see why it's famous. I usually don't fini","useful":1,"cool":0},"s0JummSNM228eyf_Kn7V1Q":{"text":"It's SERIOUSLY overpriced. The food that is being served sounds more exquisite on the menu","useful":6,"cool":1},"Q2vJfZ_W_Sf7up0de6zGRA":{"text":"Fish burger Friday is one of the best meals you can have. The place has everything, beauti","useful":3,"cool":0},"F87oSKWbUq3l_2GeLztQyA":{"text":"An absolute must try. Everything I have ever tried wad superb. Hubs thought I was nuts whe","useful":0,"cool":0},"xcj1DeZdfVjG52-xSeUvcw":{"text":"Disappointing and expensive. Two burgers with fries and one order of Mac and cheese should","useful":0,"cool":0},"-IPHcECDzy5_QGvfgY8FnA":{"text":"Cowbell serves the best burger in New Orleans!  Made with organic beef of the highest qual","useful":0,"cool":0},"ZKk7DnXu7kjg2V_90heofg":{"text":"Great casual place.  Food was wonderful and service was great!  It's a bit out of the way ","useful":0,"cool":0},"PFoQ9ZdIPAF9kZnnvb3v_w":{"text":"I have been to Cowbell twice recently, seeing that I always pass it going to uptown NOLA f","useful":6,"cool":3},"0IkzD3rnMiZzs66hMzKi2A":{"text":"Now, I haven't tried every burger in town, but I have tried a few, and Cowbell is presentl","useful":3,"cool":1},"sxIesloHd0LKzE0u7xx5vQ":{"text":"Great spot for locally sourced and fresh American food with a twist. The drinks won't disa","useful":0,"cool":0},"APPKvMuC0ULIHTxrXbW5Ng":{"text":"I love this place! There have been a few unsuccessful restaurants in this location, and I ","useful":1,"cool":1},"uWPqIODrV2lLK-zksNaOnQ":{"text":"The best burger spot in New Orleans. Always have some good specials, soup and burgers, and","useful":0,"cool":0},"vE7yFxFozcnN-NDRu89HFg":{"text":"Went here on a whim after an appointment at Ochsner. It was a beautiful spring day so we s","useful":0,"cool":0},"OxU2kUWEhexkfq6UCvv54Q":{"text":"How good is Cowbell?  I had to go twice in one week!  Of course, I want to be supportive a","useful":5,"cool":4},"GyTb8mS_SudhPrqLFDcjQQ":{"text":"First of all, the atmosphere is very friendly and relaxing. It's a small place at the end ","useful":0,"cool":0},"3WO_1_wH-ugmrra1eZZa0g":{"text":"Really great vibe with all shades light blue and antique crafty gorgeousness with a sprink","useful":0,"cool":0},"0JAmhe9CuthnxkS2o7lOIw":{"text":"We went for an early dinner (5-ish) on a Saturday before heading to an event at the Superd","useful":0,"cool":0},"O024nkiBO4hasg41yvKytw":{"text":"At Cowbell, the majority of the produce is local and organically grown. The chicken is org","useful":0,"cool":0},"x-rtJbm17mWZLO5PU3ljCw":{"text":"This was my 1st time here, and what great surprise!  I had the hot tuna sandwich which cam","useful":0,"cool":1},"AzoFLrXTlNO9mXSJOP7HyA":{"text":"Gorgeous day to sit outside! The staff is super friendly and the food was great. One of th","useful":0,"cool":1},"r4XmSTMaVuqdiQee5FjOIA":{"text":"We really enjoyed our visit to Cowbell.  It was casual and fun and had something for meat ","useful":0,"cool":0},"sXAlYObqfWTOVIhnM7CMhA":{"text":"This place is totally unconventional. It is bright, airy, vintage yet eclectic, funky and ","useful":9,"cool":9},"_MlyRsHxQ62ectoju1wAxw":{"text":"Wife was craving a burger, and Yelp led us to Cowbell. I must say we tried the World Famou","useful":0,"cool":0},"I3tsWYiPn2Z8v2xOS3GPrw":{"text":"you only THINK you love chocolate if you haven't had Cowbell's \"Chocolate City\" flourless ","useful":3,"cool":3},"lzUly-DqV_0XiIri_uzVjw":{"text":"My Lovely Wife and I had head so much wonderful buzz about the new restaurant that we pass","useful":4,"cool":3},"yxJW92ecEVxYJw00PrCr-Q":{"text":"For starters we got their crawfish mac and cheese.  This was delicious, but it felt a bit ","useful":2,"cool":0},"PxEqa4fUcrgb_VOrBElamQ":{"text":"This was incredible! We split a meal and they brought it out on 2 plates - no questions as","useful":0,"cool":0},"8HI0HNQXVaqlCLIHI5bnJg":{"text":"We loved the wait staff. Super friendly!!  Very limited parking. Had a burger. Our grandso","useful":0,"cool":0},"HyKRZybTLxuR9zDkO2NYhQ":{"text":"The Mac n cheese is to die for! Get their cheeseburger with their homemade pepper jack che","useful":0,"cool":0},"wHFKubRj8PwoIYwS9UZYbA":{"text":"Cowbell was an awesome experience! I usually don't venture out for burgers that often, and","useful":0,"cool":0},"FEOhguz_b2VMe2z6iIfI_w":{"text":"This place is good enough - and unique enough - that I'm comfortable bringing out-of-town ","useful":3,"cool":2},"-A_46LEzVwH4Ictf8UFsHA":{"text":"Amazing burger, second only to company burger, but almost tied!!! Yum love it and super fu","useful":0,"cool":0},"4R4hE0gOzVpIzjzMcvG_Vg":{"text":"My SO and I went here for a burger a couple weeks ago. We both had a burger instead of spl","useful":2,"cool":0},"pp8XgLcB6I6tHbcY9dVrIQ":{"text":"Much better now that they have beer to go with everything!\n\nI tried the chili cheese fries","useful":0,"cool":0},"qX5go07BAx4Q4_0pRkDIbA":{"text":"I'm not one to complain at restaurants let alone as we are sitting here, but the kitchen l","useful":4,"cool":1},"svevFzlWFTd4uqFPLvcABg":{"text":"Food was great. Went for lunch it was packed. In terms of location a little far uptown fro","useful":4,"cool":2},"Qxe2sRiA0cxhchvv8H52mw":{"text":"Since taking my first bite of the burger, I have been a regular.  After moving Uptown, I h","useful":0,"cool":0},"y7dvU8YD52pOL6LB2GjVBw":{"text":"My DH and I went to Cowbell after hearing great things about it. It is located in a not-in","useful":1,"cool":0},"qQqMH5ALe-2WZpTAf6yWkA":{"text":"Love this place. Great Mac and cheese, burgers, tacos, and a good limited draft beer selec","useful":0,"cool":0},"RB4gV9GamJIrAJ7o3F_ExQ":{"text":"Oh yea-comfort food city!  I absolutely love the cute decor and aprons the servers wear-th","useful":6,"cool":6},"krSiQd49OHYEKwRnoFG0RA":{"text":"I was not terribly impressed by this new restaurant far down at the end of Oak Street. The","useful":1,"cool":1},"xoWkPgYIEbC2Kbn-EudmYg":{"text":"It's amazing to me how so many people love this place. The service is not that great and i","useful":0,"cool":0},"TbzBBsRpVU_SwqdwLCVe3A":{"text":"I'm from out of town and stumbled upon this place just walking by. The service was great, ","useful":0,"cool":0},"a4pUtJ7P5lcyFJKVGGBQyA":{"text":"We have come down to New Orleans for the past few years to work with Habitat for Humanity ","useful":0,"cool":0},"Z_nBVoFCW1Ikp_6_u_Swdg":{"text":"Amazing hamburger. This is probably the bast burger I have had in my life.","useful":2,"cool":2},"VhlS7AaVFalZx8IthIt6kg":{"text":"Went here with family after a day at Audubon Zoo.  It was close and the staff was accomoda","useful":1,"cool":1},"C_VNsEO2VjY8dsrbtu6-FA":{"text":"This was so amazing. It was so good. And then the ketchup...\n\nMy buddy and I went to eat o","useful":4,"cool":3},"Dq-FeTa0h9k3fluUyICiGw":{"text":"I have only been here once, on a late dinner date with my man. It's in an unassuming build","useful":3,"cool":2},"qyv4ndCll9OypyaMhQpXOQ":{"text":"Local American with a southern flair. Come on Wednesday for the chicken and waffles...stup","useful":0,"cool":0},"WNe3TmPKnM2Not0aRqsA4w":{"text":"Super cute restaurant with a wonderful atmosphere. We had to wait to be seated but the cra","useful":0,"cool":0},"ce5L_Ny55MmVvAHJD6tA9A":{"text":"Great Hambugers with lots of flavor. Delicious food with a small place charm. Egg and baco","useful":1,"cool":0},"NBU7C9oxwTyxORl71paurw":{"text":"I have been wanting to try this place for a while now. It was pretty busy on a Saturday af","useful":1,"cool":1},"Hms7f3m4EvlWs731z85-IA":{"text":"Hands down best burger in New Orleans BUT it's not cheap! \n\nI remember the first time I we","useful":2,"cool":3},"NPOI-JJe3mtWpqEn7eCYzw":{"text":"The adult grilled cheese makes my heart sing,","useful":0,"cool":2},"4NHMGM7ULuQGgUt1iyaWeg":{"text":"Hands down one of my favorite places to eat in the city! Myself and a bestie are affection","useful":0,"cool":0},"KOx6kYVYQvJ1AhegEzDtcA":{"text":"Amazing!!!!!!! This place is an uptown secret Gem.\nMy family and I visited for lunch one S","useful":0,"cool":0},"-TiUbZMQD5ryNSNHcg0XRQ":{"text":"I had a great burger but I did not get the chance to stay inside. The woman I picked up fr","useful":0,"cool":0},"8QSHZryl7f53shHP6Pe2Vg":{"text":"BEST BURGER I HAD IN 2013 OF THE 150 RESTAURANTS THAT I TRIED!\n\nMy quest to try 150 differ","useful":8,"cool":6},"kZOkBvxbFcs91F_s-nslFA":{"text":"A funky little spot that makes for a cozy place to grab a bite and drinks with a few frien","useful":3,"cool":2},"DPCHeitKIBjAeUV7puO8dw":{"text":"Used to go here a lot, but will never go back. Food is good, but small portions and expens","useful":2,"cool":0},"rdYV4rdOX9H2LKVPDBENIA":{"text":"It has a very cute interior!  Many things to distract you while eating, in a good way!   T","useful":4,"cool":3},"2s7gFfb5IMFpKdrgr6F_Ug":{"text":"Where do I begin??\n1. Food. Overpriced and mediocre at best.\n\n2. The owner. Krista. What a","useful":1,"cool":0},"NxkgBq7o6WqUjF-V9neeeA":{"text":"The food was amazing! Loved the steak tacos and the lobster Mac n cheese was really good a","useful":0,"cool":0},"lJ_S2i_9yYgMw8aBZfpcbQ":{"text":"One star.  No substitutions.   Snotty staff.  Sorry.  Excellent tasting food WILL NEVER ma","useful":8,"cool":3},"TzoZox9nAy82vZ-Wb-4okg":{"text":"This might be one of my new favorite places to eat!\nThe service was amazing. I love that t","useful":4,"cool":2},"ktj7g1RmsoOkD_Wh6eZYVA":{"text":"I keep hearing about the good food so I decided to try it out. I ordered a medium Ribeye t","useful":3,"cool":0},"Nx1n3gA0GnIwsDeRFeAdAg":{"text":"Went in for lunch on Tuesday.\n\nMy Order:\nChicken Sandwich\nMac N Cheese\nTotal $24\n\nThe chic","useful":0,"cool":0},"jUbcJzDOhNs17SJKBmFU3A":{"text":"The food was super delicious and fast efficient pickup service during these coronavirus ti","useful":0,"cool":0},"rRNiIWgA1BSE1OksnMGOTA":{"text":"One of the best burgers I've had, place is cute and staff was so friendly and accommodatin","useful":0,"cool":0},"5kgEUVZpFSSXVx3_yDr3dg":{"text":"The service was good. The food was Bad. My boyfriend and I both ordered burgers to be cook","useful":3,"cool":0},"DH_3uhmY5AkZ3GmIQgNgmA":{"text":"I heard the food was good here, however when I went to meet my friends one horrible waitre","useful":7,"cool":0},"AzMRL4sFWEnDT8VsNftKow":{"text":"STOP MAKING YOUR BUSINESS SO POLITICAL. Just be a freaking restaurant.  I understand freed","useful":5,"cool":0},"74p5derQZNfhIRCU_Jjyhw":{"text":"COW-FREAKING-BELL! I'm so done! I do not have any words to even describe this unbelievable","useful":0,"cool":0},"R_oceLB5MomalOmBT04NEw":{"text":"This place would be a perfect candidate for a 4.5 rating, but I decided to round up here. ","useful":3,"cool":4},"nyu53mKnszNXjp_8lYw-gw":{"text":"The burger is incredible, but not very family friendly. Every time i've come, the waiters ","useful":1,"cool":0},"f4EGUcP5NHbBvo9GPg7qdg":{"text":"Surely you and I both know the reference of watermelon and black people is highly offensiv","useful":2,"cool":1},"9AKRXlrxMEO4cfs1ObjZFA":{"text":"To be clear, I have no idea how the food is here, as we didn't get a chance to order and e","useful":1,"cool":1},"LF6jEevyjJ45slayd-Ssdw":{"text":"I did curbside pickup since I am trying to do my part. I had the Cowbell Signature Mac and","useful":1,"cool":1},"noKVClQtNAo-ZM03mm80xw":{"text":"On the outside, it does look like the area is run down. But at the restaurant, it has a co","useful":0,"cool":0},"AjbuVoIIovLwqzHhKAWDKg":{"text":"OMG!  This is one of my favorite joints and forgot to do a review!  Oops! My bad ya'll! We","useful":7,"cool":6},"WARECm7HnM9_pkZtMCm6Sg":{"text":"Cowbell is a cute little spot on Oak St with a southern comfort food menu. The food is rea","useful":2,"cool":1},"RsyYypjILhJ5PmVjnS2ITQ":{"text":"Amazing place! So responsive when you have feedback - especially Brack. He responded so ki","useful":0,"cool":0},"wz-pgBouKdnrxfBQg6o3gw":{"text":"This experience made me sign up for yelp.\n\nWe ate here on 12/4/18\n\nOrdered two drinks for ","useful":2,"cool":0},"6Q5VhGWSt6h-y7o8kana6g":{"text":"I can't say enough about this place. The staff is amazing. Thank you to everyone who helpe","useful":1,"cool":0},"U9sgVHWDfpoWIEes6l77dA":{"text":"This review pertains solely to a customer service issue I experienced.\n\nHaving visited cow","useful":3,"cool":0},"Oxk1vwPPURrYasGRd_0D8g":{"text":"I always pass this restaurant on my way to and from work, and I have never been able to go","useful":0,"cool":1},"WWT4xGG1Krx1hunr4LVf-A":{"text":"Burger was dry, pie tasted reheated and had soggy crust and worst of all the waitress had ","useful":3,"cool":0},"UlI4aZ3dxng7OZgBoo0vtg":{"text":"I was so done with my own cooking last week and then I happened across Cowbell's Friday sp","useful":5,"cool":6},"TCjw2CP2_-tRA9yxhDYOkA":{"text":"Man on man ... am I disappointed in Cowbell.  \nIt's not the first time I've had this issue","useful":7,"cool":1},"aCUOj4so0NEHuIteKznChw":{"text":"The parking lot is six cars deep... better get there early.  Their signature burger for $1","useful":1,"cool":0},"Nu-mY4-V2oUvHK8LlNxitA":{"text":"Had read good things about Cowbell so decided to try it last night around 7 pm.  It was an","useful":1,"cool":0},"-G7vXJu_IxlkdOW9oM01rg":{"text":"Amazing veggie burger + nice atmosphere = great place to catch up with friends\n\nI really r","useful":2,"cool":1},"1bzzcPSvjv9ZLRvfp-Puuw":{"text":"If you like a veggie burger Cowbell has a great one. It's their Harvest burger and it's se","useful":18,"cool":15},"H0r1__Hm9yjCxjKCcfVq_w":{"text":"If you're trying to \"cool off\" this summer, you may want to invest your time and money els","useful":1,"cool":0},"DvD9sRQUiOt83-nG4qI8Aw":{"text":"The first few times i visited this restaurant, i loved this place....The atmosphere is coo","useful":1,"cool":0},"xuo91dE-y8WBfv58vOX6nA":{"text":"I just moved to New Orleans, and I've already eaten here on 3 separate occasions. I can't ","useful":3,"cool":1},"VPcLKMRhxY7tTrKnUI-n0w":{"text":"Well color me impressed! I walked over to Cowbell from Ochsner today for lunch (about 1 mi","useful":2,"cool":0},"Xjr2lB0mYVSCUDgyuJ5gNw":{"text":"It nauseated me to get my bill. Our order consisted of a cheeseburger, kids grilled cheese","useful":4,"cool":0},"JqkKm8UbajiFredGcoj0iA":{"text":"Very offensive decor, from the picture of the Black man with a watermelon for a head, slig","useful":1,"cool":0},"WtHNC5eDmw2AzhSf8lRbFw":{"text":"This anchor at the far end of Oak street has continued to grow and serve really good food ","useful":3,"cool":2},"h_6Mg89zzsllL10LWpQIQQ":{"text":"This is my second time to Cowbell, and this time my order was based on the other reviews. ","useful":3,"cool":2},"8X1Hx8C1mr8Wl7f8ubgfFg":{"text":"We were visiting New Orleans from St. Louis and everyone in my group thought this was abou","useful":2,"cool":3},"VI2t7KOHmShaAIQ5zBUm2A":{"text":"I can't believe I didn't know about Cowbell!  Very happy my buddy suggested we go there fo","useful":0,"cool":1},"N0ngTV4fvDCwgE2ZZHuVow":{"text":"Cowbell, how do I love thee! The best burger in town. Sorry I tried to dine at that skank,","useful":1,"cool":1},"geT8T6LVtb3l3FERM-j8CQ":{"text":"Service was slow, burgers were all well done, prices were high and mac and cheese was good","useful":0,"cool":0},"2ewZTqRJuGeRXG-81GbEOQ":{"text":"By far my favorite place to grab lunch at! I've been multiple times and it never disappoin","useful":0,"cool":0},"slWc92Azf33vObnBuwxJxg":{"text":"Cowbell is an absolute gem. From location, to aesthetic, to food. Only wish it was a littl","useful":0,"cool":0},"jAIvbpBtSpgF0k132W0tHA":{"text":"Good burgers! Good service. Good atmosphere. Good prices. This is a fun casual place for a","useful":0,"cool":1},"1GmnNGLqBtCORRkXO5_h-w":{"text":"Cowbell has had some serious slippage on many levels, which is a real shame.\n\nI've visited","useful":6,"cool":1},"rH-wKyZ-5jes3T_eM-O1Hg":{"text":"The burgers are good but they are way, way overpriced and food generally takes longer than","useful":5,"cool":0},"vlb9KgCjsnEBU_g908EAtQ":{"text":"Very disappointed.  After ordering we were left in the dark.  Staff turned off lights due ","useful":13,"cool":1},"NDD7jVN4xshSa1e32VSz0A":{"text":"We had a friend tell us a couple times that we should try this place and tonight for my pa","useful":6,"cool":4},"7-n-dBX5dtPNXto-Z-exzg":{"text":"The burgers are amazing here and the meat is actually well seasoned unlike a lot of places","useful":2,"cool":1},"Ftp1meaF2n9JqefNmITpyQ":{"text":"Thanks Yelpers for a solid 4-star group assessment, we opted to have lunch here over 'that","useful":4,"cool":1},"WCOxSSwJrVo_-dsiCehsKA":{"text":"I had the good fortune on Saturday to have lunch with friends at Cowbell. Since I was not ","useful":0,"cool":0},"9ADu9lCmX0s5e0gCpWpbzA":{"text":"I've wanted to try this place for awhile. And since I was in the mood for a burger, we dec","useful":6,"cool":3},"Cc7vg-4yk0LflPfMYJ84RA":{"text":"Cowbell is so good! We started coming here for their burgers with the agogo sauce, so yum!","useful":1,"cool":1},"9unPUm7Z7pUt5Nu9YKvnGg":{"text":"We were in this part of town on a recent trip to New Orleans and someone recommend that we","useful":8,"cool":0},"zN4btaQx_NQ3mjB-W0hOrg":{"text":"4 1/2 stars - take that, Yelp!  I live in Mid-City, and I felt like exploring a different ","useful":1,"cool":2},"2EdRP-rG0nJskwrkncBOWQ":{"text":"This is why I love Yelp!  Maybe I'm slow but I never would have known that a harvest burge","useful":1,"cool":2},"j1T-9_ZWVCA8dNRF_JrSfQ":{"text":"I have only been living in New Orleans for 2 weeks- but I have kept a close eye on this pl","useful":7,"cool":1},"EJ0GRZbxyzCxJgGohGQ1RA":{"text":"Snarky staff, quirky atmosphere and the food.. More cowbell please! The drinks, perfect. T","useful":2,"cool":2},"nrsvyC4Zcux3IXVsqrzmAQ":{"text":"Well, Cowbell just lost a few regulars today due to their rude staff.  I showed up at Cowb","useful":8,"cool":2},"DW8EQe3DsUEsns_UHXhjJw":{"text":"Went to have what I thought would be a good experience at Cowbell. My 89 year old mother a","useful":5,"cool":0},"m-ce21FcpbavXF4_oz-y0Q":{"text":"I tried Cowbell a while back when it was on everyone's favorite list of new places to go a","useful":2,"cool":2},"VODb9vMfjq7-U0u2-ClzBQ":{"text":"Took a drive out to this little gem with my friend & I definitely don't regret it! So much","useful":3,"cool":1},"-LHGgSE_OvD8zN_wC5LLNg":{"text":"Love this place. Love the people, the chill vibe. But the FOOD, the food is right on point","useful":0,"cool":0},"xtMxp_mnfzvHVF6dV1QXqw":{"text":"This was one of the BEST burgers I have had in a LOOOONGGG time. Seasoned perfectly. my pi","useful":2,"cool":2},"3-Gq8C4Q1OmOT7Er399WEA":{"text":"Cowbell's burgers are painfully average and lack any real flare. I've given Cowbell two ch","useful":2,"cool":0},"In7ji92-0GDC99YN0pduGA":{"text":"Yuck. Hubby said burger was good. Dot's diner's burgers are better. \nMac n cheese was too ","useful":1,"cool":0},"GCG0omv5MUX9qAACd30ewQ":{"text":"Because of the weird, end-of-oak-street location, at the corner of train tracks and nowher","useful":1,"cool":1},"fF0SsLa5vXD-CNyS-JW4Vg":{"text":"UPDATE: Wow, the arrogant response from the business seems to support my initial statement","useful":3,"cool":1},"2KKCiFrUk5qeV0dAXlAXKA":{"text":"Very bad experience tonight. I frequent the Cowbell often; great food and great restaurant","useful":5,"cool":0},"vEdmBadMaazUniVLu-kY7Q":{"text":"The burgers are good but they are way, way overpriced and food generally takes longer than","useful":1,"cool":0},"XAO8oZUNWxm7J_t7eYLIUQ":{"text":"I came here because their burger was on a list of best burgers. It did not disappoint!! Fr","useful":2,"cool":0},"P9yoN43eNTq7N6g81o-dPw":{"text":"Everything I've had my two times here has been stellar. Tonight we had the special \"Yum Yu","useful":0,"cool":0},"ZSzpMKnpDPH8IiAcEwqmJw":{"text":"I visited with a few coworkers for lunch and we had a great experience! I ordered the adul","useful":3,"cool":1},"HVhy3zvbfEZCHigOacxWdA":{"text":"Cowbell has become a go-to for us in New Orleans. The ambiance in the restaurant embraces ","useful":2,"cool":2},"WsIvOmJvhS2BKGpzGnWHkw":{"text":"Been to cowbell several times in the past but was very disappointed last night. \nWe go for","useful":5,"cool":1},"8POqSpmotVZNaS1CS-bU1Q":{"text":"Holy COW . \n\nHow have I not eaten here in the past?! Man, was I missing out! \nMy friend an","useful":8,"cool":7},"8cWzfhnmxZxAnaDXUHqBOw":{"text":"Really wonderful food and cocktails. We sat at the bar and experience top-notch customer s","useful":1,"cool":1},"H06B5kNyaQxUTC7BEcdQ-Q":{"text":"I first ate at Cowbell about four years ago and remember overpriced, small portions... and","useful":7,"cool":6},"1f1Q0rzorbMSv4LWxgWUPg":{"text":"The shining star at this place is their desserts, homemade and fresh. Even their simple ic","useful":1,"cool":1},"_ndVFxqj7Lof92M0Djwyiw":{"text":"Add Cowbell to the list of fun & unique eateries that keeps NOLA atop the \"best city in th","useful":4,"cool":3},"iVtJGgJUQBqCmRovhr0T1w":{"text":"Awesome food and service. The tuna burger is great. Veggie options are also great. Environ","useful":1,"cool":0},"k1uwdzneyAK4Kfi5tu9g-g":{"text":"Came in recently for lunch, and again Cowbell satisfies. We both had a great burger here a","useful":1,"cool":0}}