{"MZrGESEdc1uTqofkrllxFA":{"text":"Food is good but takes forever to come out. And hope they don't mess up and give your orde","useful":1,"cool":0},"o96pHvmGDm_YqLJngqPh8Q":{"text":"They have really good Ya ka mein. Yes this one way in and one way out bar has good food. I","useful":4,"cool":1},"1swfFszAZoXVUldNU2y7hA":{"text":"The yakamein and shrimp plate I had was really good. Only thing I needed to add was hot sa","useful":0,"cool":0},"SEGdWfo13us-M2HUXiS8Pw":{"text":"great neighbourhood spot!  You can get a reasonably priced \"set-up\" (small bottle of liquo","useful":4,"cool":1},"i0RSEaMcu-WYN-Ns7HHjAw":{"text":"Very good food!! Portion of food could be more for the price. I will continue to eat here ","useful":0,"cool":0},"J9GOLWvkjDPRCpzco710ow":{"text":"Older crowd but the food is Awesome and you get your money's worth. Friendly atmospehere. ","useful":1,"cool":0},"8ZMh3zX8mrk8NdqTBjoUHg":{"text":"I only had the Yakamein (noodles, beef broth, beef, & shrimp) which was delish. I went dur","useful":0,"cool":0},"z_RMd0l7bTT0I0gT4Weszw":{"text":"Arrived and ordered 1 round with sweet old lady on a Friday night.   We were going to a sh","useful":0,"cool":0},"EQJ1JQgEbsMPbTtPmA9vBw":{"text":"I was in town and met up with a friend I haven't seen in several years. She knows the owne","useful":1,"cool":1},"2NcifZlxzd86fh3mKx7y0A":{"text":"Great hang out spot for happy hour. The music is good and the people who hang out there ar","useful":0,"cool":0},"47b-nDh83OQCogpUySX9IQ":{"text":"The food is overpriced and off-putting. The shrimp salad is made with hamburger toppings a","useful":0,"cool":0},"9ChcEt-d5j9eYDYmuv46vA":{"text":"When you're in town, visit the local bars and restaurants, owned and run by real people wi","useful":0,"cool":2},"a2Y7JqXdnfW1pctE0zPbqQ":{"text":"I have been hearing about the bar with the best Yaka Mein for over 10 years now and I have","useful":2,"cool":1},"bhbY4C5FK0bp18wcJJ7Lzw":{"text":"Amazing neighborhood bar! I honestly didn't expect much when I arrived but I was pleasantl","useful":0,"cool":1}}