{"UpPvPgvYoCMoDSHsoCdjXA":{"text":"So, Blue Agave plants are going extinct or whatever and there won't be any tequila in a fe","useful":3,"cool":0},"D2fFINFWuBaBBRDzbPED0g":{"text":"Has only been open for a month!! The food matches the eclectic atmosphere, while oozing ap","useful":2,"cool":0},"LyqbXipqT_rsHgRRtX_mFw":{"text":"I'm torn because I don't want this place to become too crowded to get to anymore, but they","useful":5,"cool":0},"44b4Sshb41nOodliBeiReQ":{"text":"A friend mentioned this place to me so I decided to check it out. I went in during happy h","useful":10,"cool":0},"U5JmllHWUUtulytP_7kz-w":{"text":"Wonderful food, best Mezcal selection in the city, lovely space, beautiful staff and barte","useful":4,"cool":0},"gxsg9A-i7ZkIYLsyHtjQYQ":{"text":"You've got to eat here. The drinks are great, and all of the food is fresh and delicious. ","useful":3,"cool":0},"99ziOjlsE4W0GHCt3xREXA":{"text":"FINALLY.... after searching for a Mexican place for the past few weeks my prayers have bee","useful":3,"cool":0},"FUnbhSQ3Z8qkU-XTA4-SPA":{"text":"Initially, the service was horrendous. There was a sign that said \"Please wait to be seate","useful":8,"cool":0},"j_zvjyu8iAvDTOAuLvC-SQ":{"text":"Every taco was amazing! The coffee mezcal drink with the coffee ice cube was my favorite! ","useful":2,"cool":0},"y2Tk7ji0MoEEPQcfcHbYeQ":{"text":"Honestly, I just showed up the first time because it's close to my work. I tried the cauli","useful":4,"cool":0},"-IhpP5MykdM0sEvhymIivQ":{"text":"Hands down the best Mexican food in New Orleans. The menu is unlike anywhere else with aut","useful":4,"cool":0},"KJ8PbQiquoEW6xchtEKT7A":{"text":"The Asada torta is amazing!! I would of snapped a picture but it didn't stand a chance. Th","useful":2,"cool":1},"A8f4GNAq304UMBOgFiSV-Q":{"text":"Perfect guacamole! Perfect tacos! Vegan friendly. Nice people. Cool space. A must go!!!","useful":3,"cool":0},"2rH7X6hTTuecwdU5bWlmYQ":{"text":"Every month or so, a dear friend of mine and myself meet up to enjoy a 3-4 hour lunch at o","useful":3,"cool":0},"3tXk3n7SEWBip63dLNoCVA":{"text":"Let me say this was the best food and drink experience I have had in several trips to NOlA","useful":3,"cool":0},"3NYhZwCQvOa1aGYtfe39tw":{"text":"Finally got a chance to visit and it did not disappoint. We walked in on a Saturday at 4:4","useful":2,"cool":0},"-Sw2LqAnDAqmmfZR04Wn0A":{"text":"Amazing place and food! Authentic Mexican flavors. We had the chicken pipian and the cochi","useful":3,"cool":0},"CvEyrwPxQwz2Gvl53IU4HQ":{"text":"Amazing food, great service and good drinks. It's a little off the beaten path but pretend","useful":0,"cool":0},"DWA4oimpV7LlO2bnCluYnA":{"text":"Delicious tacos, great vibe, and fast, friendly service. I had only 40 minutes before head","useful":2,"cool":0},"uBwd1ZmgoHyiUzN8J8-kqQ":{"text":"Great Mexican food with an amazing Mezcal selection.  If you are looking for great Mexican","useful":1,"cool":0},"6T9FVlfwY9wHnlNfQQ6SWg":{"text":"This is authentic Mexican food. Please go here and get the salsa, the guacamole and anythi","useful":2,"cool":0},"j97Kuz3mhdFsjM8jt0jWXA":{"text":"Lengua taco and the shrimp taco were AMAZING! The salads were delicious as well. My favori","useful":0,"cool":0},"yqlXLCsEl9y4vxyK8DDl1Q":{"text":"Where do I even start... EVERYTHING was phenomenal! Taylor, our waitress, was amazing! She","useful":0,"cool":0},"LUC8-ZNnFIVTU50l12WyEA":{"text":"Great hidden gem! The food was great and I loved the Mezcal. Myself and my friends loved t","useful":4,"cool":0},"prrlAHIIs7Zu3Zd2XOctvg":{"text":"Finally!! A Mezcaleria in NOLA! Not only do they have a great start on mezcal selections (","useful":3,"cool":0},"qSdD9bGBQ2eiY1SLw3jRpg":{"text":"Being vegan, we have had to be a little more creative in our food ventures down here in NO","useful":4,"cool":0},"ZWL3kMlJUbNNCiufXbNgqA":{"text":"SO Because I am a Tequila Lover I must say I am a Fan of this spot. The ambiance of this s","useful":4,"cool":2},"IYINPyDJPflKiBZAgwUpmg":{"text":"Great great food and drinks!!  It's always a plus to be able to experience a new (to us) r","useful":1,"cool":0},"0LT5IekRxBSZ3VOFgNY0OQ":{"text":"Just wow!   The tacos are amazing.  Easily the best I've ever eaten.  Hopefully the locati","useful":3,"cool":0},"DDKaY5hc3dPOU8yhyQwI5Q":{"text":"This place stole my heart. We came without any plan just looking for a mezcal cocktails pl","useful":0,"cool":0},"dH4AIYNoRKE5AVntDeFp_A":{"text":"Came here for a work lunch - it was all so authentic and yummy. The interior design is so ","useful":4,"cool":0},"N2XiTBDFkLh2tDaZSV8Feg":{"text":"Espiritu is honestly a hidden gem. I grew up eating Mexican food and this place did not di","useful":4,"cool":0},"YEaPlswOdgJIy8naIePGmA":{"text":"So so so happy we searched \"mezcal\" on Yelp while we were in New Orleans last week. My hus","useful":7,"cool":2},"WUQAzgHVHiudcbDE3tgJKg":{"text":"Growing up an orphan on an agave plantation in Mexico, even as a young boy I developed a s","useful":0,"cool":1},"Sdyd-L8hlTtSSwDpfUxtNA":{"text":"Wow....the tacos were AMAZING. I usually feel as if it is hard to find a decent lengua tac","useful":2,"cool":0},"Qq5_p0SapxYJKRemSe9v2Q":{"text":"Quite simply the best!  The bar tender has a special knack for creating craft cocktails an","useful":1,"cool":1},"3ibfY5vY5Qc__c5FxR1yTQ":{"text":"Espiritu was cool! Large selection of Mezcal, not a large selection of food. Tacos are pre","useful":3,"cool":2},"0d3pnBNT4flYCMXeoWkSSg":{"text":"Very tasty food, we highly enjoyed all the dishes minus the ceviche which was odd. The hui","useful":0,"cool":0},"J28GXZYbUALkyH7wDCGI2A":{"text":"Mexican food always catches my attention, and Espiritu was on my list of places to try for","useful":3,"cool":1},"ZIgO44uazvUNIIBy9abx4A":{"text":"This place is amazing from the atmosphere to the food & of course, the mezcal margarita, c","useful":2,"cool":0},"vHKoF2h01M2luLSiN_pBgg":{"text":"Late review from March. Dinner was delicious, and cocktails were as well. Service slightly","useful":0,"cool":0},"kUebsUCO6HGdffP_S11zTw":{"text":"Authentic, delicious, and healthy Mexican food. Went for lunch. Everything takes fresh; se","useful":1,"cool":0},"4bOg6A6Sgpg4CMkgYmFJLg":{"text":"Excellent Tacos, delicious drinks, everything we tried was great. The cauliflower taco is ","useful":1,"cool":0},"QgZep9tH3r5IzpGY383Dlw":{"text":"Wonderful gem to find in NOLA.\nWe were looking for a great place to get some guacamole, ta","useful":0,"cool":0},"v6kj2ndjJGx88wmEyMrLwA":{"text":"The food, the drinks, the service - absolutely amazing...each and every time. And the \"Mez","useful":0,"cool":0},"35YwGBTJ2-S_Oz-_r2WFYw":{"text":"Excellent lunch today - fresh guacamole; crispy, light tacos; friendly waitress; and pleas","useful":1,"cool":0},"vLGqejmbpyImFMPZ0Fz-nA":{"text":"If you are looking for a unique margarita, look no further! This mezcal bar has a fabulous","useful":0,"cool":0},"Qv_lAosgVkRMLSIrxPJD2w":{"text":"Great place !!\n\nThe Crispy Shrimp, Baja Fish and the Pork Tacos were all excellent. \nEach ","useful":1,"cool":0},"c8IvvsYMcRGSZPOzBsah2g":{"text":"Wow, really amazing food and craft cocktails. Huge selection of Mezcal and hands down the ","useful":0,"cool":0},"eOpomVHDbqlSNYzElh8B6A":{"text":"The food was amazing. We started with the Happy Hour specials and we were hooked. We liter","useful":0,"cool":0},"S84Ahj0FbCmqCks1Yyukqw":{"text":"Me and the girls were going to another taco place that we previously deemed best tacos in ","useful":0,"cool":0},"V-MlPY0up_IC6lPR19cA7Q":{"text":"The food was good but had a bad experience. The table across from us had a party of 20+ th","useful":0,"cool":0},"I4tS0iyWmXWtiHWoF_qinA":{"text":"Location, atmosphere, service, drinks and food. Everything was delightful. Great happy hou","useful":0,"cool":0},"gW-gSYYgV9_a8_c7dQGMoQ":{"text":"Amazing Mexican food & drink in NOLA. Our server was extremely knowledgeable explaining al","useful":2,"cool":1},"cCgRfs4u5fYJuWiRYzlluw":{"text":"Found this spicy gem while hunting for Mezcal and Wow!  Sat at the counter and ended up ch","useful":1,"cool":0},"bsq_tiX2B4mzJCR9o-tbvA":{"text":"After 5 days in New Orleans and countless amazing meals my husband and I agreed that our l","useful":3,"cool":0},"c0WEwX6JjDRB0SlmENBKzg":{"text":"Awesome drinks, awesome food, great service. Menu is small but everything is great. The me","useful":0,"cool":0},"k57K11Cj9P0-bjmpqjw0Iw":{"text":"Outstanding food, vibe, decor, employees, prices, etc... A wonderful place to try for a gr","useful":0,"cool":0},"vGHjjnh6lvLK110k6rlVMw":{"text":"We had someone from NOLA suggested this place and we walked 20 minutes to get here! The fo","useful":2,"cool":0},"E-zrSK9uCQb6acTKjmrflg":{"text":"Listen, I'm a taco eater through and through. So I was a little worried when I got the cau","useful":0,"cool":0},"actancl4g3BeaFR2ZWGW2Q":{"text":"The cocktails here are amazing.  Top notch across the board.\n\nThe food is great too.  I am","useful":5,"cool":3},"nHMEYLbWh5Mll_k6rsbnzg":{"text":"After my last review shortly after their opening, I said the service was lacking because t","useful":1,"cool":0},"KUTQJoAToo_Z5HYYi-LAhw":{"text":"Poor service. Limited menu. Food was hit or miss. Stay away from the cochinita torta.","useful":11,"cool":0},"qTer_0ET2fVnG82aMwh_mw":{"text":"Looooovvvveeee this place so much!! Every time I come here it is consistently superb.  For","useful":3,"cool":1},"hrTXbLUKvRelMP3fRzNSKA":{"text":"Wow, just wow! As a California native and someone who has recently lived in Phoenix for fi","useful":3,"cool":1},"Gf7rBIkYMMcHoqtUfH1K9w":{"text":"Super cute, super small space set just enough out of the hub bub of the French Quarter to ","useful":0,"cool":0},"SBI0OzkQ-jWokkJDixgrGw":{"text":"I'm always skeptical of Mexico restaurants when I'm not close to the border (i.e. Arizona ","useful":0,"cool":0},"Ybfgs66Epp4RXwgqkC7PQQ":{"text":"After my last review shortly after their opening, I said the service was lacking because t","useful":0,"cool":1},"aJGQNH-3KKYfsKBaO7zUXg":{"text":"Short story: step into a Mexican oasis, order some mezcal and a cauliflower taco; you won'","useful":3,"cool":3},"bTQ-6rdeZzsiiMb5x3Djbg":{"text":"We heard from multiple people that this place adjacent to Lafayette Square was awesome.  T","useful":2,"cool":0},"eke0L51COtlPjdfkr5f0-A":{"text":"We visited New Orleans from Chicago, and by our 3rd night there we were craving something ","useful":0,"cool":0},"8Q_jef1tixQBKz4mdjYM4Q":{"text":"Very good! Everything we got was super delicious. The menu is limited right now because of","useful":2,"cool":3},"AqLyDmkSF3wvH7NCJd3uiA":{"text":"Innnnnncredible restaurant. The drinks are by far the best I've ever had in my life. \n\nThe","useful":1,"cool":1},"jTGU9LZZRawNmv1W4zTKbQ":{"text":"Found this place after a few other restaurants nearby had long waits. Turns out we loved i","useful":3,"cool":4},"CWnUnyo5fz3L86y5VHn0Ww":{"text":"Really enjoyed my first experience here and can't wait to dine again!\n\nMaybe the best tong","useful":1,"cool":1},"fklLDtR63DUoBVELaUcPZA":{"text":"I came to this restaurant with an open mind thinking their food will be great. I didn't ev","useful":3,"cool":0},"wKRI_c73pfaajFEKjUbiDw":{"text":"Let's just start with the bartender Daniel, he's one of the best hosts in New Orleans. He ","useful":0,"cool":0},"t893DMj97B4GbiatiV0xPg":{"text":"This is my third time in and the first and only thing any staffer said to me was \"it will ","useful":4,"cool":1},"C55hJu6cG-Poo5PBVFjh9w":{"text":"Limited menu and not a lot of flavor except the Guacamole or in our case garlic dip. No on","useful":3,"cool":0},"gsq4fCjQBHF-gP0HpgMMhQ":{"text":"Where do I begin, probably the best Mexican food I have had in years! From the cauliflower","useful":0,"cool":0},"qngYxcVmiMXP6cdKvQHC0g":{"text":"Loved the atmosphere, the food and I had the best margarita ever.  The tequila was smoky w","useful":3,"cool":0},"ytg-n3oQxMg7mrPv9_0ibA":{"text":"We stopped in for their Happy Hour. This place is slightly hard to find because the street","useful":5,"cool":5},"SwuIFZrjfgzESoAePHlLcQ":{"text":"Espiritu is located on a hidden side street. You wouldn't see it unless you are looking fo","useful":4,"cool":1},"smHnyTmwi-AjgMlqFtPQSQ":{"text":"Great food and excellent service. Friends, my wife and I tried several tacos, salsas, guac","useful":0,"cool":0},"8mNzA35mvRk1zTv2XnEXjQ":{"text":"I am from Houston, TX.i may be a Mexican food expert??? Anyway, I wanted to try taco in NO","useful":1,"cool":0},"td8mOpSL3s6ZdR8MjyHTfQ":{"text":"Cool ambiance, fast service, good food and very reasonable prices! Nice to have some other","useful":0,"cool":1},"JBmYfuS2mUE6mCv5Gt9hsA":{"text":"This is a very cute little place in the Warehouse District-meets-Downtown area but is tota","useful":1,"cool":0},"Dq6nYuR2h9h_8rlBzTlDcA":{"text":"My husband was on a business trip and  I took a mini vacation to New Orleans and joined hi","useful":0,"cool":0},"Xbc7Rsfy1kyef642lkcAkQ":{"text":"Doesn't look like much walking by but wow was it worth the stop in. \nTacos were amazing. G","useful":0,"cool":0},"i9qJHIKJAB5-XzYRy2FRlA":{"text":"It is a very beautiful and well-kept restaurant. Love the employees, they are very kind. T","useful":1,"cool":0},"nunNPXTcVJHKPhrpR51x9A":{"text":"The food and drinks were fine. The service may have been the worst I've had in years. The ","useful":10,"cool":0},"9qlqQI56ifx8S5TZ-WfY4g":{"text":"At the old Capdeville location. Friendly servers. Good food. \n\nHabanero salsa ($3) - or yo","useful":16,"cool":7},"fewirwMqyTDGlmfNlaGEPg":{"text":"I love this place. Been open just about two weeks. Excellent cocktails especially the Mezc","useful":5,"cool":1},"zHKjINzKU9594i5smgZTQw":{"text":"Great place off the beaten path. Food was delicious, some different Mexican dishes compare","useful":2,"cool":0},"CrMCGpqXfqrdVU5et-Rs-A":{"text":"What a GIANT disappointment. We walked 3/4 mile on a Friday night to try out this well rat","useful":3,"cool":0},"6SXkOV36A-e34wN2RTo-_g":{"text":"Great variety of tacos!  Chicken, pork, carne asada, shrimp fish and sweet potato.  Out of","useful":0,"cool":0},"_ro-Oo6rkk7PSNslR0OURw":{"text":"It was our last day of a girls trip to essencefest. We decided to have a pre-departure din","useful":1,"cool":0},"vmbHfAO2z6OEY4ig3exPRQ":{"text":"Four of us, one vegetarian, went with lowish expectations because it was 9pm, we didn't wa","useful":4,"cool":0},"VXrrFw7IyGdjy23pyBg5wg":{"text":"Great drinks. Loved the flight of salsas and the ceviches options. Tacos were just okay. G","useful":1,"cool":0},"CdQXlU4hSz68h8j5b-Un2A":{"text":"The food and the selection of mezcal was great, Mike the bartender was amazing! Very frien","useful":0,"cool":0},"_5Lqzp2jc9ur9AMsoaKqBg":{"text":"You'd think the best spot you could try in New Orleans would be Cajun however THIS mezcale","useful":0,"cool":0},"foFlNzLG2lW_lT4sUmTA3w":{"text":"We walked down after Wednesdays at the Square, and had been here a couple of years ago whe","useful":12,"cool":0},"oDnf6-X7xS0KKp5kPGEAcA":{"text":"This unassuming side-alley Mexican joint is definitely what I was looking for. An array of","useful":4,"cool":1},"IyCaW4qFiXW8HSDJvv4URA":{"text":"This spot is tucked away from the French Quarter crowds. You're definitely in the know if ","useful":2,"cool":3},"4hoDz_pAv5sGR-1-jKQ3bQ":{"text":"Great little spot!   Warehouse district, not the tourist heavy other side of Canal.  Had a","useful":0,"cool":0},"htzVvYxzeXdPU8YkYyl9eg":{"text":"Very hip little taco/mezcal spot on Capdeville, in the space formerly occupied by a bar/re","useful":17,"cool":16},"ITEOaFHIsfLFJ8eMIlbTrw":{"text":"Overall, solid modern Mexican restaurant in both food and drinks. I recommend going for ha","useful":1,"cool":1},"gVP4oMP9uUXu2s3GkRb11w":{"text":"I crave the cauliflower tacos they have on a daily basis. So, so good! Taco Tuesday? Why n","useful":4,"cool":3},"JKG-3IHBd1Nql5EDMLtwmA":{"text":"Home of the old Capedville is this hidden gem.  Whether you're in the mood for Mezcal or a","useful":1,"cool":1}}