{"5_MTHUvxrQBIDre0SDq6Zg":{"text":"Delicious out of the world beignets that can be washed down with the awesome coffee. It is","useful":1,"cool":0},"1llKe0pLwcbp5Di3Q0ZOhA":{"text":"Very good beignets and solid cafe au lait! I have always wanted to check this place out an","useful":0,"cool":0},"fBjQNxflBgA7fcHCZXVSKw":{"text":"Great beignets and great coffee.  Quick service.  My only \"complaint\" was the noise of the","useful":0,"cool":0},"GlwGWlxh2td58TBb1YbVlg":{"text":"Best beignets in New Orleans. The dough is just magnificent and they supply unlimited powe","useful":1,"cool":2},"gSXrsK3x0juog4BCm16HbA":{"text":"We obviously had to go here on our trip to NOLA. It was fantastic, especially the beignets","useful":0,"cool":0},"PYVBo99SvZaw6uQ7NnRcOA":{"text":"This place was surprisingly not that crowed, me and a friend found a quaint table near the","useful":0,"cool":0},"bIHoKYa05w3SCuN3FBi13w":{"text":"All I can say is, wow! The beignets here are just amazing! The lines seem super long but f","useful":0,"cool":0},"nuarHXg-qcc3O3AhYq08ew":{"text":"Historic spot told by many to visit but I will be honest a little too much hype. Beignets ","useful":0,"cool":0},"HuN9efSSofBIsrBxZZdLtQ":{"text":"If you never have visited, then you need to. It is a must. Open 24 hours a day. It is a li","useful":0,"cool":0},"AIYMWiM4lvTxnPlmI5SdmA":{"text":"The best French donut ever!  Can't believe this place can sell only one food item only! An","useful":0,"cool":0},"22Qy1PDPC8EgDvxjfD9l4A":{"text":"I was excited to come here and show my family an experience of a lifetime. It's not to oft","useful":0,"cool":0},"aGzu2TyecUpBKPwHBsG4IQ":{"text":"If you enjoy donuts and have not tried a fresh and properly prepared beignet from Cafe Du ","useful":3,"cool":2},"shfVSA9cE9kkStokhc-eAg":{"text":"Overrated.  Crazy busy and not that special.  Yes you should walk by it to see it and know","useful":0,"cool":0},"BOpk2SD4T9JrwSf9z4glyA":{"text":"The line is crazy but the beignets were good. They were a little smaller and chewier than ","useful":0,"cool":0},"2_TCKOt_tnZuFKjOaG_Xfw":{"text":"I can honestly say everyone hypes this place. The only thing I would say is try it because","useful":0,"cool":0},"vV7jVJammw2Ig7ktoKIp8g":{"text":"A place everyone in NOLA needs to try. A bucket list cafe in a bucket list town.  Beignets","useful":0,"cool":0},"QNjv8ahod1tOLTpiECArcw":{"text":"Cool experience. The beignets were solid, but I could not see myself waiting in long lines","useful":0,"cool":0},"0-mAvGTCn-6umPgwwH8uTA":{"text":"So good. I love his place super cute, quick service great prices great atmosphere. Highly ","useful":0,"cool":0},"Kfyvf9WULxU_GzbXHP-Tyw":{"text":"Went early Saturday morning around 7:30. They were not open yet so we waiting in line. Onc","useful":0,"cool":0},"vGkNNutyjIeYVKPSXYUNbg":{"text":"a must do in NOLA - great for people watching as the night wears on!  Beignets were very s","useful":0,"cool":0},"Ty4iQ2hBa05kVlr7YfFL2Q":{"text":"Delicious and irresistible! Walked over on a rainy day with my boys and experienced no lin","useful":0,"cool":0},"cKRo1_VJVHFuHptFUfKMag":{"text":"This place gives me so much life! Not only are their beignets to die for, their coffee hit","useful":0,"cool":0},"j4tkEMjV3imL_FZmeYljDA":{"text":"Why is this place popular? Long lines, bad service, and they only serve coffee and beignet","useful":1,"cool":0},"9gG-ZWWzur78ol0H3vR9Ag":{"text":"Hard to believe this has so few reviews and be such an institution. These are the best bei","useful":0,"cool":0},"hg2DQphPV61S8nqrs7nV1g":{"text":"UrSooooooo Delicious ! \n\nThis place is landmark for a reason ... Simple menu . Delicious b","useful":1,"cool":1},"221EyW-dGpOBzuL2ev9fsg":{"text":"Beignets were amazing but the service is no stars!  We waited for service and couldn't eve","useful":1,"cool":0},"-9OK593nHio5il4JAdmv1g":{"text":"This place is definitely over rated. The line was short but once you're in the cafe it's e","useful":0,"cool":0},"fXkamxWqQbHeEFm7VQDpzA":{"text":"So have already heard a lot before I even landed NOLA this was definitely the place I head","useful":0,"cool":0},"OrRAbQ4c2g2vRQrWrAQx5g":{"text":"Don't waste your valuable time in here. The place is overvalued. Dirty and overcrowded all","useful":0,"cool":0},"vwof4dnSEigYahvvhkCE7g":{"text":"Always delish! There's usually more sugar than necessary but that's quite alright with me!","useful":1,"cool":0},"2CaiBz4eq6eH5y4Of3YpMA":{"text":"Yummy beignets and iced coffee. We stopped here after visiting The Presbytere. Great treat","useful":0,"cool":0},"JowFFGYJSU8eRWkw4YJhbw":{"text":"Maybe it's a tourist trap but regardless I would willingly return back to this place.\n\nThe","useful":0,"cool":0},"8kufBDMk6dEwlpDbc0xM_A":{"text":"I'm surprised at how a restaurant serving just one thing to eat can become soooo famous...","useful":0,"cool":0},"UQ4D7VJp8GrNOK3aU1YN_w":{"text":"SO GOOD!  I'm obsessed with their begneits (sp?)!  BUT they only take cash so make sure to","useful":0,"cool":0},"ujvFYUKVeTWTAFeB_5Xxxw":{"text":"Delicious beignets, 3 for 2.50. They where hot & fresh. A must try in NOLA. Check out the ","useful":0,"cool":0},"z9D5hgrnjkpzAEW4pT-mNg":{"text":"Gross.  Gross. Gross.     Just look at the floor.  Holy cow.  How can this pass any inspec","useful":0,"cool":0},"zoFa9cw4x1gOk0gRcg3F0g":{"text":"No trip to New Orleans is complete without a visit to Cafe Du Monde.  We lucked out and on","useful":0,"cool":0},"ZFDpp-ErsUybWrg1i6vMCg":{"text":"Must go to place in New Orleans for cafe au lait and beignets.  Definitely not the best be","useful":0,"cool":0},"utZLBjCM30nuk9-oum1mXQ":{"text":"Love New Orleans and love Cafe Du Monde. It's a pain to visit early in the day, but the af","useful":0,"cool":0},"5yyTI44C5eIAnuwoFq7Wrw":{"text":"A must do!!! I prefer Cafe Beignet, but this place is an institution. Go late in the night","useful":0,"cool":0},"5kjz5rPcTwXO29ub3d60GA":{"text":"Great time. Food and coffee were hot an delicious.  Quick service, table was clean. So gla","useful":0,"cool":0},"eGbJ8ijF6PpHi4kqe4MqQA":{"text":"The coffee and hot chocolate are nothing special, but the beignets are a must have when vi","useful":0,"cool":0},"N3YzpdOuTmEE6pktinZbXg":{"text":"Cafe du Monde is a New Orleans Institution and even after living here for a while I always","useful":0,"cool":0},"P9LD6C98AO0STxe66fAzpA":{"text":"Great place to reenergize after a lot of walking. Lots of seating, background music from t","useful":0,"cool":0},"Svo7LIwUXASLnxledxQKbw":{"text":"Ahhh, it is a plate of 3 pieces of sweet, sugary, warm doughy fried goodness in your mouth","useful":1,"cool":0},"bGD3BkgW7LOigjyr6jeH0Q":{"text":"I sampled these beignets and the ones from Cafe Beignet down the street. While the differe","useful":0,"cool":0},"uN_dtQ8bL3UfQhR7JFEuGA":{"text":"The cafe is always busy, which isn't surprising. \nThe beineits are very good. They remind ","useful":0,"cool":0},"jn_HF5YlXeJ8NRT99GzIFQ":{"text":"Great first time experience. The beignets were amazing and the coffee was spectacular. Its","useful":0,"cool":0},"G-PfZFZJBOe1w6h3ub7Tig":{"text":"Disappointment describes my experience here. Maybe it was a bad day. If you've ever had th","useful":0,"cool":0},"iHv7t6FXJw1n9Yb59QJ7zQ":{"text":"Wonderful coffee and beignets. They had 3 for $3.00 with lots of flavor. The service was o","useful":0,"cool":0},"PH7Gx4J9h5dP3cqEBzb-GQ":{"text":"Place lives up to its reputation, tasty beignets with tons of powdered sugar. Went around ","useful":0,"cool":0},"ifcqBbE2yBQQoP4F47h1DQ":{"text":"Long line to sit or to-go, but who wants to enjoy powder-covered yummy goodness on the go?","useful":0,"cool":0},"l2QXlRmjF2cPNxdprTUZRA":{"text":"TIP: If you're coming here for he first time on a busy summer day, I hope you know that it","useful":0,"cool":0},"7Nj4eHROygcunmiCNdjpoQ":{"text":"The beignets were amazing. My mouth is still watering thinking about them and I hate dough","useful":0,"cool":0},"jV70zTSH4Ayf_KePv4q5aw":{"text":"Huge tip: go and sit down without waiting. You don't have to wait at all. The people on th","useful":2,"cool":1},"Sa-Y6YibT5T7dcWhPLP4Bw":{"text":"Good times: great people watching, friendly staff (there was a young guy who was super fri","useful":1,"cool":0},"qI7aDvR4nspaeKpbVphO0w":{"text":"Gem of the city. I actually came down to Cafe Du Monde twice during my visit to New Orlean","useful":0,"cool":0},"OXEhVa8ayAokk9evXb0JKg":{"text":"The visit to Cafe Du Monde was a must have experience. The Beignet's were good. However, i","useful":0,"cool":0},"3jH90TsT3Tyy2NaUmAuLow":{"text":"Cafe DuMonte is the place to go for a late night snack the Chickory coffee is phenomenal, ","useful":0,"cool":0},"Uoi_EvO61eQJulwpnLiFkw":{"text":"Drunk? Hungry? Stop here for some powdery fun fried puffs. \nThen you will be a little less","useful":0,"cool":0},"8ijiDv8PsidJjYiG-ZL9QA":{"text":"This is my go-to spot for hot chocolate and beignets.  The combination is divine.  The ser","useful":0,"cool":1},"tKsLoZDvivrt6hZ1Sr2hQA":{"text":"Known for it's beignets and coffee I tend to like this place more for its historical appea","useful":0,"cool":0},"AMLwxShDSCMGj2Xc7zF9pg":{"text":"Definitely a must when visiting NOLA. The beignets come in threes and cost a little less t","useful":1,"cool":0},"9yENJanIan7g8hgGNbAjrQ":{"text":"Must do in New Orleans. The sugar is everywhere and you will probablyl inhale it. Get an o","useful":0,"cool":0},"erb10Gdu1Nu7DLRhOIkJHg":{"text":"Beignets - o how I fell in love with them after my NOLA trip. They are soooo good! There w","useful":0,"cool":0},"oqslYTS6gDTZ9e8dRpTrjQ":{"text":"The line was not long at all (10mins for us). We really like the beignets and the coffee. ","useful":0,"cool":0},"s2bdQOu1R8-iK2cIEjQ0tA":{"text":"One of my favorite, must go to places.  Delicious as always. Friendly staff and the live e","useful":0,"cool":0},"oVl1Eu7o8AfMDPKsLbkECA":{"text":"What can I say about Cafe Du Monde that hasn't already been said? I went SEVERAL times dur","useful":0,"cool":0},"yDGyXVRJUZyYeoAHrpEq6g":{"text":"We are early risers and went at 5 am when there was only one or two other couples in there","useful":0,"cool":0},"BJo6dxgtR9znoFO3WZAhyQ":{"text":"Cafe Dumode for fresh Beignets! Happy tummy anytime of day! Seating is outside under the o","useful":1,"cool":0},"CvThs6bUZGLLoiFloUI1sw":{"text":"Excellent, the only negative side is that they told me not to take pictures of the working","useful":0,"cool":0},"hZJd9YaEPg0TrJu-A7WEeA":{"text":"How can you go wrong? I got there at 8:00AM and they were already open, even though the we","useful":0,"cool":0},"Orb1iNVxxmz-TyXZ5CjxlQ":{"text":"This is probably blasphemy for me to say but It seems like a cafeteria that only serves do","useful":0,"cool":0},"pItweozq3QnFyfixXVmPVw":{"text":"Being in New Orleans, I had to visit. I did the the to go option and was in and out in abo","useful":0,"cool":0},"JOIzbtRdEbY0seI1eevOhw":{"text":"I was able to stop by Cafe du Monde for the first time during a recent trip to New Orleans","useful":0,"cool":0},"bAGQGxiSgnTFxTDFhCEfNw":{"text":"OMG!!!!! I could eat these everyday!!! Make sure you go here when in New Orleans. It's atm","useful":0,"cool":0},"Vg4lmJ3kJOEjLH3-ps8Nvw":{"text":"Beignets are good, worth trying when you visit at least, but not mind blowingly awesome.  ","useful":0,"cool":0},"YK9a-VXdUCWPyZFJ6skTGg":{"text":"Great Beignets!! A beautiful fried donut served in 3's. Ordered our to-go from the counter","useful":0,"cool":0},"Ido9h3HCjwI4wGClwK0AAg":{"text":"First time in NO, so had to do it. Totally worth it. A nice break from the day topped by a","useful":0,"cool":0},"yUQ8aZgO18mGtLHUVQylEw":{"text":"Beignets and coffee after hitting up the Napoleon House for dinner. I didn't even have to ","useful":0,"cool":0},"PQV-smhPb7IcAbBrIyWGCw":{"text":"First time in New Orleans and everyone told me not to leave without visiting this place. T","useful":0,"cool":0},"cc8M9Nv-mSdGRg57Jvzr_Q":{"text":"Not sure about all the hype. Awesome that they stayed open late. Beignets themselves were ","useful":0,"cool":0},"GjijBxyK8XQoTsU3kbyCvw":{"text":"Love the coffee here.  Limited menu but great chill out/snack stop. Quick service.\n\nI avoi","useful":1,"cool":1},"NvzE_bR1sZkTE2shc7qY5A":{"text":"The place is a legend. Its really become to commercialized,  to crowded.  Try cafe beinget","useful":0,"cool":0},"PEGktYFxhZwndGExMSnH-w":{"text":"Our tourist stop of the morning! To start off, they only accept cash, i didnt see it poste","useful":1,"cool":0},"N2OrINu6aNqN4W_7-WMY4A":{"text":"Great morning stop for beignets and cafe au lait!","useful":0,"cool":0},"mDfE_hwmxdQZgBWBVybZvA":{"text":"Disappointed at the cold milk (chocolate).. I got trumoo. Could have got it from the CVS n","useful":1,"cool":0},"GpK8Gt7Zk-pu1TQwdtNyVQ":{"text":"We had to do it.  It was my daughter's first time in Nawlins, it was cold and wet outside,","useful":0,"cool":2},"DxR6FH6tnKG1m6zDYiUw3w":{"text":"Always great! Very consistent and just a great time! One of the best places to go in New O","useful":0,"cool":0},"7tyVMVxo_lIusqR0HM83kw":{"text":"This is a nice place to get a sweet fix. I would only visit here during odd hours to avoid","useful":0,"cool":0},"jEGrfPzkazSOmmpn9tsQbg":{"text":"Café Du Monde is one of those must dos as a tourist for coffee and Beignets. The café firs","useful":0,"cool":0},"PsWWqpMakdgEdZJCIyNQQA":{"text":"Just can't go wrong with this famous café.  The menu choices are simple ... beignets and c","useful":0,"cool":0},"FTTVFeYhYqbWSqeAEzq6cg":{"text":"Their beignets live up to he hype! I was here almost everyday during my trip. Remember to ","useful":0,"cool":0},"QHB4V_AMEKe5lCm601dHRw":{"text":"I feel this place is overrated! The location of this place has created a big name for the ","useful":1,"cool":0},"BwvJbCooKOcLtHtDS4R2qw":{"text":"It is what it is and that is mighty good. If you are going to do bad for you food this is ","useful":0,"cool":0},"Ad4qbQdhHaxGRuUFYcV2lQ":{"text":"as a tourist, it's definitely worth visiting since it is one of the most iconic places to ","useful":1,"cool":0},"5Eh0ROvTnqXrSmg7pKF6sQ":{"text":"Beignets and frozen coffee were amazing! We went early in the AM and avoided the large lin","useful":0,"cool":0},"zoRnQcHTqAV0yjD23TKaIg":{"text":"This place was pretty good. As someone who doesn't really like sweets, the beignets were a","useful":0,"cool":0},"RYWaHZUZIslLGwUwFvWY8w":{"text":"The Beignets were nothing special and the service left a lot to be desired. I also felt li","useful":0,"cool":0},"RNXD1XlF3sySJAGl8gJqWQ":{"text":"Who doesn't love Cafe du Monde?  It's one of my must visits any time I am in NOLA. It can'","useful":0,"cool":0},"FT6iZDJgiqVWbcQKaubVvQ":{"text":"Sooooooo good. Went early in the morning with few people there. Quick service and amazing ","useful":0,"cool":0},"6bkaWQNSkbY4H2H1YCSR5A":{"text":"Cash only. The original Cafe Du Monde across from Jackson Square. Be prepared to stand in ","useful":2,"cool":0},"LQ6zGHMxhFcr4P15l0Xxgg":{"text":"Great place but just know that the menu is limited to coffee and baignets.... that's it.","useful":0,"cool":0},"f5uhENWwaHK_VWO98PmsTg":{"text":"I've been coming to this place since I was a really little kid! I grew up about 45 mins fr","useful":0,"cool":0},"o02FpUJDVucd77Uw6Zt0uQ":{"text":"The ORIGINAL location for Cafe Du Monde.  Open 24 hours.  When it's open 24 hrs, I don't s","useful":1,"cool":1},"TERXTSyr74I26yMqFi2T9Q":{"text":"Cafe Du Monde is a must stop if you are in NOLA! Once you are sitting there with some powd","useful":0,"cool":0},"gM9ErgVK5p6RofhK98Q39w":{"text":"Don't wait to be seated. A local said to sit at an open table and you'll be served. If the","useful":0,"cool":0},"nSjMcOu09lVAzx34x-sNSA":{"text":"This is my third time here and it never fails! The hot gooey bits of dough with that mess ","useful":0,"cool":0},"lQJar6fkSlhFT0w7z_kiYQ":{"text":"It was alright here. I thought it would have some feeling and look of a French cafe. It lo","useful":0,"cool":0},"0TRlLXs5lY6P_DcukGxRKA":{"text":"It was my second visit  in New Orleans last weekend when I anticipated trying the beignets","useful":0,"cool":0},"uKbj-9w3SosKQQ1mv98X2A":{"text":"3 stars because the beignets and cafe au lait was yummy. \n\nThat being said, I didn't feel ","useful":0,"cool":0},"XTM-o9t4aUSD29nKcUJWjw":{"text":"This was our first time in New Orleans for Mardi Gras and I love love this place! We had (","useful":0,"cool":0},"ebFKFYWp74B5Bgeo_L69Hg":{"text":"Love this place! Excellent start to the morning! If you enjoy coffee and beignets, this is","useful":0,"cool":0},"_PXMSgBEkSy0du6MoWmICw":{"text":"This place is waaay overrated! Waste of time. There is soo many awesome options for breakf","useful":1,"cool":0},"-Zduwq21Gqikty_Rpo0oMA":{"text":"Crazy long lines on a Saturday morning! Wow! We almost bailed for another place but a work","useful":3,"cool":2},"7fgPWkeFxd1iuCvw1mChEw":{"text":"Beignets AND atmosphere were just not great here. Dirty & noisy. Beignets here were very d","useful":0,"cool":0},"XPDQW5H-HrZn9b1nnxZBfw":{"text":"Legendary for a reason. We just did the classic beignets and cafe au lait. \n\nThe wait is c","useful":0,"cool":0},"YXyO-ks0M9_ccU7D-xay3Q":{"text":"Everyone told me I needed to come here and get the beignets. These little puffs of heaven ","useful":0,"cool":0},"X5CwXCuQayOAjX7JmixkFQ":{"text":"What more can i add that hasn't been said? Amazing beignets in an amazing part of an amazi","useful":0,"cool":0},"YGhxpP1NeCwr6ACGYLabuA":{"text":"If you do nothing else in New Orleans, THIS is the visit you must make. Located in the hea","useful":0,"cool":0},"6FIP8mVYrXPPjoqlRE5pSQ":{"text":"All of the natives recommended coming here! I love that it's open 24/7 because our days we","useful":0,"cool":0},"8p5gjhOTerfm9_8ITzzavQ":{"text":"Best beignets in town! Highly suggest to visit this place when in town. Though the outdoor","useful":0,"cool":0},"FXDDblCa2_9jiPZMpIc-hg":{"text":"Definitely worth waiting in line for. Nothing better than a beignet with cafe au lait for ","useful":0,"cool":0},"KpHgJTXIIxelahRz14FtEQ":{"text":"The must try beignet and coffee mix in New Orleans, and this establishment has been here s","useful":7,"cool":7},"0Lzcnyfr5Kx4SM4T4-v-Ww":{"text":"Great place and service was excellent. We had one order and it was fast. The beignets were","useful":0,"cool":0},"wx7OWYcpZi7y44tLQ5iXqQ":{"text":"This place is a dump. Total tourist trap. The donuts are tasty but I was very underwhelmed","useful":0,"cool":0},"ME_7mUE3Di69IjPCVuYPQg":{"text":"Great cafe & excellent beignets!!! Fast & courteous service. Lovely place. A must when in ","useful":2,"cool":1},"QeFW8wnhToFxkXshp_N7PA":{"text":"Cafe Du Monde was a haven to me after suffering through too many overpriced, pretentious, ","useful":0,"cool":0},"N0Ydb2wFfOm13hmi_C4iUA":{"text":"THE Cafe du Monde.  What a zoo at dusk after the Bayou Classic.  The to-go line was so lon","useful":0,"cool":0},"01P4hU0MU-RAVxybEcIAeg":{"text":"Maybe it was it was a little over-hyped by friends. Good coffee.","useful":0,"cool":0},"nGpPgK97J3S1VACGHRO4Cg":{"text":"The cafe au lait and the beignets are amazing!!!! The line was long but moved very quickly","useful":0,"cool":0},"cL8W6dWkCvssCQXNiO9DcQ":{"text":"Yes, it's all the rage!\n\nThe dine in line takes about 15-20 to go through. Cash only\n\nI ne","useful":0,"cool":0},"oJNU8lpefqCVLk03QsIapg":{"text":"My God.  So good.  If I lived here I would be so overweight with cavities galore. The beig","useful":0,"cool":0},"EWJ6OsD5n8h9UyB6NrVKog":{"text":"So I'm not sure how it's possible that some of the reviews aren't positive, but some of th","useful":0,"cool":0},"0UJFP1-cZ_Rpu-G-s8vDqg":{"text":"Good beignets... but if they want to stay real and true to French the Hot chocolate should","useful":0,"cool":0},"1rV2-D3cVEBISq-_IFgJ6Q":{"text":"Tried their coffee, hot chocolate, and beignets.  It was good overall.  Nothing surprising","useful":0,"cool":0},"dX2IOItaEeJuWO0AXQY6AA":{"text":"A must stop on a trip to New Orleans. A great place to start the day or drop in for a snac","useful":0,"cool":0},"nYojMdY9pHr52KmW0ntaeg":{"text":"The only reason to stop in is based on the history. It has been around since 1860s.  The b","useful":0,"cool":0},"boBHwX3WV8fxdoP6A_-9AA":{"text":"Traveling cross country, had to come to the famous cafe du monde home of the famous beigne","useful":1,"cool":1},"312PcsJ1R9eNFnMl7-durw":{"text":"Came here several times during my stay in NO. The beignets were fresh, hot, delicious and ","useful":0,"cool":0},"X8Wu3wBcHCWiVxKLh2Gb2Q":{"text":"No matter how long the lines are, either for the diner or for the \"to go\" line, it is wort","useful":2,"cool":0},"lACGVN8TCjpg6KPLJI6fWA":{"text":"What can I say? It's Cafe du Monde! The beignets were amazing. The coffee in all it's form","useful":0,"cool":0},"ONtZFM1R6boHzXrZtbO96A":{"text":"It's no secret that this is a very touristy stop in New Orleans. That being said, it's sti","useful":0,"cool":0},"wdHMu6j7ih6cn8WqN2fBVw":{"text":"Cafe Du Monde is a must for those traveling to New Orleans.  Beignets here are a unique pa","useful":1,"cool":0},"QOKZAG1WN-pSylxRGSRznw":{"text":"I'm not a coffee drinker but knew I had to check out this icon on my recent visit to New O","useful":0,"cool":0},"-xBsVHXTKRjhP9xNeCif-Q":{"text":"Coffee is excellent, French doughnuts very tasty and not much sweet. Atmosphere is great a","useful":0,"cool":0},"ltaHzoyHPyEbmV3t5mXArQ":{"text":"If I was judging just based on the food, then it is okay. Coffee is fine. However,  if u a","useful":1,"cool":1},"JV4NC6yJfnoL75W3ikn-fA":{"text":"It's just fun place to come because it's so famous. On my trip we ate there 3 times and ea","useful":0,"cool":0},"Jh_Q9C5HqulLvyOvyOlcYA":{"text":"Cash only, no drama place with great coffee and fresh warm beignet. This place can get bus","useful":0,"cool":0},"43kgQHQ7iBxCBdaFMgU3Gg":{"text":"Okay sweets are not really my thing but coming to NOLA for the first time, I had to try be","useful":0,"cool":0},"Lwh92ZtHvvmXharbG_R5rw":{"text":"This place. Heaven. Only serves coffee and beignets but what more do you need!?! The beign","useful":0,"cool":0},"nk_vJQPMkl6XTIpYztNIGQ":{"text":"I couldn't come to New Orleans and not come to this place! From my uncle, cousins, to ppl ","useful":0,"cool":1},"h8IQda9RnpbWjCDaiVwQiw":{"text":"How can you go wrong, New Orleans, Jazz on the sidewalk. Chicory coffee and Beignets! I ma","useful":1,"cool":0},"hQjMo45EotLipI-IlK6pIQ":{"text":"It should really be 2.5 stars.. \n\nI had heard that I \"had\" to go here when I visited New O","useful":0,"cool":0},"Pyqawrrxn7fmK4Ei9SDehg":{"text":"Always busy and even lines of people waiting to find a seat\n\nI had a black coffee and the ","useful":0,"cool":0},"m3M46cPQEXDHASou37Ow9w":{"text":"Quintessential New Orleans stop. Best enjoyed at night when not as many people are out. Fr","useful":1,"cool":0},"cEnYUTmfDiVDk7KUwv4_uQ":{"text":"I mean, you know, it's pretty good. Beignets aren't too sweet and have nice texture, and a","useful":2,"cool":0},"zYpVPDfZ0gxDNGCF_93Akg":{"text":"Really great coffee is here. I'm not a great fan of pastries. But I can eat these. \n\nIf yo","useful":0,"cool":0},"jn8aHqOq4fqjSk_WM2q0lg":{"text":"Perfect coffee place with good music, open seating . Good place if you are a sweet toothI","useful":0,"cool":0},"PCgdNFo3pktyldPSUuhtLA":{"text":"I've heard tons about Cafe Du Monde; it's supposed to be a must stop whenever visiting New","useful":0,"cool":0},"J75yW6rDhddi3w1ISnsUGQ":{"text":"There are literally no words.. best beignets, little pillows of deliciousness. FAST servic","useful":0,"cool":0},"4AqE6e0X0BHB8QTkYwUfjA":{"text":"日本発の飛行機内でたまたま「Chef」という映画を観た。\n　このカフェで熱々のベニエ（まあ揚げドーナツみたいなもんだ）を買って歩きながら親子が食べる。粉砂糖が指に付いたら舐めながら","useful":2,"cool":1},"AS0VqrL0w_XrQljihh9ryw":{"text":"Never eating beignets anywhere else again. AMAZING! Definitely worth a stop by. Cafe au la","useful":0,"cool":0},"p0gR5xecbO1DFV5QwkuPGg":{"text":"If you've never been to Cafe Du Monde you have to go here at least once for the history an","useful":0,"cool":0},"xiagM5M1G0a1erQFNtOSow":{"text":"This is definitely the place to go for beignets and coffee! There is usually always a line","useful":1,"cool":1},"GAfu1naAvYux_ppw3GiDRQ":{"text":"Yummy in my tummy!!!!!! Definitely a must! I thought I would be able to finish my beignets","useful":0,"cool":0},"EHWBk2mXEqlA5ZoXIp1Ntg":{"text":"Beignets for Days!!! Visiting NOLA and you know this is the first stop we have to make.  I","useful":0,"cool":0},"iPI33phzoIX8-9qmI-TklQ":{"text":"This is a must do when in New Orleans. The coffee is delic and the beignets are a must hav","useful":0,"cool":0},"1tXU5PWeyiapyjQjBn9uLw":{"text":"I recently shot with a photographer from Texas who wanted to capture the \"essence\" of New ","useful":5,"cool":3},"PIUHNxCRyYb3g_lKaw6Prg":{"text":"This is THE place to get a great the coffee and order of beignets in NOLA.  This was my th","useful":0,"cool":1},"LzWVPW_anmqheoJyFH38Ow":{"text":"I want to take this cafe home to CT and go there every day. I went earlier today and it wa","useful":0,"cool":0},"EU29nH3xgy0DwrIDk9WOFw":{"text":"What is it about Cafe Beignet that people prefer over CDM?  I don't understand. Cafe du Mo","useful":0,"cool":0},"NJegpflJ9m8Vajh624UZBw":{"text":"Well it is a NOLA institution. So you have to go and try it because everyone will want to ","useful":0,"cool":0},"0Hkm9MrE6ruBAK-spohW2Q":{"text":"Good beignets- cool atmosphere. Not too much else to say. The lines are ridiculously long ","useful":0,"cool":0},"-LYGvCYosYgxTksQZaX4qA":{"text":"So you've had the delicious beignets across the street and now you want to get some batter","useful":4,"cool":2},"n71BsJFzfJCn4UdOgsjvEw":{"text":"Being that this was my first time in NOLA it was a must that I tried the beignets and blen","useful":3,"cool":0},"NNjkBeXMVgCj2EvKQFBjFw":{"text":"Tip. Come here after 8 pm and you wont have to fight the ridiculous lines and fighting ove","useful":0,"cool":0},"smMJlMwwMyz9_NdL48MQ-w":{"text":"Got here around 1am and there were still decent number of ppl. Table seating is sort of li","useful":0,"cool":0},"rwJvn7p0g0SLJerYt5mYJA":{"text":"Yes it's a a place all of us tourist go to, but it's worth the 20min to stop and enjoy.  C","useful":0,"cool":0},"QLGJhcXwiDsTZ48nKnil-Q":{"text":"Our first stop of our day and our last stop of the day during our WHOLE vacation. Can't ge","useful":1,"cool":1},"KnJUXSuw5XPNXi3_iqRjzA":{"text":"I read the reviews prior to coming, and that likely led to my excellent experience. The pl","useful":0,"cool":0},"BeHYRc57hLsHtQRaq0wknw":{"text":"I love this place because it's delicious and simple. The lines can be long sometimes, but ","useful":0,"cool":0},"PLtwCqFiw3gEUdQGoRJYIQ":{"text":"New Orleans Staple, togo line may be long but the wait isn't. Know what you want before ge","useful":0,"cool":0},"oZ9Thh43Iqp-SvLswhYVIw":{"text":"Insanely long Disney Land style lines. But don't worry, they move really fast. \n\nThis plac","useful":0,"cool":0},"Vut11RcHLdeaPZQaAgzINQ":{"text":"Had very high hopes for Café Du Monde and it didn't deliver. Very overrated. Beignets at G","useful":0,"cool":0},"Ole7W1HFckXLRgBpU3xizg":{"text":"We couldn't get any service.  It was busy, but there were plenty of open tables.  We sat a","useful":0,"cool":0},"DmGoehoStfqOEV9GMJ1fFw":{"text":"Yep. As advertised. Great coffee and beignets. Get there early.","useful":0,"cool":0},"S_YvcptK4n6r08tJFCAJ-Q":{"text":"I have to be honest and I might make some enemies but this place was really bad.  First it","useful":0,"cool":0},"p2s6FV5fmXw7-0xdt1qlkw":{"text":"Awful experience, the place is a mess. No one is welcoming you at the entrance, you appare","useful":1,"cool":0},"0P4ZY4Og4PEEf4aAbiXaxg":{"text":"Insanely long Disney Land style lines. But don't worry, they move really fast. \n\nThis plac","useful":0,"cool":0},"0iRoPCCaFrmEd1udvZ2pDg":{"text":"I loved the coffee and the Beignets, but the service was horrible, we wanted to get more a","useful":1,"cool":0},"qsF0WVfHLWvHW4jv7aaaHg":{"text":"This place is a New Orleans icon, tourists come here because it's been told that this plac","useful":3,"cool":0},"bKhS1nqxWj1_aLTQaN3LiA":{"text":"Finishing up my review from a tip: Excellent, can't really complain much, I mean, yes the ","useful":0,"cool":0},"sRj20L3IU4DUHkAszys9Yg":{"text":"do not wear black to this cafe - powdered sugar will coat you like the sugar plum fairy\n\ne","useful":2,"cool":0},"_mX1m2GSC_6CpQVHkxzlTA":{"text":"Worth the hype! We walked up and easily got a table around 7pm- highly recommend for desse","useful":0,"cool":0},"BI28aRp70fYwRfYSjwDkfA":{"text":"One of the places \"you gotta go to\",  The service was fast and efficient.  You pay when th","useful":1,"cool":1},"aKooqJrZKtj5nLYdDVOU_A":{"text":"Seriously? What is all the ruckus about? It's funnel cake. It just isn't that good and it ","useful":0,"cool":0},"-JYY3WJ7-Pscv1ivH_PHaw":{"text":"A New Orleans classic! You can't come to Nola without stopping here. The price is exceptio","useful":0,"cool":0},"kuuKHUTD9S6VtQGx9m3Knw":{"text":"OMGosh!! So good. The wait was short, the service was great. Very personable staff who rem","useful":0,"cool":0},"8my4goQQFrYMI9odCQppDA":{"text":"This is the place to drop in for beignets; a must see place to sit and drink in some atmos","useful":1,"cool":0},"dZ98o_dBUfJayzdfFdEQ6A":{"text":"Cafe du Monde is a New Orleans institution.  A spot on your list to check off on every vis","useful":0,"cool":0},"HOB_xqNBstsyALJHaKs8pA":{"text":"I mean what else can be said about this place?! The beignets were absolutely delicious and","useful":0,"cool":0},"AAoPRKk_pZMuM9_mxQYRsg":{"text":"The beignets and service here was great. Staff was hospital. It did seem a bit unusual tha","useful":0,"cool":0},"1DvChWfRdaDcSyULBHo3PQ":{"text":"We didn't have time to sit and eat so we took our orders to go thru their window (CASH ONL","useful":1,"cool":1},"ch47PXSG-XWtuLIU0HDLRQ":{"text":"You can't go to NOLA without going to Cafe Du Monde or so we thought. If you're going to g","useful":0,"cool":0},"_Y2QEjtwxm1DcYvjTgYXxw":{"text":"Always love this place. What can be bad about cafe au lait and beignets! There was no wait","useful":0,"cool":0},"GMx4_CWoEE1vbNbWGNKr7g":{"text":"I know this is, the where to go places, when you're visiting New Orleans but I did not enj","useful":0,"cool":0},"Vbd36CaqZqav93UZwKCocg":{"text":"Cool and raining today. Walked in and got a table...the place is full! Ordered an iced dec","useful":0,"cool":0},"X0XDNVCiWhsk540pHlQPnw":{"text":"Pretty tasty. It's a very trendy place to be so it's crowded and not the cleanest. But tho","useful":0,"cool":0},"8-qd5zTd6KQXqOM7qickfA":{"text":"I love this place, my waiter Raynell was awesome tonight!!! Beignets are always fantastic ","useful":0,"cool":0},"_aTph9JAeesJ9JcQAc4kBQ":{"text":"Café du Monde was a wonderful experience. The beignets were fresh, hot and delicious! Defi","useful":0,"cool":0},"rsssV-y6T5KdqNDaqGY-xw":{"text":"We got beignets to go one night, they weren't bad reheated the next morning for breakfast.","useful":0,"cool":0},"dfy0tBTI3m7UJ9nOV-cA9Q":{"text":"SUPER busy everytime we walked by, but there's a reason!  The beignets here were the best ","useful":0,"cool":0},"EJytol4RaFmSfZEkOiJRHg":{"text":"This place is always packed and full of icing sugar everywhere!\n\nThis is a must to go in N","useful":0,"cool":0},"X6SbIP1quPpzkPsP_bZvQA":{"text":"Great cafe au lait and excellent beignets. Not the best of either, but both are still very","useful":0,"cool":0},"8SV8m-HSuuZxim5AZs-mtw":{"text":"I was told beignets are a must have when in Nola and to get them here. They were delicious","useful":0,"cool":0},"NEKfEvLCsURDe5fcEeAGdQ":{"text":"A must for beignets. Good for people watching. Mornings or early mornings are the best.","useful":0,"cool":0},"UlnHQC9KkyVVdml2Nk83Gw":{"text":"I love fried stuff. I love sugar. I love coffee. Yum!! Although nothing out of this world,","useful":0,"cool":0},"fs3r-yyFT4YXlqiB0hk5gA":{"text":"The beignet and the hot chocolate is very good, no complaint about the service, only if yo","useful":0,"cool":0},"1acW0BX-yH41sNMLzxfLSQ":{"text":"The only thing that knocks off a star, for me, is that the crowds are crazy. Line moves qu","useful":0,"cool":0},"LfG-o1pB5s_QFSCK7wvZKQ":{"text":"Is there a food better than the doughnut? Of course, a doughnut with powdered sugar on it.","useful":0,"cool":0},"3mIzZZ-e9c9mj00qil0NQA":{"text":"This place is a must. A tourist trap for sure, but a must. My dad and I went on a weekday ","useful":0,"cool":0},"szwBedXLKHOdAzLgGKkczQ":{"text":"A tourists bucket list item. Hot, deep fried, sugary slice of heaven, but not necessarily ","useful":0,"cool":0},"V8gifdJUogwTqxPXPbNDvg":{"text":"It's not all hype, the beignets are actually so yummy and priced just right. The service w","useful":0,"cool":0},"_cw_9dHJ5OPRWeVsTqRlNQ":{"text":"The wait in the morning is insane as I'm sure all the other reviews said so we decided not","useful":0,"cool":0},"eVPf4vaPVh-W9uK0wnghjA":{"text":"Beignets!!","useful":0,"cool":0},"ZgZ-EXnbVR9Dq1oQy_zAvw":{"text":"Loved the beignets and coffee! Came twice in 1 day! Can't wait to go another 10 times befo","useful":2,"cool":0},"lz6l5K9iiwc0J_quE5qsRQ":{"text":"Oh My! We visited here 3x while on vacation in New Orleans, we would have went everyday if","useful":0,"cool":0},"UpI0riyw-IKmfWh-idc7Zg":{"text":"Yes, it is touristy, but I still love their beignets, and I still tell everyone who visits","useful":0,"cool":0},"JkSt0rlJYw-03utJSaao6g":{"text":"Oh Cafe Du Monde... How we love you so... We had breakfast here every morning on our trip ","useful":0,"cool":1},"KpPlWHaFiIq1kmXAyupKyg":{"text":"This place is so awesome. The beignets were hot, coffee went well with the beignets, and w","useful":0,"cool":0},"KjeaNftpwcfllbt_a8KW_Q":{"text":"I don't get the hype here.  So overrated.  Think State Fair funnel cake, only thicker, hea","useful":1,"cool":0},"ZsBBH4QEaIybBfhaOzu80w":{"text":"Good but better for the nostalgic aspect. We went for a late night snack, the lines were s","useful":0,"cool":0},"de6p83DUWBpFpctkGU7ZPA":{"text":"The beignets are indeed tasty, fried to the perfect point. Long but fast line. Crowded env","useful":0,"cool":0},"lqa1R0HorBy0nU6dNONmAQ":{"text":"This place is historic and tasty when people say come here listen to them it's not just hy","useful":0,"cool":2},"-6fjhY2agqfh89RdfQuOSA":{"text":"good coffee and grear beignets.  definitely a must  in new orleans","useful":0,"cool":0},"XHTytgrcKJFcP975TdOcmA":{"text":"Cafe du Monde gets a lot of hype and attention, and for good reason. With that hype comes ","useful":0,"cool":0},"6bS3lkNHe7DxOb7jIuIdzw":{"text":"good location for tourists, i prefer the beignets there rather than in a bag to go for som","useful":0,"cool":0},"6mh8xZRAZfi4HZQ73yyWMw":{"text":"Good.  Not great.  Maybe I had my expectations set too high.  Maybe it was standing in tha","useful":0,"cool":0},"Vko2h1Z8A0tz8tMB6t9ywA":{"text":"A must-visit even if you forever tattoo yourself with a giant \"T\" for tourist on your head","useful":1,"cool":1},"Oi7Xx3dPg_Ftctqj2Mm4Pw":{"text":"I've been coming to Cafe du Monde as long as I can remember, maybe for the last 20 years o","useful":0,"cool":0},"k-U6zQFIek9sNJy28wGD4A":{"text":"Absolutely delicious beignets, classic and sugar exploding. The coffee is ridiculously goo","useful":0,"cool":0},"w3G3gcH_Bs6-MX2Mkj5vxg":{"text":"The original beignets and Coffee.  Real New Orleans Coffee (with Chicory, of course)  Most","useful":0,"cool":0},"kpo2FEUCVeXUs1UnCcSsVQ":{"text":"Well standard deliciousness from Cafe du Monde. Busy busy for a Thursday night. Friend had","useful":1,"cool":1},"BbP0bEDGCuMI-82WjdqmYQ":{"text":"Every visit to New Orleans is not complete without a trip to Cafe du Monde for cafe au lai","useful":1,"cool":0},"PYqDMMKNb8JvuteL2grK8g":{"text":"讲真，味道冇评论甘正咯......好似油条加糖。\n夜晚排队冇咁多人...咖啡都一般般咯，大家可以打个卡就走～","useful":0,"cool":0},"XyL5AXLS384SZDGiz8uFRw":{"text":"I came here because every tourist hits this place up. The line looked super long but it wa","useful":0,"cool":0},"vWMa-iqQkI6m6f5hEqVLHQ":{"text":"Place is always packed! Beignets were very tasty and inexpensive. Someone took our order a","useful":0,"cool":0},"0l95cwPdO8fjJJJz6-XQeg":{"text":"Definitely the original, a must visit for ones first time in New Orleans. The cafe au lait","useful":0,"cool":0},"CJhJzBkIFwsgm-Sfi_aiSg":{"text":"The beignets were ok.... I think it was more hype than anything.  However, the coffee is a","useful":1,"cool":0},"gdaTrm0NBS3iwdy48Cmy6A":{"text":"It's one of the most famous cafes there are, and definitely a New Orleans staple, but it d","useful":2,"cool":1},"1lXVXMuyPo27KoLLTJK-Yg":{"text":"I expected Much More! Maybe its because we went to the to-go line. Meh. Even if we sat dow","useful":1,"cool":1},"KHNgpdD9nRQaCLhyHjb3ew":{"text":"I don't know which experience was worse, waiting at the take out window for 10 minutes for","useful":0,"cool":0},"kHdn_z_En3tt0x8P0qWikw":{"text":"It is easy they Ave 1 food item. 3 to an order. Dip it in the hot chocolate, that's 1 one ","useful":0,"cool":0},"8KlpMRYtg8R3e73Qtmrsuw":{"text":"Delicious beignets. By far, the best. The cafe au lait is a great compliment to the beigne","useful":0,"cool":0},"SIoc8512KuKG_03ddnMXcQ":{"text":"Go late at night when you need a dessert. The service is show but everyone who helped us w","useful":0,"cool":0},"59xZTAAi4TIOH5gA0q0H7Q":{"text":"White asses...As far as the eye can see. \n\nGood beignets and good coffee and great people ","useful":3,"cool":2},"X_2iNcZXg8s1Ohr92ytL5g":{"text":"Very touristy and crowded.  The service is fast and you get exactly what you'd think, beig","useful":0,"cool":0},"mhITslJnmkhIC19c9i2tcg":{"text":"Cafe Du Monde is at the heart of New Orleans, probably the most iconic location in terms o","useful":8,"cool":6},"fBvUqEUiwhlO9lkatcMq0Q":{"text":"Overrated. The beignets are good. It's fun to go someplace that is so famous. But other th","useful":0,"cool":0},"9xI52jDD1q-wbQ97VV7ReQ":{"text":"Beignets were amazing as to be expected, had a frozen blended coffee which was superb! You","useful":0,"cool":0},"MqgVYWN_geFw95-pOrEzDw":{"text":"Such a tourist spot the café is always full and I see why the coffee was  so good the beig","useful":0,"cool":0},"cx2jLvxemFTmi03BUU9z2Q":{"text":"This of course is one of the must stop places in NOLA. Depending on the time of day they m","useful":0,"cool":0},"YNrGdcilb8nxAWi1aPjGyA":{"text":"The beignets are tasty (not as good as Cafe Beignet) but the people are not friendly at al","useful":0,"cool":0},"XTDZe6sy2c17nbnCJ5-sOA":{"text":"This is the only place I think of when I want a beignet. The cafe au lait is a must here a","useful":0,"cool":0},"3NiNKTjtetN8QSVKcGuAnw":{"text":"This is a must-have when in New Orleans! I went in the morning and it was already crowded,","useful":0,"cool":0},"-ZPs0c8cazh9xNZQksnR8Q":{"text":"You have a choice of 24 hours in a day to stop by for a hot cup of New Orleans style Cafe ","useful":1,"cool":0},"Xh6kGp7oFERhnDdqApg3eg":{"text":"Beignets and coffee au lait. Had this everyday that I was in NOLA. Its a great little spot","useful":1,"cool":1},"bcPnY3cNABuaYuDuYRiVVQ":{"text":"As touristy as this place is, it's still worth a trip. I prefer this location over others ","useful":3,"cool":0},"B7koUxqICRn5AfaUosAH-A":{"text":"I've wanted to come here for years. Finally made it and was disappointed.  The waiter took","useful":0,"cool":0},"hw1fnBF95tDj_D8xRkxFew":{"text":"I love N.O. and I think that they have the best food in the world. I have visited N.O. a f","useful":0,"cool":0},"bsZYv7yqxE7RJcHIyBq4zA":{"text":"\"Go to Café Du Monde!\" \"Go to Café Du Monde\" Said all our friends. We sure did, and I'm go","useful":0,"cool":0},"fLp3bdNTh8B1_J1NTsv47g":{"text":"Great tourist trap for getting fried bread and coffee.( Pro tip: wait in the back \"to go\" ","useful":0,"cool":0},"ezO1FNjF0-75SOwZxb2dSg":{"text":"This wasn't anything what I expected. It was super huge and doughy. The dough wasn't very ","useful":0,"cool":0},"fB3MLqDH2vewJk6CyYZR9Q":{"text":"Amazing beignets! We ate in one day and had zero wait! Must get cafe at lait even if just ","useful":0,"cool":0},"_IxMTEHNIvlKdsRzNouxTw":{"text":"I came here for the cafe au lait and beignets. It's a classic New Orleans experience that ","useful":0,"cool":0},"O_9RQsQFatzAGc2nTLyNOg":{"text":"Way too busy and hot but this classic is always worth a stop, delicious as always!  Tip: i","useful":0,"cool":0},"BPe0W9Jr6c9eRYc1eRa32Q":{"text":"Perfect Beignets and cafe au lait coffee! Everyone should stop by here when in the New Orl","useful":0,"cool":0},"AEgmEy1fpzG5Z0a_50TWwA":{"text":"Its Cafe Du Monde. Its a must have when you are in New Orleans. Lines were crazy, but I ex","useful":0,"cool":0},"qd_Bi5jDNmOqd8SKI5YGBw":{"text":"What can I say, tremendous beignets and solid cafe au lait. Service is wtf inducing, as yo","useful":0,"cool":0},"05t918cDznZ3Tt-oGkTSlg":{"text":"Personally I prefer Morning Call, but there is a magic that exists at this Cafe Du Monde. ","useful":0,"cool":0},"nDGwpziKtOCX8Ke8pBy7wA":{"text":"Wow! The beignets coffee, people watching and street jazz are the best anywhere.  Don't le","useful":0,"cool":0},"5_xLka0hsRrJLP6Qo8JEKA":{"text":"A place that lives up to the hype. Very tasty and I could have eaten another order. My old","useful":0,"cool":0},"qIk_59oAwY8KNYCuGBVcBg":{"text":"After having dinner, my parents and I walked down the street to try Cafe Du Monde's famous","useful":0,"cool":0},"jEwFEzt7eewOacSi7n8TFA":{"text":"I hate when there are multiple pages for the same location.  \n\nDoes every Cracker Barrel h","useful":0,"cool":0},"jR_E3ccDxIPZIQJaa_M3WA":{"text":"We thought we had have beignet before. Please don't be fooled as we were. The beignet is w","useful":0,"cool":0},"ZHymqn5O7vuk1Nx5ZW1yGA":{"text":"No choice, but to go for the beignets. Coffee is just OK. Get a table by the street to wat","useful":0,"cool":0},"BjjAIoBveMYW8Frn00X7fQ":{"text":"Must go and taste! Fresh beignets and the frozen coffee is a must have. Expect to get some","useful":0,"cool":0},"bz1VLp71HPJDcEqbkD8GqA":{"text":"Beignets were light and crispy with plenty of icing sugar on top. I definitely enjoyed the","useful":0,"cool":0},"bd30ezbuBfvVfA2toyA3ew":{"text":"Of course delicious spot.  First time for beignets for my husband and he loved it.  Unfort","useful":1,"cool":0},"GMSRizsPvDKR9eph6bgFmg":{"text":"The World Famous Cafe Du Monde! The beignets were good, but messy with the powdered sugar.","useful":0,"cool":0},"eh4I6SZKd2OpjveGmhhKyQ":{"text":"Iconic\nEverything was awesome,\nget ur coffee and beigne there is like having to visit NYC ","useful":0,"cool":0},"nBvEbxrzo_rTbpOfirXxhQ":{"text":"Beignets are great but they only take cash, interesting considering the amount of tourist.","useful":0,"cool":0},"8YsZly4Q9SRtu8tABQjqyg":{"text":"Crowded. Had to sit at a table covered in mess. Got up and left - had beignets down the st","useful":0,"cool":0},"MtSWjDhaJnVsZEKRQdV1sQ":{"text":"Touristy yes but a must visit for each trip to New Orleans. The lines can be long and inti","useful":1,"cool":0},"rlyaARE8ktX39QX7e0QGYg":{"text":"I'm just going to repeat what everyone else said...order beignets...bring cash...repeat da","useful":0,"cool":0},"htMuQI9lU99JKO60Jfswlw":{"text":"What's to say that hasn't already been said?\n\nYou go to New Orleans, you make the pilgrima","useful":1,"cool":1},"XTuVYk19qJBhsZqdiOe8Iw":{"text":"Cafe Dumode for fresh Beignets! Happy tummy anytime of day. A very enjoyable atmosphere. H","useful":0,"cool":0},"gkCwjHprAqZqB93drRyZZQ":{"text":"- Waaaay, way, over-rated. Only gets the majority of their business because this is a \"mus","useful":2,"cool":0},"IbaaMTq1raYzrHW53lgqqg":{"text":"So, how can you visit New Orleans and not stop at Café Du Monde for some Beignets?  - I do","useful":3,"cool":3},"9vkjvCht_6ttNKONtdXfrA":{"text":"I love Cafe du Monde, always have.  But I have never gotten their frozen cafe au lait, alw","useful":1,"cool":0},"sQeBw6UMsKhaw5Bj5q1jxg":{"text":"The workers there have terrible customer service .\n\nNo one came to my table to take my ord","useful":0,"cool":0},"JsI2t_yfMWe_yo23jUfFhg":{"text":"Hyped up. I was traveling cross country and decided to stop in New Orleans. I was told tha","useful":0,"cool":0},"bUATUHhcu6cCDw9s27lsoA":{"text":"Because you've just gotta, right?\n\nAfter doing quite a bit of walking and otherwise being ","useful":0,"cool":0},"ASkFFfABRjHP0gA36-cnjA":{"text":"There are some touristy\" places that are overrated and then there's cafe du monde. To come","useful":0,"cool":0},"6RtsvbHy7dTjxlI1O3kZlA":{"text":"The  best beignets ever. They are definitely worth the wait in line. We waited about 20 mi","useful":0,"cool":0},"JkbZ6BeI7_3G3G0Fe5TlfA":{"text":"A cannot miss in New Orleans.  It's a classic!  Don't leave town before having a beignet a","useful":0,"cool":0},"ycpvd9a_3UT7Q7Ztiatdjg":{"text":"Excellent, but overrated.  The beignet and ice coffee were excellent.  The servers were ru","useful":0,"cool":0},"r8L6b_3SZTwerHqAwt5Hyg":{"text":"Classic café, open 24/7. Cleanup could be better but hey your in Nawlins. Your lucky if yo","useful":0,"cool":0},"6JmR8mmVzbNhG6gmo8cfwA":{"text":"I HEART BEIGNETS!   i heart powered sugar!  I heart Cafe Du Monde.\n\nA must visit if you're","useful":1,"cool":0},"yVbuAXyC3FHDiFUuahxNeQ":{"text":"This is a must in NOLA. I went on a Monday and there were plenty of available tables. I wa","useful":0,"cool":0},"QWO9PCrLFzZasKFK1wXhqg":{"text":"I am a local and miss this place so bad when I'm not home. The coffee is great. I'm a fan ","useful":1,"cool":0},"FON-AYE2kKHuwRyq7Tnp-g":{"text":"I went here when it first opened at 8:30 to avoid the line and was able to find a seat imm","useful":0,"cool":0},"6pzEcgQVC8cUR9VKKOiFpQ":{"text":"My waistline expands just a little bit everytime I travel to New Orleans (as referenced by","useful":0,"cool":0},"uSmG2qlCcBncUbPSGQLqjg":{"text":"Meh.   Beignets we're awesome.  Coffee was good.  Our server was good, but the server at t","useful":0,"cool":0},"1s9KxcdKJfnmCCerFnx4Bw":{"text":"january  sunny  70°s   iced chicory coffee . . . noo aw-lee-nee-ans are one lucky bunch.","useful":0,"cool":2},"GLt8t2cWfi-ueBT7GdxdfA":{"text":"Overrated.  Not worth the wait.  The beignet was flat like an unplugged sopapilla and over","useful":0,"cool":0},"IMRAeJltlmaaJajU9WOPwA":{"text":"The specialty here are beignets. Seriously if you're looking for dinner or some other food","useful":0,"cool":0},"rJNaLXwsbiD6HBuAEjasKQ":{"text":"A NOLA institution that's worth checking out while you're there - even if just to say you ","useful":0,"cool":0},"s4thlvk0YOCklG0GvujlLA":{"text":"This place is amazing the best benya's ever this place is truly an experience everyone sho","useful":0,"cool":0},"C2pmKSqnUbaRy5hBIO93Ug":{"text":"This place is heaven on earth!! The beignets are the best in New Orleans!! The Cafe' Au La","useful":0,"cool":0},"lPWv8vUesK7xpHHT41pQEg":{"text":"This is a great stop for a quick snack, or touristy place in New Orleans. It's CROWDED, al","useful":0,"cool":0},"pl1Z5q4Ib6Ve3gokf_2wjQ":{"text":"My buddy told me we gotta go there and get the beignets. Enjoyed a nice cup of coffee and ","useful":0,"cool":0},"jLqF-DOobaZx5Zf_QhtxkA":{"text":"I did log  the beignets and the locations and the quick service ! Great place in a tourist","useful":0,"cool":0},"--DEFqMiOk5uraWgbZwPkA":{"text":"beignets, beignets, beignets, beignets, beignets, beignets, beignets, beignets, beignets, ","useful":0,"cool":0},"t7oFjvR7uQQmCAVDp1-Ikg":{"text":"The outdoor cafe atmosphere was charming at the French Market location.  The beignets and ","useful":0,"cool":0},"tp5lf6St08DoHBUqpHV7bQ":{"text":"Of course on my first NOLA trip I couldn't not go to Cafe Du Monde. I was honestly expecti","useful":0,"cool":0},"YuuKL2vVD0T0W2r-7zH8iA":{"text":"There is a reason why this is a must-do in New Orleans. The beignets are amazing. Don't be","useful":0,"cool":1},"Dg3VYzkYnkuBRwQplT9SWg":{"text":"We stopped in after walking from our hotel super busy with a long line but it was moving f","useful":0,"cool":0},"mY_evIKJEBdnyqvs1YIfLg":{"text":"It is a mechanical reaction of my body to blow on hot food. Being distracted, I blew on a ","useful":0,"cool":0},"tutMiSztaUeNuGNxNKg83g":{"text":"An absolute must. Do not miss out on it. Order take home\nMug to have a souvenir for barely","useful":0,"cool":0},"42wx55LXeEEDUrEK8xsu2g":{"text":"After driving 1:30 hrs and paying $10 for parking near the river(0-2 hours). I found this ","useful":0,"cool":0},"WvGH-Evi0DeuOg1EknzElw":{"text":"What can you say? This place is an institution. Of course it was our first stop on our fir","useful":0,"cool":0},"UbXqgfmcFdmgiO-QF0bkhw":{"text":"I thought these beignets were okay.  I would have prefered them to be a little fluffier/li","useful":0,"cool":0},"ONgfioLrVgOTzEXx-7rf_w":{"text":"We actually prefer the beignets at Cafe Beignet better. We had theirs earlier in the day- ","useful":1,"cool":0},"C2uzIoPvuIK5vyobX3xb7A":{"text":"This is a New Orleans staple. A must see spot. You take a seat and a server will take your","useful":0,"cool":0},"gQK8Glfa9Y5pK1EBRhpayw":{"text":"Excellent treats for early morning or late at night. Wait can be off-putting (a block or m","useful":0,"cool":0},"JkNFR8QISz4IjnpNvU82kA":{"text":"I know this 3 star rating is surprising since Cafe Du Monde is literally a NOLA must-go-to","useful":0,"cool":0},"h_Ojh8focvwuxPpq5MFkkA":{"text":"Regarding food, the beignets and coffee were great.\n\nRegarding service, in a word, it suck","useful":1,"cool":0},"tgCE9l1lZNSynF0ZYFt4Ng":{"text":"I love the beignets. They are warm with tons of sugar on it.  Don't waste your time in lin","useful":0,"cool":0},"B1SaOYjSypwThzEDE-qfwA":{"text":"Amazing! The beignets are awesome. There is essentially no wait for the food, regardless o","useful":0,"cool":0},"IDH0QTC-Vf3pu306mvhzoA":{"text":"Tourist trap, but a must have in New Orleans. Not an ideal breakfast or hangover spot, but","useful":0,"cool":0},"O4N_aGZO2uDONdUTaDolsg":{"text":"While my visit in New Orleans. I fell in love with this place.  The place is excellent.  T","useful":0,"cool":0},"YLbytPcidF85z5DDzKyIfQ":{"text":"The service is atrocious. Sitting at a table for 25min now..dirty dishes from previous cus","useful":0,"cool":0},"Vh_gyFGQPN0ISpjAXHZC0Q":{"text":"After so much hype and a 30 minute wait in line we tried the beignets & coffee. The verdic","useful":0,"cool":0},"dz5oXJtakp_eMsxM58O52A":{"text":"All I can say is BELIEVE the hype! Delicious. I think we came here almost every day for be","useful":2,"cool":2},"lR3oGQY4eFNF0m-dj7S2IQ":{"text":"The beignets are good but the coffee is even better!!! Very busy place & they accept cash ","useful":0,"cool":0},"JwjjWIW_l4XLMAGBMA4Cgw":{"text":"Delicious beignets with a ton of powder sugar! The beignets were doughy and fluffy on the ","useful":0,"cool":0},"YVi6WB4vW93nSCgTJEIBtw":{"text":"First stop in NOLA was Café Du Monde. The beignets were wonderful and hot. Sat at a table ","useful":0,"cool":0},"rZcWF8NbxdNZm1adax5BQA":{"text":"It's impossible to leave New Orleans without a stop at Cafe Du Monde! The beignets and ice","useful":1,"cool":0},"J1drcTDct8DIuOvkVDYOxQ":{"text":"Despite the line, it's definitely worth the wait. The beignets are awesome.","useful":0,"cool":0},"4-KaZNam5OmoLlDO5Jd5Sg":{"text":"Tourist trap to the max. Only go if you want to say you've been, otherwise skip these frie","useful":1,"cool":0},"4R2VBR8rohpbeW84dhod1w":{"text":"It's an institution.  Crowded, noisy, and hectic.  Not at all what I'm looking for in a co","useful":2,"cool":0},"9ajeZKWNsERKcxeuaqi0oQ":{"text":"PROS: 24 hours. Busy at all hours. Friendly fast wait staff. There's a cool inside space, ","useful":1,"cool":0},"VJHhlCLz5wxVTiti6zt9EQ":{"text":"Average donuts\nBad coffee and hot chocolate \nIt's doesn't  deserve very long long line!","useful":0,"cool":0},"GzNlEsOZpVByLsTXfJ_DtQ":{"text":"All they do are coffee  and beniets and they do them very well . Prices are cheap and the ","useful":1,"cool":0},"of1NtskSzAIRipiuJPjzpw":{"text":"We only ordered beignets and coffee.  Coffee was terrible and beignets were overrated.  Th","useful":0,"cool":0},"0N0N7fbxCiKjA6OmY1H3RA":{"text":"A must for anyone visiting New Orleans.    Walk in, find a table and order some beignets a","useful":0,"cool":0},"6_0GuNa7rmgR--IjmBcXaw":{"text":"Fresh, fluffy beignets -- crisp on the outside and soft on the inside -- covered with bill","useful":0,"cool":0},"mu5KN6GRYz9v3v1s6boslw":{"text":"Great beignets and a must have!  Super packed, but worth the long wait. All tables were ta","useful":1,"cool":0},"cRG-kCBJzPCnHMtlf5rKqQ":{"text":"Going to Cafe Du Monde is something everyone will tell you to do while in NOLA. It was a c","useful":1,"cool":0},"lIjh6jYk6HDZ-Uso2faLyg":{"text":"If you are visiting New Orleans you have to go to the cafe du monde to eat beignets ... th","useful":0,"cool":0},"F5JFBQozTISof1ETZGC_Kg":{"text":"I went here two times for my stay in New Orleans with my family, and I really don't see wh","useful":0,"cool":0},"5P9eiqAaXf9BT4jWAKKaPg":{"text":"If you don't come here than you didn't experience NOLA. Best time to go is before 10am and","useful":1,"cool":1},"qDVhvVmkCJc38tuOluGqQw":{"text":"This spot is official!   I had my first beignet in this place and washed it down with choc","useful":0,"cool":0},"9g5ef0pLVzTD-dakErB7AA":{"text":"The Beignets are AMAZING!!!\n\nHit or miss on how well the servers understand english.\n\nAlwa","useful":0,"cool":0},"lM8XFKB-0Og4Bmwbq2WANw":{"text":"Waited until the line died down later in the evening since it was too long.\n\nBlack coffee ","useful":1,"cool":0},"4gWE86posUVyKId3kJoxfw":{"text":"One of life's great simple pleasures that everyone - yes EVERYONE-must experience before s","useful":3,"cool":3},"IUlOfrj_b_pRewLdw7DkZw":{"text":"Don't waste your valuable time in here. The place is overvalued. Dirty and overcrowded all","useful":0,"cool":0},"JjqFRHLjqwpyZF0y1RU1Mw":{"text":"This is a \"must have when visiting New Orleans\" so everyone told me. So naturally I had to","useful":0,"cool":0},"6FG7qmPxiHCAOqfqpalkOA":{"text":"This place was truly amazing! Every bit of New Orleans was magical! Cafe Du Monde's coffe ","useful":0,"cool":0},"yvOsVtaB_Ek2WuhyEsXtHA":{"text":"Since I was a little girl I wanted to visit Louisiana. \nLast year my dream came true. Unfo","useful":2,"cool":0},"ca1LcKWvlsj-6lYg95Wn5g":{"text":"I loved sitting here listening to live Jazz that street musicians play while eating... \n\nB","useful":0,"cool":0},"HyE-9ewFbE2wIxLUVRXppQ":{"text":"If I lived closer, I would probably be in trouble from how often I'd want to frequent this","useful":0,"cool":0},"Cyh_lMQKFBpN5YkHJ-6ARA":{"text":"This place is a national treasure in the Big Easy! Best beignets in the city. Do not be fo","useful":0,"cool":0},"678TzNrLUVICJGF3awLSnQ":{"text":"It is cool to come here where all the action is near Jackson Square is and the location ha","useful":0,"cool":0},"VEf6lK0VxIWGOr2Ddc3BIQ":{"text":"Cafe Du Monde is a classic pit stop in New Orleans. For $2.73 you can indulge in fresh out","useful":0,"cool":0},"3B-PrIJ2gpi7Mb-BzvrN1g":{"text":"The Beignets are good and not too expensive for a place that is hyped like this one is. Th","useful":0,"cool":0},"hrCH8846npKij1r25CVT0g":{"text":"I love this place and make it my business to visit on every trip. I don't know why I never","useful":2,"cool":2},"Mt7DQViWGaMo7JGF6OLqeA":{"text":"While normally I don't like doing the touristy thing, well, I had to do this. I needed som","useful":0,"cool":0},"935BzNf770mUzAytFwbiFA":{"text":"Beignets were far heavier than expected, there are better beignets (and smaller lines) to ","useful":0,"cool":0},"GweFqpdMxHCQY6JDd9mrpw":{"text":"Just flat out the best in the city.  I tried several similar places and none came close...","useful":0,"cool":0},"fyav-TXt36sY6i_clssy-w":{"text":"I can't believe I've never been to a place like this before, we need to have a Café Du mon","useful":0,"cool":0},"0A6DlkniCBlwJw-G9VrvdQ":{"text":"This place is amazing for their donuts. And they do not skimp on the powdered sugar!  Amaz","useful":0,"cool":0},"FGKddQIaUjuLcymZFAS5Gw":{"text":"Beignets after drinks! Great stuff. Gave my last one to a homeless man in the park.","useful":0,"cool":0},"EvDjLkS4gX6o3JMxF6s8Pw":{"text":"I've had better beignets in NOLA, but the experience is a must! The French roast coffee is","useful":0,"cool":0},"bRt_TAXWpcTEAt-szeX-hA":{"text":"It's worth the line. And there are 2. One for to-go orders and one to sit down. We opted t","useful":0,"cool":0},"dRWVVEPegm9LzU-tE7fFCw":{"text":"I hear that if you don't make it here while you're in New Orleans then your trip didn't co","useful":0,"cool":0},"BWEnILBIPsUPbpdSTAa97g":{"text":"Despite being consistently mobbed, there are plenty of outdoor tables. Beignets are obviou","useful":0,"cool":0},"PQVTeRYUgceYZpuIMo5yog":{"text":"Limited selection.  Cash only.  Long lines. \n\nBut well worth it all!!  Best beignets anywh","useful":0,"cool":0},"RFIGv58HPl8ra-fgxBuJBw":{"text":"Coffee and beignets ok but certainly not worth the wait.  There is an equal coffee and bei","useful":0,"cool":0},"8uEvli9-XrRWRD5uxw5QBA":{"text":"Very popular cafe shop in the city. Full of people and the menu is actually simple. The Fr","useful":0,"cool":1},"eLSdbh7C-BCfQZIE5QNerQ":{"text":"This is a NOLA must visit. The coffee and beignets met the high expectations we had. Great","useful":0,"cool":0},"KVziB5M2Nmd-psR7_UtXSQ":{"text":"Cafe du Monde is actually the best of the best when you consider food quality. However com","useful":0,"cool":0},"sGRllqDB3SBNya53vLEOXQ":{"text":"I had to come here during my trip to NOLA because of everything I heard about this place o","useful":0,"cool":0},"n9ZytBbdI9T9S5zAEwkKMw":{"text":"A must experience attraction in NOLA.\nYou can't come to New Orleans and not stop by the Ca","useful":0,"cool":0},"4RYT9iLBgkv6rFj1QQ0BNQ":{"text":"I went to New Orleans three months after returning to the U.S. from a summer in Europe. At","useful":0,"cool":0},"yyFaCKttDRVA6kNnbOINow":{"text":"This place lives up to it's hype. The coffee is very good, a decaf au lait at 11pm was per","useful":0,"cool":0},"6fu8B1oFJ8WjQAOdFsk8vQ":{"text":"Very yummy, warm donuts. 3 for $2.42. We were here on a rainy Sunday. Long take-out line, ","useful":1,"cool":0},"oK5a_JiJ1ClfhikJTgHi7Q":{"text":"Eh it's ok. Not sure why such the hype. Waited in line at the side window for 15 minutes. ","useful":0,"cool":0},"2qsrBbBmbdv1Z33xeybSig":{"text":"Definitely lives up to its name. The line moves fast and it is always worth it. I love the","useful":2,"cool":2},"DIPm3jViTIe85vBbA_puzg":{"text":"If you are in NOLA or in Louisiana, you have to go to Cafe du Monde and get get their beig","useful":2,"cool":1},"V_3hRGP_JPSc-UVATyWV8Q":{"text":"One of the most delicious moments I had while visiting NOLA. Sitting at a small cafe table","useful":0,"cool":0},"IILx4jeSPYw-xOq1xfapcg":{"text":"The beignets here definitely live up to the hype. We tried to go last night but it was ent","useful":0,"cool":0},"buTzflY9OIq6xJSQ8olDWA":{"text":"Yes, this is a must do if you're in NOLA. The huge crowd is a little overwhelming. It's se","useful":0,"cool":0},"HNauS0oEKZ1-ZRL73Cqw_Q":{"text":"nothing really too special about this place. it is just a historic business that is often ","useful":0,"cool":0},"8K0H_ZgQ7mWk33kjATIzyg":{"text":"A must go!  Good way to start the day. The New Orleans pastries are a city classic  Outsid","useful":0,"cool":0},"BUmppPgHJwvr_005MM95gw":{"text":"Passable sugar-coated donuts with over-priced, mediocre coffee.\n\nI do not understand the s","useful":1,"cool":0},"DB191G2AkbDXNT9tc6c3hw":{"text":"This was the best beignets I have ever had. The line is long but it is worth the wait. Plu","useful":0,"cool":0},"Z-ZNnVC6OGOnt4yNfsmW3Q":{"text":"Whenever you take a trip to New Orleans you must visit Cafe Du Monde! The beignets are cov","useful":0,"cool":0},"kaEHUElRnIbC4HSkOVuArQ":{"text":"While the beignets were really good the lines and service were not and almost all most all","useful":0,"cool":0},"4EO-tmnOogAS-AHc2mnfzg":{"text":"Simple menu executed perfectly.  Beignets were warm and delicious and the cafe sure lait w","useful":0,"cool":0},"MtS6BguXJleYW1YqS72MkA":{"text":"Over-hyped place.  The lines were so long that we had to try several times to go there.  I","useful":0,"cool":0},"_MdVys07SKz9EF8O0xOr4w":{"text":"We were enjoying the beignets and coffee until we walked past the food prep area...it was ","useful":0,"cool":0},"glQXonv4D3bt0ux8g--S-g":{"text":"Yes, the line can be long. Yes, beignets are unhealthy hunks of fried dough covered with p","useful":0,"cool":0},"9oxNIm7FkhFdk2OB-AE30g":{"text":"I'm giving this place 3 stars when I really want to give it 2....its one of those places t","useful":0,"cool":0},"iFDce3ql74FKZElRuL-OVg":{"text":"Worse service i have ever seen, sitting here for 10 minutes with 4 servers sitting looking","useful":0,"cool":0},"XuNGhEqbz23gXhPV4nj3qw":{"text":"I'm at a dilemma here. Cafe du monde BEIGNETS ARE SOOO GOOD! and then ... there's the serv","useful":3,"cool":0},"XQm-Q7Zyz_HACMR-T7gh6A":{"text":"I had never heard of a French doughnut, but my wife insisted we could only go here and get","useful":0,"cool":0},"0jqNtjPEHiwECRMV-cnVLQ":{"text":"Eating here was so exciting!! It is definitely an affordable must stop and the best part i","useful":0,"cool":0},"3OoCEY0yiKWE-emyXdSYAg":{"text":"Classic, historic beignets. Wear a bib and make sure you order the large coffee or they wi","useful":0,"cool":0},"dciFMJx6zpeSgAcxAP2HgQ":{"text":"I know Cafe Du Monde is seen as a must stop for all travelers to New Orleans but, I want t","useful":0,"cool":0},"WcMTJCiKsS-ttNSKgZgEww":{"text":"What is there to say about Cáfe du monde that hasn't been said? It's just a New Orleans st","useful":1,"cool":1},"CmoZURgkQeepjNFeN6kjwA":{"text":"Second time here today ! What can I say we love this place","useful":0,"cool":0},"4S-aDdSWlQ7RdlbDQaxg2w":{"text":"Beignets are good. \n\nCoffee is meh.\n\nService is meh.\n\nWait time to be seated is meh.\n\nIt's","useful":0,"cool":0},"TGIBYv7M3EaonUANCe6v6A":{"text":"The coffee and donuts are good but WATCH OUT: the TSA will take your coffee if you buy  th","useful":0,"cool":0},"Yip8PVv0AMdbcjRaTco3LA":{"text":"The Beignets are wonderful! The wait to get in is rather obnoxious. Much too popular for i","useful":0,"cool":0},"-A9GokBfsah8RN5A9Ks4xQ":{"text":"Ask anyone who's been to NOLA where you should go and they all will say Cafe Du Monde.  No","useful":3,"cool":3},"NL8KRRDK0nwwO3aLlaA0WQ":{"text":"SO MUCH HYPE = TOURIST TRAP!\n\n\nI have experienced better: Cafe Beignet on Bourbon Street m","useful":0,"cool":0},"SbO0dhRHrwspbw8GEjinPA":{"text":"enough reviews so i'll be quick. nothing is that great here but the location and charm and","useful":0,"cool":0},"2PIZuokUTXKQq_DL9jvOgA":{"text":"Fabulous coffee and the beignets are worth every bite! Powdered sugar is messy but so fun!","useful":0,"cool":1},"nl6lUV-HUQrQ0xMu2dg29g":{"text":"No matter what time I stop I'm New Orleans I can always expect this place to be open.  The","useful":0,"cool":0},"qgjq7uvLIahXWycFgliUtA":{"text":"Definitely a go to when in NOLA.","useful":0,"cool":0},"tS7PkuW4NzSbhoPZR4yVSg":{"text":"The line is long but the wait is actually not that bad, the line moves pretty quick. It's ","useful":0,"cool":0},"M82AW60E28Psh0jqvdTC7w":{"text":"Company store is decently priced. Bought the coffee canister for $6.70 each. They ship too","useful":0,"cool":0},"xPYl6-5xopK_b_30fW8Bjg":{"text":"Very messy but absolutely delicious. They have their process down to get people in and out","useful":0,"cool":0},"HtefTvggykyg_MTDMX-TAw":{"text":"I was reading one of the reviews comments customer had a bad customer service experience .","useful":0,"cool":0},"s87x0Z6KwbonhISsR2JQIQ":{"text":"No trip to NOLA would be complete without picking up some beignets and coffee, right? Café","useful":1,"cool":0},"1Uuy2roPgvvW_g9uBQC_9g":{"text":"The menu is simple..beignets and coffee. It's super touristy which I avoid at all costs wh","useful":0,"cool":0},"heMJNi2varDPyh8aw3yOGQ":{"text":"ore n beignet is great!\nbut.. how can I say... \natmosphere is old markets.\nI like everythi","useful":0,"cool":0},"O3pWhttChD7RxCCjciixhA":{"text":"The line moves pretty fast.  Don't let it intimidate you from checking this box.  And yes ","useful":0,"cool":0},"2uc44hcYbIcad1euNXW_wA":{"text":"Overrated, absolubtely nothing special, and the worse part thieves. If you really plan to ","useful":0,"cool":0},"dYPYWPzP5vIBEbhkRhARCQ":{"text":"Cheapest beignets you'll find in the area! We ordered plates while dining in, and the beig","useful":1,"cool":1},"WB4hi2Ye3iGyIt4TOXHuqw":{"text":"Bignets, bignets, coffee. Coffee and Bignets!!! you find an empty seat and immediately the","useful":0,"cool":0},"zZXsfH_d5EwumEZ9w_XN9Q":{"text":"I stop here on every visit to Nola always looking forward to those lovely light fluffy hot","useful":0,"cool":0},"56IO9ghhIjMdEsRHHCz88w":{"text":"Classic beignet and cafe au lait experience. Denser than I prefer.  Dont go for breakfast ","useful":1,"cool":1},"tbpQ2gMMEfgIcpgttKBOuw":{"text":"I use to come here often years ago, but can say the quality has really gone down hill. On ","useful":2,"cool":1},"o_MCU9tV9JpZLyEkNJLa5w":{"text":"Yum, yum and yum.  Always packed and the line for takeout is ridiculous.  So unless you ar","useful":0,"cool":0},"f5GA3zK88q3BANC19PeStQ":{"text":"Love the place, even make them at home.  I drink the cafe' au lait just like it comes.  A ","useful":0,"cool":0},"NOXmq76gdnEzqknT3VTElQ":{"text":"Must come if you travel to New Orleans! They have the beignets everyone must try. Very aff","useful":0,"cool":0},"pQGrjwinV5CAsWZ2wos8_A":{"text":"They were delightful. Those beignets are to die for. We went after 9 pm and took a seat ri","useful":0,"cool":0},"fuyvD4gLBsZ-bW8mepowpA":{"text":"So this is apparently one of those \"must see\" place in New Orleans purely because of the B","useful":1,"cool":0},"EtMtdX3jERRb1Mb5FAHXjQ":{"text":"Top notch beignets over here! Definitely a go to if you've never been you have to at least","useful":0,"cool":0},"R0n0xbzMkSsCx56xqpga3w":{"text":"This is a New Orleans tradition that lives up to it's legend.  Great coffee, yummy beignet","useful":0,"cool":0},"5SPrXLp_aB-kZohS7BKEdA":{"text":"Cafe Du Monde with scrumptious beignets and hot chocolate. What more could you ask for. Th","useful":1,"cool":2},"NYOQ80qkhMOUUdkjvlWftw":{"text":"This is a destination breakfast shop.  Why?  It is iconic...history brims from the place. ","useful":3,"cool":2},"szkGd7YzPyggULbZZXENuA":{"text":"I first tasted their beignet on a late stormy Sunday night.  The store was almost empty an","useful":2,"cool":0},"1dBviQuE-wJbO3T2IAiR9Q":{"text":"Food and coffee are okay, but nothing that special. What I really don't get is the line of","useful":1,"cool":0},"j177t0e8Ji8K9pGibbYXoQ":{"text":"Was it a tourist trap? Absolutely. Was the service incredibly slow? Definitely. Does fried","useful":1,"cool":1},"sNjbeI7WuIfoRAjG4ZpLbw":{"text":"Stroll back in time. Reminds me of home (Mumbai) with the crowd noise harmoniously mixing ","useful":0,"cool":0},"F7AvT4B3NVNwSjrPt3ptWg":{"text":"Must see place in NOLA\nThe beignets and coffee (cafe au lait) is super good. I tried the i","useful":3,"cool":1},"uHXqNuIPqarP2BLpHtW7kQ":{"text":"A must experience 'rite of passage' as you hang in the 504 FQ!  So many beignets with coff","useful":0,"cool":0},"QfMs7_kR7eLHkeKnEHF5bQ":{"text":"Coffee = bazillion points!  I had their cafe au lait.  I later purchased their coffee+chic","useful":0,"cool":0},"jkhgdeiAJhh_-WfxcvhDsQ":{"text":"This place made me miss home. I don't mean France, I mean Vietnam. Vietnam is a country un","useful":2,"cool":1},"xU9kTdUqO0vjR_bnoE0uEQ":{"text":"Café Du Monde is a very simple place to come and converse while having dessert. I think it","useful":0,"cool":0},"ttJi8AqX6CRaQ_qprYUHrA":{"text":"This place is awesome, it is open 24 hrs a day which is perfect since it is right next to ","useful":3,"cool":5},"3ksJvBFb4pgjSEpy6iaLjg":{"text":"Yaaaaaaaaaaas.\n\nTLDR: Go to the take out line (side closet to the river) - it's much faste","useful":5,"cool":4},"bn8RXe5qgeSM_Eqie2HjAQ":{"text":"This is the place to visit. They're open 24 hours a day, and honestly sometime in the earl","useful":0,"cool":0},"Yw8BVYQ8Mi4pYlAHB_dKpw":{"text":"Don't tell the vegan police that I had a beignet  here... twice. Brought some coffee back ","useful":1,"cool":1},"FtDjUJ17Dand8ivrNs70SQ":{"text":"This listing is for the shop across the street from Café Du Monde called Grandad's General","useful":0,"cool":0},"6kxEcQnY9tarKY4sczM7hA":{"text":"Love those French doughnuts. A bit on the heavy side.  The coffee was great and the ambian","useful":0,"cool":0},"hsbPqO-HipxHRV8bqvhnrA":{"text":"This is, of course, a must when visiting New Orleans. It is loud and a bit hectic, but it'","useful":0,"cool":0},"oTp6EH7sOn7NC-byqEwyOA":{"text":"Why is there a 30 minute line for this place? I thought I could wash down the mediocre tas","useful":0,"cool":0},"i07Ma3uQXxFONurtM_ZOUA":{"text":"As far as the food goes, the beignets were good. Was it worth standing in line for 35 minu","useful":0,"cool":0},"4IBkr69UngvGkCr5vvC_Vg":{"text":"Hit up the must see spot. They have cafe au Lait. Don't go expecting lattes and anything e","useful":0,"cool":0},"L3PWnC0CTpUbpqdFB8FENw":{"text":"Cheap, historically famous beignets and coffee. Bring cash, eat your beignet and coffee an","useful":1,"cool":1},"JX7FHSbl3QUDcyE3hs9dTQ":{"text":"No place can match up to the original. I have tried a few beignets here and there around t","useful":0,"cool":0},"9U9YDW19EdQdPcJnB7h4-A":{"text":"This place obviously has the best beignets EVER!!! But that's not the only great thing abo","useful":1,"cool":0},"AZzqIeO5HQgsXQWvzeBPuQ":{"text":"I always have a great time when I come to New Orleans and this is one of my spots. I canno","useful":0,"cool":0},"urLH4Gf6I9wHt4awdJ3LdA":{"text":"Not worth the hype. I was honestly SO EXCITED to visit Cafe Du Monde and try the famous Be","useful":0,"cool":0},"LB1eL0f6O1wm_vG2kh3ODA":{"text":"Delicious donuts. Opened 24 hours made it convenient at 4am. Great walking distance from t","useful":1,"cool":1},"5fmw0fNEJrgbc61VFbA1XA":{"text":"If you do take-out,you can be in and out within 5 minutes. Really good café au lait and yu","useful":0,"cool":0},"dyzM-la1mk39HA7yW8U28A":{"text":"First of all, best Beignets in New Orleans! Omg they are to die for! Try to come in good w","useful":0,"cool":0},"2JkRqTYXnrooe3snju2Nuw":{"text":"I mean these not even the best beignets out there, but this is a must go destination as a ","useful":0,"cool":0},"nUWxMDISJalsbK95s2S5kw":{"text":"Go after midnight and there's no line at all! We sat right down and ordered. Make sure you","useful":1,"cool":1},"hXjhSuWzioCBwhA3XTwcCQ":{"text":"Café Du Monde is the best at what they do. Besides the long line it is very good. Coffee i","useful":0,"cool":0},"1ndZPqaLl5TtXzqPmyPZrQ":{"text":"Important things: 1) Cash only, 2) open 24 hrs, 3) separate lines for dine-in and to-go.\n\n","useful":1,"cool":0},"TFvlQFcies1Zlx-r8_EWpw":{"text":"Totally worth the hype! Before our trip, I saw a lot of locals saying to skip the line by ","useful":0,"cool":0},"bBtCVqeNU3QsTldH0c_X0A":{"text":"Coffee wasn't very good. Doughnuts were on point. Line goes fast. Fun place that everyone ","useful":0,"cool":0},"jc3O8YnUntYEUeq3toQ4Ig":{"text":"ok, we stopped here as they say it's the place to be but the place was so dirty, ugh. The ","useful":0,"cool":0},"o53o0MJOKIRDQsjdpua0Zg":{"text":"The energy and vibes in this place are not for me.  It super unorganized so it's every per","useful":0,"cool":0},"Rje2mSsDKgUvpZgS5FS1jQ":{"text":"This place is great. Get the beignets 3 for $3.00. If there is a line. Wait this out. Thes","useful":4,"cool":4},"gI1cNJejEPoPElqGimxMvg":{"text":"Their beignets did not hold up after trying other versions in other locations. It is a ver","useful":0,"cool":0},"3qzd4VeQaSE84tvaes5ncQ":{"text":"Ok...let's talk about this cafe. Wait yes a long line but went very fast!! The staff that ","useful":0,"cool":0},"c0Z8Fvv2HvqJCB49bgEfEg":{"text":"Its a tourist trap, but man they were good.  I'd get them again, but I don't think I could","useful":0,"cool":0},"b5CWfqTp7LmXNk0O7suVGg":{"text":"Definitely worth the wait. Delicious coffee and beignets! We went twice in one day! The st","useful":0,"cool":0},"JRip5T2uf-fW1mMWvmUoeg":{"text":"The must stop place when in NOLA. The lines WILL BE LONG, but just go during off peak hour","useful":3,"cool":2},"3jpcxlXR0Y_So5-IbBXl9A":{"text":"Another one of those places that you just have to visit when you're in New Orleans So make","useful":2,"cool":1},"jAoOZ0yLBeNlfyNok1AR8w":{"text":"I always enjoy a stop at the Cafe' Du Monde.  The menu is simple.  The service is quick & ","useful":0,"cool":0},"gdOZoMeNyGwofrIzC8epHw":{"text":"stopped in this morning.  loved the beignets  very tasty.  Order diet coke and got a regul","useful":0,"cool":0},"je-74P4JcoM4iXc572VWSg":{"text":"My first and only beignet experience has been at Disneyland where they serve Cafe Du Monde","useful":0,"cool":0},"TbJ4me7ZYHACK-sNskx-YQ":{"text":"My boyfriend and I probably made a rookie mistake stopping by here on a Saturday afternoon","useful":0,"cool":0},"q8SuDwrlG1omYkxOtiyxWg":{"text":"This place has so much hype I didn't know what to think about it. A beignet is just a squa","useful":0,"cool":0},"it7mIG8Km481b2716u6_2w":{"text":"I was told I had to go to cafe du monde during my visit to New Orleans.  I was sooo excite","useful":0,"cool":0},"02LxogXvcY0MLI6RPjcFCQ":{"text":"Beignet's and cafe au lait...Delicious.  I've been here before and the two don't disappoin","useful":0,"cool":0},"HjwtueUgFjiXksaXlgZZNg":{"text":"Everyone told me to come here while in town. I was so excited to try it and had really hig","useful":0,"cool":0},"TEh8DyXyjyoUrFvz8n4liA":{"text":"Long lines = rushed service and rushed product. I Just wasn't blown away by my experience ","useful":0,"cool":0},"opeDGzhb6p662P_iXGR5og":{"text":"Best beignets I ever had. My friend and I visited it 4 times in a week. It's a 'Must Go' p","useful":0,"cool":0},"Qr3J6OJ_mHMMEUofT9RuyA":{"text":"Another one NOLA long line places.  There's 3 lines one for take out only, 1 for being sea","useful":10,"cool":7},"8D1m7JJLTb7PKBAHm7hCfA":{"text":"Best beignets I ever had. Waited in the line for 30 minutes and worth every minute. I won'","useful":0,"cool":0},"ogF1ywFNUhhMySx4N-h9kw":{"text":"Nice coffee and pastry. There was a pungent odor that perhaps was the result of the crowde","useful":0,"cool":0},"42nuGlXDq84rEKrrtbdOvg":{"text":"It really does live up to the hype.  Go get a café au lait and an order of beignets from t","useful":1,"cool":0},"P6TxqdHico7Kbvoml7-GPg":{"text":"A definite must go when in NOLA. The best beignets are the best in New Orleans. Do not ski","useful":0,"cool":0},"pN9N-EfQ_8atRw0Z7NzIrg":{"text":"Orgasmic. Simply orgasmic.\n\nYeah, it can be busy, and I would imagine the wait could be fr","useful":1,"cool":0},"1y0w0nVyUXUuK60AlmEs-g":{"text":"You can't go to New Orleans and not go to Cafe Du Monde. We went not once, but twice: once","useful":0,"cool":0},"P04EzJT5F9xsC_S4zwIqkw":{"text":"Always a great day to get beignets! Whether you're a local or a tourist this place is a mu","useful":0,"cool":0},"Oedelpmi0JrKbAn4mmf8Mw":{"text":"This is pure heaven. Simple yet classic New Orleans. Amazing fresh hot beignets, amazing f","useful":0,"cool":0},"xgfpR5PiJA3mJ03UqAddVQ":{"text":"Had to do it! Touristy, busy, fried dough, powdered sugar overload- all of these would gen","useful":0,"cool":0},"zCcRVSfU6_kEd886difQIg":{"text":"Found my way to the cafe about 1100 pm and it was packed. Plenty of servers available to h","useful":1,"cool":0},"ZbEtkDnb6Rs8DrfXwH-bOA":{"text":"Starting with the positives, the beignets were amazing as expected and good value for the ","useful":0,"cool":0},"dzbndmWk3B07xYk7TTTrvA":{"text":"Of course, if you are visiting New Orleans, you must forget about your diet and come here ","useful":0,"cool":1},"EQYpxveLkALviHbmvd-CfA":{"text":"The goodness of a fresh fried treat with a mound of powdered sugar over it. I've had plent","useful":1,"cool":0},"luspcNQFnA9boOd6IqqFIA":{"text":"I finally got to try the coffee and beignets.  WOW!!!!!  we sat and split the beignets and","useful":0,"cool":0},"l1vapu0XFFsZZIvRcl8HOg":{"text":"It's a most do! It's fun and you gotta check the box and say you've done it.  The beignets","useful":0,"cool":0},"HRLXK1UcG7qnSRIHNC6BUg":{"text":"Freaking delicious Beignets and coffee! Don't make the tourist mistake and wait in line, I","useful":0,"cool":0},"U3FGngUg0sq5gEIA0TiuYg":{"text":"Love this place. The atmosphere and the food. Beignets are now my new favorite breakfast i","useful":0,"cool":0},"JIWbtVU7ci_x1X5213rv9w":{"text":"Dear Beignet, \nI have tried your cousin, the funnel cake...as well as your other cousin, t","useful":0,"cool":0},"z7trv4z_gLwDJxRYD53hig":{"text":"CASH ONLY*\nWalked over to Cafe Du Monde at 2pm, it was busy but the take out line was very","useful":0,"cool":0},"y7aB7TbuTuLmETWk6nuZEA":{"text":"Obviously Cafe du Monde is super touristy place, but if you are in NOLA it's something you","useful":0,"cool":0},"4Cl7Nvr9xDJd7x1R9er1qA":{"text":"Prepare for the wait. \n\nOr do like we do and continue down the street to their supply stor","useful":0,"cool":0},"7IvPAhGnvdAiYmz0JQ6Dyg":{"text":"Café Du Monde is definitely overhyped, after hearing about it from friends and family I co","useful":0,"cool":0},"XO2nHg3OjIT2aDI3O530YA":{"text":"Stopped by the illustrious Cafe Du Monde as we need the authentic experience of the beigne","useful":0,"cool":0},"47y6CqgnoWbSm8ipf6Pucw":{"text":"Beignets and coffee, that's what Cafe Du Monde does! Enough that I had two trips there. Th","useful":0,"cool":1},"d0jnxlFFGOgIvm4rvaQCDw":{"text":"What a place!\n\nIf you do not come here at least once you are a fool. The cheapest and most","useful":2,"cool":0},"DAuS7NB2yIb-ZRH9wGDnBQ":{"text":"So busy all the time!! You have to find your own table and snag it! There is tons of seati","useful":0,"cool":0},"YyPtfsBLJe4Iceb3v9VM6A":{"text":"Be warned on a windy day powder sugar flies everywhere.\n\nSubpar  coffee. \n\nSo so service.\n","useful":0,"cool":0},"CiIdpZWtuHv6j3UFdmodkw":{"text":"For a sweet breakfast it is the place to go. But be advised you'll need to take cash when ","useful":0,"cool":0},"C9fnJaMynnsbZf8PYVQ6dg":{"text":"Come here for the bignets paired with a cup of cafe au lauit and you've leave with powdere","useful":0,"cool":0},"pCNj04h0ic9DNpXjdqzCQQ":{"text":"oh look... another disappearing review. I reviewed Cafe du Monde years ago... and I rememb","useful":2,"cool":2},"sjAYI34oSvu8u09lpcyaGw":{"text":"Miss the old price and service at the French Quarter location. As a local, the place still","useful":0,"cool":0},"EpKcjaZXuoHMGUZBB8Z-Ww":{"text":"How can a business who sells only 2 items, coffee and beignets, be busy 24 hours a day?  B","useful":0,"cool":0},"jWpMaK1kFqUmzHt_5Ut5bg":{"text":"This is the general store, NOT the cafe. And the store's employees are unhelpful and don't","useful":1,"cool":0},"NXdGce_5QfiE8ZAdHWjSwA":{"text":"Meh! This is the must stop spot in Nola but not for me. Don't get me wrong, the beignets w","useful":0,"cool":0},"ADMzvnaDPhRZrmuhUaK0Qg":{"text":"Once again....its all hype and a tourist trap. Powder sugar....cranky old waitresses....no","useful":0,"cool":0},"JRFiSdIcnmOMSUgtz3BqKg":{"text":"All I heard besides eat lots of cajun/creole when coming to NOLA was to also have a beigne","useful":0,"cool":0},"nEjJwpvGSvpeQ5dHUO8JSw":{"text":"No wait on December 26 at 930pm. I'll say that giving this restaurant a low rating bc of t","useful":0,"cool":0},"AwpATpAcAmpOYukS7CLGkQ":{"text":"The go to place for beignets. If you have ever had beignets in downtown Disneyland the use","useful":0,"cool":0},"iJ7CHw6PHNidX4IKNqtasA":{"text":"Always a must. Service is amazing regardless of how busy they always are. Perfect beignets","useful":0,"cool":0},"8BmAKDnlud1q6Rd8Bzdk6w":{"text":"Still the best chicory coffee and beignet and great fast service!","useful":0,"cool":0},"NLti9D1jMovWenrAUhMAOw":{"text":"Large coffee and beignets...one of the best ways to start off your French Quarter experien","useful":0,"cool":0},"L_lwNTMSXdi8iKglykGW1w":{"text":"This place is put on such a pedestal that I had super high expectations. But honestly, I h","useful":0,"cool":0},"HfCjf1W9ByIzWwphV5qXAw":{"text":"So i came here on a Sunday morning around 10am. It was raining but the line was extremely ","useful":1,"cool":0},"v9Huey5cHhfeL9kqWWiWWA":{"text":"What can I say, Café Du Monde is everything it is made out to be. The beignets were well p","useful":0,"cool":0},"UyyZdE4kJVEHs35Qbfbc5Q":{"text":"Given the absurd volume the service is good and the product is amazing! Anyone that comes ","useful":0,"cool":0},"XzaMBXiaEzKlAhtCDkXjDA":{"text":"I was really excited to go here and was really disappointed. My beignets were terrible. Th","useful":0,"cool":0},"MLzVJOUjGBWiG4uVtNcn_Q":{"text":"Never having a beignet and hearing all about Cafe Du Monde, my group decided to wait in th","useful":0,"cool":0},"sO161H6MDk7hG1acBYmN7A":{"text":"A trip to New Orleans is not complete without a visit to Cafe Du Monde, but I think I woul","useful":3,"cool":2},"6FUefvkqURjRSZtdwb2uYw":{"text":"The beignets and coffee were good.but the service was not .I sat there 15 minutes.i asked ","useful":0,"cool":0},"H2ByI8lrKJBY-GHwSz95Sw":{"text":"I've heard of Beignets for millions of years and my first Beignet experience was 5star fev","useful":1,"cool":0},"pa-bU7U1bx5-RXZxRNbQuQ":{"text":"Maybe this is just the typical tourist \"rating\" but after seeing the restroom, there is no","useful":0,"cool":0},"aS80H8m8fMA0NPjE3GlLVQ":{"text":"Maybe it's just me, but I don't see the hype around the beignets. I fill like some type of","useful":0,"cool":0},"BC5eAAiYsgQ0vkpumizACg":{"text":"We paid a visit to this place in the first evening of our stay in New Orleans for Mardi Gr","useful":0,"cool":0},"EP3yVx1KmL3L5-WkadjiRw":{"text":"Skip it and go to Cafe Beignet. The beignets were small and only so-so. Staff was indiffer","useful":0,"cool":0},"VzZrRYpEefzQft1VAdOnrw":{"text":"Delicious beignets, hot chocolate and coffe. Worth the wait. Rated it 4 out of 5 only beca","useful":0,"cool":0},"Y2ZFhUk3N0hQE4onNcByXg":{"text":"i dream of these beignets....seriously. they're pillowy, hot, crispy, just so so so delici","useful":1,"cool":0},"FW9oWWhCwqC5Z0AmcWAqTA":{"text":"$3 for 3 beignets at the Take out stand, might be the best bet. Even the take-out stand ca","useful":8,"cool":6},"ENtrlfNk7gq6BwEblcoc7g":{"text":"You HAVE to go here if you're in New Orleans.  I don't really like beignets, but the exper","useful":0,"cool":0},"URHAUK3X_IZODL8MZsqVFg":{"text":"Wowers! A-mmmma-zing! Best piece of advice we received before visiting this powder sugar l","useful":2,"cool":2},"eMrZfee7TcGxAKVolpAQDw":{"text":"Try to time your summer morning arrival for around 8:30. You want to be there when they fi","useful":6,"cool":4},"e7E7WEBViMoFqFeTtepl8g":{"text":"You have to pay a visit to the legendary Cafe du Monde if you're going to be in New Orlean","useful":0,"cool":1},"ogxjgi_HkR9Qye2YZWZAsw":{"text":"A must have when visiting NOLA. We really love stopping in and getting our fix. The servic","useful":0,"cool":0},"KRuLUoM0--pIcEuKP2_AAQ":{"text":"A must-stop if you are visiting New Orleans. There is sometimes a line but it moves quickl","useful":0,"cool":0},"6Kj4E9FTyxt6kFW_yMaaJg":{"text":"A must visit while in the French Quarter. Lines can be pretty long, but the views around t","useful":0,"cool":0},"IsTcVyVy3_0V9a8_Y4B9dQ":{"text":"1st night in NOLA & had to stop in for some beignets. Surprisingly no lines & empty seats ","useful":0,"cool":0},"-noqtpMs0T3ltRMnOfyfLQ":{"text":"It was great. We went to the sit down side they also have a to go side. The experience was","useful":0,"cool":0},"bFbP7nccJsWVMalir4N9XQ":{"text":"We went around midnight in early May, the night before we left. It was raining so hard but","useful":0,"cool":0},"0GfjLK_3b6b_lA1Fw0WqNA":{"text":"Atmosphere:\nVery touristy but what do you expect with it being a staple in the French Quar","useful":0,"cool":0},"xZN-EMLBKd2uqmzcFtqExw":{"text":"Cafe du Monde was exactly what I anticipated it to be. It was a hustling and bustling cafe","useful":0,"cool":0},"IjwvuvQ_sRLKxtiEmhVY-g":{"text":"I have tried the beignets in several other places, Cafe De Monde are the best, and I enjoy","useful":1,"cool":0},"3zPrHdZGfMVGKakb2uVq8Q":{"text":"Beignets - of course... YES you should go... is it hype, yeah, kind of... but this is a NO","useful":0,"cool":0},"LIH0s9zsna61xRyP--WuLg":{"text":"TIPS FOR THE LINE:\n\nThe line to the left (adjacent to the street) is to be seated. The lin","useful":0,"cool":0},"9vHbI8yY5Jm2nLVblFNotQ":{"text":"Um. It's cafe du monde. lol. How can you ever go wrong?? The beignets were amazing and the","useful":0,"cool":0},"gjf0rN3NOv6odIPtQ2-TJw":{"text":"I think Jon Favreau said it best in his movie Chef, \"Eat is slow. You're never going to ta","useful":0,"cool":0},"OcczL0glehzPIkpyym_v_g":{"text":"the beignets are a must when you visit nawlins! i have to agree that they do kind of taste","useful":1,"cool":1},"oXx_nOBpZgG42DQrvYtuvA":{"text":"Who doesn't love CDM. It's breakfast, lunch, snack, late night drunk food all in one. It's","useful":1,"cool":1},"WgkVTm9lYDFyKenRYPscVQ":{"text":"Thier famous beignets  where  almost raw in the middle. Felt like i was eating a adult fun","useful":0,"cool":0},"S2gLOV0vp4FQpOi14z4HYQ":{"text":"Amazing!! Even bought a cafe au lait and beignet 2020 Christmas ornament (our own traditio","useful":0,"cool":0},"P0kgSDny59dJ3vp1SYt3oQ":{"text":"Love the beignets but as far as service I.T sucks have to seat yourself takes forever to c","useful":0,"cool":0},"fskpb79A2cjbcH0DUtez1g":{"text":"Beignets, yes please! You come to New Orleans you have to come to Cafe Du Monde. I refused","useful":5,"cool":3},"TDri0HgZBZQYGcytiEtXqQ":{"text":"Almost forgot to review this place. Great place for people watching, but a crowded, crampe","useful":1,"cool":0},"pbv_0K08v74fRi1a8ATOhQ":{"text":"I like the coffee and I like the beignets. I don't think you Must go on your trip to Nola.","useful":2,"cool":2},"t1OfEe7E_G5vY5rk2_yLqQ":{"text":"I forgot to review this place but I've been to New Orleans two times this year and I went ","useful":0,"cool":0},"rWVNpmWeXQU-3wTS4HOJ-A":{"text":"Don't wait to be seated and just grab a table. Sat at an empty table and the server came i","useful":0,"cool":0},"LV1_-5nmEhqSabbVJz63pw":{"text":"Must see, must do when in the big easy. Get up early to walk the quarter and always plan a","useful":0,"cool":0},"fGlZneJwIz3nBMx9Z7ombg":{"text":"WOW! I love regular donuts (mom & pop shops) but these beignets are scrumptious, delicious","useful":0,"cool":0},"-G-OC-LbeIjaXvC_kzSmaQ":{"text":"Definitely NOT gluten friendly, and because I am also allergic to milk, I basically cannot","useful":0,"cool":0},"AW-T9wR3WlnS0d0b9vEStA":{"text":"4 days in New Orleans means 4 visits to Cafe Du Monde. SIMPLY THE BEST! Best beignets and ","useful":0,"cool":0},"NNC-PcxVpElUDBb3pX2A4A":{"text":"Won't spoil the trick of the locals at Jackson Square as I enjoy taking advantage of such.","useful":0,"cool":0},"xpRNc27A6KBVg0M3Fg3dlg":{"text":"Beignets were good!  You here a lot about this place before you get to New Orleans so I wa","useful":0,"cool":0},"Xjlkuo3wJDkT7_zYazcJlQ":{"text":"It was okay. basically a bag of powdered sugar with some fried dough mixed in. coffee was ","useful":0,"cool":0},"R0swYzjbLdXeqcRTG0giDg":{"text":"Coffee...deep fried dough... long lines... get em in/get em out... \n\nWhat more can be said","useful":0,"cool":0},"71I-A4y4l70WCj4M70LNNg":{"text":"Open 24 hours - great breakfast spot for beignets & coffee or after a night of drinking wh","useful":0,"cool":0},"H184mctVMp8Mqfs3TY_w7g":{"text":"Always open and definitely delicious. Take out line moves quickly. You can also get gift s","useful":0,"cool":0},"F7epM3IPJEeU4b5epJSuqA":{"text":"We were hear on New Years Day and were among the few that didn't care about any football g","useful":0,"cool":1},"DTu7a0AnICn124gPLgn9jA":{"text":"When we arrived, the line was insane. We waited for about 30 minutes in the \"carry out\" li","useful":1,"cool":1},"uD19v2UGfQB_ZybyB9AwxQ":{"text":"I felt it was durtty and extreamly long line to me it was not worth the wait I would never","useful":0,"cool":0},"mm-khNZk3_CGTX0I1NDjjA":{"text":"Great beignets, but terrible customer service. I asked if the coffee was sweetened and the","useful":0,"cool":0},"VH1kytheWiNw9hOFujKXZg":{"text":"Fast service, delicious coffee, and ohh the beignets!!  If you are in New Orleans, this is","useful":0,"cool":0},"F65ltMEKTZ5iFwSNin2Ucg":{"text":"The beignets  are gOod and decently priced but they get it back on the cafe au lait. It us","useful":0,"cool":0},"qlYrtncKVI1WAZVHb5Xlug":{"text":"Bucket list  \n\nI anticipated a long wait so myself and a couple friends opted for the take","useful":0,"cool":0},"qX2xzK4d1OpYDJHja7t9TA":{"text":"we had to come here while on our vacation from las vegas to see what the hype was about...","useful":0,"cool":0},"rxlu0Jbdbtv5IMtKrkj7Zw":{"text":"Note to all others: DO NOT WEAR BLACK PANTS. You will get powdered sugar all over yourself","useful":2,"cool":1},"QNPu9v-NxELpDbU_QsSN1Q":{"text":"Solid place. Line for to go orders is a little long, café au lait is a little pricey, but ","useful":0,"cool":0},"f3TMJbaDaZxpTLjJ8IE4CQ":{"text":"The iconic cafe du monde did not disappoint! Please know that this establishment is, in fa","useful":0,"cool":0},"EbY4EMRYEWrtfDkic6Y82A":{"text":"It's just a tradition. The beingets are always excellent. The coffee has been the same and","useful":0,"cool":1},"U2Kl2GivunR6XPDvazs2yg":{"text":"Had better in Oakland,Ca...\nAnd that coffee... no wonder they put milk in it.. it's horrib","useful":0,"cool":0},"Y5lcrpY87Kq22J9lb7HSoQ":{"text":"Haven't been to the actual place yet so can't comment on the service. \nI tried a beignet f","useful":1,"cool":0},"64U8LdnocDBmW_s9EvI-4A":{"text":"If you visit New Orleans Cafe De Monde is one of those places most tourist visit.  I have ","useful":0,"cool":0},"KW5fV5GSHTzGBTjQGnwSYw":{"text":"Hard to come to NOLA and not stop here. Don't let the long \"to-go\" line intimidate you, it","useful":6,"cool":6},"FAGudhKFykueGtD4cscTew":{"text":"This place is certainly wonderful with everything it has to offer. Cash only so be ready.","useful":0,"cool":0},"PNcK_R7YjEilFv6zEGjnUA":{"text":"Gets a pretty solid 4 stars only because we are here on off season and there was no line w","useful":0,"cool":0},"7FlhRDhfFlq9pmTZYGIMIA":{"text":"Cool iconic place...you come here for only one thing.  As a tourist, you kinda are obligat","useful":0,"cool":0},"5inywJk07tlbQ6A-ebK-HQ":{"text":"Best beignets I've had @ a great price. The hot chocolate was also outstanding. It's bette","useful":0,"cool":0},"9ID8xgsaaYdV6kZ4m6QooA":{"text":"Must have in NOLA. Best beignets in town, we all had cafe-au-lait and beignets yummmy.","useful":0,"cool":0},"TC5qxU3ZAZtg918pvuxlmw":{"text":"Definitely part of the Nola experience.  If it's a busy day, be prepared to wait and make ","useful":0,"cool":0},"VvLbCUuTJ3Q2pg4hqa3E3A":{"text":"Perfect warm fluffy beignets drowning in powdered goodness. Good coffee too.   If you hogv","useful":0,"cool":0},"KWgRF0DKYbKjFNNJ2GDE-g":{"text":"We were told by everyone this is a must stop. And everyone was not wrong. The location is ","useful":1,"cool":1},"sjuNl55p4RWvFI03io8WQg":{"text":"I really can't get enough of Cafe Du Monde.  Each time I'm in the city, I make a point of ","useful":0,"cool":0},"sdY7Aw6kLUXCGc8ySqEGhQ":{"text":"Table service cash only joint with a very limited menu. There are plenty of tables you can","useful":0,"cool":0},"4STGMGtmqOPU5s_THfrw3w":{"text":"Its an institution, but probably the worst biegnets in town.  The place is un organized, s","useful":0,"cool":0},"H35lcDC0Omrtv561QmF1eg":{"text":"The cafe is amazing if you go to the original in the French quarter across the street from","useful":0,"cool":0},"4w7pf7Y0ocuG8_b2goF7gQ":{"text":"You know the teacup ride at Disneyland? It's overrated right? It's a tourist trap right? B","useful":1,"cool":0},"8kRidKZL0TBj5KuLfslPDw":{"text":"Omg the beignets are of course a classic. I've been to New Orleans three times and always ","useful":0,"cool":0},"4tcu6745qEmD7cXqia7iKA":{"text":"This place is very bad. The waiters don't care. Extremely slow with bad attitude. Not many","useful":2,"cool":1},"-ZYJq-jsK50ur6n6USyzFQ":{"text":"Take your beneigts over to Jackson square with lots of napkins. It's fried dough with powd","useful":0,"cool":0},"XFr70pLOcQ_5S28k6SoCtw":{"text":"Came here with a friend while visiting New Orleans. It was a busy Saturday night, but we f","useful":0,"cool":0},"jt3TeIb5E7YLNm7H13fa_A":{"text":"Fancy funnel cake with over priced coffee.\n\nShould have been an easy 5 stars because of th","useful":1,"cool":0},"bF2MO8uNq5ZAq52jnE-8Qg":{"text":"OMG I wish they had one in Michigan ... everything g is perfect .. lost for words .. so go","useful":1,"cool":0},"w04aN023UzpCIdwZMsQD7g":{"text":"Café Du Monde was one of the main reasons why  I wanted to come down to NOLA for an extend","useful":0,"cool":0},"yTmPIp6lF_cmsRm1WhLx3Q":{"text":"10/10 for experience - I think I like this place because it's like the food Disneyworld fo","useful":1,"cool":1},"T3mT-0P-6L_xVJGigZRNuw":{"text":"I have been wanting to come here and it lived up to my expectations. Came here on a Saturd","useful":1,"cool":1},"5GbvEqoacFm4WWtHLGcZ9w":{"text":"I GET IT - everyone wants to see/eat/do the most touristy things/main attraction in town a","useful":0,"cool":1},"sZJnPhU9mwKyFO8itsTCow":{"text":"There is a reason Café Du Monde is on every NOLA \"must\" list. These beignets are outstandi","useful":2,"cool":4},"b0uNspF4aBCfXpJy7yycQg":{"text":"Great for a quick coffee and bag of beignets while you're on the go in Nola. Probably woul","useful":0,"cool":0},"mKAG1HUYMGcy6cIBZqHS7g":{"text":"I was really excited to go here and was really disappointed. My beignets were terrible. Th","useful":0,"cool":0},"WLVjxYpEZ7ErLWupF6NL1A":{"text":"Beignets were delicious. Lots of seating available, no wait time for us this afternoon. Th","useful":0,"cool":0},"2fQ5068sJA7hdKHfZp6NJA":{"text":"Evidently my parents went there in 1955 from Augusta, Ks. I was first able to go in 1977 f","useful":0,"cool":0},"OJDS4ST9q3lP9oSRoOa9ZQ":{"text":"Thanks to my obsession with garbage TV, I learned that this place was THE place for beigne","useful":0,"cool":0},"stBc6QrCuDEgNETpKA89Yw":{"text":"Beignets all day ~ literally! Cafe Du Monde is a must-do in New Orleans. This location is ","useful":6,"cool":5},"EmbU-7ZSkDeq-gzRtbLTWw":{"text":"Affordable, yummy and fun.  Music while u wait in line and friendly staff.  BRING CASH!","useful":0,"cool":0},"eei0TZzUOe_YTF-KIbkZDw":{"text":"Due to covid u can only order to go. \nTheir tables are open to eat in the patio. \nThe beig","useful":0,"cool":0},"2b_IVDXGIY6PqdIFdnhXzw":{"text":"Unbelievable! The best ever experience! The young waiter was so courteous and prompt. This","useful":0,"cool":0},"mh7d76pRFjfaGG13lz21cw":{"text":"Cafe Du Monde is a must stop when in New Orleans or even when passing through New Orleans.","useful":10,"cool":8},"3uMMqpsoAWap4rI4onmkMA":{"text":"So happy I finally had the chance to come here. I had the best frozen coffee ever, and the","useful":0,"cool":0},"rOjrnaiBzZBtOBKgRCoQOw":{"text":"Had 2 beignets. They were fresh... but not piping hot. They were already prepackaged in a ","useful":0,"cool":0},"Vv7VMW_fni-z3C2HMsNqog":{"text":"I've been here many times and for some reason Yelp deleted my review.  Which bums me out b","useful":0,"cool":0},"sxNnshTu7VnXhuHELDDBSw":{"text":"Beignets were great!  Service was good.  Wanted my son to experience his first beignet & h","useful":0,"cool":0},"ktKn67iGkX-af_y8cvGXCw":{"text":"This place is legendary for a reason. They could literally charge twice what they do. Beca","useful":0,"cool":0},"n95ZE4WsCR1qPgsTIm6kCg":{"text":"My must stop location when I'm in town. I never come through NOLA without grabbing a bag o","useful":1,"cool":0},"laVKRjAFP1k5omnaWa7nkQ":{"text":"If you love beignets or have never had them before, this is the place to get them! Super d","useful":0,"cool":0},"gtSnOIpCoq30PzuD5--2hw":{"text":"Hot delicious beignets, fast service...what more can you ask for? The sitting area is cove","useful":0,"cool":0},"_1HHr_ULqUK2W5PKNNj5NQ":{"text":"Cash only for BOTH lines. Omg I waited an extremely long line for an hour just to find out","useful":0,"cool":0},"RceuEuembWshnZGCxU6qbQ":{"text":"It wasn't what everyone had posted about. We're not sure if due to Covid the way they put ","useful":0,"cool":0},"9r1DH-Hw4FgN57JGw1n0DQ":{"text":"We took our food and coffee drinks to the deck facing Jackson Square and enjoyed our late ","useful":2,"cool":2},"SqUmX0aPW-ABgQdhUYU4Bw":{"text":"I was told this was a \"must do\" in NOLA. I didn't realize that they only served beignets a","useful":0,"cool":0},"3y6bkezudwamHnwLWYDRCQ":{"text":"Their beignets are the best in New Orleans! Visiting Cafe Du Monde in the French quarter i","useful":0,"cool":0},"Ufh9sFleFXk6FQnzwdgiTw":{"text":"How can you not go here when in New Orleans!? We actually tried beignets & coffee from the","useful":0,"cool":0},"KEJ8E79i2TmjKDOLnMAMaQ":{"text":"Always wonderful! But advice- the pick up line is in back- and the line for tables in fron","useful":0,"cool":0},"7RbUnKXBMx-A-oD9xkCz1g":{"text":"Our Favorite stop! The beignets are fabulous. Bought a total of 11 orders over two days. T","useful":0,"cool":0},"xHzvjSJeD2q19VxMcTHyQw":{"text":"so amazing this place. \"Sigh\" I wish they'd come to New Jersey. I want to live in New Orle","useful":1,"cool":2},"UfQIVTrR0se3ccnub7zkMQ":{"text":"A must stop! 10/10 customer service 10/10 beignets 10/10 coffee. Clean and large outside s","useful":0,"cool":0},"OptAOB-osocKgYsOt7CdEA":{"text":"We walked all over New Orleans so decided to treat ourselves to some beignets and coffee. ","useful":1,"cool":0},"YJb9QNGHYdNElI3qbfn3Yw":{"text":"love this place the ladies that work here are sooooo nice lol I don't know the lady name b","useful":1,"cool":1},"oq1Q3hSuJyIT2crOhklLyQ":{"text":"Yes, this place is definitely a tourist trap! The whole experience is questionable at best","useful":0,"cool":0},"bmOC3PpElomyo366sdU58w":{"text":"I get the hype.  It's simple and delicious and they do it so well. 2 main things: coffee a","useful":0,"cool":0},"CIfBhqbbyYQadpKZ-BK8GQ":{"text":"I love this place. I come to visit every time I'm in New Orleans. The best beignets I've e","useful":0,"cool":0},"0SVogJB4njNtcN6CZiJadg":{"text":"Everyone raves about Café Du Monde, and I used to be one of those people, however sadly I ","useful":0,"cool":0},"2ZoGynMhSuIGh9ETJ4KJsQ":{"text":"What happened to Cafe Du Monde's Yelp page?! They used to have thousands of reviews! I rev","useful":47,"cool":39},"c1U8nPfMcKp9wgOiJ41PCw":{"text":"If I was reviewing solely on coffee and beignets I give them 5 stars. But, I review on the","useful":1,"cool":1},"38Ja0UGOh6gVGyEuIb4_gw":{"text":"If you want to have that \"quintessential\" New Orleans experience...\n1. that really depends","useful":0,"cool":0},"LvNTLRHZOXqp8Rtxl_LFNQ":{"text":"Wish I'd gotten the memo not to wear black. :) powdered sugar everywhere! Don't worry if t","useful":0,"cool":0},"4V8RGI6dbwTIkUxKHuuUOA":{"text":"It's a classic and sitting outside is a must on the NOLA checklist. The coffee is excellen","useful":0,"cool":0},"4BKaUETYSL6AQP-bdEqjZg":{"text":"We arrived first thing in the morning. There were only two people ahead of us in line. The","useful":0,"cool":0},"wmsknG_F0S0rkZWb9m0kgA":{"text":"Great coffee and beignets! Live music was being played which was nice.  Very efficient but","useful":0,"cool":0},"OkIGz8voQJv7IS3z3O2QjQ":{"text":"Yes.. It's worth the hype! A lot of popular cities have their foods that everyone says \"yo","useful":0,"cool":0},"UnM-leGPQQHTTiwmpXB8rw":{"text":"What is New Orleans without a giant group of screaming children, their tourist parents and","useful":0,"cool":0},"VadcMGLDA1JJwfu72XaAhQ":{"text":"Such a perfect ending to a night walking around in New Orleans! The beignets were cheap an","useful":0,"cool":0},"jZf7kf3rSFPgiWBdgNCegQ":{"text":"Overrated. The beignets taste just like funnel cake and was expecting them to be light and","useful":0,"cool":0},"P_Zihd-jEBWMmbT_aXzSDQ":{"text":"The coffee and the beignets were good but the service was weird.  \n\nNo host, you just grab","useful":0,"cool":0},"PQqeizcsLAkpY_9ZaTj0Jw":{"text":"Was very clean. Practiced social distancing... I love this place. The ambiance and beignet","useful":1,"cool":0},"6cmlmtBHEnOTUud93t7PhA":{"text":"Festive, delicious, insanely busy and crowded and... well... what do you expect for a coff","useful":0,"cool":0},"EPsB-BJRwVynD8_HmLTMYg":{"text":"Being a Nola virgin, I actually had no idea what the hell a beignet even was. But all the ","useful":0,"cool":0},"xol9PtHQlaqEpwv7hryLbQ":{"text":"I've been to Cafe du Mond probably 10 times - every time I come to NOLA. Went today and th","useful":0,"cool":0},"92LsHwnTf8OJS_HrMMKj6w":{"text":"It's one of those things you have to do when you visit New Orleans: visit Cafe Du Monde. W","useful":0,"cool":0},"rJfLIAY9P5qJopDTD67HjQ":{"text":"I've heard so many good things about this place, so we had to make a stop! OMG those beign","useful":0,"cool":0},"14BNMpDjo392DIW6sm5Zlw":{"text":"Delicious beignets and coffee! A New Orleans must! It's seat yourself, so grab your own ta","useful":1,"cool":0},"Gp9VaV4ceSvNmiCZEWYZZA":{"text":"Obviously this is a tourist trap, so be prepared to wait in line. As a warning, people are","useful":0,"cool":0},"dLGQcynz5kDSRzaNfeGzVg":{"text":"1 hour wait but yummy and the powdered sugar actually stuck to the beignets . Live enterta","useful":0,"cool":0},"Gu1bS54m0mS_Ai1BQ9711Q":{"text":"Enjoyed a Shrimp PoBoy - yummmm! The hurricane was delicious too. Live music on patio. Wou","useful":0,"cool":0},"8YmG_8WNEYbGinh6N5AeCQ":{"text":"So I hop on over to the legendary Cafe du Monde. It was 3pm on a Sunday and the line was m","useful":2,"cool":2},"VGv120nYPTPWG_2v1lN-zQ":{"text":"Went with my family . Hot chocolate was good so definitely get that! We will be going back","useful":0,"cool":0},"TX95uvWL4oWw7eM4_Otwaw":{"text":"I've been waiting for  years to visit New Orleans just to go to Cafe Du Monde. I had heard","useful":0,"cool":0},"4uv49D1gqL_4im3WspIvLA":{"text":"At first I walked pass this place. The line was super long and looked like it was moving s","useful":0,"cool":0},"GaHecoRy5S6r3k_0aGla1Q":{"text":"Great place for dessert and something sweet. Beignets were fresh and for both the beignets","useful":1,"cool":0},"YCd1REcVj774imNc6ZPORg":{"text":"What's there to say? It's a wonderful spot in the French Quarter nestled right next to a t","useful":0,"cool":1},"d47eB4ip5Luxzyp_khkSfg":{"text":"Dont be like me.... \n\nDont wear black capris while trying to eat something covered in an i","useful":1,"cool":0},"kVSlyI2w8mlySC-wQfMrjQ":{"text":"(My review was removed below and not sure why.). \n\nWe tried different off the beaten path ","useful":2,"cool":1},"HuRmFqTfheQ1heVpzgtf1Q":{"text":"I had this place like 15 years ago, but decided to do the \"touristy\" thing and try it agai","useful":1,"cool":1},"f-h0gLHjT5dyn6vVdVNbLQ":{"text":"A classic treat in NOLA so when in NOLA, get you some Beignets! Yummy pillowy puffs of fri","useful":0,"cool":0},"dAHhsHjQB39fTiKex-RtfA":{"text":"This place is definitely hyped up more than it actually is. The beignets were good but not","useful":0,"cool":1},"5Pnnc0fJ7a1ycOMsOF87bw":{"text":"ENHALE ONLY\n\nMy very first visit to Naw'lins Cafè du Monde French Market (est 1862) was ba","useful":13,"cool":14},"ZiWQRSzrisgQt4njY2Pq4A":{"text":"An institution - quick service, delicious coffee and fresh beignet. I recommend coming her","useful":0,"cool":0},"vl-h58d1A-2i-gWQ0CL3wg":{"text":"Cafe du Monde is a powder sugar fried dough absolute perfect disaster and oh man how much ","useful":0,"cool":0},"1Oabcpf8LkY49BHGAWSczw":{"text":"off my bucket list . This was one of the very first places I visited and I woke up super e","useful":0,"cool":0},"mfeqbSEjsEYHP2JOt2EdrA":{"text":"Obviously the beignets are amazing! My husband really liked the chicory coffee, too. So lo","useful":1,"cool":1},"l4CQivgF0p86kJtGgMg1xA":{"text":"Yeah, this place is excellent. Can't beat those beignets and either hot or frozen coffee. ","useful":2,"cool":2},"cvBOU09LPhMJv2noaZo8IQ":{"text":"Very good place for beignets! Gets busy during nights. Make sure you bring cash because cr","useful":0,"cool":0},"NODWCFaKdMtFJUrOCwz4gg":{"text":"Such a great spot! This was our first stop in NOLA and truly captured the spirit of the ci","useful":0,"cool":0},"dy7e6X-Dd3-7BJ_JBAkisw":{"text":"Wow. Im total contrast to John's review I have a story of honesty to tell. \n\nI went to Caf","useful":0,"cool":0},"LZJ-m04voC1qA2p_G7bREQ":{"text":"For 60 years I have loved this NOLA institution.   Today it is filthy.  Beignets in a bag.","useful":0,"cool":0},"J5GVbDBn97COAmeJJRdn3Q":{"text":"I mean really what is there to say that has not been said.  This was the first stop like m","useful":0,"cool":0},"Dg-EEqB4jHatHnxD01X0VQ":{"text":"Little tip: You don't have to line up to get into the restaurant. Just find your way into ","useful":0,"cool":0},"U4pmxVAUD_Z42bdAX-bRzg":{"text":"You cannot come to NOLA without visiting this iconic establishment. What tops fresh fried ","useful":1,"cool":1},"yV_VFF2hEYj1YNniyqNeMw":{"text":"My husband just wrote a review that said that these beignets were forgettable, but honestl","useful":0,"cool":0},"7ai2C4p9NMcUEozHcrM6lw":{"text":"We had to see what the hype was on this local popular dessert beignets. Parking spots are ","useful":1,"cool":1},"_ci0jV5MA7SFgZmryatOLA":{"text":"Pros: Line went by fairly quickly. Staff wore masks & gloves. Outdoor seating. Fairly pric","useful":0,"cool":0},"NOndJNm9wZiULHXouSTg8Q":{"text":"Must stop for anyone visiting New Orleans. This place is an experience not just a place fo","useful":0,"cool":0},"H6j-iKYU1PRWxBOba9Uerw":{"text":"I think we may have gone there on an \"off\" day....first there was a long line...which appa","useful":0,"cool":0},"aKhkpzmLSqug8nxAL7DSpA":{"text":"STAY AT HOME, EVERYONE. FLATTEN THE CURVE!!! AND DON'T DRINK/INJECT BLEACH INTO YOURSELF.\n","useful":0,"cool":1},"yO4AfNttM6sHeYkaJi5D1w":{"text":"Great Cafe and Patisserie! Worth the walk through the old town neighborhood, and only a fe","useful":0,"cool":0},"iAZ7KOCqgxOUpd6JF_6HpQ":{"text":"Ok so the place is a mess, the service is fast but not personable and it only 1 thing to e","useful":0,"cool":0},"BPgeg92GzGG4_ocRz2ZDjw":{"text":"Upon arrival, no one approached us nor directed us to sit anywhere. We looked like lost sh","useful":0,"cool":0},"WjgWX3GxmFQ9nPdT6-Ne9w":{"text":"Best beignets in New Orleans. Finish it off with a cafe au lait. Great for a quick bite. S","useful":0,"cool":0},"aQE9bFsFZ43eXHWE9j9J6w":{"text":"I went around mid afternoon on a Saturday. There was a line but it moved very fast. You ne","useful":0,"cool":0},"EXFDTDJ8kme7xDqp7LZJEw":{"text":"Let's be real we all know what you're going here for. They're really freaking good that's ","useful":0,"cool":0},"In_kPxKc77xIcRL_RAmqfg":{"text":"Super fun place. Definitely worth going at least once. Probably worth going lots of times ","useful":0,"cool":0},"g_GAa6eWQs-hM18bIm1aeA":{"text":"If you visit NOLA without coming here, you didn't really visit NOLA! This is really a NOLA","useful":1,"cool":1},"mJtyWm22DlU4bW8_vCgXpQ":{"text":"They call them Heaven's Pillow  the one and only beignet from Cafe Du Monde\n#foodie #veggi","useful":0,"cool":0},"XxfwRWG8SgvDDzs3-ABKqg":{"text":"It was one of my best, under-thought moments!\n\nI decided to leave FL at about 530pm and dr","useful":0,"cool":0},"5Pyp9FKnWpXV3jB2FdmzxQ":{"text":"As I remember it. Had the hot cocoa and beignets. Too much powered sugar but tasted yummy.","useful":0,"cool":0},"UMPsDjZZHIOZ-rezDQQoWQ":{"text":"Of course you have to go.   Coffee has chicory and beignets are covered in white sugar.   ","useful":5,"cool":4},"W0OecRcQOzczbTBaw1lKhg":{"text":"Some of the best beignets and fresh out of the fryer coated in powdered sugar with a café ","useful":0,"cool":0},"mQGrfiIxHOU7MAqpdkApMw":{"text":"There's not much to add to the reviews here.  It's excellent and by far the best beignets ","useful":2,"cool":1},"klCDwYn65lYpp3DBsxnGiQ":{"text":"The place certainly lived up to the hype. We went at 6:00 in a rainy Thursday morning so n","useful":0,"cool":0},"ANrX2dM0mn7oEdYGnYdHwQ":{"text":"A New Orleans staple that everyone should visit at least once! We went on Memorial Day, so","useful":0,"cool":0},"yn_hYnO4yU6TrlgU1vD43g":{"text":"This place has to get 5 stars period.  This a MUST DO if you're in town.  All they have he","useful":0,"cool":0},"9uj8OVQckG07JpBzJaAwQg":{"text":"Absolutely deserving of its stellar reputation. The line moves extremely fast and the beig","useful":0,"cool":0},"EInhbVHq96SIHr_Ib-rBjQ":{"text":"Counted about 70  outside tables. Estimating each spend 20 minutes average there, that's 2","useful":0,"cool":0},"uf6hCHlcjCed2y34Uoa12w":{"text":"All I have to say is WOW. Thank god we don't have this in Los Angeles. I'd definitely have","useful":0,"cool":0},"QlxCHB2iwSscSgu1S0d0wQ":{"text":"First stop post landing in New Orleans. Last stop on our last night in New Orleans. Absolu","useful":1,"cool":0},"QIhfIAkUvutrjtk6bOax8w":{"text":"The best thing I've ever tasted! Learning about the history of New Orleans and getting to ","useful":0,"cool":0},"vexrqO6W5YDFvfZjyegv0w":{"text":"Best beignet in New Orleans. Boom. \n\nThat's all I would have said but Yelp says my review ","useful":0,"cool":0},"Kmx9pCF3vj2HytoL8Tn_Yg":{"text":"A MUST STOP! We came here around noon and the place was packed! we decided to stay and sit","useful":2,"cool":4},"oJ_J0lRvFYb7GW4pz_Xgag":{"text":"This is a NOLA tradition for a reason. The service is short and sweet! Bring cash though-t","useful":0,"cool":0},"tdSfaXIy_QTFGjGZABlQqg":{"text":"During my 4 day stay in New Orleans I went to Cafe Du Monde 4 times. It's open 24/7 and th","useful":0,"cool":0},"cHpoTmOAoCDztTO0UGvnaA":{"text":"Yummy , can you say anything else? If you don't do anything else make it here\nCafe Du Mond","useful":0,"cool":0},"wOuuneXI8gS6RHLBft9FTQ":{"text":"What more is there to say about this place? I've visited NOLA multiple times now and each ","useful":2,"cool":2},"qB7Zi5fVGv5SiQcwNX4iTA":{"text":"Perfect experience, despite COVID.  They have really figured out how to streamline and ada","useful":0,"cool":0},"oJ5iqRnunZSbFgr2YW7tjw":{"text":"For years, I visited NOLA 3-5 times per year. During my first visit, I went to Cafe du Mon","useful":1,"cool":0},"uTnYO3OZ75-_oDER3ltMVQ":{"text":"I think I'm one of the only people I know that is not raving about cafe du Monde. I found ","useful":0,"cool":0},"RFtEMGA-plN1SFR37BN5UA":{"text":"WTF Yelp?\n\nI begin my review this way because CDM was one of my first reviews when I joine","useful":12,"cool":8},"Yuu0EocNf4TbOqw5CB0NIw":{"text":"This Cafe Du Monde is just like all the others. Great coffee and beignets. Cannot beat Caf","useful":4,"cool":2},"hPkdrdpzF9cWx1J-YXTJjQ":{"text":"I sort of feel silly writing a review of this legendary place. i'll just concentrate on ti","useful":3,"cool":2},"YTQdC3ZrOo8JyTVcnUyPeQ":{"text":"Always a great experience. the beignets were fresh and soft. just enough powdered sugar. t","useful":0,"cool":0},"3h6_EXqr-w1hasLhLRF6pA":{"text":"These babies were not disappointing. Lots of powder sugar and the inside was nice and chew","useful":0,"cool":0},"ccbYRVw-BPpjl7qCOZwYNw":{"text":"Cafe Du Monde is what I look forward to when I go to New Orleans. The place is a chaotic m","useful":0,"cool":0},"7vbZhl0dBbwU025wPRuwEg":{"text":"Staple in New Orleans, I am from here and haven't been there in a while. Always a good tim","useful":0,"cool":0},"vsZRGVuqgOZ1uVkrDJYhJg":{"text":"Great beignet's and coffee. Extremely crowded and the sit down service absolutely sucks. C","useful":0,"cool":0},"yPEBiFBVDsn_D8b1bh5nOg":{"text":"I think the beignets here are bit overhyped. It wasn't as pillowy and light as people clai","useful":0,"cool":0},"8TJGYHv7rqK9l7DQvJS1sQ":{"text":"Perhaps my expectations were much higher after hearing and reading so many positive review","useful":3,"cool":1},"vvmMc8FwzLZ_DgB3RL4fNA":{"text":"Post Katrina. This place has gone to HELL in a hand-basket. Totally a place to go to to sa","useful":3,"cool":1},"p5nKzYd0svsisfomdrzolQ":{"text":"What can we say about this place?! This is a staple of the city! A must go! The only place","useful":1,"cool":1},"Q2InSAWf4hjFSuubd4oEMw":{"text":"Why even review? Everyone already knows that this is an absolute MUST while in New Orleans","useful":0,"cool":0},"gemcVmtNb0SxgdSwvYs4UQ":{"text":"Maybe the other locations are better, but we went to the location that's been there 100+ y","useful":0,"cool":0},"_ko5QYurCcnjg42GOzwpog":{"text":"Went to New Orleans for a work event for the Mardi gras convention. \n\nDefinitely had to vi","useful":1,"cool":0},"TI_5H_LlXMuG2I_BOyWfbw":{"text":"Super long lines by ut goes by so fast!!  Beignets were great and paired nicely with hot c","useful":0,"cool":0},"MHOKfJyH51uBDoY8WpRrOA":{"text":"We lucked out and got in right away at noon on a Monday.  No lines. Must have been because","useful":0,"cool":0},"Two920BOb4X2dPwSlaUe8Q":{"text":"What's all the hype about!? Basically its funnel cakes, dirty tables, and crowds. No crowd","useful":0,"cool":0},"crjq6je7GGXmYID3B9QI5g":{"text":"Never miss a visit when in New Orleans. This last week visited twice even though the lines","useful":0,"cool":0},"nbGiAvyubTArKwhyv704mQ":{"text":"Cafe du Monde has been told to be THE place to go while visiting New Orleans. I was given ","useful":0,"cool":0},"89axuQl-Lovhya2sPLXLfQ":{"text":"AMAZING! Must go! The line can look intimidating but It goes very quick! The beignets are ","useful":0,"cool":0},"pB0CVruLecEaB7vJ8MyMdg":{"text":"Of course Cafe Du Monde is getting five stars!  Why wouldn't it?  \n\nA legendary beignet sp","useful":19,"cool":13},"3816-MNK-6HzNJpPqQuTGw":{"text":"Yum! Basically a fried pastry topped with mountains of powdered sugar! This is located som","useful":1,"cool":1},"D5LQ_-wx4KxXgUReQ57RgA":{"text":"What's better than getting beignets after a wild night out on Bourbon street?!?! Nothing! ","useful":0,"cool":0},"6z3BYQSZpmBSa33CQZ8vWw":{"text":"Fluffy clouds from the heavens that came to greet man on earth!!!!!!\n\nTIP for you amazing ","useful":0,"cool":0},"O3K78flp5hvphqAv0athcw":{"text":"Amazing beignets, a classic favorite among locals and travelers. Do not forget to bring ca","useful":0,"cool":0},"fAz7Pz-diHpll7-N8l081A":{"text":"Tourist Trap?  Maybe.\n\nBut definitely a unique experience, great for New Orleans people wa","useful":1,"cool":1},"Qt0OPLzLBje858rIneFsvw":{"text":"This is the WORST COFFEE I have ever tasted.....it was much like dirty dishwater and did n","useful":3,"cool":2},"Oif7-ip70lqrb0AwcAggvQ":{"text":"I paid my obligatory visit while in the French Quarter to get beignets and cafe au lait bu","useful":0,"cool":0},"4rzvAf2ljkPI-Pkq3tg7yA":{"text":"Great beignets and great service! Good as usual!! Make sure you have cash!! And I would we","useful":0,"cool":0},"3sWaCHfX72SmGMR12EUfhg":{"text":"A mandatory stop in NOLA! The beignets are fresh and taste amazing. I would recommend it t","useful":0,"cool":0},"-J1qQ-J34YcEGMky74s2uQ":{"text":"When you walk up and see a line a couple blocks long, it can be intimidating.   But, for t","useful":0,"cool":0},"_Tv50h74oidoa0O9G41jgw":{"text":"Worst beignets ever. Tough and lumpy. No longer the gold standard of beignets. They did co","useful":1,"cool":0},"OjX10i07SxTmAPAHjkp45w":{"text":"Love it! Was on a business trip and stopped by for a sweet treat. So delicious! Great expe","useful":0,"cool":0},"7Ock2BnvrBpJwTpF9MxaQQ":{"text":"Finally got to the experience the famous cafe du monde. There is a line to wait for the fo","useful":0,"cool":0},"lKxeIBYdmV4rCybSvthwOQ":{"text":"Not the place to go if you hate tourists, but very solid beignets and coffee for a very ch","useful":0,"cool":0},"_5YTWQl1czoSDAipKS6ngA":{"text":"I know, most people would call Cafe Du Monde a tourist trap that's not worth it, but I who","useful":3,"cool":3},"aR8mTHv4ms0F-xirr8UJtg":{"text":"Stayed at New Orleans a few days for  business trip and Cafe Du Monde was one of the must-","useful":0,"cool":0},"viSI106Y3l5PFEbICeshbw":{"text":"Wonderful beignets!! We drive through a tropical storm to get some, and it was worth it!!","useful":0,"cool":0},"N1F3kxq79a4-3eIpHLW5TA":{"text":"I know the French Quarter location feels like the one you \"have to go to\" when you're in N","useful":1,"cool":0},"OX6-QhDUoOEkGvW32RevaA":{"text":"A New Orleans tourist standard but visit once and that's all you need. I've been a few tim","useful":2,"cool":0},"-u2kLoO5yv6EvEqEi202zQ":{"text":"Slightly over rated for all the high reviews, but location is great and I guess it is just","useful":9,"cool":8},"pBRFgqvwG26f1ynVi22g5w":{"text":"This is our first time ever in New Orleans. It is packed (as to be expected from what I've","useful":0,"cool":0},"PFcCUnsBg7TtNyFyVbUj2g":{"text":"What can I say about Café Du Monde that hasn't already been said? It's a must-do in NOLA a","useful":2,"cool":1},"i3o86OeJUV31RxC5UETpEA":{"text":"Beignets and Coffee! (Get Cafe au Lait) \n\nLong lines most of the time, but a must for the ","useful":0,"cool":0},"fEp7wNIEig-z5_mqgVw0AA":{"text":"All the locals go to this one since Morning Call got closed down by the mafia lol. Good fo","useful":0,"cool":0},"eAsMtA3ijObElIq3FWfVYw":{"text":"Cafe au Lait and beniets at cafe du monde is the closest to european quality artisanship I","useful":0,"cool":0},"gYXr2F594Jom4n4PTwA6xw":{"text":"Okay, okay. I know everyone cones here and posts their reviews and the obvious response is","useful":0,"cool":0},"55BJqA6B20efoinzzO6zaA":{"text":"Always my first stop after arriving on an early flight! Chicory coffee and beignets! Beign","useful":0,"cool":0},"0qecBNcPYYt3mZb3-3P1eQ":{"text":"Eat when it's hot with cafe au lait...the BEST I've had, other places try but it doesn't c","useful":0,"cool":0},"7WGC2BkjkQTdJAeUciMv4A":{"text":"Beignets and coffee - that's the menu. Simple and delicious  . There was a line but it mov","useful":0,"cool":0},"H8Yd8fuRHcWgdCxYDFTQUQ":{"text":"Visit occurred in February 2020:\n\nEveryone talks about Cafe Du Monde, so we had to make a ","useful":0,"cool":0},"tR-Z7lN6rSyhnWQ2lSYrOg":{"text":"It was our first stop after arriving at 9am, my friends got me onto a trolley and we were ","useful":2,"cool":2},"AwpZ1hY_xtbxSZCyQf8yzw":{"text":"The coffee was really good! The beignets were good they come in three and I prefer to dip ","useful":0,"cool":0},"ldXYIalWzItw33STNZ_d-g":{"text":"I don't understand the hype.  What we got may technically be a beignet, I guess.  I would ","useful":0,"cool":0},"u9FFN73EHJa-dyMqOs3xeA":{"text":"Madly in love with this spot! Super delicious Beignets! Coffee is STRONG, perfect for anyo","useful":0,"cool":0},"B52MQ572HZCc0bq2NjLDbw":{"text":"Amazing as usual. Passing through for a couple days and this one is always a must stop. Th","useful":0,"cool":0},"TjVHHPbd4RCE8u_qiU0MAw":{"text":"Simple obedient and menu. Really good beignets. Loved how thick they were. I thought they ","useful":0,"cool":0},"qZfBfzgYxUqPf2k4yCbbGQ":{"text":"Yes this place is worth going to - I didn't try any other sweet beignet when I was here. W","useful":3,"cool":3},"MHw0MECpjS6y6WQWfGzM-A":{"text":"Classic place to get beignets, right? Went on a weekend, so there was a line, but usually ","useful":0,"cool":0},"ALZ9xfJWDLkCAzh9TjJXrw":{"text":"If you're in New Orleans you have to make a stop at Cafe Du Monde for a cup of coffee and ","useful":0,"cool":0},"MwP8ARMzQJTji200YjZdUg":{"text":"I attended a conference in New Orleans and visited some family while I was there. My cousi","useful":0,"cool":0},"SiV9hFsqXxvANML9wStAAA":{"text":"This has been a must-stop tradition since my first visit to NOLA many moons ago.  Still go","useful":0,"cool":0},"9TL0OtIIf2baicFedZDpVw":{"text":"There's a special burden for famous tourist destinations to live up to their hype or forev","useful":15,"cool":15},"UZhtnMj_jQVgAmEhgQ3b7g":{"text":"What a nice experience I had a café Du Monde! Grab lend some coffee & pastries Outside and","useful":0,"cool":0},"1tfKrXGUKrc2iGNqJO9STg":{"text":"This is an overrated local institution-cum-tourist trap if I ever saw one. Coffee is only ","useful":2,"cool":0},"eFIqpT9GqqxNrIpGBcY9Dg":{"text":"WAY OVER HYPED! \nI was told \"it's a must when you go to Nola!\" Well...we waited in waaaaay","useful":1,"cool":1},"Ynub5HQd-JgSUl-nhkZt0g":{"text":"I LOVE this place!! The charm isn't the same in these times but can't beat a good beignet ","useful":0,"cool":0},"1s-Eq072HKCpI3MWabg4gQ":{"text":"My friends and I stopped here on our way to a meeting. There was a very long line so we we","useful":0,"cool":0},"I97VOS2CuHHD2ArkXL5FFg":{"text":"So good!! There was a long line but that's to be expected on a Saturday night. They were v","useful":0,"cool":0},"tZqdEmXWCm2VfvLGKZtAEw":{"text":"The cafe is incredibly busy so check wait times before  you go!!! The beignets are their s","useful":4,"cool":0},"fmNHRgLKnCw1qu_uOrcRqg":{"text":"It's just one of those must-visit places when you're in New Orleans! It was lovely to sit ","useful":0,"cool":0},"ybSEarNWjd1CvB26xlfUIg":{"text":"Came to this place, as it was highly recommended, only to be taken completely aback by the","useful":0,"cool":0},"l8lUMtnFFjVzlGVCoIi5Rg":{"text":"Does this place need a review? \n\nFind a table and wait for your server to take your order ","useful":1,"cool":1},"HEQgY8a3Fu-VjTE_y2RGfQ":{"text":"Definite my coming back again at some point in the future. The place is lively and full of","useful":1,"cool":1},"A_88O3qFsM2yI3vJHpQKWg":{"text":"It's touristy, it's cash-only, there's no AC, but when you're in NOLA you must visit this ","useful":0,"cool":0},"Q2YQyKnZmkG4bYjrT69oSg":{"text":"Unfortunately, not my type of eatery. Dirty with pigeons flying right over your head. We w","useful":0,"cool":0},"sfvAsi5KVy9pZf85ZB5PaA":{"text":"I went to the smaller site in  City park. The service was excellent. The beignets were goo","useful":0,"cool":0},"86wmDHV39t6BIDxb68i_Lg":{"text":"Amazing beignets and cafe au lait. Long lines but they move quickly. Great value for money","useful":0,"cool":0},"a12jo3gJEzp904JVB80-Cw":{"text":"All I have to say is it's soooooo good I want to cry . Bring cash and good luck not gettin","useful":2,"cool":2},"YA308Y1Tmu-ue6OIuEwsLQ":{"text":"They've been here for over a century because their beignets and coffee are consistently go","useful":1,"cool":0},"3t9ZLqnp4rQTgPjO73Xweg":{"text":"How can you come to New Orleans and not come to Cafe du Monde? As touristy as it is, I lov","useful":6,"cool":7},"fceDlMyd4m_yvPRYobeNSw":{"text":"All the hype. I was underwhelmed by these flavourless greasy balls of dough covered in pow","useful":1,"cool":0},"Ia16VuKrdFwwYDqeKj2LlA":{"text":"Warm, covered in powdered sugar and greasy beignet! Frozen coffee was a nice treat. A bit ","useful":1,"cool":1},"do2wK1fg85FT0QW9Zu8RNA":{"text":"Soooo, I went on a weekday right when they opened in hopes that the line wouldn't be too l","useful":2,"cool":1},"1hdJkwfg9AX4Vl47gQA-og":{"text":"Okay experience - enjoyed the street performer singing right in front of the patio tables,","useful":1,"cool":1},"MbPSKB_qnPkvofqWxyTufA":{"text":"I was in town for Mardi Gras pre-COVID and came upon this place on accident while explorin","useful":1,"cool":1},"mxqsh8ts8UICZ7EFBjiMgw":{"text":"BEIGNETS BEIGNETS BEIGNETS. The line can get pretty long, especially during the daytime on","useful":0,"cool":3},"5BiR7A2YUg3E8yniRn-Fng":{"text":"The line outside looks super long, but let me tell you, it moves FAST! \nBenigets and coffe","useful":0,"cool":0},"xAeZpkFuRGn7G8RcvFeL3w":{"text":"Best donut in the world, bar none. Coffee's great also. Of course I'm a homer, NOLA is my ","useful":0,"cool":0},"aDJQoa4zqyP9q7J57Vepqg":{"text":"This place has ruined all other beignets for me. Every time I'm in NOLA I always go to Caf","useful":1,"cool":1},"gF9qBRWr3ygErTcQXElwPw":{"text":"I've been to Cafe Du Monde a few times and so glad they opened back up (covid times).\n\nThe","useful":0,"cool":0},"EhyazToRNEb3XmOp5CWAng":{"text":"Only taking cash right now (during COVID) but the beignets and coffee were still pretty gr","useful":0,"cool":0},"gN1MIDqz01EGIo9LdNMCyg":{"text":"Not much else to write about this place other than the fact that it's a historical landmar","useful":0,"cool":0},"gF1zOL3QHzWl26Bv2kXzQg":{"text":"Yummy pastries for breakfast and coffee, line was long but that's expected as it is a tour","useful":0,"cool":0},"_mcj0p3jHt36TueXJwn10w":{"text":"The beignets were good but not sure if it's living up to its hype. The line was long and s","useful":0,"cool":0},"BvLc5w2djxWPg9xPerlKtA":{"text":"I thought their beignet was fantastic.  I can't comment on the taste on coffee because I c","useful":1,"cool":0},"AhizIYGPXMTNTGV3tiW6zg":{"text":"Beignets were absolutely delicious, but the coffee was a little blah. The staff also didn'","useful":1,"cool":1},"qC4JI0utkbAGTYTYsu35LA":{"text":"Over-hyped place. The beignets were tiny and doughy. There are much better ones on other p","useful":0,"cool":0},"7yUK_Wyv_9m4eTbu8NSZow":{"text":"This place is a must visit when coming to NOLA. You do have to pay with cash, but the serv","useful":1,"cool":1},"5kf_lQS2ij_SkLUjntvAxA":{"text":"Amazing!!! The beignets were of course so great and I got a frozen iced coffee and it was ","useful":0,"cool":0},"VxSdLCyosF7SGSHkbsLXcQ":{"text":"While in NOLA we were told this spot was a must do! So we travelled in the heat to get the","useful":2,"cool":2},"K5J2gm0r8qEGSxy01B9CSA":{"text":"We knew before going that it was cash only and that if we saw a table open to sit, even if","useful":0,"cool":0},"o2C7OS1XW1xCGTaVrixNPA":{"text":"Cafe du monde is a must when you are in New Orleans. I've been to several locations in the","useful":2,"cool":2},"dzcyvl5oZr3y4aCWwQdhhw":{"text":"Perhaps my expectations were too high?  I fell in love with beignets a few years ago and h","useful":0,"cool":1},"mU7_33WnG05Bpb6tX7InGA":{"text":"This place was the most anticipated stop for me. There is a beignet truck here in Michigan","useful":0,"cool":0},"j7MOPYuKWWkJlUFl-4ZF7g":{"text":"Good but really sugary. This is a place that is worth going to understand what NOLA beigne","useful":0,"cool":0},"YfY6hg5FrvJhqO4HGIlgIQ":{"text":"I don't even have to say a word about this place. Its a classic, worth all the hype. \nBeig","useful":0,"cool":0},"UEBBpW4R_bvrYCgpbKPomw":{"text":"First time in New Orleans and trying a beignet was the first thing on my to do list. I hea","useful":0,"cool":0},"Icf6g7XX4D3bYkcEsl59iA":{"text":"Beignets are worth every calorie!   We tried the Cafe Au Lait coffee this time and it was ","useful":2,"cool":0},"R2Oc-h-INHTYKINPboPBzQ":{"text":"This place is legendary but it's actually very simple. No matter what time of day or night","useful":5,"cool":3},"q6xwXmOdn0qniovr1ZZ_aQ":{"text":"Do you really need a review to tell you to go to cafe du Monde? Since you're here just kno","useful":0,"cool":0},"R5FdcUJJuTMnjvmuMxGwIw":{"text":"Aweful!! I hate to write this as This place was a MUST while I was here in Nawlins!! The B","useful":0,"cool":0},"r8iRgLcHnS-2RhGvuVajAQ":{"text":"Ok since we were in New Orleans, we were told to try this place.  Coffee, hot/frozen, and ","useful":0,"cool":0},"1sjsyETsT3a51X9kxi4sng":{"text":"It's a New Orleans Classic!!! Yummy and sweet and hot...donut like little squares with pow","useful":0,"cool":0},"r_wGKvXPnxgPT9ZXb4MQvQ":{"text":"This is place is a great way to start, take a break and people watch, to ending the night!","useful":0,"cool":0},"33mrSnpXPlO_KvBIqtZt2g":{"text":"GET THE PAPER HATS!\n\nWe loved it here! The workers are friendly and attentive. You find a ","useful":3,"cool":3},"ov80-v_e8D0-59ijytYouQ":{"text":"AmaZing beignets! The coffee was gross, but I'm a person that loves high quality coffee an","useful":0,"cool":0},"WyzlM3_-ApngWQEZyQIiQg":{"text":"What's not to say about this place? It is always fast and fabulous. We thoroughly enjoyed ","useful":0,"cool":0},"UemD_oVKhKuM1vUAulbaLg":{"text":"This place lives up to all the hype. It's the most famous place in New Orleans and usually","useful":5,"cool":4},"0rRWALthqVj4XLSa6v49-Q":{"text":"You can't go to NOLA without stopping here.  Beignets are fresh and hot and come tons of p","useful":0,"cool":0},"AhXG1LVbxWZCCqAVzufOdA":{"text":"First time in New Orleans and I definitely had to try some Beignets, once arriving at the ","useful":0,"cool":0},"982y4UESf3nttgOL0U6Dpg":{"text":"Beignets were a perfect little treat for an afternoon snack! Yum-E!! Lines are long, but s","useful":0,"cool":0},"36LMNnK2JCzdjfsD_3JZvQ":{"text":"A must when coming here. This place is open 24 hours and since it's so popular you might h","useful":1,"cool":2},"DgHHjCMcBA9HJnS2cd83aA":{"text":"I was told by every person that knew I was visiting NOLA to stop here for beignets.  So, n","useful":2,"cool":2},"Rh_g1-MJeuG7_-yde4wnxA":{"text":"We came because it is Cafe du Monde. The place is chaos. We seated ourselves inside becaus","useful":1,"cool":0},"GMvIl_3uiqMOEF9sw39wOw":{"text":"Amazing coffee, even better beignets. World famous for a reason. That coffee really gives ","useful":0,"cool":0},"yJ_ptRJN0i5EB41m-lyeWQ":{"text":"Absolutely incredible! When we got their the line was super long, but it moves super fast ","useful":0,"cool":0},"kpQvWYJDOPA_DUg1pqGV8A":{"text":"SUCH a tourist trap. I've been here 4-5 times in my life over 25 years, and this is not th","useful":0,"cool":0},"NaVMtVtIq07eUrIMkMZvaQ":{"text":"Not sure why this is so popular. Tastes like a super dense donut with powdered sugar...cou","useful":0,"cool":0},"IaPivPWewRi7fTQXpUXjRQ":{"text":"I must have a different palette. This was not the best ever to me. The beignets upset my s","useful":1,"cool":1},"I7xAb8T65wwrcvkdr8x19w":{"text":"Ummm they're fine? Nothing to write home about? Idk... they're basically hand held funnel ","useful":0,"cool":0},"W5hnQNKsvOFPAo_WpR30Aw":{"text":"Incredible! I love dark coffee and was blown away by theirs. I was asking the staff what t","useful":0,"cool":0},"llpOjTuXw2K48wFaTsjLOA":{"text":"I've waited a long time to try a Beignet from the famed Café Du Monde, and they did not di","useful":0,"cool":0},"i8cCwTsTTkMCHeiQqGDwYg":{"text":"This place lives up to its name! When you say NOLA you think Cafe Du Monde! I was a little","useful":0,"cool":0},"aqlb_fd5pU4ike5lhXw32A":{"text":"It is such a great place to stop for a bit when you are going and going in New Orleans!  G","useful":0,"cool":0},"uZF1i3AEc-7JrQnmLqQ-lg":{"text":"This was my 5th visit to New Orleans and my first visit here. I loved the outdoor café sea","useful":1,"cool":0},"O7w0lXcYOCE4HKXFHFAK9A":{"text":"Wow! Delicious.  We first tried Cafe Beignet and did not like the beignet. We decided to g","useful":0,"cool":0},"2ZDbd-HeUIPj6J-wgFCWHA":{"text":"Had to stop by my favorite place before leaving a short weekend in New Orleans.  The lines","useful":0,"cool":1},"FqIC0YCCNo_scNRoR3Kb9A":{"text":"This is a historical place with a huge fan base. The French donut beignets is not that goo","useful":0,"cool":0},"-2JrcZR_7efW8uRArLsHXw":{"text":"One of the top touristy things to do on my list, visiting Café du Monde was everything I e","useful":0,"cool":1},"xztNYAOgzwfTc4_oFM3ALA":{"text":"Delicious, they except cash only and you have to seat yourself. The experience of being th","useful":0,"cool":0},"mZKObagni9dChq1Q2WR_dQ":{"text":"Beignets were warm and moth watering! Reminded me of my childhood. Service was fast and fr","useful":0,"cool":0},"WNnv6cVy9i2YlddIlgvI2A":{"text":"Amazing cute spot for beignets. My friend and I came here twice, that's how good they are!","useful":0,"cool":1},"GruT_NhmI-gy9sek9qgYdA":{"text":"Their cafe au lait was so delish. I like my coffee just coffee and milk. It's smooth and n","useful":1,"cool":1},"DJcjllvYpOGi2iWVqQBBaw":{"text":"The only reason I gave this a 3 star is because the beignets are now served in bags and ge","useful":0,"cool":0},"cOgAoCaw0Q2rEz09jHc_rQ":{"text":"You don't need my review to know that this is a must when in New Orleans for good beignets","useful":1,"cool":0},"a71tZFFj92WoLPak8aZHWA":{"text":"Simply all that I imagined and then some! The Beignets were incredible! \n\nWe went to the l","useful":0,"cool":0},"ATqt6AyeL8fzTbGHsohZcw":{"text":"Really good coffee and beignets! I recommend coming here during the evening hours or after","useful":0,"cool":0},"Xiwrnt13Mi_AISD0VEGiPQ":{"text":"A great way to start the morning when in NOLA would be to stop by Cafe Du Monde for some B","useful":0,"cool":0},"arMHZUTqPJzfUXj_yqz6Dw":{"text":"I may not be from here originally and I may not have known what the hell chicory coffee wa","useful":1,"cool":0},"ifub-GdA7F9Bevkjf3R0sg":{"text":"If you are a sucker for tourist attraction like myself who fly all the way from Vancouver ","useful":0,"cool":0},"pU_JruOBAJ4CesDdiwKcMg":{"text":"Overhyped but a must go in new orleans for some reason. Okay it's good but not amazing goo","useful":0,"cool":0},"Fh1bm9vInl4FKqdxFweeXA":{"text":"Haven't been here for 40+ years BUT it is every bit as good as I remember! (And pls don't ","useful":0,"cool":0},"8aHSrklF8CUq9_JYiWuvVQ":{"text":"Café du Monde is always a must when in New Orleans. The beignets are perfect! My children ","useful":0,"cool":1},"x5eS8guQ2-iOOiM2IsifEA":{"text":"It's nothing special. Like I get it's beignets and that's hyped, but it's just dough. It's","useful":0,"cool":0},"sjRbtzRzJQsufCLAMDB2yw":{"text":"Coffee was delicious and the beignets are a must to try. A must stop when in the French qu","useful":0,"cool":0},"gugxrq7NdgJsCgl7-bBVVg":{"text":"Absolutely pleasant place located in a prime location in New Orleans. The pastries were ve","useful":0,"cool":0},"qhWwhmzXRflUNZBJkwhOkQ":{"text":"How can you come to New Orleans and not visit Cafe Du Monde. They make the   best Beignets","useful":0,"cool":0},"yn_LdrQPge440fMN8fELtw":{"text":"Yummy treat!! We would love to have this in MN. I would get the hot coffee though instead ","useful":0,"cool":0},"gTpthSQoKpltoi9JJACxxA":{"text":"Delicious! We had the beignets and hot cocoa on a rainy day. The service was quick and pri","useful":0,"cool":1},"M9BjPrNm9fFv3JAziAcjGA":{"text":"I mean come on a review isn't really necessary. You already know its gonna be fuego. But i","useful":0,"cool":0},"YmXmet1RSmQJZcZjTlFnoA":{"text":"I am absolutely obsessed with this place. Disclaimer: I do not like funnel cake or doughnu","useful":1,"cool":0},"OfbUhborQOgcOdKkY0a6Pw":{"text":"A New Orleans è una tappa quasi dovuta, il famoso bar si trova nel quartiere francese. Cat","useful":0,"cool":0},"JGIJrYyacHbg-Oh4IOfBIA":{"text":"Got to experience the famous Cafe du Monde! It was a rainy day and that didn't stop we cus","useful":2,"cool":2},"R7eyOfAFMhEysTetu_WZcg":{"text":"Rude workers. \nLong Lines.\nOverpriced coffee.\nSoggy Beignets.\n\n\nMeh.\n\nGo to Cafe Beignet i","useful":2,"cool":1},"Lf4U8I5OpdBTtIM0csVw4A":{"text":"Go early on a weekday prior to opening and grab a seat.  They have this system down like a","useful":0,"cool":0},"SwSxzmKhEtp2_j4tAONtxQ":{"text":"All it's cracked up to be. I promise. Wait in the line. It's worth it and it moves quickly","useful":2,"cool":0},"ZYWBTh3ySToe52YxTGmuYw":{"text":"Delish. Not a dessert person but this was def worth the hype. Not good when it's cooled do","useful":0,"cool":0},"sC3jASBhAhselGbzTQKgVQ":{"text":"Great beignets 3 for $3.40. Make sure to bring cash.\nSelf sitting, waiters are always nice","useful":0,"cool":0},"-4jUaBB-ynfMY0wni0t-_A":{"text":"After moving back to California, I was deprived of beignets for many, many years. I used t","useful":1,"cool":0},"tIIpFKnDdpslN53JmvlOAA":{"text":"Arrived pretty late in the evening, not expecting them to be open. But they're open 24 hou","useful":1,"cool":1},"xEIIDzX0Hn43D-6Ze1OYnQ":{"text":"I waited 30 minutes in this place to have a table bussed. I honestly do not understand wha","useful":0,"cool":0},"Ap0Wc9Tifmy3nT7MSRmRhw":{"text":"this is the only place to eat great food, the beignets are as good or maybe even better  t","useful":0,"cool":0},"LU9WK86kHnozOB3lVgA72w":{"text":"It's an institution! Gotta have at least once. Or in my case, three times! The beignets ar","useful":1,"cool":0},"KeRQL0zFBZMek6DVwNJRcA":{"text":"This place is a must! The Cafe Au Lait with a little powdered sugar and beignets are reall","useful":0,"cool":0},"-jQeMjJUJF55i7zIM-qI1Q":{"text":"Sugar sugar sugar and coffee its a must try place packed must do a zillion dollars here bu","useful":0,"cool":0},"AoaLzLTt4Y_KXYSIvjMxvQ":{"text":"Of course got the beignet and wow wow wow. So fluffy and wonderful. Really great. Greater ","useful":0,"cool":0},"HD7F-NY7Z4c_7PIeBuqIUQ":{"text":"We have never had a beignet before, so we have no standards to judge it by. But we sure lo","useful":0,"cool":0},"wLqH_BuzoAlGI36XvQVwgg":{"text":"It's a must when in NOLA. Late night snack of beignets And coffee at Cafe Du Monde. They s","useful":1,"cool":0},"sVYHKFce7B_3RhISHZNmEA":{"text":"Fried dough with extra icing sugar. Sorry, you are famous but very simple.  Too many beaut","useful":0,"cool":0},"ndA3pvxA-X4z3Vk1ww8S_Q":{"text":"get there early because it was very crowded but definitely worth the wait\nGreat little caf","useful":0,"cool":0},"iQTRYNW4zufYKCZlj5ogCg":{"text":"While your lines are very confusing... your beignets are everything a Midwesterner was loo","useful":2,"cool":0},"zM1MDZSIXY9bIxZgbtBAtg":{"text":"Beignets are soo good !! Highly recommended, this was our first stop since we landed as we","useful":0,"cool":0},"O2E4dGFdAflj7_swo53F3w":{"text":"One of the major tourist spots in NOLA. Your trip is not complete unless you stop by here.","useful":2,"cool":1},"sQbwplBE8u4MAJi4ZH6_hg":{"text":"I wanted authentic beignets and I was not disappointed.  For tourists this is a CASH ONLY","useful":0,"cool":0},"eXxBv49nSwfB1s4m5mhzvQ":{"text":"Don't waste your time. The beignets are prepared well in advance and packaged to accommoda","useful":0,"cool":0},"nYiJcr1A3fWdt6TawTkZSg":{"text":"The best Beignets ever !!! Miss them already and can't waiT to fly back to New Orleans and","useful":0,"cool":0},"qkxnVKJOQbrI62Dvr5XD5g":{"text":"A Great place and beignets are delicious-coffee was good and the boys liked the chocolate ","useful":0,"cool":0},"vT1I6j_OpcYf6CyRpyZrHQ":{"text":"Long wait which was expected. Beignets were not quite as good as the ones at cafe beignet.","useful":0,"cool":0},"56a1W8RYhn7nFLTmrgGX2w":{"text":"A must visit in New Orleans!! Fast service -great coffee and delicious beignets!! Also-the","useful":0,"cool":0},"IMC0VFun65_GD-RwbYOtsg":{"text":"After trying the boxed beignet mix gifted from family I knew I had to try the real thing. ","useful":0,"cool":1},"YrfgjrA0jQSmu9Ux8vMWuw":{"text":"Always make sure to hit this place when visiting NOLA. I have to remember next time that o","useful":0,"cool":0},"BHpG5fWQEVOue2sH7oUUlA":{"text":"Love to have some beignets and coffee. Even with a little bit COVID-19 still a good vibe a","useful":0,"cool":0},"cqvjxmvRSuCNHXFD3rtsbg":{"text":"I've been drinking this stuff most of my life, finally had a chance to visit the original ","useful":1,"cool":0},"aYk2KiyM40jJ104AMR5CHw":{"text":"The line at 11 am was approx 2 blocks long... the Togo yes Togo line was as busy... I deci","useful":0,"cool":0},"U_Z_FkOoHnGn33Q5XYC_ww":{"text":"Is it worth it? \n\nYes. \n\nThe beignets are worth multiple visits during your stay in NOLA. ","useful":2,"cool":1},"J-2rteyeiVD24obFxHVV4Q":{"text":"Had high hopes for this place because of all the hype. Even the locals say it's not the be","useful":0,"cool":0},"Y0KE1aX_uz2s49QSpnt-_w":{"text":"Got the frozen coffee and the World renowned Beignets! The coffee was surprisingly good. N","useful":1,"cool":1},"gO3hx09KRkM8aSmKJNKE6g":{"text":"Cafe Du Monde is always a must to visit when in town!  Due to Covid restrictions during th","useful":1,"cool":0},"UpxiFle-y8YO1jnwPYuTyQ":{"text":"Theese beignets are the bomb! I love love them! They are like donuts but much more bready ","useful":0,"cool":0},"NvGda8b5IHJvajAFPzCDHw":{"text":"Definitely did not meet my expectations. The taste of the beignets was decent, but nothing","useful":0,"cool":0},"OOp72ewobq7cEbleswCuqw":{"text":"Super crowded every time. Well worth the wait. Must go again soon. Could have some more si","useful":1,"cool":1},"KFCbOArNV1K5a-Q_VPJSHQ":{"text":"The better location of the two. Went to this one later at night and the beignets were some","useful":0,"cool":0},"Fnhkn1VDj6MfEQIN61yQRA":{"text":"The name speaks for itself long wait but it's also worth it.  They are open 24/7 so you ca","useful":1,"cool":0},"16hNfkMxH1j_VoUEm5HTOg":{"text":"Nice staff, great atmosphere. A ton of sugar!!! Great landmark. I went primarily to visit ","useful":0,"cool":0},"SFq23NDuKATyG2gJEqIZug":{"text":"There is now way I can go four stars. Yes it's good. But nothing great. Dang sure nothing ","useful":0,"cool":0},"zwNPfEAlPkHd936w5X7AYg":{"text":"Am I the only person who thinks this place is highly overrated?  The beignets are glorifie","useful":0,"cool":0},"MztanEUuiLbbDLzD537DbA":{"text":"***Cash only***\n\nTo be quite honest, the only reason to visit this place is because it's a","useful":1,"cool":0},"Xj_2lg4vO8ZAetaJCaBbnw":{"text":"Everything is changed. I hope it is temporary. Waitresses are gone, real cups and plates a","useful":0,"cool":0},"iIPL99_VY_sRFn4rG_WQTw":{"text":"Helpful Tip: Cash only! \n\nI've heard you can't come to New Orleans without visiting this n","useful":5,"cool":3},"zvNn0Oo6Klu7_AHz9STx4g":{"text":"Had to get the new Orleans experience! Kids enjoyed music being preformed, & beignets were","useful":0,"cool":0},"p6pOURVmxsNTKELoM-0wFw":{"text":"I've been craving beignets for months now! I'd heard so much about these and I would give ","useful":1,"cool":1},"o1nybV9J3Qh1-8h7Uz5IZw":{"text":"Well whoops. I accidentally left my review for Café Du Monde (Covington) on the NO locatio","useful":1,"cool":1},"ngG-IAIF6Y42HsfMX8hJBA":{"text":"DELICIOUS beignets and iced coffee! Definitely lived up to the hype. However they are very","useful":0,"cool":0},"HkE3DbTiUzZtgCziVTaDeQ":{"text":"All I have to say is...beignets!!!! If you want the best you have ever tried. GO HERE. Aga","useful":0,"cool":0},"oS2Z9czXqnOHyzzCGlnepQ":{"text":"Some nationally recognized restaurants are all hype, but Cafe Du Monde did not disappoint.","useful":1,"cool":0},"FlEXDup2QjlTJNmvIuEIXQ":{"text":"A true must see in New Orleans. You can smell the hot fresh baked beignets all the way fro","useful":1,"cool":1},"iPL4Pu1f3eEeq_JgISYByQ":{"text":"Best in the city for what you come here for.  Service is quick so bring cash and be ready ","useful":0,"cool":0},"49mONkAfXdEUJRRqqXt1dw":{"text":"What can we say about this place?! This is a staple of the city! A must go! The only place","useful":0,"cool":0},"7gTFEXM31jHaYXCV6LSTSQ":{"text":"World famous and a MUST do when in NOLA.  Touristy or not, this is the best of the best fo","useful":0,"cool":0},"C91LLyfy_tNappUAhTa5AQ":{"text":"Finding seating is a bit of a situation, however that's a bit of a reflection of the food ","useful":0,"cool":0},"48XjpGX_sPVEXG9_1kMUVA":{"text":"It is what it is, a huge place that caters to tourists and has only 3-4 things on the menu","useful":0,"cool":0},"aca4-vfdDP5TZ6OSrBh1Zw":{"text":"Listen to the recent reviews!! It's been 6 years since I've last been here and I' used to ","useful":0,"cool":0},"xINxGDHtWWt1cPc4MuS4nQ":{"text":"Truth be told they are the original... if you haven't stopped here you are missing part of","useful":0,"cool":0},"Hz5IMyVcu5mGMOf0dxCeYw":{"text":"My favorite place to eat dessert! The line sucks but it's worth the wait and of course gra","useful":0,"cool":0},"gObGZeVUrb-acQJmJHd0Jw":{"text":"I have had beignets at Disneyland plenty of times so Cafe Du Monde wasn't on my top to do ","useful":3,"cool":3},"h7nEVYJJVlHhfkX6Pxay0Q":{"text":"Had the Cafe Ole with the ever famous beignets. Essentially a hot donut buried in powder s","useful":2,"cool":2},"XGZOpl-8SipZiBbhctv7Xg":{"text":"What a staple to NOLA. I love everything about this place. Like the reviews below, policie","useful":0,"cool":0},"fyJOxSRAF2ssiRpxfg9ppw":{"text":"No, it is not the only place in the French Quarter where you can enjoy a beignet and yes, ","useful":0,"cool":0},"MV8xtKCFWA70oFbhuKovFA":{"text":"Wow! Being recommended by absolutely every person I talked, I had to check this must-try l","useful":0,"cool":0},"O7CoXto-cR2GC3xxNEbq0g":{"text":"Beignets and coffee are always a good combination. There's always a big line waiting but t","useful":0,"cool":0},"FDbs2xaayvQyEq7G8i_SsQ":{"text":"Stale and cold beignets. In 2020 this place is still a cash only operation without an ATM.","useful":0,"cool":0},"AsTkD_jlGoOLCeH-1AMORg":{"text":"This is definitely a must-visit restaurant. We had heard about the beignets, but I can't e","useful":0,"cool":0},"BV_h0dG8GwHqdtOWxtyVxw":{"text":"Short review - lives up to the hype.\n\nLong review - Went here by myself while touring the ","useful":3,"cool":1},"N-uEeQxxWIMIra9xdCBxeA":{"text":"I'm hooked. I bought three boxes of mix to take home with me. I had to buy more at the air","useful":0,"cool":0},"O9oA7RpyCbWEKFZYVFGIag":{"text":"Not to be missed!  A true New Orleans institution. Open 24 hours a day, every day except C","useful":0,"cool":1},"XOMZvZ7cClgcTdijCKpemw":{"text":"On our first day in New Orleans we had to stop here for some desert after a wonderful lunc","useful":0,"cool":0},"QeZB8H9URYHHGfPybwt-sA":{"text":"I know this is touristy thing to do, but we had an awesome time. We walked from our hotel ","useful":21,"cool":19},"m-jTtjR1M00t7cbmhzQlaw":{"text":"These were just as good as I've heard and read. The line length varies depending on the ti","useful":0,"cool":0},"BJ4TDna0VEs3Op1YtrExJQ":{"text":"Good service, amazing beignets! The cafe au lait was pretty good too, nothing extra specia","useful":0,"cool":1},"p8SqGlfGl7U52Yw65DCPZQ":{"text":"What happened to the awesome service?! I've never had an issue here before today; this use","useful":0,"cool":0},"BvaZBG8kupDbCv2j3H67hQ":{"text":"PSA. Please don't wait in that super long line...we got our order in like 5 minutes from t","useful":1,"cool":0},"B7em3oYOQaPcwFVSGOU4zw":{"text":"You're doing yourself a DISSERVICE if you come to new orleans without having beignets\n\nAn ","useful":1,"cool":0},"0SDlpdcWI3x5i2CDzNjwlQ":{"text":"This place had to be one of our stops in New Orleans! I've never had beignets so I would s","useful":1,"cool":0},"K2DOQyskliiqeR9icMvZug":{"text":"I stop by here every time I come to New Orleans. The line was long but entirely worth it. ","useful":0,"cool":0},"CFMAuYDWDrg98k-4hjPr_Q":{"text":"Maybe the best seats in the city. Comfortable, ergonomic, classy. Simply timeless chairs. ","useful":0,"cool":0},"sXcEv0ui4t5mvZJzmEEuAw":{"text":"The experience is more about saying you've been there. Coffee and beignets are good, but I","useful":0,"cool":0},"WOMa_Tj3N0hkkavYIesqgg":{"text":"The legendary Café du Monde, an iconic mom and pa shop where ladies in white aprons and pa","useful":1,"cool":1},"-CBj16IFmzCRl1jAgGVtQA":{"text":"As much as I heard I would never get in because I was told it was too busy, that was simpl","useful":0,"cool":0},"o1rCDmhSBg3BliQsTuUaJQ":{"text":"Don't get scared off by the long line. A) it's worth it and B) they keep it going. It's TH","useful":6,"cool":6},"x-zXke_5JhShgM7FEHmfFQ":{"text":"Wow, I literally waited 40 minutes in the heat for a few pieces of fried dough. I'm so gla","useful":1,"cool":2},"VIbe9fIGGkimnpcjIoQWvA":{"text":"First time in NOLA, I definitely just came here to be the total tourist.\n\nHere for maratho","useful":6,"cool":3},"UTd6-a9sQ2ZSvmo_A65ZQA":{"text":"Awesome place, worth the wait to find a seat. 3 is filling enough and the coffee is sting ","useful":0,"cool":0},"0Tqr08EA9GC2JZqqyxvi_w":{"text":"Is it hyped up? Yes. Is it worth the hype? Yes again. The coffee is great. Beignets are de","useful":0,"cool":0},"JNPiXCLI6cBQIGl-ZRW_Aw":{"text":"Just had to see what all the Hype was about. It's all good   Long line but it moved rather","useful":0,"cool":0},"M-38Evd0ISxZV8BnkB2orA":{"text":"Café Du Monde is a coffee lovers dream. The best coffee in all of the land in my opinion. ","useful":0,"cool":0},"oztxr0YRQp9FtKeks5UtmQ":{"text":"Definitely a tourist spot, but also definitely worth checking out. The beignets are fantas","useful":1,"cool":0},"4ZpVJmEuEWF5as_jOQL-Vw":{"text":"What a disappointment. \nI will start with the good. Beignets on point muy excelente and my","useful":0,"cool":0},"xDtRm_5hrMFEhex0FsdSfQ":{"text":"We tried this place because you can't go to NOLA without trying the beignets. They were de","useful":0,"cool":0},"8pDSi5hakyDWR8dOQbKHZw":{"text":"This bucket list item is finally checked off, and was totally worth it! The beignets are l","useful":0,"cool":0},"159mRjbgg1HuAd76vdeEPg":{"text":"Great. I was confused as to how to order but you just sit down wherever you want and order","useful":1,"cool":2},"XaX7wTC8el5NSEWH1YaNuA":{"text":"Even though there are currently 11 other locations in the New Orleans Metropolitan Area, t","useful":12,"cool":12},"irGt0dQcg_bxypzsCyccwg":{"text":"Our travels took us to New Orleans.  It wouldn't be a trip without visiting the iconic ins","useful":1,"cool":1},"T4ekywDSD_6oyA9rn3FhWA":{"text":"the biegnet are fine, but its such a tourist trap!  if you happen to be passing by at off-","useful":0,"cool":0},"QiuhPXDeXHHJZd8rzlYImA":{"text":"Totally disappointed for a place with so much hype. We got a dirty table full of dishes, s","useful":0,"cool":0},"z6sAt81L51yUvAklupk9yg":{"text":"Ok, I am probably going to get angry messages about this but I was not in love with Cafe D","useful":1,"cool":1},"VpCAYrteOeX6M7eB3cLR-g":{"text":"The wait for this place is long, however worth it! \n\nThe beignets really live up the hype.","useful":5,"cool":5},"WcTwMCu64G_sy74Df2HK-A":{"text":"Overrated. I like my beignet's on the lighter side, but Cafe Du Monde's version of thick d","useful":0,"cool":0},"jXy3ms791OEu2sCl-r9e1g":{"text":"Having never tried a beignet before, I was super excited to try cafe du Monde. I grew up d","useful":0,"cool":0},"cK2FQ4CnD2V3t9fCYCzGXw":{"text":"This place is always crowded during the day, so we decided to come at night time around 10","useful":1,"cool":1},"gf90aNhAAar1Wjw66ILLeg":{"text":"Basic beignets.\n\nDecent price.\n\nIt's honestly all hype, you can find good beignets anywher","useful":0,"cool":0},"_v5rrg66Gn7uGM5z-V5GqQ":{"text":"Pre-COVID 19 Review - Cafe Du Monde is a Louisiana treasure. Very fluffy and sweet beignet","useful":0,"cool":0},"vk9qlCBVcE3GlPZLzrKfTA":{"text":"OK, so you are in one of two or three lines.  You make your way to the order window CASH O","useful":0,"cool":0},"3ODhvE5ykH2rqxewjjgdsg":{"text":"Skips these long line and keep walking to Cafe Beignets.... They were not hot and fresh. t","useful":1,"cool":1},"XYmRXG5STdJ9AfR9236BWA":{"text":"The coffee and dessert was really good. I was prepping to be underwhelmed but was not. The","useful":0,"cool":0},"kPba5d-YDzwS2R1i87fOWQ":{"text":"Always my first and last stop when I get to NOLA. The beignets just taste so much better w","useful":0,"cool":1},"pH1E4Q43hDAHb1KLrDdIUw":{"text":"Cafe du Monde is obviously a must when in New Orleans, and we were pleasantly surprised to","useful":0,"cool":0},"JNJvh9aN0I6XJoMBz5pgDQ":{"text":"This place is a must for the morning cup of coffee or coco with their famous beignets.\nThe","useful":0,"cool":0},"0aXvcncgQJadiYPMTbOcww":{"text":"How can you go wrong with a soft, warm and sugary dessert! You can sit outside and listen ","useful":0,"cool":1},"zk0-RhG-RBcn74dfsy49_g":{"text":"So good! Don't need to go into to much detail based on the 13098418490 reviews. The only i","useful":0,"cool":1},"dL2AjWtsSf2l7zXXgUglfw":{"text":"Yep, it's good. Came at an off hour, around 6 pm so there were no lines whatsoever and ple","useful":0,"cool":0},"YdDb_g3iXxi5DxqyJtbGbw":{"text":"Great beignets but my favorite thing to get is the frozen cafe au lait! I've gotten it eve","useful":1,"cool":0},"Xfm4bDDi4MdDT8D772ygVQ":{"text":"This place is the bees knees- all of the time! Dip those beignets in your coffee and slide","useful":0,"cool":0},"Ykzr6pcb8zbEf2SXVPxjZA":{"text":"If you're looking for a New Orleans beignet stop on your walk through Jackson square at Ca","useful":0,"cool":0},"i65oceAl-uZFZ9HrVVEF6g":{"text":"Instead of waiting for a table to sit, I would get it to go, then find a spot in the quart","useful":0,"cool":0},"VtteYU5vTwuXtzrON809gg":{"text":"Honestly, I was expecting a puffy donut type confection, what I got was 3 hard funnel cake","useful":0,"cool":0},"BirFi-HG7s3slHiIv3vt1Q":{"text":"I have mix feelings about this place. While the beignets were good, I've definitely had be","useful":0,"cool":0},"ljc2AdiYBc5rZG45GZZsFw":{"text":"A little disappointed it's cash only; the only thing I wanted to do was have this food but","useful":0,"cool":0},"Kx4F061BdaW8hTR8KRnI0w":{"text":"Of course I had to come here my first time to NOLA! I have to say, I was not expecting suc","useful":0,"cool":0},"0DzO5rZAXwkLRV7Xi8pL6w":{"text":"I was expecting to be wowed but honestly it wasn't worth the hype! Thankfully we didn't ha","useful":0,"cool":0},"cFjnCYt70nAWazo4ZXX7-w":{"text":"This is the original Cafe Du Monde in the French Market! You won't want to talk about your","useful":0,"cool":0},"gkwlyffIWJLbYM4xbrs9AQ":{"text":"Nothing on earth should taste as good as these beignets. Don't stand in line; either visit","useful":0,"cool":0},"-F1dwPGhY2i2e4CkdwhcxA":{"text":"Not my cup of tea. I was expecting light and airy beignet like what I experienced in Paris","useful":0,"cool":1},"4xXhz9X9GhyUNBc1lsFTpA":{"text":"A must-eat in New Orleans. I ate 3 beignets ($3.40) on my own. I have no regrets. They wer","useful":1,"cool":1},"CEIDuPNPRiWREyqhdu6GEw":{"text":"Must stop here in New Orleans, just be prepared to wait a while. This place is very popula","useful":3,"cool":1},"yd78kx9VKchoTNKinHxKAA":{"text":"Definitely gonna have to get and  try this once you are in NOLA. Amazing beignet - a good ","useful":0,"cool":0},"VHmTiFjfcumO3oThifPfVA":{"text":"I mean world famous and for a reason. Family went and waited in line for about 45 minutes,","useful":0,"cool":0},"b2Q5_N-v0D7Sa6HPQr3HPg":{"text":"A must go to when in NOLA. They have outdoor seating right now. Beignets, coffee, and the ","useful":0,"cool":0},"8rAKk6aiLJ9CDeOvniLROQ":{"text":"Something weird has happened with Cafe du Monde's Yelp page because we know for a fact tha","useful":2,"cool":0},"Zeu1aAxKpY5BnPEAL0bwHA":{"text":"Totally unimpressed. \n\nFar from the best beignets, I do not understand the hype. \n\nGot a b","useful":0,"cool":0},"YyhV6Rz9donqsirp1iGeAA":{"text":"A NOLA classic, can't go wrong getting some of their world famous beignets to go with thei","useful":1,"cool":1},"cIknC3cTYAjMC_4Af3UjKA":{"text":"Was in town for business and it was the first time in Nola so I had to do the thing! Got b","useful":0,"cool":0},"ddcuELqEveYQwHJxcS2j6g":{"text":"Their beignets and to die for. We don't have these where I'm from, but I wish we did! Pair","useful":1,"cool":1},"_6hR0ovzLOwgvhfb49WrRA":{"text":"How can you not give this iconic place 5 stars!? The beignets are heaven!! Melt in your mo","useful":2,"cool":2},"jqMVLmIfaUKwON25GIZ2CA":{"text":"Okay place not sure about the big hype. Food was good, coffee was maybe.  But way too many","useful":0,"cool":0},"ojJn-Mz3f9TN8MsjmlXOWQ":{"text":"Super famous brand in the Vietnamese culture due to the French influence, I had to go and ","useful":2,"cool":0},"Oc3RJY7KUIWo3UsQS2afjg":{"text":"Long long lines! No shade in the hot sun in the to go line either! However the beignets an","useful":0,"cool":0},"NGlJhwveOijhOgRrzbjs-w":{"text":"Coffee au lait was amazing and perfect! The beignets are amazing as well! Tons of powdered","useful":0,"cool":0},"KHrC3rKDD30W7pdJk-l-LA":{"text":"Best beignets in the world. Its no secret everyone knows. I wish this place came with a sm","useful":0,"cool":0},"lhfPGchi8earxpg1Odahyg":{"text":"Simply a must in New Orleans. The line move fast so don't be discourage if you see lots of","useful":0,"cool":0},"DB0tWai1mq7RmcTHIx9eAQ":{"text":"Wonderful place for atmosphere,  coffee and beignets.  No one lingers. Something to experi","useful":1,"cool":0},"EyoTFb874FBpHYiBjgiXPw":{"text":"Not much to say that probably hasn't already been said. This is a place that has to be on ","useful":0,"cool":0},"wuIyfyNh93WNuia1u0eteg":{"text":"They wore masks. The line wasn't too long and there was enough seating. I thought the beig","useful":0,"cool":0},"y2mnEtC1ZrHIn8qM1N_xow":{"text":"What more need to be said, it is Cafe Du Monde. \nJust amazing beignets!  You could also wa","useful":0,"cool":0},"2Kg6bi7YHmd2bn_pLs3zbA":{"text":"If you come here on a hot day, just go to the line on the right, it goes by a lot quicker.","useful":0,"cool":0},"-NR3Cpi2gkuLX9UEXIZW1Q":{"text":"Back in September 2014, I visited Cafe Du Monde's general store to pick up souvenirs. I di","useful":0,"cool":0},"eL8dx1xOPlQLsoYKpi31Vw":{"text":"Honestly taste very average. \n\nWon't spend more than 10 minutes waiting in line to get it.","useful":0,"cool":0},"KAAq6jnvc-F6bc9U3-pvjw":{"text":"At first I thought this was a tourist trap. I kept passing by it in my Uber and always saw","useful":1,"cool":1},"mGiY5UV0XYq1beBLDqTv7Q":{"text":"Super cheap, amazing breakfast that is an absolute must to anyone visiting. I told my husb","useful":0,"cool":0},"_Z9pyp5UzcJLodKe20p_LA":{"text":"Beignets live up to the hype. We didn't even remember take a pic!\nWorth the wait. Sipped a","useful":0,"cool":0},"UihNZyw1pwdkiZyjlZDVJg":{"text":"The beignets are delicious!! There was a long line, but in the togo line it went by fast! ","useful":2,"cool":1},"uAK6e13_KDS4I7yPGF2FNA":{"text":"This is a tourist spot that everyone goes to in New Orleans. It's all open air seating are","useful":0,"cool":0},"PMS2WKGVCAHdJ7EvSCdzAw":{"text":"Probably our favorite beignets. There's so many locations all over New Orleans, even at th","useful":0,"cool":0},"XLnl3kZ_viOfhvOEd0HPwg":{"text":"Ok, so everyone told me I had to stop at this place and it lived up to it's reputation.  G","useful":0,"cool":0},"E0YOYDaBJZDCnv0g4TV-FQ":{"text":"I can't think of a better way to start the day than with a rich warm mug of cafe au lait a","useful":1,"cool":0},"XQq5jJ6xgYOayV22ZPyJdg":{"text":"The Du Monday beignet small shop in the mall is as good as the big stores...beignet donuts","useful":0,"cool":0},"cBzQa-M_j4daklmefD0qtw":{"text":"A staple of the French Quarter, this place is open 24/7. The menu is very simple with just","useful":0,"cool":0},"uzQXEiapJVBvRWWkEV9pcw":{"text":"I think if your going to NOLA for the first time this is a must do. Beignets were awesome.","useful":0,"cool":0},"OI-V75JZlzlHU40HhdKFgg":{"text":"Eighteen years ago I was at Cafe Du Monde with my husband and now we were visiting with ou","useful":0,"cool":0},"3c_dyk6WlUW5JxlelJVtRQ":{"text":"There are two lines: to wait & sit and the other to go. We decided to wait and sit. The li","useful":4,"cool":3},"pz8uWjJAYc_62uZVDg4gow":{"text":"Café Du Monde is one of those places that everyone recommends and expects you to have the ","useful":12,"cool":16},"F_t-KdnlcjUSAGvpIOMbBA":{"text":"When in Nola, must get beignets. These were even better than the 1st (and only other) time","useful":1,"cool":1},"LDNGVdGZxvYtOR6-g_6_7A":{"text":"Fantastic, fantastic, fantastic! This place is just a tradition so there's really nothing ","useful":1,"cool":0},"4jvn3T01N_3X9kIEphMw0w":{"text":"Incredible. Must see. Everything you could dream of and that's saying a lot during COVID! ","useful":0,"cool":0},"0CCGr8ZPzMeT6aHJZ7ojdQ":{"text":"Delicious, we didn't have to wait long at all. They're definitely messy, so beware after y","useful":0,"cool":0},"vhM7P6wXgNRlaKXGk2rNnA":{"text":"Of course we had to go to Cafe du Monde on this recent trip for coffee and beignet.  Surpr","useful":0,"cool":0},"-i_CK4xQTXfrlFCpSMB1Yw":{"text":"Amazing! Very quick service- it's a seat yourself establishment. The menu is on the napkin","useful":0,"cool":1},"MWbeRzGfi2oEhetQNs3yKw":{"text":"The beignets are amazing. The cafe au lait with the chicory coffee is out of this world. T","useful":0,"cool":0},"XKZ6V00kA6oDVJtT72BqTw":{"text":"Of course you have to check out Cafe Du Monde when in NOLA! I was with two coffee drinkers","useful":0,"cool":0},"wmZl_wnpyFo1_nN-2ymB_w":{"text":"Must try when in New Orleans! I ordered beignets and a Cafe Au Lait. I am in love and can ","useful":0,"cool":0},"yb8KGSwTytSa98uaBm1gCw":{"text":"Beignets...what else can I say.  Freshly fried and served hot.  They were great!  Staff me","useful":0,"cool":0},"C5u-ZNj2xNNjxvo5gQ618A":{"text":"This place is probably the most famous food establishment in NOLA. I've been here twice an","useful":3,"cool":3},"Dfhe9DM1uNv0CcuOGjKm3g":{"text":"You have not completed your trip to New Orleans until you stop here. It is an historical s","useful":0,"cool":2},"J2O1llAvzqohxBDweXW_Lw":{"text":"What can I say if you're in New Orleans you have to do Cafe du Monde !  You can't go wrong","useful":0,"cool":0},"n4d4g3WD808I2ICtnW2Tzg":{"text":"This is for everybody who asks when I visit New Orleans. \n\nThe answer is Yes! I have tried","useful":9,"cool":6},"6Rq0HiwFW-rKI0OS5vvJNA":{"text":"You have to come hear to understand what it is all about.  The jolt of strong coffee and t","useful":0,"cool":0},"p_nsz23-J-WulXgHKski8Q":{"text":"** The following Yelp memory review reflects an experience I had well before the shelter-i","useful":17,"cool":17},"qKQN7MbuyvgJQn2lsppxKg":{"text":"Great place to check off but the beignets were just ok. A plate of three beignets one is f","useful":0,"cool":0},"ZODRx9eIYGol6aTYfJRjOg":{"text":"Picked up some Beignet mix here & a NOLA Christmas tree ornament. Friendly staff.","useful":1,"cool":1},"fOKsKhIOwl9iW10UEvryww":{"text":"Lives up to the hype.  My husband isn't a sweets guy, so we intended to share and order.  ","useful":0,"cool":0},"QOqqwPyLsuhu9T7r__kkBg":{"text":"Yummy yummy yummy. This was on our list of desserts to grab while in town and they were so","useful":2,"cool":3},"CWGWAPjOfNCCRoELdSZmCQ":{"text":"Beignets.\n\nThat's all you need to know. Just do it. It's a must to make a pilgrimage here ","useful":23,"cool":23},"TZv-dA6T1I8QyvHwv-3wxw":{"text":"I was out in Nola back in the beginning of August I came here twice and it was packed each","useful":1,"cool":1},"6J5AXY2aI2CmnyCzmI89uA":{"text":"Yummy pillows of dough with 2 inch pile of pure sugar crack. Yes to the Vietnamese coffee!","useful":0,"cool":0},"1OIdxidHY1XxSki3WovRbQ":{"text":"As my mom called it \"pastry from heaven.\" Absolutely amazing! Quick service once you sit d","useful":0,"cool":0},"TRXUYiDVvtRmP3ULd-QifQ":{"text":"Just another 5 stars review. Even though the place is packed. The waiters and waitresses a","useful":0,"cool":0},"EGoI-37O7GFxycf8t7JVag":{"text":"Everyone kept telling me to go here for the beignets, and it was so underwhelming! Perhaps","useful":2,"cool":2},"6pZg3eong_vJHSbW2m3obw":{"text":"Outstanding. Beignets are tremendous. Obviously hard to mess up fried dough but nonetheles","useful":0,"cool":0},"Q5mwh6_MK8lHINYeHdyELA":{"text":"Overrated. Go to Cafe Biegnet if you're in search of true flavor and food experience. If y","useful":0,"cool":0},"CWOamDaO7KcyZXuYTtbVMQ":{"text":"You might have to wait but it is worth it. Can't get any fresher than this. You never had ","useful":0,"cool":0},"AIrnwKqP1uZKVsYLoCQOQw":{"text":"Today in my 29yrs of life I had the worst bag ever., all three were flat crackers! A crunc","useful":0,"cool":0},"4vsJXe0K5HYB1sQNJ4GEhQ":{"text":"Coming to Cafe du Monde is really more for the experience and to be able to say you went t","useful":0,"cool":0},"1j52ltXZI4hc-SrngIhMNg":{"text":"I had coffee and Beignets here.  Both were very good.  The beignets had enough powdered su","useful":0,"cool":0},"tat1Mc5HfiELy2IfVZnZww":{"text":"Had to drop into this iconic food stand while visiting New Orleans. Sadly it didn't quite ","useful":0,"cool":0},"FOIbsru5-vbIeF40xOsnNg":{"text":"A trip to NOLA wouldn't be the same without beignets from Cafe Du Monde. \n\nThere's a lot o","useful":0,"cool":0},"y-MXPJDhcnFnGt-vVgRh2w":{"text":"The beignets! It's all about the beignets. This place is still the king when it comes to b","useful":2,"cool":2},"6HP5day51JxqWFJPBv4WOw":{"text":"It's just ok. 30 minutes to wait in line to get a mediocre cup of coffee and some beignets","useful":0,"cool":0},"52F8KNM1kfni4guVCyh_IQ":{"text":"What can I say an Icon in New Orleans Yummy beignets and coffee Open 24 hours to get your ","useful":2,"cool":1},"WXePLIiUGJorO1QDj6b-AA":{"text":"My husband and I from Fort Lauderdale visiting here for Southern decadence\nThis was the fi","useful":1,"cool":0},"weR-D-vjhrZAdkgIBE5-7g":{"text":"The beignets are delightfully fried and doused in powdered sugar, the coffee is rich and a","useful":0,"cool":0},"cFxQx7y4HDK_AGgyfBXc7w":{"text":"Very busy but worth the short wait. Street performers playing music adds to experience. Wo","useful":0,"cool":0},"iFuxFLaxjC-q6splgJjm4g":{"text":"i didn't think the beignets were that amazing. it is a nice environment though and open 24","useful":0,"cool":0},"aOJf-w4UZNbWPhRSy7_gXw":{"text":"Well, there was no doubt that we had to go to Cafe Du Monde while we were in New Orleans. ","useful":0,"cool":0},"GjRQhptbBiiRn65U06cTGA":{"text":"I have been to this location several times because if I am ever in New Orleans, I will alw","useful":1,"cool":1},"dZohpYaf_xxmclWhbCO1Ng":{"text":"Wow, so yummy!! This place is super popular, so be prepared to wait in a line. The line mo","useful":0,"cool":0},"12ctQXMcIIQHfW0tEK54kw":{"text":"Cold, stale and dense donuts! It was our first time in New Orleans and made it a point to ","useful":0,"cool":0},"StfYPdiftT2lagZPqT7FHA":{"text":"It's a famous spot. You have to go, but don't expect anything special. You'll get the coff","useful":1,"cool":0},"NxNo-1kTIsRYxjAWdhyFNQ":{"text":"I understand. Really I do. I do, I do, I do get it. But they churn these things out by the","useful":1,"cool":0},"xyJ3myYBYdrxNLjBccxOaQ":{"text":"Things are a little different this trip then the last one since covid but they are still s","useful":0,"cool":0},"pw55-el4YlAQ6LD58g-taw":{"text":"COVID-19 Review.\n\nA little turned off that this is such a tourist trap, I was spending jus","useful":8,"cool":4},"oAid41ebn81BpCBIQ0CgcQ":{"text":"We had to try this iconic place before we left. While standing in the long lines outside a","useful":2,"cool":2},"0HxV7QUeEHW593At10Labg":{"text":"1st stop when getting to New Orleans.  (Keep in mind it is CASH ONLY)  Soooooo yummy perfe","useful":0,"cool":0},"vjkwvXSvCTchIr730cxwFA":{"text":"I recommend you must beignets aleast once in your life if you are in New Orleans. I been t","useful":0,"cool":0},"UBPcFYznW2FfZvcywU6mcg":{"text":"BUSSIN BEIGNETS \n\nFood - beignets are made fresh and taste delicious, they come in packs o","useful":0,"cool":1},"pOI334_vYgDpi0CX45uXiQ":{"text":"This is the review for the Cafe in the mall. We had both Cafe Du Monde's.\n\nWhile the line ","useful":0,"cool":0},"76D7wpDFB9gtzedCgssveQ":{"text":"It is possible they have the best beignets, but I am not a big beignet fan then. They tast","useful":0,"cool":0},"_PgZPL5dUwcfv-C_xyGmFQ":{"text":"The wait time was 1 hour for take out.  I find the beignets was not that tasty when compar","useful":0,"cool":0},"lOp1gjaL8X4MczYk6NP3iA":{"text":"A New Orleans tradition, beignets are best from\nthis eatery! Very simple and straightforwa","useful":0,"cool":1},"g9O-kGdrHoAeA0J2yy4qIg":{"text":"Cash only! \n\nDefinitely a hyped up tourist stop. I've read reviews and the wait can get pr","useful":1,"cool":1},"qh8l5wMN0v4Rpzd4QHstkw":{"text":"They don't accept cards, cash only. I understand this place is historical, and beignets so","useful":0,"cool":0},"p4e4lYb64iG97rr068cWAQ":{"text":"The line is not worth it. The line takes easily 1.5 hrs or more. I'm a big coffee head and","useful":0,"cool":0},"87e0HbhhoOrhuEOMMSDOQQ":{"text":"Staff was friendly and atmosphere was great, as always. This was my fourth time here but i","useful":0,"cool":0},"F1B1KkfO-7kCblMAyFnt_w":{"text":"My husband, daughter and I spent Christmas in New Orleans. We had to do the \"tourist thing","useful":1,"cool":0},"MuEXeY4JV90gGU_0waoqxA":{"text":"I had the \"Trifecta\" my first morning in New Orleans:\n\nA cup of Cafe Du Monde coffee\nA bag","useful":22,"cool":21},"cn__9L1OlNb2OqyQ-8T5XQ":{"text":"So the Mrs and I went to New Orleans and, of course, we had to try the beignets and coffee","useful":2,"cool":0},"i7ch7dEtCm23oUvihfAfuA":{"text":"Love this Cafe located in the French Quarter come check it out...","useful":0,"cool":0},"iTqh2oyo5l1CIzfj5ozMRA":{"text":"Touristy but they do have the best beignets.  A Must!  Take cash as they do not accept cre","useful":0,"cool":0},"8-z3OAjYKe-FF2PNCVTjNA":{"text":"Cafe Du Monde is worth it! The beignets were hot and wonderful. The staff was friendly. I'","useful":0,"cool":0},"4OQ778dOXkuCQ8w5ngHuCw":{"text":"Best beignets, freshly made and the right amount of powered sugar. Dipped in their delicio","useful":1,"cool":1},"h5uJyE7a6UDMVSDex8ersQ":{"text":"Was expecting more. Maybe we got these while they had been sitting for a while but the bei","useful":0,"cool":0},"IAxdxIlpiHT0AHLK5t8ckA":{"text":"It is a local famous place. Monday's are less busier than weekends so I didn't have to wai","useful":0,"cool":0},"VF81bKU5zpRkwXtXmkloFg":{"text":"The beignets are delicious and the service was prompt and friendly in spite being packed a","useful":0,"cool":0},"vEGqROVJz4WS6UbhgtlcKA":{"text":"Super crowded but I'm so glad I decided to be patient. Turns out we were seated quickly an","useful":0,"cool":0},"drfa58861e8AfSrp9Ns7sQ":{"text":"If you've been you know. If you haven't, GO! And don't share. You should eat all three!","useful":0,"cool":1},"I3_qn_mDvf3lfW4cFGxjJQ":{"text":"Quick and easy tasty treats. If you visit NOLA this is a must stop for everyone. Make sure","useful":0,"cool":0},"QLaJ-gNzwyMpt3oXnzVfGA":{"text":"Cafe Du Monde in the French Quarter area. They have some beautiful old Oak trees that are ","useful":2,"cool":1},"G3NR5A5YNviAyldXl6KW3A":{"text":"This place is way overrated. Beignets taste like fried Dough except they added way too muc","useful":0,"cool":0},"l-9feMXRZtsUcQpTDdb5aQ":{"text":"Love this place. We stop in every time\nwe pass thru New Orleans. Enjoyed it even during co","useful":1,"cool":0},"2cbEVwJX3xRfWp6bAFWtVA":{"text":"I don't know if it was a bad batch, an angry employee about to quit, or just the business ","useful":2,"cool":1},"hn8IWbzHg90wRMVQEElXxw":{"text":"Wow! This is the place for beignets! The chicory coffee was a bit strong, but it balances ","useful":0,"cool":0},"vlglK1rmLDJcE5OocUIV6w":{"text":"What's sup with me giving a 3-star rating for the infamous beignets in the great city of N","useful":3,"cool":1},"Y-n-nM32ajetWrbxDuoEfg":{"text":"Have made some adjustments for CoViD but a must do if you're visiting to New Orleans.  We ","useful":0,"cool":0},"TnI_7j-XKTTetM4mN2Op-A":{"text":"Yes, yes, YES!  This is a must visit every time we go to NOLA.  It's near the Courthouse (","useful":0,"cool":1},"Is-KY-WIk28HnckDMIAAsA":{"text":"Weirdest place ever. There's no seating. It's forever packed. You just wait until someone ","useful":1,"cool":0},"NHgBSmJXPV7McQ1m0VMLtA":{"text":"I'll make this short and sweet. Du Monde hands down best beignets in the world! Their setu","useful":0,"cool":0},"cG8HElVCrnMZXBScD-nkWA":{"text":"Cafe Du Monde\n\nThe original location in the French Quarter on Decatur Street.\n\nBusy, long ","useful":2,"cool":2},"ZiBI3mDeAsjEmc7Kp8FGAQ":{"text":"Beignets and coffee was amazing. Very busy place. Definitely recommend visiting during you","useful":0,"cool":0},"j77USBAb2bnFw1erKpjzEA":{"text":"Is it the experience, was I just happy to be in NOLA, or was it that good.  Who knows, but","useful":0,"cool":0},"zgayHdo7gKbQuBkZeUcYSg":{"text":"Everyone says you need to go here.  And you do, just to get a baseline.  But I thought the","useful":1,"cool":1},"Cm4d4Yn0tFErZxnWV_xPWQ":{"text":"You know it's good when you come back again and again. It's just so welcoming and you know","useful":2,"cool":3},"QqCRkOmWtNld98nRc94DRA":{"text":"BLAH, BLAH, BLAH....... This place has been there for decades because, well, they know how","useful":6,"cool":5},"QWAR_v5W7pK-pybS4gzGuA":{"text":"Beignets will not disappoint. I heard from a lot\nIf people how great they were and I was l","useful":0,"cool":0},"eLbZyS9bgxKa6BKSc6Au5w":{"text":"I thought the beignets were delicious. However, I was extremely disappointed in the servic","useful":2,"cool":0},"vUMEu9WvUomuajCVv4oJIQ":{"text":"Love me some good ole beignets. Deliciously soft pillows of fried dough doused with powder","useful":0,"cool":1},"1qg7xQjyWzC_oaQsBYgaTA":{"text":"Pro tip: Get Cafe Du Monde beignets if you only have 90 minutes to spend in New Orleans.\n\n","useful":0,"cool":0},"J5ot4AdfJZybjOP2Xero-A":{"text":"Pretty fun, good times, beignets! A bag of powdered sugar! It's a must do activity in NOLA","useful":0,"cool":0},"wiO-W_4csTU6dMFAmspWjA":{"text":"After our last trip to Cafe d' Monde we won't waste the time again. There's always an extr","useful":0,"cool":0},"V5WiQ9VViYvkW4SRHAu4Pg":{"text":"Do NOT be fooled by the long lines and don't let it deter you! This is a cash only establi","useful":1,"cool":1},"27OwiHcaMl5l1yjf3Ay1rw":{"text":"Cafe Du Monde has a great reputation in New Orleans.  I thought the beignets were just oka","useful":0,"cool":0},"oOh770invsh0RXILlchz9Q":{"text":"Here's another place that smells like ass, and this place is outside.  \n\nWhen we first got","useful":7,"cool":4},"jhg3GASpuk-1GNfJywLmKg":{"text":"Most delicious beignets and coffee. Perfect pairing. The iced coffee was a must for the ho","useful":0,"cool":0},"A-0NXNEKRAArQYR6kc4f-w":{"text":"Coffee amazing, best I have ever had. Beignets- hot fried dough amaziness drowned in powde","useful":0,"cool":0},"Nsb0-_YdGS29T5rD3vf9hQ":{"text":"This is the original Cafe Du Monde location that has been around since 1962.  It is across","useful":3,"cool":3},"EEoJ2PBwdSTu5Hajgr4W-w":{"text":"For those who don't know, in the old days one was seated first and then served a china pla","useful":0,"cool":0},"m8V9NGJRjpdO4fnX743Sjw":{"text":"We visited New Orleans (\"NOLA\") in December for a ten year anniversary of the last time we","useful":1,"cool":0},"On6MBSZLwFDR21pTN-Pa3g":{"text":"As much as I heard about this place I had to try it. Of course I expected the long line du","useful":0,"cool":0},"VjtXbovqlZ63qGQi91wbvQ":{"text":"Open 24/7 and I'm telling you while they are ALWAYS busy, go around 6-7 and you'll have en","useful":1,"cool":1},"hxa9W-f4rOI-R7ArL5JbDQ":{"text":"Yummyyyy!!! I can't wait to come back to New Orleans when it is back up and running. I kno","useful":0,"cool":1},"qXn8geWZLzPJxmxy4SWT6w":{"text":"I have to say before I begin my review that I absolutely LOVE Cafe DuMonde beignets...it i","useful":0,"cool":0},"EAMK-B4--X8qnDZoDgpZjQ":{"text":"The seating area was packed and disgusting!! No one was wiping the tables at all. People w","useful":0,"cool":0},"IFfhSVj2cbz67oqLIL9IgQ":{"text":"HORRIBLE!!! We had one and rest all directly went into the trash!! Beignets are supposed t","useful":1,"cool":0},"QPHp54iBcLZub4gjYYS_2A":{"text":"Cafe du monde is a known nationwide for the famous beignets a thin crispy pastry with powd","useful":5,"cool":4},"o06Jz4gsjqPHysVu5g2OIQ":{"text":"THEY ONLY TAKE CASH+++The place is chaotic and busy at all times.  At least it was the 2 t","useful":0,"cool":0},"mCX_zPwrlDi9kv5nURqN5g":{"text":"I just don't get it. Why do people go here?? Maybe I got a bad batch because my beignets w","useful":0,"cool":0},"zHa4pqQ8JXWGNX1HVkpCaA":{"text":"We wanted to try the famous beignets. This place has been open since the 1860's. We order ","useful":0,"cool":0},"KilmyjhNqi3ZLrvdgRZvNQ":{"text":"Cafe' Du Monde is one of those must go to places when you are in New Orleans. Even those w","useful":1,"cool":1},"PbFQa4p_RhNpe19AIo-kow":{"text":"Have you really been to New Orleans if you don't wait in line for those delicious, freshly","useful":3,"cool":0},"wp09Tgtn9XgrrgLDBJcyZA":{"text":"I'm in NOLA for the rest of the week, helping one of my clients go-live with a new CRM sys","useful":0,"cool":0},"zJ4kWaK23Ys_CUpRWv9Q9A":{"text":"Everyone raves about this place and I really didn't understand until I ate here! Such fast","useful":0,"cool":0},"v394hNShqD-yqejaqgVNfA":{"text":"I mean what is there not to say about this. The Beignets are amazing, the coffee is wonder","useful":0,"cool":0},"wXp9zffk2rVNJ7JohzXf8w":{"text":"Cool place. Good coffee.","useful":0,"cool":0},"_bC4cOHpA7JY8lhmCYnxAw":{"text":"Listen: Do yourself a favor and go on a weekday or off-time when it's just regular busy an","useful":0,"cool":0},"0sQlj6SAiIAORFqhQEjnvg":{"text":"Yeah, it's a tourist filled place. Yes, there is a line. Agreed, you won't feel special or","useful":0,"cool":0},"-U7mZlnqXq04MLISplvHsQ":{"text":"It was good, just like all the hype described. The line was fast so we got our coffee and ","useful":1,"cool":0},"k5A-PYV6gpxMVDyLtxOm0Q":{"text":"You cannot visit New Orleans and not visit this place! The hype is definitely worth it. We","useful":0,"cool":0},"EpJt0W6X2tG3eGegjnC2Kw":{"text":"Can't come to NOLA without visiting here!!\n\nWait is always long but there is plenty of str","useful":1,"cool":1},"KX5iD1wHKUqMnE7L5lN9EA":{"text":"Pretty good beignets and decaf but the seats and tables were pretty dirty and at a time li","useful":0,"cool":0},"hacoWjH76rAJWqQFLJEmcg":{"text":"The lines are long but the value for 3 beignets is excellent.  Haven't ever had a bad one.","useful":0,"cool":0},"bdknS0OMb-7EHqHHQcGHNg":{"text":"Cafe Du Monde is classic and truly New Orleans.  Tourists come here as well as locals.  It","useful":4,"cool":6},"YBWEo6GsQjje8eR-94exIg":{"text":"Good but super busy and they only take cash.  Expensive parking and far away.  We had to w","useful":0,"cool":0},"4LCz6vtUpnqlTg0H5_qybQ":{"text":"Amazing service all day long. The staff always seems to find you even when busy. Took my s","useful":0,"cool":0},"sxUC8by7fPsjvPeA9eXcGg":{"text":"Needless to say that their beignets are the best. Hard to find a table to sit but the crow","useful":0,"cool":0},"ji0p5rNtvaPCCQcmnUpmjw":{"text":"Best beignets I've ever had in my life! Worth the wait and the hype. Went to Cafe Du Monde","useful":0,"cool":0},"OXcIamv7zVNvXkzYLAm6ow":{"text":"Warm and soft. So good ..a must stop. Lines goes quick. The coffee to me was not that good","useful":0,"cool":0},"4tVcvRsdpZON1bGKvrdTpg":{"text":"Besides the long line for the wait and the request for cash only to pay for the food - the","useful":0,"cool":0},"gT2plZY1Rajy9bFpeTPdew":{"text":"What an amazing find in New Orleans. We had beignets and a cafe au lait. It was a pretty s","useful":1,"cool":1},"y2EmzGslsbr1nIwaiNw9Ig":{"text":"Please forgive the photo but this is what happens when you go to New Orleans to celebrate ","useful":4,"cool":4},"n8F5_ls07jX6i1xYpIr2Vg":{"text":"This place never disappoints!!! The beignets are perfectly done and the coffe perfectly de","useful":0,"cool":0},"A22N0t7VtxHdCI2A5ODfUg":{"text":"It's a staple and I just happened to be in the quarter on a rare occasion so I had to stop","useful":18,"cool":15},"Y2wj0NN9TDl_s0vTyLLJbA":{"text":"I mean what is there not to love? We ordered our beignets and coffee and enjoyed sitting o","useful":0,"cool":0},"aFXHdGCP_YH0bl0WfeEt6g":{"text":"Great place for a snack of beignets and a cafe au lait. Beignets are always served fresh w","useful":0,"cool":0},"B7YtpXAZUAvQNR86ZAoXZQ":{"text":"A must see if you are visiting New Orleans. Seat yourself and a server will find you. Alwa","useful":0,"cool":0},"ORY7I2cn6WgZzfKL-NNV9A":{"text":"You have to try cafe du monde's famous beignets when staying in New Orleans! It's a must!","useful":0,"cool":0},"8pvB_G_lNO2L1N0710Gokg":{"text":"Not really sure what all the hype is, the beignets and coffee were ok.  The lines were not","useful":0,"cool":0},"Wy_lFTUtjtTTQ5ijcjGvUA":{"text":"Long lines....all day...but worth the wait. You get the same quality of beignet at every o","useful":0,"cool":0},"S7vzEgZ-jDQIDHiURBCylg":{"text":"They stole $20 from us on 5/28/2021. The Vietnamese lady working the window that we couldn","useful":0,"cool":0},"ALwiyzXxdlFAxE6PgtieFQ":{"text":"So overhyped. I'd say it's a tourist trap but it's not expensive. Maybe we just don't like","useful":0,"cool":0},"9MTdCDKFtTYZdo5Ubt2aOw":{"text":"Had a friend recommend this and warned about the 2 hr long line. Pretty much worth it the ","useful":0,"cool":0},"_zL_0jD6vsAZgt5v-9kmjA":{"text":"Because of COVID we ate in the sparrow-filled semi-outdoor area, which is huge and generic","useful":0,"cool":0},"y9-p6Qlc6b0ym-YLXwCP6w":{"text":"Cafe Du Monde is a right-of-passage for anyone visiting NOLA. Their soft and warm beignets","useful":0,"cool":0},"_TBonHlO8L49VpNR1Z8Q_Q":{"text":"Always a must when I'm in New Orleans! There are lots of places to get beignets around the","useful":0,"cool":0},"CwMpCgz0UcgAgPqMx5EgtA":{"text":"Really really enjoyed it.\nGood food and kind staff.\nVery affordable price.\nJust a long lin","useful":0,"cool":0},"JKsAUmjflIiiKTwOwaeCBQ":{"text":"The hype is real. We waited about 45 mins and got hot and fresh beignets. \nThere are two l","useful":0,"cool":0},"6PEfGxmASiOeyVBe5r9bnQ":{"text":"Cafe Du Monde is a must if you're ever in New Orleans! It's a classic place to eat freshly","useful":0,"cool":0},"1iJf1OyJBp_s2_IB14dESw":{"text":"This place is aways a treat! Beignets,  coffee and more powered sugar then what omes in a ","useful":3,"cool":0},"EJ_3wmoucH9OSHC_Pn4mBw":{"text":"Awesome food, love the atmosphere! Put these place on your check list, totally worth it!","useful":0,"cool":0},"PyCEcyfQzCMX3Lh4ASppqw":{"text":"I've heard so much about this place researching my visit to Nola. Cafe Du Monde is a cute ","useful":0,"cool":0},"RAP1d-IFZoHKlwZ5Nx2AUQ":{"text":"What can I say this place is a must go to if you are in the New Orleans downtown district.","useful":0,"cool":0},"eR3SMqI3Lj8RwGjbMqz2MA":{"text":"Actually we tried cafe au lait at MSY airport, but we couldn't find this place in Yelp aro","useful":0,"cool":0},"RhE808Fe2fMxzaLfPlvg4g":{"text":"Flew all the way from California and man the line was worth the wait. The coffee was delic","useful":1,"cool":0},"HT31BgHO7SmnZ1J-MBBGtA":{"text":"Amazing beignets and hot chocolate. Since the weather was cold it was not crowded which wa","useful":0,"cool":0},"gmBIYJyDfg8Zqxj1QfuoGg":{"text":"This is a must place to go to when you come to New Orleans!!  FYI it's cash only so make s","useful":0,"cool":0},"RUrwGLOhqVk_fKMaEnN_cg":{"text":"Love coming here. They have the best of everything! It's ALWAYS busy, but they always have","useful":0,"cool":0},"JLy_yHAMYd4ZQ3XtBR87mg":{"text":"Really not worth the line honestly. There are 4 different windows with lines so make sure ","useful":0,"cool":0},"_qipMZnZTshpkGdoAHx3Iw":{"text":"This is a New Orleans staple! It's a must stop! There is always a wait but it's worth the ","useful":1,"cool":1},"PXLCSu1mH4JpmR8LOP4O2A":{"text":"Great time for my boyfriend to experience his first beignet....they were amazing as always","useful":0,"cool":0},"7twGHqfMnTV5-UsP3caFHA":{"text":"I was so excited to try this place as I have tried the one in Japan and this one was ok. N","useful":0,"cool":0},"_Oz7EiESp-2JqCj5jBwvlA":{"text":"A classic, as always. If you're in N'awlins, you have to get beignets!!! Wait time was abo","useful":0,"cool":0},"Q0w2pSHzpie2LPqqgEC4uA":{"text":"This was our first meal In New Orleans. I can't believe how reasonable the price Of 3 beig","useful":1,"cool":1},"uQJbT2aPKK3Q4FI6R-lXsQ":{"text":"As always the best beignets and french coffee without actually being in France..\n\nA must s","useful":1,"cool":0},"z3d93rqBA-C6Lyg9r5aeoQ":{"text":"During my recent long weekend in NOLA, I didn't grab a table here until the last day.  Wel","useful":2,"cool":1},"eDCdolVcoiOIEV-ZZvey3A":{"text":"You might see a line when you walk up, but it goes by really fast.  The Beignets were fres","useful":0,"cool":0},"qVr0wyjpm2b-8aWHBjslcw":{"text":"Omg！！！！！！How delicious these Beignets！！！！I didn't think it would be this delicious！\nBeigne","useful":0,"cool":0},"Z1kSRUkD4rT5-sCelW3VfA":{"text":"As a professional chef and former student of the Culinary Institute of America as well as ","useful":0,"cool":0},"lvYMbSnEp79u5bvq6LbC3g":{"text":"Just as good as it was 4 years ago. So happy to see New Orleans opening up and returning t","useful":0,"cool":0},"GIC0kPAKCjtGfWi8lyC6hA":{"text":"I was in NOLA for a hot second after New Year's and I was able to cross off Café du Monde ","useful":0,"cool":0},"s0xA9F0VECb_Ta1DLAl4HQ":{"text":"Cafe Du Monde is a must visit when in New Orleans. It's located in the French Quarter and ","useful":0,"cool":0},"ruWMu_svaog6pNrMMTBeEA":{"text":"Cafe Du Monde in Decature in New Orleans was the NASTIEST BATHROOM i've ever used, conside","useful":0,"cool":0},"F6UvrroLV2yxPU54BKQeqw":{"text":"This is the tourist spot to go to in New Orleans ! Many people stand in line but you can j","useful":0,"cool":0},"8xTJTgYv80rj5oyQul2SQA":{"text":"This spot was definitely on my bucket list of things to try in New Orleans. I thought it w","useful":2,"cool":1},"_CXf7Pnf-CLN-AVaS3wrig":{"text":"Great place in a great location. All outside (covered) seating, which is great for covid a","useful":0,"cool":0},"En6BafRLN-UJ6rss5deUOQ":{"text":"Had the cafe au lait and beignets on one night and hot chocolate and beignets on the other","useful":0,"cool":0},"38hX-fMcqt1F_E-hBo9qiw":{"text":"Best beignets I've had anywhere in the world, bar none.....can't come to New Orleans and n","useful":0,"cool":0},"eOW1GfKihLpL5l-yP85mjg":{"text":"The Beignets are amazing. Very long line but we were seated in 10 min. A New Orleans must!","useful":0,"cool":1},"RNGbLwdEL8agHFh3vcHFdw":{"text":"Will try and sit down with the hopes that the sit down experience fresher  beignets. The f","useful":0,"cool":0},"v5VJOr8vvnfAmA140Z_O0Q":{"text":"It was good, but nothing worth going out of the way for. It's like funnel cake. Service wa","useful":0,"cool":0},"RGEilMr1dn-u0v1vEzYd9A":{"text":"Such a fun atmosphere.\nWe were provided with amazing music from locals and freshly fried b","useful":0,"cool":2},"SILX9wrRKrVVLg29q7hVqQ":{"text":"A must visit in New Orleans.  Very convenient since it's open 24 hours.  Surprisingly inex","useful":0,"cool":0},"SoAs998hbi7qsJJSXNxY_g":{"text":"Even though know for its French doughnuts not what they once were and far from the best bu","useful":0,"cool":0},"GyRVBJRuXD-CY7XbeMOTgw":{"text":"second and final Beignet stop on my tour de beignet. We were able to find a seat without a","useful":3,"cool":3},"JFoyAoQWqcKDRB1RJMebFw":{"text":"Café Du Monde has been open since 1862!!!\n\nYou have most likely seen this place in movies/","useful":2,"cool":2},"xDexyWgoMN2sHegHEYhEdA":{"text":"Rarely do I say this, but it is entirely worth the hype.\n\nThe beignets are SCRUMPTIOUS. I ","useful":2,"cool":1},"qWODKkoYu-rMf_LSP6Qi_w":{"text":"They are famous for their beignets and deservedly so.  Don't be scared of the long lines a","useful":0,"cool":0},"1C9ImN-IJ2L67-MZ0qopQQ":{"text":"For how busy this place gets they sure do move the line quick! Plus there was a jazz perfo","useful":0,"cool":0},"Glp2Ur4kGLYd8fIE82cXfQ":{"text":"Overrated and of course a must do but I think the best beignets are at Cafe Beignet. Cafe ","useful":1,"cool":1},"WeK4gr-76mok80naIZeHmA":{"text":"I love this place. \nI was here in July, now at Christmas. It can seem intimidating, walkin","useful":0,"cool":1},"-RFKre4-INpUvYBMl0Fm0Q":{"text":"Amazing tourist spot, my friends told me that these were an essential stop when in New Orl","useful":0,"cool":0},"oPJeuGISdYtDg3bO9TaglQ":{"text":"Why have I not reviewed this place all these years? Lol it's our tried and true spot. Long","useful":1,"cool":1},"7-YBLUE5knSf2V-k6qcA8w":{"text":"Touristy?  Yep.  But also a must-do in the French Quarter.\n\nThis is just a coffee shop tha","useful":1,"cool":0},"gBny6p9_xSYmySnAuhArMw":{"text":"I don't know what you wouldn't like about this place. My first time coming here and it won","useful":0,"cool":1},"zvo6cGHygQRpQb67V17bCQ":{"text":"Come here to say you've been to the famous cafe du monde and to take pics and write a yelp","useful":2,"cool":3},"ERlelsDWNo_92Pxg08cFhA":{"text":"Always gotta hit Cafe du Monde when in New Orleans.  Came at 9pm on a Monday no wait. Plen","useful":0,"cool":0},"4XAVoDoS0SddAKr7c__mIw":{"text":"This place is inconsistent. I've been 4 times and only 1 out of the 4 times the beignets I","useful":0,"cool":0},"2Gu98d8vqAmE6nyeaD2oEA":{"text":"If you're visiting New Orleans, you can't pass this place up. You've heard about it, seen ","useful":0,"cool":0},"Mla3Ahe7uWI7io7JOOGyJw":{"text":"Yummy beignets and coffee . The best .. you've got to hit this place if your in New Orlean","useful":0,"cool":0},"swRpJeCnyUZo9_w2iJ944A":{"text":"All it's hyped up to be! Tourists and locals alike love this place and for good reason. Th","useful":1,"cool":1},"5PWZZQfwddCyrids5PgrPg":{"text":"My rating is not because the place is so packed all the time. It's almost imposible to fin","useful":0,"cool":0},"pD9OoDbdwxw8ptACgImRTQ":{"text":"The beignets is so good that we gave to come back again even in a rainy day before we depa","useful":0,"cool":0},"QVncahDCqKZeR-EH2rcA9A":{"text":"Was not totally pleased!\nNice to have been Entertained at the French quarter.\nThe beignets","useful":0,"cool":0},"VEJUmGJbu1cJVDniFU82_g":{"text":"Tip 1: If you looking for atmosphere and culture to the famous location on Decatur Street,","useful":5,"cool":4},"waiWUwRvEus38RBryfGU8w":{"text":"The hours on this site are way off. CDM (the original one in the French Quarter) is open 2","useful":4,"cool":4},"T0vEq0YoeOOZr3t2ts8MUg":{"text":"It is ok. Overpriced but New Orleans is overpriced. Enjoy most of the local jazz bands.","useful":0,"cool":0},"m-_7Rv3w3xhhQEcy4HZqoQ":{"text":"A staple on every trip to the Big Easy. Grab an order of Louisiana donuts, a cup of Cafe A","useful":0,"cool":0},"FBBOzVtCQ8iF9B9-poj64A":{"text":"Cool area and beignets to die for! Super sugary though; expect to get powdered sugar all o","useful":0,"cool":0},"scu33y6TuhQuG5ARwTpUmQ":{"text":"I went early so the wait wasn't that long. This exceeded my very high expectations: I will","useful":0,"cool":0},"H-fCLGcR4e_tomLZRBFUyg":{"text":"If you come to New Orleans you can't leave until you have tried Beignets from Cafe Du Mond","useful":2,"cool":3},"VnAyo6I9itVrBBuVbALqJg":{"text":"Fresh hot beignets and amazing live music. And friendly staff A short walk from Canal stre","useful":0,"cool":0},"zNu4bLYs7eWipvBmVtxGdw":{"text":"One of the reasons I wanted to come to NOLA was to have a traditional beignet, & Café du M","useful":0,"cool":0},"rfieSVDSY-D79q6GwrejVg":{"text":"This was amazing. Definitely lived up to the hype. The Cafe au lait was wonderful and the ","useful":0,"cool":0},"RWvqoq77-mabGQv8nW-TNw":{"text":"I am only rating Cafe Du Monde on beignets which are really quite good, don't get me wrong","useful":0,"cool":0},"doxzTG3a_-f6N28X0DU7Lg":{"text":"I really think they've lost their touch. This is our 3rd New Orleans trip. Each time we co","useful":1,"cool":0},"1KKh62jsDk0GUkVKbvDNKg":{"text":"What can I say? Part of the quintessential NOLA experience. Good way to start the day. Alw","useful":0,"cool":0},"yJ8qe_A9xDPdxxoMYszgTA":{"text":"The service was fine. Siimple and delicious not the best healthy option but if you wanna s","useful":0,"cool":0},"jhUJOWMoI-68ecx1p_iQFw":{"text":"Great little tourist spot with some good beignets. Not too pricy and they have great servi","useful":0,"cool":0},"Zt3m2aWtUSJ8aTOuxTnUdQ":{"text":"Ok so the beignets here are as good as they say. But alas they're not the BEST I've had in","useful":0,"cool":0},"DMTeuclUCsbfhqyOT16klg":{"text":"I came here because my late mother used to come here every time she came to New Orleans. S","useful":0,"cool":0},"7iHEdXiavgi2Z4enj-X8ag":{"text":"Roasted: couldn't not visit cafe du monde on our visit to New Orleans. Came by earlier tod","useful":0,"cool":0},"NGkRunl-SjS2NBNd5qcyEg":{"text":"Go here late night, after you leave the bars. It will be easier to get a seat and the beig","useful":0,"cool":0},"WxC5MYmRWhrmfqFjrWacnQ":{"text":"Came here pre covid with my friends and looooooved the beignets. We sat down the first tim","useful":1,"cool":2},"YHpHdBfEs_VRmP-O7KJrYg":{"text":"Never knew what a beignet was until I'm cam to Nola!! Once you try one, you're hooked! Yes","useful":0,"cool":0},"lSdllr2N5NIlUIL9BOKYmw":{"text":"Always better than I remembered it. I wish there wasn't a line so much of the time, but th","useful":0,"cool":0},"XnQbznKjNmpmntZEtGwN0g":{"text":"We took the detour to New Orleans to have the legendary beignets and Café au lait, and we ","useful":1,"cool":0},"BncScAcOE-LdFJz5UASyNA":{"text":"I drank an ice coffee and ate one of their famous beignets. They were amazing. If you come","useful":0,"cool":1},"NPCxVsIg2lmEbFcWjEas_w":{"text":"Customer service is non-existent. Beignets are delicious but experience is terrible. Don't","useful":0,"cool":0},"xVxPv7Lb1hkFMooSuPN9nQ":{"text":"Yummmmyyy! Must go to when in New Orleans ! Freshly made and the iced coffee is amazing!","useful":0,"cool":0},"Z00Vqtbl7jAcHNMrLXaRMw":{"text":"It is a great place for late night sweets. The Beignets were fresh and hot to order. It's ","useful":0,"cool":0},"t8wjVwMFMtksS1oH6DE9aw":{"text":"Love coming here when we're in the area. Been here twice so far and loved it! They're alwa","useful":0,"cool":1},"zMIf6Na4t2onvAnsxf22Ig":{"text":"Their famous beignets were good, fresh, and fluffy. Their iced coffee was also very good a","useful":0,"cool":0},"hEPvT05VQ-lr0gYcPsGZaQ":{"text":"Can be super LONG wait lines in the mornings, especially on weekends, but we dropped in mi","useful":5,"cool":5},"XA4xbAsc9bLShQ4zGW0J9w":{"text":"Bring cash! Bring cash!! They are a cash only place!!\nI dreamt of their beignets for their","useful":6,"cool":6},"0UfiRRLdYjNp6yrPb1ISvA":{"text":"You haven't been to New Orleans if you haven't made a stop at Cafe Du Monde next to Jax Br","useful":1,"cool":0},"Jj6EcPib6_aTolnueJ4x_g":{"text":"I've enjoyed visiting their cafe in New Orleans in the past and I now get cases of their d","useful":0,"cool":0},"WGafeiNzQkw22Q93BsfnrQ":{"text":"Always amazing coffee and beignets but the line is always crazy, so make sure to show up r","useful":0,"cool":0},"3J7GUn8lb5wBU5PdA9pFVQ":{"text":"your missing out if you dont visit here \n\nbest in new orleans \n\n\n\n\n\n\n\ni love this place","useful":0,"cool":0},"Vz8Dy0VCcf42vr4AIFFKhw":{"text":"It's a fun touristy tradition to come by every time I'm in New Orleans. I love that they'v","useful":1,"cool":1},"oCZHgJ7WhWPxd_PW_wgYqg":{"text":"Don't let the line out front intimidate you, their turnover is quick and the beignets are ","useful":0,"cool":0},"GMuJsGkHUJzvksuW7HWraw":{"text":"\"Edible pillows.\"  That's how I would describe the beignets.  I saw one and immediately fe","useful":0,"cool":1},"uU_wQlRrGEsnjOmZX3QCYQ":{"text":"How can you not try this place If you're here? It's a staple and a must try. Don't wait in","useful":0,"cool":0},"ulPXxMX-GJE6uLand-ihjw":{"text":"Fun memories are created here.  The beignets are delicious, served fresh and hot with moun","useful":0,"cool":0},"3Ar4ot7VAJSpPK3UZtfv4g":{"text":"Cafe Du Monde is such a delicious treat !\nI enjoyed coming here pre covid, but right now w","useful":3,"cool":2},"4TCeWDt6rdxcy_LwA2v_cQ":{"text":"I guess this is one of those \"must see/visit\" places in New Orleans.  The place is a mega ","useful":0,"cool":0},"9wnKqH4xOCnFhdTvjXTL_g":{"text":"How can you visit New Orleans and not visit Cafe Du Monde? Yes, the line can be long... bu","useful":1,"cool":1},"6o2FviEX-cemTHsM1jZbpA":{"text":"Extremely rude service. The waiter insulted us when my friend asked whether we can pay by ","useful":0,"cool":0},"ThML8gCkXDX7cxNyRj2Ngg":{"text":"Way overhyped in my opinion. I am a HUGE food network fan and have watched numerous chefs ","useful":0,"cool":0},"qLH5nf_gzMyJdZDu9Sv6Pw":{"text":"Firstly the prices were modest. The coffee was good.  Flavor was fine of the beignets but ","useful":0,"cool":0},"67aZWh0fPdY_7gduZcbTWQ":{"text":"Blacklisted! Long line and donuts weren't even good. They seemed commercially made -- with","useful":0,"cool":0},"vvmGYyszvQCovXnIJ1rMxg":{"text":"For a local landmark, and even comparing to others as a regular cafe, it was disappointing","useful":0,"cool":0},"XTL-0jVoKckTMkysDaIdnA":{"text":"Love the beignets & Cafe Au Lait combo. No visit to NOLA is complete without going to Cafe","useful":0,"cool":0},"RHfGeK-SnwCzjAdxdYB9xQ":{"text":"This is the original location, and you MUST stop here for the true NOLA experience!! It is","useful":0,"cool":0},"mILyQxvAAVkLWumCASG8Sw":{"text":"Delicious.  Consistent.  Classic. \n\nNote: I recommend going around the back to the to-go w","useful":1,"cool":0},"wY4Bx5csGXRzGNIhjSza8A":{"text":"Overly hot drinks and pre packed beignets that are cold and chewy by the time you sit down","useful":0,"cool":0},"MqqyY33ktjVB0NNGHSZvZA":{"text":"Good beignets and coffee; don't use the restroom here, and know that the whole place is ki","useful":0,"cool":0},"ifyvSTQDgQewaSLX_Ihkug":{"text":"It's not a surprise that Cafe Du Monde was on my list of places to visit on our brief trip","useful":1,"cool":1},"JyzZ2Qlo144M_rO1L-sFwg":{"text":"Amazing! Definitely have to come here on a visit to NOLA! The beignets were so delicious! ","useful":1,"cool":1},"u8l50fhSFNBAaQL4B-8X9Q":{"text":"Café Du Monde, Café Du Monde - so nice you gotta say it twice! The beignets ... BELIEVE TH","useful":0,"cool":0},"IDKJdMVyxYYFfO3-4AT0oQ":{"text":"Gotta visit while in NOLA! It's a tourist trap of the best kind-open 24 hours and a great ","useful":3,"cool":0},"axW5k284oUNqnyx6JJcMfA":{"text":"If I use my theory of comparing similar places to overall experience, I can compare Cafe D","useful":8,"cool":6},"n21O0l5KVgVpaaKg2Vicwg":{"text":"A must visit for the full New Orleans experience even though it is very touristy. Always f","useful":1,"cool":1},"dF3ERpxazhFwnYRuNEBfOg":{"text":"This place was awesome. The begneits where amazing fried to perfection everyday we had the","useful":0,"cool":0},"WZH03xV-_flrwjpXXjsMvQ":{"text":"Great coffee and delicious beignets completely buried in powdered sugar! We ate there ever","useful":0,"cool":0},"q-pWLGgLnL4Iysq-J-waHQ":{"text":"Definitely a place you need to try because it's a New Orleans staple. Coffee and hot choco","useful":0,"cool":0},"0XSVS5nZNTV8Qb5GDi5AFg":{"text":"Smelled like vomit, pigeons everywhere and the staff barely speaks English. Food was good.","useful":0,"cool":0},"yDhZB9VulEJ1fKH_ycutAQ":{"text":"Did you really go to New Orleans if you didn't go to Cafe Du Monde? Came here based on num","useful":1,"cool":1},"U92ubolN13l-i65dOebIBw":{"text":"Absolutely amazing! Yes, this place is one of the most hyped spots in NOLA, but for a good","useful":0,"cool":0},"MYf7HZjpqhCCSRvTR1ZU5A":{"text":"Do people need to hear again what an institution CDM is? Its been here since the 1860s! Th","useful":1,"cool":1},"1t-r5vV3pPVXuYgih3hQLA":{"text":"This is my first visit to New Orleans. And as a first timer, I cannot skip Café Du Monde. ","useful":2,"cool":0},"I00rIwsSUJlLS659PPOqLA":{"text":"Does this place really need another review? Especially with its simplistic menu, your choi","useful":2,"cool":1},"bCbMcs65_Xo8BcQ9OIY_3Q":{"text":"Always great. The beignets are made to order. The service is great and it is so cheap. The","useful":0,"cool":0},"Uo2kuN3SdgJqDddFS6JHhw":{"text":"The line moves fast!! \nThe staff helps everyone moving by keeping an eye out for opened ta","useful":0,"cool":0},"5V1qmlzM_wGRE8OrdiHuNA":{"text":"The beignets here are exactly as good as they are reputed to be.  Expect to wait in line f","useful":0,"cool":1},"JNH_pBxFUTl19qdDNbiFNQ":{"text":"I had beignets here twice during my recent trip.  Both times I went there, I must have bee","useful":0,"cool":0},"D8iwiyubTCpE9HnAgm8o7w":{"text":"Line went around the block at lunchtime so decided to come back at 930.  No line! Except f","useful":0,"cool":0},"zK4Q7yRlAM0WwshJzHkf_g":{"text":"Gotta stop here even if it's jam packed. Really cool experience. Just pop in for a quick c","useful":0,"cool":0},"NmIvFLcxdO_dtU1M7l2V1Q":{"text":"The best ever! They are freshly made and they just melt in your mouth. Make sure to bring ","useful":1,"cool":0},"TsCgHPuP9y5O375C-T9vRA":{"text":"When in New Orleans do what most do and stop in at Cafe Du Monde. They are the original fo","useful":0,"cool":1},"7Qiy0A1OOC8PSN-mxd8tbA":{"text":"Okay this place apparently is the must go to for beignets in NOLA, but I thought it was a ","useful":0,"cool":0},"_fVs61rqxoFbwzFR0D2CBA":{"text":"It is fitting that the last place stopped at on my trip was Cafe du Monde. It was around m","useful":0,"cool":0},"UDDZTAJNzIp-wB8gvfqXmQ":{"text":"A little chaotic because of the rain today but the servers are nice and the food comes rig","useful":0,"cool":0},"r8k68t-20E7fV0665x1gEQ":{"text":"Very tasty!\nFast service. Loads of sugar. If u have cash go to the right side of the cafe ","useful":0,"cool":0},"A7Bv8lhnfnOSNbrALHz3lQ":{"text":"Everything as expected. Amazing. Brought a few boxes back to Rhode Island to attempt for h","useful":0,"cool":0},"7tJxRd8w4r1CTNEdT4Gxzw":{"text":"You can't go to NOLA without stopping at Cafe Du Monde. Service is fast, beignets are fres","useful":0,"cool":0},"4t2olcx7s14pFCfW1h2XnQ":{"text":"New Orleans classic... as good as alway.   A little different now with Covid in that they ","useful":0,"cool":0},"U1TPVzHaxbx2m0LYH1gC9w":{"text":"A very famous spot right in the heart of the french quarters. I have been to this place a ","useful":2,"cool":1},"fTMnmVcqCHUpRpZ3buEXpw":{"text":"I promise I willlll come back to New Orleans for Cade du monde and the fried oysters alone","useful":0,"cool":0},"Ph8AKCjAT0WV7LhBwbwELQ":{"text":"Yuck!!! Always loved this place, but I went here before I headed home to bring some back f","useful":0,"cool":0},"wSpALbY9YI6hDg848zWeGA":{"text":"Ok. This is the spot for beignets. Went to another place the day before and not quite the ","useful":0,"cool":0},"D06IXaHyqv2ehaxqVqRD5w":{"text":"This is the OG of the beignet.. This is a must if you are visiting NOLA.\n\nThe coffee is ho","useful":4,"cool":4},"RMzDvE9Un7LrPin9gxOXKg":{"text":"Beignets are very good and fresh, pairs great with cafe au lait but the service here sucks","useful":1,"cool":2},"lLEaEkSkN4I3I-JxZx-qeg":{"text":"I like beignets, but the beignets here were just ok. They're good, but I've had better. Th","useful":2,"cool":1},"kwXHPUz2ie9blU7vhz0_pw":{"text":"What's all the hype about?  It's an old cafe that's survived for years and years?  That ha","useful":4,"cool":1},"-liimjHDjtjtnJoyetjlXw":{"text":"First time and was excited to try THE CAFE DU MONDE beignets. However, when we arrived the","useful":0,"cool":0},"z0bIeL13fnYquNdy0aEoBw":{"text":"Was visiting NOLA for the first time and had to do the obligatory pit stop here. It lived ","useful":0,"cool":0},"cv1yk8LJX9N3cyBIC1C3Qg":{"text":"Absolutely worth the hype. A must do if you're visiting NOLA! The beignets are fresh and d","useful":0,"cool":0},"6iWiYUkVqu2m0WVErjCGAg":{"text":"What can I say that hasn't already been said. You have to do this when you are in New Orle","useful":0,"cool":0},"VIWpN_P3aWoQErFc-_K7nQ":{"text":"A chewy hot donut with enough powdered sugar to make Scarface jealous.   Get this place of","useful":3,"cool":4},"xi0JiII2kXyGrBXwjjwEbg":{"text":"The perfect place for a break!! The coffee and the food is amazing. \nEvery time I can, I g","useful":0,"cool":0},"aBl1Sw36qqduRlFiX7YUEw":{"text":"Love this place! The beignets are obviously to die for, not much to review there but I'll ","useful":0,"cool":0},"4z4h0UNGRB7x4atTZELHXQ":{"text":"A huge disappointment. This establishment is highly rated and their beignets were describe","useful":1,"cool":0},"JAo2QOoX3NhkG1uQcn345w":{"text":"French Quarter staple.\n I've been coming here for decades each time I visit from Houston. ","useful":20,"cool":17},"fxQ7QwIVdQdPH4updVSv5w":{"text":"The best ice coffee and beignets ever!!!! Absolutely loved it! My husband and I had the be","useful":0,"cool":0},"GUOKB1x6fdilGLIYI2jqcw":{"text":"We visited this cafe during our stay in New Orleans and walked 4 miles to get there. They ","useful":0,"cool":0},"BRPFFstS4XX9NUxIzJ54jA":{"text":"**CASH ONLY**\nWhile visiting NOLA, we went twice. The beignets and the frozen cafe au lait","useful":0,"cool":0},"cOKGnLT3wEyzoSa5VMdo8Q":{"text":"It's what you do in Nola! Beignets are delicious. Wish they kept the seating area a little","useful":0,"cool":0},"26-Yv3FanxbhmT3dimk71A":{"text":"Great food, but service was mediocre and it was pretty dirty. They sat us at a table that ","useful":0,"cool":0},"gA4eD6niYkAT2iIJXJjXmw":{"text":"Historical, delicious and inexpensive! They're 24/7 and A MUST when in New Orleans. It's a","useful":0,"cool":0},"kIp35zqnAfLz8JBiDrZFGg":{"text":"Busy as expected! Skip the longggg line & get to-go then find an open table. A staple if y","useful":0,"cool":0},"-eWUzXnmerWXCzYalWCzMA":{"text":"Cafe Du Monde is an institution at New Orleans.  It's a symbol of the city: a bit dirty, b","useful":0,"cool":0},"ATcob2eHyFVIl2xzf6jLcA":{"text":"I love it here! \nWe went twice in our trip and it was great both times!\nI love that they'r","useful":1,"cool":0},"3TvkiuwmLPOsRGaRN3kJlA":{"text":"Warning.  Cash only. But worth every dollar! My BF and I shared an order by the river and ","useful":0,"cool":0},"CCoQfEqGjZDDM2s9Mg-eZQ":{"text":"Seriously not sure what the hype is! We stood in a long line to discover a dry chewy cardb","useful":0,"cool":0},"YM7MgulZO_MrdMPm2hoPUg":{"text":"This is the place you need to go for beignets. Long wait though. We went once on our trip ","useful":0,"cool":0},"iLJb59N0aGzFZc70sVKdWw":{"text":"lived above and beyond the hype for me, like a dream come true. it started when i over res","useful":0,"cool":0},"X6eEIhaaVZOBfS7nH9UQZw":{"text":"Its 2am. You are stumbling off Bourbon street looking for that perfect food to end the eve","useful":0,"cool":0},"q654d2YqV8qsBfcHqn6p4A":{"text":"Quick visit to Cafe Du Monde for beignets and hot cocoa. The service was slower than usual","useful":2,"cool":2},"lT2MO-OTTSFLp1OZBMKKjQ":{"text":"What can you say, there's nothing quite like this place. Dirty, lousy service, long lines ","useful":0,"cool":0},"_v5YRISGBAapUFuFfqqa1g":{"text":"Two take out windows open due to COVID. Waited 20 min in line in the heat and when we fina","useful":0,"cool":0},"Aho2bw_COLS69NreW1fj-g":{"text":"This is an absolutely necessary stop in New Orleans!","useful":0,"cool":0},"AdZVbGm6xtbqmf5ob0A68Q":{"text":"Do not let the line detour you as it moves fast. The food is a bite of heaven. The iced co","useful":0,"cool":0},"BL7Fph1NZimbHKTqjCDGbw":{"text":"Ordered directly from NOA. Reasonable prices. It's my everyday brew!\n\nThe Cafe Du Monde Co","useful":6,"cool":8},"20RPpLPzQrrm2puKx80Z8Q":{"text":"Completely honest and somewhat unpopular view, but the beignets here were only meh. I came","useful":1,"cool":0},"KUMrA73MYuzr4PNJKqUojA":{"text":"We came back here TWICE on the same trip. Their beignets and hot chocolate are to die for!","useful":0,"cool":0},"cG09o9Ps3oqxvOgZQzeJhQ":{"text":"This place is surely on everyone's tourist to do list. I came by for a coffee and a beigne","useful":3,"cool":2},"2_1lal_pWiwiZJSBM7XD3A":{"text":"For people who have never been here. You must understand. You wait in line and wait for a ","useful":0,"cool":0},"GHaNddM39QhhjIBp7j9y4A":{"text":"I love beignets and visit to get them everytime I'm in the quarters HOWEVER I was less tha","useful":0,"cool":0},"jhI12Q209YjaMYVFdqoAgg":{"text":"I love their beignets, my favorite in NOLA!  The cafe au lait is wonderful as well. Always","useful":0,"cool":0},"LbxVs1X-GGfyRmLUmIegpg":{"text":"Went on a week night, surprisingly the wait wasn't terrible. We were able to walk up and o","useful":0,"cool":0},"OlakHPwYJZClf_RZ1q7ObA":{"text":"It's the original! Nothing compares. We had a lovely breakfast here one morning and a grea","useful":0,"cool":1},"lg1SxfywOCx5HK6IZgGrbQ":{"text":"Read a couple iffy reviews that were recent and should've took their advice to avoid.  It'","useful":2,"cool":1},"46dAldZeadke1vTXX-fi0w":{"text":"Beignets and cafe au lait! Those delicious little pastries full of powdered sugar are deli","useful":0,"cool":0},"AJy_MHqlfBU1qMc6ONCsqA":{"text":"This is only the BEST beignet place in the entire world. It is a must visit on your visit ","useful":6,"cool":6},"6h4JL-2pQ-Kxayd3KNxK8g":{"text":"A great spot to stop at for a quick coffee and snack break. They have a lot of outdoor sea","useful":1,"cool":1},"-m6mfNbwODvPLqnkl9ZIow":{"text":"Don't let the long lines deter you from enjoying this iconic french bakery. It should be a","useful":1,"cool":0},"iT2bmof23FNL_-WsJo0aJQ":{"text":"First time here and it was okay. Of course, we waited in line but not too long about 10min","useful":0,"cool":0},"2IssWufiIyLdUdFBp3jSZw":{"text":"Beignets are good ! But the service is really bad ! The servers just care for their own re","useful":0,"cool":0},"SNmR4VWldSiqpCMrZYgkQw":{"text":"Yum! My first order in New Orleans. It was lukewarm, yet good while the others in my party","useful":0,"cool":0},"6AWk-OMcMLnv9s_Hg5poRg":{"text":"This was a great location near the waterfront that is open and airy, feeling extra safe du","useful":0,"cool":0},"eBvuLWvwlvk93XWuM1nRtA":{"text":"There always seems to be a long line at this place\nbut it seems to move quickly.\n\nThis pla","useful":0,"cool":0},"ZCOULb8Ssau9faBkW7oyiw":{"text":"Café Du Monde is one of those places where even if you've been to New Orleans 1000 times y","useful":3,"cool":3},"lNvt3ycDS4t0FNrhOvPvAg":{"text":"The Beignets were good. The frozen coffee was my favorite. The hot chocolate was delicious","useful":0,"cool":0},"pimBgKgQiKSLt7i7nP98HA":{"text":"We went to the one east of Jackson square around 8:30am. It wasn't busy yet. I could not b","useful":0,"cool":0},"J0_elGNL4moYFu37rUp0Fw":{"text":"Popped in here around 2am the other night and sadly, I wish I had not. It smelled like gar","useful":0,"cool":0},"PQrxj2I8Pl_CLxqwURx3Pg":{"text":"Amazing beignets!  Eat them hot and covered in powdered sugar. Not impressed with coffee/c","useful":0,"cool":0},"AaUV4pjHFLPhrDj_vtG9PQ":{"text":"Like it or not, this place has done a good job of being a MUST DO when in New Orleans.\n\nDo","useful":1,"cool":1},"8J_CBq_RCO2wwfHgMW6Plw":{"text":"This is a must when you come to New Orleans. On every list I read before we came it said \"","useful":0,"cool":0},"OHzoWVmiIXqpfGjmnn7KPQ":{"text":"I am not a sweet tooth and I am pretty careful about my calories intake. But I can totally","useful":0,"cool":0},"Q7Wmc2bsyFHJrmXR0vO9DA":{"text":"Must go to in NOLA based on reputation alone. Lines move fast. Beignets were warm. However","useful":0,"cool":0},"I2kka1N0FrugbMrKJ8h3mw":{"text":"I realize I'm in the minority here but I've had better in gulf shores Alabama. Dry, cold, ","useful":0,"cool":0},"Tskl9qZyLy3Lf837OQC0Eg":{"text":"When you visit NOLA I think its a must to stop at a place lime this because its mentioned ","useful":0,"cool":0},"x_xfhFU9a7yW4i6bzJkpHg":{"text":"My sister and I stopped here bright and early one morning after the airport. We got here a","useful":0,"cool":1},"4t4VZ6sArY52zIr8UTgGoQ":{"text":"The food was good but the staff was awful!  The girl packing the beignets that literally w","useful":0,"cool":0},"aYWtxi0MgMz3TDtJ4xEz-g":{"text":"Website states 24 hour operation. We called to confirm and when we showed up they said the","useful":0,"cool":0},"A1cPFqMV24KoO39wI-B7Kw":{"text":"Amazing and famous place. DO NOT WAIT ON LINE OUTSIDE! JUST WALK IN AND SIT DOWN AT A DIRT","useful":0,"cool":0},"S_4QiB7WXv7QdWRibxUYEg":{"text":"This is a must-go in NOLA.  Their beignets paired with the cafe au lait is divine!! There ","useful":3,"cool":2},"VCiKH7yPHvyDHGkvuTczzw":{"text":"A must try if you're in town; but it is a big tourist spot. Get here early or be prepared ","useful":2,"cool":1},"MwLc7UE9TrCS-rcqPCzt1Q":{"text":"Worth the long wait! We went to both locations and if you don't mind not going to the orig","useful":0,"cool":0},"mCjJpAL0KAmkKJfDBDL8WQ":{"text":"I was super underwhelmed after trying their coffee :/\nThe line is long but goes by pretty ","useful":0,"cool":0},"vMyzxsFFa5KpUCrr0XdMAw":{"text":"It's alright. I don't really get the hype. I used to come here years ago and it was a grea","useful":0,"cool":0},"1wBDw6HOc-GKKGWsh8PfGg":{"text":"This is, of course, a must-have in New Orleans. It is loud, hectic, and crazy, but that is","useful":1,"cool":0},"rN3gz8MY3Ya8ITSNLGpUNg":{"text":"We first tried the Beignet at the City Park during our bus tour. The lines were not too lo","useful":0,"cool":0},"xsyfzq4u83WpgHYDDmCIiA":{"text":"great service! the best beignets and coffee. always fresh and tasty. would recommend to an","useful":1,"cool":1},"ukmv6YfUxKY_Qa7i1QUupQ":{"text":"Can you not stop at this famous spot and enjoy their famous beignets? It's been a bookmark","useful":18,"cool":15},"Sstd75YutBlZTgjT9iM0CQ":{"text":"I finally had my first beignet this morning and it was worth the wait! It's like a funnel ","useful":0,"cool":0},"4Jak0weWEpq6YMnOed55zA":{"text":"Never been to NOLA before so wanted to try some beignets as we drove through. Most places ","useful":0,"cool":0},"IPzNOmHl3DztHwJdy8jbLg":{"text":"If you want to check this off your list then take a visit otherwise I would suggest not to","useful":4,"cool":3},"jVD-8ZDj6HTV_ote10TD6A":{"text":"There is a takeout line on the right side and sit down on the left. They only accept cash.","useful":0,"cool":0},"01xf23jRMbVkRxC7YLiQ2A":{"text":"When in NOLA this cafe is a must visit on every ones list just as I did back in March 2017","useful":1,"cool":1},"RSX9Q5UZweNS2_Ce-EfKEg":{"text":"You just can't beat the original. Worth going out of your way for! Delicious! Cash only.","useful":0,"cool":0},"gg8NeroYemSFdjDqCyMbNw":{"text":"Warning, they only take cash. There is no ATM in the restaurant and the one they refer you","useful":0,"cool":0},"GYth_BtRsXdgjCkT_BJrsw":{"text":"Nothing like  the beignets and chicory coffee from this place. Unfortunately you cannot wa","useful":1,"cool":1},"LZjh7lkevjPX7n17pHnDsw":{"text":"YUM - world famous beignets (donuts) and the BEST chicory coffee. Note to self: buy some o","useful":0,"cool":0},"Sv5fOeTNrcqSuf6FCIOV2Q":{"text":"Was so excited to finally come here! First time in NOLA I had to make a stop, line was so ","useful":3,"cool":2},"tRuFeIi2LYAi45uIzxfh3w":{"text":"Look, I don't know if it's because of covid and they didn't have enough staff or what but ","useful":0,"cool":0},"_oI42oG_cvAxvXahzdLBDg":{"text":"The beignets and coffee were good but the overall service and cleanliness was terrible. I ","useful":2,"cool":2},"U2dnpDGOy5IbFy5rmKuNOA":{"text":"Went around 10:30am-place was packed (expected this, so no worries) chairs and tables were","useful":0,"cool":0},"N5nm1U0ZznfPdIRJLTRtsQ":{"text":"Definitely hit this place up after dinner. Short wait but worth it. Be prepared for the me","useful":0,"cool":0},"0bc3Oh73LO6YqlblfDXN4w":{"text":"Checked out the famous beignets sight ever! They were warm not piping hot with a cup of po","useful":0,"cool":0},"uRDBIsekKmrfKuAMtBIl8g":{"text":"Having visited this place since 1986, this is currently a shadow of its previous glorious ","useful":0,"cool":0},"dJge5b0oaIt-Y4j7MSaKHQ":{"text":"If you do it once there is no reason to do it again !  Long lines and all hype plus doesn'","useful":0,"cool":0},"VEpyfImfnYGEZPZCyPc3Lg":{"text":"Food: 5/5\nService: 3/5\nCleanliness: 4/5\nDecor & Style: 3/5\n\nProbably one of the best, if n","useful":2,"cool":2},"ygC8N4UP4ocrpgGl8HpM4g":{"text":"Everyone raves about this place, we found it average at best. Other places in town have be","useful":0,"cool":0},"E6rzc_JuzVowYvd1BYcDQw":{"text":"Tourist trap with mediocre beignets! You'll see big crowds, but don't be fooled. It's just","useful":0,"cool":0},"Y8VRrMWZYSub4AvmwZ8Wsg":{"text":"So yummy! The beignets were everything I expected and more!! Would recommend having cash, ","useful":1,"cool":0},"5PlV7pzuuwJIP7nnpakrTw":{"text":"I finally try the cafe and beignets  from nola a tourist place\nBeignets are prime made\nKin","useful":0,"cool":1},"ky8TZhJ7CjLokslk2ixlMA":{"text":"We only stopped by here since my mom needed something to drink. She went inside to get som","useful":0,"cool":0},"RQy41llL89viUgs5bklJnQ":{"text":"Anyone who says something negative about Cafe du Monde has NO SOUL. The beignets are like ","useful":0,"cool":1},"zVUJfV9G-2Y50L0FZezUCg":{"text":"A must try while visiting New Orleans. The coffee was almost better than their world famou","useful":0,"cool":0},"oqDE-Pb80xYw9bnpofCREA":{"text":"NOLA's famous Beignet place. First of all the floor is covered in powdered sugar so if you","useful":2,"cool":2},"Kk3O_0T6SPS28fWydV_M4g":{"text":"Oh happy day! I came here for the beignets! \nI was ready for the line, I had my umbrella t","useful":4,"cool":3},"IWMOcmqPB6TDbYbNQvjOaQ":{"text":"More than 1,000 reviews saying how good their beignets are and they are right. \n\nI think t","useful":4,"cool":3},"pxH8NuZdYImFrxh7yOzu-Q":{"text":"Great coffee and Benight were amazing. So glad not only a friend recommend but the hotel s","useful":0,"cool":0},"9GsK9Xe9X4pLjWZGLnG6hw":{"text":"Cafe Du Monde has given up. An outdoor cafe, there is no excuses for pre-making beignets, ","useful":13,"cool":5},"dkI23RStryQvkWbFHMWhNw":{"text":"The one place that everyone go to when they visit New Orleans, Cafe Du Monde. \nThe line go","useful":0,"cool":1},"97cKgoNVEtztD0jCWmF26g":{"text":"Pretty much everyone I spoke to about what to do in New Orleans before my recent visit men","useful":3,"cool":1},"kYMyysyXSDf6bQquLDoGyA":{"text":"Love the everything but the service.. the service destroyed the whole experience.  There s","useful":0,"cool":0},"S1dW-whxFNAmM1nsWdtqfQ":{"text":"I was very excited to go here during my visit to NOLA in March. My family always uses Cafe","useful":2,"cool":1},"_dY1G4votSUPPrE8ryzrxw":{"text":"I understand the craziness when people say to go to this place if you're ever in New Orlea","useful":5,"cool":4},"ypKALmdeg_5dbj6lt_SYfA":{"text":"Yep. Worth it. Worth the wait. So good\nWe knew there would be a line, but I don't think we","useful":2,"cool":1},"f_LoBmFAJYhBh4VknU3K3g":{"text":"I was very disappointed with my last visit.  The people were rude. The beignet were cold a","useful":0,"cool":0},"pdfUe8fHTHJVe64HPJG-ZQ":{"text":"The beignets were absolutely terrible yesterday, and I would suggest you stay away from Ca","useful":0,"cool":0},"u377IoPvIwoUImuto8c5Ww":{"text":"Best beignets I've ever had hands down. Warm and full of powdered sugar. 3 per order. Wort","useful":0,"cool":0},"B5FjcAGL-eiZ4LO8013Zfg":{"text":"The beignets were to die for. There's a reason this is a tourist spot. Outdoor seating is ","useful":0,"cool":0},"zQJYfbOrq0MbVCQqZW-QeA":{"text":"Oh cafe du monde. Your been yeas make my heart sing however you may give me diabetes somed","useful":1,"cool":0},"U2g7xQ7aIxWoi2Ua37KhtA":{"text":"I think this place is great but not that great. The bengeits are good but its just fried b","useful":0,"cool":0},"baFEjCBkzdtX1CQo0YscsQ":{"text":"Iconic place which keeps it simple but amazing, our beignets were hot and delicious. There","useful":0,"cool":0},"K6HqPTHQ7vA_okzUpwWujg":{"text":"After hearing about this place for so long, I finally got the pleasure of trying them not.","useful":1,"cool":0},"gjkK1oGGi9PrO5g6-5AGaQ":{"text":"This place has gone downhill! What a terrible shame! I was first here in 2015 and it was s","useful":1,"cool":0},"2JDbvkJcb00g5wFSwYHpng":{"text":"Note: This is a long overdue review from last year.  I thought I had posted it on my way b","useful":1,"cool":2},"a74-NTOHB8UXyTiqvZxlcw":{"text":"Any place with powdered sugar on the floor is a place for me.  Nothing better than a café ","useful":0,"cool":0},"nIv0AQ0CamDHuxue1mL7Qw":{"text":"All I can say about Café Du Monde is...\nYou have not been to New Orleans if you have not v","useful":1,"cool":0},"jGtGDAj3nHgoUnAZmWNXeA":{"text":"This is a must everytime we come to NOLA! We've been lucky and haven't had to deal with su","useful":0,"cool":0},"SBLZEhdGLiLXCyZk3cyKZw":{"text":"If you were allowed to eat just one things in New Orleans, you would have to pick the beig","useful":1,"cool":1},"mCyrQx-XFsl2bf-OKXzALg":{"text":"Obviously a must try. The line was quick and the  Beignets were warm and delicious. A jazz","useful":0,"cool":1},"VzHk7PBkG8UYB-odfTd78g":{"text":"I waited to write this review until I tried Cafe Du Monde's local rival Cafe Beignet. For ","useful":0,"cool":0},"w6e-kc4YjigY5BYmdtQD9w":{"text":"Cafe Du Monde is a popular destination in New Orleans, and it often feels this way. If you","useful":0,"cool":0},"XKWOug4R1-J0tHy49BAmyg":{"text":"This is the worst tourist trap imaginable.  \n\nPicture this: it's a chilly, rainy afternoon","useful":0,"cool":0},"1-h52ukNPBaS_suLafARtw":{"text":"Let me send out a disclaimer before I proceed with this review. Cafe Du Monde is a New Orl","useful":5,"cool":0},"OUICOejrba2L0PsEgVGYMA":{"text":"Disappointed in the quality. Came on a Sunday and had no idea it was spring break week ---","useful":2,"cool":0},"UeYYD_nRas6tUq9KsosiIA":{"text":"Delicious! The line was super long, but they had another line just for take out. We only w","useful":0,"cool":0},"e8x8sKKb186r-PsqqRoYXQ":{"text":"Ummmmm yummmmm!!! After waiting an hour in line it was worth the wait ... everyone says it","useful":2,"cool":1},"cFdfs7HvEOTkQft76G6LrA":{"text":"Whether you're a Louisiana native or just passing through New Orleans, Café Du Monde is th","useful":1,"cool":0},"no-qKW4kZCXD2ZKLGthZwQ":{"text":"I've always loved this place.  Though the lines can be super long the taste of these beign","useful":1,"cool":1},"BDLPhsXoq-Dg17vutS9ULA":{"text":"Entrance/Ambiance: Make sure to bring cash! You can seat yourself upon arrival, whether it","useful":1,"cool":0},"J3AW0Ux0rFPw8fZXQGoWlw":{"text":"I grew up in the Crescent City and whenever I'm back there, we go to CDM for donuts and co","useful":0,"cool":0},"ot2I73cTmo7xpqiY153C9g":{"text":"I supported this place for years until last weekend.  I bought friends in the midst of pan","useful":0,"cool":0},"hfycdozzvG3t8LaM6WPWAQ":{"text":"It's a hit or miss. Been here three times, first two the beignets were soggy and oily. Thi","useful":0,"cool":0},"SjwsG_aDAZgu7zinqj1kXA":{"text":"Historic place to order beignets.  The cafe au lait was good with a hint of chocolate from","useful":0,"cool":0},"VXW_GrXIGybi5xM6G4Fm2w":{"text":"Most overrated place in New Orleans, you've got a reputation, but the reputation should be","useful":0,"cool":0},"TMx8Lrt2b85tt_AaOQYcpg":{"text":"Cafe Du Monde is one of the most Instagrammed restaurants in the US. Therefore I had to go","useful":6,"cool":2},"kwNjdN5STNR2hQLE4OntvA":{"text":"Always a favorite for natives and tourist. Great hot coffee and iced coffee with the world","useful":0,"cool":0},"udf0ZUBvedvTET7yfvUP2A":{"text":"So satisfying for breakfast! Warm and soft beignets with powdered sugar hit the spot! Coff","useful":0,"cool":0},"n-WoysT-2YOK9axTsR5j8w":{"text":"I had to stop by the famous cafe du monde. We came here on a rainy day and found a table i","useful":1,"cool":0},"1Fxg1u2ZHG2zUmo8RlRg5g":{"text":"Okay, I went again today and it's packed! When it's packed it's hot and fresh, if it's emp","useful":1,"cool":0},"8LpPgEoe09XBzOP1ji-6Hw":{"text":"You can't visit the French Quarter and NOT go to Café Du Monde. A hot, fresh beignet from ","useful":0,"cool":0},"AzcikpoBzW5p0GrysIQ0BA":{"text":"Beignets were so good! We sat outside and people played music right in front of our table.","useful":0,"cool":0},"OTprC-6tpm4vvIsX2o1wlw":{"text":"Awesome place. Prices haven't budged in a century. Well worth it. Visit the Canal St locat","useful":2,"cool":2},"gbonvLf2oYKcRjyRTWNpFw":{"text":"When in New Orleans, you must try the beignets, and Cafe Du Monde is the place to be.\n\nMy ","useful":1,"cool":1},"UAzxd7wYfNXoSGCRPP0b3A":{"text":"What can I say that hasn't already been said.  This is definitely a must when in Nola.  I ","useful":2,"cool":1},"fRDvpnZLaloJPuQseMlODg":{"text":"The lines are ALWAYS long, but if you have thirty minutes to stand and wait (outside), Caf","useful":2,"cool":3},"9buO9-KMvbqLcHK_wiiYgw":{"text":"One male Asian looking waiter In his 50's or so has sarcastic attitude towards me and my w","useful":0,"cool":0},"8xt5_NgBSE5Y8Rgz0N4LLQ":{"text":"I've been to Cafe Du Monde a few times over the years, each time I've been on vacation in ","useful":0,"cool":2},"dF3-x-7Tk_yW2H2OBf7h9A":{"text":"This place has always been amazing from the first time I came. The atmosphere is so relaxi","useful":0,"cool":1},"tU4A_xuommgd7pjOJUauAg":{"text":"I'm here to rave about the online ordering process! In the midst of social distancing, I d","useful":3,"cool":5},"wjfkIbnGXseLTS-h0V_tDQ":{"text":"The lines moved quickly and the beignets were great. I wanted to try the coffee, but I was","useful":1,"cool":0},"Wt_JamvKPRY9UZ6bjlnMzA":{"text":"When in New Orleans, you kinda hafta come here, if only to bring your first-time visitors ","useful":3,"cool":4},"WisPfYXkoTPYhRe8JKWoGA":{"text":"2nd time here since 2016. Love the combination of cafe au lait and beignets! Of course mus","useful":0,"cool":1},"knxQXYb2eirWlWIDlLhmSw":{"text":"This place is a classic, what can I say. The menu is what it is. The line moves fast, so d","useful":3,"cool":1},"ZQS_gFBP7-DUUMpTxVj-MA":{"text":"This is such a must have when visiting New Orleans!!! Every time I come to New Orleans I v","useful":2,"cool":0},"3VyGhF_Uri8hK6PBxWi-jg":{"text":"It's a late review, but better late than never. I came here with a group as part of an Alt","useful":1,"cool":1},"V3WoVb7Ra-Zk3BHkCkOuFQ":{"text":"Where do I begin my first quick and only visit to Cade did Monde?  Well, I've wanted to co","useful":1,"cool":1},"IMtgchkPgOQbgnkL_zPasw":{"text":"Definitely worth the hype. Tip: skip the \"line.\" The employees says its not official, but ","useful":0,"cool":0},"5weiSdmxSGXMUBgzerfnsg":{"text":"You can't go to Nola and not stop in here for a coffee and beignet! Be prepared to leave w","useful":1,"cool":0},"ZMvi4i3R-k-zHJR9AMfzQA":{"text":"Visited before COVID hit.  Enjoyed the excessive powdered sugar and beignets.  My kids wan","useful":0,"cool":0},"sjIaNkRmwFhsxIh72_NeSg":{"text":"It was worth the wait. Some of the beignets were crunchy and hard, but nonetheless, the co","useful":0,"cool":0},"vLmy7uNupiJXocybNF0ESg":{"text":"I think everyone who ever mentions Nola gets immediately told to go to Cafe Du Monde... an","useful":2,"cool":1},"7v1Y7viQb1uvieFdIW02hA":{"text":"I wasn't going to come to New Orleans and NOT go to Café du Monde. Amazing atmosphere. Ama","useful":0,"cool":0},"ogqvVKMIQ9ULMVdy2Ww4kw":{"text":"They are pre sorted in bags. Not fluffy. Seem doughy and kind of hard. Unfortunately, just","useful":0,"cool":0},"hs3beXyxl0E02bLUuGGHuA":{"text":"Beignets!!!!! Those French donut things. I hope I spelled it right. They're so good! Waite","useful":1,"cool":0},"PVW-6zkuLiLMrCUbC5ZrBQ":{"text":"I still recommend visiting Cafe du Monde for coffee and beignets if it is your first visit","useful":1,"cool":0},"ZiViQLdyfR5DkUWmUyA9rg":{"text":"Very disappointed! Had been waiting for years to try this. My boyfriend has gone numerous ","useful":0,"cool":0},"tdURQ86aSPkcFL7TvnECWw":{"text":"What everyone else said. This is delicious, indulgent, quintessential New Orleans and it's","useful":2,"cool":1},"_yKirmyi8MhuCICtE0BEGw":{"text":"First time in New Orleans and had to come here!! This place is legendary!! Tho Covid has c","useful":0,"cool":0},"7Ul_yf-ZAE7lv0bkawZH5g":{"text":"Beignets! Beignets! Beignets!\n\nThis is definitely a must stop when you are in NOLA. The so","useful":24,"cool":22},"kWS0drzFBvuAqgxubagwtg":{"text":"So so. The beignets were not good. Tasted tough and doughy. Too thick. CASH ONLY. Staff we","useful":0,"cool":0},"rkQOSqMZ5ZJlZ9_vMTWygw":{"text":"When I lived in New Orleans, this was not my favorite beignet place as I prefer mine to be","useful":0,"cool":0},"QYoRM5U_O7GbNE84Nt6HuQ":{"text":"This place is classic. An institution. You must go and fight the crowds and eat up!!!!","useful":0,"cool":0},"jUwuSy8PyK3U7Nzy3WN0sA":{"text":"It was CASH ONLY, but this place is worth the hype! \n\nI went later in the afternoon so tha","useful":0,"cool":0},"iJPX42UE_7ytEvMmNDqXVA":{"text":"This cafe should be on your list MUST visit when you are traveling to New Orleans. This pl","useful":0,"cool":0},"4yjfYyWlv8tIcJTgcIvnxA":{"text":"Went here during my NOLA trip this past weekend. It really wasn't all that.. I'm unsure if","useful":0,"cool":0},"lZltqxYfj1tAlzu2aVRDrQ":{"text":"Over rated! Dry beignets and a diabetic nightmare! Not worth lining up for. Go somewhere e","useful":0,"cool":0},"wqBVaI7J3tPaa2D4YKFAgw":{"text":"I know it's sacrilegious to give cafe du monde a 2, but it was just very disappointing whe","useful":1,"cool":0},"J0EYiEG9UmcQ5LYqZ_Jy6g":{"text":"How could I not give 5 stars! A NOLA staple, a must visit! I am not a huge fan of the frie","useful":0,"cool":0},"_YIaq12L3xJfJTJ-Um7cEA":{"text":"Of course we had to go to Cafe Du Monde on our trip to New Orleans! The line was super lon","useful":0,"cool":0},"01j67N0I18s0lrjvCRv0Pg":{"text":"This place is an institution in NOLA. Can be a little nit of a tourist trap to the uniniti","useful":0,"cool":0},"KUGBJ5kqmMlmWood_EoVMg":{"text":"This is a NoLa staple and also a world renowned brand. This particular visit was my fourth","useful":3,"cool":0},"5Rmvgr7CtvhgrVZ6uIAS2A":{"text":"This place is a dream! We went the morning after a hard rain. The staff was kind and the b","useful":0,"cool":0},"qrCPXpHnuAmTB_EKPsYZZA":{"text":"The spot is famous despite having a one-item food menu.  Your food selection is limited to","useful":0,"cool":0},"mWbInbQz2z79EA4YRTMHbg":{"text":"Delicious beignets with coffee. Spacious outdoor place and great view of park. I will high","useful":0,"cool":0},"fnzo8drD6ls8dIIjn31KOw":{"text":"I gave it three stars due to the nostalgia of the location we went to the original locatio","useful":1,"cool":0},"cqJwFlmcsNlvqeyjQ9LnZw":{"text":"Amazing! This place is worth the hype. The beignet were  delicious best I ever had. The co","useful":0,"cool":0},"-AlX9XrDXBBvcawy4vGZbw":{"text":"Honestly I was told to not go here for beignets because it was too touristy but they were ","useful":0,"cool":0},"CmqPHybFGUiJsmD0sv35gg":{"text":"If you are visiting in New Orleans you must go to Café Du Monde, if only to say you have b","useful":1,"cool":0},"9eEZGxIZ4e53acq4FZ07Pw":{"text":"i came here in june 2020 so everything is still kind of weird due to corona. they were onl","useful":0,"cool":0},"1RFSlZNzCsnalJ0lTnpi1w":{"text":"Iconic spot in NOLA! \n\nThere are two line: for here and to go. The to-go window is in the ","useful":3,"cool":0},"NtUT5DuFw0XF-7DIsRO12w":{"text":"*pre covid review* \n\nComing to Cafe Du Monde was definitely a travel bucket list spot so I","useful":0,"cool":0},"1SIpnLKkWcYbpyAT55EsVw":{"text":"Frankly, a disappointment.  The beignets were warm and had lots of sugar in the bag but we","useful":0,"cool":0},"22AudEFJAviiH5Qa2PstGQ":{"text":"I don't care how much of a stereotypical tourist attraction Cafe Du Monde may be, it would","useful":3,"cool":2},"TwHeT-YevD5jI8BfFehPsw":{"text":"These were ok. The line was kind of long which was expected because it's a hot tourist spo","useful":0,"cool":0},"yMMJw3Vfg4KDK4BwfqM9IQ":{"text":"I came here with a group of 4 late at night around 12AM and seated ourselves at one of the","useful":0,"cool":0},"_WaVDDbncQLXpci8al2_8g":{"text":"Visited the original location. Parking in the area was a struggle but it's fairly walkable","useful":0,"cool":0},"plO8hYPoX9qwPJQKBe3eCA":{"text":"first of all the wait was very long, but it moved fast. \n\nHowever, there isnt seem anyone ","useful":0,"cool":0},"L5eZArm-zHbCMgx-lg2dsA":{"text":"Worth the wait? Maybe just once. The beignets were awesome sauce. Loved them. The cafe au ","useful":0,"cool":0},"i_tU7w634PMgH96_u2wZXw":{"text":"Four stars for the beignets and cafe au lait. The beignets are cooked through, crispy and ","useful":4,"cool":0},"NK-envLNZogfJh346c9z4A":{"text":"Well..after I went to the mall one I was glad I did because the one close to the French qu","useful":0,"cool":0},"6VyK2_hLtBnxGQny05AIGg":{"text":"This is a popular place in NOLA. You will see a long line but it goes quickly. I heard so ","useful":2,"cool":0},"y2nfb6QfpovJXo46NDVDDA":{"text":"Service was ok. They're really trying to rush people through. The beignets made up for it ","useful":0,"cool":0},"j3PXvP4tzNqVxaykVXDUtg":{"text":"You haven't experienced NOLA, without visiting here. \nThis is THE place to come for beigne","useful":0,"cool":1},"azb_XZ7iTH2mWAnDTwJa1Q":{"text":"My family and I came here to try the beignets that was in town. We did not know that this ","useful":0,"cool":0},"p-4eFYvK45V3GVYFrK06Vw":{"text":"It's fried dough.  What's not to love. It's fresh. Hot. Soft.  And loaded with a thick coa","useful":0,"cool":0},"bexXJ3-HhstrX_P1YZVFOg":{"text":"I had to do the tourist thing and go to Cafe Du Monde located on Decatur St. I have always","useful":4,"cool":3},"9GFpfKt3BjBWH_OppaddYg":{"text":"What a pice of historical food staple that's still available. Yes it's fried dough topped ","useful":2,"cool":1},"SkzzgP_7M9h5_uO9nVunpQ":{"text":"Tourist trap? Yes. But, don't let that stop you from going. This place is great!","useful":1,"cool":0},"FMngfIqcW_jDPxz7bIf4gA":{"text":"Tasty addition to New Orleans fair. Best eaten hot and fresh. Loved it while we were there","useful":0,"cool":0},"NTOx5dnafDRDGjFR0JvRpA":{"text":"We came to New Orleans to get a taste of what it's like here so of course we had to get be","useful":0,"cool":0},"-O_FcYDFVLwrUeZDB8hcKA":{"text":"This place is world famous for a reason. I come every year and leave 3 lbs heavier every t","useful":0,"cool":0},"LkfNkMF3GXssAZ1nkq1R4Q":{"text":"Terrible location. No restrooms to use, it's outdoors in the heat and guess what... IT's A","useful":0,"cool":0},"EGSR0ndJ_oWvvc6JWgiiqw":{"text":"Cool to check out but it's really a bunch of sugar and ok coffee. The street music was a n","useful":0,"cool":0},"TCX-4XM0VuRV4mAIuLU66A":{"text":"If you're getting beignets, this is the place to go! Very simple and straightforward menu-","useful":0,"cool":0},"WLOhzPVCkIg9FX-tKdTcyw":{"text":"When in New Orleans you must visit this place multiple times. However avoid it during the ","useful":0,"cool":0},"Nf8WVepDJ_8CAZibQcpGyw":{"text":"I was told if you're in New Orleans, you have to go try Cafe Du Monde.  So of course, I ma","useful":8,"cool":8},"uy3iMt6eyW5sC-UjG_YsXw":{"text":"Definitely a New Orleans staple. I order their coffee/chicory to my house on a pretty freq","useful":0,"cool":0},"cJT6aNqW8xQr0Fo0CwUbYw":{"text":"Soooo good!!! That's literally all I have to say. Definitely worth the wait.  Plus you can","useful":0,"cool":0},"hB1l-7I5wCLlauBpIjVPhg":{"text":"This place has the best coffee and beignets, hands down. If there's a long line, just get ","useful":0,"cool":0},"Ok_2cldz7yppCu1Fn-lu3Q":{"text":"THE tourist spot to go to when in NOLA. I agree with the locals, don't go during prime tim","useful":2,"cool":0},"R7R8F6g1NvfVd6Js_1zQDA":{"text":"Ah Cafe Du Monde. Home of the best beignet I've ever had. This was our first food stop aft","useful":6,"cool":4},"g9yPLAhVoHJAUeRikBxsfg":{"text":"I had my first beignet and cafe au lait December 2019. It lived up to the reputation and I","useful":0,"cool":0},"q0XcUuIpszp5_VYWzzQahQ":{"text":"This is a very nice cafe a New Orleans classic! The benyays (probably spelled wrong) are d","useful":0,"cool":0},"nIpvkihs5zDj82d6fh5zVg":{"text":"I heard about this place from Rachael Ray's old show $30 a day. I have been twice since! I","useful":0,"cool":0},"tVsWk4oX-pQJ19T3enH40g":{"text":"I ordered some beignets to go. I was waiting in the TO-GO line located at the back of the ","useful":0,"cool":1},"goBmWUiPKq4m2q2M3vHH5A":{"text":"Beignets at 4:30am? A taste of heaven before passing out in bed...this is the place. #nore","useful":0,"cool":0},"Vk4vM2JlJvstS4_EkHuIhg":{"text":"It's worth the wait! While I did not have a bad beignet in all of NOLA, this place stuck o","useful":0,"cool":0},"Mj57iN4L1EFV23LqPFVMow":{"text":"In my opinion it's all hype. Definitely worth trying. But the weight not so much.  Like I ","useful":0,"cool":0},"WbktAexn2QX9VibtJMFpxg":{"text":"Been wanting to come here for ten years since my French teacher recommended it in high sch","useful":0,"cool":0},"vjB_19doKtFDqHzvyTw-pA":{"text":"Amazing beignets but not worth the long wait in my opinion. Nice outdoor music during the ","useful":0,"cool":0},"TxMwtDKjkx7-knBZlYaGDg":{"text":"Yes, everything lives up to the hype! Super delicious beignets paired with some silky smoo","useful":1,"cool":2},"7ZS51NvH8BsM3-T_QcKN5w":{"text":"The lines weren't long at all because the workers are fast. The beignets were hot, crisp a","useful":0,"cool":0},"l51Sy_-Z7n7F1igK5HU9Dw":{"text":"A must visit if you're in New Orleans but plan on going during an off time (very early or ","useful":1,"cool":0},"pSMxAKaibeIRurS1AZzmwQ":{"text":"Disappointing! Went to to-go window & beignets came premade in a bag -- already hard from ","useful":0,"cool":0},"N87y3gd7jqHyNjbuas9sbQ":{"text":"Had to do it, got takeout as the line was massive on a Sunday morn. \n\nBeignets were really","useful":1,"cool":1},"R1i04X2GDoOIap7SpbzP1g":{"text":"The place and food is great. Only reason was 3 star service is the customer service. The g","useful":0,"cool":0},"bS0W5jS33bZ4pAt2qFVyAw":{"text":"I was very disappointed in the beignets.  They did not live up to the hype.  But the coffe","useful":0,"cool":0},"_rHHxuCU1sEj6yfd12IKGw":{"text":"So glad to finally have tried this iconic establishment. Vietnamese people all around the ","useful":0,"cool":0},"5Pag5ItaFgfVbg2SdinbcQ":{"text":"Hello lavish lovelies,\n\nI've got another treat to highlight from one of my favourite place","useful":0,"cool":1},"0Xz1kwPpmZQanJ_meTO8dA":{"text":"I had high expectations but unfortunately Cafe Du Monde was such a let down that it really","useful":79,"cool":56},"f9hD8JPQU-RoKuAZgKB-Kw":{"text":"WOW. All i can say about this place this time. I have been here before and LOVED IT . But ","useful":1,"cool":0},"qjZXp1t2zBAQB8sNmMz4_g":{"text":"I had my coffee experience of my life. Loved the atmosphere and the quality of the coffees","useful":0,"cool":0},"EioX0UuNPv2rLR_XtqeEeQ":{"text":"Omg to die for line was long but the best wait I ever had to do !!!!  don't ask me how but","useful":0,"cool":0},"G-w0Qqc-8-I9M5BnLshXqQ":{"text":"Very cool place-great service despite throngs of people being there; coffee was hot and de","useful":0,"cool":0},"py7mtlzsVv7W59UHQlt-0A":{"text":"I was expecting so much more!!! From pictures I saw it was made out to be much fancier! It","useful":0,"cool":0},"uVNlzx4A3mnUb_yB9XjZ4Q":{"text":"This place is extremely overrated and disappointing!  I don't see what the fuss is about. ","useful":0,"cool":0},"dFmZf8sXgFQECT6dpoGUvg":{"text":"Omg this place is amazing. I can't get enough of the cafe and the Beignets. We woke up ear","useful":0,"cool":0},"9aC0HO0EB0XyzOMmh54i8Q":{"text":"You cannot visit NOLA and not stop at Cafe Du Monde.   The line was long but it moves quic","useful":0,"cool":0},"mhwmIpw9kKJknql8oqGnxw":{"text":"A must when in NOLA! \nCash only, be prepared! \nThe freshest beignets in all of New Orleans","useful":1,"cool":2},"AdPEGgJ4xUYEpV4NDpAaKQ":{"text":"There's a reason why people rave about Cafe Du Monde for beignets- no doubt they're pretty","useful":9,"cool":7},"cpNch8f2DhUZ7hp1Qr4vHA":{"text":"Way too crowded, so I had to check out the other locations & I was not disappointed. Whene","useful":0,"cool":0},"dYMR7oZg8KWjSuoQSxCdXw":{"text":"I'm always skeptical about highly touristy places like Café du Monde, but of course I've g","useful":5,"cool":2},"jHEG8Xbh0oIfESlDKERFBQ":{"text":"It's everything it's cracked up to be.  Look , it's always crowded , but that's because it","useful":3,"cool":2},"dOkLBoS8OCdoEb27lTCyig":{"text":"A must when ever in NOLA. Even though the process has changed for COVID...you now have to ","useful":0,"cool":0},"0LLF8-1kklYuxTCYEPgGrg":{"text":"Like any visitors from out of town, I wanted to stop by Cafe Du Monde to try their beignet","useful":0,"cool":0},"p2W_8gt1tEWjvTadGA41hw":{"text":"When I decided to visit New Orleans this was the first place I was told I had to go to.\n\nI","useful":0,"cool":0},"bb-ehRiW6bO9Ni0K8hEp7Q":{"text":"Café Du Monde is one of those places in New Orleans that you must always go to when you're","useful":0,"cool":1},"e69HODvZB5VlMXMymYCBWw":{"text":"We came here before going to cafe beignets as we wanted a live comparison of which is bett","useful":0,"cool":0},"RAJ-_O41Ta3YUV1-ZmUahg":{"text":"When in New Orleans you have to come to Cafe Du Monde for an order of those powdered beign","useful":0,"cool":0},"d9iPQirgGHcdpnuXNb6pLw":{"text":"8am sat down had some smooth and tasty coffee along with beignets. This was tasty all arou","useful":0,"cool":0},"yrfFHcrhwKvkGgLzq6Ei_g":{"text":"Always a go to in New Orleans.  Beignets are always tasty.  The coffee is great.  The litt","useful":0,"cool":0},"3v4cCmPdgRj8tEsO1qZkYQ":{"text":"I understand the place is a New Orleans institution, and I was so excited to finally try t","useful":0,"cool":0},"TxSOO5cRvz7tBhZTCy5wFw":{"text":"This is a must-go location if you are going to New Orleans. It's pretty cheap & very tasty","useful":1,"cool":1},"J_WcAdjV-bSKN-N1Mwj4RQ":{"text":"Whatever you do, don't sneeze.","useful":2,"cool":0},"tjOvsnJLQVGpXaJtDrBH_g":{"text":"I can't believe I haven't done a review here before. It's an obligatory stop when you're i","useful":1,"cool":0},"yXaYkBpSIf1GhBMyWcv11w":{"text":"The history and atmosphere is there, but you wouldn't come here to enjoy the food. It's fr","useful":2,"cool":0},"jD4yciaaC6nz3yOEodeBPg":{"text":"back in the old days (college)... my roommate and i would scarf down a bakers dozen of bei","useful":3,"cool":3},"IzahsnopTt1MH9blYqOlXQ":{"text":"Hot & fresh stright from the fryer, with a goodly amount of powder sugar. Simply Amazing, ","useful":0,"cool":0},"oPQ_5CgG0g8ye9V-YbAeGQ":{"text":"What a major tourist trap. Do not come here. Instead go to cafe beignet on royal street!\n\n","useful":5,"cool":1},"0aXphOQmGeHAeFAr3LBMDg":{"text":"I don't even know where to begin. But I bought some Beignets and they were hard and had no","useful":0,"cool":0},"zNBMiGZR6e3Y4LzVQ6VhgA":{"text":"This place lives up to the hype. The beignets were perfect and when paired with the origin","useful":2,"cool":0},"tCbt5_SWRGMtlUsLxklE6A":{"text":"Normally I would give Cafe Du Monde 5 stars but AHHHHH...there is a guy out front singing ","useful":0,"cool":0},"4cSHDtx8nTtLA9NghrIxMg":{"text":"I loved the changes at Cafe Du Monde because of Covid.  Three windows where u can order yo","useful":1,"cool":1},"ZeixcmaqvC6xmk69a4wSKQ":{"text":"It is cafe with tables on the outside, that coffee is very good and the place to está very","useful":0,"cool":0},"lJF3yMS6fofDKLdYLsmIkQ":{"text":"You must stop by Cafe du Monde when in NOLA. The beignets are good and I love their frozen","useful":30,"cool":29},"0FGVrBx-_n_ZDSPvEEX-7w":{"text":"Cafe du Monde is a New Orleans institution. Because of this, you can expect looong lines. ","useful":0,"cool":0},"elscwfN2MRfFPLpI_9iKGA":{"text":"This place is located at an odd street so do not think on driving here, cause parking here","useful":2,"cool":1},"7R7YK69anBOrylDs9SqbXw":{"text":"Sadly a one star for the company's human values. I have come to this icon spot of New Orle","useful":0,"cool":0},"JsRUbpB-tULFNQ_tgT_XiQ":{"text":"I'm so sorry Cafe Du Monde!!! You're a NOLA landmark, but, Disneyland in CA does it better","useful":55,"cool":47},"vuJOHbY_CFrWi1tXcwJFzA":{"text":"This is a MUST if you are in New Orleans! These beignets!!!!!!!! No wonder they are famous","useful":0,"cool":0},"VPGq8Kakv4FlEkFTGfUWAQ":{"text":"Oh cafe du monde. Your been yeas make my heart sing however you may give me diabetes somed","useful":0,"cool":0},"z3gsiqcDQgM2teSaLWy92A":{"text":"First time being back in New Orleans since hurricane Katrina , that compiled with the coro","useful":1,"cool":1},"nGBnKNR7o7VxGhznyr6LAg":{"text":"One of the classical icons of New Orleans, Cafe Du Monde has been around since 1862.  They","useful":2,"cool":0},"ECM7jz-aJDJLRnG5U-kpYQ":{"text":"I dont get the hype\n\ncafe au lait isnt lait at all. its half and half. So its think and th","useful":0,"cool":0},"oV_m1B4S70sKt5w_6hNbgw":{"text":"The line was long but moves very fast and you can enjoy some Live New Orleans Entertainmen","useful":0,"cool":0},"xX5iINXp08rsJOPiEKSAQA":{"text":"Bring cash!!! Yes, there as good as you've heard. Yes, you will get powdered sugar all ove","useful":0,"cool":0},"EGo9dbrI8QtUp_8BQLuABw":{"text":"A staple of any NOLA visit &, thankfully, the cafe au lait and powdery morsels from the go","useful":2,"cool":1},"LDBzK2gYgKP86LPjR-mPlw":{"text":"lines will always be long, it's not 24 hours even though the sign says so. \n\nThey have sea","useful":1,"cool":1},"HCTaykT_wX3ewBtjaekVLg":{"text":"Cafe du Monde is an institution known nationwide and perhaps New Orleans' most famous cafe","useful":5,"cool":6},"JWf45YpJlvXtZbmrQ1Msjg":{"text":"Can't believe I never left a review for cafe du monde. Pre covid, I'd fly down from Dallas","useful":12,"cool":12},"SaeyH4mWjQsytHCl6yNZQw":{"text":"Super busy, but lines moved at a good pace. Ordered 2 orders beignets (3 for $3.40) and ic","useful":2,"cool":0},"c4CLz8Zdra67p_BIIfYWhQ":{"text":"Soooo good. You get three beignets so it's an  order. I wasn't a fan of  the plain black c","useful":1,"cool":1},"rSshmBo2a-wKoTqp3raA-A":{"text":"This is a must visit when in Nola!! \n\nI dont know why it took me so long to review this pl","useful":0,"cool":0},"gq6_cIwYiMYD7SK7Y4SMQw":{"text":"Small And hard, price rip off 3 small ones and bottle water $10.25 asked fir a recipe neve","useful":0,"cool":0},"owDvNQnJ7BWFuP7YVPzSXQ":{"text":"Heavenly! Dropped off bags at hotel and 2nd stop for my frozen coffee and beignets that I ","useful":1,"cool":0},"93rcTeHJVlCq_LLbwZRTXg":{"text":"Best Beignets ever!!! It is true! However, the wait is atrocious! We stopped by around 2am","useful":3,"cool":3},"9emKIN2RbE1BneaL4T1Rsg":{"text":"Good beignets. Came here twice and wasn't disappointed either time. The wait wasn't that l","useful":2,"cool":3},"6Dz6U5tIdao_9XH96Dk-7Q":{"text":"This place lives up to the hype! I've never tried a beignet before and use to  Thanks, wha","useful":0,"cool":1},"PmD9F-oTwqsE8zQYWfmXuA":{"text":"Wow just wow. All I can say. You HAVE to try their beignets if your ever here. \nI had 6 of","useful":0,"cool":0},"6lQ6uf_iuLiJB3g3poueGg":{"text":"I was here for the Beignets only. No this is not the place down the street that is so larg","useful":0,"cool":0},"-y8fsdDZvW3c9CrCMIdpYw":{"text":"We knew this place was going to be busy, but the wait was long and confusing about trying ","useful":1,"cool":1},"BfFuKc4VaRaDNrrnL3xjwg":{"text":"What a cute, historic place to visit. Coffee was delicious and so were the beignets. I'm w","useful":0,"cool":0},"t0yRRTQoru-5vRDc206hSg":{"text":"Not the café Dumond it once was\n\nThey do not take credit cards so that the owner can skim ","useful":0,"cool":0},"IEMMQB-6lzaejT7Dm0K2LA":{"text":"Don't wear black unless you like it sprinkled with powdered sugar.\n\nAnd get the frozen caf","useful":0,"cool":0},"-XVMlrCSthuKog4MCfBHYw":{"text":"Actually. Unless you are fond of long line there is a better way to enjoy this must-have t","useful":1,"cool":0},"LxebcL6-0Vc1-FSafl1hfg":{"text":"Unique Experience and won't be disappointed.  Long line but definitely worth the wait. Cas","useful":0,"cool":0},"idnoK6rYqDsRbIvsNE5Zlw":{"text":"For what it is, Cafe Du Monde is worth the visit-at least to be able to say that you've \"b","useful":4,"cool":3},"a1AnUcdsxhNZ4YCs9sHbyw":{"text":"My husband and I finally made the trip to the iconic original Café Du Monde stand right ou","useful":0,"cool":0},"R9DQmvRCjfYaLirki7tpVw":{"text":"We came here because it was THE place to go check out. I recommend coming early in the mor","useful":1,"cool":0},"ZyPvNLMrxcRTWJKdS1lCQA":{"text":"It was everything people say. Worth any wait. So good. We went at 1:00 in the afternoon mi","useful":0,"cool":0},"87WU-1yoMgMXvL4vMNPmdw":{"text":"The original is a tourist hotspot and is good but if you just want some Cafe Du Monde with","useful":2,"cool":1},"b1qZ73sATKmznWWVctsGfw":{"text":"This place is STILL CUTE! Probably the #1 tourist spot in New Orleans. This was my 2nd tim","useful":1,"cool":0},"7SObA_2MZKt0KwHl3EvpJA":{"text":"COVID visit so keep that in mind. Extra star for benefit of the doubt.\n\nAt the time, no in","useful":2,"cool":0},"5yQo30CEQjNkUKnTH7bxJg":{"text":"Fun mornings start here. \n\nCafe du Monde is a staple here. The hours are shorter now and t","useful":0,"cool":1},"dl3vD-JPhc1txDotqTb-XQ":{"text":"Simply delicious. Even during Covid this was a delicious place to stop and try a cafe au l","useful":1,"cool":0},"mAQf_6hNgWtXxK36dXAhRw":{"text":"I have only been to this cafe du monde a few times but every time I have been, it has alwa","useful":0,"cool":0},"mGU4qeZ-luFJ1FkqWhEoTg":{"text":"Such an awesome place, definitely the best beignets I've had. It's a considerable line, bu","useful":0,"cool":1},"2KqI5d2an-Fgny7DgA2w_w":{"text":"I've always heard about the legendary beignets at Cafe Du Monde and they sure do live up t","useful":2,"cool":0},"1HSq-r06X0lG-njHENyS_g":{"text":"Love this place!! The beignets are amazing and their frozen coffee is delicious!! Definite","useful":2,"cool":0},"AP3c3niXLrDUzrmU61NfkQ":{"text":"Pretty good beignets. The line was over a block long but it still only took 20 minutes. Li","useful":2,"cool":2},"BTa6GMdXu-2aeu6eR4DNCw":{"text":"Still a fan favorite even though I know it's a bit of a tourist trap. I've stopped here on","useful":0,"cool":0},"FbauT4jvbwhBGEc5hND-nA":{"text":"A must try in your visit to NOLA!  Fried dough and powdered sugar, what's not to like?\n\nTh","useful":2,"cool":2},"CYH2c6hVNdMXewz0qRYCtQ":{"text":"A landmark worth visiting. The beigneta are served 3 to an order, warm, covered in powder ","useful":0,"cool":0},"VGET-EeAGnGUe_iE45LHjA":{"text":"Obviously a must for any first timer in the wonderful city of New Orleans. I absolutely ad","useful":0,"cool":0},"ziv1vM9wzzPp2K8tv_im8Q":{"text":"Nice spot very popular and it's good to go and check out. I heard so much about this place","useful":0,"cool":0},"FkW3foEYEOM9V5cY-YlfDA":{"text":"OK so what more can I say: iconic, legendary, DID NOT disappoint. \n\nWe stopped in New Orle","useful":1,"cool":0},"W2LHw_nu7FB6TnESuBaWeQ":{"text":"Did you even come to New Orleans if you didn't go to Cafe Du Monde?\n\nI love doing touristy","useful":2,"cool":3},"Bs-AaggWzlung2hKTrPDlw":{"text":"I have to say, this is one touristy place that is 100% necessary and worth it in New Orlea","useful":4,"cool":4},"RbfKIQN7Po_F9Y0r4j7bNA":{"text":"I wish I had much to write here, but I don't.\n\nThis is another place that lives up to the ","useful":1,"cool":0},"le9sqbJ_37ckcd6JXj6mOQ":{"text":"One of the typical tourist things to do in New Orleans is go to Cafe Du Monde for coffee a","useful":5,"cool":5},"NWdILGbqbmnk6tm2R8vqKA":{"text":"This place was blown up and exaggerated. The beignets were not fresh, you ordered and they","useful":0,"cool":0},"p60IsYfONd0xmsky5lrpPw":{"text":"CAN'T go wrong with hot, fresh beignets & delicious chicory coffee...and I don't even LIKE","useful":1,"cool":0},"m7ba9_oIM6OksM4KLAhS2g":{"text":"Café du Monde... everyone I asked about what to do in NOLA said I have to go to Café du Mo","useful":3,"cool":2},"6WaF_vFYWzpOcANUTlGVjw":{"text":"Beignets were a must on my New Orleans trip. Of course I had to come to this popular desti","useful":1,"cool":0},"xg7dwx6fxTp1V_emfoHO4g":{"text":"SIMPLY AMAZING!\n\nComing to NOLA, we had to try beignets from Cafe Beignet and Cafe Du Mond","useful":0,"cool":1},"-kIMprTLWBA66IUuc-eZWg":{"text":"perfect way to enjoy new Orleans atmosphere, people watching, yummy beignets and coffee!! ","useful":2,"cool":2},"Pj2EPvAOOcEQhyBATYDYnA":{"text":"Great beignets! A must try while visiting the city! We were impressed! Enjoyed the beignet","useful":1,"cool":1},"8FtiHu2g7aeL472GA5BO8Q":{"text":"I don't think I even need to review this place, but I will anyways. AMAZING!!! So deliciou","useful":0,"cool":0},"qBjkewECJMOuObaRTvdVQA":{"text":"CASH ONLY!\n\nThe lines were super long, but they shortened super quickly! We only waited in","useful":3,"cool":2},"qUcc37YX0aeSXqSshcbFMQ":{"text":"Stopped by at this New Orleans spot for their historic beignet's with a boat load of sugar","useful":5,"cool":5},"VsQQChHmvPryeQbCEp0CUg":{"text":"A legendary spot and a must-visit whenever you are in New Orleans. I frequented CDM weekly","useful":0,"cool":0},"gE2uq0WsriSckZp2KWlwxg":{"text":"I just got to New Orleans and the live music was already lit. What a wonderful way to star","useful":4,"cool":2},"CYIO4WXsXnFaiv--ws6LsQ":{"text":"I'm so glad I got to come back here!\n\nThe beignets here are unparalleled to any I've tried","useful":2,"cool":3},"B7uvrsljz8olpBhtKKXa5Q":{"text":"I love the beignets from cafe Du monde! A must stop in New Orleans. I always order a large","useful":0,"cool":0},"Ioofa7HqINS50gDyHGKbHw":{"text":"A delicate little shop located in Jackson Square. A beignet is a classic dessert which is ","useful":13,"cool":7},"cmsxaAprUnn5FjRIgCa4mQ":{"text":"Had to stop at this staple! \n\nWas planning on going here way before our trip. After learni","useful":7,"cool":5},"yiYcQcx_O3vFGm9f9W8ySQ":{"text":"Tip: go late at night to get a beignet, there is no line.  I wouldn't consider myself a bi","useful":1,"cool":0},"A_iCW_CoU_JLuewNCmUpPw":{"text":"A must any time I'm in New Orleans!\n\nCafe Du Monde is open 24 hours so it's the perfect in","useful":4,"cool":3},"SyOKw_1opocFZBdHixqmgw":{"text":"I've been to NOLA twice - once for my birthday and a second time for a bachelor party I pl","useful":0,"cool":0},"_NW3ykuXUa2AtoSN_EraQg":{"text":"Best beignets we had while visiting New Orleans! I had a few gift certificates from family","useful":12,"cool":7},"xs43YCKFWcA_NQCmaJ2MbA":{"text":"Beignets... Enough Said... But since I need to write more I will do just that. Cafe Du Mon","useful":12,"cool":15},"SKVZvQ_85-u1JMC5ms-3Rw":{"text":"I typically hate congregating in the touristy parts of cities I visit, but I happily make ","useful":0,"cool":1},"qjgKadiuP7xDCkUFeThTrw":{"text":"I prefer this beignets over other local establishments. The coffee with chicory was fantas","useful":0,"cool":0},"jf_Z8ihi1bTygrD0DxKl1Q":{"text":"Great beignets but not worth the 1.5 hour wait. Maybe set up a online order system to miti","useful":0,"cool":0},"VNOoGCluC2tp2N5FUQRzvQ":{"text":"A classic for a reason. No one does beignets better. And the hot chocolate is amazing, too","useful":1,"cool":0},"-PcAN2yuSksPCqhv1gx-1g":{"text":"The best beignets in New Orleans! Fresh and hot! This is a cash only place, so keep that i","useful":1,"cool":1},"Qdg3p6N7qOt4DLeZIkpIEw":{"text":"my first time in new orleans and my boyfriend took me here. I LOVE IT SO MUCH. definitely ","useful":1,"cool":0},"bsZiXNtOFanhhAA_Z1Yr2A":{"text":"I have been here too many times to count but I can count on it always being delicious! So ","useful":6,"cool":3},"DJXxHlfDZclcpF4hXVa-kQ":{"text":"I came here on 12/3/2021, my first time in New Orleans and had to stop here for beignets a","useful":0,"cool":0},"4nkkLeiEtDo9_nfhou2bgQ":{"text":"When I was headed to NOLA, people were telling me that going to Cafe du Monde was a must. ","useful":2,"cool":1},"l22aQ7rPdAbAGsYBCZooNA":{"text":"I'm sorry! I wasn't impressed at all with this location. The beignets were soggy and blah.","useful":4,"cool":2},"EVLByENvTcGsTv9MtDuvQA":{"text":"Things I WISH I knew before going:\nCafe Du Monde is CASH ONLY! I waited in the crazy long ","useful":0,"cool":0},"z0JV0mXFLW4wKkbYzGkH2A":{"text":"This is my favorite place to get beignets due to the taste and classic beignet experience!","useful":0,"cool":1},"2a3d4g8M_K56R97uspEtLg":{"text":"It used to be a nice place... not anymore.  Fresh orange juice ... out of a box. Fresh bei","useful":0,"cool":0},"HL85sWTENZFHRChVIN2v1A":{"text":"If you want to try beignets in New Orleans and why wouldn't you? Do yourself a favor and t","useful":0,"cool":0},"0R3YQbhs8B-8gFkwr7pRng":{"text":"Yes, it's super touristy, but you cannot - I repeat - cannot visit New Orleans and skimp o","useful":7,"cool":6},"GPilqQKvUoEnwXn4AwY1rg":{"text":"The ambiance was awesome. Great blues paying outside. The line when we first arrived wasn'","useful":0,"cool":1},"qqzbZuBfNZEtS7cRLjyQ4w":{"text":"This cafe is a staple of this area. The beignets are pretty good and I loved the cafe au l","useful":1,"cool":0},"92k05V_1VhaTJnkXUZBG2Q":{"text":"Cafe du Monde is a classic stop for the New Orleans tourists. I always recommend to come h","useful":1,"cool":0},"e-2gr2WRKqI5MlD-HsLUGA":{"text":"I don't know if i'd say this is the best place for beignet, but if you're visiting New Orl","useful":1,"cool":1},"KPPiMKDkqSevHgiXuIWXxQ":{"text":"Beignets, coffee, and hot chocolate. My first time in New Orleans and it happened to be du","useful":1,"cool":0},"iIY-CpBYNORgNS-hJ8MrTQ":{"text":"This place is ALWAYS busy. We have been there in the morning, afternoon, evening and late.","useful":1,"cool":1},"xXKzMlvHrZA22BlZno-kAA":{"text":"Great coffee and the best beignets in New Orleans. Definitely it's worth all the hype. It'","useful":4,"cool":3},"TLkK8cVXy64mHQLUQA75XQ":{"text":"Cafe Du Monde Ratings: 4.4/5 \n\nFood: 4.5/5 - Visiting New Orleans with my siblings for Chr","useful":4,"cool":2},"5Fx91VUe1q14ujaanlFJ-Q":{"text":"Just like I remember it , Although such an eyesore ! I wished the exposed inside looked mu","useful":0,"cool":0},"YRNnhuGuukcVF-Fr7dB-IA":{"text":"3.5 stars\nHOT TAKE: I like Cafe Beignet better. They are a little lighter than Cafe Du Mon","useful":2,"cool":2},"0HSS-xZd5meoQsogMzs3hg":{"text":"So, what's there to say about this landmark than I just don't get it. I just didn't like i","useful":1,"cool":1},"tFEaEy_Uc5AIVvM777QDFQ":{"text":"I would just like to start off by saying my attempt to write this review was derailed for ","useful":4,"cool":0},"69DPPhn8K27oaRTtYwBAPQ":{"text":"You can't go to New Orleans and NOT stop at the infamous Cafe Du Monde. They're literally ","useful":9,"cool":9},"rtM33aiswXGL4D82TkCrbA":{"text":"The beignet was extremely good and well priced. Plenty of sugar in the bag. Pretty decent ","useful":0,"cool":0},"UuLyU5jwQ0q43p7Zur5ngg":{"text":"Do I even need to write a review. This shop is 24 hours and there's a good reason why. We ","useful":1,"cool":0},"7O3fW7Re6zMeaKpJnRLN0A":{"text":"There are two lines to get beignets here - one is to dine in and one is for take-out. Both","useful":0,"cool":1},"LO3DlomleyAlidbNZQReAg":{"text":"What trip to New Orleans is complete without visiting the famous Cafe du Monde? \n\nThis pla","useful":3,"cool":3},"NrPx_omCszUK8s0Vxmaoaw":{"text":"First time I had been back here in 12 years. Probably the only good thing about the pandem","useful":2,"cool":1},"XajarDU9N_hCCI9Z1JCnsg":{"text":"⁣\n⁣\nNew Orleans' Cafe Du Monde!⁣\n⁣\nIDC how long the line is...it is worth it ⁣\nSo much so ","useful":1,"cool":0},"QN5AoC0LKOY_ErflfFBRJA":{"text":"I thought I knew beignets. I've tried them before a couple of times at different places. A","useful":32,"cool":29},"rGU8bcvsjgnHzHGAugnHRw":{"text":"Absolutely one of the first things to do when first stepping foot in New Orleans. This is ","useful":2,"cool":2},"e6iJbUIasvVWPmCyo13uUQ":{"text":"Powdered sugary, buttery, doughy goodness. If heart disease wasn't real I would get this e","useful":0,"cool":0},"253YwnaSsJyNWOFGDupWaA":{"text":"Café du Monde is a legendary cafe serving beignets and coffee, and no stop to New Orleans ","useful":1,"cool":1},"f7Q0l82iHUu6xwslPH1EHQ":{"text":"We stopped here during our return road trip from SoCal to Atlanta 10 weeks ago.  We had co","useful":4,"cool":3},"ROGPrpFjd6wb6jLQD0TPqA":{"text":"We stopped at the French market location our first morning in New Orleans. The line wasn't","useful":1,"cool":1},"ZBHzi6Q2zKATgCjcqSYBFQ":{"text":"When in Rome....am I right..\nIt's a must if you're visiting NOLA and we got some good advi","useful":0,"cool":0},"7dIA42bBM8y2NXTbQ8nWSw":{"text":"Let's go check it out this is a really really really good place down in Orleans it's the b","useful":0,"cool":0},"yAA7zLyfDO6iibgCNnwYew":{"text":"Waited in a long line but it moved quickly and there was lots to see and hear while on lin","useful":0,"cool":0},"YxC6D3d8pfUlkaCNGj9Q-Q":{"text":"Wow. These beignets are a must have if in the area. \nThere are two takeout lines, and it's","useful":6,"cool":4},"hXJ7oXZQvuoYn66imtYCCg":{"text":"A New Orleans institution, you must come very early and adjust your mind to the fact you w","useful":17,"cool":15},"dF3GQoBQ3ZNfkemGPA-pJw":{"text":"Cafe du Monde is a New Orleans landmark and if you have never been then yes, you should ab","useful":1,"cool":1},"_-VEVWMXIKuveBW95h6Ahw":{"text":"Worth. The. Wait. (which wasn't as bad as I thought it would be!)\n\nI am still dreaming of ","useful":2,"cool":0},"CfJ7qEF1I75Q3vdufSBu8Q":{"text":"A must-try spot for any visitor to New Orleans!  Be prepared to get messy, and be sure to ","useful":0,"cool":0},"qJlLLgi-ptGphD9eBro2Ng":{"text":"YES- it's the original location. YES- it is worth the hype. Here are my few tips for ya. K","useful":4,"cool":1},"6ejjsVTaR5xR7DsRJAc5uw":{"text":"AMAZING WARM BEIGNETS WITH MOUNTAINS OF POWDERED SUGAR IN THE BAG. I went on Sugar Bowl we","useful":0,"cool":1},"oXiqSLD2VIEhR9_ajKeJKg":{"text":"Overrated \nThick & dense beignets\nNo bathroom\nCoffee bitter in a styrofoam cup\nBeignets ta","useful":1,"cool":1},"38TxTPS89DVL5EGR9YAtfQ":{"text":"Best beignets but all reviews will likely tell you that.  Most important is that the busin","useful":0,"cool":0},"bjxGLdZ0HBlG-oSolxcGNQ":{"text":"You didn't go to NOLA, if you did not go here. Coffee and beignets= the perfect duo. I wen","useful":2,"cool":0},"7tJsssN9BnQmxvezDX8-cg":{"text":"This is the General Store across the street from the actual cafe. One of several places in","useful":2,"cool":1},"jci1kDZXGbrrkIE0J_wTDg":{"text":"Don't let the line overwhelm you. Yes it's long and may seem like it'll take hours but sur","useful":1,"cool":1},"Q-iSu2hmBDt3eRVYMI7t1A":{"text":"From beignets to café au lait, Café Du Monde is a New Orleans tradition. You can't visit N","useful":1,"cool":0},"e-TUAD29lwS5vHJmmuBztg":{"text":"My 3 stars are mainly based on service!!!! Horrible service,  they were so rude. \nI got th","useful":1,"cool":1},"PBuftexAC6XfbIxl7vnk3w":{"text":"Finally. The long-awaited visit to Cafe Du Monde. When we walked up we noticed multiple li","useful":1,"cool":0},"FR1sO6ECzx9kfBz1IRWh8Q":{"text":"What can you say, Great beignets and coffee!!! Awesome street music directly outside! Fun,","useful":0,"cool":0},"xDrJ4I0AOS6jXE-CUdvqEQ":{"text":"Had to stop by Cafe Du Monde on our first night in New Orleans and it did not disappoint. ","useful":1,"cool":0},"EakOzNK_K5mOaWRZ1EtVyQ":{"text":"A NOLA staple and definitely a spot you should check out if you're visiting. Beignets are ","useful":1,"cool":1},"XCQMKiHLca6CeQG_StwrCw":{"text":"This was a bucket list item and I got it done! The beignets were not everything I imagined","useful":2,"cool":3},"lnFTe4BVJkzCgf0kOG0uMQ":{"text":"The beignets were good. The chicory coffee was better. The experience is worth maybe a 20-","useful":0,"cool":0},"Yk1j-6Mf-LJ2ksRVg05YeQ":{"text":"First time here and we had to have the famous Cafe Du Monde beignets.  Very good, just lik","useful":3,"cool":2},"gFGHRC4ehRXYNnK-UvV4IA":{"text":"Yes, it's true-these famous beignets are \"all that\" and worth the long wait in line. Make ","useful":0,"cool":0},"QkcmRe99GE3JsMGIa5YK_g":{"text":"This was our first stop on a day trip to NOLA. We loved the beignets! Great prices for suc","useful":0,"cool":0},"Vwkk00MMP_4fNJv4zRZ76g":{"text":"I looked at all the most recent photos and ours came in a bag cold and the powered sugar w","useful":0,"cool":0},"9jAh6lsCSnYVDLkOVDa9Og":{"text":"What is there to say about this place that hasn't been said before?! You cant go wrong wit","useful":3,"cool":2},"_8H7QIdB0IflJS4oHAWAXw":{"text":"Due to Covid, I got my beignets and coffee to-go. The beignets were warm and fluffy. The f","useful":1,"cool":1},"BT9uHUESG7RGST8F56eaAA":{"text":"I've been here twice within the past ten years and much has not changed in regards to the ","useful":9,"cool":9},"Ce4HjDKsFw4Qr0x0buciBw":{"text":"Cafe Du Monde is a must-visit when traveling to NOLA and you definitely cannot miss it giv","useful":2,"cool":2},"E7Rx3nBKGWlA2FdOv7uXdg":{"text":"Just like John L H before me today Yelp removed my review for some reason so I'm back to p","useful":10,"cool":11},"58ApCtsgjlh4HDR8hTgUVg":{"text":"Cafe au lait with chicory, coffee and hot milk and beignets are the thing to get here.\n\nTh","useful":14,"cool":14},"TV7lGbrx_Wv0ZE7F5-A5Yg":{"text":"Beignets. It's literally just fluffy goodness, I'm not sure how else to describe it! \n\nThe","useful":2,"cool":1},"LikWqB9Z0kDas8R7culWgg":{"text":"Spent many many years thinking about the first time i'd get to visit Cafe Du Monde, and lu","useful":1,"cool":0},"HTIP9-f1glsmTOWRgbz2jQ":{"text":"CASH ONLY. Long line at 11:16am on a Friday morning. There are three lines into the buildi","useful":0,"cool":0},"jvtLrSJgIC9BClk418mWgA":{"text":"A must stop in the french quarter.  Less crowded in evening to get seated.","useful":0,"cool":0},"gfNzPryakNehlFWSY86ldA":{"text":"Really bad beignets and bad ambience. Came Sunday night, and there were just a bunch of wo","useful":2,"cool":0},"DGrD2dKJBV2BJxD5KIyzvA":{"text":"As you could see from the picture I couldn't wait to take a bite! This was such a tasty tr","useful":1,"cool":1},"wQHWPK4L3wraR0lf5EEbFg":{"text":"Cash only. (hint there's a smaller store in the Riverwalk Outlets that takes Credit card).","useful":6,"cool":3},"f6V7tLdkkbErXy6HG_M_3w":{"text":"Update to my review: Went back two days later to make sure i was giving them a fair shake.","useful":0,"cool":0},"R8bNUpnu1T5CMKfyqA7alg":{"text":"Ambiance: Right next to Jackson Square so you get to enjoy the sounds and view while waiti","useful":3,"cool":2},"c2-mS9QjArGnFN8iiLOI3Q":{"text":"Come here for the experience and the hype. Their beignets and coffee are great and worth w","useful":2,"cool":1},"Df0yojpR4PObnmV7ruDjLg":{"text":"Beignets? What more can one say? Coffee? Yes, please! This wonderful place is usually the ","useful":24,"cool":24},"wQj3uIXM2k4HPdiik-tQjA":{"text":"WOW - I had heard about these things called beignets but I had no idea!!  These things are","useful":0,"cool":0},"nhpGXHeba3j3zTN-KYbvCw":{"text":"It's coffee and beignets done right. Is it crowded, yes. Is it fast passed, yes. Is it mes","useful":1,"cool":2},"yeslECVLHzkdRQU4PmNF8Q":{"text":"This is a must stop for anyone visiting the French Quarter. \nWe planned to hit it early to","useful":2,"cool":1},"gRrrp-Ao9GtH0yyyUcz1gQ":{"text":"When visiting New Orleans this is a must stop for Beignets. The lines are long but they mo","useful":4,"cool":3},"XkyZg2jTv1Z9B2QdpljahQ":{"text":"If it ain't broke don't fix it.  When it comes to doing one thing right and repeating it C","useful":14,"cool":10},"OBlgwV_9ioG8ywCEbxb0xg":{"text":"Went here on a Saturday morning, was very crowded & had a long line, it moved pretty quick","useful":0,"cool":0},"0airHWuzjtM3uS3SKz1HJg":{"text":"What can be said about this delicious tourist trap that hasn't been said before?\n\nCafe Du ","useful":11,"cool":9},"U0SW9Uhk-sMK0UBrkE0XsQ":{"text":"Food (5/5): The beignets came out warm and fresh. The beignets are a little dense but I pe","useful":2,"cool":1},"V_pT3alsteNmhsGMv8b0nQ":{"text":"So disappointed . Everyone told us to come here. While there were lines, they actually mov","useful":0,"cool":0},"YB4bPp5UdfVKNZiGHsjsPg":{"text":"Came here this afternoon around 1 pm. This place is terrible! Because they are so busy, th","useful":0,"cool":0},"z_o6hzE9BYBrU4s6U1A9QA":{"text":"Ugh.  \n\nI seriously don't understand why so many people like this place-oh, wait, yes I do","useful":4,"cool":1},"lVf0MPtlNYTVqxVb0pHllg":{"text":"I am so sorry to say this, but what a disappointment. After having been told by so many pe","useful":1,"cool":1},"gPs0cOpHqAwcdGJdCD7jQw":{"text":"Crazy good beignets and cafe au lait! Perfect start to both the birthday vacation and two ","useful":0,"cool":0},"fPwY5VYNa8caqU9_HYUlsw":{"text":"Their hot chocolate was so delicious. The line is long for a reason!! Highly recommend, I ","useful":0,"cool":1},"HKaRSJfhVTSiP2WrltybKQ":{"text":"Update 1.2.22: Hubby wanted to give CDM another try so we came back. This time, the line w","useful":0,"cool":0},"qE4R2RkY2i9UWVlHOXQG8A":{"text":"Lets be real, I came here to say I did.\n\nBut for any 1st timers there is 1 major trick tha","useful":2,"cool":0},"mxWwuxE-6P1m8E4JW5DWLg":{"text":"Just about everyone who knows anything about New Orleans knows of Cafe Du Monde. However, ","useful":6,"cool":3},"v_sdI-7XSU2cw1I8ARbr-Q":{"text":"The original Cafe Du Monde was established in 1862 in the New Orleans French Market. 18 fr","useful":9,"cool":11},"qQXenLvyJhEGIN7zxy2slQ":{"text":"The best coffee place to check out for visitors. Amazing coffee and delicious sugary fried","useful":0,"cool":0},"nGYumklwIcTQSpIHOAW8NA":{"text":"Gotta be real, this place is over hyped. The beignet had so much powdered sugar on it. Fel","useful":0,"cool":0},"clnShVaq1aPYTrfSjZkeqA":{"text":"Nothing bad to say about Cafe Du Monde. Their coffee both hot and cold, and beignets make ","useful":0,"cool":1},"TIBYm9i7V5Q57hslOh6Zwg":{"text":"Ahhh yes, the original café du monde. Everyone must visit this infamous beinegts and coffe","useful":1,"cool":0},"YgGydFhcXIasXZ6ErBsqag":{"text":"I didn't know what a beignet was before this trip and honestly it was pretty good - like a","useful":0,"cool":0},"Y-oS8LB7TvY2DkS1ei6S8A":{"text":"This is a must go for me each time I'm in New Orleans! I'm from Mississippi so we took man","useful":1,"cool":0},"KTm5UsNzCDtKSpQHrczbFA":{"text":"It's a classic for good reason and if you pay attention you can get your beignets pretty q","useful":0,"cool":0},"Wpu-5kAsUBT-uou1vVNW3Q":{"text":"Yum! Yum! Yum! Definitely a spot worth visiting especially if you are a tourist visiting t","useful":3,"cool":2},"hjcEnMKXDO-QuH2AMpm8vg":{"text":"Cafe Du Monde is famous and definitely one of the historical landmarks in New Orleans. \n\nW","useful":4,"cool":4},"37vt6F7pwFzZPgZZCZ3Ymw":{"text":"This was my first visit to NOLA and this was my first stop. I was really looking forward t","useful":0,"cool":0},"K2CnTSkW5HJaz7n53nBShw":{"text":"We had so many people recommend this. I have never been to New Orleans so I was excited. I","useful":0,"cool":0},"ac-T8FJSouR-0rEi0AkiBg":{"text":"This is a must for any trip to New Orleans. They have a very limited menu, fried dough wit","useful":0,"cool":1},"x5bKBybJc1JmZiQ_uAJqUQ":{"text":"Good but not the best in town. Defiantly the most well known. They live on their location ","useful":2,"cool":1},"1mclqBouidRS0jFJYsYUBg":{"text":"I was excited to try beignets for the first time in my life in their hometown.  I did not ","useful":0,"cool":0},"UNVuhSnjITSbywt_8RERMA":{"text":"Apparently this is a staple in New Orleans and the most touristy thing you could possibly ","useful":1,"cool":1},"qyctBoyQm-fuVTpPiGyiog":{"text":"Being that it's Mardi Gras and all today, of course I'm craving a beignet and realize that","useful":1,"cool":1},"AAKJ-Gip2PpEbEiNEw24-A":{"text":"If you haven't been here for beignets, you're missing out. The best in town. \nMade fresh t","useful":2,"cool":1},"JAi-MOpBnXhKnVmQuMaS9g":{"text":"Went back to Cafe Du Monde after at least 10  years! Taste was still great, just as I reme","useful":2,"cool":1},"BE1bDlG3YRSaypBD8NVg4A":{"text":"Visited this spot pre-COVID, and it's definitely a New Orleans staple for a reason! Piping","useful":2,"cool":4},"knFVK3PwZfTFhDB0ghF1jQ":{"text":"I have never had a beignet until my trip to New Orleans. Café Du Monde truly changed my ta","useful":2,"cool":2},"wTruw23rlWBlk1SG6IXWrQ":{"text":"Mmm it was okay. I felt like this place was way too hyped. I felt like they were not as fl","useful":0,"cool":0},"B26rAqDG6EUamf-HvzuIVw":{"text":"This place has 1000's of reviews so there's no need to convince you that it's great- so he","useful":12,"cool":9},"ztJklxMBodBy3lv9l1TZ0g":{"text":"Perfect spot to enjoy a New Orleans staple and listen to great music street side! \nThe sta","useful":1,"cool":0},"VMlkp8PAK6FAwwgU8yrQKg":{"text":"Cafe Du Monde Coffee and Chicory what a great experience this was about a month ago. I can","useful":1,"cool":1},"fJic9WMtqxsKQvnp7daULQ":{"text":"A trip to New Orleans is a fail if you don't stop by here for coffee and beignets. Current","useful":2,"cool":0},"UAqymnsD_Pw2lAWWgms5HA":{"text":"Really enjoyed the beignets here! I came here twice on my visit to New Orleans. The first ","useful":7,"cool":7},"SDuExYiG5XT8ZodYYPY7Ng":{"text":"My boyfriend and I were visiting the French Quarter in New Orleans and planned to visit Ca","useful":2,"cool":4},"mT0mgnpYXJ-C1PtnVZda2w":{"text":"This spot is a must for beignets and coffee on every visit to New Orleans! An oldie but a ","useful":1,"cool":0},"0PSF4RegT50dIwvhZWErfQ":{"text":"I'm not sure what happened to this place. The beignets were like fried wontons, super dry ","useful":1,"cool":1},"vEc7GPp9XbxCtDTdgRg5_Q":{"text":"Overrated tourist spot, Coffee Au lait was watery and the  brignets are oily, just a tick ","useful":0,"cool":0},"Re-a-ldRhCwYQpXJU7bq7g":{"text":"Very dissapointing. I've been here before; however, this time it just disn't measure. The ","useful":0,"cool":0},"88-A2qLsSGqqpdLDQ494Ag":{"text":"Cafe du Monde is well, Cafe du Monde.  A must stop spot when visiting New Orleans.  I went","useful":5,"cool":1},"GjCf5BhAGXbKCQVj1Lu7Qg":{"text":"Everyone knows when you come to NOLA you just try this place. Even me being a not huge des","useful":6,"cool":5},"eqWpJaQ4OA4WAciqSLlZZw":{"text":"I mean can you really say anything bad about this place. I understand why it's a New Orlea","useful":2,"cool":1},"68qZTVTYNxmjOItHbw14Nw":{"text":"This Café has been around since 1862 selling great chicory coffee and beignets. The Café a","useful":1,"cool":0},"XZgVcQWLMAg0kuRponZIig":{"text":"I have always wanted to come here, and although there was a long line and jam-packed insid","useful":12,"cool":8},"MyoPMo_FZ6rDWkukfE6VcQ":{"text":"MUST VISIT while in New Orleans, at least for your first visit.  Best way to start the day","useful":3,"cool":2},"p-3XYY6iNX8C24PRew11PA":{"text":"On our 1st day in New Orleans, My wife and I passed by this spot a couple times while walk","useful":1,"cool":1},"3BKasjZQ8v_7tzrxTFLbLw":{"text":"Took a trip to NOLA in March and was excited to give this place a try since everyone says ","useful":1,"cool":0},"zNMve2i90dKJ4K6tNdtYaA":{"text":"Not much to say about Cafe Du Monde..:IT IS NEW ORLEANS. I mean, when people say \"hey I'm ","useful":3,"cool":2},"qCuYrfWxH48BmbpO0ZgU8A":{"text":"A trip to New Orleans is not complete without going to Cafe Du Monde, especially the origi","useful":4,"cool":2},"fJZ9SN4X7uIMlWRfwHY_8g":{"text":"What more can be said about Cafe Du Monde? \n\nWe made an early morning run to get beignets ","useful":5,"cool":5},"gPTG6alYaWJZN4F72N1aNQ":{"text":"I was so excited to try this place since I grew up drinking their coffee. However, it was ","useful":6,"cool":2},"x0nSTZbGQRZe2dEn2PsJCA":{"text":"Delicious and wonderful beignets. You get 3 per order. They are clouds of fried, pillowy, ","useful":1,"cool":1},"w8sMWHbx_cvNMqYeFHEHMQ":{"text":"must go, won't be disappointed.  This was our first stop for beignets and our favorite!  T","useful":0,"cool":0},"VofiQs9e-h1cCmz94czoKQ":{"text":"Visiting Cafe Du Monde is a experience you must have in NOLA! \n\nBeignets are crispy, dough","useful":1,"cool":0},"swueYMVCvFvODZ0Vhrediw":{"text":"Overdue on this review! We loved New Orleans! My mother in law insisted we come here for s","useful":1,"cool":1}}