{"XtEMfUVqh20b-YZZlY9h2g":{"text":"A true flag extravaganza!  Also, the nicest people in the world.  I accidentally walked ou","useful":3,"cool":1},"cPiqN4qubIALKfr4dRh4AA":{"text":"Best flag shop I've walked into in my entire life! You are bound to find whatever flag you","useful":2,"cool":0},"sisXKtXi0kmiYQlPF4l3aA":{"text":"I've bought at least 3 dozen flags from here over the years. \nI also never knew the name ,","useful":0,"cool":0},"Lgz2v-K0ppFZPKM0V9POOQ":{"text":"This is the place for anything flag or banner related. Large inventory and very helpful st","useful":1,"cool":0},"D_3y1c-JFhIq4sUJUemE3Q":{"text":"A cool shop again on Magazine street.  I went in early April and was on a mission to find ","useful":7,"cool":2},"p4M0-oSFVDt5c_byuKq94g":{"text":"Literally the nicest man, Charles helped me yesterday finding a birthday gift for my fathe","useful":5,"cool":2},"LQg9KpRtofExns14Huva0w":{"text":"This store was very crowded, but in a good way with tons of amazing flags. They even were ","useful":0,"cool":0},"Lex5JU_wwMz3JlfoxANSYQ":{"text":"Great neighborhood shop. Very welcoming to all people. Love love love  this shop. You shou","useful":1,"cool":0},"hmTVaWwXmj5fkSVmu4GRSw":{"text":"We actually bought an American flag from them. They were very helpful about flag poles and","useful":0,"cool":0},"R2lhXAcZ2EoAcbQ1Odrfkg":{"text":"I have passed this flag shop probably a million times, with it's colorful flags and banner","useful":5,"cool":3},"xc3yqYwvkRNN0spAyPnpsA":{"text":"Great place to shop for flags for your home or business. I'm looking for a couple of new f","useful":0,"cool":0},"pdZ7n6_4-4Ttpc5qa8z_zQ":{"text":"I don't understand the bad review at the bottom???  \n\nMy friend, sister and I stopped by t","useful":6,"cool":1},"zwtW4yvLE6X7oa_sU6yq5Q":{"text":"I found a mask here that I dearly loved, but I did not purchase it.  Later, I regretted my","useful":2,"cool":0},"OjsbqEISwVIdRkq5PLk9fA":{"text":"SO MANY FLAGS!!!!\n\nThey literally have any flag you could ever want.  Thousands, if not te","useful":3,"cool":0},"mO6_RKLHMUXOtoMVxckl-g":{"text":"SUPER AWESOME people. We live in Chicago, but from NO and stocked up on all our gear. Help","useful":2,"cool":0},"Wgmp6uDloZ71chdq02hHJQ":{"text":"Love this place! Their inventory is massive. The gentlemen are knowledgable, funny, and ki","useful":4,"cool":1},"hlCU4qHmhw-OodDRBUd-8w":{"text":"I was surprised when I checked in here earlier today to see that the flag shop had such lo","useful":12,"cool":6},"Mg_3y1P7_Af6cFs8nIA4WA":{"text":"The only thing worse than this cluttered and uncomfortable store is the rude and surly sta","useful":3,"cool":1},"LyDRm6ol7gMFpNWXS-m5ww":{"text":"How business owners as aggressive and rude as this can stay in business is beyond me. Char","useful":12,"cool":0},"ly76JqlFZxXIBZ9hoysYCw":{"text":"They have white supremacist flags.  'Won't be going back.  And I'll be telling others.  It","useful":3,"cool":0},"ZaFSerCO7Gnm7QI1CXMKwQ":{"text":"Is THAT the name of this place?? We affectionately call it \"That Really Gay Flag Store on ","useful":4,"cool":2},"RMYm6Fb6v_dOjmgwc2a_lg":{"text":"guy is obnoxious and ripped off my girlfriend. she tried to return one of the flags that w","useful":10,"cool":1},"nBvSEr3lKox-T458Pz9JFw":{"text":"Conveniently located on Magazine Street with an amazing selection of flags, windsocks, etc","useful":1,"cool":0},"DGqdbcMPk6d9ws10mcmxsg":{"text":"They have everything!  Don't forget to sat hi to the mascot at the front door. Flags, wind","useful":1,"cool":0},"D7pwfHQG25AplpumIapGOg":{"text":"I bought a Carnival-themed garden flag in January, and now that Carnival's over, we went d","useful":4,"cool":2},"CT_e_vkBtdXKRnJ6M0OppA":{"text":"Excessive Profit Margin\n\nThere certainly is an amazing selection of flags ~ thousands and ","useful":10,"cool":1},"iGkAqPxb57-1Wsf3GZFN4g":{"text":"Horrible customer service. I purchased a New Orleans flag for $88 from here in July and th","useful":6,"cool":0},"GnRNlf6w81bpi49TnA8-lQ":{"text":"Ok. I waited a year to go to this shop and purchase my flagpole and flag. After looking th","useful":12,"cool":2},"BxYxf3cZTPX66W-iauVqCw":{"text":"Very large selection however they are EXTREMELY condescending both in person as well as ov","useful":2,"cool":0},"TfCQSWNZWuMhdtVe8tUv5w":{"text":"This place is an accident waiting to happen.  The owners, the two guys always sitting outs","useful":2,"cool":0},"nhK9A-CZ2ZPv6AeJv1jB9Q":{"text":"DO NOT PURCHASE HERE! I purchased a flagpole for Jazz Fest, which broke on the first use, ","useful":10,"cool":0},"aXREnirI-iKiBg2Zj8IRYQ":{"text":"Decent selection, but then again this was the only flag shop I could find in New Orleans. ","useful":1,"cool":0},"lg6K55CcQ-1opMSOyY7o1A":{"text":"If I could give this 0 stars I would.\n\nWent for a flag.  Saw the confederate one displayed","useful":19,"cool":1},"QE8dvuYNj0GpQU0QwbG-uA":{"text":"Flags, flags everywhere! If you have an occasion, holiday or special event...there is a fl","useful":0,"cool":0},"c5tnLjKjFkj5-dLXv6eyvQ":{"text":"If you're into flags, or wind chimes or funky animal puppets, this is your store.  It's ha","useful":3,"cool":0},"36VKYBvkMR2M0VRs16R9zg":{"text":"Like walking into an orthopedic death / fire trap. Flags draped everywhere so you can't se","useful":6,"cool":0},"7b2grtd4vx5V6QsvokXm8A":{"text":"Charles was EXTREMELY RUDE and behaved unprofessionally. DO NOT shop here! My wife called ","useful":5,"cool":1},"V5bodqh1E6Tyw6zn5pXd-g":{"text":"I went in to get a flag by request of a neighbor. I bought it for $30. Got home and found ","useful":1,"cool":0}}