{"NspianSVFkZKTnuTmf45aQ":{"text":"Amazing, fresh, and flavorful food! I came for Sunday brunch after seeing the crazy line o","useful":1,"cool":0},"u8NOXysmnqx0wTYxu_I6EA":{"text":"It's such a battle when you want to lick the plate but know that these typical dishes shou","useful":0,"cool":0},"lLuQR7I5zSeiH9WqKhGQOg":{"text":"Excellent Latin American food in a small space in River Bend. Manny, the owner, is very fr","useful":0,"cool":0},"Sue9tzn9dS01x8PSZLkWbg":{"text":"A  week in New Orleans, and many fine meals; mostly in the French Quarter.  We were lookin","useful":1,"cool":0},"PgZcFfWNfzaDAwZo9JabBA":{"text":"We were here for breakfast. We are not new to Central and South American cuisine but found","useful":0,"cool":0},"roTFlVvP58lItqb7hwhFkA":{"text":"I went with a large group, and we received fantastic, personal service from the manager. W","useful":1,"cool":1},"0ty0mwP8kkqSZVvCouIwLA":{"text":"Authentic tasting Latin food. We had our order to go. The pupusas were great (we had the v","useful":0,"cool":0},"sxDl35TQcdWODCMXRf2Z5w":{"text":"I admit, I had never tasted a pupusa, but when my latin american friend took me here I fig","useful":1,"cool":0},"0YyMhaUTpbDCWBO5MCsVrQ":{"text":"This is a wonderful neighborhood gem! A friendly staff that welcomes you in like an old fr","useful":1,"cool":0},"fgEVPEfJzcppX9_DzIHnEQ":{"text":"Short review: the restaurant ain't as exciting as the song.\n\nLong review: I've been here o","useful":0,"cool":0},"ReDzJEWn0_Kkl-m5kRSG2A":{"text":"Soooo, I am from Miami and a latin man of Brazilian extraction, so Salvadorian food is not","useful":0,"cool":0},"mkJshc-oIKRgxAlNvYtUfw":{"text":"When I saw this restaurant offering pupusas right smack in the middle of the river bend, I","useful":2,"cool":0},"xurAmqLO4bh4q_l-VkJUug":{"text":"Some of the best pupusas I've ever had and I'm a native from Central America. I've tried i","useful":1,"cool":0},"RUGV9HDUN96F_xXEkFBwCg":{"text":"If you're looking for authentic Central American and Caribbean cuisine THIS IS IT RIGHT HE","useful":1,"cool":0},"HB_pBLjMEnsZ2k2iB9-sDw":{"text":"Pretty awesome.   Apparently Drew Brees thinks it's the best latin restaurant in New Orlea","useful":0,"cool":0},"y6z_TyJwAh3OHXeWbmBJFg":{"text":"I was trying to show my friend Salvadoran cuisine for the first time and I've given this r","useful":0,"cool":0},"-Zy2lEzh7PcQZVv1Pqz_fw":{"text":"Weekend brunch. La Macarena boasts the most amazing and wonderful and insane breakfast bur","useful":0,"cool":0},"pFFQqltqOBmQLhOaLSIXng":{"text":"I tried the stewed chicken, it is with tomato sauce, tastes ok, a little light. Maybe add ","useful":1,"cool":0},"Kca506dAr-P06VHRpfyVWg":{"text":"As a Houstonian, we have many Latin restaurants, so I was excited to see what Nola offered","useful":1,"cool":0},"CaomYY12RR2tlhGl_8XVVw":{"text":"Went here twice while I was in town, and both times were delicious. The group I went with ","useful":1,"cool":1},"_fF7Pxg46G06D6NjPdHQHQ":{"text":"Came here for lunch/brunch on a Sunday.\n\nShared the Central American Breakfast and, I thin","useful":1,"cool":0},"LeOlX6thtIsleTVaUHKOgw":{"text":"As a passerby, always thought this was Mexican food but it is not(totally OK, just sayin).","useful":1,"cool":0},"wJQ47Sjt5IOMh5jkXtCZrw":{"text":"The food is AMAZING!!!!!! The service matches the food! The restaurant is cozy and welcomi","useful":0,"cool":0},"B2Qbr9Wr8F87a9PQbaYq5w":{"text":"I keep intending to write a review of this place after I eat there, but then I'm all full ","useful":1,"cool":0},"EvO5RYsffmYFB4H7YXMnZQ":{"text":"The food was delicious! My boyfriend's family is from El Salvador so it was great to be ab","useful":2,"cool":0},"NuIAKaLsrd-EJdAMSYFulw":{"text":"Throughly enjoyed the Vegan lunch! Plenty of food that was fresh and of great quality. Wil","useful":0,"cool":0},"v5NgNyekAE-Sv7xbPEs4og":{"text":"What a treat!\n\nWe took the St Charles trolley line just to ride it, ending up in the river","useful":0,"cool":0},"b_i3kc7wx0OqCIQjna2Elw":{"text":"Enjoyed a late lunch here on a rainy Sunday. The waitress was great and the environment is","useful":1,"cool":1},"n1QqHPMXmEhV8cE79oFuGA":{"text":"Refuel was packed for Sunday brunch. Pepperoni's Cafe has a dismal reputation. Enter La Ma","useful":3,"cool":0},"erI_mFTAAiRWhARoI_ob3g":{"text":"Sweet corn tamales with crema, the guacamole and tamarind agua fresca are favorites after ","useful":0,"cool":0},"9cdf2lDdzawOlVx5hS3wNA":{"text":"Just had the best dining experience here! My boyfriend and I were made to feel right at ho","useful":0,"cool":0},"VDYi1ngxL2BqSx-TW1SGtw":{"text":"The pupusas were delicious, the plátano Fritos were good the beans tasty, service was grea","useful":1,"cool":1},"4IIZxRWflwYK9eABuOleOA":{"text":"So, so good. hidden gem in new orleans. so much food and its all fresh and delicious","useful":0,"cool":0},"q7Qy0PiFDSsNqeSRjkW5fg":{"text":"Fantastic casual brunch spot. I've been coming for the last five years and La Macarena is ","useful":0,"cool":0},"fFL7-GpePxn9YS2ZqMzzaQ":{"text":"We've been to Macarena twice.  The food is fine but they really earn their reputation for ","useful":2,"cool":0},"WxawF1eIvYQi9GJ8FEc2lA":{"text":"My absolute favorite place to eat in New Orleans! Enormous portion sizes and amazing food.","useful":0,"cool":0},"J3Q27HnuFZ61eSTRFxmmLw":{"text":"This place charges 3.00 for a small cup of coffee and another 3.00 for refill... You will ","useful":3,"cool":0},"7MQBK3NnqlU05zp0YBsFxA":{"text":"Everything was made from scratch.  We ordered the Vegetarian Delight platter, guacamole wi","useful":0,"cool":0},"bqnAU8Fmk_28EWvargJ25Q":{"text":"Our waiter pointed out a bunch of times that he was new, so any awkwardness and when silve","useful":0,"cool":0},"__Bz4QYZC_a_Lh2Zy172_Q":{"text":"My husband has raved about this restaurant and the owner, Manny, since he visited a year a","useful":0,"cool":0},"efHi0K57-fX78X1ktWHZmw":{"text":"I have never had El Salvadoran food, but after eating at La Macarena, I can now say I am a","useful":2,"cool":1},"HcdOWfpQGNBDsA2wgfxHcw":{"text":"La Macarena offers a great South American-style cuisine, along with a casual, yet sophisti","useful":0,"cool":0},"6W9o7-dbs1hBDLgDxabOLQ":{"text":"I cannot believe that I have driven by this place so many times and never stopped before t","useful":1,"cool":0},"QdMR2d1G9IOpBYh8Iq_vfA":{"text":"La Macarena is a great Latin American spot in New Orleans. Also in a great area with reall","useful":0,"cool":0},"zPDVcCnA2X9OTcL0HtnOog":{"text":"Really small, mediocre, overpriced pupusas. Cash only and an ATM that wasn't working. Not ","useful":0,"cool":0},"baorDlIT2-M9Q1kwL2Qq8A":{"text":"On a Sunday, the service was slow and labored. We spent nearly 40 minutes before we our fo","useful":0,"cool":0},"nk8Rb9bZN1T_npKhCzntQA":{"text":"Great place for dinner if you have picky eaters in tow (by picky, i mean folks who only ea","useful":0,"cool":0},"Bzb-MEiHqKUq6_hp-Di9QA":{"text":"This place was amazing. Best tamale and beans I've ever had. Service was great as well.\n\nI","useful":0,"cool":0},"g-f0J6O4tVEONZVEYr8ufg":{"text":"We just went there for the first time,  they don't have a childrens menu, which proved pro","useful":0,"cool":0},"JiWKnuhHK-4eBRy9e0Nr_g":{"text":"LOVE THIS PLACE!\n\nAlways a great meal!  The pupusas are awesome, but my favorite is the ve","useful":0,"cool":0},"7lmkpEFjdrnmxA0cHTpgoA":{"text":"I'm from california. I have a favorite pupuseria spot back home and I was looking for a ni","useful":2,"cool":0},"LRNEOc0vv2feqmAVZUa5xg":{"text":"Wow what a place! This place managed to surpass my expectations. I was looking up vegetari","useful":6,"cool":2},"ZxAwebPfX7P86P9OgBqJhw":{"text":"Very rarely do you find a restaurant that feels like home and tastes out of this world but","useful":0,"cool":0},"_s3bhdHGVyLrzZjpifMJag":{"text":"Amazing food.  Great service.  Heading to Audubon Park for  the day and found this gem.  Y","useful":0,"cool":0},"GiKcJAzkoWj9gRoB3thuDg":{"text":"Awesome food. Fair price. I love how down home this place feels, plus it is BYOB. If you g","useful":0,"cool":0},"WnMyYM-QQKjS_yFWKSfCrw":{"text":"Tried to go twice in the last couple of days, both times during business hours (once at 4:","useful":1,"cool":0},"Ndq57aiWrj0VGEHaQz0_GQ":{"text":"My sister is vegan and was in town visiting.  My husband is faaaaar from vegan.  I was hap","useful":2,"cool":0},"CcDidbnIJUuDMLEhj53D1w":{"text":"Teeny little place, with kind of an ackward set up. \nThe menu is HUGE, but they do have a ","useful":0,"cool":0},"ufoXf9v5PyVg1jGk2mrqVA":{"text":"This was one of my favorite meals in recent history.  First, it's VEGAN FRIENDLY, which is","useful":0,"cool":0},"pZ0OAjOyuo4qD8xjc_cCpg":{"text":"First off, I would like to say that this is my first time to be the first person to review","useful":0,"cool":0},"AgDtkSid1FKMcJiKynQPAQ":{"text":"Loved the owner, the service, the environment and foood! :) Try the tamarind drink! And th","useful":0,"cool":0},"AnC2DH0CTalDU78Lm03FIQ":{"text":"The staff is friendly, the restaurant is nice and cozy, the food is wonderful, this place ","useful":0,"cool":0},"PD2qBwTXVnYP4JWLFBoYPA":{"text":"The best dinning choice I made in NOLA. The spicy shrimp tacos were recommended and were t","useful":0,"cool":0},"oBk0bWUKMI45Zbpb5aBIAQ":{"text":"The good: Several vegetarian options. The cheese pupusa and guacamole were really good and","useful":0,"cool":0},"Za1gqMECvR1G-RRKAXeiuQ":{"text":"The food is traditional and delicious, but this place is far from authentic...the prices a","useful":1,"cool":0},"fUEo87GGil7RJhSKrmLZLQ":{"text":"A tiny little place conveniently close to Tulane's campus. I've never had Latin food, so t","useful":0,"cool":0},"JJlBJzEJ6Y6-o7svsQHQdQ":{"text":"We read the reviews on this place and decided to check it out on our trip to NOLA.  We are","useful":0,"cool":0},"r35-8ObyYUEAX4jp8Jls6g":{"text":"Only people in the restaurant and they still couldn't manage to get my order right. I aske","useful":1,"cool":0},"8t2J_fgd7OcNnSr7aOU-iQ":{"text":"Great service always! Manny is the man, the great and very friendly owner! Amazing food al","useful":0,"cool":0},"k0Ha7OLWPpYzMko7j8aHTw":{"text":"Went this past week to La Macarena and really enjoyed my experience! It was a bit more pri","useful":0,"cool":0},"3sebH2bWM6cebPT2KsqSmw":{"text":"Went on a whim a few days ago.  Truly amazing Central American food. Place was very busy s","useful":1,"cool":0},"Hwh1ufJrPtkKkOLQSIywiw":{"text":"I am in love with the abuelita who is running this place.  \n\nWent in to place a take out o","useful":3,"cool":0},"DYNOD7exTUYlEh82UpWPWw":{"text":"Delicious vegetarian platter of cheese pupusa, sweet corn tamale, & guacamole enchilada.  ","useful":0,"cool":0},"Ejjk2OJ74CVXd5QpU4biAQ":{"text":"Great place, very small only about 7 tables. The restaurant is probably one of the cleanes","useful":2,"cool":0},"WMYb1ja2ebAol4W0592slA":{"text":"I really like the food here. It's fresh, delicious, and different from the food you can ge","useful":1,"cool":0},"RuvhuxetoL4KdvdAZkqhWQ":{"text":"Oooooo boy, it's been awhile since I've had guacamole like that.  On a crispy tostada with","useful":0,"cool":0},"lGJ0nzYKjGkUPElkYiK1LQ":{"text":"Wonderful food and great friendly service!! The Horchata is the best!! They were open on J","useful":0,"cool":0},"1MSZBm9r7UJNKk1sdGY8Qg":{"text":"Had a great meal here.  My boyfriend ordered the pork, cheese and bean papusas and I had t","useful":0,"cool":0},"dH_JLV8vTORN12aUatOD0A":{"text":"This is one of my favorite places to eat. My husband and I are regulars and are treated re","useful":0,"cool":0},"Jx4eIp4odcMGuCSs0sU1iQ":{"text":"Delicious and authentic ! Had the papusa plate and it was spot on. Fairly priced excellent","useful":1,"cool":1},"iAgeuYigZSWfXCDwRDe3tw":{"text":"Unfortunately disappointing. Strike 1: Our table of 7 was warned that our food would take ","useful":2,"cool":0},"K5a3LqBbJYzzQpytQPLeNA":{"text":"Food is always fresh and authentic. I brought my middle school Spanish students for a fiel","useful":0,"cool":0},"zJJsJ4spv_xt3y59IgPfyg":{"text":"I have been there a few times and every time the food comes out really fresh and delicious","useful":0,"cool":0},"isPYLIzk98Q4yERl6BPHiQ":{"text":"I've only been to La Macarena for breakfast, but everything is delicious!  The guacamole i","useful":2,"cool":0},"fuoKLTPQayYIRd9lbzD1Mg":{"text":"I've tried a couple pupuserias in kenner and this one made better pupusas (my honduran fri","useful":3,"cool":2},"CRiIuHnFpSBZI3URuaFYLw":{"text":"I was really blown away by my recent experience at La Macarena. First, I'm grateful that t","useful":18,"cool":11},"_588RNJWPpoNmu5KbEvNKQ":{"text":"The food was delicious but did not make up for the other issues. Service was slow (it took","useful":0,"cool":0},"UkpbVhvV1fH3rZKCARq0vw":{"text":"I came here for the first time for our annual trip to Nola. My friend had been here once b","useful":1,"cool":0},"6iZF2EC-JxGxhuNqP-1KyA":{"text":"OVER PRICED!!!\nI didn't see anywhere that it was cash only and there was an additional ser","useful":0,"cool":0},"cnuS5qcI8BkCuXxHRs5XPA":{"text":"after a weekend in new orleans, we stumbled upon this magnificent mom and pop type restaur","useful":0,"cool":0},"VoOIfJyn7ra-2a68WJXh7A":{"text":"Sweet corn tamale and cremation.  OMG goog.. Yuca frita and pupusas.very good .  Breakfast","useful":0,"cool":0},"-hUIjYZVge0iYxXsqsxPqA":{"text":"I come here a lot for breakfast/Brunch and its always an awesome decision, but I'm here fo","useful":2,"cool":1},"yQi25Q1d7Mb2gxKNMBbr_A":{"text":"YUM! I got the El Gran Vegetariano Dish (made vegan-style of course :) which came with a v","useful":0,"cool":0},"kpQVJfen85AxbtPu0pGnmg":{"text":"This meal was fantastic! I am going to go back this week for another Papusa Platter. So so","useful":0,"cool":0},"GUCSU4fM0E95B1bvJ4CgzA":{"text":"Fantastic Latin American place!  Manny welcomed us out front and shared the menu and what ","useful":0,"cool":0},"yAzjIf_FAfzg_4gT19UyMw":{"text":"I liked the agua frescas a lot. Food was good, but a little pricey. Staff is really friend","useful":0,"cool":0},"41X8vEEzaoe248VLkNopaA":{"text":"Best Central American restaurant in the city! The owner will make you feel right at home. ","useful":0,"cool":0},"MwRScP_xg-NgN-1z-H_fBg":{"text":"Food was good.  Didn't realize I couldn't pay with my debit card.  ATM in the restaurant c","useful":0,"cool":0},"kNjOfI8i6RYG2zcWN2BtTw":{"text":"Coming from a Salvadoran background, me and my wife always look for these type of restaura","useful":0,"cool":0},"ix2asgbX4oDs1ad0nfXcjQ":{"text":"I have given this place 3 tries. Bad experience every time. They promote that they have ve","useful":9,"cool":1},"US-NLiJdo7xEZLXi2SSDJA":{"text":"Great authentic place..! The arepas were delicious,the seafood was fresh and the owner gav","useful":0,"cool":0},"Jy-zBw7PydqzPAg4pp1Dug":{"text":"It's really one of the best restaurants in NOLA.  I started going when they first opened a","useful":0,"cool":0},"LLcrb_aWN7YZKVPvKW28Bg":{"text":"We were visiting from Houston and found this place because it was listed as vegetarian/veg","useful":0,"cool":0},"BaUFsRACERTU4UTxdy8whQ":{"text":"I had been meaning to try this place for awhile, and came by about 11:30 on a Thursday. I ","useful":0,"cool":0},"7g-juZxWFTZLPMnKsyT5mA":{"text":"Holy Amaze-balls Batman! Went to go to Refuel next door and it was ridiculously packed. So","useful":1,"cool":1},"46w1fVp5dKf6EusL7EUp7w":{"text":"Our second visit, my daughter and I were here for a weekday lunch. We had the sweet corn t","useful":1,"cool":0},"8-cYFvtXZ-gm88MQyZtFaQ":{"text":"What a gem. Food is delicious. Cash only spot- not ideal but there is an atm on premises. ","useful":0,"cool":0},"pgt8BFT0Y_5OvqDHXk8nYA":{"text":"We came here with our son who attends Tulane.  This is a cozy little place with amazing fo","useful":1,"cool":1},"ClteRuw_PQWnXsRA8m54Mg":{"text":"I've been a few times and the wait for our food is always at least 40 minutes. Unfortunate","useful":2,"cool":0},"YDbT4BeiPVfjxeu4AR9RIA":{"text":"Fantastic food. Hooked me up with a delicious vegan version of the Gran Vegetariano plate.","useful":0,"cool":0},"H-fC_rCX7kC7Mxyy5fCOPw":{"text":"I went there with my boyfriend who is salvadoran and the food tastes good , but we ordered","useful":0,"cool":0},"my0RYk2Tjjr1OGmqGhf9Vg":{"text":"Any restaurant that supplies you with multiple mini-dishes of accompaniments is doing thin","useful":2,"cool":1},"RBTYnRuwGkk1TGPDKiClSw":{"text":"Awesome food! Great service.  Will be back often.  Gluten free options.  The beef medallio","useful":0,"cool":0},"NWysuuy1ckCf1-9t2ToAsg":{"text":"Only okay and overpriced.  \n\nThey only offer bottled water which they charge 2.25 for and ","useful":2,"cool":0},"q0pHScIoS1ezv5qALWcIqQ":{"text":"The food here is very fresh. and is some of the best Latin food you will find in the city.","useful":3,"cool":0},"i1D4fzT9qjNeNE5X7pf7hA":{"text":"Pupusas!! Friendly little hole-in-the-wall place that serves great Central American cuisin","useful":0,"cool":0},"IVDDU_CpVPi-EFAUd_dbog":{"text":"If you like food from El Salvador, you will like this restaurant.  All of the food is made","useful":0,"cool":0},"fzkZ2OfNYMYJGmyZ7k6EEQ":{"text":"Walking out of Camillia Grill in Carrolton I spied the words \"PUPUSAS\"  on a nearby bright","useful":1,"cool":1},"fTX668hu_dZ2xRVODTqThQ":{"text":"La Macarena is an incredible and intimate local Latin restaurant located right in the hear","useful":2,"cool":0},"MfDBCzXk17OBMF-_L2tLFA":{"text":"Having just moved back to Louisiana from Los Angeles, I have to say I was not very optimis","useful":0,"cool":0},"M2xp0SwarYyWmBBLDytQxw":{"text":"I've never had a pupusa before. And this place is great. Nice traditional el Salvadoran fo","useful":0,"cool":0},"Oh1A1keuHjOYnrICw86lCA":{"text":"My long time favorite! I love how they treat you like family and try new recipes on you to","useful":1,"cool":1},"f6ytzIvsTQv_XAWNKOz-lg":{"text":"I've ordered carryout from La Macarena twice and had a great experience both times.\n\nThe f","useful":2,"cool":0},"SSo_PLhCJNoBUkakAbMORQ":{"text":"Good service in New Orleans is a bit hard to find. The people that run this shop are extre","useful":0,"cool":0},"TNhIwx7y3tOwj6PQ8hRATg":{"text":"What a delightful surprise!!!! The food was so amazing I ate until I was stuffed!! I will ","useful":0,"cool":1},"kx4DCk20mZ7Lnm1LOD2d9A":{"text":"This place is too good!!! Manny is great. For all y'all non Latin Americans, he's gonna ma","useful":0,"cool":1},"x64PLN2Slv7ujPRF4_gyEQ":{"text":"Been here several times now to give this place a fair shot but each time they have come up","useful":5,"cool":0},"qwR8CEwYYffbG4PFZdRBCA":{"text":"Wow.  I really wasn't a fan of this place, but after seeing all of these reviews, I think ","useful":5,"cool":1},"lH44s9T4wVM0F2Ose75hVA":{"text":"Yummmmmmm!! I had the vegan breakfast burrito and the mango juice and both tasted fresh an","useful":2,"cool":1},"kiZ1T6eURX30j-4qFUaI9Q":{"text":"Love, love, love La Macarena! Food is absolutely amazing. Great variety of pupusas includi","useful":0,"cool":0},"XEhBJiiCqKETnulF6XvKgw":{"text":"This is one of my favorite Latin restaurants that I've been to in Louisiana.  I've only be","useful":0,"cool":1},"d1uazRH2ITOSi51bqYgYsg":{"text":"We had a terrific brunch here of pupusas, huevos rancheros and appetizers. Very good servi","useful":1,"cool":0},"1rQnx1qzuqqtJ3QHYOWqeg":{"text":"I don't even know where to begin. The restaurant is very small. A couple of tables inside ","useful":1,"cool":0},"oiJ8WBLQfHTXQJerv4_KuQ":{"text":"First off, the service was excellent! My boyfriend amd I tried papusas, enchiladas, and ta","useful":0,"cool":0},"q8Zl1Yhj4Y8a0H9jAitVCw":{"text":"Stumbled across La Macarena and just needed a quick lunch. Our waiter described the new fi","useful":0,"cool":0},"gfjoR9NDCRUsARx3JbEcAg":{"text":"I'll start with the positives: cute decor and the food was really tasty. Its a little chal","useful":1,"cool":0},"I4dHfenkQMYtOOTI-51eXQ":{"text":"The food is fresh and delicious. The staff is delightful. BYOB with no corkage fee. It's a","useful":0,"cool":0},"Odvczy_4DnMWnFY_7b3JWg":{"text":"If you're riding the St. Charles streetcar make sure to get off at Riverbend and eat at th","useful":1,"cool":0},"HS-o4trdMe7_TeNaZPm14A":{"text":"I loved this place so much, I had to come home and immediately give it a review. I have ne","useful":0,"cool":1},"6gNQh4dDS-mn0bjp6mWvUQ":{"text":"A friend and I stopped into this cute little cafe for brunch on Saturday morning. The youn","useful":0,"cool":0},"ibaJXjIL5UyxO-4RoQ84lw":{"text":"My husband and I were in NOLa for vacation. He's Salvadoran and wanted to check out a pupu","useful":0,"cool":0},"dIRwpyNWks7rAjAHxAMDwQ":{"text":"I am giving La Macarena a high rating due to to great food,  i always feel like i am eatin","useful":1,"cool":1},"NJo-4t4evrJBN244gd8fFg":{"text":"stumbled in on accident & regretted it. very little flavor. The food here is so bland and ","useful":0,"cool":0},"QbCgxjTMWKqGVr-Zhmqfew":{"text":"Best food in riverbend!! Their pupusas are amazing. I've eaten plenty of pupu's and these ","useful":1,"cool":0},"pEZoyqeZnawxsEqwBJLwdA":{"text":"I want to like this place but I just can't. It is way too overpriced and the food is not a","useful":0,"cool":0},"LDNiTH4aVKyeyHqGSBPHbg":{"text":"Love this place. Great service every time, food is unique for the area and it's all delici","useful":0,"cool":0},"j3HBU87YJDFwFi2u5K11HA":{"text":"DELICIOUS. Can't recommend highly enough. Such great options and a must for vegetarians. I","useful":0,"cool":0},"nVOshVzchN4G3bP30JN9zQ":{"text":"I really really wanted to love this place because the restaurant is cute and I absolutely ","useful":0,"cool":0},"74XQfWPRzLUUITmj3kZfZA":{"text":"I had a fantastic breakfast at La Macarena last weekend, more interesting than neighbor Re","useful":0,"cool":0},"8nCFQ4fBWmTIX771JE6FNA":{"text":"We accidentally stumbled upon this place and can't get enough.  The food and service here ","useful":0,"cool":0},"LXjOaCnioNoY5jXsz2y8TA":{"text":"Loved this place! First off, the food was fabulous, and I got to try things I'd never had ","useful":0,"cool":0},"dIgIBTTrvW6c6L7nH9szRQ":{"text":"Great Central American cuisine- wonderful ceviche' and pupusas.","useful":0,"cool":1},"61pH_E0lsyao4buJYoRzmA":{"text":"Best Latin food I've ever experienced, would have to say that this is my new all time favo","useful":1,"cool":0},"vlN9LyTQzSxUrLZDycNGNw":{"text":"La Macarena is a small family Owens's restaurant. You can bring your own alcohol as well. ","useful":0,"cool":0},"JfR6T3FFJSYzjlN6nTdOEw":{"text":"I stumbled into La Macarena by accident and good god it ended up having the most ridiculou","useful":1,"cool":0},"i-YgUtkrrQEyktVx8yXqwA":{"text":"This is the best pupuseria here in the USA\nAs soon as you go in Manny the owner treats you","useful":1,"cool":1},"FNQLKEL7RhkXM2P7vipjsQ":{"text":"The food and service are absolutely amazing. Home feel with great and friendly employees. ","useful":0,"cool":0},"cuVhlzkrmeOJ7dMOms2WjA":{"text":"Update 12/20/12. I've visited this place a couple more times with (very) small parties and","useful":0,"cool":0},"D1LUTxvbVjYoPYDu7W3EYQ":{"text":"Major disappointment & WAAY over-priced for the quality of food. Nothing special at all. I","useful":1,"cool":0},"bGlSCZkaCLYnkQSPQgmPaw":{"text":"Love this place! The food was authentic and the place was very cozy. It is a small place, ","useful":0,"cool":0},"SXWb8GMZsYT0eg-n7BmWMA":{"text":"Visited from Charleston SC with a group of 4 for brunch during the week at the recommendat","useful":0,"cool":0},"6DXb92_eSaKhfhbyKODMHA":{"text":"We LOVE this place! Excellent food & friendly service.  The pupusa platter is the best! I'","useful":0,"cool":0},"BGMnQZT-ZkYmthFVfzBoAw":{"text":"Went last weekend for brunch.  We scoured the menu and went with Montaditos (Marinated bee","useful":1,"cool":0},"q6DK6umliihB7G2DTxJwVg":{"text":"Worst dining experience ever! We ordered the vegan tamales, which came with cheese on them","useful":3,"cool":0},"hjPxalBhk8zzTXygEJiH-Q":{"text":"We found this little gem while waiting in a table at Refuel. The line was long and it was ","useful":0,"cool":0},"rprgq6ubfqHoJeVsOLJwCg":{"text":"Cash only & they are VERY sneaky about it. \nIt's listed only at the bottom of the menu on ","useful":0,"cool":0},"KKntzmCjWWFO_JAbcrMyBA":{"text":"This Salvadoran restraunt is the best latin cuisine you'll find in the city ! The shrimp t","useful":0,"cool":0},"w17RUKn0Zuh8sr8EoE4aHQ":{"text":"We wandered through the garden district and were lucky to find this place.  All fresh and ","useful":0,"cool":0},"5osIisiROzHWJWa99DvkWQ":{"text":"Amazing food and wonderful service.  Having grown up in a Cuban household, I can tell you ","useful":1,"cool":0},"PPosGyvmmd8_UVhagbvgmw":{"text":"I used the 98% rating from urban spoon to find this place one Saturday night. I was not di","useful":3,"cool":1},"sPrNbURbSYl75FjF5NZ0kg":{"text":"Loved the Central American Breakfast. Great, friendly, service. Family owned place in the ","useful":0,"cool":0},"C4CbM7Yoio93VzHTclDp6w":{"text":"Nice place for weekend brunch. The wait staff were very friendly and answered all the ques","useful":0,"cool":0},"zfSa9CA8tzjSDSI0l4Nemg":{"text":"Yummy! I grew up in Nicaragua and El Salvador and the food here is on point, thought it wa","useful":0,"cool":0},"iYnEUYpl08JD7hz52rp0Lw":{"text":"Mediocre at best and way overpriced. Pupusas were small and dry. At almost $15 a plate you","useful":5,"cool":0},"tZSRI09TBYlpFHTuN2iSFA":{"text":"So good i ordered a whole meal of pupusas to go. Would love to come back if i got the chan","useful":0,"cool":0},"tz0-pcdDhyRcBHk6LmcANQ":{"text":"I just ate here for the first time with my boyfriend. I'm a vegetarian, and my boyfriend i","useful":0,"cool":0},"cFcv-cigZ1T1JUHj7Qudmg":{"text":"As a vegan, I appreciated that there were several veggie options on the menu.  My husband ","useful":2,"cool":2},"U0pMaM4OffNA1RCEG9JXgg":{"text":"Delicious and super friendly!  Tostaditos con frioles and papusas were generously sized an","useful":0,"cool":0},"MzjXHCIlcQxLHXfRz05PPQ":{"text":"Not Lost in Translation\n\nStopped in on the night of the Great December flood and was greet","useful":0,"cool":1},"Txaag0oe6GjaJpvEMbcH5Q":{"text":"Best carne asada I've ever had! Wonderful flavors, cooked perfectly. The shrimp that came ","useful":0,"cool":0},"k2NlcY8KyK4CVyTYKrYb3A":{"text":"Everything that came to our table was great. Papusas are awesome. This is a great place fo","useful":2,"cool":1},"Rbh6xGY329ffiupvN7cyTQ":{"text":"I would wade through flooded streets to eat at this place. Oh wait, thats exactly what I d","useful":1,"cool":1},"oMiQBY0qk8PuypQT5YWgAQ":{"text":"Seriously the best. I've been three times and it's been outstanding everytime. The pupusa'","useful":1,"cool":0},"c4vg1SYYuXQFD0wokRdENA":{"text":"Had a very disappointing experience today. My guy and I pop in every now and then to La Ma","useful":2,"cool":0},"xrjx31ZCsHN-c-U3jlhj2g":{"text":"I love this place! Amazing food, it's hard to find very good pupusas but this restaurant i","useful":1,"cool":0},"wJ_JYynYnG2VGv8OKDzEYQ":{"text":"My favorite brown bag location! You can't beat the service, the staff is great, and the FO","useful":1,"cool":0},"MSg3L3yqhuCw06GWieQVkA":{"text":"Yummy!  We stumbled upon this place while trying to go to Camelia Grill..and via Yelp..tha","useful":0,"cool":0},"VTQxGPDO78I90tMw73Wnsg":{"text":"A modest little place that is cash only. The menu is a dream for anyone with special dieta","useful":3,"cool":1},"I1BHfnmnqttJp-P4y9xaHQ":{"text":"Absolutely amazing, fresh food. Have been going here for a few years and they've always be","useful":0,"cool":0},"l3rVGZsvq6icOWph6xTeHw":{"text":"This is one of those places that makes me wish I still lived in NOLA. The food here, espec","useful":0,"cool":0},"FGLd1K8d94ogZGz6XvJv6w":{"text":"I first tasted pupusas in El Salvador and was desperate for some when I came back home. Th","useful":0,"cool":0},"bebVOk2R509APSHJII_g3A":{"text":"I tried them for lunch last week and found it to be ok, if just a tad pricey.  I had the p","useful":1,"cool":0},"ntgStMgudXbdujp2qqfTXw":{"text":"Manny and his family are absolute experts. The level of customer service is out of this wo","useful":0,"cool":0},"asza8mRyAlXG-66qoJW0qA":{"text":"Love love love this place! One of the only places I can find organic food AND huge portion","useful":0,"cool":0},"zWVkaCpmcx47AdC7O81mOA":{"text":"I have a couple of gripes about this place that prevent me from visiting unless friends in","useful":1,"cool":0},"sJ-0P0s7_0lSBYLa3yQWkA":{"text":"I love this place, and the fact that it's in my neighborhood, and they deliver, are just t","useful":0,"cool":0},"G2DcCZqV_zcDIG89-T4XiA":{"text":"First let's start with the exemplary customer service !!!!! I was instantly greeted with s","useful":0,"cool":0},"S-jNAokpZBCr95FbmsVF9w":{"text":"Delicious Latin American food.  The Grande Vegetariano plate is AMAZING.  Cash only, BYOB.","useful":0,"cool":0},"Wz7HBfyg2Fb9VZZ3JifI6w":{"text":"La Macarena is a small family owned restaurant. You can bring your own alcohol as well. I ","useful":0,"cool":1},"hO7wl2WlFubU8XQ1Bu_uDw":{"text":"I had lunch here, and while it was pretty good, I wasn't super impressed like I wanted to ","useful":0,"cool":0},"2yAJ0x8-FV3CMXD67X2y3A":{"text":"I'm not a big fan of the entrees Ive had here but the people who own the place are very ni","useful":1,"cool":0},"QnsAlMplR6u0o-_Bbn1hAw":{"text":"Some of the best food in the area. Period. Everything is to die for, customer service is i","useful":0,"cool":0},"5rYyP0LzVPPFgK5VNE6WDA":{"text":"Pupusas, a Colombian corn patty stuffed with meat or cheese fillings, are a rather new qua","useful":1,"cool":1},"VyCONZmw5LEq5Y3YeUO8eg":{"text":"Interesting food; agree the papusa's are awesome, had the enchilada and papusa lunch speci","useful":0,"cool":0},"d0G_qEBgY01CFsFKAAhH3g":{"text":"The most genuine and authentic restaurant in town! The best food surrounded by a loving an","useful":1,"cool":1},"96SzE1MksfrlLW6QfEOjtw":{"text":"This was delicious. I wasn't expecting it to be as good as it was since I've never had tra","useful":1,"cool":0},"3T9vbrtfE4FXtBsV8WlP0A":{"text":"Small place yet charming, ask for Manny when you go. Latin fusion at its best.  Don't dine","useful":0,"cool":0},"Nsbl9xOFhcyw4XV2GfqnRg":{"text":"Amazing! Cash Only! $13 meal. Plantains were amazing, i have never tasted anything like th","useful":1,"cool":0},"sghnzaBbCtTmNZdqlyM88A":{"text":"GO ON WEDNESDAY! $2 pupusas!!! Bean and cheese are the best. \n\nAlso, don't bother with the","useful":0,"cool":0},"cxbBQYvi1gEyEwGTmNfcWg":{"text":"Wonderful shrimp tacos! Truly the best kept secret in town! I've also had wonderful pupusa","useful":0,"cool":0},"27zpvgKLA9ok4VIGJFDf7g":{"text":"My family and I have eaten here since it was out in Metairie. Food had always been great a","useful":1,"cool":0},"1hgXYvOeL6ihn7x4IngeTg":{"text":"All I can say about this place is Oh Em Gee!!!  This place has the best food I have had in","useful":0,"cool":0},"KTXP1bz0QIN-YfS_5dqmRw":{"text":"GreAt breakfast at a good price! Good lunch specials too! Cash only which I always forget ","useful":0,"cool":0},"-anN5YGfegMYm_TwcH2t6Q":{"text":"Me and a group of 5 of my friends, a few Tulane students and some visitors tried to get a ","useful":0,"cool":0},"vAZN4mD_Ab1aY1SHGym7-w":{"text":"Stopped by for brunch on a weekday. The waiter was really friendly and explained the menu.","useful":0,"cool":0},"JUOPkm5hZ1qAOK8vrI840Q":{"text":"I love this place SO much! It was the first restaurant I went to when I moved to NOLA, and","useful":0,"cool":0},"gBxGnXpTpjaqqy04KIlXdg":{"text":"This is my favorite restaurant in New Orleans.  I eat there fairly regularly, and I bring ","useful":4,"cool":1},"q2QGq5xleM-hxE90TA-1Ig":{"text":"Finally a good spot with Spanish food that offers vegetarian dishes! It was probably one o","useful":3,"cool":1},"ODdj_2u61Ofpwt3Eaz6w7w":{"text":"I stumbled upon this place one night looking for something interesting to eat. After tryin","useful":1,"cool":1},"XMAHRumNNF6uwWYpdigudg":{"text":"Might have been too hard on the place. It is consistently good food and honestly worth the","useful":0,"cool":0},"pH3IGmvdA6xVUAKP5d-M3Q":{"text":"This. PLACE. It has the energy and vibrancy of the beautiful country El Salvador, the love","useful":0,"cool":0},"Eb7V0mVlFhHdeCi3vj1umg":{"text":"Awesome Latin American food! I always go for brunch, because their breakfast burritos are ","useful":0,"cool":0},"OxskhBd6INUmaG6m1W5iYg":{"text":"I usually don't go here because I think it's overpriced but today I really wanted some Cen","useful":0,"cool":0},"x7ftQcrFEWbz6su0JHposw":{"text":"The Pupusas here were amazing. They were complemented well by sauces, salad, and beans. Th","useful":0,"cool":0},"nzL6akxyaQBilYj6GR5wzA":{"text":"best. its the freshest food in the city. I honestly eat here every week. love it. love man","useful":0,"cool":0},"Z2Hzj3pjictzZTvSzPmM4A":{"text":"Awesome Ceviche! This place does it right. the rest of the menu is good but the Ceviche is","useful":6,"cool":6},"P27zCUhU8UJgKJhzyM7WcQ":{"text":"This was a great and unusual meal. I ate a papusa for the first time. There will be a seco","useful":0,"cool":0},"dAbOivlyZ-hY9k7ps-jduw":{"text":"My wife and I visited this cafe for lunch. The service was excellent and the food was deli","useful":0,"cool":0},"fzPb2T7y-CO8UJ6uUsBBYw":{"text":"From the moment I walked in, the owner made me feel welcome. He gave me a free small appet","useful":0,"cool":0},"meDGbHps3TY1Nhs_1US-vw":{"text":"La Macarena is a hidden gem! It's a brunch regular for me. Best pupusas in New Orleans!","useful":0,"cool":0},"37AzBCSBhuoMAVkfb0jpVQ":{"text":"Best Salvadoran food I've ever had in my life. The pupusas are delicious. If you are in No","useful":1,"cool":1},"yQi_8yGr_fJDbXxJlBQJmg":{"text":"Great pupuas! If you haven't had one before it's basically a flour tortilla that is stuffe","useful":0,"cool":0},"KL8lPYOIDfiQbw4T__CTfg":{"text":"This is a great Central American restaurant. The pupusas from El Salvador are delicious an","useful":0,"cool":0},"ryjenuTdaVdMvWLCQboytA":{"text":"I went here for Easter with family. Everything we ordered was wonderful, rich and fresh. T","useful":0,"cool":0},"m0dDV-jmHjARGVGti313Fg":{"text":"Exceeded my expectations. Very cozy. Friendly staff. Awesome service. Outstanding food qua","useful":0,"cool":0},"uWkuUUiXn2TufrGnpQwkKw":{"text":"Food was really great. When I asked for a coke, I wish I would've known I had to ask speci","useful":0,"cool":0},"2amvPmnQx-XCD8f8x5Nuhg":{"text":"As you enter this fun colored atmosphere, don't let the outdated photos on the wall fool y","useful":4,"cool":1},"z3H5v3er2Anq73uLYnFQrw":{"text":"Manny is an amazing server! The food was fantastic with hardy portions! Authentic and trul","useful":0,"cool":0},"zH_epNdsmEImX0ogOqelqg":{"text":"My husband and I love this place! The food is delicious and the ingredients are always fre","useful":0,"cool":0},"KO7jemCBJVuSieRWIrzaZw":{"text":"We found this little place almost by accident but wow were we surprised. Manny was extreme","useful":0,"cool":0},"OBjiaYdUFpmOBnAPxy94Kg":{"text":"Amazing meal, great atmosphere, friendly staff.  11/10, I will be back again!  Also.......","useful":0,"cool":0},"CGtXukq0CKIWrPG54-lCXw":{"text":"Been going to their sunday brunch for years. Often overlooked but it is where we take visi","useful":0,"cool":0},"BDdnh943yvqGdKx8pVZLtg":{"text":"Me and my Husband stopped by for lunch today glad we did. We was greeted by the owner he i","useful":1,"cool":0},"vSWZhze741DMusYixKDBiA":{"text":"Incredibly delicious, seriously guys! We love this place. My husband and I are vegans, and","useful":2,"cool":0},"sHXp9QFceIbwZilAjqZqVw":{"text":"We came to La Macarena for birthday supper with a good friend and had a marvelous time.\nMa","useful":0,"cool":0},"3AS5pcS0lbwQ9-fc5atMqg":{"text":"Feels like home. BEST and most authentic LATIN FOOD in the city! As a NJ/ NYC native, it h","useful":0,"cool":0},"7y5z68x-c3_Qe1qFr1s9sQ":{"text":"Oh hell yes. I've been wanting to try this little caribbean/latin joint for a while and wa","useful":1,"cool":0},"Lr3FRVAHB8aE3BIZiZf1qg":{"text":"Cash only \n\nPhenomenal pupusas, good portion size. Even the beans were phenomenal. Only th","useful":2,"cool":0},"q4Xj_upUqnqH0T7AK0ryKg":{"text":"This place was delicious! So fresh, authentic. The shrimp and rice was the absolutely BEST","useful":0,"cool":0},"QlHzl6QWIbqBQvPKDm3n0w":{"text":"There is no verbiage for deliciousness of the pupusa and food here. It's small and quaint,","useful":2,"cool":0},"SozCyQAzGQOpnTzDk-5j_A":{"text":"Actually the best food in uptown. Imagine the feeling you get when you hug your mom and sh","useful":0,"cool":0},"Mu3MrhR2qu-0FPdAgfWKRw":{"text":"It's a small space that only accepts cash. The food isn't overpriced if you think about th","useful":0,"cool":0},"nGofj6IsyXcg81YS7Zs-pQ":{"text":"The food is excellent and Manny was so friendly! We had pupusas here while in town for a w","useful":0,"cool":0},"kzTprBmbx3f9sApfUXUrtw":{"text":"If you haven't had the food at La Macarena, you life is incomplete. Their signature dish, ","useful":0,"cool":0},"gO0MGOBU76IN2X8eWIm-Aw":{"text":"Food was delicious! Pupusas were amazing and taste just like back home! The customer servi","useful":0,"cool":0},"FiWA77J3gp7wVYvHit4_pg":{"text":"This little hidden gem near Tulane University is to die for!!!!! A small place with huge f","useful":0,"cool":0},"hx7aTK4zwR1Mh5vGve-4pA":{"text":"Hey Macarena! Walking up to this place I couldn't stop singing this. This was the only hig","useful":14,"cool":10},"ob9A_PE6UgVjn-TZLNtbNQ":{"text":"This is that PIPING HOT FUEGO. Genuinely upset I haven't discovered El Salvadoran food up ","useful":0,"cool":0},"oN6IXohMUBPaGLeintjAJw":{"text":"I don't even USE Yelp but the food and service at this restaurant genuinely moved me to do","useful":0,"cool":0},"6dZPhylj4ZyN2Qc6tHLRUQ":{"text":"Manny made us feel so welcome and recommended an amazing variety of Latin American dishes ","useful":0,"cool":0},"5mYNVCMUohMofU98ILFHHg":{"text":"We decided to take our friend from out of town\n to La Macarena because we knew it was a lo","useful":0,"cool":0},"A-KSzFlqjCJjhyi1juqHbg":{"text":"It's been ages since I've been but my visits were memorable enough to where I still think ","useful":2,"cool":0},"_szIBWAywDYS0bwnVwLufA":{"text":"Manny is divine. Enough said, just visit this place for good food and great experience.","useful":0,"cool":0},"hOQ9Ly3Bh8rkMSL5I955zw":{"text":"Daily-specials and pupusa combos are pretty good. You can find horchata, flautas too, one ","useful":0,"cool":0},"X6sBhHdf887f2m6-0MU-nQ":{"text":"Excellent!!! Found a new favorite place. Food was fresh and high quality, service was atte","useful":0,"cool":0},"l7_KsWyzFK8aBYSSchiVSw":{"text":"I just want to say that the staff is so kind not only with adults but to teens and kids,th","useful":0,"cool":0},"lD7uZf45__hir5uEih8vIQ":{"text":"You'll walk into this quaint, rustic, corner restaurant and more than likely be greeted by","useful":0,"cool":0},"hBi2mLw2g0wG8BORiH5YMw":{"text":"A SADLY BIPOLAR EXPERIENCE\n\n+   Colorfully generous plates of exotic El Salvadorian cuisin","useful":12,"cool":3},"JFBS7VVoyQ630CbvnX3arA":{"text":"This place never disappoints! If you haven't yet tried La Macarena, you're missing out on ","useful":0,"cool":0},"IYPtfZEnrE0VSaHuQCKZ2Q":{"text":"The first impression: the scent of something delicious roasting in the kitchen.  A great s","useful":1,"cool":1},"St9RKxEwYXXnmJckx36FVg":{"text":"Amazing food and homemade drinks got the yuca Frita and carne Asada by far the best place ","useful":0,"cool":0},"By4YN2wtTvDG3BbGdEG7KA":{"text":"Mediocre food. The pupusas were greasy, tasteless and the bottom was burnt. The service wa","useful":1,"cool":0},"SjPbORhOSes19FR0rAK8gQ":{"text":"What an awesome T-Bone. Best bang for the buck. The shrimp tacos are absolutely delicious.","useful":0,"cool":0},"ThSXJDb0Wccz-8I2ruQsCw":{"text":"This place is fabulous! The service was fast, the food was great, and the manager was incr","useful":0,"cool":0},"Akc-SudMbG82Uu0UkRBdgg":{"text":"OK, I broke down and ordered again.  I ordered the mixed grill.  It came with spicy, well-","useful":0,"cool":0},"xQi3rOplPG7I5WZbTMDSGw":{"text":"Awesome food and great service! They are just as good as the ones from El Salvador. I high","useful":0,"cool":0},"rfhhFgKjBQGZIexFDZdJBQ":{"text":"I got the vegan tacos and one of the vegan meals that had a sweet corn tamale a salad, sla","useful":0,"cool":0},"QysdXmcn5ihKnMPSFKWbVw":{"text":"We took a break from po-boys and jambalaya to join our daughter, a Loyola student, at her ","useful":0,"cool":0},"NdiE7vnDlBhkv_MpJIDXDQ":{"text":"Thanks to the good folks over at Door Dash we were able to feast! Everything was so fresh,","useful":0,"cool":1},"eRYXV1FvIssTyfb18zGQXA":{"text":"The best breakfast burrito I've ever had. We live in Birmingham, AL and when we're in town","useful":0,"cool":0},"20Lc75R119S_KrdyAy_s6w":{"text":"Delicious, authentic, meticulously handmade fare....could not be happier with the two meal","useful":1,"cool":1},"fBDbLnuattBn3g9zQGRn2g":{"text":"Amazing food, wonderful service and overall great experience!! The food was homemade, extr","useful":0,"cool":0},"759OdJA1HR1PA_XXpzubpg":{"text":"My new favorite spot! Ate here last night (date night with hubby). The owner was so warm a","useful":0,"cool":0},"tlMLeTx3QfCSmve3zU9KJg":{"text":"Moved to NOLA less than a year ago from Cali and this is the BEST food we've had here! The","useful":0,"cool":0},"49s4mgcN68hQy61WMGWdBA":{"text":"BYOB, NO CORKAGE!\n\nFood is delicious and extremely healthy in my NSHO.  Prices are not low","useful":0,"cool":0},"8gUyVPiEMsQA_Tz1DGfBsA":{"text":"The owner is crazy, but in fun way! We went there on one of Friday nights and the owner tr","useful":2,"cool":1},"hdhTU5RDoHrS8r-g9NugfQ":{"text":"La Macarena Pupuseria and Latin cafe has a seriously impressive breakfast and brunch menu ","useful":0,"cool":0},"YK4X2ULWy2rCSxgBlNzwgg":{"text":"Wow! The food is out of this world! The owner Manny had just flown back from El Salvador a","useful":0,"cool":0},"r8Id1TITyaD_qfmL0ECv3Q":{"text":"Some of the best Salvadoran food I've had. Taste like some of the Central American food ba","useful":0,"cool":0},"ZQZehPHkQBYMkLUIm31qmA":{"text":"We tried traditional pupusa(cheese and black bean) \nChicken flautas and \nchicken and shrim","useful":0,"cool":0},"iT5WX2rUKbS_ItFxpIKo0w":{"text":"This has become one of my favorite neighborhood restaurants.  The food is so fresh and del","useful":1,"cool":0},"rSR1iYTIrzFtHGq5CJZMqA":{"text":"A few weeks ago, the hubs and I drove over to New Orleans for lunch. We didn't have a plac","useful":3,"cool":3},"aXCBAtjqu3JJGg_AKHwcgw":{"text":"GreAt breakfast at a good price! Good lunch specials too! Cash only which I always forget ","useful":0,"cool":0},"QPrRS--o8rZNzKJfpVzPSw":{"text":"My goodness! Speechless! The food was delicious! The pupusas are always out of this world.","useful":0,"cool":0},"IrH_XILFek93YUpDbpJl-w":{"text":"This place is no good. That's really all you need to know. Don't eat here unless, like one","useful":0,"cool":0},"N1AKaDrmU_uwf7IeX0cRNg":{"text":"If you haven't had a pupusa from this place you are missing out! The traditional pupusa pl","useful":0,"cool":0},"tkuveaTYz7spMVsW0w_T4A":{"text":"I was out with my two friends and noticed the menu said for parties 5 and up, a top would ","useful":0,"cool":0},"3CKkkC9gNwR_9XWQcFR7XA":{"text":"This was \"Tanner's Vegan Bliss\"  AND HOOOOO lemme tell ya   I'm Mexican and the pupusas an","useful":0,"cool":0},"ufANca5Yp-xK1_pN8GhL6A":{"text":"Me and my husband love this place! Been coming here on and off for about a year now! The p","useful":1,"cool":0},"qbRDAxVmqrI2GQAMOz1R4A":{"text":"**CASH ONLY** \n\n$2 pupusas Wednesday's!!! (However, after closely reading the fine print, ","useful":6,"cool":2},"vZUS2XBMZo7UlhwJIo2alw":{"text":"Manny is a great host, and so knowledgeable about the very fresh and local ingredients he ","useful":0,"cool":0},"rsMldUG4Kxy9ec251h8ZHA":{"text":"On our visit here, we ordered their delicious blackberry fruit juices.  My husband and I b","useful":1,"cool":0},"9I9jRC21mi6aKT5cduUByw":{"text":"Food and service is really good! Pupusas were delicious. Really enjoyed the chicken tamale","useful":0,"cool":0},"FUXpiMI8ZW8qVGhY4xmDHA":{"text":"They were very attentive and friendly. Food was great especially the shrimps. Loved the se","useful":0,"cool":0},"J-BQbpVjGba9o706M9N98w":{"text":"My first time eating Latin food, and I love it! Manny the owner is a ball of energy! He li","useful":0,"cool":0},"4rxmaVzRCvs3dD_YUKfcPw":{"text":"Pretty good if you ask me.\n\nFirst off, I love pupusas! Like a lot! We have passed by this ","useful":0,"cool":0},"zKcTWsRGIXkFRyNAHUGOWA":{"text":"Great little neighborhood spot. Menu has tons of variety and the food always tastes fresh ","useful":0,"cool":0},"F_w2-nth6S1Ofs0mQprP9w":{"text":"My good friend had been telling me about the pupas here for so long and I finally got the ","useful":1,"cool":0},"eIVLdugWfcwSSSJH4lYUEg":{"text":"Took them over an hour and still didn't have our food. No chips or offer to help. Won't go","useful":0,"cool":0},"MOmTb9K1Ec0SItV7tUgaCA":{"text":"A great restaurant! Salvadoran food might not be something you have tried before, but I as","useful":0,"cool":0},"XDiCjw7RjDxZWRb7Zsh5Eg":{"text":"This was such amazing food and the service was so great as well!  Everything tasted really","useful":0,"cool":0},"0FYBaOZIMnG3d_4IIQ8d7A":{"text":"Ordered at 630 pm and they said 35 minutes. At 8 (their closing time) the food still wasn'","useful":0,"cool":0},"kRIO9BQ7J4p1HNvL8f1eKA":{"text":"We had a blast.  The staff makes the whole experience fun.  The food is authentic and deli","useful":0,"cool":0},"rQvhgqMMetxGg9fNArpADg":{"text":"Wow , how have I not been here before? Been by it so many times but finally went in. I hav","useful":1,"cool":0},"zPULZ9L1JPESJ3PbMzJ8qQ":{"text":"Love this place! The owner Manny is a gem and the energy inside is vibrant yet cozy. The f","useful":0,"cool":0},"3Z7U88Nb3rvOt1hqSsBa3Q":{"text":"Admittedly, I went in here after the place of planned to pick up a few empanadas from was ","useful":3,"cool":2},"XAdUE8YEOjCurQoMbEI1fQ":{"text":"One of my favorite places, I always feel treated as a friend, not a customer here. \n\nCan't","useful":0,"cool":0},"T8ytxjbeqtJdEtkqLVLnAA":{"text":"I am giving a low score based on experience, not food.   I ordered the small ceviche and I","useful":1,"cool":0},"D7luYoEMaQUnGZmBbHbS7A":{"text":"I would give this place 0 stars. I'm not sure if the pandemic just destroyed this place, b","useful":0,"cool":0},"kOfvOhxkEUCncERVM3bWFg":{"text":"Holy moly. This place was truly awful.  It was absolutely filthy and the food was horrible","useful":0,"cool":0},"j6R8YNlp7if5aJe9Ej7gTg":{"text":"A little late but unforgettable. The food was incredible and the service was lovely. My fi","useful":0,"cool":0},"UGZkUIFj3JXWJUIklObS6g":{"text":"I recommend this place to anyone. The food was amazing and the staff was super friendly an","useful":0,"cool":0},"e3PKP_3ignA18VhV5nt9WQ":{"text":"Y'all need to come try the food is so delicious\nGreat service. Love La\nMacarena Pupuseria","useful":0,"cool":0},"VQU9tPpMizrnxGGw9zbiMA":{"text":"La Macarena has gourmet, delicious food! The customer service is great! The environment is","useful":0,"cool":0},"-bKNxAysURqnKA-jnNpKeA":{"text":"Really great food food, corn tamale was perfectly sweet and portions were well sized. Many","useful":0,"cool":0},"UHPuuzDnl4LDopPufynq6g":{"text":"WORTH THE WAIT!! They were a little short staffed when we visited this cozy little restaur","useful":0,"cool":0},"GEg5F5GVNU4hnVplkfxuRQ":{"text":"I know the papusas are all the rave over here, but I gotta tell you, everything I had was ","useful":0,"cool":0},"9skOxvSZFN4vtwNxU92r5A":{"text":"I was in the mood for pupasas and was in the neighborhood and never tried La Macarena so d","useful":0,"cool":0},"ntEcwdSRTvO0-f3ZvO_9zA":{"text":"My first time here. The food was delicious. We started with the Tostaditas de frijoles y a","useful":0,"cool":0},"U0Oe5pPP2U8FyhY2T5rfgQ":{"text":"Any time I'm feeling not so great, and I think about something equally comforting and heal","useful":2,"cool":1},"0BlqAgsheAIhJ4sxjKcGUw":{"text":"We got one plate of classic pupusas, one of shrimp/red pepper, and one of bean& cheese pup","useful":0,"cool":0},"mgz9RnEIqV69EDimmi71Ow":{"text":"Today was my first time ordering La Macarena and I have to say I was totally disappointed.","useful":0,"cool":0},"A9-LQjr55qb78NPkOXpsQw":{"text":"Delicious food! Friends had told us about this cute little restaurant and we were so glad ","useful":0,"cool":0},"pQIx5qmNqPOHNnehLPTuYQ":{"text":"Magnificent meal with gracious and welcoming service.  Large lunch for three that included","useful":0,"cool":0},"uZLHe3bJOuuEhtmGO7eL-w":{"text":"customer service was lovely as i waiter for my food, as i got my food it was hot fresh and","useful":0,"cool":0},"ylo2mLpoi8WfCqLuVgOdQw":{"text":"We all know that the out of the way places and the hole in the wall places have the best f","useful":0,"cool":0},"I7E9waK5VecOXYmpK80gog":{"text":"The food was fresh and tasty. The slaw was just the right amount of tangy. Their salsa was","useful":1,"cool":1},"ZfWkKOsuHF5Yh_FZ8eb-cw":{"text":"Great lunch spot off Carrollton!\nI came here with a friend for lunch and we were seated im","useful":1,"cool":1},"f8L9il5iRJNqaaDmHlmdgA":{"text":"I keep coming back here and trying more food, and it's all just fantastic. They're primari","useful":3,"cool":3},"xHpqpxDNCrm9SrQoCTp31g":{"text":"Delicious pupusas and Latin cuisine. It's a casual spot with both indoor and outdoor seati","useful":1,"cool":2},"vikWah9Tlu6GcRDLsETUhg":{"text":"A great place that is often overlooked for larger more established Latin restaurants. BUT,","useful":5,"cool":5},"wHv0WmC8KGYg6tTlws3UXQ":{"text":"Absolutely amazing experience and food! Can't wait to return! Found it on a quick Google s","useful":0,"cool":0},"ihVXEgf5fEG4226I5ZDV2w":{"text":"AMAZING! The owner, Manny, is soooooo friendly and kind! The food, however, STEALS THE SHO","useful":0,"cool":0},"r30aaHc15s_-j-Q3y8tkzw":{"text":"We were very excited coming here after reading the Yelp reviews and seeing all the photos.","useful":0,"cool":0},"p7P-zodprpwnafDmfMoHFw":{"text":"Our new favorite spot. The food is so fresh and authentic. Absolutely delicious! Service w","useful":0,"cool":0},"dGrB0X5R6_1wHDqZjeroyQ":{"text":"Food is so authentic and delicious. Service is unbeatable. Everything is so fresh and deli","useful":0,"cool":0},"hwkA1loUu_wZUjjPYE9PGQ":{"text":"I live down the street and this is my local go-to favorite, by far one of my favorite rest","useful":0,"cool":0},"M-P-rZEz4G9xl2-_OWL_Ug":{"text":"We visited The New Orleans Zoo on 3\\17\\21, St. Patrick's Day. We stumbled upon La Macarena","useful":0,"cool":0},"mTSOTU4eSlXz1eLvtDvHdg":{"text":"Such an unfortunate disappointment. Our first time in there and it's going to be our last.","useful":2,"cool":0},"O_Nh6OKZHopAjC-7dDmQkQ":{"text":"The food is amazing. My wife and I are vegan and they have a huge selection of items for u","useful":1,"cool":0},"lLhzEFqRAuX8-Y4JY7ItMg":{"text":"The service and the food were amazing wish I had more stomachs so could try more of this d","useful":0,"cool":0},"KUrur7AD63dlQwBLoUw4Fw":{"text":"Fantastic, authentic food in a relaxed, friendly spot.","useful":0,"cool":0},"-erpu6zVEtUMPKOBwIAczw":{"text":"Delicious, fresh and authentic food with wonderful service! The pupusas are amazing. One o","useful":0,"cool":0}}