{"yNK5n0KlEA000FiplF0jtQ":{"text":"I love this theater but it isn't a good value. \n\nPros:\nNo kids\nAssigned comfy seating \nSea","useful":1,"cool":0},"CJ667KRohSSkhCGGRiD9cA":{"text":"For New Orleans this is a really fun and comfortable movie theater. First run films, nice ","useful":1,"cool":1},"l6TiyENihI6T0mRo79j3AQ":{"text":"First off, living & working in the French Quarter leaves me limited to my movie choices.  ","useful":1,"cool":0},"8KL5v_qT8plol9r-2Z8IvA":{"text":"I used to enjoy Canal Place, despite the extra expense and the hassle of paying for parkin","useful":3,"cool":0},"qZZsZol2c8iplDAf8Oj0iw":{"text":"I have been to other dine-in theaters and this one is very very nice. Waiting in the bar w","useful":1,"cool":0},"OsGZrs2PdtWqgd_VZ2yWDw":{"text":"My partner and I have seen films here twice. Once we had dinner (the lamb chops were great","useful":0,"cool":0},"1gYnIXIOLZqrTr3vs_itfw":{"text":"When I originally visited this theatre back in 2015 maybe? It was awesome! Attendants woul","useful":0,"cool":0},"prkHPjCenWe4ExwcKS091Q":{"text":"The theater itself is fine - tickets slightly pricier than elsewhere, seats not as posh as","useful":0,"cool":0},"reqjzuN1gjJtE-n19w7Mpg":{"text":"This was my first time at a dine-in theatre and it was great. The recliner-like seats are ","useful":0,"cool":0},"Udc8yseiq8gi4XOx5wiBXw":{"text":"A tad too fancy for movies.  If you're trying to impress someone then go for it.  Movie ti","useful":0,"cool":0},"XnzPhX43OvgkM72UHR7l8w":{"text":"It such a shame that I have to write this review. My wife and I went to see Guardians of t","useful":1,"cool":0},"U1Uf8FDsUBROC2UCADEStA":{"text":"Have a bloody mary at the bar! Excellent! This theatre is great.  Food and drinks served a","useful":0,"cool":0},"lfnc_y-NvZdILf08OQmvNA":{"text":"Just because it is the only 'alternative' movie venue in New Orleans doesn't mean I have t","useful":2,"cool":0},"hi2cERXHfbwZ2XO1wA7URA":{"text":"What was once a cool experience is now crappy. I wasn't expecting a five star experience, ","useful":0,"cool":0},"Ots75k2kJZnaRizuS9J8mQ":{"text":"Was looking for an activity to do on a day when I was \"feelin the libations\" from the nigh","useful":2,"cool":0},"DcKdFX0NY9f4keLqgqOa1A":{"text":"If I want to have a girls' day/night out and enjoy a movie while having good quality food,","useful":1,"cool":1},"6H1ZzDOhX2Uodx-6aUMZLg":{"text":"Canal Place is a good, small, cozy, clean theatre with validated parking, four screens, an","useful":0,"cool":0},"f3Hq_hOA9P7IwXtYflz4Gw":{"text":"TERRIBLE experience. First off, we get there 30 minutes early like they request, only to f","useful":1,"cool":0},"Cq_7Xi1zrAhWOwM1AG_keg":{"text":"Sat down on the front row 10 minutes before the movie started and noticed small feet movin","useful":1,"cool":0},"Q5_LBvsywnJB_jL4NRMVeA":{"text":"Went watch Patriots Day two days after opening. Only had 8 people in the show which made f","useful":0,"cool":0},"-vNaAQlAQwUDXTiPWBMz0Q":{"text":"Quite simply one the best movie theatres in the country. Big comfy seats, think about thos","useful":0,"cool":1},"tXLKvB6qHqpx0eG5MXo8_A":{"text":"The pros - assigned seating, comfortable seats, food and drinks during the pre-show and pr","useful":2,"cool":0},"LtOJNEvVLhzupVagY1KcSA":{"text":"This place really let me and my family down. I bought tickets to a show picked out the sea","useful":0,"cool":0},"yA76RE8HY0wYgKWxP3zFCw":{"text":"Closest theater to us, but the fact that the ticket prices are, on average, 35% higher tha","useful":0,"cool":0},"8HbUqA_xE2Fnv_BM1dOV1Q":{"text":"Pests can contaminate food and spread disease through their droppings, urine, fur and sali","useful":0,"cool":0},"kvoENTLsIERGaguAAeKxYA":{"text":"This is probably the worst and most expensive movie experience in the area.  The seats are","useful":7,"cool":3},"3jq7gF9BliBu53-woZ5s0A":{"text":"This place is horrible.  They let us purchase movie tickets for our children then when we ","useful":0,"cool":0},"cmmYY7C-WpqHtlAAWTTnvQ":{"text":"Was headed to see Django Unchained and boom they cancelled the show I was going to without","useful":5,"cool":0},"d-OdxT7uviu0uVpA48dB9g":{"text":"I liked the service When getting my tickets as well as ordering my food. The waiter was ni","useful":0,"cool":0},"eSTd2n331TQuEBxfbC-S7w":{"text":"All I can say about this place is, give me a break! As a Quarter resident, I always apprec","useful":0,"cool":0},"kAo1MeQuD2JWFFDQF9w7Ew":{"text":"Great place, pricing is good for what you get.... I got the Abita bucket 4 for $15. The on","useful":0,"cool":0},"C_W7KjoeWTMP6xUODGv0cg":{"text":"Wow! I'm embarrassed to be in this theatre. I remember when it first opened and it was THE","useful":0,"cool":0},"t16Tv3lTIoznUeC8ofMbgA":{"text":"this place doesn't really have a rival in the \"table-service-of-duck-breast-salad-and-cock","useful":3,"cool":1},"QX_8sfN6QIwhJDCmzQqSMg":{"text":"Great food and great booze here, and the best thing of all: no one under 18 is allowed. I ","useful":1,"cool":1},"MFzTzda7bXGPie9qYVROdQ":{"text":"Very upscale movie-going experience.  I wish more theaters served food and drinks INSIDE t","useful":0,"cool":0},"YVAjNcA0bKw7_Moup9trmw":{"text":"+ Fantastic, oversized seating.\n\n(-)Okay, overpriced food\n**17.5% gratuity included...they","useful":0,"cool":0},"HelCnwFZ1vIgCy2ZZAVjww":{"text":"Cool place to see a movie! Very interesting experience for me. I love the idea of dinner b","useful":2,"cool":2},"s76QfXtRDr_6lD_fqlS09w":{"text":"Love this theatre!  They have spoiled me from fully enjoying any other.  The big comfy sea","useful":2,"cool":0},"6X_dBEaX8upvQ036_6AQkg":{"text":"If I could give them negative 5 stars I would! I walked from my hotel about a mile and a h","useful":0,"cool":1},"cgCahPLzKViSfwz0-GzNKQ":{"text":"The bloom is off the rose for me. I think I was just enamoured with the idea of an kid-fre","useful":0,"cool":0},"A4AxUaPEvCFdSWjO_ZP6Mg":{"text":"Horrific customer experience.  After bringing our under 18 kids here for YEARS....I went t","useful":0,"cool":0},"9VLUGMxe9PIzrpv5eBhL7w":{"text":"Alvin, Simone, Theodore....and a rat in the movie theater...I usually don't complain about","useful":0,"cool":0},"gBxPrpzaidslSCzFSJpd9w":{"text":"Very good customer service and a great place to see a movie and have dinner with a glass o","useful":0,"cool":0},"U_M5cOZoIhznOEjMR3Q5yw":{"text":"Yoooo why did nobody tell me about the cookie that they serve with the ice cream?! Who mak","useful":2,"cool":2},"faKKIqLEMPu5F8m73rzG4Q":{"text":"Worst food in New Orleans. Ever. Everything is overpriced and tastes like cardboard. The s","useful":0,"cool":0},"wYg2hrTu8uKO59oD5GEjBQ":{"text":"I've been trying to get them on the phone for two days to ask a question about a showing. ","useful":0,"cool":0},"s1HybfJGPj6CoHlWqNUWuw":{"text":"The evening started by my husband and I arriving and their computer didn't have our ticket","useful":2,"cool":0},"ERixV9oEixx-e00Xe7YYhQ":{"text":"\"The Theatres'\" movie ticket cost isn't much more than AMC.\nReserve seating is offered whe","useful":2,"cool":1},"F-_wxcug4yCrW4paFiG_4Q":{"text":"I've heard the complaints: too expensive, waitpersons a distracting presence, and they sho","useful":0,"cool":0},"o61dh1JkQydV9aCT1n3Ceg":{"text":"I consider myself an avid movie fan and I go to the theater about once a month or so but i","useful":1,"cool":0},"DAWL-2U9QUlYU4a0R2quGg":{"text":"Now this place is class and with some class you're gonna have to pay out the ass. Can you ","useful":3,"cool":2},"_TW7W9HS_HldpOu-NlbzXg":{"text":"It's cute! Very adult and intimate. Great for a date night. I got a prusciutto pannini and","useful":0,"cool":0},"DGz9vnS9MjLuFYsACvbMiA":{"text":"Plush red chairs.  Excellent service.  Pre-assigned seats.  This is the way to go as far a","useful":1,"cool":0},"49nKvGMXmdhZPWEodxeobQ":{"text":"Why have a late show (10pm)if none of the employees want to work? Terrible service and the","useful":0,"cool":0},"9xajYzoJuxUKRyq3c1ZM3Q":{"text":"WATCH OUT FOR THIS THEATER .....  The other day when I went I spent close to $100. dollars","useful":2,"cool":0},"Sxk7xnhnFpV7g1B3NyVEGw":{"text":"This is probably the worst and most expensive movie experience in the area. The seats are ","useful":4,"cool":2},"TlOpnluIDb3Txgdf-7TmgQ":{"text":"If you want to take a date to dinner and a movie - go here.\n\n1. You get to pick your own s","useful":2,"cool":1},"_rOAjvzmXNJqgNg0Mnhi9A":{"text":"Highlights:  Adults-only, delicious gourmet popcorn, Cherry Coke, Chewy Sweettarts, great ","useful":0,"cool":0},"aU5CnhFR2HQqLdvQiykDJg":{"text":"It's awkward to be standing in front of Sbarro's and then ordering your ticket for the ind","useful":0,"cool":0},"EzY7P_dkxOEVINlUXt2xNQ":{"text":"You can order food and drinks that they bring to your seat. Awesome!\n\nSomewhat expensive t","useful":0,"cool":0},"jKml8wSbaiBFbYDh4RLXgA":{"text":"I purchased 3 tickets to see IT at 11:30 am with my teenage kids. When I purchased the tix","useful":0,"cool":0},"PU4ZrEuVLQ6Ztw-SdNDwEA":{"text":"I had been dying to check out The Theatres since they first announced the opening so many ","useful":3,"cool":1},"tcT5_kurVxQPmdNIRlHGYQ":{"text":"My favorite movie theater experience.  First, they have a full bar.  Second, no kids under","useful":0,"cool":0},"IOJ1utVO-15llLT5rieFRg":{"text":"I'm not a huge fan of movie theaters. I rather watch a movie in the comfort of my own home","useful":0,"cool":1},"iuv-3mKF2NzWS8haYXS4Hw":{"text":"Another review close to my home. I have been here many times also. Went to see The Girl wi","useful":1,"cool":1},"QC7dFFVZotgD37pBx3nDlA":{"text":"DO NOT GO TO THIS THEATER IF YOU HAVE CHILDREN UNDER 18!  This theater is a \"ADULT ONLY\" t","useful":1,"cool":0},"PxPRk21fdzWur27I9lxd2A":{"text":"It costs $14 for a ticket, but with that you get premium reserved seating, state-of-the-ar","useful":1,"cool":1},"lT5qgm2HcVVWBnWdnjcnOQ":{"text":"What a whole new experience in going to the movies. The food and drinks are excellent, the","useful":0,"cool":0},"ntQ16PlT3u5nBUahzGccfw":{"text":"The whole concept of ordering food while you watch a movie is great, however the food was ","useful":1,"cool":0},"U2KXFiyE5r1MKvStMWzWNQ":{"text":"It's a little pricey, but it is by far the best movie theater I've been to. Reclining leat","useful":2,"cool":1},"ZeXtG0Al0LMkn9Yg-WuaGQ":{"text":"Nice concept. Terribly operated. Not only are the movies incredibly overpriced, but so are","useful":1,"cool":0},"7UemU1bbVFQ5B4VHVgZDPg":{"text":"LOVE this place. The seats are big and plushy, they lean back just enough AND there is a w","useful":1,"cool":0},"n5VPWkKwQeCXo0a4fwLunQ":{"text":"RE-OPENED!\n\nSo New Orleans finally got a dine/movie theater AND it's gourmet! We are movin","useful":12,"cool":5},"0O2fZKUlV6Qhd07VqAVvdA":{"text":"The Theatres at Canal Place are really nice. No kids, check. They will bring booze to my s","useful":5,"cool":1},"2HcEu4ZFGqHR_gG-hXTr0A":{"text":"In the negative category:\n- The seating is comfy but overpriced. The food is okay, but ove","useful":0,"cool":1},"lW2rw7BA9APYPUPNoMvlNg":{"text":"This is the third time I've been here and not sure why I keep coming back. My wonderful wi","useful":0,"cool":0},"xfJsqIVUdevSLqrAwODE-Q":{"text":"This is a regal theater, so join their rewards program!\n\nThey have an extensive food and d","useful":2,"cool":0},"D7aGSaxvVsNf_a_kVNkvZg":{"text":"I'm not sure why the reviews of this place are so varied.  Perhaps it has something to do ","useful":2,"cool":0},"lsyh0BvCXqUrFhEmqyCJ3g":{"text":"My husband's favorite... a fun experience \nLast time unfortunately we had for the first ti","useful":0,"cool":0},"D_78J_hRMokcWCn66O4wAg":{"text":"Looking for a big screen cinema to watch Disney's new Jungle Book? Well, this is not the p","useful":3,"cool":1},"50iLIS2poMhauloTh8so2w":{"text":"This place does not update their phone info line. We drove 45 minutes from Mandeville to s","useful":0,"cool":0},"tXfbOVjp5kZerGvgLPtb-w":{"text":"Imagine this. Reserved seats, reasonable prices, menus, waitstaff, adults only, alcoholic ","useful":1,"cool":1},"3_lYK8mo-qrA4dw4Bt7D5Q":{"text":"Something is wrong when two parents cannot take their teenage daughter to see a PG-13 movi","useful":0,"cool":0},"O3DPOlw0o928vWBB9u23fQ":{"text":"I still like this place, with small viewing rooms with comfortable seating, a restaurant a","useful":0,"cool":0},"U47LVmOfkj24L5fzIQk1Uw":{"text":"This is not a great theater. The screens are not very large, the sound is marginal, and th","useful":0,"cool":0},"jhPVTSZYafvcz9-BKnr-sQ":{"text":"This theatre experience will ruin all other movie experiences for you!\n\nYou can purchase y","useful":1,"cool":0},"oSuwvehCOOfOrWvWKTKggQ":{"text":"I've been here twice.  My first experience was a good experience, but my second experience","useful":0,"cool":0},"7T_xSXP8ZR46LQI9ObCvHQ":{"text":"Great movie theatre- they even bring snacks to you.   The pricing was over the top.   Howe","useful":1,"cool":1},"C3BfCSzxX9mlkoRrRD3o5A":{"text":"Sketchy!!!  Looks like a 70's run down theater with wait staff dressed in dark grey prison","useful":0,"cool":0},"FiZwh1UU5C0fR5f4v1SFmg":{"text":"this is so far the best theater i have found in nola. yes its about 2 dollars more and the","useful":0,"cool":0},"Bussh7azn61AUEMocjHnoQ":{"text":"We went for a date night for the dinner and a movie and we had to ask several times for ou","useful":0,"cool":0},"8vSb6oY9CsjGKGQz6RIsxg":{"text":"Never experienced a theatre like this before I attended my vacation with my bff in New Orl","useful":0,"cool":0},"jEuxlwZbwBpez4BGODjs0A":{"text":"There aren't any notices about children under 18 not being admitted on Fandango and when w","useful":0,"cool":0},"IEtjTzeUflaOFzuKd-c7XA":{"text":"This theater definitely has its positive and negative sides. I love how the theater is adu","useful":0,"cool":0},"GinQs8i2Re53-YfFXx1HvQ":{"text":"This place is a joke.. A really really overpriced joke. The promise a luxury atmosphere bu","useful":0,"cool":0},"5Is7SM4oZDmGOdmOUrwzPg":{"text":"I am a frequent customer of this theater because I enjoy the ultimate experience of dining","useful":0,"cool":0},"gtYIaad-XZiVJaDg3j-yjQ":{"text":"Don't ask me what any of the food looked like. I couldn't see anything. I've never before ","useful":11,"cool":6},"gNWoDM67qSXklwNjtZw94w":{"text":"Do not see a movie in auditorium 1!!!! Old raggedy seats no recliner uncomfortable seats p","useful":0,"cool":0},"v1RjcCkOTRLRqaX733WkDw":{"text":"Just okay. Drink and food selection was meh and the service was slow. I ended up ordering ","useful":0,"cool":0},"8A-VkXlk0VRldkdUhN1d2Q":{"text":"I feel the need to write this review only in movie quotes so here is my experience for you","useful":0,"cool":0},"Iso3zQ6Gt1ltOm3SiHqCiA":{"text":"Be ware of parking: the open lot up front (p403) will cost you $15. The box office ONLY va","useful":0,"cool":0},"61ONpDd8ikMm9YvMLfCQ0w":{"text":"Three of us came here on a weekend night for an experience and it was a major let down. $2","useful":1,"cool":0},"FiVOM-mQfYx9Nn5mIMUkcA":{"text":"Actually saw 2 movies here while vacationing in NOLA! Haha. I liked it here. I like how yo","useful":1,"cool":0},"eKHvWS4Lkdgi0uUpFGYEng":{"text":"First time at a fancy theater where they serve food and alcohol. It's located in the mall.","useful":0,"cool":0},"-vIQNR_39ymcaDT9KO1HHA":{"text":"This is a good place to catch films that no other place in the metro area is showing. lots","useful":1,"cool":1},"0FTOruhVg4_URTtVjS4okQ":{"text":"--- LUXURY EXTENSION TO CANAL PLACE CINEMAS ---\n\nThe Canal Place Cinemas are where you see","useful":3,"cool":1},"c1mh-wjYpc6Q-kUa-Mw3HQ":{"text":"If you haven't seen a movie in this format--that is, individual chairs with food and bever","useful":0,"cool":0},"w_0Zic9fV8ycA_rejEXzKg":{"text":"Despite the price for food and drinks, which I partake in every now and then, it's worth i","useful":1,"cool":0},"0fhPx0B_2fJD9uufO8PF6w":{"text":"I'd been coming to Canal Place Cinema since it opened back when I was in HS, was heartbrok","useful":0,"cool":1},"rNIzw5CtFIvqLUmcuy_ocA":{"text":"Whenever I'm feeling rich, I like to see a movie at Canal Place. I also feel rich when I p","useful":3,"cool":0},"3HldSu1oK3yG847g9_r9ww":{"text":"Odd Experience: You must choose your seat from a chart that doesnt show the dif between ai","useful":1,"cool":0},"-Pb6wEfVlENkdW_a2oPmsQ":{"text":"Novio and I come here every so often when we want to feel rich, fancy, and waited on. The ","useful":1,"cool":1},"_9iqqVVZSH7jcm5DtuiiIg":{"text":"EXPENSIVE!!\n\nI wrote this review with the frugal consumer in mind. First off, hubby and I ","useful":2,"cool":1},"f5MQ4OKtyLiKI4ohxB82TQ":{"text":"Tiny screens, tiny sound, squeaky seats ( though comfortable), below average food and more","useful":0,"cool":0},"6C1-TSvVocVrd851hd99EQ":{"text":"So i write this as I've been waiting on a cheese platter for over an hour and there seems ","useful":0,"cool":0},"Hgb0SZbDgjxbWrzzW5VZXQ":{"text":"This was our second trip to this theater.  I know this concept very well because I worked ","useful":0,"cool":0},"4q8tu8H1fqVTK7ErPLNdeA":{"text":"This is a great location downtown in the French Quarter inside of Canal Place Mall. The th","useful":0,"cool":0},"rvTwTzEXgb3_9Z1FwmFcrA":{"text":"Ive been sneaking beer into movie theaters my whole life (well since I was 9, The Shaggy D","useful":1,"cool":0},"dhokuds2fUDqEtneryX6mw":{"text":"We have been to this type of theater on the essay coast. I liked the seating - very spacio","useful":0,"cool":1},"KOho4cI5q2_TZVmYPg0q_g":{"text":"Cozy theater with very comfortable chairs, assigned seating and the ability to order food ","useful":0,"cool":0},"7ifWsTgWKGzWmQYjXnKdBg":{"text":"Very nice place for 21 years old and above. The food is fantastic and a very large variety","useful":1,"cool":0},"FuawdAoCbb1o5xHY6bDYqw":{"text":"If a movie is playing til midnight. The kitchen should remain open til 11:30 at least. No ","useful":0,"cool":0},"5IIWoXfyRP-7Be3dMtG9fQ":{"text":"i like how this joint makes me feel like a fancy pants EVEN when i am wearing shorts.","useful":1,"cool":0},"67_ncmiyKDLu2QjU8JRX0w":{"text":"When you attend a movie screening at the Canal Place Theaters, get ready for a first-class","useful":4,"cool":2},"amJGxPBhr1m06VK4NzjwBA":{"text":"Loved the atmosphere! The reclining seats were very comfortable, however the food was subp","useful":0,"cool":0},"_Wu7r7DlV4050yT1oA6X4w":{"text":"The worst service I've ever had. It was so bad I thought someone was playing a joke on me.","useful":0,"cool":0},"1idhPNEuzdB1oUv1bRJsSA":{"text":"This is hands down my favorite theatre for movie watching. Yes, it's pricier than the othe","useful":0,"cool":0},"wMenDQdm1xqkAxkWLJPs-A":{"text":"As a teacher, I love the fact that this place is 18 and older. I like being able to see a ","useful":2,"cool":2},"KgG1xldmXwOdjylCUS-7ug":{"text":"Last night, my friend and I came here to see \"Girls Trip\" again. The theater was clean wit","useful":0,"cool":0},"9B-bYayebAegQ2I9LPF8UQ":{"text":"On a super hot day we were glad to hang out inside somewhere with air conditioning. The se","useful":0,"cool":0},"P2poxFJXUfoAg-XVWmR05g":{"text":"First time going and it is definitely a good change from the normal movie theater.  Get th","useful":2,"cool":1},"DyFbLgbH26P0xU-rbTHOAA":{"text":"Grossly overpriced. \nSo, I just moved back to New Orleans from Los Angeles and decided to ","useful":1,"cool":0},"85sQx4jsrjanUUXcuk3S3A":{"text":"Wonderful experience feels like you at home no noise no kids no phones reclining seats wit","useful":0,"cool":0},"B7z3xJG12174dqNvuI-MdQ":{"text":"Having just moved to NOLA two weeks ago I've set out to find some new favorite stomping gr","useful":1,"cool":0},"wXhk501E_HdI2jZW1p_39g":{"text":"Don't agree with all the hype. It's a nice place and all and I can see how some will go no","useful":5,"cool":1},"mNVIehuu9syMqNftMEhgNw":{"text":"I decided to give this theater TWO more chances because I really hate driving out to the s","useful":7,"cool":1},"CU7YB2LaE1piwCo8iGr1yA":{"text":"Bartenders more interested in trying the new wines they got in than paying attention to th","useful":1,"cool":0},"ffUovhSmndjJ6SDfymtx_w":{"text":"My first theater experience where there serve food and drinks while you enjoy the movie. I","useful":0,"cool":0},"NK18Zz2ojzr6TqUUOW1c3w":{"text":"This is the only place in town to see a movie! Why? Reserved seats you buy before you arri","useful":1,"cool":0},"7DBW77La6YmjGXQtHbKO9A":{"text":"The Theatres at Anal Place.  Incisively witty, I know.  I'm consolidating three visits int","useful":7,"cool":5},"Qz1z538LK9NrYLAEt_ingw":{"text":"It used to be a \"special treat\" to see a movie here. It has become my default option. I on","useful":1,"cool":0},"rZZ2E_Tx9890nrKAGgi-XQ":{"text":"Excellent bar and bartender, pretty decent food, and comfortable seats. Tickets and especi","useful":0,"cool":0},"UaWQos8I-NO5WBoEUi0mCQ":{"text":"The service was very good.  I'll start this rant by saying they were pleasant and polite a","useful":2,"cool":0},"o78L3Vu-N7ZIunR2Ofkcpg":{"text":"Disappointing. It's a bit sad that this is the only downtown theater -- downtown is where ","useful":5,"cool":1},"y2L2EJvJ-HM--BqokU7NMA":{"text":"I hadn't been at this theatre since I last visited New Orleans in 2014.  The food experien","useful":2,"cool":0},"Im-dkoCsMkAdS6-vz3zhEQ":{"text":"Save your money and go to AMC. Nice theater but very overrated and overpriced. The food is","useful":1,"cool":0},"9MLrLjvx6_l1hStEvaIjsA":{"text":"It's a Monday thing!  #TheAccountant #NOLA~ then MNF ~ and its the Streets of New Orleans","useful":0,"cool":0},"T6XEaV6Iu2ljaD6RHKaZ3A":{"text":"When I'm looking for the luxury movie experience with good food and drinks, comfortable se","useful":0,"cool":0},"jNU6IquXGxRzHFsYxirdwA":{"text":"Terrible experience seeing Stars Wars: The Force Awakens.  Waiters and waitresses were wal","useful":0,"cool":0},"3PlPq-H646_p7-Tjg8cvjA":{"text":"Unique place to watch movies, but the gimmick can get old. The theatre is known for having","useful":3,"cool":2},"FpFqOGjrkR_AzpgNNlcs_g":{"text":"$16 for a movie and don't bother if you want to bring your kid.  No, thanks.","useful":1,"cool":0},"c1um0u60mgNkCy3tod5Txw":{"text":"Great ambience for a movie experience and an experience is exactly what it is. Ok menu, ni","useful":0,"cool":0},"euLCWwB1Nv9KWRjuP4na1A":{"text":"The Theatres at Canal Place is my favourite cinema!!!! It is also a restaurant within so m","useful":0,"cool":0},"AwcuHrc0SSGxtXOfJzlSvQ":{"text":"Great selection of independent and major release movies. Food is good, but having waiters ","useful":0,"cool":0},"AUzjIAWwFDIY0GTFTbCsrw":{"text":"By far the most expensive movie theatre in town. If posh seats, tableside service, and sma","useful":0,"cool":0},"kTiajQRDGxQCtWHjaVwyPA":{"text":"If I could give 3.5 stars I would.\n\nI love, adore, am incredibly excited and thrilled abou","useful":0,"cool":0},"tgyQAtEUZkfHgJ-y_clygQ":{"text":"Great place to catch a movie. The food is delish and great drinks. Very comfortable seatin","useful":2,"cool":2},"XvFcQkB8sXAgNrkQkv0XJQ":{"text":"We recently viewed brick mansions at canal place! Once you visit this theatre, elmwood wil","useful":3,"cool":1},"eTlQvZkMYvDe15B8Vh7c9g":{"text":"Theaters are small, cozy, with comfortable seating and who doesn't like a glass of wine wi","useful":0,"cool":0},"soq5G3--26fn2YFxelTEtg":{"text":"The Theaters At Canal Place is an awesome movie venue which is connected to \"Gusto\" a full","useful":0,"cool":0},"uRcX0bOjlT6mfJg_X4VZVQ":{"text":"Yeah, it's expensive, but I found it hard to go to another theater after visiting. And rea","useful":5,"cool":2},"kRhSP9n2xLv_7iNOS56fmg":{"text":"I go to this place often when i want to get away of the large crowd that comes with seeing","useful":0,"cool":0},"4xqF-pHOVNWj4B7vDYruPg":{"text":"Up on the 3rd floor or Canal Place shopping center. Great way to kill time from shopping a","useful":0,"cool":0},"a-33c4pgSIMM4dD4LwIQmw":{"text":"New seats fairly comfortable.   The downside of this new high end theater is the 'upgraded","useful":0,"cool":0},"lm3iiOeY0ByqmHlPWGuhmg":{"text":"Popcorn was old and stuck to my teeth (cost $9!). Screen size was actually quite small, an","useful":0,"cool":0},"7QH_e_MvoFXKnB3xmcRUCA":{"text":"IMAX experience is incredible.  Had a great time watching Star Wars in 3D.  Not really a b","useful":3,"cool":3},"syfAVJVdc7Icx8R-cXER4A":{"text":"I never write reviews of businesses but I felt compelled to write this after the insanely ","useful":1,"cool":0},"VGZnrDWS4fYk_4g96wULrw":{"text":"This place is in serious need of a facelift. The chairs were once nice but now the covers ","useful":0,"cool":0},"7wrw_IHXGddFjfOgD6rYNw":{"text":"Overpriced and rude. They do not advertise that kids under 18 are not allowed at all. Paid","useful":0,"cool":0},"gxvWMPGEMwSei1Y25JLJtw":{"text":"Went to this theater for the first time today. It was a nice little theater and no disturb","useful":0,"cool":0},"WMS6jg4X69B1nOgTbrvR2A":{"text":"I had a ME day on Saturday and one of my stops was to see the matinee of Eat Pray Love.  I","useful":1,"cool":0},"coXAkSkKFb8jJGmPZ0AaMQ":{"text":"Let me start out by saying that we have been to this theater several times and have never ","useful":1,"cool":0},"TLOk6f_unFN6RlvcDtAc0g":{"text":"If you're tired of hearing some tween chat on her phone to her friend frenemy, have the ba","useful":0,"cool":0},"kt-0UcX2wLFtBnT4FdfxEQ":{"text":"Eh, I think the interior of the theaters could use an upgrade. Seats were worn and squeaky","useful":0,"cool":0},"u7FAzrQKiG_xDwtgC_hUCw":{"text":"It's great that New Orleans has a \"luxury\" theatre experience, especially downtown so visi","useful":0,"cool":0},"gDrtQJ0i2jFITOaYctRJuA":{"text":"Great leather chairs (comfy)... The in-theatre meal service could be distracting and the l","useful":0,"cool":0},"CWV87ynUvJXHV1JFS0gNhw":{"text":"Top notch movie theater with fantastic prices. You just grab your ticket and head to your ","useful":0,"cool":0},"yxpRXT3xpIBwupWJY4UX-g":{"text":"After $300+ you can't afford to offer me free refills on popcorn that cost you 5cents.  Am","useful":0,"cool":0},"gVlBDlalR15w8AuKAyqB1Q":{"text":"The best bread pudding in New Orleans hands down! Sure it was overpriced, but it was good.","useful":0,"cool":0},"hIaVLKTPtrgwOIUbKmI-8Q":{"text":"If you want fancy movie experience this is it. This is where you go to watch a movie with ","useful":1,"cool":2},"J5jQr5Giym-7Uuz_0ZpQcA":{"text":"This cinema has comfy seats and isn't too pricey considering you get service to your seat ","useful":0,"cool":0},"2MvwrOMYK4WcPFTYI0L6GQ":{"text":"Canal Place will be closing for extensive renovations in about a month (October 2009).  Th","useful":4,"cool":0},"9XyNmNrg-DH53euQ8FmX5g":{"text":"I wish all movie theatres could be like this one.  The staff is so courteous, the theatres","useful":1,"cool":2},"tB29nP0_LIEnisJP6QOdcA":{"text":"What a great place to see a movie.  They even bring you complimentary cups of water if you","useful":5,"cool":2},"Cb9ay4_79ns2-BqyzIl9sA":{"text":"We go to Canal Place Theatres a lot! Unfortunately, the theatre is becoming ratty - the se","useful":0,"cool":0},"Ec0Ftoae-mWQcus23aEPiA":{"text":"Just about the only place in the city to see indie or local films. The staff is friendly, ","useful":1,"cool":1},"RXXeD6aqjV9ROsErGXWttQ":{"text":"I've been here a half a dozen times so far and there are some things that have improved an","useful":4,"cool":0},"fAUHD9Ut96A1IdoGVsg9OA":{"text":"Great theater located near the casino area and inside the shops. Food is served to you whi","useful":0,"cool":0},"GRbGaAqZLUM1EiIlhXDLUA":{"text":"I'm not exactly sure what it's considered good in NOLA but this theatre missed the mark bi","useful":0,"cool":0},"tHDCJeJeE-RrBLLYlwjzHQ":{"text":"Really disappointed in the way this theatre has gone down. Server almost dropped our food ","useful":0,"cool":0},"2vm8QPcAGXCimlafwVtt0A":{"text":"Saw \"Black Swan\" here tonight. Wonderful experience! A luxury movie experience, where you ","useful":0,"cool":0},"b08XGLcYWtP4U2TA6ZnFkw":{"text":"I really love coming to this theater!! The seats are huge, cushioned and leather; the serv","useful":2,"cool":1},"MVBzh6SIJJ4K7jNc3G_alQ":{"text":"I love this theater and the drinks. This is my second time visit in this place and I haven","useful":0,"cool":0},"3755XDAb4XCDfRhce4mHmg":{"text":"I can't believe that I forgot to do a review for this place. Its a great small theatre wit","useful":1,"cool":1},"ECiR1O9HAECHmoTwvXqpZQ":{"text":"My boyfriend and I frequent this location because we live in the Quarter. It is convenient","useful":0,"cool":0},"8V7xfJZMkRdsrcgKQzrqJw":{"text":"This place is awesome... especially if you're not a kid and are trying to see a movie! The","useful":2,"cool":0},"5cM3jXah_sfwPJBh4xwazw":{"text":"my favorite cinema in new orleans...even before the renovations.  small, clean, and comfor","useful":0,"cool":0},"qGNcbag5udFL-_Y5qUks9g":{"text":"One downside of theatres,\nis the number of kids.\nthat talk and text messages,\nThey won't l","useful":9,"cool":12},"iSgyHfEI2_M7x1VSntdg2Q":{"text":"This might be one of my favorite places to go after a long week of work but I can't believ","useful":0,"cool":0},"AeAyO8uxjvoRsb7EG0BYjw":{"text":"I've never had a theater experience like this one. On our first rainy night in NOLA with d","useful":1,"cool":0},"lNf54tM-I-7nOu99B3Ohcw":{"text":"I'm not sure what I dislike more -- that this is the only movie theater in the area that s","useful":0,"cool":0},"-r7kPRIkOcSGY_rqKjhTrg":{"text":"The movie started, there was only sound, they had to rewind it and took a while to turn of","useful":0,"cool":0},"wAhk_4_PIGnTntYRh4OtAg":{"text":"Fancy (and probably the only fancy) theater in New Orleans. Ticket price already reflects ","useful":0,"cool":0},"s0DJotNrWPrGxlWifoEM-w":{"text":"This place is in the \" mall\" on canal street.  Its on the 3rd floor next to the de bunked ","useful":0,"cool":0},"RyI5NnAOZ5Dvlj5ygaFpJQ":{"text":"The food is awful. I have had everything on the menu and the only thing that is decent is ","useful":0,"cool":0},"YM7yDXvMiWF-patKDTZQqA":{"text":"Movie tickets here go for $12. Which is on the pricier side, but not unheard of, especiall","useful":2,"cool":2},"vWMJVUOZrkKixectn3A5fg":{"text":"The only independent movie theater in NOLA.  It was definitely an afterthought when the bu","useful":1,"cool":0},"r4ZkYl7s3CxqXoa3rK7xPw":{"text":"Love this theater. I so wish they had something like this back home. It's a small theater ","useful":2,"cool":1},"izo0DN7kyBRGFTN9xUvCWQ":{"text":"I really want to be blown away by the luxury, service, and experience of these theaters, b","useful":3,"cool":0},"H4J3WKFhzla-ONo2FdwmHA":{"text":"This place... I don't know what to say. I've been probably about 15 times since it re-open","useful":0,"cool":0},"0zEmm7iT9B-CLg_Ybu9TOA":{"text":"I have always come here and for the first time very disappointed!! I wanted the ice cream ","useful":1,"cool":0},"opBWgeWLgK5_wwJPQQ0DPQ":{"text":"I used to like this place 5-stars worth, but it has aged.  The chairs are not as nice as t","useful":0,"cool":0},"2kfkiNrKvZ572-M511YWaQ":{"text":"This venue, formerly known as Canal Place Cinemas, is truly a fantastic addition to New Or","useful":2,"cool":1},"7HmmI6MAM2hzh7IIGZLeaw":{"text":"I wish I could give it 4 1/2 stars.  It's better than 4.  Yes, It's pricey, but it's total","useful":0,"cool":0},"BXijSMRmkgj7zfXl7cbebw":{"text":"I should have gone to AMC. The service was okay, but it does interfere with the movie beca","useful":0,"cool":0},"5LDQvIpqAMqthIKcmf4gMw":{"text":"Rude, inattentive staff. Expensive ($10 parking + 2 $12 tickets + 2 $5 sodas + $30 for sma","useful":1,"cool":0},"QwEnpSmifFL6pu5AWPlR4Q":{"text":"We frequent this movie theater and the service is always spot on. Well last night it seeme","useful":2,"cool":0},"FuloYgD1cI-pw6e6C6OL3A":{"text":"Five stars for the best upscale movie theater in New Orleans. \n\nA little pricey, but alway","useful":1,"cool":0},"nYdFS6kAko2256KXoNpTkg":{"text":"Ordered the margarita pizza, cost $13. The menu doesn't warn you but the crust isn't real ","useful":2,"cool":0},"CNm4tkhyC-cY3W40EbVzYA":{"text":"Good because it was right on canal at the edge of the French Quarter. It's located in a ri","useful":0,"cool":0},"b7wkd66z7BVSxb3a6f7oTg":{"text":"Mice in the movie theater was a first for me. I saw a bunch roaming around during the movi","useful":0,"cool":0},"jvi7v4uO3vtoN4N5BOb_QQ":{"text":"Overpriced. Yes, you can get wait service at your seat but their prices are ridiculous. $1","useful":1,"cool":0},"bvyW7CJU32LsOj4u1V6wfQ":{"text":"A little over priced, but very nice for date night. They don't have little bad ass kids th","useful":0,"cool":0},"iGuHxZfw308CyjH2CillOQ":{"text":"Expensive yet luxurious. If I have to spend $10 on a movie at the megaplex in the 'burbs, ","useful":1,"cool":1},"4FoM5l_EhRm4Y7eU8ncv0g":{"text":"Seats are comfortable and it is nice to enjoy a glass of wine and some food with a movie. ","useful":0,"cool":1},"hhU1IOKo1iC6AOJnmdEbVA":{"text":"I was greeted well and the staff was helpful!  My sister and I had some of the best sundae","useful":0,"cool":0},"BE3yjeQlAW_Gsl5iNtiBjw":{"text":"It was convenient for me since i was staying there in the building (Westin) on business.  ","useful":0,"cool":0},"QULHBIVlz72PvxzSS0Ibpg":{"text":"After hearing about this place from my sister I was dying to try it. I went last weekend t","useful":0,"cool":0},"-_-HovEN_QTp4KJKRi9AoQ":{"text":"Expect a unique movie experience.  Its advised to pre pay for your movie tickets online an","useful":1,"cool":0},"3aIB6GMsG9PWUcl-xoKnJA":{"text":"I've been to cinema pubs before, but never where you had the opportunity to reserve your s","useful":2,"cool":1},"sNwugp6zPyJNrIPV_-ZaKw":{"text":"A must for your fav movie night!  All Adult theater... No crying babies or rude interrupti","useful":1,"cool":0},"BDV9HkF6xXU3lFTZkJjF1w":{"text":"Convenient parking & truffle popcorn. What's not to love?\nIf I'm at Canal Place for a movi","useful":4,"cool":2},"qvH5HO9XjUzMaOKoQnkCkA":{"text":"Canal place theatre is wanna-be-fancy. They charge ridiculous amounts of money for a medio","useful":5,"cool":0},"-qtbt7ZQY0UmHKUjAaGyyw":{"text":"First off I love that kids are not allowed in here. I love going to the movies, but people","useful":0,"cool":0},"zuYQiO0WLibTSKVUVaCyYQ":{"text":"I love the seating, I love the roominess, hell, I even love the sound system, but again, $","useful":2,"cool":1},"iDhtsSDv44wWDn8kXWoxIg":{"text":"I really, really, really hope that this business model sweeps across the country.  As has ","useful":1,"cool":0},"CERdu01pl1cGUyjjJcIFPQ":{"text":"Very nice movie theatre. I love the concept of being able to order off a menu & have food ","useful":0,"cool":0},"CRySA6IZgF0pRb8gJEzSCQ":{"text":"Really used to love this place and used to recommend it to everyone, but it has really jus","useful":4,"cool":0},"5ktU6tkXlhdM3GYZWJaBhA":{"text":"The theater itself is just okay. It really needs updating with wider seats and recliners. ","useful":0,"cool":0},"mFp8HxmYuFblUXZn4469nA":{"text":"I love it.  I live nearby, so it's actually my neighborhood theater.\n\nSeats are spacious, ","useful":1,"cool":0},"GsQPbLtYW_9v7Xbzeg6fmw":{"text":"I love theaters like this, but I have been to so much better...\nThe seats are not very com","useful":2,"cool":0},"npJAaTiWrN1bsARrm9HvYw":{"text":"Just moved here from LA and am an avid movie-goer. I've even worked at a theater years ago","useful":0,"cool":0},"UjXO-_mCqbpGfTBrmL0h-g":{"text":"Very cool cinema - you can have table service and wine (some pretty good stuff!) along wit","useful":2,"cool":0},"lEsGOQs3_FM1A5zrSb2WHQ":{"text":"Canal Place is my go to theatre to see movies in the evening without kids in the audience.","useful":0,"cool":0},"KAUTzmsoi7bvl6EUGporHg":{"text":"On the rare occasion that I go to a cinema, this is one of the few places I can tolerate. ","useful":3,"cool":1},"9jHJqwBYzZT_vajqFw6hww":{"text":"Absolute garbage. I knew this was a \"dinner and drinks\" cinema, and I figured that would m","useful":0,"cool":0},"BdCqOndGjf-VKPG7F-FihQ":{"text":"They let my 12 year old in the first time and \nNot the second. Ha! But anyways. Crappy ups","useful":0,"cool":0},"h9m0ciN6PT9Kj8pBTcWoQQ":{"text":"Best place to watch a movie - hands down!  It's like being in your own living room but wit","useful":2,"cool":3},"cpggZmbRU7e3H3lTuhuKdw":{"text":"It's overpriced, but comfortable, and has good eats. I just wish that they'd bring down th","useful":1,"cool":0},"5PTFsTiYBnkV-frvqoqrxw":{"text":"Wasnt too bad, you can definitely tell by the clientele there that it's a high end establi","useful":0,"cool":0},"cOXbo3nwJC0qEHBSuEnQeA":{"text":"I must say, I've never had a $100 trip to the movies before this. Next time we'll go eat d","useful":1,"cool":0},"8e_ytMrQCViUCWYcN2kDZw":{"text":"Hopefully what happened tonight is a onetime freak occurrence, but it was not good. Not go","useful":2,"cool":0},"1BoNGb2QIFBpk2_wCG_qPg":{"text":"Not what it used to be. Since the development was sold a year ago, ticked prices dropped..","useful":2,"cool":0},"UAizXl89YOeQ5DxGmNqqiA":{"text":"The other movie venue in New Orleans! It's also their 'art house' cinema, although there's","useful":1,"cool":1},"oRiDpVzGZQWHGjDt80L8ng":{"text":"It's on the expensive side, but it's worth it to go for a special occasion. The food is al","useful":1,"cool":0},"aCJoMK72B9NX5Jy-XdhCLA":{"text":"Just like a home theatre but the service was horrible, it took over 30 minutes to get a re","useful":1,"cool":0},"y3H-KhxNEAIZNNVXkKR0QA":{"text":"I'm not a prolific movie-goer because I'm probably more of a home-body.  This may be becau","useful":1,"cool":2},"oGsp8CH2k5e5oHnE3w1y0g":{"text":"This place is a MUST on my list of things to do in NOLA.  One of my favorite things to do ","useful":5,"cool":1},"WvPNi2QH3Ll25IhJt12bsg":{"text":"The theater is very comfortable and the sound and picture quality is great, food and drink","useful":0,"cool":0},"0mQrJzNQsXxG2rjAhTDDyA":{"text":"The food and cocktails are DIVINE, I didn't mind splurging when i had duck salad and the b","useful":2,"cool":2},"4ug43XjoM5HctgBdmDUmag":{"text":"Pretentious venue with poor seating and staggeringly expensive prices.  \n\n\"Wanna see a mat","useful":1,"cool":0},"qkWFRYnEpLyZcqgyCAojwA":{"text":"We initially choose this theatre just because it was the closest to the ferry.  We had no ","useful":0,"cool":0},"fgJF4BOIoK3QCA47D7UVDw":{"text":"Very good experience at this cinema! I love the luxury! Will return.","useful":1,"cool":1},"ylHBI8u-YkZFPlEG8TUn-A":{"text":"The seating is phenomenal.  The chairs are comfortable and even recline!  The food is good","useful":0,"cool":0},"fFFNbiP9KLfMlVWyBc3f3w":{"text":"Great experience!  Saw Star Wars with my family.  Loved the comfortable and spacious seati","useful":0,"cool":1},"qiZTgjOZKSrxrDqknXod5g":{"text":"I'll still keep going here. it costs more, but the seating and smaller theaters are worth ","useful":0,"cool":0},"5fT8E582NXdTSX_DHBJPAw":{"text":"Me and my father go here every time ! The food could be better but trust me we don't go he","useful":0,"cool":0},"goggLKhWEdISpLR7dw1-mQ":{"text":"BIG FAN of the Theatres at Canal Place!\n\nAwesome pre-movie bar, check. \nAwesome bathrooms,","useful":0,"cool":0},"qEIXJOB_7AOvhAqjzt37BQ":{"text":"My kinda theater!! Bar + gourmet food/snacks with leather seats! This is the way to treat ","useful":0,"cool":0},"HIXhru3tRN0UY66xtXL60Q":{"text":"If you like movies, and are willing to spend $13 to sit in leather seats? and listen to pe","useful":2,"cool":1},"F4yXJw_2GIarTRziPbN-0g":{"text":"The worst place to see a movie. \n\n-theater stays notably lit during movies. the screens do","useful":0,"cool":0},"VHH9PH9ZWIYJzuePIWnabA":{"text":"Thank God no kids...can we have just a few places where it is for ADULTS ONLY!!!\nBEAUTIFUL","useful":2,"cool":2},"R4NygarN1Z22NGt-ajPY8Q":{"text":"This is a GREAT place to see a movie! We saw \"This Is The End\" and we laughed our asses of","useful":4,"cool":2},"sni24rN1hEoOcOqEZjgCgg":{"text":"Overpriced for what it is. 'Leather' seats were worn and squeaky!! Full service is distrac","useful":0,"cool":0},"wGs_ulVjLqDvlMAsrq-PvA":{"text":"Well.... \n\nYou can order drinks and food in the lounge area before your movie. The lady at","useful":0,"cool":0},"1l1udM6s9AxfPq1W_nsWzA":{"text":"I'm a huge fan of this unassuming gem in the middle of a city mall.\n\nSmall theater with to","useful":0,"cool":0},"-f9Q9MY2HA3sav1ovQa0jw":{"text":"Yes, it's expensive, but all movies are expensive, and this is some serious fancypants cin","useful":9,"cool":6},"AUnRr8b_qIchoFivH6dslQ":{"text":"I really enjoyed this theatre and wish I lived closer to it so I could go more often. I we","useful":1,"cool":1},"li4r1gd8SA6xHVn2zWwhjw":{"text":"I enjoyed my movie experience. I think its worth a few extra dollars for the more comforta","useful":0,"cool":0},"hfEB6lGlw82UBElyryx3JA":{"text":"Definitely not what I expected. This movie theatre need a major update. I was expecting th","useful":0,"cool":0},"7Tk86GB1MX8kh0GSy3o5wQ":{"text":"I consider coming here \"spoiling\" myself due to the price but it could be worse.\nCanal Pla","useful":3,"cool":2},"FQ6Zk7-JVMQPgGXFblsKtg":{"text":"My husband and I finally decided to give Canal Place another chance. It had been at least ","useful":2,"cool":0},"C2wh0B32ZoWeqC-_3tbA8w":{"text":"Went last night to watch Life of Pi and really loved it... Im used to Miami movie ticket p","useful":0,"cool":1},"PJ-Yt077GXQ-M-KzkKzwWw":{"text":"It's awesome that Canal Place shows some indie movies that don't play anywhere else in the","useful":0,"cool":0},"iZI4npHqj1DBtCs3CoL75A":{"text":"AVOID this place. Even if it's convenient, don't do it. You've. been. warned. \n\nI'm writin","useful":4,"cool":0},"hgScIRZd6qOdLmyW7fPxQg":{"text":"It really saddens me to have to come back and update my past reviews.\n\nPreviously I sang t","useful":4,"cool":0},"AGdowBtfXdZYYQL8oq-V3Q":{"text":"This used to be one of my favorite ways to spend a day off after working a hard week.  You","useful":1,"cool":0},"W5_5A6PfMq8QnUnmSZgwnw":{"text":"I kind of resented it when Canal Place became an upscale theater with waiters. Really? But","useful":1,"cool":0},"NkQwkatpdVDFLTnZZadO3w":{"text":"I love seeing movies here. So much so that I now don't like going anywhere else. The seats","useful":0,"cool":0},"-czsmL8voYuqdaruiKXKmw":{"text":"Love these theaters. Went to see Beast of the Southern Wild a few weeks ago. I was amazed.","useful":0,"cool":0},"IwtzFzsqxLt6USfmG4160w":{"text":"Totally went touristy for an afternoon to catch a movie here, and overall had a pretty goo","useful":1,"cool":0},"eUOAudVZHaZqjgzIIaj62w":{"text":"Very nice place, with great service. Was not sure how it worked but the staff was super fr","useful":1,"cool":0},"2sgDBl6tO_2iRPLq8OPljg":{"text":"The movie I saw was good but the theater needs to be updated. The upholstery on the seats ","useful":0,"cool":0},"IsnXZAK4Z9MbdLndU6ij0w":{"text":"My favorite place to watch a movie! Reserve seats online for the best spots. I love the fr","useful":1,"cool":0},"t3ryM8t3hKGXH0HrJfsWGw":{"text":"Canal Place doing dinner and a movie all fancy!\n\nMy theater experiences at Canal Place is ","useful":0,"cool":0},"VORHSyA4Cq3iHGRAlwb2cg":{"text":"I see a movie in the theater an average of twice a year. I used to go once a week. I blame","useful":17,"cool":11},"2YFeCMPhzuiRbjbz1dteKA":{"text":"Yeah. I am never coming here again. I should own up that this is not completely about the ","useful":1,"cool":0},"c_dpBHeFNmds3FQ92mHYUQ":{"text":"I hadn't been in a while and it became very obvious that the new owners have ran this once","useful":0,"cool":0},"jrA08zwLDTVPQmSeSyH_6w":{"text":"A little pricey, but worth it for the great experience. We arrived early for our movie so ","useful":0,"cool":0},"3fEzkPJrS4aJdv_52dfeSw":{"text":"The concept is nice but the execution needs improvement. If you go to the last show of the","useful":5,"cool":0},"FGSuAKMg9PJT52zeCvGJTA":{"text":"Just left the theater for the last time. Overpriced drinks, lackluster food, and very dist","useful":0,"cool":0},"X3K229RJm6PpDQnhYVvPSg":{"text":"$17 for a movie!?!?! This is LA. NOT L.A.\n\nFuck you.","useful":1,"cool":1},"e92fbB3qhkLXAlMgbNF5iw":{"text":"So, I just recently started coming here... 3 times in the last month. I saw \"The Adjustmen","useful":2,"cool":0},"jyS8oo3qurlEFrg7Ynmy-Q":{"text":"We were killing time in NOLA and decided to grab a movie at this theater. Purchased our ti","useful":1,"cool":0},"KDjfMnTD3kyXzDapE2DVXg":{"text":"This theater is very nice, but the real reason in gets the 4 stars is that it is one of th","useful":0,"cool":0},"zZS0uITGu1Znmo8oGY3bzQ":{"text":"I tried to get in touch with them via their online form. I never got a response, but someo","useful":0,"cool":0},"coSrDtg_zdv9QVRU3TPvOQ":{"text":"I love this theater. I've been to Canal Place multiple times and have always been happy. \n","useful":4,"cool":3},"Ai559JnuLaEQYHJOPG4PmA":{"text":"Last night my husband and I went to this theatre for our first time. The theatre is aesthe","useful":0,"cool":0},"Z8hQSsDqv1RsZJkHHvR6tw":{"text":"Used to be great. Under new management and the service and quality has gone waaaay down hi","useful":0,"cool":0},"yT7UKhiW7Nk2OPj-alU7EQ":{"text":"Pricey for sure but where else can you have a glass of wine and some truffle popcorn while","useful":1,"cool":0},"fE44PgOfopPZ0NKD_FoqHQ":{"text":"LOVE THIS THEATRE!!\n\nFor me, there is no other movie theater in New Orleans. Higher cost? ","useful":1,"cool":0},"P6Vhu9ucYI_cBuE0s5xfNw":{"text":"Pricey for mediocre food, but nice to experience if you've never been to dinner and movie ","useful":0,"cool":0},"g_RL0K1l3ulwdTS2fumCXA":{"text":"Wowwww again bought 2 specific seats drive 1 hour from bellechasee paid 25$ parking and al","useful":0,"cool":0},"lJZDZDPu6kDuMVgy4nSbLQ":{"text":"When The Theatres at Canal Place (hereafter referred to as TCP) opened several years ago, ","useful":0,"cool":0},"hf2TArDTeEnOZdA7H0Kl0A":{"text":"As a local I have been to The Theatre many times.  This time the tickets were taken at the","useful":0,"cool":0},"Ek6FAo5rL__xmsbT9t00_A":{"text":"Not much to do on Christmas Day so going to the movies was a natural choice even if it's o","useful":1,"cool":0},"aXeKz8vKoyqLQnIbQJFWoA":{"text":"Canal Place is unlike any other mall I have been to-mainly because it is basically a flea ","useful":3,"cool":1},"48eirPSXj6HgiqPkjL4aWw":{"text":"Have a bloody mary at the bar! Excellent!\n\nHunger Games! Reserved seating! So excited!\n\nAm","useful":1,"cool":1},"U3z2sb3OjQ1cMrAyRMsNQw":{"text":"What a perfect venue to see the bling ring. As I walked off the trolley and ascended to th","useful":1,"cool":0},"dDZNkT9lLr9GFhXnX16PLw":{"text":"Very disappointing.  Nasty & unhelpful staff.  Don't bother with the reserved seats until ","useful":0,"cool":0},"fASPFKfIweu2RLoNGzWBrw":{"text":"Placed very strangely in the Canal Place mall on the edge of the French Quarter, this thea","useful":0,"cool":1},"Od4xlu39E3fKdAu8PEAZgA":{"text":"This is my Friday afternoon secret happy place. I get off work every Friday at noon, and y","useful":1,"cool":1},"DUKSsVJB6vG5uI4YRqKhBA":{"text":"I love the premise of it and being able to drink at a movie. But you are basically paying ","useful":0,"cool":0},"OyDCOa8PTrk5OpzaSAIrJQ":{"text":"Positives: no minors allowed, comfortable seats, covered parking. Negatives: small screens","useful":0,"cool":0},"CbEEEatyW7tsEipsBhuYlQ":{"text":"Jan2018 - New Name Same Locale. This theater has taken on yet another owner & while the se","useful":16,"cool":11},"jmbZUWfVZTY8KPIcAd3jwg":{"text":"This theatre sounds like such a good idea!  A drink or a meal while you watch a movie.  O,","useful":2,"cool":0},"Hwm-X9OSFnuUDJtz7Jzf2Q":{"text":"This place has rats, and they're clearly not addressing the issue. The last time we went t","useful":1,"cool":0},"XcY0xxsMcxIXaAwHI_1xrA":{"text":"Reading through these reviews I see a lot of mixed feelings. In my own household, half of ","useful":2,"cool":0},"uJUAIUiUx1z6RvQ3q0x6LA":{"text":"As a local, I usually visit this theatre at least once a week. The last few times I've had","useful":1,"cool":0},"JsqUjNg2OoG9z1I8LBd3kw":{"text":"Overpriced. Horrible service!! If I'd known I'd be 14th through the movie before I receive","useful":0,"cool":0},"U4895oRkAI-5Gy8QTWSzVg":{"text":"Everyone here is extremely unfriendly.  The service is subpar and my experience was less t","useful":2,"cool":0},"QnkTgn3uizBpDBj8hVBmNg":{"text":"Really enjoyed this movie theater.  Had never been to one with food and drink service.  \n\n","useful":0,"cool":0},"XIQhvWjKgm0aeY3BEv-Cig":{"text":"This is one of those dine-in theaters where you get full wait service and the pleasure of ","useful":5,"cool":2},"qQhnbxVP0vH1Z1Oe95vKKQ":{"text":"This is a GREAT movie experience!  It was great having dinner and a movie all at the same ","useful":0,"cool":0},"QeJhkvNU6N2_yf9J6C8VSg":{"text":"Okay I literally just left Regal's Canal Place Theater. This is one of the only movie thea","useful":2,"cool":0},"M-dLK4UbUhNzbRdHWZ9_bA":{"text":"Ooooh, this place makes me really happy! Love that you can order your tickets online, and ","useful":3,"cool":2},"nZXQrr5KHP5LAfDuSxeyCg":{"text":"Great concept, but waited over an hour for a drink. Food is mediocre at best. Hoping they ","useful":1,"cool":0},"_WG6OrHUHuaFIZ6Dgqka9g":{"text":"I don't know if I'm not a fan because I want to enjoy a movie without someone running arou","useful":1,"cool":0},"DorruwFM1cDHX6qYEswnCQ":{"text":"The renovated Canal Place is a great addition to NOLA movie culture.  So far I've had no l","useful":0,"cool":0},"2s_D2rlflcp5qSXzQgXmcA":{"text":"Fortunately for the theatre we were there to see Black Panther so I was able to look past ","useful":0,"cool":0},"Pclnky-v3l5fcPSDqaDXyg":{"text":"Stopped by Cinebarre last night for a post workout !  They actually had a pretty good sele","useful":0,"cool":1},"sJWbRw4gL9vMb2_innOFmA":{"text":"I really like this theatre!! it's intimate, comfy, cozy & just plain cool!! I like that yo","useful":0,"cool":0},"VwyPyENJpR6I9naHvrZrfw":{"text":"Cinebarre ruined what once was a good movie experience. The seating is still good, but the","useful":1,"cool":0},"MfGBIYuOCbI-4KeksUjeXg":{"text":"Comfortable \"big chair\" seats with. Bar service that might be pricey but makes for a nice ","useful":1,"cool":1},"FUEuEQzkmU7bFiLlwMpghQ":{"text":"Look, this place ain't cheap. The tickets and the food are very expensive. BUT IT'S WORTH ","useful":0,"cool":0},"QPaxQHUxxBNjXiy4cCcvBA":{"text":"This high-end cinema is probably the premier film watching venue in New Orleans proper. I ","useful":4,"cool":2},"VHvcmTvp_njzNVGT5-Gw5A":{"text":"I love this theatre. It's plush & comfortable. The staff is friendly & helpful. Hello, you","useful":1,"cool":0},"PHqoulSE6Dt2-DOF9jrWxw":{"text":"There was literally a mouse crawling around the steps during Into the Spider-verse. This w","useful":1,"cool":0},"c5m4Y3hSdzgH-O11SdW4Ng":{"text":"Go to amc. Pay for the Dolby experience or at least to have a chair that is clean and comf","useful":1,"cool":0},"GnPNCCTINnLxDWtlczoHCw":{"text":"In general, I found this place to be a bit overpriced and overhyped - especially the food.","useful":0,"cool":0},"OynSwnZ8MjsFgNMVPFWX5g":{"text":"This used to be a very high class prim and proper place. With your own server with really ","useful":0,"cool":0},"d--i1zUbf3ZbhAJ3guW56Q":{"text":"I really want to like this place. But I'm done. Dropped thirty-some dollars last night to ","useful":7,"cool":2},"4rz8S8w_irqKARmVuSUAIg":{"text":"If you don't mind the pricy items, it's a good experience. \n\nNo kids + lots of leg room = ","useful":2,"cool":0},"9CRFif4OM2uH1YOJNq7quA":{"text":"18 or over to watch movies here so you don't get the crazy kids here.  Seating is by ticke","useful":0,"cool":0},"1ywGqg3wn6o8zXXeGbAE3g":{"text":"Went here recently for a movie. it was nice to be able to reserve your seat but be sure to","useful":0,"cool":0},"Fcg4YuOK7FZJVh9NOu0E0Q":{"text":"It's hard to write this one because for theaters in the FQ this is the only option for wal","useful":1,"cool":0},"XMvEvCd9QvF5hd7llF34Gw":{"text":"Terrible service! Idiotic support!  Run, quickly, to another theater!\n\nIt is Easter Sunday","useful":1,"cool":0},"huWlw4tdPuRIFsC9V2WbAQ":{"text":"Hands-down the best dining experience I've had since arriving in New Orleans!\n\nFor starter","useful":3,"cool":2},"mVESa2Vl10ZoOQdnRQbhVA":{"text":"My favourite theatres in New Orleans. Seating is reserved so when I purchase my ticket I c","useful":0,"cool":0},"MpXg7PKLf-wB99rBqTHhVw":{"text":"Saw the King's Speech there this past Sunday. This theatre is unique in many ways. All sea","useful":0,"cool":0},"17H54MU42dTW86fj4qp3qg":{"text":"Read the recent negative reviews and decided the comfy seats and Mary Poppins on Christmas","useful":0,"cool":0},"lweMoUqLimo-0T2DxHc71w":{"text":"This movie theatre is in Canal Place, which is a shopping mall. The mall is within walking","useful":1,"cool":0},"Af0edjHOWh0gloBVPVuNNA":{"text":"The tickets were way too expensive, for such a small theater and the screen was so tiny. T","useful":0,"cool":0},"giVSMgoJ0_MN0iqI6vk0gA":{"text":"My husband and I came to this theatre in 2015. We thoroughly enjoyed the atmosphere, the s","useful":0,"cool":0},"YUY6wwcS7k6sgZ2Mh4fO7A":{"text":"Do yourself a favor & see a movie anywhere but here. We decided to take our chances even a","useful":0,"cool":0},"5Kxtj9ajLFYdsOeoSDt9Nw":{"text":"Part 2 of my little adventure landed us in the Canal Place Theatre to watch Harry Potter's","useful":2,"cool":0},"uBSR9Z9LvPe8qQ8E3qKf7A":{"text":"The presentation was greats! We bought our tickets, was told we can get food and drinks to","useful":1,"cool":0},"cjG-CLNuAH8swuESd5r86A":{"text":"I'm with Joi on finding noisy theatre goers loathsome, and that is the basis of my 3-star ","useful":1,"cool":0},"0bl_k5_Yn4mleAGqlHd0pQ":{"text":"Think twice before venturing here. Very expensive despite tiny screens and also they have ","useful":0,"cool":0},"MDlv6dYJFZ_UrX_hKjZQbA":{"text":"Ever wonder if a cinema can ruin a good movie?  Yes. They certainly can. \n\nTried to see En","useful":1,"cool":0},"UY_t7Fb3v5ZT5Nansri21A":{"text":"The atmosphere is great.  We went to early movie planning to have light lunch while watchi","useful":0,"cool":0},"cR_kOBLQ3Yjd4Qc2yLvPIw":{"text":"I'd give a 3.5 rating if that were possible on here, but it's not and since I'm still feel","useful":1,"cool":1},"kX6NHYv6TFzuyBmQTgNp-A":{"text":"If you go to the movies to, well, watch a movie, this isn't the place for you.  Problem #1","useful":2,"cool":2},"UB3-rOdm_jfYwPOsQzOorw":{"text":"Love the adult atmosphere. The improvements are noticeable. But the bar needs a bit of ent","useful":0,"cool":0},"9KDXFnmBnvB4msYWta2zOQ":{"text":"Horrible!!!!\nService was awful\nWaiter claimed they were short handed but.... everyone else","useful":0,"cool":0},"6Q2A4N_RUKYBqEbAYL8RGQ":{"text":"Went to see Mary Poppins over the Christmas holiday. Unfortunately this theater is not wha","useful":0,"cool":0},"KMn9n2KXQdhNA6rfY4u-Pw":{"text":"I am saddened to hear that as of close of business today (Thursday 23rd May 2019) Regal wi","useful":0,"cool":0},"7DO28dFGQ-o3AAWRj8gobg":{"text":"This was the worst dine in movie experience I have ever had! \n\nThe theater is tiny and the","useful":2,"cool":0},"gCeJpEpFEd0ZjiNY_zDjsg":{"text":"I haven't been here since they changed the format and I was pleasantly surprised!\n\nThe sta","useful":0,"cool":0},"Bc0TWvTZp_YXBs-gKdFrZA":{"text":"Consider this review unfair and bias.\n\nI used to come here to this movie theater for many ","useful":0,"cool":0},"gUViwJFqoucl58EU9HpLJw":{"text":"Theater's fine, but don't order drinks. Ordered a beer and was accidentally charged $30. O","useful":0,"cool":0},"oS8wKwxfXnMrT1XsXzkLdQ":{"text":"I was in town for 4th of July vacation and wanted to watch The Incredibles II. There was n","useful":2,"cool":0},"3IzfhYu-Vy0fXUG8FdVukA":{"text":"Imagine a movie theatre, where the food didn't taste like cardboard, and smell like popcor","useful":3,"cool":2},"Adal7ZMQGVZLxnllSPExIg":{"text":"I wish they had gone to Austin when they were concepting this theater.\n\nWe went for Christ","useful":1,"cool":1},"N0aevaSLekbLWRV2Y9f_XA":{"text":"Menu is gross. They just changed it to a very unhealthy typical nola menu.  Manager Caleb ","useful":0,"cool":0},"xd6VcnYfDa0yUpOcxt-dyg":{"text":"Besides the fact that this place has decent popcorn, I've had the worst experience. I typi","useful":1,"cool":0},"58HsaR8zSszcvm65khO0Mg":{"text":"Used to be my favorite till they started putting motor oil on their popcorn instead of but","useful":0,"cool":0},"e8fa_HxKbujqmqV3irYvWw":{"text":"Hello, I had the opportunity to visit your theater again on last evening. I must say I was","useful":0,"cool":0},"BkzR3shp9ckmxPvPJvsmnw":{"text":"I am a local. I live and work in the quarter, and let me tell you, eat somewhere else befo","useful":0,"cool":0},"6utumVl3UCjUKMgUT-ywbA":{"text":"Just saw a pre-screening of Little(cute movie). The theater seating and restrooms were cle","useful":1,"cool":0},"0ALhk8NMw82SZchBw9_BcQ":{"text":"I had been to this theater once before when visiting the city to see Iron Man 3 and rememb","useful":1,"cool":0},"U4utWe9u9Gz5tI6Wxz0-Gg":{"text":"After living in Austin, Texas and enjoying The Alamo Drafthouse for YEARS, I was on a ques","useful":4,"cool":3},"QxQnzwlD04BVYTQVbvYkFQ":{"text":"Sadly this place is failing. Needs a major update. Seats torn.\nService. Slow at best. Food","useful":0,"cool":0},"ERJDH5xSHwkU5I-a_Ue1tg":{"text":"Very nice movie theater with lots of room and comfortable chairs.\n\nYou can order your tick","useful":1,"cool":0},"d6L5VuLSjdAZJ4b3lbTMwg":{"text":"Went again with a friend that had never been. She loved it! Last time it took a bit to get","useful":0,"cool":0},"vrsBd2EVmbpBCeyi_3Yg8w":{"text":"My husband and I went to see a movie during the week. Canal Place Theatre has been one of ","useful":0,"cool":0},"8J6ZiqBHtY6EXfIdyf6MvA":{"text":"HOW TO SAVE 84% AT THIS PRICEY THEATRE-ER:\n1. Go to a Matinee. \nIt's $10.50 on weekdays, a","useful":16,"cool":4},"d4uP1VJX8FVePlZ6AVE3Ng":{"text":"The leather chairs are very comfortable. I love to drink wine and watch movies! My friends","useful":1,"cool":0},"zg-L2vPbCBxdbSzE3PiLRg":{"text":"Do yourself a favor & see a movie anywhere but here. We decided to take our chances even a","useful":1,"cool":1},"rGtlbkXDLBF8WOc4OZ5i4A":{"text":"Hmm it works for me and since this was my first time here the lack of stars is due to serv","useful":1,"cool":0},"qM0m18Wc0h93HDo2sN2C1Q":{"text":"MAKE THOSE SERVERS SLITHER ON THEIR BELLIES!\nI've looked forward to seeing \"La La Land\" si","useful":9,"cool":6},"9RZxErIJb2noXbYJK02hjQ":{"text":"I'm a huge movie buff, and enjoy the feeling that I am at a private movie screening with m","useful":9,"cool":3},"9TT6ECSqbNLBGRZAAU6nxw":{"text":"I just had an abominable experience here. I got the inkling that the operation they were r","useful":9,"cool":1},"5nLsxdHkpd4P8COGHGEz1A":{"text":"Watching a movie here is my X-mas tradition and after several successful experiences, I wa","useful":1,"cool":0},"VUBM71P_AFDnlYSsYf2kQQ":{"text":"To even give this theater a one star is being far too generous. Worst movie theater I have","useful":0,"cool":0},"kT5vcKChTCKryvvVSOKY7A":{"text":"I adore this place. First plus, you pick your seat when you order the ticket. No rushing t","useful":5,"cool":4},"_MTKWcwj10Qxa-zoo62t4g":{"text":"Is there a bit of pretention mixed in with this first-run movie theater?\nYes.\nIs it a bit ","useful":11,"cool":9},"UbBLKFoki-XcjfwxKmE3YQ":{"text":"Canal Place doing dinner and a movie all fancy!\n\nMy theater experiences at Canal Place is ","useful":5,"cool":2},"vP2V9Z01z58VrQMibeGKmg":{"text":"Good place to go if you like a smaller more comfortable movie theater. Also a great plus i","useful":1,"cool":0},"tK8yOW8ZU8SCtSssc4FG7g":{"text":"Omg!! It looks so nice from inside but once you get in the red plastic seats are ripped up","useful":2,"cool":1},"6AWvtSx2NuaXwFh6iYFB0g":{"text":"The worst designed movie theater we have ever experienced.  Seating is cramped poorly elev","useful":0,"cool":0},"GY5YYpw30_G5gk9ZEo51hw":{"text":"I've been here four times now within the past few years and each time I find more negative","useful":3,"cool":0},"ThsKNoljeSJW2Pvv6Q1QjQ":{"text":"OK.\n\nPros:\n-Reserved seating.\n-Small, intimate theater.\n-Truffle oil in the popcorn.\n-Vali","useful":3,"cool":1},"6YDJfR7mb_IXsh8G6W7buw":{"text":"This to me seems like it  is a super upscale version on the old Movie Pitchers.   Its pret","useful":6,"cool":4},"QzcHSqWryXkoYBV118iNTA":{"text":"It's my favorite place to watch a movie. You don't have to deal with the large crowds that","useful":3,"cool":2},"UIOf46tWh0JqWZBM7Cr1PA":{"text":"I love this place. Love their film selection, love that you can drink wine during the movi","useful":0,"cool":0},"UIQB07V-VcVIqzNVA-egdA":{"text":"Great movie experiences here, time and time again! Get the truffle popcorn and a glass of ","useful":1,"cool":1},"uNOfn-_bRKQVcG3MpSjoWA":{"text":"BEST AVOIDED. I really loved this theater, but on my last visit the call buttons were not ","useful":4,"cool":0},"TuGwg7WeGyk3x8ZlwW3GwQ":{"text":"I am completely torn on this one. \n\nSure, it does have good food. I had the margherita piz","useful":1,"cool":1},"IOVjNDmd56NmwyKdsJ8naw":{"text":"This place has 3 things going for it. 1) it's the closest theater to me, 2) there are no k","useful":2,"cool":0},"Tp3ok0Hm5ySnlgPd5M4THw":{"text":"Theaters at Canal Place is a mixed bag for me.\n\nLet's start with the positives. I love the","useful":7,"cool":3},"TVj2ue69u-2tJLNdR8dnqg":{"text":"Very nice place. You can order food and drinks and waiter will delivers to your seat. Seat","useful":1,"cool":0},"JX-9_bD4NfEtUYAmhCRaNQ":{"text":"Since I have never been here, I thought I would give this place a try since it gives me th","useful":2,"cool":1},"FdFyjW4ZtPlSUcoWrzc0Wg":{"text":"Eh, it's all fancy and whatnot, but I still think it's kind of overrated.  The theaters th","useful":4,"cool":0},"urmKWsg8uq2QTdps_Pvlyg":{"text":"Really good idea executed poorly.\nThe theater seats are not tall enough that it chops off ","useful":3,"cool":1},"0f3p9ZhTptp1E2nLqzrPkg":{"text":"Whats wrong with a full service movie theater????  Uh Nothing!  Its freaking awesome!!!  T","useful":5,"cool":4},"k0Tgs_bZebGR-bYR57srgA":{"text":"We love this theater. It's my preferred place to go. Tickets are only a couple bucks more ","useful":1,"cool":1},"MOFTS4eHEtHiF_IDgbpulg":{"text":"The Good: The Staff were very eager to help and answer questions. It must pay well because","useful":2,"cool":1},"v1ri_-NC_qKwWGpj51rzjg":{"text":"i love this place. when i go to the movies, i want to be in a nice reclining chair, an opt","useful":1,"cool":1},"IaoTwsfzVzorFTM1-xbe0Q":{"text":"I was wondering what to rating I should give this place and I found no reason why they sho","useful":2,"cool":2}}