{"p3sLr6nWII0v-87pR-pgVg":{"text":"Bread, special bread basket & fried Soft shell crab spectacular!  Duck and scallops also g","useful":0,"cool":0},"LCQkzQeUYvJAv1u0tMiK1g":{"text":"The food was delicious and beautifully presented. The only reason why I'm giving 4 stars i","useful":0,"cool":0},"HmYzaaJ_chY0FTClkskxgQ":{"text":"We were called by the many exemplary reviews from Yelp, Frommer's, Trip Advisor and others","useful":1,"cool":0},"qwHS-UyzZgdhPiQRkkLgww":{"text":"We stopped here on our way to R'evolution to have a few small bites before dinner.  Great ","useful":0,"cool":0},"HfcYXKqITkDTOyh7A9RkjA":{"text":"I wish I could leave 4.5 stars! I'm going to leave 5 in hopes of bumping them up to 4.5!\n\n","useful":1,"cool":0},"09wPekIqQk5FFfTePLpKVg":{"text":"Had dinner with my lovely dinner pals and arrived early and they had no problem seating us","useful":0,"cool":0},"etzhW4TZT7RlURENULYjAA":{"text":"Went for lunch on a Friday. Service was kind and answered (a lot of complicated) questions","useful":0,"cool":0},"t7qoYJO5xIz7nrpANKJFpA":{"text":"We went for Friday lunch, one of our best meals in New Orleans.  We had the fried chicken ","useful":0,"cool":0},"L86Rs4QCG2BmrEPMPwj34A":{"text":"Terrible experience! After reading all the good reviewsI decided to have lunch here. Waitr","useful":2,"cool":0},"6Y11uqDZK0lsJSiUo9T0jg":{"text":"The service is outstanding. The food good, but not amazing. We had: scallops, gnocchi, and","useful":0,"cool":0},"O777NcaiBf8XV9J85gv58w":{"text":"It was all about the catfish dip, roasted cauliflower atop a dill yogurt spread and the fr","useful":0,"cool":0},"_GyoJPB3QDkT2bUhitxYfA":{"text":"My husband and I decided to drive over to NOLA from Baton Rouge for a date night.  It was ","useful":1,"cool":1},"JrpqxgbP1vFKzhtsqQOcaw":{"text":"This may be the best food we've ever eaten. The cauliflower vegetarian dish was perfect an","useful":0,"cool":0},"mbQGcAu52U18LU7BhrUlsw":{"text":"Dear God this place is amazing. Since my very brief time in New Orleans with my fiancé, it","useful":0,"cool":0},"hGcXwP_U0Vt7QgC1ffgY2w":{"text":"First of let me say that this is my favorite restaurant in New Orleans. I've eaten at all ","useful":0,"cool":0},"vy-6TqhCqDGR9qnVYZ33Ug":{"text":"My friend and I have decided to go out for Friday lunches every other week and due to repu","useful":6,"cool":4},"kVYWrt7NsrNwfxliNvjP3w":{"text":"Oh my gosh best food we have eaten in New Orleans. We went for brunch. The menu was creati","useful":0,"cool":0},"oheZZg8ISIXbiu0zQ6_pgg":{"text":"The service is outstanding. The food is delicious and interesting. Then, there are the coc","useful":0,"cool":0},"5uy-e26tyC_05snb7HHgSw":{"text":"Fantastic Food!  Service was very good although Maypop was slightly better!  One of the be","useful":0,"cool":0},"sIT2bmtv2Lxv12pxeJSG2A":{"text":"Amazing start to finish. The staff was courteous, attentive, but never annoying. We had a ","useful":0,"cool":1},"OnCjZCCqaAgTKgHLsOY19A":{"text":"Excellent all the way around!! The whole family said it was the best meal they had while i","useful":0,"cool":0},"AvMIz3V1UAexz8f91nHf3g":{"text":"The most innovative and food I've ever eaten. Delicious, too! Most impressive was a quail ","useful":0,"cool":0},"ruBEQeitKZ9dFbsgiaMrUA":{"text":"Yeah, we ran into this place on toasty day two years ago while walking around the garden d","useful":0,"cool":0},"qsUg2Xg-EBrcHLiRRfuu7g":{"text":"Simply wonderful! Ambiance was great, beautiful old building with nice details. Our server","useful":0,"cool":0},"jqvfwv9D4ECigwMnI1ApVw":{"text":"Absolutely one of the best meals I've had in a long time.  Flawless on every count.  Every","useful":0,"cool":0},"N3V9n6oSGCFBmDgIYySkpw":{"text":"I really wanted to love this place. It's a great neighborhood location, great staff, and s","useful":0,"cool":0},"hKdJGbM0oDGbzAUi40weXg":{"text":"I love to eat out but I also love to cook. Perhaps it's hubris, but I like to think I'm a ","useful":2,"cool":2},"YpCC3CtPTj5SIPGQ9xbRXQ":{"text":"We had lunch here, and it was fine. I had the baked oysters which were a bit bland, and th","useful":0,"cool":0},"JQ2LsiKhC9Iqpksnt1RfCg":{"text":"Ate alone on a business trip. I sat at the bar. The staff was very friendly. I had the ste","useful":0,"cool":0},"1jsc0Fc5HTyT9RMtQsUmdQ":{"text":"I love visiting New Orleans and finding new restaurants.  Coquette will definitely be on m","useful":1,"cool":0},"h_29nSBBN6g--mLu-HIBvQ":{"text":"Disappointing. There is so much hype about this place, that I came in expecting to love it","useful":5,"cool":0},"AHeskWnqCICV9ydnviYy5Q":{"text":"This is called a Yelp Review Update Number 3...\n\nSPECTACULAR.\n\nThe service is impeccable. ","useful":1,"cool":1},"GCncanNg571WSEQCkwU1DQ":{"text":"I've been to Coquette several times including yesterday for lunch. It's always been excell","useful":1,"cool":0},"Q8BQm-V5w2AUC785zbwYBg":{"text":"It was a fun experience dining here. The table we got had some glare from a streetlamp but","useful":0,"cool":0},"fA6QCdyP04SnWDueWvvgFg":{"text":"From the service, quality of ingredients, composition and ambience, this place is fantasti","useful":0,"cool":0},"p1PLNA3VbGHb-nYjdjtijg":{"text":"I think I'm in love! Brought visitors here for lunch and had one of the best meals we've a","useful":2,"cool":0},"TrY4xcuD2SYPZkyNhbG4kA":{"text":"we came across this place as we wandered around...decided to check it out just because it ","useful":0,"cool":0},"kAITaQCoO8G8TD4iHwOTeA":{"text":"On a trip to New Orleans, I had the good fortune of dining at Coquette twice - once for di","useful":0,"cool":0},"5cOOqMcGfOVuh9gKyTcotg":{"text":"Fantastic experience, attentive and knowledgable staff.  The paris brest dessert was yummy","useful":1,"cool":0},"oxyIEQ9px5ThbQeqbpLzFA":{"text":"This place was amazing. I had the chef's tasting menu and my husband had the duck breast. ","useful":0,"cool":0},"8BCroCio7A-jnnQ7N2MJig":{"text":"One of the best meals I've had in New Orleans. We tried the tasting menu, which was amazin","useful":0,"cool":0},"3Jgs2F7M3u9UfueDJszsog":{"text":"One of the best meals I've ever had.  You guys are absolutely amazing.  We came in with a ","useful":0,"cool":1},"m5BY91tsDNrTNcCaIILN2A":{"text":"Came here for lunch on my wife's 30th birthday. I made the reservation through Open Table ","useful":3,"cool":1},"qMfdoYU0HFQVK8HWvox2hw":{"text":"Everything is innovative and very well-executed.  Even if it sounds strange it will be sup","useful":0,"cool":0},"QapxzmTHc85bKXPXSipFCA":{"text":"Ok I'm writing a review on the wait list process and nothing else. We went on a Saturday a","useful":1,"cool":0},"12Ak6lg6VF464iH3Rgtnyg":{"text":"We were visiting from out of town and had made a brunch reservation because reviews looked","useful":0,"cool":0},"O2gS4S4rEWh8KwTPYWcxug":{"text":"Had a wonderful dinner here for our 5th anniversary. We did the 5 course blind-tasting men","useful":0,"cool":0},"F0p-diVXP0UCnr-au80QvA":{"text":"My SO and I ate at Croquette on a Friday evening around 7:00pm.  Croquette has a nice quie","useful":3,"cool":1},"PDo-zhPDJGHMdjRHUZo_eg":{"text":"Food was very good. occasionally bordering on the sublime. Only issue was that it was a bi","useful":0,"cool":0},"P52DlTmaLChQNVEymqjXDQ":{"text":"Last night we had dinner at Coquette. We'd previously only had lunch. It was fantastic. Ev","useful":0,"cool":0},"GA0-s6rA1n7twO9SB1LUGA":{"text":"The food here is amazing.  My wife had the fried chicken and a side of grits.  I had the h","useful":1,"cool":0},"tM8ddD27F3IPzTKU65r7rg":{"text":"The fried Brussels sprouts are the bomb. I mean lick the plate good. Seriously. The rest o","useful":5,"cool":5},"ecNeKAtLGn4XE2ZZ4CLlOw":{"text":"I have to attend pretentious over-priced dinners at hotels and restaurants of celebrity ch","useful":4,"cool":0},"MqsgOiXm7H6-QAYD1W-DRQ":{"text":"My husband and I ate dinner here on our date night. The service was good. We had reservati","useful":1,"cool":0},"5uTDXezEr2D2DyT-gkhB6A":{"text":"Incredible meal!  I went for the blind tasting with the wine pairing and they knocked it o","useful":0,"cool":0},"uqGmaHGwhYu37vTOxkO1Cg":{"text":"By far my absolute favorite restaurant in town.  -Incredible food, wonderful service, and ","useful":0,"cool":0},"5tALxSZJB9sVi-HyUX-5_w":{"text":"This was a wonderful find. Put yourself in the hands of the chef and do the 5 course blind","useful":0,"cool":0},"Cr2uqai2eEWZaYwu7cvNiQ":{"text":"Amazing service and great cocktails. I had an appetizer and an entree, but my friend order","useful":0,"cool":0},"KXn7ovJYVlSx7CBbsAa8aQ":{"text":"Truly, I cannot say enough good things about this place. Our lunch was so good, I almost s","useful":2,"cool":0},"liF5kSa9bbEyx0UnKvj3Yw":{"text":"Coquette is my favorite restaurant in New Orleans, so I was really excited to try the No M","useful":3,"cool":1},"HmpIXwGXru0KyvIN4eZlOQ":{"text":"Decent food, wait a little longer than expected for having a reservation, service was aver","useful":0,"cool":0},"F2vbgIH8wmC6FT8yPpLPPA":{"text":"Everything about this restaurant was perfect! We were celebrating my birthday and even tho","useful":0,"cool":0},"XYZh_eDz0ISQ5OemV6IqHg":{"text":"I recently stumbled upon Coquette when a group of my friends were in New Orleans for a bac","useful":0,"cool":0},"pFPmJiMCD9YEop0__u6hYw":{"text":"Amazing food- farm to table, every bite was delicious. Smoked trout starter, pimento start","useful":0,"cool":0},"VpEtZJkB45gpsDqmoqcfrw":{"text":"You're thinking to yourself, \"I'm hungry and i'd like 5 star food at a 2-3 star price.\"  M","useful":3,"cool":1},"k-j6rBzWMVJyek-9di8N0Q":{"text":"Very unique restaurant. They serve dishes you would never imagine unless your were a chef ","useful":0,"cool":0},"Ps63PCEsGOvHmSZjqijR5g":{"text":"Superb!  Masterful!  A delightful blend of flavors equivalent to what one experience that ","useful":0,"cool":0},"zp8Q79FUIyNcta2ZhKJxNQ":{"text":"The pork rillette and foie gras were great!  I had the red chicken and hubby had the rabbi","useful":0,"cool":0},"VhM7dvszygbyeEECCU_VwA":{"text":"I had brunch for the first time this past Saturday after hearing rave reviews about this p","useful":3,"cool":0},"3qzEqHNd-n89IjXEJ45mbA":{"text":"We went to Coquette as a group of six on a recent trip to NOLA.  We went in with very high","useful":0,"cool":0},"rUbDILefmv-XGauu9X-Bkw":{"text":"Delicious and great service. I recommend always making a reservation in advance because wa","useful":0,"cool":0},"Rw14saJ-uta8NIdGw8aNaw":{"text":"Took my wife there last night for date-night for the first time. Always heard great things","useful":2,"cool":1},"RTxUSgWwHLkoBA0dgu56Tg":{"text":"Amazing! We ate here for Sunday Brunch and had the Eggs Benedict. Wonderful choice. It had","useful":0,"cool":0},"E66qaJLFhgLfDSPb0FPFzQ":{"text":"fresh baked bread and soft butter - perfect\nsmoked cobra with coffee - outstanding\ncrab on","useful":0,"cool":0},"nFya6wawpLI4nlJ108D7DQ":{"text":"Arranged a dinner for a large group while in New Orleans (May 2011). Coquette was our favo","useful":0,"cool":0},"SXuFHlfH2mm0eDSfACQ8Lg":{"text":"We arrived late for our reservation and were greeted with a very poor attitude and punishe","useful":2,"cool":1},"__vrSW6GG716fPl9Q031sg":{"text":"Located in the beautiful Garden District of New Orleans, surrounded by charming works of t","useful":2,"cool":0},"GyZoWBaRqhyUA7xcwkTwLQ":{"text":"Stumbled onto this place. It is very good. French inspired local cuisine with a neighborho","useful":0,"cool":0},"bgfuxyDwdXx9u99epvNXIw":{"text":"This was such a great place to find; we were visiting New Orleans for a conference that ha","useful":0,"cool":0},"VYoRTCKRjkHTopJZVRIyhg":{"text":"We experienced the no menu Tuesday. My wife had the wine pairing menu and I had a couple o","useful":0,"cool":0},"9YTCkIKKA7JGEm73zFTU0w":{"text":"Found this place after we realized The Commander's Palace doesn't allow shorts. We didn't ","useful":0,"cool":0},"jB6APcpVSa4egrcz1tz9aQ":{"text":"This place is spectacular! We had the gumbo, shrimp and grits, pickle platter, and bread p","useful":0,"cool":0},"Eu97krhKDK3xxRlred-FhA":{"text":"One of the best outdoor dinners I've ever had.  Everything we ate (there were 6 of us) was","useful":0,"cool":0},"BJF1i6ptfH80PzfRq6N0dg":{"text":"There's nothing more New Orleans than Sunday brunch and Coquette's take is nothing short o","useful":0,"cool":0},"VM02ZeW1Y_utjj8hDftzZQ":{"text":"We had a fabulous meal here Sunday evening. The food was creatively designed and expertly ","useful":0,"cool":0},"qekdoOaB4NIASyByswxzgg":{"text":"As a foodie who regularly eats in NYC and recently went to SF and Miami, Coquette was hand","useful":0,"cool":0},"z0debkyjD-Mv0CBG7am0fg":{"text":"Small restaurant. Make reservations a couple weeks before. We got the following: \n\n- Catfi","useful":0,"cool":0},"qjyvMnQ0q3t3WTgrQMPI8w":{"text":"Great restaurant! We went there while visiting New Orleans for a conference. It is a taxi ","useful":2,"cool":3},"cugHdNV94erhVF6ojdOwaw":{"text":"We loved the fired chicken here. It came two side dishes of mashed potato, green veggies p","useful":2,"cool":3},"LkcvN6QzzFCw6S67_9V0EQ":{"text":"So this restaurant is more like a 3.5   On our food tour of NOLA is was the least memorabl","useful":0,"cool":0},"4gZtk2Mi02pHvWCMB0wJaA":{"text":"For our last night in New Orleans, my wife and I had decided to go without a plan and see ","useful":0,"cool":0},"PAGYsQeRn9iaOwf1lrg1AQ":{"text":"We loved just about everything about Coquette. From the table upstairs away from the noisi","useful":0,"cool":0},"XjzyqEjJLbsh-7Dl32YlkQ":{"text":"So delicious and fantastic ambiance!! We were so happy to have wandered in for brunch. We ","useful":0,"cool":0},"QS1I8Sn2K2Y5vjvxV7tfeA":{"text":"Been here twice and was super happy with chef's choice both times. The food really reflect","useful":1,"cool":1},"0h7MFF8EUqRLavPjCtKFPQ":{"text":"As tourists, our attire was 'comfortable' but too casual for Commander's Palace, so we ask","useful":0,"cool":0},"RQvWknp-uZ0mGtCpsxNnYw":{"text":"Coquette is a pleasant little bistro and wine bar on the Magazine corridor. The layout is ","useful":3,"cool":1},"2XHgNRXL2OVl6sBn5wT5sg":{"text":"I've eaten at Coquette twice, and enjoyed my entrees both times. Service is attentive and ","useful":0,"cool":0},"8KpggB7faVADlRZAq_wkIg":{"text":"I had the pleasure of having dinner at Coquette for the first time last night.  It was not","useful":2,"cool":0},"txWoYdC48SmctJeVTXD5bQ":{"text":"We got lucky and were walking by when hungry last month. Someone walking out told us it's ","useful":0,"cool":0},"ALf-bDMZFcpR7TlruQjGug":{"text":"The most amazing experience...we had a small wedding with our wedding dinner to follow in ","useful":0,"cool":0},"sGH5NnXAkErlK_QH-l4O7A":{"text":"This place is perfect. Service is so good. Words can't do justice to the food, so I won't ","useful":0,"cool":0},"C_siSK9x1pozlybHGnMFZQ":{"text":"had Sunday brunch here today. we came in soaking wet after getting caught in downpour on t","useful":1,"cool":1},"rKbaIFNXMv_Bvo8PQyQDwA":{"text":"When I go out to eat, I am looking for something I either technically can't or won't make.","useful":0,"cool":0},"LbHXo6XwGOAdPKM_1MWptA":{"text":"The duck was perfect, tender with a fantastic balsamic based sauce. Also had roasted chick","useful":0,"cool":0},"Lg1KDhCrnYFdgg2_mP6nIA":{"text":"Went there with high hopes and good recommendations. Yikes! First let's start with their v","useful":3,"cool":0},"to91Blk5YcSSk0YlhL6qVg":{"text":"Hands down the best and smoothest old fashioned I have ever had, the food was great and th","useful":0,"cool":0},"CcxuYWr_Hte1KJ8-5P0Qpg":{"text":"At first, I was intimidated by the price of this place, but it was well worth it. The food","useful":0,"cool":0},"4X9OkKYtwbwbfvKG91ObEQ":{"text":"Outstanding 5 course dinner with wine pairings. Chef and sommelier both know what they're ","useful":0,"cool":0},"AXJkHmY5VCAnPAZmvG1OAw":{"text":"This is an example of how much good service can make a difference in a dining experience. ","useful":1,"cool":1},"yMrud2ZKUJ42JsnN49qTMg":{"text":"New favorite restaurant in New Orleans!  Great menu items. Great drinks.  Great service.  ","useful":1,"cool":0},"l7awDEWtZrSrDKwMkMF3DQ":{"text":"Summary: Go Thursday for $5 cocktails.  Eat everything being offered.  It's just as awesom","useful":1,"cool":0},"0uOA94pOovubOSTXDvswUA":{"text":"Coquette is another Irish Channel gem, but with a few flaws. I have only been to Coquette ","useful":4,"cool":0},"ujb48pgXBjZHJLiFJ_I-DA":{"text":"Great spot. We did a Cemetary and Garden District tour yesterday morning and had brunch at","useful":0,"cool":0},"8H0wDvhwO-5sPMRyom3rgg":{"text":"The best part of this experience, in my opinion, was the catfish appetizer.  The others in","useful":1,"cool":0},"-71lcdO4nR2FawsMjiJdtA":{"text":"I love the atmosphere at this fine establishment and the food is exquisite. They use mostl","useful":0,"cool":0},"fOypZwtoWv-ZMBK3_ixaDQ":{"text":"How in the world do I review the best restaurant experience I've ever had? A love letter, ","useful":18,"cool":12},"k98g4Tmhwp3NnhApZdhLKQ":{"text":"Loved this place. The fried chicken (which I would never normally order) was unreal. They ","useful":0,"cool":0},"qh7zgCRi4o9YFFcTg2oHfQ":{"text":"I had a delicious fish dish at the bar but the service was terrible! The bartenders didn't","useful":0,"cool":0},"rjhDyyrvUPsN_8u5oO1nOw":{"text":"Based on the reviews on Yelp, we were looking forward to our meal here greatly, and this i","useful":8,"cool":4},"6Op_MWUU8c5tZHzX-SthHQ":{"text":"Came here for lunch with my in-laws when they were visiting town in October.  Very good fo","useful":0,"cool":0},"xZ2JKL6_ugWaHym6vzZSWw":{"text":"I'm actually a little surprised that there's not a review for Coquette here - but I guess ","useful":1,"cool":1},"uG43edycD3HnRApMjwcGKw":{"text":"I came to Coquette on a date recently with a guy who, like me, is kind of a rube/country b","useful":5,"cool":2},"TL7sfrgTFXEpPfE8em7e-Q":{"text":"I love this restaurant more than life itself. My husband and I have gone to this restauran","useful":0,"cool":0},"Y7rfsLke-bAViwNrmuqhDg":{"text":"I love this neighborhood on Magazine street but unfortunately both times I have been disap","useful":0,"cool":0},"41aLdLuNF_E_DwJEvERjeQ":{"text":"My guy and I had the 3 course lunch menu and (as other reviews mentioned) it was FABULOUS!","useful":2,"cool":2},"Q8u0I1ibk632b9pH-VBgVA":{"text":"Stopped in for drinks and some small plates at the bar.\n\nThe cocktails were on point, the ","useful":2,"cool":1},"-7xtZWJ_V1M1ZpN_0wKgeQ":{"text":"One of our favorite spots in nola!  Great for special occasions or just going out for a de","useful":0,"cool":0},"BHxW6t_d1ZX2ED2_cJs6YA":{"text":"Five star experience all the way!\n\nWins:\n- Service was spot on from the hostess, to our se","useful":0,"cool":0},"Q9tlCU295c2P6CLYuuWaWA":{"text":"Came here for lunch with my parents over Labor Day Weekend.\n\nDecided to all do the 3-cours","useful":1,"cool":0},"p-ZY2woJJMWdbUUEXujLHA":{"text":"This saavy uptown restaurant has one of the most impressive liquor selections in all of ne","useful":0,"cool":0},"0T9SKXNWVhuD8LJSW0B54w":{"text":"Yes, indeed, this restaurant is an alluring temptress.  Wow what a meal!  We started with ","useful":0,"cool":0},"EAuAe5TXugwV2fsGzlu_Fg":{"text":"Best meal I ever had. The 5 course blind tasting menu was superb! Really wonderful atmosph","useful":0,"cool":0},"A8Vi9oiJLR-V0iqqk0dsJg":{"text":"Nice place. Nice ambiance. Good service.\nI cannot rate a restaurant more than 3 starts if ","useful":0,"cool":0},"rujjA2E661MBfrxixwtvWQ":{"text":"Last night I had some absolutely amazing fried chicken with pimento cheese ravioli and col","useful":1,"cool":1},"JqaKDS-tFPDuQF33OKCLdQ":{"text":"What a nice surprise!  Great lunch with farm to table delights!  Will go back when back in","useful":1,"cool":0},"tv62cVmZB6aqapVp8I2w4A":{"text":"BEST FOOD EVER! It's pretty, it's delicious & served by a friendly staff! I've been here m","useful":0,"cool":0},"SABwigtAtuJNfwmwPvHZEg":{"text":"Just a delightful, bright space on a cool street with a huge selection of drinks and creat","useful":0,"cool":0},"R8Jk8uCQChuenD4leGjcsw":{"text":"I found the salmon small plate to be a tad too salty but I am told it's supposed to be.\nI ","useful":0,"cool":0},"gzkjgVFTnVCg0ozwC-oWmg":{"text":"Wonder ambiance, easy location on Magazine, good service with a food that is good although","useful":0,"cool":0},"S3MsoIaEgZGePXIWRtn2Nw":{"text":"I went here for dinner tonight and everything including food, service and ambiance was gre","useful":0,"cool":0},"MdK-EfHHx5PAqhDP7NDmBw":{"text":"My parents came to town for a few days, so we did sort of a marathon restaurant experience","useful":0,"cool":0},"efX3l-fJPa2v9_rhuKtr6A":{"text":"Food was a little salty but I'd still give it 5 stars. Best bread in Nola. I had duck whic","useful":0,"cool":0},"9ngfg5Id88bowb6ShV5qgQ":{"text":"What a upscale casual gem of a find. I love the interior of this building with its exposed","useful":0,"cool":0},"SLfz9mJzv1GgkQ2TP8K-lA":{"text":"Unexpected change of plans brought us here. What a great stop and great food. Loved the sm","useful":0,"cool":0},"3yeNdYuWh1GEW7mrsz_y-w":{"text":"I found Coquette en route to Domilise's for legendary po'boys. But as the name suggests, I","useful":0,"cool":0},"jKe-Zr487eP1xgOMGHGLIA":{"text":"The lunch was so good, I had the Shrimp and Grits and it was the best of all that I tried ","useful":1,"cool":0},"sA-vIz7uZoPDFv8RezKbwA":{"text":"Enjoyed the best meal of my NOLA trip right here at Coquette.  Party of 1 at 8:30pm, this ","useful":1,"cool":0},"Cs5WBGdoWsK9qWaDiI5dhA":{"text":"Spent 90$ on a charcuterie plate, a starter plate, pork cheek entree,and one cocktail. The","useful":2,"cool":0},"yaY3yD3C67cHFQfOwJN3TQ":{"text":"Service was awesome and they made us an interesting shot on the house after I ordered a co","useful":0,"cool":0},"vTx98i-PNGN4p-ejoDTNrQ":{"text":"Every dish I had was good. PLEASE try the sweetbread and the blood sausage.","useful":1,"cool":0},"cjrujH1I8divwCOpIqGirA":{"text":"Stop reading the various reviews trying to decide whether to go or not.  Shut your compute","useful":2,"cool":0},"L7xfKp8kY8twIEG42lniMw":{"text":"Amazing food; a bit pricey, but totally worth it.\n\nIn this cozy restaurant they have some ","useful":1,"cool":0},"1400YH1kuPBKSggDRg1erw":{"text":"I do not know how you do it Chef Michael! Everything you dream up works so well. Sometimes","useful":1,"cool":0},"9g7c8hBPZvHW7fZ4ebCfbg":{"text":"Great drinks, tasty food. Lots of options for meat eaters and veggies. The seafood salad w","useful":0,"cool":0},"MdC3RlecXfFwyzusCh__3g":{"text":"We had a wonderful dinner here! The dishes are so inventive. A very romantic little spot w","useful":0,"cool":0},"fbAAEJNEfqsKZG6UHepQtw":{"text":"It's unfortunate that I came here for expertly prepared offal options, and the timing of m","useful":15,"cool":8},"qHIHCeZCDcaBordc57aaWw":{"text":"First of all, this is a beautiful restaurant. I sat at the bar, so I can only speak to tha","useful":0,"cool":0},"MUbeEvEz0nv9UoZj-GABbw":{"text":"Coquette is fine dining establishment with a focus on fresh and seasonal food but the port","useful":5,"cool":2},"Hm5L9_Etc2UJWAJJGHQDkw":{"text":"Great place! We had a reservation but had to add one person and they happily and quickly a","useful":0,"cool":0},"JwthLEcXJu53Fd5Q3DLxiw":{"text":"We had dinner at the Coquette on December 22, 2015. It was delightful. The Servise is impe","useful":0,"cool":0},"ZKQz2QKH7BkULKcmCHXCUw":{"text":"One of my favorite places in New Orleans. My husband and I have visited twice, doing the t","useful":0,"cool":0},"338uZCy8s9mE4akWmqr6vg":{"text":"I'm not going to make you read a super long review. Lets just get down to it. Coquette is ","useful":0,"cool":0},"K1ehhrA9KPqOdrGMYit-hg":{"text":"Another great experience!! This time we went with a group of friends (instead of just me a","useful":0,"cool":0},"0f8LeG_eVzi3zSGpZvzYAQ":{"text":"After taking a $14 cab ride, dressing up for an early lunch at Commander's Palace and bein","useful":4,"cool":1},"YwMKH23n3Qy-oroX8s9Ekg":{"text":"Favorite restaurant in Nola. Fancier but not out of budget. Fresh, local, and seasonal men","useful":0,"cool":0},"cTpbhlfeKtAIzWVYn_4VXQ":{"text":"Quick summary: Best meal in New Orleans! From the house-made and fresh baked ciabatta brea","useful":0,"cool":0},"dMhpD3BsalN7ZJ2Ri4CW_w":{"text":"The Pompano was delicious and the service was excellent. The Coconut Napoleon desert was q","useful":0,"cool":0},"fN8p1YZWfdgGWsRMxgC1kg":{"text":"We ended up here a Friday early afternoon for lunch totally at random. The place is wonder","useful":0,"cool":0},"BODAxDanHMcn0dTgkEsgzg":{"text":"(Visited 3/27/2010)  Found this place via Yelp while we were wandering around the Garden D","useful":0,"cool":0},"O58mQ3SAhxO1iYeFm7x3eA":{"text":"Hot chicken and buttermilk ranch - amazing!!! Down south they know how it's done! Yum! Big","useful":1,"cool":1},"pCeRbWMSTO02Ngh8nWaz2A":{"text":"DELICIOUS FOOD - EXCELLENT SERVICE - BEAUTIFUL PLACE. everything we ordered was delicious,","useful":1,"cool":1},"x0d0duE5Or3S-GbJhlDP6w":{"text":"Wow. I was with a party of four and we all had the blind tasting with wine pairing. I've b","useful":0,"cool":1},"Km9lhRsI4Ne4KmtsyzESGQ":{"text":"My boyfriend and his brother and I dined on June 7, 2015 @ 9:30pm. I walked in first with ","useful":5,"cool":0},"g8vs61FSp0uyV4U6CsPiXQ":{"text":"I give it two stars because the food was amazing but that was it for the good parts. I'm i","useful":6,"cool":1},"SqitEL_F3Z_ar7YeYs0PHw":{"text":"We went to Coquette on Dec. 30th and found the first course to be delicious indeed - the s","useful":0,"cool":0},"-0CyIRdjqfdoGRHexeB_fQ":{"text":"My 2 friends and I did the 5 course blind tasting with a wine pairing, and it was fantasti","useful":1,"cool":0},"1IbxV88kaQ5rflY10dKOag":{"text":"Que rico! Coquette is a pinky-out kind of place perfectly located off the busy Magazine fo","useful":1,"cool":0},"IOcd5_K2NFboXwII5G6tQw":{"text":"I am from Brazil and I made this 4 days New Orleans trip. My friend who is American was pr","useful":0,"cool":0},"1WBbwScC_iHbcg5Cdhy6_w":{"text":"The following is at best a feeble attempt in detailing how incredibly awesome this place t","useful":3,"cool":1},"Cpm8dWABwIp4ZexhYKILOA":{"text":"I saw Matthew McConaughey here. It was really distracting, couldn't focus on my date. But ","useful":1,"cool":0},"aEeCetlZFCgAFKu2Pvbilg":{"text":"Stopped here for a midday snack and a glass of wine on a Saturday after roaming around the","useful":0,"cool":0},"U_BuxPaTkGsvIGtmndgwww":{"text":"Recommended during a garden district tour. Looking for a vegan lunch. This place hit the s","useful":1,"cool":1},"anb42Vk5JgdbmAVk63zdRA":{"text":"Ok, I love good food at a good price. Just to give you an idea, their tasting menu is $40 ","useful":1,"cool":0},"tdUqIiiupnwjBcs45eOjmA":{"text":"Very good southern (fine dining style) food! Went with a group of 6 of us for dinner and t","useful":0,"cool":0},"kOtxuyl5QRFwHUQnK8jR7Q":{"text":"This was simply amazing. The food was amazing and the presentation was on point. Even if a","useful":0,"cool":0},"tci9X4-XI64KvUq8zKLn-Q":{"text":"Five Blind Tasting. First restaurant I think pictures cannot justify the taste. However, a","useful":0,"cool":0},"Q7ibpWB8wrvjgQZblPxfQA":{"text":"I don't think I've ever given a more deserved five star rating. Yeah, the food here gets c","useful":4,"cool":2},"OoAb_ifTixxzNiLywt-JFA":{"text":"Nice ambiance, BUT....ordered steak entree and salmon tartar. Decent steak but not great. ","useful":1,"cool":0},"FRs7XeoVVdUvfrQThvohiA":{"text":"My wife and I had the chicken for two. It was one of the best meals I have ever had. The b","useful":0,"cool":0},"Rw_Nzfbn5lytcJq1zBMVQA":{"text":"This place was amazing! We always try a different restaurant whenever we come to New Orlea","useful":1,"cool":1},"UReTKTfe-82UI8bB40zEHQ":{"text":"We ate here Sunday and it was the best meal we had in the US - we have lived here for a de","useful":0,"cool":0},"pC_vC2Kk8AtiMjh16_Dkzg":{"text":"What do you get when you cross a French chef and an Italian chef: Coquette's.  Eclectic an","useful":0,"cool":0},"eavbSsvSZ5Gp1fC8zV4jxg":{"text":"One of the best meals I have had in NOLA. Started off with the fried chicken. So delicious","useful":0,"cool":0},"e7bgoYKGcuhEZ7yWmKda_Q":{"text":"Great decor and service, but what stands out is the quality of the cooking from the kitche","useful":0,"cool":0},"y-0d2T0NBEq4jJWanCocXg":{"text":"Incredible!! Erik killed it with his cocktails, las cruces stories and amazing beard. Gumb","useful":1,"cool":0},"FZvvTwXrTxvXqRaHgJToTg":{"text":"I decided that 2014 is the year of the setup and this place has a great one for happy hour","useful":2,"cool":1},"ez2XgvKg3xXN-HRGh4-JKg":{"text":"3 course lunch is a must here.  I know this would sound like a #firstworldproblems thing t","useful":0,"cool":0},"npir_CnRYoIziptKBosloA":{"text":"I went to this restaurant with a group of 14 for the chefs tasting menu. Food was excellen","useful":0,"cool":0},"41t48Incvk5x2y31UeIq8Q":{"text":"Still a fan. However, Went there last night for dinner after work. Was a little let down b","useful":0,"cool":0},"efnrny9HNhaTMd-c3JWl0g":{"text":"This Sunday, my husband and I decided to drive down Magazine Street and eat at the first p","useful":1,"cool":0},"CmdB9S5T34bvvQZaJapWNw":{"text":"Been here a couple of times in the last six months and it's been great every time. Appetiz","useful":0,"cool":0},"uoigSCqR6MDxPQkmML4wKw":{"text":"Coquette came highly recommended by friends and Yelp, so perhaps I made bad ordering choic","useful":1,"cool":0},"byFnsGcgu7M6NApgeMyX5Q":{"text":"Amazing. The chicken app was to die for and my entire group shared their meals because the","useful":0,"cool":0},"IEzave5_SL2vBDXdNKgbUg":{"text":"Been here 4 times over the past 7 years or so and it's always our favorite NOLA restaurant","useful":1,"cool":1},"-BhUif448L8Xnbut8J8bjg":{"text":"Went here for a special dinner on a girls'/bday weekend in NOLA. Was referred by a former ","useful":0,"cool":0},"eL1p-T4TiwxRp8hicuwZew":{"text":"If you have fancy people in town, this is the place to take them.  Our three-course lunch ","useful":0,"cool":0},"SV0qJv4q6xHxas0RSgG9Xw":{"text":"Somebody make the chef put down the salt!! I had the duck and it was so incredibly salty i","useful":1,"cool":0},"uOnXvluu-f084Cl0zPFWbg":{"text":"I took a group of clients here and while the menu is limited the food was good.  \n\nNice wi","useful":0,"cool":0},"xNB7IrGezLBxDMRQpmu5aw":{"text":"Wow, this food was fantastic! They make a great bloody mary and the service was excellent.","useful":1,"cool":0},"RYpeNwoWFLJVuXczcxuHfA":{"text":"Hadn't been to Coquette in 2+ years and forgotten how good it was. For appetizers split th","useful":0,"cool":0},"LJ81ZTjkt8hW9GYlTYF1Ww":{"text":"Food was good but atmosphere terrible. Sat us upstairs where it was freezing. Terrible aco","useful":2,"cool":0},"-vjQIOtFrAnChrS8QQ0sxw":{"text":"Delicious and great service. My husband and I sat at the bar and had a blast watching the ","useful":0,"cool":0},"GQCeSY5Dkknv4OBtmaaljA":{"text":"Coquette, not Cool!\n\nCoquette is one of many, many cafes located in what appears to be an ","useful":1,"cool":0},"rgna054T7WqS6xN88x5xKw":{"text":"Unfortunately, after having several amazing experiences at Coquette, I had one that will c","useful":1,"cool":0},"fUY-miVCI_rsPgF5pc2E6g":{"text":"Not very central location but it's easy to get there by Uber or tram. The food was perfect","useful":0,"cool":0},"PtXIquQhsYWgDbB0omYX6A":{"text":"If you are touring the Garden District, you should probably skip Commander's Palace (they ","useful":0,"cool":0},"73OxyUdVMvtn2LofGmLODw":{"text":"The is a lovely restaurant. The building and decor are beautiful! Perfect spot to celebrat","useful":0,"cool":0},"9JWlkh0JF-rGuHKJbyob_Q":{"text":"I had the oyster and bacon greens and fell in love.  Coquette, you are truly amazing.  Eve","useful":2,"cool":0},"xM6SOoTWcrEyO4NkiYuRrg":{"text":"No words can describe how good this place is. So I'm not putting any.\n\nPS. Its expensive, ","useful":0,"cool":0},"Bh1WDbQZoQzYpypZIMQAgA":{"text":"Wonderful experience - great service, lovely space and excellent food.  This is now my fav","useful":0,"cool":0},"Ec1qxzkO_mfjlfkUigScHw":{"text":"The roast chicken for 2 was divine- but just the chicken portion which was unusually drenc","useful":0,"cool":0},"YsQ71nCu422pHoPHDk-K4w":{"text":"A great choice and a welcome break from French Quarter area restaurants!!  Coquette is awa","useful":2,"cool":0},"t0hqw2g4GXKjZx5P5jg0Pg":{"text":"This restaurant may be my favorite restaurant ever. I've only been twice but both times it","useful":1,"cool":2},"naCQ-bfVndZwPO5vSnffyQ":{"text":"This is definitely a 5-star location, a Zagar gem and a Michelin one star. What made it gr","useful":3,"cool":1},"XupTa1L7mlrkYKrU3XdTQg":{"text":"My husband and I have been here twice, and for the same thing - the blind tasting menu. Wh","useful":0,"cool":0},"j6y0Ht0w_pSX8ZV5mx6ToQ":{"text":"Coquette is one of the hottest restaurants in NOLA right now and it lived up to the hype. ","useful":3,"cool":1},"x_6aMuE9FwfQRXul-19Y-w":{"text":"We made a lunch reservation for 4 following our intimate wedding ceremony in Audubon Park,","useful":0,"cool":0},"IqL6VWueEGpeVBYhu1Z5Zg":{"text":"I don't get it. I was so looking forward to trying this place during my trip to nola, but ","useful":0,"cool":0},"Z8v-SGXhdpis5CZu7xzPHw":{"text":"No 1 in Nola. Unbeatable.\nTry no menu Tuesday.","useful":0,"cool":1},"9ZhsmSZ6GfNdYnUC-Anv9A":{"text":"I wa in NOLA for a conference and tried Coquette with a group of friends on a local's reco","useful":0,"cool":0},"DuR3pYmQFEyT-lgruGxIag":{"text":"Plenty of charm. Adventurous preparations with an emphasis on local terroir. Well worth th","useful":0,"cool":0},"k6SWtqeh7L7ex9-wwwLIVQ":{"text":"The blind tasting is like nothing you will ever experience!  Every time we come it is amaz","useful":0,"cool":0},"5erpgWBhKWcaPA-Z0cf_sg":{"text":"We came here for a birthday celebration. Cute place! We love the decor and service. Their ","useful":0,"cool":0},"yf4KBZTWAMR6tT-kvRkqsQ":{"text":"Absolutely delicious. My wife and I had the five course chef tasting and I highly recommen","useful":0,"cool":0},"NdY5fPQqk_Q-wFfyVO7SVQ":{"text":"Divine.  Lunch with some old friends here yesterday.  My first time.\n\nI started with a Jac","useful":8,"cool":6},"9zVgR7tD1P8CP7UodCpbyQ":{"text":"Tables set very close together.  But, New Orleans is not West Texas.  The service was beyo","useful":0,"cool":0},"rfDBcJefZOY7YUrwKUTK6A":{"text":"excellent selections. had pork deliciously paired with wine!","useful":0,"cool":0},"9L7HQ3bOdr4d1T0asqIZQA":{"text":"One of THE best places to eat in New Orleans. Delicious, handcrafted drinks, extensive win","useful":0,"cool":0},"y3i9B-h7Hr5iUrLP1xdKzA":{"text":"Great Place - Great Food - Great Service\nHighly recommend!  They were very accommodating w","useful":0,"cool":0},"GsOglnCQTizvsu07aA53sg":{"text":"This is our fave go to place in NOLA. Try the tasting menu with wine pairings. You will no","useful":0,"cool":0},"R3yyBQB4Hmgp773yrLgI9w":{"text":"I went to dinner at Coquette on a Thursday night and the food was very good. The flavors a","useful":0,"cool":0},"19CI1doFHOu8p3VsfShuNQ":{"text":"Simply amazing.  This is one of those meals where you are so full, but can't stop eating.\n","useful":0,"cool":0},"tyRpDyJCweobI-UxL8GHnw":{"text":"Loved my meal here, would come here again!  Was pleasantly surprised by my first visit to ","useful":0,"cool":0},"UBwPkyABNRnoyI6Szhq86w":{"text":"great!  everything our group of five ordered was superb, i would have liked bigger portion","useful":0,"cool":0},"WW25gnz_1tc6b_rZBE6yhw":{"text":"I would say this is probably the best restaurant in New Orleans! Everything on the menu lo","useful":0,"cool":0},"Kjs5U4HK_hsUtbUcfA2S0g":{"text":"After residing for months as one of my favorite restaurants, Coquette has planted itself s","useful":1,"cool":0},"SkhQQH5b1CiQMB7kQ6Jffg":{"text":"The pork rilette is a meal in itself! Definitely an appetizer to share. \nEverything is exc","useful":0,"cool":0},"mDQWNl79UveIrEjVzUEXMw":{"text":"Hands down--unbelievable.  The creative food and the drink selection could not be beat.  H","useful":0,"cool":0},"kQG-PHzAl-7TLqzmX-a5_Q":{"text":"No thanks, Hank! Idk y'all likeee the steak was cold when we got it, for $70 it was hella ","useful":2,"cool":0},"-v7qSXelVTTb7ypG30AuPQ":{"text":"I forgot how i found this place to begin with.. but WHHHAAT A GEMMMM!!..\n\nthis place defin","useful":0,"cool":0},"eW0qkWJsjYS0gI24AX0w-g":{"text":"This is the #2 reviewed restaurant in the big easy?  Do yourself a huge favor and disregar","useful":3,"cool":0},"fozxo23kYiYI3MMyQxvuag":{"text":"My girlfriend and I were in New Orleans for a few days when we were both craving \"green le","useful":0,"cool":1},"Gu-LaLGMYgz25f8EWXN8IQ":{"text":"I am a former New Orleans resident who returned to the city with my wife to experience the","useful":0,"cool":0},"QnlveijB3cJNVcaSAa-vLQ":{"text":"We've gone twice now with 3 years between visits and the first time was so great that I th","useful":1,"cool":0},"EjoNK4TtEkWxrn_u_WQd6g":{"text":"This restaurant came highly recommended by locals and friends in Chicago.  The food was ta","useful":0,"cool":0},"fPHxv_lP8Utchgaf2cfIEA":{"text":"Diner last night was awesome. It came highly recommended from my taxi cab drover. She was ","useful":0,"cool":0},"8jUv7sIuLHCn9C5ZlWElEQ":{"text":"Coquette is a one of a kind restaurant. I took my parents there for lunch who were visitin","useful":0,"cool":0},"e2MbQf1i_uxrsb4wmG30Bg":{"text":"I didn't eat much to merit a review of the food but to charge $1 for ice on a $20 cocktail","useful":1,"cool":0},"l1dzsZuXMEMJfs58uZRstA":{"text":"Sitting a the bar was a hassle for everyone involved. Bar tender seemed pissed, food was m","useful":0,"cool":0},"mMf5FbPEhBklN8IxAetBGg":{"text":"Average food not worth the price. Good service and atmosphere.\n\nWould only go back for a q","useful":1,"cool":0},"8E3LrSKEfYcqQOuYHZJKHw":{"text":"Had an excellent dinner at Coquette last night.  We started with the Beef Tartare appetize","useful":0,"cool":0},"6B_N1XRThYCd5qHbe1c-uA":{"text":"This was one of the most exquisite meals I've ever had. I went for the chefs tasting menu ","useful":0,"cool":0},"HIqsKZ8u2ji4uXJgeq3HVA":{"text":"The trout and red snapper entrees were superbly presented. The flavor and freshness outsta","useful":0,"cool":0},"ItXsNyGNBN_fLy5jLA_1ww":{"text":"If you can get past the noisy dining room, this is a fabulous dining experience.  (I don't","useful":0,"cool":0},"DTvEASHAue3qvLBK7PCDrw":{"text":"Fabulous find!! Beautiful bar - tin ceiling! Great\nambiance & great food. Best bread in Ne","useful":1,"cool":0},"p3Q6eFCoH8rAkU-ehhpSwA":{"text":"Had a few cocktails at the bar to pass the noonday heat. Ashley the bartender was great an","useful":0,"cool":0},"snhsx7k75Eweg0iamPAHJw":{"text":"Stopped in for dinner after a local recommended it. Menu is upscale and changes often from","useful":0,"cool":1},"9QgoTm2DjAvZX_kphByj7Q":{"text":"Simply amazing. I had the 3 course lunch for $20. \n\nStarted out with a tomato gazpacho. Ab","useful":0,"cool":0},"vn1vuZl6V1q74V4xmEEeHw":{"text":"Coquette was an absolutely delicious dinner experience. To start, the drinks were great. T","useful":2,"cool":0},"ngxnqbNX8VEue40q2Mld7w":{"text":"oh. my. goodness.\n\nwe stayed in the garden district and were feeling hungry but lazy.  a q","useful":2,"cool":0},"B6l224BBmGY6HidajDfyVQ":{"text":"I can't say enough good things about Coquette.  Another visit and another great meal: star","useful":0,"cool":0},"RYgDT0BepaZxK5CElvx2eA":{"text":"Great food, great service, criminal prices. Unfortunately this is par for the course in Ne","useful":0,"cool":0},"1oINAL_tgFwhBVULA3rVug":{"text":"I was here on Valentine's Day. The food was delicious, spot on. Drinks were ok. Our main i","useful":1,"cool":1},"c_1hrnJ-XajGdqaCbWHr4Q":{"text":"Not sure what the hype was all about. We ended up getting the duck and bass, also had the ","useful":0,"cool":0},"tXVMFvcxYbk3kDmWMG2gLg":{"text":"Coquette was great - food was delicious, original and beautiful. We had the tasting menu -","useful":0,"cool":0},"LGJtLuCiK5SYjtOTjJ99bw":{"text":"A year has passed since our last visit to Coquette, but it was definitely worth waiting fo","useful":5,"cool":1},"nwBCh5YA0VfNu-jfgusb5g":{"text":"In about 3 days in NOLA I gorged myself on a lot of great food in different places but thi","useful":0,"cool":0},"-r5vUTzz4C8WYyAhKYOY4g":{"text":"The manager was the cutest, sweetest ever. She was super accommodating to us on getting ou","useful":0,"cool":0},"RwBh5ugMMlyJFYk5J6kxCA":{"text":"A wonderful meal overall.  The fried oysters were excellent- piping hot with well seasoned","useful":0,"cool":0},"mKt0Y_2nKwCu8GivHbXLdQ":{"text":"I'm in town on business and found Coquette with a quick google search of \"Best New Orleans","useful":1,"cool":0},"fCG5NG3KTgbxS0E1tGWvFQ":{"text":"I have wanted to come to Coquette for a long time. I finally got the opportunity to go wit","useful":0,"cool":0},"40LxAGPSnPZS7Asjy7IO0w":{"text":"Coquette has been a special spot for my husband and I: \n- We celebrated our first Hallmark","useful":0,"cool":0},"OKJk5xqtVUFbSiIlOCJaOw":{"text":"Dined here for dinner last night and had the 5 course chef's tasting menu along with the w","useful":0,"cool":0},"-Gwn-b7NGH6ZYj5uQt5IGQ":{"text":"We have been stuck in a Clancy's rut for a while, and that is always great.\nBut we have be","useful":0,"cool":0},"aOSWPP60dRY7h0lHyBeERg":{"text":"only been here once due to prices $$$, but it was an amazing experience!  the waiter was s","useful":0,"cool":0},"Z9RkzvDKa_I_ZiiqKoraBA":{"text":"Based on reviews really excited to try this restaurant when visiting NO for our anniversar","useful":0,"cool":0},"dCpTb01KI0SqvZu7GEpl4g":{"text":"We went there for happy hour and it was great! We ordered the 4 cheeses, pickled plate and","useful":0,"cool":0},"LwifutVtmYkgJawtbPeIBQ":{"text":"This place is great for a date or just meeting a friend. The food is excellent and the atm","useful":0,"cool":0},"w1iMMYZkWMPvjI_p_6Y2Hg":{"text":"Mushroom dinner entree with crispy rice and peaches is fabulous (and the chef can finish i","useful":0,"cool":0},"iaUZQN6nRh10phFzS4mo9g":{"text":"The reviews of the service at Coquette are on target.  While the food was great, the servi","useful":2,"cool":0},"-cA5gB-bJQkUrDQumtTC5g":{"text":"A fine meal, consisting of a entrees of scallops,triple tail, a side of rillette, asparagu","useful":0,"cool":0},"_gWsqg5tNV5rP6mjQfSDJg":{"text":"I and a girlfriend got lucky and sans reservation over one jazz fest weekend 2013 found tw","useful":0,"cool":0},"EfGgHnbClDGS1VHkBjSwgQ":{"text":"We had the most incredible meal here when we were in town visiting (and I did my research ","useful":0,"cool":0},"_NdqBOH7z3M-FKEwYcXeHw":{"text":"The food was excellent but they sat us upstairs, which I will never allow again as they fo","useful":0,"cool":0},"pKjd-Y0OODvYe02Ady16iA":{"text":"One of the best meals I've ever had in the city. Such detail with each dish. Interesting c","useful":0,"cool":0},"EYEg1MAS812FY_wvWCGRKA":{"text":"Dined here for my first time after receiving several recommendations from friends and neig","useful":0,"cool":0},"wBlrN1oLP8IJFSPeVALRdw":{"text":"An excellent choice for a nice dinner on the town!\n\nIt is located towards the end of Magaz","useful":1,"cool":0},"Pt5irwVEU6kaUMRB-z4IVA":{"text":"Best brunch we had in 7 day stay. All 5 in my party loved the meals. I started with the gu","useful":0,"cool":0},"JF2BzMOhNHdKcl00RkR3FA":{"text":"Our experience here was top-notch. You can tell when they think through  all the little th","useful":0,"cool":0},"ffrhen3SlGCy2fuYVysoBQ":{"text":"I've been here several times, and I always find it to be just ok. The service is great, bu","useful":2,"cool":0},"r5M0qih5NsqKgGkR2A60oA":{"text":"Solid food and service in a cozy/fancy atmosphere.  Get the pickle plate.  And a drink.","useful":0,"cool":0},"vro8Df1-5skXElUDhCYNDQ":{"text":"My fiancée and I had dinner at Coquette on Christmas Eve. The food was divine, the staff v","useful":0,"cool":0},"-bPE0Gscmz6wjRUSqBp6Pw":{"text":"Coquette was my first time eating at the type of restaurant where the food is more about f","useful":0,"cool":0},"Hcaf8IZ8Gd9BaE5bKV77Sg":{"text":"Romantic. Delicious. Perfect restaurant choice for Valentine's Day dinner. I'm generally h","useful":0,"cool":0},"X5svnSfND8K3FNz64W092Q":{"text":"Took my mother in law here for a bday lunch. It was delicious! Make SURE you order the bla","useful":0,"cool":0},"SSkK18jjAbNbL-cpBfCH1Q":{"text":"We were disappointed at our recent meal here at Coquette. We went for a menu-less Tuesday ","useful":0,"cool":0},"NH62ax8H9dLoUeJAhI3DuQ":{"text":"We went there for lunch, not having read any Yelp reviews. I confirm that all those stars ","useful":0,"cool":0},"kxRGvQxe9gUXplgX67cqqQ":{"text":"We had lunch here and I give it a 5 star all the way!  We had the 3 course tasting meal an","useful":0,"cool":0},"4Yw23fYatTkdwvGa2vH24w":{"text":"Had to chew on this one for a while.  Downside to that is I've forgotten some of what we h","useful":2,"cool":1},"8_SF0otL2EXYoLHVkYZyZw":{"text":"We were shopping on Magazine Street today and stepped in to have dinner based on Yelp revi","useful":0,"cool":0},"r7WV6N2AtptoUZHZKhNMsw":{"text":"If there's a time to spoil yourself, it's on your birthday. \n\nMy boyfriend brought me to C","useful":0,"cool":0},"UXlDG8uK8HjDfq26F-8IKQ":{"text":"I had the pleasure of enjoying a client lunch here. I opted to try their fixed price, thre","useful":3,"cool":2},"gv1PqZx_zsxP-sqvwX44-A":{"text":"I rarely have a meal that breaks the bank but this one did it in style.  Best brunch I hav","useful":0,"cool":0},"np4uOZbIcGZnYgSOHqCZ8A":{"text":"Service was fast and coquette accommodated is easily even though we were 30 minutes early ","useful":0,"cool":0},"Wt3WxVevQlCKRmfa4eCIsg":{"text":"Tried coquette again. I wasn't a huge fan last time - maybe because I can be a picky eater","useful":1,"cool":0},"_4g1sIWP8DgXQXmyBMG5ww":{"text":"The food and service are outstanding!\n\nI visited with a group of 5 friends. We shared the ","useful":1,"cool":0},"91wvxPobi5j42tOVN00eLQ":{"text":"Hands down the best meal I had in New Orleans.  The fried chicken was juicy and cooked per","useful":0,"cool":0},"5SoThXcYqAFgm9QGsQmx9w":{"text":"Outstanding restaurant!  This was by far the best food we had in New Orleans.  If you are ","useful":1,"cool":0},"pZyTEHcX-rKLua5zV2VWug":{"text":"Dinner. Spot on. Warm bread so good it broke my wife's gluten free diet. My wahoo app was ","useful":0,"cool":0},"p6yHZaiijFq4b4P3sYSRjA":{"text":"Suggestion for the too young and unexperienced female server from Oregon... don't flirt w ","useful":2,"cool":0},"nmzEwn3iJ6bNyFpa-yWO_A":{"text":"Check out the $20 three course meal for lunch!  Everything was good quality and delicious.","useful":0,"cool":0},"7ahIzXDNOXexwVYdsO7anA":{"text":"I've been here a number of times since it opened (we were fans of the Japanese restaurant ","useful":0,"cool":0},"gxanB_WrBqIj6aobJFDdSA":{"text":"I was going through some photos on my iPhone and came across the pictures I took of my mea","useful":0,"cool":0},"NjGJ91NbEVHZ1Ug-zhO1ow":{"text":"Service was super slow, our drinks were empty and we had to keep asking waitress for more ","useful":2,"cool":0},"n8zUBw5tJ-0s7TOKUUkMYQ":{"text":"Not sure why I never wrote a review about this place, but I love it. Beautiful restaurant.","useful":0,"cool":1},"lGjz49iYd6ZYJ97btBsFYw":{"text":"Just when the food express was supposed to slow down, it gets kicked into high gear. And s","useful":1,"cool":1},"Bn3_VVMy4Xq3k7K1tcw3QA":{"text":"It had been a couple of years since I had been to Coquette ( I am lucky to live in a city ","useful":1,"cool":0},"FU6vijrQ_jfxQSz_oayJJA":{"text":"I have fallen in love... The duck for 2, fried chicken  & absolutely the best bread I have","useful":0,"cool":0},"QBSLvuReUgzrrWTgC4e1yg":{"text":"Excellent presentation and preparation.   The disco music and fine dining was totally inap","useful":0,"cool":0},"u_APdg6a3Slrhn4CitLa9Q":{"text":"We had the loveliest brunch here, and everything but the weather was perfect! We arrived a","useful":1,"cool":0},"vj6nDsVtdlXMB5UoGbcAPA":{"text":"This place completely stole this little foodie's heart!!!\nIt seriously doesn't get any bet","useful":5,"cool":4},"5VdPaWyxD4N6LTvqAOYLEA":{"text":"We went here for our anniversary dinner, and couldn't have been happier. The service was f","useful":0,"cool":0},"AHT2SbxiJGzzw1Iuyy72hw":{"text":"Food looked good, but had 5$ cocktails on a Thursday night. Not a lot of room, but nice pl","useful":0,"cool":0},"bS9h-ZM9XBCqniFZAjQE9Q":{"text":"5 Course Blind Tasting was worth every penny. Service was incredible.","useful":0,"cool":0},"MlNpDq2RsOQDZm7BaXfkrQ":{"text":"I adore this place! I've been to Nola 3 times and have visited this place every time I've ","useful":0,"cool":0},"el7aNVqMzXnoEdycSYA2Qw":{"text":"Coquette exceeded all of my expectations in ALL areas!  I read the reviews beforehand and ","useful":0,"cool":0},"l-fTl3jerIQfGThDfulbfg":{"text":"I had a lovely dinner date at Coquette recently. I had eaten here once before a couple of ","useful":1,"cool":0},"EMlnCp3TBXCeMG3h8hws8Q":{"text":"The salmon tartare was a little too fishy! Day old? But plated gorgeously, and the service","useful":0,"cool":0},"M3_8wHqlocC2qll75rD57Q":{"text":"My wife and I traveled to NOLA in January and were lucky enough to have seen a review in F","useful":0,"cool":0},"4WuQ1xAF6-7cD8H14pAHyw":{"text":"The host at Commanders Palace recommended this place.  Small menu,  but extremely tasty.  ","useful":0,"cool":0},"IU4PUm6DBD3qcmY6qows-Q":{"text":"I just got back from a 3 day trip in New Orleans for a low key bachlorette long weekend. I","useful":0,"cool":0},"ROQCPIhuYGb5cVRqaIfprQ":{"text":"I had been underwhelmed with this place in the past but it turned things around a few mont","useful":1,"cool":0},"ua57SVKP7gDYnt5r-4ocfw":{"text":"My friends and I decided to do a GNO here and we weren't disappointed.  The restaurant is ","useful":4,"cool":0},"nyP0rYpT5wOJE-_m2ZK-Ig":{"text":"Came here on a recommendation and let me tell you we were so happy we did! The pimento dip","useful":0,"cool":0},"cjTP1pnIPSCn5vAg_oYTzQ":{"text":"Had the 5-course tasting menu, pescatarian, and it was delicious. We added the wine pairin","useful":0,"cool":0},"_QsjLiCIdmZapn2T3_NqSA":{"text":"This is the first five stars I have given to any restaurant.  They are simply amazing.  Th","useful":0,"cool":0},"hT0jRSc-z9hIZwg0RkvYkg":{"text":"Went here after a video I saw online by rapper Action Bronson and I wasn't disappointed.\n\n","useful":1,"cool":1},"j2xb3Ev7J0qMH_kBd8XjMQ":{"text":"Great mimosas! Forego the catfish dip and head straight for the fried chicken sandwich. A ","useful":0,"cool":0},"sbklO7Egc1_-0Ek9rLEywQ":{"text":"My husband and I went to this restaurant for Sunday Brunch (around 11:30AM). We were the f","useful":0,"cool":0},"9q4F_4SwPBfB2tAlNgSrJg":{"text":"First time here..was wondering around the garden district. Ordered 3 small plates: oysters","useful":1,"cool":1},"IQ7YLUGKT5S5zK79kdxnLQ":{"text":"Lovely location, nothing epic but nice and inviting.  Really, really good service, very at","useful":1,"cool":0},"JBoiP49zlyRzU7n6UVnksA":{"text":"The front of the house was pretty weak - maybe she's was having a bad day, but she was pre","useful":0,"cool":0},"0NbmYcBytFyJHUMYcFb8_A":{"text":"My wife and I sat at the bar yesterday and had the 3 course lunch.  Honestly, probably the","useful":0,"cool":0},"J4no01UiKJNrd2X0-gT-TQ":{"text":"I went here for a \"no menu Tuesday\" tasting menu and was not disappointed.  Five courses a","useful":0,"cool":0},"FDSpBMETewtNOZDHB4fr7A":{"text":"Outstanding food, service, and atmosphere. Only issue is that the food isn't well describe","useful":0,"cool":0},"GsFSxvxmcjPG-jiijFHFcw":{"text":"I am in full agreement with the previous poster's assessment on Coquette.  The food was ab","useful":1,"cool":0},"sWIq0yCvyiNCQUyMAnD1IA":{"text":"i made lunch reservations after a saturday morning garden district tour. it is a small qua","useful":0,"cool":0},"qXb_nYtT42oBqpNEg7LnwA":{"text":"Contrary to some other recent reviews, our servers were very helpful about menu questions ","useful":3,"cool":0},"EZTmk8DzU6U-YePayjPBJQ":{"text":"While I live two blocks from this fine establishment, I don't go as often as I should. Mos","useful":1,"cool":0},"cbAmRytdvwLaxtAGUbucXw":{"text":"The food was excellent - we had the five course tasting menu which is really more like eig","useful":0,"cool":0},"u0r1Xkj7S5U2jkKYr_zaHg":{"text":"One of the best meals I had during my trip to New Orleans. The service was wonderful, the ","useful":0,"cool":0},"WR4zktNqn0F8MH-AvrNhmw":{"text":"Asked the chefs to feed me (had their tasting menu) everything was great from the start of","useful":0,"cool":0},"U24ERT8n5wPaBxeJ5Ya9sw":{"text":"Dinner at Coquette is, simply put, a lovely experience.  The ambiance, decor, and service ","useful":0,"cool":0},"HbYu8dSvMxhjVX1_vTeq6g":{"text":"I arrived promptly for my lunch reservation at 11:30 and the staff was trying to get organ","useful":1,"cool":1},"Wl23RiGFbQRiuJOCU67Wwg":{"text":"Having really enjoyed Shrimp and Grits NOLA-style at Mr B's, I was very excited to try thi","useful":1,"cool":0},"hpol4gOzGYjEjcr8YO2Jzw":{"text":"Walking inside this restaurant and already sensing an intense hatred from our waitress. St","useful":1,"cool":0},"ibaHJ8Z5VyNmljuZNzJsEQ":{"text":"Amazing cocktails. Amazing bread and butter (don't laugh, that shiz important). Great serv","useful":0,"cool":0},"ctTtMIW9yYox3HxUcEIVlg":{"text":"My husband and I came to New Orleans for our wedding anniversary, and decided to check out","useful":2,"cool":0},"VCLMf3KmFJM6EWjIC6AbQA":{"text":"Excellent restaurant. Nice beer and wine list, but the food is fantastic. The crab dip app","useful":0,"cool":0},"BQGZVN5BwNKsqXEbgt7-qw":{"text":"Ah, Coquette. The most special meal of our visit to NOLA. Warm, intimate, romantic, unpret","useful":0,"cool":0},"m7GTRWfknGRCBbX2iDoKZg":{"text":"Not kidding... This was one of the best restaurant experiences of our lives! My husband an","useful":1,"cool":0},"NsJ7gBwoz2BguQ8tZUd7sQ":{"text":"Easily my favorite restaurant in the city.  I've been here 5-6 times with various groups o","useful":0,"cool":0},"MACaNMfckarBv4jbyVcZoA":{"text":"This is one of the better Uptown, upscale restaurants in New Orleans. The interior is clas","useful":0,"cool":0},"_VO6PAyTESoAKDFHxKfTLQ":{"text":"The bartender at our hotel in the French Quarter recommended we try Coquette while we were","useful":0,"cool":0},"8hmb9R04R8A6K6y21L5I0A":{"text":"Solid upscale food but the waitstaff marred the evening. We were there at 9:30 on a Monday","useful":0,"cool":0},"WG01vzIsXy9c6lbgiTFyOQ":{"text":"Just ate a late lunch here with my husband. It's our first time in New Orleans and man wer","useful":0,"cool":0},"_Ia9WQ8_knpMVBxqlC_g2A":{"text":"Great restaurant a little further afield from the touristy area. The food was amazing. The","useful":0,"cool":0},"4h40awTlvniQHCwYgT5Ktw":{"text":"I have been to this restaurant quite a few times when the food was very good, but thus las","useful":0,"cool":0},"mil8O3YsTW7ZJ67XRf97QA":{"text":"The fried chicken took me to heaven then the dessert brought me back down to earth.\n\nI und","useful":0,"cool":1},"h91ml924RK9Cv7INKrtLZA":{"text":"My friend and I had dinner here a couple of weeks ago. It was a great experience. The food","useful":0,"cool":0},"AXswFSVMs9PDREBFmM0YXw":{"text":"Tonight I visited Coquette for the fourth time in my first year living in Nola. This is al","useful":0,"cool":0},"-W2ajGAt9V21IJ3VtJHR_w":{"text":"My wife and I both had the three course dinner.  We made sure to order different things fo","useful":1,"cool":1},"_ZvOj3kKnqXIj1pikIBTlQ":{"text":"The food and service was all outstanding. The atmosphere is classy but relaxed. Our table ","useful":0,"cool":1},"3RSjwqHx_u9jwMlSvogPrw":{"text":"This meal was fantastic. We had it recommended to us by a friend who had stayed in New Orl","useful":0,"cool":0},"VnFEhJBhx3dDqFCmPbb6jQ":{"text":"Came here for a business dinner in January 2012  and was utterly pleased with the creative","useful":0,"cool":0},"DS1NK8IqU-7Zi6Jxbuc-4w":{"text":"Terrible service and lousy food. We stopped in for a late lunch and the highlight of the m","useful":1,"cool":0},"xUHmJNxrGeCTruxdnif22Q":{"text":"4.5 stars but we enjoyed it enough so rounded up to 5. Sampled several dishes from the men","useful":0,"cool":0},"SJMl42ugS5nYojJxVoWf6w":{"text":"Friends - \n\nAs a former New Orleanian, I can proudly say that Coquette is my FAVORITE rest","useful":1,"cool":0},"M0RjPRIzvDgxNYlQeoxBxw":{"text":"Excellent dining experience due to the suggestions by our server Darcy.  We were very plea","useful":0,"cool":0},"a1OrToIKbtgVBm8eabffEw":{"text":"Amazing. My table shared the meat board and I had the duck for dinner. Both were incredibl","useful":0,"cool":0},"QZs1Ju3tquj3VqYZMKOK0w":{"text":"Brought my wife there for a birthday dinner last night.  It was fantastic! Great ambience.","useful":1,"cool":2},"A_qy_LpQgWpACl9rYo4EKA":{"text":"This place gets a 3 instead of a 2 because not everyone in my party thought it was as bad ","useful":3,"cool":1},"W7H2bIrVdLMpZ7npPHd6Ow":{"text":"Loved this restaurant. Mike Stolzfus is an amazing chef/owner- appreciated how personable ","useful":0,"cool":0},"DNFtpxHVCx15Jfgw6zTvAw":{"text":"Firing on all cylinders - spectacular dining experience from start to finish!!\nGo here. (B","useful":0,"cool":0},"tcitC9Gz70plm-PA9A9tpg":{"text":"Drinks and food are unique and really good. Had 2 appetizers (head guess and a warm crab s","useful":0,"cool":0},"ALhgPOwOPaUi9kb2-KIYGg":{"text":"Back again to Coquette for brunch. It is a good thing I don't live in New Orleans or you w","useful":2,"cool":1},"lUtszyj0pCUYt8a8p0VNPA":{"text":"Some friends and I went to Coquette before Thanksgiving on Wednesday to totally avoid cook","useful":0,"cool":0},"LuLr_KZBwLA1P8lI8agMOg":{"text":"Beignets with salted caramel.  What else can you ask for.  Everything else is fabulous as ","useful":1,"cool":0},"5xX7eZYwtjyTU1Y2GygXxQ":{"text":"We began our night seated in a lightly dimmed corner table in back over the restaurant ove","useful":0,"cool":0},"E0CEXYutLC8G0GbUFR2Hyg":{"text":"We were brought to Coquette's by local friends and it was the best meal we had while in Ne","useful":0,"cool":0},"a5aSL3fQBkXgrhVObVWuBg":{"text":"I have been coming to Coquette for special occasions for years and it has never disappoint","useful":0,"cool":0},"5uy97u6weQ-mo59apc_VXQ":{"text":"I've been here several times... once to drink wine with the hubs, once to drink wine with ","useful":0,"cool":0},"x5kS9Z110wyyXIV9HpycBA":{"text":"First time in Nola and we were fortunate enough to get a table last minute. Service and at","useful":1,"cool":1},"EkuMCFIAr5nmAYQtp8HWng":{"text":"Had the three course lunch... The gumbo (perfectly spiced), shrimp and grits (perfectly ri","useful":0,"cool":0},"Lo4dH9U0a7vlUn8lLq_3VA":{"text":"I had Valentines Day brunch here on Sunday.  This was my second visit to this restaurant a","useful":4,"cool":2},"fRg6LxIQXgVo2VMzMaOUgg":{"text":"We ate here for lunch and their $25 three course preset menu is definitely worth the price","useful":1,"cool":0},"j1XkVhnRjnaOqPsLQASmrQ":{"text":"One of the best meals I've ever eaten, ever.\n\nThe cheapest wine on the list (Malbec) was d","useful":1,"cool":1},"YdCxERUxpHPx7diRtnyFLw":{"text":"Most recently went here for dinner, but I need to talk about my brunch experience first.\n\n","useful":3,"cool":0},"IJTj6LdhRpE_ochVxQqXaQ":{"text":"I thought our server John was outstanding.  The food was terrific and the pace of the dinn","useful":0,"cool":0},"3yXF0P7bg_1l4N3YF8A5-Q":{"text":"We were slightly hesitant to try Coquette because some of the negative reviews about their","useful":0,"cool":0},"2i2g6R31I0K8-H24QqCwfA":{"text":"If  you're a foodie, try \"Coquet\" in the garden district. Menu changes daily and it's one ","useful":0,"cool":0},"uzGDCG1JsPSFi23B8mVy1g":{"text":"One of the best meals I've ever had, and I've had a lot of great meals! Everything we ate ","useful":0,"cool":0},"7rHflnLTyoGNl4A2JJKo9Q":{"text":"One of my best meals in N.O. They made a tomato/ vegetable sandwich that was amazing!! The","useful":0,"cool":0},"kJXY_hOMhgBlyqLURJGUGQ":{"text":"From start to finish i think this is the best dining experience in The Crescent City. I ha","useful":0,"cool":0},"Nqu-8x2zyfOEfTNzlgWrCg":{"text":"It was one of those existentialist food experiences where i was aware that i had this food","useful":1,"cool":1},"8OLHS-SphDEdxyi-xQYwFQ":{"text":"My BF and I visited New Orleans last weekend and I landed upon Coquette for brunch based o","useful":0,"cool":0},"kALHc3J79dBkpNAzeq0Pjw":{"text":"This is a wonderful date restaurant.  My girlfirend and i had the prix fixe lunch menu whi","useful":1,"cool":0},"D1A2CguhEXLAQZUSTiyRig":{"text":"Masterful. Awesome. Best meal I have had in a while. Rice, shrimp and crawfish and fried o","useful":0,"cool":0},"UksoKSGg8UwYjSEthezURQ":{"text":"My favorite restaurant of all time. Do the tasting menu and leave it up to them. I have be","useful":0,"cool":0},"faf47-UEaVKh7L5QUQr6xQ":{"text":"Spectacular! The wine pairings were AMAZING, sommelier REALLY knows his stuff. The food wa","useful":0,"cool":0},"OHRLKpcvyVi0SE6XWgqvTA":{"text":"What a great place. We had the grilled oysters as starter. Shared the duck and steak as ma","useful":0,"cool":0},"J934v9Onf_iXPAhjW7kHaQ":{"text":"Had the tasting menu with wine pairing. All courses were excellently prepared and had grea","useful":0,"cool":0},"CrXhWXfRtrkgaySbrCh21g":{"text":"Wonderful taste, subtile balance of flavors,  very pleasant ambiance!","useful":0,"cool":0},"fvCW6eetWqFE2iqwwW_ZQg":{"text":"Atmosphere is nice and quiet. Food is good. Servers were very helpful with wine selection ","useful":0,"cool":0},"gabask9RUEFsfqZCQTSqdg":{"text":"The food was absolutely delicious and the wait staff was very professional and amazing. Th","useful":0,"cool":0},"ZsvM83RtbLum9U9ny1KhAQ":{"text":"Beautiful space, good service , good but not great food. \n\nRabbit terrine bland (more salt","useful":0,"cool":0},"fqK-4B2RQlMAsoaO02yLyw":{"text":"Hubs and I were wandering Magazine Street on a recent trip to NOLA. We were waiting to hea","useful":0,"cool":0},"u2h_UG98R7yv0KMBmnjGJg":{"text":"I visited this restaurant with a friend (AS) the last time I was in New Orleans.  We had t","useful":0,"cool":0},"zjpRn-THkVm1I8aY9cDk1w":{"text":"A Coquette staff person cancelled my confirmed (via OpenTable) reservation 3 hours prior t","useful":1,"cool":0},"POtXqY3EY1ls0kwfFrIwpg":{"text":"I've been here twice now - and both time I was blown away with how good the food was. Ever","useful":0,"cool":0},"1qDyRAQ5d1PCvQMuAOD--A":{"text":"Amazing!! One of the best meals I have had in a long long time.  Atmosphere was great.  Se","useful":0,"cool":0},"gth0QnKckXn1WxXFb_rkZg":{"text":"Coquette is a cute little bistro that we are glad to have stumbled upon while walking aiml","useful":4,"cool":2},"tagBJ1lXch-ubM399yDiwQ":{"text":"Atmospher was nice. \nThe drinks were good but the wrong or odd sized glass was used for on","useful":0,"cool":0},"zVF2s8omb-1oCH3Cch4h5A":{"text":"Service was impeccable, and the 3-course lunch menu items were delicious! The shrimp and g","useful":0,"cool":0},"tvG8t83l59YJaZ7JsQdO_w":{"text":"This is my favorite classy joint in New Orleans.  I like that it's nice enough that you ca","useful":1,"cool":1},"RthNk6Z29ID25RTTxTPJAg":{"text":"Why can't I leave 6 stars?!? This is one of my favorite restaurants. The 5 course blind ta","useful":1,"cool":1},"c6emzm8McFP0Zs3t-vgjHA":{"text":"Everything we ordered was delicious and although it was more expensive than your average l","useful":1,"cool":0},"erC8V2OvPZBzqUMdnNt3EQ":{"text":"My parents came in from Michigan to visit my sister and I during Jazz Fest. I used open ta","useful":0,"cool":0},"tTjmeU1ikPmUeV0eLIOt6w":{"text":"Our party of four opted for the blind chef tasting with wine paring. It was one of the top","useful":0,"cool":0},"p_18lnISOyxIW9ejH1evgQ":{"text":"This place was awesome! Great food and friendly service. One place to go back to for sure!","useful":0,"cool":0},"ktnKaGqCyxA_akTvnVNlRw":{"text":"Disappointing meal after highly anticipating this venue based on recommendations of multip","useful":3,"cool":2},"RJRJyGs3e5r_3-QsYWdfcQ":{"text":"This is usually my go-to suggestion for restaurants near my neighborhood.  Great bar with ","useful":0,"cool":0},"MbnWvdXE76ph6WO4AF_xig":{"text":"What a great find. We stumbled into this area of town and ate here for lunch. Everything w","useful":0,"cool":0},"FdrsRAJp0eVYqYOOzIH3_Q":{"text":"Perfection in a restaurant.  Beautiful environment. Enough space around tables to allow fo","useful":0,"cool":0},"X3M6YVg3AUHwCxZP4N-dpw":{"text":"Old Review from Valentine's Day 2013 FYI.\nI went to Coquette, usually a safe choice. \nI wi","useful":0,"cool":0},"6--6dAQfoDuYR7aC0uUVWw":{"text":"- The charcuterie board was very nice.  Savory, sweet, a little bitter.  Mmmmm\n- The red s","useful":0,"cool":0},"QC4vxHzAu6Py0aKIVOR34w":{"text":"Last two visits have been very average, and totally different experience than before. Vege","useful":0,"cool":0},"n6k6eCqNnDrvq8u7YwhnzQ":{"text":"Perfect place. Great cocktails, great food.","useful":1,"cool":1},"GvYf-GtHgtwx_y3IeEntdA":{"text":"Magazine offers some good options off the tourist trail and this is one of them. Small and","useful":0,"cool":0},"aLcDCEcdKI70rLolPJauQg":{"text":"Came here for lunch the other day.  We had reservations; maybe that's why we got a spot by","useful":5,"cool":3},"PamSwi7lbWebngL-VDZ0qg":{"text":"Amazing. Make reservations even for lunch. Leisure lunch not rushed. Flavored and food you","useful":0,"cool":0},"oDhOG_z_Qd4W48-yPZ5_5w":{"text":"I'm a little disappointed that it took some out of town friends to get me to actually eat ","useful":0,"cool":0},"DF7g_lKEpUxKDGG4EfhXTA":{"text":"The duck was some of the best duck I have ever had easily. So well well flavored I almost ","useful":1,"cool":0},"ir_zYG7Ef3ZnkMHouexPvw":{"text":"Wow! At first I was a little unsure of the brunch menu, but everything we ordered was out ","useful":0,"cool":0},"jJo2flyrBDR2xnpck-0flA":{"text":"Just lovely. I had eaten here a while ago and enjoyed it, however this time I was simply d","useful":0,"cool":0},"WWpn2SP6plxXsj5WND49cg":{"text":"We keep coming back to Coquette for their amazing $20 lunch menu. This time, it was fried ","useful":1,"cool":0},"D7DydgW7mC4zCEsrl4GEPw":{"text":"Came here with friends this past Jazz Fest (2009) for a break from their Bud & Miller Ligh","useful":1,"cool":1},"67v4-dbO3uLGu93msJSf3w":{"text":"I loved Coquette! Beautiful atmosphere- especially upstairs. Fabulous service and great ho","useful":0,"cool":0},"mt4JRbvvfQVi8sJh7FvO2w":{"text":"Great brunch place\n\nLT had the biscuits and gravy .. It was the perfect amount of deliciou","useful":0,"cool":0},"0XA2MVzzJxrN98qlKHpbVQ":{"text":"Coquette never disappoints.  I also note that this is one of the few restaurants where I f","useful":1,"cool":1},"h_ihAvmAh8piwqL-WU8wLA":{"text":"Wow, best lunch my wife and I have ever had. We found Coquette on Yelp and made reservatio","useful":0,"cool":0},"xR8Cmo7X8q7idsXfJeSdkw":{"text":"We got the $45 tasting menu and added another appetizer and we considered it to be one of ","useful":3,"cool":2},"9lWGH6c7DyWJTK-BpMcf-w":{"text":"The Cochon de Lait is spectacular. Pork marinated overnight in milk, pulled, formed into b","useful":1,"cool":1},"EiY9CgnY3MsgLT0ltRzX-w":{"text":"What a romantic restaurant. Such art and thought was put into every course. Took my boyfri","useful":0,"cool":0},"-7JWqXCAgtteTT6kEtLWCQ":{"text":"Fabulous. Great for a fancy date. Great wine list. Excellent service. My favorite upscale ","useful":0,"cool":0},"PSG8sz2VoC2dfw5e91mwaQ":{"text":"We stumbled upon Coquette by chance on our last day of 3 day trip to NOLA.  We opted for B","useful":0,"cool":0},"2LVSnGwt0ko07Wf--pom1A":{"text":"I went for the Sunday brunch and had gumbo-spicy but delicious, shrimp and grits-delicious","useful":0,"cool":1},"7okJWLp_KlEwIwOtne9t7A":{"text":"I had wanted to eat here for some time, the atmosphere and decor of the restaurant is so p","useful":0,"cool":0},"uamfYko3UAiWA5mp9KTbtA":{"text":"Today, along with seven other close friends, I dined for the first time at Coquette. I've ","useful":0,"cool":0},"-RrhDR8fbs8odIXrSgT-HQ":{"text":"So I tend to base my find dining selections off of Southern Living's \"Best 100 Restaurants","useful":0,"cool":1},"EXccUavqZKOCLZtXtYbX3w":{"text":"n a city of outstanding...this one didn't make the cut for me.  Not a drinker and I think ","useful":0,"cool":0},"RyUV8vMUoXNUoX_wui_HBQ":{"text":"This place is simply amazing. The watermelon fried chicken is to die for... Literally the ","useful":0,"cool":0},"oS0m92c7Y9Yxsqj3yGO8cA":{"text":"Service is attentive and kind\nWe went for brunch, reasonably priced, a bit on the high end","useful":0,"cool":0},"juEGZA-yZiXDO15skjuJ7A":{"text":"As Christopher has already mentioned, the chef/owner Mike Stolzfus was the sous chef at Jo","useful":3,"cool":0},"g_2nLgeffFb-ttJfMR1V8w":{"text":"My experience here began with meeting the rest of my group there. We ordered drinks at the","useful":3,"cool":0},"obWPNyfOT_XwvjLSPoXK2g":{"text":"Amazing.  The service, atmosphere and the food!  After reading some very positive YELP rev","useful":2,"cool":1},"ITm5w21ZCElXiSHATq3gGg":{"text":"This was the 2nd large format meal that I have done at Coquette and this one, just like th","useful":1,"cool":0},"ggaW4awyyeYm3KmPNODVBw":{"text":"I absolutely LOVE Coquette. My friend tried the lunch special that included blacken drum o","useful":2,"cool":1},"CgvSUSasQiUKQfNPWOpscw":{"text":"I had high hopes for Coquette, as it was recommended by a number of local friends, but we ","useful":0,"cool":0},"VNG4-TANeGhur_SFeULnNQ":{"text":"Here again for New Year Eve. Wonderful experience and best western style restaurant for my","useful":0,"cool":0},"oOj8kJny8n0AHyVLzy99dQ":{"text":"Loved this charming place - great upscale neighborhood restaurant with excellent food. Our","useful":0,"cool":0},"EoKZ6epYUYf-ynP8tk1aJQ":{"text":"On my most recent trip to NO, some local friends took me and my boyfriend to this fantasti","useful":0,"cool":0},"nweoFRkPeoCsBWPBiT3TXA":{"text":"Took our friends to try this place during a visit to NOLA.  We enjoyed all the foods we or","useful":0,"cool":0},"LrfbOoMUfrqRG9rE9BALPw":{"text":"What a great place. We had the brunch. Wonderful appetizers. The crab salad was amazing. T","useful":0,"cool":0},"-g42O0djO2MvbR_AEKGqhQ":{"text":"To be honest, food was stellar. Went here with wife and mother in law and enjoyed the enti","useful":2,"cool":0},"4MMd6UMoANpH1eKel1zvxQ":{"text":"The food here was amazing!! We split a variety of dishes and they were all memorable! We w","useful":0,"cool":0},"Qcjg3112ytKdbAfCkIEk2g":{"text":"Awesome food, great service! Ambiance was perfect. The chefs whim 5 course meal was totall","useful":0,"cool":0},"h1VQRgVzrTDJIa9ZbT0MaA":{"text":"Was brought here by a good friend who lives in the area. After I spent 48 hours \"eating Ne","useful":1,"cool":0},"5JIA-LnnZdHJGPL8d7eJCg":{"text":"Went here for first time for our anniversary dinner.  Choose it based on good reviews.\nVer","useful":1,"cool":0},"UIKGDhUWzd5BD0fqoD_JrA":{"text":"As many other reviews say (from various websites), this place has some odd service. I had ","useful":0,"cool":0},"crm02fnYwGyIWdevyty9Jw":{"text":"I actually enjoyed Coquette, just not quite enough to give it 4 stars.. but for what it's ","useful":0,"cool":0},"b02LnKbGpxBTRhswwAKbGA":{"text":"Exceptional service and food!  Very friendly, knowledgeable  staff.  The food is fresh and","useful":0,"cool":0},"2T9DCtkIACVUeff5O4Xngg":{"text":"coquet was recommended to us and it didnt disappoint.  We initially went because we saw be","useful":0,"cool":0},"bs5gFKDkeq2g0zNvvfTNsw":{"text":"This is my favorite restaurant in New Orleans, and frankly the restaurant that a lot of ot","useful":0,"cool":0},"7oDVoLdjs7oJsA7AXrFipw":{"text":"My wife and I ate here on a Sunday night and had the most incredible meal.  We started wit","useful":0,"cool":0},"MYxksATuDHMWpALVVE43gQ":{"text":"The service here is amazing!! The food is one of a kind!! In town or tourist this the plac","useful":0,"cool":0},"6GkTPEPzlKLjlYsJagKtZw":{"text":"Ate here for lunch during Labor Day weekend after Hurricane Issac blew threw the city.  Th","useful":1,"cool":1},"rEd3INEL4lmNkF-25kz28A":{"text":"New American style dishes with a southern approach.  You cannot beat the 5-course tasting ","useful":1,"cool":0},"YBRPGXnrB1rkH2xCko9gvQ":{"text":"We went here for our 20th anniversary, and loved it.  The food was as good as any I've had","useful":1,"cool":0},"zGdOF6N13IK4LOj3xI265A":{"text":"I ordered the \"Pig\"  entree which includes BBQ pork, pork belly, and some sausage. I kind ","useful":0,"cool":0},"XKKSMvuy1GF92lhkfRW-WA":{"text":"Excellent meal. Attentive staff w/out being all over you. Diverse menu. Definitely not the","useful":0,"cool":0},"S_flgZNRCyiXSo7h3F8WhA":{"text":"Phenomenal dining experience!!\n\nVisiting New Orleans from DC/VA area with a goal to experi","useful":0,"cool":0},"MEHK0P-LvNWgK7nVhipJVg":{"text":"Hands down the best meal we have had in New Orleans. We have gone to almost every suggesti","useful":0,"cool":0},"ai-h1rR3xdZ9IizZ_njmAQ":{"text":"Wow! Great place to eat! They really know what they're doing with food! The flavors are mi","useful":1,"cool":1},"DZrYXo_FgUMjbbkJiX2q-w":{"text":"The daily changing menu makes it fun to go back and see what they have.  The wine is good ","useful":0,"cool":0},"hMx4LgvdKdLNQCP110u1hg":{"text":"Their drink list is awesome.  I had 2 Mules and they were bomb!  \n\nI could drink them all ","useful":2,"cool":1},"amiMBxQPCjy64vZjU24AlA":{"text":"food was fair but portion are just ridiculously small\n7 adults got 2 plate of shrimp each ","useful":1,"cool":0},"Jac3sEasEvpasKrgp1xlYA":{"text":"Meh...just average. We did the tasting menu. Didn't like that we had to threaten the two a","useful":0,"cool":0},"I9q5vuappo2qvFyeFFV5Ww":{"text":"Coquette is my favorite restaurant; not just my favorite New Orleans restaurant, but my fa","useful":0,"cool":0},"tqorxCP9f4uZxQ1DDH8Wng":{"text":"Great ambiance, attentive staff, yummy offerings.  \nYou really should make a reservation o","useful":0,"cool":0},"9J95d9cUSxWqvKZmrh9Pqg":{"text":"I went here during a business lunch and it provided a very good setting. For the meal, I h","useful":0,"cool":0},"fhLE3lXoS2ASYWzPkZ-Yfw":{"text":"Finally got a chance to try Coquette! It's Coolinary Month in The Big Easy, so this was a ","useful":2,"cool":0},"eM5YSvGgd-axA3tdSoZBFw":{"text":"We opted for the 5 course dinner and wine pairing. This was the most interesting and delig","useful":1,"cool":0},"GXDhBSRbKD3pktj3ZVROyA":{"text":"coquette is top notch.  everything we had was fantastic and we left extremely pleased and ","useful":1,"cool":1},"jAGvljpYt0DoIAICtw-B3A":{"text":"You little Coquette, you. Always flirting with my taste buds. And I fall for you each time","useful":2,"cool":2},"wu1upLEvzgK-bhYl623caA":{"text":"My girlfriend keeps raving about this place.  I got a coupon for $25 giving me another rea","useful":2,"cool":0},"CRjyxxXMr1twfwzHnYJhJw":{"text":"Great ambiance and atmosphere....we loved the fried chicken platter!  Food cooked perfectl","useful":0,"cool":0},"BvECFNhow4KWpkE9SNbFnA":{"text":"Coquette\n2800 Magazine St, New Orleans, LA 70115\nhttp://goo.gl/maps/qsa4C\n\nWe had a fantas","useful":0,"cool":0},"z_GkucxoWv4e1OK8BON2nQ":{"text":"Walking down Magazine Street in the early afternoon and realizing we were getting hungry, ","useful":3,"cool":1},"OZGG2yuRCUyVllQGfV203A":{"text":"My partner and I were visiting from Chicago for her birthday and, based on the ratings, de","useful":0,"cool":1},"Q09xd4rYcpzAToQJt6Wetg":{"text":"Coquette is one of the best dinning experiences that I have ever had.  The menu is short a","useful":0,"cool":0},"lwrvd-GqahlO83eOCkdG0w":{"text":"A night pervasive with highs and lows. We started with the shrimp remoulade, which was the","useful":1,"cool":0},"mrK7PeBotJDNq9geKA_QTw":{"text":"Yum!\n\nFor our three day trip to NOLA, my friend and I made all of our meal reservations ah","useful":0,"cool":0},"kb7eBVwTP5LJEcaAI999oQ":{"text":"I cannot say enough good things about our experience at Coquette. From the minute we walke","useful":0,"cool":0},"Z9H8g8jL1bx5i3As5wdF_g":{"text":"Yum, awesome spot, hard to get into, especially during Jazz Fest, but they do accept walk-","useful":0,"cool":0},"ivDa9LDfYSPvBovf9lSWeQ":{"text":"My best girlfriend and I met here 2 weeks ago during the Coolinary Menu special.  I've pas","useful":0,"cool":0},"o7jCogGcehFH64N_qdc5lA":{"text":"3 wonderful courses for $20 bucks?! Are you kidding me?! Awesome. I came here with 3 other","useful":1,"cool":0},"wjshEvjdDlKlxReEyiEhGg":{"text":"I have never had a bad meal here. I have always found the service personable and professio","useful":0,"cool":0},"nXVQYpWDcL21g5oapx4TMQ":{"text":"Had the seven course tasting menu with wine pairings.  Didn't have a single course that I ","useful":0,"cool":0},"fwiCuezY6cjpSJfePD_fYw":{"text":"I wish I could give this 6 stars. I have never had a better meal from start to finish as I","useful":1,"cool":0},"BmrA69s1MlVUyujpBqkvNA":{"text":"Incredible service and food!  We had the crab appetizer, the scallops, the shrimp and grit","useful":2,"cool":2},"iJl3w0J1S2HjUcyA5lRRWQ":{"text":"First of all, Wednesday's drink special is $5 on any of their wines by the glass. I tried ","useful":0,"cool":0},"UVxdFZWD94KkdGnzrIkPRQ":{"text":"A beautiful yum indeed.\nWe had a few small plates...crudo, smoked hearts, and some ricotta","useful":1,"cool":0},"c5BgP50ygYObFIZsIgjvNA":{"text":"We went to Coquette for an anniversary lunch and enjoyed ourselves as well as the food loa","useful":1,"cool":1},"njTb_p1f9JA9gSha6O8gmw":{"text":"My wife and I did the 5-course tasting menu during our trip to New Orleans. It's officiall","useful":0,"cool":1},"7oYib5U7DbP9yRfReYDxCw":{"text":"Best fried chicken, hands down. My son and I went here for brunch. We had their gumbo whic","useful":1,"cool":1},"Qa8C4r5nRaqcDH4LPAKZMw":{"text":"Nice place on Magazine Street. There's limited outdoor seating and it's bigger than it loo","useful":1,"cool":1},"c_1WmhZDS5fsZkZ1ucxthQ":{"text":"I had the highest hopes for this experience. The restaurant is in a beautiful location and","useful":6,"cool":0},"-TGBdf8bnAl0jWQISN6kKQ":{"text":"A real bright spot in our trip to NOLA. My 12-year-old daughter and I enjoyed the prix fix","useful":0,"cool":0},"nQAJxIkVl9vr7Dkc2eHwyw":{"text":"Enjoyed a delicious brunch here where I ordered the duck leg eggs benedict which was nearl","useful":0,"cool":0},"xFAWxReJTY_J8vfjmJbY8A":{"text":"Thank you fellow YELPERS, your reviews led me to pick this place while in NOLA for Jazz fe","useful":0,"cool":0},"qRU2MbS4DZwz9sEUKSCeKA":{"text":"Great find in New Orleans!  Went on Wed during dinner with five co-workers.  \n\nPluses:\n- P","useful":0,"cool":0},"ExCfvKykdtLC8ahz9o8TQA":{"text":"I am only giving stars based on the bar because sadly, I have not eaten here but I love th","useful":3,"cool":2},"8iZ5ggHSBhrV_IebD3Hgtg":{"text":"We had to come to Coquette to try the $20 3-course prix fixe lunch menu. We came here on a","useful":1,"cool":0},"BpmHwAtVJCaS_syOI23nVw":{"text":"Great tasting menu! Only downside is they forgot to add our dill to the dessert course! Th","useful":0,"cool":0},"eO-373iS8BHtbvlunNO-Ag":{"text":"Coquette is by far my favorite spot in the city. no place consistently delivers the fire l","useful":9,"cool":4},"EW9wcZRq1A2IVHcekKiMmA":{"text":"This was such a great experience. We did the blind tasting menu with wine pairings. It was","useful":0,"cool":0},"oPEi2ZoagyLAWQ7PhxfsFQ":{"text":"In New Orleans, there are scores of small spots scattered around the city that serve wonde","useful":2,"cool":1},"hKAtMoLKDd189Sd9jRz-Qg":{"text":"Coquette is a small restaurant and the elaborate, speakeasy-esque bar takes up almost half","useful":0,"cool":2},"i3_c1A2pVxUrYDtliYzlLA":{"text":"Bold distinct flavors, umami, fresh and bright. My palate has not been this awake in awhil","useful":1,"cool":1},"VpFFN11m0IA-Zy7BOyOyqQ":{"text":"Coquette was absolutely lovely. The 5-course blind tasting with wine pairing was a definit","useful":1,"cool":1},"pOy2e9H1OQpXPYt3j3aScQ":{"text":"Fantastic food and great service. The duck was perfect and a great sazerac.","useful":0,"cool":0},"A_dG1AW13q51B5IOpoY9dw":{"text":"My wife and I randomly walked into Coquette while on a self-guided walking tour of the Gar","useful":1,"cool":0},"Whjzi5n8fGKSntE9EoU-vw":{"text":"Best meal I've had in New Orleans. Enjoyed a tasting and wine pairing for three delicious ","useful":0,"cool":0},"3qJNfdMst2DrfZpBdlA4qQ":{"text":"Went here for Dinner on a Friday night around 8:30 pm on a recent trip to NOLA. Originally","useful":1,"cool":0},"X1C1GLmUD2eqQB74uO1ZJQ":{"text":"I fell in love with this place the moment I walked in. I'm really interested in the ambian","useful":0,"cool":0},"-_u1tRTlsoTO1pAC05AiqA":{"text":"My fellow Yelpers did not let me down.  This placed lived up to the cumulative 5 star Yelp","useful":11,"cool":6},"DflGgn6pfhY7_8xyql0g2g":{"text":"Came here on a recommendation from a friend and was NOT disappointed! My wife and I had th","useful":0,"cool":0},"5hSxPvl_H_RuqV46wptfYQ":{"text":"Overall, the experience was average. Waitress was inattentive to our party of six...we had","useful":1,"cool":0},"ojIgh85qJVr8NOmM8aoXaQ":{"text":"This Magazine Street eatery is an absolute gem, much like its owner and chef Mike Stoltzfu","useful":0,"cool":1},"6o9SAqLuxxXuscG4fAKlCg":{"text":"The squash dish was fantastic as well as the seafood stew. The turnip app was also good. T","useful":0,"cool":0},"liI6lU5Wra1nvKIKBa86aw":{"text":"This restaurant has been a favorite of mine for some time but this is my first review on Y","useful":12,"cool":7},"FOGIbZUb9CCjSDsYnsquoQ":{"text":"I was brought to Coquette for dinner by a friend who strongly feels it is one of New Orlea","useful":0,"cool":0},"TsT0GBbBg_OCH3DlIAsaMw":{"text":"Coquette is oustanding. On a recent trip to New Orleans, we mad sure to get a reservation ","useful":3,"cool":2},"fkZjg4Q6JG9lS_p0VQpOSg":{"text":"I wrote my initial review of Coquette in January 2012.  I've been back roughly a dozen tim","useful":0,"cool":0},"u0VUjx0PXR_l9aAeblZ_jA":{"text":"What a great place to relax and have a drink. The staff was very friendly and the cocktail","useful":0,"cool":0},"EfLMAhVT4nGb-Zam8Jmd5g":{"text":"We just left this place and had a wonderful experience, and the food was incredible. From ","useful":0,"cool":0},"s4EUsMDURR72JXfngIdG1Q":{"text":"Our waiter is the reason you have 3 stars. Otherwise i would go lower.\n1. Unimaginative me","useful":0,"cool":0},"sdud64JUIOxCiG3KY_ExMQ":{"text":"A gorgeous chef-driven experience with a concise menu not bogged down by tradition. Chefs ","useful":0,"cool":0},"c8-tAl-eAuMy_ljdNVrcVA":{"text":"I love this place, first time for me and my date and i thought it would be special, and th","useful":1,"cool":1},"qmarHqOrMYiYm_9kMVFmmg":{"text":"Great service and eclectic food.  Small menu was not indicative of the variety of flavors ","useful":0,"cool":0},"ChZFcZ8Ndjx3bwRtOAMxZA":{"text":"Good friend and I came here and committed to the Tasting Menu with wine pairings. We start","useful":0,"cool":0},"EmWIAcSklnDCO8_SmMKZcA":{"text":"One of my top two favorite meals on our whole 1.5 week long trip to New Orleans! The blind","useful":2,"cool":0},"j2U41WlWzBW75IjYZnMV0w":{"text":"My husband and I went last night for our anniversary and it was amazing! The entire experi","useful":0,"cool":0},"4lb1hAc58HY6LNDhF_2Dlg":{"text":"The kind of restaurant that would be impressive no matter what town you put it in, and can","useful":0,"cool":0},"QodN6nHIGEeXD3JIDPN_TQ":{"text":"This is one of my fav restaurants in New Orleans. I've been here twice, the first time for","useful":4,"cool":3},"efVuB7L483HQVQYlGfUJiQ":{"text":"We lucked onto this restaurant and I would like to emphasize the word \"luck.\" The food was","useful":0,"cool":0},"EVi6J_UdRTDneQIUYb_wJw":{"text":"Ok- just stop reading all the reviews and go. Pull the trigger. Get the chefs tasting menu","useful":4,"cool":2},"qCL00v42NMaQ_Lkr-0Kvbw":{"text":"Time is often fluid in NOLA and we needed to adjust our reservation.  Alexa, the manager, ","useful":1,"cool":0},"IGbMVcnPWk_W09FrwZQGnA":{"text":"Very pleased with this restaurant.  Food was excellent and so was the service.  Not as pri","useful":0,"cool":0},"5LRZ-cCMfJHvhzuDsXgbtw":{"text":"Perhaps my expectations were too high or perhaps Sunday night is not the best time to dine","useful":0,"cool":0},"yqoGYaapr188eEAKiMrTpw":{"text":"Charged me $120 to cancel a reservation. Was really looking forward to checking it out but","useful":2,"cool":0},"n464GERmXfljd4hIOPOHxw":{"text":"We did the Sunday brunch at Coquette.\n\nI agree with the reviewer that suggested skipping C","useful":0,"cool":0},"P77gAdrMGJlR1I6Tecgiig":{"text":"We had a wonderful experience at Coquette. My sweet husband is tragically allergic to nuts","useful":0,"cool":0},"fiyDO2ThJaGF7ee4bl0dsw":{"text":"Coquette never disappoints. On my most recent lunch visit I ordered the 3 course lunch spe","useful":0,"cool":0},"IUT5CiK18suStbI9RA8-TQ":{"text":"I dined here last week and it was my least favorite restaurant that I have been to in New ","useful":0,"cool":0},"F-JGCsquhwHL8iDW7LstbA":{"text":"I really want to love Coquette, but I'm having a hard time. The first time I went was on m","useful":0,"cool":0},"NG3LwJOU66WHNBxZQdx6IA":{"text":"The chef's tasting menu with the wine pairing are unreal. The staff is amazing and the win","useful":0,"cool":0},"GSN33Y4so0Biy3iMEIGFkw":{"text":"Everything was amazing, especially if you do the wait in line on Yelp it makes life so muc","useful":0,"cool":0},"ie3CwwCA8rPqso0R3MsRRQ":{"text":"I believe I died and went to food heaven!\nWe went for dinner and had the five course blind","useful":1,"cool":0},"uLQ9ENtMaA19YlkM8HSiiw":{"text":"18 June 2019\n\nA neighborhood stalwart still going strong on a stretch of Magazine that bus","useful":0,"cool":0},"VCj_iiLnKWZaiZ4QdWFUxg":{"text":"Quite simply, underwhelming, bordering on awful.  I went in with high expectations as this","useful":1,"cool":0},"xFaCDLgkXlnjiydQa96PYg":{"text":"I'm not sure if its completely 5 star worthy but we had the best time here.  The small pla","useful":1,"cool":0},"oqRivnHA_Zfa-B0hAqhPBQ":{"text":"deeply disappointing experience - i had such high hopes and expectation but it turned out ","useful":2,"cool":0},"_jzN0MPadmVaw4C_uLqC7g":{"text":"You know when you write a review on your cell directly after dinner, you just had an incre","useful":6,"cool":2},"SJUwO-g9_5wxnM6oTw-O9w":{"text":"The lovingly remodeled old house is loaded with ambience. The servers are excellent. And t","useful":0,"cool":0},"60CxZLf7vNyjbadfXragcA":{"text":"While I can't say we loved the food, we had a great experience at Coquette.  We opted for ","useful":0,"cool":0},"Z3NpcPYPjQLK_590v1lVOg":{"text":"This place is totes ridic.\n\nThey offer a 3 course brunch (or maybe it's every meal, I don'","useful":3,"cool":2},"19ei7UlvvsVKJntHqlm-BA":{"text":"Started off with a great drink - Gin Martinez - and it only got better from there. The sta","useful":0,"cool":0},"TcCie76Mq5h0Hy-kpnNiAQ":{"text":"Staying in the Garden district and had seen this restaurant while walking around on Magazi","useful":1,"cool":0},"Czu0etpTsv5AigDAPN3p7w":{"text":"Lower end of the 5 star range as meal was just a bit uneven, but overall, was a pleasurabl","useful":0,"cool":0},"OtjpdsaRhZmKVjhqa8ah0w":{"text":"Really fancy place well worth the money and servers was phenomenal. definitely will come b","useful":0,"cool":0},"X-4EmMhpzPnyjPqDrfW3Ew":{"text":"For my 1000th review I would like to write about a newly discovered place that I have fall","useful":16,"cool":10},"MdE12DAkHHGkaiO713tCEw":{"text":"Come on - this place is awesome! I can't for the life of me figure out how anyone could po","useful":2,"cool":1},"UQD1klm7VkzOROF8yNmZug":{"text":"I can't praise Coquette enough for accommodating dietary restrictions!  Their website even","useful":0,"cool":0},"KHKj8ZTmR_P90UXLPETHEw":{"text":"The welcome was minimal and the menu was hard to decipher. We sat at the bar because the w","useful":1,"cool":0},"94sRtfKE9zJxbxRetzoAaw":{"text":"Went here last night with a houseguest and I was pleased, although I found it overpriced. ","useful":3,"cool":0},"iez90UYcnIOsSn8suFNgVw":{"text":"We had a really nice time here but it wasn't \"the best\". We did the 5 course blind tasting","useful":0,"cool":0},"z5IEUqQIToS_AbCPg8bB8w":{"text":"Underwhelming entree. Charmed Eggplant. Could have easily been a small plate. Disappointed","useful":1,"cool":0},"VtYsLGi3C4BrXJiy_cAe4w":{"text":"Great ambiance and friendly staff. The place needs a touch of music (after all this is New","useful":1,"cool":0},"WETzCQElnUwLs2FM--Bb9A":{"text":"Let me start off by saying the service is excellent! Bartenders and servers were friendly,","useful":1,"cool":0},"eYSvkboGgug0tJDXvT5fCw":{"text":"So, I have to give this place 5*'s based off of their food, bar tender and the manager. Ha","useful":0,"cool":0},"LaWk1Z8W7r6QgXmGw42tqQ":{"text":"We had a great dining experience at Coquette. Our group of 8 did the tasting menu and ever","useful":0,"cool":0},"gJeaN5x3DNzmqxferi9GXQ":{"text":"Awesome find! We found by accident and loved - great atmosphere and amazing food. We split","useful":0,"cool":0},"THeDCIcIoeP-lHxh9cKzig":{"text":"Go for brunch and don't even bother to look at the menu.  You want the fried chicken.  It'","useful":0,"cool":1},"QBSlkjDX7WPhF8pPF_aQNA":{"text":"This was a memorable dinner - great friendly service, pleasant ambiance, fascinating creat","useful":1,"cool":0},"LPcSARqkFnWs6OYduYMhuw":{"text":"I have nothing but good things to say about this place! Everything from the freshly squeez","useful":4,"cool":2},"Ff_h1Q_5CoOavBGMtc4xyQ":{"text":"The meal was great. Our table was crowded by people at the bar.  Overall we enjoyed Coquet","useful":0,"cool":0},"Tk3qmzI7bUHs5pdsUmDl6A":{"text":"Went here for Brunch Sunday. It was amazing. Great service. The spicy blood Mary and Pimm'","useful":0,"cool":1},"BbdvQIF-jMwtClE055YOIg":{"text":"This place was lovely. I enjoyed the atmosphere, not too loud, small and very romantic. Th","useful":0,"cool":0},"RKQ8VNvVuTQNQqwRXue8RQ":{"text":"beautiful dining room, great friendly service- feels high end white table cloth, but with ","useful":0,"cool":0},"3UJc3_AYLssz6whlEH-3kA":{"text":"My favorite restaurant on our trip. With the changing seasonal menu the choices were limit","useful":0,"cool":0},"ywd-toPrIKYiA0hNa9PACA":{"text":"The Coolinary 3 course lunch was one of the best meals we've had on our honeymoon. The por","useful":1,"cool":0},"4-tVsdzaWSmM_h9dryzwmg":{"text":"Great restaurant off the beaten path from the N.O. tourist scene.  I made reservations aft","useful":0,"cool":0},"gt0KVVE2FzOj4CCMmpUZJg":{"text":"I am not really sure what to say here other than Mike Stoltzfus has really come into his o","useful":0,"cool":0},"FLDNPSh2-IgxmvCeDo_A7g":{"text":"We originally wanted to go to a place a couple doors down on Sunday morning but the wait w","useful":0,"cool":0},"eaLogIZsVx_iSWx29EILrg":{"text":"I've been to New Orleans twice in the past year and have made a point of seeking out some ","useful":1,"cool":0},"H4prSy3qwn8qYiuSMmGpgg":{"text":"Some of the best food I've ever had in my life. CHARMING place !! Love the corner location","useful":0,"cool":0},"3raZiG89m1u2L3c057-KZg":{"text":"Any place that bends over backwards to get me seated, despite lacking a reservation, and t","useful":0,"cool":0},"-KfkuIeATU6SA9wAMg_wMA":{"text":"Anticlimatic....\nI have been trying to get in here for date night for so long that it's po","useful":3,"cool":1},"IZhO5lozt01G81034TKlUg":{"text":"I've been using Yelp for a while but was never compelled to sign up until an amazing Valen","useful":0,"cool":0},"TMNUl-6DJeWqN11EExCDzQ":{"text":"We were a group of four, me and my girlfriend and my friend and his wife. I recommended we","useful":1,"cool":1},"V6W4F9uM7bIGeFjoN5VFlg":{"text":"You must go and do the blind tasting! Would highly suggest doing the wine pairing as well.","useful":0,"cool":0},"_pfsbuEsh20qeurssXmi7g":{"text":"After a few visits, I have to say it seems like you can't go wrong here.  Everything taste","useful":0,"cool":0},"B71Z9OsmUYOuO_8eiNK1QQ":{"text":"Although we weren't sure if we wanted to make the trek from downtown to Coquette for lunch","useful":1,"cool":0},"kK0mSzDnQy7AA4Y3LeuqVw":{"text":"One of the best meals i have ever had! And the atmosphere is fabulous with great service.\n","useful":0,"cool":0},"ZzpN9Mxvj-CHKzU7nH_IYg":{"text":"The food at this place was very sophisticated. The shrimp appetizer was one of the best I ","useful":0,"cool":0},"Oox0pXp8mE65lKvQAfdh1A":{"text":"On a recent vacation to NOLA, had such a great lunch on our first day, we went back!  Thei","useful":0,"cool":0},"vcrZGk2UJLhubTFRRZ7fLw":{"text":"After being a frequent customer, I will never again dine here in my entire life and I will","useful":1,"cool":0},"aLZi-jOAf9qaI4r5N6IvrQ":{"text":"Brunch is amazing here! I wish they would have cappuccinos and such, however they don't. B","useful":0,"cool":0},"Rl3LRNb8BtNc3Xh7Qx5wOg":{"text":"Had their fried chicken with watermelon.  Enjoyed it very much.  The ambiance downstairs i","useful":0,"cool":0},"v1CdRSsS1AxKqV3RGDKoyw":{"text":"Escaped a trade show at the Convention Center during lunchtime. Its a 5 minute cab ride. \n","useful":0,"cool":0},"wCbk-KblqglOgDUIM8N7WQ":{"text":"This is an update to a prior review in which I gave Coquette high marks. Sadly, the servic","useful":1,"cool":0},"z2Cn4eIjO1dKbOr6Cm9UPw":{"text":"My sincerest compliments to the chef and staff. The food and wine were nothing short of di","useful":0,"cool":0},"pwCNK1gnj_8zESOajyGn9A":{"text":"Came here for lunch after a Garden District tour, creepily peeping on famous people (I kno","useful":0,"cool":0},"lfA-vVS3ZpRrkSjxUGZfXg":{"text":"We stopped in for brunch here during a recent NO trip and decided to do the prix fixe in o","useful":0,"cool":0},"4m0dzgQHPUM-kmOhIDO2NA":{"text":"I'm what you might call a veggie foody... I am visiting NOLA from the west coast. I often ","useful":0,"cool":0},"1hJMVycJuUGYw22ymSpoCA":{"text":"decent high-end restaurant.  i've been a couple of times to meet friends who LOVE coquette","useful":0,"cool":0},"40S9RdJ5IB66mKyoqii_EA":{"text":"If were to rank the aspects of my experience at Coquette, from best to worst, it would go:","useful":0,"cool":0},"ihb7K3f0E6idWsmcWeiYLw":{"text":"Excellent restaurant in the Garden District. Very honest, beautiful space and truly a dini","useful":0,"cool":0},"5agWKeSVCTFu3ariRyM2UA":{"text":"Quite possibly the best meal that I've ever had.\n\nEvery item that I tried was expertly pre","useful":1,"cool":0},"T12Q4lXubMpCvbj7XDh1Gw":{"text":"Upside: Food was excellent. \nDown sides: Brunch service took 3 1/2 hours-- that is intoler","useful":2,"cool":0},"ZgbRXSS1-55qhMerP9wbFQ":{"text":"Had an unexpectedly great lunch here. My husband had a burger that he claims was the best ","useful":0,"cool":0},"9i5r7j7djhbOGVIDidrTuQ":{"text":"Aaaaahhhhhhhhh....\n\nEscape to reality...\n\nBig time...\n\nAfter living in Southern California","useful":0,"cool":0},"lUnJ9pV_pYG9U6WuVCdGlA":{"text":"I went here for Valentines Day and had an incredible experience. The atmosphere is absolut","useful":0,"cool":0},"rahshkwnKQCOG2cr_vIOsA":{"text":"My girlfriend and I went here for a late brunch on a hot sunny afternoon. We really enjoye","useful":2,"cool":0},"vo0fDoXaETRuAaQmCrvboA":{"text":"***4.5 stars***\n\nDuring our last trip to New Orleans, we only had one opportunity to go ou","useful":5,"cool":2},"jS3wvKMlwflQAsYrZSZbKQ":{"text":"If there was a word that meant \"better than amazing\" I would use it. The shrimp and grits ","useful":1,"cool":0},"rPsxUj5Fn1QMTwVX5S9IkA":{"text":"AWESOME! It will change your life! THE best restaurant in New Orleans!","useful":0,"cool":1},"7r2WhqotIuIN04mRK4g6ng":{"text":"OK, I am willing to accept a lot for good food, but Coquette pushed the limit too far.  I ","useful":3,"cool":0},"iXALLGHAQLAUM9wVEI-mVA":{"text":"Best 3 course lunch i had in NO. Every course was delicious, a perfect portion size.\nI was","useful":2,"cool":1},"yYhSOQcXSmCu2dA0X6xAng":{"text":"Amazing dinner.  Impeccable service.  Wonderful experience.  After dessert, we wanted to s","useful":0,"cool":0},"XL-ERrMvyO4Ld9OzC5h8eQ":{"text":"Came here for lunch and had the fried chicken plate, which came with deviled eggs, biscuit","useful":1,"cool":0},"QMZ0QKB4DzX0Qnt_quEIfw":{"text":"I enjoyed brunch at Coquette last Sunday, but wish the bartender/server practiced better h","useful":1,"cool":0},"UYUOP5Q7kYVO73f8rqVh0Q":{"text":"This is an attractive restaurant with lots of charm.   The menu is short in length, but th","useful":0,"cool":0},"ZTp9cAsMArggFhRyyTgwgQ":{"text":"Possibly the best meal I've had in New Orleans. After consistently eating Cajun/Creole foo","useful":0,"cool":0},"bo-OiKEqlGjbdB7CfGEPKw":{"text":"This was my favorite meal experience in NOLA. Fantastic service, very gluten-free friendly","useful":0,"cool":0},"WeONpRC-63WTJr24kAOPsg":{"text":"I have been here multiple times and every time the food does not disappoint. Literally eve","useful":0,"cool":0},"vkZm8ARtUhAdQebQEyff5g":{"text":"Went for the 5 course tasting and left full and satisfied, but in no way surprised or blow","useful":0,"cool":0},"1WhnvBX0uvl4Vr5P6a9Utw":{"text":"Croquet...I mean, Coquette, is a nice little departure from the bustle of the French Quart","useful":0,"cool":1},"88Gb4ZAwyxdCrQqeAQ9jHg":{"text":"I love Coquette. I've had 3 meals here, and all have been great. I'd give them 4 stars for","useful":2,"cool":0},"iihDk9fj8sD5Kv2dItwdDA":{"text":"Wow. Service was amazing and food was even better. Great bartender and local cocktails. Ap","useful":0,"cool":0},"IJZrpASpveRG_BZAnP_z3w":{"text":"By far, the BEST meal I've had in New Orleans.  From the homemade bread to the perfectly p","useful":0,"cool":0},"Lsazc5ljWIQwRoOoT3l0Bw":{"text":"disappointing. we live in SF and have tons of really good mid-range restaurants, so we wer","useful":2,"cool":0},"U_s1kM6yer2nFmNeD0QrAw":{"text":"Beautiful, thoughtful, seasonal food, elegantly assembled. Not fussy though fancy. Delicio","useful":1,"cool":0},"VlhTOPS7nkXUesFRlDgLjA":{"text":"The fried chicken was okay. Meat was tender, but they could have used a little more spice ","useful":2,"cool":1},"J0r0OdyWEsOZfZrAoeOA3Q":{"text":"Impeccable service, delicious cuisine, and impressive beverage selection, this restaurant ","useful":0,"cool":0},"tFfoozlhxAT48qZ5J9ClEw":{"text":"Our best meal in NOLA was at Coquette. This was a last minute recommendation from an old f","useful":1,"cool":1},"0nPvqB0yU3ACu8gnFZgoHQ":{"text":"This restaurant is so pretentious. We reserved a table using the open table app, after loo","useful":2,"cool":0},"UNcjcS_g7qN9dUHrivs5zw":{"text":"I recently had friends visit from out of town. They wanted to have a nicer brunch their la","useful":0,"cool":0},"Umy77SrkUgOnqP3iB3omlw":{"text":"The good: great wines and service was attentive and professional. The restaurant has a gre","useful":1,"cool":0},"G7T9H9X8tfn2KT4Moa8q7w":{"text":"Visiting from Minneapolis and just happened to find this place and had an awesome meal.  T","useful":0,"cool":0},"nQb7V-IPykwr0s41dkQ4OA":{"text":"My husband and I came for the 5 course tasting menu and we were completely blown away. Bot","useful":3,"cool":3},"ZQ2gBpSk64H9cYmNti-0vw":{"text":"Just finished our anniversary dinner here and it was fantastic. As a vegan I like to call ","useful":0,"cool":0},"933Vv6A6829Jmc5bFGeGbg":{"text":"The food at Coquette is consistently very good and often dazzling.  The restaurant has a b","useful":1,"cool":0},"Fwo26epZO7_kZwTR1YDlvg":{"text":"Delicious food, good ambience--overall a solid place for flavors. I would highly recommend","useful":1,"cool":1},"mLAAq5lB1O9vPBoi1Ie4xg":{"text":"I ate lunch at Coquette on recommendation from a friend who lives nearby. The interior is ","useful":1,"cool":1},"TCG07xm1xyatc1qn9krPuQ":{"text":"Great local restaurant on Magazine Street in the Garden District. Organic, local food prep","useful":0,"cool":0},"xa4-q8gtQcKq9I2FX88KjQ":{"text":"Absolutely wonderful. A wine list for wine professionals, and a dinner menu that takes go-","useful":0,"cool":0},"GILM1XbpAegLMIjSM0bCTw":{"text":"We came here on Valentine's Day. Not the best timing, but hey, you're supposed to go out a","useful":0,"cool":0},"HikPDVTkbxg3y-uygj-3jg":{"text":"I strongly recommend Coquette's restaurant. The food is quite good. The service is superb.","useful":0,"cool":0},"jMgbuluVjhqc_9Kcafc4YA":{"text":"I was with a great crowd so I'm a little biased, but we had a really good time at  Coquett","useful":1,"cool":0},"loOyIAgNe0nMWBUK6-Q5Cw":{"text":"I dined here on Saturday night. The service was the worst that I have ever experienced fro","useful":1,"cool":0},"i8JXZ6-SHmT2gQk0djqXdg":{"text":"This place is pretty darn dank. Unfortunately the chef polished off my favorite bourbon th","useful":0,"cool":0},"rwQgMfqSXe44zOa33Jk39Q":{"text":"I snagged a reservation for dinner while in town, mainly because of the good reviews and t","useful":1,"cool":1},"ZvGYuK221cG2ynS3ZJ4NDw":{"text":"Smoked trout beignet was similar to a croquette and had a little green sauce of goodness a","useful":2,"cool":1},"bC9Z1T_uIoYV4lN8DlzIXg":{"text":"Fifth and last activity of the day. \n\nThe only difference with the last four activities wa","useful":4,"cool":4},"8ePRgfQNTH5LD-twrSZykg":{"text":"Like many of the other reviews, I was disappointed in the tiny meals they serve for the fa","useful":1,"cool":0},"YSURtDoY96-GoIRF5bLJoQ":{"text":"Consistent!  Whoo-hoo!  I have eaten there twice during FQ Fest visits, once in 2011 and o","useful":0,"cool":0},"QPPLT4Z1VclPHfLE2KtB2Q":{"text":"I am visiting from Chicago and was craving some ice cream. I came into Coquette and was pl","useful":0,"cool":0},"KZRQycBYz_f4ZFLOFinfnA":{"text":"A local favourite of mine! This place never disappoints with there original mouthwatering ","useful":1,"cool":0},"h__qQDZQZmTNgPNdDQRkWw":{"text":"If I could give this place ten stars, I would. My friend promised this is the sort of plac","useful":4,"cool":0},"Y1aupQ8O-or7PEtM9ia5OA":{"text":"It has been several months since I dined here last, so I will refrain from details that mi","useful":0,"cool":0},"kpmJzPXjm9Bu5swcVjaAZA":{"text":"Loved our lunch here after a lackluster start with NOLA food. The prixe fixe menu was supe","useful":1,"cool":2},"xNdgb5ZXYrGbM-W7btMVWA":{"text":"My boyfriend and I came here for dinner one evening.  We heard so many great things about ","useful":0,"cool":0},"E73O1bC6mhJqmOwer1sbOw":{"text":"John L. H., you da man!\n\nAfter reading his 1000th Yelp review, which was dedicated to Coqu","useful":16,"cool":11},"DvIW7jHLXfmlAb0B0s2w1Q":{"text":"We were seated 5 of us at the big round table in front window. Best seat in the house. The","useful":0,"cool":0},"1ovv61aDDCTU53S8TVMufw":{"text":"They don't even deserve one star! I wish there was an option to put negative stars. \n\n***T","useful":7,"cool":0},"y0jyHw1cr2IpDuElnnVPqA":{"text":"Super cute restaurant in a much quieter area from the craziness of Bourbon Street. I was a","useful":3,"cool":3},"bPtOFcdivTe5TzB9ZRE_TA":{"text":"When I stumbled across Coquette in my preliminary research for NOLA restaurants, I was con","useful":0,"cool":0},"6B62uDzCPzEiRycHTExRyQ":{"text":"Great food, great drinks, great service and great ambiance. Highly recommend when in New O","useful":0,"cool":0},"uYoWPr9SmESU-KD8qUmZzg":{"text":"I have been saying \"I really want to go there!\" About  Coquette for years. Finally, I went","useful":7,"cool":7},"aibmwDOrvPEkX0XhjxEZJQ":{"text":"They serve this fried chicken in Heaven! I'm not kidding. 4 of us shared the whole fried c","useful":0,"cool":1},"kOjEuQh-411pYrX6P3-6RQ":{"text":"While the food was amazing, I can't say the same about the service. What a bunch of rude, ","useful":3,"cool":0},"c1uWruf0q0bwfUUmmzbKpg":{"text":"My fiancé and I visited Coquette during our recent trip to New Orleans. Coquette is a beau","useful":1,"cool":1},"AxlpesiRt1h2tC5py69c0w":{"text":"This was the best of many great meals we enjoyed in NOLA!  We did the chef's tasting dinne","useful":1,"cool":0},"kvVwyrXW_6ZUUyovpjjqyg":{"text":"Shout out to Coquette for treating Touro's ICU to the fanciest meal during this pandemic. ","useful":0,"cool":2},"ecH7W1SW4FG35jNcZomsKg":{"text":"Solid bar area with good cocktails in a quaint atmosphere. Only sampled a couple app items","useful":1,"cool":1},"iPMoB2QXVTZ73bQ8snEBlg":{"text":"We did brunch as a larger group; staff was friendly, attentive, and had our table ready on","useful":1,"cool":0},"-Rr8QOo-Np9L4Oj6whcbDg":{"text":"Hands down the most enjoyable meal in NOLA. Charming atmosphere, service was impeccable. O","useful":12,"cool":8},"kHFG6uyE5Zn31ZvUDAb7Lg":{"text":"Wow. Seriously debating whether to go back for a second meal during my brief trip here in ","useful":0,"cool":0},"HHMUWKogGHdVCtpMwkC-NQ":{"text":"Coquette is hands down my favorite restaurant in New Orleans.  Why?  Because the food is j","useful":8,"cool":7},"m-S9v1Y039k5BymtJHHj9g":{"text":"Amazing meal.  Had the five course blind tasting with the wine pairings.  All five courses","useful":2,"cool":1},"iBfu0eVRPx_CYbjk5xwJmw":{"text":"My son and I went Thursday night to celebrate his birthday. The staff brought  us a compli","useful":4,"cool":0},"ORuthempdqgtITmKac1o9A":{"text":"I did a fair amount of research to choose great restaurants for our New Orleans weekend. C","useful":0,"cool":0},"02LLdT5ko8vu7FcvMHZKuQ":{"text":"What can you say about Coquette that is not 100% positive.  The menu changes regularly so ","useful":0,"cool":0},"0fvnbT8e2XhPXj8FTOS3lw":{"text":"Wow. I am so glad that I did not make reservations at another well-known brunch place down","useful":1,"cool":3},"e_DRM3Omhj1epl8-1yit-A":{"text":"I came here with my boyfriend and we had such a great time. The ambience of the dining roo","useful":3,"cool":0},"OCm7LJcndcVBb4EL5SupJQ":{"text":"My friends and I got a recommendation from a shop owner about Coquette's.  We had the 3 co","useful":0,"cool":0},"uvkWevFF320AcWcJoAAGww":{"text":"Excellent restaurant by all measures.  Menu selections are creative and well prepared, wit","useful":1,"cool":0},"4SHZhkFtC0-rShDLiD2m_A":{"text":"What amazing  service and attention to detail! We loved the  choices and the shrimp and gr","useful":1,"cool":1},"Lao2I5i8_LLbIeUj_-vaJw":{"text":"Great uptown vibe.  We had the entire small plates menu for the table.  Everything was gre","useful":1,"cool":0},"ZVEpQblikJucGx5rMox17g":{"text":"An amazing experience.  We made reservations for Friday evening and decided to choose the ","useful":0,"cool":0},"Fbtb_YdzbVsvdCOubmUveg":{"text":"Sometimes I'd like to eat without having to have it political.   Charging a 5% wellness fe","useful":1,"cool":0},"4IOfOz_1sEgpcKNfUhqKuw":{"text":"Another Delicious referral. Who knew catfish purée dip existed and taste yummmy. Simple co","useful":2,"cool":1},"L4LqVz2hKALCFqKMYTytiQ":{"text":"Came here with a group of five and overall everyone liked it. What we ordered:\n\n- APPETIZE","useful":1,"cool":0},"QuVD6iD6y8w19bA6ZUnHEA":{"text":"I have eaten in hundreds of restaurants over the years, some of the highest Zagat rated pl","useful":3,"cool":2},"CDtXm9GPJ4FcIjFUTH2wsw":{"text":"By far my favorite restaurant in New Orleans, and some of the best food I've ever eaten.\nT","useful":12,"cool":11},"ONghFYYVGZzuDjlr6NKuvQ":{"text":"I have been saying \"I really want to go there!\" About  Coquette for years. Finally, I went","useful":1,"cool":2},"fou7_iL4BuQiOiMriGH0ww":{"text":"I heard great things about coquette so we stopped in for an early dinner our first night i","useful":3,"cool":2},"Ea-g-rv9OjmlWn4yPw8CwA":{"text":"For a place who's name means \"little coq\" to me, Coquette sure is ballsy with their flavor","useful":3,"cool":2},"C3Y9VXB2gvM9ARr8f632Pw":{"text":"Absolutely fantastic food and service! This restaurant is a real gem and the food is a cre","useful":0,"cool":0},"CPxOUCFI6tt2to2Dz39sFQ":{"text":"Probably the most memorable dinner in New Orleans during a five day stay. Every dish was s","useful":1,"cool":2},"q9j7RcqqFVN717YXNgNiKA":{"text":"Let me start off by saying the service here is excellent! Bartenders and servers were frie","useful":0,"cool":0},"5LmwvH79QCUoW2ZAxthshg":{"text":"We were in NOLA over the holiday week and picked Coquette as one of our dinner selections.","useful":1,"cool":0},"AoQDmkzbrq88EDBUptImww":{"text":"I selected this restaurant randomly trying to find a reservation and while the menu didn't","useful":1,"cool":0},"UvbB5PMhNw-u1t9R8-chUg":{"text":"Back in May, my friends and I were in Nola for three days before boarding a cruise. We dec","useful":1,"cool":2},"EG3U6qhKQs9HoNDJ8rosgQ":{"text":"Food was subpar. Even when complaining to the waitress nothing was done to rectify the pro","useful":0,"cool":0},"qpaRvD_3XZEhgmB6NN9F_w":{"text":"I have eaten here three times. Lunch on a Saturday was divine. Dinner was the second best ","useful":2,"cool":0},"QzrLUZDBYDKm9MbZT2HMjg":{"text":"Never got a chance to eat here, but judging from the haughty hostess greeting prospective ","useful":2,"cool":0},"mloeJJVHYDz5PJ5mhvt4Rg":{"text":"The best meal of my life!  I had the blind taste menu with wine pairing. Service was perfe","useful":0,"cool":0},"yI3_OEq3zlXdmdSDhdzS8A":{"text":"Juste go there.\nWorst case scenario it is very good.\nIf not it is very good, it is delicio","useful":0,"cool":0},"yoXrqM4P1HSZ-oWNjF0RyQ":{"text":"Great staff and service, came for brunch without reservation and they happily fit me and m","useful":0,"cool":0},"I-yX9sm5Q7gLIQOIdqxy3w":{"text":"Had the \"Springtime in Paris\" takeout. It was heartwarming and delicious. The narrative th","useful":1,"cool":1},"nYkKXHmb4d7lN-x5WRgFUQ":{"text":"Really disappointed in my experience here. Service was painstakingly slow. Was told we'd b","useful":0,"cool":0},"gWTQ5jRMe8emLEqG6NRjOw":{"text":"This might be may favorite place to eat in New Orleans (which is saying a lot). We went on","useful":1,"cool":0},"YRjLYIrfT5rsIlniwj866g":{"text":"I've had some good meals in NOLA, but this was the best. All 5 at our table devoured our m","useful":0,"cool":0},"ztJSg8JScUyWWxDf6n5Hyw":{"text":"Hands down - my new favorite restaurant. \n\nMy fave has been L'etoille in Madison, Wisconsi","useful":1,"cool":0},"CVhP9cvqPknDthm5_a-eBA":{"text":"I went for the no menu Tuesdays last night and it was absolutely amazing! For those of you","useful":1,"cool":1},"tT_qhAaVnWv9QELujREtEQ":{"text":"Just came in for a cocktail. One cocktail on the menu was...gulp...$17. Really?\nWe ask the","useful":1,"cool":1},"q5O3pZ-dzJxdP22gyLPrew":{"text":"I had brunch with some friends at Coquette. The place is consistently wonderful. The resta","useful":2,"cool":0},"1Yv0YJMa05lkbBfczRqJMQ":{"text":"Coquette has long been on my list of places to try when in NOLA. So on a recent visit, I m","useful":1,"cool":1},"5MFuRx5wo8-6NyDS1PGgDA":{"text":"Wow. I ate here over the weekend and it was phenomenal. If you have 1 takeaway from my rev","useful":2,"cool":2},"2lJYbhwhe_AFMJ5Dwhy6Iw":{"text":"This is the star of uptown. Staff is great and the food is innovative and approachable. Th","useful":0,"cool":0},"AZCdVAXnoanKKAI45oG3BQ":{"text":"We ate at Coquette last night.  We were not in love with the menu at first glance (limited","useful":1,"cool":0},"RgvcdvwJTZb2UToBx51PiA":{"text":"There aren't enough adjectives for perfect to describe the cuisine at Coquette. The menu c","useful":2,"cool":2},"PXQH6-YrU4kfQ-mbjsuh9Q":{"text":"Go for the tasting menu! It was delicious surprise after delicious surprise. Great service","useful":0,"cool":0},"f_Z2dfHJGA3VJWfsxV7GZA":{"text":"MY FAVORITE RESTAURANT OF THE 150 THAT I TRIED IN 2013!\n\nCAT TOY: from the moment I sat do","useful":9,"cool":4},"5p3RIl6fYOso-mE_Xd548w":{"text":"OMG !!! This food is seriously delicious ! The hush puppies with pimento cheese was the Be","useful":0,"cool":0},"Abi-azkTTk6dufV90p7fyA":{"text":"PROs: Great ambience. Beef short rib & dirty martinis were phenom. I actually wanted the f","useful":0,"cool":0},"UscBLSzc1VG1YIuhM-3pJg":{"text":"Very nice! My husband and I had an intimate dinner and we were given champagne for our ann","useful":0,"cool":0},"WrPIz2avN9zzM4clqNL3hw":{"text":"Love the upstairs dining, wine selection and cocktails are always superb ! And the locatio","useful":0,"cool":0},"xgyg2YMy6VeviTtUsQJviQ":{"text":"I had a great meal here for the first time. I made a reservation for one at the bar. It's ","useful":4,"cool":0},"7pwmiI4So4C1OtBAVVdvUQ":{"text":"Everything was delicious. We went for a date night and chose the course tasting with wine ","useful":0,"cool":0},"nSmvz7UT7kvFXzNYZGb3Qg":{"text":"Came here based on reviews and had the best fried chicken meal I could possibly imagine un","useful":0,"cool":0},"rwswDcJ2uQ4V2m8QlkGifA":{"text":"This place blew me away. Each dish we had was so creative, unique, thoughtful, and balance","useful":0,"cool":0},"kLd4cfDTZ34Tz-u5J1kL6g":{"text":"I am in love with Coquette.  With a handful of exceptions, the best dining experiences are","useful":11,"cool":11},"6gWEnDaWqMrDBCUOZpFQiw":{"text":"My husband and I made plans for Commanders Palace, but didn't realize/know we needed to ma","useful":0,"cool":0},"KThrBmJNzfUtS1kFYesZSQ":{"text":"Sadly, you are unable to dine here unless you are v'd. Although the city states a neg test","useful":1,"cool":0},"XiAdsCKTWZy4c4A0Rheo_g":{"text":"Friendly, casual and impeccable wait staff. Excellent food. Good vegetarian entree chose f","useful":0,"cool":0},"b5PxdeXVKtszhGNrhyVDdA":{"text":"Coquette provided me and my wife with one of the best meals of the year... we were very im","useful":1,"cool":1},"LlGggpFQEc7_qaHYfqemJg":{"text":"changing menu with snacks, small and larger plates, cool interior \ncornmeal fried oysters ","useful":2,"cool":1},"cPwpkmfFRzJVMftYMQe-LA":{"text":"Visited this place on a Monday around 8:30pm. We had a reservation so we were seated right","useful":2,"cool":0},"5WCkT3a-ScKFFwLrtrwRfw":{"text":"Recommended by several wine professionals we've met.\n\nDid NOT disappoint. \n\nA FINE WINE AN","useful":5,"cool":1},"Rz8QXpgmdEiC5hvmDTbufQ":{"text":"I made reservations here on a Friday night and made a request to sit at the bar they happi","useful":1,"cool":1},"Mht9t-NILawhY93OFG3_Cg":{"text":"Drinks and food are amazing!! We did the five course menu/blin where they chose everything","useful":1,"cool":1},"e11yGqis9k3JQLhSg6RTMw":{"text":"Excellent work in the kitchen. Awesome sweet potatoes! Every dish elevated its ingredients","useful":0,"cool":0},"YorfcEc88uad5DUgNGelJQ":{"text":"Coquette has been on my short list for awhile, so was glad to finally make it in for dinne","useful":2,"cool":2},"Poo7G94Lt5ZSPjjLKPkvCw":{"text":"Don't eat here if you're a younger person. I came here expecting to have a nice date night","useful":2,"cool":0},"JyyDS5uzkRrr_EKPfK7Zkg":{"text":"Coquette has become the first place that I eat at in New Orleans, every trip. The menu has","useful":10,"cool":7},"0x0VlZya0Mki51WcGAEm9Q":{"text":"Each year we look forward to the NOWFE Vintner Dinners.  This year we decided we would do ","useful":2,"cool":2},"JY3eXXiPIafStLoj6Ttzag":{"text":"The restaurant charges you an extra 5% of your bill to cover for employees insurance and p","useful":2,"cool":0},"L-HrZcm4qh1kAEpkdUlF7Q":{"text":"I FEEL LIKE SOMEBODY SHOT MY DOG.\nLast night at Coquette I had the rudest service, more so","useful":14,"cool":4},"sz8-T0hjRtbo5kLEwaiaog":{"text":"I walked into Coquette, and having made a reservation ahead of time (something that seems ","useful":10,"cool":3},"ng77jEuokMfDC8cMtJ_8EQ":{"text":"Decided to do the tasting menu for $65 for 5 blind tastings. The food was good but we were","useful":3,"cool":2},"NmrW6ssLHOaCwCownMnXEQ":{"text":"We had reservations for 16 people, so they seated us upstairs.  We basically had a private","useful":1,"cool":0},"g_xyNPopPPKRTrDwEI5PDQ":{"text":"Some things are well executed here and some just aren't. I've been twice and had to send f","useful":2,"cool":0},"8V1GI1XG6Xs9lokvuj-eVQ":{"text":"Went on a Friday night, elegant restaurant. Great selection of cocktails, the mezcal and b","useful":1,"cool":1},"kpcRY5D7sZtxgTx5iCIIKQ":{"text":"A real great ambience to set for a relaxing evening. Starting with the bar, I discovered o","useful":1,"cool":1},"4C99_rR7YJk--KUitFDC8A":{"text":"I have been twice and both times were for their \"No Menu Tuesday\" that they do in the summ","useful":1,"cool":0},"FweCBg6yyknxdIwsY1oIsw":{"text":"We had the 5-course meal listed on the menu. the ambiance of the restaurant is lovely, the","useful":4,"cool":2},"x3WzwpRqJMwm3xbuEqHQug":{"text":"We had lunch for 2 there  last Wednesday.  The food and service were wonderful. We had the","useful":0,"cool":0},"NCnDWXAe8ySYPNmAdR5BZQ":{"text":"The meal at Coquette was exceptional.  Prices are a little high, but you are paying for hi","useful":1,"cool":1},"tfJ27QyviYexo5hS0fLD8w":{"text":"It was good! However, don't go when you're hangry it took us more than 20 mins to order dr","useful":1,"cool":1},"DpRsPZxCI7stDk3g0-QwNw":{"text":"This place is AWESOME! We've been a few times for cocktails and/or brunch- But for our fir","useful":0,"cool":0},"duQuSjxGj8mneAyM3Fdc8w":{"text":"It's nice to come back to a restaurant that, year after year, keeps setting the highest ba","useful":10,"cool":9},"ctpmcssBp0h91zpjEH3ZyQ":{"text":"Pretentious, overpriced douchebaggyness, with a very limited menu. Save yourself some cash","useful":0,"cool":0},"wMyHtiYLg-nyimF9Xt_nyQ":{"text":"Food: 2/5\nService: 5/5\nAtmosphere: 4/5\nDrinks: 5/5\nValue: 1/5\n\nMaybe I shouldn't have gone","useful":1,"cool":0},"aEfItSimJ3BPYmPJsktCDw":{"text":"3.5 solid. I wanted to love this place but it let me down. We ordered the fried chicken an","useful":3,"cool":1},"zMJuOc_YCcoMZNell59R_Q":{"text":"Coquette is an absolute gem of a restaurant and it definitely deserves all the hype that p","useful":2,"cool":1},"2IJu1qT_2MVKtRmZvEyi4Q":{"text":"So disappointing... We ate here about two years ago and it was very good. However, the men","useful":1,"cool":0}}