{"OPLGkhlEeT5IHrFUlLIIfw":{"text":"The place to go in New Orleans. If you like live music, don't waste your time anywhere els","useful":1,"cool":0},"Uo6_eCEC3Te5bDo13jJthQ":{"text":"Frenchmen Street is one of the greatest places on earth.  Bourbon St is a joke - explore t","useful":2,"cool":1},"UorXdlYYNCtJu6Ykx4K85A":{"text":"This is such an awesome place! Live music is alive and popping in this area. You can go fr","useful":0,"cool":0},"WYraOoWUWa5hKfFfbZXQuQ":{"text":"I loved Frenchman Street for the music and the bar scene. Most places on Frenchman charge ","useful":0,"cool":0},"gh96RCYfaLidwtBFiPHbbQ":{"text":"One of the BEST PLACES ON EARTH!\n\nWant music, restaurants, a cool record store and just gr","useful":1,"cool":2},"pxu2aZqP3kjpA5m2FaI2ug":{"text":"A must do if you enjoy & appreciate the passion, variety, and eclectic spice of nightlife.","useful":0,"cool":3},"zRD6Lpi1gv7lu-o0Q_BwGA":{"text":"We Yelpers and locals have been telling people to skip Bourbon and head to Frenchman for y","useful":3,"cool":1},"NOwQetSagQeIs0pWzVGuog":{"text":"Laissez les bon temps roulette cher! I loved this street. Albeit there was a minor alterca","useful":0,"cool":0},"auceSviO7aNOlqr08M9Fww":{"text":"We found out too late about Frenchmen Street.  The front desk at our hotel said the best t","useful":4,"cool":2},"Px8PXHyzfQu4UktdgRzGSA":{"text":"La rue est très animée, il y a de nombreux clubs de jazz qui vous permettront de profiter ","useful":0,"cool":0},"ZgOPcL5HIiWTAdOdjTm2SQ":{"text":"I had never heard of the Frenchmen district before this past weekend. Every other trip to ","useful":3,"cool":0},"zk_RHO4GuAw58y8SiR47cA":{"text":"This review is for halloween night only.  I had heard from several former residents of new","useful":0,"cool":0},"UNTobZsP89GcLeJ4THmdjw":{"text":"Walking on our way to Frenchman Street, we passed by a group of young twenty somethings, a","useful":9,"cool":6},"ZV1Qsq91puKQYXwFwRZxyQ":{"text":"This is my favorite part of NO. Friends and I stay at the corner of Frenchmen @ Decatur ev","useful":0,"cool":0},"LkXkvJZnhgT8N5LsrPoT9Q":{"text":"Best Part of New Orleans (in my opinion). \n\nMusic EVERYWHERE. Every bar, on the street cor","useful":3,"cool":3},"Oh-6AkLTpFj25JJQOAN3Sw":{"text":"Great place to mingle and bar crawl listening to the various bands. Some places have a cov","useful":1,"cool":1},"fZUB0ELMT7Z41KYRmEPe0A":{"text":"If I could give it a gazilion starts I would! Best place to hear local hip music! You can ","useful":1,"cool":0},"HW_hNB3AarALfFmicRkqTQ":{"text":"I went with a local and she brought me here for the music and the cute little artsy crafty","useful":2,"cool":2},"PeIT3nyBN1qpVsF_h9M3rQ":{"text":"Once upon a time the locals that complained about Bourbon St being too filled with tourist","useful":3,"cool":0},"xnaAPVmqnHH6Z_qisLX1mA":{"text":"My girlfriend and I just visited New Orleans and it was a blast. If you're single looking ","useful":2,"cool":2},"NqjupsqYfkN8nzOeLKGxhA":{"text":"This used to be where the locals went to enjoy live local music but the tourists have defi","useful":4,"cool":2},"G75msXh5M4wjhy-uCKVsbw":{"text":"Frenchmen was fantastic for wandering in and out of bars with relative ease compared to th","useful":0,"cool":0},"3g1FZGAuDKG7cCyOYB66Zg":{"text":"La Frenchmen Street a été le lieu de plusieurs de nos soirées, facile de s'y rendre et d'e","useful":0,"cool":0},"NUmhn3j3osVVYQRRJgndRQ":{"text":"If all you know about New Orleans is Bourbon Street, French Quarters, and Girls Gone Wild,","useful":6,"cool":5},"kXmvFfWKtvnnGzcN6JfG1A":{"text":"Frenchmen Street is the place to be Thursday-Saturday evenings.  There are lots of options","useful":1,"cool":0},"F1ZzvY38Jl-Y0yVXkjN3KQ":{"text":"Everyone kept saying go to frenchman street for music and dinner, but the area was very sh","useful":1,"cool":0},"34iUqsChMbeDtPrBYqaGwg":{"text":"Tired of the stupidness of Bourbon Street. You must then head over here, just off the Fren","useful":0,"cool":0},"XCQ-uH8Vmj3KkYlKq6WiFg":{"text":"I am in love with this place! I wish I had a street like this back in Boston. Jazz music e","useful":1,"cool":0},"tnyV4Keh2nuwNhVZ-x9REw":{"text":"I guess I am in the minority...we found this street tired and dirty....not much was happen","useful":1,"cool":0},"3O5kyVHHfo0dGfodCy2Teg":{"text":"When it comes to cool streets with lots going on, this one is at the top of the list.  One","useful":5,"cool":6},"lYbLCt00w3wk4ah7Jxk9Gw":{"text":"Frenchman is the go to place to see live music in New Orleans.  If you are visiting and do","useful":5,"cool":0},"soAkL8qNtyUD8rmycKfsxg":{"text":"This area of NOLA was much preferred over the tacky French Quarter. The music was great an","useful":1,"cool":1},"ZtbE9qAaSF9EPKOUkozaeA":{"text":"Best part of NOLA. Tons of folk art (thats reasonably priced) musicians and a nice garden ","useful":0,"cool":0},"7yWRrvekBF-UplKcbZMJ1g":{"text":"Since I am still working my way slow and steady through recent vacation reviews, I am dedi","useful":5,"cool":3},"Epq717ZaieGYAjl3ohW3CQ":{"text":"If you think you've heard good music and haven't ever traveled to Frenchman Street, you ar","useful":3,"cool":4},"4DAXdNmD9EUp4m_IDdLGjA":{"text":"We came to New Orleans for our honeymoon, and our 2 favorite nights were spent listening t","useful":2,"cool":1},"O98yP3NofvxMWUtwaxZrFQ":{"text":"Very fun, active bar and music scene!\n\nThere is live music streaming out of every bar and ","useful":0,"cool":1},"z-DGEtZ2l8sPjOUp0ldziA":{"text":"If your in NOLA for music, you'll want to explore these few blocks on Frenchman sometime b","useful":0,"cool":0},"aHsuAIO5ZWErIJENGEPtxg":{"text":"Wow. Cool. You can seriously review this unique little area?\n\nThis is where all of the art","useful":7,"cool":5},"SOcn5zxQ3l-L7h83kErKLA":{"text":"I love this street. If the raucous drunkfest on Bourbon street isn't your thing check out ","useful":5,"cool":1},"1USkJ6wbevoOXyp-MJ27cg":{"text":"Its a great place to hang out and listen to local music from local bands and local artists","useful":1,"cool":0},"Z0zeK7JNchgL73o5XQpfGA":{"text":"161. Visit Frenchmen if you want to:\n\na) get away from the drunks\nb) hang with the locals\n","useful":5,"cool":3},"hnebxhQwvYJkFpnLqX6bqQ":{"text":"I heard from all the guides and locals how amazing Frenchmen Street was, so I went to chec","useful":0,"cool":0},"UE7A72xLJ8tRDQQMOH1s6Q":{"text":"Free. Fun. The brass band was awesome. I danced my shoes off. People were friendly. Traffi","useful":1,"cool":0},"0sQj2p9dD6R_fxEVCDiogQ":{"text":"Frenchmen is my go-to for going out in NOLA. Whether or not you're looking to dance, you'l","useful":1,"cool":1},"SMtReLrGHZrhKFHVnxF45A":{"text":"\"Hang out with the locals, not the yokels\" From  Trip Advisor.\nhttp://www.tripadvisor.com/","useful":7,"cool":6},"JhGaab2OrVhu1SyMYL1gYg":{"text":"We caught a cab over to Frenchmen after spending a few hours on Bourbon. It was filled wit","useful":0,"cool":0},"qBBQ56XKzbSBOgWg41WrcA":{"text":"The best place in town to visit for music. It has many venues close together with great mu","useful":0,"cool":0},"By6THkuA5x73_NYP2XiZsA":{"text":"I have procrastinated long enough, it is time for my 100'th review. And with such a milest","useful":17,"cool":15},"09uhMxcPvRS40zSnacf-jg":{"text":"We took a night off from the usual Bourbon Street nightlife...and SO GLAD WE DID!!!  Frenc","useful":0,"cool":0},"_ahOhU1WS6oOE2Kk1w0zTQ":{"text":"Oh. My. Gosh. \n\nFrenchmen Street is what I imagined New Orleans nightlife would be! It sur","useful":4,"cool":4},"rGHfgwLoxk9RJPPhmco0dw":{"text":"OK, I dig dive bars and Frenchmen St is packed chock-full of dive bars.\nIt's part dirty-un","useful":0,"cool":0},"tYz88QR_RQQ1VNTq-hBpyw":{"text":"We totally ended up here on a fluke. Our taxi driver, who was literally brand new on the j","useful":2,"cool":1},"7i6D-OI2YDDVfBnoZT7Cvw":{"text":"If you're not quite up for the mayhem of Bourbon Street, head to the Marigny for a bit mor","useful":2,"cool":3},"YIaW9ZWLilSkGqb_L8NQCQ":{"text":"This is where most of the live music has relocated from Bourbon street.  It generally smel","useful":6,"cool":2},"P85NrZtkvL_7HTbf7v2xaQ":{"text":"I really wish I were 20 years younger and lived here....\n\nMusic, good food, music, cool ba","useful":0,"cool":0},"12_581TK-QGegSb4aBpc4g":{"text":"This place is always insane, but in a good way. It's a little more civilized than the full","useful":0,"cool":0},"fT0x5ZzvVWwQxPha0Z3_Jw":{"text":"Screw Bourbon Street that's for the kiddies having their first beer acting stupid, skip th","useful":2,"cool":2},"w2HlicCvUa4nGNDfqFXuuA":{"text":"Frenchmen street is great because there's a slew of bars and restaurants, often with live ","useful":1,"cool":0},"NjLK5rNqeavzibSxWqtbZA":{"text":"This is a great spot to catch live music. It is much less crowded than the French Quarter ","useful":1,"cool":0},"VnWUiAurVTSUJaWgVBfCqg":{"text":"We stayed at a hotel in the French Quarter. It was great being able to walk here at night ","useful":0,"cool":0},"UUN-8Rt6cObfmPDBM-AR5Q":{"text":"Frenchmen Street is no longer a hidden secret but I'm okay with that. At the end of the ni","useful":4,"cool":1},"kiicmO7YAbQM1irtTqK2Mw":{"text":"I took a quick walk along the Frenchmen Street Corridor in the daytime since I'm not into ","useful":1,"cool":0},"sqVNlnuR2PXYZXeJVZK0GA":{"text":"2.5 stars overall-\n\nI have mixed feelings about this review because I do really like Frenc","useful":1,"cool":0},"KpwVhPDvazkDwnJ1ingcdQ":{"text":"Love!! Unlike Bourbon Street, this area is more for the grown folks. There are restaurants","useful":7,"cool":2},"-CYp--GuIqSNKet6u6BkoA":{"text":"Just walk over there at night and you'll know what to do. It's the best place to see live ","useful":0,"cool":1},"KrA_RaQ4XMZZQNPcmPJ6OQ":{"text":"While Bourbon Street is for tourists and outsiders, Frenchmen Street is for locals! Or at ","useful":13,"cool":6},"UoaYfWMfYliITz27GLV4Bw":{"text":"Just as New Orleans begins to lose its luster as you head East, this street lights up your","useful":0,"cool":0},"i1PaczMFu1RNfaxbVp1aaA":{"text":"I was actually a bit disappointed with the music offerings on Frenchmen street when I visi","useful":7,"cool":3},"BNq46TPlMC2cfzkNq105bg":{"text":"Its\nBetter\nThan Bourbon\nStreet. Music is\nGreat but expect crowds in many small bars.","useful":1,"cool":0},"Hv1dw1cAYyLDqMEor6_9HA":{"text":"If you want an actual local experience, avoid Bourbon Street altogether and visit Frenchma","useful":1,"cool":1},"JYH5np89iS5PuwBrf0ASfA":{"text":"Frenchman Street is a wild jazz band habitat. Be careful if you go - you may be subjected ","useful":2,"cool":3},"GM346MdbcllT_VJaHLbLMw":{"text":"My favorite place in New Orleans!! Absolutely wonderful music---of all kinds. Damn good mu","useful":1,"cool":0},"8sf2p03hRzhc_YXZF36oVw":{"text":"Holy crap. So damn cool. We stumbled onto Frenchmen Street in search of good food, and hol","useful":1,"cool":0},"L0hYE0ll8AeUN5vZ2Ag64g":{"text":"A stroll down Frenchmen is amazing. Beats all the rowdy, dirty Bourbon street. Great music","useful":0,"cool":0},"O8JqLfNvWc6J48dl_UM2Hg":{"text":"Yeah so I'm sold. \n\nI love New Orleans. And I love tourism & the money generated for the c","useful":9,"cool":5},"_MW4uZ4qMKR4_en2U2rSJg":{"text":"I've worked on Frenchmen St. for 18 years.  Snug Harbor is the best music going on the str","useful":9,"cool":1},"nMB6_jU-ItBM6nXhLtivpg":{"text":"Everyone says \"go to Frenchman street! Great music! Great fun!\" and somehow we must have j","useful":11,"cool":4},"D1j0P83XJzSYiKJ2KSMgVQ":{"text":"Small area with lots of locals that make it feel like home.  Great food choices, incredibl","useful":0,"cool":0},"HAdDWNW-S0Ot7jMyczasMQ":{"text":"This is the Bourbon St for older people but still full of drunken tourists - didn't stay t","useful":1,"cool":0},"XaglB3YQYayi7cUPWtYtVQ":{"text":"Shorter than I thought and really just a couple of blocks. Some describe it as a smaller v","useful":1,"cool":1},"9WkHaUSeRzo-pepJGn_4Ig":{"text":"Although Bourbon street is good for people watching and is very entertaining. Frenchmen st","useful":3,"cool":5},"TmBzyCuVOWHJPoNfdSoLDg":{"text":"Great to people watch and sample a variety of bar action/cuisine.  Strangely, enough my fi","useful":7,"cool":3},"4mQaLYrBFc12Kr2IDbXieQ":{"text":"This place is lit. Very small area of pubs and party animals but still worth visiting. Gre","useful":5,"cool":4},"hFQSWTIxD-z0mJiPBkwq4w":{"text":"A whole strip of local and live music- Jazz galore!\nLiterally everyone we came across had ","useful":3,"cool":2},"pLm9lcoOzlpHmmKkV-TNTw":{"text":"If your idea of a fun bar crawl is something just a tiny step above Bourbon Street, you mi","useful":1,"cool":1},"jVf2J6x6FgGPiriWbH1B_g":{"text":"Yep, agree with the rest of the reviews, Frenchmen St over Bourbon St any day!","useful":0,"cool":0},"WzWfdj8hu5JOZP5uRMVk6w":{"text":"We decided to take a trip to NOLA at Christmas.  One of those days I decided to leave my h","useful":0,"cool":0},"AK105Qc92SQ22j39h8DaVg":{"text":"We all know about bar hopping on Bourbon Street with the drunken masses!\n\nBut where things","useful":23,"cool":24},"aMQj8ULgVUEpXyB0JNObgw":{"text":"We spent the better part of a late afternoon and on into the evening bar hopping on French","useful":5,"cool":7},"oaKFm8AQTAiIcb6yC2WH9A":{"text":"I have a dark sense of humor so I get a kick out of watching tourists try to find a place ","useful":1,"cool":3},"MV2HCDO9jh0flTAh0lIQjQ":{"text":"Good bye Bourbon Street, HELLO Frenchmen Steet!!!  Yes!  Another lively party in NOLA (vis","useful":1,"cool":0},"dum75skFkBqSTREtTgVfTA":{"text":"You must visit this district if you're  interesting in local restaurants, bars, music and ","useful":3,"cool":1},"e1QiF6qpBTEoY9CvZ78WtA":{"text":"Like many Yelpers have already mentioned, Frenchmen Street Corridor is truly where it's at","useful":3,"cool":1},"ZO0Ni_zL2jtfxwTJAR_AOw":{"text":"Ventured to Frenchman street on our last night in New Orleans and I'm sooo bummed that we ","useful":9,"cool":9},"sqHIlHfcUbRKbSA9DO5kyA":{"text":"Wonderful street full of bars, live music, and perfect late night food options. This is a ","useful":1,"cool":1},"2FnCBFvUxSx3WocaXdlnlg":{"text":"Frenchmen Street, famous for live jazz any given night! It's a most chill part of the Fren","useful":1,"cool":0},"dtG5RKYHF5DeY-Ch64AjiA":{"text":"I am going to go against the general consensus and say that I think the Frenchmen Street C","useful":30,"cool":10},"oiw4u9aBIy8USXUwM-Lrag":{"text":"I am 45% sure I'm reviewing the art alley across from DBA.  If this is the case, I enjoyed","useful":1,"cool":0},"sDcmWi9l6u8-1wYHEUcQxA":{"text":"Frenchmen Street is significantly better than Bourbon Street. Both offer live music, drink","useful":8,"cool":3},"24MhZIUVguTDEr3pBtZmUw":{"text":"This is a crazy place to have a great meal with friends and family! Then go from vendor to","useful":7,"cool":9},"m6rddgRPgMLaCW86MleBIw":{"text":"Ah-mazing!  We heard Frenchmen Street is where the locals hang out, so we gave it a shot. ","useful":6,"cool":1},"Y3laflBfgAHKCKsWAypKgA":{"text":"Rocks. The place to come in NOLA. So many bars with so much great music. Just go, walk dow","useful":0,"cool":0},"WD389pVUUraGMUQ2yifumw":{"text":"Recommended by a local friend. Seems like a fun place to go for music and drinks without t","useful":2,"cool":0},"vMfBiUq3OqhD2TQ0x4tZVw":{"text":"My friend described Frenchmen Street as \"if Tucson, Arizona and Denver, Colorado had a cut","useful":1,"cool":1},"lk2fLWoNtHA1vfjSboPJeg":{"text":"Unfortunately Frenchman St.was pretty much shut down on our most recent trip to New Orlean","useful":19,"cool":15},"dGmjKLqio_T-sL-sQw_Zdw":{"text":"The eastern border of the French Quarter, these few blocks are packed with a variety of re","useful":16,"cool":16},"TTxUltb10bWLhiA3iAG2MA":{"text":"As a disclaimer: I visited in early to mid-November in 2021 - depending on when you go, yo","useful":1,"cool":1},"N6Lv_raCPPAULHPQ3s6-Hg":{"text":"We visited Frenchmen Street when we visited New Orleans in Jan 2017.  The street is locate","useful":0,"cool":2},"mq7_I9Zr1uo8HIut014NlA":{"text":"~~~~~~Frenchmen Street~~~~~~\n~~Where The Locals Hang Out~~\n~~Where The REAL Party's At~~\n\n","useful":22,"cool":21}}