{"yn60fs8YxI5DaWSD9qCfQA":{"text":"Our favorite gym in New Orleans.  Clean, beautiful and run by the sweetest owners Sacha an","useful":0,"cool":2},"LBWZhotHQu2i9iut6NATUw":{"text":"I met both the owners who are super nice and kind. I honestly came into New Orleans expect","useful":0,"cool":0},"GjExDkg_i4_aZwyNnybMmg":{"text":"Prime Fitness Rx is the best gym in the New Orleans area.  If you have been going to gyms ","useful":4,"cool":4},"FyRTXR8hOJQC3L0U80Yyxg":{"text":"I highly recommend this gym. The owners are super nice and inviting. The equipment is more","useful":3,"cool":1},"dzIN4ZGAulrlVQYy8oAM3w":{"text":"Mark and Sacha are the bomb! This is an owner run gym by a couple who are fantastic traine","useful":3,"cool":2},"9tC0WYlLJF_sPrMQWFq7jQ":{"text":"This place is superb and my trainer Sacha, has changed my life. I decided in Jan. that I n","useful":0,"cool":1},"NjIkw_051qRzmdzrHfopiw":{"text":"Awesome gym with everything you'd need to to catch a killer workout. Mark the owner is awe","useful":2,"cool":1},"6J0yJkqetheK09BXNwE88Q":{"text":"Great Boutique Gym near the busy district. They had everything I needed to get a good work","useful":0,"cool":1},"0UMINnk0tq3tOl3R92OB7A":{"text":"The Gym is perfect for the neighborhood. It has a hip yet funky vibe. Outstanding state of","useful":3,"cool":2},"rWK5gqf5eiqxIqpaMcbSoA":{"text":"No idea about the gym, but the owner Mark Owens stopped to help a bunch of misdirected tou","useful":0,"cool":2},"9MMF94GBMOd7eiAM1yhD1Q":{"text":"It is so nice to see business owners who are really passionate and care about their produc","useful":0,"cool":0},"j7_-rLMaJZDIZ7s9UP580Q":{"text":"I was here for vacation and went here for a day.  The owner is so amazing and professional","useful":2,"cool":2},"KCrPudNmYa_75IPNS0iJRA":{"text":"Worked out here a couple days while vacationing. Was very impressed with all the equipment","useful":4,"cool":2},"e5Va_M_4ExQAWUGVkD-U_A":{"text":"Highly recommend! I've tried CrossFit and others to no avail. This is the first place wher","useful":4,"cool":2},"AfCR97X3W1jXQ2hKAgRobA":{"text":"Prime Fitness is the gym for me!  Clean, expertly run gym with top notch equipment.  The o","useful":2,"cool":1},"M2wp5QOI2jCe4pnBMqeB1g":{"text":"Great gym, all the equipment you need for a killer workout including free weights and a sq","useful":7,"cool":7},"WVeMnDmgjKsGulHRnQc3Xw":{"text":"Prime Fitness RX is more than a gym, it's a tight knit group of like minded individuals I ","useful":3,"cool":2},"OdYtku9cZFosvM_JMGVSGQ":{"text":"I have been with this location since opening. Great , new equipment and goes beyond with t","useful":0,"cool":0},"p-c_r_BH9GXlEhLHTETjrg":{"text":"This gym has the worse service ever. My Boyfriend and I called someone to open the door fo","useful":5,"cool":0},"zymz1AcYPjSop6of3rpoJg":{"text":"I did research for a long while before committing to the lifestyle change I desired, and I","useful":0,"cool":0},"NwXGPbO0gaXGmEU7zF5qIg":{"text":"Great gym. Came in and it was completely empty so I put on my own music. Owner came back a","useful":6,"cool":1},"mKIx0IecYpMuJ6BF7U_N_g":{"text":"I live in the neighborhood and stopped In because I needed to lose the post baby weight. I","useful":2,"cool":1},"3wXsyxc_cIp8U4MzNilxNw":{"text":"Great place to work out with trainers who care. I highly recommend it to anyone who works ","useful":3,"cool":2},"HFgp1aorj0S9KbrIKQoqWg":{"text":"I was trained by Mark Owens for the better part of four years, first at my home and then e","useful":3,"cool":2},"-1QX4zIbAYlNlUPoYoa-LQ":{"text":"The staff here are rude and totally unprofessional.  Recommend u stay away.  \n\nI was visit","useful":0,"cool":0},"LUwDvOKYgAtfNtmfmt_DqA":{"text":"The staff is super friendly and knowledgeable. The gym is clean and very up kept. Parking ","useful":0,"cool":0},"f9COOFmr9qxKITjWU6nhDQ":{"text":"The owner is a complete and total jerk \nHe acted incredibly Inconvenienced when we tried t","useful":3,"cool":0},"ztlGjr-x4_Pul7c3FPjUqg":{"text":"Even in a city of soulful sin, where there are no limits to delectable indulgence, there i","useful":5,"cool":3},"cEwHLLC_-w4dQ9KlMYcRoA":{"text":"Owners Mark and Sacha are awesome trainers and people. They give great nutrition and worko","useful":4,"cool":2},"Yekv8NwOsyKTi5BCUhglWQ":{"text":"This place is incredible. I love the location, the staff and owners are amazing, and the f","useful":1,"cool":1},"Nj3awCZcwkXxqSOtqIRBeQ":{"text":"I had been to their previous location on Julia Street to use the dry sauna to make weight ","useful":8,"cool":2},"Zres3aMNZSgM4VhKrWTniw":{"text":"Gym is new and clean. Got a great workout with Mark and Sascha. They're friendly and inten","useful":4,"cool":2}}