{"RI38IAiCW1JdGztCQsJSug":{"text":"Overall, this hotel was just OK. It's a bit pricey, but it is right next to the superdome,","useful":1,"cool":0},"ILx0OawcQxrGKsSk2JdAhA":{"text":"PROS: The hotel was very classy, clean and beautiful. The staff were amazing and very frie","useful":2,"cool":0},"BlgugRhmciQIVKaVvVDbqA":{"text":"I work for HBO and had coordinated in advance to have my family stay at this hotel, since ","useful":23,"cool":0},"IU06sHZ_dYoHGX4VuZKjAA":{"text":"Thanks to Mr. Ryan Hale, Reservation Manager at the Hyatt, I finally got my refund. Took m","useful":0,"cool":0},"14qfhWrXG3f9pEtPUtmAiQ":{"text":"Good hotel.  The hotel was practically all computerized.  I had to ask for help finding my","useful":1,"cool":0},"j6s14GXJSIUPbqthZ5UvvA":{"text":"Ok I stayed here and I didn't have my room key so I had to go down 2 floors to get a key r","useful":0,"cool":0},"k4CCzRZzR31yUfEhKZtGXw":{"text":"On the plus side, Staff is friendly & respectful. The building is modern, rooms are great,","useful":0,"cool":0},"qNGtbI6uxCakjCROhnnePg":{"text":"This stay was really lackluster and unforunate, after hoping for so much from a newly rene","useful":2,"cool":0},"iOqPhPFu4VkZgGvvva6n-Q":{"text":"I stayed on the regency floor in a double queen using my Hyatt points on their opening wee","useful":3,"cool":0},"CnjUbITePOr5JaIo61xndw":{"text":"Absolutely a great escape. Got a good deal on the room in a great city for adventure and g","useful":0,"cool":0},"VRuPoE0eULf9q9MI-yAKww":{"text":"I've stayed here twice. I'm a fan. \n\nPros: The lobby is inviting and always smells good. T","useful":0,"cool":0},"xvLh45Q6anegwdaYDW8pbw":{"text":"I am surprisingly impressed with this place! From the moment you walk in, it's gorgeous an","useful":0,"cool":0},"fRAs2ZExGa1gVBXoCtlJMw":{"text":"I unfortunately do not have the time to write about ALL that went wrong at this hotel but,","useful":3,"cool":0},"A_yuvz3_0ogsNfxox3lXjA":{"text":"Worst room we have ever had at a hyatt!  So small you can barely walk around without bumpi","useful":0,"cool":0},"9C7DR0vAHDjB_g_tzBPvlg":{"text":"I stayed at the HRNO for two nights this past weekend, as it was my friend's 30th birthday","useful":0,"cool":0},"m_3n8ZNdp7jtIxtnrQhhRQ":{"text":"Beautiful and perfect spot for a conference. We had an issue with our fridge and air condi","useful":0,"cool":1},"XOAR9cGFJukIPgMDWKayuA":{"text":"I was switched to this hotel after my package deal hotel was water damaged.  From the star","useful":1,"cool":0},"QXs-83n0V6pd8J3U7Jh1Yw":{"text":"Gorgeous hotel with a great location!  It's not at the heart of the French Quarter, as the","useful":2,"cool":2},"ULjZ6_bK33uHykbscT99Sw":{"text":"I have mixed feelings, here are my pro and cons..\n\nPros- nice beds and linens, great room ","useful":1,"cool":0},"ktbTBonBWJ_5G2N0LxZEMw":{"text":"The room is very nice, and the building is nice, like the elevator system is super cool, t","useful":0,"cool":0},"K84IZ6d0T0WoeN7EeykRsQ":{"text":"Hyatt is my favorite chain hotel, they are consistently clean and have everything you migh","useful":0,"cool":0},"avx01JSmAumFl79x0WNc7w":{"text":"I've been so floored by horrible customer service that I just received and from a manger. ","useful":1,"cool":0},"AGMbKotBqsZd2PpZCedkZg":{"text":"I had a serious problem less than 5 minutes after I enter the hotel.\nI explained my situat","useful":0,"cool":0},"tq0tEO6Cp6JVZUrznMJKcQ":{"text":"Stayed for the opening night and was pleased overall. A few things need to be worked on bu","useful":3,"cool":0},"QzYN-MqAcElmIKOhDwUzrQ":{"text":"I spent the weekend over memorial day.  On the outside the hotel looks great.  The rooms a","useful":2,"cool":0},"mc0_UN8WMtXYEagkCqtFQw":{"text":"So disappointed in this place. I've stayed at other Hyatts around the country, and this is","useful":3,"cool":0},"gS15pLcF_Mm4LCP1hBwLvQ":{"text":"Insane elevator system . Always felt that I was trapped by the restrictive elevator scenar","useful":0,"cool":0},"v8RNQqG2qrYOoJF9w1RP0w":{"text":"I stayed here for a conference.  I was impressed by the meeting space and the public areas","useful":1,"cool":0},"6WJsdnH9g8r_9-bgLq951g":{"text":"Staying here for a business meeting and they want to charge an outrageous amount per day j","useful":2,"cool":0},"d8LQTmSvmdqPQX990cN0Vw":{"text":"i stayed here during my visit to the essence festival. i did not like that we had to pay i","useful":0,"cool":0},"TH_QU3yYPR3y3Q-ijYMERA":{"text":"Recently I attended a technical conference hosted at the Hyatt. I confess, it was my first","useful":1,"cool":0},"csQa8mIt13KVO5uOoEh-bQ":{"text":"Stayed here for 4 days - a conference.Things did not start off well, it's a hike from rece","useful":0,"cool":0},"VFLpYVygFGeJkBWo2ArmyQ":{"text":"Wow what an amazing fast and good service this hotel really is! I'm here for the first tim","useful":1,"cool":1},"wtmy0GfObRh6oq8cM_WHLw":{"text":"Horrendous.  Checked in on 10/16/15 and the place is jammed with fraternity and sorority k","useful":0,"cool":0},"OXhivyqxPOllahSUviI-DQ":{"text":"Staff: Very nice\nRooms: Beautiful and spacious. Fridge. Safe. Large bathrooms. Closet. Des","useful":1,"cool":0},"VgLKgSreo0_J74lDI9Rzxg":{"text":"Stayed here over the New Year, and I have to say, NOT WORTH THE PRICE.\n\nPer one of the pre","useful":0,"cool":0},"f3TZ21IOe2YRzXEvzycBFw":{"text":"In all my years I have never experienced WORST customer service. I had made reservations a","useful":0,"cool":0},"R_kkgCvkzZtH2odw4q5Tog":{"text":"I stayed here two weeks ago for 3 nights and it was wonderful. The rooms are clean, the st","useful":0,"cool":0},"mKvINCCCU3ZEHBf6bbXrQA":{"text":"Very nice hotel. Last minute choice as usual, but it was a great one. Hotel definitely on ","useful":0,"cool":0},"5xxzh2t_gnuEbFTNblbY3A":{"text":"**Note: I just checked in on Thursday and don't check out until Sunday so things might cha","useful":1,"cool":3},"sC_xq1SQRvO5Bw8XFCNqWw":{"text":"I attended a large work conference here and am inclined to think a few things could have b","useful":4,"cool":0},"EQLGwmGsYu4S8y8tlDartA":{"text":"To start, this hotel is nice, new, with a good atrium and high tech (although somewhat ove","useful":3,"cool":3},"fsBm5vr4picOhudxgSe42A":{"text":"I may be a bit generous with the stars but it is a pretty nice hotel. Certainly better tha","useful":1,"cool":0},"EEiKdZTS_WWup_PPqzx08Q":{"text":"This hotel lobby is beautiful almost and an okay place to stay for one night if you are in","useful":0,"cool":0},"jb7sYQ9MOSkPyu96EhUKTg":{"text":"Very nice hotel that was away from the city noise.  It was very clean and the rooms were g","useful":0,"cool":0},"3RusYDOI-OqvHgwRSxgm0w":{"text":"Nice hotel for conference. Close to French Quarter only a 15 to 20 minute walk. I was happ","useful":0,"cool":0},"rSca3CKU9bkZwdXz8WewiQ":{"text":"My husband checked in and was told we don't have a King room available(which is what was c","useful":1,"cool":0},"pYKyuACbEwTlaoofrDTtzQ":{"text":"If I could I wouldn't give it 1 star! Just got here with a  convention that has been booke","useful":0,"cool":0},"H2j5r51alEiG2i_YSOvtkA":{"text":"Well I had to give one star in order to write this review other than that this hotel would","useful":0,"cool":0},"oUpyuwtluYYkzjlPns6Cjg":{"text":"I enjoyed my 6 day stay at this Hotel. Beautiful hotel and gorgeous interior designs.  I w","useful":0,"cool":0},"69841zPY527D9SRJAPME_g":{"text":"stayed here in may for a work event and everything was perfect. staff was friendly and hel","useful":0,"cool":0},"rZ683R-ech30oIkGJudtJg":{"text":"Had a pleasant experience here. Had a view from the 20th floor that overlooked the SuperDo","useful":0,"cool":0},"UvHrLTmE-1UHaqVCDXyEcA":{"text":"Here for a conference right before 2013 Super Bowl. Room was dirty, toilet ran continuousl","useful":1,"cool":0},"5xbLS4OUkPPeIPNXVCRpjA":{"text":"This gargantuan hotel is a marvel to look at but a nightmare to actually use. First, unlik","useful":0,"cool":0},"EtnoM8I6D9yvlv_eV0WlWg":{"text":"Very nice hotel, excellent location, nice and friendly staff. Excellent rooms with very co","useful":0,"cool":0},"VpWMzd5Ue-rzx1WD5jgiwA":{"text":"Not impressed at all with this hotel, I actually cut my trip 3 nights shorter because the ","useful":0,"cool":0},"EOwlxSZn_ZqebxPXPETZ0w":{"text":"Booked our hotel room using the Priceline Negotiator iPhone app. Our price was under $100 ","useful":3,"cool":1},"W2oVhGNtaz1ZL5NXLWBLQw":{"text":"I stayed here for a 3 day Mercedes meeting. The theme of the meeting was customer one, tak","useful":3,"cool":0},"orb7tC9wOEh7dAswV9iZ-w":{"text":"Super far away from the French Quarter. It's approximately a 1.3 mile walk to Café Du Mond","useful":0,"cool":0},"6HvrrA-uJzXACNqReTmLJQ":{"text":"never again! I booked and paid in full for a two night stay in june of 2013. my stay was t","useful":3,"cool":0},"cA93prDG_N8whqoPM-lsMg":{"text":"So I attended the New Years event and was not loving it. It was advertised as being the bi","useful":2,"cool":0},"Q7C_Yio_ujK3CgS_m_3drw":{"text":"I truly enjoyed our stay at the Hyatt Regency. It is a very beautiful hotel, conveniently ","useful":1,"cool":0},"9IAJyF0OxArajfVWCKc39A":{"text":"A long walk from the lobby to your room (2 different sets of elevators, and a football fie","useful":0,"cool":0},"c49VfISSDZHnnjMB_dNcfQ":{"text":"My arrival to the hotel went very well using the downtown shuttle from the airport. I had ","useful":2,"cool":0},"gFcOvvteyH6-m_XQsBO5OQ":{"text":"I stayed at the Hyatt for two nights with a friend in early October for a short trip to Ne","useful":2,"cool":0},"ygZlayUwQnyJomnX2NpCNQ":{"text":"Second year in a row I have stayed here. Second year in a row it has been a problem.first ","useful":0,"cool":0},"5ALB3UxhJtVvP_EhUdpOfg":{"text":"The hotel is 4th tier quality. Beautiful and the restaurant Borge is delicious. That's abo","useful":0,"cool":0},"2vBVulEQt0m1_TKSBKDM5Q":{"text":"This place had very little service and staff that act as if they did not want you there.  ","useful":0,"cool":0},"EHf7vKv7Ya-kGUEvBuL8Sg":{"text":"It's a little far from the French Quarter, but the quality of the hotel is worth it.  I ha","useful":0,"cool":3},"ZGYV6DqZDTxAp5t1qqvStA":{"text":"I've stayed here for both work and vacation and its a very nice clean hotel. There are two","useful":0,"cool":0},"fpoBSZP80E5voEPa0Ry99g":{"text":"One of the nicest hotels I've ever stayed at, once I found the front desk... \n\nAlmost impo","useful":0,"cool":0},"swnr3ZP-BzdBFzhgUNxFDA":{"text":"I stayed at the Hyatt for a conference and had a good experience. The hotel itself is nice","useful":0,"cool":0},"RmruJbD06NrWcuD7bVzTOQ":{"text":"Staying here for a conference. Stayed in a corner king room. Bed was extremely comfortable","useful":0,"cool":0},"8aGCr-Yhen3pCoQcb-4yDQ":{"text":"I have to say I was a bit worried about booking a room at the Hyatt Regency New Orleans be","useful":5,"cool":0},"fxa5wFlKFAPT_wAqghcD-Q":{"text":"Just stayed this past weekend and loved everything about it!! I see that alot of people ha","useful":0,"cool":0},"ajqVZP9z-BT5WlradvfJDw":{"text":"Have been brought to New Orleans several times for business, spent 8 months out of the yea","useful":2,"cool":0},"uf9YWCWFcIzP2uxEMzwdwg":{"text":"I want to start by saying that I like Hyatt hotels and stayed at many of them.  I am even ","useful":0,"cool":0},"EIhHCLRf8UHcRR9Qf_76Cw":{"text":"Looks can be deceiving! While I understand that the SEC championship is this\n weekend and ","useful":1,"cool":0},"InEpEP3v7XNBbIOUFBsFkA":{"text":"Great location near CBD, Canal and Bourbon Street. Great staff and very clean rooms. Great","useful":0,"cool":0},"SCLMVwnc4YnhVstVwrsXKQ":{"text":"Stayed here for a buddies bachelor party, we had 5 rooms in total. The hotel is gorgeous w","useful":1,"cool":0},"6jWb2fPhZoFn7VkujhUaaQ":{"text":"Can I go any lower on the rating? Yes, if Yelp would let me. Service ,poor, cleanliness in","useful":3,"cool":0},"ooOOdID24r_pUjOHAOgPHw":{"text":"This hotel was overall decent, rooms are a bit outdated but of good quality. Staff was ove","useful":1,"cool":0},"yjqZ70VC5g_O-waqaCRayg":{"text":"To quote one of the most awesome 90s movies...this place is a full on Monet...looks good f","useful":2,"cool":0},"rmhSkk8zaCTgwEey8ccAsA":{"text":"Fix your freaking brilliant idea of your elevators. I spent more time waiting for elevator","useful":1,"cool":0},"0eyBsnQYAUe5TghAd2nanA":{"text":"This hotel I will definitely stay at again when I'm at NOLA! I know it's a lil bit away fr","useful":1,"cool":0},"xSJG9WU2rQdNVMEh6MEf2g":{"text":"Great place for conventions. Spacious , well-maintained facilities , Starbucks and an addi","useful":0,"cool":0},"CjTMriy0B-5XXVTmx2tqzA":{"text":"I stayed at this hotel for a conference in September 2013. Given the hotel's proximity to ","useful":2,"cool":0},"T6_E3wyClM2ZlLK4-_dS7Q":{"text":"I just got back from attending a convention here and I really enjoyed my stay. \n\nMy room w","useful":4,"cool":2},"_DBlOnB-I9Q5j--PiZ8hcg":{"text":"I had an awesome stay at the Hyatt on my vacation to New Orleans. The hotel was beautiful,","useful":1,"cool":0},"y3v8Ut0aqS1V-yFmuXvvhA":{"text":"Beautiful spacious hotel. BUT Located about 8 blocks from French quarter... If you are not","useful":0,"cool":0},"vVgWzihAmyDMpO0TO6KfPw":{"text":"We came to the hotel for a conference and stayed 6 nights. It was a nice looking hotel and","useful":0,"cool":0},"4cBaap88wYE--A0hG7Q4hw":{"text":"We stayed at the Hyatt for a recent business convention.  It is no doubt a huge hotel and ","useful":2,"cool":0},"wkG3zrcDP12ZzdUp-ybu6Q":{"text":"This hotel is massive and if at a heavy capacity, not a relaxing or comfortable place to s","useful":1,"cool":0},"C7r2ZaaW40wTc7AztIvNEw":{"text":"Service is absolutely horrible! Avoid this place at all costs. My family had a reservation","useful":0,"cool":0},"-ESeWvqXU9COysxa5B7RCQ":{"text":"Absurd elevator system!\n\nConsistently unclean staff!\n\nElevators are frustrating! Once you'","useful":2,"cool":0},"M3S7HTX-Pb0eunSYbCfijA":{"text":"Nice hotel downtown next to the Superdome.  Has restaurants and bars on site.  The room I ","useful":0,"cool":0},"85N0kCFrQF9Oq86ZFDIWsQ":{"text":"We stayed at this Hyatt because that is where the conference was being held that we attend","useful":2,"cool":0},"5m8hvcpFdFP1CcZf9Y__Yw":{"text":"This hotel sucks! \n-rooms are very small (even the so called upgraded corner)\n-toilet runs","useful":0,"cool":0},"AEHW9dHX3kyDGp6zcu9Qkw":{"text":"Huge place with a corporate vibe.  I am sure the majority of their business comes from the","useful":0,"cool":0},"pzc1K5x_HHdt4t-LmVI6MA":{"text":"Valet parkers were nowhere to be seen when I arrived so after a 5 minute wait I drove arou","useful":1,"cool":0},"hHEScZrhVfKm2bmDX4DbgQ":{"text":"First, I want to say that the hotel itself is beautiful, and valet check-in made everythin","useful":1,"cool":0},"vX0SC5slzUNWyKQ8Scknxw":{"text":"the decor is awesome. but finding your way around inside this hotel .. to say.. the parkin","useful":1,"cool":0},"Mb4842OsHNdvxPInyfHy0Q":{"text":"My boyfriend and I came here for my birthday back in November of 2015. For 4 nights it was","useful":0,"cool":0},"K8zP5-PMprfrEBXYoAEJEw":{"text":"I stayed here because of a conference rate but I regretted it. It was nice to be right at ","useful":1,"cool":0},"0Wval5PveS3ywYFG608E4A":{"text":"Nice looking facility, but has the most uncomfortable beds I've ever experienced at a hote","useful":0,"cool":0},"NW2G-MBkatE05YLuQRVmrQ":{"text":"I recently stayed at the Hyatt, overall atmosphere was great!  Had minor issues with my ro","useful":0,"cool":0},"AvS3iiHZLgx-Ws9Q9x6MPw":{"text":"Yes this hotel was nice, but that expensive price is not inclusive. Take these expenses in","useful":1,"cool":0},"OY6FYC5WxqzBN22MFLMk-w":{"text":"Very large business/convention hotel with nice lobby areas.  Rooms were updated relatively","useful":0,"cool":0},"MdBczS5aW4w7P-_nf-AF8Q":{"text":"This hotel gets 5 stars from every member of my family.. My husband and I love to be close","useful":0,"cool":0},"7Ksb8GCRulqpY0-SvZ-1LA":{"text":"The Hyatt always gives you top-notch service I love Hyatt New Orleans there just have a gr","useful":0,"cool":0},"-EalIufLqvMvgsKUWF5UAQ":{"text":"what a beautiful hotel! so high tech. they have dial pads for the elevators where you sele","useful":0,"cool":0},"CcG7xoSfPrEgT6MakLLCuQ":{"text":"I just stayed here for a conference spanning the past week and I was impressed by how mode","useful":0,"cool":0},"WidRITrK7_34NkUm6OVMQw":{"text":"We were moved to the Hyatt from Hotel 504 due to their hotel not meeting code. \n\nOverall t","useful":0,"cool":0},"M8lPINDzdYxbL0heuoptRw":{"text":"Decent, recently renovated Hyatt Regency next door to the Superdome.  I was here for an ed","useful":0,"cool":0},"DG-ninmEVkWw8aMIchKRcA":{"text":"I went for Valentines and saw the Mardi Gras parades . It was in a great location walked e","useful":0,"cool":0},"MvScOcI57BZZntw6L8qTJQ":{"text":"Thursday night I went into the newly reopened Hyatt Regency to have a drink and watch foot","useful":5,"cool":0},"O2Szx6VT7RszTwqZTFV5cQ":{"text":"So I'll start from the beginning. \nWent to check in at 11pm to not have my room(double que","useful":0,"cool":0},"dcDL_CfEYN5vgE0iRqq32A":{"text":"The staff is wonderful, however the hotel is not. Our room was on the Club level, which in","useful":0,"cool":0},"QWdzjAZVOgigCDO7MH3Bsw":{"text":"There was a used bare of hairy soap in the shower when I first arrived. I got lost about 5","useful":0,"cool":0},"hV_LTsbDFKhy3QBy0aQ4Gg":{"text":"This hotel is so-so. It is beautiful, well-staffed, and in a very convenient area for shop","useful":0,"cool":0},"ZndRmy5ViHt0B8Zs4aiMxw":{"text":"Again no stars. If I could leave, I would. Still stuck here for another 1.5 weeks. There's","useful":0,"cool":0},"U1tx-4e5yT2-0JzsOiLKtQ":{"text":"If you have travelled the world and stayed at other Hyatts you will find this is the worst","useful":0,"cool":0},"hOiWVDDSRwJkAtecKwq7JA":{"text":"I am here with my husband for a conference he is attending. The lobby is gorgeous but they","useful":1,"cool":0},"5KTMLm2dHiMJ2boemHBIxg":{"text":"They overbooked the hotel by 20 rooms. I was there for a conference and they had to reloca","useful":0,"cool":0},"CbFf2mE1ItC4iEMt5PPUjg":{"text":"I had a really good experience during my one night stay here. This hotel is really huge, a","useful":0,"cool":0},"NxRUiWCbSHBUBr1dnpGyiA":{"text":"I loved my experience with the Hyatt! I stayed here for three nights for a convention, and","useful":3,"cool":0},"vy0RxMBa8wwtHPwewHhI8A":{"text":"Overall a nice hotel, especially for conferences. Ok sized rooms. Some rooms overlook Supe","useful":0,"cool":0},"aPAmb-dsbif4YIoKqvcpbA":{"text":"The hotel reopened its doors about 40 days ago. Fully renovated. Bright, open and sleek.\nT","useful":6,"cool":1},"a8szbaZ1bofxyBfVn4j-Jg":{"text":"The hotel is not a bad place to stay but it's also not the best. My room was clean and nic","useful":0,"cool":0},"tQYlo6-WNrByeTZDEiL_Rg":{"text":"The hotel is beautiful, spacious and can get a bit turned around. The staff were lovely an","useful":0,"cool":0},"kWQQceeaj69hqG_3j4kQqQ":{"text":"The entire hotel is designed in such a way that the needs of the guest are not met. In ord","useful":1,"cool":0},"byyjgaYkrV4DNBJAjVkI0w":{"text":"I have stayed at numerous Hyatt Regency Hotel and have great experiences. Not at the one h","useful":5,"cool":0},"LFio5tuFIOEYZK4CPtRPUg":{"text":"Let's just say hypothetically that you're here for a conference and you meet some associat","useful":1,"cool":1},"Ztnsyz4u1Bq13Wvo1TTDrw":{"text":"Wow!  I have found my home away from home in the Big Easy!  Checked in effortlessly by Dan","useful":0,"cool":0},"OD0T-IQny1T3UWhBxavBxg":{"text":"The room was a little small, but man, those beds are comfortable! The escalator up to the ","useful":0,"cool":0},"pX-lb3PTw1C-YxercMUxiw":{"text":"Stayed here for 3 weeks on business.  All and all I was happy.  It's an Ok location.  Mayb","useful":1,"cool":0},"OdZrzEUllAaC_jsuJM84Tg":{"text":"Circus Hyatt Regency New Orleans: designed by Esher, run by clowns.","useful":1,"cool":0},"MpbiWYYv9F1DxivguZoEtg":{"text":"Yea not a great hotel at all... If you are expecting some great Hyatt experience this is n","useful":0,"cool":0},"BQIrM2e8Ssg_cLpXMq548g":{"text":"The hotel was clean and spacious. The staff was friendly and helpful. The only negative wa","useful":0,"cool":0},"POWGEqv_gJWZWIylL2C-mQ":{"text":"Be aware of the elevators and how they work. You have to type your number in before gettin","useful":0,"cool":0},"eKOkSvNJN4-MD9cXQQnbrA":{"text":"Pros:\n- clean rooms, comfortable bed, mini-fridge that is not electronically hooked up to ","useful":0,"cool":0},"QVLQSCop9vg1ga2NI0tvJA":{"text":"\"You have thirteen hours in which to solve the Labyrinth\". - David Bowie as the Goblin Kin","useful":5,"cool":2},"pDt46DNCt88ApMmW1SyLZg":{"text":"Stayed here for a quick weekend with my hubby. We arrived late Friday and was greeted with","useful":0,"cool":0},"leiwHQn51RyyNN6FUCGl7A":{"text":"This is hotel is very \"HIGH- TECH\" Their elevators are quite intimidating in the beggining","useful":1,"cool":0},"7pruT-vT46ct6kcN2C15pA":{"text":"Came here for a conference. Great location and rooms. Hotel bar is open late nightly. Work","useful":0,"cool":0},"PVNo-5b8zHC4UJgKaZAGiQ":{"text":"Matches the adjacent Superdome in sheer scale. The hotel is sleek, stylish, and modern, bu","useful":0,"cool":0},"3Qd7Af8_5Ftaf8XiHioTMA":{"text":"I attended a conference here at this beautiful hotel. The layout was a bit confusing to me","useful":0,"cool":0},"65K_KR4eb5xpWAkYbH0j_Q":{"text":"The Hyatt Regency New Orleans is in a very accessible part of town.  A very short walk to ","useful":0,"cool":0},"MPnqHod-1UXLGURn1frJyw":{"text":"We had a five star stay at the Hyatt Regency New Orleans.  From check in with Gonzolo to c","useful":10,"cool":10},"na2AlUT0vaA_57OLk12OuQ":{"text":"I quite honestly don't know where to start with this complete antithesis of what hospitali","useful":1,"cool":0},"H47Ce1MjhA7QPFOFl3EMZw":{"text":"Disclaimer: I haven't stayed at this hotel, and only came here for a party in its banquet ","useful":2,"cool":0},"vMFFGAjfUzFwlWjZ2cQ3iA":{"text":"Not the hotel to stay at if there is a big event at the stadium. We booked our stay on a g","useful":0,"cool":0},"AXgK5yjrV5YYfvn6cQPVjQ":{"text":"Nice hotel. Room was clean and worth the money. Staff was very friendly. Pay attention to ","useful":0,"cool":0},"8Wa8u8GC3yNrv1Dz-RID9A":{"text":"Unbelievable.  Had to rate them a 1 because I had to use the scale.  Had a reservation for","useful":0,"cool":0},"g6O5pz-1OE9kQalbuT73yg":{"text":"Considering this is New Orleans, I understand why the service is slow. I'm from Ny so used","useful":0,"cool":0},"Tp8ZyKTIHBDLA1L-1gj9hg":{"text":"I wish there was a way to rate negatively.  To even give this property one star is a compl","useful":3,"cool":0},"ux-fQlJNJGKdSNfES4evCQ":{"text":"Love this place! After walking around and exploring, one may realize that there isn't real","useful":1,"cool":0},"zySTh5gHCGrM21hvSwn-hA":{"text":"My room was very clean and modern looking.  The renovations seem to be worth every penny. ","useful":3,"cool":1},"E9pQA5yj35eO0H_bL1y_ew":{"text":"Two parts to this review.  1.  I was a complete jerk to a member of the food service team ","useful":0,"cool":0},"VgiAeFrp_w8EOrC55_Jwpw":{"text":"HUGE hotel with over 1,000 guest rooms. This hotel was destroyed during Katrina and only r","useful":1,"cool":0},"rEwhznPSbLj3-JV38FJtCw":{"text":"I was here for a conference, it looked like the hotel was fully booked, there were multipl","useful":0,"cool":0},"SHWa6gShIg9qip2RQAb29g":{"text":"Spent 2 nights in Nola here recently. Funny story, I was told by my brother that he booked","useful":0,"cool":0},"NeEfnyMpqlzXGaTle1xpHQ":{"text":"I stayed at this hotel for Jazz Fest and it was incredible. Very nice hotel with awesome v","useful":1,"cool":0},"xM712doxhZqt4Cqpvlpwgw":{"text":"Three night stay for a conference. Conference facilities are sufficient and well laid out.","useful":2,"cool":0},"Ta_u0sYsNZsQSEKhbbU9iQ":{"text":"This hotel was alright, but definitely not worth the money. My wife and I were here for a ","useful":0,"cool":1},"suk6_Q7Q0i5VbtHAKuaEkA":{"text":"Best hotel ive stayed in for a long time. Employees are all friendly and I have no complai","useful":0,"cool":0},"QSc9izZ_RI5I5fQQr1Sirw":{"text":"The hotel itself is stunning to look at but does miss the mark on some things. Also, this ","useful":3,"cool":0},"TxMdQdsqYZNLfoEUUvZvJw":{"text":"To get to your floor, you have to scan your key on the kiosk before you get on the elevato","useful":3,"cool":2},"sisKIEMENcS0KscDrDDsog":{"text":"We stayed for 7 nights on vacation from the cold of New England. We arrived around 6 and w","useful":1,"cool":1},"6BuwmoEHW0HNZw9ObsAkwA":{"text":"The Hyatt Regency is like a Hieronymus Bosch painting. On the surface it appears lovely. M","useful":2,"cool":1},"L2nENvI7MSz070QTY5T8iw":{"text":"It's not in the French quarter which I didn't like but the Regency club was very nice and ","useful":1,"cool":0},"dBAMEZPu9uVAeT4p8LSMtA":{"text":"What a major disappointment this homecoming has been in great part due to this hotel's poo","useful":8,"cool":1},"qOhvUNDZHF5Td4nKU0fd7A":{"text":"We stayed here for five nights and I have to say this was not my favorite place I have sta","useful":1,"cool":0},"0PA0_npqXjtHD1sc-OoKFg":{"text":"We stayed here for the weekend and we had a nice time. The staff was friendly, when we arr","useful":2,"cool":0},"xL5fsgvzQ0E_y4hhu1w68g":{"text":"Stayed here for a conference. Luckily the wifi was included in the conference because the ","useful":2,"cool":1},"A0ISThIygHKx5PU5Dw13Eg":{"text":"If you like walking forever to get to your room, up countless escalators, deciphering rand","useful":0,"cool":0},"9OO7_Dl_hfckhbz-b2NB2A":{"text":"Worst. Bed. Ever. \nWhile the hotel was clean, the workers were friendly, and the location ","useful":2,"cool":0},"cbo32NPK9O0eoU5lhaqTBw":{"text":"The Hyatt Regency New Orleans gets the highest marks from me because of their staff who ab","useful":0,"cool":0},"HEN3vbV_LwZNVkEvyQ2Cow":{"text":"Very disappointed Hyatt  corporation should be ashamed of how this one is run. Dirty red m","useful":1,"cool":0},"vlkEUy3gLgBcfPuAUNdfsg":{"text":"Best Hotel I have ever stayed in. It's very technically advance, amazing scent all day eve","useful":0,"cool":0},"JRC0NwCwln2PBMIe2QMRyQ":{"text":"I stayed here November 11-15 on business for the 2013 API / AFPM Fall Operating Practices ","useful":7,"cool":5},"rMqxFa68jlX_AHmwG2KBhQ":{"text":"In terms of quality, the Hyatt Regency is one of the best hotels in the area. They offer a","useful":0,"cool":0},"9GlKiuNCtwi70tsojMWOMg":{"text":"One person working he check in after 8pm. Stood in line for at least 20 minutes waiting to","useful":0,"cool":0},"MelCZdqKvVv11DpiJQhG3g":{"text":"Unlike a lot of people I like the elevator system whereby you scan your room card and are ","useful":0,"cool":1},"CO3trJ-smkxYuGm55XCGqA":{"text":"Been here two months and could not be less impressed. The rooms (I've had to move due to n","useful":1,"cool":0},"yuvZgiv2Hzd03MT_4pWpEA":{"text":"This hotel is very opulent in the way it's decorated, we loved the view from our room on t","useful":0,"cool":0},"xlGYj8IKi51fHbKrHY9T5w":{"text":"I didn't say here, but rather participated in a conference.  The rooms were nice and clean","useful":0,"cool":0},"uGgiQjIS8QPpDLX_Ia7elg":{"text":"Boo.\nOK, so the place has some ups, but the downs outweigh them.\nPluses: \n-Looks nice and ","useful":0,"cool":0},"CUE3ofnFEyGcgnMMi4rE0Q":{"text":"This is a beautiful hotel. I felt very fancy staying here. They had a gorgeous lobby and e","useful":1,"cool":0},"P0I73sAojm2TuqX1lDVNJg":{"text":"We have to stay here for work. Elevator system is very confusing and requires room key any","useful":0,"cool":0},"gz7VxW5bsAKoRp1O3nwx-w":{"text":"The elevator system sucks! It took me 39 minutes to get up to my room and 30 minutes to ge","useful":0,"cool":0},"PmcgroQFPklYsIYV8wukQw":{"text":"My husband and I went to New Orleans, LA for our 1st wedding anniversary. We booked the Hy","useful":0,"cool":0},"u_xyngCFUwMX8jCOB3jipA":{"text":"Customer service from all of the staff was great. The shower in our room was so bad though","useful":0,"cool":0},"cuCSgYgl3wMkiZq7XHQMig":{"text":"This is one of the worst hotel experiences I've had in recent memory. On first arrival, I ","useful":0,"cool":0},"RTGLTWWk7j5aM6GRabfVOw":{"text":"I stayed here almost six months ago and thought I wrote a review. My stay was incredible a","useful":0,"cool":0},"By5GBuEU64pODDYCSzKQyw":{"text":"Amazing hotel.  I really, really wanted to give it 5 stars, but there was one aspect of th","useful":2,"cool":0},"SgXFqSmIbSClavm9J-r2Fg":{"text":"This is also a review for Vitascope. I work in the area and was so excited to see a new re","useful":2,"cool":0},"Ezrnr42dTeI-glv_vuAEGA":{"text":"I really liked this hotel for our stay in New Orleans. You are about a 15 minute walk to t","useful":0,"cool":1},"kdnKk2I_lfSEW2D6R6WRjg":{"text":"Service is absolutely horrible! Avoid this place at all costs. My family had a reservation","useful":0,"cool":0},"bXJsnwlwsojNPCkRSOuiAg":{"text":"They will charge you extra to get your room if they aren't ready by contracted check in ti","useful":1,"cool":0},"93byRgHGwBf5YiesdpZ40A":{"text":"Great view! The rooms were really nice big bed soft sheets large tv. This place is a littl","useful":0,"cool":0},"ZXOX6cIpfOQ7RwEZH_JzSA":{"text":"My husband and I stayed here for three days and 2 nights last week.\n\nPros:\n* We were upgra","useful":1,"cool":0},"_5k4CjdkOwilKZR5U86lgg":{"text":"Hyatt spent $280 million renovating this hotel post-Katrina and it shows. Very modern, com","useful":0,"cool":0},"MhimLhEOxM4ha02FCSDJCw":{"text":"Room is fine, but boasted tech is a mess.\n\nFrom the moment you turn on the television, you","useful":0,"cool":0},"stW4BN4fZ9R2_-aAbhSTyQ":{"text":"I really enjoyed my stay here.  This hotel is newly renovated and design is nice.  Hotel s","useful":0,"cool":0},"ZVo-Wxpv9lYAidX6POEh9w":{"text":"Paris is the most amazing front desk agent.  I was stranded in New Orleans to see Beyonce ","useful":0,"cool":0},"8naKv0y1dK2ez6XVzbfCYw":{"text":"If you are self-sufficient and no frills, this hotel is a great homebase for a summer stay","useful":0,"cool":0},"qreT02gDc71E3V0tCQOpMw":{"text":"Absolutely stunning hotel. Beautifully decorated and most importantly very clean and well ","useful":0,"cool":0},"E3_CdQO6HC-Cu9lzFzPncA":{"text":"The Hyatt is a giant maze of a hotel.  I don't know what happened when they built it that ","useful":0,"cool":0},"prFxX580RDQ1YwM7ug15ZA":{"text":"Staff had no idea what they were doing, was mischarged on three different occasions and fl","useful":1,"cool":0},"j7YOV2VbqFaFvhSqu4IALg":{"text":"We lucked out with this beautiful hotel after I booked it on Hotwire.\n\nThe facilities are ","useful":0,"cool":0},"xlJ_k8p-YZ2dI83-0kcv-g":{"text":"Checked into this Hyatt hotel with a standard room rate, excellent customer service agent ","useful":0,"cool":0},"HgUqQ2pNUaf9FU9Z_WRWAA":{"text":"Good rooms, great views (especially from the work out room on the top floor), a clean hote","useful":1,"cool":0},"8EcdC75mJXd0ESbzRhd35A":{"text":"This hotel has one of the worst layouts I have ever seen.   To get to the elevators you ha","useful":2,"cool":0},"_iDWsp7_fljpub3goexYVw":{"text":"Pizza Consegna is not what it seems...  they are not open until 230 am as posted on their ","useful":0,"cool":0},"SN42WeFPalB1cOORpb62hA":{"text":"Ok..not everyone can, or wants to, stay at a place like this. It might be too expensive, i","useful":0,"cool":0},"S6JBY9mSINHq8g3MUowb0A":{"text":"Stayed for a total of 6 nights and would definately stay here again. Staff is outstandingl","useful":3,"cool":0},"uIQ8emnM-bfbqoVPXh7BpQ":{"text":"We had a great stay at Hyatt last spring! First, they let me check in at 9:00 AM; I love t","useful":0,"cool":1},"rYBMZICpP1f_vyp_vhnHzQ":{"text":"My stay here was really nice! It says a lot since I work for a company that sells items to","useful":3,"cool":2},"VB9Kj_4rZHPjdeRWMvERCA":{"text":"This is excellent service. It is a wonderful staff. I love the food.   Superior accommodat","useful":0,"cool":1},"HpcwNhpE5V9obq80wz10NA":{"text":"This hotel is quiet with very friendly staff. It was clean with nice linens and the confer","useful":0,"cool":0},"D4YzHhM5UnbBW-vCi-1ntQ":{"text":"I travel a lot for business and usually stay at Hilton hotels.  The Hyatt has been a good ","useful":0,"cool":0},"KxpMOXHzb1KQ6oMnOjH__g":{"text":"As a Diamond level Gold Passport member, I was looking forward to two nights at the Hyatt ","useful":0,"cool":0},"ZG2kPuqy97VEf2kRBJZ72A":{"text":"This is probably the worst hotel experience by far. In the middle of the night somebody wa","useful":2,"cool":0},"XawJ3AlTB4GcqGId0LOmLQ":{"text":"Good experience overall. The room key is too fancy for me so I got confused and lost the f","useful":0,"cool":0},"G-pEsBT-8FeQiVa9DpveIQ":{"text":"Everything was great!\nGreat design of the hotel\nGreat services\nGreat views\nGreat location\n","useful":2,"cool":2},"rzwY8LA7kyiy9eOnTh_csw":{"text":"This is the worst hotel I've ever had experience with in my entire life. They have no dece","useful":3,"cool":0},"wwP0ULbYkPg2SUd-9Ow9Rw":{"text":"This place was terrific. After a long day in the car, and with a Saints game coming up nex","useful":0,"cool":0},"K0jxx9hACtbqeQdjUQce6A":{"text":"Wonderful and accommodating. My roommate and I forgot our razors and they brought us some ","useful":1,"cool":1},"EBnxOvS1zwOg5I_mEVmNkQ":{"text":"Not a bad place. My family and I just stayed here while I attended a conference. The hotel","useful":0,"cool":0},"4dptkvdo6eGBTszP9uQcZw":{"text":"Elevators are horrible! Hotel has nice amenities several restaurants and bars. But the ele","useful":1,"cool":0},"9xEA-TwYMx5IHgVZFnMPow":{"text":"Wow.... Where shall we start? We tried to check in at 5pm. Our room wasn't ready til 9pm. ","useful":2,"cool":0},"uASlXH_6veXwpSBq3M0RNg":{"text":"Have to hand it to the Hyatt New Orleans; this building was damaged by Katrina and has onl","useful":1,"cool":1},"1pt2nsgmmYkbQgnv_fFCRQ":{"text":"The worst place ever. Too exhausted now after waiting hours for rooms to be ready, but WOW","useful":1,"cool":0},"9RB0R2nBfJVNyOD7esO-Fw":{"text":"I had high hopes for this Hyatt since it was completely new, we stayed during opening week","useful":4,"cool":1},"X9lKQhmwatYXk17mCy9jIw":{"text":"The place is grate, but when i arrived my room was given. I booked with expedia, and the h","useful":0,"cool":0},"_vy-gcXvZQ9v1tda8HKvpA":{"text":"This place ooozes class. When you've hit the stage of life where you want to be treated li","useful":1,"cool":0},"n-IjefuxUwJAkCUR9TXsKQ":{"text":"Came here to stay one night for a training at the USPS which is a just a walk across from ","useful":1,"cool":0},"GWxNKIUVUcfIQmyK9NibGA":{"text":"Ultra modern design, food was meh and very overpriced.  The customer service was second to","useful":0,"cool":0},"nh-6iibkDrX_rL081bqU-w":{"text":"My iPad was stolen from my room while I was at dinner. Beautiful facility, nice management","useful":5,"cool":0},"zz5YlLfZyA-tb_q8j13GaQ":{"text":"Well I see I'm not alone here that this place is a low standard for Hyatt.  We arrived in ","useful":1,"cool":0},"ydmj1CbvCbOkM7qLH4ss0Q":{"text":"Only stayed one night but this would not be my go to for a longer stay. I mean the locatio","useful":0,"cool":0},"4aQm5K5-nIkVH8IFKqF0ow":{"text":"Stayed at the Hyatt Regency New Orleans for the Saints/Raiders 2016 Opener at the Super Do","useful":0,"cool":0},"NEXHkmOvx-3TY0bY49ONyw":{"text":"Good: if you're going to a Saints game, you're right across the street from the Superdome.","useful":1,"cool":0},"CIZwcM0idHOKzUQKDaJscA":{"text":"This would be a 5 star hotel if they put as much effort into the rooms as they put into th","useful":0,"cool":0},"NGhmwCJpVR7vSjxhVXUw-A":{"text":"It's hard to point out much beyond what others have posted. Most of it is true. However, i","useful":1,"cool":1},"7Z5uMKhWaM-Y4Hhsld7i1Q":{"text":"Nice hotel, fancy but small rooms, very small... Had a nice view. We had dinner at the res","useful":0,"cool":0},"Xy3fO7LblFxOaJ7rfDLRCg":{"text":"We selected this hotel, as many others, due to the close proximity to the Smoothie King Ce","useful":0,"cool":0},"mMvjHXSef5UjuYEaxfOl2g":{"text":"I hate hotels. They gross me out. This hotel...didn't really gross me out. So in my book, ","useful":4,"cool":1},"pe2y-O9GxVdk4NDUdTViAQ":{"text":"This hotel should have better ratings. The hotel is Very clean and beautiful. Rooms are mo","useful":0,"cool":0},"bPBieoE1ZtRgqQeOnZ32Hg":{"text":"If you are planning a conference, please do not have it here!   I am a conference attendee","useful":1,"cool":0},"weSVG18z8SiK6u8km4ptiA":{"text":"Great hotel except the bar closes at 12! In New Orleans?? that seems a bit too early! howe","useful":0,"cool":0},"7HrMVnDTr5C4Tl6_k28RmA":{"text":"Attended a large meeting at the Hyatt.  Very large and expansive hotel that was renovated ","useful":0,"cool":0},"5sTxwBzLFx3rNvTCUvLwzQ":{"text":"Pretty to look at.... Buuuuuuuut that's about it.\n\nIf you like to pay high prices for horr","useful":4,"cool":1},"ZfnhWfywd5JSZfjepI9yfQ":{"text":"My most favorite hotel thus far! I'm so glad it's close to home so I'll always stay there ","useful":1,"cool":0},"2uHjZMOjHhx2n6hjlgmh3g":{"text":"Stayed at Hyatt- New Orleans during a busy weekend (Essence Fest). Received a good deal on","useful":2,"cool":0},"DqpPibthNCsTomWorALYOA":{"text":"Great staff. Very friendly.  Complete with workout facility.   Also a nice convention cent","useful":1,"cool":0},"WTwE9V78dgx6LF0uU8t7OQ":{"text":"Great place to stay. My wife and I had the time of our life...thanks to one man at the doo","useful":0,"cool":0},"PGRjQaUrz2_Y36OCsgYIPQ":{"text":"This place was great for my birthday weekend the staff pretty much made my itinerary becau","useful":0,"cool":0},"7H7gfq_ya_NGbgdbWrEjsg":{"text":"Fancy shmancy- loved it. Service was fabulous at check in and remained superb throughout o","useful":0,"cool":0},"SuQeLT2cumvzuOB1_rjkBw":{"text":"Loved our stay here! It's close to everything and yet far enough from the big party street","useful":0,"cool":0},"Ya4ZzIJSRCzQ7CPitjnphA":{"text":"This place is a beautiful mistake. But, a mistake nonetheless.  I went to the concierge to","useful":3,"cool":0},"Ix5_ez6fckU2yUfmBcnJZw":{"text":"This hotel is very poorly designed overall. The escalator is two levels above ground floor","useful":2,"cool":0},"SqxayGyNiB6QiNEDIhI8Vg":{"text":"(Just got to the hotel-this was my review) Beautiful. Friendly and courteous staff. Pricey","useful":3,"cool":0},"EYWU7R_w6UA4Yq57qc1hLQ":{"text":"My room was not as nice as I expected. Terrible design to the bathroom that wasn't very pr","useful":0,"cool":0},"diDdXHXSoY_cwL46oU3z_A":{"text":"The hotel is beautiful but the staff needs help with customer service.  The doormen and va","useful":1,"cool":0},"vEwPaFGlXvJJiT4ihNy1mA":{"text":"Recently returned from a 8 day trip where we stayed in 4 different Hyatts in LA and CA. Th","useful":0,"cool":0},"2KYlDVKu-Mb-zoXCmVnM5w":{"text":"For a supposedly 4 star hotel, they missed the mark with me on this visit.   It is an impr","useful":1,"cool":0},"PSahUwFgJFrrlxOoBps0PQ":{"text":"Farther away than we hoped, our crappy Fun Jet travel agency left us little choice but to ","useful":4,"cool":0},"OA3c2oPFEcgDzNqnL2KX7A":{"text":"I want to start with the good. It's a beautiful hotel.\n\nNow, we got to the hotel and neede","useful":1,"cool":0},"SJ4QmbyzdUBrsAXqVdY88A":{"text":"I was disappointed with our initial experience and would have rated them a one had I done ","useful":1,"cool":0},"_CMwCwPBr0la1Lv20rPHww":{"text":"ZERO stars!! 1 bet I can top all of your reviews!!\nPicture this its NEW YEARS EVE 2015 we ","useful":1,"cool":0},"ClAy7a9_BSg-6rILLISzJw":{"text":"We were able to check-in early after arriving on an early flight.  Additionally, the room ","useful":0,"cool":0},"UlX5HN75bDmm9UPSWkudHw":{"text":"Nice staff, poor accessibility.\n\nThe elevators at this hotel are difficult or impossible t","useful":0,"cool":0},"xMqyAFeEAwGpcuXex0Ib8Q":{"text":"The hotel is nice enough, and the rooms are decent, but there were a few things that bugge","useful":3,"cool":0},"UN4RlQZiJChoGlpPBXq5lg":{"text":"TLDR: I would not stay here again.\n\nThe room was fine.  The carpet in the hallways looks k","useful":1,"cool":0},"ZGh1HW_fBW9uUMuErvUlDQ":{"text":"Convenient location a few minutes away from the central business area and the French Quart","useful":1,"cool":0},"bjK6k4bzfAQqAsop07zphw":{"text":"Went to Tales of the Toddy tonight. They decided to not offer valet. They did not post thi","useful":0,"cool":0},"Oa3VTNHkywC1BbzZqX8SzA":{"text":"Stayed the weekend here while in town for a trivia tournament. It is a great hotel with an","useful":0,"cool":0},"6yws0DNCIE08igndG4f0Xg":{"text":"Very nice hotel! It is gorgeous and feels very upscale. It is one of nicest I have ever st","useful":0,"cool":0},"0iDJ2cdUnBQW5Mom6LF5wA":{"text":"I stayed here for five days for a conference.\n\nIt's a great looking hotel with nicely appo","useful":4,"cool":1},"aibUdU8_A_bdkeF_7EQCdg":{"text":"BEWARE!\nDon't stay here,  we've been at this property 3 hours and we have been treated so ","useful":3,"cool":0},"Vb5KyCe_EBTlWY5dKsjErw":{"text":"This place capital F freaks me out.  First of all, because it's all shiny, glittery, and s","useful":2,"cool":0},"C46oTT2suqQsVjKyd1EHwA":{"text":"Stayed here for a layover, large newly renovated Hyatt with a great location for tourist a","useful":1,"cool":2},"71RfJQOim4S7qSzue_F3vQ":{"text":"Stayed one night at the Hyatt Regency prior to a cruise.  Great view of the Superdome from","useful":1,"cool":1},"T-YwKGqUtV9xq2kGku3qLg":{"text":"My wife had a conference at the Hyett Regency and we were able to stay at that hotel as we","useful":0,"cool":0},"reKGDqATAwZ1WY6vXt2O3Q":{"text":"The hotel itself is enormous and easy to get lost in.  Lots of restaurants/Fed Ex inside, ","useful":0,"cool":0},"zve3jSK_Tps1tlGHpyR-QQ":{"text":"I was there two nights on business.\n\nPluses: \nUnusually well-decorated room with an awesom","useful":0,"cool":0},"HR45dcRd3W56r1bfNIixxw":{"text":"The set up for this hotel is completely whack-a-doodle. I really don't understand why you ","useful":2,"cool":0},"W1YPUft76KorHG-z0p2C_A":{"text":"So so conference hotel. \n\nPros- modern, clean, full functioning starbucks, location was pr","useful":0,"cool":0},"1hbKt7l74NwYl2PWNVjWvw":{"text":"So So experience. \n\n$45 a night including tax for Valet parking!!! That's the highest I've","useful":1,"cool":1},"N5dX1cuh-zXew8xFrL-kdw":{"text":"I stayed here for 6 nights, and for 5 of those nights, I was sick. The hotel staff took AM","useful":0,"cool":1},"iOTzNQWau_7gHraNPoQMQg":{"text":"The trendy bar called Vitascope is located on the third floor in the hotel, Love the fact ","useful":2,"cool":2},"Gs6y8GYT0Rp0KYnFSDTs2A":{"text":"I had a confirmed reservation made months in advance for a conference stay. 24 hours befor","useful":1,"cool":0},"PgFUqWsnv1Mcfc9XuPowEQ":{"text":"Recently renovated hotel in a great location across from the Mercedes Benz Superdome and a","useful":1,"cool":0},"i5NRwDGuQjR046ywMvnUPA":{"text":"I give it four stars because of the valet parking. Thank you Antoine. I also liked the che","useful":0,"cool":0},"_jZ36eutT1gU1GR4rrVw2Q":{"text":"Nicest hotel I have ever stayed in.  The only thing I could possibly say negative about th","useful":0,"cool":0},"Q2ctaYR49-5faq-FBv_ndA":{"text":"This review is for the Vitascope restaurant within the new Hyatt Regency hotel (I give the","useful":3,"cool":0},"IkJtQ_eNbGB9NhmY1Dm30A":{"text":"Awful management. I came here on a road trip with my university and they said our rooms wo","useful":0,"cool":0},"s-zctnHpcPnDT2RRfEAxJA":{"text":"There are a lot of great things about the hotel that I can say. The only thing I wasn't su","useful":1,"cool":0},"6c-Ba1fRLvy84-jLylMhUQ":{"text":"Geez Hyatt,\n\nConsidering your reputation, and pricing, there are some definite cons about ","useful":3,"cool":1},"VLDlrApaTLrc8rE_TCxQiQ":{"text":"Nikki, who checked us in was super nice and offered us an upgrade which was still cheaper ","useful":0,"cool":0},"0bQRVinIC7rc5QY16RSyZg":{"text":"I stayed at this Hyatt during the 2016 Jazz Festival. The staff were very friendly and ext","useful":5,"cool":2},"uxewOk-icEa0s-PfJcAx6A":{"text":"Stayed here memorial weekend and everything was wonderful!! Great location, awesome servic","useful":0,"cool":0},"f1h1aul-bIY8jqCWjlNkKQ":{"text":"This review is for the Bywater pool bar. The bartender working there today is unfriendly a","useful":0,"cool":0},"oXGH-RWspTgETCauwiVs2A":{"text":"After having our av broken they sent in repair guys at 3:30 am while we were in pjs, not t","useful":0,"cool":0},"YzXORG8e4_2FrNhH7X8_pg":{"text":"Gorgeous hotel! HUGE TOO, however very very overpriced and they let anyone inside. There w","useful":1,"cool":1},"Y5LIDGZW-QmhKEtvMN4Pig":{"text":"This hotels #1 feature is location, location, location!  That being said, it actually is a","useful":2,"cool":2},"N3iEtuAAKV2RiW5jtLzydQ":{"text":"Everything was brand new and in fantastic shape. Located a bit away from the chaos, the ho","useful":0,"cool":0},"uk8vgKa-WcQMSuZ3rtJ7QQ":{"text":"Staying in the just reopened Hyatt Regency in NOLA.  Brand new amenities and lobby, very n","useful":1,"cool":0},"iy1AzTqBARucCGa16OGswg":{"text":"I am giving this hotel 2 stars for 2 reasons, it is clean and the beds are comfortable. Ot","useful":1,"cool":0},"YYSRqHLwBN7S0hLSICQ4PQ":{"text":"Hyatt Regency is a beautiful hotel located in the business district of New Orleans. Howeve","useful":2,"cool":1},"L_goaxselClORq6Xfdt8rg":{"text":"I used to work for Hyatt in San Diego, so I like to compare other Hyatts when I get a chan","useful":2,"cool":0},"gldUSBX0o1J6uIwwhyTE_g":{"text":"Phenomenal.  From a Borges story.  I'd live here if I could.  Huge hallways full of meetin","useful":0,"cool":0},"6PLtSAF61IgDKFGLqd3HZw":{"text":"The staff is friendly enough and the building impressive enough but there's a few things t","useful":0,"cool":0},"4m7qeTPzY1LySAibRRcs-Q":{"text":"I don't normally write hotel reviews, but this place was disappointing. Looks quite impres","useful":0,"cool":0},"j-3D59_5OqpT8mJdrvJxuw":{"text":"This Hotel by far EXCEEDED our expectations. We celebrated our 10 year anniversary in New ","useful":0,"cool":0},"bhTlZVJ_huKGmeJWTWrocA":{"text":"We came here with a large group and they were NOT prepared for our arrival. We were stuck ","useful":0,"cool":0},"9gSyAATwmzTRrCvkxvsBSg":{"text":"Absolutely gorgeous hotel in a great part of town.  Centrally located and close enough to ","useful":2,"cool":1},"bgaFvl8Cb8MFxND2iLlnKw":{"text":"Had to ask 4 times for a dead roach to be removed from My room . The front desk did nothin","useful":0,"cool":0},"m9Wtvdvp9ROVThZta0sP1w":{"text":"This is a high-end hotel with very nice facilities, including a top notch restaurant, a St","useful":0,"cool":0},"QJsJBRp7GDQFXofGD0r1-w":{"text":"Check in was supposed to be for 3:00. We tried to check in at 4:30. They told us an hour t","useful":0,"cool":0},"RID-DNw2LNo47v34_lbjsQ":{"text":"A spacious hotel with a great and VERY FRIENDLY staff. I have to send a shout out to Denni","useful":1,"cool":0},"g0i7nT3X-kLf2khIPa9rZQ":{"text":"No stars. I just found a used bandaid in my bed that isn't mine. I am stuck here for two m","useful":0,"cool":0},"g1vATq_mqOHaDJF7sTo2Eg":{"text":"Room booked about a month ago because I knew it would be crazy as I was here for St Patric","useful":0,"cool":0},"uIjtSo5HPdDym2ISm-Pf8A":{"text":"Enjoyed the workout on the 32nd floor to the view of the Superdome and smoothie King cente","useful":0,"cool":0},"EejUBz8F7eh_uX9C11xz4g":{"text":"This place can eat my asshole for trying to charge us 500 more dollars 2 months after our ","useful":0,"cool":0},"mIN-IHyMkajy6sKzcYiMow":{"text":"This hotel was pretty nice. It's directly across from the super dome and the smoothie king","useful":4,"cool":1},"h2po7wzrnnbsCJuMD47MNA":{"text":"Worse hotel ever. I have three rooms booked for the week which equals to over 1,800.00. I ","useful":0,"cool":0},"u4zQA33GePsa8FUrDH3WOQ":{"text":"I was able to score 3 nights at this hotel for ~$75/night, not bad! I'm not sure why this ","useful":5,"cool":4},"_7E-FXHKNzMo39cpFESHKQ":{"text":"This has got to be the absolute WORST hotel I've EVER had the horror of staying at!! I was","useful":0,"cool":0},"qILsS3d5LaTxvEzNpFYo5g":{"text":"We attended NYE event here yesterday, staff was friendly and quickly took dishes away. The","useful":0,"cool":0},"UT-oByXCHmmJuzAKxhv4ng":{"text":"Kudos to Jamyra, she's in banquets.  She was awesome yesterday (Zulu's Maid Brunch).","useful":0,"cool":0},"OqrtuGdSDukjUXsnv5p_CA":{"text":"I just stayed there for a convention... I was there for 3 nights. Such a classy Hotel!! No","useful":0,"cool":0},"PaHnlkSlRX29k0DhO3kTqg":{"text":"First I wasn't served after waiting 20 minutes at your restaurant, second my room phone di","useful":1,"cool":0},"HYjXu5ZbGNlkzCGkM8--sA":{"text":"I think this place has only been open a few months since the remodel. The hotel is beautif","useful":1,"cool":0},"J_m5uhY1tON-2kUUiIimfA":{"text":"I do not exaggerate when I say that I cannot say enough bad things about this hotel. I arr","useful":0,"cool":0},"JrJ-icG1acEMj3WXWaKhNQ":{"text":"At 5 am we were woken up having to evacuate the room mind you this is after we got turned ","useful":2,"cool":0},"WmlQCdVTv_zf-U8OPx6EWA":{"text":"Good hotel with great amenities and a great view of the superdome. The prices were reasona","useful":3,"cool":2},"9benBe5JyWvId-G0v9tUTg":{"text":"Corner Room w/ A View & THE most awk Bathroom\n\nI stayed here during EMF 2019.  I picked th","useful":0,"cool":0},"DP9daYeXdHCopiHSvGQo5w":{"text":"I'd give this hotel a solid 3.5. I'm going to round up today, but I definitely don't think","useful":1,"cool":0},"SfQCtaImq8bTQ1nGLjlzrQ":{"text":"Went to New Orleans for a wedding at the end of January.  Got a good deal on a few rooms h","useful":1,"cool":0},"HpQGUxxB4LO329SS51hXjw":{"text":"As guest of room 2015 in June 2016: \n-Both soap and (hopefully) chocolate caked on bathroo","useful":1,"cool":0},"Z4KjobToZ8mUipWVaBZ_7w":{"text":"Excelente Hotel! \nEl desayuno es buenísimo ! \nLos precios son acordes a lo que ofrecen ! \n","useful":0,"cool":0},"ej4nOQ9Aqd0P_h0_UHgCLg":{"text":"Hmm, not sure why this place has such poor reviews. I was also here for a conference and h","useful":1,"cool":1},"V6eCR0IInb0uGzWItIWQcA":{"text":"Worst hotel experience in decades. Too bad considering the lobby and bars are gorgeous! Ac","useful":1,"cool":0},"x_BlWSXfR28l3az7tOUBOQ":{"text":"I am actually surprised at the rating for this review, but then again, I do have to admit ","useful":3,"cool":2},"prUUTLMa0RI-Uw6iNrj-mg":{"text":"There is no way this place has only 3 stars. First of all, their pizza was phenomenal. Thi","useful":0,"cool":0},"pm9X4t1rrGyNvphbL2yY-Q":{"text":"Pros:\nSuper fabulous decor and upscale nice look and feel.\nNice size rooms.\n\nCons:\n1/4 mil","useful":0,"cool":0},"MStgvnXYvZNzjMYkK6ORFA":{"text":"I stopped in at Hyatt about a wk before Superbowl wknd and was overwhelmed by how well thi","useful":2,"cool":1},"wc2y6deJ3yxiP_oWVZSLqA":{"text":"I spent a few days at the Hyatt Regency for a conference, and had a great time. Service is","useful":3,"cool":3},"noZ8Cev-pDJpsqJzjDPlNg":{"text":"Made reservations for our group 10 months in advance. Showed up to hotel at the check-in t","useful":0,"cool":0},"1Wz9vUyRmRS-hOrQvUEAaw":{"text":"Staying here for a conference. At 11pm in the evening workers in the room next door where ","useful":1,"cool":0},"6F2_5imp9Mhuk05MPyGqUA":{"text":"My wife and I were not happy with the Hyatt at all. We had to stay here for a conference. ","useful":0,"cool":0},"FfWV19GSSbN59GnsMvqY6Q":{"text":"OVERCHARGED! At the 3rd floor bar. Bought two beers and two wines for a friend and myself.","useful":0,"cool":0},"L9DcTQC09Jx-Aivl7bcjIA":{"text":"I would love to give this 4 stars but an incident occurred on the last night, which I'll g","useful":0,"cool":0},"Ie5h13QxzvlgPQYyjUqZmw":{"text":"I went to visit my cousin in her room.  As a Hyatt member I was impressed with the layout ","useful":0,"cool":0},"DymG-cliRDfI5TGp5RPRyQ":{"text":"One of my worst hotel experiences anywhere, ever.\n\nCheck in:  we reserved a king bed.  The","useful":1,"cool":0},"ppyxVu_YMn436zFj1UgzVg":{"text":"They reopened this place just 3 months ago and they really need to work out some kinks.\n\nI","useful":2,"cool":0},"GlZvRP_yMlDXLRDAVqSbag":{"text":"This hotel is what every East German would have imagined heaven to be.  It is severe and s","useful":12,"cool":0},"DVH9rZWnjhqB7EdgxnKp4g":{"text":"This hotel is lovely. The rooms and meeting space are located a distance from the front de","useful":1,"cool":0},"C-fDSZSTnZJD_Zp22D3QxA":{"text":"Great stay over Halloween, really recommend this hotel as a good base for a NOLA trip. The","useful":0,"cool":0},"mvRGjNRgyteju0FCFPyryQ":{"text":"The Hyatt Regency is a great place to stay for special occasions! Our family joined us in ","useful":0,"cool":0},"dNEfTG3KBYLmUR83vtDwQw":{"text":"Came here for my boyfriends formal in New Orleans, and had an amazing stay! When we first ","useful":0,"cool":0},"Pz8SgQIYrJQ8UA5ZR6UCew":{"text":"Staying at this hotel all week for the AGD convention. Everything has been wonderful for u","useful":1,"cool":1},"GC2GbGCVK4SkwdXczoOH1A":{"text":"How do I give this hotel 0 stars? DO NOT STAY HERE! My flight to New Orleans for a confere","useful":1,"cool":0},"xUlEsxF6qZBFbD7t8VbKhg":{"text":"Hotel is just not at Hyatt standards. Maids can't clean servers don't give a crap about th","useful":0,"cool":0},"ohO2aegHPVsCUkm-NFTc3Q":{"text":"Worst housekeeping staff on planet. Printers are free but are low on paper.  Very poor hos","useful":1,"cool":0},"OFOm6SyAALK2ufCH2lrdBA":{"text":"Oh, pretty enough to look at, really lovely cleaning staff and concierge...but the front d","useful":2,"cool":0},"RRLIpPzn4urhX-nPH4xWBw":{"text":"Started out great when I went to my room and it had a spectacular iew of the SuperDome. It","useful":2,"cool":0},"22hRtPwFCe8UjwNVG6q9BA":{"text":"Rooms are great, customer service is terrible and I don't need you to believe my review. T","useful":1,"cool":0},"8jZX4LGrqf4sB2_yHmulrQ":{"text":"Stayed here on the 22 floor. Great view of the Superdome and the Smoothie King Center. Loc","useful":0,"cool":0},"jJ-9GXTqSC9PiCHUPTXuFw":{"text":"DO NOT stay here! I would give them zero stars if I could. The hotel is way too big and th","useful":1,"cool":0},"gfOmDqP4_m25B62RYgK59Q":{"text":"Very nice for most part. On site food was delicious.  Staff helpful.  Located close enough","useful":0,"cool":0},"EC9DD69wW9BknCawL4KYBg":{"text":"I'm surprised this place has so many poor reviews. I had an excellent time during my stay ","useful":3,"cool":1},"JVKifGMJkZCM1pP7osuL9A":{"text":"Worst wait ever!!!\n\nThis is the worst hotel my family and I have ever stayed in and we hav","useful":1,"cool":0},"gA2rwwwaHAeRg3lzhaGxwQ":{"text":"This hotel was close enough to the French Quarter but far enough to get away from the part","useful":0,"cool":0},"lqfOpxPuK5c4rp5xZFWqEA":{"text":"So I am currently staying here for a conference and wanted to give a review of the room an","useful":0,"cool":0},"hvGAP2_k8ZZSDEzN3AnyQA":{"text":"Came here for a convention. Had at least 800 people in our group staying in this hotel. \n\n","useful":0,"cool":0},"mgd3dPr3LCgTF-idzVWECw":{"text":"Location is easily accessible. It is right across from Smoothie King Center and Mercedez-B","useful":0,"cool":0},"kWHLD8OGw4FNgMIX1xU0cQ":{"text":"This really is a beautiful hotel. The inner atrium rises a dizzying 27 floors up in the ce","useful":2,"cool":1},"cGp0sF_NnB9xvygzoFhNEA":{"text":"We traveled to New Orleans and on my second night my foot got stuck in the elevator door a","useful":1,"cool":0},"PWKmdfi7aL7vkZffsRfjsg":{"text":"Arrived to find there was no heat or air circulation. Apparently there was a malfunction i","useful":3,"cool":1},"QtsD7VyPn1petj-UMne4Gw":{"text":"Landed here with a roll of the Hotwire dice & only thing to complain about was location, b","useful":4,"cool":1},"TxGrTfv09iS7N6GlGFn7hw":{"text":"Too far away from anything of interest but modern, clean (and expensive)\n\nPros:\n- Staff wa","useful":0,"cool":0},"_5Rja7rbKsp2R7KRH8VgUQ":{"text":"Still NO STARS. This hotel and the service suck!! Not much more I can add to that. @hyattr","useful":0,"cool":0},"_oFOHM3WmZg3rFR2Mdi2gw":{"text":"Just checked in. I had asked for a king bed and they said there were none available. They ","useful":0,"cool":0},"HTY6yzhP9FCQQQuYuYXoRg":{"text":"Well, The Hyatt Post Katrina is still getting its self back together I think.    I really ","useful":0,"cool":0},"3ORCJzWcDY8syALOWkGvIA":{"text":"Upon checking in I was impressed with the hotel.  It is very large, and upscale looking.  ","useful":1,"cool":0},"rAscXoyeEvjR1ZMnxEyCEg":{"text":"This hotel is grand! There is 32 floors including an outdoor pool deck on the 5th floor an","useful":0,"cool":0},"vU6BOgJ2UCoTIy8tcmMkEg":{"text":"It was my first stay here and it did not start out great all. Booked about a month in adva","useful":0,"cool":0},"QjMSgt15fEgdpQwJtzvClw":{"text":"I am writing this at 4am because I've been awake for hours in a freezing room that no one ","useful":2,"cool":0},"Ty_NsHSrS3KYpeKyAR7vHA":{"text":"Most say I was pretty impressed with this hotel. Everything was excellent! After being in ","useful":0,"cool":0},"Q2Onm5MTJZAsxP9deS17Bw":{"text":"Huge place. Bar downstairs has some nice options on tap, however, the food was terrible. N","useful":0,"cool":0},"S21PG4JaMVwhMvztyleTeQ":{"text":"All I can say is excellent place and employees are amazing. This will be one of my first c","useful":0,"cool":0},"PA3SvTwofjSlUm9ryVZ0Og":{"text":"I think they could do with a bigger A/C unit.  The place was torrid in the summer.  There'","useful":8,"cool":2},"F4HK8ZaPEJ0vQzxX4_9Z5Q":{"text":"Convenient to the Superdome, staff was courteous and helpful. Room was clean and new. Lots","useful":0,"cool":0},"5-AONV41oOH8VsYs10v4bw":{"text":"Down side: not in a safe part of town for walking around, too close to the Dome.  I also a","useful":0,"cool":0},"QGVhvnFeVB6KiYZ4Qw3Wsw":{"text":"This place has a lot of nerve! We booked and paid in full (nearly $1500) 7 months in advan","useful":7,"cool":0},"VEJaQO_RDZvtrxgfaWDHeA":{"text":"I had the worst sleep of my life while using the pillows here. The beds are very uncomfort","useful":0,"cool":0},"8WxcgFDzkPbVK4H9z1aMpg":{"text":"The reason I'm giving this place a three star is due to multiply things. \nThe most irritat","useful":1,"cool":0},"kq4QpQKCMkClA8um3Os2GQ":{"text":"Great hotel! The valet entry is quite small and can easily cause traffic to back up both o","useful":2,"cool":2},"5EuDAKEASkspiuN_ZRUfpQ":{"text":"I wish I could give this property a better rating, but I just can't. The hotel is really n","useful":1,"cool":0},"rex-uHNXtSMu_DkpuzRDRQ":{"text":"Amazing staff. I was here for a conference and kristy Bowen and Kevin Hayes were excellent","useful":0,"cool":1},"zCMWMepxwDYh96_5aT6BKA":{"text":"Good experience overall. The room key is too fancy for me so I got confused and lost the f","useful":1,"cool":0},"Pf7QGiD1BCVX4m_QJ-E46Q":{"text":"Beautiful hotel and great service.   The gentleman who checked me in was pretty nice and m","useful":0,"cool":1},"ua5UCxDmuscIWFTQCKC0kw":{"text":"You could look at the pictures and see what I'm dealing with. The water pressure is the wo","useful":7,"cool":2},"t7gYOkx-P5MGYn1Kzo85_Q":{"text":"While on our return road trip from SoCal back to Atlanta two months ago, we stopped in Dow","useful":9,"cool":5},"iIoZTNLS2Khv4GK49SymLA":{"text":"Overall, a very pleasant stay!  Would definitely stay here again when going to a Saints or","useful":7,"cool":6},"dOp7AxzxwvzLcO50lL5FnQ":{"text":"Nothing but positives to say about this hotel and staff there. Over and over again went ou","useful":3,"cool":1},"vtmc2yggRss-D-l-baf0NA":{"text":"They have spent a ton of money redoing this hotel and it is beautiful! They should have sa","useful":2,"cool":0},"GeNgyaG0L4O_6t9eiaS0DQ":{"text":"We hosted a large conference at the Hyatt Regency. The staff was great, the hotel rooms we","useful":1,"cool":1},"_2q605OxpsfGddNChcy1qQ":{"text":"It would and should be a NO stars.\n\nGiven our experience, I would not recommend this locat","useful":0,"cool":0},"zC7cdQMBjzxuxezGTf-iCg":{"text":"We found the accommodations plus location to be perfect for what we were looking for. The ","useful":0,"cool":0},"9w593Bk3LRl9_Azl8VKd-g":{"text":"I have stayed at the Hyatt pre Katrina it was always my hotel of choice. I am not into the","useful":0,"cool":0},"_hWvZJ_y4ZRoDK1naMyjTA":{"text":"Stayed here because of a reduced rate (I assume due to COVID). It's a very nice hotel and ","useful":3,"cool":1},"FPtDrP-cMak3CoR1ZgUKag":{"text":"I was a guest at the Hyatt Regency on January 30th 2015. I was accompanied by my fiancee, ","useful":0,"cool":0},"XSinFhATTRxRsyHVa5bYDA":{"text":"Every year we enjoy participating at this great event at the Hyatt! Thank you as well for ","useful":0,"cool":0},"L-qBm1UEmnGhVT-2oHi9VQ":{"text":"I fell on this property by the elevator and was told just take the escalator next time. St","useful":0,"cool":0},"BPXhdNTn8HjTQrTxtxDnuQ":{"text":"DO NOT STAY IN THIS HOTEL.\n\nThe elevators are extremely difficult for disabled guests to u","useful":2,"cool":0},"1wxgX4OzvGsXrbZlsd9Llw":{"text":"The rooms and hotel were nice. Service in the restaurants was poor. I ordered a steak medi","useful":0,"cool":0},"Tpa5C9jPqpjm0RCoG8GeRA":{"text":"For starters, this hotel has way more then they can handle in it. Everything is done elect","useful":1,"cool":0},"qo-ILjphhPzMOZ7C4B8eNA":{"text":"Absolutely atrocious service. We were promised a 3pm check in time, then forced to wait on","useful":1,"cool":0},"9yfniW_TqHAepXT60VfT0A":{"text":"This was overall a good hotel.  It is a little far from Bourbon Street and the French Quar","useful":1,"cool":0},"Pk4h_aTzBTw1DrNuFZHQDQ":{"text":"This was the worst hotel experience I have ever had. I read reviews about the parking situ","useful":0,"cool":0},"PxYNuJDk0Arwj4Azlb0jFQ":{"text":"Beautiful hotel with great service and hospitality. I would recommend anyone who is visiti","useful":2,"cool":2},"FP2aOP7J3ZIbrK4FSXL1fw":{"text":"Aweful. I'm well traveled and generally forgiving. Not here! Gave them a 1 night deposit i","useful":0,"cool":0},"yREL-6QdQRi3JXiX6Ix-aQ":{"text":"This is where we should have booked our stay for Essence Fest 2017!\n\nThis is a beautiful v","useful":6,"cool":5},"ZYb5SafWTYY4Bga9kMvOhQ":{"text":"From a planner's perspective this hotel is a nightmare. The service was horrible and their","useful":7,"cool":0},"u5nvYPRESYOXA5l2OidCQg":{"text":"AMAZING PROPERTY! I am a consultant, so I travel often for work. It's hard to impress me. ","useful":0,"cool":0},"YDsg8eGgkRwUAXieTC4oTQ":{"text":"Had the pleasure of setting up teepee tents for a little girls party in a suite here and t","useful":1,"cool":1},"u5oMmxeTG93lgD2zYkSDiA":{"text":"This was my first time staying at the Hyatt Regency in New Orleans and I loved it. I'm not","useful":7,"cool":4},"JaMQixQmYdUolfSn5dlOUA":{"text":"This weekend, my family and I came in for the R+L Carriers New Orleans Bowl. It was our fi","useful":0,"cool":0},"nZEoJSATv7tyh6eafIRd_g":{"text":"A 3 star hotel with no exhaust in the bathroom. \n\nFancy floors, tight bathrooms and more t","useful":2,"cool":1},"EAIK9N9Lzv1w1xvumwdMqA":{"text":"I really liked this hotel, stayed 4 nights in April for a conference, couldn't of asked fo","useful":0,"cool":0},"xV4oVk52-qdhADpLQsFvbw":{"text":"I really enjoyed this Hyatt during my stay in New Orleans. It's walking distance to many a","useful":1,"cool":1},"FaN9jpUoZ0yXb3OGwA_U2A":{"text":"Great staff. Very friendly.  Complete with workout facility.   Also a nice convention cent","useful":1,"cool":0},"EfEMNQEs_j6TIq1IOBYKKg":{"text":"We loved this hotel! It's beautiful, comfortable, a great location and room views! We also","useful":0,"cool":0},"iyuplvrPqjKhPNN1SxpwoQ":{"text":"Where do I start? My experience was so mixed here came to the Hyatt for a conference and s","useful":6,"cool":2},"XGBem_FV6BIluyYPgUWC9A":{"text":"Staff is rude, Starbucks and the restaurants are closed yet they don't tell you til you ge","useful":0,"cool":0},"0w8tRRqvXL67MVjZSk2NsA":{"text":"A nice stay. This hotel\nis enormous and has a great feel. The room was nice and clean and ","useful":0,"cool":0},"y18Y0JH-_QNC-FHhKZ9o6g":{"text":"I just checked-in (I have stayed here before)!\n\nRoom is very nice. Service is super and th","useful":1,"cool":0},"JFglekRNLL605D-nYrRiMA":{"text":"So I rarely venture outside of Hilton hotels, if I can help it. If I'm traveling, I'd like","useful":5,"cool":0},"8Qz44EK_6TThQToKeFc74Q":{"text":"We stayed at the Hyatt for a weekend and upon 3 hours after checking out realized we left ","useful":0,"cool":0},"oxpjYqimy3M7hh4q9isBlg":{"text":"I booked this hotel expecting the usual: well kept facilities, clean and comfortable bed, ","useful":1,"cool":0},"w0_z8HqfewFDMW0apPuW-A":{"text":"Came in town for a convention and stayed at the hotel. The good is that the hotel is very ","useful":0,"cool":0},"pYlcE4snQ_EyMrmYKUnWwg":{"text":"A conference is being held here and the conf name is not posted anywhere in the lobby. The","useful":1,"cool":0},"eq-5bfwRiStFtUR5qED42A":{"text":"Review based on 4 night stay on the 22nd floor.\n\nPROS:\n+ Friendly staff\n+ Options within H","useful":3,"cool":0},"Kms4Aq2tnZ51UQ5qtpNnjQ":{"text":"First, there was a mix up with our reservation, where they tried to charge us again even t","useful":0,"cool":0},"3h_HdcaeBcspcgU5S4ljOw":{"text":"Good location for sports fans.  Remodeled and beautifully done, BUT... A/C fan was very lo","useful":0,"cool":0},"qKGbZfHrA3MtsXNDy3KkyQ":{"text":"I really don't know where to start with this debacle.\n\nProbably when we purchased this hot","useful":4,"cool":0},"oaa-UxNHROI7_wg63zgRQg":{"text":"Room was very nice. Only problem.. no hot water.. for the last week. they say they are goi","useful":0,"cool":0},"GDbcvgdHtSRwnwmmjJ2E4Q":{"text":"Let me say that this hotel is HUUUUUUUUUUUUGE. I can honestly say probably the biggest I'v","useful":3,"cool":4},"jubGP2BASg_7mHLDk3DUew":{"text":"This hotel was very beautiful and in a great location but the absolute worst experience I ","useful":0,"cool":0},"MWE66VS44ix1DGhXa8tfsw":{"text":"I am an ICU travel nurse from SC. I came to NOLA for a short vacay before I go back to dea","useful":0,"cool":0},"YBsDHDbqgGAY1vej0fl4Tw":{"text":"Hands down the worst hotel experience I have ever had. I had booked this hotel 3 months in","useful":8,"cool":0},"3neW-qiISgumf9W-y-SzDg":{"text":"Of all the high end hotels we have stayed at, the Hyatt regency has definitely delivered. ","useful":1,"cool":0},"MjR3ygLgkAvZGIO1a031Rg":{"text":"I don't understand the poor reviews for this hotel. I've stayed here multiple times and it","useful":2,"cool":1},"5AW0vHjIg68bAdKQNQkNvg":{"text":"I'm more of a fan of Hyatt Place, only because Hyatt Regency's tend to be large convention","useful":2,"cool":0},"mfZgY5u4pBSLEZ85vpxqpg":{"text":"We didn't stay here but we did attend a party here while in town.\n\nBig beautiful hotel. To","useful":2,"cool":1},"TAsFs1NRhIcQ_nrl7MRSNQ":{"text":"Gorgeous hotel and well located, but with a huge caveat: the a/c is dreadful. The two-room","useful":0,"cool":0},"hhQydbhU5ErGMQhay5QMCQ":{"text":"For a 'nice' convention hotel, this place is a hot mess...\n\n12+ hrs - no hot water.  I mea","useful":2,"cool":1},"oMa_iNR-ZLzfrJGoLfN8uA":{"text":"I was there two weeks ago for a convention.  It started with the heavily perfumed lobby.  ","useful":0,"cool":0},"uphmbD32gLe1ODTDdorE_g":{"text":"Hard to imagine a worse hotel. You have to go up two escalators and at least a 3 minute wa","useful":2,"cool":0},"KadBvTwyZURN-4ydsMt9eQ":{"text":"Had a good stay during a conference in late February 2020, Right after Mardi Gras.The conf","useful":2,"cool":0},"ATFWv6v_OSsronV7bhK-5A":{"text":"My young daughter is at the Hyatt in New Orleans, alone, for a business trip.  Soon after ","useful":0,"cool":0},"Vk3EGlfbbZynm-u0nksZ5g":{"text":"This place is getting this review after I found out they gave my manager's room away when ","useful":2,"cool":0},"hzr9ABlLjLTz_4sedg-AzQ":{"text":"I think the Hyatt Regency in New Orleans delivered on everything their brand promises.  Th","useful":1,"cool":2},"RWstPsxFJzPaJuniDstqaA":{"text":"super nice atmosphere, extremely comfy rooms, delicious food, & not expensive at all for t","useful":0,"cool":0},"64NjSu3iu6FXl3WuXjnvZQ":{"text":"This hotel is gorgeous, with a price tag to match. There were a lot of out of towners, whi","useful":0,"cool":0},"CumWx0823cYfkMDKkODtGg":{"text":"I travel often for work for extended periods of time.\nWhen I first arrived at the Hyatt Re","useful":7,"cool":0},"GkUZuttGjzVKRF3qNitWMw":{"text":"I honestly expected this to be an exceptional hotel, but I was disappointed. Reserved a ki","useful":0,"cool":0},"vJeeBjX6h6CIpPppg-OaPQ":{"text":"Came here for a conference and stayed for 5 days.  I was pleasantly surprised by this hote","useful":7,"cool":3},"0ix611W3QG_aMzHy_3ZCag":{"text":"SIZE MATTERS \n\nSays my wife. \n\nAfter walking in this mini room I'm reminded of that. \n\n\nWh","useful":1,"cool":0},"Yy3TmiG4XSdm_QYwl5Vluw":{"text":"This is a very busy Hotel it has been recently updated I believe overall the hospitality i","useful":0,"cool":0},"9PMcxUCatKTXWFTH3t8UrQ":{"text":"I love this hotel. It would be my first recommendation if you are visiting in New Orleans.","useful":0,"cool":0},"EiacSV5l7_U6Ys6ODPbgkQ":{"text":"Great hotel!! I stay here every week for business and I really like it. The staff is AWESO","useful":1,"cool":0},"MtXJyqO-E9TQHox2XHFXYw":{"text":"This hotel was totally overhyped and vastly underdelivered, all style and no substance.\n\nI","useful":1,"cool":0},"vXhD48hjcsf_gcxA2SAeyQ":{"text":"I was extremely disappointed when I returned to my room and a piece of artwork I purchase ","useful":0,"cool":0},"H2VTOBzruq33kPiySOLwbQ":{"text":"Wasn't it the early 90's when Hyatt Hotels were the latest and greatest with their atrium ","useful":7,"cool":5},"C4Q4DKmIcOpuE_73CndzAg":{"text":"The Hyatt Regency New Orleans is a luxury hotel that's located 15 minutes from the French ","useful":3,"cool":2},"7Pl5vyNdmI5VGN84-1e1Xw":{"text":"Massively over priced food. Outside of that the staff was great- the elevators are a littl","useful":0,"cool":0},"jJRp0m8wiROFSP2l8thhRg":{"text":"Please read the lower star reviews as they are fairly accurate as I don't wish to sound re","useful":2,"cool":0},"nZrMj96kA7o2EFrMWhUXTg":{"text":"They upgraded me to concierge level for no apparent. Suggest asking for concierge level wh","useful":0,"cool":0},"X5NCiiRNeTIRA_i592Th3w":{"text":"I searched for convenience and luxury when I booked this hotel. We had tickets to a saints","useful":2,"cool":0},"Rb3XqXKt6KbOKJmc9Jof0w":{"text":"Very nice, spacious hotel. If you can afford it, go for it. Three sit down restaurants, th","useful":2,"cool":1},"rYVdlEcFIxony6Hxqkoekg":{"text":"We stayed here 2/28/14 - 3/3/14 for Mardi Gras weekend\n\nPROS:\n-Location is good, you can w","useful":1,"cool":0},"VsUevZ6c3743bi-EmS0TnQ":{"text":"While this hotel is decent for conventions, I wouldn't stay there again and cannot recomme","useful":0,"cool":0},"tEyiFWWvO-pOyfRbuFi9SQ":{"text":"Wow.\n\n.\n\n.\n\n.\n\nI used priceline negotiator! to get a Saturday night before Easter for $99.","useful":1,"cool":0},"fmmmmclZ7FJpjuIvNrtwQg":{"text":"I actually really like this Hyatt. The room is nice, the view was decent, and overall the ","useful":0,"cool":0},"ao03--LAx5qd3CACaMGnDg":{"text":"Very Nice.  This is a great location if you are going to an event at the Smoothie King or ","useful":0,"cool":0},"F9iTbcza-Z1InR4WNCKadA":{"text":"The current 3 star average is accurate. I stayed here for one night and selected this Hyat","useful":0,"cool":0},"-vrpvLrSUylzER3QGVVXGQ":{"text":"Hyatt Held a great New Year's Eve event, or should I say EVEnt  ;) It was called Big Night","useful":0,"cool":0},"p515tRON489a7TEEr66tBg":{"text":"Hyatt Regency New Orleans did NOT disappoint at ALL! I must be honest in saying though tha","useful":2,"cool":1},"Yfc3qqDtbTDv1bxzA3WpXw":{"text":"I recently visited during a conference. I have to say this hotel is absolutely  beautiful ","useful":0,"cool":0},"4SPSHt18m9u54uIN_NfLww":{"text":"I have stayed at this hotel on two different trips to New Orleans during Mardi Gras super ","useful":2,"cool":0},"KSiyRHejEMV5JPTCQoVihA":{"text":"The hotel is overly complicated to get around. The elevator system sucks and do yourself a","useful":0,"cool":0},"XAjrnxkqXk_DRMaY6L77IQ":{"text":"The hotel and conference center and Restaurants and Bars are Amazing!! But the ROOMS ARE H","useful":0,"cool":0},"BxZ4yEsvtoFmGGKy48UTcA":{"text":"I thoroughly enjoyed my stay at the Hyatt this past May during Yelp Spring Break.\n\nThe Hya","useful":6,"cool":2},"WGuvxf8rUANQ6QrOwzoeNw":{"text":"I stayed here a couple of weekends ago and had my $600 wallet stolen. It was left in the r","useful":1,"cool":0},"jnfV1l892u47FO5qZiwPPg":{"text":"It''s hard to find your way around inside the hotel. We were only there for a couple of ni","useful":0,"cool":0},"ur-O3SbZCeXvGFbL9Cp45g":{"text":"Very nice hotel, it was very clean and most of the staff were very nice although the food ","useful":0,"cool":0},"QgArvvVoGhRDS3fE_kLVGQ":{"text":"Stayed here because of a conference.  Unless you are attending events at Superdome, this h","useful":0,"cool":0},"erPewgTeAzMp-0cvaZniUQ":{"text":"DON'T STAY HERE \n\nMy fiancé & I stayed here the past two nights, because our power was out","useful":1,"cool":1},"JEw7eEJQgV5b3rv7itWBPg":{"text":"So I have been to several events here but haven't stayed until today. The room was clean a","useful":0,"cool":0},"vr6C6U-pEPmQCOJv01SsKw":{"text":"Absolutely lacking in hospitality. Stuck in the city bc of an unforeseen overnight layover","useful":0,"cool":0},"kWmJI7kxTIiuoIUHLImVSA":{"text":"We stayed here during our last trip to NOLA. It's walking distance from canal street and t","useful":1,"cool":1},"WoILVxZA7Q7GqHZXg3PD3g":{"text":"I LOVE IT, I LOVE IT, I LOVE IT!!!!!!! This was one of the most amazing hotels I've ever b","useful":0,"cool":1},"JTLIxcF2QhE16iLE1J8V6A":{"text":"Was here for a work trip and wish I could give it more stars.  The rooms are fairly update","useful":2,"cool":0},"v31LfkTjIx8dfgfIp8dqhQ":{"text":"HORRIBLE. I usually travel ti hotels around the city and this is by far the worst. This ho","useful":0,"cool":0},"lov73yBegWdtPr8b3LnDZw":{"text":"Since my check in at the Hyatt, I have had several issues including housekeeping losing my","useful":0,"cool":0},"yP58hLq46XypJnUBIhKWoA":{"text":"This place has been a nightmare. We arrived at 2:30pm and have not gotten a room yet. Been","useful":0,"cool":0},"LbeiZUTxqugiv0lL7vURTA":{"text":"I'll make this short, 1600 bucks on tickets another  800 hundred on stuff to wear, hair, a","useful":0,"cool":0},"Uj3T8Gc2aYgJ1vLyxYyTCg":{"text":"Horrible experience.  Here for a conference, we checked in at six after traveling for 11 h","useful":2,"cool":0},"kxDYt7g2zywM4wtUz133KA":{"text":"I spent 3 nights here and for the price of the hotel there are a few deficiencies I have t","useful":3,"cool":0},"d1PtmWJdJ5YrO_6_t2AP6w":{"text":"My family had guests coming in from out of the country so we wanted to take them on a fun ","useful":0,"cool":0},"dotBfLe6KFLufjNUnHB0Og":{"text":"We ended up staying here by accident but it was a great stay and we are grateful we ended ","useful":5,"cool":3},"fj73yV5d-_DiAfX3K_yf0w":{"text":"Beautiful hotel. Excellent service. I stayed here last month for a work conference and I w","useful":1,"cool":1},"D6sWKPqUctzM3PUd53V6fg":{"text":"The hotel is beautiful, although the layout makes me tired just thinking about it!  You ha","useful":4,"cool":0},"7UhzUsaSTHusLNR81REWgg":{"text":"I wish I could give less stars. Hyatt security threw away my car's key fob, after being as","useful":0,"cool":0},"SV6CVLYcsGiYyGoQRFCESw":{"text":"I really don't know what to do about the rating system on this one...So I'll start writing","useful":12,"cool":7},"DebX5O_WanA8v75UlWHmZg":{"text":"My kids love this hotel!\n\nI say different. The hot water was out in the entire hotel from ","useful":7,"cool":5},"E8DVOrSi4juBWYuaaQgptw":{"text":"Busy week while I was here (8/22-26/2016).  Saints/Steelers preseason game was on Friday n","useful":0,"cool":0},"6NkbrhDARQ1o7Py7D_2_3A":{"text":"Hyatt, I'm disappointed. This is my 3rd Hyatt in the past 4 weeks. This was the worst. pro","useful":3,"cool":0},"owM-FvMzKAwF-vElZbXcWg":{"text":"The hotel is great as far as location and the room was clean. The problem is with there st","useful":0,"cool":0},"NAf21hgWDM1QWMJQtt87lg":{"text":"We absolutely love this hotel. The staff was very professional and kind. The room we staye","useful":5,"cool":7},"jhP3RK13PaEMGpywE_UyAg":{"text":"I hosted two events here this past week and stayed at this hotel for 10 days. Events total","useful":3,"cool":0},"2TH54-4KzLGQKbrNWNLyCQ":{"text":"I stayed here last year when it first reopened and the service was excellent, so we decide","useful":0,"cool":0},"G1S39TnoBocfvLxPv-1LFg":{"text":"I must say, I really enjoyed my stay at the hotel.  Nice room, great AC and extremely plea","useful":1,"cool":0},"FP0NA1rSMVig8wJ9Au7_gQ":{"text":"This hotel is in an amazing location. It's incredibly beautiful! \nWith all of its layers o","useful":10,"cool":9}}