{"jzfO6zmCBI6JOH_mCUtXrw":{"text":"Not only was the food excellent, but the people here are beyond nice-and genuine. I had eg","useful":0,"cool":0},"nIZshoo5BnWb5B7kUBLPnQ":{"text":"Great service. My husband ordered a cheese and bacon burger and I got the crawfish sausage","useful":0,"cool":0},"Fx6tqM5_oCbdpuzxRSf0qQ":{"text":"this place is solid.  the fleur de liis omelette makes my day.  I can also get a mocha, an","useful":0,"cool":0},"9r5PRlh3PfcjqwbQV0w2LQ":{"text":"Didn't care for this place. We shared the big easy breakfast and it was okay. The food was","useful":0,"cool":0},"iwk53IHGpcKei8NTiY82Vg":{"text":"Three letters, WOW!  Food was excellent and relatively cheap for the FQ.  Our waitress Ker","useful":0,"cool":1},"vMLyiyNWh-79Q1IB_4tqqw":{"text":"The food was good. Price was Ok. We were instructed to sit on a table next to the window w","useful":0,"cool":0},"4rab1QZpVwKSZoqBJE1XmA":{"text":"Great spot! Also has breakfast until 3 vs many places which end at 11. The eggs Benedict a","useful":0,"cool":0},"vSqsqHRO_NsoCF59FHhupg":{"text":"Horrible service!  There for an hour and a half and never got food. Six tables seated afte","useful":0,"cool":0},"wWalDKqtGY8FtTuPtm7oQQ":{"text":"If you're looking for a great place to start your day I'd go here. Great place for a simpl","useful":0,"cool":1},"3JY3kSJwD0yXZ4LG9S7Ccg":{"text":"Server was not good, I had high expectations of the food, but was let down. I ordered the ","useful":0,"cool":0},"g2vRN_MUU9R57m_wbEwH9A":{"text":"Excellent shrimp and grits for breakfast! A nice spicy barbecue taste to it. My husband ha","useful":1,"cool":0},"3srtblqw4l_CLfBF40GKDg":{"text":"We enjoyed both a great breakfast and a great lunch here recently. Our servers were friend","useful":0,"cool":0},"LeJC2cacyg_RRWlUf9c0zQ":{"text":"Open air to the street is nice.\n\nTables are WAY too small and cramped together. Service wa","useful":0,"cool":0},"Prd0eWz_BnFgHOfyUuZhwQ":{"text":"I dined here yesterday with two friends and we all ordered shrimp and grits. When our orde","useful":0,"cool":0},"jK8Cvl10YCLw3teWT_iFtw":{"text":"After reading the reviews we decided to try it out.  Waited about 1/2  hour and was seated","useful":0,"cool":0},"5vonnssXFuZ98m-oy8C2RA":{"text":"This place is GREAT and worth all 5-stars.  We wanted a big breakfast and we got it.  We o","useful":0,"cool":0},"7U3qs7XiyytBH_sUZAeaTg":{"text":"Had a great breakfast this morning. Met the manager Nick. Great guy. Loved the fact that h","useful":0,"cool":0},"7j43zIvEvHQ9lQV2t7ZEUg":{"text":"Waited 1 hour for a simple salad.\nThis place takes forever to bring out your food!\nThe ser","useful":1,"cool":0},"VCKcgdWxcT51BpuAqmAEIg":{"text":"Great breakfast! I had the egg, sausage, bacon, hash and short stacks! One of the best bre","useful":0,"cool":0},"J7GoaXwFjv0PnhhnhImsGw":{"text":"I would give them 6 stars if I could. We had a fantastic time at this restaurant. We used ","useful":0,"cool":0},"MGOKGSzaLGik43nSs0jYBg":{"text":"Greatest hash browns ever!  Get a slice I pepper jack on them!   Good coffee!  Eggs floren","useful":0,"cool":0},"TPfzU03AYOGeTX2TUxflYQ":{"text":"Really great food. Love that it was a great spot for a family to eat breakfast. Banana pan","useful":0,"cool":0},"IHjzsilj_KeiIDRpk8HMtQ":{"text":"Excellent breakfast! We asked for several changes - eggs medium, bacon and hash browns ext","useful":0,"cool":0},"vkLsobRDr2f2_fXtDiPkdQ":{"text":"We were extremely pleased with our omelets. Simple, honest and tasty food. The concierge a","useful":0,"cool":1},"CqkVVMETF_iBDtkgAKSvMQ":{"text":"My goodness!  This good was amazing. I had the Big Easy which came with eggs your way, bac","useful":0,"cool":0},"PvpenT3VcdaWks0bpeEcsg":{"text":"Our second time to Cafe Fleur De Lis!\n\nWe went to their other location a couple days ago. ","useful":0,"cool":0},"G1tUwRQAoYy2oeqabYft6Q":{"text":"Awesome cafe!  My friends and I were in town for Mardi Gras in 2011 and stumbled upon this","useful":0,"cool":0},"-pBAefZmcSiYFrDv5EmWSg":{"text":"This is a great place for breakfast! I had the Oyster Benedict. Holy Cow! So delish. The s","useful":0,"cool":0},"Jsho_yIdr1cSliu10SRyVA":{"text":"Service was great and egg platter was good but french toast was absolutely terrible.  It w","useful":0,"cool":0},"gxyi_87Oim0xgGDHfDS3Iw":{"text":"Ideal la forma como la espera a las afueras del local, se compesa con visitas cortas a las","useful":0,"cool":0},"CjeiC8h-rkBOszZUrdlvJQ":{"text":"Fantastic breakfast spot.  I went on two occasions and varying degrees of service both tim","useful":1,"cool":0},"1fAlh-jYL4bcWh27sI7yNg":{"text":"In NO on business, and always try to eat where the locals do, or at least avoid the chains","useful":0,"cool":0},"KTIvnYDSHXoc9XZS05KiAg":{"text":"This place is great! Local feeling and great portions of food. Servers are nice and effici","useful":0,"cool":0},"G2qvKsaUC43Wk2YX4yx_wQ":{"text":"Quiet place in a charming building with local art adorning the wall and great for people w","useful":1,"cool":1},"QLKT_PCFL_bxgxI6bFwH5A":{"text":"I'm from New York City so I'm used to omelets and oatmeal for breakfast and that's not an ","useful":0,"cool":0},"P-2XaKsF_uaHE6ZWn1iSnQ":{"text":"Good place for a good breakfast and coffee. \nSimple wholesome and good service what else c","useful":1,"cool":0},"UVtYhjlrDnkZY2xhYheyKA":{"text":"Tried this place for breakfast and it was superb. The shrimp and grits was delicious and t","useful":0,"cool":0},"jo7Ue66BJO9A2Wp-qUHioQ":{"text":"Good breakfast spot with all the basics for a reasonable rate. Well located whether you're","useful":0,"cool":0},"P0MwOcp1QaUwMg2Xb8MvxA":{"text":"Grabbed a quick breakfast here before a tour. Nothing bad, nothing special. Just a standar","useful":0,"cool":0},"1ZFcpyknYgUBFLnH7HuL4g":{"text":"Nice food but don't go to this place when their busy time, such as brunch time:))  \n\nAfter","useful":0,"cool":0},"lDXqTG2VbeJ3zKa6d0ZkFw":{"text":"The hubs and I flew into NOLA late the night before, so we crashed near the airport instea","useful":0,"cool":0},"UijIHYFT7ynKyxXTRoF84w":{"text":"Great great breakfast... Start to finish!\nCandied pecan smoked bacon, sweet cream pancakes","useful":0,"cool":0},"Q2EelDC5upkqmNL_e3kibA":{"text":"Visited New Orleans for the end of Mardi Gras and stumbled upon this little cafe for break","useful":1,"cool":0},"qCJ8Fr0EshJaBRaPCcfGGw":{"text":"Awesome place!! Good food and service!!!\nShrimp and grits are to die for. Pancakes are rea","useful":0,"cool":0},"v7lsesc_bMoB3rhxs9YvVw":{"text":"Arrived at 730 on a Tuesday morning and only one couple was already in the restaurant, we ","useful":1,"cool":1},"FopjowaaZHuHID-PHXaj3A":{"text":"I stopped here because it looked nice and my friends and I were starving. Upon entering we","useful":0,"cool":0},"2V7mGGncwcB9BLVgtU8rag":{"text":"I have to say that I stumbled upon this place by mere accident last January, and have been","useful":1,"cool":1},"k3KsS-I_Mtrc8MDPRUuQzg":{"text":"my husband and i were recently in NOLA for four days, which included three mornings.  whic","useful":0,"cool":0},"DZdDk1OTp7d-VSq9k9RpIQ":{"text":"The food was GREAT if you ever get seated. While I can understand it's a small establishme","useful":0,"cool":0},"JdgVJkGgpooSLBAwBZpvfw":{"text":"I was amazed by every dish and so was my entire party. This is real home town momma in the","useful":0,"cool":0},"55gEQ0zEvMQU5663LjrB6g":{"text":"Had Monday \"Brunch\" as I was in NOLA for the day. Food was exquisite. I had the bourbon ba","useful":0,"cool":0},"-Y_7LcQnX3pAKVDPM-QkdQ":{"text":"In NOLA for mardi gras.  The wait was 45mins. Customer service was really good. Everyone i","useful":0,"cool":0},"OhdXZCsotputIpOvsDigMA":{"text":"Besides busy hustle & bustle (which you would expect from any cafe in Nawlins anyway) this","useful":0,"cool":0},"Axum0bIN9eRFB-OlR1NLVA":{"text":"Two visits on my trip. Excellent food and service! Had the oyster Benedict and the seafood","useful":0,"cool":0},"ozyT7k6AY9qDAcN6hQD5Rw":{"text":"Stopped in here for breakfast and it was delicious! We ordered the Fleur de Lis omelette w","useful":0,"cool":0},"Bt59-AO6l77wLTZjChq98g":{"text":"Great service by Elena! She was attentive and helpful! The seafood benedict was exactly wh","useful":0,"cool":0},"NIhSszFYt-I-dW2mgSgCvw":{"text":"Best breakfast I had in New Orleans. I got their pancakes which were amazing and tried gri","useful":0,"cool":0},"eeIt9UrGf47MGnsAYlD6gQ":{"text":"We had not been to NO since Yelp was even developed, but have learned since to trust it's ","useful":0,"cool":0},"WclfJkSTz9htptSeTYTrew":{"text":"This was another touristy must do spot to eat that was also packed and had a long line. Th","useful":2,"cool":0},"T1yHBpmIwf13IGY9-87xig":{"text":"The staff was nice, but not a great meal. I had the ice coffee, which was just okay. I als","useful":0,"cool":0},"P9VD29i6StzeHkgDkdDbHQ":{"text":"Loved the breakfast here. I don't think this place needs anymore good reviews because we w","useful":0,"cool":0},"tiF_OtsXZUS1FLAxTov1cA":{"text":"Great place for a quick breakfast. If you're staying on Canal do yourself a favor and walk","useful":0,"cool":0},"kGjVwo4LR2GD3DaaLH6JOA":{"text":"Rude, rude, rude! Hung up on me on the phone twice when I was asking about wait time. Food","useful":0,"cool":0},"Atkqy7FYl5Ln_Zb1Dv7wbQ":{"text":"Was in New Orleans for Saints game. Heard about this place for a great breakfast. Went 2 m","useful":0,"cool":0},"C7BAZiQIdCQaej1EWg-WqQ":{"text":"Had the crawfish omlet, pretty tasty, didn't make my toes curl but it was decent. Was ther","useful":1,"cool":0},"d4FI1AmDfpD4AsBbJUEKeQ":{"text":"Totally decent joint for a quick, fresh breakfast.  My wife, the ultimate breakfast snob, ","useful":0,"cool":0},"5wKRNvENdEjW9crq4s37Mw":{"text":"My wife and I stumbled upon Cafe Fleur De Lis on the first morning of our trip. We loved i","useful":0,"cool":0},"FkjuW8nxxBUV7IaO_awDDQ":{"text":"Amazing food reasonably priced and great service! The best place for breakfast and lunch i","useful":0,"cool":0},"G4q8vlrHl6ps8xtV3VKGpg":{"text":"Delish!! Customer service was outstanding!!  I had the seafood benefit and it was great! A","useful":1,"cool":1},"mTfL1HRfuiK8qb8hqsWP8Q":{"text":"Came here while attending the Essence Festival food was so good we came 2 mornings in a ro","useful":0,"cool":0},"QQz2jLKPrY-_wDTaIi3EzQ":{"text":"I had the bourbon street breakfast.  I didn't realize it came with real bourbon which you'","useful":0,"cool":0},"Y5ue6Ey4Lwqa2gs-SOyGZA":{"text":"Mmmm.... HASHBROWNS... (what else can I say?) The food here was really good, it's a tasty ","useful":1,"cool":0},"zznqourTxLpMUAgEjULkaA":{"text":"Great breakfast! Reasonable priced. Latte was delish. French toast on brioche was superb. ","useful":0,"cool":0},"09vCbEgYAemwgt43Wf8Wvw":{"text":"The food is great here! There is usually a wait to get in usually (not unlike most other g","useful":1,"cool":1},"CjAluGDy8f4WhUrax7OYmA":{"text":"This is a fantastic place for breakfast and lunch in the French Quarter. \n\nIt's just hones","useful":3,"cool":3},"2y03hcOmVsMH5yJ6PObPaQ":{"text":"This place is worth the wait! Grab one of their amazing chocolate iced coffees while you d","useful":1,"cool":1},"2J3ph1BaxrRccftMbYwahg":{"text":"The kind maitre d' greeted me at the door and found me a seat at one of the few tables in ","useful":0,"cool":0},"kgJpJyc6vG2M_wuhgPuqIw":{"text":"Amazing! Incredible service to match fabulous food.\nShrimp and grits were out of this worl","useful":0,"cool":0},"gVa68ww1P6pA3eVogWlTIQ":{"text":"I honestly walked 20 minutes just to get to this place and was excited to give it a try...","useful":0,"cool":0},"Foz2lpyDpbLxnjx3dV5Hvw":{"text":"Food came out cold. Cappuccino was ok. Server was able to add smoked boudin to my farmers ","useful":0,"cool":0},"Po_77fcdVdqwK0xZLPCLCg":{"text":"The service is excellent!!  Ask for Joe!  He gave me the advice to try the seafood Benedic","useful":0,"cool":0},"M5unN9Y4QKjgiKM5ty0ebw":{"text":"This place is overrated for sure. The food is mediocre at best. We had the French toast wh","useful":0,"cool":0},"EpImcLRUOqiJs_iKinLYgw":{"text":"Bacon Bloody Mary was amazing - definitely a must here.  We also really enjoyed the seafoo","useful":0,"cool":0},"yyQNgSmrZ-4H5VHPi__S3A":{"text":"Stopped in for lunch. Waiter had no personality.  None of the wait staff were really frien","useful":1,"cool":0},"zSZQB0NHE7NLsY9RN6U7sg":{"text":"Great pick for breakfast in New Orleans!!\n\nFriends had come here on the day of arrival whi","useful":0,"cool":0},"nGZELQRvzGtWGzwqaB15AA":{"text":"Very basic breakfast joint with good food.  I had a ham and cheddar omelet.  The ham was s","useful":0,"cool":0},"lWcpFnIyyE00OvEsELQXAA":{"text":"This place is amazing! Encompasses the true culture of NOLA. The wait was a little long, b","useful":0,"cool":0},"Q6oMtAWj1x95Tz4CLlBwgA":{"text":"I had the Fleur De Lis Omelet and it was delicious. In town for a tech conference (SpringO","useful":0,"cool":0},"D0kAm8q7YyYq0TeTrO5QRg":{"text":"Ahhhhhh New Orleans, so much to eat, so much to drink .... but not a lot of really don't t","useful":0,"cool":0},"7srM9878vf2MRIu2GIlv7A":{"text":"Read all the reviews and was very excited to try this restaurant. So cute and adorable as ","useful":0,"cool":0},"bAa_blOwGx73R6tYLBDcxA":{"text":"I would have loved to write a positive review about this restaurant, however, the hostess ","useful":0,"cool":0},"rGD2awpIk3P4YpZQkDx6Iw":{"text":"We went here on out very last day in NOLA it wasn't too crowded when we arrived so that's ","useful":0,"cool":0},"cq01fcbAPVlzAjfvxu9UNg":{"text":"This place was really a New Orleans Style type breakfast. I grabbed the Buttermilk pancake","useful":0,"cool":0},"HHuCXWkcxgOfjbokb0CRpQ":{"text":"This is the best place to eat breakfast if you are in the fq!! The omelettes are enough to","useful":0,"cool":0},"-6ucn3vTSk3m2RV8Ltem3Q":{"text":"Avocado omelette.... love love love\nLots of goat cheese, asparagus, mushrooms, spinach, pe","useful":0,"cool":0},"Lq_HkWC7itN-Ab2qheOcyg":{"text":"I had King Cake French Toast. It was pretty delicious but a little crowded and busy enviro","useful":0,"cool":0},"x04GlJ3XZbNa2vo9pGWR6g":{"text":"Walked into this place for brunch on our last day in New Orleans and we were glad we did.\n","useful":0,"cool":0},"LUUzf99595a63huo5t0ZVQ":{"text":"Cute little spot, but expect to wait for a breakfast table. Check in through Yelp so you d","useful":0,"cool":0},"Gb3QAxMoU4gjcgk9YiMLFg":{"text":"This place is just incredible, the ambience is totally chill when compared to a lot of the","useful":1,"cool":0},"69Nap7NTBezINQoiEZs6gg":{"text":"Flavorful food. Fast and friendly service. Can't ask for much more out of breakfast. The s","useful":0,"cool":0},"bxmJmk_0lrUlWz_p2V8Nrw":{"text":"Great restaurant for breakfast or brunch! I started with a mango mimosa which was excellen","useful":0,"cool":0},"4cF7lFjrFb7Z0zinP85bTw":{"text":"Another New Orleans breakfast spot well worth hitting while you're in town. Fried Oyster E","useful":0,"cool":0},"Tm9HV53N42cr6y7j_Vy8rw":{"text":"I visited the Café Fleur De Lis several years ago.  Alone in New Orleans, wandering the st","useful":0,"cool":0},"fPXQbqTSUOTuYq1ilFtMFw":{"text":"AWSOME breakfast went back for second round. The \"Big Easy\" wad the Busines!","useful":0,"cool":0},"pjMb0raidZRuiIWP0PzYqQ":{"text":"One of the best breakfasts I have ever had in my life! The spinach and feta wrap with hash","useful":2,"cool":0},"58FNU7GKKUTtSV0bRHlacg":{"text":"This was a nice solid breakfast. I can HIGHLY recommend the sourdough pancakes as they are","useful":0,"cool":0},"cG8nurgLUUjEI5MSF5GgQg":{"text":"Who knows how the food is. We've been waiting almost an hour and haven't received it yet. ","useful":0,"cool":0},"FHCT_LQiM1OPh1ynJ32ASg":{"text":"This place has been on my list of places to eat for a while, so clearly it was the first p","useful":0,"cool":0},"HZxJ144indJ1dI0RuCveHA":{"text":"I was starved and this tiny place served up some deliciousness. I had an omelette, hash br","useful":0,"cool":0},"g65Wa0Nd2UtBqH-OK8EDkw":{"text":"A friend and I found this little cafe on our way back to the hotel one afternoon and decid","useful":0,"cool":0},"MBc_cViF9IGSENmHboLjGQ":{"text":"Best shrimp and grits everrrr .. it's small so expect to wait to be seated but they are ve","useful":1,"cool":1},"skA30QI9cTvP61tY-Ldeqw":{"text":"What a wonderful New Orleans breakfast. I love the light that enters this restaurant in th","useful":0,"cool":0},"IPpFUkefHjYtGbDPwKo03Q":{"text":"Let me start out by saying that I loved my breakfast!  I had the crawfish omelet, and it w","useful":0,"cool":1},"L6889_LBiwSr6OeAPNrPnw":{"text":"Cramped little place in the Quarter.   Great food so it was worth rubbing elbows with the ","useful":0,"cool":0},"ghAtzUkGTGHAyKrEEIRnOA":{"text":"The overall rating of 3.5 doesn't do this place justice. The food was seasoned exceptional","useful":1,"cool":0},"0N06mJnVvmyCEJZs9gxxyg":{"text":"I was so excited to try this place because they had a great yelp review and it was recomme","useful":1,"cool":0},"-kMbLmgMBLQYJSQg5dBXng":{"text":"Visited this breakfast spot while in NOLA for the Essence Festival and like everywhere els","useful":2,"cool":1},"NByi2x1LwpeeoSk1900u4Q":{"text":"Pros: the eggs Benedict was amazing and so was the French toast. I would recommend them bo","useful":1,"cool":0},"pq8f28V_Jtt_AAmCATYy6g":{"text":"Terrible service, one of the worst Bloody Mary's I have ever had, and one of the saddest B","useful":0,"cool":0},"WmsDGP8lzXitSz37KptYcg":{"text":"Beware!!!! New ownership!!! Not same place at all!! I am so dissapointed in food amd servi","useful":0,"cool":0},"zs5df3zD_SUlHPonDzGvZA":{"text":"Meh. Friendly server. Painfully slow service. Very loud. Food was ok but nothing rave-able","useful":0,"cool":0},"q9q6M59NTCOA9vE_GSgT_Q":{"text":"Stopped in for breakfast on a rainy Sunday afternoon.  We didn't have to wait but a minute","useful":0,"cool":0},"lCFdhEuYrdyY1_njF7_dsQ":{"text":"This was a horrible breakfast and diner area. Took very long to serve and extremely unplea","useful":0,"cool":0},"vN9DFz1Xn0TDqpYjvgaBHg":{"text":"We tried Cafe Fleur De Lis on our recent trip to New Orleans. Using the factors of atmosph","useful":1,"cool":1},"XRk_0DY-iNJVlt9J7RwdPg":{"text":"GREAT PANCAKES! It would be 5 stars if I rated solely on pancakes. My sons french toast wa","useful":0,"cool":0},"lzTqQL7WeiHNtHlKckZjYw":{"text":"This place is the definition of no-frills. The food is decent and plentiful. The decor\npre","useful":0,"cool":1},"89EbYWXcNvfn0RiLD6l8KA":{"text":"This place sparked my love for shrimp and grits! ...and bacon bloody marys. Yes, bacon blo","useful":8,"cool":6},"l7_jUvPQW9XDFa9-U0nKrw":{"text":"Cutest spot we've visited so far. The ambiance is great, very friendly service and the foo","useful":0,"cool":0},"_WWwMQ9IDfMlW-_ixRwUhA":{"text":"The highs - prompt service, food delivered fast and hot.  GREAT pancakes and large portion","useful":1,"cool":0},"huXlZupRkR8J1Gp6vHr4Gg":{"text":"The best breakfast ever!!! And the best service our waitress Kim was wonderful.:. Try this","useful":0,"cool":0},"15b9Dv9g4NkiDFVy-8A2lQ":{"text":"Not worth the apparent hype that seemed to revolve around this place.  Our Server was nice","useful":0,"cool":0},"Z_-Qv6-bBCrp_78nOfOdAg":{"text":"Fantastic! Been here twice in two day inNOLA and will be here the next two days. Bacon Mar","useful":0,"cool":0},"GNWX_OCsXojgJehOJM0Pqw":{"text":"I had the the regular american breakfast.  Why the 4 stars and not 3 stars like Ruby Slipp","useful":0,"cool":0},"th3mHjUsFWk6aGuNLz0k1w":{"text":"Got to try place! We got there just in time before the crowd and it was delicious  Eggs Fl","useful":0,"cool":0},"Pz7i4Fr3ivVeO2IzIeqx0w":{"text":"Absolutely amazing! Food, atmosphere everything was wonderful! I'm very happy they allow u","useful":0,"cool":0},"wAKh75DADer41aqaqD_OEA":{"text":"Snotty hostess, unless you like stink eye. Runniest hollondais ever.\nGood otherwise. \nDon'","useful":0,"cool":0},"nx0-yjA7-DvJdjZxWRXWRg":{"text":"This place is a quaint little gem.It's easy to find and you can get a whole delicious brea","useful":0,"cool":0},"-il3VrG3nAeHPO9YFn3D0w":{"text":"The seafood benedict was arguably the best eggs benedict I've ever had. My husband had the","useful":0,"cool":0},"bnry8vmy70hQJZwUvQuHQw":{"text":"Mediocre all the way.\n\nWe were looking for a good bfast, and was sorely disappointed. The ","useful":0,"cool":0},"T993GuQz_TIJIk0jYLU9oQ":{"text":"So I literally was the first customer of the day...but the other day I walked by the place","useful":0,"cool":0},"khhKYfrJcmPDh01wL5xu5A":{"text":"We went for brunch on Wednesday morning.  We were seated quickly and our waiter arrived pr","useful":0,"cool":0},"9FUCXBa2mprhszHQC1UBUA":{"text":"Best pancakes ever!! The pecan banana pancakes are a must have!!! I'm never eating pancake","useful":0,"cool":0},"zSR6pS2GeXZ9oEKsebfzww":{"text":"cafe fleur de lis has a simply amazing breakfast menu.  the everything hashbrowns were hea","useful":1,"cool":1},"3RToWi6Q3HQp_EyKA9HGhg":{"text":"Very friendly service. I ordered a cappuccino and the spinach and feta wrap. Both were exc","useful":0,"cool":0},"Z-QYHBGTX9NtfbDweWjW5w":{"text":"Great coffee, cute atmosphere, and amazing food! Bananas Foster French Toast gave me a new","useful":0,"cool":0},"l6p8RYbB44YNx1Z1NEh4gQ":{"text":"No wait, no rush. Southern hospitality. Everything you read already about their bloody Mar","useful":0,"cool":0},"fvIVZzq8xCxRYeR86DJMUQ":{"text":"Plain interior, ok service, bland food. Not bad, just not worth it in the plethora of Fren","useful":1,"cool":0},"EfJby3Q200u4yauPWWf61w":{"text":"Hassled us about our service dog, messed up both of our orders. I'm pregnant and can't hav","useful":0,"cool":0},"dbzIm-eo82fhHYJ6oqXLQA":{"text":"Delicious! Loved every bite! Biscuits are amazing, shrimp & grits... Met my expectations! ","useful":1,"cool":1},"3NCaHuDWIsyb_yx3QPnG8A":{"text":"Best to check in on here to get a table because there is usually a wait. Coffee is strong ","useful":2,"cool":0},"haUYeVVtzcnpIRDFmKU94w":{"text":"Chaos. Food barely warm. Cooks cannot keep up.. This place needs competent cooks. Never co","useful":0,"cool":0},"yWD7Cw3qbCyEKSOjB0BYUQ":{"text":"Excellent breakfast.  The boudin sausage was great, as were the grits and the biscuit was ","useful":0,"cool":0},"a5grEdgQf4Yvkz6eBBKd-g":{"text":"Stopped here for breakfast recently and the food was damn good.\n\nI had a mango mimosa with","useful":0,"cool":0},"elQDosQbgo-v0_zehlrPiw":{"text":"The food was amazing!!! Service totally in point! \nI had seafood egg Benedict. A slice of ","useful":0,"cool":0},"vfojNQ6jCjZ2kqK9vNuzCw":{"text":"Cafe Fleuer De Lis is one of the great breakfast places that abound the French Quarter.  W","useful":0,"cool":0},"EJ1StDzRTj7TIzqbamcExA":{"text":"came here for breakfast on a sizzling summer's day. the place was poppin inside. the wait ","useful":0,"cool":0},"OGFYU75BJhiQsf62BeDL_A":{"text":"I was attracted by the reviews which were enticing. The service was deficient by deliverin","useful":0,"cool":0},"XGiKVwsNd-_kh3MM1mQFIQ":{"text":"We stumbled across this place while walking through the French Quarter on Sunday morning. ","useful":1,"cool":0},"CEAL9Ep3eEjsk3oHG9UMnA":{"text":"Other reviews spot on.  You wait to be seated but they will text you.   You wait at the ta","useful":0,"cool":0},"jyvikv2Kh2-x_fw3ro8GNw":{"text":"Had the pancakes and were honestly not too impressed, almost tasted a bit raw. My friend h","useful":0,"cool":0},"VOJP6Eq1OiDjUBXP9xCsiw":{"text":"Cute little place to get breakfast after a night on bourbon st. Lots of good fast items to","useful":0,"cool":0},"ezDhHi28mvS0FhnxY5XvnA":{"text":"I really wanted some shrimp and grits for brunch and found this hole in the wall spot. Fro","useful":0,"cool":0},"Cm97D66dE0xYmj4pHLVyHQ":{"text":"There aren't enough good things to say about Cafe Fleur De Lis! The shrimp and grits was a","useful":0,"cool":0},"EIRy_YzPbhhN2n6DJChY1g":{"text":"We were walking around the French Quarter looking for a cool place to eat and stumbled upo","useful":2,"cool":0},"KPJmQ7CM7wyu4QXnOvkjPw":{"text":"Best muffuletta in NO.\n\nDone perfectly with slightly crispy edges of melted cheese and per","useful":0,"cool":0},"gALX5dRzgZ8hSemUiFU12A":{"text":"Great breakfast spot in the quarter. Very busy, noisy, and tight seating but the service w","useful":0,"cool":0},"gWa3Cv34MEdakR7ONIzs5w":{"text":"Awesome pancakes and (mostly) friendly service. A good French Quarter hole-in-the-wall for","useful":0,"cool":0},"T9pUumMV3RDY-dxxvmYSsg":{"text":"Crawfish omelette with crawfish étouffée was delightful!! Gosh these hash browns in Nola a","useful":0,"cool":0},"6jKBqYS8Yqy9pBhcu9E71w":{"text":"Great place for breakfast! The weather was fabulous so the doors were open as well as the ","useful":0,"cool":0},"_o0CyRyaLXX3-KZRJlu21w":{"text":"Delicious breakfast while in NoLa. Service was great.. it's a tiny place, but they make it","useful":0,"cool":0},"BK7Gnbd4Z_oISjfTEtqY0A":{"text":"Not recommended if you are hungry. Unable to provide timely service. Food could be better ","useful":0,"cool":0},"rHyhDcmhVDKhAPkGaYh_FQ":{"text":"Excellent breakfast for the price point. We both enjoyed our omelets but the hash browns w","useful":0,"cool":0},"4hnbB_1eXZ3XWR-xnOgMBQ":{"text":"Came here for brunch on a Monday by suggestion of one of the merchants across the street. ","useful":0,"cool":0},"5Vsx3R9G2c0TqglytDIztg":{"text":"I really enjoyed dining here, more so than the Ruby Slipper. In fact, my party and I dined","useful":0,"cool":0},"f4A_PzoOir_d2EvQ-33YEA":{"text":"Best brunch I've had in New Orleans. Shrimp bloody Mary's, fried green tomatoes. What more","useful":0,"cool":0},"q6kstXQI4_w3bF_2wYFCBQ":{"text":"I used to like this place but just had breakfast there and was disgusted by the number of ","useful":0,"cool":0},"GyOOEAJ0Qqop0MV1OX0K1g":{"text":"We came here on Saturday morning, expected to have a small wait. Food however is average a","useful":1,"cool":0},"5rM6RJ8OPm96g5t28OkygA":{"text":"I was visiting NOLA for the first time and this spot was a block away from my hotel. Tried","useful":0,"cool":0},"0dcgn8RBT6vD51NYSv9BMA":{"text":"It should be illegal for food (and drinks) to be this good!! Get the Oyster Benedict! You ","useful":0,"cool":0},"AdDWQGOQc2PbexbDQyURgQ":{"text":"PERFECT breakfast spot. We ended up going twice in four days, I got the seafood benedict b","useful":1,"cool":1},"GpkU4_x7AuWDISz5BbmGyQ":{"text":"This is, by far, THE best food I've had in NOLA!  Had the boudin omelette, fried green tom","useful":0,"cool":0},"CK-PksEITMsp-uExyQqGlQ":{"text":"The fleur-de-lis is one of the many well-known symbols of New Orleans, probably most famou","useful":1,"cool":0},"1a0mXIMXxIqdlDS3iVEnFg":{"text":"Still have yet to get our food. Smells good and looks good, wish I could taste. Don't come","useful":0,"cool":0},"-UCi_LECEeo18uEFt-qUHQ":{"text":"Really busy in the mornings but the food was worth the wait. We had eggs Benedict, pancake","useful":0,"cool":0},"9hSY9BiOmN5PhUW9h_M4xQ":{"text":"The food was really good and the waitress was very kind. But I can't help but feel that th","useful":0,"cool":0},"6UoUNXUtfeHwbjuy8lBORg":{"text":"Best meal I've had in New Orleans during my stay. Great service too. Highly recommend the ","useful":0,"cool":0},"_RMDxmrTJ1Ccpe6BJ_xUkA":{"text":"Eggs Benedict was AMAZING! Excellent brunch spot! The wait time was reasonable for a Sunda","useful":0,"cool":0},"0obV1IQUILEhE10-a0nX_g":{"text":"We went for breakfast on a recent trip to New Orleans. My wife ordered the shrimp and grit","useful":0,"cool":0},"Ng7PyU3QgLE5LF-Ew99Lnw":{"text":"I have a food allergy so I have to be careful of what I eat. Here I had the seafood Benedi","useful":0,"cool":0},"Uwpcs-YzeHwhKxa1xcLjhA":{"text":"This place was tiny, packed, and full of amazing flavors. I went in for breakfast by mysel","useful":0,"cool":0},"rtuAF6sq3ce-sY7CmwUucg":{"text":"Sat down with another group in front of us and was ignored for 25 minutes. The group in fr","useful":1,"cool":0},"dyy86Ey_gT-lRMaeyM6mwQ":{"text":"I ate here with brunch on the last morning in town before heading back home. This is a pre","useful":1,"cool":1},"mDXV741CJAcbvNzGRy1kzg":{"text":"Had the Spicy Boudin Omelette with hash browns; absolutely fantastic!\n\nThe best breakfast ","useful":0,"cool":0},"QvJMR6EIS9nxL6qj_ALZyg":{"text":"Great brunch. Small, quaint restaurant with an excellent, friendly team providing attentiv","useful":0,"cool":0},"5adBbRe6MdK-LYILB33xJg":{"text":"Don't bother waiting to get a seat. You can place an order and wait for over an hour for y","useful":0,"cool":0},"W9uKhIuxMRcM6Q6q1KRU2w":{"text":"We met up with a couple friends for brunch on Memorial Day, and the service, food, and dri","useful":0,"cool":0},"23oNyIhLBA9PbZLanJYPiA":{"text":"Horrible experience. We didn't get anything we ordered. Ordered grits, got hash browns. No","useful":0,"cool":0},"vTXI_zBKUDHxvq23gTWUtg":{"text":"We were looking for a place to rest and have a nice late lunch. The decor is simple but th","useful":0,"cool":0},"pfaUHxSvMloGqz0QyvV-yA":{"text":"Most delicious brunch I've ever had! I had the seafood Benedict and I was in love. I would","useful":0,"cool":0},"6p-ZxtMMmHA9om8wqTPzSA":{"text":"Great hole in the wall with large portion (but not too much that you waste food). Worth th","useful":0,"cool":0},"xtZH3xPS_W9di4DvRFHFbA":{"text":"Possibly one of the best eggs benedict I have eaten, the portion is huge, and amazing valu","useful":0,"cool":0},"Wp2Oluc6_dvZkinT_nE1Uw":{"text":"Fleur De Lis serves straightforward breakfast fare and sandwiches for lunch. Its surely be","useful":0,"cool":0},"QiF0qsR5ZebVQvwf2EyVCg":{"text":"Amazing breakfast had here, pancakes were cooked to perfection. We all three had the Big E","useful":0,"cool":0},"1S5O-xwi-j1mSfEQyo7Jnw":{"text":"Overall a nice spot for breakfast. My oyster Benedict was good and very filling. Prices ar","useful":0,"cool":0},"Gbjuw-EsEvRVgA5Jgh40kQ":{"text":"Stopped in for brunch around noon after calling to our our name on the waitlist. We waited","useful":1,"cool":1},"GcIwV1v0Q4ukvyg1TzUo_w":{"text":"Breakfast at Cafe Fluer De Lis. The Bourbon Street breakfast pancakes were the best pancak","useful":0,"cool":0},"SYe3fYteiYFqL-vPxhEoqg":{"text":"This place is outstanding. Tucked on a quiet side street in the French quarter, we first w","useful":0,"cool":0},"4ekLk3N9rzcOzYFDqeIjBg":{"text":"Food was Good! Great place for brunch and lunch. Kind of small so make sure you get a rese","useful":0,"cool":0},"yV2hmdDnYoXOE1aiesuUWQ":{"text":"I REALLY wanted to like this place. The pictures of their sumptuous breakfasts made my mou","useful":6,"cool":3},"YkI1DQve5Kz0Wfk7uNtKBQ":{"text":"The hostess was very rude. Their were two empty tables and a line of people waiting to be ","useful":0,"cool":0},"-fTtBCeE2HkQ5zxp446ivg":{"text":"As it was already past noon on a Tuesday and we wanted breakfast fast, this was the right ","useful":0,"cool":0},"zkIVzIj_GT8M4NKyPBkBgQ":{"text":"Must eat place in NOLA!!! Great way to start the morning on vacation!!! Food melts in your","useful":0,"cool":0},"YHKcaVb8L507tyFh8n_Tig":{"text":"Our meal was amazing as always. Joe is an awesome waiter. Not only is he polite and attent","useful":0,"cool":0},"5uNaMGbBGC0zvTLbx48I5Q":{"text":"Get the Fleur-de-lis omelette. Not usually a sausage fan myself, but come out of the close","useful":0,"cool":0},"F6aHPaexK1HQhHBkoamzfw":{"text":"Enjoyed breakfast. My husband had the boudin and I had the two egg breakfast. Very friendl","useful":0,"cool":0},"F-HOvNRKUkY0oL_6W94cKQ":{"text":"Recommend!  Might have long line but it goes fast.  Young blond girl who is hostess is ver","useful":0,"cool":0},"J0b2J7tTOZfM9s8ufKJWpg":{"text":"First of all this is a very small lovely quaint breakfast restaurant that has a lot of cha","useful":0,"cool":0},"jvfIU8yqOXWCe557cy1cwg":{"text":"On the last morning of our trip we decided to walk around the French Quarter and pick out ","useful":2,"cool":1},"qD7kRYWjANA0ekPVqPlVhw":{"text":"Best. Breakfast. Ever. \n\nI had already looked at the menu and knew I wanted the eggs flore","useful":1,"cool":0},"mS2mNaz4PduygLrpoYN3cg":{"text":"Major disappointment. After reading positive reviews and seeing the line out the door, I a","useful":0,"cool":0},"O71oJHY0uEMR2LI8EdQFbw":{"text":"What a wonderful place for breakfast and lunch.  Shrimp and grits wuth eggs on top was del","useful":0,"cool":0},"wJJCppMOKXp08z3yp41NeA":{"text":"First breakfast on my weekend trip to New Orleans. I'm not really a breakfast eater so I k","useful":0,"cool":0},"fDuHMcfSDUBYdT7fNcQ-nw":{"text":"Great breakfast and waiters were all in good spirits.  The pancakes were the highlight of ","useful":0,"cool":0},"P6dGa4rN4dNtTAciCVNOXw":{"text":"The best shrimp and grits I ever had.  I wasn't sure why this place had less than 4 stars ","useful":0,"cool":0},"AS7lAMziyWiSqyxh71Wtrw":{"text":"Came here for late breakfast at lunch...food and service were excellent.  Small place, but","useful":0,"cool":0},"90lshsHIfVpoSPxfaDIx4A":{"text":"I'll say this, anything worth having is worth waiting for and I am so glad that I waited! ","useful":0,"cool":0},"AUoyqkJ9dGmfRDEr7r_T0A":{"text":"We waited 45 minutes for the food but it was worth the wait, ordered big easy breakfast wi","useful":0,"cool":0},"V1TsRsTeLA2FY4dzyoR0qA":{"text":"This was our first stop in New Orleans and it was so good! The atmosphere could've been be","useful":0,"cool":0},"BswMypzPY6-Ko1mt9oA_8Q":{"text":"We found this place by accident and we were so glad we did. Employees were very friendly f","useful":0,"cool":0},"YAZRyCgefoLwbfQrD9fAAg":{"text":"The food is very good!  That is why I overlooked the horrible service on my first visit.  ","useful":0,"cool":0},"tyt2ORco235FnAcclXJdDw":{"text":"Beautiful courtyard!! So quaint and special!  We had great bloody Mary's!  The food was fa","useful":0,"cool":0},"rj_vh0kicXWlKtK_HPX5zQ":{"text":"So damn good. The varied breakfast options are winners and the service was terrific. Nice ","useful":0,"cool":0},"Ttnpp1BQeyRRRINuJ9sJqA":{"text":"Beware...Rude service by their manager!\nOn Sunday, Memorial Day Weekend...\nI stood in fron","useful":0,"cool":0},"z7qKci02hiX3Zt78jqEwaA":{"text":"Best stop ever for breakfast!!!! Wait time is nice. They'll text you when your table is re","useful":0,"cool":0},"xjhN8BYtj6k0BjGs7Aouvw":{"text":"Had breakfast at Cafe Fleur De Lis while in New Orleans in July. I had the shrimp & grits.","useful":0,"cool":0},"j4_489NL2xRQmFdVSSEa-A":{"text":"Food was yummy. Really enjoyed my breakfast. My cousins enjoyed their breakfast as well. E","useful":0,"cool":0},"4kvAmYVMVh_E5_mke8GjBA":{"text":"Visited this place again cause I loved it so much the first time and it didn't disappoint.","useful":0,"cool":0},"ro0BVyDwUL07FqEunUxvtw":{"text":"They had a sign out on their street menu board one morning that said, \"Shrimp n Grits\" and","useful":0,"cool":0},"QMCnKVrTPRL93iX3xnPlDA":{"text":"We had such an amazing experience at Cafe Fleur de Lis. The seafood eggs Benedict was amaz","useful":0,"cool":0},"VGgt9gXMgC0KZ4-McUkmsA":{"text":"Great combination of Super friendly service with a delicious breakfast! Enjoyed their sign","useful":0,"cool":0},"FTsvoJ8OkHiuq7xIKZGzDw":{"text":"Highly recommend seafood eggs benedict. Promt friendly service.  My triple espresso over i","useful":0,"cool":0},"0cQC5W7FbQqR7PCM0q6QSA":{"text":"Clean, bright nice decor, and not loud, all the things I like. Service was excellent and s","useful":1,"cool":0},"-wkGJ8TkxP3qv02w6V-zbw":{"text":"This place serves up some of the best breakfast in the french quarter.  We ate here on a r","useful":1,"cool":0},"sKPJ8-utr9EJEowiy4pKwA":{"text":"Have the French toast or the fleur de lis omelette! Both are de-lis-cious! \n\nWe went in tw","useful":1,"cool":0},"fntBjxbn-L5kpiZRVBRzfg":{"text":"No bottled water. Hash browns had tons of pepper making them inedible, ordered over medium","useful":0,"cool":0},"vW3U4m989uUZ6XG2wLbFgg":{"text":"Yummilicious! Stopped in on my way to Spa Atlantis and enjoyed eggs, bacon, sausage, hash ","useful":0,"cool":0},"bjAwJFUS86N9F7WUqTzE9w":{"text":"There can be long waits, but we got there just as they were opening, and now we know why s","useful":0,"cool":0},"HtDmmILqQhybmF_gCNlO4A":{"text":"A must try! Everything was amazing from food to service. Great prices too. Had the chocola","useful":0,"cool":0},"p2PFa9aO9m1I_JfIYn-Lpw":{"text":"Food and bloody Mary's were great. Wait time wasn't bad especially joining the waitlist on","useful":0,"cool":0},"ocg0i2fyb3sZURb0N_ckcA":{"text":"This place has all the breakfast basics, so nothing really special. I ordered the 2 egg om","useful":0,"cool":0},"kee4rmvPcYuSgtZBkJBZ3A":{"text":"Was there for lunch this past Sunday. Placed order and after waiting an hour four our food","useful":0,"cool":0},"X4SQVGVRj0-5cIdUo736VA":{"text":"If everything in life was served on a biscuit, we would be pretty large, but life would be","useful":0,"cool":0},"3krYUsxZ3cRVJiwTuDyjuA":{"text":"Pros: \nFamily friendly, convenient location, great crowd, clean and no drunks in the resta","useful":0,"cool":0},"rIjV8V4CSy_iThmtb_yQvw":{"text":"Loved every part of our breakfast. We ordered the Creole Country breakfast & Shrimp & Grit","useful":0,"cool":0},"Y5DHLBWkUwUX0HvGQCJu6Q":{"text":"Adorable restaurant with tons of charm. Its multiple levels and used to be someone's house","useful":3,"cool":1},"4m0Nmn0jXZzc7Y5O6i5N6Q":{"text":"Recent trip to NOLA for mardi gras and we hit this  bad boy up twice. food was soo bomb. I","useful":0,"cool":0},"QiH9GBloTVzG-wQI6bN5wA":{"text":"My wife and I got the feeling that they couldn't be bothered with us.  We are 40+ affluent","useful":0,"cool":0},"iaWMWqqRUwSAmhFs6qdnsw":{"text":"Enjoyed pancakes, chicory coffees, Cajun omelet, and shrimp and grits (wow) on our first r","useful":0,"cool":0},"s56J7GMgK0POVViVHyveiA":{"text":"Best breakfast in New Orleans! Banana pancakes are to die for. And the servers are so nice","useful":0,"cool":0},"LhXzxl7M6AWGnSEXQ2gF1Q":{"text":"Just an ok place, typical so-so food, nothing to write home about.\n\nI ordered omlette Fleu","useful":1,"cool":0},"KClzbwZNLEeC7ajYIHbnHQ":{"text":"So let me say that I preface this with I have eaten here many times over two years ago. I ","useful":0,"cool":0},"FaX1XlZVtbMilGhKwqGz9g":{"text":"This place is much more diner than cafe, i.e., not the cleanest place I've ever brunched. ","useful":0,"cool":0},"tBxqpxn49hq3yCERI0s6OQ":{"text":"Holy moly they have some good shrimp and grits. It has a garlic gravy and cheddar cheese t","useful":0,"cool":0},"lNMkV1Fo7d1Uz43jxJuPIw":{"text":"Yum! The Seafood Benedict was delicious. The homemade biscuits were wonderful and fluffy. ","useful":0,"cool":0},"UN9bz9vRmvXijSD2IqBv_w":{"text":"Had breakfast here this morning.  The service was so so and the food was decent.  The egg ","useful":0,"cool":0},"aU42r1h65qAPYLafICUkUQ":{"text":"I went last year and food and service was wonderful. Came back today with high expectation","useful":0,"cool":0},"JDI78L4HF_200gmx0zd7hg":{"text":"This place is terrific!  Friendly, attentive staff and the food is incredible. We had panc","useful":0,"cool":0},"3chjlC4dBtTJQrg5lE7dmA":{"text":"Absolutely delicious breakfast.\n\nAll four of us agreed the pancakes, moist, with a strong ","useful":0,"cool":0},"-GP5zHBzjG2PN81oKG-glQ":{"text":"Ok, so the grits were the best I had in NOLA, but NO GLOVES being used by cooks.  I watche","useful":0,"cool":0},"MOkeRFedLnhKmN38Gpcrlw":{"text":"We were tired of our free hotel breakfasts, so we set forth into the French Quarter and le","useful":0,"cool":0},"YVskzcVYSbbto_RbHaw-hA":{"text":"This place is wonderful. Cozy with great food and service. I randomly decided to take my g","useful":1,"cool":1},"lDkl2EvdXlSjdWmWNHfLRA":{"text":"best breakfast for an affordable price! during Mardi Gras season they offer king cake fren","useful":0,"cool":0},"JaO1HQ7cITj6d31mtCQ7GQ":{"text":"Had breakfast here and it was great!  Mimosas were strong, coffee was huge, and the food w","useful":0,"cool":0},"M3jokUtfVx8l19LdPKuqbg":{"text":"OBSESEED!! thank goodness i listened to the reviews and got the shrimp and grits! It was b","useful":0,"cool":0},"eXBBcI0ISoWRYde70kQRdw":{"text":"This place is AMAZING for breakfast - cheap delicious mimosas, classic hearty breakfast, e","useful":0,"cool":1},"4VlfOP_QLmwb6qonoblsrA":{"text":"Stopped here on our 1st morning in NOLA because it was close to our hotel. WHAT A GEM! The","useful":1,"cool":0},"bBbRx47G2d7uD1H8STlSfw":{"text":"The chef was angry and you could hear it,  the staff did their best to put smile on face s","useful":0,"cool":0},"74kIPjNL0NDmIO7NaVKTYQ":{"text":"Super disappointing. After standing in the rain to get in, the food was not good. My husba","useful":0,"cool":0},"90beywqb29IU8dqQR6HJbg":{"text":"Great service from Joe & the food was amazing too! I had the boudin omelette, my fiancé ha","useful":0,"cool":0},"rxR1hAMklM7LIT8-OAct2g":{"text":"This place is a hidden gem! After reading the reviews on Yelp I decided to give it a shot,","useful":0,"cool":0},"HOG-iKCYN2aKYoqqlSjdyw":{"text":"Very cute & very New Orleans!   I'm not a Bloody Mary person, but after having a sip of my","useful":0,"cool":0},"b1Sal32vBVid0grIc3PRuw":{"text":"This was one of our favorite meals on our trip. So good we had to come twice!  The shrimp ","useful":0,"cool":0},"bnROtlyblOlE5vVY2O96sQ":{"text":"Great breakfast spot!\nHad the blueberry pancakes with some coffee.\nGreat portions and reas","useful":1,"cool":0},"HxWMKfycNEAxiVigYg-C2A":{"text":"Vacationing in new Orleans, we went here for breakfast. Very good food and friendly servic","useful":1,"cool":0},"aZBfZ_BwwDl1x-Qm5am85w":{"text":"A great Bistro with creative drinks and menu options. Everytime I'm in New Orleans I have ","useful":0,"cool":0},"Sh7_Hv6_eYK-jGtGpWBZIw":{"text":"Breakfast was so delicious!! Came here after seeing some good reviews on yelp and trip adv","useful":2,"cool":0},"exx5QDeHvh_qtaWLlIDUbw":{"text":"This was a cute restaurant. It has downstairs and upstairs seating. Not overpriced at all ","useful":1,"cool":0},"99gO0Lfi6uMTtc5uPtOKhQ":{"text":"Had the Seafood Eggs Benedict and it was very good. Others at our table had the breakfast ","useful":0,"cool":0},"yu-DE0aWedLOrf723DwuCw":{"text":"To start I had the bacon bloody Mary. I thought it had some sort of funky taste to it that","useful":0,"cool":0},"-vzZWphpUflRADiL4AoH5w":{"text":"The best shrimp and grits in town. You cant go wrong with anything! Seafood benedict, panc","useful":0,"cool":0},"XFh-axCyj2p2cjJohAwcXQ":{"text":"Not the best breakfast I had but not the worst by far either. Very generous portions make ","useful":0,"cool":1},"V1_f1ocsXRnh5bwfJ3Yk7Q":{"text":"First day being in Nola and came here for breakfast. Cute little spot in the french quarte","useful":0,"cool":0},"29Z93f6QHm2gQNDHg8NWuQ":{"text":"Awesome and reasonable for breakfast in New Orleans.  Cheaper than the hotels and much bet","useful":1,"cool":0},"o6M2zfZTbRvhcSRvfpS7lg":{"text":"Let me start by saying I did the no wait app but still had to wait an additional food whic","useful":0,"cool":0},"b_VyQHMBziVQwVdoLELwAg":{"text":"We ate here twice for breakfast during our stay in New Orleans. Its a busy place and the s","useful":0,"cool":0},"MXlrDO9iebP1qpu55cufqQ":{"text":"Maybe we caught them on a bad day, but this place was a major disappointment. \n\nWe walked ","useful":2,"cool":1},"tSIcDYWn7kXBR3Rcpww_ZA":{"text":"I love spending time in the quarter when its peaceful, its like a whole different place th","useful":0,"cool":0},"s2ES9WXdqr6_ppntYX92UA":{"text":"So my friends and I are in New Orleans for essence festival. We were yelping popular brunc","useful":1,"cool":0},"vrbmVdWv8kAU2znVsVeFTg":{"text":"You have to get the bacon Bloody Mary, thee best I have ever had!!!!! Went a few times whi","useful":0,"cool":0},"--7X039CDFw_E_4gmO9WvA":{"text":"Very delicious food and very attentive staff. It's a quaint little restaurant that deliver","useful":0,"cool":0},"n4mxpXSDNCYbeCE1ueFVBQ":{"text":"Very nice casual breakfast / lunch venue. There is a reason for the line. Great po-boy sel","useful":0,"cool":0},"QQYjRbEfv62YXKBxZ8Lp3g":{"text":"Found this place on yelp searching breakfast brunch location that would be tasty on my fam","useful":0,"cool":0},"VlJnUVFzmGb4xyJhwpcFwQ":{"text":"OMG!! Their food is so good!! Seafood Benedict can't be topped. Eggs cooked perfectly and ","useful":0,"cool":0},"PrmKM0gbk74GRrN89jHQ5A":{"text":"Great breakfast with good prices. I had the shrimp and cheese grits. The shrimp were cooke","useful":0,"cool":0},"sGBMZ-8KwWEiMAZBfaEITg":{"text":"Great breakfast. Short wait on busy a weekend. Fast service. Very friendly.","useful":0,"cool":0},"hRSHZFTJFWgJ4yF7qEkQMw":{"text":"Absolute loved the brunch here!  Flavored mimosas? Yes please! French toast? Of course! Se","useful":0,"cool":0},"wu7g6gVASqesFUFtvINnxg":{"text":"I would've given this place 5 starts, but they lost a star because of inconsistency.\n\nI we","useful":1,"cool":1},"Ybg84e2-qVPilL_Vf8FmqQ":{"text":"I swung by for my last meal in New Orleans and left extremely disappointed. The chocolate ","useful":0,"cool":0},"OY8Atkwjq9pdIfrVxawe3w":{"text":"Cute place! Service was great, coffee was great, and the Seafood Benedict was amazing! The","useful":0,"cool":0},"uXvURsEkpzVV_puFroOiQA":{"text":"This is the best place for breakfast in New Orleans!  The only problem with this place is ","useful":1,"cool":0},"eI-W-yVherd02MwquQbL0Q":{"text":"Walking by looked cute so we stopped in for breakfast. It was wonderful!! The Fleur de Lis","useful":1,"cool":1},"UJa6jFccnD2rq19-gs-I5A":{"text":"I only write reviews when I feel that the service and product are exceptional.  That's why","useful":0,"cool":0},"hoYXj9Vsbktv9FWwtfKC1w":{"text":"A little understaffed but undeniably the best place for breakfast in NOLA.  Shrimp and gri","useful":0,"cool":0},"UgxhkQg46xCqxE_O5ZDe8A":{"text":"There's apparently a function on the yelp app now that lets you add yourself to the waitli","useful":0,"cool":0},"rb9kI3XuojHOsAcLHe8Tug":{"text":"We just arrived in New Orleans after a tiring red eye flight, and we were starving for som","useful":2,"cool":1},"M5CSAGNnqH1fQpcTnEFK3g":{"text":"I'm writing about their new location at the edge of French Market, next to Louisiana Pizza","useful":2,"cool":0},"-hkfUKyIgxqEf-4IZjaJ0w":{"text":"Disgusting! I don't understand how people give this place high rating. It's smells like a ","useful":0,"cool":0},"0MJUpVLyuXCavIjKhwaWsA":{"text":"Came here around 1pm for lunch and the place wasn't too busy. I had the crawfish etoufee a","useful":0,"cool":0},"8CNCZ4RdL2Hl7qAB2TfXkQ":{"text":"LOVED the shrimp and grits-- and I am a Northerner. The biscuits were light and buttery yu","useful":0,"cool":0},"WzBiP4jZr6VjAJxW_1c-AA":{"text":"Arrived at 11a on a Tuesday and there was a 15 minute wait. Great Yelp app allows you to s","useful":1,"cool":0},"o0XpQ2VzEAvwc-rm9KoP4g":{"text":"This place was the fourth we tried to get into for a Saturday brunch while visiting New Or","useful":1,"cool":0},"60Zjvs3xmYcAJ71c3ckmww":{"text":"This is not a fancy but super cute place that has become my go to spot for late mornings w","useful":0,"cool":0},"sMTALokEucJjU6HtU5BWOg":{"text":"Great service, great food. I always have to get the shrimp and grits. So. Good.","useful":0,"cool":0},"OY4rPqDZL5rgPo99ta-7nQ":{"text":"We really liked this place. 4 stars because the atmosphere/decor leaves something to be de","useful":0,"cool":0},"AKdwk23_7z4SpNDs2eKJMQ":{"text":"So the food was average, certainly under cooked. The food however isn't what I had a probl","useful":0,"cool":0},"NxLa6V9YECTkhEbjhazb5A":{"text":"Every meal was really tasty.  The presentation was beautiful.  Shrimp and Grits, pancakes,","useful":0,"cool":0},"LjbGaKkW3eifVvfz1SCfvQ":{"text":"service was okay, not bad but not great. the omelette I had was amazing though, pepper jac","useful":0,"cool":0},"lXBAMRZvQQR6hx0XK0xDoQ":{"text":"Good breakfast place, friendly service but limited seating with a wait on weekends","useful":0,"cool":0},"egDufn8kwQAR8iRCHJgi6A":{"text":"Great location in the French quarter. Breakfast was so so, but loved the yelp add my name ","useful":1,"cool":1},"QWmn4J3GazDjzX4xp9YmhA":{"text":"I ordered the Eggs Benedict Florentine and the food came out in 2 minutes. Food coming fas","useful":0,"cool":0},"GJQ7SsZNix-y1O4Edltadg":{"text":"the service was awesome! and if you want rockin' shrimp and grits, holy cow, this place ha","useful":0,"cool":0},"VungHUuChKXJnbbAXhuLbA":{"text":"Amazing creole-inspired breakfast fare and po' boys. The eggs florentine on homemade biscu","useful":0,"cool":0},"JJj_TZjyPXBrjMTNao436g":{"text":"I decided to stop in for breakfast here as it's right up the street from where I'm staying","useful":0,"cool":0},"dNPGah26Pu3Z8YG2t6y0Ig":{"text":"must have when in the area because their shrimp and grits are out of this worlddd. generou","useful":0,"cool":0},"IeiGL_Z5MstQK6PtclOsGw":{"text":"I absolutely hate leaving bad reviews, but I also hate spending $20 on a breakfast I could","useful":0,"cool":0},"o3tfcF74xYErRKJjwtEfHA":{"text":"Great breffie. Grits are bland go w home fries. Mimosas are $6","useful":0,"cool":0},"FDJCfs-ctv9EoEmAqEAHXg":{"text":"Very attentive staff and excellent decor. Had the seafood Benedict and my friend had the c","useful":1,"cool":0},"MfIm8LgFL6tTzVZ76h565w":{"text":"The food here is amazing!  Their brunch cocktails are SO yummy too!  Must try the strawber","useful":0,"cool":0},"oXAkRNkKffgG1dc2XM3ySw":{"text":"Best Bloody Mary I've ever had.....and much needed after a long night in the Quarter. We a","useful":0,"cool":0},"e9WAKGtSBPEaTGQkGCr0Sg":{"text":"Walked in, saw empty tables, told there was a 30 minute wait by the hostess with a condesc","useful":0,"cool":0},"SgSA_y3ssHJkqReAOjvvSw":{"text":"Great breakfast place, food very fresh, service awesome!! This was our second time to have","useful":0,"cool":0},"8c9HFC45iFiivucvOrOsyQ":{"text":"We visit NOLA once a year and this is the best place for breakfast/brunch we have found. D","useful":1,"cool":1},"XvF6s8tMIllxWr8_zCOe3A":{"text":"This place is great.  We arrived just before 9am and were seated immediately, but by the t","useful":0,"cool":0},"cYT1_eJyOqlz-bAUcGb-dA":{"text":"Thanks yelpers for helping me find this place! I was traveling and was looking for a yummy","useful":0,"cool":0},"3TuvXBaissm_h52MqoI6-g":{"text":"I came to Cafe Fleur de Lis at the recommendation of a friend. She said to come have the p","useful":1,"cool":0},"ysBTBZu-KE9ZPV-qZWLWYw":{"text":"Staff was so upbeat and friendly. We waited an hour to get a table and the line was just a","useful":0,"cool":0},"N10BStA9YhmVZiJSF7uBRQ":{"text":"This place was right around the corner from our hotel, and we were so happy we picked it! ","useful":0,"cool":0},"DuAobFKeaxuJMbCNZeFG5A":{"text":"This breakfast spot on definitely a random I selected by passing by. The line was long, bu","useful":0,"cool":0},"Cr2XSATiXWml6hZfkLNVxg":{"text":"Awesome food and exceptional service is how I would define Cafe Fleur de Lis.  We went her","useful":0,"cool":0},"KLRRxDoadUSPnsy_4WkpqA":{"text":"Went here on the recommendation of our desk clerk at the Royal Orleans hotel. He was right","useful":0,"cool":0},"7emnOl4K7U5qZ5C9GvOlxg":{"text":"We ordered the seafood Benedit and shrimp and grits. Both were amazing. But the shrimp and","useful":0,"cool":0},"1ASyliTrJ7V6r12n_Tj0rg":{"text":"This place is very good for breakfast/brunch.  I went here twice with my wife.  The first ","useful":0,"cool":0},"DzuTglqCAwvS0LrLmA6Csg":{"text":"This is a pretty busy place! Popular. But let me tell you, it was worth the wait. Folks we","useful":0,"cool":0},"YNlSuC3nQCgTf3G8lPKE4g":{"text":"Excellent place, the breakfast is fresh and very yummy.  The price is reasonable. Second f","useful":0,"cool":0},"dm9NtyJtTndyfGCwxNt4Dg":{"text":"Great breakfast. We had about 4 different meals and they were all great. Not much in the w","useful":0,"cool":0},"pCqysa2Hnii01Nf2Cu6Cug":{"text":"Pancakes are amazing but the hash browns were cold and not so great","useful":0,"cool":0},"yYoqFL-z5KKreIVV3ELmPg":{"text":"This was a great last minute find while on lunch break from our conference. Yummy fries an","useful":0,"cool":0},"WKTCISWZHs7VgKF1BgrtXA":{"text":"It was just one mess to another. Food for two kids came about 15-20 minutes after everyone","useful":0,"cool":0},"aAy2Ac6UuUxsZVwYnLSjcQ":{"text":"This lovely little spot in the French Quarter was perfect for breakfast. They had a (clean","useful":0,"cool":0},"ch1gjMW_2EXgqVBpLNutRA":{"text":"So my friends and I are in New Orleans for essence festival. We were yelping popular brunc","useful":0,"cool":0},"P1wat2MZ1VFdrxJnupJ0lA":{"text":"Wonderful southern breakfast with amazing grits!  Only complaint was that I did not have a","useful":0,"cool":0},"oJ5rf7MOvfBR0T4YjMrvbA":{"text":"Super friendly staff and relaxed environment.   Good Das good.   Would definitely go back ","useful":0,"cool":0},"rkTDmdfmsj62-ihPOwTJtA":{"text":"The food here is great, no complaints about that. However, our waitress Nila was very unpr","useful":0,"cool":0},"ghSKMQQun33dlCD9a63Few":{"text":"Used to be counter service (which I actually miss) but now is a sit down place but the foo","useful":1,"cool":1},"Z7q_s6DG2RO4Vq-8RCYpDQ":{"text":"Based on reviews was on the list for breakfast .\nMy opinion :  is not worse to wait outsid","useful":1,"cool":0},"tTLTTmXEBmxgt0PWjF4B2g":{"text":"Amazing Bloody Mary and even better shrimp & grits!  I could not get enough.  The service ","useful":0,"cool":0},"CImfFaYnxYArzf2tN49gCw":{"text":"Stongest hurricanes in town! The service was good here. The food was fine - nothing stella","useful":0,"cool":0},"bCwhrxsrEBY5Q-yDo7GCvw":{"text":"A few of my girlfriends & I on a girls trip came here for breakfast. Although we were luck","useful":0,"cool":0},"vQQGwPtmTtMpKIWzPceFrQ":{"text":"Service was was friendly, but terribly slow--45 minutes for coffee when you're hungover? N","useful":1,"cool":0},"AhvBXtuOG2kiWoZD7i2y2g":{"text":"The food is great! I love their pancakes, which have nuts inside! And the price is reasona","useful":0,"cool":0},"ij0ePtD1tRqkLDHerYXE5w":{"text":"We had breakfast here twice. We didn't even realize there was an upstairs. Mimosa specials","useful":0,"cool":0},"jrHcX8A1nfRYWnarI-HSCg":{"text":"Such a charming little brunch spot! I'd bookmarked this café weeks in advance because of t","useful":0,"cool":0},"IY7Sa6ZKWkMkPteW9ivj5Q":{"text":"Best breakfast we had in New Orleans. First time trying grits and they were amazing. Panca","useful":0,"cool":0},"iMBAPvwOR02l5ZdARDCqbw":{"text":"Awesome food!!best part is that they text you when your table is ready so you don't have t","useful":0,"cool":0},"COZR01bygidxgyKtBF6u9w":{"text":"Great little cafe to grab an inexpensive breakfast. Basic breakfast diner fare.  Jesse and","useful":0,"cool":0},"VsZUf6T-bZZ_vxvYafuOWA":{"text":"We just spent 4 days in New Orleans, had breakfast twice at Café Fleur De Lis, and it is t","useful":2,"cool":0},"4Rzo7VyJPPHux8M81B2arQ":{"text":"Now I kid u not , I got home from vacation and still think about this place. So mouth wate","useful":0,"cool":0},"uklaMbm3Qr3Qic039n_USQ":{"text":"Nice small cafe. Great food for a decent price. The oyster benedict was delicious. The tom","useful":0,"cool":0},"7WWKB5dfpW0JHuvPQMUjcA":{"text":"Ridiculously small portions that were served cold. Lost & mixed up food orders plus a clue","useful":1,"cool":0},"D2NY_hmu7u5yKpod9yAr1g":{"text":"Liked this spot so much my husband & I went there twice during our week stay in New Orlean","useful":0,"cool":0},"PGEmpodArda0lEZ7pUNICg":{"text":"OMG.  Allllll hail the king of eggs Benedict!!  The oyster Benedict y'all, IS TO DIE FOR!!","useful":0,"cool":0},"T1xseX8xyQ9JnGjBWMyEGg":{"text":"I've been here twice. The first time was amazing! Amazing food, amazing service. My first ","useful":0,"cool":0},"_i4l8BMd4RY5Qx1GPSCDdg":{"text":"This is by far one of my favorite places to eat in New Orleans! All the staff was so kind,","useful":0,"cool":0},"pNGn6BfrlGofMh7A8pt2tg":{"text":"The breakfast here is great. We were in NOLA for 5 nights/4 days & ate here for 3 days bcs","useful":0,"cool":0},"9sY75WdoFvUsmG9IWZdmbQ":{"text":"We read about Café Fleur de Lisa on... gasp!...another website, as a place that would be g","useful":3,"cool":1},"rajZMsfT-BQ5PvQ0itM97g":{"text":"I wanted to like this place more than I actually did. After reading so many positive revie","useful":0,"cool":0},"C-EG57J-BmSPUx-fQU_Mvg":{"text":"Food is delicious and largely portioned. There is sometimes a wait list but they are great","useful":0,"cool":0},"hetcsXjkUNr5-cneFUJfew":{"text":"Delicious! We stopped here for a quick brunch before heading out of town. I had the big ea","useful":1,"cool":0},"T7H3uJKiPze4Iz9O3PvJ5g":{"text":"I have no complaints about this place. A hidden gem it is! Everything taste extremely fres","useful":0,"cool":0},"pBVgcpMWMeUD00MkwGj5uQ":{"text":"I try to eat here for breakfast every time I'm in New Orleans.... even if they have a wait","useful":0,"cool":0},"s5J50ZtWt6Ttcx5mRHSpgw":{"text":"We came for breakfast - all of the food was fantastic. Two of our party declared it was th","useful":0,"cool":0},"G80rSxhEtfNUHXgW_8cDnw":{"text":"Big portions, average food. Don't expect it to blow your mind.","useful":0,"cool":0},"qV3ky_p9RG6xY82d46u5pQ":{"text":"Great scratch made southern food in a quaint comfortable environment.  They were very acco","useful":0,"cool":0},"xPBTSA88AZDkI1C3HVB6HA":{"text":"Wonderful breakfast cusine. My fiancé and I checked this place out after reading the revie","useful":0,"cool":0},"1yx-UgWHT-HxXj2RL36JvA":{"text":"If you get there early in a weekday, before the work day, it's quiet and the servers could","useful":0,"cool":0},"HykXffMa6RHyMmyIZNq0yA":{"text":"Was originally going to a popular breakfast spot and when we arrived the wait was about 45","useful":1,"cool":2},"gd883FIuFbVo3HHVlfTN9Q":{"text":"Yummy fresh food and coffee. My husband and I ate here our first morning in NOLA and had t","useful":0,"cool":0},"6W2RLLQFcEDbB3sn8AJI0w":{"text":"The best service and meal we had on our trip. The pancakes were divine. As my son said, \"t","useful":0,"cool":0},"nEwUB9jBeROXjkcq3Hr0kA":{"text":"Noisy, crowded and not a lot of seating when it's busy, but a good stop for a late breakfa","useful":0,"cool":0},"MlTYfSqjDF6-SL19Zyd-cg":{"text":"It might not be the best breakfast of my life nor the place I would choose for every morni","useful":2,"cool":1},"PJsEBrXSH9yKmrCGYFMjLw":{"text":"Had brunch here over jazzfest. Had the seafood benedict and it was on point. The oysters w","useful":0,"cool":0},"-ZqeWLOf6_-NPXQJTS9Q5Q":{"text":"This place is located in the French Quarter. I was walking with the family and saw this pl","useful":0,"cool":0},"P1dsSunNlMfSH_o6GKMP9A":{"text":"Best place for breakfast that we are the whole trip. When we come back to NOLA this will b","useful":0,"cool":0},"IOpi7RG6r8CH43SKic6_NA":{"text":"When I tell you my eyes rolled to the back of my head, just know it was in a very good way","useful":1,"cool":1},"ViG_T5-NpETb6tMqwnBCoA":{"text":"Called to make sure they're open on Christmas Day and was told to make sure we got our nam","useful":0,"cool":0},"5JpSAkzOsP87lfbZgOu3pg":{"text":"This place could easily be passed and looked over but it is a hidden pleasure amongst all ","useful":0,"cool":0},"bx7VOxCdRSB-jMz6OV05Ig":{"text":"This was such a cute little place where me and my bf had our first meal in NOLA. \nIt's tee","useful":0,"cool":0},"7PLScSUDbZMCeEGVuNXUdg":{"text":"I had breakfast here on Labor Day.  Had the crawfish omelet and hash browns.  The food was","useful":0,"cool":0},"lYXQBdC1Mun7dkvw64sQ2Q":{"text":"My sister and I recently visited this restaurant on our last day in New Orleans and had an","useful":0,"cool":0},"tj2qzI7LeBROnNQ1rQdWjQ":{"text":"Went to this place for breakfast one morning and it was the best breakfast we had while st","useful":0,"cool":0},"mchJaJ9B2ho_7zCFD7r6ow":{"text":"I would like to give them five stars, but it is more a 4-1/2. It is the best breakfast I h","useful":0,"cool":0},"9GclFFohCirhgF32jTNN6A":{"text":"A neighborhood gem... in the Quarter.\n\nSo... the qwerk about this place is that you stand ","useful":1,"cool":1},"K1MWF7U-hYm_gIH9EkHQAg":{"text":"You might have to wait a bit--the service can be slow--but hey, this is the Big Easy, not ","useful":1,"cool":0},"9COqs947jzyS0m52heo8yQ":{"text":"If you like butter, this is your place.  If you like coffee, head elsewhere.\n\nFood was pre","useful":1,"cool":0},"V3WZa0Xowuwda2AeVU58SA":{"text":"Great little restaurant with some fantastic shrimp and grits.  It was busy but we got ther","useful":0,"cool":0},"dzHz1g4G0NhzOHBWJsa--Q":{"text":"Food poisoning!  My wife and I ate breakfast there this morning.  We went early and there ","useful":2,"cool":0},"bgTCICXJLclZ203DezC1FQ":{"text":"The breakfast menu is big for a weekday! They have New Orleans favorites like shrimp and g","useful":1,"cool":0},"lVRaWoVJdfPsbZG8hnGHFQ":{"text":"Went here for brunch on a Monday morning while visiting NOLA and it was packed. Interestin","useful":0,"cool":0},"OIH1VKye7--HC3OBBRJdQQ":{"text":"I stumbled across this place and decided to grab breakfast. The hosts texts you when your ","useful":1,"cool":1},"JMsrSe_HmvA-7KNBXxUuCA":{"text":"Pros: Food was DEVINE absolutely delicious I had the shrimp Po Boy and shared a gator Po B","useful":0,"cool":0},"qGdBx09ce7v2BAzXS5GKLg":{"text":"Every time I am in New Orleans have to stop here. Best place to get breakfast and drinks","useful":0,"cool":0},"Bs1nhUSZX_rFa5QhLGLj7w":{"text":"A Small cafe that's a little pricy for the smount and quality of food. \n\nHad an early lunc","useful":0,"cool":0},"BRCQU4qb5IQUx13S6EYt5g":{"text":"Great little place!! Amazing food and great prices. The wait was quick and the food was we","useful":0,"cool":0},"H9LTjrTtO8LCPWHmq6FIvQ":{"text":"As nice as the server is, if you're looking for a friendly person to greet you...this ain'","useful":0,"cool":0},"nJOhA26oEj9mNi7J2pY4Lg":{"text":"This can be a very crowded space, but with attentive staff and some interesting southern b","useful":0,"cool":0},"iLHW1kJZzYHL5sZKh6jkvg":{"text":"The website said \"open 7am to 3pm everyday\" so silly me, I believed it.  On Sunday morning","useful":3,"cool":4},"WY4UhEuqJOzzWut8Kp40Sw":{"text":"Great hole in the wall/local place for breakfast and brunch. Ordering took a little while,","useful":0,"cool":0},"4dmvj8LUa2-s2j8Bz3ld6A":{"text":"What an awesome find!  Wasn't sure what to expect, but this place had it all - great and p","useful":0,"cool":0},"j0ihSB_i1Fh4b3ZOUk-ITQ":{"text":"Best breakfast ever! We ate at the hotel buffet and the quality and cost were horrible. To","useful":0,"cool":0},"Zwo8QAfPNTB2bJsnqRbjLQ":{"text":"Such a disappointment!  After days of eating heavy, we wanted a light breakfast, so we ord","useful":0,"cool":0},"bCnZmj4MPTXVgZiqi2Cxdw":{"text":"Our final stop in New Orleans... awesome food.  Went there at 2pm, no wait.  \n\nWaitress wa","useful":0,"cool":0},"2bXuHDZQBj9Zf4JYs-2JWQ":{"text":"Very slow service, disorganized. They were cleaning and setting empty tables and ignoring ","useful":0,"cool":0},"OY219m_sj2pKWuw6f8BQvQ":{"text":"Came here for breakfast after seeing all the yelp review, as described, small cozy cafe, s","useful":0,"cool":0},"N-qr81ZO50hkWIp8wsjh1w":{"text":"Stopped here for breakfast after taking a stroll and glad we stopped in. The staff is frie","useful":0,"cool":0},"nyef0eqLuequ6N456vn5JQ":{"text":"John     Pasadena, Md.\nWe went there April 2nd and 3rd, 2017. This place is fantastic. It ","useful":0,"cool":0},"ygfgXGNgNH0y9gQtaYcrLA":{"text":"Very Disappointing.\nWe went to Fleur De Lis because we heard it be \"one of the best eggs b","useful":0,"cool":0},"6lDB2KLKjHvNqw5MHf3PCg":{"text":"Pro's: \nExcellent and unique hangover killers, including 3 flavors of mimosa, bacon bloody","useful":1,"cool":0},"GsKoqfm_vbYgdoiFLE41uQ":{"text":"When you are in New Orleans, do not eat the hotel breakfast, for goodness sake! This is Ne","useful":0,"cool":0},"IPCwHfGieAt4DObnASsgjQ":{"text":"Omelettes were really good here. We like the place and the server was kind. Our food came ","useful":0,"cool":0},"BYiRZDbV18mCirKc6DE5mQ":{"text":"The eggs Benedict were perfection.  The hollandaise sauce was just right.  Highly recommen","useful":0,"cool":0},"o42Ap1ZtnKE-9pd7Oli5yA":{"text":"Excellent customer service. The staff were all very friendly and polite. Also very attenti","useful":0,"cool":0},"BV6286xZNdYBHEySwHUImA":{"text":"It's a nice, awesome local cafe with amazing service. Food was fresh and arrived fast. Fre","useful":0,"cool":0},"t6JwXzdGldC8ZrA8-r3SzQ":{"text":"This is an awesome breakfast spot and was actually recommended to us by the concierge at T","useful":0,"cool":0},"IV49KgNiDqsu1xEsPKupsg":{"text":"We decided to try this place for breakfast. Well, breakfast for us, but technically it was","useful":0,"cool":0},"7Xl3u8JD8jviFZH-iGzrSg":{"text":"Fleur de Lis omelette is outstanding. Full breakfast bar menu includes fruit flavored mimo","useful":0,"cool":0},"najaW3hgV2qzVQEjxxK-cQ":{"text":"Great breakfast, friendly staff. I really enjoyed the Fleur de Lis omelette with crawfish ","useful":0,"cool":0},"iTUk7vaIKzCJDK51jAiXsQ":{"text":"We came upon this place by accident and stumbled in ad an attempt to get out of the pourin","useful":0,"cool":0},"59QwViwutwc3XeeyBjGUsA":{"text":"The cafe was busy when we arrived so food took a little longer which was fine. Food was ok","useful":0,"cool":0},"puIB5AvvIMpoCYdkJKvodg":{"text":"Excellent food.  Extra large mimosas - and you can get a to-go cup!  Also, some of the bes","useful":0,"cool":0},"RfmtqD92m-rbiEzQ2-n7Qw":{"text":"Fast and friendly service. The only thing I didn't like is kind of small in space but real","useful":0,"cool":0},"HAp8K3D0N8xDndDGxPCcMA":{"text":"Cute little spot. Really nice and attentive wait staff. Food comes out quickly and was del","useful":0,"cool":0},"JN1l40SPBXc0JVzpGie2YQ":{"text":"I got a quality omelet here. The place was packed, which is usually a good sign and the fo","useful":0,"cool":0},"JYQnXG813hw2ZVP76bAlzA":{"text":"This is one of our go to spots when we come to New Orleans, I absolutely love their grits ","useful":0,"cool":0},"3HJtadiL21-DcEO1n5AwiA":{"text":"Excellent breakfast.  French toast, scrambled eggs, sausage, & bacon were great.  But the ","useful":0,"cool":0},"vexn8JdYJZTUc000Z0BbXA":{"text":"Like so many others over these few days, I also had food poisoning (5/4 about 3 hours afte","useful":2,"cool":0},"3NUvFRgmuxmK5drecfQ-Ng":{"text":"Great breakfast place! \n\nAfter reading the reviews we decided to give it a try. My friend ","useful":0,"cool":0},"tCU0wZsb592Fl71ZFPbmYA":{"text":"We really enjoyed this spot. Best Bloody Mary I've ever had. Super busy but they are effic","useful":0,"cool":0},"Sg6bw0EYEzP3VIJj0SiasA":{"text":"The Big Easy Breakfast did not disappoint! Light fluffy buttermilk pancakes,  bacon and sa","useful":0,"cool":0},"arFBnf_z5vZCYUgDyMRrIg":{"text":"If you're looking for Creol boudin (the real Caribbean one as for example in Martinique an","useful":0,"cool":0},"98qoo2Jy59I19_7YtI6-bg":{"text":"This place was getting busy when I rolled in there on Saturday morning around 10am, but I ","useful":0,"cool":0},"DGgEi8bpsPxlSZgmgf-1vg":{"text":"Wonderful Sunday Breakfast-  Big Easy Breakfast paired with a NOLO screwdriver!!!  Sat up ","useful":0,"cool":0},"EN_mIEfaSzQ_XupOkBbIsw":{"text":"Great shrimp and grits and good service. This hidden cafe in the middle of the FQ is a nic","useful":0,"cool":0},"cr8e2kclUfxVY3x74AFZxA":{"text":"Ordered a peach mimosa and strawberry, banana & pecan pancakes...AMAZING! Waitress was fri","useful":0,"cool":0},"4Wx8zOFwJ-KeuDM1SdOAAQ":{"text":"Came here solo on a Monday afternoon while in town for business. Quick, excellent, friendl","useful":0,"cool":0},"w7_tDsUAc_v1Tm7p_-y5Wg":{"text":"I came with a large group for brunch. Wouldn't recommend doing that since the place is sma","useful":0,"cool":0},"4uZuWt5F0tsZX68LzOcicg":{"text":"Wonderful staff, friendly and helpful with recommendation on the menu.\n\nPancakes and grits","useful":0,"cool":0},"pxpENzRWdzTaVKBQYvz3VQ":{"text":"Decent breakfast, \nI had the Fleur De Lis omelet which was a tad cold when they brought it","useful":0,"cool":0},"dD2j8JN8A-k6tjzx_obi1g":{"text":"Our wait was short since we arrived just before 10:30 am; the earlier you can get here, th","useful":3,"cool":2},"x1fY2rjuuMNkPogMLQ94Lw":{"text":"Had my Birthday breakfast here... the only downside they ran out of a few dishes mainly sh","useful":0,"cool":0},"C6XyQApjD2_bUZ6LziDd6g":{"text":"I just love this place! It's the perfect place to grab breakfast after a night of enjoying","useful":1,"cool":1},"qzCIvcdcH4gwh3fxwYmAuw":{"text":"Simple lil cafe with great food, chicory coffee, and nice service. Prices weren't bad at a","useful":0,"cool":0},"vDgO1-yyaRfgdEpKe1zQzA":{"text":"Great spot for breakfast, definitely. They serve never-ending refills of gigantic cups of ","useful":0,"cool":0},"fZVMGKAQ4Rk4idWdfwbJWA":{"text":"Incredibly friendly server who was so kind to my little guy and I. Hot day, some tasty foo","useful":0,"cool":0},"2QHDx4QlqDLH9jtUBOnE7w":{"text":"Wait was not too long. Shipped for gems across the street in then ran time. I had shrimp a","useful":0,"cool":0},"IQCZDbb7FPXQ27aVXiRaPg":{"text":"There was only 6 people or so in front of us and it took nearly an hour to place our order","useful":0,"cool":0},"mnRdq56V45_gUt1nZtwQLw":{"text":"We ate only one breakfast on our trip to NOLA (usually opting for lunches instead) but thi","useful":0,"cool":0},"DwxRQwZTjnBBqqdZDO1Vew":{"text":"This place is an amazing ole in the al. We are looking for a breakfast place we went to on","useful":0,"cool":0},"WFXAPHRorVIFifigm-JgGw":{"text":"The shrimp n grits were great! Could have used a little more spice though. Seafood Benedic","useful":0,"cool":0},"EUY9bNoGaBjetMZEak6J1A":{"text":"Great place! We came for breakfast, it was excellent. Loved the grits and the latte! We we","useful":0,"cool":0},"u9U2cWqVq2_8bE9RKJptsg":{"text":"Hands down the best eggs benedict I've ever had in my life! I was worried about them using","useful":0,"cool":0},"AAHMm4ktzA4-F-HRlhsGOw":{"text":"Terrible- took 20 minutes to just get coffee, 2 tables that arrived after us were served t","useful":0,"cool":0},"4geFNtrI1TVb6wpuGMzFzw":{"text":"We enjoyed our breakfast here. The coffee is good and the menu is very affordable. I had t","useful":1,"cool":0},"aCRfTgT5nlVSe5Iy9idrtw":{"text":"A solid four stars! Went for Christmas breakfast and was very glad I did. I got the Crawfi","useful":0,"cool":0},"OrwuEz_3Y8bRv7ZGfBLdgQ":{"text":"The staff is incredibly nice and professional.  They know there food and the chef's asked ","useful":0,"cool":0},"Sag7WgJFknFUY9cYQEySAQ":{"text":"The food was amazing but I could not enjoy it at all. My first time here and my meal was r","useful":0,"cool":0},"6yjJv1cewnLr3jXPszXmyQ":{"text":"My husband's grits with shrimp arrived cold :( it took forever to get water even tho other","useful":0,"cool":0},"2r2gYOAQViigabF2S4NUWw":{"text":"This restaurant is located on the border between downtown and the fresh quarters of New Or","useful":1,"cool":1},"ZpTIRHdSowwRGyekxhhFvw":{"text":"It was an okay breakfast. I ordered the tall pancakes with strawberries. When the order ca","useful":0,"cool":0},"yQ7qPcgv8ZCn3r1w_YfJRg":{"text":"Love this place! Where do I start?! The Bloody Mary was amazing and delicious.  The sweet ","useful":0,"cool":0},"yjcNLx1vY4u9p_0p7vqHzA":{"text":"Great breakfast - had the farmers omelette, it was brilliant. Highly recommend for breakfa","useful":0,"cool":0},"tzIGHgMEX7zX2Xx-_UcSWA":{"text":"The spicy boudin omelette was very good. Lots of boudin stuffed in it. Staff was great as ","useful":0,"cool":0},"TSUClLSrSfrkjc7I1D0SRg":{"text":"Ideal für ein amerikanisches Frühstück!","useful":0,"cool":0},"fYNE0a6fZm1OEI_lnhlbxQ":{"text":"Awesome breakfast! The Avocado omlet was delish!! Easy Joe and was the best waiter we've h","useful":0,"cool":0},"enTZdGJZpNmRTqFSu8zVDA":{"text":"Service was good.  Immediately seated.  Very friendly.  The food came out fast.  Ordered t","useful":0,"cool":0},"fp83LYCMS26nbYTgurahEQ":{"text":"This place was great, the server was awesome. We had a party of 5 but only 3(including mys","useful":0,"cool":0},"SkxPj3n4EE1QOtDZVGVFiA":{"text":"In New Orleans for Spring Break. Wanted to show kids that its not all about Bourbon Street","useful":0,"cool":0},"tb4yDeJOaZPcAItPL8bGcg":{"text":"Simply awful.  Our friendly waitress recommended the benedict dishes, which are served ato","useful":0,"cool":0},"B9NWNayGalzbXTM3mUG2JQ":{"text":"We randomly stopped her for lunch one day trying to get out of the rain. There was barely ","useful":0,"cool":0},"NmkW-WJsmqZ96M0j1MxRAg":{"text":"This place is great! While it was pretty crowded on a friday morn, the food was great, the","useful":1,"cool":1},"Utlzo3ufLlWxYtOk4r2Bfw":{"text":"I got the avocado omelette and the crawfish etouffee... because that's how I roll. (Litera","useful":0,"cool":0},"LYxlHBPWs0_8k25cT9QZXg":{"text":"Nice little cafe with good breakfast and friendly servers. Prices are reasonable for the a","useful":1,"cool":1},"8i-zT9KGMwo_HnMrlPLw4Q":{"text":"Nice little setting. Warm atmosphere, though the staff certainly seemed apathetic to your ","useful":0,"cool":1},"K3OSdLi51BNKbFG3Hvlw3g":{"text":"Great breakfast location, worth the small wait.  Pleasant service, busy.  I had crawfish  ","useful":0,"cool":0},"cBFFj_j_K9CWnnIbQvs89g":{"text":"Best Shrimp and Grits, and Fried Green Tomatoes I have ever had! (and I'm from the south) ","useful":0,"cool":0},"JeGAw7eyDMPMxmGrxvU0rA":{"text":"Do yourself a favor...don't come here for breakfast !!! \nThe cappuccino was extremely hot ","useful":0,"cool":0},"NqGjc2DhZAMxXYvr720n7g":{"text":"Great food! Line moves quickly. Have a someone in your group grab a table while others ord","useful":0,"cool":1},"zHhlsfux_t4LPOVVGA1smQ":{"text":"Excellent breakfast! The New Orleans Country Breakfast was enough to feed my husband and I","useful":0,"cool":0},"E4NMUCPIUJh5g0MU5BJ2QA":{"text":"This was suggested to me by a local food tour guide and he was right.  It was delicious.  ","useful":0,"cool":0},"VO_k6jz19hJUnfd5DZR4Vg":{"text":"I typically try to avoid going to places twice on my visits to unfamiliar cities, but this","useful":0,"cool":1},"fCTbjczgvvQmvf9wCd-SOQ":{"text":"Umm, my review might have been a little different had it been for another dish but I ended","useful":0,"cool":0},"5c2Pk16qj4uaPZB7B0C_RQ":{"text":"The best breakfast I've ever had. I'm not sure what they put in the pancakes but, they wer","useful":0,"cool":0},"-njsr4Mh1i13CTT4okBt9g":{"text":"Simply WOW!!!  Here for a few hours in thanksgiving....stopped by for bfast...a 30 min wai","useful":1,"cool":0},"ibFVZIQsF4jd1GcfzJlB9Q":{"text":"I had trouble looking for breakfast joints in NOLA so I was happy to find this cafe.\n\nLong","useful":2,"cool":0},"Prqk8BjbONtxixdh2sVveQ":{"text":"Excellent food. Very nice staff. Had the three cheese omlet and hash browns. Will definite","useful":0,"cool":0},"VlVd5Qb0hLs_WCMhh_7BGw":{"text":"Food was first rate, coffee excellent. Our server Joe was very attentive and friendly. Wou","useful":0,"cool":0},"zaVlZ_nqQtFPObDRF6NFBw":{"text":"My mom and I went here on a Friday morning and it was packed full by 10:30. Luckily, we ar","useful":0,"cool":0},"TbzY-CVd5YXu9yQ8wWoQ0A":{"text":"There was a 45 minute wait, so do yourself a favor and check in on Yelp. That way you can ","useful":0,"cool":0},"IOv5uBtOa6Rv_UQ-02igEw":{"text":"Nice little French style cafe for breakfast or brunch. Reasonable place and good food. Bal","useful":0,"cool":0},"mp1XraRgb618yC86gxfXxg":{"text":"I was excited to find this place on Yelp, as it was 11:30 am and my traveling companions w","useful":0,"cool":0},"96_t-7gNA4yfiti09Ye6vg":{"text":"So good came two days in a row for breakfast/brunch. \nDay 1 there was 4 of us. We all orde","useful":1,"cool":0},"rBExkzOqbhlhaZFqCWwo2w":{"text":"OMG shrimp and grits. Eggs benny. Coffee. All first rate and served by beautiful people. W","useful":0,"cool":0},"R3qInFpPx0vBq8QwP5c-5A":{"text":"omg the food was amazing! atmosphere is semi loud but the food makes up for it. The wait s","useful":0,"cool":0},"w1FjEC3zESAJ45AYQcLXkg":{"text":"We found this Cafe on Yelp while on family vacation when looking for a place for brunch. W","useful":0,"cool":0},"vPgX6Sc9-6-YDeuVaxxD6Q":{"text":"My husband and I stumbled upon this place about 3 years ago during a trip and I had been d","useful":0,"cool":0},"eXM-1QngwtCqdD0Zck_Vrw":{"text":"Let's get to it!\nFood choices: pretty good\nFood taste: hit and miss, some good some were o","useful":3,"cool":1},"PSNUrOtBCVeltvom-L_b4Q":{"text":"Great Bloody Mary selection, and really delicious brunch variety.\n\nWorth the wait, if ther","useful":0,"cool":0},"VE6T6EfPisnmFQP_xuwnlQ":{"text":"Came to Cafe Fleur De Lis after a night on Bourbon street. So I needed something easy on m","useful":1,"cool":0},"sYKu78tKEfyFVDiFsE9C2A":{"text":"I had breakfast here. It was good. I wasn't wow'd by it. Maybe it was just my dish but it ","useful":1,"cool":0},"O6lxxNexb3KJkWx0dcHoRw":{"text":"The buttermilk pancakes are DELICIOUS!! The portions are so big that two could probably sh","useful":0,"cool":0},"zWUQTeBk4xYSd4zEFQkpZA":{"text":"Love this place for breakfast. Get the pancakes , they are amazing. Staff is great even wh","useful":0,"cool":0},"-jCoY6D3FyCuxVgRjspHVg":{"text":"I really wanted to try this spot as I have heard nothing, but great things.  So that is ex","useful":0,"cool":0},"mUBK2q7jEozplVCQ-6NNjA":{"text":"Y'all this is a must try place! The food is good and fresh. The service is awesome. The bl","useful":1,"cool":0},"dsFR3bozInjHVKwv3Y8YMg":{"text":"The service was great! The food was delicious! Highly recommend the big easy to eat. The p","useful":0,"cool":0},"PrgLXkFLcxwF0ZnTZnFKKw":{"text":"I went here because it was highly recommended. I WAS THOROUGHLY disappointed. The food had","useful":0,"cool":0},"EQ8FRrJZH54SupVqXcmQeQ":{"text":"My fiance and I came here yesterday morning before going to Jazzfest. We wandered around l","useful":1,"cool":1},"L_S9oOzkCUHEu0GFKu4VSg":{"text":"This was my 1st time trying Cafe Fleur De Lis and it was nice. All of the employees are ve","useful":0,"cool":0},"sgCgt7KV_2whzyAv7F2vyA":{"text":"Great brunch spot!\nWe found this place walking around using Yelp to find a good spot to ea","useful":0,"cool":0},"9_p_Uk-lqeJSg3saxeHLLA":{"text":"I had the prosciutto and avocado omelette!  It was so delicious! I had the cheese grits as","useful":1,"cool":1},"fCUUtSmz8iAitkn7IG4A1w":{"text":"Was famished, this place looked cute.\n\nDH, my toddler and I went in and were welcomed. I w","useful":3,"cool":0},"yATAK6TU0M4IHF1MADx_sQ":{"text":"Place is small so be prepared to wait for a table.  Hostess was very friendly, took about ","useful":0,"cool":0},"rg7W0XYpWBDmWM07id3nPQ":{"text":"Had the seafood Benedict. I'd never done poached eggs before.  This is an poached egg on a","useful":0,"cool":0},"FwYfhNKKNige7dNsxHmvbQ":{"text":"Kitchen is terribly disorganized. Never seen such confusion and chaos at a breakfast cafe.","useful":0,"cool":1},"j6DFQz6TR-Z2gXRUVsOyNA":{"text":"Our first stop in New Orleans was Cafe Fleur De Lis. This place had a good variety of vege","useful":0,"cool":0},"M14Izwanb46Q4dJ0BYdndQ":{"text":"My fiancé suggested we go here for brunch, and boy what a great idea. Not only was the cof","useful":0,"cool":0},"8X8wHaQLl_aRIWiQ6myPwg":{"text":"I loved this place!!! I ate the spinach and feta wrap and my mom had grits with eggs and b","useful":0,"cool":0},"OMPO1OhUw-zYZ04gdXVDqw":{"text":"Perfect place for a delicious breakfast! Very reasonable. Very nice staff. Usually a short","useful":0,"cool":0},"gasTnFHxaCTu0oZQgEd6TQ":{"text":"I thought this place was ok, I ordered the avocado scrambled eggs, they were good but noth","useful":0,"cool":0},"bUERRCRil_QAInqrZhjQyw":{"text":"We went this morning for breakfast and was refused entry into the restaurant because we ha","useful":0,"cool":0},"5W_100pD52nUnyJqFu_3nQ":{"text":"This is my type of place!  A complete hole-in-the-wall little cafe with about ten tables w","useful":2,"cool":3},"Q_X8O54odUy9IBFENhSzVA":{"text":"I just went there to try the seafood Benedict and with no disappointment that was a specia","useful":1,"cool":1},"44KTD9fzDnmcg9o8odw9Sg":{"text":"Terrible experience.  Went with four friends.  After ordering right away, waited 40 minute","useful":1,"cool":0},"B68_mjgh2jOC4ZRP1IYcGA":{"text":"For a \"hole in a wall\" type of place it was just ok both the food and service wise.   Pric","useful":0,"cool":0},"wj_P5u8EM1ACzle0uFgVeg":{"text":"Ending up coming here after being disappointed at Sobou. Food was pretty good and so was t","useful":0,"cool":0},"PD8pR68ZGFtrS46ohXVnfA":{"text":"This cafe is pretty small with very few cramped tables, but if you put your name on the wa","useful":0,"cool":0},"SuccFfSJJc8iGASfP7-cTA":{"text":"Solid breakfast spot. Coffee mugs are large, which I appreciate! Fairly quick service. My ","useful":0,"cool":0},"OfGHcom0owILyTw5ix6GOw":{"text":"Yes check in and app updates made things easy to walk around while we waited for our seat.","useful":0,"cool":0},"VjSdXv2UYlY9WrPDHTGfTA":{"text":"I knew the wait would be long so I listed myself on waitlist using yelp.  11:30am and told","useful":5,"cool":5},"U4dvQd_VMs28MQtNs_gHdw":{"text":"On a recent trip to the French Quarter for a friends wedding my boyfriend and I stopped in","useful":0,"cool":0},"IztHri-DJciek9ikq8x3vQ":{"text":"Fantastic eggs Benedict served on homemade biscuits with homemade sauce. Friendly service.","useful":0,"cool":0},"f9WTMqDTfproHlwO-_qxTA":{"text":"I don't think I've ever enjoyed a breakfast so much until today. Every bite I took I savor","useful":0,"cool":0},"6z2brBWNNijn4znEBtoOVA":{"text":"Some of the best pancakes I've ever had, and definitely the best coffee!  The boudin sausa","useful":0,"cool":1},"wt201QODiQ0DqjSs3a8rQQ":{"text":"Outstanding place for breakfast in the FQ. You'll probably have to wait but they use a tex","useful":1,"cool":1},"9MCy0L1Cl8ANvU_1KoRJ1Q":{"text":"Great food and amazing service. I ordered the avocado omelet with goat cheese. Simply love","useful":0,"cool":0},"W5YqUOSxcvH1oqDn0sjU1g":{"text":"The best breakfast we had while in NOLA. I ordered the seafood Benedict. The rest of the t","useful":0,"cool":0},"chVCunC13sSY2Pl-ZcJAXw":{"text":"My family and I had breakfast at this charming restaurant while on vacation and truly enjo","useful":0,"cool":0},"n4xzSoR-Kjo67jFb_6UbeQ":{"text":"I totally recommend getting the banana pancakes. I had it substituted for regular ones in ","useful":0,"cool":0},"iDI7vEO6DRB1pECs2wiMaQ":{"text":"First. I used the yelp \"skip the line\" function. Excellent, I received a text when a block","useful":0,"cool":0},"b9YBIoyDEJe6JfdeLof1HA":{"text":"The best breakfast in NOLA! We tried numerous items throughout the week and everything was","useful":0,"cool":0},"y2a-Fhp8kvS09LRgVxl-Ew":{"text":"Possibly the best breakfast in the French Quarter. Big portions at a small price. Seems mo","useful":2,"cool":1},"VFHtl2L4k08oqR2Jz5xBXA":{"text":"Amazing! THE GRITS! I love grits and these are really flavorful and creamy. \nI had the avo","useful":0,"cool":0},"fG_IuBhR_NJeZYVIFlQ79w":{"text":"If I could give 0 STARS I would! This place had 4 stars and the shortest wait time so we d","useful":0,"cool":0},"yppGR_YIiFX8JirNxys8Xw":{"text":"AMBIANCE- Quaint, café-like space that seems better for breakfast/brunch. \n\nSERVICE- Impec","useful":0,"cool":0},"kCSuy5xrurZw3dPd6UbX8w":{"text":"Right in the heart of the French Quarter. This is a great place for breakfast. I had the c","useful":0,"cool":1},"yyvs5gVt2Ep9oPIX9chpkg":{"text":"Was immediately seated since I joined the waitlist on yelp. Server was extremely friendly.","useful":0,"cool":0},"oabxbmbR6o9X0b55l2iUUA":{"text":"This place is really tiny, what made it worse is we were given basically half a table. It'","useful":3,"cool":1},"E_96BhwQcmIfULR_HBczAA":{"text":"We just ate here for breakfast--had two oatmeals and a quick in-n-out and left a tip of $2","useful":0,"cool":0},"UFUgofFa4Iix3OnIAoxoMQ":{"text":"Didn't get a chance to eat, partly because our server ignored us.  We signed up on their t","useful":0,"cool":0},"nDvZ7yaXmQBUYyMfx8JC-A":{"text":"This place hands down is one of the best breakfast and food places in New Orleans. Anyone ","useful":0,"cool":0},"sNlN3K7xWyFO_RF-qzLupg":{"text":"We had their breakfast twice as party of our conference.  Not sure if it would be differen","useful":0,"cool":0},"bPNy5C4j-wZ11STrZpreOQ":{"text":"We went here today based on the yelp reviews and overall we were happy.  The restaurant wa","useful":0,"cool":0},"snEzEQPV0qCf2PeZEKRKPg":{"text":"My boyfriend and I came to this cafe for breakfast one morning on our New Orleans trip. Th","useful":0,"cool":0},"Lzmmw19gw_q2wWTDWq13gA":{"text":"I didn't eat my food because the woman who runs the cash register was touching money then ","useful":0,"cool":0},"7unuXBaEM4rzjYmsNByVqg":{"text":"A great local breakfast spot, with very limited seating. The pancakes, an omelets were ext","useful":0,"cool":0},"KgFZ8AP-XSYVuAFZgjNJ7A":{"text":"Final breakfast of a weeklong trip. The hash browns were well seasoned, hot, and at the ap","useful":0,"cool":0},"Wn5bD2rblUd-JErRfTDYWQ":{"text":"This place is phenomenal get there right when they open or you'll be waiting because the l","useful":0,"cool":0},"-wQpfsHrOX1VK8SF_0aa4A":{"text":"The sign outside said \"Shrimp and Grits--C'mon in!\" but when we arrived, the waiter told u","useful":0,"cool":0},"oU9zcFWxXikXKRB4vAIdig":{"text":"Good prices, great hashbrowns, friendly staff, fresh food. It is a cramped space, as it is","useful":0,"cool":0},"CvlWc291cOrQRYsT-B7HRQ":{"text":"We visited this cafe twice during our recent trip to New Orleans. Both times that the food","useful":1,"cool":2},"ex83iXk7IQRqgKmwoYoV9A":{"text":"Cafe Fleur De Lis is in an excellent location.  It utilizes an electronic waitlist, howeve","useful":0,"cool":0},"pBwV5feIgFKZ3lPZgO1h5Q":{"text":"Great down home breakfast.  Perfect start to the day.  Claire was our waitress and she was","useful":0,"cool":0},"clxcL4F2fNgxh4mSTu4yBA":{"text":"Walking in there is an obvious strange smell in this place. It was a bit off putting. But-","useful":0,"cool":0},"O46_-8zsvnBdhkHy-KW_9w":{"text":"The food was amazing! We had banana flambé and seafood eggs Benedict and they were both de","useful":0,"cool":1},"IJccJawN9Tgt-WlYtRcuxw":{"text":"Wow.  Service is rude and wildly worse than terrible.  Went in this morning (Sunday) at 8:","useful":0,"cool":0},"PFdZ1dRUS3mWMjW6pKYR2A":{"text":"Wow!  After wandering the French quarter for 90 minutes  in search of places that serve br","useful":1,"cool":0},"MayuHwLEOE26kY-Dm0AUYQ":{"text":"Saw this place on Yelp and decided to give it a try mainly because the menu had a spicy bo","useful":0,"cool":0},"zku3m7TXB57KfpRX9cmYJg":{"text":"Amazing Eggs Florentine! And the hash browns are second to none!\n\nYou would be crazy not t","useful":0,"cool":0},"NG7cvSmrk6O_Sh7_EmAa4Q":{"text":"Stopped in while on vacation. I was looking for a good local place for breakfast (didn't w","useful":0,"cool":0},"Om4qI59sPA1KQleOu5FaMg":{"text":"We have eaten breakfast here 3 days in a row. Homemade biscuits for the eggs Benedict were","useful":0,"cool":0},"ugnYnzUrAt5qr1jafUfO0g":{"text":"I really like this place! It was my first visit and I went for breakfast and had the Oyste","useful":0,"cool":0},"jVuXktpxj46ppJqkPSz2nQ":{"text":"Today is the fourth morning I've eaten here; that alone should tell you something. I'm ver","useful":0,"cool":0},"k0EuLbOv4tJkw3ktQVDgNg":{"text":"I've eaten at this little cafe about a dozen times on visits to the Big Easy and I love it","useful":0,"cool":0},"KZlvGoC0K78orXZ7raiwaw":{"text":"The Shrimp & Grits made me cry... more like weep... more like pass out to the ground, die,","useful":3,"cool":0},"rJDvqIDrsbU7V_6m_YdsOw":{"text":"Nice little out of the way place. Very good service with food above average. Will go again","useful":0,"cool":1},"B6JOolhQSWf5cM-wT1N1BQ":{"text":"Really enjoyed the food here! Wonderful and not too sweet peach mimosa. Had the eggs Bened","useful":0,"cool":0},"qtzQLEkZnNHZilpUBxLfCw":{"text":"Everything my friends and I ordered was bomb!!!\n+++ great service, Kerry, thank you for un","useful":0,"cool":0},"ls-BYkxlKteYxy6b_rG4vw":{"text":"Big berry French toast and oyster eggs Benedict...YUMMMMM. Came here based on reviews and ","useful":0,"cool":0},"PEmjvPrEpCPl9Dnf8qcrWA":{"text":"This place is on point! If you go before 9:30 you won't wait. The staff was very friendly ","useful":0,"cool":0},"I3tM_IPf9EGWhIpAj30RfA":{"text":"Loved the seafood Benedict and my husband loved the King cake French toast.  Topped it off","useful":0,"cool":0},"WFbL2FhDgCjvZkLaT40IXg":{"text":"Great friendly breakfast spot. Good coffee delicious\nBlueberry pancakes. Fairly priced my ","useful":0,"cool":0},"pI3O40col4s_DooS3kLcKw":{"text":"I wish I could give zero stars but unfortunately that's not an option. The menu looked goo","useful":3,"cool":4},"V93dPePUzhN10ZvWFOHBTg":{"text":"Best breakfast in the quarter hands down. The seafood omelet is outstanding and their panc","useful":0,"cool":0},"KkwFGNhuIAT5Ax_a7F5dNg":{"text":"Excellent little cafe!  Great service and food. We had the shrimp and grits and the seafoo","useful":1,"cool":0},"35droeNKnjW4ICdeDaDt_w":{"text":"Been wanting to try this place for a long time!  Finally, and i was not disappointed. Fant","useful":0,"cool":0},"5kfyGHHyLg7BbwZEqg2Wqw":{"text":"This was perfect hangover brunch. You stand in line and order immediately, then sit down a","useful":2,"cool":0},"Ma-HhfE80VgKAYJYv0pa2w":{"text":"This place was perfect for my next day hang over meal. They have the best Hash Browns,  pe","useful":2,"cool":0},"vt9hAClCccUxUWbYwM0NUw":{"text":"The wait was around 45 mins . Totally worth it . The waitress got my husbands order wrong ","useful":0,"cool":0},"l6lowcvWZdEjIOcMij1-Bw":{"text":"The service was excellent, very busy, pretty Sunday morning. We signed in online and walke","useful":0,"cool":0},"_cSiO4RtsASZT24_nUm7tw":{"text":"I came here for breakfast and ordered the fat kid meal of pancakes, eggs, bacon and hash b","useful":1,"cool":0},"mUHPZWa8rYn50Ch6of0-DA":{"text":"We had both the seafood and fried oyster Benedict's. They were delicious. Wait staff very ","useful":0,"cool":0},"1-9KvDF3ulEknSkMmPoQUQ":{"text":"I am being generous giving three stars. We waited for 20 min for a table, then about 30 mi","useful":3,"cool":0},"BbDeYc6Au6xFmr0t14smKg":{"text":"fantastic breakfast, slightly heavy but as long as you are looking for that this place is ","useful":0,"cool":0},"i02sdDdtnJIkT4fwMAGihg":{"text":"Food was awesome. I have been here a couple times over the last 90 days visiting family. M","useful":0,"cool":0},"OuHrfmB2_idoRxdJqq8e9g":{"text":"So good. I never give 5 stars but I was impressed by this place.  I came for brunch on a S","useful":0,"cool":1},"cszhle6BpI2SRgUoeEKW8A":{"text":"This was my favorite breakfast spot on this trip!  There's a tiny balcony which was incred","useful":0,"cool":0},"xsU81DNscRE1aKARb1GP0A":{"text":"This was a little place we stumbled upon for breakfast.  We sat right down, got served rig","useful":0,"cool":0},"u_VXoVBEOtFwhDCyBoYdLA":{"text":"Great vegetarian panini. Our muffalata came w/o the slaw, which they fixed immediately. It","useful":0,"cool":0},"OwRKUnI-wtPqXETlSrOv7g":{"text":"Great breakfast. Restaurant was quite cramped, but that's typical for the area. Portions w","useful":0,"cool":0},"juOlGS4fSoB0dP2BU6uLRw":{"text":"Just walked in here off the street. Service was slow, but the food is incredible and the c","useful":0,"cool":0},"JVGQZaOj1HNHROD4J004aQ":{"text":"Waited for over five minutes after being seated with no server at breakfast with three tab","useful":0,"cool":0},"qzZouDSdIY_UbONKL4y3Bg":{"text":"After a recommendation from a past co-worker, we decided to try this place out. \n\nWhen we ","useful":0,"cool":1},"m7Hl4G4YB8KOf6ATdaEKOA":{"text":"My friend and I went here on Thursday while on our trip to NOLA. I'm going to start with t","useful":0,"cool":0},"bcwhFMl4x-5a7HePR3FFfQ":{"text":"Loved this place on a recent visit to town! First I'm all for places that have it together","useful":0,"cool":1},"drOz_3i3CFosMaQuhTBKdQ":{"text":"First. I used the yelp \"skip the line\" function. Excellent, I received a text when a block","useful":0,"cool":0},"Cpk8NvSfXfRVVpTWL09IWg":{"text":"Food and service was great definitely will be back....the bourbon street breakfast was del","useful":0,"cool":0},"sJ6JjhGuRi_tDpw7pSQgBQ":{"text":"Great quick informal breakfast. The Eggs Benedict with homemade biscuits and hollandaise s","useful":0,"cool":0},"f7tCmjm85i73mfnD46ZGZQ":{"text":"Best thing was the mimosa and our pleasant waitress. Food was cold, sausage bland, and the","useful":0,"cool":0},"wOUDW2gKFJG4awCrCmV19A":{"text":"This place was delicious and I'm giving it a 4.5. There was some pros and cons so let me b","useful":0,"cool":0},"xy8DjgOvFW_VuyKbICRSZA":{"text":"All in all it was nothing special. The latte was the best part. I had the farmers market o","useful":0,"cool":0},"ALTTiBIKIxc3_tDSazr5dg":{"text":"Went here doing essence fest. Long lines everywhere but this wait wasn't so bad. I had shr","useful":0,"cool":0},"7JFib1VA_guGN00RqapcWQ":{"text":"Fabulous place to eat!  The food is phenomenal and the customer service was superb.  We we","useful":0,"cool":0},"2GNbGok2eQG-QounfmnSWA":{"text":"I depend so heavily on Yelp reviews that I feel I need to return the favor when I haven't ","useful":1,"cool":0},"iQhX3sbxTOawdlFMxrHUEg":{"text":"This was a disaster!! We had too many sweet brunches (French toast and crepes) last few da","useful":0,"cool":0},"4WjGkiZuGB5Xdaqm3v1Ryg":{"text":"Fantastic eggs Benedict served on homemade biscuits with homemade sauce. Friendly service.","useful":0,"cool":0},"VC2BGdJFu6eLArI7__n50g":{"text":"Had the crawfish omelette with sauce, it was o.k., would probably get a different omelette","useful":0,"cool":0},"1TbKI7XPU6cbrJnEx0M_AA":{"text":"I liked that they didn't have a line out side their establishment. The location was prime ","useful":0,"cool":0},"nyM8AAl5ncGK0V_XWAaVZQ":{"text":"The Oyster Benedict is to die for. This was one of the best breakfasts ever.\nThe wait staf","useful":0,"cool":0},"9HzMycJQuEu0pHN86s--uw":{"text":"Just meh... If you are going to have to wait for a table, you'd be more pleased at Ruby Sl","useful":0,"cool":0},"ydznjp7DMYg4v5jNTrpfTQ":{"text":"It is a very small restaurant. But the food and service was spectacular! I got the Shrimp ","useful":0,"cool":0},"BeoQkSN1VcdIE1wZppY6Nw":{"text":"I've been craving pancakes and this place has several options. I chose the banana pancakes","useful":0,"cool":0},"88u73qQK3DsmxwKkquWvPw":{"text":"AMAZING!!!! Best breakfast I had in New Orleans by far!!!!! I came here starved on a Sunda","useful":0,"cool":1},"R_JofDRrvwVeljuo9NhCEA":{"text":"This place was great for breakfast with great service and delicious food. \n\nHubby had panc","useful":0,"cool":1},"vtd9UGBAFJgw0_b5k2wdyA":{"text":"We went here due to the great reviews and there was a line outside as well. It ended up be","useful":0,"cool":0},"RjtbhYlfG4OcWb8sK0CmXg":{"text":"Yummmy!!! Good breakfast at good prices!! Large food selection. Went in for breakfast earl","useful":2,"cool":1},"DK98TgLNmIguxMMPGlyb5w":{"text":"This place has MICE! The douche bag manager just looked at it and laughed. EWWW. The serve","useful":0,"cool":0},"GYfIbbTzJZTy_usBWPXhRw":{"text":"The food was really pretty good probably up around 4 stars. Both my GF and I had the break","useful":0,"cool":0},"3LR8L9TeG_mToetJ6vd5Ng":{"text":"Good stuff.  This is right across the street from the W in the French Quarter.\n\nThere was ","useful":0,"cool":0},"TbwR1ilo1PurnBufixiG2A":{"text":"This restaurant was a great breakfast option for my friends and I during our recent vacati","useful":0,"cool":0},"ZcsK_OpjgaUL_FC-rGi8iQ":{"text":"Went to this small restaurant that is hidden right in the French Quarter.  Both the food a","useful":2,"cool":1},"qqyps36WS4Toi6zVNAlCyQ":{"text":"I loved this breakfast place! I had the seafood benedict and it was amazing! My fiancee go","useful":0,"cool":0},"znyQ-KoRY5zXl_NEFtzZeg":{"text":"This spot is great for breakfast. My husband went on his own one day and really enjoyed hi","useful":0,"cool":0},"1HR_hwlJT5buCQR3tPJNXQ":{"text":"Excellent service and delicious food! Definitely worth seeking out when in New Orleans. Th","useful":0,"cool":0},"5scuEYvLs-2ba6yR5R-UUw":{"text":"This place was a gem. The food was pretty okay. The drinks are humongous. You definitely g","useful":0,"cool":0},"Ktc4t3wg_l7tYDeQanbFhQ":{"text":"Very disappointing visit. The eggs were cold with a broken yolk, outside was over cooked a","useful":0,"cool":0},"3fdbHYWvoR8g18IRTn3LbQ":{"text":"First time patron. Had the banana but pancakes and big easy breakfast. Everything was cook","useful":0,"cool":0},"2r2t7M5sRqwunQmJK15S4g":{"text":"Simply perfection. The Fleur de Lis does southern food right. Fresh and perfect every time","useful":0,"cool":0},"EFW5CRtGwe3cKu2QSDKeDw":{"text":"Great breakfast food and fantastic friendly service.\n\nWe tried to go grab breakfast at Caf","useful":0,"cool":0},"R15aUEuy8AtsCHi5qvjROA":{"text":"The best New Orleans breakfast! Best service! The seafood Benedict is a must as well as th","useful":0,"cool":0},"RvbqKXhFJoTyw3nmprgcIw":{"text":"Stopped here for breakfast before leaving town today. Everything we had was excellent and ","useful":0,"cool":0},"PGwDk1fuvFAx4rz8sUPKSA":{"text":"For me, at 8:45 on a Sunday morning, the wait wasn't bad- I was maybe behind 5 people.  I ","useful":0,"cool":0},"sLmHkpLKgswVgTY2JuM3gQ":{"text":"Breakfast was delicious and the drinks were just as good! Sat on the patio and had a great","useful":0,"cool":0},"20I39iy5RV6LA7E6RfNS5Q":{"text":"Waitress was awful. Food not as good. I feel like she lowkey ruined the experience with he","useful":1,"cool":0},"830LpMn4vcrd1H7cVYaBWA":{"text":"Seafoodbenedict So good! It was a great way to start the day before walking around the Qua","useful":0,"cool":0},"-ZhlrIb0ij3KTzO-6krYCA":{"text":"I've eaten at this place several times lately and have to say it's a great place for break","useful":0,"cool":0},"mz7AbB9n2x8RFZbaoqtrwA":{"text":"excellent breakfast.  The omelettes, hash browns and sandwiches all hit the spot.  will de","useful":0,"cool":0},"Vbc5a2J_NlcQJ-Lx3useuA":{"text":"This is really 3.5 stars, but this place was so cute, I'm pushing to a 4. \n\nThe Line Up:\n\n","useful":1,"cool":0},"iPqgcoBr4OOF7hGkB5aSrQ":{"text":"I've been here many times over the years but my partner and I got really horrible food poi","useful":1,"cool":0},"BDX46RZzbVp9zPS2ffjnQQ":{"text":"Great service and fantastic food. Awesome little diner. We were served quickly and the sta","useful":0,"cool":0},"3t1T085WunOWv0Js19SAHw":{"text":"Food and service were Great!!!! The strawberry, and mango mimosas are a must. I ate the Bi","useful":0,"cool":0},"gR6bso1v1CdxZFIIqPXtUw":{"text":"Shrimp and Grits.... Get them!  Very nice/quaint place with extremely good service. Also g","useful":0,"cool":0},"rBFfS75mw2asVszBlvUarA":{"text":"This place was right across from our hotel and consistently had a line out the door, so we","useful":0,"cool":0},"sZxwZLLu4jAad1OcRbpihw":{"text":"Slow service but really good food, otherwise I would have given Fleur-De-Lis a full 5 star","useful":2,"cool":0},"VpixjIm4v-Ihtse0jjIv_A":{"text":"Staff were super friendly and the food was delicious, and plentiful. We only had breakfast","useful":0,"cool":0},"GJznZo-02WH16ViLTkNckA":{"text":"This little gem is a great place for breakfast. The food was hearty, warm and satisfying. ","useful":2,"cool":2},"Rpof8uWs95VRBmqg3Zpwrg":{"text":"So I didn't even get to try their food.  It's 7:20 and  they are still not open. They just","useful":0,"cool":0},"m3XJNnREgosI1wd0Htausg":{"text":"Ya know that symbol? The one on the Saints football helmets? The one you see all over New ","useful":8,"cool":6},"E2d29aZ5VMJyD4dfwtpT9g":{"text":"Outstanding classic New Orleans brunch. Loved the  signature omelet with crawfish. Be sure","useful":0,"cool":0},"az0LQr7Fg4tpb7_JwThPpg":{"text":"In town for a bachelorette party, we showed up around 11 am on Easter Sunday hoping to get","useful":0,"cool":0},"ddMI4_zQC5no1jrFjDMIXQ":{"text":"Noisy, small place, crowded, inconsistent quality. Ordered eggs over easy, but came well d","useful":0,"cool":0},"q2eh8KnABH2rXHJ5JBJPaw":{"text":"Fantastic breakfast spot in the quarter and they serve breakfast ALL DAY!! Husband loved t","useful":0,"cool":1},"hxR6dfTdKzUydDwtY98V6g":{"text":"The Oysters Benedict was outstanding.  (A little lite on the hollandaise, but just ask for","useful":0,"cool":0},"vBfKtyVOclZjqfKRKsFGJA":{"text":"Shrimp and cheese grits were great!!!!\nCouldn't believe that they had turkey bacon for the","useful":1,"cool":0},"Zkf1TtCnX-Bsfsn_2cCoSQ":{"text":"Maybe the best pancakes I've ever had!  Like most breakfast places a little pricey I felt ","useful":0,"cool":0},"tBmoWy8f3r_94WRrYijHjQ":{"text":"My wife and I ate here after getting off our cruise ship. We were starving and wanted brea","useful":0,"cool":0},"A5gJ9OyYuE4_Pi8E2vEfJA":{"text":"This was a really hard review for me to write as we were a party of two and both felt comp","useful":1,"cool":0},"UR-c2qwz4P9ArNreinQo_A":{"text":"Came with the family on a Monday morning and all the tables were full. Got the chocolate c","useful":0,"cool":0},"3Z4Vmih_Meksv-JIuUoK3g":{"text":"Came here for brunch party of 4. The wait wasn't too crazy, we waited about 20-30 minutes ","useful":0,"cool":0},"cN67KhzTCuDnpAV-PIy37Q":{"text":"We visited this restaurant on my birthday weekend due to the reviews we saw on Yelp.... TH","useful":2,"cool":1},"_EAXhJASMd0LFkitwdjh1A":{"text":"I would have given this place more stars if it wasn't so packed and chaotic. Granted, I wa","useful":0,"cool":0},"Ay9j_p0zxTGMdQTBvUmtGw":{"text":"Awesome breakfast spot.  Seafood eggs Benedict.  Fried green tomate Benedict.  - could be ","useful":0,"cool":1},"WfgL4g1xpoC23MT_ROgGvA":{"text":"Great food, good portion size for the money. Considering the place is small and six server","useful":0,"cool":0},"uK5Jpkg9CIQlIPQFGNSPxA":{"text":"Great brunch. Small, quaint restaurant with an excellent, friendly team providing attentiv","useful":0,"cool":0},"grTCdY9qq9g7cVgsF1l1sA":{"text":"Absolutely fantastic. We had breakfast, with excellent eggs benedict, omlettes, hash brown","useful":0,"cool":0},"eCC7kTZ_TwD876ZhGBU8jg":{"text":"I have been to eat breakfast here a few times, and they never disappoint. I went for my bi","useful":1,"cool":0},"hv3RJcrBq9NDT6vnOY6RVA":{"text":"Amazing!!!!! The food had great flavor came out super fast even though they were busy. I h","useful":0,"cool":0},"MCRGw_miRaRgsy9fywPUtQ":{"text":"Great little joint with exceptional food that is not over salted. Highly recommend getting","useful":0,"cool":0},"WIM_p3sQAvYdjMlMySPZeg":{"text":"I happened on the place when I was looking for lunch.  (I should add I live here, so I was","useful":3,"cool":0},"ldNHS8WfF5MPo_1F1QGuQw":{"text":"Decent breakfast spot ... The menu online does not match the menu in the restaurant though","useful":0,"cool":0},"QrCF4x7OwbzoscXe4W276Q":{"text":"Breakfast Sandwich with bacon on a croissant with hash browns; this is the perfect belly p","useful":0,"cool":1},"bAn8p_OV1vAXHfJWG0sj8A":{"text":"Good place to grab an inexpensive bite to eat in the French quarter. My latte was really g","useful":0,"cool":0},"VNRgUSjlIYDZFipAFautEA":{"text":"Fleur de Lis never disappoints! We travel to New Orleans every couple years and we always ","useful":0,"cool":1},"ubMfSrxSiCYbYnNiOFAX-g":{"text":"Food was great and prices were fair. Drinks however, were expensive... $5 for a small glas","useful":0,"cool":0},"xsWDdvpGqpfOPqoPQBZXWQ":{"text":"Ordered the Big Easy Breakfast and strawberry mimosa. The mimosa is made of real strawberr","useful":0,"cool":0},"sr0XyFxt1DagVNoP9CvPtA":{"text":"Really good eggs Benedict! Also the grits were pretty good and the coffee was solid. Reall","useful":0,"cool":0},"pBf3_KNU6SH053woKjUrjw":{"text":"***3.5 stars rounded down***\nI have mixed feelings about this place. While the food is pre","useful":0,"cool":0},"7w10VNz5-kKKKSXJ1qt8Vw":{"text":"Very impolite people, came with my service dog and wouldn't let me in, because I have  psy","useful":0,"cool":0},"n5WMZ4noonkgZauj-3Pt3Q":{"text":"Awesome. And very filling. Hash brown heaven is exactly as it sounds and is definitely rec","useful":0,"cool":0},"1x7GwlMT79IKfPwL8kkx5g":{"text":"Let me start by saying the Hash browns in the place is the BEST I've ever had. Hands down!","useful":0,"cool":1},"P4jqQv1HQQ8xMkN3WSisGQ":{"text":"I have been to New Orleans many times and I have to admit....the best grits ever!  So crea","useful":0,"cool":0},"jPzLxHusLGxuiByQihTR1w":{"text":"Outstanding food- from the drinks (we ordered a bacon Bloody Mary and a shrimp bloody Mary","useful":0,"cool":0},"SMkZbEDX8-14yBjVu3MNDg":{"text":"I was excited to see so many crystals and stones! They have some pricey gems as well as so","useful":0,"cool":0},"h-27sD2DTnhXfPCJlvMfhQ":{"text":"Their shrimp and grits is the best I have ever had!! The sauce is so good and they don't s","useful":0,"cool":1},"krE-AoDv6WvhlhOhoExcMA":{"text":"Great place for brunch! The restaurant is a little small but the service is great and thei","useful":0,"cool":0},"dRyNn9unTRn4U38dCCP1Sg":{"text":"Ok seriously amazing breakfast! Excellent service!! The Benedict anything is perfect. We h","useful":0,"cool":1},"N69kHk_QvGYeaDwSmwae_A":{"text":"Wonderful breakfast.  Old fashioned creole and Cajun twist on omelette  and eggs Benedict.","useful":0,"cool":0},"gJypDFlYFRQPOE7zmD901w":{"text":"This was our second time to eat breakfast at Cafe Fleur De Lis.  It was even better this t","useful":0,"cool":0},"s_gCyN4rm5G-RJIcmQjfeA":{"text":"On a christmas day, we found a long waiting line... what are the odds. I decided to spend ","useful":0,"cool":0},"E-7wAlPHwcMllt7KdCuuNQ":{"text":"Pancakes hands down the best I've ever had. They were so fluffy and yummy. The bananas and","useful":0,"cool":0},"5awXVN1omxBYx0ZT2TgYPA":{"text":"We have breakfast here every time we visit NO.  It was super the first few times but the p","useful":0,"cool":0},"fypyb4AhPJsfFmPUDTVX_w":{"text":"Thought we were in the wrong place based on the pictures posted on Yelp. It no longer has ","useful":0,"cool":0},"fxg-3IqNvSt6cLbKG9l3NA":{"text":"This was exactly what I wanted for breakfast after a long walk on a hot day in New Orleans","useful":2,"cool":2},"-saHwrbjZ9vgjzQfPo29mQ":{"text":"The food here is amazing!  I had the shrimp and grits and it was by far the best I have ev","useful":0,"cool":0},"IQWh2kJVRLv_aLwo16zFrQ":{"text":"Very busy place for breakfast; for a good reason.  The welcoming and up-front service is f","useful":0,"cool":0},"5kko5CVZ7sB0mUYY9vvSjQ":{"text":"Took 50 minutes to get pancakes and gumbo.  Gumbo was cold.  Sent it back and came back ba","useful":0,"cool":0},"MnuY9UJrGRJOEF5QrXTnSw":{"text":"The food was yummy! Customer service was awesome. It's a loooong wait. Be patient and be n","useful":0,"cool":0},"RJkBCjjkuAbxTYgd1Z7S8w":{"text":"Best strawberry mimosa I've ever had! Ask about any off-menu specials they have! You won't","useful":0,"cool":0},"FtRT-3bC4YSKZfE4VpXJBg":{"text":"We had breakfast here very good the French toast was good eat my daughter's. The eggs Bene","useful":0,"cool":0},"Dy_FxhATbmRtIB7q7EZYoQ":{"text":"Unfortunately I did not have a chance to sample the menu. My husband and I decided to try ","useful":0,"cool":0},"nKintpQjKoWEKfjqoHGDEA":{"text":"Food was nothing spectacular.  I will say the mango mimosa was really good.  Stopped in fo","useful":0,"cool":0},"w2vyWTxOylvaHTk88Ystww":{"text":"Oh I hope my other review didn't post! This place was great! The meat was nasty but everyt","useful":1,"cool":1},"DxcYoJVUt5_Yxk0Dxsu9Cg":{"text":"Wouldn't seat a large group. Said that it wouldn't be fair to other patrons. Not sure how ","useful":0,"cool":0},"nPwzUDpF-Us8CcKoFaA36Q":{"text":"Couldn't get enough of this place. Breakfast is delish. I kept it simple but man was it go","useful":0,"cool":0},"pzSOQgadKZyQ3xOstidFgQ":{"text":"Really disappointed with this place.   Breakfast came cold, they were out of the seafood p","useful":0,"cool":0},"sqLcjWPTxhrQMso4Rk9v1g":{"text":"Stopped by for breakfast. Friendly staff and fast service. Eggs, bacon, grits and toast al","useful":1,"cool":1},"LvOYrz9EQBYX6xy8yOiQjA":{"text":"After my group decided to eat without me I yelped this place. I didn't have to wait in a l","useful":0,"cool":0},"b2HLsPdI2O4ducXNdQGdEw":{"text":"I used the Yelp app to join the Wait list and when I got there, I only waited for maybe 5 ","useful":0,"cool":0},"QjLBxR_HAGNHxCf43-KuxA":{"text":"I found the place by accident and really lucked out! It was 11:30 AM and I wanted breakfas","useful":0,"cool":0},"cDHUh8iGijQnsLsZYi5rhw":{"text":"Great coffee! Delicious eggs benedict and hash browns!\n I would definitely return.","useful":0,"cool":0},"H9Yph2QWHMjXEfze-qgypw":{"text":"I had the breakfast sampler with French toast instead of the hotcakes for a $1 extra. The ","useful":0,"cool":0},"U2T3euhtuaD_M3mOc7ZhKw":{"text":"My sister and I came here on Labor Day around noon and there was a 20 minute wait.  Not ba","useful":1,"cool":1},"0rba0IcwXSyEWSEebYGGow":{"text":"This was extremely difficult to rate. The food was really good. We had the French toast wh","useful":0,"cool":0},"Cb49y2TKUt6vqHXZvl1IdA":{"text":"Nice place. Close to my hotel.  Slow service, slow coffee.  Two tables have been served an","useful":0,"cool":0},"9uoJ45VS7ouu1zuVcXuNUw":{"text":"Food is average. Customer service could have been better. I'm not sure if the waitress was","useful":0,"cool":0},"T7wz6JjYrNKu6cQa1BgPIw":{"text":"The best food I have eaten in a long time. The shrimp Bloody Mary was incredible!!\n\nI hade","useful":0,"cool":0},"Sk8EQVpXlTLbkNeAqiUf2g":{"text":"Stopped in here quick to get out of the rain. I had a soy latte - it was delicious! May be","useful":0,"cool":0},"BRT3rt3AZviuXdYY6QnTCw":{"text":"I found this place via Yelp as my fiance and I were looking for somewhere to grab a great ","useful":0,"cool":0},"emuYlKvVAvSo-5zwufK5qA":{"text":"Horrible. Went there for brunch and was told it would be a 45 minute wait and they would t","useful":0,"cool":0},"d5BTrcjId3_iVPcX5Mge-Q":{"text":"This was so disappointing. Our server was amazing but the food was subpar. We ordered the ","useful":0,"cool":0},"D9lhQzCh_5oxesO_E7O9sg":{"text":"Tiny, crowded, sort of elitist , basically quintessential French Quarter with good breakfa","useful":0,"cool":0},"QE7krolYSES9BTnuLilfXw":{"text":"The place is definitely very small.  We had a quick breakfast here, I enjoyed the hash bro","useful":1,"cool":2},"oTRv1m_dXe-5F6ZY91JuYA":{"text":"Definitely my favorite breakfast place. Four stars only because the service can be slow an","useful":1,"cool":0},"IRMgTafHMEN7MOciVAaSfQ":{"text":"Got the shrimp and grits which was on point, and the pancakes. If you want a great breakfa","useful":0,"cool":0},"9lrtRxJgxOOx_7pA2V83kA":{"text":"Solid 2 . This is just a run of the mill diner here how evr u slice it. The service is med","useful":0,"cool":0},"2DwNG069y8_EjRNhCfGxWQ":{"text":"Modern take on traditional cajun dishes.  Good food, not overwhelmingly amazing, but worth","useful":0,"cool":0},"yXk9QvZMjfKnlpaKLBHpdA":{"text":"This was the first place we ate in NOLA. At the time it blew our socks off, but after expl","useful":0,"cool":0},"4x8y1-X_dVpXUThGBm7ByA":{"text":"Arrived at about 7:30 on a Saturday morning. There was one other table occupied. Server wa","useful":0,"cool":0},"SxV4WZLdEqFGcObWFKkP3g":{"text":"While visiting NOLA for Thanksgiving weekend, we stopped here for breakfast. Quant hole in","useful":1,"cool":0},"x4oBzLEfO5dekA5oEQD5Tg":{"text":"Tried to order some mojitos to go. The waitress rudely told us to wait, and continued to c","useful":0,"cool":0},"PnAsEqQk-kGOfudOrT9VfA":{"text":"This place is fantastic! It's a great New Orleans restaurant that is actually healthy. The","useful":0,"cool":0},"-EjCD6YX6FsR_qopMC_y0w":{"text":"The crawfish omelet is the best thing I ever eaten for breakfast.  If it wasnt a thirteen ","useful":0,"cool":0},"5IbGdJuwcFxxPmAgWNj7Lg":{"text":"Got in as we arrived to town before walking around the French Quarter. I believe we got on","useful":0,"cool":0},"0IzMwRWmLsPg4iDK8LEIow":{"text":"AMAZING! A tiny restaurant with great service.The comfort food makes you feel at home. The","useful":0,"cool":0},"40fjMErGaAvjk6ttr6a_Aw":{"text":"Really enjoyed the Shrimp & Grits, But the Bloody Mary was excellent!!! My wife had the Bo","useful":0,"cool":0},"x2S_XwLADT6FcJSOn9mwHA":{"text":"Great breakfast here. I got french toast which was amazing. I also got eggs, bacon, hash b","useful":0,"cool":0},"ZgCRaI-NA83yUESecPW0HQ":{"text":"Bravo Cafe Fleur De Lis!!  This gem of a cafe was the perfect spot for a late breakfast on","useful":1,"cool":1},"NOww_gCXyiH7FfiRpJvGzA":{"text":"I ordered the French toast and it was fine. No complaints exactly, but not memorable at al","useful":1,"cool":0},"i72O4SeycLnQamwXSpYvEw":{"text":"We enjoyed breakfast here on March 11th during our spring break in New Orleans. The food w","useful":1,"cool":0},"G22CNE3kM38wHpXIgapSYw":{"text":"This is in a good location and the wait staff was friendly.  Was full and the ambience is ","useful":0,"cool":0},"DhRDlSdu86g8-Tb98h-otQ":{"text":"Fantastic food, quick service. Everything was perfectly cooked and delicious. Server was o","useful":0,"cool":0},"SKqHZ0w92h3-YyZdKxTjsA":{"text":"I put myself on the waitlist ahead of time. I showed up about 20 minutes early though, and","useful":0,"cool":0},"uvVQNyBTmkvFLPR4JgZr8A":{"text":"Delicious seafood Benedict, amazing latte, good service. Cute spot in NOLA definitely reco","useful":0,"cool":0},"BY4vCB8xkUCNNYU2PeWvOA":{"text":"Wonderful people!\nGreat spot in the French Quarter!\nAwesome service!\nHighly recommend you ","useful":0,"cool":0},"zmFiwuEc3Emc8YoV7Bu93A":{"text":"This place was awesome a hidden gem, highly recommend stopping here and eating some great ","useful":0,"cool":0},"KkPd2metwq_XEzQwJrIcEg":{"text":"Stopped by for brunch. And it was great. Mango mimosa is just you'd expect and the wake up","useful":0,"cool":0},"jvd0APoDEej0jbjGv075Qg":{"text":"DON'T DO IT!!! FOOD POISONING. I know in New Orleans NOLA is extremely laid back and don't","useful":0,"cool":0},"JWdxZMmCnXOyzKUsLqz4ZQ":{"text":"If I could ship those hash browns back to my hometown, I would order them every weekend! I","useful":0,"cool":0},"gNXO2OxHx_ahrVTR7mZboA":{"text":"This place is worth the 20-30 minute wait. Especially when you can just walk nearby to awe","useful":0,"cool":1},"exrN5ofnSTkbGp-yE-qoaA":{"text":"Good food, nothing spectacular. Got the big easy breakfast, which is a lot of food for its","useful":0,"cool":0},"vzs4Djqve1m8vqM8agyLhw":{"text":"Get here early to avoid the wait or order to go.  Very friendly staff and good eats. Try t","useful":0,"cool":0},"SXJ6C9SNUnu_Akqljp-oLw":{"text":"This place was right across from our hotel, the W so we kind of stumbled in. So glad we di","useful":0,"cool":0},"cXNpO_BLNg-DNV2x9YXy5Q":{"text":"The place is quite small and we waited for our table and then waited about 20 minutes for ","useful":0,"cool":0},"fs-6DPaHhf5eRZpAK0nsSA":{"text":"Stopped in here while visiting based off of reviews. They seated us pretty quickly, place ","useful":1,"cool":0},"iR2RmHZytyEG3SH_dcc_pg":{"text":"The service was horrible. My friends waited an hour and a half for their food. I waited 2 ","useful":0,"cool":0},"MPRuwOPLPIbdgd0_aDNIjQ":{"text":"Usually when I have Shrimp and grits, I don't say more than \"good\" but Café Fleur De Lis's","useful":0,"cool":0},"K3nbkyvNZcBcJGh4sYIIoQ":{"text":"Great service but kitchen too slow. Quality of food not worth the wait. Main floor and ups","useful":0,"cool":0},"I61vFAqtInCLAmQLVF4PIw":{"text":"I had read positive reviews for this place, so I decided that I would have breakfast here ","useful":1,"cool":1},"vMaatnPWiVOXkJ6nrX67og":{"text":"Great service from Jamie and excellent shrimp and grits, French toast and seafood Benedict","useful":0,"cool":0},"23ozsJWAhrERcXZb6-W94Q":{"text":"Seafood Benedict was okay. Nothing that really stood out. Wish we skipped the place so we ","useful":0,"cool":0},"2HGhoaKwX3N7k5uc2ZdzYw":{"text":"This is not a fancy but super cute place that has become my go to spot for late mornings w","useful":0,"cool":0},"qzPs1S-tJQTUigF84MvUrQ":{"text":"This mega American diner is great for breakfast or lunch.  There are generally lines and w","useful":0,"cool":0},"ShpZmguRfzI7fvWDqNJ7YA":{"text":"The service was pretty good as they gave is a discount due to delay in receipt of food. I ","useful":0,"cool":0},"qrUJVQnzcUh8W-krPuA71w":{"text":"Our breakfast and drinks were fantastic.  We had a mimosa and a Bloody Mary, superb. Our s","useful":1,"cool":1},"xqkjYKOef8rH2JtfCKX-fA":{"text":"Disclaimer: This only speaks to the creole breakfast platter. Mediocre at best. The grit w","useful":0,"cool":0},"h-SZh4Zohz6T_SqB6tstsg":{"text":"A cute, quaint, french-style cafe in the heart of New Orleans! My family and I dropped by ","useful":1,"cool":1},"eqe4Wr_HJy7omelF3iAoBA":{"text":"The eggs Benedict were amazing! They bring your tea/coffee in big mugs. The wait staff is ","useful":0,"cool":0},"A6fNmMdi6rkSweLR0pkiDQ":{"text":"Cinnamon roll pancakes were amazing!! They are warm and sweet with icing on top. Best panc","useful":0,"cool":0},"AlQOIbtebR9sYw2ArraQPQ":{"text":"I'm surprised this place has \"only\" four stars. It was my favorite meal in New Orleans, wh","useful":3,"cool":2},"XP3ZaAd0spnBFdLS7THpKA":{"text":"This place has absolutely delicious food! I tried the bacon/egg/cheese on a croissant w/ h","useful":1,"cool":1},"N4FPR4SiFoENq66eh7249Q":{"text":"by far my favorite breakfast spot in New Orleans! service is always great and the food is ","useful":0,"cool":0},"LdXgqZThIBdUYRlzD0nlig":{"text":"I found this little cafe while wandering around near my hotel. They had iced tea, espresso","useful":0,"cool":0},"e3nUw6OFvt7uoHCKyDBtdw":{"text":"The shrimp and grits were amazing. The staff were friendly and the food services was quick","useful":0,"cool":0},"Fp0CLH7LaS2Pp9Jk28Y38g":{"text":"Long wait.  Small restaurant ~. Great smiles from staff.  Awesome food!  My husband had th","useful":0,"cool":0},"iXW3s7E8whYIKHW3WvygkQ":{"text":"Friendly service and better food! The fruit, veggies and salad were fresh. The mango mimos","useful":0,"cool":0},"UZGMdjs3NbKcr34M9v644Q":{"text":"Quaint,quiet, Beautiful Nola style cafe.  Nestled away in the French quarter.  Service was","useful":0,"cool":0},"7sAibJAwzKWRxu4935WC4A":{"text":"My breakfast was okay and decently tasty hangover food (turkey and egg sandwich with creol","useful":0,"cool":0},"xPHiN6fFiQHjTbxgrVPHNA":{"text":"Very good, cozy breakfast spot in quiter part of French Quarter. Everyone from our group o","useful":0,"cool":0},"DldTk7vDqxF8JkAylptv4g":{"text":"Yes. Yes. Yes. \n\nTook a 10 minute bike ride and waited another 15 to be seated.  Well wort","useful":1,"cool":1},"ycMSVHcaHsQM6key7M4UEg":{"text":"....and I am being generous with that 1 star!\n\nSecond day in NOLA, we wanted to try anothe","useful":0,"cool":1},"ZVA3VU1vYvw2pA6TMi64ug":{"text":"Shrimp and crabfish for breakfast? Well these guys can combine the both and make a great d","useful":0,"cool":0},"06U7IHTZ9FD4goSwjVF2ag":{"text":"Loved this place! The pancakes are the best I've ever had. Glad we decided to go. Will be ","useful":0,"cool":0},"ICagTwVDdCVvfn-t-zfZ9g":{"text":"Really nice atmosphere but was hot and the food was not fresh. There was mold in my friend","useful":0,"cool":0},"VhDNTq2lH5LreYPiGO4RGw":{"text":"OMG!!! The food is amazing! It's left me speechless and sleepy. :-) If you are looking for","useful":0,"cool":0},"Y-PlKUBjuUDmf9N4tlcpyw":{"text":"Wonderful coffee. A very cozy diner feel when you walk in. We had to wait about 10 minutes","useful":0,"cool":0},"MdhyEBiUU27_rjdXZHSY9g":{"text":"We sat in a two person table on the wall and immediately smelled urine. Got up and left. C","useful":0,"cool":0},"rFxqbPx7-F0fcJzj1H82Mg":{"text":"This place was good.  I had the seafood omelet and I could have used a bit more seafood. A","useful":0,"cool":0},"wJhjFxXk4ASVV9VJriSlkw":{"text":"This place is very well organized and the staff communicates well with each other to give ","useful":0,"cool":0},"JfBL6sIydZDJ2XdZXOGJNA":{"text":"This place was amazing!!! I also appreciated that they use the No Wait app. Their food is ","useful":0,"cool":0},"xZqW2KIRynX2SXG6xJqxMA":{"text":"It was Christmas morning and we needed some breakfast.  We didn't want to pay a huge amoun","useful":1,"cool":0},"ik_E7pNC0Ngh6DY-csp7cQ":{"text":"A lovely small cafe very close to the French Quarter. It's usually very crowded during lun","useful":0,"cool":0},"yY5cz8wz-toW0QC6cjwiiA":{"text":"Even though it was packed, we got seated right away, and the kitchen had run out of a lot ","useful":0,"cool":0},"KdoSOx7uwLYxUm41gKNb_g":{"text":"Service and ambiance were great. Coffee was poor. Grits were excellent. Eggs were a horrib","useful":0,"cool":0},"H6Z-tV7OyYIbSqMxfldKFA":{"text":"Went to this restaurant with another couple per their recommendation and happy we did.\n\nWe","useful":0,"cool":0},"tdT7He4I1lYkwcr79Brnnw":{"text":"The food was great, the service however was very slow and the food came one plate at a tim","useful":0,"cool":0},"qSW0hq1lVsvo-8ptt5UR5A":{"text":"Great brunch spot in the French Quarter! Went on a Sunday morning 10.30am and was quoted 3","useful":0,"cool":0},"FU-3GuFDUIzCDgdmPj2VIQ":{"text":"The food is EXCELLENT AND SEASONED!!!!  Customer service was excellent!! The grits are AWE","useful":0,"cool":0},"izdarRtOwKfqg4h-ScdJWw":{"text":"I love the atmosphere and the food is good. They used to have the most beautiful (and tast","useful":0,"cool":0},"XmoDvfYkN8bOI6pcdXkyQQ":{"text":"This has been my go to breakfast stop for many years but it's been about 2 years since I v","useful":0,"cool":1},"d19WC3zkhEKnUL2hCi6KFg":{"text":"Stori is one of the best waitresses I've ever had! She's like a second mother. Great exper","useful":0,"cool":0},"8MQFvchZ0In0CdLRRAA2aw":{"text":"I was in NOLA for five days and ate here three times. It's that good; for brunch at least.","useful":0,"cool":0},"8i8IMczFnDMxeCVu25lkJw":{"text":"Cute little restaurant, you come in and order your food at the counter, sit yourself at an","useful":1,"cool":0},"rFlwBEI3jT9pen2NQXAM_g":{"text":"We had breakfast here and the food was amazing. Probably the best vegetarian omelet I've e","useful":0,"cool":0},"gACl0FSrYWsVZehAkyePJw":{"text":"We decided to try a new place for Breakfast and went to the Cafe Fleur De Lis.  Where has ","useful":0,"cool":0},"GFIRYncX4YQrjGo_AhZ0MA":{"text":"Super cute and so good we really enjoyed our breakfast! We had the spicy boudin omelette a","useful":0,"cool":0},"qx_xZbD0JgA2Zz1I215ZNw":{"text":"This place was excellent!  Food was delicious,  especially the Big Easy Breakfast. Some of","useful":0,"cool":0},"ma3Cbuqtb8_UqL0NH_jdug":{"text":"The French toast was mostly a piece of dried bread\nThe waiter was good and attentive\nThe c","useful":0,"cool":0},"KwohCRQGZlkkLilkfkns7g":{"text":"I was looking for a breakfast spot and saw this spot near my hotel. The internet pix drew ","useful":1,"cool":0},"uShX_TnGGZ2oXfAwk2-XVA":{"text":"Yelp led us to this gem. If you want a regular pancake breakfast, go elsewhere. If you wan","useful":0,"cool":0},"7c0B3QRBNmw3ijzfeG8eVw":{"text":"I had a good breakfast here and the service was super-quick. Everything was cooked perfect","useful":0,"cool":0},"leY1dS1Qso_Ncj3-2Vut8g":{"text":"Really Quick service and the food was top notch. Standard southern style food with New Orl","useful":0,"cool":0},"7Hlpw_b8OonagJNGmmhp-g":{"text":"Let me start off with the positive... the mimosa's were wonderful. The restaurant is cute.","useful":0,"cool":0},"zCU1FsipPSuI3I1LMQ7-kQ":{"text":"My husband picked this spot for breakfast because it had good reviews and was a quick walk","useful":0,"cool":0},"nFQrNsdrJkJjQZbilXoYKw":{"text":"The breakfast was amazing! Only thing is that the seating was a bit too close together wit","useful":0,"cool":0},"XgsS0l7hhxSyGNLw-K7Ucw":{"text":"I had the seafood eggs Benedict with hash browns and they were amazing! Three days later a","useful":1,"cool":0},"LAMpzxTSIxy0yldcXo77Ww":{"text":"This a very delicious restaurant right in the French Quarters. Tina D. MUST be your waitre","useful":0,"cool":0},"ySd8Js_LM0kiCO8EYjJnIQ":{"text":"This restaurant was great!  I visited for breakfast and the shrimp and cheddar grits were ","useful":0,"cool":0},"dSexjzsuMrltXr06RJXuXA":{"text":"I'm here in NOLA for a conference and wanted a breakfast place outside the hotel. Cafe Fle","useful":0,"cool":0},"qDnmIXRZCbUQ-JjPE6iSYg":{"text":"Such a sweet quaint little café. Nothing too fancy or super pretentious. It reflects the h","useful":0,"cool":0},"O2jPatH9qGwkWWnOqME0Wg":{"text":"Glad I found this place on Yelp! It was a cute little restaurant with friendly staff! Brea","useful":0,"cool":0},"-zmmIAidvA4ybe_GII7Ybw":{"text":"The Staff was wonderful! \n\nDon't get the French Toast, I needed a steak knife to cut it an","useful":0,"cool":0},"JUhBc8vigST5Hnm9CtLNZA":{"text":"Cute little cafe situated in the French Quarter. Came here twice for breakfast and loved i","useful":1,"cool":1},"uMJs8VSyU8DJnIpYPCs3Tg":{"text":"This place is so unpleasant.. cook speaks very nasty to the servers, the sweet pancakes wi","useful":0,"cool":0},"BLrODDuECjs6cikUcXFOxQ":{"text":"Visited this restaurant today. My family and I were wanting to try a new restaurant. We we","useful":0,"cool":0},"7FKiJdnrttp_VBTj01u7cQ":{"text":"Nothing much to say except this place is fantastic!  Every single thing is hands down grea","useful":0,"cool":0},"Srvd3vMX5o9lntOeO2wK1A":{"text":"It would be pouring down raining in New Orleans but this place was a nice restaurant to ha","useful":0,"cool":0},"_qnIzR2FUx1L_JPDTZ-A-A":{"text":"Came back for breakfast 3 days in a row during our vacation. Great food, and good service.","useful":0,"cool":0},"oso-Aon9JFJh12XZH1g9IQ":{"text":"Perfect spot for breakfast.  A group of us took a stroll over from the hotel and started o","useful":2,"cool":0},"S1pK72EEw0dqv8SC1TckXw":{"text":"I found about this place on Yelp and am so glad I came for breakfast!! Wow, the Seafood Be","useful":0,"cool":0},"1eLA9_i8CY-kR7ctdurGcw":{"text":"Great food. Not a fan of the menus and round up silverware sitting on the floor at the fro","useful":0,"cool":0},"qWomMD6Ts6Wi6W9HGp-ZIA":{"text":"Out and about in the French Quarter looking for a likely breakfast spot? \n\nFleur De Lis is","useful":0,"cool":0},"rUzPEuBdoKMs8l0fht0CdQ":{"text":"Breakfast was amazing. We went in with a little bit of a wait but completely understandabl","useful":0,"cool":0},"TleHb3sN5cjm5GvrYIFYrg":{"text":"I hate giving bad reviews because I know it's tough to run an extremely busy restaurant du","useful":1,"cool":0},"UGy8cMZgz6goasMV6EFbrA":{"text":"If the hostess was a little better at her job, this would have been a perfect experience. ","useful":1,"cool":0},"tk7wgeIS5Tqs-7RjbPg6xw":{"text":"The only good thing is that it was a short wait and they text you when the table is ready.","useful":0,"cool":0},"Jx5Mb9ozcBVDxnoY-S3rRQ":{"text":"Wonderful brunch spot! We got there at the perfect time without having to wait. Even if yo","useful":0,"cool":0},"CgLI2_9ElO6cSk7FndaNHw":{"text":"We stopped here for our last morning in New Orleans.  I heard good things about it so we h","useful":0,"cool":0},"79gWWogima7jRstoJp2VLg":{"text":"I usually only leave reviews if I love the food, but I hope this attracts the attention of","useful":0,"cool":0},"EEn9KA4tBs93-0kcSJIv6Q":{"text":"Tasted like premade and Hollandaise sauce was squeezed on last minute from a plastic bottl","useful":0,"cool":0},"caglKFEUq8ILyFlzQqbWEA":{"text":"Shrimp and grits!!! The service was fast and friendly. Great bargain for New Orleans .","useful":0,"cool":0},"fsi0olbFrETdyfZIRsmQog":{"text":"The worst meal.  Eggs benedict with soggy biscuit flavorless.  They sat us by front door, ","useful":0,"cool":0},"yxWOpHBu4U3Ws_Mo5wBD0Q":{"text":"Great breakfast spot. Everything we had was great. Prepare to wait in line. It's a popular","useful":0,"cool":0},"rd98sYG3fk3j8o8dyupL_A":{"text":"What a cute place to have breakfast! I only had a15 min wait and they text you. The boutiq","useful":3,"cool":1},"bu5-inVHC2jRVL6sCoEslQ":{"text":"My favorite casual breakfast place in New Orleans! Great food, chicory coffee and drinks!","useful":0,"cool":0},"1UwllFD8kH4kZoDdvvJqxQ":{"text":"Came here after reading some reviews and it was just average. I never realized how much I ","useful":1,"cool":1},"8gVIG7fJrYafIPg9VZ1kkA":{"text":"Got a little turned around getting here thanks to the GPS (insert eye roll) and subsequent","useful":0,"cool":0},"HaqNgk_7ThcGhlok_K_foA":{"text":"Stopped in for a bite to eat and ordered the Crab and Brie with roasted Garlic bechemel wi","useful":0,"cool":0},"ULEnHqyCkYw9JGh1q5R9Zw":{"text":"Absolutely loved the spinach feta wrap.. Great service and a quaint little atmosphere. We ","useful":0,"cool":0},"6-KT46vMjNUl1hlPeViqoA":{"text":"We just stumbled into this place one morning and had a very very solid breakfast. You orde","useful":0,"cool":0},"_fNiWsYBNuGdOUvz7NOUdA":{"text":"If you want crappy food and service go here. From the hostesses to the wait staff you are ","useful":0,"cool":0},"V405Ve4yLWYVFOW1R4BaoQ":{"text":"Morning Burger (egg and hash browns on it) was super tasty. Service, and seating were quic","useful":0,"cool":0},"F_2KJqntssVV_6BuilbkJA":{"text":"The brunch here was great. Definitely recommend putting your name in via this app, as the ","useful":0,"cool":0},"E2uGp3bsOzLWnvMWEbfYsQ":{"text":"We had breakfast here on a weekday at around 9. Wait was 30 min but they had a texting sys","useful":0,"cool":0},"yXoh7HY-7DuJ32t57VQKWQ":{"text":"Tasted like premade and Hollandaise sauce was squeezed on last minute from a plastic bottl","useful":0,"cool":0},"JlqIig6jfNtl_53icXQ6-Q":{"text":"I am a shrimp and grits enthusiast! Let me say that this place gets a 5 off of those alone","useful":0,"cool":0},"yEmne4pUFBPgLx2zQptx_w":{"text":"Like most restaurants in NOLA, this place had character. Food and service was on point! Th","useful":0,"cool":0},"zJHctmZgqZ0SF3E2_QRTgg":{"text":"Very good. Came here on Saturday morning. We used yelp to save our place in line so when w","useful":0,"cool":0},"4UTZJbRNBdz41hzV7TCNCw":{"text":"It's time for my 2nd Bloody Mary' nawlings style! If you are a bacon lover try the 'Bacon'","useful":1,"cool":1},"CuW5Gbs_XvTKmggDNMA0aA":{"text":"My wife and I are here in New Orleans for two weeks.  We have been coming this time of yea","useful":0,"cool":0},"FFuf6AnS7QEeoj0Lt_K-gw":{"text":"The staff was really nice and friendly! The food was good not great. I ordered the spinach","useful":1,"cool":0},"mP_AmyREPTW9HZhn-GZ8Cw":{"text":"Based off of the amazing reviews from others, I'm going to go out on a limb and say my ser","useful":0,"cool":0},"L4f6_XMEA3YGttp0LTMctA":{"text":"I read the reviews online this morning , and wanted a good brunch , so I stopped in here .","useful":0,"cool":0},"h2poxfwSqqTTWcDZFs5TnA":{"text":"The breakfast bake sandwich was very good. I had it with ham and extra crispy hash browns.","useful":0,"cool":1},"3pgxEbMknjpjtpvlhEvLkA":{"text":"Service was good! Kept refills coming and checked on us often. They ran out of biscuits fo","useful":0,"cool":0},"wBSFlhJsi9abHnqhD20U4w":{"text":"Wonderful food and pleasant atmosphere. I ordered the Spinach and Feta Wrap and a latte an","useful":0,"cool":0},"mcutG3Tl7f44M4fXPB7ohQ":{"text":"On our way for some Beignet's and got sidetracked.\n\nNice atmosphere, kind of fun and loud.","useful":3,"cool":1},"f2d4_kL2ssK-p_e8G8TTgA":{"text":"This was a very cute cafe, with friendly, prompt service. They had a good number of gluten","useful":1,"cool":1},"p8DU_4HKfjWFvsXDc1w3iA":{"text":"Place was AMAZING!!!! Food was Yummy for our Tummy and the service was Out of this world..","useful":0,"cool":0},"2MePfKCNvwCaXq-sFJyUHQ":{"text":"Loved my meal! The food came out quickly and the service was great. I recommend trying the","useful":1,"cool":0},"jhPMNZGtsd3sC0YiVdyvdA":{"text":"The French toast was merely stale bread that had been placed in the griddle with some butt","useful":0,"cool":0},"Oc9MQ9bSjStEP-rIhr_u0w":{"text":"Wonderful lunch!  Atmosphere is casual, the service is great, and the food tasty. The catf","useful":0,"cool":0},"XNIn7pcdxR7_fXi_vg935g":{"text":"Bathroom was very dirty. Toilet brush had no holder and was just laid out on the floor. My","useful":2,"cool":0},"w1UNTlMtvT1M32PjtuVA5g":{"text":"a little bit on the pricey side for breakfast.  food was ok.  wife had the omelet which wa","useful":1,"cool":0},"nBaIxiHP4mx_cIaA-GnTkw":{"text":"The cafe is a little crowded, but the wait staff was friendly. They served cold grits and ","useful":0,"cool":0},"TNv0B2wz06D0qzKKQ_efaA":{"text":"Great bacon bloody mary. Boudin omelet was delicious. Little bit of a wait but the have \"n","useful":0,"cool":0},"qP6eUiN9B1FFIsD5_EjAeA":{"text":"This was by far my favorite breakfast spot that I visited on my trip to NOLA. My friend an","useful":0,"cool":0},"iujAlOu-_FSVq01WSE_RCQ":{"text":"Amazing crab cake Benedict and grits. Try the green tomato bloody Mary. The staff was amaz","useful":0,"cool":0},"mM0zscqR7F9ou4X3UctyCA":{"text":"The cutest, affordable, and delicious brunch cafe in the French Quarter! Located a few min","useful":1,"cool":0},"D8rSZGsdAvJWupgyjJpG1A":{"text":"Good food at reasonable prices.  Large crowds especially on weekends for breakfast and bru","useful":0,"cool":0},"2LvU8ZV8gwQQY9pJMqeCpg":{"text":"The best southern hospitality I've experienced in a very long time. Walking through the do","useful":41,"cool":45},"D_9LfEIfVjp1n6ZTE5z4Og":{"text":"I appreciated their texting wait system. We were able to walk around the shops nearby. Wai","useful":0,"cool":0},"El08VcjbgmaVPcjpXn5NdA":{"text":"I really do not know why this place has good reviews. We depended on Yelp to guide us and ","useful":0,"cool":0},"PJTqiD33BoLTE5vHDCSn_A":{"text":"Sort of disappointed with our meals. We had decent eggs Benedict but the meat and biscuit ","useful":0,"cool":0},"eEKKtpu6gt4mf1Z5ScNopQ":{"text":"Less than stellar. My food came out cold. Got the oyster Benedict - it came with THREE itt","useful":1,"cool":0},"DoHNSuRGvHIOKGWdDtpgtg":{"text":"I'm from out of town and after carefully perusing yelp reviews I set out to eat breakfast ","useful":1,"cool":0},"MGb0NMevPhzVGC5eaQU0Ig":{"text":"Best pancakes (banana) my wife and I have ever had!!!! Service was outstanding! The waiter","useful":0,"cool":0},"1mnTUkJGXo7NS2DNUrk5dQ":{"text":"During the research for this trip, I used many sources, including TripAdvisor to scope out","useful":1,"cool":0},"3VZUi0XPr9XP6FB0VbvCHg":{"text":"Charming little upstairs balcony area. Delicious chai latte! Super spicy and yummy. Oatmea","useful":0,"cool":0},"ot1HYFmfF9IkhIbACkrXTA":{"text":"I was so disappointed! This was my first time visiting New Orleans in about 15 years. I re","useful":3,"cool":0},"y9qV7HvSRB4S8B7TrFaUfQ":{"text":"I went in for breakfast. Small restaurant. The staff is very friendly. My order was taken ","useful":1,"cool":0},"t_yYn3tjFycNJin_e6XJ0g":{"text":"Came here on vacation- very quaint cafe, friendly service. Menu has the local cuisine you ","useful":0,"cool":0},"c_KupGl5Cwj0sGYuZwxdgA":{"text":"First time visiting this place after many visits to New Orleans and I will say it didn't d","useful":0,"cool":0},"Z1-6v5s9a3Ppqy9Tjsib3w":{"text":"3 words: Shrimp and grits. \n\nRecently vacationed to NOLA and the food was definitely the h","useful":2,"cool":1},"-7V3AKt38drJiKVEduvAFw":{"text":"Was very pleased with my breakfast here, minus the fact that they ran out of bloody mary m","useful":0,"cool":0},"eXxPdku7bDHfEqi3942MPA":{"text":"Went here a couple times and each time was good. Big menu to choose from. There's a lunch ","useful":1,"cool":2},"vwGPh9EmmOkMVHhQkPPOjQ":{"text":"I ate breakfast here two years ago, and it definitely wasn't anything like I remember. Aft","useful":0,"cool":0},"ucpi4ml-mF1v4B1dxpgibQ":{"text":"Food was delicious, service was a little slow, great experience for NO newbies. Had the om","useful":0,"cool":0},"yRP5hUwah0M9iWQMHmn3Xw":{"text":"We visited Fleur De Lis over for brunch on Saturday.\nWhen we arrived around 11 am we were ","useful":0,"cool":0},"naHr5Qcth0hNJ8xfYR24jQ":{"text":"I found this place on yelp so I figured that my husband and I would check it out. The only","useful":0,"cool":0},"Rrsvek_k8yPzuYFvJg8gnQ":{"text":"Great place for breakfast! Ask for Joe, he will make your dining experience that much bett","useful":0,"cool":0},"5AK4lZ8KfHNy2kQTLYWQkg":{"text":"Goodness Gracious \nOysters Benedict - perfectly fried oysters - crispy outside and oh so t","useful":1,"cool":1},"1sZsWGlnAeQuK6adiJClzQ":{"text":"I love the food at Cafe Flyer De Lis.  It took me by surprised, I ordered the basic burger","useful":0,"cool":0},"r8mMdoNUrok-yHPNSZVtcw":{"text":"Totally worth walking a few blocks for breakfast.\nAt work we get the big easy breakfast be","useful":7,"cool":5},"ynIeAal8BPpmBywPBQbWlw":{"text":"Food was delicious however the service wasn't great. Forgot to fill my water up and the Ba","useful":0,"cool":0},"5O7ueX8ZwC_FLloBDBSTdQ":{"text":"I wouldn't rate this 5 stars, but a strong adequate. We had ham, cheese, and egg croissant","useful":0,"cool":0},"4wP-a_TbIQjvQbi55bgofA":{"text":"My husband and I, along with another couple, ate here during the French Quarter Music Fest","useful":0,"cool":0},"e8P3QhqiQwMcJdsZ9i5vfw":{"text":"We had great breakfast with 3 of us at Fleur de Lis , starting with this wonderful young w","useful":0,"cool":0},"o7-KPG0v36iMLXe6KEGyxw":{"text":"This was a great and affordable spot literally across the street from the W where we staye","useful":1,"cool":1},"bOnYW8dtrBzy8sAoGcBlaQ":{"text":"Read reviews, not even close to what we dealt with.  Servers take their time to even get d","useful":1,"cool":0},"MqRS6sjYUl914Q1iPn_InA":{"text":"Food was good, had the French toast, a bit dry due to the bread being made from what seeme","useful":0,"cool":0},"XxuddmXU6NErF6GgzODaxw":{"text":"Excellent breakfast. Delicious Shrimp Bloody Mary. Excellent service. Friendly staff. Defi","useful":0,"cool":0},"39yFIIaTVCtM32j-wPlXIA":{"text":"Cute little place to eat for breakfast/brunch, and where I had my very first New Orleans P","useful":1,"cool":2},"XSj8AC5cDn1WCLVo4usrHA":{"text":"The best breakfast I have ever had!! The eggs benedict was absolutely fabulous! My family ","useful":2,"cool":0},"EoCccqIiMQfpcxaEfd9R_A":{"text":"Best sweet cream pancakes!  Good cup of joe. We had no lines, fast service with very frien","useful":0,"cool":0},"W-PZGriUIRL17NijxPdyhw":{"text":"We used the waitlist on Yelp, so when we arrived we only waited a few minutes before being","useful":0,"cool":0},"k3y_f5dkEL-VNeG9nKZeAQ":{"text":"Excellent food, fast service, and friendly staff! Best breakfast I had while visiting NOLA","useful":0,"cool":0},"woPWJhkabHpOr1yy8MBZLg":{"text":"Oysters Benedict!!! Great service, delicious food, fun atmosphere, affordable...Doesn't ge","useful":0,"cool":0},"7iB0PQBfbfE6fOsJ-4gHbA":{"text":"Small but neat spot for breakfast.  Friendly service, decent food. \n\nHad the Fleur-de-Lis ","useful":0,"cool":0},"k_ULZ8AcSqz9Q_D5acDyIA":{"text":"You should definitely visit this gem when in New Orleans. Somewhere close to the quarter h","useful":0,"cool":0},"rvmJXmxRQzPXBB9JbdzCxg":{"text":"Great location, balcony seats, mouth watering food, tremendous service staff, and the firs","useful":3,"cool":1},"SGnJ96lnUbtLP-eRzeeVzA":{"text":"Wow....my husband actually said it was a really good breakfast and there is nothing he can","useful":0,"cool":0},"sLiRjBTd-OR3MEFRvLMqRw":{"text":"Took two bites, flavor of the food was good, but then I got a small surprise in my hash-br","useful":3,"cool":0},"dSIwZZZY15dF3XLKADFzvw":{"text":"The atmosphere is nauseous. Flashing light coming from a fan they can't turn off. Waitstaf","useful":0,"cool":0},"H3tHf-KdK68erKCwbORBhw":{"text":"The restaurant did not live up to the Yelp reviews in my opinion, or maybe I did not get t","useful":2,"cool":0},"SHR6uqjI1H3kJ7h1DrHJXQ":{"text":"The breakfast was really nothing different than a waffle house smothered, covered and so o","useful":1,"cool":1},"GKgY_Alat8D44cn40tmIMg":{"text":"Came in on a busy Saturday morning. The waitresses began to argue with the \"hostess\" over ","useful":2,"cool":1},"Y14q_ukQlqEgJcLp_uAAYA":{"text":"The food was edible, the servers polite. I will give them that. \n\nWe arrived a bit after 2","useful":1,"cool":0},"FWRqmHwENYmaNXSAYGM4cw":{"text":"Cool place but nothing that amazing. Long line and long wait for food. Pretty standard din","useful":0,"cool":0},"DtXVJkUir1IiPjZRUYpskg":{"text":"This is another spot I must hit every time I visit in Nola. So delicious and cute and unas","useful":0,"cool":0},"O7CrL8VFH_DQAcHZBLAOEw":{"text":"Love this place! Everytime I come to New Orleans I always return. Their pancakes are good ","useful":0,"cool":0},"BD35Tkomb_7yIOHbMkzsPg":{"text":"Came on a Monday for breakfast.  It was not crowded and was seated right away. Our server ","useful":1,"cool":0},"AT5fzX2fuNJLopkh9nJr9g":{"text":"Great restaurant for a more traditional, bacon & egg/pancake type of breakfast.  They do h","useful":0,"cool":0},"D38QgzrtuLouHqQAXA5Z4g":{"text":"The pancakes were amazing!! Super cute and waiter was so friendly!! We had no wait, and sa","useful":0,"cool":0},"RH1FNn3QZYUxsNob81YmIg":{"text":"I hate being the first person to write a negative review, but our brunch experience here w","useful":1,"cool":1},"Ljg-gFRjxVy9T0dmWzbBAQ":{"text":"Cafe Fleur De Lis you cured my hangover, good job. Think of a diner that serves crawfish i","useful":0,"cool":1},"lrgBX7PoKxtLUWViqvtrkw":{"text":"Amazing seafood Benedict!! Garnish for bloody Mary's were amazing but the mix they make wa","useful":0,"cool":0},"o7bTp4Key6zh96mseKX4Iw":{"text":"Loved it. The staff was great. The grits and breakfast sausage was out of this world. The ","useful":0,"cool":0},"l-R-AMyUUl-8ugy3XT1J6g":{"text":"This is my new FAVORITE breakfast spot. I ordered the Fleur de Lis omelet. It was the best","useful":0,"cool":0},"9Ss7lviHuq6aFA4QCynG5Q":{"text":"Upstairs seating sucks - slow service request downstairs seating  Food was just ok would n","useful":0,"cool":0},"qC6OnATXYnFCdd62_F-9Tw":{"text":"It's a very quaint and cute restaurant but honestly that's about it. I ordered the seafood","useful":0,"cool":0},"NljVZS6NpCsuEViH-is0NQ":{"text":"I had the seafood omlett and was skeptical that it would be worth 12 dollars.\n\nIt was.  Th","useful":0,"cool":0},"XhNfd_AnWbuHm0X8BzaGZQ":{"text":"Friends and I were in town for the weekend and found this place in the French Quarters not","useful":0,"cool":0},"DcFGC0qHTomNltAF7824pw":{"text":"Food took about 45 minutes. Also the order was not correct. Worst part was i got food pois","useful":2,"cool":0},"ktdHAb544oft_zMR4mDfKg":{"text":"My husband and I showed up after 8 a.m. but before 8:30. We were seated right away. The se","useful":0,"cool":0},"_npdGNcpGUqvw5RDSOOO4w":{"text":"Pooh and I had breakfast here this morning. Fast seating, fast service, great meals and a ","useful":0,"cool":0},"hnp3j__5_n-mVp-4H3lM1g":{"text":"It was really good and there was some really good breakfast foods. The coffee was not very","useful":0,"cool":0},"1q8Xr9eHb040B3phV4pM7Q":{"text":"Amazing food!! The yelp save your place in line was great. Such a cute spot with a little ","useful":0,"cool":0},"562Ssw2S06xEFIjgPahF1Q":{"text":"I just don't understand why this place had a long line. We ordered the boudin platter and ","useful":2,"cool":1},"K7UUhSteNCdBIQ2JJqpfmA":{"text":"Awesome service! Food was soo good and their pancakes were really good! My sister ordered ","useful":0,"cool":0},"xY7XmT3ogl_AJ3K-CtD7SA":{"text":"The service attitude is terrible. When we arrived upon our reservation, we were told to wa","useful":0,"cool":0},"d1qzjwl7V2Oo4AkvzHsfpQ":{"text":"Cute French-ish interior, nice and bright. Very clean. Attentive friendly wait staff. Lots","useful":0,"cool":0},"MCm-sfwcFs2KeVw3fy8Iiw":{"text":"Chef should learn how to poach an egg! Service was great  food for the most part was good ","useful":0,"cool":0},"hTmqV66wSgrztlBwUG9mWQ":{"text":"Fabulous eggs Benedict and fried green tomatoes. Also loved that I could be put on the wai","useful":0,"cool":0},"of8Ae6zn3NdsYG4VW6pExA":{"text":"I hate giving bad reviews - particular for this cafe which had friendly service and lovely","useful":0,"cool":0},"Q92d1BpZ25N6u4R_ENf9-g":{"text":"I really want to give this restaurant a better review but I can't justify it. First I'll p","useful":0,"cool":0},"ODSTypD8-VmihscRmG68FA":{"text":"I ordered the seafood benedict plate with cheesy grits. The spicy hollandaise sauce was de","useful":0,"cool":0},"SdQH7QGonxUTCXq19-Dgog":{"text":"had a perfect saturday morning breakfast here. the wait wasn't as long as the ruby slipper","useful":0,"cool":0},"Gd0ZH7DdTUgmlSIujLwS1A":{"text":"Omg that omelette and hashbrowns were awesome!!!!!!   Small place but whatever, it was goo","useful":0,"cool":0},"usuv_ssweXTE5n0k_gz07w":{"text":"Excellent food and service. We were particularly impressed with the pancakes and coffee.","useful":1,"cool":0},"kvstEhmkf6Eid5cB6TZkkA":{"text":"For about 2 years this was my go-to breakfast place. \n\nWhen you go in, you've gotta grab a","useful":1,"cool":0},"4f4xJLjObkWv3-AeYSZHFQ":{"text":"Glad I bookmarked this place.  Just blocks from the hotel, it was a nice easy walk to get ","useful":4,"cool":2},"QV9vP_zon1x-gZeAkJdGeA":{"text":"The sweet tea and chocolate iced coffee were too sweet. The seafood Benedict was delicious","useful":0,"cool":0},"R_4PO2P6vVQtgVprMaTLEA":{"text":"This place is one of the reasons I would  weigh 400 pounds if I lived in New Orleans! The ","useful":0,"cool":0},"ANJ_z5rWO2VSMNKhrsXTdA":{"text":"I can to visit NOLA and we found this place on a whim. I was hoping for the best but it re","useful":0,"cool":0},"pIiavi3SgjGGfkCawMSVmA":{"text":"The restaurant has upstairs seating and downstairs seating. We made the mistake of asking ","useful":0,"cool":0},"-k6PIzJhCF0bGcQX_OAiFw":{"text":"I had breakfast at this restaurant one morning while in New Orleans in November 2010.  I f","useful":0,"cool":1},"JQ_CpFB7eu0aQ1VhSyQXnQ":{"text":"This cafe has yummy breakfast, mimosas and great looking coffee drinks.  Even though the f","useful":0,"cool":0},"wX-Reo2b-pvL45jLiNnNWw":{"text":"My wife and I are upstairs one morning, and  enjoyed the food.  We decided to get takeout ","useful":0,"cool":0},"2gfzkS16YdS4ygdfTfO4sQ":{"text":"Read reviews before we came here and we were skeptical of having a long wait. I guess we c","useful":1,"cool":1},"1ZyhenLFFvHEQeCjVhLyFw":{"text":"Excellent food served in a timely fashion by a helpful staff.  The asparagus and prosciutt","useful":0,"cool":0},"yVPknmMxxsoKL_UohHI_GA":{"text":"Don't come here if you're starving,  because the price: portion ratio is outrageous. But t","useful":1,"cool":0},"LFhNCzwNWG-luNhDp31yCA":{"text":"My husband and I ate breakfast on Tuesday May 8 and about 3 hours later I became violently","useful":1,"cool":0},"02UgRZJwSmMMyRTJxT931w":{"text":"The overall experience was very disappointing. I ordered poached eggs with my brunch and I","useful":0,"cool":0},"s9zjwNht-SO7-c00JLIzcw":{"text":"Service was good. We were able to be on the list through Yelp so that was helpful because ","useful":1,"cool":1},"17abiqbbbBI0ms-fVIARZQ":{"text":"Horrible customer service. We were on the waitlist and when we walked up we were told that","useful":0,"cool":0},"hfMnaf3qmEULPOAB0V19QQ":{"text":"We arrived just before lunchtime in the middle of the week, no line. Opted for a table on ","useful":0,"cool":0},"IozK4jhdHNqtCnNZgYOCbg":{"text":"Not only was the food amazing here, the waitress we had left our entire group happy with t","useful":0,"cool":0},"IfF3WAQrhzggj7vkvPVciA":{"text":"Great breakfast place.  Food and service was impeccable.  Huge portions, everything is del","useful":0,"cool":0},"zl_aVYE2C_MaSmIeBEXTVw":{"text":"My family and I visited this place over a year ago and decided to come back because of the","useful":0,"cool":0},"JUEHQLXqiII7leZl9VvA6A":{"text":"Horrible from start to finish. Our drinks took 20 minutes to come out and not only was my ","useful":0,"cool":0},"NRHA2ZwUTUNcxzoxzTKytw":{"text":"Place was cute, but didn't get food...or drink. Was seated immediately, as restaurant was ","useful":0,"cool":0},"zq72VxulRWu13UybjhxIxg":{"text":"Great breakfasts burrito and the cinnamon pancakes were awesome too. The hash-browns were ","useful":0,"cool":0},"-izQtJrAo_AlfU-SsWNI_w":{"text":"Had an excellent breakfast here today! As locals, we are always hesitant to try somewhere ","useful":0,"cool":0},"c16AF3iWTJUgGUdMJanSYA":{"text":"Absolutely delicious!! I had the oyster Benedict and I can't think of a better combination","useful":0,"cool":0},"2xwo72Tn4tBE_CgtVW_IIw":{"text":"Great food with great service food was hot. Small place but great view in French quarter o","useful":0,"cool":0},"F1-q1HD0CPkjtZYm8MUM5w":{"text":"We didn't have the pleasure of eating here.  The tables as I has discussed with the bus bo","useful":0,"cool":1},"ehplWNiLJR9xhR0SoO6vBQ":{"text":"A funny thing happens if you spend a couple weeks in New Orleans. You start to notice that","useful":0,"cool":1},"x2a12YN1sH-STGP5aeopnQ":{"text":"Met up with friends in the FQ and looked for a place with brunch - this came up as close b","useful":0,"cool":0},"-QjHECUMGk8LBc0IqXF1Vw":{"text":"Fantastic breakfast and great price on big cocktails.  Service is pretty slow so we had to","useful":1,"cool":1},"MFza4k7d7sjFqF1hvNSDkg":{"text":"What you'd expect in the tourist center of the French Quarter:\nLuke warm coffee, over salt","useful":0,"cool":0},"W6ax5RBkH4tpd8JcJdEOXA":{"text":"Stopped in for a quick bite and a sweet tea while walking around. Found they had fried gre","useful":0,"cool":0},"VapxaH8IGpRM2t1A4eqguA":{"text":"Wow! What a gem we found! Who would have thought that a small little cafe breakfast/brunch","useful":0,"cool":0},"fYoIizYm-qe36dVyuvRfhw":{"text":"Husband and I have been eating here every time we come to New Orleans for the last 8 years","useful":0,"cool":0},"KwSiDm_HUG8CvJZitAMfog":{"text":"It's our first time in New Orleans visiting. My family was disappointed with their breakfa","useful":1,"cool":0},"kqk2-2DzUCWR5ah1NbjYTw":{"text":"Average ! Nothing really special about the place, also our waitress isn't too pleasant. I ","useful":0,"cool":0},"9NVNnzfhXqmIwoSJcMOeHQ":{"text":"Food was good, but the service was terrible. I've never felt more uncomfortable while eati","useful":0,"cool":0},"5kXkcXzjwb0RD_Jnh9ad4Q":{"text":"You know you've had an amazing breakfast when you want to go back in the kitchen and hug t","useful":1,"cool":0},"VQIaHWy-V65hUFjxj-1kQw":{"text":"Went to this small restaurant that is hidden right in the French Quarter.  Both the food a","useful":0,"cool":1},"u9Z_zLc3mLk6LjsAZtY7Lw":{"text":"Clean local restaurant with upgrades to standard breakfast fare. It is small, and you will","useful":0,"cool":0},"3HNUnd-WW0CdTfhJQlBVbw":{"text":"The breakfast here is \"okay\" not terrible but not the greatest. I got the Seafood Benedict","useful":0,"cool":0},"56RnOdKcMlAHoKJxXQOHyw":{"text":"Amazing service! I had the Seafood Eggs Benedict which was pretty darn tasty. The homemade","useful":0,"cool":0},"S2iYtxkp5Fr0-s4y3sHkYg":{"text":"A nice breakfast spot in the french quarter. The line was out the door but we were seated ","useful":1,"cool":2},"VtVLoahummrnzXt6CF4bVg":{"text":"Very disappointed.  Called ahead and reserved table for 4.  Arrived after 30 minute walk a","useful":0,"cool":0},"XpRQwhal9LN_Bcaw4ey8_w":{"text":"Amazing pancakes, and eggs Benedict on house made biscuits! Great service and a great expe","useful":0,"cool":0},"F9QUu_2IVyWij7NskHqnpw":{"text":"This is the worst breakfast spot in NOLA! Food bland and greasy omelettes. There's a reaso","useful":0,"cool":0},"EVN9JrHrS3FA2_Ceimi9KA":{"text":"Long wait for a disappointing meal. Asked for Big Easy breakfast with eggs over easy and g","useful":0,"cool":0},"cMAPme0ZnEIwURibdlcl_Q":{"text":"We stopped in for an early Sunday breakfast and had a delicious meal.  My kids enjoyed the","useful":0,"cool":0},"8Z4qmKxlQN4zSo_gWy_M3w":{"text":"This meal was so fantastic. Seafood Benedict, Spinach seafood omelet, and the farmers omel","useful":0,"cool":0},"C-lbS-jJKfSpkE_dfRyklA":{"text":"This spot was our first eating stop in NOLA and it set the bar for everything else. My sea","useful":0,"cool":0},"ncB1HfcTCm3UTBlDS_0ehw":{"text":"Great little place despite the wait.\n\nBourbon street platter is worth double what they cha","useful":0,"cool":0},"Pxn0hbJAJQV0fLkzEfp3kw":{"text":"Best breakfast I've ever had! We got the catfish eggs Benedict. Man oh man!! Definitely wo","useful":0,"cool":0},"E6Ab5kv4rRZy_bsoN1bPNw":{"text":"EVERYTHING about this restaurant was disgusting. First there was a long sting of hair in m","useful":0,"cool":0},"yTX_QBVOpv4fpVjB3WMkag":{"text":"My review only pertains to breakfast, which is the only meal we ate at Cafe Fleur de Lis. ","useful":0,"cool":0},"PSN8AS7LomrWXW-qtLo36w":{"text":"I ate here twice.  There is always a wait to get in however, the wait time isn't long.  Th","useful":0,"cool":0},"AKHHDpHrNi2sM6bapxZXaw":{"text":"The food was really tasty and the service is amazing! Also the prices are reasonable. You ","useful":0,"cool":0},"8-RVsdIzfSYT6L4wWV9Fyw":{"text":"One of the few places that was open on Christmas day, which also meant most people were tr","useful":1,"cool":0},"ursmcpzL1xs-mJu1UWCStg":{"text":"I was hopeful for this place as I liked the charming vibe of the restaurant,  but sadly th","useful":0,"cool":0},"8Fvyhba4JFMjc3MU2DTYSA":{"text":"It was my first time here in New Orleans and I knew I wanted to eat a traditional Southern","useful":5,"cool":3},"BdQMGyVgnZeEcNbtTecqyQ":{"text":"The french toast was great. Bacon bloody Mary was good, should note, it has some spice to ","useful":0,"cool":0},"nujn8q5tIStpPMkA5mcwkg":{"text":"Amazing. The seafood Benedict was to die for and the service was so friendly. Make sure to","useful":0,"cool":0},"wBR5M4xu3k3m6Wd7MeajmA":{"text":"Crowded on a Sunday morning, but wait time for 2 wasn't terrible. The bloody Mary with bac","useful":0,"cool":0},"oJTvdQ5ERgySlInslPp0CA":{"text":"I am very surprised with the good reviews. Haven't tried their food. We came in on day 1 a","useful":1,"cool":0},"8mu0fJcW7pO0IyQZZqoxeQ":{"text":"Had breakfast here my first morning in New Orleans.  I ordered the Big Easy and coffee.  F","useful":0,"cool":0},"bonRWMiEv4KrfuPV5GjXGQ":{"text":"Ate there today with out of town visitors. Ordered bacon crispy but it came soft. It was r","useful":1,"cool":1},"H4jA-Pr60xzqyIlTIi69xg":{"text":"Best breakfast in New Orleans. Good people and service. Will be back again! A little hole ","useful":0,"cool":1},"z0utLZLcfD4Z9dIo8ldCFg":{"text":"Had a great experience, partially because of Claire, who was both personable and attentive","useful":0,"cool":0},"w76kGvAlJDgPMl5o1fRKUw":{"text":"Summary of our experience:\n1. Arrived with a group of 10, asked how long the wait to have ","useful":0,"cool":0},"yf2gaDBRlKY0-4Ae0OIMvw":{"text":"I came here with my sister and friends over Mardi Gras week. We were treated beyond well !","useful":0,"cool":0},"S-NVE1liUzpyZNaHQMlpkQ":{"text":"This was our second trip here--came the same weekend last year and had a much better exper","useful":0,"cool":0},"SCRAGRRf4d8AAFcTHepYgQ":{"text":"Truth be told, I'm not 100% sure that my five star rating is completely warranted because ","useful":0,"cool":0},"dr-npBz-zaW8NLDEwfJjCg":{"text":"The food is so delicious but the service is a little slow. I'd be be back if there weren't","useful":0,"cool":0},"hl1hm227hCkXesbh2d7SRA":{"text":"This our first and last visit here. There was no AC so we ate in the heat with sweat pouri","useful":0,"cool":0},"b8gMl6eUy0M7BUqW1XUaLQ":{"text":"The food was pretty good and our waitress was nice but the hostess at the front had a bad ","useful":0,"cool":0},"lEiTMJUFXdqS4FP-6xqiGg":{"text":"What an adorable little French cafe! It sits in a cozy section of Rue Chartres right acros","useful":1,"cool":1},"JJ8MCg3K-YtxeXShPXNhoQ":{"text":"Wow! Amazing food.... I had the big easy breakfast. It's a lot of food for the price. And ","useful":0,"cool":0},"P-_Swfu502hM79WzckhIgQ":{"text":"Waited 1 hr for our food and it came cold.  The toast came black.  We both agreed it wasn'","useful":0,"cool":0},"VwJKA4uLxZ-Ue1JFjf2pzw":{"text":"Party of four only waited around 10 minutes which was great but we then waited an hour for","useful":3,"cool":0},"V_rmPA_iO-e0xROHt3HWPg":{"text":"Prefer seafood benedict and pancake. Food is okay, service is not good. Servers look so bu","useful":0,"cool":0},"2X1Kb1Tdic6X4Ds3-_HTpQ":{"text":"The best breakfast ever from the coffee to the Fleur de Lis omelet to the seafood Benedict","useful":0,"cool":0},"sMuMqFS4hoE6qGXNPsRX8w":{"text":"I regret that my experience did not live up to my expectations. I ordered the seafood Bene","useful":0,"cool":0},"3dCmfwLP2SUYQ1ob6wWJEQ":{"text":"Had an average breakfast here. Coffee was tasty but $3.25 rather expensive. Ordered the av","useful":0,"cool":0},"fSOuQ15g3ueQ2QKXlOXehw":{"text":"Saw so many raves for the shrimp and grits that I stopped by a couple of days ago for that","useful":1,"cool":0},"9SskIjcbB0eS06X1aZraPg":{"text":"This brunch spot did not disappoint!\n\nMy friend and I opted to have brunch here while a si","useful":1,"cool":0},"qefuZebEV49UZdP2Hu7CPQ":{"text":"This place was awesome! We had the Big Easy\nBreakfast and it was scrumptious!! A great fin","useful":0,"cool":0},"XVynfvPoAvw4ZecTCigwng":{"text":"Best Brunch in NOLA! \n\nI ordered the Oyster Benedict with cheesy hash browns on the side, ","useful":1,"cool":1},"tqK9Tf1B8GhipyOV9VpsLQ":{"text":"Great breakfast and atmosphere. Really liked this place in the early morning. I had the sh","useful":0,"cool":0},"0jBijdCJqx7SxuvRCkcqPg":{"text":"In New Orleans for work. Leaving today and decided to come have breakfast at Cafe Fleur De","useful":0,"cool":0},"VmosleclzPYc6YY_4Z9SxQ":{"text":"My friends and I made the big mistake of selecting Fleur's for a party of 9 on a Sunday mo","useful":1,"cool":0},"P0WF3xDs-j7zsMnDC4G1qg":{"text":"I had an amazing seafood benedict with a biscuit that surprisingly had more flavor than I ","useful":0,"cool":0},"_CSBZRpnvlX84MmgImAygQ":{"text":"Bacon was undercooked, pancakes were raw, hostess was miserable and sat us at the only dir","useful":1,"cool":0},"WLJdlJwkvqa8iiAKv5Si_g":{"text":"Our favorite breakfast spot. Huge portions and a lovely setting.  Breakfast with all the f","useful":0,"cool":0},"u2g0yy9hERr2V9n3Ly-7IQ":{"text":"We were desperately trying to find a breakfast place without a lone out the door when we s","useful":0,"cool":0},"9ELDtkv4yFgLylrEZqtqTA":{"text":"Not a fan. I don't know how they have 4 stars and there is a line out the door. My food wa","useful":0,"cool":0},"3NCNu1ixhZLprui45JQe4Q":{"text":"Great spot for brunch !! If you have a party of 2, ask for balcony seating!\n\nI came in a g","useful":7,"cool":8},"bo9c522TwsNaYKE39EeNXw":{"text":"Every morning I'd check Yelp for the next place to have breakfast at. Breakfast is probabl","useful":5,"cool":3},"fhovrTAK4mAXpIq3e_QJNQ":{"text":"Perfect for a great New Orleans breakfast! Be sure to get the grits! The wait can be a lit","useful":0,"cool":0},"8FACexVK42GYaXoLq4q_5A":{"text":"A cute breakfast/brunch spot in the French Quarter. Came here for my sister's bachelorette","useful":0,"cool":0},"RVtY4t9VEbJmAEibl0e1UQ":{"text":"Amazing banana pecan pancakes and unreal avocado omelet!  Really wanted to go again the ne","useful":0,"cool":0},"e1WIIWtHz_Fgt-7hFRWHEQ":{"text":"Been to New Orleans twice this year and finally I was able to dine here. The day before th","useful":1,"cool":0},"APWkNus6dM6z16ykH02ppg":{"text":"This quaint and cute cafe has some of the best food! I came here for brunch and got the Bi","useful":0,"cool":0},"csrcd5Ceo-naChTL6qw2Wg":{"text":"I was excited of coming here, reviews are really good, but the truth they are not fair eno","useful":0,"cool":0},"ctOdNNuhDEgVe27KS1pu9Q":{"text":"Not a bad choice for brunch in NOLA! We made sure to take note of the wait the morning of ","useful":8,"cool":3},"_30tXJZqVbt2_4fsDyhwvA":{"text":"Only had breakfast here, but it was to die for! Sausage is great, but it's the hashbrowns ","useful":1,"cool":0},"gAU7vD4zOc3eo5EoEMJUsw":{"text":"Delicious seafood Benedict! Wait not bad for Sunday morning. Home feel atmosphere. Would r","useful":0,"cool":0},"bP8zV2Eif11uFrNQNYd8gQ":{"text":"A friend suggested that we come here for breakfast and we were not disappointed! We only h","useful":1,"cool":0},"0nmtlhPjM1alumJH1EiMuQ":{"text":"Absolutely phenomenal!! Highly recommend for breakfast. They have breakfast till they clos","useful":0,"cool":0},"skWSyIaXrVqVibJRyGnMnQ":{"text":"Not the place for breakfast. I work close to Fleur De Lis and really want to like it but I","useful":0,"cool":0},"Rb337rRJdM-6PP-YEzzBzw":{"text":"They have three types of Bloody Marys: shrimp, crawfish, and regular.\n\nThe food's good.\n\nT","useful":0,"cool":0},"e6pQshUEgnNBSXnpMaUfTw":{"text":"The \"wait list\" you get on line is not honored. The host are curt and immediately confront","useful":1,"cool":0},"oat35_MZKAzUGBs0UrKzbA":{"text":"I recommend this place! Exactly what I was looking for; drinks and sweet and savory brunch","useful":0,"cool":0},"yBSkc2O3BofXk6zr26UABQ":{"text":"This place is casual and great!! Come for breakfast, they have so many options to please a","useful":0,"cool":0},"WgroGYqyyzgZmMTOFXQ6nw":{"text":"Went here based upon the Yelp reviews, and had a decent experience. The biggest negative w","useful":0,"cool":0},"jAglvd25A6REsJ6MC7cTIg":{"text":"This is a great spot.  We split an asparagus and cheese omelet.  Everything was fresh and ","useful":0,"cool":0},"4xm4Lg1t7Yz9HTg9wI0R1A":{"text":"This place was so good!!! Highly recommended. It was in the heart of the French quarter ab","useful":0,"cool":0},"8qq8QkBUt2hMQmrY6LSYnA":{"text":"Where to go for breakfast in New Orleans?  Quick click on Google for \"the best breakfasts ","useful":0,"cool":0},"UstKkvw8W7EH4ZWiE-sWkg":{"text":"We were able to dine upstairs on the balcony overlooking Chartres St.  Could not decide on","useful":0,"cool":0},"7ude9U7x6-v2kQCYRx-Q7g":{"text":"After waiting in the hot sun with a party of seven for 45 minutes. We go upstairs to the 2","useful":0,"cool":0},"01HErCEWW6NEpF3UYltDmA":{"text":"This place felt like home. Great friendly staff, comfy bright seating areas, space enough ","useful":1,"cool":1},"cpjkBdPmdE-fJMnk5pc15g":{"text":"Horrible customer service. We were on the waitlist and when we walked up we were told that","useful":0,"cool":0},"bB36rff_09ScDXpWkFc0tA":{"text":"First we had to wait 40 minutes, even though Nowait said 0 mins. So it seems nowait doesn'","useful":0,"cool":0},"ga_Rff8iOkqDMvLtua1NcQ":{"text":"Had such an amazing experience! The team and the food were so dope. During my week stay I ","useful":0,"cool":0},"7n2ho_eOb4apuSwxWRRMUQ":{"text":"This place is right across from the French Market. Very pretty inside, but clearly a touri","useful":0,"cool":0},"ORJwRHS6Wvo4HjBQnRkSmQ":{"text":"Found this place using Yelp. Great relaxing breakfast with lots of options. I had an omele","useful":0,"cool":0},"6Fn1umoghRRQO0-ToY_cyA":{"text":"This has been the absolute worst dinning experience I have been in New Orleans.  The cook ","useful":0,"cool":0},"ysWcuCM0vIV1ptz689eY2w":{"text":"Wifey & I split a muffuletta that was terrific! Fries weren't all that crispy, but well se","useful":0,"cool":0},"fR6Y3qTUhRjoqeJLpTKNmQ":{"text":"A bustling breakfast/lunch spot in a swankier part of the Quarter. There are elegant, even","useful":0,"cool":0},"NDM6fQ6rRIj68hyIhBbqMA":{"text":"We had a wonderful breakfast here in the quarter! All of the omelettes were delicious! Gri","useful":0,"cool":0},"_Et1UvHf2fKp6HdkOvM4xw":{"text":"Food was okay at best. Very very bland. Coffee cups were filthy. But our waiter was absolu","useful":0,"cool":0},"_T964CA9_pp-rty8-FXdQg":{"text":"Busy as advertised.  You order at the counter then sit down and they deliver the food to y","useful":0,"cool":0},"S0H1fTU0kXO7vMWHy6aURg":{"text":"Fun small spot in the French quarter. The croissant sandwich was great, my hashbrowns were","useful":0,"cool":0},"rJNAERa27TQb13p6g0pI6w":{"text":"Egg Florentine did not have poached runny eggs as I believe they should. The eggs were ove","useful":0,"cool":0},"qnO_cDjq5El8EkuxubAMWA":{"text":"The hostess was friendly. We arrived about 11 on a Sunday. Had about a 10 minute wait. The","useful":0,"cool":0},"hT6Fq_pkMaIYniWmCHe3mg":{"text":"What a hidden gem! This is your daily stop for breakfast, lunch, dinner or inbetween. Auth","useful":0,"cool":0},"T2BJ9tvYLntNGJc4Qsigcw":{"text":"Decent place to get a decent breakfast. Nothing to complain about at all, just don't expec","useful":0,"cool":0},"LWav5D9pzfG8IFRG_XaewQ":{"text":"Not worth it at all. Service was subpar, tables are so small that it barely fits the plate","useful":0,"cool":0},"GVOQpaOVE8mmpifBsHYzuA":{"text":"Way too overhyped. \nMy oatmeal accidentally had eggs in it. How does that happen? \nThe cof","useful":1,"cool":0},"-YfTgVadn1ghY_yLY7vYPQ":{"text":"One of my favorite breakfasts in the Quarter, consistently good each time I visit. This ti","useful":0,"cool":0},"tA3cRQfeYkD2_8KpaO_I-A":{"text":"Visited over the past weekend and LOVED the place. Staff were pleasant, didn't wait at all","useful":0,"cool":1},"wUU27vWMgzv9WRIyP7y43w":{"text":"Food is fresh and delicious, atmosphere is clean and inviting, and the staff is friendly a","useful":0,"cool":0},"DwJCTNLvZaVvIpvSNQ16AA":{"text":"First time in NoLa, woke up hung over after parading in Krewe Delusion looking for somethi","useful":0,"cool":0},"yyC_IrbLbphgr-fmH8L4rQ":{"text":"I found a little piece of heaven here on earth at Cafe Fleur De Lis. I was a bit leary whe","useful":1,"cool":1},"zI6FHeLkRlrbQ1c5R-I2eQ":{"text":"I had breakfast here yesterday morning and left my credit card here! I called Visa custome","useful":0,"cool":0},"u63klEwmOP5U6NFv5GYxFQ":{"text":"First let me say this is New Orleans where the parties are 24/7, but today was Mothers Day","useful":0,"cool":0},"3geOZgT5jtUMfUcoC0yqIw":{"text":"Awesome view. The sign in wait-list worked well. Food was great. Didnt give 5 stars just b","useful":0,"cool":0},"pPMsbtItWirIhBaqsBeeXg":{"text":"After searching for a breakfast spot we ended up stopping here and was extremely disappoin","useful":0,"cool":0},"itRhI7L-XLqvBV5E9Xs-hA":{"text":"This place was so warm and welcoming. It's easy to miss if you're not looking for it. The ","useful":0,"cool":0},"5bOImDpG3aqU0xLnFCwAFg":{"text":"They give you a lot sides with most of the dishes I checked out on the menu. I ordered an ","useful":0,"cool":0},"MkC8vaoA88d9_An7iYNRNA":{"text":"Came here for breakfast. Really enjoyed the seafood Benedict although the biscuit was some","useful":0,"cool":0},"TOpOKrHYykfPE0VMpzQD-A":{"text":"Went with my 3 friends for breakfast prior another friend's wedding. The wait sucked which","useful":0,"cool":0},"jFUP5wtap4jezA0mwW1hFg":{"text":"We always eat breakfast every day at Cafe Fleur De Lis when we are in New Orleans.","useful":0,"cool":0},"4F015ac6q_51GG_0_d7VYw":{"text":"Do not make the mistake of going here. Especially If you are hungover, expecting good serv","useful":0,"cool":0},"QMMDTXZMMXorl9l2NVk2pQ":{"text":"MUST drop in and order the spiked watermelon lemonade!! Best debit ever! I even stopped in","useful":0,"cool":0},"VkI76qEQnxIyPt9HJ0nvDA":{"text":"This is a horrible restaurant with horrible service. We only had 4 people and it took an h","useful":0,"cool":0},"yd4PxBck9WnoyB1-eo6FKQ":{"text":"Great place to grab a breakfast.  Big servings of what you need to cure a hangover.  You o","useful":0,"cool":0},"mQMe2oIWqjHpuOxWGT8BsQ":{"text":"Great brunch food. Make sure you get the Fleur De Lis omelet- my husband had it and it was","useful":0,"cool":0},"8lqeHPUJdzcW68KFzMgNlw":{"text":"Great food. Excellent service (Brittany ) Best Bloody Mary ever!! Bacon vodka made it!! Go","useful":0,"cool":0},"Kw8bC4_O7E5s5YbUpInSAw":{"text":"I had the porkchop, 2 egg and toast breakfast with hashbrowns and it was one of the best b","useful":3,"cool":2},"pexxDbeSYuXyg1QnxQhojw":{"text":"My husband and I came here for breakfast on our last day in NOLA. WE LOVED IT. I definitel","useful":0,"cool":0},"VOZIBuiYX4cPJqxIkYq0iA":{"text":"It took an hour to get our food and the server was completely disengaged. We had to get up","useful":1,"cool":0},"w9WLHDO86HMzNf2MGTS4Yw":{"text":"We went for breakfast on our last day in New Orleans because we had walked by a couple tim","useful":0,"cool":0},"Y1hHb--gOCIku2QW8-EWCQ":{"text":"We loved our breakfast here! We came early so it wasn't super busy and the service was exc","useful":0,"cool":0},"JBQntQVQSbYFq9a_PR5moQ":{"text":"Yummy!!  Really delicious food  and we enjoyed our meal so much.  We ordered two meals and","useful":0,"cool":0},"wvzlIpa6I4zsU3S9wXJNoQ":{"text":"Great breakfast. This is the second time we come here for breakfast and it has been amazin","useful":1,"cool":0},"LMDAmZY7uwD6l_n99kl6TQ":{"text":"Out first full day had to start off with a hearty breakfast since we were going to be doin","useful":2,"cool":1},"R1XlV152T0HUGEl3fDN_rA":{"text":"I was looking for a good breakfast place and I was glad to have found this dime.\n\nI ordere","useful":0,"cool":0},"BgYN75zMS6BlfrPPa0-BSw":{"text":"We found this little breakfast spot right around the corner from our hotel.  It was rated ","useful":2,"cool":1},"V5Uyufn3potG9Z8eqxr76A":{"text":"What one large disappointment and previous yelpers definitely got this place wrong. My bro","useful":3,"cool":0},"MFpFbGLeCDjjpsvS2so2sg":{"text":"The best coffee in NOLA...unpretentious, friendly and wonderful. So glad to give these won","useful":0,"cool":0},"s5z1T4qiMRSuW8v7JgxAfA":{"text":"This is a so so place. For someone who has been to a ton of brunch places around the world","useful":0,"cool":0},"UyCRJwdQy7iQjsKe40I_vw":{"text":"Happened upon this place by chance. Asked what's good here. Seafood Benedict did not disap","useful":0,"cool":0},"TozzHPgCj0iLyzfE5WM8Qw":{"text":"Got on the waitlist to have breakfast. Our server was nice, I really wanted to like this p","useful":0,"cool":0},"vlyyuRxRL5-voej3rdIIpA":{"text":"The prior reviews left me feeling like maybe the regular chef was sick on the day I visite","useful":0,"cool":0},"Hd03tduKVviPe-NNR15fIQ":{"text":"Some dishes are good, but overall this place is very dirty. Sticky tables, disgusting rest","useful":0,"cool":0},"KyankU9_M1LPj1b5zwSzMg":{"text":"We were staying around the corner at the Monteleone.  We weren't dressed for Brennan's, so","useful":0,"cool":0},"lXJkPNzNqeM2VnBxJDczfg":{"text":"Had brunch at this quaint French Quarter cafe. First off, it's just dope cause of the loca","useful":0,"cool":0},"0SJxMOtF_1oXXvt6yEbO7g":{"text":"The hurricanes here are no joke! One will definitely do you good and two is a whole other ","useful":1,"cool":1},"5ux79e2bq-m8Kbosh_Ud2A":{"text":"This restaurant was... ok. Know that the noise level is very high. If you're planning to h","useful":0,"cool":0},"55EVcwsaOw_yrV-7r6aTXg":{"text":"Great hash browns, delicious chocolate chip pancakes, friendly staff.  Coffee could use so","useful":0,"cool":0},"L4_VdSCqlbER8-YShkiW3Q":{"text":"FOOD:\nExtremely bad.\nFrench toast: not properly cooked, the bread was thick tasteless. It ","useful":0,"cool":0},"22jprr1ooiXGN1ZnlHLDeQ":{"text":"Our wait was 55 min not the 30 we were told.  Our wait for food was 48 minutes and the wai","useful":0,"cool":0},"95zlNUqgYJ2PpBCJwGGOUQ":{"text":"One of the best sit down brunch places! \nAMAAAZING FRENCH TOAST. \nThe kitchen here are all","useful":0,"cool":0},"EolvASoymHddMdMYKg1Grg":{"text":"Awesome spot in the French Quarter. We had breakfast here and was quite satisfied. It is a","useful":1,"cool":0},"UAG_Lw29wn8W_K8Alfe46Q":{"text":"Eh, I love me some breakfast food and this place got some decent reviews and since we were","useful":1,"cool":0},"IXT0XgixE7pE2uEyUhRlOg":{"text":"Went for a weekday breakfast. Service was slow. Ordered two fried eggs, ham, with hash bro","useful":0,"cool":0},"95jF6GDSB48-lewT5fb8tw":{"text":"I had the serious southern breakfast. It was amazing but you definitely have to be hungry ","useful":0,"cool":0},"--jNDYwR0Pj4mMNih1TwLw":{"text":"This place was excellent. The service was stellar and the food was fresh and delicious. I ","useful":2,"cool":0},"ScZ0y80Hocixpp1SWOpJEQ":{"text":"Service was good and fast here. I sipped on a delicious chocolate flavored iced mocha, and","useful":0,"cool":0},"4UyrmQJYvMPxcRwlw0W2QA":{"text":"We were in desperate need of a legitimate breakfast. Neither of us had slept, and we were ","useful":1,"cool":0},"d_XI6C-ihvl57Il5vqksmA":{"text":"Went again today. Lots of people, service a little slow but amazing customer service and f","useful":1,"cool":0},"pAFEKi1Tgsq3CAvvrWJXXw":{"text":"Um, 5 stars and here's why:\nCustomer service: promptly greeted, my party and I were told g","useful":4,"cool":0},"DUCIDlmkLAle0FGbdRYeSw":{"text":"I'm being generous with 1 star...\nHorrible restaurant...horrible hostess with the long bra","useful":1,"cool":0},"z93xtraGUDMXHs1-6YwB7Q":{"text":"The french toast was delicious. The \"avacado\" omelet has 3 little slices of avocado so the","useful":0,"cool":0},"KtS24jz-h_L2WomjtFiQYA":{"text":"We found this little place for breakfast. We had traditional New Orleans fare including gr","useful":1,"cool":1},"EKjajqPanWZg_Ox2wgT9uQ":{"text":"Let's talk about GREAT pancakes! This place is a must eat NOLA breakfast joint. Everything","useful":0,"cool":0},"Jo46o0vmzur4OyW7ysk5rA":{"text":"Best Breakfast I've ever had PERIOD, I'm from NYC where we have great brunch all over but ","useful":0,"cool":0},"xRQAIlwPgnWAZ2FK0RevfQ":{"text":"Beautiful 2nd floor cafe view of New Orleans with the best breakfast in town. I recommend ","useful":0,"cool":0},"2S6IKy-U6AibouI1FrvZ5A":{"text":"i never write reviews and not one of those yelpers that likes to destroy someone's busines","useful":0,"cool":0},"bpcfOk9CyftbXx2oVWTqtg":{"text":"We absolutely loved the food here. We came for breakfast and although busy, it didn't take","useful":1,"cool":1},"e4ZKCLx9h5lZNvp6aknxeA":{"text":"Had a brunch at Fleur de Lis. \nThe decor is awesome , we were seated upstairs , I love the","useful":0,"cool":0},"o-EhWDiVUMFFLoNwHpugyA":{"text":"Get the seafood benedict!! One of the best things I have eaten while in NOLA even with one","useful":0,"cool":0},"kt6T28PlYF09FNd8NJujmQ":{"text":"Its a really good place to grab some breakfast and enjoy the atmosphere.  \nFood has always","useful":0,"cool":0},"L2WkPACymcd5W0oNCku15Q":{"text":"Absolutely wonderful breakfast. My husband had a fresh avocado omelet. Perfect. I had the ","useful":0,"cool":0},"5TXkhSkfzZCh_dTEoJZGQA":{"text":"We walked up with no wait. They told us that they needed 10min to set-up our table for 6 p","useful":0,"cool":0},"LdUR-McHsazYC8NOxGy6Vw":{"text":"Disappointing.  We came early. Plenty of room downstairs but they put us upstairs in the b","useful":0,"cool":0},"j7QyT9j5th9jjW08QxnYPQ":{"text":"Amazing breakfast , best shrimp and grits i ever had. Oyster eggs Benedict were delicious,","useful":0,"cool":0},"pWQnLm5RBUZkWwLVYEv2zQ":{"text":"Fantastic breakfast. Avocado omelette is amazing!  Small but moves quickly. Friendly staff","useful":0,"cool":0},"WWdLWdScFstyiMxA2Nmt4w":{"text":"Must have breakfast joint in NOLA!!!!  Oyster Benedict is a \"die for dish\".   Worth the wa","useful":0,"cool":0},"g9lcCa7xISX99ouVZUGZJg":{"text":"amazing!! super hardworking staff and the oyster benedict is to die for (french toast was ","useful":0,"cool":0},"W0DIAJ2OFjhgzikd3S__Hw":{"text":"Wow, what a let down! The hostess was either hungover or about as enthusiastic as a dead c","useful":1,"cool":0},"63NZ_yA4K0-KxccWcTsPjQ":{"text":"Delicious place in NOLA! The cheese grits are my fav!! The southern breakfast was deliciou","useful":0,"cool":0},"T5fwwrsROKew_UR-bEf5Ng":{"text":"This was a WONDERFUL experience.  Our waitress Ashley was extremely attentive, prompt and ","useful":0,"cool":0},"_yyOxjmePoVNd4fUH3BwLw":{"text":"I wanted to like this place so bad, but I can't :(\nOur service was sub par. You can't do s","useful":0,"cool":0},"avILJbthlYet_N178gON4A":{"text":"Best breakfast spot in New Orleans. \nGreat food, great service. Family friendly as well.","useful":1,"cool":0},"DMs-9SRQkimuWhtvru4JOg":{"text":"Breakfast was delish! Coffee was great, bacon eggs toast.. everything! You must arrive bef","useful":0,"cool":0},"dsFO9kiDnr5mzbYSizPkCQ":{"text":"By far a great place for breakfast!!!! We had a party of 6 and arrived a little late since","useful":0,"cool":0},"Bqxg59mjdwu2E6s-eIsIfg":{"text":"Parking is very difficult but was worth the private parking .   Great service and location","useful":0,"cool":0},"iepkedN3RJ-9Tt77e59kZQ":{"text":"My friend and I walked in requested we sat upstairs and we were turned down by the host wi","useful":0,"cool":0},"ihET_j4q5dl4uvnzRfc0qw":{"text":"One of the better breakfast's I had in the french quarter.  You order at the counter and t","useful":0,"cool":0},"h4vhz2LzdkBRuVJw2t0BqQ":{"text":"The food had good flavor. Poached eggs on eggs Benedict were over done but our server made","useful":0,"cool":1},"Uo9Y7I_Qn-0leNm6UAWmDg":{"text":"I think I'm too used to the delicious LA brunch scene that this just did not live up to my","useful":0,"cool":0},"Qlw8Ro-ZVHPhQG5w-h9B7Q":{"text":"This place is great! The service is wonderful, the staff is very friendly and kind; and th","useful":1,"cool":0},"d1oNcwiUCWAqU2Cd4XoviQ":{"text":"We've been sitting here waiting for our order to be taken for nearly 30 minutes with zero ","useful":0,"cool":0},"TwvdGNOQJMoI_bVZ-SNVWg":{"text":"I ate here Mardi Gras morning, everywhere was pretty busy and we were expecting a wait. We","useful":0,"cool":0},"xX326ZuG4OhG9c119tjNdA":{"text":"Such a cute and delicious place to start your day in NOLA! We got seated right away (they ","useful":0,"cool":0},"cnWIrFQZD12WOobnC_04mA":{"text":"Came by a happy accident. The food and service was very good. It was very crowded and ther","useful":0,"cool":0},"r9VC4f3Y4qJd5R-voGhJVA":{"text":"Food was awesome! Lattes weren't hot at all, but tasted good. We went on a Tuesday morning","useful":0,"cool":0},"wZAZfhU7sl_cdRfZpPnbVw":{"text":"I had the fleur de lis omelette. Wowww that was the best omelette I have had in New Orlean","useful":0,"cool":0},"59lMGRmNaN9kjEnmT22mRg":{"text":"small spot, so there is usually a wait.  also it gets warm quickly when the restaurant is ","useful":0,"cool":0},"W3U-LNFYRju7bqYi_vr-7Q":{"text":"Just had brunch here and it was really great! I had the fried oysters Benedict and did not","useful":0,"cool":0},"LaJHNBU1esx87XlPNm99qw":{"text":"I had high expectations about this place. We arrived at 7:30 am on a Sunday morning, was n","useful":0,"cool":0},"fVp6BNA243f4F4aShxKleg":{"text":"The Fleur de lis omelette was incredible! The banana walnut pancake was perfect too. Loved","useful":0,"cool":0},"5ATZMjfof2Tz_NIf2k-meg":{"text":"We were seated within 20 minutes. They use a text/yelp system to let you know where you ar","useful":0,"cool":0},"YMSlWOeAmi62raV75YNWXA":{"text":"The breakfast here is good. I enjoyed my omelette and toast. My omelette was light and flu","useful":1,"cool":2},"G2VBzrhZ6CpRLZhjK0gjFg":{"text":"We stopped here for a snack. They have a very nice ambience. We ordered a side of grits an","useful":0,"cool":0},"caS7zg1-12EgSRfKNkxl1g":{"text":"Loved this place! Our waitress was so kind and really cares about our experience. The chai","useful":0,"cool":0},"4-7ypPr-rmoY28nNleqzGw":{"text":"Best breakfast spot in New Orleans!! The Benedict was to die for. We enjoyed sitting upsta","useful":0,"cool":0},"pDhQzgWESbaOY9ECvIfg0g":{"text":"A small and quaint little breakfast/lunch diner.  My friend and I actually stumbled in aft","useful":0,"cool":0},"LVd-7BRNmsIgQJGEoOxYuA":{"text":"wait staff was less than friendly or effusive but the food was pretty good. not a place i'","useful":0,"cool":0},"GUDvxHy97GLpCENYBsZtTQ":{"text":"Found this little gem on Yelp and I'm so happy this was our first breakfast in Nola. Order","useful":0,"cool":0},"JKQz3ETKoZdU04GT3C2ZVQ":{"text":"I've been to this breakfast spot both times I have visited New Orleans. I remembered it fr","useful":1,"cool":0},"1_DYz-m9NEAiGhVQTOgnUA":{"text":"We waited, and after the wait we learned it was a good idea to wait. The food is delicious","useful":1,"cool":1},"pAV-vpzDT6X_LxuyRj6TBg":{"text":"Food was average. There's was nothing that made it super good or super bad. Service was av","useful":0,"cool":0},"g-Ly1EUSFW52YRB7ZBBYmQ":{"text":"Great food and waitress but the women handling the seating were inept and accidentally too","useful":0,"cool":0},"5VwkdC-ykz67EUhSRhZ4FA":{"text":"Food was ok, but our waitress got a nasty attitude when we saw she messed up one of our or","useful":0,"cool":0},"FIaDqMq8mTgoxzeuS7TvWA":{"text":"Very cool place in the quarter. If you arrive early or wait for a spot you can have breakf","useful":0,"cool":0},"hG4anFlhmwjej1HWOv65kQ":{"text":"If I could rate lower I promise you I would. I have never gone to a place where the staff ","useful":0,"cool":0},"tUg-Ket1k7zZ-PQWc_BL2w":{"text":"I had the pancakes with bananas and pecans - SO delicious. He had the French toast and it ","useful":0,"cool":0},"MsgDwD9scYa6DhzGibbUew":{"text":"This place is highly rated but all bets were off when I found hair in my food.  Like oh he","useful":1,"cool":0},"r4Fq1LWKgdVJH4xlkhTHag":{"text":"Ordered eggs florentine and my eggs had like 3 spinach leaves, bread was stale too. All of","useful":0,"cool":0},"d3w-tps8dW7779LIjsGg0g":{"text":"This place was recommended for breakfast by another place last night. They weren't wrong. ","useful":0,"cool":0},"vpUVAkO0kwYUrB2zIPrZVw":{"text":"Food was fantastic for our first meal in New Orleans. The Po'Boy was filling and the Jamba","useful":0,"cool":0},"IG4ZZfBKx5z0dcGy_BDT_w":{"text":"I put one star because the host was rude and unreasonable. He told us it's hour and 45 min","useful":0,"cool":0},"z8Na2BTGr34Vo_lzc3q_uA":{"text":"Stopped in to grab a sandwich to go. Got to my hotel and my chicken sandwich was missing t","useful":0,"cool":0},"-sTRPNEApO9uPmIM2h-bWg":{"text":"Cute atmosphere, great music, and fantastic food/service. I got the sweet potato eggs Bene","useful":0,"cool":1},"JRgehj4C41BgG107cq7tSA":{"text":"Out of all the wonderful places we ate this was my favorite. We hit this for brunch before","useful":0,"cool":0},"kyGBKT8I-MCnNZK9eqsxnA":{"text":"Food would be good if it didn't arrive cold like left overs almost! Shrimp and gritz was o","useful":1,"cool":0},"6kmiNtZ4BAORyx89R-3_nQ":{"text":"The service was great but the food is nasty. Super salty and just gross overall. Sounded w","useful":0,"cool":0},"ccq1JwB6g5xW4WPRiNyGXA":{"text":"So after our disappointment at another restaurant that couldn't bother to even open, we we","useful":0,"cool":0},"vbddCNLC3KkwtNCWl9flrQ":{"text":"The \"crab catch\" omelette  is the best omelette I've ever had in my entire life.\n\nCrab\nShr","useful":0,"cool":0},"7R-9tVJcHnd7aXGrQhVEUQ":{"text":"Bomb. We had the shrimp and grits and a shrimp po'boy. Very authentic and delicious. Comin","useful":0,"cool":0},"10lzYU53eCRE5lvd7RWpoA":{"text":"This is a quaint little restaurant with beautiful decor. I loved that they had a separate ","useful":0,"cool":0},"FlEy14YXYEdfsB0OOj89rg":{"text":"Joe is an excellent server!! The bacon bloody Mary hands down best bloddy Mary I've had. g","useful":0,"cool":0},"naxNjyBFVXDxJZNHIulCIg":{"text":"Great food and service! Delicious seafood Benedict and banana pancakes. Bell,  our waitres","useful":0,"cool":0},"SoG49f7XhE6GavcEHIwXkw":{"text":"I too became violently ill about 4 hours after eating here. I've enjoyed this restaurant i","useful":3,"cool":0},"HdhBUVHByjw8hhxRWXvSEQ":{"text":"So cute! Delicious food. The seafood platter was great, as was the peach mimosa. The juice","useful":0,"cool":0},"xBkj_hWqiWKUNmvrkQGKBg":{"text":"Price was good, food was good, wait time was around 15min average. I wish my pleased with ","useful":0,"cool":0},"gFLjb7Qkd1sah9sM0glU7A":{"text":"Excellent breakfast! Super friendly staff. Best grits and thickest slices of bacon I've ev","useful":0,"cool":0},"p3qAvuJr6eLz-d9h_NbaBw":{"text":"Omg this place is good! Came on a Sunday and there was street parking available which can ","useful":1,"cool":1},"XAwcsxnJVLThWRhmcnsnrQ":{"text":"This place is really small in size, waitress was wonderful but the hostess (taye) is somet","useful":0,"cool":0},"AEzPCb1BRwbsUJPjSA9uZQ":{"text":"We stumbled across this place while looking for a more substantial breakfast after splitti","useful":0,"cool":0},"OF33g80cnFFTGDM_YXVO0w":{"text":"Walked in off the street on a Sunday morning.   Great service and great coffee.   The food","useful":0,"cool":0},"SE0qyNDZGp7sr0WkwsWnIg":{"text":"Great little brunch spot in the French Quarter. The waitstaff was friendly quick. The buil","useful":0,"cool":0},"yCnWlZ7P-o3aP6fyigvWQA":{"text":"Great brunch spot in the FQ - the online waitlist is extremely helpful and allows you to w","useful":0,"cool":0},"wTyVnS0DseQxfXCtk3L3BQ":{"text":"We had a very nice breakfast at Cafe Fleur De Lis.  We decided to take a walk one morning ","useful":0,"cool":0},"LPCf0x9_k--uDUuHeWKa5Q":{"text":"Wonderful cafe.\nIt's fresh it's filling \nJust sorry I found it late in our trip\nIt's is in","useful":0,"cool":0},"oZ_4FzLKUiTrf4cSgFTnSA":{"text":"AMAZING FOOD & SERVICE! The hostess was very kind, full of energy, and a sprinkle of comed","useful":2,"cool":1},"T_r478m2Ilga9NVB7tSWjg":{"text":"Great food, great location, great service! Always busy so plan for a wait, but totally wor","useful":0,"cool":0},"K0YFB97ZiSTPrPRRSn1g4Q":{"text":"The worst place we ate at in New Orleans. The staff was rude and unprofessional. I asked f","useful":0,"cool":0},"29L8wlGLM-s3rwDWM-CsuQ":{"text":"Great service, excellent food!! We had a late breakfast but will be back one day for lunch","useful":0,"cool":1},"e3jIEepMDRjPTeIVJIqa-g":{"text":"Great cafe for breakfast or brunch. Once we ordered, the food was quick. The hostess had a","useful":0,"cool":0},"OHlGdm7uRGhoZZYc1CY3UA":{"text":"Serendipity brought me here the first time on the wings of an angel in the shape of an Ube","useful":1,"cool":1},"9k93bXKC9MET3qU6GNXP9A":{"text":"Food really sucked here. Came for breakfast and ordered seafood Benedict. The portion was ","useful":0,"cool":0},"M-88u1Mxj2Jhr7Da597qNQ":{"text":"Love this quaint restaurant. Small, but food and service are great! Bloody Mary's and mimo","useful":0,"cool":0},"PRq8UTty2tyJZyDmLosa-Q":{"text":"Great service, good (strong) coffee, and perfect shrimp and grits. Super friendly staff an","useful":0,"cool":0},"8Rg94ucaz2-ctfjgWw6LbA":{"text":"This was the only breakfast place that didn't have a massive line outside the door. The ma","useful":2,"cool":0},"lVKIPNsgQv44u3l6HTdzaw":{"text":"We went to this place based off of Yelp reviews. It was busy, which seemed like a great si","useful":1,"cool":0},"7orKCiMRr9iwewt3E2FxsA":{"text":"The brunch was delicious.  The seafood  benedict was frsh and flavorful. Two people in my ","useful":0,"cool":0},"IyoGKn8ubYWB9HYDcPX02A":{"text":"Lovely place for breakfast, friendly staff and great food!  My wife had grits wit 2 eggs a","useful":0,"cool":0},"JMbrtcNh_jDzklCRbdLlXA":{"text":"Overrated. Came for breakfast. Took forever to get our food but didn't seem that busy. Slo","useful":0,"cool":0},"MrwePJuUfnRkBEvQQTfQTA":{"text":"This place was sooooo incredibly good.. I had the Oyster Benedict, omg.... it came with th","useful":0,"cool":0},"n-2PtoSkUwZIKER6b_gkiQ":{"text":"I'm so sad to say this, because the setting is cute and the service was so sweet, but this","useful":2,"cool":0},"0p8Ua6EN9mF_jQj1fir0jg":{"text":"OMG. As a vegetarian, I often eat eggs Florentine when I go out for breakfast. Cafe Fleur ","useful":0,"cool":0},"7P-DSlypdTCg78NlcS1WhA":{"text":"Just okay, nothing special. Had a really salty crawfish étouffée and a decent seafood gumb","useful":0,"cool":0},"BSNDLymwvUjeNvW52UQydA":{"text":"Great place for brunch and they have amazing shrimp and grits. Tip: use the wait in line a","useful":0,"cool":0},"iztDLa4HDWYGqICfClFidA":{"text":"Long line and good reviews made us curious about this place. We didn't have to wait long a","useful":1,"cool":0},"1DAaIJC-bAUSouqlZpnuaA":{"text":"Excellent Eggs Benedict, friendly staff, no pretense. We visited at one of the coldest day","useful":0,"cool":0},"qe-7VwtX5nd4xANYBtf1aA":{"text":"I was amazed by every dish and so was my entire party. This is real home town momma in the","useful":1,"cool":1},"kIFdeFsabACo6g5HfY0mXQ":{"text":"My go to place for breakfast food was great as always, Only Marred by the Host Shane who w","useful":0,"cool":0},"90n3LfNdKSKAFEmexZAs_A":{"text":"No Yelp check in option, instead you wait in line to put your name on a list.  You give th","useful":4,"cool":0},"e7nYIjFMI1K0-4Qh9ca0rQ":{"text":"What a hidden gem. This place is awesome. The Bloody Mary was fantastic and the omelette w","useful":0,"cool":0},"1PcDsNfD2hJvH6GXqm5O9Q":{"text":"I wanted to love this place. They have Bloody Mary's and Oysters Benedict, but I was under","useful":0,"cool":0},"wSz0eJvuuv7knBydifeaXg":{"text":"Horrible experience, very disappointing. Waited about an hour after ordering to be served,","useful":1,"cool":0},"aifSY0ON9_laxEL6ZQpH0A":{"text":"My friends and I came and the food was great for the most part EXCEPT my buddy's eggs bene","useful":0,"cool":0},"YPLlx54xFFRPPs0bs40feQ":{"text":"Had a great breakfast here. The coffee, mimosas, cheesy grits and eggs Benedict with catfi","useful":0,"cool":0},"89MRptJJ0rpfJzzLPD8RmQ":{"text":"This place was delicious!! I got the creole breakfast which came with eggs, smoked boudin,","useful":1,"cool":2},"EQaR3Si1N7donakeVfQppQ":{"text":"Get the FRENCH TOAST! \nThe fluffiest wet delisiso french toast.\n\nSmall cute quaint little ","useful":1,"cool":0},"me20iUD9phSUdW7IY9zfSA":{"text":"We've been sitting here waiting for our order to be taken for nearly 30 minutes with zero ","useful":0,"cool":0},"Gh94djtNqXQ-Eb5LqylFww":{"text":"Found this place during a rushed search for brunch and I'm so glad I did. Cafe Fleur was a","useful":6,"cool":5},"0j0G61onFAR1Xe4c_fSypg":{"text":"This place had a long wait time and I can totally see why. The food was delicious and the ","useful":0,"cool":0},"RFSBfIw9yfK3pnxV5UnGyg":{"text":"This place is a gem. I have lived in NOLA for quite a while and i just discovered it. I ha","useful":2,"cool":1},"o_45yKkpdYtOnCgPWfLGmg":{"text":"Great funky little place in the French Quarter. Shrimp 'n grits as good if not better than","useful":1,"cool":0},"1MRLLC7ZfR97eDQ3OWVt_A":{"text":"The service was good. Food was bland. My shrimp & grits had a hair in it. My coffee had re","useful":0,"cool":0},"4JMhdi83Ysmrud5T-MO2Kw":{"text":"Great place! I recommended for brunch. I had the Seafood Benedicts and they were delicious","useful":0,"cool":0},"Nq2fY5E7O1e9Hyh5Skh1ug":{"text":"Visited twice on our last trip and highly recommend Fleur De Lis for breakfast. We had exc","useful":0,"cool":0},"O8gjvW5zbrjNCTVnEPZcUw":{"text":"Don't go there hungry, service is a little bit slow. But I will say, it was well worth the","useful":1,"cool":0},"1X4_tbORx6wbsP3k5Lr_Ng":{"text":"Really great place. We sat on the balcony, which was just perfect. I had eggs Benedict, wh","useful":0,"cool":0},"yo5YU_c1oTQ0vmWWTZwf6w":{"text":"We were there during Essence Fest.  There was a bit of a wait (the interior is really smal","useful":0,"cool":0},"zpkIcFqKeIKxtbcnAg634A":{"text":"Awesome little Cafe!  Loved the classic rock playing in the background, server staff was g","useful":0,"cool":0},"VLa_EcB3J1kwT5TBs10P5Q":{"text":"First time visiting NOLA and stopped into this cute cafe for a quick breakfast. There was ","useful":1,"cool":0},"ztHVbTfd9pxpUDl8Rr4ynQ":{"text":"A spontaneous breakfast choice, guided by Yelp and my desire to try something new. More of","useful":0,"cool":0},"mMG7unKWECx7wYD3EJX9Sg":{"text":"There are tons of places to choose from in NOLA when it comes to food. Luckily, I stumbled","useful":4,"cool":1},"csNkfKd7XIH9ZVBZ1mHEeg":{"text":"By the time i got here it was still open i asked the red head mgr \nI sat down and a waitre","useful":2,"cool":1},"QCduMmOYFeaOeA3n7-uAfw":{"text":"I had the croissant sandwich and it was delicious. Great service as well. Love that you ca","useful":0,"cool":0},"rkmgnzx2NLkpUTO5Ai_hzA":{"text":"Best I've ever had - shrimp and grits - and my roots are MS and LA. Ambiance, staff- beaut","useful":0,"cool":0},"5fsr_rSX0_3e1KSp7msxjA":{"text":"Food was okay, eggs Benedict came out cold and hardboiled. We had also asked to be seated ","useful":0,"cool":0},"QSaM14ayjl9Klcp95AW5SA":{"text":"The pancakes were soooooooooooo good! Best pancakes ever. The service was amazing. And no ","useful":0,"cool":0},"es-HASuRYSnPEUcuV9hNoQ":{"text":"Seriously...move a side Ruby Slipper...Shrimp and Grits at Cafe Fleur De Lis JUST rocked m","useful":0,"cool":0},"rOkdQao67W6092jKxpGFQQ":{"text":"Very tight and narrow restaurant. Spinach and feta wrap was delicious but needed more spin","useful":0,"cool":0},"G9GAfqhl5zGg9rYzH3sNsQ":{"text":"If you live or are visiting New Orleans,  this is the best breakfast/lunch spot. It was de","useful":0,"cool":1},"wo4YcJo9EFN_TNptEmOzCg":{"text":"I highly recommend for breakfast snd a patently do does everyone else.  We always have a 2","useful":0,"cool":0},"_QtuJUXF9HdYNl6GmX9fUg":{"text":"Very busy on a Sunday morning, pre-Saints game. Note: do not take a table if you haven't o","useful":1,"cool":1},"4UwcxbXxt6HzeNavwCG2Sg":{"text":"This is not a trustworthy establishment. They double charged my credit card and told me th","useful":0,"cool":0},"_8wc3SzuIiCUXBJsikkALg":{"text":"I was excited to try this restaurant after looking at the Yelp reviews and pictures but I ","useful":3,"cool":2},"Vta4q4EeXiSq0W2jS944Bw":{"text":"This was our Fourth time Here, the Food is Awesome and the service was Quick!  We will be ","useful":0,"cool":0},"AztgxLKf9JSFlToCK-UuDg":{"text":"Cute little restaurant in the heart of the French Quarter  food is yummy & is the perfect ","useful":0,"cool":0},"DzEa2pAvta37hVDz_hlMNw":{"text":"Service here is hit or miss. Today it was pretty good. Eggs Benedict was delicious and the","useful":1,"cool":0},"q10iNE_YsnZZe9SHTFOiug":{"text":"Oh my god this place was amazing!  We started with mimosas which were done nicely - passio","useful":0,"cool":0},"Dquw_k-_PgdruZkTymxwaQ":{"text":"Breakfast here was delicious.  Had the seafood benedict with grits and scrambled egg white","useful":0,"cool":0},"QrKg7qmok_tTDeeJRWjB-w":{"text":"We had brunch here and it was amazing. I had the seafood benedict and it was soooo good. W","useful":1,"cool":0},"oWyCgD-CO69FmX4QvR6ejg":{"text":"Omg! EVERYTHING... Amazing!!!! Visited from Rich. VA and I want to come back for this brea","useful":0,"cool":0},"is5p1G44OcMhm6WQuTgBpA":{"text":"Wow!\nNow this restaurant knows how to make a killer breakfast! I had the best cheesy grits","useful":1,"cool":1},"RQoeM3KClslTcn2_kBIOJA":{"text":"Outstanding breakfast place. A real hole-in-the-wall that we would not have picked if not ","useful":1,"cool":0},"WY8lzu6YQ266lyylbJrQJw":{"text":"Amazing shrimp & grits!! Service was a bit slow & frazzled but we understood that during C","useful":1,"cool":0},"FodRIFVYW9K5Qu0CKFkKxg":{"text":"was ok. I bit into half an eggshell and they waiter gave me a 10% discount... no reason to","useful":0,"cool":0},"j_3l9xIixXdOUXLem1HKUA":{"text":"This is the only place in the world I go to for their\nSeafood Benedict. Up in Jersey it su","useful":1,"cool":2},"ilD58pJZocwIkfsQboEO9A":{"text":"Great breakfast place with one of the best seafood Benedict's I've ever had. We were so pl","useful":0,"cool":0},"rlTQHN1Q6LCX3myWQJXf_A":{"text":"Great place - eggs were fresh - hash browns were great - service was exceptional - Michael","useful":0,"cool":0},"_-W_G1LHc3rz1kU3t_g2yQ":{"text":"So enjoyed my CroIssant here in the middle of f NOLA. It's quaint and romantic. TableS in ","useful":0,"cool":0},"7kKN9K1JC_QkO2mDpVditg":{"text":"This was definitely a super busy place but the food is in no sense of the term rushed out!","useful":0,"cool":1},"5mWCQk4iS_So86PZKjMjhQ":{"text":"Quaint little restaurant in the French Quarter which we happened to find while out looking","useful":0,"cool":0},"iEKXnrysaheT_gEonBOGIA":{"text":"Awesome breakfast spot.  The breakfast was amazing, with large portions, great flavors, an","useful":1,"cool":0},"9E2Y4fQC2sU6WBha2hJufg":{"text":"The most amazing breakfast! Got the breakfast sandwich and it was so delicious. Hash brown","useful":0,"cool":0},"XZ0lvHsUXq_t9wdeincEiw":{"text":"The food was OK, but I give it a 3 because the restaurant was filthy. The fans and vents w","useful":0,"cool":0},"P4toeciEov94aK-k057TPA":{"text":"I got it to go because covid, but man was it good. I had the Eggs Benedict and its served ","useful":0,"cool":0},"G6_sFZYpluf4eotDWGyaog":{"text":"The food had no flavor it was long before we got even some water. They sat us outside in t","useful":0,"cool":0},"6RG1-q5-f4iSCYytBTeqqw":{"text":"Decided on this breakfast location because of the reviews but not what I expected. The wai","useful":0,"cool":0},"eiVjWJYaDTl5-wOn7NzsYw":{"text":"Out absolute favorite breakfast spot in NOLA. Great service coffee and food.  We try to vi","useful":0,"cool":0},"nfgpAuWEilducp8NE4NlUg":{"text":"It's hard to go wrong with this French Quarter breakfast/lunch eatery, especially at the p","useful":0,"cool":0},"nf2qVSuPV5fDOETxXorv8A":{"text":"Delicious! \n\nOur last morning in NOLA, we decided to give this a place a try... right in t","useful":1,"cool":0},"bz4_fZdiPOkYeeNm_GG9UQ":{"text":"What a great place for breakfast! We came right when they opened at 7am and the servers we","useful":3,"cool":1},"bL6RNpT47rj3YWELwAFkog":{"text":"Small place but well worth the wait. All the food was great and the small diner ambience w","useful":0,"cool":0},"meikh5nDPpcpKFlOT1FNpg":{"text":"I went there for breakfast yesterday. The sausage link was barely cooked and still very mu","useful":0,"cool":0},"sE9ATm26jPTZlI7Y92Qt8A":{"text":"We had really big expectations for this place. It had great reviews and I was recommended ","useful":0,"cool":0},"-27fAaFPn_0e23yiWQzW0w":{"text":"I love this Restaurant! The breakfast was so delicious that I went there twice in a row! T","useful":0,"cool":0},"n8rHs6Aq_x4tjxPsiTcEUA":{"text":"So yummy!!! Great hospitality, friendly service and amazing food. We ordered lots of diffe","useful":0,"cool":0},"pjBGAk-JQSbpdiYVeO9Dkw":{"text":"We really enjoyed this restaurant for brunch. Very clean restaurant. The service was great","useful":1,"cool":0},"hJ2aR-Hc-uILo5Zugsp5FQ":{"text":"So good we came back 2x in a week in a city where there are endless choices. I still dream","useful":0,"cool":0},"ykEfBkZvSokREcWoC4VENQ":{"text":"Bustling loud dive, we tried the lunch menu but the breakfast menu seemed popular. Lots of","useful":0,"cool":0},"0pDR_6_0prTIaHhPRWDkVQ":{"text":"My wife heard the head hostess tell the other hostess \"we're not wasting a table on a baby","useful":1,"cool":0},"vq4P3CaHc1muHbhsOLzowg":{"text":"The food and service is top tier. I don't remember our servers name but he was exceptional","useful":0,"cool":0},"hByDkT5Qi1Tvvx2uB7_9ZQ":{"text":"Amazing food. Each meal is a huge plate of food. Very fresh and amazing. The place is a sm","useful":0,"cool":0},"zZajAR34fg4EHBKRPbp0pg":{"text":"Read the reviews and was looking for a good place to grab breakfast. A quick walk from my ","useful":1,"cool":1},"IjET8zDdpOMfSgVCOWRvXg":{"text":"The hostess and waitress are 5 stars. The morning mimosa was delicious.  Beautiful decor a","useful":0,"cool":0},"ACSk-wfMg2NoVTo2uKCxBg":{"text":"Just ok. The food was ok... Nothing great. The waitress was not good.  I would not eat her","useful":0,"cool":0},"zBfQd9nKaaqOUCffvEwNSA":{"text":"Visiting from California called to ask what the cross street was, woman on the phone didn'","useful":0,"cool":0},"UTwJWlB6u4WVUhJdYF5uSA":{"text":"Great place for brunch and they have amazing shrimp and grits. Tip: use the wait in line a","useful":2,"cool":1},"TlHxPkjT1bptpYsuKcP94A":{"text":"Expect a wait of course when it comes to highly rated places. But once inside, service is ","useful":0,"cool":0},"IZcHd5zHqpSzOTYGWLoV0w":{"text":"the host Kenny was great, so friendly, pleasant & comical. The rest of the staff was not. ","useful":0,"cool":0},"LWtKGU1MGSpzvpiObkWiAA":{"text":"Very underwhelming. Got the shrimps & grits, seafood Benedict and iced coffee. The grits w","useful":0,"cool":0},"pgB7xA8isi8xXK9fxDz7Eg":{"text":"Outstanding breakfast/brunch in NOLA!\n\nI ordered the seafood Benedict with a side of hash ","useful":8,"cool":10},"0WACE3luookkn7TuTjA36A":{"text":"Restaurant in the Fench Quarter Food was a bit greasy! \n\nI did want to comment that they d","useful":0,"cool":0},"apMReeJjjvV4a7bGnFoVWA":{"text":"Enjoyable breakfast and/or brunch spot that is only open until 3pm on weekdays.  They serv","useful":1,"cool":1},"sIOpK0rOIaPi8ArUkTIrcg":{"text":"We came here around 2pm on a Saturday and there was no line with lots of tables. We both h","useful":0,"cool":0},"Sn41MrygbPaEBOnncc00ww":{"text":"I have to say, I had high hopes for this place, I really wanted to experience a true NOLA ","useful":2,"cool":0},"HyYH0jSXht8pZZradmoJ0w":{"text":"Stumbled across this place trying to find breakfast without a wait for our last day in New","useful":0,"cool":0},"vIDgdHugVurIQutffxtxaA":{"text":"Stopped here for brunch! The service was good and the food was okay. The banana pancakes w","useful":0,"cool":0},"B_rv0YZBB88YE44VYKJHhA":{"text":"Shrimp & grits is very good and different from the north. Great breakfast & brunch place t","useful":0,"cool":0},"y03Dv2sf19n-znK_H-fRbw":{"text":"This was the worst place I've ever been to. The place was dirty over crowded the albino gu","useful":0,"cool":0},"BYnLsF7102nRAKXb5YyUXA":{"text":"Wait time was not too bad. Parking is terrible. The food is ok.  Customer service was exce","useful":0,"cool":0},"aIIYSPloFOby7bPXjyxFLw":{"text":"Came here for brunch/lunch and had a pretty short wait ~10min. Good food, good mimosas and","useful":0,"cool":0},"8AFMxPY35X3WQ0Du6OCPYA":{"text":"One of my absolute favorite breakfast spots in the quarter. Great service and the menu if ","useful":0,"cool":0},"3EGemNoMIVFckHNzv6MsQg":{"text":"This food is absolutely amazing! I mean farmers omelette to freaking die for.... Mango mim","useful":0,"cool":0},"DL_BCdIWl_VcNHSTRSa8rg":{"text":"We were looking for a brunch spot close to our hotel on Bourbon Street and found this gem.","useful":1,"cool":0},"-Qxf0PkuIV_bD5WkDvRc0Q":{"text":"Extremely awful service. Sat down before many guests, and these guests all got their food ","useful":0,"cool":0},"RXAdqPVbgPVb2oP4JDoLcA":{"text":"The service at the host desk was a bit lax. But my waitress was very attentive. The strawb","useful":0,"cool":0},"ac2xW832RZ5ivVeug4WttQ":{"text":"Great food with plenty of options. Chill atmosphere and very reasonable pricing for the am","useful":0,"cool":0},"URW5thB9XcLZ_wJa8v1Kdg":{"text":"Food was really good, there wasn't to long of a wait. My bacon Bloody Mary was good. I'd e","useful":0,"cool":0},"igrtWBglJPH8sVfBkzQqGg":{"text":"We had a little bit of a wait to get in, but it was worth the wait. The seafood Benedict a","useful":0,"cool":0},"o0_CRnRs5ngO4X1KOubysg":{"text":"I love this homestyle like atmosphere of a restaurant/diner. It was pretty quiet when I we","useful":0,"cool":0},"U5lrJN29yYNof6nGpRZlbw":{"text":"This place is so delicious! Our waitress, Belle, really took care of us. She recommended t","useful":0,"cool":0},"h4oAJNytMeK0lkdW6OUklA":{"text":"We went on Easter Sunday and despite it being packed the food was excellent. Great menu op","useful":0,"cool":0},"ny-Zje0fYoe0lS69ola8zA":{"text":"We stopped here on our honeymoon.  This was the best breakfast we both had ever had in our","useful":2,"cool":2},"w5qK-EVB7kykfwPo8GMpHA":{"text":"My husband and I came in for brunch and we had such an amazing time. We both ordered Crab ","useful":0,"cool":0},"5KoELWNg0GHduBq8GDFDIw":{"text":"Their bread pudding was sensational... Delicious!\nMy comfort good is oats, so got a tasty ","useful":0,"cool":0},"bE4DVGgKFzPL-OCzuaguNg":{"text":"Wow!  This breakfast was incredible!  My husband and I drank and ate so much we could bare","useful":0,"cool":1},"x8ocFKCTi91BE0DySy0U6g":{"text":"Perfect for brunch, friendly service, beautiful seat and yum!!! We strolled here after yog","useful":0,"cool":0},"Tz3u1kGwUaHmltCHcJLPdQ":{"text":"Came for brunch on a Sunday morning. Was busy and I thought? that was a good sign. Unfortu","useful":0,"cool":0},"WClDWAbxtQkjRviYcoNtkQ":{"text":"Cafe Fleur De Lis is a must!!! There bottomless Bloody Mary was amazing!!! If you try anyt","useful":0,"cool":0},"lwPB9WoluxDDyLByVQIpgg":{"text":"Serviceable, but I didn't see the wonders that a lot of reviewers saw. Fine pancakes, fine","useful":0,"cool":0},"2DEfwhilYX3pewafs_MBXA":{"text":"We checking in around noon on a Saturday, had an hour long wait, they texted us when the t","useful":0,"cool":0},"Pnu6EWjuubn8wgIPrWSwsw":{"text":"I think if I had arrived earlier in the day the experience would have been different. The ","useful":0,"cool":0},"DjgwBO77tMT13fd38LXa8w":{"text":"Came here on vacation last year in May and have been dreaming of breakfast here ever since","useful":0,"cool":0},"sB5N7K73RlXwKtUKRnPHMQ":{"text":"Wouldn't recommend this place for a true New Orlean's Experience. Came down visiting on a ","useful":0,"cool":0},"C9F5lGwm9_hPPvif5szrhg":{"text":"OMG. A friend recommended this place to me but honestly I didn't have any crazy expectatio","useful":0,"cool":0},"5CxSglbUE65mOZkRTMSY-A":{"text":"I was brought to New Orleans for the first time over spring break for BUKU music festival,","useful":2,"cool":1},"r2Pf_iZzOgi_HgeqxstVAw":{"text":"This has been a favored spot for many years.  Today was the first time we left truly disap","useful":0,"cool":0},"eccOa0S-pr1VRxxqM7Kuqg":{"text":"I have been dreaming about the pancakes her since my first trip to NOLA in 2008. My GF and","useful":1,"cool":0},"IjG5Q8--DWKNDm4YnFFDhA":{"text":"If I could give this place 6 stars, I would. They seated us upstairs on the balcony withou","useful":0,"cool":1},"vwBpdTc3idYvg4ZJB0U0WA":{"text":"Great place- food was delicious and our server was so polite. Highly recommend if you are ","useful":0,"cool":0},"jaNKw7Esg3MLHY7_ldcnpg":{"text":"My crab omelet was not the best but my grits baby! They are so creamy and delicious, my se","useful":0,"cool":0},"zeQGHv0OsNtFfjlgE0NOAA":{"text":"Don't believe the hype. The food is ok. #Meh If you enjoy flavor, bring your own. The serv","useful":0,"cool":0},"E_LC27wXoypdf4F1M34UPg":{"text":"Went with 6 people & all dishes were low on flavoring. Everyone had to add salt & hot sauc","useful":0,"cool":0},"IXgMguAHfqYOrbnzFxHygQ":{"text":"Went on a Sunday morning during FQ Fest. Did the virtual waiting via Yelp! (Worked great a","useful":0,"cool":0},"7ySQyp0ttkqjx4FBZ9T9lw":{"text":"Completely disappointed. We were the only people in the restaurant, besides one man, and i","useful":0,"cool":0},"DDmNzl93wiVdp5zx6vApHQ":{"text":"This place was nice we went here after the breakfast rush. We were able to get seat right ","useful":0,"cool":0},"vzKLanzz_t6zyX7nC0Ay0Q":{"text":"Breakfast - coffee was cold.  Food was ok. Price for 4 was $100 including tip.  Would I re","useful":0,"cool":0},"q6_5VTFMlNCZiX7zJ3LsrA":{"text":"I really wanted this to be good. The service was subpar. The food was cold. Compared to ot","useful":1,"cool":0},"lkin5wmqQRIVLKohqZMdaQ":{"text":"I ordered one of the poached egg dishes and had to flag another waiter down to send back t","useful":0,"cool":0},"2OpU9_Cmm-6rEWP9w1qhAA":{"text":"We ordered the shrimp and grits and the bourbon breakfast. Oh my word absolutely incredibl","useful":0,"cool":0},"-srduUOrVxIYdbRsL1A-Cw":{"text":"Our group was originally headed to a different brunch restaurant but because the line was ","useful":0,"cool":0},"CtP7RRiEEPNfdJSXam-LCQ":{"text":"Amazing food! If there's a wait, they'll add you to the list and text you once your table ","useful":0,"cool":0},"u9OCMaN-WE6GDHtBlOeT4w":{"text":"I absolutely love that Yelp has a waiting list for this place.  It speeds up or wait time ","useful":1,"cool":0},"rp_S5M8CaCeuVFVMMFDsww":{"text":"Absolutely scrumptious breakfast! Very reasonably priced and the staff is awesome! The cra","useful":0,"cool":0},"M9-314dqQLyGJRzZeyUbcg":{"text":"Shrimp n grits! The sauce they put on it is delish! My friends had bloody marys and I had ","useful":0,"cool":0},"J8hu4x8cBvUcoyf7nJnogg":{"text":"The wait time before seating was about 10 minutes. The food was absolutely delicious! We w","useful":1,"cool":0},"CuEXefRFOy0GpiBgmS2Fig":{"text":"Nothing fancy, nothing super original. Just good food. Service was a bit chaotic but frien","useful":1,"cool":2},"MO2bkVZAURkSgR0P7l4hYw":{"text":"So yummy!  Great service and the food was over the top!  Wonderful drinks. We will continu","useful":0,"cool":0},"5wpKJ5ykD_wrPXyJ3TqsUw":{"text":"Small but cute place.  Didn't realize they had an upstairs area until I had to use the bat","useful":0,"cool":0},"7dRPqUBZFmh83fyT9PsbNA":{"text":"Amazing food. Had the vegetable omelette as a po-boy. So fun to try it that way. The food ","useful":0,"cool":0},"XTRadbP_0EUKRI3Y_L5nLg":{"text":"Amazing breakfast! The quality of food was top notch. The breakfast croissant was tasty! T","useful":0,"cool":0},"TE3hpn9xd2TepLPq4ZAZ7A":{"text":"I don't even know where to start. Came here with family for Essence Festival and based on ","useful":1,"cool":0},"wQtweXNLCW_3KT0qWHYTBw":{"text":"This place was the only breakfast spot I went to in New Orleans that was soooo great for h","useful":0,"cool":2},"lNG9Pxw0gSpFaRC-fmBfFg":{"text":"An amazing breakfast spot with great Eggs Benedicts! I tried their seafood benedict and I'","useful":0,"cool":0},"40LzQt7mn9y4kZSDhFp3UQ":{"text":"Let me start by saying this place has great overall prices you get everything so much you ","useful":1,"cool":0},"hoaPYscecguIeztjZkWGvA":{"text":"4/5 Fairly good\nNot the cleanest restaurant. The floors were SUPER sticky!!!\n\nOrdered:\n1) ","useful":3,"cool":1},"IXFN11rGspI2jH_efjDf-A":{"text":"The food was great and the service was friendly. Definitely a go to for brunch, especially","useful":0,"cool":1},"EFXHXw_XRd3uZFoeAdP7-w":{"text":"While waiting to be seated another customer came out and said the food is amazing, she sai","useful":0,"cool":0},"FypQZDtWpyYY2Do4SnKnRQ":{"text":"Horrible service we had wait 1 hr and 20 min to get a table, our waitress didn't place our","useful":0,"cool":0},"iHVikpMl-HKnYQCm2OLqJA":{"text":"We find so many great lunch and dinner places when we are visiting New Orleans, so we don'","useful":4,"cool":3},"Kw5PDRS4Ux9M_HuLI6eOXg":{"text":"Omg! You may say \"I'm gonna walk on by\" big mistake.  Good portions, food is fantastic.  C","useful":0,"cool":1},"7dldMmJxGu9q2Pl6_DG1zw":{"text":"Came here for brunch one day and it was really good food. I had eggs Benedict for $11 and ","useful":2,"cool":1},"eqb6pZkZo1m_-ws0_LYIwQ":{"text":"Great place for breakfast & brunch. The Big Easy breakfast has a little bit of everything ","useful":2,"cool":1},"nvCDVRCyoSZhWTY5KBMLSw":{"text":"First time in New Orleans.  Had read about this place so decided to try it out. Sadly very","useful":1,"cool":0},"DfvO1tdcbo1EGSfc8DUn8A":{"text":"Great food and damn good Bloody Mary's","useful":0,"cool":0},"hnPvDk7vqYlnF6Pt-dHTtg":{"text":"Best fried green tomatoes I've ever had, and my boyfriend's shrimp and grits was the best ","useful":0,"cool":0},"X8oqp8pCMOW9LOdYlRuy_Q":{"text":"I got the seafood gumbo and it was very salty. However, the waitress was attentive and nic","useful":0,"cool":0},"tHsSGmYmRFAxQIrwpURKLQ":{"text":"Been here several times before and loved it. Food was great as well as service. This time ","useful":0,"cool":0},"TQnpE5B--35ymAAPz0t_Ew":{"text":"Great service and great food. Had a table back in the corner and still really enjoyed my e","useful":0,"cool":0},"5P4OWjheJZ2XLXpk54FWyQ":{"text":"What a great little spot. The food was good, simple breakfast food but the service was spe","useful":1,"cool":1},"I20e-dGj5WHmszdSLypE5A":{"text":"Food is fine, not great. Staff nice, but stretched thin. Kitchen extremely slow; nearly an","useful":0,"cool":0},"zaxqdXJwSCnICB99fOqzpg":{"text":"Best food we had on our 4 day trip in New Orleans. It's well worth to step away from bourb","useful":0,"cool":0},"QeJUsz605LRHjj9VSPbM6A":{"text":"I love this little breakfast cafe shop. A lot of locals eat here for breakfast. The servic","useful":1,"cool":1},"gDP-QLajjtTERTwFqyDd4Q":{"text":"This place was really cute! The host at the front were working really hard. They got us sa","useful":0,"cool":0},"RPAmIOBrG94lmpthPjjqdA":{"text":"I was disappointed with this meal. The sweet tea didn't taste fresh, the portions were sma","useful":0,"cool":0},"yHgdYRKWzjADQb0xSii1NQ":{"text":"I forgot to take pictures but it was a great breakfast! We shared plates and had biscuits ","useful":0,"cool":1},"VVFYuLc34pu8fCiMadoctA":{"text":"We were looking for a place to breakfast and found this place! My wife had a breakfast san","useful":0,"cool":0},"6EJE8vBdlvv7r_mNZVPaEw":{"text":"The food at this place was very good. I feel that this would be more of a 3.5-star​ place.","useful":0,"cool":0},"q5hkl13OrJdvs2rklh12ZA":{"text":"This place & its food is AMAZING!!! Let's start off with the fried oysters Benedict! I thi","useful":0,"cool":0},"GKO1qYiAv6A6C1otnzCm0Q":{"text":"This place is a must for brunch!!! I tried the shrimp po boy and it was delicious! My wife","useful":0,"cool":0},"jHoute7nspjRIYBF1OEIAw":{"text":"I came here specifically for a chai latte, since they had good reviews for it, at about no","useful":0,"cool":0},"zQSVq69TALBlKuGoAMz2hQ":{"text":"Breakfast was great and very filling. The place was busy but that did not reflect in the e","useful":0,"cool":0},"4z0osvHBXBEcI_fjlgCqEw":{"text":"It was great food and the waiter was very nice. But we waited at the door to be seated for","useful":1,"cool":0},"3BdXEgZiHh341MGuKcp1oQ":{"text":"Waited over an hour for food..had to ask for utensils..food wasn't hot..i ordered the seaf","useful":0,"cool":0},"qJPLUISfA4tWuKMJZhTnZA":{"text":"Pretty decent. Very nice staff! The tofu scramble was awesome... the only problem I had wi","useful":0,"cool":0},"CG1qNmeq_cvEiqx3Dqp0GQ":{"text":"This place is awesome and the food is great table size a bit small for four people but you","useful":0,"cool":1},"XyGILRc0ZnceEdSLdBpNDQ":{"text":"The CHEDDAR GRITS, if you go anywhere in the French market for grits you come here\n\nI trie","useful":0,"cool":0},"UNdms42u0sOC-39Z_TAsrg":{"text":"If you looking for a great place to have breakfast.  9 different Benedict's.  Had the seaf","useful":0,"cool":0},"vf4bbhfPq76IZrPYtlHzDQ":{"text":"This was some of the worst food I've had in a my life. Everything was cold. The service wa","useful":0,"cool":0},"Dw85woTsIbhxrc41RkITBQ":{"text":"We were told the wait was 15 minutes, but waited for 30. Once we were inside, we sat in a ","useful":0,"cool":0},"vZSPBkUmD-N7U45n5JiAQw":{"text":"Delicious Breakfast Seafood Benedict! They also make a nice and strong screwdriver! We wen","useful":0,"cool":0},"zVgHLHf01rRBzJGsJA3XDA":{"text":"Delicious food! Went early on a Sunday morning for breakfast. Found this place within walk","useful":1,"cool":0},"yB6t5yAekwVocNIK5cmrBg":{"text":"Great food, great service. Using the \"waiting list\" feature made it really easy. Would rec","useful":0,"cool":0},"EtnqBWN8xr2W67-lubLIJg":{"text":"What's great about this little breakfast and lunch place is that the food is not greasy.  ","useful":0,"cool":0},"yQW8FZmsPpHF-CUS3WkyqA":{"text":"We stopped in one slow morning after too many drinks the night before.\nThe service was rea","useful":1,"cool":0},"gFemacKvzEn0GHb99pxyyQ":{"text":"If you want to have a great breakfast with alot of options for reasonable prices. You have","useful":1,"cool":0},"PSk26_UcZ3PiOwaXCOIgEQ":{"text":"When we arrived, the hostess told us there would be a 15-20 minute wait and gave us a buzz","useful":1,"cool":1},"zP7q16sMeP8HqyF_4GE63Q":{"text":"Update!  The restaurant was half empty. Tables open everywhere and ready to sit but they'r","useful":0,"cool":0},"9KA0NEEiBdJN0u-ow0Kx9Q":{"text":"This is such a cute and tiny breakfast/brunch spot. After a long morning tour we decided t","useful":0,"cool":0},"Rk-pwfc_9TOS83b-YltpgA":{"text":"The coffee was 8 parts water 2 parts coffee. Aside from that, the food was disappointing a","useful":0,"cool":0},"pldFWcalhIwbkgZIiea3sg":{"text":"I really wanted to like this place.  I went for breakfast and was squeezed in right by the","useful":0,"cool":0},"CZLv-9--7mCgM7c99niACQ":{"text":"Put our name on the wait list. Got there and was told that time doesn't matter it's not ac","useful":0,"cool":0},"Qq4_FegHQfwoia0veuJZwA":{"text":"Food tastes okay,  but not as good as before.  \nThe reason for the low rating was the bug ","useful":0,"cool":0},"Ic39smXSt29Zt8dgz8jhuw":{"text":"This place is great! This was the scene of our final Nola breakfast at the end of my bache","useful":0,"cool":1},"AIiy5ledc_d0e8sgq84ycA":{"text":"We walked past this cafe several times, each time they had people waiting to be seated. Pe","useful":0,"cool":0},"9ahozE2BPtift_JKY61hFQ":{"text":"Is good. Waited the right amount of time for the right texture of beignet. \n\nNot much else","useful":0,"cool":0},"yjhUwBIa_CVxzZ_xoMIDeA":{"text":"Another fantastic New Orleans French Quarter breakfast. First-the shrimp Bloody Mary's are","useful":0,"cool":0},"kkl_CYmIfI5f_tMRjIjPRg":{"text":"The breakfast was good not great.  I got the seafood Benedict and it was underwhelming, bu","useful":0,"cool":0},"IN80w9mxvXp5emzNU3emBA":{"text":"Loved the variety of mimosas as well as ambiance! Sat upstairs outside and loved it! Perfe","useful":0,"cool":0},"qcAGyTYV9QfhvpJBnf5z2Q":{"text":"The hostesses were not welcoming or friendly. The floors were sticky & dirty, like they ne","useful":0,"cool":0},"rrbod4BFoyGjDkiuWOdF_A":{"text":"Excellent food, only downfall is they had NO coffee when we had breakfast. It wasn't their","useful":0,"cool":0},"bClyRzuNGI5t0Yz2a3ahTw":{"text":"It's surprising how we waited longer for our food to arrive compared to how long we waited","useful":1,"cool":0},"igLyG1h2XmaScO6f1Pv-BA":{"text":"Looking for a close by place to eat & Cafe Fleur De Lis hit the spot.\n\nBloodys & spicy egg","useful":5,"cool":4},"1f_iysIjZUbfuvSwIrLUOg":{"text":"Headed out of town this afternoon and wanted one more great breakfast...Awesome!!!!! Nila,","useful":0,"cool":0},"NRF97CbJ5JacgXTO1qfAqA":{"text":"This place had a short line waiting outside so I expected it to be good. It was, but waiti","useful":1,"cool":0},"m9Yzj3-3Up3tqh9fNCu9sQ":{"text":"Absolutely amazing. Come by early to put your name on the waitlist then enjoy the stores t","useful":0,"cool":0},"KGsHgPkOXfoWpEmxrib7DA":{"text":"10/15/16, 2 people, late breakfast/brunch\n\nService: 5 Stars!\nAmbiance: 4 stars\nFood: 4.5 s","useful":3,"cool":4},"rqoU09Z-G4qNf_Z66rFFZA":{"text":"We happened upon this cool little place our last morning in New Orleans. They have awesome","useful":0,"cool":0},"o2i6w3ZFi_adqAvIabEg1w":{"text":"Nothing special. Breakfast is truly basic. Most notable are the grits and pork belly. No w","useful":0,"cool":0},"clSZJHxLiUy5R2g5DcTJtQ":{"text":"We always used to eat here when we'd travel to New Orleans and it used to be great but it'","useful":2,"cool":0},"Ov8ttZsZvnnPJTKjCLM3nQ":{"text":"First time here, and though the food was tasty. It would have been better if the sunny sid","useful":0,"cool":0},"xFSndFkm8uN3q6XD4egEkQ":{"text":"Where do I start? The shrimp and grits was probably the best I've ever had and the fried g","useful":0,"cool":0},"ZPUwiJnPKxGcROoghl9muA":{"text":"The avocado omelette had one brown bite-sized chunk of avocado. The grits and gravy where ","useful":0,"cool":0},"VHwadxXcoTgLZGTgKIub0Q":{"text":"I had the Eggs Benedict and my wife had the fried green tomatoes. Both were very good. Neg","useful":0,"cool":0},"pCU-EADj8sChjBTXCOg_sA":{"text":"We ordered the breakfast burger, fried green tomatoes Po Boy and a few drinks.\n\nI tried th","useful":0,"cool":0},"87ZSyE6NS0PmqwCRTo874A":{"text":"Food here is always great. Staff is always friendly. Love it here.  And I can honestly say","useful":0,"cool":0},"ACfaQO59yEOVqOUxdiKdpQ":{"text":"Wow.  Came to New Orleans for a work meeting and am staying at the W across the street.  G","useful":0,"cool":0},"rH-jhml1kBc8k9mzd4wwLQ":{"text":"Amazing! Great food, served hot, fast and fresh. The coffee here is fantastic. There could","useful":1,"cool":1},"nqI-LNTzYgocXE9k1pusEQ":{"text":"Food was delicious but service was kinda weird. We were seated in the back upstairs room n","useful":4,"cool":3},"NGgcLw10E-lCbSuk90IlNQ":{"text":"Top notch service and with the possible exception of the Cotton Exchange in Savannah, GA, ","useful":0,"cool":0},"Ksk1QmWrgBlbYN0wv8NqJA":{"text":"Breakfast was pretty busy as you can probably expect. Half our group split up so a friend ","useful":1,"cool":1},"sIPjCf7nfV2cn4JfcJFT0Q":{"text":"There is not too much to say, the food was good but there was really nothing that stood ou","useful":0,"cool":0},"Szfl6FfTIZFrRSdH1v3j7g":{"text":"It took 50 min to get our food, ended up taking it TO GO because we had to check out of ou","useful":0,"cool":0},"rlJ75zbqZ_qx44xRhueT2w":{"text":"This place reputation is marvelous on Yelp for a reason.  French toast here is possibly th","useful":1,"cool":0},"ywBQBLKYgjK07CgIRC1eOg":{"text":"We just had breakfast here, the coffee was delicious strong coffee in huge cups, my husban","useful":0,"cool":0},"X2GR5beBkt4wCKRpKXhGQA":{"text":"More of a mom and pop vibe than we expected based on the website. Breakfast was good. I wo","useful":0,"cool":0},"An6QiK8IPspJwYJqygzF8w":{"text":"Food was amazinggggg! Probably the best brunch I've had in a while. Grits were creamy, Ben","useful":0,"cool":0},"INbv71YKRotN1GC1ZZpckg":{"text":"Oh yummmm! First time visiting and there was about a 20-30 minute wait which absolutely ma","useful":1,"cool":1},"D5h0pA04uWz_OJUV9nDkvA":{"text":"This breakfast joint was AMAZING! The guy at the table next to us literally was making lov","useful":0,"cool":0},"RZGHi8c67pwHeP5J8iAZsw":{"text":"Stopped here with a group of 7. There was a small wait and they took my number and sent a ","useful":0,"cool":1},"0scAkj6a63Ou3yONa4Ve0A":{"text":"First- the waitlist on yelp is nonexistent- it said there was a zero wait then we got ther","useful":0,"cool":0},"KgVkrH6ZGxt6DIwAssIYQw":{"text":"When returning to New Orleans its a must go. I went to Cafe Fleur De Lis twice and enjoyed","useful":0,"cool":0},"VNqIlqkXvRY1cpjBhB2skA":{"text":"Always a great breakfast, it's worth the wait if there is one. The omelets are all good, b","useful":0,"cool":0},"6f2emsStUJFiGuyN9JS_uw":{"text":"Everything was absolutely delicious! I would highly recommend the grits.  They are hands d","useful":0,"cool":0},"CHOzC3EJH6BiaJph8WAYWg":{"text":"Horrible experience from management all the way down to the waitress Tina.  My party was s","useful":1,"cool":1},"NvDjE5hTLvclhIIcpkH1Dw":{"text":"Staff was so upbeat and friendly. We waited an hour to get a table and the line was just a","useful":0,"cool":0},"A6qhDWydAqQQOQEcAowCOQ":{"text":"The bacon, the bacon....oh mah gah the bacon! We ordered the seriously southern breakfast,","useful":0,"cool":0},"MQD2IjzHZ9OoSYgXUrlqvQ":{"text":"Great option if you want a complete breakfast with eggs, pancakes, bacon, sausages and toa","useful":0,"cool":0},"gYT6951dkydeEN5sBF9WlQ":{"text":"Our service was excellent -Thank you, Tyler! The food was fresh and delicious. My dining p","useful":0,"cool":0},"BXqg1CFWPMQY9uxfMLtXSA":{"text":"Ok- just my take...\n\nWhen we came here, we were seated within minutes. This cafe has a coo","useful":2,"cool":1},"5d5K1xKDnArG-vbRBGDxng":{"text":"Sometimes you just eat a dish that blows your mind, and the shrimp & grits here is one of ","useful":6,"cool":5},"_zhul35-Ru04j2AxjKFcJQ":{"text":"Cute little place, but this was one of those times when the BF and I dropped the ball in t","useful":1,"cool":0},"LV1y_5DeQlkGvMEIGicF9A":{"text":"2 stars = meh, I've had better.  Your experience may be better.  My reasons:\n\n1). We sat u","useful":1,"cool":0},"M8qvZurVG1B-pWgkIeVsXw":{"text":"Great breakfast place great food reasonably priced and good service. Nice to sit upstairs ","useful":0,"cool":0},"XpF_iK32nXu-jsDDWF8MeA":{"text":"happened to stumble upon this cute small cafe and it was delicious!! just look at this pho","useful":0,"cool":0},"Pxfk9nKJOGzBjLRZ0LKXvw":{"text":"Decent spot in the French quarters for breakfast. Not as line heavy as the other spots on ","useful":2,"cool":2},"-y25KABAk-JR9iXUNfqZqQ":{"text":"Found this place via Yelp after we were told it would be an hour wait at Ruby slippers for","useful":1,"cool":0},"qT0ddTB0Qs7asaWaYyABLA":{"text":"The Seafood Benedict was CRAZY!!!  I cant explain how good this tastes.  The crab/crawfish","useful":0,"cool":0},"gLIPnzIRKXRwSoTesoRQ0w":{"text":"Stayed at the Royal Sonesta and wanted to find a good breakfast spot. I  located this rest","useful":1,"cool":0},"rl8i0gWvd59ZLKGMWpp5xw":{"text":"The service here was pretty blech. It started the moment I walked in the door. The hostess","useful":0,"cool":0},"pyFJz7aUR9TQ6gcqAlHPMA":{"text":"Went to this delightful two story cafe on Chartres for breakfast. It was packed but I got ","useful":2,"cool":1},"7LCM_1qhEQdWi1VuCDCWvQ":{"text":"The food was definitely on point,  the service was great and the location is perfect as we","useful":0,"cool":0},"AE_NXFYgWfWpHeJnCYijxg":{"text":"We had a very attentive waiter who gave us suggestions for food and places to visit for fi","useful":0,"cool":0},"aGjdDA-IIxtyDYHUGPyJwA":{"text":"Perhaps the worst waiting service. Taking out three simple orders. Two scramble eggs that ","useful":0,"cool":0},"JxJD7i6hQxZZH-xk7uGSOA":{"text":"This was our second time eating here and still impressed with the quality and service. I h","useful":0,"cool":0},"kc3nYoFhstbsx3iRAYwWEg":{"text":"This place is amazing, smallish for seating but amazing food selection, shrimp and grits w","useful":0,"cool":1},"D9zJzivpjUB-8dSlrebHZg":{"text":"I'm wondering if i just came on an off day or maybe i ordered something not their specialt","useful":0,"cool":0},"bdSeksHdnXa6EJpRbbK-2Q":{"text":"Quintessential French Quarter experience.\nSmall balcony but the open upstairs room is big ","useful":0,"cool":0},"pNu1sTK0_5YkaWLSAPyKXA":{"text":"Wow!! This is THE place for breakfast! Try it! You won't be disappointed. We ate everythin","useful":0,"cool":0},"8-DW2KkGNzXM7QS2ANLlXA":{"text":"Yum yum-service great, CV protocol check..Amazing avocado feta omelette..Cheesy creamy gri","useful":0,"cool":0},"u5K25Mb7FWLVuasi6BNHbQ":{"text":"This place would of got a higher rating if:\n1. We wouldn't of been lied to by the host tha","useful":0,"cool":0},"C8mJ5Q6_70M029ohOPAqZA":{"text":"Unbelievable breakfast place!  Seafood eggs Benedict rocks. Perfectly poached eggs. Crab a","useful":0,"cool":0},"aId0u_GlchN3VERJ3qnDrA":{"text":"Amazing service, the whole staff went above for making us feel welcomed. The wait wasn't t","useful":0,"cool":0},"jOT8yEA8Sgd3azavTrFzQA":{"text":"Our waiter Kerry was not a very good. Rude service. My sausage was undercooked TWICE! I wi","useful":0,"cool":0},"hQEyshyu0u05sI8lwhGBIQ":{"text":"Order the seafood benedict! Enjoyed a chai latte with breakfast. Service was great and qui","useful":0,"cool":0},"YPgr1E1nfzPvfdNJrjlyhA":{"text":"Awesome breakfast. Get the classic southern. Or as my wife did the banana pancakes...that ","useful":0,"cool":0},"LMPQAIhkRAPI0qaPIRgu0g":{"text":"We were walking around for a brunch place on a Saturday morning (Jimmy J's and Daisy Duke'","useful":0,"cool":1},"1rmwI-DbB87zP9BCBu9rWw":{"text":"Cute little cafe. We came here 2x during our stay in the French quarter. It's a little bit","useful":5,"cool":6},"LTXU_Q9AYEoEFgzkcrm8zw":{"text":"Very dry po'boy. Everything fried had the \"bad old oil taste\". Very dirty restaurant and b","useful":0,"cool":0},"9X5tTr4K4B7osd4ECpXx_A":{"text":"Unless you are still drunk from the night before...or better the late morning hours, I wou","useful":3,"cool":1},"69Sg89Y_a1ShGyZL_VfCjQ":{"text":"LOVE LOVE LOVE this place. Every time I'm in New Orleans, I try to make it a point to stop","useful":0,"cool":0},"-LGCzimxDjTWQeI_ts78qQ":{"text":"Cute little cafe with great food.  Service was very attentive.  They have amazing cheesy g","useful":0,"cool":0},"3d518QFx552aPXIK7MltXg":{"text":"Had to travel during covid and this place was open.. it was packed,  but put my name on th","useful":2,"cool":0},"wzw2yLynJ1K3DjYALHPs3A":{"text":"After a night of Halloween, we woke up in search of our last great meal in NOLA before hea","useful":1,"cool":0},"awiDWkPIeJf9jrF6mIJfwg":{"text":"I was excited to visit this restaurant because I heard the food was really good! From the ","useful":4,"cool":0},"aUA88Fe1mIkvMb6yg4VKZA":{"text":"Staff was friendly and service was really fast! My beverage was fresh squeezed orange juic","useful":0,"cool":1},"Gfke6X17O2MyL-HqF4BEZQ":{"text":"Great service and food. Definitely a great stop for breakfast- ordered Bourbon Street Brea","useful":0,"cool":0},"iU59SPM7qKTWLKkacOprsA":{"text":"We are just about everywhere when in NOLA and this by far was the best only second to Comm","useful":0,"cool":0},"K75TYCWIRzHja8GDzPKZKA":{"text":"OFF-MENU FAVORITE: the loaded hashbrowns, please bring them back!\nCLASSIC: noisy but festi","useful":2,"cool":2},"jDdMjKJ4E7-O0nUWj9SjVQ":{"text":"Had a great breakfast here. Definitely a must while in NOLA. I had struck out a few times ","useful":0,"cool":0},"XSRukBAsb758nt09Ogx_pQ":{"text":"Adorable little cafe. We stayed near this place and came upon accidentally. Very sweet sta","useful":0,"cool":0},"aJMBE7EsK29ZRVYqraoCjQ":{"text":"I am a regular here as it is one of my favorite quick breakfast places in the area. It is ","useful":7,"cool":4},"MjzuF0uwxvRb7dHTyVLRHA":{"text":"This place was horrible.  My wife and I went for breakfast one morning.  Never again! We w","useful":1,"cool":0},"0Ue54IAe12tlvOf0txFcFg":{"text":"Let's start with the corn syrup masquerading as maple syrup, followed by the bacon that wa","useful":0,"cool":0},"DX5T8Y-2xqH7b-ix1VlpRg":{"text":"Came for breakfast.   Was not overly packed so got right in.  Food was ok but service is h","useful":0,"cool":0},"8Z4CsMsCwJFVmX7SAIwJMQ":{"text":"Had a wonderful and hearty breakfast here on our last day in New Orleans. It was a Monday ","useful":2,"cool":1},"XbDmm_xp4YYONQ_0GXLGaA":{"text":"This was a small but pleasant breakfast place.. we went there on Christmas and we couldn't","useful":0,"cool":1},"hTuiHwWXFjZb_nUrF8M7nA":{"text":"This place is adorable. The food is good and the vibe is nice. Definitely check this place","useful":2,"cool":1},"oB6JYxkm7HSyd_xDANBIpw":{"text":"The shrimp & grits were delicious as usual. They use fresh ground grits. Someone else in o","useful":0,"cool":0},"ATjeBfwSfg9FEZhXIJhNcA":{"text":"The food was amazing! Second time in NOLA and admittedly did food wrong last time I was he","useful":0,"cool":0},"QxMV4L1qvN3SLEkl7PBTdQ":{"text":"We had a great breakfast here. The pancakes were very, very good. We would definitely eat ","useful":0,"cool":0},"HapCe4W1RS_7Jk05qbSIfg":{"text":"Alligator sausage po boy! Wow this sandwich is tasty. Never thought I'd like gator but Caj","useful":0,"cool":0},"PYE0snYbBN3T_QSuSDylQA":{"text":"Expensive and disappointing.  Shrimp and grits were bland and tasteless.  I ordered the se","useful":0,"cool":0},"esnY674aXZW5Tc3KAmXnoQ":{"text":"I really enjoyed my breakfast here. I had some banana pancakes that were delicious, bacon ","useful":1,"cool":0},"klisTbXop_YPDWQXSXhAng":{"text":"From start to finish, the food and service were impeccable. The seafood eggs Benedict was ","useful":0,"cool":0},"knzRR5crWXDYP9mWp4r2Uw":{"text":"Friends were in town for Mardi Gras. They wanted to eat something good for breakfast while","useful":0,"cool":0},"vLeb1D4GLzDonFAjmqg7-A":{"text":"I loved my visit to NOLA, but this place was not the greatest. Service was just ok. It was","useful":0,"cool":0},"_ecALd1pVIlXsb0ZPjNG1A":{"text":"I came here for breakfast & tried the shrimp & grits which were pretty good. The grits had","useful":3,"cool":2},"5YLWmtaxusdr36rKeJk-Jw":{"text":"I have been here twice before on other trips. The service  was great then, and the food wa","useful":0,"cool":0},"pjHNvGxTpr0j-1yNP2X8BQ":{"text":"The host was so sweet. He made sure we were doing okay and was very professional even when","useful":0,"cool":0},"ZueMS75l6HE5u35jVukXnA":{"text":"It is a great little gem in French quarters. Food was excellent, you must have the bread p","useful":0,"cool":0},"a2W2ZdCcen13JnX7EvHakw":{"text":"A cute cafe in the French Quarter conveniently close to many other sightseeing places in N","useful":0,"cool":0},"RiSfYDgWnc25pTu4miE1Wg":{"text":"We tried the bourbon pecan pancakes with candid bacon.  They were delicious and so filling","useful":0,"cool":0},"29pRZ_tuwM_2MBxNGnvQ7w":{"text":"I ate breakfast here the other day and it is by far one of the best meals I've had in New ","useful":0,"cool":0},"wA2L_iFfECgihwiU8fQAmw":{"text":"Came here for breakfast. Typical southern breakfast menu with some lunch options. I also h","useful":0,"cool":0},"Xtf-4ipKnFlrYPu7hzomXA":{"text":"Definitely worthy of 5 stars! Best grits ever! Bacon delicious. Everything was so good. We","useful":0,"cool":0},"ChLV7BgYIqpsdJDyuNh7Pw":{"text":"Quaint spot with a fantastic menu. The omelette and grits were excellent and great house c","useful":0,"cool":0},"Hd4ezceccT5h5HezfJy8dA":{"text":"The staff was friendly the food was okay. I did get the Big Easy and my pancake was not co","useful":0,"cool":0},"aHnpsVYy53Qy7rMVU3JHFQ":{"text":"The food was \"okay\". Good overall , but it was missing something. It's hard to fully get o","useful":0,"cool":0},"c6-07G0mUrR-Q7UuxowkrQ":{"text":"First, the place was very dirty even the restroom and food was not good enough to make me ","useful":0,"cool":0},"_lK7YG6iUKsjtloBLkLlUA":{"text":"Best breakfast spot in New Orleans! On our last trip we went 3 days in a row. Our large pa","useful":1,"cool":0},"_wdNSA_wQT8Hg1K8e1b19w":{"text":"Food was excellent and so was the services once we got into the restaurant. An hour long w","useful":0,"cool":0},"2WB_4gTZaJzJf5-GiHDQCA":{"text":"First time on this place. 30 minutes worth wait for breakfast. \nGreat menu and fantastic s","useful":1,"cool":0},"uscpD_TP8iKesEhAmVynyA":{"text":"We went here to have breakfast for my birthday.  We thought it would be a nice French quar","useful":0,"cool":0},"ulT6ycxH5FEpmQiT4DpHtg":{"text":"Ehhhhh. There's better places to have breakfast in this wonderful city. \nI was with a part","useful":2,"cool":1},"85dFE6HCiDdEMagGDokcTA":{"text":"Simply, every bite was Devine.  We tried two be edicts and loved both (pulled pork and sea","useful":0,"cool":0},"eFYgFtDwKtrFozegPOheTg":{"text":"Went to this small restaurant that is hidden right in the French Quarter.  Both the food a","useful":0,"cool":0},"HE60eY3FvJpfyURMdRKCfw":{"text":"Well, considering the wait tie for this place on a weekend day (Sat-30+ min), I'd have to ","useful":0,"cool":0},"XUtOTepi6n-vlH73V8pwAw":{"text":"Went here in a whim after getting lost looking for another restaurant, but I am so happy w","useful":0,"cool":0},"Y_lCbn39L-LFkE6QKB-5Hw":{"text":"Breakfast spot offering a number of classics from pancakes to Benedict's. Went here and go","useful":0,"cool":0},"Xc9T5eu1M1QFiB5FkGbWSA":{"text":"I try to share my experience off my honest and fair opinion..  service was fine. Friendly ","useful":0,"cool":0},"GR6FkEFtow8s3b_I_sZRMQ":{"text":"We wandered into Cafe Fleur De Lis over a long weekend in NOLA after espresso right down t","useful":0,"cool":0},"8rLuhZuryHvvxQBPJZydpg":{"text":"Amazing!\nI never have had shrimp and grits but if this is what they all taste like I'm sol","useful":0,"cool":0},"i_f3qrd0vP3DtV7-aEsgcA":{"text":"Sooooo slooooow. Took 45 minutes to get my food. Not how long I want to wait for breakfast","useful":0,"cool":0},"zNR8lST9QaiS_V4px2qHrg":{"text":"I loved this place for 2 reasons, first, they take your name and number and text you when ","useful":0,"cool":0},"jxJTB-z8Tld216gT3RmmtA":{"text":"Food was good, but restaurant is filthy- not just dirty - filthy. I'm all about vintage lo","useful":1,"cool":0},"b3eRkTWt7cVRmPKFD3DAxA":{"text":"The food is amazing.. It took some time to be seated but worth the wait. The location had ","useful":1,"cool":1},"Mw96PZbJs5n6RJEGZqJ9VQ":{"text":"I got the Bourbon Street Breakfast, complete with a shot of bourbon and it was amazing!! A","useful":1,"cool":1},"fogOpKDxzj9AV79wHKXq_g":{"text":"The best bread pudding in NOLA. I happen to be a bread pudding connoisseur  (pronounced co","useful":1,"cool":0},"QRCP-6uiqFQHhGTrttfRjg":{"text":"Dirty water glass and an eggs Benedict with what felt like a half an egg shell.  Not a goo","useful":0,"cool":0},"yihGlwQa4BEAdTPv3B-TmA":{"text":"We loved the fact we didn't have to wait, and the food was AMAZING! I want to try iconic N","useful":0,"cool":0},"zpimeyqI8HQKFHytWA1T5A":{"text":"Great service and food was pretty good! The pancakes are so light and fluffy! I also got t","useful":0,"cool":0},"hwMuiafdF9djTARDkIUMrw":{"text":"Top nitch breakfast in the French quarter. The food is the stars here. Although we did enj","useful":0,"cool":0},"TrqLOLrcc_Ay5PVpHx7EmA":{"text":"Nice location, ordered rose latte and the coffee mug had a bad smell like it was not washe","useful":0,"cool":0},"SwdojHBLtHx96ZX7ZFQ6kw":{"text":"Neither the Cajun or seafood omelets were very good. The omelet I had at Muriel's was much","useful":0,"cool":0},"j48omdayxh77zpKsmjqfyg":{"text":"Cocktails taste of cheap alcohol. Food barely warm. Toilets dirty without even bathroom ti","useful":0,"cool":0},"yxeBrJK5asQ_8yHnPYN2UQ":{"text":"Came here for brunch before heading back home! They have a first and second floor. Their E","useful":0,"cool":0},"dkM2gCttRvkusS2_TT1XYA":{"text":"It was a great stop for breakfast before a day of exploring the French Quarter. We tried t","useful":0,"cool":1},"LfepgSj_GWy8OOrfo0mpjg":{"text":"This is our 4th day in NOLA and this was by far our best breakfast yet. I had the shrimp &","useful":0,"cool":0},"k4qXgnlPbbqFFxiyPuClOg":{"text":"Seemed better than it really was. Service is good, so review is mostly for the food. It wa","useful":0,"cool":0},"SKmKFpMb-B_f4f6xSlD6dg":{"text":"Visiting from California. I had the catfish Po Boy and French fries.... SOOOOO good!! Defi","useful":0,"cool":0},"8DgjLvw2a14zjnVRc7Sv8w":{"text":"The service was great! Loved that we could get in line using the app. Our food was meh.  T","useful":0,"cool":0},"hq9GJwXUBQ8KgCKaJso--w":{"text":"We enjoyed oitur breakfast here. After waiting so long for another breakfast spot, we walk","useful":0,"cool":0},"PU_z810-zVYEtLqCX5d5ug":{"text":"Good little spot. Great choices to choose from. I had the eggs Benedict. Can't go wrong wi","useful":0,"cool":0},"0o7iUqtYcSrSBOum1Nga1g":{"text":"Hidden Gem!! We came on Sunday around noon and had a short wait to get seated. What took f","useful":1,"cool":0},"yPl2YfC7Kgp7sviAyGTDiQ":{"text":"Food deserves 4.5 stars the customer service is what was horrible. We checked in immediate","useful":0,"cool":0},"XYSnjcGiDTIPzydxKl3pwQ":{"text":"Don't even bother going here if you want good service and/or good food. It was a 45 min wa","useful":1,"cool":0},"IXmS1NRUZ6yjMYwQYhaXTg":{"text":"Oh man. Fried oysters Benedict for breakfast.\nIt was fantastic and so was the Bloody Mary.","useful":0,"cool":0},"huzGlvoRJsZ2kLvn9WrDkA":{"text":"I enjoyed the mimosa, atmosphere and service here but the poached eggs on my eggs Benedict","useful":0,"cool":0},"OdSzDdYmJw_UAg2KMt4Emg":{"text":"Small place! The breakfast was good but it wasn't anything that I was impressed about. I k","useful":0,"cool":0},"ViA9nArNn7Uq3fII_a7htA":{"text":"This place is AMAZING! My boyfriend had the Oyster Benedict and I had the Crab Catch Omele","useful":0,"cool":0},"ZsCpCZvol9mdBrFFDdgIsg":{"text":"What an horrible experience!\nWe arrived in the morning to have a breakfast! The server loo","useful":4,"cool":1},"mhoIPLC_uHOnRP6Fkq_jUg":{"text":"Been all over New Orleans experienced multiple restaurants especially breakfast which is m","useful":0,"cool":0},"Daz87jQM8fz7kOa8oF0a8Q":{"text":"First time in this place, visiting New Orleans. Disappointing, seemed like the toast were ","useful":0,"cool":0},"qAH5vyMyRs8IMPcKnCI9Aw":{"text":"The place is nice and the food is seasoned very well. Very good breakfast flavored mimosas","useful":1,"cool":1},"Sp6pNO8CSJ1J-2Yn-VQz8A":{"text":"Excellent service and a robust menu filled with a lot of authentic choices. They have grit","useful":1,"cool":0},"bvPs23WXEU2ZSLzhB8PpZw":{"text":"Wow, what a tasty traditional breakfast and it was huge.  I ordered the Big Easy breakfast","useful":0,"cool":0},"YsgG-6-qeJJTIi-TUjE6Rw":{"text":"Food was delicious.  A little concerning as we watched the waitstaff drop a bunch of clean","useful":2,"cool":0},"bKnlz2kMWg7WrjGQTKPoYg":{"text":"Horrible service. 2 days in a row. Ordered hash browns instead of grits and they still gav","useful":0,"cool":0},"nWUmn_iRVteWCUtnw7Bn2A":{"text":"This used to be one of the best breakfast places in town. Not any more. I took a friend of","useful":0,"cool":0},"OVpRYp3l0MfG0C3HiGqkWw":{"text":"Great place to have breakfast on a balcony. We came in for brunch without a reservation, a","useful":2,"cool":1},"ylt9HPa3jSZpVajW2wxWeg":{"text":"Some bomb ass food!! The chocolate chip pancakes and the hash browns were ahhhhmazing. We ","useful":0,"cool":0},"UbgTJIsV6JUEXAXjhYip3A":{"text":"Great food and great service. We came here to eat on two different days during our vacatio","useful":0,"cool":0},"Y5NGgSmjPMCtXP5-JjX61A":{"text":"This place has some of the greatest shrimp and grits. It's really busy and for a good reas","useful":0,"cool":0},"fl_L-t3EhMrg0Evm51xc0w":{"text":"Although the hostesses weren't exactly on their A game and didn't seem too happy to be the","useful":0,"cool":0},"s0IJGAPHCGhXgJhBCvwWXQ":{"text":"This was actually one of the best meals we had in New Orleans. Our family raved about the ","useful":0,"cool":0},"m1VEr7m1ecO6dtrHuBpbXg":{"text":"The seafood eggs Benedict are awesome. The only complaint I have is the parking, I ended u","useful":0,"cool":0},"EbojQI7dToUKjMF-h01XpQ":{"text":"Terrible service, water taste funny I returned it and got another one with a fly. Food ver","useful":1,"cool":0},"44hHMq6Cw4G9Q4jG6sRjBA":{"text":"This place is a fantastic brunch spot for some good southern cooking. Unfortunately when I","useful":1,"cool":0},"M4TDWLzmyqhatTtMb4nVpA":{"text":"I visited Cafe Fleur de Lis back in April. It was a friend's recommendation and honestly a","useful":1,"cool":1},"lrbl0CXH-PArNMNoDqJdHw":{"text":"Just had brunch here after reading all the great reviews. Although the food was quiet good","useful":1,"cool":0},"DzFuHwvUjTWZAlvSkkNJsw":{"text":"The wait was long but that wasn't the problem. They ran out of grits but that wasn't the p","useful":0,"cool":0},"6MQnogxBTxDLglgm4NLqtw":{"text":"Incredible shrimp bloody Mary, excellent shrimp and grits, amazing sausage. All food is on","useful":1,"cool":0},"BSpDCqHhZ2-F22EQf7rqag":{"text":"It was okay. We were told it was better than Ruby Slipper but no. Service was very slow an","useful":0,"cool":0},"Ju6kmlOvfJ7do9cYA3Atow":{"text":"Nice breakfast with incredibly kind waitstaff!!! Pancakes hot the spot on a chilly morning","useful":0,"cool":0},"8Gzsp8gRUMhG1MvuE1cSoA":{"text":"The menu offers many local, traditional meal options.  Their specialty, according to my se","useful":0,"cool":1},"ZfqvLvzc8RJ8iLY9INVnrw":{"text":"This was a great place for brunch! We walked from our hotel on a Saturday late morning. Wa","useful":1,"cool":1},"otwqCOMbZrinZWHA_4ILpw":{"text":"Nice ambiance, get a table upstairs if you can. We had po' boys, they were good. Service w","useful":0,"cool":0},"lQOdux_0iePe_FbHT7sHVQ":{"text":"Excellent food. Great service. The Southern breakfast is huge. Great for a hearty appetite","useful":0,"cool":0},"b_olrv0gUyirC2jFRw1Ruw":{"text":"This place needs a new hostess. I visited here on 2 Sep 17 around 1 o'clock. I walked in a","useful":0,"cool":0},"dx8EqJfqvIItdY6UWlxXNg":{"text":"Beware the dirty door.  If you are brave enough to walk past them, then you are at your ow","useful":0,"cool":0},"F04lYmctTWTIhjTTr12r0w":{"text":"Our Waiter was Easy Joe.  Been here for 3 days and he gave us the best service we have had","useful":0,"cool":0},"CdLIssG8sOluMYKb3HnwaA":{"text":"This is great breakfast and lunch cafe. The menu is very diverse local New Orleans flair. ","useful":6,"cool":7},"rsgY1XKEPMEFnTgSWuQYbg":{"text":"A must eat at. This place is a true New Orleans eatery for breakfast or brunch. Banana Pec","useful":0,"cool":0},"BjhpOr6bcV6V8TyAVIUQ3Q":{"text":"Floor super dirty. I should have listened to previous reviewers.  The waitress' aprons wer","useful":0,"cool":0},"-Ji0JlEbtDjzcC4HgLwIWw":{"text":"Our waitress has been on her cell phone texting for at least 10 minutes. No drink refills.","useful":0,"cool":0},"4jOGRO_2794fN39iH6QZ8Q":{"text":"Went to 4 different brunch places which all were amazing and this was the best by far!  Se","useful":0,"cool":0},"O5lOski-cnZaHm8gCYfq0w":{"text":"This place was great from the hostess to the waitress all the way down to the food.  I ord","useful":0,"cool":0},"3ttO8lSCW8aLivg4USH-zA":{"text":"A Coworker and I went here to eat in October during a very busy time and the food was exce","useful":0,"cool":0},"h8YEyXk1KtdoyBNmE_j_Pw":{"text":"The space is super cute! We were seated upstairs near the huge doors, which were open to t","useful":0,"cool":0},"pvyykBqkn9P86b6_uNEQCg":{"text":"This is an amazing little breakfast place in the French Quarter. Their seafood benedict is","useful":0,"cool":0},"AU3STYGE55jkLaV-qT7W0w":{"text":"Really was looking forward to the eggs Benedict but sent it back twice. Eggs are pre cooke","useful":0,"cool":0},"0xcQIl9EDIaZ-vLJ8GD6og":{"text":"My husband and I went here this morning (5/23/21) for breakfast and had a rather poor expe","useful":0,"cool":0},"h15btXe1SLJxJuQLmaq4kg":{"text":"Taking our last morning stroll in New Orleans, and came across Cafe Fleur de lis. Great st","useful":0,"cool":1},"8SSmhYKpFNtS9StL7915oA":{"text":"Found this cafe thanks to my fellow yelpers after walking to cafe beignet and realizing it","useful":4,"cool":3},"y4klD9KTVIsqf0xFP4nxug":{"text":"The best grits I have ever tasted!!! Stopped in for breakfast & no wait time. I would defi","useful":0,"cool":0},"fgTSPBzgUd-k_S7wa0t88Q":{"text":"The line can get pretty long during food times so get there at an early time or wait in li","useful":0,"cool":0},"Fd_yfEwG5KmhozSCFX--lQ":{"text":"My omelette was delicious and they make amazing grits!   The service was very good - I hig","useful":0,"cool":0},"prPrPKbKWlTAuBgyJW9qtA":{"text":"O M G!!! I had the big easy breakfast platter and it was amazing!!!! The grits are phenome","useful":0,"cool":1},"z3zlin0-cJPK8Vw3z4mcBg":{"text":"What a quaint cafe in the french quarter!! I had some breakfast! pancakes, candied bacon &","useful":0,"cool":0},"DrLnY91FacCZ1t-teXHxQQ":{"text":"I have never had shrimp and grits that was so delicious I cannot emphasize enough perfectl","useful":0,"cool":0},"TnO9x4sQG_5vZL-F5lpLXQ":{"text":"Service is quick and staff is friendly. Food was reasonably priced and exactly what'd you'","useful":0,"cool":0},"GUth3jN9WL2ywkI9BKpjPA":{"text":"Small breakfast place in the French Quarter with pretty good food.  The eggs were cooked p","useful":0,"cool":0},"k03QF_M7MWEGaAUSgidNcQ":{"text":"I went there alone for breakfast. After booking my reservation through yelp I walked over ","useful":0,"cool":0},"e7tE-TkE0cM95aSIUeN8Gg":{"text":"Long wait means they serve good food!!\nKinda a hard place to find and if you're not paying","useful":0,"cool":1},"oUBIgJEYrbVUOu6ox7UkgA":{"text":"Wish I could give this place 0 stars. Waited 35-40 mins to seat a party of 3 and we ordere","useful":2,"cool":0},"WYL-SbkzI2s-6vvQJAVKaQ":{"text":"This was a good brunch spot to have. The pancakes were amazing, the fried chicken was just","useful":0,"cool":0},"1NI-jk2-K1DpLXg4JjGFRA":{"text":"Outstanding food, super nice staff. Gemma was an awesome waitress! Would come back in a he","useful":0,"cool":0},"djKsndWqoP7sdGwNo6kuAg":{"text":"Absolutely delicious. I don't get seafood for breakfast but the Oyster Benedict was amazin","useful":0,"cool":0},"50pgouCH9LHvPJ5vFvFA1Q":{"text":"Good breakfast and staff... the hash browns are killer but the coffee is on the mediocre s","useful":0,"cool":0},"l9hYKL_GXSXkIBliXM9pDg":{"text":"Stopped by on our way out of town, was not disappointed! We had Shrimp and Grits and it wa","useful":0,"cool":0},"e9-OacmivC_JaQY4UCCHXw":{"text":"Went to this place for brunch during our road trip stop to New Orleans and it was deliciou","useful":1,"cool":1},"o-h6IyByNzjU69Z1FaKDLA":{"text":"I wish I could give this place 10 stars!!! Not only was the breakfast amazing, but the ser","useful":1,"cool":1},"6CWINSeU-wpRoLN14nV2DQ":{"text":"Nice size portions. Food was good nothing to blow me away. I was able to share food with h","useful":0,"cool":0},"luaeE3rXvNlXgkiyvSrPJQ":{"text":"Ok another new one for NOLA and it was worth the stop. Seafood Benedict is a great blend o","useful":0,"cool":0},"oO5qzZgVpCiDhSX90VNIPQ":{"text":"I would love to give it 5 stars but I can't. The French toast was underwhelming.  I wanted","useful":0,"cool":0},"A6GIFjSxs2wiAp0Plw3m9A":{"text":"tl;dr   Very disappointing. Weird experience overall. \n\nThe only good thing was we didn't ","useful":3,"cool":0},"q0Bh2jBQfgUUFWlIySPb7A":{"text":"The first day we tried to get to-go Bloody Mary's but we were completely ignored so we lef","useful":1,"cool":0},"3TeeG9TqxOD-MeSQ6ofzYg":{"text":"DO NOT GO HERE! This place is beyond horrible. First the service was horrible. We told to ","useful":1,"cool":0},"wBIfSlgzHV_F--S-DTv0Yw":{"text":"We got the seafood Benedict and fleur-de-lis omelette. All very tasty! Grits are creamy an","useful":0,"cool":0},"rVxE4RnF3qDF5UvikUG3kA":{"text":"My boyfriend and I came here on our last day in New Orleans and this place did not disappo","useful":7,"cool":5},"pxqYRwZvKDgkxqy2gqJisg":{"text":"Great food!  Crab and shrimp omelette is the bomb.  Cheese grits - wow!  \nOnly negative wo","useful":0,"cool":0},"A7_DUnoBMAXosnCe8yQo9Q":{"text":"We were seated promptly by and then served by a very sweet and attentive woman named Stori","useful":1,"cool":0},"LnLCwqQBPmu0pV_NR0aItA":{"text":"Impeccable service and delicious food!  Our party of 5 was initially put on a waitlist whe","useful":0,"cool":2},"9DakkNsAGDx6Joref2LPAg":{"text":"When I visited New Orleans recently I went with a group of friends to Cafe Fleur De Lis. I","useful":12,"cool":11},"GqSYbIEwR4hqcUd_DkKKaQ":{"text":"Oh what comedy there is to be found in a restaurant door that won't close by itself. I was","useful":0,"cool":0},"fwY2RSqO_JSEad9dcoFTog":{"text":"Started out good until we found a damn RUBBER BAND in my food! \n\nI ordered the kids French","useful":1,"cool":0},"1zUtq3mduHMPrYZh-xaTig":{"text":"We  went  here for  breakfast   3 times  while  staying at the  Monteleone.     Very  well","useful":1,"cool":1},"3vSIW35PaEVcFOh4qW11ag":{"text":"If you go to New Orleans, you need to come here for breakfast and get the grits. I could h","useful":1,"cool":2},"ENHbMn9opfdKfpioGEX7aA":{"text":"Good food and the service was excellent.  I sat on the balcony and had a nice view and bre","useful":0,"cool":0},"Nj1clvoxiH3wCydg4-cURQ":{"text":"Great place to eat!  The bacon Bloody Mary is is amazing!  We were there for breakfast and","useful":0,"cool":0},"12yonY14B0uThvap1f6swg":{"text":"Maybe the breakfast is good here, but lunch was meh.  The chicken  caesar was served on ic","useful":1,"cool":0},"YnJvbygoZQ6k2hEUTDRzMg":{"text":"Everything on our two plates was over cooked or burnt. \nOne star for the waitress who trie","useful":1,"cool":0},"3ulooOHzOdO3JedebSr47A":{"text":"Seafood Benedict was fanTAStic!\nGrits were excellent!  Coffee was hot and the service was ","useful":0,"cool":0},"4fhcoL9vVJ9od7apzCt0aQ":{"text":"We stumbled upon this place after waiting for 30+ min to be seated, acknowledged at a vega","useful":0,"cool":1},"Ysdp4iPl5h9iDnFx7whVFw":{"text":"We liked the breakfasts here so much that we ate here 4x during our New Orleans trip and h","useful":0,"cool":0},"yAxazWVdpSdbzQ2JQ3FwmA":{"text":"Great breakfast and friendly service! Our waiter, Richard, provided great suggestions. The","useful":0,"cool":0},"2hrzXrG1Ukc0Yni3fLQV1g":{"text":"I recently visited New Orleans to celebrate my cousin's reign as the Queen of Sparta! Hail","useful":0,"cool":1},"bFTH9iDEji4tfzeoWoSxGQ":{"text":"We were looking for a good breakfast prior to exploring the French quarter and this looked","useful":2,"cool":3},"Icpcj6Q6I_FkP92564COHw":{"text":"My daughter picked up breakfast, and was in AWE!!! \n\nQuickie reviews:\n\n*Shrimp & Grits: am","useful":1,"cool":0},"xUHSoVKTNg3UftLlxMLZHA":{"text":"I came to New Orleans literally just to eat. Do a few tours, but mainly to eat. \n\nI decide","useful":6,"cool":8},"kw2sMDi1bFBFdQY6SDWKZQ":{"text":"Enjoyed the friend green tomatoes. Drinks were all right, nothing special. Friendly staff.","useful":0,"cool":0},"eMmVqWDngbQziHb2GSfHbg":{"text":"You can put your name down and they'll text you when they are ready! Then you dont have to","useful":3,"cool":1},"xq8zfniWKtwSE-r1WGnLOg":{"text":"Enjoyed the delicious brunch here on our 2nd day in New Orleans\n\nHurricane is our local dr","useful":1,"cool":1},"mEG_0699Wb3t1Xopkp44dg":{"text":"A great place for seafood lovers and vegans! They have a bomb tofu scramble w/ peppers oni","useful":2,"cool":0},"_6MvWbG6WrF-I2Hto87pSw":{"text":"Cafe Fleur de Lis was my favorite brunch spot when I visited NOLA two weeks ago - and that","useful":3,"cool":2},"66DtMLWBitGngzMzZoHZIg":{"text":"This was our Fourth time Here, the Food is Awesome and the service was Quick!  We will be ","useful":0,"cool":0},"a6cO4phC_xK1QJK17azo0w":{"text":"We enjoyed this quaint cafe so much!! Upon arrival, the wait was approximately 45 minutes ","useful":1,"cool":0},"5VR7fA2xbgcLnoWyDpzMog":{"text":"My goodness. This breakfast knocked my socks off. \nI had shrimp and grits, my husband got ","useful":0,"cool":0},"SHQqYTqVIjeZGTMUXItFCQ":{"text":"Solid breakfast place. Nice location. \n\nThey have all the standard breakfast fare. It's no","useful":1,"cool":1},"Zh6Mfnb2bOvRU-1iTigN1A":{"text":"Excellent food, made with care and delicious.  Benedicts are awesome.  Friendly staff and ","useful":0,"cool":0},"-iblB-ljM_5B4ETfdxJm3g":{"text":"Nice brunch spot. COVID restricted the amount of patrons, appreciated that. Enjoyed the fo","useful":1,"cool":1},"yQ13xT0Nkk_G4LlO7Eym9w":{"text":"This place was a gem to find not too far from our hotel.  I came here for breakfast with a","useful":2,"cool":1},"PPB0g7iJn6iS7pbBqAOHng":{"text":"Very cute little breakfast joint! The Oysters Benedict was delicious! Latte was very good.","useful":0,"cool":1},"twV_mT7eYPKaNx0m7J22bg":{"text":"Great Bloody Mary \"get with the bacon\" worth the extra, ohhh and the cheesy grits are amaz","useful":0,"cool":0},"iIecDWxlE_8rTLjo33SOTg":{"text":"Such a good breakfast/ brunch spot in New Orleans! The service was excellent and the atmos","useful":0,"cool":0},"Y91h4-Wv7OcYmx80iogHww":{"text":"Wow! Let's talk about the seafood Benedict ! Wish I can have seconds! It was definitely wo","useful":0,"cool":0},"LoSi_XnzMR17u9S4N07bZw":{"text":"Good came a bit cold.  Bacon and sausages were good. Pancake could have been better, omele","useful":0,"cool":0},"7KiW3MksAqSTDQUTanqJjQ":{"text":"Perhaps my expectations were too high after reading some rave reviews. I was expecting ext","useful":0,"cool":1},"yq7ew5-Ez68kdaue6jNggA":{"text":"This cafe was okay. Their cheese grits were great. The breakfast sandwich and boudin omele","useful":0,"cool":0},"v36KI5tOunV3YjKgTEBCFg":{"text":"Secret gem in the French Quarter. My favorites are the oyster Benedict and the pancakes. I","useful":1,"cool":0},"u61n_Rfo_43NT1-ONu8JFw":{"text":"The eggs Benedict and the pancakes were great. If it's warm sit near the balcony for a gre","useful":0,"cool":0},"J_AMfjxlek-j0bXvYulIAg":{"text":"Solid 4.5 stars. I loved their texting system and how they let you know exactly when your ","useful":10,"cool":4},"d1eP9FH9XHUPzxH2cg1CXQ":{"text":"The food was yummy! The pancakes were the star of the show. Absolutely loved them. My only","useful":1,"cool":0},"OuZeU23SVJLARjmHBC3r-g":{"text":"Great food, and reasonable service. I'd love to give them 5 stars, but unfortunately the c","useful":1,"cool":0},"HIDbIOdrfudk9QB4LNe_4g":{"text":"We came for brunch and it was SO good. Cute restaurant and great service. I got an iced la","useful":0,"cool":0},"QD5izDHkrbzYhonw3zxz1w":{"text":"This is my second time visiting this spot. After a brief wait, I was seated. My waitress, ","useful":0,"cool":0},"bO2DaPK-Z6ImGoS_v4sIpQ":{"text":"The staff there is not very friendly. I got eggs Benedict which was covered in way too muc","useful":1,"cool":0},"fqyRV77h-v1dR97g4i4jmg":{"text":"I ate here because of the reviews and the history. I came here alone because my husband wa","useful":0,"cool":0},"VXCW-3pVxBLW8X30kaTSyw":{"text":"It was cute, the staff was awesome, and the Food was Amazing.! In our Group we had the Sea","useful":1,"cool":1},"thuDOxitowY5S5_u0C4XmA":{"text":"Really great find! I've always loved cafe Envie around the corner and was so sad to discov","useful":0,"cool":0},"Gogk_gPmkuQU6UpMllQ9BQ":{"text":"We had the seafood Benedict and French toast. Best brunch we've had! Portion sizes were pe","useful":0,"cool":0},"HfzU0tU7jJThNFWWWUctmg":{"text":"It is a 2 floor restaurant, it has a lot of tables and waiters, we went on Halloween weeke","useful":0,"cool":0},"rR7MDwdv4gJuOYI7e7PZcg":{"text":"We walked in at just the right time. Long line soon after we showed up. Was not impressed ","useful":5,"cool":4},"5CnYIzkHJ3goMYu55vIamg":{"text":"Super cute little restaurant. As a warning, the no line portion thru Yelp does not work, a","useful":0,"cool":1},"3Efp3LdVa9WOcUKVowP1bA":{"text":"Went to NOLA on a long weekend for New Years.  Eat here at least twice while in town.\n\nFir","useful":0,"cool":0},"VzEQ8QuThD0YuJxF0qmiDw":{"text":"What a gem!  Cute restaurant and delicious food. Our favorites were the Shrimp and Grits a","useful":0,"cool":0},"-J2hgg3bvhxVGNA9iJrhyg":{"text":"Oh my gosh!  This place is amazing!  From the waitstaff to the food, I loved almost everyt","useful":1,"cool":0},"9B01fp-Fhp2soS5xCXxk5g":{"text":"The food is AMAZING. Someone suggested we grab a bite here when we checked into our hotel.","useful":2,"cool":0},"gIX549W1UB5FICieIzUxRQ":{"text":"Had the crab catch  omelette with a Side of fried green tomatoes ! Oh my goodness deliciou","useful":0,"cool":0},"abuPlbm99wB7e6kovKn-NA":{"text":"If you go out for breakfast at all on Bourbon Street it has to be this place! Amazing food","useful":1,"cool":1},"hktjFhxyZeleC5lvWT7OVQ":{"text":"A group of friends and I (5 total) were told there would be a 45 min wait and they would t","useful":0,"cool":0},"dbQf2QAXdPZTWHv1-HgsGA":{"text":"Waited 65 min for our food. Didn't have French toast , how is that possible.  Than breakfa","useful":0,"cool":0},"GyjqrlB9u-G21VwlC448xg":{"text":"Best breakfast here.  Must try. The best shrimp and grits, ever.  The sausage gravy was am","useful":0,"cool":0},"Oqr_x5XSm2t4NZF38QzSTw":{"text":"This place was cute and cozy. Stopped by on the day of departure for a quick breakfast. Th","useful":0,"cool":0},"PTLQqC06llLIwbwNSpAvrQ":{"text":"We looked for a New Orleans experience for breakfast today. Found this place and hoped for","useful":0,"cool":0},"rZtZLdnuEKFLlFOVdMPfJQ":{"text":"This place is delecious.  Small wait, yet worth it.  We had the boudin omelet, the prosciu","useful":1,"cool":1},"_vU1fKjHT8Er5Ob1_s4lNA":{"text":"Yep Yep Yep! This spot was our go to breakfast spot while in NOLA. Every morning/afternoon","useful":0,"cool":1},"M9dqOukRdT_FUS65OWiPLA":{"text":"Perfect southern breakfast in a great location. They will text you when your table is read","useful":1,"cool":0},"40PRhY3mSNPRdrENMU_kLw":{"text":"Apparently, I need to get to the French Quarter more often.  I had a Friday off and the we","useful":2,"cool":1},"en_xhsbi68zVxk6vz_UV8w":{"text":"Stop in here after waking up and finding a spot close to the room. Wasn't really sure what","useful":1,"cool":1},"LYFL-S3XL-NZtfimg2kcPA":{"text":"Great Food, Great Service, Frankie was very attentive and had great recommendations and ve","useful":0,"cool":0},"BNpVUj9RjPdHYbc3FF0FiQ":{"text":"Luckily got in early without a wait - but a wait would be well worth it. The food is outst","useful":0,"cool":0},"Jxc4vBnAF-HSR2upRiRJjA":{"text":"As good as all the reviews say!!! Soooo refreshing just to be able to sit down and enjoy a","useful":0,"cool":0},"JtZKTiCQqkQi7W7jhXKY_g":{"text":"One of the most delightful brunches ever. We got lucky and 1 of 2 balcony tables. Will def","useful":0,"cool":0},"NpfV_mlpDR6o5iM8QgpK9g":{"text":"Our favorite for breakfast in New Orleans. Often a wait but WELL worth it!  Can put in you","useful":0,"cool":0},"ko4U2qO1sUctDMa6cJdW3w":{"text":"One of the best breakfast places in the FQ. Good food, huge portions and fair prices. We s","useful":1,"cool":1},"ljJfcswzqwCnRYKaZ1dVdw":{"text":"GREAT FOOD & SERVICE ! My wife and I were in New Orleans not long ago for a music festival","useful":10,"cool":8},"x8c6_sjDeZ9yWC1MtbIsUQ":{"text":"Had a great brunch during our visit to New Orleans. There was a thirty minute wait to get ","useful":0,"cool":0},"eaGNfHRYVyweSNj8GMj7Uw":{"text":"Stopped for breakfast & had to seafood Benedict. 10/10. Very delish & perfect way to start","useful":0,"cool":0},"hQkmzBLM3vXSxdIbhy4Hxg":{"text":"Visited New Orleans for work and wondered around looking for a place to eat.  This place w","useful":0,"cool":0},"emKKwAGf5of4h-FYm_14gA":{"text":"This used to be one of my favorite restaurants and since were filming a movie here and I'v","useful":3,"cool":0},"CKEPtJ3aifKI3ktXb_fygw":{"text":"Honestly they have the best hash browns around. Maybe it's because I'm not a hash brown ty","useful":3,"cool":1},"B5sfQimCfJEVt7y8c8XcIA":{"text":"Breakfast was good and hearty. Portions were big. The line was out the door but it moved q","useful":0,"cool":0},"09RyuLqnw1Ck_ALaT8XWuQ":{"text":"Host at front is terrific. But was unimpressed with food. Sunny eggs way too runny. Bloody","useful":0,"cool":0},"nHxT4n2uJaw0EttVvY6YLQ":{"text":"THE best breakfast spot in NOLA. Both of the dishes we ordered were amazing. We went on a ","useful":0,"cool":0},"AOP57OFNEZSYwYSoCSklvg":{"text":"This place is amazing the food is delicious. Shrimp and grits for breakfast were delicious","useful":0,"cool":0},"zxCApH7gK7JVTofynTBJew":{"text":"My family and I ate here on our second day in NO, everything tasted great . Also good port","useful":0,"cool":0},"9jU6CnXkZSiqsTLGzYXW-g":{"text":"The food in this joint is OBSCENELY GOOD!!! The seafood Benedict was out of this world!!!!","useful":0,"cool":0},"YMVltW_3MdeyHD07gS2wlA":{"text":"Food and service was excellent and the best grits I have ever had!  If you are here and wa","useful":0,"cool":0},"5scMylF75p3MNvllwNvF3w":{"text":"Omg this place is so good and big portions! I was looking for boudin all over the French q","useful":0,"cool":0},"TBzUxxTkvBCTO-b-2q6RUg":{"text":"We never got a chance to try the food, we were turned away by a very rude manager. We (par","useful":0,"cool":0},"siSpwQJLkL0VWSuUfyUhnA":{"text":"This place takes classic breakfast dishes like eggs Benedict and eggs Florentine and ruins","useful":0,"cool":0},"rNJ993OCxFve0MYH3qQVyQ":{"text":"Wonderful shrimp and grits. Service was perfect...make sure this restaurant is on your lis","useful":0,"cool":0},"_gHRv_OvJ59ovFJrZI6S4w":{"text":"best breakfast place! the pancakes were so fluffy and chocolaty and also the bacon was spe","useful":0,"cool":0},"VeOdz2MYv4QWsjG8pep_7w":{"text":"Really thankful for the wonderful service that accommodated our group of 9. Our server was","useful":0,"cool":0},"EtP-necuK93YqXnnWL20tQ":{"text":"Food: Tasty (Shrimp-n-grits, hash browns, egg Benedict)\nAtmosphere: just right!\nWait staff","useful":1,"cool":0},"3uwGZQoJGAlf_uo5jSNsRg":{"text":"Just finished an amazing breakfast, and such a cool spot! We sat upstairs and had a cool v","useful":0,"cool":0},"6lTUuXMq4CnSeh1d48fQlg":{"text":"Our brunch was out of this world!! I had the crawfish/crab cake Benedict which is absolute","useful":1,"cool":2},"CIlJb7BzOr9DXapYsv3fRg":{"text":"Admittedly, I was swayed to visit here because of the photos uploaded by other Yelpers. To","useful":1,"cool":0},"U-LBztM6Ni09P6NzBtDX6g":{"text":"The food was amazing. Words actually cannot describe how delicious the oyster Benedict was","useful":0,"cool":0},"6b_BVoE980yospaB58eQyA":{"text":"We met friends that my bf played football with in the day! Service was quick, drinks stron","useful":0,"cool":0},"CH7jqLtGfxAM9CGs6vsMjw":{"text":"If you're not looking you'll walk right by this cute little place. I got the eggs Benedict","useful":1,"cool":0},"zEaFzxdDFq_c2nMUz5laCA":{"text":"Sometimes coming to touristy towns like New Orleans, you'll find that restaurants have rev","useful":1,"cool":1},"hxk_IaxQzGOloX72TxrwtA":{"text":"Food is good!! After a canceled nail appointment in the canal shops my mother and I hit th","useful":0,"cool":0},"-0WZFeE52BVsuvitbqPhgQ":{"text":"The food was below average or average.  I ordered the crawfish etoufee, and it was extreme","useful":1,"cool":1},"SLaV91DAqeZd9DTp-vksAw":{"text":"This place is adorable. The food is good and the vibe is nice. Definitely check this place","useful":1,"cool":2},"LRf6jqHNO_mQBc7Zoxvz2Q":{"text":"Came here for breakfast on a Sunday morning with 4 people. The wait was about 25 minutes l","useful":1,"cool":1},"FH5EGEphohqJrG7GQiQEbQ":{"text":"This is one of my most favorite spots to eat a good NOLA breakfast. The wait isn't terribl","useful":0,"cool":0},"7dRkISoCFMGVn2z6KPNBiA":{"text":"We decided on a late brunch so we came here.\nIt wasn't crowded so we were seated immediate","useful":4,"cool":1},"KjksbOZUZ0HNWw6hU3X12Q":{"text":"Very walkable from Harrah's Casino. It is a sunny Monday. Face mask is required to enter. ","useful":0,"cool":0},"-bIEuJ6KTL-vqqm6Lch08w":{"text":"Best breakfast/brunch/lunch in the French quarter. Shrimp and grits are amazing. Eggs Bene","useful":0,"cool":0},"QApyXhujzySMZ08wnUc5zg":{"text":"We saw this spot looking for good local breakfast places in the Quarter. The choices were ","useful":0,"cool":0},"bQj5c8blze_8D0IVGHCkVA":{"text":"In a town known for its amazing food, this place should be forgotten.  The atmosphere is g","useful":1,"cool":0},"cE-ZY3DpkAfMSW94fa82Rw":{"text":"Very nice place with friendly service, chill decor, and plenty of seating on first and sec","useful":0,"cool":0},"PNCOwS5KJYI1lZOLdErDWA":{"text":"Absolutely fantastic food.  Ate there two days in a row. Their grits are like heaven on ea","useful":0,"cool":0},"MGjHuPPK95XsqTJs4fZ5Lg":{"text":"Reasonable prices with huge portions, an extremely nice staff, and the location would all ","useful":0,"cool":0},"9b__HBLX11aYodDLeC5MMQ":{"text":"I had breakfast here once before on a previous trip.  Although I don't remember what I ord","useful":0,"cool":0},"knNYZMjHE-GrO7dCFpgrbg":{"text":"The pancakes for the big easy breakfast was amazing I loved the pancake batter used for it","useful":0,"cool":0},"vYr-qVW65qBvvgU5gQWgng":{"text":"Amazing breakfast! Super tasty pancakes and the best bacon I've ever had. Very friendly st","useful":0,"cool":0},"b2lt8r0HvpuPG7Gs9M0Z8A":{"text":"Pssstt...there's boudin in that omelette. \n\nAlso, @cafefleurdelis just took the #1 spot fo","useful":1,"cool":0},"J1kTCAoYAFkKO_paO9rpkw":{"text":"Eggs Benedict with fried catfish and grits on the side.  King's Cake beignets.  All delici","useful":0,"cool":0},"ikRHQr9E2IGnQeN0fMVdVw":{"text":"This little gem took me by surprise  on how delicious it was, there was no wait, our waite","useful":0,"cool":0},"vX1PFrfcK9FWZFfZooyQ4Q":{"text":"Waited for 25 minutes which wasn't too bad but to wait another 55 minutes before food was ","useful":1,"cool":0},"o_-ulYmTpzzBUy8pWIRaSA":{"text":"AWESOME BREAKFAST! To die for! A must do in New Orleans! I got the southern breakfast and ","useful":0,"cool":0},"HVIvm6K0UpSUjUic-tYgQQ":{"text":"Excellent food, excellent atmosphere. Our waiter Hunter was fantastic came over and checke","useful":2,"cool":2},"hFRWKxp_gtIOsDzN7wJcYA":{"text":"Very good breakfast here. We liked it so much, we went there the next morning for breakfas","useful":0,"cool":0},"vb9Dg8Tm6fz8pawZbZFXWg":{"text":"Great breakfast and coffee.  Had the eggs beeneict    Awesome hash browns and homemade bis","useful":0,"cool":0},"-Jr0URAJP3XhUHuf9Z9RMw":{"text":"The best brunch place ever. Super small but worth the wait. Strawberry mimosas. Bloody Mar","useful":0,"cool":0},"GJtc04teGVrisFMBaJNmyw":{"text":"We stopped here on our way back home for breakfast, and had a disappointing meal. We came ","useful":0,"cool":0},"J6lqgK-1UDmFnLrCKosGaA":{"text":"They do a great breakfast. The boudin was on point and the service was really good. Very f","useful":0,"cool":0},"2NyVkkTkI73mhPixwiR7iA":{"text":"The food here is great for breakfast. Nice portions. Egg dishes we well loved by everyone ","useful":0,"cool":2},"JQn7hJaQ09--DuwAl5h2rw":{"text":"We had a veggie omelet and seafood Benedict and they were both very good. The service was ","useful":0,"cool":0},"2oCfTyZrlP3BcF9oIJnA2w":{"text":"Wait was not bad, they'll text you do you can walk around. Muffuletta hot and so yummy. Sh","useful":0,"cool":0},"CFDkweVMYRBHJ-hhX06DpA":{"text":"Excellent breakfast...excellent lunch.... excellent dinner. These folks know how to run an","useful":0,"cool":0},"kIRFAHJ5gahy_yv6ckOwZQ":{"text":"A very average street cafe with food I wouldn't qualify much higher then decent. I had the","useful":2,"cool":0},"z2zspDS9ZHfnU1lYGI95yg":{"text":"Disappointing first meal in NO. Seafood Benedict did not look like the pictures. Hollandai","useful":0,"cool":0},"UEfLwO8KrHEWeR0iB4q4CA":{"text":"We wandered into Cafe Fleur de Lis randomly on a Monday and were blown away. We're picky B","useful":0,"cool":0},"4KHhDha0uy-mPBcHOITm3w":{"text":"Friendly staff, cute little place. Had the farmers omelette, delicious. Coffee cups big en","useful":0,"cool":0},"nrTiDudVRWQaxSIJqvuZqQ":{"text":"The only reason I'm giving two stars is because the service wasn't terrible. The food here","useful":0,"cool":0},"NpOjgvQ5lBM70mQ2-amAgQ":{"text":"If you want to see someone that absolutely hates their job and is ridiculously rude, ask t","useful":0,"cool":0},"mvKVHsgF-pDn8lFlokN8ag":{"text":"The best breakfast we had while staying in the French quarter . Seafood Benedict was excel","useful":1,"cool":0},"hHg6OUi8YgBZ5ScCTt3wXA":{"text":"Staff is very rude, and no one seemed to want to be at work.  Food was bland and hardly ab","useful":0,"cool":0},"BuHggcGt1DutlNT1T2emKQ":{"text":"Left a lot to be desired. Food took a million years. Waitress was really sweet and accommo","useful":0,"cool":0},"3hLdOmn1S6s0DQiSKkRR5g":{"text":"Came for breakfast on a Sunday morning and there was about a 20 minute wait for a table fo","useful":0,"cool":0},"zqN4ipqMr20Bc43lgXQBMQ":{"text":"If you do anything when eating here get the pancakes!!! Also, the grits (even without chee","useful":0,"cool":0},"upJTKy64RBOKIZk5d60vkw":{"text":"Cafe Fleur is where I had my first meal in New Orleans and it did not disappoint! I ordere","useful":0,"cool":0},"GifTTW3Ekb78EWUf6K9P9Q":{"text":"Wow....my husband actually said it was a really good breakfast and there is nothing he can","useful":0,"cool":0},"1lF-c0cjk1O0LoKg-w0Prw":{"text":"Freaking GREAT breakfast! We stuffed ourselves on pancakes, eggs and their awesome hash br","useful":0,"cool":0},"NUhs7QLp451Kll6tQ2MgPQ":{"text":"Amazing food and our waitress was awesome! We definitely want to stop in again before this","useful":0,"cool":0},"wwEf187HXpi7xh5mOEQydw":{"text":"I was looking for a quick breakfast before I needed to head to the airport and this spot w","useful":0,"cool":0},"fHMQ8uQ_YsLyIa1ZmJcTXA":{"text":"I'm so glad I was able to grab brunch here! There may be a wait time if you come in the mo","useful":6,"cool":6},"WLKZB7byjsKe7pH9AJ0v2w":{"text":"Hunter was a helpful server. He was very friendly and made great suggestions. We only wait","useful":0,"cool":1},"wLpHwUi_KxjGx3oMR0izug":{"text":"This place falls in that 3.5 star range. My pancakes were good but not earth shattering as","useful":1,"cool":0},"zTlYNx_sRqt6VmPErnz6ZA":{"text":"Food was descent, service was okay. SUPER HOT (no AC). Not a bad place to visit but tables","useful":0,"cool":0},"9P0iZsG4dhHfmhmBlb9qpw":{"text":"Breakfast is medicocre. Good location and service was ok. The food leaves quite a bit to b","useful":1,"cool":0},"NRrvMD2HzQzPOUnUCi_Dog":{"text":"Best omelette I have ever had\nFresh and delicious. Coffee was hit and strong \nHash browns ","useful":0,"cool":0},"OliBND-TEk_ZROQNMBX63Q":{"text":"Friendly service, and lovely balcony where you can people watch. Shrimp and grits were sol","useful":0,"cool":0},"fto5m5mEXGS34ZiQMmwqUA":{"text":"Great breakfast! Highly recommended. I had the Creole Country Breakfast with cheesy grits ","useful":1,"cool":0},"KWSfJSNxKmAXCZ3YIfdCQA":{"text":"Walked in randomly hoping to get some breakfast. There was a bit of a wait, but we killed ","useful":2,"cool":2},"cGWZXgFRIwanfA7nzrGcPA":{"text":"Pretty tasty food. Busy place but they were able to get people in and out pretty quickly. ","useful":0,"cool":0},"EAxe0GtQE2bW-pRCPyXP7Q":{"text":"Super great spot to grab early breakfast/ brunch. Great atmosphere polite servers. French ","useful":0,"cool":0},"BOlmK4pYOO0Vb_CDQmBCIg":{"text":"Bonjour mon ami! \n\nCafe Fleur De Lis is très magnifique!! \n\nThis was a great little discov","useful":30,"cool":29},"mxqNgTFWGn2yHeolnEPq9g":{"text":"The food was SO GOOD. Do yourself a favor and skip all the other \"typical\" breakfast stops","useful":1,"cool":0},"-lkquGtAsJpm7MSJGYTMPA":{"text":"Solid choice for breakfast in the French Quarter.","useful":0,"cool":0},"KXUewE1wk6y6sGmnRjigKw":{"text":"Chef should learn how to poach an egg! Service was great  food for the most part was good ","useful":0,"cool":0},"p5StoMv9WlnOGM_qxLWfag":{"text":"Best grits of my life. This place was a nice hole in the wall that had great options. I wi","useful":0,"cool":0},"eDU4wKLUBLOainhbNLDuBw":{"text":"Loved this place food was really good, staff was super friendly, the place is cute and has","useful":12,"cool":8},"6oMGzXyMLbOlb6h3V9vH8g":{"text":"Stopped in based on a recommendation of a local. It was worth it. The grits are to die for","useful":0,"cool":0},"PMvB1uXIwoYETYbSmmTC2w":{"text":"My favorite breakfast spot in New Orleans. It helps that it is 1 block from my hotel. Best","useful":1,"cool":2},"kx_FyJFxZ86G2pYu5Prydg":{"text":"I gave three stars because my partner's omelette was delicious.  My issue was the wait tim","useful":0,"cool":0},"pjd65F1fiO5W5iqE3VuzeQ":{"text":"There are plenty of choices for breakfast in the French Quarter but this one is definitely","useful":0,"cool":0},"cvwEw6YDxNnfDRt5KPEo7g":{"text":"The place is nice inside and the service is great! I got the pecan pancakes, bacon and has","useful":0,"cool":0},"U7x67SBP_VbS257OtgItiA":{"text":"Great food, reasonable prices, and friendly service.  Cafe Fleur De Lis offers food that i","useful":0,"cool":0},"PXLfppM15PffKwmhWOVH3w":{"text":"This place serves breakfast all day, and I love that! Especially when their breakfast is s","useful":2,"cool":1}}