{"sK9_aXP1NtCvoOZJ4TH7rQ":{"text":"If you drive down Gentilly or Elysian Fields, you probably wouldn't notice this place tuck","useful":5,"cool":2},"ccXdonPX9zx2XrgBa9J1Hw":{"text":"Helpful and efficient. I've used their notary, fingerprinting, fed ex, computer, and print","useful":1,"cool":1},"ZuDRz4NZtpgWjhL7mzalQQ":{"text":"Went here to get some paperwork notarized. The first signature is $15 and the rest were $1","useful":1,"cool":1},"e6zC_eWvmt7Nd-ZY-nRvGA":{"text":"Money Hungry!! I would give this place no stars but for the sake of the review one star. T","useful":0,"cool":0},"P78I4Pv4VVKrs9LiPc6mCQ":{"text":"I have visited Gentilly Mail & Copy a few times because it's near my gym.  Everyone there ","useful":2,"cool":1},"Rg0Vxk3zgtLpxCg4_US7oQ":{"text":"The best spot for all your nail and copy needs! The employees and manager are all SO helpf","useful":0,"cool":0},"WrlsOXWePLHrU_mcQDvzYg":{"text":"Happy to have them in the neighborhood! Haven't tried their print services yet, but shippi","useful":0,"cool":0},"2w1gK33J3ENzFx_mN0vuKw":{"text":"Seems pretty disingenuous. I walked in there and asked how much it costs per black and whi","useful":1,"cool":1},"EGnXGRAHXOJLEwvCW7Gezw":{"text":"I have good experiences here: i go in with the expectation that my business will be dealt ","useful":0,"cool":0},"BYKTJlU2kP6lIW-QeUTQ-Q":{"text":"I been here to pick up packages and notary and they always do the best they can. And they ","useful":0,"cool":1},"o4hYPWewylyRZUoD_ClBag":{"text":"These guys are amazing! After having absolutely garbage service at Notary of the East thes","useful":0,"cool":0},"SAPn3OMD43NIlOnJPBDXPA":{"text":"Love that we have a mail center in Gentilly. They provide the same services that the post ","useful":0,"cool":0},"HnDn8RPLKiOgoSHWO6wtZg":{"text":"I came in needing quite a few services - fingerprinting, notary (for multiple documents), ","useful":0,"cool":0},"bjSOB2bifQHzTKC_QdnOdA":{"text":"I waited in a slow-moving line with a lot of people in a small space, courting COVID, to d","useful":1,"cool":0},"pg3txctHy0sWJjYignSUFQ":{"text":"Always courteous with short waits and fair prices. This is my go to notary as well. At thi","useful":0,"cool":0},"BmhQofV9U3cEVzVodYTZxw":{"text":"THEY ARE AMAZING; Always polite and very knowledgeable! I love coming here for simple task","useful":0,"cool":0},"8tgcZ8LHWmXBNXn48KYslQ":{"text":"No problem here getting things notarized on more than one occasion and making copies... go","useful":1,"cool":0},"t_rWy55aLrRYMsbJKmpxew":{"text":"I had no idea this place even existed until I did a yelp search for notaries near me.  Thi","useful":0,"cool":0},"7kga6KpEIlNICG6JmL-ctA":{"text":"Great customer service. Walked in and was immediately greeted and asked what I needed. The","useful":0,"cool":0},"hTT-X5zpTSYu3AxWLIgfjA":{"text":"This business is not transparent in pricing. The website was not updated to reflect discon","useful":1,"cool":0},"XOiqeAA8Hs8quVlQrvd42g":{"text":"Gentilly Mail and Copy is conveniently located and is your office away from home store. Th","useful":8,"cool":8},"KZfKlGi7FNhAQNhyPbkW8Q":{"text":"Honestly it sucks at times to live in New Orleans East because there's not that much acces","useful":2,"cool":0},"IB1Ptx23zx1Ar4OjFOzpTw":{"text":"Always helpful got notary, shipping, packaging, professional, smart and the new layout is ","useful":0,"cool":0},"Dg4d9Nc6m8e54czJbwUcvA":{"text":"Very convenient location,  friendly staff, great hours. They are open till 9pm on most day","useful":2,"cool":0},"Fvf-lfTXANQExYzZgH9vLw":{"text":"Amazing little spot for all of your shipping needs. Matter of fact service that doesn't wa","useful":1,"cool":0}}