{"JAydlFmh6yAhZOhgCxfyvQ":{"text":"This was the worst snowball ive ever had in life! The ice was hard as a rock and the syrup","useful":0,"cool":0},"8GcymDkWvfF72NVMoKZnyA":{"text":"Van's Snowballs had one of the softest ice in the city. I had the praline flavor with wedd","useful":0,"cool":0},"39JMztHhu0dOuoJ9d40Ldg":{"text":"The snow ball stand exploration continues! This time we decided to check out an old Algier","useful":5,"cool":5},"BdzzgHCgROIZj2Yiz2qxLQ":{"text":"I had better. Syrup wasn't as sweet and lady was unknowledgeable- didn't even know where t","useful":0,"cool":0},"3RKJlwVBQJHQXEZXpYkR6g":{"text":"I love Van's. IMHO Van's is the best snowball stand on the westbank. They've been there si","useful":3,"cool":1},"sVDuLIyWEqCf3qcn93BP_A":{"text":"I think some people are a little bit confused. There are two Van's snowball locations on t","useful":0,"cool":0},"ozoGQ4aIO_KzUNeiXjgrUw":{"text":"Been going to Van's ever since I was a child and it never disappoints. They have a wide va","useful":0,"cool":0},"L4HFUmVsaMtvEgchjMkUhw":{"text":"Van's Snowball was just the afternoon treat I needed today. Cute lil' snowball stand with ","useful":6,"cool":3},"eLb6O5Dcnhk-GqVpV9pCdg":{"text":"I already adored snowballs but it has developed into a severe affinity now that I am pregn","useful":1,"cool":0},"TJnBRcyVXqVopPcddlfxoQ":{"text":"first thing, they went up on they prices. \n2nd the lady in front me was ordering her 2 sno","useful":0,"cool":0},"YSX-cvCJEEj3m7gleX1apw":{"text":"Classic snowball place. An extensive menu of  delicious flavors like you would expect at a","useful":1,"cool":2},"wF11c5NSVCergw7gvVOsTA":{"text":"I had better. Ice was not crushed enough. The flavor weren't exceptional. I would skip thi","useful":0,"cool":0},"HWPtWil3r6h_Q-X5bVBpRA":{"text":"Van's has great snowballs they have a extremely large flavor selection including being abl","useful":1,"cool":1},"nkweJKnlXRCPnH3dwNx5iA":{"text":"Heard people complaining about the syrup before I even reached the lady at the counter. Th","useful":1,"cool":0},"LkE7qYVobV2KUqR1dPZh7A":{"text":"Love Van's!!! I've lived on the Westbank my whole life and Van's has been my #1 snowball p","useful":1,"cool":1},"WGU_60UkF2VjoeHnJkfC_w":{"text":"This is my second time going there and my last time. The first time I went there was hardl","useful":0,"cool":0},"Di7m5TpizKI2lwE6MaHnnw":{"text":"This establishment needs to do better. I recently got sick on two occasions last year afte","useful":1,"cool":0},"q2In6RCK0bO4RjBccZjngw":{"text":"If you are in the back areas of Algiers, here is a place that you can get your snoball fix","useful":11,"cool":9},"QkNmStisREJzZ18xq_YyMw":{"text":"Syrup was tasteless. Worst snowball I've ever had. Literally the first time in my whole li","useful":0,"cool":0},"hNLC6REYMCG7wu1tVpCnyg":{"text":"Their ice is very chunky and not crushed very well. The flavours are kinda watered down. A","useful":0,"cool":0}}