{"SN8rL1Bvbp0OxkS2nOQHFQ":{"text":"Service was decent and that's why I gave 1 star.  That's where the *'s end!! I ordered the","useful":0,"cool":0},"vLvbJBBHFRPZnrD6SpIcTg":{"text":"The food court at Riverwalk mall has numerous average shops, and this is no different. Loo","useful":1,"cool":0},"djgrOnG-PMlMqblF-EpeLg":{"text":"Ordered the Philly cheese steak with chez-wiz combi meal. Service 2 was slow but it was th","useful":0,"cool":0},"fcLKsHXWk7jOGOgdsAP0Aw":{"text":"The food here was really disappointing. I love philly cheese steaks but this was bad. The ","useful":0,"cool":0},"bAU0T_ctUmoyDydKpVhYzQ":{"text":"Food was just ok. I was for some reason craving a cheesesteak so we decided to give this p","useful":0,"cool":0},"smCyT6WvoKjMjl-o_RoqYg":{"text":"These are not Philly Cheese Steaks. These are thrown together steak sandwiches with barely","useful":0,"cool":0},"7N4PdxiaaiKttqm60veeIQ":{"text":"Do not eat at this place. I ordered a Philly's finest without peppers. I was told it comes","useful":0,"cool":0},"_yDko_h7sg8G_rrj6c3zYg":{"text":"Place is a joke. First of all they ran out of fries during lunch. Fries are in the name of","useful":2,"cool":0},"GqVPzxHkf4pCD70V5H60Ew":{"text":"The workers were pretty rude. I went right after they opened and they said they didn't hav","useful":0,"cool":0},"QhPciliAG6JUaW1o-9wVXA":{"text":"One of several places in the food court of the Riverwalk Outlet to choose from. I tried th","useful":0,"cool":0},"RcYOCvkGtqvnsXazl4hSuQ":{"text":"Service wasn't friendly and made it seem like I was bothering them by ordering a sandwich.","useful":1,"cool":0},"MxVq97AV35vnpuDDj6ALRg":{"text":"Actually very good and close to Genos in philly. I've been twice and it's been darn good e","useful":0,"cool":0},"4U3XMyk-8E-KOGbpofAWWQ":{"text":"The manager Tasha was very kind and genuine. Best sandwich I've ever had honestly. I would","useful":0,"cool":0},"jgS4IBrdl55aaGfjKke88g":{"text":"I guess I knew better getting a Philly buffalo chicken cheese steak outside of Philly. Thi","useful":0,"cool":0}}