{"efhhCtVaNh4pHbdLHTim9w":{"text":"We went back to Parasol's the day we left NOLA and it got even better. This time I had the","useful":0,"cool":0},"-y0yMJ1h4zoeZIjlvYd4Ew":{"text":"Bang Bang Shrimp Po-Boy Boy and Pot Roast Po Boys were excellent. The bar tender was frien","useful":0,"cool":0},"l3pHk8X8bM9fYbDiiwSuNg":{"text":"This place has scary women manning the front. The po boy was good though. Don't piss them ","useful":0,"cool":0},"fOQDsvq83kNbh_Grq4Ly9w":{"text":"Get the gravy fries they are SO good a great hole in the wall for the adventurous it has d","useful":0,"cool":0},"1PqIU2Zk0OB9s-ALg8HV4w":{"text":"This place has been on the tv show, Diners, Drive-ins and Dives.I have been here twice. On","useful":0,"cool":0},"X6_aDDVps77Gog_Q63VrEw":{"text":"Parasol's is one of the great New Orleans places that seems like it is frozen it time.  A ","useful":2,"cool":3},"1qmOzQmHPvG3H5s8tdAqLw":{"text":"Im still thinkin about that firecracker shrimp po boy like a year later! Bartenders were g","useful":0,"cool":0},"ShY4V6ujOu4-IiuWSPKIgw":{"text":"Delicious!  THE PHONE NUMBER ON THIS PAGE IS WRONG!!!!  The actual number to Parasol's is ","useful":0,"cool":0},"OXkDkBch0lOpRSOfjl931g":{"text":"The Richest Boy. \n\nBest po boy in New Orleans. Hands down. Going to keep this one simple s","useful":3,"cool":1},"13zlR-Odn0aUE2t-P1acnQ":{"text":"Headed here to get some local flavor after hearing about this place on DDD. The episode th","useful":3,"cool":0},"c4d6382atHL5sRY-MRBPkw":{"text":"the best roast beef po boy you will ever wraps your hungry lips around!  the rest of the m","useful":1,"cool":1},"JuDdKn0obcjAaFq75IO3Og":{"text":"I can't type, I'm in ecstasy.  Fried oyster PoBoy.  Quick service in a busy place with ama","useful":0,"cool":0},"Qrk3fvr9vqDC8KnyCjEz6w":{"text":"Dive bars the wide world wide, eat your freakin' hearts out; this is the high dive.  Here'","useful":0,"cool":0},"1RUKn1wiJk48RE3KnRtSTw":{"text":"I just love the divey atmosphere of this restaurant that is attached to the bar. I walked ","useful":6,"cool":4},"HloM-eT3LmeRFIL8ibZ-Fg":{"text":"Wow.  What a hidden gem.  This place is in a residential neighborhood and the building is ","useful":0,"cool":0},"h3Td_UIIyO0bdAvqMbtNaA":{"text":"It breaks my heart to leave this review. I've been going to this place for my entire adult","useful":0,"cool":0},"s23a9YBLYjCoyvyJ1mUnaA":{"text":"Awful. When you walk in your mind will scream LEAVE. Please go with your gut and get far a","useful":0,"cool":0},"hZ4cGvc0aF3-umcd29T0Og":{"text":"Uptowners love this place, and the food is right on.  Good prices and friendly service, th","useful":0,"cool":0},"-YVKhpLfSSu66AS9PRBEew":{"text":"The place look so dodgy and dirty when we walked in. We just thought about the reviews and","useful":0,"cool":0},"cQYMXtGsQzdnphsu1vLUCg":{"text":"A hidden gem for sure. If you're coming just to eat, make sure to use the door that says '","useful":3,"cool":0},"q2s9a_svbeMUstoLL8U4pQ":{"text":"We went to Parasols on Memorial Day weekend to try the roast beef po- boy. When we got the","useful":0,"cool":0},"6yuhpI_eSW34G1rDHSFuHQ":{"text":"Great little dive with everything you need and nothing you don't: there's a jukebox and fr","useful":0,"cool":0},"X95tvYpSh6s1DoUhyM7s0w":{"text":"Can't knock this place, they definitely know how to make a po boy. Came here with a friend","useful":1,"cool":0},"Ay0JO9TXH-R3QcIl7Dck0w":{"text":"When I came to my senses and moved back to New Orleans after spending six years in frigid ","useful":1,"cool":1},"MryO3dB8pi3HY7lv8f-AWg":{"text":"Good whiskey selection. Good prices. Good folks. Food is all-right, but goddamn, you can't","useful":0,"cool":0},"1xlEcUCQG7oCFFMnHaresg":{"text":"Another amazing hole in the wall!  Roast beef poboy is legendary.  A true gem in the Irish","useful":1,"cool":0},"BxhWUamFiWXQ4ddaV6r1qw":{"text":"The St. Charles streetcar was not working due to construction, and we did not think of tak","useful":2,"cool":0},"432BHcTjbUHtjxw74MS3-A":{"text":"LOVED IT! It was a tiny little local dive bar. There were a few other tourists that had wa","useful":1,"cool":0},"2TSPMszvrX4k_7VG-W0ZPw":{"text":"What a funky little place. We came here for lunch on our last day in New Orleans and I am ","useful":1,"cool":0},"MHRIgqjRokk9qQ5QV0ME0A":{"text":"Visited New Orleans and just before we left we saw Parasol's on Diners Drive in's and Dive","useful":0,"cool":0},"ECk9qsSh58lFZy2kxFprDA":{"text":"First time trying a po boy so I do not have a comparison. It was good. The roast beef need","useful":0,"cool":0},"TEmO951VFzec23pTATb3ww":{"text":"Large portions and very affordable. I had a little bit of everything. Po boy roast beef, g","useful":0,"cool":0},"x9HkeUb4sZE28efVdU7DCg":{"text":"Delicious po-boys. I had the roast beef. Perfect onion rings (not greasy). Great lunch pla","useful":0,"cool":0},"qk0E4hCIBBeK7XUA_U2Z1w":{"text":"We were not in the know, so we entered through the bar, 5 year-old in tow.  Up the stairs ","useful":0,"cool":0},"b6EsySMmvHyxNnd6iV5JZg":{"text":"I was a vegetarian when I lived in this town, in 2001. Sure, Parasol's in those days was k","useful":1,"cool":1},"nob7NgJiuS52yxKpXs_P1A":{"text":"I was staying just down the block, so I thought Id try the infamous Parasol's. I chose the","useful":0,"cool":0},"pidJu-RFKxKIXcsW9a22AA":{"text":"My favorite place to go to for a roast beef poboy in New Orleans. It's a total dive bar/re","useful":1,"cool":0},"GwYEW-NdpdkeJJ2T6wd2Ow":{"text":"Don't be a fool like we were and walk into the bar which is small, cramped and full of peo","useful":2,"cool":0},"me64IAlPQCUtczPJcDPKCQ":{"text":"Make sure you don't eat before you come here. Not for the day but a week. Between my frien","useful":1,"cool":0},"tkYgS1kceNLKb0zEnBS6wg":{"text":"My girlfriend and I just moved in a few blocks away and decided to walk there last night f","useful":0,"cool":0},"TXDVUr-iTss1Yl5ukiQP-w":{"text":"Just left this DIVE.. it was recommended by our tour guide so my boyfriend looked them up ","useful":0,"cool":0},"UH9-iDHvEEeKWQTFapiLfQ":{"text":"A friend who used to live around the corner took me here. She ordered three different pobo","useful":0,"cool":0},"3yBEw8MDkOwDFPMzOS7-3Q":{"text":"Thank you yelpers for guiding us to this hidden gem! We were walking around the Garden Dis","useful":0,"cool":0},"yI0IanK9a5ojHXwneMugbw":{"text":"Our first authentic, and easily best meal of the trip. We hopped off one of those tour bus","useful":1,"cool":0},"cfM5G19xHue2suG1EaWnZg":{"text":"We found Parasol's several years ago and always look forward to going there when we are in","useful":2,"cool":0},"zO0wI1ejloImRxc7s7NiUA":{"text":"Only for the brave or true foodies to eat-in.  When we were waiting for our take out I was","useful":0,"cool":0},"yOcl9UODK6r4vV7HW66KfA":{"text":"This neighborhood restaurant and bar may look like an Irish Channel dive (and it is).  Tha","useful":0,"cool":0},"ZIXTsiqU51ySiYGfyQ1lRg":{"text":"The gumbo was 5 stars, very tasty.  The roast beef po boy was 3.5 stars.  The gravy was go","useful":0,"cool":0},"AwUh7mBek-5x7D87dWHaag":{"text":"Drove 100 miles out of the way after watching a show on the Food Network. Walked in with a","useful":0,"cool":0},"8XDDusCkkiENY1aUlygk-g":{"text":"As we approached the rather plain looking building, I said \"this place has to be good.\" Of","useful":4,"cool":4},"yIGuWBdcBGzSaPbJYfksUA":{"text":"The firecracker shrimp PoBoy is fantastic!  I love to stop by Parasol's after a nice day o","useful":0,"cool":0},"QhBBxiFhS3fF1pLN84a0nw":{"text":"Loved this place.  Was in New Orleans for a conference but looking for a good place to gra","useful":0,"cool":0},"E0Py-a8XNA8z3P6r6vGu8Q":{"text":"The best place to watch a Saints game, have a drink and enjoy the day.\nMy favorite place f","useful":0,"cool":0},"qXXRb2Tx21uT0xO2QOrdkA":{"text":"I heard about this little gem and it was a must when we got to Nola . Amazing Po Boys, tri","useful":0,"cool":0},"UK_DL9RydPnow4NYoV0Y_Q":{"text":"A tour guide had recommended Parasol's for a good po' boy, and when my family and I approa","useful":0,"cool":0},"c_cuyZC11Bu2Lng4sAAwQQ":{"text":"This is a SUPER divey looking place but the po' boy I ordered was fantastic and the prices","useful":0,"cool":0},"pPkU6WyAUJynwQrRpljENw":{"text":"Go straight to the back and order the firecracker shrimp po-boy. Don't' waste your time on","useful":0,"cool":0},"9XDIdDcQCN0DSSCCDDKM2g":{"text":"Great food, friendly service, and a good time - some guys broadcasting a sports radio show","useful":0,"cool":0},"ifdkM3AmOLF_JWJCg-uJMQ":{"text":"My friend and I had a checklist of what we wanted to taste in New Orleans.  Getting a Po-\n","useful":0,"cool":0},"r3eRH7ybSGxkt4z89taC5g":{"text":"The roast beef po boy was enough to make my entire day! They Also have delicious, huge por","useful":0,"cool":0},"KczD_H_WcCW9qejqdXX1JQ":{"text":"Roast Beef Po'Boy & Firecracker Shrimp Po'Boys! So good. Really would come back here all t","useful":0,"cool":0},"R2YGnXNJaZ_z2l5321rt_Q":{"text":"Everything I expected and a lot I didn't. It's a bar and a damn fine one. Love to be there","useful":0,"cool":0},"Z9D2nmWBKdXMQ4tImQz5_g":{"text":"If I were into sports, I'd add this to my game viewing list. We visited on a Sunday during","useful":11,"cool":6},"7uJzpt5dKpxHGymwvxCeew":{"text":"By far one of my absolute favorite places to eat and drink in New Orleans. The roast beef ","useful":0,"cool":0},"Sqcb5C_YohNYNt2GNTUoFQ":{"text":"Food here is wonderful.  So much flavor and the perfect amount of spice.  I'm one to put h","useful":1,"cool":0},"8lmb4gcXeBZK413XIYqzBQ":{"text":"We had been here before and everything was very good. I had the catfish basket and my husb","useful":0,"cool":0},"y0uTg4oDvwZLQm3DePIPoQ":{"text":"Great food, extremely personable staff! The po' boys are the best, though the Irish Sundae","useful":0,"cool":0},"kzOBB2IexnUW5ZcEqVELVg":{"text":"Hands down best Roast Beef Po-Boy in the city-proper. Featured on the Food Network. Cheap ","useful":0,"cool":0},"sQxfyP8qi1KvWWbExF4mCQ":{"text":"This is the kind of place to go if you don't want to eat at a local place that the typical","useful":1,"cool":0},"I2AowYyvfa0u8ZJL0pHQCw":{"text":"We saw this featured on Diners, Drive-ins and Dives on the Food Network and had to try it ","useful":0,"cool":0},"aSIq7GQ_Ec9_kpw745suHA":{"text":"Firecracker shrimp poboy!!! Bloody Mary!!! Fantastic ..off the beaten path! Best bartender","useful":0,"cool":0},"YR-KD8sC2eVu9TtC56rpxA":{"text":"My favorite Po' Boy of our trip to New Orleans.  We had two and ate then for BOTH lunch an","useful":0,"cool":0},"oXTcTT8EGzPzS81da207hw":{"text":"Wow. I've heard of dive bars but this place is like beyond that. The gumbo was so spicy it","useful":0,"cool":0},"wNrho9hGhqRTAp4wZ3xOxQ":{"text":"Been here 3 or 4 xs. Have gotten the firecracker shrimp poboy Everytime. So much for diver","useful":0,"cool":0},"gQCKg2BmtBuKworueTQsxg":{"text":"Stopped by after a chef recommended this place. The bar made me smile, simple neighborhood","useful":0,"cool":0},"4Fv3GQXrkluCvYhp3gdhxA":{"text":"My favorite po-boy (pulled pork) in New Orleans. I tried 3 places in one weekend, so while","useful":0,"cool":0},"M-CLT4kchq2tMDFpSrGDYQ":{"text":"Meh...Moderate at best, went to the Block Party. Bar was great food was mediocre at best. ","useful":1,"cool":1},"-MkHAMOIgnDITHDRBebWeg":{"text":"This place is a must stop when I visit family every summer. They have great po boys with s","useful":0,"cool":0},"kMLHUHAD73lRAXXjoTRN5Q":{"text":"Don't let the exterior of the place full you or the interior for that matter. I know the p","useful":1,"cool":1},"1jGqrGwI0NzzE5ZevbtC3w":{"text":"Used to love this place, but now they take 40 minutes to make a sandwich. Not even that bu","useful":0,"cool":0},"YKb9_6zlqcykyKg2yr5isA":{"text":"Fancy some 4\" shards of glass buried into your po-boy for dinner? A nice bloody treat for ","useful":20,"cool":1},"1zPi6IJvYufrj2E7ordumw":{"text":"I deeply regret not having gone here sooner.  They're moving up the street to Tracey's (3r","useful":2,"cool":1},"BT98Livm-RH3Or7BD-UXmA":{"text":"Stopped in for lunch after a walking tour of the Garden District.  Enjoyed a couple of loc","useful":0,"cool":0},"yJFqqWGvVw8P5ItUKK_SlA":{"text":"The roast beef po'boy will put a good hurting on you.  The sauces are wonderful and go wit","useful":0,"cool":0},"skqlHKCKEx6Fc2UqQxKKfw":{"text":"This place is great!! Its off the beaten path and well worth the extra time it takes to ge","useful":0,"cool":0},"cZnE1NXn5un6ursJ1r_4zg":{"text":"Holy cow, if you want a great po boy, go here! There is an old Irish bar side, and a dinin","useful":0,"cool":0},"s6WJJZW4VlaYBNGkG1HquQ":{"text":"We took a taxi ride to Parasol's on a whim.  One of the best meals while in NO and our fir","useful":0,"cool":0},"TV-SPGO8S9lSh2EARD7ETw":{"text":"Total hole in the wall in the most wonderful sense of the word. Don't come if you're not o","useful":0,"cool":0},"cAqugId5ACFjLTAL1bTr0w":{"text":"Divey little spot near my home. Roast beef poboy is good. I like the hot wings. My gf enjo","useful":1,"cool":0},"5JRjDS-2Lxg96AAGBKLGmg":{"text":"The po boys here are fantastic. I had the roast beef po boy and tried a bit of my friends ","useful":0,"cool":0},"OhcsOSXAixEXsFoCa-bKog":{"text":"Best!  Best!   Best!\n\nOyster Po-boy!  Shrimp po-boy!    Red beans and rice!  Onion rings! ","useful":0,"cool":0},"BNU5rKmyJTdLSQHQhrVSRg":{"text":"The Best Roast Beef po-boy ever.  Seriously.  This place rocks.  The shrimp po-boy is good","useful":1,"cool":1},"8-J8yBZjv3wDa0BhpbbcPg":{"text":"From Michigan, never had a PoBoy before. Wife heard that \"Parsol's had the best around. We","useful":0,"cool":0},"ywaSlJH-Ay2-rb2F-zURAw":{"text":"Parisols is old school NOLA, and you feel like you step into a neighborhood kitchen when y","useful":0,"cool":0},"P011SY1ExHSBmY_iPNUL_g":{"text":"A VERY divey bar/restaurant serving up GREAT food. Po boys, fried chicken, french fries, m","useful":0,"cool":0},"LoCeDfqUZRoiqQMHI7Rbog":{"text":"I am just so glad to see that Parasol's is still here!  I won't specifically comment on th","useful":0,"cool":0},"4FNUBI1-pf2qfUacl0WTnw":{"text":"btw ima local.\n\nNot good to right a review while hungry. \nEspecially this one. \nSalivating","useful":3,"cool":6},"IS0TqFEmzQxF3c-ZWYXGJA":{"text":"They were out of Muffaletta bread when we arrived on a Friday afternoon but there are plen","useful":0,"cool":0},"u3WFKfiZmqfU06PdlQzr0Q":{"text":"Decent food at a decent price.  I think I had built this place up in my head a bit and was","useful":0,"cool":0},"sAMuSeuoB99cDL-RONIiuA":{"text":"lived around the corner from this place for a little over a year and it was always first c","useful":0,"cool":0},"sy1O6QRawwghdq0f_G5I_g":{"text":"As always the best Po-Boys in town. Been coming here since I was first introduced 25 years","useful":0,"cool":0},"-aouxmMJILjhzjw0Qy8hjQ":{"text":"2nd time in NOLA and once again, BEST SHRIMP PO BOY in NOLA\n\ni can't get over how deliciou","useful":0,"cool":0},"EN12mZZhw0FAlYaehSFc7A":{"text":"I saw Parasol's on Diners, Drive-Ins, and Dives.  It is a total dive and I loved it.  Ther","useful":0,"cool":0},"X0homWkylGISgVvMbMOxGg":{"text":"Huge update: Firecracker shrimp is Amazing! It's crystals coated fried shrimp in a po boy!","useful":2,"cool":0},"03ciKoY5eRLRWLG-iJDItQ":{"text":"both times we were really disappointed in the PO BOYS in NOLA. so on the last day we decid","useful":1,"cool":0},"Cvu9SiCo6V2X4mj-ZACIpA":{"text":"I wanted to like this place. But.... got the fire cracker shrimp po boy and large order of","useful":0,"cool":0},"GcvwXT2c5K2aDkCFBcx9Dg":{"text":"Parasol's is the real deal. It IS a dive bar, so don't go if this isn't your thing. Roast ","useful":0,"cool":0},"EU83XT-g1rmRZEVadQQoog":{"text":"This is a must do. We just stopped for a quick bite and had a Firecracker shrimp Po boy, i","useful":0,"cool":0},"LKlI87Yc5nwOSyQAgWGp_w":{"text":"Fantastic. Tried the shrimp po boy and the oyster po boy: both were great. Cool setup with","useful":0,"cool":0},"zqBUDIz3KI2JykYr0kZEVg":{"text":"When the old kitchen from Parasol's moved up the street to Tracey's they forgot to bring t","useful":1,"cool":1},"-dh_dPA-L56nLCkAgaseiw":{"text":"Believe me, I am ah-ware. All too many of my reviews feature incidents of either heavy dri","useful":4,"cool":7},"4Y7XW8H8-pilHyf2NgQyvQ":{"text":"Shrimp po-boy and Roast Beef po-boy are epic. A friend recommended Parasol and it did not ","useful":0,"cool":0},"JpTb4eTwlPdT6-mUVMFBxA":{"text":"Wow! The Po' Boys-fire cracker shrimp and roast beef are a must. Plus the red beans and ri","useful":0,"cool":0},"zR4d_a4Rvq8s1xB5cu0uiw":{"text":"I was a NOLA first timer and asked all of my experienced friends for recommendations. This","useful":2,"cool":0},"D6_Lll-FSLPt3y8YqFri-A":{"text":"This was seen on diners drive ins and dives and I must say, I was not disappointed!!  Exce","useful":0,"cool":0},"te010qKgE8Kw42aZyITx6g":{"text":"Service is good, food is wonderful and the atmosphere is exactly what New Orleans is all a","useful":0,"cool":0},"aUJJmEjMfQ00NampB0G8HQ":{"text":"So I'm not sure what all these amazing reviews are about. The food was ok...we got the fir","useful":0,"cool":0},"1coPBkR3oyqteFIs_HaIjg":{"text":"The onion rings and the fried pork skins were fantastic and the portion sizes were outrage","useful":2,"cool":0},"ALE8qFhAlTLsLpyLYpMhoQ":{"text":"Typical N.O....\n\nIt's three in the afternoon on a Sunday.  The bar has about thirty people","useful":3,"cool":3},"VEY5N_zCr2KA-RKhLYo-9A":{"text":"Came for the St. Patty's Day block party!  What a fun place to come and wear green and par","useful":1,"cool":1},"tBRKXEPEONw0twnITg-Y4w":{"text":"Hands down best PO ' boy in NOLA! The food is fantastic. The firecracker shrimp and the pu","useful":0,"cool":0},"BAa6bfUSAA7qNlR9tWr-Vw":{"text":"Had to visit Parasols for dinner after reading all the great reviews.  We were not disappo","useful":0,"cool":0},"TvGYywkW3Nbr1hDBZGy-5Q":{"text":"After recommendations from my friends, I went with the roast beef poboy.  Man, was I glad ","useful":0,"cool":0},"u_B1ZzDaoXOEvXmoQ1d-kw":{"text":"Sandwiches at this place were amazing. We both had the BBQ pork and loved it. Friendly coo","useful":0,"cool":1},"ye9VVsHNo_c-PhsShhSWVg":{"text":"Best hidden gem bar in the garden district! The firecracker shrimp po' boy was amazing! Th","useful":0,"cool":0},"-cTcMlkXq-uUHN3CbwDKOQ":{"text":"Amazing! a little space but amazing food with BIG flavor! Don't let the exterior fool you.","useful":0,"cool":0},"4xgQkwZCkBguy9OB4x1qbQ":{"text":"By far THE best find. Amazing poboys and I loved being around people from the community.","useful":0,"cool":0},"yrIC70Dg11R44Xf0X5vEmg":{"text":"No, just no.\n\nMy boyfriend and I went here this past weekend while on vacation.  We chose ","useful":3,"cool":0},"4Ig2iStk5gV2eRZO6u37HQ":{"text":"OK, for visitors to NO, you've got to remember that most po boy places you're likely to go","useful":2,"cool":0},"2a23jxhxkfvZLjzQiuR2SA":{"text":"Best  Po boys we had on our trip. Fries with gravy were outstanding. Cool divey place with","useful":0,"cool":0},"6LpZPuMy-bg9Fb0L1pqGjA":{"text":"Their large sandwiches are huge! Enough for two meals. Had the firecracker shrimp po boy. ","useful":0,"cool":0},"zanvuMUpnFzJlaaQQ29UYA":{"text":"5 STARS.... WHY? Hands down best bloody mary I've ever had (topped with Guinness).... whic","useful":0,"cool":0},"IRj-DMDKMMrdutV1lEYgjg":{"text":"Is this a dive spot - yes. Don't go in expecting more than an old dive bar and you won't b","useful":0,"cool":0},"yOsExEOT5JTy5Hk88oQOzQ":{"text":"Seems have been a little different the last few times I was there.  Poboys were still grea","useful":0,"cool":0},"Md65HN2L2tKyNL2zyMoucg":{"text":"Parasol's Poboys are awesome!! I had the roast beef po-boy, which was damn tasty and had a","useful":0,"cool":0},"_xhXl7NOVtSbQcwCqAINvA":{"text":"We loved it here!  The Toast Beef po boy was delicious!  2thumbs up! We came here for Mard","useful":0,"cool":0},"1mXGstEnI_QxiRigy65KIA":{"text":"It was pretty cool to see an original menu from around 1940ish framed on the wall.  That's","useful":1,"cool":0},"l70ImrlbaHPuzNYpDw1J2g":{"text":"Awesome restaurant in garden district. I had read good reviews on Yelp! and we were not di","useful":1,"cool":0},"wiCyvq0Tw9QOjv4s4t2roQ":{"text":"So amazing! Greatest roast beef po'boy ever!!","useful":0,"cool":0},"Zi0Dw3KPDg9J66ijnXOd0g":{"text":"A must when you are in New Orleans. Off the beaten path and way out of the French Quarter,","useful":1,"cool":0},"xEdYx6FbX7h_GJsnZNYLBg":{"text":"Kerri is the most awesome bartender in the world.  I think she saved my life!  This place ","useful":0,"cool":0},"PaPlM89dbes_7bgpxaWCzg":{"text":"Do not be fooled by the hype. Our family visited this place and none of us felt it was any","useful":1,"cool":0},"4FS5OVhYUaIvxqpMca4t-g":{"text":"you would never know this place is here if it wasn't for yelp. this place is amazing. have","useful":0,"cool":0},"kyvFLIaJq4HKEqjmLdUlXQ":{"text":"Never liked Roast Beef until I had this one.....\n\nI love this place and hope the charm rem","useful":1,"cool":1},"s_d4irrF1M7whFIh5bR5TQ":{"text":"I am a fan of the shrimp poboy...price is right and it is tasty.\nI get it to go..the smoke","useful":0,"cool":0},"uNrrHWLiTCJXOOP0hgzUVQ":{"text":"This is a review of the bar and not the restaurant.  Maybe it's not fair to review a bar o","useful":3,"cool":5},"YeSDYcGFlzIhUNycAXH2fw":{"text":"Amazing food, great service, the perfect choice.","useful":0,"cool":0},"HfisOIwLQR2G6ESlCi31gw":{"text":"I have lived in this city for almost 4 years and my first trip to Parasol's was last weeke","useful":12,"cool":10},"EHa4U8FKwhPjjcoC_sVzBA":{"text":"I like Parasol's although admittedly, I don't go here as nearly often as I used to since T","useful":6,"cool":2},"KjgX_NJIwbBRjm1RO28e7A":{"text":"Get the bread pudding. I cannot stress this enough. Get the bread pudding. It is so flavor","useful":1,"cool":1},"mGwySEuojQRhatvi9z4dbw":{"text":"Great service.The food is delicious We would definitely come back for more.The only bad th","useful":0,"cool":0},"H2AvW2eGK2RK0gUhn179AQ":{"text":"After eating my way through NOLA this was the perfect ending. This place is a hidden gem, ","useful":6,"cool":3},"BbJ83SYL4ej_6IP0EqrMgw":{"text":"DDD says best roast poboy and they may be right. It is too messy to not have a few napkins","useful":0,"cool":0},"LhqNJfc3w_WoHvlrutsjUg":{"text":"All I have to say is Firecracker shrimp po'boy. AMAZING! The service was definitely up to ","useful":1,"cool":1},"9SXRYnRC0XQK6qA1SjhcLg":{"text":"I loved this little dive. Away from the super touristy area of Nola, VERY strong cheap dri","useful":0,"cool":0},"h8Jepr1DMbfGXCCeBhsiJw":{"text":"Oh my. Best po boys myself and friends have ever eaten. Roast beef with debris(gravy) full","useful":1,"cool":1},"vi2hqiDb5mGTLJehCwtRVA":{"text":"When I first walked in all I saw was this dark bark we almost left. How are the bartender ","useful":0,"cool":0},"R5O55fDTcbJFZxo56gca-Q":{"text":"Had the roast beef PoBoy. The bread they use is so good.  Best PoBoy in the lower garden d","useful":0,"cool":0},"vGKYM5dU7A2IaCf_Z2yNRQ":{"text":"Firecracker shrimp po boy.  It IS that good.  The simple mention of the large beast makes ","useful":0,"cool":0},"AYbmOWLCxIBx-tuW4TvBkA":{"text":"Wow, this place has a good Po-boy.. Probably the best roast beef Po-boy I've ever had.  We","useful":0,"cool":1},"-z31_sbZfC0jzRso525Xew":{"text":"Got the pulled pork sandwich, tasted good but a bit too salty. \n\nHeard this place is good ","useful":0,"cool":0},"pBIIFOn2OTDnfStfe3C22A":{"text":"Went in to share a firecracker and pulled pork po boy....and Abita...or ten.  The food was","useful":1,"cool":0},"zAJcxTj5fz1Biqcp0Hql3w":{"text":"The food was OK. The place was totally horrible. The bar beneath the restaurant smelled so","useful":0,"cool":0},"mX29g_xfAQ1l8g_mFfSpQQ":{"text":"All top notch. Definitely worth the cab ride from the bourbon street area to check out. We","useful":1,"cool":1},"buoJIemhG0MO0pGZsvi1PA":{"text":"I bought a fire cracker shrimp poboy and washed it down with an Irish coffee slushie. This","useful":0,"cool":0},"3LgZwxmJrrNXgyNDCtzH2w":{"text":"Not very family friendly. Smelled like weed. I'm really confused at the positive reviews. ","useful":0,"cool":0},"fwxPyGpzp_BiMUcBE0FEjw":{"text":"This place had great ratings on Yelp so we decided to check it out since it was close to o","useful":1,"cool":0},"blz6doT6DOak0HEEMB7NiA":{"text":"Take it from a native. .. I've eaten every poboy in the Crescent City. .. If your looming ","useful":0,"cool":0},"RwoY6cfRioC2zkkxjEaZ0g":{"text":"Only reason I'm not giving 5 stars is because my sister was excited about trying the muffu","useful":0,"cool":0},"YPtm2wPFW4Ret18aLWzmeA":{"text":"In the heart of NOLA's Irish Channel is the the pot of gold at the end of the boozy rainbo","useful":1,"cool":0},"tupbc259bu9mOB6EqmZhBA":{"text":"Went there today after seeing it on Triple D. Was pretty hesitant to stay because the bar ","useful":0,"cool":0},"n9CP9KNV-HOb9rgO3kAvVQ":{"text":"aaaaaaaahhhHH!!!\npossibly the best po-boy in tha city, son!\nGet the Pulled pork with spicy","useful":2,"cool":1},"h2rx-LPZTa6DqrnfRVV43g":{"text":"I really really really wanted this place to be great.  Unfortunately they were out of meat","useful":0,"cool":0},"eSoWSG3G4X7agSPs9RyCmA":{"text":"Amazing food!! I got the grilled turkey poboy and absolutely loved it, lots of food and a ","useful":0,"cool":0},"hHAC5-dhZ_32GFm-rVjZ5w":{"text":"Hands down best tasting food I had in New Orleans - roast beef was INCREDIBLE.  Is it a di","useful":0,"cool":0},"ofQeqfckne1-PAj0mQ_-9Q":{"text":"Great firecracker shrimp poboy, the veal was amazing also!  Awesome staff, cheap drinks an","useful":0,"cool":0},"pOmd3yuCuAIaumxRxn68ow":{"text":"So far the best roast beef poboy I have had in New Orleans. I will reserve the 5th star fo","useful":0,"cool":0},"jgEvlIznFZ3TxQr402w9oA":{"text":"Whilst searching for a high-end restaurant , we got a bit turned around. We asked an elder","useful":0,"cool":0},"TuW_GTc4XMnUvA_4da_kig":{"text":"This is a dive - FYI. I've been here both times I have been in New Orleans in the last 4 y","useful":3,"cool":0},"VmX6xga9j0-AEFLyASHQrg":{"text":"Great roast beef poboys!!! Lots of meat, great flavor, we ordered ours dressed with Swiss ","useful":1,"cool":0},"pUFxznS7cfKMi0-9SUxVtw":{"text":"After being introduced to Parasol's by a native, we make it a point to have a shrimp or ro","useful":3,"cool":0},"PL2tU8NUgM80uuuCm7GNiQ":{"text":"The fire cracker shrimp poboy is definitely my favorite. This is a required stop in the ga","useful":0,"cool":0},"ZEFnjPcYiTIcZZWZdyhwrw":{"text":"After watching the DDD episode we had to check out Parasol's.  We ordered the roast beef p","useful":0,"cool":0},"De5ZFB9cyWPj_zIvF5XVcQ":{"text":"I had not been here since before the split so while I can't compare it to the one down the","useful":0,"cool":0},"RBG_MhsR-8vUB5W9ZQkatA":{"text":"Po Boy's are NOLA signature meal and Parasol's did not disappoint. Without a doubt one of ","useful":0,"cool":0},"QvesNC3rmeA1yMIKEYbkeg":{"text":"Does anyone get the feeling like the \"restaurant\" (back room above and behind the bar) is ","useful":0,"cool":0},"Ynokm-Zf85WzXrS0VAPZ5g":{"text":"Good po boy's & a very laidback atmosphere.  I had the oyster po boy & while it was really","useful":0,"cool":0},"jsXruIsHj8LpDtPusM2-gA":{"text":"This place is awesome. Hard to find parking and sometimes the people sitting at the bar ar","useful":0,"cool":0},"YYBaRlzayoTQRdfxSmjGhw":{"text":"Everything I expected and a lot I didn't. It's a bar and a damn fine one. Love to be there","useful":1,"cool":0},"Bhn7O3-E67Xp06pUfW7dmQ":{"text":"So I almost walked out of this place. Came into the bar area; smelling of dog and liquor a","useful":0,"cool":0},"L7w8G4J96YfF8Vl_hOlYPQ":{"text":"Freakin' Fantastic po' boys!  I got the shrimp one with the hot sauce, so huge.  Nice crus","useful":0,"cool":0},"mUe2fc-1Q54AN-LXsTecdw":{"text":"Seems that Parasol's has fallen somewhat from it's once lofty perch as the po-boy capital ","useful":0,"cool":0},"0SUro5_eZoqFu3FVBZU5Bg":{"text":"4/5 community classic.\n\nfried shrimp, dressed. not firecracker, just fried.","useful":3,"cool":1},"PzmYhpL_i54HDRga6z1kZw":{"text":"If I'm gonna get a po boy, it's gonna be from Parasols. \n\nSeriously- best po boys in town.","useful":0,"cool":0},"auDBtfmKdNw2TBsbe_RNqA":{"text":"A note on the biweekly Open Mic. It has now evolved into the weekly Acoustic Song Circle. ","useful":0,"cool":0},"m2mDdUiL0wkc24TGpR29Og":{"text":"friendly staff - wonderful food - the po'boys and bread pudding were a highlight of our NO","useful":0,"cool":0},"LS19FxZAOCNeShFFN-ihgA":{"text":"Hadn't been to Parasol's in a while, but it's as good as ever.  We had a tasty, really fre","useful":2,"cool":2},"Kcu6QeWD2CF4T74WYEh_pA":{"text":"When you see this place from the outside you really start to wonder if you should bother a","useful":0,"cool":0},"QGooYq1QYEKyTy9ukWHatQ":{"text":"Awesome!  This place is a local spot and if your looking for that vibe and po boys...boom,","useful":0,"cool":0},"jrfyMBjUuQ3BWpVP3iExgg":{"text":"Excellent roast beef. A top three IMO. Sliced very thin-tender and flavorful. Definitely r","useful":1,"cool":0},"ig2DBWnQgYnIQbGLBcwAjA":{"text":"We saw this restaurant on diners drive-ins & dives. Our first clue should've been when we ","useful":0,"cool":0},"a4cTWGqTDVd0vOrITpqUIw":{"text":"Definitely a must when in NOLA...the bartender is the definition of Southern Hospitality..","useful":0,"cool":0},"jimfx8iMnYIalO0mRPH_rg":{"text":"Best local bar in all of Nawlins with a \"side car\" eatery that should be featured on EVERY","useful":0,"cool":0},"Up8tEh7CXqaofY8NFR5XpQ":{"text":"I simply can't believe how delicious the food was at this hole in the wall dive bar. Appar","useful":1,"cool":0},"-m7PDc8-B-YPaXcc0DmCJw":{"text":"The perfect po-boy awaits! I have come to admire a no frills establishment with a warm yet","useful":3,"cool":2},"Zy6A_BXV97ibCjUiEOIJDw":{"text":"Went here for our first lunch in New Orleans... OMG!  So yummy!  I actually had the chicke","useful":0,"cool":0},"dzMBasT7b-Uvw4chSeKFCQ":{"text":"The 5th star is reserved for my next visit, when we actually get into the bar.\n\nIt was mid","useful":2,"cool":1},"e7Z30KbK-iQQVHCetP5zyw":{"text":"A small neighborhood bar and \"restaurant ^. Cold beer,  red beans and rice had a great fla","useful":0,"cool":0},"2dlhl3CxNJcOWTs-1nNJIw":{"text":"The gumbo was the most flavorable I had the whole week. I tried a lot! My husband had the ","useful":0,"cool":0},"Brk4s7i_0XeRs84vaCYvFg":{"text":"The dive bar probably has one of the best atmospheres I've been to.  Great bartenders, com","useful":1,"cool":0},"C2oL3ABbWJKUbs7qORxrxQ":{"text":"The best roast beef poboy! If you're not a big roast beef fan like me you'll still love it","useful":0,"cool":0},"mktIn-0bAKSF0i398aogMQ":{"text":"My new favorite local bar. Great eats and rad bartenders.","useful":0,"cool":0},"fEZSTxklWz2QBQMyf2QLcQ":{"text":"My fiancée and our friends had a trip  to NOLA last month and I cannot stop talking about ","useful":1,"cool":0},"JeqnSz4NHOieE-ac1bFFOA":{"text":"This restaurant was featured on Diners, Drive-Ins and Dives on Food Network. They are corr","useful":1,"cool":2},"i3d8Xw5UUN5XH0wmiFHtqA":{"text":"There might be a po boy as good as what you get at Parasol's, but I can't imagine one bett","useful":0,"cool":0},"452gZHMsYbyColXyDDDt3w":{"text":"I'm not going to rail against this place but it was overall disappointing.  First the neig","useful":4,"cool":3},"telbwTpLKEjL17yC8N90vw":{"text":"Sure it's famous, but it still has an awesome neighbourhoody feel. And the roast beef po' ","useful":0,"cool":0},"QW5MJTPylG_ylBxS4TqVvA":{"text":"Parasol's is a local favorite watering hole in the Irish Channel. Although it's totally wo","useful":1,"cool":0},"X_tODjYWPSIGMzWikP_vYw":{"text":"Another fantastic triple D location! I went here on a recent vacation with some friends. T","useful":1,"cool":0},"84uYePtgonyIbpsXmEEPRA":{"text":"Parasol's is solid every time. It's a true New Orleans dive. Be sure that if you enter thr","useful":1,"cool":0},"uMEyjNMNGfQH6gVBGSximA":{"text":"the boyfriend and i went to parasol's during st. patrick's day festivities and when they w","useful":1,"cool":0},"w40wrLbVvvLd87RbT_ZgUA":{"text":"After I got over smacking the alloys in my rental car on the curb outside, I wondered if I","useful":0,"cool":0},"V1gwrHokECKQE1Et7GZPiA":{"text":"Parasol's is a well kept little joint just off Magazine street. Too clean and well lit to ","useful":2,"cool":3},"woLT8sI6s_zQIMtCMQogNw":{"text":"Excellent food, friendly people.  The BEST Roast Beef Po-Boy in town.","useful":0,"cool":0},"9qdDcbl3JfEPVKb8Z9uorw":{"text":"There are few things as delicious as the roast beef po boy from Parasol's. It's a little n","useful":0,"cool":0},"DYG2VQRS6ABmK2QaauCLjg":{"text":"A group of friends and I were shopping on Magazine Street and asked one of the employees w","useful":1,"cool":0},"l_vBrXRgsMJhkfF49IpeXA":{"text":"Yes, Jesus, yes -- if I could make love to a bar, marry a bar and raise a family with a ba","useful":3,"cool":2},"RYoezm9d6PILpmT88ROOKw":{"text":"Amazing po boy, and affordable. Really nice staff, the dive bar is fun (I recommend the Am","useful":1,"cool":1},"XGnYyYKjaR98lAMOFCdihw":{"text":"Three stars for the new owners (old owners and Po Boys are now at Tracy's) cleaning the pl","useful":1,"cool":1},"LB8xr8nWwN5IAy-ClUQIJw":{"text":"The ambiance of this place is slightly better than that of the inside of a potato sack ...","useful":1,"cool":0},"J3tU3xmzGPPc2UNLa3ykvA":{"text":"Great casual atmosphere; you can order in the restaurant but eat your food in the adjacent","useful":0,"cool":0},"PNZHa9f1pByXl-mnd0KLqw":{"text":"If you're looking for a realllly good po boy you have found the place. Parasol's is  a Sma","useful":0,"cool":0},"2ceNkbHMt8cLKzzQ74Kqrg":{"text":"Best po boy in town....so far, the fire cracker shrimp was the best sandwich I've had in y","useful":1,"cool":0},"ry6ka217aSoq9H-ae-0Xtg":{"text":"Talk about a hole in the wall, but don't let that scare you. You must get the red beans an","useful":0,"cool":0},"UhE8OuOLn5Lui-9UFtTmbg":{"text":"Good drinks.  Good food.  Semi-snarky bartender. \n\nOnly four stars because it seemed like ","useful":0,"cool":0},"3ALlKqZ1ZwtKrllQrIpjQQ":{"text":"Came here on a tip from a food blog and it was well worth it. It is a great way to start a","useful":1,"cool":1},"rGuoZWSYRVrCA6Dn_Ppr5w":{"text":"So what happens when you take an old house in the Irish Channel section of the Garden Dist","useful":2,"cool":3},"klIpbzcGtIxhe2EmHKV-iQ":{"text":"Messy sandwich but very tasty!  Fries with gravy were amazing!!!!  Place is dirty and rund","useful":0,"cool":0},"3JNfQMyTT75ozDUW2l_w5w":{"text":"I have friends who love poboys from Parasol's. They waxed poetically about how great they ","useful":2,"cool":1},"EF28Ekd2CqWIDVlVKh22Pg":{"text":"My first po boy ever and SO GLAD it was here! I got the shrimp po boy and the boyfriend go","useful":0,"cool":0},"xji0avcErd7jFzBW3OvUZw":{"text":"Better food than Tracy's and always an interesting mix of locals here. I'm not sure what t","useful":0,"cool":0},"BomRiF5xM2RugfSPArqEsg":{"text":"I tried this place because. .ppl said they had good food. . They must been drunk. . Place ","useful":0,"cool":0},"l3S1_YXwDJ6HOgW8YpgT0Q":{"text":"You've changed something:(. Been dreaming about the roast beef Poboy for 4 years. \nWith th","useful":1,"cool":0},"hjRHRMBzAInPjqbBQGt-4g":{"text":"My husband's family is from Louisiana, and we go to visit often.  Of the 100s of po boys w","useful":0,"cool":0},"j516mPvNfGjYSgaOGAFIDQ":{"text":"New Update; Parasol's Problems\n\nAfter a few months of being very happy with the new owners","useful":4,"cool":0},"FNh5yXlkFgC4qfU5h_B9aw":{"text":"This is a review of the bar and area during the St. Patrick's Day block party and parade.\n","useful":4,"cool":2},"Ealn2Ph853zqd1Dq-WQ1XA":{"text":"There' a sticker on the wall that said \"people hate on Yelp.\"\nYou'd think with the sign th","useful":0,"cool":0},"bMYz0BBPQkNGpMNipRiPwg":{"text":"Had this for lunch as my first time in New Orleans. It was for sure yummy. I had the red b","useful":0,"cool":0},"HCLuc_4SUGCCpf04s0Iu8Q":{"text":"Update:\n\nMenu changes; some good, some not. \n\nOysters are now fried in some sort of batter","useful":1,"cool":0},"jfSWWuXk3zJ78j8z-6JG9g":{"text":"What a great little spot! The spicy shrimp po-boy that my partner-in-crime ordered was del","useful":0,"cool":0},"DaOwBqLLNgF2Cs9s01rrmg":{"text":"Got the shrimp po' boy and fries with gravy here. The po'boy was amazing! The place is ver","useful":0,"cool":0},"BpDl2N5V02R_TFrG0vIU1g":{"text":"Perfect Hangout. The roast beef po-boy was very tasty, and had slices of tender meat inste","useful":0,"cool":0},"6-DelF3_Ly3YXUgNg_ZTLA":{"text":"Definitely a fan! Great to be able to enjoy a beer and a po boy here. Then likely more and","useful":1,"cool":0},"gEZZ2PcDHqHmiO2P7HWjYA":{"text":"Living on the west coast, I've never had a good po' boy until Parasol's, and now I'm spoil","useful":1,"cool":0},"JZS5J-huBsgc863ap05LLw":{"text":"The good & the bad:\n\nJohn has decided to use over-breaded panko shrimp instead of the trad","useful":0,"cool":0},"sRg4CX4OdMn-M_S5PF863g":{"text":"Got my po-boy fix again. Best place in New Orleans. Yummy. I would go for the Shrimp Po-bo","useful":0,"cool":0},"i9EhfLQuiV6IYcl8e4Tmkg":{"text":"They are famous for their beef Po-boys and rightfully so.  We tried to duplicate at home, ","useful":0,"cool":0},"YVyByv25hpCxmU6D6oY8Bg":{"text":"My friend and I decided to go to the bar instead of to the restaurant and we ordered from ","useful":1,"cool":2},"csMVN3ZOCRMY55ZPaao6-A":{"text":"Went here looking for the best frozen irish coffee and ended up staying all evening. Fun p","useful":0,"cool":0},"H6dpPtlCDLIJ9vLmosD0VA":{"text":"This is a true dive but the Po-Boys are sooo good!  You must try the fries with gravy & ch","useful":0,"cool":0},"ePv08PtwuD4uElGXa5OhBw":{"text":"Stumbled into this hidden little bar and had the firecracker poboy which had just the righ","useful":0,"cool":0},"Y2U293XtAkBmnywPeDoBcg":{"text":"We knew exactly what we were there for and it didn't disappoint... arrived minutes before ","useful":1,"cool":0},"TZ--GjdOGeLJa9-TmUtoRw":{"text":"Went there recently because a friend (who knows New Orleans really well) was raving about ","useful":1,"cool":0},"cQP2_p4GlLKoKIsGG57zDw":{"text":"As hole-in-the wall as you can get, but boy does it deliver. The entrance of the restauran","useful":0,"cool":0},"5a33FnnZyPlIMR8WXk3Y6Q":{"text":"I've lived in this city for 10 years now and just had my first roast beef po boy from Para","useful":1,"cool":1},"e5qLWvhu7tzR-MHq0ODEbA":{"text":"Great little spot for what it is. It's a dive bar with some authentic local cuisine.  It's","useful":1,"cool":0},"fCqfSNp8iQZJPKl7_HZpiw":{"text":"Everybody has different opinions on the best Po boy in the city, but this place gets my vo","useful":0,"cool":0},"UkIb38fF3Duf86kFA1x9iQ":{"text":"I LOVE NOLA!! Funny thing is, I don't drink, smoke, or flash my titties! BUT, I LOVE this ","useful":0,"cool":1},"Hl9cxpj9Ns5rq2lFnx0LhQ":{"text":"More like a local bar/pub. Had the bbq roast beef po boy and it was DEF very good. Atmosph","useful":0,"cool":0},"ncCPa28cSXBWzt30oC763Q":{"text":"Come hungry and enjoy every bite!!\n\nBaker and Biker split a fire cracker shrimp Po' Boy an","useful":1,"cool":0},"tz9w98-3WQjsQmSC-JhFaQ":{"text":"Another place I found through Yelp. \n\nThis was hole in the wall type of restaurant. I didn","useful":0,"cool":1},"UnLhmZpqcfPjTGTKABNTNQ":{"text":"I come here for the service.  Bartender was so courteous in explaining why they were out o","useful":0,"cool":0},"AXJ98O-kmP2X6PalPAeaCg":{"text":"We came here late one night and just missed the Po Boys, so sad. But my group had a blast.","useful":0,"cool":0},"V_bSM-1gjivqA63ROE7dIg":{"text":"Don't miss this. Cheap beer, fantastic Po boys. If I lived in Nola, they could just prop m","useful":1,"cool":1},"g2AlY4HqrdznmyYDZzoQ1w":{"text":"Drove 20 minues to get a firecracker shrimp po boy, and they closed early...\n\nGrr\n\nBut sti","useful":1,"cool":0},"15ynFEpHpPq3k60qor1j5A":{"text":"Best poboys in NOLA. I actually managed to stuff down an 18 shrimp poboy as a youth here f","useful":0,"cool":0},"XcjnBDIer4-aGmZ0mD1siQ":{"text":"The Irish sundae is the truth! (Potato salad topped with roast beef debris and special sau","useful":2,"cool":0},"DIeLJVPcHTcMuPeMKjf-eQ":{"text":"Delicious cheese/gravy fries... Good atmosphere. Roast beef po boy was good. Can't compare","useful":0,"cool":1},"ab1J-GjiBlA_7ZSURdhfMQ":{"text":"I took some visitors here the other day.\nThese visitors were my 21 year old cousin and her","useful":3,"cool":4},"8BDkCAFkcdrCMMxWesD9aA":{"text":"This dive bar is the epitome for New Orleans. The bar staff is awesome. Their firecracker ","useful":0,"cool":0},"XflFDrf9HyHWlIDG4F4r6w":{"text":"This place, by far, has the best Shrimp Po-boys I've ever had, just make sure you dress it","useful":0,"cool":0},"bzx24-YIxaNJ5T_CBcwjeg":{"text":"Firecracker shrimp po boy is a must!  We almost always make a point to eat at Parasol's wh","useful":0,"cool":0},"f4b11Y9lstSKokiWlT8Y0w":{"text":"The food was amazing! Especially the Irish potato salad Smothered in gravy with roast beef","useful":0,"cool":0},"IADMR-1lezbX6sk5LX0jUQ":{"text":"I got the firehot shrimp po boy and it wasn't quite what I expected. I wasn't sure what I ","useful":0,"cool":0},"WPdfaYIN0SFjWhtEvtANMA":{"text":"In a city saturated with sandwich shops, you can find arguably the best po-boys at Parasol","useful":0,"cool":0},"VNdywxCp1lQMsxQrXC0L5w":{"text":"The bar is small and a bit run down looking, mostly a place for the locals. My kind of bar","useful":0,"cool":0},"PoW1FiZyQ6_0B6vp0XkKhw":{"text":"Best roast beef poboy in town","useful":0,"cool":0},"g8vnf5_z1oZeL2jLXkQauQ":{"text":"Love this lil' bar, though it's obviously more of a locals only place. Hub of St Paddy's d","useful":0,"cool":0},"rOtoD0-5uqUCaiZDoQXnDA":{"text":"So the food was good. I had the firecracker shrimp (more of a buffalo shrimp) and the boyf","useful":0,"cool":0},"mGWqWOmtcNl3P0iC8Smd6g":{"text":"I loved almost everything about this dive. I almost gave it 5 stars but the roast beef po ","useful":1,"cool":0},"JP6pFubz1FItULzm86FRpQ":{"text":"Huge portions, might wanna share with a friend or come extremely hungry","useful":0,"cool":0},"GgzS3PPhdobJJHbjgsN16A":{"text":"The firecracker shrimp (think buffalo sauce on fried shrimp), roast beef, and oyster poboy","useful":0,"cool":0},"YXj2O-wWwLuu0tcAuYCCAg":{"text":"Food is salty. The place is filthy. Recommend Tracy's down the street.","useful":0,"cool":0},"mNX0EpIZxWi_cGfLPfjyog":{"text":"Good quality oysters, non-greasy batter, and nice guy fryin' 'em up.  Just didn't much car","useful":0,"cool":0},"cfr9ubSk6qtGH5TnTW6kmw":{"text":"Best PoBoys in the City. Sure, the atmosphere leaves something to be desired, but being a ","useful":1,"cool":0},"LG8yflDl4TfuONHIz59Kng":{"text":"Hungry after a walking tour of the Garden District and Lafayette Cemetery, come check out ","useful":2,"cool":0},"7LZLVmEznFpx7QEpHqjVXw":{"text":"NOTICE\n\nI was at Parasol's last night and learned that John Hagan, the co-owner & manager,","useful":0,"cool":0},"dGxaYxcFObe4I3P1tm9TWw":{"text":"The place look so dodgy and dirty when we walked in. We just thought about the reviews and","useful":0,"cool":0},"aYtVZDdTmNTZPa_ztw25-g":{"text":"I had the oyster po-boy and was not super impressed. I would have preferred for the oyster","useful":1,"cool":0},"QSEkDa3Z0QqYqHFyzZgpmg":{"text":"Eating the shrimp poboy ! OMG! Shrimp are seasoned amazingly! Not sure there are any shrim","useful":0,"cool":0},"iTTdeQCV4rsbPSA44HFVng":{"text":"Solid grub. Nice people. Restaurant upstairs from bar.\nHad the firecracker shrimp po boy. ","useful":1,"cool":0},"-KKRbaImqZSPjr2ClB5eGw":{"text":"Fantastic beef Po boy sandwich. If the number of napkins has anything to do with how good ","useful":0,"cool":0},"MgMjg2PycoQCOBBAr5bUdQ":{"text":"Just moved in two blocks away from Parasol's. I am so excited to be living down the street","useful":0,"cool":0},"YiIup-4bJN81Ny7_HeQ7mg":{"text":"I simply loved it! The super dive bar, the hosts, the people attending and the incredibly ","useful":2,"cool":2},"feLVf0J70uaKx0_YiEQeBw":{"text":"Get here. The bartender Curtis is great. My dude and brother got food and loved it. Shrimp","useful":0,"cool":0},"H8K5aBgArDdwJsVf6ZTpyA":{"text":"Amazing! Probably some of the best shrimp I've ever had! The firecracker sauce on them is ","useful":0,"cool":0},"iCEydGvEkEtAGf7-cndASA":{"text":"We just arrived in New Orleans from Houston and did not know where to go and eat by our ho","useful":0,"cool":0},"VlbjVCZbuVSWhZk18VuZ4w":{"text":"Went here today to have my first New Orleans poboys. My wife and I split a shrimp and roas","useful":0,"cool":0},"xWCP0IKCzsc0XJaz2EQGiA":{"text":"I went here because i saw it on Triple D.\n\nI got a grilled turkey po'boy. Oh man was it am","useful":0,"cool":0},"lrc7VeMZPNagVS1GxD_4KA":{"text":"So delicious, first and best Po-boy I've ever had!! Firecracker shrimp was to die for!!!","useful":0,"cool":0},"iPU4q8O8gGP97oNnRIvPNA":{"text":"Now this is a tough sell I'm sure, but...the firecracker shrimp po'boy...was great. Apart ","useful":0,"cool":0},"oRawwl3Vg3zp_a8XpXh0KA":{"text":"The menu says it all:\n\n\"If you haven't eaten at Parasol's lately, YOU HAVEN'T EATEN AT PAR","useful":7,"cool":1},"5vBeydmImAerJkTR_RhJEg":{"text":"Smells awful! It might be a one day issue or regular smell, can't tell. Food was fine. It ","useful":0,"cool":0},"b9Iu910uKHhZjJUAxVRDUQ":{"text":"We shared a half shrimp/half oyster sandwich. Really delicious. The oysters were fried per","useful":0,"cool":0},"Rj9FUZqoYyIJhPcs1BSwKw":{"text":"We ate here for lunch and ordered the roast beef with Swiss po-boy. We have been talking a","useful":1,"cool":0},"BQYrs1Bslqppnaz1hgxPng":{"text":"Don't let the appearance of the place scare you away. This place is the definition of a di","useful":1,"cool":0},"ytv6K9XyUtiwy0QSz9eiKw":{"text":"Worth the wait!!! We stopped in on our way out of NOLA and wish we would have stopped on t","useful":0,"cool":0},"DEtu9owCA7T3nUG6Mh4pkg":{"text":"If I lived nearby, you'd have a hard time dragging me out of this shabby joint.  Small, cr","useful":4,"cool":2},"8xElQqfBs98-6jfajXciBQ":{"text":"Hidden dive in the Garden District. Bar downstairs and tables upstairs where you can watch","useful":1,"cool":0},"3TTovB6PTEnpn86Lq-ohOA":{"text":"This is a traditional New Orleans neighbor bar, that also makes a great Po Boy.  Do yourse","useful":1,"cool":1},"aWHJw52n7EB_gs08UL-eYQ":{"text":"We came on new years day for some bloody Mary and a po'boy to deal with the hangover. The ","useful":0,"cool":0},"jqp_2ShVr4IEZbjk4rC_Lw":{"text":"Legendary for a solid reason. Must visit when I'm Nola for their roast beef po boy or any ","useful":0,"cool":0},"ukIfsjwfAh6uwEJoSnkpiw":{"text":"This is one of my favorite spots in NOLA. I've only been here a short time but Parasol's h","useful":0,"cool":0},"Lmoe7qdPE1actXKulNN-Eg":{"text":"Absolutely an amazing Roast Beef po' boy. Perfect in every way. \n\nThe bar and restaurant h","useful":2,"cool":0},"M4OQjWsI4m-Mot9YqGLqdw":{"text":"Parasol's has excellent food. We shared a fried oyster po boy and roast beef po boy. The r","useful":1,"cool":0},"TK1MULC4yezSpnvrjsJPeQ":{"text":"The best poboys in neworleans. Ive been coming here with my dad since i was alittle girl. ","useful":0,"cool":1},"gOS5SWq2J0IC69zGdJGLxg":{"text":"Get the shrimp and oyster Po' Boy and don't leave until a local drunk knights you with the","useful":0,"cool":0},"rMyNk6bH0p5eNySny4H22g":{"text":"Great po boy, friendly staff. It was great to get a sandwich and beer in what is obviously","useful":1,"cool":0},"pZNSO_tILQd9-cE-RgYCzQ":{"text":"When I return to a place I base my decision on 3 things 1) good food (catfish po-boy - bes","useful":0,"cool":0},"uylUvEGG7puoJiwuHBDWrQ":{"text":"Don't get what the great reviews are about. The firecracker shrimp po boy was admittedly p","useful":0,"cool":0},"Y8j6YeuATf3tiVLXZP90aQ":{"text":"Friendly bartenders and great food! Can't stress enough how much I love this place. I'm he","useful":0,"cool":0},"swx7D3FWpEOowX5RM0giLA":{"text":"BEST roastbeef in town!  I don't care what anyone says.  The gravy is insane and the bread","useful":1,"cool":0},"JVhkLxbfS5wyi3lPEBZ6BA":{"text":"Find your way to this local favorite to enjoy awesome po-boys (the roast beef is the best)","useful":0,"cool":0},"h1Vorb9cfSibQNihK0tBzA":{"text":"First of all I have to warn anyone who loves their Jack Daniels if they are going to Paras","useful":2,"cool":1},"KpCr8QSSQbx0Al8vtonOwg":{"text":"Best roast beef po-boy in town.  Dive of dives, but that's part of the charm.  Super frien","useful":0,"cool":0},"dAaygrXdtavRvMvLz8Wdaw":{"text":"My first ever shrimp po'boy and the standard by which I will measure all others. Outstandi","useful":0,"cool":0},"9Dq_1QsdUl0kx4ZkXQcfXA":{"text":"Stopped here while on vacation before. As a plus, it has the feel of a local place. The fo","useful":0,"cool":0},"3hR1DHOWYJFYlJoIL67QFw":{"text":"Found this place by chance and it was fantastic ! I had the firecracker shrimp poboy  full","useful":0,"cool":0},"5qQOci0O4OvpjIQ7sD2whg":{"text":"Sandwiches are my favorite food ever, and this one takes the prize. I actually had a dream","useful":0,"cool":0},"L0Q2Ek2yLDEu14OGB-w6jw":{"text":"Had my first ever po boy here.  A shrimp one.\n\nIt was extremely crowded and took about an ","useful":0,"cool":0},"B-30sQ2MiDGvJH9Z6z-gkg":{"text":"The gumbo was tasteless. I had the famous roast beef po boy. The beef was very tough and t","useful":1,"cool":0},"WSh9leBqJ4grb5D6cPvq0Q":{"text":"A friend recommended this place for a good po boy. We were staying in the lower Garden Dis","useful":0,"cool":0},"bbtFGBZProv61jO-NxvrZA":{"text":"This is not your neighborhood friendly bar. At least it isn't if you're not the same race ","useful":1,"cool":0},"hoTZZu672FEiwK7xllzhOQ":{"text":"Their bar is a nice dicey kinda joint. The bbq beef po' boy was really really messy. But b","useful":0,"cool":0},"TEAMUGmCYjiZ0D0jTuBrtw":{"text":"I've been to Parasol's a few times over the years.  Only to the restaurant though, never t","useful":1,"cool":0},"iDNSLk4w7zy2_Akzw1D05Q":{"text":"I was worried when parasol's changed hands, but the new owners have done it well! It has r","useful":2,"cool":0},"-m5lbUH8F-YW--FifBEY0A":{"text":"Ok, let me say I am from New Orleans..so after seeing this place on TV I was ready to be b","useful":1,"cool":0},"rlwSNzeC8l3OEzjUYHq7PQ":{"text":"Its all about the shrimp po-boys, the roastbeef po-boys, potato salad, and the meat pies..","useful":1,"cool":1},"XtkIadRmDf5mu-sXws9T9w":{"text":"We got off the hop-on-hop off and wanted to grab some lunch anywhere quick...found this li","useful":1,"cool":0},"migfM7jlpwaYCkVtxj22ew":{"text":"Whenever I come to New Orleans, I have to have three things...Jambalaya, beignets and Po'b","useful":1,"cool":0},"F6iy8VHYnjx6QVagSEkI0Q":{"text":"I don't feel like I have the right to review this due to my fledgling po-boy knowledge...B","useful":1,"cool":0},"v05OxnhyepZqXRLpAcpQ-g":{"text":"This place is great. Fantastic po boys - we had the roast beef and the smoked pork - and a","useful":0,"cool":0},"yDR1x2nSRAIuuxLC5I0rFw":{"text":"We ordered the cat fish po'boy, gumbo and fire shrimp po'boy. The Po'boys are on point. Th","useful":0,"cool":0},"EKRVe1lz5AzmqQZ23iE_NQ":{"text":"Service (especially if you try to dine in the food area) is horrible. Firecracker Shrimp P","useful":1,"cool":0},"a_tERqFwdtJXI1-Fx-H4Qw":{"text":"Stopped here on a whim for lunch because we weren't dressed up enough for Commanders. Exce","useful":0,"cool":0},"IPWERt0cOpEBhQvw7DnW7w":{"text":"In a town of outstanding food, this place stands out.  Why?  Because it's awesome, that's ","useful":1,"cool":1},"YCPCFEAiMr3y-Ww_U3DZSg":{"text":"The firecracker shrimp Po boy is a must try. After a tour of the garden district this was ","useful":1,"cool":0},"mXxbMwpslTNz2l7u2YoZtA":{"text":"This is exactly what you're looking for in a dive bar.  High class, it's not, but if you c","useful":3,"cool":3},"hcdwwKuqK4HDQvZqhOAWmw":{"text":"The grilled chicken sandwich and the firecracker shrimp sandwich were both really deliciou","useful":0,"cool":0},"QX4tpomNptxBXzJQzoKf9Q":{"text":"By the end of my third bite of the roast beef po boy, I had called it \"transcendent\". \n\nHa","useful":0,"cool":0},"V5qsGCAoNSgkhIvZb0yx9A":{"text":"Ordered the Fire Shrimp Po' Boy after reading reviews. All it was was fried shrimp drenche","useful":0,"cool":0},"OSdB8VYTNCE9_uKXnP4Udg":{"text":"My favorite bar in the city for low key hanging out.  This is a place for sitting at the b","useful":3,"cool":0},"a6DWWGtQPGHbgsMRaCHxsQ":{"text":"Don't waste your money. This is the worst place I've been to in my life. This place is fil","useful":3,"cool":0},"keIPMKEnlOwN35dKkH_hmg":{"text":"FirecrAcker shrimp is where it's at. And fries with debris and cheese. Gravy on roast beef","useful":0,"cool":0},"09myrf-p0cgPZtfaGHQIyg":{"text":"Had the firecracker shrimp poorboy and it was to die for!  Enjoyed chatting it up with Car","useful":1,"cool":0},"HIGOVQ_nxyJRX_09JHFaVQ":{"text":"Ok, I went to New Orleans for Mardi Gras.........you fill in the blanks here, pictures may","useful":2,"cool":3},"J0Fr3xlblrdOiAmZKgJVRQ":{"text":"What an awesome local treasure in New Orleans! My mother in law from Ohio wanted an authen","useful":0,"cool":0},"nxHU2AKzNFNI77c8GWivCw":{"text":"One thing New Orleans can be sure of is that no Islamist group will choose the city to be ","useful":2,"cool":1},"xdpZjDdQE5kZW8JDkOix6A":{"text":"The most delicious firecracker shrimp po' boy!! Super speedy service and cool atmosphere! ","useful":1,"cool":0},"8bcxbyjl5464wMzWNLki9Q":{"text":"Billy was kick ass!! We got referred here by another bar for the poboys. Omg!!! So glad we","useful":2,"cool":1},"aOTDtsKyUUydx6lnT1ac6w":{"text":"We were lucky to find the place, accidentally, on purpose. Firecracker shrimp po boy and b","useful":0,"cool":0},"cIVVEIi0vDf4V_wWkYNJfw":{"text":"This review is for the restaurant upstairs, as we didn't come here to drink. I highly reco","useful":1,"cool":0},"0qSW175AB8q31dGd_kMl7A":{"text":"Yep. I'm one of those people who saw this place on Food Network and decided to try it out.","useful":0,"cool":0},"hnNR2z2Cz3eIpPhFiGFCkw":{"text":"Great local joint.  Wonderful roast beef poboy.  HUGE.  As a New Orleans native, I recomme","useful":0,"cool":0},"pA86k675hvIzulj4Csaq3g":{"text":"Here is the deal. This place was originally owned by the folks who now own Tracy's on Maga","useful":1,"cool":0},"hqLsjj7ddKtlwhUnPKLjMQ":{"text":"Oh oh I love this place! A good old fashioned bar with a great bartender pouring local bee","useful":1,"cool":0},"Kme-W7gkWmoZmaoyGdEJBw":{"text":"Holy crap...this is horrible.  I went there based on the great reviews and their spot on F","useful":0,"cool":0},"1Zq5Rs9KPF5e5OTWPctYmQ":{"text":"So much about this bar fills my heart with joy:\n\n- Super dog friendly, pups sit on the bar","useful":1,"cool":0},"20P8-g2_KreNhZjcmo_EPw":{"text":"Ok. The roast beef po boy is phenomenal. But, there's a chemical smell in this place that ","useful":2,"cool":1},"Xzd_5BC56P6EisVmTCTW0Q":{"text":"Had the BEST half 'n half po-boy (that would be shrimp and oysters) ever, there this past ","useful":2,"cool":2},"35Zehn8MyPaqrJc2NaoVGw":{"text":"The roast beef po'boy is HUGE and tasty. Could easily be split. The atmosphere and on a Su","useful":0,"cool":0},"eNO8LW1WbTDzVutSqzY42Q":{"text":"If you're coming to the place looking for a fine dining experience get lost. The place is ","useful":0,"cool":0},"EoH56zsu5Gw7OfG0PChVtQ":{"text":"Pretty good roast beef po boys, but I like Parkway's better. \nGreat bar for watching a gam","useful":0,"cool":0},"uz7sHMbpE7fWdj8FfUo8Cg":{"text":"The roast beef po boy was the best!!!!!! The best sandwich I had in New Orleans. However t","useful":0,"cool":0},"Vyk_-D0SLqUJgIQxdUSyWg":{"text":"We found this place featured in Diners, Drive-ins and Dives. My husband ordered a shrimp p","useful":0,"cool":0},"bNwwrIs6oVeBnpyg3YJvfw":{"text":"I eat a lot of roast beef poboys, and Parasol's has one of the best. It's also a good spot","useful":0,"cool":0},"x8ZUXQIDuZzrp-C8JqGWGA":{"text":"Yep, Parasol's gets that 5th star. The bar is small and Cheers-like, populated by regulars","useful":0,"cool":0},"Fd6fmWcLR3x3ze6gJxcziA":{"text":"Great po boys particularly the shrimp po boy. Fun bar to watch a game. Fries are not that ","useful":1,"cool":0},"aI6XBVNEEXuMi_1gnsf_dA":{"text":"Fun dive bar to go to on Saint Patty's Day.  Block party down the road from Tracy's with e","useful":1,"cool":1},"8Rg8utWCmPzzC9ILQNEOWQ":{"text":"Firecracker shrimp poboys are amazing. The ice in the urinal in the men's bathroom keeps m","useful":1,"cool":0},"xdjsGrcDYxUUeie3EjuvrA":{"text":"Two ways you can get in. Go through the bar and head upstairs or use the  back door a coup","useful":0,"cool":0},"BHCUNVQLJz2oK27IxRGvxQ":{"text":"I heard about Parasols from a NOLA native I work with in Dallas and had meant to give it a","useful":1,"cool":0},"s43t7jcFeOVoXVYEjZ0IxQ":{"text":"Roast Beef Po-Boy = best po-boy I've ever had. Amazing french bread, juicy roast beef with","useful":0,"cool":0},"506RcI9lwftwv-_gr8MVqA":{"text":"One of the best poboys in new Orleans hands down! I've been to all the good poboy places i","useful":1,"cool":0},"ZflZc4zLdBGPVm7BdGdjWQ":{"text":"BEST. ROAST. BEEF. PO BOY. IN. TOWN. I'm local and I've had plenty of poboys. But this is ","useful":0,"cool":0},"1_DY4sXWKFC37LVNroam0w":{"text":"*BEST*\n\nPO BOYS\n\nEVER.\n\nThis is all...\n-you need to know.\n\nBut...\nIf you want\n-to know mor","useful":5,"cool":3},"pTZ4eI20WZbVWSYZXWb0qw":{"text":"Bring an appetite and a bib...you'll need both.  The best part of the experience was shoot","useful":0,"cool":0},"DtkCohoQmf9UZPm0rwi69Q":{"text":"I have to say i have had much better Gumbo, that was a bit of a disappointing start.  The ","useful":1,"cool":1},"ra7MyOqUG5x-TgZQh9ETCg":{"text":"Hole in the wall? Yes.\nDive? Yes.\nA bit sketchy? Yes.\nBest RB sandwich I've ever had? Yes.","useful":0,"cool":1},"w0XfBh-Q34UaVLQOTrrmJg":{"text":"Solid po-boys. I got half-and-half with the firecracker shrimp and catfish. The shrimp was","useful":0,"cool":0},"HtWu6Cpo8dJ6YdV22woFwg":{"text":"This was the best Shrimp po boy we had during our week in NOLA. The spicy one. Tons of shr","useful":0,"cool":0},"t9HnK5ZhwTE_GVu_G8ErsQ":{"text":"Good local feeling spot.  Nice people.  Good po boys!  Walked through a very divert my bar","useful":1,"cool":0},"AwKt-l-hOGA4PKCfbtCUHg":{"text":"My favorite meal in NOLA hands down. We were in the Garden District and had just got done ","useful":6,"cool":2},"X23z1JaQHqbbyJmaM_UdVA":{"text":"I'm really growing to like Parasol's. Although my previous review still stands, I've come ","useful":0,"cool":0},"xbFzD6-B6LQyERxOkgNvVA":{"text":"I didn't really get a sense of the restaurant or bar, as we came here for a block party on","useful":1,"cool":1},"L4ypzVqRl1ZH-vR3B5_daA":{"text":"HUGE portions that were perfect after a night on Bourbon. Hole in the wall, but I'm so gla","useful":0,"cool":0},"FCcOuj9xWaI0dLQjZUeDpA":{"text":"\"PARASOL\"\n\nParasol's, the original, Constance @ Third Streets in the old Irish Channel, ha","useful":1,"cool":0},"w7NFpYQAaE6ttomY-yos8g":{"text":"The food was o.k. but the service sucked. the lady taking our order had a bad attitude.","useful":3,"cool":0},"dl7w88wJXRfUPe3X8dD6Qw":{"text":"Went on Monday closed due to change of ownership.  What a disappointment.  I'll try again ","useful":1,"cool":0},"rsd9NWr7fLnc-HPyPZRtbg":{"text":"Best, first, and only muffaletta I've ever eaten. I was, however, told I shoulda gotten th","useful":0,"cool":0},"hpPuRiN8vZEXCpjIsXQ5-Q":{"text":"So good that I'm rethinking my career choice and contemplating opening a roast beef po boy","useful":0,"cool":0},"nmU0uzwHJ7u3iPxA_Uhiig":{"text":"I'm so sad at what's happened to this place. I'm a native New Orleanian and am fiercely lo","useful":2,"cool":1},"_uLDjBFlFoaKiBjPXBkm2g":{"text":"I have had the roast beef, the fried shrimp, and the hot sausage patty po-boy and they are","useful":0,"cool":0},"wFvcnf0G2jYIK442CWn9kQ":{"text":"Highly recommend the Roast Beef and Firecracker shrimp Po Boy. Hoagie bread is a nice Ital","useful":1,"cool":0},"pUF89tWZIiOb6h2C6DN0fA":{"text":"If what you're looking for is an authentic culinary and social experience while in New Orl","useful":5,"cool":2},"ohglYK3I319taaxOo2TeeA":{"text":"only in NOLA....\n\nsomeone had a pig on a leash in the bar.\n\ngo upstairs to the \"kitchen\" a","useful":3,"cool":2},"InboakAdDTxcPH3wQLc2Zw":{"text":"GREAT FOOD! Been there like 15 times and I loved it. They have great service, everyone kno","useful":0,"cool":0},"TJE8zt0G1gx6d6-e0W9ZOQ":{"text":"Parasol is a bit of a local gem.\nI went with a group of friends and we each ordered differ","useful":1,"cool":0},"R-oi14_DtbRtctI1lqLD_g":{"text":"Yelp has never let me down, until my trip to Parasol's. For this let down, I have begun my","useful":0,"cool":0},"CAY2qUc82Z-ZVv5Fja4zMQ":{"text":"No idea how this place has so many great reviews. 1. The wait was super long for no appare","useful":5,"cool":1},"K68sqxGirD7eq_DTkp5cxQ":{"text":"It's good, not great!  Parasol gets all the hype, but the RoastBeef Po-boy was average.  F","useful":0,"cool":0},"QTxN8HVrLaKsQcHTu4uODw":{"text":"This place is the BOMB! Located in a hole in the wall place, has a bar on ground level and","useful":1,"cool":0},"jTQffuDfnQeHK1iNKl04og":{"text":"This place needs some serious attention from management that CARES, if that exists in this","useful":0,"cool":0},"YudkEtNwzqVIZ_A75T8AJg":{"text":"Firecracker shrimp po boy is amazing!! Literally the best one I have had in New Orleans! J","useful":0,"cool":0},"Kn4VN4smig2BzAj9WCzpnA":{"text":"Disappointed after reading the good reviews.  A large portion of standard fries for $2.75.","useful":0,"cool":0},"An_8cQn4RbJuQrNzNtJgoQ":{"text":"I've been here three times over the years, each time  apparently forgetting how meh the fo","useful":0,"cool":0},"zqHYtKfyQ-tVmCQnzgpbQw":{"text":"Amazing, as always. The regular is HUGE! Definitely enough for a regular and a side for tw","useful":0,"cool":0},"S5JBWV6CwrujIpRCsYqjsg":{"text":"Solid poboys and a nice quiet bar attached. The only thing not to like is the smoking poli","useful":1,"cool":1},"w-zHKQINv3jjW73uaAwI4Q":{"text":"This place is a hole in the wall! There is a bar downstairs and a dining room upstairs. It","useful":1,"cool":0},"BBxUPKjPtvNtW_pYeGDS-Q":{"text":"We visited based on the recommendation of a friend who lived in this neighborhood for seve","useful":0,"cool":0},"ONtHigTeL6m17AQggKekLw":{"text":"Update: Parasol's, the original on Constance Street........\n\nThe diatribe by another revie","useful":0,"cool":0},"r1GPMr-3vxBTc8gqgecNqQ":{"text":"If I were a fan of brevity, here is how this review would go:\n\nGo find Charles H.'s review","useful":3,"cool":1},"-7XMnWWe8dhHqRnTdL1smQ":{"text":"For Someone who's working in the service industry I am not happy with this place whatsoeve","useful":1,"cool":0},"kUHR4YDbxkEGZvlnyZ4o7Q":{"text":"Do not be afraid! This is a neighborhood hole in the wall which gives off a vibe that coul","useful":1,"cool":0},"Atwv9rKrLp4N-YW2tDPnLA":{"text":"This is by far the most absolute best food I've had while in NOLA. The roast beef pork boy","useful":1,"cool":0},"Rpi6n0GDRnNYVNlyitvpUg":{"text":"Don't let the appearance of this place fool you. The food was AWESOME, the ladies who work","useful":0,"cool":0},"hWsE5jxWgbu8npEnmiFzBg":{"text":"I went there once based on Yelp! Reviews and recommendations. The place is split into two ","useful":2,"cool":0},"pRM4F8QuJR5rBk7RtDSFUA":{"text":"It is what it is, I guess.\n\nWanted to try some of their famous food.\n\nWalked in the door a","useful":3,"cool":1},"eAr8yW7DIXE-9hhAcVWJZw":{"text":"Met Chad in restaurant depot on new year's eve. Boy am I glad I did! He suggested 5he roas","useful":1,"cool":0},"Q8tr2qri0_2te0LLrE9xcw":{"text":"What happen!?  What happen?!  This place was the Holy Grail of the roast beef poboy and it","useful":4,"cool":1},"n2gSzlE669slB4H7M_gCvw":{"text":"Update:\n\nI discussed the seafood breading with the owner, John.  He insists that the stuff","useful":0,"cool":0},"a6gOnKUI-DmVTdx-61nW5w":{"text":"The po-boys at Parasol's were really great!  I recommend the oyster po-boy and bloody mary","useful":2,"cool":1},"352Mtsa3AarvdZ0UrLPcfw":{"text":"A fav place to take visitors. Down 2nd street and into what is the definition of hole in t","useful":0,"cool":0},"FR40dDYJlWh44tiUGwzhzQ":{"text":"Every neighborhood should have a friendly bar like this. Cozy, nice patrons and bar staff,","useful":0,"cool":0},"0cCwPqX2qFlaWrL_bgDn_w":{"text":"Another great local joint in the Irish Channel. Great people to talk to and you might even","useful":0,"cool":0},"rjub0u9xCeC6sQHwkdXQQA":{"text":"Enjoyed the poboys and the unique \"Irish potato salad\" which was a nicely cooked and seaso","useful":2,"cool":0},"guWRBHDpPLPWuy4qE3oqew":{"text":"Ah!!!! I don't think I've ever had a bigger Yelp fail. How on earth does this place have 4","useful":4,"cool":4},"htBiqYAvgxhg7eoFG7yP9w":{"text":"Down there for wedding and everyone said we had to come here for shrimp poboys, and boy we","useful":0,"cool":0},"9m0efLz5-5mNNfvaTO6a5g":{"text":"This pub is split into two areas. You enter what looks like a normal dive bar. It is impor","useful":1,"cool":1},"MSexqXdfY3Tjsb-6DaHg0Q":{"text":"Small local's bar that has some of the BEST po'boys I have ever had. So good in fact that ","useful":2,"cool":1},"rsVhmcxZtbffMW_6zRPgfQ":{"text":"BLUF:  Best roastbeef and muffaletta in the city? Possibly.\n\nAwesome divey place in the lo","useful":0,"cool":0},"w8DoZkc62pum8mKecY1d7A":{"text":"Come here for excellent Po' Boys or if you want to participate in a raucous, Irish bar sce","useful":3,"cool":2},"vqFvIvgvOzOvXmPEhZf3EQ":{"text":"For a dive bar with little vegetarian options, they have a delicious veggie burger. It was","useful":0,"cool":0},"JgNnH7xChvfF6clN_wnJ5A":{"text":"My friend and I popped in to Parasol's after a long hike around the garden district. I lov","useful":0,"cool":0},"48wDtXNnkqPV7D5ipU0_hw":{"text":"I didn't have a Po Boy , I was stuffed and swollen from breakfast and a previous night of ","useful":3,"cool":1},"-9hQrokBmPQmM-tVhnBxsA":{"text":"Me and my friend got a recommendation from a local to come here for their bloody mary, whi","useful":0,"cool":0},"zRNZ9PCRQEb3cjQ1U-uP_g":{"text":"A few months back it was made abundantly clear that I wasn't welcome anymore at Parasol's.","useful":3,"cool":1},"CfuGio-6gTvk7HU8w2Uk6g":{"text":"I want to give the restaurant a 2.5, but since I cannot, I will give Parasol's three stars","useful":0,"cool":0},"IgqpqH7UEoVL4vifkeBcXg":{"text":"Well after watching the Diner's Drive In & Dives episode featuring this place I finally ha","useful":0,"cool":0},"9JKX6opA61KA4sqc_IFN5w":{"text":"Paid for a Lyft to get here, with everything saying they were open, just to find that they","useful":0,"cool":0},"FKGAq2MvZ7A8FbhW_q41dA":{"text":"First time at Parasol's \nSat at the bar- placed our orders and we asked about the shrimp b","useful":0,"cool":0},"ErJMQsDewES1ll0v9SuSSQ":{"text":"Holy delicious! Tip them well because they're about to provide a food orgasm in your mouth","useful":0,"cool":0},"b-iYuRFUnz2bauK-85Ck2Q":{"text":"So we went down to the world-famous parasols that guy Fieri went to when he went down here","useful":6,"cool":4},"aiwx5o2l9iVXCnJZhY5kIg":{"text":"A hole-in-the-wall bar and restaurant. Heard the Po'Boy sandwiches were very good here. So","useful":2,"cool":0},"ba7h_V3MviK9h3HmrZ1oNg":{"text":"Went here for dinner and had that monster roast beef po-boy....the sandwich was good. That","useful":1,"cool":0},"017XERWkm2fZ8Ytk2uZP1g":{"text":"The roast beef was tasty but definitely sloppy but as long as it's good who cares?! haha..","useful":1,"cool":0},"xW-Rnx2fmZzBx7Ij6iaLRw":{"text":"Authentic. Fresh. Real big servings. Restaurant side seems kinda sketchy. The sort of plac","useful":1,"cool":0},"OqeF5mCnYm5mpLm8t48t3w":{"text":"Hot damn, this place was phenomenal. That's all I can say. It was a small place just off o","useful":2,"cool":2},"PZZHt1QNfPfVWE-FCXf6kw":{"text":"Ok, it's a hole in the wall attached to a dive bar, but the food is amazing! Best Po boy w","useful":0,"cool":0},"0b9s9gSV4n5IL0M4mX8aLw":{"text":"Po' boys and fries. Great food and fast service. Definitely get the different sandwiches.","useful":0,"cool":0},"xaRgVrVPL7tiXqyA3wJjWg":{"text":"Cute neighborhood bar a block off of Magazine Street. Seats about 20 people on the bar sid","useful":0,"cool":0},"Ww7eFT71J8MhLp5DV1IXAg":{"text":"Best. Po Boy. Ever. \n\nWhenever I'm near the area, I will travel out of my way to come here","useful":1,"cool":1},"fL40aLwZMFjjJIz9IRt7Qg":{"text":"New Orleans, Louisiana ---\n\n\"Parasol's\" is a neighborhood corner bar with good food, good ","useful":0,"cool":0},"FHBlpxY8YmoUXNYKr_yCRQ":{"text":"Stopped in here on a Friday night and it was quite the happening place! Bar was packed and","useful":2,"cool":1},"4O0Yigv2wytMnvQHZ1Z_Xg":{"text":"The roast beef sandwich is very salty. Too much bread.\n\nLots of fries.....not a bad thing,","useful":3,"cool":0},"hbAP7zfTV-ZQiysu83eFxQ":{"text":"This place is disgusting not going to lie. When you first arrive from the outside you can ","useful":1,"cool":1},"bC9GVMvbVFWJrrmKpw_LTA":{"text":"During our visit to New Orleans, we decided to get takeout from Parasol's. It was the wors","useful":0,"cool":0},"RxQ0C6ihylNAIiZRHFzdMw":{"text":"Came across this place on a walk in the neighborhood and it was a favorite during our time","useful":0,"cool":0},"aTU-Q4WU7EXo1q2GWv05mA":{"text":"I l-o-v-e this place! From their staff to their poboys, wows me everytime! I've been comin","useful":0,"cool":0},"_P8sKaWsFkpBt-zLqNnUEg":{"text":"Walked into this small dive bar after a hard evening at work for a drink. The bartender wa","useful":0,"cool":1},"SurLXc_mSVBJmWpVqqFK5g":{"text":"Great neighborhood corner hangout. Adults only at the bar but the back room is a kid frien","useful":0,"cool":0},"PI6_3n-wKSQtwViCgP_lXw":{"text":"This seems to have fallen out of hidden gem territory and into \"just ok dive\". It's old sc","useful":1,"cool":0},"GT9EQ1xdY-YfY24sfrrppQ":{"text":"Best damn po' boy I've ever had. Washed it down with a nice cold beverage. If you don't ge","useful":0,"cool":0},"GW6StzZdNmntDlf8oZ3UoQ":{"text":"The food was good , got a chicken and also a roast beef poor boy plus cheese sticks , the ","useful":0,"cool":0},"r-jJxlrmvcLzoOAUdn8TZg":{"text":"I last visited here seven years ago and I'm glad that it's still just as good. The gravy f","useful":1,"cool":0},"kdvXkIytgpVXdr8TYknJ-g":{"text":"WHY PARASOL'S SMOKED PULLED PORK PO'BOY IS ONE OF NOLA'S BEST:\n\n1.  SUCCULENTLY SMOKEY & M","useful":12,"cool":6},"YTtCZiPsbMM8N06kRQb0Dg":{"text":"After an active Garden District walk. We were pointed in this direction. \nGood idea.\nNice,","useful":0,"cool":0},"oMO-vqrXnkdfXkxA2elxPQ":{"text":"My boyfriend and I came to New Orleans for the first time, as it's on our bucket list.   M","useful":1,"cool":0},"RvD4lQdlafBBJdATlsQ_TQ":{"text":"best roast beef poboy in the city! and do yourself a favor - grab some firecracker sauce f","useful":0,"cool":0},"-p9INe2hJXMoCJs5n96rVg":{"text":"Awesome PO boys and muffulettas. We made a quick stop here while touring the garden distri","useful":0,"cool":0},"w-zreQy_tPkWZLGM_ZHXUg":{"text":"Nicely organized for casual outdoor eating and drinking. Despite the reputation, the food ","useful":1,"cool":0},"yNGY9Asf4DMZn6qYP1t0Nw":{"text":"Best meal I had in NOLA! At first I thought I went to the wrong place because it was a bar","useful":0,"cool":0},"RFuMdWdS-q3dowu38fhJ5Q":{"text":"Firecracker shrimp poboy!!!!! The best poboy  I've ever had. \nLet's start with the bread..","useful":0,"cool":0},"lMs3OMADehGVWBVCkHDDMA":{"text":"I decided I wanted an oyster poboy and French fries. I called Parasol's and ordered. I was","useful":1,"cool":0},"iRzpXB7g6JAnZVvQ-BL1aw":{"text":"This post is a bit overdue but I just walked past Parasol's the other day and remembered t","useful":1,"cool":0},"0PiQaoa_atP-9g4VyL0SjA":{"text":"This review is solely for service and employee attitude- anyone can hand me a beer.  My fr","useful":18,"cool":2},"ChM7af06sTDXvt-c9Rehtw":{"text":"Firecracker Shrimp PoBoy was amazing! The freshness of the crunchy buns and the fried shri","useful":0,"cool":0},"_LWIdb3CkcEo8oEds0ETbQ":{"text":"Haven't updated my review in a long time. Parasol's is my go to spot of poboys. They have ","useful":6,"cool":2},"6hJevReueC3Zrybkrbhz9A":{"text":"Found this bar during our walk. Stayed for while, enjoyed it! Small & quaint lots of local","useful":0,"cool":0},"cmIPV5dfBA8aCN47i6HPKA":{"text":"Roast beef po-boy, shrimp po-boy, debris French frys - all 5 stars. Guinness on tap to top","useful":0,"cool":0},"Xvl5Egd6TYtAkf6SAcxMzg":{"text":"We had company in town and they wanted to go to Parasol's.  So we made the trip.  I had fo","useful":3,"cool":3},"ttjRZLzlH2uC3ZyhJnHPkw":{"text":"One of my favorite Irish channel/garden district dives. Po boy bread is always so soft. Gr","useful":0,"cool":0},"aCxNqAbLSzfpblaiN-oYdg":{"text":"Stopped in on a whim, for some post French Quarter day drinking.  I read on the interwebs ","useful":0,"cool":1},"SY0ETq39Y9sb-VmbkhzJmw":{"text":"Found about this place from our tour guide who is a local. This place is a great spot for ","useful":5,"cool":5},"lDP4Id7xMdni4yxCGp6j2Q":{"text":"Parasol's is such a great find in New Orleans.\n\nFood- I've been struggling finding a good ","useful":0,"cool":0},"1Oj8L_AYchX6AtbSu2hlRQ":{"text":"Everything about Parasol's makes it one of my favorite bars that exists in the world. You ","useful":1,"cool":0},"1zAtbYKRDo2nHLtT6jsk4w":{"text":"The best roast beef poboy in the city.","useful":0,"cool":0},"NHelfRBVFs2MxYTtVLO8lQ":{"text":"I visited New Orleans a year ago and am still thinking about the sandwich I got at Parasol","useful":0,"cool":0},"Bp4MLM_2BbPBiECrhg7y4g":{"text":"This was FANTASTIC!  The Firecracker Shrimp Poboy was AWESOME!!  Service was great as well","useful":0,"cool":0},"3nTZt3gMd-z68m7Des_z1g":{"text":"Great dive bar! Mostly locals with a touch of tourists. Good music and the Cheeseburger on","useful":0,"cool":0},"UzLJ0mtHI6CqBV2JTKAKeg":{"text":"OG stop I always go to when I'm in NOLA. They have great food (try the wings) and a fun ba","useful":0,"cool":0},"PcWLEKpRJVZxS5Q2XueCIw":{"text":"Stopped by for food when I was visiting on a Monday morn right after it opened (thanks to ","useful":0,"cool":0},"qlty_jhF243Y9hntKA0xDQ":{"text":"Today's special was smoked pork poboy with spicy mayo and slaw. \n\nIt tastes even better th","useful":3,"cool":3},"er0khGpKiNn1M91V5SaexQ":{"text":"Found this on Yelp!  Good food in Garden district one block from Magazine street.  The Fir","useful":0,"cool":0},"DG6C62vSOP8S6Zi5wU5nFQ":{"text":"Enjoyed the wings, fries and IPA draft beer.  Noisy, nutty and packed.  The wings were sen","useful":0,"cool":0},"A1IhZIg4Ap3EjGOoA1gtgQ":{"text":"Located in the Irish Channel, a few blocks past Magazine Street, Parasol's is a bar and ca","useful":5,"cool":4},"VAUuZXNAzZowin9FQD0dEg":{"text":"This place is a Joke. I would not\nRecommend this place to anyone. I have feeling that it's","useful":1,"cool":0},"97sZiDB8V-Iq5AAIs04A-g":{"text":"Stopped in for quick drink during a walk around the garden district. Bartender (older mise","useful":1,"cool":0},"Zubg_rOGh2C9CNM5mKYGMQ":{"text":"Love having this hole in the wall nearby. Super cute bar with outdoor seating serving up f","useful":0,"cool":0},"oVlXeWeuQ0r3Fo2lmrJibg":{"text":"This place make Legit sandwiches. Looks like a house that was turned into a bar but there'","useful":1,"cool":1},"BwtoWHURAPofkeWwNGoHRw":{"text":"Perfect authentic dive bar food. A spicy shrimp po boy that can hold its own against Parkw","useful":1,"cool":1},"Lk-MO0yK5J5TcuI7cV0iFw":{"text":"It's a neighborhood bar. Small. \nFriendly bartender and friendly neighborhood folks and a ","useful":3,"cool":2},"QNC6OyeUjIeDZq2JaZX70g":{"text":"I didn't know at first the roast beef was the thing to get here, so I got a catfish po boy","useful":1,"cool":0},"vsjilZiSSFXxQlnRZSBTgg":{"text":"I've been a loyal Parasols patron for years. The oyster poboys were the best in the city. ","useful":0,"cool":0},"XYb2RVOsoIR22a5HXFGnVQ":{"text":"A few friends from New Orleans had recommended Parasol's for their po boys so we went to c","useful":3,"cool":3},"DIEUlS9gPsATo6zqx-f1Kg":{"text":"Maybe my favorite place of our whole trip. Firecracker shrimp po boy and cheese roast frie","useful":0,"cool":0},"OKmV-BT3DZxmN3caeV2uBw":{"text":"Absolutely amazing little dive bar in the 11th Ward. Not only is the owner the coolest dud","useful":0,"cool":0},"T5YqTmPcgsQ5Sq0DBmEyDQ":{"text":"This place is a total dive bar.  If I were just wanting to drink, well I might still come ","useful":1,"cool":1},"G_1xFbvLaxCzH_cLCWABSQ":{"text":"We were strolling in the Garden District as lunchtime approached, and found this place via","useful":1,"cool":0},"Tm42DSJBT0uQf2FQKK5P8A":{"text":"Loving the Oyster Poor Boy!!! \nMaybe another is parallel as good!!?!\nThis tastes perfect!!","useful":0,"cool":0},"LzG7DDqWgom5DKyxoxiURw":{"text":"I've been one of Parasol's biggest supporters over the past couple years, but it's not wha","useful":3,"cool":1},"xc_hwNPYhfG41K-vOkRYig":{"text":"This restaurant defines the term \"hole in the wall.\" The outside looks like shack, and the","useful":3,"cool":0},"bS8NfU4TQITFRDpESsAhoQ":{"text":"Parasols is a great place to grab a drink and hang out with your pup as it is a dog friend","useful":1,"cool":0},"kTvXq61FJg00G10QF0WCig":{"text":"The worst food I've had in New Orleans. Skip it.\n\nAte there last night - we ordered a burg","useful":1,"cool":0},"42WXKb2psq7mbQupVqgCIg":{"text":"I'm staying in the Irish Channel neighborhood, and in just a week this place feels like ho","useful":1,"cool":0},"MHhiWBSpj3BKQKDOlOT-4w":{"text":"Came here for the Po Boys, we ordered the Parasol's Firecracker Shrimp large and we both s","useful":1,"cool":0},"YLAmRGxMoBhedRVwFTDW2A":{"text":"My cousin and I are here on our way out of NOLA and loved it! The poboys and gravy/cheese ","useful":0,"cool":0},"2qlIYuGTNtfpP-_rt5nfdw":{"text":"I didn't think it was possible to find a Roast Beef PoBoy better than Parkway. OMG this wa","useful":0,"cool":0},"v6B6TUnKvu6E2eztV_i5cg":{"text":"Amazing food and cool bar! food was very tasty! we ordered the blt and a po boy sandwich. ","useful":0,"cool":1},"itPEwam85wxn5DEJXpcm-Q":{"text":"If I could give them more than 5 stars I would. This is everything I wanted a po boy to be","useful":0,"cool":2},"-P1RM5WQV0v6TnnGlFW7ng":{"text":"2 years later and I now live near Parasol's. It's still one of the best po boys in New Orl","useful":0,"cool":0},"Eo3-A3jwCHy3xPHJSHylPQ":{"text":"Very unhappy tonight! We heard about the place from Guy Fieri's Triple D show, and looked ","useful":1,"cool":0},"IMzKv5RZeUN4rcKMTEGYTw":{"text":"Great little Irish bar in the garden district. Had a delicious shrimp poboy. I got the reg","useful":0,"cool":0},"QbjNo9R7AotGx3UJ-_FHww":{"text":"This is a little nook of a restaurant with bar in front. Order at kitchen door. The food i","useful":0,"cool":0},"gXLuwJGW-znY12LmrpL-yQ":{"text":"Firecracker shrimp po'boy is a must. I've been here dozens of times and love the tiny corn","useful":0,"cool":0},"bySGNC67LwqAjG9ClyXz7Q":{"text":"Slow service\n\nGreat food. We liked the firecrackers po boy\n\nBut well, it was Lundi Gras","useful":0,"cool":0},"xCWT578BblQzYaeqs98IdQ":{"text":"So so happy to report that they still have an amazing roast beef po-boy!  \n\nThe best in to","useful":0,"cool":0},"-yTLDQF-9vKfHEuqjiwnFg":{"text":"I was in search of the best po boy and oh did I find it! My fiancé gets one here every tim","useful":4,"cool":1},"700TYYXztT3hxArFtnNPYw":{"text":"Apparently closed snd no sign of life. Postef phone number is wrong and they dont respond ","useful":0,"cool":0},"-jm3-B-s5S6Ryep5bNzQvg":{"text":"I came because of their spot on Triple-D, but I stayed for their wonderful catfish po-boy.","useful":46,"cool":45},"nYx1_hLz7pofIifDAXRE4g":{"text":"When I visited New Orleans, we had heard so much about shrimp po boys that we had to try o","useful":1,"cool":1},"QicKmGfqroDr48TWDXrmyQ":{"text":"Great poboys in a chill neighborhood spot.  You order and pay upstairs.  Dog friendly tabl","useful":1,"cool":0},"GaRWbojwLW6XAuKlzr9zcw":{"text":"Absolutely the heart of the neighborhood.  Good lil joint right in the neighborhood.   The","useful":1,"cool":0},"tz28F2K3EADIKLMWz5ECJw":{"text":"If you're looking for a neighborhood bar with great food, Parasol's is it. Walking distanc","useful":0,"cool":0},"Qar8EhTupy1iOcTtvmgHDQ":{"text":"My husband and I both said these are the worst shrimp Po boys we've ever had in our lives.","useful":0,"cool":0},"1fjbHuFthlyC4n6RfF8Swg":{"text":"The beat atmosphere, cold beer and a roast beef poboy way better than parkway bakery. Put ","useful":0,"cool":0},"qbaQPIPi0E3tPAfBiR5T3A":{"text":"Stopped back at Parasols and I have to admit the new owners have cleaned up the place but ","useful":3,"cool":3},"4YAUunBI-rssQdlZJyMweg":{"text":"Highly recommended on Yelp & eater Parasol's was the perfect place to have a no frills cas","useful":1,"cool":1},"5wh7Ea1_kd30RfmT0KW25g":{"text":"Went here for lunch and got a shrimp po-boy and gravy fries. The wait was pretty long but ","useful":1,"cool":1},"RvqHi60_sa2OSGExosjFEA":{"text":"Awesome local bar.  Went for beer and poboys and wasn't disappointed.  Had the roast beef ","useful":0,"cool":0},"v_Eseph1IYlIdqpDOSpOTQ":{"text":"Looking for a place to grab some Po' boys for lunch while in the Garden district and saw g","useful":3,"cool":2},"XmEvAsbeF1SwNanEYCVTlg":{"text":"Fun.  I came here for the firecracker shrimp po boy and it didn't disappoint.  The shrimp ","useful":1,"cool":1},"xiRZj0ZMdd9O5nwNAK7EtA":{"text":"What a dive, and I don't mean that in a bad way! A perfect 5-star roast beef po boy and tw","useful":4,"cool":0},"NBCw3aASSOjshoj9Bo26hQ":{"text":"Whoever described the ambiance as \"divey\" was spot on! What a hidden gem off the well (b)e","useful":2,"cool":1},"7D8icybDzBCQsG-eXr7O0w":{"text":"This is where you go for a real NOLA po' boy. They don't do any of the fancy toppings or t","useful":3,"cool":1},"bhdx33y4Rekpy95dI39C1Q":{"text":"Stopped here for the second time since the new owners have taken over and it wasn't a plea","useful":2,"cool":1},"n95qWRHK8wsHfweihrkARQ":{"text":"Visited Parasol's in New Orleans on a self guided food trek, needed to have a few Po Boy e","useful":6,"cool":6},"dHdO-RFItSYg3qdQ_-4aGg":{"text":"The hardest small business you can possibly run is a restaurant. What makes it hard is tha","useful":1,"cool":0},"rHXpbqiYD_PhX6TKF6_vQg":{"text":"My long love affair with Parasol's has ended. Like people, restaurants change over time an","useful":2,"cool":0},"FfTEmLA8nhM_uGxoWK1rNw":{"text":"Have no fear, even though John is dead the food is still good especially the pulled pork w","useful":2,"cool":0},"eN-WOYy9D1oNFWidoABtiA":{"text":"Came back to Parasols under new ownership. What was once the best roast beef in town is no","useful":2,"cool":2},"fEgrmBxlP0aF_CV7vM7PKw":{"text":"Thank God for this place. After being shut down at commanders palace we found Parasol's. T","useful":4,"cool":1},"18BSL_egIy0HZAR5NkufNQ":{"text":"I don't know if it's the renovated kitchen or if I ordered the wrong thing last time. Don'","useful":3,"cool":2},"-k8yzoGzzUVTip6T0L4gMA":{"text":"RIP Owner John Hogan. You brought Parasols back with great passion and great food. We offi","useful":3,"cool":1},"t72D_25HcyGMEL9RbUIVgw":{"text":"Was told these were the best po-boys. So disappointed. Couldn't even eat it. It was fallin","useful":1,"cool":0},"kBrTmRDTmK8d-nGaWIXSVw":{"text":"We almost missed this inconspicuous place, located upstairs in a bar.   We stuck out like ","useful":2,"cool":1},"aeXmI5U8724sWcfIiHCT1A":{"text":"Our NOLA hosts recommended this neighborhood joint as their favorite po'boy place so how c","useful":3,"cool":0},"MQdUjE4qjl1klZOKwpXHvg":{"text":"Delicious firecracker shrimp.  Good locally sourced bread.  Good crew.  Supposedly they ex","useful":2,"cool":1},"m8sA7MOpY8NYRYU6E0D0Yw":{"text":"We came to New Orleans to spend the 4th eating and drinking where the locals hangout.  So ","useful":1,"cool":0},"Flm-EQnsaLp9QdszeeyI3w":{"text":"We stopped in for a beer and a po'boy and wow this place is awesome. The vibes are perfect","useful":0,"cool":0},"t7qTFzxeMcTuxf7bjonxxA":{"text":"The best roast beef poboy in the city.\n\nhad the pulled pork poboy tonight, the absolute be","useful":3,"cool":4},"n0JgMYIHSPULz4p5derjMg":{"text":"Parasol^s firecracker shrimp poboy earns FIVE STARS.\nFed two adults out on a bike ride in ","useful":1,"cool":3},"rBeIiPuGWguuAfZOKauSIA":{"text":"Parasols has not only been one of my favorite poboy spots over the past ten years, but als","useful":11,"cool":15}}