{"HgvzFE-7o7Lps8-DXOucmA":{"text":"My boyfriend and I came here for a date night and it was so good. We had made a reservatio","useful":2,"cool":0},"8UXSbp4aIGtFl4a6nrw-Ow":{"text":"Really great place to meet up with friends! We went on the monthly ladies night, which has","useful":0,"cool":0},"qub5Lef8u8IWeX9sRjecbA":{"text":"This place is great for a girls' night, grabbing a light bite to eat before dinner, or for","useful":0,"cool":0},"QmL_SVwzQDd499029qkwXg":{"text":"I arrived with my husband and my 2 sons. The hostess asked if I had a reservation and I sa","useful":0,"cool":0},"WJm-ws6-Pe91-pYXZbyJwA":{"text":"We have been here about 5 times in the past year and half. I usually went there with my 3-","useful":1,"cool":0},"PKjTPgGgocYscHKyUv7Ucg":{"text":"This is my favorite restaurant. So relaxing and laid back yet romantic at the same time. Y","useful":0,"cool":0},"X4Y8m2t_SAG44yu17wJgyQ":{"text":"Went here for a birthday dinner. It was easy to make a reservation and they even brought o","useful":1,"cool":1},"pK5fpdM3SGqSB1IslWIKQg":{"text":"Understaffed on sun at 6pm.  Plenty of tables available.  Refused to seat us without a res","useful":0,"cool":0},"rsJlVykbtDYP8cdUUeCgQA":{"text":"This was my first time at a melting pot and needless to say, I loved it. I got a love mart","useful":0,"cool":0},"pfeGjd4i5tEZOd_nHndASA":{"text":"A dressy fondue restaurant. YUMMY. Great desserts. Good waitstaff. Wish they had different","useful":0,"cool":0},"uNrvMcEmvKBP6KYTbrQbLA":{"text":"We started with the loaded baked potato cheese which was delicious and memorable. I got th","useful":0,"cool":0},"Oxt9wO8S-kWEBX3ijaGD2A":{"text":"I went here for the first time with some fellow yelpers to enjoy happy hour.\n\nWe all decid","useful":11,"cool":3},"1UWP00CXb6C2py1LLYZFiA":{"text":"One star for the chocolate fondue at the end, and one star for the management giving us fr","useful":1,"cool":0},"1BuPKu0hKA0a0E5Fs398Xw":{"text":"The Melting Pot is always a great pick. It's has the feel of fancy and casual all at once.","useful":0,"cool":0},"RKIGjc0Fnf0NAZF6A_DIDg":{"text":"Great place to eat! Got the teriyaki sirloin, very good!! Would recommend the bananas fost","useful":0,"cool":0},"PU7eax4ns4IT-dr0SVOxGA":{"text":"As always another fantastic experience at the Melting Pot. I disagree with all of the nega","useful":1,"cool":0},"wmoWM4hYTGWnFExfqTol7Q":{"text":"So the Melting Pot may be over priced but it's fun. Go for an experience not for a gourmet","useful":0,"cool":1},"Rj1hjRJ4ok6qr2GTeYziLQ":{"text":"My boyfriend and I have been to The Melting Pot twice in the last six months and both expe","useful":0,"cool":0},"4YnbBsNtVErZv9WavXiBQg":{"text":"Cynthia was our server for tonight and she was amazing at helping with our first time dine","useful":1,"cool":0},"EnjvKFQjjs0X_4jxsF2oVQ":{"text":"First time visiting The Melting Pot and upon arrival i could see this was a bit of a swank","useful":2,"cool":2},"gD_Xnmpq_jrsITVN1rnEAA":{"text":"I could not have chosen a better place for my first anniversary. The food was phenomenal a","useful":0,"cool":0},"hwoZcD8Zeb56SUSILWayOw":{"text":"On the one hand: Who wants to make their own fondue when the Melting Pot does it so well? ","useful":10,"cool":2},"4NZaXgay0j7RDOoFP-Chvw":{"text":"I purchased two groupon specials for $66 that included a salad and an entree for two peopl","useful":0,"cool":0},"bUIqYLAoYR0m8AETRo0kMw":{"text":"Desserts are very good, but boiling your own chicken or meat on a stick with some Tony's s","useful":0,"cool":0},"SzUqh87_K6e6gdUqI8Aj6A":{"text":"When I went back, at the insistence of the same friend that I went with for the first time","useful":2,"cool":0},"bGHLKbwtKr9ed81wDQVvvw":{"text":"I have been to this restaurant seven times and always really enjoyed it, so when a best fr","useful":0,"cool":0},"2YOGNOFhvPQDaDHqJffOQQ":{"text":"I had these fantasies of fondue ever since I saw the enameled pot in my grandmother's cupb","useful":1,"cool":1},"6OIO6QmPoYNYYvoZ4EvVpQ":{"text":"We had just picked my mom up from the airport and this sounded great. We had never been he","useful":0,"cool":0},"qkKOy1k7PdRnE00rNGeWRQ":{"text":"Dined on 2-13-14 to celebrate Valentines Day. The reason why I am giving the melting pot o","useful":3,"cool":1},"e19SQ6mPSHVl3dPIRgbvHA":{"text":"The key to the Melting Pot is the Happy Hour.  With every bottle of wine, you get a pot of","useful":7,"cool":1},"m1wPcliXT7VTJPSWgxm4EQ":{"text":"I've been here before a few times & enjoyed it , although I feel it's way too pricey . But","useful":3,"cool":0},"spwlnsTn8JpaSOZJ29V2Iw":{"text":"Having been here plenty of times. My husband and I now see why we haven't come here in yea","useful":1,"cool":0},"vlENOgF78Hk1uRCkvtv3Rw":{"text":"Too much money for the amateur service. If you want to pay for a porche and get a Honda, t","useful":4,"cool":0},"NGc_hpJSMhsRx17FFg8NFQ":{"text":"Friendly staff.  With a versatile menu, including lots of gluten free options!  I'm gluten","useful":0,"cool":0},"QaQGzy2RF9Z_Uw7_HOb8vg":{"text":"Save yourself a lot of frustration and disrespect and go to the Baton Rouge location. This","useful":1,"cool":0},"HBjs6Yc4wZew9RNCHr0pcA":{"text":"Went on a girls night out. First time trying it. First Thursday of every month is ladies n","useful":3,"cool":0},"6zceKjd-NzLoYVyPmxBxsg":{"text":"Meh...I'd come here for a martini, an appetizer, or dessert, but not a full meal. Somethin","useful":0,"cool":0},"CEfAhouBqkwNQIVGKKkzqw":{"text":"The reason this place doesnt get 5 stars is for there dinner. Terrible. food blah and than","useful":0,"cool":0},"sJ8DNczpIIPhqlQZAqAXMw":{"text":"I've never really written a yelp review before, so I'm not sure how this works.  But tonig","useful":0,"cool":0},"6tpZgZ3wybXtShI83YaWCQ":{"text":"This is my second time going there and for the price I rather go somewhere els. I went wit","useful":0,"cool":0},"dlMY2DNG8mQoPRaBcthT7A":{"text":"Went for my anniversary.  So February 18th, took my GF as a surprise with reservations mad","useful":0,"cool":0},"AvxYuxnyUZK8lGzxk3RUjw":{"text":"Great service and atmosphere. Food was good, but not worth the price. If I had gone their ","useful":0,"cool":0},"shxuFjDmQGlRyVwYKCKWCw":{"text":"Absolutely our favorite place to go for our birthday celebrations. Went last night and cel","useful":0,"cool":0},"Y0dM2NBO5AaG-qwBEsgl9Q":{"text":"Enjoyed the $19.95 special. Went with a party to celebrate a birthday. It was a perfect pl","useful":1,"cool":1},"sdGxrPnxVVw2kQzSUdqeTQ":{"text":"My boyfriend and I went to have a Classic Alpine fondue on Christmas Eve in Melting Pot- N","useful":1,"cool":0},"_nHt-ZGN0dKEWTOH4SGDvw":{"text":"Please don't support \"The Melting Pot\" on St Charles. It's become obvious to many. That if","useful":1,"cool":0},"95yijVv1RnyrcGlKsnxMUQ":{"text":"Even though we did not have reservations, they made room for us (on Mother's Day!). Our wa","useful":0,"cool":0},"Wr0zGSIfAKDv18jZL1bcNw":{"text":"Have always wanted to try this place.  Kind of expensive, so we were happy to find a group","useful":2,"cool":1},"BTXFrw6cj23BW2HLzXuQUw":{"text":"I really love  cheese fondue.   Sadly, Melting Pot does not really do it for me. Thing is,","useful":3,"cool":1},"-ZPtmi4qUFLhG_0XnocgTA":{"text":"I have to give it to the Melting Pot, I've been struggling with my weight my entire life, ","useful":0,"cool":0},"ZnFU5J3eGdJ4Qtkr4o7ZDg":{"text":"We had a wonderful Valentine's dinner here last night.  The service was great and the meat","useful":1,"cool":1},"GMmrgk0tSRJ7VYvU0Sv3vg":{"text":"I've been to a few different melting pots in California and loved them. This was always a ","useful":1,"cool":0},"sdma-nddjhLFnWzfqYa9UQ":{"text":"My boyfriend and I went on August 29 to celebrate his 22nd birthday. It was just the 2 of ","useful":0,"cool":0},"TupF2ydku66zzB_ADvhNpg":{"text":"Very nice low-key restaurant with a shocking variety of foods. Small, but long space.Just ","useful":0,"cool":0},"5D8SlSG49yuduIJmHSTePg":{"text":"It's definiely overpriced for what it is.  The menu isn't super easy to figure out because","useful":2,"cool":1},"2OrjWtbfAclGQQ7rtFia7w":{"text":"My boyfriend and I went here for our first night in New Orleans and it did not disappoint.","useful":0,"cool":0},"n6NDhllwbIsoGQz0a2vdKQ":{"text":"Awesome dinner and experience!!!  The steak lover's and seafood trio was unbelievable! But","useful":0,"cool":0},"Dvt3Not3SnYZ6Ka2rVmjaw":{"text":"I would not recommend this place!\n\nOk. I went here with a friend because they were part of","useful":4,"cool":1},"w9p0wNtQUsenrjq4ulaXhg":{"text":"This place is wonderful...for appetizers, desserts, and drinks.\nThe entrees are forgettabl","useful":2,"cool":0},"0i7g_75WL-xLCAb3mDQZHg":{"text":"I purchased a Groupon a few months ago for the Melting Pot. We hadn't used it, and I reali","useful":6,"cool":1},"vsvDqJsY_nh83WN4Z7ifPg":{"text":"I arrived with my husband and my 2 sons. The hostess asked if I had a reservation and I sa","useful":0,"cool":0},"Kl8yWRSmBoYnLc2uXEXvfg":{"text":"Loved the company and experience. Food was delish. Waiter was terrible. He was from a diff","useful":0,"cool":0},"dkjjZTOg3SEetcv-N2ImdQ":{"text":"Everything is so good! David, our server was very knowledgeable, fast, and friendly. He ma","useful":0,"cool":0},"gp8PQ5SScSdZqwEPPh9QiQ":{"text":"One of the BEST experience I have in  restaurants. I love everything about it! How the foo","useful":1,"cool":0},"z0vZWTWbYVirBBOP3rG9tg":{"text":"Had a Groupon for a dinner for two at The Melting Pot. The deal is a fondue for two, two s","useful":0,"cool":0},"Z8kun7EFLTEKUmKOjSBs9g":{"text":"Overall, this was a fun dinner. I tend to eat very quickly, so having to wait for my food ","useful":1,"cool":1},"s3UjYj1ja4Gvbc1wuMhbug":{"text":"Did not enjoy this place at all. Boiled meats with no flavor. Cheese melt pot was very bla","useful":0,"cool":0},"seupRwNBfOsxCELxTEmABw":{"text":"This was not very good.The front of the house staff is not friendly,coming or going.The la","useful":0,"cool":0},"cldbiV7XZkZkKSZ6cyDuuA":{"text":"The quality of the food is not appropriate for the price. While I enjoyed the experience -","useful":2,"cool":0},"I9mAHdYlI0ttBi5Ipfu4Yw":{"text":"The service is extremely slow both times I have visited here. Once you are seated expect t","useful":0,"cool":0},"uPyCXkX271IuKbNl-sErSw":{"text":"Although I said I specifically HATE CHAIN RESTARUANTS, here is a chain that is simply AMAZ","useful":1,"cool":0},"VcRyLwbA2RsYurTe7mow_g":{"text":"I love the Melting Pot. It was great as usual.","useful":0,"cool":0},"t079kmfrP-h14A-533wD4w":{"text":"i love everyhting about this place. the drinks, the nice ppl, and the food that can libera","useful":2,"cool":1},"KHt6niqJLnl76PZazQWGew":{"text":"For reference, three stars means A-OK....I can say, my most recent experience here was ok,","useful":5,"cool":3},"DlPB4pXB9A2xKo0TAgzsmg":{"text":"THE WORST MEAL OF MY LIFE. Our waiter, William, had a terrible attitude. He treated us lik","useful":1,"cool":0},"DJswbeZzHCeVBZ7Px1mOOA":{"text":"I LOVE the fondue at the Melting Pot. The drinks are great too. The house salad dressing i","useful":0,"cool":0},"CWY_e6r3krYG8upT6ZGiuQ":{"text":"Made reservations here about 45 minutes in advance on a Monday.  Honestly, didn't think th","useful":2,"cool":0},"iM1tJ4bJVaWTqlRzY-TLKw":{"text":"Thanks to Camila, William, and Ray for making our 1 year anniversary so special. Great ser","useful":0,"cool":0},"KWITM8kaJg5xP6KBLZAKMA":{"text":"It was \"ok\" in regards to food, wasn't what I expected it to be from the hype of my friend","useful":0,"cool":0},"GZKoKJELMIm_FxYznbCZvw":{"text":"Was pretty upset to hear this is where my friend wanted to go for her husbands birthday. W","useful":0,"cool":0},"wie0Lt5CwqpzMVdZ11MPcw":{"text":"I know, I know IT'S A CHAIN! But apparently, from what I've gathered, The Melting Pot has ","useful":6,"cool":3},"AWkH1R_X4A_MZKufMujRVg":{"text":"WARNING: DO NOT COME HERE FOR DINNER AND ENTREES.  DESSERT ONLY!!  I REPEAT DO NOT COME HE","useful":9,"cool":1},"9ZwO09FFYjaJymcq0zqvwQ":{"text":"I decided to take my boyfriend here last Wednesday night because it's one of my favorite r","useful":1,"cool":0},"jvGlWDI4dY4xJ_8-4huNdg":{"text":"If I was basing my experience on food, it would easily be a 4 star. Twice now we have been","useful":1,"cool":0},"nxXCezPEM7fF2-6d9yKvIw":{"text":"Went here twice on a recent trip. My daughter loves it and the food was good. Both times I","useful":0,"cool":0},"JRTW-zaeLFRgcy8nl10OMg":{"text":"My boyfriend and I attempted to go The Melting Pot last night (2/2/2014) to celebrate our ","useful":3,"cool":0},"XxadHLX7L_hGJ3-o1z82Og":{"text":"I decided to treat my bf to The Melting Pot for his birthday. Neither of us have tried thi","useful":0,"cool":0},"zdxvslUC3VOufmm6cAkUCg":{"text":"My girlfriends and I went there for dessert and at first I thought it was this tiny place-","useful":3,"cool":0},"9L0P58dybEmo8LSK8LfVkg":{"text":"This was a fun experience and I highly emphasize the word experience. The issue I have wit","useful":0,"cool":1},"0d8AZdxyh7TwxU0Deg-njA":{"text":"I decided to come to this place on a Monday night for a first time. That didn't make a dif","useful":0,"cool":0},"reff7Vl0T6o0MxYxgP3yAA":{"text":"The key to a great dining experience is to order cheese for an app, salad and chocolate fo","useful":1,"cool":1},"zpE7PfpQSBFM4tpaDKooow":{"text":"This place is great. Very fancy, today I came here for my birthday. We got the $20 per per","useful":2,"cool":2},"ECs63l80BH6egPDxAztGDg":{"text":"We decided to give this a shot because it was something we had never done before. While th","useful":0,"cool":0},"yazQRUeic_2ag3xkyZiICQ":{"text":"A great impressive place for a first date. Looks small from the entrance but definitely bi","useful":1,"cool":0},"p3x9MrVlgrJN_aot-XT0gA":{"text":"I've been to the Melting Pot on several occasions, most recently for my mom's birthday din","useful":4,"cool":1},"S9hkhHjheIe_g9_omy7DTw":{"text":"I am of two minds when it comes to The Melting Pot.\n\nOn one hand, it's corporate and formu","useful":7,"cool":4},"Mcr6xMNbwneCLEg7dmtl1Q":{"text":"I have a great experience Every Time I come, you get to be creative with your food and enj","useful":0,"cool":0},"nr8MKtpC_67rHi1PoKO3hQ":{"text":"Gotta the love the Melting Pot.  I got the September Fondu Festival deal in my email a cou","useful":1,"cool":1},"jTVTFguTuSwr0Kj7q0-lZA":{"text":"Overpriced and gimmicky. Why pasy so much for food when youa re doing the work. It isn't a","useful":4,"cool":2},"aU_IrHPDW5j9AUEHBvTMfw":{"text":"Every time we are in New Orleans we make sure to visit The Melting Pot! It is so much fun ","useful":0,"cool":0},"OjB6-PNGdHV4ex0kS4W69g":{"text":"Hello Melting Pot,\n\nMy name is Scott S, and I am the Yelper who you totally Facebook stalk","useful":56,"cool":27},"x6-4HPlPvJ9CRRBScxInVw":{"text":"I had a great time here. I am sure it is very dependent upon the server. The server is mor","useful":2,"cool":0},"8jWrbZUp3o-DahGGA7D7-g":{"text":"Last night my friend and I went to the Melting Pot. We wanted to try something new so it b","useful":0,"cool":0},"mqUSBFXKMVz16i_RD5tLBQ":{"text":"First time at the melting pot and it was great. We went on a Monday night and the place wa","useful":0,"cool":0},"RfRMjG8zcjmex4RrnzA4KQ":{"text":"This place never dissapoints. I have been here several times, and every time the fondues a","useful":3,"cool":1},"X2kkf9Y3BW8m9gE8Sijsig":{"text":"I don't understand why so many people are giving this place bad reviews. I came here for m","useful":0,"cool":0},"ZY_ENpKlRkVH2sJDkc-yxA":{"text":"First off our total time there was 3 hours and 41 minuets... we had a table of 6, and had ","useful":0,"cool":0},"fHjUW5gXNEONWRhQ0SsxoQ":{"text":"I received an offer from the Melting Pot via email, which was offering a pot of cheese fon","useful":1,"cool":1},"MPCyLXE1rLLmM0dLB8qItQ":{"text":"I took my boyfriend here for the first time for his birthday. Service was not great. Took ","useful":1,"cool":1},"6HxHvpidGo5dfy7AFV3MPQ":{"text":"LOVE IT! This is definitely my favorite restaurant. The service is great.\n\nIf you go for t","useful":0,"cool":0},"YA7_j1Jd2KyGoJUK58MtBg":{"text":"Our first visit and it was a blast. It was just a lot of fun to be able to chat and slowly","useful":0,"cool":0},"NqgRdJy3qA8LO4nwfw0sIQ":{"text":"I came here a few months ago for a friend's birthday dinner, where we had a party of about","useful":2,"cool":2},"09MgdD6EVWWhZLe_CjCh8g":{"text":"Food was ok.  Cheese fondue was missing a kick.  They don't use Kirsch anymore so it was s","useful":0,"cool":0},"-4YgnwhVLJZzYaq-CMta4g":{"text":"An amazing and fun place for a date night whether its romantic or formal. Our waiter was e","useful":0,"cool":0},"FUPTMBeiCoX7PPFpDViufA":{"text":"I am going against the grain of the other reviewers.  It was different, exotic and romanti","useful":2,"cool":1},"kVfy8e60lyAC8DzLPk3M1w":{"text":"The food was so amazing. You have to order the Flaming Turtle desert. Jimmy and Michelle D","useful":2,"cool":1},"eMpYTHdEaEILgzBo90cOIw":{"text":"I would give it 5 Stars if it weren't for the fact that despite making my reservations 3 d","useful":0,"cool":0},"Ccdti99STnvbzD1yUpeDgA":{"text":"My wife had been here once previously with her siblings and wanted to return, so I took he","useful":0,"cool":0},"1dHGCL6sRUrfZTo7GxEhTA":{"text":"Love it! The Ying yang martini is the best and chocolate smores fondue is delicious. I wis","useful":0,"cool":0},"ATn1phw9jiPiJb10s9KjPg":{"text":"Loved this place. Staff were accomodating, professional and just plain nice. My kids wante","useful":0,"cool":0},"5wCRQ3QqnulHYw-HX-gjTw":{"text":"I Love the melting pot. My husband and I frequent this spot pretty often.  We always get g","useful":1,"cool":1},"MkA33X2YcgaG094hwXfQ-A":{"text":"Was promptly seated for our 8 reservation. Twenty five minutes later and we still hadn't e","useful":0,"cool":0},"P4OW83tz2C2OV5levdfxKw":{"text":"We come once a year and have for the past 5 years.  The service is always hit or miss here","useful":1,"cool":0},"C9kG6jT3GsGhGQrZ-P8xfQ":{"text":"Four fondue virgins went here on a whim after Wednesday at the Square. It was a fun and un","useful":2,"cool":1},"BBUwn-b3PxhBqV-m2FpwoA":{"text":"This was a great experience! I wasn't prepared to \"cook\" my own meal, but it was delicious","useful":0,"cool":0},"lS0pFxdyb3bajuOCahJv6w":{"text":"It's been awhile since I've been to a Melting Pot, but I remember them being much better t","useful":1,"cool":0},"u4jLzrs1ddjG5X8oP5WOcw":{"text":"Like others have said, eating here is an adventure and the whole experience was quite leng","useful":2,"cool":1},"SqR0wx7ES0oORqjeYerbgg":{"text":"I went back here recently and had a much better time by just sticking to cheese and chocol","useful":0,"cool":0},"fvusKpCLXdTudf4A3Xms0A":{"text":"Flag this and get a tongue lashing, yelp stalker. \n\nThat aside: I dropped by to say the Ma","useful":1,"cool":2},"8KxKQkrAQd6NvDBRFmNM9w":{"text":"My wife likes the Melting Pot.  So it was a great choice to for her birthday.  The tables ","useful":7,"cool":4},"L0yeJq-HkuKOGnQfEDBIvg":{"text":"I really want to give them one star, but I understand the staff is just people and I'm wor","useful":1,"cool":0}}