{"5yrRG_feHkKJ5EUa1KMcaw":{"text":"I thoroughly enjoyed staying at this hotel during our stay in NOLA. The location couldn't ","useful":2,"cool":0},"uuSOum1e2_-gsUcz0IPagQ":{"text":"Great location. The rooms are servicable if a little small. This is definitely an atypical","useful":1,"cool":0},"xkQqaGHZ9pB7Et3SdGJonA":{"text":"The price is usually fair for what you are getting.  The valet parking is high, but conven","useful":1,"cool":0},"aVg-2Qlc4Zu3xIpHeOf6aw":{"text":"We stayed here because it was the best rate we received for the French Quarter. I have to ","useful":0,"cool":0},"dpkSoud3r9WyHTPX_e1Qfw":{"text":"I reserved a room with a King Bed and was booked in a double...  Same thing happened to ot","useful":0,"cool":0},"-uWawgJqF4r3Myl7qzLAaQ":{"text":"I loved this place.  I came to New Orleans to enjoy the late nights with a good friend and","useful":0,"cool":0},"Cq6xJzv1A8KRGj9eM6gbIQ":{"text":"Sehr schönes Hotel im French Quarter. Sehr nah zur Bourbon Street. Das Hotel ist relativ m","useful":0,"cool":0},"cHGZ-g6WVip143soUhXCvQ":{"text":"The rooms are okay, but the walls are paper thin. Really, really thin. The balcony is grea","useful":0,"cool":0},"bjIrL8ZEgpyfitx2X0lv-g":{"text":"Very close to bourbon street, Jackson square, and fantastic restaurants.  There was constr","useful":0,"cool":0},"bxJxxksVBDz6CKjP5BHbbw":{"text":"I'm giving this hotel a 4 stars \n\nThe lady who helped us at the front desk was very friend","useful":0,"cool":0},"T0w09ZFjX_M27M7LX74E-w":{"text":"Basic hotel with no special amenities besides a pool.  Very expensive Valley parking.  As ","useful":0,"cool":0},"baanJulr2C1kFGm5DwYzYA":{"text":"Excellent front desk this trip.  Fast service.  Shared a cookie.  Convenient valet.  Nice ","useful":1,"cool":0},"LfrMFPjNeP__ULLmYxZ0MA":{"text":"This was my first visit to New Orleans and what a perfect deal.\n\nWe found a deal on groupo","useful":3,"cool":1},"G83mZxXcNfcdzg_EHP-Gkw":{"text":"Clean serviceable hotel close enough everything that you can walk everywhere. The reason I","useful":0,"cool":0},"hq_WvbxfzghIUHZNAv4tVw":{"text":"My first visit to New Orleans! Definitely coming back! Nice hotel! Nice staff! Close to ev","useful":0,"cool":0},"WhI8qQcKJ6Bthrbeu9zSlQ":{"text":"I would probably choose to stay somewhere outside of the Quarter next time I am in NOLA-- ","useful":3,"cool":1},"fAI5qzP3PTgcy_dT8UDZ1A":{"text":"A Little sceptial about booking at a holiday in but it was above excedited our expections ","useful":0,"cool":0},"4DcC0O-XOjONxPfNFEjtow":{"text":"This is by no means a four star hotel, but for what you pay, the location and the fact tha","useful":1,"cool":0},"gcNlHe8Xne_Q_m5u8sc1iA":{"text":"This was our first visit to New Orleans, and we were thrilled to find our hotel right in t","useful":1,"cool":0},"oaYUKgF---OCygEr7EelWA":{"text":"I am really disappointed in this place.  It's overpriced, (especially on weekends), it's n","useful":0,"cool":0},"f9XXiOtNfa7nJsldHjPtpw":{"text":"Great location and value! If you are an independent type who needs a secure, quiet,,and co","useful":0,"cool":0},"Xwhk9I3Ypij66ZnwPWFDWA":{"text":"OK. So, the Hotel is very nice and in a great location. Also, if I was 21 again and ready ","useful":0,"cool":0},"VX6VA3JIXJZk5UaTutOCgA":{"text":"The location is hard to beat... and the look of the exterior and courtyard around the pool","useful":0,"cool":0},"QAEO58pw8ovLNi4Q79KzTA":{"text":"If you have a complaint about your room the Guest Services Manager Todd Theriot will just ","useful":4,"cool":2},"W0xeC4896jtaKMDPudhuug":{"text":"A friend and I just returned from a 5 day stay in NOLA, and needless to say, we were both ","useful":1,"cool":1},"y4-OxSZJbXBEnIWDx-VU6Q":{"text":"The first time I stayed here a couple of years ago the place was under construction and it","useful":0,"cool":0},"5zUQ9B6GhpSD8vcLiFcJ7Q":{"text":"So my father in law confirmed twice with Nelson at the front desk that my wife and I had a","useful":3,"cool":0},"R9CjMsZDcD_rzIw-UglRaA":{"text":"A pretty average Holiday Inn in a great location.\n\nI don't normally write much before jump","useful":4,"cool":0},"hrz1Fh8SVLWFt8oK37K--A":{"text":"My boyfriend and I decided to stay in New Oreans one additional day after our cruise and d","useful":0,"cool":0},"HDzLjvFq0CHMnSuF1m1CaA":{"text":"One thing that annoys the heck out of me is hidden charges.  If you want to charge for the","useful":4,"cool":0},"tiFB8LISVr7zxo1GySNEmA":{"text":"My wife & I wanted to celebrate our wedding Anniversary in NOLA, booking Hotel Chateau LeM","useful":3,"cool":0},"VcKS575RnW8IpiQZrCB_rg":{"text":"First, I have to say, I have never met a friendlier staff. \n\nI loved the location of this ","useful":0,"cool":0},"F1N1rsy3EVGmXOQAf7ecOA":{"text":"Customer service was extremely helpful. We arrived after a carnival vacation and were supp","useful":0,"cool":0},"VHm7it9WMoTTV1TkHWAMyw":{"text":"5 Awesome stars, we booked this hotel, very a last minute. It turn out to be the best choi","useful":0,"cool":0},"TTQ9O480TiTeaZtql1nDMA":{"text":"Great Location. Everyone was helpful and friendly. Despite undergoing renovations it was c","useful":1,"cool":0},"jn07FiIOro6mFmBRItDFvQ":{"text":"I only stay at IHG properties for work so being a spire member and using points.  It was r","useful":0,"cool":0},"kF8L-VIEqAznQhh0_uGkZw":{"text":"Everything about this place is a pleasant surprise.\n\nRates for IHG member. Cheap. \n\nLocati","useful":0,"cool":0},"f5zLQ96R1c1mG5yPtNFDFA":{"text":"A great choice if you are looking for an affordable place to stay within a short walk to B","useful":1,"cool":0},"FgkZSHXJYk7NAPbNime4Qg":{"text":"This is a pretty awesome inexpensive hotel located in the quarter and 1 block from Bourbon","useful":0,"cool":0},"YgGlDUUYX24TzeENMmSUSQ":{"text":"My husband and I checked in the Holiday Inn French Quarter-Chateau Lemoyne at 301 Duphine ","useful":1,"cool":0},"93P9Uk0LyX6uO4JLBitnGQ":{"text":"This is without doubt one of the worst Holiday Inn experiences I have ever had.  This hote","useful":1,"cool":0},"HBA8sIkYIUXJYhfHT7dkkA":{"text":"Fantastic stay. Lovely staff! Great rooms! The beds were super luxe. We had a restful nigh","useful":1,"cool":0},"z1O8Ab7Urt5om61lAivfww":{"text":"Look y'all. This is a Holiday Inn. If you're looking for the height of luxury go a few blo","useful":1,"cool":0},"EepUzsGpvZTXJKwNZjMmJw":{"text":"My wife and I stayed here on our wedding night and the following night. We had some food f","useful":5,"cool":2},"6taUec47Yd7rulJKwiZN3g":{"text":"Enjoyed our stay here. Rooms are very clean and quiet. We had a room overlooking garden. V","useful":0,"cool":0},"HOzBRJLNvMPFNxAWf4a2Fw":{"text":"Crooks. I called and cancelled my reservation and they never cancalled the room. I did not","useful":4,"cool":0},"octbcZd2ocO9mJ0hBTp4Ug":{"text":"My husband and I stayed for a few nights and had a great experience from start to finish. ","useful":0,"cool":0},"jDk9_2Wq9lMzlfCAlqRsFg":{"text":"One of the best hotel experiences was here at Chateau Lemoyne. My parents were celebrating","useful":2,"cool":0},"mF5YASjtNhFB4nqbi52l6g":{"text":"We enjoyed our time at this hotel.  It is one block off of Bourbon---if that is what you a","useful":0,"cool":0},"eG3IcvlQcokPQZSdH2Mq7g":{"text":"I loved this place.  Our room was clean and the beds were extremely comfortable.  The staf","useful":0,"cool":0},"TqScYR2MOt_T_YR0exIRiw":{"text":"I was SO excited after booking this hotel. It looked like an upscale boutique online. When","useful":2,"cool":0},"wtgdM0jTpoav_8YwVSa72w":{"text":"We checked in on Saturday around 2 pm which was great because their check in time is at 4p","useful":3,"cool":0},"NB6EwN-9gF6RIzXwS4w0_w":{"text":"Location is 5 stars.\n\nRooms, 2 stars...\n\nI don't understand it.  This should be a top-end ","useful":3,"cool":0},"_gtj6AkOnub8RCKUXcm5Tw":{"text":"We stayed here for our honeymoon 20 years ago. booked way in advance and called to tell th","useful":0,"cool":0},"If4TcpNQS3Q6FuM5x1wFgg":{"text":"Hotel was par. Rooms decent, but maid service left dirty dishes for 2 days on the table. K","useful":2,"cool":0},"61f77erYiVvmVpHhuSMFpw":{"text":"Decent location but distinct smell in the room\n\nStayed here the Thursday night before Jazz","useful":2,"cool":0},"Ta-FDslzsG77Cx--v89byg":{"text":"Ugh... 1.5... if I was desperate I would stay there again just because they are right in t","useful":1,"cool":0},"xDDpzECfGXTNmbGh48PdZA":{"text":"What a perfect lil spot for our 4 day adventure in NOLA. We got a king size bed with a wal","useful":1,"cool":0},"hPFZimeLty9JYkqbZYeohw":{"text":"My boyfriend and I just traveled to New Orleans for the first time, the first week of Apri","useful":0,"cool":0},"A50Bx-dL9lopJcatRiXGpw":{"text":"Very nice place, for the New Orleans feel and great location to walk to all the things in ","useful":2,"cool":1},"BTfiXejogEesLsHwWHC1_g":{"text":"Found this hotel thanks to Expedia. Its right in the heart of the French Quarter, meaning ","useful":0,"cool":0},"mTiQaWvAOSm2opM6_WZGmg":{"text":"I loved this hotel. Beautiful rooms and pool area! Helpful staff. Great location!! Right b","useful":0,"cool":0},"kA_qr-0d7UQeaX_lVOCADg":{"text":"Great location, but the pluses stop there. After a full day of traveling we had another lo","useful":0,"cool":0},"R4N1uIvg6P0-UjK9abAzqg":{"text":"My co-worker booked this place for our convention, because of the location. If you like no","useful":4,"cool":0},"nKnmSgKxC-yH3Pge_mi47A":{"text":"Probably more accurately feel like it's a 2.5/5....\n\nThis hotel is adequate.\n\nI felt like ","useful":0,"cool":0},"By9PEsymJ0OULDYqySea7g":{"text":"Perfect stay, perfect location.  It is close to everything but just slightly off so you ca","useful":0,"cool":0},"ARsSmcD9k9QyvImh-DKT7w":{"text":"What a great experience!  The staff was so friendly and willing to go the extra mile.  Tha","useful":0,"cool":0},"elQWml06nfFl5qs2D_YW_Q":{"text":"Booked 2 balcony rooms way in advance. They gave us only one. Unhappy! This is my mom's 70","useful":0,"cool":0},"DBpaYLw5dDAWe7trkYaukg":{"text":"I purchased my stay here from Priceline and I feel it was an amazing bargain for the $. \n\n","useful":1,"cool":0},"upLAcWTcrkkWX_zLE8wspw":{"text":"Definitely the best part of this hotel was location. Only one block from Bourbon St, very ","useful":1,"cool":1},"o3nsFlfFNk9Ri-9NbslnMg":{"text":"Hotel valet damaged car while in their possession. Apparently photographic proof, backed w","useful":0,"cool":0},"hC1M8qrTcbsuzY76Jz-s_w":{"text":"Our room at the Chateau Lemoyne was beautiful.  We were concerned that being only a block ","useful":1,"cool":0},"UIY_GmLjXIMvYSHWVRFAtg":{"text":"So, we booked a cheap hotel. I expected it to be cheap and I expected to get dinged with h","useful":0,"cool":0},"4GyiGlbtqLAln6WaOavBRA":{"text":"Stayed at Chateau Lemoyne first week in December and we could not have been more satisfied","useful":2,"cool":1},"zC0ueCo8bxAisGCMs67_nQ":{"text":"Checked in late thursday night on our first vacation to NOLA, was met by gracious staff al","useful":1,"cool":1},"Kr3Y5xvNC_9mVW-01MztJg":{"text":"Great location-close to Bourbon but far enough way to maintain a peaceful stay. \n\nThe room","useful":2,"cool":0},"msEwq2XaHPue54vD8bneDQ":{"text":"This review is mainly for Darren! He made our stay amazing! He booked all our tours and sa","useful":0,"cool":0},"zJ012yixmgPz04_nUFxZyA":{"text":"Booked through Hotwire, this was the \"mystery\" hotel in the French Quarter. I came here fo","useful":3,"cool":0},"Rk8va4MeHYnpHcOiO10HKg":{"text":"So far , I'm loving it. Got a great deal on Booking.com. It's Mardi Gras, so I expect prem","useful":2,"cool":2},"nf8gF7fDdP73EW8i3Dqs1A":{"text":"I absolutely loved this hotel. I stayed here during Mardi Gras and it was perfect! When we","useful":1,"cool":1},"lVhAGuvlZNhkanV6APBdHw":{"text":"I tried to post this on Hotels.com but they kept rejecting my review. So I figure I can be","useful":2,"cool":0},"5whnpEGdDe5bAe_hZXZXmQ":{"text":"My husband and I spent our honeymoon at this hotel. We had a wonderful time. The staff was","useful":1,"cool":0},"U0CXJuCYHlkKwEmrqiDYIw":{"text":"This use to be one of my favorites hotels in NO but when I went to bed, it was soaked with","useful":2,"cool":0},"hzKmJo0QJTri4djQgIbbqw":{"text":"Great location right in the heart of the French Quarter. We stayed in the Creole Suite, an","useful":0,"cool":0},"60M8t40K85TIjamDmeJWAg":{"text":"The hotel was beautiful and it's in a great area in New Orleans. But I have to give it thr","useful":0,"cool":0},"CRCWwU0XV5an-oYkFHPLOg":{"text":"This hotel screams differed maintenance .  Its like a run down Motel.  The rooms are extre","useful":3,"cool":0},"xrUxbko5UocpB_IQWisMSg":{"text":"I can't say enough good things about this place.  It's like paradise in the French Quarter","useful":1,"cool":1},"4o4MYloUnAwI307Ci8ycjA":{"text":"This was one of the worst hotels that I have ever stayed.  The room was dingy and reminds ","useful":6,"cool":0},"6ZbpaXAwrK-vsOi4VuvjiQ":{"text":"Honestly the incredible price & location would've garner this place 4 stars but my room co","useful":0,"cool":0},"EosGhT5d0VcDDwLAOdRC6Q":{"text":"We had a great time staying in. Location is incredible! Not to mention there is a bar atta","useful":1,"cool":0},"0uu_kvgrDokrFBx5uLRd4Q":{"text":"Got a great deal for $79 a night with free valet parking! It's part of the Holiday Inn fam","useful":1,"cool":0},"yTyysgzYZ3wM-pZDL91rpg":{"text":"It's not bad, and it's close to Bourbon Street, but, after the great stay we had at the Fa","useful":0,"cool":0},"F2Wi1TwoaJ32_kzpqu946A":{"text":"Quaint hotel & very friendly staff.  Loved the balcony and room was large and unique with ","useful":0,"cool":0},"o43gUaeWMrALuWBzvbf_ig":{"text":"Walking past this motel it has great curb appeal with a nice little court yard. That's abo","useful":3,"cool":0},"0f1KeMpqgJcLb7tP7zyPMw":{"text":"This hotel is just a step shy from the main road. It's tucked away but not exactly off a b","useful":0,"cool":0},"DCutjpzV_g-og_Ui_XpQWw":{"text":"I love Holiday Inns, they are becoming upscale hotels - so I expected that.  Plusses: loca","useful":0,"cool":0},"6Qa-qf0cewuWCShgXdMLHw":{"text":"Perfect location. One block off of Bourbon St., so you're close but it's quiet! It's a wel","useful":1,"cool":1},"rSmerCsY0olEWB-zVlMqrQ":{"text":"To be sure, don't come here for your honeymoon or other special occassions....the rooms ar","useful":1,"cool":0},"HbTGHGNHVrzbDttp3FAHow":{"text":"Not bad. Tiny rooms but hey you only need a place to sleep and shower. Quiet. Wish there w","useful":0,"cool":0},"teI8CNvosodyWBbPZXw4VQ":{"text":"The room rate is more than double what it should have been.\nWe stayed 3 nights, we had 2 d","useful":2,"cool":0},"2mIAOg5VPPZY77CCtTl8sg":{"text":"This hotel has a fantastic location and friendly staff, but that's about it. Our hotel roo","useful":1,"cool":1},"qgelHqhB7YNBL6UIigGzpg":{"text":"Currently staying here. I thought it would be a good location but the condition of the pla","useful":1,"cool":0},"sUyWQNvjyPybwGd_rYkuNQ":{"text":"Pros: Close enough to Bourbon Street but far enough away to avoid noise and still feel saf","useful":1,"cool":0},"l054bYQXD_Kl2FAPiU-srA":{"text":"The hotel was cute and in a good location. My two star review comes from the headache I re","useful":1,"cool":0},"ucx8g4jNXFVV-NNdIDRjLw":{"text":"awesome little place, we really enjoyed our time here. Cute little rooms. staff was beyond","useful":0,"cool":0},"x3OitLlc4J80_9jZdFhUYw":{"text":"We booked our trip to go to NOLA 3/1 - 3/5/018 in May 2017.  We were very excited about ou","useful":0,"cool":0},"Wo3WLXthwS1ZRObqyPpg-Q":{"text":"There are a lot of issues with how their rates are set up. How is it possible to stay two ","useful":1,"cool":0},"THpdyia9cBwN121AloN6ag":{"text":"I say stay within the French Quarter area and check out Bourbon Street and Canal Streets a","useful":5,"cool":7},"6xsveCBmhSTXvX7E4M6-Eg":{"text":"I lodged at the Holiday Inn French Quarters Lemoyne from December 10,2016-December 12, 201","useful":8,"cool":1},"i_UhHLdFgrfO9DsiVUvDMQ":{"text":"First time in New Orleans for a conference.  Stayed here for the location and ambience. It","useful":4,"cool":1},"Nkb6mMShoH1RyjNfXhzsxQ":{"text":"Very good hotel all around. Price was great and the location is ideal for French Quarter. ","useful":0,"cool":0},"yHUCOwr1Jra0yxYnfq_78w":{"text":"Stayed here for 4 days. It was my first time in NOLA and it definitely won't be my last. E","useful":0,"cool":0},"AO9aMqD0JvWVCWFtNEH58g":{"text":"I stayed here for the super bowl, and only did cause they had room..it is nothing special ","useful":2,"cool":1},"IHWvGXFQREc9rpKTJ0Es7Q":{"text":"Great location just outside of Bourbon. Easy walking distance but far away enough to avoid","useful":4,"cool":4},"K0aQW9ne_F4ftvXF9yHB9w":{"text":"Beautiful hotel, inside and out. Super friendly staffs. Rooms are super comfortable and cl","useful":0,"cool":0},"TJWQLHBjjEUwBxF9L-_T2Q":{"text":"Great location. Older hotel and it occasionally shows its age. That being said, the rooms ","useful":0,"cool":0},"ugbQlW9af4H0gdxCw6L83A":{"text":"Ozzy is one of the most kindest person I have ever met! The staff is extremely kind and ac","useful":0,"cool":0},"dwQe-cZsQpMpionfLRWc9w":{"text":"Mmmm. donut","useful":0,"cool":0},"cL5St7l69N4ikcXHRcQD7w":{"text":"Very nice hotel and very kind staff, everything looks very new and clean. Just one block f","useful":3,"cool":2},"6itu6iAY3oFkfU8wPE-47w":{"text":"Front desk personnel  (Todd) very rude and unprofessional do yourself a favor pick another","useful":4,"cool":0},"kccfhEcZ8INW_ReUS7Y6TQ":{"text":"We stayed here for 4 nights and enjoyed every minute of our stay. This hotel is away from ","useful":0,"cool":0},"26ElR852fyHo_f899ON6gQ":{"text":"Found and booked this hotel on Priceline. A great deal for the cash. I did not pay anythin","useful":0,"cool":0},"BOAvt5PbaXrO99ecUTxJ-g":{"text":"I flew out of Austin on 7am flight. I hadn't slept at all the night before because of fear","useful":0,"cool":0},"BHPGZp6_VqUqW3N-dzO8Xg":{"text":"Stayed here 2 nights on my first trip to new Orleans. \n\nHere's why this place earned 5 sta","useful":0,"cool":0},"jkdR-6ghx_GFRXxai1ZMzg":{"text":"We stayed at Chateau Lemoyne also known as Holiday Inn Express. From the moment we arrived","useful":2,"cool":0},"8n2GrdmmK130fGG3Rkat0A":{"text":"Holiday Inns have been getting better, but this one has it's problems. First of all the lo","useful":1,"cool":1},"DtBWeLOiEAvmcZOYBWklfw":{"text":"booked 2 rooms for Bayou Classic. bathroom infested with tiny black bugs!  inside of sink,","useful":0,"cool":0},"PgWL6BVZTTbeRhoEDMpoIA":{"text":"We stayed here a few days ago and just got around to writting this review.\nWe arrived on a","useful":1,"cool":0},"QLxiE5pOapRzFeGqB8zLYA":{"text":"Nice modern rooms althought you cant tell from the outside because it is in the French Qua","useful":3,"cool":0},"-yZA5fbxg1II1ZmZs2QRYA":{"text":"Was disappointed to learn that this hotel didn't have parking included in their rate (thei","useful":0,"cool":0},"sWXZctbmeeEitLU0vhmRXw":{"text":"This hotel is perfect! Super close to Bourbon Street and Canal Street, which made catching","useful":0,"cool":0},"I-TsK46h-MUCa8NlH-89Ew":{"text":"This hotel was extremely overpriced. I'm guessing because of location however it is not wo","useful":3,"cool":1},"BFzMX92Cig950uzGSB1JmQ":{"text":"Guest Services Manager, Todd M. Theriot made our experience a truly bad one. We were trave","useful":9,"cool":0},"RrnKdH9MHXv4dGie-SldHA":{"text":"I stayed here last week while I was in town for a conference. Since it was a 3 star hotel ","useful":1,"cool":1},"PKPCQebMUGjfLcl5pT1B2w":{"text":"My boyfriend and I stayed here for our first ever visit to New Orleans. This is located in","useful":0,"cool":0},"jh0GQVAesfcSn8XpCp7xIw":{"text":"I was hesitant after reading reviews prior to going but thoroughly enjoyed our 5 night sta","useful":0,"cool":0},"wRJjb-two5hRxm76ijvrug":{"text":"We just returned from a 3 night stay in New Orleans. We were very pleased with our selecti","useful":0,"cool":0},"aK1blThc9NB9f1FRdSThGw":{"text":"Decent room at a good price.  One block off of Bourbon St.  We were not made aware of a ma","useful":0,"cool":0},"F8t644mqucV-rOiADBiRVA":{"text":"I'm a snob and I like this hotel.\nI'm a snob.  I know that sounds bad, but I have high hot","useful":6,"cool":1},"Z8qNLBdpNYq4Cji0AwZYUA":{"text":"We stayed at this Holiday Inn for three nights for a bachelorette party. There were seven ","useful":0,"cool":0},"0L-P9T6hNcQL2t57pDkIuQ":{"text":"The hotel was pretty nice. We stayed on the fifth floor and the room was really large. The","useful":1,"cool":0},"DCo-xq0KUN8EJ0qq_RCT_Q":{"text":"I am so thankful I found this hotel, if you are planning on coming to New Orleans you HAVE","useful":1,"cool":0},"2ddXO9mOie2nKyZjwXfLAw":{"text":"I have had a bad experience with reservations at Holiday Inn.  I would give them no stars ","useful":0,"cool":0},"tnUfjON_f8OsZSWItgf6vA":{"text":"Currently staying here and to say I'm disappointed is an understatement. I used to stay he","useful":10,"cool":0},"DLEb2EJmC3eYfvgG3k1mNQ":{"text":"The location and cleanliness was great . The staff however not so much , the front desk st","useful":0,"cool":0},"r0z0tBFQgusOSlQn5oMH8w":{"text":"We had our wedding in the courtyard here. The suite was absolutely beautiful and everyone ","useful":0,"cool":0},"9uSXBeMK1arsp__8PPKNZg":{"text":"Was great the staff was friendly and the location is perfect for partying in New Orleans. ","useful":0,"cool":0},"GGXpikUFgX72nbiZ4susIw":{"text":"Great location, comfortable beds, concierges were awesome, great recommendations and very ","useful":0,"cool":0},"HgpNX2O15fDbM8E4nr7h4g":{"text":"Excellent accommodations! Excellent location! Clean Room! Excellent staff! The staff made ","useful":0,"cool":0},"FroJUon-GKK9hZshCs8Jmg":{"text":"Just stayed here for a few days and although the hotel was very nice my brand new sunglass","useful":3,"cool":0},"_RZaoJ6Tam_mf3ZQb5gStQ":{"text":"We stayed in a suite (a king size bed and fold out sofa) for $130 a night with AAA Rate.\nW","useful":1,"cool":0},"UfehBb2o1yPS6mWIzrkc8w":{"text":"We stayed here before a few years ago and it was fantastic. This time however we must have","useful":2,"cool":0},"NulCaIYf8kFxCYQGOFeTaw":{"text":"Let me start by saying I am thrilled with this hotel. Never have been in this area before ","useful":3,"cool":1},"Qp1NS3QFyTSo0AqT0zfaoQ":{"text":"We were super surprised how nice this hotel was. We liked it better than the nice hotels o","useful":1,"cool":0},"dX58RYFBiqvnKQXwG0175w":{"text":"Super cute and very comfortable boutique hotel one block from Bourbon Street. Perfect loca","useful":1,"cool":0},"lq5RzuXx4zKnG2vwokkXTA":{"text":"Renee and others make up for what one dude on the night staff takes away, a personality or","useful":1,"cool":0},"YudsAVexVUKrswd1XfuQng":{"text":"for the price this place is a steal! it's conveniently located one block fr bourbon and th","useful":0,"cool":0},"B9gs3tUvSRS4S89CxMzVXA":{"text":"Beautiful room but air conditioner unit is loud as hell. Like really loud. After a day I g","useful":0,"cool":0},"vxGueEH_HIs32WfmDOhwQw":{"text":"Beautiful room, the building tells a story. It's a street over from busy Bourbon St. it ma","useful":1,"cool":1},"oz1Wct3OH46mCYPOququ2A":{"text":"DO NOT STAY HERE. My friends and I booked a room in January for a stay in October. We flew","useful":4,"cool":0},"9-qzTGkCR2NXJMRGHIp0hw":{"text":"As a Gold Elite member who spends lots of money and time with IHG hotels, I was appalled t","useful":7,"cool":1},"AH09bBuOeqBo_oe6IfKNBg":{"text":"Stayed over the four days surrounding new years. Loved the decor of this hotel, especially","useful":2,"cool":1},"6VyVoyNeuM5Bamp3Ex_pww":{"text":"This spot is ok. Rooms are decent, but double beds are not the business. Room was clean, b","useful":2,"cool":1},"U5AVDtOSsSA0rWGuhKZi7A":{"text":"I travel a lot.  Worldwide,  and I have to say this was the sorriest hotel that we have ev","useful":5,"cool":0},"HeHsuC_GJz_N90bT17nBGA":{"text":"Here, price is king. This is one of the better values in the Quarter, with reasonable rate","useful":3,"cool":0},"hngDtggjUTYeEaLnruTPLw":{"text":"First off, some of the staff wasn't wearing a mask when we got there. Secondly, the room t","useful":0,"cool":0},"my5v5umN7vaOka8PkWzW9w":{"text":"This is VERY ODD... I am sure that I had already posted a review (and a very good one) for","useful":4,"cool":2},"UKUEDwE3eyCAWx8B8PiZ_w":{"text":"My friends and I had a wonderful stay here during our first trip to New Orleans! The hotel","useful":5,"cool":2},"66Xh3ahhgS83-X2oBx19lg":{"text":"We check in the chateau leMoyne friday  in Louisiana it's really nice the room were in ver","useful":1,"cool":1},"kCNn-Wyu1uMIjpfIxjPorQ":{"text":"THE VALET DRIVER BACKED MY CAR INTO THE WALL, THEN DENIED RESPONSIBILITY. We arrived Tuesd","useful":2,"cool":0},"CYx65PqUJ277f4RS7sSnQQ":{"text":"Stayed here for one night while travelling through New Orleans. Location was great! Close ","useful":14,"cool":9},"gOZ6jbmsNY1u8UKe_g0BJA":{"text":"Somewhere between 2.5 and 3 stars is accurate for this place. It was a pleasant enough sta","useful":11,"cool":0},"hCsOK6himBX49LIIgST2bA":{"text":"Great location one block from Bourban St. and just over a block from Canel St.  Rooms were","useful":0,"cool":0},"UR5wER_dH0PCaavhCiI-pg":{"text":"So the good, the staff were incredibly friendly and wonderful. \n\nThe bad, rooms need atten","useful":0,"cool":0},"zBj63Sy3zWGu3tyUc4RYZA":{"text":"Loved this place! This is a historic building that's been renovated by the IHG group and t","useful":4,"cool":2},"bwWocyr8jxdP5NclLGEAVQ":{"text":"Good value for the money. I stayed there for a week for a family vacation. The location is","useful":3,"cool":0},"OCXGnUYFYr_36ozEp88SuQ":{"text":"I must say that I wasn't impressed with the service that I got here at this hotel. I recen","useful":1,"cool":0},"ZgBzcetGZoEQAKY_j5Fv2Q":{"text":"The devil exists and her name is Renee. We were supposed to have an employee discount but ","useful":2,"cool":0},"n46vpHoAHvp-NG_0wMscYw":{"text":"Great value considering location!   Building did have the look and feel of the French Quar","useful":0,"cool":0},"yG2DdOKyJzPG27sRXfp9ZA":{"text":"The location is fantastic, but the rooms are definitely dated and housekeeping was terribl","useful":2,"cool":0},"Rag5nsfl4pCqxHpJdNPt-g":{"text":"My wife and I planned a 4 night stay here in January of 2015.  Everything about our stay w","useful":0,"cool":0},"ED8EsxxI87y0_k9YSDPosw":{"text":"Very disappointing hotel. long line in lobby for check in. In four days time only saw one ","useful":1,"cool":0},"ALXwa0kH6uuLmYpKwGLFBw":{"text":"We stayed in a king balcony, city view on Bienville. Probably the nicest room we've ever h","useful":1,"cool":1},"hFjDV9V9rG2vozoyPAmmUA":{"text":"The rooms smell like mildew, there was never any hot water. The service was good though as","useful":0,"cool":0},"OsGMGrHvftrW7SnwlUV2bA":{"text":"I DO NOT recommend this hotel at all. You are much better off going to any other hotel in ","useful":4,"cool":0},"juQVHJUVffgfJwXx2hZwNw":{"text":"My family enjoys staying at boutique type hotels in NOLA.  This is a cute hotel that was p","useful":2,"cool":0},"k5A_GwpuabA0ZJTA5cgBjQ":{"text":"Four of us stayed here three nights in early June.  Hotel was okay, staff was friendly.  P","useful":0,"cool":0},"9y93lptTTOpMScyzu3O_mg":{"text":"After scouring reviews and driving myself crazy, a package deal from travelocity including","useful":0,"cool":0},"28LIB2EWya8eH2KOyGeZOA":{"text":"Great location in the French quarter. Sits RIGHT outside hour on street so you can still w","useful":2,"cool":0},"wf6ADaNGhwE6s_UOr1Iq0g":{"text":"They have 0 towels at 8am. 40 dollars to park your car daily. Staff is the most depressive","useful":2,"cool":0},"GJCeuYz0Bf2W0AC2YFRHQA":{"text":"This place is a good value. For those on a budget, who want to save on a hotel room *in* t","useful":6,"cool":1},"dsVi8h9KLmQEO4wO8UQ8xg":{"text":"Repeat Guest - this Review Update is for my 6th & 7th Stays, in 2014\n\nA well-deserved 5 st","useful":7,"cool":4},"W2BDwq6Mjgs17W6M3B9obQ":{"text":"Tic, tic, tic, tic, tic, tic, pause, repeat. These were the Chinese water torture sounds m","useful":13,"cool":4},"FCCM4AcE2htw39LLBHLCUg":{"text":"Awesome hotel! If you're planning to visit New Orleans this is a great place to stay. We e","useful":1,"cool":0},"PJfhcYNx7J_531dT0ioClA":{"text":"Not sure why the reviews for this charming hotel aren't higher. I've stayed in many so-cal","useful":2,"cool":0},"patiuGtgn1SGAgIP-yV2SQ":{"text":"For the price, it's a great value.  It is located right in the French Quarter just a block","useful":1,"cool":0}}