{"cejwyz1Hn1yQ-v2m9PAovQ":{"text":"I absolutely love Courtney! She is hands down the best hairstylist I have ever had. The re","useful":1,"cool":0},"qItJUL2kKxJUTQ4RKhSPnA":{"text":"Yesterday was my first visit to Paris Parker. I have never gone to a stylist that didn't c","useful":1,"cool":0},"R6qetLEni26r8Phldc11Bw":{"text":"Courtney Bradberry was friendly, professional, and gave a mean haircut. The salon itself i","useful":0,"cool":0},"QSLET5soVnAAC0k8DJIDxw":{"text":"Extremely happy with my hair. This is such a relaxing place, I highly recommend it. Very t","useful":0,"cool":0},"zdraSr8Y7jykumYJ_htmpw":{"text":"I love Courtney!  She never disappoints.  She will spend the time talking with you about y","useful":2,"cool":0},"q_F8EZoi76XFWckM2DWkEg":{"text":"Great salon! Staff is super friendly and I was taken for my appointment right on time. Mic","useful":0,"cool":0},"4M9q2_iKsdhH6pEJoSmgTA":{"text":"Ask for Christine.\n\nSeriously. Just do it.\n\nShe's a little more expensive than most of the","useful":5,"cool":1},"I2ZFvmywC8vvjt4xtB2kJA":{"text":"I've finally found a hair salon in New Orleans, after living here almost two years!\n\nAfter","useful":6,"cool":0},"D6kMBODyDHHhl04xItWKVw":{"text":"I went to this salon at the end of last year and had my hair washed and colored. The color","useful":2,"cool":0},"Jd_z7AevMM0_0QdxthYBpg":{"text":"So glad to have found this spot! Michelle did a great job with my hair, and was fun to cha","useful":0,"cool":0},"-PETHZfg7sGV0kP9151jzA":{"text":"Courtney Bradberry is a true artist!! I have been going to her for 10 years and I couldn't","useful":2,"cool":0},"LKMbKz_l_1fomZDo69lZdg":{"text":"I have got my hair done here a few time now and I really like it. The coloring is expensiv","useful":0,"cool":0},"rGC1xye6oXmNZd1-yqFYqg":{"text":"Colorist Chrissie Gilberti is THE BUSINESS. Holy shit. After I got out of this woman's cha","useful":4,"cool":2},"vOPnIhOWxgoiSAgvAvQGSQ":{"text":"I am new to this city and very particular when it comes to my hair.  I googled and decided","useful":0,"cool":0},"X1fXbvjobFrFogfT_fwrTQ":{"text":"Writing in with another rave review for Courtney. She was the first stylist I ever had who","useful":3,"cool":1},"uyTqBW-gbia22FN0Gz5WsQ":{"text":"Excellent customer service!!! Needed a cut and color last minute due to another salon canc","useful":0,"cool":0},"EahfgCgIsSscpeS09stamw":{"text":"I went to get my eyebrows waxed at this salon and was first charged $24, which is almost t","useful":5,"cool":0},"s13NnCUlMDnUP-NUMLuHOA":{"text":"Not much to say about here, guess if this salon style and Aveda products is your style the","useful":0,"cool":0},"eQPKPMdchTSm8Y25TRVf7A":{"text":"I have been to the \"best\" salons in New Orleans and I always come back to Paris Parker on ","useful":2,"cool":0},"iAoDvO-rv5SsfcQuDf0UPA":{"text":"You get what you pay for. Service is attentive and friendly and not stuffy, which is nice.","useful":0,"cool":0},"ErQ2Qsz4eRKCk4WtwP7X2A":{"text":"I was in NOLA on business in  September.  I had to get my hair fixed because I had no othe","useful":0,"cool":0},"JthnDAMTORJw-6BflpsTlg":{"text":"Two and half stars. And mind you, this is more a review of the salon than the stylist. The","useful":2,"cool":0},"6ukOJCFsNsASIx3GaC2sXg":{"text":"I came here for a haircut and was met by a stylist who had the worst negative attitude I'v","useful":7,"cool":0},"qxl2e8UpPPvxZGhtUhrggA":{"text":"I was so pleased with my experience here. I have been shopping around for a hairstylist he","useful":0,"cool":0},"cJxzj35Q8PPoBK0_CXcXgg":{"text":"After the complimentary test strand, went back to get my hair corrected.  Awesome sauce!!!","useful":1,"cool":0},"3QVoadaHPau7AuYwkkFFVA":{"text":"Honestly these are some of the snottiest hairdressers in town. \n\nEveryone I have met there","useful":1,"cool":1},"k5uf29AvYXlFmlPyhgXrdQ":{"text":"Paige left. She cut my hair for two years. But luckily I found Corinna. She's just legenda","useful":1,"cool":1},"apCHgmAimcwpWaKR9g6rnQ":{"text":"I really like this salon and I've been coming here for about 2 years.  Aveda products are ","useful":0,"cool":0},"W_BZJ36fQcAx9D7Zg0y-9g":{"text":"I've managed hair salons for years. Although I don't do hair myself, I do know a good styl","useful":4,"cool":0},"H_FT-hsci4MWPsZH5ikCTA":{"text":"Do not book here if you have an important event!!!\n\nI booked a hair color appointment with","useful":2,"cool":0},"u6cA2e7c6sCWNPfzkzzQPQ":{"text":"Such a beautiful salon! The staff is friendly and makes you feel right at home. I schedule","useful":0,"cool":0},"w8CgjwiTPSMDGY2DDEJYQA":{"text":"This salon is incredibly professional, and their customer service is always on point. Alth","useful":0,"cool":0},"1klHJrrvssGt9ruvBathtQ":{"text":"I'm here because of a botched Asian hair job, which I paid $200 for at City Looks Salon (y","useful":1,"cool":0},"7Wuuh73hzglQsDjaAl7s4Q":{"text":"My friend recommended me here, and I had Korinna. She's really friendly, and did a great j","useful":2,"cool":1},"_lVwG6O7xXffG_yh9Bj5Vw":{"text":"This is a lovely salon, but doesn't afford much in the way of soul or value.  I think it d","useful":5,"cool":1},"jL9XF4wnu6KBOF9I9AxSLg":{"text":"This place is just average.  I want to like it a lot because it's so pretty.  But, in real","useful":0,"cool":0},"7yg_aYHQynkU0uHzkCPgQA":{"text":"I have been here 3 times, and seen 2 different stylists.  While the salon is great and the","useful":0,"cool":0},"NbPoLG9Hz1qw9X2XbjxHkQ":{"text":"Try Paige, you won' regret. She knows what I want, and cut precisely.  I received complime","useful":1,"cool":0},"bfWRYHUC7PRIHbpO7kSaJw":{"text":"Relocated from another state where I really liked my Aveda salon. However, on the advice o","useful":0,"cool":0},"WOK8MHGM3QqPOFBTpFdGeA":{"text":"I went here while visiting New Orleans and after a night of drinking didn't feel like doin","useful":1,"cool":0},"YbEAdQX5IzSdJcvwDfMArA":{"text":"I've been here twice already and received haircuts from 2 different women. \nThe first hair","useful":0,"cool":0},"WWIRdwpm7IedKQJso25LQw":{"text":"After 7 years of using the same hairdresser I made the change. Having just moved from Bost","useful":0,"cool":0},"fBJG433XkbNan24BU94Q0g":{"text":"Yes to Andrea!!! I came in with a very specific idea in mind for what I wanted, brought ph","useful":0,"cool":1},"6Pv2AjC8aE6fp0oI_BpDRg":{"text":"I've been going to the Paris Parker salons for years and every time it is consistently gre","useful":1,"cool":0},"PzAuUm4uPwzU0DQDE-G7SA":{"text":"Worst haircut ever!  I have curly hair and told her before she started cutting that when i","useful":0,"cool":0},"Usigvv7up4sggCEalfY9cg":{"text":"I showed up for an appointment today only to find that the Stylist, Roman, had double book","useful":0,"cool":0},"SlLpNdFgn_PLhMAuYRkiWA":{"text":"I am a big fan of Paris Parker Salon, and a client of Jared for 13 years.  I look forward ","useful":0,"cool":0},"DlwQXNifcJrNnfD-WkFfHg":{"text":"I've been going to Paris Parker for a few months now and always have Paige cut my hair. Sh","useful":1,"cool":0},"MMyM4cFagaeopm_qJ6kjFg":{"text":"WOAH! This place is amazing. And Allissa makes ALL your hair color dreams come true.  I ca","useful":0,"cool":0},"-MDdkWocvWg2N3Tq8vQ4Eg":{"text":"Went here for a while, never found a stylist I liked that much.  The last time I went, I c","useful":6,"cool":0},"W-C-xudgeutzGa7mXaRSkg":{"text":"I've been visiting Quinn for the past 5 years and he's never skipped a beat in terms of ge","useful":2,"cool":1},"ri6KIVBJ7SFjXi_dPtmoHw":{"text":"Left the salon in TEARS!\n\nMy past experience with AVEDA salons has been amazing and I had ","useful":0,"cool":0},"l4wGkX5_o9Fvkb_QYigYcw":{"text":"Love my hairstylist Amanda C!. I have fine hair and she does a great job accommodating my ","useful":0,"cool":0},"L6Nn57mEBpnzgbBBbZImvw":{"text":"Definitely the best haircut I've had in years. I brought a photo of my favorite haircut. S","useful":0,"cool":0},"iFMzkiYHpVj9zdrkJTqNfA":{"text":"I feel like I get some of the best haircuts of my life from Courtney, and I love the color","useful":0,"cool":0},"9_csB2-VrojY4HD15D1IQg":{"text":"maybe someone was pranking me??? I thought I'd spend some serious money on self-care and s","useful":0,"cool":0},"FW-WzFIAqXLzklpy5FQhzA":{"text":"My hair needed some TLC after moving into the city. After having a terrible experience at ","useful":2,"cool":0},"ciO1Fa2ULOGAlLOR0kWE1A":{"text":"Tatum's haircuts are on point. The atmosphere is great and the staff was friendly. My hair","useful":0,"cool":0},"U7RCrJzETggSQOOs-FzOaw":{"text":"Lovely salon, lovely service. Went there for a last-minute haircut based on a friend's rec","useful":1,"cool":0},"3Dsht9xJNInuvHIhHgm11A":{"text":"Just got a haircut here from Sean and I can't wait to go again.  The staff is so nice and ","useful":0,"cool":1},"DC4048IncvbA2d6bzEOy5Q":{"text":"Ask for Paige\nMe and my man had her cut our hair today and we are both very happy with you","useful":0,"cool":0},"Pib1nCTjseR__3jc8_4aOw":{"text":"The haughty, curt redhead who checked me out after my appt owns this one star review.  Rud","useful":0,"cool":0},"HZIXKe-4U7WaU0RKbK0bfg":{"text":"Chris Guidry gave me a beautiful haircut today to fix the worst haircut I've ever had in m","useful":0,"cool":0},"ujAFGr062lCo9QAvObnbgA":{"text":"First visit to Paris Parker Prytania today and it was wonderful! Booked online this mornin","useful":0,"cool":0},"VZT2lHCxKIs2wDp02uOJTg":{"text":"I have gone to Paris Parker Prytania as long as I have been living in New Orleans (five ye","useful":4,"cool":0},"Xj38eKzF56o3a1K-aWgybw":{"text":"I am glad i chose Lindsay juss for $30 she gave me the best haircut n style. I wish these ","useful":1,"cool":0},"JzDufJATPWOXhcO8CIWtsQ":{"text":"I had eyelash extensions applied two weeks prior elsewhere. Not having them before, I was ","useful":0,"cool":0},"Z_SeR1wtJGatthObv1MzuQ":{"text":"Shawn B. is a fabulous! was in NOLA for a conference this week and was in desperate need o","useful":0,"cool":0},"ONye6yV0kGmEwM810XZrQQ":{"text":"My first time at Paris Parker and I had an amazing experience! My hair was done by Gabriel","useful":0,"cool":0},"pIu1ZmJUnXtXWh8SpLlRvA":{"text":"Loved my cut by Corinna!  I'm growing out a short bob and she spent the time to go in and ","useful":1,"cool":0},"AHJZPEOaW3zpruhFbHLhCQ":{"text":"Best in the business. Would never consider going anywhere else. Friendly staff and wait ti","useful":0,"cool":0},"zuoMpyR98J3zKtUegqp9CQ":{"text":"I came to this salon with a glowing, healthy head of fresh cut hair (just a week prior at ","useful":1,"cool":0},"3LJ15kmvU2eGpavrkXHq-A":{"text":"I am new to the area and desperately needed a haircut this weekend. This salon was open on","useful":1,"cool":0},"AnxSqnIPBVz_EwoW7S5K_A":{"text":"Yes this place is a little pricey but you absolutely pay for what you get. This place is a","useful":1,"cool":1},"f4oO9bFIAAmERj0pG8O6Hg":{"text":"I came to this salon because I wanted color specialist Melissa Twillie to color my hair. I","useful":0,"cool":0},"pO9uVz6gjlPYuXoDjMRhvA":{"text":"Roman cut my hair and did an amazing job. I've been getting my hair cut for many years by ","useful":0,"cool":0},"ZozfK1xd7pAQ693nk2fAMA":{"text":"Mark was amazing and I so appreciate how he respected and flattered my hair!!! Definitely ","useful":0,"cool":0},"Lk1Y4Hd5-fkF741rXzJ4kw":{"text":"I am so happy I chose to see Patti for my blonde highlights. She was so efficient and real","useful":4,"cool":3},"pnyM_Lsni6kJQn1oIz1SiQ":{"text":"Very nice service. I went for a 1/2 head of highlights. Bethany did a great job of mixing ","useful":0,"cool":0},"kXliEag0meYWVM4mITRPFg":{"text":"I had my hair cut by Brandon yesterday- I think he is new ish to the salon (returned to NO","useful":0,"cool":0},"Y-zG_w8hGnKm_pHS8LhPvA":{"text":"Meh. Lil overpriced for an C+ (generous) haircut. Think I paid $55 with tip. Haircut was 2","useful":2,"cool":0},"aw9-4y23aqaRytpJUFWPXw":{"text":"Love this place! I go to Leslie and I always feel so listened to. She gets what I'm trying","useful":1,"cool":1},"vWdtpVtcDaLgOLto0DzCHA":{"text":"I absolutely loved my haircut!  Sean did an amazing job.  I was going from waist-length ha","useful":1,"cool":0},"RtJNi4pWfaG4cvqEKMb9qQ":{"text":"Review for Jared at Paris Parker Prytania: I cheated on my hairdresser yesterday. I feel g","useful":0,"cool":0},"uBpneJUk_biGbvbpwKA9nA":{"text":"I am disappointed with the haircut I received from Leslie. I have tried many different sty","useful":0,"cool":0},"nBlynEFVJ4P8Q1lQ1DixEg":{"text":"Was lucky enough to grab the last 5 pm appointment last night with Brandon and LOVE my hai","useful":4,"cool":3},"Qaf3dzaQ6go8vv4s2ImDLA":{"text":"I've been an Aveda fan for years. I started going to a salon out in SF when I lived there,","useful":7,"cool":1},"lUZh_ukkaJ1dEcYqhD81Pw":{"text":"I've been here 2X for hair cuts and have an appt for this weekend for a color treatment.  ","useful":4,"cool":0},"srzQshafICZ1fZKa63t74A":{"text":"Called this salon over 8 times to get availability and pricing for a certain stylish to do","useful":3,"cool":0},"LBWYjYEhmqDTTUoxb5DP8Q":{"text":"Great experience from beginning to end, from guest coordinator over the phone & in person,","useful":1,"cool":1},"2IzuXLfwUlnZjyXEg-dhkQ":{"text":"I am disappointed with the haircut I received from Leslie. I have tried many different sty","useful":0,"cool":0},"ouiZC3H44tQY5gzX9nO1Hw":{"text":"I love this salon so much. I've probably been going here for 15+ years. Occasionally tryin","useful":2,"cool":2},"0Yu-VqPZ4rKHb0X2PHNxqg":{"text":"I don't get my hair done very often because I have naturally curly hair. When I need a cut","useful":0,"cool":0},"wuGW_PWgGdDV0_sNadc5ig":{"text":"Had a great experience at Paris Parker as always! Jared gave me a great haircut, the servi","useful":0,"cool":0},"PmPZ8k3q7rGdJCmnxf9LCg":{"text":"I REALLY loved my experience here. Everyone was very warm and professional, and the salon ","useful":0,"cool":0},"76ADOGqzjKDk5fNYDvLt6w":{"text":"The color was fantastic - as always. Bethany is always professional and does an exceptiona","useful":1,"cool":1},"dJXokLAG4F_0UiYhofgcaA":{"text":"I've been having my hair cut at Paris Parker for more than 13 years (it is probably longer","useful":0,"cool":0},"qsxwQ3xLLC21NSWkGD3dPQ":{"text":"Worst Aveda experience EVER.\nNew in town, went to get my hair done as usual, even brought ","useful":7,"cool":0},"3pQfu7DYgXGSbqLfVa3vcA":{"text":"This review is for Corinna:\nI came in with a butchered, awful, choppy uneven layered and s","useful":3,"cool":1},"vv6LJiXAGLW9kZ5QkXDR4Q":{"text":"The DREAM TEAM: Gabby and Thomas!! I went to Thomas for a cut and he did such an amazing j","useful":0,"cool":1},"qsJfFFixTImS1STUmCFpdQ":{"text":"Love Chris. He's the best! He's not cheap but worth it. Online booking is easy and they gi","useful":0,"cool":0},"mm2DWtU0sGcFC6sga0TDDQ":{"text":"Love this place! The products are mostly comprised of certified organic ingredients and th","useful":1,"cool":0},"J2nr1iDhIb-HNnLrDeS5BQ":{"text":"This review is for the front desk customer service. While most Aveda experiences make you ","useful":1,"cool":0},"CzyMQH5NWSrMEh2qey0_Iw":{"text":"Corinna is an amazing stylist and gave me the greatest cut today, not to mention she's rea","useful":1,"cool":0},"hHyDbepWqB_n9N796Qu_Rw":{"text":"This was the first of many visits to Paris Parker on Prytania! The salon itself is so beau","useful":0,"cool":0},"L8QPt-_E5MSp1jOGHhHRbw":{"text":"I've never had a bad cut at an Aveda salon, so moving back to New Orleans I decided I coul","useful":0,"cool":0},"u1LKlioyoU6q0XtRppb4eg":{"text":"Corinna gave me the most stunning bob, very classic style that can be sleek and sophistica","useful":0,"cool":0},"_zByzf9aqwGVpR8uqIqZNQ":{"text":"The salon is beautiful. Everyone is nice. They have a million great products. Brandon gave","useful":0,"cool":0},"aOG4mRPRmyWzNDV0lg2lKA":{"text":"Just balayaged the crap out of my hair with Stacey and it looks awesome!!! I've never had ","useful":3,"cool":1},"kquC2O9ikw0aBcugSmDOmQ":{"text":"I can't say enough amazing things about Chris. He is great with hair, and really really ni","useful":1,"cool":0},"INc4B1kpYBfO5BCj4MltlQ":{"text":"Omgggggg!!! Let me begin by saying that Brandon is a godsend! I had one stylist for 20 yea","useful":1,"cool":0},"oLMZQO9WGqEajB636sCOUQ":{"text":"Anytime you move to a new city and have to get a new stylist is a terrifying experience. U","useful":0,"cool":0},"MOB7BlhcYNuNth55K7j5Kg":{"text":"I just got a haircut with Brandon and he did EXACTLY what I wanted! I am so happy with the","useful":1,"cool":0},"ftNw8OcnvNc0kiuROuc6uQ":{"text":"I am SOOOOOOO glad I read the reviews for this place, because Paris Parker on Prytania is ","useful":1,"cool":0},"QVHlvfhFlZCCF2E7TG0UHg":{"text":"I really like the Aveda botanical hair treatment here, I got it a month ago and my hair is","useful":1,"cool":0},"EPvHkH_am9ExQtyTBnWSvQ":{"text":"Stylist gave me a very clean cut--smooth edges around a bob. She even saw that the back of","useful":0,"cool":0},"7fKL5-IeOLqBOqxKb52yYA":{"text":"I am giving this salon 5 stars because Leslie rocks. The atmosphere is great and the produ","useful":0,"cool":0},"EUcBnBH_7GpxXxVKrGru2A":{"text":"I have never written a yelp review before but I thought I should share my experience.\n\nI h","useful":13,"cool":0},"LjoMbr0ZJzhYPoDz4mPm7g":{"text":"I chose Quinn because there were so many great reviews about him... sorry to say the visit","useful":4,"cool":0},"TU854ffBblfJMJ1JZkKBmA":{"text":"I love Paris Parker and have been going there for my hair care for several years. I feel s","useful":0,"cool":0},"KKicgJwPL-z0MF1QsWFr2A":{"text":"I left a quick tip that said: \"Quinn is the man!\", and I thought I should elaborate when I","useful":3,"cool":0},"ZI2mGT9tf_LYxeHO2O4geg":{"text":"I was shocked at how terribly unprofessional this salon was! Not only did the stylist not ","useful":0,"cool":0}}