{"KSz1joxDWSz32JxfdJZgGw":{"text":"Great service from Patrick today! Food was good and very affordable. Burger was very tasty","useful":0,"cool":1},"b0-dtjP549NP5qw3L2J2Iw":{"text":"Food was cold and the chicken was over fried. The Monday night drag show didn't start at 8","useful":0,"cool":0},"cnALbyLY4Bx71XOUug2gVQ":{"text":"The House of Blues is really spacious. When I was there, there were not one, not two, not ","useful":3,"cool":4},"h-D4TQAr-befuogBrUwuqw":{"text":"There is a nice coffee non-tourist trap like restaurant inside the House of Blues..   When","useful":0,"cool":0},"CJqbMDVDMiBRlRpBD6UZXw":{"text":"Gotta say I was pretty disappointed.  Our waiter was great and the atmosphere is interesti","useful":0,"cool":0},"cOfGKsBEzPJDBjryT9nyJw":{"text":"Great place to see a band and have dinner or drinks. A bit pricey, like any touristy place","useful":0,"cool":0},"MtrT18VuvDlcsIEdzqxXhw":{"text":"The House of Blues is a must-stop every time I visit New Orleans. Although it's lost a ste","useful":0,"cool":0},"EYq8MdZNyD_S_V3vcbiHFw":{"text":"This is our third visit to HOB, the food and drinks always disappoint. The only time the e","useful":1,"cool":0},"-gVdrYqbrfJZqAfEAITxYw":{"text":"I attended Dragapalooza tonight at the House of Blues. I understand it's s Jazz club with ","useful":0,"cool":0},"IdXFbn-ISGEif8wjPYctZg":{"text":"We came for the Brewisiana event and the set up was grea! We had the alligator dog, the cr","useful":0,"cool":0},"1aH423RHvObRw4m01g6c0w":{"text":"We had an awesome night at House of Blues! Our waiter, Sidney, was the best!! Had a great ","useful":2,"cool":1},"ek0yWMIH1-ewAo86ALFYeg":{"text":"I love HOB!! The food has always been good, and the setup is great for concerts. \n\nThe onl","useful":0,"cool":0},"L9Te-POldNrH7hS7WNt1kg":{"text":"Fun restaurant. All of our food was good. Husband had chipotle shrimp and grits. I had bla","useful":0,"cool":0},"NFMNw5ZIPmx2Pn2n85lNPA":{"text":"I have tried to dine here twice before a show. Both times, the entree ticket times were ov","useful":1,"cool":0},"Yx65mnMaks9E5qQrwqS2-g":{"text":"Pretty average overpriced food. Standard mid-size music venue. Intimate setting if you get","useful":1,"cool":0},"pdReaje7SKVOyoMiaQ5MJw":{"text":"I've performed at every House of Blues in the USA,  during my stint as bassist with Burnin","useful":1,"cool":1},"yJnjcs6WnSs_C6QnihJ4Eg":{"text":"This place is great. The food is good, the music is good, everything is good. Ask for Chri","useful":0,"cool":0},"B8k5AS3_dy_c-yUJBIr3AA":{"text":"It's a house of blues.  Pretty decent venue if a good show is playing. Wouldn't come here ","useful":0,"cool":2},"twq8r42NleObaejha_-nXw":{"text":"I purchased a $4 skunked PBR from the bartender during the wonderful Melanie Martinez show","useful":1,"cool":0},"LgqBgc3ZRBkqDAm7O5QPdw":{"text":"The venue is great, good sound and the staff is super friendly. However, HOB loses a star ","useful":0,"cool":0},"HytkyooIO3D442EmRhus5w":{"text":"Worst Jambalaya I've ever had. Not spicy, bland, and nothing but rice. Upgraded it with sh","useful":0,"cool":0},"mSs4wPUP39t3AyJyNhoj6w":{"text":"Great food and prompt service at the bar. The burgers are to die for. We strongly recommen","useful":0,"cool":0},"bcKPPRAwqzoOb5tg2ZXvEA":{"text":"Great food, great service! This restaurant is cute and tucked away in the French Quarter w","useful":0,"cool":0},"f43_9adZNmXcH8G_PK_d1A":{"text":"The House of Blues in New Orleans is the perfect place to see your favorite concert....I w","useful":2,"cool":1},"4Tdqgt_Z135CCW_WwRsmUA":{"text":"You went to the freaking holy land for Southern food and you got stuck at Crossroads. Pity","useful":0,"cool":0},"RXBs7oUYIFyAdeu8OkIX6g":{"text":"My wife and I enjoyed lunch here on NYE. The hostess was very inviting and our waitress wa","useful":0,"cool":0},"__7yAG53muwbticU_GiXqQ":{"text":"Brunch Review Only\n\nOverall: Not worth it.  I was really excited. Too excited, probably.  ","useful":4,"cool":0},"r93JCyrxX3PYmbwH3JukBg":{"text":"I wish I could give this place zero stars. I went with my group of friends, excited to see","useful":0,"cool":0},"Kbc53Ipne2cYHZXS7z-LPQ":{"text":"HoB... overpriced drinks (they have \"specials,\" but it's still $8 for an itty bitty cockta","useful":5,"cool":1},"rPWNkXtfJG2XUq2SI0q_GQ":{"text":"The food was good, I'm writing to warn you to check your bill!\n\nAfter enjoying the first S","useful":0,"cool":0},"J2y-zTdipsV0bE9bobIQ3A":{"text":"So being from Houston I was expecting this large, commercialized concert venue and when I ","useful":0,"cool":0},"wvwnhcgQQnJYyslPeWijRA":{"text":"If you are dying to go to a tourist trap and eat bland spinach and artichoke dip and  frie","useful":1,"cool":0},"JkA2pruAqPd52EJrxauTDA":{"text":"I've been to the house of blues in other cities and had expectations that simply were not ","useful":0,"cool":0},"X-uz3nCyCHHQ5rc9Nms9uA":{"text":"We attended the Sunday Gospel Brunch October 1st. If you arrive early, they seat you in th","useful":1,"cool":0},"-yWqdzWBR335fVjxxETgYQ":{"text":"This was my friends and myself first visit to NOLA. We came across HoB and decided to eat ","useful":0,"cool":0},"sda1tUQHhPQUTLdoT5AhTQ":{"text":"We are visiting New Orleans and found HOB while walking around - didn't know what to expec","useful":0,"cool":0},"kHZxxxA0ENlJGAGlBJp7OQ":{"text":"We had looked forward to the Sunday Gospel Brunch. We had excellent seats (all seats are g","useful":0,"cool":0},"7HPpNVDPysq-D_bK_wsLrg":{"text":"Good spot for a break if you're near it.  If you get a chance to be there on a night that ","useful":0,"cool":0},"wmjFIETjliX0FjNT-HR8aA":{"text":"Great atmosphere from the street into and including the decor of the restaurant. It has th","useful":0,"cool":0},"dCOTyYuxm9_a0oTInvL9MQ":{"text":"We were here for a special event and at first i was let down by the place, but once i star","useful":2,"cool":0},"J763B0EtCIELnNaD48e7SA":{"text":"Food & service ok.  I bought a collared shirt from the gift shop (paid full price cash) fo","useful":0,"cool":0},"1ciTHe-ug98ChcQxOgZRng":{"text":"What a perfect place for an event! Kari and Beth Ann were without a doubt top notch in pla","useful":0,"cool":0},"x45DFj9UdJ4yWgPH5-KTzQ":{"text":"Been to many concerts.  Love the venue. My gf and I went to the American Aquarium concert ","useful":0,"cool":0},"VUUWyhqnxB4Opa-rH4spFg":{"text":"Went to go see Will Vance and the Kinfolk play. The show was amazing. We were hungry in be","useful":0,"cool":0},"PVriLwjP80RD_e13NBAuKA":{"text":"Great food and weight staff! We ordered the shrimp Po-boy and voodoo shrimp! Excellent dis","useful":0,"cool":0},"GkCGh-wtWrpsounpdRDr-g":{"text":"My friends and I had had a string of bad services in NOLA during our trip. On our last nig","useful":0,"cool":0},"qiiJmf1OXHZKiEMWDC8juA":{"text":"About time to update my review. I still enjoy the concert space. The drinks aren't the che","useful":6,"cool":6},"sOThBlpePeH6wlcP1WcrjA":{"text":"This review is for the gospel brunch only. \n\nAtmosphere: fun,lively snd pretty atmosphere.","useful":4,"cool":0},"hqrPw8iSlso_FglMfwzTNw":{"text":"Overbooked..the music was good but couldn't see it. The VIP area is a joke. It's close to ","useful":0,"cool":0},"BdU9BGPsGoWq5sZlPlH_kQ":{"text":"My family and I enjoyed the food as well as the decorations on the inside. However,  it wa","useful":0,"cool":0},"wy1GpfF79No6qFWF3vpWxw":{"text":"1st time visitor to New Orleans and I had no idea where to go. House of Blues came highly ","useful":0,"cool":0},"j5BQCQ3Q1wF7wWNbvyDYZQ":{"text":"My mom and I had fun at the Sunday Gospel Brunch.   The food was awesome there was a so mu","useful":1,"cool":0},"4eqftTLOBwRqsy26yCVYrg":{"text":"Sooooooooo pissed. I was with a large group of people who were scheduled to show up at 9:3","useful":0,"cool":0},"aCvce6xtSyxV4fhfFCBM0A":{"text":"We came here for a late lunch and it was horrible. The server was all over the place, he w","useful":0,"cool":0},"_Jnl0rt8I9IhN7wp8n6JiA":{"text":"Nice atmosphere but wasn't really into the selection of food. I did enjoy the red based Ja","useful":0,"cool":0},"cSYHsOaGSIsm04i1o4E-5Q":{"text":"Food was good, music great. Hostess was terrible and would not let us sit by another famil","useful":0,"cool":0},"S1tZE63Kv53bjTkTMEAy5A":{"text":"We went at 2 pm on Monday afternoon, so the restaurant was understandably empty. \n\nWe star","useful":0,"cool":0},"M83uUof5yEgZZW7ZK24zkA":{"text":"Ive found myself in this place twice... once because I met Gwar at the Abbey and they out ","useful":0,"cool":0},"H4a9eXI93fRKpkDA9YxOSA":{"text":"Billy Idol show, 2015! Enough said! :-D","useful":1,"cool":1},"ThMwzET0DsKLHdXRxshwLQ":{"text":"i'm torn with this review. because the restaurant food is just not what anyone wants to ea","useful":0,"cool":0},"fpTzoffmQZjikOt-ThOnJQ":{"text":"Having been contacted by the manager I have found out that it is a simple mistake to charg","useful":0,"cool":0},"Tk6VSuK45Al2oZxCq-oTUA":{"text":"We stopped here for lunch.  It was not busy and service was SLOW. Food was lukewarm and th","useful":0,"cool":0},"GwVF4K9SbnXw87mGdW3zLA":{"text":"This review is for the music venue.\n\nAs one of the only \"big\" music venues in the city, ne","useful":3,"cool":1},"SkSEPx4eVgGaRTA7Xx3_Rg":{"text":"We decided to eat here before a show on March 5 because we purchased \"pass the line\" ticke","useful":0,"cool":0},"yTOSTMTUOZCxJWj7qkvWxA":{"text":"Very disappointed with our experience here. We came here for dinner on our last night in t","useful":0,"cool":0},"FKzeYR_3B4UgRyTHYIKHbA":{"text":"Food:\nLobster mac and cheese!\nVoodoo shrimp!\nTater tot appetizer !\nAnd of course the meat ","useful":0,"cool":0},"MY1LG4fJII_THHOx7cemlA":{"text":"Atmosphere was really good. Loved the music. Had me rocking while eating! Kris Russ our wa","useful":0,"cool":0},"lJ2rVek8FDeSqgiEfNXRWg":{"text":"get the house salad, the pecans were fabulous, sweet and spicy all in one. I had the lobst","useful":0,"cool":0},"IQs6e_5LuHSvi9pidakWNA":{"text":"The House of Blues is a great place for intimate concerts and events. Typically the concer","useful":2,"cool":0},"IGDf_mHRjclTcHcpISkAHw":{"text":"The 1 star goes to the initial customer service experience, however food and subsequent se","useful":1,"cool":0},"znAeCWZHqq_pw8rn9hkLZg":{"text":"Friday night crawfish boil is the place to be! $10 for 2 lbs, drink specials and live musi","useful":1,"cool":0},"Z1Y9a_6Jt4ec_nMumA4WEQ":{"text":"Caught a very random show here during one of my trips to New Orleans.  Wasn't too excited ","useful":0,"cool":0},"MUx46VG-_YqjnA0T8bcp5w":{"text":"*Review for concert experience.\n\nAs with many HOB locations, this venue didn't disappoint.","useful":0,"cool":0},"s9kdOOJtbCqZ3B8H_mc-MA":{"text":"The service here started out very badly. The manager came by our table though and immediat","useful":1,"cool":0},"ZVqJ80_FbyTsYyuPbKN3Jg":{"text":"Two Second Review - We came her for a company event - so all I can really comment on is th","useful":0,"cool":0},"4N0u0FNUnFAE3fWZsDrT1Q":{"text":"We enjoyed a meal, beers and some music here on a Wed night.  Very very good service.  Ste","useful":0,"cool":0},"R4ONxYRvGT6jEnJtpgvfHw":{"text":"We were in the restaurant during the BCS game...Presley was our waitress, she's fantastic.","useful":1,"cool":0},"G1udXE_9tY4a60dy3vFMSg":{"text":"Saw GWAR here back in '03 and got sprayed with fake blood and vomit while exiting the men'","useful":1,"cool":3},"dwNw70A0TAuGnwpaPntpNQ":{"text":"This is not a review or rating of the food, since we never got to eat.\n\nWe have eaten at s","useful":1,"cool":0},"Pi9KRQ0yZCGeaF9yukDk4g":{"text":"I ate here prior to a concert at the House of Blues, so it was convenient to be close to t","useful":0,"cool":0},"GSavVJ8r2hcGwAyRbQwS2Q":{"text":"I can't say enough about how easy Kari and Beth Ann made our wedding planning experience f","useful":0,"cool":0},"5FXhYMwVgRK0YGjso4K03A":{"text":"Came here with a school group for gospel brunch during FQF. Linda wright and the band had ","useful":0,"cool":0},"WhFhmo7LqavgsGcdzMo7eQ":{"text":"Really cool spot. The food is good, but you don't come here for that unless you're a membe","useful":1,"cool":0},"qzfAMGAqI9Ibdwwsf31w0A":{"text":"We stopped in to have a quick bite and drinks. The drinks were over priced! The  food took","useful":0,"cool":0},"oGafo0IUr_52Big13BRwbQ":{"text":"Pretty much the same as every other HoB I've ever been to, but this isn't a bad thing. The","useful":0,"cool":0},"4GVLr6hiYT4pkYtkBEwPaw":{"text":"food is overrated and over priced.  I had the shrimp and grits and I have had better.  Not","useful":0,"cool":0},"S7yB0uDIu7PF_RsL89g2_w":{"text":"I started off with an order of wings and Voodoo Shrimp. The Voodoo Shrimp is served on a s","useful":1,"cool":0},"eRt37vpygCJpSvViNDdg3Q":{"text":"I've been to dozens of show here, some better than others, but overall, the HoB gets some ","useful":0,"cool":0},"EWPtbJxBZOILsjAqqWj0iQ":{"text":"Food was good but not great due to being bland. Service was excellent and the atmosphere i","useful":0,"cool":0},"t-dnNaX8dzcIWSDTvlPg5Q":{"text":"@HOBnola I thought I might be in for a bad experience but your bartenders Thomas & Michael","useful":2,"cool":1},"kuDgpPFy4S2Yxk4-EEssuA":{"text":"Very relaxing atmosphere! The service is Great, our server Lexie was spot on! The voodoo s","useful":0,"cool":0},"IGWTYl_UIBgS_A7qbAq4SQ":{"text":"I was in town for New Years 12/30/13, stopped in before noon had some drinks ans got a tou","useful":0,"cool":0},"PtVRyeUb-P2DFBIE4brC0Q":{"text":"I bought a gift certificate for this place, and thought I'd show some support, since I hav","useful":1,"cool":0},"qvZvckCGM5Y4yAY6quAuDg":{"text":"Restaurant and Concert\n\n We were attracted here because Dr. John was playing in concert on","useful":0,"cool":0},"q_4FwSYGhTgBZfDqfhfdig":{"text":"New Orleans and music go together like peas and carrots (even though I hate peas, but that","useful":0,"cool":0},"jdcqSvY0eSgRk2yLJ7D4RQ":{"text":"Okay this review is for the food. Music acts at the venue are amazing and 5 stars. But aft","useful":0,"cool":0},"NA3v7QFg_YsD5MMjPmpQ9g":{"text":"I had low expectations for the HOB, figured it'd be a tourist trap.  but I'd read about an","useful":0,"cool":0},"WD6HxmHPnnoymjLO2LDmFw":{"text":"The crawfish here are outstanding and so are the voo doo shrimp.  We also had the juicy lu","useful":0,"cool":0},"C8MM3Ho9CO_hGSOEUouXgg":{"text":"Could be so much better. I've seen a couple shows here. Both times it's been really frustr","useful":0,"cool":0},"oDcr7URzZdIM-Hqvy5cf5Q":{"text":"Great venue! Went to a Friday night show for Lights, with opening acts by The Mowgli's and","useful":1,"cool":1},"evDI9Awl9rH92YCWUyNRiQ":{"text":"I came here for two events while in NOLA.  It is a nice size venue with two levels in the ","useful":0,"cool":0},"GGdcXyH5pturSwYngwsBqA":{"text":"I didnt get a real sense of new Orleans style food. Customer service was good though!","useful":0,"cool":0},"PUs8W7gBJZykQwodXP5q3A":{"text":"I went Friday night to the throwback music thing and had a blast. The bartender was AWESOM","useful":0,"cool":0},"KN4xlcTSdxOWOEltFn90yQ":{"text":"I was on holiday and traveling with a childhood friend as he toured through the south and ","useful":0,"cool":0},"LYSyVtT-WjB3BCmcjaS0LQ":{"text":"Food is delicious. \nThe night I went music left a lot to be desired especially for a Frida","useful":0,"cool":0},"jjajyCJfQaqu0T9DC2o84w":{"text":"If your band isn't big enough to fill one of the city's arenas you'll most likely wind up ","useful":2,"cool":0},"thI8boAZykNatpIzCP0PiA":{"text":"We were sitting in the Voodoo Garden no idea why they had no Tito's vodka nor Stella so ev","useful":0,"cool":0},"ZHlPcbwiQd1bGVVrk3CdcQ":{"text":"Stopped in for drinks and to catch some live music. There was a duo playing of course, the","useful":0,"cool":1},"rn_CGHgx7CuiX_Vp4x8F1A":{"text":"We went for a concert and it was pretty packed, it is exactly like you would expect from a","useful":0,"cool":0},"AgHzt-nCw7t0dwPrWgP4Zg":{"text":"Love the environment! Service was good! I had the cheese trio rigatoni which I thought was","useful":0,"cool":0},"ZJAaqHdq16dTJz1jlf2F3A":{"text":"Popped in for lunch. Super comfortable. Great atmosphere. Music playing was awesome. Food ","useful":2,"cool":0},"HNoeu5NaR5Oc-1ypX9B2iA":{"text":"He original! Opened by ghost buster Dan Aycroyd. Amazing place! So much history of rock n'","useful":0,"cool":0},"ymEHwPq09pn_8-L1WgapOw":{"text":"We were at the Voodoo Bar in the back of House of Blues, and it was awesome.  It is part o","useful":1,"cool":1},"hLGXafmBLqlJDlfCtia6Mw":{"text":"Friday night crawfish boil is the place to be! $10 for 2 lbs, drink specials and live musi","useful":1,"cool":0},"J0PTTC8wi1Lkf04RzcelcA":{"text":"Absolutely enjoyed the Shrimp and Grit, however, everything else was a disappointment, the","useful":0,"cool":0},"vnaeXFxFGnPlvvnQBKrLRA":{"text":"Came here for dinner on a busy night in New Orleans. We were sat down right away at a cool","useful":1,"cool":1},"_WswdAHwfGGvZI60wtHs8w":{"text":"I enjoyed this place. It's like a little hidden old Nola bar/juke joint set up behind the ","useful":1,"cool":0},"3eq7rdXl2zTMWgTbUEZN9g":{"text":"House of Blues New Orleans is a nice, intimate venue.  I've seen 3 concerts here and enjoy","useful":0,"cool":0},"XQfjFr46fSAC04R-IVGb4w":{"text":"Awful sound quality, but we should have known better after a very disappointing show a num","useful":0,"cool":0},"wX98OP1G2XD9Bw1KNi2_kg":{"text":"Excellent, intimate venue.  Great sound quality the times I've been there.  Can't wait to ","useful":0,"cool":0},"Q-6dTIqK9Ht6sNtG5slgpA":{"text":"Great venue for live music, not so great for food and drinks. You might want to grab a bit","useful":0,"cool":0},"4dxwjP1qK9TQR2_APCHz3A":{"text":"This review is for the Sunday Gospel Brunch only.\n\nBy the time you tack on all the fees on","useful":4,"cool":2},"4Ozhyed5L7Hf9L6XH-nsvA":{"text":"They brought in a jazz band which was excellent. The food was also great.  There were many","useful":1,"cool":0},"9Nl69faumr99Oq0H5kj5Ew":{"text":"Awesome music and atmosphere. We on New Year's Eve and stayed for the new year with bourbo","useful":0,"cool":0},"Uw4ROZ0a-8Q_bP0C-XlWng":{"text":"New Orleans is an amazing town.  House of Blues is, in general, a really great venue and I","useful":3,"cool":0},"KjPIrxEwfWOFCgsaZXVNeA":{"text":"It was alright, our hotel gave us free tickets but there weren't that many people there an","useful":0,"cool":0},"oyACZ6FuumqHiDHVUkVb0A":{"text":"While I cannot give a review of the food or drinks, I can give 5 stars to the staff.\n\nCame","useful":1,"cool":0},"4y_oMZQNQlOoRWD4jO__vA":{"text":"Good place for a show - interesting decor, fun, reasonably clean. I always like the authen","useful":0,"cool":0},"CL4UOHyV0Sb3tnaq9Y_eqw":{"text":"On est arrivé dans ce restaurant par hasard, plutôt une bonne surprise pour le cadre, la s","useful":0,"cool":0},"Y4qjb5B73pa_002YE88zOA":{"text":"The House of Blues is a great small venue - the acoustics at the main stage are excellent,","useful":0,"cool":0},"WTynwcgd0-GkZpF4wXxlKQ":{"text":"The House of Blues has lost a little something with me. It used to be a great place to see","useful":2,"cool":1},"AVg_5kpnwS8UHvjzGdNmcg":{"text":"Love this HOB.  It's the first one I ever visited....and still my favorite.  The entrance ","useful":1,"cool":0},"yobiShmfyrE-hQX9GlsTVQ":{"text":"Came here for dinner on Halloween night. Surprisingly, there was no wait and no crowd. I h","useful":0,"cool":0},"eL3VvaB9F0g9LtP5xcLE5A":{"text":"Sat at the bar and had drinks and appetizers before a concert. The two female bartenders w","useful":1,"cool":0},"cXoALCkFhpXPH0zVHu0J2A":{"text":"Saw Ghostland Observatory, they're awesome.  The crowd had a great vibe and everyone we me","useful":0,"cool":0},"Sn7w8VDSHbEXANJvHEdv_w":{"text":"I can't express how much I was disappointed in this venue and their service. Bartenders we","useful":0,"cool":0},"ESibHbT0M_c_b8zT2gOrdQ":{"text":"As always, HOB never fails. Great location, and the food is the standard corporate fare. S","useful":0,"cool":0},"DvVSHq33i9pvHXO3wjKTmw":{"text":"This is my favorite place in Town! \nThe place temperature and ambiance is perfect, food an","useful":0,"cool":0},"2ERFShV7ltYHEYaeQfrMow":{"text":"Lovely, intimate setting. The atmosphere was very relaxed. The live music was definitely a","useful":0,"cool":0},"PfN7XnY1b8txCTqB3Ist0A":{"text":"After landing at around 5pm on Sunday, a supplier was having a happy hour here.  We arrive","useful":1,"cool":0},"H3poLsqSi-SJgUh8zthcTg":{"text":"Mother's Day lunch with the ladies...I have Derek to thank for a good experience and great","useful":0,"cool":0},"tdMQlH-gBI7M87FeA99BkA":{"text":"This is a review of only the restaurant, and it was very disappointing.\n\nOverall most of t","useful":2,"cool":0},"9KSxa8nGjBuCXle3T0K-2Q":{"text":"I love seeing a show at the House of Blues.\n\nI have seen a few bands here, but what I have","useful":4,"cool":4},"Dgtv8Dlvoad86TK5PuLmtQ":{"text":"My work rented out this whole venue for our trip to LA, we had a fantastic time, the food ","useful":0,"cool":1},"-Hnh1vZ0O1VGeqSgbWrxJw":{"text":"We were there for a special event and really enjoyed the food and music. Sadly, we couldn'","useful":0,"cool":0},"sI4y6OBXgxPakg6eBCQLlg":{"text":"As a place to see music, the layout and sound are good. I especially like it when there's ","useful":1,"cool":0},"nDmd-E6zLgmqX79X3H77gQ":{"text":"I ordered the island turkey burger. It was on the small side but very tasty. The Mac and c","useful":1,"cool":0},"hT_sfDseFxZ56fNByCJEoA":{"text":"Not sure how we got lured into here as we were heading to Deanie's for some BBQ shrimp.  W","useful":2,"cool":2},"sfjAjH3G-Od2WgNJPMXJFg":{"text":"I enjoy coming to House of Blues when I'm in NOLA so much!! My first time being for a conc","useful":1,"cool":1},"IWENQNYiP5_MdE53wi53wA":{"text":"Customer service was excellent but the food wasn't all that great. I ordered seafood gumbo","useful":0,"cool":0},"0cSu67p8RtibBNT6yFlRDQ":{"text":"Great private party at HOB last week. The food was fantastic and Timothy James group playe","useful":0,"cool":0},"JEyPNT0sjx5ZzB517Hcumg":{"text":"Best bloody mary anywhere, they serve it up with peppered salt rimmed glasses, premium vod","useful":0,"cool":0},"jnNKQOqAmzjoLhzcsTi8tw":{"text":"I wish we lived in New Orleans, we'd come to Gospel Brunch each Sunday! We enjoyed fried c","useful":0,"cool":0},"KAtbMbIJIJO9Y09F40uhrA":{"text":"We ate at the HOB Crossroads outdoors patio in the back one evening.  Free outdoor music. ","useful":0,"cool":0},"y1U0dOV3WKhHV84rXp_l_A":{"text":"Went with another couple Friday night,1/22/16 for the Breaking Benjamin concert and had a ","useful":0,"cool":0},"7_OHVnjyulbPTGr_Lob-aQ":{"text":"Recently visited NOLA for a girls trip and had this in our itinerary. It was a great exper","useful":0,"cool":0},"GjOKFR68w2s8ZC8gvhpnwQ":{"text":"We're sitting there right now, having just been served a delicious mojito by the excellent","useful":0,"cool":0},"zAU1UHxNsawXKlZp4TGIvA":{"text":"We checked out \"Booker T. Jones\" at the intimate Parish of House of Blues. Cool door man, ","useful":0,"cool":0},"5iccGWrhWC9tZC3S0Tv7Yw":{"text":"Went there one evening during our honeymoon in 2005. They had a cute little gift shop with","useful":1,"cool":0},"yjcfWFjfnTsaM3Sjy6bAWA":{"text":"I think it was 1999 or 2000 when I was here.  \n\nI remember the venue being well decorated ","useful":0,"cool":0},"NZ-rBg4ZamJAm3CdK5aSsA":{"text":"well, The best part for me regarding this Venue is as follows :\n\n1) introduces up and comi","useful":0,"cool":0},"a_inYVzVgN5K9dxGdctGAA":{"text":"Wait was long. Food was cold. Had to ask for napkins, silverware, and drinks. Cold tacos t","useful":0,"cool":0},"RXR3cacDRVbbxyyBWXshxg":{"text":"If this was new bread, then your executive chef did me the honor of mirroring my initial b","useful":0,"cool":0},"K-Z7FpGqL2hUskiCnO1Eew":{"text":"Years ago I  lived in New Orleans and occasionally enjoyed the soul food menu at HOB. The ","useful":0,"cool":0},"wzidut-_87uiK09aDGommA":{"text":"Came for mcLyte DaBrat and left at 1:35am still no show. No body has tine for that. Poor s","useful":0,"cool":0},"yP4lwA-cNhWdszJxKvzV_Q":{"text":"I love House of Blues as both a local restaurant/bar and as a music venue! The staff at HO","useful":0,"cool":0},"libiTjPhS31_K6Fw9WxmAg":{"text":"This place is awesome! The Mac & Cheese was on point. Everything was delicious and our wai","useful":0,"cool":0},"j8l6ZA_OyKpUVu4WejPZJQ":{"text":"First experience of New Orleans food and wasn't disappointed. The jambalaya was brilliant.","useful":0,"cool":0},"M9WH3J5_GFDeP49i9I09qA":{"text":"I like the HOB; I don't love the HOB.  In a corporate world this business fits the mold ju","useful":0,"cool":0},"PybgZEwUYuklj1yHSK6CDg":{"text":"What a let down and a TURN DOWN! House of Blues robbed us!!! Paid $82 to see First Ladies ","useful":0,"cool":0},"_X-5w-U2TCBqGvS4t2bAjA":{"text":"The food is not the best but the atmosphere & service makes up for it.  We wanted to just ","useful":0,"cool":0},"M8ti3oEpIL1LO8lKRtZUTQ":{"text":"Last stop on our New Orleans trip and honestly it should have been our first. Great servic","useful":0,"cool":0},"4Vy1Nf_meBUYOBvERxMUbw":{"text":"Sierra was AWESOME! She was friendly and thorough. She took care of us and made our visit ","useful":0,"cool":0},"tDxvCMtNAhvPgSK9YECDSg":{"text":"What a great intimate venue to see your favorite artist/band.  The theater had a great vib","useful":1,"cool":0},"EYWfIiU1pIDB6fgusbhzyg":{"text":"HOB NOLA is the best! I've seen some of the best shows here, and they have great food, too","useful":0,"cool":0},"ZPyVHGuj8vmAVT3HZVr67g":{"text":"We came here to see a local hip hop performance but left very disappointed. The show was s","useful":0,"cool":0},"abYi3itnz4XOru_4sehVtg":{"text":"Great place for a show, private parties even better. Enjoyed my first slice (or four) of K","useful":0,"cool":0},"7bTnQWrUj1eKRpTOsl48KA":{"text":"Came here for the music and beer festival 'Brewsiana' and it exceeded my expectations. Had","useful":0,"cool":0},"nnjReCfhkYQa55P9QtOrzw":{"text":"The food was excellent and our waitress was awesome.  The food was a little pricey, but th","useful":0,"cool":0},"vrjW5e2InWAuC9OeEzVDcw":{"text":"Saw my first show at this HoB location.  Easy to find, had the restaurant attached (did no","useful":0,"cool":0},"8xSUsSABzHUwt0R4HzoXrQ":{"text":"New Orleans Birthday Trip = Music in the French Quarter\n\nSo this here, this back in an all","useful":2,"cool":1},"wGQJyUD36G3HaQJGuCIk5Q":{"text":"The photos on their website looked fancier inside and the food looked fancier too. But, th","useful":0,"cool":0},"-sNo9K-esBaG1QIDrokGTg":{"text":"An initial confusion resolved by the awesome employee and manager, thanks for being so acc","useful":0,"cool":0},"3tMYA_AllurF2QfMdJR3cg":{"text":"Coolest HOB in the US. Always a stop for us when we go to the Quarter!!\n\nSundays brunch ar","useful":1,"cool":0},"dTpsF73fTicC0nFYRVV-ew":{"text":"My wife and I went to the Gospel Brunch today. Very irritating that they sell tickets onli","useful":1,"cool":0},"MLMem347Pyy3uzdUFhoBnQ":{"text":"I'm sure the music here is great but the food is so so. I had the jambalaya, which tasted ","useful":0,"cool":0},"GtBxISWx4KReVZ-M2kJwiA":{"text":"I personally would never go back there. I feel the food is overpriced and not up to par fo","useful":0,"cool":0},"xtRb1ufxssT4efcXUaI6Mg":{"text":"This place is so cool! It's an awesome place to chill out with friends and have drinks. Ni","useful":0,"cool":0},"9Bo5Tqzd8QCMgTSo801eWg":{"text":"Had the jumbalaya, it was quite tasty.   Atmosphere is fantastic.   Live blues was fantast","useful":0,"cool":0},"v3aQusdp-9r244S73aJqfQ":{"text":"Had lunch there today.  I ordered the voodoo shrimp it was absolutely amazing!!  Would hig","useful":0,"cool":0},"rT0fzv5U9d-L7z8fyzgQvg":{"text":"Only had drinks there because the hours were spotty.  Showed up twice when the club/restau","useful":0,"cool":0},"KMuOl87pByaORdE6LTcnMA":{"text":"The dessert was ridiculously awesome. We had the bread pudding. \n\nCaitlin was our waitress","useful":0,"cool":0},"B9K_1VjfqoTR1oVlN89lMQ":{"text":"First time here on Sunday, such a cool place!  We came for the Chevelle show (re-living my","useful":0,"cool":1},"zAIyJkpWHB8NrOEXi95N9A":{"text":"This was a nice place to grab a bite to eat and see live music after watching Carrot Top l","useful":1,"cool":1},"i8JRQ9QG7xuYGvAOMVLUvw":{"text":"Kris is an amazing waiter! He knows whats good on the menu and has fun with the customers.","useful":0,"cool":0},"eCHdtEiYfDceRV1ahyGLMA":{"text":"Ate lunch. Server was very friendly as was the rest of the staff. Didn't see a show but lo","useful":1,"cool":0},"kglLYfGactxRqkFaLbBU3A":{"text":"Customer service was good, sat at the bar and watch a live brand play while we ordered foo","useful":0,"cool":0},"bqpBvyJs9WhBFI2t_rtXAw":{"text":"Ate lunch there and they have totally changed the Cobb Salad.  Used to be great but was a ","useful":0,"cool":0},"ICFxsKJUouUAddq07tEc_g":{"text":"Wow I really wanted to like this HOB, as I am a huge fan of the franchise, me being from C","useful":1,"cool":0},"msQaCy--2aSUa8PL7mEV3Q":{"text":"I know the House of Blues doesn't serve authentic southern food, but the food was pretty g","useful":1,"cool":2},"qVK6Ah57hjorEKStLSZNnQ":{"text":"DON'T BOTHER COMING HERE! THEY DO NOT KNOW HOW TO RUN A BUSINESS:(!!\nMy husband bought tic","useful":0,"cool":0},"9Uuw4fNUjkZu_IH0qn26vw":{"text":"While visiting NOLA we heard it was a party here so, we decided to check out NOLA's HOB. I","useful":0,"cool":0},"D-jqfrBtityRjunax19UMQ":{"text":"Came here on a Sunday evening early 530ish. There was hardly anyone in the place. Maybe 2-","useful":0,"cool":0},"Rxb7P0uDF8SCMhnsIEir_Q":{"text":"House of Blands. Disclaimer: I was here for a packed vendor event. The food? Eh. The drink","useful":0,"cool":0},"xW8gUtvAr8ZBEjZC3hfWAA":{"text":"We had a great time at this restaurant! The waitress was friendly. The food was tasty. My ","useful":0,"cool":0},"Gw5i0b6hNpd6BT2qmUTTwQ":{"text":"When I'm NOLA this place is a must, they have so much to offer everyday.  It's so colorful","useful":7,"cool":5},"yXl5__nkGFwnLRGn4AArHg":{"text":"i don't like house of blues. but went there on a whim, bc i was reallllly hungry. \n\nthis l","useful":0,"cool":0},"VOCLEgK763CnehXaHcKl6Q":{"text":"Really good menu and an even better music venue. The time we had gone the menu had just ch","useful":1,"cool":1},"I_8HQUnMlnlArzrBeDFVuw":{"text":"Great food,great music, and our greeter Mandi was the best! We saw a band called Bricks in","useful":0,"cool":0},"GSrYrmUgrnCDWkJIlqHKcA":{"text":"Food was good but not great due to being bland. Service was excellent and the atmosphere i","useful":0,"cool":0},"VgHP86omF0qTsCDxt0rK5A":{"text":"I am a NOLA local and used to come here more often, but have seen the food and the service","useful":0,"cool":0},"XkhhXReVjnfGb6BsAbuCEQ":{"text":"Visited House of Blues during Essence '14. Acts did not show up for performances. After se","useful":0,"cool":1},"LD3qqE--bdN54GAEp5Q8uw":{"text":"I have visited this venue three times for entertainment. The first occasion was many years","useful":0,"cool":0},"4HCyPXIpy5dQIXXsISiT0Q":{"text":"I went to a couple after parties for an event I was attending on Friday and Saturday, with","useful":0,"cool":0},"ckTBZaAmVE2QGfpLSaDcHg":{"text":"Definitely a corporate restaurant. The first round of drinks (Wild Child and Watermelon Sm","useful":0,"cool":0},"47C7UbVCijbVJbSqmjEBFA":{"text":"Simply. fucking. awful.  I love HOB as a venue, but don't eat here.  Especially the french","useful":0,"cool":0},"Esc5Mbrn9V5XoxsdZtUmFg":{"text":"Cool little place to grab dinner and drinks before a show.  The restaurant's bar staff is ","useful":0,"cool":0},"19R8lk2n00cNycdJcKKuqA":{"text":"Ratings: Vibe-10 Staff-10 Sound-10 Drifters-10\n\nI swear that the pair of drifters who ente","useful":0,"cool":0},"TqA7ri8u_a9tcqoUCb_JrQ":{"text":"I've been to this HOB many times for various concerts and dinner so thought I'd officially","useful":1,"cool":1},"hFXF34S9VaM-gDiHemvzPA":{"text":"The reservation started off rocky because the hostest made a big deal out of me wanting to","useful":0,"cool":0},"34_o_Yy4QxM7RWNZu-X8HQ":{"text":"Wish I could split the amount of stars. The ambience I would give 5 stars. Great place to ","useful":0,"cool":0},"bgCjdxoQb5R1BAxfnlqIWg":{"text":"We came here the other night and liked it so much  we came here again for our last night i","useful":2,"cool":1},"GJSDnyuXBxDWImH8z8xhUA":{"text":"Pretty sad to be the only people in the restaurant/bar and the wait staff forget about you","useful":0,"cool":0},"-GCmuDSdNhy9VZXpuudDug":{"text":"Last stop on our New Orleans trip and honestly it should have been our first. Great servic","useful":0,"cool":0},"QVRGUsl0nm23DzlnfIPs8g":{"text":"Had a wonderful time! Great happy hour prices and options. Our bartender Mel was amazing a","useful":0,"cool":0},"IvjW91OFjb7BhFx-qbZw2A":{"text":"So, House of Blues(HOB) vs the Endless Night event they hosted. I think the two are two dr","useful":1,"cool":1},"uNHzkERsUE7KtssHbVBYVw":{"text":"Went here for the Sunday Gospel Bruch and had a hallelujah good time. There was plenty of ","useful":0,"cool":1},"4mox1pN6sbYWFcH1xo1Ftg":{"text":"Horrible experience!! Be warn!! It's a money pit. Came to see MCLyte, daBrat, YoYo...ladie","useful":0,"cool":0},"QTPjy3n9JtSlR7wEh1l_iA":{"text":"Out of all the amazing places to eat in the NOLA, we choose HOB because it had options for","useful":1,"cool":0},"E4L9vee3AWUmvnXYzSLVNw":{"text":"Great restaurant, the food was awesome and the customer service was off the chain, Sidney ","useful":1,"cool":0},"IAw95MwltuUzZ-k1oQIP2A":{"text":"The food, waiter and wait time was awesome! The venue also is really nice. We had the taco","useful":0,"cool":0},"jPP5r-07s1Opwo6mYQjJlQ":{"text":"THIS IS A REVIEW TO READ IF YOU ARE PLANNING AN EVENT OR LOOKING TO HOLD A PARTY AT THE HO","useful":0,"cool":0},"l6svFiMno6U5hE2r4-YhuA":{"text":"Was here for a wedding, and the back courtyard venue couldn't have been better. It was an ","useful":0,"cool":1},"8n-SyEmuzgw1dU-h4Y9j4g":{"text":"The first words out of your mouth should be \"we'll start with the maple butter cornbread\".","useful":1,"cool":0},"29QLrTQPnWj4UzzuyuZK6w":{"text":"Just like the House of Blues in Chicago, you can't go wrong.  \n\nGreat place to see a show-","useful":1,"cool":1},"ihcElGKiWWsd7F3jnCClUw":{"text":"Thanks for the tip. We did stop by for the local blues on Monday after a cruise on the Nat","useful":0,"cool":0},"JLlyNCMPeh3PbZHnTKoBbA":{"text":"Excellent restaurant pick for a group! Our server Chris gets 5 stars! Great service and ma","useful":0,"cool":0},"yL9du1VVaCteZpr6pXc4KQ":{"text":"I did did like foods and drinks i will not never go back there again and i do not want any","useful":0,"cool":0},"VdATG76UBFSfnkbnKEXQiA":{"text":"Went to house of blues for a 90's music tribute. We waited outside in the heat and humidit","useful":0,"cool":0},"IH90YHuqelusDHBY4YdKTw":{"text":"I've been to this location, and it's OK.  But the absurd fees House of Blues tacks on to t","useful":1,"cool":0},"DPWz_64mNaxPOSAorCcEPA":{"text":"Still a good place to hear a band, but the food is sort of meh. Don't expect well executed","useful":4,"cool":3},"YsjJ526TDG4B5zhT3BZ0pw":{"text":"I wasn't going to leave this review, but I think it's an important issue that should be ad","useful":0,"cool":0},"cAxAPBkjarrCOJ1_0R79oA":{"text":"Much love to Mr. Dwight and all the old schoolers still keeping it together! In the spirit","useful":0,"cool":0},"CctRb491xVfE3MsTbF1yLg":{"text":"My family and I came for the gospel brunch and we had an amazing time! I am from NOLA, and","useful":2,"cool":0},"hXLDcgEbA2UmRVyyTw8JeQ":{"text":"Most people think of the HOB as a place to catch a show, but its also a cool place to eat.","useful":1,"cool":0},"-t54hxpTv1hhqZp5bswnmw":{"text":"Although a previous experience at this location was unsatisfactory, management took it upo","useful":0,"cool":0},"EhaJnfqqByG1VPDbRk2fzw":{"text":"I've eaten at the House of Blues in Chicago and then in New Orleans.  They serve really go","useful":0,"cool":0},"x3DdrvCa85n8Y_Ho8yFIgw":{"text":"Went to the Gospel Brunch this am. The food was excellent, as was the service. Bottomless ","useful":0,"cool":0},"Ue9FopiScUhW_FKAbvioyA":{"text":"I went to the House of Blues recently for Ziggy Marley concert. I got there early enough I","useful":10,"cool":7},"YqSc3VWd2HhXtodWd799LQ":{"text":"Ate here with my girlfriend tonight. We should have known something was wrong when we walk","useful":3,"cool":1},"UMj022_d7vXFtCSs5q1SMA":{"text":"Food was average, but the service and atmosphere were great! Enjoyable dining experience w","useful":0,"cool":0},"4lfhXCMqi85D5JjgAMHV9g":{"text":"We went for Gospel Brunch. It was incredible. The food was great, AND bottomless mimosas!!","useful":0,"cool":0},"2BPLWkWm_bzj4huXHKBqJg":{"text":"I went here a few times in the late 90's for Gospel Sunday Brunch and a Galactic show or t","useful":0,"cool":0},"wODsr75VoqyW9NR6li9qqA":{"text":"The company I work for holds a VIP pass to the foundation room - when we traveled to New O","useful":0,"cool":0},"8-sV4tjOGL_ipYTEBXVU0g":{"text":"The food was great, the service was awesome, and the drinks were yummy  I was so Happy we ","useful":0,"cool":0},"fHYWnBH6oZHxSWGcf-mDig":{"text":"Can't speak to the food but strong drinks, friendly and efficient bartenders, and the staf","useful":1,"cool":0},"l15wn4_QkbtpI0CJuTLOFA":{"text":"This is where most of the bands I want to see end up playing, so I usually have no alterna","useful":8,"cool":1},"t5BmPeKgmpHD544dwq3Deg":{"text":"The food is not bad and the atmosphere is great here.  They often have national acts here,","useful":0,"cool":0},"mscC1jdMpDaLHYUYZCp8zw":{"text":"My husband and I came in from Napa California- our server was Erika and we visited house o","useful":0,"cool":0},"XajL7cnbxD0t9FjNm34Xvw":{"text":"HOB is a horrible institution. Their beers are over priced and hot. Their shows are overso","useful":0,"cool":0},"GI3TfHrPKiAg67AHmR2-gw":{"text":"I went to the House of Blues for the first time last night.  We were there to see Departur","useful":0,"cool":0},"lDvh-0XQ9PCbqbPsKycG5g":{"text":"House of blues, a mi consideración debe ser un spot en el area no solo el ambiente es buen","useful":0,"cool":0},"sFjE33hS34KJXCVyp7jTyg":{"text":"Great food, great service...Kali was wonderful....food was hot and we received it promptly","useful":0,"cool":0},"zkyY99aYNZQXv4HJ1RorFg":{"text":"Such a fun venue. We attended an event here (the concert was some kind of KISS band that p","useful":0,"cool":0},"7CDvcaPEpRjfePxkhixhXQ":{"text":"We stopped in early for a Bloody Mary as we do on every stop to NOLA. We can always find a","useful":1,"cool":1},"kmtWA4RLU1LysAUNPH7Srg":{"text":"Hi Erick - thanks for your comment! I think it's cool when owners/managers show that they'","useful":2,"cool":1},"kFhE9pJpF9YIE15amn73hw":{"text":"HOB hasn't changed much but that's a good thing. I got flashbacks of being 21 when I walke","useful":1,"cool":1},"Zntq3td1I1ZdAPnVvP1rxQ":{"text":"Good drinks, not so good mac&cheese. Overpriced, overcooked  macaroni & BLAND- no cheese f","useful":0,"cool":0},"4bynhWXe0iN0uwm2n2Iz_g":{"text":"Saw a concert there and the sound was fabulous.  I have to give a shout out to Mandi our V","useful":0,"cool":0},"1z4dLRUqmuLWo5FVcTpmjA":{"text":"Mikelle that is incorrect. We did not leave the building until 2:45 A.M. and no performer ","useful":0,"cool":0},"q4Jw_GJUEHVUWDwa0Utktw":{"text":"We bought \"pass the line\" vouchers for a show so we ate at the restaurant. The service was","useful":0,"cool":0},"o0dil1EScU1LmdIoC8LimA":{"text":"Great huge venue. We had a buffet style meal that had the most amazing cornbread. The soun","useful":1,"cool":0},"UXtIEtgpHDIlnKDjEfYPnA":{"text":"I'll say I did not get the blues when we stopped here. Sidney helped us out and recommende","useful":0,"cool":0},"1wtT2amm8DNcMOweDe4ybg":{"text":"HOB is great for shows and venues, there is a private room upstairs for small parties and ","useful":0,"cool":0},"rgBmw0eAEJvApWYVvKuxOA":{"text":"This was one of the places we had shit service! Our waiter did not seem to know much about","useful":1,"cool":0},"llyx7R7TuCnFQxr7ijYhlw":{"text":"Cool restaurant with a fun atmosphere and good food, but the service was lacking. Went in ","useful":1,"cool":0},"slxpG37OKbR9CF1EIfrueg":{"text":"Best fish tacos I've had in a long time! Came for a 311 day pre party and was just so plea","useful":0,"cool":0},"krIT0ZMu78Ww8jj-t5Bl9Q":{"text":"april is awesome.  best service ever.  lobster mac and cheese is a must. Raspberry mule wa","useful":0,"cool":0},"8Iw11NZrSIasA89S7eZCVQ":{"text":"Greet food and ambiance. Went in the late evening, right before close... It was kinda empt","useful":1,"cool":0},"lf-ta53H-bqtVdg4WB5VSg":{"text":"Wow. The House of Blues is turning 18 this year.\n\nI must preface this review by saying tha","useful":3,"cool":2},"NWA7llLcrINo_i_PV53g-w":{"text":"I really would like to avoid the FQ Disneyland atmosphere whenever possible, but I really ","useful":0,"cool":0},"c7xnVuYo8zATLKVdOyZr_A":{"text":"We came W Tuesday around 5pm on Happy Hour, no music, majority of places on the French Qua","useful":0,"cool":0},"lwAfNw5DYiCC73eISkoJKg":{"text":"We visited Crossroads after a long day of walking around and were starving. The food was a","useful":1,"cool":1},"JP779sm4P9-47sOXVD4p9g":{"text":"Amazing Gospel Brunch!\n\nMy boyfriend and I brought my mum here and it was the highlight of","useful":0,"cool":0},"GHG1N7CT-yQy3ly1GtBCPA":{"text":"The food was awful. I could barely choke down my shrimp tacos that had awful taste and tex","useful":0,"cool":0},"ipIiSBu-fenHsM2v_6Bhzw":{"text":"First time dining at HOB. Starr was an amazing server. Very enthusiastic & very accommodat","useful":0,"cool":0},"xag20qUdquj8ynn3Rcp19Q":{"text":"Cool venue.  Easy to find, easy to get in.  Lines not too bad.  Staff helpful.  Plenty of ","useful":0,"cool":0},"DXVWl8CTXVuV5WYg7U57WA":{"text":"Talk about an experience!! I truly enjoyed the entertainment, that for me substituted for ","useful":2,"cool":1},"973Nbjcxpz2DT2OLlopMGQ":{"text":"Do recommend. Drank my first order of a Sazerac here as New Orleans' offical drink. Live m","useful":0,"cool":0},"O3Z14BnLIo0crUdpdbvwwA":{"text":"They were not prepared at all for the mess tipper was about to unleash in NOLA. I stood in","useful":0,"cool":0},"_SZNawg2oEuWGNB-rf_iBw":{"text":"Went for a work party. Unlimited food that was superb. Never a shortage.  Live music was a","useful":0,"cool":0},"0ULhlG3LL6BbDEPMI6HFVA":{"text":"YES!!!\n\nAfter flying in from Boston for a solo week/end of R&R&D I decided to check out Je","useful":0,"cool":0},"EBYTEBHbPXso70SrzZXfYg":{"text":"Dinner started well but ended bad!! Appetizer was cornbread it was really good with a spic","useful":3,"cool":0},"mFhwOC_EkqWDtVtkTV1UGQ":{"text":"I was in town last week and came for a couple of shows. This is still my favorite venue in","useful":0,"cool":0},"2aTLtbZhczF0UptOqeYvHA":{"text":"Probably the worst meal I've ever had in New Orleans. \nAnd that says a lot, since I've had","useful":2,"cool":0},"I9W8vByn7bZY7jw__sxT_Q":{"text":"Kate was our server. She was attentive and went above and beyond to ensure our visit was a","useful":0,"cool":0},"ZtTB35orGEiUmUpjqKJmFA":{"text":"This is a must when visiting. Evangelist Linda and her band were fantastic.  The food was ","useful":1,"cool":0},"LA1O5kG8_gHUI6u_4mGaHw":{"text":"We came to the Sunday Gospel Brunch last week.  It was an exceptional morning.  The buffet","useful":0,"cool":0},"DkaHL0qjRpxBccezVDmenQ":{"text":"Technically, this is a pretty ballin' place to see a show, and despite the fact I've seen ","useful":2,"cool":0},"vbt0haVwPjUAub3g6gOmpQ":{"text":"When in New Orleans this is a must see. The voodoo shrimp is amazing. The pulled pork and ","useful":0,"cool":0},"WuONWsN2H4seDtBR6rxJPg":{"text":"Had a terrible experience. Too cold. Food was mediocre and overpriced (even for the French","useful":0,"cool":0},"E_SAuvaVmbiLgrK6btcUMA":{"text":"My girlfriend and I went to house of blues Sunday morning for Gospel Brunch and had an ext","useful":1,"cool":0},"f2t74Hfxot2btI0rU4g_dQ":{"text":"Great band! Idk their name but fun I got to dance with a wedding party and friends.  Cool ","useful":0,"cool":0},"rxoEWJnlsXW1fQyL8Jxv5g":{"text":"Best burgers every! Great service and the sweet potato waffle fries were outstanding   Liv","useful":0,"cool":0},"HIu7hPZCXsirtBttgiQKzw":{"text":"Absolutely HORRIBLE! I am the CEO of a National company and throw major workshops twice a ","useful":0,"cool":0},"dJujbjEBDTk06fo-CO6A1w":{"text":"I cannot say enough about the staff at the House of Blues.  We held our wedding here on Ap","useful":2,"cool":1},"kR0B5N3p24ivVllvovy_1g":{"text":"Chicken was outstanding, but the blackened chicken pasta wasn't that great! My husband lov","useful":0,"cool":0},"6sOydTALAX3cmGxYzLKYsg":{"text":"Gospel brunch was fun! Food was good. Typical brunch fare. Omelet was a bit dry. Love the ","useful":0,"cool":0},"oeGPgvm_iDC0hoffqffcPA":{"text":"Fun atmosphere and great funk band in the back for French quarter fest.   Food was edible,","useful":0,"cool":0},"vUFM0SVudLTwVv9LwOxYgQ":{"text":"I attended the Rumors Fleetwood Mac Tribute band last night. Unfortunately I had a full bl","useful":0,"cool":1},"xW3LAb0ajzfyxwGozfdwMQ":{"text":"Our first time in New Orleans and heard about this place. We made reservations but it is n","useful":0,"cool":0},"8lRfdbVowaEJvFTfxljp7g":{"text":"As a restaurant, I'd say pretty good.  I've had the gumbo here and it wasn't bad.  The art","useful":0,"cool":0},"6XNb3FgLGaEx0JZtYMC5iA":{"text":"April is my new favorite waitress in New Orleans! She's funny, sharp as hell, beautiful, a","useful":0,"cool":1},"1t6WuD3WvzcHCQ2Dd-8Ctg":{"text":"Worse \"security \". Going down side walk, half way past House of Blues & all of a sudden th","useful":0,"cool":0},"b5NTJjdV3Tai0dMm3Pi0SQ":{"text":"Had a awesome time last night at the seven dust show!! The place was amazing!! Best time I","useful":0,"cool":0},"la6kmnUhePGn5RlgvUNKgw":{"text":"Highlight of my trip was the Gospel Brunch!\n\nGreat music! Great for families! An amazing w","useful":0,"cool":1},"-gFoHqH4W9RulleRkPBbww":{"text":"April was a great waitress and catered to us very well.  We thoroughly enjoyed our visit a","useful":0,"cool":0},"FLnul1z0oLwB7ivNdsnMpQ":{"text":"Great atmosphere! Great date spot. Good food and drinks! And Disturbed for dessert!  Great","useful":0,"cool":0},"9q7YfEHRLwp9sOLQMjc90g":{"text":"No disclosure on drinks being 15 dollars in the specialty menu. They ran out of souvenir g","useful":1,"cool":0},"u5VKueovEjzq0IrTG7unQA":{"text":"What a fantastic and authentic experience at Crossroads House of Blues! Cheryl is an amazi","useful":0,"cool":0},"_AcGjQ4iTcHVb9Fs9PSijg":{"text":"Amazing time! Mandy and Angie are the best!!! Such a great time. Will def come back !!!","useful":0,"cool":0},"vDI06gPplynGDzIC1owHAw":{"text":"The DJ in the Foundation a Room was terrible.  Doesn't know how to mix new music with old ","useful":0,"cool":0},"yaFE_9Au8cxFUoGUJb6wpw":{"text":"Show was good.  We had steak worst steak I have had in 10 years. Waitress was awful. Maybe","useful":0,"cool":0},"U44WgULt83PwRkAOwFYV1A":{"text":"Crossroads at House of Blues is awesome and our server April was awesome as well. Definite","useful":0,"cool":0},"Y7FKrXilgCm8c3IlRKHDwA":{"text":"Celebrating New Year's Eve here. The food is not very exciting for $45 per person. Our res","useful":0,"cool":0},"fnO3l6SBVrdvwAMFpC1kbw":{"text":"Didn't expect much from this New Orleans tourist trap and still my expectations weren't lo","useful":2,"cool":0},"gzmhh6Bj0BIoLovTc0Girg":{"text":"Went here a couple of weeks back for a Christmas show. I dined at the restaurant before mo","useful":1,"cool":2},"EpbTzy6MCCYkYOp1Qzo45g":{"text":"NICKY AND FRANK ARE AMAZING SECURITY. They went above and beyond what they were supposed t","useful":0,"cool":0},"jqvLVSTwUUn4VrHdWINUAw":{"text":"Just came to the HOB to watch Cyndi Lauper. We ate here ahead of time so we can pass the l","useful":0,"cool":1},"Fmd2i8twdwQ6vk29SGQpCA":{"text":"Wonderful change of pace from most of the French Quarter restaurants. The food is deliciou","useful":0,"cool":0},"DfuC8zGX6_c3Fn0HFWHbdg":{"text":"SUNDAY GOSPEL BRUNCH! \nMy only times at HOB have been for the Gospel Brunch. It is a fabul","useful":4,"cool":1},"W9ZM_QWMeI5L4fSMw_-tgw":{"text":"Great folk art and decor; friendly staff; SLOW service and food delivery; but the food its","useful":0,"cool":1},"n6wCe5S_vKOTjBJE5ByCDQ":{"text":"I went with my family and the food was terrible. I only wanted to split a shrimp poboy wit","useful":1,"cool":0},"2MoVhiFf5rGk4_G-uFkbqQ":{"text":"This was about my 3rd time coming to eat a HOB.  Honestly, we usually have done it for Ski","useful":0,"cool":0},"W6aSgYcC3CB7wjSJeu-EOw":{"text":"I am a music fan who has traveled the world to see shows. Most of the time my experiences ","useful":0,"cool":0},"SwCeDQO8LFq5NNztblXFZw":{"text":"Independent Powerhouse Tour was awesome. And Foxx with HOB security made it easy to see an","useful":0,"cool":0},"pJ08-r4YMMAXl_ATn_ZGbg":{"text":"Had reservations for 7 arrived 10 minutes early, and even though the dinig room was fairly","useful":1,"cool":0},"oGYV_ETZ8LdowQp4-88U7g":{"text":"Good vibe, friendly, helpful staff. Started the night off with a beer and some gumbo which","useful":0,"cool":0},"XvfmbHGXsOq4o5iH8RlXPQ":{"text":"Stopped to eat dinner our first night here because it was close. The venue itself is cool,","useful":0,"cool":0},"PBn3SfhNbwj67-TIl5Qe7A":{"text":"Let's have a serious conversation about this concert venue. I have been going here for yea","useful":0,"cool":0},"GPbw4-7J0bCmR_7-L5q_FQ":{"text":"Excellent gumbo. Decent live band playing during dinner.  Superb, attentive service. I mad","useful":0,"cool":0},"p1dn161EJmsEhFnG5hKDKg":{"text":"House of Blues. Rocks. And I mean the food! Come for the atmosphere get rewarded with the ","useful":0,"cool":0},"7D2rlAyCcBk5mv15YmyT8w":{"text":"If you're in New Orleans and you like live music - this is a must.  It's a small venue tha","useful":8,"cool":7},"cVQNr7ZP9903fuTovxdzCA":{"text":"My friend thought the gumbo was the best she'd tasted in town. \nWe saw Trombone Shorty and","useful":0,"cool":0},"Ek1gIfT3DiNE6dvTs4E9zQ":{"text":"Kris our waiter was awesome! The shrimp and grits and cornbread yummy! Long Island iced te","useful":0,"cool":1},"BhoQj3RppaIridn8b0eayg":{"text":"This place pulls in great names in a small venue. Drinks are too pricey and don't go on an","useful":1,"cool":0},"zfEtLVtYwSjGemNzdxgxUw":{"text":"The atmosphere was great. I appreciated the ambiance. I ordered the Voodoo Shrimp, an appe","useful":0,"cool":0},"dyTFLw_68Np2I7m-RvgVXA":{"text":"saw Jack's Mannequin here in July. Nice intimate place to see a show, especially if you gr","useful":0,"cool":0},"uHatCXplAN2QU_q8gKvndQ":{"text":"I enjoyed our waiter he was very knowledgeable about the menu and attentive to our table o","useful":0,"cool":0},"8f5972m4n3YU2AsTtd4HLQ":{"text":"1/27/2013\n\nHorrible experience. Bad Sound. Lies about seating. SLOW restaurant making mult","useful":0,"cool":0},"LQSfzc1_unyEU2yisFFoxg":{"text":"This review is for Gospel brunch. \nJust like sitting through many sermons at church, I had","useful":0,"cool":1},"yfgeHJ5yVzQ-_TXtY5-8Mg":{"text":"Opened a Yelp account to give accolades to House of Blues in New Orleans. Didn't find the ","useful":0,"cool":0},"ieqYIEHBCFcRVGZlzulqxw":{"text":"hm? the HOB is so-so as a venue, and I've never had the food. Depending on the evening, th","useful":1,"cool":0},"ba5xH3OkZ5ZkCr3IjpgDww":{"text":"The House of Blues gave me the blues. The food was not hot. The waitress argued with a mem","useful":1,"cool":0},"eDDkaMljXufWjCsXTgDKJA":{"text":"The food was tasty, but not remarkably great. Loved the decor and the live music.","useful":0,"cool":0},"kCLMDQ4LkMexWun5WDlwXw":{"text":"Great happy hour prices. I met a sweet kind-hearted bar tender whose name was Kali( Cali).","useful":0,"cool":0},"BW62CyqmuOTqvIBNsqOMGw":{"text":"this was great ! and free! we were looking for something different to do for a date night ","useful":1,"cool":1},"9jnnuK6KbkLTQHqI31kB0Q":{"text":"Great service and great food recommendations by wait staff!  Kids enjoyed their portions, ","useful":0,"cool":0},"lRTrGkdSPx8182bfPFgpsA":{"text":"We were here on a Saturday night and the place was pretty dead. I already had an idea of w","useful":10,"cool":8},"XRMWhcS0y_c4G_4tjW2PrA":{"text":"Me and my wife was invited to an event at the house of blues last night we even had the ti","useful":1,"cool":0},"Aolc-rsVTUehkirk3w-exQ":{"text":"I've been to House of Blues - New Orleans twice.  First time was April 2008 to see Ministr","useful":0,"cool":0},"FQN6piIfWP4xapO7X0WlKg":{"text":"One of the main reasons we came to New Orleans was to see a concert here.  Long way to go ","useful":2,"cool":0},"kCrmIFapLzLUJG7ZK3fH9Q":{"text":"Just sat for 15 minutes with my wife at the bar to get drinks.  Bartender was too busy to ","useful":0,"cool":0},"42jBgR62yTq0EL8xwbFZZA":{"text":"The Gospel Brunch is amazing! The atmosphere, the food, the singing... it's all great! \n\nN","useful":2,"cool":0},"4oM6Xzys7c9-jMgvB5oFbw":{"text":"Not bad, not great. \nLove the patio area in the back end as they have a decent bar and are","useful":3,"cool":2},"ecR9-SmPPoxW5dZSD98X4g":{"text":"We went here for dinner before we went to the Dr. John show. Everyone was incredibly frien","useful":2,"cool":0},"QZ4rj7n9ik5LivEwFLv-Pw":{"text":"Honestly, I was underwhelmed. We stopped here during the day and maybe that's why. It was ","useful":0,"cool":0},"pZPesU5d9f7GeCtCsR5XHA":{"text":"We found the restaurant from just walking past and hearing live music. The food and drinks","useful":0,"cool":0},"kaFYhLCsTuKoU2rjz8Vhdw":{"text":"One of the worst experiences I have had at a venue in quite some time.  Let me start by sa","useful":3,"cool":1},"QofTaQQr8Ue3U_3FkVhPDQ":{"text":"I bought tickets for a concert at the house of blues five months ago. The ticket said the ","useful":2,"cool":0},"_VBxp0_ZVoaouJESiT_TGg":{"text":"We went to the NOCCA Home for the Holidays event, and I have to say we were thrilled. They","useful":1,"cool":0},"zKTOuaNgWpp67zNC-FDjdg":{"text":"Had an awesome time at the Awolnation concert !! Decided to eat something before the show ","useful":1,"cool":0},"XlaLshUGg2ee8eKw5HtO_A":{"text":"House of Blues is everything you hope it will be. The food is incredible. Spicy and authen","useful":0,"cool":0},"AM_8mAtwp1-P5WWG6DkLwQ":{"text":"The three stars is for the ambiance.  The service was terrible.  There was barely anyone i","useful":0,"cool":0},"EitipxXiS3fQBgt3mHwLmw":{"text":"I would call this the house of \"No Blues\". Was expecting some type of music from such an i","useful":0,"cool":0},"oeDUIEIArJzdBeH-UrFkvg":{"text":"The only reason this gets extra star is because of the band. The food is not good at all. ","useful":0,"cool":0},"KIZ5G7XJzKnstAw5c4ojMg":{"text":"I came to this venue at the Foundation Room to see a dear friend of mine who was playing. ","useful":0,"cool":0},"RCQ4MESON3Tn-_6OPqkcdg":{"text":"Great place with awesome music.  Food is good. The service is excellent. The atmosphere is","useful":0,"cool":0},"u5FM_NWgLhrF9JfkN-WFOg":{"text":"Me and some of my friends wanted some food before the 80's Prom concert at HOB so we had h","useful":1,"cool":0},"10H8CzvC_jbyMGmBn0O8DA":{"text":"I came out for my first visit to NOLA for the Los Van Van concert and it was AMAZING! The ","useful":1,"cool":0},"Jerf3DfitOpnMkCqUgl0XQ":{"text":"It's 9:05 and we showed up early for an 8:00 show that hasn't started yet.  Yawwwnnnn\n\nIt ","useful":2,"cool":0},"onFZz9tVXJNvYbPFltLbvA":{"text":"The venue was great. Got to see Dying Fetus perform. The venue was great for a metal show.","useful":0,"cool":0},"o1XnAsqfphqsPvdG_D7ttQ":{"text":"Visited House of Blues for a Billy Idol concert.  We ate dinner there and had great food a","useful":0,"cool":0},"6-jurMHh7bJIiuptc5YVqw":{"text":"I was there for the 26th Annual Piano Night.  The event included 3 stages of pianists perf","useful":1,"cool":0},"JEx-UQiFnDWkRHY_uGN8WQ":{"text":"Disclaimer - I did not wine or dine here, but this is a great space to enjoy music and app","useful":0,"cool":0},"XjfJ_OpuDXx6d7AqxvA3GQ":{"text":"This was an awesome night \nDaniela Mercury knows how to deliver \nThe House of Blues is an ","useful":1,"cool":0},"94lNWIOo49XOT9MqqhLdSA":{"text":"This House of Blues location is a great place to hang out or watch a concert.  My only rea","useful":2,"cool":2},"htr16aOt44Kzd--WWmCuqg":{"text":"Food was ok but Service was horrible. Waited more than 10 minutes just to get a hostess to","useful":0,"cool":0},"rsx8WhKlz4WtdYPC0G8bcA":{"text":"Super cool vibes, Rebecca was amazing, she gave us some great Suggestions and decided on T","useful":0,"cool":0},"6bNtjWocHfg1ccG7OGpVjQ":{"text":"We have a tradition that started 3 years ago, with friends from Atlanta - it's the Kirk Fr","useful":2,"cool":0},"_jyXBianHe-jRaDFFApbJg":{"text":"Worst Hob venue ever , they should be ashamed of themselves , especially considering its t","useful":0,"cool":0},"ubYmo9xlNDysrcZRccUwnA":{"text":"As an concert lover, the HOB is always a place I end up in the New Orleans Area. Beginning","useful":0,"cool":0},"LxfW3WKJRg-nj4q7aR1cFw":{"text":"We stumbled on The House while just walking around town.  We went in for an appetizer and ","useful":0,"cool":0},"nWZfOwNSfrBfsfyvPZJ50Q":{"text":"I enjoyed my meal very much. The service was timely and curteous. However, another time wh","useful":0,"cool":0},"UDvW_Qhk6ZY40HF5XnnqKQ":{"text":"Attended the Sunday gospel brunch at House of Blues a couple of weeks ago. Upon entering H","useful":0,"cool":0},"2Jx3vb4-R46p-oYjRbJPCg":{"text":"Service was great! MacKenzie was outstanding and provided great service during a busy dinn","useful":0,"cool":0},"xxSNLUrkRceMtCAiBhkz2Q":{"text":"Chromeo-oooo!\n\nWent to House of Blues for a concert and was grateful for the planned setli","useful":0,"cool":0},"L0r9LBWM96q-cssoR5rBhA":{"text":"Great building on the inside.  My problem was the stuck up service attitude of one of the ","useful":1,"cool":0},"4CWtbYuw8if0vsbQaMwwgQ":{"text":"It took forever to get the host to come and even acknowledge us.  The food was good, venue","useful":1,"cool":1},"ISYCQMhcZ0xsRe-gIeRJsA":{"text":"I went to see City and Colour, while I'm usually a fan of this venue I need to comment on ","useful":3,"cool":0},"xXN8u8Ww863RrAdAeCPwXA":{"text":"Ate here with my girlfriend tonight. We should have known something was wrong when we walk","useful":4,"cool":0},"-F8bLFwWWF3chyjaz1fyvQ":{"text":"I had the pleasure of seeing Third Eye Blind here in early April 2010. Amazing place to se","useful":0,"cool":1},"Wrj8HIWbI0jSda9MdZszvQ":{"text":"After last night's Guster concert, I am bumping HOB up one star.\n\nMy reasons:\n* Staff is r","useful":4,"cool":4},"nZOaUvVLPMQRU_NwcrR1Pw":{"text":"The food is great and cheap, but the quality is outstanding.\n\nthe music and ambiance is al","useful":0,"cool":0},"lNSAAd7fRdB1dXXiYoJU7g":{"text":"It was ok, we went to see the depeche mode experience; they let in more people that the ca","useful":0,"cool":0},"uCmQShtZW7mqaV9M8-hKWA":{"text":"The door staff was very helpful with the mask and vaccine requirements, security was pleas","useful":0,"cool":0},"q2k3X-P5eGh75MXq5XQ4jg":{"text":"LOVE the House of Blues as a live music venue and for their great food!!! \n\nGreat staff an","useful":0,"cool":0},"xE3uoev3vPpSY0Wl2xNesw":{"text":"went here for a private party (entire place rented out).  it's bigger than the house of bl","useful":0,"cool":0},"dXqqBw7Cwfb_eJHXl63NSA":{"text":"Food was very good - a little pricey . . . Atmosphere was nice - wish we could of seen a c","useful":0,"cool":0},"2k7cLeJqqMp78ihU-BROIA":{"text":"This was the best service I've New Orleans. The waiter was excellent with bringing food an","useful":0,"cool":0},"PxbGCvdd21j3h3Zfje9YZQ":{"text":"They get some good bands here but this is probably one of my least favorite venues to see ","useful":0,"cool":0},"fovtmxN1KjTVxPk-bf-z3g":{"text":"Good music, decent value.\n\nHere is the tip: if you are going for music, call the box offic","useful":0,"cool":0},"8dCeZDf8es9Mhsom7ijhJQ":{"text":"A friend and I went to gospel brunch and I have to say it did not live up to my expectatio","useful":1,"cool":0},"JlgJ4wo0gKZ5eQ8OyrSqmQ":{"text":"Shrimp n grits were awesome! Our server, Anna was attentive and perfect!   The live duo wa","useful":0,"cool":0},"-43atDgwAE73-OvZdLhBEg":{"text":"Miserable looking security guard has a power trip. Seen him arguing with a woman when we w","useful":1,"cool":0},"Vi9tXboPoD_PZaoJ-DDUhA":{"text":"I have been here for countless shows and concerts. It is usually standing room/general sea","useful":4,"cool":1},"o0gXSPndGl4eu3fuOjUVAw":{"text":"Went to see a concert and live the size of the venue.  There is a restaurant if you want t","useful":2,"cool":1},"-grgzz2Hd4lbTN89Sqb8rw":{"text":"Terrible! The server was awful and didn't even come back we had to keep flagging her down ","useful":2,"cool":1},"02q0Viv3-1QWyFq8Xuviyw":{"text":"Terrible just terrible. Will never visit again. No room to stand or walk or anything. They","useful":1,"cool":0},"Yw8PwGegTNTPKonrEQBpJQ":{"text":"My husband and I aren't particularly religious, but we both enjoyed the vibe of the gospel","useful":2,"cool":0},"g-POyUx5AztW39EGmP0BVQ":{"text":"I'm giving the place five stars because of someone who helped me see the last two songs of","useful":0,"cool":0},"sSKSoGzNbPk-hNOgwFEouw":{"text":"We knew we were going to love our time at this restaurant as soon as we are greeted. The h","useful":0,"cool":0},"EKUdHJY6W4fApfiUUzD0mA":{"text":"A little confusing trying to find the entrance but when you find it...very well worth the ","useful":0,"cool":0},"trbxC9ceTkozUi1lUu12Tw":{"text":"Great little place for an intimate concert.  Friendly bartenders.  The food...well with so","useful":1,"cool":0},"69eyg3zrlAu2JMZf3ZDOOQ":{"text":"We were a group of 4 coming to see BoneRama plays Led Zeppelin.   The Music Venue was crow","useful":0,"cool":0},"ec1ci_gOYCnAVrG1GdQNvw":{"text":"I bought 4 tickets to bring my friends from Mobile to see Thievery Corp. Why do they have ","useful":2,"cool":0},"WJYSTZBR45SLBf5MEWYtWg":{"text":"The food was good and the atmosphere fun, that's about all I can say about this place. It ","useful":0,"cool":0},"fR5jgpcnQv8a0f5s6nb9HQ":{"text":"So disappointed. Paid 47.50 for Gospel Brunch. The food was mediocre nothing stands out as","useful":2,"cool":0},"gWp4UpLsYbqNzBFaWvH4Tw":{"text":"It's a shame this is the only venue locally that books hardcore music. They like booking, ","useful":0,"cool":0},"xPLbp7J7blvgeyfpbACNaQ":{"text":"This place was a joke. We had a reservation at 12:00 for lunch and we're excited to try it","useful":0,"cool":0},"ll-LXi_1geG0BPxLQVV3fQ":{"text":"Before heading to New Orleans for the weekend, we learned about the Sunday Gospel brunch a","useful":2,"cool":0},"Ui8BofCoQ8plmEGDSa-HtA":{"text":"Can't go wrong with House of Blues...The food was yummy and drinks were delicious!  Our se","useful":0,"cool":0},"U-ldwdI7NPCI2vx7hyfAWA":{"text":"I visited HOBNOLA on two occasions recently to listen to some good music and enjoy some ja","useful":0,"cool":0},"Gzx3_dBcln7mytr9l71Nuw":{"text":"We (party of two) were seated immediately for dinner and really enjoyed the flatbreads. Th","useful":0,"cool":0},"PUcq4N93IxY1cIQ6RxO01A":{"text":"I like jazz, but I LOVE the blues!!!\nThe music was amazing, and the food was absolutely de","useful":0,"cool":0},"XwDbAwMfjna69cxc419Q_A":{"text":"Despite this being a chain, the house of blues NOLA was awesome. first off, it was huge, b","useful":7,"cool":5},"HcXMp2oexAYcVuU3NlXIYg":{"text":"I LOVE seeing a show here! It's so intimate and just such a cool setting. I try and get VI","useful":0,"cool":2},"ZQOFKYZ4o-fwSBJbTPmUQA":{"text":"Gin Blossoms take stage\nBelt 'Hey Jealously' to Fans\nJangling 90s Rock \n\n#NOLA_Haiku\n#Gin ","useful":1,"cool":1},"8gZXEn9mS-9oOA12un8w0w":{"text":"My first Yelp Review. Attended The Zombies concert February 25 and I upgraded through VIP ","useful":0,"cool":0},"zsfQ4si6QsnPm-d4LIaO9g":{"text":"Rob was amazing. Be sure to look up at the ceiling. The shrimp dishes with grits or corn b","useful":0,"cool":0},"PcWIX4LrAlajCKQ5NBqWyQ":{"text":"Service and food was wonderful. The server McKenzie was very accommodating of our numerous","useful":0,"cool":0},"9d8_w4BtPeCVD-dorRttMg":{"text":"Went there for the first time last night.\n\nThe bar I believe it to be rich mahogany? Was a","useful":0,"cool":0},"s8suLvtx8wKgjTdpE4Yvpw":{"text":"What an amazing find!  Split jambalaya and shrimp grits with friend. The flavor was out of","useful":0,"cool":0},"Z3ydpZWAxbmlDSGxwXV9uA":{"text":"I truly enjoyed my dish of portobello sliders. My sister in law is also a vegetarian but o","useful":1,"cool":0},"u3asfzSq0jgm2Ooz8F2TWA":{"text":"This is one of my favorite places to visit when I come to New Orleans. I love the atmosphe","useful":0,"cool":0},"S2jHCHz5AZ6T4iD4s35ihQ":{"text":"I love the House of Blues. Our first time there and it won't be our last. Concert was awes","useful":0,"cool":0},"uYo6qaR3YcFSKLeRs8qIEA":{"text":"Attended the Gospel Brunch on 7/2/17, I really enjoyed myself. The seats were great but it","useful":0,"cool":0},"xep5cfGVO3NiIVnjrVGZwg":{"text":"Came here for the electric feel dance party / concert on 11/2. I had a good time at the sh","useful":3,"cool":1},"xectntHVpM7M3ZwZYNoe-w":{"text":"I had a problem and gave them a 1 star review, they called me and I was able to purchase a","useful":0,"cool":0},"RXKR1D_WnFN1IJzSrhGXNQ":{"text":"The night I was there they had three acts, all terrible & raunchy! They were pop/electric/","useful":0,"cool":0},"ygdDpIL3OgjfXLYdJPls4Q":{"text":"We went here for my birthday as well. The food was SOOO good. I had Shrimp and grits for t","useful":1,"cool":0},"Vx4GByP5itwrUtQRj6R6hA":{"text":"Finally made it to the HOB after all these years! \n\nI'll keep it short: it's a nice venue!","useful":1,"cool":0},"UC09CsIlBVZS4ddoScbHww":{"text":"Really enjoyed dinner at House of Blues in New Orleans tonight. The meatloaf and mashed po","useful":0,"cool":0},"4KGrfNhSR93cUqwXxWuKMw":{"text":"The Foundation room is amazing but the power sucks. During one meeting I worked, 3 differe","useful":4,"cool":3},"B6CPxvkNag_yM0OsPbykGA":{"text":"Good food. A bit pricey. And loud. Not too family oriented. Very nice staff. A bit chilly ","useful":0,"cool":0},"U-1dLNUBugRvAfqv_2dTaA":{"text":"Paying good money to see a show here and then not being able to see the show due to poor v","useful":0,"cool":0},"LRMW-CpqjUb6M8XtOw4btw":{"text":"\"Now, listen here!\" my girlfriend's friend proceeded to scold me as our group traversed a ","useful":8,"cool":7},"DLhuELrPyBnLOMRnpuYpZA":{"text":"I'm a fan of the HOB for its intimate setting. I'd take this over being at a concert in an","useful":3,"cool":2},"angW2S905GnT1IWsi-Tkag":{"text":"The house of blues has a sign saying they are part of the French Quarter Festival. However","useful":0,"cool":0},"lgjypq971j1xreyPSE4nNQ":{"text":"I have an issue with the guy taking tickets for the Alt J show yesterday night, 9/25/13 a ","useful":1,"cool":0},"JxIxdJfYZx7TQQJGlnyTIQ":{"text":"[caveat]First an immediate caveat:  I dined in the Foundation Room at my nephew's behest a","useful":1,"cool":0},"-pyCEV_L--g8fOCNVkZUbQ":{"text":"Great place to watch a concert. We were upstairs in reserved seating, and the view was gre","useful":0,"cool":0},"BvhhBj75kJfN3VrFlGPkfg":{"text":"Was expecting some type of music from such an iconic place only to have a solo guitarist o","useful":0,"cool":0},"pGorccSSbICwnVcAQS9V1Q":{"text":"Please do NOT hold an event at this place.  We're local and made that mistake.  Never agai","useful":0,"cool":0},"c_aDVrFDQn_WJLT5J1dWOQ":{"text":"Son and I LOVED this place!! \nNew Orleans peeps are seriously the sweetest people i've eve","useful":0,"cool":1},"Yi9itzDR85UQdW7zAqHcPw":{"text":"Something keeps calling me back!\nLove it here always a vibe.\n\nCame with cousins to go to r","useful":0,"cool":1},"w_h6HL8MMFb_Jettjnvqiw":{"text":"Restaurant food quality/taste was very bland and unmemorable. The portion sizes were small","useful":0,"cool":0},"bf_Zfv4N0LppkTwhfju7dg":{"text":"First time visiting NOLA definitely recommend this place. Love the music and the atmospher","useful":0,"cool":0},"ozJTw8cURyv7xnIAR9sLjg":{"text":"Our server Aspen was amazing.  Very attentive and helpful. Food was great and the atmosphe","useful":0,"cool":0},"p1rJFboyXEl5yEYUXRr9uA":{"text":"It was my last day in NOLA, and my last meal. My friends and I went mid-day Sunday, grante","useful":0,"cool":0},"-Xw3MY7zDrCGIQF6HTUrpQ":{"text":"My first time there. Food  not worth the money and service sucks. Waited hour for hamburge","useful":0,"cool":1},"DY7-5WE3WKl6ISMUH_HrhQ":{"text":"Mic check 1 , 2.      What a nice middle of the week gift.  Wife surprised me with tickets","useful":4,"cool":4},"Tnl9DCKGov2hIQbvKWXzNw":{"text":"HOB has become a regular part of the New Orleans music scene since arriving some years ago","useful":11,"cool":4},"ogB-nIbUtCLvAOOv1DPGgA":{"text":"I went to the House of Blues in New Orleans for a private film crew party, and part of the","useful":0,"cool":0},"8bIUm86nC61YDQMfA5iCOA":{"text":"The food is great the music is the bomb. It wasn't as busy when we got here so the service","useful":0,"cool":0},"ug82AUt2iCJqt_42ljs8ZQ":{"text":"We signed up for dinner before a concert thinking it was going to get us some good \"seatin","useful":3,"cool":1},"AKNTdNT7eHw5njJXJZYI-Q":{"text":"Shrimp and Grits- Phenomenal!  Rich, spicy sauce, crispy grit cake.  Fantastic.  A little ","useful":0,"cool":0},"m_TeZOFXyKGHLHofe4tSxw":{"text":"I'm updating my review because the owner made good on the return of my friends golf shirt ","useful":0,"cool":0},"4cmDMLt7Uic1pTZ6aZ_QnQ":{"text":"Awesome food.  I had the shrimp and grits. Perfect amount of spice. Very pleased with the ","useful":0,"cool":0},"B1dIAkVfXWjCQc_R1D_LtA":{"text":"A great place to eat. I loved the Carolina Mess. We relaxed, listened to music, and had a ","useful":0,"cool":0},"atDV4fRHQOZjf5FSosAYUw":{"text":"One of the best places in New Orleans to catch a concert. Not a bad seat in the House.  In","useful":1,"cool":1},"tFQt4L9a7r-61WAOFuhvbg":{"text":"Had a great time there for New Year's Eve! Live bands in the main event area and a DJ at t","useful":0,"cool":0},"QIoK8YOQSwzk9BF8UkDx7A":{"text":"SO LUCKY I walked past here and saw that a Ratatat show was the same night and tickets wer","useful":1,"cool":0},"SKnrhUsbrWjCzqUFkla1GA":{"text":"This used to be a great venue in early 2000's but I don't enjoy this place anymore. All th","useful":2,"cool":0},"nVppydyuZ5hjabhqSvgc7w":{"text":"This place rocks.  I don't know how my last message was on  this profile and not the appro","useful":4,"cool":2},"Z9C5O2C9Vt9j-5UXEynpig":{"text":"*** Updated from 2-stars to 4-stars on 11/20/19 ***\n\nMichelle from House of Blues reached ","useful":1,"cool":2},"cZjlH5NZIRUu_odxVkQN0Q":{"text":"My friend and I arrived based on a reco for the best Bloody Mary in NOLA. Cheryl's version","useful":0,"cool":0},"JTRiqvtn7Y8lJdDzK7hQTw":{"text":"So awesome! A real experience to soak in the atmosphere, the stunning huge bar, the folk a","useful":0,"cool":0},"DJUi19_NsTmc8L6EwmVbVA":{"text":"The Gospel Brunch went beyond our expectations! The buffet was delicious quality food. Inc","useful":0,"cool":0},"qCFpBlYhNCF8Mt6geRQcOw":{"text":"Hey Guys! I know it's been a while but I have some good stuff coming up. We went to New Or","useful":2,"cool":2},"T1gbpPL3wxxkCoJRalIoqg":{"text":"Went to the HOB Gospel Brunch today. Venue was GREAT. Staff was amazing; always there when","useful":0,"cool":1},"HQI6-4f0dsO6iJ4gvJqd1Q":{"text":"OUTRAGEOUSLY EXPENSIVE: 5-piece small 51/60 ct shrimp salad: $16.50 post-tax\nSLOOOOOOOW SE","useful":3,"cool":2},"pAJmXjkFh8M5vQpHwz3fIw":{"text":"Our server, April, was extremely helpful and personable. She even went out to the front st","useful":0,"cool":0},"LNI1NEZSpwZcZZmu1_IhuQ":{"text":"My friend and I were seated immediately by the friendly host. Rebecca was our waitress who","useful":1,"cool":1},"UbewIOpaxzh3v0wwRM7F1g":{"text":"Great place to hang out. Fun times been setting up for the kittens to hang out and have fu","useful":1,"cool":0},"me0X_zqUGnOaIb83tyrhzQ":{"text":"First time in NOLA with the husband & first time\n@ this location. We got the nachos as an ","useful":0,"cool":1},"B-ITGa5W72wLue1tBjJkLw":{"text":"House of blues had great service and over all great vibes! Music + food made for an awesom","useful":0,"cool":0},"GQjc2lICAIEN1tWCbd-0aw":{"text":"I went to two events here over the past two days, a concert and also a private event. \n\n1.","useful":0,"cool":1},"XiRvfdGNoIfTdLw5V2BVeQ":{"text":"Sunday Gospel Brunch is not to be missed! Outstanding show & food to match. Everything you","useful":4,"cool":1},"qYaFUQXqhJslYLbxAcepow":{"text":"Good music, great food, and overall a solid stop for lunch or dinner in the NOLA area.\nSta","useful":3,"cool":1},"vAR3Bdqh6MY0cneQLMYI3A":{"text":"I like this place a lot. I haven't hung out downstairs yet. I always get the seated ticket","useful":1,"cool":0},"Z36BM7swqp7y7NC8LhL0Pw":{"text":"House of Blues gets a lot of great talent booked, and quite frankly, that disappoints me. ","useful":5,"cool":2}}