{"0BmZjjfFFad9gi514HRsJg":{"text":"Went to Maypop tonight for the first time.  The staff was very friendly and knowledgable. ","useful":0,"cool":0},"kC-uy-Mq3yynIbaHA9_UZw":{"text":"Truly outstanding, from the amuse to the dessert. Chef has combined flavors that mingle. A","useful":0,"cool":0},"impHTImS6IBstcuB2h9L8w":{"text":"I highly recommend Maypop--I love the blend of Southern and Asian cuisines. We kicked off ","useful":0,"cool":0},"F0Ets59KTfeV7c-FYM5cQw":{"text":"We had a great lunch. Enjoyed the fried oysters as we always do. The crawfish appetizer wa","useful":0,"cool":0},"oSbni6N3GYAquCLnrB-eeA":{"text":"I liked the atmosphere and the service was great. Definitely a hip kind of place. The BF a","useful":0,"cool":0},"63icr8BNbSM7hlmi_qlqfg":{"text":"Do not waste your money here when there are dozens of better deserving places in NOLA. We ","useful":1,"cool":0},"L4J1nDaeqydzjaaXwavuww":{"text":"Very exciting and inventive cuisine. We had the crawfish salad, squid ink fusilli, pompano","useful":0,"cool":0},"44Ocd-1z6tpvdIdmbg7yKQ":{"text":"Really enjoyed this place.  The flavor combinations were simply amazing. Please keep in mi","useful":0,"cool":0},"V_LOpMSBeSx63YWOE8Icdw":{"text":"Very accommodating staff we walked in right before closing with a group of 6. They seated ","useful":1,"cool":0},"obhDODQR456NgPNWiv3POg":{"text":"We came by for dinner and our waitress was attentive. We had the fried oysters for appetiz","useful":0,"cool":0},"HFUYlhHI7HnhMygbEhyMWw":{"text":"It's hard to find solid, high end restaurants in NOLA that are all around a good experienc","useful":0,"cool":0},"1jw9FBBTp5iWEN4DcWi35A":{"text":"Best new restaurant in the city!  Every dish my wife and I have tried hit the spot and I d","useful":0,"cool":0},"Qj5p2ZdnZEXRsFF4rXVJ2w":{"text":"There are very few times that I sit across the table from my husband and watch his eyes ge","useful":3,"cool":1},"rdrXylXWvgC2K1jV1ObWNQ":{"text":"Wonderful. We'll start with Vera our hostess / waitress. She was very nice, comfortable to","useful":0,"cool":0},"liaOC1Sw1DygzZGOVDiWTA":{"text":"Off the charts. One of best meals ever. Super creative, delicious food. Excellent executio","useful":0,"cool":0},"lsZocx5WBs8sg_OEhhZcQw":{"text":"The food was excellent and so was the service. We were a party of 4 and ordered multiple d","useful":0,"cool":0},"3MG_AdV6Owuh7aBucMHs3w":{"text":"The good.\nFood, service, wait staff, ambiance- all top notch. Fantastic place, amazing sel","useful":0,"cool":0},"Ijz3q_6QkVSsHxzbBOzStA":{"text":"Wonderful food, attentive service. Small portions with small prices to match, perfect for ","useful":0,"cool":0},"HBVLgnLfOXn4FM5rQbbZJA":{"text":"It was a delicious experience. There was fusion between local and Asian flavors. The handm","useful":0,"cool":0},"cPUyPLS81KelAsCIP9VqzQ":{"text":"something different out here in Nola, situated in the warehouse district.  The wife and i ","useful":1,"cool":0},"JOyL2lfbWzg7otAuVMFUdA":{"text":"Awesome resturant with a modern feel. The decorations and layout of the resturant gives a ","useful":0,"cool":0},"QYZYLKNTvjRm7DNpTC9Fpw":{"text":"Service and staff were lovely.  The food however left much to be desired.  My daughter ord","useful":0,"cool":0},"D3uvF-0TcfaaUmeLalKoCQ":{"text":"Delicious and exciting menu! I crave the curry shrimp noodles all the time. 5 stars, a mus","useful":1,"cool":1},"UBa5h8ZWsPACRu8bhbtqFw":{"text":"Michael Gulotta strikes again! This popular Nola chef recently opened Maypop and it is a r","useful":0,"cool":0},"Zm7bqmJ2ZZBOcf18JV6g4w":{"text":"I just ate at this restaurant, which a friend recommended highly. The atmosphere was great","useful":0,"cool":0},"n-P1Ej6LrTtwpH4WQ_POnw":{"text":"We had a lovely experience at Maypop with Kayla as our server. The food was delicious. We ","useful":0,"cool":0},"XQ0N6pjiFHadIzoZpZnOwQ":{"text":"Let me drop my only 5'er of the day right here for ya. If you are visiting NOLA or live in","useful":3,"cool":1},"Slrv-OxOLmczbXpb2mgs2A":{"text":"Great. New restaurant from Chef Gulota . Very different menu from his other restaurants. I","useful":0,"cool":0},"0PRtnrWYb_EQEBODGpnwpQ":{"text":"Excellent food and server!! Thanks Andrea!! We will be back with out of town guests in Mar","useful":1,"cool":0},"srX9GvIRvk8OuwbY3o8h5A":{"text":"5 Star most definitely. P&j oysters, lamian noodles and beef brisket. Spectacular. I can't","useful":0,"cool":0},"vmjMi8-XoRXgQRxt_cuuEA":{"text":"Absolutely delicious! New Orleans needs more restaurants like this - and we have a LOT of ","useful":0,"cool":0},"84ZVPBRODjPb2ey_LPnfTw":{"text":"I don't post many reviews but this place just blew us away!! We shared the chilled melon s","useful":0,"cool":0},"AzuchFbXd7sYbSYdR2LekA":{"text":"Simple and outstanding. Simply outstanding. Innovative and hip, quiet and pleasant. Great ","useful":0,"cool":0},"DaxGgwuPL1ZLvX3eN1JrXw":{"text":"Quite possibly one of the best meals of my life. Restaurant had only been 8 days when we w","useful":2,"cool":1},"J5HqMZnfm5mi42F4xowQBw":{"text":"Honestly I'm not sure what the hype was about on yelp but Maypop food to me is standard. I","useful":0,"cool":0},"o8kdC7InGT5Ejzp3HGgQqA":{"text":"Best food I have had in New Orleans with great service!My new favorite!!!!! Sorry Emerils!","useful":0,"cool":0},"C55zN0BAmnTynqoSRV4YEA":{"text":"Went here with my wife for dinner after a day of museum hopping and before going to a conc","useful":0,"cool":0},"3_FVhAKpqekysoBi09MZ8g":{"text":"Very unique and memorable experience. Service was impeccable and the inspired creations wi","useful":0,"cool":0},"27S7s8veRSk2F65VHFTnnA":{"text":"From the moment we made our reservation to the last scrumptious morsel, we were spoiled by","useful":0,"cool":0},"tcMptJ4m8umvLMknswhj5Q":{"text":"Excellent!  I wanted something a bit different and wow was I pleased.  I got the Chicken v","useful":1,"cool":0},"ku3qDfr3klOW2ncMLK5KsA":{"text":"Too good to put into words!! Warm crawfish salad, squid ink fusili, and the fermented pork","useful":0,"cool":0},"v9mWL7MBAcKWVVV6KnvtIA":{"text":"Best food I had in New Orleans! So flavorful! Great cocktails too. Highly recommend Maypop","useful":0,"cool":0},"PuvfTMcdM_QonbjyL5jqCA":{"text":"One of the great meals I've had in NOLA. For that matter anywhere... The service was great","useful":2,"cool":1},"qUUrKO_-NXEtxqEhd62sPQ":{"text":"The food is very good. The portions are very small. After dropping a chunk of $$ I had to ","useful":0,"cool":0},"cna4Ni0ra9gx6ruF9dEuLQ":{"text":"I wish I could give it 6 stars! Maypop doesn't let down. Everything from my mocktail, to a","useful":3,"cool":1},"uBeVnjRHavr_wOaKGMEJZg":{"text":"Amazingly eclectic blend of tastes and cuisines.  Love the ambiance and the service and ev","useful":0,"cool":0},"WwmDt0NEw2kjtBihDY8yJw":{"text":"Nice happy hour great drinks and the food is delicious! Different flavor combos. They are ","useful":1,"cool":0},"f4yjUTpW8tilBaH6KZDIww":{"text":"I went to Maypop for a bachelorette dinner during Essence weekend. We made a reservation a","useful":1,"cool":0},"9lsEGvvXhbSlEYNeNr699Q":{"text":"Love this place! I went there for lunch with a friend and enjoyed myself tremendously. The","useful":0,"cool":0},"TUqKk-vRKb4pS61PbHlF9A":{"text":"This was definitely our favorite meal during our stay in New Orleans this time! I was impr","useful":0,"cool":0},"tPv9KaGcwTFtP5swK5BM4g":{"text":"This place is fantastic! Will definitely be a regular spot. The lamb dish was one of the b","useful":1,"cool":1},"taTPQwtLC7nEq6KVKU7CsQ":{"text":"Beyond brilliant. We had such an amazing experience. Three of us including two former chef","useful":0,"cool":0},"1pfMERiaqkuFPORtOGT73w":{"text":"My wife and I tried his restaurant out while on a date night and waiting for a concert at ","useful":1,"cool":1},"wnuHmq314Vh3jZGZNHi3nw":{"text":"Food was so average and overpriced, a tasteless mix of a bunch flavours that do not work w","useful":1,"cool":0},"BW8mypilYBxr4Vpu6LzI9A":{"text":"The most beautiful plating I've seen lately and the service was friendly and efficient. Th","useful":0,"cool":0},"YGxh7rqFrPHBIZbQEi1BSA":{"text":"Food was excellent and fresh. We had the fried oysters and the crab and sausage hand made ","useful":1,"cool":0},"dY0h7FvdQRMO-vZAEAhw4Q":{"text":"I tried Maypop last night and enjoyed it. I like that they have mocktail options, perfect ","useful":0,"cool":0},"cgtGtHrm6X8HuHcY2bL7BA":{"text":"Outstanding restaurant in the CBD.  It has a great vibe to the room and service is on poin","useful":0,"cool":0},"mekJibYThxnUzoOOy73f5A":{"text":"This is, hands down, the best culinary experience in Nola right now. Fusion is no longer a","useful":0,"cool":0},"W0f0KrZv9J8ywglCVd3lVA":{"text":"We went here totally by chance and were amazed. The menu and restaurant theme is a blend o","useful":0,"cool":0},"X_YoJwJUFMO0Ku6TaC0_VQ":{"text":"Service was great. Nice menu but not for vegetarians. The 1-2 dishes that look vegetarian ","useful":0,"cool":0},"WkqhP0KZkUs5Sv_k17dBag":{"text":"Didn't have a great experience. Should have read the menu better before as there is coconu","useful":0,"cool":0},"re4MPHMWgV05P9C5L4m4fw":{"text":"Very friendly and helpful staff. Loved the savory wasabi beignet amuse-bouche. Great cockt","useful":1,"cool":0},"Shq-8fqFJ79jxmCPXkTkAw":{"text":"Amazing meal and gem of a restaurant-if you are a local and have not tired this place  it ","useful":0,"cool":0},"K7YJPTAkiseMFjFL9gsS6w":{"text":"Delicious food, fun concept, great location, exquisite decor, fabulous drinks!\n\nWe went to","useful":1,"cool":0},"BC6aSTMXXiXD91crOQebNw":{"text":"I had really high hopes for this place from all of the reviews and pictures but was GREATL","useful":0,"cool":0},"8P12mTmn03CXkgCyvj5Seg":{"text":"Ah tried this spot when I was in Nola. SUPER impressed.  Friend oysters, salad, the 2 seaf","useful":2,"cool":1},"I3S2jN-wBk_IYwyqex7_1w":{"text":"Attention to detail and incredible blend of tastes in all 3 dishes I had. One of the best ","useful":0,"cool":0},"kEqSkw6zLwXx6J0MpMyqog":{"text":"Tommy did a great job introducing the courses and discussing the intricacies of the flavor","useful":0,"cool":0},"n78TxC2AhaVz4F-BKNtMrw":{"text":"Maypop is a great addition to the Paramount/South Market selection of restaurants.  It is ","useful":0,"cool":0},"wOmZNFDkP4E3U0NbPIQUNg":{"text":"Great, unique food. Tried several different items and loved them all.Nice touch that an ap","useful":1,"cool":0},"8Hes9cnH23MRTFKxTysN4A":{"text":"This place was a pleasant surprise.  Everything was delicious and the staff was so friendl","useful":0,"cool":0},"F4D1huKttE0gE3cfdyV11g":{"text":"I was so impressed with the deliciousness of the Wok Fried To Le's Tofu in Dry Curry that ","useful":0,"cool":0},"PbkB-VKmaYg2HN8lyVywpA":{"text":"Maypop is so new that it wasn't very crowded the evening we went and after I tasted the fo","useful":0,"cool":0},"2Tm3NWfUJiSzdcpec0JsNQ":{"text":"Best ever! New fond favorite. Great service. Food is memorable! Wish I had a restaurant li","useful":0,"cool":0},"Dy7HLE8pEZRNzPpk1tYsJw":{"text":"Amazing dining experience. If nothing else come so that you can have the delicious house m","useful":0,"cool":1},"4ec3ST-a9mvrk22bYQvU2Q":{"text":"Dim Sum Sundays!\n\nWe came for their Dim Sum Sundays served during lunch! I was quite taken","useful":1,"cool":0},"i4ztu6ChN2s16W8BZpHh9A":{"text":"I loved the food. The service was phenomenal. I went with a group of 3 other ladies, and w","useful":0,"cool":0},"OZJ5bwkdGV-rA--qW4B8lw":{"text":"Wow.... not sure how to explain this place..... I didn't understand half of the things on ","useful":0,"cool":0},"VehpThoknsQKNuJ8I5hAXQ":{"text":"Maybe my tastebuds were off when I went here, but the food was a bit salty.\nThis is one of","useful":1,"cool":0},"0ORen185pbD5h__Pl3NeEQ":{"text":"Above and beyond this foodie's expectations.  The braised lamb was a flavor explosion, the","useful":0,"cool":0},"uAfy8XK6OFLTMPNOoExYww":{"text":"Michelin-level restaurant. Great service, inventive and amazingly well-executed food. High","useful":0,"cool":0},"AIz60Cr2h4V9VgFDyvvFvw":{"text":"I wanted to try this restaurant because I consider myself to be an adventurous eater, and ","useful":0,"cool":0},"0yiJqASJ4m5e__PZY6EJtw":{"text":"Five of us went here on a Saturday afternoon to celebrate my birthday. We started with sev","useful":0,"cool":0},"uxEJPD-2BKB3IwJr2QCXyA":{"text":"Had a really lovely valentines dinner at maypop last night. My cocktail was fantastic (the","useful":0,"cool":0},"ORAR7AwxYVIJz679v1mK3Q":{"text":"Located on O'Keefe, easy street parking. The atmosphere is very modern. The staff were ext","useful":3,"cool":1},"N7tmYxFpVQhdPv1Zpbw9pA":{"text":"This place is fantastic. The flavors are Indian/Asian influenced and full of complexity. T","useful":0,"cool":0},"Adt6zLP3bIP7ufNa40iNvg":{"text":"Everything is delicious. So much better than a lot of other fancy restaurants in town.","useful":0,"cool":0},"71Pu34j7G8MhfLhcSUSkqA":{"text":"Stopped into here because of reviews and that it was very close to hotel. Sat at the bar a","useful":0,"cool":0},"NeSz8-cY-INlEthEhsocbg":{"text":"Really fantastic food and not overwhelming portions. Service was great and the location is","useful":0,"cool":0},"TOg1LcBoF2bz12VYQW1T1Q":{"text":"Being from Chicago, I'm not extremely impressed with much of the dinning options in New Or","useful":0,"cool":0},"0b1GACOeD4OXi3yDmBT5Ug":{"text":"Just the best thing ever...wow wow wow. So unexpected and very pleasantly surprised. I eat","useful":0,"cool":0},"FwJeZb00LuT9OF8YmapQnA":{"text":"Love this Restaurant! I have been for dim sum and lunch and its delicious. I love how Chef","useful":0,"cool":0},"W3C1bxqkrmGekdBvf51l2Q":{"text":"Sean was our server, he was absolutely amazing. The food was incredible and I couldn't be ","useful":0,"cool":0},"J3ctvNkZijhmfRWEN9olfg":{"text":"After spending all day at the museum, this place was open at 4 and only a 13 minute walk a","useful":0,"cool":0},"443fBlHOlarV0dNLAKS_SQ":{"text":"1st time to the establishment, and before a Saints home game! Cafe Sua Da with Hoodoo Chic","useful":0,"cool":0},"MFOsDLhlMkY5r-uFUs7WCQ":{"text":"I'm in town for a conference and wanted to find a great inventive delicious accessible lun","useful":0,"cool":0},"lJY3kUMSk8QbeewK6s7jrg":{"text":"I've never had such friendly and wholesome customer service in my life. Such a green, eart","useful":0,"cool":0},"TC61g6Pt8-DMwWCa8VLkRw":{"text":"I took my husband here for his birthday, and we had a great meal. The server was great, th","useful":3,"cool":2},"uoRjeq4uum-SZMfeZosttg":{"text":"Small plates are fabulous!  Everything was rally good.  Pan fried. Oodles with shrimp, ama","useful":1,"cool":1},"PNZXWN5dJLf4mF_ML8nkHQ":{"text":"The food here is a taste sensation!  The flavor combinations and fresh ingredients are sub","useful":0,"cool":0},"SWEqcEBqzTzDH3uIfkGr1Q":{"text":"Awesome service and the Asian infused flavors have WOW factor! Pleasant fun atmosphere!","useful":0,"cool":0},"dwFHhw0NPz5ZSmuLNs84Lg":{"text":"Trendy atmosphere and very unique dishes. I had the Wok Fried Egg Noodle with Jumbo Shrimp","useful":0,"cool":0},"SRM9IKe0nXvwDnJwkop4Bg":{"text":"Food ok not great...definitely order the gumbo b/c it's probably the best item on their me","useful":0,"cool":0},"7yXdot-ZwoTv8V2n2FuQKA":{"text":"A must try in NOLA. It's different than anything else you will have in the city. You can t","useful":0,"cool":0},"nxlmDggOlSrIKuei6YQkAg":{"text":"I loved Maypop the first time I went for lunch. The flavors are awesome and unique. I went","useful":0,"cool":0},"wHNVpAeURoT_61tTMvoI4w":{"text":"Visited Maypop for a lovely dinner in August and the memory of the meal still lingers..in ","useful":1,"cool":1},"yK6Z-izK9IFnt6jesmnpwg":{"text":"Stopped by this restaurant for a quick dinner in New Orleans . We ordered the sesame rolls","useful":0,"cool":0},"1cQevk49AvE3jPHAbuqjzg":{"text":"This place is sooooo good. My girlfriends and I went here after participating in a half ma","useful":0,"cool":0},"jkz8WPQL2uMBHQQuf2yqGA":{"text":"One of my favorite restaurants in New Orleans.  All the menu items are unique and built fr","useful":0,"cool":0},"ktUHdkTOuH-MK7-sSofNFg":{"text":"Ordered the ravigotte without realizing it had something I was allergic to in it (my fault","useful":0,"cool":0},"cXuM8Dz1Dfg_QMZZstYgVg":{"text":"Wonderful dinning experience.  Food was delicious and adventurous.  Service was top notch.","useful":0,"cool":0},"akexwYLvsP3vmg4o6YMKTw":{"text":"Tried this for dinner and really enjoyed the ambiance and the oyster appetizer.  My friend","useful":1,"cool":0},"q6GNCUv7A4B562mvA7ahUA":{"text":"Nice atmosphere. Food was good not large portioned like the rest of the city. Only reason ","useful":0,"cool":0},"n2WWqgqYRUr6h0o-thBaNg":{"text":"Went for Happy Hour yesterday. Prices were great! Thai margarita was delicious, a little h","useful":1,"cool":0},"R-3BWVq1htxwszY3z_R8uw":{"text":"What a gem! We went for the dim sum brunch as the bf and I are big fans of that style. Wai","useful":1,"cool":1},"K26nZRCKHGZvTolippZEKA":{"text":"Best service you could ever experience in the price range!! The menu is innovative but the","useful":1,"cool":1},"0QpTfIL_ZQ_dG9Xgu76j2A":{"text":"Pros:\nFresh environs\nStrong flavor profiles\nTasty amuse bouche (can I get an order of this","useful":1,"cool":0},"4-JzFc078yqs1FRTVsa4dQ":{"text":"Had Swordfish last night Not impressed, Bangkok Mule was awesome and Mike Bartender/Server","useful":0,"cool":0},"8nPz1v7UEkyNV3v0bKlRnw":{"text":"I love their food, better than expected. We ordered 4 dishes. Wok fried noodle with jumbo ","useful":1,"cool":1},"k-Bja_29vuuVYKCbDsS4UA":{"text":"Flavorful experience! Walked in for lunch and was pleasantly surprised. Asian southern fus","useful":1,"cool":0},"OKhc1RuEJrtW8Oh-O0sPWA":{"text":"Adults, gourmands, gourmets,  ignore the low-star reviews of our young compatriots. They l","useful":0,"cool":0},"NsDNkSSHpqH4kGf1Ql1a1Q":{"text":"Not sure why I waited so long to try this restaurant. Everything was perfect! The service ","useful":1,"cool":0},"Gl9LeOtzvCvoV77wkUtCOQ":{"text":"My friends and I enjoyed the service, atmosphere, and absolutely delicious food! I got the","useful":1,"cool":1},"jKe3ml0mRpo2XfPvG7ZFjg":{"text":"Fancy presentation of Asian-ish food. Tartine appetizer was very tasty.  Shrimp bun looked","useful":1,"cool":1},"U1Kt0ehG3hYIfkHP-SQCVQ":{"text":"Good lunch spot in the New Orleans business district. \n\nOrdered the lamb curry and loved i","useful":0,"cool":0},"CD6T0LZVqqUCItj54j9tSA":{"text":"Maypop was a good overall experience. The plates were nicely presented and tasted good. Th","useful":1,"cool":1},"b7jhMNtaUjTfgutPbWfaSA":{"text":"Extremely outstanding food and service. Everything from the cocktails to the dinner menu h","useful":1,"cool":0},"PcPys9nDZYgMFvw0h0EwNQ":{"text":"Wow.. flavor explosion 4.5 stars.  Could not find anything that could be improved. Very ta","useful":0,"cool":0},"cDN-0sGlNCcvRqlvr1ecSQ":{"text":"Went back to Maypop last night to take some friemds from out of town. Again our servrr was","useful":0,"cool":0},"lauUHyzO_LP3yZ37YRKbhQ":{"text":"We had the P&n Oysters, charged oyster bucatini, and the brisket. Everything was amazing. ","useful":1,"cool":0},"SrM9ERqSJMIVScTedPN5Zw":{"text":"Love this place! The service and food are amazing. Decor and food presentation are on poin","useful":1,"cool":1},"dLgLhj8iCJHjJc3qdlY9oA":{"text":"Fantastically chic ambiance. Super friendly staff. Impeccably artful dishes bursting with ","useful":0,"cool":0},"1LlmNmzekUTHpNMpkJRLzg":{"text":"The food was amazing! Had the beef brisket I was obsessed!!! The dessert was equally ridic","useful":0,"cool":0},"pLUiQH_6IO8XwVkg1Tyxaw":{"text":"What wonderful food! We tried five different items, and every bite was perfect. The menu c","useful":0,"cool":0},"I3LMiLgQJoI1d2P-mvQFgw":{"text":"I came to Maypop on a great recommendation from a friend that lives in the neighborhood. I","useful":0,"cool":0},"rGV8KWbu-wEEu4riRJyqqw":{"text":"Amazing. Period. Appetizer, entree, dessert, all a fusion of tastes that comforted the sou","useful":0,"cool":0},"17yw0vYrpfriiRiuiJvluQ":{"text":"This was our second time at Maypop and it was just as exceptional this time. We were there","useful":0,"cool":0},"6t_ZnOvJ2kIQfnwROqyg6g":{"text":"What an amazing journey, a bit short since we are trying to cut down on our portions. \nWe ","useful":1,"cool":0},"gm3VeV4Fjr9RJ8WdiN0u4Q":{"text":"Incredible flavors that are unique and exquisite. Inventive combinations. Everything was p","useful":0,"cool":0},"T8AYkwLsRMafLB7-6nUaGA":{"text":"Good lunch spot in the New Orleans business district. \n\nOrdered the lamb curry and loved i","useful":1,"cool":1},"xN_D7qJbOsZl4QzqdUDRKg":{"text":"I had such a memorable lunch here... I can't believe It wasn't more crowded considering ho","useful":24,"cool":12},"uii2fwUGpT6G1krCxPyKbw":{"text":"We stopped in to this restaurant solely based on its proximity to the venue where Grizzly ","useful":1,"cool":0},"mpIeFW8lJpbzo2XFx8_QGw":{"text":"I know New Orleans is famous for its classic Cajun cuisine but if you're looking for somet","useful":0,"cool":0},"KP0iAUYoLHL-Ml01gFa_NQ":{"text":"Forced myself to stray from my favorite NOLA restaurant (Coquette in uptown)to try Maypop,","useful":1,"cool":0},"1sh64CPUvwk0NPnlQRLjrQ":{"text":"If you are in New Orleans, you need to visit this restaurant. Very unique pairings that co","useful":0,"cool":0},"b4wxi9YETn6Pzd6MoM3lFA":{"text":"Honestly, more 4.5! This place was fantastic. We had 2 appetizers, the delicious noodle sa","useful":0,"cool":0},"PYvcysTQU41o3XNizkh2hA":{"text":"Dim Sum was outstanding!\n\nWe tried everything on the Dim Sum menu and it was one after ano","useful":1,"cool":0},"W66D4w5EeezS-iD5eq55YQ":{"text":"From the smallest of appetizers to the little free donuts their food was bursting with uni","useful":1,"cool":1},"ZVZIIb7a4JUP82FZBmlkkA":{"text":"We went here for my birthday dinner. The restaurant was great at accommodating special die","useful":0,"cool":0},"C5YUAJ7i8bcgRV3BZO9XjQ":{"text":"One of the best meals I've ever had. Everything comes artfully plated. The staff went out ","useful":0,"cool":0},"TP07aBygeplghyg-z66dpQ":{"text":"The Vindaloo wings (happy hour menu) were outstanding! The coconut ranch sauce was terrifi","useful":0,"cool":0},"SiXC2glS0n8IM9VxDT547Q":{"text":"Love how they didn't skimp on the portions. We didn't even need entrees, appetizers were s","useful":1,"cool":0},"cceaIUPwfojXzsWgP3x_2w":{"text":"This is interesting place, the service is very good! I ordered mapo tofu noodle and lamb d","useful":1,"cool":0},"QSTM1Usf-qicSP59kjO1Og":{"text":"I came to dinner at Maypop with a few friends prior to going out to a show. The service wa","useful":0,"cool":0},"PEka2-udJAO2vXkZWDm93w":{"text":"The lamb dish I had was one of the best lamb dishes I've ever had. The p&j oysters are ref","useful":0,"cool":0},"2CwdjFvRw8KRa79pgT0yEg":{"text":"Maypop is very accommodating if you are Gluten Free!  I rarely get to eat fried foods due ","useful":0,"cool":0},"FEIRs_gTQHhq5Oj6Sm4OFQ":{"text":"Everything was absolutely amazing: the food, service, and atmosphere. A friend recommended","useful":1,"cool":1},"yuJRqjxyk4knuSfRa97JhQ":{"text":"Food was great, fried oysters and beef brisket are a must and presentation from the chefs ","useful":0,"cool":0},"vKl9reHgKS8_4GZBSDzuTQ":{"text":"I love the creativity of the menu. Some things just missed flavor wise. Had pulled noodles","useful":0,"cool":0},"B0mor5RYIv_GKBv_dEj7Sg":{"text":"Maypop is amazing! Everything I ate and drank was fantastic. I had the Thai margarita, cre","useful":1,"cool":0},"lFAij00NgJPUM9HOQdWm-Q":{"text":"Not your typical NOLA fare. Food was excellent and the waiter very attentive and knowledge","useful":0,"cool":0},"hm2RzmKyeO2s0CBP220TEg":{"text":"This place is amazing! Highly recommend. The food, atmosphere and the service where outsta","useful":0,"cool":0},"2R2y1jekoKOGGpyx4t-7-g":{"text":"Loved it! Pleasantly surprised. Amazing fusion of creole and Asian flavors!  Got my fried ","useful":0,"cool":0},"Hm3bdNE6xITpU4dGGQVxHQ":{"text":"This is a new restaurant that delivers in every way amazing service with the most attentiv","useful":0,"cool":0},"NvyOeaCdmV7rTZSzGrNqTw":{"text":"Excellent experience.  New restaurants often disappoint, and it seems that even old favori","useful":0,"cool":0},"XGijcEl7VwX62a_-iBhfHQ":{"text":"First time I've ever had Italian and Asian fusion food. And first time I was not impressed","useful":0,"cool":0},"QQwfLjkxqil9sOdricB_iQ":{"text":"Drinks weren't the only thing on the menu during our weekend at Tales of the Cocktail in N","useful":0,"cool":0},"s5_McAp8F323tqsgy_2taA":{"text":"Staff really good, inside neat and clean, decorated new. Each beautiful dish tasted well f","useful":0,"cool":0},"b3zK20ikECKfVMQpLeo-IQ":{"text":"Very delicious, which is of no surprise from this team. Definitely refreshing to see inter","useful":0,"cool":0},"2Xso7iVggxpQy1qWLNjezw":{"text":"Takes forever to get your food. It's good.  But be prepared to wait... a long time. Also p","useful":0,"cool":0},"nYxqzYBGmmdbThEEArkoEw":{"text":"We went to the amazing Maypop tonight!  The ambience is aesthetically pleasing with beauti","useful":0,"cool":0},"f-CEYuWiUDB2u719esdVZA":{"text":"Just go and see for yourself. One of the best meals I've ever had. New Orleans has so many","useful":0,"cool":0},"kZ8TBDUSOyJ4H0v6095CXA":{"text":"I have to say that the service here was excellent. Our waitress was not only friendly, but","useful":2,"cool":1},"UppwWDMQ0nbQ9g-Wyh4YyA":{"text":"Wonderful Asian Fusion.  Four people, 4 Different meals--All wonderful.  Great staff as we","useful":0,"cool":0},"6zWrOGu8Go3wGgotUOLlEA":{"text":"Maypop is trying to be different, putting their creative spin on New Orleans cuisine using","useful":1,"cool":0},"qWRFtkiIgXWqk_d-ZoTKNQ":{"text":"My hubs and I had dinner at Maypop with a couple of friends this week and enjoyed our time","useful":3,"cool":1},"n9Yr-G-UBxsmu7MUke2TUg":{"text":"Luckily heard about this restaurant on our last night in New Orleans. What an amazing meal","useful":1,"cool":1},"8RWk4Rx95bjAJCZg219w3A":{"text":"Went here for Sunday brunch with some friends while I was in New Orleans before a work tri","useful":0,"cool":0},"see6t6V8iPPpEIp8atBqZw":{"text":"I went here for a private event and got to try more of the menu and found a few favorites.","useful":0,"cool":0},"bUlMZQvpOkXnyicCMz1kcQ":{"text":"One of the most excellent dining experiences I've had to date. The service was excellent; ","useful":0,"cool":0},"jUGrK5ipq45WJuWZWGcgTA":{"text":"First time here.  And we ate our way thru the place.  The food is as great as you read and","useful":0,"cool":1},"n_WXtqgoSPokjWtUYT-_EA":{"text":"This place was nothing short of amazing! We had a great waiter named James who was very fa","useful":1,"cool":1},"as3lHu3e5k1u3VBDwP0pgw":{"text":"I am new to New Orleans - visiting for vacation. Originally from SF. This is the best food","useful":0,"cool":0},"P_55kiH_Du7G56moczDVwQ":{"text":"Does not deserve the hype, the owners of this restaurant also own Mopho, which is signific","useful":0,"cool":0},"8-aM6WcRJuNbaGas_sEQ-g":{"text":"My favorite restaurant in New Orleans. Bold Asian fusion with a touch of southern cuisine.","useful":0,"cool":0},"bES7lyJRC1dGuok017ONxQ":{"text":"This was my first visit to New Orleans and I was eager to try all the great hot spots in t","useful":4,"cool":2},"_ue03qnO4T14qzbF4uTjFw":{"text":"Amazing meal! I've been looking forward to eating here as MoPho is one of my favorite rest","useful":0,"cool":0},"jHrzf8mVWSya-WFx8UyxXg":{"text":"This place right here is top 5 all time for yours truly. Occupying a handsome corner in a ","useful":4,"cool":2},"NZQDQ1zW33EbK0ptKcjRwA":{"text":"Great food!  Excellent service!  Wonderfully innovative..","useful":2,"cool":0},"5mvlkmWt9MKpTbVNHKwffA":{"text":"Went out to Maypop with family for lunch.  It has a lovely ambiance: quiet, spacious, and ","useful":1,"cool":0},"pGLj5KyXpc3B7CH0NX8ExA":{"text":"I'm going to have to go here for normal dinner service, but I was very happy with their we","useful":0,"cool":0},"1x8DZ6d_THeIz068xmt86Q":{"text":"Inventive food coupled with a very competent server, but many problems.  The first three g","useful":0,"cool":0},"DtQMKqq5q3yPoJTQGJ4wPA":{"text":"I must say we had the best meal in a long time. It was a unique and thoughtful culinary ex","useful":0,"cool":0},"dgla862ktm9s6wge3XK8Tg":{"text":"I've been meaning to check this place out for awhile and I'm so glad I did! Matthew made u","useful":0,"cool":0},"T1NZPPpK-aXHTgp8xGspPQ":{"text":"Scott from Maypop ruining one Bachelorette Party dinner at a time!\n\nWe visited Maypop duri","useful":1,"cool":0},"dVQoh04gShvLGCJ0NqYDvg":{"text":"When I look for restaurants, I am always looking for a place that stands out from the rest","useful":1,"cool":1},"ZBmsSKijsnT_38crArjLwQ":{"text":"Overall good dining experience, originally went because of the dim sum but they told me th","useful":0,"cool":0},"QqxNXLdVyCd3n4CWCgCIgQ":{"text":"This is probably one of the best meals I have had in a long time. The service was outstand","useful":0,"cool":0},"59A7XchhX-8pA6iQNacORQ":{"text":"Wow! I have NEVER had flavors and textures combined like this and it was amazing! I starte","useful":0,"cool":0},"3wojmZWajDAT-heFNSe4YA":{"text":"We had such a nice experience at Maypop! We stopped in earlier in the day for a drink at t","useful":0,"cool":0},"IQJUxC5cRnf9PGu1EGRL-w":{"text":"This restaurant is amazing!! I've sat at the bar multiple times and the bartender Will is ","useful":0,"cool":0},"RlGlu4Yo5WnoEaMahbJJiQ":{"text":"This is an amazing restaurant with a delicious happy hour menu. Their vindaloo wings are p","useful":0,"cool":0},"Jmu7wdd8q7EYeA7kV1snCg":{"text":"I may have eaten better food, just couldn't tell you where are when. Outstanding!!!! Staff","useful":1,"cool":0},"yj2FNgrgIR7BLxHAl0BLNw":{"text":"I was amazed by the flavors at Maypop!! Everything from the salad to the little chocolate ","useful":2,"cool":1},"4bbWoFHxFmsNnfY3ZjGr0w":{"text":"I did not know what to expect from MayPop when i was told we were meeting friends here.  I","useful":2,"cool":0},"QpS0GCkHOrndDnw45DaAtQ":{"text":"I dare say I had my favorite meal in Nola here! The flavors, textures and presentation of ","useful":0,"cool":0},"-wlo-tArSHFCOnDyMvAdIQ":{"text":"Never have a bad meal at Maypop!  On the Dim Sum brunch menu the watermelon and eggplant w","useful":0,"cool":0},"9CzJpBNJ4sbJjX4FNXWQEg":{"text":"Food and service were excellent!   I appreciate all the unique flavors chef brings to each","useful":0,"cool":0},"RQEvU_7z1S2bYpTIlH6sbA":{"text":"An amazing meal - went for dinner and split a bunch of dishes.  I'd like to say something ","useful":0,"cool":0},"-lNi8qePCPsHp4vSpSjFcw":{"text":"Have had lunch once and went for dinner last night with a friend who is gluten free. It wa","useful":0,"cool":0},"Qpg36d37c97uKGk2UFSSEQ":{"text":"Nice food, a little bit pricey, but nothing too exciting.My boyfriend had the sweet potato","useful":0,"cool":0},"FWfB-P8i91acz5ZjcVIlCA":{"text":"Great food, awesome service.  After a few days in New Orleans eating all the rich food I g","useful":0,"cool":0},"_mCJURj3zs_BWbS0j8ZQhw":{"text":"This was my favorite find in New Orleans! \nIt was super close to the Whitney hotel which w","useful":3,"cool":2},"xxMYqptPhSJnsE0cR94h0Q":{"text":"Tonight I stopped in for dinner after my show at Smoothie King Center.  I ate at the bar, ","useful":2,"cool":3},"O3RbkZyEVX01_RQMnXzX7A":{"text":"The service here is excellent.  Food is decent but somehow I managed to order everything t","useful":4,"cool":2},"lioN_hF8tr5okyCFhR34MQ":{"text":"Wow the food here was great. Asian fusion is often times a gimmick or flop, but this was e","useful":0,"cool":0},"0OCyPedeAIg02vfv9_CIdg":{"text":"Both the food and the service were phenomenal. We are from NJ/NYC and we are exposed to so","useful":1,"cool":1},"OME-61Xic-1Z6rG1Mm-nXg":{"text":"We sat at the bar on a Monday night and Vera was the bartender/wait staff for us. Interest","useful":0,"cool":0},"BUOmZIptGHLHknB0WRxWCA":{"text":"New favorite lunch spit. I was a little worried when I head Asian and Cajun fusion cuisine","useful":1,"cool":0},"dMLSe_q9tmSwvF3TBQH0cw":{"text":"I have been here on multiple occasions! Each time there was a different menu. Every dish i","useful":2,"cool":0},"1H6fGvCFcRsXdvSNZK2qpw":{"text":"Asian fusion menu for the adventurous! Nothing lacked flavor. Complementary starter red cu","useful":0,"cool":0},"pUn6SZkZ3SqYfwkzzcLRzw":{"text":"The chef here is  genius at creating unexpected and satisfying combinations of flavors.  W","useful":0,"cool":0},"AJdVugq1Lo6ziyqwVqK1yA":{"text":"Very impressive. We really enjoyed lunch and will be back for dinner. Service was lovely a","useful":0,"cool":0},"szSZhr_-UwmfF-ED1uxZTA":{"text":"Enjoyed this out-of-the-way Southern Asian fusion place. Location seemed a bit out of sort","useful":0,"cool":0},"GOFJHGRHbUeQ1eu9WOGA9g":{"text":"Organized a dinner for 6 during a conference. As the local in the group, I felt a lot of p","useful":0,"cool":0},"l-jQieCzuDrosDW37F9Qrg":{"text":"Loved it.  Creative delicious food.  Great clean contemporary environment.  Knowledgeable ","useful":0,"cool":0},"X4e1a-s5BF-JVs_pKLz2aA":{"text":"Another disappointing Nola dining experience. \nSo this was one of the first results search","useful":1,"cool":0},"uH2SujCjwEpaCSfQlvsE2w":{"text":"Not particularly impressed.  My daughters steak was under cooked and once sent back it was","useful":0,"cool":0},"K725TuzTB6YECFLSj19nFg":{"text":"What an interesting night- had reservations for 9:30p but previous group wouldn't vacate t","useful":0,"cool":0},"vgww4m61A5lJr5mWLcdP3Q":{"text":"Atmosphere great, service was great, visually the food looked great. As for the food itsel","useful":4,"cool":0},"vd3erSwS-litkmz4rJ1vsQ":{"text":"Interior is really cool (modern/chic style, really geared towards dates IMO), service is e","useful":1,"cool":1},"WPnoaUEVBa8HqMQrQfF15w":{"text":"3.5 for me, really. Mixed feelings for me about Maypop. So many of the dishes did have ama","useful":0,"cool":1},"lCTH61XjpWawKbeEFTBiZw":{"text":"LOVED MAYPOP!!!! I absolutely love Thai food and the Thai- southern mix was something I'd ","useful":12,"cool":4},"H1KzrDG1vg0TLz2-YkKXzQ":{"text":"Absolutely stellar. Our favorite restaurant in New Orleans. Delicious mix of Vietnamese an","useful":0,"cool":0},"-Yo_YM0Kj4_NDNcANnJBDw":{"text":"Awesome! I was here with a group of 5. The atmosphere was great - late crowd. We shared ap","useful":0,"cool":0},"s8L-eLpsLgSXlvzE6ZIWrg":{"text":"This was quite possibly the best meal I have had in years. Vietnamese French fusion as it ","useful":0,"cool":0},"llOBcZE3VPdpgN8XerxDHA":{"text":"This was a trip. With every bite, I had questions and then found answers the more I ate. S","useful":0,"cool":0},"1zrCii7HVlymMQ9FHrusXQ":{"text":"I've never written a review on yelp before but after visiting Maypop I felt compelled to s","useful":1,"cool":0},"Gdp8IZjFnhZReKO7lqJiZg":{"text":"We made RESERVATIONS for 6:30 and when we arrived 5 minutes early they told us the did NOT","useful":0,"cool":0},"5ZrJmUjDxpv3cpxxZslh9Q":{"text":"Came here pretty late in the evening to grab a snack with my 12 yo (who has adventurous ta","useful":0,"cool":0},"MVyXziihyl7CYcHE-yXBqQ":{"text":"The wait to be greeted at the table was painfully long but by the end of my meal I could h","useful":0,"cool":0},"Pq6twnDMw_WNRxgKb_8CWA":{"text":"Quite possibly the best meal I've ever had a restaurant. The bone marrow was unlike anythi","useful":0,"cool":0},"knpMbYGih5OzfOSHz5vn2Q":{"text":"Excellent wait staff, great atmosphere, and enjoyed the food immensely.  It looked like th","useful":2,"cool":0},"IM3_Tnu4m1eEyPUINyPzHQ":{"text":"Hands down one of the best restaurants in NOLA.  Unique flavors you won't find anywhere.","useful":0,"cool":0},"4nvR47YVMQLu8XbJp_uUwg":{"text":"So we went to Maypop with a lot of questions. It's a fusion of so many styles it's hard to","useful":2,"cool":1},"zCmc46eZJQzhzcaeE__Y2g":{"text":"This place was interesting. I was really psyched and looking forward to it because all the","useful":0,"cool":0},"WElE8Xx_43hiINuJf67_-Q":{"text":"It's a long time ago. The food is just so-so. I was not able to get asian flavor with my a","useful":0,"cool":0},"bp-U5ej4waMaV2OJWv9fXA":{"text":"Outstanding! Creative and delicious food, attentive service, and attractive surroundings. ","useful":0,"cool":0},"KBDGTAMHdk-pa51-2hhfJg":{"text":"This has been the most creative and best executed meal I have had in years. Pretty sure th","useful":0,"cool":0},"_Ve9WdplIAyC351Sl_2h9Q":{"text":"Favorite restaurant in New Orleans! Mouth watering, melt in your mouth everything. Come fo","useful":0,"cool":0},"yOZylXfTCfoV-61ssf-YgQ":{"text":"Craft cocktails by Matthew Moorin are the best! Along with amazing cocktails, he gives you","useful":0,"cool":0},"RTJ2aG6ZXTce1n2Erh66aw":{"text":"This is the best meal I had in New Orleans and the best meal I've had in recent memory at ","useful":0,"cool":0},"v9m4px-CgMuQfmRzgL97BQ":{"text":"I was excited to come here, but it exceeded my expectations! The dishes were so well execu","useful":0,"cool":0},"fFcEZUw3jiDFZGd9eYIknw":{"text":"I went with a group of 6, and everyone was very pleased with their food. We shared three a","useful":0,"cool":0},"dv2Lg3-Bb7U4qPRQmwxmjA":{"text":"This is a truly great endeavor. The fusion of Vietnamese and Thai cuisine with local creol","useful":2,"cool":0},"c4LYBjafUfFHqr-WkladGA":{"text":"Came here before meeting up with friends that were getting into town later in the evening.","useful":0,"cool":0},"zAP-jA_XPZkL0-gFyEMBZw":{"text":"Love it when a restaurant lives up the hype. Nice atmosphere. Far enough away from Canal t","useful":0,"cool":0},"djg4NW0P_1Kdx9sxdOrBNw":{"text":"This is an amazing Vietnamese fusion restaurant! Just come and order the Bone marrow, oyst","useful":0,"cool":0},"rYfBJnzhG0lgrahAR5dx0w":{"text":"Have had the pleasure of eating here several times over the last few months. The food is r","useful":0,"cool":0},"l6Dcl1c2PNRSFGMWrBNBgQ":{"text":"Visiting New Orleans, you have to visit this restaurant! It's not your typical old world p","useful":1,"cool":0},"8vGOJKMrq7eOLOuySIw7vQ":{"text":"Our first time here but we will return! We shared the appetizer take on a crawfish boil (g","useful":0,"cool":0},"IkBYwkTYrqFi3Bika021Bg":{"text":"Overpriced- terrible selection on menu (changes daily) service was extremely poor. Very di","useful":0,"cool":0},"xsX9Yiv7Udh2aoMAUf-5og":{"text":"Excellent service. Our server was very knowledgeable about all of the dishes, including th","useful":0,"cool":0},"tYLTkDWqbSUyeFJr0oVGJg":{"text":"Popped into Maypop on a Sunday night. One of those didn't-feel-like-cooking-nights. Called","useful":3,"cool":1},"-Mf9gjiihIzyyulv7LBNGg":{"text":"Great atmosphere and the beverages are outstanding. The food was acceptable but not what w","useful":0,"cool":0},"Qy7AympNCJ1iPTUCGDxh6w":{"text":"This place is legit. We had four entrees and two apps and they were all both interesting a","useful":0,"cool":0},"KfGX8PHoo8HGt8dhQh159Q":{"text":"Maypop was a great experience! We had planned to go to Willa Jean for lunch, but there was","useful":1,"cool":1},"U0fXtzZi9lvvBNmCZyouWg":{"text":"A co-worker and I came here for lunch one day. We were seated right away, and each decided","useful":0,"cool":0},"uO0lI3Cxd9RCpSLwt6ExyA":{"text":"The only reason I'm giving them one less star is because their prices are definitely overp","useful":1,"cool":1},"IMaZ3fB4lSsH7h8KkoPcvQ":{"text":"When Bruce and I moved to New Orleans, we were consistently impressed by the food here. Ea","useful":0,"cool":0},"wbKsqkDaDvQCC0uvGp6iIA":{"text":"WOW! The flavors in this food were absolutely amazing. The complimentary small curry beign","useful":1,"cool":0},"UBMlgo48A-OsAyK236zEnA":{"text":"Delicious! Atmosphere A+\nTry vindaloo wings and steam buns, you will not be disappointed.","useful":0,"cool":0},"nvos-2JSJdRDqcInVJf3hw":{"text":"Service was very friendly and attentive without being intrusive. Amuse bouche was fantasti","useful":0,"cool":1},"1jT_9m4SWYFO27aUstCpMA":{"text":"This is a wonderful restaurant. The food is fabulous and the atmosphere charming. The wait","useful":0,"cool":0},"0xMNnfxCD8nocEzBZM240Q":{"text":"I was very excited about coming here and wanted to love it. It's pricey, you don't get a l","useful":2,"cool":1},"vJ-mCeqPDi-_GUGNTNfqAQ":{"text":"This place blew my mind. We went for dim sum brunch but strayed to regular menu too. Cours","useful":2,"cool":1},"4n_zlQjbOe1N17RLrp-uTg":{"text":"amazing.  the food is outstanding.  hand pulled pasta is delish.  Bone marrow and fried oy","useful":0,"cool":0},"IzFHEShNXpyML5wu95Uq_Q":{"text":"We heard a lot of people rave about Maypop and finally made a spur of the moment decision ","useful":0,"cool":0},"FtX1X6j7a5GObK8cFA_niA":{"text":"Been wanting to try them out for Happy Hours when I'm attending a concert nearby. Came in ","useful":3,"cool":2},"ImtDxLll325SrF57A5T8mg":{"text":"It's good I forgot to take a picture!   Service was great.  Our server did a great job wor","useful":0,"cool":0},"Tbq-qSTMMHZI1tEjru9M_A":{"text":"In town for 72 hours. Stumbled across this amazing restaurant. The food was a collaboratio","useful":0,"cool":0},"cYAtUyJRfr-dCIyxPLTOOQ":{"text":"Excellent fusion food and great service!\n\nWe were looking for places to eat at downtown Ne","useful":0,"cool":0},"-WVrAYekPW20wrBXpDfMbw":{"text":"First time there with my wife. Delicious food with decent prices. I got the crispy red ski","useful":0,"cool":0},"3rsO2_REx8lGNP_RH9s7_w":{"text":"This place never disappoints! I started with a glass of sparkling rose and the blue crab r","useful":1,"cool":0},"55BNqruYH6YK47_3vgPeig":{"text":"You have seen the pictures now picture all those plates perfectly seasoned and layered wit","useful":1,"cool":1},"ZT3kHGnPk1wO3GcIQVGVGQ":{"text":"Real talk... I was ready to give this place a bad review. Cause I thought they were fronti","useful":0,"cool":0},"4b4CaIlorV0RwsWQotLhag":{"text":"Outstanding dining experience, a true treat for foodies! All of their dishes are super uni","useful":0,"cool":0},"GqC-riwrVQMjzIhgxe6KFg":{"text":"Amazing food! Every bite was so creative w eclectic influences, perfectly seasoned, and gr","useful":0,"cool":0},"V-c1kWwdb8x6224cQ-E44A":{"text":"We had an okay experience here. I came with a big group for a friends birthday. We had mad","useful":0,"cool":0},"Ym4HWLGokhx6fDUz9Cj80Q":{"text":"We were drawn to this restaurant because of the number and quality of reviews posted. This","useful":2,"cool":1},"jqZZEehfiyN1_L-YOeR5kw":{"text":"Just tried this restaurant for the first time and it was great!  My husband and I split tw","useful":0,"cool":0},"e6uOCguGuO5PIR2Zzp52LA":{"text":"Loved the short rib pasta. Perfect portion. Gave complimentary appetizer and delicate cube","useful":0,"cool":0},"5Toq1p3IqjZ559kMmzaG8Q":{"text":"Amazing service! Great flavors combined to make a savory dish. I normally arrive in time f","useful":1,"cool":0},"Ma3TOliwXhgRfpG3dtoH_A":{"text":"On vacations with friends and family, highly recommend Maypop Restaurant . Food was really","useful":0,"cool":0},"0xDVmkLolKMfu2FSpsMMhg":{"text":"We had a great experience fixing at this restaurant. The decor is calm and inviting. The f","useful":0,"cool":0},"uo_8filHSO4ejKKAqXsQGw":{"text":"Wow!  Let them drive, you can't go wrong. The most unique flavors in New Orleans. Knowledg","useful":0,"cool":0},"XXGz4W50E-ln-zhQFLTFBg":{"text":"Best Vietnamese food in New Orleans.   Michael is a culinary genius.  He understands how t","useful":0,"cool":1},"spiHDKAmaiZ7jPdrQuFJ3A":{"text":"Very creative food offerings.  Enjoyed the atmosphere.  I'll probably go again, but not fr","useful":0,"cool":0},"OoZYXtiUN8bfZtrW7bpwPQ":{"text":"Interesting spin on Asian food/dim sum and inconsistent service.  I visited twice on a rec","useful":0,"cool":0},"e1MQIy2BjtJed4fb4xVMYQ":{"text":"Great early dinner at Maypop, everything was excellent but the soft shell crab may have be","useful":0,"cool":1},"PHD_FtPNTsKiaYc24gbfuA":{"text":"Very nice and knowledgeable staff. Creative dishes offer a refreshing change from usual NO","useful":0,"cool":0},"3WFjkpMxxr7_FwlJfVZfeA":{"text":"I came for a early dinner \nI guess we were almost 1st and 2 th costumer for dinner \nIt was","useful":0,"cool":0},"BZ8sqvdkIcGvVsVJDXSikw":{"text":"Had a phenomenal lunch here w/ a party of 6. Beautiful creative delicious comfort food. Se","useful":0,"cool":0},"ZnISKeYD_yWMcRkCv_AEfg":{"text":"Excellent wait staff. Excellent homemade food. \nHighly recommend. Love the complementary b","useful":0,"cool":0},"SAD5fmb9IF2OQkuY76lQBg":{"text":"Bright, open, buzzy restaurant with outstanding food and service. We had a mix of small pl","useful":0,"cool":0},"QohWptFI4XEPZmoSYsCRvA":{"text":"Went here last night started out with the bone marrow and fried oysters, the food was outs","useful":0,"cool":0},"lbzQS0i9WS03klBCZ9aFig":{"text":"Had dinner at Maypop last night and it was PHENOMENAL. Deserves 6 stars. Maybe 10. Might b","useful":8,"cool":2},"nPP_UpfnVhsqf5VULpJAKw":{"text":"I must say we had the best meal in a long time. It was a unique and thoughtful culinary ex","useful":0,"cool":0},"6GlgR5RA0ZPD_hl0HUCF6A":{"text":"Our meals were absolutely fabulous and the chef went out of her/his way to accommodate my ","useful":0,"cool":0},"CLNkdAj8xjGWX03-A_EpUA":{"text":"I was looking forward to dinner at Maypop. I was disappointed with the menu after reviewin","useful":0,"cool":0},"Hqgqp-T_Sgpo45IW4KtMEA":{"text":"Nice modern ambiance, quiet, spacious and airy dining room. Helpful and even joyful wait s","useful":0,"cool":0},"2X58o3QILL4P9nCWSU5dyg":{"text":"I would give this place waaaaay more stars if I could! My husband and I stopped by Maypop ","useful":0,"cool":1},"oCkokti5An-kGhOb2eFEfA":{"text":"incredible experience cuisine is hard to describe, but delicious and unlike anything else.","useful":0,"cool":0},"ms7idUTJ2Ip0v7wQlm-lGQ":{"text":"The most delicious meal I ate in Nola was at Maypop in the CBD. I expected good, but I was","useful":0,"cool":0},"STjjF7oO2aiv2OUkOQV9ug":{"text":"Stellar. I love coming to New Orleans and eating the local fare but sometimes you want som","useful":0,"cool":0},"2LXNPnv4tehUQJsVQTmAPw":{"text":"Real bad food. I'm not sure how they got high ratings. Also, the staff doesn't seem to und","useful":0,"cool":0},"uvU7vDGggjG-u9Busl4apg":{"text":"Absolutely phenomenal restaurant. The food here is like nothing you have tried before. It'","useful":1,"cool":1},"SeRC9-17W-7fAUpmfJ5N_Q":{"text":"17 and 20 June 2019\n\nThe most original and delicious food I found in New Orleans, Maypop's","useful":0,"cool":0},"z3SXVBTHz4LjHyWoenryjg":{"text":"This became my favorite restaurant while visiting New Orleans. I'm a sucker for great ambi","useful":0,"cool":0},"x4_ldNNxGj0j1zN67mP9dQ":{"text":"Think of the best restaurant in your hometown and decrease the price by 50% and increase t","useful":0,"cool":0},"sybKGgsT3w1JsXN86YYMXA":{"text":"Cute restaurant, nice ambiance.  We went for brunch on Saturday and the food was very hit ","useful":0,"cool":0},"T5EEleEH3y1fbC6p0nHFug":{"text":"In the NOLA food scene.. there are movers, shakers and space takers..\nMaypop, is a Mover, ","useful":5,"cool":0},"nMaNwPg4Bhkb350ZoR93Mw":{"text":"My husband and I had been wanting to try this place for a while, so we figured while we we","useful":2,"cool":0},"KMjHvpzJRctgcXM4CLkLJA":{"text":"Went in for an early lunch. Just beat the crowd. I sat at the bar. While I was waiting for","useful":0,"cool":0},"RtTqWTG0EHQjRWfKWXo5Mg":{"text":"I just don't get it.  Our meal was submerged in richness from the appetizer through the en","useful":1,"cool":0},"mHzd6Yg9kEDq3n06qtQljA":{"text":"Found this place via the Googles. Amazing dim sum! All we we had were the various dim sum ","useful":0,"cool":0},"ie7HrqiHj4UMgbjUJsrhFQ":{"text":"With the exception of one dish - it was all poorly done. Possibly rotten duck? Unfriendly ","useful":0,"cool":0},"6h7Zz1dVw_qtfmQolY1JSg":{"text":"After a long day of flight delays and rerouting and traffic snafus around the Saints vs Vi","useful":1,"cool":0},"f3OyHITt0Fs6_8llr9I7cA":{"text":"Enjoyed some amazing food at the Maypop Restaurant on a quiet Sunday night. Well looked af","useful":0,"cool":0},"0cMlhmnf5yy-at9FroMSqQ":{"text":"Their menu constantly changes, which is extremely disappointing. I had my heart set on the","useful":1,"cool":0},"ZLEI32JRLSdSFuzSRN6Lyw":{"text":"Great service and incredibly tasteful food with Michelin star presentation. They had just ","useful":0,"cool":0},"KavCzE9m6Hq-ojKcbrqCew":{"text":"My friends and I had the best experience here at Maypop! The drinks, service, and food wer","useful":0,"cool":0},"YwWwuD8zr71CqKIJkrTiIA":{"text":"Staffing was warm and friendly.  Love the atmosphere - open but not too big.  Great bar ar","useful":0,"cool":0},"CEqzUMRpSMI3rAs1NhirCQ":{"text":"Amazing food and an ever changing innovative menu. Had the hand pulled noodles with tofu, ","useful":1,"cool":0},"_7ZRZFy0VTeTi2BPKQ8amw":{"text":"Great waiter, Thomas, made this evening great. The food is delicate! Expect to taste many ","useful":1,"cool":1},"rk2t8uYzh9c8HdaNlSkT7g":{"text":"Awesome melding of Asian and Louisiana cuisine. The menu changes regularly and there's gua","useful":0,"cool":0},"2ZIK0C-bmHLNlxSUKikWMQ":{"text":"Saw this restaurant in an article, so glad we walked the walk to get here from our hotel! ","useful":0,"cool":0},"Vh_Tx_SjCqtbiKKetyE95g":{"text":"Typically skeptical of fancy Asian fusion. But this place was real deal. Lamb roti was gre","useful":0,"cool":0},"0x3mN50uKUbdtJwSZnSbmg":{"text":"Wow!  We have been hearing good things about this restaurant for awhile, but finally decid","useful":0,"cool":0},"0Awpj2w-ioJ2hDDv1S0P7g":{"text":"Went here for lunch when we were vacationing in New Orleans. The drinks and entrees were i","useful":0,"cool":1},"SFCuKTP3wUreC6kkdqs18g":{"text":"I really enjoyed my meal at Maypop. They were very accommodating with gluten free options.","useful":0,"cool":0},"LIQLX2PUr-l6_1Nesxs5ow":{"text":"\"Vietnamese and Louisiana food\" is what the waiter told us and my family and I fully bough","useful":1,"cool":0},"b9cgbR2M9mP7u7jIgu4siw":{"text":"This was an amazing meal. From.the amuse bouche to the dessert, everything was so good. I ","useful":0,"cool":0},"OailNe2oFQxSebEr9ZdtVA":{"text":"A total surprise!  A local suggested Maypop to us, and it was beyond our expectations.  Th","useful":0,"cool":0},"L5E_H7FjozXj91_QV8EYGQ":{"text":"New Orleans! Why is this place empty? I was disheartened to have been here during an empty","useful":8,"cool":9},"U8m2eEcEhSYwnP8DL-giYA":{"text":"All around incredible experience.  I highly recommend Maypop for those who want to get out","useful":0,"cool":0},"VLHObSRPgAsyW80W9tIuLA":{"text":"Great restaurant great waiter can't recommend highly enough if you have had your fill of C","useful":0,"cool":0},"BTciAefeAFUIGjdahBB8QQ":{"text":"The interior of Maypop is so beautiful. A very quick and easy walk from all the hotels and","useful":1,"cool":1},"D5Bc5m5ASErsZQ6OMzSemw":{"text":"Wow! \nFood AMAZING! Rudeness very high. Used to be one of our favorite places in warehouse","useful":0,"cool":0},"-QO2HoCbljg87MoSlCPLqA":{"text":"Amazing lunch!! This was my first visit to Maypop and EVERYTHING was exceptional!! The res","useful":0,"cool":0},"U5KODqu4oEtQjmOOw-BlKw":{"text":"This place is amazing. A must stop if you are ever in New Orleans! Ambiance and environmen","useful":0,"cool":0},"TwKcYFKxuqk53ddmIHKDww":{"text":"I don't leave 5-star reviews often.  This place knows how to use spices; a true testament ","useful":0,"cool":0},"xLT2J4anGKKkKutRtScWAg":{"text":"I searched Yelp for a lunch spot near my hotel but the place I intended to go was packed, ","useful":0,"cool":0},"5WtUxmIiK3uQeJ-YiVao_A":{"text":"Excellent! Dine here! I stopped in on a whim, and so happy I did. I sat at the bar, had th","useful":0,"cool":0},"bLyKwlSM0u6KMq1-FgEdhA":{"text":"Trying a new spot with my wife on a Saturday evening. We wanted a Dim sum/ Ramen type of p","useful":1,"cool":0},"AbknpmMof-L8WCfYP52R1A":{"text":"Scallion pancake, The BaoDin, and soup dumplings. This was a great lunch. Dim Sum menu onl","useful":1,"cool":0},"zUkrcCzrHCkJA8PLJl0tQw":{"text":"Everyone on the staff was pleasant and the atmosphere was friendly and inviting.  I could ","useful":0,"cool":0},"Ydbl3uoLxP4cDr7oLTHMtw":{"text":"Meh. I came I saw I probably won't be back. Food was okay. Nothing extraordinary or anythi","useful":2,"cool":1},"VW9W07AzLxKwq9fwOkGLLQ":{"text":"I was in town for work on 4/23/18 and was staying at the Hyatt Regency and was thinking ab","useful":0,"cool":0},"hhSNsb_eqdqNqCEfqyz-mg":{"text":"Definitely my go to restaurant when I'm at work in the CBD and want something more filling","useful":0,"cool":0},"Jo4qfZIxx8F_uD5KnBU-3g":{"text":"Really enjoyed this restaurant. We tried about a half dozen selections and they were all t","useful":0,"cool":0},"lOxjmdlaBgLby5Zlg55JTQ":{"text":"Excellent place for a delicious and unique meal.  They do a great job of fusing various fl","useful":2,"cool":2},"7WJTCD8W1Fk5yyNrK8GyRA":{"text":"Great brunch and hangout.  The \"Hot Chicken on the Biscuit was a knockout. Dim Sum dishes ","useful":0,"cool":0},"FOFmL3Tw5U5GTqne-qD3OA":{"text":"The Buttermilk Fried \"hot chicken\" in Vindaloo Curry was delightful.","useful":0,"cool":0},"Ke1f-Q9und8D_4ZKWG4aWg":{"text":"Beef in the entree is the best. Duck and Thai tea are good too. Dishes in noodle section a","useful":0,"cool":0},"LsTzQG3-iks4uZUL2YjMEQ":{"text":"I don't even know where to begin with this one. This was my second time trying this place ","useful":0,"cool":0},"XMc_Q6Jo9BpM6lpmSbFSkQ":{"text":"Creative food and atmosphere! Potted plants populate the walls throughout the restaurant, ","useful":0,"cool":0},"FIqSq0xNVPrEf2SYG7MGEA":{"text":"2 words....effin excellent!\n\nOysters: great. Salad: fantastic. Chicken Vindaloo: lovely. C","useful":0,"cool":1},"xIO5m8PDAtbJizaA4tVTBQ":{"text":"The service here is great and so is the food. We both had the delicious chicken biscuit. T","useful":3,"cool":0},"r3W5hSPPnrd_-RmQqIRkrw":{"text":"Wow. We loved it! The food, the service- all outstanding. I am a chef and I highly recomme","useful":0,"cool":0},"19Pt0hcyYL5YFGG_1KlTfw":{"text":"Possibly our favorite place on our trip to New Orleans! Amazing food food beautifully pres","useful":0,"cool":0},"nyj_8pj1DKqKmnGplz6GFw":{"text":"We weren't sure what to expect when we decided on Maypop, but were very delightfully surpr","useful":0,"cool":0},"U7DrdqJ9StMnbxtSGZvqXQ":{"text":"What an incredible experience.  The lemon fish appetizer was so amazing. The flavor combin","useful":1,"cool":0},"aCXX69JBkZw_Jlj8AK0DhA":{"text":"My first two minutes in the restaurant had me worried but the meal turned out nicely. I ca","useful":0,"cool":0},"aiGMXPJhmEte3KlkWQDHNg":{"text":"Great rendition of Nola with a twist of the Asian flare. I actually liked it more than I t","useful":1,"cool":0},"Cr_TtmFvKllVbVejXDo4Vg":{"text":"We came here for lunch because our tour guide said it was really good. We order two spicy ","useful":0,"cool":0},"OBKYjdaa9Zx-lDcf1pl6eA":{"text":"Delicious food, great service and very accommodating staff. Although not a place that is \"","useful":0,"cool":0},"zuxurWiE8Pt3hUhp8McZzw":{"text":"I need soooo much dim sum in my life. New Orleans has been a challenging place to satiate ","useful":18,"cool":16},"tWAGczYUZ-dMCit17yWY-Q":{"text":"With its shelves of jars filled with fermenting vegetables and a dry aging space for prote","useful":11,"cool":9},"hNenuYRest0fMt5ug67rLA":{"text":"Once I crossed their threshold we were welcomed by helpful and knowledgeable staff.  We, C","useful":1,"cool":1},"KuUI7cfss-fu85pgXYTolA":{"text":"Fan.\nGood drinks, apps, entrees, staff, and customers to chat with. \n\nI actually wasn't go","useful":1,"cool":1},"hGBViMGoSbvGKtTb1za_ng":{"text":"Amazing. Had the beef belly and the hand noodles. Brought out a complementary appetizer an","useful":0,"cool":0},"lIiDnh7zPSyGzSL15T4JsQ":{"text":"Great atmosphere and the food was ok. Not sure how Maypop got 4.5 stars but at most, I wou","useful":0,"cool":0},"p9w6NiQ3IinA6HqFLnKuEQ":{"text":"I loved everything about Maypop, from the food, decor, and service. Nothing to complain ab","useful":0,"cool":0},"cIkRLGnfwFTPihoIaeUsaw":{"text":"This restaurant is excellent!  The entree's offered were really good.  \nWe enjoyed the gul","useful":0,"cool":0},"AT5pbRMmtI8UOP14Ii3GFw":{"text":"My partner and I had an absolutely lovely experience last night! Our server Matt was on po","useful":0,"cool":0},"Q1XiRIMAVHaRLz3Ig1g9Bg":{"text":"I came for a early dinner \nI guess we were almost 1st and 2 th costumer for dinner \nIt was","useful":0,"cool":0},"W0zMkiLpkyOxXDvBn9Fvtw":{"text":"I was very excited about coming here and wanted to love it. It's pricey, you don't get a l","useful":1,"cool":1},"G2bxoa3UrlomuyU-TXNMdQ":{"text":"This restaurant had SUPER weird items on the menu. I wasn't for sure what to expect. I mus","useful":0,"cool":0},"8PYTabds2ydzN9Jjoga1fg":{"text":"Excellent service, great food and drinks. Will definitely be back. Lemonfish app was aweso","useful":0,"cool":0},"uOcNu7OYF-8zrhTHHvNbRA":{"text":"Just popped in to try out something different.... happy dance! I truly enjoyed my quick bi","useful":0,"cool":0},"U7H2bL5Mj2E_IG8Ztscw2g":{"text":"Enjoyed coming here on a Sunday around noon. Place was busy but not overly packed.  Great ","useful":0,"cool":0},"MouqLk0jsbyzsiYRqVpZZQ":{"text":"Went to New Orleans to visit a good friend and happened to stumble upon this place.  Very ","useful":0,"cool":0},"mCGr8vsm35z9Xg8mFBxiCA":{"text":"This is my second review of Maypop; again the chef and the staff gave us a night to rememb","useful":2,"cool":3},"uEsdxGBO8X0BhAtXcTRzYg":{"text":"Great food!  So inventive and creative!  The combinations are so unique and unusual, but s","useful":0,"cool":0},"8q2m6ouUDxsczouDj5XjKg":{"text":"Just by accident we found this place close to our hotel. I had the fried chicken in vindal","useful":0,"cool":1},"5KhE-0jP8RZetjvcU0LGLw":{"text":"Nice space and typically not overcrowded for lunch. Their chicken and lamb dishes are my g","useful":1,"cool":1},"TvrmapF5BvEJhkwB4JXTPg":{"text":"Consistently outstanding.  Service, bar , kitchen, value are all top notch.  One of my NOL","useful":0,"cool":0},"PZmABdWGrsYEZmqZoHifUA":{"text":"First time here visiting MayPop.\nPrior to coming we had planned out what we'd get but lear","useful":0,"cool":0},"LxG7B4zH6U3Q-563zTVfNQ":{"text":"Got in and got seated immediately. Wait staff was impressively good. We never spent any ti","useful":0,"cool":0},"fftsR_K9Vjn2AZkVRAT8Ew":{"text":"So Fucking bomb just go! My gf and I are foodies eating at multiple restaurants a day and ","useful":0,"cool":0},"DqpCLZiZA3_-DzDCZmO5lw":{"text":"A very elegant space. A very elegant experience. Not what I expected from advertisement an","useful":0,"cool":0},"-gDlnnVCQeBy9nOS_S8POw":{"text":"This is a newer-trendy places located in NOLA CBD.\n\nNice spacious bar and some very appeti","useful":0,"cool":0},"HULKAkZA583xdqvjEDwJyQ":{"text":"Me: \"So, where is the chef from?\" Michael, the waiter:  \"He's from New Orleans, but his gr","useful":0,"cool":0},"prYAZPoIfsbR9drai1V0yw":{"text":"This was a fresh take on traditional New Orleans cuisine. The Asian flair was unique and d","useful":0,"cool":0},"XGpA0JHhkMfcLqo78Kc2WA":{"text":"I'm in love with this restaurant!! Fantasy Asian Fusion food, tasty, flavorful and beautif","useful":0,"cool":0},"-hPAjTo8zUfJlKAEKs1NAw":{"text":"When I first realized it was Asian and southern fusion I wasn't sure I was going to like i","useful":0,"cool":0},"GM-AuKRo3a64-JoAiKqJNw":{"text":"This is a truly exceptional restaurant. We wound up eating here twice in our weeklong stay","useful":0,"cool":0},"GRSk-hxmRNEJr2lorsMCag":{"text":"Food was good, not great. Service was excellent. Alcohol prices were LA or NY high. Not wo","useful":0,"cool":0},"9iROdurveKTdgHEN92ayYg":{"text":"Excellent service and presentation.  Lindsay is a terrific waitress.  Knowledgeable and so","useful":0,"cool":0},"nIOE6av05jsV1qvbukmkVw":{"text":"I went to happy hour at Maypop and had a blast! The service was excellent the the atmosphe","useful":0,"cool":0},"KpBfN17BcHuae-V8lR2Maw":{"text":"One of my favorite restaurants in the CBD is Maypop - their menu is super limited and seas","useful":1,"cool":0},"UrGNGLXC6LxmFAq9MDGLTQ":{"text":"The absolute BEST and my personal favorite happy hour in the city! Their drink deals are t","useful":1,"cool":1},"5-DuTXloVh3mVYbKjNJHCA":{"text":"Went there for dinner on a Tuesday night with 3 people at 6.30.  We didnt have a reservati","useful":0,"cool":0},"2OCSQKnc1AxPp-Fh2iAUYA":{"text":"I was really looking forward to this place because I really enjoy the sister restaurant, M","useful":2,"cool":0},"RTvBJLREg-160nJRurOHUg":{"text":"A very urban flavor decor yet very relaxed little restaurant in the CBD. The menu can be i","useful":1,"cool":0},"EE2iIYAlWczxXbjaWcEXlQ":{"text":"One if the Best calamari dishes I've ever tasted. This was my first time having dumplings ","useful":2,"cool":0},"cb9l2sWb3NQLfUirrX8cdg":{"text":"probably my current favorite restaurant in nola. located in the central business district,","useful":2,"cool":1},"kctehYFU1hNXGimSBQtOEA":{"text":"A group of friends and I make a yearly pilgrimage to this lovely city to fly fish and eat.","useful":0,"cool":0},"rzePIUbMr5dnU00TOW63UA":{"text":"I hated 1/2 the food there, yet loved the other 1/2. Since the menu changes so frequently ","useful":0,"cool":0},"cOtMcQuJM9nzlS6HMaCkXg":{"text":"Excellent service, great vibe. Menu is not extensive but offerings are varied and food is ","useful":1,"cool":1},"mY1PJS0E56kZ2a9Oc09kXA":{"text":"Delicious!!!  Loved the salad, fried oysters, duck and lamb. Bread is great as well. This ","useful":0,"cool":0},"oiZeRuk1dS1SovOhJKI_Yw":{"text":"we came in late afternoon. it took us a long time before the waitress give us water and th","useful":0,"cool":0},"3j2rekQ-D4EGGbXgrqJjyQ":{"text":"One of the best meals I've ever had. I've eaten at many restaurants but wow this place is ","useful":0,"cool":0},"UY6fRskOz5gs743crlvgdQ":{"text":"Had a great time here last night. I got there a little early before the rest of my table s","useful":2,"cool":0},"P0AV4CkG33sy4NAXQN7w8A":{"text":"Such a great recommendation from Rebecca W. This was my favorite meal in NOLA.  We came fo","useful":23,"cool":21},"s6vKmxYNf-n6pF6sL_UQCA":{"text":"Tough, they probably are a 4 star place but my initial visit is 3.  As much as i liked how","useful":2,"cool":1},"6FuAteJcde_IDyvNy77L1w":{"text":"This is the best restaurant in NOLA so far. The taste is sophisticated in delivery and bal","useful":0,"cool":0},"0fSvxySAGWFhYQsd5mhrTg":{"text":"On top of having a wonderful work week in New Orleans, my coworker and I had such an aweso","useful":1,"cool":0},"DxAOHv6PDgV8a8PF_uLqsg":{"text":"Man I love this place . The atmosphere is cool and the staff is friendly. The menu options","useful":2,"cool":1},"S1FSTn8gk4jGKfI4ZiL9Kw":{"text":"Seriously a 5 start restaurant. My boyfriend and I decided to sit at the bar and Tony took","useful":0,"cool":0},"63_usSmHsbgojapZxjp-Vw":{"text":"Shari V and I ate here on a Sunday night.  Early dinner made for an easy reservation.  \n\nF","useful":4,"cool":0},"iOlI_8KzgEGy7HOoj0OvxQ":{"text":"My experience at Maypop was so bad that I had to come out of lurk mode just to let others ","useful":2,"cool":0},"7xnMT1tEMQ9mx1QAoysy7g":{"text":"Love this place!! Very unique food and great environment. Went for a work lunch. The cockt","useful":1,"cool":1},"DVBEXKNsnVW_hBMClanNeA":{"text":"Went here fall of 2018 and we are still talking about it. Love the ambiance. Haven't been ","useful":1,"cool":0},"Qs7igzh7G2ZDYWKKFyArfg":{"text":"I would come here every day for the Bibb lettuce salad! The perfect amount of heat from th","useful":0,"cool":0},"AIwG2zOZWGDF1M1njYSJyA":{"text":"Read great reviews here and decided to pop in for late lunch in between business meetings.","useful":1,"cool":1},"A4SYa0cKpoNDXVxB9wJwEA":{"text":"This place is when Chinese dish meets creole cuisine fusion. The food here was very well t","useful":1,"cool":0},"jY7lDqx6sC89I77BSXknug":{"text":"Fantastic!  This is great Vietnamese food.  Fried oysters app is super.  Fried chicken vin","useful":0,"cool":0},"VSldD8CFYbkEB4ljhq_r8w":{"text":"The food and service were excellent! Although they do have a limited menu, everything we o","useful":0,"cool":0},"LeRxES-u6uaONnS15S85kA":{"text":"Maypop's atmosphere is chic and charming. The food is unique and delicious. The warm buns ","useful":1,"cool":0},"75Xv8R-6LNS-oIGStvsiDA":{"text":"I can't believe we waited so long to try this restaurant.  We were blown away.\nWe ordered ","useful":1,"cool":0},"vmu-ot5UJrEt_Y7el49FzA":{"text":"Very good! I was a little skeptical because it seemed a little outside my comfort zone but","useful":0,"cool":0},"lFnaHbvMATQd3OXxyA--zg":{"text":"Came here on my birthday (Friday, 10/18/19) for lunch. The dining was nice and cozy. Not t","useful":0,"cool":0},"qDMMjPkWOWSFU9Z0C8iblA":{"text":"Excellent meal. Service was good, food was outstanding. That Bibb salad was probably the b","useful":1,"cool":2},"VHe3fpo0h1V5poKrY2tItQ":{"text":"I wish I could post pictures and rave about how great my experience was. But unfortunately","useful":1,"cool":0},"o8Gz4lx5HM_E1hNieMu3jw":{"text":"So this place had a lot of potential. The staff was so friendly and accommodating but the ","useful":0,"cool":0},"kW-GySQt0R0Zkp0L_dhIoA":{"text":"Maypop was the my least favorite meal in New Orleans on my previous trip.   I am not reall","useful":4,"cool":2},"Bhyb1E5amm-Kvg3llbtLRA":{"text":"Big Yelp letdown, not a 4.5/5 star restaurant.  Has a nice atmosphere, but overall not wor","useful":0,"cool":0},"aoG_KmEeh_iMuS4FQInDwA":{"text":"I went on a date here last Monday night and it seemed to be a pretty slow shift. We were s","useful":5,"cool":1},"5d1TtkTNet2QkcSmwMDY_A":{"text":"At first glance the menu seems odd and somewhat anxiety inducing.   But after two meals he","useful":0,"cool":0},"cG5qJrCkrp9KhTabg5P9Iw":{"text":"First time here!  Everything was delicious. They give you a small Appetizer that is like f","useful":0,"cool":0},"rzMCOE55c-Hyhawdhf-q1w":{"text":"Such an avante-garde approach to marry southern & asian cuisines! Make sure you visit for ","useful":0,"cool":1},"qsSojHRMVhedI4gVxy5MzA":{"text":"It heard a lot of great things about the food here so I wanted to go give it a try. I have","useful":4,"cool":2},"NVC4QuQUzdB3jre4FPWPBg":{"text":"Maypop is truly unique and innovative.  The weekend dim sum is spectacular.  This is a gre","useful":0,"cool":0},"QFFlI1sojD4V4Ql3pZ0xvg":{"text":"Portions are small, but everything was bursting with flavor. Service was excellent and mad","useful":0,"cool":0},"ltj7VXM4DefgyeqSX_wDzA":{"text":"EVERYTHING is awesome. Sometimes I'll read then menu and question what I'm even reading, a","useful":2,"cool":0},"PPjodnyteaRNGXTqN8VuLA":{"text":"First of it's all amazing! I would give this place 5 stars based off just the butter that ","useful":0,"cool":0},"EsXHbDlVHVQ7UM9tnFGcgQ":{"text":"First time of future many's! I absolutely am a fool for atmosphere and they definitely don","useful":0,"cool":0},"R2RPd1mwOJVgtokF04HR2Q":{"text":"Maypop POPS! From happy hour to dinner hour, the food is spectacular across the board, as ","useful":0,"cool":0},"rNjQ7flcPWyjI5ocnl7Q7g":{"text":"This place is breaking the mold in the culinary world. The way the chefs have created a me","useful":0,"cool":0},"ovF2Y1e6RRCrIbblf65f6w":{"text":"The best meal in NOLA! Seriously, ahhhhmazing!!!\n\nEverything was so delicious and good siz","useful":5,"cool":3},"aplDidXaVzfxzhmCwWop1A":{"text":"I would say the best restaurant in a whole Louisiana! The dishes were exotic to taste, the","useful":0,"cool":0},"Jatwr_nSlyX4phNGq-zSXA":{"text":"Expected to like Maypop more than I did. The flavor profile just wasn't for me, but don't ","useful":6,"cool":0},"doxxsf4y9uk_vmn-CamLLg":{"text":"Wanted to try this after reading the reviews. What an amazing fusion! All flavors on point","useful":2,"cool":3},"0hanadZxgKaD-73ysfiUfQ":{"text":"When I saw the description of the restaurant included Dim Sum, that was my original desire","useful":1,"cool":0},"ofDN5aOh7alNBuDHsit0Eg":{"text":"Absolutely epic experience. Passed on several NOLA institutions to eat here multiple times","useful":2,"cool":0},"9ifWozCTwDNdhca4z53gkQ":{"text":"Amazing atmosphere, service, and sensational food. Went with large group so we shared diff","useful":0,"cool":0},"ElmxmEP3xbUWpt0JyNBySw":{"text":"What a wonderful stop on my trip to New Orleans! One hop, skip, and a jump from the door o","useful":0,"cool":0},"apR5UUK6tiH9v5XWNdGC5w":{"text":"From the outstanding/creative dishes to the decor inside, everything was impressive. Came ","useful":0,"cool":1},"-__2NIVQLPAWeemxDCwcuw":{"text":"What a great break from the French Quarter food scene! Nothing wrong on that side of the s","useful":2,"cool":0},"xQ9_ahHmk5ZtHNZLwFhjuQ":{"text":"I ate at Maypop for a friends birthday and while the restaurant was gorgeous, the waitress","useful":0,"cool":0},"8iFbnYWKch197BQT9Tz4TQ":{"text":"This is definitely a jewel located in the warehouse district, downtown New Orleans. Me, be","useful":3,"cool":1},"1ZYVZt1-d4g65IOEbJqK-A":{"text":"They made the ultimate sin in cooking pasta; noodles were in small pieces.  It was as if t","useful":0,"cool":0},"Y9RXjBAp-GOnPoAJsxwx9g":{"text":"Drunk guy wants to fight me for fishing! \n\nWe tried to make a last minute stop at Willa Je","useful":3,"cool":2},"Kuf3KrlfQZ4HAH7i0X84Mg":{"text":"Firstly, I sat at the bar and was served by the humble and lovely bar tender, who went by ","useful":0,"cool":0},"PADx_ygSYWXE5gv6Gsptew":{"text":"THANK YOU MAYPOP for preparing the best suckling duck I've ever put in my mouth. It was in","useful":1,"cool":0},"2KtP9bq5D-mg-giN9sGTMw":{"text":"Boooo...I had such high hopes. \n\nThe restaurant is beautiful with floor to ceiling windows","useful":2,"cool":0},"lmF4Wtq3XAGDmGxyW4l-mQ":{"text":"Came here for my birthday with a party of 10. The whole reservation process was relatively","useful":1,"cool":1},"M6rnRqx-cf9e2wKvkqqa_g":{"text":"Gosh, this restaurant simply took my breath away. I was so excited to dine here because I ","useful":10,"cool":8},"rLUDpjy_SuBX_vcb3CKCKw":{"text":"It's been many months since I visited this place on my new orleans trip, and I'm still cra","useful":0,"cool":0},"qYhLBtCo7h565jXfEZyAQw":{"text":"Came to check this place out because it was a local favorite! The love the decorations her","useful":2,"cool":1},"KmXPwiVaZh5Cd-qPsterDQ":{"text":"While the food was pretty good, the service was NOT. Our server was Jacqueline and it just","useful":0,"cool":0},"7oiljYnbYMni8UnkjRlZ2g":{"text":"Modern fusion dishes that plays off traditional South East Asian flavors. I appreciate fus","useful":0,"cool":0},"pHIp-eorMJ3pMyQLzEHNZw":{"text":"A little pricey but very worth it! I'm not a fan of Cajun food, but this place put their u","useful":0,"cool":0},"NafiKSvXuxKodVZXSbqM_Q":{"text":"Upon walking in you'll be surprised with an elegant and vibrant atmosphere. Great place to","useful":0,"cool":0},"SFAbWhENU4XbkUt6P-xxSw":{"text":"Food is amazing! Great atmosphere and love the restaurant. We're visiting from Dallas, TX ","useful":0,"cool":0},"bbqQtFGbU7eYbNartGKOWQ":{"text":"I really wanted to love Maypop. The menu is thoughtful and innovative. The interior has th","useful":2,"cool":1},"oDUilah8MmX6s_wh2umHjw":{"text":"Great food, really interesting flavors (in a good way!) Server was friendly, service was f","useful":0,"cool":0},"z2F8uh8hquQvijGu4vpBqg":{"text":"This place surprised me. I was a huge fan of the appetizers on the menu but not a big fan ","useful":0,"cool":0},"I5qIi6-yGUXa1y8L0doeHg":{"text":"Wonderful spot for fusion brunch in New Orleans. I'm definitely more impressed with some d","useful":1,"cool":2},"92pzl140_k76e-fseqHKrw":{"text":"Delicious and creative dishes and cocktails. Fun to have a more globally-focused place in ","useful":0,"cool":0},"TZlDkW24K5rwiFX29f9Amw":{"text":"Just wow.  As someone who grew up in Louisiana, I've had the best jambalaya, gumbo, red be","useful":1,"cool":0},"l8ChoR1n1wli5FbphD-ymQ":{"text":"I have to give this place 5 stars! From the treats Chef sent out at the beginning to the e","useful":1,"cool":0},"iTULnq2lZdDSjqnGc3kFbQ":{"text":"Wonderful place! We were able to sample several appetizers including the fried oysters and","useful":0,"cool":0},"wPGiqUctp0WLZwKDfOWV0w":{"text":"I don't even know where to start. Maypop has been on my list for a while, so when I saw th","useful":22,"cool":15},"P1yb6asm3Kr7bHZWqkaqzQ":{"text":"This is not your typical New Orleans restaurant.  This is very good Asian fusion with just","useful":1,"cool":0},"C7Q9r5IzxuyiXmVEqQKnqg":{"text":"I've been planning to come to Maypop for a while and I finally made it. My boss took us he","useful":1,"cool":1},"TF2mP1XholEcCWbZkqpghQ":{"text":"Probably the best food in the entire city. Hands down. I've lived in New Orleans my whole ","useful":0,"cool":0},"TfbQWbQ2rouL-pk_NAYHCQ":{"text":"One of NOLA's top 10 restaurants in 2019.  I visited Maypop for lunch with a co-worker.  T","useful":1,"cool":0},"ZlFtRdBo7HN1TFmyq8rjkg":{"text":"Pretty awesome place and location. I decided to eat at this place as a reward to myself. T","useful":0,"cool":1},"_MGYpXkh1m47dCKVWN41Wg":{"text":"Tried this restaurant on a Saturday evening- didn't have a reservation so could only do ba","useful":0,"cool":0},"wTyKFRqGtL9vYe7qwJQQQA":{"text":"I love trying new things and this was just the place to do so. It's a bit of nicer, more f","useful":2,"cool":0},"H_vIk5aX3O76YMu45xAzRA":{"text":"The decor is really nice and modern. The servers are very professional. The bathrooms are ","useful":0,"cool":0},"6q-ux7mSOfEGA6MGSFjlkA":{"text":"I always make sure to visit Maypop before attending sporting events or concerts in the are","useful":0,"cool":0},"No23Ywr7p2j-GA131Vqqlw":{"text":"Another amazing evening at Maypop. Genius and delicious food.  Great service.  Never disap","useful":0,"cool":0},"MSpC8u_Phv0ACn5ZJknlBg":{"text":"The most incredible meal I've had in a while. The flavors really do all come together as o","useful":0,"cool":0},"PDvdqWBhqnV1fsJ1T7XZng":{"text":"Since my last post about Maypop, I went twice more. Once for a quick bite and tried the Sw","useful":2,"cool":1},"dqD5vTu6gM6weydUqpIq2A":{"text":"Food was excellent. I had the lamb roti. My husband had the buster crab. Both delicious. T","useful":0,"cool":0},"FzZqC3uzmwxHbFJYrxH25A":{"text":"CONCERNED BECAUSE I WANT IT TO SUCCEED\nI'm impressed by Chef Gulotta's earnest intensity, ","useful":8,"cool":4},"DsZROWc4XHPbQJ2sbtiV5A":{"text":"If you are looking for something unique and surprising, head over to Maypop. I didn't quit","useful":1,"cool":1},"nUBFDeNXcbQD9jyPzBWPqQ":{"text":"If you're visiting New Orleans, then this is an essential restaurant to hit. EVERYTHING he","useful":0,"cool":0},"yNNfeoB8rrG88b65pBZ_Ww":{"text":"Wow, Maypop restaurant was a mind-blowing experience! Maypop was highly recommended by our","useful":4,"cool":3},"Hz5iAgUKfv3AcxNUY7X0xA":{"text":"It basically mix Asian food with American good, which is really strange. The sauce is salt","useful":0,"cool":0},"AJ1ZehH0LHRPpFNivbfcoQ":{"text":"We were really interested in this restaurant because of the Italian/Asian influenced menu.","useful":1,"cool":0},"3vFwP9XXvCUB8RJLs_nAig":{"text":"Tasty food, polite staff, great service! \n\n\nMy colleagues and I went here for lunch while ","useful":3,"cool":2},"3qzV8oqvfwZdbyxsfvhgCA":{"text":"Missed Maypop!!! One of my faves pre-Covid so I was so happy to see it re-opened- We liter","useful":2,"cool":0},"DPGi2NhPle_xdil45jzApw":{"text":"First time here and it was great. Only issue was what was on the menu before no longer bei","useful":0,"cool":0},"hdCaPTU1vCtQ_CRsQbdtlw":{"text":"UPDATE:  Back in New Orleans a year later and I had to get back to Maypop for happy hour. ","useful":2,"cool":1},"B1SohV-gt1KG4o_0NQYgWA":{"text":"Swanky ambiance, cute restaurant, pompous service, contemporary menu, NOT dim sum as noted","useful":9,"cool":9},"0x55ZHr6LDbAnFCz2lrWCg":{"text":"Tjis is the last restaurant I got to try in New Orleans before the serious Covid-19 restri","useful":3,"cool":2},"bSESYXsWH5VZW_Bo5cwIuA":{"text":"To start we ordered the Bibb salad. It had a slight curry flavor. It has mint and sweet dr","useful":1,"cool":1},"WUZ0QR8AbSvaW_hYhupePg":{"text":"It was an absolute incredible experience. We just ADORED everything we ate. The service wa","useful":0,"cool":0},"FGvcZ0Iu8fR1sJi16tRrGQ":{"text":"So, the amuse bouche and the chocolate at the end were both amazing, but the entree I actu","useful":0,"cool":0},"In7MgSYk2lTzeEOkadyDWg":{"text":"LOVE LOVE LOVE \nMe and my fiance fell in love with this place as soon as we walked in the ","useful":0,"cool":0},"pUkri8wp4N3dKRKTmQuLnQ":{"text":"Maypop was delicious and very unique. It's a bit of a twist between southern and East Asia","useful":1,"cool":2},"Cw-Qojh1O0WCiH-zvWFqqw":{"text":"Awesome!  Excellent food, superior customer service, inviting seating area.  Ms. Laurie an","useful":0,"cool":0},"BxTvqQe2-aTzpAqfSf8ThA":{"text":"Ok. So I am very glad I made this a two visit review. I might have given it four stars yes","useful":1,"cool":1},"GsL9pIf_wAaKku9-u1kXpg":{"text":"Me and my family went to Maypop and the menu wasn't what we expected. The food was differe","useful":1,"cool":0},"t6Ou7nuwoL4zSXKusS-H9A":{"text":"This place is absolutely phenomenal!\n\nWe went as a party of 2. Ordered the bread service, ","useful":0,"cool":0},"pvBDkrAKl5kiZ3xsXYpfgw":{"text":"All I can say is this is the first truly original menu (done extremely well) I've come acr","useful":1,"cool":0},"UfTfUDyO6HV2SMrEpsSOfQ":{"text":"We have wanted to try this place since it opened  as we are fans of MoPho in mid city.   W","useful":0,"cool":0},"GofXrqqPnJZilkcCf2Nz-w":{"text":"Didn't know what to expect with Creole / Vietnamese fusion. Turns out it works pretty well","useful":0,"cool":0},"LscKCdl6pg8MXe5jTQyKRA":{"text":"Stunning, incredible meal from start to finish. We were lucky enough to get eat with our f","useful":0,"cool":0},"eCJ0PEXHMaMt0LoGrHQj1g":{"text":"What an amazing experience! My husband and I had the pork belly bone marrow, the lamb stir","useful":0,"cool":1},"u_JeeXcAZt2miRNLbF5F_Q":{"text":"This restaurant is lovely! Went here for a lunch while I was in town and was absolutely bl","useful":2,"cool":2},"ZPzWMpnKm4jCJgxBieBMRA":{"text":"Wife and I wanted something different for dinner,  ran across this charming restaurant.  W","useful":0,"cool":0},"1KJVgcPe-jZ_ymzUisPQAw":{"text":"We went on a Monday night, not thinking we would need a reservation. Boy was I wrong. They","useful":3,"cool":1},"IVCF2ShN8f0kRsPRhJgdDw":{"text":"*Overall experience: 7/10\n   -went during afternoon on a Saturday, it wasn't packed which ","useful":1,"cool":1},"QCZfsQDYMAiNoYuke1baeA":{"text":"The service is superior. The dish is memorable. Loved the bone marrow dish and noodle with","useful":0,"cool":0},"jJ_71R8-Pq0yUN6WqbWG4w":{"text":"10/10 recommend: the bone marrow was so good I didn't even have time to snap a picture bef","useful":1,"cool":0},"DNGq8y7nu5vy2k99vtyJag":{"text":"Wow we were so excited to find out about their reopening-have been missing their awesome f","useful":1,"cool":1},"zDCZXZXubTy7erULC1mHCg":{"text":"They seem to have different menus everyday or something. All the food on the menu is diffe","useful":1,"cool":0},"ttFmJlf4sGvsHA0Q76h4gA":{"text":"We had a service issue here, but other than that we enjoyed ourselves on both visits.\nThe ","useful":1,"cool":1},"Q856re7S3LxwON0HxP7LRw":{"text":"Hand pulled noodles - best dish I've ever had. Thank you. Every bite was different and mar","useful":1,"cool":0},"l54iDE_eNcTZfuCLSy0zsg":{"text":"I was so excited to try this place.  It was close to our hotel and the meals looked exciti","useful":8,"cool":3},"U6tUQ-81Tes3o0AtPQ7l6A":{"text":"I lost count of how many times we have been here- but just had to say- we have never been ","useful":1,"cool":1},"_WoInDSILR8fJgX5ONgsGQ":{"text":"I will start from the bottom up. My daughter and I arrived and there were two other people","useful":9,"cool":2},"BoHbtNl6GRdh_JsH5EtswA":{"text":"After meeting Chef Gulotta at a Dinner Lab what feels like a million years ago and loving ","useful":1,"cool":0},"IYmeoztMBpGbv9k_88-SRQ":{"text":"SPOT IN!!!!\n\nFirst, I made a reservation and the staff called the day before to confirm...","useful":2,"cool":1},"IZCteAxa4uqM4yvC32F4Kg":{"text":"Perfect in every way. I've come here for lunch twice now and I think about it all the time","useful":1,"cool":0},"D58GaknTAvDnzzVWF2p98w":{"text":"I have always been a fan of maypops happy hour for this cucumber dish and their pork belly","useful":0,"cool":0},"kIFfHycUqjkRgnkL6kCDjQ":{"text":"The food was out of this world! Great service! I'm not one to truly care about the bread a","useful":0,"cool":0},"xYJxkbfeWhb0ci5WU8jw-g":{"text":"The service, attentiveness from the waiter was a 100% beyond my score. OMG! I order the pa","useful":0,"cool":1},"nqTeTpZkzMQiE9Omrsc0rQ":{"text":"What a fantastic addition to New Orleans Central Business District. Maypop is one of the r","useful":5,"cool":3},"SZ-YsHIh_BO9krU-WSSKMg":{"text":"Yeah, I don't know what to say about this place other than:\n1. Go here.  There are a lot o","useful":2,"cool":2},"Sj5q8UcWy6iP37HC4Hdisw":{"text":"Omg. I don't even know where to start. This was by far the best food experience I had in N","useful":2,"cool":3},"Qz1NBJhi8knuHmhXL9eDUQ":{"text":"This might be a 4 star restaurant and my wife loved it but mine was mixed for sure.  They'","useful":4,"cool":2},"bZGvmJVMKOgXfIYOLRia_g":{"text":"Maypop Restaurant is open all week long for lunch, dinner, and even happy hour, but person","useful":5,"cool":0},"CMm90Uo0OoO7mXpDhAFxsA":{"text":"The food is good, some things are much better than others. The portion sizes aren't bad. T","useful":0,"cool":0},"Xxdq-E5I-nQmMZ4ZO-b6iw":{"text":"In a city filled with amazing bites, dishes, and drinks, it is possible that the best dish","useful":4,"cool":0},"mOeQLT1geEv1HCwPp_Ko3A":{"text":"Michael Gullota can do no wrong in the kitchen! Already a huge fan of his other restaurant","useful":3,"cool":3},"oeHMSIYHUknYTwdSO7kr7Q":{"text":"Very cool concept: Southeast Asian meets Cajun.  Love it.  Start at the cocktail menus whe","useful":0,"cool":0},"zwFVAFELT5Pe2XaIAcdWCg":{"text":"This is definitely an interesting restaurant with a menu that has pan-asian flavors while ","useful":2,"cool":2},"yd9MAM5gqpR-S15GSHB92w":{"text":"Wow! What an experience! Our server Justin also made this dinner experience memorable and ","useful":12,"cool":10},"WUlPC8GTUVzCNHw0msvwUg":{"text":"Sometimes I feel like fusion restaurants can be hit or miss. This was definitely a hit! Th","useful":1,"cool":0},"MZfnz448Z9y3K1I2c4c3gw":{"text":"Chicken vindaloo and swordfish were amazing. Refreshing change from the standard fare on b","useful":2,"cool":2},"0zTmaRl9Bgcg5buwd0t5Kg":{"text":"I really enjoyed my time here. We went for happy hour and it was worth it. Also, our serve","useful":1,"cool":0},"pYVudIrTNEt8rgoTDNVVjw":{"text":"I had a wonderful experience here having dinner and catching up with an old Tulane pal whi","useful":0,"cool":0},"N8Wxwa0xdPUrDZTx4td0GA":{"text":"Seriously the best...food is unique and savory.  Menu is short which tells you the chef sp","useful":1,"cool":0},"9alNdRYAex6BaUqDctFVow":{"text":"It takes a lot for me to stray from delicious, more traditional dim sum where the carts ar","useful":0,"cool":1},"iS0QdosE9TfuN_9WcbfdUw":{"text":"Great service, nice atmosphere! I had the roasted lamb belly pastrami, by far it was the b","useful":7,"cool":7},"TkRZG4Ews_yZWdpqIxaJvA":{"text":"Sorry, friends that threw recommendations into the ring...on this brief visit to Nola we H","useful":9,"cool":3},"8oW11r5l1d0mKy8sArcfPA":{"text":"Went here recently for the \"dim sum\" brunch they've advertised pretty heavily and wasn't t","useful":1,"cool":1},"cIgW2b7F9csXQ4LvxrPSBA":{"text":"If the bartender has a DNA-twisted cocktail mixing spoon running the complete length of th","useful":2,"cool":1},"2nPzr3E7OCk3npgiSG6d5g":{"text":"Limited menu as they'd only recently reopened.  Didn't matter.  It was the exact same mast","useful":2,"cool":1},"lvqkFZyyEbdr1EYuifBPug":{"text":"We had a great time at maypop. Our waiter. Jonas. Was exceptional. Helping us with the men","useful":3,"cool":1},"W7D8EyaD4UBRP7wNrrq7Og":{"text":"I've been here for lunch, dinner, and dim sum. Probably eaten everything on the menu and I","useful":2,"cool":1},"OkLoUwH5U_IIwmEOnpCycA":{"text":"I actually found this restaurant through a friend who works nearby and raves about it. Onc","useful":1,"cool":2},"EDKEUhMepmhSvIriIGLStQ":{"text":"Maypop leaves me in a review quandry...\nEdgy menu, edgy decor, but on some dishes they mis","useful":1,"cool":1},"VfIy7gbPIGD98g_uhVfyrg":{"text":"I'm pretty obsessed with their sister restaurant Mopho so I had def hyped myself up for th","useful":3,"cool":1},"WC2N6SpWSkpFgB-Myh_Y4Q":{"text":"Super lovely spot for Asian flavors mixed with New Orleans cuisine. I was able to eat here","useful":2,"cool":1},"kSI3rFXPn33CvTW4bOqiqQ":{"text":"Let me start by saying it's almost impossible for a seafood heavy menu to get 5 stars from","useful":5,"cool":3},"pYw3je41qFegff4hkrPOag":{"text":"Had the worst experience here because the staff was extremely rude. My friends and I were ","useful":2,"cool":0},"q90avtq5Peheq1GPUMJ3xg":{"text":"I was absolutely shocked by this incredible restaurant. This is Asian fusion new s souther","useful":2,"cool":1},"dKwnJBWgYVWzaMCeoTAklQ":{"text":"Decent dining experience with outrageous prices. We tried a variety of items. Some were ex","useful":0,"cool":0},"lSBRaW9JfXXTeP20nV7Eqw":{"text":"What a phenomenonal idea that someone dreamt up and made into reality. \n\nAsian American fu","useful":0,"cool":1},"hDBrxH1bMXaQycF25_ByEQ":{"text":"The food was delicious, however, the problem that we had was the manager. Before we had or","useful":1,"cool":0},"5la0IM3UN1cgx7TXyEwK9g":{"text":"Stumbled upon this place. Thought I'd chill at the bar but had to get a table. No idea wha","useful":0,"cool":0},"ipi1Jl0CKAnlVgKvMZpLeg":{"text":"A solid 4.5...\n\nMy stars:  (5=epic \"best of\") (4=really tasty and want to go again and aga","useful":2,"cool":1},"X_LOch5kBYUVWokQ1whpiQ":{"text":"Fabulous restaurant.  Great food.  Chic decor.  Casual but cool. Happy vibe but not loud. ","useful":0,"cool":0},"b2Swdk0QdQ1EZd1h5i3myA":{"text":"Incredibly disappointing.  Everything from the front-of-house staff to the menu is subpar ","useful":2,"cool":1},"SJt-ds5UvczvwXu6wAvPzQ":{"text":"Wow - what a new gem! I stopped in for a late lunch with my girlfriend after seeing its ex","useful":1,"cool":0},"TN0yXQ4Hzr6oQOYe-Q-Vvg":{"text":"It's a shame the person greeting us was so rude. Yelp states Maypop closes at 10 while the","useful":0,"cool":0},"1Nq1sj2ya5X1_qKw5ae36A":{"text":"I finally got the opportunity to try Maypop last night for my sister in law's birthday din","useful":3,"cool":1},"BUqPQ5IJJsM1sD_1sFyQgg":{"text":"My husband and I were in New Orleans for the week and were getting tired of all the creole","useful":1,"cool":0},"Nd_i9gNaMj7JTnGtTDn7nA":{"text":"Well, here we are at another fabulous place serving delicious and unique plates. From ther","useful":0,"cool":0},"QOn_WGkO7zCpNrcBLMAQMA":{"text":"Holy. Wow. Batman. \n\nNothing was missed during this meal. I love a restaurant that just go","useful":5,"cool":6},"Ut1O8t2oMuMJ4RiXrXqjXA":{"text":"It was a wonderful experience. Please get crispy fried oysters for appetizer and gulf shri","useful":1,"cool":1},"ub8acy_5f-2vCRUqnkKSYw":{"text":"I really liked this fusion restaurant. My only complaint was with the appetizer. There was","useful":1,"cool":0},"tZii3eYzuHq8STOoyzB5EA":{"text":"We have wanted to try this place since it opened  as we are fans of MoPho in mid city.   W","useful":0,"cool":0},"h8o2Uh1yhIQpH3sJe6YAfg":{"text":"Alright! We had a reservation at 8 pm. I got there 30 minutes earlier to have a drink at b","useful":1,"cool":0},"e3nqsZo7CDSyrIt2W0mM5Q":{"text":"Maypop is an absolute delight. So glad I had the opportunity to eat here with friends. Loc","useful":2,"cool":1},"Sr2cJJa2OZLBU4JEtwLkRA":{"text":"On our recent trip out to NOLA for Mardi Gras, we checked out Maypop.\n\nWe ordered:\n- table","useful":5,"cool":6},"v_gam5loc0OxxAyBDYeEwQ":{"text":"Truly an unique asian fusion restaurant with delicious offerings. Came here with a party o","useful":1,"cool":1},"9CR45QrI2Ov6R3n1kzd2FA":{"text":"Please allow me to preface this by stating that I am not typically a fan of fusion food. \n","useful":1,"cool":1},"YLzTC88wuWOckzpmRqFdug":{"text":"DELICIOUS! We came here with a group of 4 and shared 2 appetizers- The bread with butter- ","useful":1,"cool":1},"PHhCGJV-43kE0671UeeIkw":{"text":"Definitely recommended! Went during slow hours so the service was superb as it should be. ","useful":2,"cool":2}}