{"n6VJk4PWdDd0jsrY5NP2BA":{"text":"One star at best. This place is seriously tired and run down. We had breakfast there this ","useful":0,"cool":0},"rcqmN366UfUbbQinHlHz7g":{"text":"Blues salad rocks.... Good portion and super tasty.  Yummmmmmmmmmmmmmmm. Can't wait to try","useful":0,"cool":0},"PLJcgc3Hbdhz5GiWevYRKQ":{"text":"Ate here for the first time, last Tuesday morning.\nGreat breakfast menu at very reasonable","useful":0,"cool":0},"4Q2WtSbhfXPAYK9AGODD8A":{"text":"Cute little breakfast place, with a few good gluten-free options. I chose this place becau","useful":1,"cool":0},"GqTUDkKm1-IFSGIn-gtFvQ":{"text":"My measure for a good breakfast place is whether or not they can get eggs cooked over medi","useful":1,"cool":1},"3zqpU0KR-xj-jGuAY2IAxA":{"text":"We went to Slim Goodies for an early breakfast on our first morning of our most recent tri","useful":0,"cool":0},"fhpoWsnlApuv-JeDIj0kRQ":{"text":"Best diner in the city. Definitely try the Orleans Slammer...and have an appetite when you","useful":2,"cool":1},"zjVi-qA_mxVzXIawisLp8A":{"text":"They have great veggie options but I opted for the B.E.C. which was perfect over-easy! Mar","useful":0,"cool":0},"APVqARhAg_-RrAjaZFCATg":{"text":"GET \"THE CRABBY WIFE\" \n\nI live in the neighborhood and this is one of the best places to g","useful":1,"cool":0},"RZ2amrqaCtxTVkXew_sPGQ":{"text":"This place is a solid diner and has some great options. The heavenly waffles (pecan waffle","useful":0,"cool":2},"mGVbMfc2OwASMvl7bYGTIA":{"text":"Slim Goodies is a diner with personality.  Lots of locals stop in and for good reason; the","useful":2,"cool":0},"ohbGry7Xt01sOqmLvnNMcA":{"text":"I would be lying if I didn't say the food was good. There is no doubt about that. \n\nHoweve","useful":0,"cool":0},"vsVnTui1Uqfjbd79VTn9iQ":{"text":"Great breakfast. Many good options. It also had a lot of things available for vegetarians.","useful":0,"cool":0},"AyRC_QEjAlBQ-01ueYRh0g":{"text":"This place is pretty good. I'm more of a Surrey's guy myself but Slim Goodies takes a soli","useful":1,"cool":0},"xKOR2mEA2Q0kDsPYgc9hHA":{"text":"This is definitely the place I love hitting up while in the city because it's pretty cheap","useful":0,"cool":0},"6kD68kHbi21WRA36Vpav4A":{"text":"First, to definitively fix some misinformation in other reviews: it is clean. It is as cle","useful":2,"cool":1},"dc8Nhq1TOXR_TTKOfoWMSw":{"text":"Let me start of by saying I'd rather go to ihop!\n\nWhy?\nRude wait staff and overpriced medi","useful":2,"cool":0},"C17IK0COZ4zkHbfQ3CKa8Q":{"text":"After walking two miles in torrential rain to this place, I was skeptical if Slim Goodies ","useful":1,"cool":0},"1RIMDrHIioHzmm53Fr24_w":{"text":"I love the burgers here.  Diner style burgers.  Haven't even tried the breakfast here beca","useful":1,"cool":0},"iCchg0MZMVcEa_JNtkRBOQ":{"text":"Came here the morning after Halloween. Needless to say we expected it to be slammed and pr","useful":1,"cool":0},"0c9gUqSarbiznHD7NauEjQ":{"text":"Always enjoy slim goodies! Once ran into Will Farrell here. Great hash browns. Stacked pan","useful":0,"cool":0},"-H5c2VY1yHcmuUyhHZtwxg":{"text":"I recently moved to Louisiana. I had got tired of eating the same thing for breakfast ever","useful":0,"cool":0},"Ji4Y8xIizz00DyZduZKhVQ":{"text":"I don't know why I don't go here more often, seeing as I live just a few blocks away. Perh","useful":0,"cool":0},"mDUUyXir6btgrrKqq-8_3w":{"text":"Jewish coonass was one of the best breakfast items on the menu. Friend got the deal with p","useful":0,"cool":0},"kRoMXFxfirRoj3lmYQMAdw":{"text":"I loved this place. Probably the best breakfast/brunch I had in my two week trip to the US","useful":0,"cool":0},"BpOpDusG0JIn9vaMoej0Fw":{"text":"Great place! Combination old school diner and cool trendy place. I had heard about the Sou","useful":0,"cool":0},"c1tLJPFL3fuLhz8aOL5xcQ":{"text":"It is obvious after digging into this yelp page that the only reason people continue to pa","useful":7,"cool":1},"KbbofVVrw6UdrgJdwG-OPQ":{"text":"Service was so amazing and some of the kindest people!! We came with a group of about 20 a","useful":0,"cool":0},"YNQbP76gCIX02kv5NaFTMw":{"text":"First- this place is AMAZING\nSecond- BRADY & IKE are my Hero's!!! They were so personable ","useful":0,"cool":0},"dCNteUReNp0o4KXAFvNsbA":{"text":"I loved this place! A good amount of seats and an interesting cross-section of people eati","useful":0,"cool":0},"Y5gYw0DyNpGQBURLyxLu9Q":{"text":"We were recommend this diner by our rental car attended. Boy it was worth the drive! The s","useful":0,"cool":0},"IYomiTucO8dEObRvHhvDIA":{"text":"I visited here a few years back after reading great reviews for it here. It was a Sunday a","useful":1,"cool":1},"z_2QVeMmEsClriqXrWv2Lw":{"text":"Heaven Waffle and Bon Ton crawfish omlette was et.\n\nSuch deliciousness. So breakfast. Wow.","useful":0,"cool":0},"4VdcZe0otpGCj_2wTQZAAw":{"text":"This was for a long while my regular spot after a night out of drinking. Not sure why I ha","useful":0,"cool":0},"zJH2Gaa264qEpnoFhyJ6wg":{"text":"Dive is the right word! The food is greasy and the service is horrindous! I waited 40 minu","useful":1,"cool":0},"XV_q8j2MninxqEIBuGVz8Q":{"text":"You know, I blame myself.  I should have realized what I was getting into by the look of t","useful":1,"cool":0},"Ax3ErYMnSyTJVT9Sym630A":{"text":"Delicious...the beans have a je ne sais pas to them but they made the New Orleans whatcham","useful":0,"cool":0},"pL1C4r1gNqyeB83xvlfMpg":{"text":"Do you want pancakes for breakfast? Best pancakes in town right here!\n\nI highly recommend ","useful":0,"cool":0},"dl-m33BAo1ld8bnRCNaZug":{"text":"Pretty good breakfast diner. The Polaroids on the wall are pretty retro. Great service and","useful":0,"cool":0},"09y48AM0ZWGf2jz6hZ2bbw":{"text":"I LOVE THIS RESTAURANT. I have been eating here since I was a kid. An Orleans slammer is t","useful":3,"cool":0},"dnULTBnLzaSV0LKs1sJPcw":{"text":"Awesome place! Very laid back but good food! Cash only!!!! I had the Americano omelet whic","useful":0,"cool":0},"bHZboHAKtMEUEFjlZn5gnA":{"text":"I don't understand why people wait to eat here. The service was sub par, as was the food. ","useful":2,"cool":0},"_uer75jGfT-IAQI06vdcVg":{"text":"I dont know if this is a New Orleans thing that I am just not aware of but this place is u","useful":7,"cool":0},"yjlxb_SNrNbujslpWeuXXA":{"text":"waited outside in the rainy drizzle for 15 mins to be seated but once we sat down and read","useful":1,"cool":1},"_c5M98uWdhGMfamIP_eZYQ":{"text":"Slim Goodies was the best breakfast we had in New Orleans hands down. We sat out on the lo","useful":1,"cool":0},"2_zDWZigwfKgEWNJlWRdLA":{"text":"OMG!!!!!! This place was soooo totally AWESOME. We completely cleaned our plates!!!! And t","useful":0,"cool":0},"K75m1a1NEygsxJaVhwlYDw":{"text":"Couldn't ask for a better taste of Neworleans Breakfast! Check out my review on my travel ","useful":1,"cool":0},"c_U-ZjNq9hPaI5Lb5C8PuA":{"text":"Food is decent enough, though by no means extraordinary, but service is truly awful, even ","useful":1,"cool":0},"h6fB5TrncvAlo-w9KqroLA":{"text":"If a 50s dinner matted with a hippie commune, it would be called Slim Goodies.  The first ","useful":3,"cool":0},"Ixx07X--oC8BdGGfSo5X5Q":{"text":"Wish I would've chosen somewhere else for brunch in all honesty. I ordered a BLT and the b","useful":0,"cool":0},"LPIzlY7Xlo6YsKjMHLPdhg":{"text":"I've tried them twice and it will not be a third time. I mean where is the seasoning?! I h","useful":0,"cool":0},"_CFVjxm2xE12Rp_YIMZuaw":{"text":"Awesome new Orleansy diner.  I always get the huevos rancheros.","useful":0,"cool":0},"vaSL1jCjm--V654kR3X7-Q":{"text":"The food was great, as it should be.\n\nIt was raining so hard and wind blowing so much that","useful":2,"cool":0},"o71XXbThtj49_kRg5FtbpA":{"text":"I'm still trying to erase out of my mind how awful the breakfast was I ate here three week","useful":1,"cool":1},"dzBRaThaYXjC_3Y-v0dx5A":{"text":"What a great neighborhood find.  This is a funky diner with outstanding breakfast.  I has ","useful":0,"cool":0},"moq-KKvfM16CrmkgBhBctw":{"text":"Vegetarian fake bacon cheeseburger.  With avocado.  Amazing.  This, I kid you not, changed","useful":4,"cool":3},"aUJds7c7XjwtD3_wzhKdyw":{"text":"Cash only - remember that.  I eat breakfast here once a month with a group of friends. Ser","useful":0,"cool":1},"o4fm_geFWF-amdUr3Bsuow":{"text":"A quaint breakfast spot on Magazine Street that if you blinked, you would miss it... but t","useful":0,"cool":0},"8RLxtHqeHHltqyzZSQoRug":{"text":"A great diner with even greater food.  All the food is unique and extremely tasty.  Watch ","useful":0,"cool":0},"5aqSHxUvX5ixXqrVMpLEGQ":{"text":"The food wasn't necessarily epic (still good though), but the waitress was awesome, watchi","useful":0,"cool":0},"Que-VQpQ5-AaVq3LAaSaaA":{"text":"This used to be one of my favorite spots for unpretentious, laid-back breakfast with great","useful":3,"cool":1},"kfdthqTOi8m9qLqKqRwUdQ":{"text":"This a 5 star Diner!  Service friendly and fun. Menu has something for everyone.  We did H","useful":0,"cool":0},"RuKsngK2-tewIRqxWUauwA":{"text":"This is one of my favorite breakfast spots in New Orleans! It became a quick favorite to m","useful":1,"cool":0},"pFgRXgEToV2HsXhElPUuGA":{"text":"Wow. I'm astounded at how badly executed a simple breakfast could be. Probably the worst I","useful":0,"cool":0},"nxhw2ZrQrc_fkLSR4DBObg":{"text":"So gross! Not even the hash browns were good. Instead of crispy they were stale. The biscu","useful":0,"cool":0},"QIrshJqNinziBjXHCCpeew":{"text":"Dined at Slim Goodies while vacationing in New Orleans. They were within walking distance ","useful":0,"cool":0},"WMVvKXalvtzTNEmlLx3gMA":{"text":"This is an old-school diner that offers what diners offer-plus a nice vegetarian selection","useful":1,"cool":1},"gkBWfa7kApfhdOBUXepIKA":{"text":"I was almost in tears eating my Crawfish etouffee smothered latkes. Everything was amazing","useful":0,"cool":0},"N51xgrz__5lvvR2_k88m2A":{"text":"10/26/2014: came back and everything was off the hook awesome!\n\nWe had the #3's and the St","useful":0,"cool":0},"6XiA9NpQGUs58jRo0DLEjA":{"text":"I really wish I hadn't been seated at the counter where I could watch the food being made.","useful":1,"cool":0},"h5rjG6nBVnDV5YEsMuxf9g":{"text":"Recently visited NOLA and stayed about a mile and a half from this place. We ate breakfast","useful":2,"cool":0},"_FLVO5o5g2v7wpd0J96AGA":{"text":"How can you not love this place? Laid back and comfortable decor, cheap good food, awesome","useful":1,"cool":2},"PKQ3uAwc7zetZNwPKiEmFA":{"text":"No love here. Bad service bad food. There aren't that many places for nontouristy breakfas","useful":1,"cool":0},"dzUjEv-XkZXHdo-hNvvk1A":{"text":"Nothing special to brag about.\n\nReally good dive diner in a good area on Magazine St.\n\nthe","useful":0,"cool":0},"xWCmF4J7JZxaowG43DwPZA":{"text":"Good coffee to start (hot and fresh), I ordered the Guatemalan which includes jalapeño bla","useful":0,"cool":0},"oXbDrmKY-chND5AygLrvHQ":{"text":"Late review, but better late than never. \n\nAs a New Yorker I'm used to a diner every corne","useful":3,"cool":1},"xZ7-AgROJ-rOjfGuuW4JGg":{"text":"A bit greasy for my taste...we had the 2egg, 2bacon, 2pancake deal...all greasy, but taste","useful":0,"cool":0},"cXmt1vazje4y8DPVka0NEg":{"text":"CASH ONLY!\nmilkshake and the food was Amazing!!!!!!!!!! server is nice and funny, the whol","useful":0,"cool":0},"pK2kSmDurKExQhfaT1snrQ":{"text":"So many options for breakfast and ALL of them are delicious!  I love a place that has more","useful":1,"cool":1},"hjSkNHb2lDH8MgYBcILu9A":{"text":"First time and won't be the last. Great breakfast spot, but we got the Katrina burger and ","useful":1,"cool":1},"xrFWqOi-9fXPdUtaUF0wgw":{"text":"A \"local\" (my friend) brought us here for breakfast and it was so, so wonderful!\nMy husban","useful":1,"cool":0},"LZzru7d7gA__anpyffzXIw":{"text":"FYI - cash only! This is a seriously good diner. It's fun, quirky and whimsical and so are","useful":0,"cool":0},"Cjm1XzVUi9g_nhePIji_3w":{"text":"I really just wanted this place to have another good review. I miss it. There isn't much I","useful":0,"cool":0},"vgXblGbEy4yVnRjfgSiaHA":{"text":"Really fun and funky diner. Classic feel with funky modern updates.  Good music.  Homey di","useful":0,"cool":0},"D0eznee5f9mv5YtHH8xIsg":{"text":"Worst breakfast I've had in New Orleans. Came to visit for my birthday and ordered two mea","useful":0,"cool":0},"KQQBJoOkxOv60SxYAsXtbA":{"text":"Okay - not the cleanest place on the planet, but you have to consider the city it's in. An","useful":0,"cool":0},"18XkYWdGE9LORa12zla9xA":{"text":"Our waitress was super nice but we waited over half an hour for our food. It was alright b","useful":0,"cool":0},"w8iw3oR1DKplMKnvI2t_GQ":{"text":"Slim's is my favorite breakfast spot. The atmosphere is rad, they cater to vegetarian/vega","useful":1,"cool":0},"iwRNxk1YHaMizSo6oCSf7A":{"text":"Solid food. Slim goodies takes a fun NOLA spin on a diner. Any of their breakfast plates w","useful":1,"cool":0},"Vw7II4_nfVgUTUhIg7ofOA":{"text":"Slim's is a good, standard diner in an area that's a little short on those. The food is no","useful":1,"cool":0},"YBsV2rZVzV4-w-ecqFwUUg":{"text":"I've been a number of times, it used to be a place that I took visitors. They were always ","useful":3,"cool":0},"7qyk76a7urog3GwfZQDkTw":{"text":"So excited to see chicken and waffles on the menu and I ordered via postmates.  I got 3 ov","useful":0,"cool":0},"YpDlm6NAI2H3TcOHdG4nCw":{"text":"We had breakfast on a wet Saturday morning, and man it was good stuff.\n\nIt's cash only.  T","useful":0,"cool":0},"FAvM5w7tflIwame6J2XjYA":{"text":"Dope...this place is so dope. I make breakfast at home or it hit up this little gem. My oh","useful":0,"cool":0},"5c1SaK40R1ZXP9FFx5TXNg":{"text":"Breakfast was average -- overcooked eggs, bland grits, soft biscuit, and ubiquitous, run-o","useful":1,"cool":0},"w6projj-0dY465UGGzRtnA":{"text":"Good food...love the diner style food & decor. Service was...ok....definately dont want to","useful":0,"cool":0},"1CdcKkLybd4PP0Fh89BMxg":{"text":"This is a totally unique restaurant and, in my opinion, a staple of any trip to New Orlean","useful":0,"cool":0},"MOX9XATcwT52PWmNM0_k7A":{"text":"We had an amazing brunch today!  The owner is warm, welcoming and friendly.  This is one o","useful":0,"cool":0},"E9Tt0CCFYDUcQqEYTSdEIw":{"text":"This place is awesome. Real classic diner feel with monster portions. The line can be a bi","useful":0,"cool":0},"BjdF1Y4cAbm3sSYFAdgvYQ":{"text":"Just your average American diner-style food with a bit of attitude, but apparently that ca","useful":0,"cool":0},"94MxBrYePd1AmLfHZ3yqAg":{"text":"Yo this is the SPOT. If you're wandering down Magazine St, make it a point to enjoy brunch","useful":0,"cool":0},"68Hi8As-7v2VPbxeKoI3kQ":{"text":"Unbelievable breakfast.  Off the beaten path but worth the trip.  Great service","useful":0,"cool":0},"C8byzGCAosgLC6hT1iGDug":{"text":"The food is not bad but the service is. And they always seem to mess up at least one thing","useful":0,"cool":0},"LmJq5y0ybTQTzrVHHYR7Zw":{"text":"Walking distance from where we stay in New Orleans this was a place that was a must! A sma","useful":0,"cool":0},"MXm59_j1v1wOAvQo3BYbuw":{"text":"It was our first time visiting this diner since we just moved to New Orleans. The vibe is ","useful":1,"cool":0},"KNLSpAJGR5XU3Zxlphr-YQ":{"text":"Menu is varied and interesting, our server was extremely accommodating (we had a large par","useful":0,"cool":0},"IlTG5qDILiSdz7LVXvce3A":{"text":"We came from out of town on vacation and wanted a good breakfast. The atmosphere here is v","useful":2,"cool":0},"iiZc_TpzKvI3S-lCBeip2g":{"text":"Mediocre breakfast food with smug employees. The worst of it is just how plain dirty and u","useful":1,"cool":0},"jkaImQFsskxwxkvrnYm3dQ":{"text":"Both amazing and delicious. We both had omelets. They were huge and lovely and everything ","useful":0,"cool":0},"wacn9VgYsoDINI24iyjsGQ":{"text":"Cookin with love - and it shows.  lots of kids pictures on the walls, local hang out. Cash","useful":0,"cool":0},"jeiZt78uJNd-QBz1kcqErw":{"text":"The latkes on this dish were soooo crispy they had that perfect crunch. Eggs were cooked p","useful":1,"cool":0},"-S4c_cRvC1akJQKKMQtbPQ":{"text":"It's really expensive and the customer service was horrible! Our waiter forgot us, and I h","useful":0,"cool":0},"uA1nrEl2LvwOW642yyz0Iw":{"text":"This place is really hit-and-miss. One day you have an amiable waiter or waitress and the ","useful":0,"cool":0},"enOa6HzlJe0AJ412osYr0A":{"text":"I came in on a Sunday morning at around 8:45AM. There were open tables, but I sat at the c","useful":1,"cool":0},"maHBbNUruPwav3L_VMqVYQ":{"text":"My other half found this one on tv.  My foodie sister & bro-n-law weren't familiar with it","useful":0,"cool":0},"OUmuElmgw_YtvYmMfBsq5w":{"text":"Great joint.  Their menu is original and extensive, the service is great and the food is e","useful":0,"cool":0},"Lwk0tqbEqrvNbeh-KVGhhg":{"text":"I had such high hopes for this place! My boyfriend, friend, and I were visiting New Orlean","useful":1,"cool":0},"UiqCsJCBJjZdIbUVI1Qd4w":{"text":"This was one of the best experiences i've ever had at a restaurant. I truly made a Yelp ac","useful":1,"cool":0},"FjP3GNoOPZ4m5eYb14w5Pw":{"text":"There is only one reason I ever come to Slim Goodies: The Garden Slammer. Yes, the Creole ","useful":1,"cool":0},"jhg-F8CJwG__tofXdgr-GQ":{"text":"A friend recommended this place even though the hotel suggested Gott Gourmet. Really glad ","useful":1,"cool":0},"JoHOJJ3KyK3GmgJIoUBKiA":{"text":"This place was nice and crowded and people were constantly coming in for breakfast. The fo","useful":0,"cool":0},"q4mtverU3Y6L9DYPVu2dNw":{"text":"Hole in the wall zagat rated. I had my best breakfast there I loved it. Obama went there t","useful":0,"cool":0},"iIukVWe-4fKCLdg2yQ2WqA":{"text":"The atmosphere is terrific, with funky-cool vibes and welcoming, friendly staff. The food ","useful":1,"cool":0},"63x6RO9bzQ-2BhYmF9PXbg":{"text":"Cash Only...\n\nI've been here several times.  The food is a little greasy and I really can'","useful":1,"cool":0},"5yQPgLn3GNFy12ynDwWbbA":{"text":"One of my favorite local spots. You want a traditional, griddle breakfast? It's awesome an","useful":0,"cool":0},"Dw2m4iETgXTiIQ8UyZ8Ojg":{"text":"We had a yummy, filling breakfast here.  Cheap, perfectly cooked eggs & hash browns, A/C, ","useful":0,"cool":0},"-JnfvGNh35GYE2tS1KciJA":{"text":"I meant to write this weeks ago but I just wanted to say how blown away I was by Slim Good","useful":0,"cool":0},"wiMaXsXJ46dU8EK6w7Vm0A":{"text":"Had the biscuit with red gravy, one egg over medium.   The gravy was made with andouille s","useful":1,"cool":0},"z4Lyf_moh8vwLmgRDUbm8Q":{"text":"Just a forkful of Slammer makes the hangover be-gone! Yay!! \nThere is nothing better on a ","useful":2,"cool":2},"iuqiMK8Se1AuJp9mD1oDyA":{"text":"Stopped here on a whim when our first choice stopped serving breakfast. We loved it here! ","useful":0,"cool":0},"2ciy2AkbeXvI_4zx3TrRSg":{"text":"Excellent service. Delicious BLT. Friendly, friendly, friendly. Stop in on your walk aroun","useful":0,"cool":0},"E5QaqfGMNa0B-8Q7oq9wjg":{"text":"Absolutely amazing delicious food!!! A must breakfast visit while in New Orleans! I had Cr","useful":0,"cool":0},"QIB1j5AzR8Urp2g8fE2MmA":{"text":"I had heard a lot of good things about the food they serve so I was expecting a great meal","useful":0,"cool":0},"bGpdMFgmjSqZS92mAAYvHg":{"text":"Went here for breakfast and Slim Goodies is one of those places were my overall reaction w","useful":1,"cool":0},"4AYIo_oufjLN6TGsR1g0wA":{"text":"I've been here a number of times, and the service is always really hit or miss. There is a","useful":0,"cool":0},"WP_jTtXiOkd4LPWu4GK4ZQ":{"text":"I went for Sunday brunch. Really yummy diner food with a big menu with lots of variety. Th","useful":2,"cool":1},"QCpbdHpf8FNQmNl8Sd1buQ":{"text":"Great little greasy spoon on the more urban stretch of Magazine St.\n\nThey actually get oml","useful":2,"cool":2},"ae9BAv7KROuVTuK4GAwVRQ":{"text":"Our favorite breakfast spot so far in New Orleans. Get the Creole Slammer. Bring cash, not","useful":0,"cool":0},"DOEq7vF21DJ_vzxr2gX0IA":{"text":"The main reason this place gets five stars is that one of my best friends owns the joint. ","useful":2,"cool":1},"aSwbSAMNRcPdu259MRAOGQ":{"text":"Slim Goodies is one of my favorite breakfast spots in NOLA. I love sitting at the counter ","useful":3,"cool":3},"DjhLkpvUhudrP0Aw91jEHg":{"text":"My boyfriend and I went around 12:30 pm on a Sunday and were seated within 5 minutes of wr","useful":2,"cool":3},"Md7MamBwtkc2_CutsFUBeQ":{"text":"A quirky little diner located near the Garden District, Slim Goodies Diner was on my list ","useful":0,"cool":0},"2kZhxcXiVv_LaGtgrDDQfg":{"text":"Since I have been going to this restaurant for breakfast over last three years the food ha","useful":0,"cool":0},"NI8ljP_Os6J7TGrDhe6qxw":{"text":"Even though I've only gone here once, I think it's a great place. I arrived at 7 am. right","useful":7,"cool":6},"sG9DpKmunLwxP1MFXgELfw":{"text":"First time at SGD....great service and awesome food. First-time diners should go with reco","useful":0,"cool":0},"x0alKbk9hif-W45Pg0O3rA":{"text":"I've been to Slim Goodies a few times and I must say the staff have always been unique in ","useful":0,"cool":0},"OQSUkfobCPQoIONE_nY5VQ":{"text":"Some girls exclaim \"too greasy!\" but this has not been my memories of such breakfasts here","useful":1,"cool":1},"TS01bbi8KyyUwucYuAdAkw":{"text":"Classic diner food. $3 mimosa makes it worth it!  And the kids $2 chocolate chip pancakes.","useful":0,"cool":0},"TP9j3w5SyMldW91wWsqOMg":{"text":"Best breakfast I've had in years. Not for the snobby at heart. This is a humble , comfy, h","useful":0,"cool":0},"ONyEgw2fJfoIsYRwk6-uyw":{"text":"I really enjoy this restaurant. Something about sweet potato pancakes on a Saturday mornin","useful":9,"cool":6},"YZyPWAYTKEBMdyO9T1b-oQ":{"text":"Came here on our first breakfast in New Orleans.  The food was great and we loved the atmo","useful":0,"cool":0},"P38YQadR0H2zetMtJ3L_MQ":{"text":"I'd love to review the food -- I'll bet it's great -- but unfortunately when my partner an","useful":0,"cool":0},"efRPX_AbPcCbmT9gJoHP3w":{"text":"We love Slim Goodies. The only reason  I'm giving them 3 stars is because we found out tod","useful":0,"cool":0},"rY3amyb7fxeZu7pMaSPsZA":{"text":"Easy over the phone service. Speedy and great quality. I order the Jewish Coonass for the ","useful":1,"cool":1},"NidmkdmictpZdNe91jZzcQ":{"text":"Great location.  The food is always good for what it is.  THEY DON'T ACCEPT CREDIT CARDS. ","useful":1,"cool":0},"ys4_oo3gPWm_DYjuISeyDg":{"text":"When you wake up hung over head on down to Slim's. Their menu array caters to many and wil","useful":0,"cool":0},"cPiceP3miOK5I0FOK9qvMQ":{"text":"1st time I came here the food was great. But the service was sloooowww. This is my second ","useful":0,"cool":0},"3s2W52s8fqTP7jqxoP4VVA":{"text":"I've been coming to Slim Goodies for about 12 years now and it's such a part of my NO expe","useful":3,"cool":1},"RsU4od2XlRK8E8yz1hqs8Q":{"text":"Delicious breakfast, good hot coffee, and quick service.  Lots of variety on the menu.  Th","useful":0,"cool":0},"20TMbvtfN--TKw-g3iVyNg":{"text":"How I wish Slim Goodies was still open for dinner. That's when I ate here the most (pre-K)","useful":5,"cool":5},"MeUmGRdvhAmTSfJaG-nJcA":{"text":"Loved it.  Prices are reasonable and the staff was very nice and accommodating. Food was d","useful":0,"cool":0},"lEdOptUkJ3reyBDhGwl7tA":{"text":"This place sucks and it always has sucked.  Their food blows, and it always has.  So the a","useful":1,"cool":5},"YmCpp2jOMErptCBX4TwIHA":{"text":"First of all I would just like to say I made a Yelp account to write this review. My time ","useful":0,"cool":0},"5WSv1w5z5m7va0a2ORXiDA":{"text":"This is a great diner for a classic, hearty breakfast.  Perfect cure for \"too much partyin","useful":1,"cool":1},"9NE6kvx2b_7qB1SDxg_gYQ":{"text":"After reading the reviews I was expecting to be blown away, but maybe my expectations were","useful":1,"cool":0},"m-ZzS3iRCKVXutlTKwqcVQ":{"text":"It's a very good greasy spoon stop. Eggs, pancakes, bacon, coffee....all very good. Nice s","useful":0,"cool":0},"iN6M6Kvvqv9aGKs6apmE2g":{"text":"Delicious.  Fast service. I had the Orleans slammer. --- hash browns, bacon, sausage, toma","useful":0,"cool":0},"zuBvlP1DNHmqneYtWJrkgw":{"text":"Ordered delivery for breakfast and it was such a letdown! This is a picture of the turkey ","useful":0,"cool":0},"TxsTGU6jDVieX_3qYa8SyQ":{"text":"Super cute outdoor patio. Food was great and incredibly vegan-friendly. Main gripe was the","useful":1,"cool":0},"lPIVa7bgIHNS8n8cuWSZ6A":{"text":"Very happy to find this place.  Great service and good food at an affordable price.  The f","useful":1,"cool":1},"3o3vLbSK2ziTOpRXPAUA7Q":{"text":"Food was worth the money- DIFFERENT from menu posted here.... 2-3x more expensive\n\nWaiter ","useful":0,"cool":0},"KGLYhnK306qJkuaXh58f3A":{"text":"Very fun and quirky spot for breakfast. I had a delicious veggie omelette. My only complai","useful":0,"cool":0},"_hu724ASHmRc6YZgB5-kzQ":{"text":"Not as good as I remembered. BYOB was a plus. We ordered chili cheese fries with jalapeños","useful":2,"cool":0},"ov9YNDtx8wjWDR4OjDDxWA":{"text":"Used to be a sentimental favorite because of how awesome they were right after Katrina (wh","useful":0,"cool":0},"_3BDy5IFvQNSHJDFfyM7sg":{"text":"I came in for breakfast on a Friday morning. \n\nIt's not fine dining.  It's not a New York-","useful":1,"cool":1},"qX3VXLpa4YLKLfTkOJ89wA":{"text":"Feb. 2012 In town for the Superbowl.\nFrom the second I walked up I knew this place was lik","useful":0,"cool":0},"_GuFt8SRDOsW_z7qR3FafQ":{"text":"I used to love Slim's until one fateful day.\nI went in, craving something like eggs layere","useful":1,"cool":0},"5paAgzphqYbqyZS5CJK5pg":{"text":"Horrible.   Waited 20minutes to get seated, then waited another 30 before we got our food.","useful":0,"cool":0},"EDTo8IV5es7_VmVIyu_BKA":{"text":"Food was good. Wasn't worth the wait. We were there from 11:30-2:30 (3 hours) waiting for ","useful":0,"cool":0},"mUScZCL8LZJ7t1JYdhrV2w":{"text":"Food is great, overhead tunes old school and it's a funky looking diner which suits me. Lo","useful":0,"cool":0},"kS5EKJM6PfnlcSQIp9ItlA":{"text":"With Slim's you either get it or you don't. I happen to really like it- I get my usual Doc","useful":1,"cool":0},"hyO1F8qMcWJmuBWUe3LoUQ":{"text":"We tried this place out based upon the Yelp reviews - thank you Yelpers!  CASH ONLY!\n\nI re","useful":1,"cool":0},"lbDC48nWy7L_vZ_O6mRBkQ":{"text":"The food may have been good, but the service was the worst freaking service I've experienc","useful":0,"cool":0},"pw4qevtfZU7VQz0ZfvW2Ag":{"text":"As my wide and kids walked down Magazine we happened upon this place. Seemed like the kind","useful":0,"cool":0},"Z3FZNSYlGIJtSH06NDQ5JQ":{"text":"Pretty good breakfast place. Seems like a local crowd. Food is good, reasonably priced. Se","useful":0,"cool":0},"2XQ0dE-L2b12nU67LBGaOw":{"text":"Just ate here after an overnight shift at work, and it was a great place to have a nice br","useful":1,"cool":0},"-KeRd_QhvPqywr6Kl8r6rg":{"text":"I went here with my family. I was immediately disappointed once I saw the menu I looked up","useful":0,"cool":0},"uaGwcrAGv12CWqI8tQNf3A":{"text":"Cheap breakfast, good food, diner like ambiance. Open on Sunday nights as a burger joint c","useful":1,"cool":1},"qX2xM0gLwdzBfzSewUo3QA":{"text":"This was an awesome brunch spot on Magazine street. My entire party loved the diner feel a","useful":0,"cool":0},"i3Ky6qgyoMQju619-XyO1g":{"text":"Really enjoyed eating here! Had a unique and fun menu with good food and big portions. Ser","useful":0,"cool":0},"k-DZSc0D2SLyyFsTKxY_eA":{"text":"so good! cheap and delicious! got one ray cake (a chocolate chip pancake) and I thought it","useful":0,"cool":0},"ohSUHC9VDrOPk3xPcfzFNA":{"text":"There is just nothing like greasy diner food after a long night on the town. That's just w","useful":1,"cool":1},"JWGaRUXNNG9vqiPr6Oc9_g":{"text":"My first time here. It was a good one. \nI sat at the old fashioned diner counter, and norm","useful":0,"cool":0},"2sPfE1fc2BBk1tjU0UnycQ":{"text":"I started off really liking Slim Goodies, but somehow it has lost its luster.  The food is","useful":1,"cool":0},"zH2sZ_bpv0fwZIw1poCA8g":{"text":"A super fun vintage diner on Magazine Street, breakfast at Slim Goody's Diner was heaven. ","useful":2,"cool":0},"EWK_Q7vj5QXBan9Ayw8Vag":{"text":"Great breakfast spot with many options. Eclectic kind of ambience and atmosphere. Good qua","useful":0,"cool":0},"BW_5oIB84fJIXKWDHkufbw":{"text":"The food was excellent,  as I had heard, but if you are expecting ambiance look elsewhere ","useful":0,"cool":0},"Pc-JNlMFsYiuzer1GKfKeA":{"text":"Great food! I have been coming here for years. I love the pancakes, and the french fries a","useful":0,"cool":0},"FE2ONGhowGQV3h2eu8glcA":{"text":"My boyfriend had the bacon, egg and cheese sandwhich (BEC) - very simply and amazing! I ha","useful":0,"cool":0},"mPlSvIOtehkXedMjn1iIyA":{"text":"Summary based on one mid morning breakfast:\n-locally popular\n-food quality high\n-ok prices","useful":0,"cool":0},"sDrJCIGNmlOOtomWbh6RSA":{"text":"Do NOT miss out on eating here. We live a mile away and finally went in for breakfast. The","useful":1,"cool":0},"4cXZpM6U5Ec88q-j5unbow":{"text":"LOVE LOVE LOVE THIS PLACE. Not a big fan of the line that's usually out the door but it's ","useful":0,"cool":0},"OSHjBWE4sQz9379DIdAmkg":{"text":"So first, the service here is phenomenal. I came with a groups of 20 people and not only w","useful":1,"cool":0},"sz8U1wV2qjzyZmrvA5LxaQ":{"text":"The place just doesn't look clean, but I was willing to try the food and it was just okay.","useful":1,"cool":2},"RLeNmuoqZnKflRxfvi9Xkw":{"text":"My young friends love this place. The snarky, quirky wait staff are part of the allure. Th","useful":0,"cool":0},"mMoiCjzIegc7003jMVufBg":{"text":"The four terrible experiences I've had at Slim Goodies are what made me sign up for Yelp. ","useful":5,"cool":1},"wdBaHAgmdr2a8ueqbbzWow":{"text":"Once again, back in NOLA. I just can't seem to stay away.\n\nI rode the trolley down from Tu","useful":1,"cool":0},"cjnJ0t2wG_ksaEHCLYTNWw":{"text":"9/1/20\nCovid times. Masks, sign in, hand san, plastic shields. All done, good job folks! \n","useful":8,"cool":4},"NuQl9c85iMfjDZLOq06tXg":{"text":"There's something pretty amazing about potato latkes, crawfish etoufee, grilled spinach, a","useful":0,"cool":1},"0XHhpvj4G1zxij7LL55nbw":{"text":"I went to breakfast at two different spots on Magazine Street during my last visit, and I ","useful":2,"cool":0},"mpoNxLk--IYz1sIpQwuhcQ":{"text":"Bacon tasted like it was cooked and left to hardened the hash browns we're bland but the e","useful":0,"cool":0},"36YoT_6WYa02U786NcrMiA":{"text":"Im only leaving two stars because the food is okey its not that big of deal. The fries are","useful":1,"cool":0},"3dNu7QiZpXJ3mOuaz2CWkg":{"text":"Mediocre food, rude wait staff, more expensive-than-it-should-be, and cash only, but an up","useful":0,"cool":0},"vCZUN1qjD1riE_DmeU1s9Q":{"text":"I've walked by this place numerous times without even realizing it exists. It wasn't until","useful":1,"cool":1},"GwdRxyFNfepVhGNTIdmhoA":{"text":"Great breakfast, great coffee and yes it is not a place to go if you are on a diet, but it","useful":1,"cool":0},"VHkq9h1IJDlcjBqsauT_Qw":{"text":"Was looking forward to trying this places but only got disappointed. I ordered the creole ","useful":0,"cool":0},"bxArj5g8YBG-Jlv9quwIOg":{"text":"Perfect little local diner. Of all my NOLA eats, this one I'll remember for being solidly ","useful":0,"cool":0},"8w6a90_GNRlXeCPC3pETQg":{"text":"Just left Slim Goodies and the waitress assaulted me and SPIT on me. The police came and g","useful":3,"cool":0},"k3K7SkTQUTWXxUhMWwfMmA":{"text":"Ate here twice while staying in the Garden District, and am now pining for it! Extensive a","useful":0,"cool":0},"gWny21OOXS2-nbT-IDDpPA":{"text":"This place was recommended to me by a friend so I there was no reason to NOT go, right?\n\nW","useful":1,"cool":0},"oAdTSqo1Ct77uCfw7pR_mA":{"text":"I tried hard to give this place a better rating. But I just can't. First off Ive always be","useful":2,"cool":1},"ruadwyvAq8LmvrVOlHdUmA":{"text":"Great food in a fun neighborhood. Slight hiccup in what we order vs. what we got, but the ","useful":0,"cool":0},"ijXfwkZ8YVKEAWKwi6z-kg":{"text":"My husband and I had brunch here today.  As always, the atmosphere is delightful and our w","useful":2,"cool":0},"sLrhIezBdMziZ1r-JVj15Q":{"text":"Amaazing hashbrowns, cute spot, interesting menu. Service is quick and it's not too long o","useful":0,"cool":0},"7z1kxM7FEFrk5KHuPK7zcA":{"text":"Really enjoyed the food and the atmosphere. Great music playing and electic decor with all","useful":0,"cool":0},"Oyk7IQM68gITOKjDezV_Ow":{"text":"I really like Slim Goodies.  Their prices are reasonable and the place is very vegetarian ","useful":0,"cool":0},"IdwKs1Oj_hvf-uIev1jytA":{"text":"The place in New Orleans to get great food and excellent service. My favorite place for br","useful":1,"cool":0},"WHC76GnP-k0GpPD8zG1OWw":{"text":"A greasy spoon with a clean vibe.  This place always leaves me feeling happy.  I appreciat","useful":0,"cool":0},"Mdclig_O9a_zJGkcEZPWeQ":{"text":"I am visiting NOLA and a good friend told me to come for breakfast and he was so right.  G","useful":1,"cool":0},"xZv7lKEIjnM0qFEmnq3Uuw":{"text":"Best music in a diner! They should have a dance floor it's so good. Such a fun vibe, cool ","useful":0,"cool":0},"YVX6yI7LLeqMFxRg9Xl3Mw":{"text":"I got a milkshake and fries as a quick snack. The fries were hard as if pulled from the fr","useful":1,"cool":0},"mBPIZCCbH3BDXcU81_vUig":{"text":"All three of us who had dishes with the crawfish étouffée had stomach problems afterwards.","useful":2,"cool":0},"Ol-PKdrnGRfJ82HbvSDflg":{"text":"My boyfriend and I have recently moved to New Orleans and I'm obsessed with breakfast food","useful":1,"cool":0},"0mqZHSt9WUOjAQ2YCnTIJw":{"text":"First time and was disappointed. Food was average. Eggs were over cooked and grits average","useful":0,"cool":0},"-YQO1Vnbylhy9lv36n-k4A":{"text":"I feel so utterly betrayed as the recent law, requring disclosure of the origin of seafood","useful":6,"cool":3},"qPRhsZOMsbqtdAB3K_LTFA":{"text":"I've eaten here before and Loved the food, but the service has come down a notch.  The pri","useful":4,"cool":0},"ryQ960-i4Uq29TBkHLd0ug":{"text":"Hopped off the plane came straight here...the people are friendly and the food is good. I ","useful":1,"cool":0},"B4-OiDhHCdvtOm55Y3L8XA":{"text":"Surf and turf burger check, loud music check, brunch check, the spirit of Magazine Street ","useful":0,"cool":0},"jZOjVqHdOWmCYQkWVz1Z-g":{"text":"Ate here yesterday morning. A few things: the NICEST STAFF. (Or maybe New York has me forg","useful":1,"cool":0},"ktVO4nV98z-kJ2gv-uee8w":{"text":"Oh boy, this place is a hangover extraorinaire! When you walk into Slim Goodies, you are t","useful":1,"cool":1},"ZmFN67n3CTydQaP5ksHHeQ":{"text":"Had a great sitting in the beautiful back garden. The service was exceptional and the food","useful":0,"cool":0},"TIe1puwjTmqTiK1TT3RpCw":{"text":"First impression was not so good. When we first walked in for the first time the place was","useful":0,"cool":0},"HuHDURjF6gIwaZwf2jSYuw":{"text":"Everything took so LONG to get. we were there two hours for breakfast and we ordered out f","useful":0,"cool":0},"eRgakyBHUFV9_5JgzQoxTw":{"text":"PRO-Tip:  CASH only!!!! ATM on site charges $2.50 (plus whatever your bank charges), that ","useful":8,"cool":6},"t1wPD-AKL2rQbUjAzM681Q":{"text":"Only in NOLA for four days, but I ended up eating here twice.\nGreat breakfast place with b","useful":1,"cool":0},"Z5_eoA_BHsc3_H3KMtqdYQ":{"text":"The omelets are good sized with no skimping on ingredients. I had the Americana twice and ","useful":0,"cool":0},"uQt8gPC3z28_nKfkPYrKtQ":{"text":"Discovered this local favorite on our latest trip to New Orleans. The breakfast was outsta","useful":0,"cool":0},"8AiawrK0K0N1vqmyUkOawQ":{"text":"This is a pretty solid diner with good quality diner level food.  I'm not big into breakfa","useful":4,"cool":2},"Uc5pqODEmiZPcF45bMXtUw":{"text":"Trying to support our restaurants but I was disappointed in the quality and taste of a sim","useful":0,"cool":0},"qzZCxcouWvKFjWtU5yNQKA":{"text":"Whoever said you couldn't have heaven melt in your mouth goodness!?  OMG\nThe coffee ice cr","useful":1,"cool":0},"81R9kxG9G_Jke3OXhcjkXg":{"text":"Never being here before I was very excited to go grab brunch before my friend went out of ","useful":0,"cool":0},"0Cx7RbsmNIuVCUdxKLxtfg":{"text":"I'm not feeling well today and wanted the garden slammer to fill me up. I love that they h","useful":0,"cool":0},"TKGjqbeX4016RJVc2XVsrg":{"text":"The food was mediocre at best... $30 for waffles and crawfish étouffée with eggs was a bit","useful":0,"cool":0},"R_qZZ_nnDdVQDQjYdEy9-Q":{"text":"Slim Goodies is located on a \"cool\" stretch of Magazine St., close to American Apparel, Bu","useful":2,"cool":2},"EX3IF_yaV_tyusyQ0pmdzA":{"text":"If you are looking for a change of pace and some diner food, then this is a very good plac","useful":0,"cool":0},"tJARWC_o8OKAjmAK74PV4A":{"text":"One of the first places to re-open after Katrina. \n\nSolid breakfast, well managed wait lis","useful":0,"cool":0},"T82kR7tZ3DRr3O8e-fZjVQ":{"text":"Good classic diner food! Nothing fancy but if you want a solid breakfast for a reasonable ","useful":0,"cool":0},"ha6bevewPZZst2rt903lHw":{"text":"Eh, service was just okay. Food was just okay for the price. Coffee was pretty good. The e","useful":1,"cool":0},"7qAAVBlp2zNkRvvhCRFsjw":{"text":"Food is classic \"slider\" Amercan breakfast.  There is an extensive collection of omlettes ","useful":0,"cool":0},"zlrCPcxzAfFNms8ZAGos-g":{"text":"I liked the breakfast - I just had the basic eggs but they were great. My cutie had the li","useful":0,"cool":0},"CBs7Gg1HZ1cJkpf1RaNFAQ":{"text":"Our family had a great brunch at Slim Goodies today! In our party of 3 adults (all foodies","useful":0,"cool":0},"mi1ciLJy4AdGSAv1Omo9Rg":{"text":"Oh my god. Vegan heaven. Non-vegan heaven. The outdoor seating was adorable. Service was g","useful":1,"cool":0},"DEWoyG820sK69GdhhOscLw":{"text":"I love Slim's. The garden slammer is my favorite breakfast ever. Living on Magazine St we ","useful":0,"cool":0},"u1ubtuq7j61dh3W6lCIaoQ":{"text":"We popped in here for a quick breakfast and were not disappointed!  I had the traditional ","useful":0,"cool":0},"Awa7z3BjZBhgyBUuryHcNw":{"text":"Loved this place! Loved the atmosphere and the food equally. Fantastic prices with lots of","useful":0,"cool":0},"NS_iZt1Aa2-oHR_CXGgjTA":{"text":"Get anything with the crawfish etouffe. The French toast was great as well. Really cool at","useful":0,"cool":0},"-oDB9QCuu2Bke_4JUTUOHA":{"text":"Still a dump. What a shame. It could be a quaint quirky garden district diner that people ","useful":0,"cool":0},"20mVdcckiWXEz5WBEDjxXA":{"text":"the food is always good but the service is unpredictable...live in the area and for the fi","useful":0,"cool":0},"XkoSBScBU6Yct7Eo4vkqJQ":{"text":"Locals and the web are big fans of this breakfast place so naturally you'd expect long lin","useful":0,"cool":0},"HSMEfe2dro46L2x5bkqzmA":{"text":"Yum! I love places like this: home cooked food served by nice people.\n\nI stopped in here o","useful":6,"cool":4},"yyH2gFbSbkzrkCJpD42hAA":{"text":"Don't waste your time. Waited an hour and fifteen minutes for a couple of breakfast plates","useful":0,"cool":0},"l-H4OwaO_Rem90I6MwZTZA":{"text":"Opened after Katrina serving food and taking care of first responders. There cash only lik","useful":0,"cool":0},"D-LtmwtmlL8cHsIsF4akmQ":{"text":"We've been going here for a few years and really have had only positive experiences.  The ","useful":0,"cool":0},"Lix6AnpMfZVLqYihA_Lxcg":{"text":"I have been here a few times, usually mediocre at best. I went in and ordered the re-popul","useful":1,"cool":0},"Uh7Ed-aWsN8AB0_B0cNMww":{"text":"I have never had an omelette I have not liked until now. The omelette I ordered it was ver","useful":1,"cool":0},"FtQ4czOmXK3gn_rFTF90JQ":{"text":"I hadn't been to Slim Goodies since before Katrina. Before that, I had been a few times, a","useful":10,"cool":5},"QtJRk_C_-VtX6Jc8xcE17A":{"text":"return trip from last visit to N.O. and I wasn't disappointed. My pancakes were perfect. T","useful":0,"cool":0},"iGRwh1eQIyl6-IjoOi5ACQ":{"text":"Love this place. Take my family every time I come to the city. Just a great funky diner wi","useful":0,"cool":0},"4QpVm1pt1x51l4m5gOwWUA":{"text":"The plates are generally variations on the same theme (that is, there's not a ton of varie","useful":0,"cool":0},"H3shmXjF5rz7O31Nnwpl2A":{"text":"Loved by locals. Neat Place to have brunch but be prepared for a wait. Waited roughly 20 m","useful":0,"cool":0},"CUri-jqbhWSQAuCyXVUMUQ":{"text":"Interesting choices for breakfast platters, and it's very cheap. Coffee comes free with so","useful":0,"cool":0},"L0Ka3dX92FJIki_e0AUR-A":{"text":"I've ordered breakfast from here through Uber Eats when I'm hungover and not in the mood t","useful":16,"cool":9},"iRKu64HD3rK1UQgpgj4dVw":{"text":"I ate at Slim Goodies yesterday for breakfast. It was the first restaurant I visited durin","useful":1,"cool":0},"G1QtpTDVuVuL7cz3xmZx_w":{"text":"Delicious breakfast! They were closing early for the St. Patrick's Day parade at 11:00 and","useful":0,"cool":0},"vbTjn2GONGIQSlN4i8hjPw":{"text":"Sent me 1/2 eaten food with used utensils in the plate... Called and they told me \"I don't","useful":7,"cool":0},"NO2Zk0UoHtb_s-TaKzGSNg":{"text":"Slim Goodies has some pretty good food. However, their service is absolutely horrible. I w","useful":1,"cool":0},"gLYp4asw_bZRhZIiEIUM9Q":{"text":"This fine diner prepares their coffee much how I like my metal: black and relentless. Thei","useful":2,"cool":2},"n_cfKrXdVs42aiMv5K8KCw":{"text":"Great food, fast service. Perfect breakfast spot (especially if you sleep in a bit too lon","useful":0,"cool":0},"QTMesAse_4OShFmaGHxuAA":{"text":"Usually a great diner. But i just ordered the blt and it had 2 broken pieces of bacon. Not","useful":0,"cool":0},"9hWpHNyjbhKkXh1lxhx0Dw":{"text":"What an excellent experience. Old school diner like with a funky feel and good food. Servi","useful":0,"cool":0},"pwzj-PKWrFE7itfEQqUbZg":{"text":"Gluten-free dining is not something I expect in New Orleans. It's culinary lineage is dred","useful":0,"cool":0},"2PcFH_4xkzh7D_gkAdi7Vg":{"text":"CATSKILL-ISH: food, my burger was kind of small and had an odd taste;\nSHABBY: but cozy din","useful":2,"cool":1},"-ToQ1TOezvM4DzQ1xsSsIA":{"text":"Great place for a kick-ass early breakfast.  In fact, great place for a late breakfast too","useful":3,"cool":1},"B9LdB_Iit3zvRwlV9NsTLg":{"text":"As delicious as the pictures look! Such a warm and welcoming environment. It's a fun place","useful":0,"cool":0},"v3aW2AD6apAiiwz9-LaU1g":{"text":"Good food in a fun atmosphere. They greet you at the door as if they've been waiting for y","useful":0,"cool":0},"YPIAHnlB_Exa8DUMukdJfA":{"text":"I have never reviewed anything on Yelp before because I have never really had a reason to.","useful":2,"cool":0},"Vccuwp3gL6UJF5B_DgPdRg":{"text":"my husband and i lived nearby for about a year and a half and ate here at least twice a we","useful":2,"cool":1},"W_0R9JZaTYwHhdmP1pKqQQ":{"text":"This place has the worst service I've ever experienced in a restaurant. My friend and I we","useful":1,"cool":1},"KSy8BiJAyeNEp00cVzb8xA":{"text":"Awesome place for brunch or a burger.  It's cash only but totally worth stopping at the AT","useful":0,"cool":1},"ULK_7xrDtx5mL1V4brUeHQ":{"text":"Absolutely wonderful service and food!!! The patio is phenomenal, lovely, shaded (with tre","useful":0,"cool":0},"Yomn2n8EYNaT5hgORQ2QZQ":{"text":"Great for a diner but not my top brunch place in NOLA. They have vegan options--which is g","useful":0,"cool":0},"Is32GgGSzULq353NTJNMag":{"text":"Scabs?  Ripped up tee shirts?    Ugh, that IS NOT what I want to see when entering your re","useful":2,"cool":1},"nZq5-NE0CAIfDRYe4k7vGQ":{"text":"Anyplace that serves black beans for breakfast is automatically pretty darn cool but black","useful":0,"cool":0},"n3Gsgb-DZG35ii82QNsfqA":{"text":"Mediocre food for such a long wait time. We waited a while for a table for about an hour. ","useful":1,"cool":1},"BDTAtnsnE56ba3cZuXS37g":{"text":"I've lived in New Orleans for 3 years now and I love this place. Food is consistent, the s","useful":0,"cool":0},"9fZnqPKryDFXvL7_k_lBsA":{"text":"Took cab from hotel in French Quarter to go, had amazing breakfast....crab cakes with scra","useful":0,"cool":0},"AZHDLPdcbowVir-Q1R1__w":{"text":"The food was amazing! \n\nAfter a saints loss and hungover, we decided to hit this place up ","useful":0,"cool":0},"nnuizjWXw3Zd8iTsZGYIjQ":{"text":"If you don't know Slim Goodies, you have not had a proper breakfast. It's vegetarian frien","useful":2,"cool":1},"gj_8Oub5jBgscUUd26asIg":{"text":"What a place!  I would give Slim Goodies more than five stars if I could. The food, drinks","useful":0,"cool":0},"ltwuZrPKFh3KutDWDBhyuw":{"text":"Standard brunch fare, cute little diner type place. Sat next to some horrifyingly obese re","useful":2,"cool":0},"U6Hv6T95obCXSsc0Qgj_1Q":{"text":"I had a great experience here! They have delicious New Orleans inspired breakfast dishes, ","useful":1,"cool":0},"yCe1SYAsXGxZd0NaT6hCbA":{"text":"Favorite diner ever. Great food and location. Sit down and relax. Things here don't always","useful":1,"cool":0},"e474vH1rQfa6HvoahSgcaw":{"text":"Took 45 mins to get 2 dishes, a waffle and omelet, on a slow wed at 10:30. Food wasn't gre","useful":0,"cool":0},"CTZj4mmJmpGXa-GQQb5PKg":{"text":"Five Star Dirty Diner Food!! Relegated to One Star for the abhorrent service. I mean this ","useful":3,"cool":0},"TWSQInAMI5Yf1SVAMGWEgg":{"text":"a great diner spot for breakfast. Rosemary liked the waffels, but I thought them too thick","useful":0,"cool":0},"XhpQToEKLG9K0hZNzIx-bw":{"text":"My go-to spot for giant waffles and filling breakfast platters! Great vegetarian and vegan","useful":1,"cool":0},"3cJdYvJO8eXzdEQZX9H2iA":{"text":"The coffee was out of this world. The black beans were amazing. We had a very late breakfa","useful":0,"cool":0},"rY45EHQjF8E5z3hyNE_mIw":{"text":"During my brief stay in New Orleans I had breakfast here twice, and both times I had the s","useful":2,"cool":0},"FwcvIMPuP70kmHuTvTo87g":{"text":"Food was good specifically for being relatively cheap and large portions with creole flare","useful":0,"cool":0},"T7zghxWJGJdCD_WDWs2fXQ":{"text":"Typical breakfast food. Cute place. Decent priced. I don't think I would drive far to go h","useful":0,"cool":0},"QLzonXXAqRKKrFh8FsyejA":{"text":"Super slow for a breakfast place. They do many takeout orders and don't prioritize dine in","useful":0,"cool":0},"3zMP7Yau6eAVxeSeZZwXIg":{"text":"This place used to be great. I used to eat at slim goodies all the time, but that was in '","useful":1,"cool":0},"Riok3aw_ZZMiUz0UZpJOTw":{"text":"Saw a giant roach on the floor!! Food was lukewarm. Ordered the crawfish slammer and over ","useful":0,"cool":0},"M_cQ8qFqnj8KW2vb-bwxbA":{"text":"A wonderful place to take a stroll to in the morning. Food is amazing and will get you rea","useful":0,"cool":1},"Mu6V5LYTR7DIi3vVg1BGbw":{"text":"Slim Goodie's strives to be a classic old style diner, and it largely achieves that goal. ","useful":0,"cool":0},"phSTsry1y_u1o4fiecW89g":{"text":"Waited almost 40 minutes for our brunch today! The diner wasn't even half full and we sat ","useful":1,"cool":0},"UMqyhflfzz_n8Wk-ul6ogQ":{"text":"This is a pretty solid diner with good quality diner level food.  I'm not big into breakfa","useful":1,"cool":0},"y3U138Y8b2oT-me9TxSdZA":{"text":"Slim Goodies offers vegetarian options, which is what drew my friend and me there. The din","useful":1,"cool":0},"RPp2YnzVUSF-wS4hzUXerA":{"text":"Idk what else to say other than the food is bad. The pancakes are horrible. I could make a","useful":0,"cool":0},"a7BeYSWUUEwUvCMh1NOV3w":{"text":"Had breakfast a couple of days ago here and it's what you'd expect from Magazine st.  My b","useful":1,"cool":1},"PWUlETg3xVTW7BnKe65DYg":{"text":"Went here on a Sunday morning to place a to go order. I saw online that they were a good p","useful":0,"cool":0},"9z1-xkQmHqafeoRTo_LjuA":{"text":"Food was a 4; service was a 2. Tex Mex slammer was delish. Unfortunately, all our 4 plates","useful":2,"cool":0},"7icHljLG26cKN3Yg_HI8NA":{"text":"We have been here a few times and the service is always slow. Today, however, we and every","useful":1,"cool":0},"81VL6IC9CIa8tbYfY4W0cQ":{"text":"Great food in this causal diner!  Very unique breakfast entrees.   Super tasty food.   The","useful":0,"cool":0},"o0eFA4Wetv36gd-IJPaClQ":{"text":"I loved this place. It's a reliable place to go right on magazine at any time of the day -","useful":0,"cool":0},"rmCNSuiJfRBMIFoObQPC8A":{"text":"Out of town visit and the hipster organic vibe fooled us.  This wasn't the brunch to love.","useful":0,"cool":0},"fQWMN-EI5ys05az0IV6otg":{"text":"I was very excited to have breakfast here after reading the reviews however I was very dis","useful":1,"cool":0},"EKGV9-dnyBlXT7en3XkGWg":{"text":"I love this place.  The pancakes are extra fluffy.  Everything I've had on the breakfast m","useful":0,"cool":0},"z8AsGjznNrPxaCclkKleWQ":{"text":"Barry was our server and made us feel like we were regulars instead of out-of-towners! Foo","useful":1,"cool":0},"ymp1ZIDHIrk4dziqWD6wiw":{"text":"The staff and servers were incredibly nice. Food was good, but my grits and hash browns we","useful":0,"cool":0},"r83l9n6HKcf-yLarE823NA":{"text":"My favorite breakfast spot in NOLA - the Creole Slammer is hands-down the best thing for y","useful":1,"cool":0},"3XUnN4U17LlfQe8e7I_mfA":{"text":"So this place by far is my neighborhood hangout and I might be slightly biased because I a","useful":0,"cool":0},"A_EpUKVx9iuNCkIMydk68A":{"text":"Creole slammer is the way to go even out of season. The eggs were perfect (I admittedly ca","useful":0,"cool":0},"W5-5Nd2W_9U-JzrfnLcrZQ":{"text":"Hipster diner. In a good way. \n\nIf this doesn't make any sense to you just talk to the wai","useful":7,"cool":8},"a1KpuSviZfX1dP_ya5IPWw":{"text":"This place is wonderful. We sat out back in FEBRUARY! In the backyard. The staff was great","useful":0,"cool":0},"QhGxB5zXW6ZxuoyDPt68XQ":{"text":"I would not be able to live in New Orleans if it were not for Slim Goodie's.  Since I am u","useful":4,"cool":3},"QqRL86B41G4cmRB5-2zRdg":{"text":"Here is one of the reasons why I know that New Orleans is not a breakfast town: people LOV","useful":4,"cool":2},"k5XEkeVyESYarSocMM258Q":{"text":"Best breakfast and service. Split the contractors combo with the beautiful wifey. It consi","useful":6,"cool":4},"84DmAyRV_r2SqWFP7jyHKQ":{"text":"Went here for brunch one Sunday and was pleasantly surprised. It was busy so the hubby and","useful":4,"cool":2},"HVh604K-YI0zCVmKJKXbJQ":{"text":"The only reason they even get a star at all is because of the waitress Madison. She was ch","useful":0,"cool":0},"d3kmrtIpWtX-VcPQU0zo-Q":{"text":"Cute spot, but pretty basic food.  We ended up waiting a while and evetime we asked if our","useful":0,"cool":0},"9p8cGrTgWDjh2sXE5suXYA":{"text":"Little great breakfast place in the Garden District.  Food was great. The Orleans Slammer ","useful":0,"cool":0},"_CLu4PQUWwx3LYCKwt4Fuw":{"text":"During a recent trip to New Orleans, my friend and I did the unthinkable...we skipped dinn","useful":4,"cool":4},"GozCXYMD0EBHwk68ughmww":{"text":"Slim Goodies, thank you for saving my life more times than I can count!!  If it weren't fo","useful":1,"cool":0},"zFMr8E01Ge5ZMf737RIBCg":{"text":"I only get one thing here -  The Garden Slammer, vegan style.  Now it's nothing too crazy ","useful":0,"cool":0},"TBIJAOGnVGhF4onejXR6Lg":{"text":"Sitting at the bar is always a treat... Love seeing the food cooked fresh and hot...\n\nMy f","useful":1,"cool":0},"8petpmpl9hYEWp0a-XpAaA":{"text":"I come here for the breakfast.  It's always hot-n-fresh. Staff here is quick and friendly ","useful":0,"cool":0},"xTvpFxt8c89jldBENasUqw":{"text":"Great ambiance, great service, good food. \n\nI ordered the RE-population combo and added so","useful":0,"cool":0},"-MhaDQmwgXMhamZ_pCKE_w":{"text":"Cute place, funny menu descriptions. Service was slow, food was alright. Not sure I'd make","useful":0,"cool":0},"YdWE5ZakBH5AjR6pJi092w":{"text":"I had their Katrina burger which was their specialty during Katrina (duh) and it was great","useful":0,"cool":0},"8sY1OSyrYx_Fc_UTzx4Qkw":{"text":"Came to Slim Goodies with a groupon, and was pleased but not blown away.  I had the Jewish","useful":1,"cool":0},"zo5OLdoh5Cu6oY564gkd1w":{"text":"This place was great. They don't serve alcohol but have a BYOB policy.  The Creole slam wa","useful":0,"cool":0},"Jbn-1d22AE83pupqws33zA":{"text":"Otherwise knows as slim's is a colorful lunch and breaksfast spot that reflects the person","useful":0,"cool":0},"0jHwLHb8OWInkezkQreS8g":{"text":"The classic, delicious breakfast food you're looking for! We ordered the Re-Population Com","useful":0,"cool":0},"S0VhpuNjvai2vBrFR3h5Cg":{"text":"I SO wanted to like this place.  The customer photos on the walls, lovely server, menu ite","useful":2,"cool":2},"5oO1OGqRgSdFSyjegPlDwQ":{"text":"I eat at Slim Goodies about once a week. As a vegetarian, I love the menu. My favorite is ","useful":1,"cool":1},"0lX-OLfeJ4TYUnOIkxEgEQ":{"text":"Savannah is an amazing waitress, great conversation and gave us delightful recommendations","useful":0,"cool":0},"MQn7A_ahZJ_CMcdexUVb9A":{"text":"Waited a little while on a weekend morning to be seated. No big deal. Our name gets called","useful":1,"cool":0},"xP6wO8YHzWFUOWr8DEZ8zg":{"text":"Slim Goodies is a cute diner in a great location on Magazine - you can browse the racks at","useful":0,"cool":0},"8s-b1TpwnHAAxG1TqJ6osg":{"text":"What a wonderful place for breakfast! I loved the heavenly waffle. My husband had the Creo","useful":0,"cool":0},"L1Qhnrjf4AdTkzbB_TQoUA":{"text":"If you are looking for a small hidden gem, that is not your typical touristy diner, this i","useful":0,"cool":0},"F3gkaIBje5ibk4WTwk-gkw":{"text":"Don't let the crowd of people outside the door scare you away from trying this great brunc","useful":1,"cool":1},"IZwliVagf_heVDFYLZQKAg":{"text":"To hear good things about a place and then get what I received is .. disappointing to say ","useful":0,"cool":0},"nUcI_GJLs41znrAnY-zavA":{"text":"New Orleans, Louisiana ---\n\n\"Slim Goodies Diner\" is a rare traditional counter-seating \"ba","useful":0,"cool":0},"VY0VX5M3pJO_ksS3roAq1w":{"text":"I ADORED this little place!  Especially for the atmosphere and service. We found ourselves","useful":2,"cool":1},"NpeediGBq2tNHiVzlxTKYw":{"text":"Slim Goodies is one of my favorite breakfast locations. Serving everything from delicious ","useful":0,"cool":0},"nQLVZxA0FueQLd0cFQ_vyw":{"text":"One night, I got a late night sweet potato pancake craving. I frantically researched place","useful":0,"cool":1},"ne4JVIZ9Do_yj-ukh_DpiQ":{"text":"Excellent, large breakfast, and a cool location. The black beans are great.","useful":1,"cool":2},"LlNqokLkGQqupYJEyvyg6g":{"text":"I love this place.\n\nI ordered the Jewish Coonass, which, to be honest, tasted really good ","useful":2,"cool":2},"eTOgC2i5EkGg9bQkugzOvw":{"text":"This is my favorite place for brunch. The veggie slammer? Yes, please.\n\nIt has a retro-vin","useful":1,"cool":1},"jKI58pEtI3QN8yr2eiJgnQ":{"text":"New Orleans, Louisiana ---\n\n2nd visit to \"Slim Goodies Diner\" ...\n\n1st visit around 7am wi","useful":2,"cool":1},"XDDjn598rGYTTiYcYbqJfg":{"text":"I'm a easy person . There is barely a Resturant,I m unhappy. This Resturant make me feel w","useful":1,"cool":1},"zvI3kwsFHacEBzYe6y8nGg":{"text":"In passing- -I always noticed the funky, fun atmosphere of Slim's, which immediately struc","useful":0,"cool":0},"hYHPlJ9SGY54WwYuWqQj8g":{"text":"I've always loved Slim Goodies. However after this last experience I can't see myself rush","useful":2,"cool":1},"O4eckNNnTQtvb1-Bg4OVSw":{"text":"THE OLD VIBE IS BACK!\nNow that the Katrina Carpetbaggers have finally left town, the old b","useful":8,"cool":4},"k2Z2cDBgfsp9Z85Z01-J-w":{"text":"It was our first time eating here. We ate on a Monday morning around opening time (6AM). W","useful":1,"cool":0},"JRsJAHM8p1JCIeSVsOMj9A":{"text":"We were in New Orleans for just one day and were searching for a good breakfast spot that ","useful":0,"cool":0},"bWva1dx40CG7yWhnmsFPHA":{"text":"Small portions, overpriced but very good.   I had the napoleon Benedict and it was tasty. ","useful":1,"cool":0},"P_w6zBcJAalEVnAXU6FjUA":{"text":"This place would be 5 stars if it wasn't for the ridiculously long wait that's always goin","useful":1,"cool":1},"uSBlc8wdFpoxhvXm9pBH1w":{"text":"Social distancing guidelines are being followed here (along with pretty much everywhere el","useful":1,"cool":0},"Kxto-JclaYQWEqv150eUgQ":{"text":"I've eaten here a few times, and the food is alright, while the service is terrible.  The ","useful":0,"cool":0},"eTc1WVI_WlYtdtzJVQhO6A":{"text":"Decided to venture in today. Looked like a cute eclectic diner. Sat down and got served pr","useful":0,"cool":0},"lD6NGyFQ69jtutn8Mlxvhg":{"text":"LOVED LOVED LOVED THIS PLACE.\n\nFood was fantastic.\nI had AMAZING crayfish creole over hash","useful":1,"cool":0},"GutKy9jmEASu1JHi-ofJxw":{"text":"Great breakfast food. Not the hugest portions I've seen, but very good. The place is small","useful":0,"cool":0},"4GtAtRVehXGp3fiHUZrifg":{"text":"I called for a Pick Up order, and the rude guy on the phone said \"Not doing that today\" an","useful":5,"cool":0},"ylc6h_Qpj1-j9B6K0aEnPg":{"text":"I really liked Slim Goodies. My friend Smash met me there and she made a great choice. I w","useful":0,"cool":0},"jXp6IMiY4YrSlqeZVVjm5A":{"text":"The Cat 5 burrito was so good! The spinach was fresh the jalapeño was the perfect level an","useful":0,"cool":0},"Z639bPv-eqhIvl1molDG2A":{"text":"It pains me to say this, but I now understand the negative reviews for Slim Goodies. I ord","useful":6,"cool":1},"J-hR8XydH9TTZKIDv-jUTQ":{"text":"The breakfast here is great, I think it definitely runs more on reputation than anything e","useful":0,"cool":0},"ZryLMpazkUYp_Eklf3HYZw":{"text":"I've never been disappointed coming here. This is the bf's favorite diner for sentimental ","useful":2,"cool":2},"jcvzjlQ55ScKaUENB9dDFg":{"text":"Eating there this morning, 3/20/2015, a rat the size of a small cat ran over my foot and d","useful":1,"cool":0},"gWGMti2SucU-7TXlIMNxMA":{"text":"Love Slim Goodies! This place is a classic Nola diner with so much character. The food is ","useful":0,"cool":0},"6V0vyaxLwRjgXEG7JXn1uQ":{"text":"Slim Goodies is by far my favorite breakfast spot in the entire city. The menu is extensiv","useful":0,"cool":1},"ZSTJvv9ivZJZma5XgD5y0w":{"text":"We always hit up SG when we visit NOLA, and usually gravitate towards the same egg dishes ","useful":0,"cool":0},"ZKVmciGWR3HxPZYaK5ksLw":{"text":"Terrible experience... we ate there on 06/21/19. Our server had the big mustache and the w","useful":3,"cool":0},"oKLCpA53yDxMm0B3vs6s4w":{"text":"Great food for breakfast and lunch. The decor is diner casual with eclectic Polaroids of f","useful":0,"cool":0},"OOU3ofVt0xUUakb_4e9XKw":{"text":"I love Slim Goodies. Its truly a great place to get some breakfast. Pancakes, eggs, you na","useful":1,"cool":0},"LKGqyo4w-JpjD7YCIS4tmg":{"text":"What an excellent brunch spot! If you're into milkshakes the iced coffee shake is deliciou","useful":0,"cool":0},"e9zNbqdAmzi5A_Qs_PWl4Q":{"text":"We were seated and attended to right away. Coffee kept coming and our food came quickly. I","useful":1,"cool":0},"LOFDgOJvsO_HhzZYB2w4CQ":{"text":"Great food. I love the pancakes, but it's always busy. The wait time to get the table isn'","useful":0,"cool":0},"YdKakqb4RAC2peXS6qfDzg":{"text":"Good very reasonable funky quirky diner good portion size a4 because hash browns were cold","useful":0,"cool":0},"-oG7QDwHqBtHaP1tr_ssDw":{"text":"Ordered three large crawfish etoufees for delivery. Got three of the below, with no rice. ","useful":0,"cool":0},"Fh4QB-gvON8FDK4xNRAtQQ":{"text":"New Orleans, Louisiana ---\n\n2nd visit to \"Slim Goodies Diner\" ... \n\n1st visit around 7am w","useful":0,"cool":0},"VNp6z1jYcP_mlcBpTMftXw":{"text":"I wish the tofu scramble wasn't SO oily, you can move it to the side and have a big slab o","useful":1,"cool":0},"f3zZ3WpfDdYmrqR7VLu2Ww":{"text":"Loved the biscuits, coffee, and the great local vibe.\n\nThis is a terrific Mardi Gras break","useful":0,"cool":0},"p6IlxKxUEPCcaXPiq5GbPg":{"text":"My son-in-law host, Michael Pelias, a NOLA native just calls it the Diner.  Had a great pa","useful":0,"cool":0},"6bOsNR932f7SHyZOM82luw":{"text":"I always eat here when visiting New Orleans. They have the very best waffle I have ever ea","useful":0,"cool":0},"hpBjxOwsCIqfHlBYiDzpSg":{"text":"We had lunch here after the restaurant was highlighted in a Yelp e-mail. Burgers were okay","useful":1,"cool":0},"OGj9VBVHpgBx5BrHNLJE8A":{"text":"Don't bother. With so many great places to eat in this city, this was a huge disappointmen","useful":0,"cool":0},"SoJccO8bRT5aMF0dO1Jrsw":{"text":"Great food, they even had some vegan options! The outside section is nice too. It's a good","useful":1,"cool":0},"nJP_wqA9MyThJjxjCtXNwg":{"text":"Love the menu! Service is pretty no frills but how high maintenance can you really be at b","useful":0,"cool":0},"71Q01t-x-BOSy0vsROw-AA":{"text":"Super disappointed since I had wanted to try this place for awhile.  We were skipped over ","useful":2,"cool":0},"O5pMBmQijO8DjwZCU6P6dA":{"text":"We wanted to eat at another restaurant before boarding for a cruise but the wait was too l","useful":0,"cool":0},"a6Wqxl3TofbzR92hPLV5EQ":{"text":"Very messy, dirty, bad service, long wait on the food to be served, and the food wasn't ev","useful":1,"cool":0},"MpkSLkiLaDcjF4X01fejMw":{"text":"Amazing food and very good service. You may have to wait a bit and sit next to strangers t","useful":1,"cool":1},"7uhouF_CH8wMj1Xfel1h5A":{"text":"Great diner that serves breakfast or lunch all day long. Reminds me of Clover Grill ...goo","useful":0,"cool":0},"klsF_d7VVjke_1gjDn7umw":{"text":"We had a ball with friends over brunch. Cute atmosphere, GREAT banana pancakes, and outsta","useful":0,"cool":0},"AqnsVQ_O_0yFA8qbHM-ZDw":{"text":"Lots of local character with photos and knickknacks on the walls. From what I remember abo","useful":1,"cool":0},"FShsRZrFTvuOlv24FmcfpQ":{"text":"Great breakfast place with hipster yet old school diner feel. I wouldn't order anything to","useful":1,"cool":1},"uQSUeh7zN1BG4eb9YOz9mg":{"text":"This place is over crowded and we ordered a couple dishes with crawfish etouffee and I don","useful":0,"cool":0},"Us3J-HiCI92QoTghLfIO2A":{"text":"Slim Goodies is the perfect place for breakfast after a late night out. The menu is huge! ","useful":0,"cool":0},"ptRtU5reQJsOQjc7JBUp0Q":{"text":"We've enjoyed this spot many times in the last couple years.\nReally good food and service.","useful":1,"cool":0},"dFwLQTw0YX5i21Un0K6WVA":{"text":"Every time I go to NOLA, I say I'm going to try a new place for breakfast, but I keep comi","useful":1,"cool":0},"OeJwtlEKJnV6QKHu9DNaXw":{"text":"Stumbled upon this place while walking down Magazine Street. What captured me were the tit","useful":0,"cool":0},"HbsdAPJGS4k3FwT7sk_vzw":{"text":"Holy moly! A beacon in the darkness!\n\nGood food! Good music! Good service! Great atmospher","useful":0,"cool":0},"H3kpUuG7y3R4tFzSt5DiBw":{"text":"Loved everything about this place, food was delicious,  friendly staff and get spot. Very ","useful":0,"cool":0},"QnWZf-JTZOAl_lA7_HqasA":{"text":"Way cute, affordable and damn tasty. I had to really search for something on the menu that","useful":0,"cool":0},"FwgkDToGJ51W-4GZdslnyw":{"text":"I absolutely love this place! A true NOLA experience, a punk rock diner. Mostly breakfast,","useful":0,"cool":0},"03L0WLPqWRZyruRYLfL1LA":{"text":"The food is great when your able to get food. The problem with eating here is they pay mor","useful":0,"cool":0},"DML7PVS08KgBqSlwAKaX6Q":{"text":"Took over 5 mins for someone to take my order.  They were not busy.  Much of my tex/mex wa","useful":0,"cool":0},"CSoRJEh4dMPo4J23TSjJWw":{"text":"I go all week fantasizing about that sweet stack before the weekend finally comes and I fi","useful":2,"cool":0},"LOERTipUKUhDq6BayAXqUg":{"text":"Fantastic breakfast/brunch!  Who walks out with leftovers? Rookies do!\n\nPS...to the employ","useful":1,"cool":1},"WibBFnIfOlsFtD83csGE2w":{"text":"I JUST had breakfast here 1st of all the waitress was super friendly although I may have c","useful":0,"cool":0},"leb7fspxhK7F2ljUjx24FA":{"text":"Delicious food. Service just ok. Get the hash browns and definitely a biscuit (or five.) \n","useful":10,"cool":10},"ZHSUhntMlWlwhmFrDEHA-Q":{"text":"- ambiance was good, everything you want a diner to be\n- service wasn't very friendly and ","useful":1,"cool":0},"YN_dHGLMHghOBbCUYgZcbg":{"text":"great diner fare excellent atmosphere with the funky cool feel of what Magazine Street off","useful":1,"cool":1},"PRtYfFuMwwA2-eEvMlF5Zg":{"text":"This place sucks. Word to the waittresses of America - a Tip is \"to insure prompt service\"","useful":2,"cool":0},"lQ4RmKQsf5KbBClQkpXZPQ":{"text":"If you want to experience the downfall of a once great establishment by staffing with enti","useful":0,"cool":0},"5hPBSipE4RE18F6-CLvE4w":{"text":"I ordered the fruit, granola and yogurt parfait and the guatemalan breakfast via postmates","useful":0,"cool":0},"MY9fTfPsr2PIMn0sFVJrqg":{"text":"Nothing pretty or fancy, just good old breakfast food fresh and fast. I've been trying to ","useful":2,"cool":1},"3nSfgZb-NGVxVwu6vKGTWw":{"text":"So yum. Good, just so yum.....\nWent there for the first time this afternoon.  Had the Orle","useful":0,"cool":0},"NRSUZ057WHJf0fnt5iBwew":{"text":"Slim goodies is absolutely fantastic.  You get what it says in their exhaustive menu, your","useful":0,"cool":0},"Qpl_2KbQUHFjI6wN81Y6ow":{"text":"The food was cold, the hashbrowns were burnt, and the beans had no flavor.....Let's not fo","useful":2,"cool":0},"dArPqF0lNYvPpmVwauJKhw":{"text":"Great service and solid breakfast/brunch food! Cash only \n\nCool, authentic vibe with great","useful":0,"cool":0},"sr-HTQrZSA_aBjxZSGR3UQ":{"text":"Love the Champagne brunch here it has everything delicious in the menu. We tried Creole Sl","useful":0,"cool":0},"kV1G95Ttc_kyZ1xYw04u7Q":{"text":"I've actually only eaten here once with a coworker.  The food was good, but not overwhelmi","useful":4,"cool":0},"M4cRRz2TnE0HtyHedi7umQ":{"text":"This has some of the worst breakfast/brunch in the city and only survives because of the i","useful":2,"cool":0},"tYGL9YAhKsOmfQ-Ic29ZHQ":{"text":"This restaurant was quirky and the staff were kind. However, the kitchen lost our ticket a","useful":1,"cool":0},"SNzQaa7WJzYUmExGxQvETw":{"text":"This diner was our first stop once we touched down in NOLA at about 8am. It's a cute littl","useful":1,"cool":1},"QOZv5ISA6Z020xQSOXt1Uw":{"text":"Went here for Sunday brunch. We were seated with no problem. We sat outside, which is a ni","useful":1,"cool":0},"CKEM5TUjZrlybvVqmqNkuw":{"text":"Solid diner. BYOB with no corkage fee. Cash only. ATM on site and Chase ATM on the corner ","useful":1,"cool":1},"tPjY5z-sTn6o0jVUHpz04g":{"text":"Perfect NOLA diner. Friendly staff and excellent food. The menu offers something for every","useful":0,"cool":0},"Xa5IxzePwWfwQC3JD7Ja1w":{"text":"Waited for an hour for 2 breakfast plates they were not busy, server was terrible and only","useful":0,"cool":0},"k9RQW_bK7GBq2E9e55FjWQ":{"text":"7/24/16 Tried this eatery which had an Austin vibe. Didn't have to wait long for a table a","useful":1,"cool":0},"K3EPjAUEmo-DvuPuOflpLA":{"text":"Sure, the food took forever, and we had to wait quite a bit to be seated, but it was certa","useful":1,"cool":1},"zpYAvkURbDs1fc-NazmIlQ":{"text":"I really enjoyed Slim Goodies. It makes perfect hangover food, the atmosphere is casual an","useful":0,"cool":0},"JCVORawjsmuFpz0LHrhykw":{"text":"This place might be popular, might be busy, but the food is cooked to perfection. I'll hav","useful":1,"cool":0},"7Yn693yRGl2ltDfjDkw8yQ":{"text":"Great place for big breakfast, and they offer many options to choose from... They just nee","useful":0,"cool":0},"1LXqU-ff8_EtcO1dI7EVPA":{"text":"Good selection of tasty food and staff was friendly! Must visit, it's a small place, so yo","useful":0,"cool":0},"WdqE816QOe5z1p83WuC8aA":{"text":"Good food, decent service, price is right.  The atmosphere is a bit punky and this may be ","useful":0,"cool":0},"2VPZINo66EfBxc0f-_AObQ":{"text":"This was the one disappointing meal over our 6 day trip to New Orleans.  The iced tea tast","useful":0,"cool":0},"VW8A5Guuqc-nthfEebQrJQ":{"text":"Unfortunately, we were really disappointed with this diner. There was no host when we came","useful":0,"cool":0},"GAdrBz_z-vMOGwSklnnULg":{"text":"Breakfast with attitude. Would you like to order something and leave off one ingredient th","useful":1,"cool":0},"jY-Yiwo4kOZ-IaXgigK5Rg":{"text":"If your looking for a place to eat Breakfast or Lunch in a cool atmosphere check out this ","useful":0,"cool":0},"lpkHrxClE0dZAHiLQXnyyQ":{"text":"Hi I had the Jewish coonass. It was recommended by my server Kim.It was really good.Kim wa","useful":0,"cool":0},"wZEt7n7qmqyQX9YDeqRQmg":{"text":"I often visit New Orleans (live in Los Angeles) and this place is rad. Absolutely unbeatab","useful":0,"cool":0},"HHqCDCEWeOnoTcTnHCA6CQ":{"text":"Had breakfast here ... (Yes, after a night on the town!)\nOh wow - yummy, yummy, yummy - de","useful":0,"cool":0},"rk9HBTR5EswcKlvdjG3DSA":{"text":"A great breakfast joint. \n\nI love the Jewish Coonass... I mean, I really like saying it, b","useful":2,"cool":0},"2fhG7YJcdFNkUKGeZ_p1rQ":{"text":"Expected better.  Ordered over medium eggs and they were nothing like that.  Pancakes were","useful":0,"cool":0},"N541TsXk8np4givQPx2X9g":{"text":"Great food and service,  and I was very happy to see the advanced effort they made to make","useful":0,"cool":0},"7Rh9hPgqvQAfdMYrgnh0EA":{"text":"Great breakfast spot, the sweet potato pancakes are the , great fast service and everythin","useful":0,"cool":0},"KnzDnnAwxnH8iXb_OB2c0g":{"text":"I really enjoyed getting breakfast here. The staff was very friendly and the decor is awes","useful":1,"cool":0},"txohr-QIgT4FqUcu4RSu3A":{"text":"What an awesome NOLA gem!  Everything about this cozy little diner makes me giddy!!! The n","useful":2,"cool":0},"yUVIshdJegE7aK8suEA49w":{"text":"HANGOVER CURE: This thing was so much freaking food and every calorie was worth it. Eggs, ","useful":1,"cool":0},"Fva5ccCiLpPiImv6vzIHzg":{"text":"Service is a little hit or miss, but the food is great. I love the Garden Slammer. We ate ","useful":0,"cool":0},"_p_XpSrwtIKfqmNYdZa1MA":{"text":"I just ordered the Green Market omelet.  It looked good but was flavorless. Not even salt ","useful":1,"cool":0},"RyIBnkLTuKOcYmBx8cXHGw":{"text":"Terrible. Don't go.  I almost never write reviews on Yelp but this place was so bad I felt","useful":0,"cool":0},"j6UqE1Cc76pgpAtWBQQyaw":{"text":"Yum. Great place, great staff, great food, great selection with healthy alternatives, huge","useful":0,"cool":0},"IBwRB1uR_2NTvcwdK2vPSg":{"text":"Really, really great diner. Walk through to the back patio on a nice day. The tex-mex slam","useful":0,"cool":0},"qnetHSfNfzkdWs9kLIjCdA":{"text":"To start with, the food was not good. Ordered a breakfast burrito and it was essentially a","useful":2,"cool":0},"F_31MeXmL6uikDLY6DxTfA":{"text":"Wonderful early Sunday morning spot! Perfect proportions for food. I couldn't finish my pl","useful":0,"cool":1},"C-WgShs8DtDi2B_Z5Ru8IA":{"text":"After almost ten years of patronage I will not be going to slim goodies ever again after t","useful":1,"cool":1},"HcWpt5WDX2AvOdhNa3WTNg":{"text":"Been waiting for over an hour and counting. \nStill waiting as I write this review!!\nHow do","useful":0,"cool":0},"wTiO70O-yluyITmBl6jLIA":{"text":"Absolute slowest lunch service I've ever encountered for a simple couple of egg plates. We","useful":1,"cool":0},"Aswypg2ly8K7jnigj0yGag":{"text":"Perfect neighborhood New Orleans diner. Eggs, meat, pancakes, omelets, fancy fixin's and m","useful":1,"cool":1},"Fd16wIkkDOKT5Rs1xQwh3w":{"text":"Adequate menu.  Average quality food and decently prepared but nothing to write home about","useful":0,"cool":0},"88nFgFAGZSf2mL0iggFFag":{"text":"APPALLINGLY AWFUL. They really don't seem to put much effort into the food here, and I'm a","useful":1,"cool":0},"XQZ57-FCaW4JL04DVLBQLA":{"text":"Slim goodies is an A+ place for when you need som good diner food. Not only do they have c","useful":0,"cool":0},"KdwKkgUychL1lIKN633DkA":{"text":"Every time I eat here the food is great! I love how many vegan/vegetarian options there ar","useful":0,"cool":0},"Mix8ro8-3C6trT7AXOD8Hg":{"text":"It's a greasy spoon, but it opens at 7am and the waitstaff is super-friendly and helpful a","useful":1,"cool":0},"4o4Dh7vu3VmWUezwrvQm3w":{"text":"This place was like veg nirvana for two tired travelers after wandering the Garden Distric","useful":0,"cool":0},"zMetCzpoZcRNKw2yE_ruHQ":{"text":"If you want to eat good food at a place with a lot of character this is the place for you.","useful":3,"cool":1},"61SdVzXhBe4l_hdlIw0X3A":{"text":"We were not impressed. On a cold winter day, our eggs arrived cold and unappealing. Servic","useful":1,"cool":0},"rsa-ZxHkNzCfDcsLHQpLkw":{"text":"I really love this alternative little diner.  All over the walls there are polaroid and fu","useful":1,"cool":0},"emIb0Pjhhvj6kvCBwEoiHw":{"text":"4 stars for the food, 1 star for the service. We waited about an hour to be seated, during","useful":1,"cool":1},"sBdzT3Pf0XIvoakGqweV1w":{"text":"Five stars easily. Best omelette I've ever had. Fast service too. The building was air con","useful":0,"cool":0},"aZ5p5qUhwfjlx2ZR3SU_vw":{"text":"So nice we had to visit twice. A few months ago I went here with family and it was so good","useful":0,"cool":0},"fXEodH5REPuS95vKpNve_A":{"text":"Food is always great but they've got to clean up this place. We had to move tables because","useful":0,"cool":0},"bvk2QZXTGuH-q0zYYIWOFA":{"text":"SG's never disappoints!!! Even with big crowd service n food was A+.\nThat sweet potato waf","useful":0,"cool":0},"fuT7pWzZvLszmzXWalmxfw":{"text":"My husband and I visited Slim Goodies for the 1st time, and the service and atmosphere was","useful":0,"cool":0},"8WnzqP9C81aUluoGpqL9zQ":{"text":"Slim Goodies...solid greasy spoon.  I am not much for eating out for breakfast or lunch.  ","useful":2,"cool":1},"_D5VPD-tWtINqYLYaMP7yw":{"text":"A diner if there ever was one. \n\nSlim goodies offers quick, efficient service. Clean table","useful":1,"cool":0},"KY6K5dnqM56cReKfCN4Fsg":{"text":"I really want to like this place, but I just can't. Usually I'm a really generous forgivin","useful":9,"cool":0},"dfeBAhVAypGwDiltwZGcMw":{"text":"No joke - this is the greatest brunch experience I have had to date. I love this establish","useful":1,"cool":0},"Cx5vhxuRwhAKx26xFpemgw":{"text":"I came here for brunch with my cousin and niece. I had the Tex Mex slammer and it was deli","useful":0,"cool":1},"Rc1kDfHTPA6T-EbOBvlgcQ":{"text":"Amazing food!!! I was intrigued by the idea of vegetarian comfort food and was delighted t","useful":0,"cool":0},"MbDut9sCH3SaV66lU5Rnlg":{"text":"After doing some sight seeing, we found Slim Goodies because they offered vegan options fo","useful":0,"cool":0},"bUun9auyjhYkN-fpVSlo9w":{"text":"I can't explain how much I love this place. It is a local diner we stumbled upon a few yea","useful":1,"cool":0},"Ipp6h9DoLZghCls0UerAbQ":{"text":"Had the creole slammer and it was delish. Friendly staff and great atmosphere. This is NOT","useful":0,"cool":0},"9rYCpqq147YObK6jzDusWA":{"text":"Can't go wrong with the TEXMEX or SINKHOLE! Straight up diner atmosphere. Staff always coo","useful":0,"cool":0},"kmgc-dagtAhM7IYvWPOZ6w":{"text":"Ok, we went on a Wednesday, but our service was outstanding. I read all the horror stories","useful":0,"cool":0},"mm--8mAHnUcLnEUQhoO1kw":{"text":"Had a great brunch while exploring magazine street area. Took the trolly down and visited ","useful":0,"cool":0},"Kow5gEyyQvn0mSrBkhC3Ug":{"text":"A fun diner on magazine street, it's got all the goodies...I had the psychedelic mushroom ","useful":0,"cool":0},"UvYbwjHD3ztwOnaXWAFtMw":{"text":"You have to come to this awesome place and get seriously anything on the menu - my husband","useful":1,"cool":0},"me-dtWJzu_wOZfXQve97Tw":{"text":"Walked in with my fiancee around 10 and was seated immediately.\nI really enjoy the vibe he","useful":2,"cool":2},"2uRlclK8899zYdAIs1UgRA":{"text":"Underwhelming- as accurately described by my husband. Creole slammer sounded like everythi","useful":0,"cool":0},"-w0thimdn62kgUDSQFe8Sg":{"text":"I am temporarily staying in the area with my family since Hurricane Ida destroyed our home","useful":0,"cool":0},"2d7-mnsSRwLsfvwiNsqRjQ":{"text":"I'm convinced that one of the most disappointing feelings in the world is wasting a meal e","useful":3,"cool":0}}