{"jxZl_7-x0WRYbq4zn7N3dA":{"text":"My boyfriend and I stayed there 6/23/2011 for 3 nights.  The staff is incredibly friendly ","useful":2,"cool":0},"-zRtKy4-VHDm82_vAZBJHQ":{"text":"I am will (and can't wait) to stay here again!  Very friend staff with great recommendatio","useful":0,"cool":0},"3EBlr8zyfbXxunqqm8LaiA":{"text":"Best place to stay in New Orleans! Jesse, the owner is sweet as pie. He has lived in New O","useful":3,"cool":1},"Ru8qeBizO0S1Tm49zocy-w":{"text":"Jesse, Frank and Alex do a great job with this historic, and I mean historic bed and break","useful":0,"cool":0},"KlQy6ib_zIAf-D4AJ3R4Yg":{"text":"Great place with character, comfort and class. Impeccably clean, incredible service by own","useful":1,"cool":1},"C0oWDxjEeoT4SrpDm7h9Bw":{"text":"just returned from our stay at the green house inn.  the grounds were beautiful, the inn i","useful":1,"cool":0},"cY3wafqunu5TX17xQBxkiQ":{"text":"We just returned from our second stay at the Greenhouse Inn. It's my perfect hotel. Gorgeo","useful":2,"cool":0},"-gF5LeDxEFR9LktGsWWoYQ":{"text":"I am fortunate that the company I work for likes to book our stay here during an annual co","useful":2,"cool":1},"nQozcWFIkCjh0Fm4watNbA":{"text":"I have to admit, when my partner told me he'd gotten us a place to stay over in the Lower ","useful":3,"cool":0},"N-H9jntgeH1KeVlFJN6irg":{"text":"I really enjoyed my stay at Green House Inn.  I love old houses, so it was a treat for me ","useful":2,"cool":0},"m-BgwX6O1MLiibeRwRti9g":{"text":"We couldn't have asked for a better place to call home while in NOLA than the Green House.","useful":1,"cool":0},"t8Z1iZcd6bKK_8Juqt66Ng":{"text":"Wow. This place is magic. My boyfriend and I were coming off a bachelorette/bachelor weeke","useful":1,"cool":0},"CcCEwia5_Zla8bfIfv3Bww":{"text":"There are so many reasons you should stay here the next time you are in NOLA. The location","useful":4,"cool":0},"9oapaDTQQr-QtgJNKsk1yA":{"text":"Recently, I was a guest at The Greenhouse Inn. I was very pleased with the service receive","useful":0,"cool":0},"_hkjZNJ4lXhjwYz7iF-hkg":{"text":"You CAN have it all!  Great location, fantastic rooms, a relaxing pool, and exceptional se","useful":0,"cool":0},"a82yebdjimwe0-cczOSCyQ":{"text":"Reservations were great and staff seemed peasant but unfortunately when we got there, we d","useful":2,"cool":0},"-pw9bmOaOYsojOFcZXhV3A":{"text":"I just booked a room for Jazz Fest this year, and realized I never reviewed my first stay ","useful":1,"cool":0},"Bm2mXB68iu0SnYYrDaYm8w":{"text":"Charming B & B in the garden district.  Clothing optional place for all who would care to ","useful":2,"cool":1},"yOCcOFH-a7lyADuCQm-tDA":{"text":"Fantastic B&B!  The garden pool area is like a tropical sanctuary.  The host, Frank, is a ","useful":6,"cool":1},"e7ApzT9negaZycvWCAgn-g":{"text":"I booked a room here before reading any reviews, I picked it based on location. The name o","useful":6,"cool":0},"1ltk8vhoJDoPfv2hHeBVKQ":{"text":"Jesse and Frank are terrific hosts and happy to share their wealth of information about th","useful":2,"cool":0},"Zy_2gZCmJ1_PCIEdNyGQyA":{"text":"This was my first trip to New Orleans and I had a great time!  The Green House Inn was a h","useful":5,"cool":0},"5qKlWDW-tgvYFuBHRU-HSw":{"text":"I've been to NOLA about 40 times over the years, but this was the first trip for my wife. ","useful":6,"cool":0},"-ALjx9kKj7OCF1BraRDJsA":{"text":"I really can't even begin to describe how wonderful our visit was to the Green House Inn b","useful":8,"cool":1},"zUmMx99fLZJ-bGRW5c731g":{"text":"Our first trip to New Orleans (or Louisiana for that matter) and we could not have had a b","useful":9,"cool":0},"SMbFaTv_Qou2y0b336DN2w":{"text":"Stayed here for our one night in New Orleans this week. The Green House Inn is on Magazine","useful":5,"cool":2},"OSPn-5BvLKsa48klNzMM1w":{"text":"This review is late.....We stayed at the Green House Inn May 2016.  The hosts were graciou","useful":0,"cool":0},"8snGbzwdH4E33BVY5d0x8g":{"text":"spent most of a week here with my fiance, it is a great place to stay.  staff are very fri","useful":3,"cool":0},"3kSUsuBTg7kNx-ezsmcLTA":{"text":"My wife and I stayed here for 4 days and loved it. Clean, comfortable, friendly place, and","useful":4,"cool":0},"YlwOKJfCdrkV3Ia2BKH2MQ":{"text":"Green House Inn has a saltwater pool, a great spa, and a hilariously loud Brazilian parrot","useful":5,"cool":1},"oFhNZVlje9C0fUTu8WLGBw":{"text":"My husband, myself and another couple whom we had recently met in Key West, visited The Gr","useful":0,"cool":0},"5DKYVhY0MSUErs9OmJbIeg":{"text":"Attention. all couples the green house is a wonderful oasis to stay at in the city of new ","useful":13,"cool":11},"vAEccKDoRiqeVpYXRLP9zw":{"text":"Tucked away on Magazine St. is a nifty little hideaway that I had no idea even existed.\n\nT","useful":13,"cool":3},"_dAZmkNJfvU3CnTU9kGtPA":{"text":"Lovely, charming place. The owners/staff are wonderful, friendly and accommodating. Truly ","useful":2,"cool":0},"CATrzizPiGl-hl9pRfHLEA":{"text":"By far the nicest innkeepers you will find anywhere! This sanctuary of tropical adult rest","useful":1,"cool":0},"FKFfCeuxoKnO4D8PTOlzWA":{"text":"My wife and I found this place in the Russian roulette that is Hotwire. The main reason we","useful":7,"cool":1},"hFBjODwQe5gUaxSGjGyPsA":{"text":"This place was very relaxing in the middle of a busy New Orleans. All kinds of places to e","useful":2,"cool":0},"oz5svZZyKbFpA7DeHDs01Q":{"text":"When I moved to New Orleans from New York City, I needed somewhere reasonably priced to st","useful":1,"cool":1},"Yp2tFuiv5CRt7sF135JsFw":{"text":"We recently stayed at the Green House Inn for 5 lovely nights and would go back in a secon","useful":5,"cool":0},"liLfU68anXB6BK8h5ncUOA":{"text":"When I moved to New Orleans from New York City, I needed somewhere reasonably priced to st","useful":0,"cool":0},"3vk5tpmO-eG6YigRJO7yBA":{"text":"We stayed 2 nights at the Green House Inn this week because we were interested in the clot","useful":1,"cool":0}}