{"2s-sJbbWv3aXqphsHZ2_NA":{"text":"I had a wonderful meal here one evening after my in-laws made reservations for four as a C","useful":0,"cool":0},"qBHTQSgkSmt7WnYd1bdTig":{"text":"One of the best restaurants I've been to ever and definitely the best fine dining in New O","useful":0,"cool":0},"ELb5ntjItOLXIIQ7jHbDAQ":{"text":"My wife and I went here for Sunday brunch. I had the Eggs R'evolution and she had the Eggs","useful":1,"cool":0},"vKQFFZLTvzZJzcDty2OhcA":{"text":"I'm fortunate to have had a lot of excellent dining experiences in New Orleans. Restaurant","useful":1,"cool":0},"LtTVjWUIgCjw6Le_FBSMmA":{"text":"My boyfriend and I were celebrating our one year anniversary together and picked here last","useful":0,"cool":0},"9sFEt37W6n_g-KcE9XHq7g":{"text":"Quiet though almost directly on Bourbon Street. Good food but does not exceed expectations","useful":0,"cool":0},"FpbTWy0_TiTh8FT7PoebdA":{"text":"Trip #2 in 2 days. Sat at the bar (the bartender was awesome) and had turtle soup, cheese ","useful":0,"cool":0},"w-NCiwLb-EHR5bifE3Kybw":{"text":"This place is faaaannncy... and in a very good way... where they make you feel like you ar","useful":4,"cool":2},"iYUnoppvdnjVi71mtZRx_g":{"text":"Great atmosphere. Great service.  Great food.  The death by gumbo is amazing.  Highly reco","useful":0,"cool":0},"Vp1u_W6OacKcmPWbNomzcQ":{"text":"One of the very best dinners that I have ever had. Really, it could not have been any bett","useful":0,"cool":0},"26B0PL8geymOZVIn3xTRHQ":{"text":"Restaurant R'evolution...\"Spectacular evening! \"\nWe were here a few nights ago March 26 fo","useful":0,"cool":0},"F2ziR2jVt8CWt2VkP5e4ow":{"text":"I've been holding off on writing this review to give this place the chance to resolve my d","useful":0,"cool":0},"3MKJoH-SKri7sJXMLDCCPA":{"text":"We went for brunch and had the Debris and Eggs, which were fatty and semi-flavorless and t","useful":1,"cool":0},"UlMjjKKLBOmAA2S4MrvipA":{"text":"This is one of the best restaurants I have ever eaten at.  The food was phenomenal.","useful":0,"cool":0},"DEGfe8AA7llSO4VIwVu6LA":{"text":"Had a lovely dinner here Saturday evening.  The food was amazing as well as the staff.  Th","useful":0,"cool":0},"J-LeeNilWUW-A2dXk-lVSQ":{"text":"We went here for our first real meal in New Orleans and really enjoyed it. The crab beigne","useful":0,"cool":0},"MmR5jKPZ1FGJ2scjNRH45g":{"text":"Came here for brunch on our trip to NOLA and it was such a great spot. They had live jazz ","useful":0,"cool":0},"Tpe_k0X5lUYTX5JKGl6wBA":{"text":"Most amazing restaurant in town in a trendy place, with fabulous service and perfect fusio","useful":0,"cool":0},"3iX0AtDZA45h7ZlXwFVE5w":{"text":"The tasting menu is always a great thing here.  The cocktails are excellent, the wine list","useful":0,"cool":0},"Pz3iEAwIw9Mk3FbqHlXkJg":{"text":"New Orleans has amazing food. It's just a fact. In a city with such delicious options, it'","useful":0,"cool":0},"BXWhJNNYccKucp4aBY04AA":{"text":"Well executed Louisiana cuisine with contemporary flair. Lovely set up for wonderful dinne","useful":0,"cool":0},"FR_TbE5S3sChTqpe6KdCEw":{"text":"i went to this place for dinner with my girlfriend. since the waiting was too long for tab","useful":0,"cool":0},"L1NqpJvUG5c84KUOHmu4Qw":{"text":"went with some good friends about two weeks ago and was glad we went\n\nrecommend:\nveal swee","useful":2,"cool":1},"5qgCbk0q1X9ieSo2SQjbAQ":{"text":"I am well traveled and R'evolution is a reason to return to New Orleans on its own. I can'","useful":0,"cool":0},"uFAwIkbrbr4yPNRVRsObcA":{"text":"My all-time favorite restaurant in New Orleans. The service in impeccable, the atmosphere ","useful":1,"cool":0},"-Pqab2iivik6k_z67qkdrA":{"text":"Let me start with the one negative I have about this place and get it out of the way, it w","useful":1,"cool":0},"6wOV9XP8br9dT25soJ4ajg":{"text":"Best 5-Star restaurant.  Was in town and planned a 6-course dinner for 75+ clients.  There","useful":0,"cool":0},"Q-QHy6l98vV1LuoN0t7Lfw":{"text":"WOW.  This place is amazing.  Even sat in the bar area (tried for weeks to get a reservati","useful":0,"cool":0},"hN3jRZJ2x8mfH7oDjl4bXQ":{"text":"So this will be the first time I leave a negative review on Yelp.  I typically only review","useful":0,"cool":0},"N3MjjMqXOVU9Uofr6hUyzA":{"text":"One of the best meals my mom and I ever shared. The food was incredible. Staff was super f","useful":0,"cool":0},"GxWrzgV_C44GtwaM7ZWuIg":{"text":"Exceptional food and service!  Very creative dishes.  Wonderful ambiance.  Would definitel","useful":0,"cool":0},"YdBIif4KyPCLYRjCxoyDcA":{"text":"Identity crisis with over-the-top presentation.\n\nFood on-par with August, but there's much","useful":1,"cool":1},"2asz8z1rkw1e3MnR92EpTQ":{"text":"I'm not sure how many fine-dining establishments are in New Orleans, but Restaurant R'Evol","useful":22,"cool":15},"nU8BgoX4FxfA18dMFPNErA":{"text":"Another great restaurant in New Orleans. Excellent service to add. The servers had excelle","useful":0,"cool":0},"wsA0K15tpCnwETSfvmHo_Q":{"text":"Yummmm- great fancy dinner with an amazing experience, food, & service. Crab beignets are ","useful":0,"cool":0},"x3VFV-lSQsiX8Pc0gfbItg":{"text":"Came here for high reviews and good looking menu. Had 8:30 reservation and got right in. C","useful":0,"cool":0},"lEOFoNCJDbDwBUjtOR2mAw":{"text":"The food was fantastic. The food was five stars. Why the two stars? Our service was deplor","useful":2,"cool":1},"rR-RrzAWyXpNR1Tn5WkObA":{"text":"Best Wine selection. Beautiful jewlery box  with a complimentary dessert at end of meal ve","useful":0,"cool":0},"nZuiqLYKkad4i04ow0KduA":{"text":"Went for dinner on New Year's Eve and arrived 15minutes before reservation and were seated","useful":0,"cool":0},"405miqk0UA1Rq3AwecwE9A":{"text":"Wow. Everything was so delicious. The service was impeccable. We had the death by gumbo, o","useful":0,"cool":1},"WI8nBnzAnTz5-E8sLzUF_Q":{"text":"Brilliant place. \nHowever, they screwed up my vegetarian dish. I ordered Risotto with spec","useful":0,"cool":0},"tHPJvAmZmfjbqOecZq6N7w":{"text":"We dined here on a Friday night. I had 5:30 reservations, but the streetcar broke down and","useful":0,"cool":0},"s-LTkj8eo8iGJEgvmljhBw":{"text":"Came with the wife three months ago and this place didn't disappoint. The Death by Gumbo w","useful":0,"cool":0},"6Tb84ptotTxnLsfVimd5Jg":{"text":"Visited New Orleans for the first time and was looking for a romantic night out. This plac","useful":1,"cool":0},"55zjL_du74yw4C-BhW_STA":{"text":"Place has great ambience and excellent service, food is presented in style and cooked to p","useful":1,"cool":0},"iuiDDbuzV0Y-UDtlcPNgxA":{"text":"We finally got here Sunday and had a wonderful meal.  Food & service were impeccable.  Che","useful":0,"cool":0},"QK32snPT9R5c1-198eYNNA":{"text":"My wife and I are both Gluten Free and although they don't do a separate menu they are abl","useful":0,"cool":0},"fIkuFb8ClGG4u5uO8RZumQ":{"text":"Arrived without a reservation and was seated at a lovely table.  Service and food was exce","useful":0,"cool":0},"WMAVsR5AiCZaT-zOjndZFg":{"text":"Lots of show and not quite enough substance.  With its beautiful decor, this is a stunning","useful":3,"cool":0},"U8UceSN1l5Aq6tgwsoMKTw":{"text":"Had Sunday Brunch. Jeffery,our waiter, was beyond exceptional. \nHad the lobster gnocchi. T","useful":0,"cool":0},"212UfhBeg6tOqylLtL4S_w":{"text":"Excellent service, one of the best meals I have ever eaten.  Highly recommend this place.","useful":1,"cool":1},"iJrd9hbFyHNYXJxyirha4g":{"text":"We were very happy to discover this restaurant in New Orleans. Service was great, waiters ","useful":0,"cool":0},"zjuFfbwkgyDJPdDKQP05ng":{"text":"Beautiful room.  Professional staff.  I had the scallops and they were really good.  Not s","useful":0,"cool":0},"5BaaU4MOPmsvfHaCR-1LyQ":{"text":"Scallops, lobster gnocchi, crap beignets, beef tartare, asparagus, turbodog chocolate cake","useful":1,"cool":0},"UDWt0hX9ILf3JQNf7FySSw":{"text":"Can't even!! Out of this world. Start to finish. I will be back again and again. I'm from ","useful":0,"cool":0},"802Q_z-nxVPGt5XOB3P34g":{"text":"My new fav  restaurant  NOLA ! Lively but not noisey , sat in the back by the kitchen fun ","useful":0,"cool":0},"dFenZ-YAra84pNh3bVK5ng":{"text":"You will be thrilled. My husband and I had dinner here during a business trip. It is price","useful":0,"cool":0},"E_cL-QxNb28ch7gCLuLjNA":{"text":"I was so excited when my husband told me that he had made reservations to eat at R'evoluti","useful":0,"cool":0},"b-apwiBPKiD_jIExElHN2w":{"text":"This place was so good, I had the beer battered crab beignets and the fried quail and waff","useful":2,"cool":1},"WMS2w9dFtV62HngvNwG_6g":{"text":"Surprisingly very good!!! Not what I expected \nSeafood gumbo\nCrayfish stuffed Napoleon \nYu","useful":1,"cool":0},"xgd9aQ13lgXWjZ93v-jgVg":{"text":"Before coming to New Orleans I did some research because I wanted to do one really great s","useful":0,"cool":0},"YoKAWEysPJi7Ghga3u2s1Q":{"text":"This is my first supposedly fine dining experience and I think it was decent, but without ","useful":0,"cool":0},"IOIfTJZxi7lmd2js7i0c2w":{"text":"Went here for my birthday dinner and was really impressed! The ambience here is fancy and ","useful":4,"cool":5},"IVaH5gVsT0BpMDbarBwqHQ":{"text":"Man, it's been awhile since I've written anything....but I hope to get back to it.\n\nLet me","useful":5,"cool":0},"3NikqlkmaMn0AxPHXIkIGg":{"text":"So my boyfriend and I went to Bayona and had some small plates and then wandered around an","useful":4,"cool":4},"Fvx6NELvTHwI4Fp1RzrtdA":{"text":"R' evolution says it all...a superb and R' evolutionary experience.  If six stars were pos","useful":0,"cool":0},"wfya0ygrri9Cd9WS-IqUUA":{"text":"I didn't try a lot there. I had their rillettes -- it was fairly standard, nothing particu","useful":0,"cool":0},"1UEVnxs3_4pKjY3UTbDsMQ":{"text":"I don't know about this place...the reviews are excellent. And, when the hotel concierge r","useful":0,"cool":0},"5xIDjBtbKBtFfHGF3e11pQ":{"text":"This place did not disappoint! MUST-GO place if you're in New Orleans. \nService: excellent","useful":0,"cool":0},"qPKOKLeBVQPBMvZuMRcc0g":{"text":"Crab beignets Crab beignets Crab beignets Crab beignets Crab beignets! Took my friend here","useful":0,"cool":0},"W4sxKDhdBgUwYDd4IFpPgA":{"text":"We had dinner here for our anniversary and it was fantastic. The snapping turtle soup and ","useful":0,"cool":0},"4QVZmlLvqlHUZiRrdpk0HA":{"text":"The dining area is super bright, almost uncomfortably so. Feels like you are on stage. Ser","useful":0,"cool":0},"ldsJ1DpawI1tCO61yM2E9w":{"text":"I'm going to make a statement that is a really big deal for me. Restaurant R'evolution is ","useful":10,"cool":3},"iaF3AP64yGq1pFIj8U-OyQ":{"text":"THis is fine dining done right. This place does everything great. THe food was wonderful, ","useful":0,"cool":0},"39SQNdz1LUBgauy-ZpA3HA":{"text":"Our group of seven really loved this restaurant!  Unique and creative menu with elegant di","useful":1,"cool":1},"OSwZ0VsgcfoRKYSy2xwCJg":{"text":"This place was more like a 3 and a half star spot but I'm giving them the benefit of the d","useful":0,"cool":0},"PN3yq3arKr60VVZ0UnTR_w":{"text":"Some of the best dishes I've had so far in my life!! The Jazz Margarita was soooo refreshi","useful":0,"cool":0},"wms0HvSZXKOOSJ6_fpZIPA":{"text":"Crab beignets, WOW! I will have foodie dreams about these. Also the wild mushroom papperde","useful":0,"cool":0},"wSSQFyIaIrfpWDFuOoaPjA":{"text":"Old School ~ Refined, exceptional service this is dining how it should be. 3 servers per t","useful":1,"cool":0},"lnoT4TNbresctaclMhGgYA":{"text":"You ever been to a restaurant and watched the table next to you complaining about their fo","useful":0,"cool":0},"tEtO5a-Mm2MET8Sy4XBdoA":{"text":"I ordered the chicken which was nothing special. I have had great rotisserie chicken in pe","useful":0,"cool":0},"Jeo4ECNXKfp8IVLLyYxagQ":{"text":"Had a decent Jazz Brunch here on Sunday. I ended up getting a ressy after some great Yelp ","useful":3,"cool":0},"3y-aiBk2YwFLWPeAA27hLw":{"text":"We really had a mediocre experience. The food was way too salty to the point that my steak","useful":0,"cool":0},"mlY8OSrLZYeZdmd8QH0SGw":{"text":"The service was great and people were really nice. However, I was not impress with the foo","useful":0,"cool":0},"XOwlGu4NvHiXETl7UnITzA":{"text":"The excellence of New Orleans fine dining continued with a visit to Restaurant R'evolution","useful":5,"cool":0},"JAnPAthQO5-YSp4EE99wOg":{"text":"Fabulous in decor, service, menu, preparation delivery and taste.  I went after a conferen","useful":0,"cool":0},"T3FPpQZd4m0NDOUIfPP1Bw":{"text":"Extremely good restaurant. Lobster gnocchi and crab or clam pasta are both delicious!","useful":0,"cool":1},"D6j1_ZV1CXEsx1AWdbsyvA":{"text":"Dining at Restaurant R'evolution was one of the best things about my trip to New Orleans! ","useful":3,"cool":1},"8RkjPJa3FjLOjS-dvlaNTw":{"text":"when planning my trip to New Orleans with my mom this one of the first places I knew we ha","useful":1,"cool":3},"TnK8R4FPRDLEsocKbMZyoQ":{"text":"We were at both bar area and restaurant. Bar area, pretty dark and nice vibe. Still can or","useful":1,"cool":1},"6zdRZEYJFIIrJIHKrS_9hg":{"text":"We arrived for our 8:30 reservation at 7:45 and thought we would enjoy a cocktail before d","useful":0,"cool":0},"2ugFGU0zUDbTeNyhlpZpYQ":{"text":"Wow, this place is amazing. The five stars is for the service AND flavors. We started with","useful":1,"cool":0},"_ibAincDjhDQz4J3-wOMOg":{"text":"We had a very impressive dinner at this elegant restaurant.  The decor was impeccable.  Th","useful":1,"cool":2},"w3eXQq11ZzgdprTP6WCyTA":{"text":"Really is as good as it gets.  And if it's not, this place will make it right.  Service wa","useful":0,"cool":0},"PFMuSirvL3hHWFpPU5AKjQ":{"text":"There are not many restaurants in the world that balance sophistication comfort, knowledge","useful":0,"cool":0},"wQnm5tD8eJMpB3RvQW_n9Q":{"text":"We went to many great restaurants during our visit to New Orleans, but if I had to pick th","useful":0,"cool":0},"2mwF5IsnuzRq_YgJnLbReQ":{"text":"this place was recommended by a friend who used to live in town. the service was probably ","useful":0,"cool":0},"0KS6mNOZEl5N7wJcEhH4Rw":{"text":"My goodness this is going to be short and sweet. Stop searching Yelp and just make a reser","useful":2,"cool":2},"P1Z6Nz2BOCnvvhbKeLjqmg":{"text":"I hate vegetables. I am not a big fan of NOLA cuisine, (sorry).  BUT, i say all that to sa","useful":0,"cool":0},"7kHLvCPYzboTGynujEzuag":{"text":"First, we had wonderful cocktails in the bar. I had the Belle Epoque- fantastic. The vibe ","useful":1,"cool":0},"Agq021SUCRrpAdE2LSkf8w":{"text":"Chefs John Folse and Rick Tramonto have combined their skills and styles to make a unique,","useful":1,"cool":0},"G2noN2BJ9GR2o1a6wTpJJQ":{"text":"I had been wanting to try this place for a while and told my boyfriend one night, and he m","useful":3,"cool":2},"RXtJFkrFV3hQiF5BQHz_Pg":{"text":"Outstanding meal and we were not disappointed by the recommendation of a New Orleans foodi","useful":0,"cool":0},"Z0ObwVTwiFhqDfJ20n1acA":{"text":"Be careful who you hire for wait staff!! Poorest Service and from more than one, ALL in th","useful":1,"cool":0},"AOZCRL61_W6-DIERdJ1hKg":{"text":"Absolutely fabulous! Probably the best fine dining experience I have yet to encounter to d","useful":0,"cool":0},"XtfKzLEwaVbpXXGuVbq5Xg":{"text":"The restaurant is a complete experience.  Everything is 10/10 from beginning to end.  Ever","useful":0,"cool":0},"CgKYaZK-oGSPn3U3V1EIsw":{"text":"Best experience in New Orleans. Food, wine and service were extraordinary. Incredible atte","useful":0,"cool":0},"U3TQMDP8Pa26gVABpD0yZA":{"text":"Went to 4 nice restaurants (Commander's Palace, Cochon and Herbsaint) during my NOLA stay,","useful":0,"cool":0},"IvdHM4ZJK3caN5fZkDPYag":{"text":"There are no words to appropriately and fully describe what a great restaurant this is. Th","useful":0,"cool":0},"vAKJ-masfzr9YDjV025TBA":{"text":"Maybe one of the best meals I've ever had. The wait staff is beyond exceptional and the fo","useful":0,"cool":0},"DHl5uUXfJWKRSv7ciDlMjQ":{"text":"You know it's amazing when the worst dishes (mascarpone grits) are still the best that I'v","useful":1,"cool":0},"iNoLybWgO_j6xrBO0hzvOQ":{"text":"Had a very poor experience tonight- It was our anniversary and we made a note of it in our","useful":0,"cool":0},"rs8tSNJ299zbaMh6rKLamQ":{"text":"Another absolutely perfect dining experience! Food and service always consistently top not","useful":0,"cool":0},"UgMT9KUOjgIXFnH4T93jzQ":{"text":"Came here during our vacation to New Orleans.  I was looking for a\nGood restaurant on yelp","useful":2,"cool":1},"rb6v1xgLXwqpOkrRgcKGlQ":{"text":"This was a great celebration dinner for my husband and I and I would really love to give i","useful":4,"cool":0},"Ab3x9TxJd3OSd7a7CAdbYQ":{"text":"Top to bottom my 3 experiences at this place have been absolutely fantastic and might have","useful":0,"cool":0},"ym6BkeMpZl0goYfzEFGF3A":{"text":"This is one of my new favorite fine dining places in New Orleans! We had a wonderful dinne","useful":0,"cool":0},"uETvp0JcXSSeN-CjxB55mA":{"text":"Death by gumbo an interesting deconstruction of gumbo with a roasted quail holding the ing","useful":0,"cool":0},"fTrXS_mL_VhqWUJZmy4png":{"text":"This was, in many ways, among the best dining experiences we've had. Each bite (and yes, w","useful":0,"cool":0},"UvUXTyANmvWXppio-HrgDg":{"text":"An evening of perfection. We had the pleasure of dining at the bar with Giovanni as our se","useful":0,"cool":0},"cLlOTY9j0BNxIHUDDeLMlw":{"text":"Top rate food and service! Was recommended to me by a client. Loved our crab beignets, hei","useful":1,"cool":0},"uKYQFJY_bHsIYHFuU6ptRg":{"text":"Was here on February 8th. \nPros: service & professionalism, fire roasted oysters, hoisin g","useful":0,"cool":0},"9TYEvm948G_1lnGg3zQhWw":{"text":"Best restaurant I've ever been to. Hands down. Whether within NYC, MIAMI or NEW ORLEANS\n\nS","useful":0,"cool":0},"UaKi51lPRvsyd_T_4XS_zg":{"text":"I so love being able to give 5 stars unequivocally to a restaurant that deserves it.  The ","useful":3,"cool":1},"ZpvxhkXxNm1gY1-t-RdHBA":{"text":"Just watched the bartender marry two different bottles of wine. Gross. Not a fan\nNot 2 min","useful":1,"cool":0},"_QEeDgiynQTA1G6QEExY_g":{"text":"Great restaurant! Loved the food, lovely atmosphere and helpful staff. One thing: make sur","useful":1,"cool":0},"AKqak0165OfGVi6SZ1Fe6Q":{"text":"Restaurant R'evolution was one of the most amazing dining experiences I have had so far an","useful":6,"cool":3},"kWglRxXmIamX8COdWXyXiA":{"text":"Sorry NOLA, just didn't do it for us hard core LACA folks. CA wines were paltry.  Now I ma","useful":1,"cool":0},"gMpfm8_oY0Rgm9aU6l5uJA":{"text":"so very expensive and not worth it in a town with much better food at a better price point","useful":0,"cool":0},"Bhm7coNT2BhXcX3iANjH5g":{"text":"So, this was by far our favorite restaurant experience - of our life. We were there yester","useful":0,"cool":0},"5lVOdlG4sGXd9PgEwQHWFA":{"text":"The best dishes were the fire roasted oysters,  the mussels, and  linguine and clams. The ","useful":0,"cool":0},"MoaUXNwbH_8sp0ZAUNaPMA":{"text":"Waited 5 minutes to get a drink menu. Were informed by incredibly snooty waiter that 3 peo","useful":3,"cool":0},"W-1LY3a2TYEpdneMR4ELrg":{"text":"Fantastic meal! Came here for lunch on a Friday (apparently the only day of the week they ","useful":0,"cool":0},"Q9GQ0eQV8yUjSb5iBaI9bQ":{"text":"Their gumbo is one of the finest in the city (and certainly within the FQ) and the quail t","useful":0,"cool":0},"8sfY6gwjaGGgD-yrS5nxoA":{"text":"Had a beautiful birthday dinner here--everything was delicious but the fire-roasted oyster","useful":0,"cool":0},"dlXja1CFmswPvE3NPuvXhw":{"text":"i find it hard to believe the other reviews on this restaurant are real.  its been 4 days ","useful":0,"cool":0},"4Dg-fXDhFy3Z27qOxgw50g":{"text":"I had an amazing lunch here!  My extremely polite and attentive waitress suggested the cra","useful":0,"cool":0},"xWDROgbOQi1hpGvbwwRPSQ":{"text":"Three stars are for ambiance, decor and Greg the waiter. The death by gumbo was exceptiona","useful":0,"cool":0},"-Rb63w3TMQOCg0MAIiLp9Q":{"text":"So much hype we expected greatness, but got mediocrity.  Charbroiled oysters were lacking ","useful":2,"cool":0},"KpOhd-X5XPS8BFR7t54GFQ":{"text":"Came here last month for my birthday- can't believe its taken me so long to review! I've o","useful":4,"cool":3},"BhHbnr4vL5FQTI-KQN-s2A":{"text":"Have always enjoyed the food, atmosphere, and service. Both my husband and I ordered steak","useful":0,"cool":0},"oMXi3itWA8N_jQegjwhJjQ":{"text":"OMG!!  Outstanding service and amazing food. These guys (Alejandra & Manager) turned a too","useful":0,"cool":0},"UgrKwiHVp83Y3uxjbtWdYw":{"text":"Simply amazing atmosphere! Staff was incredibly helpful and engaging. \nThe burnt Sumatra o","useful":0,"cool":0},"IpwQr0u7dEFtsxSgucp2ww":{"text":"I've only eaten in the bar area so I don't have knowledge of the full wait staff but based","useful":4,"cool":1},"Qfwh-5qVhgNmxe15srbaUw":{"text":"R'evolution is an elegant restaurant from by Chefs Folse and Tramonto. It is on the east s","useful":1,"cool":0},"CgwJXnFMLj277vnuti0diw":{"text":"After reading all the reviews about Restaurant R'evolution I was prepared to be Wow'd, and","useful":0,"cool":0},"-Kcot-z_av-8MKNb6kTXUg":{"text":"Great place, great drinks, great service. I had the beef Wellington which was cooked to pe","useful":0,"cool":0},"As6R7Q0QgKG29FR8y3hf7Q":{"text":"BLUF:  It was awesome but I don't feel the need to go back.\n\nGreat atmosphere.  Feels like","useful":1,"cool":0},"BXrttqF08JkPV8YuUh2kqg":{"text":"Incredible food, beautiful decor and the most wonderful service. Will be recommending R'ev","useful":0,"cool":0},"lWLbjwHDnbKXrUe0hIuQgg":{"text":"Took advantage of the Coolinary deals on a recent visit.  Couldn't resist starting with th","useful":0,"cool":0},"xMxjuJ-M4HxrqJ6h6ZlQCA":{"text":"Excellent! We were seated in the area by the open kitchen. Not typical New Orleans cuisine","useful":0,"cool":0},"tTgiV-GtQ383H58dsvF-WQ":{"text":"This is a spot you want to try out for a nice date night in NOLA. The food is phenomenal, ","useful":2,"cool":1},"Q7hcuJg6msvOcE0c2hM84A":{"text":"Simply amazing...from the appetizers to the jewelry box pastries. The service was impeccab","useful":0,"cool":1},"13AcMN8KO8T657a_XXHs6g":{"text":"Best service ever. Awesome.  Food good. Wine good. People awesome.  Then they reserved a t","useful":0,"cool":0},"vS4A54dlW0CS6MP2Zi8oBQ":{"text":"I do not give out 5 star reviews often but if I could give R'evolution 10 stars I absolute","useful":4,"cool":5},"yDlnRZtzjvpfCNWo1fk7Zw":{"text":"Second time at this New Orleans treasure. High end delicious and creative dishes. The turt","useful":0,"cool":0},"PZ_akKiQuGdOeIe8Q4mZ-Q":{"text":"The restaurant's atmosphere is perfect.  The service made them stand out among all the res","useful":0,"cool":1},"jxU-8E3P_BgzOlNuzlSA2A":{"text":"The atmosphere here is great! Took my mom here for her birthday! Came for Sunday brunch an","useful":0,"cool":0},"y60e4DlX1xacbrtf7Pv_dQ":{"text":"Came here for dinner for our last night in New Orleans and were all so glad we did! I was ","useful":0,"cool":0},"rDJauC-gi1AISvCO1lzIrw":{"text":"One of the best meals I've had in my life. Sat at the bar, service was good, not exception","useful":0,"cool":0},"856fpj-6PAVszBHl2yWNzw":{"text":"Can't say enough about this place. Top notch service, diverse menu, great drinks. The crab","useful":0,"cool":0},"gc1_JXdnnIVhNsgNIB_-4Q":{"text":"Did not have a good experience lady night at all. Celebrating our anniversary and a group ","useful":0,"cool":0},"sJrnk9vKgOrwmj9eW7qbdg":{"text":"Went here to celebrate our honeymoon. We had a budget but were still able to really enjoy ","useful":0,"cool":0},"rDjacvrrsxrYJkS3LM2uqw":{"text":"This was our first dinner in New Orleans so a lot was riding on this meal because we didn'","useful":1,"cool":1},"dNCN3ZMQefGkpTUNq-7NHw":{"text":"One of the best meals I've ever had. As a vegan they were super accommodating and made me ","useful":1,"cool":1},"E64-T-vWpY_6ZV1sBkjTFg":{"text":"Chefs table offered informative and entertaining interaction with chefs. Exemplary service","useful":0,"cool":0},"se2C36E7XjtdCdbu3Bo93A":{"text":"Came here for a bachelorette party, and had a fantastic time! Food was amazing, service wa","useful":0,"cool":0},"ASy_QJA9nQJtaeKhi47DDQ":{"text":"There really aren't words to describe how much I love Restaurant R'evolution. I really wis","useful":1,"cool":0},"PunzBuoEFzzJgzZXF2EJUg":{"text":"Great staff and more importantly amazing food. Of all our stops on NO this was by far my f","useful":0,"cool":0},"XL904gLegDCaN_kS189Uow":{"text":"On a recent trip to NOLA, decided to make a reservation here based on the many reviews I h","useful":3,"cool":3},"qlPpE_jL8XzIwPyubm7TzA":{"text":"Went for lunch. pretty solid menu and heard the dinner offerings are better. However, the ","useful":1,"cool":0},"07FtU2GevDfBK6CziqZA1A":{"text":"Vive la Révolution!\n\nLiberte, egalite, fraternite.  Yes, that was the theme of the French ","useful":5,"cool":5},"DFSSaqns4zjeMkRmznk4Kw":{"text":"This restaurant might be new of few years but the history that he is carrying on Chef John","useful":0,"cool":0},"lvfnuYyPFnm0J2GjX-QhAA":{"text":"If you are looking to splurge on an evening of fine dining and great service to celebrate ","useful":2,"cool":0},"X4BDY_8pFH8hMNxrGRo5cg":{"text":"We came here for my 60th birthday.  Don't get me wrong...the restaurant is a true gem.  I ","useful":0,"cool":0},"z5TVor3tfGGxmVJosFoZSw":{"text":"Lawd have mercy!\n\nAfter a torrential downpour shopping afternoon at the French Market and ","useful":3,"cool":1},"RRd7C6XrOK6c8ud7wPgNhg":{"text":"I am one of the few people that left here disappointed. Turtle soup and gumbo was bitter t","useful":0,"cool":0},"9TFgqr-TolN1ukfqoHEVUw":{"text":"Let me start by saying I have only given 4 stars because of price.  Brunch was an amazing ","useful":0,"cool":0},"F8I6ZeTMpuQ9aa2V-WBWtg":{"text":"Great service (Keith as server). Everything we had was outstanding. Very progressive creol","useful":0,"cool":0},"a-iHf4_zHJUGfUWpsR7KgQ":{"text":"Fancy place, excellent food, pricey, not good for kids all describe this place. It receive","useful":0,"cool":0},"Qlxa7QMBylOmMg-vw6nnKg":{"text":"Best dining experience yet in New Orleans!!! We sat at the Chefs Table and were spoiled wi","useful":1,"cool":0},"lHgGB_qg6_limJjpePsuKA":{"text":"Thank you Alex, Nicholas, Colin and Ozzie for an amazing night! I can't think of a better ","useful":0,"cool":0},"EpEBakbpaz9qOOxZJUYr8A":{"text":"The service here has really declined since our last visit, which made our experience less ","useful":0,"cool":0},"YxZyXLstMJdIYjCgy6nT0Q":{"text":"I have no idea why a lot of people saying this restaurant is good, every waiter showing a ","useful":0,"cool":0},"ubediA6VkvklLCA6VhikGA":{"text":"Best place in the French Quarter.  If your looking for great food and a nice wine selectio","useful":0,"cool":0},"GOCvG8BbYhAGsEn-G8dK8A":{"text":"I have been lucky enough to visit NOLA twice in four months.  May was for my mother's 85th","useful":1,"cool":0},"Xx9U0jJhGyjNpywNmCgfEg":{"text":"The tartare was delish-the best thing I ate there-but the bone marrow didn't have much mar","useful":0,"cool":0},"PYA2N5HACvDYjwNQXZjvOQ":{"text":"The best dining experience during my four day trip to New Orleans. Fancy attire and fancy ","useful":0,"cool":0},"cmrHbg55tG6IcCfMhnMDBg":{"text":"We had an amazing meal!!!!!!\nMy husband had big luscious raw oysters, the best he's had in","useful":0,"cool":0},"CpzaWB0KXKzMV_M7-i9Ebg":{"text":"There are so many wonderful places to eat in New Orleans and in the French Quarter.  This ","useful":0,"cool":0},"GM7J3sg7Y60Du6Ir_cKbdA":{"text":"The restaurant itself is beautiful and carries a great southern hospitality/NOLA vibe.\n\nI ","useful":2,"cool":0},"4AfU4RffF_kdlHRHuczY8w":{"text":"I have eaten everywhere in new orleans this is in my top 3 places!! Anyone who gives this ","useful":1,"cool":0},"Ah8UR4deeW0IY0oa3YnYIA":{"text":"A fancy restaurant with a laid back vibe. We were seated in the open kitchen area and our ","useful":0,"cool":0},"X4uPUSZWr0JfR6eshP6HsA":{"text":"I truly enjoyed our dining experience at Revolution. You walk into a bar that is beautiful","useful":1,"cool":1},"WYYExeDh3QOjT2pFQ7YAGw":{"text":"Gracious service by an ample and well trained team. Our large group was treated with devot","useful":1,"cool":0},"YHAA0ixTOX3PQiUijSxdGA":{"text":"Had dinner here last night with two work colleagues. Two of us had the boneless short ribs","useful":0,"cool":0},"Zen1Ysr44Isch_qVQuHHCw":{"text":"This  restaurant  puts  the  \"fine\" in \"fine dining\". The food  and  service  were  outsta","useful":1,"cool":1},"oubpn8ylNATIqH8Ocw4sNg":{"text":"Three letters: OMG \nOne of the BEST meals I've had in a long long long time!!  \n\nSo we did","useful":1,"cool":0},"JQT_zFHClkonlSAWfWYLGQ":{"text":"Amazing food and friendly service. the Caviar was fantastic. Sashimi salad awesome. Highly","useful":0,"cool":0},"WZXliFENQFlxtSqVAFZ-qA":{"text":"Who dat????? This place is Amazing!!!!! Brook/Tina team are wonderful!! The venison carpac","useful":0,"cool":0},"TYJmycMrA4BjsvvQl6C_JA":{"text":"There are so amazing restaurants in New Orleans but this one is a must. The Death by Gumbo","useful":0,"cool":0},"oFS6bIFQ14fNmkNdCf-V5g":{"text":"Wow! Started with the Revolution Martini, highly distilled vodka with a gold flaked, blue ","useful":1,"cool":1},"XQn5lMXS5N82ZCFZ7RYGEA":{"text":"This place was amazing! The service was excellent and the food was divine. I had the Wild ","useful":0,"cool":0},"vCHD7vgKKye2XpSPsnb1PA":{"text":"This place was recommended to us as the best food in N'awlins. We could not have been more","useful":1,"cool":1},"J3lYRnXwsgTyY-dyZwz3lw":{"text":"Amazing service , amazing food . The death by gumbo was light and full of incredible flavo","useful":0,"cool":0},"zncRaq5HlzVhuRxLITOuyw":{"text":"This was recommended by a friend and it was perfect. Service was excellent and food was in","useful":0,"cool":0},"sBPhmRJvDl-BBpH8cizK7A":{"text":"Last year my fiancé and I ate at Borgne and went a little overboard and over-ordered. Grea","useful":0,"cool":0},"0ruE13w5kr_oSak3M8e6fQ":{"text":"Probably one of the nicest most enjoyable food experiences in New Orleans. I my husband an","useful":0,"cool":0},"uG4QNfWpoOZzFr6P5g4EPQ":{"text":"This review is regarding \"brunch\".  The Ricotta and lobster gnocchi was as delicious as it","useful":1,"cool":0},"tAK5FxIEnQeM_8K29H9_DQ":{"text":"Wow! My husband and I are super picky and \"snooty\" foodies from California and we LOVED th","useful":0,"cool":0},"SRRXJc8U6kmyU7-oUugQHA":{"text":"Our dining experienceat R'evolution was absolutely HORRIBLE. We were willing to get the on","useful":0,"cool":0},"IXPfCZ0bHwzaewapsGKZyA":{"text":"Expensive, but worth it. I've never met a nicer staff that quickly accommodates any of you","useful":0,"cool":0},"aAQioqN5fj48TbjbGZ-n_g":{"text":"This is the best restaurant in Nola! I've been several times and have never been disappoin","useful":1,"cool":0},"qC6hQ3HE85sMOjztAYoBJg":{"text":"The service is top notch. The lobster soup and crab beignets are out of this world! Tomaha","useful":0,"cool":0},"OCZ75JEI3KpVnfEEYnQfmQ":{"text":"Worst restaurant ever. Food wasn't the problem, it was the management team! One of the man","useful":1,"cool":0},"m3Nr79XRcC2atH15S9YRSA":{"text":"I was a little underwhelmed. This is your classic pricy tiny portion restaurant which I'm ","useful":1,"cool":0},"Fs_Df94GkjCDiUNjMA4Y4Q":{"text":"If I can add more stars I would. Great restaurant down in the Bourbon Street area. Dinner ","useful":0,"cool":0},"lI7BkefQw6bkxaa4egFhdw":{"text":"3 stars for brunch totally in inspiring and touristy. Not a fan of their brunch menu chang","useful":0,"cool":0},"uLoeQKmLnR4X_vqTYTau6A":{"text":"Great food and great service. The gumbo is not like other gumbos you will find in NOLA - i","useful":0,"cool":0},"PyXnvqs4tKK6XCt4lLMwSw":{"text":"Superb, elegant, and wonderful. I cannot recommend this restaurant highly enough. It has e","useful":0,"cool":0},"CE6zlNH96_P_j6WMd1mRAA":{"text":"The food is fantastic but the bar is pricey without merit.  We spontaneously decided to tr","useful":3,"cool":1},"OzFWjgDFN7k84_gaOFRM1w":{"text":"This is ONE not to miss!  Exceptional food, service, and atmosphere!  The staff is very kn","useful":0,"cool":0},"rcWaKMBLEMyLhXufvC6--A":{"text":"We eat out a lot, probably four or five nights a week, and this is now my favorite downtow","useful":2,"cool":1},"wmiG8ohfbZGalkGRg3VYow":{"text":"Outstanding food and service. One of the most perfect dinning expernices in our lives. Wou","useful":0,"cool":0},"RwYcjFAo3FdCHPcEVmIbMw":{"text":"This is our new favorite in New Orleans, dinner was divine.  My husband and I split two ap","useful":1,"cool":0},"tjHR_gdFdXsYtJ34oa6D6Q":{"text":"Drinks were awesome! Ambiance was very \"New Orleans\" with all of the updated southern char","useful":1,"cool":1},"o-0isOfFy2Z1DxUfr4gDWg":{"text":"Incredible experience here!\n\nBeautiful restaurant with a very spacious layout \n\nThe servic","useful":0,"cool":0},"mjV3HnMJkRJ3UVQ-oyN-MA":{"text":"Wow!\n\nThe quality of food and service is to die for...\n\nWow! Wow! Wow!\n\nAsk for Rory!","useful":0,"cool":0},"eTXcviig8Y23PcEJLpUdqA":{"text":"This is a great place to eat from top to bottom. It's a little pricey for the experience -","useful":0,"cool":0},"X3zj-W0rswMInE_VkmWaag":{"text":"This may just be my new favorite restaurant in New Orleans . . . \n\nWe were four for dinner","useful":5,"cool":5},"N0aZZ16noe1OWphSoraKcw":{"text":"The foie gras was the most amazing my husband or I had ever had. It was sublime. I had the","useful":0,"cool":0},"i7iw5Jgf7-sMUeH5xJHC3Q":{"text":"This was an \"event\" not a dinner - an experience!  Wonderful from the martini to creme brû","useful":1,"cool":1},"MYzE-L9jkx_5_8tF-Ai3SA":{"text":"Great restaurant with a fun and inventive menu.  With a slight spin on classics.\n\nIf you a","useful":0,"cool":0},"kw7myaJAviMolSNLoZUgKw":{"text":"Service was good, very reasonably priced for the setting and food.  Plan on getting a rese","useful":0,"cool":0},"aVVm_Kc_YgxaNCvboekV8A":{"text":"I ate here a year ago and was just delighted. Great dinner.  Tonight? Eh. I had the red fi","useful":0,"cool":0},"OnYh8Rz-0l7tWIHl20L8kQ":{"text":"Visiting NO for conference.  Found R'evolution on Yelp as one of the best options in this ","useful":1,"cool":0},"DWbMgVCFQFAIlG3RPptgnA":{"text":"The whole experience was fantastic. The ambience of the restaurant added to the special fe","useful":0,"cool":0},"Ma1rYtURhdd2eBb1ZXfl6Q":{"text":"Yep, yep, yep--this restaurant lives up to its billing.  Before I start on reasons why we ","useful":1,"cool":0},"2u0qW8NEzF4KEiDg_pdxSw":{"text":"The food and the ambiance were surely a 4 star review. For Restaurant R'evolution was a fe","useful":5,"cool":3},"b9Wgxm4EE-HqtjWr23MkgQ":{"text":"Wonderful ambiance. No sense of being rushed through and needless to say we took our time.","useful":0,"cool":0},"xqOZmlcD6dGMQocWMdxtQA":{"text":"Just wrapped up a delicious dinner at R'Evolution! The food is really solid all around but","useful":0,"cool":0},"jbeZPGPCUpvy7pkpwEw9xw":{"text":"I just got back to my hotel and still cannot believe the reviews I read before going are e","useful":2,"cool":0},"lHmnJT8OIMrF0TtappJYhg":{"text":"My best meal in New Orleans! From decor, food to service, this is 5 star all the way!  Bak","useful":0,"cool":0},"qhtepxlDhJ7TooGxAl7vrg":{"text":"Very fancy, food is pricey but it was very worth making reservations and going at least on","useful":1,"cool":0},"_IcjoJ1XA0VJSDD0JG0iyQ":{"text":"Husband and I came here for our anniversary which they didn't do anything to help us celeb","useful":2,"cool":0},"pNr5ip-UbLmoN91h9kJS_Q":{"text":"Wow! What a great restaurant!   We ate a lovely dinner here last night.  We started with t","useful":3,"cool":1},"sqnIrX9vpOzn6Cs0-248gA":{"text":"I rarely give 5 stars - but this place was one of the top 5 restaurants I have ever ate at","useful":0,"cool":0},"i70awidFXixo4flc4uxvAQ":{"text":"4 stars for the taste of the food, although a little truffle goes a long way (someone tell","useful":0,"cool":0},"YWAigT22GA_mxvE7YH4C7A":{"text":"Walked in got seated right away but it was early. Super friendly and helpful staff. Got th","useful":0,"cool":0},"0inFTq7_zu98qwhBE-JnvA":{"text":"Know what you should eat?\n\nDeath By Gumbo.\n\nRemember in the 1990's, when Bennigan's had th","useful":6,"cool":5},"tygSPb2d-LkoqKzNY6LkSg":{"text":"Obviously you can't go wrong with the food- but the service here is just impeccable. Kevin","useful":1,"cool":1},"JkuwWKd4nm-rkZBQXYg_Cg":{"text":"Had a great meal here. Great high-class New Orleans vibe. Quite enjoyed the menu and the r","useful":0,"cool":0},"A6v8nKlLlyT9rSfKgZX1MQ":{"text":"A real gem in the French Quarter. Unlike the old establishments that are relying on their ","useful":2,"cool":2},"pMC50AkboLNsvHTAyPBJIg":{"text":"I was able to make an early reservation around 5:30 in the evening so there was not to man","useful":2,"cool":0},"a4ge_48dXucAtNcAVo83Cw":{"text":"Amazing. You HAVE to get the Death by Gumbo. It was the best thing I've eaten in years. Th","useful":0,"cool":0},"dsiyi4l_b5bvROHB6tkklQ":{"text":"This was a wonderful dining experience from start to finish. Our wait team were all profes","useful":1,"cool":1},"q-c60UbuuaXi64d0vOf2BQ":{"text":"Just an amazing dining experience overall. I ordered the gnocchi and my husband had the du","useful":0,"cool":0},"b97O-uO7GGJMlNUagbTl7Q":{"text":"Best dinner I've had in a long time.  The death by Gumbo was amazing but the seafood stew ","useful":0,"cool":0},"mEQbu3iU-bQ50QFG0szltQ":{"text":"Restaurant R'evolution...what can I say? You've left me speechless. \n\nFor starters...oh, w","useful":3,"cool":1},"4ad29qNPztxZnnG07WKU4w":{"text":"Easiest way of putting it, our new most favorite restaurant, sorry Ruth Chris.  Crab beign","useful":3,"cool":3},"wPAJZc8ebd2-JwT8Cyv0CA":{"text":"DeSean, Sam & Jordan made our evening perfect. I couldn't ask for a better team. Service w","useful":0,"cool":0},"Ref2CnamJCAM5ZYeJgwZAw":{"text":"This is our second time coming here. First time was spectacular. This time, we were treate","useful":0,"cool":0},"d3ZzSlzZs7bw67xgmaEyjA":{"text":"It looks as if I'm in the minority here. Even though this place gets spectacular reviews, ","useful":0,"cool":0},"1-TFQhyJ19SWpoYYnHt_ww":{"text":"Good food, unsophisticated service. Crabmeat beignets were OK; Steak Tartare some of the b","useful":0,"cool":0},"WGZnBDUi08URPDEXlRa3Zw":{"text":"I've only been for lunch twice and had the same grilled cheese lump crabmeat sandwich. Men","useful":1,"cool":0},"qp_UlVPYG3x3MdAEFF_kKg":{"text":"I ate lunch here last week and couldn't have been more pleased. The snapping turtle soup w","useful":0,"cool":0},"3kkexJ2NWd10r5Y68zMv1Q":{"text":"My second visit and still great food. The service however was poor at best. The restaurant","useful":0,"cool":0},"zXadWhGtJZoUltE51OqwKA":{"text":"This was one of those restaurants that as soon as we walked in front of their door there w","useful":1,"cool":0},"OMJCVgVjdpYGrh1lF7jZDw":{"text":"Being born & raised in New Orleans, I know good creole cuisine! So i definitely give this ","useful":1,"cool":0},"bbZ2UUdCyLz5AtxkoB5Sxg":{"text":"Very disappointed in the service.  Considering the reputation of the chefs we were expecti","useful":0,"cool":0},"r4gTytgSNeiJZ6688JP8Uw":{"text":"If you don't mind spending money on food that's out of this world, Revolution is like step","useful":0,"cool":0},"aAh1Szs9IhrL8LFHUQPFwg":{"text":"Beautiful bar area and restaurant! It's upscale, busy and every table filled up. The dinin","useful":2,"cool":2},"2Sze_kmdvwsxTdGB_gYngw":{"text":"The BEST Bloody Mary I have ever tasted!  During my recent trip to Louisiana, my friend an","useful":1,"cool":1},"aiCcwvJEGXrVHNDezZxz1A":{"text":"Maybe my expectations were a little too high? The food was overall very good, but not spec","useful":1,"cool":0},"CUrDXOWMrlPWKGmBpmlm-A":{"text":"Grilled satsuma old fashioned!!! Best cocktail ever. Try one. You won't be sorry. That is ","useful":0,"cool":0},"Wz9DAu98ymtA-w8acBRDgw":{"text":"Last night my wife and I dined at Restaurant R'evolution. Beautiful decor inside, very ele","useful":1,"cool":1},"tUB4LM_1_iq1h6yPur32KQ":{"text":"I dined here in January after spending a week in New Orleans and eating at many comparably","useful":7,"cool":1},"--1InX3sLX2N_VkIa-GrXg":{"text":"First meal of my return trip  to New Orleans and one that I was eagerly anticipating. I ca","useful":3,"cool":0},"rbLgKwnwEp9QdsFMC_lq7A":{"text":"Revolution is trying to be a top notch restaurant but has a long way to go. My friend and ","useful":0,"cool":0},"l1q5ThBLinxuZ4NjcqHKLw":{"text":"My favorite restaurant in New Orleans. The service is consistently spectacular and so is t","useful":1,"cool":1},"wy4FrrYuMoPw3fCazKYEOw":{"text":"So many choices in New Orleans.  But in our 6 night stay recently, this was one of the bes","useful":0,"cool":0},"seFKicBJAjWrnqnX7RX10A":{"text":"In town for a conference and located this gem. Food was delicious and the desserts...omg t","useful":0,"cool":0},"A3RjFEt4OtPxdpsYpK4Aww":{"text":"This was my first meal in New Orleans so I went with a local favorite, gumbo, to start.  I","useful":0,"cool":1},"Z0I2Bhn7gtIIRMXBfeFToQ":{"text":"Probably one of my top 10 meals ever. From the oyster salad to the bone marrow to the scal","useful":0,"cool":0},"_EYcb-zARdq3N_qn3PgsEw":{"text":"Coming from an extremely picky eater visiting New Orleans, I ate here for dinner the last ","useful":0,"cool":0},"BZWJPnUEIqVGrqKhvcGrBw":{"text":"We have found one small probem area.\n\nThe girl who takes reservations is obviously incompe","useful":1,"cool":0},"UVJEh5yCLd1LH8CQX3fc2Q":{"text":"SPECTACULAR!!!  Truly an amazing dinner from start to finish!  We had almost every dish on","useful":0,"cool":0},"lsG1kalQrTrt6oOgVUw-xg":{"text":"Excellent food , crab fried appetizer amazing . Draw backs expensive and small portions. H","useful":0,"cool":0},"EnO3WxadHEBuIySFS1ZN7w":{"text":"An outstanding experience in all respects -- great ambience, food and service. Highly reco","useful":0,"cool":0},"HLgPtAKHraHGdbLXa1pP6Q":{"text":"This was my favorite restaurant I dined at during my stay in New Orleans. To start I order","useful":0,"cool":0},"DFDbgerigOkAOKnrbhI6yg":{"text":"Accompanied my hubby to a business dinner.  They had a  very attentive staff, bringing in ","useful":0,"cool":0},"mDeRcDUINRlC04sCBD-PBQ":{"text":"I'll lay my 2 cents down here.... we ate at the bar here the other night.  I though our ba","useful":0,"cool":0},"VdAPe-2rzHANz_RpUsOgUg":{"text":"I will never eat at this restaurant again. It was definitely the worst part of our vacatio","useful":1,"cool":0},"7OCWWLKixCFtJDK4L-LCtw":{"text":"One of the coolest restaurants in New Orleans - absolutely a different experience! \n\nThe s","useful":2,"cool":0},"v_KcycE-BzME0o4pgRRjuQ":{"text":"We dined here on our last night in town, and it was our anniversary.  Saving best for last","useful":0,"cool":0},"kkEMXYu6oP7LJ4qu_-elTw":{"text":"Environment - great\nFood - great - but seriously a jewelry box with the dessert presentati","useful":3,"cool":0},"QmLJRg7FtoCRsFJH-XcP9Q":{"text":"I'd fly out to New Orleans again just to dine here! We had a wonderful night at R'evolutio","useful":0,"cool":0},"ps1Xmri6ELvasTIR9U-rsQ":{"text":"Very over-rated and over-priced. We had a reservation here but our travel plans got change","useful":0,"cool":0},"Xhj7I2CbvlfqqT32RkxXXQ":{"text":"The food was delicious and our main waiter was very attentive and knowledgeable. One of th","useful":0,"cool":0},"RgKY6UcghvQdiJxMs61H5w":{"text":"Dinner with 3 people = $296.  Service was good, but they seemed to be trying a bit hard.  ","useful":2,"cool":0},"z3aMH7oERcMyvbdGoXhNHQ":{"text":"Wow!  Just an amazing experience.  Death by Gumbo had so many flavors interacting with one","useful":0,"cool":0},"uQjq30ba0YS8iCaq682a-A":{"text":"Was in town for the weekend and had reservations here.  Classy joint with great service. W","useful":0,"cool":0},"v-RKJItGXTBl3FQLpRmUJw":{"text":"What an exceptional meal and dining experience!  The staff was wonderful, and truly pros a","useful":1,"cool":0},"OlJufdRnSJAJeJfYDzUE1g":{"text":"made the mistake of going for new years eve dinner....reduced menu, kinda snotty service w","useful":0,"cool":0},"dBQUyS4HzWNCvti0hCGKlw":{"text":"A real southern gem for sure.  Great decor a live jazz trio to accompany our excellent bru","useful":0,"cool":0},"wRJnpqBKOaV94nd2vD6Uvg":{"text":"What an amazing experience.  \n\nFirst off, the staff that served our table (Natasha, Alex, ","useful":0,"cool":0},"9l0vHe741JpIxFLJJwW-yA":{"text":"Dinner was amazing!  My husband and I were here celebrating our anniversary.  All I can sa","useful":0,"cool":0},"BZCWLEoE3TCDj_qYzQsKng":{"text":"Was honored to have eaten at this establishment. Amazing decor,  service and food! I had t","useful":0,"cool":0},"blf9OUEyEsIis-WL5ZZ1BA":{"text":"It wasn't bad but it certainly wasn't great. The rice in the gumbo was undercooked. Bird i","useful":1,"cool":0},"xWG885GBpvSqE9zKrLnBng":{"text":"my friends and I LOVED this place. it was one of our favorite brunches while in NOLA.  the","useful":0,"cool":0},"oCdSiPpI4N9oN2bjfp_7kw":{"text":"Everything was superb! We were pleasantly greeted by Chef John Folse upon entering the res","useful":3,"cool":1},"EemwZetlJfUlStNfzvi_XQ":{"text":"This may be the best meal I've had in New Orleans. The service was top-notch. Our water wa","useful":1,"cool":0},"Y4rRewlONhLrdF62QhYyrQ":{"text":"Omg!!! My husband and I are foodies, and we loved Revolution! My husband had the scallops ","useful":1,"cool":0},"oOdNJvVYg751Euh_y1NxOw":{"text":"Overall we were disappointed with the experience. The restaurant is beautiful insight with","useful":0,"cool":0},"kv7G4bm5ud7xjVUd-XkuBQ":{"text":"Great restaurant, beautiful bar, great service, great drinks, really good food. We split t","useful":0,"cool":1},"qk1gHddBN-mUvJQ_EC2fOA":{"text":"this place was fantastic!  Husband and I had a great time.  Service was excellent, we were","useful":0,"cool":0},"tOzAvtVK8-UcRoCikOXhkA":{"text":"Where to begin?  We started with a cocktail at the bar, they have a nice selection of craf","useful":0,"cool":0},"hr0qzIjxo_-p1J39Up9kWw":{"text":"You must go to this restaurant when you're in french quarter. My dining experience was bey","useful":0,"cool":0},"Y9NHuTfVR1erYB78Q41rDg":{"text":"This is a fantastic place for a great dinner in the French Quarter. I loved every bite tha","useful":3,"cool":1},"uNwY1StYjiMHzkpc16WEGA":{"text":"I went to this place when I was on holiday. I was looking for a nice fancy restaurant in N","useful":0,"cool":1},"SvLnvjC1ZcrPl0USkFffhw":{"text":"This restaurant is out of this world! The food is plated gorgeous and is absolutely incred","useful":0,"cool":0},"IKjjeK6UYEZcdAjoRPc-uA":{"text":"We;ve eaten here many times and would highly recommend. The service is great and the food ","useful":1,"cool":0},"IzKSjX05ZUZVd3sxmbZ_Cg":{"text":"My wife and I dined here for a much anticipated second visit on 9/6/17.  While our first v","useful":0,"cool":0},"B9eAv_7moCptZ-2Siu3jVA":{"text":"An incredibly well-designed dining experience.  Each of the 5 dining rooms was artisticall","useful":0,"cool":0},"HOq5j5w0GyXBTowd-47XKg":{"text":"Came here for Reveillon Dinner on Christmas. We were seatly shortly after our designated r","useful":1,"cool":1},"8om0pXtBBzv5PuLtYTMcGA":{"text":"Best meal we had on our trip to New Orleans.  Every element was delightful.  Venison carpa","useful":1,"cool":0},"F_8TB5NZRArFSLA9VnOWmA":{"text":"Five stars, through and through, and easily one of the best meals I've ever experienced. \n","useful":1,"cool":1},"l3zaypYc8-O9lAOIApBuDw":{"text":"Came here to celebrate an academic completion of a friend.  I had the turtle soup, which w","useful":0,"cool":0},"aVypHiSF3spXRO05YWkwhQ":{"text":"The food, service, and atmosphere are a home run.  \n\nWe went there for a pre-Christmas mea","useful":2,"cool":0},"K5EePsOub2GyKw7yeA95Gw":{"text":"Nice nice place.  Another \"upscale\" New Orleans affair and they really pay attention to th","useful":0,"cool":0},"O8UPAv9lcfxSDPpHEmoieQ":{"text":"Food was amazing! Started with both raw and fired oysters. The fired oysters were very sav","useful":0,"cool":0},"Z2oVgMFolSHfVp0Gtrc-2g":{"text":"Despite what I had read in reviews and their menus, this was a seriously weird and unpleas","useful":4,"cool":0},"2wtBLmj8Hr9LC951LRdwRg":{"text":"A lot of attention has been made about the newest fine dining restaurant in New Orleans, R","useful":4,"cool":0},"8DrCz6ITlzcSGQWdJRqZ8A":{"text":"Last night was the best food that I have ever eaten at a restaurant. From start to finish ","useful":0,"cool":0},"v8tic8C-OT4bLiHaJUo9cw":{"text":"OVERRATED and OVERPRICED for the portion sizes you receive. We were expecting a 5 star exp","useful":0,"cool":0},"4ss_VRt-FyEq7berzgau8Q":{"text":"I don't know where to start. Been going to NOLA for 32 years. My husband actually made the","useful":0,"cool":0},"80zY-0AHVWNuoXaU4wjv-A":{"text":"A great meal at the bar with attentive staff. Highly recommend the venison carpaccio and o","useful":1,"cool":0},"dAkKEmNbPvchEG8uc_ArqQ":{"text":"Can one dish of lobster really change ones life?  Yes. Yes it can. If you are in New Orlea","useful":0,"cool":0},"ftsfu0JAGoKTngrJnEAK0g":{"text":"I couldn't love this place more! They do have valet which is very helpful due to the crowd","useful":0,"cool":0},"3Sz6btzBjg5mJTBIgWyjag":{"text":"We spent six days in New Orleans and did not have a bad meal but R'evolution was one of th","useful":0,"cool":1},"cr7alDrJ1som4_z0i9YDfA":{"text":"My new favorite restaurant in New Orleans!  Been twice in my two short visits back to NOLA","useful":0,"cool":0},"8z5J0YPvBQ_rOAmQS_kuKg":{"text":"Decided to go fancy, upscale, and let's be honest, expensive for my birthday. This place d","useful":1,"cool":0},"uabxWal2rmrYW_UEJ8ehjg":{"text":"AMAZING food!!!  Got to sit at the chefs table and I loved every bite of my Ahi!","useful":0,"cool":0},"WONSaQDijBZPhUQ4nDU3_Q":{"text":"Sunday jazz brunch. We walk into the cool, serene space; a jazz trio (guitar, clarinet, ba","useful":0,"cool":0},"KT3mhxXzwpCKnJFhyAhh3g":{"text":"Food was great. Death by gumbo was great flavor. Restaurant is in need of a sommelier to d","useful":0,"cool":0},"ULstM0OeKWn8SPm66ntUwQ":{"text":"So from one foodee to the next... NOLA is a haven for food critics and dining. I have eate","useful":1,"cool":1},"GecxGp_YCZuLYiHy120T_w":{"text":"I need to start by telling you that I've been here before. I was so impressed that when I ","useful":0,"cool":0},"CDFFUViEHvTQAATFI4A7JQ":{"text":"Let's see......  I've had my fair share of amazing dining in many states but there are no ","useful":1,"cool":0},"ei9FBsT6o9RKX1l6WioNnQ":{"text":"Being from NYC I have always had the opportunity to dine well, but this restaurant makes e","useful":0,"cool":0},"0tHDxkXFJ6AvupgOdSWcVA":{"text":"Outstanding culinary experience. Service is attentive and simply outstanding. \n\nAll dishes","useful":1,"cool":0},"Js7qNLxi3M7ifip5wfwzFQ":{"text":"Bar none the best restaurant experience I've had the pleasure of enjoying.","useful":0,"cool":0},"HgBR6tVQGctfCDONheqOVw":{"text":"This is a must do for New Orleans!  The steak tartare was far and away the best I have eve","useful":0,"cool":0},"FIkQ-WCx20v4qwW1NV1mfA":{"text":"Incredible! This is a must go to in New Orleans.   The crab beignets were outstanding and ","useful":0,"cool":0},"wriuM4u0SBCsyNMhZkuSkA":{"text":"Two and a half years later, I'm still a fan of at least the charcuterie. My sister and I d","useful":2,"cool":2},"a1X-uvY5zZl3LssleaX7-g":{"text":"Great food, wonderful experience. Located in the Royal Sonesta, New Orleans. Staff super n","useful":0,"cool":0},"8HSrlea80-UI37uF2K57Bw":{"text":"This is by far one of the best upscale restaurants in New Orleans. Tonight was our third v","useful":1,"cool":2},"jNZrpIV7oP1-zf3UyBv-nw":{"text":"My husband made reservations for my first trip to New Orleans. Based off others recommenda","useful":0,"cool":0},"vq8A_CiOYC1CIKUr72emBA":{"text":"The duck, the quail, the short ribs, and the redfish were excellent. We ate here before an","useful":0,"cool":0},"krxJqEwqdp4prWAEgSQYYg":{"text":"Over stuffed and over stated.  Much a do about nothing.  If you pay a lot for Pomp, it doe","useful":1,"cool":0},"5T2RaaxXCyO0-0HuzOiV0A":{"text":"Second visit and perhaps our expectations were set too high after a perfect and memorable ","useful":0,"cool":0},"epzYDMqHfAqa9og8ledXKQ":{"text":"I came here with my parents on a Friday evening when they were visiting NOLA. It was also ","useful":0,"cool":0},"8vBmGsSGGgE2D33L6aHoUA":{"text":"We went for lunch, a large group about 11 of us, the food was delicious however the servic","useful":0,"cool":0},"IxA3XZFFM2lKLGIyRktycw":{"text":"I must say that this restaurant is one of my top 10 restaurants I ate at in my life.  I ca","useful":1,"cool":0},"e91Mdds6Dhv-H6MlNYhr1w":{"text":"Superb. Excellent service. Shrimp and grits was delicious, rich and fun.  We shared a solo","useful":1,"cool":0},"BHHaEkHrjQW64y6eobNxgQ":{"text":"It is heavenly to walk off the bustling French Quarter street and into the hush of R'Evolu","useful":1,"cool":2},"dcwC9Uyibz3mKn1iGO_mcg":{"text":"Very elegant restaurant with great service, delicious food & incredible wine list. Death b","useful":0,"cool":0},"wWOVoArmCMU0N3rargqttg":{"text":"Restaurant R'evolution was hands down the very best dining experience I've ever encountere","useful":2,"cool":2},"G6K-DB7aI49CYPCVn-iZKQ":{"text":"We ate at the bar before heading to a show at the Saenger.  Beautiful bar, and very friend","useful":0,"cool":0},"u2WHHsAmd7DepyL1s0FrpQ":{"text":"We ate here last night with our teenage son. Service was impeccable. Food was delicious. W","useful":0,"cool":0},"H4h6Caw-ovkrbC68fO5fkw":{"text":"4 and 1/2 stars. Extremely elegant bar and dining areas.  Attentive service, without too m","useful":0,"cool":0},"7Efz7-R3N__rk8q4xhIFuw":{"text":"An amazing dining experience. The atmosphere is cool yet refined. The appetizers were inte","useful":0,"cool":0},"tbQJ0BwKLlNajHgphLDD_w":{"text":"3.5 stars \n\nWe walked in late and grabbed seats at the bar.  We were told to order everyth","useful":4,"cool":1},"qb2-71etrTiY3S-_tEzyDw":{"text":"I LOVED this place. The service, the food, the ambience, the drinks, the after dinner dess","useful":0,"cool":0},"-92YqRNMjPcNGmD5vZDTaw":{"text":"braised short ribs and grill oysters were amazballs... wow","useful":0,"cool":0},"rN91dFaW5K05aK-fkHnilQ":{"text":"An amazing dining experience. Food, service, decor, all superb.\nI had the petite filet mig","useful":1,"cool":0},"LBu9CUQoobyAn0Vv2Hu6uA":{"text":"We greatly enjoyed our dinner here with friends. The service was impeccable.  Very profess","useful":1,"cool":0},"nPPwSXUtRZHLolNKAaDtmg":{"text":"Awesome ambiance, music, service. We had brunch and it was ok. We ordered several appetize","useful":0,"cool":0},"5zHcXrn9w5QeMI6FGd3VeQ":{"text":"Our evening started out quite well here, the venue is nice and the staff seemed stuffy, bu","useful":2,"cool":0},"xgHPgvCOoLJUJbKEG7Y_Sw":{"text":"This is truly a superb restaurant. If I lived in NOLA, this would become a frequent destin","useful":1,"cool":0},"HILjTyaZh1pNF2MYtsngTg":{"text":"Impeccable! From the service to the food. This is an experience of a lifetime. Treat yours","useful":0,"cool":0},"O765_wcBFFjlZY0tgXuPUw":{"text":"By far the best dining experience I have ever had. After hearing about the horrible experi","useful":0,"cool":0},"SgmEXWS5WkZyNbttXAQdlg":{"text":"This place is amazing. I ate at R'evolution a couple of times during a recent visit to New","useful":0,"cool":0},"9T87V0irpnNKXxX-Eo24lQ":{"text":"I cannot rave about this restaurant enough!! The service was incredible. I truly felt like","useful":2,"cool":1},"5R4MY1LSecKnlA5QrNSzig":{"text":"I had been most looking forward to dinner here during our trip to New Orleans. I have to s","useful":0,"cool":0},"2877atvpfLwOKWWkfGoUbQ":{"text":"The food and the service was very very good!!!! So why did I say it was ok??? The restaura","useful":0,"cool":0},"WWzX2dkIktAKhYXux9NRSw":{"text":"Tuesday night dinner in the bar area. Fantastic restaurant! Employees are very attentive a","useful":0,"cool":0},"W8VIFdMEOlaMavOpEQ04Rg":{"text":"Absolutely fantastic!  Very creative and well done!  Highly recommend!  A new classic!","useful":1,"cool":1},"lH73rtjUXdWwr8J1giZe9Q":{"text":"Got the Veal chop, which was good but I didn't know it was going to be fried (my bad for n","useful":1,"cool":0},"TFtXn3sH9HP_tYyQqs01BA":{"text":"Best meal of my life.. Again. This was my second time here.We sat at bar while we waited f","useful":0,"cool":0},"Ci5wB12umodbvLGkjMyRaA":{"text":"Of all the places we've dropped a lot of cash for a swanky dinner, this was one of my favo","useful":11,"cool":7},"Y2Y_uBcnN1K6XUwcUSq7FA":{"text":"The service is impeccable. I thought Commanders is as good as it gets for service, but thi","useful":0,"cool":0},"XCueURe-gqkckTnQIuS8iQ":{"text":"Worst meal in New Orleans. The crab beignets were doughy and heavy with little crab - all ","useful":0,"cool":0},"A_D9H2N-HaAJ-HaQsEy16Q":{"text":"The ambiance at R'evolution is very posh and manicured.  The service is very attentive wit","useful":0,"cool":0},"vjLVYtJCd68saA9gIFn_rw":{"text":"On our recent visit to NOLA, the highlight was our dinner at R'evolution. We are both life","useful":2,"cool":0},"vIqkRRBZvd3VIbT-vnf1lg":{"text":"Perfection. We have dined all over the world as well as many parts of the U.S., and this w","useful":0,"cool":0},"9ulbS_cV6513UoTuLu1W0Q":{"text":"One of the best restaurants I have ever been to in my life. The service was amazing. The f","useful":0,"cool":0},"_CI9l8i7SPlG-RwOXzAblA":{"text":"I had a poor experience here, largely due to the service.  For the money, you're better of","useful":0,"cool":0},"LikAOB0YC2n1d6vpdHrDUg":{"text":"Started by sharing the death by gumbo- quail was perfect, and the roux was delicious.  Mov","useful":0,"cool":0},"37LL9bhNTLkX1mBhF4SQcQ":{"text":"This was one of the most enjoyable meals we have had in a long time. We went here for a Fr","useful":0,"cool":0},"yJiDrKWpd6ZEcHe5R8Mk4g":{"text":"This restaurant is all class! On the same level as Commander's Palace. The interior is bea","useful":0,"cool":0},"zA_IG7s0ZnwAXZj9-mtDEw":{"text":"Best birthday ever! I called to make reservations the morning of the day that we needed to","useful":0,"cool":0},"Xw51LlG3HVjGaLBpCt4NSQ":{"text":"For a party of three, we shared the Crab Beignets for an appetizer. They were absolutely d","useful":1,"cool":1},"uE8mvYllcaux6eZRrC6wIQ":{"text":"We went here on for our anniversary this past October.  I loved this restarurant!  The amb","useful":0,"cool":0},"H2mqe2uUoPO8vpNNX905sQ":{"text":"What an experience!\n\nATMOSPHERE:\nRight in the middle of New Orleans in an amazing location","useful":2,"cool":0},"LcLuNQ-fuc4UztcK8Fae0Q":{"text":"Unfortunately, the food was below average at Restaurant R'evolution. The Hoisin Glazed fis","useful":2,"cool":0},"e841VhtTcDIuP9_CKYPQoQ":{"text":"Probably one of the finest restaurants in NOLA. Although I must say, from all the great th","useful":0,"cool":0},"iK0XMxk_8SWtiiDt6idMBw":{"text":"3.5 Stars\n\nFine dining? Yes! Is the experience 4 or 5 star worthy? No!\n\nWe had reservation","useful":3,"cool":1},"5coSS45DlDRHzlqph7b4Hg":{"text":"Fancy but the food was underwhelming. We started with a complimentary bite of salmon garni","useful":1,"cool":0},"QpZf3ty7kf7kgbzIqJNOOQ":{"text":"Last night's treat was dinner at Restaurant R'evolution. Starting with what Inna said was ","useful":0,"cool":0},"7bFkHkfn4kZlljIyl45cug":{"text":"The food here is incredibly good-- gourmet with creole and cajun flavors. We had the chees","useful":0,"cool":0},"YIjlcbhrPRklLBR-oiIiBQ":{"text":"Seldom do we have a perfect dining experience. Last night was one of them!! Collin and Sco","useful":0,"cool":0},"RiTRKiSs4U3ff1uLRDfjJg":{"text":"Best dining experience in New Orleans!!! Service and food both amazing. Highly recommend. ","useful":0,"cool":0},"NUxYArrR2NJW7kBpFhrdeQ":{"text":"My wife had the steak. It was good, but not as good as what we can get in Texas. No surpri","useful":1,"cool":0},"PEbv1X700MlN2lJixh9mOw":{"text":"I'm sorry... Just don't understand the hype. Four of us had dinner and ordered appetizers ","useful":1,"cool":0},"53f5b7l0dY_w_7_AyODtbA":{"text":"My wife and I went here for our anniversary. We walked in and were promptly showed to our ","useful":0,"cool":0},"PipY6wLX_mdhqA4DamggVQ":{"text":"Beautiful restaurant and amazing food and service!  Be prepared to lay down major $ - but ","useful":0,"cool":0},"zCzQwknE7f1MwrUF7FFo6Q":{"text":"Oh, R'evolution. I hate that you're doing this to me.\n\nPREFACE: Before today, I'd been to ","useful":0,"cool":0},"j0kL0wfmhnJPLbx9yn1GTA":{"text":"Really nice dining experience. While it didn't blow me away, I thoroughly enjoyed myself. ","useful":0,"cool":0},"DE0Dw948jk4bLz4l5zySZA":{"text":"I've consistently heard that dinner here is fantastic but very overpriced and not really w","useful":10,"cool":3},"k5cVv0AUVWwxx6vC6Wa7Rg":{"text":"The upper echelons of New Orleans restaurants have enjoyed some time undisturbed by newcom","useful":1,"cool":3},"bxPjK8XkbzG0GrZ1zhI_9Q":{"text":"When I made our anniversary dinner reservation here I knew I was going to like it before w","useful":3,"cool":1},"3BJJfp9z-3u4zPITB_JOlA":{"text":"Perfect Service, Perfect Food,  in the middle of Bourbon St noise, quiet and romantic plac","useful":0,"cool":0},"TvNsF4rVfqEU8mSmXR-cgg":{"text":"Came here for Sunday Jazz Brunch and enjoyed the overall experience. Very classy atmospher","useful":0,"cool":0},"NtFFFemj-7-rOn8r-lDZtA":{"text":"Where to begin? The service, atmosphere,  drinks, and food were phenomenal at the Sunday j","useful":0,"cool":0},"GXcLJznLS84BsoisG60QXg":{"text":"Stopped by for brunch on a Sunday and sat in the bar. If you want to have a sit down lunch","useful":0,"cool":0},"HtfrUW2FGrIbgHiBLO94-w":{"text":"An amazing meal from start to finish. \n\nI started off with a Manhattan and my husband had ","useful":0,"cool":1},"LL7k56ihplRGy_vtUaYPTA":{"text":"I went last week with two of my girls and we had a girls night out!\n\nAt first as we walked","useful":1,"cool":0},"YfyIRvo7AiI4YPZhWDBHxQ":{"text":"Items Selected:\n\"Pig Out\" Board - Coppa, Prosciutto San Daniel, Lomo, Soppressata, Jamon I","useful":8,"cool":8},"-ATRBlrH_vNxd7cFyLro4A":{"text":"I went to this restaurant with a friend the last time I was in New Orleans.  We had an exc","useful":0,"cool":0},"IH68kV3h9j0L8duM1xXrzQ":{"text":"Strange experience. This place came so highly recommended yet it's nothing but an overpric","useful":0,"cool":0},"QuZOW3OCH1Yv4AvhPE0J4g":{"text":"We made reservations with Opentable for 915. We arrived early and the host told us we woul","useful":0,"cool":0},"mGEA7QV2xsPuO6Rwq4keBQ":{"text":"My partner and I hosted a dinner party at R'Evolution for 9 people, all adults, after abou","useful":2,"cool":0},"Js0jajlYZhL-9QaSBWMu5Q":{"text":"defiantly the restaurant in New Orleans! wonderful atmosphere, friendly and attentive staf","useful":0,"cool":0},"8PE6U3X31gGt-c2KxK1kvA":{"text":"Excellent in so many ways.  The service was spectacular.  The meal topped the service. If ","useful":0,"cool":0},"jeIlitsSdQydGiEuqsOSxQ":{"text":"Really Love this place, we sat in the chef's table and    enjoy the view of the kitchen. I","useful":0,"cool":0},"Wl0qIp5PDiRGlACqh6a3zQ":{"text":"Best meal of my life. Scallops and\nFoie gras. Unreal. Four of us and Everything  we ordere","useful":0,"cool":0},"-dKbZ-3S9IgLO6PY_OIFdQ":{"text":"Restaurant R'evolution is by far the greatest dining experience I've ever had in New Orlea","useful":2,"cool":0},"8o2l7vPEqu_X5B9JGWw5Ww":{"text":"No reservation for us. Walked in and enjoyed 3 courses for dinner. I know! How did this ha","useful":4,"cool":2},"GQo6vyv2MoBLZa1ulCTXIw":{"text":"To begin, this restaurant is luxurious and all around beautiful. It is one big restaurant ","useful":0,"cool":0},"VX9aGsD6DZ-3gyYDWxXBfA":{"text":"It is simply amazing how there are so many exceptional restaurants in NOLA.  We reserved t","useful":0,"cool":0},"pOOpOiAqmAUWLTDwU29xdQ":{"text":"Wasn't sure exactly what to expect but this meal was next level.  Even for NOLA!","useful":0,"cool":0},"IwHU8IpcGzUG_-hDIM56xw":{"text":"Excellent high-end southern spot.  Pretty massive menu and wine list.  Waiting 40 minutes ","useful":2,"cool":1},"PzU3gi5e6EQoFrMVXa5Lrg":{"text":"This place is very impressive, loved the layout and the decor. They even have a little sto","useful":1,"cool":1},"-3_ZoSzdrlyEyHncrnIwXg":{"text":"The restaurant came with a lot of hype and expectations & I was sadly disappointed. The se","useful":2,"cool":0},"ts9pFxFL_nURnb61Vk-4Jg":{"text":"My husband and I agree---- this was the best meal of both of our lives. \nI had the crawfis","useful":3,"cool":0},"NcoLv3izMPywFlFHX9ua4A":{"text":"Simply amazing.  Environment, service, food.  All perfect!  Can't wait to get back to New ","useful":0,"cool":0},"b0FjG4NzhdigPNu60T3tww":{"text":"Coming from an extremely picky eater visiting New Orleans, I ate here for dinner the last ","useful":0,"cool":0},"55a4mKKVAf2Vhm2ecjNQOA":{"text":"I've been sitting on this review for a while, mainly because it's hard to properly put my ","useful":9,"cool":3},"xIiOXMuBZzL4xTVqJN_AUg":{"text":"SO GOOD.  As good as the food is here, I'd have to say the service is even better.  Ryan a","useful":0,"cool":0},"WIigF_26ObwT7dwMcVfNSw":{"text":"I love restaurants that are classy and elegant and provide you with a reason to dress up. ","useful":2,"cool":0},"NUsQA0ARSbcN84JeSuXdJQ":{"text":"Upscale spot. Place oozes old world charm and elegance. Food exquisite, top quality ingred","useful":0,"cool":0},"amRxZ_Z-pu53IU1xB8XP2Q":{"text":"This was by far one of the best meals we had on our trip to NOLA. The restaurant is small ","useful":0,"cool":0},"1zm288tivS2rOUQDbzOMXg":{"text":"The place is very upscale, be prepared and look the part. Went there for lunch and had the","useful":0,"cool":0},"-lIqKYIvWwej5ttudO02ng":{"text":"Best food we ate in New Orleans.  Black truffle beef tartare, seared sea scallops with foi","useful":0,"cool":0},"04Ye2_OTy1LShbhtnREGSQ":{"text":"This review is for their Sunday brunch. The food was okay but not great! The death on the ","useful":0,"cool":0},"eu1EugOrf7YkAK20KFDaNg":{"text":"I was on a conference and wanted to organize a social dinner among a handful (9-10) of the","useful":0,"cool":0},"sSrp1udDmKi9fUwDFTjC0g":{"text":"The service here was awesome!!!! We were greeted with a smile. Very classy and cool place!","useful":0,"cool":0},"lW5EiK3flXk2HFnIRZwPfA":{"text":"Is there another city in America that celebrates brunch with the same fervor as New Orlean","useful":19,"cool":12},"wFPXQDS9zT1PgKcxMoiIcQ":{"text":"OMG. Went here for Valentine's Day and had an amazing time. There Cabarnet was smooth and ","useful":1,"cool":0},"nyNFEjPlj8IyXIilm-xdfg":{"text":"Summary: I would go for the gumbo, but the other stuff - meh. \n\nPretty last minute reserva","useful":0,"cool":0},"bG9291aDXnlhCoRnV9anOQ":{"text":"I had the pleasure of going to Restaurant R'evolution twice in a week, and really loved it","useful":2,"cool":1},"1sgTelYVpJ03ANGWvo8Z4g":{"text":"Came here for our New Year's event dinner and we had gone to such amazing restaurants on o","useful":1,"cool":0},"FYzrmAAmqLHzE5fcdk1zWw":{"text":"Probably my best dining experience in NOLA. The staff greets you and makes you feel comfor","useful":1,"cool":0},"w7-b0RDLPECbyIpnAD7Huw":{"text":"By far our favorite restaurant in New Orleans. Yes, this place is expensive, but well wort","useful":0,"cool":0},"bXj2nlcDL1gFIuVAtI2cwA":{"text":"This was the first restaurant dinner I had in NOLA and was blown away with the service and","useful":0,"cool":0},"_F7q99NEVHgcndaxh3TuCA":{"text":"Restaurant R'evolution takes itself seriously as a fine dining aspirant. The wait staff is","useful":0,"cool":0},"2pSejEd9npLu0N9j6I0DqA":{"text":"It is my first review but I have to say food sucks here. The soup is crazily salty and the","useful":1,"cool":0},"7uFc82-FVQj18F9iYtuEKw":{"text":"Took me and Mafalda weeks to get a r'eservation here, but I think it's mainly because of m","useful":0,"cool":0},"qawVzHPC_whdR7qUS-dwoQ":{"text":"Disappointing, relative to our high expectations (based on our first visit). While the ser","useful":0,"cool":0},"hR0ebJdsr0IAAUh_EJ9WMw":{"text":"Our office Christmas party was held here; the gumbo was very good, and the other food was ","useful":0,"cool":0},"gofXEHAXfIF87Xa_v9JvYg":{"text":"I still wear slip on Vans because even though Im fast approaching middle age; shoe tying i","useful":12,"cool":12},"9VnkPwEd62erQuaYA2oWNA":{"text":"We went in this dinner expecting this to be the best restaurant we would visit in New Orle","useful":2,"cool":1},"-RzThWi3kV1nsNH5_oJJGA":{"text":"We had Sunday jazz brunch. The food and service were impeccable. I would highly recommend ","useful":0,"cool":0},"qinPWM1L8DjNrCMwfY3KeA":{"text":"Amazing. Must go to spot in town. Very creative. Unique spot. Food is amazing. Service on ","useful":0,"cool":0},"bxcIAh7-4PFdt8EfWWF27g":{"text":"Run don't walk. Beg for a table. Don't miss the baked oysters and crab Beignets. Take a ri","useful":0,"cool":0},"IWO1MV6C5WU4_3PmiuxWJg":{"text":"Fantastic dinner start to finish. First, the service is incredible. Also, the wine list is","useful":1,"cool":0},"lZ3mrDrEXTMjUuJ8ZVLZbg":{"text":"I have been here twice, and I plan on going for every special occasion for the rest of my ","useful":0,"cool":0},"SOT4kTr9czwYaI_ECtrpZg":{"text":"This meal was the highlight of our trip to NOLA.  It was one of the best meal we have ever","useful":0,"cool":0},"fz0YhaM4EYrFgpipBPKowQ":{"text":"Love love this restaurant! I'll be back and will be bringing friends from out of town!! \n\n","useful":1,"cool":1},"4d_KRPRNfiOZOkQK1SktfA":{"text":"This was our best meal in New Orleans, one of those magical evenings where everything come","useful":3,"cool":0},"voSfLXqaL-lFqRl4WcIprA":{"text":"You get what you pay for, case and point! Remarkable service, outstanding food and perfect","useful":1,"cool":0},"47ObIr8-VY9tmHMe_bnAbA":{"text":"We are vegetarian and Jen the Chef and the waiter Jeffrey were extremely accommodating. Th","useful":1,"cool":1},"EguzZsr1cZI_L4wf9ZsvFg":{"text":"Disappointing, given the hype. Appreciated the complimentary birthday dessert and glass of","useful":0,"cool":0},"Hjgt1nWEKAdGqvJmUm368Q":{"text":"This place was ok, it seemed a little gimmicky..Alotta bang, but no buck... I felt like th","useful":0,"cool":0},"VMzNMcdGTao6pBUeo3CtDA":{"text":"New Orleans stands proud as an island of graciousness and class that no place in America c","useful":1,"cool":0},"E9FXbOfX4Ch5OaGwNnT6uA":{"text":"This restaurant was a bit expensive but the food and service were top notch. Great place t","useful":1,"cool":0},"dOw8P-ZbgT67YFtPJyCUGg":{"text":"Went for lunch and couldn't have been more pleased. Food, service, and ambience were all i","useful":0,"cool":0},"ebb1HDN1jOeI3pe_WWdOSA":{"text":"Seldom do we have a perfect dining experience. Last night was one of them!! Collin and Sco","useful":0,"cool":0},"_y8ChfAs0l_BNhZsy9aB5Q":{"text":"This place is absolutely outstanding.  They offer some decent appetizers in the bar area, ","useful":0,"cool":0},"U2CY3umt4hn_JEpdSFdFJQ":{"text":"This restaurant was legit. I'm a 33 year old attorney who was in town for an immigration l","useful":2,"cool":1},"gIE0ICdxxgvwHOYQZeIoBg":{"text":"In NOLA for a work conference and looking for something near our hotel.  Yelp me out folks","useful":1,"cool":2},"Cf8meCvV5I7etX6N3FtQqQ":{"text":"This just made it into the regular rotation of restaurants I have to go to while in New Or","useful":0,"cool":0},"tIfGUSC0sAE7q_TLkWcyKQ":{"text":"Absolutely amazing restaurant. My mom and I travel everywhere to try food, and we were so ","useful":0,"cool":0},"DYlhRq-Mlxw6eOp3beLw5A":{"text":"So so nice without being stuck up. We went for our anniversary and had a super meal. We ha","useful":0,"cool":0},"cAvVeU427mCiOZCVHkLMGw":{"text":"Absolutely phenomenal from start to finish. Took my girlfriend here for her birthday dinne","useful":1,"cool":0},"BbMHWmc-fgtZtyXlxAYn3Q":{"text":"Really great service and tasty food. This restaurant is so close to Bourbon street. We had","useful":0,"cool":0},"VniT0i8fO_BG4dBn73Kj7A":{"text":"Best dining experience in New Orleans! Every dish was a hit/delicious. Travis and Chris we","useful":0,"cool":0},"Urkz2LTgvdd2YZHmrkeouw":{"text":"Rolled in, set at the bar and found my way to perfection. Jonathan took control as more th","useful":0,"cool":0},"wGyFYzUoU9MaD95cIrElGw":{"text":"We still have a smile on our face.  This place is fantastic.  \n\nIt was a Sunday night and ","useful":3,"cool":0},"QGAPtQrO712WtOnZppnzfA":{"text":"Still my favorite restaurant in NOLA!!! I could  list all that we ate but frankly everythi","useful":1,"cool":0},"go7QJgJKtxjgXwCvyibhVw":{"text":"The service could not have been better and the food was amazing. The death by gumbo is fan","useful":0,"cool":0},"Rm0e0sZ0gd4zGkHNRTIz9A":{"text":"A lot to be desired for the price. However the roasted chicken was delicious. My hubby ord","useful":0,"cool":0},"spaRwrMpEaFh7n-mXTeowA":{"text":"Love it! the bbq shrimp poboy is to die for. This is a busy place and even though we had t","useful":0,"cool":0},"qzzVQvtUVU7b59yPfm5Q7Q":{"text":"Wow! This was, by far, the best Jazz Brunch I've ever had. The environment was cozy and co","useful":0,"cool":0},"c4XfTUR67u8HhkW2SjdeyQ":{"text":"I went to R'evolution a few months ago with my mom and my sister.  I was excited because I","useful":1,"cool":0},"7kPMK7RTf8M8X5TRTql0SA":{"text":"Wonderful atmosphere and a really great bar. We had dinner at the bar and had a great expe","useful":0,"cool":0},"cqJstMCC5-in1qf-ar0TXw":{"text":"This is a must if you are visiting NOLA!!! Everything on their menu is amazing and the ser","useful":0,"cool":0},"jnVMShSaCvN3A7sN59oiCg":{"text":"its the best restaurant in new orleans- its a beautiful restaurant with a professional sta","useful":0,"cool":0},"-DwmNXTb88fEIDMbZY8tEQ":{"text":"My wife described our evening as the \"the best gastronomical experience in North America\".","useful":0,"cool":0},"kBFdjcRgN4vPaU4J-hlaTQ":{"text":"I have lived in New Orleans for about 4 years and it is the best food, ambiance and servic","useful":0,"cool":1},"gCmGswqLiWB1rIDIJzbpwA":{"text":"I wish I would have read the reviews more thoroughly before we got dressed for dinner...I ","useful":1,"cool":1},"fB33hNp1WvTIZpZB9so5_w":{"text":"Came for a birthday lunch, and fell in love with the decor. Large chairs, stools for our p","useful":1,"cool":0},"g-24cjHArgipALAbYRj2YQ":{"text":"OMB!  Oh my Buddha, for those of you who are not in the know.\n\nThe hubby and I have been h","useful":2,"cool":1},"RsIbYfzOp2GhuS1eo_-stg":{"text":"Had a great Christmas Eve dinner here with my wife, 19 month old daughter, and inlaws.  We","useful":0,"cool":0},"PVMLfcBUgx8mi8FYNy-A1g":{"text":"Had a wonderful lunch experience.  Roasted 1/2 chicken was perfectly cooked and presented.","useful":0,"cool":0},"1xitAbxO_cTF2X5w_bR2fw":{"text":"The quail prepared three ways is a joy. The braised boneless short ribs just melted in you","useful":1,"cool":0},"splVzFdxECEGNSWkxJ25dw":{"text":"The most amazing third maybe forth meal that day and it was only 4 ish.... We sat in the b","useful":0,"cool":0},"vi5T5cgbmbVCpXSPVYsJ2g":{"text":"Modernized New Orleans cuisine.  Located in uber busy Bourbon street but thankfully its tu","useful":0,"cool":0},"87wMQGy-76W4GnGKS7zBmA":{"text":"Had Saturday dinner here then Sunday brunch. Food was very flavorful but came out luke war","useful":0,"cool":0},"uTPmrQnhMe_eeg0l616oiw":{"text":"Where does one go with an unlimited budget, a great palate and a yearning for some classy ","useful":2,"cool":1},"VSaOh6r6nnu9tsduzjnhng":{"text":"Amazing food and service! We had Colin as a server and he totally went over and beyond for","useful":0,"cool":0},"kKxlCZ4IehTiQ7m2c5_ApQ":{"text":"This was an overall excellent experience, but I'm knocking off a star for one odd thing th","useful":2,"cool":0},"tW38QGvW0I8K3MdABcNHmg":{"text":"Ambience was superb.  I especially recommend you ask to be seated in the Storyville Room: ","useful":0,"cool":0},"122YRwwhItTE1ZRWmePR2A":{"text":"WOW!\n\nI can honestly say i have never had a dining experience quite like this!\n\nI went to ","useful":2,"cool":1},"1Tr3uzxndJ9n9y0StSt70w":{"text":"Really people?  Really?  Just because a place has a somewhat high price tag and a famous c","useful":2,"cool":1},"I6w6UIQm_TA9oDykVYviUw":{"text":"Wow, just wow. This place was fantastic!\n\nLet me preface my review by saying that I'm a pe","useful":0,"cool":0},"V3x9KA9VtVhHG3fisj4txw":{"text":"I felt like a celebrity eating here! I don't think I have ever known such luxury. The wait","useful":3,"cool":2},"6ytUsboJZRo9MpZEZTBdCw":{"text":"We came here again for a special occasion. Our waiter blew it out of the water. He was so ","useful":0,"cool":0},"KHbMVQqfrCLBj3w605yCSA":{"text":"Pretty restaurant. But overpriced. We enjoyed our assistant waiter!! He was very sweet and","useful":0,"cool":0},"aZDVzBw4Q-bie006mNbmgQ":{"text":"Awesome. Superb service. Super ambiance and atmosphere. Outstanding food. Unique. Creative","useful":0,"cool":0},"VTckDgNGb5S7NVunEC46lA":{"text":"I haven't Yelped in a while and rarely give 5 Stars, but R'evolution warrants it. We had o","useful":2,"cool":2},"jKxgvZMI8q6lknlo3MCB-A":{"text":"Service was perfect- very friendly staff-veal chop perfect-\nGreat atmosphere and has diffe","useful":0,"cool":0},"5R5T95SSJY0KJgf92kj1yQ":{"text":"Restaurant R'evolution is the place to go for upscale cajun/creole fare in the heart of Ne","useful":1,"cool":1},"TZ3KjtG2xgSBp0CpKmep-Q":{"text":"Last Friday, I enjoyed a one-of-a-kind dining experience at R'evolution, Chef John Folse's","useful":2,"cool":1},"7ROCz9VtHWPXHnzPJM6XaA":{"text":"Fine dining at its BEST. Completely blown away by the entire experience here. We were told","useful":2,"cool":0},"vRS9hAwQxYpR5hxd9Iy7sA":{"text":"This was our last restaurant on our 5-day New Orleans vacation, and this was easily our fa","useful":0,"cool":0},"LOyizqkGkaSRMb7QHurlfQ":{"text":"Absolutely FANTASTIC!!!!!! Came in for brunch and this place didn't disappoint. I was not ","useful":2,"cool":0},"HiWzWOA3e8MkcZCsjvfhKg":{"text":"Outstanding dining experience in the heart of the French Quarter.  One of the best restaur","useful":1,"cool":1},"5yM5TrOtUH_OpTJd3VElig":{"text":"If you are looking for a place to have a gracious and elegant experience in a beautiful re","useful":0,"cool":0},"1iIzTkFc2g9II0wti_9rGA":{"text":"First meal in NOLA and it was excellent.  I'm traveling alone so I ate at the bar. I was i","useful":0,"cool":0},"E6M4TLvghvgxu977ryhjQg":{"text":"So much to offer, and yet it missed.  The beer and cocktail menu was excellent, if a bit o","useful":0,"cool":0},"bnmLM342_OZXCi6X6HE6UA":{"text":"Cruised in here, trying to find a good meal ASAP early on a Sunday night.  Prior to gettin","useful":0,"cool":0},"6AQuGfnI5p6sCcXzY7UPfw":{"text":"I recently took out a very large customer to dinner. While researching places for dinner I","useful":1,"cool":0},"2CK4O7NnRK9B9KWNf2CARA":{"text":"Great food. Very knowledgeable and courteous staff. Pricey. Spent about $100 per person. A","useful":0,"cool":0},"COPv7yJn8gPHKfyiAs_tZQ":{"text":"After extensive research on fancy NOLA restaurants and reading about 50 reviews of R'evolu","useful":0,"cool":0},"RsMSKhK3SSPOGyXK8XsTfg":{"text":"I don't know if it's the spot we had or the food.......eh, IT WAS BOTH.  For a a fine dini","useful":0,"cool":0},"EHVeH0JQ52toskx4C2xC1g":{"text":"Wow, great food, and I really mean great. I am in the business and every bite was delectab","useful":1,"cool":0},"TTusGweUkE36zJByrphUwA":{"text":"Do yourself a favor and go here!!! Food is amazing, cocktails are amazing, service is amaz","useful":0,"cool":0},"cxKNUn2lY-YYmYyxGZ7jlQ":{"text":"Back again for dinner- how nice to walk into an adult restaurant in the middle of crazy Bo","useful":0,"cool":0},"KIrZOFZ1do4U2_Llt__Rxw":{"text":"Loved loved it. Great service great food very beautiful and unique things like lighted des","useful":1,"cool":0},"XPAYqU-WUehPn-RfZkiohQ":{"text":"Wow! What can I say? R'Evolution was one of the best dining experiences I have had. We wer","useful":2,"cool":1},"yDbkUymn2ex46xAdKCw32A":{"text":"The. Best. Dinner. Ever.\nLike OMG I can't even explain ... There are no words to justify j","useful":2,"cool":1},"iDRU4SQRbQT39LKbsrxSWA":{"text":"My favorite food experience during my most recent trip to New Orleans. I loved everything ","useful":1,"cool":1},"insgLb8QubTKGF1d8xU3vA":{"text":"We arrived a few minutes early for our reservation and they sat us immediately.  The wait ","useful":1,"cool":0},"R0QFTbCdNjCX5fzqORU9ZQ":{"text":"I was in NoLa for my bachelor party and had a reservation for Sunday 5/31 at 8:30 pm. Only","useful":1,"cool":0},"1tsjQ6lBs_Y6_bAVDSvE0A":{"text":"Lets start with the service. Top notch, quite the royal treatment.  We loved the death by ","useful":0,"cool":0},"JJe22bSyDMNPcrT-Ws5RpA":{"text":"The next time I'm in New Orleans, I will make a pint of returning to R'Evolution.  I had t","useful":0,"cool":0},"dDfoESEKFLRpJD_1FsumFw":{"text":"Me and my girlfriend had dinner here the other night and it was a truly fantastic dinner e","useful":2,"cool":1},"kTh9wDYUPuY9Hy7tivVhZg":{"text":"Very disappointing lunch. Started off well with excellent broiled oysters and crab corn ca","useful":0,"cool":0},"OUbbRqCl_HWn5zr1Rsj5Fg":{"text":"My BF and I ended up here unexpectedly after ditching a wedding across the street because ","useful":0,"cool":0},"M0j8v95N5Bw-QHsN6EUMOg":{"text":"It's a fine dining restaurant, the gumbo, honestly is the best i ever had in all the Frenc","useful":1,"cool":0},"hslmqsMP9BokTagxsYSzJA":{"text":"The most wonderful New Orleans restaurant. A must if you are visiting the city. Fantastic ","useful":2,"cool":1},"OJ6gREL_95i04i7pg3EL1g":{"text":"My husband and I decided to have dinner here due to the great reviews and it was well wort","useful":0,"cool":0},"UUJ4Wyx8c0HeuIQnY7YHdQ":{"text":"YOU HAVE TO GO TO THIS RESTAURANT!!! \n\nMy wife and I eloped to New Orleans and decided to ","useful":0,"cool":1},"N82iTjmGtr5NsYjgW9Kg2A":{"text":"Came to New Orleans for anniversary. I let them know about our day. Amazing service, food ","useful":0,"cool":0},"OrUtxeE0yvLGI3bznAflBg":{"text":"Once you get past the snotty dweeb at the front, you will find the restaurant, and the ser","useful":2,"cool":1},"OHUKbWxv55uphrpkmaH3HA":{"text":"4 1/2 stars. I heard from a local who grew up in New Orleans that this was the hottest tic","useful":11,"cool":5},"H3nEdXggpLdARlzYE8qEDQ":{"text":"Top-of-the-line cocktails, Wine and Food. We couldn't get into our desired restaurant, GW ","useful":1,"cool":1},"dN-xhR0jtNT4Y_g6V6gfqg":{"text":"My wife and I popped in for an impromptu light dinner at 5 pm on a Sunday -- we ended up e","useful":0,"cool":0},"fUnV5iH3l3Ow7JeJQwKX2A":{"text":"If you've only got one day in New Orleans to try a jazz brunch, you may want to go elsewhe","useful":1,"cool":0},"rV16Zuz7jVcJGxxrYwqmBA":{"text":"There are an astounding array of better restaurants in New Orleans. Please do not waste yo","useful":1,"cool":0},"usb1iIV6QAMhq0S8RdCDpw":{"text":"We were there a little while ago. It is pricey, but the food is second to none and the ser","useful":0,"cool":0},"F-0xfCGzwqeYBa8Hjlfr3g":{"text":"A truly memorable meal. I love New Orleans for so many different reasons and even lived he","useful":2,"cool":1},"ImmeRQP6oNxrF0J94nOkfw":{"text":"Really excellent venue, food was excellent, oysters starter were very good. Sandwich main,","useful":0,"cool":0},"0VCBG5oFETEykFd_mALfrw":{"text":"Best restaurant in the quarter. Everything is fantastic. Eat everything. I've been here fo","useful":0,"cool":0},"Pptsx82u5GixoXJQfTc7Uw":{"text":"This is a great place. Many extras along the way. The shrimp and grits were great and the ","useful":0,"cool":0},"YnceYLMhHbIxEujJeijtfg":{"text":"Excellent sandwiches. First time I had a salad with fish of the day but I brought my husba","useful":0,"cool":0},"6fvGmLv2i_6_dKOK7uBCdA":{"text":"The best restaurant/ food experience I have ever had! From start to finish, it was all ama","useful":0,"cool":0},"Oq5EgXqmGx_xvfjF0sc_XA":{"text":"I am writing this email in response to my recent visit to your restaurant. My boyfriend an","useful":0,"cool":0},"d5HXAGe2OkJD8gChmEmvSw":{"text":"Very nice ambiance.  Fun waiter.  Food overpriced drinks overpriced.  One and done for me","useful":0,"cool":0},"bQ86HHn6sUk6n8cnTKMD9w":{"text":"We had lunch here on my birthday and it amazing.  Everything you expect at a great restaur","useful":0,"cool":0},"BeCtFylWYPpnOeA2CfIUBA":{"text":"I greatly enjoyed my dinner at Restaurant R'evolution. The food was by far the best that I","useful":1,"cool":0},"RvWvKGuvHPcLmvkDZR4gsA":{"text":"This is my favorite place in NOLA for a special lunch or dinner. The service is consistent","useful":0,"cool":0},"NAaoejb3fgtVd6BsD3kIWQ":{"text":"First off, let me say SERVICE WAS FANTASTIC!!! I really wanted to like this restaurant. I ","useful":1,"cool":0},"_6m9jhK-1PCNnp84ARHVfA":{"text":"Relax in this classy but comfy dining newcomer--intimate feel and professional staff guara","useful":1,"cool":0},"r82pw5Fb86o8bdOHUYARHw":{"text":"Loved this place. Took my girlfriend to the big easy to enjoy some food , drink and music.","useful":0,"cool":0},"AZ5h39jkd2emu-iH6scnQw":{"text":"Had a great meal here. The service was spectacular. The bread they give you is warm and cr","useful":1,"cool":0},"5u-LsPr5L9aCRUHhAzDItg":{"text":"By far the best restaurant I have dined at in the past year.  The service is top notch and","useful":1,"cool":1},"kIUjvRII_7hr1ujIOSBUKQ":{"text":"Had an incredible dinner. The aps, main course, and dessert were all great. Service was gr","useful":0,"cool":0},"iLQ125N-nA8ht2pVGS7Wig":{"text":"We recently visited Revolution for the first time. As someone who doesn't mind spending ex","useful":1,"cool":0},"C1Mi8N7sp0uHWCBfQtkz4Q":{"text":"The food here is sooooooooo good. We had our anniversary dinner here and were not disappoi","useful":1,"cool":0},"ncUg75h522gNTpLHZXwdfw":{"text":"We have eaten at almost every fine dining restaurant in New Orleans several times.  Restau","useful":0,"cool":0},"cOOptYVhy4TgxvGgYBaMUQ":{"text":"What an awesome experience!!  Sat at the Chef's Table and that was incredible. ..  Death B","useful":1,"cool":0},"Yc0gIv1xMvDzV4uwuRA0Cg":{"text":"By far, THE BEST RESTAURANT I've ever had the pleasure of going to... IN THE WORLD! I can'","useful":0,"cool":0},"lcEXYuNenWjH4LpGH70-sg":{"text":"Hands down the best restaurant - and meal I've ever gone to/had in the USA. Only one meal ","useful":4,"cool":2},"ubY_3khwvijgW6PuhfCGQw":{"text":"After two good meals here in the last few years, I was disappointed that the food wasn't b","useful":0,"cool":0},"HfFzmqXUMUsJh-HjjhOPpg":{"text":"OMG - absolutely amazing experience.\n\nWe made a reservation here at 7:45pm, and were seate","useful":1,"cool":0},"r5jrrAr5s5ahJU4CW-S86Q":{"text":"Yum Yum Yum and MORE YUM!\n\nCame here with 8 girls for a super late dinner at 9:45 PM, they","useful":3,"cool":2},"dNZdaQ4Tnae9VJAcRmN03w":{"text":"I love new orleans and it's food. This place was no exception. The 3 stars is more of a pe","useful":0,"cool":0},"P1Ef4eM4F_Zn_X_9ZHgKNA":{"text":"One of the best dining experiences to date. From the flavors, presentation and service. Th","useful":0,"cool":0},"yx1wK5Pe4Sk-Exqw4xL-7Q":{"text":"Seriously surprising we drifted in from the airport staying at storied Royal Sonesta hotel","useful":0,"cool":0},"jBqfWkvXVTvHpufI_AvuSQ":{"text":"First-class slice of heaven. Our meal and experience was phenomenal. Expensive, but worth ","useful":1,"cool":1},"WsSg_FzLX2_ezfMbd1IGyA":{"text":"Came by here for a work dinner on the recommendation of a friend of mine. Nice spot, I end","useful":0,"cool":0},"mndLXMBwhmaGo13qtp7TLg":{"text":"Not only is the food delicious (as everyone else has stated in the comments) but the servi","useful":1,"cool":0},"Jv6nUOLDZPqQqFTdQNHTUA":{"text":"We loved everything about this restaurant.....food, service, decor, atmosphere, etc.  The ","useful":1,"cool":1},"wHXUZ-KBo_i8E2RYQoHt7g":{"text":"I have to say, this place is overrated.  While visiting NOLA this restaurant was recommend","useful":0,"cool":0},"MRXZudSXnHJvY_Ung0OFnQ":{"text":"Top 5 meals I've ever eaten.  From the ambiance of the restaurant to the presentation, div","useful":0,"cool":0},"8zLwGnhezAVeaRYew4stXA":{"text":"Everything was extremely tasty with great presentation.\n\nSweet potato bisque, strawberry s","useful":0,"cool":0},"Tl31aevdTeW7WljwBPcxhA":{"text":"\"Absolutely amazing\" enthuse fans of this \"game-changing\" collaboration between renowned c","useful":0,"cool":0},"zy__y7ubesXzvLCIWNsojA":{"text":"Next level contemporary French cuisine. Creole cooks that whip up a Death by Gumbo like th","useful":0,"cool":0},"by8N8jhzEEFyEXfKGPMC_g":{"text":"It's one of my go to spots in New Orleans.  If you can't get a reservation the bar is good","useful":0,"cool":0},"lq_ESWpzrID4Zfkw61sHzA":{"text":"This place is amazing. We were lucky enough to score a spot at the communal table last min","useful":2,"cool":2},"BU2WJ8YueSFhHFg2IpGjKQ":{"text":"Trust a local, stay away. I'm a native New Orleanian, and I have been to a majority of the","useful":0,"cool":0},"QZ_hiBwsf2pmBObJ_EbIgA":{"text":"Service and food was world class! Everyone was very knowledgeable about the menu down to t","useful":0,"cool":1},"2VsQ93DuCOGAskYj5lskPA":{"text":"went for brunch last sunday.  i must say we were more than impressed.  the food was one be","useful":0,"cool":0},"u4i8aBQfj4W9Xgixll9mNw":{"text":"We went there last night for dinner and it was terrific! Food=amazing! Service= impeccable","useful":0,"cool":0},"Fmsdkk0BI01HWoj0RCDcoA":{"text":"Yea, its pricy but its so worth it. The service is top notch, the food is the most amazing","useful":0,"cool":0},"zSJrCB74j9NS4o6k6AIddQ":{"text":"Absolutely wonderful experience. Designed to remind you of a gorgeous creole home. Unique ","useful":0,"cool":0},"xtKbHvlxQqhXpcu1yZ9CkA":{"text":"Went here for Sunday brunch on my boyfriends birthday, very upscale place. I enjoyed that ","useful":0,"cool":0},"A9gX_A-OtlwXQxH5zeOWkQ":{"text":"My husband and I dined here for our 10th wedding anniversary. We ordered a ton of food and","useful":0,"cool":0},"bhFcQzjwV6qdkLSrjebXAg":{"text":"This was referred to us by a local and our concierge Nicole. Every dish was better than th","useful":0,"cool":0},"As1SbsTk8CsFgHQ05WkQPw":{"text":"One of the best meals I've ever had in my life. Extra points for the dessert box and for t","useful":1,"cool":3},"2GOql6WEK3bD-TmaFceOwA":{"text":"This place is so nice. I definitely did not dress the part, but they still treated us like","useful":3,"cool":1},"NChtrDLXCCvruYjIlLalzA":{"text":"A gem in the French quarter. The rabbit dumplings are a must! Our server, Kevin, knew the ","useful":0,"cool":0},"IJo06p_Ij72FAFkQooJuFg":{"text":"Absolutely amazing food and ambiance. I felt as if I were dining in someone's home (fancy ","useful":0,"cool":0},"jGYC4DO3-LL8rv_648JUrg":{"text":"Best restaurant in New Orleans. We saved it for last. A wonderful dining experience. Every","useful":0,"cool":0},"H0FIEf2hko2hRFxaQNkY3Q":{"text":"Outstanding food, ambiance and service. The crab beignets are ridiculous, I ordered the sh","useful":0,"cool":0},"hwjqNjJWEbiKE0daWKImTA":{"text":"Awesome food and service.  After eating at several french quarter resturants this one fina","useful":0,"cool":0},"JbE9SBiZapxWbZYxiedV9w":{"text":"R'EVOLUTION is a breathtaking space. It is nice to see new Yankee money investing in New O","useful":6,"cool":4},"vhoubShBweWJu5zpZGNerA":{"text":"made the mistake of going here for new years eve....didn't have their normal menu...i must","useful":0,"cool":0},"u9jNR6e_bu8bz1ItuS4Jfw":{"text":"Great restaurant and service! The crab beignets are a must!! They are absolutely amazing a","useful":0,"cool":0},"LepbeunKjF2xWK9JO4Vmnw":{"text":"Without doubt, the best restaurant I went to in New Orleans. Customer service was impeccab","useful":0,"cool":0},"LiENyi5_X7Z6jepRr0pHiQ":{"text":"Went to Restaurant R'evolution tonight. I've been in New Orleans all week celebrating, and","useful":1,"cool":0},"7c1q48vR4ZVxfOkAJOTHJQ":{"text":"We came for a 50th birthday dinner and we're seated in their private room by the wine cell","useful":2,"cool":1},"Sazyj7aDJrmuBkDnMnUEsw":{"text":"See complete review on Open Table dated March 14, 2017. \n\nThe evening was perfect, start t","useful":0,"cool":0},"1VtOIEf7HORpvxrQetiLyw":{"text":"Best food I had in NOLA. Yes its pricey but so worth it. I thought it put commanders palac","useful":0,"cool":0},"t3C5uzFlhsz_xp4tmEt3dQ":{"text":"Our tour brought us back to town earlier than anticipated and we arrived earlier than our ","useful":0,"cool":0},"Pnjj307gBEjy5bQjsXlUVA":{"text":"We came here for Sunday Jazz Brunch. We made rsvps on Open Table. Beware, they have a canc","useful":0,"cool":0},"7Ne9WbRPbXNPdpbfqVpJ_w":{"text":"The food and the service were truly outstanding.  I had a fish Napoleon, with asparagus on","useful":0,"cool":0},"l6mtYa3tB8QX8V312pZQXg":{"text":"Excellent food. Sat at the bar reading a book for a few hours. No one bothered me . The se","useful":0,"cool":0},"u3tM6vJgShJqsFOqOBZBZA":{"text":"Environment - great\n\nFood - great - There is nothing I can say bad about the food.  We wen","useful":2,"cool":0},"JF5ONFH0LbTxwXTscxHoag":{"text":"As always, staff was extremely pleasant & the Jazz quartet was amazing. Most of the food w","useful":4,"cool":2},"zwLjNY2ERTGxRmE1UGibBA":{"text":"This place is as fantastic as everyone else says. Decided to try my luck and get a reserva","useful":0,"cool":0},"s_ni-rwG_h2WrFW_LXs8Fw":{"text":"Food was great, service not so great. I was staying at the royal sonesta for a business tr","useful":0,"cool":0},"kR_cM5ZFG9VLGc9YJgf-gg":{"text":"This is the best meal I have had in at least the last 12 calender months if not more. Serv","useful":1,"cool":0},"-8M5mA1zqvZvnDWgXQdt8Q":{"text":"Delicious and well thought out menu. Gorgeous location in an old mansion in the French Qua","useful":0,"cool":0},"8GlNUgepkfEMQdPMH4Kf1w":{"text":"Amazing atmosphere and amazing food! The waitstaff is very friendly, and even gave us a to","useful":0,"cool":0},"Yfj86GnyTyMldK7aA1gYeQ":{"text":"Excellent meal courteous service.  The dessert I had was okay.  Nice decor.","useful":0,"cool":0},"TSsffXxvuo5hkk04kw0teA":{"text":"Incredible. This IS the place to visit if you are looking for a dinner experience. My husb","useful":3,"cool":0},"7JVcGSvZFExnRPs7kCyKHQ":{"text":"I had one night in town and decided to try this restaurant because I am a big Tramanto fan","useful":4,"cool":2},"Ndyl4vTvAxqKcI6YhXbVPg":{"text":"10-20-30 stars!  Indulgence that is sneakily indulgent... When a steak house chef and a lo","useful":3,"cool":3},"TtyE85kkAbh0o9JJgGLYRw":{"text":"I love the atmosphere; like sitting in the kitchen at the chefs table. Service is witty an","useful":2,"cool":0},"ipc3dgP6fL-94pck3LmdHQ":{"text":"Great place...Lunch in the bar was wonderful...good drinks...and a great selection of food","useful":0,"cool":0},"iXQzjoMen4ZkRbPdVCmEww":{"text":"We hardly have the words to describe our experience.  The food was impeccable.  I had the ","useful":0,"cool":0},"I_R94N3GfEaKin6no-bGQw":{"text":"The service is impeccable with the food to match. You are surrounded by beautiful murals a","useful":0,"cool":0},"V9wU0RiaVeEJt0mDIpa7Tw":{"text":"This was our favorite meal while in New Orleans. We went for Sunday brunch with jazz and h","useful":0,"cool":0},"Ck5j8cj_8vqkbbFH_01Tlw":{"text":"I made two reservations here during my annual trip to NOLA this year. One was an evening w","useful":5,"cool":0},"FR31NQTj15OrQTexA_AArQ":{"text":"I didn't get a chance to eat at this place on my last trip, but the bar is superb.\nTalente","useful":0,"cool":0},"zDtf2jFcTz9XHuNvanLUwA":{"text":"LOVE! LOVE! LOVE!!\n\nWe had the Filet Mignon (9oz) served Blue with the Sautéed Lobster & t","useful":0,"cool":0},"-D7XUbFr8yjmzatawMOaZw":{"text":"Pricey but very good.  Having lived in San Francisco for more than ten years now my bar is","useful":1,"cool":0},"xIaaC4meCFy1-cTkIirifQ":{"text":"Oh my goodness!!! Must eat here!!  Do Not leave NOLA with out eating here!!\n\nWhat a great ","useful":1,"cool":0},"fGRtRrntEVqcZlNAu8bK5A":{"text":"amazing experience minus our waiter...he seemed to be VERY busy but luckily we were not in","useful":0,"cool":0},"8AmF_jZeVYj1kT-0yTxXxg":{"text":"There are few restaurants that I award 5 star but this place is one of them.  Let the phot","useful":0,"cool":0},"Ri1o_QMEQWC3m0CfDLLdVA":{"text":"We absolutely loved our experience at Restaurant R'evolution. The food and the service sto","useful":1,"cool":0},"B4c9AvCVF_Kxioxijh_UeA":{"text":"Definitely one of the best meals AND service that I've ever had.\n\nLobster gnocchi, charbro","useful":2,"cool":2},"-L3LgdJY2oAO4qPp5wiZFA":{"text":"NEW ORLEANS: Thanks to celebrity chefs Folce and Tramonto for creating the New Orleans res","useful":3,"cool":3},"NbMcIiNrxF48QYsbCJ9G9A":{"text":"Good, but somewhat of a let down in terms of my expectations.  Had the \"Death by Gumbo\", w","useful":0,"cool":0},"Yx4V27ntHxN8n8pM1AbDFA":{"text":"I LOVED this place!! We weren't aware that we needed reservation ahead of time but it didn","useful":2,"cool":2},"T3ua3Wk9HueaXFGpTHmTXg":{"text":"Great food, charming decor and fantastic service (three servers per table)! The steak was ","useful":1,"cool":0},"sTGUv2bAZh0vuEmVHm7maw":{"text":"I had very high expectation on New Orleans food. This was the first meal we had in there. ","useful":0,"cool":0},"UlwwkeOctNBYVYHGuumRHg":{"text":"I came for my Husband's 30th birthday dinner. The service was pretty good but a few of the","useful":0,"cool":0},"8iT83wMr8eWtkaLLkueu3A":{"text":"Rory is the best!!!  Great service!!  Great food!!  Awesome place!!  Will come here again!","useful":0,"cool":0},"XKSBj4Jg8_j-7Lluv_gAOw":{"text":"My first time in NOLA for a weekend and up until we ate at this restaurant was all the ser","useful":0,"cool":1},"KtUsfJpkeOfnBahTRMSS0w":{"text":"Food is definitely very good (just a bit salty than my taste, but still really good). The ","useful":0,"cool":0},"H5s9EoXCJrh0Det212XZMg":{"text":"Love this place. Great food, a little disappointed with the wine list. I prefer bigger, bo","useful":1,"cool":0},"BwpwRVSNyTwY_X2HyXBI-g":{"text":"Love this place. The interior of the restaurant, the finishings, the decor and design are ","useful":0,"cool":0},"VqSEQbR8Pnxg-Gpw-Pq8Eg":{"text":"The food was delicious! But the service was over the top!! We were taken care of by Collin","useful":0,"cool":0},"Xm_Xfo-51PxgF7Nlr97TUA":{"text":"Beyond amazing experience at R'evolution. Our waiter, Kevin's hospitality, knowledge, and ","useful":2,"cool":0},"htf9fkUmn8JLLIuUtco8Yw":{"text":"I feel bad writing this review since I seem to be in a minority and also because you shoul","useful":0,"cool":0},"o9WnUgS2WTWAyQgrZ5gThw":{"text":"ate at the bar area for MNF; great atmosphere, high class and sports bar / business HH ble","useful":3,"cool":1},"p3Sfm-xpKMmNJCaJ1Sx1BA":{"text":"Hands down one of the best meals I've eaten in the last year. And I live in the food city ","useful":0,"cool":0},"4Pjp875JB29qA0NivWAxoQ":{"text":"This have been one of the best high end restaurant I have been, and trust me, I have been ","useful":0,"cool":0},"IEtZ2AHufyxE9Fi9mLOUDg":{"text":"We called three days ahead and made a reservation for 8 at 9:00 pm on a Sunday. On the day","useful":1,"cool":1},"Qg-tyDM_Xdxc_gLuh0rwKg":{"text":"Sunday brunch at revolution is a must in NOLA. Arrived to a beautIful ambiance five star m","useful":0,"cool":0},"EKsEbQPbqcUzS1IRLxrwdg":{"text":"I went for lunch and sat at the bar. The service was great and it's more casual at the bar","useful":0,"cool":0},"KQtXwZbJx0ZR8SHHYwK5BQ":{"text":"This restaurant is open for lunch on weekdays only and let me tell you that it is absolute","useful":3,"cool":0},"RLBkpo65QdLPKbbpYvwKhw":{"text":"Gorgeous ambience and truly outstanding, top notch service. Great for a romantic dinner.\n\n","useful":0,"cool":0},"a8OrMQx937vQ-FR-HD8Q8A":{"text":"I can only say good things about this charming restaurant.\nThe atmosphere is welcoming, th","useful":0,"cool":0},"IRnDxzp0J_7ZLMdI3mhzKA":{"text":"When we walked in we were greeted with \"Welcome to Revolution, enjoy the experience\" and i","useful":0,"cool":0},"HWrHqgEYbvWwjE9HdMzKbA":{"text":"The service, the atmosphere, the food. This is a must-happen meal, no matter what you orde","useful":0,"cool":0},"M7Nsxuc4K13Dj4zBeHcwfA":{"text":"This was hands down the coolest dining experience I had when visiting New Orleans. First o","useful":0,"cool":1},"4PCFQui0GPhbAAcC0Yo52w":{"text":"Very disappointing. The service is spectacular and the restaurant is  nice. But the food? ","useful":1,"cool":0},"NVAI-qqVlEsR6b3pZFzhvQ":{"text":"I would not recommend Revolution. The service was overbearing and indifferent. The starter","useful":0,"cool":0},"3Frhr-Btxhpm10fHrmMqbA":{"text":"What a fabulous find in the French quarter! Service was great as was the food and ambience","useful":1,"cool":0},"unUEeZFICx1ZaJJSVRdn3Q":{"text":"We had the best experience at Restaurant R'evolution. \n\nFirst of all, we stayed at Hotel l","useful":0,"cool":0},"7mUSSRsIsN1Fhu7UkszFDA":{"text":"This restaurant is more a 4 1/2.  Truly wonderful dining experience, from start to finish.","useful":0,"cool":0},"MTpOZLJLsrsFZksPm_hjbA":{"text":"You simply must eat here. If you just have one nice meal planned or you like to eat classy","useful":1,"cool":0},"ey_CDAtw0ERkKxr64WbPIA":{"text":"The gumbo was great but it wasn't \" Death by Gumbo\". The service was sub-par and my entree","useful":0,"cool":0},"j-OywoS-DcVKVY3WfFma7w":{"text":"Despite loving die-hard creole and cajun dishes, this was by far the best meal I've had in","useful":1,"cool":0},"WVthHdQc0GPX-Krei9jRfw":{"text":"My family was originally planning on going to Antoine's, but after reading several disturb","useful":1,"cool":0},"3ud43VZGsP2b56VTqxaSjg":{"text":"Service, entrees, appetizers were all excellent. I have been dreaming about the oyster sal","useful":1,"cool":0},"pre4hV7KTVT7Ey2G3TIr5w":{"text":"This place is where it's at if you're a serious cocktail and food enthusiast finding yours","useful":1,"cool":0},"M7BokGHnFVcxjXHlwleHeA":{"text":"This place will be on my \"must go\" list every time I go to NOLA. What an incredible dining","useful":0,"cool":0},"r4YuuweFhO3dwDoNKpy7sg":{"text":"If you want world class service then this place is for your.\n\nSaw a video about their Deat","useful":0,"cool":0},"UY1fOgiwlodAJacl2Gespg":{"text":"I tend not to give less than 4 stars for my reviews, but I must say that of all the establ","useful":0,"cool":0},"1nRDgv1f1Iy0jhrwTFD8mA":{"text":"Rory was the best!!! Such a devine gentleman! We double dipped during our trip!  Double di","useful":0,"cool":0},"xYCXyZbe3mZj_BgnMXA_-Q":{"text":"Stop what you are doing and make a reservation at Restaurant R'evolution right now.  The b","useful":0,"cool":0},"Ssq7UWM0mVYN301wtnIy9w":{"text":"This was absolutely my favorite NOLA restaurant. We actually stayed at this hotel and were","useful":1,"cool":1},"aawrJpmR6-XqSy7mSgaJAw":{"text":"Service is outstanding. Menu is creative yet classic. Go for the experience.  Go for the D","useful":0,"cool":0},"Auu-jJWM3By22VQiT97nRQ":{"text":"We enjoyed one of our favorite meals in Nola at this place. The service..amazing. Our wait","useful":0,"cool":0},"23S7KTGB_Wq9-DaSNCPK8w":{"text":"Everytime I come to New Orleans, I HAVE to come here. The food, the atmosphere, and the se","useful":0,"cool":1},"TSxFu4JvHWFfSgPf_R30fQ":{"text":"Good food. Service is ok at the bar. Bartenders don't seem too friendly compares to other ","useful":1,"cool":1},"FRHRdFeiVUjOZISmQ_1baA":{"text":"Gumbo - good. Bartenders - not so good.\n\nMy friend and I arrived too early for dinner, so ","useful":1,"cool":1},"FhhkVQ9NLFAwCZPAgaZRcg":{"text":"Reviews do not do it justice. Our waiter Kevin was fabulous. Made my wife and I's dinner s","useful":0,"cool":0},"54ENJynR44TUvnukzqMXiA":{"text":"Came here to eat on Halloween.  Instead of tackling the tricks of Bourbon St we opted for ","useful":2,"cool":0},"XoJaWl0r5a7VFwuBfSZBpw":{"text":"45 minutes before arriving at New Orleans I looked up Yelp - Restaurant R'evolution stood ","useful":7,"cool":3},"bbdagEYigMDk-kEduwpdGw":{"text":"Amazing experience!  I proposed to the most beautiful woman in the world with a movie star","useful":0,"cool":0},"y8cNtL3OlYUviNowWxhJ5Q":{"text":"Expensive for what it is. The gulf shrimp side I ordered was not fresh at all! The shrimp ","useful":0,"cool":0},"EQZb28HkgrHuKomv_1Y3BQ":{"text":"This was our second dinner in New Orleans during our anniversary trip and Yelp def got thi","useful":0,"cool":0},"LWkxdjQMua31a1SrC4twEw":{"text":"The restaurant is very nice, the food out of this world, as a starter we ordered oysters a","useful":0,"cool":0},"nTnTvsHweFm7TICUkGWptw":{"text":"They got us at the crab beignets.\n\nIf you are ever in New Orleans and are looking for a su","useful":0,"cool":0},"ayKIJ6NteSpDODODPmq66A":{"text":"Hands down the best restaurant I dined in during my stay in New Orleans.  Literally EVERYT","useful":3,"cool":0},"gQw85bnY19Nn-VSb3zOkhA":{"text":"New Orleans has many fine restaurants and this is one of them. The problem is Restaurant R","useful":1,"cool":0},"zg-g91vkFaKFyBzAUO4sRw":{"text":"There's something about practiced excellence that takes a great deal of patience and care.","useful":1,"cool":0},"ZGUccn069gPkRDCbCbBFwQ":{"text":"There was something off with the restaurant last night. Given the reviews I expected a res","useful":3,"cool":1},"568sC23pW0WZYXafvhJZDA":{"text":"On my top 10 list of favorite restaurants! \n\nService is amazing! Food is Amazing! decor is","useful":0,"cool":1},"zk5D8PYQ4N14MWJty_j4lg":{"text":"Amazing.\n\nMy wife and I made reservations, and after a rough year for her, did the staff e","useful":0,"cool":0},"71T57-5NedCzu13M7aIHEQ":{"text":"One of the best meals I have ever had. Oysters on the half shell. Bone in fillet mignon. T","useful":0,"cool":0},"a6Hh7sQ7P0o5reeI9WFdmg":{"text":"The service is impeccably classy here but the food was a disappointment. It was the way th","useful":2,"cool":2},"AGwMLwl75xpk7_2kCs2WqQ":{"text":"I think that my wife's comment \"I don't think we have had anything that wasn't \"wow\" tonig","useful":0,"cool":0},"YZkiWEAbJ19B6rqlRdcdsQ":{"text":"OUTSTANDING!!! Our table enjoyed many things from the menu but these were our favorites:  ","useful":1,"cool":0},"MedwKjBOsOt4tLkXnrBg4w":{"text":"If you are planning to have a large party I would NOT recommend Revolution!!!!!! \n\nI have ","useful":1,"cool":0},"meOQhK8Exd9JtARxU4mYFA":{"text":"Fantastic ambiance with charm and romance\nDecent amount of variety on the menu\nAmazing qua","useful":0,"cool":0},"0hltWKLg4UNjdn82Pp-ivg":{"text":"Omg every dish was fabulous!!!   Restaurant Revolution was a place we wanted to eat at whi","useful":0,"cool":0},"Qn48BonvEY8iwsFsCTsjKQ":{"text":"Heard so much about this place that my boyfriend was dying to try it during our last nola ","useful":2,"cool":2},"azirEHOdTMFO84W6YY-haQ":{"text":"Definitely need reservations for this restaurant. Very nice and attentive wait staff. Had ","useful":0,"cool":0},"y9cs_PUcROZKM1YDVqRvUA":{"text":"I have to say, I am a little confused by the reviews for this restaurant. We were in New O","useful":1,"cool":0},"xxpaTyfqDWfD8bhAQhhDSg":{"text":"Simply superb. My best fine dining experience in the Crescent City in 25 years. It starts ","useful":3,"cool":1},"Vn9TDKyNBR0rm8ihjsq9yA":{"text":"This was actually one of our biggest disappointments in a week of amazing dining in NOLA. ","useful":1,"cool":1},"8chNNHkkqifskMo08Kc1cQ":{"text":"I ordered 2 appetizers: their baked oysters r'evolution, and the sweet breads. They were b","useful":1,"cool":1},"PeZTA7KnAvkM1RPykTGYug":{"text":"Great ambiance, very creative dishes.  Nicely balanced cocktails. Desserts are a must.  Bo","useful":0,"cool":0},"IJVI3ejspqYN3Gemd1fAWQ":{"text":"It is hard to describe how wonderful this evening was. Our waiter, Kevin, explained how th","useful":0,"cool":0},"G4qS9OfPgxdfe7UjkeMvBQ":{"text":"Actual rating: 4.75\n\nOne of the best restaurants in NOLA.   Everything was fantastic.  Fan","useful":0,"cool":0},"kCivUX-gjUYXGBQ1Yi7ScQ":{"text":"This was my first experience at Revolution. The staf is well trained, attentive and friend","useful":2,"cool":0},"844VhrbqY-HHKhzrcp2H6A":{"text":"So delicious!! We came for lunch and both got the burger. It was seriously one of the best","useful":0,"cool":0},"Evgff2aA3iThJYyUAvL9Lw":{"text":"Where do I begin?!? This place is FANTASTIC. Wait staff was great and ambiance was spectac","useful":0,"cool":0},"YMhG_y_F5QH_ZX_T-PPUsQ":{"text":"I love upscale restaurants but was disappointed in my choice this evening.   The Waite sta","useful":0,"cool":0},"7prHmz2jk0nR3emXRpeCkA":{"text":"Wow!! The ambiance of this restaurant was so southern , French , Marie Antoinette-y cute. ","useful":1,"cool":1},"nOOQp7f7eYcAtBRxwMxbzQ":{"text":"We were celebrating my mothers 70+ birthday.  She had wanted Commander's and I talked her ","useful":0,"cool":0},"6vEC-cLNommgIblNKGYD8Q":{"text":"The food is definitely a 5 star menu without a doubt.  I have eaten here twice this week. ","useful":0,"cool":0},"rf5lephSz4x_i4Y1NE72lQ":{"text":"Been here on multiple trips and loved ever sip and every bite \n\nThey delivered. \n\nThey kno","useful":0,"cool":0},"ACGsLtvi6GTYvX--UNWc1g":{"text":"One of the best restaurant experiences I have ever had.  The crawfish stuffed red fish was","useful":0,"cool":0},"zHDnPxMTF6OJXe-o0GDFtQ":{"text":"So we made the mistake of coming here on our first night in New Orleans. We had several me","useful":2,"cool":1},"6tbIzVucvi-3quC8jvUzDw":{"text":"We went here on recommendation of some friends that had dined the night before.  We sat up","useful":0,"cool":0},"IzxJTkohgY2KiwwedBpVXw":{"text":"Don't get the beef wellington...\n\nLet me say the service is top shelf. The drinks are grea","useful":0,"cool":0},"_Z_k1ns3ommwrDs65EajLw":{"text":"A fun and different take on New Orleans haute cuisine.  Top notch service, great food, rid","useful":0,"cool":0},"vS4Zl9geU-ASRP9ao46waQ":{"text":"Service was fantastic.  Our server, Zacahary, was delightful and treated my wife and I ver","useful":2,"cool":1},"xoRrcvFE1sNjG5zS4hLCDQ":{"text":"Went to R'evolution last night and was blown away. Our server Scott was warm and helpful. ","useful":0,"cool":0},"kc6khdRBN7AR3KVrc4fJbg":{"text":"Another overdue review. This is the restaurant to go to in New Orleans. My husband and I w","useful":0,"cool":0},"AaBXYcWbpfPEY1owhYhe6Q":{"text":"INCREDIBLE. We have been 4 times now. Each time better than the last! Amazing menu, servic","useful":0,"cool":0},"XZ7qoKIoQrT5LAqKDqS52Q":{"text":"This place is awesome. My wife and I love the food and atmosphere. For the best time defin","useful":0,"cool":0},"W0pRHQ2YbObVju-VL2lV3Q":{"text":"This was my first meal in New Orleans and it definitely did not disappoint!  First off, th","useful":5,"cool":3},"ginpweJSnvZl7EH9BRFVhw":{"text":"Sat in the room with the view of the kitchen, was a lot of fun watching the chefs and wait","useful":0,"cool":0},"IHqUxRL8n1qNOOiO7S7-Gg":{"text":"Someone please take me back! I came with friends during Mardi Gras time for a special dinn","useful":3,"cool":2},"zxfFJ6BBZ0B-uZZCVsvEQw":{"text":"What an outstanding dining experience! I was in town for just one night for work and plann","useful":0,"cool":0},"Yhqy2tiJ_z1_vJwcEpd2JQ":{"text":"I came into town for a conference and my colleague made a reservation here upon recommenda","useful":0,"cool":0},"5CGnN-a-xKwotJKJp6oxyg":{"text":"It'd be hard not to give R'evolution a 5. The restaurant is beautiful and they deliver a g","useful":0,"cool":0},"34a7RBVEGZWxajdjBgMnGw":{"text":"Absolutely fabulous!  Truly exception restaurant.  We started with the \"familia\" board - s","useful":0,"cool":1},"GY0_QduiEo449NZ0DrEXtw":{"text":"I can easily say that was the best meal of my life, to date. We were wowed at every course","useful":2,"cool":1},"oKWjnO6tX14Hik9A56DdOg":{"text":"Yum!  I was so excited to see Kistler Chardonnay on the wine list.  At first, I just wante","useful":0,"cool":0},"hziJIdrJ9e4xUvT5akZ7NQ":{"text":"Wonderful food.  First the beignets with 4 sauces were excellent and delicately fried.  Th","useful":0,"cool":0},"sLLC3oGXkBlC6RHUH6NdVA":{"text":"It's not very often that you can dine at a restaurant and every single thing you put in yo","useful":1,"cool":1},"gO0qS57f4KI9-01YOftwXg":{"text":"Very nice, quiet, and elegant restaurant in the heart of the frenzied chaos of the French ","useful":2,"cool":1},"tHFQxdNkxSSbzZJQVozgvw":{"text":"I was excited to eat here after reading all the reviews, but sadly it didn't love up to th","useful":0,"cool":0},"KJCfEw4ndgOWiYSkJJXkeQ":{"text":"I live in Dallas where mediocre dining is accepted and embraced. Yet when  I visit New Orl","useful":1,"cool":0},"xA8Sb4WqSQ4dK7y59GsQEQ":{"text":"Had very sub par service.  No presentation of their dishes   My steak was cold as well as ","useful":0,"cool":0},"dnPNI5_4EoI48zBD2Ed4oA":{"text":"Wow!  My new all time favorite restaurant.  The service was absolutely top-notch.  The foo","useful":1,"cool":2},"AOTCb_zCkGpIbcil9o-edA":{"text":"This was the best restaurant my wife and I visited in New Orleans this week \n\nService= 10\n","useful":0,"cool":0},"nq5jILvOzvDoEYmkYl5Wvg":{"text":"Hate to be the one.... but in my opinion this place has been highly overrated by other rev","useful":8,"cool":0},"X6mj7O4IiWkLxZ8wOMs5wA":{"text":"Great experience. \n\nOur server, Rory, described our potential choices with enthusiastic de","useful":2,"cool":0},"kHQ8EvlDC70uyDQSRRjGLg":{"text":"A romantic dinner with my hubby. Service was top notch; our servers were very thoughtful a","useful":2,"cool":0},"ulNIfOI0ZJtVgN426cJSsg":{"text":"Super evening feasting on gumbo, salumi board, crab biegnets, wine, cocktails...etc. great","useful":0,"cool":0},"PARJWmtw1-rq75uiPvCTrw":{"text":"excellent food with very nice service just off Bourbon Street, very upscale dining you wil","useful":0,"cool":0},"CjejabgPddzJadc8P_z0GA":{"text":"There's nothing really wrong with R'evolution, but it has no soul. From beginning to end, ","useful":0,"cool":0},"O7DbWHyzkstSMiOQN__mqg":{"text":"Great higher-end restaurant off Bourbon Street.  Extensive wine list and menu selections w","useful":1,"cool":0},"fdto3AlFztK08tLOjgbjmQ":{"text":"I went to this restaurant for my birthday and it was the best dining experience! Our waite","useful":0,"cool":0},"57d0J5PJPV-mjCJwKajC3g":{"text":"Some people do meatless Mondays, and I personally vow to eat at least 6 different animals ","useful":0,"cool":0},"n2XrLHhHDNIfgfrwGXUuwg":{"text":"Excellent restaurant in French quarter, new spin on classic New Orleans food. Great drinks","useful":0,"cool":0},"mzlu9H_R9kcPDdf9LqywHg":{"text":"The food was amazing. Hands down the best steak I've ever had. My only complaint was the r","useful":2,"cool":0},"QXdzcJ2hGrY-sbOz-m2Gug":{"text":"Tried this restaurant for the first time being in NOLA because of the amazing reviews. The","useful":0,"cool":0},"VSKy3BWDkyCKUHJWW5ifLQ":{"text":"The meal was amazing I highly recommend the Tomahawk steak with truffle butter service wit","useful":0,"cool":0},"F4lVFgCzmaci21qLpRATag":{"text":"I would have given this restaurant a full five stars if my experience today would had been","useful":1,"cool":0},"wTEKBexo3ThfEnuA7aFDuw":{"text":"This is quite possibly the best dining experience I've had in New Orleans over the last 6 ","useful":5,"cool":2},"e0agleByIpXRBzsDzfzsFw":{"text":"Ate here the Thursday before Jazzfest. Love that our server team was casual yet skilled. W","useful":0,"cool":0},"Ik6b8sVesB0B66_kw7VW0A":{"text":"I cannot begin to explain our experience at R'evolution. I have been through my share of \"","useful":4,"cool":1},"PNKFGXjAPjX9XVMZ8YgDnw":{"text":"This is one of a few \"nice\" restaurants that I've had the chance to visit in NOLA, and I d","useful":0,"cool":0},"yDLm6fBzThBvlJPLBehxyg":{"text":"Went on a thanksgiving and were disappointed. But a holiday like that is not a fair test. ","useful":0,"cool":0},"go1LfyalD41hYTXE7RBOCw":{"text":"Loved Restaurant R'evolution! The service was excellent and attentive, and the food was de","useful":1,"cool":1},"WsPJr3TgqkAUJzuHSlbswA":{"text":"Very very good.  Service was wonderful, absolutely delicious food and incredible libations","useful":0,"cool":0},"Z7aJgmM1T9gN0n6oBfksCQ":{"text":"Absolutely outstanding. I travel for business regularly and have the chance to eat at wond","useful":0,"cool":0},"JhXVz9Vpx49Ztu1Ybb0afw":{"text":"I can't comment on the food. Our party was ignored by waitstaff for so long  that we left.","useful":0,"cool":0},"x31L18eFhjpEIvhVGL6iSw":{"text":"We had our first anniversary dinner here. The staff made us feel very special. We were sea","useful":0,"cool":0},"-wqWrbtTSWypLGkqLn3yrQ":{"text":"Rrrrressstaurant Revvvolucion! I could barely contain my excitement when we were able to g","useful":14,"cool":9},"cO1xrEvkl8WLQigl_pjYJw":{"text":"Lives up to its reputation. Stellar kitchen puts a neuveau twist on creole standards. Poss","useful":0,"cool":0},"_a7LlC2ZwNCvKwvXyVL0NA":{"text":"On a recent weekend in New Orleans, three of us ate at Restaurant R'evolution.  It's a gre","useful":0,"cool":0},"-gcRRmmE8jkd3MSrpZgydg":{"text":"This was the perfect place to celebrate our anniversary. Beautiful restaurant, great food,","useful":2,"cool":1},"sCUjDwp099qzEOKY1dCLwg":{"text":"We are very stingy with five star reviews but this place earns six. Imaginative menu items","useful":0,"cool":0},"34fmUqWeDPY3rj_ASa4h5g":{"text":"The food here was amazing. The portions were very large and the menu was diverse. We recei","useful":0,"cool":0},"NMyYz-CQoKBobjzdYYWedw":{"text":"with all the hype this restaurant gets, it didn't \"blow me away\" at all.  Service was medi","useful":0,"cool":0},"oxDxgaZN7yhqOyQrvyZjhw":{"text":"Wow. The food here was amazing, very inventive cuisine blending some of the best flavors o","useful":0,"cool":0},"JWgQ-Jpzt1YPK3TYkcE9sg":{"text":"Stayed at the Royal Sonesta so a first night dinner in NOLA was convenient just downstairs","useful":1,"cool":0},"zNPLRDvGV-bmzvtmTHDdJw":{"text":"Even though I saw some not great reviews we tried this place out on NYE...worth every penn","useful":0,"cool":0},"eILBS051mBaCYGQh5L2I3A":{"text":"Awesome food and cute decor. The ribeye was so juicy and tender, just melts in your mouth.","useful":0,"cool":0},"jSbFjYA6l8WeCHok4F9JIA":{"text":"A memorable meal which was made all the more so by Scott, Isaac, and Johnny's impeccable s","useful":0,"cool":0},"jJ9GghgZKWmksJo61_IRnQ":{"text":"Wow wow wow!   This place is a foodie's delight in the French Quarters.  Chief John D Fols","useful":1,"cool":2},"kgIIiD47f9hBaljhsbBjJg":{"text":"W-O-W. \n\nMy fiance and I came here Wednesday night to celebrate our engagement, which happ","useful":1,"cool":0},"voDbcEQwnIJbrGyGHxmc9g":{"text":"We were telling friends about our upcoming trip to New Orleans and they told us that one o","useful":0,"cool":0},"5pDkk6-PSKDdmvFFiaLNmg":{"text":"Suzie Q's Fun Fact:\n\nTurtle soup was U.S. President Taft's favorite food. \n=~=~=~=~=~=~=~=","useful":4,"cool":2},"OM55z8bMeCnMybsUaXFfcQ":{"text":"went there for lunch ate in the dining room was blown away. i felt like i was some fancy h","useful":5,"cool":1},"rSxWPNbhCzAw6iX6Q5JC6A":{"text":"Great service. came in waiting for my date and they were so accommodating- offered me a sh","useful":0,"cool":0},"c11JZEHc6kZpWdxcDnNaKQ":{"text":"Lobster was very \"fishy\" tasting --not fresh. Ambiance and service solid as expected for t","useful":0,"cool":0},"0sSb4pPUsygCndTnFUx37Q":{"text":"Had Dinner with some clients here, I must say everything tasted very good. We had the foll","useful":0,"cool":0},"tCXPCavFBbIZ3A6sfh6n1w":{"text":"It is always consistent, has a very large menu, a great bar for smaller appetites and fant","useful":1,"cool":0},"v9oWyiQ22suNyGrLOYzBRg":{"text":"My Mother and I visited this restaurant because a friend recommended it. It was AMAZING! W","useful":0,"cool":0},"rsoFD-SKWXBOW_PTGboQfg":{"text":"We dined here for Sunday Brunch. \nAs some of the other reviewers stated the crab meat beig","useful":0,"cool":0},"X0E6dFwzs4ZqI1HHFpjscA":{"text":"I was expecting so much based on all the great reviews. Needless to say I was disappointed","useful":1,"cool":0},"-rWliXOxn9lQgqwDgsD35w":{"text":"Superior in every way. Service, food, ambiance.\nThis is a beautiful restaurant. Incredible","useful":0,"cool":0},"sgJZ1gQcXkwPpZ55blwexQ":{"text":"The food and drinks here are very good.  The crab beignets and the sazerac were particular","useful":2,"cool":1},"8azYvYsPSKhEez1xU-Q6cw":{"text":"I had a mediocre experience at this restaurant while I was visiting the city. I took advan","useful":0,"cool":0},"qzJkSlX0j_dHazN2BU3IVg":{"text":"I don't know why I'm giving this place 2 stars other than we didn't actually eat any food ","useful":2,"cool":0},"aTrl8Sj23osX9hq_yIZnuA":{"text":"Best meal I've had in New Orleans. Bartender mixed a special whiskey cocktail based on my ","useful":2,"cool":1},"mF7v1aiR9v38lTpGwu95SQ":{"text":"The food was delicious! Everything was amazing so I felt a bit awkward taking pictures of ","useful":0,"cool":0},"cgoYzh6GKBm7UdsD88a3mA":{"text":"This was our 1st visit to this what is considered to be a top fine dining restaurant in Ne","useful":0,"cool":0},"nBEmAZxFov6V6E9atnkOvg":{"text":"Great meal tonight at restaurant R'evolution! Both the service and food were great, highly","useful":0,"cool":0},"2hu6lXXY_jdn47yKEu6XvA":{"text":"The best restaurant in NOLA.  I hate to write this as I know that I am reducing my chances","useful":7,"cool":1},"2dZasOzjpaNWDeNe0RgvJQ":{"text":"Outstanding food and next-level service. Beautiful setting - on Bourbon Street but set bac","useful":0,"cool":0},"4ohixbY27Z0xq2kjELyUaA":{"text":"Coming to RR is always a great way to finish off the trip to NOLA especially if you happen","useful":0,"cool":0},"VnyMT3jvrRfGxCO3PQNXsg":{"text":"One of my absolute favorite restaurants in NOLA. Fresh ingredients and an astonishing leve","useful":0,"cool":0},"KnILsHjlwp-LMzPf3bLoeA":{"text":"Best Restaurant I visited in New Orleans. Wow. I highly recommend this place to anyone loo","useful":0,"cool":0},"OvE-o7o7PWKpiSLzVdB3dQ":{"text":"Death by Gumbo, to die for the gentlemen at the bar was very nice and helpful, I forgot hi","useful":0,"cool":0},"LlFXFbiUzJYFn5FFiG5rzA":{"text":"On a recent weekend getaway to New Orleans for some dining and some golf, my wife, mother-","useful":0,"cool":0},"FBp4hOEZackEYn7rvINwrw":{"text":"I came for the crab beignet's and they were fantastic!!!!!!!!!  I sat at the bar and had v","useful":1,"cool":0},"LbQ5wBS_7cNQO4VgoVfiEA":{"text":"If I could give 10 stars, I would. I know New Orleans is the place for sea food yadda yadd","useful":1,"cool":0},"JWdU7GqeQOgXGznEqOT-Uw":{"text":"So if you are trying to impress a date, take them to R'evolution.  \n\nMy husband and I had ","useful":6,"cool":5},"0dg3FWNBMpCNdwUlHAx8cQ":{"text":"Let's hold hands and sit in a circle...  Say it with me...  OVER-RATED.\n\nYes indeed.  \n\nSo","useful":6,"cool":2},"AxeER4K3TsSiDDMzRioOSA":{"text":"At $7.2 million, the space is absolutely breathtaking.  Sophisticated yet unpretentious th","useful":14,"cool":9},"4WQ5NekM5z-Ui6vhpj4KUQ":{"text":"Oh my God. That meal was incredible. My wife and I came here on a vacation recommend from ","useful":1,"cool":0},"8k_ber22OTEUEwK8-WhaSQ":{"text":"What a great venue for Sunday Brunch!  Very classy, great food, great server and loved the","useful":0,"cool":0},"qVfYQa4tB7v4vpRV3g6r_g":{"text":"A beautiful experience. It's blend of southern cuisine and gastronomic restaurant. The win","useful":0,"cool":0},"LfEe-0VHrKJcEMKURgryNg":{"text":"ok. much ado for a meal. I do not need a stool for my purse or a jewelry box for dessert. ","useful":2,"cool":0},"IW3ZdZtSu8ZceKpSzTy6iQ":{"text":"My husband and I are hardcore foodies, Michelin Star fanatics, with higher than standard e","useful":2,"cool":3},"eS78KiWWSfAZp_OEu-GNXA":{"text":"Loved this place. It was a hot Sunday afternoon this MDW, and we needed a breather so ende","useful":0,"cool":0},"bdXkZFqp1Qptjei8NNckrg":{"text":"Came here a couple of weeks ago. Found it on Yelp and the reviews made it sound fantastic.","useful":2,"cool":0},"Bcrv3JSuquRhYI3sKY-diw":{"text":"It was our first visit to R'evolution. Our server, Brooke, was very helpful in guiding us ","useful":1,"cool":0},"0X3M8xhmSsRS951-IGtN6w":{"text":"My daughter and I ate here on 12/13/18, on our first night in the French Quarter. We alrea","useful":0,"cool":0},"UbOOef8keW-R7Xc85nVcpg":{"text":"After reading so many great reviews on yelp and elsewhere I had high hopes for Restaurant ","useful":9,"cool":7},"Uwb6BP6ym9y7GpP18v0qwg":{"text":"What a great experience! Beautiful restaurant and impeccable service.  But most importantl","useful":0,"cool":0},"6qqKtEnKBst7RminWaL9cg":{"text":"Fine dining in the deep south!\n\nEveryone we asked talked about this restaurant. It has bee","useful":1,"cool":0},"EFEUfwHWfxMrcfpHHG2AVg":{"text":"Can't say I'm a fan.  Sampled a bunch of different apps and the crab beignets were great. ","useful":0,"cool":0},"pXYBAm_IXQefNFzeJvzgTA":{"text":"I came here during a conference and was able to get drinks on someone else's dime. Drinks ","useful":0,"cool":0},"5FX8OWUNiqU-BqLo7ea0Kw":{"text":"This place was absolutely jaw dropping good food! I had the filet mignon and we had the cr","useful":0,"cool":0},"v0KvOBx9RmLZk1hwJBJflg":{"text":"This was the most disappointing experience I have ever had! We had reservations and had be","useful":0,"cool":0},"udOJ0r5ufZWnzeeqLFU7TQ":{"text":"We were recommended to this restaurant by friends. It was wonderful as the ambience was be","useful":1,"cool":1},"WY6BQGsvKce10-LQ_C2iWw":{"text":"This is Truly a 5 star experience from 5 star service  and atmosphere to impeccable food. ","useful":3,"cool":0},"qZtGCfhXwt3LZvYbu7geXw":{"text":"This is a top 5 restaurant all time for me! Food, service at a level I was hoping for but ","useful":1,"cool":0},"ee6I0Xpe2_r43fRzLgMwmA":{"text":"Only had a few hours in New Orleans and after reading the reviews my fellow Yelpers, decid","useful":3,"cool":0},"-bP8xXgZ7c_iuwqC9p7ePg":{"text":"We had the great pleasure of dining at R'evolution while on vacation in New Orleans. \n\nFro","useful":0,"cool":0},"6xEQN45EFx6HLPromzkBlA":{"text":"It's restaurants like this that make NOLA worth visiting. Such an absolutely awesome place","useful":0,"cool":0},"AoaAjaCtqOY4x4O3D9MOOQ":{"text":"Delicious food, great hospitality and service. We are in the bar, and the food/service wer","useful":0,"cool":0},"sz-Q_xmqLdfT5XgRM3A8TQ":{"text":"We came in late on a Thursday and stayed in the Royal Sonesta above. We were still in airp","useful":0,"cool":0},"4yflZcy02w1Mue69PcSavA":{"text":"R'evolution was one of the best, most decadent, slow-paced, rich food, savor-every-bite-sl","useful":8,"cool":4},"MavTMmyconXhZiBqbg8YMQ":{"text":"Some of the best service I've ever seen. Food was great too, but over a year later it's th","useful":0,"cool":0},"MrdEZrF4PvjxJabcd63HuA":{"text":"I had an enjoyable meal at Restaurant Revolution. While I'd say the food was a 3.5, the se","useful":0,"cool":1},"Ot-GiqtVWP-6uAkISEk1wA":{"text":"If you're looking to splurge and enjoy the nice bottle of wine and this is the place simpl","useful":0,"cool":0},"A3Ae5Ymr3zxFvfXIEr6P6Q":{"text":"Great food and service that is proportional to the pricing. Two people and bill was around","useful":1,"cool":0},"SQv0d8sEkxCWB9hGrU5boQ":{"text":"I'm not sure I've had a better meal - the Manhattan to start was phenomenal, the apps deli","useful":0,"cool":0},"XSVnoggKrvIW0WsFX1LW_Q":{"text":"I don't get it, all of these great ratings and yet...i thought the appetizers I ordered we","useful":1,"cool":0},"YrtyFwuFJToT1wDozHxzug":{"text":"After reading lots of great reviews for Restaurant R'evolution, I chose this restaurant fo","useful":3,"cool":1},"DADTprxTdD8CNQG960r0dA":{"text":"An excellent fine dining experience.\n\nEverything we tried was great. Definitely recommend ","useful":0,"cool":0},"HCybyU_FhkaxfQJ2Fh82IA":{"text":"We went to NOLA for my bday and we had dinner at R'evolution, We can say it was one of our","useful":0,"cool":0},"GPwKirU1pjZK9fFAjC9hSA":{"text":"We made reservations for a Sunday night and were promptly seated in a nice corner booth on","useful":0,"cool":0},"Xd6l6cWAdxRwPwTEcReqvA":{"text":"WHAT A DISAPPOINTMENT.  My fiance and I had two out of town guests and wanted to provide t","useful":1,"cool":0},"IBIW5chEgqn3zQeDYZGh9g":{"text":"With so many great food options in NOLA it might be easy to miss this gem. I highly recomm","useful":0,"cool":0},"sqH1oJZGtJf3rWsmMHqlpQ":{"text":"WOW! This is now one of our top restaurants in New Orleans. Everything was amazing! Brian ","useful":1,"cool":0},"z7NlYjm0JfWMpF5bifYTqg":{"text":"Hey Brennan family, its time to step up your game! If there was a 6 th star, I would have ","useful":6,"cool":5},"T7NoO22Rq3sxK3UdPWswUg":{"text":"Wonderful food, vibrant bar scene, steps from Bourbon Street!","useful":3,"cool":2},"m1UgcJdp0nZUTALXT5f6qQ":{"text":"Amazing dinner - highly recommended! I did the Restaurant Week menu with the crab beignets","useful":1,"cool":0},"f5EmMuIflibtUjTEPMtY7w":{"text":"Overrated. Looks great, great service average food. They spent too much time on decor and ","useful":0,"cool":0},"NhLxAyTzGbAdUg9mqKHAMw":{"text":"Unfortunate disrespectful waitstaff. Food was good but appetite was spoiled. Would not ret","useful":0,"cool":0},"0D7oM0oheu0M3V_obyh4Xw":{"text":"March, 2013\nThe Best Dinner (ok one of the top three) we ever Ate.\nLast week my daughter a","useful":3,"cool":0},"6iX7k-6mbf146tg2JmbAdQ":{"text":"Had the turtle soup and quail. Loved the deviled quail eggs In the soup. I wish I could di","useful":0,"cool":0},"orbtlTa5Es1cJI-LAdF5OQ":{"text":"Tasty, classy, and honestly perfect. Restaurant R'evolution is the first restaurant I went","useful":0,"cool":0},"1cOJ8xsWH7JR-3QbkI1c2w":{"text":"Excellent meal in elegant surroundings. One of the greatest, most sophisticated places we ","useful":0,"cool":0},"-GJmhNImU-8lrGQZjP6edA":{"text":"This place was over the top, both in service and with the food. Taste and presentation com","useful":0,"cool":0},"-naNvYDOagb7WkMqRazMRQ":{"text":"The best meal I have had in New Orleans, which is saying something. We came in right at op","useful":0,"cool":0},"PSuQleF2myAlblsRjhlIPA":{"text":"We came here for dinner with a reservation and it was a very special experience. They real","useful":0,"cool":0},"v-XHXWVC3kVO8SRg2lZQ2Q":{"text":"Brought my wife here to celebrate her birthday. It didn't disappoint and the staff was mag","useful":0,"cool":0},"3z3KFKLo_KFl26J6u9Q8CA":{"text":"We enjoyed our final evening last Saturday the 25th of May, 2019 dining at Restaurant R'ev","useful":1,"cool":1},"K6LPqE5vO0agwpus5dKUAA":{"text":"The food was outstanding, especially the ricotta gnocchi...seriously delicious.  The raw o","useful":0,"cool":0},"6IR6hHnacWxi4ZBrxrgLSw":{"text":"Best dinner in NOLA. We had death by gumbo (best gumbo I've tried), beer-battered crab bei","useful":1,"cool":0},"6aNfGWw6-KqC-SBvaDwTVA":{"text":"We have been several times and our latest was Sunday Brunch with our Son and Daughter in l","useful":1,"cool":0},"gpjmGK6QHfCiwg72mFKSqw":{"text":"A step into a whole different world after fighting off Bourbon street bead-lovers entering","useful":5,"cool":0},"LjnwN7XNvZETqx8eqN2OmA":{"text":"To start we were tardy for our reservation due to the Mardi Gras parade.  We called to dis","useful":0,"cool":0},"kE7VmRj8oKazmzYy0mcHrQ":{"text":"'Yay! I'm a fan.' But no, I don't need to go back. \n\nI don't know if it's just due to the ","useful":1,"cool":1},"FQUi58-vEV4wIvvmGLzGag":{"text":"Vegetarian review: Each time my girls and I travel for our annual vacation, we pick a nigh","useful":0,"cool":0},"T89x-DQDF4uQHVZEkwchGA":{"text":"If I could give 6 stars, I would. By far the very best meal I've ever had in every aspect.","useful":0,"cool":0},"7JWrsXyUHv73luKwMSTK4w":{"text":"The service, atmosphere and mind blowing food are well worth the cost. The veal chop was l","useful":0,"cool":0},"BLqzl9-CoM25LaiP-nsAYA":{"text":"The bone-in filet was definitely a culinary moment with truffle butter. We had Brussel spr","useful":0,"cool":0},"mea2iadbaaPF6P78-Ig21g":{"text":"My mom and I finished up our weeklong trip with dinner here.  Definitely on the pricey sid","useful":0,"cool":0},"wIa0bbWz0X2GTNIlGYetPw":{"text":"The food was incredible, which was expected. But the service was above and beyond! The pre","useful":0,"cool":0},"Ye6hsmjOMJzB5cRBCOeO7g":{"text":"I made a reservation here for my friend's bachelorette party. We had a group of 12 girls; ","useful":6,"cool":1},"ppYZrBqZcppCOIgciaKMxQ":{"text":"Restaurant R'evolution exceeded my expectations. As a culinary professional, I was proud t","useful":0,"cool":0},"_48hoYonJHcOWTG8gOW2rA":{"text":"Amazing experience!! We had 8:30 reservations on a Saturday night and so we had to wait ab","useful":0,"cool":0},"hO4Irv474kYMUdWXUlN9YQ":{"text":"Terrible. Came here for Thanksgiving, beyond disappointed. Wouldn't send my worst enemy he","useful":0,"cool":0},"_DHWAJzH1lkQErihUEAjcQ":{"text":"I was underwhelmed. The service was great but the food was average.  The portions were sma","useful":0,"cool":0},"LkCNcIqk38442tSLFlBVyg":{"text":"Fine dining and good times. Had a reservation for this spot conveniently located on our ho","useful":0,"cool":0},"Jw1BtTHEvpcbq-xQ_XswxQ":{"text":"Had a sunday jazz brunch here ... so good. Great drinks, great appetizers, great brunch! H","useful":0,"cool":0},"M2vr63wvvnkUFFoqBIY8_g":{"text":"The restaurant itself is a beautiful oasis in the middle of evening chaos in New Orleans. ","useful":0,"cool":0},"n-CNGqODSBI03YVv8Y_T0A":{"text":"The food was fantastic.  As good as described by other reviewers.  The problem was the ser","useful":0,"cool":0},"ieQpkt7obMkyECC58tuAeQ":{"text":"Oh boy was this place a fantastic delight. We had the chef table with our own room includi","useful":0,"cool":0},"3m0tdXdHLHWUoMEeuxYIzQ":{"text":"Very good. Rabbit angolotti was fantastic.  Quail gumbo great starter.  Service was on poi","useful":0,"cool":0},"D1eOvoDT5dU8L6xrNqTsHg":{"text":"I was in New Orleans for Memorial Day weekend, I wanted to try all sorts of restaurant esp","useful":0,"cool":0},"xmTmOU84PrY04FGd61CtzQ":{"text":"This place is classy and a little upscale. A couple of dining places, open kitchen, charmi","useful":0,"cool":0},"t8ZbDQbaluPkj-VbRU0LUw":{"text":"Our best meal was at this restaurant . Everything from start to finish was A+. We even got","useful":1,"cool":0},"zje1K444NSCZ4180M_qdJw":{"text":"We had brunch here and loved it! This a beautiful place in the French Quarter! I had the d","useful":0,"cool":0},"K_AI56HoXyHc8gA6FHRsSQ":{"text":"This is probably one of the best restaurants I've ever been to and ate. It's elegant with ","useful":0,"cool":0},"lvY6s5dJPdpzQUbykMyIIQ":{"text":"Stop right here. This is not just eating, or just dining. This is an extraordinary experie","useful":0,"cool":0},"s9K1alu7SWOW1oMuBfSLFA":{"text":"From Houston and have been checking out different restaurants/happy hours. Already same da","useful":0,"cool":0},"9xFLW8zkrBTa0200evlq7g":{"text":"Food - great.\n\nWine list - outstanding.\n\nDecor - top notch.\n\nBut seriously, would you guys","useful":4,"cool":0},"C5RmdP2y2SX33bngsBEzNA":{"text":"The food was good but the service was impeccable! We had our kids on this trip and Travis,","useful":0,"cool":0},"45FIKCWe9wttI9TdjrEYZQ":{"text":"This is a charming jewel that should not me missed if you ever get the opportunity to visi","useful":0,"cool":0},"8JBkS52ShGI9oMtOqq1Kkw":{"text":"This is the best food and service in New Orleans in my view. Everything is perfect and ele","useful":0,"cool":0},"a28djufJuJ5SkWXEJrBI3g":{"text":"This place is a bit of a splurge but well worth it! Came for jazz brunch, which is a very ","useful":1,"cool":1},"_z9Qg_lZQUprhrtMXC3khQ":{"text":"The actual 25th Anniversary dinner: Thanks to my loving and truly amazing wife ( and the k","useful":0,"cool":0},"Yg9hNV05nJQ-QgFNH3bGzw":{"text":"Had dinner with my wife there tonight. Alex, Rory, and Ashley took great care of us. Alex ","useful":0,"cool":0},"Q7o21keKlrYQdBW8CnyS4Q":{"text":"A little touristy, so the ambience is off, but the food was fantastic. Get the lavender gn","useful":0,"cool":0},"FYkbAXAL1m4jpF1UIwBPAw":{"text":"Excellent Anniversary dinner. We started with seafood gumbo and turtle soup. It was delici","useful":0,"cool":0},"N883ujwfOd12U7IxQffw8g":{"text":"One of the best date nights ever. The atmosphere is great and the service was spectacular.","useful":1,"cool":1},"HUGWTWgZz5gDMV8sRVRYyg":{"text":"You certainly pay for what you get. My friend ordered the five course menu, everything was","useful":0,"cool":0},"ndQoNzVi9kbJe3PB1ThTVQ":{"text":"The restaurant was full and they had no reservations the rest of the night so we sat at th","useful":3,"cool":2},"ng1ofIAYAldl25_jAccQWw":{"text":"The food here was delicious. We ordered the seafood gumbo and crab beignets to share. I al","useful":1,"cool":0},"6PM9x9rli0j3dp200E9mXA":{"text":"Everyone enjoyed their meal. There wasn't one aspect of our dining experience that we coul","useful":1,"cool":0},"t8I2CpOIM1kI_QObT7jGHg":{"text":"This was our first visit to RR and based on the service, quality of food and the atmospher","useful":0,"cool":0},"hVMRbE8nWLVpsnSLFLvaZg":{"text":"This place is a gastric experience! You are treated royally from the time you arrive!\nMany","useful":1,"cool":0},"b_OQyjhCEDQuqb-jS3GMwg":{"text":"Relatively good food and service.  Considering that we had much better oysters at fraction","useful":1,"cool":0},"QERLbBzy_M5MOsWG8ZWEuQ":{"text":"After eating over at Commander's Palace we thought everything on our stop from there would","useful":1,"cool":0},"BAKqU69uL6BrKBWJ61EGlw":{"text":"Had a wonderful anniversary dinner at Revolution while on vacation!  Our service team (Tra","useful":2,"cool":0},"kYS_7JB1IVk8ZFIDaZafJg":{"text":"Went here for brunch on Fathers Day , Not very crowded , I got the feeling that most of th","useful":1,"cool":0},"SpNeFr6Gx0Y6TGSvJVmMTg":{"text":"Food was fantastic. Wine list was very good and reasonable. Service left something to be d","useful":0,"cool":0},"4qbwcuAZDodndvCFEZfpbQ":{"text":"After dining here 6-7 times over the past few years this restaurant has gone from being my","useful":0,"cool":0},"5AfgLbYXCgaNCCgwNDSo-Q":{"text":"Had to review this restaurant as husband and I went for his birthday and had the BEST meal","useful":0,"cool":0},"q7hps2jXGBo87GODSdu60w":{"text":"We just had an amazing dining experience for my parents' 50th wedding anniversary! We star","useful":1,"cool":0},"Hned_xYadotNQqlZK_It5w":{"text":"Excellent customer service, amazing food, beautiful ambience, Overall exceptional experien","useful":0,"cool":0},"RN-Pt0uYoXNMiJ2iT_BGxg":{"text":"Delicious, unique food and wonderful service. Everything we tried was special and deliciou","useful":0,"cool":1},"VFybaS-8zw0gV4YgBsrtgA":{"text":"This place is all that, and a bag of chips!  Tramonto and Folse have teamed up to bring Ne","useful":1,"cool":0},"s6GWrXGMIwHOkO5h71IjLQ":{"text":"Terrible. Second time at the restaurant  and the place lost any luster it might have had. ","useful":1,"cool":0},"RtBr5AsKxHW1eKbZLO8hxQ":{"text":"VIVA LA R'EVOLUTION!! We decided to make last-minute resies the day before coming to New O","useful":3,"cool":1},"mxW-YhpSt8HaXbElUzDvWQ":{"text":"I have been here several times and would\nGive a 5 star. They had an off night. It wasn't g","useful":0,"cool":0},"64JV3oCuzdevESuyc-XC3Q":{"text":"Great service and food that is delicious and inventive with a solid Cajun foundation. \n\nTh","useful":3,"cool":2},"ws6H7FHZuFUx7LkpGT9AEg":{"text":"Just arrived today 3/15/20 in New Orleans and stayed at a very nice Hotel The Royal Sonest","useful":0,"cool":0},"ha7SXJIhj4QaUV9q9m3EXQ":{"text":"This is a good restaurant. Good food and service. I ordered Lobster Gnocchi. It's on the r","useful":0,"cool":0},"k0RsfW9iTXI-XQdcavxhYQ":{"text":"We went there with 2 friends on Saturday, September 30.  The meal was excellent as was the","useful":0,"cool":0},"7R5dX24iocCD7jmR0_oWUA":{"text":"If there were more stars, they'd deserve it. From the minute you step into this restaurant","useful":0,"cool":0},"tL2Yji4gpKCdZh3crZYDoQ":{"text":"Delish!  Beautiful and romantic atmosphere had a wonderful dinner and our waitress was awe","useful":3,"cool":1},"ckiN5sd2DLE95JIxqNwggQ":{"text":"A hit and miss restaurant for certain.  So the question is why?  Let's start with the visu","useful":0,"cool":0},"DLYi1b7nG-W-F8Z5kxoPPA":{"text":"Fantastic dinner- was in town for business so sat at the bar. Great vibe. Got the beet sal","useful":0,"cool":0},"F_8e1oPsHMRQGoOYQ6vsMA":{"text":"Im an avid traveler and research my hotels, restaurants, sights and service companies.  Th","useful":4,"cool":1},"KJXHNh7nexdHpDe3gufRMw":{"text":"My wife booked us in for our first anniversary dinner at Restaurant R'evolution on a Frida","useful":0,"cool":0},"hG-soyIu_ofS_Ui4-yN_-g":{"text":"I just want to start off and say we were so excited about our reservations. I am obsessed ","useful":3,"cool":0},"gw5eF7IEjWMiA_ZjbJEBfQ":{"text":"We are on vacation and decided to dine here today. It is literally opposite the Hotel Maza","useful":1,"cool":0},"7Ay029V_lDF52lgaGW2S2w":{"text":"Had a wonderful dinner at Restaurant R'evolution on our latest visit to New Orleans. Celeb","useful":0,"cool":1},"ASZaoWaQLLWwZWX1Fbk1Og":{"text":"I would highly recommend this restaurant. The staff was beyond amazing. While in NO, this ","useful":1,"cool":0},"P5QrUdC4HhHpPtpYPDqkQQ":{"text":"After many amazing meals in New Orleans, Restaurant R'evolution was supposed to be the hig","useful":6,"cool":3},"dL511uiccuuxyflRpkQAmQ":{"text":"I absolutely loved this restaurant. I took my wife there for our anniversary dinner and it","useful":0,"cool":1},"Lc37aqGmVwMCPdggmWGrOg":{"text":"I live out of town and have dined here twice... it's my favorite dining experience of all ","useful":1,"cool":0},"X_XusTLhblHsu-t7Uih8yg":{"text":"A high-end 5-star restaurant at a 4-star restaurant's price point. I am in disbelief at th","useful":1,"cool":1},"hyAjr74kNTojYZvpnjxlnA":{"text":"One of the best places to eat in the French quarter. I had the filet and my wife had the s","useful":0,"cool":0},"CyX3IXbeOspH0RMbHIqbFA":{"text":"The service was outstanding.\nThe Cobia was cooked perfect. \nLobster Gnocchi was best dish ","useful":0,"cool":1},"oHudeNYl_rXzzFQVkNIJ_w":{"text":"Incredible ambiance at this elegant restaurant bar with vintage pre-prohibition vibe! Star","useful":3,"cool":2},"E5-AbuqwbgI1Gz3wr_vL4w":{"text":"Our concierge called them to make a reservation and they assured that they have accommodat","useful":1,"cool":0},"PqZuA3giLrKbht29IUdnzw":{"text":"Very nice place. We are at the (very cool))bar  and had amazing food and service. Worth th","useful":2,"cool":1},"KzjQlFT4g1CKN2nsL7hq9Q":{"text":"After a long day of $1.50 martinis (geez, this city  is amazing because happy hour starts ","useful":1,"cool":1},"Pzp8GF2sa0sodIi1WmAMEA":{"text":"Amazing service and honestly the food was just about up there as well can't wait to visit ","useful":0,"cool":0},"oHfMdOFuzN6tenzwOqN5PQ":{"text":"Only sat at the bar and had cocktails but bar staff were very friendly. The atmosphere is ","useful":0,"cool":1},"lZQ51nD-9sGqyuSlP-_wsw":{"text":"Such a wonderful dining experience!!  First, you should know that this is a classy restaur","useful":0,"cool":0},"wxdbZnX314XsHHD28MDgIg":{"text":"I didn't enjoy our dinner here, in fact it was our worst meal during most recent NOLA trip","useful":1,"cool":1},"dsCtR7Zg4yKrCnY0dGhzug":{"text":"From beginning to end it was amazing! Great service exceeded only by the food. Great place","useful":0,"cool":0},"BSrW04i3xxbo0ogcMYF3uw":{"text":"Best restaurant in New Orleans! Went here for my wedding dinner and I couldn't be happier!","useful":0,"cool":0},"PSULW0WoCqYkYdcBJReM2Q":{"text":"How does brunch get any better than this? Truffle mashed potatoes as a side to beautiful B","useful":2,"cool":0},"h43-9dbQv8-rwtN6idI28Q":{"text":"I've diner with my husband and with a large group.  We've enjoyed time spent hanging out a","useful":0,"cool":0},"5B-7F4xC-LlHWD6vR4Pbpw":{"text":"If you can only afford to dine at one upscale Restaurant while in New Orleans, it is my hu","useful":2,"cool":0},"oewj1Yy7-O7TLuuZQtH1AQ":{"text":"I was so looking forward to trying Revolution.  The wait staff of two at lunch time was in","useful":0,"cool":0},"pWPQHCvgma9S9xdmW_ooFA":{"text":"We went to R evolution on Friday March 21 st for my birthday.The food was good but the ser","useful":0,"cool":0},"tOvG5uU2FGNgaO_cuSXUeg":{"text":"The place was too loud and we me and my girlfriend were seated at a huge table, which we d","useful":0,"cool":1},"9fk37a-X7osB0Yfh-IFonQ":{"text":"Cannot say enough great things about this place! I recently visited Restaurant R'evolution","useful":2,"cool":4},"qk0Co3ai9F8Hld5V58t_xg":{"text":"So I am mad at myself for having a little too much sazerac before coming here.  While I kn","useful":3,"cool":0},"dETMWsFPl2FGzOUjyycRbQ":{"text":"Some dishes were crazy good, others were eh. Its a fancy place for sure but you can still ","useful":0,"cool":0},"00cTmOcPXzYbDOJuM-PTqw":{"text":"I have to agree with the other reviewers this may be the best restaurant in Nola right now","useful":4,"cool":3},"2VjBRpCUHxFTE8XtTZNipg":{"text":"Let me just cut to the chase. If you're a foodie or you enjoy fine dining in New York or C","useful":0,"cool":0},"6V3Atlns2UWUZOawSjc-tw":{"text":"Price is irrelevant, food was extremely underwhelming.  Everything lacked seasoning very b","useful":3,"cool":0},"rX86OCX8kF9LAkegjzVtfA":{"text":"Stars are on the food only.  The service was a 5.  Extremely disappointed in the food.  Gi","useful":0,"cool":0},"gV36zOnSZfyRN_1JoUqTvw":{"text":"Yes, the food was very good, and the service almost too attentive. But here's what I am le","useful":0,"cool":0},"8gBVwcEClcyUbE7l6rBeRQ":{"text":"I was really excited about the restaurant and the great reviews and was not disappointed.T","useful":0,"cool":0},"9gdD1QrTyKIm474Wshe2Uw":{"text":"I chose this restaurant because I was told it would be on par with one-star Michelin resta","useful":0,"cool":0},"bIUBhOiy4SvH4LlfNKW1dA":{"text":"The food here is amazing to say the least. The waiters cater to everyone's needs. We got t","useful":0,"cool":0},"2YvIzLc8zCTQQ6tgbwpnUA":{"text":"When I first came to this restaurant 5 years ago, we were seated next to Mario Batali. A l","useful":0,"cool":0},"wfdXV3am5WX8qKzgCDgaHA":{"text":"I really wish I didn't have to write this review, but this is my honest opinion and my exp","useful":2,"cool":2},"vkOeuyDj2Znpaf9IP9l60A":{"text":"Another yum!!!!  Best gumbo we've ever had! So smoky and delicious!! I had the triple tail","useful":0,"cool":0},"bNMPkPPNV5ZO2DNzArr8aA":{"text":"Amazing service and food!!! The staff was extremely friendly and passionate about the food","useful":0,"cool":0},"Mllx1eY5y8XhdPd8EKWGuA":{"text":"Food was excellent, wait staff not so much. Our waitress was very condescending when I ask","useful":0,"cool":0},"ORKVj_6LF5YcN_i2HTaa6Q":{"text":"Love the food! Ambiance was awesome! Hope we have one in the Bay Area! Will return again n","useful":0,"cool":0},"F7XsD2FnVYumuHfZKVwgxQ":{"text":"Expensive and inconsistent services, two haunting characteristics that robbed R'evolution ","useful":5,"cool":2},"8OZ9awreLhYMmdSUBmY7Ag":{"text":"If I was only given one sentence, I'd say that the menu is entirely too long, the service ","useful":13,"cool":5},"gjKi4A_haogL2WiHHF4XHQ":{"text":"This place is our favorite spot in town! We can always count on wonderful service, epic fo","useful":0,"cool":0},"th0GrbpuwMPVHvEHB4JBoQ":{"text":"Very upscale.  Very expensive.  Very much worth it.  The crab beignets, dirty eggs, meat p","useful":0,"cool":0},"iFz0itBetDAgCKO736GAEA":{"text":"My partner and I spent four days in NOLA recently, eating out for every meal, and this was","useful":5,"cool":1},"WwylUhe-aT68mj7IoDqWjQ":{"text":"We only ordered their appetizers. Did not order any dinner. We ordered the CREOLE LOUISIAN","useful":1,"cool":0},"_jlBJ6DxlawVH_qxE-H6kg":{"text":"Superb birthday dinner!!! \n Because of Hurricane Zeta, my significant other was unable to ","useful":1,"cool":1},"u76ZCcEUtcbSa-M4hKzb5A":{"text":"Ate in the the bar area, late (9pm) night dining, made reservations, didn't need them for ","useful":0,"cool":0},"KQcOYFb2XSZoY6kIiPyGMw":{"text":"Fantastic brunch before my flight back to normality.\nThe 'Death by Gumbo ' was one of the ","useful":0,"cool":0},"2HMzYJIDwLmhliBqteJj0g":{"text":"I will never understand any of these reviews. This food is unbelievably pretentious and ca","useful":2,"cool":0},"RCfAIdIAFfxSBgYLjPsbAA":{"text":"This is a beautiful restaurant. The food was above average and over priced. The waiters an","useful":0,"cool":0},"0ogZfZvS-bqL9nfkKXbyUA":{"text":"Excellent food , good service .\nSure to try it. We tried the scallops , iron porterhouse, ","useful":0,"cool":0},"Fy2ivnaTNgQKxKTYz16INQ":{"text":"Not an exaggeration to state that everything I had here was spectacular. Even the focaccia","useful":0,"cool":0},"iK3yVXMWp2yIXkbCLYA8og":{"text":"I have spend one/two week(s) a month in NOLA over the past couple of years and had the ple","useful":0,"cool":0},"5EFSL0edf8zqTdOPRX98WQ":{"text":"Staying at the Royal Sonesta it was an easy choice to come to this establishment. I looked","useful":1,"cool":0},"QtnYrnKTpaOtYhgW04OGlQ":{"text":"After a day of drinking and eating our way through New Orleans, the only disappointment he","useful":6,"cool":1},"bqPhRaUqthJZOGgvW8Kgeg":{"text":"I had such a great experience visiting this New Orleans resturant ! The servers Issac & Ka","useful":0,"cool":0},"KbKH_UfdKYPk1OX7FvpZyw":{"text":"Let me start by stating that this happened on Christmas Day.  I had made reservations mont","useful":1,"cool":0},"R7VfVIYf49x0wgZbMf2_jw":{"text":"Absolutely AMAZING Service!! \n\nIf you want to be impressed this is the place to go! Collin","useful":0,"cool":0},"bFsdAKr2DRjDOtpYm4dt1A":{"text":"Every single dish we had was absolutely amazing along with delicious drinks! As far as fin","useful":0,"cool":0},"83e_JvDS5Oxp2OahpStdWQ":{"text":"The best meal I've had in a long time. I wish I could give it more stars honestly. The ser","useful":3,"cool":1},"7woWPbuwc5v3xd3AlOCFqw":{"text":"It's impossible to rate these guys lower than five stars, they deserve a sixth! Located of","useful":2,"cool":0},"HM8rfr-PmoSozM3XGVGtYA":{"text":"The relatively new classic in NOLA.  We can't not go back!  Good, service and ambience at ","useful":0,"cool":0},"HgcCdooAjA19XvzQmmbrig":{"text":"This was the best restaurant I have enjoyed in Louisiana to date.  We are at the bar so we","useful":0,"cool":0},"WM56ycPfr7X0rkJqrs1f_Q":{"text":"This is an awesome restaurant. The service is superb. The night I was there,  Brian, a man","useful":1,"cool":0},"o8KUuWm_Av40igyy_AXdsQ":{"text":"First time trying and was absolutely blown away by the service, and food!! Isaac & Daniel ","useful":0,"cool":0},"qO0UNJ2DHuNgmJavX132Cg":{"text":"You know when people go on and on about a great book or movie, even a restaurant and then ","useful":0,"cool":1},"53wXL3kM2Z1Pn6MUr5lJpQ":{"text":"I traveled alone for my first day and night in New Orleans so I booked a nice dinner to tr","useful":0,"cool":0},"QVvExpzpQVB-0OySpCeGug":{"text":"Came here for dinner with the husband. There is a nice size bar at the front of the restau","useful":0,"cool":0},"YvJU7W57j1F-7jANT5PewA":{"text":"The food is hands down the best I've had in New Orleans. Beer battered crab beignets? Yes ","useful":3,"cool":1},"mq5y_xudm8g8-g4n2BlNSg":{"text":"What an amazing experience.  I consider myself a \"Foodie\". I love every aspect of a qualit","useful":1,"cool":1},"Wj68XOxT11WrRgbjv7GtIg":{"text":"Amazing food and amazing service. Our waiter Daniel made our experience that much better. ","useful":0,"cool":0},"stwBgV9BVqRMKjeyRH6PqQ":{"text":"We had an excellent meal paired with excellent service for my nephew's 21st birthday! The ","useful":0,"cool":0},"NkhTKzqE28vcXMOBf2lP9A":{"text":"Best restaurant in New Orleans. Hands down. The menu was unbeatable. \n\nThe dress code is o","useful":3,"cool":1},"QEvh1ngFugG7qVYDrRh9dw":{"text":"My husband and I stopped into this restaurant while we were in town this past New Years fo","useful":0,"cool":0},"7G3C6XI8P2O6l78u8xy5Yg":{"text":"My husband and I,just celebrated our 10 year anniversary at REVOLUTION restaurant and it w","useful":0,"cool":0},"-jExXNVeQ1n4pOn0SlISAg":{"text":"This is one of the very best restaurants in all of NOLA.  All of the food is wonderful, th","useful":0,"cool":0},"MWKVj8PpjrjvKqhixqZvSg":{"text":"The service was exceptional, the presentation of the food was beautiful and the taste was ","useful":0,"cool":0},"o09UABGCf6OfUUV5Z62b3w":{"text":"FABULOUS from beginning to the end!  We were fortunate enough to have lunch at R'evolution","useful":0,"cool":0},"ZESCDZsuULVUU9JL1bOctQ":{"text":"Had our annual outing to R'evolution, always on or around our anniversary. We are on our 5","useful":0,"cool":0},"PLv0kuS36teLVsvpJO5d-g":{"text":"Wonderful place! The food was exquisite. We had the swordfish as an entree and the creme b","useful":0,"cool":0},"k2KwuyZMTjNuLhPk8v_TKw":{"text":"I was taken here by surprise for my Birthday dinner and this was an amazing experience to ","useful":0,"cool":1},"5s7iaKh4P1aWraVJFK2W_Q":{"text":"I came here for a solo dinner on a Saturday night without a reso and the host was kind eno","useful":1,"cool":1},"Xs5XZ5wKhrYW3GPq9P_Uag":{"text":"Amazing! Did the Tasting Menu -- highly recommend. Exceptional service with three members ","useful":0,"cool":0},"WMbED2_F2MH36m_bXu_PTg":{"text":"Hands down amazing experience at this place. Me and my little brother had the 4 course din","useful":0,"cool":1},"CQMHUycdrQ-0frimgfcwOw":{"text":"When I asked for recommendations for a quick New Orleans trip back in August, R'evolution ","useful":4,"cool":1},"jPM0ZdL6MyFz6WM9BKB6dA":{"text":"Amazing dining experience, so great that we came back here for dinner a second time. We we","useful":0,"cool":1},"HPOXdeTdNJXcTnbTjo2iwA":{"text":"I can't believe I haven't reviewed this place yet.  Every time it is amazing experience in","useful":0,"cool":0},"-9rluZNRfrwguOQTn772gQ":{"text":"We got a last minute reservation for dinner for two. We were seated at the chef's table. O","useful":0,"cool":0},"Ks0M8OX1d84CipNpjr1bXQ":{"text":"They definitely go the extra mile to make your visit special from the amuse bouche to the ","useful":0,"cool":0},"kHRCSjUmiOZBV9AmZjWTvQ":{"text":"Always a wonderful experience at Restaurant R'evolution. \n\nKevin took care of us. He was f","useful":1,"cool":1},"qfCZREFuE05QmrNNL2_FNQ":{"text":"I honestly cannot believe I am writing this review. I even slept a night to hopefully let ","useful":3,"cool":0},"ERDTcGMvUexo3bcGGOXnDA":{"text":"This is definitely upscale dining and the prices surely reflect that. I went here with a p","useful":0,"cool":0},"4t-ss0PO3RYUcC-A30m90Q":{"text":"The restaurant was my dinner treat in NOLA and indeed it is a restaurant for a special occ","useful":11,"cool":7},"gvxxM9LXSurQWk7xOBHrjg":{"text":"We came here after having eaten ay Commander's the night before and were pretty underwhelm","useful":3,"cool":0},"nU2NGz3CTVLYcwDHqnVHVA":{"text":"One of our bridesmaids have booked a private room here so we can have a bacherlotte's brun","useful":2,"cool":1},"iosRJMqLranPc7DJPo7XDg":{"text":"Fire Roasted Oysters with Bienville butter/ best part of the entire meal!!!! The cocktail,","useful":0,"cool":0},"DurBgUOddRIpKYxA0AAN-Q":{"text":"For my anniversary this year I was lucky enough to be brought here by my significant other","useful":2,"cool":1},"87oN3MvPYH3q3GMlZh_kvA":{"text":"I made a reservation here on Christmas Eve night. I arrived on time for my reservation and","useful":1,"cool":1},"3wg-XugyRxANy-QmYTEnKA":{"text":"Classy and comfortable spot in the middle of the French Quarter. Came here for a Sunday br","useful":1,"cool":0},"qUjjrXxpSwQk85pt8V2Fkg":{"text":"Came here for the jazz brunch and ordered a variety of things. Service was good and attent","useful":1,"cool":1},"KyBRYUFrpA98dd5kJDPZ-w":{"text":"The food itself ranges from good to great, but the service and ambience just made the meal","useful":5,"cool":0},"_j3k233Q1WWZBI1RINJk_Q":{"text":"Very disappointing experience, given we had such big expectations from this place. I got t","useful":0,"cool":0},"TP_dGemiaxenbDPVivyYbQ":{"text":"We had the charcuterie plate for 4 and smoked bone marrow to start. The marrow was good, b","useful":1,"cool":0},"yhgVRhdYp-5rG-5RMU1OMQ":{"text":"This has been our best meal in NOLA so far. Everything was perfect. The restaurant is beau","useful":2,"cool":0},"zGxTspwgrFd03UTyep9vgA":{"text":"Really amazing birthday dinner experience! We had reserved one of their private rooms & fr","useful":3,"cool":1},"B5JNWf1YZrX4MqOj8vScxQ":{"text":"By far the best restaurant in New Orleans among those I have tried. The service is incredi","useful":2,"cool":1},"Ut-oSDe2CfNEnFlbTteRfQ":{"text":"I debated writing this review because the food we had was good. However, the service was s","useful":2,"cool":1},"jtnQf0L7egdskVUvggtxQg":{"text":"I called in to inquire about a large reservation and the rude man who answered didn't even","useful":0,"cool":0},"wUA723ppGMGLj_2L5FdnQA":{"text":"Sublime. Even as Mardi Gras madness raged all around!\n\nGorgeous room, excellent service, a","useful":0,"cool":0},"a9OFqMbAbdTw3xUIz5HvvA":{"text":"Death by Gumbo: Roasted Quail, Andouille, Oysters, Filé Rice - 9/10\nOysters on the Half Sh","useful":0,"cool":0},"TagVUOuw-awidfmaqFXQiQ":{"text":"The atmosphere and scenery alone was enough for us to fall in love - we received the best ","useful":1,"cool":0},"AQWNv5-FL3b2SZGSNnL8zA":{"text":"Received a gift card from a friend. She said this is her and her husband favorite restaura","useful":2,"cool":0},"z7rvJG-OD6j95MWYmcreeg":{"text":"This review is for the bar area only. Some friends and I popped in after brunching earlier","useful":1,"cool":0},"8QvpJRzTRCs2AgWz9ecpxQ":{"text":"This was one of the best meals that I've had in New Orleans.  The death by Gumbo is incred","useful":1,"cool":0},"47Bnj9RqeDcpLnCehXTycA":{"text":"came with a reservation on memorial day weekend with 6 people, and ordered \n\ndeath by gumb","useful":5,"cool":2},"1MmHjbnUMCj-gAxT2dxgqw":{"text":"Spent 4 days in NOLA last week, made R'evolution a BIG priority and my Girlfriend and I we","useful":0,"cool":0},"ygPeMQh3S0eeyhhImmtouA":{"text":"Let me start by saying I would give it a 3.5 stars.\n\nThis restaurant definitely disappoint","useful":2,"cool":0},"9dV0ChPq3-Y0l0YWn6DoQg":{"text":"Where do you start to review Restaurant Revolution? I guess in the bar... right where we s","useful":1,"cool":1},"wug_NBOKiC3jVEqGDSaLEQ":{"text":"Start with the service : top notch  5 star worthy\n\nNow the food :\n\nThe bone marrow appetiz","useful":1,"cool":1},"2u4yEEndrt3BMDqGz1DRTQ":{"text":"Ambiance 10, really cool place....service 8, servers were nice but the service was kinda s","useful":0,"cool":0},"EQv5KuX7ArY0WSzGdRNV1Q":{"text":"Happy Hour: 4:30p - 6:30pm\nCocktails & wines are all $7 during HH\nBeers are $5\nBites range","useful":3,"cool":1},"-Jm2RIvcar5jpPhjRgKK1g":{"text":"We had a fun couples trip planned and made the reservation over a month ago for our group ","useful":2,"cool":0},"8SuT7Lv86yuG0ANIj0ufdA":{"text":"Delicious food, excellent service, great selection! I highly recommend this place. Top not","useful":0,"cool":0},"WPVQV4kCaHLkpgZH0q4kOA":{"text":"The best restaurants I visited this trip. Very pricey, can't compare to the other restaura","useful":3,"cool":3},"OjZr_r9lJfSz1c3zKck8WQ":{"text":"Was excited to see this restaurant in the hotel we stayed at recently.  I wasn't able to g","useful":0,"cool":0},"VB-LBBJCohYjOCQ-DMHn9w":{"text":"i felt elegant and classy eating here, more than anything I really enjoyed my dine in expe","useful":0,"cool":1},"X_0u1JcYLn63gnP4pESzbw":{"text":"Anniversary Dinner was perfect! \nThe food was an adventure!\nThe service was above and beyo","useful":0,"cool":0},"6Urf9ISbxJMYzPi_AQSPwQ":{"text":"This is the best restaurant that I have been to in a long time.  We ate at Delmonico earli","useful":0,"cool":0},"9J0hmIOFCEt3jeV4wAuxew":{"text":"We had our first anniversary dinner here. The staff made us feel very special. We were sea","useful":6,"cool":0},"k1Wwm45zdOQCwlS93qRb9g":{"text":"We came to Restaurant R'evolution to celebrate after our wedding and had an amazing experi","useful":20,"cool":18},"Binv_GE6IY0FGnvv_NtvDQ":{"text":"Great service, great food, and a downtown New Orleans vibe. Highly recommend!\n\nSmack down ","useful":0,"cool":0},"q_eYtLO0srvlJiEfT1AOPg":{"text":"THE PENULTIMATE 99TH OF MY SUMMER 100 & WHAT I LEARNED FROM IT.\nTomorrow at lunch I'll com","useful":14,"cool":4},"50Uh091gyniUV6fSHT2trw":{"text":"Tina and Da Shaun made our first and only night in New Orleans so special. Their attention","useful":0,"cool":0},"a71HO5chmd740oYhAjA5nw":{"text":"Oh my goodness! Definitely will be back here on our next trip here! In town for Clemson an","useful":0,"cool":0},"szo8Z-gd0kPAGdKl7t6p2w":{"text":"My wife and I visited last week and had a wonderful experience.  The service and food were","useful":0,"cool":0},"JodsWRO2jRdkmEUeE3N2WA":{"text":"I throughly enjoyed dinner that night. \nThe alcohol list was extensive-- I got bourbon  to","useful":0,"cool":0},"JAmlnVEqBRuXzm_DMxEtvQ":{"text":"Incredible.I went for my birthday and every dish was better than the one before. Customer ","useful":0,"cool":0},"_JaUz6AuVBWx6qi76MaR6A":{"text":"We were trying to find a place for happy hour after class and we ran across this restauran","useful":1,"cool":1},"uqDB_s3oFrsEdSJ5sv9KJA":{"text":"We ate here for Thanksgiving lunch and were truly spoiled by the service and food.\nI can't","useful":1,"cool":0},"V1iPZo_7ZSFeTKQjYtlHcQ":{"text":"Stunning. This was one of the best meals I have ever had and definitely the best in New Or","useful":0,"cool":0},"fosCttxVekZK0pcTR43Fyw":{"text":"Good restaurant that definitely brings a unique flavor. The group all loved their meals bu","useful":1,"cool":1},"tLxz9pNmrMkd6pr7d_1Yug":{"text":"Amazing, amazing and delicious food. I love it. I would definitely go there again. The ser","useful":0,"cool":0},"oTsaVj9OZKmGyqGuNTC9Uw":{"text":"Recommend getting the redfish! My sister who's not keen on fish loves it! The skin was per","useful":0,"cool":0},"Ui9sI8n77KifrcaiN0gsYQ":{"text":"This is maybe a 4.5/5 in terms of veggie availability but I'll round up :) The waiter/chef","useful":1,"cool":1},"_TksF_dji7J16TL5NCYgVQ":{"text":"For my 300th review and R'evolution's 1000th review, let's make it count!\n\nI always love e","useful":4,"cool":3},"fA36Efbqfr0M7OPL-kQnlw":{"text":"The pictures don't do it justice! But if you want a swanky dining experience in New Orlean","useful":3,"cool":2},"uWusvmodmGBsUy78qiPJNQ":{"text":"Fantastic service and food. As soon as our wine or water was close to being low the waiter","useful":0,"cool":0},"7X3gK6QrAHzGpQdK1hQM1g":{"text":"Awesome experience.  I just arrived at the Royal Sonesta & it was too late to make a reser","useful":1,"cool":1},"zVTyDTtQTxMIhAn1WuGXUw":{"text":"12/13/18\n\nThis was our first visit to the Restaurant R'evolution on our first night in New","useful":1,"cool":1},"FDtzDZYYWzbt5hjursEUtg":{"text":"Food was amazing but small portions and pricey. Service was impeccable atmosphere was plea","useful":0,"cool":0},"jzVNcVzFia69cpOC-f-vrg":{"text":"Okay, I think this place tries too hard. I had death by gumbo, unusual take on traditional","useful":0,"cool":0},"qun6dwEMHJx3Oeta94Vk4A":{"text":"Filet was less than an inch tall and overcooked. I'd been looking forward to this place fo","useful":0,"cool":0},"azEYyVUetnUEBLtDW0RZmw":{"text":"For my birthday my boyfriend chose this restaurant to for our big dinner. My boyfriend doe","useful":2,"cool":0},"rbq3MifhYhyXquKAQFNzIg":{"text":"I have never had a dining experience like this one! And to put it into perspective, I'm a ","useful":6,"cool":4},"rudcdcW060vdanwARrMh5A":{"text":"One of the reasons my husband and I regularly visit NOLA is to eat- there's no food scene ","useful":12,"cool":13},"6bXOcEa2pWbfRnCmglvuBw":{"text":"Best dining experience we had our whole trip in NOLA","useful":0,"cool":0},"Igjs7TRPLKkhKAPPE28Zbg":{"text":"$20 COOLINARY LUNCH IS AN ANNUAL MUST-DO\nBut there's a blatant reason I won't be back unti","useful":17,"cool":8},"zmm9Faq3dPcyd8y7-PzsJQ":{"text":"That was a big disappointment. The food was below par, the service was good, perhaps a bit","useful":0,"cool":0},"PrvPHaZPu2Lr-taVMKfFRA":{"text":"The best service I've had at a restaurant ever! Made our trip. The 2 gentlemen that were s","useful":1,"cool":0},"uqj1lBfkL8RVQrHhLt1zHQ":{"text":"My first experience here and it was a good one the staff is fantastic they truly treat you","useful":0,"cool":0},"Lm2SKeJujlcGYadx1EFOfQ":{"text":"Another dinner spot in NOLA that is worth coming back too. Service and dinner was good, bu","useful":1,"cool":0},"IBvnnnZ6ge8gOOsQ1Mj8hg":{"text":"Amazing food and service! Absolutely loved Death by Gumbo, Lobster Gnocchi and the Striped","useful":1,"cool":3},"yaZzHkGul6pr7z89b6m6sg":{"text":"This was definitely a very nice restaurant from the excellent service to the nicely appoin","useful":10,"cool":9},"jJlo9bR4D9O8Gz_MnnNbBA":{"text":"Enjoyed a really nice birthday dinner with friends. A well kept secret, Restaurant R'evolu","useful":0,"cool":0},"wpkHcSMaj02aAtjjxTBdRw":{"text":"This restaurant gets 5-stars for the service and ambiance alone.  Our server, Kevin, was o","useful":2,"cool":1},"og1F3qmR8aWOX1UzaYKlpQ":{"text":"A very classy and trendy spot. Run by chefs from Chicago, excellent service and atmosphere","useful":1,"cool":0},"oqYMPxkuGqYFUMoaJpitCA":{"text":"Everything about our visit was superb! Hostess was pleasant, friendly and quickly seated u","useful":0,"cool":0},"1Oh7MovMtGZ5WHES7t1T0g":{"text":"The food was amazing.    Five stars.   The atmosphere was very good.   Also worthy of five","useful":1,"cool":1},"Wh9DY5LcWqMQPgvzXH8yog":{"text":"The experience here was fantastic. Great service and phenomenal food.  The wine and liquor","useful":0,"cool":0},"IVgSdkpGLYYO3E-Sv4_iqw":{"text":"A SAMPLE OF THE R'EVOLUTION WINE LIST:\n\n$21,000 Chateau Mouton Rothschild Cabernet 1972\n$1","useful":14,"cool":5},"sBbdn86enYl1fy52--kpLg":{"text":"Ambience:5 Food:5 Service:5 Value:5 Return:5\n\nBeautiful is this restaurant! Romantic and c","useful":9,"cool":5},"XP7p74GwSEpNdbQi34MRIQ":{"text":"Sensational place.  Try to get one of the less noisy tables.  Have been there two times an","useful":0,"cool":0},"hGslbFVrvIV1gZHj-K0_yQ":{"text":"This type of restaurant you learn to savior each morsel and just visit for very, very spec","useful":8,"cool":5},"uy4kMVSmOs7BkHZxVxm1XQ":{"text":"I have had two wonderful meals here and will return for more.  \n\nAs other reviews have sta","useful":2,"cool":1},"uax8Fyh2fowSA29gGeeLRQ":{"text":"We just spent a week staying near the French Quarter and this was the most memorable meal ","useful":1,"cool":0},"uFYZKJx7dyWOrduVkPecGQ":{"text":"Probably the premier special event destination in Nola at the moment.  If you're taking so","useful":1,"cool":0},"i66JxKfUmSF2fi6bm6aqtQ":{"text":"\"Let food be thy medicine and medicine be thy food.\" ― Hippocrates\n\n997th person to review","useful":42,"cool":39},"lMTj649mqcnvXifkMymyAA":{"text":"We went the other night to celebrate my birthday.  Blown away by the experience.  Fantasti","useful":1,"cool":0},"LBS9EocIX7EvNMZy0mdQ7w":{"text":"I was expecting to be another 5 star review for this place, which is why I selected it for","useful":1,"cool":0},"J85OYfRMTU7te5owx9i-yg":{"text":"We travel to New Orleans multiple times a year and have been to all the \"must try\" restaur","useful":0,"cool":0},"t3XL-tO1JRpeUtWR2eD3rw":{"text":"Service was excellent.  Portions were small.  Grilled oysters must have been cooked for le","useful":0,"cool":0},"UlvmBbACELdJWoy8HeP6zA":{"text":"Fabulous experience from start to finish! Came here for my birthday dinner and everything ","useful":1,"cool":0},"hF26kwYHQ2-qB94gI0xzyw":{"text":"My husband and I ate dinner at Restaurant R'evolution in the French Quarter last Saturday ","useful":1,"cool":1},"GbpkVzrB4JaNbIRIVE9p4w":{"text":"The service, decor and details down to the electronic menus were fantastic! \n\nMy party of ","useful":0,"cool":0},"lHpqwfa8mpMUHLmbZitMOQ":{"text":"This is not a place I would normally choose. But I won't get back to New Orleans anytime s","useful":1,"cool":0},"J8Ry5u89ehj5t5zKRXXJzw":{"text":"This place has some of the best high end food around New Orleans. I highly recommend makin","useful":0,"cool":0},"m8HlGPU3JprmGnnqz1AkaQ":{"text":"Restaurant R'evolution has superior service.  Shout out to my three waitresses (Jay, Sierr","useful":0,"cool":1},"BIC2YkQ8EEsFiLWgbJhLPQ":{"text":"While staying in Hyatt in French Quarter,  it was a hard  decision to make where to eat. T","useful":1,"cool":1},"9ISUIfU31oh8vtOj-nqg6A":{"text":"This is hands down one of the best culinary experiences I've had in my life.  Restaurant R","useful":2,"cool":2},"QUdd4hSDhIbgkVmxYeGtEw":{"text":"Decidedly the best restaurant in New Orleans. My bestie and I are foodies and you can bet ","useful":8,"cool":7},"9wUs--vBZ6WDJOgo5PUqoA":{"text":"The most exciting thing to happen to the New Orleans Restraunt  scene in my lifetime. I am","useful":6,"cool":2},"xWWRAkwBwIdrCDUsUIhNvg":{"text":"My boyfriend and I came to Restaurant R'evolution to have dinner at the bar during our las","useful":3,"cool":2},"PCvzdJm8-TfXUaC8emuGCQ":{"text":"This place is excellent! Went here for my birthday with friends and family. Wonderful wait","useful":0,"cool":0},"LbTqyFD3C7xjVihTz11GUw":{"text":"The food and service is phenomenal. You can not go wrong with your choice. \nFood- crab bei","useful":1,"cool":0},"TN38Th2D-uvw_LYu0ccsEg":{"text":"You guys. From the food to the service/wait staff, everything was incredible. The amuse-bo","useful":0,"cool":0},"o3C2bnhYkDiGxFisJZLEVw":{"text":"I had so much hope for this place and chose it for the first dinner in NOLA but the food w","useful":0,"cool":0},"UXtPDmzv6RES0pTS-5rybA":{"text":"The atmosphere here is REVOLUTIONARY. Now that I've got that out of my system, let me expl","useful":0,"cool":2},"yfFDBozpWlSgvaqgKcywLA":{"text":"We start out being introduced to Da'Shawn and Tina with quite a bit of energy and a great ","useful":0,"cool":0},"NY4IqJBgeZfBLy2arPq3Fw":{"text":"This was a truly special meal, made better by great friends, food and facilitated by a fir","useful":2,"cool":1},"AdSrk3nvL2JSD8Fh2d3wAg":{"text":"This was a great option for us as we were staying in the Royal Sonesta and arriving on a S","useful":1,"cool":0},"JeMCrim8fkV891SK9Iqoyw":{"text":"The food food was terrific. I ordered crawfish guitar string pasta and my husband ordered ","useful":0,"cool":0},"1rJnNC5S8mzx9-oTa9hUcw":{"text":"Nope, I didn't really see why you should.  It's a tremendous space.  The decor is terrific","useful":3,"cool":1},"QXMCb5f1tI38Zl0wupR4lA":{"text":"place is very nice! Beautiful inside. Service was fabulous! Husband had espresso crusted v","useful":0,"cool":1},"J_NQ2PKjPglFA1IwYpRg2Q":{"text":"The experience we had at this restaurant was extraordinary. I am so glad we chose this for","useful":0,"cool":0},"4FluBpc0v1TMswesK-upcg":{"text":"Dined here a week and a half ago. The beef tartare, scallops, and lamb were great! Service","useful":0,"cool":0},"Ig9mCQbnZVtXonbBySKg_A":{"text":"We walked in and sat by the bar. It is first come first serve for the bar area, and we wer","useful":0,"cool":0},"7yI85rG12DflxWQqPfrynw":{"text":"Stopped in here for a late night dinner while on our Mommy daughter trip. \n\nWe were really","useful":3,"cool":1},"b6CFc1aq3RUW07lT-TvoRQ":{"text":"Went for birthday dinner and although we had reservations has to wait in bar for about hal","useful":0,"cool":0},"iVbdaEqMf-_JeR8FM7xtXw":{"text":"You can't go home again\n\nOn our last visit to New Orleans, this was far and away our favor","useful":0,"cool":0},"N0Ozu1hSbviNcLMpNxk9qw":{"text":"Best dinner in some time... \nOutstanding food and service. Every little detail was well th","useful":0,"cool":1},"b-ZGWVzp9W5Da8GAvNgO7Q":{"text":"Delicious all around and veg friendly!! I came here for dinner with a party of 5 they were","useful":1,"cool":0},"-Hjll7f-iqS0cY6NO0a1Cw":{"text":"I had an exceptional experience here! I am here for a long weekend and decided to visit on","useful":0,"cool":0},"0hCsRT3dC-gDhug0CoQ9UQ":{"text":"I would give it zero but I had no choice. Service was beyond HORRIBLE, over priced with me","useful":0,"cool":0},"mr1Nx_p8qkbl3270VDHesw":{"text":"Went here for my birthday and it was amazing! The service was really great and they were s","useful":0,"cool":0},"NXUkaoGGTAd2wOIpG7vICA":{"text":"Best meal ever! Super service! Super food! Well worth the time and cost.\n\nI entertained my","useful":2,"cool":1},"OkWvWtfM82hqkE8v10puTQ":{"text":"We did the chefs table that we win at an auction. AMAZING!!!  Highly recommend. The decor ","useful":0,"cool":0},"cjJ3qUbgGG2HX-pIxh-YjQ":{"text":"AMAZING experience! Professional people with amazing service. Yes it's pricy and it should","useful":0,"cool":1},"mku7Afb-mCFiBCQYk3LZZw":{"text":"Omg the whipped pecan butter - I could eat that all day (not just straight up). The crab b","useful":1,"cool":0},"fcsUdGavYfTe1NzzNfaQ5Q":{"text":"Best restaurant I went to in New Orleans--thank goodness my friend who is from there recom","useful":1,"cool":0},"4ewbSP31LF5defBxzyp_-Q":{"text":"I've eaten at Restaurant R'evolution 3 times and each time found the food, service, and ov","useful":3,"cool":1},"puS9VssJL9OZOg6pwYQVQA":{"text":"I realize I'm the odd one out, but Restaurant R'evolution sort of feels like a tourist tra","useful":2,"cool":0},"dcBmO4TxbsAdGMN79LTreA":{"text":"Excellent staff and absolutely incredible food. If you're looking to fine dine with a uniq","useful":0,"cool":0},"ra4aruIPMkVg8OLbUPni3g":{"text":"RR has quickly become my favorite classy Nola celebratory restaurant! The service was impe","useful":1,"cool":1},"OjGnDW1DU_MkDgK04TEVow":{"text":"There are no words to appropriately and fully describe what a great restaurant this is. Th","useful":0,"cool":0},"USy8aSaC-4F4MJQ9AJ0FSA":{"text":"Wow amazing food and service ! Had the death by gumbo! They split in for us !  We ordered ","useful":0,"cool":1},"R69DyswAGPBL1v1szIM6HQ":{"text":"Over the top!\n    Modern twist. Sophisticated New Orleans\n     We are always delightfully ","useful":0,"cool":0},"HByp0q4shAlU-SC3rQQ-tg":{"text":"I really really enjoyed my experience at Restaurant R'evolution. I absolutely loved the be","useful":0,"cool":0},"-vj2V5KGMqdvyv81EDiI5w":{"text":"The food and bartenders were excellent. We didn't have reservation so got to sit at the ba","useful":0,"cool":0},"c3GMhIT0zjiZt3lTgCMj0A":{"text":"If I could give this place 6 Stars, I would!  My wife and I ate here for the first time th","useful":2,"cool":0},"Z3BZTagJqxDT9TXviDSuYg":{"text":"I chose Restaurant R'evolution to celebrate my recent private nuptials with a few family a","useful":0,"cool":0},"EMiJI5axCx2EhDjezNcwEw":{"text":"I'll begin with the positives, first thank you for allowing us to have our birthday cake t","useful":0,"cool":0},"1TdOcg8t_ViHUSP_1VQ3Jg":{"text":"We sat and ate at the bar since we didn't make reservations. Our bartender was great. Frie","useful":0,"cool":0},"bdiuumYp1eyD0rSupR5JPw":{"text":"Went here on Christmas Day.  3:30pm seating.  We brought our own champagne and wine and fo","useful":2,"cool":0},"sJ2PHH7nqUyE03sFxEYprg":{"text":"Service: 2 stars. Really terrible and unmatched with the food provided. Not a busy time in","useful":4,"cool":1},"iHYZlRVk0g0j87lV1sIK_g":{"text":"The private room was amazing with the absolute best service from Rory and Travis! The food","useful":0,"cool":0},"XioddKyYy-Lui1Hh3FXi0w":{"text":"Amazing! Once in a lifetime experience. We splurged for the tasting menu with wine pairing","useful":0,"cool":0},"qv7dcShF78sOYPN1UZNIFw":{"text":"Great tasting menu as well as individual dishes. Food is so tasty and fresh. Atmosphere is","useful":0,"cool":1},"v2h0KJKw6mPJYl1vQxCHSg":{"text":"I hadn't dined here in three or four years.  My wife and I were in town for the weekend so","useful":0,"cool":0},"kYPk9mtQ1N0_ofbSsq3Kuw":{"text":"Enjoyable dining experience while visiting New Orleans. The focaccia was baked perfectly, ","useful":2,"cool":1},"7wz4N1lB1Y_Z90ziyeKdMw":{"text":"Wonderful. Ambiance, service, presentation and quality! \nExcellent service with southern h","useful":0,"cool":0},"_Rp0RHxHrlmPRKmrsihWiA":{"text":"Decent experience. Worst ambience to be is bar but I was solo. Oh well. Service was slowis","useful":1,"cool":1},"qfEApPBnDZGIzZiZdymYMw":{"text":"Good service, good atmosphere, good presentation and generous portion for the food, but th","useful":0,"cool":0},"ZoExNWYbJVunAhusEWD6WQ":{"text":"Wow. Eating at Restaurant R'evolution is an experience. It'll put a hole in your wallet bu","useful":2,"cool":2},"PBp0dd9Kvoc-0DZP5tcLqA":{"text":"Having had this place on my list for over a year and finally getting a chance to go, i mus","useful":1,"cool":0},"MJJUVi8YNyfRWQIUn4p1Gg":{"text":"The food was great as usual.  However, I am taking away one star this time because the ser","useful":1,"cool":0},"iTfl4qh1eB_CZyH3mqug1w":{"text":"This always happens: we over order. Our eyes are bigger than our stomachs. This never happ","useful":0,"cool":0},"RhehW0eQMbR9s1KEsxKKhA":{"text":"We had a wonderful experience here. Kevin and Peter were amazing waiters. I'm so glad we p","useful":0,"cool":0},"vy6B9JACZceLxCcaFEWJ6Q":{"text":"My favorite restaurant in New Orleans!! The most amazing food! The best service! Great ste","useful":1,"cool":0},"maJ-3H__2FcUeYBt64oc0A":{"text":"Thursday night was first time back in almost two years because of bad staff, only had chee","useful":0,"cool":0},"HazEPedweVjzF4cQ9v3Olw":{"text":"So disappointing. Food was mediocre and service was awful. Waited 30 minutes while they ' ","useful":0,"cool":0},"7Mcgzg7onHqUucix-eFHeA":{"text":"Stopped by for an amazing meal!! This is one spot that you won't feel stuffy but is a more","useful":7,"cool":8},"tlhQl0zb9nhRYX5RbWdlvg":{"text":"It's not often that a restaurant can manage to get it right in all spectrums across the bo","useful":9,"cool":2},"DLzLvos7y4GF9pFyPD5W0Q":{"text":"Really, everything about the entire dining experience was five-star quality, except for th","useful":3,"cool":0},"cE7bajtshDmHlrSY_NSiew":{"text":"I will be talking about this meal with EVERYONE as I tell the tales of our 10th Anniversar","useful":0,"cool":1},"UJrJPqginlytWZJIhIE2Ww":{"text":"Lovely warm ambiance, outstanding servics, and absolutely amazing food! Food was rich and ","useful":0,"cool":0},"Lo2u1A01YoYQkQFnxffiTQ":{"text":"Not that impressed. Death by gumbo was okay, it did not have the depth of flavor I was hop","useful":1,"cool":0},"-mGddM-hzqYaA7ydrzxEnA":{"text":"I don't like duck, I love risotto.  R'evolution made the best duck risotto I've ever had i","useful":0,"cool":1},"cM29N94v_FsbfcSSsFVmBg":{"text":"None of our food lasted very long, but I managed to snag one photo of my entree, which was","useful":2,"cool":0},"L3YqmA-CvS8ZL9ZP3U5bkw":{"text":"This review is embarrassingly belated, as I was in NOLA at the end of April for my sister'","useful":2,"cool":0}}