{"-2pMsf47JIkf-CN_emniEQ":{"text":"A grocery store with a bar inside!?!! Only in Nola. Very friendly and helpful staff, lots ","useful":2,"cool":0},"vHUilXzX2c5VFb2OcS_V6w":{"text":"We took a red eye into New Orleans from California, and after a much needed nap at our Air","useful":0,"cool":0},"FLSSYNFaw-dBeL7WI594Sg":{"text":"Wonderful place to grab lunch! Fresh buffet style New Orleans soul food! The chef is wonde","useful":0,"cool":0},"Be_WXkv1BtJNmLPt5NVcrg":{"text":"This place has been open since April.  It's a terrific market! The bar has been my main ex","useful":0,"cool":0},"-fayA33H5qE-Ctn4BlNUdA":{"text":"From time to time I stop in the neighborhood market. I participate in the oyster bar the l","useful":0,"cool":0},"BBKte7PnCeee9aBLF5iVOg":{"text":"I went here today for lunch with the 2 owners of the company I work for.  It was great par","useful":1,"cool":1},"dFhgOMd7K0FVqzPkubBC9A":{"text":"3/5 it needs to decide\n\ni wish this place would decide what it is. bar? grocery? affordabl","useful":7,"cool":3},"Hm7d8gSLk-BGYimkGMcOuA":{"text":"Warning: I don't care what your views on gentrification are! \n\nHaving worked on the redeve","useful":6,"cool":2},"k-Ocb9LpaljJPygxHzD84w":{"text":"This project has been SLOW.  After years of planning and buildout and financing & ownershi","useful":11,"cool":4},"5877bbquqoDSAG40I_3aEA":{"text":"BLUF:  HUGE place for minimal grocery shopping, get a drink, get some food.  Seems fun.\n\nW","useful":2,"cool":1},"tp_64CG3UkO-2STrwpGvMw":{"text":"I didn't really understand the purpose of this business, even having been in. It's a food ","useful":1,"cool":0},"pk5gmRuUarWYexWR4N4ASQ":{"text":"This was my first time there, this place makes a great first impression. Clean and friendl","useful":0,"cool":0},"hy2wXocGv61RQS3CPFISzw":{"text":"This was my first time here, and I have to say this place is the definition of southern ho","useful":0,"cool":0},"x02KC1wiTiVjSobTI8DwXg":{"text":"Liked this spot, came in looking for fresh greens.  Unfortunately they didn't have any but","useful":0,"cool":0},"HKFVj6MTkZ1ESM9aptKdYw":{"text":"Selection is limited, but the pricing on particular items are above competitive, and I wil","useful":0,"cool":0},"5Q6tZGc7by8Kc-WnplWdew":{"text":"Love this place. Got a beer at the bar, fresh steaks, veggies and some brownies for dinner","useful":0,"cool":0},"Fdwh5eWpu40ULA2jnTvi4A":{"text":"I love my neighborhood market! It's great to walk the dog over while I shop inside. Yes, s","useful":4,"cool":3},"AT5J-CSCjhzlzrise3LX2Q":{"text":"I was in the neighborhood, so I decided to pop my head in here and see what it was all abo","useful":11,"cool":7},"Ih_7LW3r1QpLi7r0buYb8g":{"text":"I'd characterize this as basically an improved version of the prepared foods section of Wh","useful":0,"cool":0},"qcJ3GKm85MFmAwo6pJwaBw":{"text":"Sunday buffet was delicious and the food was fresh and well stocked.  The fresh lemonade w","useful":0,"cool":0},"kAvJkC2f7CcIyWkDLm1aAw":{"text":"I kind of expected more. Heard about this place and that their hot food was great, etc.\nFi","useful":0,"cool":0},"WDIa9wF8vEH8rc2qCEvngQ":{"text":"Super cute Market next to our AIRBNB. Lots of choices and the cashier was very nice and ev","useful":1,"cool":0},"oGPSLXaGscTwEVTnqfgRaA":{"text":"Interesting concept. The market is inside a school; entrance and parking is on the back. I","useful":0,"cool":0},"m3YPFrMX12SGOkkxrCevPw":{"text":"My favorite lunch spot. Thursday BBQ is awesome as well as the bread puddings they make. I","useful":0,"cool":0},"i_Yc4a2u5c2tOkEIBwdqbg":{"text":"A new venture for me in the city. First time here at this fresh market and I must say I wa","useful":4,"cool":1},"2zqsdeiMqwXi7zK4MJw0sQ":{"text":"Dryades Public Market has it all. It's much different than St. Roch Market however has a v","useful":1,"cool":0},"DTkphORf-FnaVSYaLi-T7Q":{"text":"Bar Guy \"Kevin\" took excellent care of me when I needed some TLC! After a tiring day of wr","useful":0,"cool":0},"oQsdN5xhtdDOciPz7L1o4w":{"text":"I can't believe I haven't heard more about this place before I went!  I went during happy ","useful":1,"cool":1},"TqwEExhkECms8QLvsEmSNw":{"text":"nice bar + good selection of cheese and baked goods = I wouldn't grocery shop here but its","useful":1,"cool":1},"YO5iS9-145LXNSUon_wejQ":{"text":"The Public Market is a beautiful and convenient place to grab a hot meal, pick up some fre","useful":3,"cool":2},"QH3KzH05s0atQUqEroE9Tw":{"text":"This has got to be the cutest community neighborhood market that I have seen to date.  As ","useful":3,"cool":3},"ouX1S55vDiRAE_4WxbFTww":{"text":"I like this place. The hot bar is amazing. Chef Allison is the truth! Great food and varie","useful":1,"cool":0},"chQSd8as6zbDYWn8NvFl5w":{"text":"This place is a shit hole!!!!!!!!!!!!!!!!!!\nWho treats there employees with such disregard","useful":0,"cool":0},"uYRA4NcGNcLurd4mjox9wA":{"text":"I think this was started with the intent of being an affordable food option, so if you're ","useful":0,"cool":0},"gddY9aBbRc5IllM9HqfTEA":{"text":"One Name... Chef Allison !  He does a great job here in the food. Now his krewe as well th","useful":6,"cool":2},"UpYk5nZtGKg5bbLV0MqYKA":{"text":"A charming, well stocked (for its size) local market. Very helpful staff.  We didn't try t","useful":0,"cool":0},"73RSPxpAx1STT1sQn9nA1A":{"text":"Dank and dusty. Produce was okay but I felt like i had to triple wash everything. Not the ","useful":0,"cool":0},"qgY-TexuEUasgnwj-OOOXw":{"text":"I was passing thru and stumbled on this market. The cashier was very friendly. It's like a","useful":1,"cool":1},"10fUkNx67yniMRknHPO4Eg":{"text":"Although I understand people's frustrations with the slow opening of this market, what the","useful":5,"cool":4},"W0dZ0GFGuPinqO29x8GBOA":{"text":"Stopped in because I know they have a hot lunch bar that changes daily. \n\nToday they had b","useful":5,"cool":0},"FBikx5GV4O-IBodWpm_qRg":{"text":"SAFETY & LIMITED PRODUCT ARE WHY I WON'T RETURN\n1. Compared to the mega Rouses located 4 b","useful":7,"cool":2},"IOcRcwMK27PU6O93pW-j7w":{"text":"When my mothers friend said that he was going to take us to a market for lunch I was intri","useful":3,"cool":1},"rO-nJ4PecUxl2VU0z-8HvQ":{"text":"Perfect pre goat yoga stop. I've had this place on my list forever now. I figured I would ","useful":1,"cool":0},"xmmnEEaU3nTNRzp6t5IMmw":{"text":"I've been looking to try Dryades public market for a while now. I finally found a reason t","useful":2,"cool":1}}