{"1no90g50zKUOqlOFvoMGrQ":{"text":"Delicious coffee and great service! I could smell the beans to determine my choice, got a ","useful":1,"cool":0},"mnjpzhaU5WHy_BSItrRJfQ":{"text":"The first thing that you notice is the yummy coffee aroma. It was so inviting. I ordered a","useful":0,"cool":0},"K6WvkXkhqMMqXysyi-XC4Q":{"text":"A place that makes their own chai tea and not the horrible powder stuff? AMAZING! \n\nCute l","useful":3,"cool":3},"yjP3oLkY8cmZ2fJtGrYF-Q":{"text":"Recently moved to New Orleans and had to explore the local coffee scene. Spitfire quickly ","useful":1,"cool":1},"dPwepe5GvTXXVHdQxz-fvg":{"text":"PANTHER COFFEE outside Florida. 'nuff said.","useful":2,"cool":3},"VMPsxiXMD2m1Bq2-MKQAag":{"text":"Best cold brew + almond milk I've ever had! Workers, especially barista, were so sweet. I ","useful":0,"cool":0},"s6-6pgpMP6Hk4xrdwozaOQ":{"text":"Living in Seattle I get great espresso on every corner and spitfire would fit right in. Th","useful":0,"cool":0},"-jFaCa3JxP-iecKmMHhbUQ":{"text":"Let it be known, there is basically no seating here. Don't accidentally plan a trip here t","useful":0,"cool":0},"W7nevM7I9uCN9o-PbN508w":{"text":"One of the best coffee I've had. The service is excellent. Kevin, the barista that day kno","useful":0,"cool":0},"BlPDVXNBzhxRMiYmIP02kg":{"text":"I'm slavishly grateful that this place is open.  I stay directly across the street in an a","useful":1,"cool":0},"8HrEaD62nFoM6zb9mtD5eA":{"text":"Hand-pulled shots!!!  Wonderfully friendly staff and smooth and delicious craft espresso d","useful":0,"cool":0},"V888WFuNDemly8uLzDviLg":{"text":"In NOLA on business this week and walked by Spitfire Espresso Bar (627 St. Peter Street) t","useful":0,"cool":0},"KvF-4Y_5ycwAPhRwDzRTzg":{"text":"A wonderful hole in the wall espresso bar for the coffee lover on the go. Fantastic drink ","useful":0,"cool":0},"VUIuv-YS2Yja-UMSLAU_DA":{"text":"Fail! Ordered a single origin prepared with a Hario cone and the result was a cup of hot w","useful":1,"cool":0},"0Dp7RdYgSlfVDlFwSs-O0Q":{"text":"Small coffee shop, but all of our drinks were delicious.  I had the iced honey latte after","useful":0,"cool":0},"PZH-RnLjSa1hgBUk76OxOg":{"text":"Best latte I have ever had!  Super friendly and all about the coffee.  Excellent!","useful":0,"cool":0},"2dswBbdzcx3fVElrrJKpQA":{"text":"If you are looking for excellent coffee in the French Quarter, look no further than Spitfi","useful":0,"cool":0},"oYtQ3Hkddjo_9etaFcnohg":{"text":"Pretty good cold brew!! I wish the flavor was a bit stronger because I'm a big coffee live","useful":2,"cool":2},"Ch5FICwabOZw1OCXQFXFIg":{"text":"Enjoyed one iced (toddy) and one pour over. It was magical. You DO have to ask for half an","useful":0,"cool":0},"HI9kEFt3f3d5vmgCSPfRWg":{"text":"To a LA coffee head - this place is worth trying to find in NOLA - great coffee, adorable ","useful":1,"cool":0},"3GfDbZVJgTrwjuSNvs0-7Q":{"text":"wow...I've had some good coffee, in fact I consider myself a bit of a coffee snob, and thi","useful":0,"cool":0},"Ugqn7cZORVMAiDX7JrHxqw":{"text":"Great place for coffee in the French Quarter. The iced skim latte was really good and even","useful":0,"cool":0},"PGv22iOO2evFtiqnoFi7UA":{"text":"Spitfire espresso bar is one of the unique finds in the French quarter of New Orleans. The","useful":0,"cool":0},"5DA73CILlH-FXm29kmf5ow":{"text":"William B loves the French Quarter.   However anyone who ventures to the Crescent City kno","useful":1,"cool":1},"HwNHi6yqO53IRPRDaBW4_A":{"text":"Hands down the best espresso in the Quarter. Possibly anywhere... Rich and buttery.\n\nWasn'","useful":1,"cool":0},"DqE9VcVLiTk5DhrKnUmZpw":{"text":"Been coming here everyday for the past week. Excellent coffee. Mega friendly dudes and jus","useful":0,"cool":0},"RSfTMYPt3D8LWg7DAKEhWA":{"text":"Great spot for a proper latte in the French Quarter! It a tiny little place with only 4 st","useful":0,"cool":0},"St6PHv7gQ13H0VNHTAhPgA":{"text":"Great coffee! These guys know what they are talking about when it comes to coffee.","useful":0,"cool":0},"QNX7l3LUbHZUf3xF1EnOmA":{"text":"Great place. The baristas know what they're doing here. Nice selection of beans for sale, ","useful":0,"cool":0},"sBT8MKj8bucx056aYnI4Nw":{"text":"Coffee was gritty. Was ok service but man the coffee was . Place was clean very small only","useful":0,"cool":0},"KRtXZkRHA-PE8Q4ncl8ZQg":{"text":"Blink or you'll miss this place, but you might smell the beans. Little coffee shop that re","useful":1,"cool":0},"BuZGATmtQGEJW7PykwKF-g":{"text":"Created an account just to leave this review. They have coffee, I drank it, all is well. T","useful":1,"cool":1},"Bwfj7QwG4L1wI_s1F6CUdA":{"text":"Grabbed a Cuban Cortado with soy milk. It was smooth and delicious. Just the right amount ","useful":0,"cool":0},"k4xi9O3l3C78COZJgtVfsg":{"text":"Great, tiny coffee shop in the middle of the French Quarter.  Friendly barista, who brewed","useful":1,"cool":0},"sqfku7HpeFi03eoPN4K54Q":{"text":"We decided to find a coffee spot nearby as we waited for our numbers to be called for Ruby","useful":0,"cool":0},"CKQYYYkAvIPyJBIb1eizFQ":{"text":"Really good coffee here. Nice baristas, very small space, so if you want to sit and sip, t","useful":0,"cool":0},"Vl4gVFfZgC1TRacsaDAmvQ":{"text":"I kind of felt like I had stepped into Portland for a second here. In the heart of the Fre","useful":3,"cool":0},"lJdWjZ8z29nWUKeAstqlAg":{"text":"I stopped here to get some coffee for my husband and some iced coffee. Their iced coffee i","useful":1,"cool":1},"qkcTmMmeae7kgGqS-6vmFw":{"text":"Simply... a great cup of coffee - a rare find in the US.\nThis was the first place that we ","useful":0,"cool":0},"-iBY1c9G0YgXEsVBrKXiDQ":{"text":"A San Francisco pour over coffee shop in the middle of New Orleans French quarter. I order","useful":0,"cool":2},"7oktzSZAWQlPs_XsP933Tw":{"text":"Saw all the great reviews, I'm not a coffee drinker but my wife is.\nLocations right behind","useful":2,"cool":0},"OMQXwpBmnXoXaAMEHXHlaA":{"text":"After I drop clients off at Louis Armstrong, I sometimes just park and walk around the Qua","useful":0,"cool":0},"V2E7gd0yA19PGJC0J33heA":{"text":"In a recent road trip across America we stopped at some very seriously rated and highly re","useful":2,"cool":2},"QS8FlSQD_bJbbFNGCc0m7g":{"text":"I love a pretentious coffee shop, but $6  for two shots of espresso is ridiculous-- and I ","useful":1,"cool":0},"dQ2iL0CWvQaEHCWVUqCQHQ":{"text":"I had the cortado and my husband the coffee. so amazing. great tiny spot! perfect for coff","useful":0,"cool":0},"bKeIN4ddFnnFzpdC9mTYRQ":{"text":"coffee sucked and is staffed very rude hipster assholes who tried to push an anti soy poli","useful":0,"cool":0},"OeYbWKS_2Un1acZfEAp5gA":{"text":"Great place just found it. Very simple and to the point with their coffee menu. Espresso a","useful":0,"cool":0},"4n529oD2CuhP2dqNd7RFFw":{"text":"Unique and small place with fantastic coffee! It was a bit hidden but once I found it, the","useful":0,"cool":0},"Wg-PPC2UmxUDTMG8gLjzaQ":{"text":"This place is on a very short list of good coffee joints in New Orleans.  I had a cappucci","useful":1,"cool":0},"8uXYIAQUMtzc4ULinviWZw":{"text":"Best coffee I've had in NOLA. Not a place to sit, but if you're looking for good coffee - ","useful":0,"cool":0},"kmABtoWyCuEniCCcD8Dh0g":{"text":"These people know their coffee. I was recommended this coffee shop surprisingly by a baris","useful":3,"cool":2},"eKJEtf1dHs2obnnfL6FbQQ":{"text":"Sought this place out for some real\ncoffee (the stuff at the hotel wasn't cutting it). I g","useful":0,"cool":0},"88g9JkCZCMNOSw9n85aXAQ":{"text":"We do a looot of walking when visiting New Orleans so, we hit a lot of coffee shops. The d","useful":0,"cool":0},"VL47E6Bx5NlAEuiDKXctlQ":{"text":"My first third wave in Nola, absolutely amazing espresso, just hitting the spot for that m","useful":1,"cool":0},"btqaaS89RSrN6Mje5Lucew":{"text":"Best espresso drink I have tasted in YEARS. I had read earlier rave reviews and HAD to try","useful":0,"cool":0},"X5HRDULpWoGc5P87j-QSng":{"text":"I just had THE most amazing vanilla latte from here. While walking down the French quarter","useful":0,"cool":0},"v6tGmIfLnoT8-a1uy_fieg":{"text":"we essentially tripped and fell through the door while hungry looking for dinner. And I'm ","useful":2,"cool":1},"4UqtgVEW1WspIqvWIAe72w":{"text":"Being a coffee snob, I really searched for where to get my daily fix. This was only coffee","useful":0,"cool":0},"8Sab-f2w3HhIhEg7oYgAmg":{"text":"Highlight of my trip to New Orleans. Accidentally stumbled upon this place and proceeded t","useful":2,"cool":0},"tKbOAYjZxfLFmy_fhmDFrA":{"text":"I'm definitely not big into cool people coffee. I barely drink any and when I do, its just","useful":1,"cool":0},"yX-T0RNzBMHM21h9YYd1Pg":{"text":"It's all about the coffee at spitfire.  We stumbled across this place by accident.  Don't ","useful":0,"cool":0},"iwP7Xvx--GClhBLjFGEx3Q":{"text":"Great variety of unique coffee concoctions. I've never seen creations quite like it outsid","useful":0,"cool":0},"pJGBg-zWiwn2oCFwgXjomQ":{"text":"In a town where there is no last call, you need a go to coffee shop that you can rely on a","useful":2,"cool":1},"ZqZUePqJQHbOIMwinqBxng":{"text":"In New Orleans with a friend whose preference for a Soy Latte is Starbucks. I on the other","useful":0,"cool":0},"Zio3Sx_RX8-qr8G78nu27g":{"text":"I stayed with a friend over Christmas and our morning dog walk was consistently punctuated","useful":0,"cool":0},"YFg5_SbcfkppqZOQ4G-BGw":{"text":"I don't leave too many reviews but this place is GREAT. I usually walk away from coffee sh","useful":0,"cool":0},"VmZnz-G5HqDotxtw-zV8SQ":{"text":"Best coffee in New Orleans hands down. The baristas know coffee. The cortado and the Brazi","useful":0,"cool":0},"bzDfY6nOdrGV3lw_cI35ZA":{"text":"Very cool, hole-in-the-wall coffee shop in the heart of the French Quarter. It's sparsely ","useful":0,"cool":0},"wnbqUky2WkAnjnnCiaf05w":{"text":"All I can say is THAAAANK YOU Spitfire for offering an alternative in the land of chicory ","useful":1,"cool":1},"gLHn2VqZDAttXnJu8NMZfg":{"text":"Was not impressed at all ! Coffee's were very bitter the service as well. Dingy atmosphere","useful":0,"cool":0},"aUa87LpazTlCCNkxwMEkcw":{"text":"There is a poem by Theodore Roethke that begins,\n\n \" I wake to sleep and take my waking sl","useful":2,"cool":1},"GbEvkxZMFVw0j05m_xINmg":{"text":"Delicious coffee, beautiful latte art. \n\nThis is a TINY space, NOT a space to hang out in ","useful":0,"cool":0},"_rSml3oCVXMqcEFMVpwFSQ":{"text":"Amazing coffee!! And the tea, wow, delicious. We have been going back everyday. A definite","useful":0,"cool":0},"QuU1ZcUDOTNXlqUB2VAkPA":{"text":"Nice little spot tucked in the French Quarter, concocting some interesting drinks (habaner","useful":0,"cool":0},"lDF9QcLmgeyexoQWbZpZ4g":{"text":"Quality coffee done right. No frappy dappy overly sweet over done swill here.  Real flavor","useful":2,"cool":1},"EQt3R7DlKeixPejux_F3nQ":{"text":"I'd come here again.  The guy working the bar is very friendly. They don't have food, whic","useful":0,"cool":0},"QqMqHEIujIf19jVkD077hw":{"text":"Very very small business. But the coffee is amazing.  They take their time on making your ","useful":0,"cool":0},"bpsN7mJv6B71j1OMThjSxw":{"text":"Excellent coffee! The best in NOLA! \nNot giving them 5 stars because of how small the plac","useful":2,"cool":0},"A1XfhMfWCxlZTxkhZGHauA":{"text":"Hands down the best Vanilla Latte I have ever had! I love the place, the Barista was super","useful":1,"cool":0},"-pR4dvhYVX22EK66OXqi6Q":{"text":"An incredibly small, but fantastic coffee shop. Fast and friendly baristas, and delicious ","useful":0,"cool":0},"1MEIMMm1lupdK9p_H3mKBg":{"text":"I don't really think of myself as a coffee person because I generally think it tastes horr","useful":1,"cool":0},"P_zMWXGNqu9gkmp8O5H-jw":{"text":"On a recent trip to New Orleans I stumbled upon Spitfire. I was so surprised to find this ","useful":2,"cool":0},"TQVOSMQCR01r2cQ2f7FELA":{"text":"Awesome little neighborhood spot. Quiet, good music! Great espresso, although I do wish th","useful":1,"cool":0},"n_z94yrT17eHjM6Y1KpYjg":{"text":"Ok, so you've been to Cafe du Monde.  It's an institution and a piece of New Orleans histo","useful":0,"cool":0},"5LTsPVCbBwo__bf5zHu4zg":{"text":"Great unique coffee shop.  I had the hellfire mocha and it was terrific.  Loved the place.","useful":0,"cool":0},"epOvrEF8P4u0EwnfmcSZnQ":{"text":"Excellent iced coffee. Great flavor. Cool little hole in the wall place with no frills. Yo","useful":0,"cool":0},"yRma30evMNQ4Xl9_FqKW6Q":{"text":"Hole in the wall just west of Jackson square with real espresso and awesome lattes, I know","useful":0,"cool":0},"ewarKVGmWtXoGpY1sAx2HQ":{"text":"It takes a very memorable experience to get a 5-star review. I'm sure I just had the cream","useful":0,"cool":0},"xj4cKYaGqsR5g04yZffN-g":{"text":"Amazing little coffee shop hidden neatly into the French quarter surroundings. Due to the ","useful":0,"cool":0},"bu9xUPaM1vq3mcuShnEwlA":{"text":"Had a shot of espresso and a pour over. The pour over was very good. Would have given this","useful":0,"cool":0},"Ut4SP-3zhrg3BGl0wIRVJQ":{"text":"I'm not a reviewer.  But occasionally, when I find a place that's special, I find that I'v","useful":3,"cool":1},"XB4ZfnQg73YZxp3hJX4lVA":{"text":"It's nearly been a year since our New Orleans trip and I still wake up dreaming about this","useful":0,"cool":0},"FrF5y6tzUn9C5J2hs3dwcA":{"text":"Hellfire yum....chai yes! Well worth the walk in the rain for quality drinks by friendly e","useful":1,"cool":1},"W-PhxfXyJWtLvFJ43L0CWQ":{"text":"I went out wandering this morning, just wanting a cup of coffee. What I received was a per","useful":0,"cool":0},"BxQZ8vjFDKbS8ASWYWwPOA":{"text":"Spitfire was far & away the best espresso bar (and the closest to what we're used to drink","useful":6,"cool":3},"hdOZTjecNfRJc_v181dStw":{"text":"Strong and fullbodied. I was a bit worried that the milk was too hot; that it may have bur","useful":1,"cool":0},"900eHoedATXzOA_mxkP7Qw":{"text":"Best latte in the Quarter. As a coffee connoisseur I sign off on this little coffee house ","useful":0,"cool":0},"TbCRyvV01Ip7jYzocUheCA":{"text":"Stopped by Spitfire while exploring the French Quarter for the day. I really loved this sp","useful":0,"cool":0},"WOtryvgYTfeDZJU2mt3upA":{"text":"Best coffee in the quarter. Hands down. The attention to detail is extraordinary and a bre","useful":0,"cool":0},"OETEFre9UJzTfGqpWYKZVg":{"text":"This was a stellar visit, albeit a funny one. Quickly hit this spot on a roadtrip, brother","useful":0,"cool":0},"P3zsAay9FrKfnGPw9_bHiA":{"text":"The drinks were perfected and have each ingredient listed. The baristas were very knowledg","useful":0,"cool":0},"pgkqQ-XJtxgLiUkIDfHicA":{"text":"I was in New Orleans for just one night while driving across the country. I was told to ch","useful":0,"cool":0},"NYhSnSRvPh0rbybXyNuKLQ":{"text":"Wonderful cappuccino and best cup of tea. Owned and operated by locals. Very friendly, kno","useful":0,"cool":0},"am4OLC2aoO1I8DkYCfYYzw":{"text":"Just down one of the streets next to the cathedral, Spitfire is easy to overlook on the wa","useful":0,"cool":0},"nB65sR0DxyQNiU0YW8s-ow":{"text":"Coming from a Seattleite who knows and loves her coffee, this is a great place in NOLA! Th","useful":0,"cool":0},"wXOSK5zDfEnFEsb8xzuCwA":{"text":"Great espresso and friendly staff.  There are only a few seats against the wall in this sm","useful":1,"cool":0},"UDwygnDjIfa6-gC1Ia4fIQ":{"text":"I was so thrilled to find this Coffee House. The other places had that awful chicory that ","useful":0,"cool":0},"ZAQ11AEZwBWIihv3zsD6mg":{"text":"Local here! Love this place for coffee and different espresso's. Have to try it out! Small","useful":0,"cool":0},"HgGc5EF1gXgV7gmf-ELAsw":{"text":"Spitfire coffee will ruin coffee for you. Their hand brewed coffees are made with such car","useful":1,"cool":1},"dYzn04-cGdv3VeyDjbGuTw":{"text":"We wanted a good espresso and didn't want to find ourselves in another tourist trap, so we","useful":0,"cool":0},"Sr3rIKztzIsDvK2GTbnBTQ":{"text":"Delicious chai tea, well spiced and cheap price. Friendly service.\n\nThe shop is small and ","useful":0,"cool":0},"veeTcrCWHuZK8oycd1ynRw":{"text":"The molé cortado is my favorite coffee I've ever coffee'd, in a long life of coffee-ing. T","useful":0,"cool":1},"q5DLSceowqKGInG_PiVaNA":{"text":"This is easily the best coffee in the city. Always perfectly brewed and they have a select","useful":0,"cool":0},"n7oLmeQslZH4UYZbRACdZA":{"text":"Delicious latte with a warm modern interior. Small seating area. Simple syrup for sweetene","useful":0,"cool":0},"ZRYFS8GBSPKP5L53gJrDoQ":{"text":"7.11.17:\nI'm still craving these scones. I swear I've never had a scone so good. I wish I ","useful":0,"cool":0},"TKZ7ZrVUgmkOk5kOs0NZHA":{"text":"STRONG. Best espresso I had while in New Orleans. The iced coffee was rich and needed noth","useful":4,"cool":1},"fjmWnrk_Xfiqh-UQma0sNQ":{"text":"This little coffee shop has super friendly staff and great vibes. \n\nI ordered a Latte whic","useful":1,"cool":0},"fjBTApegLFNKrRWG4Bnxeg":{"text":"It's been a couple of years since I was there, but felt necessary to but something on here","useful":0,"cool":0},"aEgWrpfavYitrlPGEt2HMg":{"text":"I cannot begin to express how excited I am about this place. I've been waiting to hop on Y","useful":5,"cool":2},"A8SBTf0WUHTz-9o4Lm_zXQ":{"text":"Great spot for boutique coffee. Cafe de Monde is a tourist trap but this spot has the home","useful":0,"cool":0},"wvhxL_4JQM-FhcWADlgFvw":{"text":"Dreaming about their mole cortado - holy crap it is good! Excellent service! The cafe is v","useful":0,"cool":0},"NsGK2leAi2elZJ0q590n5g":{"text":"Best damn coffee shop in Nola! Ran by a bunch of hipsters, and hipsters make the best coff","useful":2,"cool":1},"HMzg9TAQoqpKm2H16NbjMg":{"text":"The NOLA local who referred me to this place is a life saver! I'm pretty picky when it com","useful":0,"cool":0},"nJWGxa_WjcqCyS-OT50EhQ":{"text":"Great little surprise in the heart of the French Quarter. Got the Hellfire Mocha and it wa","useful":1,"cool":0},"uRVJMUg9AviKdnsdMpuQZg":{"text":"Friendly hole in the wall for coffee! Great vibe and staff. Wouldn't expect such a homey t","useful":0,"cool":0},"vdwsR7PVWVBRbOLC2u267g":{"text":"The barrister was a very nice lady... The Cortado was excellent! Perfect little place.","useful":0,"cool":0},"AWZlFXLccwavdqrqzw8cNw":{"text":"With every destination I go to, I try to find a great local coffee house to get my morning","useful":0,"cool":0},"erOUFvsuamb3_6gmX6ZpfQ":{"text":"Very good coffee! Friendly staff. Perfect for a break in NOLA's busy French Quarter.","useful":0,"cool":0},"oAErnuaRyT_W1cwxwH_w-g":{"text":"Tiny little joint with hardly anywhere to stand or sit but their cold brew is near perfect","useful":1,"cool":1},"QNzmkl8pJYlGGHqJYW_NLg":{"text":"I really enjoyed the subtle spicy throat feel of the habanero mocha, although if there was","useful":0,"cool":0},"tWyzVlysz285ejhylPZiIQ":{"text":"My 1st stop every morning when I'm here in NOLA. they pull great espresso shots and the mi","useful":0,"cool":0},"zor2G1wIAa6WFVzaPDthbg":{"text":"A bit expensive, but speedy and with high quality drinks and pastries. Awesome local busin","useful":0,"cool":0},"yFUEaZgJZsJxnlZK6HU0Fw":{"text":"Pros: coffee expertise, location near Jackson square, speedy service\nCons: small, it can f","useful":0,"cool":0},"ZbDQHQRUZlcUR8bk-TyEjA":{"text":"Amazing coffee. I forgot which one I ordered but I know I really liked it and it was super","useful":0,"cool":0},"WdQKQE6nxASpYrSB4Qs6FA":{"text":"Solid mochas here. Mole Cortado solid but pretty strong tasting. They serve better mochas ","useful":0,"cool":0},"6N3i3gIjVMlqjlXfaR0AJA":{"text":"In my short visit, this is the only place I found in the French Quarter with espresso and ","useful":4,"cool":0},"fbZR23aXTpRF4jBt4rnmMQ":{"text":"TryIng to find a caffeine fix in the French Quarter can be a challenge. This little shop s","useful":0,"cool":0},"MHfGSbiMPySPJGNb2zTijw":{"text":"Amazing. Have the cortadito if you like it strong and sweet! Made perfectly and lovely bar","useful":3,"cool":0},"fp-GAmoapGrQgN9RNs0kSQ":{"text":"Strong acidic coffee with no decaf option. Limited choices available, but the baristas cle","useful":0,"cool":0},"IgmAQnzgxCAYJF-5Sm_4wA":{"text":"Tiny little spot! Easy to miss. 4 barstools if you want to stay and sip your coffee on the","useful":0,"cool":0},"1K3sc6E5MbY8d_uoVNz9bA":{"text":"It is a cool place to get coffee. But it can be really crowded and no where to sit. So Gra","useful":0,"cool":0},"xVNolm0yPy_JMY-QL2EOcA":{"text":"Great iced coffee but there is no place to sit. More of a grab and go place so if you need","useful":1,"cool":1},"FpWQBMwY_-FeULf7ngU0tQ":{"text":"This review is just for the espresso because the ambiance is nothing to mention. It's just","useful":1,"cool":0},"9HM1RI5kXJhEq0naU7hSVA":{"text":"We loved this place. We only got to go here once while on vacation. But i wish it was clos","useful":0,"cool":0},"TUUX6kF5KQw14Gb14zzx1g":{"text":"French Quarter isn't teeming with contemporary urban coffeehouses, so this one is a bit of","useful":1,"cool":0},"4ic9v-_jV1qXP4kI-L5Z1w":{"text":"Carefully crafted and delicious espresso drinks near Jackson Square, across from the Gumbo","useful":1,"cool":0},"m1HvZs7N7BO66L3E8KQG1Q":{"text":"I found Spitfire on the \"Here's the Complete List of 58 Extraordinary Coffee Shops -- With","useful":0,"cool":0},"kXfz0dGPJnTNJhB-F8-lQw":{"text":"First off, this is a craft coffee bar, so if you are looking to get in and out in under 3 ","useful":0,"cool":0},"FOxF82Ort5sbtdyhqQWR6g":{"text":"I am picky about coffee. I own three different coffee-making system at home and drink 4 cu","useful":0,"cool":0},"gb7khy1comjwJzu5wkTl6Q":{"text":"Good coffee has come to the Quarter! Thank the coffee gods! This was so way overdue. I've ","useful":0,"cool":0},"FGGjakcgjwns0qF5VLR6vA":{"text":"Seriously does not get better than this.  We have been back multiple times, and every drin","useful":0,"cool":0},"JlAnopPF1NcyicvPXY6Xmg":{"text":"In addition to the standard espresso and coffee beverages, they have some great specialty ","useful":0,"cool":0},"Syrtjs-kK9RfdeElIrlFKg":{"text":"Spitfire is legit, 3rd wave coffee. A small shop in the French Quarter serving pour overs ","useful":0,"cool":0},"WHVS1oISqkw55tJihlXNaQ":{"text":"My partner and I stopped in here to order some coffee after hearing the rave reviews. Whil","useful":1,"cool":0},"3j3Txdpq_sJbgRSGzBaDBg":{"text":"I like to think that I'm somewhat of a cappuccino connoisseur. Let's just say that my wife","useful":1,"cool":1},"lF9dfrMAaHg-qJGpPLwHtg":{"text":"Being from Portland, the coffee in New Orleans is nonexistent except for Spitfire. These g","useful":0,"cool":0},"RTIH7iHJJfuVR7nYnwbf7A":{"text":"This place makes a really good latte, but it is really expensive for coffee and not a plac","useful":0,"cool":0},"XPVyZOt4K-ONcKbexqTVGg":{"text":"Chai was a bit spicy but good. Staff was friendly and timely. Cool atmosphere with about 4","useful":0,"cool":0},"QWcWjW92qFM6ikz2MGf3LA":{"text":"We tried the hell fire mocha and it was mediocre. It needed more sweetener and more of an ","useful":0,"cool":0},"AcycKQTajlQtweY9gVht0Q":{"text":"If you're looking for a true Portlandia experience, look no further. It's pricey, but hey,","useful":0,"cool":0},"I7J-046hTlhviVu91EtQXA":{"text":"If you're looking for artisan coffee, you've found the place! The latte with honey was rea","useful":1,"cool":0},"azrnqIAMxqplQqXiFAa08Q":{"text":"Coffee is my nectar. Love it all day long. After my travel buddy read out the glowing revi","useful":0,"cool":0},"LS9Jq-_72FBEv9HVE-QPkg":{"text":"Great little shop! I found this place and bookmarked it for our NOLA trip, and wandered ac","useful":0,"cool":0},"jB0wsbwq24h6X6kiPYFU3A":{"text":"Awesome coffee!!! Kind of a small, hole in the wall, kind of joint, but very well blended ","useful":0,"cool":0},"vPpwkBfJDrm-ugoHlt-4pQ":{"text":"Order: Chocolate board, Cortadito, Maple latte\nPrice: $21\nPros: They use really good coffe","useful":0,"cool":0},"fmi0uD8gSJQiQNnp-3PESA":{"text":"Tiny hole in the wall with great coffee and tea. Myself, I had a chai w/almond milk and sw","useful":1,"cool":0},"Q6LKuG1Q5m_xcdsn8jFojg":{"text":"Spitfire was recommended to me by a serious coffee drinking colleague or I might not have ","useful":0,"cool":0},"zl1DUwTBgR0NQ1dsTM07Xg":{"text":"This place makes me feel like I'm back in San Francisco: modern look, cool music, high qua","useful":0,"cool":0},"rgVfBHqI7KHpV302kIhIBQ":{"text":"Cute small cafe handmade specials hellfire mocha $5 (mocha with a kick) with nice art desi","useful":1,"cool":1},"gr8fMIRDPlrBlcmBVFGNMA":{"text":"Great little coffee place. Almost missed it walking around Jackson square. Good cappuccino","useful":0,"cool":0},"P6opocpiRMzC7De_w0sb3g":{"text":"hands down the best coffee shop in or near the quarter.  serious props to these guys, and ","useful":0,"cool":0},"M4zMx_iNQcPuQLMskQRb9A":{"text":"I make it a habit of trying the best coffee houses when I travel and this place is easily ","useful":0,"cool":0},"dxr2BCs4K5txezbBfspx9A":{"text":"Lovely to find a charming tiny delicious spot to have a spot of espresso. Located in the F","useful":1,"cool":1},"5tK71qYsQQuq_fznowPUPg":{"text":"Best coffee in new orleans. Skip the cafe du monde tourist trap and head straight here!","useful":2,"cool":0},"CtUgAQvSFw7yvwsrcVBnaw":{"text":"Cute little hole-in-the-wall with a kick ass cup of iced coffee.  The only reason it gets ","useful":1,"cool":0},"ZLWQi_6Stt9c_1C5L-6ojw":{"text":"This is a small coffee shop, so small that I did not even notice it at first. I had to rea","useful":0,"cool":0},"rP-QpXULzIqt7hfFzRd8MQ":{"text":"Awesome coffee experience in the heart of NOLA! The barista did his thing and took the tim","useful":1,"cool":0},"wtkV_ATie5czPXIJt82BQQ":{"text":"Great cappuccino, close to jacksons square. Perfect, really. Friendly baristas as well.","useful":0,"cool":0},"nE_54qKiXG_jTYjMGbikdw":{"text":"Fantastic coffee and even better baristas. \n\nWent in here my first day in New orleans and ","useful":0,"cool":0},"nEK0Y4psidFVRCJ4ZisAaQ":{"text":"I concur with the rest that this place is the shiz. Bummer about no seating, so you can't ","useful":1,"cool":0},"y5oafLoWDVA_gT-egRnKnw":{"text":"I tried lots of coffee in NOLA last week. No doubt about it, Spitfire was the best.","useful":0,"cool":0},"FHLtqmeKrOYt-pkzypk_rQ":{"text":"Great coffee - I like it a bit stronger than this but it was well made with good crema.  M","useful":0,"cool":0},"Al7yb9wy4RwpOPYINAhSZw":{"text":"Nice third wave coffee shop in the French Quarter. The mole cortado had just the right amo","useful":0,"cool":0},"yojrIxPeNcSnMFKGoU2YMQ":{"text":"Absolutely delicious latte. The seem to be both meticulous and friendly to boot.","useful":0,"cool":0},"JSQ0BdPTkcQ9Q3P_vFwwig":{"text":"I am in the coffee business so difficult to please when traveling and normally bring my ow","useful":0,"cool":0},"feCnNH1TbeKMHntDuPUTSA":{"text":"My boyfriend and I were directed here while waiting for our tour to begin. The awesomely s","useful":0,"cool":0},"YbHEaFwezqQBmp-9PPE_qA":{"text":"Best coffee spot in the Quarter! Too small to spend hours in (not a study spot), but has r","useful":3,"cool":2},"m7hfmq6C3cuWeVIEqq7xyw":{"text":"Cute spot, awesome location, good coffee, lots of milk options, friendly staff. Made me fe","useful":0,"cool":0},"jYNVp6hUOnYkPhrsat7B8A":{"text":"Great place with outstanding coffee. Many different choices and the owner is super nice an","useful":0,"cool":0},"YfvojOCloO1mmS0jQc9pRg":{"text":"I recommend this place to everyone traveling to NOLA!!!! They really turned me into a coff","useful":0,"cool":0},"NvLa6iYMOyXpsgtv2zv0_A":{"text":"GIMMICKY DONE RIGHT AND CLOSE TO JACKSON SQUARE\nMy attention was immediately drawn to the ","useful":4,"cool":4},"dJNPvagnhBEFRs3lQGEbnA":{"text":"Best vanilla latte I have ever had it was seriously sooo good Meg made it. I didn't have t","useful":0,"cool":0},"-IEwJs8ozma6ALRBD0LgoQ":{"text":"This place makes the BEST coffee quickly. It's a very tiny hole in the wall with only a co","useful":1,"cool":0},"6suSdGo8hbyLvWKSgTaT8g":{"text":"This place is the best espresso in the quarter and on the list for best espresso in the ci","useful":0,"cool":0},"OIiq61-pNRDxFtp2k4p0Gg":{"text":"Best coffee in New Orleans. Can't get a better cup anywhere else. Hellfire mocha is awesom","useful":0,"cool":0},"hOFxHEVk9mmftRGlVGwLRQ":{"text":"If you're looking for a cup o' joe to-go, this is your place. But that's all you're going ","useful":0,"cool":0},"LAtD2E-rEiG9VXnUpyaxrA":{"text":"Latte with lavender tincture and dried rose petals and Mexican latte are delicious and tot","useful":0,"cool":0},"f4eUdyVA6MLyscMa-arYnQ":{"text":"I tried the mexican vanilla latte and it was delicious. \n\nThey also have tea if you're not","useful":0,"cool":0},"bt6vgCMgkSDdZopG7sycjw":{"text":"Not good. Maybe they were having an off day but latte was watery and the soy milk in it ha","useful":0,"cool":0},"L2F7JPGUIWSpokYxfvz_sA":{"text":"Best coffee hands down in the city.  Mmmmm vanilla latte is amazing! And the guys who work","useful":2,"cool":1},"ijVY1sC3-oQB_lmrdDN_jA":{"text":"Forget Starbucks, walk to Spitfire & grab a coffee.\nI'm not from New Orleans but if I live","useful":1,"cool":2},"58u4hkuTVJk0yDmZNU8tMg":{"text":"Very small hidden coffee shop. Always a relief to find good coffee in tourist areas. This ","useful":0,"cool":0},"t7XEhYmBH1q86h_9fOo_kQ":{"text":"Excellent espresso quality. These guys know how to make good coffee. They use mostly light","useful":0,"cool":0},"J-jETSRlDvjT9cJZeHwiKw":{"text":"Do yourself a favor & grab a coffee here. You won't regret it!  The best iced vanilla latt","useful":0,"cool":0},"he3NOsYZvPb3gmX8ZRG6MA":{"text":"Dream coffee and dreamy staff! A variety of deeelicious pour overs and they rotate espress","useful":1,"cool":0},"eS_8369S6aziEHgXtyms2A":{"text":"I really like this place. Visited on the suggestion of someone else. It's awesome. Super s","useful":0,"cool":0},"15GVAMMTa28A5dB-FybKOA":{"text":"Best coffee in French quaters by far! Loved the cappuccino! They do perfect art on every c","useful":1,"cool":1},"wGZFckx4cm8l26fzxg0I8Q":{"text":"It's a small place with little variety. The coffee is a pour over style but it had a metal","useful":0,"cool":0},"BTSfM-RAJn551ljoh2MAhA":{"text":"Really disappointed. Had great espresso there yesterday and was excited to go there first ","useful":1,"cool":0},"zlIC9OuVhzRxmi60tOAqNQ":{"text":"High quality coffee options ranging from pour overs to cortados. Don't plan on staying the","useful":0,"cool":0},"Q6d7bPNrNjnJxs2GWL53wQ":{"text":"This is an adorable little coffee shop with the nicest owners. The iced toddy was deliciou","useful":0,"cool":0},"LHFaELq38UvYxGRkcOStog":{"text":"Spitfire may not have a long history in NOLA (opened in 2013), but it's actually one of th","useful":4,"cool":3},"LjWVylPQii7cXh9RA3OcEg":{"text":"Easily the best latte I've ever had. The maple latte tasted like heaven. This place is one","useful":0,"cool":0},"DExxi5ZUS5hNSoCH8vLShg":{"text":"Cute and tiny coffee bar. They have knowledge baristas and very smooth tasting drinks. The","useful":0,"cool":0},"m9QefOtpz8mBlx3AMDoINw":{"text":"Cortadito! Yes! I was so stoked to see this on the menu here, and even more stoked to disc","useful":4,"cool":3},"kQsoQXQHSvweecw7RfZEEA":{"text":"Great Au Lait!. Spitfire is definitely my favorite of all of the third wave places. They'r","useful":0,"cool":0},"L-_6dwL2HTvIKdMoILPkGg":{"text":"Great place for a latte, they even have soy milk. Barista was super helpful at explaining ","useful":1,"cool":0},"tsLXbgWtYTSgoT_qu5N0Hw":{"text":"BEST COFFEE IN A WHILE! I am still dreaming with this Vanilla Latte. So good! So affordabl","useful":2,"cool":0},"YGmWf4BRP2ccTDNeiIiuLw":{"text":"Small and crowded - definitely grab and go coffee. There are a few stools to sit at, but i","useful":0,"cool":0},"JZ_nzgN3KtEnpNpn8V5Q_g":{"text":"A small coffee shop with really great people. Their cappuccino is a must try. Rates are pr","useful":0,"cool":0},"DXrMrzv2mVmf_rGDe7SU2g":{"text":"Got ice coffee with cane syrup in it, yum yum! Definitely stop by here, coffee lovers!","useful":0,"cool":0},"k5OCmr4FhHwkK2Qb8F6szg":{"text":"I wasn't expecting to like Spitfire. I needed some coffee while waiting for my sister to f","useful":2,"cool":2},"THpoYD4IgCAT1GE11SomZw":{"text":"The staff is very knowledgable but not pretentious. We enjoyed their espresso twice during","useful":1,"cool":1},"1CGs_NbBVM7HgeKTIOIK-g":{"text":"Great cappuccino. They made it perfectly and were very nice with their customer service.","useful":2,"cool":1},"ImaCu0sAbx-Pp_3tsnN1jg":{"text":"Watery iced coffee. Very hipster which was fine but no space to even really fix your coffe","useful":0,"cool":0},"NpxANhq4s5zpgMXnnLuLOw":{"text":"Basic but great coffee selections... not much fancy going on but they do have a specialty ","useful":0,"cool":0},"LwqImESgY9vN4lZUmUxVhg":{"text":"Overall: Some dope coffee! Be careful cause you can walk right past this delicious gem.\n\nT","useful":0,"cool":0},"5n19tN-3NYsdPlqUfJJLgw":{"text":"The cold brew Coffee was great!! The two owners were so personable and knowledgable. Such ","useful":0,"cool":0},"wG8U6-82j_O5lEMAwwQINA":{"text":"If you aren't paying attention, you'll walk right in by. But you'll be missing out if you ","useful":0,"cool":0},"I9p6k_w7EmoDiRyOb3b57g":{"text":"Yes, yes, yes...coffee and tea done oh, so right!\n\nWe rolled upon Spitfire while en route ","useful":2,"cool":0},"-TjzseQnR3X9qq58_HV1kg":{"text":"It's a great lil stop, literally the fanciest coffee I've ever had. Air conditioned and go","useful":0,"cool":0},"N_Dfjz0FZFIm697pYKMoZw":{"text":"If you are looking for some delicious coffee and need a break from the chicory blends Spit","useful":0,"cool":0},"SRRy8-YYwxQwtCTFiRH57Q":{"text":"Best coffee I have ever had in the USA.\nStill a small coffee and caffeine hit by Aussie st","useful":0,"cool":0},"04rG04iZBDBGIg_JW64-3A":{"text":"This place is amazing! They deserve a 5 star rating. Sipped a rose infused latte! Wow, wow","useful":0,"cool":0},"wQB019Yhuv9n9z3nNvY-iQ":{"text":"I was in New Orleans for a long weekend and came across this place, and ended up going twi","useful":1,"cool":0},"KvOKMvF5eT_d44A4-4LDQQ":{"text":"These guys are scientists and measure everything about your espresso and when you taste it","useful":2,"cool":1},"C6vDJEb5g8GEMvgkGozHjA":{"text":"BEST COFFEE IN NEW ORLEANS. The quality is unparalleled by anywhere else in the city, beli","useful":1,"cool":0},"JZXNV7RPprA8FqKCCGrGyw":{"text":"When in New Orleans as an adult, it is very likely that you'll awake the next morning with","useful":1,"cool":2},"5HeOaeBLhQzOXkxMfD7bQA":{"text":"One of the best coffee shops I've ever been to! Great espresso, delicious coffee and an in","useful":0,"cool":0},"jYU1f54mDwcc7YWeTDpCug":{"text":"Amazing little hole-in-the-wall coffee shop!!!! My husband and I are always looking for th","useful":0,"cool":0},"GXJpqqFr3yhH4BJRGs9kLg":{"text":"Eh. It's coffee. I come from the land of iced coffee so $4 is pretty steep even for cold b","useful":0,"cool":0},"BhpslsLoOB3GR3ektYXL8A":{"text":"Love. It. Brilliant.\n\nThis was desperately needed in Nola. Pour over coffee, espresso, etc","useful":1,"cool":2},"pGvnAczrdVaqJMMbGCBYdA":{"text":"I like lists. So, here it goes. \n\n1. If you like third wave coffee, this place is a must. ","useful":1,"cool":0},"2PTBDZsuVfMvcIZGWdZPcg":{"text":"I've been down to NOLA many times, and this new discovery became my go-to on this trip - f","useful":2,"cool":2},"ArV65Vopl0l8kgVC_79YJQ":{"text":"Excellent quality coffee well made by friendly, knowledgeable staff. Best coffee we found ","useful":0,"cool":0},"93ZaeYweJO3zgpzs6rxOzg":{"text":"Stopped in for some coffee and hot chocolate. Very tiny, but we were able to get a seat an","useful":1,"cool":1},"XAzHcRxjq2KuJe2Yjd2S5g":{"text":"It was Monday morning in the French Quarter and I needed a coffee to sip while I decided w","useful":4,"cool":3},"aErlwt9l9DT_VmC7l_nCSA":{"text":"Definitely the best coffee we had while in New Orleans! I had the cold brew, which was per","useful":1,"cool":0},"g8N0NDPNTfg1Sri8ZJ9stg":{"text":"Best coffee in Nawlins. Espresso, macchiato, cappuccino cortado. I have been to coffee bar","useful":0,"cool":0},"GDPQD7hCRDQfFwAUR6a6RA":{"text":"Really great coffee, good service and not too long of a wait.  This place is a definite mu","useful":0,"cool":0},"Kn6F5IGluQ58G2gHSRtC2A":{"text":"One of the best cappuccino's ever!!! Hits the spot. Don't miss out on this small cafe in F","useful":1,"cool":0},"6tX52X5hg1_sQVpw_a8Zrg":{"text":"Definitely needed after a day trip through a swamp and a plantation! $3 will get you a hot","useful":0,"cool":0},"PFRiN_MSDPL0X6mF5yknoA":{"text":"What a freakin' gem this place is. I have been a barista for 25 years and have owned my ow","useful":1,"cool":0},"ba0STBRr2hjJQWnwUUDpmA":{"text":"Cute little coffee shop. They were awesome in there. The drinks were delicious and the emp","useful":0,"cool":0},"qaz4jplVpN0sgvjOiyd2Zg":{"text":"Stopped in here with a good friend and had an amazing time relaxing and sipping on my latt","useful":1,"cool":1},"g2bb3ovAqf6PyENfaeOH8A":{"text":"They do a very nice job here. They have many different tasty coffees available, with uniqu","useful":1,"cool":0},"-B2IVuK580PcEsvz4zim1Q":{"text":"Awesome little coffee shop right in the heart of the French Quarter. We were recently in t","useful":0,"cool":0},"3z0tGP_AfrPejlqglKsVGQ":{"text":"I was on the look for an artsy coffee. I was directed to this place and it was amazing. I ","useful":0,"cool":0},"ouIhgNTn06YYzxVUDpJS9w":{"text":"This place is awesome! It's such a cute little shop in the French quarter, and they actual","useful":0,"cool":0},"oU4Pwilkw5vrN6gilFcuMA":{"text":"As fellow barista (snob alert) I truly love finding smaller coffee joints because the care","useful":0,"cool":0},"NPWcsi6qNVRCL-H136F1dg":{"text":"Great space for a quick and tasty coffee. We caught out barista before a big crowd came in","useful":0,"cool":0},"lMqbz7hs_2x44b1AqXUtVQ":{"text":"It was a pretty warm day and I was in the need for some coffee so I asked for an espresso ","useful":0,"cool":0},"iFyT-bO8oiX999sLpwdWig":{"text":"We had high hopes for this coffee shop when we stayed in New Orleans. It was just ok. The ","useful":0,"cool":0},"ZItP-HUTnL7BxTNL20aYAQ":{"text":"While vacationing in NOLA, we wanted to try a new local coffee shop per day. \nReally glad ","useful":5,"cool":4},"kmAHDUAwzBW9c4HB0-iKrQ":{"text":"Saturday, 11:00 AM.\n\nQuickie:\n+ Coffee quality\n+ Service\n+ Simple menu\n+ Turnaround\n+ Clea","useful":2,"cool":2},"y3rDHbU_-Jq2WyR5y2fEtw":{"text":"This is the most friendly intimate coffee house\nMy wife had tea I needed some shots fabulo","useful":0,"cool":0},"WYpZy69w_MTEYIOdX_VnvA":{"text":"OK, New Orleans has its first real hipster  3rd-4th-5th wave( or whatever it is now) coffe","useful":0,"cool":0},"ZvubndcanZg6Hv31_hsxzA":{"text":"Great coffee, small shop just concerned with the coffee. Made us Aussies flat whites the t","useful":1,"cool":0},"oy1DPazvFf5XRvZY9m_NPA":{"text":"Best coffee in New Orleans. Slowest coffee in America. Now, I don't really mind. I'm in 'n","useful":0,"cool":0},"9aToSpoWA1j5dKUSptkLVw":{"text":"Delicious coffee!  Delicious.  \n\nGood Baristas love good Baristas, and mine was great.   S","useful":4,"cool":4},"NWO3kBi8CNepCAL2q19uPw":{"text":"This was the best cup of coffee I had while I was in New Orleans. Tiny place with a total ","useful":1,"cool":0},"wE_Ls2Cb9p70174qwXySgg":{"text":"Hands down the best espresso coffee in the French Quarter District! The shop is very intim","useful":0,"cool":0},"vD_O91lm-bJcFqE48bV2QA":{"text":"Small coffee shop, select few options, smells amazing. I did not like the vanilla latte an","useful":0,"cool":0},"XK_0lBLy1hptVsryIcOnDg":{"text":"I like the NYC style small and independently coffee bars. Probably the only place in the F","useful":0,"cool":0},"zL03be00UcnUryUZcktArg":{"text":"Solid basic coffee. Only draw back - as others have mentioned, it's a small shop... they d","useful":0,"cool":0},"_FK0XXFJyOrJbltEf-J-pw":{"text":"A nice spot where it is relaxing and small.plenty of espresso drinks to choose from.since ","useful":0,"cool":0},"dsau91LGPEvKiSdt_pRw9w":{"text":"DIRTY. CHAI. COFFEE.  The best.  They make the Chai right there... So good.","useful":0,"cool":0},"uPScMYtMYuIoSHvfSdQClw":{"text":"I only review the really good and the seemingly terrible. Spitfire espresso bar is hands d","useful":1,"cool":0},"RjtPC17_hQ1gMH3Ab_kcoA":{"text":"Part of my coffee crawl during the trip. I had visited a bunch of \"cafes\" but this was the","useful":2,"cool":0},"qP0zRz2Pgc4wTJfgBnNsrA":{"text":"This is a five-star not-Seattle espresso shop. That's all they do but they do it well. Adm","useful":0,"cool":3},"6iRpfFFKCZNzHMPykv3pug":{"text":"When this place first opened, I literally walked by, smelled the coffee and had to go in. ","useful":2,"cool":0},"It1IuwyAEZazTdVh0ijUAg":{"text":"Just what we wanted! Great coffee and something to eat that we can't get at home. Try the ","useful":0,"cool":0},"Z9ObR0C5qrlLAblmxlXzvA":{"text":"Fantastic coffee. Our group had a shot, a cortado, a cappuccino, and a latte and all of th","useful":0,"cool":0},"hr0xSB9hM4v36udhkyeIaQ":{"text":"Great COLD BREW. Look. There is a difference between iced coffees and cold brew. Iced coff","useful":1,"cool":0},"YEk13pVOUYoZFQvMCrFDMw":{"text":"I knew finding a decent coffee in the USA was going to be a struggle (coming from Oz), how","useful":1,"cool":0},"zpIPBeGZHdFb5_glgU6GLg":{"text":"Best espresso in Nola. To be entirely honest, that's not saying a whole lot. But for what ","useful":0,"cool":1},"swfm9krE4wFUjRPTwUoSWQ":{"text":"Excellent cappuccino.  Only place I can get a better is at home and it's not as pretty.  W","useful":1,"cool":0},"KMBd85hcEF2i7QE4uKSzaQ":{"text":"If you don't like or want chicory coffee, as you are bound to find at the other restaurant","useful":0,"cool":0},"pegBS4f3cWM-ut6vZefw9w":{"text":"The hotel I was staying at recommended it as a local good coffee shop. I ordered the decaf","useful":0,"cool":0},"LTM_ZSWH0wqZUYR0OWqL_A":{"text":"Hidden coffee shop with great coffee. If you're looking for quality this is the place. Lov","useful":0,"cool":0},"Lqr-MrLJe1mwvrI7o1PPPw":{"text":"Cute a little awkward being there with just the guy who runs it. He was super nice thouhj","useful":0,"cool":0},"tciTmM_c_IpbcfL1Hq6Y9g":{"text":"Went Into spitfire today expecting one of the most delicious iced vanilla lattes in the ci","useful":0,"cool":0},"1A_NhUgkz2GDaHZXQPUnHg":{"text":"Real coffee in the Quarter. Pour overs, Honey Lattes, Cortados, made to order. Excellent q","useful":0,"cool":0},"q1Anei0JmaG9aIKD5USmhQ":{"text":"Literally a walk-in walk-up coffee shop. So tiny I can't even call it a coffee housekeeper","useful":34,"cool":30},"MlKiga5BItlXH_AwaJCG3Q":{"text":"Wonderful place! The barista made the perfect cappuccino. The frothed milk was velvety, ju","useful":0,"cool":0},"AcLPoMCLHRs6ekQk3MnozQ":{"text":"Being from New Orleans, we have many places to choose from when it comes to coffee, some g","useful":2,"cool":1},"BBFVkaQ99I1RoxjXmfQpwA":{"text":"This place is a go to must for me when I am in New Orleans! It is small and there are only","useful":0,"cool":0},"XrVz-oDpMTVDJYwM2ENB_A":{"text":"Bestie was in dire need of a coffee after a very fun evening, and I was not about to disag","useful":4,"cool":2},"W89KWo6JI5RdIUKRfn3ASA":{"text":"LOVED our soy cappuccinos from here! I also appreciate that their pastries are nice and sm","useful":0,"cool":0},"JyjbDwCMlceYYkLkPlNGJQ":{"text":"No frozen /blended drinks.  I got the ice mocha, it strong and good :) small place. Friend","useful":1,"cool":0},"Wpheje4uCG4OepSZa_AcgA":{"text":"This is by far the best tasting Macchiato in NOLA!!! Andrew was great! He even help us out","useful":0,"cool":0},"RqwLg3OVWLop4hhzCKYd3Q":{"text":"It may be tiny, but this coffee shop has an amazing thing going. The staff was friendly (e","useful":0,"cool":0},"92RdSmYIkOvlGTMHRxVQXg":{"text":"Hailing from Portland and having dated a barista for the better part of four years, I have","useful":0,"cool":0},"77PDtLb4xZXi-iX8odFtLQ":{"text":"I think spitfire is a cool spot! Cool location, ambience is cooler-than-being-cool, and th","useful":0,"cool":0},"1XXW8dvwFlXhkde38XgbnQ":{"text":"I am so glad we popped in to Spitfire instead of heading to a huge chain!!  This isn't the","useful":0,"cool":0},"4-5Q-Xe3Cc0_bZ0qulA28A":{"text":"Awesome. Saved me every morning with their cold brew. The guys there really know their cof","useful":0,"cool":0},"B0n1erVe6teckOrtPWWudA":{"text":"Tiny place but hip and modern. Central location. Lots of cool coffee items. Good quality. ","useful":0,"cool":0},"gfXyXP0NTov0hnMcnq5Vqg":{"text":"This was a fun place to have coffee and check email in the  morning on a recent business t","useful":1,"cool":1},"7re_GPQ_CUv0X2yQPjtUSg":{"text":"Let's cut to the chase: Spitfire gave me the best espresso I've had in years. It was nice,","useful":2,"cool":1},"mp6Z-H7PRfMjHCIS2e3Y3w":{"text":"Awesome coffee. Plus, the staff is just way nicer/cooler than at **cough cough** La Divina","useful":1,"cool":0},"T-dhkhKoB0TSR7k7dUJ0NQ":{"text":"this coffee is amazing! friendly staff and good location. this coffee is not for the 7-11 ","useful":1,"cool":0},"VJeio6XHwHl_7YeeA29jSg":{"text":"Small, cute, local!  People are nice and coffee is excellent.  If you want Starbucks, go t","useful":0,"cool":0},"xynXi9RAhAkoYhG-egGSuQ":{"text":"Spitfire Espresso Bar is a tiny little coffee shop in the French Quarter. \nI got both the ","useful":1,"cool":0},"gYjTEcutSX5bmOn1mVdsHw":{"text":"Finally some decent coffee, good espresso and reasonable price. Wish more american cities ","useful":0,"cool":0},"XUoqcaMei_GvSgHmRRMsGg":{"text":"I had a cold brew (can't remember the name, but it was the 1st of the 2 cold brews listed ","useful":0,"cool":0},"a1-Qtfsaw_ywVv3OpgZgNA":{"text":"I had the hellfire mocha with the habanera bitters. It seemed like a special of theirs so ","useful":1,"cool":0},"SNmVhTszA2c8GB8acYU_nA":{"text":"Very good coffee, made by a guy that cares and knows what he's doing. Small place and not ","useful":0,"cool":0},"H7V-UiGU1DIAjHZcjlFf2w":{"text":"A caffeine oasis in the Quarter. Well made espresso is a tough thing to find done right in","useful":2,"cool":1},"gItrREnERTI-LSGeSauzMg":{"text":"These guys were a blast and so was their coffee. We tipped them off to trying out lavender","useful":1,"cool":0},"W7YcjejQeYs43FmfbelCMA":{"text":"The shop is very small and quaint. It is very close to shops on rural and Jackson square. ","useful":0,"cool":0},"Q_CQicKMDXon2ctgOObHyA":{"text":"No line, strong coffee, friendly service.  Coffee is their focus, so it's not like other p","useful":0,"cool":0},"ahWwSnrvjJkHryUSW64jIg":{"text":"Love this spot in the heart of the French quarter. Balanced and strong. Great tasty creme ","useful":0,"cool":0},"ZJExj4pnjQggEiEjTe7w1A":{"text":"Great coffee, service, and prices. Make sure you get your loyalty card, every 7th cup is f","useful":0,"cool":0},"4c8N8BxZK-B6aqMlWgC1sg":{"text":"We were only in town for 4 days found this place thank god, after hit an miss all the firs","useful":0,"cool":0},"OBsd97lWxO-tGk6IcV_X0Q":{"text":"This review is purely based on their macchiato and cortado. It's a strong espresso but it ","useful":0,"cool":0},"0AB1c_aNCbEFOpfBLunWaQ":{"text":"This place isn't one of the top espresso bars in the city, it is THE TOP espresso bar in t","useful":1,"cool":0},"koFpu8dDAOf3ioxlmb3vdQ":{"text":"Don't go here if you need a cup of coffee.  Go here if you WANT a cup of COFFEE.\n\nFanfreak","useful":11,"cool":9},"xhHJYe0bgRCUTxHZnR2Pqw":{"text":"Great location and fresh coffee.  This place is straight forward with no fluff.  The coffe","useful":0,"cool":0},"rOFZPeLgDd8r3YYazigT2Q":{"text":"Best coffee hands down, and a refreshing break from tourist spots like Cafe Du Monde. If y","useful":0,"cool":0},"4pn__Hg6XVWOp76hmkCgKQ":{"text":"Cute little coffee shop. Don't expect to really be able to sit inside because it's very sm","useful":0,"cool":1},"ezM-HEv7wQfQTjNPrKK3_Q":{"text":"Quality coffee. The handbrews are Hario-made and they're excellent.","useful":2,"cool":0},"6ifdqQAlpvDalZGZJ8JTjQ":{"text":"Awesome coffee in the French Quarter. They prepare everything from scratch as well. I got ","useful":0,"cool":0},"RlhGPm_ye_zJYkLdOkVesw":{"text":"Perfect pour over coffee. It takes a few minutes to get it  but is worth the wait. Very kn","useful":0,"cool":0},"detdfPBwprgyecoetAhyjQ":{"text":"On my last afternoon in NOLA before my flight home to LA, I wanted to cap off my indulgent","useful":12,"cool":11},"iFUWnhweqYaNpkBT7SSyZg":{"text":"Delicious coffee. Great service!\nFor the true coffee drinkers. No sweet Starbucks sugar dr","useful":0,"cool":0},"bkuxNDgF6xnC_mjSN9ii2g":{"text":"The best cup of coffee in the French Quarter of New Orleans can be found at Spitfire Coffe","useful":1,"cool":0},"TCJG7y_l6ox-J7AL6BO82A":{"text":"Who knew you could pack a punch of flavor into 250 square feet?  The coffee is great!  I h","useful":0,"cool":0},"-Fe3FbT909roQGnan6E17w":{"text":"I walked into this shop looking for a cold coffee beverage (we looked up coffee nearby and","useful":1,"cool":0},"QkFdNr7kx4wroOEVjo2IHA":{"text":"This place makes me feel like I'm back in San Francisco: modern look, cool music, high qua","useful":0,"cool":0},"ylO5y9p8sIrpl542HlV0_A":{"text":"Artful and passionate coffee.  You can tell that the people that work here really care abo","useful":0,"cool":0},"JPV8IHs7hyqogUF4WMlKOw":{"text":"Best coffee in the French Quarter. I usually get an iced coffee or mole cortado. They need","useful":0,"cool":0},"ct0mSTrhdf-us_a0YSp7bg":{"text":"Cute pop-in coffee shop (couple bar seats and no tables) Ask for recommendations on the di","useful":0,"cool":0},"1TFetUgEft84v0A5dLrvZg":{"text":"Best coffee in New Orleans! Friendly and knowledgable customer service. The cafe is small ","useful":0,"cool":0},"AkiVLaWWos5rlmvkOCqU7w":{"text":"A fun stumbleupon in The FQ! Hand brew, customized to taste. Friendliest barista. Small an","useful":0,"cool":0},"K2yMsaO6VGbadQkNjrVLTQ":{"text":"The spicy mocho is to dye for on a chilly morning in New Orleans to wake up your senses an","useful":0,"cool":1},"fq7VnoErQdQ5-3JMquBi3A":{"text":"Best Cortado. Quaint.  Small area.  Unpretentious They know how to make coffee right.","useful":0,"cool":0},"SrCEoIipkM14oWjeu-zlfw":{"text":"Small little coffee shop tucked away in the French quarter. They have different beans avai","useful":0,"cool":0},"WUl-FUsgOqTMkavMypsIOA":{"text":"If you want a dreamy creamy cortado made by serious baristas this tiny shoebox in the Fren","useful":0,"cool":0},"AZ78J5NUkO_xb03AkbhlHg":{"text":"whatever's in that vanilla syrup formula is crack!!! it's sooo good. it's got to be my sec","useful":1,"cool":0},"MHtspFD9U3R8RLMJxshdNQ":{"text":"4.50 for a latte but well worth it. You should def try this place out. Much better than St","useful":0,"cool":0},"5mqdfKMMZlPwfw1CEoLCvQ":{"text":"Stopped in for a quick caffeine boost after mass at the cathedral, which is right around t","useful":0,"cool":0},"7V-JGI6MvmZtCmO9P9btGA":{"text":"Love this cute little cafe! Awesome service / barista and it was so cool watching him care","useful":0,"cool":0},"pDnaMnL8hGgFop5VZO7uyg":{"text":"Really enjoyed this little hole-in-the-wall espresso bar. They definitely know what they'r","useful":0,"cool":0},"Epi4niM0176Nd8p_XTY7bA":{"text":"Hipster place with full attitude and zero customer service. Can you be anymore uptight? My","useful":1,"cool":1},"7_PbyR2fqT9lbVdKiRuDEw":{"text":"Spitfire is a bastion of civilization in a sometimes uncivilized place. As a tourist wande","useful":4,"cool":3},"gfndYF6T8FKLRhAPEVjotw":{"text":"Yelp did not let me down! On par with some of the best lattes I've ever had. Using a Latin","useful":1,"cool":0},"0mGW8fWF6apc7JKyFVQBRg":{"text":"Such a great spot. Read so many great reviews that I popped in before heading out on the O","useful":1,"cool":0},"J8aRUZdGMTRuPOT43jJJVw":{"text":"Awesome because it's in the French Quarter and it's the smallest damn coffee shop I've eve","useful":1,"cool":1},"I2lbIMLANvocztKZzjVvJg":{"text":"Kick ass coffee by knowledgeable, friendly baristas. I had a cortado, correctly made: a pe","useful":1,"cool":1},"tqHUEwMW5VqC-TJsAeqLEQ":{"text":"Small walk-in coffee shop featuring an impressive variety of pour overs. It takes a few mi","useful":0,"cool":1},"MuW3biJkBrO5oQAhu7p8ag":{"text":"How is the coffees at Spitfire? I wish I knew.  As a barista, I really wanted to know.   I","useful":0,"cool":0},"Cb3UZUFOUicnuU2nn0nAwA":{"text":"A great spot with an uncommercial vibe.  My latte was pretty good, but I'm betting their s","useful":1,"cool":1},"zkexf_XHITxpMVpeNnXMxA":{"text":"This is the best coffee I have found throughout my travels in the USA. I make a point to r","useful":1,"cool":0},"H8xr5QV1TUX6AOrkiqE8wA":{"text":"Okay so this place is totally awesome. The barista really took pride in concocting my espr","useful":1,"cool":2},"fbN-q_sE68lK0Ns3ZJUHzA":{"text":"You have to try the Las Tres Flores. Absolutely beautiful cup. Not a lot of room to sit, m","useful":0,"cool":0},"3MQKNaFVTMaCEsjBaajbeA":{"text":"Love chocolate, but, strangely, I generally find mochas too sweet. Decided to give it a go","useful":0,"cool":0},"zOjz_paQJ3pG1AK7H4q5cw":{"text":"Shit son, Spitfire coffe is so so good.\nI go there every time im in the Quarter.\nIn Americ","useful":0,"cool":2},"WZ4vjU3lbSIqUGyREeJYrA":{"text":"Really good quality latte / cappuccino right in the heart of French quarter! The place doe","useful":0,"cool":0},"xb2ZC1-UvBAbRPs4GBuWJQ":{"text":"Great place to get a cup of fancy coffee, and probably the best place in the French Quarte","useful":1,"cool":0},"6f7zj2L5cEdzqdmlbrAmyQ":{"text":"Lovely quaint little coffee shop. Their coffee is excellent, they guys in there are friend","useful":0,"cool":0},"VruhQ-BMZwd5ony4xMSqSw":{"text":"Truly delicious hand crafted coffee...these guys know there stuff!  Pour over was perfect ","useful":0,"cool":0},"U_rKt0TBkguX2gZqLo8QRg":{"text":"Great coffee, just like an Australian latte! Only issue was that they didn't have non-fat ","useful":0,"cool":0},"pe8PbCOKoHCW5VqeFNw7lA":{"text":"Delicious Cortado.  Nice to stop in out of the rain whilst browsing the Quarter.  Easy to ","useful":0,"cool":0},"hsTkvu8gUM2exXsq_nf5Hg":{"text":"The BF discovered this quaint little coffee shop on our early morning walk thru the French","useful":4,"cool":2},"Ho3Bt4rAGLNeBYpOzKIgeg":{"text":"I had a double Capp in an 8oz cup and it was dull. This is my staple drink at every coffee","useful":0,"cool":0},"T8FWmYlSR7F6wbH1ShUn4w":{"text":"SO. I had never heard of the V60 Pour over coffee process before. As a dedicated long time","useful":0,"cool":0},"OKhwXCFbDR2P7Xrp6HCSxg":{"text":"Try out their speciality drinks- so delicious and perfect on a warm day walking around The","useful":2,"cool":1},"VJc36C3J2T3kOTfXA4UoRw":{"text":"Oh yes finally some strong coffee in the French Quarter! After having some weak coffee fro","useful":0,"cool":0},"b2TC3OfB1Dhmu4Q2_Hp4bg":{"text":"3.25/5 bold coffee\n\ni'm not sure how to approach this place, kinda falling on the side of ","useful":3,"cool":0},"Fa-hFz7Zt4lWprHjRcORQg":{"text":"Love this place. Right around the corner from Jackson Square, but it still doesn't seem to","useful":2,"cool":1},"96NvnyxAn8tO42Cv6wzBmQ":{"text":"This place seemed pretentious but redeemed itself by offering decaf coffee.  Made me edgy ","useful":2,"cool":1},"bxYMG0ls4XKzNhDs5fUWZQ":{"text":"Legit pour over and cold brew options for coffee connoisseurs from Seattle (and elsewhere)","useful":0,"cool":0},"ILcx1_ri262rEdtYrlMP7g":{"text":"Deliciousness with no pretentiousness. Great coffee and vibes. Best caffeine in the quarte","useful":1,"cool":0},"FVVG0jlBevkcaw_YSWyOTQ":{"text":"This place is tiny, but the aroma is Heaven! The coffee itself is rated 5 stars, but the a","useful":3,"cool":2},"NryUjSZ7eyMtnSsIKUGYkQ":{"text":"i went to jazz fest last year & my friend suggested i try the cold brew out. it was muggy ","useful":0,"cool":0},"ACSu8tNno41eV4zpls8BKw":{"text":"The coffee (cappuccino) tastes marvellous. Never had a coffe like this before. After the f","useful":0,"cool":0},"P_vc6x-QQX9CFSlAXp-62Q":{"text":"Simple coffee shop.  Whatever roast they use is delicious. I ordered a cortado which was g","useful":1,"cool":1},"wG9xqROh7ViAxjzrZqaUng":{"text":"Cute li'l café that was very near our hotel. Good coffee. Nice and patient baristas. Try t","useful":0,"cool":0},"zlzmkzL0Alr-yxd3QGMquw":{"text":"Great little coffee shop in the French Quarter. Only tried the espresso but had two of tho","useful":0,"cool":0},"dG3SiUOyC48RH0WoL07WGw":{"text":"A little place but has a nice atmosphere. The baristas are very helpful for the novice cof","useful":0,"cool":1},"wMHY2v5oRbo3W6BnPWf0_w":{"text":"These guys really know what they're doing. Spitfire and HiVolt are my two favorite coffee ","useful":0,"cool":0},"x9zKUV4j1_RUD_ZLOEXcpg":{"text":"My husband and I always stop by Spitfire when we're in the quarter. These guys know what t","useful":1,"cool":1},"lEj1rnXIpsKQhA-Xw7RrnA":{"text":"Excellent, small, easy to miss place for serious espresso drinks!  Has an excellent cappuc","useful":0,"cool":0},"hJ3b9qqqkCiIuA0i9msIBQ":{"text":"We stumbled upon this little gem on our trip to NOLA last week and returned each morning u","useful":0,"cool":0},"Xb3_1q_CkTVxrOu6htdPlg":{"text":"Amazing little coffee shop near Bourbon Street. They prepare espresso drinks with precisio","useful":0,"cool":0},"st-twhJQMti0uQdfgLNpNw":{"text":"OK So I love the potential and the jury is out on the overall experience here as there is ","useful":0,"cool":0},"SBsIMmZ08a4XOuLlAy0fZA":{"text":"I wanted the most fru-fru coffee I could get my hands on and searched extensively to find ","useful":1,"cool":2},"Me0uMS3vaBdI3YgeYXU8JQ":{"text":"Cool little place. They have some interesting choices and the staff was very helpful. The ","useful":0,"cool":0},"HLM2kZyy80flC39c-liYIA":{"text":"Great place to get an espresso! This place is a great place to go for coffee. Good service","useful":0,"cool":0},"aLWK7O5j_N_pAHHxspEoFA":{"text":"I am so ecstatic this little shop opened up in my neighborhood. Their sign outside says \"s","useful":1,"cool":0},"yCrO2j6-bXoSpQeUSNsfDw":{"text":"Very good roast!After 2days of looking for a good coffee,this turned out to be the first o","useful":0,"cool":0},"cs9soz3QsQ9PWRivRtg3nQ":{"text":"Nice place in NOLA. In town for tales of the cocktail and was in need of some good special","useful":0,"cool":0},"FPnRuFQCCGkna3o5BNJqZw":{"text":"This here is a decent coffee shop. I wasn't super impressed by it, but it wasn't bad. The ","useful":0,"cool":0},"pbsjD8AbkHonLJ2Bar29Sw":{"text":"This shop came in clutch when I was having the need for some afternoon coffee after a long","useful":0,"cool":0},"wE-nX8TdZ5NtNF_67YBiTw":{"text":"I can see how the coffee enthusiast would love this spot. They do a pour over which takes ","useful":8,"cool":6},"gIV-BDPDuU6XMEhz-0cESA":{"text":"I'm always on the lookout for some good coffee. This was an okay place, nothing spectacula","useful":1,"cool":0},"POAeWOM7SEqdNM2adsDR0Q":{"text":"Had an espresso and a macchiato. Both were very good. The barista does it right...weighs e","useful":0,"cool":0},"tgJJIu_mon035UvM2OQGQQ":{"text":"Start you day off right and forget cafe du monde and go straight to Spitfire","useful":1,"cool":0},"bXwBfnluiY3clnVlKqrbow":{"text":"I wasn't expecting much from the coffee game in a touristy part of NOLA, but Spitfire Espr","useful":2,"cool":2},"ggsLuqeYgEMX0ij8h7pV2Q":{"text":"This was voted best coffee in New Orleans so, of course, I had to try it.  Absolutely lusc","useful":0,"cool":0},"1PaznA12iJ9zBQCK6_fpKQ":{"text":"Their Mexican vanilla latte was the best espresso drink I've ever had (and I've had one es","useful":1,"cool":0},"XLVEY4dlJVoNBO3bTL8OlQ":{"text":"Not sure what the hype is all about here. I got the Las Tres Flores and it was just ok. Ma","useful":4,"cool":3},"cWSc7puMp8RapeiBBEbcEg":{"text":"We saw two cockroaches roaming on the espresso machine. Tiny ones, but cockroaches neverth","useful":0,"cool":0},"pSIVqiZGRMHJN2rMYRcdcA":{"text":"Finally good coffee in New Orleans. This would stand up in Melbourne. Will deffo be back!","useful":2,"cool":1},"P3QtA7UxaPXU3wt1QP7v5A":{"text":"I wasn't all about this place. Maybe I was too hungover (...or still drunk?) and the baris","useful":0,"cool":0},"CNIdKTMiyhGEzVVK-C6Z5g":{"text":"This place is absolutely delicious.  The coffee is great and the baristas were wonderful a","useful":1,"cool":1},"LX-aBhdX6PIhaZnsWXflhQ":{"text":"This review is based on 4 trips to Spitfire during our recent visit to New Orleans.  Coffe","useful":0,"cool":0},"aFc0u5VrjK5k64vrB46tVA":{"text":"Cool hidden place, Chai was good, much better than I usually get.  Guys working were super","useful":0,"cool":0},"t-v9vwP5XAIiPT-FR1ecGQ":{"text":"Very simple/hipster coffee spot in the middle of French Quarter. I tried the Mexican vanil","useful":0,"cool":0},"7LFF6Un8XwRStpJrpwOHkw":{"text":"Looking for a legit coffee? This is your spot. I walked in as they were dialing in a new e","useful":0,"cool":0},"Ir8WK4j0bdpdiz8MxzzvBg":{"text":"If you are in the French Quarter...go here! This is not at all a far walk from much of the","useful":0,"cool":0},"dxQD9GAf2YwoeoPC6ed43w":{"text":"If your looking for a coffee shop where coffee is the main focus, this is the place to go!","useful":0,"cool":0},"OytXetM4QU3LC9p9quu0lQ":{"text":"It is shockingly hard to find solid coffee in or around the French quarter. A very big pro","useful":0,"cool":0},"V4abaM--hbPUMJwbF7zxag":{"text":"Great little coffee place hidden away.  Had a wonderful hellfire mocha, just the right amo","useful":0,"cool":0},"0OTpI5UnObFfbN7dMa5QjQ":{"text":"This was a great find while wandering through the French Quarter. The fresh roasted beans ","useful":0,"cool":0},"HfRdPcb_Jclw8OVkduK-jw":{"text":"Everything about this place is amazing, except the size of the inside. The coffee was good","useful":0,"cool":0},"hdTY9Ug912ECH-Xhsugaeg":{"text":"A totally surprise to find excellent coffee in NOLA!! I had kilenso pour over and was tota","useful":1,"cool":1},"3-7ag2Q_6jBA9ymVfDRWMw":{"text":"Great cold brew coffee! They have two options: a single origin and a blend. They also offe","useful":0,"cool":0},"hlKro69kRJOp7U5nBtEGSw":{"text":"Great coffee place. It is a small shop but the quality of coffee is just amazing. We got t","useful":0,"cool":0},"aq3fOotO3xPDQcrMPbUiWA":{"text":"These wonderful people are brilliant baristas. Made such wonderful cups of coffee. The fla","useful":0,"cool":0},"995Dj0V8J3VabGkUW30bEA":{"text":"Very nice people and very high quality coffee.  A selection of pour overs in addition to e","useful":0,"cool":0},"u-CXHxfzDezSeyWt01RJ8g":{"text":"Great little space for a respite from touring the city. Really really good coffee. And peo","useful":2,"cool":1},"5jjSnLCh3MUqkSDnLWEbow":{"text":"The worst service really bad. Coffee is insipid. The worst thing for a pseudo - barista is","useful":0,"cool":0},"Oqsbs6dkwjYqxMy4lLGOjA":{"text":"This is a hidden gem. It's quaint and quiet.  If you blink, you miss it. The employees are","useful":1,"cool":1},"K3tHLPUZydvOlb7D-5iaaw":{"text":"I came in to this quaint, charming coffee spot based on the Yelp reviews. I was going to b","useful":0,"cool":0},"T8UGr7ziVORvU8fR_mHNGA":{"text":"Spitfire was hands down my favorite coffee shop that I visited while in NOLA.  This shop w","useful":3,"cool":1},"x0rSkThUn-ctL4_A3iZB8Q":{"text":"Loved my drink! Cute and relaxed and right by Jackson. I needed coffee, they had coffee.","useful":0,"cool":0},"1Xoo1x_rTeH65uQKEDVnyA":{"text":"This place knows how to make a cup of coffee! The soy lattes we had were delicious. The pl","useful":0,"cool":0},"-cxjENImh9S358ixoxi54w":{"text":"Excellent coffee & tasty cappuccinos! No restrooms tho. Friendly staff. Quick service.","useful":1,"cool":0},"ae0A-yi6l75m4sSdlzUElQ":{"text":"Tiny shop but a great place for a fancy pick-me-up in the French Quarter. Since I needed t","useful":0,"cool":0},"0IiDp9_vVz4Cf6CXhSFkvA":{"text":"True definition of simple yet great! The coffee is very flavorful. Wonderful customer serv","useful":0,"cool":0},"d6zcLQGRQn5dgHjzMYNa0w":{"text":"Good espresso. Good cold brew. This is a bare bones specialty coffee shop with really soci","useful":3,"cool":2},"2o8fNTr1golS1GHF0faDTw":{"text":"Their espresso is soooo good! I got a macchiato which was presented beautifully and had a ","useful":0,"cool":0},"6fsjIJe1rb1fTRp4h6T7mQ":{"text":"Best smoothest coffee I've ever had. This is a small little hole in the wall. Only two peo","useful":0,"cool":0},"5G1VqTCKVHQRr-Gk65okqg":{"text":"For good espresso, pour overs, quality steamed milk, and a variety of featured coffee roas","useful":0,"cool":0},"SSBFau9DQrlL-OOSArDEOw":{"text":"I love a good pour over and this place is legit. Good single origin options that change da","useful":0,"cool":0},"SWIyE2haAy0WLTDmkey6XQ":{"text":"Cool vibe, friendly staff, delicious espresso. Extra points for having almond milk. Bummed","useful":0,"cool":0},"yOL1HpJ7sosSGoWY8oef9A":{"text":"Very small coffee shop in the middle of the busy French Quarter. Mexican vanilla is there ","useful":0,"cool":0},"1aZWGWoH0XCD006w7hOACA":{"text":"The latte here did not disappoint  no matter where you are, it's worth the walk to get a g","useful":0,"cool":0},"1hBXrNnC79aS4WRoEDqlQw":{"text":"I love the this coffee shop nestled in the French Quarter. No space for sitting but very k","useful":0,"cool":0},"kAHAnX4tzVqE5rsQLi1dVA":{"text":"Really cute, hipster coffee shop. Espresso drinks are made with a medium roast. Baristas d","useful":0,"cool":0},"vbbEteajOds_ckrJEX_vww":{"text":"Espresso is fine. The problem is that 2 members of what will soon be labeled as a domestic","useful":1,"cool":1},"ZNQYrr6FD84fp8f7e6qKGA":{"text":"Follow your nose to this gem. The reviews were on point, thank you fellow yelpers. We ente","useful":1,"cool":0},"nKHLGfd8Y_TyZDMyOBTjNg":{"text":"Delicious coffee and super nice barista.  This is a tiny place so be prepared to get and g","useful":0,"cool":0},"HdEj1Q7IFU4sffqxyC3oDg":{"text":"Ok coffee. \nSort of rude service. \n\nNo WiFi. \nNo toilet. \n\nThat sorts of summarizes my imp","useful":5,"cool":2},"xGigEzXziquNAOPcyFTeWQ":{"text":"Precisely made ande delicious. It was evident from the way the barista was measuring and m","useful":0,"cool":0},"N70PvORXMN7dWEesA-k4dA":{"text":"Stopped into this tiny shop twice over a long weekend trip, which goes to show how much I ","useful":2,"cool":2},"LTkHQEpeUu_x8NBJGz-gIg":{"text":"Such a great spot tucked away near Jackson Square! I found this place through a Bon Appeti","useful":0,"cool":0},"nnOMzz1pvXmLN-FmwLgoMg":{"text":"I had the Las Tres Flores and it tastes like a little cup of heaven! Undoubtedly, the best","useful":1,"cool":0},"9QeFb6C8jC3aY-qzH9MPCw":{"text":"Spitfire makes my favorite espresso in New Orleans. This is an adorable little coffee shop","useful":1,"cool":2},"6vSb_FdTqiD13-ZMA8PoYg":{"text":"We took a break from all the walking and sat down for a cold brew. It's a hole in the wall","useful":1,"cool":1},"9zih2umVPavvzS-UcoMo_A":{"text":"Spitfire is a great spot for a local coffee shop vibe in the middle of NOLA. It's a small ","useful":0,"cool":0},"Ok9eG6y_xZ-7IYv8-kf1ag":{"text":"Awesome coffee. I love how they are focused on getting it right...serious about their prod","useful":0,"cool":0},"qhhu_LJJ1e51emm970xGCw":{"text":"Small place in the heart of it all! I loved my drink (iced las tres flores).  Nice, floral","useful":3,"cool":2},"5FQL9QjZ1osPvBbcye1R8A":{"text":"I'm really torn in the stars to give because the coffee was GREAT but the service was disa","useful":1,"cool":0},"hwdvhN6GL-DKhXM_-sPXZQ":{"text":"This is the best place for coffee and espresso in the French Quarter.  Although there are ","useful":3,"cool":0},"xskNZB2GvL2Z6PJFwXdeAQ":{"text":"This place was awesome :) single origin espresso and a fantastic selection of pour overs. ","useful":0,"cool":0},"OtlEvbfSljVbEgou34Oksw":{"text":"A hidden gem that is easy to miss if you're not on the look out but easily the best coffee","useful":0,"cool":0},"FqgHVR7zeLqzE495ETfnyg":{"text":"Wasn't easy to find but worth the hunt. Service was friendly and helpful, interpreting our","useful":2,"cool":1},"NAP9I2TpVfjz321-wFSg3A":{"text":"Excellent cappuccino- making it my morning stop whilst visiting for weekend. Small place a","useful":0,"cool":0},"7V-qseoqHrlSHZcENXibbw":{"text":"Excellent espresso drinks in a tiny little entry space. It's a to-go spot, not a hangout, ","useful":0,"cool":0},"s2wvqgJJxBVaNZI4r3EX3Q":{"text":"It's delicious and unique coffee. I ordered their signature one, Les Tros Flores. The tast","useful":0,"cool":0},"Ac9Ao8sDiOavrw-GIfcqJA":{"text":"Small authentic coffee espresso shop in the heart of the French quarters. Just coffee and ","useful":0,"cool":0},"IB0UqpjD2lvWj3T7uCFkIQ":{"text":"My go-to shop in the French Quarter. Super willing to direct me to other coffee shops in t","useful":1,"cool":1},"x6yT3W4niJRzQKB4nfV2jQ":{"text":"High quality coffee! Friendly service. Would be a treasure for coffee connoisseurs in the ","useful":0,"cool":0},"-dxeQ74wWJupsWI763L6ZQ":{"text":"Spitfire was great. I had a cold brew and it was definitely quality. Wish they had skim mi","useful":1,"cool":0},"msDN7B3HNah3kVGXX7vcZg":{"text":"Who would have thought one would find this gem in the heart of the quarter. Don't tell any","useful":1,"cool":1},"NWhlmEstVNFu8JKZFpNGgw":{"text":"Calling all purist coffee drinkers- this is seriously the BEST ESPRESSO BAR for you in New","useful":14,"cool":11},"ekRfG0dqcltP16h94pj19w":{"text":"This place is the opposite of Cafe du Monde. Small, quiet, with excellent espresso. I'm no","useful":0,"cool":0},"WkUCKKhLnA2uLY-8rgWBow":{"text":"Spitfire is a very cute little espresso shop, but not a great place to stop and linger. Th","useful":0,"cool":0},"BBPx0_Rp9y_nIbzOKpzwPg":{"text":"This small, unpretentious coffee bar is fantastic.  I love my coffee and their cappuccino ","useful":0,"cool":0},"1y_ib5HEoxdlzFL7EH3Epw":{"text":"The Spot is a hidden tiny coffee shop with great coffee. I had Las tres Flores and it was ","useful":0,"cool":0},"DSeHyCpb3F1B_84JRLAgiw":{"text":"Located right off Jackson Square, it's a little hole in the wall that I'm glad we found! W","useful":1,"cool":1},"go1YjKdHQWAzjRvE97KUNA":{"text":"I ordered the Las Tre Flores and it was beyond amazing! You can decipher the floral tastes","useful":0,"cool":0},"8r4aFZtu4ZUxh4dmom1vIg":{"text":"Came here because they had 4.5 stars. Amazing coffee but very rude employees. Walked in, n","useful":0,"cool":0},"rToZ7M3bTGlgUl6wytOaWA":{"text":"The smoothest, most delicious coffee in the French Quarter so far. A warm welcome was made","useful":1,"cool":0},"iH4U4WvNxwjjOQeg_hi1Bw":{"text":"If you want cutesy New Orleans ambience, this isn't your place, but if you want an excelle","useful":0,"cool":0},"kxafnD4j4d0XDT9bCH5Syg":{"text":"Cute little coffee shop with quality coffee drinks!\n\nMy friends and I stumbled upon this q","useful":0,"cool":1},"GzOMUIQ3_ren-lAGNRGLng":{"text":"This might be the best coffee in New Orleans. Surprising for the heart of the FQ, where me","useful":11,"cool":7},"32uRVLc_lGRZf33OTfZbaQ":{"text":"Ok, starting from entering the place,, there was 3 (1 lady and 2 guys) Staff when we walke","useful":1,"cool":1},"ETF7zVBZbMqOFk_DdeZunA":{"text":"I love Spitfire! I visit every time I'm in the quarter! The coffee drinks are so elegantly","useful":0,"cool":0},"43g-8zmIXwOBgyAHeb8egg":{"text":"Stopped in here to charge our phones and grab a lil coffee and as we only had **18 hours**","useful":0,"cool":0},"l9yiMaoygF6mxkZiF_PZtw":{"text":"Visiting New Orleans and was craving some local coffee. I tried the Las Tres Flores and WO","useful":0,"cool":0},"woNTG3rk8diD-fINVSZV-A":{"text":"Spitfire espresso bar is one of the unique finds in the French quarter of New Orleans. The","useful":1,"cool":0},"hqN4y2yg8w42AfgUQLM0rw":{"text":"Great little coffee shop.  The only milk choice was whole and a few non-dairy-- no almond ","useful":0,"cool":0},"LNEb9EZRKGdRzVz7LTaMzA":{"text":"If you find yourself in the French Quarter and want some strong, delicious coffee to go, t","useful":0,"cool":0},"kVmP-Ntv4IXjmeuNaqNJig":{"text":"Standing room only inside this coffee shop but they certainly know what they're doing and ","useful":1,"cool":0},"DC8tXvPXBaKraxp3almm9A":{"text":"Amazing espresso! Friendly staff! Just no seating for those looking to sit and chill.","useful":0,"cool":0},"wuFcEEr1BgtO7nPO1p1wvA":{"text":"It was ok... the Tres Flores taste like grandmas perfume and the Mexican latte taste lIke ","useful":0,"cool":0},"wTmjl237I0-iqhy8strk6Q":{"text":"I'll be the first to admit that I'm a coffee snob. This place is the real deal and their d","useful":2,"cool":2},"tOiQrGHpKxOM35wDdIOX9g":{"text":"Yeah I love this place.\n\nI have gone to the French Quarter only to go here. \n\nYeah I only ","useful":0,"cool":1},"859tgocIwkZtb4fCAE6wrg":{"text":"Cute place but the cortado is not a Cuban cortado. Growing up in S. FL it missed the sweet","useful":0,"cool":0},"a7SiVhVhhIOEtjIzN1iClA":{"text":"This coffee shop is super small. Once you walk in, that is where the register and the coff","useful":2,"cool":1},"WS1p7HAhK5_1nNHxE1SDAg":{"text":"Awesome place! They have unique coffees, super friendly baristas, and house-made syrups. I","useful":2,"cool":0},"zxCYrFPyChuAyyS5TkhSyA":{"text":"I visited Spitfire for the first time over three years ago and I STILL think about the cof","useful":0,"cool":0},"Dp92_YAqbS5vOd4yJELTjQ":{"text":"Small place with excellent coffees.  If it's busy you won't find a place to sit.  If it's ","useful":3,"cool":2},"kvpM_KcTU96XUSxEx5nEog":{"text":"Cute little shop off Jackson square. The las tres flores drink appears to be the star drin","useful":0,"cool":0},"HLK2E8HGpqPGErKRhKSfLA":{"text":"A hidden gem in the Quarter! I love popping in on a work break to grab an iced coffee. The","useful":0,"cool":0},"bvdvGfKk_RQ8T3swMo6bRQ":{"text":"To get to the point it was a decent place. The customer service needed work. Twice I tried","useful":0,"cool":0},"QnVE4aYomxmhLWe9TDOliA":{"text":"Cute, intimate coffee shop in the French Quarter - aka, a must-try especially if you're a ","useful":4,"cool":3},"VgMGFmD54Fx9Rpn1ucozNg":{"text":"Came here right before my flight out of New Orleans for a little pick me up and this place","useful":1,"cool":1},"VbaGeCbpnxXxquhRk1ueYw":{"text":"We wanted to try a good coffee place and this came across us when searching yelp near our ","useful":0,"cool":0},"YqAE_WCCE_bK3qNf2UU0Iw":{"text":"Great coffee! Kinda a wait because the place is super tiny. But you can tell it's quality ","useful":0,"cool":0},"CogzLcSQKP2FnXnkLyeMTA":{"text":"6/2/15: BUT I HAVEN'T BEEN BACK!\nThere are way too many better seating areas in the area n","useful":4,"cool":2},"hkmWqk4KEXxGGv3eahqm3g":{"text":"Super tiny coffee shop in NOLA, it was well recommended by a friend so we decided to stop ","useful":0,"cool":0},"I3QObt25MWIvT-y6wKkt8w":{"text":"Get the tres Flores latte, it will blow your mind. Best specialty latte I've ever tasted. ","useful":0,"cool":0},"RzwS-FXFCqDhfmd_TuFcDg":{"text":"The worst service, really bad. Coffee is insipid. The worst thing for a pseudo - barista i","useful":0,"cool":0},"wSLEhD6TnUXJwPV7StJ8tw":{"text":"Great coffee shop in the French Quarter.  Baristas know their stuff and make great drinks.","useful":1,"cool":1},"N9N3MeC_orZdqtAE-iCs-g":{"text":"Latte was flavorless with no body. Service was not terrible but not good. I would suggest ","useful":0,"cool":0},"Ay32TQQhKuK7WGl8G1qWRA":{"text":"Teeny tiny, legit coffee shop tucked away from all of the crazy. We popped in for a pick m","useful":3,"cool":0},"r3RDZ3KDfceMgTSm8eeg2g":{"text":"Probably the best coffee we had while in New Orleans. The place is small, don't come here ","useful":6,"cool":5},"o4xoBqnthj17HgJCwVgEeg":{"text":"Las tres Flores - different, tasted like jasmine coffee to me didn't really taste the lave","useful":1,"cool":0},"NKmgPUoZLCUX52N7g7OEFw":{"text":"Who knew such a tiny shop had such a big following. When I found the place on Yelp, I assu","useful":0,"cool":0},"4F-TbBDxyu1-CEzHnsLm5A":{"text":"Made a quick stop here for some real coffee after a short walk from Cafe Du Monde. Spitfir","useful":2,"cool":3},"eDPzRWCu3_1Y-Lo_WimdvA":{"text":"Wonderful coffee made by nice folks.  More of a to go place but they have a handful of sto","useful":0,"cool":0},"791b8KfejOOf7RJafq3esQ":{"text":"Four stars this visit for the dude working here's attitude, the coffee is delicious and fr","useful":3,"cool":3},"qugMoLZBgu9iwDcfpnRKLg":{"text":"During our trip to NOLA, Spitfire was our go-to for coffee. We tried another cafe and it w","useful":7,"cool":6},"H0hRqEbeh1NJTvAgJbps-A":{"text":"Every day in New Orleans 2020. \nVisiting town for official Mardi Gras business. \nGreat noo","useful":0,"cool":0},"RMQFNaVXpUYkxMyfzE5SGQ":{"text":"Friends and I stopped by Spitfire for a short coffee break/escape from the July heat after","useful":0,"cool":1},"cdR0egDoA8fpAp_AqrnfdQ":{"text":"Very fun and quirky coffee shop in the French Quarter. They have great coffee and unique s","useful":0,"cool":0},"QeD8TXM07VWQI5y1lp3SHQ":{"text":"Best coffee in New Orleans! If you are looking for an alternative to the traditional chico","useful":0,"cool":0},"5CsE5JGpkweKxthh6lrBpw":{"text":"I would have given this place five star, but unfortunately the place was so tiny inside an","useful":0,"cool":0},"7BE4Cq00t4nkcAA7bZ3Iug":{"text":"Two years ago, I sardine-tinned myself between the counter and the door five feet away in ","useful":1,"cool":0},"E4WKdWH5_G8VVmpCVlGuPg":{"text":"This place is frequently voted \nBest coffee in the Quarter,\nThe Spitfire Espresso bar. \nA ","useful":13,"cool":12},"eyv80n7IQMyc6JFsQnTdmA":{"text":"The best coffee spot in the French Quarter, if not in town! These people know their stuff.","useful":1,"cool":1},"K69CUPYfybjazG_nv4htww":{"text":"This place is tiny, simple, and makes a good cappuccino. I stopped in while walking around","useful":1,"cool":1},"aCGeBx2JQyg99AvW6X75gA":{"text":"Just a hole in the wall with hipster dudes making great coffee. \n\nDon't get me wrong his p","useful":3,"cool":2},"o_nMjM7us869ZU2PxYjB8Q":{"text":"Awesome quality coffee. If your looking for a good quality cup, skip the typical busy plac","useful":0,"cool":0},"SJCnviBYraSr-OF_29xxgg":{"text":"This place is about the size of a closet, but let me tell you, they might have the best co","useful":2,"cool":3},"HexrayM83n6OTtnx-ve0tQ":{"text":"Friendly. Fast. Fresh. I got the iced cold brew. No cream/no sugar. Delicious nutty taste.","useful":0,"cool":0},"I-biqy53nr_R4O_s-Y6sWQ":{"text":"nice place nice people nice A/C (which was important that HOT afternoon). easy stop by qui","useful":1,"cool":2},"5hWljvTiUriSm4Lvdkuxhg":{"text":"Awesome coffee shop in New Orlean's French Quarter! Small enough to be cozy, but not big e","useful":1,"cool":1},"xAcd49mvXq1Xq1LUxHo2Ow":{"text":"i'm so sorry but i did NOT like this coffee shop!!!! bad coffee, smelled weird, & no seati","useful":0,"cool":0},"O2_i_Z_iRN5OFASdoiUGHg":{"text":"After a most unpleasant experience trying the horrendous chickory coffee that's so popular","useful":8,"cool":6},"jr7p22ETJ1tqykCZ8HWekw":{"text":"While waiting for my walking tour of the French Quarter to begin, I had an hour or two to ","useful":49,"cool":51},"PTmuXDa_tGXd85ugEVcE2A":{"text":"Cool little coffee shop in the middle of the French Quarter that serves hand drip coffee. ","useful":0,"cool":0},"CZAAZmST9pDeqWl74Kd4Fw":{"text":"Spitfire saved me after an unfortunate bitter/burnt coffee experience earlier that morning","useful":1,"cool":2},"lrWGZOEjLtLirEq7uc4vVg":{"text":"My favorite NOLA treat! The coffee is unreal...it's as gourmet as it gets and so spectacul","useful":0,"cool":0},"WfPx5MxmdJnPFy_UFAn3-w":{"text":"This is a cute little coffee shop that only has four (4) seats at a counter. They do not h","useful":5,"cool":6},"zNtP9HU9AzmPUsKACYTPyw":{"text":"Great coffee in the French Quarter. Once we found this place we made a point of stopping b","useful":1,"cool":1},"HlPc7qDaRVSjxAcXL0SJgQ":{"text":"Cute little coffee shop in the French quarter. I've never been pre COVID but at the end of","useful":2,"cool":1},"W3M_SwPM9CKyhYcoW0Wk0w":{"text":"I'm not a coffee snob but I know what I like. \"Cassie, what do you like?\" you ask? Well, l","useful":11,"cool":11},"YTX_sFgMzB1XdhxkP33EpA":{"text":"Ordered two of the Mexican hot chocolate iced coffees. Very tasty and friendly customer se","useful":0,"cool":0},"I-9ylUP2ylAuNfShQFUwKQ":{"text":"Excellent coffee!   Very quiet place, as well-   which is perfect for us introverts!   We ","useful":0,"cool":0},"qJ84iyg5poMWY3U2d14oeQ":{"text":"Wow, this is a true hidden coffee gem in the French quarters! A hole in the wall for sure.","useful":2,"cool":0},"1YWF3O7WFHuFGMi-VjtIKA":{"text":"Delicious cold brew served up by Tatianna was exactly what I needed to keep exploring the ","useful":0,"cool":0},"NRaKgLNTB_caXpdEZgcoCg":{"text":"What can I say, I will literally be dreaming of summer moon until the day I can return. I ","useful":0,"cool":0},"5S7Sq-4cC1TLI7aGjbEtDQ":{"text":"Needed a quick caffeine recharge and stumbled across this walk-up coffee shop. Just steps ","useful":0,"cool":0},"kRlN4lu2HVdGhQsa-ntJCA":{"text":"My son told me I \"had to go to spitfire\" if I wanted the best coffee in New Orleans. Man i","useful":0,"cool":0},"dbK7baCB5f21VZS_fLiKGQ":{"text":"Amazing coffee, friendly barista, wonderful environment. Overall great coffee stop for a m","useful":0,"cool":0},"pQASCP0Urv_SU-2bmVRUXQ":{"text":"This was a cute little window pickup coffee shop in the French quarter. There was only one","useful":1,"cool":0},"0EoO8bbxYe-nTU7hTXXOHg":{"text":"They didn't have decaf as they were out most likely due to covid and trying to keep up wit","useful":5,"cool":4},"OAi9CmEMtcA5_62mriwEOA":{"text":"After stopping into Cafe Du Monde for the obligatory chicory coffee and beignets we walked","useful":0,"cool":0},"89JICquTkd-nDWnVmwszfA":{"text":"No better coffee in New Orleans. Hand's down the best latte in the city, made even better ","useful":0,"cool":0},"LM8ZjaC0IEMQK4nawg0fJQ":{"text":"This review is from a late night on a Monday, just as Spitfire was about to close in Octob","useful":0,"cool":2},"4qqnZM0Ekpm1NsQ2w979Rw":{"text":"I seriously can't get over the flores coffee I had it was so amazing. \n\nThe place is a lit","useful":1,"cool":0},"4RXaBxdcm6p5pfYy-YH8ng":{"text":"Cortado was decent. \n\nThis is a hole in the wall coffee shop, and though I enjoy supportin","useful":18,"cool":15},"PyzqGoJ6yeXmxAMfkmcg-Q":{"text":"Like many establishments in the quarter, stroll too quickly... You might stroll right past","useful":8,"cool":3},"ZNaDAys2TH_yx7uJZyzqoA":{"text":"Coffee.  Just coffee.  Really good coffee.\n\nIf you're in the Quarter and looking for a pla","useful":5,"cool":2},"5CblGM_lAwffJ8hCApRtMg":{"text":"The Las Tres Flores was incredible. Seriously, best espresso drink I've ever had. Perfect ","useful":1,"cool":0},"jwJoDxSB6LvvM5AL0b50JQ":{"text":"Their Mexican vanilla latte is amazing! You can walk up only right now, and people in line","useful":0,"cool":1},"R2AVZqPn6OxLdc4clYJZmQ":{"text":"Amazing pick-me-up latte after drinking and dancing all night and walking around all day l","useful":1,"cool":2},"Cvo_eNOkRFPgplJVSdA7zQ":{"text":"Spent half a day driving around the city with a buddy trying out all the well-known local ","useful":0,"cool":0},"1_b5_Tdu6SdJyakfGJDqZA":{"text":"Super tasty oat milk chai that they make themselves. Very accommodating as I called my bet","useful":0,"cool":0},"VFyprnGohlR5Dz6qUqwIBA":{"text":"Try the Mexican Vanilla Latte! A MUST\nThey are following covid protocol and make it easier","useful":2,"cool":1},"ZAiHkRre27C8ZLcIsKEQqw":{"text":"I'm a bit of a coffee snub and I found it the coffee amazing. I had cappuccino the three d","useful":0,"cool":0},"vRMA3v1L0BGDFNRoY6BTYA":{"text":"Clean, third wave espresso bar in the heart of the French Quarter! No gimmicks or pretensi","useful":1,"cool":1},"d3T227VAsyJTAxoa5hAO1w":{"text":"Coffee was pricey for what you got. Nothing special in my opinion. Had the vanilla latte a","useful":0,"cool":0},"ei8NfYJVbNEAZ3IMe5dgOg":{"text":"Super friendly staff, helped us make a choice on their more exotic concoction, the spitfir","useful":0,"cool":0},"YQwHs1ywXK5wreSOyHEGcQ":{"text":"Stumbled across this by accident not  looking at Yelp I was excited to end up at such a gr","useful":1,"cool":0},"6_fDQQJk97CdMdnxMiH-7w":{"text":"Delicious coffee. Loved the Mexican latte.  Friendly staff. Excellent service.  Great loca","useful":0,"cool":0},"M_7wDBufXzY_YlB6XhYcLg":{"text":"I loved this place. I wish they would move to Chicago and open one! This is a small side s","useful":1,"cool":0},"Id7uSCNvJMZAVQowODpFZQ":{"text":"I was beyond excited to try this coffee spot due to the high ratings. But upon arrival I w","useful":3,"cool":0},"bz8AXdx9_exX54uB4FbD2g":{"text":"Great place to hang out! I am such a huge fan of their iced mocha. It gives me a different","useful":0,"cool":0},"jce0wMeXa4U57t0wVt-BPw":{"text":"This place was recommended by our tour guide and it did not disappoint. Loved it so much c","useful":1,"cool":1},"UYJmT8ghOoUPWn2XYm0B3Q":{"text":"5 stars all the way.. amazing flavors in my Mexican vanilla latte. Very much worth a visit","useful":2,"cool":0},"W9r1nztHuT_0ILVN2Un0hA":{"text":"Great very small coffee only spot todays visit. Really good Americano drunk. Thanks folks.","useful":0,"cool":0},"DhrWPunyOpIt29mrUOsOjA":{"text":"AMAZING!!! Mexican vanilla latte was one of the best coffees. So flavorful but not too swe","useful":0,"cool":0},"k7mbkbgs7xh7cgE6VUD_0Q":{"text":"This is a great little local coffee shop right in the French quarter. At first, we walked ","useful":0,"cool":0},"SC06LJpscFmiSd2pJTgEHw":{"text":"My friends and I came in one afternoon all thanks to a local who recommended this coffee s","useful":0,"cool":0},"uvw6tWPRE8bP1VNYGchF3A":{"text":"I have to admit I am a bit of a coffee snob. So with that being said I really did not want","useful":0,"cool":0},"ldNO5vlhtl_69TVIsXHuJg":{"text":"Great tiny and quaint coffee shop in the French Quarter! I really enjoyed the iced latte I","useful":1,"cool":1},"28BefGpErluFZbC_SoUftg":{"text":"Loved the variety of coffee. The Mexican Latte was very good - a little sweeter than I nor","useful":3,"cool":3},"JxlA1vg91YDppdbp8dpdQw":{"text":"The shop is pretty small and has limited seating of 4-5 stools. Overall mood was friendly ","useful":3,"cool":0},"QqPAf5lhQuo9zo5M0TtQRg":{"text":"Hand crafted espresso bar located in the French Quarters near Jackson Square. \n\nDrinks tak","useful":2,"cool":1},"07kf9gSZckv4CN1irOQlTQ":{"text":"Just got back from a trip to NOLA and have to say this is the best coffee I've ever tasted","useful":0,"cool":0},"4S_ROJSlPIwqPJ3raLNxQg":{"text":"Not our cup of tea...it's no bigger than a bathroom.Our hotel recommended this place for a","useful":0,"cool":0},"rpYPjSlmi53rkGBsw3aHMA":{"text":"The drinks here are divine, but it's pretty much exclusively a to-go spot, which I hadn't ","useful":3,"cool":5},"HvMcqAgksFE2He_h3XqA3A":{"text":"My friend and I passed this coffee shop a few times before we figured out where it was. Th","useful":0,"cool":0},"obAxLYJ-2FTu0Eij70czrg":{"text":"This place was a little hole in the wall, but clean and cozy inside.\nThe dudes were super ","useful":0,"cool":0},"AJVw3bLmbKafBAqkf4aqVw":{"text":"This tiny coffee spot pulls excellent shots of espresso and knows how to create the perfec","useful":0,"cool":0},"wyBt3wH8Y_ue_poIWyjqog":{"text":"My husband and I wandered about the French quarter one cold morning. On our way to Congo S","useful":43,"cool":46},"WaSWnCu61ezID6pN7p9YyQ":{"text":"Update: after reading all of the rave reviews here, I felt convinced my bad latte yesterda","useful":0,"cool":0},"Bc_bhNYhK3QZ945bYPQTKA":{"text":"My fav thing to do while going to new cities is find the cocktail bars and coffee spots. T","useful":0,"cool":0},"AuOYHT9Giwq7UiuO-hTirA":{"text":"A nice hole in the wall coffee bar in New Orleans! The place may be hard to find and a sea","useful":0,"cool":1},"9kfsavv0-1vJ4gP1_Qo28Q":{"text":"This tiny coffee spot pulls excellent shots of espresso and knows how to create the perfec","useful":0,"cool":0},"ZcBMOq1zg_93Xr0yAxIL1w":{"text":"LOVED my latte! Even bought some to take home. Very pleasantly treated by the barista. It'","useful":0,"cool":0},"fWyKQE3o8rTkPZmDG3IQsw":{"text":"I am not a coffee drinker myself...but I take all my coffee-loving visitors to Spitfire. T","useful":1,"cool":1},"e7Im9o9kRA2fnV_UOpWMWA":{"text":"Great coffee.  Smooth roasted. Room to sit is nice and cozy.   Definitely recommend as a s","useful":0,"cool":0},"-vqQyIwKMw8uh2xdzCREWA":{"text":"After Cafe Du Monde we needed a proper coffee drink. Spitfire has a perfectly curated bean","useful":0,"cool":0},"aKWWongLkyL4U69GhpCc3Q":{"text":"I want to give this place their flowers. They make coffee the right way. Weigh the portafi","useful":0,"cool":0},"I2f5Jasn93PHMvs8INwh5w":{"text":"Solid iced latte.  Order at the window to go only.  Nothing great nothing bad.  Would come","useful":0,"cool":0},"GJ48cD4jKoqVpj3dubI8sQ":{"text":"There are only a few decent coffee shops in the French Quarter, and Spitfire Espresso Bar ","useful":2,"cool":1},"_mEmHnbjpJy0Usb4PBwbzQ":{"text":"The San Francisco characteristic in both my fiance and I told us to go find an amazing cof","useful":3,"cool":0},"QkkYxRKkDBnWRnSIVqkJ7w":{"text":"This is such a cute little coffee shop in the middle of the French Quarter! I chose the La","useful":1,"cool":0},"cCo0mOYrNRUtO6fW35meMg":{"text":"Teeny tiny coffee shop right on St. Peter in French Quarter. Two guys behind the counter--","useful":1,"cool":0},"7CAqicG3w9w-u6xkPEycLw":{"text":"Great spot for quick coffee to go before chilling by St. Petersburg park ! Friendly servic","useful":1,"cool":0},"4qUq9pp0r-HocHB9HIaYhQ":{"text":"Best local coffee shop in the Quarter, hands-down. Everything about Spitfire is perfect, w","useful":1,"cool":0}}