{"kUtVs1R2DZ0o14eTOvSRzg":{"text":"I cannot believe that I haven't reviewed Urban Roots yet.\n\nI love Urban Roots!  I always f","useful":5,"cool":2},"B56WU66IzFGVaQUvnEUbzA":{"text":"My roommate wanted to start her balcony garden and we kept driving by here on the way back","useful":1,"cool":1},"p8VUs7ZioAfBlz5c2L1LrA":{"text":"Fantastic! Not only is the location super trendy and convenient, but the quality of the pl","useful":1,"cool":0},"NTUMi5-VxD_2IHmiNGSvHQ":{"text":"Urban Roots is a model for how neighborhood businesses should be.  Sure, it's a bit more e","useful":0,"cool":0},"QJBJm60z27uFvQMTZzg-2A":{"text":"I love this place and every time i walk in the door and i see all the air plants i go craz","useful":0,"cool":0},"ZXdrRqILcGbMUXvZjRVtnw":{"text":"I'm horrible at gardening - everything I have ever tried to grow has died. However, when w","useful":1,"cool":0},"w7VMLsrF9At5DYsreqQhWA":{"text":"I was a bit late getting to this event and scored one of the last succulents. \n\nThe garden","useful":2,"cool":2},"CPaiSCsCm9cFL6Q09fWQcg":{"text":"I finally decided to check this place out after a trip to a nameless big box home store ga","useful":2,"cool":1},"Wk-icv9JOSDE84rgC8F2yw":{"text":"Love this place!! The staff is very friendly and helpful. Met all the animals,  chickens, ","useful":0,"cool":0},"iLdX2ni3osYgMVzXdYABlw":{"text":"Wow!  This place is full of reasonably priced plants in great condition with exceptionally","useful":2,"cool":0},"Yx6gvLLuAHWk02X4mn6bKw":{"text":"Obsessed with this place. They have amazing plants and very reasonable prices and they hav","useful":0,"cool":0},"IVH17YTC2maK5CbjiQr_Cg":{"text":"Came here wanting to get started with a small vegetable garden with no idea how to get sta","useful":3,"cool":0},"lL0_OnZW0DStwAm6mlPlgQ":{"text":"A breath of fresh air, minutes from the Warehouse district. We put together an urban garde","useful":2,"cool":0},"JXbeS3ZZdLsXUIOkk53r9g":{"text":"Super helpful staff, well organized & very good prices. Plus, the signage helps identify t","useful":1,"cool":0},"vkfg5CU24QCGvEWWLJxjDQ":{"text":"I drive past a whole lot of plant and garden places to get to this one.  I really like the","useful":1,"cool":0},"-2FPDterNkYItp78MiCsTA":{"text":"I happily stumbled upon this place while driving by! I had no idea what it was before! I a","useful":0,"cool":0},"RK7dAcItw_6vAAlttlDlPg":{"text":"Not only were they really knowledgable, they custom potted a beautiful planter, helped me ","useful":0,"cool":0},"C6iAkypXWioB0qrtKQZs3g":{"text":"I had a really great time at this garden party.  Urban Roots is where I go to refresh my h","useful":2,"cool":2},"BzVIM6NrlUEIqmVkZJOBWw":{"text":"Just opened about a month ago-- so far a limited selection, but everything looked healthy ","useful":3,"cool":1},"mlt3vgjrt-oEGjz6xtdE2Q":{"text":"This is definitely the best nursery I've been to. They are all so helpful there, the plant","useful":0,"cool":0},"G88v7q-tBO5nDuYKIfg6tQ":{"text":"This garden center really is as good as it gets!  The staff is knowledgable and accommodat","useful":5,"cool":4},"HY3K2ZtvXD0uhdFmgjDhGw":{"text":"Great selection, beautiful. The orchid I bought in November still has blooms and its April","useful":1,"cool":0},"T4RB99G5agHqulLs6nFePg":{"text":"This review might not be great for flower enthusiasts, but for people that can't tell the ","useful":4,"cool":3},"my6bLgejFn2MYsdoG9qrOw":{"text":"This is my candy store!\nStaff is always awesome to deal with.\n\nWhy would anyone buy plants","useful":1,"cool":0},"OUMQPVjIpGUTq7ZEzSE7XQ":{"text":"I don't normally post reviews, but I just had such a great experience at Urban Roots that ","useful":1,"cool":1},"tSRKeqLVFvejCUNbpi0zqw":{"text":"This is one of my favorite places to visit in New Orleans. I have a slight... alright more","useful":0,"cool":0},"Bp_MAatM8ggUCYosBpAMaQ":{"text":"I'm in love with this place! Everyone there is amazingly helpful and friendly. They always","useful":0,"cool":0},"QWuEhnCDVwyPpZ-FLjfhrA":{"text":"So happy this local place exists. The variety  and knowledge of native and pollinator-attr","useful":2,"cool":0},"UrEv1briICUQwQ5-Un58mQ":{"text":"This was the best experience I've ever had at a nursery. The owner, Matt showed my girlfri","useful":1,"cool":1},"BFnrWPJVISkzCQyEsf8QpQ":{"text":"I've driven by Urban Roots a thousand times but paid the shop my first visit today. I will","useful":0,"cool":0},"rlR6zuMB_949Rgi5kd4WZA":{"text":"I love the animals! The prices are great! Second time here and love the orchids here! Woul","useful":0,"cool":0},"ianPDRuPongaqrQtB57FNw":{"text":"What an charmingly beautiful garden store and nursery! My boyfriend and I are visiting fro","useful":2,"cool":2},"_S5aBxXOKB-m59e2kgr18Q":{"text":"I went to Urban Roots today for the first time to check out their succulent and cactus sal","useful":1,"cool":1},"9dAlaPB-0F4aqLSZZ2MACw":{"text":"This place is the cutest! Duckies wandering around, bunnies & piggies to pet. ALL of the c","useful":1,"cool":1},"EqNTZupQJWz96zCqdSEVKQ":{"text":"One of my favorite stops during our entire New Orleans trip! The selection of plants was u","useful":0,"cool":0},"p1h-Lp82-iCLviqIFr2mcw":{"text":"Huge place, eclectic feel, but great plants, herbs, and anything related.  The people are ","useful":0,"cool":0},"DyQDGKmTmi8OP0BvgAwpnw":{"text":"This was the best nursery I have been to yet! Great fair prices, a good selection, and bes","useful":0,"cool":0},"Vw-RxMgyVOwYmm0mUvd9wQ":{"text":"What a great small business! Staff is incredibly helpful and knowledgable about gardening.","useful":1,"cool":1},"ktF6kSn6qt9cdQS15bUN9A":{"text":"The best nursery in town. Well stocked. Great assortment and reasonable prices. The best p","useful":0,"cool":0},"Xh_LF4lxkYmUbxntm7lmmg":{"text":"Sales rep provide great customer service.\n\nI came in with ideas but no plan. The sales rep","useful":1,"cool":0},"sdO6xkPFn-0-_u_SDMaWYg":{"text":"Pretty awesome little place right on Tchoup. Helpful, friendly staff will help you find (a","useful":6,"cool":3},"P-QKXQn_XfRhQtZM2Gy-tg":{"text":"I love supporting a neighborhood business, especially one compassionate towards animals. I","useful":0,"cool":0},"5Gkjg_Yv0db1gyZNOSvTrQ":{"text":"This place is so well kept and organized. The walkways can be a little narrow because ther","useful":1,"cool":1},"j-s4WEuUyeyDjV9xmuyQMQ":{"text":"Was looking forward to supporting a local business and picking up some new indoor plants. ","useful":0,"cool":0},"hWqlcuANE0IR6TR0nl_jPw":{"text":"helpful staff + good selection of plants = great garden shop in the garden district\n\nI wen","useful":3,"cool":1},"KQpoO5l_x3QxLgd9nUv8-Q":{"text":"What would I do without these people? I have a black thumb but always wanted to learn to g","useful":0,"cool":0},"sxJqnTc5puSyR1lZCfL0jA":{"text":"Great selection of plants for very reasonable prices!  They have a huge variety of floweri","useful":0,"cool":0},"Knk-F8csgk3lWj1_OB1I6w":{"text":"Great stop for finding your newest quarantine plant baby, unique pots, soil, and more! Tho","useful":3,"cool":2},"qyNM_jrETb3hXbY9YYOkyw":{"text":"I was on #auntduty and wanted to liven up the front porch with some flowers for fall so de","useful":4,"cool":3},"UNEsDDMlZx3fEvisE_ynFg":{"text":"Love this place and I heard they might be opening a coffee shop next to it which I am very","useful":0,"cool":0},"QEQf5RUaBrv93t8CtlqWAQ":{"text":"This place is amazing for a number of reasons and I give basically all of my gardening bus","useful":2,"cool":1},"gzpmaA4LO3ZuebOLuo1uww":{"text":"God, I love this place. They have pet ducks and bunnies hanging around, perhaps for ambien","useful":11,"cool":7},"_bNmT9jdIDO2_SO_QbB2qA":{"text":"I love going here for fun and also for any plant needs. There is so much to discover here.","useful":1,"cool":1},"m5fhzmr-0EyKbPurevJ5fg":{"text":"5/5 little idyllic stroll.\n\nBeautiful time of day for a garden affair like this!! This was","useful":6,"cool":4},"E7gL_Fkw0EguVCtT8rRSaQ":{"text":"I think coming to Urban roots is a great way to spend a little time on a sunny day whether","useful":2,"cool":0},"4ejXDcYAw_wj3OxKjGiaHA":{"text":"This garden center is an oasis in the industrial part of the city. The labyrinthine ground","useful":6,"cool":7},"rYE4XFvxfGf_bCxzODc5pQ":{"text":"I. LOVE. URBAN. ROOTS. \nWe came during a 6 nursery Sunday trip, and Urban Roots was one of","useful":1,"cool":1},"OSLnlzcKLNYspT_Lie0Vmw":{"text":"The only thing I don't like about this place is that it puts me in grave danger for turtle","useful":13,"cool":3},"XHauzSjJ0BVzXKe2feyzXA":{"text":"I call this my little \"happy place\" secret spot. If I am having a rough day sometimes I'll","useful":1,"cool":1},"tNF5imvKQPfdSFCEoZBxHg":{"text":"Urban Roots is a heaven on Tchoupitoulas  Their prices are fair and they have a HUGE assor","useful":4,"cool":3},"yKFtRJH9rP9Rm3vI2NMxgA":{"text":"My boyfriend and I stopped in on a day out in New Orleans. It was a very cute place! There","useful":0,"cool":0},"V4R-ELkrhzeyJ3krJp4N8Q":{"text":"Every time I go to Urban Roots to look for something at least three people ask me if I nee","useful":0,"cool":0},"LC3F7uh-cHpYt8WlQ717wA":{"text":"As urban garden centers go, they just don't get any better than Urban Roots.  It's not the","useful":8,"cool":12},"oLVrYNBMMHf7PPfv1Tk_Xg":{"text":"Plants! Planters! Farm animals! I get to browse and collect from their wide selection of p","useful":8,"cool":7},"bUt73K1fIDV5l_rAu8w0pQ":{"text":"I absolutely adore this place. I recently developed a green thumb and have picked up multi","useful":1,"cool":1},"5vs-TPGse3ncA0F_7irExg":{"text":"As I was sitting in my windowless cubicle for the 25th hour this week, I was reminded of t","useful":6,"cool":6},"Lgno1FUOXeQ6AYzH6kJcTg":{"text":"I don't write reviews often but had such a wonderful experience here getting a Christmas t","useful":3,"cool":2},"dboCNZRbv-bQKW3I9vsNeQ":{"text":"The most eclectic little garden center screaming all the Nola energy! I had so many airpla","useful":1,"cool":1},"BJqra51W1oZolJK_aNl-hQ":{"text":"I must've driven by Urban Roots every weekend without realizing what this hidden gem was! ","useful":4,"cool":2},"15ZGfEkcdkXPqKrVtgcbbQ":{"text":"I love this place. Plants are always beautiful and thriving. Huge  selection of herbs and ","useful":2,"cool":0},"en7ofO6m_BysgSAqdVGsWQ":{"text":"Love this place! \nI go there every week to pick up something to plant:  flowers, ferns, su","useful":0,"cool":0},"PWYUOz0yZbgRSnU1DNNKMw":{"text":"Damn you Urban Roots Garden Center!!\n\nI was only supposed to go for one plant, one beginne","useful":18,"cool":17},"ZgqAsnlsiJg6Z7XLYvlyQA":{"text":"This place is amazing! It has a great selection of flowers, house plants, pots, and garden","useful":1,"cool":2},"emnGtFAqfnwazaUzNwilEQ":{"text":"I have spent some what I seem serious $ here. No more. I went to buy some pots and they ac","useful":0,"cool":0},"MyhSEebFU9jWSGHeVH2wxQ":{"text":"this was a very nice nursery, although they had very little rare plants and their prices w","useful":0,"cool":0}}