{"oJ2w1xZC9L2Op6u1IlIkrg":{"text":"Drycleaning is a necessary evil. Evil because it's so dang expensive. This place is just d","useful":3,"cool":1},"jIXNcUoxGiE4td8WTFgAFg":{"text":"a waste of time and money... brought a dolce gabbana suit in for cleaning and pressing a w","useful":2,"cool":1},"3LoGMUshu1NLbnnMx_yxpA":{"text":"I just had to take the time to write this review, which is long overdue. The cleaning is p","useful":3,"cool":1},"2NEd3YDJmzwQGqy5EfJULw":{"text":"WARNING! Do not go tot his place unless you want your clothes completely ruined. Looks lik","useful":2,"cool":1},"2PxHLcSYihrf-R3O3bpnqA":{"text":"I really, really hate leaving bad reviews, but like one of my fellow Yelpers said, \"this i","useful":6,"cool":1},"aDZZ8H_JSHN8Xpl1s6DYHw":{"text":"Went twice - they couldn't get a stain out. First time just gave it back without saying an","useful":3,"cool":1},"M5Kp9NAG2gM56NiTX4qopQ":{"text":"Last week I took a church vestment to Young's Cleaners hoping they could get wax (spilled ","useful":0,"cool":0},"PQLRKSEMmc0ZPUgNP6-4OQ":{"text":"I've been a customer of Young's for a couple of years now, and if I had written this revie","useful":2,"cool":1},"vSEvxJrWOlP9pbqKvg7DWg":{"text":"Computer system mistakenly assigned a \"ready\" time when the store was closed on a Saturday","useful":2,"cool":1},"RDM2zG-CIth5t7SFjMRCFA":{"text":"I recently signed up for the pickup and delivery service and could not be happier! Jennife","useful":0,"cool":0},"QZYQlDhNYPmHt6cEPUdeYg":{"text":"They have a pick up/drop off service. Nice if you can get them to set it up. After trying ","useful":1,"cool":1},"Jk6zvFKAX6WquHr_9DUYbg":{"text":"Just recently I decided to try a new cleaners (I normally go on Elysian Fields across from","useful":10,"cool":1},"VJICuCKyZMg5WrUa4W6RgA":{"text":"! I've been using young cleaners 15 years .But yesterday they showed me why me and my fami","useful":1,"cool":1},"lxcDSjXr-zcwazAVStMocA":{"text":"As a disclaimer, Young's Dry Cleaner is not my normal go to dry cleaning service, as I hav","useful":6,"cool":4}}