{"TuI7KPQ2iOcLaRBdE3LpMA":{"text":"4am, need to do laundry and get a great burger and some jalapeno poppers and play the juke","useful":0,"cool":1},"VxrZ-dOB8NQ2p4iTbnbu3Q":{"text":"Igor's Checkpoint Charlie is a total dive.  And I mean that in the best way possible.  If ","useful":1,"cool":0},"BF30x6NJKk0_oCtjxsg0qw":{"text":"This is a hole in the wall dive bar but lots of fun. The crowd here is always laid back us","useful":0,"cool":0},"cIals_QZsfi2VoYbj8MiNg":{"text":"I loved doing laundry in a place I could relax. Small laundry section in the back of this ","useful":0,"cool":0},"YHfCL0a5hRAc7zUx5xGoyg":{"text":"I've gone there several times for several reasons - one of the bartenders is either termin","useful":0,"cool":0},"-YTRULDBBCvhr7RYnDwjBQ":{"text":"Small stage, laundry, video games, pool, good burgers cheap.  Not bad for a joint that don","useful":0,"cool":0},"wnIRBDRbzVZF0sfawiTBLA":{"text":"I loved this place. The staff was very fun and friendly and the crowd was great.","useful":2,"cool":2},"q6iDILtcaI3bpfv7Pft5PQ":{"text":"Don't let the name, or the attached laundry mat put you off. This place was awesome. Fanta","useful":0,"cool":0},"HW6h3YMe6lP4p55ygxqpsQ":{"text":"We were working out on the road and looking for a place to do our laundry. Someone sugeste","useful":1,"cool":1},"mnQsoiqnLIrkqWoKcAkpwA":{"text":"A dirty punk bar that smells like beer, smoke and b.o","useful":1,"cool":1},"6JJqFMY_T7O2gcy-9Zf0ng":{"text":"Next to catching a parade on the corner of Elysian Fields and Royal, this might be the nex","useful":4,"cool":2},"IDX3pEkM4vTR88NyQGjPeQ":{"text":"My band, Manamana played here & was treated well. \nIt was a very slow night, but we made s","useful":0,"cool":1},"DqQqCyd948ESoN6OS9nt9g":{"text":"This is me and my hubbs go to place for burger, fries and pool late at night. Burger is de","useful":0,"cool":0},"F1lR7ZgcCT9fD_c1KQ3YoQ":{"text":"Used to love this place until they changed their Monday night karaoke DJ. Not to say the l","useful":1,"cool":1},"MU1MUE8HAq4TgQx4XwaHAQ":{"text":"This has become a traditional one-drink stop during my Mardi Gras forays, about half way b","useful":2,"cool":1},"QvKPQD9XXG5PcbAgOzU52Q":{"text":"We had a few hours to kill after arriving early and ended up having a few drinks here. It ","useful":0,"cool":0},"rCLCun-MSbK5HdaU20w0Uw":{"text":"This place is OK. I can stop in for about one drink. After that I get the urge to go somew","useful":0,"cool":0},"gqnzwsO950vCDXV7t3KCig":{"text":"we always go to NOLA for Halloween and while I have stopped into this place occasionally o","useful":1,"cool":1},"58n32UxzkiaKUW_HQDy8xw":{"text":"If it was just a fraction less dive-y, I could cheerfully move in here. I mean, they are a","useful":0,"cool":0},"tJdQbXXTZBz56k-IDxXl6g":{"text":"It's open 24-7. It's dirty grungy funky cool place. It is a unique place. Don't really car","useful":0,"cool":0},"L9-qd2dj79hDHvac58Nvyg":{"text":"Great jazz music. No cover. Open all day every day. \n\nPoor guy that worked there had to cl","useful":1,"cool":3},"71Q-c-8gAT5v62NlIOZXqA":{"text":"This place is great- food, alcohol, pool tables, jukebox, WASHING MACHINES...full service!","useful":1,"cool":1},"CnR056TQHfbTiY44eI-lEQ":{"text":"Been coming here for 25 years during Jazz Fest for a post-Frenchman St burger and beer and","useful":1,"cool":0},"rp9yTyhWugvOWHv9TKs5Yw":{"text":"this is where the locals go.. plus you can do laundry while you drink and listen to live m","useful":0,"cool":0},"qA8ngLsU3K1gFAHYSqNqGg":{"text":"Cheap drinks and food. Hidden treasure of a dive bar!","useful":0,"cool":0},"gpI_VBdRhNoXYP6P9MCl3g":{"text":"A bar so dirty, it needs its own laundromat. This place is fabulous in every way. Came in ","useful":2,"cool":0},"KnHpcJfPuXYetYkBX7WFtg":{"text":"Nice people working there. But my clothes smelled like mold after washing and drying them ","useful":1,"cool":0},"9TKYcOGSoKCe8W2m-HdWWQ":{"text":"just strolled in here with a couple friends on saturday night to catch a breather while de","useful":0,"cool":0},"nMPQ6UfaKIYsZOpUYFl_Ew":{"text":"We only came here for three reasons: (1) a girl my size was most definitely ill-equipped t","useful":3,"cool":5},"iTtZHD-0aOzjmJCEUSE0bg":{"text":"It's a Bar!\nIt's a laundromat!\nIt's got a great jukebox!\nYou can play drunk pool!\n\nThis is","useful":1,"cool":1},"3V2Qnx5omPG9sfflXgkD3A":{"text":"People LOVE this joint, but it's not my favorite. Yes it's kind of awesome to do your laun","useful":3,"cool":3},"QzIvtQRCsG3aWkCD34dOGg":{"text":"Drink! Eat! Play! Do laundry! \n\nGotta love a place that bills itself as \"bar, grill, gamer","useful":3,"cool":0},"LH6jghJtYlKdOOwdixmtuw":{"text":"Ahhh, laundry in a bar - this is my type of place. And an additional happy our from 3am-6a","useful":0,"cool":0},"jtuKwfS1IVsGDy_BvtHrog":{"text":"Not a bad place which also doubles as a laundromat.  Open 24/7, or so I was told, though I","useful":0,"cool":0},"uJKdrKbGCuQDUgFbhztphw":{"text":"Well, to be honest, I do have some form of respect for this place because of its music and","useful":1,"cool":1},"R3Q5vgR5PGkYEOEYGdF9-Q":{"text":"This is a terrible place to do laundry. The machines are in disrepair. One dryer didn't wo","useful":1,"cool":2},"SRhRswmp8Yi7k7QoRgPrMA":{"text":"Spent some time here to check out my buddies son play in a blues band, excellent sound sys","useful":0,"cool":0},"18E0B-geYhsrMAfijgMeAg":{"text":"I like this place for live music, but as far as the whole \"laundromat\" thing, well...I can","useful":7,"cool":4},"WVrDXApjqdnATYuiU17eKg":{"text":"LOVED THIS BAR!!! The staff was super friendly, the drinks were reasonably priced and ther","useful":0,"cool":0},"fDXvJlgx58cVG0WhimCPKg":{"text":"OK, on my last trip to NOLA I became an Igor's whore, even meeting him at one. Checkpoint ","useful":0,"cool":0},"zfCz3z8Tu9TDcTBwJ9L94g":{"text":"Loud, dark, divey, with an awesome mix of people","useful":1,"cool":0},"NLr_LejqOlnqy3Jm21nyFA":{"text":"Great Dive Bar! Good Burgers, wonderful music, fantastic locale. Dog friendly bar. SENTENC","useful":3,"cool":1},"knoLtvHvLLP6JJNDhrlHmA":{"text":"Heather should be a professional DJ. Always  good service with a smile. Not my first time ","useful":0,"cool":1},"6XGnUQj2D-M1I7fWi0UxSg":{"text":"Disclaimer: Review may be biased based on stumbling in and finding out later my favorite l","useful":0,"cool":0},"DXKPygWLWlUSoWyUDgWqfA":{"text":"I really didn't like this place so much... It is a normal bar... A little ugly, and the ba","useful":0,"cool":0},"h81bQdYjn10vAWDqZrKe7A":{"text":"Heard it was a good dive bar...away from the Quarter, and first impressions were OK.  Wait","useful":1,"cool":0},"R9YH9tOEara-TdEB0wC8Ig":{"text":"This was always a favorite of mine when visiting, not so touristy. But this past trip it l","useful":0,"cool":0},"q_NslqBpXfOJPA5IhZcamw":{"text":"A fascinating 24 hour dive bar--and I can't really add more to Harden T.'s review.  Not di","useful":1,"cool":1},"LyOP_Wne2UDEqAGBqsEunQ":{"text":"Been here a few times, but only recently did I end up staying until the sun was rising. Ho","useful":0,"cool":2},"arHQtbeMZk57KadMNr5S7A":{"text":"Lots of great metal shows, almost never have a cover; small stage so the vocalist is usual","useful":0,"cool":0},"BVJWsDSb49K6SBhONvbzXw":{"text":"It's hilarious to see reviews from people who somehow don't realize they're at a dive bar.","useful":0,"cool":0},"hHw7PbOjaAUU7NXvzM8zyw":{"text":"The other reviews cover much of what could be said about this little dive bar. It is fabul","useful":1,"cool":1},"GBPmIJHeRUFx4sX_O6hSXw":{"text":"yes! laundry, food, drink. what more could you ask for? oh right, karaoke on monday nights","useful":1,"cool":1},"3rh7onLL_lKshcnHFkb-pg":{"text":"Any place that combines a bar, laundromat, and music venue is cool in my book! This place ","useful":0,"cool":1},"E-YV11qFU6bwViqR6Z1BAg":{"text":"This might be the only bar I reliably make it to every time I'm in town. Excellent bloody ","useful":2,"cool":0},"LIKkHqFGKYieGsgI81rieg":{"text":"Good burgers and drinks. Great music, featuring bands of several genres from blues, folk, ","useful":0,"cool":0},"3vCYuBcUMgMl-77RCQvp4w":{"text":"I love this place, plain and simple.\n\nI remember the first time I ever ended up here, a ca","useful":1,"cool":1},"vyWyrzrIw3G0XMteBJkmug":{"text":"Was on vacation in New Orleans last summer. I was checking out some jazz clubs on Frenchme","useful":1,"cool":0},"dKOQlwfmcDeIMZcavpTJlw":{"text":"I go here often. The prices are good. There's always live music, sometimes awesome, someti","useful":1,"cool":1},"IvUqfeUCXslDFS0EOFJ1vw":{"text":"Saw an awesome band here for no cover...and the staff was cool.  Prices weren't great...bu","useful":0,"cool":1},"5dYe_13veHMxbBhJ6gLZpg":{"text":"Great live band and energetic, local crowd.  This is a step away from Frenchman street, bu","useful":0,"cool":0},"2o6-vtdaZkncQ6ZP9jRV2Q":{"text":"Ask for shanky aka Angela, you will be well taken care of. Great food reasonable prices an","useful":0,"cool":0},"4AkK6x_J_xu0ZeXjl09X3g":{"text":"This is a diamond in the rough.  Fish nachos to die for....homemade pineapple hot saucw ju","useful":1,"cool":0},"qB2FsIFL-rmJTptM_vTYaw":{"text":"OMG! Druggie haven.  People NOT doing laundry, just hanging out and BLATANTLY selling drug","useful":0,"cool":0},"b7hkPHHb4Uhz0Q3KyiT2qA":{"text":"Make mo mistake about it; this is a dive bar. When thats what you are in the mood for, it'","useful":1,"cool":2},"f_twZTQNnRlX_GpoaRjAKw":{"text":"Loud, grungy and lot's of beer. Loved it!! Went during Halloween wknd. The bartender and c","useful":1,"cool":0},"HPjVYbw6T3BVVojMeGZmcQ":{"text":"Happened to be in the Quarter on a Friday afternoon and was trying to find some parking ne","useful":0,"cool":1},"A16Bw8mmaLCEI-XK6Qz2XQ":{"text":"Hey, it's an Igor bar, so you know what you're getting. \n\n15-20 years ago, there used to b","useful":0,"cool":0},"RzUMrjijyNDPfGwzADkYOw":{"text":"Chef does not cook with gloves on so disgusting and hazard to health I didn't even eat my ","useful":2,"cool":1},"85_SvsOr61x8PgOCnI8afw":{"text":"Beer is cheap and tater tots are great for a late night snack!  I enjoyed the live music a","useful":0,"cool":0},"xPKBwkw7Eg7e3jt6VjkbwQ":{"text":"Quite possibly, Checkpoint Charlie's is the dirtiest, grungiest bar (with a laundromat!) i","useful":3,"cool":2},"ud_JBuX7rNDP3JS5bd8JbQ":{"text":"Charlie's makes damn fine drinks....\n\nThis place is just great....I don't know if it quali","useful":0,"cool":0},"rCPgpTPJBTfczhsaVF4ifg":{"text":"Only go here if you're reeeeeaaaaaaallly drunk or craving greasy and mediocre fried food a","useful":4,"cool":0},"xkOQYVsS_IOWmxc4KMxjhw":{"text":"Okay so I had a hard time figuring out how I wanted to write this review. I love dive bars","useful":3,"cool":1},"T2wCX2trttbq9-gERi_Mdw":{"text":"Great divey bar right on Esplanade.  Has a friendly feel, good music where you interact wi","useful":0,"cool":0},"HgwCzwTf0HCehFiKF1QTOQ":{"text":"While staying with a friend in New Orleans, she asked us if we'd want to get a drink while","useful":3,"cool":1},"v4aWY2YE3lYozN5K2xrHIg":{"text":"The laundry facilities is a nightmare. The machines are old and have roaches. They have th","useful":6,"cool":2},"JE5K6XP9NVCGD3YtNhQB5Q":{"text":"This is an interesting place.  It has live music, fairly good food, great drinks and a bar","useful":2,"cool":0},"NFgxa6NcM8GljcdhVPNIAg":{"text":"Why is it that no one in New York has recognized the genius behind combining bars and laun","useful":10,"cool":13},"OcsLYVZdcurPiokaiA8s6Q":{"text":"My boyfriend and I stopped here on a Saturday night during our visit to New Orleans and th","useful":3,"cool":3},"caLEzK_82HiaLnAb77jYyQ":{"text":"Go for the bar and music and only the food if you are too drunk or starved to care. There ","useful":2,"cool":1},"m0WD021HFCCmCu1uFWZ7mQ":{"text":"The most clutch bar at 3 am. Small dive bar with music, tv's and CHICKEN NUGGETS. (The sam","useful":1,"cool":0},"BKhb73OmE_T3wIB6DSMmBw":{"text":"This is absolutely my favourite \"dive\" type bar in all of New Orleans. Even though I moved","useful":1,"cool":3},"Hoa5spoRgMPrqxEDKmC2Ug":{"text":"\"Checkpoints\" is a Dive Bar with a Capital D. At the corner of Esplanade and Decatur just ","useful":6,"cool":3},"gATkNa9ztakFZL1FU7DpJg":{"text":"We stopped in here on Wednesday night because I liked the music.\nThe place was dead.  Ther","useful":2,"cool":2},"FQ-jXIVnLn_WpdYJ0upKYw":{"text":"Holy shit!  This place was fantastic! \n  We came in to live music with no cover.   My love","useful":1,"cool":2},"68vW_1ioE1_GmIzSjEhYfQ":{"text":"Great dive bar with great bartenders. I stop by every time I'm in town. Good food also.","useful":0,"cool":0},"AQksRh0-nzqS6u5uCamcZQ":{"text":"They charged me $2 for a seltzer with lime. This is after I already paid for two beers and","useful":1,"cool":0},"_EHTpvCGqt8FkXkMGW8scQ":{"text":"One of my best times in New Orleans. If, like me, you love a hollaring dirty rockabilly br","useful":7,"cool":5},"DXUy7y6OMorLMW_VV4Pg3A":{"text":"This is a pretty standard but cool dive bar. The drinks are cheap and the bartenders are v","useful":0,"cool":0},"Ws-pkw2WaCJs4ilElGe1yQ":{"text":"Best dive bar in New Orleans!  Absolutely love this place. Great music, food and bar tende","useful":0,"cool":0},"UNGkfhpdX3DuU8y1H-aIfw":{"text":"Don't start me talking.  I could talk all night . . .\n\nJust when you thought that I was do","useful":6,"cool":4},"NSVdZsdysrbCKlZKuRcEWQ":{"text":"This is a great late night place to get a greasy cheeseburger and chicken nuggets. The ser","useful":1,"cool":0},"df9Oy09pIc6MZGB1qel0YQ":{"text":"Great Live music, free drinks thanks to a passer by.\n\nWho would lie when they say Frenchme","useful":1,"cool":3},"oRfcSlZLCu8h_Gfha0_V9A":{"text":"Omg! This place is disgusting The bathroom was so fkin disgusting I'd rather pee my pants.","useful":3,"cool":3},"byjzr0tDm0HdTYSNPnN7Ag":{"text":"i will never forget this burger or this place, I was there about 4 years ago.","useful":0,"cool":0},"hGjNy6e86StMa4wFZ30_4w":{"text":"Located on or just of Frenchmen st.  I came in after getting a tattoo at electric lady lan","useful":2,"cool":2},"PGCg1rDEfZQq-JfGlKnbdQ":{"text":"Are you kidding me?! The place was dead and I asked the bartender for toilet paper. Toilet","useful":5,"cool":0},"-lRwEqt59g-rwksPtz_pwA":{"text":"I don't get it.  Locals may love it but it smells like vomit and bartenders have the perso","useful":4,"cool":2},"aw_0Bj0ylqZh10ACioZL9A":{"text":"We came here on a dead Monday night and the bartender- a dude wearing a floral suit an top","useful":1,"cool":0},"qI0v1ToyKaI7IChull2bzw":{"text":"Dropped in while waiting to be picked up for our swamp tour. Very empty, of course it was ","useful":0,"cool":1},"jxaOTqTIkI2TWW4Tj-gm6g":{"text":"I've been a regular at Checkpoints since before I was of legal age to be in the place (oh ","useful":4,"cool":2},"A9pznkZcEZDw9rMlULwEEw":{"text":"Love this spot ;)))\n\nThe drinks are cheap , no cover... right in the heart of the french q","useful":5,"cool":6},"ll-vE5_l_FKsL1B4sYQjgA":{"text":"Checkpoint Charlie's has:\n\n- cheap prices for booze\n- food\n- a pool table\n- good country b","useful":7,"cool":7},"hZJ3VKsaXX-58CbV7JpUQQ":{"text":"Was on Frenchman's Street with my good buddy and a coupla lovelys but couldn't really find","useful":2,"cool":1},"QQzRbT0eGSj5prRBj1qR-w":{"text":"My husband arrived to NOLA late, we were starving. This was the only location we could fin","useful":2,"cool":0},"mVFzCaKnH6gsqfyal_gJ3g":{"text":"TERRIBLE Bar Experience\n\nI had the most unfriendly, rude bar experience. I received terrib","useful":3,"cool":2},"Cs4-dmSeEVRojslusQNMPA":{"text":"Now this is the place!! Where else can you do laundry, listen to live music, get a meal an","useful":1,"cool":0}}