{"JIJINhDRevulNLdKwrKA9Q":{"text":"The hipster bar to end all hipster bars. I can't think of any place I'd rather be on a Sat","useful":4,"cool":1},"5C0U8Pu896lYRPzB5ywhNQ":{"text":"I love the ecclectic vibe of this place.  I recommend going on a night when DJ Soul Sistah","useful":2,"cool":1},"FA_BNH-aKagVrov2I3z7gA":{"text":"I ventured out here on a Monday for the Bluegrass Picking Party, and it was great. Good mu","useful":1,"cool":3},"nvq9flo_R4Kuk_hqka0XEQ":{"text":"The Hi Ho is just about all you need in a dive bar music venue: a few high top tables arou","useful":0,"cool":0},"6ht69gwud5VwuE-c4JWLQg":{"text":"I've only been here on Saturday nights for DJ Soul Sister. We love coming here on Saturday","useful":2,"cool":2},"mbwAmTHa32IelcF5kTHP4g":{"text":"High reviews mostly for the amazing music of the Stooges. Few booths made the wait a bit u","useful":0,"cool":0},"EjfAjULDucy2x56t92-6nA":{"text":"Eccentric place to go. Be warned that you can not even whisper during Treme viewing days b","useful":5,"cool":2},"BlEskdrJK0oWX8L07_HSWg":{"text":"Loved the Latin night on Wednesday !!! The music was fantastic. Must do this again. Great ","useful":1,"cool":0},"e7U-1pe1V8DzrmDfrH-7Lw":{"text":"Fun dance party on Saturday nights with DJ Soul Sista are a must-do.  She brings in a litt","useful":1,"cool":0},"5tSVwmH28Y58W4KGZsyEpw":{"text":"A hovel on the outside, a multi-faceted mecca of fun and entertainment thrives within! I s","useful":4,"cool":2},"t99wKdf_elgyDOWkG4TLdg":{"text":"I've only been to the Hi Ho a few times, but I have had a great time every time I walk in ","useful":3,"cool":2},"ano2kjGRGh4rSWMrM5gqDQ":{"text":"Hipster dive bar like hipster dive bars everywhere. To their credit, they didn't play the ","useful":1,"cool":0},"rC3SG4Wmpm-es2wLgKk-pA":{"text":"What a fantastic dive bar!  Went on Monday night for $1 red beans and rice, and got to swa","useful":2,"cool":0},"1pEP-EN1OcSMSr2wbfriJQ":{"text":"Standard New Orleans dive bar. Cheap drinks, awesome local bands, babes and tons of hipste","useful":0,"cool":0},"6OS81FpARG-risar7E-2Rg":{"text":"3/5 solid space\n\nthis is a cool, dark venue with surprises within! the first surprise is t","useful":2,"cool":0},"TjRWOXPvqyuDgrKY5dQX1w":{"text":"Good spot to check out random shows. Can get really packed though and difficult to see the","useful":1,"cool":0},"zGG5nn31NTuusWf9Awk2kA":{"text":"Found this place much more open. The staff helped me decide on some great beer. \n\nI would ","useful":3,"cool":1},"slaWSdG8_K7VtvB9I4pb8g":{"text":"It is packed and sweaty but the music is good and the drinks are reasonable. You're going ","useful":1,"cool":0},"6MsLRTS5zcO8oj5VFABLTg":{"text":"Very nice dive bar that played really good music on a Saturday night. A lot of funk on Sat","useful":0,"cool":0},"PcTZj8pYbq2OQK6DJUU1lQ":{"text":"Went on a Saturday night for DJ Soul Sister.  She didn't  disappoint. We came in dancing a","useful":0,"cool":0},"jHVj9qDFtpcYkdAOAjmGVw":{"text":"We like to be in non touristy places when we travel. I love the back patio here for drinks","useful":0,"cool":0},"-NadlbEPAoaHfoddprNP5g":{"text":"If I go out on Saturdays I usually end up here for the music, but I have also had excellen","useful":0,"cool":0},"9JHg2YTQI8CsdcybLSsgZA":{"text":"Hipsters galore!\n\nI had a lot of fun here. They were playing electro music, people actuall","useful":1,"cool":0},"-Pbk19_45-RSeYWq1AcYiQ":{"text":"The venue gets 4 stars. The music gets 3. But without great music, what is a wonderful ven","useful":0,"cool":0},"X0XU5yclV1WuxSFL0ym7nA":{"text":"The liver is evil and must be punished. While doing that appreciate the excellent strides ","useful":0,"cool":0},"y2dIuzDiJA3zrlraza-FDA":{"text":"I haven't been back here since the storm, or since I was of legal drinking age, but with t","useful":1,"cool":1},"-L1V4_1-t28euhAJtXDRGw":{"text":"Went with a group of friends to eat h a comedy show of comedians recounting drunk stories ","useful":1,"cool":0},"wu65C3Ez3Sfua_V0636XoA":{"text":"Bartenders are great, and food out back in the courtyard is always good. I've seen a few b","useful":3,"cool":0},"KYacQzo6n4OkbB9E1U3dUQ":{"text":"Only been there for Monday nights Blue Grass Pickin' Party.  Always a good time with a gre","useful":1,"cool":0},"taK0hp41EMjvuLCoVmCVcg":{"text":"Locals dive bar. 80 music... chill but nothing too exciting if you're looking to have an u","useful":0,"cool":0},"X8aO586p0ug0sUSFChjiPQ":{"text":"Hi Ho is a great spot for local music away from all of the tourists but whats even better ","useful":4,"cool":1},"J0I9AD7J1QT9qhGWEeO2dA":{"text":"This dive joint is mostly a music and event focused venue.  The main thing that can be sai","useful":3,"cool":0},"AEAM1ksVqZhDHHx1s4PtmA":{"text":"Came here on lundi gras. $10 cover was well worth it. The people and the music were amazin","useful":2,"cool":0},"jQtiGv3I7gd2cdA8I7BVIQ":{"text":"We recently spent some time in New Orleans, and this ended up being one of our favorite sp","useful":2,"cool":1},"LQU7mxibuqOTNH1tlGrQrg":{"text":"Tuco Taco Tuesday!  The tacos are amazing.  They are made with homemade delicious tortilla","useful":0,"cool":2},"whxd9T6oEBMfQ_n71rm55Q":{"text":"We really struggled to find this place, i don't know why. I guess because we assumed it wo","useful":0,"cool":0},"dwMalx5UIcOflSVrT4YBbA":{"text":"I discovered this gem of a dive bar two yrs. ago. I love it. The scene is cool and unique.","useful":1,"cool":0},"y8w2KGWiIfZRssitDFV9TA":{"text":"Looking for a great place to dance on a Saturday night? Here's your place.  DJ Soul Sista ","useful":2,"cool":0},"nmQ2i1sPeuW_zUVkwxQmew":{"text":"Hi Ho Lounge a little hole in the wall of a club with a bar and live music. \n\nI went hear ","useful":0,"cool":0},"09qDS2QQ3ZlLDsX-N5pP8A":{"text":"Worst staff I've ever experienced.  And I've been going to bars, clubs, and venues for 20 ","useful":1,"cool":0},"2tgy_Qex69MAgGLyxmFdCw":{"text":"Stopped in after a bite to eat and decided to check this place out. You will not see a lot","useful":2,"cool":0},"y6g3Jn7SiCTlmkaW_nsPNw":{"text":"Absolutely the WORST experience I have ever had at a venue. I am in complete disbelief by ","useful":6,"cool":0},"N5scEClRckMStnTnqSi4lw":{"text":"Great dive bar. Taco Tuesday's by Jimi Palacios is a true deal. Try the slow cooked pork t","useful":0,"cool":1},"6hCVLGHHJhEAy69l8GCx1w":{"text":"Great stuff! Don't be shy!\nFantastic band, great drinks, comatose bartender.\nLove NOOA!","useful":1,"cool":0},"txyojGG2RbSKgjqDyQrHwA":{"text":"The pie we had was holy wow super yummy. The gal that makes them is incredibly talented an","useful":0,"cool":0},"X-ZWRZEJIVly6JY5SPqtwg":{"text":"All about Monday night Bluegrass! The place is funky, the drinks are strong, the atmospher","useful":3,"cool":1},"6zLHJToGdrcIKSwPXy8DQw":{"text":"The Hi Ho Lounge is a lovely little surprise. The interior leads you to believe it's a reg","useful":5,"cool":2},"Ge3gFRV4sg0Jyg4946UBKw":{"text":"THURSDAY NIGHT REVIEW \nI had the wonderful pleasure of seeing the local brass band Stooges","useful":1,"cool":1},"s8YRYE0oJKpgAVUqJwsx7A":{"text":"Don't let the exterior fool you, you can't see inside, there are bars on the windows, the ","useful":2,"cool":2},"K_PFHDB2tm9TN2qi64aNWw":{"text":"I got booked to perform here when I was on tour, and now anytime I get booked in NOLA, I m","useful":1,"cool":0},"kG0kDTerg2ozE-blu4OCQg":{"text":"I love monday nights here. Red beans and rice used to be free, but its still worth a dolla","useful":1,"cool":1},"YgW5s74-VFuaH0rewk2Syw":{"text":"Hosts a variety of shows and very supportive of the local artist community. The staff is g","useful":1,"cool":0},"LYt97pBVIS-b4v3rjrqYnA":{"text":"I went to the Hi Ho Lounge for their Bluegrass Pickin' Party on Monday nights. It was well","useful":0,"cool":0},"rGS1ZzvcjXZIScWxIrucEA":{"text":"Visiting from NYC, the Hi Ho Lounge is a welcome change from the glitzy and sterile mega c","useful":6,"cool":3},"FZneOYAndUvskF0zrKu_oQ":{"text":"Out of all of the bars that my girlfriend and I checked out in New Orleans, Hi Ho Lounge w","useful":4,"cool":5},"2QL-NeE5EEzfgq_gKbdaIA":{"text":"About as weird as it gets. This is one of my favorite dive bars in New Orleans. Come for s","useful":3,"cool":2},"IKZvmReNfgWbY6DKC6uFtA":{"text":"Went to a party last night ,around 11pm, with friends and the bouncer and security were in","useful":1,"cool":0},"B9MPx2gcUhYpgyWT5caYgg":{"text":"The live jazz music was a great experience. We heard a lot of good tips about the sushi fr","useful":0,"cool":0},"Hp4Xrj7sgKWQ4a5cmmMdgQ":{"text":"Friends and I came here while we were in Nola and we had a great time! We went out back wh","useful":1,"cool":1},"RS4TBkPl9-xBlCkfBYF6qA":{"text":"Love this place. Great energy! One of my go to spots in the city. Very laid back vibe","useful":0,"cool":0},"gM6A8t0hXjne26qixhcDdA":{"text":"This is a really cool place - we stumbled upon it and I'm glad that we did. \n\nThey have a ","useful":1,"cool":0},"UPfkknsy7nMV17EFJMRx9Q":{"text":"Oh Hi Ho, you never disappoint. This place was one of the first spots after moving here th","useful":18,"cool":13},"Nm_sB0R7QY2RiMAkR4ZFWw":{"text":"Loved this place! Met such awesome people here, everyone that works here was incredibly ni","useful":3,"cool":4},"82N73OhWaIawR71zqwMskg":{"text":"Came for comedy night and loved. Great atmosphere and funny comedians. Will be returning","useful":1,"cool":1},"zZcB_E4Q_504jC1Isa8Y_g":{"text":"Harsh but hilariously honest review. This review may come off as anti-white, but it's not.","useful":1,"cool":0},"hUJxCNtS1jpJA4bwr_mgyw":{"text":"We stumbled upon the Hi-Ho Lounge on our 2nd visit to NOLA from Texas. First impression: i","useful":0,"cool":1},"1p5wBE36LTdXXx7SxA7daw":{"text":"It's been a while since I've visited Hiho, but this new Friday party made it impossible to","useful":6,"cool":2},"q60sqCN056-r8A6kiKRRLA":{"text":"A solid bar to go hang out with friends when you want to have a fun night out. We went on ","useful":16,"cool":16},"AvPiLbPPfGU-PvK2pJYJjg":{"text":"This is a hip club off the beaten path, with exciting musical offerings, check for listing","useful":7,"cool":7},"_h3_hX85kNwoYcSy5H-HBg":{"text":"Hi Ho is just plain damn great. A true shady lady, but one that turns out to become more l","useful":13,"cool":8},"FaKII_hysfJRblxFxxJkeA":{"text":"Hi Ho Lounge has a laid back, uber-cool atmosphere and a great selection of tap beers!\n\nTi","useful":7,"cool":8},"6WKVP7547NguEcF7LI-vXA":{"text":"Hi Ho is okay. It's one of the \"dirtier\" bars/clubs on a street that is already pretty fil","useful":5,"cool":4},"_ZwjqWoQqgIqd2U-9ioY-Q":{"text":"Oh, yes - this is the place for interesting bands, easy access to the good stuff, and off ","useful":0,"cool":0},"SEee6g1JFXKK3G_h7Fh1KQ":{"text":"Far outside the French Quarter away from the maddening crowd there exists this dive bar/cl","useful":1,"cool":2},"VEBKtR5JcWvOZPAwvD5RLQ":{"text":"Badass bar in an area with some of my favourite bars, which is also kindof a dangerous par","useful":8,"cool":4},"hTZwwnuuGB7BjVAqIIyprQ":{"text":"Great spot for late night dancing! My friends and I like to go on Saturdays to see DJ Soul","useful":4,"cool":2}}