{"MRYLsRJQWHz9KO93R5OUtg":{"text":"Terrific food, service, and vibe. Great spot.  We got there early on a weekday so there wa","useful":0,"cool":0},"pkkTU1X7vUqTxb9AUDcUTA":{"text":"Italian recipes with chefs California inspiration infused.\n\nService - outstanding, althoug","useful":0,"cool":0},"OSYLg8dUu1M9-lRdBZqXIQ":{"text":"We got lucky eating here on our first night in New Orleans.  We just walked in without res","useful":2,"cool":0},"scUxk1xTdPKQwixcL6sGVA":{"text":"After going on the Creole Bike Tour, we were speaking with the tour guide who highly recom","useful":1,"cool":0},"39sIjFwRujeH_S56tksC6g":{"text":"Even better than last time. We were here last year and liked everything but noticed this y","useful":0,"cool":0},"n0LVFUeCwwWcKDqvcUx2TQ":{"text":"Ate a late dinner here one night. Our original intent was to have a glass of wine, share a","useful":3,"cool":2},"O3d-FIWVsiqpzCpFfAXZKw":{"text":"Irene's is a good restaurant, and ultimately it's A-OK just not quite my style and I don't","useful":5,"cool":1},"k04pfamyxnGVEv0W_0wnsw":{"text":"We heard fabulous things about Irene's, so we called tonight to see if they could possibly","useful":1,"cool":0},"n1Sy6RCvfxLMLNgxSExRhg":{"text":"I've lived in New Orleans for several years and finally got the chance to visit the legend","useful":0,"cool":0},"HGvbLYS-SgTAiD7rer461Q":{"text":"I don't have the words to describe how wonderful Irene's was for dinner. It is small and c","useful":0,"cool":0},"SjCKi9iWYA2ePZv1vYPy1w":{"text":"Yes, expect nothing but exceptional Italian food. But what makes this restaurant such a bl","useful":0,"cool":0},"gTvMxdYfj98fmfMoqlMRfA":{"text":"Irene's is a little stuffy for what it is.  I'd say it's kind of cafe-esque with 3 rooms, ","useful":1,"cool":0},"mHy0ORWjINfLHzUASc56kA":{"text":"Food was great. Server was fun and helpful. Space is tight and intimate in this restaurant","useful":0,"cool":0},"lFM5sFRoqWXo85e6hap5cA":{"text":"Fabulous, fabulous, fabulous!\nTried going last year, but couldn't get in. Made sure I made","useful":0,"cool":0},"BotDLgOzMZuMmHthbNX9qQ":{"text":"Great experience, 20+yr local resident w/ 1st time dining here . 1st class treatment by wa","useful":1,"cool":0},"WY2VhXKotejxhdJQ2OLisw":{"text":"Irene's has been on my list of places to go for a long time now.  I had always heard good ","useful":3,"cool":0},"bDXSbfobVc678wwgb79PyA":{"text":"My 5 Star rating of Irene's should speak for it's self .  The staff is beyond friendly, th","useful":2,"cool":0},"li_Yy2muanX66iMPt1NjSw":{"text":"First time here and will definitely return. We ordered the lamb, duck, cap rear salad, mus","useful":0,"cool":0},"Cyagt-jhv7lDEeOpy0wZnA":{"text":"Every time I come back to NOLA, I have to eat at Irene's.  This is quite possibly the best","useful":0,"cool":0},"6r0D8hgluj6PI1buuma7Xw":{"text":"Not cheap and not as elegant as some places in NOLA and, as far as I know the chef is not ","useful":1,"cool":0},"dOc-NP3FXfwtA54FpSVfkg":{"text":"I cannot say enough wonderful things about this lovely restaurant! I always insist on taki","useful":3,"cool":1},"UWHkJpfwTtH0Tly_bCmIEQ":{"text":"Found out about this gem from some locals our last night in NOLA and I'm so happy we did! ","useful":0,"cool":0},"u-OHEpPWZURS-rL6VvaC_w":{"text":"My husband and I decided to vacation in New Orleans and looked forward to dining at Irene'","useful":0,"cool":0},"pCHJZ6mCw4N7eslCnAywQw":{"text":"Irene's is what I like to refer to as my \"white whale\" of NOLA. I have been denied my visi","useful":1,"cool":0},"mtKVotkHGoxTkz8rdHtgSQ":{"text":"One word: fantastic.\n\nEveryone kept telling us about the wait. But we walked right in with","useful":0,"cool":0},"9aqrMVUJy3cOK0_Q7-Jj0A":{"text":"I traveled to NOLA with my friend to celebrate our 40th birthdays. Both of us are very pic","useful":1,"cool":0},"FmhALLdrjG2hCCcafrTTKA":{"text":"Great food! Their lasagna and wine is fantastic. Great waiting staff. Generally very good ","useful":0,"cool":0},"5393_qW7Mfzt1WzX3wyJFg":{"text":"Totally disappointing. We had a reservation and still waited over 30 minutes, although tha","useful":1,"cool":0},"KiyiVscpXl8nJJHjCBuX4A":{"text":"Upon entering Irene's, a French Quarter based Italian restaurant, three or four well dress","useful":4,"cool":0},"-Cd4gnhVDkSrfnpytCTc6A":{"text":"I hate doing this......great food and great service....but as a local i want to keep this ","useful":2,"cool":1},"tS_NpCOcN6OOetE0oo5M1Q":{"text":"This may go down as the best food ever made in the French quarter! The long wait is well w","useful":3,"cool":1},"CUyukFb6v4YLFeTw-82k2g":{"text":"Hands down the best restaurant in the quarter. The service is always friendly and knowledg","useful":0,"cool":0},"0nwyntVwHGvEQz9nudReXw":{"text":"Where to begin. First, the ambiance is romantic and cozy. Piano playing softly in the back","useful":1,"cool":0},"Ii-MaR6AA9-6linq-iOovg":{"text":"Our last night in NOLA and we found this gem of a restaurant for dinner. Our server, Drew,","useful":1,"cool":0},"8Wp0QANsXCKMdyOEOmsXqQ":{"text":"I'll start off by saying that the food IS delicious. The service was lackluster. When dini","useful":0,"cool":0},"YqvmHq4P4pmkXZRJugJz8w":{"text":"Classic bistro atmosphere, confident wine list, old-world service, careful prep ... a real","useful":1,"cool":0},"4TxYN_aSdxOSd5dvrdJ5OA":{"text":"Good food. Great service. Salad was good. Raviolis was good. Bartner was very nice and fri","useful":0,"cool":0},"rLuKxC6EimQv4-Rtxz_g3w":{"text":"Sent there on a tip from a former local. Decor was fun, a bit of a cluttered mish mosh but","useful":0,"cool":0},"npbMorIHqbbw5hoed87Uhw":{"text":"LOVE LOVE LOVE! Such a beautiful place to enjoy a cozy and relaxing dinner. The food is am","useful":0,"cool":0},"2o5_PNWpvo1T8EktlvYj7g":{"text":"We visited this restaurant for my birthday.  Our friends had eaten here before and enjoyed","useful":0,"cool":0},"3pF1m2Y7O7yN4_fDilWM1A":{"text":"A friend told me to check this place out when I was in town, and I wasn't disappointed.  N","useful":0,"cool":0},"gUZZCZ_lXa6yGx1bmwQw7g":{"text":"I give 5 stars very rarely. However, this restaurant has it all. From the moment you walk ","useful":0,"cool":0},"OKDqyZcE5eLciuQsvD-6Qg":{"text":"First dinner during my inaugural trip to New Orleans and Irene's didn't disappoint.  \n\nFoo","useful":1,"cool":0},"ChcTE36ghJw242poxYaPQg":{"text":"One of the best meals we have ever had! The food was exceptional.  The shrimp bisque, crab","useful":3,"cool":3},"Mp9_hiXmpfrvClfe4WbFvg":{"text":"We went here on the recommendation of a good friend. The ambiance was very charming, and t","useful":1,"cool":0},"KgBpsbB0m__8o-10Nj-akQ":{"text":"Utterly fabulous, on every level. These guys are pros. Attention to detail is off the chai","useful":0,"cool":0},"wgaCzrhO7tcNChgkxqOjgQ":{"text":"Expect authentic, imaginative, fresh and wholesome cuisine coupled with friendly and profe","useful":1,"cool":1},"NYQ0GtNHSGAIn-i5hb89PQ":{"text":"I spent an entire meal on appetizers alone. Incredible flavors, rich and delicious and I w","useful":1,"cool":0},"AEx7JBiff4JrbAZI1ix0ew":{"text":"OMG! Do not miss this place! I had the rib eye cap and my husband had the lasagna and both","useful":0,"cool":0},"oafl-VjOt6MGqlzeGqZV2A":{"text":"This is some of the best if not the best place to dine in New Orleans.   Don't waste your ","useful":0,"cool":0},"zAUx2n9aL3guy5hbsH2JGA":{"text":"Had reservations for dinner, wait was very short. Service was good but quite disappointed ","useful":1,"cool":0},"RZjxwcNByTQ9NOyBYfnBeg":{"text":"1. Stacie. AMAZING server!  Wow!\n\n2. Make a reservation. A local recommended we do it and ","useful":4,"cool":3},"J4lB1ApOITci3OX8K7y3KA":{"text":"This is a great cozy spot nestled in the French Quarter not too far from Decatur street. T","useful":0,"cool":0},"7z8R4q-dEjblMH9J4JDYgg":{"text":"Irene's is absolutely the best! From the wonderful cauliflower soup to the duck it was so ","useful":0,"cool":0},"pvDe61BN-yls9yEvS6P5PA":{"text":"I LOVE Irene's!  The food is outstanding, and the atmosphere is cozy and comfortable.  I h","useful":0,"cool":0},"TWPmSJt693Q9G4pZC0wYcQ":{"text":"The food was good but extremely salty. We split the Oysters Irene, Crabmeat Gratin, and a ","useful":0,"cool":0},"CHWDDLZrszGgyCdszJWoaQ":{"text":"The service was great, and my entree was worth 5 stars (the duck st phillip). However, my ","useful":0,"cool":0},"Jt-Z4WsM2-8jK5rfFJlczQ":{"text":"I can't say enough amazing things about Irene's. Just go experience it- literally you will","useful":0,"cool":0},"flse9b2hBPZEoWrJ8q466A":{"text":"Late dinner in New Orleans and came across this place. We were not disappointed. Super fri","useful":0,"cool":0},"5KwmfSsKv7nOgQ8K3a_NuA":{"text":"Food was FABULOUS - especially the Soft Shell Crab appetizer !  Whoever does the hiring is","useful":0,"cool":0},"4tMnckWANB1zA7AqpcLH6g":{"text":"We ate here on the recommendation of a local and couldn't have been more pleased. We arriv","useful":0,"cool":1},"b4J4kM0xX7GbMJyYhAgdTg":{"text":"Best restaurant I experienced in new orleeans. Hands down. Had the ribeye with mushrooms a","useful":0,"cool":0},"zx4rl6bcuKIZ6mVtkkPmCQ":{"text":"After an hours wait we got to order and I went with the soft-shelled crab parpardelle. Now","useful":0,"cool":0},"DwoE51uSWDzOCVlDsd5gZA":{"text":"We have eaten here before several times and really enjoyed it. I called them several weeks","useful":0,"cool":0},"xzsh1nMXZghINbY3fsNGcg":{"text":"I love the staff here. The last time we were in, the waitress [Helene] was amazing. She ha","useful":0,"cool":0},"vrEvM5ZcarEYN1FSG0yHlg":{"text":"It's a pleasantly light Italian menu with a creole twist. The turtle soup was delicious an","useful":0,"cool":0},"DvhaHH2PmRFfeuwwGfUtiA":{"text":"The food is delicious. Make reservations far in advance. My only criticism is that it is p","useful":1,"cool":0},"AjQLL7vPq-GFELp0QeoUxg":{"text":"Delicious, quaint Italian restaurant hidden in the French Quarter.  Go early as they do no","useful":0,"cool":0},"3W310TOLmayneAuItjgbmA":{"text":"Irene's does no advertising since they are so busy with the local residents.  We waited fo","useful":0,"cool":0},"AgwG1pO9rUib7IdNHaDyCQ":{"text":"On our server Matt's suggestion I had the lamb and it was incredible!  We also had the che","useful":1,"cool":1},"1xuMocTH0bX3vmTVC9hu8Q":{"text":"I wish I could have liked this place. \n\nBut somehow with an order of escargot and a steak,","useful":4,"cool":0},"vWp2u9eavvbAKuXMVl1wbg":{"text":"Great little Italian restaurant. Piano bar. Great food, and friendly wait staff. I recomme","useful":0,"cool":0},"wsdFr_TlxywiiLRpH3_v9w":{"text":"There will be a wait (make a reservation a week in advanced). It will be crowded. It will ","useful":0,"cool":0},"-jVL3GKT7lyAi36RPGeb-Q":{"text":"There are probably better Italian restaurants where I live, and maybe even elsewhere in Ne","useful":0,"cool":0},"TZmEL56ghnyRudpd7G98cg":{"text":"The first time we experienced Irene's was several years ago when we were walking down the ","useful":1,"cool":0},"yp5PlDb-U6qweL6ECrkwbg":{"text":"We had looked up many restaurants to go to in New Orleans and Irene's was on the top of th","useful":1,"cool":0},"hhXZ6bgJ8EkWlp8AGZwtcQ":{"text":"Fantastic!  Cocktails in the bar is a must before dinner. Meatballs to start. Crevette fis","useful":0,"cool":1},"CAyBbaVjlc0ev2VBoSGD4g":{"text":"This was a great place to eat. We had about a 45 minute wait but we were very comfortable ","useful":0,"cool":0},"EhsGV7iozCHjeyRqdJBn1g":{"text":"The wait staff was hilarious and so fun. The food was insanely good. I had the soft shell ","useful":1,"cool":0},"7f-sbJt88o1r7FP8JZiu9g":{"text":"After hearing so very much from a variety of sources, I went, alone. ( bad idea)\n\nAnd Wait","useful":3,"cool":0},"0mvx8aWygz8aO20CmJCRIw":{"text":"Insanely good. Started the meal with a nice bottle of Bordeaux blend from California. Had ","useful":0,"cool":0},"2-JBSHSbv5wjWVT0r0KUFw":{"text":"We had reservations at Irene's our first night in NOLA. It was recommended to us by a very","useful":5,"cool":2},"ZOisEharF4VLkdO3AmjUWg":{"text":"Service- Amazing!\nFood - high quality. Multi level sophistication. Delicious! \nSetting- va","useful":0,"cool":0},"eCcaldf-rX7mT8V2cmZ6NA":{"text":"We were told about Irenes 15 years ago by locals, we always return.  This time we tried Ne","useful":0,"cool":0},"E5m_O3A3iCNnb0CrfcwiyA":{"text":"This restaurant is a breath of fresh air in the FQ, if you are tired of the Cajun/Creole/f","useful":0,"cool":0},"RKuQgm7QWGCm7IJ8zFZb_g":{"text":"Probably one of the best meals I've had in a long time.  The filet was like cutting into b","useful":0,"cool":0},"Fb9kdq6On4hFNOGm4tdCTw":{"text":"Irene's is hands down one of my most favorite dining experiences ever. I ate there with a ","useful":0,"cool":0},"Oe9G-Z4Xlzvv2Z0BrzYemg":{"text":"My gf and I were craving Italian food, and this place was highly rated so we thought we'd ","useful":1,"cool":0},"gRl8yx_blX6l1xgnZWRTGw":{"text":"Definitely not the Irenes i went to 10-15 years ago.  The last time i went the marinara sa","useful":0,"cool":0},"kTHTFHzq2ArkF7iF8_WdrQ":{"text":"We had the most amazing dinner here last night! The place is so very quaint and cozy. All ","useful":0,"cool":0},"F89QUwFPstd3tydXmLgOhA":{"text":"Our second night in NOLA (8/24/17) my wife and I dined here.  We are huge Italian food fan","useful":0,"cool":0},"K5DlaXZx2mhK6cEAMWpoWw":{"text":"Cannelloni was awesome. Small table, low ceiling, crowded and loud. Reservations a must af","useful":0,"cool":0},"NtBYUpUJftqCm1ev20SQ_A":{"text":"this place was so great.  the food was wonderful but the staff is exceptional!  they were ","useful":0,"cool":0},"9CZptJngQRucWLD5emzBZw":{"text":"My friend found this hidden gem by accident while exploring the French Quarter. Excellent ","useful":0,"cool":0},"nQz5pH-BQZ3GIsO2QEqdxQ":{"text":"I bring my family here every time we return to New Orleans.  I lived here in for about a d","useful":0,"cool":0},"wn_GbOXiiZG2OKgnjM-Sig":{"text":"I just got back from Irene's and had to get back to my hotel room to regroup. It was reall","useful":0,"cool":0},"uO8aD09VZvPppyFJJfKj9Q":{"text":"Made reservations for Irene's for dinner for 2. Check in was at the back. As we walked thr","useful":0,"cool":0},"uqV5uEsdcPtdoyWWLwX0pA":{"text":"When I was researching where to eat before my big trip to the French Quarter, I came acros","useful":1,"cool":0},"OErjyv7khIOZ6CyHOl4_dw":{"text":"This place won me over!\n\n\nDecided that on a cold evening, a warm italian dish was in order","useful":2,"cool":1},"1LOzqtNkzUt1i-M9X4xcaw":{"text":"Irene's is a great experience.  I have never had a reservation, but rather shown up when t","useful":0,"cool":0},"WApID1pNAb_AsaYfLEYYSQ":{"text":"Very mediocre. Maybe other yelpers rated highly because it's a noncreole option in a sea o","useful":0,"cool":0},"TwRnC-zz3YN4m1jURnNvPg":{"text":"Horrible food and not sure what he deal is with this place? It's supposed to be great but ","useful":0,"cool":0},"0SlfOkok4LDPg2_uQojFow":{"text":"We came in without reservations, and waited about forty minutes in the front room. Fun atm","useful":1,"cool":0},"-H8bCrBaTdyuaLapCFSAAg":{"text":"To die for...Irene's oysters, amazing wine selection and the new location is beautiful old","useful":1,"cool":1},"cUDWzMK-Eerd8oNTV9NgPA":{"text":"Oh. Oh.oh oh. I LOVE YOU. If the food had sucked, I'd still have given Irene's five stars ","useful":0,"cool":0},"a0ppAqvJRPD7MKcZhzV9tw":{"text":"Truly one of the best dining experiences I've ever had. Impeccable service and a wonderful","useful":1,"cool":1},"nWbRejx4JOfYwnriuWpRxQ":{"text":"I love coming to Irene's when I am back home in New Orleans. The key is to come right at 5","useful":1,"cool":0},"NyBuUCX0majNwDe7xoOF9Q":{"text":"Went to Irene's last night and had an absolutely fantastic meal. Started with Caprese sala","useful":0,"cool":0},"Lr_zoinyplG5cjWzOPgBWA":{"text":"Waited 2 hours in the cocktail room for a table but it was worth it! They had a piano play","useful":0,"cool":0},"9guf5NJBgwzLXDg-fvdl5g":{"text":"This is our favorite restaurant. Awesome menu. Reasonable price. Ambience the best. Treate","useful":0,"cool":0},"QvDwYQe3BwqHS1XINEBH8g":{"text":"Our group of 5 didn't have reservations and we were seated in an hour, as promised.  Altho","useful":0,"cool":0},"7urXlijiuZXNbePsAXhjXQ":{"text":"A bit of a long wait to get seated, made bearable by the Abita beer & the wait staff, wort","useful":0,"cool":0},"BBCEyQx2b-K4ILe2Vf61kA":{"text":"Wow. Was wandering around the quarter looking for a good place for dinner and found it. La","useful":0,"cool":0},"t2hd4lUFYtg0tiKTP3_DJQ":{"text":"This is definitely the place to go whether you're a local or just visiting \"The Big Easy\".","useful":0,"cool":0},"fJCkvBuTG7AAUTYxLMvBmQ":{"text":"Yum! One of my favorite restaurants in the French Quarter! The service is impeccable, and ","useful":1,"cool":1},"QcvpIJRNMRFKSGLAEspZ5A":{"text":"AMAZING Dinner! As the couple who were leaving Irene's as we were walking in stated \"You w","useful":0,"cool":0},"27z3zNtUprSWFckbFmYTyg":{"text":"I've been going to Irene's Cuisine fairly regularly, 2-3 times a year, for the past 10 yea","useful":7,"cool":2},"sp0hagdab3tRQZ48hx9Hog":{"text":"Six of us came in for dinner and all left happy! Great service, great food. A hidden gem!","useful":0,"cool":1},"NAPIHhoQ3L1u2OMZN0KhYA":{"text":"This was our favorite restaurant in NOLA.  It's on an attractive side street in the French","useful":2,"cool":0},"wyp3x5kwm7b4AuWybDFH_g":{"text":"OH MY!!!\nThis is my first review from Irene's , but to be honest I have been eating here f","useful":1,"cool":0},"EC5OY-OXzj75IW5es7Yblg":{"text":"Oh Irene how I enjoy visiting your house...er.. I mean restaurant.  Right?!? it's one of t","useful":0,"cool":0},"LlNFSuGh4Ltse2YTH65y_A":{"text":"Went here on Friday night.  The place was packed.  We had a great server.  We ordered a Ce","useful":4,"cool":3},"mn3gZx1pjDp2xBuEA0cSQQ":{"text":"My husband lived in New Orleans for several years.  It was hands-down his favorite restaur","useful":0,"cool":0},"FaVduKjv76d5IG2O5QY-UQ":{"text":"Food was good. Bread was weird, very hard. They served a Langnappe right when sat down. Th","useful":0,"cool":0},"JPEjmqIYxlIE332CDoPjLQ":{"text":"Why is the line so long for Irene's? Is there free cocaine at the end? \n\nNo. At the end of","useful":22,"cool":16},"N-g4sFk8R8BTI0lJ2ntyJg":{"text":"AMAZING! So charming and the staff is just lovely.. we both had the specials: starter: sea","useful":0,"cool":0},"pG9WBmmJDkmHf6PDg3Gd1g":{"text":"How is it that when your group made a reservation TWO MONTHS IN ADVANCE, your stuffy Maitr","useful":1,"cool":1},"ftggZh_XD3SY75nPV63UAw":{"text":"There are few meals that are memoriable but this is one of them. The best steak of my life","useful":0,"cool":0},"wzIXo48-oWY8EuE60-6V8Q":{"text":"Ooohhhhhhhh my. This place is AWESOME!! I would definitely recommend making a reservation,","useful":0,"cool":0},"xv25pcImQyiEWjADq2ylpg":{"text":"Waste of time. Another NOLA restaurant not caring for tourists.  Called at 8, asking to ma","useful":0,"cool":0},"9RRlMQWVKIUxe2LTNrmCtA":{"text":"Lately I've been a big fan of fish dishes with a light sauce so the Drum Crevette was perf","useful":0,"cool":0},"Rm_xoSeWLA77_81_WkunRw":{"text":"Really, really good food! This place is like a mystery woman. You wonder where she's been ","useful":1,"cool":1},"vsLn3c8kI3eRbkTbhYtgKA":{"text":"Absolutely wonderful. We are foodies from Northern California and I would say one of the t","useful":0,"cool":0},"mNv7cdL66BOQic5JGu-3kg":{"text":"Delicioso!  I was hesitant to eat Italian food while in Nola, but I am so glad that we did","useful":0,"cool":0},"33MSq4N2M7ZznRPCz0BWpw":{"text":"If you're having dinner alone, don't even walk in there. Save yourself the hassle of being","useful":0,"cool":0},"gEaMfZPny6pLicvvo4vA_A":{"text":"Get ready to stuff your face. Prices for this quality of authentic cuisine were reasonable","useful":0,"cool":0},"VGM-L3f36SpToF1EZ4k2QQ":{"text":"Irene's got a shout out on the new HBO show \"Treme\"!  Eat there! You won't be disappointed","useful":0,"cool":0},"1Wlyvj60mE4t568SDWXS3Q":{"text":"This was our second visit to Irene's and it did not disappoint. We knew there was usually ","useful":0,"cool":0},"Bdr9j8Ub1rZNt9USyvwopw":{"text":"The cheese cake is truly the best I've ever had anywhere - the fish and ribeye were outsta","useful":0,"cool":0},"xErvUGzuj4HSWuisqhpiDQ":{"text":"Perfection!!! Ask for Dan! Best waiter in the world! Eat the lamb","useful":1,"cool":0},"HbwqTwgDuELWFWa_D-CQBg":{"text":"I do not usually rate any restaurants, especially before I go out if the place. \nBUT... th","useful":1,"cool":0},"awgO2DHXcMICApFhac9g4Q":{"text":"Just when you think a trip cannot get any better. With Mardi Gras beginning to roll in NOL","useful":0,"cool":0},"hUdYv1e9vQML48YfGe0mXQ":{"text":"Wow.  Holy wow.  This is some great Italian food.  Small place but adds to atmosphere. \n\nT","useful":2,"cool":1},"cvHMWb7SdhsUExOAtEYSlw":{"text":"I give it the most stars although there were only 2 plates I could eat (not a vegetarian c","useful":0,"cool":0},"xsYi0oizrg95fduQoXeyjg":{"text":"I'm writing this review from memory since it's been a couple of months since we were there","useful":1,"cool":0},"EsliAA61zYRIaj6UAjtBXQ":{"text":"Superb customer service from start to finish. We arrived well ahead of our 9:15pm reservat","useful":0,"cool":0},"zeTMfz--Q6hg5HwVrv_ASw":{"text":"Great ambiance, our table for 8 was set up in approximately 10 minutes at a peak dinner ti","useful":2,"cool":2},"gg-pKlDbPKq16MT1lB0_3w":{"text":"GREAT SERVICE, GREAT FOOD!!!\n\nLoved the people here. Loved the atmosphere. Loved the food.","useful":0,"cool":0},"so7Vj1tuhs1NFknH0PirzA":{"text":"The place is still great! Been several years since I had eaten here and was so happy to fi","useful":1,"cool":0},"JTYWu9QLm545jOeOKKPlww":{"text":"The best food in the quarter. Not a tourist trap like so many others. Didn't have a reserv","useful":0,"cool":0},"6TwB6JP6jHLBp5zASP8jig":{"text":"To me this is the best place in New Orleans ,music ,food ,wine ,drinks ,and the service!!!","useful":0,"cool":0},"igf_Gl8HMrLRhkLO9bBjcQ":{"text":"We stayed in NO for two days, this is an absolute must do. I know NO has NOLA, Antoine's, ","useful":0,"cool":0},"JI4YpVHBlSRsfFYIJWwfXw":{"text":"Deeeeelish.  Meatball app.  We actually got that AND an appetizer combo platter.  \nA-mazin","useful":0,"cool":0},"AHJcdfVEWWjiFV3vUY0hVA":{"text":"Checked out Irene's while celebrating two friend's birthdays in New Orleans. It was HIGHLY","useful":1,"cool":0},"F6zOmQakd7J8OYCLmb8BBA":{"text":"When doing the French Quarter, it's easy to get distracted by the hoopla and hubbub, after","useful":2,"cool":1},"bYxSNnerVA_ob9AQQ-glgQ":{"text":"We had the San Francisco seafood and duck. Both were amazing and the atmosphere is so remi","useful":0,"cool":0},"d_JQseHi13xWBj34Y4xEpA":{"text":"Once again the team delivered one of the best meals I have ever had. I make a point to enj","useful":0,"cool":0},"LBO2KyUmBo0gze9QuyyvsA":{"text":"Simply amazing!  Best damn ribeye I ever had  Our server David was amazing!  The sausage a","useful":0,"cool":0},"HHww9vVSx1x0OtuynjCktg":{"text":"I LOVED everything about this restaurant. The food was impeccable, the wait staff was cari","useful":0,"cool":0},"WkhBMqbeair4oCmsZU-NqQ":{"text":"Amazing everything here, no complaints! The service is impeccable and the food as well.  A","useful":0,"cool":0},"qWmgH8W84CtzGXAEFRgyzQ":{"text":"Dear Irene's,\n\nI miss you, I hope to see you soon.  Whenever I think of you, I close my ey","useful":3,"cool":6},"BEmmlW0IbSsvxK1XKCaq7w":{"text":"Hard to get a reservation but well worth the effort. We have tried the Lamb the Fillet the","useful":0,"cool":0},"gYE4aVnHP4RUgw-GQfKw1Q":{"text":"Outstanding food, service, and wine selection.  One of the best places to go in the city f","useful":0,"cool":0},"PFfxIN--tQPqi0htsj_ylw":{"text":"Yum, yum, yum! Always a must stop when we are in New Orleans. Well worth it!  The Chicken ","useful":1,"cool":0},"1xZ8tiMTOEsgl21KRcrfIg":{"text":"Cheesecake and pianist were excellent but even better was the service. Orlando had served ","useful":0,"cool":0},"ghEEzno0apz6po9UlHJrsw":{"text":"Come here every time I'm in NOLA. It's a favorite and everything on the menu is a great ch","useful":0,"cool":0},"K9Tq3OrpweQ06CgI3kLMQw":{"text":"When we walked through the cute, rounded door on St. Phillip Street into the restaurant, i","useful":1,"cool":0},"Grj2vg4M_MhFG14C2XL_ng":{"text":"Enjoyed our 15 year anniversary dinner here. Food was excellent! The lasagna was light and","useful":0,"cool":0},"DoDL34uIUjUjk3kN9GU9wg":{"text":"Soft shell crab entree was some of the best I have had...truly ever.  Soup with stuffed cr","useful":0,"cool":0},"NieMSWO7YPNENyyePCnSvA":{"text":"I wish I could give 4.5.\nThis place is pretty amazing. Very fun, and a good time for large","useful":0,"cool":0},"ulY2UkDEqetYYYQLSHLYUA":{"text":"Went on the recommendation of my sister and could not have been happier.  Our group of 12 ","useful":1,"cool":1},"qOxiRgNlYHIWEJG5zrp69A":{"text":"Fantastic and a nice break from crazy Bourbon Street.  The food was wonderful and the serv","useful":0,"cool":0},"p0qucgIRMuhZOc2QypiITQ":{"text":"Great food, good service, everything is so wonderful \nMy recommendation is watermelon sala","useful":0,"cool":0},"sCUdo0CQQoXK9uJ2WyCvtg":{"text":"Absolutely delicious food, couldn't be more satisfied! The staff were all extremely friend","useful":0,"cool":0},"sanvITImeLWlKWxVak_OWw":{"text":"While in New Orleans over this past weekend for a bachlorette party, our group of 12 or 13","useful":0,"cool":0},"Wf1lE4q_77P_lqpOC__I-g":{"text":"I want to start by mentioning that this place has exceptional service. We found out about ","useful":0,"cool":0},"dgsATlksyLvfccHEbRypSQ":{"text":"Fantastic service! Wonderful cuisine! Someone actually put their arm out to escort me to t","useful":0,"cool":0},"xeRVE1iDCqLBGHiiYEPYrg":{"text":"The lamb chops are to die for. So perfectly cooked and the glaze will send you to heaven.","useful":0,"cool":0},"Z9nWFIWbXRU-FPgSdcaazQ":{"text":"I was a bit disappointed. Gw finn was much better. Meal was good but not stellar. No bread","useful":0,"cool":0},"ZlEr3MpDVyAVylJo47XqPA":{"text":"We went on Saturday and later about 8:45 but it was busy and waits to 90 minutes or so. It","useful":0,"cool":0},"bcCeyJgbwmFVE782yQ_OXg":{"text":"The duck was really special - incredibly tender and flavored with crispy skin. Aye an earl","useful":1,"cool":1},"hANz1fAsyd1j4_kSpKzzow":{"text":"Don't waste your time. Told 45 minutes to wait. Left after an hour and a half. Go to to To","useful":0,"cool":0},"nBsEzB0XoqCP_5Xcf-A7bQ":{"text":"Outstanding restaurant in every way. \nThe ambiance is so relaxing and comfortable. Our wai","useful":0,"cool":0},"ZuQRWTSxMHAe7DZ7kvIJjA":{"text":"This place is lucky to get one star. When you refuse service to people wearing Alabama gea","useful":8,"cool":2},"zioT9Il3iFD_oAhDq5-lIA":{"text":"We love Irene's. We have for a long time. We always will.","useful":0,"cool":0},"7AqUgO2zcHTiJmyWqzNw3A":{"text":"This is my parents favorite restaurant. The food was phenomenal and staff were great. We h","useful":0,"cool":0},"zAD7A875GHzb6FrtXzav6w":{"text":"I've been wanting to eat here for so long and it finally happened. what an amazing experie","useful":10,"cool":9},"V7_Edgexj_Qb4L0_C5ISUQ":{"text":"First, the positives. The atmosphere and service is excellent. This is the perfect place f","useful":0,"cool":0},"wZ4n_gdrGQ1jD7Kfx85plA":{"text":"First of all, Irene's cooked the best filet mignon I have ever had. If you like steak, get","useful":0,"cool":0},"6VfQDXFlo5oNKU3jUAMmcw":{"text":"Took friends of ours to Irene's for their last dinner before departing back to boston. The","useful":1,"cool":0},"-c6B3KeuM_kUkqplao9dxQ":{"text":"Watch it!   This place is small, and very popular.   We had a reservation for two, so only","useful":0,"cool":0},"tYrMXb_YIcd7k-nGXi3ilg":{"text":"GOOD food - not GREAT food. Menu is small & not exactly what you think of when you think I","useful":1,"cool":0},"Mm_oLFBXSPmZOD0F2zPMbg":{"text":"This is my second visit here and it was as good as the first.  Took someone who was visiti","useful":1,"cool":0},"zpDW9ghunc3MgednFB3VaA":{"text":"OH MY GOODNESS !!!!!! Where do I begin!! My husband brought me to New Orleans for my 25th ","useful":0,"cool":0},"PJBhi0f9xEew9GtU1eg3XQ":{"text":"As I suspected, the more I go to Irene's, the better we are treated. The waiter said it be","useful":4,"cool":2},"O6lRHM4MLXZFXDHzUlZcmg":{"text":"Amazing service and attention to detail at this delicious little Italian place on the edge","useful":0,"cool":0},"A9anJt4pBRlnfzpr4ETvBw":{"text":"Irene's Cuisine made for a fun evening in both the back bar (with live music) and the dini","useful":1,"cool":0},"tzGXzwFBf17iwRLFbQWVrA":{"text":"When we first arrived we weren't sure what to expect because it was 4:45 and there was a l","useful":0,"cool":0},"lvZAJ_k7nrou0jSECcQJ4Q":{"text":"It's hard to rate this old school, homey, italian restaurant in New Orleans.  On one hand,","useful":4,"cool":1},"iPC0b1XVA6UuHKHpcloOtQ":{"text":"Great restaurant and excellent service. My wife has the homemade lasagna and I had the duc","useful":0,"cool":0},"6K7J4s5pnC9-Pkph1Qvc8Q":{"text":"Loved Irene's!!! Recommended to us by a friend and absolutely did not disappoint!!! The fo","useful":0,"cool":0},"t65w0gSMJozT7t4tUvqkMg":{"text":"A friend was raving about Irene's, so last minute we decided to walk.   Of course it was a","useful":0,"cool":0},"N75Ph-AkQjcQYF539kTnxw":{"text":"Great spot in a quieter section of the French Quarter.  Rustic old building with interesti","useful":0,"cool":0},"IbtL9WJRPQJa21dbxzyFDw":{"text":"Either come when they open at 5:30 or make a reservation or u will literally b waiting an ","useful":1,"cool":1},"nIxJkVx1hSuRx1purmPi0Q":{"text":"Came here 10 years ago and remembered it being the best meal I had ever had. \n\nHow time ca","useful":0,"cool":0},"iVWv9Zy5CQDGvR6VZhDaMw":{"text":"Service was excellent. The meat and cheese tray was tasty and I had the soft shell crab wh","useful":0,"cool":1},"O2c68JzufxWM52JnTHBUzA":{"text":"Enjoyed most of the food. They start with some complimentary bruschetta. I'd recommend the","useful":1,"cool":0},"1yQjzlcmDDQLfD6fflZyfQ":{"text":"Irene's was absolutely fantastic! We had a very large group which they handled with ease. ","useful":0,"cool":0},"wcSBkuy07Nvu-QAuQkgfxQ":{"text":"I discovered Irene's while in New Orleans on business.  I took a party of 8 here for dinne","useful":0,"cool":0},"UCidXMvvR4T6AbeYvYVXww":{"text":"Super cozy joint in the historic French Quarter. This was the first restaurant we hit upon","useful":0,"cool":0},"7bYIktmA8g79-dN1Q7JGsA":{"text":"Went there for a business dinner, it was nice.  We've done high-end Italian before and thi","useful":0,"cool":0},"1voZ8TpUNAj2JwNBX3jP3g":{"text":"Absolutely delicious! Everything! The dinner, the waitstaff, the dessert, the wine. Everyt","useful":0,"cool":0},"Y9U-lUdG2IqLC4ezYR3vGA":{"text":"++Excellent food! They have the best chicken dish!! Perfectly roasted chicken in a very li","useful":0,"cool":0},"rViYTkw-bL9NHkdUbY2sIA":{"text":"Cheesecake recommendation was spot on. My relatives loved it. Best meal yet on this trip. ","useful":0,"cool":0},"7WUxnrxyqQH3nMiB_4sn_g":{"text":"This was, by far, the best restaurant I ate at during my trip to New Orleans.  You can try","useful":1,"cool":0},"nk-nPM47VUFb-eXPz2sUBA":{"text":"A very good example of an old Italian restaurant, it does have the classics, in a very int","useful":0,"cool":0},"EVlzLixGaF1bZv47oBkNuw":{"text":"Excellent food, service and atmosphere. Sea food was perfect, everything really tasted exc","useful":1,"cool":0},"eIZ25uprt-KGRTjM5MSdFA":{"text":"We loved everything about this place - the small rooms, the ambiance. The good was excepti","useful":0,"cool":0},"Wkf6-f-RlSECVoqTuaEN8g":{"text":"I had a fabulous vacation spending my favorite holiday, Halloween, in New Orleans. I staye","useful":1,"cool":1},"BHbZ22qZAbQTMjL0NtmxGw":{"text":"Lamb chops were Amazingly Delicious all the way to the bone. 'BoneSucking' Good. Shredded ","useful":0,"cool":0},"I2BjdKh6bFRXCOQ7iK0aow":{"text":"There were six of us and two are extremely picking and quick to dislike something. All six","useful":0,"cool":0},"rJ6OHErtgM3WckFHme70lA":{"text":"We came in with no reservations and were told the wait would be about an hour. Although it","useful":0,"cool":0},"eXHH83InzVkJhG6tlf_TwA":{"text":"Both times i have dined at Irene's (once in 2012, once last week), I have been completely ","useful":0,"cool":0},"mdl-g1aeuLchNCtShBGBfw":{"text":"This place is too amazing for words! Every single thing that I tasted was AMAZING! It was ","useful":1,"cool":1},"kFFoVaICOuFf9tsFMpBUSQ":{"text":"Wow what a disappointment!  The food was ok-nothing special.  I ordered the trout almandin","useful":0,"cool":0},"0XuNNjIJ0O5UhUAb5y2hVw":{"text":"Great food, great service, what else??!!\nThis will be my \"go to place\" henceforth, recomme","useful":0,"cool":0},"4dc47MGmAgYFGc8ewjx0SQ":{"text":"Great food, excellent service.  I had the meat ball appetizer which was incredible.  Next ","useful":0,"cool":0},"1wYirMPQPV8loaUd8kcBLw":{"text":"I went here on a yelp recommendation and was a bit disappointed. This place was very crowd","useful":0,"cool":0},"gx6nYb4e6Rd8NeUof6Du6A":{"text":"I was surprised to see how highly rated this place is. Frankly,  I've had way better servi","useful":0,"cool":0},"k4K2LCfRjXW92FJeLVe8Cg":{"text":"This is one of my favorite places to eat on the planet!  We stumbled across this place by ","useful":1,"cool":0},"co7VJVdE6GCFNSHyF28bsA":{"text":"One of my favorite places in all the world to eat. Everything is as good as they say, but ","useful":1,"cool":1},"0gd6Renajz0F01t7gA17Kg":{"text":"Wow. Very good quality of food. Small, quaint little place with a few tables that are very","useful":0,"cool":0},"uk2WorjQTBi4mxdZdi4njA":{"text":"My first visit to Irene's was such a great success! Our waiter Daniel had a good show. The","useful":0,"cool":0},"tEdg07OMUHasrlyqYWXCag":{"text":"If you love Italian food, and who doesn't, this is the place. Warm and inviting atmosphere","useful":0,"cool":0},"oxfUeyhgLKuvawXmNtVH3Q":{"text":"Thanks to Marita!  She directed us newbies to Irene's for supper last Friday night.  We ma","useful":0,"cool":0},"leE33-eOR0I3ZPQMOIn2fw":{"text":"Oh yeah! We have found our local spot in NOLA. We were recommended by the bartender at one","useful":0,"cool":0},"qGtbDea76cLy5F-KbGOiLQ":{"text":"It is NOT OK to have a reservation and still have to wait 40 minutes. \n\nWe made time pass ","useful":6,"cool":4},"sz15EJL7z-mqBXdv-OmtzA":{"text":"Amazing Food! The Servers Were ok. I also wish I would have known to make a reservation be","useful":0,"cool":0},"_oWzwgrKssSXmx-yZyBR6A":{"text":"Irene's is great! I've been there a few times but most recently for a birthday party where","useful":2,"cool":2},"RkRjLI9msydQLy40VC7L1Q":{"text":"This review is based on my experience several years ago but I think it's still valid. My p","useful":0,"cool":0},"5k7zCxnckhdVAljojIkjbg":{"text":"Loves this place! We've been many times and haven't been disappointed. It's a well kept se","useful":0,"cool":0},"N9WstMw6sS9CfWeSpKD72A":{"text":"My parents kept talking this place up and I was not disappointed one bit.  The escargot wa","useful":0,"cool":0},"hUrB4aG-oFU8id4nAEYIHQ":{"text":"This is what Nola is all about. History along with great food and great atmosphere. \n\nWe h","useful":0,"cool":0},"Smh0ZnqVbk_-m0AnnSTeLw":{"text":"Referred to by a friend of mine I couldn't pass up the opportunity to indulge in the local","useful":0,"cool":0},"jAcg8H6cXfDaCfi9-wj4gA":{"text":"This what's a memorable meal. From the second we walked in to the last drop of our cappu","useful":0,"cool":0},"VqzVLvf_Ed2gPzW53ntGFQ":{"text":"Great ambiance, great people decent food lacking vegetarian options they made my partner a","useful":0,"cool":0},"qfINEbSkOoHm4aofYnqEVA":{"text":"Stopped in without reservations and had to wait a half hour for a table.  Not bad at all f","useful":0,"cool":0},"uf6b7AmUHM1P741BQyplvQ":{"text":"I. Love. This. Place.\n\nMy boyfriend and I were in New Orleans back in May, and we both agr","useful":1,"cool":0},"ylJZGVZYOiG2CAb1rN0whA":{"text":"Again, everything prepared fine, service was good, did not have reservations and was seate","useful":0,"cool":0},"K9rVkMePE2iNg7IWFfICMw":{"text":"What a dining gem in the French Quarter! The whole experience from start to finish was jus","useful":0,"cool":0},"U9K9MNm7ccaOLLexaMsPcw":{"text":"One of my favorite overall dining experiences in NOLA. The food, ambiance, and service com","useful":2,"cool":1},"MeCI_Q6FC8veQrzz9RjO7Q":{"text":"absolutely wonderful!!  The best braised lamb I've ever eaten, and I love to order lamb wh","useful":0,"cool":1},"ZX2NRLYX2_1gIeRT6wPuZg":{"text":"They take same day reservations! This was excellent! We walked into this sort of tunnel re","useful":0,"cool":0},"IxOvCotHVuLicPDjxNw9rA":{"text":"Great atmosphere, nice wait staff and fantastic food.  This is a great place for a meal.  ","useful":0,"cool":0},"y3WxM18Kqafi5InJhehTgA":{"text":"Let me start by stating that I have enjoyed Irene's Cuisine for years.  Irene's is always ","useful":2,"cool":0},"Mu8N-sF8hejFS122qsd5cw":{"text":"Irene's is one of my very favorite places in New Orleans!  From the piano bar with table s","useful":0,"cool":0},"aExaeGqe7Akygsy66hSu4A":{"text":"Some of the best Italian food I have had. Was there celebrating the birthday of a friend. ","useful":1,"cool":0},"g_GK9zSVsdS3n5eq53itPg":{"text":"I'm so glad my friends and I decided to stop by for dinner. I would recommend placing a re","useful":0,"cool":0},"8OB0CGv98qZgNNiDearURg":{"text":"We went to NOLA for my boyfriend's birthday. It was his first time in the city and I wante","useful":0,"cool":0},"zjgPWdHWGWdUWavclWhXNQ":{"text":"Can't go wrong with the soft shell crab appetizer.  The tomatoes on the Caprese were a tad","useful":0,"cool":0},"1cjtpgD8GrFhJqjJU_t5lA":{"text":"Let me first start by saying that if I could give them six stars I would. Irene's cuisine ","useful":0,"cool":0},"Wg6K3Xx26Pfd6zYTd2hDrA":{"text":"Great service and great food! One place in New Orleans where the staff isn't \"stuffy\". Our","useful":0,"cool":0},"8Xw8ojZ51Sgd_8QWYVF2nw":{"text":"Delicious food, amazing ambiance and great service! We had the fish, gumbo and asparagus m","useful":0,"cool":0},"GyLh98fmWaGDTHElMAiYeQ":{"text":"After I got a recommendation from the bed and breakfast place I was staying at(Lanaux Mans","useful":0,"cool":0},"Uc2xFluv1O1_hE_9I-qBKA":{"text":"I was so looking forward to a wonderful dining experience, but unfortunately, I did not ha","useful":0,"cool":0},"5W9Qgp--YxWm56u6xmC3Ew":{"text":"The food was absolutely delicious and the service was even better! Our waiter Matt was ver","useful":0,"cool":0},"cz59NfQHYz_7EnvAS9FyrA":{"text":"Was in the Big Easy this week and ate at several different locations. Best dinner of the w","useful":3,"cool":2},"pbX78qZvoLTYUIeknUg4bw":{"text":"Having a hard time finding any faults here. Went with a party of 10 during the BCS weekend","useful":1,"cool":1},"4Mr0j7hIV0_0dPSirKfgbQ":{"text":"If I could give this restaurant negative stars I would! No apologies for waiting for 2 hou","useful":0,"cool":0},"Kqm6yxlyt5GpKVEb0Y9J2w":{"text":"Lovely evening at Irenes.  We had the escargot which was very good.  The  Bibb salad was t","useful":0,"cool":0},"5SajlfocUPrEjbdIsqaMZw":{"text":"The food, wait staff, and owner all deserve five stars.\n\nThe food was excellent!  I had th","useful":0,"cool":0},"qPJ-zmVHuGtjSMF7GSVvUg":{"text":"5 sisters out for a special celebration of 2 birthdays.  We chose Irene's.  Each of us got","useful":0,"cool":0},"6lWzwgvvoVJIsaRxMMSFIg":{"text":"This place was recommended to me and it didn't disappoint!  As soon as you walk in the sta","useful":1,"cool":0},"F8_tBZm46gGRE64f_ZPP5g":{"text":"My boyfriend and I stumbled into this place after abandoning our Haunted Tour.  The staff ","useful":1,"cool":1},"mSTtmwEO1rsfZu3G4jw2uw":{"text":"Very cozy and intimate place.  Great service. The Ceasars salad was dry and bland. Lasagna","useful":0,"cool":0},"87qJl00uToP6kMHqpOyB-w":{"text":"My colleagues and I had very limited time to actually explore New Orleans while there on o","useful":0,"cool":0},"3DJJT7jH92eoA_SiTCdMZQ":{"text":"What a lovely place to take you wife to dinner.  We are visiting NOLA for the French Quart","useful":0,"cool":0},"axEuRHNhR5K5mneg8VJuPg":{"text":"Food and service here are definitely on higher level. The kitchen shows master techniques ","useful":0,"cool":0},"8ag8XWqifocO6RcPTsbdEw":{"text":"The service was excellent, unfortunately the food was not.  The oysters Irene (appetizer) ","useful":0,"cool":0},"LdJE-IVaaV8MerB2MFTtuw":{"text":"Our server Orlando was great. He gets 5 stars\n\nThe food was decent.  Got the meatball app,","useful":1,"cool":0},"HtVoaA90fJlXp_ikLbaUTQ":{"text":"I've been here a handful of times... usually for Mother's Day or something and ALWAYS with","useful":1,"cool":0},"iZ1wkunPxWpY7K6gh_AATg":{"text":"Always love Irene's. We went with some family on a Tuesday night. Several of us got the so","useful":1,"cool":0},"AspGVzCIpjvrQP5SdMoppw":{"text":"Awesome place to eat it!!! I found it expensive but at the price of the other restaurants ","useful":0,"cool":0},"svodLsETrwCRPzWO_Y3ocQ":{"text":"This is the best restaurant on Earth!!!\n\nWe ate here and the service was great! Our waiter","useful":0,"cool":0},"Ac-WH4dqAQNDQVOfFxalzw":{"text":"Whoomp Whoomp. Pretty overrated in my humble opinion.\n\nIrene's was recommended to us by 3 ","useful":1,"cool":3},"0h7_-KnhjGama8GOaUu8yg":{"text":"I'd give it 10 stars if I could , this place is the nicest place to eat in New Orleans, th","useful":1,"cool":0},"WVnTmucx6GZ2KOYSGgDmdA":{"text":"I have been wanting to give this place a try for the last few years, but have never seemed","useful":1,"cool":0},"DEk9KAkVptDnUPnEqfcW9g":{"text":"Good but really not at the next level. Irene's has a old school Italian vibe with some sol","useful":2,"cool":0},"qPitlu17WwfOun7aszbL4w":{"text":"We were lucky enough to stop by here blind. No reservations. On a week night with nothing ","useful":0,"cool":0},"qBVFx8SvnkTLlhvi5H_IKg":{"text":"As a local, I typically avoid the French Quarter whenever possible.  But when someone says","useful":1,"cool":0},"1C9iuwM28O1ey8nNc8KtZg":{"text":"We chose to go to Irene's based on two personal recommendations and its great yelp review.","useful":2,"cool":0},"rfaPfybAWqMD_BB6mGa-TQ":{"text":"This is by far my favorite restaurant in New Orleans.  The daily featured oyster appetizer","useful":1,"cool":1},"5deRqrKDCqK4gWtT7qHlqw":{"text":"Irene's finally takes reservations on Open Table-yay!\nWe always enjoy dining at Irene's an","useful":0,"cool":0},"ofL5Ag959P8l6uTKSd4Pyw":{"text":"Not as sold on this place as many others. I think those who come in a group or find the ch","useful":1,"cool":0},"ZDpSbhL5gqgZ47IMl6odRg":{"text":"What a fabulous dining experience ... the old world Italian decor was charming and our mea","useful":0,"cool":0},"iynWUgEUBYAi9N9-BC2KYw":{"text":"Oh my goodness! Does it get better?  We felt like we were welcomed as though we were famil","useful":0,"cool":0},"8k2c8-rLgUtrLzLfBJDXTw":{"text":"This is a wonderful little place in the French quarter away from the nonsense of bourbon s","useful":1,"cool":0},"uykvGqhqkFddxT5SH5Kvdw":{"text":"Wonderful atmosphere!!! Food is 5 star!!! Almost as good as Cafe Giovanni!!! So good!!! HI","useful":1,"cool":0},"QlyBiDzTAhqYklibXztGmg":{"text":"I know it lists the attire as \"casual\", but the setting begs for a little consideration on","useful":0,"cool":0},"0QRoOaluy733LwJW_qGOow":{"text":"The entire crew was outstanding. The food is  delicious, desert left me wanting to order a","useful":0,"cool":0},"TvKuVsehHOAtkOI5tBaFIg":{"text":"I don't eat meat or seafood so my family compromised and decided to go non-Cajun one night","useful":0,"cool":0},"v158vd9-y1auf_nCghl9dw":{"text":"I loved this place. The wait staff was wonderful. Our waiter was Sonny and he took great c","useful":0,"cool":0},"AIGXVxIdL-hc2dfq4mYFbg":{"text":"Irene's Cuisine is the complete package! It's not only the food that is exceptional. The s","useful":1,"cool":0},"RrTmsr2VSmd-m5z4BlcaUg":{"text":"The moment we decided (on a walking by whim) to finally eat here (on the rec of several lo","useful":1,"cool":0},"T5gkBDr6dLA4h-ugS4Quvw":{"text":"We were oh so lucky that the Saint's were playing......we got in after a 10 minute wait...","useful":1,"cool":0},"0H4Q2jw0w1IfA68eJrt5dw":{"text":"Excellent food!  Fantastic service!  It is pricey and upscale environment.","useful":0,"cool":0},"DdDlF8gAdOc7nMiebu7N3g":{"text":"The food was great and if possible was overshadowed by the excellent service and atmospher","useful":0,"cool":0},"WKEIuEafHDVog8IEHXpQfg":{"text":"Stumbled into Irene's on Friday evening around 7 pm. Without a reservation were told it wo","useful":1,"cool":0},"xmrZ0JC8r_luqnzPRFf6-w":{"text":"You have to visit here on your trip to NOLA for your dining experiences.\nGreat ambiance, a","useful":0,"cool":0},"lDKTChod5V6-h4Ye9z8kBA":{"text":"Irene's lived up to all the hype and rave reviews. We didn't have reservations but showed ","useful":1,"cool":1},"ATl7yJ__z48HRtUBJp-cDg":{"text":"Back again and better than ever. I always have their Duck St. Philip and it was fantastic.","useful":0,"cool":0},"8sM4wedHx6jBQGpktKnXNA":{"text":"The best food in NOLA!\nMust try caprese salad, cheese board and lasagna.\nEverything was de","useful":0,"cool":0},"RX6MRBKiA4WsRhGWwgvBUQ":{"text":"Everything was so delicious that I even wanted to eat the plate. Daniel was a great server","useful":0,"cool":0},"Zqg0YG2MQqE7VVYEEXb1fw":{"text":"Came here in October of '08 during my first and only visit to New Orleans. My friend and I","useful":0,"cool":0},"WM4dS2qQsHTurBFLn74FzQ":{"text":"Hands down best italian food in the city. I even had the chance to meet Irene herself whic","useful":0,"cool":0},"4k8xWtKTP91VUfqD0lutXQ":{"text":"Italian restaurant that is very popular to the locals.   Great wait staff. Great food. Gre","useful":0,"cool":0},"KnnpQmhleXQqwctRUv3lWw":{"text":"Wow. Wow. Wow. Everything here was impeccable. First off, our server Micheal was GREAT. Su","useful":1,"cool":0},"oGVHrKIMc2w2LiV7JmL8Gg":{"text":"Came in for dessert, which was flaaaaaaaaaaames. Service was instant and beautiful. Ambian","useful":0,"cool":0},"mvJNpoODgqE4AdFdgTMEPA":{"text":"We tried just wandering in here on a Friday night, but decided we didn't want to wait the ","useful":0,"cool":0},"zM0OYwmiFPBIXq-aWV0o8A":{"text":"WONDERFUL. My parents were in town visiting me, so obviously I had to take them to a fancy","useful":0,"cool":0},"YCftdpJLWvmPrBmY2Ye7PA":{"text":"On three different occasions while visiting New Orleans we attempted to make reservations ","useful":0,"cool":0},"JjQi8XLhLSP3vSyZYScjMQ":{"text":"I had visited Irene's last January for my birthday. It was amazing! I had a friend come in","useful":0,"cool":0},"98hciaxZTKWrV3Kf0_Ahxw":{"text":"Irene's is our favorite restaurant in New Orleans. My wife and I have been numerous times ","useful":0,"cool":0},"dODuZU8Z-ilOONQTve776Q":{"text":"One of my favorite restaurants in New Orleans.  Great food and atmosphere.  Good for a qui","useful":0,"cool":0},"TU8Zhnf6QB5QLDTetNL53w":{"text":"A great night with Sonny the waiter and everyone else helping out.\n\nWhat a great place wit","useful":0,"cool":0},"qe8jGgtavzKZV7yZGosGDw":{"text":"Magical!!!  I've been Irene's a few times\nAnd it never fails to be a great meal with top n","useful":0,"cool":0},"MIwgpGMi--H9Iz4oWFyfiw":{"text":"Irene's is top-notch.  We would have missed out on this locals' hotspot except our taxi dr","useful":2,"cool":0},"igRHPjFzi8wmESRRml9OUg":{"text":"Great restaurant, great food, great service. Definitely worth going to in New Orleans. \nMy","useful":0,"cool":0},"EMsY2ZATlmEIiPT34aupIg":{"text":"Still remains go to place in NOLA.  Helps to make a reservation if you can get them to ans","useful":0,"cool":0},"EPd9R7unWmz9VDzial58QQ":{"text":"Irene good night Irene; Irene good bye; We've tried your food, your service poor, We won't","useful":0,"cool":0},"fJD9QtvnmMiGtuTXT7u_rg":{"text":"My favorite restaurant in New Orleans. Love our server, Dan. Love the mussels and the lamb","useful":0,"cool":0},"ke97Ua7rAwdgIpZm-m8OHQ":{"text":"Very romantic and lovely waiting area to have wine and listen to piano music until your ta","useful":0,"cool":0},"xtTWBeF1_Q7Z97O8__rY7A":{"text":"Great food, great service. Don't really need to say much more.  Irene's was the only resta","useful":0,"cool":0},"ozi4ka20ZTnNH443FB6sDA":{"text":"OMG, what a great place, I had the ribeye special and it melted in my mouth! Friend had re","useful":0,"cool":0},"Plkol0Mpvc3ezjOP7JL8zw":{"text":"Ahh! The ambience, the new place, the old feel! The food! Every morsel of every dish was a","useful":0,"cool":0},"U1ONT9-HB9b3oVK30fpnew":{"text":"The only restaurant I have ever given five stars.  My wife and I agree -- the best all aro","useful":3,"cool":2},"txFPBuwAdD3UHq250oLFrw":{"text":"Long Wait the night I went, but the food made it up.  iT WAS DELISIOSO!! Thats all I gots ","useful":0,"cool":0},"4RGd2hZ3bfnnIqUjWQwZZQ":{"text":"Everything is wonderful here! Dan is simply the best wait staff ever. I had the soft shell","useful":1,"cool":0},"VZ7DvaMCIzDNrcMgnHQRqg":{"text":"We came here on the recommendation of two different people and we were pleased we took the","useful":0,"cool":0},"vHRpNz8xISwfXXGG8tHmBQ":{"text":"So Irene's has just sealed it for me as my favorite restaurant. Service & food were wonder","useful":0,"cool":0},"lw-4uS8aokfBDdvkF7aSOw":{"text":"The BEST meal I have had in the City & I dine out plenty.  The Escargot, watermelon salad,","useful":0,"cool":0},"dpBaxR9xDiNAWXhFHkA3Eg":{"text":"This place is a favorite. People will wait over an hour to get in and it is well worth it.","useful":0,"cool":0},"X9HTT3oUxyPl8_LS7GelpA":{"text":"What a little gem in the French Quarter. It was wonderful to see so many locals in this qu","useful":0,"cool":0},"uBmqIi60jSA4HZr22tbmOA":{"text":"Wow.  We ate in a bunch of different restaurants throughout New Orleans; by far this was t","useful":0,"cool":0},"xxxjzG9zY_8_7R7MjNR29w":{"text":"Visited Irene's for the first time on June 11 with another couple.  The food was extremely","useful":0,"cool":0},"1aXcF8AfYCmZ29sE-kJFTg":{"text":"All was good except for the fact that they allowed my bodyguard, Spencer Kent, to dine the","useful":0,"cool":0},"49dSZ87i123iVuwot_HmdA":{"text":"\" Simply  one of the Best Meals that I have had in my life\"  The Soft Shell Crab, melts in","useful":0,"cool":0},"tEb_0ZllcfaCSVR5OaPqkA":{"text":"I've eaten at Irene's a couple of times and the food is excellent however, my last experie","useful":1,"cool":0},"qzQ_jBjpcDx3LKOYi35Mvw":{"text":"Awesome, awesome, awesome!  I was a bit skeptical of this place because it looked very old","useful":3,"cool":1},"6fUgB6g-INhNGi9eNLi9OQ":{"text":"Meh.  I was expecting something more exotic and interesting in terms of cuisine or present","useful":1,"cool":0},"Ph5QnY_QWGNk9KBEe9-wow":{"text":"I just had one of the best meals at my life at Irene's.\nI went with a party of 3. We had r","useful":3,"cool":3},"HOKdlkBh3zjKtKayCaroew":{"text":"I waited over an hour to eat, however it was worth the wait. The food was delicious and th","useful":0,"cool":0},"JlctJWQgO_cCDVku1QHZIA":{"text":"Great little Italian dining in the middle of busy French Quarter New Orleans.  The service","useful":0,"cool":0},"m5773o4vnd1lTmerVzf0pA":{"text":"My new favorite restaurant in New Orleans! The lasagna was delicious and so was the seafoo","useful":0,"cool":0},"zPn1uR4FnmQaDePfypmA-w":{"text":"Now my favorite restaurant in Nola.  The wait staff is the most attentive in the city. I h","useful":0,"cool":0},"6LEnf7bTnIsF4Z9_QSi5pQ":{"text":"Big props to Jonathan, one of the planet's best waiters in one of New Orleans' best gems! ","useful":2,"cool":1},"t9Z2eA5_G3Sh7hc1_k_DVw":{"text":"My phone service wasn't good so unfortunately I was not able to post the pics of the food ","useful":0,"cool":0},"i7Zsi66XftugOBBd62q0CQ":{"text":"3 of us stopped for a meal on a work trip. 3 of us said it was the best meal we've ever ha","useful":0,"cool":0},"toEQbW__HfO2ic2aJtDAnA":{"text":"Although we were recommended Irene's because it was an Italian-infused restaurant, and the","useful":0,"cool":0},"NGvZ8ltUXBXo0t4SIFAcoQ":{"text":"We finally decided to stop by for dinner after work on a Tuesday night.  I must say that f","useful":2,"cool":0},"SoQhOK9Y8reZVgcGn7n8jw":{"text":"I lived in New Orleans for 18 years. For the last 5, DH, my best friend and i were regular","useful":1,"cool":0},"Er4VS6w9aXA4stQjHZpCzw":{"text":"So amazingly good! Service was perfect, food is brilliant - escargot served on a mushroom-","useful":1,"cool":1},"8RdTgSjQLgJfqR6o-m1VTQ":{"text":"Outstanding from start to finish.  We had a 6 pm dinner reservation and got seated right a","useful":2,"cool":0},"TE6p0dvRBpprTm0HpD2gog":{"text":"Love this place - outstanding service and food! I have a shellfish allergy so had the Veal","useful":0,"cool":0},"ekQhyKLRY9Teoql1wYsYTg":{"text":"I'm a certified foodie.  Food (not just Italian food) does not get better than this.  We w","useful":1,"cool":1},"9VMvvmf3z1GJa4NDq7nGRg":{"text":"Great restaurant. We went on a Saturday night so it was pretty packed. We had a 9:30 reser","useful":1,"cool":0},"Dmf6A_KAigSdhDQ7Fv07_A":{"text":"Great place with lots of NOLA character! Food very good not great.","useful":0,"cool":0},"VgOSphUKVzFwgAQjAzsi-g":{"text":"I'd been to Irene's when I lived here in 1996 and it was excellent then as it is now and m","useful":0,"cool":0},"ZmzmOjmWrDiQzvIRlQlFKw":{"text":"We were desperate to find a fine dining place for our Christmas Eve dinner. Most of the so","useful":1,"cool":0},"F3YHt7I4DFZBfbUw9Dle9w":{"text":"Service? - Probably one of the best staff i have ever encountered. Food? I have had MUCH b","useful":1,"cool":0},"EbrdwBqOcfn6GT7lErrLPA":{"text":"The ribeye was one of the best I've ever had. The soup of the day was turtle soup, and it ","useful":0,"cool":0},"5h9tyWVe37nZ2kHSXkYotg":{"text":"My husband and I feel that Irene's is a gem tucked away in the French Quarter that more pe","useful":2,"cool":0},"8aVFfBZw9lfkJssnwwz_PQ":{"text":"this is a nice little place that has a good atmosphere and good food.\n\nThey also have one ","useful":0,"cool":0},"I-EdzUa-OYZ_UlLim-_Ypg":{"text":"Love this place.   Great atmosphere,  service and food.   You also never know just who you","useful":0,"cool":0},"SntZbXjf6GmKuxnLyiBuww":{"text":"Amazing rack of lamb.  Great service.  My friends all had filets and soft shelled crabs th","useful":0,"cool":0},"kTCFlO6IJ9W0ISJ6LAVxtg":{"text":"We dined at Irene's on our 30th anniversary. Walking in we both wondered about the very cr","useful":0,"cool":0},"qcGJuOu5ZaXdBaMDwRKxyw":{"text":"Irene's gets two stars for the service alone.  i arrived shortly after the 5:30PM opening ","useful":0,"cool":1},"oLCIQq33Xm-TsTkTvCwehQ":{"text":"Irene's is excellent. The food is superb. The wait staff is helpful. The atmosphere is qui","useful":0,"cool":0},"2Sof54foLAh5CZ3wuEQHkQ":{"text":"We've been going to Irene's for several years.  It has always been a great place and a gre","useful":0,"cool":0},"NgSuEK3TlkjL_368d8fVFg":{"text":"Always great food & service. Duck St Philip always very good served with spinach & grapes.","useful":0,"cool":0},"U-1sIXfdLbRGF-seuItmPQ":{"text":"I wanted to put zero stars! The owner is a complete idiot. She has servers run her restaur","useful":0,"cool":0},"tAUr-09uY_0rgHnSl-AzPw":{"text":"We ate here in November on the recommendation of a friend from Austin.  The wait wasn't ba","useful":1,"cool":0},"-KZVUnQm5lKioQk9Aujw0g":{"text":"My wife and I had dinner on Tuesday night (June 17) around 6:30pm. We were seated immediat","useful":0,"cool":0},"ssH7bejWjfGF7Vh7f8-sOg":{"text":"Ate here last night. One of the best places we ate at in the city. We had the baked snappe","useful":0,"cool":0},"uAHfouz_Hu1D1uO7pm5Chg":{"text":"My favorite restaurant in the French Quarter! Laced with good 'ole fashion hospitality ser","useful":1,"cool":1},"seRVfAOPrbVBLmaVFcUJTg":{"text":"This was my fifth or sixth time at Irene's.  My first time back since Katrina.  I was surp","useful":0,"cool":0},"466d5XGQRiexDZGpIEZG8g":{"text":"The service was great but it didn't make up for the mushy fish and over cooked chicken dis","useful":0,"cool":0},"sIp0hP6SXCxUMS1IG1F8RQ":{"text":"I've stepped in at  Irene's before and the wait was longer than an hour so didn't stay.  B","useful":3,"cool":2},"RU9mo9z1z2fSAZtzgDtMtA":{"text":"This place was recommend by an old colleague of mine who frequently dines here. I wanted a","useful":2,"cool":2},"xjncn9b6ewqbJ7tEn5xvTA":{"text":"Last night my gf and I took a friend to celebrate her birthday at Irene's. As soon as we w","useful":0,"cool":0},"vE1zb3ZUhq1s7WkOfMFUpg":{"text":"Irene's has garnered quite a bit of attention over the span of it's existence. This place ","useful":3,"cool":1},"WKokSXlNsnBZQFCGJJ-ddQ":{"text":"Does Irene know what's happening here? \nI was underwhelmed and disappointed. We only visit","useful":1,"cool":0},"WVXVtpWq3_8Yemww1MFDJg":{"text":"Everything here was excellent. Very nice and intimate with a casual flair. Good & service ","useful":1,"cool":0},"z4Ej16qK7GU9NSVdYygLXw":{"text":"The best meal that we had during our stay in New Orleans, and possibly in our entire lives","useful":0,"cool":1},"kukduPgGQea1Wpp92oRNvg":{"text":"The food is amazing.  The service is spectacular!  Everyone working there is extremely fri","useful":0,"cool":0},"God-iJeMk7mGXov0fwlKng":{"text":"Great selection, unique dishes and great service and atmosphere.  A NOLa 'must-stop'.","useful":0,"cool":0},"4OUVASBkU65qnpFx9ZDS4g":{"text":"This restaurant was amazing.  I came here with a group of people.  The ambiance is wonderf","useful":3,"cool":0},"PNutiOrDl_ADNmWAnhPu8w":{"text":"Love this place! Favorite New Orleans Restaurant! Great french Italian nawlins cuisine wit","useful":0,"cool":0},"YXuqB-dZO9mE1jU6S7tDTA":{"text":"The food was out of this world, as was the service.  Irene even came to our table which wa","useful":0,"cool":0},"hwsHFRI9K4UZx6xCCbu7gw":{"text":"Exceptional food. This was one of the most outstanding meals I have ever had. The duck wit","useful":0,"cool":0},"bhmaRTdH1_xcCuG94yDAmw":{"text":"Most recent trip to Irene's was wonderful.  There were a few specials offered so we tried ","useful":0,"cool":0},"2Z7zmUXNxEl8xpmRZSlELw":{"text":"We didn't have reservations and this place was busy, but we were still seated quickly.  Wh","useful":0,"cool":0},"dpwNIaQ7xMf401ouokQ1hw":{"text":"Can I just say this was the best dining experience I have ever had!   Came into town from ","useful":0,"cool":0},"dUzoFXOlJV_Kg62tfmFTqA":{"text":"Irene's warm, eclectic, lived-in atmosphere dazzles the senses with flickering candlelight","useful":4,"cool":4},"Rj5D9CzSzkwle8gxFmKTGw":{"text":"Reservation for 8:30. Called asked if ok if I got there a few minutes late. Told would hol","useful":0,"cool":0},"V53w0hvTlXQ5sjF0h8byKg":{"text":"I feel bad writing this post because the waitstaff were wonderful. My experience might hav","useful":0,"cool":0},"bkE35u8QYE-g12UU8bixLQ":{"text":"When we arrived for our 5:30pm reservations, there was already a line outside. We learned ","useful":0,"cool":0},"rZWxobhHMQpSi2kzdiRZBg":{"text":"Decor and music are charming. Cesar salad was the best I've ever tasted. Husband loved the","useful":1,"cool":0},"YERi6GHprwguzvakp4i-Lg":{"text":"Great atmosphere. Food was incredible. Best lasagne I've ever tasted.  Wife had soft shell","useful":0,"cool":0},"wZk5A390fhsQh1SwQCwXCw":{"text":"Amazing food and great service!  Romantic Nola spot.  Chef is a total hottie!  Best creole","useful":0,"cool":0},"cqt_LR1k1zOuNHt5vgCndw":{"text":"We had a reservation for 4 on a Friday night and had to wait for about 45 minutes, without","useful":0,"cool":0},"N8pRy3jenYqto6H6XGSxMw":{"text":"This is by far the best food in town.   Don't waste your time with the \"other\" places.  Th","useful":0,"cool":0},"Ran-U2cxAGm53Uj0FtXS8g":{"text":"Everything they say about Irene's is pretty much true. Show up really early or really late","useful":4,"cool":2},"X-FRaUlmeJayg8TMqZpHKg":{"text":"my previous 5 visits over 2 years had garnered 5 of 5 stars every time (great food - great","useful":0,"cool":0},"eIVi6iryYZbiI_vgTLRZQQ":{"text":"Excellent food, atmosphere and staff. Oysters Irene were divine!  I think I could make a m","useful":0,"cool":0},"Nh_eTrUIBcz4w1YQ6E_sLQ":{"text":"While Mona Lisa is a bit more quaint and easier to access, Irene's is my standard place fo","useful":1,"cool":0},"hNl8JJOaXSqy3u5DjZZ0mw":{"text":"We were directed to Irene's by a local. She did not steer us wrong! What a phenomenal meal","useful":0,"cool":0},"BI2bwwUG9AyhxtmalLtMiA":{"text":"If you are in the big easy, you need to make it a point to eat at Irene's. Make sure you m","useful":0,"cool":0},"qK40LLKyjpp6IAarA9b3cQ":{"text":"Without a doubt..... one of the highlights of living in Nawlins!!!! The food is phenomenal","useful":0,"cool":0},"gB1WhWD3YvYVb2iKuPj5Qg":{"text":"Use to go here prior to Katrina. Haven't been back since, but the food and service was phe","useful":0,"cool":0},"W1BhhFrlgEgLPe1DQVuiqQ":{"text":"Great drinks, nice live piano music. AMAZING staff who were all enthusiastic, friendly and","useful":0,"cool":0},"STg9xer7-OpmbsYKrmsjRA":{"text":"Incredible Italian food. Limited reservations and a hot spot for tourists and locals. Best","useful":0,"cool":0},"LJfLEgH33UNcQeHBDuwmQg":{"text":"very nice place. the piano player mark adams is amazing and there's a mirror above the pia","useful":0,"cool":0},"Wm_KMruf2nhlBVNrxHdYag":{"text":"For a quick inexpensive taste of local food, it doesn't get any better than Sammys!!!","useful":0,"cool":0},"cp-_u9KvTaT7I9o68Npdwg":{"text":"When someone says oysters...my mouth waters for Irene's \"Oysters Irene\"! WOW are they grea","useful":0,"cool":0},"WlgElKDDMn-nyJm94ZFIsg":{"text":"Came here for dinner, it was a decent walk from our hotel, tucked away on a somewhat dark ","useful":0,"cool":0},"Jh0nEOQqDRRYZXsd2SGVtA":{"text":"The staff at Irene's Cuisine really go out of their way to make you feel special. Heck, it","useful":0,"cool":0},"YrsFr7EeadnqKAfyY1kwJg":{"text":"Irene was wonderful and welcoming! The food was amazing .. It was a busy night but well wo","useful":0,"cool":0},"LsqmRaz07B-rbtXY3qe8ZA":{"text":"The waiters in tuxes, linen cloths, quaint atmosphere were all fine and good, but the food","useful":2,"cool":1},"93XjpU2iZ5imbu11yQ8cpQ":{"text":"Irene's Cuisine is a must if you are in New Orleans for a few days! Skip the run of the mi","useful":4,"cool":1},"5MUonA48-wrD67DmegFA2g":{"text":"I have no idea how this place has such good reviews. My experience was horrible from start","useful":1,"cool":0},"I1rOHsRJvnSL86DG0bBZcg":{"text":"Ok...the food is excellent, but the reservation system is B.S......u make one for 8 pm and","useful":0,"cool":0},"zlCvTsyg2OE8o0RHnEgAEA":{"text":"Absolutely one of the best northern Italian restaurants in the south. They do take limited","useful":0,"cool":0},"pocxwCDu6RzYLrTr10oxfw":{"text":"We had 6:00 reservations and got right in. Orlando was a fantastic waiter! We had the meat","useful":0,"cool":0},"PxNpvwnSEZ3Dtxzsh15M4g":{"text":"I can't say enough wonderful things about Irene's!  It's hard to say what their best featu","useful":1,"cool":1},"4StxILqNb51L8FeAIUL2xw":{"text":"Irene's Irene's Irene's how I love you.  Food is outstanding- you can trust the waitstaff ","useful":0,"cool":0},"F6N-3xZUe4Nu6hgyyJRIWw":{"text":"Irene's was suggested by a colleague of mine when I told him my girlfriend and I would be ","useful":0,"cool":0},"EN5xx--ZAxmzx62JocCJUA":{"text":"Had a 5:45pm reservation, thought that was a little early, but it worked out very well. Th","useful":0,"cool":0},"3S8pvuDjKPSWTd2uwMIT6w":{"text":"We were lucky to get into Irene's for dinner while visiting. The food was very good. I wis","useful":0,"cool":0},"3Cpr7EX1QKfoI-LtPI3OIw":{"text":"Delicious. Delicious. Delicious. The atmosphere is great. It's dark and cozy. There is a w","useful":1,"cool":0},"7-ZN7n1j5USrYjsIfUMPQQ":{"text":"My husband and I decided to try Irene's after reviewing other reviews on Yelp.  We called ","useful":1,"cool":0},"QrPaNbXm3rwA_-lqNju90w":{"text":"Food AMAZING! Wait staff even better. Went there 2 nights on the trip. Would recommend to ","useful":0,"cool":0},"IKkV2mBMOzJdw2ZR8mlvgg":{"text":"This is one of my favorite restaurants. I love their soft shell crabs. It is definitely a ","useful":0,"cool":0},"NRtJt_GoGwa5xzElKjUvvQ":{"text":"AMAZING FOOD AND PLEASANT SERVICE!  Insanely great food without being snobby.  We had a re","useful":0,"cool":0},"WUucq9qO-j6wB4gCUXRhnQ":{"text":"Best lasagna my wife and I have ever eaten. The service was amazing and the food was delic","useful":0,"cool":0},"rv_-Ywjim_BgpOUYh1dWCA":{"text":"Another great restaurant I sampled while in New Orleans a few years ago. I got some dining","useful":0,"cool":0},"bi_u2PGhqLnjzHftCESOtg":{"text":"Best restaurant this trip. We arrived after 9pm, but the service was friendly and impeccab","useful":0,"cool":0},"_uLV5LQvYYDSBwT_8Ee5lQ":{"text":"Went here last night with my fiance to celebrate my birthday and had a wonderful time! Fir","useful":1,"cool":1},"b3fqjMHrBvLL20C8Ix2Bjw":{"text":"I dined at this place in 2012 for my birthday and it was amazing. Came back again on 8/20.","useful":1,"cool":0},"ZXTZbmJpZg8osCchfaDlCQ":{"text":"Sadly, we were not able to go here, but our local Friend's of the Cabildo tour guide Carol","useful":0,"cool":0},"3jeQZ6g1RanKFxYpqMmpRw":{"text":"Amazing food, fabulous service, great atmosphere!  Loved Irene's & will definitely go back","useful":0,"cool":0},"iRHVKPJA4378CQ831E3TgA":{"text":"Went to Irene's while in New Orleans at the Microsoft Partner Conference.  Recommended by ","useful":0,"cool":0},"2GShcCVTosmtmPeeAbcH4Q":{"text":"The meal was great. The service was phenominal. The only reason I dropped the rating to 4 ","useful":1,"cool":0},"F2W3QY15pLK6Vq215lZr6w":{"text":"Worst dining experience I have had in 20'years! Sonny was pompous!  Our party of three arr","useful":0,"cool":0},"xPeNzMJXx66Pdd0RRvG6QA":{"text":"Put our names down at Irene's around 7 and were told to come back at 8:45. Around 9:45 our","useful":2,"cool":0},"9lTArbaWkhJJLd-BsOh0Cw":{"text":"This is an intimate restaurant with attentive servers.  Food was spot on!  The mussels wer","useful":0,"cool":0},"KJUYZ-RTCL4NVXzMH8n7hQ":{"text":"Best lasagna I have ever had. Stellar negronis. I also recommend the soft shell crab and o","useful":0,"cool":0},"xvVlAZTWdTk2ENs0aE-pEQ":{"text":"I have eaten here twice.  The first time we had reservations and it was my friends birthda","useful":2,"cool":0},"is82H3i57JJFyj1pYLO1YA":{"text":"Expect a wait, almost always and even with a reservation. There's a reason for that though","useful":2,"cool":1},"WgIYfbILCC8XC7xS1_8bIw":{"text":"Great food, atmosphere and service.  Irene's was worth the one hour wait.  All the courses","useful":0,"cool":0},"Y-0ANce00sj2uEBajIT00w":{"text":"This was our last stop on our road trip and changes the bar for all of the other places we","useful":0,"cool":1},"w90-ARYWJusDKk2czv-rBA":{"text":"Great local neighborhood spot. Excellent food at reasonable prices. Off-menu Specials are ","useful":0,"cool":0},"fgffDghWLhKOgjv18j60RA":{"text":"I was initially a little bummed when my sister told me that she had made a reservation at ","useful":2,"cool":1},"j4wqOE8EI6zjaWRHYbc_Hg":{"text":"The best oysters I have ever had! This place was one of the best restaurants I have ever a","useful":0,"cool":0},"4g3WlvepHs0LvllWs49rnA":{"text":"Just a NOLA classic.  Homey, close environment with lots of charm. Waiters are full of cha","useful":0,"cool":0},"8s5ygwnD4LT04PmAh-xhLw":{"text":"My friend and I decided to try Irene's on a Thursday afternoon.  So, after cooling our hee","useful":2,"cool":2},"8SO01SpxCITiLe3wCYIszg":{"text":"Only 5 because I can't give it 6 stars. I ordered the pappardelle with soft shell crab & m","useful":0,"cool":0},"h_z9lhE0viF87-T5UX2mqQ":{"text":"Irene's is another one of those time-warp restaurants, tucked away in a quiet(er) part of ","useful":1,"cool":1},"gk4qOpzqoYYYZDJZaklOGw":{"text":"My husband and I just spent a week in New Orleans and this was my favorite dinner spot and","useful":0,"cool":0},"RVPZEk26McL-omKWIJ-uvQ":{"text":"Wouldn't take reservations. 2 Hour wait...we walked down the street to the Martini Bar to ","useful":1,"cool":0},"55rl5oWFPGNfm5oYZdNqcQ":{"text":"This place is amazing. It's romantic so it has been our anniversary dinner for 4 years str","useful":0,"cool":0},"zbz909tqHP8O7Xj4zMQfhw":{"text":"got referred here by a local--definitely was pleased. the atmosphere, the service (we had ","useful":0,"cool":0},"VmJK9ZOgoUuL-J46KgN3Tw":{"text":"Get there early! The place opens at 5:30. We probably strolled in at 5:35 and the front di","useful":0,"cool":0},"9vXtt7_C-jnSIm3R8OSifg":{"text":"Amazing, Amazing, Amazing!  We called the day of and were able to get a reservation at 8:3","useful":1,"cool":0},"112ra5dFgnQq0oNcZ8ThOw":{"text":"This place is wonderful. It's very tiny on the inside but it's so welcoming and they're so","useful":0,"cool":0},"-XuA0K4tXbDiTvqZAjCzBQ":{"text":"We had a very enjoyable dinner at Irene's cusine. The filet was absolutely one of the best","useful":0,"cool":0},"EGesNNFu4iBonciJVzFUGw":{"text":"The kitchen and the floor seemed to be at war. First, the good part: the food. Everything,","useful":2,"cool":0},"XGkB-Rd86slaLcyrww8ixQ":{"text":"Lovely.  We have eaten here 2X in our 5 days in NOLA.\nthe Duck Gregory is best ever.\natten","useful":0,"cool":0},"hpiE87b_BO2vg50AOPBDAQ":{"text":"Best Cioppino outside of San Francisco, chunks of fresh fish, scallops and shrimps, in tas","useful":0,"cool":0},"qTCItP3CinT5KxZmSS3fzQ":{"text":"Now we went to Irene's only because the restaurant I had looked forward to going to the wh","useful":1,"cool":1},"OFQaj6Y6No90e5howP4_Lg":{"text":"I was looking forward to this dinner. My boyfriend and I had tried twice before to go when","useful":0,"cool":0},"ApvlxEHcRd-PrbuL2vFYuw":{"text":"I am very glad we made reservations for this place a week in advance; when we arrived, the","useful":0,"cool":0},"u89fEAqVNEdjVpxGlwngDw":{"text":"Mama Mia! \n\nWe are big fan of Irene's!\n\nBeen there quite a few times. \n\nAlways good, alway","useful":0,"cool":0},"ILcFHvp_AyIvC6SP1q4qhw":{"text":"Delicious food, lovely setting, and exceptional and knowledgeable waitstaff! A local sugge","useful":0,"cool":0},"vS6BIDWcOjP8usePqVUxmA":{"text":"I was very fortunate to have been treated to a meal at Irene's.  My dinning companions swo","useful":1,"cool":1},"srpWvH-1XGbHu024kNgX_Q":{"text":"Decent food, but absolutely dreadful service. We had reservations, and still we were herde","useful":0,"cool":0},"zddKrupA0GK-U7WqhjqRog":{"text":"OH MY GOODNESS! This place is AMAZING! When I walked in I was welcomed with bright smiles ","useful":0,"cool":0},"0sCn04AoPaQ0FlEBViCoXQ":{"text":"Delicious food, extremely long wait. Even people who made reservations were having to wait","useful":0,"cool":0},"lX2L7fxoXBnpgSJPum-Cow":{"text":"Irene's gets four stars even though the evening started out on a disastrous foot. My party","useful":0,"cool":0},"ns_RUv0cOFj8xopntO565Q":{"text":"Great service from Matt! The tomato salad (caprese) app was excellent - mozzerela was crea","useful":1,"cool":0},"LEJ470cM_EYcIdUXTOMdxQ":{"text":"What a disappointment today with our service and with the general manager of Irene's.  We ","useful":0,"cool":0},"NrD4aNo7xdFSMiYmW4xQWw":{"text":"One of the best lamb I had in s while hands down! Must eat! The escargot was awesome as we","useful":0,"cool":0},"I5sZ7uzC8A7KOJefna3gkA":{"text":"My experience last night at Irene's was truly mind blowing. Husband and I went to celebrat","useful":3,"cool":3},"0qRtgfC_0uG7ZgNBiQqUhw":{"text":"Had dinner here Saturday night. The seating is very tight. Bathroom are placed in bar area","useful":0,"cool":0},"38HxDO8ZXizQEZqmiQnMvA":{"text":"On a weekend get away with my husband and we were staying at the Hotel Provincial and the ","useful":0,"cool":0},"KmVvkBZjnv9ZX95FMgw0Eg":{"text":"We had dinner at Irene's two days ago to finish off another wonderful week in NO. Service ","useful":0,"cool":0},"ba6ORdtCjAOb61LA0eqP2A":{"text":"Our family loves Irene's most amazing cuisine.\nEverything on the menu is delicious, the st","useful":0,"cool":0},"COshCTUTGykSpyw0EdC36w":{"text":"Solid 4.5.  Excellent food and service.  Just go over to the east side of the Quarter and ","useful":0,"cool":0},"e2G7ufvTfBeqakkwLwe10w":{"text":"Had to wait for about 3 hours to get seated (need to get reservations next time) but didn`","useful":0,"cool":0},"WBF8lRiZkmLeCewYF1gbdw":{"text":"This place is absolutely phenomenal. The food is wonderful, we ordered the mussels marinar","useful":0,"cool":0},"pOgT1HM03vrzCfxpt2MSmw":{"text":"Wish I could tell you about the food, but never made it that far. Had reservations in Frid","useful":0,"cool":0},"0tpeW1NeVSIAcA8aAxLArw":{"text":"Irene's is our new favorite place to eat! We went there just for oysters but we ended havi","useful":0,"cool":0},"diiofNaDNaRcz7vlSFcLzw":{"text":"Out of all the restaurants I've eaten at all over the world I have never had such horrible","useful":0,"cool":0},"ark4iONmk-PcwjB4pfIUFA":{"text":"Irene's is everything I wanted my experience in New Orleans to be. We called ahead and mad","useful":4,"cool":3},"y68FJgdQkOYmXndbhcIC3g":{"text":"I had heard how great this restaurant was from a New Orleans native, so we decided to cele","useful":0,"cool":0},"Li7VvRevrrVCfusDJbuItw":{"text":"Life without Irene's might be a misery. This is a wonderfully intimate restaurant where on","useful":0,"cool":0},"srxX_9y_PaKuOWrWjQvkvg":{"text":"Hello Gorgeous!!!  I teach in the French Quarter and have walked by Irene's Cuisine for 4 ","useful":1,"cool":0},"yWuE-62sP9v7h-4WScqePQ":{"text":"SWOON!!!\nWhen I think of GOOD NOLA food Italian wasn't on the top of my list until I visit","useful":3,"cool":0},"yoVwOJgKEXcjPVXv1bgchQ":{"text":"My hubby and I had a marvelous evening.  We were shuffled into the \"waiting room\" upon arr","useful":0,"cool":0},"oPm1JLqhK73K0mRGQpaHaw":{"text":"This place is pure awesome deliciousness. There's almost always a very long line but as th","useful":1,"cool":0},"4VbFKoKFmPrd-5NqWXQ95A":{"text":"One of my most favorite meals of this trip. \n\nMy sister's rehearsal dinner was here. Altho","useful":3,"cool":2},"o2J9CLQY-CjGe8cvrXsCQg":{"text":"This was our best dining experience in New Orleans, narrowly beating out Commander's Palac","useful":8,"cool":0},"_Qz3mVT6BLwnKpC-FzimZQ":{"text":"Ordered the meatballs marinara and the chicken rosemarino. They got my order wrong and gav","useful":0,"cool":0},"kZqbaYAejix0aPy-h6LCbQ":{"text":"This is one of those places you almost don't want to give a good review to because it is s","useful":1,"cool":0},"P-lVy5IMGzJFLteUlfJMNA":{"text":"The food was excellent. My husband had the gumbo and oyster appetizer. I had the fish with","useful":0,"cool":0},"FL1etR3tw8h2NHb5dFE_uw":{"text":"I just loved this place! We decided to try this place for dinner because it was our last n","useful":2,"cool":2},"YS7YVNB_DbnwwRzep6TPtg":{"text":"After spending a week in new Orleans and eating out for every meal (I know not the most ec","useful":0,"cool":0},"or2mBRz6fGewGQKeXKuL3A":{"text":"This was hands down the best meal we had in New Orleans (and possibly ever).  My husband a","useful":0,"cool":0},"TISspv3d6J-Wzu_f0Q-kTg":{"text":"We were told to go here by our horse-drawn carriage driver.  He said it was great, and it ","useful":0,"cool":0},"qZL-1UdTiVvFoSqgyjHjbw":{"text":"We went here on the advice of the guy who helped run the B&B we stayed at and it was spot ","useful":0,"cool":0},"zT6e-F16obqEL4qS1C68AA":{"text":"Great ambience! They knew about gluten free and I had a delicious shrimp dish. My dad got ","useful":0,"cool":0},"RCt5eRz4ugEfC43R8oPp9w":{"text":"Great food!!  The mussels appetizer was fantastic; the mussels were so fresh and the sauce","useful":0,"cool":0},"tsXjDHCDBbNHvglJbHoY5Q":{"text":"We arrived without a reservation and had to wait for awhile in the piano lounge while bein","useful":0,"cool":0},"Db3dc6e2XRAbyZ_LTHSY1Q":{"text":"Outstanding service!Outstanding food. We got the soft shell crab appetizer which was yummy","useful":1,"cool":1},"qT8w-JqEVOX2znoptdiCzA":{"text":"My friend and I were headed to Green Goddess when we stumbled upon this amazing place. To ","useful":1,"cool":1},"S6Q_VdfU9bPc6w5fP5VZFQ":{"text":"My husband and I make sure to make reservations here every time we come to NOLA.  Fantasti","useful":0,"cool":0},"BTxtfK7W3g4F8oHiPihF8g":{"text":"Let me first start by saying that if I could give them six stars I would. Irene's cuisine ","useful":1,"cool":0},"YA7pgECIzuG8TjWll2OtkA":{"text":"Tiens, I, who wait in line for no-one, finally made it to the iconic \"Irene's Cuisine\" on ","useful":2,"cool":0},"8FBsFituIKN8Tqg1kdyH2Q":{"text":"We always try to get into Irenes when in town,but last few times either lines/wait time we","useful":0,"cool":0},"HmhnrrMgLI5t3fEY5WdoNA":{"text":"Knocked 1 star for price and knocked another star for not living up to the hype on drinks ","useful":0,"cool":0},"NsCtbVEDBCjOIGQVIR7pXw":{"text":"We had 6 in our group for dinner. Atmosphere was great, service was fantastic. Food was ou","useful":0,"cool":0},"P4mZg0ubBYOeCa_6MMUNjg":{"text":"Great appetizers and desserts.  Oysters were amazing.  Could have skipped on the pompano e","useful":2,"cool":0},"YDgBPTbmLfb_IYt8CsFQTg":{"text":"Awesome meal and awesome server!  Hayley is the best!\nI had the steak special with incredi","useful":2,"cool":1},"xoNywOUwhHk0ji-tINeUFg":{"text":"We were in NOLA for our 13th anniversary, we were overwhelmed with places to choose from a","useful":1,"cool":1},"xoXGtb0SLmG7NgT_PFlLsg":{"text":"This is an extremely hard review for me to write.\n\nWe were so looking forward to Irene's h","useful":1,"cool":0},"scRO3V6l_49jqKI-McZdcw":{"text":"The rumors about your greatness have been totally TRUE!!!!\n\nI had the best Italian food, d","useful":1,"cool":1},"rJB08hwjRfw2hmQ1H1BloQ":{"text":"Absolutely incredible. Every dish myself, my husband or friends had was amazing. Some thin","useful":0,"cool":0},"GzW9a1PnqKrZhf8qevjt2g":{"text":"I'm from NY and my family and I were visiting my sister in New Orleans, we saw this place ","useful":1,"cool":0},"gTPnh0qd6KDpax06S3m3Iw":{"text":"The food and service were awesome. Can't wait to go back. It is a festive atmosphere, and ","useful":0,"cool":0},"vlbZkFin30OWe1dyfu_wEg":{"text":"The only reason I am giving this restaurant one star is because Yelp requires it.  Minus t","useful":1,"cool":0},"ELn70ivSRhNV-4MuZ9tMxg":{"text":"Amazing intimate date night meal! Had the antipasta plate, salad, and lasagna. Food and se","useful":0,"cool":0},"cTHj0KVmS8hqbcPzViNHIQ":{"text":"When I told my husband that I had made a reservation at an Italian restaurant during our v","useful":1,"cool":0},"UNFjsogHuLnuN9b8VUXjPw":{"text":"The rating is for the food and not the experience or quality of service.\n\nIrene still work","useful":2,"cool":3},"aGVj2879jBJRJ9c6TSic8g":{"text":"The soft shell crab was amazing. The service was very good also. Very much recommend this ","useful":0,"cool":0},"86p87hMYyMeMnAqjdE4TeA":{"text":"Fantastic time at Irene's . We didn't have a reservation but the waiter said it was no pro","useful":0,"cool":0},"ExGtvMzhsynRtlA8TRKWng":{"text":"The wait seems to always be ridiculous so be prepared. The staff is very friendly and help","useful":0,"cool":0},"smFNf7m-YR0u5nEZGy2arA":{"text":"In love with this place. Atmosphere, food,aroma! Great date night. Pricey but worth every ","useful":0,"cool":0},"uruYWUexHZq9uZykMaCcGw":{"text":"We always dine at Irene's when in New Orleans ... usually a couple of times.  They don't t","useful":1,"cool":0},"Foh7dLpR7wDZjNP5CChebA":{"text":"WOW! WOW! WOW! I dont even know where to begin. Unreal.","useful":0,"cool":0},"XtBTBXzdLntEdwpsq_DAow":{"text":"We were in from out of town for a wedding. We weren't sure we'd get seated as you normally","useful":0,"cool":0},"AAca3zeJeZLKnB5U1w57yg":{"text":"Have dined here twice and both times it was tremendous. My most recent visit was for my gi","useful":0,"cool":0},"GJax0ASqkbE2rbM28Au30A":{"text":"Nothing less than excellent.  \nWe were walkin customers and they brought us drinks as we w","useful":0,"cool":0},"kbz5_-0CQNKbtYhapyzk_w":{"text":"One of the best meals we had in New Orleans.  The ambiance was great. Friendly staff.","useful":0,"cool":0},"eHpq9cWWYC0MndgQ3nfBHA":{"text":"If I could give 6 stars, I would.  \nBest restaurant in New Orleans, possibly in America.\n\n","useful":3,"cool":0},"MB2kHLbrMb0tXcoiGvEOhA":{"text":"Had the cioppino and the lamb. Both items were mediocre and not fantastic. Would not come ","useful":0,"cool":0},"cwUKNB3HDdSO26QAY5OaIw":{"text":"Some friends recommended this place and I'm glad they did. It is fantastic. It was a littl","useful":0,"cool":0},"RyiPD4feHaNSI_YlwDIejw":{"text":"This place is one of the best places to eat in the city of New Orleans and that my friends","useful":0,"cool":0},"i-xI2ioIFKUeFlN-VvMmMQ":{"text":"\"Italian\" in New Orleans is something I typically avoid, because it always seems to pale i","useful":1,"cool":0},"8xJrOHIFbBBC42Lr49z9LA":{"text":"We got a last-minute reservation and this ended up being our best New Orleans dining exper","useful":0,"cool":0},"fvtZrdewCuSPt4MyeU00LA":{"text":"Amazing dinner for our last night in NOLA.  The staff is fantastic, very attentive.  The f","useful":0,"cool":0},"xUKjGONnVEBncJFgqc1WOA":{"text":"Treat yourself. Plan to wait an hour, w or w/out a RSVP. I had the Cioppino and I think it","useful":0,"cool":0},"PS89YRvxzjIZDwXn8AiHdQ":{"text":"I've lived in Italy and all over the US and Irene's is without question the best Italian f","useful":0,"cool":1},"A3FQ4FL--TtxTgoSiHDDxQ":{"text":"This place was amazing! Had the lamb chops and my girl had the lasagne - both excellent!","useful":0,"cool":0},"-AnizPrYq3-4P6BW89WzOQ":{"text":"When my hubby and I were in NOLA a year ago we tried to go into Irene's because we heard h","useful":1,"cool":1},"JuqmBHSwqs2eF8iAX0hOiw":{"text":"We didn't have reservations and were absolutely beat from a long day but the staff made ro","useful":1,"cool":1},"B68XtuuqvLr5Zys3rfpgZg":{"text":"Yum, \nhow about dem oysters huh? Oyster Rockefeller and the come early because it gets bus","useful":0,"cool":0},"j14WTH1H-qcZ46SyBUR-rA":{"text":"I went into this place historically hating both duck and lamb and left this place loving b","useful":0,"cool":0},"cNFQgDqkM5URoiSR-jsi_Q":{"text":"Best restaurant and dining experience I have ever had. The food, ambience and service is a","useful":0,"cool":0},"5HjAMjipBjxtexQBUF4SbA":{"text":"Packed out with locals, I met two couples who waited three hours to eat here while on the ","useful":0,"cool":0},"lV1VAT_j339KL_HUjuF4vg":{"text":"We both thought the lasagna was third rate !!  And my fish was overcooked.  Conclusion - w","useful":0,"cool":0},"w-Nwf5v4vCzgIY0WY9PInA":{"text":"This place is worth seeking out, but do make a reservation as it gets crowded in its small","useful":0,"cool":1},"y8gVYlHf1Qy4wiWTtCPWSg":{"text":"Fantastic, old-school atmosphere. Lamb is tremendous and the cioppino excellent. The front","useful":1,"cool":1},"scUda0tTPsFO3nwTS_P3Ug":{"text":"Recommeded to us by a local and we loved it! Great food.","useful":0,"cool":0},"zztPNvY3CW9g1TkWXtkjLg":{"text":"What was supposed to be a quick stop for dessert turned out to be a dinner encore. The wai","useful":0,"cool":0},"0s8nDRRywE7-hsJg1oD8wQ":{"text":"Our waiter, Michael was fabulous, informative and great personality. The food was good, no","useful":0,"cool":0},"Irs4_t-266wMvUMvCJl80A":{"text":"We ate at Irenes Saturday night to celebrate a friends birthday.  The dinner was absolutel","useful":1,"cool":1},"sIuPt2X7cauPnYvHSClhOA":{"text":"Great service!   Wonderful ambiance and the food was excellent.   Classic classy is how I ","useful":0,"cool":0},"AW9S-UCn39g7CHaIpuLNjg":{"text":"The whole staff was extremely welcoming and inviting. I walked in around 6:30pm without a ","useful":0,"cool":0},"PrIzVliegP-SusvbF6Axcw":{"text":"Walked in, told the maitre'd would be back soon, 15 minutes later after multiple waiters w","useful":0,"cool":0},"PI4XsVcOZMw6Oat872I7Kg":{"text":"1st sit down dinner meal in NOLA. Image this foodie's excitement! Another rec from our fab","useful":1,"cool":0},"44I6dVBvadni9QfGgAjFBw":{"text":"Absolutely delicious meal.  Terrific service,  we loved it.  A bit pricey.  Dinner for two","useful":0,"cool":0},"9j0aNi_Tkp4iJ-8wHsQ1KQ":{"text":"The very best of the very best! An elegant, upscale, restaurant (in a new, French Quarter ","useful":0,"cool":0},"Acjk0_ajxdL3JwM17d8WtQ":{"text":"Made reservations MONTHS ago.  Recommendation of a friend.  Both ordered filet mignon spec","useful":0,"cool":0},"VnIfM254e5Q0GFARnq9rWQ":{"text":"I have to admit I was pretty disappointed with Irene's. The food just was not very interes","useful":4,"cool":2},"0qyZpTVplpM_W7t5tqtyiA":{"text":"Let me first say that I'm Italian so I know good Italian food. We ordered:\n\nAppetizers- Ri","useful":0,"cool":0},"z7v929uUWVrN8ZjEhPki8Q":{"text":"No reservation and dressed in shorts, tank tops and flip flops, we were welcomed and seate","useful":0,"cool":0},"kG6hJl1LR0COXBSgHET5Jw":{"text":"I love Irenes!  It has that old New Orleans feel!\nWe have eaten here quite a few times and","useful":1,"cool":0},"fHJFOluHBme-J3vFON3fTA":{"text":"We had an amazing meal here. Our server Michael was above and beyond great! He explained t","useful":0,"cool":0},"TLyfBB6GVfiS4jmJ0UPHqQ":{"text":"This was recommended by our hotel....wow, were they right.  My\nfriend and I both had the s","useful":0,"cool":0},"TrTEQBUDoW-MPebWqNieRQ":{"text":"First time eating at Irene's and the food was delicious. We ordered three appetizers--oyst","useful":0,"cool":0},"QqY2C2z987cKoJheoLlv0w":{"text":"Service was amazing! Atmosphere was awesome! I highly recommend getting the lamb dish. It ","useful":0,"cool":0},"w15P4Z6DKONYESu7J6Lq_g":{"text":"We visit every time we're in New Orleans, and we're always amazed. Never a disappointment ","useful":0,"cool":0},"3Poud2TEZsoTDIO-89D4AQ":{"text":"You can tell if you don't come here all the time they treat you like it.  This is not a pl","useful":1,"cool":0},"whMXhDa2z9MKWTg6ZYK-Pg":{"text":"Yeup they pretty much nail it here. The entire experience - atmosphere - food taste - the ","useful":1,"cool":0},"bDSo97w24jkpfFZGH44SKQ":{"text":"Top of the line service.  The food was amazing and fresh. They handmade all the pasta here","useful":0,"cool":0},"OGXYcPe-S0l5GLJFpcd6wg":{"text":"Wonderful ambiance - dark rooms, romantic music (not live).  Waitstaff second to none - pe","useful":0,"cool":0},"6rNX3V5iNVr7ceZTKolKsg":{"text":"I went here on the recommendation of a friend. The food was fantastic. The wait staff was ","useful":0,"cool":0},"_g7WaNxPOrTiVheEdO5-6g":{"text":"I'm giving it a one star because Yelp makes you give at least one.  We waited 45 minutes a","useful":7,"cool":0},"8QNL7wQn9FRSZzvJA8Bz1Q":{"text":"Great food, great atmosphere, and the people who work there act like they really care that","useful":0,"cool":0},"sx9KCEk7n89XOG5WLc9fMA":{"text":"Great food and was just as was Recommeded by some friends who are locals. The duck was the","useful":0,"cool":0},"atDx6_w76h2yNM44t-R-4g":{"text":"We didn't have reservations on a Thursday night and got seated, happily. Waitress and wait","useful":0,"cool":1},"PoU4g7_QwNe9brQq0dp0tQ":{"text":"We were expecting to be blown away by this place after seeing all the amazing reviews. Thi","useful":2,"cool":0},"qAnqId8wsTbvTqKnndlfng":{"text":"I can see why this place is a big hit among NOLA locals. If you're a tourist wanting to ea","useful":1,"cool":0},"UpY2mf6Lr349r00LQCEgWw":{"text":"As usual, our meal at Irene's was the highlight of our culinary experience during our two ","useful":2,"cool":2},"u58HMcRA0UAdtr_zknaRzA":{"text":"My daughter took me here for dinner, it was my first time her second. The service is amazi","useful":0,"cool":0},"18IpT_8kPPgtRnNC7VzshA":{"text":"I have been wanting to eat here for a while now. Ive always heard good things.  The 3 smal","useful":3,"cool":0},"MxOJQwr75oNXNS66IozrCw":{"text":"We had such a lovely experience at Irene's ! My boyfriend and I were so beat after a long ","useful":2,"cool":0},"nMoXNtPUhwKbuJPuuq-Sjw":{"text":"Irene's was excellent. The lamb was exceptional, and the cioppino was amazing. We had the ","useful":0,"cool":0},"gHeqa46lNUdHCFRSEraE6Q":{"text":"Whether it's the sheer fact that it's a local place, or the fact that Irene greets me with","useful":0,"cool":1},"OrEOvWeC8-ezP-A5MR_Ndw":{"text":"My boyfriend chose Irene's for our one year anniversary. He had the pork chops and I had t","useful":1,"cool":1},"VfpsLR-sBbBhgdiVHfxsHg":{"text":"So here's a tip about Irene's, if you want to get in, get a RESERVATION. Cause even with a","useful":1,"cool":0},"Ke0BUHO14w8l7gOJwd1juw":{"text":"Had reservation and arrived on time.  Maitre d told us to wait in the bar while table was ","useful":0,"cool":0},"hKXgQcx1eZ65Wh_IfZmXig":{"text":"Delicious, in all ways. \n\nThe AMBIENCE: Simply lovely, aglow with warm colors, soft light ","useful":3,"cool":1},"yLVf8OMUFCHfLYMYvXZMbg":{"text":"One of the best fine dining restaurants in Nola. Impeccable service and delicious food.","useful":0,"cool":0},"Yrvd7wPD6z4gtyTKMmXWnQ":{"text":"For our last night in New Orleans, my friends and I decided to go to Irene's for dinner. F","useful":3,"cool":0},"c4QOBkUoyOQsZ8GRNp6zUA":{"text":"Great dining experience! The Oysters Irene were delicious! The mussels were so good I coul","useful":1,"cool":0},"WJzVdQ03FLotT1UYFr8L1Q":{"text":"Hard to think of old school Italian place in the French Quarter but there it is. As solid ","useful":1,"cool":0},"jUTr73fbUbfyaVCMr_Z6zw":{"text":"Aside from the bartender who was having a bit of an off night, the staff was incredibly fr","useful":0,"cool":0},"tVWMsDOtbmvSCu2duDpQNA":{"text":"Great food. Wonderful waiters.  Can't wait to make it back again. \n\nMake sure to try the c","useful":1,"cool":0},"C0Bt5EsZcPfFL1KZtkHg4g":{"text":"New Orleans is known for its fun and of course food and there is no shortage of choices.  ","useful":0,"cool":0},"F0fnJ3zfFe9lUm3CpYN9uA":{"text":"You won't find traditional Italian American selections on the menu (no lasagna; nor spaghe","useful":0,"cool":0},"ZxChPjClp1HKQzYGBbEkzw":{"text":"This is a very intimate and romantic upscale Italian restaurant (which was perfect fom my ","useful":0,"cool":0},"afQkapyIx5XO076WGr3Cnw":{"text":"\"Many loyalists declare Irene's Cuisine a well-kept secret, though you'd never know it giv","useful":3,"cool":1},"qRddtSQsEc3y16QzG2Bd5A":{"text":"Delicious NOLA restaurant with an Italian flare. The oysters Irene are delicious and a mus","useful":0,"cool":1},"SJeNB9xDopxNiHDQpScFEQ":{"text":"Best service ever!!! Not only was the food great but the service was over the top. David a","useful":0,"cool":0},"mUYiwgGe24OwS3fsWE5fXg":{"text":"Awesome ambiance, food.  Our server, Dan, was awesome, funny, attentive.  Definitely going","useful":0,"cool":0},"ARJkIY4JoOAdRnBVkz8v3g":{"text":"Cozy atmosphere, slightly stuffy service, lots of photos of famous people on the wall, old","useful":0,"cool":0},"Amu-wu0b4KmGSzUSytdy3A":{"text":"Let me start by saying the food and wine were excellent. The excellence ended there. It to","useful":1,"cool":0},"vO8Zua-_w9XIdgGf9NsrPA":{"text":"Not worth it he trip down to city. Never been to an Italian restaurant that did not have v","useful":0,"cool":0},"Hh9dw6MxbGRj9tZ8LHcoSA":{"text":"I would only go back to look at bar and decorations.  The staff was friendly but the food ","useful":1,"cool":0},"-iy14MJvGJxvfBCO4Tl8OA":{"text":"Irene's.  Top notch for food and service as usual.  We return again and again always on Th","useful":0,"cool":0},"cL1AvhWSt8tiWBFZ2YkTFg":{"text":"Love this place. Give the specials a good listen and sit back and enjoy fresh Italian cuis","useful":0,"cool":0},"4Rl_hpzFJ463nJ0xwQDzvw":{"text":"This place has the best Italian food ever.  \nJust make sure you TAKE CARE of your maître d","useful":2,"cool":0},"l5fmee9aPi3oR5s86mELug":{"text":"I literally started a yelp account to share my pain from my visit.  \nWhile the food was yu","useful":0,"cool":0},"pfOVBZyzaH8B7mgrbQXcTw":{"text":"Visited on a Monday night, seated promptly at our reservation time. We were in a small roo","useful":0,"cool":0},"its-iOfrn2ny9x0FF4-Gdw":{"text":"Loved Irene's.  We had an awesome dinner from appetizer to desert.  Loved the ambiance and","useful":10,"cool":4},"yd-Vtg5gAiL8KOEEbUOh1g":{"text":"locals say this is the spot. and they're right. tasty, top notch food here. the paneed oys","useful":0,"cool":0},"dPe7q6LG8k2miqMFUHdW8g":{"text":"Visiting from CA, food great our waiter give us tips on places to visit and things to do. ","useful":0,"cool":0},"pmCIz2P5kLqQoLFwERyLOQ":{"text":"Irene's - trading on reputation\n\nIrene's restaurant was recommended highly and is purporte","useful":0,"cool":0},"haFWwnY9AEJ_c38MoTWuew":{"text":"My wife and I had reservations at Irene's before a show at the House of Blues.  The atmosp","useful":1,"cool":1},"1Odq7U7l8LG4ijPXvylD6g":{"text":"This place is now in my top 5 best New Orleans restaurants. Service was great, food was da","useful":3,"cool":1},"rUXk8ssVdCcsstvh5FH6yw":{"text":"Good but I wouldn't say anything special! I had the veal Marsala and I found that the pair","useful":0,"cool":0},"BndruUxCSOzBVHOBgRoVtw":{"text":"Another NOLA disappointment.    If all you want is garlic with your garlic, and your cloth","useful":1,"cool":0},"dvBA2iDeTqTKLqOZvuYXEw":{"text":"We have had another great trip to New Orleans and another great visit to Irene's!  This wa","useful":0,"cool":0},"d1QyfktDAx3hoEGcMgdJHg":{"text":"What a perfect place to celebrate our anniversary.   We started with their famous meatball","useful":0,"cool":0},"7_fAh-6W4A79o9bn4U8owA":{"text":"There's nothing we didn't like about the place. Phenomenal food; impeccable service! We ha","useful":0,"cool":0},"MwYC8EuabwH9OJxI44rmgQ":{"text":"After reading so much about this historic place we were pretty disappointed. Soft shell cr","useful":0,"cool":0},"vHXSFasxX8Uo_EKiaE5r0w":{"text":"Irene, sweet Irene!!!  Oh, how we love you!  We were in New Orleans this past week for Jaz","useful":1,"cool":0},"lEcak7kJ-mC8Us4VIz_0mA":{"text":"First off, JASON was spectacular!!! He saved the night! This was our third trip to Irene's","useful":1,"cool":0},"U4AbsHUqwYVs0_GTNo8ejw":{"text":"First off, we had a reservation, but had to wait about 45 minutes for the table. I didn't ","useful":2,"cool":1},"zFZB6BKueR2rj-aGXHZKHg":{"text":"An incredible dining experience inside this cozy and boisterous restaurant. Our server was","useful":2,"cool":2},"0fExB_J3xNOf42KbV5jbdw":{"text":"Irene's was a very elegant place and the food was really good, however, Irene is considere","useful":1,"cool":1},"fdgvp3PRzpgef0OQVnid-A":{"text":"My girlfriend and I met one of my friends for dinner at Irene's last Monday. It is one of ","useful":6,"cool":3},"sppCN0zxlyTmHqfWIS8Tyg":{"text":"Irene's was fabulous! The crab au grautin was amazing! Our table had duck, lamb and steak!","useful":0,"cool":0},"ukHUTIEvRTjpn8XB70Osdw":{"text":"This restaurant is a MUST if you want a beautiful experience as well as one of the most de","useful":2,"cool":0},"01gG0k6TGd_jOxlpy5z2Mw":{"text":"Visiting N.O for the WW2 museum, a must. We had a short must dine at list from natives and","useful":0,"cool":0},"-2mPthcN_dVkL3zDSPh1Vg":{"text":"Best escargot appetizer ($10) ever - a unique twist on a classic that both of us adore. We","useful":0,"cool":0},"OY31QKePy_QPmQRcZDVszg":{"text":"As my wife and I were driving past we saw what looked like a hidden restaurant the smell w","useful":0,"cool":0},"7CQdVa0_ohJBLxTn1-pnLQ":{"text":"Made reservations for 7:45 and were seated at 8:30. We were starving by this time having j","useful":3,"cool":1},"btGCO80wFwoK6-WDlPOZHg":{"text":"It seems there is a whole category of restaurants in New Orleans, particularly the French ","useful":3,"cool":0},"4eNtPSZAtY1GYxEHATbBvA":{"text":"Worst service ever!!! It took 30 mins to receive a table with a reservation. Then on top o","useful":1,"cool":0},"-GKDSBvAOsNi6AXEZfKsIA":{"text":"My partner and I went here for a date while we were visiting the city.  The food, wine and","useful":0,"cool":0},"nLR54Hk9mjR_FGTB0s1b2A":{"text":"Service was impeccable waitstaff was over the top and food brought me back to Italy and de","useful":0,"cool":0},"3wvHvk-rUkEMsxblRO24zQ":{"text":"I'm still not sure how Irene's is considered Creole-Italian cuisine but the food does not ","useful":4,"cool":1},"ShzOoQcaGUtKiESXQ7eHaQ":{"text":"If there is only one restaurant that you go to in the city, this is it.  The soft shell cr","useful":0,"cool":0},"vjuKa73F_dqk-FwMMZEn3A":{"text":"Feels like Irene's has lost some of its charm since moving to a new location. Seating was ","useful":1,"cool":0},"Rmdi5QBUcajD2fwISxMjPg":{"text":"That's amore!\n\nAlthough Irene's Cuisine has one of the longest wait times anywhere, it is ","useful":1,"cool":0},"atrCVjjcZ5jfbRMU-oHkFA":{"text":"This is honestly my favorite place to eat when I come to new Orleans. The food took a  lit","useful":0,"cool":0},"_wVrND90yY4wxbq45Pdd3A":{"text":"Had a great waiter. They made me a vegan pasta.  Good Ambiance. Do not come without a rese","useful":1,"cool":0},"aIz_tiurx9rDAEZwGFJ-8w":{"text":"Everyone else gives it a 4 or 5 star review and I know why. Because they earn it! A tad ha","useful":0,"cool":0},"BJnFh0kyz7sZlt7BIk74WQ":{"text":"Super friendly staff that put up with our Bachelorette Party's antics (yes we were already","useful":1,"cool":0},"ubBquu5ofSHEsptNm9Dwqw":{"text":"This was a wonderful surprise...New Orleans with an Italian twist!!!!  Friendly, charming ","useful":0,"cool":0},"cj8Cmvx810p5bnFmPY4IrQ":{"text":"damned if i don't hear about that place all the time~\nit's a palace of italian. food can't","useful":0,"cool":0},"VzhozXbvhzaNgAlDQFFDiA":{"text":"Excellent food and drinks.   Outstanding and professional staff.  If you're planning to ea","useful":0,"cool":0},"Sl8R58FzcjyTKRHdBnbVdQ":{"text":"This is, by far, the best restaurant in New Orleans!!! Every dish is amazing. The service ","useful":0,"cool":0},"xaSsdCEEaCVPTP5gOG4VEg":{"text":"We have dined at Irene's many times, as have many of our relations and friends.  Almost al","useful":1,"cool":0},"RmuTkHB2BE0m6FntE2JDTA":{"text":"Our first year anniversary was coming up and we decided to take a trip to New Orleans, rig","useful":1,"cool":0},"Wl0MutLAoby2TkJxbXhF-w":{"text":"Wonderful service, staff, environment and wow, the food. Irene's delivers a thoughtful and","useful":0,"cool":0},"NJ5n7ascQUuGgXMyJXctbA":{"text":"We dined here New Years Eve after reading incredible reviews and my husbands past experien","useful":2,"cool":0},"4KmAFC9q9xtq7fP2Aw7Y_Q":{"text":"Food was okay \nService was superb \nBut very very very loud group of people sat in the same","useful":1,"cool":0},"4zmuEBDsfN6_qcSRyDfjsQ":{"text":"The restaurant was beautiful, the service was good, but the food was not.  I was very disa","useful":1,"cool":0},"Q20Zlh21YFN2Ir6DKox1IQ":{"text":"Wanting to eat oysters cooked in every way possible, ate at Irene's to have the paneed oys","useful":5,"cool":4},"HJATX6zHZDSB15-Qp25WhA":{"text":"Love the ambience! Def make a reservation.  Cheesecake and bread pudding are amazing!","useful":0,"cool":0},"GnjsRFbuHEUJXy7ch79oXQ":{"text":"I've been fortunate in my life to have experienced a lot of travel. Honestly, there's no b","useful":0,"cool":0},"e9JMAu0_pUCad0LW_ebuEg":{"text":"Back in Nola for the first time in many years but knew we had to hit Irene's to see if the","useful":0,"cool":1},"sm0Wea-1s0veJ99IkDkt_Q":{"text":"Best lamb I've ever ordered out. Sooooooo good. Cooked to perfection. Service was amazing.","useful":0,"cool":0},"15xPJW1Ir5d-c_-Z3wZ3MA":{"text":"Always amazing food, atmosphere and service! Brought a couple of out of town guests to Ire","useful":0,"cool":0},"WGRlsLdA35oAwj-RBsiemg":{"text":"Christopher makes your evening an experience! Yes, the food was wonderful.\nWe enjoyed a bo","useful":0,"cool":0},"TbYhtGTMB0PER2ok0NJ-iQ":{"text":"This is a great restaurant in the French Quarter. It used to be in a different location so","useful":1,"cool":2},"Yw1_lQCJcJcYo53OV_hr5A":{"text":"Read Steven S. review. No need to say more. He has nailed it on the head. \nYou will never ","useful":0,"cool":0},"hbWDMRrRpk_dFU3ajQphJg":{"text":"The food here was good to great, but what put them over the top in my book was the service","useful":1,"cool":2},"8zpxrwNSq0jFH1ThG1pBMg":{"text":"Wow. Wow wow wow wow wow. My friends from home told me \"make sure you stop by Irene's for ","useful":0,"cool":0},"cMopIoOqoak-cJQu3kOPtQ":{"text":"Service was outstanding!  I was greeted multiple times by different staff members, escorte","useful":0,"cool":0},"DFT9cxuWElk3WcjKjX82fg":{"text":"We were very impressed with Irene's. We have tried many restaurants in New Orleans, and th","useful":1,"cool":2},"7qxj8G7dGHGw5l_cYDsjIg":{"text":"Quite possibly the best food I've ever had.  Can get on the expensive side with some wine ","useful":2,"cool":1},"c_QZ4AJvAl1tnZfNn3OKgw":{"text":"I used to go to the old location and I find myself at the new location and I like it.Beaut","useful":0,"cool":0},"-CkBer4eizCPpEbAzce2oA":{"text":"Terrible experience. We were 20 minutes late for our reservation and called twice in the c","useful":1,"cool":0},"9J9eS3LOdGnFxCyYcokEhw":{"text":"Even better than last time. We were here last year and liked everything but noticed this y","useful":2,"cool":0},"6pNBtxzYZ9VuroXqrIichw":{"text":"Had one of our best dinners in NO at this place.  The bar to start was great, fantastic ma","useful":0,"cool":1},"FaFUvAvM9KROodCZLZbAhg":{"text":"We were four and dropped in without reservations. We were offered a table at the bar which","useful":0,"cool":0},"iQUVHvHe8jW1EguzYl7dXg":{"text":"Very good food, intimate/cozy atmosphere, excellent service. Please do yourself a favor an","useful":0,"cool":0},"VRlTJDT0yvutg2Uj65a96A":{"text":"Delicious! We had the crabmeat au gratin, meatballs, cauliflower soup, the duck and for de","useful":0,"cool":0},"5AHP5mFA44Hp0lkOmqRQ3A":{"text":"Ive had steaks at \"world class\" chains and local steakhouses and was surprised to have the","useful":0,"cool":0},"TxfxiFqvxJi3tl7wWv3UXw":{"text":"The escargot and mushrooms are Devine. The atmosphere so quaint you completely forget you ","useful":0,"cool":0},"Z4eR44ZHHDAhgglW6Brpsw":{"text":"I'm feeling a little sentimental....\n\nIf you'd like to get away from Bourbon Street and ha","useful":0,"cool":0},"pohyEG6rgUzmKsSJWZ4Snw":{"text":"My wife found this place from Yelp, and this was her choice of where to dine. It was fanta","useful":0,"cool":0},"dwA-BWQXSx5s7aqdwVTGjA":{"text":"With some trepidation and much sadness, we marched into Irene's new location. We so loved ","useful":0,"cool":0},"m3wFuj2s1USR2YNSIWDsag":{"text":"Nice setting. Pretty and with lots of character. Lamb and mashed potatoes were great as wa","useful":0,"cool":1},"Q_-gIlq10-pqbH1JXMDxEw":{"text":"Called 3 times was placed on hold and then hung up on. Second time I called back placed on","useful":0,"cool":0},"dezcXo6-H_WtXas3gmDgRA":{"text":"I ate here 10 years ago and could not forget it ever since. I ordered the same exact thing","useful":0,"cool":1},"rnRBDorBZ97XetQBs63Ndw":{"text":"I've been to Irene's several times. First when it reopened. Then French Quarter fest. Anot","useful":0,"cool":0},"XFK-bvC0IW9MnZvqQrkr1w":{"text":"Unfortunately our experience wasn't anything like the reviews. \nWe read the reviews and wa","useful":0,"cool":0},"p6FpJ1dV8GItHl7N3TyR0g":{"text":"This is one of my favorite restaurants in NOLA. The crawfish bisque is outstanding!! The s","useful":0,"cool":0},"A5D9ghaUPudDwJC2nsg5-w":{"text":"The new location is much better then the old. Beautiful ambiance and very attentive staff.","useful":1,"cool":0},"IHxyNl1I-YRQtWU98Mr-6A":{"text":"Always eat here each time I am in New Orleans. Reservations are a must, but it's more of a","useful":0,"cool":0},"Tau9-Lb4CNrU9frhsjixDw":{"text":"What can I say about Irene's other than it was excellent. We had a long wait (that we were","useful":0,"cool":0},"Nun4arj43H3wjYh6kXhKLg":{"text":"My girlfriend and I spent a long weekend in New Orleans and ended up at Irene's Cuisine on","useful":0,"cool":0},"9TuPDnYcIW8kAUskGjRlHA":{"text":"Had dinner here Saturday night. The seating is very tight. Bathroom are placed in bar area","useful":1,"cool":1},"uc5buly5P9wSrL1ipJunnQ":{"text":"I'm still not sure with the fuss is about over Irene's. Yeah, it's probably the best Itali","useful":5,"cool":0},"eSS6vMdccFkiT7N3ml5mNw":{"text":"I love this place. They staff welcomed us in like we were stars.  It smells amazing as soo","useful":0,"cool":0},"B1d_fpgMqWi1iKOQo7CatA":{"text":"Really great food.  The osso buco was amazing. Great service and a very friendly staff. Th","useful":0,"cool":0},"yDG3sW7wWQ2yjx7a08PtvA":{"text":"Coming from San Francisco, I was hoping I was in for a treat. Though the food wasn't bad b","useful":2,"cool":0},"ga7tqUo392g-ZAS0U87Bfg":{"text":"A great New Orleans staple. It had recently moved to this location after years of being on","useful":1,"cool":2},"y2qDghQU4YraZMJFWRvn1w":{"text":"We made reservations at Irene's a couple months ago for Monday, July 1. We arrived to a si","useful":0,"cool":0},"UMfpKvc5LZFh2cU1XxokoQ":{"text":"Great service! This must be the friendliest place I ever been in NOLA. The food was fantas","useful":0,"cool":0},"FjbvprQc4IseGLYN2vk45g":{"text":"Top 3 meals I've ever had. Can't recommend enough, Oysters Irene and the duck. Atmosphere,","useful":1,"cool":0},"u7H1jpQdonZ7qOJ88YLSNA":{"text":"My girlfriends and I had a late reservation at Irene's. Upon arrival, we tried to get a dr","useful":0,"cool":0},"LTL_B0Pb-CbivuBRYiD5ng":{"text":"Anniversary dinner! Beautiful restaurant with a romantic and intimate atmosphere. From the","useful":0,"cool":0},"6mBAcgcFZr2i6wrZEOm8Ng":{"text":"Never disappoints.   Meatballs are amazing. \nHighly recommend sharing those.   Salad was b","useful":2,"cool":0},"9bkFtrMeSr30m6v5m67Kyg":{"text":"What a wonderful, romantic little Italian restaurant!  While the menu is small, there is s","useful":0,"cool":0},"9pL_UDETJTelRNB7rxJ7aA":{"text":"We walked in on Christmas eve and stumbled upon a gem! What a lovely greeting we received.","useful":0,"cool":0},"ZeJegZ4gjPigYdUdjhrcnQ":{"text":"The Very Finest Of The Fine\nI had a magical experience eating here, though it didn't start","useful":0,"cool":0},"TX6MXSwYa0RXl-bEfvGvGg":{"text":"My husband and I were in New Orleans for our anniversary and a friend recommended Irene's ","useful":1,"cool":0},"-JJkvL6RlvJnrgKyKVnitQ":{"text":"We were told we would have about a one to one and ahalf hour wait.Well, three hours later ","useful":0,"cool":0},"kIKqVkIY-ScsGlb48FQp5A":{"text":"Dined here last Saturday with a girlfriend. Had drinks at bar, me a great dark rum on ice ","useful":0,"cool":1},"vHyEnEKm3-xGgwlWAO1G5g":{"text":"I should know by now to make reservations, but waiting to eat at the bar, is also fun.  Sa","useful":0,"cool":0},"FLr-fdTlsRLLFVeFtAufjg":{"text":"Bartender and host treated us like we were not good enough to be in the restaurant or bar.","useful":1,"cool":0},"o0ExccTsCrWUkdJoXwm8HA":{"text":"I haven't been there yet. I'm \nhopeful based on reviews but very unhappy that it isn't pos","useful":0,"cool":0},"QvcI7464Em0wZVUEeNHEow":{"text":"My husband surprised me with dinner at Irenes for our 15 year anniversary. We had an early","useful":2,"cool":1},"dQtAi2j64LMQ_e4gAXL0rA":{"text":"Delicious food, exemplary service and quaint atmosphere!  Definitely recommend as a great ","useful":0,"cool":0},"3iLlO9qD0mqWMlyUR5-9sA":{"text":"Very professional, very well run restaurant. From the host, to the bartender, to the waite","useful":0,"cool":0},"6c6LPHeP3Ppz2bR2Ws3kBg":{"text":"It is always beyond expectations.  And further, as people who never plan ahead... 9 of us ","useful":0,"cool":0},"OzI4PzRn-hAn5_BwD6R2BA":{"text":"awesome meal terrific wine ..\nso glad i picked it .. everything was super\nfresh and delici","useful":0,"cool":0},"HmR0o1Kse2C0Adb01Ms_lA":{"text":"As usual, our meal at Irene's was the highlight of our culinary experience during our two ","useful":0,"cool":0},"w4VjWchObyYKAR_F9FMBLQ":{"text":"GOODNIGHT IRENES\nHave eaten here many times, and as usual last Friday night the ambiance a","useful":0,"cool":0},"JFdQ1bZtf4cvIM97s1hNgA":{"text":"**3.5 Stars**\n\nMy friend and I spent 6 great days in NOLA earlier this month, and after he","useful":3,"cool":0},"M_NMGAXtNLZJJPHswY_5ag":{"text":"Our concierge recommended but they were booked for our entire stay:( However, they recomme","useful":0,"cool":0},"xitmmcYD-4m3IOXWEdEbmQ":{"text":"Loved this place!\nMake reservations early!  We did not and were lucky to eat at the bar.  ","useful":1,"cool":0},"-g2oh9yGr1Wyw9tEZDXp0Q":{"text":"Irene's was really good.  There wasn't too much of a wait, but it was a week night.  I had","useful":1,"cool":1},"slw1xF1ofEcuOS7JGyb3lA":{"text":"Had dinner here with several friends during a work related event. The staff was extremely ","useful":2,"cool":0},"YDafMKTI4lmx9KsFng16Iw":{"text":"We have visiting Tommy's on a weekly basis for years (since we live upstairs) and so wante","useful":0,"cool":0},"QBbUpigTvw7RqkWCqx684A":{"text":"My mother and terminally ill brother were recently visiting New Orlean's. Irene's Cuisine ","useful":2,"cool":7},"6zXE53fVhIE0IHODkIBgIg":{"text":"So my lamb was pretty good, but my Long Island sucked. Pretty underwhelming for a place ev","useful":1,"cool":0},"kGPByAckpyG4QdbVcxk6_Q":{"text":"What a great restaurant! The service was out of this world, our server was over the top!!.","useful":0,"cool":0},"r-R6JBmzNj4mqm3K5dBynQ":{"text":"We had dinner at Irene's at the suggestion of our Lyft driver.  Amazing atmosphere.  All e","useful":0,"cool":0},"OSFYTQW3bFXks0H6smZy1g":{"text":"Stephanie, one huge \"thank you\" for making our friend's birthday party such a success! You","useful":2,"cool":1},"UqRuYSUsu8ULWbiAi7bJaw":{"text":"I am so very sad. We were excited to eat here to celebrate our anniversary after several r","useful":1,"cool":0},"iRfMHl0M0QTWs0QJiQ64gg":{"text":"From the mussels to the bread pudding I can find no fault with Irene's. The lamb was cooke","useful":1,"cool":0},"vRm9eGP0TeBAAwh_NIRkSA":{"text":"We were told by a coworker that we had to eat here for dinner. My coworker was 100 percent","useful":0,"cool":0},"RrECOGaWDG1ltFTlwsPN3w":{"text":"My heart goes out to all servers who are plagued with  overserved patrons during Mardi Gra","useful":7,"cool":8},"S0hybbm55MHLb8Q8H_AWFw":{"text":"Nice atmosphere and some hits but nothing real special. The mussels were ok - the sauce wa","useful":1,"cool":0},"zZsUDgu4YdDNFTDrIsMV9g":{"text":"We were a party of 7 ladies our reservations were for 7:30 we we're there on time they imm","useful":0,"cool":0},"fVe2i7j9ozXEO_29GorsvA":{"text":"What a wonderful find for an Italian dinner.  Nice atmosphere, linen table cloths, piano i","useful":0,"cool":0},"7f2S1M_7HqE57NU-wzO7Gg":{"text":"We had a wonderful meal last night!  My mom ha drive duck and I orders the sausage and pep","useful":0,"cool":0},"ZoUdiweymYs2O4B-Ubpu2g":{"text":"This Is one of the best restaurants in New Orleans and well worth the money wait staff is ","useful":0,"cool":0},"jZBbT8bu8to2YOetr8rBeg":{"text":"Worth the wait...then again, with live music and excellent bartenders can you really call ","useful":2,"cool":0},"bUeqopgzt4BaVU1A2K5dcg":{"text":"What a great find! From the second we walked in everything was great, friendly staff and n","useful":0,"cool":0},"FbcDOCGJE0d5eM2aQqW4uQ":{"text":"Ordered the lamb and it was perfect. We had a fabulous business dinner here. We will retur","useful":0,"cool":0},"IN1jXQMo_19HT655LXZ46Q":{"text":"Wanted to try the new location; went for a birthday party with a group of 7 people. I gave","useful":2,"cool":1},"otXUXp1Z2QrcSSR51_m3pA":{"text":"We met some locals while dining in New Orleans who told us that Irene's was a great place ","useful":1,"cool":1},"ExZphHOdrkKK5va76o5qzw":{"text":"Wow. This place is special to me and my fiancé, Poppy. Everything here is stellar.. the co","useful":0,"cool":0},"CwRJFMEZDg18kFJXnDXplQ":{"text":"We ate there last night a table of five ladies. He was fantastic. Food was fabulous the am","useful":0,"cool":0},"kN7O9LY9wr4s3VMPZxebbw":{"text":"The new location was not a disappointment. It's warm and inviting.  Their duck is my favor","useful":0,"cool":0},"z2cg8COPqW-S3O_2CynGaw":{"text":"Nice family owned spot in the French quarter. I loved the pictures of the family and all t","useful":1,"cool":0},"Cj5g0pEtte4MvkdzExPqaw":{"text":"Not sure how this place got 4 1/2 stars.  Our worst meal in NOLA and the most expensive.  ","useful":0,"cool":0},"cbnTsxaWdlPQQcD4aOPi1A":{"text":"Lovely place and great atmosphere. It was a bit too loud when the piano player was in full","useful":2,"cool":0},"DKXcM0VZmMRQaBKMXDC4mg":{"text":"Came here for dinner, as is our tradition on the last night of our trip to New Orleans.  T","useful":1,"cool":1},"SzsMkfF6MsP2FziMXu0Y1Q":{"text":"This is one of the best restaurants we've ever been to in New Orleans and considering all ","useful":0,"cool":0},"dfc5dEyk9s4gEvRogLeV2g":{"text":"I have to say, without any hesitation or doubt, our dinner at Irene's was the lowlight for","useful":3,"cool":1},"OZ7Dvqv_dtYcDRXnyML_Zw":{"text":"Irene's has become one of our favorite \"top end\" places to eat in New Orleans. At this new","useful":0,"cool":0},"vxlUgN5Kac5iiaSR7BkeUQ":{"text":"Visiting from CA, food great our waiter give us tips on places to visit and things to do. ","useful":0,"cool":0},"U33ZaKhB5QNP4aiED4b5iQ":{"text":"One of the best restaurants I have ever been to and I've eaten in some of the best restaur","useful":0,"cool":0},"ooe8x9x7E6aA7VTusop_Rg":{"text":"Fried yellowtail was great, black drum was tasty and good.  Ravioli had a metal after tast","useful":0,"cool":0},"zKhXg5r7qG6k8MGr1CO6Ow":{"text":"Such an amazing restaurant!!  Wait staff was friendly and helpful. Our crab and cheese app","useful":0,"cool":0},"Zu5uKuzY_8pEuY2D-bELDg":{"text":"Food and service was AMAZING, 2nd to none. The prices were actually lower than expected as","useful":0,"cool":0},"OtCuDcK5LZ5auap2poFFuw":{"text":"Just as good as ever!  One of the trips we look forward to all year is going to French Qua","useful":0,"cool":0},"5cLb-_IWynctZ-pAyibhyg":{"text":"Omg one if not the best place we ate at the week we where visiting. Didn't have a reservat","useful":0,"cool":0},"KR7OD8uqGz4WgGbiSLTFXA":{"text":"Great place!! The service is excellent, we lacked nothing throughout the entire dining exp","useful":1,"cool":1},"5Mlk3YkD9Jt2yCVjUwThsA":{"text":"Worth the wait for reservations & highly anticipated by this party of 9! \n\nFood - heavenly","useful":0,"cool":0},"wjTa863gnwgDk5C8qRb3Fw":{"text":"It really doesn't get much better that Irene's! This was my first time, we dined Friday, 1","useful":1,"cool":0},"8tLcTHqFjucbrzMuEFDuRw":{"text":"Irene's is an upscale American seafood restaurant with full dinning service at the bar. I ","useful":2,"cool":0},"jQbne3WdXzDbFls3W9J-Gg":{"text":"Outstanding restaurant for food, service, and atmosphere.  New Orleans and Continental fav","useful":0,"cool":0},"1746KxjzVUNFExD8bEBjTA":{"text":"Such a great experience!!!  Everyone was so very friendly!!  The food was amazing!  From t","useful":0,"cool":0},"OAO7UGYkC0LdgJARCMoOdQ":{"text":"After being in New Orleans for a weekend, I needed a change from the typical Creole/Cajun ","useful":2,"cool":3},"bvOQc2FRelSKoaq1npRdPA":{"text":"This kind of service and level of food and I can dress casually???  I was sold!  \n\nWe imme","useful":1,"cool":1},"uv_0W9nqPnSWhdgqBWaL_Q":{"text":"Great bar great music amazing good. Dan our waiter was amazing!! Love the new location","useful":0,"cool":0},"s-1Mbl2xTFKEfGj2mSZUWg":{"text":"We went to Irene's last minute based on a referral from a friend and boy did we have a gre","useful":0,"cool":0},"BlM1Tm8Hw8hs6VeGTNhdTw":{"text":"My husband and I visited New Orleans last spring for our honeymoon, and we indulged in man","useful":0,"cool":0},"PK7XkERpdnfkIY-D8JbacA":{"text":"What a great place!  Our server was amazing and so was the food!  We will be back in town ","useful":0,"cool":0},"BK92To3Yy5vt8zLYC4WCaA":{"text":"I truly can't decide which was better, the service or the food. The host stand and our wai","useful":1,"cool":1},"NdQR-RtqYP6gfkfK2lIbxg":{"text":"Note to self:  next time you go make reservation, make reservation, make reservation    Ev","useful":0,"cool":0},"DB-_CDmu7u8gGLWqa9DbTA":{"text":"Awesome food. We ordered the duck and the lamb. Although this is not traditional NOLA food","useful":0,"cool":1},"xLqAJ6Jn-OH_NTZisnIzXg":{"text":"I absolutely love this place! The service is amazing, the food is superb and it has a grea","useful":0,"cool":1},"IkpU_PUvEHNwnLBtkQ0dnA":{"text":"Service was excellent. All the staff was incredibly friendly and accommodating. Food was s","useful":0,"cool":1},"5MRippTdvu6Rrv47NGoLig":{"text":"Absolutely wonderful staff, environment! Decor, and most of all the meal. No, the best of ","useful":0,"cool":0},"mZpbj83y20Exz3FY8lY72A":{"text":"Loved this Italian throwback to the 80s, on a side street of the French Quarter. Had a gre","useful":0,"cool":0},"JZ8DsFqVbZjVyg00HgdqQQ":{"text":"Phenomenal!! The concierge suggested this restaurant and I'm so happy he did. We got there","useful":0,"cool":0},"WLnuc27r2tleLO3QaMrxYg":{"text":"We had a great experience. Orlando took one of the ladies arms to walk to the table. Our w","useful":0,"cool":0},"ZKmi_4SptGn3xn7Jiy-Qiw":{"text":"This was hands down on of the best places I've ever had the pleasure of dining at. The ven","useful":0,"cool":0},"-uyYBLjCy88K8LyUI0XifA":{"text":"Great place to celebrate or just for a great meal and service.  The menu is well balanced ","useful":1,"cool":0},"Sm_oaxZd9qVjHwGGB5pe2w":{"text":"This place is wonderful. I want start with dessert & end with dessert not taking any credi","useful":2,"cool":2},"fKGd1HOdwxauAnxz87hNuA":{"text":"I would never go back to this place anymore. \nWe weren't greeted properly and didn't feel ","useful":0,"cool":0},"bO6GgJhZhU3peui3WZujhw":{"text":"The food was outstanding and the service was exceptional!!! Everything from the greeting w","useful":0,"cool":0},"Z1uAvWl5Z26w6cgZ6Arzvg":{"text":"Great place! Typical tight quarters on dark side street. Great appetizers and tremendous f","useful":0,"cool":0},"KqzBGFyL3ulKpLHSPU2tdw":{"text":"I love love love Irene's. The food is divine, the vibes are great and the staff/service is","useful":0,"cool":0},"xAwCtJjyqxXLKaNUjBlhPg":{"text":"The staff was very friendly and attentive.  The food was very good.  We had the salmon whi","useful":0,"cool":0},"LvAhGlr7op7XWHoanyOpaA":{"text":"Irene's Cuisine is everything you'd expect from a classic Italian restaurant. \n\n     Tip#1","useful":8,"cool":2},"D1O4g9JFEiC9v9NYdHkPRg":{"text":"My favorite Italian restaurant in an city anyplace! The food is authentic and amazing. Exp","useful":0,"cool":0},"waQo9Y-j62-cmrhhPwSuqw":{"text":"We first went to Irenes at it's previous location. Not to worry! I think that their new lo","useful":1,"cool":0},"ujhhglqajbAO4wRIST22Ww":{"text":"The eloquent atmosphere was perfect for a guys night away from town. For starters the mari","useful":1,"cool":1},"u8_HgthRHlkOtVF1n7u81A":{"text":"Had THE MOST wonderful post-quarantine dinner here the other day! Even though it was drizz","useful":3,"cool":2},"l1EQ-zX6ZCPdPm8rB6i5Vg":{"text":"Great place for a romantic dinner. Great atmosphere and cuisine in the French Quarter that","useful":2,"cool":0},"agyzQmFn_MxMUNjBkUueyg":{"text":"One of our favorites in the French Quarter- impeccable service, fabulous meal and a beauti","useful":1,"cool":0},"IHXrO0IrxRPE4q46A4nWlA":{"text":"This by far the best meal we have had in New Orleans! The service was exceptional. Our ser","useful":2,"cool":0},"zQb1iosFZxix9g5qW2_5uA":{"text":"Irene's was top notch from the moment we arrived until we left. We had reservations for th","useful":2,"cool":1},"iddL6vpQcfyhHXHLO2naKA":{"text":"I love Irene's! This is a French quarter staple that has been around since the 1990s. The ","useful":0,"cool":0},"x_P-N6uXv60zZC5iOcd-mw":{"text":"My mother and I had an exceptional dinner at Irene's. Wanting something different than Caj","useful":6,"cool":4},"0RDML8S4q1yCIzZtJGck7A":{"text":"Let the boujee life take over\n\nFOOD//\nI thought the food were delicious and very unique to","useful":1,"cool":0},"Wi3ovVPZPu1S7CfQkwAxow":{"text":"It definitely on the dressy side.  We got there at about 7pm on a Wednesday for my wife's ","useful":2,"cool":0},"OUcioH_K0F8JTz3lWRTRNQ":{"text":"My first visit to Irene's, just one day after reopening during COVID, was absolutely amazi","useful":1,"cool":1},"b3BXg1DQGS-MUVQUWUndGw":{"text":"The food was good. Will eat again. I would like to try anfew more items on the menu...","useful":0,"cool":0},"khpCjf5Qh24CRV7EX_ZnXQ":{"text":"I went to Irene's October 28th. I live in Metairie and never heard about Irene's. It is de","useful":0,"cool":0},"RInzpnqAHPInbUk3cGX8eg":{"text":"Dinner was so bad I don't know where to start. Oysters Irene are smothered in so much panc","useful":1,"cool":0},"Ox1DIrD_HsD8vvTK_U8-wA":{"text":"Terribly impolite service. When we arrived, we were told it would be an hour wait, so we s","useful":2,"cool":0},"tetzYuku4XlrB2rPPgk2fg":{"text":"OK, so it was my last night in New Orleans and I was craving a nice dinner prior to my ret","useful":4,"cool":2},"j-ejrKPSC5kqc69g_Jpvog":{"text":"This is a delightful place.  Food is very good and waitstaff is exceptional.  We ordered o","useful":0,"cool":0},"iRsbOHzDLcs_SulQC5HZAg":{"text":"What a gem of a place! I visited Irenes during a business trip in June. The service was re","useful":0,"cool":0},"5_m8xsepnfgMXkiRLr8mvg":{"text":"What an amazing find. We spent four nights in the French Quarter, not a single meal in the","useful":0,"cool":2},"HO3WMk0cTYXY1aVBy0e_rg":{"text":"I loved the feel of this place . It has great energy !\nIt's a few small rooms with tables.","useful":1,"cool":0},"3vEYNhOp8M7cHjaGBscRnQ":{"text":"The restaurant is beautifully appointed.  The courtyard is particularly lovely, with prote","useful":0,"cool":0},"hhYBUIpiEMzc-TTo4ldVjg":{"text":"What a delightful suprise, especially when leaving the disgusting Coop's Place, only to co","useful":0,"cool":0},"c0yftOYOX3pGG5AmZEesKg":{"text":"Thinking about my experience at Irene's really makes me smile and I think about the crab a","useful":1,"cool":1},"oA_J421MDfYcmFgH-2CejA":{"text":"We had such an amazing experience at Irene's! Not only is the food to-die-for but the serv","useful":1,"cool":0},"kb2jnr_vYZXyCF6QaSdxgA":{"text":"Irene's was the perfect ending to our New Orleans trip. The restaurants service and food i","useful":0,"cool":0},"FsTTxxws1CHvZSufw40BsQ":{"text":"An interesting location in the French Quarter. Not the jam packed bar after bar setting. T","useful":0,"cool":0},"Jks4KBb7JtHET_R_M2QMPw":{"text":"OMG!!! Irene's is my absolute favorite. We usually go with friends and they're NEVER disap","useful":0,"cool":0},"xPW0-nsj6X4n6MAekm__Ew":{"text":"I can honestly say that I've never experienced customer service quite like this before. Ev","useful":0,"cool":0},"xBfeCd6rcG2BD03Xxyp_Cg":{"text":"We loved our December 30th dinner at Irene's. Pickings were slim for reservations. Our cho","useful":2,"cool":2},"sOYPpN22fYYTRaXTalBDfQ":{"text":"We walked in without reservations on Saturday night around 7p. So, I was not surprised by ","useful":3,"cool":2},"CIXguQ3rIs-3P2T8epd6sQ":{"text":"Dinner Last night was spectacular.  The salads and drinks and entrees amazing.  Lasagna Pe","useful":0,"cool":0},"xODC0HXFFybkNdMd8JQWJA":{"text":"I asked, \"What makes this a New Orleans establishment?\"  Those around me all shared the de","useful":1,"cool":0},"PnJ20LqVul7TRT9qEpt1OQ":{"text":"We went to Irene's on a whim and it was the best meal we had on our 4 day trip. I had the ","useful":1,"cool":0},"nCdvDaZEUMQRoiJVbkDU3A":{"text":"We are back and this is the first time at the newer location.  We loved the additional roo","useful":1,"cool":0},"KgZ9WXbTcTtVcgilXY5ClA":{"text":"My bf picked this restaurant for my birthday dinner and I was not disappointed at all. Eve","useful":4,"cool":5},"49BwU2DygBlxCbRG731EJA":{"text":"Irene's is very special and in unique in NOLA.  If you are looking to get away from all of","useful":0,"cool":2},"N1y_32aooYZ0sLqCl7sduw":{"text":"I normally don't do Italian food when I am in New Orleans and prefer to stick with stuff I","useful":1,"cool":0},"_TLCCmLrSgzmwDaL9etiGw":{"text":"my husband and i decided to take a trip to nola and so i made reservations here a couple w","useful":0,"cool":0},"3ka__g0k13qpzZ74k-1ymg":{"text":"Amazing service and amazing food! My boyfriend and I we're a little drunk after a long day","useful":1,"cool":0},"_QraPVHiPSrQpXcxW_5MQw":{"text":"Our experience here for my friend's \n40th birthday was unforgettable.\nMy group of four sha","useful":9,"cool":8},"BFysQUjNOgx3sCwioy1EHA":{"text":"Irene\n\n@irenesnola is hands-down my favorite restaurant in the city. I fell in love with t","useful":2,"cool":1},"whEfRiB7mYK29iNMF93qrQ":{"text":"We were wandering through the French Quarter in search of something really great and as we","useful":4,"cool":1},"5oqnvrwlEU5Zh_QBScWv8g":{"text":"Claudia was THE BEST. I cannot express to y'all how amazing this place is. Best food I hav","useful":0,"cool":0},"QRPvqHPraK0sBmTFo6zaZw":{"text":"The host was rude and impatient.  He stuck us in a small enclosed room right next to the k","useful":2,"cool":0},"_Qr6E_mEDd3DjIvEXAgPrQ":{"text":"My favorite place to eat in New Orleans.  The food, ambiance and service were stellar! Do ","useful":0,"cool":0},"V64KSq_ol8O4AkrlA2RGuA":{"text":"Just got back from a weekend in New Orleans, that started with a Thursday night dinner at ","useful":0,"cool":0},"PZIPucipYokipYfcv6sYUA":{"text":"So happy to have Italian while in Nee Orleans. My meal was out of this world. Sauce was so","useful":0,"cool":0},"O02vDIZBd9rVPPD7q2lJbw":{"text":"Came here for our anniversary. The food and service were absolutely amazing. Top three res","useful":1,"cool":0},"klW5_tt1tnz8nhq0Icb3CA":{"text":"Excellent service, delicious food, and a wonderful, welcoming atmosphere! I had the Oyster","useful":0,"cool":0},"E2zWWf-1Y4qzDwuv4ZFPBA":{"text":"An absolutely beautiful venue. The woodworking and small room. The lousy courtyard. Start ","useful":0,"cool":0},"R5r_TDkhOu2aE2-9d-QZtQ":{"text":"My friend and I went to Irene's on our first night in NOLA. It was a short walk from our h","useful":2,"cool":1},"9c-tcXv5HJAqmSX43ueg9w":{"text":"Wonderful cuisine and ambience. Paul was our waiter and needless to say the service was ex","useful":0,"cool":0},"SMBplZ2h_6xjUFu4PsoXdQ":{"text":"This is my favorite restaurant in New Orleans.  Actually, one of my favorites anywhere.  I","useful":0,"cool":0},"yl9NgQvDp6MpAGNiIWXqMw":{"text":"Such a good dinner. Sat outside in the courtyard and it couldn't have been more perfect. S","useful":1,"cool":1},"qJaOQd6WHpREpG2DHra_pg":{"text":"love love love love this place!   even when busy they do not disappoint! great piano music","useful":1,"cool":0},"7miFHGXA-d_wqllBF5oJbw":{"text":"Dined here last Saturday with a girlfriend. Had drinks at bar, me a great dark rum on ice ","useful":0,"cool":0},"0ldPt6eC-5JLwqX2uIo-sg":{"text":"Came here by recommendation from a friend. Called earlier for reservations but weren't abl","useful":0,"cool":1},"fuKa6gbjok-weo5c_UMXPA":{"text":"SNEAKY CHARGES BY OUR WAITER: My first visit to Irene's was a disappointment for sure. Foo","useful":1,"cool":0},"-7Iemwy8qpgjyBOFToLpqw":{"text":"Not sure why my review was taken down but I am going to repost it bc it was such an amazin","useful":1,"cool":0},"EjGYXoXvkdoPovpJ0AIpzA":{"text":"Out of visiting Arnouds, Atchafalaya, and other nice places during the week Irenes food wa","useful":0,"cool":0},"uYllo80dIS1kDN41FCaM-w":{"text":"Our reservation was for 7:45. Confirmed res with restaurant the day of reservation.  We we","useful":1,"cool":0},"dnCf8w7vJZAvYXpy6py84w":{"text":"Wonderful Italian in a great environment with great service.   Nice ambience.   A French Q","useful":0,"cool":0},"3QE3aklhNPE0humoXYtRrQ":{"text":"Best dinner of my life. Excellent service. Get the crab au gratin, filet mignon, lamb, and","useful":0,"cool":0},"Q9GagKe64z5dy5Z_8KGyZQ":{"text":"We travel to New Orleans about once a year and this time we decided to visit the new locat","useful":0,"cool":0},"rTRGyPCpR0tHRSBVMt79MA":{"text":"Though my very limited experience in fine dining should be taken into consideration, I dec","useful":3,"cool":0},"N_EatYY6N1mAkgb7v8cJGg":{"text":"Irene's cleared all the hurdles.  Service, food, atmosphere, all.  We have eaten at numero","useful":0,"cool":0},"SwE-1xSn8pPGw9LOxYpUNg":{"text":"LOVE LOVE LOVE this restaurant. Hubby & I love everything about this place. \n\nWe recently ","useful":12,"cool":14},"KE7VdaK5JH9RuJVDJ9BcaA":{"text":"Enjoyed a lovely evening at Irene's last Thursday where myself and 4 others went to celebr","useful":3,"cool":1},"Rjy1JxypItwldNpNzL-Isg":{"text":"As fine a meal as we have had during our most recent trip to NOLA.  The service, the atmos","useful":0,"cool":0},"GRLv9TgDTDRCMq4lEn-HEw":{"text":"Irene's is very popular and, as a result of either that or a table flow issue, we had to w","useful":1,"cool":1},"5wv7-eIkG_H6vxUFM_20BA":{"text":"Managed to squeeze this place into our New Orleans stay after multiple recommendations to ","useful":0,"cool":0},"oLx1mFjyvXLy5NejETf2ZQ":{"text":"Irene's is by far my favorite restaurant in New Orleans. I was first brought there for my ","useful":2,"cool":2},"hyodG6xmHUzIULk-xMUdyw":{"text":"This place is PURE GOLD. Service on point, food on point, ambience on point. We enjoyed ev","useful":1,"cool":1},"-A05Hi786EpQJb07XdU13A":{"text":"Pam Molini, Mary Tolotti and Susan Poggione just had dinner at Irene's in New Orleans Fren","useful":0,"cool":0},"odA7SbGw42zxq3j5aiI1EQ":{"text":"The best service experiance of all time- so amazing. Everything was amazing and the staff ","useful":0,"cool":0},"GUu10Aixfr_dHgmUBjgiFg":{"text":"Irenes has the BEST ITALIAN CUSINE in New Orleans. The locals are all familiar with this f","useful":0,"cool":1},"reBkZFof_w14rKxHVukECA":{"text":"You will need to call 3 weeks out to get a reservation to this French Quarter gem. The foo","useful":1,"cool":1},"aYIyzftyUKsVluujDyH1AQ":{"text":"Fine dining, Italian cuisine. \n\nHailing from NYC/NJ, where we have great Italian restauran","useful":2,"cool":0},"gaLhfthYKZnMbaVuHz_wrw":{"text":"Irene's is the quintessential French Quarter Italian eatery.  Ambiance, service and outsta","useful":10,"cool":7},"_7O_AFNs-UcZaONzW_LvLw":{"text":"A top 5 in NOLA. Truly a gem. This is the only place that did not raise prices after Katri","useful":1,"cool":0},"2IVqOwp7_429DDoA0T9JmA":{"text":"Amazing is the only way to describe it. Perfect service, great vibe and the food is incred","useful":0,"cool":0},"W-A-FCW7w-wLNmDhMPmd_w":{"text":"One of the best restaurants in New Orleans when it was. I've been to this place more times","useful":0,"cool":0},"wdsYyO1PCbiIOShK99RnTQ":{"text":"This is a phenomenal restaurant and you can bet that the food here rivals with those on th","useful":1,"cool":1},"CFZAd9Ipals5X1pZGCFJWA":{"text":"For my last meal in New Orleans we went Italian??? Huh? Who would do such a thing?  Well I","useful":9,"cool":7},"eEpfAGKO0ss3kIcWqgwUbg":{"text":"Mmmm this is some very tasty food.  This is a classic New Orleans Italian Creole restauran","useful":3,"cool":4},"OHfPxjJ5JT8zMW2C7IUR7A":{"text":"service was awful.had to be like everyone else use cellphone to see food and menu. The old","useful":0,"cool":0},"QipyGodccnzTggscJW-pxw":{"text":"Favorite restaurant during my trip to New Orleans. The entire dining experience was perfec","useful":2,"cool":1},"Vb2edtPFJE3BjM5LILxG3g":{"text":"Oh please get me a fiddle for the person who missed the FREE bruschetta. Incredible the co","useful":1,"cool":0},"nwCfIkCyNAt0hLt-OdAc7g":{"text":"Always loved this place but hadn't been back in years after Katrina and moving from Louisi","useful":0,"cool":1},"bKVDfiGGfpSMgveyGMe6GQ":{"text":"I've been coming here for 25 years and it is one of my favorite restaurants in the world. ","useful":0,"cool":0},"BKUFSPAl4r2Uv9z6Ug_QMQ":{"text":"NOT QUEER / TRANS FRIENDLY- AVOID!!!!!\n\nUnfortunately the only thing I was served at Irene","useful":3,"cool":0},"IxY_hobGV6AfR0Zu0QSwQA":{"text":"We had been in New Orleans for a week and had Cajun at every meal. So our last night we we","useful":1,"cool":2},"N2DAPilDQceLc1H6EpHSuw":{"text":"Delicious. Top shelf food and service. Extremely delicious!! Very nice refined dining. A l","useful":0,"cool":0},"_8HXfAx0AViONWh7ws-qug":{"text":"I've been living in New Orleans for a year now and Irene's is so far the best restaurant I","useful":0,"cool":0},"oXSbWa--3GqiDk0Pw3iLLg":{"text":"Been twice, first time it was one of the best meals I've eaten in New Orleans. Second time","useful":0,"cool":0},"0QCW6psLUk7s6p7L90GrUw":{"text":"I would never go back to this place anymore. \nWe weren't greeted properly and didn't feel ","useful":0,"cool":0},"GYNV5gsuUL3Tw7_ooRSoMA":{"text":"Amazing food. Amazing service. From stepping inside to leaving. Warmly greeted by everyone","useful":0,"cool":0},"rsQweUzjjou1tx5ylEhXKg":{"text":"Stellar. Delicious food, great ambiance, impeccable service. Paul helped us and was terrif","useful":0,"cool":0},"K5Hjr3oUNrCwLyG4Qb8skg":{"text":"Legit amazing. Hadn't planned on Italian food while in New Orleans, but this place is now ","useful":0,"cool":0},"aHBxW1YGXLiS6KwSldNAgw":{"text":"Irene's has moved to a new location and we were worried that it would change the feel. Thi","useful":1,"cool":0},"np3IlfN6SbTZ8yMB1uxCsQ":{"text":"Had a wonderful anniversary dinner here a few weeks ago on a quick 2 day trip to NOLA. Hav","useful":1,"cool":1},"XtOkvE069Mxrx2wToV1o1g":{"text":"Yes, I am a fan, but not a super fan. Would not go back. We ended up here randomly -- had ","useful":1,"cool":1},"r6u5H0rBF3KOE3Ai7FJZag":{"text":"Everything abt this place is fantastic.  The food is spectacular. The crab gratin was outr","useful":0,"cool":0},"UzYrZLyseli5npm16uLyCg":{"text":"I would give them more stars but they're a bit racist, they will sit any other customers f","useful":1,"cool":0},"Mex5m-ZFxqZI7hJWzvDIXQ":{"text":"Had reservations for Wednesday, July 8th.  Made them 2 weeks ago through open table.  We a","useful":3,"cool":1},"ScABfNRjk6TJUfAGfORQPA":{"text":"One of the best overall restaurants in NOLA. A restaurant that is elegant with wonderful s","useful":14,"cool":8},"0TKqZMgl2nw__IxnmYihZw":{"text":"Let me start by saying the place is very nice looking, good for a nice date night or group","useful":1,"cool":0},"tnB0vRHgoyuTsWV9zhaDCg":{"text":"Stumbled across this amazing little Italian spot while searching for food in New Orleans t","useful":0,"cool":0},"bmpozL-vOJaWgupMu6q4Yg":{"text":"First let me say that I can't believe this is my first time here and they've been around f","useful":0,"cool":0},"4ZJ5K801k1FADSPrvnkwkA":{"text":"Amazing! Everything we ate was delicious! We went the first night it opened after their Co","useful":1,"cool":3},"DoHXRSHzF56gpTG92aB2BA":{"text":"Subpar food in a subpar dining experience. The wines tasted cheap. As in worse than what o","useful":3,"cool":0},"ZX4DJRPiEFBLoxLUq1g0VQ":{"text":"This place was HIGHLY recommended to me by a local.  I called a little after noon looking ","useful":0,"cool":0},"jUP-lWIMpVbKXrFXEVTvOw":{"text":"Trust me when I say that you'll smell this place before you see it! The night before we at","useful":24,"cool":24},"svlxS0nIGBPaqtjXjKKeqA":{"text":"Always great dining at Irene'. The lamb is my favorite. My wife always gets pasta. The sta","useful":1,"cool":0},"l3uakTKXzacVVHhvPO78Rg":{"text":"Best meal we gave ever had in NO. Service also great! Dont miss this place!!!\nEscargot, ca","useful":1,"cool":0},"xnw3wQywVif-Kl1xWNh4Lg":{"text":"Would you eat dinner at 945pm? \n\nMade a reservation 24 hours in advance for a Friday night","useful":43,"cool":44},"K_PpI7FTPbK0MxRiGAKDvw":{"text":"The service is phenomenal. The friendliness is unmatched. The bartender bought me a couple","useful":1,"cool":0},"f_eLw5QGoUi7VH48jMk_EA":{"text":"I had one of the most romantic dates of my life here and I am so excited to tell you all a","useful":17,"cool":8},"iQZpAQVaMBXQTIb4SngvSA":{"text":"This place was fantastic the food was AMAZING the service was AMAZING!!! I will def be com","useful":3,"cool":1},"AYvljcyMDu8sAJMwlzZbow":{"text":"Irene's does it again with an outstanding meal, phenomenal service and a fun/great atmosph","useful":0,"cool":0},"gB7iMVWqR_-NLJ6LWRciYQ":{"text":"Men, strongly recommended as a place to bring your lady. Call for reservations and ask for","useful":2,"cool":0},"BswgNQnEeGPqGxpP-IAPpw":{"text":"We got the Ravioli Appetizer, the Caesar and caprese salads and then I got the Meunière Am","useful":0,"cool":0},"cdmrZuzq40wabychLhl4vQ":{"text":"I am (selfishly) hesitant to write a review because I love this place so much and don't wa","useful":2,"cool":1},"WqxnfQSnqHncqj50Ka3OLg":{"text":"Confession time. I did not want to like this place as much as I did. I begrudgingly came b","useful":7,"cool":2},"cVPtfmj3k6dtbF1ffIvE5A":{"text":"I wrote a review of this place in May of this year. Why was it removed?? And if yelp is go","useful":4,"cool":1},"66eVaz7s8J7_e0m-QBuoow":{"text":"I love this place. The food and the waitstaff are consistently wonderful, as is the atmosp","useful":0,"cool":0},"5toMxsXXsT3dJxmpoDT4kQ":{"text":"This place is known by the locals as the spot, however if you aren't from here and you're ","useful":1,"cool":0},"2Gan9Y1iPJSeoCE6J9A2gw":{"text":"Loved our experience at Irene's. The restaurant gives off a very charming Italian / New Or","useful":1,"cool":0},"8v8YQyubpXqLP1sX683u6A":{"text":"We have heard about Irene's for sometime and finally we had the opportunity to visit the n","useful":4,"cool":0}}