{"rOxisflxibxTCzSoMsRnWw":{"text":"I will start by saying, this place is not for everyone.  If you have a crazy dog that need","useful":4,"cool":0},"5OqQEtNaDKvUfneXqSae1Q":{"text":"My dog is a prickly pear, and the staff was wonderful to him. They give him the attention ","useful":2,"cool":0},"RktyuJUFNdvbmYAJMnatLQ":{"text":"The people there are amazing and they treat my dog very well, he gets very excited when I ","useful":0,"cool":0},"GSZ0RyW8tUPoUNzMO4JUdw":{"text":"Would not recommend at all, dropped our dog off for a 10 day stay at Mid City and he was r","useful":6,"cool":1},"jZok8gCVV-_dMThIq9OWTw":{"text":"I agree with the staff being young and unexpierenced hire someone who is mature and who ha","useful":8,"cool":1},"2mHzk8XjqQHToGLCZW_jdg":{"text":"I'm so surprised at some of the negative reviews, I'm sad some of y'all had such bad exper","useful":2,"cool":1},"kBYWDWaXVamBWmZsnIZS2g":{"text":"Brought our pup in for an overnight boarding. The house itself was very clean and the staf","useful":0,"cool":0},"ck2qvf1QQWNNylZwg8DAMw":{"text":"Love the staff here. Can tell they love animals. The place is small, but our dog comes hom","useful":2,"cool":1},"fNT6TC9iSTCbdfZuwYAIUA":{"text":"The people there are amazing and they treat my dog very well, he gets very excited when I ","useful":2,"cool":1},"ARLMdQKdXHtgWa60fn6vUQ":{"text":"Visiting New Orleans for a couple days, we decided to leave our pup for two days here. The","useful":2,"cool":0},"PwHNX20yJCBXVMKOLFCd_w":{"text":"I have an older blind dog who gets nervous when she goes to the groomer but not at Mid Cit","useful":4,"cool":1},"BWnJprSIcuk43WYnUxQz5g":{"text":"I have brought my dog Violet here several times, for the day, over night, or just for a ba","useful":2,"cool":0},"uXeOADj4O5z9cxbPa6QO8Q":{"text":"My pup and I love Cali, Kelby, Chelsea and the whole team at Mid City Animal House! She ca","useful":0,"cool":0},"UqudtMMIbcKsEuQ_iIfYTQ":{"text":"Today was the second time that no one came to open the facility before I had to go to work","useful":5,"cool":1},"Va792JpzzpC7EdfhFnGm5Q":{"text":"I will never be bringing my dog back here again. The facility is obviously short-staffed, ","useful":5,"cool":0},"ZzHdOgE-mLCnwf2SHeGUxw":{"text":"I drop one of my friends dogs off to play for the day. When we are a couple blocks away he","useful":1,"cool":1},"dZccfcA_5uKdLgdj4T2sBg":{"text":"After a few different experiences in NOLA boarding my girls I can finally rest assured the","useful":1,"cool":2},"Q_BC-aVFYwfLGL8slT4wYA":{"text":"We did a Last minute booking since we were coming from out of town. They accomodated us! I","useful":1,"cool":1},"crmQj4Ch2_K_g_BzLO85fg":{"text":"Mid City Animal House is seriously awesome. We starting going to them after another boardi","useful":6,"cool":1},"hH8c2wEwrt21rjvueot3UA":{"text":"I dropped my dog off for boarding over New Years. While the initial process to book online","useful":1,"cool":0},"mP27XFHUMJzlGhm_UCgk_g":{"text":"We would highly recommend this place. We were traveling on a road trip and when we got to ","useful":0,"cool":1},"UfLHLbAmYyU6YYSaE2CTEg":{"text":"Cali and Kelly have a \"First Class\" daycare and boarding facility. They are big enough to ","useful":2,"cool":1},"sQVE5iu9X97ZEWGuyoWbAA":{"text":"I really liked the small atmosphere of this place at first and I thought it was perfect bu","useful":13,"cool":0},"7Ph6ONpRjwkEHvpPx4Pq7A":{"text":"My boys and I love them, and they love my boys. I never feel guilty about leaving them the","useful":0,"cool":2},"pQwhGu3Tn89tUm9kfJezpA":{"text":"We love Mid City Animal House. We starting going to them after a very poor experience with","useful":0,"cool":0}}