{"lQRFTrpTDaisuNkkkbGUsA":{"text":"Steak is obviously amazing. I am giving the rating based on service. We went for Valentine","useful":1,"cool":0},"uRLNBWCeoKxA_Y5GfNWX2w":{"text":"Excellent food. Every item tasted great and service was good, not great, but good. Servers","useful":0,"cool":0},"d6sE73SdNdxzqd69Kv4PYw":{"text":"The restaurant was cramped but friendly. A bit louder than we normally like but I guess th","useful":0,"cool":0},"ZcEE87urxuBe3fMIG8DkRQ":{"text":"Best steakhouse Ive visited in La. it's very classy but relaxed. Personal service. Great d","useful":0,"cool":0},"B0fJ8_aopeQ2Pe-wGquP8A":{"text":"I absolutely adore La Boca! The food is very delicious.\n\nThis was my first trip to their n","useful":0,"cool":0},"OSP2guhtDcDETuHWMONnRA":{"text":"An Argentinian steak house that I've only heard great things about.  I actually walked by ","useful":0,"cool":0},"yT1q716KTyheFjnK3lB8lQ":{"text":"Hands down my favorite place for steak in the city. Had the skirt tonight which is going t","useful":0,"cool":0},"AznBppRnfn1_nL0xxXeJwA":{"text":"Livin' la vida boca! I am pretty sure I dreamed of steak for a week after eating here.\nCam","useful":0,"cool":0},"C8Qtk8ItfTeM1YfUMvCyDg":{"text":"We have been to this restaurant several times and love the always love the flavor of their","useful":1,"cool":0},"_uhBSMI2hEAUs2BdarpVcQ":{"text":"I absolutely love this place!! The service is incredible, and so is the ever changing Malb","useful":2,"cool":0},"4qqUmESPXxkf0USqV2xVrA":{"text":"Move over delmanico, la boca is our new favorite steak house.\n\nWe first started with the A","useful":0,"cool":1},"1Ahyht0tyeUkdQKk3lYmnw":{"text":"Good atmosphere.  Great steaks. (Not as good as Chops in Atlanta.)All sides are a la carte","useful":0,"cool":0},"SSqT-af_4f15ifQtvXoNDA":{"text":"We went as a party of 4 after a convention concluded. It's very convenient; easy walking d","useful":0,"cool":0},"Sd6TZrHzrkRJiPHrMEmqMA":{"text":"best Gnocci I have ever eaten! Steaks are on point!","useful":0,"cool":0},"K8sTaqivNkoyxXZft8755w":{"text":"Of course love this place. We had a party of 10 go here recently and Joni took great care ","useful":1,"cool":0},"ztc9EasH1g91lr3stO2RXg":{"text":"One of the best steaks I've had. A little more rare than what I asked for but still tasted","useful":0,"cool":0},"dED3Tvldnv2cFTDGClHBtw":{"text":"Serendipitously stumbled into this place because it was the only restaurant with an open k","useful":0,"cool":0},"jwG_q0v0BnO1h5mU8k3QAg":{"text":"Our waitress was very attentive and friendly.  There was so much food...the servings here ","useful":1,"cool":1},"GUj9cn83J5Q0wkNIhwqFJQ":{"text":"The service and owners are still great people; however, since the move to the new location","useful":1,"cool":0},"AUAF-Wl2mA0HUu-NqPQv8Q":{"text":"Absolutely amazing everything. We did the tasting menu and nothing disappointed, especiall","useful":0,"cool":0},"41b1_q1qpN9ZUP26jpQ5kw":{"text":"I took my parents here because of the good reviews. I'm gonna be honest. I wasn't that imp","useful":2,"cool":0},"3jONwSirqoFuuahNiBbnEA":{"text":"The fried cheese in the iron skillet was to die for!","useful":0,"cool":0},"Q2oKi9LAWwQEDBDQqTHaVg":{"text":"EXCELLENT! Locals, don't walk, RUN to this great little steakhouse on Fulton Street. It is","useful":0,"cool":0},"iqEap4EFDs9d-eNB_P3e3w":{"text":"Made a reservation same day for a group of 5 at 9:30pm. We were visiting New Orleans for a","useful":1,"cool":0},"wtJCELsLjETaX9Hjcn13tA":{"text":"I had dinner here last night with my boyfriend and a few of his co-workers.  I was a bit w","useful":0,"cool":0},"7swGwj4xA1F_kPRGr0ZaVw":{"text":"If you're looking for an old fashioned steakhouse with the usual boring cuts of meat and t","useful":0,"cool":0},"qGro2H91dJqS2TIJxMMe0Q":{"text":"This place is phenomenal. The steak is perfection and is everything else on their menu.","useful":0,"cool":0},"CqrOzGGrwktqGQuGGbJ4FA":{"text":"The Chefs Tasting is the way to experience this restaurant, hands down. With a sampling of","useful":0,"cool":0},"g_rb0kUsdx76X7lBkxhHzQ":{"text":"This is my best place to eat at the French FRIES are the best come one come all and try th","useful":0,"cool":0},"l-K124TZiCj_uBKoKlE5RQ":{"text":"Worst service in town. Don't waste your night out or your money!!!! Plenty of great restau","useful":0,"cool":0},"CjN0Yodb8_oQNQCZ1W9a_g":{"text":"2 friends and I went on a Thursday night at 8 with no reservations. The place was packed. ","useful":0,"cool":0},"4XQ-_6ztJsf38ult9JZrlA":{"text":"La Boca is slowly becoming a staple when I head out to New Orleans. Sometimes you need a b","useful":3,"cool":2},"MbuhoijRvTiktlu8hAP_tw":{"text":"Have been to Nola hundreds of times but my first time here. Hands down the best steak I ha","useful":0,"cool":0},"hqq9MwK2sT4y539HusePcQ":{"text":"My husband and I discovered La Boca in 2008 when we were in New Orleans for business. We e","useful":5,"cool":0},"5TqGINcSJI2j6hHQR3bpfw":{"text":"I dont think there is anything like \"La Boca\" in New Orleans.  Superior meats and service.","useful":1,"cool":1},"xsTWTL8UQ8jeA0JceWrVRw":{"text":"Small and cozy. Interesting presentation of fries. :-) Good service.","useful":0,"cool":0},"fooDI2gFXGvumg8lbUkxiA":{"text":"Just perfect: solomillo was cooked to perfection, staff is friendly and knowledgeable with","useful":0,"cool":0},"ibf5KaO31DcKZ52GPEVNkQ":{"text":"Atmosphere was great.  Nice lighting.  Open.  Was very comfortable.  The server and others","useful":0,"cool":0},"jiu9CecXrJI8h3MYPwSXYw":{"text":"Been here many times. Always great service and really good steaks. Don't bother getting th","useful":0,"cool":0},"Dfmrs21z8OOuGFKMG6yJKw":{"text":"Visit for an amazing glass of wine, delicious bread, and to-die-for gnocchi. Then stay for","useful":2,"cool":1},"adBPr-7_4wyiyJ0FnbpEcw":{"text":"My wife and I's favorite steak in New Orleans. Great food, atmosphere and wine list! Get t","useful":0,"cool":0},"CZmLUXr4ELV6GJC8GUaMVQ":{"text":"I love this place. We booked the chef's table for a group of 6. for $45 we received the be","useful":0,"cool":0},"g8_9hzK2WhL7h052MKSMVg":{"text":"Great local  Argentinean steakhouse and one of Adolfo Garcia's top places in New Orleans. ","useful":0,"cool":0},"pWZXgL7lQ1seFe2zkZOXiA":{"text":"Seriously, EVERYTHING was amazing! Brussel sprouts, mash potatoes and steak, a winning com","useful":0,"cool":1},"8wBrHPI79peWoYPwMsOiIw":{"text":"The simplistic setting and classic ambiance leaves room for the Argentinian steak to shine","useful":0,"cool":0},"u72i770toD3vcbwdIZEqsg":{"text":"Best steak in town, hands down. Fresh and delicious Niman Farm beef, cooked to a perfect m","useful":1,"cool":0},"quPszcwec2__JOAS_2yiuQ":{"text":"Absolutly love it and Evita whould had cry for the amazing food and the great wines they h","useful":0,"cool":1},"CNSpm_ds307c1LeTTRcMvw":{"text":"Wonderful little steakhouse in the CBD. I went on St Patrick's Day evening when the city w","useful":0,"cool":0},"aMrGcJVZvkN2cteWtRiNbQ":{"text":"I have been here on several occasions and it has always been good.  I usually get the Vaci","useful":5,"cool":2},"7BjpBd8VlF-ilBTGIcuOnw":{"text":"This is my favorite steak house by far in New Orleans. I think the staff is knowledgeable ","useful":0,"cool":0},"h4uCv7QOsa4iQnHfyBrHRA":{"text":"It's been about a year since I was in NO for a conference.. And it's actually time to retu","useful":0,"cool":0},"t-NEbe0bE1y17VEozh4dvw":{"text":"Best Skirt Steak i've ever had. \nwe went for my friends birthday & we had an amazing time\n","useful":0,"cool":0},"b8-4i0F_LLxdRXzUxSyGew":{"text":"Living in Charleston, we are food spoiled. We have (what we feel) to be some of the best r","useful":1,"cool":0},"Wu5f7_SPrhmYZI2b9BhZMw":{"text":"Best steak in NOLA? Confirmed. I'll get to the food, but let's start with the wine and ser","useful":2,"cool":1},"fba72MjY9QPI92_MDxQgAw":{"text":"Wonderful, small little steakhouse in the Warehouse District. We walked in on a Wednesday ","useful":0,"cool":0},"-kf0i58q_5EMk00mY0HS7Q":{"text":"Easily one of the Best steak restaurants in New Orleans. I love the atmosphere, service, a","useful":0,"cool":0},"65-OH5wz2nowcuoGa2Gd1Q":{"text":"Nice ambiance, good wine, good food, good service.  Word economy is in, people.","useful":0,"cool":0},"mDfc32bNcUo3wtcBI14q_w":{"text":"Man, I really like this place.  Nice space, smallish but too stuffy, almost casual vibe.  ","useful":0,"cool":0},"IrIvYSrxPOWfg7cH7PNZug":{"text":"I'm don't know how, but it gets better and better every time we go. Tonight was no excepti","useful":1,"cool":1},"WKAMqkA6z0_bWvu5eyoekQ":{"text":"In a city that lives to eat, this place is a must try. Good atmosphere, great food, try th","useful":0,"cool":0},"CKrUoVZawDkcHUdSv6taGw":{"text":"Excellent service, great food, and kid friendly. Exceptional wine selections. I recommend ","useful":0,"cool":0},"WhYYwmc3Y98YCuN5NpdK4w":{"text":"I looooovvvveee this restaurant!!! Our first time was last night and we will definitely be","useful":0,"cool":0},"HZv3cMuIVlNVov4zHoo6XQ":{"text":"Its expensive. Its meat. Its wonderful. \n\nTry the tasting menu (45$ minimum 4 people). You","useful":1,"cool":0},"AvzHjKmYrH0wgnkCSTpU_A":{"text":"Came here recently with my career mentor to celebrate a milestone. We started out with the","useful":0,"cool":0},"SmF6_XBvwRVok4BwCI9xXg":{"text":"Loved this place!!!! It's expensive but worth the money! I've never been disappointed! I c","useful":0,"cool":0},"ELbn950JqI7knsxQUn2_aQ":{"text":"Just had an amazing culinary experience. Tasters menu with the 18oz  45 day aged bone in s","useful":0,"cool":0},"tu_Ih4Rn9f288jXx8sKVAA":{"text":"Came here on my first night in New Orleans.  Not gonna lie, going to a steakhouse while in","useful":1,"cool":1},"u_5iu-tDLmcYuX9rgWmt7Q":{"text":"Unbelievable! First of all, the food is good. However our experience was bordering on biza","useful":0,"cool":0},"8j9IS6kkhv2puAbrIRHBBg":{"text":"Wonderful bone in filet. The gentleman had the chorizo bifete and he loved it. We had the ","useful":0,"cool":0},"Z0o9v187sVAGCsV1Hi2yzA":{"text":"The steak is very good which is why it's getting 2 stars however the service is absolutely","useful":1,"cool":0},"kZ0wK5aFXZscWgKfwnnykg":{"text":"So the other night, my husband and I had one of our BEST date nights,ever, here.  This big","useful":3,"cool":1},"2POLhsdb_HfeOInjNmjKBA":{"text":"I went for a retirement dinner with 12 colleagues. And it ended up being absolutely undoub","useful":0,"cool":0},"1lX04Fxkrpkycihgale02A":{"text":"You have to grab 3 friends to go here for the tasting menu!!!! I've been here about 3 time","useful":0,"cool":0},"5Gb51lzKxmKgU8HMm-S75Q":{"text":"The noise level is anything but average. We are a party of four, VERY hard to hear each ot","useful":0,"cool":0},"ZQ6dr26NYCXlvS75Kf_7Og":{"text":"Love this place. The steaks were great. I recommend the sampler app to start. The service ","useful":0,"cool":0},"B12q9siz7hiWOo6ZKE53Vg":{"text":"Melt in your mouth steak and garlic fries better than any found in San Francisco.   Make s","useful":1,"cool":0},"fQ42Cxh9OL-hhlZ4jkzvrw":{"text":"Wow!!!!!!!! This place is so FANTASTIC!!!! Very classy and delicious food all around! Defi","useful":0,"cool":0},"J1q2QssmEiYoVVRIxLFT_g":{"text":"DELICIOUS!!! This was definitely the best meal we had during our visit to New Orleans- and","useful":0,"cool":0},"7qCki8-5jC8CKLVnY4Tm-Q":{"text":"By far the best customer service I've had.. Hannah was amazing, patient, and had great rec","useful":0,"cool":0},"zZb7vboEYpIknHtjGAmEiQ":{"text":"Went here for dinner last night because I keep looking for the perfect steak in NOLA.  (St","useful":1,"cool":0},"VoQ6tFIOrZc53f6Tuia70g":{"text":"Best steak in town, little pricey but worth it.","useful":0,"cool":0},"8ROZz-rI_7L0m46m9Dm7lg":{"text":"Looking for some super good, flavorful steak, look no further. La Boca rocks! Awesome stea","useful":0,"cool":0},"4Ec-FDMWUtjfg1NmCPX5mQ":{"text":"This restaurant is a must visit while in Nola... One evening we ordered the beef + caramel","useful":0,"cool":0},"qFSb6ImlgB63bflF5-_6tg":{"text":"Food & service was excellent. Kobe & skirt steak was delicious. Sides served family style ","useful":0,"cool":0},"7znwe_-Y6qvZgsp6BeP0DQ":{"text":"Absolutely our favorite steak place. My husband is a meat and potatoes guy so he has steak","useful":0,"cool":0},"5_CRs0ibbwGMa8cQUTVtNA":{"text":"I'm a huge steak fan as many of us are. And I'm a big fan of the NOLA restaurant scene. La","useful":0,"cool":0},"teDNQ3T1kIKHMYRZexgnrw":{"text":"La Boca has recently been added to my list of Favorite Places to Eat Myself Into Oblivion.","useful":5,"cool":0},"D5r7JWeU6MiqJZlVXho67g":{"text":"My stake, one of five others at the table, was burnt on the outside and it made the whole ","useful":0,"cool":0},"i3_7oRGBxsFvG-sdWwHSDQ":{"text":"Let me start by saying tonight was my 3rd visit to La Boca with 9 coworkers and I've never","useful":16,"cool":2},"OCu1nvPFMq5nIvF7ZW8BBA":{"text":"The food is five star. The hostess and general attitude of the staff gives this the one st","useful":4,"cool":0},"bY_pIpCP5Hn7_F22HM3oZw":{"text":"Before I get into La Boca I should point out that most reviewers on yelp dont know much ab","useful":0,"cool":0},"F5qGvCxK3xusY0Crok7k0w":{"text":"Simply great food and service. I have not tried all of the Steakhouses in New Orleans, but","useful":1,"cool":0},"NzfHoS-X2v_WsolE2OL5eA":{"text":"Good well seasoned steaks and meat. Especially loved the veal sweetbreads. Sauces that acc","useful":0,"cool":0},"7IW5pQJQ98aRtLC9sRyNew":{"text":"I did not take pictures because my fellow helpers have covered every wonderful aspect of t","useful":1,"cool":0},"j6q8rFElyH_VA5gSasqZ1w":{"text":"This little gem of a place just upgraded to a beautiful new location on Tchoupitoulas stre","useful":3,"cool":1},"6AbcZgmdyulNV6m-XfPpwA":{"text":"I love the atmosphere of the restaurant, a little romantic but also friendly. Staff was ni","useful":0,"cool":0},"P7WDz7N_nE-ZaxJeyBRHtg":{"text":"Will NEVER return to this place. The arrogant manager is a top notch asshole. The sweetbre","useful":5,"cool":1},"y5Sf84QX71-9ICN5ohwjQg":{"text":"Argentinian restaurant, it was really, really good. If you love steak, then this is your k","useful":0,"cool":0},"477pQXZlH1gC7yWB0Opbqg":{"text":"I was here in early February with 7 guests.  I chose it because of the great reviews on ye","useful":0,"cool":0},"FgaTAfI7oNefQcSyWC-kiw":{"text":"My husband brought me here for my birthday, and it was a delicious meal. We tried the chee","useful":2,"cool":0},"VoWrHWl-bT-gCoi1X79xxQ":{"text":"Okay.. let me explain.\n\nFood: 5 stars, 10 stars, 20 stars, I love, love, LOVE La Boca. Wit","useful":3,"cool":0},"HKQqnEyUGwpUlM1WoKDhiQ":{"text":"Excellent service and excellent food. Steaks were top notch and the sauces they are served","useful":0,"cool":0},"bsX8VxtKP62wGA7M4ROi6Q":{"text":"A bunch of colleagues and I chowed here after a very long, hard week. In a sea of shellfis","useful":4,"cool":2},"fNhj5YIFLUqyHADEb3nj4g":{"text":"A shithole with overpriced food and over sensitive staff. Was asked to not come back to th","useful":5,"cool":0},"3w9J9QJqVoQ-xN8BF_FoFQ":{"text":"I am a big fan of La boca if I want a great steak, the serve the best in the city when it ","useful":0,"cool":1},"dGVRq_GYNMdtlk01dk_qeQ":{"text":"SO RUDE!!!! If you want to be belittled and treated like a child, scolded by the managemen","useful":7,"cool":0},"EbEb-wy-lZcep6arynOfdA":{"text":"Mmmmm!!! Love that steak! So delicious! I had the Centro de Entraña which is their organic","useful":0,"cool":0},"6T4UWYQrNF8mxq6Lz6EmcA":{"text":"Went here for my birthday dinner, I ordered the solomillo medium rare waited 30 mins not t","useful":1,"cool":1},"OI9jJIopSHWH9T9dE2OA1A":{"text":"Best Frites in town.  Hanger usually good but on occasion food prep can vary.  All in all ","useful":0,"cool":0},"0QSHGDUhpTWd-vtmWjazLA":{"text":"I visit every time I come to Nola! Absolutely love everything about this place! Excellent ","useful":1,"cool":2},"JaXsAG1jQ3ZIIkiIZ9AohQ":{"text":"Gaucho plate was worth the 20$. I wish the empanadas were crispier. The filling was delici","useful":0,"cool":0},"W1dvHvqncXuXgQpF63aUWQ":{"text":"Amazing place!! Highly recomended!! The food was perfect. Arrived quickly. Lovely service!","useful":0,"cool":0},"yHrPFYKvPX8fQAmnfqruyQ":{"text":"Best steak house in New Orleans! Steaks here have great flavor and were cooked to perfecti","useful":0,"cool":0},"ENXWXaSJw_sVu32lWUJ08Q":{"text":"Unfortunately, we did not get a chance to try every steak, appetizer, and side on the menu","useful":0,"cool":1},"C_ggn43QC145nWDSq7Aamg":{"text":"I ate at La Boca on a last Monday night for my boss's birthday.  Upon entry to the restaur","useful":1,"cool":0},"eYlSPVJ8i-6yJ4QhevtxFg":{"text":"A slightly different take on a traditional steakhouse with an Argentine flavor. There were","useful":0,"cool":0},"HcqJqm8wZ3JkXcL-aXjv2Q":{"text":"We ordered the chefs tasting menu!! It's 7 courses for 49.50$ it is an incredible deal!! T","useful":0,"cool":0},"Ho-2t1XK6wBcYFFgVQC7cg":{"text":"The food and the service was excellent. Beautiful as well! However, this is just an steak ","useful":0,"cool":0},"iui_6LZfFRr9sBThy4XBJA":{"text":"We went there for the first time last night with a couple of friends and I must say, we we","useful":0,"cool":0},"JLZ11VuiG3NQfMI0YG7U8A":{"text":"La Boca is a delicious spot to have some fantastic steaks. Steak is definitely the only th","useful":0,"cool":0},"Vq92m_u9MtRzx3dEW1A0cA":{"text":"Tried La Boca for the first time tonight to celebrate my boyfriend's 30th and the general ","useful":0,"cool":0},"ZELcQwS7rfOk3uiWvAjwrw":{"text":"La Boca has the best steak I've ever tasted and their trio empanadas are always amazing! O","useful":0,"cool":0},"Mb3hE7F_4lrpux3IOUBa8g":{"text":"Are here on our last night in NOLA.  Awesome!  Our party of 4 (2 couples) had the \"tasting","useful":0,"cool":0},"7sxrmViXFO5UvZpF4Ya6gw":{"text":"Seriously, the best meal of my life. Go with a large group and do their tasting menu. The ","useful":0,"cool":0},"cVD0ESHjm4IhLaHDs9HWEA":{"text":"I have been here a few times now and can honestly say consistency is the key to this place","useful":0,"cool":0},"Yrhvz9R1ktrjTXbv2-tDAA":{"text":"I get excited every single time I think or hear about this restaurant.  It is just THAT am","useful":9,"cool":4},"SC1EjAKIYoEYls6HEYdp6Q":{"text":"Probably the best dinner while visiting NOLA. Everything about the experience was great. W","useful":0,"cool":0},"4t149FM9RfvM40jhdjEKww":{"text":"Absolutely fantastic steak and sauces. Just delicious! I had a glass of red wine and the s","useful":0,"cool":0},"QcMtldqFEg7AMYUZN9U1Uw":{"text":"Was in New Orleans for a business trip and we decided to eat here based on the hype and ra","useful":1,"cool":1},"xD_ym6hbsxHhrJzOfAHadA":{"text":"If you like steak go to La Boca. Let me rephrase that, if you love steak RUN to La Boca. I","useful":1,"cool":0},"Bxkx6zQXzwi40Bws0E9GMQ":{"text":"This is my favorite steakhouse in the city! We have been there on several different occasi","useful":0,"cool":0},"1NysvqGX8UbLYnzATt3eEA":{"text":"Fantastic atmosphere.  Make a reservation several days in advance or just sit at the bar. ","useful":3,"cool":1},"3DOXGdCBs_JCYPjy-wQ6AQ":{"text":"An intimate dining room with delicious steaks. I've been here several times and enjoy doin","useful":1,"cool":2},"eLONNKpXeAyE6GxUg-AJEw":{"text":"Had one of the best steaks I ever had. I ordered a special cut off the menu. It was cooked","useful":0,"cool":0},"XLSOWvds_-ValATt4To7-Q":{"text":"La Boca is LaBoca because of Daisy. The exclusive selection of Malbec and amazing streaks ","useful":0,"cool":0},"pDjz37xOdz28FRCSmFdwCA":{"text":"Whenever I write a 3* review I have to remind all y'all that 3* means A-Ok. This place was","useful":9,"cool":5},"tHpGXJkR71xv9gum81-jyg":{"text":"So having spent some time in Argentina I was ready to be critical of this restaurant and I","useful":0,"cool":0},"Wk90gJH-qXccPXNOxxd9xQ":{"text":"If you're in the mood for a different kind of steak house, La Boca is your place. From the","useful":0,"cool":1},"oXWrPviZ_TFB4OI6VhXlJw":{"text":"This was my third night in New Orleans and had eaten at great places everyday for lunch an","useful":1,"cool":0},"5Ha9V9H_5c6a6cl5bDlDJg":{"text":"What a night.  Arrived at 8:25 for an 8:30 reservation.  Was totally ignored.  Finally we ","useful":3,"cool":0},"cZTr0LnwKkefpmn_t6bQiw":{"text":"First off, I love steak. However, I love my steaks medium rare to mooing. So when my buddy","useful":0,"cool":0},"04xT9EkFF3ggu9id0WJj5A":{"text":"This is a carnivores paradise. I'm a big fan of La Boca. \n\nAll of their steaks are great a","useful":1,"cool":0},"DKz9QmToveYU4Q0pxmSfiA":{"text":"We ate there this evening. It is considered one of the best steak houses in NOLA. However,","useful":0,"cool":0},"Vn2KZbP_ZAxsp9wICSYRpA":{"text":"Wish I could give this 6 stars. I usually am very much a sauce person when it comes to mea","useful":0,"cool":0},"ZDicWnCSIFJaPlxHU6T-sw":{"text":"We happened upon this restaurant when we were unable to get a table at Cochon. The best ac","useful":0,"cool":0},"fwImy1vyVtRigCkasfWO_A":{"text":"Spectacular! We ordered the Chef's tasting menu which was great value and devoured it. The","useful":0,"cool":0},"ZxsLFrpM_kmiF_L-ClJXEA":{"text":"Great atmosphere. Great service. Excellent wine choices. Best Brussels sprouts ever. Outst","useful":0,"cool":0},"oxXEDNRZD3c-nP0NP4WCsQ":{"text":"La Boca is, by far, my favorite steakhouse in New Orleans. Ruth Chris has nothing on this ","useful":0,"cool":0},"a9PGiQSiZ2mW-uxoi1kEWw":{"text":"One of my favorite steakhouses. I love the bone in filet but all the cut are great. The Br","useful":0,"cool":0},"LItMkONxPQJUl3HHn4eCvQ":{"text":"The best restaurant I have been in a long time. It is so good we came back the very next d","useful":0,"cool":0},"LobtOAr6B-uPPGEZth34Wg":{"text":"\"I cut my last bite of steak in half because I didn't want it to end\"\n\n\nGreat.  Where to s","useful":2,"cool":2},"HN0dNNRhy0mwkAaX24r81A":{"text":"The melted cheese appetizer was delicious. French fries as good a advertised. Steak was so","useful":0,"cool":0},"1dgSqVrJ7P4Nf688_UairQ":{"text":"Had a wonderful New York strip here with some grilled cheese to start. Fries very unique. ","useful":0,"cool":0},"oLvujzYlKXp3glQskVB9Fg":{"text":"It is a reasonable place, the star is obviously the sweetbreads, grilled to perfection. Th","useful":0,"cool":0},"SN0HSI_OZK59x0P_e76ghw":{"text":"La Boca is an Argentine style steak house that my dinner club ate at recently and we loved","useful":0,"cool":0},"BpASeO8LnvtJFf_naSBHbw":{"text":"I had elevated expectations of La Boca. The food delivered, but the service was unbelievab","useful":2,"cool":0},"CDf8NkJC9jpqvEhGAyuPLQ":{"text":"Got the skirt steak and I wan't dissapointed.  Very tender and the dipping sauces were fan","useful":1,"cool":0},"WGRtKTamaz-oNoOp6DsYHw":{"text":"My new favorite steakhouse!  This place puts Mastro's to shame and I love Mastro's.  La Bo","useful":0,"cool":0},"guEo8qtOX0jMGjPblXJgcQ":{"text":"I recently went to La Boca with a large group and had a wonderful experience. We ordered t","useful":0,"cool":0},"lJCMP0OP-rqjQsXKRLi7Cg":{"text":"2 years ago I would have given this place 5 stars but since the maitre d who originally wo","useful":0,"cool":0},"Bf_1prGomGuVNco8-MOh0g":{"text":"Went there for large cuts of beef and pisco and they delivered. The food and staff were am","useful":0,"cool":0},"1nhsps6G4uXJgMB_zlXlIg":{"text":"Had dinner here with my husband who has been several times and loves the steak. Our provol","useful":1,"cool":0},"ImMGuJHsHuOYgUjbk861ng":{"text":"One of the better steakhouses I've been to.  I still prefer my steak to have a thick charr","useful":0,"cool":0},"8LZLdsDPnGm2rchV8ra0RA":{"text":"20 ounce ribeye cooked to perfection, fried brussel sprouts-delish, corn pudding (skip), w","useful":0,"cool":0},"dDKtSxPl7bEqnJdz8rOLbA":{"text":"A lot of restaurants murder high quality steaks. La Boca is not one of those. in fact, the","useful":1,"cool":0},"Rvy0u7bq40hr7Me44bsLRw":{"text":"rivals any NY steakhouse and is better than the chain places.  \nportions are enormous and ","useful":0,"cool":0},"Hdi_di5baZkC0U81-uxjbg":{"text":"We made reservations and were sat promptly upon arriving.  Our server was both very knowle","useful":0,"cool":0},"fKy8w7hnyYkBwvhGi-WboA":{"text":"This is one of my favorite restaurants.... by far my favorite steak in town! The service i","useful":0,"cool":0},"girycrSmLYdaUUfUm58WYA":{"text":"Why I cannot give this restaurant a zero star is beyond me.  The prices are insane, the se","useful":0,"cool":0},"UrV7dL2Fd1oAha9WtYld6g":{"text":"Great skirt steaks and the best sides. Cornbread pudding, fried Brussel Sprouts .. Awesome","useful":0,"cool":0},"M-ZXsk4tlDsSKr2_PS09DA":{"text":"La Boca's logo is a bull's ring.  On my first trip to this restaurant (at its original loc","useful":3,"cool":0},"9qv4BxUNiwHn6Vh4oBdqcg":{"text":"Amazing, food was delicious.  Service was even better, we own a few restaurants in Las Veg","useful":0,"cool":0},"2qZSR1E4V4TwiInFIUt6sQ":{"text":"The steaks were fantastic (5), but service and environment...not so great (2-3). We were a","useful":1,"cool":0},"vM-_GYgPlgHraGuFRThGEA":{"text":"I took a customer for dinner while in town, well worth it. The steaks were excellent cuts ","useful":0,"cool":0},"H1UCDyihu5wkVxvnwcx3mQ":{"text":"Absolutely amazing food.  We ordered the fixed course \"tasting menu\" and every dish that c","useful":1,"cool":0},"Rv-jNouDVZ2Fr495_SKkrw":{"text":"The Hearts of Palm salad and the chicken empanadas were wonderful. A good selection of sco","useful":0,"cool":0},"7OAiaVlfE5IedZkaxcaWlg":{"text":"So, I'm writing a non-review of La Boca which I have constantly told people is one of my f","useful":14,"cool":1},"rZk5-1TRp5OFGgkldZ-nxg":{"text":"Service was great. Apps and dessert were really good. Steak was not well seasoned, but was","useful":0,"cool":0},"Fly3V4v-6JiueRVQOUc39A":{"text":"Tonight at boca I had a great meal. Truly a fantastic one. However, we had the oddest expe","useful":0,"cool":0},"6BhOFunJmjw9mxgEEMMrsA":{"text":"One of the best dinners in the city and possibly one of the best steak houses I've ever be","useful":2,"cool":1},"IGaSZp3pK5yMmXzfJim0zA":{"text":"Found this restaurant by way of our hotel cable station that offers reviews of things to d","useful":0,"cool":0},"CPT97KW7vH6EFhDmyb-Ezw":{"text":"Great building, wonderful food, and excellent unassuming service.  Wine list is small but ","useful":0,"cool":0},"zWv5SDlr5ciwoCQglLN7_w":{"text":"Incredible. It may not be fair to give them such lavish praise but after our failed dinner","useful":4,"cool":2},"WW83iC1rOvs8lVGTOKJygw":{"text":"We have now been to La Boca a half dozen times, and this has been my best experience. The ","useful":1,"cool":1},"qjDlJkAsv2_UDZxIz1YHBw":{"text":"The ambiance is a pretty sweet mix of swanky -- it's a classy steakhouse yet it has the co","useful":0,"cool":0},"eciwTNoKkG-Z8fzoZmjiJA":{"text":"Five stars to me means I loved everything from the atmosphere, to the alcohol, to the serv","useful":0,"cool":0},"o8ZG-y8DIc_LmKFQQxYSbw":{"text":"First time I have been to La Boca, I have heard a lot of good things and let me say first ","useful":2,"cool":0},"sO67-X5SsOW0xh19AnjRtQ":{"text":"On our trip to New Orleans this was a smaller place that we tried and were a little disapp","useful":0,"cool":0},"HGRbVqPGpTOXuKXlRDC0og":{"text":"This restaurant is outstanding.  The steaks are grass fed and are prepared  with  tender, ","useful":0,"cool":0},"RIZZYHhmQgDdN8-UyX9Urg":{"text":"Wow! So fun with a group and everyone has to get the tasting menu because it's easy and pe","useful":0,"cool":0},"0xVgHIxLkBaiAkABxH5o_A":{"text":"I always try to find the best steak in any city I visit. After much research before my tri","useful":0,"cool":0},"t41_vfxbUJCbLs1jIQvn6Q":{"text":"Perfect steaks, delicious homemade sauces, awesome deserts! The atmosphere is relaxed but ","useful":0,"cool":0},"GR7xAGx3-wUv6K9dJnufBw":{"text":"Excellent restaurant!\n\nMy favorite things are the gnocci, skirt steak, sweetbreads, and Br","useful":0,"cool":0},"ka_0n5W2LuYRyqAY7vXtMw":{"text":"I was wondering around the warehouse district and could not find an open restaurant.   aft","useful":0,"cool":0},"qJ6gHrHN9nfUf5jpTdWFFA":{"text":"Had a fantastic dinner with my husband and son at La Boca. We made reservations for a Thur","useful":0,"cool":0},"s6wlZwe0Phq9w9bRXoSDZQ":{"text":"This came as a recommendation from a concierge, and I can see why. I loved the Argentinean","useful":0,"cool":0},"yMOtru1W5re4tcCLKGMc0A":{"text":"This place knocks it out of the park! Easily one of the top three steaks I've had in my en","useful":1,"cool":0},"CRnyvx2xX8QTSQaVR07NjA":{"text":"I honestly don't even know where to begin. I cannot even breathe because my dinner at La B","useful":10,"cool":12},"EqlNUcBkwLXTqn0n3qxoxg":{"text":"Will be back this weekend for the third time.  Steaks are perfect, great apps, drinks, ser","useful":1,"cool":0},"Tkb7l94A1f68lS3OtpTJvg":{"text":"Our dining experience was fantastic. We walked in with a party of four on a very busy  Sat","useful":0,"cool":0},"OVaHjHuP03rOJbP_qr1Pqg":{"text":"I was excited to come here with the new location.  I knew the food was gonna be good since","useful":0,"cool":0},"XIqHwubZCaZVWfcSGtCEaw":{"text":"We (5) of us came for steak and were not disappointed. We had the special with Chef choice","useful":0,"cool":0},"S_Cp65Druc-GJSL9mDxYFg":{"text":"holy .... shit .... this place was out of this world ... other than our 350 bill , it was ","useful":0,"cool":0},"2o_8LbYrZJCzLbDo_xz5zQ":{"text":"Best kept secret!!!  Or at least it was a well kept secret from me...  I've walked by this","useful":7,"cool":5},"FUxAbWc9xzWEQQO5GOz-iA":{"text":"La Boca is one of my all time favorite restaurants & a must go to whenever I'm in New Orle","useful":1,"cool":1},"Omf2s2iPvvY6_0W5Suxq-Q":{"text":"First off, let me just say that the steaks are fantastic. Now that its out of the way, the","useful":0,"cool":0},"zmtv2sJkrJvjkRf145b4lg":{"text":"Susan was the bartender and had fantastic recommendations for dinner. The absolute best st","useful":0,"cool":0},"zddgkT37TBXimxcxafRnaA":{"text":"Came here with a group for a bachelor party and this is the perfect place to come with a l","useful":1,"cool":0},"anZjzUWMUzYcDhZDRri-FQ":{"text":"This is one of my favorite restaurants! Very delicious gnocchi (oh god it's making my mout","useful":0,"cool":0},"ZWjtJidq-Xji5mByjeayow":{"text":"I have to start by saying that the food is really amazing. Every cut of steak at our table","useful":1,"cool":1},"nZhBhrMZ1ab-vJqndRl23A":{"text":"Love this place.  Great steaks and chimichurri.  Also a great Argentenian wine list and if","useful":0,"cool":0},"HgqhLe5rUjLD6d51d1c7xw":{"text":"Omg the food was melt in your mouth delicious. The steak was tender and a good cut. No gri","useful":0,"cool":0},"FqgtaIDUWjpSuHETEccrkw":{"text":"Amazing food, wine, and service! I recommend Oregon grass fed, pesticide free, organic rib","useful":0,"cool":0},"3iXvfqUtzCvbM-71GSphMA":{"text":"A local suggested La Boca and I'm glad they did.  This is an Argentinian themed place but ","useful":0,"cool":0},"SLc280g36cCL4EzVWVzH4w":{"text":"This is def in one of my top picks for steakhouse!!!! Everything from the atmosphere, app,","useful":0,"cool":0},"bLqpsFFu4v08dOLPpZjnQg":{"text":"The BEST steak place in New Orleans! EVERYTHING is amazing, never had something that I did","useful":1,"cool":0},"k-37I0EKBkJhFuqccNHdjA":{"text":"Well, we tried to eat here. Three business travelers who needed three separate checks for ","useful":1,"cool":0},"rjEJGB8E_u5yzB4fLsWqdA":{"text":"The atmosphere was good and the salad was great. The staff were also very nice. Ordered a ","useful":0,"cool":0},"5QzK84BfIKZq2Rz5xtbn5Q":{"text":"We've lived in New Orleans for 2 years and I can't believe we haven't tried this place soo","useful":0,"cool":0},"dV40YQLuQ4kBpOAJCIOE3A":{"text":"After several bad dinner's in New Orleans - our frustrated group selected this restaurant,","useful":0,"cool":0},"8Uf63EMqV-bcSoeieRiRtQ":{"text":"It doesn't get any better than this. Brought some friends in from New York City and they f","useful":1,"cool":2},"mDUPcLRWPnZ2UWACTMf8wA":{"text":"Waiter was mumbled and it was hard to understand, 22oz ribeye was overcooked/dry when I as","useful":0,"cool":0},"mFrCvjANTCm8ypQSsDUcpQ":{"text":"Very disappointed. This is a very overrated and overpriced restaurant.  It's a small outda","useful":1,"cool":0},"s3FEfdadXRiNdLRCIWJ5cg":{"text":"WOW! This place was great! Brought my family here and everything was amazing. I had the 20","useful":1,"cool":0},"CCfDcFJyt7y0liPZeGbl4Q":{"text":"So So So So So Good. \n\nBone in filet, large asparagus delicious\n\nI absolutely love this pl","useful":1,"cool":0},"dN0HU6HJyyVefmNWnltzBg":{"text":"Went here last night for dinner to celebrate my birthday with my husband. We were sat in t","useful":0,"cool":0},"VkwTyMbFnnLnrbE0-REW9g":{"text":"This place is the best! This was our 2nd time dining at La Boca and at the new location. T","useful":0,"cool":0},"5ebj1GOydnB5pIdpgBNmWg":{"text":"What can I say about \"La Boca\", well when you want a good Argentinian grill La Boca is whe","useful":2,"cool":1},"-ZlLd9AlFIyrOhyzrFhaBQ":{"text":"Thisvisbone of the most favorite  restaurants in NO.  The wine was great. The skirt steak ","useful":1,"cool":1},"vhtK6-4m7LyANrExfuOadQ":{"text":"The service at the front door was extremely rude and not accommodating despite the fact th","useful":0,"cool":0},"rXZ24Z6XX46VcPQAXMH5ZQ":{"text":"Wonderful... and expensive.\n\nI love meat and wanted great steak in New Orleans. La Boca hi","useful":0,"cool":0},"xBpB4I0huhVO_dvLyMMfGw":{"text":"Delicious steak, mashed potatoes, asparagus, empanadas, avocado and hearts of romain salad","useful":0,"cool":0},"Jo33pCzxuJqsEske_uPHFw":{"text":"This place! What can I say to do it justice? \nMy bf and I joined two other couples for a l","useful":1,"cool":0},"hpE5HZ8Amt3caXlIauksOw":{"text":"I have eaten at steakhouses all over the country. To say this establishment is a bitter di","useful":0,"cool":0},"oiWmx9awfLX_gz6yF2QDBg":{"text":"Ive eaten there before - I love it - however the one star is due to three phone calls - th","useful":1,"cool":0},"k1UlLdANJCUe0ZRJ3JTEnw":{"text":"Short Version: Do you want a great steak and a la carte sides? Come here.\n\nAs an out-of-to","useful":0,"cool":0},"ihLMP_1yvcOKnMP3Qs_yWg":{"text":"Nice place and great ribeye.  Nice time at the bar and nice wine.  Didn't care for Brussel","useful":0,"cool":0},"55DGwbC6clLDh9o2kZLZRw":{"text":"Great steaks. Mediocre experience.\n\nParty of 6 had to wait 45 minutes because one of the r","useful":0,"cool":0},"ehZQca02STUmJXvE1l2UIA":{"text":"Sweetbreads app was delicious and the bone-in filet was phenomenal. Try the fries on the s","useful":1,"cool":0},"DCVfY8YDolsuTPYg-AAFBQ":{"text":"Great lil gem...sweetbread was cooked to perfection...love the hanger...the gnocchi is a m","useful":0,"cool":0},"8pvWSna3AEExIvCgn5fNDg":{"text":"I loved the style of the restaurant, the brick walls and soft light makes for a very intim","useful":2,"cool":0},"MZpREIMDTRgvGblSRUv7Eg":{"text":"This a bit difficult to rate because it is basically two halves. Rating the food which is ","useful":0,"cool":0},"ZNobWXXDVGgOr44cEe_BTg":{"text":"Incredible service, steaks and cocktails.  Definitely one of the best steaks you'll find a","useful":0,"cool":0},"b9Wzt8VQ3gVwUSZbIwibVQ":{"text":"Welcome to the house of beef! This brick walled, low slung, restaurant looks like it shoul","useful":2,"cool":0},"W_Q8emW5ZT8e4On-reVbXw":{"text":"Yeah so my buddy who is a chef in New Orleans and I are talking about where to go to dinne","useful":2,"cool":0},"tGAHyFNnzZlqBwynZS1_yQ":{"text":"What an exceptional steak establishment!  And a meat-lover's dream come true.\n\nI came here","useful":2,"cool":1},"uDRCPSOxjWhQJyC8FUo_pw":{"text":"Excellent!  I am not a steak-eater by any standard, but tonight, I am a believer.  La Boca","useful":0,"cool":0},"lCUTQIZTPMM4kPRaDbNe3g":{"text":"I tried La Boca once before on New Years eve for their fixed menu and I was not impressed.","useful":2,"cool":1},"JE9fspZD6aov0XVep-zKtg":{"text":"This WAS one of my favorite places to get a steak in Nola. \n\nLast night we walked in at 8p","useful":0,"cool":0},"C6cMjTEpCNw6n0d2ubNUog":{"text":"Not very authentic. Nobody from Argentina.\nEven basic chimi churi sauce was fraudulent! Ha","useful":3,"cool":0},"T0ecABFW49uy7ew7WXmMSg":{"text":"My Boyfriend and I decided to venture out and try one of the top 10 hottest Zagat rated re","useful":0,"cool":0},"Y-KOVu7LL4bbuXKg5O51nw":{"text":"Not happy!  I have eaten at La Boca in the past and overall......way over-priced !","useful":0,"cool":0},"3Lw--saD7jki1H_VQ5zyqQ":{"text":"The steaks are very uniquely seasoned and always tender. My favorite the \"Entraa Fina\" ski","useful":1,"cool":1},"8RPgrb1P7DTaJMcC8PhPGw":{"text":"By far the worst steak I've ever had. Very salty. And chef even messed it up twice. So I'l","useful":0,"cool":0},"FjY7kI5Gf5UEoP8dPKAdnQ":{"text":"While attending a convention, some friends and I had dinner here. Nice atmosphere and all ","useful":0,"cool":0},"z6zf_LpqWdxCz4MkFZrksw":{"text":"Ill stand by my original review - they need to figure out how to respond to customers tryi","useful":0,"cool":0},"OdcJI5gsoTgSZntSASdLEA":{"text":"A carnivore's delight! If you love steakhouses, then La Boca is for you. La Boca is an Arg","useful":6,"cool":2},"U3rVV3uPxTnljzZp0Cv54w":{"text":"This place was delicious.  It is a small place, which now takes reservations.  The Zagat g","useful":1,"cool":0},"vIowuBo5uU9qM7hS7RQegA":{"text":"Now this place is one of my favorites in town. I've probably been here about ten times sin","useful":1,"cool":0},"ZtmJhbHI8cz_sDbLC3L5PA":{"text":"Impressed. Lamb Chops- delicious. Andy's Burger- delicious. Fries+ delicious. Bread- delic","useful":0,"cool":0},"Br1Rszmqc2N-wIHdInCEiQ":{"text":"The restaurant starts the Argentine vibe as soon as you walk in.  Today Bajofondo's \"Pa' B","useful":0,"cool":0},"YdkfKwVB-kQxxFjyKCE3sQ":{"text":"So I'm not a big red meat eater but when I do decide to treat myself, La Boca is the place","useful":1,"cool":1},"SdT5zR8CkC3zBaV0I34Zfw":{"text":"The service is great and the ambience reeks of an exclusive dining experience; my girlfrie","useful":2,"cool":0},"QllMxCTXgnHwL44x1QAVDg":{"text":"Entraña Fina con la Piel - definitely deserve a 5. It's uniquely tasty and way more better","useful":0,"cool":0},"hPj8es9Snf8G6PAcwYzCaw":{"text":"I had a mixed experience here but overall I will rate it as a good!\n\nI invited a co-worker","useful":1,"cool":1},"gYFrXvAtw8Op3nCsT_NDQg":{"text":"I love their meat. I love their meat. I love their meat.  There is nothing I'm going to wr","useful":4,"cool":1},"qX9wo2oG9c-MXYfdsOhOtA":{"text":"A condescending asst. manager put a bad taste in our mouth before we even picked up a fork","useful":3,"cool":0},"EAmeoZib6JHXXjB8obytpg":{"text":"Went with a party of 6, no reservations on Friday night, ate at the bar, food and service ","useful":0,"cool":0},"UryuO-UoUW8_UsIHcckwPw":{"text":"This is one of me and my husband's favorite restaurants. It is perfection, point blank per","useful":1,"cool":0},"F4zj6rjVgXih7PrECf7D3Q":{"text":"This place was amazing!!!! All my senses were so happy!!!! I can't  wait to return to the ","useful":0,"cool":0},"aS7cssJYOcgRoRxInFy4bw":{"text":"Serious meat eaters ONLY. \n\nActually, that's not completely true. La Boca also makes a mea","useful":5,"cool":2},"G-XVR0P5Iz8xUx4iDMkXGg":{"text":"Highly over rated.\nThere were four in our group- service was sluggish. We had to ask for b","useful":0,"cool":0},"-kWKRqTtqCgH3rN0L-_NpQ":{"text":"As always THE BEST SKIRT STEAK I have ever had... Slow cooked with all the crispy skin  WO","useful":1,"cool":0},"zZ6MSw5Tmdg5h86sGNOi2w":{"text":"Got to hit this one up on company dime after the Microsoft conference. Absolutely awesome.","useful":0,"cool":0},"Uh8VYi_-7Ow3MJoIUtDTjw":{"text":"Dined at the bar with Sybil serving.  She was attentive and knowledgeable.  Spent time wit","useful":0,"cool":0},"NdUXlAV1uVLe5cvSTCbz6A":{"text":"One of our favorite places in all of New Orleans. The food, the service, the Wine and the ","useful":0,"cool":0},"gO3k08DA5caNU93ffeub2w":{"text":"One of my favorite restaurants in the city. The dining room is very small and seating is v","useful":0,"cool":0},"HIGLrx-V5Kee4sWLkdAD1A":{"text":"I usually don't write negative reviews but I have to say something on here this time. My c","useful":0,"cool":0},"-RAeeTTQTCUqElZyQwq44w":{"text":"Meh for La Boca. Such a waste of time to go here for our special steak anniversary dinner.","useful":3,"cool":0},"YD8L1fcpgzJqkdIHWCejUQ":{"text":"Ironically, I am vegetarian but this is one of my favorite restaurants in the city. The sm","useful":1,"cool":0},"ZwnXkxERI7avej_RS_-qOQ":{"text":"Nice quite restaurant with good ambiance. Ordered the brochette , which was OK not great. ","useful":0,"cool":0},"9jcxfbCliK9sDsVVT5hhwQ":{"text":"I want to give La Boca ***** five stars after all, the T-Bone I had and the Strips my buds","useful":0,"cool":0},"Puda86fUD24wMeQ4pK1DpA":{"text":"Another dinner here, another amazing experience!\n\n7 of us attended dinner and we ordered t","useful":2,"cool":1},"-1pc42Y3-tYWHa50Ot4t2w":{"text":"Since I was by my lonesome, I sat at the bar for dinner.  Had a Suzerac cocktail then the ","useful":2,"cool":0},"R57jOvuufWW_W4XxKJ1ngQ":{"text":"Bruschetta is NOT to be missed. Next time we order a few and skip the entree...lol. Seriou","useful":1,"cool":0},"QYbekDFvexe8EUe5P1HxUw":{"text":"Very nice restaurant, romantic setting. I have never had veal sweetbreads before, so me be","useful":2,"cool":2},"hM66IVe-5IZfp0nua3YsOQ":{"text":"This is by far the best steak house I have been to.  Great environment and steaks cooked t","useful":0,"cool":0},"3QO05G3McIAFBMWsqykeYQ":{"text":"In a town filled with seafood and red meat, I found the best gnocchi and wine around. And ","useful":4,"cool":0},"mmRBqP_sVaKqNNv8rblyHQ":{"text":"The best. The steak and the service are everything. Very sexy food and attentive bar staff","useful":0,"cool":0},"QLccvHHpW8d1mQ30pZ9tcg":{"text":"Was treated to dinner after a hard day at work and boy was it a treat! Lots of wines to ch","useful":0,"cool":0},"Y2qoJVkmUVwyEUJBPnxRHQ":{"text":"Love this place. Sat at the bar and ate and it was amazing as always. \n\nGet the blood saus","useful":0,"cool":1},"jzN-h77GBVJTUyE58BnAMw":{"text":"This was hands down the BEST steak I have had in a long while. The flavor and cut was amaz","useful":1,"cool":0},"bUBon78q1GQ-oTO_urBX0A":{"text":"Having been to some of the best steak houses in the country, this place falls second to no","useful":0,"cool":0},"0sU2-cXn8pDhnDwz7eQKjQ":{"text":"Do not go here if you are with a group of people as they will not split your checks! We we","useful":1,"cool":0},"9qb7ExtJNQj_1qpVIaJXeA":{"text":"Came here from a recommendation of a friend. Very dark inside and has a romantic atmospher","useful":0,"cool":0},"1fAPhp4oFv9C_EVURwyuWg":{"text":"The only reason I'm NOT giving La Boca a 5 star rating (see bottom), is because I drank so","useful":4,"cool":3},"v9ZFSR7iySlbpkt6IWkPxg":{"text":"Steaks are amazing but I go for the gnocchi - best ever hands down. Service is always atte","useful":0,"cool":0},"2TfWBBlUOZhedxIVhl5wVg":{"text":"You should definitely make a reservation if you eat here. It's a place with a few tables. ","useful":1,"cool":0},"tIPpra2TSVa6CoG_jkxUzA":{"text":"If you have some money to spend, this is the place to go! The flank steak special tasted j","useful":0,"cool":0},"1Q-Nh--5GqDzbe34wBUScw":{"text":"La Boca La Boca, quite interesting dining. We started with the cheese dip, which was very ","useful":0,"cool":0},"812b3sxMQDw7JMEFAzmweQ":{"text":"Our Favorite!!\nOnce again - perfection!\nFor starters..don't pass on the Provoleta- OMG!!! ","useful":1,"cool":1},"kULqIy82IgUIwo37gXHG6w":{"text":"I've been to this place once before and from then they had me at hello. I never got around","useful":1,"cool":0},"ArStAjA8_boYIQSiUmM4yA":{"text":"This place was terrible, I have been to many steak houses and this is by far the worse. Fo","useful":0,"cool":0},"dLdi9_PBwD33OP4HIL8DDA":{"text":"Been to many steakhouses here in the 3 years we lived here .  while this was nice , i am a","useful":0,"cool":0},"7t4y9PNOeSGU95MDggMHOg":{"text":"Goooooood steaks...and I've had my fair share of steaks Miami and all over Texas. \n\nMilane","useful":1,"cool":2},"zGGzi4RvIk2l6faCETorkA":{"text":"This place was really good! The cuts of meat were very generous. The mashed potatoes had a","useful":0,"cool":0},"WFSEs0AalEnjCupVWkzk8A":{"text":"The best steakhouse in the city. The food, service, and atmosphere are always top notch.  ","useful":2,"cool":1},"2YQNAj62dDmL7v2SLI4oXA":{"text":"Just went to the new location and loved it. They are still tweaking some things, but all i","useful":0,"cool":1},"aiNxyYnQ41Aeomm9oNZzuw":{"text":"Really love this place. I hit it at least once a week and everything is great! Nice wine l","useful":0,"cool":0},"UAMcP-lASrq9HCu2C-2uMA":{"text":"The service and quality of food here are second to none!! The hanger steak is incredible! ","useful":0,"cool":0},"yGcrD0R4cx56Js3B9nyipw":{"text":"The Hanger steak was unbelievable, and I'm super picky about my steaks.  Sides were big en","useful":0,"cool":0},"GSPe8QUWrlK-k5IXxHekXg":{"text":"This is the best filet I've ever had. I ordered it medium rare. I had the fries as a side,","useful":0,"cool":0},"DoEulCL3g4WLX59qQLBDnQ":{"text":"While the quality of the meat is excellent, the actions of your staff were inexcusable. Th","useful":0,"cool":0},"j_IXg6Up6VARIJ-5BNQJsw":{"text":"Mixed feelings and won't be back. \n\nWalked in with reservations, got seated by the hostess","useful":1,"cool":0},"hM3eJSai-lUvxXSTM4JcxA":{"text":"Excellent as always. Great service and the food is fantastic! Definitely the best hanger s","useful":0,"cool":0},"MeBdXyLjQnvimA4el0KcZQ":{"text":"We rolled up on La Boca last night after one in our party of 3 (the only local) said it wa","useful":0,"cool":0},"103qRtzADtH4IDC2-YD4MA":{"text":"Walked in off the street & ordered the vácio steak it was cooked to perfection. Also tried","useful":0,"cool":0},"X78vBSWWC40cAuAs1YaV4w":{"text":"One of my favorite restaurants of all time.  I first learned about this place when I was i","useful":0,"cool":0},"AkTCpTXEQeNwxd_bd6vj-A":{"text":"The food was excellent, but the portions are huge!!!! The service was adequate, but the se","useful":0,"cool":0},"pQxYZoXIC4B3ot0guvXMBA":{"text":"I can't comment on the food or the drinks as we left after being seated. We had a reservat","useful":1,"cool":0},"uXyLx7FcmogAMEeO_o_GbQ":{"text":"This is a beautiful restaurant with flavorful food! It was my first time having sweetbread","useful":0,"cool":0},"IpzbsUc6go95vJ3NXx8FFQ":{"text":"The atmosphere of this restaurant was def a good mix between casual and fancy dinning. I w","useful":0,"cool":0},"X8yszKK4NqvxJLyU5v2aMA":{"text":"I ate here last night.  Amazing food, but what found more important were the drastic measu","useful":0,"cool":0},"wt7L4R7lDkIwNVgvgjGhhA":{"text":"Great place for an affordable, delicious steak in the Convention Center district of NOLA. ","useful":0,"cool":0},"iDUSd9zqL3wHcNpdlZxeKQ":{"text":"Oh, La Boca I think I'm in love! I have been going to La Boca since it was located on Fult","useful":19,"cool":16},"vWSToaNGJ2kdGFu3_cUFPw":{"text":"As part of a week long \"meat fest\" (where a group of men are going around and eating at al","useful":9,"cool":3},"MkwHX9iHTnZyw7vBL3lKqA":{"text":"The steaks at La Boca are good and it's in my neighborhood which is why I like this place ","useful":1,"cool":1},"1ji5VHX5nu1yOVSsRvHytg":{"text":"Great service, great steaks flavor and terms perfect, cozy place and nice environment","useful":0,"cool":0},"x25HhsMP2n2TyRcPEztwjQ":{"text":"This place has been on my must try list for some time. It will be on my frequent dining pl","useful":0,"cool":0},"BTp6YGgiWmUEIYq38vWdPQ":{"text":"I have had better service at McDonald's. \n\nWe were so disappointed in the managers approac","useful":9,"cool":0},"hwxyJX9VnRt_EezEGTXU7Q":{"text":"Stephanie was the coolest, kindest most professional waitress I've ever had.. She describe","useful":0,"cool":0},"th5JwwMvIX4XymNqhHdgHQ":{"text":"Excellent all the way through! We did the several course full table meal and it did not di","useful":0,"cool":0},"XivnqIXryljIyTh_X9aWJw":{"text":"I'm vegetarian and horribly affected by wheat, but went here because my boyfriend and I we","useful":14,"cool":4},"y8Fu-PJ9RwTSMXRc19jasw":{"text":"Went there and ate at the bar and had a very good meal and informed service. The sweetbrea","useful":0,"cool":0},"YysKh_2A62I0LUgtgp718Q":{"text":"I was in New Orleans to celebrate my birthday along with 7 of my friends. We made reservat","useful":5,"cool":1},"B0YQMll_PWp0yY1--O25TQ":{"text":"It's funny how a few changes in a dining experince can dramatically change one's opinion a","useful":2,"cool":1},"R8yMqGiUJtoenYiFmrPC1w":{"text":"The experience was meh. Let's be honest, once you get over a certain dollar amount, the st","useful":2,"cool":0},"Jtaf6ZRNZgNmfPKqc7Wjfw":{"text":"Perfect steak. Drinks were amazing. Fantastic Argentinian. I've had some good Argentine fo","useful":0,"cool":0},"v8857zgDZGpV007OvnraDg":{"text":"Steaks were incredible.  I didn't know what Argentinian steaks were, but all three of us i","useful":0,"cool":0},"oV9SeJ_vSAyviB2bIVtBoQ":{"text":"I came to celebrate my birthday. \nLove the cozy restaurant the stake is mouth watering del","useful":0,"cool":0},"3wxz0agYcVrs36hB_XG1Vw":{"text":"Food is great. But for me it's all about the overall experience. Having dinner at the bar ","useful":5,"cool":0},"L-M5OqcgmN6sAS4b4h9WAg":{"text":"I Had a Second Date Here Once...\n\nWhat's this, Scott? An actual second date? Yep, moving o","useful":8,"cool":5},"rB0VYEEWPymuBxEEV0YwmA":{"text":"Tried to eat at this restaurant this evening and since everyone was not eating they would ","useful":1,"cool":0},"qowpVfMo0JUhiaudELZIvQ":{"text":"Top steak house in all of New Orleans. This is by far my favorite place my wife and I go t","useful":1,"cool":1},"SFsiEopPJY0Y5Al0jfHk7w":{"text":"I've never been to an Argentinian steakhouse, but I might have to start. We came on a week","useful":0,"cool":0},"gPfiYolaBAeVEWdG7AN_-w":{"text":"The steak was cooked perfectly! We went for white linen night and it was busy but we got s","useful":0,"cool":0},"qtu6bRkcGtbcl7loN1pWjw":{"text":"My fiancé, two friends and I were in town for the first time and we were trying to find a ","useful":0,"cool":0},"dhWh8gLsiiXxmau8LbRStA":{"text":"I honestly do not understand all of these rave reviews. I can't remember the last time I h","useful":0,"cool":0},"wFFEECQQVeNtRko_Dc82Aw":{"text":"A Regular visiting spot for our family and last night's dinner was again amazing!\n\nWe love","useful":1,"cool":1},"K08BMUPh8blVX8QDc8RS7Q":{"text":"Appetizer- Chorizo sausage & Provoleta Cheese\n\nMain-- 10oz filet. \nSide Dish- Mashed potat","useful":0,"cool":0},"KDtRQLPSkXtovAmF-VIR6Q":{"text":"Steaks taste better at Texas Roadhouse than this place. Don't recommend. Terrible ownershi","useful":4,"cool":0},"mBOC2hCzbAswxp3TGkpifg":{"text":"Looks very elegant from the outside. Unfortunately on this day their AC was not functionin","useful":0,"cool":0},"UyGjIDqyOwq_zfxWlVlmYQ":{"text":"OMG!!!! This little place is easy to miss but one place you must eat at.  Make sure to ask","useful":0,"cool":0},"nVWLqMG1w8-tqypNYbJJKQ":{"text":"Phenomenal. Delicious steak, apps and sides. The manager went above and beyond to get us a","useful":0,"cool":0},"d6ui2wKc-dtdU29MS8T-bg":{"text":"Yes. Just yes... \n\nGo with a group and do the family style menu. So much fun. Incredible s","useful":0,"cool":0},"4FGKRyqn5IM8XaWzQA4nDw":{"text":"This December our family want again to La Boca and another amazing culinary experience. \n\n","useful":1,"cool":1},"A9v0s2ZKhpQ7CBymM8vb0g":{"text":"The food and service is amazing.  This was our first trip to New Orleans and we have alrea","useful":0,"cool":0},"kUE5Cs4Nu1Y6LyLN_6VT0g":{"text":"Having heard so many good things, i was excited to give them a try. We chose the recommend","useful":9,"cool":4},"Bot3U4gMW6DRdZNvas-JeQ":{"text":"Amazing food.. great atmosphere! I Love this place! This is my first time in New Orleans a","useful":0,"cool":0},"i4_gWTLVlmsXfsbbEtLmxg":{"text":"The service at this restaurant is atrocious. It is so bad and disappointing that no matter","useful":15,"cool":1},"iuEgMFUV9ELqQ4ClKM_HGQ":{"text":"The service was amazing, the waitress was very knowledgeable,  the owner was welcoming, an","useful":0,"cool":0},"PsDSutzswiCN_ZaJHkVX5A":{"text":"The best place me and my roommate have been to. I was completely full and just couldn't st","useful":0,"cool":0},"TD5oPsPVWqArFrCM5RAfVA":{"text":"Me & my family went eat here at La Boca steak house. When we got there we parked the car, ","useful":2,"cool":0},"jFOTdRXu9xFhy2zqiR8hJw":{"text":"Worst steak house ever. Thought we were getting authentic Argentinian cuisine only to be s","useful":1,"cool":0},"LeJ24KvWZxJjJiJhyRVYyA":{"text":"Been here on several occasions and this place DOES NOT DISAPPOINT. If you love steak and d","useful":0,"cool":0},"WXWgMIWrP8RvG1Zhn0G3gA":{"text":"I've only eaten at La Boca for dessert, but I loved the atmosphere and absolutely want to ","useful":0,"cool":0},"tm5EjMlGsctWIuDCE9Mizg":{"text":"Pisco Sours are the craziest shit I've ever swallowed. Do with that what you will.\n\nAlso, ","useful":0,"cool":0},"B0BJ7BvYRCOiPuLBvvXO6g":{"text":"I have made some...\"memories\" at La Boca. Some of which would have gotten me 86'd from oth","useful":0,"cool":0},"0RmTwX6dE_SMmPZ7BUNPvg":{"text":"The food here at LaBoca is nothing short of delicious, however, the customer appreciation ","useful":0,"cool":0},"oNXMw91wIv4DiAWIMHKH7w":{"text":"If you enjoy fine dining and steak, this is hands down the best place to go. We've had man","useful":0,"cool":0},"v_mud4_RHD6ySPKwLlODGw":{"text":"This was my 1st time going to to La Boca and it is officially my new favorite steakhouse. ","useful":2,"cool":0},"60mKDCEQr8OIzLzNi17-8Q":{"text":"Been several times and always a nice experience.  Staff are always pleasant and food has g","useful":1,"cool":0},"cHps3K3V0FpyB15dxe-OxQ":{"text":"Ate here once and loved it but not sure what happen to the customer Service.   Called toda","useful":5,"cool":2},"gU_6ii5n3NqxXBJ8xGsgSQ":{"text":"Would have been a definite 5 Star,,, but read on.  The food was great, we had the chef's t","useful":2,"cool":0},"wEBN7xby38_g5fWE31MqtA":{"text":"Wow, what a great dining experience we had tonight.  The best entrana I've ever had.  The ","useful":0,"cool":0},"N0aUQelhXAIuMhK6poESAw":{"text":"Not that great. Extremely loud, So loud you have to lip read or lean over within an in inc","useful":0,"cool":0},"MQMXzmB6b6FzTCv2hY7edQ":{"text":"I only come here once or twice a year, but every time that I do I always think to myself t","useful":11,"cool":6},"5CSgcUekJJp1A5itKo37EQ":{"text":"Well that was certainly disappointing, all of us have heard someone describe a meal as ine","useful":0,"cool":0},"2WqKlfQ9Xyx-PHxGgw6PTg":{"text":"I don't give 5 stars often, in fact, I usually try NOT to give 5 stars because I believe t","useful":2,"cool":1},"sIaQ-23e2AasbJwc2ohLEw":{"text":"I first want to say, our food was absolutely amazing. My husband and I ordered Bife del Lo","useful":7,"cool":0},"xYU9_d4r-N24SZlSqkTY_w":{"text":"Our dining experience was incredible from all perspectives. Love the casual leaning ambian","useful":2,"cool":1},"eZA1tHopjif4fRbI0H4v4Q":{"text":"Great steak and by far the best fries around. Awesome service, the manager and the chef st","useful":0,"cool":0},"fEchkiuvDucntngDARoE2A":{"text":"BEWARE !!! EXTREME MASKS MANDATE at this establishment! THEY MAKE YOU KEEP YOUR MASK ON EV","useful":19,"cool":2},"Mut4D-riq4vuFMMX_QKKNg":{"text":"I started this review in the restaurant and never finished.  I think I was too preoccupied","useful":1,"cool":0},"IB2y38cTYeFWo3c4o0H9xg":{"text":"I don't like the punishment for being a party of one. Apparently, single people have to si","useful":2,"cool":0},"fSbcnZF6L3raK74UNadcWQ":{"text":"Amazing establishment, I'm so happy that they've reopened post covid. The Bife Ancho is ha","useful":2,"cool":0},"MKJQbBd16UiulWZAVeCtzw":{"text":"I could go on about how bad it was but just read the reviews.  To many great restaurants t","useful":2,"cool":0},"Rx7JZmVqSlNDKSwBxZRcHg":{"text":"I'll cook my own steak at home, will leave out the sides of rude and surly, and will finis","useful":1,"cool":0},"8lC6ez6-DMjNXgS2IaKC6A":{"text":"We went last night for the first time and the owner was there.  He was so helpful and so w","useful":0,"cool":0},"qI0jli7u8Hjd4NLdytbAdA":{"text":"Asked for medium rare it came out well done. If I wasn't on a date I would have complained","useful":1,"cool":0},"8hYgm9gDO5_xl56vgqthoQ":{"text":"The food receives 4 out of five stars. The reason I am giving them a two star rating is be","useful":9,"cool":0},"JY0NkPJ124s5WWoZ1-WpWA":{"text":"Choose Your Weapon!  \n\nAte here for NYE.  Prix Fix menu was perfectly balanced.  Choice of","useful":3,"cool":1},"vvKaTMDMMcF3kXDPrJpTGA":{"text":"Their food is always good but the new manager or host is quite rude. I get he's annoyed wi","useful":7,"cool":2},"YxPBRlqqHySEY4CVKlcX9A":{"text":"I would like to preface that the pictures are not great and do a disservice to the delicio","useful":0,"cool":1},"q4aPAJi14J5K-oQ3B5Ri7w":{"text":"This was hands down the best meal I had while in Nola, and I feel like we did nothing but ","useful":0,"cool":0},"TGooPyF5pbyiK2hElAbWoA":{"text":"Manager was rude. Ruined our experience. Steak was good. Sides did not measure up to other","useful":0,"cool":0},"-4hYqxmoLi6ELV1EN3zPTg":{"text":"We were so excited to have dinner here during our visit to New Orleans. We had heard nothi","useful":2,"cool":0},"8qRuFi552n2YFAIbzjtbwA":{"text":"This restaurant provide the absolute worst meal I have ever had in Bew Orleans since movin","useful":0,"cool":0},"wSNO8hBZnTJezXVr1aiXxQ":{"text":"Did some day drinking with my beau pre-COVID and found ourselves craving steak. We just ha","useful":1,"cool":0},"7D4ICrccbkWZydsx4dHelg":{"text":"This place was magnificent! Truly something special. You have a eat meat to enjoy this pla","useful":1,"cool":0},"4jCeg1k7eaUN5gAORe_0BA":{"text":"It's an amazing place to celebrate your birthday, anniversary, or a simple dinner date. Se","useful":1,"cool":0},"O8oyjHFN5anQIOCiETRfsA":{"text":"I came here for a chicken sandwich and sweat tea based on the owners comments on some of p","useful":0,"cool":0},"IgmdqHPfIuMYjI4d7TBRWg":{"text":"Worst dining experience in New Orleans. Steaks were undercooked and sent back but returned","useful":2,"cool":0},"Pcg-d0fw7PIKNVu1atkH9w":{"text":"Overpriced food with mediocre service and uncaring management.  Locals and tourists would ","useful":11,"cool":0},"ManDws4TtIuMkkn4gZ_3UA":{"text":"I have dined at La Boca many times and have never had any complaints...until now. Brace yo","useful":8,"cool":0},"rnFwbISuHFB3Xq8xxc87ig":{"text":"Really wasn't impressed with ribeye or the other steaks brought to the table. Price and qu","useful":1,"cool":0},"pbQ69BL7xegTjZvC91hgVg":{"text":"Let me tell you.\nTonight on a whim I walked to La Boca. Was craving a steak specifically a","useful":1,"cool":1},"CGajI_P-DmU7_KcDI7JBeA":{"text":"I've been pescatarian for 13 years and had celiacs my whole life and we came here for our ","useful":1,"cool":1},"UmmI5G7If48mWpnw2UOjhw":{"text":"Extremely disappointed! Service was extremely slow,food was burned and tasteless.Really di","useful":0,"cool":0},"bmumuMeyFw9kZ5XqFg4hQg":{"text":"Cool place. Would recommend! Yummy empanadas. Good steak cuts. They have an interesting en","useful":1,"cool":0},"kUPsaohQ1A-dxP_nhbFKyQ":{"text":"I read the the reviews and heard the hype.  The place is just o.k. and overpriced for the ","useful":0,"cool":0},"6hHGor3WxDVlI7JOdtPyTA":{"text":"We have been wanting to try this place. We made reservations for a friends birthday dinner","useful":1,"cool":0},"dIhyVLYt9ftHNUfdqvRmTQ":{"text":"Went in with a reservation (required during Covid) on a Friday night for my husbands birth","useful":5,"cool":3},"Ex4SUmIyCnmj5F1eJ5ZB3Q":{"text":"I wouldn't say anything to embarrass my party but, as much as they are takin COVID serious","useful":9,"cool":0},"4NMVwAdtAJcN-gN1xKhxKQ":{"text":"Good, not the best, ordered medium rare would have prefer rare with their cooking style.. ","useful":0,"cool":0},"-oN98OAGfe1wKH_8WBon4A":{"text":"The food was ok,n othing spectacular. The severs where very nice. And tried their best und","useful":3,"cool":1},"or_k0RpcV7xVegEihpz81A":{"text":"The flavors and textures we experienced at La Boca were the best of my visit to New Orlean","useful":0,"cool":0},"lFdREVZfKRpPnwMfJi967w":{"text":"Stumbled across this place literally a second from our hotel. Upon reviewing the menu our ","useful":2,"cool":0},"TtzOuEEQf8jDV83lODcEOQ":{"text":"Visited La Boca for a small celebration and was please to find them open and easy to make ","useful":8,"cool":4},"4TkY3J7f3RVJoqwiSQd5Rg":{"text":"Pretty sure humans have canines for ONE simple reason: to eat La Boca's steaks.\n\nSeriously","useful":2,"cool":1},"dl0qcR6-zpGkic9oCrBvOA":{"text":"Stellar drinks. Stellar service. Stellar steaks. La Boca has become my favorite steak hous","useful":12,"cool":8},"Gine1sFyyqEx9PHbBj-uAQ":{"text":"I'm going to start with the star of the show:\n\nThe flourless chocolate cake. This thing is","useful":2,"cool":1},"RMbT0PPm7lY4ks2f2_O0Ig":{"text":"La Boca has always been on my list of places to go. So I decided we should go for Valentin","useful":4,"cool":2},"zdkifn0PRRUepAhQa0Cqlg":{"text":"The fries. Oh my, the fries. They're perfection. The steak is glorious, but the fries simp","useful":1,"cool":1},"t7A8bMA-xzfIZ3cA6h1iKg":{"text":"Steak Night Part 4! I'm a big fan of this place and all its Argentinian steak glory. They ","useful":3,"cool":0},"t146JCGlUUf8sbp08Je8MA":{"text":"Wanted to let some time pass before writing about this place. Let's begin by saying I love","useful":5,"cool":0},"Wu4aYuPPqUvAevUEBuarnQ":{"text":"This is a great place to get steak - their sweetbreads, cheese, and sides were also delici","useful":1,"cool":1},"M6lMYNINi2nDTD6v5z8Wrw":{"text":"Romantic dinner was ruined, we ordered la Boca steak, Mollajas -veal , apparently it is no","useful":3,"cool":0},"zcKkxPym7uJ38qqdaaR8jw":{"text":"Just a wonderful experience here. The staff was accommodating and friendly, the steaks wer","useful":1,"cool":0},"rGiEBswkBf21V_XFPAo4bg":{"text":"I discovered La Boca on my holiday trip here last year, and it quickly became my favorite ","useful":2,"cool":2},"R0njlxs9k8hbzTrkcJOUqw":{"text":"There are many great steak houses in New Orleans but sadly most of the time I get done eat","useful":0,"cool":0},"T9cICwgCAmg9TQVO0kxQxQ":{"text":"La Boca is a very cute steakhouse. It's pretty small on the inside, but the tables are at ","useful":2,"cool":1},"ct_sMUvOyP02CKLdt6Xjkg":{"text":"This place is terrible. I've been there 3 times and every time it declines. Save your $$. ","useful":0,"cool":0},"b40ZTbw6TquV0E6qmIT_Qg":{"text":"Good food, but with a few issues, went on a weekday night which I recommend, We loved the ","useful":2,"cool":0},"w4fuLP8prz0_qGcn7CtAwQ":{"text":"Great food and wait service. The arugula salad was good. Steaks were cooked to temp and th","useful":4,"cool":1}}