{"iTcEQ7lRR8Ft4NvYVI7EeA":{"text":"The music is always great, but the service was very bad. It took 1/2 hour for us to get wa","useful":1,"cool":0},"KvE-4k92JmFmcdt5QvUl3w":{"text":"This place probably deserves 3.5 stars.  It's a nice bar to have a beer and listen to some","useful":0,"cool":0},"nhFhei2SRsqY6viNS1FwLw":{"text":"We needed a break from Bourbon street and I really wanted to enjoy live music, so we went ","useful":1,"cool":1},"BbCTUNA575rBTiLsDoG0vg":{"text":"Great music, service attentive, decent draft beer selection! We came in because the Friday","useful":0,"cool":0},"itdXfdB29C21VJv8_RvrRw":{"text":"Great band! Good fried pickles, really good service.","useful":0,"cool":1},"yXwjGmB29jD9yAMwOwe0Bg":{"text":"I think I heard the best bands here during my time in New Orleans, although not one venue ","useful":0,"cool":0},"CTIeBK71fomYknC2diepdw":{"text":"Nice atmosphere and it was the only bar on Frenchman street that was playing music @ 1 on ","useful":0,"cool":0},"8l-qVemxEyxeQzPp1eB1ng":{"text":"This place will make a local out of me someday.  Great music, food and drinks.  Great atmo","useful":0,"cool":0},"vp7DWIWEcZesO6RUW4-x7Q":{"text":"The service was awful and I would not recommend this place.  The waitress pushed us to ord","useful":1,"cool":0},"IwIz7XWO1a-CVTFFxltjdg":{"text":"My wife and I live in the lower Quarter and walk Frenchmen almost every night so we have p","useful":9,"cool":0},"vzFZNbSZGhZYzSE7redtNQ":{"text":"Great live music , friendly service and tasty snacks!  It was a good choice for a stop on ","useful":0,"cool":0},"3jHHAPEmdILiaoGxIXQkBg":{"text":"Great music venue on Frenchman Street with NO COVER!!! We were wandering around trying to ","useful":0,"cool":0},"FGos3MK-eGlxtE_aVgdMYA":{"text":"Great little bar/restaurant on Frenchman St.   No cover the night we went in, so not sure ","useful":0,"cool":0},"Qf9ZMbGjRUm8h3Bh_v0njw":{"text":"Awful service! If you are visiting NOLA save your time and $ and don't walk into this plac","useful":0,"cool":0},"k58VHBQryhyEpMksklf_KA":{"text":"Music was great! But there was a live cockroach enjoying the music in my friends fish taco","useful":0,"cool":0},"CNu1mCRdzHeT9qvcytVq0w":{"text":"Lots of room, tables and dancing space.\n\nGreat music the night we were there.\n\nRecommend!","useful":0,"cool":0},"szt7k0zThXQ6FhTXcvdruA":{"text":"My husband and I were passing by this bar when we heard an amazing band . We couldn't help","useful":1,"cool":0},"NMdXNiLRJ7lgKfebCVzVNQ":{"text":"We were extremely disappointed in the lack of professionalism displayed for our group of s","useful":1,"cool":0},"PhX4Qk0nwDx5HRqn6v7HGA":{"text":"All the stars here are for the live music. It was excellent.\nService was not great. It was","useful":0,"cool":0},"dtzWdBAToDnhZdcBbLprqQ":{"text":"Great server, cold beer, typical bar food, clean air/smoke free, good live music, New Orle","useful":0,"cool":0},"f6S8mf75ZPmMook4OWncTg":{"text":"The security guard DEMANDED to see our service dog's papers and ID papers. There is no suc","useful":1,"cool":0},"W88hwCEa5K8Bbrwg0sbPiA":{"text":"Food is pretty good for a bar! Live music is awesome! Great bands, great beer, super nice ","useful":0,"cool":0},"ECEe4BTnoxErDeruyZnpCA":{"text":"Great food and great music! I happened to walk in during lunch when a band is just finish ","useful":0,"cool":0},"UfPk3IiCsXh7PECzT5hxqg":{"text":"What do you do when you're strolling around NOLA in the late morning ... find a place that","useful":1,"cool":0},"bEsrH8uzIONduxFkvpuXMA":{"text":"Great location on Frenchmen Street to listen to live music, get a drink and grab a bite. W","useful":0,"cool":0},"6tCPow3EgjwX_gVadRq8sQ":{"text":"Not a great experience. The place looked pretty good and I saw coconut shrimp on the menu,","useful":6,"cool":1},"7GGH-58bQDw27svUpD3qFg":{"text":"We stopped in for drinks and music.  The band was awesome.  The $5 hurricanes hit the spot","useful":0,"cool":0},"ugXi6xZF9xfsy4k6S_hkgw":{"text":"This is the type of place I think of when I think New Orleans.\n\nAwesome crowd, amazing ban","useful":0,"cool":0},"ax83eEpG_cI1JarymEv2eg":{"text":"Stumbled upon the grand opening last night and a friendly bouncer welcomed us in. The spac","useful":3,"cool":2},"ZiFBbsjAeOmMVtIRqUsfRw":{"text":"Great ambiance, great music, friendly service.\n\nNot my first time here, and hopefully not ","useful":0,"cool":0},"nfRFE_4kYKgl5a6ZEUjTtg":{"text":"Pretty cool place, popped in to hear some music and relax and it was just the spot. The ba","useful":0,"cool":0},"gGCnAEvieSprlJsg-AseEA":{"text":"Excellent drinks; bartenders know their stuff, however food service was terrible. After an","useful":0,"cool":0},"5zY9gR8g8YihhgDfXlsAiA":{"text":"Sweet potato fries and Bloody Mary's for jazz on Sunday afternoon?  Must be Bamboula's on ","useful":0,"cool":0},"pKIdoyC1z_4aeazlWx2h-A":{"text":"The good: the live music (everyday) was great as was the people watching. Who can get enou","useful":0,"cool":0},"4pm8Fn5-Ij-1-c3iw1flNA":{"text":"A great atmosphere but the food is subpar. Catfish poboy is good but the burger I ordered ","useful":0,"cool":0},"tpCfEiJTwrbbJrCOf7-tag":{"text":"Music is GREAT. But do not even try to get a drink in the front bar.  The bar tender saw m","useful":1,"cool":0},"cbHwD3MFsBkmY-B2IrbuNA":{"text":"It's a barish restaurant with cafe-like tables and chairs so it's not elbow-to-elbow room ","useful":0,"cool":0},"6OeTY3UOaywUb3P-T0AaKw":{"text":"Good music, but the service is probably the worst I have ever had. Took forever for anyone","useful":0,"cool":0},"ldTvvuCLQvQcIE4_aF_2Gw":{"text":"Fantastic new music venue on Frenchmen St. \n\nCame in on opening night and the staff was fr","useful":5,"cool":1},"jPFV_3Y5pG4MtpWheyuBhw":{"text":"Nice security guy at the door, great music.  After 20 minutes sitting at a table waiting f","useful":0,"cool":0},"Tsn7reZiRS3lagatFiUIGA":{"text":"Comparing this place to the others I popped in on, it was pretty cool. Needed a little som","useful":0,"cool":0},"97mjWifBERQ3A_24MYqggw":{"text":"Excellent crab cakes, jazz and blues! You can't go wrong. Rachel, our bartender, was frien","useful":0,"cool":0},"S5CRh03GS1itSptOh_VRHw":{"text":"Don't order food here unless you have a few hours to kill. The service is entirely too slo","useful":0,"cool":0},"vzVDDsI4gNuazXzw26mzag":{"text":"Pretty decor and great music...but, they need a new bar manager. After only two nights bei","useful":1,"cool":0},"SpKqHQ_16ljh434ar2jvOQ":{"text":"Checked this place out at 11pm on a Wednesday night, had ID checked and asked to respect t","useful":1,"cool":0},"FcdJCy7AvHB31UMqLIc0EA":{"text":"Originally my bf and I wanted to check out the DBA because yelpers gave the place great re","useful":0,"cool":0},"bhd68bSUcZ9mtedPbDbSiw":{"text":"the real deal for authentic NOLA! excellent music, food is good, drinks keep comin' - high","useful":0,"cool":0},"uTsldR327E3qYKkOK0AKag":{"text":"Don't want to judge based on a Saturday afternoon. Just okay blues. Bartender insisted a f","useful":0,"cool":0},"gqcEtzuAjCpcS81tLm99hg":{"text":"Go early and stake out a table. The food is great, and the bands will make you want to dan","useful":0,"cool":1},"StN2LJTOE_5X7fvZ3Gbvrw":{"text":"Decided to stop here for a quick bite to eat while exploring Frenchmen St. Live music was ","useful":0,"cool":0},"coVyeZcPN2jkJ2e8av5Xnw":{"text":"The place was ok, nothin special. The server was friendly and I did like the band and fema","useful":4,"cool":4},"bNubfvktfDqCvFdJltceyQ":{"text":"We loved this bar for the live music, ambiance and beer selection. We saw swing 17 play he","useful":0,"cool":0},"z2l9sGfUo7R0bC5jyj95Wg":{"text":"I came here Wednesday night it is a nice chill spot. I didn't eat here but the live music ","useful":0,"cool":0},"Mnrb50eXVFAsiI9GFDDYXQ":{"text":"Come for the jazz, but don't stay for the terrible service. It took over 45 minutes to be ","useful":0,"cool":0},"7icx37KXGpzY3yB_iDzRDw":{"text":"Sweet copper bar and ceiling. Very large place but open and comfortable. The live music wa","useful":1,"cool":0},"jD7VLvnFfw9T6hGR866V7g":{"text":"I walked in and sat towards the back near the kitchen.  4 employees in the back cooking.  ","useful":1,"cool":0},"Gf0bc8GH_2OmNTI6_q9mfA":{"text":"After reading some of the reviews here we decided to make Bamboulas our first stop on Fren","useful":1,"cool":0},"y2sQ3UGCVvJk_whL4Paalg":{"text":"Great place for music and drinks. We didn't order food but we sat near the kitchen and not","useful":0,"cool":0},"zW9EEUIX38rFev3rXVzh2Q":{"text":"Favorite bar on Frenchman Street for music. Great drinks and amazing live music! Love it!","useful":0,"cool":0},"Q4tDthl0lDEBnmC67dEWvA":{"text":"Go for the food!  While listening to their nice band and drinking their nice beer, I got t","useful":0,"cool":0},"1q3dLswkwaQBoIIih7goEA":{"text":"One of the first things I heard when I told friends that I was going to New Orleans was, \"","useful":1,"cool":1},"i_WMfsc8i-1ndUiMb952Ig":{"text":"Stopped in for a quick drink and to listen to a few songs from the band.  They had ample s","useful":0,"cool":0},"G6O71VhEhCy2AhgL8QxjRQ":{"text":"Stopped here for lunch today and was not disappointed! The crab cakes and fried green toma","useful":0,"cool":0},"V-gg2vxLgK97JV2XRgq4pQ":{"text":"Heard this was the real Nola. Not disappointed. The drinks and live music were awesome. Li","useful":0,"cool":0},"o7D5aqXjMUwkvWJKiO9OUA":{"text":"+ Great music (Kala Bazaar Swing Society and this Amy Winehouse tap-dancing look alike)\n+ ","useful":2,"cool":2},"jLVV7xxkpeDLxgDSVBqz2g":{"text":"Adorable spot!  Great music and friendly bartenders.  Off the main path so it feels a litt","useful":0,"cool":0},"_IZjYVOUNWRsYSiVTxOPOQ":{"text":"Came here while wandering around Marigny with some friends. The bar staff were friendly an","useful":0,"cool":0},"E3exBoyVAmUq_im2uBNMdw":{"text":"Excellent time had at this off-broadway location. Ziadaco was great to dance to, while the","useful":0,"cool":0},"HhnstUeNZR7DA2No6ncXdg":{"text":"Great live music!! Great drinks, great crowd. Beautiful dive bar!! Ask the bartender to su","useful":0,"cool":0},"InBx_eIcajn50xP6j9p3GA":{"text":"Music is GREAT. But do not even try to get a drink in the front bar bitch waitress - stand","useful":2,"cool":1},"_i9jL8doUEqCsql7aym10w":{"text":"Nice spot on Frenchman to watch some live music. I love the older style Pressed tin ceilin","useful":0,"cool":0},"QiRbjyhFJWlIQd13pBAWfQ":{"text":"Stole my credit card and the owner tried to charge $250.00 on it.  Of course any place on ","useful":2,"cool":0},"-wyAqJ0uppg7IeP6txg9SQ":{"text":"Great venue if you want to be able to sit and listen to good music. There are tables in th","useful":0,"cool":0},"ip856egNx8ZDCu7KCXjLDA":{"text":"We always end up here for food and to pregame. The food is pretty good and the staff are a","useful":0,"cool":0},"-ZZHjfylpiz3sjZRpx9cpw":{"text":"Stopped in here on our first night into town because the band was poppin. The door guy was","useful":0,"cool":0},"Ptg7roTXsqZClG5LOK_afg":{"text":"We dropped in for my boyfriend's birthday last night and had a good old time. The music dr","useful":0,"cool":0},"EvyNgFscODnItTM4IKy8bg":{"text":"Great place. Wonderful music - we stopped by a couple times both during the day on Sunday ","useful":0,"cool":0},"WhmYGha0mqnWYdU9JFXNPw":{"text":"We were lucky enough to find this place to spend a little time on a Wednesday afternoon.  ","useful":0,"cool":0},"O-EtikKY822nh4ib0gMm8w":{"text":"When you don't want the dirty gritty feeling of Bourbon Street there is always Frechman St","useful":0,"cool":0},"AM1GM1oSm_xHntvGZpyOag":{"text":"Amazing food & music. Awful service. I think the wait staff is working hard but there's cl","useful":0,"cool":0},"4HaMkeejcGejYqkDyNAU4Q":{"text":"What a great time! I can't give it 5 stars because we didn't try any food.  Servers and ba","useful":2,"cool":1},"C1tDcsdaHGi2pV4D7njxrQ":{"text":"There was a wonderful band playing here when we arrived. The combination of jazz, blues an","useful":0,"cool":0},"IizL1T500-rsa1h5_dKzcg":{"text":"we stopped in for a madras during fqf.  the drink tasted okay.  we left after one song and","useful":0,"cool":0},"0sr2jQfD4x8NmUewWxKoJg":{"text":"The waitress informed us of everything she would recommend on the menu and she even gave u","useful":0,"cool":0},"A_paJ3kj46yoXs-Z8mc79g":{"text":"Wonderful place. We came here quite a bit. Great atmosphere, wonderful service, friendly b","useful":0,"cool":0},"BX25JrLJa8UvL6RXftQvuw":{"text":"Checked out this place our first night in New Orleans and it was great introduction to the","useful":0,"cool":0},"_RcYkjnmQYA04IaA-ORGNg":{"text":"This place is so stingy. It's 7pm and empty but there are so many rules. 1 drink minimum p","useful":0,"cool":0},"pOgTXvHthkRpvR7iajhYRw":{"text":"Music is great but service needs much improvement. Stopped there twice for the music and b","useful":0,"cool":0},"RBprAkztsCUNpP8vKx7AIg":{"text":"Great spot if you like Cockroaches.. this is probably the WORST establishment I have ever ","useful":1,"cool":0},"ad3Pfkc4WmB00vc_--IgIw":{"text":"A neat spot--nice atmosphere. An excellent jazz trio was playing when we were there. Oddly","useful":0,"cool":0},"xml8_VI-kUyhFvCojfEXpg":{"text":"So if you want a New Orleans experience then this is the place to be. Far from Bourbon Str","useful":0,"cool":1},"eRQ1pPrLiFgyJEASnn0Wxg":{"text":"Good food, good music,\ngood prices.  Walked around New Orleans and found this place on Fre","useful":0,"cool":0},"UZQV_ttbu3N6IKdIq2nNPQ":{"text":"Came to eat and watch some jazz. The ja WAS AMAZING. Food was great. We had the bacon ched","useful":0,"cool":0},"S5ksncE0Qbx9T7l8cE-1SA":{"text":"Fun live music earlier in the day so I don't have to wait until after dinner to finally ge","useful":0,"cool":0},"5aZ9h4Ynk4BNtff4SyMj1w":{"text":"Overall this place had a lot of character and was an okay stop for my group on Frenchman S","useful":0,"cool":0},"tlCO8NOMkqKy-0zmoz-fBg":{"text":"Good food, fairly quick service.  Wait staff so-so. Prices so-so.   Good music while you e","useful":0,"cool":0},"JXG7Vzjzh1yNzSX3Us54Ew":{"text":"Good music,  nice atmosphere,  but only traditional bar food, not NOLA cuisine.   I had th","useful":0,"cool":0},"lKS3Uwtgiwvgo4cOEKSJcw":{"text":"Busy Saturday night, but one of the only places along Frenchman not charging cover to see ","useful":0,"cool":0},"sEzsc7-UKOG0lcb7m_pabQ":{"text":"What a great find!  Stopped in on our first tour of Frenchman Street, enjoyed some recomme","useful":0,"cool":0},"ihp4IFaq7KuVDcdo1133uw":{"text":"We went here last night we didn't go to the bar part but we went to the murder mystery din","useful":0,"cool":0},"NF-pGjDFJjJwBfhJrBAKSw":{"text":"We were taking it easy on Frenchman Street on a Sunday evening and after a few laps around","useful":0,"cool":1},"EhGJESoV0drhVdz4y8gNTA":{"text":"Tourist trap. Waited 20 minutes for my order of chips and dip and then asked what was up, ","useful":2,"cool":0},"NBoQ3_N9Qq82g10oFCUYYw":{"text":"Nice blues music with cheap drinks and decent food. 1 drink minimum for the band which was","useful":0,"cool":0},"PVZQPeDoyexVVLMCZ7O-MA":{"text":"NOTE: My original review was removed because certain people felt the need to whine to Yelp","useful":5,"cool":3},"deyesWIJX67vkRweLXkpaw":{"text":"We stopped here on our first night on the Frenchmen street. We heard a great blues band pl","useful":1,"cool":0},"s_M1SHXq8UuTvoal7_mh1g":{"text":"Stopped in for a quick drink and to use the bathroom on the way back to our B&B.\nNot only ","useful":3,"cool":0},"-LfMbm3tKlx1dQmaFp3spg":{"text":"We love this place we went to New Orleans for 5 days and were here everyday. Great music, ","useful":0,"cool":0},"WvVFm800n9rK8-UhKzDEJA":{"text":"The sound of the clarinet called me to this place! I got to the door, and the band sounded","useful":0,"cool":0},"fUxQaXWpmRZs9FS3y3ViOQ":{"text":"Fun atmosphere to Bamboula's with fun music. We were honestly expecting average-below aver","useful":0,"cool":0},"Z6vGXrQ2f-JdSZXBELhKUQ":{"text":"Awesome band brought us in.  Reasonable prices for drinks and a fun atmosphere made it a p","useful":0,"cool":0},"euZxntQfxPDSvyiHM1gZfQ":{"text":"We never got our food!  We were a party of four and got seated right away on April 11, a T","useful":0,"cool":0},"U9bTUAmN_D1sZgNJ53fdFw":{"text":"Nachos were overdone and could have used more meat and sour cream. They stuck to the paper","useful":0,"cool":0},"kWVjP1q1vXY4hx9nMrxIKw":{"text":"Lauren was an amazing waitress and Smoky Greenwell and his band were incredibly entertaini","useful":0,"cool":0},"qsqEXGGMnmJQLnhqwwntRg":{"text":"This place is great. Right across from the Frenchmen hotel, we stopped in for some appetiz","useful":1,"cool":1},"fkH6mrq7oybEYA_JwRZwgg":{"text":"Good food ! Good music ! Amazing service! We went in for lunch and enjoyed the band , serv","useful":0,"cool":0},"IvaYRR5kEkLlPvxpFENMmQ":{"text":"I stopped at Bamboulas for dinner and a beer on my last day in NOLA. I'm writing this as a","useful":0,"cool":0},"9NAgeS0oHvMOqNzPEAVZPg":{"text":"After being letdown by the Spotted Cat and Cafe Negril, we wandered in here after hearing ","useful":0,"cool":0},"NExYPyjcuKDv55JtMZqS3w":{"text":"We loved our visits to Bamboula's to listen and dance to fabulous music in the evenings. M","useful":0,"cool":0},"Q6cyXPQaTB5bzYUGUSaiwQ":{"text":"I just dropped in for a cold drink on a hot day. I did not expect live music. This introdu","useful":0,"cool":0},"dg16ryO_yjRLpG-JVoh1oQ":{"text":"First stop in this year's visit to FQ. Loved the band! Very Louie Armstrong,-esque! We ord","useful":1,"cool":0},"zlyZyWoEJ90yyuvMll9Nxg":{"text":"We weren't greeted by anyone, so we took a table (after a patron approached and sat themse","useful":0,"cool":0},"lVG7VBrjQU-GqgrzZqDbpQ":{"text":"A darn good $5 hurricane for happy hour! They had a pretty good band playing as well. It h","useful":0,"cool":0},"uKMiKrchDsKAd8Lnm79yAQ":{"text":"Disappointing. Ambivalent service, aircon was too cold and food and drinks very average fo","useful":0,"cool":0},"xjz9NLTG6FxrLKoX47cZbg":{"text":"Today there is an amazing band called Emily Estrella Jazz. They are jamming - Emily's voic","useful":0,"cool":0},"kmB9S4xj75jk4jN0FEXI0A":{"text":"Love this place.  Just got back from NOLA to So-cal.   Love this place and miss it already","useful":0,"cool":0},"nMY0UNSMgZ9lpBlMPLRqUw":{"text":"Great food and fun environment. Very clean! If you like Jazz, this is the place to go!","useful":0,"cool":0},"vZ0_Xe8uD6h0xNa6emeTSA":{"text":"Heard some fine jazz while we were passing by by this small place on Frenchman on Saturday","useful":0,"cool":0},"ge6Urw33zAvQ_1a-hSfH5g":{"text":"Great little bar/restaurant on Frenchmen Street that offers table service and live music! ","useful":0,"cool":0},"bK5UD0P8ReVDiV1te9sfVw":{"text":"We kind of happened upon this place while walking down Frenchmen street and WOW! The music","useful":0,"cool":0},"C2mLvB8nkPYIoUAkDwCszg":{"text":"FABULOUS service - waitress was smiley and went above and beyond to make us happy. Nice ho","useful":0,"cool":0},"GxtEdyCBLhTWi23IxonNIw":{"text":"Although the music was quite good, the service was utterly atrocious. I held up my phone t","useful":1,"cool":1},"YPj-E_F0EJ_t9k4p0_mCXg":{"text":"From the time one walks in you feel the family vibe its clean and inviting and a place tha","useful":0,"cool":0},"gswAIkMWxV-8kkAUJImKTQ":{"text":"What drew us in was the atmosphere.  Really cool interior.  Great place to listen to music","useful":0,"cool":0},"_xBDZrqkHkT_2OLqLemFhQ":{"text":"In a month or two, I feel like this will be a 4-star place. The things they need to work o","useful":3,"cool":0},"Uf3C2NuB56_OZ9fvaYOoSQ":{"text":"Great music, service attentive, decent draft beer selection! We came in because the Friday","useful":0,"cool":0},"ZVOFyjy7v0aE-2HZzt2X1Q":{"text":"Love the new spot on Frenchmen. The renovation is really a charming combination of old and","useful":2,"cool":1},"gSlIQavA_0x8uunlJxEmnA":{"text":"Great local bands on Friday nights! We enjoyed a burger and a beer, fairly priced. The BAM","useful":0,"cool":0},"itMLgw4Ee0Hhwvjk3rKOTg":{"text":"Great jazz on a cold winter Sugar Bowl afternoon. Scruffy fun none-too pretentious crowd. ","useful":0,"cool":0},"tlvdW147yqJRHef7fucxvA":{"text":"Just having drinks and listening to awesome, authentic jazz!! Gotta Love Life!! The vibe i","useful":1,"cool":1},"IqAXugSab3fe1X7zDyiqIQ":{"text":"Great music and friendly bar but inept management and bad food. \n\nCome here music and dece","useful":0,"cool":0},"_PFjldZQyEwooDr6UeRCjg":{"text":"I wanted to give 2 stars...but I can't due to the non existent alcohol pour by the bartend","useful":0,"cool":0},"Kq3EXRm3hDIy70I6tU3bkQ":{"text":"We popped in here for a couple bands on a Sunday afternoon. A definite must if you want to","useful":0,"cool":0},"TcHPiFIckoq1P7e71xHY6w":{"text":"Gyspie Elise is just one of the best life voice I heard. She is fantastic. \nToo bad she si","useful":0,"cool":0},"4RDz702M3pg516THn6HelQ":{"text":"The venue is great, and usually the music is great. However, lately, the management has be","useful":0,"cool":0},"V_hT7SzlpQjkB7Q3hwmxgg":{"text":"Great music, but walked out because of disgusting staff. Licking his fingers and container","useful":1,"cool":0},"5wgfdynjmqheOa9z4i5Xng":{"text":"Music was great. Food and drinks were not bad either. Everything was going well until the ","useful":2,"cool":0},"9hSUMS39DjCCmLTJc9C2pw":{"text":"Only place to be on Frenchmen for live music and no cover all day.\nGreat place to day drin","useful":0,"cool":0},"EmoEdJky1-2cZbhwmHpnWA":{"text":"I will say that the main reason I am giving this place four stars is the live music. We ca","useful":1,"cool":1},"WpqA1_k-dqe6Ws4gJdZVqg":{"text":"There's a bunch of live music going on up and down Frenchmen street, but we decided to sta","useful":1,"cool":1},"29FgRU1WgxpB2hV5PEKhww":{"text":"We read music is great on  Friday, band was great but except for singer they were all yawn","useful":0,"cool":0},"uIOdOmNOd8yXp_s2lp5BlA":{"text":"First time having a shrimp po-boy.  Along with the live music...I finally felt the vibe of","useful":0,"cool":0},"kjW9D1IQy8YS69Pr7_V1Rw":{"text":"Love the vibe, Love the music... the food was horrible (even for bar food) and the service","useful":2,"cool":0},"wT4POdlUIKLdJKT_p8UZ0w":{"text":"Music is great. Atmosphere is cool. Food and service is the reason for the lack of stars. ","useful":1,"cool":0},"G_SZKUK0Sc0qu5LOq0xjhw":{"text":"Came in to meet some friends. I was starving! Ordered a catfish poboy. It was delicious! M","useful":0,"cool":0},"BQShAy_Xmv5encCO5szHdQ":{"text":"The band was great. A couple is hired to dance. Don't worry about any signage about drink ","useful":1,"cool":0},"-4o_AcVxYNnfrHUMVbcV5w":{"text":"Good music but the place had the acoustics of a barn and extremely loud patrons trying to ","useful":0,"cool":0},"uBfwW7LhzR-vnXjyzSKEoA":{"text":"Shrimp Po boys are horrible, is just fried shrimp on bread, no sauce, no veggies no second","useful":0,"cool":0},"RAKWdu335IvsIk7FGxiC4w":{"text":"We were there Mardi Gras weekend. The music was fantastic. We just wanted to listen to som","useful":0,"cool":0},"owC590pWw0-W3v0E6LZ93Q":{"text":"never been to this place, but the new manager, Jim (old guy with a gray ponytail), got cau","useful":0,"cool":0},"vtIg1fCQg2qTdZ1RNWaouA":{"text":"Would highly highly recommend this place. Would give 10 out of 5 stars if I could. Most en","useful":0,"cool":0},"rN3ElQraSnZQY_Q2StnZ2A":{"text":"Bamboula's is a very clean, air-conditioned place on Frenchman St in the heart of the jazz","useful":0,"cool":0},"IYpbJ8Yfo7d6wOzz-CREoA":{"text":"Great live music. Great service. Great fried food. Pretty Ok drinks.they were accommodatin","useful":0,"cool":0},"7zMyAuyF3G63Z5iohDWMmg":{"text":"Music was exceptional and the beer and fried pickles were the perfect accompaniment.\n\nFree","useful":0,"cool":0},"XKmDfSCfUlHgGT54xVhGSA":{"text":"This was a great find on our first afternoon. Good recommendations by the server. Shrimp B","useful":0,"cool":0},"Cyohcx0Zh57lCc2TXWxK3Q":{"text":"Sure, it's an alright place with a good stage and a good space, decent bar, and a full boo","useful":0,"cool":0},"vghzEkgpIL0pH9656JKoMw":{"text":"Drinks were weak, seating options were horrible (dunno why they had entire sections roped ","useful":0,"cool":0},"UcIjYn3zEIKHvwqWa0B_pw":{"text":"4 stars for music, 2 for the food. Nachos were obviously microwaved and took forever even ","useful":0,"cool":0},"oCyBOSYrSebc1FiCkBe4Iw":{"text":"Better than I was expecting.  We were in Marigny for a Culinary Bike tour and decided to s","useful":2,"cool":0},"ataL-JU6qrT-3fiMI8fOkw":{"text":"Saw Mem Shannon's Blues Band on a Wednesday night, nice to have seating while listening to","useful":0,"cool":0},"fRHWqnatBjO3AuysGQLoCQ":{"text":"This is a place that's kind of cool, nice brick interior decor, and top level entertainmen","useful":0,"cool":0},"KQ4wF2xgAhE4blS-AVBkbQ":{"text":"Nice oldies rock/blues quartet when we were there. Great pulled pork. Not sure the Hurrica","useful":0,"cool":0},"kZcVOn19MEOugbtoqwkjmw":{"text":"Ended up here looking for a lunch place on Frenchmen Street. There was a great live band p","useful":0,"cool":0},"RpaPRlXSqHKCB2XCll7OUA":{"text":"What a joke. Walked by, sounded great. Band was jammin'. Needed a bite and a drink to chil","useful":0,"cool":0},"oxGIdxydIL8qAlJNJZxCbA":{"text":"The server Morgan was fabulous and knowledgeable and the chef Twin made the most amazing c","useful":0,"cool":0},"IbeeTHvIf6qb4x54aNxSrw":{"text":"Went there on Monday night, sat with two friends at a table by the door, the bartender bro","useful":0,"cool":0},"rlENNIPBbICcfHewUIw2Hg":{"text":"Really liked this place.  First of all, live band on Friday afternoon!  Good band too, ver","useful":0,"cool":0},"3UOx5JuuEy4zlgdJV2-GNw":{"text":"Here for business. They messed up our order. Took forever. And don't split bills when we h","useful":1,"cool":0},"AMmgbB-kugTx00wkmxlrfw":{"text":"That's the spot for live music, spacious place and excellent music happening every night\n\n","useful":0,"cool":0},"WvIEirw3iw7sMcE913VgHg":{"text":"Band was incredible.   Truly phenomenal.  Only reason this place gets any stars.  Otherwis","useful":0,"cool":0},"yFZWU_VFk44_5rupYwIpzQ":{"text":"COCKROACHES.. Terrible service, rude waitresses. 30 minutes at a table with no wait staff.","useful":1,"cool":0},"ClvISlJEHp-pr_4IQCbZVQ":{"text":"Still one of the best Music clubs in New Orleans. This was our 3rd visit to Bamboula's, an","useful":0,"cool":0},"YQgZeRB3wSXfmiIPRTH3PQ":{"text":"We really enjoy this place. They have a very nice attractive facility here. The venue is w","useful":1,"cool":1},"Sb79iwepwPrH6ysAHjncfQ":{"text":"This was our first stop in this magical town! We arrived early afternoon, and we had such ","useful":0,"cool":1},"b5cg3DQ-OW5NSgEn1UlwEA":{"text":"Bartender was a total asshole. Avoid this place, it was nearly empty and the idiot couldn'","useful":4,"cool":0},"X7sB5IKp-3d4hDzDq4RprA":{"text":"This place was a highlight of my family's New Orleans trip. I had been a little disappoint","useful":0,"cool":0},"0RqxT4B2YydTVrtQG-gnUw":{"text":"I had a great time here. The drinks were reasonable and the entertainment was great. Magno","useful":0,"cool":1},"F_hIj8_w4CLeFqKz5izLTg":{"text":"Awesome music.  Great food and service.  I walked down frenchman street.  Its one of the b","useful":0,"cool":0},"iYO5C_hTCkxzfHddyzdcrg":{"text":"Live bands.  Friendly service\n\nIt would be nice if they had more of a variety of IPAs \n\nDi","useful":0,"cool":0},"NZfmpe1jHtR_eYJx_ndAYQ":{"text":"Good music. HORRIBLE Service! Mostly from the bartender. Was so incredible rude to her wai","useful":1,"cool":0},"QvBX2OG1Sc8LriX9-XDQDw":{"text":"Sweet potato fries and Bloody Mary's for jazz on Sunday afternoon?  Must be Bamboula's on ","useful":0,"cool":0},"TGiQDBL8zCYfFjcRmqqX2w":{"text":"Food is edible menu and service is less than desirable disposition of employees is substan","useful":3,"cool":0},"3J-JOvIKUq4FYxjNVPiP6g":{"text":"No cover jazz Saturday night. Food was good our waiter Josh was attentive and adorable. En","useful":0,"cool":0},"u2OpwlspDrFYZ8b3dbO1YQ":{"text":"If you're going to go here, go for the music... which is great.  Unfortunately, service is","useful":1,"cool":0},"Y0mRStAu4NXTOR9UOPwccQ":{"text":"Great music, bartenders were awesome. Friendly staff all aground. Had the fried shrimp Pob","useful":0,"cool":0},"BSjODl-IrUvLLAI0_sEfWw":{"text":"This joint is good if you need a reprieve from some of the wildness of Frenchmen street. T","useful":0,"cool":0},"bP65rr6imEPYfOp4nH0YEw":{"text":"I had never gotten food poisoning before I ate dinner at Bamboula's this past Saturday. My","useful":0,"cool":0},"verI1Mc0iHCaebxLiIWVog":{"text":"Good place to go if you want to hear a live band, nowhere in the place where you wouldn't ","useful":0,"cool":0},"O574XECE9Kpfo4b6uo249g":{"text":"From the time one walks in you feel the family vibe its clean and inviting and a place tha","useful":0,"cool":0},"q0_nCxwtcAf0JlhZLmmJVA":{"text":"Stopped in for lunch and had an overall pleasurable experience. Our food--nachos, pulled p","useful":0,"cool":0},"qWuW1P8iS5QhC3kKUOzQhA":{"text":"We've gone twice, once for food and once for drunk and music. Staff were VERY friendly and","useful":0,"cool":0},"jJifQNlde_6-VL6C7a-HfQ":{"text":"Shame because I really wanted to like this place. I'd give it ZERO stars if I could. One o","useful":1,"cool":0},"otFL1-1kSbtfmZznEZ8PxA":{"text":"Great spot!  Music is on tonite!  Great staff here and friendly people. Bar makes good old","useful":0,"cool":0},"gw447wW_xAn4XUT0UeIRWg":{"text":"I really really love this place! The only thing that held me back from 5/5 was waiting qui","useful":0,"cool":0},"sipNCyzFaq3bFRyYW6ERqg":{"text":"Unbelievable....\nSix of us ordered a dozen appetizers and multiple beers. We paid, and enj","useful":4,"cool":0},"bR_89rysD5f1OOF9DxVTJA":{"text":"Please do not come here. The manager was unreasonable and inappropriateLy staffed the rest","useful":0,"cool":0},"8HmZYfMRt3F6dL_2Bvnlaw":{"text":"My wife and I are native New Orleaneans and visited simply to hang out around the Quarter ","useful":0,"cool":0},"BXx93j0fqKeN4wYs02ELNQ":{"text":"Do yourself a favor and get on over to Frenchman Street so you can get a feel for the real","useful":1,"cool":1},"70g5wTdY92bDWaqJ9LnvHg":{"text":"This place is off of Frenchman's street, the lest touristy area of NOLA and this place had","useful":0,"cool":0},"e1VZJhyP6bwyLHVvR6ZzbQ":{"text":"Very fun music bar; my only complaint is about their inability to make a very basic cockta","useful":0,"cool":0},"m_uf6Nq4vjES3AdtMiiaYg":{"text":"Best music on Frenchman Street!  I am so glad I went there. I had dinner the first night a","useful":0,"cool":0},"tnoHasjquJdkMPTW9df5sg":{"text":"Spent a lazy a Monday afternoon in this awesome live music bar. Bloody Mary was delicious,","useful":0,"cool":0},"Vq5UV_Q9Lm3t_GFsEFZFhA":{"text":"Great music by Royal Street Winding Boys. Cocktails to smooth the evening. Best waitstaff ","useful":0,"cool":0},"PB5OUv70E1gLrrO9fTNX1Q":{"text":"0 stars.  We came in a group of 5, which is great business, until the female bartender inf","useful":3,"cool":0},"HntCHT_aum1bFKpzx-7uiQ":{"text":"DON'T EAT HERE!!! THERE'S COCKROACHES IN THEIR FOOD!!!! \n\nCame here to listen to live musi","useful":4,"cool":0},"lNct3e_uuRK2im3kahkogA":{"text":"The worst customer service I have experienced in New Orleans! :( My aunt and I wanted to c","useful":5,"cool":1},"S162RM5JA08hezsBdmufYw":{"text":"Loved the interior of this place.  Loved the band.  The drinks were solid.  The food was a","useful":0,"cool":0},"_oUq6Rh5P94K07g3B82uyw":{"text":"I love this place. This was my second visit. The music is absolutely great. It is a minimu","useful":1,"cool":0},"tlC9DCNkyN-3QVqJEthXzw":{"text":"This is another case where I wish Yelp would let you rate individual aspects \n\nFood: 1/5 \n","useful":0,"cool":0},"P8rQTozMTMmF75szDCZbNw":{"text":"Only star was for the band.  Was there for two hours, and not once did any of the wait sta","useful":0,"cool":0},"chplUam2qwAfRFxlusvq1g":{"text":"Awesome little bar in New Orleans. They frequently have live jazz music, a large dance flo","useful":1,"cool":0},"uxy7D8iZuvy_dNYKVzehRQ":{"text":"I wish I could review the actual experience at Bamboula's but unfortunately my friends and","useful":4,"cool":0},"-UEby2-UeAcwL217tT136A":{"text":"We arrived on a Monday night at around 9pm and the place was a little busy but what called","useful":0,"cool":0},"ctLaJGANGlmDK91rAFkVJw":{"text":"Great place to stop in and listen to some good music and dance if you have a spring in you","useful":0,"cool":0},"qHg9dwHfKTHw7reOmfp5YA":{"text":"One of the top 3 restaurants on Frenchman. Live music, good price. Try the Fried Green Tom","useful":1,"cool":0},"2E1elil9kIhXUc388drdWg":{"text":"WARNING\nOne star IF THAT! HORRIBLE HORRIBLE HORRIBLE \nGo there only if you want your credi","useful":0,"cool":0},"98YsoohQ0GxqVt0ka5q-8A":{"text":"Do you want 3 for 1 beers, do you want loud obnoxious drunk  people spilling beer on you? ","useful":1,"cool":1},"5DQUg-Da8DIlYb4BZe8pPQ":{"text":"The food is amazing good. We recommend the spicy chicken wings, cooked to perfection. The ","useful":1,"cool":0},"KGsilJLAsblUHIvbLL923A":{"text":"City of trees brass band drew me in. They were amazing. Their music hit the chord within m","useful":0,"cool":0},"aRluVdNVgdtTJtg2fvP5xA":{"text":"Waited 17.6 hours for some chicken tenders and fries. Never got them. Bartender was cool t","useful":0,"cool":0},"eSBQIHZr8Wder8riR39sIA":{"text":"On a rainy Friday, we really enjoyed spending ~4 hours sipping some affordable sparkling w","useful":0,"cool":0},"1kOGdFWvxRkJJBAOhVlzaA":{"text":"I would give no stars if it were possible. I'm a server myself, obviously extremely sympat","useful":5,"cool":0},"0cQ5a1qcZjVuakBujXCYAg":{"text":"What a great place. Great vibe. No cover charge. The band really made the night. They walk","useful":0,"cool":0},"nZcKEzP7NzhWrXpGZnBIkQ":{"text":"Good music and great bar food.  We had ribs, fried pickles, sweet potato fries, shrimp ske","useful":1,"cool":0},"G4YrOEsnS9pNoIcN4de07g":{"text":"Great place to sit with some music. \nWait staff was rude, and \"had to check\" on the prices","useful":0,"cool":0},"pROZ47iHJVMShxqG5FmUJw":{"text":"Wish I could comment on the food or drinks but we sat here for 30 minutes and were ignored","useful":0,"cool":0},"hNuLo63UFItK55J-0IgRXQ":{"text":"Music here was great just as it is all over New Orleans. Went on a Monday night and French","useful":0,"cool":0},"_dx-PfoeeatHcHWofHEUmg":{"text":"Great live music on a Friday night.  \n\nThe waitress was friendly and honest about the bar ","useful":0,"cool":0},"u8d7OP9rIL4bAV-QesEtkg":{"text":"Bamboula's was our favorite nightly spot while in NOLA. Kept trying to find a new place ea","useful":1,"cool":1},"0d6slHiJnRebyarXJMxwqg":{"text":"After passing along a street filled with what seemed like young people on drugs or maybe h","useful":0,"cool":0},"vD3fTkzRQwhkAs2EcLLDUg":{"text":"Really cool bar with awesome live music on Frenchman street. The bar is really clean, with","useful":1,"cool":1},"hu3W6KWuj-RDIHd4aKeYWw":{"text":"Came here for lunch last week and had a good time. The food was okay - nothing to write ho","useful":0,"cool":0},"mM9sPVz1pBdvaSDf9S8U0g":{"text":"This place has a lot of potential. Great music on the night we went, plenty of seating. Ho","useful":2,"cool":0},"jz9IfbyiZT6xnHZjHOssaQ":{"text":"After walking up and down Frenchman, this place caught my ear. No cover, but one drunk min","useful":0,"cool":0},"YIR6d7-Ssv6ihbaGv_dlpg":{"text":"Took an order and charged our card just to take almost an hour waiting, and then we were t","useful":0,"cool":0},"VmLHoWr7ydYE1IOy1N8mmQ":{"text":"Popped in here on our way to the Spotted Cat ... the music was a huge draw. We sat at the ","useful":0,"cool":0},"2dSn-9oCZUYTAgiP_rSqtw":{"text":"The music brought me in. \nWalking down the street in New Orleans you see deals for bars co","useful":2,"cool":1},"zJxNYygozqOMhAl83bJpLA":{"text":"Band amazing. Drinks not so great. The old fashioned was too sweet and the dirty martini w","useful":0,"cool":0},"uCvxQyFc_RzB-RcUOEQYFA":{"text":"Music was great. Food fine. Waitress was the worst, seemed offended that she had to do her","useful":0,"cool":0},"pfqLOnPSOk4SusRGUgbvuQ":{"text":"Great live music but bad service. My friends and I walked in and got a table and were told","useful":3,"cool":0},"D6CVDzKyARvMEPIOu3oNkQ":{"text":"Super friendly staff, great music, and the crab cakes... You can share but they're so good","useful":0,"cool":0},"YjbLbej3YS2KXkQyj9uanQ":{"text":"Bamboula's - \n\nI love you! Let me count the ways!\nI totally dig your open space (with tons","useful":4,"cool":7},"r4jrOSe9S8-IQWuNzBYQiA":{"text":"I tried to have dinner with my wife here tonight, but a giant cockroach flew into her twic","useful":3,"cool":1},"Ah53ir1vib2U1PSArPrazw":{"text":"The door man was very rude and despite having proper ID refused to let me into the establi","useful":2,"cool":0},"JUbH76uemyZ38BBGMDyp_g":{"text":"What a great burger!  The door man told us to come on in for great food and music and we c","useful":0,"cool":0},"wrQo9o-9qvLTLLDcnXhgVQ":{"text":"Drinks were alright. But the music was amazing! Live music at the birthplace of jazz? Hey,","useful":0,"cool":0},"N95lGbZa35Owudl2RiFpyg":{"text":"Service was not good. Food is not reflective of New Orleans. I can get fish and shrimp at ","useful":0,"cool":0},"R1qj1A299cnm8dcmgNAzJA":{"text":"We ended up here after touring along Frenchman street. What drew us in was the live music.","useful":0,"cool":0},"7UQx1LEcG7d3gSIMjmWw-w":{"text":"Awful service. Came in for a drink and a bite to eat around 8 on a Monday night. The serve","useful":3,"cool":0},"er2H4dBbfbg-KUK3O3HL5Q":{"text":"Awesome off the beaten path place to listen to some jazz and grab a quick bite to eat. Bar","useful":0,"cool":0},"qtXTcO5bj80QfCWHkiy2aA":{"text":"So I sat down, I waited 35 minutes for someone to approach the table with a menu, while I ","useful":2,"cool":1},"C5v5EidrWUxVD0rjsjI6aQ":{"text":"Walked in and sat at table.  Could not get a waitress to come over and take our order.  Ha","useful":0,"cool":0},"uaLmJppUW0u7k7sZQqbwag":{"text":"Great place to rest your feet, have some drinks and listen to some Great Live Bands.\nToday","useful":1,"cool":0},"B0gLduTem1FcXkjPzi-xNA":{"text":"Service was extremely slow for a Tuesday night, food was only mediocre and the waiter got ","useful":0,"cool":0},"enTz_WRC5mX7UAGicaRj7A":{"text":"The service was slow. Got the fried shrimp sandwich. Opted out of getting the up charge of","useful":0,"cool":0},"yExZSExoSFF5Rx1fcGeW8Q":{"text":"Rating on food is just mediocre. Jazz band was excellent. Prices were reasonable. But trul","useful":0,"cool":0},"JtBFxPhCt2a4TOR5Xj-8tA":{"text":"Friday night live music vibes- the bouncer checks you out front downstairs and then let's ","useful":2,"cool":3},"mOTfetwJzpHnyD13VqCTSg":{"text":"Absolute worst place I've ever been to.   Music was great but staff was very rude,  unprof","useful":2,"cool":0},"mZGmU9ivr79UYPGSFF8lng":{"text":"Owner is nuts!!!!!!!   Seriously    He told me to leave and called the cops.  \nHave you ev","useful":9,"cool":1},"6HP-MQSxf7zdHb3cQPd9Ow":{"text":"Great place. Fun. Awesome music. The hot sausage Po boy is amazing. Staff is friendly and ","useful":0,"cool":0},"IKnw9iptTwKHRcyUMPE9eA":{"text":"Coming to New Orleans we were really excited to hear live jazz music so when we checked in","useful":4,"cool":3},"lfQpSxbh9iYkh1V9ZYPq-A":{"text":"It is my last day in NOLA and I came here with my friend to drink and eventually order foo","useful":5,"cool":1},"Y5ZLRJk852UzvKoLW5ULeg":{"text":"Excellent music, even on a Monday night. There's a little area for dancing if you feel the","useful":0,"cool":0},"TUOxRLF9T9UJA4Jtaa0RoQ":{"text":"Live music was great (the incredible Carl LeBlanc) but the food is average, at best. The s","useful":0,"cool":0},"MYZ9g4UZ3I7DfhDPGNlijw":{"text":"The worst customer service I have ever gotten in my life! We were strolling around Frenchm","useful":4,"cool":0},"Zd3XUxOU_nspxKl94keR6Q":{"text":"Music was excellent and we found the group to be very engaging. This however was over shad","useful":0,"cool":0},"AIytC7bFXgSbsXemQZP3HA":{"text":"Loved the music but count your change if Cody is at the bar. Gave him $20 and got change f","useful":0,"cool":0},"LhJhe-Vx96Bnd0fIqUrMTA":{"text":"Worst bouncer and bartenders ever. Told me and my friends to leave seats so people they kn","useful":1,"cool":0},"8sEdh0Mgv2Tx-KHEX2XkcA":{"text":"Music is great so for a Tuesday. No food late night eat 1st.. drinks are on point, I will ","useful":0,"cool":0},"_WxT7m1potDJsG1OMppYEQ":{"text":"This was, to me, the best place on Frenchmen St. \nI had what was probably the best Bloody ","useful":1,"cool":3},"KwKLwocDkHYmbwF9c8tyKQ":{"text":"Great music and great happy hour prices, glad we found this place! Definitely worth stoppi","useful":0,"cool":0},"EbXpfz2BHxtyqLb_EN8qgw":{"text":"Absolutely unbelievable band. Carl leBanc and his drummer and bassist. Great bartenders an","useful":1,"cool":1},"KVhwnPR0OuiCEsBwud8KCw":{"text":"Wandered in here after a show at d.b.a, excited for the Blues music playing. Very very dis","useful":0,"cool":0},"4PUeYtbK_dmyWf5If2VX-g":{"text":"Great bar service and the music was outstanding!\nCozy vibe with great views of the stage","useful":0,"cool":1},"ao4uEFmhIWz0Fcf1HA8D2g":{"text":"The food was great (seafood BLT) and the atmosphere was fun especially during a random Wed","useful":0,"cool":0},"mLwvUQjNWtVHetWRhCE_HA":{"text":"Had a super strange experience here. Got here at 3 pm on a Thursday and walked right in wi","useful":0,"cool":0},"zZBSYixBG0NZVe-sTAX0nA":{"text":"This was the last place we stopped in before catching our flight. The band was so good. I'","useful":0,"cool":0},"NYyL2aL1qSl2lS9HRt9aTw":{"text":"We had a great time listening to Bill Bua and his band--excellent music, great food, great","useful":0,"cool":1},"JpvmiIJkDjoPDgx9sstUHg":{"text":"Great spot off Frenchman for some live music. We were there on a Saturday night and it was","useful":1,"cool":1},"CkoRnAhZLPPn6VjNLsrcbw":{"text":"Good music and great service from DJ. Came back twice in the same day cause there was a di","useful":0,"cool":0},"7NkJsN8U4hy-TFso6_FHUQ":{"text":"Was there on a Sunday afternoon. I was walking down Frenchmen St, hanging out, and as I wa","useful":0,"cool":0},"ye3x-5SakB2il_XcfF63Qw":{"text":"This place was lively, I ate a delicious alligator po boy and listened to awesome zydeco m","useful":1,"cool":1},"nYNE1G7NWjaEhLZE6f58Jw":{"text":"The music is really good. Don't plan to eat the classic burger it wasn't good at all!","useful":0,"cool":0},"Ct8etJIZFRnwcstSkCfi0A":{"text":"5 stars because the vibe and music were fantastic!! My friends and I just wanted to go to ","useful":1,"cool":0},"B5UKbc4X2Oqo_M9TtKJf_g":{"text":"I heard this was a great place for music and they were right! By far my favorite in New Or","useful":0,"cool":0},"T4FnxO0UpM2Sq21IKFIXIg":{"text":"The food was decent. The music was great\n The service was deplorable. Order food when you ","useful":0,"cool":0},"AYP_7zRcSVelGOrdEFuGsQ":{"text":"Perfect spot for fried pickles and beer. The music was excellent. Great spot to cool down ","useful":0,"cool":0},"GzqHuAt8teRyI7idjvkiJg":{"text":"The staff was wonderful and the music was great . Very nice place to have lunch and enjoy ","useful":0,"cool":0},"ACsn87DFZGdqotOht2c7CA":{"text":"The only positive about this place was the live band was great. The door man welcomed me a","useful":0,"cool":0},"ff99UxbVzoMioy2yK10_6A":{"text":"A bit disappointed in this restaurant. We were drawn in by the live music and cool atmosph","useful":0,"cool":0},"kghfmTpTN3eQ-OTBc4VOLQ":{"text":"Went tonight and had the most miserable experience of my entire life! Staff was rude and i","useful":3,"cool":0},"xpEbKS6aFWbsm_NRjdbzUQ":{"text":"Well are are on our 89th minute of no food and drinks.  I am not sure what the comes after","useful":1,"cool":0},"EuupBisfOFNP6akD1SRtHA":{"text":"Smack in the middle of the all night movable musical feast that is Frenchmen Street.  You ","useful":0,"cool":0},"rnfsx3uNshcNvsLnh38hkw":{"text":"We went to New Orleans with our 7 years old.  We wanted to go to a jazz bar with her and o","useful":0,"cool":0},"o6IBfbpwGOlpcorLOp9zcQ":{"text":"If you want something fancier or more upscale or want fine dining (i.e. expensive) service","useful":0,"cool":0},"5Zp7bMOMYAh_PwsfJiuKuw":{"text":"So I am gonna give this place an easy 4 stars.\n\nThe first impression is very cool and laid","useful":1,"cool":1},"7crmEHUG5sfmSVuF3nY9lg":{"text":"We were having an amazing time. The band was fantastic. However, George, the over paid emp","useful":2,"cool":0},"bUb305K9Pc9g5c5tW5Ddog":{"text":"Stopped in to listen to the band and have a couple drinks.  When we told the server we wer","useful":0,"cool":0},"0EZx_BWgCXMmu28pD0dUMg":{"text":"Awful service and EXTREMELY rude employees. Lady at the front door refused to take my ID b","useful":4,"cool":0},"-WbWeiYc-_ulUp99dMNu5g":{"text":"After walking all over the French Quarter with a friend, we finally made our way over to F","useful":0,"cool":1},"-fYLPZcFER7_dwehgNjmSg":{"text":"The jazz band was amazing and they were the only place on the street with a band going! Th","useful":0,"cool":0},"OPAn9h9qAuVdIEoM8iInrQ":{"text":"My family and I wanted to experience the Jazz on Frenchman street. We came across Bamboula","useful":2,"cool":0},"Z34umAiE7oJH4MsWHnm1xA":{"text":"Best blues! Our waitress Nicole was fantastic one of the reasons we came back the next nig","useful":0,"cool":0},"un8nNsS228hFK4oT8RHp9g":{"text":"This place was rude and horrible customer service.  A rainy Friday day at 230 with no line","useful":0,"cool":0},"JYWzef4lvpGBZ8mQucB7zg":{"text":"Great music all night long!  Nice appetizers to go with your or drink minimum. Worth a tri","useful":0,"cool":0},"6dDB1bQEuyZDCh9BYCd-zQ":{"text":"We heard some fun live music, but the food was pretty 'meh'. You can do much better on Fre","useful":0,"cool":0},"b6K3hCg0WNFeiiWJmsfKUg":{"text":"Spicy sausage po' boy was really good. Wife had the fried oyster po' boy and it was massiv","useful":0,"cool":0},"HwnayxDnnG587rNEXMGsUA":{"text":"Awful service, but great music. I recommend getting a drink at the bar then finding a seat","useful":0,"cool":0},"tYgOaZ8ulnW5jnqP-o1poQ":{"text":"This place has a cool atmosphere and great music but the issue I had was the service and q","useful":1,"cool":1},"UkwJ_-83mlco8k--5IddWw":{"text":"OUT OF TOWN TOURISTS BEWARE\n\nI attempted to enter this music venue a few weeks ago around ","useful":1,"cool":0},"yx1Y4NiOjYM7XaEOfFRcKg":{"text":"Super cool place on Frenchmen Street. We came at about 1 o'clock so it wasn't very busy bu","useful":3,"cool":0},"026oLV-q2r6jBfGJgQvJ9Q":{"text":"We went in for dinner. The music was great but what made the meal was the server. She was ","useful":0,"cool":0},"PG3Gv073Dn4FcmcbClVmRw":{"text":"Located on Frenchman Street. They have good live music. We saw a band play, with dueling t","useful":1,"cool":0},"QPaffHhw6MJti3kQb3GWqg":{"text":"The French dip. Music and service and things. The mothafkong French dip. Yelp is not your ","useful":1,"cool":0},"HdSCO_4N2hAV4CYvdpcYCg":{"text":"This place is so much fun I cannot even describe it. The band was outstanding especially t","useful":0,"cool":0},"8cZggD4qdqVK6xCmHERUdg":{"text":"We had wanted to experience Frenchman street so we took a walk and ended up at bamboulas f","useful":0,"cool":0},"haqzkUy5cSPxGjKvRe-Z4g":{"text":"Loved the live music and the decorations. Jazz band was great and engaging. Friendly servi","useful":1,"cool":1},"0fob4KbKhaBQZMFIG42G9Q":{"text":"Great live music from the  St. Louis Slim Trio and the best waitress Emily!!!!!! Emily you","useful":0,"cool":0},"wQcDYVuuuFVmcvKN-IH_kw":{"text":"I haven't yet been when the music has really been my style but their pulled pork sandwich ","useful":0,"cool":0},"HFa218_TWh_jql2xH1jtPA":{"text":"We spent an awesome evening along Frenchmen Street and specifically, at Bamboula's. Drinks","useful":0,"cool":0},"idtA9RblCI-jil1gpyX_7w":{"text":"We had a great time here on a Thursday night. The swing music was awesome. The spinach dip","useful":2,"cool":0},"DhoXCAeHl88-N1Mtgaat-w":{"text":"We only stopped into Bamboula's to watch some live music on the night of St. Patrick's Day","useful":1,"cool":1},"-scd12lbvGF6fJYXWYWS3w":{"text":"Here on vacation and decided we wanted to listen to some jazz so we took a walk to Frenchm","useful":0,"cool":0},"dJnqs0fe1WqEugayo9w89Q":{"text":"This place is a gem and the fried okra is to die for! I was greeted by a funny gentleman n","useful":0,"cool":0},"C-ieNjj-bZMk778sozTDgw":{"text":"Went in Father's Day, visiting New Orleans from Los Angeles, ordered a Whisky neat, for my","useful":0,"cool":0},"biTub1rLOKqA2Ppube3JxQ":{"text":"Front bar exceptionally crowded. \nHouse band \"city of trees\" is quite good. \nRear stage an","useful":3,"cool":2},"itRyqqDEnZroOiQGc_7zQg":{"text":"I was on a trip in New Orleans and a local told me about this place. The food is barfood n","useful":0,"cool":0},"-_xa5dHnujk1DOpTE3XIig":{"text":"Wish I could give 0 stars! Came here with a group of girls and they let the first two of u","useful":2,"cool":0},"81VclGbZKkiAHZMZWGxUdA":{"text":"This place is perfect for any time drinks. The music is awesome, and the drinks are good. ","useful":1,"cool":1},"dC5jXNu_IIeubjdZLe9v3w":{"text":"If I could give it no stars I would.\nUnfortunately, my rating has nothing to do with the m","useful":1,"cool":0},"pxc3lmx_UhuXG_30rUR4rQ":{"text":"Pretty shit overall. Took our barstools in an attempt to get us to move along. Nice try.","useful":2,"cool":0},"i_VluDV5zmk4FM6uW1c4RA":{"text":"My first visit may not have been as memorable as I wished. Now that I have been back to Ne","useful":7,"cool":2},"8NBtBe1mNpID58zMgM9r0w":{"text":"My husband and I decided to stop in for some live music yesterday on our very first day in","useful":3,"cool":1},"2K6sepSO1AiLpFMRNvPsnA":{"text":"Kevin came outside the bar screaming at my kids because they was waiting for me. Never aga","useful":1,"cool":0},"vIVBxXCom2nt_4aB4G8ltQ":{"text":"No hospitality. Asked to order food and the waitress told us she was \"off\" then asked a wa","useful":0,"cool":0},"HIzVX8vK-L0GWXEBr4Bjaw":{"text":"First time in NOLA and it didn't disappoint. With the assistance of a good travel guide/ t","useful":1,"cool":0},"N7W78TTxEGkFCG_D2sflFg":{"text":"This place is awesome!!!\nGreat live music \nDancing \nGood drinks/Bartenders \nGood prices  \n","useful":0,"cool":0},"uKWvSiLUh67T_dEfvzieWQ":{"text":"Service was terrible but the music was excellent. Asked for a water when I sat down, waitr","useful":2,"cool":0},"DQ9jJWIKRfXvmmpjrYytzQ":{"text":"Awesome music. Bartender is a total a$&hole.\nAccused us of bringing beer from another bar ","useful":0,"cool":0},"kYcb9B3_-ilDeDHXUFLv2A":{"text":"I love this place.  I found the bouncer to be super welcoming.  I went one evening around ","useful":0,"cool":0},"53mrpYDbxpdZbNsr-yNPzA":{"text":"The musicians were fantastic, the food was average, and the service was bad. Waited 15+ mi","useful":0,"cool":0},"HCFIAP-11e9KMiWO0oEG4w":{"text":"Pros: music (8 Dice cloth); brunch kid friendly; attentive waiter; fried pickles, fried sh","useful":0,"cool":1},"vJBeokOEne6RM0Bwwgpmtw":{"text":"My best friends and I went downstairs from our air bnb for a drink and when asked for our ","useful":3,"cool":1},"X1edfGZ762M-4LffgyJubA":{"text":"Spicy sausage po' boy was really good. Wife had the fried oyster po' boy and it was massiv","useful":0,"cool":0},"rU5XZZ0f6UMKJhT8uoqY7A":{"text":"Not impressed on our second visit. Bad food, cold gumbo, salty chicken, watered down frang","useful":1,"cool":0},"67p4eW_GAPC407Ml_cQ0Lg":{"text":"Heard about the nachos, they were everything the review said and more. I also got the barb","useful":0,"cool":0},"8P2uKOVpr8mdng1njV4C2Q":{"text":"Phenomenal!!! Sierra Greene killed it, literally. I'm still thinking about that show. I da","useful":0,"cool":0},"ODE6OBX3h_m7WQCXF7T1yg":{"text":"A MUST\nA great place to eat, drink and listen to live music. I thoroughly enjoyed my visit","useful":0,"cool":0},"Vx0dCuryfWFl7hJo2GF_cg":{"text":"This place had incredible music and wonderful fried green tomatoes. The ambience was divin","useful":1,"cool":0},"1moHWQp6AfHZBUnDt5S-Xg":{"text":"We visited this restaurant while in town for our friend's wedding. It reminds you of a tra","useful":0,"cool":0},"DbVp5R1SgdXNiv_Ys1h2JA":{"text":"We were drawn in off the street by the live music streaming out the windows. We were not d","useful":5,"cool":2},"SzCY2WZZC0L99w8HOsMmqw":{"text":"My favourite Frenchmen spot wasn't doing it for me, so I left and started walking in searc","useful":5,"cool":4},"80KVi0bpLfNCpRRoOgfQSQ":{"text":"Good jazz band playing today. Good atmosphere.\nFun place. Easy to find. Good service.","useful":0,"cool":0},"aLoGdGyknNwennzgh4M6hg":{"text":"I have a soft spot for Bamboula's and here's why: on a Tuesday afternoon before 5pm they w","useful":3,"cool":2},"Fu2kv2OA8zmHEuzD1kqzzg":{"text":"First time in New Orleans. Last time I will eat here. It was such an uncomfortable dining ","useful":0,"cool":1},"KM9p7BMetg92G1tzuX-lyA":{"text":"The drinks were good, the music was better. Lots of room to dance and it was not as crowde","useful":0,"cool":0},"I_Y_8Eob0UpSuJPLQkD-rA":{"text":"Great live band on a Friday mid afternoon. We didn't eat but the food all appeared to come","useful":1,"cool":1},"rMA2bfCsBtTeQHCBJKcUEA":{"text":"Great music, but they were out of like half the items on the menu.  Not good.  For that re","useful":12,"cool":0},"z-O8ipYviBxYuQZR4y3ZeQ":{"text":"While walking down Frenchmen Street after eating brunch nearby on a Sunday in early Februa","useful":15,"cool":15},"DxXTFTP8EYzW2FB6N2SEAA":{"text":"Yes yes yes.........great food and best music around. I have been several times now and al","useful":0,"cool":0},"3JAxInMXu9CXA0Qr6_GmUw":{"text":"Price: I ordered two French 75's (with wells) for $21. This is the major reason I rate the","useful":0,"cool":1},"H73IiAHcabhh8gxZpscAmA":{"text":"the worst service ever in new orleans. The drinks and the food arrived in parts and late. ","useful":0,"cool":0},"tA-I-zQXE6h8DNtdwwdsOA":{"text":"I enjoy Frenchman street and try to hang out here as much as possible.  We usually end up ","useful":2,"cool":2},"uc_XmGnPDsVAQcMs807dhQ":{"text":"Well I give them the 1 star because the Hangover Burger was pretty good. Where it went sou","useful":0,"cool":0},"947Vyaq8mP2w4T9LNSQWVQ":{"text":"Amazing time and great music!! Loved visiting while in NOLA. Great drinks and loved the ja","useful":1,"cool":0},"70GbkLWHufTfNrd0cnl5mA":{"text":"I visited this place on my first day in NOLA with my girlfriend and friends, expecting it ","useful":4,"cool":1},"0fRsHk8UYvUz-ogQ3sBrzA":{"text":"WOW ... That's all I have to say about this experience. I actually work in the restaurant ","useful":1,"cool":0},"2fdOUnAIUHV5pfKt3UkCqw":{"text":"Music is great but we sat for hot minute and got no service. Ask a waitress if we could ge","useful":0,"cool":0},"x5wQuZDVsmLzmvoOXcOGkA":{"text":"Love this casual club with the all-blues atmosphere. No pressure - just stand/sit and enjo","useful":1,"cool":0},"pRSZXM_p-EHXT_xMjB7SHA":{"text":"All my husband wanted was to listen to some good live jazz or blues. Stopped in here on ou","useful":0,"cool":0},"qV4zM_HbVUy-XBJ9brMkww":{"text":"We spent the evening of Thanksgiving at Bamboulas listening to two different bands. There ","useful":5,"cool":3},"NhwQIWzzP8GeqSvOGJDvPw":{"text":"Food was good but the service was not. Too many tables for the server to handle. You lost ","useful":1,"cool":0},"FI-OD9D3hq7yltHzmDVYQQ":{"text":"We had lots of fun and went back 3 nights in a row.  Perhaps they just had music we liked ","useful":0,"cool":0},"wxxO0hryEn4VR6RH5Q8Cqg":{"text":"Love the ambiance here! Attentive staff, delicious crab dip served with a warm pretzel and","useful":2,"cool":2},"XoB-w6Yl6a8Wf_gVr8r1QQ":{"text":"1. Had to wait a while for a server to acknowledge us. \n\n2. Ordered nachos and they were t","useful":0,"cool":0},"IshV_6sza-C1UrndJzHh5w":{"text":"Frenchmen St gave me a new appreciation for New Orleans and this place was a casual place ","useful":0,"cool":0},"U1lChukFW-GTDEDPqw24-Q":{"text":"Live music, po' boys, several Abita's on tap, friendly service, and no cover. What else co","useful":0,"cool":0},"HQ7kIacHv64Gd3sA6PC-1A":{"text":"Travis & Josh are da bomb! Great Bloody Marys, a great selection toon of beer on Tap... go","useful":3,"cool":2},"EL3wjYAiMsKvg0lBJboPWw":{"text":"Great place to catch live music just outside of the Quarter.  Place was hopping and the ba","useful":0,"cool":1},"dWjuHLcSsKxqQjM0JO-39w":{"text":"Rolling in this place tonight. Great blues band has us grooving. Bamboulas is bringing Fre","useful":0,"cool":0},"pXkZaff0x7gkdTzvvXuUWQ":{"text":"After exploring the Lower Ninth and riding 12 miles on a bike during a hot and humid day, ","useful":1,"cool":0},"DxvolQZN_ePhqyIS-h9Skw":{"text":"Had the catfish basket.  Love the batter!, nice music, and great drinks.  Service was grea","useful":0,"cool":0},"Ll12fZO3xpf3erpRAXP4Jg":{"text":"This is one of the coolest places on Frenchman St!  \n\nNo Cover ...lots of space to dance i","useful":11,"cool":11},"vz279Lvn-hR1T21D96aRew":{"text":"Amazing food and great music that starts at noon and goes into the night. Their fried shri","useful":0,"cool":0},"XhWJwktzv8y8jBiTXlcIog":{"text":"The food was not great.  At all.  Fried bar food, so I'm not shocked it wasn't great.  Ser","useful":0,"cool":0},"FvFmTZnlyeQ6i-Yk3gFJSg":{"text":"Just had dinner at this place!  FANTASTIC!  Burgers were amazing and ambiance was fun. Bon","useful":0,"cool":0},"QlCDacRk4YthiJypGVUnPA":{"text":"It's clubs like Bamboula's that make this two block stretch of Frenchman Street one of the","useful":21,"cool":21},"CrAfLVwg_z-1B2ouEIY4uA":{"text":"Great bar with live southern rock music. Good beer list. Wasn't able to try the food, as t","useful":1,"cool":0},"8j4v7IWkAISw-xWQKeU4rw":{"text":"Thanks for a wonderful rainy Sunday afternoon.  We were able to enjoy good drinks, great f","useful":0,"cool":0},"oyfHVcFxLZfNvkCskt8Buw":{"text":"Bamboula is representing these TampaBY losers.  the game is over and the Halloween set abo","useful":0,"cool":0},"G7frn8G12HCuVJTedpC52g":{"text":"Cinco de Mayo four of us came for drinks, dinner and music. Fantastic music by Vivaz! Very","useful":0,"cool":0},"IpkqsZPW0vVzfFjQZhlhmQ":{"text":"Food was awesome. Music was amazing. I haven't seen live music in a minute and this was tr","useful":0,"cool":0},"7lKNUxj3j_AEXtZ9c5__TQ":{"text":"Just please, just don't. It's so crowded and noisy and dirty and beers are whatever. Music","useful":2,"cool":2},"xgW5PhIrdanyn81pjv6D1w":{"text":"Had an awesome time at Bamboulas!! Traveled to New Orleans to see some jazz and many place","useful":1,"cool":0},"m5NYZgeGpujjMt2fwa4gTA":{"text":"We went in to have a drink and listen to the band. Once inside we decided we were hungry. ","useful":0,"cool":0},"qNpVeRKXEIUqH-8wUqjYiw":{"text":"We stopped in in the middle of the day as we were passing by to listen to some live music ","useful":2,"cool":0},"GUAhD2zRuSrCbUODrA8WFA":{"text":"Came here on a Thursday night with friends. They had great live jazz and the atmosphere fo","useful":1,"cool":0},"zeckKnX1Thk92pR5x1fAUw":{"text":"Great spot on Frenchmen Street away blessedly removed from the Bourbon Street debauchery. ","useful":2,"cool":0},"L_wPp1P1nIeZUnRFkU9_EQ":{"text":"Amazing jazz music could be heard from down the street and I had to find out where it was ","useful":2,"cool":2},"GrBBUWc7ztwYE9og1GiOCg":{"text":"Live music with 2 person band including a guitar banjo and bazooka! At 2pm there were alre","useful":1,"cool":1},"7rB6VuwFUsS21W5ozfGbvg":{"text":"Stopped in due to the live band playing... ordered chicken nachos which is a lot to eat by","useful":0,"cool":0},"ah3nPo-bp5bH6PmL_fE4Mw":{"text":"I loved every part of this bar. The service, the decor, the bands, and the prices. I had a","useful":1,"cool":1},"DtO9Ifgg6jCQquTx7bPIRQ":{"text":"Great renovation job, but the vibe and attitude stinks of bourbon st.","useful":5,"cool":0},"KAAIXlA12207w0Emt26u3Q":{"text":"Great bar, great music and cheap drinks. ..however,  there is a bartender who is so nasty ","useful":2,"cool":1},"Ihkt9zks9_J_kOcqhdkPiA":{"text":"Bamboulas's is a small music club on Frenchman street in New Orleans Louisiana. What an am","useful":2,"cool":2},"njvVnuKgLzieSrQ0Rd-erA":{"text":"We actually went into The Maison a couple doors down with our group of seven and had very ","useful":0,"cool":0},"DG-QBJFnmjJKND8Ek6vHew":{"text":"I have yet to eat the food at Bamboula's but if it's half as good as the drinks, service, ","useful":5,"cool":7},"adAkZ_ySiVay6FIjknaCMQ":{"text":"Had a 5 Star experience at Bamboula's. We showed up the night of the Women's NCAA basketba","useful":2,"cool":4},"rd4_H5tU7fyEA79xWBJ_zg":{"text":"Bamboula's is a Southern Caribbean dining and music club situated in the heart of the Mari","useful":2,"cool":2},"eGJ2CnQndp1rDabnT01CXA":{"text":"This is a rating is from pre pandemic, but I just happened to come in here one night, this","useful":1,"cool":0},"_SGT255OriKUcsebRp3XvQ":{"text":"All my friends and I had a top experience here. We went in on a weekend night, and there w","useful":0,"cool":1},"0XcviIuKeB2GQueX_OvRag":{"text":"Horrifying experience.\n\nIt was my birthday and I learned when you're in New Orleans, peopl","useful":12,"cool":5},"SLZq9ZTLiY6lzo5J9KktTQ":{"text":"The bartender was horribly rude to everyone! (Female, 5'4\"dark brown to her shoulders mid ","useful":0,"cool":0},"CchbCM_uLqD6thpXJ1r67g":{"text":"Came for the music! Grabbed a drink and fried okra! The fried okra was amazing! People wer","useful":0,"cool":0},"UbNlYOMtHtgkzR1z95SoXQ":{"text":"We walked all up and down Frenchmen and found the blues guitar player here to be the most ","useful":0,"cool":1}}