{"iY0UGl1k1p-Ni2mxHb5TVw":{"text":"Good staff, patrons and prices. I moved to this neighborhood looking to mingle with the lo","useful":1,"cool":1},"tfZ_S2vbOHez2gZEy_MDbg":{"text":"Great place to grab a drink.  Great service and strong drinks.  As usual it's kind of smok","useful":0,"cool":0},"ODwF_dz3f6TSU04g9ReSlQ":{"text":"I have been here a handful of times and really enjoy the environment. The girls behind the","useful":2,"cool":1},"7EpJu14q32ffy1D2mvBcRQ":{"text":"Old school typical New Orleans neighborhood bar.  Get atmosphere, large back patio for the","useful":0,"cool":0},"g5rJ65W4Zago3-jkMSi9BQ":{"text":"The oldest bar in Lakeview/Navarre, this place embodies New Orleans. Everyone here is welc","useful":0,"cool":0},"QTF8ih4VFsbCpPWivh8Gfg":{"text":"This is my mainstay. This is my rum and coke, this is my shot of Jameson, this is my after","useful":1,"cool":2},"toJ8lbtSXc584N5eLfcNtg":{"text":"Perfect.\n\nThat's the way to describe this bar. The last night I walked in Bob Seger's \"Nig","useful":0,"cool":0},"H0rpLQuELEuexKWptp9eSQ":{"text":"WOW I can't believe no one has ever reviewed the Homedale Inn!  Well I used to live right ","useful":4,"cool":3},"V5nHkA2p3JrMyHMYUUCeSg":{"text":"Homedale is my second home.  Plenty of the regulars are within walking distance, but a few","useful":3,"cool":3},"_P6onLm92MSfqRcsUAvGAA":{"text":"This is my mainstay. This is my rum and coke, this is my shot of Jameson, this is my after","useful":1,"cool":1},"Hus7e89h3qlFh52Pn6fvyg":{"text":"This is a neat little neighborhood bar. The staff was friendly and the patrons seemed cool","useful":7,"cool":4},"LK-DHyjKehabl258MaczoA":{"text":"This is a really cool, old school, dive bar that has a fantastic atmosphere with wonderful","useful":10,"cool":8},"7qeh14CKtqC-g-pYeeytlQ":{"text":"Old school neighborhood bar where you are treated as a welcome guest. Great hours and lots","useful":3,"cool":2},"tQR9SIxuspPNZuhk73cLlg":{"text":"After moving from the irish channel to lake view we found ourselves living across the stre","useful":0,"cool":0},"G_K4cDKcYcaojzMJ1T5aRA":{"text":"Homedale Inn is an old school dive bar. After reading Shannon and Harry's reviews I bookma","useful":6,"cool":5},"v8ESkwTXaPU9jCylmlfd-w":{"text":"Fun dive bar in the Navarre/Lakeview neighborhood!\n\nHomedale Inn was established in 1937, ","useful":0,"cool":1},"uaXibsaSqxIGrgq5coUyQg":{"text":"Awesome local bar with good peeps.  We were there for a Krewe party at Christmas.  Owners ","useful":0,"cool":0},"a4H1xkdLZ8JTF5B7DCGOpw":{"text":"A true hidden gem. I never think to go here on my own, but when a friend suggests it, I ju","useful":0,"cool":0},"a9YSD4iBY7S4ywjyyvoCSQ":{"text":"Great atmosphere! \n\nFun staff and customers.\n\nOne of the most fun trivia nights in the cit","useful":12,"cool":7},"r_fymAtIGhn7x1PvFCmYCA":{"text":"What an interesting bar.  Total locals dive, tucked into the Navarre neighborhood (often c","useful":2,"cool":2}}