{"d_NZZR1YqKMO5qJiKwDL7g":{"text":"My mom and I had a reservation at 6:15 and there was absolutely no line. We walked through","useful":0,"cool":0},"0UoBuz_O0KIlI-Z1Y6YVig":{"text":"This is one of the first bars I stopped in coming to New Orleans and I'm happy I did.\n\nIni","useful":1,"cool":1},"BXgC_Xf3OQ4p9J-wlwZnXw":{"text":"Had a noon reservation at  yesterday for 3pp.  Wanted to take our nephew to a trendy place","useful":1,"cool":0},"ewEph2-UMKZ3nDEOoI2p_w":{"text":"Ambience and food are phenomenal! It's quaint and non-touristy. I had the pan-fried pork s","useful":1,"cool":1},"GOcv4KOSaWI9kdte14cJxg":{"text":"Sylvain gets my first 5-star review.  \n\nI stumbled upon this restaurant / bar in September","useful":1,"cool":1},"daGsHNnBhsTZYzbqcsMx3g":{"text":"Beautiful space and great cocktails. Food can be hit or miss.","useful":0,"cool":0},"G4-KM21SPkyCT0MNk248jQ":{"text":"Eating at this place has been the worst experience dinning out at a restaurant/gastropub. ","useful":0,"cool":0},"ghy70wUqIZPqy19kapbWZQ":{"text":"We ate at Sylvain twice -- brunch and dinner -- during our trip to NOLA in early November ","useful":1,"cool":1},"oZQ70AatHRrKFE82p5HyUg":{"text":"Went for lunch at 1:30 on a Saturday and had to eat at the bar-- so get reservations, even","useful":1,"cool":0},"li0xiQtrSy753wR0n-Ad0w":{"text":"Such a cool atmosphere. Great drinks, great food, great service, and great decor- screams ","useful":0,"cool":0},"vHyrvr6gH9Z9ZuW4Jd5m3g":{"text":"On our first evening in New Orleans we were looking for good, inexpensive food in the fren","useful":1,"cool":1},"s3CCjEgSNwked0r3JVOrIg":{"text":"Sylvain is a hidden gem for tourists surrounded by typical New Orleans tourist traps in th","useful":2,"cool":1},"YnL-YQ5iAQTPPpDE507u7w":{"text":"The food at Sylvain is incredible. I've been for both brunch and dinner and have enjoyed e","useful":0,"cool":0},"4vxLJu2NbcNaQsao38CFnQ":{"text":"Sylvains was amazing!  The fish special and the shaved brussel sprouts salad were delish!","useful":0,"cool":0},"JooknvGErxGRMJoisoQPlg":{"text":"My husband and I had several great dinners in New Orleans, but the dinner we had at Sylvai","useful":0,"cool":0},"Czz_zwFwRNwTSGuQ_qnk6Q":{"text":"This place rocks. We had the griddle cakes for an appetizer and the quail for dinner. The ","useful":1,"cool":0},"1lLcAYq_0N2PJGt9qXCgiw":{"text":"I went to Sylvain with the bae for my birthday dinner, and I was very pleased with the exp","useful":0,"cool":0},"6GzcuOLViOdg7FceI-MSFw":{"text":"Great hip atmosphere, very good burger, and a great bartender. This is a great option if y","useful":0,"cool":0},"2RNJckwU3hIC3b-Mq8xSkw":{"text":"Its entrance, nestled  behind and In between buildings, can be easily missed so pay close ","useful":3,"cool":0},"MUznQpCymdHqmfvir66vCg":{"text":"Excellent service. Really beautiful outdoor patio. Enjoyed the cheese plate!","useful":0,"cool":0},"VUB7HlDu4Isa4M4i_kYCpA":{"text":"My wife and I went for Sunday brunch. She had been to dinner there with friends 3 times bu","useful":0,"cool":0},"R4NtdApIqER6HM6zmeJ90Q":{"text":"Spent the afternoon wandering around the French Quarter of New Orleans after dropping some","useful":0,"cool":0},"FvTpqQvnJ6wnzGxWNmP89Q":{"text":"favorite restaurant of the trip. really interesting dishes. good service. hidden gem.","useful":0,"cool":0},"5RUURy5Y0Yxj17x-iyAV7Q":{"text":"Would never go back! Food was good but service was deplorable! When the server made a mist","useful":1,"cool":0},"ixE48qVQiswzV_uhdQrtWA":{"text":"Such good food, great service.  We had an amazing pork shoulder, with greens and grits.  T","useful":0,"cool":0},"ylhBEWceom6wP9kkXh-2OQ":{"text":"Beautiful interior, charming staff, great food and great prices. The patio is lovely!","useful":0,"cool":0},"tlCA1LNP7-3ze6cM_xcglQ":{"text":"My party and I came for lunch and we were promptly seated.\n\nWe ordered a bottle of prosecc","useful":0,"cool":0},"CJ9oN34Lu2hCgkgqclZnKQ":{"text":"DELISH! Loved the atmosphere & options. Service was great and everything was fresh, local ","useful":0,"cool":0},"3TWG0y4f7r-IOPAaqabMOg":{"text":"Came in for a late dinner at this very groovy spot. Skullduggery abounding in a some very ","useful":0,"cool":0},"h1aTw2m0ulSXRoADsAXUXg":{"text":"I'm in love. My girl friend and I were looking for our last meal in NO. We read reviews ab","useful":2,"cool":1},"24ZHYYBTJ7BCHuDqoH9-JQ":{"text":"Best Bloody Mary we had in NOLA, and that's saying something. Sunday brunch was great. Eve","useful":0,"cool":0},"fNEJhJ_CsbaU9eZu5bC2Vg":{"text":"Amazing food, amazing service. Went here for our 20th anniversary with a group of friends ","useful":0,"cool":0},"yhA5DueiufPjIlEG7_vYAA":{"text":"Loved this restaurant.  Went there twice in a week during a recent conference.  The locati","useful":0,"cool":0},"ynL7dIW5Z8NUJuGHi8xF8w":{"text":"The waiter Joseph D was extremely rude. His etiquette does not match the atmosphere this r","useful":0,"cool":0},"9MJVo3ie1cs3ZurQeg4VUQ":{"text":"Fantastic meal. We had the arugula salad which my friend said was the best salad he'd ever","useful":0,"cool":0},"gyVzHyDnKJnOroqoxP4Dmw":{"text":"This place is a hidden gem, and I mean hidden, if you're walking down Chartres Street, I f","useful":2,"cool":0},"UrKRPWoA7VIlpbUVjOWvAA":{"text":"Service was great, beer was great, ambiance was great. I had the fish special. The veggies","useful":0,"cool":0},"GXatkfIh693Hi7z7ABJ4lQ":{"text":"Mediocre and the service is not great - i do not get what all the fuss about. \n\nappetizer ","useful":0,"cool":0},"VBO4Bun5JaQHwBUsnmLRiw":{"text":"Small place, but not unbearable.   Good menu with enough variety and good price point for ","useful":0,"cool":0},"ID6tmDv5HErywUhEB_UysA":{"text":"I'm not sure how Sylvain has such a high rating.  It's pretty small and trendy inside.  Th","useful":1,"cool":0},"B8SMhAIlJFgZ4mKCt1qvhA":{"text":"Amazing food (I ate Beef Cheeks) and friendly staff. Highly recommend.","useful":0,"cool":0},"ZpAaWv9IBwYRH6q-EWRrmQ":{"text":"Only got to eat here once, but Sylvain gets a solid four stars for an all-around excellent","useful":0,"cool":0},"K4NPma0Qsi0nwx3tTxM_Jw":{"text":"The the flavors of the pork milanese blended together very well. My husband ordered the \nP","useful":2,"cool":1},"qxqKEeRXoEGDukHT1v4snA":{"text":"Absolutely phenomenal. I love the entire space, especially the beautiful courtyard. The pa","useful":0,"cool":0},"czjTd13R3hAHS13PeRKeLg":{"text":"Ok, this place was outstanding. I started with a Sazarac. Great cocktail! Skipped the appe","useful":0,"cool":0},"Dg46rQJLqRgs75pEUYiyrQ":{"text":"Amazing food and drinks!!! Would give this place 6 stars for the food alone. Amzing ambian","useful":1,"cool":0},"PXF4YwRY-AgttJVmBE-uEg":{"text":"Disappointing \nWas really looking forward to this place. Chicken sandwich was dry. Bar are","useful":0,"cool":0},"szev0PzSwVvC7WGYIvYFig":{"text":"I want to start this review with a disclaimer.  I am a local uptown New Orleans resident a","useful":5,"cool":2},"7YTfCUwNTofcJUXzHBV5dw":{"text":"We really enjoyed our dinner here several nights ago. We arrived a bit early for our reser","useful":1,"cool":1},"LKdYMSe4XtZhi_rLZWiGJQ":{"text":"Came here for my bday dinner, no reservations, luckily got a table but i don't recommend t","useful":0,"cool":1},"BDcjnDMpazcEU31rXAWjgQ":{"text":"I was pretty disappointed with Sylvain. I had the \"chick syl-vain.\" It was so overdone and","useful":0,"cool":0},"apLgX0y0NIgzzK7pwJ3BOw":{"text":"Can I just say how ridiculously amazing the crispy pork shoulder was? I mean, better than ","useful":0,"cool":0},"uGw_xv6zCqyyMD1E1wkUhQ":{"text":"Uhhh Brussel Sprouts you never forget??\nGreat ambience and service. Foodie haven and backy","useful":0,"cool":0},"YEwBgvdgWk5z_nR6OFLJOA":{"text":"Very, very good food. Excellent service with not too much pretentiousness.  Awesome mix of","useful":0,"cool":0},"6IFZQABy3HyolNd58L5d-g":{"text":"Perfect ambiance for a cozy (and delicious!) date night! My husband and I had just checked","useful":0,"cool":0},"VVbrhp4faBhFOBGdEf0Z3w":{"text":"What a great place! We had a party of eight, and the service we received was excellent. Dr","useful":1,"cool":0},"kggkIRP9fuAkC2GvWx80ZA":{"text":"GET THE CHEESE PLATE! Some of the most unusual cheese I've ever tasted (or smelled) but ve","useful":0,"cool":0},"53VsKeqHBNpEOfM6nd9Reg":{"text":"Suddenly as you walk along the street...you run into this quaint location.  Outside Patio ","useful":0,"cool":0},"4nzgm607Y2u2UDumsGbMjA":{"text":"AH-MAZING!! We had a great dinner here tonight! Started with the tomato and cucumber salad","useful":0,"cool":0},"v__PtN5rsRdfrtJEzVKK7w":{"text":"Cute little gastropub with outdoor seating and great for a date night. I got the rose and ","useful":0,"cool":0},"InPXblY3m2jBfyUmTLeICw":{"text":"We had a lovely time at Sylvain.  This is a five star review because of the service, but t","useful":0,"cool":0},"v3W-UD_iWjDVkDFWWEJWbw":{"text":"We went here based on recommendation from a local and were not disappointed! Food was awes","useful":0,"cool":0},"_xKxw63qNyelGDEiAaYjdA":{"text":"Wow! This place is wonderful...really, THE best restaurant in the French Quarter...my husb","useful":0,"cool":0},"l3Br8Jx8uNUDfXOaPTgpLw":{"text":"OK - another amazing dinner in New Orleans. Yelp helped us find this place and we used Ope","useful":2,"cool":0},"CFf6MD3PI0uzPtFKfPRe6g":{"text":"From the front facade of Sylvian, you'd think this establishment is a small, dark hole-in-","useful":0,"cool":0},"2mc-hJ3gHCAvJwURv5FNqA":{"text":"Interesting place with various sitting areas. Great food. Lively atmosphere, but a little ","useful":0,"cool":0},"V6d8TkhQSkKvuPkppd2w3A":{"text":"this is my new favorite nola restaurant!  the food was amazing and the service was superb.","useful":3,"cool":2},"9r6j-Mo7iCMwAOCm8H2U1g":{"text":"It is overpriced and the flavors are average, at best.  \n\nThe courtyard is filled with lit","useful":0,"cool":0},"i8O0BiKNKrCVnL53QKIWcw":{"text":"One of best places I've been in a while. Did not have reservations only took about an hour","useful":1,"cool":0},"3sBBTg_xPyPeCxrBaqzKBA":{"text":"If you are looking for a quiet and well lit place, keep looking. If you are looking for a ","useful":3,"cool":2},"ADeBJXL5SjcjqfuHn1YALg":{"text":"Amazing all around! My husband and I are total \"foodies\", I read about this place and saw ","useful":0,"cool":0},"woiPJ91PoH8RphHudvVd5g":{"text":"OH my goodness.  I was here for dinner on Saturday night, and it was incredible. Our serve","useful":0,"cool":1},"PCNjFpoWd6AxKEUkp1hR3w":{"text":"I love Gastro Pubs and this place is outstanding! I found this on yelp while visiting New ","useful":0,"cool":0},"FvWkxiVOuOKiYoBArWMlGg":{"text":"The beef cheeks.  The richest, most tender beef you ill ever put in your mouth.  Had the c","useful":0,"cool":0},"LJpe8ftM6b_NxzNln_6eqQ":{"text":"Absolutely fantastic. The red snapper was one of the most memorable dishes I have ever tas","useful":1,"cool":0},"BK7EZRG8RaNbqxb_wpcl_Q":{"text":"This place was great. I had the Beef Cheeks and it was cooked perfectly. The server was ve","useful":1,"cool":0},"r2l3S-GAJYaWO2e2TnzNwQ":{"text":"Great atmosphere. Food was amazing. I had the best scallops here. I feel its more of a hip","useful":0,"cool":0},"e3bOkGk4od5x-yjKPRQrcA":{"text":"The atmosphere drew me in immediately. It's dim, charming, and romantic. \n\nService was fri","useful":0,"cool":0},"3pwTMnl9Y16QuASfXTKq2g":{"text":"Sylvain is a perfect little gastropub tucked down a corridor and away from the Bourbon St.","useful":0,"cool":0},"uB7vqc2r92eWvsL80_RgRA":{"text":"What to say, what to say... Grade A drinks, decent dish.\nPardon my scoring but I would hav","useful":3,"cool":1},"xPICFwnnXr2RqhNWEtUD9A":{"text":"We stopped here for lunch on Easter. The food was amazing. If you come here, do yourself a","useful":0,"cool":0},"gckSyBtEjkHlmxDKh4iGdQ":{"text":"Stopped here for brunch on a friend's recommendation. She was raving about the food before","useful":0,"cool":0},"F1ddFPuRfoyBIiFy9v8a_w":{"text":"Lovely room, had a last minute table for us when Bayona didn't, waiter knew the menu, knew","useful":0,"cool":0},"Aqa0ld_XfgeZyegbhqDF-w":{"text":"Had an excellent experience here for a bachelorette party. We called ahead and asked if th","useful":2,"cool":1},"xMmmwtvVXiMkYbpzmFWISQ":{"text":"The Southern Antipasti was enjoyable, particularly the cheese meats and mustard but the mi","useful":0,"cool":0},"iQT44-4ujGNcbr4t5jd7fg":{"text":"They make their own tomato juice/Bloody Mary mix and the food is great. Came with a group ","useful":0,"cool":0},"4wCYOoqoJaxuuVzDUAA_Ag":{"text":"Charming, dimly lit, little restaurant in the quarter with excellent plates that manage to","useful":6,"cool":3},"LNqtQphw1Du0LGjcuR5vFw":{"text":"Oh Sylvain, what an amazing dinner!  My husband and I came to eat dinner here on a Monday ","useful":0,"cool":0},"LLrepTx2MnKR1lkOInEqHg":{"text":"Had an anniversary dinner here. Pleased with everything - service was excellent. Wine sugg","useful":1,"cool":0},"seibbE8o3fQqm-3flJdEAg":{"text":"Great cocktails and great food. Dined at the bar and it felt comfortable from the minute I","useful":0,"cool":0},"THW0vuSIIA6kvH8xl1jRwQ":{"text":"Came here when the doors opened for brunch. It was a bit confusing trying to find the door","useful":2,"cool":0},"eoVNLYmuR8xui2nNjVgNAA":{"text":"Spectacular.  A dear friend of mine and I ate here tonight.  He had been several times, bu","useful":10,"cool":6},"-tW4VchMkVKY9BcIy5ct5w":{"text":"Was disappointed with the yelp suggestion on this one.  We were 1 of four tables and the i","useful":2,"cool":0},"Dk00ZVLW4D-cWbcGzYVpfw":{"text":"Food really good. More of a casual feel. Dark inside, great bar area and a few outside tab","useful":0,"cool":0},"C-W5e36wpc7wnoJspOJUXA":{"text":"I have to say, this place went above and beyond. We showed up hot, sweaty and hungry with ","useful":1,"cool":1},"5KB4aq5F4BlTndlKsW1AYg":{"text":"Don't believe the hype!! We had the antipasti and it was average at best. We also shared t","useful":0,"cool":0},"MqN8nG9FBf5fdf6ePuCymQ":{"text":"Dark and secreted down a dim access alleyway, Sylvain offers some good semi-crafted cockta","useful":0,"cool":0},"5feM3IFC0kahRWCmDVhhRQ":{"text":"Good food, but not as impressed as we were with other restaurant places in the quarter. No","useful":0,"cool":0},"aGnjayfKy3ae_diniUYcLg":{"text":"Slow start with good food but bad music. Would go go back! (New Orleans has a great tradit","useful":0,"cool":0},"IfIqu5gLEpXIs0JrDRLeIA":{"text":"I was so excited to try Sylvain after hearing my friends' enthusiastic testimonies of how ","useful":0,"cool":0},"XhsF7z_GK9ALBbzlDon_VQ":{"text":"After almost a week in NOLA, we were still searching for the perfect dinner.  We found thi","useful":0,"cool":0},"lXKyRH07CUABGOCYXLndqA":{"text":"Go here every time I'm in town. Great vibe, solid food, good cocktails and ideal for late ","useful":0,"cool":0},"dcQfY_ySf3VKGwmH1LAwog":{"text":"My husband's note on the ticket said it all, \"FANTASTIC!!!\" The scallops dish was worth wr","useful":0,"cool":0},"woAhzmDovJeUpcLD2IikNw":{"text":"The dinner I had here was very good and I found it to be price appropriate. If our waitres","useful":0,"cool":0},"oe3nAM6ramDLX-cP7I-TGA":{"text":"Small venue/inside seating very dark and loud/Courtyard area small also.  Made 7:30 reserv","useful":0,"cool":0},"NEFp88Mkq-YI9ce3UETW7g":{"text":"Great place!! We had a fabulous dinner and great service! I ordered the scallops and an Ol","useful":0,"cool":0},"xrYjBtrKF4WNXc-FzS6cRw":{"text":"The entrance to Sylvain is through the courtyard on the side of the building. Very charmin","useful":0,"cool":0},"gnV_YIHMdPC6B-MULKaT4w":{"text":"Cuisine is excellent and environment are romantic however the music sounded borrowed from ","useful":1,"cool":0},"Op1WUZSKj7cadNsNi05R_Q":{"text":"Very good food. We had the jambalaya, redfish, and shrimp &  grits, all we're super good. ","useful":0,"cool":0},"GD7P69qvp2MKdtDHJClVkQ":{"text":"Don't believe the hype.  Went to Sylvains with colleagues and we were really disappointed ","useful":2,"cool":0},"44rFQ4cWx6vUyMkUN8lQqA":{"text":"Came a few times trying to sneak in for lunch or dinner but the wait times were insane. We","useful":0,"cool":0},"kuEb-5dKF5NDGnkbbbVuJw":{"text":"Had such a great dinner at Sylvain with my co-workers. Was never a huge fan of NOLA food, ","useful":0,"cool":0},"B3XeNkeL2UWTbGOLlukh2A":{"text":"This weekend I had the chance to visit Sylvain in New Orleans  Sylvain is a wonderful smal","useful":2,"cool":0},"95LvOq6axtRB2qDcV0e0-Q":{"text":"Oh. My. God.  That pulled pork sandwich was awesome.  Like buttah.  Melt in your mouth fan","useful":1,"cool":1},"PAttivanElhwn2K-rjwz1Q":{"text":"Best meal in Nola. We had the fish fritters as an appetizer, which are what hush puppies w","useful":1,"cool":0},"AuidRb4kS91qk_P3Jf1DuQ":{"text":"This was an ok place - it was sprinkling so there wasn't any seating in the courtyard, so ","useful":1,"cool":0},"Am0s7VpvOb9pkzFaxZJ9Hg":{"text":"Perfectly cooked seafood. Lovely setting. Great place to get away from Mardi Gras crazines","useful":0,"cool":0},"X2761vx0_M4FWVYImHMmaA":{"text":"Far from Bourbon Street, and close to God.  \n\nI tended to avoid the Quarter when I lived i","useful":7,"cool":6},"6ys3aDkOyrLYSYYkk1HGuA":{"text":"They have the best burger in town.  It melts in your mouth, that beef is just so damned ju","useful":0,"cool":1},"aK8CiJD9DCNQ9rO8tRQWjw":{"text":"The salad with sweet potatoes and apple was very disappointing. We barely had one chunk of","useful":0,"cool":0},"cCYMupfMxzlaqDnq9BqqOA":{"text":"Great atmosphere and great food a little off the beaten path but still conveniently locate","useful":0,"cool":0},"of-0eYhtbTTPD7LoRJqrUw":{"text":"Had the fish with a succotash and wonderful stock. Awesome cook on the fish and perfectly ","useful":0,"cool":0},"urjPvtoV-Ei4rS7PpWd47g":{"text":"One of the best in the Quarter. Here's why:\n\n1. If you're a local, you might actually find","useful":1,"cool":0},"E44hx_M73zhSam9mRr_4Lw":{"text":"Some swell food here people! Had two (2!) Moscow Mules to start because I saw the bartende","useful":1,"cool":1},"AU58yH1P1i6gi41xUY5Z5A":{"text":"I was SO excited to try Sylvain and ended up being super disappointed by the food. The atm","useful":0,"cool":0},"Sq784RpRm4EhR6SvOVfe0w":{"text":"Food was 3 stars but service was very poor.  Wait staff seemed very scattered, confused, d","useful":2,"cool":0},"qaaKzkg-r8lPJqzXesNmrw":{"text":"So delicious! I can't get over how great this place was! I had the scallops and they were ","useful":0,"cool":0},"6uFMi8U0TfBjUyl4VG-7Ag":{"text":"One of my favorites in New Orleans. Great cocktails and really solid food. Local hang out ","useful":0,"cool":1},"dfYRp-pwWYkKF8Hg4iIXew":{"text":"Had dinner here last night for the first time, and it was a terrific experience all around","useful":0,"cool":0},"_o112Hu31elMWrDLciDVEA":{"text":"Our dinner at Sylvain was really good. Dark restaurant, as everyone says. But nice atmosph","useful":1,"cool":1},"F0vcakzBIfCvcJRSGUUuqw":{"text":"Sigh..so good we had it twice while we were here! I think we achieved stage 5 clinger stat","useful":3,"cool":1},"L1LNJhmvfuBuLx3bmf4kcA":{"text":"Hands down one of my favorite meals of my trip to NO.  Reminded me more of a restaurant in","useful":1,"cool":0},"QTu0K-xq3K7hLVPEm7EJ0A":{"text":"Loved, loved, loved it. Out of the way, beautiful courtyard, fantastic Moscow Mules, delic","useful":0,"cool":0},"APHkWEB0GrXchAr4eDYnVw":{"text":"Taste buds explosion! \n1. Ambiance: has a gastropub feel. Rustic. Relaxing. Make a reserva","useful":2,"cool":1},"29LoMf-UyZGvYFxL32Sozw":{"text":"This place was great! We stopped in for a quick snack and some drinks before a night ghost","useful":0,"cool":0},"NaVwcwFGrehiOQOER2ktWw":{"text":"The perfect gem in the French Quarter. Had the Antipasto app and the fish special. I will ","useful":0,"cool":0},"d3eW4gCghYGZEh2ZKSDSBA":{"text":"Really nice upscale bar/restaurant. We only came for drinks and the fried sweet breads whi","useful":0,"cool":0},"amJkFb6rFXSmBGK99aQH7A":{"text":"Really dug the brussels sprout salad and the seasonal salad was to die for! Friend had the","useful":0,"cool":0},"DLnyah4GI23jo4QYytJOxQ":{"text":"Great service. Atmosphere is lovely, the backyard is gorgeous. Great ambience.\nCurried pot","useful":0,"cool":0},"JVg4S5UIibuvE0AyVfOZug":{"text":"Simply put, this place is amazing!!! For a starter we had the meatball app- excellently pr","useful":1,"cool":0},"rJx5E5jl77zn3-rVQbYiCA":{"text":"I know that FQ New Orleans is a hub for tourist. (which is why I was there)  There are a l","useful":2,"cool":1},"n6UkhoxuB64j_YFGYYJd7A":{"text":"The food here is always amazing. I live for the shaved Brussel sprout salad and the beef c","useful":0,"cool":0},"gRPwnHJ-MXurkuXFZV-t6A":{"text":"Service and front of staff were excellent! Cocktails were ridiculously good but the cooks ","useful":1,"cool":1},"H8wtArkZhltF5rdbjdngDQ":{"text":"Stumbled upon this place in a fit of hunger. I really have to do that more often if the re","useful":0,"cool":0},"eA_SXHdmZNGgK0fYnsQgGg":{"text":"First if you want to go here make a reservation a couple days in advanced and if its nice ","useful":0,"cool":0},"d6mJNlh2XHeGtrbCwBl4gQ":{"text":"Atmospheres and Service was great and food was alright. It's a great late night bite pig o","useful":0,"cool":0},"h4S-owD1YPQ6Vm-btdIDWQ":{"text":"This is as home made as it gets. We were told that the cook actually makes the sausages fr","useful":0,"cool":1},"8vQKK0lIsBXeKd6EBBAJBw":{"text":"I'm not sure what I was expecting, but it didn't reach as high as I thought.  The beet bru","useful":1,"cool":0},"iaTblK8vzfVokhPs2HzpsQ":{"text":"Yum! This has been one of my favorite restaurants in NoLa so far.\n\nLOCATION\nRight in the F","useful":2,"cool":0},"1w6iq087NFELuSn5t4dPgA":{"text":"Ate at Sylvain on New Year's Eve. Everyone who works there seems to care about making sure","useful":0,"cool":0},"VN98Vx0jL_ChNKcZYW9dxA":{"text":"Very sexy restaurant.   Great atmosphere. Smoked onion on the pear salad is amazing.   Dri","useful":0,"cool":0},"r3-rDAwzK0O02-rLUi7tQA":{"text":"A really hole in a wall place in the French Quarter.  I have to say this place is a true g","useful":0,"cool":1},"srZBJ2GXF9T6vukpw8NFoQ":{"text":"Found this joint at the end of Chatres St - and it blew me away. Don't be fooled by the 'h","useful":1,"cool":1},"h1W6tNGTb3sKBEI8gMak7A":{"text":"...was last there, Aug. 2011, a weekend trip from Baton Rouge, where I was shooting a film","useful":0,"cool":0},"2iQNf32csowP4JiOT6eXTQ":{"text":"The crispy pork shoulder over grits is New Orleans cuisine graduate school.\n\nThe fresh squ","useful":1,"cool":0},"1nuCdzyPBb1pw3DMCZ2DZg":{"text":"Love this place. Everytime we are in New Orleans we stop here. The food is great, the drin","useful":0,"cool":0},"I8psIMl8h_p-cmLFvxqyKw":{"text":"My wife and I stopped in Sylvain for a cocktail and were pleasantly surprised.  Great atmo","useful":0,"cool":0},"T0fb_Oh9V07MSwv9K08F-g":{"text":"I've had brunch and dinner here and both were solid meals. I admit I wasn't feeling well w","useful":0,"cool":0},"md7Q9lhjha36075vIkXCOg":{"text":"Sadly I had higher expectations of this restaurant.   Perhaps because it was Halloween it ","useful":1,"cool":0},"juOfo7u3nah0-ZZhVwoS4g":{"text":"Fabulous!!!! My husband had the beef checks & before I knew it, they were gone!  I got a b","useful":2,"cool":0},"eObe-J-BPTafhDyRNSUCew":{"text":"My wife and I split the beef cheeks and the pan-seared pork shoulder (like card cakes with","useful":0,"cool":0},"IhGXglBRFhIJtIVXl6XmBA":{"text":"Best meal we had eating 3 days in the Quarter. Cool and upscale but no fake opulence, no p","useful":0,"cool":0},"bLMoPLbGgJ7SrNgh0jKJRA":{"text":"Want to eat in The Quarter, but escape all the tourists? This is a great option.\n\nThe ambi","useful":1,"cool":0},"YTUrNUyHJ2SecXYlcgscOg":{"text":"We visited Sylvain on our last night in NOLA.  We had indulged in all of the NOLA cuisine ","useful":0,"cool":0},"_7unsqGcFF1pzKbBECZDBQ":{"text":"As quirky as the space is, as wonderful and good vibe it gives.  The staff were super frie","useful":0,"cool":0},"tPYPaYJLhTWKK-8MrRXvTg":{"text":"First, the high points: My cocktail (ironically called the No Fun) was delightful, the spa","useful":1,"cool":0},"u2fTCSszJ2EuEDkhOZ529A":{"text":"Menu is easy to read and has great options. \nThe pork shoulder is fantastic, you won't reg","useful":0,"cool":0},"ZjKv_7NqNt43sNQryi0_8w":{"text":"Great wine by the glass selection, Rose' of the day was wonderful. Food was a standout, sh","useful":1,"cool":0},"gkyXAUQ_hQFZa5CVdmUyRQ":{"text":"Sylvain was a lot of great things and a few not-so-great, so I'm going to try to be fair t","useful":0,"cool":0},"MlsysTbk4ENk74nN2xbDxg":{"text":"Great and interesting cocktails.  Good beer selection.\n\nThe Heirloom Tomato salad was AMAZ","useful":1,"cool":0},"IBcAeVR3FJtaaDuao7LPXA":{"text":"We had brunch there and enjoyed the food while the crazy world of the Quarter passed. Good","useful":0,"cool":0},"kELXCuYlqDHj4QOYKqF56A":{"text":"Was in New Orleans for a conference and this was one of the places I visited for dinner ou","useful":1,"cool":0},"EWPonNPuYWtzfvnlhXiNnw":{"text":"Absolutely Amazing!!! The fish of the day was delicious as well as the amazing drinks from","useful":0,"cool":0},"Sxd9EtAmgkAKxOMUlGOxYQ":{"text":"Food was excellent. Had the shaved Brussel sprout salad and the beef cheeks. Beef cheeks w","useful":0,"cool":0},"MSwjm8U0Niirdvk9X_0XHg":{"text":"We visited for brunch last Saturday.\n\nIt was Awesome!\n\nI had the Vietnamese breakfast with","useful":2,"cool":1},"xMcYhOtMdDfoJJT3H-peuQ":{"text":"BEST food I've had yet in NOLA. Reminds me of a place I would typically find in SF or Napa","useful":0,"cool":0},"OK5zUCB3Z6ZGIseiE72uyA":{"text":"It's pretty difficult to find high quality food in the Quarter and this establishment real","useful":0,"cool":0},"LjEQ-2L_Lqn3OJkCyYUV0w":{"text":"What a great little place. The food was awesome and the ambiance is great. The cheese plat","useful":0,"cool":0},"MzeXL5MdPNfKxNIQiwufhQ":{"text":"This place was brilliant! We went here for our first night in New Orleans and were so impr","useful":1,"cool":1},"11ljfUfyUYOabHCvcvSVjw":{"text":"We enjoyed not one, but two excellent meals with A1 service.  The fish and the shrimp dish","useful":0,"cool":0},"4ALXWkBuEPg6Phsm81-ngw":{"text":"two words: BEEF CHEEKS.\n\nOkay, a few more words. I love love love this place. It's a nice ","useful":0,"cool":0},"aberMzULxMG-HB8Y3_tBqQ":{"text":"Darren served us at the bar, awesome ambiance in an old fashioned structure, dim lighting,","useful":0,"cool":0},"1_m1p_HGGuC7hYmxjnb-Uw":{"text":"Ok- here's the deal which captures this place:  you feel like a delicious crisp apple- shu","useful":1,"cool":0},"whvm-IY6eSMj9srykhB5Zg":{"text":"This restaurant was amazing! We werent sure where to eat one night in NOLA, and found Sylv","useful":1,"cool":0},"a6NLuiMrJ0XDl5GLgfL4RQ":{"text":"Really nice place with a friendly staff! The food was excellent but there aren't a lot of ","useful":0,"cool":0},"FDKbOXYQVxLE5_fUgMyezA":{"text":"Super yummy food in a really casual but intimate space. I ordered the shaved Brussels spro","useful":0,"cool":0},"4ITNgPylpFmDVhcRiDX8rQ":{"text":"These are the types of joints I favor...local, small, intimate, funky, and wonderful.  Syl","useful":2,"cool":0},"Epf8bfZhsTSP8kC6nnjIrA":{"text":"The Southern Anti-Pasta was absolutely fantastic. In fact, that and the chocolate pot de c","useful":1,"cool":0},"73Ga5MXnJGOsnctAN0Dmyg":{"text":"Only stopped in for a sazerac, so four stars for that!  My friend also enjoyed her omelett","useful":0,"cool":0},"JSf36KBdNoqI_i2xSoNKyQ":{"text":"Some girlfriends and I came in and had dinner at the bar - we loved it!! Great food, wonde","useful":0,"cool":0},"X-4hIJigL81saQbItDaIcw":{"text":"Food was excellent but the portions were tiny. I come from Miami and I'm used to restauran","useful":0,"cool":0},"d0xTJCUzBUYtrEQT7ba2hQ":{"text":"Perfect spot for a romantic dinner just steps from Jackson Square. The entrance is in the ","useful":1,"cool":0},"AzRpJf5x09pAYcMbWL3EBg":{"text":"Go. Eat. Here. I'm serious, do not miss the opportunity and make a damn reservation if you","useful":1,"cool":1},"P7nlGHn5QWBvDFJvCW2OjA":{"text":"Oh. My. Gosh. This place is an absolute must-try if you're looking to take a break from re","useful":1,"cool":0},"XJ9VszXNPfGxP8Ig6UgZ5A":{"text":"A couple tips: \n1. make reservations on open table - recommend sitting outside (but near t","useful":1,"cool":0},"2K91hlPtc4DvmNk42nEPOQ":{"text":"Yuminess!\nHad the Summer Squash Griddle Cakes with Sheep's milk ricotta, Speck, tomato-jal","useful":0,"cool":0},"hES3rSfJhwrV6sNuYI2xLA":{"text":"It's very dimly lit, so at night you could easily walk by and think it was closed and the ","useful":0,"cool":0},"pHbvNIZMenS8r2G4B_BuUA":{"text":"The wait staff should stop drinking shots while on duty. Extremely unprofessional. Our wai","useful":0,"cool":0},"YbNjPaoOq8ijTPBCaJ_nqg":{"text":"Excellent drinks bartenders and the food was great! Veal Sweet Breads and fried egg plant.","useful":0,"cool":0},"f63dduDoIftbmcNL8OrvWw":{"text":"Found this little gem after the bartender at our hotel suggested it. The entrance is throu","useful":0,"cool":0},"v7354b2_BOlx_LqSbqDvrA":{"text":"Allow me to explain why Sylvain's is our favorite restaurant in NOLA and why I pray every ","useful":0,"cool":1},"aagcz0wbSxgvtnILQghJhA":{"text":"Amazing bar- get the home made coke with Jameson. Every item on the menu has been ridiculo","useful":0,"cool":0},"_PwfqXZtR_wc6Jkkpp4FQg":{"text":"Another stylish, fun place to eat in the quarter. Nice atmosphere with small dining area n","useful":1,"cool":1},"3OXoFdjurUr6GDacfafwcQ":{"text":"LOVE THIS PLACE\n\nOverall (9.5/10) - GO HERE\nFood (9/10) - mmmmmmm tasty\nDrinks (9.5/10)\nAt","useful":3,"cool":0},"npsER5zeR_aJFEizlKKxZA":{"text":"The only reason I don't give this five stars is the staff moves a littler slower than I pr","useful":0,"cool":0},"9MmN5z_ejKW2tGBO7MudIA":{"text":"On our last night in the city we found this gem through yelp. So glad we ate here. For sta","useful":0,"cool":0},"MJlOea-YaOop6vpJ1ANvyw":{"text":"Exceptional food, service & atmosphere. From the cobia crudo, to the sweetbreads, shaved B","useful":0,"cool":0},"uEi1vu6226JZg5qmCFHzlQ":{"text":"I had the pleasure of having had drinks here before, but never had the pleasure of eating ","useful":9,"cool":5},"eDryfBc1qA2CC4ByDPzwUQ":{"text":"A really cool place with a lovely back garden, where we dined. The weather was perfect whi","useful":0,"cool":0},"Up977hnIZ9Dv2KjlLYpPZw":{"text":"Call Gordon Ramsay, this place is a nightmare.\n\nTo everyone working on the night of Octobe","useful":0,"cool":0},"BKtfoT2VgesRNTYw0_eCaA":{"text":"So delicious. Delightful ambiance, heavenly cocktails, and every dish was amazing. The Cor","useful":0,"cool":0},"9tW4r96ODIMOr1jEnF1tnA":{"text":"We drank here last year and really enjoyed the unique cocktails. It was nice to walk in la","useful":1,"cool":0},"-PtekeTmM3f_4LN8MMh8OA":{"text":"Atmosphere is great, especially for a couple or even an 8 or more group. However, the food","useful":0,"cool":0},"8dhPwJ-4ye6f8KQIF3iYuQ":{"text":"My Gf and I had dinner here on Valentine's day, it was a perfect setting for the occasion.","useful":0,"cool":0},"V7mzAK4X4H9I-uTWRViJqA":{"text":"I was really excited to try this place out, since it was on a \"best of\" list for French qu","useful":1,"cool":0},"oJZpSL4HEI_MSmtDSkVMUQ":{"text":"Dinner there was a great experience.  Our server was very helpful with all of our selectio","useful":0,"cool":0},"4Qko8AsDFFpmat3Id6TknA":{"text":"I was really disappointed in the experience at Sylvain. We arrived to the restaurant for a","useful":0,"cool":0},"i11b4vIx4VWj8eKwyhRONA":{"text":"I was very happy. The drinks were delicious, shaved Brussels sprouts salad was amazing. Te","useful":0,"cool":0},"92pByxwhTLO3sSasl3EhYg":{"text":"Nice Gastrobar setting. Excellent selection for drinks.","useful":0,"cool":0},"1Rc2XenAMhFgUbcN8k3Ytg":{"text":"Strange menu, the bloody Mary's were not good hardly any alcohol... I asked for chicken on","useful":1,"cool":0},"DYUfjXAPAKBg-4-GnQG3fg":{"text":"This little gem can be a hard find but worth the wait. \n\nWe had a large group and everyone","useful":0,"cool":0},"1p-COyCS0oiTDAyRZ5bAkQ":{"text":"Poor service but above average food. Very nice ambiance.  I wouldn't go back based upon al","useful":1,"cool":0},"hxymTAhHIvotJenM8EnHjQ":{"text":"Great food and service. Had a very pleasant night. Though we did not have a reservation, w","useful":1,"cool":0},"9izS_iAPVid4T4nnbm8BKQ":{"text":"Upon recommendation from a friend and also a glimpse on Munchies about this restaurant me ","useful":1,"cool":0},"mGkjuphGgCrBoHFJLcHYXg":{"text":"Good food and service. They have a small quint sitting area out back with a relaxing nice ","useful":0,"cool":0},"tzjUhUdcrOkdX119HCXumg":{"text":"This gastropub came highly recommended, not sure why. My chicken sandwich was dry and not ","useful":0,"cool":0},"OxQRF5yB4Lomc4hBQy2-xQ":{"text":"Yum. Yum. Went to this great brunch spot in the French Quarter on my last day in New Orlea","useful":0,"cool":0},"1bZ5otu_kxUrEd0opdjXWw":{"text":"So my experience here was not good at all.  So poorl that I am pausing my vacation in New ","useful":0,"cool":0},"c5CAELYV4q5B5oYygjFzDw":{"text":"Good solid place for dinner. Intimate and good for small groups or a date. I got the beef ","useful":0,"cool":0},"BXJLsqaT8IVNDHcvd8W-yg":{"text":"What a disaster! We were seated in the back patio next to what appeared to be an air condi","useful":1,"cool":0},"171HogBKId3w1BoMlzxWWw":{"text":"While the menu is full of exciting options, we tried the chicken sandwich, pork chops, bur","useful":0,"cool":0},"YrRfUqCU5L5YCOIERK5cCA":{"text":"This was an amazingly lucky find! Our original plan was to go on the steamboat cruise for ","useful":0,"cool":0},"e7oXSqEqSvmPNM-KDtfiCg":{"text":"Great food and drinks, accompanied by outstanding service. Busy location near Jackson Squa","useful":0,"cool":0},"Tz0uGUtIpXlSyZXsQjKJ-w":{"text":"Sylvain has great atmosphere if they have room request outside sitting, great place to tak","useful":0,"cool":0},"W7JhrATpjkn1Pz8xDt0AjA":{"text":"Awesome! A lot of charm and character! Artistic food, feels like some of those European Mi","useful":0,"cool":0},"0b5dwYE7t3Aepr5SLfl2sQ":{"text":"One of my favorite places to go when I visit Nola. Go see Gillian for the best drinks in t","useful":0,"cool":0},"G-RSat0T4Zi4Bxo9hckTtA":{"text":"Must-have pork shoulder on grits with braised collards and bacon, just like everybody says","useful":0,"cool":0},"vv6RVnQ5d2lyFqELeOBOkA":{"text":"Very tasty.  Brussel sprout salad was very refreshing.  The pan fried pork shoulder was go","useful":0,"cool":0},"qdEL4ZwoOHbO72sewkkE8A":{"text":"I went with my girlfriend to Sylvain for dinner. We really appreciated the food but we wer","useful":0,"cool":0},"dB9YwI3mwe97XDCEu4FtfA":{"text":"After stopping at some other \"standard tourist\" restaurants only to be turned away because","useful":0,"cool":0},"GQJVZHfqgmu2IiNrIPuoqA":{"text":"Fish was undercooked. No apologies and in fact was told \"that's how the chef intended it.\"","useful":1,"cool":0},"kcXipNrbGQMT28mklSV3Yg":{"text":"Eleanor was a wonderful waitress.  Dennis's sidecar was the best sidecar I've ever had (Sa","useful":1,"cool":0},"tG5GiqDckQZvXOJTkbe0Xw":{"text":"Confession: I came here two nights in a row. Who does that in NOLA? You have to be insane.","useful":4,"cool":1},"gfqz1X-1czLHrJ3Xebqi7A":{"text":"came here for birthday lunch and split a great burger and a pretty good chicken sandwich. ","useful":1,"cool":0},"4BYrRnKAd9HF50W1Rzif-Q":{"text":"Pretty amazing food - great service (Ms.Dawn!) the pork is a must have. Beef cheeks just a","useful":1,"cool":1},"o1lHOa9EgB01qvFJmpog2A":{"text":"The food and drinks were really good and the service was great. They called to check on ou","useful":0,"cool":0},"oue5j-CaluDrS8l8KlPJKA":{"text":"One of the best restaurant in NOLA. The restaurant in understated, with a hole in the wall","useful":0,"cool":0},"JMA2IZ64D8WsxHwiZauBjA":{"text":"We spent 5 days in NOLA eating and had reservations for every night but Friday.  Wandering","useful":0,"cool":0},"TFPTM2p6QWI23v5xk4awDw":{"text":"An eclectic mix of cuisines make this New Orleans gastropub a worthy stop if you are in th","useful":0,"cool":0},"N6Y1rKzgeo6UYgCUHiBv3Q":{"text":"We had an absolutely delicious meal. We arrived without reservations and were immediately ","useful":2,"cool":1},"DJuQVaDfscz80Sp_RuXVvQ":{"text":"I had both the fried eggplant and bolognese, both were nothing to write home about. Don't ","useful":0,"cool":0},"fVa1D7CSn5rZzxNk1xLpHQ":{"text":"Absolutely amazing food.\nHas the beef cheeks .... to die for!\nThe only thing I didn't like","useful":0,"cool":0},"pPoF_LGTFCFiEZICI7QymA":{"text":"Pleasant little place - we were there Halloween night so fun vibe with people in costume c","useful":0,"cool":0},"QXPRYVdSi4NZOZapF6c6uA":{"text":"This individual who claims to be the 'owner' of this place actually made a great effort to","useful":5,"cool":2},"3hbzLJ_waZ5UY1oolanZHA":{"text":"The BF & I had drinks at Sylvain's bar on our last night in NOLA.  In addition to the awes","useful":0,"cool":0},"vc_qGSAzz0c0w6Lhuie2FA":{"text":"This restaurant is great-looking-- its has an Anthropologie-esque feeling, lots of distres","useful":0,"cool":0},"3j18-NnnGl3ZnouWWI1u7w":{"text":"I had the most amazing NO experience in this place!!! My friend from Korea also loved it. ","useful":0,"cool":0},"Dxq3ulSySj5o0EOvdIBshA":{"text":"Wish I could give a higher rating but I wouldn't know. You see, I have a terrible cold. St","useful":0,"cool":0},"A5Di9PSVwlIurr2bTxEW7g":{"text":"Such a lovely little place if you can manage to grab a table. We sat at the bar and had tw","useful":1,"cool":0},"EBkKq-Hlq7hg6cAtt5sZ9A":{"text":"Amazing staff and management, great good, and romantic ambiance. Seating is a little tight","useful":0,"cool":0},"1OVs68bzq4hRQU61SpzHSg":{"text":"Visited Sylvain for the first time on 2/15, on a weekend trip to New Orleans. Stumbled upo","useful":2,"cool":1},"8WvuBvV2uBMyH8gg1d1Bpw":{"text":"Ate there last night with my husband.  It was really good.  The food and bar is outstandin","useful":0,"cool":0},"7i_Q1lxrSb8Ums5iWy2qSQ":{"text":"So this is an update! ... Received a response from the manager asking for us to give anoth","useful":1,"cool":1},"9wLpGBWS8TmFAvKo067IRw":{"text":"Food was great, atmosphere was a nice change from stuffy old guard New Orleans restaurants","useful":0,"cool":0},"CqCj6zX2gDhKeHp98Btt_w":{"text":"This review is for drinks only, though the food looked really good. They have a really ext","useful":1,"cool":1},"Xq8yDhkt5x7w3VAog-73ZQ":{"text":"Food was great but the wait was insane. I shouldn't have to wait an hour for my meal!","useful":0,"cool":0},"Ix8HO4WMDSJpAbeiVAqDWA":{"text":"Fun atmosphere that is dimly lit inside with candles at each table. Between 4 of us we spl","useful":0,"cool":0},"40PJdwRqV_XJU6t-Uhcnjg":{"text":"A historic building in the French Quarter. There was a lovely lush courtyard for dining bu","useful":0,"cool":0},"-dyW9sHGZqt1rG6jwIhadg":{"text":"If you're looking to take a break from New Orleans traditional food, this restaurant proba","useful":0,"cool":0},"NOephlVs-QzSuFKQDvhpaw":{"text":"What else can anyone say about the tender beef cheeks.  Homemade pasta excellent and stood","useful":1,"cool":1},"f_k2Se8KXzbyfh9J3CFO6w":{"text":"Brilliant food, at a really amazing price given the quality. We ended up with 11pm reserva","useful":0,"cool":0},"dCHIfquBs0V77P05QgsvHg":{"text":"Just came to the bar mid day and wow super impressed! Great craft cocktails and local brew","useful":2,"cool":1},"T3sZo5ZEAvHqs1hKvlnIIQ":{"text":"Went here for lunch on my last day in New Orleans last month.  It's a hop, skip and jump f","useful":0,"cool":0},"VnbA-zsofJzW3p7qpoIBDg":{"text":"Super fun place. Dark inside, loud fun music.  Fantastic food. Props to the chef for prepa","useful":0,"cool":1},"Ty4az296VJ36pEt3zi8X5w":{"text":"My husband and I dined here on a Monday night (nice that they are open!) I found them on y","useful":1,"cool":1},"K2RxtHRcxrCU3tHOPhb90w":{"text":"Sylvain was a great experience. My fiancee and I were in town only for the evening. They s","useful":0,"cool":0},"RnV9s1Kj-SVYoTaleVrtJQ":{"text":"We absolutely loved Sylvain. The atmosphere is just lovely. Warm, candlelit glow, comforta","useful":0,"cool":0},"aUXrrRbFwRInaX0qnojYFw":{"text":"Cool looking place but weak food and service at brunch. The spilt pea cake was interesting","useful":0,"cool":0},"o1HNVsmpoKkQPmfSLVXqCw":{"text":"Yasssssss charcuterie board. Yas yas yas. \n\nAlso everything else was delicious. The shrimp","useful":1,"cool":0},"Md_RKuKRMFZM7EJiJydhhw":{"text":"Charming. Delicious cuisine, lovely ambiance, kind and thoughtful staff. I used to live ar","useful":0,"cool":0},"O_po7qEf8teVTeK35EMjog":{"text":"Ordered the fish and the burger. They seemed confused by my friend's dietary restrictions,","useful":0,"cool":0},"jcRlByTWZ03pLoX6M8a5zA":{"text":"Folks, I am not one to write reviews, this is only my 2nd one but I am compelled to write ","useful":0,"cool":0},"Kz10Og2rdbVUsCrqIKIp2Q":{"text":"Lovely meal in the French Quarter. A cut above many of the touristy, fried-everything plac","useful":2,"cool":0},"Aq7-HnFWnPM8tQvr2rUnAQ":{"text":"This is a magical restaurant that would be pretty easy to bypass if you were just in a wan","useful":1,"cool":0},"weAqDA4bCwX1GeYo-BiGRQ":{"text":"Our last meal in NOLA was at Sylvain.  We had passed by it the night before, but the insid","useful":1,"cool":1},"jzgc_nntfKKToxKi39ZkFA":{"text":"My friend and I ate at Sylvain on a Monday, and I'd say it's one of the best restaurants w","useful":0,"cool":0},"uRgqxpK4vYtIenvqVVjcZA":{"text":"I really wanted to like this restaurant but I was underwhelmed.  There are just so many gr","useful":0,"cool":0},"uIIKQa1LChzeW9c0osoeBg":{"text":"This is my go to spot in N.O. Consistently great menu. Solid craft cocktail list. And a bt","useful":0,"cool":0},"3LjHe2tI0Hbq-l54AW3uDA":{"text":"My wife and I came here looking for a romantic and delicious ending to our weekend visit t","useful":0,"cool":0},"NaMt3Luk0HdS8wOkOYqwOA":{"text":"While the food was adequate the atmosphere was terrible. It was ridiculously dark inside t","useful":0,"cool":0},"IX1rrOAaiTI86p5keYviig":{"text":"Very simple and elegant. A nice departure from creole heavy restaurants and steakhouses th","useful":1,"cool":0},"uhrCML_A1wxisZLb0h-OTg":{"text":"There are so many touristy trap restaurants in the Quarter that serve bad, overpriced food","useful":3,"cool":0},"XX7HOM5FGfMDnD-i7CTS5g":{"text":"Absolutely wonderful. It made for a romantic last night out while on holiday in New Orlean","useful":2,"cool":1},"QWS-F0pGU-P27PLL0VEOIw":{"text":"Loved it. Great vibe. Reservations are highly recommended yet we got a spot at the bar rig","useful":2,"cool":1},"mQyZZ61TEYHngL7TbWvkVA":{"text":"Sylvain was a wonderful experience. Hidden down a little alley is the restaurant which ope","useful":1,"cool":1},"nB28WTEN1yPiQ-GnhMK6FA":{"text":"CRAZY DELISH!  Make a reservation, it's very easy on open table.com. Our waitress Dawn was","useful":0,"cool":0},"auijefv2fnVSFligLZdLYw":{"text":"We went because it had what looked like a decent Brussel sprouts salad (we subsisted for t","useful":0,"cool":0},"kqS7UZ3SshZml-zDRGycHw":{"text":"Man it was awesome! Ellie and Shawn were great hosts, and the food was amazing as well. Ha","useful":0,"cool":0},"ve5hkWntTLjY40SUMNLDbA":{"text":"The fish of the day was delicious and the service superb. Highly recommend this place!","useful":1,"cool":1},"9FqPy_1aAG4xOINRKnfAyQ":{"text":"Our last night in New Orleans we had the best meal of the trip. The artisan cheese platter","useful":0,"cool":0},"qR0NchckppoOrzVJUCNEcQ":{"text":"Every rose has its thorn. And the thorn of New Orleans is Sylvain. \n\nWe made a reservation","useful":3,"cool":0},"91GipAym8aTvfCCFy6SzDA":{"text":"Such good food and great ambiance! You can literally close your eyes and point to anything","useful":0,"cool":0},"m6-5jcg_AxnZYgQBQMWrdA":{"text":"Top notch atmosphere, service and food make this a must-do dining experience. We loved tha","useful":0,"cool":0},"YSgcMevekruvRPn2XcL1ZA":{"text":"Place is really cozy and laid back. It has an indoor and patio area. The food was deliciou","useful":0,"cool":0},"O0pMEKQLTvFro-VAZM92-g":{"text":"Super cute place to dine. The shaved brussel sprout salad and the fried chicken sandwich w","useful":0,"cool":0},"swnWuDA6iTIroW7Tmg7jpQ":{"text":"By far the best meal I had in a long weekend in the city (and I had some other very good m","useful":0,"cool":0},"nN12Xt_3ZBTlfyTodB8URg":{"text":"A very romantic spot, and a great way to end our trip to New Orleans! Their restaurant fee","useful":1,"cool":0},"AacnVj3ohwUcpwkt5PotrA":{"text":"Excellent cocktails and service! Eleanor was our waitress (she was superbly sweet), was ac","useful":1,"cool":0},"qQZ4xMd6veK2Ohm6mcuUWA":{"text":"Beautiful space.","useful":0,"cool":0},"abZ--RTMCXK1LiH-_hxvJQ":{"text":"Make a reservation. They talk to you like a second class citizen if you don't have one.\n\nA","useful":2,"cool":1},"Q1XeNbhGmFdgGyWwXTzvKw":{"text":"Thank you Sylvain for a fabulous dinner and experience. Here for business and dinning solo","useful":0,"cool":0},"4FQfoeLWz-tPq6MVey_VRw":{"text":"If I could do 4.5, I would.  We will definitely be back next time in NOLA.  But have to gi","useful":0,"cool":0},"0QJ6TcbHufg9PXOvc1WGAg":{"text":"Always a great brunch and a cool intimate vibe for evening drinks as well. A+ French fries","useful":0,"cool":0},"6dJcx9nvN_vkKGA6-cgfUQ":{"text":"My husband and I highly recommend this place!  We had an amazing dinner date here during o","useful":0,"cool":0},"5CGVg8q-IDswQONvWvEVwg":{"text":"Really cute chill place! Food was great! Service was great! They have a nice patio area in","useful":0,"cool":0},"CMpeI_7Wr6FwPgCiHi-2_A":{"text":"I love the ambiance which is why I was so tempted to try this restaurant after walking by.","useful":0,"cool":0},"RMnKn1jAPyQdCR5bU39qpg":{"text":"Excellent bottle of rose. Beet bruschetta was on creamy goat cheese and perfect. Pappardel","useful":1,"cool":0},"raLJWgaHTbSTSMsGmPbjTQ":{"text":"One of our best meals in NOLA, and that is saying something!  We arrived at 7 on a Saturda","useful":0,"cool":0},"kDZGizvxT6Z8K0-uuhNHAw":{"text":"From the moment I walked up to the host, I knew this was going to be a very pleasant night","useful":0,"cool":0},"DJPGX14EVKFXhiU0mkJOhw":{"text":"Beef cheeks, where have you been all my life?  \n\nIn New Orleans for only one night, I coul","useful":1,"cool":0},"FLO8mQD8opu5vJyS8QT3nA":{"text":"I read a lot of great articles about Sylvain, so I was excited to try the gastropub. The s","useful":0,"cool":0},"pOQoottxLWiGA8KnMzqJ9Q":{"text":"Sylvain is the kind of bar/resto you'd be happy to come across in any city. It's hip, yet ","useful":1,"cool":0},"s-cIkbzDkxaWORjk8YTnrg":{"text":"Went to Sylvain where we met Kodi, amazing, bright, energetic eager to help. Presented all","useful":0,"cool":0},"metWrUkjIOIz2kBHrfxR1A":{"text":"My least favorite place for sure. The food was okay.  It was pretty quiet for a Saturday m","useful":0,"cool":0},"YgIOz-f0tCAmRNxM_DL_gA":{"text":"Great place.  The room is very dark, which was nice and cozy.\n\nWe came here because a frie","useful":2,"cool":0},"ySag-p-IZwtyGydSI6XarQ":{"text":"Place is cute and rustic outside and contemporary inside. Service was good. Food was also ","useful":0,"cool":0},"jRZQk2b2TlXJzDX52neCFA":{"text":"Great food and service.  Unfortunately, we were seated at a table out on the \"patio\" and t","useful":1,"cool":0},"P6Zb_GCbQbjg7JVkwv35Zw":{"text":"I'd like to give this place five stars. Terrific setting and atmosphere, and the staff wer","useful":0,"cool":0},"bfmXf18ueooeTBKjr-Hf7A":{"text":"Meals here are always a culinary delight! Dinners are wonderful but BRUNCH is a must! You ","useful":0,"cool":0},"YphfWfGe2NGnPEAWBIiESQ":{"text":"Adorable place and adorbs staff too.  Perfect for a weekend brunch with your ladies or you","useful":3,"cool":2},"OIRv9yJmLtAJzn-M9KApbg":{"text":"Favorite meal on our trip to New Orleans. Such a wonderful little gem in the French Quarte","useful":0,"cool":0},"DBcgU5GZQ5nS_MlrhfWfSA":{"text":"Very nice, laid back little restaurant with great food. We got into NOLA tues eve and made","useful":0,"cool":0},"A3Vp-QhCwIhFcl-malAbjA":{"text":"Tasty food, nice gastropub atmosphere. The entrance is hidden down a dark alley, which add","useful":1,"cool":1},"iN_SdtqeH-lduClkn4m7cg":{"text":"Wow where do I start, from the ambience, to the great service and amazing food, we had a w","useful":0,"cool":0},"qqGihepv1FStuMnARahxhA":{"text":"This place is a find, it is a little off the beaten path but worth it,  It had a fun, casu","useful":0,"cool":0},"N38hF3qty1rMPo-iPQnp8g":{"text":"Five of us hungry young burly men, partook in the beastery that is the pork shoulder, grit","useful":0,"cool":0},"xW5VEpXjcPi7QzRvrz013w":{"text":"Pretty interior and friendly staff.  The pork shoulder is amazing, so good we ate there tw","useful":2,"cool":0},"9cIa13L2kpCV2yfIBUWiKg":{"text":"One of our new favorite places in NO!  Great overall dining experience...cozy decor and bo","useful":1,"cool":0},"36MKmajr0Jcx5YMzjE16ag":{"text":"We had the beef belly,it was awesome. The entrees were also very tasty. The only knock was","useful":0,"cool":0},"NKDSnq5qdh-DPSBvRgohag":{"text":"I sat at the bar and had the shrimp and clams.  Friendly, attentive service.  Flavor was r","useful":0,"cool":0},"m3-u1Kv5ZT2ZK69goDRB2A":{"text":"Definitely the best food we've had so far in NOLA. The courtyard was quite pretty, loved a","useful":0,"cool":0},"TuSSbKenfqnpBkaGERyX_g":{"text":"Good service, not overly friendly, but very solid. Mushroom Brushcetta wasn't very good. L","useful":0,"cool":0},"ZRBbeUMrHRbCRaeyyXAAcw":{"text":"The aesthetic is really nice. Small tables make it a personal experience. We ordered two b","useful":1,"cool":0},"3QZSo8qV2EkhldFyd-qHPQ":{"text":"We just happened to walk by looking for a place to eat and were more than happy with our f","useful":0,"cool":0},"drS3rqg5sFVqs_7Ktfvilw":{"text":"Unique menu. Try Hanger Steak, that was juicy and delicious. Salads are also good. They ha","useful":0,"cool":0},"kIsix_-5ZrZ3CtdBo5fGLg":{"text":"Cool atmosphere with a great patio. We got drinks at the bar and split a chicken sandwich ","useful":0,"cool":0},"6T8ESq8D6vmKFFWAnW4SZw":{"text":"Slyvain is a super cool and nice place in the French Quarters.\n\nWe came here with a group ","useful":0,"cool":0},"oW96X53Rt9c85bBtTVyAzw":{"text":"This place was awesome!  Its a bit hard to find but you will not be disappointed.  We didn","useful":1,"cool":0},"xM8ghkBMSdSqZM25RLTYig":{"text":"This place is fantastic. I'm from Chicago visiting and my friend moved to New Orleans and ","useful":3,"cool":1},"t_5gDwR2r-0Si-owIcomcw":{"text":"Of the three menu items I had, I loved them all.\n\nFish Fritters --fish of the day was drum","useful":2,"cool":0},"MoOEsUXv0zUpeDSUsUNCRw":{"text":"Food was decent but not remarkable.   I had the liver crustinis and the brussel sprout sal","useful":1,"cool":0},"kjUfpsrptX5c-LM2JWgHDg":{"text":"Nice little place in the quarter.  I've been several times and it is always a solid choice","useful":0,"cool":0},"QFyY65hlaBmr6pM4pegdDw":{"text":"One of the best dinners I had in NOLA on my stay. \nWe had the mushroom appetizer- it was v","useful":0,"cool":0},"OBbMDaVlB74HXPUmvH5mcg":{"text":"April 2014: \nSo I snuck back in here a few weekends ago, paying cash for fear I'd be recog","useful":3,"cool":0},"mqQWIvuY_7k5JIfbBIA-lA":{"text":"Long over due Sylvain.  My apologies.\n\nNot everything in the quarter is big beers, grenade","useful":5,"cool":7},"qiz5g42wYnSrOWxsNdVp0g":{"text":"The beet bruschetta was tasty. This is a small restaurant with a pleasant staff and intere","useful":0,"cool":0},"fz9lcjsXIJlzLrj9wiETpw":{"text":"Sylvain is a great lower cost option buried amongst lots of fancy French Quarter places.  ","useful":0,"cool":0},"BFsepM34smObkKfAAyQ0Rw":{"text":"I saw a picture of a burger from this place that looked so delicious that I felt that this","useful":3,"cool":1},"XI98NKkchrXiC5gZwR0rjQ":{"text":"Highly recommend.  The Pork Milanese was absolutely delicious!!! Can't wait to go back.","useful":0,"cool":0},"WEmwYti1R3ualH1pXBytVg":{"text":"I usually don't give any restaurant such a poor rating but this was well deserved. I kept ","useful":0,"cool":0},"z-qBKZ9egKj4l3G-EgQHww":{"text":"The champagne cocktail with lavender is probably my favorite in the city. The burger is ve","useful":0,"cool":0},"49H60OO56VsCyTwvtX3Iwg":{"text":"food was good enough, but noise level was atrocious - worst I have ever encountered....no ","useful":0,"cool":0},"_RUyi1cn-WafcLZQgv1iAg":{"text":"This is a must try while in New Orleans.  Really good food.  Small restaurant so definitel","useful":0,"cool":0},"YARPXDcGbbWdGO6TmcUowQ":{"text":"Not a false bite! Had the burger and the fish special which was indescribably delicious wi","useful":0,"cool":0},"K0ayxai8wZV4Yolcfdjzdw":{"text":"Pricey and a bit overrated. Service was relatively slow and the food was a bit disappointi","useful":0,"cool":0},"L7s9elt_PBw47V2AmYklEA":{"text":"The food was good, but the French Quarter is full of good food. There are a half dozen pla","useful":0,"cool":0},"HXmJCyA5E37WIzyom9cZDg":{"text":"Wife and I in NOLA to celebrate her BD and we figured we'd try this place on our last nigh","useful":0,"cool":0},"U9GgD-vErPVkf2pXHrMDeA":{"text":"Second time here for lunch and it's been amazing both times. Food is delicious and the pla","useful":0,"cool":0},"VB7Wg70beX06LeufYpUY3A":{"text":"Got fish fritters bc the waitress/bartender suggested them but I thought they were gross. ","useful":0,"cool":0},"6bX2r-ZtAbFF_tMZfmz7Vw":{"text":"While in New Orleans a few weeks ago, we were having cocktails in a local pub frequented b","useful":1,"cool":0},"ScKSlFrRvKVKrTYaU0acUQ":{"text":"Relaxing and cool ambiance, kind of hipster feel. I went for lunch with a couple people ba","useful":0,"cool":0},"r9PJyLWktWOio7xBAiI1mg":{"text":"4 star food\n5 star staff\n\nThis place is definitely worth checking out.  Limited menu, grea","useful":1,"cool":0},"G4E4M7FtGSwwgeocyRSy8A":{"text":"It's decent. I'm not as crazy about it as a lot of the people that I've known that have ea","useful":1,"cool":1},"ZIxJ8opTY4ZT6WUHb9CrQQ":{"text":"Ok, so the number one reason why I wanted to eat here was that the name of this place soun","useful":0,"cool":0},"NM4dFVgQQUbFZorvMYTh7A":{"text":"Great location, ambiance, staff. Wife had drum over steamed rice with veggies; fish was fl","useful":0,"cool":0},"8FZ9HqsvkgrAYuONPTBl7Q":{"text":"Great food, wonderful atmosphere, very friendly servers.  Everything was really nice a rel","useful":0,"cool":0},"ly96BkpxwvpN434IEbzLDw":{"text":"The place just doesn't quite gel...the dishes seem unfocused...a New Orleanian place tryin","useful":0,"cool":0},"Y_H0qhIa6HgE7WYJgV80Dw":{"text":"Came here for a drink and ended up ordering food. I ordered the pork shoulder dish. Delici","useful":0,"cool":0},"41fjGo5M-tUXeTsvJawfTg":{"text":"The food was great, but we were disappointed with the service. We were seated and the host","useful":0,"cool":0},"sU41EvQDHZ1ew_5tOhzq-g":{"text":"This was our best experience in New Orleans. We ventured from the recommendations from fri","useful":0,"cool":0},"1vrgS2FPpIaJivdvpv3-hg":{"text":"My friend and I recently had lunch there after running the Rock N Roll New Orleans half ma","useful":0,"cool":0},"IC41HlojNKkp4Ztar-8XSQ":{"text":"One of the best dinners I had while in New Orleans.  This little gem is easy to miss and i","useful":0,"cool":0},"ExRHMwUWD-96bHb3bWjYOg":{"text":"I love there food and drinks and everything that i like there cause there food is so aweso","useful":0,"cool":0},"u34Lo23J8z3py5jw1rL36Q":{"text":"The place has nice rustic charm, kind of loud, friendly staff. We had the skirt steak whic","useful":0,"cool":0},"dO0ANobxrs2f6S8CRt_cEw":{"text":"These guys know their cocktails! I really enjoyed the pork shoulder and grits, my eggs wer","useful":0,"cool":1},"_MZZB5xB1ka_CGC5TktkFg":{"text":"Among the best meals we had in New Orleans. We went for dinner (without a reservation) at ","useful":1,"cool":0},"O77-vv3JHAcdEk9Djqk9zw":{"text":"I had my first Sylvains experience and I can't wait to go back. The food was great and our","useful":1,"cool":2},"k5JTV7EVa0TBTGrCF3_Trg":{"text":"It's been said before--but what a great place! Very close to Jackson Square, cozy, afforda","useful":0,"cool":0},"GfElr-477ZgsdS3OZXXKPQ":{"text":"Thank you Yelpers for once again recommending a fabulous place.  I was tired after traveli","useful":0,"cool":0},"UbdDytUh0kFkt1cOr9F6AQ":{"text":"Small gastropub in the french quarter. Intimate feel with great outdoor courtyard seating.","useful":1,"cool":0},"P-lW5iposJZoNC0hH9DBYQ":{"text":"Solid 4.5 star place. The pork belly was awesome. Wife had the fish of the day and I had t","useful":0,"cool":0},"ghGJtKhf97aAVA9lJrCPIw":{"text":"Went here second night in New Orleans. The drinks were great! My friend had the chicken sa","useful":1,"cool":1},"xDZSg8Va6gboV93MnASHJg":{"text":"Loved, loved, loved this place! The bar was a bit noisy so we got a table in the garden ou","useful":0,"cool":1},"AECu5OCNSrZIeq4Zc9Q7LA":{"text":"We love this place. We have eaten there many times.  The staff is friendly and the food is","useful":1,"cool":0},"pyPzDiLFe232K0F9arj8DQ":{"text":"After running a half marathon in New Orleans, I thought I would be munching on a po'boy an","useful":7,"cool":5},"ksxucnKlWrLMF8JLOviVCw":{"text":"Cool atmosphere. Quaint. Cheese plate awesome. Salads wonderful. Quail great. Crispy pork ","useful":0,"cool":0},"mu6HPEi26nD6gSyURz_8sw":{"text":"We ate here for a quick lunch while in town for the weekend. The service was pretty good, ","useful":0,"cool":0},"H1AwjWblovHzSvSWpeC_Jw":{"text":"Relative new restaurant in the French Quarter. Great space with an awesome patio. We were ","useful":0,"cool":0},"ivU3MlQro2m3uoZmTK9kgQ":{"text":"Amazing restaurant!!! Food was incredible (try the braised beef cheeks and the chicken san","useful":0,"cool":0},"AsYjxCwSEHp5eagq4U36qA":{"text":"This might be one of my first reviews where the decor pushed the rating up that 1/2 point ","useful":0,"cool":0},"nCvWhBIfNuTFqA7QKITVqw":{"text":"A beautiful start to a great day.  I was wandering around the Quarter on Barkus Sunday mor","useful":4,"cool":2},"8530MJ4rykwpnzvj771sDA":{"text":"Wow! Lilly and Ellie were great! They made cocktail samplers for us..so yummy and extraord","useful":0,"cool":0},"6nK_AKWy1qUp_pWo-ARVzw":{"text":"My boyfriend and I came here on a Saturday night for our anniversary dinner. It was a litt","useful":0,"cool":0},"Pi9tNIiYQmMvwl-ZlvgufQ":{"text":"Must eat here if you are at all in love with food. Our waitress made drink recommendations","useful":0,"cool":1},"g_dpevvxGmzgwk1ueMde_g":{"text":"Got the amazing chicken liver pate, shaved Brussels sprout salad with hazelnuts and then i","useful":1,"cool":0},"iC13zJPPRBlQW0EZvBJVDg":{"text":"\"Last Minute Late Night Find\"\n\nPopped by here on a whim as most restaurants near the quart","useful":0,"cool":0},"ljsy5DErG3nnmV_IXFOPbw":{"text":"Delicious food, friendly service, very loud - (stereo loud which drives crowd noise to a f","useful":0,"cool":0},"EQCpR7lzdVjCtqtJv-2G6Q":{"text":"Chicken pate was delicious and so were the scallops. A little too dark to bring your paren","useful":1,"cool":0},"1rkCsZpXgBTMPC0lvw4mDw":{"text":"We were definitely underwhelmed with Sylvain. The night kicked off with them not having ou","useful":1,"cool":0},"y8W2QS1AVgFcljRpXYh1KA":{"text":"The food was amazing. The service on the other hand was not. Our server was rude, slow, no","useful":0,"cool":0},"warh5oMesB-TC2j9u0HZbQ":{"text":"Absolutely blown away by this hidden gem. Small menu, but great variety with something for","useful":0,"cool":0},"btwh-EXc2bZGKi72-rksuQ":{"text":"Wow. Soooo tasty and a great ambiance.  I had the flat iron steak and it was fantastic. I ","useful":5,"cool":1},"eq_4pgahVkwaXKNrwVoiWg":{"text":"What a treat. \nThis place finally lived up to the \"New Orleans has good food\" hype that we","useful":0,"cool":0},"EH0Glp92iyyGPabhLNwKOw":{"text":"Great atmosphere, phenomenal staff. No complaints! Beef cheeks were great. Classic and hou","useful":0,"cool":0},"oSJ1YnBGQTgUf4ScZLA4JA":{"text":"This place is every bit as good as everyone says.  We had a later brunch here and it was p","useful":0,"cool":0},"hQp71xBQyljjHWM8XA_x1A":{"text":"What a great place! I've been to Sylvain twice and both times the service and food wonderf","useful":0,"cool":0},"UB9JHgFX9IsdjHYxMXkiww":{"text":"Sylvain is, in my humble opinion, the best place to eat in New Orleans. The drinks are ima","useful":2,"cool":1},"JS4aln9HijMb89iW76hVGA":{"text":"We tried coming here yesterday for brunch but the wait was an hour and a half.  Yep, we wa","useful":1,"cool":1},"uJzsWbehVBB8RkosIqis9g":{"text":"The atmosphere here is amazing. I love walking back around the back to get in. It looked l","useful":1,"cool":1},"TdsvKuIRbcQF-VVQbpFllg":{"text":"This place is a mind f**k. Fine dining meets dive bar. Appetizer: Veal Sweet Bread. Entree","useful":2,"cool":0},"CsRzXIgflqgdPthBt4EL4Q":{"text":"Terrific brunch. Excellent service. One recommendation to the staff: During the day, when ","useful":0,"cool":0},"xv432qIeQh_D7JoKqlL0Bg":{"text":"I have been hearing the hype about Sylvain for almost a year and finally made it there wit","useful":2,"cool":1},"BMh4n-vInnC814fB5LUK4w":{"text":"In short and sweet.  My expectations were high.  My food was bleh. Server in purple laces ","useful":0,"cool":0},"dgVTxuu9ieDvvDpRlgx7SA":{"text":"I have to say that the Braised Beef Cheeks are insane! It all just melts in your mouth. Po","useful":0,"cool":0},"zASvYUrXgYt8CWhrw2yDNg":{"text":"I honestly wasn't incredibly impressed by this place - I had a seriously good cocktail, bu","useful":0,"cool":0},"PEaUXkWmqE1uha41xDIEOA":{"text":"Thank you yelp universe for the fantastic reviews, my husband and I went to new Orleans fo","useful":0,"cool":0},"oCSeaE-FzX2iDnOe234YPA":{"text":"Great non tourist place in the heart of the French Quarter. Very cozy and quaint ambience ","useful":0,"cool":0},"AIwRdFosc9po_OpWuOMmrg":{"text":"Solid cocktails and wine. Friendly service at the bar (you should make a res if you want t","useful":1,"cool":1},"5Y6C8BXHxgDFrC8U1SqNDA":{"text":"Sylvain...strong food with weak service. We decided to tackle the quarter on Friday night.","useful":3,"cool":1},"YruT7IZyhNbjWwEdGnrldg":{"text":"full disclosure first:  i'd met many employees if not served them, most of (if not all of ","useful":2,"cool":2},"iBox2TxRcA1I27A8AsCjqA":{"text":"Great food but if you'd like to talk with the people at your table or see your food while ","useful":1,"cool":0},"ZWOVeGY8obVkTB-jvDHPOA":{"text":"Very cool setting with great cocktails. Enjoyed the fried eggplant and antipasti plate as ","useful":0,"cool":0},"m6rtsuTqkpHnCByq79aNLg":{"text":"A reviewer mentioned that they found the \"perfect\" dinner spot and I agree with that. Sylv","useful":0,"cool":0},"GFtdHr4lQ7IAWhPW-dtwEQ":{"text":"We initially stopped in for cocktails (which were great), but decided to get dinner. For V","useful":0,"cool":0},"LjZA85zfSetIqt7v80joIA":{"text":"Went here for a birthday dinner at the suggestion of other yelpers. So glad I did!  We wip","useful":2,"cool":2},"aGqfMBNe88v7mcoHIC_m3Q":{"text":"Love at first sight... This is my sentiments toward this place. Having been to Sylvain onl","useful":5,"cool":1},"1r2tXJfDSEDozWZ-me-EOA":{"text":"This place is perfect. We started a tradition of going here on our anniversary and we have","useful":0,"cool":0},"Tw9zte1Nu5zVBx1grpGK1A":{"text":"Of all the places I ate during my weekend in New Orleans, this was my favorite. Really coo","useful":0,"cool":1},"aR3K06N2FHwCs71XKO2NkQ":{"text":"We ate here our last night in the French Quarter based on Yelp reviews and the Times-Picay","useful":1,"cool":0},"0uORcI3FBdLqU621dJgnYg":{"text":"Love this New American restaurant, the ambience is lovely with the mood lighting the compl","useful":0,"cool":0},"dNN9i4noFCRNzquYjpl6Vw":{"text":"Charming, atmospheric place with attentive staff and innovative food.  In a former bordell","useful":1,"cool":0},"eRwuU0LhuGbwk-nGy91F-g":{"text":"Came here on mardi gras weekend - managed to get a table with no reservation.\n\nI ordered t","useful":0,"cool":0},"beeOROjeY8LiZ8mxJtwoZQ":{"text":"Showed up a couple minutes early for a reservation, but they got us seated quickly all the","useful":0,"cool":0},"Zujh5NcXTSQpVVKssPRsew":{"text":"Sylvain is a contemporary \"gastropub\" (I really dislike that term) in the French Quarter, ","useful":5,"cool":2},"PGobjr1ZR51I72xRqRBU5A":{"text":"Best brunch I've ever had. Usually brunch is disappointing, but egg dishes were extremely ","useful":0,"cool":0},"e2VhNwJyjjyS7Jz8LPAXjA":{"text":"We came here for dinner as a group of 8 on a Thursday night in July. \n\nI have to say, Sylv","useful":0,"cool":0},"p9xg1mYSWtEtIVr6VF9CzQ":{"text":"Was ok.  The food was nothing special, but not terrible.  The service was lackluster.  It ","useful":0,"cool":0},"snR-k7h3zis-zbF6pPh-TA":{"text":"Made a reservation and the table was ready on arrival. Staff was attentive and food yummy.","useful":0,"cool":0},"P_qAM0Gln0kgrsCwbqy5Fg":{"text":"I enjoy the atmosphere. It's hidden and has both nice indoor and outdoor seating options. ","useful":1,"cool":0},"lexE1pNTr1x7tuljsiqw9Q":{"text":"Beef cheek or pork shoulder the way to go. Service was tremendous similar to the experienc","useful":0,"cool":0},"0QdXHhBy4CZyywozRvUg2Q":{"text":"We had dinner at Sylvian on Monday night.  I thought Monday would be a bit quieter than ot","useful":2,"cool":0},"pHq0iDhpJ2DXlRITr37j0Q":{"text":"The menu is slim for vegetarians, but the couscous that accompanied the scallops I had wer","useful":4,"cool":3},"tTFwqUKYb6T-XvRSLUMa8g":{"text":"I was in New Orleans visiting last week and on Monday night my friends and I celebrated ou","useful":0,"cool":0},"u-pOpsYCYWVoRu8QRRTT4A":{"text":"A small restaurant with its entrance tucked in an alley, pretty unassuming but with well-e","useful":0,"cool":0},"ZxlJ72PeJTmcTD_UNcYHwQ":{"text":"Interesting menu and very good food and drinks. The courtyard looked charming but we sat i","useful":0,"cool":0},"AEXoHbDnoCXYn_a_qnCZ7A":{"text":"It's dark and super-duper slow. It's perfect for a date you don't want to rush through but","useful":0,"cool":0},"2WHzlglpOshR3zN0lfyEKw":{"text":"The dishes sounded interesting on the menu but the result was blasé. The descriptions were","useful":1,"cool":0},"oODmpcRD8iMZRlHMJf8M2g":{"text":"I really wanted to love this place but just didn't.  The food was average and overpriced a","useful":0,"cool":0},"T9VH8BLGCXH9177gk9OZmQ":{"text":"I'm still pretty stunned from my experience at Sylvain. Located in the heart of the French","useful":8,"cool":6},"sKn9NktoJ1-VKjTg23DxMg":{"text":"The food is generally good, portions are fairly large, and prices are somewhat reasonable.","useful":2,"cool":0},"NY7TmorYptuEh0DUhmrw1g":{"text":"Phenomenal cuisine...late at night! Prompt service, well-mixed cocktails, excellent select","useful":0,"cool":0},"J8F3C_sr2qtgX-gWU10yPA":{"text":"4/5 worth the wait (and wait you will).\n\nso the food is good, as evidenced by the other ma","useful":2,"cool":2},"6seQDRy72LWf4xV5GExmaw":{"text":"Oh my mmmmmmmm.\n\nStarted with the wagu beef. \nGreat taste with perfect compliments. I'm a ","useful":1,"cool":1},"GFSjLvjUpOnEcTtXuSCypQ":{"text":"A tasty new place! Excellent food and a much better beer list than most of the Quarter.","useful":0,"cool":0},"IshzEpkrD2KCCeojgpyxoQ":{"text":"Pros: Great patio, delicious food, very good service\nCon: AC noise in the patio, some limi","useful":1,"cool":0},"dGIr8zA6n4iNKqUeCAsU6A":{"text":"Best restaurant in New Orleans, a must stop every time we go.\n\nWe've been here 3 times now","useful":1,"cool":1},"uqmrY2T63B_P3AEQKfLSvQ":{"text":"Food was excellent!  Had Southern Antipasta appetizer...delicious.  Beef cheeks were tende","useful":0,"cool":0},"kzAP5vz0Yh8oF0DlESLp3w":{"text":"I had dinner for the first time at Sylvain Friday night. We had a rather late reservation,","useful":2,"cool":0},"aFpRw1uI8mnJwrcFrRfAHw":{"text":"First place we came to eat on our trip...very happy all around.  \n\nFood:  eggplant bites g","useful":0,"cool":0},"zkihW4uWHWsuH9jCriLltg":{"text":"The food was excellent, we went eat there last night (my husband and I) and let's start wi","useful":0,"cool":0},"EZck8hIvUKZNR_zkctqbQw":{"text":"this place is unbelieveable!!! \n\nOur friend, who lives in NOLA, brought us here on our fir","useful":0,"cool":0},"pjf089FcCUYESQJvRlvbEw":{"text":"I've walked past Sylvain many times, but never stopped in.  I had the opportunity to do so","useful":1,"cool":1},"c-ETccjeZahAP4hvyyahJA":{"text":"Excellent!  We found this on Yelp when we were in New Orleans and decided to check it out.","useful":1,"cool":0},"lfR7w3ZvipNLnWUHVL9rBw":{"text":"Let me tell you something about this place...it's f*%kin' awesome! It's tucked away a bit.","useful":1,"cool":1},"ujKAkeKoqgNL9BUhVgoLwQ":{"text":"I had lunch at Sylvain's on a Saturday. I recommend getting a reservation. The decor is co","useful":0,"cool":0},"_xvF14KDvJ2AL6glFHhAYA":{"text":"This was our best meal in New Orleans.  And we had some great ones!  The atmosphere is gre","useful":0,"cool":0},"Kd0vPm0g9XUVsyJAhilGdg":{"text":"The food is always delicious. Staff impeccable. My favorite dish is the pork shoulder, gri","useful":0,"cool":0},"77MSf1KQ55dkhkcAcSoGBQ":{"text":"One of the best meals my wife and I have had in a long time!\n\nChef Martha Wiggins is truly","useful":3,"cool":2},"DcsY9iRfNQXpfP9J-RSFTQ":{"text":"The pork and duck confit was awesome!!!  But by far the Beef Checks are the best thing on ","useful":0,"cool":0},"pJb0B6j4squsfrNJq8cxEQ":{"text":"Dearest Reader--\n\nVictory! I was met with some resistance but ultimately prevailed. Upon m","useful":1,"cool":0},"K9KYlrFhD_D_I78nEvLu_g":{"text":"We enjoyed a very impromptu meal at the bar because their tables were booked up until 11:4","useful":1,"cool":2},"A9dqwZOZQUAqr158g3XEtA":{"text":"Very good food.  Decent wine list.   Great service.  5 stars\n\nSmall, casual and nice.   \n\n","useful":1,"cool":0},"AN8zYXDyx007PwerzO4FaQ":{"text":"My friend and I came here for our last dinner in NOLA.  We asked the waitress for some rec","useful":0,"cool":0},"SQF6Pp63l-NXyy5mcbj9DA":{"text":"Great food and ambience. We sat in the courtyard on a beautiful Saturday night. Off the be","useful":0,"cool":0},"mtXJSfW7BWRfFJ1YjtV5YA":{"text":"Hell yeah, this place is worth every penny without doubt. My friend and I actually tried t","useful":0,"cool":0},"TXxXjSE69RYzTaQBXaSahQ":{"text":"Never disappointed. The cheese plate starter is truly amazing. Braised beef cheeks is to d","useful":0,"cool":0},"MnGXDwuToauzRIZgk3QU-g":{"text":"Quite delicious food and drinks. Actually, I was very much impressed at the caliber of the","useful":0,"cool":0},"iJobqSCT81dHgveDuMq1Gg":{"text":"I had dinner at the bar with a buddy this Sunday night.  The owner, Sean, was tending the ","useful":2,"cool":1},"RsaxMLhd80DkyoVJQoGVqw":{"text":"We have been waiting to try this place and for the record it was awesome!! the waitstaff (","useful":0,"cool":0},"z72WOshNOitsIQAfmeD8_g":{"text":"Awful! Poor service music so loud in the main dining hall you cannot speak to your compani","useful":0,"cool":0},"SvnpC8mvWplxCCIZ-61G_w":{"text":"Great setting. Small and cool with a great bar.  Most of meal was great, especially roaste","useful":0,"cool":0},"S2Yv5dYeYo5MVgXzXt8gvg":{"text":"Great place with a friendly staff. Cool bar and nice outdoor space for drinks while you wa","useful":0,"cool":0},"kcYQGBGuS9_BxFhmGNtDag":{"text":"I had great food in NOLA until I came here.  First of all, we didn't have a reservation an","useful":1,"cool":0},"4nFCpqaOnzjWNNV51sFZdQ":{"text":"We went to New Orleans for work and planned a few great meals while we were there. Sylvain","useful":0,"cool":0},"W8XeCiYsfPkaH34NCzSPqg":{"text":"Wonderful!! Great ambiance, cocktails, and food. We weren't looking for a big meal, so we ","useful":0,"cool":0},"iyzLmILEf1-Nav0_MDxw2Q":{"text":"Classic New Orleans place - unpretentious, with boisterous bar- and waitstaff and a focus ","useful":0,"cool":0},"vAdJ7v95jFmLWhWwQviVPQ":{"text":"Great Food and Nice Crowd\n\nWe ate dinner at Sylvain on a weeknight and really enjoyed it. ","useful":0,"cool":0},"9NkB0Z8_ly_k_A5eQAL0aA":{"text":"We just ate at Sylvain, five of us, for the first time.  There is something cool and invit","useful":2,"cool":2},"tR7y7dA1vAkIjjlLorS1tQ":{"text":"A wonderful location and cute atmosphere, however the food was average and our waitress wa","useful":0,"cool":0},"cs_QH1jJczRYcD67VujmWg":{"text":"Love this little place. Fabulous food, nice atmosphere, good music, and just the right amo","useful":0,"cool":0},"ZPlIuXO3qUbYsjZY2e9o7Q":{"text":"Very cool historic building in the French Quarter. Beautiful courtyard. Friendly staff - e","useful":0,"cool":0},"KB9t9Nt3IA3tbYocRmQC7Q":{"text":"Beautiful place. Stumbled upon this while staying in the French Quarter. Went back twice b","useful":0,"cool":0},"vQ63qYEHWkUBOB30PkHhRA":{"text":"One of the best eating experiences I've had in NOLA! The ambience is great in the restaura","useful":0,"cool":0},"Sv4QbcZCjMDb_GRArWzeNA":{"text":"This intimate gastropub is a great place to dine by candlelight.\n\nThe wine list is a bit l","useful":0,"cool":0},"RC01Ec1kyKXIGr3R46bZJA":{"text":"Really wanted to like this place, but left disappointed, mainly due to the service. Ordere","useful":0,"cool":0},"ck1VgndynRnCG6Qs4o68-g":{"text":"Great food and amazing service. It took some time for our table to open up, but the staff ","useful":0,"cool":1},"1OA4wxv4DjvNgCQx36F7lA":{"text":"We went for a late night dinner, 45 minutes before closing which can be risky! The server ","useful":0,"cool":0},"oKdbNby5e-pJKCw_ZBK5qg":{"text":"I live in Austin but I am from New Orleans. Sylvain is a delicious and a delight. The ambi","useful":0,"cool":0},"urALunwW79g5ZzWzHQ250g":{"text":"Sylvain is one of our favorite restaurants in the French Quarter.  The menu is unique and ","useful":0,"cool":0},"bRF6ZVInyQZKkfFZqknt6A":{"text":"Amazing menu, wine selection, and staff. Back patio is gorgeous. I do enjoy an extensive d","useful":0,"cool":0},"yBtP10FlcZkSXVVVT9XxSg":{"text":"Really nice place for dinner in the Quarter if you are looking for something better than t","useful":0,"cool":0},"gK_hmulNZhF7j6qDm0zqGA":{"text":"This was hands down my favorite meal while in Nola. Our server was professional and friend","useful":0,"cool":0},"5l1S7udU2QuQOt-39EE0dg":{"text":"Made reservations for 8.  Didnt get seated till 915-930.  Waitstaff was painfully slow... ","useful":0,"cool":0},"_zW2XfYtzy2sdKsr7c_9pg":{"text":"I was here four years ago for my anniversary and came again tonight. I had the same server","useful":0,"cool":0},"kB-vdSWbLchdaE7itLa6Sw":{"text":"I really like this place. Been a couple times now. It's a great escape from normal NOLA ea","useful":1,"cool":0},"5I3KHEj-D4lnvScawCwJqw":{"text":"All around amazing dinner. I started with a delicious cocktail that was perfectly balanced","useful":0,"cool":0},"IB9JNjPQFECELlpe1H112Q":{"text":"Sylvain is my best discovery to date: an under-the-radar gastropub, found down a dark walk","useful":5,"cool":1},"NemKHmM8zCQgMimXOOBdmw":{"text":"Showed up about 15 minutes before the restaurant's kitchen even opened (5:30pm or so) and ","useful":0,"cool":0},"BCm4n_89-6YMzGt6zqaIjA":{"text":"If we weren't navigating directly here, we would have missed it even though we emerged fro","useful":0,"cool":0},"I2-auZANFOXF7dxz0_Hd_w":{"text":"We came here for brunch, and we had a really amazing (but different) Bloody Mary.  I give ","useful":0,"cool":0},"GnDfn_Zzss1p4t51JYBI0A":{"text":"Damn good with an amazing atmosphere. Love the intimate nature of the place. The pork shou","useful":0,"cool":0},"TAuFwwGyctvsn4Y9_PS_Ig":{"text":"The food was amazing! Not to mention the incredible service. They didn't have any availabl","useful":0,"cool":0},"0zIjo5mon4Td3Jsje1z5rQ":{"text":"The food was delicious, but they didn't seem to have heat on a chilly January evening, and","useful":0,"cool":0},"lnz8l0Rd5sEHTORSc4vzEw":{"text":"This restaurant is incredible. The pictures don't do justice. I got a table for one in the","useful":0,"cool":0},"8yqTrr_JXIszBlvpfaSjZg":{"text":"Intimate, charming, excellent service, perfect craft cocktails, superlative cuisine, and c","useful":0,"cool":0},"ySnXwTXYxbUd9tTPRMOvkg":{"text":"The food was delicious. We loved every single bite. Our server Dawn was such a sweetheart,","useful":0,"cool":0},"7eVw1KnCuMHKu7PqZxSriw":{"text":"Solid restaurant, but didn't blow me away.\n- Sweet bread was really good\n- Pasta was nothi","useful":0,"cool":0},"MpUCUmVFLi-kcWLkG_A38Q":{"text":"I just stopped in for an appetizer and cocktails both of which I enjoyed. The service leav","useful":2,"cool":2},"aUJQM6MfFR_VRoorFikyoA":{"text":"We stumbled upon Sylvain and fell in love with the decor. Hip, modern and sexy vibe with d","useful":0,"cool":0},"y-Gn8g5XeeZgeqpjZsdN7Q":{"text":"The waiter was very slow. Everything came out at different times and we waited the longest","useful":1,"cool":0},"8kjRKAO7YZ-Z6EkQGl-nTg":{"text":"Great food, with even better ambiance.  The service is there to please.  They dissuade tou","useful":0,"cool":0},"_dxf7wTA7XIBy1F808EMJA":{"text":"I would rate this as espectacular as going to emeralds... food wise very good had the Brus","useful":2,"cool":0},"KiXDcJW8fgaFNlpIqS79uA":{"text":"Home !!! Shady rolled backed into New Orleans for another round of music and eating debauc","useful":0,"cool":0},"zB_oOApC623y1PkeTo1j8w":{"text":"We followed the recommendation of another party staying at our hotel to come check out thi","useful":0,"cool":0},"Lk5W9NZ7gDIrhoS0oAT9TQ":{"text":"Ate here twice last week.  Both the food and cocktails are great.  Really good service.  T","useful":1,"cool":1},"M9saUIJDliOmyl3mNFIMbA":{"text":"If you live in New Orleans, if you live near New Orleans, or if you're visiting from far a","useful":0,"cool":0},"hXK3fKVvy7mlrLrk3pQMyA":{"text":"The short rib hash I had this morning for brunch changed my life.  It was unbelievably ama","useful":3,"cool":3},"H9Re-leVksb5XtLiCzfThg":{"text":"We were greeted by a pretentious host.  We sat at the bar and ordered a couple glasses of ","useful":3,"cool":0},"MuIzvfLO4BS0GkIK5gtOEw":{"text":"So: five stars for service, maybe three/three and a half for food. JR was our server the d","useful":0,"cool":0},"rcqnEmTFq9c77k-3NFiImA":{"text":"My fiancé and I came to Sylvain for brunch, and we absolutely loved it! The chilled shrimp","useful":0,"cool":0},"gojsJORptrEE784EuenhKQ":{"text":"This place has a lovely modern vibe while keeping in tradition with alot of the quarter's ","useful":0,"cool":0},"Yhhf61RSDpB7L26EdGl8Cg":{"text":"Imma take away a star because they were out of chicken and biscuits and I really wanted th","useful":1,"cool":0},"Zerb3xlayvmvt26HIfC1ZQ":{"text":"A friend and I went for brunch yesterday on a whim, and even though they require reservati","useful":1,"cool":0},"VtuY7l58kJYM5HTLzFy1GA":{"text":"This was my favorite meal on this trip to NOLA.  I was in town on a quick trip and found t","useful":5,"cool":2},"8xHAoNy_0L3qsKcbF91tqA":{"text":"Of all the places we ate recently during our trip to New Orleans, this restaurant by far h","useful":1,"cool":0},"7fK7ntCGb3U3dEIumXqjXA":{"text":"Went in for a quick lunch and was so impressed. One of the juiciest burgers I've ever had.","useful":0,"cool":0},"mbmZ_aydHTs-aSpRSXVpHg":{"text":"What a treat to stumble on this place. Delicious and surprisingly large antipasti plate th","useful":0,"cool":0},"i6i_ms34J4IdCZJWn-WCyA":{"text":"Loved everything about this place: atmosphere, service, the food (the food!). Highly recom","useful":0,"cool":0},"V-6Palk_OG-qN5r6rm3GVw":{"text":"Excellent service & food. I recommend making a reservation because the restaurant is small","useful":1,"cool":0},"zt_23Wb5mFeLGQYd3J81uQ":{"text":"Nice atmosphere.  Great Moscow Mules.  Quaint back alley outdoor seating.  My husband and ","useful":0,"cool":0},"tDaFvONwd_-v9EOTYXPY7Q":{"text":"I went here with my boyfriend for my birthday and had a pretty great time. \nOther than an ","useful":0,"cool":0},"CSXmRWsj6QGwUvJAV__iUA":{"text":"Great ambience! The service was great as well as the food. The beef cheeks are as good as ","useful":0,"cool":0},"4DzHEmiBh78BmB4EeWq5XQ":{"text":"Loved the courtyard and overall atmosphere here! I literally couldn't stop eating the frie","useful":0,"cool":1},"mBjl84gNdwmWOolOac7dPQ":{"text":"Food: 3.5/5 stars. Some good options. My food arrived cold. \nBar: 5/5 stars. Inventive coc","useful":0,"cool":0},"BMiVeeJCp63cg3LIqKHRxA":{"text":"Great food and cocktails. My friend and I came here for a late night bite on our trip to N","useful":0,"cool":0},"44NxjLn-10TcGRl_v_df8A":{"text":"Came here for hungover Sunday brunch and oh, Sylvain's didn't disappoint!\n\nFriend's made r","useful":0,"cool":0},"7vJQS_1fBo5eVZknJqaKBw":{"text":"I LOVED this restaurant!!! By far the best dining experience that we had in NOLA. Excellen","useful":0,"cool":0},"XdDXyt61vpVXFl3VL7ehAQ":{"text":"I call this a very, very happy accident.\nThe intention was to eat elsewhere, but with a fu","useful":3,"cool":1},"C0JGN_POEP5svJQf2xGQ_A":{"text":"Really delicious gastropub in a warm, close environment inside and a lovely garden/alley o","useful":0,"cool":0},"f0L6nuOekGDsXBO6quxrUA":{"text":"I've been to New Orleans four separate times, and have eaten at most of the popular spots,","useful":3,"cool":0},"bGwGNRfOf2hfNg0UC2hLLw":{"text":"Our dinner at Sylvain was amazing! The courtyard is gorgeous and tucked away, which felt l","useful":0,"cool":0},"U-qMdaBfRiDQAeO_G_nVZQ":{"text":"So let me get this out of the way first: The food was good. Was it a bit expensive for wha","useful":0,"cool":0},"-YNrYeaCdriVh5jHVTx1iQ":{"text":"Very nice Brunch at 11:00. We had a fresh salad with great dressing, great toasts and pork","useful":0,"cool":0},"d8Rs5sXw3ypRn99rZCmCZA":{"text":"The food was pretty darned good. We also had an attentive + knowledgable waitress. A few t","useful":1,"cool":1},"LC5YopOhOJrR3y-mqnI_2w":{"text":"Really sweet bar staff, burnt pork bely in the undercooked rice and the shrimp were ok. No","useful":1,"cool":0},"C--dO7YRt5i4osc8IXm9Yg":{"text":"If I was rating this purely based on drinks and atmosphere, I'd  give it 5 stars. For pure","useful":0,"cool":0},"VForPQ0d8FKOXoUDTU-ZKA":{"text":"First off, the door is around back! You have to go through a hallway. \n\nYes, yes, a millio","useful":1,"cool":0},"Ch1hwta77rQpKdiuWihZrQ":{"text":"Creative cocktail menu.  The chicken liver crostini was good not great, but the duck confi","useful":0,"cool":0},"yFlEtyZeKPPwanf07Im0mA":{"text":"Very good. Service is excellent too. The antipasti and the Brussel sprout salad is everyth","useful":0,"cool":1},"87B1HQ1BBhhooa_bn6MIPg":{"text":"This place and all that work there have true love and passion for the art of food and cock","useful":0,"cool":0},"b81UyJeFMEozRgEcCEpspQ":{"text":"Second time here and its now my go to in New Orleans...\nYou will walk right past the entra","useful":0,"cool":0},"yuOV6OG27MGfUlLC6LHvgQ":{"text":"Came here for brunch. What a charming little place! I had a delicious brunch cocktail with","useful":0,"cool":0},"FglooKp2YzZtNqmSyrMkvA":{"text":"I made a reservation but when the only table available was by a door I chose to sit at the","useful":2,"cool":0},"2olEU5nezXXg5wI_3GqHFw":{"text":"My husband Chuck and I had such a wonderful experience! He had the Fried Pork with Cheese ","useful":0,"cool":0},"Gddc1YvDg6CS7rnpxntwpQ":{"text":"Does Sylvain need another glowing recommendation? Probably not. I even hesitate because I ","useful":2,"cool":1},"2Y20M57Eqaa1nqnS2pFs3A":{"text":"Fantastic restaurant in a small space in the Quarter.  We had an incredible meal last week","useful":1,"cool":0},"VGGqx2dod-Ege22R1F9uxg":{"text":"I had my birthday dinner here and have to say the food and drinks were delicious. I had th","useful":0,"cool":0},"ULJKHu3JOMyxhiPih4Aivg":{"text":"Came here for a quick drink with a friend. It is nice and cozy at the bar. Our bartender w","useful":0,"cool":0},"IgI7aC_K0ErLuKiwdEUINQ":{"text":"2 because only the drinks were right\nI can't tell you how disgusting this charcuterie plat","useful":0,"cool":1},"OzbARTYKE4po53mU3EIosw":{"text":"Wonderful!! Great ambiance, cocktails, and food. We weren't looking for a big meal, so we ","useful":0,"cool":0},"BGwFGHSf48uBJjmchFz-Lg":{"text":"Sylvain is tucked away in the French Quarter, offering a respite from the Mardi Gras madne","useful":0,"cool":0},"b906DXskQ-wPfZ4VHHJq_w":{"text":"My husband and I recently traveled to New Orleans on business matters and decided to make ","useful":0,"cool":0},"lPnd70Gm1DcXzMHwBP-__w":{"text":"Another case of form over substance. Beautiful place, great atmosphere, bad, over priced f","useful":2,"cool":0},"DTcKytKpqixhYPPZsmwn3Q":{"text":"Fantastic food and intimate dining experience. Not a tourist trap, rather a real gastronom","useful":1,"cool":0},"q8zJ7zxlhCRzpU1XNqgzUA":{"text":"Went for brunch recommended by eater \nLong wait for food because kitchen help did not show","useful":0,"cool":0},"4ZkaKtgkN5967SPDrevqtw":{"text":"Loved this place! Ambiance was intimate and romantic, food/cocktails were delicious, and s","useful":3,"cool":1},"gOyHjJuXbQUvcPHqsshXqA":{"text":"Awesome adventure. Enter down a dark alley. Low lighting by candle. Full bar. Outdoor area","useful":0,"cool":0},"FUYKR6exq9yp4xIr20dvZA":{"text":"Small restaurant. Great Atmosphere, service and food. We stopped in off the street without","useful":0,"cool":0},"zY_fYmzgxCqFvrlFTiJs9g":{"text":"OMG delicious food, delicious cocktails, and great service. Also a tad dark inside so ever","useful":1,"cool":0},"q0AoirW69qG_9M2HOHVL4Q":{"text":"Sylvain is always delicious! I returned - this time alone for lunch. I sat at the bar and ","useful":0,"cool":0},"Z_KhIrBg6MZ7zkxRZ36IZw":{"text":"I didn't get to eat here, I just came for the cocktails, but now after being there, must c","useful":1,"cool":0},"mC-vFn37HLzzSAySEs3G_g":{"text":"I was in New Orleans on business and tried Sylvain. I sat at the bar and the bartender gav","useful":0,"cool":0},"Wzx2md0SIEOP3GaMQ5glWA":{"text":"Just finished a wonderful dinner here. Atmosphere was excellent, service was amazing, and ","useful":1,"cool":0},"RkB8eUNvw637cw9ZdLfMTQ":{"text":"I really wish I could like this place.  The owners and staff are awesome and I LOVE the ba","useful":6,"cool":1},"5csfL4d0hac4dnBLBVRljQ":{"text":"This place is awesome. The ambiance, the food, the service. I had the pork shoulder. WOW. ","useful":0,"cool":0},"PjTbrdVYxAbHGn6pJLnp4A":{"text":"Great cocktails. Nice staff. Soup of the day was perfect. Brussel sprouts were okay. Burge","useful":0,"cool":0},"fi93oz5WqCUduC3xk0QbsA":{"text":"Simple burger but very good!  Excellent french fries!\nServers are very friendly and very f","useful":0,"cool":0},"aaOk3Dw7y87NYas1DFoSCg":{"text":"I had an exceptional meal and probably the best Sazerac in all of New Orleans.","useful":0,"cool":0},"GllkZORnE7az47aPjW7BvQ":{"text":"One night at Sylvain for drinks and we were hooked.  The bartenders are true artists, and ","useful":0,"cool":0},"23OyjHUOuIwX9z5inDPymw":{"text":"Came across this place whilst roaming the streets of NOLa. We all agreed this was a \"must ","useful":0,"cool":0},"fBVxODipzOhamxTNZXImKA":{"text":"I came here once for a drink and once for food, so my experience here is a little limited.","useful":0,"cool":0},"EuCq_UZHK4Axg9nmzCytLA":{"text":"Recommended as a great date spot by Ryan at New Orleans Savvy Tours. And it was! We thorou","useful":0,"cool":0},"D_7FOBs0gCI471H6QTHAwA":{"text":"Had a reservation for Saturday lunch. Good thing, as it is small inside. While there is pl","useful":0,"cool":0},"Uke1EBJaeFY4pnDxcUv3Qg":{"text":"We started with the chicken liver crostini and it was really good. I had the burger and my","useful":0,"cool":0},"af6WfWLFZEFnKxs97pRrYA":{"text":"Fantastic cocktails. Really. The Alexander Hamilton blew me away, and I'll stop in for jus","useful":0,"cool":0},"bRHRBMYLVVNeyqzELU9l9A":{"text":"The restaurant was pretty with lots of candles throughout. Tonight however was very cold i","useful":0,"cool":0},"gXjFdS5WyRmchfT1rXJnew":{"text":"Among the very best meals I have had in New Orleans. The pork shoulder - of which I have h","useful":1,"cool":0},"I1siLkjRiHnGy1yhWO9-Sw":{"text":"This place was amazing. Great service. Hip decor. I had the French Syrah and the braised b","useful":0,"cool":1},"1yRoHvkLinEcrnWg7YirtA":{"text":"Let me start out by saying that I am in no way a \"foodie.\" New and \"different\" foods actua","useful":0,"cool":0},"eJXDGbD7rtyXsAsfNOX3DA":{"text":"Three strikes and you're out.  This place is allegedly upscale- let's clarify- it LOOKS up","useful":6,"cool":0},"A3QjEdn6DWVpkc3ZaxEkfA":{"text":"Had dinner here last night, we ate at the bar as it was busy. I ordered the bolognese and ","useful":1,"cool":0},"W-MXXa4aZSi3yqf7bQfmeA":{"text":"Let's just say that after eating here last Sunday night, my wife and I canceled our reserv","useful":1,"cool":0},"n3f-J-Ay007rQCPIB9HYOw":{"text":"Loved the food, we tried a few things. Loved the drinks (Moscow Mule was amazing). \nOnly r","useful":0,"cool":0},"_T1wO0PIbm-d6k3dY6U35g":{"text":"Wow! So impressed with decor, service, and food. All were awesome! We ordered drinks while","useful":1,"cool":1},"6zUW-a4XxLGW0HC0BBwSUA":{"text":"Very comfy, good service and good food.  Perfect for a date or just a night out.  Try the ","useful":0,"cool":0},"n_3wjV_EEw2UGSn1NIQZnQ":{"text":"Amazing food, drinks, and staff. I highly recommend visiting this establishment.","useful":0,"cool":0},"0FmS86tA1Ym8ZTnzjdERfw":{"text":"Great gastropub located in the French Quarter. Picked this place because of the trendy and","useful":0,"cool":0},"_yBu8bT-g_tVykYwuQxeZQ":{"text":"Five stars and a whole bunch of wows for this French Quarter gastropub. We did our share o","useful":4,"cool":3},"XG82JR9dR-oNNyQ6WyPu2w":{"text":"Not your typical French quarter restaurant. The patio seating is small and limited, but be","useful":0,"cool":1},"5bt-PEsKgpsvmA2eKQvD-Q":{"text":"The food was excellent.  Our table got steak, shrimp & clams and a burger. All were great.","useful":1,"cool":0},"syR9HyowFGPkKrfb4o4GGA":{"text":"A+ for ambiance. We had very attentive and helpful staff. The food was INCREDIBLE. Whateve","useful":1,"cool":0},"LZBlszP4x_A16xwmp14ipQ":{"text":"Bad vibes from a server can kill any good time.  Terribly insanely loud music can really k","useful":3,"cool":1},"2K-lmRRwwIqHxvJGmKvlRw":{"text":"We entered the carriage house with some trepidation after the less-than-friendly conversat","useful":1,"cool":0},"dtXLgw5bC1Ge4PuWd7OWTg":{"text":"The pan-fried pork shoulder is divine! One of the staff at Preservation Hall recommended S","useful":0,"cool":0},"G7YHBUrDD8WGN04N5o0slg":{"text":"Great atmosphere and such a cute patio. We really enjoyed sitting outside with the music a","useful":0,"cool":0},"DrECl2VbkbIlkdt5kI8-fw":{"text":"Despite uneven service and serious noise issues inside, this is still an excellent place. ","useful":1,"cool":0},"aQbfc-Heb9nFSobpKIeVCw":{"text":"I got off work early and decided to treat myself to a drink and dinner. I was walking arou","useful":0,"cool":0},"K8OTgtlnKSpMSMgejRF0_w":{"text":"We chose Sylvain from a recommendation when we asked \"who makes the best bloody mary in Ne","useful":0,"cool":0},"5270N_0a6hw1I-QxJ2znpA":{"text":"This could be a new favorite place of mine! And it's in the French Quarter, which means I ","useful":5,"cool":2},"PKibGtLaWrzDov6sVqSHbg":{"text":"Nice ambiance, nice food, snide staff, uptight. Overall experience not worth the cost due ","useful":1,"cool":1},"H58ZXIbIqgRaqgupYt86gQ":{"text":"Wow! The chicken sandwich was amazing. The bar service was incredible and friendly. Bathro","useful":0,"cool":0},"1cGyGlCPHoCquS6-xtoUmQ":{"text":"Every dish from the crudo to the beef cheeks is a joy to experience. I did a lot of happy ","useful":1,"cool":0},"yXTSI3C5gFT58X2APcETOw":{"text":"Sylvain does not need your business. \nWe went into Sylvain on Sunday afternoon to make a r","useful":12,"cool":7},"d5ujQwUlBD8cLcs1lHrcXw":{"text":"We went here on our last night in NOLA based on the recommendations of our concierge. To g","useful":0,"cool":0},"bPZzt3YGyxwQkALaWZ2T_w":{"text":"Great meal, great environment. Shrimp and grits are a must. And very accommodating to alle","useful":0,"cool":0},"iEs6d2RSWeqUSdmItiGAiA":{"text":"Along with Boucherie, Sylvain, which is unfortunately easy to pronounce in an exaggeratedl","useful":0,"cool":0},"N1ImgpBpuwRGYQSJHCvcOQ":{"text":"We had drinks and a cocktail. We had the chicken liver crostini appetizer. The appetizer w","useful":2,"cool":0},"ieQfTzbpt6YaZwN6J29SoA":{"text":"The good:  Great grits.  Lovely back garden patio dining area.  Looks so charming from the","useful":1,"cool":0},"QZWD_ur4Ij4ujVrRrHI5lQ":{"text":"Short and sweet:  Sylvain is an A+ dining experience.  Delicious food in a friendly and st","useful":1,"cool":0},"Mcf2AYG3qfeE5QMDV6y2AQ":{"text":"Today Sylvain served me the best French Toast that I have ever had! \n\nDo not walk by witho","useful":0,"cool":0},"CvQWx4_Fpyasc4d8bjdT2Q":{"text":"Delicious with a wonderful atmosphere! They were out of the 2 dishes I was most excited to","useful":0,"cool":0},"KerBuvYbpc0ljl0edWEOgA":{"text":"Amazing.  Go here. The entrance is tricky. Go thru the hall by the windows and walk until ","useful":0,"cool":0},"qdQpoK2N4pifJfv6DW7obg":{"text":"My wife and I have been eating here since the first week they opened, and when we are in t","useful":2,"cool":3},"A8eryqCbyje-5_LRlpuTjg":{"text":"beautiful/cozy restaurant. kind staff. the food was amazing. great selection of drinks. de","useful":0,"cool":0},"4NHqoOBQJaj9I4RPtnuugg":{"text":"Wow.  I was impressed!\n\nWe chanced upon Sylvain as we strolled down Chartres St. one Satur","useful":2,"cool":2},"D-HYE9F_efNnhvZqaBL4Vw":{"text":"Make a reservation ahead of time so you can be sure to get a table. You must try the fried","useful":0,"cool":0},"35xA9bE52OT1KZDqnfz0zA":{"text":"Always a home run! Such an amazing restaurant and it is in the Quarter. Their cocktails ar","useful":0,"cool":0},"CumbNOs_YMQMxZ0DYe--yQ":{"text":"Good food, but extremely expensive for the amount. I would but it as a lot more expensive ","useful":0,"cool":0},"UnwtUz5eiE85EE2OvJR_bA":{"text":"Probably best to come here early if you aren't in the mood to shout at your dining compani","useful":0,"cool":0},"p7wVvJ72ykSP31vi6-SLfg":{"text":"Wonderful! I love this little place. I live in SF, but came upon reviews for it on Yelp an","useful":0,"cool":0},"fycqpS0RGhODavHfziM-kg":{"text":"By far the best food we had while visiting New Orleans. We really enjoyed the burger and d","useful":0,"cool":0},"t0VjLSXtQWeWmgxPNcflDQ":{"text":"This place is adorable.  Awesome vibes, especially in their courtyard.  My fiancé and I ha","useful":4,"cool":2},"0xz9-Oy1r2OprpnRkyrdkA":{"text":"Sat in the back garden for lunch. Our server was attentive and helpful.\n\nThe garden can ge","useful":0,"cool":0},"k2UI7O1V7RDQi9Dk19-F4A":{"text":"This was the best meal we had during our trip! We sat outside in the courtyard which was s","useful":0,"cool":0},"WXWBriFkiO376e1lie1W1A":{"text":"Was in New Orleans for a wedding and found this sweet place in the French Quarter. Our wai","useful":0,"cool":0},"dW6IIjxAyZd9yR07xZAyJQ":{"text":"Lots of curb appeal, but doesn't deliver the goods. This is one of the rare new French Qua","useful":0,"cool":0},"j8_5c11qeb05IU1QRbV5LQ":{"text":"Great Place, we happened to stumle on this very quant Resturant and Bar. We were greeted l","useful":0,"cool":0},"eh65abBCmBSaHCKZ2_P-Yg":{"text":"The food is a definite 5.  What else can anyone say about the tender beef cheeks.  Homemad","useful":0,"cool":0},"tajO1FG6qjmfSeszDpVfEg":{"text":"Quaint spot off the main street with good food and cocktails. Nice choice in between casua","useful":0,"cool":0},"d2KagJBc_ppiPk-6dIyEjA":{"text":"I'm in foodie heaven in this town... \n\nAmbiance is sexy, dark\n\nService- incredibly friendl","useful":1,"cool":0},"bde2F77rKvIZZB2SV7KhJg":{"text":"You had me at champagne and fries but it was seriously the best brunch ever. Had the brioc","useful":0,"cool":0},"hwbOalgTHWWhG8G_L2tmOg":{"text":"OMG!  The Wagu beef belly.  The menu at this restaurant may not impress you, but just wait","useful":0,"cool":0},"jc-ddLEwLgkdeYD1aUlObA":{"text":"We only came here for drinks so I can't talk about their food. But the ambiance in both th","useful":0,"cool":0},"uou-PxJoIeu__HT0cgMHpw":{"text":"If you are looking for a fine meal with a laid back vibe, this is your spot!  My husband a","useful":1,"cool":0},"cwO5Cux0SoFICdvxRHZXww":{"text":"Sylvan has consistently good food, and at prices that are very reasonable for New Orleans.","useful":0,"cool":0},"iA9wBsW-Ws6KGoRcxSQ8gg":{"text":"We had our last dinner here after staying for a week in wonderful New Orleans. We saved th","useful":2,"cool":1},"gFEoOPf20zOuPW2tLqnBFw":{"text":"I can't say that I have had this good of a meal since I last ate at my moms house.  I am o","useful":0,"cool":0},"L6CxzmuHNvPqLnoEHIDLjA":{"text":"My favorite restaurant in the quarter. Amazing craft cocktails and fantastic food. Don't s","useful":2,"cool":0},"tM-XS4J8wm2wkk2mzTYzXg":{"text":"I went to Sylvain this weekend for brunch and was slightly under impressed. I love the atm","useful":4,"cool":1},"xWj1beeqXWiCf4-Ye6eQcw":{"text":"sazerac was near perfect, I could eat their roasted beet bruschetta all day/every day, the","useful":1,"cool":0},"of41fmaYEv2uXPf7UEaORw":{"text":"I loved the atmosphere inside Sylvain. It's a little dark, decorated in a very Americana s","useful":1,"cool":0},"kI7czsWUdxSas_k7vwv-FA":{"text":"As any good adventure, it starts with a brisk walk down a strange alley... \n\nIn the heart ","useful":1,"cool":0},"CB8HN0AnBxV3jEZYggsTVQ":{"text":"In keeping with a gastropub designation, Sylvain is has a sharp atmosphere that is a touch","useful":0,"cool":0},"oFJ-ZrAzIUIwJz1oxgX2jg":{"text":"I'm going to keep this brief  as to not waste energy on the place. Attractive decor ......","useful":3,"cool":0},"zt8fveyG1YVR5YiLlKlyIA":{"text":"I can't imagine what the chef traded to the devil but it must have been something insane. ","useful":4,"cool":0},"egfctEc1I1WBrbRdoEs8Fg":{"text":"Had dinner there while at the NADA convention in January.  Loved the place,  food was exce","useful":0,"cool":0},"R2UekMi-bjUSSbL4D4S2LA":{"text":"I made dinner reservations for 5 for Tuesday night. The earliest dinner option was 8:30pm,","useful":2,"cool":1},"u6Rg49wQ2NvydVdgg5ayRQ":{"text":"To continue the celebration of my brothers graduation from Tulane, we dined here on Friday","useful":0,"cool":0},"zRxWbzGxqL9WxjyA8U1vug":{"text":"Best place I ate while in New Orleans. We sat in the back patio which was quite quaint and","useful":2,"cool":1},"rCFbrqEfoAmMKc75uoa1yw":{"text":"Great food and cocktails, friendly staff, and really cool space. Recommended for pre-dinne","useful":0,"cool":0},"zvoVH9IA0mtzcMk5OdehMA":{"text":"WORST DINING EXPERIENCE EVER. \nThis is why we give Sylvain NO STARS. Yet we had to give it","useful":3,"cool":0},"i2XfxS2sC8WqpetiiTO1Bw":{"text":"This place has a cool atmosphere. Our server was fantastic. We had a sazerac cocktail to s","useful":0,"cool":1},"uMNqSqRe9ENXjD3G5KpP4A":{"text":"This restaurant is a gem tucked away with so many Southern staples. It's not really a 5 st","useful":1,"cool":0},"pG7Obkm7Y8_8M9IiHLXGmQ":{"text":"We made a point to dine here as we'd heard so many good things. I made a reservation as so","useful":0,"cool":0},"SS41trfG9oASReU7aeZAtA":{"text":"Okay , that is it.  I have been back to Sylvain for drinks several times since my first re","useful":4,"cool":0},"xLNJLKGOugKsMkXebfhTZQ":{"text":"Just to prove how unusual this gastropub is, I had a cocktail here. I never (ever) have mi","useful":0,"cool":1},"uBPZb8L1r-UGJG9pFucw0g":{"text":"We came to New Orleans for the first time for a quick weekend trip and I'm so happy we fou","useful":0,"cool":0},"YDQ_QlCws0_C4gKquEoypw":{"text":"Awesome experience - the shrimp and beans was well made and my wife and I nearly lost our ","useful":0,"cool":0},"S9vJFEkS-KMlIgxnPhpqSQ":{"text":"Had a fantastic meal at Sylvain. The place has this old world charm which you sort of want","useful":2,"cool":0},"pEJMbxQAkGy_CIt1k42ylA":{"text":"Where to begin with this review.  Have you ever had service entirely ruin your experience?","useful":8,"cool":1},"zk8XPPfrqgo6GKJQbPmPBw":{"text":"I was recommended this place during my first few hours visiting New Orleans. It was the fi","useful":0,"cool":1},"ei_GSLcLxfTqY7Hojo3wIA":{"text":"Went with a group of eight people and this time I ordered the Porchetta Po Boy, which was ","useful":0,"cool":0},"cnxTqOeWcMS4yNSvYcFv5g":{"text":"Found this place just walking past and was extremely satisfied. Food and service was fanta","useful":0,"cool":0},"AA_yoDD-PSONhhILSd-MEQ":{"text":"The food and service was great. The back patio is a little dark at night. Definitely needs","useful":0,"cool":0},"HPiGDRC2WnY1XVX93gvMDw":{"text":"What is a San Francisco girl to do after discovering the best burger of her life in New Or","useful":2,"cool":2},"xuY19_hWoFEgKAjeFnMHmA":{"text":"I had a great meal here and brought coworkers for a large seating.\nThe staff is knowledgab","useful":1,"cool":0},"sIAVa1gPU912IIYKVNAf1Q":{"text":"I've loved this little place ever since we stumbled into it completely on accident one eve","useful":1,"cool":1},"6B1kyLOdXfgKT5ybqZ2Xlw":{"text":"This was one of the best fines in New Orleans.   Joe was our waiter and took very good car","useful":0,"cool":0},"YzZkckSzyopjpO4sbJxAnA":{"text":"Another amazing New Orleans spot! First off the restaurant and bar are adorable. The decor","useful":1,"cool":0},"TKrEYQudi23mc4wrAKQ45Q":{"text":"This place was fabulous from the minute we entered the restaurant. Outstanding service and","useful":0,"cool":0},"X5bR_ZW9enbOCHYX3U0m2Q":{"text":"A Moscow Mule, Shaved brussel sprout salad, crispy pork, and the chocolate creme pot.\n\nGoo","useful":0,"cool":0},"Z26w5O9OGO_dgEQiQmMhSA":{"text":"Me and my boyfriend went here four our anniversary and he absolutely loved it. Being a veg","useful":0,"cool":0},"v6WiRKe-DLc1NPp41BjCEg":{"text":"Good food and ambience! We got the Brussel sprout (amazing! Highly recommend) and anti-pas","useful":0,"cool":0},"eun5k5zZQXSD21gCyEvzcQ":{"text":"Another one of these \"only in NOLa\" kind of places.  Very informal but inventive menu.  We","useful":0,"cool":0},"re6_X5atBM6GtyPQY9wmKA":{"text":"I was really looking forward to eating at Sylvain. I figured it must be really good after ","useful":0,"cool":0},"IIRv8qN7wx6I5mnSEH9BfQ":{"text":"Best drinks it town and lovely atmosphere. Didn't have a chance to eat a meal here , but w","useful":0,"cool":0},"7PDi2n31nWUbbIOxzfDTjQ":{"text":"In the French Quarter it's really hard to pick one restaurant over the next but Sylvain is","useful":2,"cool":0},"g1z73b0ukfsXsOloNcNOlw":{"text":"Great food , great service. A little out of the beaten path but well worth it.  Had their ","useful":0,"cool":0},"LSZPzoMpkMf86CYyAPfR-A":{"text":"beef cheeks.. so yummy.. & yea d'uh, this is a fine dining establishment. you make reserva","useful":0,"cool":0},"83ImanPnszZyELw0QP7Rpg":{"text":"Being a girl from Chicago, I enjoy a nice wine and dine.  My mom googled great organic res","useful":1,"cool":0},"vsTzJGZSglwiPiPawpeVQw":{"text":"The food was great, we ordered chicken liver and grilled shrimp as starters, and then we b","useful":1,"cool":0},"xPXVBvdlm8SIhpSSHvZbWg":{"text":"I check in often on Yelp, but rarely review. This place deserves a review. It's small and ","useful":0,"cool":1},"DZxFftWC5NvbmJ3ryarzfg":{"text":"Fantastic food, incredible service and a great atmosphere.  Highly recommend.","useful":0,"cool":0},"irDw0Lxc8XaCAa8dYVZS7Q":{"text":"Liked this a LOT! gorgeous cocktails, excellent chicken, wonderful service. They brew thei","useful":2,"cool":1},"dW4rk9BSthpTE-7nA0T81w":{"text":"We enjoyed a great dinner this evening at this gastropub in NOLA's French Quarter. It was ","useful":0,"cool":0},"GxmRunkrU01U_23neVp1aA":{"text":"I was excited to try Sylvain based on the Yelp reviews and how I imagined it would be, but","useful":1,"cool":0},"oLDtI1sGLzVomz3DYpIGkQ":{"text":"Dont get me wrong, the food and drinks were excellent at this place. Very delicious and un","useful":0,"cool":0},"u65bFEIrxCnwQYWo7R8ydQ":{"text":"It's a few blocks off the beaten Bourbon path tucked in a little side street, only steps a","useful":0,"cool":0},"Td2E_2y-fJ3TfK-QjznvuQ":{"text":"The French people know their fair share about  chicken liver mousse and bad service. Phili","useful":0,"cool":1},"rCSV1DXuHGm0XO_nbvb_3Q":{"text":"Fabulous new restaurant, four of us tried each others food - scallops, pork shoulder, papa","useful":3,"cool":3},"nyBX7V50k3KIx9DGjLwGrA":{"text":"To me... as a Philly guy not used to the overabundance of REAL craft cocktails, the top no","useful":0,"cool":0},"kUCxjz1E45LEySJnB3tDCg":{"text":"My friend and I shared the chicken sandwich and the hamburger . The chicken was fried and ","useful":0,"cool":0},"WgjB2lmzc62UTE4BgXWwFw":{"text":"Make sure to make a reservation, because the reputation that Sylvain has is absolutely war","useful":2,"cool":1},"s6sks_4EPo3ehu9ZJsWjPQ":{"text":"Great service, exceptional burger, salad and soup. Hip and trendy bar, very knowledgeable ","useful":0,"cool":0},"4tVZzlMe0HNhl9g4_0Pkzw":{"text":"Got the amazing chicken liver pate, shaved Brussels sprout salad with hazelnuts and then i","useful":1,"cool":0},"-K24OiXDR5rc9lob5vkOBA":{"text":"I LOVE Sylvain. Dined here three times during my last Nola stay. This time, I enjoyed lunc","useful":0,"cool":0},"Aa4hnsoDfwGv3yJw5AEVmQ":{"text":"Currently at Sylvain facing the bar. There us a man at bar with low sweatpants so low that","useful":0,"cool":0},"fXhl-L7BhWZacxO6o1u_wg":{"text":"After searching for a breakfast spot that was reasonably priced and didn't have an hour wa","useful":1,"cool":1},"6WEzoqFiBaME2r0Tuo5hmA":{"text":"It was ok. Service was really slow. Not the worst meal I've ever had not the best either.","useful":0,"cool":0},"v_ckw4p1YdRhNfV3lRZNDw":{"text":"Sylvain was wonderful, and we perfectly timed it as the last dinner of our trip. The resta","useful":2,"cool":0},"V0QrnRRcO2oOY956KmIIJA":{"text":"Nothing remarkable.  The beef cheeks were very nice but the mashed potatoes were bland.  T","useful":2,"cool":0},"XiwOrHgJEUSItnJleHKpKA":{"text":"Great place for good food, even in the simplest of salads. It's great to sit at the bar to","useful":0,"cool":0},"U2yEmy64fGiyk19QNurjjw":{"text":"Three words: Brussel sprout salad \n\n\nWorth the excellent dinning experience for that alone","useful":0,"cool":0},"68F7Xeq_0HwogPX7G8l7UQ":{"text":"After searching Yelp for a new place to dine, I finally settled on Sylvain. The menu looke","useful":7,"cool":1},"5cnVWTcCGu81J9AyQgmJhQ":{"text":"We had such a great night here. Dawn was our waitress and she was fantastic. Made great re","useful":1,"cool":0},"J6xhWiQTOmOxxScz5vJFsQ":{"text":"Small rustic restaurant in the French Quarter. Table of three got the following: \n\n1. Shav","useful":0,"cool":0},"rfMXzwKfm0CVMW7vNUFEhw":{"text":"Delicious, innovative, great cocktails, great chicken biscuits, champagne and french fries","useful":0,"cool":0},"Zeo45h6-9Ld3fmp2Ro6_zA":{"text":"This place was really good. I would recommend making a reservation, though. We managed to ","useful":0,"cool":1},"UYxTEX0DR79N97wC9ktYjg":{"text":"I almost do not want people to find this spot...yeah, it's that good.  My boyfriend and I ","useful":2,"cool":2},"oSLWgY9dzus_cVJLbLSHaw":{"text":"If a mustachioed hipster moved into the basement of Dracula's Castle, the likely result wo","useful":3,"cool":0},"aUGsTy_MEI3CXzeoVyx0oA":{"text":"We didn't have reservations but they let us sit in the back patio area. I had the po boy w","useful":1,"cool":0},"bKefaknGk5xUoMtHrP478Q":{"text":"Place was tight. Bloody Mary was REALLY good. Not too spicy, but particulate enough that y","useful":0,"cool":0},"7m-Qobhz2Z_t_6E7562GTg":{"text":"Best dinner we had in New Orleans! In the French Quarter but away from the crazy of Bourbo","useful":0,"cool":0},"YzBVhihHPY9RLfGG8824KQ":{"text":"Two words: beef cheeks.\n\nHonestly they were fantastic and one of those dishes that can't a","useful":1,"cool":1},"UtdM6SW7thHzEluOz-rchQ":{"text":"Sanity not far from Bourbon Street.  Classic dark wood, candles, courtyard New Orleans exp","useful":0,"cool":0},"IxjvcFhqXWqHzJNKMuHtfQ":{"text":"While the food was tasty, the restaurant could do with a few more lights and southern hosp","useful":1,"cool":0},"miOoK7FNpR65Co_etMa8qw":{"text":"I brought in a rowdy bachelor party of 27 guys and the team here was above and beyond help","useful":0,"cool":0},"cw38X4uhi3DR1DSwRW-esQ":{"text":"My boyfriend and I selected Sylvain for our 1 date-night during a wedding weekend in New O","useful":1,"cool":0},"kwyXMUAOQQ_83INkxoeQDg":{"text":"Only the bar was open when I visited.  Very cool ambiance and table set up.  Bar drinks we","useful":2,"cool":1},"kCvPJbQ23FHrQJwhUROTMg":{"text":"The only thing worse than the menu was the actual food. We waited over an hour after we or","useful":0,"cool":0},"RlVVJfsLKqB0J0M0jXq32g":{"text":"We didn't have a reservation when we first arrived but they offered us a spot at the bar. ","useful":0,"cool":0},"MVVDF_4zyzKiBvATcN4pwQ":{"text":"We didn't have anything to eat or drink so I'm rating this based on service only.\n\nCame he","useful":1,"cool":1},"RAfUaSkCeNXXsMY1Xg2aUQ":{"text":"We were not seated until after 8pm for a 7:30 reservation. There was no acknowledgement of","useful":0,"cool":0},"eb-W7CdqGXdlAQK8id2iEQ":{"text":"We came here one night just minutes before the kitchen closed. It is right in the middle o","useful":0,"cool":0},"vZf8zjn6E6EfHmWCUUbWDA":{"text":"Soooo disappointed today. We have eaten here at least 10 times in the 2 years and truly ha","useful":0,"cool":0},"4uElaEEs95M8_zbLx-QBww":{"text":"Ok so I'm giving an extra three stars in addition to the five you can give because this pl","useful":1,"cool":0},"tlG_i6hCQ8b2nA96EaFu8Q":{"text":"GREAT FOOD,GREAT SERVICE, Sunday brunch with Don is the best!!!! Music was fun!!!! Party w","useful":0,"cool":0},"HQ_8T4x_6hfeaI0vpAE83w":{"text":"I started with chicken livers and moved on to the beef cheeks. Great food. Great atmospher","useful":1,"cool":0},"cASL5lHGJyZorGQr7vFl1g":{"text":"This place was a home run.  Very cool bar/restaurant.  I was sick and tired of boozing it ","useful":0,"cool":1},"ooB0T1fxxiwMWBkn7T04pg":{"text":"The sazerac is the best in the city, and I've had them all over.\n\nI enjoyed a beautiful me","useful":3,"cool":0},"VC2EmC7IkhB0z-2iVMdbqA":{"text":"If I was rating the room and the esthetic it would be a 5. The food and service was a 3. S","useful":0,"cool":0},"IVOPdLMpUZ0IZTq30YJh4Q":{"text":"Okay, let's be honest. \nAs a local, there are certain places that you hold for special occ","useful":14,"cool":9},"ED6VFmmiMgrghhC87V8osw":{"text":"So we were wandering the French Quarter one chilly Saturday afternoon with no particular a","useful":0,"cool":1},"POverRPe45l6qVDZ9EcYow":{"text":"The food and ambiance was amazing. The staff was incredible, only complaint is that the li","useful":0,"cool":1},"g52ZwX9j12Xh4DGrzuYVjw":{"text":"I love that this place takes reservations through Open Table via Yelp. My friends and I we","useful":0,"cool":0},"X_W9V2ffLhmilCaM6wGJFA":{"text":"I love, love, love Sylvain! The atmosphere is adorable and when you walk in you feel like ","useful":1,"cool":1},"cAKN2uXegaVnJMvAzAkOBQ":{"text":"Amazing experience. The bartenders Sean and Ellie were great and whipped us up the best co","useful":0,"cool":0},"kN1CAbAQRq5PSd5i3fbL-A":{"text":"Lunch here almost killed me with its amazingness.  Fried pork shoulder with grits and coll","useful":0,"cool":0},"By5KYoiFNJeqTg4MZUgAOg":{"text":"The hostess seems to work 18 hour shifts, yet is chipper and helpful.  Our waiter was not ","useful":2,"cool":0},"OM9Ir0Qt78JMCejzalEaMQ":{"text":"It is in a very unobtrusive area and you feel transported into the sylvain's world.  I had","useful":2,"cool":0},"HCt5dVFW5W688bHvvXPXLQ":{"text":"One of the best places we've eaten this week. We only ordered two apps and drinks, but the","useful":1,"cool":0},"2VOtmgjIi4IWDYHWwudq3A":{"text":"My wife and I ate here on a Saturday for lunch after reading good reviews online.  The foo","useful":0,"cool":0},"A-8UTRFrpt7-ySFESyE0lA":{"text":"Enjoyed a marvelous Reveillon dinner at Sylvain's the other night. The company was great, ","useful":0,"cool":0},"nPYY5U2C9fdGge2HuSTEdw":{"text":"Small gem in busy area. Everything was delicious. Great to see Sweetbreads on a menu. Sign","useful":0,"cool":0},"fihAtimIEPF1xgHPuoK9PQ":{"text":"Love this place as a bar / place for cocktails, really don't like the food. Really \"basic\"","useful":0,"cool":0},"PQGlzPrE992Sz1DZqI0gHg":{"text":"Great atmosphere! This restaurant is what I think of if I were to day dream of a quintesse","useful":1,"cool":0},"_XmsjL60PMzdleYUY9GWUw":{"text":"It's not easy finding simple, fresh and flavorful food in the quarter where the Cajun rich","useful":1,"cool":0},"uxHdXjjuy-cEVcC27uiwxg":{"text":"We had a late and very fun dinner at this super charming spot close to Jackson Square. The","useful":1,"cool":0},"OfdkDMfxMvImnHROXMa5TA":{"text":"Absolutely great! The place you're looking for... the diamond in the rough.\n\nDon't miss it","useful":0,"cool":0},"Gj0a_cckiXTFv5Kw6icBsA":{"text":"This is a precious & charming little gem!\n\nBut skip on the lavender prosecco. Unless you t","useful":0,"cool":0},"7LJZy6RlOKo4kIkqHBg6Og":{"text":"Limited menu selection but had a nice steak entree.  Loved having 16oz cans of Schlitz","useful":0,"cool":0},"mZMzpfHYMaL97gC2QTBq4Q":{"text":"If there was one restaurant I visited during my time in New Orleans that reminded me most ","useful":2,"cool":3},"TlDR42w7QkniN0Wh3MRnew":{"text":"I've been here three times, and I've been trying to create a buzz about this place ever si","useful":0,"cool":0},"B6TDtor4ps5a5xW8iDbF6g":{"text":"When first walking into the little tucked away restaurant by Jackson Square, I could tell ","useful":1,"cool":0},"ENENFqlBiO6QdVgfcUHfkw":{"text":"I think this restaurant deserves the James Beard Award for best Chef in the South.  The fo","useful":0,"cool":0},"wIA38h88-NHCsWEePTm-ZA":{"text":"Very fast and nice waiter. At first the place is a bit dark but the food is delicious! I h","useful":0,"cool":0},"Ft0u_etwRbAG3HRXcWB6XA":{"text":"I can't even begin to explain the awesome flavor of the pork shoulder entree. The greens a","useful":0,"cool":0},"uVMUPS2BVfvkyLgwhJXF7Q":{"text":"Sean...sorry I did not get the spelling...but he is GEM!  We were at the Carousel Bar and ","useful":3,"cool":3},"GHzxozFm1SRamU-BpLyygw":{"text":"Kool beans... Pan-fried pork shoulders... yum... kool spot near Jackson Square... kool atm","useful":0,"cool":0},"LZk9Sn1ca2-eofTjPjt9wQ":{"text":"This place was very awesome, not typical and very romantic New Orleans!  The cocktails wer","useful":0,"cool":1},"s3BVjbSjBv-WORJrBkuP3Q":{"text":"This is a review of the bar. It ranked #2 in a top 25 I found on the internet, with raves ","useful":0,"cool":0},"EVpZAvWbU1WOZbzynVcNuw":{"text":"New Years Eve.  Pork shoulder and roasted almonds.   Beef cheeks and gulf shrimp.  Great c","useful":0,"cool":0},"eNx4nfs66fto76p5BC8euw":{"text":"Great find in NOLA , beautiful people, super yummiii food. I was alone and sat at the bar ","useful":3,"cool":2},"0d5pK0Xz_Ue2HPtsxZWEwA":{"text":"Excellent food served in a backyard atmosphere. Great waitstaff. We didn't have reservatio","useful":0,"cool":0},"7DWnU6xvAY-kVqyV78gQ2w":{"text":"Central location, nice ambience, and good food.  Had the burger and enjoyed it thoroughly.","useful":0,"cool":0},"2aOKvucUP-FMccRh1LuN_g":{"text":"Hostess was very friendly and bubbly.  Definitely set  the bar high for expectations. \n\nFo","useful":1,"cool":0},"Jvp02my74GGEms81T3Y7yA":{"text":"While traveling, my wife and I ate at many of the local seafood, creole, Cajun based estab","useful":0,"cool":0},"UHZuIdhp5MXNzmd0DCYc8A":{"text":"What a quaint and beautiful little place right off of Jackson square. I felt so relaxed in","useful":0,"cool":0},"Ifc2cH9DN4esvTTPlIGSqA":{"text":"Enter through the side alley entrance. Don't go through the window they are blocking with ","useful":1,"cool":1},"eVQ7N9RedStvYwZxhNvdjA":{"text":"Here's a note I wrote to Selena, manager at Sylvain:\n\nHi there -\n\nI came by for dinner on ","useful":3,"cool":1},"BQSWTxDouVb21z7hc4U5LA":{"text":"Came here for a pseudo business dinner on a Monday evening. Even on a Monday there was a d","useful":1,"cool":0},"H_Cs1PHNk_U1mqSvt2pVEQ":{"text":"I chose Sylvain as a neighborhood first-date spot with no regrets.  Exposed brick, dim lig","useful":0,"cool":0},"wORddkLgQ_Okb6cKhxworA":{"text":"Awesome place. Forget the fried family style joints. Hand crafted cocktails. Fabulous food","useful":0,"cool":0},"GOG7ICx6UMdZu9gmFSBOMQ":{"text":"Came here for late dinner after catching a show at Le Petit theater. The atmosphere here i","useful":0,"cool":0},"WXSodiqhjecL0rBD8bR7Iw":{"text":"Since eating at Sylvain I have googled and pinned every copycat recipe of that Brussels sp","useful":3,"cool":3},"ceooizlEaHsw964In-5_Wg":{"text":"I stopped by on a not so busy Friday afternoon and the food and drinks here were quite goo","useful":1,"cool":0},"XS5tcd38wrowu5MZ92f1Vw":{"text":"Phenomenal. Best everything ever. We went for my husband's birthday and got a little of th","useful":0,"cool":0},"r1Fr5b2QrO-WKCifQkn4wA":{"text":"Delicious food, warm and welcoming staff, beautiful courtyard setting. Thank you, Carl, fo","useful":0,"cool":0},"eMZiIAsDAB315-ePSkZ9zw":{"text":"Sylvan is now on my \"must do\" list along with Jacques Imo's for each New Orleans visit.  B","useful":0,"cool":0},"dARMogJyzmfQaCfgLhwoaQ":{"text":"We stumbled upon Sylvain's when we were in New Orleans several years ago and were enamored","useful":0,"cool":0},"NxBX2dEOIRrglsX8W9xCIw":{"text":"We had a nice meal here on a weeknight. We came pretty early for dinner; pretty much right","useful":1,"cool":1},"KD67YIvWj3SiCqiAXxQ-XA":{"text":"So I was at french quarter fest all day long with my friends and we had this brilliant ide","useful":5,"cool":7},"eRmwOjuTzXoYxin_4pLE5A":{"text":"Favorite spot in Nola. Great food and great atmosphere. Make a reservation or you'll wait ","useful":0,"cool":0},"e9VmvhnfiYCp_93pCZYpqA":{"text":"Had dinner here last weekend(not my first time) and with each time have an even better exp","useful":0,"cool":0},"7R9SICaAD9X6X2w1-JaGDg":{"text":"Get the sweetbreads.   They were absolutely amazing.   The drinks were great and I found t","useful":2,"cool":0},"v3uzVqg8uGz_WgDXb1kIJg":{"text":"Ah another great review for yelp! While I may have frequented this establishment in the pa","useful":3,"cool":2},"9uA86kBQAgPsoXMtxfy_5Q":{"text":"This place is tucked in down and alley and was a great experience. By far, the best fried ","useful":0,"cool":0},"UR_DitLS8sbSEQFm0eDX4w":{"text":"To be fair, I would have preferred to give Sylvain 4.5 stars but the option wasn't availab","useful":0,"cool":0},"yHHT1a9E56yi3Z3UtgiJRg":{"text":"Sylvain is just off Jackson Square in the French Quarter. Seating can be limited in the ai","useful":1,"cool":0},"iIpkxOxv2qOyW4Wem5VYPg":{"text":"I went to several bars with a local friend over a few days and I have to say this one was ","useful":0,"cool":0},"DzTyjIONZKblZzPOIxrTvQ":{"text":"Loved it!  Great spot for a nice dinner on the patio when the weather is great.  Server po","useful":4,"cool":2},"9mHR4s3U0__X0Gj7rsbSqQ":{"text":"My sister gave me a Gift Card for Christmas and my girlfriend and I really enjoyed our din","useful":0,"cool":0},"eskEab1sT4jLbJYUV8g-7g":{"text":"Nice restaurant, friendly staff. Was reasonably priced and had an interesting menu.","useful":0,"cool":0},"aFx41Vjz1L_pECL4_pdZFQ":{"text":"Before I visited Nola for the first time my friend made a list for me of places and recomm","useful":0,"cool":0},"OKk6juURmSyS7B5xuMJ2KA":{"text":"This had to be the best dinner i've had in the French Quarter.  I had the duck confit and ","useful":0,"cool":0},"ayhJafBGMJiiE32XzUIV-g":{"text":"A really great spot that is tucked away in the Quarter.  The bar is a great spot to drink ","useful":0,"cool":0},"dUdIgLSVoELRWldtqFlGNQ":{"text":"Currently at Sylvain facing the bar. There is a man at the bar with low pants so low that ","useful":0,"cool":0},"aCm7gRrH9TPxznGM_6YLlg":{"text":"Amazing food, Amazon ng atmosphere, and great service! Braised beef cheek and pork shoulde","useful":0,"cool":0},"xYBfKrDMS386yOl5ljqsDQ":{"text":"I was so disappointed. It was our last night in New Orleans and after eating oysters, po-b","useful":1,"cool":0},"mfQ049aEjeCRGWilh-9d6A":{"text":"Good food, good service & a cool atmosphere.   Reasonable price as well with character","useful":0,"cool":0},"_OQ2M5YbxapGOkgib8JG_Q":{"text":"Our meal here was very good. The beef cheeks and the crispy pork shoulder were both dishes","useful":0,"cool":0},"znB-KzVklsdoXv3IDAlOUQ":{"text":"Such an amazing place tucked away in New Orleans. If you're not looking you'll miss it. We","useful":1,"cool":0},"4P9wfSotr1Z9w9cUpdLsSw":{"text":"The fried chicken sandwich here is so good. This is my favorite place to take a gumbo brea","useful":0,"cool":0},"mj0dm2kNe4uGFVm0WVXtIQ":{"text":"Fantastic dinner experience at this rustic little spot just off of bourbon street.  Food w","useful":0,"cool":0},"EzdovbBzvSYfAggvD6LJIg":{"text":"My iced tea smelled like sewage. The owner consoled me by saying, \"The machine needs clean","useful":2,"cool":1},"dDD9rGQR0bRQVXouJHOOUg":{"text":"What else can anyone say about the tender beef cheeks.  Homemade pasta excellent and stood","useful":1,"cool":0},"ZxjM_vVBID_oIK60q72hEQ":{"text":"The best meal of our visit. We reserved, but didn't know to ask for outdoor seating (in my","useful":0,"cool":0},"zejYBIGvKqNYtdgtb_8_vg":{"text":"Holy moly the food blew us away and the atmosphere was not too shabby. This spot in the qu","useful":1,"cool":0},"kgOaBojHG54uvGNVSFXzwg":{"text":"Delicious food but our server was slow, confused about who got what to the point of dishes","useful":1,"cool":0},"-hmrd4vAxDv04gJKsMWqYw":{"text":"Vomit alert. But in a good way - I think?\n\nFirst of all, let me say I've stopped by Sylvai","useful":2,"cool":2},"xElRkEOXnw51HTb80erwLg":{"text":"Ali the manager was kind enough to get us in this past Saturday evening, I was hosting cus","useful":0,"cool":0},"RycqM_gIbhRHztbpphVGMA":{"text":"I was hungry and hoping to have a great lunch experience. There was not much of wait to be","useful":3,"cool":3},"Pra4_quSByHaNFjzTK1V6A":{"text":"On our first (and only) evening in New Orleans where we didn't have dinner reservations, w","useful":3,"cool":1},"OGeXCjzIEO6hAvYCEul18Q":{"text":"We had brunch here on a recent trip to NOLA and it was delicious. I was drawn in by the fr","useful":1,"cool":0},"wbYN7PUdkNyJTJFraUHoqQ":{"text":"This is a solid restaurant. Would definitely return if we come back to NOLA. We started ou","useful":0,"cool":0},"bS0IeQiBr0pa0_1HqZzEbQ":{"text":"Outstanding urban gastropub...had the burger and fries, plus some bites of my cousin's gro","useful":1,"cool":0},"Rdm70QKyXTtAv4PmIbfkGQ":{"text":"Homemade Jameson and Coke!\nBurger is awesome. Duck confit also very good. Sunday brunch is","useful":0,"cool":0},"-wzpsq2wo0r8LBfYsCo7Ug":{"text":"great staff and atmosphere. \nSalads and seabass special delicious. \nOnly disappoinment was","useful":0,"cool":0},"8XVfxasHtge9zpOXz77zdA":{"text":"Very good friend whose judgment I trust suggested that this small spot in the heart of the","useful":1,"cool":0},"9g4TK7Xu2r68tigHhQg3sg":{"text":"Had brunch here recently and I was pretty impressed. I had the \"Crispy Pork Shoulder and C","useful":2,"cool":1},"Ttt-GBA4rctKKTQMgpxd0g":{"text":"Wow, this place was the highlight of our New Orleans trip. It felt like we had found a spe","useful":5,"cool":1},"RQ1b14NRmd5kryi1pvAlEA":{"text":"Wow, tough crowd here, as everyone seemed to rave about Sylvain but still gave it only 4 S","useful":1,"cool":0},"pZXdGCIv53elweSSnzDE-w":{"text":"This is a wonderfully cute restaurant with tables out back and a ton of character in the i","useful":3,"cool":1},"s8KgVyqLEaD6DHHv0VYfcg":{"text":"Sylvain was a charming little restaurant I am so happy was apart of my New Orleans experie","useful":1,"cool":0},"jWnhzaBfsOT0ITDIPQsZZg":{"text":"My husband and I were running late for our reservation (showed up at 9:38 with a closing t","useful":0,"cool":0},"UW25BqBiCeV-A2IPkiCNxw":{"text":"Service was amazing, drinks were amazing, ambiance a+, and of course the food was stellar!","useful":0,"cool":0},"REb7itf8Ld_nXdtL5fWJYg":{"text":"Very snottilyy told by two hostesses we couldn't have drinks at the bar because we had thr","useful":2,"cool":0},"oasZYnuAJFeSNftvnmT1sg":{"text":"I really wanted a cool laid back place for a really great lunch and sylvain was the perfec","useful":8,"cool":3},"CjkSY9yj0CpdTBlTsz1deg":{"text":"We called for reservations but never got an answer finally went there. We were told we can","useful":0,"cool":0},"aPCxPzHLUqIdZRtBwt-qaQ":{"text":"This is one great restaurant - location, lighting, food, restaurant interior/exterior and ","useful":0,"cool":0},"VNsJt_rsHyE6BNqAa3gA8g":{"text":"My wife and I had a late dinner here the other night. It was very busy in the restaurant a","useful":0,"cool":0},"2oR-BtSRKx1GXzQJpYlzCQ":{"text":"Nice spot located not too far from Jackson Square. \n\n\nThe dining area had very low lightin","useful":0,"cool":0},"JjbgHEffiFHcoCB21HLhiQ":{"text":"Best bloody mary I've ever had (& I've been drinking them for more than 40 years)!  They s","useful":0,"cool":0},"RYJiIR7rGncEtHtwA2w6qA":{"text":"LOVED this place!\nIt's a little on the hipster side what with the stuffed heads on the wal","useful":1,"cool":0},"zzbZvvE-jGnY_9lwo-JkIw":{"text":"They could use a broader gluten free menu and more coffee selections, BUT this is one of t","useful":0,"cool":0},"5PxtKwcDC_BO_PDW1EvGCw":{"text":"Wow what a gem!\n\nMy friend and I went here for dinner and everything was so amazing. \n\nThe","useful":1,"cool":1},"3qSmPxH7QyiZb4DfrysXOw":{"text":"We found this place by accident walking down Chartres. After a night of heavy drinking, th","useful":1,"cool":0},"gSKe2coxtwzgbOf_8mHGtg":{"text":"It's super hard for me to write this...I've been coming to Sylvain for several years and h","useful":0,"cool":0},"SFlAdgBz76HZE71J_31Fzg":{"text":"Amazing food and service!  We had several courses including the antipasti, bruschetta, and","useful":0,"cool":0},"cSNHavJOJRANUGUNVtOVjQ":{"text":"Delicious!! My husband and I split the pork shoulder with braised greens at the bar. My hu","useful":1,"cool":0},"M1REj04oWOab5QDU6oSg0A":{"text":"Went here on a date with my partner, and I loved our waitstaff, the food, the ambience, an","useful":0,"cool":0},"OEKv_ELBg5W22MkEEdPJIg":{"text":"I was a little disappointed in Sylvain's menu...so few vegetarian items. Luckily, I wasn't","useful":15,"cool":11},"t_WWmLo-3cLoU6M4wFPUTQ":{"text":"This speakeasy looking bar is dark and cozy and appears to have great food (kitchen was cl","useful":1,"cool":1},"ZPrH39WQXhcaE67dmRHKUw":{"text":"We started with sidecars. This is at the top of my drink of choice list, pretty much, and ","useful":0,"cool":0},"bqwPJcz8yDMHUx-KluG4LQ":{"text":"I came here only for drinks.\n\nWhy am I stating that? I don't need to defend myself to you.","useful":2,"cool":2},"ik0u7JGVWMohYT_1btrO3Q":{"text":"Sylvain will always be one of my favorite restaurants! Over the years, I have become frien","useful":1,"cool":1},"5ntBLXZqHh08iUvj8mZDlQ":{"text":"Dinner was superb!  Started with a pickled beet and Louisiana crab salad with a horseradis","useful":0,"cool":0},"YI_BuloHovfALIWWp7XWaQ":{"text":"We went for dinner today and will not be back, in fact we walked out.  Host stand folks we","useful":0,"cool":1},"PKC-P2GuyUUKYQ33HwUg0w":{"text":"Absolutely fabulous dinner. You must try the beef cheeks. Melt in your mouth. Fun atmosphe","useful":0,"cool":0},"cASUVFmrwsVKOgdK77Oh4g":{"text":"This place is awesome. We just got into town and went there because of the reviews and we ","useful":0,"cool":0},"1Z2HTLGDPuPLRgGdvgHlYA":{"text":"Went last night to celebrate a friend's birthday.  It was so noisy and dark in the restaur","useful":0,"cool":0},"NzRqa3zhp5wrAdYTrh9QBA":{"text":"Great atmosphere, lots of candles and low light. We sat at the bar because we were early f","useful":0,"cool":0},"SQHqSohrdyPjC4Y7oA1WhQ":{"text":"Beautiful little place in the French Quarter and one of the best meals my 11 y.o. and I ha","useful":2,"cool":0},"0NE3Y-2SVoqIdKqRy8UDIw":{"text":"What a perfect way to end our visit to New Orleans.  We had contacted the restaurant a few","useful":3,"cool":3},"WtHhZzmmZW21HYTYXY0Zug":{"text":"Romantic spot for dinner, with a lovely garden and also a dark, sultry interior. Great coc","useful":1,"cool":0},"6DUl6KjEMXCKBWLyQcn6VA":{"text":"Restaurant is a nice spot with a candlelit ambiance. The meatballs were delicious, one per","useful":1,"cool":1},"bzf0xg0-oAk4B4JsJK2jgg":{"text":"This was my favorite stop in NOLA. Make reservations a few days ahead of you want dinner a","useful":0,"cool":0},"v2Ut_kkWPRSeKGJ4KAGWqQ":{"text":"The pork cochon was outstanding!  Fantastic texture and deep, rich flavors - best in new o","useful":1,"cool":1},"oYngKfYZf6zk3hDBspT3Cw":{"text":"Great food but weird experience. I made a reservation through Open Table and when I arrive","useful":1,"cool":1},"duicozPoBvFRmX2SvtcMFQ":{"text":"Dinner here was delicious and the atomosphere was just as amazing! We dined in the back co","useful":0,"cool":0},"hwxm1gfoiGTcePyuHr__Vg":{"text":"Thank you, Dawn! You are now my official New Orleans breakfast consultant! Your recommenda","useful":0,"cool":0},"KlCvm03TvDkOWf6Fqoz4jA":{"text":"Be sweet to the hostess and don't be in a rush - the service here can be uneven, but you'r","useful":1,"cool":1},"mkNND4TzHYb3U04TgGH6Eg":{"text":"It's a good spot for date nights. I came here for dinner during Mardi Gras with my friends","useful":0,"cool":0},"cF5oBv9-hWBTbOBHIUoZPQ":{"text":"Seriously !!! This New York boy is telling you that if you find yourself in New Orleans ..","useful":0,"cool":0},"1V3cZ9FV0sCoh_nKv1EKrg":{"text":"Excellent spot that was recommended to me by many people!!  I got the shaved Brussels Spro","useful":0,"cool":0},"4fAdO9AQm3mrIXZKq0Gj1w":{"text":"As you stroll through the odds & ends of the quarter with hunger echoing off the walls you","useful":0,"cool":0},"6K4vFuUl8Q0YsKmwnWU5Cg":{"text":"Sat at bar at 6pm. Had best sezerac in NOLA. I Love Lucy. Not the show.  The bartender. Sh","useful":1,"cool":0},"5oJ4BPl31R_VaBg4T0JKsw":{"text":"First and foremost, the food was incredible, and so were the cocktails. \n\nWe had a party o","useful":7,"cool":1},"my7rz6fhlAKRu1uYj_9DeA":{"text":"Terrific atmosphere. Great Drinks and the best bartender in the city. Ask for Ellie! She m","useful":1,"cool":0},"5bf6Q_fr44BTUOCAaaRp4g":{"text":"If you want to eat somewhere that blasts Janice Joplin on top of a crowd that's already sc","useful":0,"cool":0},"i7nPFXhsUL6vDSIvZbbygw":{"text":"Great food great service especially Alex B. Celebrated my wife birthday everything was per","useful":0,"cool":0},"8-uUqJ2-LRwEfnT4VNsNpw":{"text":"While Sylvain's may be known for its Chick Sylvain, the burger is what we could not stop r","useful":2,"cool":0},"C01fhrvmPXnWzcysLOxCPA":{"text":"Sylvain is one of the hidden gems in New Orleans. Literally. Located on Chartres Street, s","useful":17,"cool":8},"6AnZ4UE1gDCzUy6SzyP8Dg":{"text":"We loved Sylvain! We took a short vacation to NOLA in February, and Sylvain got us in with","useful":0,"cool":0},"dfApmyterQXlWcX5BEBrgw":{"text":"The food here is superb! We got here right as they were opening by going down an alleyway ","useful":1,"cool":0},"Q5PvQBhEaVjQWCvRhfZ_xQ":{"text":"We had a wonderful experience at this restaurant. Great service, food & ambiance. We had a","useful":0,"cool":0},"vev5W7VoRD2D2r1kwh4N4Q":{"text":"ATMOSPHERE: 4 stars.\nSuper cute ambiance, great for date night or just dinner with good fr","useful":3,"cool":0},"n1Uky_XNXtUFDygf3nKUOg":{"text":"We stumbled upon this restaurant when in New Orleans a few weeks ago.  We were looking for","useful":0,"cool":0},"sNYJCNLJUBUF-RWUQYrIow":{"text":"The GF and I went here for a late lunch on the Friday before Mardi Gras. Locals love to go","useful":11,"cool":9},"blcQH9d4Rj3fWis1KFWwog":{"text":"So happy we stumbled on Sylvain while in New Orleans. We were looking for a laid back, sem","useful":1,"cool":0},"RwRoixHBBy6oj_orYJ6YIQ":{"text":"Ehhh. The place itself was georgous, the food was ok and the service was just above averag","useful":1,"cool":0},"UpanEy7lshRw7RP45leKVw":{"text":"Not a bad spot. Very friendly staff. The food was good but it didn't live up to quite the ","useful":0,"cool":0},"h7wEVq-MrbsO13thzS9iFg":{"text":"Shady place!!!!!!! My friend gave the waiter his credit card and it was NEVER returned BUT","useful":0,"cool":0},"AA5QMpt7XRB3JJ8ke4AWdg":{"text":"Started off with a pork belly salad and it was awesome! I had the duck confit for my entre","useful":0,"cool":0},"am_6v9LPC24c19v2vtXF6g":{"text":"What a fantastic meal! Our server, Carl C was OUTSTANDING! Everything he recommended was d","useful":0,"cool":0},"gLS1o67KGEJGppT21fWoLQ":{"text":"This place was awesome Joe was our server pork bell with the slaw! Omg !! The duck was als","useful":0,"cool":0},"YScL0aTMHn8UodpI7kl2YA":{"text":"This place is great! The food is tasty and the atmosphere is great! Went to eat here durin","useful":0,"cool":0},"w-CLxKuUen5TpDR-4b3EhQ":{"text":"The atmosphere here was cool -- very dark and trendy. But the food was average at best. If","useful":0,"cool":0},"Ni0q8i4L7bYfQMjPHU0gEg":{"text":"I made reservations here three weeks in advance, and when asked if it was a special occasi","useful":1,"cool":0},"JR3sEvUoekTcXyVGK376hw":{"text":"Amazing drinks & delicious food, great ambiance, if you can sit outside, do it!","useful":0,"cool":0},"7PVDkYy4tOutPj2AJ1j8Aw":{"text":"We really liked Sylvain!  The shaved brussels sprouts salad was incredible!  Our waiter su","useful":0,"cool":0},"TUJ1QvfsOSX6MQJZWHFOgA":{"text":"Chicken sandwich was pretty damn good, elegant atmosphere, and reasonably priced.  Definit","useful":1,"cool":0},"6VmcUJC6zzjgAP1V6zTR5g":{"text":"My husband and I came here before we got married and had a lovely experience.  Some dill w","useful":1,"cool":0},"5BB3FP-yfruWP7cD0jbzGw":{"text":"Catch-22:  You're transported to a different world in Sylvain's back garden;  the servers ","useful":1,"cool":2},"zfmHDptzMCQyW0IiOpdUQQ":{"text":"FINALLY!!! Sylvain has been in my bookmarks for so long and after deciding that I wasn't g","useful":3,"cool":3},"i72EYCZ6KyxMBoXw0HigNw":{"text":"We eat here whenever we are in Nola and love the food, the people, and the space.  The sta","useful":0,"cool":0},"AlM-fUUg08PgHVfDFuCznQ":{"text":"One of the best dining experiences we had in New Orleans.  Great authentic but not pretent","useful":1,"cool":0},"Bz2sfewXaE_K4leg356nYA":{"text":"It was 8:30 on a Sunday night. We were told there were a few reservations ahead of us, but","useful":0,"cool":0},"RqJzxeHNUsXYoHPr7A7ndg":{"text":"I found this restaurant expensive for dinners. The dinner for two with drink, entrée, and ","useful":8,"cool":8},"KPrkBsEfl6o22XU6rJvL_w":{"text":"We made the last minute decision to dine here, medium sized group of 6, at an off hour. We","useful":0,"cool":0},"cTxTZTkl4z9H5nX2R-8Cjw":{"text":"Sylvain was our last restaurant stop following a week of dining and exploring in New Orlea","useful":0,"cool":0},"R3ZxwTJGOfzc4KxJpE5oww":{"text":"One of my favorite places in Nola. it's so versatile - a quick drink with friends or a rom","useful":0,"cool":0},"IOQj5fDYl3J268ORnajEgg":{"text":"Absolutely awesome. Shrimp & hominy was outstanding and the Seared Pork Shoulder...oh man.","useful":0,"cool":0},"nOltWPrs3TxbsFJDomepzw":{"text":"Had a wonderful evening here with a group of nine. Service was great the food was deliciou","useful":0,"cool":0},"gYqlWZu7RN1O-sd68AgnNw":{"text":"Food and service were top notch.  Wife had the drum and it was perfectly cooked.  I had be","useful":1,"cool":0},"M2msGLjenbRrs1l5RvOcIQ":{"text":"Excellent spot, I stopped here on a friend's recommendation as I was going cross country. ","useful":0,"cool":0},"SgYb8vPvJL188_vF7jGB3A":{"text":"Absolutely, positively, without a doubt a can't-miss spot in New Orleans as a whole, and e","useful":1,"cool":1},"vJMp5gPqkk0wKaLbHNBxDg":{"text":"Delicious. This was by far the best meal I had in New Orleans. The tomato/crab salad was a","useful":0,"cool":0},"cqCxusizvXbkEiJKRrZpXw":{"text":"Ok. We are local. We have been coming here since before anyone knew it was cool to come he","useful":0,"cool":0},"8HzszRiPhj2Av7nR9djfkA":{"text":"Nice place, food was good. The Brussels sprouts mountain was overrated. Tasty but not mind","useful":0,"cool":0},"x149f0vB-fRHum4xtZexhg":{"text":"My wife and I had brunch here on Sunday 1-26-2020. When we arrived the wait was 20-30 minu","useful":0,"cool":0},"fKUQ3hrs7GVtKcLQjv6_iA":{"text":"Sylvain is my favorite restaurant in New Orleans. Great atmosphere. The food was amazing. ","useful":0,"cool":0},"AtRxqlrjBbfcAsHEBgRqTw":{"text":"Best meal I've had in so long. We splurged on this place and it was totally worth it. ( Sh","useful":0,"cool":0},"REIWbTHJGMl7iaVJ8DgMBA":{"text":"I had a beautiful meal here. We had the pickled shrimp special with squash, okra, and toma","useful":1,"cool":1},"Sy-wIIxv1Tc1hP43xBSEfg":{"text":"Very nice place. It was my 2nd time here and it didn't disappoint. Great salad starters as","useful":0,"cool":0},"5OJB8mkHZJ_Aq3lCYJNAQA":{"text":"This place was wonderful! We had the chicken liver app and it was melt in your mouth amazi","useful":0,"cool":0},"54bNrGTrkg6XNClVaj8rsQ":{"text":"We had such an amazing brunch experience here a few weekend ago. If the weather is nice, t","useful":0,"cool":0},"EDGFqtpCmHB_4PwIw9wVqw":{"text":"Not sure what I just experienced.  Been coming to NOLA couple or three times a year since ","useful":0,"cool":0},"vZqnd7lq4Z3Qy7Jrjx7-Ag":{"text":"The food was ok, nothing really bad but not great for the prices. We had two apps and thre","useful":0,"cool":0},"zhMPUvJITrfcWuo_Pu68aw":{"text":"We ate at GW Fins last night and had an amazing experience with food and service. While ch","useful":0,"cool":0},"Sd7F0VstUelZHCQfdxlqgw":{"text":"We sat inside and it was a nice, intimate setting. We liked the atmosphere, and the staff ","useful":0,"cool":1},"vfOY1TNVi3o7EN9hGb84ug":{"text":"I am saddened to have to write this review. We ate here about four years ago (sitting at t","useful":0,"cool":0},"H1yj3rCToL1TKCbmYYUvlw":{"text":"I went to this restaurant over a year ago and still think about the roasted golden beet an","useful":0,"cool":0},"wV9SZJheQYNcX-n-0cJzCg":{"text":"Simple yet upscale is the way I'd describe Sylvain.  It's a cozy restaurant: tables were c","useful":0,"cool":1},"R8nwnhhAshtP41nEkngOgA":{"text":"Went to Sylvain during Mardi Gras and it was great! I got the fried chicken sandwich along","useful":0,"cool":0},"Lf4eVrll1RoBzYmpkGhvoQ":{"text":"Phenomenal. One of the best restaurants I've ever experienced. We had the beef cheeks and ","useful":0,"cool":0},"aGNMLInwSc1dmjFFZZB9dA":{"text":"Brussel sprout salad and chicken sandwich! Go go go! Wait staff was friendly, atmosphere w","useful":0,"cool":0},"BjKgI6zRs1ldtEptBCRhKA":{"text":"My boyfriend and I were lured in by the seemingly romantic atmosphere. But after ordering,","useful":2,"cool":0},"ZjGKUHdZkt5aJ1jYOv8dNA":{"text":"There for over an hour and left after only receiving appetizer. Management was unapologeti","useful":0,"cool":0},"EDtdPm13cJ8qGZextw_ODg":{"text":"Very nice and unique restaurant. Lovely courtyard but we didn't make a reservation so had ","useful":0,"cool":0},"wJWTMbqWjaNdqc832jXqjQ":{"text":"We were in a group of 13 girls for a bachelorette party so this was planned a few weeks ah","useful":0,"cool":0},"3kL_VkgPTMOj9o6f05PEKg":{"text":"Quaint setting. Excellent, knowledgeable server. Great food. The shrimp and grits were per","useful":1,"cool":0},"_cbe1Ucvha0zZibmjUATxA":{"text":"I can't believe this place has good stars. The rice literally tasted like straight up salt","useful":0,"cool":0},"ZUMfcHPtJ8lUrgrzKm19Hg":{"text":"We visited Sylvain for the second time on Saturday evening, and it was absolutely wonderfu","useful":1,"cool":0},"2wq7lbIZmjKNo_L4nySh7w":{"text":"**GREAT AMBIANCE, FOOD, AND COCKTAILS**\n\nThere is no \"front door\". \nGo to the courtyard an","useful":23,"cool":22},"IkN8OW_gknTaLAD8kZ6NZw":{"text":"I came here for brunch and it was definitely one of my favorite restaurants. The entrance ","useful":1,"cool":1},"EFvSR_6h8Wlw4Met1S5l_g":{"text":"The service was great, the vibe is great and the food was good. I really loved the cornbre","useful":1,"cool":1},"vkN1uLnvLYFyGMlWJZ0emg":{"text":"We had actually eaten in Sylvain two years ago on our last trip to NOLA and I completely f","useful":2,"cool":1},"Di9VyaKOcbox8AJUAasVmA":{"text":"My boyfriend and I dined here a few weeks ago for a casual dinner in the courtyard. Servic","useful":0,"cool":0},"nbxCzX-DjJbqNtV-ePIPew":{"text":"Best meal I had in New Orleans. It wasn't New Orleans cuisine, but it still made the top o","useful":0,"cool":0},"LvOr-VmEnYTPEZdGQi3gtg":{"text":"We were feeling fancy for brunch and had heard good things about Sylvian. We were the firs","useful":1,"cool":0},"5uG-sZN89UoLwpQ19pCRwA":{"text":"I can't believe how long it has been since I've been back to Sylvain. My friend and I were","useful":17,"cool":13},"kbS_vn0qO_iB_ywn62_U4Q":{"text":"delicious pulled pork done up like crab cakes over a bed of pickled collard greens and gri","useful":1,"cool":1},"FcsxqE-XCO3zzzw81qItCA":{"text":"I ate here for coolinary the morning of red dress run so it was a little packed. Fair warn","useful":1,"cool":0},"ZIXLAT6vqUdk4r46NVJkqg":{"text":"My girlfriend and I decided to go to this restaurant on our first night in New Orleans and","useful":0,"cool":0},"CZoUBZrCv52XoIfSn_T0kw":{"text":"Superb staff! Trendy space! Really enjoyed the vibe and menu selections! However...\n\nSALT!","useful":0,"cool":0},"xViWgprD163TlGfMBTZc5Q":{"text":"Wow. What a good meal. We highly recommend the pork belly, seared duck breast, shrimp & gr","useful":1,"cool":0},"-PKtIQGs7tz-eIJhOH3jig":{"text":"First time I tried to eat here there was a 45 min wait so I made some reservations this ti","useful":3,"cool":0},"V-33AiNeXn5pCsXOLIBXeg":{"text":"Definitely a little pricey but the brunch was deliciousm I visited after a recommendation ","useful":0,"cool":1},"L-H4NKkMczugh0cHicXBXQ":{"text":"The food was really great! The staff was super friendly and they know the menu! It is a bi","useful":1,"cool":0},"pLHpmVZ1uyy6laSKag2WgA":{"text":"Deciding between two and three stars for Sylvain was tough; I finally settled on three bec","useful":5,"cool":0},"QGayIMHc3WPFKD6hfYeORg":{"text":"Not sure what I just experienced.  Been coming to NOLA couple or three times a year since ","useful":0,"cool":0},"_WaTYYIG4rQE6kaQK7ZZtw":{"text":"Love the atmosphere, with the candlelit bar area and beautiful courtyard. Cocktails were o","useful":0,"cool":0},"TnRBUE3P_SD4i2NV394EfA":{"text":"Delicious food, amazing drinks (might've drank way too many Omar's Flips) and a fun and in","useful":0,"cool":0},"bR2uYjJk3i50mkQDlJmQ4w":{"text":"Sylvain was a really cool tucked away spot. My boyfriend is a Yelper in training ;) so he ","useful":3,"cool":1},"lcVyoajpMaSmRmpsxeXBLw":{"text":"Best food in the quarter, in my opinion. Delicious, inventive food in a mysterious and dar","useful":2,"cool":0},"JLCziF2VriMdHXxViVAdeQ":{"text":"WARNING. This is a wonderful restaurant if you are a big fan of horrible food; very minima","useful":0,"cool":0},"ttvdHNW6hBj2jh20WtL1Gg":{"text":"Amazing service start to finish. Comfortable and beautiful atmosphere. Delicious food. Get","useful":1,"cool":0},"pggbJK2mLdrN-BfRs_iSIg":{"text":"One of the best meals I've had in ages. I was in love with everything about my experience ","useful":0,"cool":0},"5TC31TnIhQbygDah0mMylQ":{"text":"2nd time at Sylvain but first review. When you have 2 great experiences at a restaurant it","useful":0,"cool":0},"hx1bFNT_653ug8mHEJZcsw":{"text":"Pretty amazing, just have to do it. We order a bunch of stuff, everything was great! The p","useful":0,"cool":0},"wzA1DIFXd7CrWGBNeMzaZQ":{"text":"Great atmosphere and good food. We had a long wait for our main courses but the management","useful":0,"cool":0},"rCIHtcJbQGfGew0UQEXAKw":{"text":"Made a reservation for two at 7pm about three weeks in advance. Arrived at 645pm and still","useful":0,"cool":0},"cMioJAuuJ5CLaE5uY9QITA":{"text":"Best fried chicken sandwich I've ever had. My daughter's market salad was also delicious. ","useful":0,"cool":0},"bcFH-lXz6MpnUM3SD9F1FQ":{"text":"When people come in from out of town and ask me where they should eat, this place is alway","useful":1,"cool":1},"48ypRL7tVMTnyaPSoNv8MA":{"text":"Delicious  would definitely recommend the chicken sandwich and the chocolate dessert. This","useful":0,"cool":0},"ggHTQLUDVgOLoEMjXwaSLw":{"text":"You know you're in for an interesting dining experience when you walk into the courtyard a","useful":0,"cool":2},"ipmj5cHcC5ONrMgDYIaDnQ":{"text":"This review only qualifies for work lunch and that only means lunch on a Friday, since the","useful":9,"cool":4},"rCPSaKTxpHBoENb8ee6MVw":{"text":"Cute spot in The FQ! Make reservations for dinner. Dress is casual. We got seated in their","useful":1,"cool":1},"x1cq-qg3drOyvsofjAppzQ":{"text":"Poor service from the top down. Owner is a jerk, we waited for 45 minutes between courses,","useful":1,"cool":0},"8eOp3Gt0jNXSyXRqb29oVA":{"text":"Quite saddened and offended by the service we received here. The bartender asked for our i","useful":0,"cool":4},"GYRDYOrG1nbbMj64H0spKA":{"text":"Very cute and friendly fine-dining experience ! Our waiter was knowledgeable and timely! T","useful":0,"cool":0},"HFjyRwj5-45xwX8xazUUNg":{"text":"Had a great meal here in their lovely outdoor space --eggplant tartine on tasty focaccia a","useful":0,"cool":0},"fBXj5zeXmNE8ndbBKBX_gg":{"text":"The least I could do is give Sylvain a glowing review. The food, cocktails, & ambiance wer","useful":0,"cool":0},"GkDFMwXUiDSutDO7gudDJg":{"text":"I really enjoyed this spot - lots of great things on the menu and the service is very frie","useful":1,"cool":0},"eUu7-V8Q6XtqPLKi5uWURA":{"text":"Wow, we had such an awesome dinner here last night. Love the low/dark and red sultry light","useful":3,"cool":1},"wM2v0FwK_rerOueP0mxZWA":{"text":"Only had a specially cocktail here and it was very well crafted! I came here after the lun","useful":0,"cool":0},"c4io-Al7yXMCT6wD0_WInA":{"text":"A few years ago, my wife and I were in New Orleans and were recommended Sylvain for dinner","useful":1,"cool":0},"iw8S5ebD2FXzMWgpdKSYjA":{"text":"This was my favorite place we ate in New Orleans. Wonderfully executed southern fusion foo","useful":1,"cool":1},"nZ10ZihiWPtx4c1GnYZwTg":{"text":"My favorite French Quarter restaurant. Good cocktails, sexy cool atmosphere, and a delicio","useful":0,"cool":0},"FWn7skKeV4Lg7ynUAjZfgg":{"text":"To start, the ambiance as you walk in is absolutely stunning. Our hostess was incredibly f","useful":2,"cool":0},"ehDecZ8L1Tx9lm82Bd9eNQ":{"text":"Our food was good and our server was great! The cooks put together a vegetarian pasta on t","useful":1,"cool":0},"KYAd5XPXsjWXSg0JW6UU-g":{"text":"I've heard great things about Sylvain, but left a bit disappointed. Service was mediocre. ","useful":0,"cool":0},"BH07qltrVSjK-m4gpfZV8w":{"text":"Oh man this was a great experience!! After being ignored at one restaurant for 30 minutes,","useful":2,"cool":1},"IEGZ8sbzRwEHqVSaZpfdpQ":{"text":"I visited this restaurant on July 7th. Me and my friend were the last customers to come in","useful":0,"cool":0},"gvBUQM_wGJnWrRunRYIXzQ":{"text":"We stumbled upon Sylvain looking for somewhere laid back for a quick mid-morning meal. We ","useful":0,"cool":0},"GV_C0QuMtkkcgzCbr_ZS1A":{"text":"Started out as only champagne menu in New Orleans with imported wine list for a concept do","useful":0,"cool":0},"4KAY0GpKIAakNTf-x_rG0A":{"text":"The food was delicious. The ambiance was perfect until we were asked to stop being so loud","useful":4,"cool":0},"E_yNOxvvewRPCTkUS0MH8A":{"text":"I think this place is hit-or-miss.  It's uber-trendy and quite pricey.   Some menu items l","useful":0,"cool":0},"lOixqic92mItG7_ID8vWHw":{"text":"Loved it!  Great spot for a nice dinner on the patio when the weather is great.  Server po","useful":3,"cool":1},"215WGGIaDrphLsI3KJzsow":{"text":"What a cool experience. It's way too dark in there and a bit hipster, but we got pre-amped","useful":1,"cool":0},"rRxbKS1b4NYFrUUzkAnQkA":{"text":"Sat out in the courtyard. Heaters kept us warm despite the cold front coming in. The Garli","useful":0,"cool":0},"UPKOq3Jgs4ysnGXD8lTj9g":{"text":"Dope courtyard, feels a bit velvet stanchion only to unveil a bar/main dining area and kit","useful":6,"cool":4},"3MWt36XqH4goegfZIHuj_A":{"text":"I checked previous reviews before posting this one.\nI wanted to give them the benefit of t","useful":0,"cool":1},"rPshpZ39b2Js4ThFeYDJiA":{"text":"I'm a huge fan! For drinks, we had the No Fun and the Monkey Hour. They didn't skimp on al","useful":0,"cool":1},"68oU5tdxLPPsTbvGUvnb7A":{"text":"I'm going to tell you what's what, but first let's discuss our arrival: \n\nI have never bee","useful":1,"cool":0},"JgJtIk3or3yKj2IO45_pjQ":{"text":"Probably nice people but terrible service -like, really inconvenient that we were there as","useful":0,"cool":0},"GDkGVEqlErT1yGOt-zxW0w":{"text":"I went there for dinner Wednesday with two friends and had a wonderful time.  The drinks w","useful":0,"cool":0},"HNep6Hhz84otnjDDfXvEVg":{"text":"First off, the message from the business about not accepting reservations is not true.  If","useful":0,"cool":0},"aCTSfyrCZst-J7ZcQ7cYCQ":{"text":"5 stars all the way!  What a treat this place was.  \n\nWe started with the Chicken Liver Cr","useful":0,"cool":0},"msa2D-SwayAoa-pwUyIgGQ":{"text":"WARNING. This is a wonderful restaurant if you are a big fan of horrible food; very minima","useful":0,"cool":0},"Pz99omK2WYP4ezZVrbaxrg":{"text":"I had heard so many good things about Sylvain and while our meal and experience was good, ","useful":3,"cool":0},"LpKfWRMns83adp1gK4Y0qw":{"text":"This place was amazing.  Great service.  We had to wait about 15 minutes even though we ha","useful":0,"cool":0},"xab92qEqW43PuqU_G-KEwQ":{"text":"Pricey but excellent.  Their signature dishes are pork shoulder and beef cheeks - both dis","useful":0,"cool":0},"lOEsjQ1tjPdazderroUO5g":{"text":"Great place for a foodie in New Orleans.  Was going to New Orleans to meet up with some fr","useful":1,"cool":0},"dO2mPwnZ4ThTULJf1OzqIw":{"text":"The best brunch in the Quarter. The new Hash dish is outstanding. Glad the the frozen drin","useful":0,"cool":0},"Id7fmw0mUB4G2NqLrqiMCw":{"text":"Our first meal in New Orleans did not disappoint! Great food, atmosphere, and service. Mat","useful":0,"cool":0},"3NhqYaDPRBJ0dk4XGh4XtQ":{"text":"So tender, you only need a fork. So small, you should definitely start with an app. Nice t","useful":0,"cool":0},"CKdo61D8jJy5nFxI59_gAg":{"text":"Really one of the best cocktail bars we found. The food is good just a lot of meat for me ","useful":0,"cool":0},"3taXFBtagpl6W_BzUIfUdg":{"text":"LOVE LOVE LOVE Sylvan! The cocktails! Amazing. The chefs...nailing it. Service! Ok, note t","useful":0,"cool":0},"vIVTZlZU65l32GfHJJ0TWQ":{"text":"Sometimes the meal is so great that it doesn't feel right to me to take pictures for fear ","useful":0,"cool":0},"WK1pFKC6KwyKzz_25A6BxA":{"text":"Not a good experience. Food was lukewarm, including fries. Gnocchi was the size of an appe","useful":1,"cool":0},"SaigzVVfSiJfM5LPdRDjTA":{"text":"Sylvain! What has happened to you? I've loved you from the start and even celebrated two o","useful":1,"cool":0},"6CWLY6GfxCMsfwYnZVvooA":{"text":"Non-touristy In The Tourist Zone \n\nI've never been a fan of FQ restaurants as they tend to","useful":2,"cool":0},"GAweOYPlC1bcT6VKr2GZEA":{"text":"Super cute courtyard area. It had a nice cocktail program and the food was really good.","useful":0,"cool":0},"-gQ8C0S2ut04GMVA7rFHcg":{"text":"We read that the garden seating and the cocktails were spectacular so we decided to try Sy","useful":0,"cool":0},"RELSkVMSP-k2KtiA_CztcQ":{"text":"Horrible slow service that is snobby and condescending. Out of 6 meals one came excessivel","useful":0,"cool":0},"RWM90kASlAxwY79_bEeOyg":{"text":"Fantastic - the carrot dish and long grain rice dish were both out of this world. 5/5!","useful":0,"cool":0},"9aQ0G8NJD4XxMJaF1Ih9dQ":{"text":"Best restaurant in the quarter :) had the fried oysters and crispy pork belly .. unreal . ","useful":0,"cool":0},"07tDdjHHt5limGEnlD2B0Q":{"text":"The best bar in New orleans. The ambience is cosy, and dimly lit. Our bartender was nice, ","useful":0,"cool":0},"gM8xWsDUh5P_2KFT7Xbvsw":{"text":"Wonderful farm to table approach and excellent cocktails!","useful":0,"cool":0},"JBoR8-NrI3J_NahkWosRlw":{"text":"This place always gets 80% of our meal perfect--great beef cheeks, to-die-for oysters on a","useful":0,"cool":0},"WWqtesHpm0iZA7-5Bt6xJw":{"text":"Waited an hour and a half for entrees. Watched everyone in the restaurant eat then watched","useful":0,"cool":0},"wxlyG-s5zz_FK_iky-v2rg":{"text":"I cannot even begin to explain the mouthgasm I experienced at Sylvain. We arrived to New O","useful":0,"cool":0},"3sytuPwUyncyrovecglqjA":{"text":"What I loved the most about my visit to Sylvain was its concept on how in order to get int","useful":0,"cool":0},"n3xo4C_ZFQ39r1LEgpByYg":{"text":"Loved Sylvain!! Great atmosphere, really good drinks, and good food.  It was nice to have ","useful":5,"cool":1},"cLOrI2voK3Y-Br-1f_8Zkg":{"text":"This restaurant was great! The food was delicious, and the staff was very conscious about ","useful":0,"cool":1},"Sv0JWX_9p-CfxDH5OAVeAQ":{"text":"This was one of my favorite places for dinner in Nola when I visited. The vibe at Sylvain ","useful":1,"cool":1},"OMuIRnAVSPzkqlT3NhhMkg":{"text":"A great restaurant right in the Quarter what a WIN!  I'm usually not a fan of the more tou","useful":2,"cool":2},"eVh7klroMEOli57EFY3sXQ":{"text":"After having brunch at Cafe Amelie on a Sunday, four of us went out in search of a respect","useful":2,"cool":1},"dE-wwytyckJwjz0vPqutmg":{"text":"We made reservations for 5:30 and got seated at 5:50. We ordered our apps and dinner at th","useful":1,"cool":0},"ekJ20V-Wl3XwmFmTH-3t1g":{"text":"Hidden gem of a bar. Was walking towards my\nHotel and encountered this hidden place. Drink","useful":0,"cool":0},"t1v4WYCQLMeMvKjGCSu0Yw":{"text":"I'm a bit conflicted on this review because there were some really nice things about the r","useful":1,"cool":0},"2_b50rhgvx2OXyVQuGa6zg":{"text":"We arrived the day after Kraftwerk played a gig in NOLA (2017ish) - but fear not we'd just","useful":0,"cool":0},"D2Ml3owbxPH-TWxPksmvSw":{"text":"Expensive but well worth it, I wish the quarter had more restaurants like this.  Loved eve","useful":0,"cool":0},"X3Hz9jh8VZZfWl8iALqkdw":{"text":"Best meal I ate all week. Brava!","useful":0,"cool":0},"dlPD8OUv8GPZuC6Rv5aywQ":{"text":"Excellent service, fantastic drinks (best Sazerac in town), good light food fare. Definite","useful":1,"cool":0},"XzaaLxz8GePlk7vkYtcJlg":{"text":"Stopped in for brunch on New Year's Day. The French toast with caramelized bananas was out","useful":0,"cool":0},"Gu5RgqsKR7rSElieDH2PpA":{"text":"We had a great experience here, even so we had to wait a bit. The food was tasty, staff fr","useful":0,"cool":0},"hQnX-cIFpKYFAxqUiqgknA":{"text":"Ode to Sylvain\n\nBehold, Sylvain, hear my ironic roar\nStraddling high and low; confit, 'chi","useful":2,"cool":3},"gZlr48EqSXXGfcrM3RZjrw":{"text":"Nice atmosphere but my burger was pretty average and dry. Don't know how anything else is ","useful":0,"cool":0},"TJLuhA1RiX7CZR0t0EpDKg":{"text":"Bachelor party 100. I don't post and I don't because I can cook better than most of the am","useful":0,"cool":0},"mPaFazxgAjJGNZQ1sCIOkQ":{"text":"This place was all around amazing: the decor, service, and vibe was superb.\n\nI went here o","useful":0,"cool":0},"h_3tQUezO6ptm4Ai0epOYA":{"text":"Love this place! Great cocktails and atmosphere.\nModern Larger was our favorite cocktail!","useful":0,"cool":0},"1VaenNTtoTGGHABwbrK9zA":{"text":"Loved this place! Grilled shrimp and antipasti app were amazing. The service was great too","useful":1,"cool":1},"BKwnjX6gbvOaxhQ8gCesMw":{"text":"Good service and friendly waiter,  but the food really killed it for me. I ordered the ric","useful":0,"cool":0},"4ZgxHF1oXIdQqc_Usnpfqw":{"text":"I wanted something simple and got the cast iron cornbread and house cut fries. For some od","useful":0,"cool":0},"Ack4pwaKjGgLciM_64SlZg":{"text":"Champagne & Frites. Is it an absolute splurge? HELL YES. Will it make you giddy as hell? H","useful":17,"cool":22},"tU3gEQ1nmqpyC7tckM3bMw":{"text":"We ate here over the first weekend of Jazz Fest.  Restaurant was extremely loud and our wa","useful":1,"cool":1},"J_yAv51-xRb_46wzJKuldw":{"text":"Very cool place. Love the layout, the vibe, the decor, and the staff here. All around, the","useful":1,"cool":1},"TS870SNdUMkvXChJt_XVAA":{"text":"Hubs and I visited Sylvain for breakfast a few months ago.  It is a shame we had not visit","useful":0,"cool":0},"CxzRFE_JR7ArwPn_d8qQxw":{"text":"The food (chicken sandwich! hamburger! brussel sprout salad!), the drinks (all of them!), ","useful":3,"cool":0},"KRP3HDBHEgQsVHh_XwOoyw":{"text":"Rude. Rude. Rude. Terrible service.  Not nice people. Don't waste your time or money. Thes","useful":0,"cool":0},"khWdU6Dr6h3rNlW_33hlmg":{"text":"I was on a vacation and came here on my birthday. I don't remember our server's name but h","useful":0,"cool":0},"AtV9aDUIwbZ23IcibHrEHQ":{"text":"We only ate apps here but greatly enjoyed our drinks! Get ready to pay the average but sti","useful":1,"cool":1},"nihn0wYc9ac2q_iOidstQw":{"text":"Got a table reserved but no outside seats. I think it was just way too dark inside that I ","useful":0,"cool":0},"u4vTWE9dSZu4crhiRpOzXA":{"text":"I'd been looking forward to the Sunday brunch set up by our group for the past month. I'd ","useful":5,"cool":0},"IJ0QNgc_o8at25eAIiBZzA":{"text":"This place is not a total tourist trap, but there is one thing you must have when in NOLA.","useful":47,"cool":41},"Hcw3cSJ3WGvA88EwgHOE3A":{"text":"Great dinner last night.  It was cool enough to dine outside, which added another level to","useful":1,"cool":0},"1GEdtAfZI1VAb1tH3RSLYw":{"text":"There is something in the air in this city...where a place with with rough wood tables, id","useful":2,"cool":3},"X6QOhl60oKYrmcl-EiFA9Q":{"text":"I only hope that things improve post-COVID-19. Maitre d was condescending and wait staff o","useful":1,"cool":0},"b-4TYSWU-6MRzGIrPn8ePA":{"text":"Sylvain was one of our favorite meals while we were in NOLA.  Exceptional restaurant. Grea","useful":1,"cool":0},"naDgITOkUuO1dnZxmiCX1w":{"text":"The shrimp and grits from here are AMAZING!! The flavor is uncanny and if you hate grits t","useful":1,"cool":0},"-Z3wKFrabxpPKLPsVDUgZg":{"text":"Everything was great at dinner last night. I ordered the pasta which is house made, the qu","useful":0,"cool":0},"JqPBJq4sc-v0WxA6sYVOFw":{"text":"Outstanding! A must do near Jackson square. Laid back and high quality. Great service (we ","useful":2,"cool":1},"QyqAqiqobbqK2g8uQxYl0w":{"text":"Everything was delicious. We ordered the octopus, bolognese, and short rib. We were not di","useful":0,"cool":0},"FCxxcGVhBa_MFER4nZbEAw":{"text":"Almost everything in French quarter is tourist trap, this place is no exception.  Food por","useful":0,"cool":0},"XDXZyHL3MKlGh2bAXrCFFA":{"text":"Sylvain is a gem.  It has everything we look for--great food, casual, unpretentious but we","useful":0,"cool":0},"DlXdpb-_nrI42sn2O6d6Cg":{"text":"I've been in Sylvain probably at least five times. It's one of my favorite restaurants to ","useful":0,"cool":0},"blBSyzbO2WB0PDt_seuhkA":{"text":"The atmosphere was amazing. Try to sit outside if you can, but grab a drink at the bar fir","useful":0,"cool":0},"1R9icTStJk1JbO8zV4He0g":{"text":"The ambiance was cool (a little loud cuz it's more of a bar setting) but the food was EXCE","useful":0,"cool":0},"6guKfi_hy0JzUqGTmcYF_g":{"text":"Happened upon this place by chance. We were walking at a time that was between lunch and d","useful":0,"cool":0},"5S-3hOvWpvavE1MrHAN-PA":{"text":"The atmosphere is really unique . Everything was delicious we ate all of it all lol I woul","useful":0,"cool":0},"Ri8BtSSztnZhIH2quN3_AQ":{"text":"I'm very disappointed that I didn't have the best experience here! I wanted to like it but","useful":0,"cool":0},"lmH1WEzf9uT8G5BldOm1bQ":{"text":"I am so thankful my friend recommended this little gem while in NOLA. We came here our fir","useful":1,"cool":0},"4sn6jarJBky_OXAq_cGWfA":{"text":"Came in for happy hour- drinks were good, apps were good, service was good, and it has an ","useful":0,"cool":1},"xM01UR6tbcHefiMFs7Vtfw":{"text":"We were initially concerned when we called the restaurant to tell them we would be 10 minu","useful":1,"cool":0},"aTlrXxOpaovaLonUcK9UeQ":{"text":"Revellion menu was bad and not worth the $70. first the portions were for a child , second","useful":0,"cool":0},"r3DADQ_cgRLmoycnOOiXbA":{"text":"We had never heard of this hidden gem and it is well hidden near the cathedral, across the","useful":0,"cool":0},"Q0PAlqhwUnsgvaPVFwPayQ":{"text":"We were recommended this spot by a colleague and it delivered. Warm and welcoming staff an","useful":1,"cool":2},"rpfMKR5mJ5xKSnnJFYotyg":{"text":"Sylvain was great! The atmosphere of the courtyard is amazing, though a couple fans in the","useful":2,"cool":2},"0VLeiylZyCHA3aew8_RTCw":{"text":"oh my god this restaurant was a true gem. imagine a dark, candlelit vampire restaurant hid","useful":0,"cool":0},"8lm2mcxjoo5V1XrxT24XkA":{"text":"Huge fan. \n1. Be sure to make a reservation. It's not a huge place, with a small bar, a qu","useful":3,"cool":3},"f_qXv1feFH1h1JGJFYMEJw":{"text":"Y'all.  I can't believe I'm going to say this--the Endive Salad at Sylvain is simply devin","useful":2,"cool":0},"9cF7sDx4GX4qAcHlVgJPLw":{"text":"We came here for a bachelorette dinner and really enjoyed it! They accommodated our large ","useful":2,"cool":2},"gDRujK58eg4vHFPr-KsvQw":{"text":"After seven years, it's time to update my review.  I'm thrilled to report that after all t","useful":13,"cool":13},"zPrLANNYA4l3lktF66joeA":{"text":"I have revised my rating from a four to a five-star, since the restaurant graciously reach","useful":0,"cool":0},"c1S-5tDNKa9dMc9i61r1dw":{"text":"Second time, even better than the first! Restaurant experiences just don't get any better ","useful":1,"cool":0},"RuuVF4k4tQYn2AU7CnDzpA":{"text":"Sylvain drew my companion and I in on a rainy evening with it's beautiful atmosphere and i","useful":1,"cool":1},"2eF8-1CdXEKNUuAjyxEmyA":{"text":"At first we thought this place was nice but slowly me and my friends realized we made a te","useful":0,"cool":0},"y6Q9U0uqNeQM7RhMtOnuVA":{"text":"Dined here in 2018, 2019 and tonight. Covid hasn't prevented good service or food here. Sy","useful":1,"cool":1},"JFMABEdWq-HKYV99vlo4EA":{"text":"This was probably the most disappointing meal I had in New Orleans. I had planned on the s","useful":0,"cool":0},"s4QFCLOIPdSGGVd3g9_HKw":{"text":"Came here after hearing about how Greta the cocktails were and this place did not disappoi","useful":0,"cool":0},"xq6LkxcKRNxFCDbdV534Fw":{"text":"The staff and servers were incredibly helpful. Took pitta on two starving souls with out a","useful":0,"cool":0},"6BDZCqo8NtE8Wnf_HE6I2g":{"text":"Great craft cocktails. Food was meh   Service was indifferent (except at the bar). Seems l","useful":0,"cool":0},"IhynAYWMnFRLQzDN-at28w":{"text":"Favorite restaurant we visited in New Orleans! We stumbled upon it as their courtyard look","useful":1,"cool":0},"1T3LAismcNyHCPln4i5Ruw":{"text":"I came here on a Saturday with my husband to celebrate our one year anniversary.  We had a","useful":1,"cool":0},"wuUgXcfQeq-CzCmzuiWp5g":{"text":"Was seated without a menu for 20 minutes. Tried to be open minded for covid as I too am a ","useful":0,"cool":0},"0TG4AODemNxM4z3ESohivg":{"text":"Courtyard is cute and very intimate. Hostess was nice, as was our server Tristan and the r","useful":0,"cool":0},"3macH03TYkbM2Y-B3Fmj6g":{"text":"ARID: Chick-Syl-Vain is served sans condiments, I actually dry-choked on my first bite;\nTE","useful":3,"cool":0},"4bguIagaZQqwXOf-OvvQXQ":{"text":"Soooo happy Sylvain is open again!! Yay! Post-Covid they have made changes and being so ca","useful":2,"cool":1},"q-RABaKzmHULtAm0VSNf-w":{"text":"Had brunch here, it came highly recommended. I was hoping for shrimp and grits like I've s","useful":0,"cool":0},"Dyisc754eJwH2oXbp7XJ2A":{"text":"OMG!!!  This place is amazing!  The hostess was welcoming, friendly & personable.  Carl (o","useful":0,"cool":0},"wy27RmnW26uIpJ5Lusi1QA":{"text":"It's hard for me to give this five stars due to how expensive it was and how small the por","useful":1,"cool":0},"CRqKHcDE1kghkPyhBvmIjg":{"text":"Nice looking place and service was good. My wife and I were excited to eat at a place with","useful":0,"cool":0},"zMPTWhOMj9F52maO53jreQ":{"text":"There are two types of people in the world:\n\n1) People who think the Pork Shoulder at Sylv","useful":1,"cool":1},"sZdNkfHgoCXqZRPU3hf_5w":{"text":"My wife saw online that Sylvain added a Nashville Hot Fish sandwich to their menu so we ra","useful":1,"cool":0},"bz_EVifOVbxAvuhHwcUj7w":{"text":"The menu was very limited, probably due to covid. Definitely try to make it for happy hour","useful":0,"cool":0},"kv2NlNzBVLiFl7cIY0sVuw":{"text":"This used to be a great place to go for a date night. It was dark and romantic with exciti","useful":1,"cool":0},"1c-K5PPebcWDjv4aZ6RmNQ":{"text":"What a shame. This place was horrible. Small selection for brunch and service was pathetic","useful":2,"cool":0},"tB5mqex78weUgdHCD5VZAg":{"text":"What a beautiful and cozy restaurant. The ambience is wonderful and the servers enhance it","useful":1,"cool":0},"FsB0tW9SMxrM9-3VrDnmSg":{"text":"Been coming here for decades and think the chef must have been replaced with someone new. ","useful":0,"cool":0},"09RVErkoxk7MOssLoKffVg":{"text":"Good food and service for a lunch/brunch. Pretty courtyard. Pleasant waitress who left us ","useful":0,"cool":0},"wcU3F-FFECjt0MDYm_vibA":{"text":"I was in New Orleans for some work post-Isaac and decided to try this place out based on s","useful":0,"cool":0},"Ihi97ivXUh_azjFjV6TZ0w":{"text":"I love taking out-of-town guests to Sylvain. It has all the nice things you love about New","useful":1,"cool":0},"9zQwSAbe7UwoakMLOWQiJw":{"text":"I had dinner at this classic French quarter restaurant on a Monday night.  It comes with a","useful":3,"cool":2},"u8M8luB-QoMxR3Cnz7stLg":{"text":"During the hectic and crowded French Quarter Festival my friend and I were steered toward ","useful":0,"cool":0},"dZdfWixzMtl8eQGWlp51_g":{"text":"Today was my first time at Sylvia. OMG CoCo was amazing!!!! Her attentiveness, her smile, ","useful":1,"cool":0},"JRx659rSyRs-jIEtYqPCzw":{"text":"Have had 2 somewhat different experiences.\n\nWith that being said, some things were consist","useful":1,"cool":0},"Abm0346PMO_1ssAfUH9qwQ":{"text":"Food was very good. Alcohol free drink selections included a virgin Moscow Mule, which I a","useful":0,"cool":0},"FkzaPX6ogHHA8TGtzYPOwA":{"text":"This place is such a cute little gem of the French quarter. My biggest suggestion is to ge","useful":2,"cool":2},"yircbCXv87PrrpSfzi76AA":{"text":"I was so excited to dine in this restaurant because of the beautiful atmosphere but was so","useful":1,"cool":0},"VEAd2uqLrVzN1I8_7T2Q0Q":{"text":"Everything we had was so good!\nDef don't skip the pork belly it's done in a way I've never","useful":0,"cool":0},"NGHY6Jv7GLMAetBGEaePzQ":{"text":"I absolutely love this restaurant, but after last night I will not return. They took the B","useful":0,"cool":0},"LvrcxfGWyQr8LXkZBNbnRw":{"text":"Tucked away down a clean, narrow, cement tunnel that opens into a veritable Narnia, with i","useful":1,"cool":0},"1li7sTkSC1iVru-_5w8mfg":{"text":"This place was an accidental find on a cold breezy rainy day in the French Quarter. I hear","useful":5,"cool":4},"Wq_aPPoYJlN6O3Uj4FIfnQ":{"text":"Glad I re-found this little French Quarter gem.  I stopped in years ago but was not in a s","useful":1,"cool":1},"om4f7ABqE3ygej1QN59o6w":{"text":"They didn't have a large menu option due to covid however they're service was very good an","useful":0,"cool":0},"OlGIm7j7MRZeW-C99mQxew":{"text":"I have always loved sylvains...always tell people they should definitely go there best bur","useful":0,"cool":0},"2MHwPpJ7umSEVm-U7wWxrg":{"text":"Came for an impromptu early dinner on a Sunday. Couldn't get a reservation for 4 on open t","useful":3,"cool":2},"uKrTDTe0VBLvJXWMviAGVQ":{"text":"Not much is open in the FQ on a Monday night and we were looking for a place to eat close ","useful":0,"cool":0},"E24gITgJL5c61T-h_9PT7g":{"text":"Walked in for dinner/drinks on 03.11. There was a bit of a wait but there was space at the","useful":2,"cool":1},"WS6xi72uJ0S-QYKeQjQQUw":{"text":"I thought I took pics of my food but apparently I was wrong. I ordered the sweet potato ha","useful":0,"cool":0},"zrv6rjaHWGFCOPb_TcqR7g":{"text":"We get accommodated as locals so nicely at Sylvain, always good food, it was my 12yo's rec","useful":1,"cool":1},"MQwhhmmbyQaZ55AV5DU4cA":{"text":"Amazing! The drinks, chicken sandwich, dessert... perfection. I rarely eat meat and was co","useful":0,"cool":0},"36vMixgxUb-i4tkWSw3ApA":{"text":"Went here last night for dinner.  Vibe is dark, date night, bar-ish.  Not a place to bring","useful":1,"cool":1},"5cbLzCSIm3V2BNO01DZjVQ":{"text":"Wonderful atmosphere. Beautiful outdoor seating. The adobo pork shoulder is to die for. Aw","useful":0,"cool":0},"ZQcc293TGzCE1vqhR1iGtQ":{"text":"The restaurant is beautiful, and a great date spot, ambience wise. But overall it can't co","useful":1,"cool":1},"eOneq44ON2bk9R2dhhVAvg":{"text":"Stopped by because the ambiance looking through the front window.  Wanted to have a glass ","useful":0,"cool":0},"2PG4CsTBELTkED5p8CKPqg":{"text":"Amazing is an understatement. My husband and I were in New Orleans for 4 days and went on ","useful":0,"cool":0},"ebaGuMvqHxTUk88zBas7Tg":{"text":"Sylvain is a small, rustic eatery tucked away in the French Quarter right by St. Louis cat","useful":3,"cool":2}}