{"Pr1lg8xKA15KR1TChAXsPQ":{"text":"Charles the narrator really made this a great experience. His NOLA history was on point an","useful":0,"cool":0},"ItULUoHFfU3ZNa5c-VmnjQ":{"text":"Super nice cruise, very informative and fun, great way to learn some history of America.","useful":0,"cool":0},"9HViweTYwJYAPpM72R6Z3A":{"text":"We did not eat, but we did have a drink at the bar.  The food was standard buffet fare.  T","useful":0,"cool":0},"cAYFzHnRWKrlxawwW13WDw":{"text":"Such a good trip, the battle field visit was interesting and historical. Charles was aweso","useful":0,"cool":0},"kZrxJnEfu3wTcKyF3AtpYg":{"text":"We loved our cruise! I remember taking these cruises as a kid and now I'm taking my own ch","useful":1,"cool":0},"7HFPY7KgzEQmakzL2g2LMQ":{"text":"Charles was the narrator and he was fantastic! He told a moving recount of New Orleans dur","useful":0,"cool":0},"oSB4AIoXChsk0vg0GfB0eQ":{"text":"Charles is an expert at explaining the history of the battle of New Orleans and also the d","useful":2,"cool":0},"61eb78Xzfv7eIyVPO8S1wQ":{"text":"The tour and guide were incredible! Our guide painted a picture of where the Battle of New","useful":0,"cool":0},"EltSladNiuE1QtwP_L9how":{"text":"Charles was an excellent tour guide and story teller. I thoroughly enjoyed the ride to the","useful":0,"cool":0},"51tqP_MypxO8Fg70Gl3y0g":{"text":"Went back \"home\" for my monthly trip to New Orleans to see my handsome BF. Booked a cruise","useful":2,"cool":0},"7zjwNn6qV3QR8r4CLqI_zA":{"text":"Went on the Chalmette battlefield tour. Charles our historian was top notch and knowledgea","useful":1,"cool":0},"dSMNLCTDV9XzqLm_spgpNA":{"text":"Wow! This tour was everything I could've hoped for and more. The boat is nice and clean. T","useful":0,"cool":0},"FNiSSZFUoqrp1ZWe5h8FyA":{"text":"We booked this cruise at our hotel and were given emailled tickets. We go to the boat a li","useful":1,"cool":0},"8kWFAA22h3nnWm6fzyulrw":{"text":"Charles was amazing historic narrator he gave us so much informations specially of Katrina","useful":1,"cool":0},"AJtAUwdN0yzcOgZSZP4qMw":{"text":"Booked the dinner/jazz cruise as we were first timers in NOLA. It is a buffet dinner with ","useful":2,"cool":0},"q2n_AGJHgXybf5STLTUlhw":{"text":"first off I was curious about this before so just to answer for anyone else no outside foo","useful":2,"cool":0},"H_CJ19SNtNsWNPKWCxg6KQ":{"text":"The wife and I took the 2pm cruise.  The cruise was very informative about the battle of N","useful":0,"cool":0},"XLSt_eHys0XyxuDaHN6iWg":{"text":"We had such a great time on this tour! Wendel was our guide and we thoroughly enjoyed all ","useful":1,"cool":0},"-SLYTj_wI5lfWLPSHLeK9Q":{"text":"We had a wonderful time on this tour. Wendell the historian was knowledgeable and entertai","useful":1,"cool":0},"Sv6fSxN7UXWJp7UO-CXg1A":{"text":"We had an excellent riverboat ride. Historian, Charles, was smart and witty. He made histo","useful":0,"cool":0},"j9BfpUjUCOm_e16Z4C7znw":{"text":"All in all...the tour guide (Dr. Wendell!) was the person who made the tour. He was well i","useful":1,"cool":0},"5vKEr8MAyK3W-RGApq5eHQ":{"text":"I visited New Orleans for the first time in January and this cruise provided the perfect i","useful":0,"cool":0},"IKMpv-4qr0G3KLTRlPxiLw":{"text":"Great history lesson while cruising the Mississippi.  Our guide Charles Tidmore was fantas","useful":0,"cool":0},"G5D1_RpKnNAgDr_dKVB9fw":{"text":"Charles was great! History stories very informative. The food was ok they had a buffet 20 ","useful":1,"cool":0},"BUXJ4DhaWE89khrNvU1ulQ":{"text":"Great cruise down the Ole Miss, buffet has plenty of options. Great stories regarding NOLA","useful":0,"cool":0},"AmZXqtzwBJcNyPBDR9FLcQ":{"text":"The historical cruise is an absolute blast. The guide, Charles, spoke engagingly about bot","useful":0,"cool":0},"4oav30Uw6JiF-yvdmuZbkw":{"text":"Awesome trip and amazing history story telling by Charles, especially the story of Katrina","useful":0,"cool":0},"piYqt4fcZajqEW1wHmLASw":{"text":"The tour is a must when visiting in New Orleans. The Chalmette Battlefield is interesting ","useful":0,"cool":0},"xCGRmd9YHNIx9lTxtDnTcw":{"text":"This was a fantastic addition to our New Orleans trip! We learned much about the history o","useful":0,"cool":0},"tvs2lB9cD-ER5_Yr6iGLlw":{"text":"We went on the cruise today. Charles was the narrator. He is very dynamic, intelligent and","useful":0,"cool":0},"D4hj9syCeMhQx61_dFMSfg":{"text":"The paddle boat creole queen is about what you'd expect, but the tour guide is phenomenal.","useful":0,"cool":0},"fREBIonI9ENzfgiJQcovuw":{"text":"Rude Staff, Poor service\n\nMy family and friends (group of 11 in total including impression","useful":0,"cool":0},"AdkWimCXRbk7WHw4BFPhEA":{"text":"Great tour. The narrative of the battle of General Andrews was terrific. And the descripti","useful":0,"cool":0},"gY6n82IhljIQVnhybopTvg":{"text":"I would recommend this to any first timers to NOLA. Great short overview of the city, a ba","useful":0,"cool":0},"J5e5blMpGN3ueYJnlJu0sw":{"text":"Great music, great food, and great people. What more can a girl ask for? Thank you Jasmine","useful":1,"cool":0},"439Cy8DNxfA34sDkLcIH8Q":{"text":"We brought our 3 and 4 year olds for the first time, they loved it.  The staff was so frie","useful":0,"cool":0},"BTpzqoryDxEc-DJFcJaihA":{"text":"The ride down the Might Mississippi was delightful. Beautiful weather on an early Spring d","useful":0,"cool":0},"Tezt_v4v2_Ui8Vglxh2iZg":{"text":"What an amazing historian on board this very nice cruise! Charles was outstanding and made","useful":0,"cool":0},"INPAXEskL_Dkk87ferPCmw":{"text":"I thoroughly enjoyed this historical cruise. The boat was amazing and the crew was so frie","useful":2,"cool":0},"fCcI12z-wuGUAKX0kAnIAg":{"text":"Y'all, this is so much more than a boat ride. I live in NOLA and with the constant flow of","useful":0,"cool":1},"RmDjG4WG0FBvF8rvc-plVg":{"text":"Absolutely a highlight of the New Orleans visit is this historical river boat tour with We","useful":1,"cool":0},"LRe90tNwGswySlSwHbw9Yg":{"text":"This was an enjoyable tour. Charlie, who narrates the tour, is not only knowledgeable but ","useful":0,"cool":0},"lC5NcpB-KBc3jvelPVKKMg":{"text":"Could not be more pleased with our experience on the morning battlefield tour today.  The ","useful":0,"cool":0},"ERcM-9hiLU1w5MK96oexlw":{"text":"This was such a fun excursion and definitely a highlight from our recent vacation in New O","useful":1,"cool":0},"KlCjxUkHQF18ui2Gfx03ZA":{"text":"The cruise was nice and the weather was perfect for a tour on the Mississippi River.  Befo","useful":9,"cool":5},"y43pJni4_IPMOZBSt1cpOg":{"text":"Awesome relaxing tour to a historic landmark of American history. The narrator (whose name","useful":0,"cool":0},"izVVoZuOrl44i2DqyDnzZg":{"text":"The paddleboat itself is a decent experience but the tour historian   charles was very muc","useful":0,"cool":0},"JWgyViqr4BYGsINIv0GMzw":{"text":"Wendell the resident historian did a great job talking about NOLA history on our way to th","useful":1,"cool":0},"9l-LJ_Hf2wJ-RbQ9CbyMXA":{"text":"After you read this - if you still want to go:\n1. Find the $5 coupon online and print it o","useful":2,"cool":0},"TtLQTpwPWUgYmJEdDdmcvQ":{"text":"We had the cruise-only, and it was great!  The rest of our party had the dinner as well, a","useful":0,"cool":0},"mMedLb4Y3nUAHq0oggwJAA":{"text":"New Orleans is such a beautiful historic town and the best way to learn some history with ","useful":1,"cool":0},"B32j1m5I45mqFanNR6lh_Q":{"text":"This was fun!  We did the dinner and Jazz ride.  Someone had advised us to not do this, bu","useful":4,"cool":1},"P4sf_hv-CXF-tbKAFZ35Mg":{"text":"The battlefield trip was perfect length and exquisite! Charles was our narrator, and while","useful":1,"cool":0},"f4lM4KDCXfYHhLVcIac7wQ":{"text":"Wonderful and very informative cruise. Charles knew his history and kept us laughing.","useful":0,"cool":0},"vW7GaO31hlJVcfr5F7ITtg":{"text":"Very educational, beautiful boat. Kind of boring but that's more my struggle with history ","useful":0,"cool":0},"zX9CvSIhgtOInJiAe7iv-A":{"text":"Our narrator Charles was the best. We took the cruise to the battlefield and it was truly ","useful":0,"cool":0},"cb5a33csrJzATjwHhYW-sA":{"text":"Gosh, this was so damn fun! Maceo Parker was booked to sing on this evening cruise, backed","useful":1,"cool":0},"rGE6Au7Wc8TXK-aFgN8-wg":{"text":"It was a great leaning and entertaining experience. The guide, Charles, is such a tremendo","useful":0,"cool":0},"3Bl2yMV3IB2ZbWUErOGm8w":{"text":"My Wife, Myself and another couple had intended on taking a Steamboat tour up the Mississi","useful":0,"cool":0},"cXQBIcSoUUchQesV_CezYw":{"text":"I am rating this experience 5 stars because Charles, the tour guide, was amazing. He was t","useful":0,"cool":0},"Aq7cLPJ2JHBE6nHqkAJWtg":{"text":"This was a complete spur of the moment trip.  We saw the paddle wheel and jumped on.  Alit","useful":0,"cool":0},"RopHiqpqyuCN5PCpW3LhiA":{"text":"Loved it \nCharles was the storyteller and he was fantastic.  His story of about Katrina br","useful":0,"cool":0},"4DvslwR-0n4eNZTVWK728A":{"text":"Mothers Day, upon arrival at the ticket office they told me the boat was broken and would ","useful":1,"cool":0},"nLB6nu5hQRhZ-d4L1LMMUQ":{"text":"Wonderful experience! Exceeded expectations. One never knows what to expect with a buffet ","useful":0,"cool":0},"MR3vTU-Xx0DAAY91AqieDQ":{"text":"Infomative cruise,  learn history you may not know.  Friendly crew and very welcoming.","useful":0,"cool":0},"BEJG-DLhqertjK_1wVXB3A":{"text":"This review is for the Creole Queen Jazz Dinner Cruise.  Where to start?  On a positive no","useful":2,"cool":1},"Zjz9cX8Eb8nZiFXOLy6REQ":{"text":"My friends and I enjoyed the historical cruise tour. Cruise narrator, Charles, was very kn","useful":0,"cool":0},"DpgxauIPTvgc-vsGbM7fWQ":{"text":"Wendell did a great job with naration along the way.  The stop at Chalmette was very inter","useful":1,"cool":0},"w7gubQG05ejFwFUcpNA3Ng":{"text":"Wow. This was a fantastic afternoon made absoflippinglutely AMAZING by the extraordinary n","useful":0,"cool":0},"_Xl3QKYA-4zcDavYodKmyA":{"text":"Good time! Informative and beautiful boat. Wendall the guide was interesting! Would recomm","useful":0,"cool":0},"uyAoKiZ9B2-RbjrvEz43Kw":{"text":"Excellent tour - excellent guide . One of the highlight oft trip to New Orleans . Highly r","useful":0,"cool":0},"O-PwfH4vSxXnWewVJT2VCg":{"text":"Charles absolutely made the trip! I especially enjoyed his narration about Katrina!  Very ","useful":1,"cool":1},"O2R-deawEvW1O65hrtokWA":{"text":"Such a fun time on the dinner cruise.  The music was entertaining.  The food was plentiful","useful":0,"cool":0},"TD56hnH4LIQFwqACJgP4FQ":{"text":"Beautiful tour of the Mississippi. $14 buffet is worth it (the seafood pasta is great) and","useful":1,"cool":0},"fQwFGeIIbil4uAH1a4iBDw":{"text":"Lovely tour. Wendell is an awesome guide. Very knowledgeable and friendly. \n\nGreat views a","useful":0,"cool":0},"HmcJ0r6MwfgkylsYeG75Rw":{"text":"Charles was a great story teller and the information he provided checked out on Google. It","useful":0,"cool":0},"mctB94Rp92eErG58uz09Hw":{"text":"Very enjoyable riverboat cruise on a pleasant afternoon.  Very knowledgeable historian, Ch","useful":0,"cool":0},"siCaavmSBTQnLZtx5-1gQw":{"text":"We took the boat ride to Chalmette Battlefield and listened to excellent lectures about th","useful":0,"cool":0},"ia_sRGgfy29RogF5QfL3NQ":{"text":"My husband and I enjoyed this dinner cruise very much. We were both tired from travel, nee","useful":0,"cool":0},"pnGVEs8nTBDVXcaVsFYd8g":{"text":"The history tour is a blast for history buffs! A brief history of the town told by a genui","useful":0,"cool":0},"cc6g2O4jmdWfh3HKT5H11w":{"text":"Don't waste your money on this cruise. The narration of the history of the Mississippi was","useful":0,"cool":0},"G4HF6YSPl7QzZBab5FOu8g":{"text":"Great afternoon on the Mississippi River today aboard the Creole Queen. Traveled five mile","useful":0,"cool":0},"12qTII_FIbuSFuSSkRzzUA":{"text":"If there is one thing you do, do the jazz cruise offered by this company. We went in early","useful":4,"cool":0},"Xi8tQBBUUKib2gmxNTWjFA":{"text":"Excellent.  Charles was the guide and is amazing. Fantastic story teller. Ask him to tell ","useful":1,"cool":0},"XgIlELZKKRIeN8JUYgc8WQ":{"text":"The guide, Charles, elevates this tour from good to absolutely phenomenal. He is very know","useful":2,"cool":0},"2ksiY3CW6gygQIQtvFHSdw":{"text":"Food was great for riverboat food.  I was seriously impressed with the red beans and rice.","useful":0,"cool":0},"v2w8uJ2V-sXfnLT5yP9Mgw":{"text":"Paid $129.00 for each person to smell cigarette smoke repeatedly.  Buyer beware... You can","useful":0,"cool":0},"XDszNqIx1clZc92rIVXnQA":{"text":"This is a trip highlight. I'm so Glad we decided on this excursion instead of the dinner c","useful":0,"cool":0},"RQDZC0aKSiqbYW36qKE4Bw":{"text":"This was a really fun little trip to do while on spring break. It's $25 for 2.5 hours and ","useful":0,"cool":0},"vw0oCmhlJZ0ZLUtuoL1Mnw":{"text":"We loved it! We bought the NOLA power pass, so this was included in our package, and we en","useful":2,"cool":0},"HY93A1BKUun55Q5ZYCMN1A":{"text":"We did the journey to the battlefield and this tour was beyond fantastic. Charles was our ","useful":0,"cool":0},"P5WmsvqLF0Y2rlwFmwiPOw":{"text":"we loved the cruise and the Narrator \"Charles\" was excellent. would do it again in a heart","useful":0,"cool":0},"tdHFc4cPfbIg9f97q8q34A":{"text":"Tldr; the engine broke down and we were stranded. \n\nI rated this one star, and I will tell","useful":0,"cool":0},"X1AwlUOdrUhyWbEcKUqt3w":{"text":"Great History onboard the Creole Queen. Charles, our guide was amazing. We truly loved his","useful":1,"cool":0},"2FIvUVEQWDcVUWIWiLKuvg":{"text":"I'm originally from NOLA, and brought my husband and daughter there for the first time.  T","useful":0,"cool":0},"_Sf3pjq30K_iOTUj13jg7Q":{"text":"We have a condo in New Orleans and get down there around 10 times a year.  The other day w","useful":0,"cool":0},"hh6BaJTtD47zy7fQxFVzTQ":{"text":"Our tourguide Charles made the trip a complete pleasure. Excellent mix of humour, history,","useful":0,"cool":0},"8fE36x3zJTOEByd-X1LsdA":{"text":"The food was good. General service great. The deck manager left a very bad impression. It ","useful":0,"cool":0},"5c8EV-dewLW1bsnw6RivOw":{"text":"We took the morning tour in November and found not only the weather to be perfect, but als","useful":0,"cool":0},"XrofAPDKAcgaxVdDe9ROHw":{"text":"We went on the dinner cruise and the buffet was good and the music fun. Walking around the","useful":0,"cool":0},"-LOdGSCZMe9WJCE_7lZs1g":{"text":"The Jambalaya was fantastic but that was it. Unlike other reviews we did not have a guide ","useful":0,"cool":0},"tuMhHPiQsx6EvD1okaMWlQ":{"text":"We took the 10am history cruise, it was AMAZING because of Charles the narrator. I'd absol","useful":0,"cool":0},"05ESJlqvJqeLZHu6_FmuAw":{"text":"We took the morning historic cruise to the Chalmette battlefield, with historian Charles. ","useful":0,"cool":0},"LgLuCj9OrubH2Umt2J1lCw":{"text":"$79 all you can eat dinner cruise. Salad with creamy Caesar dressing, shrimp pasta, sautée","useful":0,"cool":0},"2WCitqIccxTOig6GanSMCg":{"text":"This is a very relaxing way to take in the Mississippi when it gets too darn hot to walk t","useful":3,"cool":1},"DtOtSg41cLD5IM8C29KSzg":{"text":"I like this boat lots. We took the Historic tour and quite enjoyed it. The food is also de","useful":0,"cool":0},"bs3v3-WcxBghTaACCCM-jw":{"text":"While smaller and not as iconic as the Natchez, the tickets include a stop at the Chalmett","useful":0,"cool":0},"t49kQFEJpWOl9J74NkyZEA":{"text":"A paddlewheel cruise along the Mississippi river is a very nice way to spend a relaxing ti","useful":12,"cool":7},"StLW012ufheR_xQ9OLA7Gg":{"text":"Let me start off by saying that I hardly EVER give a 5-start rating as I believe there is ","useful":2,"cool":1},"0-SRglDShAp4RM_E9oNwCA":{"text":"We took the battlefield tour and learned so much history. Charles clearly works hard at hi","useful":0,"cool":0},"oa74Uu9ADBAnAl63-tkMYg":{"text":"We did the 10am battlefield tour and the best part of the entire trip was the tour guide C","useful":0,"cool":0},"-agutsCiYbjeQkBto8kAiw":{"text":"Great fun . Great food . The speaker Charles who narrates the history is fantastic . The c","useful":0,"cool":0},"lkMMUALXblpY4Z7Z7yzAtA":{"text":"We went on the dinner jazz cruise, which was wonderful! Great music, phenomenal food, and ","useful":0,"cool":0},"JJ7TrtlvUQFXn5QhAApUvw":{"text":"We booked a day trip to the Chalmette Battlefield after several hours of research between ","useful":2,"cool":0},"pqVxznj3Nba00zMh8SHAEA":{"text":"It was a great experience.  Excellent history narration to and from the battle of New Orle","useful":0,"cool":0},"Zgkqpzu4sruBYekdZs-35A":{"text":"Great close getaway ! Very Informative and Charles was great at narrating! Only wish the f","useful":0,"cool":0},"a58dK9sYqyGF1GynTljoWA":{"text":"Wendell was an amazing and knowledgeable tour guide! Had a great cruise! Bottomless mimosa","useful":0,"cool":0},"Nz_oY571cd7EzRZXpHrXkg":{"text":"Myself and 3 friends took the morning/daytime tour on the Creole Queen.  It was a 2-hour n","useful":0,"cool":0},"57Pu_RUqBNSQfa8VlbRQnA":{"text":"We picked this tour over the other company as it was cheaper and made a stop at the battle","useful":1,"cool":0},"rci-pHRLIXB8bX5O_UODWg":{"text":"If you are in New Orleans and want to see the Mississippi and learn history from an excell","useful":0,"cool":0},"9FwqTelmkpZUfqXE5JSpWA":{"text":"Skip the lunch... and Dr. Wendell needs to become more comfortable talking about the evils","useful":0,"cool":0},"Kf4CJguRYVo5IJFVDJcHvA":{"text":"Charles was great story teller. \n\nThere's was a stop half way that I did not know about bu","useful":0,"cool":0},"wARV0DExxoil9lvSI6PCeg":{"text":"Really wish we had taken the other paddlewheeler. This \"historical\" tour was so 'WORDY' wi","useful":0,"cool":0},"8iFmmR_Xmlv4EHh32-qANQ":{"text":"I took the daytime cruise and opted for the lunch buffet. The cruise was very informative,","useful":1,"cool":1},"StBfUHqk91CUARxSYEqN4A":{"text":"This was the highlight of our 5 day New Orleans vacation. We took the early tour to avoid ","useful":3,"cool":0},"DhAyUB-0q44T20AXtqjuKw":{"text":"We really enjoyed the Creole Queen cruise to the the battlefield location. Chris was an ex","useful":0,"cool":0},"rWnHz3ogWDtIbUWG7ZDSzg":{"text":"Had a great ride with the family.  Really enjoyed and was captivated by the historians kno","useful":0,"cool":0},"unCOeNUqVC71YO8yGdTzKg":{"text":"My perspective of the Creole Queen is two parts - one for the general buffet cruise and th","useful":3,"cool":1},"IobDmftTbAzZ1hCH3RTvUA":{"text":"A great tour of New Orleans and the hot bear, Charles, does an amazing job describing the ","useful":1,"cool":0},"D4pj9oHzKl1lJRN4zJAmCg":{"text":"Enjoyed this trip down the Mississippi and fulfilled my inner history geek with visit to C","useful":2,"cool":0},"3hCeG5ys31c6KJrfTKhOOQ":{"text":"We had tons of fun on this historical cruise. Charles was our guide and was an amazing nar","useful":2,"cool":0},"cdiO_TTe0-38eq4IUCrLaQ":{"text":"A fun afternoon on the river. Wendell provided historically accurate commentary about the ","useful":0,"cool":0},"8ZlxxF8SBhWJI0TpsbWAwg":{"text":"We had an enjoyable trip on the mighty Mississippi River seeing all the sights from the Cr","useful":0,"cool":0},"BWHha3SlL2gKg__KN_kEJA":{"text":"The morning cruise was fantastic! We did this the morning of our first day in New Orleans ","useful":1,"cool":0},"7AyJY1OqXkwHN6zy3E8KKQ":{"text":"Absolutely must do!  I am so impressed by the staff, food, and history lesson.  Thank you ","useful":0,"cool":0},"TVdoJjRU9zqd-uEAghNQAw":{"text":"Rode the Queen yesterday.  Cannot comment on food, because I didn't eat on board. The best","useful":0,"cool":0},"bcQqTFqCHixVUT4PSaXbiA":{"text":"We did the afternoon battleground cruise.  A fun way to get some historical info on the Mi","useful":0,"cool":0},"wOP4JTwbJsubp_uSzR0saQ":{"text":"This was a great tour that included a disembarking at the Chalmette Battlefield. Our tour ","useful":0,"cool":0},"5uibx6ZxEsn-3XdHu3fRAQ":{"text":"When in New Orleans, you have to go see a paddle wheeler cruise.  This was one of many ava","useful":0,"cool":0},"5Ch49yArQnjzmPVGdoTcLg":{"text":"Had a very horrible experience  for thanksgiving dinner 2017. The cabin we were in was ver","useful":0,"cool":0},"U3yK55vMm49_MBP9yWqdVw":{"text":"Enjoyable trip on a paddle wheeler. Christopher Tidwell is an excellent speaker who is a N","useful":0,"cool":0},"vDJd-mRKhHO8xO6ppZ3w_w":{"text":"Charles was well spoken, informative, funny and delightful. Our history teachers should be","useful":0,"cool":0},"J7f9hhjVsOIrVp3M5S3IzQ":{"text":"I purchased a boat cruise during the Essence Festival July 4th weekend through Platinum En","useful":0,"cool":0},"4JrsrqMo8s6SduBun46QBw":{"text":"Charles narrated the historical steamboat tour. He was excellent. He made the experience u","useful":1,"cool":0},"oZOqkUs8HKjiItOCJYaqrQ":{"text":"I planned a dinner cruise for our group of 55 people. This boat was recommended by the con","useful":1,"cool":0},"2RRK-Jm9aIlEMT9JQfmTEg":{"text":"Super enjoyable ride. Charles killed the narrative for both the Battle of New Orleans and ","useful":1,"cool":0},"RAF6pK959g5m79kYDEE-9g":{"text":"Went on the Historical Cruise that went to the Chalmette Battlefield. It was a nice way to","useful":0,"cool":0},"pQPYZcyed3hajL7icCzqSw":{"text":"We took the historical cruise, which includes a stop and visit to Chalmette, the site of t","useful":0,"cool":0},"uyueFjHVtLB8LkOYPHz79w":{"text":"Definitely worth it during a trip! Charles was our tour guide and his story telling was ba","useful":0,"cool":0},"LvE0VEo0BTM1lfyuPQcMnw":{"text":"Fantastic tour on the Mississippi and of the Chalmette battlefield! Charles was a very wel","useful":0,"cool":1},"a_9m-Xn13sssWyyq_zvYpg":{"text":"Our BEST night in New Orleans at the 2016 Keller Williams Realty Family Reunion was spent ","useful":0,"cool":0},"pLg_f0xEeq-T723wJro9gA":{"text":"This review pertains to the ticketing and boarding experience only. The process is serious","useful":0,"cool":0},"LhOaW8SuCCOZXOB5UCAQHw":{"text":"The historian, Charles, was excellent!  On our trip (3/10/18) he overslept or something, s","useful":0,"cool":0},"szf8jMdMd8U10Swq18duWA":{"text":"Had a great time! One of my favorite parts on my weekend there! Charles was an amazing tou","useful":0,"cool":0},"IJzRWXrshnhUBo4Ts-he4A":{"text":"Had a great time! The food was delicious, our tour guide was very informative, and our liv","useful":0,"cool":0},"Y6N2xXQrCJx907sKnSPHFw":{"text":"Can I just say, Lillie you made our first night in New Orleans absolutely unforgettable. T","useful":0,"cool":0},"tMakAokIBoxUfM4b6OKvSw":{"text":"Loved this cruise.   Charles our guide was fantastic.   The battlefield was great.   Loved","useful":0,"cool":0},"BD7VcoZ_CGtlNKwkekjjQw":{"text":"Wife and I loved this cruise! Great ride down the Mississippi on a beautiful boat. Wendel,","useful":0,"cool":0},"JS7DbrcIpWuYaQRIxE-FAQ":{"text":"Perfect evening on the Mississippi with friends.\n\nDinner featured all the favorites from N","useful":1,"cool":2},"gQM4AUJzvoHI8GVn7bLJ0A":{"text":"I can't say enough how I enjoyed Charls ! It was such amazing experience to have him guide","useful":1,"cool":0},"uh6sFFn0fN592Ysc1rWBnA":{"text":"We took the cruise at night including dinner. The food was very good, I specially liked th","useful":0,"cool":0},"v4dbIM9zEyxrwyNC5MRuvA":{"text":"It's nice if your legs are tired and looking for a break. I used a groupon and would not p","useful":0,"cool":0},"qUxkaux4gKSVO13nUL1RfQ":{"text":"This was the best thing I did in New Orleans. I did not eat the food due to friends who ha","useful":4,"cool":1},"l4XkSPoL1fqNqck4nua1rA":{"text":"Taking a cruise on a paddlewheeler was part of my childhood field trips (and early concert","useful":1,"cool":0},"NDFP4HaOmsKzEUtCouEN0Q":{"text":"The view from the top deck was great. Enjoyed it thoroughly; however, the food was mediocr","useful":3,"cool":0},"mr0xSan8FMd7WwHhSQwsQQ":{"text":"Very informational and enjoyable historic cruise to the Chalmette battlefield. Charles the","useful":1,"cool":0},"Zxv8f-4-0qJKpdCesy54tw":{"text":"Great tour of the Mississippi and the Chalmette Battle Field with Charles narrating the hi","useful":0,"cool":0},"TYz0OtrYJgrai51yOyqBaQ":{"text":"Lots of fun and good historical narration by Charles. The food is good too. I would tell f","useful":0,"cool":0},"4uATBGbux79ldLp3ipC9Og":{"text":"A great night listening to jazz music and watching the sunset. We only did the cruise (no ","useful":0,"cool":0},"H73Zh03PldobAj77ifuHQw":{"text":"The only reason I'm giving any stars is for the cruise itself, which was pleasant, and our","useful":0,"cool":0},"zQLYMa6Z0bgYDnwHk7Hjuw":{"text":"Our cruise was magnificent. The history of the tour was extraordinary and the narrator, Ch","useful":0,"cool":0},"su8qv88UwVxUtawnjVBqbA":{"text":"This is a great experience to ride the paddlewheel on the Mississippi. Great value for the","useful":0,"cool":0},"oT9sXWm00kc5RmGq4uWqtw":{"text":"Excellent adventure. Charles, the narrator, was a dynamic and entertaining speaker. Recomm","useful":1,"cool":0},"vf7f4wJ3xeA_MaBKU0tlWg":{"text":"While sitting at Jackson Square, I saw a steamboat go by, and I decided that I had to make","useful":2,"cool":2},"uOXal5FcbFVqgDo77XT8xQ":{"text":"This was a great cruse. The narration by Charles was the best I have ever heard. His narra","useful":0,"cool":0},"N-ku9Uin6znDymBwN4OB7w":{"text":"It was a great tour. The narration by the guide and the park ranger was spot on. I actuall","useful":0,"cool":0},"DtNv0YiMAlnoFZeWJtej9Q":{"text":"This ride is well worth it just for the history review of New Orleans by the announcer. Th","useful":0,"cool":0},"eTPvMlti88gmHI4NkLQ3qA":{"text":"A nice ride to the battlefield with an excellent talk from the park ranger, \"she was very ","useful":0,"cool":0},"lL8to4nAwbCthSjP_qr1Yg":{"text":"The cruise is awesome!  The guide Christopher Tidmore was so incredibly knowledgeable and ","useful":0,"cool":0},"hSvzmez3mbUOnUjxcqe-hg":{"text":"Charles is a great orator and story teller.  If you are listening you will catch subtle re","useful":0,"cool":0},"BqvDTQYRjK3csmxSSka5QQ":{"text":"The best friends and I had a great time on this 3-hour tour that combined culture, history","useful":0,"cool":0},"NMVevNsO1m4KiWyOmM2-mQ":{"text":"We had a great time - great family friendly scene. We have 3 young kids and they loved the","useful":1,"cool":0},"aBjOWAXUiTJkvV8GZKWpDA":{"text":"We felt we really got our money's worth on this tour.\nThought we were just going pass Batt","useful":1,"cool":0},"YKYIkjlTwU7YfZGkA1NSJQ":{"text":"Adults and children really enjoyed this.  The food was great,  inexpensive,  and the views","useful":0,"cool":0},"a6zH4vp4OXvsRm6nhDft-A":{"text":"We wanted to go on the Steamboat Natchez based on everything I read online, but they were ","useful":1,"cool":0},"LuNpW98Y6TfbC5ZwRtK8gg":{"text":"The cruise was amazing!! It was really cold outside, and we were freezing but the view was","useful":0,"cool":0},"J3txZq95neUgIBTKt285tg":{"text":"Myself and my partner had such a nice relaxing time on this boat ride, the historical info","useful":0,"cool":0},"VitUHYnZltqa796Ilg9Hkw":{"text":"Absolutely recommend a tour when Charles is the guide. He's great and really funny and kno","useful":0,"cool":0},"1Ekzu8zIE79obP6CWAdT8Q":{"text":"Buffet style dinner with live jazz band. Very nice time. Look for s coupon to save a few b","useful":1,"cool":0},"p_xtrGfKcorTQegxbi6b5A":{"text":"What a great way to see and hear about the history of New Orleans and the Battle of New Or","useful":1,"cool":0},"Rm5rUwOfKX8MN06t-5gMRQ":{"text":"Loved the history tour!  The narrator is AMAZING and FUNNY!  We didn't have lunch, but we ","useful":0,"cool":0},"ExLfIF5fjTOiwxbn8Zadkg":{"text":"Wendell is an amazingly talented tour guide for the historical tour. The brunch was such d","useful":2,"cool":0},"leqtcThHCKsN-RnsGmlgnA":{"text":"Overall an excellent experience. I was hesitate about the food but was pleasantly surprise","useful":0,"cool":0},"e6IzvpwR6YQ5H0SQlFodRg":{"text":"This is a short historical tour to the Chalmette Battlefield. The whole cruise only takes ","useful":0,"cool":0},"q1w04Et70FfmjphOnhR94g":{"text":"This was a fun activity. We went to a conference and this was a fun activity to do at nigh","useful":0,"cool":0},"xqK24GqJAfGDn4qqU_9OPA":{"text":"If I could do it over again I would not take this tour. Even for he deal I got on the tick","useful":0,"cool":0},"TXTudGWVTVYdmbL5jEPUWw":{"text":"I am reviewing the Chalmette battlefield tour only. Also, we did not get that buffet , I h","useful":0,"cool":0},"lLLwibP81wCGHVpC0HDiLg":{"text":"Definitely a \"Must Do\" if you like history...Not a great idea if you have little ones. My ","useful":0,"cool":0},"y-fr9JXoTg0ts9sQinAJGA":{"text":"Wendell was an amazing tour guide and narrator. The ship was clean and comfortable and the","useful":0,"cool":0},"MQ4cP8CyWOrvlFvFIwWs4g":{"text":"Took the 2:00 cruise. The Creole Buffett was with the extra price.  The historian, Charles","useful":0,"cool":0},"1ZI7ihm2ZAWWVLXPpQVZzw":{"text":"Had a really great narration from a social studies & theater teacher ( props to teachers).","useful":0,"cool":0},"0qNjR-Eq7a-ywzy0nCiypQ":{"text":"Spending time on the Creole Queen was a nice way to get away from the heat, the city and e","useful":1,"cool":1},"e_uAwhR2j0qg4zP1JpzEtw":{"text":"The Chalmette Historical Riverboat Tour was outstanding.  Our tour guide Charles was by fa","useful":0,"cool":0},"l-stO_QhTbEPKMYVifOuNw":{"text":"We did the historical afternoon tour that stopped at the Chalmette battlefield. The narrat","useful":0,"cool":0},"k17K4wxE2PWof0YPedWe_w":{"text":"We did the dinner jazz cruise. It rained our night but it was still nice none the least! W","useful":0,"cool":0},"YqTSxhbiEs4N0it4wfhTWA":{"text":"Debated a long time between Creole Queen and the Natchez. Natchez is a bigger boat, and cl","useful":2,"cool":0},"LuneMaFih7Fq3JFyGCd9KA":{"text":"Fantastic! A very very thorough narration of the New Orleans battle and the war of 1812, g","useful":0,"cool":0},"qJXmUUOYbvpkazAA8Hz-8g":{"text":"Enjoyed our trip very much.  Food was excellent.  The narrator was the best.  I learned so","useful":0,"cool":0},"RTjLEvb-DpxJUFFV4kiuVg":{"text":"We did the dinner cruise, It was a beautiful view and a fun experience. The food was not i","useful":1,"cool":0},"B0rVCq45s8-1FK9RS2edyQ":{"text":"Charles, the tour guide, made this cruise fantastic. Insightful, hilarious, and soulful wh","useful":0,"cool":0},"Hm0IXOE1kZwQQWNbJkHxgA":{"text":"SO much better than the \"jazz\" cruise I took on the Steamboat Natchez a number of years ag","useful":1,"cool":1},"trnd-F2J-yk31Tt-KBxIPw":{"text":"Crew is very well trained and efficient in ship handling duties. Very courteous. the tour ","useful":0,"cool":0},"1F6j3sJFj_RgEnHitnk3Jg":{"text":"We had the pleasure of joining our tour guide Charles for the historical river cruise. Cha","useful":0,"cool":0},"bkuuwy2yTvZCbw_8za7MyA":{"text":"The boat was lovely, unique paddle wheeler. Our tour guide was so informative and was very","useful":0,"cool":0},"QF22QxuvgZoYAWd5UlUFqA":{"text":"Morning historical battle tour. The narrator Charles C was outstanding. Having studied at ","useful":0,"cool":0},"hLyJSUKBANjY8b0oLPhz6g":{"text":"Good time with friends in the last night of our trip!!! Great misgivings perfect drinks an","useful":0,"cool":0},"PAsFaHpByH-J3yqgAAT8HQ":{"text":"I enjoyed the boat cruise with some friends. The staff was very friendly and welcoming. Th","useful":0,"cool":0},"6r22v4wH1poIGNGAoOuPCg":{"text":"Great historical info from Charles.. Katrina info made me teary eyed.. Enjoyable afternoon","useful":0,"cool":0},"Jc15aC4_h93I5gdN71oJ9g":{"text":"The paddleboat was cool but there is not much scenery on the Mississippi other than the Ri","useful":0,"cool":1},"0XldePZ6bbMq_a-uIPISKA":{"text":"My wife and I decided to do a paddleboat cruise because it felt like a Louisiana thing to ","useful":1,"cool":0},"2TX2kMgKy4lNbPQx5MUfdg":{"text":"Food was very good,  service outstanding\nReally enjoyed the band Dr Jazz \nperfect way to e","useful":1,"cool":0},"M863Qb2zSh14JCPyFP3NRw":{"text":"Went to New Orleans and took a tour and had a buffet on the Creole Queen. Kinda pricey but","useful":0,"cool":0},"vkQXoJw7Im261ktpbv3F-g":{"text":"This was a completely enjoyable way to spend a couple hours! Charles the narrator had so m","useful":0,"cool":0},"-tVYyN5BcY-OsdBbTEM3jw":{"text":"Charles is a fantastic historian and guide. His New Orleans history was extremely interest","useful":0,"cool":0},"MvNxbJeBUZ9H8MN1qizN4A":{"text":"I thought this would be a good pick for my autistic son who loves trains, while personally","useful":0,"cool":0},"DjKvPva0pO1kIeYHUbdwYg":{"text":"IF YOU LOVE HISTORY- THIS IS THE TRIP TO TAKE\n\nI visited New Orleans with my son (11), who","useful":2,"cool":0},"xzbf0dY-KvthxAynrRm8pQ":{"text":"Excellent and informative tour. Ask if you can go on a boat where Charles is your guide, s","useful":0,"cool":0},"0Xknpg3KQkE1foN2rlNUrA":{"text":"Myself and the whole group I was with really enjoyed the cruise we took. We went on a Sund","useful":0,"cool":0},"UyQ8JH0NWbZaVUk2C9Y6qg":{"text":"We did a jazz dinner cruise...not a cheep dining option by any stretch but we were celebra","useful":2,"cool":0},"t6lGhBwr8NKOBXIb9cjTaA":{"text":"Dinner cruise staff was very friendly, music was very nice and the Mississippi River sight","useful":1,"cool":0},"N3DezMo0ImgK0VZPxwE2hw":{"text":"When my husband first mentioned wanting to do this I was a bit hesitant.  We finished at t","useful":0,"cool":0},"QZrcxLu4JmxgG5tNJ5KXKg":{"text":"Five star experience - with tour guide and narrator Charles.  He's outstanding! Best histo","useful":0,"cool":0},"9qJ2OszrGmYSpKA9m_p6Jg":{"text":"Went on the cruise to the Chalmette battlefield. Wendell was a great narrator for the trip","useful":0,"cool":0},"ypHGmynH45yeqgRN1T7K9w":{"text":"My wife and I finally broke down and took the dinner cruise. The boat was scheduled to boa","useful":3,"cool":0},"7zQRWuT6XOSxs0LtBdxqmA":{"text":"Great tour, it's relaxing, educational, entertaining. There is a bar and cafe in case you ","useful":0,"cool":0},"gCOAjApfioCYydGQwQRITQ":{"text":"Spontaneously went on this boat tour on a foggy day.  Thought it'd be cool.  It was kind o","useful":0,"cool":0},"NqicZ0vX0OmcGy8PxtpgIA":{"text":"October 2015\n\nWe had a lady historian to guide us down the Mississippi River - whom pointe","useful":0,"cool":0},"uD8q68vBdwIQIf7mR8ab3Q":{"text":"Went on the battle tour. Our tour guide, Charles, was knowledgeable, engaging and had an i","useful":0,"cool":0},"MTpi3nRtzM7qVnYA28Iujg":{"text":"I had very low expectations before I boarded this riverboat.  It just seemed that if you a","useful":2,"cool":0},"RJRzPQp-IgK_6s8TDjrqdg":{"text":"I really enjoyed the trip, even better I enjoyed, Charles' stories and narration. A must i","useful":0,"cool":0},"i-tqOlCkX9-A65gsZ0D4sw":{"text":"My boyfriend and I took this cruise up the Mississippi and had a great time! The buffet wa","useful":1,"cool":1},"dh8dhS-YpjN75DPOjiFjsA":{"text":"Wow.  Took this to battle of chalmette.  What could've been stellar...  was mediocre.  Emp","useful":1,"cool":0},"_CnMJ3Bth3uWUCreMf4jyg":{"text":"Charles was an awesome guide! I would recommend this experience whole-heartedly. If you wa","useful":0,"cool":0},"ipxWbyRlXwHODfTnVqHZog":{"text":"Great time. Super informative and Wendel the tour guide was full of knowledge. Cost isn't ","useful":1,"cool":0},"-SKulq93Ey3s77mn8f6QbQ":{"text":"We booked this tour at the last minute, but had I known how good it was, it would have bee","useful":0,"cool":0},"0jcCfFLiyghf0FEh3RlB-w":{"text":"Beautiful tour of the Mississippi. $14 buffet is worth it (the seafood pasta is great) and","useful":1,"cool":0},"cEkFcIic2nfJhHdKO5jvag":{"text":"Charles the narrator for our tour was both very informative and also heartfelt and full of","useful":1,"cool":0},"y99Dcz6gC7Xugsm1gFCOyw":{"text":"This was a very good tour and Charles (the Historian) made it very educational and enterta","useful":1,"cool":0},"phU3_rOHj96gB8rUhMdZow":{"text":"Great food, great service, and the beautiful Mississippi. I had a wonderful evening! Way b","useful":0,"cool":0},"GxWgIfdztEhgssD7MrQ7Mw":{"text":"I took the historical tour cruise. Let me preface this by saying that I am a history profe","useful":6,"cool":1},"wbqyDDCfAjrIcmXtLZm7vA":{"text":"Charles was our narrator for this fun riverboat cruise.  He is the most engaging public sp","useful":1,"cool":0},"l8e628e3nCdvD6PpLc928A":{"text":"We had an evening cruise with dinner. Ok buffet, wouldn't expect more or less from a river","useful":2,"cool":0},"ep9bLrCI275uYFhfW0P83w":{"text":"So much fun. The narrator is funny and informative. 2.5 hour cruise and tour of battlefiel","useful":0,"cool":0},"od3nV0yyjerN_Q2scI5tug":{"text":"Five stars for this place too.  Yep, it is a paddlewheeler and it is a Mississippi River c","useful":1,"cool":0},"XgXfy3FSx-DVDNhPom1q9Q":{"text":"This was surprisingly a great part of our trip. We were first in line and got the upper ou","useful":1,"cool":0},"Vt1kd4nmAZoTTgIxAF_PWg":{"text":"This \"hostess/manager\" is the reason why I gave this a 1 star, if I could , I would give z","useful":0,"cool":0},"v6G-en5GdM1ungNTQwfIJA":{"text":"This was a very nice ride and the History Lesson provided was very good. We enjoyed some v","useful":0,"cool":0},"TYDu6URM0PasxvvgBdmlow":{"text":"This trip is NOT kid friendly, and we were subjected to a long, loud, inaccurate Katrina s","useful":5,"cool":0},"qbfjuZUY4WsyxK2ki_Ayxg":{"text":"What a wonderful adventure! Our guide, Christopher Tidwell, engaged us thoroughly as he na","useful":0,"cool":0},"1DHJybDbvN4DXVn7tMdAfg":{"text":"Great historical tour for a great price! Very interesting and nice to cruise the Mississip","useful":0,"cool":0},"vnjxwnF6H5VXU_xcTEa9xQ":{"text":"This is a great afternoon trip to take. The host Charles is really good! Me and my wife lo","useful":0,"cool":0},"pZvccYO6Lm2vHoqYqUE14w":{"text":"We think it was worth the $34 per adult for the 10AM ride we went on...well done in terms ","useful":0,"cool":1},"Zb9uXYFdmDENcVzNKaK5eA":{"text":"Charles was very funny and intelligent. Overall, he was a great speaker who was extremely ","useful":0,"cool":0},"MkUbzHXgx0Xni3ryUr64qg":{"text":"MUST DO! \nThis Paddlewheeler is a must do in New Orleans. The tour guide was so knowledgea","useful":0,"cool":0},"-dINV7B9s2x8v94EMB7N1w":{"text":"Narrator Charles made the trip. Very informative and entertaining. His Katrina commentary ","useful":0,"cool":0},"4-1hTuZXzbgEneRHIesijQ":{"text":"Excellent tour guide.  Highly recommended!! Our tour guide, Chris, was really knowledgable","useful":0,"cool":0},"cdyq2GH2M40XsJ8-r6vFMg":{"text":"Took the morning historical cruise. Beautiful day out. The person giving the narration was","useful":0,"cool":0},"xW1hYGSRWz0xb9kzZYRDpA":{"text":"Our guide, Charles, was fantastic. The cruise was within a good time frame and very inform","useful":0,"cool":0},"10xRyG0hgezyMbBCxQoquA":{"text":"We are celebrating our one year anniversary here. Everyone on board made it extra special.","useful":1,"cool":1},"0tnvYLM96rnikO0bAR3hZQ":{"text":"I found that cruise not very exiting it was more boring to be honest with you. We booked t","useful":0,"cool":1},"zHVvvG8WsflqBfYbjnoLJA":{"text":"We really enjoyed the historical tour. My only complaint is that I called to make the rese","useful":0,"cool":0},"fGpdjiHXhsR-7Dc1YeUsew":{"text":"I had an excellent time on the creole queen today! Charles is just excellent and very know","useful":1,"cool":0},"ivfYkJuuWQDTXqmlgtBt8A":{"text":"Best cruise in New Orleans ! Far better than the Natchez.   This trip has a great buffet o","useful":0,"cool":0},"kyklSQJo4ZriZT0X-YZxbw":{"text":"WELL WORTH the money and time!!\nThe trip we took on the Creole Queen was a highlight of ou","useful":0,"cool":0},"Dft_6GqkOQonCUMWw5UYoA":{"text":"Waited in line for over 30 minutes and it did not move more than 10 feet. Over a hundred p","useful":0,"cool":0},"fYdqTRfG_aPkBhpuNcrOcg":{"text":"The boat tour on the river was great as was the battle field tour. The highlight however w","useful":2,"cool":2},"Y6it2ebu0WFKeikWEMchKQ":{"text":"My best friend and I took the tour and it was fabulous. Charles gave the history narrative","useful":0,"cool":0},"m27v21TMPLn3cz8p1n_LbA":{"text":"I decided to try the tourist thing and give the paddlewheel boat trip a try.  I am glad I ","useful":0,"cool":0},"jYp0GUQBkjK83I5yRYjWrg":{"text":"We LOVED the historical cruise!  The boat was lovely and the tour was just the right lengt","useful":0,"cool":0},"UoVBZ-RPFwK1KhGhxnXIfQ":{"text":"Very fine experience. Well worth the time and money. Our historian was Wendel, and he is b","useful":1,"cool":0},"uyGu9dkXB_YwEA1EeCDF4Q":{"text":"My husband proposed to me on this boat! We had tickets to join the jazz dinner and he took","useful":2,"cool":2},"M2OnFWoP3TjEfHj7b0k40g":{"text":"Omg! This boat ride was amazing! Great food friendly service and beautiful scenery. Charle","useful":3,"cool":0},"NX-xJe5GXXpb4wSHSjeTeQ":{"text":"What a great trip!  We arrived at the dock about a half hour before boarding and were alre","useful":0,"cool":0},"H94GqcVKjkefFSQnCPD0tw":{"text":"We took a trip to New Orleans and made sure to take a tour. We ended up going on a boat to","useful":0,"cool":0},"rqLPc-FhYSS2--6Zm80JxA":{"text":"Service was excellent, our waiter was very personable and attentive. Food was good especia","useful":0,"cool":0},"2buDsAlFyMqUE36yuzV-Hw":{"text":"Pricy but worth it. Our guide Charles had amazing stories to tell and what it more than ju","useful":0,"cool":0},"VB1VPZRHwqBoPdXwm0M-fw":{"text":"Charles was very awesome!!! Entertaining, witty and educational.  I especially liked his s","useful":0,"cool":0},"jEVQ4bL-ax3NjoH8BhzPzA":{"text":"Very enlightening and educational boat ride. Two and a half hours of information from the ","useful":0,"cool":0},"6UpWEPwm01v4hwx9qICUvg":{"text":"My mother, two teens and i enjoyed this boat ride very much. This was a great way to exper","useful":0,"cool":0},"yi4fGhGwQkwvXRBIOZOZ_w":{"text":"It was such a cool learning experience. Hearing the stories was fun and the food was great","useful":0,"cool":0},"TpGjVyQpc4kX4FfJ-_OfEg":{"text":"The Chalmette Battleground River Cruise tour that I took featured Chris Tidwell as the gui","useful":0,"cool":0},"isbZoye2jXDvoVND8IlZWQ":{"text":"A photographer quickly takes our photo in front of this beautiful paddle wheeler river boa","useful":0,"cool":0},"3_Rdw09bn1eF6SgVF5NNnA":{"text":"The cruise was fun and visiting the battlefield on which the Battle of New Orleans took pl","useful":0,"cool":0},"vbRiHVSQPBl7XLIP64rhJA":{"text":"I had called and made a complaint (voicemail) about what is described in previous review. ","useful":0,"cool":0},"pwnJI4CsDgm691tH1WnNKQ":{"text":"Printed ticket for cruise \"present this web-ticket\" for entry\" and they're making all of u","useful":0,"cool":0},"lN2_V5u-rIn5g7-BbUXCQA":{"text":"Chris tidmore is awesome.  He stitched historical events so seamlessly.  He made new orlea","useful":0,"cool":0},"5Pe1aTrIIvaxJA8ERMIiQA":{"text":"Had an amazing time on here and the food was delicious. I recommend this to anyone that wa","useful":0,"cool":1},"_za9gtAJkcUnJ7V-IWuGCQ":{"text":"Great river tour and the tour guide gave a wonderful narration about the river history  an","useful":0,"cool":0},"CwoXQOyFYs1_BqfA4IEODA":{"text":"We caught the afternoon cruise on the Steam Paddle boat to the Chalmette Battlefield.  Our","useful":0,"cool":0},"F5vfIt2XnHB8usl9xVbrdQ":{"text":"Victoria, Victoria, Victoria!\n\nThis review is for an exemplary employee who went above and","useful":0,"cool":1},"YX2iXO5t_6mbD74ZtuzMyg":{"text":"The 10 am Chalmette Battlefield boat ride was an excellent way to be on the river while le","useful":0,"cool":0},"m3pR46JHsbTUs7bunGHHfA":{"text":"If you have the time, this is a relaxing trip where the on board historian gives you histo","useful":3,"cool":1},"eSINPFrEDCgMPP8bgQ1SqQ":{"text":"We did the Chalmette Battlefield tour and it was great!  The boat was lovely, plenty of ro","useful":0,"cool":0},"jiXfS9HOn_icmShSyOCXCg":{"text":"Great fun and wonderful music good food and the best part dancing around the top deck with","useful":0,"cool":0},"CClanA2IROsnlVsAofBHzg":{"text":"By far the best attraction I've been on since arriving in the NOLA. Dr. T jazz band is jus","useful":0,"cool":0},"4CacYhzTtPXimnA4M-smuQ":{"text":"Really nice casual cruise up the Mississippi. We took the historical tour and Charles was ","useful":0,"cool":0},"ecljJGRgjZKH4HSCrqhQFA":{"text":"My family came to New Orleans as a bucket list check off. Upon arriving at the dock to get","useful":0,"cool":0},"nFR65-TANItHXhO_xrL-zA":{"text":"Great tour. Charles was our guide, and was very lonagiable about everything, told us the s","useful":0,"cool":0},"jjYo0DvAukzmiWqqfR8W5A":{"text":"We did the historical cruise today. It was a great experience. We try to be prompt, so we ","useful":3,"cool":1},"EX1Y0FZs7JS-QDxXy11nzA":{"text":"This was a great trip and we enjoyed every minute of it. I would like to give special than","useful":2,"cool":0},"2A15FAFiCrHpXi69omEMuA":{"text":"This was our second time on the Creole Queen and we had a great time! Our history expert, ","useful":1,"cool":0},"veI9nGd7ntvG7bpvVEkmyQ":{"text":"The Creole Queen is beautiful! Boarding was very efficient. We sat on the second level, ou","useful":0,"cool":0},"K-mRfHiXx8UEhArFgGHNXg":{"text":"We took the 2 pm cruise. It was a wonderful ride. Wendell did a great job of sharing New O","useful":1,"cool":0},"HToudP7_iKBFncv5c7kMRA":{"text":"Eh. Fourth time on it in ten years. Food is bland and a generic at best. Save your money. ","useful":0,"cool":0},"5WYWeBkh9Lpds4ZLHgKsKA":{"text":"We had a great time. We went on a daytime cruise and Charles, the historian, was very insi","useful":1,"cool":0},"WYRz6uJ3zFA0PDX6vPoqGg":{"text":"Nothing but positive things to say about this cruise. If you want to spend an afternoon aw","useful":2,"cool":1},"zricjGiMQxyqVh0s5QGrzg":{"text":"Charles' narration of the battle of New Orleans was topped only by his great passion durin","useful":0,"cool":0},"xEJT9zjeMPQXxK1a08cYTg":{"text":"Although the Creole Queen was not my first choice of paddlewheel tours i am so pleased it'","useful":0,"cool":0},"ueHe0bX1MfrrEKynuoMKJQ":{"text":"Charles provided a really great, informative and entertaining tour. Highly recommend for a","useful":0,"cool":0},"ctua-kXOOBuSLdmOFpJlTQ":{"text":"Great trip up and down the Mississippi. Stopping halfway at the site of the Battle of New ","useful":0,"cool":0},"eyxQ-fraBoZ71-KP5daXTA":{"text":"The most racist and snobbish staff I have ever been attended by. All might be cost guard c","useful":0,"cool":0},"EhItCf8-f9cxvZlnYdXDRQ":{"text":"I give the commentator 5 star, i learn so much about New Orleans on that 2 1/2 hr ride. Am","useful":0,"cool":0},"vzDtaLuljrN9auO57l5zRg":{"text":"Charles our narrator was excellent. I learned a lot about the history of New Orleans. Exce","useful":0,"cool":0},"yETxua-cKz4tODlXsasyvw":{"text":"Charles is an amazing story teller and a great tour guide. Be sure to ask for him. He even","useful":0,"cool":0},"BcJqJJTL5sgMIBXWY6Bp0Q":{"text":"Amazing time Doug the bartender and Charles the historian was very informational!  The foo","useful":0,"cool":0},"QFc9PGIlFouJWXp-FJH7SQ":{"text":"Food was not great. Bread pudding was good.  Service was poor. The boat ride itself was ok","useful":0,"cool":0},"JQMN0c4odZlHSXISilzpmQ":{"text":"This company is a sham based out of bigeasy.com we arrived to the warft and we're told tha","useful":0,"cool":0},"L9LlafObRCqUkj051PK1wQ":{"text":"Great historic river cruise around New Orleans! Bottomless mimosas for the 10am cruise for","useful":1,"cool":0},"pGPNjZi_H1j6vKej9sxQBw":{"text":"We went to the jazz dinner cruise. \nFood wasn't great, neither the service. Nevertheless, ","useful":0,"cool":0},"AdZ9eocvEFWyRb0IKhN0cA":{"text":"We took the afternoon cruise and Charles was the guide. His story of the city from the lon","useful":0,"cool":0},"_anb2HMfDl2eomBhV54PFA":{"text":"Great ride, friendly stuff. It was more then I expected. Our guide Charles was very engagi","useful":0,"cool":0},"W9oInvGaR0zX4e68uKWvJQ":{"text":"My expectations were fairly low having toured many years ago on another of the New Orleans","useful":1,"cool":0},"A3TwLqWtiShZq0zfvSgeeA":{"text":"Great history tour on the Creole Queen!! I loved Charles- he did a fantastic job of bring ","useful":0,"cool":0},"EnWg7DMRQDJoetBvmti2eA":{"text":"We love to travel to all of the different battle grounds around the country.  We had spott","useful":0,"cool":0},"X1cV4YohVylnYu-GRaTPjQ":{"text":"My fiancee and I booked a historic riverboat ride on a whim while visiting NOLA and it was","useful":0,"cool":0},"k2X6ov-FxQB1sh8X60-dRQ":{"text":"My husband and I took the 7pm evening cruise. We did not have dinner but had drinks on the","useful":0,"cool":0},"2djx1z29H3aXcoKX54T8Dw":{"text":"I got Lt. General Honore's first name wrong and I must correct it.  It was Russel not John","useful":2,"cool":0},"QGasTWQy7AylqtreITomNA":{"text":"Nice historical tour. The food was good. The only thing I didn't like was the gumbo. Affor","useful":0,"cool":0},"7L0b9BuaT7p52Ylc_jrSvQ":{"text":"Very informative historical cruise. Enjoyed the whole thing. We'll worth the money. I will","useful":0,"cool":0},"7Oclgj6Z1oCsWXlMEpXP6g":{"text":"The lady at the ticket booth was very sweet and genuine. Two ladies walked up in a hurry, ","useful":0,"cool":0},"3Dw3bz1dMa78DRKyW6oVLw":{"text":"The steamboat is really nice.  Music is great.  Very romantic setting.  Word of advice: ea","useful":0,"cool":0},"5dTOxznMERBsa403tJv2WQ":{"text":"possibly the worst customer service i have ever encountered.  we were shown to our table b","useful":0,"cool":0},"VBcqud58he7MOkawVZSRwA":{"text":"NYE was the best I have had in a long time thanks to the Creole Queen.  The weather was pe","useful":2,"cool":1},"di96u4KEl34BWvqOv1rK3g":{"text":"We had a great cruise so much fun and informative the narration done by Charles was outsta","useful":0,"cool":0},"1euCTKJiZYXCagLCmtbb7Q":{"text":"I went on the morning cruise on the Historical Battlefield Cruise. It was the last day of ","useful":0,"cool":0},"6aCBYDMVJZ42l2fq97kT8g":{"text":"Great dinner service, the jambalaya and seafood pasta were to die for. The service was imm","useful":0,"cool":0},"AZ8fUkogiUZePo9N9wkobQ":{"text":"Super fun and informative! Our guide was awesome! Definitely wear some comfortable shoes a","useful":0,"cool":0},"Wzrds_iFL_1j3erGnBblKA":{"text":"Narration was horrible.   Very opinionated and forced dramatic.   Uncomfortable seating. T","useful":0,"cool":0},"xByuCWTJKmZaD1XNhd8_3w":{"text":"Took the afternoon battlefield cruise. Host Charles was excellent and informative. On time","useful":0,"cool":0},"KUkmjJZaEb8Mgdd9FyYFIQ":{"text":"We did not pay for the food because it is expensive and 'pig-heavy'. If you are vegetarian","useful":0,"cool":0},"C3Dh9fHeKsHE2c90XODLcw":{"text":"If you attempt to use a Groupon please BEWARE! I tried multiply times calling to make a re","useful":0,"cool":0},"RISN5m1YilvYNlofwQTKRg":{"text":"Just a great time ! It's such a beautiful boat and one of a kind. Dinner was great and the","useful":1,"cool":0},"nEEmBXqxpfw6hmhGK9wrow":{"text":"I'm a frequent visitor to New Orleans - it is one of my favorite tourist destinations and ","useful":2,"cool":1},"wtEToDVQ31k816pGMus1kg":{"text":"I did the Chamelette Battlefield historical lunch tour. The buffet was small compared to s","useful":0,"cool":0},"R_YUVHb0gAmpW-b9bjZ-Ag":{"text":"Outstanding trip. Narrative so interesting. Will recommend to friends. Staff helpful. Grea","useful":0,"cool":0},"5hSeSqgELzYDC6NmaQnjmQ":{"text":"Very  informative and enjoyable. Definitely worth the price. Our tour narrator Charles was","useful":0,"cool":0},"dJy_MP1pJ5d247j1bVZFaw":{"text":"Purchased tickets online for the dinner cruise. I enjoyed the food, views of the city and ","useful":1,"cool":0},"AxAV1KqHLaRgHFzWY_SmlQ":{"text":"Visited New Orleans with the family and decided to try one of these boat tours. The onboar","useful":0,"cool":0},"v6mhNYxy06V6OLbI_g-0Rg":{"text":"We went on the Creole Queen's Historic Cruise on Feb. 27 and had a wonderful time.  The bo","useful":0,"cool":1},"k-IlUjXz0VZy0whulvCNxQ":{"text":"Our bartender Christian was very personable and friendly. One of the best we've ever had! ","useful":0,"cool":0},"TeBgvV9iBg9ThCCWCAkR5A":{"text":"I took the history cruise during the day and I'd highly recommend it! \n\nWe steamed up past","useful":0,"cool":0},"hwC1riiMdj3pNbd4DXFCdw":{"text":"This is very worth the time. Our narrator did an excellent job of recounting local history","useful":0,"cool":0},"XwEpWAFyDdyuKcPLE_rmhw":{"text":"Did the  historical cruise. Charlie the Historical narrator was informative and funny. The","useful":0,"cool":0},"3gj3Kq-DylWYqQUOLT3WXQ":{"text":"Best way to experience NOLA all in one venue!!  Jazz band, excellent food & bar & attentiv","useful":0,"cool":0},"mKAGM7gfQkORvKo7Mru7Qw":{"text":"We took the historical tour on the Creole Queen.  Charles, our tour guide was very enterta","useful":0,"cool":0},"4ytjRxxddegEChz3Soi4Lw":{"text":"Two facts important to this review of the evening cruise: 1. We did not purchase the dinne","useful":1,"cool":0},"IaEIPhzQ5BLOegOJ3GNR_g":{"text":"Historical cruise on 9/5/15:\n\nThis was a very enjoyable experience. It was worth every pen","useful":0,"cool":0},"WtYdhLF6_i2HpfYdn6uXqQ":{"text":"It was quite a nice boat with tons of room. Almost too much room. It was quite empty durin","useful":1,"cool":0},"rR6QeccsrWIVCkSuP2IzSw":{"text":"This was a fun, informative cruise. Down the mighty Mississip, to an historic battlefield.","useful":0,"cool":0},"shEKSxkVcgB6BDIoWy0RAA":{"text":"Definitely worth the experience. Glad Charles was on board to tell us the history especial","useful":0,"cool":0},"jcCvSHPrTesuZde2x0FJdg":{"text":"What a fun experience! Great service, food, and drinks. The jazz band is excellent too. A ","useful":0,"cool":0},"RCXcHgA_fxzMzicxtRSafg":{"text":"We did the morning battlefield cruise and Charles was our guide. I went on it thinking it ","useful":0,"cool":0},"_YSDBMC5N9xjrLc2ngxvjw":{"text":"Very fun tour with lots to do and see. Wendell was a very enthusiastic and knowledgeable t","useful":0,"cool":0},"DPkN7eSQH-vHGok27f7ShA":{"text":"A legitimate paddleboat, with a legitimately legendary tour. We took the 10am morning tour","useful":0,"cool":0},"OBJ3S4qMYyR4zSfGZd6VcQ":{"text":"Booked the morning cruise for a relaxing time with the family. They really like history so","useful":1,"cool":0},"6j9Nl73q8D9ZZlBZmzpRsg":{"text":"What a disappointment! We were not allowed to sit where we wanted! The entire second floor","useful":1,"cool":0},"W1tUUeSsfQszSwyIxA_Weg":{"text":"I've been to New Orleans a few and decided to take in some history. This paddle boat tour ","useful":1,"cool":0},"fAvYHinj9m-0pEhjsP9Gnw":{"text":"Not what I expected , I usually love food & city tours , it wasn't worth it for the price ","useful":0,"cool":0},"LJdMh58Vwb69PJkRJTYsxw":{"text":"Just historical fun on the history tour with Dr. Wendell Stout IV.\nMy family indulged me w","useful":0,"cool":0},"gEBZJJebtr2Qv3N9eDXHXA":{"text":"The historical cruise was very informative. Our guide Charles was amazing. He was really f","useful":0,"cool":0},"un51yILVjMLCnRmJoTzOSQ":{"text":"Excellent presentation by Dr Wendell. If history teachers were like him, Americans in gene","useful":0,"cool":0},"IoeTaPlzSUmUZfjc4l2J-Q":{"text":"This is an amazing historical tour.  I highly recommend.  The narrator Charles Chestnut wa","useful":0,"cool":0},"SF3Z2bZxBAyJLZHbydaU1w":{"text":"Charles Chestnutt is a terrific tour guide! His style of storytelling is so immersive, we ","useful":0,"cool":0},"6Ql9PdEBIqOSKB3Am2XCiQ":{"text":"Enjoyable time!! Our host Charles was an amazing narrator/ storyteller. Very clear voice t","useful":0,"cool":0},"yRGl05jgzk9xWNV6BLtO1w":{"text":"Today my husband and I took the 10 AM boat and walking tour. The narrator was absolutely o","useful":0,"cool":0},"ad1gouM3YDLpd-75WgPD4g":{"text":"My husband surprised me for a cruise and dinner on this jazzy lady for our second wedding ","useful":1,"cool":1},"fjkTcD1MEmyAJxowLy6njw":{"text":"DON'T do this tour UNLESS Charles is your historian/narrator! \n\nCharles' passion for histo","useful":0,"cool":0},"SLgopNORiNu6yklC9wMpGQ":{"text":"Charles was great with giving information and answering questions. The food was very yummy","useful":0,"cool":0},"5qaFcTalOBi44JlWg-K-ag":{"text":"This is a must for anyone seeing NOLA!! It's our first time here and this cruise was incre","useful":0,"cool":0},"o_h4g0bd0KPAhHkcn0ZUAA":{"text":"Our guide was very entertaining and informative. The tour takes you to the battlefield whe","useful":0,"cool":0},"Qrj1F3RNsvx7ErovyhCDMQ":{"text":"Very worth while! We took the 10am history cruise & opted for the mimosa package. We had a","useful":0,"cool":0},"PpvZOLmERpBKRFrfpqRhGg":{"text":"Great trip, Charles gave an extremely thorough and scary synopsis of Hurricane Katrina, ve","useful":0,"cool":0},"RRKEoNPw8oY8Hq1Lc1Mufg":{"text":"Interesting experience but not outstanding in any way. I give it 3.5 stars. They take you ","useful":0,"cool":0},"bNBQgAw-cWUjv7b5ZR4C8A":{"text":"Narrator Charles made this into an incredible day. He has a gift for storytelling, a lost ","useful":0,"cool":0},"MID8gy87_KbOcxTr_JmZTA":{"text":"Best tour ever.!!!! Charlie (tour guide) made this an incredible experience. A West Point ","useful":0,"cool":0},"pi2gYH82flltWIBu1JW_zQ":{"text":"This was the best dinner with jazz music as you make a two hour cruise down on the Mighty ","useful":1,"cool":0},"soc2IOD0cohdxD0ZKZ1mNA":{"text":"We booked the dinner Jazz cruise in advance of arriving in New Orleans. I have read the ot","useful":0,"cool":0},"BD-39YWlNg1KNYWq2smU-Q":{"text":"Our tour guide, Charles, could not have possibly been better.  He was extremely knowledgea","useful":0,"cool":0},"vzX7eau3AOyY6Z7YpJCBTw":{"text":"To start, I would say it was more of a 3.5 star experience.\n\nWe were in town with family a","useful":0,"cool":0},"ni_z4grc4AGyjUX-s0I2kQ":{"text":"What a night it was, thunderstorms galore!  But the view of the thunderstorms behind the l","useful":2,"cool":0},"y9ppW5IGuA0CNmtEyEk1lw":{"text":"We really enjoyed this trip! The trip was narrated by Charles and he did a fantastic job! ","useful":1,"cool":0},"YPHR2-mz_b54qBvUfr0dZw":{"text":"It is a cool trip on the Mississippi River (we did the Historic Tour).\n\nWe bought tickets ","useful":1,"cool":0},"v7bxvzhfTeayZvq2SKb2Yw":{"text":"** If you have a New Orleans Pass or any kind of pass, you need to go to the ticket booth ","useful":0,"cool":0},"NQVrOPoc8zOhnsnf_hrdKg":{"text":"Lies lies lies .....we booked the Creole Queen through Groupon. It claimed to be a brunch ","useful":0,"cool":0},"8H3tVEPQODRDZvag1eNl0A":{"text":"Thoroughly enjoyed our experience on the Paddlewheeler Creole Queen. Crew was friendly. We","useful":0,"cool":0},"DLSL8T7syHWaEs4826QSwA":{"text":"Probably too cold for this tour tonight. Band was good but not mostly Jazz music. Just med","useful":0,"cool":0},"Oiou-GpDcA4e9Q9NfQF9eA":{"text":"I purchased the evening cruise without dinner for 3. Upon arrival we were told that the se","useful":0,"cool":0},"Z1juySLeB9BwiIh8ncHDXA":{"text":"This trip down the Mississippi to the battle of New Orleans site at Chalmette was the high","useful":0,"cool":0},"Xe-h2gjyXiTScj4xNpwawQ":{"text":"Excellent cruise. De Wendell does a fantastic job of giving a historical tour that you can","useful":1,"cool":0},"sophq9GHI9ShEQ27wGYC0g":{"text":"My family and I did this cruise as one of the CityPass activities. Reservations were easy ","useful":0,"cool":1},"suNDxIrYGJT1ojCcKK95XQ":{"text":"I went to the historical tour at 10am which offers bottomless Mimosas and Bloody Mary's. T","useful":0,"cool":0},"1YSo0zpHN5vWky7TZLGdrA":{"text":"My husband and I really enjoyed this! Wendell was an amazing storyteller and had so much k","useful":0,"cool":0},"EXpfWrBN1s-6BtklTLetPA":{"text":"Though the boat was pretty, the Jazz could barely be heard. The musicians only played for ","useful":0,"cool":0},"qvsn2icxHVr2kRYi1Tla7w":{"text":"This place is amazing. Delicious food, friendly staff, beautiful views. This is my second ","useful":0,"cool":0},"e92BSbQ6AiAR80MZad2k_g":{"text":"The paddle boat on the Mississippi is peaceful\n\nThe organization of getting people onto th","useful":3,"cool":1},"yy5QtQj_k6dATr15MEs39Q":{"text":"We really enjoyed the time on the river during our sunset dinner and jazz cruise, but the ","useful":3,"cool":1},"6VWebyuHWmO5xrNDPl_VLQ":{"text":"Wonderful experience cruising down the Mississippi in this old tub.  Friendly atmosphere. ","useful":1,"cool":0},"MxAx4Hx0WIET6Hj9nS1G5A":{"text":"I would have gave it 5 stars but the opinionated made up history lesson that went on and o","useful":0,"cool":0},"8I1V8DKLDVs90jPpLTHoIQ":{"text":"Tried the morning tour.  Wouldn't recommend only because the time spent at the battle fiel","useful":0,"cool":0},"IvAKXS-JTa_HGsEdZFHcrw":{"text":"This is a 2.5 hour paddle wheel river cruise for $35. They offer an upcharge for a lunch w","useful":0,"cool":0},"DJiKHhvAowuifX6keroHGQ":{"text":"Going for the second time today. I loved this tour the first time, but there was a school ","useful":0,"cool":0},"1AcVNEIeIljFyHnfM6Zf1w":{"text":"The boat was a lot of fun! I recommend getting there an hour early (6pm) because the earli","useful":0,"cool":0},"tG6PyNtXR2UMn2lg-WkUbQ":{"text":"This was a great adventure - learned a ton! The historian onboard did an incredible job an","useful":0,"cool":0},"DFz9L15RESHrnv_g5FYeCQ":{"text":"Do a Groupon. Don't pay full price for this Paddlewheeler tour. Now I know why the Natchez","useful":0,"cool":1},"Qy-TsORXP2Yf5BSIOswPWQ":{"text":"We had a wonderful time on the Creole Queen morning tour and trip to the War of 1812 Chalm","useful":0,"cool":0},"pEdIf_9oT2bqcvWEdfXs0g":{"text":"My boyfriend and I did the 10-12:30 tour on a Sunday. This was our last day on our trip be","useful":0,"cool":0},"iGyOReoOYPAxZIybosLRbw":{"text":"Lillie made our company dinner/outing a terrific event....the food and music were good, bu","useful":0,"cool":0},"ltxuxrhfSO-rtq0HTIMeQQ":{"text":"The daytime cruise to the sight of the Battle of New Orleans was a nice activity to waste ","useful":0,"cool":0},"jrCNBxA0PTDy1_QAWvNLMg":{"text":"We took the morning excursion.  The tour guide was incredibly knowledgeable but was not ve","useful":0,"cool":0},"zrU6_V17iUxjo9JNtSc38Q":{"text":"Booked the 7p cruise, with buffet dinner. I like that this has one dinner seating with ass","useful":0,"cool":0},"MKwAlJNL5-_5MhCLQamUcQ":{"text":"We did  the two hour cruise.  It was a good way to end our stay in NOLA. The food was not ","useful":0,"cool":0},"Y0GVseCl-O84NUZ0gZDTkQ":{"text":"Had a great time our narrator Willard was extremely knowledgeable and open to questions.\nT","useful":1,"cool":0},"aZ2yIsQPcW1H8dCOKWLFMQ":{"text":"Booked the sunset jazz cruise without dinner. Arrived early and it was not crowded during ","useful":0,"cool":0},"--jGtVoo7wIzb2uE-UF9-w":{"text":"A beautiful paddleboat that is perfect for special occasions. We booked in for the July 4t","useful":1,"cool":0},"MO687aUFVK0Ugz7R5j3BaQ":{"text":"Had an awesome time and learned a lot. Food was amazing and couldn't have asked for a bett","useful":0,"cool":0},"G7GRm0KbS_phI6e5siVpog":{"text":"Best Paddlewheeler we have ever been on.  The food was very good, the staff was courteous,","useful":0,"cool":0},"Q8TcxpXZk3yGtEHFhNlvnw":{"text":"Very good food I was more looking for the older jazz The band that they did have on the ev","useful":0,"cool":0},"jkxQtQF9Bcemn20gWB-DIw":{"text":"TERRIBLE EXPERIENCE!!! The other boat (Natchez) was on dry dock during this time so everyo","useful":2,"cool":1},"6DIGrrJoh9oWvZnZtVN_fA":{"text":"Dr. Wendall (not sure about the spelling) is very knowledgeable and friendly. He makes the","useful":0,"cool":0},"_spxKMOO_s1_3ogGILZYSQ":{"text":"As a YELP advisor... searcher...my GF and I chose this cruise between others and can I tel","useful":0,"cool":0},"v_e69Suy23uPoGQcWXbVrQ":{"text":"We took the historic cruise and were expecting to hear more about how New Orleans became s","useful":0,"cool":0},"n_rPQp7-2NhgzRIMLdEobg":{"text":"I just got married on The beautiful Creole Queen and I must say it was everything I wanted","useful":0,"cool":0},"jFFFDDyY3-wjyMIiJ1jYzg":{"text":"Very  enjoyable!  Was absolutely blown away by the quality of the lunch that was served.  ","useful":0,"cool":0},"sDNmpPYm7H8c7Xbt5a4MHg":{"text":"My husband and I are NOLA natives, but our kids are too young to remember our time in NOLA","useful":0,"cool":0},"AGFlqRIr2PqWV53qz26k2g":{"text":"We walked up to the ticket booth and asked what they were.  They said a dinner jazz cruise","useful":1,"cool":0},"L4gNZI2umC9AKItRJXZtJA":{"text":"Took an amazing historical riverboat cruise with quite possibly the best tour guide I've e","useful":2,"cool":0},"mXPjjkMY9TTCL2Yt1cWIQg":{"text":"Very knowledgeable tour guide with amazing views of the river and historical sites. The st","useful":0,"cool":0},"3CX38uqfcNWiMxwB3gNZIw":{"text":"Pretty decent little trip down the river. On the way to the battlefield the ride was about","useful":1,"cool":1},"VzpOTuIYmiE2R104HPriqw":{"text":"Went on this with expectations and they blew it away. The tour guide was amazing with grea","useful":0,"cool":0},"wYOQTg-XZxH2Fe5pwu2Zmg":{"text":"I would give this tour zero stars if I could. I had a horrible experience with another gue","useful":0,"cool":0},"JmqkzjdqXnjyByLfRKIjnA":{"text":"We walked in with a smile, and left with a smile. The experience was very nice. The staff ","useful":0,"cool":0},"Idypy4FfgvFqvOvGqbKimQ":{"text":"Totally not worth the time, money, or experience. I couldn't stand the tour guides voice. ","useful":0,"cool":0},"TNIdhU_rbMJXpFBd5J2a6w":{"text":"We took the jazz dinner cruise and had a great night eating, listening to some music, and ","useful":2,"cool":0},"k2Yiu0sZv6jrZ3rHzZ_yTA":{"text":"Nice tour. Wendell is especially knowledgeable and made it a very worthwhile excursion.","useful":0,"cool":0},"AgKoXGSFDD6xh1MB2Qa_Tg":{"text":"We did both the dinner jazz cruise and the afternoon battlefield historical cruise. Both w","useful":0,"cool":0},"eQflHQuiMyEboTk7ddevbA":{"text":"Best non-swamp tour boat ride in New Orleans. Charles, the tour guide, is very knowledgeab","useful":1,"cool":0},"yDUcSzssoIgkCSdNhfBrdw":{"text":"We took the history tour instead of the Jazz tour I thought it was..It still turned out ok","useful":1,"cool":1},"YRXtths4vWQq8QqT_CKboA":{"text":"I was optimistic about this cruise.  When ordering tickets it tells you that you can get t","useful":0,"cool":0},"UM3m3dYXv1Mm2407-EsRaw":{"text":"The food was the best part. 30 minutes of guided tour followed by a one hour docking at an","useful":0,"cool":0},"zL7MRnFB1UN4jRAhe7hGuw":{"text":"Great ride! Very informative, interesting, and entertaining. The whole family enjoyed it. ","useful":0,"cool":0},"M0SUOoceg2yLV-0PqY9VRA":{"text":"This was a great trip.  My girlfriend booked it, and I was initially distraught because I ","useful":0,"cool":0},"-Xr345imL9vCgDCumQ27Jg":{"text":"I really wanted to like this, especially with the price tag it came with, but it left a lo","useful":1,"cool":0},"Nj2y6WNwSoePj6CTPDou4A":{"text":"We enjoyed a beautiful sunset aboard this entertaining ship. It could use a bit more seati","useful":1,"cool":1},"FoXspQEqsjDh1IiLYH9gRg":{"text":"Charles was our guide. Wonderful stories on the history of NOLA and very moving on the dev","useful":0,"cool":0},"A8nIabqCC0MPVBCIeGHcjA":{"text":"I wanted this to be a really cool experience, but it was closer to OK. The price was fair ","useful":1,"cool":0},"3QVE2XzQ_rluEUjzU5Gacw":{"text":"Waiting for 25 minutes in the hot sun.  This is not a quick process to get a ticket (pre p","useful":0,"cool":0},"lgsZiTUpvia-4ivdgZcPIA":{"text":"Excellent excursion and well worth the cost (28pp). Easy to obtain $5 discount coupon in N","useful":0,"cool":0},"KkRMwV_nGpvjIVX63mjXUg":{"text":"Great cruise and Wendell was a great tour guide!  This trip really expanded my understandi","useful":0,"cool":0},"Gud-eKjP0Ss0KPFSxnjbXw":{"text":"I am currently being subjected to a Non stop hate filled diatribe as we float down this be","useful":0,"cool":0},"dofIZmfbZsUOvZQPfuPvmQ":{"text":"Dinner cruise was great, good food and drinks. Service was outstanding, Able to access ent","useful":0,"cool":0},"gxvMZoe5zN9YdjK3dReIww":{"text":"We did the historical version of a tour on the creole queen. CRAZY interesting, both the e","useful":0,"cool":0},"Sr0r10ph6Cfd9klXrdstJQ":{"text":"Charles Chesnut makes this tour. His delivery of New Orleans/American history is enlighten","useful":0,"cool":1},"3hHO4p-PXrcmpoq6ambGFQ":{"text":"Excellent river tour! I can't comment on the quality of food since we didn't purchase the ","useful":0,"cool":0},"Yv7Iug8qZ1sBD8k8dfTJHA":{"text":"We had a terrible experience with this boat ride. There was no \"costumed reenactor\" at the","useful":0,"cool":0},"5uZuOhGqh1ytZtknfNr7jg":{"text":"Our time spent aboard the Creole Queen Paddlewheeler was an exceptional experience. We exp","useful":0,"cool":0},"Zp9soy0k-04NQi48rXF0Wg":{"text":"The three of us were very much looking forward to this dinner jazz cruise. Once we were bo","useful":0,"cool":1},"Ex9HNwlfsMvn5K0eRCUCaQ":{"text":"The Creole Queen is one of two paddle cruises in NOLA and by far the better. Charles gave ","useful":0,"cool":0},"GgRffCqfba7Dcf_2C479gQ":{"text":"We took the Creole Queen to the Chalmette Battlefield. The boat ride was GREAT, the tour g","useful":0,"cool":0},"LKmwivaiiktszqZU68k6Tg":{"text":"Great evening! We've been going to New Orleans for years and had never made it on the Creo","useful":0,"cool":0},"M95pdU6CnVQZ9E3FdZrUeQ":{"text":"Had a blast. 2 hour bottomless mimosas for $15 is a no brainer. Learned a lot of really co","useful":2,"cool":0},"VYAYxxlyQ6ovXvbINGSHMw":{"text":"We has a gorgeous day paddling up the Mississippi River.  The narration by Charles was ver","useful":0,"cool":0},"-6me6ihmaorrhCBwBDHymg":{"text":"We got booked originally for the 7PM dinner cruise and unfortunately couldn't make it due ","useful":0,"cool":0},"s93RG4dJlXRLC01LczEgqA":{"text":"I called 3 weeks before our trip to make reservations and then called to change them 2 wee","useful":1,"cool":0},"aZtGzRC6UFVj8YAaNBY4Jg":{"text":"The cruise was amazing, historical, yet entertaining. Charles did a heck of a job. I gave ","useful":0,"cool":0},"20TVYzJ9gCPI01nM4nJCYw":{"text":"WOW! A must for every visitor. A nice ride with bottomless drinks. Luckily the crew is not","useful":5,"cool":4},"FdBEabLkE7Sp2KniMF0dVQ":{"text":"Great tour. Super scenic. And the tour guide was super knowledgeable and you could tell sh","useful":0,"cool":0},"U2uuheAqynYlGiQgdOKsHQ":{"text":"Ditched my conference for the afternoon to have a nice lunch across the street and a river","useful":0,"cool":0},"DjCCCxZREFpXFiUQwxXziw":{"text":"Took the afternoon battlefield tour. Our tour guide on the boat was pretty good. She was p","useful":0,"cool":0},"kQefyx5ZuXk6RiO3LaZ_uA":{"text":"According to reviews, apparently Charles is the man you want as your tour guide. I didn't ","useful":0,"cool":0},"5o9jJqNHayTGrRf5LWZyCg":{"text":"Included an afternoon cruse on the Creole Queen in our last trip to the Big Easy. The expe","useful":2,"cool":0},"5NowFj2EFabNJOyigUYSyA":{"text":"So first, don't tell people to print tickets online. You can't use these.  You have to tak","useful":0,"cool":0},"6j7n5HtP7kRlCxWeMcuBqw":{"text":"Took the Creole Queen paddle wheeler down the Mississippi.  This tour only goes one stop a","useful":0,"cool":0},"NXYQTe3EXE_SRvQqAfxzJg":{"text":"As tourists from California, we were excited to board this steamboat and thought we would ","useful":0,"cool":0},"M35LGu11RKh3lKDsdicwLg":{"text":"Great music' and friendly staff. nice way to see the Mississippi and New Orleans battle fi","useful":0,"cool":0},"Jz0pgY64xFkmNQfAFEy_1w":{"text":"Most enjoyable experience. Took the battlefield trip on the paddleboat. Crew helpful, frie","useful":0,"cool":0},"DpOYA25ZVNp7Gw6I3y78fw":{"text":"Fun time. Wendel gave a great history lesson of the area. Would recommend this boat trip t","useful":1,"cool":0},"Ba3Sq364yjYwtmhIEIg41w":{"text":"First off, HUGE thanks to the crew for re-uniting me with my cell phone, that I managed to","useful":0,"cool":0},"sATzNfGljKsIGNlI1ZgwHQ":{"text":"This was such a cool tour! We were able to get off the steam wagon and walk on one of the ","useful":0,"cool":0},"CQjbN-bt-7EPSxdRIQ_HgA":{"text":"Another battlefield tour? Why would I want to do that? Charles the tour guide is why. You ","useful":0,"cool":0},"pD3kKqruce6vU7UqiM0h3A":{"text":"Charles was an AMAZING narrator!! He was so knowledgeable, had great jokes, and he did a g","useful":0,"cool":0},"X-GaDOk0M-uo4SAUusdy6A":{"text":"Very  informative and enjoyable. Definitely worth the price. Our tour narrator Charles was","useful":1,"cool":0},"GGikW2pcyji5ugNoZud7Hg":{"text":"Wendell was a fabulous guide! He was extremely knowledgeable and passionate about New Orle","useful":0,"cool":0},"LfKUZa1WrVJmiUeTJtCdHA":{"text":"My wife joined me on a short business trip and we had a day off so we decided to do the ri","useful":0,"cool":0},"7ug3oHcmrdUjTCt60ym23A":{"text":"Had Thanksgiving dinner tonight aboard the Creole Queen. Dinner and the entertainment was ","useful":2,"cool":0},"QoUAtqmg-kfnOsx1tpoI8g":{"text":"The ride down the Mississippi River was an excellent opportunity to see New Orleans from a","useful":0,"cool":0},"83y8OFNNCqNGeeq_vSqqOQ":{"text":"The trip was pleasant.  The food, service, and music were good.  A nice ride down the Miss","useful":0,"cool":0},"ZS8_vQ9wpBvnl3aG6i1kNQ":{"text":"The tour was very nice. The tour guide was very well informed with interesting stories.","useful":0,"cool":0},"JP3fBlphsgR1ejqAAcLNoQ":{"text":"We loved the Creole Queen! Charles, the historian, was very knowledgeable and entertaining","useful":0,"cool":0},"d3ICIzGs3qBTa8nSVDoTxw":{"text":"Weather rained out first attempt but offered to refund money or schedule for following day","useful":0,"cool":0},"rnGHHiD7V4VtlOBiC8EZvQ":{"text":"I loved this! We took the afternoon ride to the battlefield. The narrator Charles was very","useful":0,"cool":0},"L0fAkLp1nZF7Dyh7SxCf3g":{"text":"I really loved this ride. The band was great and the food was great on the dinner cruise w","useful":4,"cool":0},"-tzHZLxnYipnWmr3ZyASow":{"text":"Our tour guide, Charles, was interesting and funny. The bartender made the best Hurricane ","useful":0,"cool":0},"V4cbkpEiNzIoBdspHOHSiw":{"text":"Really great tour, Dr. Wendell was a great host and seemed super informative. If you'd lik","useful":0,"cool":0},"uwLn8XBCN2XIee_GbjgmlQ":{"text":"What a good time.  I took a 10:00 show on a Friday and it was a perfect couple of hours of","useful":1,"cool":0},"zxcrcsi9G2u19ryhOMV-Uw":{"text":"I did the historical river cruise on a Sunday morning with a group of friends.  Dr. Wendel","useful":0,"cool":0},"RTpSMEJ1KUArs70z5zv16w":{"text":"Meh. Overall an underwhelming experience. The food wasn't very good and the decor and ambi","useful":0,"cool":0},"yOOpQwDc22NalqY1ZlxDVQ":{"text":"Charles made the trip worth while! He is a eloquent speaker with a plethora of historical ","useful":1,"cool":0},"Cmvfg8SfFjtm1cvVdofvTg":{"text":"It wasn't the greatest tour but it was informative ! Plenty of sights to see and take pict","useful":0,"cool":0},"vb_LbYB45mj7XYTCaZgmUA":{"text":"Charles and Weston are the best announcer and period actor. What humor information and fun","useful":0,"cool":0},"6X4ueAyIjh2rebGFIFwT_g":{"text":"The historic afternoon cruise definitely has its ups and downs. The ship is beautiful, the","useful":1,"cool":1},"zgW-3p9Ohx6iAce8RIu1MQ":{"text":"The creole queen is probably the most racist and revisionist tour I have ever taken. The s","useful":0,"cool":0},"JgImQ8geibdI80NIMS5pXA":{"text":"Wendell did a great job of giving us a ton of information and history about the New Orlean","useful":2,"cool":2},"N-vJ3rzulqbkpYSgIMQQIQ":{"text":"We bought a Groupon for the excursion on the Creole Queen.  It's very similar to the Natch","useful":5,"cool":1},"SsCnt95AygwrQVyr2OF6jg":{"text":"Excellent.   Thought we were going on a simple ride down the river but in addition we were","useful":0,"cool":0},"OSZsSud3yNkNhfHsHp58tg":{"text":"Only worth it if u use groupon.  About a half hour boat ride each way let u off for an hou","useful":0,"cool":0},"zoFN0X1LfbI_ZQPNn0VO3Q":{"text":"This was a super fun thing to do. The boat was wonderful, fun recorded music being played,","useful":1,"cool":0},"iFPqpS3bV6nHulj_PbfXAg":{"text":"Went on the 2pm Aug 6, 2019. Weather was warm but there was a nice breeze. The boat was ve","useful":2,"cool":0},"HEz01tCCgzzsfpLkNR-zxQ":{"text":"Enjoyed the time I had on the creole queen paddle boat the food was so good it's worth the","useful":0,"cool":0},"640w4BXX0ZO3ndpjXAmzag":{"text":"Sooo. Went on the historic tour with the New Orleans Pass. Should have read about this fir","useful":0,"cool":0},"CaGLYFnCVR-MkClY0_pqEw":{"text":"The history cruise was awesome. You got to experience the mighty Mississippi River see the","useful":0,"cool":0},"MTyEeiQ-wnKu7eQoqYF8Sg":{"text":"We got hoodwinked.  Highlight of the tour that we were told was that the narration was gre","useful":0,"cool":0},"3s650J4c4Y0g8wCxQQFQHw":{"text":"Service was excellent. Food was abundant & plentiful. Bread pudding was mouth watering. I ","useful":0,"cool":0},"QGb9Q9txkxLgVVcLqNBeCg":{"text":"We went yesterday and had a great time.  Charles was a great guide.  He knew the stories o","useful":0,"cool":0},"GNQbWIEM_EwWG11ecWWZsg":{"text":"From start to finish the staff were amazing, helpful and very friendly. The food and drink","useful":0,"cool":0},"_iaaMzeerrRCDrOe6G_KqA":{"text":"Have wanted to visit the Battlefield of Chalmette for years. Visiting our daughter at Tula","useful":0,"cool":0},"MzaOaRckrsRGiQCd_gUqlg":{"text":"Great tour! This was a nice way to start our visit to New Orleans! Charles was great and p","useful":0,"cool":0},"slihNC0slBLj6k0b8s4JzA":{"text":"I took the historical trip down the river to the Chalmette Battlefield. It was a wonderful","useful":0,"cool":0},"ot12RPXnpmEFK7FlOJV6ew":{"text":"Bought 2 tickets off Groupon as the wife wanted to visit the Mississippi River and check o","useful":0,"cool":0},"qLWtzTojxV5v7qP-o91Hvg":{"text":"This tour was awesome! We even got to get off and tour battle field. I would recommend to ","useful":0,"cool":0},"FCHVxiUx8YvE1T-xnq3BeA":{"text":"The food was great. The jazz band was great. A little pricy. I wish there was a tour guide","useful":0,"cool":0},"f4w9gie8BdJ83iN0iqAW-g":{"text":"The best thing we have done in NOLA. Ship is a fun, smooth ride with good drinks & food. T","useful":0,"cool":0},"Ec3VK3MmwdR6x_pbIM_oaQ":{"text":"This tour was amazing!! We've been to new orleans 7 or 8 times and we finally got to do th","useful":0,"cool":0},"UA9ZbHN8fm3R5jRplDldvw":{"text":"We did the battlefield cruise with lunch buffet on the creole queen. It was a nice time an","useful":2,"cool":1},"dqYwL94pKjjHmbjFv04u8Q":{"text":"This was a great time! Cool views on the Mississippi River while eating dinner and listeni","useful":0,"cool":0},"N270lLpvY3F4axA7CAteCg":{"text":"I would do zero stars if I could. Booked (at least I thought) a dinner jazz cruise. Walked","useful":0,"cool":0},"1tJDUEmLU1u-w_sECLzdUA":{"text":"Best river cruise!  Book the historical cruise!  They stop at the Battle of New Orleans si","useful":0,"cool":0},"9mJbU2h6PVvf7uBNqblrzA":{"text":"What an enjoyable, informative trip.  Wendell the presenter was incredibly knowledgeable. ","useful":0,"cool":0},"gxLEqW1qhjZ_HoHo3muFNA":{"text":"The 10 AM with Charles is not to be missed. Excellent narration of local history with hear","useful":0,"cool":0},"JKtgS-DvPbu0pFrNHEa76w":{"text":"Amazing trip down the Mississippi river, very educational with a lot history of the city.\n","useful":0,"cool":0},"7MAoWNZKgorQDs1_BPqkHA":{"text":"Great Tour and our narrative gentlemen was Charles. Charles made the trip awesome!!!\nThank","useful":0,"cool":0},"9BMPJ4yqz-QT9IDiVzhizA":{"text":"We had so much fun on the day cruise. The narrator, Charles, was amazing. His story on the","useful":0,"cool":0},"TR6lRCIb6wMZjB-yqib38w":{"text":"Excellent cruise, time well spent. We went on an evening cruise and did not have the dinne","useful":2,"cool":1},"c-35JuaLDhLspS4XZ-LJ6g":{"text":"Mind=Blown! When visiting New Orleans, be sure to take this tour. I took the 3-hour aftern","useful":16,"cool":14},"JjVyi1l1FghpTF1t6LggGQ":{"text":"Booked this before our trip and got to the dock about 9:30. Boarding process was pretty ea","useful":1,"cool":0},"GGj2FzZ7TZOKrxU7aoukww":{"text":"Best part was the tour guide, I forget her name but I know shes the only lady narrator for","useful":0,"cool":0},"zSovBHIfqQt9tosxT1sjYA":{"text":"The ride was nice but it was Charles, our narrator, who stole the show.   I knew a lot abo","useful":0,"cool":0},"3HazM2XLypUmNd4zECpeQQ":{"text":"December 2018 \nWe had a wonderful time on the Creole Queen! We went on the morning histori","useful":0,"cool":0},"b3GixgabGcgkrSQTDfFJoQ":{"text":"Very disappointed in the excursion. Definitely need a different commentator.  Thought it w","useful":0,"cool":0},"_C8RLoXtrAzrLBK0lpOYEg":{"text":"Can I say... once you go paddlewheeler, you can't go back? Of all the boats/cruises I've b","useful":3,"cool":1},"vBbPxHWUgY_x48xhSKKMSg":{"text":"Great experience overall!\nthe tour guide (Charles) was awesome and did a excellent job nar","useful":0,"cool":0},"tLwbod_Grj7y558vVvQSdw":{"text":"This historical boat tour of New Orleans was made exceptional not by the food, but by our ","useful":0,"cool":0},"ZXxCajIBohCtsKz5PVKv-g":{"text":"We did the 10am tour with cruise tour guide Charles. It was a great experience as Charles ","useful":0,"cool":0},"nLD6Qi5uDlNmG_VZ6iJWSA":{"text":"I love boats. So food, drinks, a boat and history was a great combo for me. The only part ","useful":0,"cool":0},"cMbAtHBoSp11Kx0NBrO26A":{"text":"Amazing service and amazing food with true southern hospitality. The creole queen is an ab","useful":0,"cool":0},"R8ZyTR_VQJpBTBqNknmZfg":{"text":"This was my first time on the Mississippi and Im so glad we chose to go on Creole Queen! I","useful":0,"cool":0},"4zeA7Z_7MZ4xGbal67Wm3Q":{"text":"We had such a fun time on the boat! It was a great ride that provided beautiful views of t","useful":0,"cool":0},"fJ_6YOPi1nIB1QhxO-IIbw":{"text":"This experience was our least favorite while in New Orleans. Maybe if we hadn't already ex","useful":1,"cool":0},"2fGGiyVXVERKZo4YRrxp0g":{"text":"Slow rolling, informational, and cool AC down the Mississippi! Plus the worker gave out fr","useful":0,"cool":0},"IzxE3N98kSHHf1Hy_YDdwQ":{"text":"Had such a blast for the Thanksgiving cruise! I was ready for the food to be \"whatever\", a","useful":0,"cool":0},"rQFhsquSrXlmIloZIyPehA":{"text":"I came a little early. And glad I did bc the line was super long! And assuming the sooner ","useful":3,"cool":2},"_F9IcQG2-GXvcKcCGbr6Cw":{"text":"Not sure where the higher stars are coming from but our personal experience as well as tha","useful":0,"cool":0},"B85DW3xcUl00qMeO03d3Qw":{"text":"Totally wonderful! Food was surprisingly good! Charles, the tour guide, was off the charts","useful":0,"cool":0},"ox8qAmJ31X0tqd13Uy9GHg":{"text":"I had an amazing time ! Very educational on the history of New Orleans up day dating back ","useful":0,"cool":0},"zNqeYsphqjSFZdtVS5xUIw":{"text":"The dinner cruise that is offered by this company is casual, nice and with the sound of a ","useful":1,"cool":0},"wTex0moY0tZh1OpR1r-Fqg":{"text":"Went on dinner cruise.    Huge disappointment.    Dinner was ok for buffet style.   Suppos","useful":0,"cool":0},"-dwME6ChoUXS0zF_GBtGyQ":{"text":"An absolutely must do in New Orleans. Narrated by Charles, you will experience a history a","useful":0,"cool":0},"YFICGqGKk3_-h3S7NZ5v_w":{"text":"My Mother's Day was suppose to be amazing. However, when I arrived to the ticket booth Car","useful":1,"cool":0},"IbY8xUawAqa1BSe4xdIK4A":{"text":"The boat is quite nice and we went on a gorgeous sunny day in February--so it was a great ","useful":0,"cool":0},"PqZtE5Beffv4eQ2-uNQJKA":{"text":"This was a great tour! We had Charles as our tour guide, and I'm generally indifferent of ","useful":0,"cool":0},"YSDeIL3mXkre4ALbSVrY4A":{"text":"I took a ride on the Paddlewheeler Creole Queen while attending the 2019 Essence Festival ","useful":14,"cool":16},"f9FNpzEsRIB3B5060AuYBA":{"text":"Much fun on the Mississippi River. Live jazz music on the  top deck, a buffet creole dinne","useful":2,"cool":4},"QaLaKu7WqJms3Yvl_KGzeA":{"text":"My friends and I took this guided historical cruise tour down the Mississippi River that w","useful":1,"cool":0},"8oZcdoFD58n-1UfgC6eGAg":{"text":"Charles, our tour guide was incredible. Knowledgeable, personable, funny, and really a hug","useful":0,"cool":0},"Hm02TlmkpOoxjjqj5OKfsQ":{"text":"Had a very good time! We actually took 2 cruises during our stay. The historical cruise an","useful":0,"cool":3},"pXBbJiUkkrvSnN8ILRJ4oA":{"text":"A wonderful reasonably priced tour to the Charlotte Battlefield narrated by Charles. The b","useful":1,"cool":0},"b0DuUFDU9qzgIjSZxv7APg":{"text":"A pleasant ride down the Mississippi on a lovely spring day.  The narrator, CHARLES, was f","useful":0,"cool":0},"EA4iQ0nzA5t64CR-abaBRw":{"text":"True FOODIES PLEASE READ!!! This cruise was just okay, if you're planning to bring your 70","useful":0,"cool":0},"_anSR7B_kns1YyN8BDqM_A":{"text":"The 10 am cruise description had me at \"$15 bottomless mimosas\" -- so I grabbed my ticket ","useful":5,"cool":6},"MvfhUuuLZi4reoSH-vuoFg":{"text":"First time on a cruise ship and we had a great time! The drinks were good, the food was gr","useful":0,"cool":0},"VuoQbm80BPgmBNSQhqE4Ng":{"text":"I was pretty happy with our cruise. We arranged for the dinner cruise in advance. I am gla","useful":0,"cool":0},"sdhTTwHwKS-9FKmc1cgD0Q":{"text":"Can I give these con artists a 0 or negative rating?\n\nThese guys are crooks! Don't let the","useful":9,"cool":0},"XOG9EIFwTLOTkh9SR8ssoQ":{"text":"When in NOLA you must take a ride on a paddle boat. So with research and trying to be frug","useful":5,"cool":2},"yiJqijg76kUtE4wvxMW3xA":{"text":"This \"award-winning\" attraction was a complete let down. We paid $85pp for the dinner jazz","useful":0,"cool":0},"IdtsiUa9wPkbRu3fGiiP1g":{"text":"One more Non-restaurant mention. The Creole Queen just returned to service the weekend bef","useful":3,"cool":1},"RDwXloW5o69SZ46EEfwmxw":{"text":"We took the family on this trip up the Mississippi, and were delighted to hear the history","useful":0,"cool":0},"ZYIqxHVQ74qPdRDfwQ0dBg":{"text":"Can you imagine being a Yelper who loves great food and getting a poor meal in New Orleans","useful":5,"cool":3},"BsBny7Ysv1FDzYGdaCmX8g":{"text":"A lot of fun! \n\nThe boat ride is a great way to see the mighty MIssissippi, the history gu","useful":0,"cool":0},"M2nKrHM0kKa88cbU0Pf-Gg":{"text":"This was our second trip down the Mississippi on a dinner cruise. It was a little cold upp","useful":0,"cool":0},"CQ72DwV-Z4u9-EEJDpG3iA":{"text":"Had a wonderful trip yesterday! The narrator-historian Charles was fabulous and made the t","useful":0,"cool":0},"Nl2EaIyyUp3Ko8QndFb74Q":{"text":"Went on the Sunday Brunch tour. Food was amazing, service was fantastic and friendly. Live","useful":0,"cool":0},"ZEntmRmjYBBgWyolDEsP_g":{"text":"Arrive early if you want to sit.  Charles was the tour guide (historian) on board  and he ","useful":0,"cool":0},"nfYseK--Uu_G4oijiKVk0A":{"text":"As a visitor to NOLA, you would think that any touristy tour would be accompanied by New O","useful":0,"cool":0},"hb-cAqmrAu9dpRUA_M8riw":{"text":"AWESOME!\nI have been on a Mississippi river tour, but this historic paddlewheel tour was e","useful":0,"cool":0},"j3ImzlGnfLVhNGnUM1vzbA":{"text":"What a great time!  Hubby and I are history nerds, so we were ecxited to travel on the riv","useful":2,"cool":0},"akK07nknaCefjCkAx7zowQ":{"text":"Great trip to the battlefield.  Sad that they didn't have real mint for the mint juleps, b","useful":0,"cool":0},"BtTHjBLCa4wDQEeDbnLH_A":{"text":"Chuck made our entire experience on the boat. Make sure you go with him for the Chalmette ","useful":0,"cool":0},"BTPLPqc2QIV9vclGN8QEVg":{"text":"This is worth the time and money! Wendell was our tour guide and was very knowledgeable. I","useful":0,"cool":0},"TfGzT7X_BRnXMLl2CY-ZAA":{"text":"What a treat to ride on a paddle wheel boat on the Mississippi River in New Orleans!  We w","useful":3,"cool":2},"X4EQOGXVQ0fL1QGLh6HsDw":{"text":"Highly recommend Paddlewheeler Creole Queen! My daughter and I did the brunch cruise. \n\nTh","useful":6,"cool":5},"0T6RKqmm6ys4AvX1bKR5iw":{"text":"A must do in New Orleans. Delightful boat ride to the battlefield all while learning the h","useful":0,"cool":0},"wCmL72h6jvT0jZtF4ZrvgA":{"text":"We booked the dinner boat cruise for my twins birthday while on our trip to NOLA. the boat","useful":1,"cool":1},"zU2NV573shds6ltBlZyUlw":{"text":"Would give 1 star if it wasn't for the great historian. Don't lie to your costumers that t","useful":0,"cool":0},"5iq5SfmEPdhIfxQt-ZAYFQ":{"text":"Took a Tuesday morning historic cruise.  Boat was clean and had plenty of seating.  The hi","useful":0,"cool":0},"swr8Xjd7czwzTHy0AJuknA":{"text":"The best part of the cruise, is Charles, the historian. We have been on other tours and sh","useful":0,"cool":0},"UNiyZwtu3QK9XtnjKPKhPQ":{"text":"The check-in process was smooth. Nice customer service. Good music and nice activity to so","useful":0,"cool":0},"NGqrph8fyM8DrHVEpW2oTw":{"text":"This was one of the first things we did at New Orleans. Nice calm tour that includes a lun","useful":1,"cool":1},"LQ6ypSR8D2rr8ZmnuQRFaA":{"text":"We have been to New Orleans many times, but this was the first time we brought the kids so","useful":0,"cool":0},"6ARJmqZV6YsgIA7sVcP4Lw":{"text":"Yesterday I decided to take a paddlewheeler cruise mainly to get out of the hot New Orlean","useful":0,"cool":0},"E47_QWVC3f-Z3WpgZBw-Lw":{"text":"was fantastic...the narrator charles  was absolutely fantastic he knew his history very we","useful":0,"cool":0},"lCsZOE2SQIXM8KHamdkmiA":{"text":"This was the highlight of our Nola trip. It was an entertaining trip through history with ","useful":0,"cool":0},"6MGh5_GHLi2VSOZXKHtX1g":{"text":"This was an awesome experience! We got to see all along the Mississippi river, and we even","useful":0,"cool":0},"Vf3ZCYTHtCkS2Z3S2yHdlA":{"text":"Great opportunity to see New Orleans from the river. Charles the narrator was very good an","useful":0,"cool":0},"474_OWXVN7HEz23r89SjrQ":{"text":"The boat ride was decent. The jazz music band was cool and were very helpful in helping wi","useful":1,"cool":0},"qkFGqcsPYvQdcqzpu24gvg":{"text":"We took the lunch cruise to the site of the Battle of New Orleans on 7/14/21.\nBoarding was","useful":0,"cool":0},"aC2-Rx-xBY6K-2uBmOrvtA":{"text":"Food was good and drinks. Amazing sunset. Live music and very friendly personnel. We defin","useful":1,"cool":1},"rzZF8BY_hDWSALI4K2wvmQ":{"text":"Charles was amazing! Beautiful and eloquent story teller. Made our cruise even more meanin","useful":0,"cool":0},"q9uKEE4ZEPI02M_2y6HaeA":{"text":"For the price this is a 5 star tour. If you don't like history maybe try another tour. We ","useful":0,"cool":0},"6mXJD1WrWpHcvqUTk4PYjQ":{"text":"Just back from New Orleans. Took the afternoon lunch time cruise to the Battle of New Orle","useful":0,"cool":0},"Kqkhh41kgcHVP_HhPdZpKA":{"text":"So great!  Our guide Christyn was passionate and knowledgeable about the subject of New Or","useful":1,"cool":1},"rUoHdFG1Fa1Kz8VKlDg9rw":{"text":"This is an absolute must do when you visit NOLA. The boat is in excellent condition. Pay t","useful":0,"cool":0},"nK3sOAsa-52E9Wcp_UB9NQ":{"text":"My husband and I enjoyed the afternoon historical ride. Charlie was an exceptional orator ","useful":0,"cool":0},"yq32rzTkpBn3mBJl90IVKw":{"text":"When I first heard the narrator come over the intercom I was hoping it wasn't going to las","useful":0,"cool":0},"cf5E_qLUxXbuU4IG7wETig":{"text":"I was skeptical about any sightseeing cruise to begin with but I give this 5* primarily fo","useful":0,"cool":0},"fLOhJYpekGek7ueGuAr5uA":{"text":"You can't go down to the banks of the Mississippi and not go on a paddlesteamer in my opin","useful":1,"cool":0},"Kq_07qN5JGy49WW2TySeog":{"text":"So, we got a Groupon for the Jazz Dinner Cruise. You must call in advanced to make reserva","useful":6,"cool":2},"nGfhWgZ9BgvcQ3ASSmRshA":{"text":"We did this cruise on our first day in New Orleans and it was very nice and relaxing exper","useful":0,"cool":0},"R5wazBU7F34Of2e97ERTtg":{"text":"We bought Groupons for the Creole Queen for our weekend trip to NOLA. We had such a wonder","useful":5,"cool":2},"EhLlNo71vVrqKZ_H6pT6xA":{"text":"All of the food was amazing. I had three plates and my baby did too.... only complaint is ","useful":0,"cool":0},"oqL7E42iLPKoOIY_xzHfRg":{"text":"The narration was just stellar. I wish I'd caught the name of the guide today (2/23) but h","useful":0,"cool":0},"C0D2-ACvkeCKz1poH45QUA":{"text":"As this was my first time in the incredible city of New Orleans, I was hopeful one of the ","useful":0,"cool":0},"ElFpZll8hBesDJJZHs1nXA":{"text":"Creole Queen vs Steamer Natchez. So I took a lunch cruise on the Creole Queen. I paid $48 ","useful":1,"cool":0},"D2nYZxNpqa9A_jzRoxYFtg":{"text":"My score 4.75 stars. If you've never been on a large cruise then here's a teaser for you..","useful":1,"cool":0},"sTr4jRjbUoFjflMrgtc0Uw":{"text":"Several years ago my wife and I took this history cruise on the Creole Queen to the Chalme","useful":0,"cool":0},"o1n27hikOyWDWRxdL9vQEg":{"text":"A boring experience. Very lack luster! From the coffee, to the food, to the \"band\" save yo","useful":0,"cool":0},"2u4HYm5Fe-DIEUHsNjJ5GQ":{"text":"Buffet was reasonable and yummy. The guide was witty and very knowledgeable. You have to, ","useful":0,"cool":0},"5Mxcp6X9t7YNF4qNVvv1tw":{"text":"I had the pleasure of enjoying this steamboat for its Mother's Day Jazz dinner cruise. I'v","useful":1,"cool":1},"2aFa17jZAyc0CBTmzEigWw":{"text":"Keep away !!!!!\n\nThe worst in the world , when you BYU online you have to stay in the bigg","useful":0,"cool":0},"zbA-YBvG70b-0vnZVRImoA":{"text":"Great ride along the river but Charles made the tour amazing!  He is a great story teller!","useful":1,"cool":0},"cLw8-6GuC53O5MuXAjiMhA":{"text":"Cruise time 10 and 2, board  30mins before departure.  No outside food, had to trash my ca","useful":1,"cool":0},"rM0SdrCg3qGtLeR0yZfsrg":{"text":"I recently got the chance to take a trip to NOLA and this was one of my favorite experienc","useful":0,"cool":0},"Dt1eZdVT4pK7cANaq4_M9g":{"text":"I've been yearning to go on a paddlewheeler down the Mississippi River forever. Finally go","useful":3,"cool":0},"7yzkkAy27YaGG_HZVH6kBQ":{"text":"We booked the Brunch Cruise on the Creole Queen for our trip to New Orleans. We were able ","useful":1,"cool":3},"UuGqa3wS2tcAnTwBTyNXcA":{"text":"Just got off the tour with River Cruises. The drinks made at the bar were really good, and","useful":0,"cool":0},"-bWmi_4vxWCoSX78QtCMAQ":{"text":"This was a nice 3+ hour activity to do while in New Orleans.  We opted for the evening din","useful":0,"cool":0},"dihswiO4OVKLUVDd907goA":{"text":"Had a great time on the cruise and visited the Chalmette battlefield.  The narrator Charle","useful":0,"cool":0},"iqyHUGwKfnwkQ8RlRoqksA":{"text":"I guess we came on the wrong day, which was a Tuesday. Me and my husband arrived and we we","useful":0,"cool":0},"0YPa0F9yOEHuzMARfFVgKA":{"text":"Took the history cruise to the Battle of New Orleans site.  Logistics were handled smoothl","useful":0,"cool":0},"hcoYiyg84d8677eHC8uHwQ":{"text":"Fantastic way to spend an afternoon. Plenty of outdoor seating so even though we got their","useful":0,"cool":0},"mWnMjyjPYx7HevcTVgUbAA":{"text":"Great boat ride all in all. Food was delicious, try the corn, jambalaya and the corn muffi","useful":0,"cool":0},"CzyH5Ttru8ynZ2vWG-XoDg":{"text":"Had a great time on the creole queen. Charles was an amazing story teller and did a terrif","useful":0,"cool":0},"C4Sv_LbycqWNwWH4iWUdwg":{"text":"This cruise is pure New Orleans!\n\nWe used our City Pass to ride aboard the historical Padd","useful":61,"cool":53},"qZdzlr6Ze7FDTgA6cJ0rag":{"text":"A MUST DO!  Food is quite good and the boat was novel.  But if you are lucky enough to get","useful":0,"cool":0},"r1aKpzxL8AT7GWEMDHe-ww":{"text":"My group and I were so excited to end our NOLA trip with a ride on the Creole Queen. We sa","useful":0,"cool":0},"cPl-z0Et2ZsuhyjYYQmPGA":{"text":"Our family booked the historical cruise aboard the Paddlewheeler Creole Queen.  We enjoyed","useful":9,"cool":8},"g-Tb3s1xv_3PjqneJgGhnQ":{"text":"Great tour, fun drinks, and Charles the tour guide is phenomenal. He tells stories and his","useful":1,"cool":0},"MERAXZ4qF_wBwoTeUqnfaw":{"text":"Sailing down the Mississippi in the evening with the sounds of jazz, a cool breeze on your","useful":0,"cool":0},"H1H7iGyNKAE2TL4YeLrELQ":{"text":"We thought we would do the touristy things while in New Orleans and decided to try this ou","useful":1,"cool":0},"Ux7SVNCQxqSgr9UWKTAf0w":{"text":"The tour was easy to book abs within walking distance from our hotel. The boat is beautifu","useful":1,"cool":0},"GgF3BuJRDls3UfPOUKLfBA":{"text":"The man making drinks touches money and then makes your drink with the same hands seems un","useful":0,"cool":0},"fVzHlMwkOf5lUxUSWuihAw":{"text":"Took this little cruise just to get out on the river and have the whole paddle wheeler exp","useful":1,"cool":0},"4_Ae64YQRs0ggHcOy5HG5w":{"text":"This was an awesome river cruise.  Our tour guide, Charlie, struck just the right balance ","useful":0,"cool":0},"ilNIXKkyGjbPNMBX3gxNNA":{"text":"This was so enjoyable!  The food was really good.  Charlie is the 'narrator' of the trip a","useful":0,"cool":0},"WBvHbT7cGESuld9XAEb2FQ":{"text":"Terrible customer service and backwards thinking application of policies. \n\nMy wife has an","useful":3,"cool":0},"_NJEh05vPcBIZVlee2qc-A":{"text":"This tour is a joke. I would rate 0 star if I could. The maitre D is a racist piece of art","useful":0,"cool":0},"_e8VZhpcSe0BaRTxHywC_A":{"text":"I have been on both the Natchez and the Creole Queen.  If you want the nostalgia go ride t","useful":0,"cool":0},"eyIA7j1Zfcf6v0al6oAqWw":{"text":"Charles is one of the best tour guide I have ever had and I have traveled  a lot. He evoke","useful":0,"cool":0},"FLtVCEvHE-Usm0dyAiE9KA":{"text":"Our group of 5 took the Historic Cruise on the paddlewheeler, Creole Queen and it was fant","useful":0,"cool":0},"9OraIhK8SBrfKRv7DCuHSA":{"text":"Great narrator/tour guide during the cruise!   Learned a lot and took some great photos!  ","useful":0,"cool":0},"H2En2nweUN3CwZTRm13lxA":{"text":"Charles was really amazing and gave a breathtaking account of Hurricane Katrina. I really ","useful":0,"cool":0},"jocI8BGilHdiT4l1bmXFwg":{"text":"Got to ride on the quaint Creole Queen for the Mississippi River Dinner Jazz Cruise while ","useful":3,"cool":1},"k3ghWE3D5SsqJUIEtLgYsQ":{"text":"Very nice experience!! The tour guide Charles is so informative so much so that he should ","useful":0,"cool":0},"TlpHsn1Y-LKQqmkPy8YkUA":{"text":"A great experience down the Mississippi River. \n\nLocating the dock was a bit tricky but de","useful":1,"cool":0},"mvhLQLTsTMB2J3LO1GFirQ":{"text":"The reason I chose an excursion on with this company was mostly because they offered a var","useful":9,"cool":9},"iGGhOjgPRjaUWz3RKx7jfg":{"text":"My family and I really enjoyed this history cruise. Charles is an excellent narrator & we ","useful":1,"cool":1},"vA34YYbBOBbUX-GFf21opQ":{"text":"The boat is clean and rides smooth on the mighty Mississippi. Staff were friendly and effi","useful":0,"cool":0},"uEPOUss3-5myeFu_Th3TaA":{"text":"Ok. Here goes.   Food was ok. Nice mix.  Served till 8:10ish all you can eat.  \n\nStuff was","useful":0,"cool":0},"ZRZpm1rlDUPNfyvo7AIQfQ":{"text":"Awesome and great adventure! \nCharles is an Awesome and amazing narrator, so much facts an","useful":0,"cool":0},"ZsFp_1ImKiiGGncI6PyNdw":{"text":"I loved this! We did the historic river cruise, which is part of the New Orleans Pass that","useful":2,"cool":0},"NzcJlrlSzeQydv1PNBheJQ":{"text":"What an amazing experience to travel down the Mississippi River on a Paddlewheeler! The to","useful":0,"cool":0},"_1FVwn64V2lynX2qZ_Qg_g":{"text":"This river tour was recommended by our hotel.  It didn't disappoint. It was a nice smooth ","useful":0,"cool":0},"wgkoO2QxNAVbGKAP85hGDw":{"text":"Very kind staff and tour by Charles was humorous, detailed, and reflective! Note that ther","useful":0,"cool":0},"ARkxFgjEoqgfTIOfkFvuow":{"text":"Not as described. I took the Chalamette Battlefield tour and was bitterly disappointed. Th","useful":0,"cool":0},"WMmnOuKNWTwyo_4Z50VTnA":{"text":"Great buffet (taste and freshness) and staff.  Would have appreciated about 15 more mins. ","useful":0,"cool":0},"zxVQc2MOKNWePchTkbbdcg":{"text":"I did a cruise on the Paddlewheeler Creole Queen in New Orleans, LA on 4/15/2015.  It was ","useful":3,"cool":2},"xMG2IMHxqPVD9RTpB_NjoA":{"text":"The Creole Queen provided a compelling and relaxed way to see New Orleans from the Mississ","useful":0,"cool":0},"OEyFxlLTHq-a1m9RV7qghQ":{"text":"This was a fun few hours of riding a paddle boat out into the Mississippi River. She (the ","useful":11,"cool":8},"nagVVBPzuIhQJCuNUc_AIw":{"text":"Great food. And the water was great. Was a girls trip and we enjoyed being out on the deck","useful":0,"cool":0},"xNi4UiXVQET80aSSvxf-8A":{"text":"What a wonderful time, I bought a Groupon deal to take a river cruise as I had seen online","useful":10,"cool":7},"V1eGnInZvDg9665aJETc3A":{"text":"I'd prefer to give this lunch tour 3.5 stars, but I'm okay with 4 stars considering how he","useful":1,"cool":0},"niO4j_CVK__fGBhJVfG9rQ":{"text":"I had a great experience aboard Paddlewheeler Creole Queen. \n\nI did the afternoon history ","useful":1,"cool":0},"tlaa_nDulusbONxfjT8Xow":{"text":"What a great trip.\nThe Creole Queen was clean and the ride was a blast.  The narration was","useful":6,"cool":5},"EsMWp7skMnQipXt41CpwiQ":{"text":"We couldn't pass up an opportunity to take a jazz dinner cruise down the Mississippi while","useful":6,"cool":5},"ZXFJbty8NUn9dloPRyQWQQ":{"text":"I have been on this cruise twice now. Once with a dear friend, once with an aunt. One was ","useful":7,"cool":7},"iDUB6kzqREyk_yohYUlY9Q":{"text":"Well, if it wasn't for the view, this would've been a 1. \nMy swamp mistress and I decided ","useful":1,"cool":0},"Ovcqhu2S5Oce_8gYJm-PVQ":{"text":"While the boat ride was what one would expect, the guide was not. Charles was animated, en","useful":1,"cool":0},"q7tEcXYY9GN5Nu1MlejtUg":{"text":"A really neat little tour up and down the Mississippi to the site of the Battle of New Orl","useful":0,"cool":0},"Wswx_RjhWs0VUUUkEl54bQ":{"text":"We purchased a Groupon for the dinner buffet jazz cruise on a Sunday night. It was very ch","useful":3,"cool":1},"JO0ECTU2aU63f_k2TT0aBQ":{"text":"Great experience if you're in the NOLA area and only have limited time to explore.\n\nNarrat","useful":2,"cool":0},"2n0tYm9psW4l75wlX9gS2Q":{"text":"Don't miss out on this, well worth it. We took the nighttime tour with buffet style dinner","useful":0,"cool":0},"9VPB-8YvNT59is6RZjZNIg":{"text":"This review is for the 10 AM, two-hour historical cruise.\nI really wanted to take a paddle","useful":4,"cool":2},"lKA-JknTXgmWkpNIMCkldg":{"text":"This was such a great experience. And so worth the price. My sister and I came last night.","useful":1,"cool":1},"RZ3HpJKm2dOFVT2isnfa0Q":{"text":"Amazing performance and really great food and service!!! I felt special because they sang ","useful":0,"cool":0},"r7aDhcK1MPDjRpNnGTucYQ":{"text":"My husband and I had our wedding on the Creole Queen. It was a great time! We had the cere","useful":4,"cool":2},"ACD8qK_KTDyEXoeQgBZoZg":{"text":"The Creole Queen is a 20 year old Paddlewheeler.  It is someone smaller than the more famo","useful":1,"cool":0},"YfHZ_Qcm8tAzyn5QhI0WDw":{"text":"We took a 3-hr tour today...very comfortable & pleasant...the tour guide Charles was excep","useful":0,"cool":0},"oFcAWY_GoElsGEA9lG37vw":{"text":"This tour was definitely organized. I'm very glad that I read yelp prior to know that the ","useful":3,"cool":2},"xAbCKQ_U097aAJ8Y_Rf3xg":{"text":"Loved the tour guide because it was educational and funny, but don't order the one with th","useful":1,"cool":0}}