{"NFP722rWJcjTw6YeUP8Abg":{"text":"This is an awesome medical care facility if you need a drug screening for a job or any oth","useful":1,"cool":1},"ULHENRCebIq2V0xeAiQemg":{"text":"I'm afraid I must decry the abominable experience I had here as well.  While waiting for s","useful":0,"cool":0},"uB6lhK6LkuTfe1WYVMmf7A":{"text":"I'm going to start off by saying that I did not receive medical care from this place so I ","useful":1,"cool":0},"mHhEG3t3f2J7SgsJgcqI-Q":{"text":"When we checked in, we were told we'd be done in no more than an hour and a half.  We wait","useful":0,"cool":0},"S41vwSCJXdksu0O2bfjusA":{"text":"I went to this urgent care for something relatively routine - cough, stuffy nose, head col","useful":1,"cool":0},"uifxiivczYHGxfyjfwsGrQ":{"text":"Took an hour to be seen at 8 am. Taking an hour to do a pre-employment drug screen. So, tw","useful":2,"cool":0},"hNktfUGy4jPsBIzwVlIZvQ":{"text":"Appt time 9 am.   Arrival time 8:30 am.     \nCurrent time 11 am. \n\nUpdate. Finally was see","useful":1,"cool":0},"9dasPaRBBS-5GgLSirvbGA":{"text":"Had an \"on-site\" incident at work. Took me a bloody moment to realize what had happened to","useful":1,"cool":1},"RgQj2OP5keS3xUVep9Wgcg":{"text":"I got a new job in the hospital setting, and was required to do the full gamut of medical ","useful":1,"cool":0},"ukI0oASIxfSCCAWkvic9jA":{"text":"I have to go with Concentra to fulfill requirements for my job. I usually go to the Willia","useful":2,"cool":1},"7oAOISGTc0nYeyTxtwVBYw":{"text":"I work a couple blocks away, and my office uses this Concentra for travel vaccinations and","useful":1,"cool":1},"LFFH_bK5tFnfJ6v1iC0UrQ":{"text":"If I could give this urgent care zero stars I would. I was one of the first people in here","useful":0,"cool":0},"5fQXpcJlHcddRSq4SyJu3w":{"text":"Feel free to take my experience as one exceptionally bad experience, as the other reviews ","useful":2,"cool":1},"3P085CcgScxVBN0_kjG2lg":{"text":"When I tell you that this is THE ABSOLUTE WORST urgent care in the city. I called them to ","useful":0,"cool":0}}