{"c2BfYWcd8Fng7quGQY-QZg":{"text":"Wonderful dining experience. Service was phenomenal. Food was excellent. Will return soon.","useful":0,"cool":0},"-XUyKrNpuGXGBzTAYwkGIQ":{"text":"Would love to give it 5 stars, but this being our second visit we were a bit let down. Her","useful":0,"cool":0},"hFY6i3S9D8XIXL-JmkEo8w":{"text":"I was visiting from NYC & I was getting really frustrated with the restaurants that my hot","useful":2,"cool":0},"DROP52modTa7MtHcuQwKQA":{"text":"I have to go with the consensus here, the crab beignets were honestly one of the best thin","useful":0,"cool":0},"i-FZEGvkawwFaxbJVy0ZMw":{"text":"This place came highly recommended to us, and for good reason. We went for brunch about a ","useful":0,"cool":0},"IcJPxVv4ltTW2HfIRDBX5w":{"text":"This was the first restaurant we ate at when we arrived in NO for a long weekend and it wa","useful":0,"cool":0},"HMvw5Eue0w4DjMZBaCSBtA":{"text":"Went here for Sunday brunch.  Was a little annoyed because I wanted reservations for later","useful":0,"cool":0},"osjsDo127v6o-WvljyFskg":{"text":"I went to this place a few weeks ago, but I'm only writing a review now, because I was try","useful":9,"cool":3},"rcSZscbJFMb9W1mfo5cf0w":{"text":"I've lived by La Petite for several years but have never gone until recently with some cow","useful":0,"cool":0},"S2fRJl1o2w1R-Go685NhDA":{"text":"Ehhhh...it was ok. Overall, food was a little bland for my taste.  Here's the breakdown.\n\n","useful":3,"cool":3},"yC52JlZ0UobVAfereZ8jGg":{"text":"Always a pleasure to sit at the bar and watch Holly (Hollessa) work her magic on every coc","useful":0,"cool":0},"d__bWx4RoVp2evnIP9JQ6Q":{"text":"Great Brunch!  I'm not going to stretch this review out. We started out with cocktails...w","useful":0,"cool":0},"E8p_SNGk9PuymPj8KemeKQ":{"text":"Turned away at 9:30pm on a Thursday when just requesting a drink at the bar, though they w","useful":0,"cool":0},"54A9Rv_2YR1-qU3Le5VC7A":{"text":"Great food but extremely rude front staff refusing to seat our party properly.\n\nRuined the","useful":2,"cool":0},"m6a0TQXwCB6NUKXzHLB3sA":{"text":"Very disappointing. Service was especially poor.  Our entres were very slow coming and the","useful":0,"cool":0},"-4fQwto6PNbN_SqcL7db8A":{"text":"I went here with 2 vendors today.  We started off with the blue crab beignets.  I though t","useful":0,"cool":0},"NXWkgjnfFwFqCt_MaJ0_lg":{"text":"Take a 10min cab to Magazine street to the amazing La Petite Grocery. The thoughtful menu ","useful":0,"cool":0},"Jlv8BiKncY_PoVGTyc80lw":{"text":"Environment is pretty good\nThe food is not what I had expected...\nI mean don't order the t","useful":0,"cool":0},"rjlW8YlvI1nmeV40Jw-9iw":{"text":"We enjoyed fabulous service and brunch in the wonderful space. EVERYTHING waz just right f","useful":0,"cool":0},"0-D6OftyPrgxvc_hgyhE0w":{"text":"Easily a 4.5. The Blue Crab beignets are worth the trip alone, they are amazing.  I went w","useful":1,"cool":0},"D--Vx1MY4uu1Zck7RX-Yig":{"text":"what a great place - the shrimp and grits is amazing as are the desserts. Great attentive ","useful":0,"cool":0},"0NO5lymrG02prN_bkAP1_w":{"text":"I finally got to try La Petite Grocery a few years ago and I've gone frequently ever since","useful":0,"cool":0},"lWUOj1bKB0h2vz0mjhbLTw":{"text":"We had such an amazing dinner here! We didn't have a reservation, and it was Saturday nigh","useful":0,"cool":0},"27itbORNhBgPUKW0Z08Ysg":{"text":"Great food, great service....the rabbit and the hamburger....(yes....i got the burger lol)","useful":0,"cool":0},"CNauUI4VNsP0qYgLu6xjVw":{"text":"The food was okay, it was created in a hurry and took some time for it to arrive. The bar ","useful":0,"cool":0},"1jiedGKBoa4jFgVIiTrceg":{"text":"Great spot for dinner or lunch and is not in the Irish channel as Yelp has it listed. It's","useful":1,"cool":0},"5NrDrGnJUNFNcK8PRNWwKQ":{"text":"My GF and I really enjoyed brunch here. The blue crab beignets were light and delicious. W","useful":0,"cool":0},"1JPCiNEjc5MH1bAHovqDSA":{"text":"What a joyful experience I had at La Petite Grocery. We had a group of six and they were v","useful":4,"cool":2},"2noRD3UQKGJTfyXqk4v1Dg":{"text":"Great brunch! Sat at the bar, which is always the best way to go. Had a delish hamburger. ","useful":1,"cool":1},"crvqoezzYPaMyYZCx_CsyA":{"text":"I came here last Thursday for lunch. I had 12:15 reservations but got there earlier than e","useful":0,"cool":0},"kTQrYychNsp4sGLUHdsP1A":{"text":"I read the reviews before dining at La Petite Grocery and should have paid more attention ","useful":1,"cool":0},"JkNDVaD7gEffZqfuAba34A":{"text":"After much research chose LPG as our one meal out during a family visit.  Started with two","useful":3,"cool":0},"VkTMdeNDAa5cQfKVE8z5YA":{"text":"Excellent restaurant! Great service and food. Shrimp 'n  grits are absolutely wonderful an","useful":0,"cool":0},"tgWI7xs6oxxk-pzg8dqxiw":{"text":"I'm so sad about this place. I've been looking forward to it and it just didn't live up to","useful":0,"cool":0},"wh38N-LDL9_Nr7wZlkQx8w":{"text":"We had a fantastic meal here on our last night in NOLA. The room was so romantic, the serv","useful":0,"cool":0},"ggt7pOYofBXaQDE1DT0EhA":{"text":"Great food, wonderful service and a beautiful, relaxing atmosphere! My husband and I had a","useful":0,"cool":0},"KsJLcf_y8q4m4T9PCSzHzw":{"text":"Spot on experience.  To start, the ambience was cozy yet elegant.  The night started off w","useful":0,"cool":0},"v8cyf-5o8VfV9MZ1ziGrcw":{"text":"We firstly intended to get to the upperline restaurant, a couple blocks away, but it was o","useful":1,"cool":1},"e9U16o7HKyFcJCyqSr5oUA":{"text":"Unbelievably good. Great place. Casual night out or special occasion - anything goes! food","useful":0,"cool":0},"5_lxodfH9pjDFyRzNn3Trw":{"text":"Wow, amazing first time experience here. The atmosphere has a Parisian note. The tables a ","useful":0,"cool":0},"e_qB1OqRdImLK241hIuL5w":{"text":"Great ambiance, great service and fantastic food. Shrimp And grits were great as was the c","useful":0,"cool":0},"YSTZlgOB5J8GisPVrUWg5g":{"text":"I hadn't been in a couple of years and was pleased overall with the experience.\n\nFirst, to","useful":1,"cool":1},"9sTNM4XpnuNsppfIXf8ptA":{"text":"I don't review often but I was HIGHLY disappointed. Overpriced wine (limited list), over s","useful":0,"cool":0},"7cZipKTS7dP8GDH6cYF7Qg":{"text":"This is the place to go for a romantic dinner with your loved one. Really enjoyed the blue","useful":0,"cool":0},"ICfi4aUU_9Fj5oKxqxy0Qw":{"text":"Just the best. Soft southern atmosphere with beautiful details and perfect accents. Busy f","useful":0,"cool":0},"mD7fU3xqghUX4MpvdHU6Hg":{"text":"Half of our food was great and the other half wasn't bad but misses the mark.\n\n  The steak","useful":1,"cool":0},"op7pM7C8oZQDM2Ugrj6tWQ":{"text":"La Petite Grocery is a lovely little café restaurant I recommend the fried rabbit & absint","useful":0,"cool":0},"ikSxe7C368oeQgPahQAVVQ":{"text":"Holy Crap!!! Now this is some good eating.  Pricey -- but I guess worth it considering all","useful":0,"cool":0},"W7ovlpI2g2_HmrVV4tbQiQ":{"text":"Our 1st visit there and it was amazing. It will be hard to not go weekly.  Can't say enoug","useful":0,"cool":0},"QSMwXHHKT_gCuiSZPOnejw":{"text":"Classic New Orleans!  My family all went with the LPG burger and fries and it was fantasti","useful":0,"cool":0},"-wbraa0KTpjBZlIschwX6g":{"text":"After a 6 hour drive for a business lunch... We arrived at La Petite Grocery at about 11:2","useful":1,"cool":0},"1C9fQBgA5EGVGJgZWBvvQA":{"text":"Easily the best new restaurant in New Orleans. We were smiling from the moment we walked i","useful":0,"cool":0},"eb3DqvSwGzZ062bofpfnLA":{"text":"I feel completely ripped off by this place.  We went for New Year's Eve, and I was shocked","useful":2,"cool":1},"PdWQmiZweQh2BpbC4J3s2w":{"text":"Great place. The service was professional and polite. Hats off to whomever is in charge of","useful":0,"cool":0},"ZmR4fklCfBZvvncdQTfgbw":{"text":"I came here with three of my girl friends and I must say that this was one my favorite res","useful":0,"cool":0},"9QbxgduErDz_rP7PTvGdVg":{"text":"Went a few days ago for dinner. 2 appetizers. Beignet Crab. Good. Not mind blowing. Pork c","useful":0,"cool":0},"OiuJiIZhV6vFwIizppY3lA":{"text":"My group of 10 came for Sunday brunch and the service was fantastic from start to finish. ","useful":0,"cool":0},"8_Sj82afYdFctfD9iAWf8w":{"text":"We had lunch here recently and it was a memorable meal.\n\nInterior is open and airy, with l","useful":0,"cool":0},"GZ-rYyPI1Avoi7J12bsyHg":{"text":"Beautiful restaurant, Tiffany lamps, gorgeous wood bar, excellent service. Try the delicio","useful":0,"cool":0},"9_CPDKwJY2Gn1B24oiO4FQ":{"text":"My wife had lunch here two days ago, and absolutely raved about the food and the service. ","useful":0,"cool":0},"hLUT2sgs495adHoguhOAFw":{"text":"I was riding solo for brunch on this particular Sunday.  I was dying to try their blue cra","useful":0,"cool":0},"D_6CAdQSYCPRkeP5VkCsFw":{"text":"Everything we had was great! Loved loved the crab beignets, the spaghetti with shrimp was ","useful":0,"cool":0},"K2cA85wJHgBxqGr2mgZyjg":{"text":"I wish i could give half stars because i would give this restaurant 3.5 stars.  The menu i","useful":1,"cool":0},"SG7DuM73TA82K1SekspYrQ":{"text":"Loved it. Garden district Creole-style cottage that was a gourmet grocery store in the lat","useful":0,"cool":0},"fh_kh9ZiRuqrJ2AmMr3x0A":{"text":"Cozy space, excellent service, spectacular food!\n\nCame here for dinner on Easter Sunday an","useful":0,"cool":0},"O2hm4qUfghoC16Xktx4EaQ":{"text":"We had an incredible brunch at La Petite Grocery over the holidays. Located in a charming ","useful":0,"cool":0},"uePgI02-A19zxm14vWXiUQ":{"text":"Fried green beans.  I've had them at other places, but La Petite definitely makes the best","useful":2,"cool":1},"BxM_6ZhBatvG20meo-NVZQ":{"text":"Went for our anniversary dinner. Food was amazing and service was very good. Only reason f","useful":0,"cool":0},"ezgYkM5OaVqdO-sjjkOVwQ":{"text":"During my trip to NOLA - this was by far my favorite ! Loved the atmosphere - really nice ","useful":0,"cool":0},"VV5PPyHEX-TuhQ-hRwThVA":{"text":"I really enjoyed our dinner at this restaurant. The space was casual yet nice; the service","useful":0,"cool":0},"gWGS_zlpomK8i2tEeb6xFQ":{"text":"Creative and delicious food, attractive surroundings, and knowledgeable and attentive serv","useful":0,"cool":0},"qzPaUt2bd0j8zjLBdCYjSw":{"text":"We recently celebrated a birthday in New Orleans and we were treated with a great suprise.","useful":0,"cool":0},"0pKAr6F55mcHrsrmhZAXlA":{"text":"Dined here with my girlfriend on a Sunday evening during a recent visit to New Orleans. Th","useful":0,"cool":1},"6FExAPSqjH5fgtF2IUbaew":{"text":"Visiting New Orleans for a conference my coworkers and I decided to make a visit after rea","useful":0,"cool":0},"rNy1KwSFXINWQuECG45i2Q":{"text":"Honestly-- of everywhere that I've eaten in New Orleans, I think this is my favorite resta","useful":2,"cool":1},"S2T69oi3Euo4C1zNLzJ_Qw":{"text":"Food was missing so much this day.  Fries over salted.  Lamb had no seasoning.  Scallops w","useful":3,"cool":0},"aGNncGxqv1MQI2ZCD8Glcw":{"text":"Food - incredible.  Blue crab beignets, braised short ribs, butter poached triple tail...y","useful":0,"cool":0},"yEWFRs3XRw3XE_nQEkGQdg":{"text":"I've been back probably 10 times since my first review. One of my favorite places in the c","useful":1,"cool":0},"RqGRE4WyDmE0d8gourkfRg":{"text":"Our NO native friends chose this restaurant for our post JazzFest meal this year . Great f","useful":0,"cool":0},"UaOoliD6zihMzSLB0KjmYw":{"text":"Blue crab beignets. That is all I remember from eating here, but they have stuck with me e","useful":0,"cool":0},"MJJRRGQvozoBgx3IfO9KhA":{"text":"This place is really, really good.  I enjoyed it 1000 times more than Commander's Palace. ","useful":1,"cool":1},"iZr2Vc7Yjyn0nJShvRcZ5Q":{"text":"We had a delightful meal and the wait staff were very accommodating (we went from a group ","useful":0,"cool":0},"SkOq3bXFbvZDCdQSHEvOkA":{"text":"Amazing dining experience.  Everyone was so professional, friendly and passionate.  Our se","useful":0,"cool":0},"TGkom39yMaOyaa60FP1lvQ":{"text":"The blue crab begniets and the shrimp and grits were two of the best things I ate while on","useful":0,"cool":0},"0951ofiqEJSIEvaDz0PVxQ":{"text":"Consistently reliable for a fine meal. Food is creative, with a great presentation.  A go ","useful":0,"cool":0},"RQWb7-tO7g2SIdoads94EQ":{"text":"I expected more.  It's a beautiful place, the inside is so much bigger than I had imagined","useful":2,"cool":1},"WzYeKLU-BBZv8SNL2EH6Fw":{"text":"After living in the neighborhood almost six years, we finally tried La Petite Grocery,\n\nTh","useful":1,"cool":0},"rNE-L8dF7l5s2bE31eKTDA":{"text":"we ate our way through New Orleans and this was one of my favorites. oh grits you deliciou","useful":1,"cool":1},"o5iRS5wBbrbKj15f0CHKQQ":{"text":"LPG wins the prize for my best burger experience in NOLA. I went as a part of a group, so ","useful":0,"cool":0},"52Ahh5BLpggKNv-ZVY2Yuw":{"text":"Petite Grocery was the locale for my birthday dinner this year and it was great selection.","useful":2,"cool":1},"0b2rq7D5FFmvcPBba5JH_g":{"text":"Blue Crab Beignets. Turtle Soup with Fried Soft-boiled Egg. Butterscotch Pudding. Repeat.\n","useful":0,"cool":0},"f105xkfg-kaR2KPiPYgD5Q":{"text":"Food was absolutely outstanding!  We did arrive shortly before the afternoon closing but i","useful":0,"cool":0},"eQQrrjo9hhP3_bkabBLcdw":{"text":"Is it possible to rave about La Petite Grocery too much?  I don't think so.\nI went here fo","useful":2,"cool":2},"ON9-7xX1ADzZPNkIIt3AiQ":{"text":"Drinks were good, but every dish that I tried was pretty average.  I had heard great thing","useful":0,"cool":0},"OLR0gdlwa-inXI0WFMvEKQ":{"text":"Of all the award winning restaurants I visited in NOLA, this was my least favorite. First ","useful":0,"cool":0},"grACXr9-jB52acnteOIBzg":{"text":"I went to La Petite a few month back with my girlfriend and her mom. None of us were disap","useful":1,"cool":1},"G70FQRyWnMZBUBNDcGlehg":{"text":"The food was amazing from start to finish. Lobster gnocchi was well portioned and the rabb","useful":2,"cool":1},"JnpaBbQ0XUgNKEQYZEuZqg":{"text":"Heard of this restaurant the same way most probably have. \n\nI have to say it was one of th","useful":0,"cool":0},"OLrPBBVoI_cZAa5WvbOCvQ":{"text":"This is probably one of my favourite restaurants in New Orleans so far.  It just hit the p","useful":1,"cool":0},"vjU3K1zbQ8pBr9mqczpQ3A":{"text":"Hands down-my favorite new (to me)restaurant.  I am not certain how I have gone all of the","useful":0,"cool":0},"Uvr_kxeruJnic6ly1qlRmw":{"text":"Believe everything you've heard about how great this place is. On our recent trip to NOLA ","useful":0,"cool":0},"LhdCJx7zqN74mMLrUqpGzg":{"text":"One of New Orleans' treasures, to me la Petite Grocery represents the very highest express","useful":1,"cool":0},"0Lbgg56GMAWkqrWbqoQ2sw":{"text":"Holy Shit This place is good! My girfriend and I came here for our new years dinner and we","useful":1,"cool":0},"cizqhz9fwDYvlE6Pr1QIcQ":{"text":"Saturday lunch -- arrive at noon, first plate at ten til one, notably just bowls of soup f","useful":0,"cool":0},"db7chKm7EySRVaoTKkqWUw":{"text":"Every dish was a hit! We went for a seafood theme and everything was amazing. I'm still dr","useful":0,"cool":0},"KBtZlU-ePaB8FdFLSTxVlA":{"text":"So here is the thing.  The food is excellent.  Service is excellent.  But for what you pay","useful":0,"cool":0},"0u0TiHZpsnYv-p4lR1XDOw":{"text":"La Petite Grocery may be my favorite restaurant in New Orleans. The ambience is elegant an","useful":0,"cool":0},"vAmQ9GnUbCF_VNI5BUD4rA":{"text":"My husband and I don't get back to New Orleans as much as we'd like, and when we do we oft","useful":1,"cool":0},"ThbbVaeCl7q6UvcvDwN9iQ":{"text":"Came for early dinner at 530pm. \nBonus: parking lot across street with key pad entry code ","useful":0,"cool":0},"YrEEkUv7Z7TD062cU9K4Aw":{"text":"Had dinner here a few nights ago and enjoyed it all! Our server was awesome and knowlegabl","useful":0,"cool":0},"LEi2AyZeENi87PLcXSKOoA":{"text":"Too expensive for what you get.  I really don't understand what all the hype is about.  No","useful":1,"cool":0},"VVs29yqX6d5X9Doc0F2KIA":{"text":"After reading other reviews, I was excited to try this restaurant while in New Orleans.  U","useful":0,"cool":0},"KLgKCOYjnNqRdh-xaMIVDA":{"text":"Y'all. Go here. Do it. I saw it on a Top 10 list of best restaurants in Louisiana. My husb","useful":0,"cool":0},"LLcfH-t1X8nb-D81W_eFbw":{"text":"One of the best meals I had in New Orleans...I am a picky eater really meat and potatoes..","useful":0,"cool":0},"Gf62RDRSu0JQAPCMEOFRlA":{"text":"Great warm and pleasant atmosphere. Excellent customer service. Our server Darren was very","useful":0,"cool":1},"VvfUT5zdeVL0Dl0CdBwUVA":{"text":"Blue crab beignets!!!!  Yes please!!!  Sooooo good. I could eat a pound of these.  Excelle","useful":0,"cool":0},"hH6w5XZX5jGl7CjJuCqApQ":{"text":"In a town with tons and tons of good restaurants, La Petite has maintained it's position t","useful":0,"cool":0},"R6JxzLFtM7iyKvyvq3rYGg":{"text":"I ate at La Petite Grocery years ago, and it was pretty much a perfect, magical meal. Unfa","useful":4,"cool":2},"071Ulh6zVuaPk46m9vyvew":{"text":"Would so go back!!!\n\nService: excellent\nScallops appetizer: excellent\nRaviolo appetizer: e","useful":0,"cool":0},"GoIjpPld_UAfulXRf_Jbsg":{"text":"Great restaurant. Lots of interesting choices ... Grilled octopus with black spaghetti was","useful":0,"cool":0},"wR6wBc8tF85KDnoMsYptQw":{"text":"Lovely venue with an interesting history. .. old market. Started with a jar of pickled veg","useful":0,"cool":0},"v46N3ohxxCvyl0iXpE2d7g":{"text":"I don't understand all of the great ratings for this establishment. The food is incredibly","useful":2,"cool":0},"qgHkwWqVqUQ3QgkUg8Arfg":{"text":"I went here the other night for my birthday it was great. Great decor inside I wish the po","useful":1,"cool":1},"qOuqg0QmMECmwWjMKYdVig":{"text":"My brothers and best friends came here for dinner on a Saturday night. The food and cockta","useful":0,"cool":0},"JPAMQr5FxZGIXMqUuLDwbQ":{"text":"Our meal at La Petite Grocery was the highlight of our New Orleans trip! We made a reserva","useful":0,"cool":0},"xXhRvJy4JuB3HJvSXwJD2g":{"text":"La Petite is a beautiful restaurant. The dining area is so lovely and well lit. We started","useful":1,"cool":0},"NBiXgDEeW7fc49LIyUjKpw":{"text":"Food, booze, service, ambience were all amazing. This is a place that I will frequent. We ","useful":0,"cool":0},"8Aym0qEImsVBtRw8b6lLfQ":{"text":"BEST CUISINE EVER!   I went to college in New Orleans and recently came back for a visit a","useful":0,"cool":0},"YL6COmASKV3rv75FK5qOTA":{"text":"Love, love, love this little place. Stopped in for a quick bite, I wanted to order everyth","useful":0,"cool":0},"JL-qBZpXpy8NfsdIGBzggw":{"text":"I went here last night for dinner with my husband.  We can be really snobby when it comes ","useful":1,"cool":1},"rnwOfDsNRb-1YLLlCyO_mg":{"text":"Beef tenderloin was excellent.  2 of us had turtle bolignese but flavor was overcome by an","useful":0,"cool":0},"NKkMl-EAdloF-RwuEy7lig":{"text":"It has been a few weeks since went here so please take that into account. We made a reserv","useful":0,"cool":0},"5sv4SyZ1vGA0ibb9UXEiJw":{"text":"This restaurant was recommended by a colleague when he learned I would be in NOLA.\nWe had ","useful":0,"cool":0},"qmbQUlMq-g-xb_l3ayiNyA":{"text":"I had the B.E.L.T and it was really good. Was it worth the price?  No. \n\nI also had the Th","useful":0,"cool":0},"7WJWhyssjv3b97y46iO6PQ":{"text":"Fantastic.  The Pork Loin was the highlight of the evening.","useful":0,"cool":0},"SN-z3WEzX42YchepHOssrg":{"text":"I picked this restaurant after watching Padma's pick for the latest season of Top Chef.  I","useful":1,"cool":0},"dr17WRJqH_jMmwHgxeoUag":{"text":"Nothing special!\nWe were very excited & hungry but ended up still hungry & disappointed.\n\n","useful":2,"cool":0},"Mk4Ql4pcW7PI9DE10Pf0jw":{"text":"I'm writing this review in lieu of filing a claim for false imprisonment. I've  been to La","useful":0,"cool":0},"SItW5XjvUXXyZziBEDp4Jw":{"text":"Ah some of the best food I have had in New Orleans thus far. We had 6 people in our party.","useful":10,"cool":4},"sgwzrg-cZi9NhfB39Wcv3w":{"text":"This was a lovely restaurant to find, that was jam-packed busy! A little on the pricey sid","useful":0,"cool":0},"UXrHsl6xSTIwqyPMgFuP0Q":{"text":"I only had one cocktail and the crab beignets. Both were fantastic!  The pricing was high ","useful":0,"cool":0},"ImiSf62ANMPQGRkipVldKg":{"text":"It was Date Night!  Yay Cousin Reina!  \n\nSo having had memorable Gnocchi at LPG years ago ","useful":1,"cool":0},"qjmKlN-KI-MX9SEVeGaBGA":{"text":"I found La Petite Grocery on a list of the top 10 restaurants in New Orleans for 2015 from","useful":1,"cool":1},"01pGQ6xZU-dKsT80j3ZOVA":{"text":"This was the first place my fiancé and I tried while in New Orleans and we absolutely love","useful":0,"cool":0},"5Fsm7glSQzlgN8qV5Isgiw":{"text":"While this place was quite the hike from the French Quarter--my friend and I are here carl","useful":0,"cool":1},"hTwivp6Btko7lkd7gnAIfw":{"text":"The crab beignets alone give place 5 stars.   Service was also amazing as got two great re","useful":0,"cool":0},"s3sULksUP4oh8N9FTcdSng":{"text":"I have been a couple of times and their food is absolutely exquisite. Never, ever, ever ha","useful":0,"cool":0},"RHIk6TbiWscgJc6pM_EIFA":{"text":"After five night in New Orleans, our final meal was dinner here. It was by far our favorit","useful":1,"cool":1},"XcqWLoC-q20LZk3rO-OfNA":{"text":"In a city known for its amazing cuisine, this restaurant was a big disappointment. The foo","useful":0,"cool":0},"vvRIj6V3ZQ8JaQJWrDnOuw":{"text":"\"Petite\" is a perfect name for this place and should be taken literally when ordering. In ","useful":0,"cool":1},"z_bQ3s-0yLKAWnQwgmpOsg":{"text":"This was our second visit in a year. \n\nThe service was polite, discreet, and personable.\n\n","useful":1,"cool":0},"c6h2yGd-W6UtTrUe6poh6w":{"text":"Literally took the rental car from the airport straight here. I have been three times, onc","useful":0,"cool":0},"496voqiYp--0HmtZGA8zbQ":{"text":"Blue crab beignets were  simply perfect.  We had the eggs benedict, grits and roasted aspa","useful":0,"cool":0},"XaKDduRXM0vgWBd9rM3PIQ":{"text":"Loved La Petite Grocery. Perfect for a special night out...low lighting creates a romantic","useful":0,"cool":0},"WY-1aFYWPpzoQfYknPzd4Q":{"text":"Highlight of trip to New Orleans (where we also ate at Coops Place, R'Evolution, August, a","useful":1,"cool":0},"2UlrJUfk4-nRXXv9AA283A":{"text":"Very pleasant staff.  Lovely ambiance.   Had the blue crab beignets and short rib appetize","useful":0,"cool":0},"UK8cY19uym8hJw9UEKSfPQ":{"text":"We had the best meal of our entire trip at La Petite Grocery. The elegant decor, great ser","useful":2,"cool":0},"C3EmmgxXE0S4_LDTRcHevg":{"text":"Was way too pricey for the food.  Got a waffle which was hard as a rock and way too sweet.","useful":0,"cool":0},"M4qQFDFT4m-XzzEwraDuDg":{"text":"Went for Sunday brunch. Had a gingerbread waffle with  egg nog ice cream and a Steen syrup","useful":1,"cool":0},"P9UcwJLrr-wQH2xAhiey8w":{"text":"Great tasting beignet!!!!! Gulf shrimp is delicious!!! The chef Justin was gracious enough","useful":0,"cool":0},"osE4aMxElYBBOhv7wm9Xxg":{"text":"I can't express how amazing our experience here was, it was so good that we returned the n","useful":0,"cool":0},"7SNcPu5t6C_CNEYltNe7lA":{"text":"Would be one star except that the cocktails and service were excellent. The food ranged fr","useful":0,"cool":1},"0nkAJBH49UrMh0ALeryskg":{"text":"Every dish should have a different flavor, instead they mostly blended together.  The food","useful":1,"cool":0},"tWYsRm8YDb-RP8f7LYIV7w":{"text":"Arrived with group with reservations and were promptly seated.  Didn't see empty tables an","useful":0,"cool":0},"GKOJR-dOywrKrf-77b-YvA":{"text":"very satisfying food; tasty and thoughtfuly, locally curated ingredients. relaxing unassum","useful":0,"cool":0},"bFSwfFXSNckzakNGFhQYRA":{"text":"Cute. Sat outside on the sidewalk which didn't  have the greatest scenery...but some of th","useful":0,"cool":0},"AvoO8T1UCYUoO_9tgBfNcw":{"text":"Incredible crab beignets, salads, wine selection, and decor. Can get noisy and busy on wee","useful":0,"cool":0},"S-D-VMjYRCsiw6x05Gmj1w":{"text":"We had a fabulous meal here. I would rate everything about our experience as excellent. It","useful":1,"cool":0},"nKli6JgZ-eCcWX75L4f7WA":{"text":"I have to say what a fabulous meal and service. My second time at La Petite grocery and ab","useful":0,"cool":0},"0bcmIYXBBBroFv1Knqnudw":{"text":"My boyfriend and I traveled 10 hours from Savannah GA to New Orleans and decided to dine h","useful":0,"cool":0},"-E1GEmjQBawUnHUXxY07SQ":{"text":"Just an exceptional meal all around.  From the service to the ambiance to the food to the ","useful":1,"cool":0},"9_SO9nPfF8-oJBdP65BSNQ":{"text":"omg, blue crab beignets.  in a town rife with delicious food, the blue crab beignets at la","useful":2,"cool":0},"4vEIZ_D5nrcO5i48P6wuvA":{"text":"Amazing. Blue crab beignets are a must have. Seasonal menu items were excellent. This rest","useful":0,"cool":0},"xfu6nWDdLy8sH1keQ4f_Fg":{"text":"Ehhhh, good but underwhelmed with overly-priced *fine* food.\n\nI've been hearing about this","useful":3,"cool":1},"rAyz7YW4KbP-k6h-ywPt4Q":{"text":"LPG is my favorite restaurant in the city and has been for a few years now.  I can't belie","useful":0,"cool":0},"VbXOQmgCmR7K1hpWdVRvSA":{"text":"About a few days before my trip to New Orleans, I started binge watching episodes of Top C","useful":0,"cool":0},"KavMKEB0hkTkMttKQPV8EA":{"text":"The blue crab beignets with malt vinegar aioli are seriously the most delicious breakfast ","useful":0,"cool":1},"goQvUGuqM4GFOfT7t-pctw":{"text":"Always amazing! We got the asparagus with goat cheese and lemon butter and it literally me","useful":1,"cool":1},"VOoHdYgOT_WC5hVB6uSQtA":{"text":"Ate here last night. Beautiful place, nice lighting pretty bar. We were seated immediately","useful":0,"cool":0},"lQpmGUy_yIMkdKFAIJm7KQ":{"text":"A meal to remember. Stumbled upon this place when shopping on Magazine Street with my husb","useful":0,"cool":0},"5TkTns2iH_Et-Yj1vvuQeQ":{"text":"I mean.... Lemme just start with Crab Beignets - holy shit. Done and done. Followed by Tur","useful":0,"cool":0},"L1Dp12dAFTj6ljc-bkvjWw":{"text":"La Petite Grocery is one of the best fine dining experiences in NOLA, and it's nicely loca","useful":0,"cool":0},"Qbv00bF9cwjaWw-4bURrZQ":{"text":"My wife and I had lunch there yesterday. We shared the blue crab beignets. I had the panee","useful":0,"cool":0},"e4PeZ_RbvNM8l5vyJWIH7g":{"text":"My husband's son and daughter in law gave him money for Father's day and birthday & inform","useful":0,"cool":0},"mmxyHyd_CsDjkJKuGAVzgQ":{"text":"Meals were excellent but the place is loud if you are in the front room where the bar is. ","useful":0,"cool":0},"bgoPcrsXMDv5yFr2OASZ2g":{"text":"What can I say about LPG? I don't even know where to start.\nCozy dining room and warm bar ","useful":0,"cool":0},"JwV7Tfi8LJObvHKmWnsBcQ":{"text":"Really nothing special here. The blue crab beignets are the only thing I would want again.","useful":0,"cool":0},"DIAgcqdfcB6dE2XHSw6yPA":{"text":"This restaurant is a gem. On a vacation in the French quarter, we decided to venture out t","useful":0,"cool":0},"qTQhf0qyqZAjsC0ShN4bSA":{"text":"Best meal we had in New Orleans.  We got the blue crab beignets as an app.  I got the rabb","useful":0,"cool":0},"lZkCe7y2ZRBGayyrDUYvuA":{"text":"Just returned from NOLA during Jazz Fest weekend and I must say t hat I was giddy with ant","useful":0,"cool":0},"7Nh3t550qw5qmCGr_4sv1g":{"text":"Everything is excellent. Bloody Mary's. Blue crab beignets, sunday brunch dish- fried chic","useful":0,"cool":0},"ccz2VgzWhcfLqr56_rI_7g":{"text":"Buddy and I went on a voyage to the Ye Olde College Inn after the Saints game, but found o","useful":0,"cool":0},"MMbomEfK5fpGlst4P3dLNg":{"text":"Went here spontaneously for one of many birthday celebrations...well you know we New Orlea","useful":1,"cool":1},"TVu5saFUXZomyEWnmiOJ5w":{"text":"My fiancé and I went to dinner here and this is our new favorite spot in New Orleans.The f","useful":0,"cool":0},"E8dEsPa60bLGPoXTqXSkjQ":{"text":"We had a delightful bunch. I had a Pisco sour, frothy and tangy served in a champagne sauc","useful":1,"cool":0},"Q8GMiqAxcDvBjdLNpNw24Q":{"text":"Very nice decor and great service. Went for Sunday brunch. The grits with pork cheek was v","useful":0,"cool":0},"_OzleIeWAGlNhPej_U_h2Q":{"text":"We loved it! Fresh, inventive entree creations! My husband and I stumbled across this rest","useful":0,"cool":0},"3EqzhBEyRz6J6ph_kIVEJA":{"text":"I just had brunch here after numerous marvelous dinners in the past-no surprise, the fine ","useful":1,"cool":0},"QFnMq5scCTRZIMc7jH4R3A":{"text":"Favorite restaurant on our trip. Blue Crab Beignets were incredible!  Also had scallops, b","useful":1,"cool":0},"Si01KSG6yv2vSsMVkcS5bw":{"text":"We had heard about this place from a friend, and made it a point to go on our last trip to","useful":0,"cool":0},"PEGMdt38C7seL3Hlr7PXXg":{"text":"Had an excellent meal and great service from the bartender, Christina, on a hectic Sunday ","useful":0,"cool":0},"09m6Cc3talaA03Jt8-OTuA":{"text":"Went here for a business lunch and it was excellent.  You can tell they really take a lot ","useful":0,"cool":0},"oHTjBczppkT7kcHj_dhNAg":{"text":"This review is solely based on their happy hour.\n\nLPG does a happy hour from 5:30-6:30 tha","useful":0,"cool":0},"lcVVMGdQQODrWeLXjtBtoQ":{"text":"I had high hopes but too high as we were disappointed. Best part of dinner was the $50 bot","useful":1,"cool":1},"AyUWXFhCSDEOQSXe7zk8fw":{"text":"Went there for a late lunch sat outside and had some wine, liked it so much that we made a","useful":0,"cool":0},"CyGqLyPjdWdQNw2q9wgIpg":{"text":"We were very excited for this dinning experience, especially given the accolades LPG has w","useful":2,"cool":1},"1mYn1EWyo-khJKZSmHTX7g":{"text":"Lovely place. Great food. Nice staff. Good clientele. We sat outside and people watched. D","useful":0,"cool":0},"y0KLemAER8hi9X8UIsLtJg":{"text":"Great little place for a nice dinner. The blue crab beignets were fabulous, as was the fis","useful":0,"cool":0},"iaSxoSzCQOv41SFBxCksuw":{"text":"Run don't walk for lunch at this attractive restaurant for the shrimp and grits! Wow reall","useful":0,"cool":0},"Mjz81i45hu7WReAWrSC2IA":{"text":"One of my favorite meals in New Orleans. So good!\n\nAppetizers:\nblue crab beignets - hot, o","useful":0,"cool":0},"UUPl6aeytRXIzr04IyqNzA":{"text":"Here's the thing y'all -- I ate here over a year ago and I still dream about this meal. Ge","useful":0,"cool":0},"js8oQVTgQJ0u_WlNiFEnsw":{"text":"To sum up: don't waste your time. \n\nIt sounded like a good idea of a place, a nice restaur","useful":0,"cool":0},"wtZItrsXLSZwps_w67RdzQ":{"text":"Had dinner at La Petite Grocery last Friday.  The atmosphere is excellent.  One of the bes","useful":0,"cool":1},"ujO0TelVG7lTCRhnWqQMZg":{"text":"The food and service was excellent. We had the crab beignets, which were unbelievable. We ","useful":1,"cool":0},"vXETNsd77QMCsTH-5cjswQ":{"text":"Cute location.  Service was good.  Blue crab beignets were good, tasted like a mix of blue","useful":0,"cool":0},"aLPXsVjDVwko6Q-6zLPWVg":{"text":"You could order the thing you think you'll least like on the menu and absolutely fall in l","useful":0,"cool":0},"-bz14XHvj9yGT45LPhAtwg":{"text":"Really Good!. As someone who lives and dies by pasta, it's rare that someone shows me some","useful":0,"cool":0},"hTYtBhVl_FTaygPzww_FbA":{"text":"I like to refer to this as a \"Yelp Review Update\", resulting in a slight downgrade\n\n3.5-st","useful":0,"cool":0},"CZVOHIMEzIh3Lfl4t2ZlGQ":{"text":"My friend and I took a trip to NOLA & Nashville and our we both agreed this was the best m","useful":1,"cool":0},"nekiO5GnXsUSymZTVO3jyA":{"text":"Met a friend for a burger here. Talk about a delicious burger!! Sure you'll pay a little m","useful":0,"cool":0},"R0GWm3VMpNmowGpNra5Jew":{"text":"Great food ! I had brunch here and got the paneed rabbit, which was warm and juicy with fl","useful":0,"cool":0},"w2gZV2_JaroseRVYaubfmw":{"text":"Deliciously prepared appetizers and meals are presented at La Petite Grocery with photogra","useful":0,"cool":0},"vBVSDqYI1SllSJ7Pc1zOBQ":{"text":"Yes, it's a cute place with friendly service but there are problems.  The charred octopus ","useful":0,"cool":0},"ezvIrIz3KCiCAMUHplrQPw":{"text":"This place is way out on Magazine however well worth the trek.  Especially so if you're bu","useful":0,"cool":0},"quMSsvdEOjbNZoCKX0uoKA":{"text":"We had a great final lunch in New Orleans at La Petite Grocery.  It's not a quick meal.. t","useful":0,"cool":0},"vFZphbxXLsOhlV7_7bB2Gg":{"text":"When a restaurant can serve a green salad that allows the freshness to stand out, balanced","useful":0,"cool":0},"v-Kn2FZTi0jGB0z-1MOsvA":{"text":"By far the most enjoyable meal I had in New Orleans, even considering two other James Bear","useful":0,"cool":0},"wi0YznFX8M972Bde951C2Q":{"text":"They have some excellent fine dining options and one of the very best hamburgers in NOLA!!","useful":2,"cool":2},"lduYpG-Uq5n-dQofhBMLTg":{"text":"Nice spot.  Outstanding food.  Great service.  Quaint little place.  Go out of your way fo","useful":0,"cool":0},"2wVXy4tdgRz3biGrwu1zaQ":{"text":"This has become our favorite restaurant in the city. The food is excellent - the homemade ","useful":1,"cool":1},"4SXu3LtOfofX97j5rQnS2w":{"text":"We had a lovely meal at La Petite Grocery.  Our server was knowledgable and attentive.  Th","useful":0,"cool":0},"kyl7r5jqsXGAHILVYo5mrg":{"text":"Crab beignets are to die for.  Just amazing.  Cocktails were delicious too - Pisco Sour wa","useful":0,"cool":0},"YEJhdcLGL1GsbaBiA8huew":{"text":"I met an old friend here with great anticipation of an unforgettable meal.  We were seated","useful":1,"cool":0},"D8XLhso1PP_abTrkH9NNsg":{"text":"This was our absolute favorite meal in NOLA. The ambiance it upscale and beautiful with go","useful":0,"cool":0},"Iw568OcZOgpuy4epTjRFWQ":{"text":"I am actually having a dinner at this place right now as I write this review. The food is ","useful":1,"cool":1},"3OJMUDKW2pzNUxuXhK_PGw":{"text":"Went small and decide to share a few appetizers:\nShort Rib. Worth a repeat trip to New Orl","useful":0,"cool":0},"67ftbIaTtXSXQvKGMUClrw":{"text":"I sat at the bar and ordered the sweetbreads (quasi chicken-fried style) as a starter and ","useful":0,"cool":0},"eFyCiEN5jnTL3NjJA0cvFw":{"text":"service\nextremely polite and maybe a touch too attentive? if that's your thing, cool. i th","useful":1,"cool":0},"BYm-tT8rR2HZPqaMvxRzFw":{"text":"Romantic yet unpretentious setting.  Started with the Blue Crab Beignets and was not disap","useful":0,"cool":0},"_v0OEKHqUUQpFCUSeehCSQ":{"text":"I went to NOLA with my husband in April and had to visit this restaurant. I went for lunch","useful":0,"cool":0},"nUoS71yl3emdd-zmRWelNA":{"text":"An afternoon straight from a storybook, complete with beautiful watercolor-painted skies a","useful":0,"cool":0},"tLCtJqAhmQs8ZoSYN5B3Fw":{"text":"This was probably our favorite meal in New Orleans. \n\nSteak tartar with fried quinoa, crab","useful":1,"cool":0},"L5eB-8u6rTx-S1IyFE9OvQ":{"text":"La Petite Grocery is a neighborhood restaurant for us.  Easy walk to grab a bite.  I've ha","useful":2,"cool":0},"1tosEPS5I67w64c1UUxbng":{"text":"One of the best restaurants in the city. Cozy and quaint with a hint of dated luxury. I've","useful":0,"cool":0},"r8od-RmoZqQLEX22VvLgaA":{"text":"Very delicious meal and the employees are extremely knowledgeable and nice. Ate family sty","useful":0,"cool":0},"EAFRGDnMykEewHylQsIZVQ":{"text":"What's not to love about a cozy neighborhood place that serves a wide choice of fresh cock","useful":0,"cool":0},"4ae_MkN52c_3CXawBsj_8g":{"text":"Was really excited to eat here because of all of the hype but I truly just wasn't blown aw","useful":0,"cool":0},"tkMXK6CZnxYNvydCxDYrUQ":{"text":"In five days of dining in NOLA, La Petit Grocery was the clear winner. To be fair, we did ","useful":0,"cool":0},"zsTVddUKTIZAiLcEfYmswQ":{"text":"My family enjoyed a great meal at La Petite Grocery on the occasion of my wife's birthday.","useful":0,"cool":0},"PuvtUussHf6dGm7WO8YKig":{"text":"Nope.  Not good.  Service was subpar. Would say more about her but was never told her name","useful":0,"cool":0},"ONAAtVNoGhARngB2WNws5Q":{"text":"Extremely disappointed with the restaurant. After following Justin on Top Chef and reading","useful":2,"cool":0},"X0iNzEaDTYA1AwTFwB1YKg":{"text":"We had a really yummy dinner here as our last night in NOLA. We started with the can't-mis","useful":0,"cool":0},"k7DXBbBmigtzL_XxgwBGgg":{"text":"This is a great neighborhood place completely outside the tourist zone.  Nice, cozy atmosp","useful":0,"cool":0},"6w7tCLt--zm3wZ9p52fOZw":{"text":"We went for a couple appetizers and a glass of wine. Our waiter was very nice, very warm a","useful":0,"cool":0},"Fp4bBiI05wgbyQkOqofFMg":{"text":"We were a party of six and the place was packed like a can of sardines, so, you know it's ","useful":0,"cool":0},"TrN49s4i4jHubnJjpXz0FA":{"text":"Some single girlfriends and I went here for valentine's dinner this year.  They have a gre","useful":0,"cool":0},"bJGITHdbhW4rsU74zl1PHg":{"text":"I ask the waitress, \"I know brunch is fairly new here how has the community received it?\" ","useful":5,"cool":2},"cgDkeMiYZMuffwiH93qAjQ":{"text":"I loved this place. It is a small neighborhood type restaurant with white tablecloths. I l","useful":0,"cool":0},"qpGAx5XxuYXjRbxvrexYpg":{"text":"Absolutely enjoyable.  we (6 of us) started with Blue Crab Beignets and we couldn't get en","useful":0,"cool":0},"k63pUhAfL_p6lNJBW_wgGg":{"text":"Service was great, and the food matched.  My wife and I have decided this is our favorite ","useful":0,"cool":0},"D8iWUlCs1uPuvtyTVt3cfw":{"text":"Friends and I dined at La Petit Grocery earlier this month. It was recommended by the chef","useful":0,"cool":0},"j-q30WvvLJmLESBNOlzPrA":{"text":"Delicious! Lovely neighborhood with lots of great dining choices so it's hard to stand out","useful":0,"cool":0},"YxN3LhGN6dLTJQOoVyF2Jw":{"text":"I find it immensely satisfying when a restaurant recommendation is true. La Petite Grocery","useful":0,"cool":0},"3LaG05oPxSlZo6ZWP12Tsg":{"text":"I love this place! It will be a place that I visit every time I go to New Orleans. I had t","useful":1,"cool":0},"CADfJ31OVgfy4268X3Y6Fw":{"text":"Back room is beautiful, food is a tad heavy but solid and service is great. I never get ch","useful":0,"cool":0},"22GMIcq8YKGIV2kDykYAwA":{"text":"I recently dined here and wasn't impressed.\n\nWhenever a visit from my father to NOLA is im","useful":6,"cool":0},"uh_r5xElwFLjg8n0vNQrdg":{"text":"I was visiting NOLA over MLK weekend and was super excited to try this garden district gem","useful":1,"cool":1},"5M7ygtjn2Y83IabCeAThBQ":{"text":"Superb food and service all around.\n\nThere aren't many vegetarian options, but what they d","useful":0,"cool":0},"YcI2SpGhVssPJc6rb_BZ3Q":{"text":"We rolled in on a Friday night and got promptly seated at the bar, so I was super pumped. ","useful":0,"cool":0},"pVZ5ORcADoOmACNLYo3jpQ":{"text":"My husband and I had a very pleasant meal at this restaurant last Friday evening. The serv","useful":0,"cool":0},"S8vDjPUUUPFtSb8bgG8OTg":{"text":"Just simply a perfect restaurant.  I look for three things in a restaurant: service, taste","useful":0,"cool":0},"kE0WZGkWa8F35y-z1FYLJQ":{"text":"The food was great! The wine was phenomenal. The atmosphere was perfect.\n\nDefinitely, orde","useful":1,"cool":0},"RYw_ncP6AJoBlM04Wx4gLA":{"text":"This place wasn't badly priced for the classy feeling in the restaurant. I have been conve","useful":0,"cool":0},"WCZ_eT6c5cQGPUJH_hXnCg":{"text":"What can I write about La Petite that hasn't been written about 413 times before? Yes, it ","useful":3,"cool":2},"7hH6hjvDQoq_I2rxQFPD-w":{"text":"This was the best meal I've had in New Orleans in a while. Every dish we had was cooked pe","useful":1,"cool":0},"-YM4uc-Tw9T2YQtIRSXSHQ":{"text":"We ate here last night and enjoyed it so much we added another dinner here later this week","useful":0,"cool":0},"DOQtDP6fZ8f6dGRMU8by4g":{"text":"OMG! I rarely like every course at a restaurant but this place was amazing from start to f","useful":1,"cool":0},"i1xeHRZx7Q6EurRMMKTNZQ":{"text":"Octopus was absolutely incredible. Usually octopus is gamey, but this was more like sausag","useful":0,"cool":0},"G3CdIVLnu3bQskTJvU9t4w":{"text":"Another star of our recent Tales of the Cocktail trip.  Our waiter was super helpful in st","useful":1,"cool":0},"luK2ArELL3aXc8AMmOeM1A":{"text":"This is a wonderful little gem off the beaten path. The service was exception, and the wai","useful":0,"cool":0},"J6eJLraFNWuJ1gZm4TKG4A":{"text":"Wonderful restaurant!\n\nWe had a variety of small plates. All were delicious.\n\nWe will be b","useful":0,"cool":0},"ZNWpXROXJGBQcIEjpJxvxw":{"text":"Delicious brunch. We didn't have a reservation, so it was about a 30 minute wait but defin","useful":1,"cool":1},"qczMuGfB2TggXKhgRUIvPA":{"text":"Best meal I had in NOLA and we had some tremendous meals. Cute quaint inside, fabulous ser","useful":0,"cool":0},"DZowLViGwOVgwAAdERIwbw":{"text":"I recently moved to New Orleans and had been anticipating my first brunch here considering","useful":1,"cool":0},"thH8FLL4rHdbPx0oDUqpUA":{"text":"Delicious! We had the salad, handcut pasta special with lobster, squash gratin, and shrimp","useful":0,"cool":0},"0hN9OplkNabLC4TXSf-U7A":{"text":"Formerly a neighborhood grocery store, the restaurant is welcoming and cozy when you walk ","useful":4,"cool":0},"PnxN5IBO0-iBhXGug3Owwg":{"text":"Delicious food but DO NOT GO THERE HUNGRY !   I realized the petite in La Petite is about ","useful":0,"cool":0},"p3dY8pa1LUapK2ueFbVSzg":{"text":"I LOVE THIS PLACE! From the drinks to the food and the service, everything was just phenom","useful":0,"cool":0},"2XgZhlw8vz8gskGILnK8Pg":{"text":"Loved it! \n\nMy husband brought me to La Petite Grocery last week for a special evening out","useful":1,"cool":0},"PdssP25K__sehUt5c2j6gA":{"text":"First of all... getting out of the French Quarter is a nice respite. The Garden District i","useful":0,"cool":0},"ZWex7R1Gog8glIELBoBh-w":{"text":"Very cute and quaint spot in the Garden District. Came here with 4 friends (all visiting f","useful":0,"cool":0},"YE-47RGR6eHLHrn5XctksQ":{"text":"Really exceptional food and service!  Will definitely go back again, and again.  Just came","useful":0,"cool":0},"JCsWXo0JAu__bamtWAl8JA":{"text":"Great first meal for us in NOLA. The grits were amazing in the shrimp and grits.  So good ","useful":0,"cool":0},"g845-FT8tzu0Fa6gFkaHEQ":{"text":"Blue crag beignets are divine. Dishes on the salty side. Chocolate torte with red plum ice","useful":0,"cool":0},"iRG2gcre-FWjPjlZPlo_Qg":{"text":"Great location a few blocks off the street car line in the Garden District. The restaurant","useful":0,"cool":0},"ev0YQIHukndGBamAumIPLg":{"text":"Normally, I can't afford to go to really fancy places... you know, white linen table cloth","useful":1,"cool":1},"0UCOx3Qpwx2llfTVCaLG3g":{"text":"Decent but clearly overpriced. My meal was just ok, but the worst part was my pregnant fri","useful":3,"cool":1},"FNtLfWmg1Mdd_BZH4WKFaA":{"text":"This week was our first time trying LPG.  After reading the reviews we expected a positive","useful":0,"cool":0},"ABbJIx4zuB-p05vwmPzK1Q":{"text":"Okay, I know I'm bucking the trend here and I hate to be the bearer of bad news, but it is","useful":0,"cool":0},"UJI0FnLlR1F00Sf7stfRQQ":{"text":"Stopped in for lunch rather than going to Cafe Reconcile. The waiter said; \"Pleasure\" in r","useful":3,"cool":0},"I0CzMlNuHLl9KDY4MYdcgQ":{"text":"Ambiance: A\nCustomer service: A\nFood:...eh\n\nThe blue crab beignets were ok. The rabbit was","useful":0,"cool":0},"1x_7GmIS8x0iRe-HIhf7mA":{"text":"Blue crab beignets: delicious. \n5 dollar cocktails at the bar for happy hour: awesome. \nWh","useful":2,"cool":2},"tOFiM9AKmXlb-nClKhbv0w":{"text":"I've been to LPG many times, and it's wonderful on each visit. The atmosphere is cozy but ","useful":1,"cool":0},"c6zfz-1d-qTg7iyUFjfQ9g":{"text":"I don't mind paying for good food but when your served 4 shrimp on your plate for shrimp &","useful":0,"cool":0},"11MwxjCy2WpqDufsm2y7Mw":{"text":"Really good food!  Nice staff!  They do not rush, so make an eveing out of it!","useful":1,"cool":0},"HdlOyQk--nkV531y5wMAAQ":{"text":"The restaurant is conveniently located on a beautiful section of Magazine St. The decor is","useful":0,"cool":1},"bZd7VXGnIiLZJ2JW8C510g":{"text":"Had a chance to dine here when visiting NOLA. It highly recommend by a friend. This restau","useful":0,"cool":0},"lGDp0bxBnc6or4tQOJ6R1w":{"text":"the food is amazing. the service is the absolute f*cking worst. get it together ladies.","useful":0,"cool":0},"ISsu1Ylw8U38HPUOmHL7PQ":{"text":"The blue crab beignets....WOW! I always look forward to Cafe Du Monde's beignets to kill m","useful":1,"cool":0},"qBUAeyCZtSv0gkIIQZYZaA":{"text":"{Great cocktails & appetizers shine at this Uptown spot}\n\nI went to La Petite with a group","useful":3,"cool":1},"X-y309fngOydfJX0Q_4Rjg":{"text":"On vacation in New Orleans, and being the foodie that I am - I had to check out Le Petite ","useful":0,"cool":0},"-8Fd3n2lFx2wU5PZr18-ag":{"text":"Wow, lick your plate clean!  Had a tasty lunch with a bottle of prosecco. The hand cut fri","useful":0,"cool":0},"OJpaqMeTzZpLG_hPo9-7Ow":{"text":"Had the pork loin special with braised red cabbage and it was delish! Also had the roasted","useful":0,"cool":0},"ZleYBMhe-KfpmRYw6cQQbg":{"text":"The meal was amazing. We started with a beet salad and steak tartar. The beet salad was ta","useful":0,"cool":0},"B902MZ_JUiLadi6Eyi6VRQ":{"text":"This was my third time here and finally tried their infamous burger! So good - loved the b","useful":0,"cool":0},"8bxoVQPRNa5yf7Fl91AsyQ":{"text":"Coming to NOLA, I didn't want to stick to just the French Quarter district, so I found thi","useful":0,"cool":0},"hujMKWE-xMseowFD0R4whg":{"text":"Fantastic food in nola!! Definitely make reservations ahead of time. Best dishes: blue cra","useful":0,"cool":0},"Q9-OY5jVMdPh8bhkoNYNhg":{"text":"I saw this place profiled on TV so my husband and I took a visit while we were in town. It","useful":1,"cool":0},"GA4TezSa7i47e7OyHzE0ZQ":{"text":"My boyfriend and I decided to go to LPG to celebrate his promotion at work. We have always","useful":0,"cool":0},"yRI_nNj9NODPELnSz7K9Eg":{"text":"Extraordinary service - utensils and plates change after every course, split played withou","useful":0,"cool":0},"Go0Vt6gPytONeq0DYTmAyQ":{"text":"Great brunch spot with fresh, local ingredients; amazing drinks & bloody Mary's !!\nAte the","useful":1,"cool":0},"CDHJyuula02-T32_IY8KfA":{"text":"I am a local New Orleanian, food lover, who used to love and recommend this restaurant. La","useful":1,"cool":0},"xuaZSi-u6XPGbT8KS79UcA":{"text":"We had a great experience at La Petite Grocery. Our appetizers were the blue crab beignets","useful":0,"cool":0},"ZZPW4Bsq4H_azNUyeFe1dA":{"text":"I was really looking forward to dinner at La Petit Grocery and the dinner was good but it ","useful":0,"cool":0},"Ka_5xd4zcRP3G43fCdbHMQ":{"text":"Had lunch here, and really loved the interior. The pasta tasted very fresh, and the servic","useful":1,"cool":1},"atgAj85CY1PShHa39PUUVQ":{"text":"Maybe we had an off day or maybe it was my first meal after Stella!  But i wasn't super im","useful":0,"cool":0},"ZvV-d9C5ri2heJ9OW6L-8g":{"text":"Incredible food and perfect service. Pasta appetizer tasted of the richest butter. Pork os","useful":0,"cool":0},"mhoYqc9piEM4AcgC4E1sNg":{"text":"Came over from Biloxi to experience the parades with the kid, he has a list of top burgers","useful":0,"cool":0},"o6thaS__BkCPpG_TXorO7g":{"text":"This is probably the best restaurant in New Orleans.  Much better than the touristy ones i","useful":0,"cool":0},"b1t6Wi6ObJYOoAAGAhF--g":{"text":"I've heard such great things for years about this place, and since I was late in making a ","useful":1,"cool":0},"vhTBLrBG9SP_lglzZHqa5w":{"text":"This is probably my favorite uptown Restaraunt. The food is always incredibly delicious an","useful":0,"cool":0},"UzAH8cor0tscIev0Zefjmw":{"text":"Delicious food on the corner of Magazine Street! I went with a party of 8 which allowed me","useful":0,"cool":0},"wgg3ourg9sOCucFmd-7p_A":{"text":"Beautiful setting- gorgeous funiture, dimly lit and beautiful flowers. I ate the crab beig","useful":0,"cool":0},"kikitHKxklIucp_hIqO4hw":{"text":"The cheeseburgers were really out of this world and I usually don't eat burgers. The bread","useful":0,"cool":0},"d1hm8P9PyajVUb5aSdtXeg":{"text":"Went here for dinner on vacation and it was excellent. The space itself was great, high ce","useful":0,"cool":0},"9fweCDI2IuY0tnKzXVfToQ":{"text":"Probably one of the most amazing lunches I have ever had. \nNo Joke. \nWhen I go back to NOL","useful":2,"cool":1},"R1KyebLoB7rgCy0rphsJVw":{"text":"Crab beignets blew my mind. And I never thought I would like it, but the savory bread pudd","useful":0,"cool":0},"uR5IeXQHP6cJVM4WSfjJrA":{"text":"My server was sweet. I came from Seattle for a visit. The head chef where I work told me t","useful":0,"cool":0},"9Iedg6Fl6BsXd9wU99nbxQ":{"text":"Completely charming atmosphere, a lovely staff and superb cuisine! One of New Orleans' gem","useful":0,"cool":0},"0RQch0Jm8PpJ1eEGk8GKJA":{"text":"It was just ok... Salad was flavorless and the beignet was ok. Best thing was the drinks. ","useful":0,"cool":0},"sLd6GMAVkb54LVcNOP1lbw":{"text":"Good but not jaw droppingly delicious. I ordered eggs with pork cheek and the pork was a b","useful":0,"cool":0},"Mc95k42rR7gPUKi90UJrqA":{"text":"This was my very first visit and what an experience!!! The wait staff far exceeds any that","useful":0,"cool":0},"DucuGVmGZSxHJEKPLQbkPA":{"text":"The night we dined here they ran out of the fish and pork entrees - not a good start. Skip","useful":0,"cool":0},"1AMghjS7eRpwEjEDFNovjQ":{"text":"I finally got to try La Petite Grocery for the first time.  My wife Brenda and I were cele","useful":0,"cool":0},"gDxlfj5cPbh2hSPjI80Uuw":{"text":"Oh my god.  Travel from far and wide to get to this place and eat their blue crab beignets","useful":0,"cool":0},"qpEwWbFj69TId5uDX2iv0g":{"text":"While I was visiting NOLA for a conference this September one of my meals was fortunately ","useful":0,"cool":0},"vlRTTt6G1zwoniWUwPJOhQ":{"text":"We've been visiting New Orleans 3 -4 times per year for the past 4 years while our daughte","useful":0,"cool":0},"5ZVmu6GW0GLI_Srn83f1jg":{"text":"American/French.  Closed Sun-Mon.  Tues-Sat. 11:30-2:30, 5:30-?.  A tad pricey: Main cours","useful":0,"cool":0},"bUJVg5q7imwuabVYumrECg":{"text":"Two words- Crab Beignets!  They were incredible.  The shrimp and grits were also good, but","useful":0,"cool":0},"oNebUZ5s2hHbTGaJrW4jew":{"text":"Love the service here. We had vegetarians in our party and the restaurant was very accommo","useful":0,"cool":0},"UGsfUjJvj558_oCRatS2dA":{"text":"The food was fantastic. Everything was delicious and overpriced. I had better duck breast ","useful":0,"cool":0},"M0nDwX4SBc1kFI2noFIQ9w":{"text":"We came here for dinner on sunday for the first time with friends who were visiting out of","useful":0,"cool":0},"8BMrQpiRuWYgUWIGFIzaCA":{"text":"This is one of my favorite restaurants in New Orleans. The food is incredible and the serv","useful":0,"cool":0},"Ot1QWXWrWm-T0ajF4hIWvA":{"text":"Everything we ate was amazing. I ordered the blue crab beignets which just melted in your ","useful":0,"cool":0},"NYCZ5q2gy4W1FD2chiiXNQ":{"text":"Everything about this place was perfect. Shrimp and Grits is one of my favorite all time m","useful":0,"cool":0},"xJqkqhclBdem1iSMzr0xZw":{"text":"Maybe I just caught them on a bad night but my last two meals here have just been average-","useful":1,"cool":0},"sl2ZH7JXO4rxAdug_GYYzQ":{"text":"Apple & Celeriac.\nBlue Crab Beignets.\nHand-Made Spaghetti.\nLPG Cheeseburger.\nHand Cut Frie","useful":0,"cool":0},"31l077lgrN6EoB8UoVL4Ow":{"text":"A truly wonderful find in more Southern parts of NOLA, my friend and I were so glad to hav","useful":3,"cool":0},"c4IrhczDzXDPhutLHIS5mg":{"text":"I had heard la petite grocery was good but I must say it exceeded my expectations.  Our wa","useful":1,"cool":0},"-waEzCjFcMkJd4nmPHjcaw":{"text":"Overall, this was a fantastic dining experience. I love the history of the building and th","useful":0,"cool":0},"kkkEPozx_i6SLVYKcYzUUA":{"text":"One of the best fine dining places in the city. Absolutely beautiful inside and I'm sure i","useful":3,"cool":0},"u1HhpTaj1WQPb_acy_pOsA":{"text":"The Blue Crab Beignets are one of the best things I've ever eaten and I am very much not i","useful":0,"cool":1},"i_eBGpE34kPEVbSw3yNEUQ":{"text":"The blue crab beignets are undoubtedly the best appetizer. Out of four entrees, the market","useful":2,"cool":2},"brW22kVUSNqs0bkXI-nS3Q":{"text":"4 1/2 stars (1/2 star deduction for noise).\n\nWe have been there a few times. \n\nAlways grea","useful":0,"cool":0},"_SX8yvr8U-XlFIVLThtu9g":{"text":"BLUF:  Very standard fancy restaurant in NOLA.  Menu is nothing spectacular but their food","useful":0,"cool":0},"y5esH-YvFEl-SWi0zKi3TQ":{"text":"Cute atmosphere. Paying parking lot near by if the curbside parking lots are filled. Make ","useful":0,"cool":0},"27OjRBaN4dCRZpNziKBpDQ":{"text":"Wasn't expecting to be seated here considering it was Friday night but it was 6:30 pm stil","useful":0,"cool":1},"-HO6tE85hpkU-9wZoErc6w":{"text":"I have been to New Orleans twice and went to La Petite Grocery each time. I had a great ex","useful":0,"cool":0},"CGWB7fT8h-kZn9TPodDMdA":{"text":"Deliciously fresh, extremely memorable meal with personable service. What a fantastic plac","useful":0,"cool":0},"etecDH2TF-urfpE_uS8Z0g":{"text":"Beautifully restored location with excellently prepared dishes. Apparently they are known ","useful":0,"cool":0},"NYPPXoOJP_qiGa4v2T8_7g":{"text":"Do not go here -First of all we added one more person and they made a huge deal about it- ","useful":1,"cool":0},"30TbCg2XVguRdVNwwHAHGw":{"text":"We enjoyed our dinner at La Petite Grocery.  This restaurant lives up to expectations of t","useful":0,"cool":0},"xq7kjXZJaPqsHV3c6jZt9Q":{"text":"We enjoyed lunch at La Petite Grocery. Our server was very helpful and efficient, the surr","useful":0,"cool":0},"hDWukFYDXT5jDyGOBt7_cQ":{"text":"LADY DATE WIN! Looking for a chance to get those fancy pants on? We're talking floppy hats","useful":1,"cool":0},"_2S3Yg4LU65jdsaELfMCHg":{"text":"Good services and good food. My expectation were high because I grow up in family own rest","useful":0,"cool":0},"zn05W7eGZXUb2GRSOGNDtA":{"text":"This place does not need my review. Nevertheless:\n\nGo to La Petite Grocery, people.  My hu","useful":0,"cool":0},"mQAyjCcvCp62wLYouQGdng":{"text":"We spent 5 days in New Orleans last week, and can honestly say this was one of our most en","useful":0,"cool":0},"nmHFX2gE_gzt3EyfbIupSQ":{"text":"Great atmosphere, delicious meal. Everything from the hostess, to the server, to the delec","useful":1,"cool":0},"VU__U2ol8OCGCEZVscxnpA":{"text":"We took the St. Charles street car to Napoleon and walked down to this sweet neighborhood.","useful":0,"cool":0},"v73eS_qZ7F_ayboMVvuZXA":{"text":"Maybe the worst thing is having a reputation for great food. Many of my friends who are in","useful":0,"cool":0},"dSxdZ5__XaAUE24R3xMFmA":{"text":"This is a late review, but we went here during restaurant week planning to try it out. Ins","useful":0,"cool":0},"aSPzONlJuZkD4AbQ9ls6eA":{"text":"Blue crab beignets were awesome. Wife had beef tenderloins and they were very good.  I had","useful":0,"cool":0},"rWleT8qsCq-v7qqBXOs5tg":{"text":"Extremely friendly service and incredible food.\n\nFamily-friendly, great place for a celebr","useful":0,"cool":0},"sCBPR70nAyKSYIisjCv10g":{"text":"By far some of the best NOLA has to offer. We've been visiting NOLA for 7 years and never ","useful":0,"cool":0},"PSkjmn_qZL8qzZXT5YzEkQ":{"text":"Lovely restaurant with an easy menu. The food will be good but depending on the day could ","useful":0,"cool":0},"TWOuvoddKe9nuJRol5TNxg":{"text":"Experience was awesome!!! Rabbit was on point, ribeye was to die for, appetizers were perf","useful":0,"cool":1},"bsWMqGGzr75JgOj8kclOYA":{"text":"I was not impressed with this place at all. The server was not attentive, he didn't ask fo","useful":0,"cool":0},"DKXTnDO1yH-a2_WWV8pu6Q":{"text":"Great restaurant! Perfect service that was everything you want when you want it and alsolu","useful":0,"cool":0},"8b57jxsoMRt9jJB40QubuQ":{"text":"La Petite Grocery was on my list ever since Top Chef New Orleans. I'm probably one of thou","useful":1,"cool":1},"RQ0rSTiK6dNA9vUZEQSl5A":{"text":"I've only eaten here for lunch (but often) and it never fails to disappoint. Great atmosph","useful":1,"cool":0},"zMOPLf9G5guZh5Cqtt_wFw":{"text":"This place is amazing. I've tried pretty much everything on the regular dinner menu, and t","useful":0,"cool":0},"X-RhO3dlkL_A92nu63OcNg":{"text":"Had dinner here last night. Very disappointing. Too many great eateries in New Orleans to ","useful":0,"cool":0},"hm2BjjC4eyu2w9DRMvsE8A":{"text":"My husband and I went there for dinner and were not impressed.  This restaurant has receiv","useful":0,"cool":2},"ZnOg1GBIqNR8N35X4XljHQ":{"text":"We really enjoyed our lunch here. It was a recommendation by our private tour guide and we","useful":0,"cool":0},"J31VZtVEOh_8x8rIG4OtTw":{"text":"I made a reservation for 6 people for my friend's Bachelorette party dinner. Even though I","useful":0,"cool":0},"BnBnxBGWeJaGuWhxpBb6vQ":{"text":"I hate to be a hater on a place that everyone loves but we weren't big fans of La Petite G","useful":2,"cool":1},"3348Hg5XOkL2tLFLHWUAmQ":{"text":"Got the special appetizer of fried green tomatoes and was sooo good! For entre ordered the","useful":0,"cool":0},"jr9hjt_97xMuIa1pTdlsKw":{"text":"Today's meal was a bit off.  I'm a relatively frequent costumer of la petite.  At lunch to","useful":1,"cool":0},"vSgYvgnR6DjLDTuCsSVvVA":{"text":"I got the blue crab beignets, LPG burger, and the ooey gooey cake. All three dishes were r","useful":0,"cool":0},"KDT5EWdGmBAibcWsw-0veA":{"text":"Why o why would a white tablecloth type place have a tv blasting over the bar and in the f","useful":0,"cool":0},"i5jOm1Un1_0ee6eATa1LFA":{"text":"We loved this restaurant! One of our best meals in New Orleans, by far.  We had the short ","useful":0,"cool":0},"rkk47iZ4siPOj3J7XP_hoA":{"text":"I love finding places in New Olreans that remind me of a Paris bistro!  I had lunch here t","useful":3,"cool":0},"xstAKxNt4tqNgPO_nZs7zQ":{"text":"If I had wanted to distract my attention from our 81-year old guest, I would have sent bac","useful":0,"cool":0},"LhJVXvivNOcVMK9-yj2pAg":{"text":"Beautiful decor in a cozy setting makes a great atmosphere for couples. The menu is kept s","useful":0,"cool":0},"JtDBQcKm1M-PGrxBcZS2xA":{"text":"Went to lunch with some friends. Granted, one of our party was about 15 minutes late, but ","useful":0,"cool":0},"umBuWMFWVQ2igXxnLNTcNg":{"text":"I need to give this place a 5 out of 5 stars because they served the best burger I have ev","useful":0,"cool":0},"I8BGFAPLQeknb9daHn-Y5Q":{"text":"This place is the shizzle!   I decided to walk down to Magazine street all the way from my","useful":0,"cool":0},"d_J4cciJeZswo0wA6CVm_A":{"text":"This restaurant is one of our top 3 favorites in New Orleans. Located on magazine street. ","useful":0,"cool":0},"wVBIITOgxMabnRp-plHN1Q":{"text":"This place was really delicious.\n\nWe were in Mardi Gras, so hey, we were there to drink to","useful":2,"cool":3},"cDRxAw8ix3YphXyHd8xYvg":{"text":"Delicious food but overpriced. Fun combinations with a twist on tradition. Portions should","useful":0,"cool":0},"stkx3N6Z_b_i4SoYY1dr8w":{"text":"If we lived in New Orleans, we'd be here all the time.  It's the only place we visited twi","useful":0,"cool":0},"-h4BGviZftGGuIwywbzIUg":{"text":"Would give this place 10 stars if I could.  It all started with a cocktail called The Bees","useful":0,"cool":0},"Rwh4fOQRDw2MPgQw13wH1Q":{"text":"Totally excellent dinner, This restaurant will stay in my  memory as the true New Orleans ","useful":0,"cool":0},"-Ip4YHKOZuhP1DLSsLK2LQ":{"text":"I'm disappointed to write this review because we held La Petite with such high regard unti","useful":0,"cool":0},"rUXhbnZ8iiyx2WvvKNaMCg":{"text":"I came with my family and it was horrible!!!!\nThe bread basket was extremely hard it was i","useful":1,"cool":0},"1qtuGN5mrs6M9bVnfIltjA":{"text":"La Petite Grocery's reputation is well deserved! Our experience was exceptional in this lo","useful":0,"cool":0},"ggaNRkb0mCJFfIa_oIkSAw":{"text":"I have eaten here a couple times. I want this place to be good. I keep trying to tell myse","useful":2,"cool":1},"XZocdlkHDfJ4FNbaxwWlIw":{"text":"Was going to go to Shaya but they were rude so we called this place and they had us a tabl","useful":0,"cool":0},"KltGmIgE1dU-9g_e4rBTsA":{"text":"Amazing food and spectacular wine list.  The service was also very good.  There were lots ","useful":0,"cool":0},"iVceg71snJMjpCeBWBc9dQ":{"text":"Best meal of the trip.  Lobster beignets, home made pappardelle and rabbit, shrimp & grits","useful":0,"cool":0},"CIzhWSSGUutE9HNbvHrBOQ":{"text":"All I can do is echo most of the prior sentiments of this lovely little NOLA eatery. I had","useful":0,"cool":0},"YUx4W5IXimozZlSS0w4P2w":{"text":"I took a $20 cab ride to come here and spend almost $200 for three people to have lunch he","useful":2,"cool":1},"zH0vYDTdyE6POmDpc7dOwA":{"text":"Sadly, this review must begin with comment on the service: we arrived promptly for our 8:3","useful":4,"cool":1},"3j3UYW389JvHNoqI9K2JJg":{"text":"One if the best meals I have had. We had lunch... we started with the crab beignets which ","useful":0,"cool":0},"7y0n6WYa1Nn3Xiz9HBZR4Q":{"text":"Absolutely Devine.  In a city with a reputation for the best food, La Petite delivers and ","useful":0,"cool":0},"Lu-o8PvisDzN8QzeRV86Vg":{"text":"This place is absolutely outstanding!!! I'm extremely hard to please, culinarily speaking,","useful":0,"cool":0},"k_q0IAnpazWUxXzz3gtmAw":{"text":"Very, very good.\n\n- The steak tartare was perfect.  Salty, meaty, with a touch of sweetnes","useful":0,"cool":0},"G3miT3vmJjfsAiYokowbaA":{"text":"I went here to celebrate the last night of my boyfriend's parents in town. We were a group","useful":0,"cool":0},"twiiQt-gJvQXBGPEgO4TGw":{"text":"Nice atmosphere with delicious food and great service. I definitely recommend going. Make ","useful":0,"cool":0},"6HSZq3kKb_Ior4FDlgUDqg":{"text":"It's not as good as I remember pre-K but still a good restaurant.  Excellent place for a r","useful":1,"cool":1},"mQbexAli7Aha5IbpXO-g7w":{"text":"This was a perfect meal and experience.  The food was delicious and extremely fresh and we","useful":1,"cool":0},"rJ-DDekJvrZ4tv94eu4NQw":{"text":"I would give them 5 stars based on their mojito alone. But their spaghetti with blue crab ","useful":1,"cool":1},"GT188ljkoBjKaRCAnKe-_A":{"text":"This place is excellent.  One of the top places in town.  \n\nLove the blue crab beignets an","useful":0,"cool":0},"_IAcHib_0pgcYOsOmbEO1Q":{"text":"BIGGEST RIP OFF IN THE CITY,!! very expensive very small portions not woodie flavors.Very ","useful":0,"cool":0},"9JGJ2ljYvfoZNGY1DhBlkQ":{"text":"The blue crab beignets are sinfully delicious--definitely get them. But don't sleep on the","useful":0,"cool":0},"sfrC1XSWMaj4EmBru0uSig":{"text":"We had a great meal and service, and will definitely be coming back to try more of the men","useful":0,"cool":0},"dGdHS7fI93nxHMysAeMaPQ":{"text":"I had been locked up in a conference room eating bad hotel food all week so the moment I c","useful":0,"cool":0},"A25Or93rdO2gagFxx35ZxQ":{"text":"Fantastic as always! The waitress was incredibly knowledgable and personable; the blue cra","useful":0,"cool":0},"qkrQR8g6jHCnNvIHbv3VTQ":{"text":"Stumbled upon this great spot on our last trip to New orleans and made it a destination th","useful":1,"cool":0},"fvhiqQ22pnyrMZxzdZwNMA":{"text":"This restaurant was highly recommended by local friends, and all three of us -- 2 tourists","useful":0,"cool":0},"wQHNxcuEzzwDQOMq97dmYQ":{"text":"We decided to go here while in town for Thanksgiving because we have been watching Justin ","useful":0,"cool":0},"OgBwB0tWMCJK1MWtg57_8Q":{"text":"Super amazing Shrimp grit!! Dessert was awesome. We order blue crab beignets, turtle pasta","useful":0,"cool":0},"jwErwD8MoOQUw0KSNCEoyg":{"text":"Came here because the LPG burger was listed in Thrillist as a top 100 burger in America. I","useful":0,"cool":0},"J_7RUTPCD7HYiqUNrXPaaQ":{"text":"I finally made my way over to La Petite a couple of weeks ago, and I'm joining the rest of","useful":8,"cool":4},"EkqKiVs0brt3KKIpOxaRIQ":{"text":"Every experience I have here has me planning my next visit. \n\nWith my cousin in town, I ju","useful":5,"cool":3},"-i6zdFvGU3HgBceSDut-iA":{"text":"Came in here on a monday night before I left for Boston. I am terrible with names but Nick","useful":0,"cool":0},"GAkDXzFUfaRGI5SkQZfc4A":{"text":"Excellent dining experience. But one would expect nothing less from a James Beard 2016 win","useful":0,"cool":0},"mClblKxP7yFcxRHuX3jH9w":{"text":"Disclaimer (My wife and I have a good relationship with one of the proprietor's mother, bu","useful":4,"cool":0},"1U2ZqBIZFlyA30eIY1k67Q":{"text":"wonderful lunch here.  we sat outside, and enjoyed some of the nice fall weather.  our wai","useful":1,"cool":1},"6d07ozqnKPdrPt40batnmg":{"text":"Went there for brunch and it was absolutely delicious! Everything I had from the crab bake","useful":0,"cool":0},"YYAufiBER-cwI4vW8IBtHg":{"text":"This was even better than I expected. Was there with girlfriends on Valentines night and w","useful":0,"cool":0},"FTxDrpcHVc55FueBCbfICQ":{"text":"Born and raised new orleans girl and this food was mediocre at best. Me and my mother had ","useful":0,"cool":0},"Utc1KFuFQ-wwLiUTj5FvmA":{"text":"A real solid 4-star experience - from service to tasty apps, savory entrees and satisfying","useful":0,"cool":0},"zTJb5uJFUHRyaP9JA63nKQ":{"text":"Excellent food. Romantic setting. The crawfish beignets were delicious. Shrimp and grits v","useful":0,"cool":1},"c-MGNkd5H1X8i5zPaRDj8w":{"text":"Loved the service and ambiance, the food for the most part was wonderful. Just a bit on th","useful":0,"cool":0},"WeQ1YPQj2pxWy1liQ-eDtw":{"text":"Crab beignets. Winter soup. Pork belly. Amazing service and drinks too. What a lovely dinn","useful":0,"cool":0},"_47-kwYMxkwduLZFWZSHgg":{"text":"Went here recently and after some very painful deliberation (the menu is wonderful) ordere","useful":2,"cool":1},"IihaTCv9Zc83eSoHC2SnQg":{"text":"The food was 5 stars, only reducing one due to small portion sizes (as can be expected at ","useful":0,"cool":0},"1rJTPjoouEw0hRL7fapDHg":{"text":"Lovely place for dinner;  eclectic decor, tin ceilings,and  location. We took a group here","useful":0,"cool":0},"BTHhnXEBXbF5-uiCIpATcg":{"text":"Had dinner here and must say it was the first kid-friendly place we'd found after 2 days o","useful":1,"cool":0},"vXOKdnrrvNqVYZIaCzp2lA":{"text":"A great restaurant to try.  If you want to dine with locals, this is the place.  Try the b","useful":1,"cool":0},"S_DudXV2u_VKceDqGgAOgA":{"text":"Great little restaurant with excellent food and a good wine list.  A salad of thinly slice","useful":4,"cool":2},"ZSC46IJgboN6HoNFWqQgFw":{"text":"I really loved this place. After eating some sub par friend food all week long, my tummy w","useful":0,"cool":0},"8-ZaDY_fV9JYMTwHYovYJg":{"text":"Had the chicken.   Excellent\n\n\nThe pickled veggies. Very good\n\nCrime brule.  Crazy good\n\n\n","useful":0,"cool":0},"LtGkjfRcsOpDYtf9jBRo4w":{"text":"Friendly service, great atmosphere, great bar. \n\nBlue crab beignets and the spaghetti are ","useful":0,"cool":0},"zzgN0fYfpMxIfWEDKwnZgg":{"text":"at la petite grocery on a cold day in january, restaurant 60% empty, elegant, relaxed, noi","useful":0,"cool":0},"2_FlxMCOOWzZ7vbzi4nHzQ":{"text":"This was the only reservation that I made prior to arriving and they lived up to my expect","useful":2,"cool":1},"JxYQKZjitVk7unizDkwUWA":{"text":"Food was mediocre. The turtle bolognese doesn't taste any different from a regular bologne","useful":0,"cool":0},"MZD0HJTXdAQ68oK2lrx2gg":{"text":"This is our neighborhood restaurant and it's a doozy! Food is great, service is great , at","useful":0,"cool":0},"VQBFM2bxsCry5yRa69R_7Q":{"text":"Creole style cottage was a grocery store prior to converting into a note-worthy restaurant","useful":0,"cool":0},"GvCiA2VELliNiQKX7K2J_g":{"text":"Blue crab beignets and the \"special\" salad.\n\nBeignets were still creamy and soft in the mi","useful":0,"cool":0},"DQz8WArBUavtwQ87OqF6Kw":{"text":"In New Orleans for a week of business, I sought to get away from the Convention Center hus","useful":0,"cool":0},"MkFtSRLdFUvbElJoYiAEAg":{"text":"This is a special place complete with delicious eats, professional, unobtrusive service, a","useful":0,"cool":0},"GFFUbBUz-JRbVAre1kZQMg":{"text":"Had a delightful experience. Magazine street is a great place to walk -cute shops and gall","useful":0,"cool":0},"nChu6CELagKc0kzhSgGzmg":{"text":"The great thing about visitors is that you go out and eat special meals. This was my first","useful":5,"cool":4},"kmbfyB-adzCJIbQXQC1XNA":{"text":"Had the best experience at LPG! \nFirst things first, if it wasn't for La Petit I would hav","useful":0,"cool":0},"s__hx7oT7tT_Ww6vSxTrsQ":{"text":"Great dinner place.  5 stars for food but l3 for service for being way too slow and inatte","useful":0,"cool":0},"VeSgmUBShC_5OY-oXmSWYw":{"text":"We had dinner on Oct 24 ~ the terrible service we had unfortunately overshadowed the inter","useful":0,"cool":0},"4tNa8OtieFlHq0xiy-Uj5Q":{"text":"I've gone to La Petite probably 10 times or more now, and I've never been disappointed wit","useful":1,"cool":1},"0zgQlzDNylW5Xajr9Hd5Bw":{"text":"The food was incredible. Do yourself a favor and order the Crab Beignet appetizer. The ric","useful":0,"cool":0},"AE88p1sR2P5BDZmPvoiO5Q":{"text":"The food here is absolutely delicious and the servers are happy and friendly. This is one ","useful":0,"cool":0},"nnFCIoMaVNQ8qbZYIfWdxA":{"text":"Great staff, comfortable place, easy to make reservations and food was very good!  Worth i","useful":0,"cool":0},"Nj-3VFAE_L_X4Ri8NwxJ4w":{"text":"I'm going to start by saying the alligator bolognese didn't wow me. It was good, but I'll ","useful":0,"cool":0},"Q0QQPz3zzThpOcFcps0Reg":{"text":"Went here for brunch this past weekend. We had a reservation, but the place was not that c","useful":0,"cool":0},"UMx_a5w0IiJ-4Fnt5TGjDQ":{"text":"So yummy and such a great find on beautiful Magazine St! Loved it so much the first time, ","useful":1,"cool":1},"n_MAZmgBVAji35GedNRTYA":{"text":"We had New Year's Eve prix fixe dinner with wine pairings. The food was fantastic-- very s","useful":3,"cool":1},"fs7jBiFdOsDYR_MDqK4kCg":{"text":"This was my second trip to La Petite and I'm not sure if my memory was better or if I just","useful":1,"cool":0},"ztd90ZT1IiirG9ICapH1xw":{"text":"Running off a rec from the guys at infatuation.com we visited La Petit Grocery for lunch k","useful":0,"cool":0},"50rdoJu7AkJUBy7amTaC4A":{"text":"When you get out of out of an area you really discover those unique quaint restaurants tha","useful":3,"cool":0},"E1V6LJ46uIFxVhrnRRBiRw":{"text":"Exquisite. Ethereal. Elegant. A few of the adjectives that come to mind when I think of La","useful":8,"cool":7},"3jBEmLUvcQx9e6e4Nw3NnA":{"text":"5 star small plates, 3 star entrees. Confusion sets in when trying to review this place. T","useful":0,"cool":0},"MCqFEwRKW91syqki2RL2Lw":{"text":"Best brunch in NOLA!!!!\n\nWe easily made a reservation via OpenTable and were promptly seat","useful":1,"cool":0},"j215EnabVcSZD7NAfJz-5A":{"text":"Coup de foudre at La Petite Grocery. Intimate French bistro space mixes with the contempor","useful":0,"cool":0},"3nM4ichPW8t7GfBgJgyQsA":{"text":"I am proud to call New Orleans my \"hometown\" and , surprisingly, have never been to this r","useful":2,"cool":1},"_9bNXfxL2agmA9DmrEKD7Q":{"text":"I'm sure there are other restaurants that are just as good or better than this place, but ","useful":0,"cool":0},"E2XSlG3z3QQoVzRvJQZjoA":{"text":"What a great night! We went here to celebrate my girlfriends new job and a new business ve","useful":0,"cool":0},"tTKhxi9LbL60SHLJNPL0RQ":{"text":"My wife and I had dinner for her bday and the food was absolutely wonderful. We had the cr","useful":0,"cool":0},"e0pBpgWfk63vyCZoPwV8ZQ":{"text":"Took my husband here for his birthday. I was a little nervous as we normally visit our usu","useful":1,"cool":0},"xEoGcpLX9--mPmcFope5pQ":{"text":"Three stars feels a little generous. Two feels stingy,  but I think more accurate.\n\nJon an","useful":2,"cool":1},"XCqQl-hJ5lEyO0lwbImO_Q":{"text":"I went for lunch.  I thought the service was quite absent.  The drinks were great but I th","useful":0,"cool":0},"UYLO5vzWYynfw8mrPTzybA":{"text":"This place wasn't really what I expected. Somewhat pretentious food offerings that aren't ","useful":0,"cool":0},"iM0RbEpVlqsPjAewo2gFTQ":{"text":"Our waitress was so kind and helpful. Everything we ordered was delicious!\nOur sweet waitr","useful":0,"cool":0},"tc2MhgIhwyvkuawy4kQJ3A":{"text":"I had heard many wonderful things about this place, but I was blown away. First of all we ","useful":2,"cool":2},"T4XV8puqi7KvaQIVrenf3g":{"text":"WTF has happened here?  \n\nWorst meal  We had in NOLA.  We called that afternoon of 7.14. t","useful":1,"cool":2},"ml9PzF4pn6abf4St1l2H3A":{"text":"Hands down the best meal that I have ever eaten!!! Also, the service is professional and k","useful":0,"cool":0},"GBKVhY9cTaI59IHhuMuO6g":{"text":"We had a reservation for brunch and were about an hour early due to a flight getting in mu","useful":0,"cool":0},"ZYISVcBM7O1Jw6476a2SZQ":{"text":"Amazing. We had pretty high hopes for this place, and they were easily exceeded.\n\nWe got t","useful":3,"cool":0},"9rR20uJu7RJ5BB1uh1In8Q":{"text":"In town for a conference with colleagues and we met for dinner as a local \"must experience","useful":0,"cool":0},"7u27NoNv8HDiiaZgonF--g":{"text":"One of the best meals we've had in new orleans. We went tapas style with the all of the ap","useful":3,"cool":1},"wsQWIJzZ6pOl4QfUJsWenA":{"text":"A restaurant that has been on my list for a while, maybe my built up anticipation let me d","useful":1,"cool":0},"1XyLro7LiF80Tcmzz3tS-w":{"text":"Came here for an anniversary dinner with my boyfriend and it was a great experience! The b","useful":0,"cool":0},"fKCQnYl0a7hC6FDjWkKQPg":{"text":"I came here for a Saturday lunch to see what all the fuss was about. They have a private p","useful":1,"cool":0},"13-lHxONTiYtIjYJviuUHw":{"text":"I have to say we were so disappointed, we ate there last night we ordered the fish of the ","useful":0,"cool":0},"RyO0FBsYXixIAkQI5xHHgg":{"text":"Has La Petite Grocery gotten a little too big for its la petite pants!  I have been to the","useful":0,"cool":0},"8MuC30Pka7mOmT1zJj2Cqg":{"text":"We recently came here for a birthday dinner on a Saturday night.  Everything was absolutel","useful":2,"cool":2},"nUy_W1cImmbtmn5yVmaijA":{"text":"We had lunch on a Friday.  The place was not very busy with just about half of the tables ","useful":0,"cool":0},"Csv-wAU62rQr8MmqnOgANw":{"text":"Amazing! Probably the best grits I've ever had. My husband had the beef tenderloin and tha","useful":0,"cool":0},"6eJvaBcUuN93_8L4c1RzfA":{"text":"One of my favorite places to eat.  i have to admit i liked it better with the previous che","useful":0,"cool":0},"2VIaetoe3DEsdASP6jccbA":{"text":"On a recent trip to New Orleans we went here for dinner and were blown away. We ordered th","useful":0,"cool":0},"wmyRTzOp9Pb2Jg4r8rCvfQ":{"text":"The food was good but took a long time to arrive and when it did it was cold.  They warmed","useful":0,"cool":0},"xtFuKuK8NNXkY1X__-E0kw":{"text":"Always consistent. Delicious. The salads are always fresh and delicious. The Duck Confit i","useful":1,"cool":0},"i5HReiptJ89w1BQqggAvQg":{"text":"Was told about this restaurant from a friend while in NOLA for meetings.  So glad we tried","useful":0,"cool":0},"QyeXCxSdcWXCUtR20lWIwQ":{"text":"Stopped here for brunch on a Sunday and would definitely go back! From the signature cockt","useful":0,"cool":0},"fV5zEp-4GrJfBiwXAYgg6A":{"text":"Absolute disaster.  Vast majority of meals were similar to licking a block of salt.  Unfri","useful":0,"cool":0},"Jfv1KtuSgNVF27Ygl0lpGw":{"text":"Underwhelming. A the crab beignets great. The rest was just okay. Nothing special.  I was ","useful":0,"cool":0},"VKq_aHzvvN8XhbAafate4A":{"text":"You typical french bistro with a great atmosphere and even better service.  They have my f","useful":0,"cool":0},"bbYL-VOOEarG4i6rus11CA":{"text":"The only thing that saved this restaurant from getting one star is the fact that the desse","useful":0,"cool":0},"h1_mtlfWyyfi9q8meCZkxg":{"text":"This is my favorite restaurant in all of NOLA. Their turtle Bolognese is the bomb. The Lou","useful":1,"cool":0},"PrOuh2KgFUYAh9DI4l8Exg":{"text":"It is a nice place, pleasant though a bit loud, great service. We tasted several options o","useful":0,"cool":0},"ZnPRJiXHwu9nQH0NxvXI8g":{"text":"Food & Cocktails were Awesome!   Now, if only the Service matched their Food.   Past revie","useful":0,"cool":0},"QZZQyIuRefjA1kNdl2inmQ":{"text":"We had a lovely lunch at Petite Grocery.\nOf course we had the famous Blue Crab Beignets! Y","useful":0,"cool":0},"cXZQNsu3fe_EOSujBNfpgg":{"text":"This is a spot you cannot miss.\nPerfect service. Perfect food. Perfect location on magazin","useful":1,"cool":0},"HRLj2i09YC_20R-O8rq0Kw":{"text":"One of our favorites.  Love the location and charm of the fabulous restaurant.  Food is am","useful":0,"cool":0},"8Unm9X6dFOsKIa8wnDflMA":{"text":"Disappointed in this restaurant. I ordered the \"Shellfish Stew\" which was a poor example  ","useful":0,"cool":0},"VRjnTSk_okQB4mzuUrOhvg":{"text":"Holy cow this place was amazing and probably one of the best restaurants I have eaten at i","useful":2,"cool":2},"zDZyC41hd8VOIkXnkRGjMg":{"text":"Very disappointed in this restaurant which was recommended to me by a friend...the atmosph","useful":0,"cool":0},"CvDiIf7rw7m5JRBAo8Cf2g":{"text":"(reviewer note - I visited La Petite Grocery in 2017)\n\nI had a fantastic meal at La Petite","useful":0,"cool":0},"cZMPe7gEzqBiFZaydWYAow":{"text":"My best friend and I chose LPG for an all-too-rare one-on-one girl's night out this past w","useful":1,"cool":1},"3qeq9iRDvwj-772JheNDeA":{"text":"BLUE CRAB BEIGNET. Provoked an involuntary noise. It's part of the Gulf Fish entree and it","useful":4,"cool":1},"XTf2mkRA8rOPrhnH2TZ9sQ":{"text":"I had a scallop appetizer that was incredible. I could eat a million of them (I know I'd g","useful":0,"cool":0},"9LlWVLpRI7yY8U2lLZgoDQ":{"text":"Over and above the best food I've had in New Orleans, and a contender for the best food I'","useful":0,"cool":0},"B5d_AW0FaEOtn98FsfYdYw":{"text":"First impressions:\n- Lovely interior...and I'm going to sound like a snob, but seriously, ","useful":2,"cool":1},"mws0iSLDKW7LY661IU4I2g":{"text":"Incredible dining experience.  The house made pasta and gulf shrimp was life changing.  Sh","useful":1,"cool":0},"E_Urt7pe1mZnlYdYMrN88Q":{"text":"Had dinner at this lovely place last night.  Everything we ate was perfect.  Really, one o","useful":0,"cool":0},"cAR8vutv7RiWUw-A5QHOKA":{"text":"I had to write this after our experience the other night at LPG.  It was a Monday night, a","useful":1,"cool":1},"Sd7xgIst7CjL2ZBZL0VlCw":{"text":"We walked in for Sunday morning brunch, and we were lucky they were able to seat us within","useful":1,"cool":0},"h3yoYmh1j6APeO0f8gmLLA":{"text":"The blue crab beignets were to die for. But, then there was the Turtle Bolognese...with th","useful":0,"cool":0},"4nUXcSVbLrOoM8tmeh7-KQ":{"text":"La petite was so yummy! Super unique food in New Orleans with French flair. Tried the pier","useful":0,"cool":0},"dTbSnzxX9uYS4baK5kFzdQ":{"text":"This place has a really classy interior with high ceilings and interesting architectural d","useful":0,"cool":1},"nSEK4YCpP3kXei8V7T1v3A":{"text":"This little gem is a true delight in every way. Food. Service. And \"dawg\" friendly in my f","useful":1,"cool":0},"AskJJPF-jfpWMC-E9JrJxA":{"text":"Classic upscale bistro ambiance.  For those on a low carb mission, be forewarned that temp","useful":0,"cool":0},"XbN-c6x5DDqQVzvChawmDg":{"text":"Absolutely flawless. This was a perfect meal from beginning to end. Went with a group of f","useful":0,"cool":0},"5ANch2w5kqGZh6mHdwL0yg":{"text":"Admittedly I went here due to my love/respect for Top Chef as maybe the only reality show ","useful":0,"cool":1},"rkNS0fR4VFuIyek1IbCqVQ":{"text":"Celebrated my birthday dinner here with my family. Such a beautiful and lovely New Orleans","useful":0,"cool":0},"7MmoxYU6yPbbpyJUEQ2VNA":{"text":"Holy smoke, this was one of the best meals I've ever had. My cousin and I walked down to L","useful":0,"cool":0},"_qxWu4vPvbyZwIBTpYKDKQ":{"text":"Went here for Sunday brunch.  Unfortunately, the experience was mostly subpar.  On the neg","useful":0,"cool":0},"oyA8e5-eY5xDqY5tMXhYBQ":{"text":"Walker Percy calls an experience which exceeds any expectation a \"rotation\".  Be prepared ","useful":0,"cool":0},"b4RHniKvDPbcwFke3T1w_w":{"text":"I had two evenings in NO for a business training.  I had never been down here before but s","useful":0,"cool":0},"rtozjdCcaTJFRG2KxyKMTQ":{"text":"All the food was really solid. We came to dinner after a huge happy hour so had been antic","useful":2,"cool":1},"_TlP9VNcnZPlUSDFc0ZhtA":{"text":"Wonderful restaurant with amazing vintage charm. Had a lunch reservation on a Friday for n","useful":0,"cool":0},"GYeLq29F0SwrSzCCDIPW0Q":{"text":"My main complaint tonight was the kitchen was SLOW despite a quiet night. We waited a good","useful":0,"cool":0},"Z2rC9PCorERFst7APFkaWg":{"text":"Freakin amazing ... MUST try the crab beignets .. everything was really delicious . We ord","useful":0,"cool":0},"jwlSdeM7fkfNGCadxFK7iQ":{"text":"Our food was very good, however our waitress Lindsay was very snobby and made us feel judg","useful":0,"cool":0},"8dPRrDC0KKcSORoPRpJVBA":{"text":"Great Coolinary menu! I recommend this place for a dinner date night the ambiance is dark ","useful":0,"cool":0},"4ipjJWOOzMn1iLTJ4EUK7w":{"text":"We have dined here a couple of times. It never disappoints. I had the steak both times and","useful":0,"cool":0},"8hxbKOKeX6Csm_IzwqbwCA":{"text":"Too bad I stayed in New Orleans only for a few days and tried this place on my last day.I ","useful":0,"cool":0},"ze47eZInOCxJBvpVDd_Pwg":{"text":"The food and the service was super delicious. I was super exited to try their food and I w","useful":0,"cool":1},"jp2xiS7gx-3xj3MvBw-a6A":{"text":"Perhaps we hit La Petite on an off night? \n\nMy husband and I had just made the long drive ","useful":1,"cool":0},"zfd_BkZ2D0G9z-yPjOTLlw":{"text":"After hearing good comments from a friend and reading about La Petite Grocery on Yelp, we ","useful":2,"cool":2},"_QZ1KIm4g4o1kc5SvUugOg":{"text":"Outstanding in every aspect. Bartenders/mixologist were amazing great atmosphere and the f","useful":0,"cool":0},"hunuTUp8tB-e_-jKZpFCjg":{"text":"Very meal here is scrumptious. No matter if you decide if local fresh fish, chicken, or ev","useful":0,"cool":0},"E8vv-856Lm-pGk7peyZ00Q":{"text":"This place is spectacular!!! Highly recommend the blue crab beignets and the lemon cream t","useful":1,"cool":0},"NvRjD0OZeYZdCZx9Tu8u5Q":{"text":"Their brunch was the best meal we had in New Orleans!! Every single dish was good-to-great","useful":0,"cool":0},"b4VlabgQs_HXlJvQW-Lfvg":{"text":"Fantastic, classy place.  Great service, delicious food:  very sophisticated New Orleans f","useful":0,"cool":0},"5POqAr8u3lvHKl1RyY9bpQ":{"text":"I loved the food and it was really filling.  Ate like a pig on those blue crab beignets an","useful":0,"cool":1},"38snhxQ7cKAZpaD6CNaGnw":{"text":"Martha. Martha. Martha!!! She is the best waitress ever. We had dinner here and she sugges","useful":0,"cool":0},"0VSUoGJeQgaDwLhMkYVqOw":{"text":"Ended up here on a whim this evening. So glad I did, everything was wonderful.\n\nI really a","useful":1,"cool":1},"d5CV6xn3MVOiCCy1V0mIWQ":{"text":"We ate a lot of delicious meals in New Orleans, but everyone agreed...this was our favorit","useful":1,"cool":0},"XBkfv7Q-ivhvh5h51o44Ew":{"text":"This is a very nice restaurant. I had the shrimp and grits. Very good.  This is an up scal","useful":1,"cool":1},"5T7v9KeUcJIumwzk3Ghj0Q":{"text":"Quaint, lovely place that is not the usual craziness of NOLA. We have eaten there on multi","useful":0,"cool":0},"honNNGRVvM7MSA79Rc9Egg":{"text":"I went for dinner to celebrate a friend's birthday and was immediately impressed by how cu","useful":0,"cool":0},"zROXjp1pul90sSU9fqjvyw":{"text":"I needed to entertain a group of 20 to a great New Orleans experience, and La Petite Groce","useful":0,"cool":0},"EKE9nv8SwOlefh5F05PvNg":{"text":"Very good service and a nice atmosphere.  They don't rush you.  Got a nice tour of Magazin","useful":1,"cool":1},"uv49XlIjjjB_X1uozHk3NQ":{"text":"Sat at the bar recently and ordered some cocktails, apps, and side dishes. Both cocktails ","useful":0,"cool":0},"kKZXLspPS0Tkss8PhNxWfw":{"text":"This is the real deal foodie fans ! Creative menu, expertly prepared with subtle yet defin","useful":2,"cool":0},"U7RLtxvmue-GyaZDBE5h4A":{"text":"A good, but not exceptional restaurant.  It has the appearance of an upscale place, but ne","useful":0,"cool":0},"vaqfmQrlACPYWfnezHKhRg":{"text":"I wanted to love everything about this place. The macaroni was amazing as were the vegetab","useful":0,"cool":0},"A6L5BqCDMXAalTGW7LKc0Q":{"text":"Good service.  Nice find via yelp..\n\nGF and I went here recently for dinner.  Very nice at","useful":0,"cool":0},"cEiRWs-pQQU-qF2x57ariw":{"text":"Actually, this is a 4 1/2. It was the best restaurant we visited during a short stay in NO","useful":0,"cool":0},"OXRPJBsfbCNZ1ekGg5OmaA":{"text":"We decided to celebrate my boyfriend's birthday at La Petite Grocery after reading rave re","useful":5,"cool":2},"Fyhm2Ah1f-HgDRs4l2J-Pg":{"text":"The food and service was so good! I LOVED both of our drinks- one was called in the Clouds","useful":0,"cool":0},"2PBbEP-Fgfw6oekMjDzXTg":{"text":"I am so disappointed at this place. Everyone said great things about this place. Hubby had","useful":0,"cool":0},"DTV0xKIJu3SFBEqwsnvEBw":{"text":"awesome service. really good steak and scallops! but the french fries could use some truff","useful":0,"cool":0},"HSTSUtA6NAkxJ_8gXAJdkA":{"text":"Although we thoroughly enjoyed our food, service was majorly lacking lastnight. The waitre","useful":0,"cool":0},"hojmAxN19jZMGGMHin1nlQ":{"text":"Been here a couple of times and every time we go we have to get the blue crab beignets. Th","useful":1,"cool":1},"szdIqEElwYi76QLvCwMATA":{"text":"The food is amazing. The staff is very accommodating and super friendly! Alex was our wait","useful":0,"cool":0},"oALoPj5iKo_QtrkSjYTZLw":{"text":"Holy shite. This place was phenomenal. The shrimp and grits were the best I've had in my l","useful":0,"cool":0},"uu2zTek32gpCzvAAj7oUrw":{"text":"Always first class experience. The service is second to none. If you're a bourbon drinker ","useful":0,"cool":0},"ErwGh7rue932CLHOQLQ8qg":{"text":"This restaurant is on Magazine Street in New Orleans. It is a little out way of the downto","useful":0,"cool":0},"w0F-CeEMXX44UnFDo3pmrg":{"text":"This was our first and last visit. For an expensive restaurant, the service was horrific. ","useful":2,"cool":0},"s6X5NN_hWpd6i7zy_eHSkQ":{"text":"Came here with a bunch of friends during our trip to NOLA, and had an awesome time.\n\nIt's ","useful":1,"cool":0},"2VqoWfCA6MBa4Ra5LHA7XA":{"text":"Troy Becker the server is most excellent. He left Commander's Palace for this joint.Emeril","useful":6,"cool":4},"jztFTDJxOwDTUJ7FLoM-Cg":{"text":"Great atmosphere with a gourmet menu that reads well. Service was fantastic. Highly recomm","useful":2,"cool":0},"3oQzG7JrEgCvU7_bTT2Qtw":{"text":"If I have only one regret in life, it would be that I didn't eat here more than once on my","useful":4,"cool":4},"LT-NwVgf66OstmWuyA_pVg":{"text":"Another first class evening: the roasted chicken with cornmeal dressing and pink-eye peas ","useful":0,"cool":0},"VroR8EFz528K631b9-ckyg":{"text":"We had a beautiful outside dinner.  The food was impeccable and the service and the servic","useful":0,"cool":0},"1PXfwVjN77-BMicXICrTpw":{"text":"Enjoyed all last night at Petite Grocery. All was excellent from the four of us. Went for ","useful":0,"cool":0},"CGhk2n6wYyBwzynxYzG36w":{"text":"Best meal I've ever had in NOLA. Everything was superb. I'd recommend everyone stop in and","useful":0,"cool":0},"bcf0_0fTgHjFQ_Ey7spBkA":{"text":"Went with a group for dinner - nothing was bad at all, but nothing was fabulous either.","useful":0,"cool":0},"TcUAQJ-5kMgCCWmfigO2kQ":{"text":"Good place for a dinner. Appetizers (we got blue crab beignets and Rocotta dumplings) were","useful":2,"cool":0},"ecvUIQH7i9qm75KeQwD4qA":{"text":"The good was great but outside is some construction. They seated us outside but the road w","useful":0,"cool":0},"tMQLtsgwpSX4fUmZ0fCRPA":{"text":"Wow whada restaurant. It tasted really good. Our waiter was a sweetheart and recommended t","useful":0,"cool":0},"XLX6OURkuRlZ8cfuCESg7A":{"text":"We've eaten there a few times.  It has a nice atmosphere, and the food is good.  We had go","useful":0,"cool":0},"ODaQlBAF8ryqMTG_98l74Q":{"text":"We came here on a recommendation from our dining neighbors at nearby restaurant Shaya. We ","useful":1,"cool":0},"_AmqNFlsmdUM_CqJYcsreQ":{"text":"Excellent food, From the moment we arrived we received exceptional service.  Ryan was the ","useful":0,"cool":0},"EK3MEQyKMxYCrM6oeZm9Wg":{"text":"Very fancy and very good!  You can't go wrong drinking a coupon of bottles of red wine on ","useful":0,"cool":0},"Ikdh8lr9b_P0mUHYzsYf0g":{"text":"The menu at LPG looks amazing. The burger is 5 stars and worth returning just for this. Un","useful":1,"cool":1},"8botOQoPARXm2SyGvsF7MA":{"text":"Go. The service was a little slow at first but after they started filling our waters up an","useful":0,"cool":0},"DcXkhFnM5myee0U8NEU4rQ":{"text":"The service is great, the environment is awesome, and I enjoyed almost all of my food. I a","useful":0,"cool":0},"7Q9Kb5BvDygBXQjls91NEw":{"text":"My husband and I had our anniversary dinner at LPG and had a lovely time.\n\nWe made a reser","useful":10,"cool":9},"8ngAtyJhFZX4rVctENnNjQ":{"text":"This is one of the best French restaurants I've been too! It's so good I wish I could shar","useful":7,"cool":6},"IWVUzSxD3hxRZECZ3EhrnA":{"text":"We had an amazing dinner here starting with the Ricotta Dumplings and then the Shrimp and ","useful":0,"cool":0},"dTU92lj7nyiLywQhZD5D6w":{"text":"It's true: sell the house, stash the kids with grandma, hit the road, and stop here. Locat","useful":1,"cool":1},"WlXzy2ECxUpwGh7BXLrMGg":{"text":"JUSTIN DEVILLIER: c'mon, just look at this man's photo!\nCRAB BEIGNETS are a \"must try\" app","useful":7,"cool":5},"OhAQeHDe7wXyhTMmk31xDg":{"text":"I saw La Petite Grocery on several internet lists when researching where to each in New Or","useful":1,"cool":1},"7af4gepjKXoQaAppr93vwg":{"text":"yes they were on top restaurants of 2017 and also the chef got james beards best chef sout","useful":2,"cool":1},"F_H4oFBz3i4FtX1VWPFe5g":{"text":"Very nice place, it's a little loud but we sat at the same side of the table so that wasn'","useful":0,"cool":0},"OWxHTXD0XeERVnlRiodhGQ":{"text":"My favorite neighborhood restaurant is still firing on all cylinders. Went last night to c","useful":5,"cool":5},"Zy1pPG3_WYcSEMGoFZEyEw":{"text":"Excellent restaurant. Great diverse food collection. Loved the beignet. It was one of the ","useful":0,"cool":0},"WHEVZNy7jYQh6JTxutpubA":{"text":"I was on a business/pleasure trip over a long weekend recently in Nola and we booked a res","useful":0,"cool":0},"8d3MgH_KDQRNbxu4SA6abQ":{"text":"Overrated, apathetic, and unapologetic.\n\nMaybe this place was good one point. I heard they","useful":0,"cool":0},"q0XjJ-rBwI_2XeI9eommtg":{"text":"Had been here twice.  We liked the food and service however I was so put off by the short ","useful":0,"cool":0},"oMjDwEfYrul8PpJIxwNP9A":{"text":"Limited menu, friendly waitstaff.  High prices, delicious food.  Worth a trip for foodies.","useful":1,"cool":0},"O61AiugGDiV5GV4O1QRo3A":{"text":"Very cute restaurant away from the touristy, wild French Quarter. The 15min ride alone was","useful":1,"cool":0},"z44VX5iD8UF3QclipixWwQ":{"text":"If you are one of those folks that likes good food over good service then you will be fine","useful":0,"cool":0},"yOKKKa-Rat3vN0xHORFhsQ":{"text":"The food was pretty good but the best part about this place was the service!\n\nWe came here","useful":3,"cool":1},"R3naYw9dDCEC2vtx5e2GDg":{"text":"If you are one of those folks that likes good food over good service then you will be fine","useful":0,"cool":0},"zM8bx2gNma4OTPhJUyagHg":{"text":"Delicious!! \nThe blue crab beignet is a MUST!\nThe rabbit spätzle was great.\nIf you're not ","useful":4,"cool":0},"rv_GGebZ1qNIhrV3vzITVw":{"text":"Adorable restaurant on an amazing street! We had the sweetest server who took wonderful ca","useful":0,"cool":0},"ke3O9ORvuwKmPnmnszvOOg":{"text":"Was my meal good...yes, was my meal great, no it wasn't. \n\nI sat at the bar and the servic","useful":0,"cool":0},"q0e2wCYUR0nb0I8-HVf9ug":{"text":"What a great place.  LPG was our first stop after getting to town and we didn't make it un","useful":0,"cool":0},"baK2JJ5PvlpigDeP362QUw":{"text":"I've been here a few times and both times were really good. Most recently we came on a bus","useful":2,"cool":0},"rUJwqwcium1oyVM77uD8xw":{"text":"So dang good. This was my second time here after years, and while my first experience was ","useful":0,"cool":0},"8P4mfOtyQ99AxHzTT6a0cA":{"text":"Had heard good things about this place, so I had high expectations going in, even so I was","useful":0,"cool":0},"0wx1rzXUkgZDb6WNV4prKg":{"text":"NOTE THIS REVIEW IS BASED ON SERVICE, NOT FOOD. We visited La Petite Grocery a few years a","useful":0,"cool":0},"4sLmxiYoSNo6XIUUrTHiIQ":{"text":"Food was good, but I'm not sure it was worth the price. If I came back I would just order ","useful":0,"cool":0},"LbEGcL5yM28oM91Wwuwxdg":{"text":"Crab beignets for the win! These delicious crabby and fluffy tummies were the best thing w","useful":1,"cool":0},"ZeS3K5bHk8gOYMQ4VM0Vjw":{"text":"Visited La Petite Grocery on Thursday night. It has your classic bistro vibes. We started ","useful":3,"cool":2},"gkLoMQPQG8zgbiYT5DDZhA":{"text":"Kicking myself for coming to NOLA so many times and only now making my way here. Amazing r","useful":1,"cool":1},"u0Hpg4CAnJgxFORMFoB0TQ":{"text":"Simple decor with clean restrooms. However,I was very disappointed with my food. My hambur","useful":0,"cool":0},"D379QcEEX4Jfs7hxUvPJKA":{"text":"Celebrated my birthday dinner here with my family. Such a beautiful and lovely New Orleans","useful":0,"cool":0},"60wx-iB6ryWyni19ak0Xaw":{"text":"La Petite Grocery is a forward-thinking contemporary French restaurant in the Milan neighb","useful":4,"cool":1},"86G_PV8tsS-P3Sbkw3dapw":{"text":"La Petite Grocery is as good as all of the stellar Yelpers who came before me make it out ","useful":12,"cool":10},"O36hNeF21iwg4gIGPpBuVg":{"text":"This is supposed to be an American French spot but I come here for the American side of th","useful":3,"cool":2},"1yuwjIzkVushd5xjcbooGQ":{"text":"I warned our waitress I was about sound like a Yelp list before we ordered.  The crawfish ","useful":0,"cool":0},"lcwF0k1BKxw_8nSCPDPeFA":{"text":"Cute neighborhood spot with some creative takes on dishes. We found the appetizers were ki","useful":2,"cool":0},"AYKSrSh0ocfckURkv_CXlg":{"text":"Omg! The food was superb, the staff was amazing, and it was easy to get in and out for lun","useful":3,"cool":2},"h1gMFyFYzBr5XEozhvJexg":{"text":"Overall, I would say that I'm pretty disappointed in La Petite Grocery. I would say that t","useful":2,"cool":0},"DFcd6h-OJfFm4PmAQ9yUKg":{"text":"My experience here last night just about blew me away. I am still in a La Petite Afterglow","useful":15,"cool":12},"a7y00GMTYZiBtI9r6DKfkw":{"text":"I got 3 words... blue crab beignets. These things were delicious! Perfectly fried, buttery","useful":1,"cool":1},"hkcvLI4VSAVDhJVJqvj9JA":{"text":"Wow, just wow. We don't often hand out 5 stars, but this one knocked it out of the park. G","useful":0,"cool":0},"G726b9tdkgAvwhJ4HfO89Q":{"text":"We stopped by briefly to split their burger. I really liked it here. There's a higher end ","useful":4,"cool":2},"CrmxCedaOxMk1yIN2MoumQ":{"text":"LPG had an excellent warmly lit atmosphere. The ingredients that makeup the menu call to m","useful":0,"cool":0},"P7LfaNGd9h3VMtl5_xGGAw":{"text":"This place has been on my list for years, and it finally worked out that we could visit ri","useful":0,"cool":0},"pgtIU0pvTLSC7SXsHE5Suw":{"text":"Visited while on a bachelorette weekend! The drinks were delicious and service was amazing","useful":0,"cool":0},"qjYD93tt-xQlkBp_4bjaqQ":{"text":"My wife and I had lunch there the other day. Cute place on Magazine Street with excellent ","useful":0,"cool":0},"-f9HnniGN25mWl7ajagyng":{"text":"My friends and I were in town and wanted to have a nice dinner somewhere, and after readin","useful":1,"cool":0},"3fut6ez-D30lPAEZvuCqqQ":{"text":"Great atmosphere, bartender was amazing, the crab beignets were \"okay\" would not order aga","useful":0,"cool":0},"o3lOqBYKUIPzJqtSnx4uWQ":{"text":"Items Selected:\nEpi Baguette with Butter\nBlue Crab Beignets with Malt Vinegar Aioli\nTurtle","useful":7,"cool":5},"jq8MOBDELMdbwEcen0RU7g":{"text":"Wonderful food. Great service. Excellent bartender. Blue crab Beignets ($19) appetizer was","useful":0,"cool":0},"01ZSEAKGaqIl2VdJ_sJ2-A":{"text":"Amazing food with great service. Would go  back just for the blue crab beignets - to die f","useful":0,"cool":0},"fXt2kEeCs6cSQ2iyLBMHYg":{"text":"Full marks for ambiance, wonderful team/service, and food! Lovely welcoming spot glowing w","useful":0,"cool":0},"irdIcFZleMG0Scqu2Q1N5Q":{"text":"These came out nice and hot, I got there as soon as they opened. It was a different take o","useful":1,"cool":0},"IbVwJ-UubCH7yqP9dyIHTA":{"text":"Went for brunch. Crab beignets apps were fantastic and service was good but entree pretty ","useful":0,"cool":0},"k06AY9yRQueEYSWRIUejrQ":{"text":"Happy Birthday to my sister!  She turned 50 and wanted to go to NOLA to celebrate.  She a ","useful":3,"cool":2},"pZ1c6gifp7c1K91QkshbWw":{"text":"I don't think I can fully express how much I love this place. It's quiet, intimate and a m","useful":0,"cool":0},"aXndTOzn8zJoWR9oUBLvqA":{"text":"Just stopped in here for a drink after having dinner at Saffron Nola. Probably should have","useful":2,"cool":1},"NXBb3JN0tH606MYLPLdyyA":{"text":"Had an incredible lunch here , super nice staff and vibe inside. The duck confit was unrea","useful":0,"cool":0},"Be-0rXlbKBWbUoo6KCXM3Q":{"text":"RUN, don't walk, to this absolutely incredible restaurant. It's my favorite restaurant in ","useful":5,"cool":1},"qYle1qU6SnoN0cQ5JpuLCA":{"text":"**SHOULD BE RENAMED LA BLAND GROCERY**\n\n2.5 stars.\n\nMy friend and I were super excited abo","useful":15,"cool":11},"2D0O21vxzeAzvDwmmdkvPg":{"text":"This place is the hidden gem of New Orleans. Plenty of chefs are putting their own touches","useful":0,"cool":0},"k-dUASo3NEF_YwyMn0TJGw":{"text":"Excellent, delicious food! Since we discovered La Petite Grocery we go everytime we are in","useful":1,"cool":0},"RmKsHDvjZsEL4vn-NmuKSg":{"text":"We had a fantastic birthday lunch here last weekend.  Our server, Jeff was very attentive.","useful":0,"cool":1},"EK1L9_3CokB7iBiV96ntyQ":{"text":"Ok so the Brussels sprouts need to be glazed with more sugar and also need bacon bits the ","useful":0,"cool":0},"lyeVXhJmTCQy3pGMqlecPA":{"text":"This one has been on our list for a good while, and now that things are pretty much back o","useful":0,"cool":0},"MYpzlvJIfOfJkd89ejnBsQ":{"text":"I was a little nervous about coming here. I've been hearing about it for years.. I was sca","useful":0,"cool":0},"38_n8E8srOygYiioqCjfRw":{"text":"This is now a well established member of the group of the best restaurants in New Orleans.","useful":0,"cool":0},"CDdejbcFn6No3IuGgTzJQw":{"text":"I had a pretty good dinner here with family. The one downfall waS that our waitress seeeme","useful":2,"cool":0},"vNEA6g9von_4TgsslQCSFg":{"text":"Great service and delicious food! The blue crab beignets are a must-try, and I definitely ","useful":1,"cool":1},"C-i44nWo_9ELXZNqojgvjQ":{"text":"This wonderful Magazine Street restaurant is also getting the job done with safety. Masks ","useful":1,"cool":1},"epNZB7ltN7X-wxBhUOVTxA":{"text":"We had a wonderful experience with La Petite Grocery this week! Excellent service & amazin","useful":0,"cool":0},"zwa0pUq9rAkAl-LdHccxzg":{"text":"Best shrimp and grits in NOLA. The Turtle Bolognese was excellent too! The atmosphere is p","useful":0,"cool":0},"uzN3CvbEU5T4DWGmkUW1tg":{"text":"You will never have a bad meal at this place. Always get the blue crab beignets to start y","useful":0,"cool":0},"wuxjPY7Vca-Iwprl-88SUg":{"text":"I wanted to safely celebrate my birthday with brunch, so I made outdoor reservations in ad","useful":1,"cool":0},"U9JaXevQrit7WvSlgwCMXw":{"text":"I have tried to eat here 3 times now. Tonight was the worst. 35 minutes and we didn't even","useful":0,"cool":0},"3Ey3akvdkT_Jxdu56GFWyw":{"text":"Y'all. There are so many better options for French food uptown New Orleans--IMO. \n\nMaybe I","useful":0,"cool":0},"67VbO_h7vbuAY2SUI3PlGw":{"text":"Was recently in NOLA for Jazz fest and made some new local friends in the process.  One of","useful":1,"cool":0},"l00O4GAadiR88CXlnDzhqA":{"text":"I did not set out to eat here, or to find this locale, but it was the right time of night ","useful":0,"cool":0},"TSUGLqzFzmkvz3HF6oKuqA":{"text":"If you are like me, you don't love the touristy Bourbon Street environment so you find a c","useful":1,"cool":0},"NDfWbAzx0xC3ijH8BQR8LQ":{"text":"Excellent food, horrible service. We tried all appetizers on the menu and all  were  prese","useful":0,"cool":0},"81ExHhD3RKQ81wfCWzl5MA":{"text":"Delicious lunch!! We had a wonderful waitress named Dorian. She was very helpful and frien","useful":0,"cool":0},"MO9Rli8schrFhdErd5U-zA":{"text":"Good but not AMAZING. Food was appreciative but there is definitely more decadent flavors ","useful":0,"cool":0},"dmc298ASnESi8p8tfcjGTA":{"text":"We came on a Tuesday night during Covid to celebrate a birthday. \n1. They take Covid very ","useful":2,"cool":1},"4RpIb-Kp0H3PAkh3UloATg":{"text":"This review is based off of service alone. I called to make a reservation and got a 9:30 s","useful":0,"cool":0},"dOkymAwpDhvMeuSDGee76A":{"text":"Absolutely phenomenal!!!  I will never forget this place as long as I live!!  The ambiance","useful":0,"cool":0},"PAdRb_8-U5wi-xhsuuhlVw":{"text":"So happy we chose to have dinner New Year's Eve at LPG.  The atmosphere and food and servi","useful":0,"cool":0},"QdUfiwEqmlLQCa73jNT9Cw":{"text":"Fantastic food and service as always. I have been here several times and I've always had e","useful":0,"cool":0},"AZsBgybO4lf2gVxSm2tH2w":{"text":"We had our wedding reception dinner here (for a small ceremony w/ 10 guests) and it was pe","useful":0,"cool":0},"BCW9LBBzeitTpbjqbsOOxg":{"text":"Cute restaurant, classy vibes, good food! \nWe visited as a group of 8 on a Friday night wi","useful":3,"cool":1},"ZSX3YiSiRfAW5nCL-qg6VA":{"text":"Our new favorite spot for high end dining experience. Also outdoor tables to accommodate b","useful":0,"cool":0},"-Svq4VMP4WBAbCM6HZB0Vw":{"text":"Straight up delicious. I've wanted to come here for a while after driving by countless tim","useful":5,"cool":3},"HaJWVMvFy8g2a3sT7DRxSA":{"text":"All time, top 5 restaurants of all time! \nFood was absolutely phenomenal! From the moment ","useful":4,"cool":0},"PWxFfzCuycNfxJgtNhPj8w":{"text":"Treated my fiancé here on a Tuesday for his birthday. It was really wonderful. We loved ev","useful":0,"cool":0},"1PBQTcNpmVO_mTvuaymGVg":{"text":"We made a last minute reservation, but they had a table available for us, it was the middl","useful":3,"cool":0},"icQ8jssZVEILu6nwRJGMpA":{"text":"I finally got the chance to visit this place on my birthday. The location is nice, but the","useful":4,"cool":1},"14EoDTxTdmgypmxa4zXXQg":{"text":"KenScale: 7.5/10\n\nI should have known when my wife Jun flinched at the sound of turtle. At","useful":3,"cool":2},"nnmnsCYUV3fN0dvTMntGjw":{"text":"Where to begin? From the blue crab beignet starter through cocktails, entrees and a fantas","useful":1,"cool":2},"b4wgOuV-O9PDH55GBvGGkA":{"text":"My final and also one of my favorite meals in New Orleans.  I wanted to get a dish with tu","useful":4,"cool":2},"qolftJsMy9cYv9o52kdyUw":{"text":"Walked right in Sunday at around 11:30 without a reservation and had a wonderful meal cons","useful":3,"cool":0},"rf0d7BCiyf1IVkvi4iLi6w":{"text":"Sean was our amazing entertaining server. This place is awesome. Elegant without being stu","useful":1,"cool":0},"_zPnd-Na5_EtQftCOP0E9w":{"text":"We enjoyed our vacation date night away from the kids at La Petite Grocery.  Atmosphere wa","useful":0,"cool":0},"x5PBlE5ObacILj6KPxSYvg":{"text":"If it's one thing that I truly do enjoy, it's a good Sunday brunch.  I don't get around to","useful":1,"cool":1},"DP5f-lWV1l9Gs23hpHA_iA":{"text":"James Beard Awards.  Top Chef.  Gourmet Magazine.  \n\nYou may have heard of La Petite Groce","useful":1,"cool":1},"8DuTVYANXj14fbVvGAOd9Q":{"text":"Cute place with good food but nothing remarkable. For a fancy and pricy restaurant, nothin","useful":1,"cool":1},"IMEpFMDkHw8fEs8uoth2IA":{"text":"I considered doing some kind of parody or homage to the French poetry of Baudelaire in thi","useful":18,"cool":10},"CKqi_c0m9aeFO1pMXPkO7A":{"text":"I came in for my bday lunch last weekend. I was so disappointed. After hearing such amazin","useful":5,"cool":0},"GY-N-8FPtkFK6M6VsUfscA":{"text":"While Yelp probably demands that I write a long-winded review telling in great detail how ","useful":1,"cool":0},"MrH3FbAZLSnNgaHyHZ2gPQ":{"text":"In a city known for its extraordinary food scene, this restaurant stands out. Everything I","useful":12,"cool":6},"x4ZENhqO3ZLQI7Zm1djC-w":{"text":"A charming happy hour from 5:30-6:30 pm. Can't beat the $1 greyhounds and other drink spec","useful":1,"cool":0},"Ubc3sv9QedUzPFjAdn9tzw":{"text":"La Petite Grocery is where I officially fell in love with shrimp 'n' grits, a southern del","useful":12,"cool":11}}