{"WdL-9rff9JTzPBP34QjqBg":{"text":"My husband and I just had dinner at Vincent's tonight, and we both had a great experience ","useful":1,"cool":0},"BSV2A7Z0adG__E0q3XhevQ":{"text":"Absolutely delicious Italian place. I'm a pretty picky person to please but I'm glad I tri","useful":0,"cool":0},"uTQ3YACDyHZoaKXY6pq91Q":{"text":"We made a reservation for 6 here after my fiancé's hooding ceremony for his master's in fi","useful":0,"cool":0},"q6seEO-Uy_ChUJT5U3kI3Q":{"text":"Old school Italian joint.  Excellent service. Great wine list.  Thankfully we did not get ","useful":0,"cool":0},"mhTFBlf8FgQAZncu-01rVg":{"text":"At the risk of screwing myself out of ever being able to get a reservation here, this is p","useful":0,"cool":0},"LPpJdWZYHAMVXVFg6S56hQ":{"text":"Went at lunch time.\n\nHigh priced for lunch. Extremely slow service. Try someplace else for","useful":0,"cool":0},"1ffwl_fCMuIsScbQxT4-tg":{"text":"Omg!  This place is adorable and charming and service is great.  Chloe our server was no n","useful":0,"cool":0},"8OkJZMaF3VD5amt9MZQTDg":{"text":"Took awhile to get a seat, but we did not put in a reservation and had an odd sized party.","useful":0,"cool":0},"WJMPgk9e33EqewJ0HiLFKg":{"text":"Wasn't blown away, especially having read these glowing reviews of Vincent's.  Food was av","useful":2,"cool":0},"8SgAueY_8SKmxqaNOa7cCw":{"text":"DO NOT GO HERE ON A HOLIDAY.  The food was precooked and dried out.  You will get a good m","useful":0,"cool":0},"V2Idi2QClrlQC66wuja3rg":{"text":"As my wife commented during the meal, this is a nice neighborhood restaurant, and indeed V","useful":1,"cool":0},"GyhYW6k9ZWaERWWeNhOXDw":{"text":"One of my best meals EVER in New Orleans was the Seafood Medallions I had at Vincent's Ita","useful":0,"cool":0},"wAgghgmS9wgeFdun8u5a0Q":{"text":"I don't know how I went my whole life living in New Orleans without eating at Vincent's! T","useful":0,"cool":0},"aI6TNRjCPtrXcUoXw1sYgQ":{"text":"Fantastic little restaurant off of St. Charles.\nWasn't a fan of their calamari, but the ho","useful":0,"cool":0},"O33axQs_wFlKVjaw9B0Iyw":{"text":"Best Italian food in Louisiana. Tony runs a tight shop and it shows in the professionalism","useful":0,"cool":0},"3bwFcxfK3aT73_lzJomYlw":{"text":"I took my wife here for her 30th birthday and she love it brought tears to her eyes I love","useful":0,"cool":0},"uX_ZeA1ECiFpIn_FvydRwQ":{"text":"This place is a hidden gem in the garden district of New Orleans. The staff is very friend","useful":1,"cool":0},"a7bGS8VTayqp9tyrO5VT6w":{"text":"Omg!!! This was the perfect place to end a perfect weekend trip to NOLA. We arrived on Sun","useful":0,"cool":1},"S70uLnMqQuYBlfP3vESH-Q":{"text":"Love love love... one of my all time fav places to eat. The atmosphere alone is amazing, t","useful":0,"cool":0},"FwuQIphYSuGZZa60uyaDAw":{"text":"What a great choice this was. Such great service. It's about 2 blocks from the end of the ","useful":1,"cool":0},"YTOfLBsyQ91ebVIN3Axm0A":{"text":"Intimate, comforting, delectable - just a few words to describe my experiences here. Some ","useful":0,"cool":0},"kBQNBSP3Us8YutNYhAKAiQ":{"text":"The dinner was great and the staff was really friendly. Definitely recommend the pastas an","useful":0,"cool":0},"qVFH8NXXJADenXYwpFHmMw":{"text":"A chilly November night in NOLA and I was craving comfort food. As someone who was raised ","useful":5,"cool":2},"4Bsc6zIrvoBNRBUS15dpEQ":{"text":"Was very disappointed with our meals. My Veal Roberto was very overcooked and my husbands ","useful":0,"cool":0},"WPyKcEoO1xfiyGCXK0sGPQ":{"text":"Let's just say make sure you order something you will definitely like or know is good othe","useful":0,"cool":0},"fblKiNcEbE5FoHlS_0BVRw":{"text":"The most amazing Italian food I have ever had ! Fabulous drinks , and fantastic servers . ","useful":0,"cool":0},"_qNiWC5s3fFgjqBXNqYahg":{"text":"Love Vincent's and have been there many times, although I'm from San Antonio, TX.  Not onl","useful":0,"cool":0},"LRkdUDtAi5EtrxTbfucXlA":{"text":"The heart of Sicily and the shrimp and crab parma was great! Bread was not impressive at a","useful":0,"cool":0},"fNKvZDEoJDXr8kxsohEQng":{"text":"The atmosphere of this restaurant makes it the perfect romantic date. Its located in the c","useful":1,"cool":0},"TmbFb_P-XXnpQeEnEH8tCg":{"text":"The first time I went to VIncent's it was out-of-the-world amazing. I loved the shrimp pas","useful":0,"cool":0},"G1fOXPD4-m4sgjiVaSLIwg":{"text":"This is a great gem! Off the beaten path in New Orleans, about a $13 cab ride from French ","useful":0,"cool":0},"b09HXHotCopALgJK_kCiQg":{"text":"We rolled in for lunch and was greeted with smiles and a nice table. We had been on the tr","useful":0,"cool":0},"x5Oy8i5TTA6YEJ-u0nBy2A":{"text":"If I could give this restaurant less than one star, I would. As someone who works at a res","useful":0,"cool":0},"JmlrH4DQkPCpAJMtbCpYFg":{"text":"Wonderful food! I had the cannelloni and it was absolutely magnificent!  The combined whit","useful":0,"cool":0},"ee2uoc7ARt_TL02wApKAYA":{"text":"I think best in the city. Others may do some individual things better but overall I think ","useful":0,"cool":0},"vofDQqH4USfCN4xvCqq1wQ":{"text":"Love this place. Great service, amazing food. This is a real gem. When my friends visit fr","useful":2,"cool":0},"6VbDCwDR62rzQ16lbz_Vug":{"text":"What this place lacks in overall room it more than makes up for in ambience, service, and ","useful":1,"cool":0},"36xbXB9Gn_Q9BpUlsMYn0w":{"text":"I had the chicken parmesan to go. The taste was awesome but the to go portions are so much","useful":0,"cool":0},"PBAjukdb7etUep_aNNYs9g":{"text":"A local Italian joint. Friendly staff and outstanding food! My husband and I were both dis","useful":0,"cool":0},"Sgnikfia2pvJEkbaAPluNw":{"text":"The food was overall up to standard, especially since an average entrée is around $25-$35.","useful":0,"cool":0},"mOERhwnE53Ak6J0rZfzemg":{"text":"Vincent's has been a favorite since we \"accidently\" found it 20 years ago, under previous ","useful":1,"cool":0},"-5VWttphmnUnbbe9GLrltw":{"text":"The food is full flavored and filling, heavy Italian dishes. The service if generally good","useful":0,"cool":0},"wCMcbDHsgUZuNhOqW0uleg":{"text":"Let me start by saying, as a 2nd generation Sicilian - American I am very critical of Ital","useful":1,"cool":0},"erfpLEaAOCJN6VJms_evNQ":{"text":"Being Italian I rarely eat out in Italian restaurants. However, we thought we would give V","useful":0,"cool":0},"LMjDByQsjx0Z_jUCeW85wQ":{"text":"This place looks like a dive, but it's awesome.  If you don't like waiting, go for a late ","useful":0,"cool":0},"-oCSQ843aF_QnVWzNDiOeg":{"text":"A classy Italian joint. This is the kind of place that you can just as easily go on a date","useful":14,"cool":6},"B2LDFsqcHhthfOa3mEKigg":{"text":"Cozy, enjoyed our evening very much. The veal dishes my husband had we're excellently prep","useful":0,"cool":0},"ep-qdr23-LTmxZqNO3tAmw":{"text":"The food is good, but the service was horrible.  David is the one of the RUDEST servers I ","useful":1,"cool":0},"bQ2po_x-gbiCE1LDZOPD6Q":{"text":"Good service even when busy. old fashioned building, creates a nice ambiance. Food is amaz","useful":0,"cool":0},"MZTNytYQuSCaBAEMszUzpQ":{"text":"OMG!!! Best Italian food I've eaten in a long time. Service was friendly and food was amaz","useful":1,"cool":0},"Wgg2VsmoHdfIoUSgcGuB8Q":{"text":"The restaurant is tiny and a bit cramped, but the food....oh the food is melt-in-your mout","useful":0,"cool":0},"AM20-GBz4_hZmRc0pl3lJw":{"text":"How do I describe Vincent's.. \"An Italian version of Jacques-Imo's food with a fancy flare","useful":2,"cool":1},"rw4T7kkR-0G3PN2rJS1Hkg":{"text":"I've been coming to Vincent's since 2003, it is one of my top 5 restaurants in this city a","useful":0,"cool":0},"7i8O-v3yFgYTh4DaCKOQgA":{"text":"Really Great Italian food. I was hoping for a better pasta selection and being not a big s","useful":2,"cool":0},"IydrsKiSE-IxPq_b3osXUg":{"text":"The only place to go for authentic and consistent Italian in the city! Ambience is perfect","useful":1,"cool":0},"3PYP87MRlXi8TbKeglkOmA":{"text":"The customer service here is superb!!!! The best hands down. Greeted right away even with ","useful":0,"cool":0},"JhUhjwA6oI-ycrvLt_7cQg":{"text":"Absolutely delicious!  I had the seafood medallions which is paneed eggplant medallions la","useful":0,"cool":0},"qDYLuoZqDjb8MrUSehcqxA":{"text":"The food tastes great! We tried pork, roasted duck breat, chop lamb， everything is great!","useful":0,"cool":0},"1J5GP-7Ts2Zt9Wsz_POG5A":{"text":"This restaurant makes the list of one of the most memorable meals I've ever had. When I'm ","useful":1,"cool":0},"h_3h8ZKJCRmBqXjG8Ooq3w":{"text":"Wife and I had one of our first dates here. Twenty years later it still excels. Bread bowl","useful":0,"cool":0},"9ea2IvuCLiZrjHKw9xC9IA":{"text":"Amazing. Get the shrimp tagliatelle in herby marinara and the bisque in the bread bowl. YU","useful":0,"cool":0},"MsHROkDgbndZOHKTpjscCg":{"text":"New York style dining in the Big Easy!\n Vincent's is a must if your looking for a great It","useful":0,"cool":0},"_PXDFX35gr1RZg5VvcQfoA":{"text":"Went to Vincent's on a Saturday with no reservation and was able to get a table right away","useful":0,"cool":0},"sl_5q8lP5efIWLO_ngU-kw":{"text":"A classy italian restaurant with rich food. great palce to take a date for a romantic dinn","useful":1,"cool":1},"cc0eFC8stM67Aa6dAH7C3w":{"text":"We made a reservation to dress up and eat at Vincent's Restaurant.  We were disappointed w","useful":1,"cool":0},"ZC8IixFNAD8nVw3LypsriQ":{"text":"We really like the Vincent's on St. Charles (the one in Metairie is not as good, in our op","useful":1,"cool":0},"wj9LGODNFYRh-fKMH6BZfQ":{"text":"Good food, better wine list, great service. \nStreet parking around the block is plentiful.","useful":0,"cool":0},"C-BojBeWzqRSOQ9Oxc8jLg":{"text":"While the food was all good, the wait staff was a mess. \n\nMy fiance' and I got to the rest","useful":0,"cool":0},"80lC5agjQW1Gw_tjCVvWFQ":{"text":"OVERPRICED. REHEATED LEFTOVERS. They take reservations, but they just ignore your reservat","useful":0,"cool":0},"uK9DCsxTKHEVIhRp27icIw":{"text":"The most amazing Italian restaurant I've been to. Although it is quite tiny on the inside,","useful":1,"cool":0},"DSyt7rVtjndhIM0ZZA3hAg":{"text":"So many things I love about vincent's. I have truly never been disappointed. I love their ","useful":0,"cool":0},"fnnby3UiLFdK5sVG4R1n7w":{"text":"As authentic of an Italian meal as I've had since Mario's in Nashville 30 years ago! Quain","useful":0,"cool":0},"dDWQTL89enqkjvxKUaIXZw":{"text":"Fabulous Italian American cuisine. Sinatra and tony Bennett music over head. Mr. Robert ou","useful":0,"cool":0},"EDjDxUwCp0ooiwh7F1qQbw":{"text":"REAL Italian, REAL people, and FRESH ingredients!  We've been going to Vincent's since we ","useful":0,"cool":0},"M3IgdvV_MdcXoJNJ7oqzeA":{"text":"I had heard about Vincent's for a while, and finally had the opportunity to try it out!\n\nT","useful":3,"cool":1},"reg5xa7FUYQviPMWBhXYOQ":{"text":"Mmmmm good! Another delicious meal at Vincent's. I love how they greet you and make you fe","useful":0,"cool":0},"jcc1w4uv36peDOisL2LCDg":{"text":"While we didn't actually fo here to eat, this was one of several Italian places I searched","useful":0,"cool":0},"TkarLHwh_qvbnY1qwGhqww":{"text":"My boyfriend and I went here for our Christmas dinner and absolutely loved Vincent's. Both","useful":0,"cool":0},"H7c-k7PtF-WDNA0SUCXWdA":{"text":"I just looovveee restaurants like this ! Very old school Italian /cramped / lots of ambian","useful":1,"cool":0},"A211LGGu-XbmIyVtpXY22A":{"text":"Great food. Great service. Atmosphere is awesome. Favorite place in the city for Italian.","useful":0,"cool":0},"F3G2iJu5QgFNY45ia5pXGA":{"text":"One of the best Italian restaurants in the city.  Everything there is excellent.  Make a r","useful":1,"cool":0},"B3w80i-3QplDyYjdVgrDhg":{"text":"We don't understand the fuss. Neither of us found it   Exceptional. We may be spoiled thou","useful":0,"cool":0},"OU1o0ehzcaIQn74SnzmAiQ":{"text":"Went there on 5-8-12 with a party of three. This was not a tourist trap ny any stretch of ","useful":0,"cool":0},"vrgYXPLOJaY7Qocw2MMNSQ":{"text":"The pasta is delicious! We enjoyed everything, but the shrimp tagliatelle was the best pas","useful":0,"cool":0},"UBoICH9_rrRb9dJtWcexNA":{"text":"The food was decent, but the experience was a disaster. In my opinion, you expect a little","useful":0,"cool":0},"TjzDseA9_A6Avx8LK0-9WA":{"text":"Chose this place at the last minute on a Sunday night hoping for a nice quiet meal.  We we","useful":0,"cool":0},"R7WhzzKUBW95BxTltV7UfA":{"text":"Wonderful dining experience. You can't go wrong with Vincent's. Corn and crab bisque is a ","useful":0,"cool":0},"j9Iw_vKllzZyz9ZPx03lRA":{"text":"Food is amazing! If your craving affordable delicious Italian in NOLA this place is you!","useful":0,"cool":0},"SPStYe2wXwuRavWylpwuKA":{"text":"loved this place.  cant wait to go again.  parmesan crusted fish was so fresh and tasty.  ","useful":0,"cool":0},"hjhXoMdv6vaBRL6OToCsDA":{"text":"The best Italian food in New Orleans. The Veal Marsala and the Osso Bucco are out of this ","useful":1,"cool":0},"SHuoMnDMJpQ2iUStPqaa1g":{"text":"After being on my bucket list for years and years and years, we finally were able to have ","useful":8,"cool":5},"khMEQdEdoCxRK_Ag-TbjJg":{"text":"The Vincent's greet and treat you to some of the finest Italian cuisine I have ever had. T","useful":0,"cool":0},"WZkOgeqGEPHA7RBaaN6iOA":{"text":"On a busy Saturday night the staff was able to get us a table and made us feel very welcom","useful":0,"cool":0},"v1fEuxOGAKcYT1OZDBmSsw":{"text":"The ONLY reason I did not give 5 stars is space. I'm a tall person and it is difficult to ","useful":0,"cool":0},"YKsviWv5y-i1QzbsVO6VNA":{"text":"Absolutely delicious. Went here for a company dinner visiting from California and it was s","useful":1,"cool":0},"COIBkt2UHJnGT1aBF7z8RA":{"text":"When you make a detour from Jackson MS  on our way to Mobile AL just to eat here- you know","useful":0,"cool":0},"5LIf4QCW6pqsRIZq-fqg2Q":{"text":"Oh my this place is fabulous!! Lasaña and crab bisque was incredible. Only flaw, seating i","useful":0,"cool":0},"sT2C5S630AEtmaB8VZYIrg":{"text":"I googled recommended restaurants and Vincent's came up. When going, the trolley driver to","useful":0,"cool":0},"0yhDFBj0hJcyIwq5sSnGJA":{"text":"So... I just have to say that the service was wonderful.  Elizabeth and Darlene really too","useful":7,"cool":2},"kahiFS7ylYUiJhv3_zYz1Q":{"text":"Server was good App was good but needed some salt.. Salad was too oily .. But my Entree.. ","useful":0,"cool":0},"Eve9SGzwzoFt2Efo4DXlnQ":{"text":"I read the great reviews about Vincent's on Yelp and decided to try it out.  I wasn't disa","useful":0,"cool":0},"H2jXUYMvgM0Kz1_jzhxt2g":{"text":"The food here is always awesome. Our waiter was great too.  The one thing that really ruin","useful":0,"cool":0},"6z3nCoJinBaOiXx3hpHhHw":{"text":"Can't get enough of this place. We had a big group of 10 last night and they took great ca","useful":1,"cool":1},"6za_PKrKE-X0r8xz7u6aHw":{"text":"Vincent's always seems to serve very good food.  The service is also very good especially ","useful":0,"cool":0},"1oquuaQvcIud93W4EpAQBw":{"text":"We were in New Orleans over the weekend and had dinner at Vincent's on Saturday evening. T","useful":0,"cool":0},"RBs3T61Xz1wc02wJoc3MDw":{"text":"Amazing dining experience. Best Italian cuisine I've had in the area. From the appetizers ","useful":1,"cool":0},"WNeUPZlOHtMWEN8J3qzITA":{"text":"I've heard a lot about this place. Vincent's has always been considered a New Orleans inst","useful":4,"cool":3},"NTYPfSS5omDy3XQwEuhZDw":{"text":"I love the service and the atmosphere at Vincent's. My fave is the double stuffed pork cho","useful":1,"cool":2},"y7Ql8Djh5Mhz-jzk4XDdIw":{"text":"This is a great little Italian place and I've eaten here for many years.  I especially enj","useful":6,"cool":3},"huWp4rio4iBVYuAAOGhiuA":{"text":"Was my first time, and I love the atmosphere is so cozy; what can I said the meal was deli","useful":1,"cool":1},"JBJBofCMRH0ZS2T4V2RS_g":{"text":"Service is always personal! Food is always delicious! We sat at the bar and watched the nf","useful":1,"cool":0},"pMtxQpIl5EuhvTkhlhYU7w":{"text":"Last year I lived maybe 3 blocks from here and walked right by it regularly and never went","useful":1,"cool":1},"YE-t5mVKZjHZ2aMn4npSRw":{"text":"I ate here with Tom Fitzmoris' Eat club on nomenu.com. It was most likely the greatest mea","useful":2,"cool":0},"dpH6JrSASGZ-kitP_-SoKA":{"text":"My boyfriend and I went to Vincent's on a Sunday night. We got seated very quickly with no","useful":6,"cool":0},"2mtgnVaP2fNe5sfMZWSc0Q":{"text":"What a great find.. We stumbled upon this jewel . Sat at the bar and Darleen took great ca","useful":0,"cool":0},"neBZVNMH3jFN53CjpiS6CQ":{"text":"I'm at 3.5 stars on this one.   But I've got to bump up to a 4 due to the attentiveness of","useful":1,"cool":0},"dyjI7PJqofPJcSVi2n6m3w":{"text":"Wow, such wonderful service and the food was mouth-watering. I wish I could eat here every","useful":0,"cool":0},"L0FUjHGdwAgxis1wv4re4Q":{"text":"I am giving this a 1 because of all the BS reviews to the contrary.  If someone from Chica","useful":1,"cool":1},"ijTbMSMHSz3kigNRquH5_g":{"text":":(\nSorry to say that once again the service for take home food was really bad.  The woman ","useful":0,"cool":0},"M4bhmxjCumEJ53KSo0AJLA":{"text":"Really long wait. So reservations are probably ideal. But really great wait staff. The own","useful":0,"cool":0},"mXmx6F-aznkGUw4jdLc-OA":{"text":"This was by far the best Italian food in New Orleans! The service was amazing and the food","useful":0,"cool":0},"rDknqgMUsjHzhkW9zz7IHw":{"text":"Always love Vincent's.  The food never disappoints.  It seems, however, when I go I always","useful":0,"cool":0},"0LmHeNoGEqvtj8bcHuIz6w":{"text":"Went back for dinner this time which was ok but I prefer the lunch much better. The much t","useful":2,"cool":1},"BdtKW2O4w8FxaOF7bl6Tcw":{"text":"The reason to go here is the Corn and Crab bisque soup in a bread bowl ($11).  Worth it.  ","useful":1,"cool":0},"6873Olzo7rL0OgG0N8nMrA":{"text":"I have eaten here twice in the last month and both times this place has been great!\n\nProba","useful":1,"cool":1},"yU-zFbCkvVM5UGq_VLEn7w":{"text":"dined at vinces a couple time during jazz fest weekend and love it!  the service was very ","useful":0,"cool":0},"clKqPzVo4tSVEhsl_lkNnw":{"text":"Before Katrina, Vincent's served as my friends' Sunday night dinner place.  We'd go almost","useful":3,"cool":1},"IeBOG-vioB6bmHp5EK7aMA":{"text":"This place is wonderful. Feels like you're in Italy. On the street car line. The crab and ","useful":0,"cool":0},"7QRsU1B6MqAXR6LqBQqPCg":{"text":"We had a delicious dinner at Vincent's. We popped in here right at opening, and without a ","useful":2,"cool":0},"zVUideUu3Hitc-JuCQGKzw":{"text":"If I was on death row, this is where I would get my last meal. \n\nThe first time I came her","useful":5,"cool":1},"nGDq_J3yRDc31GZX6nl7uA":{"text":"One of my favorite Italian spots in the city. It's a very cozy neighborhood restaurant. Yo","useful":2,"cool":0},"xhhuGPpby9yQbmPpHBCFqQ":{"text":"The Veal Napoleon was the best italian dish I have had in New Orleans. Come for lunch to g","useful":3,"cool":1},"g2RIbrjybYTnplMjWbOQYQ":{"text":"Vincent's is a New Orleans institution. \n\nThe service is quick and efficient. The food is ","useful":1,"cool":0},"ZMX341sjgpkkacnV_dHjiQ":{"text":"Being a new New Orleanian with Italian roots, this was my first Italian restaurant - and w","useful":0,"cool":0},"_ZeAcg3wA_85MipAWRmb7Q":{"text":"This is now our go to Italian place in New Orleans. Casual but intimate. Staff is super pr","useful":1,"cool":0},"N0higuZoz7ssHDGJ1h34Uw":{"text":"Ate here tonight at the food was amazing! Everyone in our group of four loved their meals ","useful":0,"cool":0},"zXhJLqD9XmobJv8bcU8-1w":{"text":"Everything here was absolutely amazing. Old school family Italian restaurant. Best carbona","useful":0,"cool":0},"pLlOF8LWl_QPK9I_-g0MTw":{"text":"This is by far some of the best authentic italian food I've had in ages. I'll definitely b","useful":0,"cool":0},"3wg8sxyAilFHXdQxcfcIwA":{"text":"The service and the food was impeccable! I had the crab and corn bisque as pictured, with ","useful":0,"cool":0},"GntLAs0bJJO1tpcDt5q4QQ":{"text":"Awesome food, convenient location.  The corn and crab bisque in a bread bowl is to die for","useful":0,"cool":0},"KjPVIanMGjIFz3hk5i6dAA":{"text":"WOW is about all I have to say. I came in and was seated at the bar. Not unusual since cur","useful":0,"cool":0},"9A23QmjQ7e5s5DihFTEnKA":{"text":"I had always heard that Vincent's was a great place. It looked promising, since on a weekn","useful":0,"cool":0},"yGR6xK5eWwNXHj2ptiZ_kA":{"text":"I just moved to New Orleans and my friend demanded that I go get the blackened redfish, co","useful":1,"cool":0},"v8HJgC-Gh_F5zzb3j9lxlg":{"text":"Absolutely awesome the veal chop with garlic risotto and asparagus was the best thing i ha","useful":0,"cool":0},"7Yr8zy_saWWSRGMp3Jbepg":{"text":"Wow! What a great find. After almost a week of terrific meals in NOLA my wife and I decide","useful":0,"cool":0},"ouVzhtsB7Lm-hkAb8aAgVg":{"text":"Loved the dinner and had a wonderful evening, it is a Carrolton icon!  We started with Oys","useful":0,"cool":0},"akXQQqcTVro6cVBm7cJuPA":{"text":"We decided to only try new (to us) places while in New Orleans and this one will certainly","useful":3,"cool":0},"e1EqVXDuETY12W2rwKRnqA":{"text":"this place was pretty good. Coming here i was really skeptical being that i come from an a","useful":0,"cool":0},"cWKdxYRfpjeDiwWWtUHmCQ":{"text":"Fantastic food, experience, environment and staff! Hands down the best Italian food we've ","useful":0,"cool":0},"T0Udy-exBz2ejj751Miosw":{"text":"My favorite Italian Restaurant!!! I love this place!  \n\nWe have been to Vincent's numerous","useful":3,"cool":1},"4SqxsqYQsEABum09iAH0dA":{"text":"This was the best meal of my life. You may have to wait and it is well worth the wait. It ","useful":0,"cool":0},"guTC8uZPdTttH42crMli4g":{"text":"So perfect!!  Outstanding vibe and incredible food...started with great drinks in bar incl","useful":0,"cool":0},"LdO8JMA4oNqzTQbmBfnn4g":{"text":"There's a lot about it that's ordinary (I agree with the Goodfellas review below), and it'","useful":0,"cool":0},"9-8aKxhJwPojY81rcncGSQ":{"text":"Every meal I've had at Vincent's has been a treat.  I've been dinning here occasionally fo","useful":0,"cool":0},"EDLzlO28dM79PWgS-MGl7Q":{"text":"Love this place. Parmesan crusted chicken is great... Almost everything is delicious. Crab","useful":0,"cool":0},"Q8ZPBCY_vSX8c1ZyzNN7oA":{"text":"This place is AMAZING! My husband and I went on a Sunday night and it did not disappoint. ","useful":0,"cool":0},"Q3SK4GSt0EiDCOCZyUDyig":{"text":"I lived in New Orleans for four years and I would pass this establishment weekly on the wa","useful":2,"cool":0},"w59VoklNolWYp6evYfFS9A":{"text":"One of the best places to eat Italian in New Orleans. The ambiance is quaint Italian and t","useful":1,"cool":1},"-7GMcyFZXZ_B5bB24lyV0Q":{"text":"Since coming to New Orleans in 2002, I have not found really good Italian food. I mean lik","useful":2,"cool":5},"kOj1jqIdQpaM6PPMaKcJMA":{"text":"The service was impeccable, I sat at the bar on my own and talked with the bartender and o","useful":0,"cool":0},"ytq4FWJWzd5YgHeu84pd4g":{"text":"I wish everyone would read the negative reviews and then not go to Vincent's.  Then I coul","useful":3,"cool":0},"mtnXYsb9DD5bbM3nIh3TMg":{"text":"Great place. You must have the crab and corn bisque which is served in hollowed out breadb","useful":1,"cool":0},"Sud1jekTxrEbstfa71qrOg":{"text":"Everything good with Vincent's: Made a reservation online and our table was ready when we ","useful":1,"cool":1},"qPmPZF7qaoRUhQdXTh3a7Q":{"text":"We had a tremendous meal here on our last night in NOLA. The veal, the duck, and the redfi","useful":0,"cool":0},"9oriELB82rQJW1G3K-N3dw":{"text":"Coming from NYC, I don't expect much from Italian joints down south. But Vincent's definit","useful":0,"cool":0},"416vQl_8pgyVfwqlj5h1nA":{"text":"In New Orleans to pick our daughter up to return home after college sophomore year. SO man","useful":2,"cool":0},"iBRFpx87OP8DneQh39T60g":{"text":"Best Italian food I have ever had. I lived in New York and ate all all the top rated place","useful":0,"cool":0},"loqSn0F5m7OWgoa3ir9S0w":{"text":"Canneloni Canneloni Canneloni all  have to say. Don't come here if you a re in a rush, bec","useful":4,"cool":1},"KDelrKfiICMdT4uew-pCBw":{"text":"I was uncertain if this uptown Italian could compare to Irene's. I am no longer in doubt. ","useful":0,"cool":0},"j5704ewTp6OB0dq8AUQXTg":{"text":"FABULOUS!!! Absolutely love this place and can't wait to go back! Had the chicken soup, ho","useful":0,"cool":0},"8NDtz_XFBqF7L1fSyh14qg":{"text":"My son lives directly across the street from here, and I don't know why we never went here","useful":0,"cool":0},"ucxHka67hKRYfiqHqbCBKg":{"text":"This place is soooo teeny tiny and tightly organized it will boggle your mind - but the se","useful":0,"cool":0},"mgMobHgLPtYcS_uOO08ifQ":{"text":"It was our first time at Vincent's last weekend, and it was excellent!  Both the host and ","useful":0,"cool":0},"eVLC_eD8rayy37WhGLFhlg":{"text":"YUM! The best Italian food ever and fun atmosphere. Small space, so don't expect to have t","useful":1,"cool":0},"sdFAp9EmyIJVJtJOY_nK2g":{"text":"EXCELLENT service from the host to the waiter to the \"bread\" boy. So attentive and courteo","useful":0,"cool":0},"UQDAF3G1O6BojbXfOT6Brg":{"text":"Average... Very very average. I don't like paying for thing that I cook much better and th","useful":0,"cool":0},"gf0yd1-MTciLhUUR3JKkjQ":{"text":"I have been passing by this little Italian restaurant for years, but I had never had the o","useful":10,"cool":3},"eofO0OxPN2H5r_JiJwd-FQ":{"text":"Some great traditional Italian food. They have great sauces and some of the best crab and ","useful":1,"cool":0},"8DrbE7AbiMy-Z08nVJW_Jg":{"text":"4.5 stars as the average is ridiculous. This is the best meal I've ever had. Waited a litt","useful":0,"cool":0},"vMgY2JVV9trbBIouHLctyw":{"text":"I'm pretty picky when it comes to italian food, and didn't expect much from an Italian pla","useful":0,"cool":0},"-xRK208JhOpyHx1IMGggtw":{"text":"Food: 4.5/5\nAmbiance: 3.5/5\nServices: 3.5/5\nPrices: $$$ (avg 20/person)\n\nIt was Saturday e","useful":3,"cool":4},"hKoRv5UwhiJFYoj_Pdu7Kw":{"text":"Not sure why so many in the city rave about this place.  It's \"okay\"...but maybe the local","useful":3,"cool":3},"coYOCPJqeI46pMDmwQUzOw":{"text":"Like, Whoa. Bruschetta was just okay but stuffed mushrooms we're delicious. Roasted beet, ","useful":0,"cool":0},"fWpsvLpWrOxORxZ2VkZ8yg":{"text":"AHHHHHHHH! I'm surprised more people don't know about this place. I think it's because whe","useful":0,"cool":0},"HvS0Zvno1DT4a5mYAUDyUw":{"text":"i love the old school charming hospitality of the maitre'd and servers here.  the food is ","useful":2,"cool":1},"SWcyklrVgEdW40FdD3Titw":{"text":"Made reservations via Open Table at the last minute. Cab driver called his friend cause Vi","useful":1,"cool":1},"SlCrtj6g5zUW8XuhguyMog":{"text":"Visiting Tulane, stumbled upon Vincents as it is a short walk/trolley away (about a block ","useful":0,"cool":0},"PWgGcmT4HfxW7YC_jBNI-A":{"text":"Chocolate mousse cake was something I can get at any supermarket. Other than that, delicio","useful":0,"cool":0},"KERXih7oZP2Pt6UvovGsAg":{"text":"UNBELIEVABLE!! Tony you are the man! Best restaurant EVER!! Ambiance, food, and service!! ","useful":0,"cool":0},"0ItRD8TGTFbRVDgvVGABDg":{"text":"The corn and crab chowder might be the best thing I have ever put in my mouth. If I ever g","useful":3,"cool":0},"1r5w-PYZIU43xilYRmV8GQ":{"text":"Our evening at Vincent's was a mess from start to finish, esp finish.\n\nWe arrived believin","useful":0,"cool":1},"YfeoimOC5d07HXpk0E6b9w":{"text":"My GF used to live here,and we return every year for Mardi Gras, and was one of her favori","useful":0,"cool":0},"13Yby-kKsLmak1CKI1SRLw":{"text":"I had a celebration dinner here and the food was amazing.  Every single appetizer and entr","useful":0,"cool":0},"AHX43bbfnWj4UvHfuFUP0g":{"text":"Just great food! Soups, salad, escargot, lasagna, wine, music, all the best! Will return.","useful":0,"cool":0},"VI_YMkjE-uHr0Haso_OAEw":{"text":"If you are looking for authentic Italian food with Beal that will melt in your mouth then ","useful":1,"cool":0},"S_zGPaUeq-hAuH7vQad63A":{"text":"I had the most fantastic meal here for New Years Eve and I was so floored by my wonderful ","useful":0,"cool":0},"X5nv7YJiRvaknZFFdzNydg":{"text":"Love the food!  If you're looking for a nice date night spot in Uptown, we would recommend","useful":0,"cool":0},"EDOmpXyUlzwFJan6LaU-xg":{"text":"There are a few places in town that give me that pre-Katrina NOLA vibe, & Vincent's is abs","useful":0,"cool":0},"fpHyOz_-W1MDuDE8d-yhjA":{"text":"We really want to find a great Italian place in New Orleans, and Vincent's isn't it. I enj","useful":1,"cool":0},"LDYiniJANR0P2JiINA5_rA":{"text":"My super picky Midwestern family had just gotten into town, and they won't eat anything re","useful":0,"cool":1},"sbchV0ygnCXzbSQhEpi5HA":{"text":"Tight would be an understatement.  Forget the reservation, it meant nothing.  We were pres","useful":1,"cool":0},"xmtFDriynL4KVyRy6mv_cA":{"text":"I absolutely loved everything about dinner at Vincent's. It has a cozy quaint atmosphere, ","useful":0,"cool":0},"0AEQ0tZAg7DN3FRj8vao2g":{"text":"Fantastic local restaurant with the atmosphere to match.  A must for anyone visiting NOLA.","useful":0,"cool":0},"fq0WdNkWQzjMTpKyhaZmSQ":{"text":"This New Orleans Italian standard was way better than I expected. The Chicken Parmesan is ","useful":0,"cool":0},"f2Wz6meAmhmTPgfhTg4_JA":{"text":"In town on a business trip and this place came highly recommended and didn't disappoint. S","useful":0,"cool":0},"8e6ScEQ05itxspcjBPYYpg":{"text":"Had the lambchops here, it was tender and juicy! Excellent. \n\nDo not recall any bad experi","useful":0,"cool":0},"qzEvatdyatzVk7wOkvJLag":{"text":"Went to the Metairie location. Very impressed with the food and service! Everyone was very","useful":0,"cool":0},"VmB7UdPoV522FI2S8mExQw":{"text":"If you want a great Italian meal in a cozy romantic setting this is the place for you. no ","useful":0,"cool":0},"_d0lElhTTHZZfhp3PJ6QGQ":{"text":"Amazing food and service! Well worth every penny spent! Wish I didn't live out of town, wo","useful":0,"cool":0},"DBXNU2o176Lauei0MZarFQ":{"text":"My husband and I went here for our anniversary dinner.  It is a very romantic place to spe","useful":1,"cool":0},"3xieSCNzVfAnYP9Bqqo3yA":{"text":"We usually get carry out from Vincent ' - the food is good enough to still be yummy when w","useful":0,"cool":0},"K9iy1Xe8gUQHjPXLROMb5A":{"text":"This place just gets better and better everytime I go! It deserves 10 stars! I love all th","useful":1,"cool":0},"8otnQVUX_dhImTM2lt93Aw":{"text":"Vincent's is my favorite Italian restaurant. I am in agreement with Jen L. It's a great pl","useful":6,"cool":5},"gNP1N3uKzrSUoyXSVf8XOA":{"text":"Visiting here from out of town and  based on yelp reviews we decided to try this restauran","useful":1,"cool":0},"zcQXlSuTG9Ph22trzxiNSw":{"text":"As long as Vincent himself is at the Metairie restaurant, I and other women I know will on","useful":1,"cool":0},"xsLnDOltown8NcGfMkIGVA":{"text":"The first culinary experience that my wife and I had after we had moved in to our new plac","useful":0,"cool":0},"ASVo3nBWonNzPBfw8KFuSg":{"text":"Great place, spectacular service. We got really tired of Bourbon Street and needed real fo","useful":2,"cool":0},"AfFYhOUqXcyUEK8v3GKJ1Q":{"text":"I love, love, love this place. I've eaten here at least three times and I've had great foo","useful":0,"cool":0},"LEf73yL3E0zeICAo1odYUA":{"text":"Corn and crab chowder is great!!!! Everything I have tried I have always enjoyed.  Always ","useful":0,"cool":0},"bssHTwwsHOFe75EcyFPj2w":{"text":"If you are going to be stood up, this is the place to have it happen. My date bailed on me","useful":0,"cool":0},"qVsPsO5K4c0ysHqnFbP5yQ":{"text":"Food was amazing! Atmosphere is very romantic. A very busy restaurant. Negatives: there is","useful":0,"cool":0},"T1CRfIVTWyGEfniPpqR0bg":{"text":"This is an old fashioned Italian restaurant.  We stopped for lunch, and the eggplant parma","useful":0,"cool":0},"evzB8IU7Apq8gG7-ZPedmA":{"text":"A very romantic and small restaurant setting. I was recommended by my roommate to come her","useful":1,"cool":0},"l8oGEb-VwfzCHBOEsVQ7Qw":{"text":"Very Goodfellas - like walking into a classy Italian restaurant circa 1978 - waiters in ve","useful":0,"cool":0},"LAq6d-kSU8Z_Z4u0Ibsf3Q":{"text":"Spaghetti and meatballs is a simple dish but also one that proves to me the quality of an ","useful":0,"cool":0},"KxvNmZFrQ_e1SIHVG2YinQ":{"text":"The food here is amazing, and this was probably some of the best service I've had at any r","useful":0,"cool":0},"ZnalFIm78Z1n4CVRAX6N6Q":{"text":"Very authentic Italian restaurant.. We both had the shrimp in an Alfredo and green onion s","useful":0,"cool":0},"qD5el3VpTOaOBSuvHG8R7w":{"text":"Number one on tripadvisor and deservingly  so. Had a nock out meal easily the best in New ","useful":0,"cool":0},"GWLh9gtrd8HdSHWqZM9e4A":{"text":"Hard breadsticks with garlic butter + corn and crab bisque in a bread bowl + creamy italia","useful":1,"cool":1},"Ych1qt5sj5x-12t14zUuuQ":{"text":"Love this place! I wish I could eat here everyday! The Taste of Vincent's feels like robbe","useful":1,"cool":0},"3IYNkFT16W_3df2RcvYgGg":{"text":"Vincent's is everything I love about local places. First of all, it's tiny. Like, you may ","useful":2,"cool":1},"Dx36JLZv2CoSlb4LPE83Og":{"text":"Great service and a clean, pleasant atmosphere. I found the restaurant welcoming and the s","useful":0,"cool":0},"Z0Ms0dCFXYHzsEMpeYC_JA":{"text":"Went here randomly 1 night and it was great. Everyone was nice, great service, and even th","useful":0,"cool":0},"AFOS0b2RD_3SAP0ybMEWUw":{"text":"This was a bad experience. We got there early and we were seated in the back room. Me and ","useful":0,"cool":0},"6z5pB3zCWddxXSHt-ii0uA":{"text":"One of my all time favorite restaurants. I've been coming here since I was about 14 years ","useful":1,"cool":0},"yiJLqcRa23BT3dGPhOh0tg":{"text":"Perfect location for a romantic dinner or catching up with a small group of friends. Food,","useful":1,"cool":0},"Imh1ia4FUgO_pva3BEMCSw":{"text":"We went to Vincent's with some dear friends who are locals and count it as one of their fa","useful":0,"cool":0},"h79n4Tad4lc24ehBl2k31Q":{"text":"While the food may be acceptable, being told by the owner that you have to order or leave ","useful":0,"cool":0},"A4H-2IuiK-8AWObJzYxrJQ":{"text":"For American Italian, this place is great. The service is lovely- our waiter talked to us ","useful":0,"cool":0},"59Ip1h77coFpZtEwZSXQrQ":{"text":"From the moment we entered Vincent's, we were treated poorly. Horrible service by a waiter","useful":0,"cool":0},"Of6k8TToT2B5WkyoQ4dcUQ":{"text":"Me and my wife's favorite restaurant!  Vincent and Tony always make it special for us.  We","useful":0,"cool":0},"hiKRmq2xRwbB3Eqnibs4ww":{"text":"This place is amazingly good.\n\nI tried the fried calamari, which is a simple but delicious","useful":4,"cool":2},"6l4hKSalaedQ6ihGw-4-3g":{"text":"Vincent's was an awesome and wonderful experience! The food was delicious a little salty b","useful":0,"cool":0},"OHPFMQlNiaHIweDBIyiyrg":{"text":"I've been to Vincent's twice now, I went last night for my birthday with my husband and da","useful":0,"cool":0},"WrTriHj_AqjLXbVAECu8lQ":{"text":"We had to wait over 2 hours (small place, very popular with locals) so be sure you get res","useful":0,"cool":0},"S8JvOZHbChhccwc9YPqoFQ":{"text":"I went here with family, and it was amazing. I noticed that a friend had posted a review m","useful":1,"cool":1},"FcgpytkKBJG0ZlLeKF7aZQ":{"text":"This is hands down my favorite  Italian restaurant in New Orleans.  It is in our neighborh","useful":2,"cool":2},"25FWOpTye0Fcrke-SBal9g":{"text":"Went here for the first time.  Very disappointed  paid 22 dollars for one piece of chicken","useful":0,"cool":0},"gclcOrCCkDo_6n5Tu5nVkA":{"text":"Chicken carbonara!!! This was the best Italian food I have ever eaten. The service was gre","useful":0,"cool":0},"n14_VwsRxKJqTE45oWRt_Q":{"text":"I'd go 4.5 stars even!\nOld Italian Restaurante feel, lots of servers, and wait staff overw","useful":1,"cool":1},"BVlaGIGgqBoxNplo9JU-_w":{"text":"Eat here 3 times a month.  Friendly staff, great food.","useful":1,"cool":0},"xZOB5cDyFUpq8mVEAbm2zg":{"text":"This is the best place for any celebration!  Waiter and everyone are the best.  And the fo","useful":0,"cool":0},"UwYILcawPyyycXLOXfSxDw":{"text":"Was in New Orleans for a few days and this place was recommended by my cousin. This place ","useful":0,"cool":0},"-zrgaT3g4rdh8g6cEE0rTA":{"text":"We received multiple recommendations for this place from friends and locals. Seriously, so","useful":1,"cool":2},"JSWrbgtFczf_k9-9lNaWeA":{"text":"OMG best Italian food I've ever had!!! I've pretty much tried everything on the menu at th","useful":0,"cool":0},"h3IMxmkaLqYJQJtF1FCbzQ":{"text":"I've been to Vincent's twice. Radically different experience the first and second time. Fi","useful":2,"cool":0},"LhcLBqXIDOZAElQYopNT5Q":{"text":"An absolute must if you are in NOLA! Everything was delicious, the bread salad, oysters Ro","useful":0,"cool":0},"VzDpvKUvM0Zjbgq9iEskIg":{"text":"The calamari was a very good price and was a huge portioned appetizer. Also, their duck & ","useful":0,"cool":0},"TdnGZEEcrA3sokDqucRMEw":{"text":"You want local\nYou want homey\nYou want good food\nYou want to feel you are welcome\nThis is ","useful":0,"cool":0},"E4Y1f5mOzQ0adg8Espmscg":{"text":"Best Italian in a while. Family friendly neighborhood place. Excellent service.  Recommend","useful":0,"cool":0},"0sdnmfPK2c9lMq5xgXAJOg":{"text":"I certainly wasn't blown away by this place. I'm sure there's better Italian food in New O","useful":0,"cool":0},"8m1L8OJ-XAZRuKjzc0zN8g":{"text":"Love this place.  The best for a date.  Don't try to come here on Valentines night though ","useful":4,"cool":2},"Xrcn3DW7DuM8H2Fhpzdmog":{"text":"Great olde school neighborhood Italian restaurant.  The definitely use a sweeter gravy, an","useful":2,"cool":0},"7sN_bztdU2l-8cvp4rALqA":{"text":"I came here with my gf for a friend's birthday (very) late last Friday.  Like 9 pm reserva","useful":2,"cool":2},"VmRC7eCOtYG8CtG7403TOQ":{"text":"A last minute dinner with my daughter on a Sunday night and the experience was terrific. I","useful":1,"cool":1},"Bzz7OxZPUS6tI9aRzTq9Yw":{"text":"Such great food ,service and atmosphere. The cannelloni is a must have. All the dishes are","useful":0,"cool":0},"B5G_4O6BMTQ1n4MtjB3SXg":{"text":"Absolutely loved our dining experience at Vincent's Saturday night!!! It was my wife's bir","useful":1,"cool":1},"SSKE4WfRC4rZsZGk5LfcFA":{"text":"This was my families first time there. It was probably one of the best dinners my family h","useful":0,"cool":0},"g8RPKDwBBzAk3ovfkJVT8g":{"text":"Steak was sent back 3 times- overdone- then left asparagus off. Other food was good. Servi","useful":0,"cool":0},"2WhGRXEsQaKyQDP9l93uyQ":{"text":"Best Italian Restaurant in New Orleans!!!! Always get the corn & crab bisque! The fettucci","useful":0,"cool":0},"W67-OruDaYQR4Y_nKxIeUA":{"text":"Came here on a Saturday night for dinner with a friend. There were people waiting outside,","useful":3,"cool":2},"nJJvg4_ar5Xm2qRJshHryQ":{"text":"Really good restaurant. Owner greeted us at the entrance. Sturdy table with heavy table cl","useful":0,"cool":0},"KC0PQYdPG9v7vI3yuI6mRQ":{"text":"Ordered Vincent's  for the first time and was quite disappointed. I was craving spaghetti ","useful":0,"cool":0},"p62v8Y9Ed0Dg_1RXBZ2D4w":{"text":"When visiting NOLA, one doesn't usually eat Italian food, but we wanted a change at the en","useful":0,"cool":0},"TJ0MmzFEfQx3hkyF6TxQRA":{"text":"Vincent's would be a good place to bring a date...maybe not a first date, too much pressur","useful":8,"cool":2},"B1fHOiJOi7G46AsNFAONjA":{"text":"We were in town for the Tulane Law School graduation.  My daughter has multiple food aller","useful":0,"cool":0},"FjWAVG0sNZZGfwZZuZIo0Q":{"text":"Had the *best* meal here last night. This place is old school and the crowd does skew a li","useful":0,"cool":0},"tMEPVh-0mmV4ip--9BC_Wg":{"text":"Amazing amazing place! I definitely recommend the lasagna!! Our server was Brian and he wa","useful":0,"cool":0},"01dN4m0qlWP7ad6eHC4-Iw":{"text":"This has to be the best Italian restaurant in New Orleans. The food is outstanding, the se","useful":0,"cool":0},"rrfIjPn-4NlhP1JSBRhfXA":{"text":"One of our favorite restaurants for special occasions. I try something different each time","useful":0,"cool":0},"NQo9Uvu2PN1Dt0h0uvSHzA":{"text":"Very good restaurant. I ordered the corn soup bread bow. Loved the soup, bread bowl was ok","useful":0,"cool":0},"7M3JFUIeAcgXXaN8hI3Osg":{"text":"Delicious... Every... Bite! We had the corn and crab viaque bread bowl(I've had alot of bi","useful":0,"cool":0},"1Cm0AjjBKblH1rxwbMcpUw":{"text":"My fiancee' and I recently celebrated our 4th anniversary with an early dinner at Vincent'","useful":2,"cool":1},"sljLUqEbbPUm-QY2iEg_wg":{"text":"Went on a Saturday night and it was very packed. The same guy that took our reservation wa","useful":0,"cool":0},"0L8O75-i74Kpc0JM5osySQ":{"text":"My wife and I had our anniversary dinner there, and wow the food was great! I had the rose","useful":4,"cool":1},"fsRS5dyGFNUD3woiST41LQ":{"text":"INCREDIBLE food!!!! Has very good selection on the menu...something for everyone! Crab cak","useful":0,"cool":0},"0E10PwqHuSfy5m6UpdiSVw":{"text":"Best food EVER!!!\n\nI love me some Vincent's \n\nAlways on point haven't ever had a bad meal ","useful":0,"cool":0},"aaDcCqZaBxpt169XooZsqw":{"text":"Fantastic food and service. A gem\nIn a quiet neighborhood. Worth the trip. \nIf we lived he","useful":0,"cool":0},"hWxwS-NfppA6KOWXz1mPXQ":{"text":"Fantastic food. Wine by the glass not too good, you get half a glass. Better off with a bo","useful":0,"cool":0},"oUQzyO3ALU0fT_QMB-6bTw":{"text":"This is my absolute favorite restaurant in New Orleans. Always consistent and the service ","useful":0,"cool":0},"e4omYdw_y7J4qrJhKeDjCw":{"text":"Awesome food and awesome service!! We have lived here for almost three years and just rece","useful":0,"cool":0},"jiCcm8gSavf821vf3zxxWw":{"text":"We had reservations at 7:30. Table for two took about a 40 minute wait. The host was very ","useful":1,"cool":1},"YmjvNd-qcIH93srDtzb2cw":{"text":"Vincent's far exceeded my expectations. I can't believe I went decades passing this place ","useful":2,"cool":0},"cssqn5GGaMGnssd5pllS8w":{"text":"The service was awesome. The food was good as well. We ordered the seafood stuffed pork ch","useful":1,"cool":0},"_4C4WScOk2fsJ-QM8aVN0g":{"text":"My wife and I had eaten at another Vincent's location several years ago, but had never din","useful":2,"cool":0},"9M7E2uxfq-hdbF7R0ELnxg":{"text":"Every single bite was delightful.  The Rose of Sicily was exquisite!  The caprese salad in","useful":0,"cool":0},"0tr8dXmbo4-ZRnhGE7PAsQ":{"text":"The crab and corn bisque served in a bread bowl is the best soup of its kind in the city. ","useful":0,"cool":0},"C6qoUFeArhy3dKU_ay605Q":{"text":"Awesome food and service! We stayed at local Airbnb and walked to dinner with family.  We ","useful":0,"cool":0},"xhYVtxeqUURq6TdUy0MmeQ":{"text":"We went for my son's birthday. it's alright. Nothing exceptional, nothing horrible. The fo","useful":0,"cool":0},"9v-1SDXiBPXvHwA-ervj_g":{"text":"Very good.  The bread was excellent. Chicken Parmesan was awesome as was the cannelloni.  ","useful":0,"cool":0},"FR_qUJ_96OAAiZxnSZhJxA":{"text":"In a city filled with great restaurants, Vincent's is one you don't want to miss. Never di","useful":0,"cool":0},"TAviu9ejz86Tcl6hKo9pzA":{"text":"Vincent's on St. Charles is one of our favorite restaurants in New Orleans. The owners and","useful":0,"cool":0},"QMBDnA5o4jSHDCGBHfW-rA":{"text":"Amazing!!! One of our favorite restaurants in New Orleans! The owner is great and gets to ","useful":0,"cool":0},"-j60gaHg6t-vcfISKjJP_A":{"text":"I've had several acquaintances recommend this restaurant as an option for authentic Italia","useful":9,"cool":3},"vw3wpVvzfPKHTYHC84I2XQ":{"text":"I'm from New York and I am Italian so it's very hard to please me when it comes to good It","useful":1,"cool":0},"85E2RuPKMdI0ucaYseyMPg":{"text":"Sicilian Creole. What more is there to say???\n\nI often day dream of this place once the st","useful":0,"cool":0},"bFgJPFJZD8rzQtGXmH3yww":{"text":"We just stumbled upon this place while in town and WHAT A SURPRISE!!!  Great food, very ni","useful":0,"cool":0},"hJ_Oq9HnXcZOka8kNtkAmQ":{"text":"INCREDIBLE!!! One of my favorite restaurants. This place is authentic and old time Italian","useful":1,"cool":0},"QyfSsHjfFYDqxVM7g1OOSQ":{"text":"Vincent, Tony, Raymond\nYou guys are the BEST!\n\nGreat Food, Great Service, Great NOLA Atmos","useful":1,"cool":1},"tGhPg5hGvz8H0ZFEaTVZ2g":{"text":"Amazing, what more can I say. Great food and great service. The whole family loves it. You","useful":0,"cool":0},"2JPTCP9MnFzxRs-Yr6j78A":{"text":"In New Orleans on vacation with my dad during Father's Day and I did my research about a m","useful":0,"cool":0},"ZRXJINMkOyE9Wh3_QgeAHA":{"text":"My 9 year old son wanted a \"fancy\" dinner for his birthday, so I took him here. It was PER","useful":1,"cool":0},"I_0yhhgAzVUdwA2al4UuPQ":{"text":"Don't let the exterior fool you, this place is a must hit for the local.  Simply fabulous ","useful":0,"cool":0},"THAs4jZMpxhzxGYflp1oVQ":{"text":"One of the better Italian restaurants in the city. The one on St. Charles is far superior ","useful":1,"cool":0},"JCliaWKJy1Ny6w252PVQ0A":{"text":"Had the veal Neapolitan for lunch , it was so fresh and flavorful made me so happy to brea","useful":0,"cool":0},"Eu3zjSFSowEh5uwO4QZwSg":{"text":"Such a gem and truly a NOLA institution. Been coming here with my family for decades, and ","useful":1,"cool":0},"kluWZ2RmFnB-L0dE28aivQ":{"text":"This was real Italian Cuisine! I haven't had this much good hearty red sauced food as i do","useful":0,"cool":0},"S9G2P_6KcZDj4j_wb7e8UA":{"text":"So, Vincent's was around the corner from my sister's place, so I decided to give it a whop","useful":1,"cool":2},"3igA2HeEgQFDMO3mwUgKFA":{"text":"It's ok. My meal was fine but just not wowed by their food. I loved the corn & crab bisque","useful":1,"cool":0},"GrgvqYxNaOf0YrB1z828MQ":{"text":"Disappointed in the overall experience. The people were nice, the food was a 4 out of 5 fo","useful":0,"cool":0},"2Hp_IJUlnNsBI6zHJFV9fw":{"text":"Vincent's has been a favorite for many years.  Shame to say, we hadn't eaten there in over","useful":0,"cool":0},"HgWJoFYSYc5KJGrxbqlsag":{"text":"My favorite place to eat in NOLA! If we are there for 2 days, we will go there twice! Parm","useful":0,"cool":0},"iy5PGHpgEsQ23Fo_jxCKcg":{"text":"They put sugar in their tomato sauce. 'Nuff said. Vincent's is what my mom used to call a ","useful":1,"cool":0},"adMYMz7MrOEZmzb01UX22w":{"text":"Oh. My. God. \n\nI was sure that New Orleans had no good Italian food until tonight. I found","useful":16,"cool":8},"dFKdUWK2J92LZ22lfVurbw":{"text":"Love this place. I feel like I am home here. The food is great as is the service. We've be","useful":0,"cool":0},"PL_ZUbCBdpMZpLc3iDZ6BQ":{"text":"I love my pastas, bread, and just carbs overall. This is the perfect place for all of that","useful":13,"cool":7},"-3pylnx-HnqMDqy7eN6elA":{"text":"Fantastic meal. Ask for Veal St. Charles. Not even on regular menu. Friend loved Shrimp Pa","useful":0,"cool":0},"CIfUXgEMRVj6Eix5RLuoCw":{"text":"Had take out from here. I thought the lasagna would be super great but has too powerful of","useful":0,"cool":0},"33IYuUNhy4_nyukuSKSbUw":{"text":"Great Italian food can be hard to come by in the City of Creole and Cajun. However, Vincen","useful":1,"cool":0},"Jea7p9DafU7BEX2qKZeBTw":{"text":"Veal Tagliatelle.  Amazing dish. Very nice selection of Italian wines - chianti yes, but a","useful":1,"cool":0},"jLlPu5xEq_CRPuWohuzS0A":{"text":"One of my fav's in the city. When me and the wife just can't decide on exploring other men","useful":0,"cool":0},"vJJxIQ8lKrnPP8xu28KZ7A":{"text":"BLUF:  I have wanted to eat here for years.  Glad i finally got to. The food was good but ","useful":1,"cool":0},"t_KTzGWQpGH156VeYIe_cw":{"text":"Very close, intimate setting. I had been dying to go here for years and finally brought my","useful":0,"cool":0},"2wkwVVY4OVhsdATVoLDusw":{"text":"Vincent's Italian Cuisine is yet another legacy restaurant in the Uptown area of New Orlea","useful":2,"cool":2},"WlP7R9GFIL1Bcpz4WKhbTg":{"text":"The best Italian restaurant in town.  I usually order from the specials menu and it never ","useful":0,"cool":0},"FkVh9lumec0U13WfyhN1GQ":{"text":"I had a wonderful date night here with my boyfriend a few weekends ago. We made reservatio","useful":1,"cool":1},"Ry7qkMI5fsAvbya6A6eWDA":{"text":"We just finished eating here. We're from california and a local store owner was kind enoug","useful":0,"cool":0},"WB1x_UJ1pMFI6AXpTOqJWA":{"text":"Have any of these other reviewers every had good Italian food? The food was just good enou","useful":2,"cool":2},"uSOly_WKrFVcRGIszspXDA":{"text":"This is one of my favorite restaurants! I always love my food, and the service is awesome.","useful":0,"cool":0},"E-ByKe4OvFeryUaM85Zp9g":{"text":"Hands down, the BEST, once again, the BEST! The other \"Italian\" restaurants in the city ar","useful":2,"cool":0},"IqkHVk2qetxgAe0GHVwj_g":{"text":"Absolutely love Vincent's! We celebrate every special occasion there, and go just because.","useful":0,"cool":0},"fJoTDbzK4hItknpVz0AAvQ":{"text":"We have been coming to Vincent's when we are in town for the last few years.  It's a small","useful":0,"cool":0},"thsD6TeQsOWQNL_taDf7hA":{"text":"I've been here twice, and Vincent's just doesn't do it for me. Maybe I'm ordering the wron","useful":2,"cool":0},"z5yAOCZwNM1Udajd7AiDcQ":{"text":"I have traveled all over NOLA trying to find an Italian restaurant who could one up Vincen","useful":0,"cool":0},"mEz5iEmMPI7ZFxA8aEVQ7w":{"text":"Great food, really comfortable atmosphere, super courteous staff.  Could not have picked a","useful":0,"cool":0},"FpYIsko3fNKcICUZGvXgUQ":{"text":"Nice romantic ambiance. I had a pasta with grilled chicken which was good. My favorite was","useful":1,"cool":0},"a8j4L4fsx9umZ8owIAeqCQ":{"text":"Best Italian food I've had in New Orleans. Everything my husband and I had was delicious a","useful":2,"cool":0},"Ttl3_Pv-yuV4NUNvyaRDEg":{"text":"Hands down- my favorite restaurant in New Orleans.  I've been here twice and it's everythi","useful":1,"cool":0},"na8zpELeTogEq6pMqt5QAg":{"text":"Excellent Italian food and great service! Highly recommend. Reservations needed as the res","useful":0,"cool":0},"uZEbB02lnxHHeCApbAqzZw":{"text":"Food was fantastic. we ordered apps and entrees and everyone at the table enjoyed their fo","useful":0,"cool":0},"ht1WlSB2DqkWAp0o8isZUA":{"text":"Vincent's is an Italian-American restaurant right on St. Charles Avenue near the Riverbend","useful":3,"cool":2},"iIJ2yA373XUfo-fBh1wYfA":{"text":"Surprisingly good, location seems a little strange from the outside but don't under estima","useful":0,"cool":0},"GMJ3-_x6tlgJcLpRTROc8g":{"text":"I'm 22 years old with lower back pain(I know what's wrong with my body?) I came here after","useful":2,"cool":1},"DcQuqKF1SH7wnHMWX0j_6g":{"text":"I recently ordered a couple of pasta dishes for delivery and they were great! \n\nThe Italia","useful":0,"cool":0},"CjbNWe3j0QwDPhjMkL4Y0w":{"text":"this is a new orleans must...\nthe bread bowl bisque?  to die for\noysters rockefeller?   YU","useful":1,"cool":0},"74fPZjXYVx0OxIAZD-XNhQ":{"text":"The best italian restaurent I have ever ever been to. I love this place and have never bee","useful":0,"cool":0},"ApRN6ravFLlpf4bo1RyBhg":{"text":"Dined here for a birthday party, there were 12 of us. The staff were all great, and our wa","useful":0,"cool":0},"ymDgTBv07b0VaAp_hnEG6Q":{"text":"Always a great evening when coming here on date night. Forgot to make reservations (again)","useful":3,"cool":1},"_77lWyZOA0kwO4kU1zy2_g":{"text":"Great cuisine and ambiance. Waitress was a little saucy.\nHighly recommend a veal dish. Ver","useful":0,"cool":0},"Kv2zO-MzIHY5DUThMYYg2w":{"text":"Love this place. Love the ambiance.  Love the location. Love the food.  If you want a grea","useful":0,"cool":0},"AMOiuIeKPr-jHw_8Lkhyrg":{"text":"Chicken Marsala for 2, small Caesar salads for 3, Lasagna for 1 at lunch. 2 beers, 2 coffe","useful":3,"cool":0},"i0M_KCuS-_kO5ltgT6tT6w":{"text":"Do not miss this stop in Nola! The chicken parmigiana and chicken carbonara is absolutely ","useful":4,"cool":0},"Fn_0CewTxix2OZVTtFmJRA":{"text":"Okay, so it's a little cramped, some of the decor needs updating, and it's very expensive.","useful":1,"cool":0},"JSHfmJTxYNo3ACs-DhDqBA":{"text":"Visited New Orleans for a company trip on 4-11 and we were all so excited to try this plac","useful":0,"cool":0},"xGmy3mVejdyWqK3U_odaNg":{"text":"This place is one of those restaurants you stumble into if you are a local in New Orleans ","useful":0,"cool":0},"L-3BSKfu9qrT7yOJ0CTeAA":{"text":"Great place. -   great people, great food, great service. If you like Italian and red sauc","useful":0,"cool":0},"2v2aJehq5CC2aViex4_K-g":{"text":"I'm picky when it comes to Italian cooking. So, this is a rare 5 stars.\nThis is the restau","useful":3,"cool":2},"lSyZ3BwEjXE0MOaYkTp5gQ":{"text":"I've lived in Chicago my entire life and experienced not only living with an Italian Grand","useful":1,"cool":0},"Ol2wlVCDouWjDmUjY4CsGg":{"text":"This is my favorite Italian restaurant in Nola hands down! I usually get a heavier dish li","useful":0,"cool":0},"_J6eqFPqR2Wbs2rS2ogXYA":{"text":"Dear chefs at Vincent's, \n\nYou do not need to put ten cloves of garlic in every dish that ","useful":0,"cool":0},"g1QymieoxGtKCcCqVCgSzw":{"text":"I can only vouch for food ordered through UberEats, but from that alone, it's earned my pr","useful":2,"cool":0},"8uIddD4maEfoLTuKOEDL1A":{"text":"Well I was about to give this 4 stars (my old standby) but I just couldn't think of any ne","useful":1,"cool":0},"1RhQrqHq3q8Wi6dyVV6wHA":{"text":"Amazing dinner! My husband had the Cannelloni and I had the Chicken Marsala. This was our ","useful":0,"cool":0},"TVyMtU2kY9Uf2X_PWpy5yg":{"text":"We only get to visit this restaurant every few years but have never had a bad experience. ","useful":0,"cool":0},"dv-lloSJr2Ktd9nC0LQ3Kw":{"text":"Vincent's is the #1 Italian restaurant in New Orleans! The complimentary fresh, hot bread ","useful":0,"cool":0},"i4Uh-z5qXsipQz7TuKZopg":{"text":"My favorite Italian restaurant in New Orleans. The vibe and food are so authentic and it's","useful":0,"cool":0},"GRqL591f8dofEXjgDjAWdw":{"text":"This is by far the most welcoming Italian restaurant in new Orleans always a wait but wort","useful":0,"cool":0},"jhE1XvkgC9UrsVim_E-uFQ":{"text":"One of the great spots in New Orleans. Cozy atmosphere, great service, amazing food. Try t","useful":0,"cool":0},"lbrHfYm-Y_hgXz6NRGegBw":{"text":"The corn and crab bisque was rich, buttery and delicious.  The bread was average but the g","useful":0,"cool":0},"CysmT0ktKJh9wRFv0AcYRA":{"text":"All is well at Vincent's. The staff and the locals are like family. I usually order eggpla","useful":0,"cool":0},"y-YIRC2q1y9oGXftlRSuPQ":{"text":"Consistently great, and a staple for when you're friends and family are sick of all that \"","useful":0,"cool":0},"WU7-VOuR2lFKI1f9j5Gwbw":{"text":"This little gem is a great spot for delicious Italian food. We had a party of 13 so they p","useful":0,"cool":0},"g_0qBlT3fP0zPSDEnp7GRQ":{"text":"July 2020; Masks worn by all employees. Yay. We were greeted by the spunky and friendly Ge","useful":0,"cool":0},"8QXQfx0ABwVvVdssR-9RLw":{"text":"All is well at Vincent's. The staff and the locals are like family. I usually order eggpla","useful":0,"cool":0},"BVPIVOqBkHwrVF0e9v5DdA":{"text":"Food is fantastic. Staff and owner are very friendly. Stuffed porkchop was great, wife cou","useful":0,"cool":0},"Q2BMuNUQMJga_eFJhjEjUQ":{"text":"5 stars because in my opinion Vincent's may be the best Italian in NOLA. Sunday evening 6 ","useful":3,"cool":2},"QHl0IZvJjTuehZiPiiFWhQ":{"text":"I lived pretty close to Vincents for a while so I decided to go in with my mom on a whim. ","useful":0,"cool":0},"cV7UzKTzdRGS9rkGe6DrvQ":{"text":"PERFECT GO TO WHERE YOU GET YOUR MONEYS WORTH! \nMy boyfriend surprised me with a New Orlea","useful":0,"cool":0},"LCBN4U0T-KtqzOUJJwPzNw":{"text":"Horrible experience. The waiter sat us down and took quite some time to place our order. D","useful":1,"cool":0},"PTYrsMkhC7n2cJwKnG_7wg":{"text":"Vincent's is a staple in New Orleans Italian cuisine, the service was efficient, the food ","useful":0,"cool":0},"nqOL4v9d09BxPmWUk9RyvA":{"text":"Great food, service but most atmosphere. The Cannelloni was the best I have ever had in th","useful":0,"cool":0},"iPQ_GoXHGpDEeF22iZvvHg":{"text":"Just back from 3 days in NOLA. Hesitated due to COVID, but after rebooking twice decided W","useful":4,"cool":2},"T9waoOazipxqFlPvb6kdOQ":{"text":"The flounder was exceptional last night and sitting at the bar is always fun. Margo orches","useful":0,"cool":0},"eskdXLRYEwYB5xxEs_YKqQ":{"text":"Best Italian in town, hands down. The service is outstanding! We were a group of 5, then w","useful":0,"cool":0},"zgtwq3j7jnCDxIrJJFjAQA":{"text":"Vincent's is absolutely delicious!  Love the food.  Love the service.  Very cozy and comfo","useful":0,"cool":1},"3q-6EEIv16FHK04UckuR0Q":{"text":"Italian food really isn't my thing.  People think I'm crazy or something for saying that, ","useful":3,"cool":1},"B9FphQrIJG3uvZbGAlr7BA":{"text":"This place was the best decision I've made this entire trip! (to New Orleans) food was ama","useful":0,"cool":1},"sR31_BFnkl_6bHaXVCbe9w":{"text":"I have hesitated to post this review....for completely selfish reasons. This is a restaura","useful":2,"cool":0},"WbQPXVNCzD26LOdNeH_4VA":{"text":"A bit cramped. Delicious food, friendly staff, and a nice atmosphere. Everything feels fre","useful":0,"cool":0},"z2NNe-aJFSp6ic9czLIlNw":{"text":"LOVE LOVE LOVE Vincent's!   And Tony!   The St. Charles location is our go to place for It","useful":1,"cool":0},"ImNSBUpcQeIHQNzDxMst9g":{"text":"Vincent's is always such a treat. This was my third time visiting in a year and, unfortuna","useful":1,"cool":0},"_qmAvm6_PRzXT9F_Xts2mg":{"text":"One of my favorite neighborhood restaurants. The food is great, especially the crab and co","useful":3,"cool":1},"ulSIA64AmBAgeOCy7M75rQ":{"text":"Italian food as good as anything you'll find in the north end in Boston. The chef will add","useful":0,"cool":0},"zltdjSynRtbHj4dJXNbx_Q":{"text":"Lisa and Sebastian made the entire dining experience even better than it could've possibly","useful":0,"cool":0},"aixbWI_X4Q03f-vHT5ZSSA":{"text":"The consistently fantastic food and impeccable service has made Vincent's one of my absolu","useful":2,"cool":0},"e38UkXyHv3L_VqsDcj1fXg":{"text":"Expensive but excellent food. Right on the streetcar line. Traditiional red checker cloth ","useful":0,"cool":0},"JshjdRBHpY_oY0keJ5c1dA":{"text":"Everything I'd hoped for and more. This joint deserves to live forever. Serving size is ju","useful":0,"cool":0},"ZPQW7NdIqNap6QfhJ2yxRw":{"text":"2nd time here and it did not disappoint. The service was stellar and the food was amazing.","useful":1,"cool":1},"xzystvuYTVyGFf0SUfqZxg":{"text":"Great environment great food exactly what a Sicilian owned restaurant should be. Will be g","useful":0,"cool":0},"P8M_g-bqDkKuCks5LEKJRg":{"text":"The best Taramisu in the city, hands down. Get one & split it. Plenty enough for two.","useful":0,"cool":0},"iIcCLYP4D4PanTbm8yb_Bg":{"text":"This little place was amazing!  It's the best Italian I've had in New Orleans. We ordered ","useful":2,"cool":1},"oHUTpIoDAPdy62pLQUk7QQ":{"text":"We were there on a Tuesday night and they were packed.  Our server was a bit scattered and","useful":0,"cool":0},"wndtFKPBvSno4bfq95Fwpg":{"text":"The best Italian food in NOLA. A large menu offered something for everyone and each dish w","useful":0,"cool":0},"GReptWKfUu1YtuBnk1j_qQ":{"text":"Happily joining the ranks of the five-star reviewers for Vincent's.  We got take-out on a ","useful":0,"cool":0},"bK5AxTxerG3sdrJrsnWe6w":{"text":"We've been here 7 or 8 times over the past 35 years (we don;t get to town much.  Vincent's","useful":0,"cool":0},"wF2c0Cawq2y9ILdH126-iA":{"text":"Recommended to check this little place out by a friend who is a frequent visitor of New Or","useful":0,"cool":0},"PPgVb5tmSjmzqZWW7yizCw":{"text":"Food is truly so delicious. I got the Shrimp Alfredo and it is soooo rich! I was able to e","useful":0,"cool":0},"8gIyTRKYdlC4JiWBdrjpdw":{"text":"So good every time! Ive been three times now always order something different, and its alw","useful":0,"cool":0},"KDBDsQ0jihefdcMl-6rBqA":{"text":"Landed in New Orleans and headed straight for Vincent's restaurant on Saint Charles. Order","useful":1,"cool":0},"6bk0cQHp2wVoLqUPH9ibpQ":{"text":"By far the best Italian food in and around Nola that I have visited so far. Would definite","useful":0,"cool":0},"HA4wCtQW2Bw5wxDUBjQgqw":{"text":"Best Italian in the city! Great ambiance, impeccable service, AMAZING food.","useful":0,"cool":0},"O-ZTyisaO1fRIyfadT3ssA":{"text":"Awesome place.  Service was great and Chef came to tthe table to make it even more special","useful":0,"cool":0},"DE2cQdQ-9tnsr4fcQ7bb6Q":{"text":"Went here for lunch. They had fresh soft shell carb and it was perfect. All the other entr","useful":1,"cool":0},"5pMPHW8-y8VZxKj82ojswA":{"text":"This is one of our two favorite places to go for dinner (we're locals).   The crowd is fam","useful":2,"cool":0},"6QRYss_RnM_C-3tuxET--w":{"text":"Hands down the best place to eat in New Orleans! Staff is amazing, food is amazing, enviro","useful":0,"cool":0},"bFw-DkCWlxscYdAIgS-2eQ":{"text":"Delicious meal and great service. The host was super accommodating when we got there late ","useful":0,"cool":0},"ofxzzPSgo_wtJx7TjLgu_g":{"text":"I've been putting off eating here for a while and finally decided to just do it! We arrive","useful":2,"cool":1},"Uu_fZfwrhdShLzytmjb6bw":{"text":"Great New Orleans Italian Restaurant.  We have been many times.  Everything on the menu is","useful":0,"cool":0},"cXOXaApCgQclOBEyAnqtZw":{"text":"This is a long time favorite of mine. The food is always A+ and the service is great. Good","useful":0,"cool":0},"ZDsiq3LE6L4BuIW7cK-RDQ":{"text":"This place was simply amazing. \nI brought one of my best friends here and she feels the sa","useful":3,"cool":1},"74oh2J_Ol2JpFXowSs3m0g":{"text":"One of the best Italian restaurants in the city of New Orleans. Period. \n\nEvery meal that ","useful":1,"cool":1},"bRBaChAR_hWNju36sxyO6Q":{"text":"I have been coming here off and on since it opened in the 1990s. (I remember when it was C","useful":1,"cool":0},"oyc8T1qIs0UOP1KMU28efw":{"text":"HORRIBLE service. The meatball was an overcooked ball of mush. The bread was cold. Our ser","useful":0,"cool":0},"0dI_wKkQQKp0C9J2MToAbQ":{"text":"Yum! Family fav my entire life. Not too expensive and extremely worth the parking. Delicio","useful":0,"cool":0},"ggiZIh5D7gwe-7c90P1AjQ":{"text":"My daughter had moved to the NO area and we came in for a visit and she took us to this pl","useful":0,"cool":0},"LN8INPtULhAkWW0JLP6jIA":{"text":"Great Neighborhood Sweet Spot. Authentic, light, old-school New Orleans Italian cooking. F","useful":0,"cool":0},"FfegZnJf3YfRaJQocmyX5Q":{"text":"We had the beat experience at Vincent's for our anniversary. The service was wonderful and","useful":0,"cool":0},"rob4Jti0OCQIXp2n5hR8Sg":{"text":"This has been a staple in my life. Grew up going to Vincents for family dinners and celebr","useful":0,"cool":0},"MvO_5DHmNUhMuBnJg2Lc8g":{"text":"This spot is delicious! Great service, wonderful food. Our server was Ray and we couldn't ","useful":0,"cool":0},"fydERcys8g1D57mRisHP9A":{"text":"A group of us ate at Vincent's Uptown back in June for a friend's birthday. They had no re","useful":0,"cool":0},"tk2RcxdZMKr-PvSDk70ijA":{"text":"I've been hearing awesome things about this place, but I'm not a huge Italian fan.  Let me","useful":3,"cool":0},"aE-5UCnhnkAFwnpiC_FDJQ":{"text":"I am a sucker for Italian food, men and shoes!!\n\nThis place exceeds all expectations. The ","useful":3,"cool":0},"7kdL3Ij2BGV8CkJ5EAeJjg":{"text":"Tony and the staff are absolutely incredible. Robert is my usual server and he gets everyt","useful":0,"cool":0},"i4Jh_yDlp92sBnnLiqe2MQ":{"text":"Fantastic restaurant with great food! We had a great time. 11 Lemon Drops and loads of foo","useful":0,"cool":0},"6ultl92kN7nSGFImJEo7og":{"text":"I needed to get my Italian fix which was long overdue and I like to tell myself that carbs","useful":24,"cool":11},"hkg1HhEkVcpqxUwHyx0I6g":{"text":"Vincents Italian  Cuisine  New Orleans is one of our favorite restaurants the staff is alw","useful":2,"cool":0},"2WT-_O8TMBSg7dQBMObn-A":{"text":"This place serves good old-fashioned Italian-American chow. There's an extensive menu, not","useful":0,"cool":0},"xNkdTDx6yP5wnXi_xRa6Uw":{"text":"Old School Italian dining at it's best. The food was great the service was on point. The a","useful":0,"cool":1},"L3ODXAgcXhAiSmPpprm0bA":{"text":"Unfortunately it was mediocre tonight. \nI know they can be 4****\nThis is usually my go to ","useful":0,"cool":0},"1fGzLNAPxbkivahZWzUMew":{"text":"This was the most authentic Italian we've ever had!\n\nThe atmosphere is very inviting with ","useful":0,"cool":0},"LpUOBA3CXyKsnT50Z9K0hw":{"text":"Vincents Italian Cuisine is always excellent! I have never had a bad experience, no matter","useful":0,"cool":0},"--vIgjoF3j5piU5i8GMWMA":{"text":"So so so so good!!! The food was amazing & the service was wonderful!! The workers are fri","useful":0,"cool":0},"frKyynPGPNjP645T9u8DyA":{"text":"Food was pretty good, very tasty. \nService had a lot to be desired. Robert was our server.","useful":0,"cool":0},"XWl3WRZju97siZnEeagLHw":{"text":"The food at Vincent's is always great and the service is stellar.  My only complaint is th","useful":0,"cool":0},"3BjJTqNBhz_gDQNauFAO7g":{"text":"This place was perfect, Mr. Tony was so cool and the waiters were very much on point, it s","useful":0,"cool":0},"-qFsUy6WZmfj7glCxmRnzQ":{"text":"Old school and classy Italian joint at the edge of St. Charles.  Very good Veal Marsala.  ","useful":0,"cool":1},"u7cHEcRaXl2gzg1jxDixaA":{"text":"I have lived in New Orleans for going on 12 years, and I am kicking myself for not coming ","useful":0,"cool":0},"dHlyj7JHYLBvhzPs3B08lw":{"text":"Charming, dimly lit restaurant with beautiful Italian food. Would definitely return again.","useful":0,"cool":0},"EHJ_LJrltN5zt38uerHO6w":{"text":"New Orleans has some of the best restaurant's in the country.  You don't really think of N","useful":0,"cool":0},"4Ohxi0xDwmz5TuzHQam--g":{"text":"Totally Wonderful Experience - - - My wife and I dropped in on Sunday evening (10/13/2019)","useful":1,"cool":0},"8n9bNQ4CoZXPNgQrKY8UCg":{"text":"This is one of my favorite Italian restaurants in New Orleans!! The corn and crabmeat bisq","useful":1,"cool":0},"MfbYzqvfMBrx8hm8uekfbg":{"text":"Well I need to update the last part of my review. I had an incredibly disappointing experi","useful":0,"cool":0},"LnN8Wu6tJtlgJC-xL2KyBg":{"text":"So lucky to have walked in this great restaurant Valentine's night for dinner. Seated at t","useful":0,"cool":0},"5cR9eXpHCIjIyjslJFLkIg":{"text":"Great food, service but most enjoyable was the atmosphere.   Tony was a very comfortable, ","useful":1,"cool":0},"V-Fok9_ZbrDQFmETlr7kXg":{"text":"You can't got wrong with Vincent's. I can't believe the quality of the food you receive fo","useful":0,"cool":0},"2Ws5r81OrmvCDX7kFOWQvA":{"text":"This is my second visit to this wonderful city and I've tried a numbers of places but this","useful":0,"cool":0},"OYlAfaoqcrv3WJnrETOokw":{"text":"Great food, service but most enjoyable was the atmosphere.   Tony was a very comfortable, ","useful":0,"cool":0},"l9bhy_mgnux_gAWtTD8UXg":{"text":"Had to write a review about this place so everyone knows to eat here! I think I'll be drea","useful":0,"cool":0},"MuX_IpRXlsN-2zl4komCYw":{"text":"Order the chicken carbonara!!!!! It's literally the best carbonara I've ever had I wish I ","useful":1,"cool":0},"mcHs8NujQvkHMKUMXOwV1w":{"text":"Amazing food and friendly atmosphere. Tony runs a great restaurant with great service and ","useful":0,"cool":0},"UpAKs1gygBuTd7Fwbvpbqw":{"text":"It's a Friday night and my wife & I think we have reservations at 7:30pm. When we arrived,","useful":0,"cool":0},"cedy2w5g2a71W56z6f7YXQ":{"text":"We had a horrible experience at this place tonight. We had heard a lot of great things abo","useful":1,"cool":2},"-gAKpPw1t7YPRT0I9BR92A":{"text":"I'm soooo not the Italian cuisine fan. We went here for my cousin's birthday, and I'm glad","useful":2,"cool":0},"b7ZLTEb7rniH9SDCQkJDgg":{"text":"After ordering our food on Uber, waiting an hour + (which was expected) we get our shrimp ","useful":0,"cool":0},"unbTYTzAWvFDYmfn39Sz3Q":{"text":"Very negative experience with the waiter Shon ( or Sean). Stay away from him. Also Sunday ","useful":0,"cool":0},"bVzGhd3zrVqO6Vr0TdBahA":{"text":"All is well at Vincent's. The staff and the locals are like family. I usually order eggpla","useful":0,"cool":0},"UmN9RmHcrAFNOtBIWKSWvQ":{"text":"All it takes is Brian to make it wonderful. Great dinner and service tonight for my nephew","useful":0,"cool":0},"9Yp3u1Y2Kgc1kbyevQkd7Q":{"text":"Heard the food was great but . . . Salad was soaked in oil- no vinegar in the Salad dressi","useful":1,"cool":0},"ey5kbfa6qCRMDoET4B3hUw":{"text":"If I could give it 10 I would. Amazing escargots, salad wit blue cheese vinaigrette, corn ","useful":0,"cool":0},"acAuGrEkGQLNVSCHOEtn_Q":{"text":"My wife and I were on a celebration getaway to New Orleans, and we wanted one splurge dinn","useful":0,"cool":0},"1mDdxvMxC520izfVTVSmKQ":{"text":"GREAT PLACE FOR A BIRTHDAY LUNCH!\nI like Vincent's midday because it's more casual and slo","useful":5,"cool":2},"3WhvAG5nNhYrcn1uFnpX1w":{"text":"One of those old traditional New Orleans, so you can't go wrong. The food was not exceptio","useful":0,"cool":0},"8Rl_OKm8wrpQG3J-GxqSBg":{"text":"My friend and I ate last night at Vincent's on Saint Charles Ave . I had the squid with bl","useful":0,"cool":0},"2Xjq4cj_5f0Pck7TlXJSHw":{"text":"Spot on! My boss recommended that I had to try the cannelloni dish. I did. It was nothing ","useful":0,"cool":0},"oqEZmZ5e5KwAMjVVQoIB_A":{"text":"This is some of the best food I've ever had. The atmosphere is very nice, potential to be ","useful":0,"cool":0},"XvjsQS-RSQaVhERFGOQv7g":{"text":"Fabulous food + ambiance.  So much bang for your buck and the best part is that this is a ","useful":0,"cool":0},"q3ocPYTLFLWcpk-0Nzm1Gg":{"text":"Daaaaalish!!! Went here for lunch last week with a coworker. When i walked in, it felt ver","useful":1,"cool":4},"_sZrQm6zwjFF7UbtuG4lRA":{"text":"They are always a hit. Go with an open mind and just ask the waiter for suggestions. Take ","useful":0,"cool":0},"5t9MwhZDMOZwMc_b7M12Ww":{"text":"I went to Vincents as a group of 4 and we were able to make online reservations at 7:30 fo","useful":1,"cool":0},"36Jch-uUSVABgEOVkIFnVQ":{"text":"We continue going to Vincent's, and they continue to delight and wow us. They are the best","useful":0,"cool":0},"xDhbxMz93UBBqEmp_mhCCg":{"text":"Vincent's has long been one of my favorites, but the food on our last visit was not as goo","useful":0,"cool":0},"MDAcrFppQm6v7cphebeeKg":{"text":"A LOCAL FAVORITE \nI recently moved to the big easy a few months ago and was told by so man","useful":1,"cool":0},"v0j-r_ITCcPB_NDWcvkH5A":{"text":"The best meal I have had in New Orleans since moving here two years ago. We facécia overal","useful":0,"cool":0},"CUsmhpz_lyNFKucjOIXUsQ":{"text":"I so wanted to like this place, but it's a dump.  Food is under seasoned, over sauced, and","useful":0,"cool":0},"PI_sSKTxyWV-zxbENxuYqw":{"text":"We were hopeful after reading good reviews prior to our trip to New Orleans. But for us, t","useful":0,"cool":0},"V5z1kGaxzqx7A7KV-eIWSg":{"text":"Went here last night for the first time in about 10 years. I can't explain why it's been s","useful":1,"cool":0},"Wc7N18Wf3CfkCp8DR6fzXA":{"text":"horrible! ordered chicken marsala and the chicken was very tough. very disappointed as i h","useful":0,"cool":0},"-pShOVaxSE-ceXlAi9tXKA":{"text":"Love this place.  Everything is delicious.  Parking can be tricky on St. Charles.  Service","useful":0,"cool":0},"O89vuIeYvgSaa5Z2zWEMtg":{"text":"This was an AMAZING dining experience. I recommend making a reservation although Tony will","useful":0,"cool":0},"R02-HhxoBleXwjZJchPP8g":{"text":"We celebrated my friends 40th birthday here. The food was fantastic and service even bette","useful":0,"cool":0},"oCydameTjWBImvG-DwwXPA":{"text":"Alwaysss a good time at Vincents! Amazing delicious Italian food, service can be better bu","useful":0,"cool":0},"y5oFJQjCWA5rvo4b2zFd9Q":{"text":"pre COVID, i had been to Vincent's many times and enjoyed every bit of my experience. i mu","useful":0,"cool":0},"VbwUTTg9s3xvoPafCH5EFQ":{"text":"This is a pretty awesome place! I was really surprised to see a non-chain Italian restaura","useful":2,"cool":1},"c3eMIGh3DdLCdCvP9sFfMA":{"text":"this place brings joy just thinking about it. it has so much character. went here for my o","useful":1,"cool":0},"TZqDRC39GrfKoZS621WwAg":{"text":"I went to the Vincent's in uptown first and the food and service was amazing, but the one ","useful":0,"cool":0},"ETefFnt8rUVjxG420ACv1w":{"text":"Really nice restaurant with a home vibe.\n\nHighly recommend the blue cheese vinaigrette dre","useful":0,"cool":1},"SCvvv4ZmYdmZrVb7YN00JQ":{"text":"TODAY I WOKE UP CRAVING VINCENT'S CANNELLONI!\nand I am a cannelloni snob. Cannelloni is th","useful":5,"cool":3},"xtBSdjHvxPTo8s4STiFcdg":{"text":"Great New Orleans Italian Restaurant.  We have been many times.  Everything on the menu is","useful":0,"cool":0},"EMfQzU1H-l2tcd17FiFTqQ":{"text":"Eggplant Parmesan was excellent. Dinner salad with blue cheese salad dressing was amazing.","useful":0,"cool":0},"81g-iTu2EMIRk1Z1hVt0eQ":{"text":"This place is classic Italian from the decor to the wait staff.  Food was grand the Veal M","useful":1,"cool":1},"SDnREMst8mghCr0P2h02gw":{"text":"Vincent's was recommended to me by a local friend so I had to try it.  It is now my new Ne","useful":0,"cool":0},"w3-uU6t9A1HSI4qDG0OT0A":{"text":"Amazing!  We were diligent in tracking down the best Italian food in and around New Orlean","useful":0,"cool":0},"NpjZdCrY4U0Wgxw1rVXkdQ":{"text":"This is a Real treasure in Uptown!  Watching  Sir Tony work was a show in itself,  and the","useful":0,"cool":0},"Yx4NbyZy7wvPRDTLE_pcjw":{"text":"One word-Rosemary chicken. We've been going here for years and I've  now discovered this d","useful":0,"cool":0},"pwpJJEQFVYSVlA32Lwer6w":{"text":"Food-4\nAmbience-4\nService-1\n\nIt was my 21st birthday, and I wanted to go to a nice restaur","useful":4,"cool":1},"rsPn9G2hhxJ-N2NBXqFg-A":{"text":"The idea of this place is always great, the delivered product disappointing throughout.  P","useful":0,"cool":0},"2AKbUDWpJLLHaLne5-OiYQ":{"text":"Excellent as always - red sauce, white sauce, vodka or carbonara. Can't go wrong! Very nic","useful":0,"cool":0},"FNfZ-IRRQMWbHdykYh-2Ww":{"text":"Este restaurante es súper romántico, la comida es italiana deliciosa, mi piace molto, tien","useful":0,"cool":0},"8EenzVTrwISBkCSBQTAFaQ":{"text":"We just happened to see it while on the St. Charles streetcar. It is well worth the long d","useful":1,"cool":0},"56MCMv2kw9O3yNxwOb75tg":{"text":"This may be our new local Italian place!! We made a reservation for 6p on a Thursday and w","useful":0,"cool":0},"PUfQ-TutEJj-wfXPdx_a7Q":{"text":"Vincent's is my go-to when I want something reliably delicious. I prefer to eat mostly veg","useful":1,"cool":0},"O-8ijHjCeKJBM-KTVwe6xw":{"text":"Always a great experience with great Italian, both your standards as well as their special","useful":0,"cool":0},"n6fi0Tte1FbmCr8ZYYXqqQ":{"text":"Thank you Yelp community and everyone at Vincent's for one of the best meals I've ever had","useful":0,"cool":0},"XkOx3NsWiBVK1yIBUluLag":{"text":"Best service and best Italian food in New Orleans...and that is saying a lot!!\n\nLove the a","useful":1,"cool":1},"vlkwrNqUQOC_3KbMGVGD9g":{"text":"Interestingly enough, it seem that it is hard to find a good Italian restaurant in New Orl","useful":1,"cool":1},"SotxHjE95vE_O3S4UZkjdg":{"text":"The food was so good and great service!!! The place is cozy and perfect for a date night!","useful":0,"cool":0},"6zZGU7SBHEkMutyf-xDJPQ":{"text":"I really enjoyed my two visits to Vincent's. The waiters and host are very welcoming. It's","useful":0,"cool":0},"JBpsnGfuSlY3auCaPkkuXg":{"text":"Vincent's is a New Orleans institution with every right. It's old school, with a warm and ","useful":20,"cool":12},"Tkw2BWPoeWDNUovCPgNOZA":{"text":"Good meal. But over charged us. Veal chop was a special and we were charged full price.","useful":0,"cool":0},"V3pBE2SjyPIPsOsPLsab6g":{"text":"Rock N Roll New Orleans weekend, had a group dinner here.  I made sure to make a reservati","useful":0,"cool":1},"SY_yuUM8063S-6zj4IURPw":{"text":"Although one of\nMy very favorite spots in New Orleans , our experience in June 22 was huge","useful":0,"cool":0},"dFHOQsMg0s2VmYRr_D9P9A":{"text":"Always delicious, always crowded, always great service! I think the seafood dishes are as ","useful":1,"cool":0},"g-jInvr1ihONp6C9mycWmg":{"text":"The food and service are always great. \nHighly recommend. \nSay hi to Tony when you go","useful":0,"cool":0},"kRAZ1ZwmTGeiOQwIM6Q6hQ":{"text":"OMG. Where to start?  \n\nI've been coming to Vincent's for years, and as a local Italian, I","useful":6,"cool":5},"8d8wXmD1VWmfGWn_n52v4Q":{"text":"Wonderful restaurant great take out veal Robert and Marsala done when I got there. Support","useful":0,"cool":1},"lxKD1t-fgesBvWoOhrSQOg":{"text":"Quaint restaurant that gives you that real Italian dining experience.  The staff was very ","useful":0,"cool":1},"L51H7pGeQStOdH0epTHozw":{"text":"Food, atmosphere, service... outstanding. We are thrilled to live around the corner but if","useful":0,"cool":0},"BtPAGodpb6jYMgH9NQWhYQ":{"text":"Always a delicious meal with wonderful flavors and textures. Chef is truly a master at his","useful":1,"cool":0},"GWPTk_hWaURoHvjIK6_sOw":{"text":"Service:  5 star\nBread:  2 star.  Italian restaurants should have good Italian bread and r","useful":0,"cool":1},"GO8GofeOnv8ZoQyUBoLR3A":{"text":"Service and ambience were soo good, but the food didn't hit the spot for me. It is truly a","useful":0,"cool":0},"GBQy8Q3iI2e867dRLwJShQ":{"text":"Vincent's serves excellent, traditional American-Italian food in a very cozy and intimate ","useful":2,"cool":0},"MEXkMbp9LgyXHQh-pTfSQQ":{"text":"So disappointing.  We were looking forward to this dining experience so much. The food was","useful":1,"cool":0},"Mg2njjRqGEGmjz2sPkV2UA":{"text":"Get. The. Alfredo. \nIt seems basic with all the amazing things on the menu, but you'll nev","useful":2,"cool":0},"58ekFj34cU4ysFxq6Ray9Q":{"text":"I was excited to try this restaurant based on curb appeal and reviews. Place was super coz","useful":0,"cool":0},"PpDXmR50B_OotosC0TfxzQ":{"text":"Service staff very good (5 Stars); food (4 Stars). \n\nWhy the 1 Star? Management!\n\nSubjecte","useful":1,"cool":0},"hrXNhIiiEs7jjf31i4P04w":{"text":"The best meal and experience I've had in a long time. Celebrating a birthday--we indulged ","useful":0,"cool":0},"PtMCFi-dqu4h2kf2S8Bcig":{"text":"We were in the area and decided to stop in on a Saturday night.  My wife called ahead to s","useful":5,"cool":4},"gVy6rgn70UzuAAMXZQT2yw":{"text":"Came here recently for dinner.  Right when my date and I walked in, we were kindly assiste","useful":3,"cool":1},"OivJom7KBTLkx1DBB2scGQ":{"text":"Best Italian Restaurant in NOLA! We had a party of 4 this past Saturday night, no reservat","useful":0,"cool":0},"NZbj2iwMIG-yxKJRolooQg":{"text":"Went here for date night and all of the staff was really sweet. The bread was fresh and wa","useful":0,"cool":0},"TTnZbIayVhzG5agGyK7eng":{"text":"Fantastic food, service, and atmosphere. One of our favorites when we visit NOLA. Look for","useful":0,"cool":0},"-i8hs0umScQKDimScz6hlA":{"text":"Excellent old school Italian restaurant with great service and delish, comfort food. Great","useful":0,"cool":1},"I0Im6ggNVYlDcCeaMIvgTQ":{"text":"Definitely make a reservation in advance. There is not a lot of waiting space and it is al","useful":1,"cool":1},"6dC9rgRp81CqE6myG1lUCQ":{"text":"Cannot grasp why people are calling Vincents authentic Italian food. It's giving airplane ","useful":0,"cool":0},"8GrLNQKRx_ONvkPy816QcA":{"text":"Amazing food....corn and crab bisque is a must every time I visit.  I have tried many item","useful":0,"cool":0},"lY2iAwQneXBo9j8zh47Q8g":{"text":"I've never given one star to any place on Yelp but this one takes the cake. I am absolutel","useful":1,"cool":1},"c9K0w6O-aFaX7h_QjCY2Gg":{"text":"Amazing people and service! Went above and beyond to accommodate us without having a reser","useful":1,"cool":1},"zaVQlKDZI-J0V746Me14BA":{"text":"Went here on a regular date night with my partner and we unfortunately were slightly late ","useful":1,"cool":1},"SSoWod-6vl_ukc24mTEcwg":{"text":"I stopped in here for dinner a little while ago with my girlfriend and the food is...good.","useful":1,"cool":1}}