{"lxDU4ymDnOK5vqYYotVtHg":{"text":"One of the highlights of our trip! We had David - In his purple suite -  and he was one of","useful":0,"cool":0},"igP8twsPAgkNlMLpCnK15w":{"text":"A nice way to view the French Quarter. Our mule was Zulu and her driver was Ed. He was gre","useful":0,"cool":0},"ZZzzlvCSmd5Z6ml2TeDYOA":{"text":"Nice place to reserve mule pulled carriages for tours of downtown or hay rides for kids bi","useful":2,"cool":0},"xCIDSoyzPoMJ1a8ziAc7JA":{"text":"This business offers carriage drawn service. Drivers are at Jackson Square but you can res","useful":4,"cool":0},"xjqLci8O_alP2sGH0Z5_ag":{"text":"On November 23rd. My son and I took a ride on one of your carriages. The carriage number w","useful":4,"cool":0},"SAQtTegHdMp_1h-dLBRE2g":{"text":"This is a great way to see the French Quarter. David was our guide and he was very informe","useful":1,"cool":0},"gnKN5lOBFsie4pO6dmh4Vw":{"text":"Mules have more grace than the operator I interacted with.  Told me she was on break for 5","useful":0,"cool":0},"iUwlbzRWQJMHX7Tmw8_eCA":{"text":"Horrid treatment of the animals. Do not waste your money either. Driver was a rude and unf","useful":3,"cool":0},"OUWUUtbg4roSfYSTJz6pDw":{"text":"Only gave one star because zero isn't an option.  Driver of carriage 14 is a prick and zer","useful":3,"cool":0},"AtlSbSoEjcALY5IKDmP2mA":{"text":"It was already a Merry Christmas Eve when we were picked up by David and Baby Girl for a g","useful":0,"cool":0},"N6ARowQebfgk7WJGM_fCaA":{"text":"Adam was our driver and we had a great time. Very informative about old New Orleans.","useful":0,"cool":0},"OJZEdAAx1rB5K5nHw39Igg":{"text":"One word...Chica!  This is certainly worth the 30-45 min tour of the French Quarter withou","useful":10,"cool":9},"Om-Hd6CHigGZRNJMCo-NWw":{"text":"Sally was a great guide throughout the city and Liz out mule was adorable. We took the 30 ","useful":0,"cool":0},"FupZz_Xfth6TB9fEifglMg":{"text":"I have done previous carriage rides here over the past 13 years.  I was looking to have a ","useful":0,"cool":0},"P8Gc0iGc4EOkWlUOf2tHTQ":{"text":"Memories are amazing things, the best ones are the foundations of what is yet to come ... ","useful":4,"cool":4},"9kXCdGTZ5m7dTxhJrCFk6g":{"text":"CASH ONLY - $20 PER RIDER (Adult or Child) - COLLECTED AT END OF RIDE. \n\nThere, you've bee","useful":9,"cool":9}}