{"RhdFK-nNLt7sZE1N4rWKDA":{"text":"A must stop in the Bywater. Tender brisket tacos are my fav. Great homemade sauces and an ","useful":0,"cool":0},"pPHX3fvmPpD2RubpBlX0og":{"text":"Favorite place in town. I go here every weekend. Their tacos are fresh, homemade and by fa","useful":0,"cool":0},"xYfPcgnfhrQJTOOaIAIVYA":{"text":"Delicious! \nMessy, in a very good way.  Come hang out in the Day of the Dead - themed alle","useful":2,"cool":1},"Gh1SpwZ_as-H0z4gc-3bJg":{"text":"Amazing tacos with an amazing outdoor atmosphere. had the specialty chicken taco, pork tac","useful":0,"cool":1},"0JwfY0rxjz3G3pA_OJBStA":{"text":"Wow! I will dream about the brisket tacos. You HAVE to get one if you come here. What a hi","useful":0,"cool":0},"YFXerfcKTBr6JhPtSXBmtw":{"text":"I should be able to add at least 2 stars to this review.  Because this place is absolutely","useful":6,"cool":4},"MbykHH8TN60Ua31mR-PiTg":{"text":"We found this place on yelp and he to try it with all the 5 star reviews. They did not dis","useful":0,"cool":0},"G5qRLexffODAp7c6IHI9xA":{"text":"This place is fucking solid. Come eat here now. The chicken adobo and brisket are my favor","useful":0,"cool":0},"LDAYM26D6ZOdWUPbs4Nv3g":{"text":"The bomb. We were staying at an Airbnb nearby and stumbled upon it. Yummy yummy yummy taco","useful":2,"cool":1},"sGw0lVQvwZhC-GSGxxo_NQ":{"text":"I am scared to write this because this is a find that I don't want to change by sending a ","useful":16,"cool":7},"bHoGvLXVBqPSXESLZZ3zeA":{"text":"I ordered the veggie burrito and the black beans tostadas. The burrito was so big that I c","useful":0,"cool":0},"lZNx9ddFEbJ6MgifsrrUMQ":{"text":"This place has amazing tacos! It's definitely a place to take food to-go or to not mind ea","useful":0,"cool":1},"jo68t0cr2SHvvvpIGQ8btA":{"text":"The hot sauces to select from were not spicy at all. The tacos lacked seasoning. The rice ","useful":1,"cool":0},"XWs3LfPFf0BAue1hLwIcQA":{"text":"I really wanted to love this place, but I didn't. The backyard is over run with chickens! ","useful":0,"cool":0},"uNH0nBi9exBfnARxKSEXmQ":{"text":"Delicioso!!!!!! Amazing tacos! Great hot sauces! Really friendly cool couple/owners! Dont ","useful":0,"cool":0},"GE2hRD1bofRfPeg9jw1PlA":{"text":"Nice little ducked off spot. Best authentic Mexican flavor in the Bywater. I really enjoye","useful":1,"cool":0},"kpbnckSE1MxI2PxTxaxCEA":{"text":"This was my first time e but won't be my last . So good , fresh and authentic.  Can't wait","useful":0,"cool":0},"RAXIhvAvEnJmWTyTsfIcTQ":{"text":"Favorite tacos in nola. Tried every type of taco and the taquitos. Dig them all. Also grea","useful":0,"cool":0},"NnjuZvRXN9e8fV_HYCMI5w":{"text":"Possibly the coolest place I've ever eaten! \nIt's tucked away in an alleyway filled with a","useful":2,"cool":1},"jzXPtqinD4pPA4muvryZ3w":{"text":"My friend and I come over for dinner. [Am new to NOLA and she invited me to her favorite s","useful":1,"cool":1},"XX0M_uuv3N8HEsJZiQpLKg":{"text":"Delicious, inexpensive Mexican food. The chili relleno was probably the best I've had. We ","useful":0,"cool":1},"0LuKFF1BF6zGnnnSiU2n-w":{"text":"The food is incredible; everything was fresh and savory. The staff is very friendly. The b","useful":0,"cool":0},"TjgKSvB91rJ3WCh_BOlQYA":{"text":"It was my first time visiting Rosalita's new brick-and-mortar location and I'm thrilled to","useful":0,"cool":0},"CMIsvxASOKrm4SUcYrORcQ":{"text":"I've been wanting to try Rosalita's tacos for a while now. I finally did and it was a grea","useful":2,"cool":1},"MjCIkp5QK97Y2U6ecnO_Sg":{"text":"It's a hidden gem that I'd come across because of Yelp. It's in a quirky neighborhood - su","useful":0,"cool":0},"nJ0tFvvikhg-Vfaodbsq9A":{"text":"I could eat their fish tacos for days! It's a very safe environment with all their tables ","useful":0,"cool":0},"0fq5_NBCVeRxn4sKm5p1bw":{"text":"I love this place!! Delicious food, great menu, awesome 'Ritas, lots of tacos, the tamales","useful":6,"cool":3},"HZx_8v6JIA6FeDmqDVrqAg":{"text":"There's no other match in town to these tacos. Even during the Covid crisis they have stil","useful":0,"cool":1},"c3RV-sI_XJMsXvSxSWsHTQ":{"text":"This little dive joint is funky and delicious. everything tastes great. get one of everyth","useful":0,"cool":0},"4ji7OdQZ_8fbHenKlFEoyQ":{"text":"I came right before closing and the line was still pretty long so this is a very popular p","useful":0,"cool":0},"NSAKY9zsjBSVq5FkZROepg":{"text":"This place is a must if you are in Bywater on Friday Saturday and Tuesday from 5 to 9. The","useful":4,"cool":3},"ulji0ySlAU-XMt5jRueyig":{"text":"I am from Chicago and pretty picky because we have a ton of choice with high quality amazi","useful":2,"cool":2},"aIYttQMa9wSyjBkJDbzpbg":{"text":"I just spent $30 bucks on tacos and none of them have any flavor or taste. Not teen the gu","useful":0,"cool":0},"qu3b-yPWl9Xdego-msUbvQ":{"text":"This place is a must if you are in Bywater on Friday Saturday and Tuesday from 5 to 9. The","useful":1,"cool":1},"21ckqqmGKtkH3ZpQJps4xg":{"text":"Very nice place, outdoors seating, casual and laid back.  Food was great! Definitely recom","useful":0,"cool":1},"nq5sRVBY_8KuBHPxqzfGPg":{"text":"Great food for the money, especially for the area! I am not a local, but if I was I would ","useful":0,"cool":0},"m88x4k6TUW3sXKKEe-KO_g":{"text":"Absolutely DELICIOUS! It was so good that I didn't even take a picture. Everything was wel","useful":0,"cool":0},"9q2R2PQvU8GWisPJECuDqA":{"text":"This was a nice taco experience! All the tacos had really good flavors and cooked well. I ","useful":3,"cool":2},"tJVG6iVZTXWm6JdySmSvzQ":{"text":"This place was bangin. Everything was very good, highly recommend the steak nachos. Sit ou","useful":1,"cool":1},"aTYGsFG-PCgKS5Z4xGe1Fg":{"text":"Awesome prices! Great spot! Even has a decent outdoor eating area. Not much more to say. W","useful":0,"cool":0},"8p4KPRrCB-N9TJqaPjHgDQ":{"text":"The food was excellent!\n\nCame with the lady after doing some bywater rummaging. You order ","useful":0,"cool":1},"geBn-BRgKrjWY7_g-rqmMw":{"text":"Super delicious tacos and tostadas! Best Mexican food in the bywater. Love having them in ","useful":0,"cool":0},"8x2ZC-krWvqbSXQofgtEag":{"text":"Great prices and tasty food.  I was in NO for 13 days.  I am sad that I didn't find Rosali","useful":0,"cool":0},"9ry2N-okYf8dImB4MWl0Ow":{"text":"I'm kinda scared to write a review for this place because I really don't want it to become","useful":2,"cool":1},"wH8f66sFJSqvR3LPzsI_bw":{"text":"This is such a cute little spot and very COVID-friendly. The black bean tostadas were deli","useful":1,"cool":0},"2rPSomZUVblINxdJzPE9IQ":{"text":"Delicious!!! The shrimp tamales with some kinda Mexican remoulade were amazing. The chili ","useful":1,"cool":0},"MIMmPdL95BYv6b8zyz2hfQ":{"text":"No cards allowed. There wasn't a sign that notify customers about this. I placed my order,","useful":3,"cool":0},"DooljYe07gHX19bGOL1vLw":{"text":"Loving the glow up not only in location but the expanded menu.\n\nThe new home for Rosalita'","useful":5,"cool":3},"wdfmDweqXdKQB-Gr_C-YKA":{"text":"Best burrito I've had in New Orleans! Affordable food and an easy, relaxed atmosphere. Hig","useful":1,"cool":0},"2y9eu-aJ3yt7aGpkY4k-OA":{"text":"Excellent tacos! I ordered a tongue, a carne asada and a pork belly and they were deliciou","useful":0,"cool":1},"7p4XX0nASfXOsqgQbk3Ycw":{"text":"Food: 8/10- it's always been amazing - me and my best friend who lives down the way have b","useful":2,"cool":0},"lsvMFRNKi4r6-bu0o9R63Q":{"text":"great small mexican plates, really nice covered back patio and some good beers to choose f","useful":0,"cool":0},"U7MZSw6DY6GPMnm3o4YSFw":{"text":"This place is a must if you are in Bywater on Friday Saturday and Tuesday from 5 to 9. The","useful":1,"cool":2},"1Qvh5iSQtatoTmyvA5NT6g":{"text":"Two years ago this was a taco shop in an alley- we are so, so excited to report that the f","useful":0,"cool":1},"Z8cpj-7SgzC6aoSN54Ndxw":{"text":"Damn, I really hope I just caught this place on a bad night cause there's no way what I ha","useful":2,"cool":1},"4XJx91gYwTTVf0R9qTw5NA":{"text":"Great tacos, cute backyard space, amazing sauces.  I'm from houston and I definitely know ","useful":0,"cool":0},"z6As2aTVuHGPmp8YzK-8rQ":{"text":"Tacos are my favorite and I have had quite a few in new orleans area.  Rosalita's is my fa","useful":7,"cool":5},"g0RDQANMfTLCOa0w5uKS7g":{"text":"This is a hidden gem. My colleagues and I wanted to grab a bite to eat and a margarita aft","useful":3,"cool":3},"bi-QDUBYcLREqSnkOJ9N-w":{"text":"I think that if you wait in that sauna with super high ceilings they should give you free ","useful":1,"cool":2},"v-SzCDrPJ5ICxSjJ92vkpw":{"text":"Just when you thought the Bywater couldn't fit another jewel on its ornate crown here come","useful":18,"cool":14},"gqqeef3jE2tLDcXA-7JoyA":{"text":"I don't understand the good reviews about this place. But then again, it's easy to fake 36","useful":3,"cool":0},"6ivSvR4oFGZ6CukPlijYoQ":{"text":"Everything was delicious and came out fast. The best is the habanero hot sauce! The backya","useful":1,"cool":1},"q-qHQfYOu2-84nmk8ipaNg":{"text":"Amazing tacos! Flavorful, fresh, made to order, great customer service. I will definitely ","useful":0,"cool":0},"ngY3IJagU2PhEqCKBIXO9g":{"text":"Amazing atmosphere & incredible tacos! Their home made sauces are packed with flavor from ","useful":1,"cool":0},"PM-kpEPiqHo7EB2jZ_p4mQ":{"text":"Rosalita's Backyard Tacos, also known as, Ally Tacos, is a unique experience. You order yo","useful":3,"cool":2},"lC9mZr-T9EJpwSS4-of8UA":{"text":"Such an amazing little spot. Tried it for the first time since we live a few blocks away b","useful":0,"cool":0},"ymvzb3Mzjxv0NS1KyEfVDw":{"text":"Bang for your buck!! Rosalita's Backyard Tacos is a really interesting spot. There's a pre","useful":9,"cool":8},"wJpwnjwoYPSsoBcVwD2LrQ":{"text":"This place has THE BEST food I have ever eaten in my life. The cooks are some talented peo","useful":0,"cool":0},"-_qk0lt47W-5-hGUqXSZGA":{"text":"Man, man, man. This place... Sheesh. I really don't know what to say. These TACOS are SO G","useful":5,"cool":2},"LXmjDiP2zOiFVdnML86hMQ":{"text":"Lovely little neighborhood spot. Food and drinks were delicious along with a friendly staf","useful":0,"cool":0},"p0WiSNVvE21MoZ_TaKwQpQ":{"text":"SO, SO Good! Go! We tried the fried fish, smoked pork, chicken and brisket tacos, which we","useful":1,"cool":1},"SA15HwjDFGlBk3fPas0ODQ":{"text":"A friend and I tried Rosalita's yesterday for the first time and were pleasantly surprised","useful":0,"cool":0},"0j-4bi48Sqg0p3Zozv-sKg":{"text":"The tacos and nachos from Rosalita's are AMAZING! In my top 3! The meat is perfectly smoke","useful":0,"cool":1},"79zGZiNKifM86bgIp0bAHA":{"text":"Skip all other taco joints, Mexican restaurants and burrito spots...this is the only place","useful":2,"cool":1},"-2BW_O8gB0mXVHNfnHatDw":{"text":"Delicious, very affordable food with great service & cool ambience. Can't wait to go back!","useful":0,"cool":0},"A7-O8-wGP5pPR6pzqONluw":{"text":"please please Cook the tortillas on a flat top for just a bit before using them in the tac","useful":2,"cool":1},"nB7M6UnkWlDBxVtziE6XvQ":{"text":"Great bright hole in the wall place for tasty tacos and nachos. A must visit when you are ","useful":0,"cool":0},"zj7B2qMdiNyI_PqsH76DPA":{"text":"Stopped at Rosalita's for dinner on the first night of a four-day trip to NOLA per a recom","useful":3,"cool":2},"4P2Xldx0mkavKzWKQ1dOIA":{"text":"This restaurant has everything down to a science! You order inside then go to the \"backyar","useful":2,"cool":2},"XeeKDPeIPQKQHPNUXcfHZQ":{"text":"The tacos was amazing BUT chickens were everywhere and they jumped on the table while we w","useful":0,"cool":0},"sOdLw_1Kbs23Wsi-upBK6Q":{"text":"These were delicious tacos and great outdoor space to sit with friends. Went during mosqui","useful":1,"cool":1},"zMzPU5NFhGsirCgwZxnzng":{"text":"If you are in New Orleans craving for Mexican food, this is your spot! Try the adobo chick","useful":0,"cool":0},"b6dCzlF4P1tva1iIDOPcRw":{"text":"A cute funky spot for eats and drinks! You place and pay your order at the front counter, ","useful":3,"cool":3},"SL-3gbkmk7BEwUCXjzpX9Q":{"text":"A few block  away from our house, Rosalita's Backyard tacos never disappoints. I have had ","useful":9,"cool":7},"XGT_fdqiGv6EkUwVT0dnsQ":{"text":"Great food, amazing ambiance, great prices and super fast service... This restaurant has i","useful":0,"cool":0},"Xb7NTxn3w2hq5qW6IBRnEA":{"text":"So, let's talk about this place. Let's be honest with each other. The backyard area is cut","useful":2,"cool":1},"W96cqwp6g2XY0ChYz4GncA":{"text":"Been here twice now, once to dine-in and once for take out. As you might expect their taco","useful":3,"cool":2},"00GxY8m-uYBbORZxFflV6g":{"text":"WOW! Easily the best tacos I've had in New Orleans. I love this location, tucked in a side","useful":0,"cool":1},"MzjVSFOKbpIVLp95AARvEw":{"text":"A small hole in wall places that is off the charts...\n\nI was in the mood for some tacos an","useful":1,"cool":0},"aqsQojAY-p7aka5jat_UMw":{"text":"Their taquitos are the best! I also got the brisket taco and the fried fish taco. Sublime.","useful":0,"cool":0},"-RueYy6BNVc_VnNCyrdb_Q":{"text":"Simply loved our experience here....once we actually found the place. Apparently google ma","useful":7,"cool":6},"P42j11eoyUo-29KL3n4WHQ":{"text":"Food was Fabulous! Great atmosphere and prices, staff was great, over all everything was i","useful":0,"cool":0}}