{"HeN_vE-IH0JalToOa0eHaQ":{"text":"Really cool spot - you can sit and hang out and watch what's going on. You get to see the ","useful":0,"cool":0},"i1WQC-MGL3ZRlh29rhb8OQ":{"text":"I went to the grand opening last week and it was such a great event.  There were food truc","useful":1,"cool":1},"w8upXTi2GgN5TP7vPcbWig":{"text":"Very beautiful and open space with some delicious drinks.  My biggest complaint is the hou","useful":0,"cool":0},"FI5Jc15Tj3Ym02Fb-YxQdQ":{"text":"So excited to have a kombucha brewery in NOLA! I've tried several kombucha brands and this","useful":4,"cool":2},"o5VQNQa96iwOpCf5bFEOuQ":{"text":"This is the first time trying this Kombucha. It is tasty, a much more mild Kombucha than I","useful":0,"cool":0},"P3AmQloHjZHQUpcp8whxGQ":{"text":"I find myself lucky to have found this place via NOLA Tribe Yoga. They did a couple classe","useful":0,"cool":1},"SCD4jTmdkiKkCNLAM8itOg":{"text":"Daily it seems this city surprises me. Friday this business and venue was a wonderful one ","useful":9,"cool":7},"WcFU9NISL-0Jy2c-OaAX-g":{"text":"such good kombucha! i've had it all the way in south carolina as well as straight from the","useful":0,"cool":0},"ML9u4EnIwzv20tC0tU8Npw":{"text":"Great flavors and really nice, helpful staff!\n\nWhen they have a 50% flash sale, it's even ","useful":0,"cool":0},"oUobNju1XLuROTCa47h1gg":{"text":"Personally, not a fan of kombucha. So I don't know if you'll take this review to heart but","useful":3,"cool":2},"BDUYQMHlE4gDFqyDmj8orw":{"text":"Great place & glad to have it here in the Big Easy.  I attended the opening night events &","useful":15,"cool":12},"NOJNnqh7Lb_YFg8Heas9oQ":{"text":"I love kombucha. It maybe my favorite drink ever! I've drank kombucha on draft from Maine ","useful":0,"cool":1},"3vBTr1t1BLnoc7do1lHlzQ":{"text":"I can admit it took me awhile to get on the kombucha train. I couldn't get past the strong","useful":19,"cool":14},"fitAVcc3C-CxFbeFUHr5pA":{"text":"I was introduced to Kombucha at a Rouses tasting randomly during the week. It has since ch","useful":4,"cool":1},"-49LBTYg2HreY6c68yK34w":{"text":"We just LOVE Big Easy Bucha so so much!!! Their products are all delicious and amazingly t","useful":3,"cool":4},"FzfiVHd9VTS7pfOvKMVnfw":{"text":"My 1st stop on my 1st trip to NOLA was Big Easy Bucha and it was an absolute perfect way t","useful":0,"cool":0},"YDqw0tcLG2mix1ysVroXdA":{"text":"Holy kombucha Batman! This is the first local kombucha brewery in New Orleans and it's in ","useful":8,"cool":8},"3iHpi1AvOLZf0cRObemtfg":{"text":"Update: the shots were DELICIOUS!! And made me feel great, perfect way to start the day. \n","useful":0,"cool":0}}