{"br4Am64TGIRThuECZuhe3g":{"text":"Rating based on atmosphere, music, drinks & service. Always look forward to listening to J","useful":0,"cool":0},"chj5qvwFKscgvPP-Ggt6Yw":{"text":"I visited the Davenport Lounge with my boyfriends parents when they were in town. To be fa","useful":2,"cool":0},"fkBwpRyuMSLZXv3MZh_xrw":{"text":"This is a beautiful place to come for a late drink or two. The music is phenomenal; their ","useful":1,"cool":1},"qZGJvPcnVrOd7G5-ax0VTg":{"text":"I made a reservation for a group of friends for afternoon tea, for one friend's baby showe","useful":4,"cool":0},"B_a37ljaoafqn_rE9rkkVQ":{"text":"Oh wow, I actually went to the Davenport Lounge the other day.\n\nIt looked like something o","useful":6,"cool":4},"LdmoMdJ_m6hsAsijxK5N3w":{"text":"Enjoying the Davenport Lounge is forgetting the hustle and bustle of Bourbon St.  The ambi","useful":1,"cool":0},"bbYq8ZFMMHRcEvPL37e1fA":{"text":"Good selection of drinks and food. Bloody Mary was solid.  Atmosphere is quiet and calm.","useful":0,"cool":0},"fsg-j6ll4vWf89WH57B9wQ":{"text":"This is a very very very classy place. Loved the music and the ambiance. It was great plac","useful":0,"cool":0},"pg4NR6-RiaKxWv46wVPs8g":{"text":"Outstanding martini. Make sure you get it with blue cheese-stuffed olives. They'll fill yo","useful":0,"cool":0},"GccPz3nVsTeCxcDZaSu4RA":{"text":"Setting exudes class. Jeremy Davenport and his band offered up traditional jazz standards ","useful":2,"cool":1},"CwAPkcGViqffyLUXdsl06Q":{"text":"Jeremy Davenport and the band put on an outstanding show every time we come to this lovely","useful":0,"cool":0},"bWQhfjo4VCVZUUuNmEuzcQ":{"text":"This is our go to spot when visitors are in from out of town. And it is FREE! Have a seat ","useful":2,"cool":0},"Jr4XNmMcZkgqyfs1IpLZqg":{"text":"The atmosphere here is great. Live swing and big band playing with an excellent singer. Th","useful":0,"cool":0},"x5zo6g6_xCbv060WyRRyQQ":{"text":"probably the second best part about staying at the Ritz is having THIS downstairs.\n\ngood l","useful":2,"cool":1},"g2mQo-J8qqsCL2-tdfXZOw":{"text":"The Davenport Lounge is a nice break from the casual and divey bars that adorn the French ","useful":3,"cool":0},"hrnKs2UKz6iEARmYdRDtDA":{"text":"Overrated. I guess that's it. Davenport himself is a fine musician but his band is jaded a","useful":2,"cool":0},"fQqtMGs4NpUe0iDGPnxJyg":{"text":"Excellent, well chilled gin martinis, home made chips, comfortable and spacious venue and ","useful":1,"cool":0},"HeBDwHCxrK8NibX1kIAZ0w":{"text":"This is one of the nicer hotel bars in the city and I really like both the Ritz and the Da","useful":3,"cool":1},"MEeOhGofA89aSZK0inYTSA":{"text":"Sometimes you need to take folks to someplace fancypants and as this is the bar at the Rit","useful":7,"cool":4},"r95iFcNpgKQW1f4xnRsB7Q":{"text":"Perfect place to enjoy a post dinner drink before calling it a night.  Relaxed atmosphere,","useful":0,"cool":1},"IU3ZxTrVnBiCkmWmESfADw":{"text":"It was the best of times, it was the worst of times...\n\nWhile my credit card limit was rea","useful":0,"cool":0},"F5iqmFHoJ2m-aidFh9KxlQ":{"text":"The Davenport lounge offers live Jazz music on Wed/Thurs. from 5:30 to 9:30pm and on Frida","useful":1,"cool":1},"lG8aMpycWOsq56WVhxHQCw":{"text":"Loved the venue, atmosphere and band. Drinks are more pricey than average but that's also ","useful":1,"cool":0},"yyfmEhaRPQff9co9zhUagA":{"text":"Jeremy Davenport hails from STL, so we had to come by and check out him and his band while","useful":1,"cool":1},"WUlkDj5VYqaVaABfZ91s3w":{"text":"We wanted to listen to some jazz with our drinks, but no live music on a Wednesday night. ","useful":1,"cool":0},"xf7PAVW97bmuo97Er-_2Og":{"text":"Like many yelpers have mentioned, the Davenport Lounge is a \"classy\" place. That is, the f","useful":4,"cool":2},"JH3G-OJvN-1Gk_301JpZqA":{"text":"Looking for a home away from home!  This place has it all, plush sofas, enchanted garden, ","useful":0,"cool":0},"8VcNy2zVtaog7XMO-rWlFA":{"text":"There are so many more interesting and original music venues in New Orleans that it seems ","useful":0,"cool":0},"baQZYj6Tk06WorhmZSQLEg":{"text":"A little pricey, but worth it because Jeremy Davenport is so great.  All class all the way","useful":1,"cool":0},"fk3pWDcpxHpHKW9W0Z28lA":{"text":"Had a great time!  Got to the lounge early and got a great table right next to the stage a","useful":0,"cool":0},"zx5P1h8_7Ku3g-c5KWAB8w":{"text":"very intimate setting and classy.  Even though Mr. Davenport wasnt playing, he was enjoyin","useful":0,"cool":0},"nXZzbR58gFrE2FuBHEj0Qw":{"text":"It's the Ritz for goodness sake.  With live jazz and excellent Vespers.  Homemade chips an","useful":0,"cool":0},"jWtAFAvKSyy0TaaQCj67Ww":{"text":"Decided to check this place out after hearing some rave reviews.  I have to say, it was bi","useful":0,"cool":0},"5hT9c3Rq_abnTG_lwsrx4g":{"text":"This is a great  place to have a drink and Jeremy Davenport is a fine musician and singer,","useful":1,"cool":1},"OQtizJg53wWoe9egdAFR1g":{"text":"jeremy davenport is my favorite in nola. we always hit the davenport lounge on each visit ","useful":0,"cool":0},"OWByTSlOAnng4TcOAojchg":{"text":"The lounge is decent. Food is better than the bistro. Music is good. Waitress was nice but","useful":1,"cool":0},"QHPR62p4yWlRrjaNrrCvxA":{"text":"Great place to listen to music, dance, and hangout. I really enjoy when my fiance brings m","useful":9,"cool":4},"cq4wav-vpcwEhMEW3prY4g":{"text":"The Davenport Lounge is now my go-to place for a relaxing evening. We arrived around 6pm o","useful":0,"cool":0},"2IHGavgE6iWFUlnZy_3Rgg":{"text":"I had a date here once!  Sorry Scott S.  But, seriously!  I danced and everything!\n\nThis p","useful":9,"cool":1},"FnxT054K_0iguAZV71Xblw":{"text":"I was finally at the Davenport Lounge last night, nice place, good service - Ritz quality.","useful":0,"cool":0},"m71BxM6RtT6jJqELDT3Wmg":{"text":"They would have gotten a five star for the Davenport performance etc. however, the service","useful":0,"cool":0},"04Tmb0y7pT-m7XuQCPpUMw":{"text":"My wife and I had a wonderful time here at the Davenport Lounge \nGumbo was amazing and the","useful":0,"cool":0},"Y91xdIyqqOg_RYj_vGLL5g":{"text":"Ambience: 5 stars.\nBand: 3.5 stars.\nService: 4 stars.\n\nWhat a diamond in the rough...liter","useful":2,"cool":2},"agBSBpAmbleC2uamDM3NSQ":{"text":"Our Servers Jerome and Lashawn is the best!  Best customer service ever! Food choices by J","useful":0,"cool":0},"HbC6EkfUgwyVbmxvDj1nKQ":{"text":"Loved the jazz and also the complimentary side of freshly made potato chips with your orde","useful":0,"cool":0},"-eZQIO_ftDtkep1SI878cw":{"text":"Let me start with at night it's a nice place, Jeremy Davenport is a great entertainer and ","useful":1,"cool":0},"1uiH8ErL7OZGV2mdOfgmQA":{"text":"This place is fantastic!!! The music, the atmosphere, the people, the drinks & the service","useful":1,"cool":0},"cWX3vNF991KeM6fWzjPBpg":{"text":"The Davenport Lounge is located inside of The Ritz-Carlton New Orleans.  It's named after ","useful":7,"cool":9},"EEple31cE1maP_qa6b51pQ":{"text":"You know, despite my 3-star rating, I actually like this place so don't get me wrong.  The","useful":3,"cool":0},"PmliwUlsEdXEZvA_7YG5Sw":{"text":"It took a little exploring to find the Davenport Lounge (off to the side of the reservatio","useful":1,"cool":0},"_YdO9SeBkSozEca_M4CPkw":{"text":"Came for Coolinary! The food was pretty tasty, the wait staff nice & accommodating, and th","useful":0,"cool":0},"qVDeWbif5Srz1kzjaHJdMQ":{"text":"Excellent cocktails, appetizers and live music. Great energy. Not too crowded. Just right.","useful":0,"cool":0},"ggwesswjYC8lo1peDsYzzg":{"text":"OK.  It's luxurious and marble and the band is phenomenal and it's open and airy and there","useful":2,"cool":0},"dsqHO-Y9j-hvLKo4wnG0eQ":{"text":"This place is classy from top to bottom.  Very upscale lounge with great service, food, al","useful":0,"cool":0},"jU8QIVqRzDD3gDfmMvj24Q":{"text":"Get the BlackBerry Caprikosa. Ask for Chris. He adds tender loving care! We love this loun","useful":0,"cool":0},"A6wNj3lDsbRu9LC7XF5S3A":{"text":"One of my go to places in NOLA\n\nThe redo of the lounge makes it better for the music. Jere","useful":0,"cool":0},"MAw5qGg0k3vV7y9gN8KlDA":{"text":"Nice place to relax and listen to jazz standards on a Wednesday night. They gave us free p","useful":0,"cool":0},"R-kf8yuBkcdy805Ioy5fxw":{"text":"Wow, you really need to get there early to hog a seat, but then again I came when there wa","useful":1,"cool":0},"p9kiPR7pNtzEy631hXRflg":{"text":"Visited the Ritz on Christmas!  We wanted to stop by for a few reasons: to see the Christm","useful":1,"cool":1},"YHAiidW6CM2JmIEvHt3iZw":{"text":"Wonderful afternoon tea\n\nI've had afternoon tea here several​ times and love it. The servi","useful":0,"cool":0},"5LM_kAXopQX9UKLAsIFTIA":{"text":"On the third floor of the Ritz Carlton Hotel is a cozy but spacious, intimate cocktail lou","useful":0,"cool":0},"U5N4sVRTTTwKzSDTGYY-kw":{"text":"Underrated -- The music is fanatic and it's a perfect escape from the hustle of bourbon st","useful":1,"cool":0},"U9ODrdyeViaeom5ePbLXXQ":{"text":"I have to take a moment to commend and thank Jason and Kevin, Bartenders at the Lounge. As","useful":0,"cool":0},"X_D0N5ZB51K1HZBZSg6g0Q":{"text":"I was looking for someplace to entertain a dear friend for tea, and when I learned that th","useful":3,"cool":0},"JbqNZag3XHNDkYAw02pLuQ":{"text":"Lovely atmosphere! Live jazz music on certain nights! .. and the best desserts ever!\n\nI tr","useful":0,"cool":0},"erypdDzEiwNKwrmhhvRYNQ":{"text":"For an evening of jazz music try this lounge, have Justin & Chris as your bartender and yo","useful":0,"cool":0},"xFgpnTPcbbGXO_w5bYgBtQ":{"text":"Jeremy Davenport is a New Orleans gem, and no visit is complete without hearing him and hi","useful":0,"cool":0},"Ayl2P_BOIL_vwWn9ZUkpKg":{"text":"A charming setup for a lounge: plush but not prissy, comfortable but classy. I ordered Fre","useful":4,"cool":4},"LH7fbZZqEgiFANwNgs0dfA":{"text":"If you are looking for top quality Louisiana cuisine and re serve to match, this is the pl","useful":1,"cool":0},"R_43kyuQTWJBfixXMxz0Hw":{"text":"Located on the 3rd floor of the ritz- carlton hotel. A local recommended to go here for th","useful":0,"cool":0},"jR2XZ7sT7J290CpsDhXGLg":{"text":"Jeremy Davenport is way dreamier than Michael Bublé. And the fact that he has a lounge in ","useful":17,"cool":15},"3tbM1D0ANgLj6HvT-TXyLA":{"text":"Fantastic experience. Interior design of Lobby and Lounge make for such beautiful throwbac","useful":0,"cool":0},"NHehtCuriZGiU-C59SPW1Q":{"text":"Didn't have the time to check out the food as I only wanted to stop by to see some live Ja","useful":0,"cool":0},"v4Up-75KnWb-WSILZdtBVA":{"text":"Jeremy Davenport is no Michael Buble but he's good and his band is excellent. This place h","useful":0,"cool":1},"69vX3l_BitW34RXK257umg":{"text":"We enjoy going here to listen to great jazz. The Jeremy Davenport band is definitely worth","useful":0,"cool":0},"lkJyrHig34QGhNM-5vDUiQ":{"text":"All dressed up and no place to go? Look no further than the Davenport Lounge. Located in t","useful":7,"cool":5},"XE1OpfcmNv7BDGQq6TaHYg":{"text":"Multi time guest and always great music and ambience. Dance floor for the truly extrovert ","useful":1,"cool":1},"I23Q2cW0AE9ToquPn9oTQw":{"text":"Fantastic afternoon tea! I have been to many afternoon tea places around the country and t","useful":0,"cool":0},"coutzQLDyvAzi94TrFzrJw":{"text":"After having a great dinner in the Garden District, we came to the Davenport Lounge (My fi","useful":1,"cool":1},"ot-ftWa0HPUCi2oTq4zI3A":{"text":"Brought my grandmother here for afternoon tea today. I had an excellent time and my grandm","useful":0,"cool":0},"-GAJ1DoRgoJhJSA1jigm9Q":{"text":"Sure, the Ritz Carlton is a luxurious hotel with the expected ameneties, but one might als","useful":1,"cool":1},"rkm0erVzQ5lOBXGb_xIX7g":{"text":"They do a good job here, but WOWEEE, those prices are high...\n\nWe were headed to a Carniva","useful":5,"cool":3},"t9eY4tk6_936haIsWRBCQw":{"text":"Want to feel bougie with your girlfriends? Come to\nAfternoon Tea at the Ritz! Tea is serve","useful":1,"cool":0},"2dmBl8-mep4Fdk4ezQSCcQ":{"text":"Really cool spot for lounging and to are some jazz on the weekend.  They have the best bei","useful":0,"cool":0},"If19TwEwxynQvDzjhpm12Q":{"text":"A wonderful stay at the Ritz and wonderful food, service, and drinks at the lounge. The at","useful":0,"cool":0},"kYleQf62H6Va8GiQz6lcjQ":{"text":"When I worked downtown in a gallery, and had to wear dresses and heels all the time, I LOV","useful":5,"cool":6},"3enf_DKizc3Rq3LhnHz9Lw":{"text":"When I travel I must find a place for afternoon tea.  After some research we determined th","useful":2,"cool":2},"Ul9Q4F1qa268oF03NBHXOQ":{"text":"Better beignets than cafe du monde. They're not lying to you when they tell you that. Come","useful":0,"cool":0},"wK4blJ9AEsioHvjfPgIoFw":{"text":"Very elegant and classy lounge located on the third floor of the Ritz Carrollton. Great sp","useful":0,"cool":0},"vyeMaQEbIjhyb_RCjc4C3Q":{"text":"NOT THE EASIEST PLACE TO FIND\nAbutting an unlit section of Dauphine and a remoter part of ","useful":9,"cool":0},"VzN6PUJfi2G3wojbFS3xjQ":{"text":"We had some drinks and desert at Davenport Lounge. It is located right next to the bistro ","useful":0,"cool":0},"C9Rqx0D_LAqco2icH_6A-w":{"text":"Great jazz and drinks. On the expensive side but it is the ritz. It gets busy but service ","useful":0,"cool":0},"UnMXqNV0GaNz27ucB4Ct2A":{"text":"Had the best time at the bar this past Saturday. The bar menu was great.  The service exce","useful":0,"cool":0},"PBySUruLhA1wHME68HrRNg":{"text":"Chris and Jason are amazing. We had a pour off and Jason inched our Jason by a finger. The","useful":2,"cool":0},"kEoDXRYcICDVtSrocpPx6A":{"text":"Absolutely great jazz in a sophisticated setting. The food and service can't be best. The ","useful":0,"cool":0},"wZyjsDLC-UfbH1FUITr8hg":{"text":"This review is for the tea lovers out there.  During our last trip to NOLA, my wife and I ","useful":0,"cool":0},"kPAFEZsX6cz0YfbjSL2zJA":{"text":"Good food and atmosphere. Love getting to eat dinner on a couch lol. Very relaxing. Good m","useful":0,"cool":0},"9ybQm3lBLVmqjy4pU-2BFA":{"text":"This jazz lounge is in the Ritz Carlton. There's no dress code, which is nice, but most pe","useful":1,"cool":0},"N-BZiJxZPUETjY36rw4G6g":{"text":"Went for Tea on Saturday for my bf's birthday and it was amazing. \n\n@ritzcarltonneworleans","useful":3,"cool":0},"PZlTqiendVLAjbOCBFUi3w":{"text":"All I can say is if you ever want to woo me then get dressed up and take me to the Jeremy ","useful":7,"cool":3},"CqzBgURcAerka9LXikazpw":{"text":"Truly in shock that I have lived in New Orleans for 30+ years and have never been to Daven","useful":1,"cool":2},"plDq8xlE4nlJQLGIOsCUMQ":{"text":"Dropped in for a quick drink and enjoyed the \"Caribbean Old Fashioned\" - Nicely made and r","useful":1,"cool":1},"LhlRrGt7KTJN4rmJRbf78A":{"text":"For the lounge in general, I give it four stars. \n\nFor the holiday high tea with Papa Noel","useful":0,"cool":0}}