{"hEqdA0x6wiEw_0uKWQgl2w":{"text":"Let me begin by saying that, with any company, tours can differ depending on which tour gu","useful":0,"cool":0},"Zuazh7WcqfagzRM0f2kQOA":{"text":"We thoroughly enjoyed this informative and fun tour of the city!\nIt was a perfect first da","useful":0,"cool":0},"C22-Up37XVEYvJ5GSlNIHA":{"text":"I would give negative stars if I could based on their customer service. I bought a Groupon","useful":1,"cool":0},"hVcO61Iu6d705QzlzF1CTg":{"text":"My husband and I bought this tour thru Groupon so I wasn't expecting much. To my surprise,","useful":1,"cool":1},"YsEOxNU2KXRjSclxiuESkw":{"text":"I've been on various bus tours in my lifetime, but never have I enjoyed or learned as much","useful":1,"cool":2},"fVXBuGh1DkEp77Vj-P_2QA":{"text":"I would highly recommend it. They have picked out great things to see and packaged it toge","useful":1,"cool":1},"YMjmyRN2RoPOeJ86gieuyw":{"text":"I got this as a Groupon. It was a bit disappointing. \n\nWe were all put onto a shuttle bus ","useful":4,"cool":2},"Md00BPqNwXYtb0YsOPY6_g":{"text":"Waste of money!!!!!!!!!!!  If you want to save money do not pay for this tour!  Driver is ","useful":1,"cool":1},"3XfKZii1Wol_mJ8pZ_J2dQ":{"text":"I am not sure about the few bad reviews, because I had a great experience..This was my fir","useful":3,"cool":2},"jLi19VNMnFMURhFWSLUApg":{"text":"The tour itself was rather good. Really liked the guide and got a lot of info. However, de","useful":2,"cool":0},"SVUGrt95O27FdkFwxtDi8g":{"text":"Horrible horrible customer service!!! Find a groupon for a fraction of the price and save ","useful":3,"cool":0},"lnvOmA1sET4Erm8-ueVkEA":{"text":"We really enjoyed this tour, Howie was not only informative, but funny as well.  I would h","useful":1,"cool":1},"dNJRKuA-0pGPZM4MlA13qg":{"text":"Very disappointing business practices. I bought their Groupon for the bus tour of the city","useful":1,"cool":0},"jPHDgrNy1UnQWGiwiGrtDg":{"text":"Richard was a great tour guide. Very knowledgeable and funny. Lots of historical and prese","useful":0,"cool":0},"I-LE_aXD2-Ze-yOrfkbGIg":{"text":"Time has changed. Did this tour today and it was brilliant. Our tour guide was a retired t","useful":1,"cool":1},"AHbULXFu6mLbLZnK0NSq-g":{"text":"Bought the New Orleans power pass- they say they close at 4:30pm when you get there but on","useful":1,"cool":0},"aMbS1gWcQVjJA4pWvh98IQ":{"text":"Howey, our driver was amazing! Fun, friendly and extremely knowledgeable! Loved every minu","useful":0,"cool":0},"xo2uDikNvdkEvr7lkiMYnQ":{"text":"Richard was awesome!! Make sure you request Richard to be your guide. He really new the hi","useful":0,"cool":0},"HfJPZsLl064zFTfIBIJtQw":{"text":"I'm torn here - because the sites visited on the tour were exceptional - I think I saw exa","useful":4,"cool":2},"6kGH-YrI3bnj5N4lhAE38Q":{"text":"Mickie gave an excellent tour. She is filled with so much knowledge and tidbits it was exc","useful":0,"cool":0},"XsI1qV8M0jeXGIz9hoRt1A":{"text":"Horrible experience! My group was approached by one of the sales people in front of their ","useful":5,"cool":1},"GNcuRRVSsZ2sYEzSg6WrhQ":{"text":"Bought a 3 day pass and we were able to visit:  Mardi Gras world, WW2 museum, bus tour, co","useful":2,"cool":2},"FJqxS3_Xy8snjsMIzPLQwg":{"text":"Don't even bother with this company. It's the worst!!!\n\nI called and the man that answered","useful":3,"cool":0},"AiDH-gQ7KqUS9VdI7hzb_w":{"text":"The tour in itself is amazing as I am writing this while still on the tour. The historical","useful":0,"cool":0},"zwxSAlnAVt26TWJTTMBoMA":{"text":"We weren't sure what to expect because we didn't read any reviews and we were pleasantly s","useful":0,"cool":0},"aOfumBCcp-rJNFTb8GmuxA":{"text":"Our tour guide was Mickey (I hope I spelled that right) and she was AWESOME. We did the ci","useful":0,"cool":0},"y86OCRJtYGNVNvxu050TYw":{"text":"We took the swamp and plantation tour yesterday with this tour company and it was great. W","useful":0,"cool":0},"6vKVKj7UyUV-mIW6GL6Mng":{"text":"Paid $160 for my family of four.  The bus was old.  Terrible, bumpy ride.  AC not working.","useful":0,"cool":0},"YApAm4M3238-kXzvehEstw":{"text":"We had Howie as our tour guide and loved him. He was extremely informative and very punny,","useful":1,"cool":0},"MnhqCiYAnPxopsZt1TcL4Q":{"text":"Very informative. The tour was recommended by the Wyndam Belle Maison concierge, and we re","useful":0,"cool":0},"u_DHP06R5hyfcYv9RkZSYg":{"text":"We were on the fence about booking the city tour until the sales person told my wife the t","useful":1,"cool":1},"TJsBR9MKx38aZ0A1pFjaSg":{"text":"Wasn't the exact tour bus I thought (or in the picture on Groupon), but it was comfortable","useful":2,"cool":2},"MpvjUZEIX-bsBFGS33lSdw":{"text":"I don't know about all these other reviews, but my boyfriend & I absolutely loved this tou","useful":0,"cool":0},"QxhgCkxw6MdmwrC_PzIGKg":{"text":"I was in New Orleans for 5 days and my friends and I didn't plan out what we wanted to do ","useful":0,"cool":0},"XsqqDPzXZQMCihR5VTHZCQ":{"text":"Richard was our tour guide for the bus city tour and he was phenomenal! He knew everything","useful":0,"cool":0},"kX-CI4fhaKCfiz752xRapA":{"text":"We took the New Orleans City tour by bus with Howie in March 2021, on a Thursday at 10:00 ","useful":0,"cool":0},"hF25ln_f0DiT8rj04IcCLg":{"text":"Herman was an amazing tour guid. What a way to end our Honeymoon trip. Thanks for making i","useful":0,"cool":0},"_W8qNM9T6tewOO6vkxeQOg":{"text":"Richard, our tour guide was awesome! He is a native and recalled many stories from his pas","useful":0,"cool":0},"-dUl8tHiz3-VdREbLUvpWA":{"text":"The two hour tour was a great intro for our NOLA trip. Herman was a wonderful guide and a ","useful":0,"cool":0},"EOALo5S8r7rv5LM_SRsKGg":{"text":"First trip to New Orleans and this tour was everything you could want.  Please make sure y","useful":0,"cool":0},"Ji_OP8iTjoaeF8kRxcmlvQ":{"text":"We went on this tour with Howie, he's half Sicilian half Irish and 99% funny as hell! Supe","useful":0,"cool":0},"vbMx_cjNEMwaqVRy5Jb_8A":{"text":"We had an absolute blast on the City Tour with Rick! He is a knowledgeable and fun-loving ","useful":0,"cool":0},"tgms6_M6i6sjHdAkq5U2Nw":{"text":"We knew very little about New Orleans history and culture and decided fairly last minute t","useful":0,"cool":0},"FbEh8v7dp1Z-KwQ63Xcc8Q":{"text":"City Tour 1:30p\n\nThere are only two tours available per day. We did a Sunday afternoon tou","useful":45,"cool":47},"z5lEsA7044QKX3UUE4U9jw":{"text":"Anything you need to know about wandering around New Orleans, this is your stop.  I got th","useful":2,"cool":3},"eW3-P1BkTXtuboQoVbksMQ":{"text":"Customer service is key in tourism, they missed the memo. The staff other than a gentleman","useful":0,"cool":0},"Hg53vUl5FAZ-kU9hdT2hkQ":{"text":"I cannot say enough good things about this company and their tour guides! My husband and I","useful":0,"cool":0},"SxLlBQkBaMCMcwva1rnwuQ":{"text":"We used the Go City pass and took this tour on our first full day in New Orleans. We're so","useful":0,"cool":0},"EvVO_BWqxM1qKRPr4CAcHA":{"text":"Howie made the tour! \n\nWe took this tour right after we landed in New Orleans and I highly","useful":2,"cool":2},"7lYL7fmVr_m3gq8duW1wRQ":{"text":"We waited for nearly an HOUR from the \"pick up time\" stated when booking our reservation (","useful":4,"cool":5}}