{"POY3Q8NK2TEmTUQeoBYRdw":{"text":"I've finally found an efficient, reasonably priced waxing spot in Nola! Paula's awesome. H","useful":1,"cool":1},"UOu9b73PH8C-t2N-2W13fQ":{"text":"It's a nice clean space. Zoe did a good job of making the experience of getting a Brazilia","useful":0,"cool":0},"C9SRlcHIi_lp1dT8SdDttA":{"text":"Stumbled upon a Groupon for a Brazilian at a price I couldn't pass up. I've been getting B","useful":2,"cool":0},"FTxmKmHUkSXRo4prgWcEUA":{"text":"This was my first time going to Sol Cura! I have gotten a Brazilian wax many times and cha","useful":0,"cool":0},"T1q6jO_9ryY0VFQ6-PUlZQ":{"text":"Worst experience ever, 4 different people recommended Paula  at  Sol Cura only to be the t","useful":3,"cool":0},"Tp5cE12mNEJ_FU9ZAzwfzw":{"text":"I found this place through Groupon - normal price for a Brazilian is $35 (30 for students!","useful":3,"cool":0},"RoAXHN6kqHw5V7xEc6WafA":{"text":"I didn't feel welcomed at all (to be frank, I felt discriminated against from the moment I","useful":8,"cool":1},"Og7q7H2_p6UwXndm8IZb1w":{"text":"Today I went there for my first time using the Groupon. First off, $20 for a Brazilian is ","useful":0,"cool":0},"O3ApqudH7E5_XIpiouHW2A":{"text":"I received a Brazilian wax and the results were amazing! Also the pain was extremely beara","useful":1,"cool":1},"W98tZ7fCBN1s4uTKgnmJtQ":{"text":"For my first Brazilian wax with hard wax experience: Sol Cura was the best. Paula was very","useful":1,"cool":0},"hTDy_-G9Yw4Q7DLz6sfk-A":{"text":"This is an update from my last review. Paula has remained my waxer for over a year and I h","useful":1,"cool":1},"AG9_bx2B6ROJddZl81RPWA":{"text":"It was my first time at Sol Cura. Paula, the owner, did my wax and did a great job! I was ","useful":11,"cool":7},"eVmZHDASis5km1UxqVolQQ":{"text":"Paula is fast! She's also very reliable. She's never cancelled on me and she's even pencil","useful":3,"cool":3},"hmugzBWPUtXmUNV_zoaeSQ":{"text":"I have been going to Paula for Brazilian waxes for close to two years now! She's lovely, t","useful":0,"cool":0},"3j7ipOykVYukNECRMweo7A":{"text":"Great waxing experience with Paula. She was efficient and sensitive to my needs. She share","useful":4,"cool":0},"Wd-pnO5pci536L-LpkvuJg":{"text":"This is a good place to go if you want an affordable wax. I went to her twice for my first","useful":5,"cool":0}}