{"GjWFsD6PK5TdT8qxxrGk1w":{"text":"Beer taps installed at your table? No Wai! Although its a bit mainstream, this is a decent","useful":0,"cool":0},"u3OF3D3VAX2TA6SjHHFbkQ":{"text":"Horrible service!The waiter asked me what I ordered 3 times...then the manager basically t","useful":0,"cool":0},"llZa89NpTy4fFRJcf20uSQ":{"text":"Good bar food, generous portions, good prices.  Very crowded when we arrived but seated qu","useful":0,"cool":0},"w_ciiDDW8Foj-o0O15QraA":{"text":"Hamburgers are ok. Fries were hard. Broccoli was old. I don't recommend this place for the","useful":1,"cool":0},"0EvtjUgq6R8jXnez-0K6ZQ":{"text":"One word Cajundillas!!! Best quesadillas I've ever had!!! Came in on a Sunday , service wa","useful":0,"cool":0},"Wu_JfVH3W5qu6KVFnkqMxA":{"text":"The burger was decent, but this place and the people there are just a little too arrogant ","useful":3,"cool":0},"XkQ8Tbcc-VNb-SdJxQUx4A":{"text":"I came in to hopefully watch the Boston Bruins game.  The bartender Jamie was very friendl","useful":0,"cool":0},"_7ojTBhdHf_KUmWEYpDcCg":{"text":"Throughly impressed! I ordered the hang over burger, this is the one with an egg on top! T","useful":1,"cool":0},"CD_QgHl2n_l9ysXlI3nbcQ":{"text":"Walk ons used to have a very good turkey burger, but not anymore. They switched patties an","useful":1,"cool":0},"3MHgXxWK0u-1nQGy7dvVXA":{"text":"I had never been inside Walk On's but had ordered their food from Happy's next door before","useful":1,"cool":0},"Q7veWknUZp8ug6jNynFtJA":{"text":"My first experience was just after it opened and it was horrible. I have it a second chanc","useful":0,"cool":0},"3FG-yCykPUxXihpi2XA0Wg":{"text":"Had the cajundillas with grits. Both were very tasty. Hubby had the shrimp Po boy, which w","useful":1,"cool":0},"GUE1028EnWNKIGJ8CPivPg":{"text":"Wonderful addition to the CBD!! You won't be dissappointed if you are a sports fan!  \n\nThe","useful":0,"cool":0},"kKoHSDuZXoMUMk-mF0jy-Q":{"text":"We had lunch at Walk-On's twice as we enjoyed it so much. My friend was a huge fan of the ","useful":0,"cool":2},"GYiChBs0EMsvSULOWQ6wyg":{"text":"One word CROWDED on game day! Fun atmosphere but don't plan on getting drinks or eating in","useful":2,"cool":2},"FWdyz0jg-MeSHZII5RCUrA":{"text":"NBA playoffs!!!  My boyfriend and I were excited to spend a whole day drinking, eating and","useful":1,"cool":0},"2zDYaMtdRs4IcSy_rovasg":{"text":"Service was great considering it was a game day!! Didn't try the food but it looked and sm","useful":0,"cool":0},"oaO8yjb6-mcMAD5z23r7-w":{"text":"Standard sports bar, shrimp wrap was fine, nothing to write home about.  Litre of purple h","useful":0,"cool":0},"iJTHtOzJBz-2B1DDs0iahQ":{"text":"I love this place. My sister was in town this weekend and I brought her and her boyfriend ","useful":0,"cool":0},"VEBkwvcjzxJJVNZCWEUXhw":{"text":"Standard pub food. We asked for a cheese burger and fries. The cheese was cheddar that was","useful":0,"cool":0},"LXZA3N6zs7m92Um4iqi_sg":{"text":"Met up with 3 friend a few weeks ago on a Sunday.  Food was good. The real reason I'm leav","useful":0,"cool":0},"-owIuqJnjdQjyQHCTS_MuA":{"text":"I knew what i was getting into with this place. Its a Louisiana themed hybrid of Chili's a","useful":4,"cool":0},"1eEJNuhlHlS5MuUnG_87tQ":{"text":"This location would obviously be a good atmosphere for a sports event. My dad really likes","useful":0,"cool":0},"KHnG3c4-exI-t5i6uZpjmA":{"text":"So I'm from Philly and wanted to go to a sports bar, and yahoo said that this place was #1","useful":0,"cool":0},"9Aaaw3R4X9yG-w2oYFiG4Q":{"text":"My friends and I sat around here for about two hours early on a Saturday afternoon. The mo","useful":0,"cool":0},"iedeVZBf0qUAGKghRho5Bw":{"text":"My turkey burger with waffle fries were really good. I was really happy with the way the t","useful":1,"cool":0},"CCxziruXqTNBhsnYFWyxIg":{"text":"Came here to watch TNF in November. The staff was nice, there are ample TV's, and I liked ","useful":0,"cool":0},"fP2wYS_zKIPoF_wOr_j5yg":{"text":"This place came in handy for a late night dinner run, Fortunately it was only a couple of ","useful":0,"cool":0},"ZUn1ohaYV85aHErxE6_gwg":{"text":"It's a typical sports bar with the similar food and drinks. They do have New Orleans inspi","useful":0,"cool":0},"v3oPhD2ZzLdcwuJPJi6xXQ":{"text":"If you are in a hurry stay away from this one. The hostesses were not friendly at all, act","useful":1,"cool":0},"RcpcPMSFt5Fi8mIRMxw49Q":{"text":"First time in New Orleans wanted to experience different foods and locations. While riding","useful":0,"cool":0},"_FxFGrg-DjkeD-SeJ8hfLQ":{"text":"My first visit was a few weeks ago and I must say, the service and food was amazing. The e","useful":0,"cool":0},"AsguAGfSfDYj3gmoa8PofQ":{"text":"Portion size is great. Enough for two to share. Prices are good, variety of options and fo","useful":0,"cool":0},"QlzKx-dKjMWO_ACrgQEcYA":{"text":"One of the worst grilled chicken  sandwiches I've ever had. The cheese sticks were good.  ","useful":0,"cool":0},"5rImF_lt2L-zZAEaiv1-KQ":{"text":"Nice sports bar with plenty of TV's. I came to watch a playoff game and was promptly seate","useful":0,"cool":1},"YCxMN04HpZbLOUD086SLug":{"text":"Cold food, tough menu, and long wait when it wasn't busy. Servers were very nice and did t","useful":1,"cool":0},"xOzSE9Eu4Fh8EN1TcK1beg":{"text":"Not happy with the service at all! The food was not great. They made a small attempt, at b","useful":0,"cool":0},"OXGIWAkx2uGaWsC4heL7pg":{"text":"This is a great place to watch a game. Just don't order any food. Our queseaux took foreve","useful":0,"cool":0},"zYZzH-3WsQc95XIFEFXyew":{"text":"First time at Walk On's was earlier tonight and the food was really good. I split a starte","useful":1,"cool":0},"lX0xi9318o2pBPPg7vtTtA":{"text":"I decided to go to Walk-On's for lunch since it is walking distance from work and I had th","useful":3,"cool":0},"Df7hVJO0Is-b7LeyiZfahQ":{"text":"Good service, no lines/wait. Came here a little after noon for Sunday football. Lots of bi","useful":0,"cool":0},"oFC8b3cQnZlbNmvzq6eohQ":{"text":"Ahi tuna wrap and corn grits were tasty.  A different variation of traditional sports pub ","useful":0,"cool":0},"DGERePnYrpBBTb6pC9soCA":{"text":"Terrible service. Multiple orders came out wrong, the food was overly salty. Burgers were ","useful":0,"cool":0},"kYiFOgJa_vi2JY9hvq0UGQ":{"text":"If I tell you this place is awesome it is. I ate my appetizer before picks but it was the ","useful":0,"cool":0},"aIjjwSFToKnir_WteFPfRA":{"text":"Good food, but the servers and management were terrible. During the sweet 16 games, they w","useful":0,"cool":0},"5xLFnecxN18WyxyHwEkU_w":{"text":"Heard great things about this place so I was bit disappointed.\n\nI was there just to watch ","useful":0,"cool":0},"RbxJd_UIM4ZcWO1RRqOuKQ":{"text":"We stopped by Walk Ons before a night out in New Orleans and while the restaurant is in a ","useful":0,"cool":0},"0el9v4QgOfPpoz1Su6wKnw":{"text":"They tried to rush us out 30 minutes before closing and started cursing loudly when my boy","useful":0,"cool":0},"KCLQJwvPRcfe3ddAKsgv_Q":{"text":"Downtown New Orleans is an experience in itself. Located a block from the hotel I stayed a","useful":0,"cool":0},"VB2LvqHY6AIQnU4ZT4JezA":{"text":"I am from Florida and I was in town for the George Waters concert. I was was hungry so I c","useful":0,"cool":0},"v0ZsZhkxVoKy3tPBAmm0Vw":{"text":"Ok food if you like everything fried but the staff are all overweight and horrible attitud","useful":1,"cool":0},"IEWfUT0BIawMYURpBoyReA":{"text":"Let me start by saying that this place should be renamed \"walk outs\" because after twenty ","useful":3,"cool":0},"mEkSoQrYwaONZ1Q-eMKc2w":{"text":"I went here on my last full night on my New Orleans trip. I was ready to watch the Sunday ","useful":4,"cool":0},"69du0mILTLDZ7MFsuCv5GQ":{"text":"What a disorganized place. Long waiting, lots of empty tables, staff poorly functioning as","useful":1,"cool":0},"u-34zdzsOIpNKd3t5eKHYg":{"text":"Great food, reasonable prices, fun atmosphere, and the best bread pudding I have ever had.","useful":0,"cool":0},"81jBlqZKBWg6zUCBVTqMIA":{"text":"Best food we've had in NOLA so far!  Blackened chicken sandwich was extremely flavorful an","useful":0,"cool":0},"9RmS-ywQ1caLFr6Uj7_v7w":{"text":"We showed up on a Sunday to watch some NFL football (and your Saints during an away game, ","useful":1,"cool":0},"yoIcsOKTzS2_DyQelQCKPg":{"text":"tried the bayou shrimp pasta. Plenty of sauce. Came out hot and quickly.  Sauce not as fla","useful":0,"cool":0},"ki5RmMLvnszurZjGPEbaew":{"text":"First \"tummy tickler\" in my hometown. Awesome spread for lunch, this is a fav spot of mine","useful":0,"cool":0},"QfcrKQkhB3kbB3lVj1RnWw":{"text":"Food was great and more affordable than most other places. We ate here twice on our trip. ","useful":0,"cool":0},"-ezJpXQJgXl14xIiXTHMtg":{"text":"My friends and I sat around here for about two hours early on a Saturday afternoon. The mo","useful":0,"cool":0},"3voHMlHEKYBaNGOIYcflHg":{"text":"Surprisingly some of the best NOLA food in NOLA.  The alligator bites were the best we had","useful":0,"cool":0},"_S6rUJajIvwgkUtII-oaOw":{"text":"Service was horrible!! Only giving them 2-stars because of the mgr. First, it took almost ","useful":0,"cool":0},"nDIxY2NSRE0LtarEI061nQ":{"text":"I came here once after I moved here and didn't know any better. The food, while good, is n","useful":4,"cool":1},"O7aQKebb7Bj25TOBTXSmyg":{"text":"I came here last night with my boyf. and two other couples. I got here a little earlier th","useful":8,"cool":7},"vStSB1Vd5HwIKnW4IiYN4g":{"text":"Hire some girls with brains and not just because they're 16 and look cute in a referee out","useful":0,"cool":0},"0x6506usI3WP-FdVnP47EQ":{"text":"One of the worst sports bars I have ever been to, if not the worst! \nThe service was terri","useful":1,"cool":0},"xy0CM6aMfp9XcDDS7letdA":{"text":"you knwo what - it works - it's a sports bar with a good menu and snappy service - plate o","useful":0,"cool":0},"sG5B7yYAF1RHZyhMf2rQcw":{"text":"Well where do I start with this horrible experience! We decided to patronize this location","useful":0,"cool":0},"Zm3m9vLdluqDlaBiwnc0WA":{"text":"The shrimp & corn grits are delicious. This a neighborhood spot, so it's a casual spot.","useful":1,"cool":0},"1cgHEEqKFsHnKT-D3feddQ":{"text":"Edited 6/23/18 - Someone hated on me about my review and while my original opinion stays I","useful":0,"cool":0},"TcN9GTCP62Adml0YsNQRuw":{"text":"REally want to give them 2 stars at least....food is average, service is overwhelmed a bit","useful":2,"cool":0},"s9tg3DH2fJLRWbQFuJ-Jxg":{"text":"We are in town for a work conference and dropped in for lunch, I am pleasantly surprised t","useful":0,"cool":0},"yTUKUCCsRxVk6jajhbWH7g":{"text":"Stopped in for a quick dinner one night and had a good time.  Good food and drinks, kind o","useful":1,"cool":1},"AJnR8ZpNR88_sI39SW995w":{"text":"We stopped here for dinner to avoid the French Quarter area because we were already beat a","useful":0,"cool":0},"DSEKMlrszyo101PNR2ZVuw":{"text":"Good service, slow kitchen, pretty good burgers and waffle fries. \n\nThe food comes out a l","useful":0,"cool":0},"3wnfouFjma_RIX5RA6IdDw":{"text":"Chairs and benches are hard wood.  Not very comfortable if you want to watch a game.  The ","useful":0,"cool":0},"8sw1GlVRXpdxqCC2ad_bPA":{"text":"Food is very good, and the staff is really nice. I only had to wait 30 minutes to be seate","useful":1,"cool":0},"dNeLzwu3wqxy0lRn053UJg":{"text":"Very disappointing, such a popular place and have heard many positives on the Baton Rouge,","useful":2,"cool":0},"NsUJE0PPgQx7zPHAd065OQ":{"text":"We went in late on a Sat. evening. Waited on pretty quickly but had issues with our order.","useful":0,"cool":0},"CqDzf6M73rf3pvcYw5-1gQ":{"text":"Dismal. We had a terrible experience, and no one seemed to care.  We came to Walk Ons afte","useful":0,"cool":1},"bZo74Je6uqu_s61BeVLEmA":{"text":"Good for Games!\n\nI've been here a handful of times. I can't say the food was that memorabl","useful":1,"cool":0},"sG_Q74Z3JXVaYheLjT7QPw":{"text":"Got very ill after eating here. To top it off the food was at best mediocre. Barely avoide","useful":0,"cool":0},"vJhraNUc_5dIUIHFScVPWw":{"text":"I am totally disgusted and unimpressed by this place. The only thing I enjoyed was my Abit","useful":0,"cool":0},"rbSnZlad8J2sTsIRFWFX0Q":{"text":"I love Walk-Ons' tables with beer tabs.  It's a great idea for a sports bar.  Other than t","useful":0,"cool":0},"uHnA_C3v3x4Zy5YzUVVwBw":{"text":"Just got here for the LSU game and the hostesses look angry. Hope the tone changes once we","useful":2,"cool":0},"Eehf_9pIzCSdQqte5sOasg":{"text":"This restaurant does not have much to offer. The service was subpar as we were told our ga","useful":0,"cool":0},"VUCE1l7rAr-hW6_jPhqDYQ":{"text":"We went to walk on's for a friends birthday....the staff was nice, our waitress Lindsey wa","useful":1,"cool":0},"bayXwmopiFUDbckQ6Rs28Q":{"text":"First Time\n\nGood food and good service\n\nAngels on horseback app was awesome and I had the ","useful":1,"cool":0},"PwMDa1-6qT-yNrKe8C_vzQ":{"text":"I dined here recently with a large group. I tried to call ahead to give them a heads up th","useful":1,"cool":0},"BIp3AtrgTXn0aWX1IybMPQ":{"text":"The Mardi Gras Mahi is by far my favorite thing! Great place to watch a game and have an a","useful":0,"cool":0},"Urr5gWaq9iQom3Mnj-O_sQ":{"text":"Excellent sport bar!!! Food was delicious. I recommend boneless wings with sweet spicy sau","useful":1,"cool":0},"HfLJf2iJC35t74INJNaT6Q":{"text":"If you know what a Hooters or Rudy's is, this place is definitely related. The waitresses ","useful":0,"cool":0},"6Dlk6ps7BLLkQUB-X4NFRQ":{"text":"Horrible hostesses; told us it was a 40 min wait and when we walked back up to check, they","useful":1,"cool":0},"8GGNmg7C0ivATHzvj6vbOg":{"text":"Walk On's seems to be announcing new locations like crazy. The food is OK and the place is","useful":0,"cool":0},"i6p7STDGSwPX7cMQkcteoQ":{"text":"Bartenders were fine.. kept coming around asking how things were. Asked for a simple grill","useful":1,"cool":0},"Pu2DGEYS8XJ4sA7AlSMqTA":{"text":"Good sports bar. Came here for lunch got the chicken fingers and they were hot. Plenty of ","useful":0,"cool":0},"WJgIHkuNoef3U6R5UqMGSw":{"text":"No one should go to NOLA and eat at a chain restaurant, but we were so exhausted when we g","useful":0,"cool":0},"sv7yTH-SwVZSut63X-hrSw":{"text":"This is a good meeting place for a group if you are downtown for a concert, game or the li","useful":0,"cool":0},"YJsqt_HX1CtS0Zr8sFgUQA":{"text":"The food was unsatisfactory. The pickle chips were too salty to eat. We sent them back and","useful":0,"cool":0},"4lxmnDawExmsWoZCFubQQg":{"text":"Christina was a Diamond in the Ruff . SHE was on top of all her Steps of Service . Excelle","useful":0,"cool":0},"H902LjJM6CdxtTNupM6efA":{"text":"Came here during the Super Bowl to watch the big game. Sat at the bar.  \n\nIt's a great pla","useful":0,"cool":1},"vBKnXNxmeoIOpEMICPKWaQ":{"text":"Food is OK. Cheerleader service is \"meh\". I sat for 45 mins waiting for my wrap, which nev","useful":1,"cool":0},"wluAmG6qeA-981i0CsOlgA":{"text":"Took an Uber here to watch the game. Was intending to sit in the bar, eat and watch the ga","useful":2,"cool":0},"G8IGQGHVGqJElXc-xAPvPQ":{"text":"Horrible horrible horrible that pretty much sums up the subpar hostess, the less than medi","useful":0,"cool":0},"1H-CoMmVsWRRHV6My6KNag":{"text":"Very nice place to watch the games near Super Dome. Love Baton Rouge location. BUT the bar","useful":1,"cool":0},"5FgqGgNsQHoI9hNXuoWwbg":{"text":"We heard this place had mixed reviews, and they were right. Its a typical \"Applebee's, Chi","useful":1,"cool":0},"mSTrp61eeeX9fR7j4KPaMw":{"text":"Me and my girl went in asked how long the wait would be and they say to us 30 min...I've w","useful":1,"cool":0},"eyCpi9KeQzvUJLdUKZobhw":{"text":"During the Saints games the customers are FUN and the food is pretty good, BUT the bartend","useful":3,"cool":0},"KPoSjsN_xWa7aRqIKvbJZQ":{"text":"Might oughta change the name to Walk-Outs.\nThe food here might be awesome, might be terrib","useful":1,"cool":0},"Vs0ySfVikvV7pTnm0ilDBA":{"text":"While the food was good, got the etoufee (I've had better) and gumbo,  prices good, I walk","useful":0,"cool":0},"qe1MZ0WgzvwO7plU3qBDdA":{"text":"The food was good. I got a stuffed burger and wasn't really impressed or disappointed. The","useful":0,"cool":0},"EEFI4le_V-rsB0DboAfgVw":{"text":"We had the buffalo chicken sandwich and a Cajun quesadilla both were great beer on tap at ","useful":0,"cool":0},"xslGEC6o51jAmwniXW42yQ":{"text":"Fantastic! The food was really good and portions were massive but for reasonable prices ec","useful":0,"cool":0},"92X2vr8M2M8M1O14bzhiwQ":{"text":"I wanted to give this location a shout out as I went yesterday during Wrestlemania weekend","useful":3,"cool":3},"OfkCf2JuSAso705sKeKjMg":{"text":"I appreciate the manger working to get my game on one of the TVs.  I would also recommend ","useful":0,"cool":0},"8hlhW9UwQGSzd8aS7SvZpg":{"text":"Remember to read the happy hour menu carefully. The signature cocktails are only $3 off no","useful":1,"cool":1},"4bmaHOTYyF2nYrLDV8ClbA":{"text":"Came upon Walk On's from the other Yelp reviews while we were looking for a place to watch","useful":1,"cool":0},"4GT-I_4IB1y5DtPPQKAMCA":{"text":"I am currently listing to port as I type this.  You'll have to forgive me, I had a Big Jac","useful":2,"cool":0},"vJ1b1dGFrx7qLra0Y7rpiA":{"text":"We sat at a table in the bar area shortly after they opened on a Saturday. The service was","useful":1,"cool":0},"HZmMz2co3TfffK8oQdjehg":{"text":"Kind of like a cross between Applebee's and Hooters...which ended up working out well.  Th","useful":0,"cool":0},"8SB7UgxhlCLK4jl50PVtMQ":{"text":"We needed a quick, nearby, sit-down place to eat before our flight.\n\nThis is ESPN with a f","useful":0,"cool":0},"Sr_JPiivnZtvaI_uG_d_oQ":{"text":"Great atmosphere and great food from burgers to mahi with tons of cold beer options! I usu","useful":0,"cool":0},"A0-Qn8wPnFZVMuAHRZ33Sw":{"text":"Food good. Service is horrible. Manager is slow to resolve internal issues. Staff if young","useful":0,"cool":0},"XmXl8Prvfaf1NlQyLtKygA":{"text":"I would think this is a great place to watch a game. There are TVs everywhere. It does fee","useful":0,"cool":0},"Oo54ZxmNFoywlB452dKOGA":{"text":"I went to Walk-On's with some co-workers for their complementary lunch today.  Since it's ","useful":3,"cool":1},"vSeDQ_IeUipdZzw4Q_D64w":{"text":"We ate here a few weekends ago and loved everything. Great food great drinks and great ser","useful":0,"cool":0},"CCFPN54IugBmRmAhbu_DoA":{"text":"Omg! It's so hot in here and it smells like, oh never mind, you get the picture. On the br","useful":1,"cool":0},"A-r-GRIPMt3-vUPzwQAgRA":{"text":"There's a few obstacles to getting food here, and here's the order you'll have to face the","useful":1,"cool":0},"g3g3dWFoVSYhXQTs4ctGyg":{"text":"Walk on past  this spot.  My fish had seen better days, it tasted.....not fresh.  The wait","useful":1,"cool":0},"ZvJqREEiEgYw2FuRsGnpZA":{"text":"Just got back to my hotel with a takeout order from walkons.  They left the chicken off my","useful":0,"cool":0},"5A1lJX74lZVpAbWNE7_rSg":{"text":"Typical sports bar with TV's taking up more space then it should. Young, fun, friendly sta","useful":1,"cool":0},"aNX44_xpoOLbmxq1fSZ6CA":{"text":"Always way too packed with bros and basics. Food is okay and drinks are expensive. Service","useful":4,"cool":0},"TP_NgqAzP2pFHaJPbQABtg":{"text":"I generally don't leave reviews because I just think that the dining experience really dep","useful":1,"cool":0},"tJV6HmsdKXjBC0y8GFOnSQ":{"text":"Walk ons was just okay, but with great potential! The service was decent, but she didn't s","useful":0,"cool":0},"4tvRCUx1V_Df-U9R1jFaeg":{"text":"Sometimes one's opinion is colored by ambience.  Personally, I couldn't wait to get out of","useful":2,"cool":1},"zNcaWUQyEU3TbXwbWwziGg":{"text":"Voted the #1 sports bar in the Nation by ESPN so need I say more? Awesome food, ice cold b","useful":0,"cool":0},"HXbHSjiUa1fjmMu_l_90-g":{"text":"This location wasn't even on my radar as a \"must stop\" in New Orleans, but I am so glad we","useful":0,"cool":0},"du29JRNhXx9TArYou3AzcA":{"text":"I loved my fish & etouffee. They had a basketball game playing so that was all I needed. W","useful":0,"cool":1},"DJbuyDMrzD_YqVV1RlXbRg":{"text":"I honestly probably wouldn't ever have put this on my must eat list when visiting New Orle","useful":0,"cool":1},"h32L301kKGzIkti8ldiPoA":{"text":"This was my second trip to Walk-On's.  My first trip was great since my friend knew someon","useful":1,"cool":0},"1CTnGPOmeV-_VjdB7x8i6w":{"text":"Boom boom shrimp poboy was pretty solid. The duck gumbo delicious. I enjoyed this place. T","useful":0,"cool":0},"ej4p2u4k15HOyddZ_ByGQQ":{"text":"Ahi Tuna salad was perfect and fairly priced. I was pleasantly surprised\nAt how good this ","useful":0,"cool":0},"5LZ6DD1tXRUK1Boysb3rCQ":{"text":"Everything is pretty overpriced, nine dollars for four mozzerella sticks. Come on that's r","useful":1,"cool":0},"Gyi-X57WlvMYj7OUmEhROg":{"text":"I've been disappointed with sports bars in NO but this is a good one. Lots of TVs, has a b","useful":1,"cool":1},"_lTGipgt5lZFyDSxC8CWxg":{"text":"ssurprisingly good food at this sports bar! I had catfish with a Roux of shrimp and crawfi","useful":0,"cool":0},"6qZi8vU88dE3hv5zWwnu3A":{"text":"Called ahead of time to reserve tables for the Superbowl.  Alex was extremely accommodatin","useful":0,"cool":0},"_P4mhNJkGbv8vcTUsMAJxQ":{"text":"Love the keg taps at the tables..food is okay, definitely bring an appetite and friends, t","useful":0,"cool":0},"F9jYugyCVs8HZZFT9WJw2w":{"text":"Quality of service is very bad \nIf you order anything expensive\nOrdered salmon took 45 min","useful":0,"cool":0},"NsINZNaVrhBNPJ8tkJAoiA":{"text":"Great place for a bunch of guys to get together and have a bite after a long day traveling","useful":0,"cool":0},"Fn1F9XZsGbdGGPmFhdX0Tw":{"text":"Great location in the heart of the CBD!  The turkey burger was a-h-maze served on a sweet ","useful":1,"cool":1},"J6QzNGwdHuYY3I9qnXKdQg":{"text":"Food portions were huge! The BBQ Chicken Salad was really good - could feed two people eas","useful":0,"cool":0},"Wokv6QtpUktITcn_NXrRRg":{"text":"Typical sports bar drinks were great food was decent but the service was absolutely phenom","useful":0,"cool":0},"_xnzTck0LTrnork8mtG-oA":{"text":"Wow! Went there twice in 4days cuz soo good! Excellent Cajun and fun cocktails, great serv","useful":0,"cool":0},"5SbxEod1aDHkYzJjeHy8ig":{"text":"Been working in the area never been to a Walk Ons before. Th r menu is great. The service ","useful":0,"cool":0},"oxHNiC-lt0_-53drX9uSog":{"text":"Nice sports bar that has a solid lunch menu. Lots of well located TVs. Waitresses wear som","useful":0,"cool":0},"v4QIT5a3IbG3sgxqPnciQg":{"text":"Great place to watch a game. We had a big group of us and they had 4 different games on. T","useful":1,"cool":0},"j67trluIokNOsRCgNzVKEw":{"text":"You don't get service when high school girls are allowed to run the place. Free for all wi","useful":2,"cool":0},"D3mrV6XcZ9mJyxrvcXyUkQ":{"text":"Food was okay, nothing to write home about. Husband said his food was salty. Spent $91, no","useful":1,"cool":0},"EpLdYB0o_ZGNcQyPBn84Gg":{"text":"I had a horrible experience here last week, even though I was just picking up food. I orde","useful":1,"cool":0},"U-rXk-glX6t6ZD7YDQdc7Q":{"text":"Went there with family (parents, sisters, aunt, hubby and 4-year old daughter on a Saturda","useful":0,"cool":0},"oUdM5IgNPYfawU_usW1pJg":{"text":"This place is a typical sports bar. The servers are all petite and wearing skimpy Hooters-","useful":1,"cool":0},"Dm7S0bAGCCgcxBkjUld7ug":{"text":"Seeing that I spent entirely too much time at the Baton Rouge location rather than studyin","useful":3,"cool":0},"ey_xEmNMGfFKDuwy9ah6aA":{"text":"The drinks are great, and the food was delish!  If you're ever in the downtown New Orleans","useful":0,"cool":0},"3EuQzZOfjHAbKmEYtI40DQ":{"text":"Our server was Karion, excellent waitress she was so kind and very sweet. She seemed to re","useful":0,"cool":0},"G40g4SwPkAKNdOWznlf_Tg":{"text":"I'm going to write a review based on the service and the food--maybe one of the few.  Ther","useful":16,"cool":4},"Hcl4EzjtkMYEd5llhpdeZQ":{"text":"Walking thru New Orleans got a recomendation from a doorman at Hilton for good N'Orleans f","useful":1,"cool":0},"mj7bx1bXsPvT76aBdN31gw":{"text":"I came here  on a visited to New Orleans. This place was recommended by the hotel, and it ","useful":2,"cool":2},"mMxCAYA0HLr5lhzm5HYTdQ":{"text":"It was my first time here and ....\n\nWell let me just say that the food is tasty. The servi","useful":2,"cool":0},"ku2iQBjMf3mHy6_0AHBkXw":{"text":"Kinda over priced, but the food is good. Drinks ares definitely over priced. It's pretty s","useful":0,"cool":0},"_KImqnA7Wjyd44jmJRdGEw":{"text":"Ordered delivery through the waitr app. Ordered an extra scoop of ice cream with my desser","useful":1,"cool":0},"eWAhDzEJ_3KOVunup2E7Jw":{"text":"I honestly don't know why the star rating average isn't higher. It's a sports bar. And for","useful":0,"cool":0},"RIeSHhKbbxocEyN7wIXL3Q":{"text":"It was my first and last time for this place. The servers are rude and the food is mediocr","useful":3,"cool":1},"Yx-0Eb4RYk98JEeMvf6hCw":{"text":"Typical sports bar in my eyes - tons of big TVs and the usual fried everything on the menu","useful":0,"cool":0},"XdysjfMwe4sYQBKdSlroGQ":{"text":"It's time for a re-review because I have been here many times in the 4+ years since my las","useful":7,"cool":6},"nqUzgtQ1V1MRewlda8_vJQ":{"text":"Went here because someone told us they'd have either an MLB package or at least MLB networ","useful":2,"cool":1},"At57dWtQ2Xo3BaLB-yOudg":{"text":"Good food but horrible and extremely slow service. Literally 30 minutes for a round of dri","useful":1,"cool":0},"FosNDKmwxK3aL8zEiqAhnw":{"text":"Only giving it one star because a woman at the front desk assisted me but I go to bar to p","useful":1,"cool":0},"vEfut7qiCm8tUpPwcLoE6g":{"text":"The place was packed--the Hornets were playing at the Hive, but I was alone so I went stra","useful":0,"cool":0},"9Lx3drARatQlCM7T8Xtq6Q":{"text":"Stopped in here on our first night in New Orleans. We had an event to attend so didn't hav","useful":1,"cool":1},"mlY5WD3l_Z36kZk0R9Vhfg":{"text":"Good drinks, food and atmosphere. Had the fried lobster tails which were excellent. Also h","useful":0,"cool":0},"cV5vz4BRHwYgvJx3P0xZog":{"text":"Super cool sports bar w gazillions of tv screens and delicious food!!\nMy husband and I cam","useful":1,"cool":0},"RqLJAPJ4fwfIxGjC5Dvsgw":{"text":"Absolute best food for game day or any day. Appetizer always recommend the cheese fries an","useful":0,"cool":0},"QlFbMR7gAz6F1K747y5X9Q":{"text":"Visited twice while I stayed at the Homewood Suites just down the street.  It is a sports ","useful":3,"cool":0},"0UDJzB1zItwmc-TFLpwOhQ":{"text":"Our server was Karion, excellent waitress she was so kind and very sweet. She seemed to re","useful":1,"cool":1},"OldKHDOK88ceQ1IXyo9YdQ":{"text":"Such potential but lack of vision in  what sports fans need in a true sports bar. If you w","useful":1,"cool":0},"a8QRmJf2dAgtDkW8DYXQ2Q":{"text":"We were in the mood for burgers and stumbled upon this spot and so glad we did! We came in","useful":0,"cool":0},"m7nzCvWafNFH5YDULsk5vg":{"text":"I ate here for lunch with my daughter. It's a sports bar & grill type of place, but it's n","useful":0,"cool":0},"uPh71P1scG9yc_qoRE1zxA":{"text":"Sssssslllllllllooooooooowwwwwww! Brought everyone's food but mine. Finally brought it ten ","useful":1,"cool":0},"PWsyFfJPRLmY8sAmthMotw":{"text":"Highlights: Walking distance from the office- can't beat that, especially considering that","useful":1,"cool":0},"GTwI4SIWl6buKHidtSwW4A":{"text":"Excellent sports bar : great service , servers were very nice and the food was excellent","useful":1,"cool":0},"U28-wdND6VYfCokZ2tPFOw":{"text":"I visited this location of walk on's on saturday to catch the lsu game with some friends. ","useful":0,"cool":0},"KYM-HKZVBq-XjDtVsg7BJg":{"text":"Staff was friendly and efficient. We were not impressed with the food for the most part. T","useful":0,"cool":0},"GH3EH9J9vkbE3r7OEs-k7Q":{"text":"Both the food and the service here were amazing! Don't believe the low star rating! We got","useful":2,"cool":1},"GI8nUgJEacaLgRLRV1FVww":{"text":"Everytime passing this location on Poydras I always say to myself  \"man, I need to visit l","useful":5,"cool":2},"3EY1caCAwU_NtW5_bJ1MIw":{"text":"The server outfits are really cute. The host was really friendly. The server wasn't the be","useful":0,"cool":0},"_iD0C6oseJciIX0dCK0fgg":{"text":"I am only saying a 4 for I have never had a gator wrap or seen the beer taps at your own t","useful":0,"cool":0},"kciksbcQF6NKE-QBQrwA9Q":{"text":"We went to Walk-On's fairly early on a Sunday.  There weren't many customers yet, so we we","useful":0,"cool":0},"23yrUOlinnlWiLfT605Ukg":{"text":"We needed a spot to watch the NFL games on a Sunday morning following brunch.  This was wh","useful":2,"cool":0},"rZm28o_cEtWAOXfPDrsXDA":{"text":"This place has a lot of great things going for them. Draft beer taps at the table, lots of","useful":1,"cool":0},"otauoG1pdMN04zQEsmPZzw":{"text":"This is such a disappointing place. A fancy chili's. I mean it's a regular meal and the pr","useful":1,"cool":1},"F09d0CcPK5GpDuHjks_jEw":{"text":"Great place with close parking. A plus for New Orleans with construction and way too many ","useful":0,"cool":0},"uEXH356sdLTbOjAmI08WGg":{"text":"Our waitress was more then amazing!!! So sweet. We went in hung over and overly dehydrated","useful":0,"cool":0},"4T7EL0oR19MwXk3allZ8lg":{"text":"Our very first meal in New Orleans 6 years ago when we came for our daughter first college","useful":0,"cool":0},"ee84zlGQqFw4Y7JCSFnh8A":{"text":"Came here for my lunch break. I had a burger and it was amazing. Really enjoyed it. hope t","useful":0,"cool":0},"g82tp1k1I_2q6bAlz3dkng":{"text":"I ordered Crawfish Etouffee and it was overly salty and the crawfish was bad. Also, the ta","useful":0,"cool":0},"oDYTCbF_ySECijKSsoZWXw":{"text":"3 stars for food. Had the fried shrimp platter and it was spot on. I sat at the bar and th","useful":0,"cool":0},"DJ7zBYakImU9kUqrNBYxoQ":{"text":"Service was slow / poor and the food wasn't any better. Dinner took a LONG time to arrive ","useful":0,"cool":0},"JWccIQM5zUWb4kSiDLsp7g":{"text":"Delicious food here and surprisingly they treated First Responders for free that one day. ","useful":0,"cool":0},"AXTUNAMrrOaRfUasETh0pg":{"text":"Walk-On's offers an excellent sports bar environment, replete with the requisite number of","useful":0,"cool":0},"HfnpYtGm6iHCiPvqGAh-Dg":{"text":"Love Walk-ons, first tried it when I was sent for work in Shreveport. So I wanted to try i","useful":0,"cool":0},"WhQBfNsIbp4JQ7ClefbtPw":{"text":"solid sports bar in NOLA. Tables have draft taps which is pretty cool. The waitresses are ","useful":0,"cool":0},"vX7I7JtQiQSWsC3PdbhDqg":{"text":"This one is tough to rate and really unfair to the chefs because the food was great. No co","useful":0,"cool":0},"tAxlYYgoQ_-h_8FpDXDZZg":{"text":"I wanted to like this place. I really did. My mom and I went here during our vacation. We ","useful":1,"cool":0},"ZVw4zZ5vHuZlOYjd5ZBd_w":{"text":"This review is for the bar only.  I didn't eat anything here.  We showed up to watch a Sai","useful":2,"cool":0},"wc-YEadyj9VvtsQsudyj8Q":{"text":"First dinner in Nola for the trip. My wife had the cajun chicken sandwich with hush puppie","useful":0,"cool":0},"6rJEiQPJuuXwzO5X1JvVVw":{"text":"Actually 5 stars regarding NFL viewing accommodations! We had a good view of our home team","useful":0,"cool":0},"vae0Zf5_VUvvWXlZYqPsPw":{"text":"Finally good affordable food with really great service, had the best server Miranda the de","useful":0,"cool":0},"9dm5hUlhbb0_Grt5ILzSXg":{"text":"Great location in downtown New Orleans. Food was amazing and drinks were just lovely.","useful":0,"cool":0},"-gDMr2xDvaasIbPDcCn7_w":{"text":"Love love love the food and drinks. Only thing i wish the severing of crawfish aww-way was","useful":1,"cool":0},"11KMDuc4_EXT6ePCnijMqA":{"text":"Not bad but not great either. Our waitress wasn't attentive but the fried alligator was ve","useful":0,"cool":0},"8xOyLE63SClRcSmPOXcXvQ":{"text":"It was my first time and The service was horrible.  I had a dinner with some close family ","useful":0,"cool":0},"A8xAno6pi9QKrJem8PanXg":{"text":"We got here by 10:30pm on a Saturday night. Exhausted from our flight & transport to the h","useful":1,"cool":4},"GN5S4eE8FTUlORwIeshfAg":{"text":"Less than 24 hours after posting my original review, I was contacted by one of the manager","useful":1,"cool":1},"W1QjlGTx_GYS0ZAu7d1nPg":{"text":"Described to me as one of the best sports bars in the country but I'd have to differ. Went","useful":0,"cool":2},"lgftMq1pBWqhHxorx1m4EQ":{"text":"Food was really good. Cool place, but the customer service kind of sucked. My friend and I","useful":1,"cool":0},"NqF3ezx9JgRtObl4YmTjdw":{"text":"We asked a few locals where would be the best place to watch March Madness, and the answer","useful":2,"cool":0},"SfHmumozTbnVF0nJDZTfww":{"text":"Visiting NOLA for the weekend and passed by this sports bar, thought we'd give it a try. I","useful":0,"cool":0},"TYrTSZs13YYjWAMrsoeLJA":{"text":"We had a horrible experience at Walk-On's last night. \n\nMy fiancé and I have been to Walk-","useful":1,"cool":0},"tXjJ9bB5QaMlHP-I0cB0TA":{"text":"The food was great. We had Voodoo Shrimp & Bayou Pasta. Both had an excellent flavor. Pric","useful":1,"cool":0},"NbKeFHKAs1t0eqRbV_KHUQ":{"text":"We went in tonight around 6 to hope to get a table for 4 by the 2nd quarter. We gave the 2","useful":2,"cool":0},"0dfw6bCrC-iHW7OKjLQuuQ":{"text":"I had the shrimp with jack cheese and jalapeno strip, and bacon wrapped around it w/ corn ","useful":0,"cool":0},"5tv29kMU-sw2oGPwVQFjZw":{"text":"The food is amazing! The service is awesome! And we can watch every game! I love this plac","useful":1,"cool":0},"ca3EC7VKQDfltzcE5EF1DQ":{"text":"Walk Ons has a great selection of quality food for a sports bar.  I always get the fried s","useful":2,"cool":0},"5m_goIuATrMxO65V5pEYJA":{"text":"For a local chain restaurant the food was very tasty, also some interesting menu options w","useful":0,"cool":0},"nweeTVDHNYZipv39VuqIhQ":{"text":"We went on a busy night,so we were patient. I ordered the catfish and shrimp. My son order","useful":1,"cool":0},"SbLUBeFRiP7i2mef1l2R1A":{"text":"This small local chain was started by walk-on players to LSU's football team. Whether that","useful":1,"cool":0},"05E44n_7sFPMAz9Ssd8CXg":{"text":"Mediocre. There are so many better places in the area... only go here to watch the game an","useful":1,"cool":0},"lj1c8YQLczp6Fxe4iSoTxw":{"text":"Good food terrible service. Waited 20 minutes for our drinks and 30 minutes for the appeti","useful":1,"cool":0},"MGADYB1NwGXKGQ1RXb0ukg":{"text":"Sports bar atmosphere. Plenty of tv. Food is decent bar food. Staff a little undertrained ","useful":0,"cool":0},"0REEcAl-SlTugW8TxFXWbQ":{"text":"Great place!   Lots of TVs and the food is actually good!  Had some boom boom shrimp and h","useful":0,"cool":0},"xmmUBnFXh5UC2Xw83tdVsA":{"text":"Dropped in for a drink and starter before heading off elsewhere for dinner. Bar has a good","useful":1,"cool":0},"UvcYStYHXsTVIEWzOxFX7Q":{"text":"Is this a sports bar? Between locals that want to cry about my friends shouting at a footb","useful":0,"cool":0},"85DE6Nwo5IBycvi8iIXSUg":{"text":"I can't believe I forgot to review this place!  I went here when some friends and I went t","useful":6,"cool":4},"PPHevQ10rP5RKDHRJU7A5w":{"text":"Excellent Mahi Mahi ceaser salad! My boyfriend got a blackened mahi mahi sandwich on chiba","useful":0,"cool":0},"VwfK-JKAhvHph71p5uVYqw":{"text":"Food was typical sports bar food.  Service was slow.  Had to ask for water refills, plates","useful":1,"cool":0},"YxN57UKp9AFE6kTZAp4QuA":{"text":"I decide to take myself out to eat. Went to Walk-ons for the Boom Boom Shrimp. Tried the E","useful":0,"cool":0},"0il_6M5NFRgne8IvIf6oUg":{"text":"We loved this place! Only one bad thing! The restrooms are fkn disgusting. Other than that","useful":1,"cool":1},"Bcbvmn8tgxJZxSXe27WMHg":{"text":"Being an LSU grad, I have had many experiences at the original Walk-On's in Baton Rouge. T","useful":0,"cool":0},"8ehSxcXlo6B5HcXBCOK-Xw":{"text":"The food is always good; however, the service leaves much tone desired.  Being local, ther","useful":3,"cool":0},"sEEyeRJiwfJwtLq_OeDSZw":{"text":"The catfish atchafalaya is THE SPECIALTY! And the servers are so cute :)","useful":0,"cool":0},"zgGynC6MNflsDYOpt2M4mA":{"text":"Walk on's Bar\n\nAfter a good conference opening bash my fiancée and I had dinner at the Wal","useful":1,"cool":0},"PEszOsVpyWlygvr4lNDsWw":{"text":"Service was good. We ordered shrimp Po boy, boom boom (club Po boy), and a delicious hambu","useful":0,"cool":0},"J8jsjjiIOHMkhD42iJM6Ug":{"text":"Regularly visit this restaurant with colleagues, family or friends. Never tried the tap on","useful":0,"cool":0},"G4wmwvn-9yVOmUeC3w0SBQ":{"text":"Beware of the Private Party Room!\nWe decided to make a day out of a Pelican's game.  Got t","useful":0,"cool":0},"5ClA58adQLaf_IpOySvn4w":{"text":"not the most authentic meal you'll get in NOLA, but there were a ton of TVs (what we neede","useful":0,"cool":0},"GDGrEeQZc8Mq0hTkmY9cqw":{"text":"Beef sandwhich was very tender, steak like melt in your mouth\nCheeseburger was awesome, Ca","useful":0,"cool":0},"mOMunnfL1xJMD4qcSniHfQ":{"text":"Just left this place. And for the 4 years I that I have been working in Nola, it's been on","useful":2,"cool":0},"8-b3Hud5ZehZvdHi1gQ8dA":{"text":"Came here to watch the Saints game on a Sunday afternoon. The bar was freezing cold and ev","useful":3,"cool":0},"y_ZehrwlSj4v8c7rmXV80A":{"text":"My hotel happens to be across the street from this place but I plan to come back a second ","useful":2,"cool":0},"OmM7FYkSqnLKFxE6DmTxug":{"text":"I've heard Walk-Ons advertised numerous times on the radio and was one of the locations fo","useful":3,"cool":3},"Mz_aYLQam0gc-9lojdNLDw":{"text":"We went early on a Friday before the Pelicans game. It was busy, but there was no wait. Th","useful":0,"cool":0},"iPOFMOctbNwWhPbtq4o_DA":{"text":"This place was yummy! Very well seasoned and flavorful! Great customer service and hot fre","useful":0,"cool":0},"7q7jaVHcnEiCupVpDd6Q6Q":{"text":"sandwiches were good, french fries tasty and ice cold beer!! great service.","useful":0,"cool":0},"kNCf1Cr-6cHUKv74fjU6wQ":{"text":"Why would I patronize a place that charges a cover during Bayou Classic, but not the SUPER","useful":5,"cool":1},"SbjUMv5nkUTrNtO9S3QMRw":{"text":"This bar was right down the street from my hotel. Thought I'd give it a try since it was a","useful":0,"cool":0},"nVvKzt9EP5Sy0La8UKBcEQ":{"text":"We were there for a concert at the civic on the 15th walkons was the closet place to eat. ","useful":2,"cool":0},"GSIakHkLqqd4413yi2_j_A":{"text":"This place had very lackluster service. Our food took about an hour to come out which was ","useful":1,"cool":0},"EIQrxyxk_8-7R86908OBaA":{"text":"After years of passing this place, I finally walked in with a friend. You get a pretty goo","useful":0,"cool":0},"mt_mGLFhu7oPe2aK0eVEiA":{"text":"We were tired the day we arrived in New Orleans, so opted to stay close to the hotel, and ","useful":0,"cool":0},"DMm5gUEPUe6RfbZojqR4NA":{"text":"Really just had appetizers- they were ok.  My issue was with the wait staff that had been ","useful":2,"cool":0},"k2laVh0R28BPIg6w0hR-yg":{"text":"We came here to grab a drink before the incubus concert and it didn't take us that long to","useful":0,"cool":0},"GA2SSaUwalKJ6icj0gHhLA":{"text":"The gumbo was so so,  I ordered the fried shrimp platter and it was over breaded.   The Se","useful":0,"cool":0},"paFYDX_UAEXsVYw31ZGCLA":{"text":"I had the Louisiana combo and it was great. I ordered mine with catfish and shrimp. It als","useful":0,"cool":0},"eOZvOBboKn_IbKyuNH1Xfw":{"text":"This was the first time we've been here. Went to see LSU/GA game   Went early to get a tab","useful":0,"cool":0},"0mtWaMkHKLrLlCk3EmKY9w":{"text":"very busy all the time, not sure why.  Food is ok, nothing great, not bad.  All the server","useful":1,"cool":0},"058a-CpGUYTO7qIF2DPmEA":{"text":"You can't go wrong here. Everything on the menu is delicious. Third time I've been here tr","useful":0,"cool":0},"R-ITMUKZ_Aa9QC5IVWZQSw":{"text":"I came here for lunch while on a visit to New Orleans.  This place was recommended by the ","useful":0,"cool":0},"zOqilG19P7hDBDY0FFFBGw":{"text":"We came here for dinner on a Friday night. It was packed, but we luckily didn't have to wa","useful":0,"cool":0},"F5o96dDQXGkb5fusx49pgg":{"text":"I've given Walk-On's a few tries, but they just can't seem to get it together. Once it too","useful":1,"cool":0},"ectWy7L_vDugBHBgN7RbBQ":{"text":"Came for a bite to eat, took forever to get food, and the service was slow ... by the time","useful":1,"cool":0},"1TDZCKne2yPsGiiP1fODiw":{"text":"I dined here with a group of coworkers.  The food was good and the portions were good size","useful":0,"cool":0},"AJ6dPdEqmhSeHW1onqpaCA":{"text":"I went back for a third go around. Our waitress was on point, very attentive and fun.  She","useful":2,"cool":0},"W6B2_TNge-yBW5Xe2dVOZA":{"text":"Was seated in the bar and gave a menu. Waited for over 20 min. For a server to even acknow","useful":0,"cool":0},"LY5f1Cp8iriGGrLnK2kSVg":{"text":"Drinks are way too overpriced for a sports bar. Seriously. $12 for a 6 oz cup. And you wou","useful":1,"cool":0},"rIPJS7CRtUNN1sQdshhS1w":{"text":"We went here on our first night in NOLA because it was close to the hotel and we were driv","useful":0,"cool":0},"HxR7LhvQxNpbMyc-d2XVug":{"text":"Great place to watch a game.  TV's everywhere.  A little loud, but what do you expect for ","useful":0,"cool":0},"sqtlH3X0c62dUWRSx1LhOg":{"text":"Got screwed over by the immature manager at walk on's New Orleans because I was a nice guy","useful":0,"cool":0},"9u_iAQZT1gVcQeSp6u6lJQ":{"text":"Walked by this place 2x and never went in because it looks like a chain but uber driver su","useful":2,"cool":0},"QWhUhw-rYPFDzSclhMtteA":{"text":"Had a great time watching the Patriots game today. Lynn was amazing!  Great place to catch","useful":0,"cool":0},"DqI0Cjj6X16mHug8yToF8A":{"text":"The is absolutely a great sports restaurant/bar and for this type of establishment the foo","useful":0,"cool":0},"HaLIVpu9TnXZxwcxgjpBGA":{"text":"Walk-On's reminds me of a T.G.I.Fridays on the West Coast, but more a sports themed enviro","useful":5,"cool":4},"WLHze6zVpQoWH6A_of7u3g":{"text":"We initially walked into the restuarant/bar side to grab a table in the bar area to watch ","useful":4,"cool":5},"_UIQQv1mVAYNy1pTyeVsEQ":{"text":"Walk-Ons is your standard chain sports bar & restaurant. Solid, yet unsurprising. Average ","useful":20,"cool":14},"l848w599Z31CVIMHbXX7Aw":{"text":"WalkOn's is a restaurant not too far from Smoothie King Center. My Lyft driver highly reco","useful":1,"cool":0},"eKTFtjDwIzyAzc_eHoLoZw":{"text":"If you wrote down everything on a napkin that you would like to see in a Sports Bar this p","useful":0,"cool":0},"Vg5QcEPh02Tf5FY7OJap1Q":{"text":"Perfect spot to watch games on NFL Sundays.   The food was very good.  The grilled shrimp ","useful":0,"cool":0},"p-WSTwgPieOgl_YWW0auYw":{"text":"Their waffle fries are sooo good. The waitress was sweet and attentive. Prices are not bad","useful":1,"cool":0},"VJ2JGj8THP7jWMO-wJrRug":{"text":"We went to Walk-On's Thursday night after Muses. We made it 45 minutes before it closes. W","useful":0,"cool":0},"o_qyqXxIt7I3mx8hf-KN8A":{"text":"Was at Walk-On's before the Saints game on 12/23. Carly was our waitress and did an outsta","useful":0,"cool":0},"nVNlunaY9F7z_8ztEOqkBw":{"text":"I was actually pleasantly surprised with this place. We went there with some friends after","useful":2,"cool":1},"0kykFvlgZLkiCOjNUuGW8w":{"text":"My waitress was nice the customer service was excellent and the food was really good I lik","useful":0,"cool":0},"4LH9c_MUMva_hY3GrBMUww":{"text":"I've been to Walk-On's a few times... it's pretty \"meh\" in general. Recently I had the opp","useful":3,"cool":2},"wOxF2Je7Qofnwyk5dCt6pg":{"text":"Came here to watch the Saints game. We were able to get a table no problem and could watch","useful":0,"cool":0},"s1-Rf0nYunFb37IszV7I1Q":{"text":"Not impressed! We went there for lunch and it wasn't even busy, the stuck us in the back a","useful":0,"cool":0},"pYs8AcfdKsimN6FsWPoo7g":{"text":"Great service from the hostess, bartender, buser and server! Bang bang shrimp tacos were a","useful":0,"cool":0},"UE_AaZAh3XJFlPYDyeoN_w":{"text":"Angela was a really fun bartender!!! Always smiling! My drinks were perfect! I order a dee","useful":0,"cool":0},"lBB9B1VnqaEhLrgcg8GWfA":{"text":"Dined in on Monday the 9th around 8pm and had a terrible experience. As someone who works ","useful":0,"cool":0},"szmdkkIiYUXlYwWREJlHAA":{"text":"We came in on a Sunday morning I believe around 11 something and was able to get a table r","useful":0,"cool":0},"TS43Wl7R5VUTuSVcychNAA":{"text":"Our last evening in NOLA, we were tired and decided to find something close to our hotel s","useful":0,"cool":0},"W9Xz-rpQ9B5Rky9DngstqQ":{"text":"Terrible service and food is mediocre at best. Server would never come back and we actuall","useful":1,"cool":0},"ebxabo9HM9787DlEJ__PmA":{"text":"I have already written a review for the Walk On's in Metry but this place is the one that ","useful":0,"cool":0},"EjBcdGeVe7D2DHz65FaHsA":{"text":"My boyfriend and i found this restaurant on google. It was our last day in New Orleans and","useful":0,"cool":0},"ZdAwd4CXgx-wUx35QTIi6w":{"text":"I had my first meal here when I arrived in New Orleans, so I was extremely hungry and very","useful":2,"cool":0},"drvPH8-adNBgH4PhVqWU5A":{"text":"Stopped in to order dessert. The warm cookie with ice cream was amazing. The cookie was so","useful":0,"cool":0},"jWeMDo1pItSM_BDvX0r7yA":{"text":"Came to Walk-On's Bistreaux from a recommendation from the front desk at the Hilton where ","useful":1,"cool":0},"OF6SfF1FhEnGCQ4LLDua_Q":{"text":"Came here for dinner/hockey game with a bachelor party.  I've been to this Walk-On's three","useful":1,"cool":2},"dvqrPRsT9iQHWnLfJ5UudQ":{"text":"This place can get pretty packed which clearly attests to their quality of food and servic","useful":1,"cool":0},"Kzew6z6Ze_o4oEfl1nTkog":{"text":"Service was so slow that food arrived cold and bread on sandwich was soggy.  I never saw t","useful":1,"cool":0},"RC0GBSZJLzNtgioBHFiFKQ":{"text":"Not real impressed today.  Service slow.  Had to ask for drink refills.  Food for group ca","useful":1,"cool":0},"gsG4TxHm3zm7uMamFxfH1A":{"text":"This is my favorite lunch restaurant.  The Voodoo shrimp was delicious.  Lynn our server m","useful":0,"cool":0},"YMFQBZHtz6xZo2-x167msg":{"text":"Visited there last night 12/19/18.\nGot seated quickly.\nOrdered Appetizer's and dinner at t","useful":2,"cool":0},"fTZulMLgdw51kGD1jZSlUw":{"text":"The food was really good! My only nit picky issue is how cold it was in the restaurant.  I","useful":0,"cool":0},"YgdI2BJukfanbHbesxKblQ":{"text":"The absolute WORST SERVICE EVER!! We come in ask for a table, we are then asked to place o","useful":1,"cool":0},"uh599iYYOE9yqJJ1PLJTiw":{"text":"The best thing here is the background music. I came at 5pm and the place is dead except fo","useful":2,"cool":0},"YYRF8Nhze4jnaD2DEb-RBA":{"text":"Food is average. I ordered the California wrap with sweet potato fries. The wrap was good ","useful":1,"cool":0},"vnNXKksI3XEKTHb60RUICg":{"text":"Tonight was very much a disappointment . This has become our late night stop after the Pel","useful":1,"cool":0},"hOPUmAIibCyOT8MoZcCsdg":{"text":"Stone cold waffle chips, 4 bits of cat fish fried, 4 hush puppies a single no refill offer","useful":0,"cool":0},"GFv8pMPD5M1Ypf73KVK8xg":{"text":"We had fabulous experience at Walk-on's. I ordered the Bayou Pasta with grilled shrimp ins","useful":0,"cool":0},"lYUNM7G5pOQXeYsjrbnunQ":{"text":"Today I walked into Walk-Ons and was greeted by a lovely host name Destiny and another you","useful":1,"cool":0},"fmImkkKHqLc-2E4ZCG3Ndg":{"text":"Was staying at the nearby Hyatt and went here several times.  They do a good business.   T","useful":0,"cool":0},"zF9bldcHvthgyV2fJcEuEw":{"text":"Restaurant is open until midnight.  On a Saturday night, they close a \"section\" (huge seat","useful":1,"cool":0},"2_lrLDTaxSxcfwNuA0zqNw":{"text":"All honesty YOU MUST HAVE the ALLIGATOR  BITES from here... oooo and tha Dijon mustard sau","useful":0,"cool":0},"2X1d0h7IpihNxmHWJpQTZQ":{"text":"It's our first night in New Orleans, and this was a recommended place by a local, and man ","useful":0,"cool":0},"4Tko2CVHmv7ZZJsmCGXmLA":{"text":"I just really liked their redfish! Was at a convention here. Boston bruins were playing in","useful":0,"cool":0},"tt6EYmMqT-HNcRfMxfsCVg":{"text":"Horrible. None of the beer taps worked. Service is a complete joke. Food is eh. Honestly i","useful":0,"cool":0},"7qJgo1RpuRi5g_TtUJq80g":{"text":"While I can't speak to the quality of the food or service, I can speak to their business p","useful":1,"cool":0},"goWBCvs7yn5DxlbXJ8ACaA":{"text":"While walking to our targeted dinner, the skies parted and the rain fell in buckets. We sc","useful":1,"cool":0},"LuquriEIsYx82KNLIJUebA":{"text":"Came here before the game. Really cool spot with good food. We had the Tini tuna and allig","useful":1,"cool":0},"adyo1DEi_kPoDMYjo7jgIw":{"text":"Though, it's a small franchise, I learned that no two Walk-Ons are the same! I think it se","useful":2,"cool":1},"BYkxf_utO3bud8jMX9Mbbg":{"text":"In the Heart of the CBD sits the bar/restaurant called Walk On's. The atmosphere was welco","useful":0,"cool":0},"09EwXXWDLiMbL6ba5OXZcA":{"text":"On a work trip, my team and I picked this spot for lunch because it was close to our hotel","useful":0,"cool":0},"bJVlR0xTceZ3o_xvPxPEMA":{"text":"No vegan options on menu but Chef Emily was able to whip me up an amazing avocado salad an","useful":0,"cool":0},"sBPt38NHt8CBfGFc5EbSww":{"text":"It was game day for the Saints, so of course expect a wait, but the hostesses we super nic","useful":0,"cool":0},"zY6gVB1GrEcVtLhStmyi6w":{"text":"Fun sports bar with great food.  Server was great even though food came out very staggered","useful":0,"cool":0},"xPDdHySHe23lBdnUr9BrXw":{"text":"Brought my family here today and the food was delicious, our server Maiya was sweet and pl","useful":0,"cool":0},"cz789Qwo3C7fN6GE5b9kMg":{"text":"Had good seafood platter.  Service was good.  Atmosphere is very nice and place was very c","useful":0,"cool":0},"v5K-iYahKOsubdR_x5YtXg":{"text":"This Place blows!  Waited forever for drinks and the waitress even forgot my order... in a","useful":0,"cool":0},"ODAGf0tvqPgAR9bhcMA81A":{"text":"Decent sports bar with everything you'd expect - Tom of tvs for March Madness, generic bee","useful":0,"cool":1},"Ti__BbWbDEdFzHkA5wz4aQ":{"text":"This place was better than i had expected. We were seated very quickly which was great bei","useful":0,"cool":0},"ycLpMWUzjC9KABeaxrtYDg":{"text":"Found this place while walking. Stoppes in foe a drink. The drink was amazing and deliciou","useful":0,"cool":0},"yl-VK7XKxU1ya_cELyuxLA":{"text":"I'm not a New Orleans local and like most of the people in this restaurant I was just look","useful":0,"cool":0},"taJSqY_Xexnct7c-g4Zu8A":{"text":"Great food & service.. A must visit when you come to New Orleans.. Ice cold beer with plen","useful":0,"cool":0},"c3F4KLmZWg5mDjUrTtxrkw":{"text":"Great service. String in the burger. Poor burger and fries were cold  Something in the bun","useful":0,"cool":0},"W9WP2FjwNKbLNxkiQrFUWA":{"text":"What draws me in to this place every time are the taps at the table - how cool is that?! \n","useful":3,"cool":0},"6iCDaxbQbqurLProLDgOWg":{"text":"This is agreat place for the sports enthusiast who refuses to leave home for fear of missi","useful":0,"cool":0},"Oidw0bjvkxTcRh1jD52ylA":{"text":"Staff is very good....good diet coke...patty melt , not so much, very messy.  Ordered medi","useful":0,"cool":0},"7W5WWuYJT9IqOuRcvNWkQw":{"text":"You must try the krispy kreme bread pudding, it is everything it sounds like and more. Lit","useful":0,"cool":0},"VcJXoLXoKZ_PC-tEYezHnw":{"text":"Went on a Friday night and had a good experience. Good food, good service and lots of TV's","useful":0,"cool":0},"vzP2oFTCS29xrGIyUSkFkg":{"text":"I'm writing this review based on the waitstaff at the hostess stand. We did not get past t","useful":1,"cool":0},"eqjHiXQH34UM56Gr_BUw5w":{"text":"The only reason it gets one star is I can't give zero. I can't tell you what the food was ","useful":1,"cool":0},"L7FnZudGdP1J5Kjy1WaVgA":{"text":"Love hanging out here for football weekends when I'm in Nola. Food is good, the idea of ta","useful":0,"cool":0},"T4KqkDfi3Eulccon6dEIng":{"text":"Walk-On's is a sports bar with ample sitting area, plenty of tv, and great place to catch ","useful":0,"cool":0},"mcMYQn8kPk8KQjcocPi-Ww":{"text":"Well let's start with the food is great.  However, Walk On's should be renamed Add On's.  ","useful":3,"cool":0},"6asEXHF1gFdiKUnvfzGXNw":{"text":"Walk-on? It should be Walk-away. Sorry, but it has no business offering to serve high qual","useful":1,"cool":0},"4N2z7D-XGaIuFi27JVoLbg":{"text":"Hands down, this is the place to go before a saints game at the dome.  My wife and i walke","useful":1,"cool":1},"U3QnBthwwxAoGFdgY-LtuA":{"text":"Really awful.  I cannot believe that the Ritz-Carlton recommended this place.  The service","useful":1,"cool":0},"jdyEilRRrPoAFh_QREQkSQ":{"text":"Great service with awesome food. Really liked watching the game. All the fans here made it","useful":0,"cool":0},"cRp8BqzF-7NKsYJNlBngLg":{"text":"Walk-On's is a fun and flashy sports bar and restaurant in the CBD. They have tvs playing ","useful":1,"cool":1},"9bgUrvrBZJVqUZTYr0UJfQ":{"text":"Stuffed burger was ok... Though they will only do medium to well... Tried to pay with a gi","useful":1,"cool":0},"VgtoA2vq5YkYzrTgat_t_w":{"text":"Just another generic chain-like restaurant. We were excited to find this sports bar within","useful":1,"cool":0},"vZ141yeP8Mwy30JDGY3kQw":{"text":"Coming from Indiana, we thought Walk-On's would be a \"novelty\" sports bar. It was SO MUCH ","useful":1,"cool":0},"k7lDXh3kOclXEd8b3OjaAA":{"text":"Food was slightly above par. Service was below par. It's a sports bar with a Cajun influen","useful":0,"cool":0},"1G7MyjRqTtJ6WqcQYMXKTg":{"text":"Given what we have come to expect with sports bars, Walk-On was a cut above the rest. We e","useful":0,"cool":0},"89Z4j5rMsCommc_1dpCTTA":{"text":"Stopped in to order dessert. The warm cookie with ice cream was amazing. The cookie was so","useful":0,"cool":0},"irZfPbyNvdjBe6fO0CkrJQ":{"text":"I had been looking forward to this visit for a while since I live in Michigan. I was so di","useful":1,"cool":0},"VlRdQVfFkIxJ6RKQSRqYvw":{"text":"Lynn at the Poydras Street location in Nola was an amazing server! She was extremely atten","useful":0,"cool":0},"ctGUqI7ppX1rhcxV_4yDyw":{"text":"Love this place! Tons of TVs and the food is surprisingly delicious. Service was outstandi","useful":0,"cool":0},"vS5W6yrbKgGRAUSg6ITbpA":{"text":"Super Bowl event was AWSOME.  Great service, incredible food and very well staged.  I will","useful":0,"cool":0},"GNUjEdX-cR9SSl5Gak0WJA":{"text":"First I'll start with the things I liked. The hostess that greeted me (3-11-13  7p.m.) was","useful":3,"cool":1},"QjsEF9ErMhgvaY23TgaNCQ":{"text":"I had the Turkey burger and it was really delicious. I enjoyed every bit of it!! The waffl","useful":0,"cool":0},"mpvUIclC4hL3G5QRfB-N-Q":{"text":"Update: After the experience, I was immediately reached out to by the management staff who","useful":0,"cool":0},"_aMUVrKeMu2RdXE2MHmdNw":{"text":"The service was good and so was the catfish on the Po-Boy, but I wish I had gotten somethi","useful":0,"cool":0},"u-H38JDaR1O-5ccsRBpcPA":{"text":"All the staff was great and the bartender was phenomenal- friendly and attentive. \nI don't","useful":0,"cool":0},"uY3KM2leiZTpjHVn-7-BGA":{"text":"We went to this place as others that attended our conference had gone there and said it wa","useful":0,"cool":0},"Ii9IM9IFRGhE2GsEOWN0eg":{"text":"I had no idea this place was basically Hooters...I swear.  Same basic concept so in my opi","useful":1,"cool":0},"BbNPL9w11NnF1M2R2L3PQg":{"text":"I checked out this on Sunday and boy was it packed with all the football fans. Was hard to","useful":0,"cool":0},"NlvFkGKR9p64rtUxLXikoQ":{"text":"Bayou pasta - fried shrimps, pasta, cream sauce\n\nPretty decent for bar/restaurant food. Pa","useful":0,"cool":0},"C0SIlZM1xBdVx14KhAcF-w":{"text":"The prices wasn't updated on google. I placed a phone order and got to the restaurant and ","useful":2,"cool":0},"OeH6WZM4r6ZIVMxUoakB7Q":{"text":"I had the worst experience with the hostess named Ian. Very rude and condensing. Would rec","useful":0,"cool":0},"x_tbC_ZrNSXfpsTpjt4ndg":{"text":"Wasn't expecting much based on the ratings, but it was a pleasant surprise! It was a great","useful":0,"cool":0},"pXW02kQtthdWzy-BIUGSjQ":{"text":"Good food and drink.  Fair prices.  Pretty loud but to be expected with football game on. ","useful":0,"cool":0},"p-IcmfLo5PxzA0bs2esgBA":{"text":"My favorite spot to drink my apple cider! Bartender Callie thank you Great service. I was ","useful":0,"cool":0},"ePSmPIQWpNRFgI9aaVEU9w":{"text":"Food was great! Great service! Truthfully can't complain at all about any part of the plac","useful":0,"cool":0},"cd0vRZSZlNSH3TfY80PbsA":{"text":"Went to eat with the family. Everything we ordered was delicious! We all shared everything","useful":0,"cool":0},"nKQFvNU9cgwSC8oIgU7tqw":{"text":"This was the first place we went after we checked into our hotel. The staff are friendly, ","useful":0,"cool":0},"YHQhzndiD3f1yajj9NLrxA":{"text":"This is probably my favorite lunch spot to go in the CBD.  The service is always on point,","useful":0,"cool":0},"Aawl-08MkRKKWk6urKCceg":{"text":"Food was eh but might of been what I ordered. Seemed like a cool spot and its in a good lo","useful":0,"cool":0},"qMtTfD2vNLMNmYr71GruUw":{"text":"They have fruit flies, Managment is like ok what do you want me to do about it.  Bad part ","useful":0,"cool":0},"uIFEG-VpbwjnCeu48yLaMw":{"text":"I read the reviews and was skeptical about coming in here, but the thought of a blackened ","useful":0,"cool":0},"Q_7ZkHw36s7f7rJu55bBSA":{"text":"Food was good and unique options but not anything special.  Waitress was new and forgot ou","useful":0,"cool":0},"wNxFO3JNSkgWHi7y61y70Q":{"text":"Great game venue.  I like the beer tap at the bar tables.  It's a huge man cave!","useful":1,"cool":1},"5zg0VAGTom9wlhlQ5H4pyw":{"text":"Went out of convenience because it was close to our hotel and we had nowhere to go with ou","useful":1,"cool":0},"a9ZpRqmMhbBSiW_JBa02SQ":{"text":"Everytime I come to NOLA I stop here and they have never disappointed me. I always get the","useful":1,"cool":1},"jOOU1eWsqp34DgwrEw_ztw":{"text":"Was searching for a food spot walking distance of our hotel after just coming from the air","useful":1,"cool":1},"B_-pqiD-03BvlkcGNPtkfg":{"text":"Okay, let's talk about service and \"Southern hospitality\", something so rare in NJ , I alm","useful":0,"cool":0},"wxlpRFNE6eyuEztStfNbYw":{"text":"The food's pretty decent, and the staff is attractive as hell.\n\nThey've committed one of t","useful":2,"cool":0},"AJykyBLt8Tl6u0CN85CMmw":{"text":"Walk-On's opening is perfectly timed with football season starting up again. They official","useful":7,"cool":3},"pA1Kp2SRIMmBfJpAHFOZsg":{"text":"We came here after a Saints game (not immediately following the game but an hour or two af","useful":1,"cool":0},"ZDDG8M39ERPYXV3BNUpaAw":{"text":"Service was great! Food is not what we wanted when we stopped in. chain style restaurant.","useful":1,"cool":0},"BwFAe156YEZPfyvmRRku8A":{"text":"Decent sports bar and restaurant. My boyfriend and I stopped by for some dinner after we w","useful":0,"cool":0},"Bt1mX6JVemhJdP5o7nsCSg":{"text":"An embarrassment to New Orleans culinary stature.  Ordered hot prime rib poboy, soup and s","useful":1,"cool":0},"wnEfUNCDjtTYuDg2jExdFg":{"text":"Went in sat down and was greeted by Angela to be our waitress. Had a few beers and alligat","useful":0,"cool":0},"nghJGPocbwTbdwGD41eeVA":{"text":"Walk ons is your typical chin restuarant but with southern flair. Food options are pretty ","useful":5,"cool":2},"-Fi3iFRn04znAOA8vVLpuw":{"text":"My daughter picked this place and it was really good. The service was excellent and the fo","useful":1,"cool":0},"WiVKgw8xsq1C7gmds6gyow":{"text":"We was here for a football tournament and we wanted to try a bar and watch football... go ","useful":0,"cool":0},"k3f5K9hkSwzx9QZoJbtshw":{"text":"Madelyn was great; very friendly and attentive. The shrimp po-boy and corn grits are to di","useful":0,"cool":0},"AobXLKffxc_FYaNRg-FYDQ":{"text":"Welcome back Walk Ons! Space is revamped and looks great. TV's everywhere and a nice back ","useful":0,"cool":0},"v1EpRwdZLWFyScdm-52nDA":{"text":"Two Floridians (a Detroiter and a Scrantonite) walk into a bar...\nWalk-On's Bistreaux & Ba","useful":0,"cool":0},"bsdwTJh-uGYFeDGrZxj2IQ":{"text":"This is one of the worst experiences of my life, in a restaurant. I have been in the foods","useful":1,"cool":0},"6C-ijFoIoYxQmqHOXAxHpg":{"text":"Alesia gave great customer service and made sure our food was perfect on arrival..A+++++","useful":0,"cool":0},"83whGp1g-G3vDM1jEdpWmQ":{"text":"VERY EFFICIENT SET UP: seating radiates from the horseshoe bar and kitchen;\nBE REALISTIC: ","useful":3,"cool":0},"6n6yoj1eEhvjw0JQ8OPwgg":{"text":"Nice restaurant. Low key sports bar. Very attentive. Marissa was a great server. Very quic","useful":0,"cool":0},"_yRbVtS7pnUAsH8Zivgx2g":{"text":"A place is only as good as its staff.  Walk-On's in Baton Rouge provides consistently good","useful":1,"cool":0},"OmSfEHM-oArrdFkPLE33vQ":{"text":"Good food and reasonably priced. Haileigh was great. She had a great attitude. The food ar","useful":0,"cool":0},"zcOo_M-6wsqZfCDDSpYsPg":{"text":"Absolutely terrible. I went here with a friend on Bayou Classic weekend to watch the Notre","useful":5,"cool":2},"GBhNIdXQFI0xCWwItVC4PQ":{"text":"I found the food just mediocre. This was possibly a kitchen issue.\n\nIt was disappointing t","useful":1,"cool":0},"FkukYtmu3qSQDiL-mLGtGg":{"text":"The food was pretty good out server was friendly but it took her a while before coming to ","useful":2,"cool":2},"OrmV99kz4eIh9DO0Rooibg":{"text":"Large sports restaurant in downtown NOLA.  TVs all over the walls with sports programming.","useful":0,"cool":0},"YNzwWl9l3ICnxyC0frurfA":{"text":"While staying at the Hyatt for a one day trip, decided to walk over and give this place a ","useful":2,"cool":0},"kkb_WhEvpS_dWXk5sr5Y1w":{"text":"I have been to this restaurant several time, each time I go, I have problems. I typically ","useful":0,"cool":0},"qVutjLQo-V-67KUuW6OUPQ":{"text":"Walked into the door to grab bite to eat a few hours before the Pelicans game and was imme","useful":1,"cool":0},"JY-G35ZWE_HspRiDRPWVRg":{"text":"We enjoyed the 20 TV screens to watch the game. The food was great and our server was on t","useful":0,"cool":0},"HdwqCwSWgZ44CDAVbuvuRw":{"text":"One of the only places around with the package. Staff is ridiculously rude. \n\nI walked in.","useful":0,"cool":0},"ddOR2NyWllf2YJe_ZqQ7HA":{"text":"Had it delivered and I was underwhelmed. Bland tasting and rubbery.  Won't waste my time g","useful":1,"cool":0},"AuZhuJY4PTZAZti6dp_YuA":{"text":"This place was really good. The service was great. Our waitress communicated with us well ","useful":0,"cool":0},"3fDTGDp3XtNTKuYzcIiWKA":{"text":"Fun atmosphere! Solid beer selection.  Ronnie was great super fun and kept the party going","useful":0,"cool":0},"k5d0pdt4rRHM2IBqGbRvTQ":{"text":"All I can say is wow. I have never had this kind of experience anywhere else. My friends a","useful":0,"cool":0},"NayLE_ZbJSbwsr3uN-kO-g":{"text":"Best place to watch your team play when visiting New Orleans!  Cold beer, great drink sele","useful":0,"cool":0},"tpj7ForB-GXSajeFX4ClZQ":{"text":"Man. I never really hate giving two stars. But here it is. \n\nCalled in lunch to go on a Sa","useful":6,"cool":0},"RSSQQGxqW6JOfoloXMKM3g":{"text":"A casual place to grab some decent food. Nice menu variety. My go to is the zydeco salad. ","useful":1,"cool":1},"nZhL3C8VEnnHzX8UrZnLOQ":{"text":"Don't waste your time. There are much better spots in New Orleans to get good food. The fo","useful":1,"cool":0},"f4BsvvU3x5dZAcuzm0Zw6g":{"text":"If you come to Walk-On's you NEED to be seated in Claire's section! She's the most persona","useful":0,"cool":0},"-RWNN6CHYvSxTMPHkaxotQ":{"text":"Meh. Bland bar food. Rude staff. Long wait times for whatever reason. Empty tables abound.","useful":0,"cool":0},"4dleRUjNxkfcjfc_aVE1TA":{"text":"The food was great. We had the stuffed burger and the fish tacos. The service by Felicity ","useful":0,"cool":0},"__C2GAazxAOu0X3oOH_XEQ":{"text":"This spot was recommended by my barber and it did not live up to its legend. I had a burge","useful":1,"cool":0},"-MZ3C2TNW2dQ26iSHGG5qQ":{"text":"Had a terrible experience. A drunk guy waste a pitcher of beer on us and the same guy fall","useful":1,"cool":0},"4N2WUsrJcXFHL6eYXpCXfQ":{"text":"First timer here in New Orleans. Was told Walk-On's was a good spot to grab a quick bite t","useful":0,"cool":0},"g9AGP1g4PruDocHooT6_ag":{"text":"This is the perfect place for watching a football game. It is walking distance from the Su","useful":1,"cool":0},"ZbWgp1W9jjnAyc2n9fAPkg":{"text":"Came to eat and Walk-Ons mainly because it was 3 minutes from my hotel and such a great re","useful":0,"cool":0},"b_8JO11FUbTWeETQylFyvg":{"text":"My husband and I were so delighted with this restaurant! Our waitress was knowledgeable ab","useful":0,"cool":1},"VuO83Tv4_0z2kwF0pLAxpg":{"text":"Seems like others have had great experiences at Walk-on, we did not.  Our experience was a","useful":0,"cool":0},"sXfAGireXWpwpwDdm7y3mA":{"text":"Great food great atmosphere and GREAT DRINKS  Ronnie and Brady took incredible care of us.","useful":0,"cool":0},"DeLMgUj9SEoEY7Zve1cnYg":{"text":"Went in here several hours before the LSU game and it was very very crowded with over an h","useful":3,"cool":3},"NmN7EYg4TCi6NW6353THKA":{"text":"Definitely enjoyed the food and great service provided by Lyly! Went with all of her recom","useful":0,"cool":0},"5OHFcE_P6OF-9Zezy78yVg":{"text":"Second Visit to this great Chain N'awlings  styled restaurant ... Haley my  server was the","useful":0,"cool":0},"u9tqgNRDfHc817QDHjk0jw":{"text":"When I was visiting New Orleans I went here and it was crowded during lunch time. We were ","useful":0,"cool":0},"ee7WJUlcrYoGNNouc9TI2A":{"text":"Maybe I don't get all the rage because I'm not from Louisiana.  I've now been to three dif","useful":3,"cool":0},"I_mazUsScuQeI60v_zpSOw":{"text":"I have been here many more times (12 to be exact), since my first review, so I figured an ","useful":4,"cool":0},"DtImDcPRwWmKajxq1Lywaw":{"text":"Went to watch football with a bunch of guys for my bachelor party. Asked for a table of 15","useful":0,"cool":0},"yHPxo5dfOGbelj_FPOrVfQ":{"text":"We came here to eat and drink so my bf could watch multiple games at once. Our Uber driver","useful":0,"cool":1},"OHGcb3kFgTn_GLrsM8jn2Q":{"text":"Was back in New Orleans on Tuesday this week, so decided to visit for the Tuna Tini. Well,","useful":1,"cool":0},"tTUwaj1WbJGPJY_qHDMe4g":{"text":"I come to this place to watch the football and basketball games. Service is usually good, ","useful":0,"cool":0},"HH3VCF--OepQpYRKsPjU7w":{"text":"Went in on Sunday night to watch the Football game, they were playing random music that I ","useful":4,"cool":0},"-msbuj2W58Z6iFONx9G_DA":{"text":"Everything & extra fun on game day! We had Amylea wait on us & she was awesome!! Great foo","useful":0,"cool":0},"YivMNDnkl_wY1asauBkSSw":{"text":"Service was painfully slow.  They should also work on learning the difference between batt","useful":1,"cool":0},"2iblTYkfl6A4fzWXfyl4ow":{"text":"It was a chilly winter day when my wife and I wandered in.  My baby daughter was in tow so","useful":3,"cool":2},"ON5RZS3AWmrI0tYGng9Kaw":{"text":"I happened to be in New Orleans the weekend that the city essentially went into quarantine","useful":0,"cool":0},"J0ZVLOe-suRwBTs3HFVjNw":{"text":"Place was very lively and quick with order. Alesia was a great waitress and the best. Coul","useful":0,"cool":0},"350vS3bN_xeVoNSsBE0Vhw":{"text":"My daughter, granddaughter and I set out to find a different place to eat today and litera","useful":0,"cool":0},"I-IB6L5u890-cawtmNlTuA":{"text":"Food and atmosphere is great and we had Ronnie as a waitress and she was awesome! Really c","useful":0,"cool":0},"GoxXJ3Fk_8n5UObvu_PXcA":{"text":"Great place to catch a game. Respectable menu with something for everyone. Highly recommen","useful":0,"cool":0},"yQ2tcU-oiJnFdKsr7SFCvw":{"text":"Great food. The cajundillas are excellent. TV set up a little odd for watching several gam","useful":0,"cool":0},"6itArglJOKLY81ecgQ1YCg":{"text":"What started out as not every good turned out awesome. After waiting 30 minutes for a tabl","useful":1,"cool":1},"uKX35DsS0aUXUQv8_TTyHg":{"text":"After a good night of hanging out in a couple of drinks I figured why not stop in for a ha","useful":0,"cool":0},"LYZNoz5KVpKlJrXjhr-iCw":{"text":"I am giving this place two stars because I like the location in Baton Rouge.  I have been ","useful":2,"cool":1},"-gPTv7pMR7sHP8GguSqlHw":{"text":"Claire was the best waitress ever!!! She was very thoughtful and attentive the entire time","useful":0,"cool":0},"BHaf3oACepihdAC7rJQ9Ig":{"text":"This is a skimpy sports bar, plain and simple. We sat on hard wooden benches on a raised a","useful":1,"cool":0},"Pg-wBLlirKvclRwEo8s8yA":{"text":"Death Valley is the best drink! The crawfish two ways is really tasty. My date didn't enjo","useful":0,"cool":0},"03do4YKlsumSxWcJv3vIZA":{"text":"No, no, no. \n\nWe've been here before and have had pretty standard experiences but today wa","useful":2,"cool":3},"KicvheoqWqGVI1uDnrJZKQ":{"text":"It was okay. Pretty spicy but it's New Orleans. The shrimp and grits were pretty good.","useful":0,"cool":0},"SAF-8uGsdsWF3e7rZKb_lA":{"text":"The prices wasn't updated on google. I placed a phone order and got to the restaurant and ","useful":1,"cool":0},"1_5A77pP1fPNw5eGTpQRlw":{"text":"They have a good happy hour on drinks! It was two margaritas for $6 and they were strong! ","useful":1,"cool":0},"Ir3k39V54DJY7NdtAqOI0A":{"text":"Nice clean place you literally can see a tv from every angle.  The staff is attentive fun ","useful":0,"cool":0},"ZJufJ8H5rdjw8aLwz-COQA":{"text":"We walked there from hotel over one mile and the damn place was closed.  \nVery disappointe","useful":2,"cool":0},"z7Vwj2JYj5n_KtKpboqIAw":{"text":"Just what we needed after a Fat Tuesday parade. The wait wasn't long but we sat at the bar","useful":2,"cool":1},"Oi0zgbHmgGKR9ckn4pxDBQ":{"text":"My friends and I came here after arriving in New Orleans after traveling from our various ","useful":7,"cool":6},"Ej_S0TYGWOGi9LPdDz7DKA":{"text":"I came to Walk-On Bistreaux Bar when I was flying solo in New Orleans for a business trip.","useful":2,"cool":2},"sO-u8Dk7TS7-rSlciNUWzg":{"text":"We walked in to Walk-Ons after the Mavs @ Pels game tonight. We were greeted quickly at a ","useful":0,"cool":0},"PGMaWwCBLv0m0xPuUcSVXw":{"text":"I come here often for work but I have to say that there is much to be desired with their f","useful":8,"cool":4},"7WQU3xxyLb-welaAj8LcSQ":{"text":"I loved eating here and getting the spinach and artichoke dip which is GREAT BUT they chan","useful":0,"cool":0},"GqfqCxH0B7CF_NFTmIEyBQ":{"text":"Great food, great atmosphere, and great service! This was a really good spot to watch the ","useful":0,"cool":0},"bvnUGPaJIucPbmi3dLVI-g":{"text":"Had a great Sunday funday at walk on's! Ronnie was so fun and made our group feel at home ","useful":0,"cool":0},"CZS2r7pR9_kWBP4D57-pmg":{"text":"Came to Nola for a work conference with a coworker and decided to stop in during lunch. In","useful":1,"cool":1},"nx5sC1sx88D4TpP0O0YOkA":{"text":"Ok, I would feel funny giving a sports bar 5 stars. For what it is I like this place and e","useful":3,"cool":2},"xzGuZDA-y7AUF73TroWuSQ":{"text":"Marissa was awesome! So sweet and helpful! Will definitely be back because of her! So yumm","useful":0,"cool":0},"WXlrf08RzZ9SI43-aj_wYQ":{"text":"Since I don't live in New Orleans (yet) but do visit often, especially during football sea","useful":3,"cool":1},"914IcyI-uiKS9xY6-WwN9A":{"text":"Catherine E welcomed me with warm arms and an amazing smile and I knew this would be the s","useful":0,"cool":0},"e0y5gp8WQLm4IyAEWLdG7w":{"text":"Coming in with a group of 13 at noon we expected to have a bit of a wait time. Luckily we ","useful":1,"cool":1},"Ap-iD2m5ShqDmCwi8T_wBg":{"text":"Honestly, I like the burger here. More than the other burger places in town. The hangover ","useful":1,"cool":0},"4sYhGQN83XseyCrpqtQqMg":{"text":"Great drinks and food. Ask for Ronnie - she is the best server. Friendly and fun!!!\n\nLoved","useful":0,"cool":0},"gci8B5ucqYY9h0VMjzeutQ":{"text":"As a long time Walk-Ons costumer. I visited the Poydras St. location for the first time on","useful":0,"cool":0},"NAeGpZwhCQfZaUG-3_Gi1A":{"text":"Ronnie was an awesome server! Handled our service well and had great personality for a hec","useful":2,"cool":1},"UHLCcFnTKncqGx0FhnrVKw":{"text":"Great food great. Boom boom shrimp yum. Would recommend highly. The atmosphere was frat be","useful":0,"cool":0},"GbgY0jeMFSqVWMJiiXH3rg":{"text":"This location is like a block or so walk from Le Pavillon...damn sure came in handy on Sun","useful":3,"cool":2},"tWpR0FZOw3tiLA2kmcnDAA":{"text":"Honestly, I like the burger here. More than the other burger places in town. The hangover ","useful":1,"cool":0},"d_9RqPyIB1shDxziKm7n9g":{"text":"Ok I was a little hesitant to try this place because you're in New Orleans and feel like y","useful":2,"cool":0},"c-Rlmm9bZZj72_gQBm6j-A":{"text":"I just really love Walk-On's. I've been to multiple locations and they simply don't disapp","useful":3,"cool":1},"T-Rvb_GrXGtEbZowkKuODA":{"text":"We walked from our hotel to grab a bite before going out, and were very impressed with the","useful":0,"cool":0},"gJk1-AWVvy2KClTp9FIU6A":{"text":"Yet again this establishment exceeded my expectations! Great service, food, and beverages.","useful":2,"cool":2},"FAfA094S0nq8f5bnBHHVuQ":{"text":"Not a huge reviewer of chain restaurants but after waiting for this to re-open downtown po","useful":1,"cool":1},"IHEq-9Kou-7VbaUyZSz2VQ":{"text":"My family and I frequent Walk-on's. But today, after explaining to the waitress Paige, thr","useful":0,"cool":0},"4qPy7YTB8RQNFn3FPQ_VLA":{"text":"1. 5 rounded up.\n\nIf didn't know before, I'm certain now:\nAVOID chain themed restaurants:\n","useful":2,"cool":1},"qhuQKI0lhIYziQrNHvPCTQ":{"text":"Went there for a holiday luncheon with 30 coworkers!  Service (Victoria) was amazing! Food","useful":0,"cool":0},"QUMMV_u3JczXlmOLUv8Dxg":{"text":"The concierge at our hotel sent us...because it was a conveniently close walk from our hot","useful":0,"cool":0},"81FmClXL30EV84CpbFxvpw":{"text":"Background:  Went here after a long day of work and a major thirst for a tall cold beer. a","useful":0,"cool":0},"4LRlmaSLRBNjEN4KYjUkow":{"text":"walk ons is cool, my waitress ronnie was super nice, would request her again. will be back","useful":0,"cool":0},"IWsQwHu5KfYpbbNZJ7hILA":{"text":"These folks were super slammed after the Saints game. And being in the shadow of the Super","useful":0,"cool":0},"az254NOnRL47qbV4XCJ6tQ":{"text":"My bartender Cat E was amazing at making signature drinks but also killed it when i asked ","useful":1,"cool":0},"sA5LIZDH8FtJNgbOsNtNXA":{"text":"Great atmosphere to watch a game! They have a nice tap system at some of the tables, where","useful":0,"cool":1},"54K4omqU9sxkp0no-5lFWg":{"text":"Sat at the bar. Service was good but not great. But food was surprisingly good for a sport","useful":0,"cool":0},"8tl2TFwpxvrGfqNRrrjBsg":{"text":"I've been a fan of Walk-On's for a minute! Their seafood dishes are some of my favorite. F","useful":1,"cool":1}}