{"JUfcrkcOCBPO0ga9i7_3xw":{"text":"Stayed at this hotel during a busy weekend. Although the hotel was nearly full, the staff ","useful":2,"cool":0},"HT4_uc4BPWzdHj9ggy-mow":{"text":"We arrived and checked into our room the first night and immediately noticed our AC unit w","useful":0,"cool":0},"HBhkanv2WGm_0SFYolVg7A":{"text":"I came here as a stop during a road trip. I was pleasantly surprised by my stay, we were a","useful":0,"cool":0},"z8iftcKcWKltjwZgyMP75g":{"text":"The shower knob would work .  It is 12 am and I can't even use the shower.  At least hotel","useful":1,"cool":0},"dmPbcyQgP_RLxzLonOKDLw":{"text":"We were there for the weekend but had a great time. Complimentary (delicious) cookies and ","useful":0,"cool":0},"n3Nv1yAlsHDHAHOGbxjz6g":{"text":"The staff seemed incredibly lazy. When we asked for a room with two beds (family of four),","useful":5,"cool":2},"PMlrn6ALbCVlbdmqO9z3sA":{"text":"Great looking modern asthetic rooms. Cozy bed and good quality comfortable furnitures . Li","useful":3,"cool":4},"WIAuedYyiP-LIdSfWU2n5g":{"text":"Out of all the hotels I've been to I have to say that this one is the best. My wife and I ","useful":0,"cool":0},"VO6XHrEoFJZWDYGir7N83Q":{"text":"Came for the weekend, booked this place last minute. Hotel staff great and all safety meas","useful":0,"cool":0},"u7oZMuhnkAIGNkMPLdfyOw":{"text":"Pros \n-breakfast  \n-nice soaps \n-large tv good Chanel's\n-free parking \n-security guard \n-a","useful":1,"cool":1},"j0iubuNXg6qV6WLlW33WHg":{"text":"This hotel is by far the worst hotel I've ever been to. It's not clean. It said inline the","useful":0,"cool":0},"A76PRtq4NtY7NwL1XhpiQw":{"text":"To say disappointment is an understatement. We had an employee give us wrong information, ","useful":0,"cool":0},"hT1432YavdeJk_FYMgNafA":{"text":"Stayed here 1 night and it was great. Not too far from the Krewe Du Vieux parade route (le","useful":6,"cool":4},"2a3h8TjRGfmv2ytOnzDWCQ":{"text":"Horrible Service tonight. \nDO NOT BOOK ONLINE here. \n\nFirst off I stood at the front door ","useful":0,"cool":0},"5RsSYzlzdQWxs4jYYGTIRg":{"text":"February Break. During Mardi Gras. In NOLA.\n\nIt is understandable that prices would be thr","useful":3,"cool":1}}