{"P7Kgfaybduxg66fyGfCU3g":{"text":"There was nothing at all wrong with the experience: The lunch time line was moved along qu","useful":1,"cool":0},"q05LxYgAUUiLLHNNtu3Zmw":{"text":"Very rude manager, and almost every time I have ate here they have made my sandwich wrong.","useful":3,"cool":0},"D8kH-LgxD4779uszqGvJTA":{"text":"Everything about it is good. Except its a chain in NOLA. I hope i dont come here much, i s","useful":2,"cool":2},"tXVUWBMyh-F0ACob86nzow":{"text":"I really like Panera, and this is the one closest to our house. The staff is friendly and ","useful":0,"cool":0},"vBgJnb2yVTXvrVN-AgGStA":{"text":"Came here Thursday afternoon on my lunch break. Holy wow was it packed for a Thursday at a","useful":1,"cool":1},"8B9U73AZzkJCUZsbGewlgw":{"text":"My daughter and I were on our way home from a long day of volunteering and decided to stop","useful":2,"cool":1},"MuN3BcrYuVy5rkvEj8Jfiw":{"text":"This was my first time here and the menu takes a minute to navigate, but worth it. The foo","useful":2,"cool":0},"vbTz_5CEMmpPszUz1ICjHA":{"text":"Soup in a bread bowl. I could eat it every day for the rest of my life (and very well may)","useful":1,"cool":0},"7EH2wKwaC1Fxq6U2yK9N5g":{"text":"I think their food deserves a three star rating BUT I gave them 4 stars for what another p","useful":0,"cool":1},"1v3SQCT94RrNwSrNNM7ACA":{"text":"Don't expect your order to be right ever. Steak sandwich with one piece of steak? Never ag","useful":0,"cool":0},"oLLNXNU4hepxIQ5-9HktVA":{"text":"Tbh, Panera Bread has never done me wrong besides the time when they ran out of sweet tea ","useful":0,"cool":2},"I1M-O6gZPKqCR_0CX7UsUg":{"text":"Same great food panera always has but the service here is the best. Ginny at the cash regi","useful":0,"cool":0},"uERQ9VGTgWYLtwnKLdrHeA":{"text":"Have gotten a bagel here often lately but tried dinner tonight. The French onion soup bare","useful":0,"cool":0},"cfhtEtqVRRkyrkdkfrm85w":{"text":"Check your order before you leave. REPEAT check your bag before you leave. Every time I ge","useful":0,"cool":0},"X4JZejA_20vxvmfpcDNl-w":{"text":"Gotta love the 1/2 soup/salad/sandwich deals.  Never steered me wrong.","useful":0,"cool":0},"NxN7_8ZzQzLNksT_J-4yqg":{"text":"The different choices of fresh foods was amazing, I really enjoy my Salad it was fresh and","useful":0,"cool":0},"DUesXVkXBVWQnAEpsnKP6A":{"text":"I enjoy a nice blueberry scone and a pippin hot cup of coffee. Panera hits the spot and th","useful":0,"cool":0},"oW-FLswO_-7I5z1W4frWrw":{"text":"I like panera a lot, this location not so much. It is a freaking Dump. The carpet smells o","useful":1,"cool":0},"R91TRvkm04XIJJzChhPBOg":{"text":"I'm giving this location a 3 star review because although I like food from Panera, this lo","useful":2,"cool":0},"IsU3algQMysCosxkpV2HVg":{"text":"I really love the fresh choices, but this place is always so crowded that the wait is real","useful":0,"cool":0},"QtX5nHLIVbS14ZOLbIEGrw":{"text":"This place sucks. Literally the reason I signed up for yelp was to say that. Pretty sure t","useful":0,"cool":0},"pGqcd7sMbWpDxcS78-0l5A":{"text":"Great spot for soup and sandwich the employees are informed and friendly,usually very crow","useful":0,"cool":0},"ZXrEzZfbhryHnj9gRpeguw":{"text":"This Panera is friendly and there is a nice staff. Only downside is that the bathroom is l","useful":0,"cool":0},"W8z-dtn9Bb10XePOEoqkPQ":{"text":"Man, I thought this place was gonna WOW me with awesome food! \n\nTook me a while to find pa","useful":1,"cool":1},"984Zuc3YZ0vhdE1vdzdFCQ":{"text":"Panera Bread has always been a favorite of my mom and mine. I honestly don't eat much else","useful":1,"cool":1},"ySIffceHAt0Vp-VMTZSRSw":{"text":"Don't fucking trust these fucking liars. Don't ask them for a tuna melt, don't ask them to","useful":2,"cool":1},"kWXn8nJT_5d0y9BciaxCQg":{"text":"Waiting until the workers finish their conversations is getting a bit old. Especially when","useful":0,"cool":0},"9LO-huXp_RQP6-sMdoz4qA":{"text":"I've been a fan of Panera Bread ever since my days of living in Los Angeles.  And when I m","useful":3,"cool":1},"4p5F05nw1cpcxK7aMqf4eA":{"text":"I am panera's biggest fan. Comfy place to work or study, big tables, reliable WiFi and goo","useful":1,"cool":1},"SVHUcAnBcE4F9SmI39hOLA":{"text":"Making a salad shouldn't take this long. I'm all about people enjoying their work, but ple","useful":0,"cool":0},"xtx1nuLayxMdT2lnq5z0jg":{"text":"What's going on at this location?  I placed an online order today at 10:58 AM and it was n","useful":2,"cool":1},"0Y8R-tMITEyFVMsIKAamVA":{"text":"Other than my interaction at the Register with Kristen, there was nothing redeeming about ","useful":1,"cool":0},"UDp0HeywT1YdyCev00jcfw":{"text":"I usually wouldn't take the time to review a Panera bread, but it's close to my apt and I ","useful":0,"cool":0},"LfrPYOVWdrHJLKErNgG-vw":{"text":"Being from and living in New Orleans, I feel like this place is too franchise-y for me. Al","useful":2,"cool":1},"e00HZS7QQEoHlPvHwW36IA":{"text":"Clean place. Cashiers had a little bit of an attitude like as if they didn't want to be th","useful":1,"cool":0},"ntKqp9u3CD-PiIo2TMoquA":{"text":"Parking is still terrible here. I parked a block away and ordered food at 12:35pm and fina","useful":2,"cool":0},"LgiPG7e26jzmBFyK1dSI_Q":{"text":"I had the extreme displeasure of eating at Panera Bread recently.  While the service was f","useful":3,"cool":0},"vSRoF6EE8mKgofKAMK2_2A":{"text":"Nice little spot for me to catch breakfast. It's not crowded at 7 am at all. It's a new bu","useful":1,"cool":1},"KWTt5DoDI-6WQdvU4MZ87Q":{"text":"Today I went here with my mom and they said since I wanted a water with my meal (no caffei","useful":1,"cool":0},"hW84wDQlNsurymfX-5Pxag":{"text":"A lil snack omg it's amazing. It sucks when u walk into an establishment and everyone(staf","useful":0,"cool":0},"m3aBdkmMZz9uZKLDe0dihg":{"text":"Just don't order the Thai salad. Or Steak and White Cheddar, can't speak for anything else","useful":0,"cool":0},"kHfANrsiugdHakl6oZsYTg":{"text":"Check your order before you leave. REPEAT check your bag before you leave. Every time I ge","useful":2,"cool":0},"H9ksSWGkVJ_hVbXASYt5Pg":{"text":"I love panera, but this is by far the worst one I've ever been to. The staff is extremely ","useful":0,"cool":0},"aqzFwTrlrASsbmuSp_ifGw":{"text":"While Panera may have \"bread\" in their name, I have never tried any of the baked goods. Wh","useful":9,"cool":6},"rIpXx5xB5YkCi2AqyXofsw":{"text":"This is an embarrassment to the Panera Bread franchise.    The first time I went there it ","useful":2,"cool":0},"PHufd7SBPptW9W2nZEyVIA":{"text":"This place is to go for organic food. The price is reasonable and foods are delicious. Hig","useful":0,"cool":0},"12njafRbZoYtVaqsIlfBgw":{"text":"First visit pretty good food wise.   Before next visit set up account online for rewards c","useful":0,"cool":0},"RCmrgqTjvgGEggvhI1Jvqw":{"text":"Great spot for soup and sandwich the employees are informed and friendly,usually very crow","useful":0,"cool":0},"7UxbAqw_8-Hr69lIqM8HkQ":{"text":"I've always had exceptionally slow service here. One time I waited 30 minutes for a \"grab ","useful":0,"cool":0},"TIgY9PD5qtLK0-vlu_p10w":{"text":"They are swamped during weekday lunches.  So even though I waited 17 minutes for my take o","useful":2,"cool":1},"9zf5ttPewjkhLB5QPbPjTA":{"text":"Had a great breakfast experience today here.\nThe service was courteous and the food qualit","useful":0,"cool":0},"vg-jO5uI-SbnIfEo3Q7ZKw":{"text":"Classic Panera Bread location. Every time I've been in here all of the staff were extremel","useful":1,"cool":0},"RL-7VtH25r5sitJSyNSN9Q":{"text":"So apparently the fullness of your smoothie cup depends on the \"amount of ingredients\". Em","useful":0,"cool":0},"A8rxvjNOgiDMsrMZu1QXzA":{"text":"Very dissapointed , I ordered my over priced and super salty \"pick 2\" combo a soggy salad ","useful":1,"cool":0},"fEk_ezu_fO-qfIJ47xuWmA":{"text":"Parking lot that is usually pretty full.  The place is clean and pretty big.  They have a ","useful":0,"cool":0},"xQUB69Hpa0ax6yH7r2vmDg":{"text":"What I love the most about this place is the ability to order ahead! Known for its salads,","useful":0,"cool":0},"Qwg2MG1nbNykVFn_T9UQTQ":{"text":"My first time visiting was for a quick lunch and I seem to have a lot of work to do to bet","useful":2,"cool":1},"dtDS1yL1X4fJ9fR3XB1d9A":{"text":"Got the corn chowder and Caesar salad.  Both were oh so yummy.  Love Panera","useful":1,"cool":1},"pCppQRUJ8t9OfTavVAfYKw":{"text":"Had Panera bread with a friend a week back, I must say it was really good. My first time t","useful":1,"cool":0},"0r-D_tJwR5GKyszzTiUBug":{"text":"This is an OK Panera. I hate to sound so blase', but that's exactly how I feel.\n\nThe staff","useful":2,"cool":1},"TFDZCPOuY3m6ceQgmANsQw":{"text":"I love Panera as a general rule. I have regular cravings for their french onion soup in a ","useful":6,"cool":2},"87G2tTk71OlVbcrxbFrtWQ":{"text":"I love a classic grilled cheese and broccoli cheddar you pick two! Couldn't eat much becau","useful":1,"cool":0},"3zWTMZII_z9NCbmUesStlA":{"text":"This is a great Panera Location.  I use the Panera Catering Service In about 20 states and","useful":2,"cool":2},"2ov0mIOaYUCanSxXiemjJQ":{"text":"I swear you could order just a side baguette and they would get the order wrong. I love Pa","useful":2,"cool":0},"exbmD0fM1glhhM99oiQfLQ":{"text":"After visiting a few times, various times, I feel confident about my stance. \n\nPros\n-frien","useful":9,"cool":7},"oD9Bm0VLLzxwQapWsZnahQ":{"text":"Worst Panera's I have been to ever. Very slow and the man who assisted me was rude. I woul","useful":0,"cool":0},"xPMl_YCTKLqVykcDwXtF9A":{"text":"The food is mostly soups, sandwiches, salads, bagels, rolls, muffins, cookies, and bread. ","useful":0,"cool":0},"g_nD25uVwWDgCYfQcHl7Rg":{"text":"Always double and triple check your orders. I am here a few times a week and things are al","useful":0,"cool":0},"GOF76OwtMKtxOhcmaKl7SQ":{"text":"Went in for lunch at this location yesterday. First the place was filthy. Everyone around ","useful":0,"cool":0},"TMPP42Eari11VWbvE3LOoA":{"text":"Cold ham, egg, and cheese breakfast sandwich. Second time in three weeks. Only came back b","useful":0,"cool":0},"BiI2mni-9Lb--M2YbTwSdA":{"text":"This used to be my favorite restaurant but recently their customer service has been terrib","useful":0,"cool":0},"KWpLl4nQG0ZBGantKZqFwg":{"text":"Service was not so good at the Santee location, the food was not as advertised and major i","useful":0,"cool":0},"xdKpcVvxz31TO2SR6hkbqA":{"text":"For fast food that is healthy, the food itself is a solid 5 stars. The restaurant is in a ","useful":20,"cool":16},"MFTQ_skJDc-uU-SyX8hnOA":{"text":"When it first opened I was excited. It was a regular lunch spot for my daughter and I. Qua","useful":2,"cool":1},"SdkfSmj8WUxcZ3yI_OAObA":{"text":"In a city full of incredible restaurants, it's difficult to choose a chain. I've been here","useful":1,"cool":0},"pErAsfbA4VcdLMAGHkRmIw":{"text":"I fell in love with Panera because of their Thai chicken salad and chicken salad sandwich.","useful":2,"cool":1},"nmSNTt0B2Nig7Ph43L2NSw":{"text":"Disappointment is an understatement. One of the managers Natalie is disgusting in displayi","useful":0,"cool":0},"nl_HmtPklkg7NsnwpFGBtg":{"text":"Enjoyed my Baja Mac and Cheese, Turkey Chili. Although I was not fond of the brownie but t","useful":0,"cool":0},"v6hrZgohHI0o_MY7ZvwiKw":{"text":"So sad to write this review. Third time I ordered a salad (and this time I asked in the no","useful":2,"cool":0},"YpdSvanO0oDHZocba1_59w":{"text":"It would be a lot more pleasant if the person who took my order was not texting the whole ","useful":0,"cool":0},"uwyZRxWhXcAp1jEWCkPEqg":{"text":"Went today around 1.  I've only eaten at a Panera once and that was about five years ago. ","useful":1,"cool":1},"PCf-Xz2pOA0fJlqfobIXRA":{"text":"This is hard for me to write. I am from the home of Panera Bread, formerly St. Louis Bread","useful":5,"cool":2},"qgFlcDPhj_nxLTPuL6GBRw":{"text":"This place was poorly planned. The parking lot is way too small for the amount of stores a","useful":4,"cool":1},"M3Hs6nhhrR2nnr5VE0Xmkg":{"text":"Went to Panera Bread Saturday night after my work day. Decided to get two sandwiches and t","useful":0,"cool":0},"a1kc48FRxTh8p4JZhkVoDg":{"text":"I was pleasantly surprised by this Panera Bread! Although the thought of some delicious ba","useful":0,"cool":0},"9qJbITToUwC1Xctyo9a1qg":{"text":"This Panera is trash. We ordered it to go (I literally live walking distance from the stor","useful":0,"cool":0},"9D9tCDmlD1ZqnVgagcaQ_g":{"text":"Went in for lunch at this location yesterday. First the place was filthy. Everyone around ","useful":1,"cool":0},"AUYNVDt-gv57ETjz_49q0g":{"text":"I am trying to be healthier in the hood rather than drinking and eating if you know what I","useful":1,"cool":2},"-yg-ZOlchiFrY493HifrsA":{"text":"Usually order. Breakfast of scrambled eggs and egg white and pay like $5. Ordered same thi","useful":0,"cool":0},"cOU7FFGkiVGT6yfp4-UTZQ":{"text":"This place is what you expect from a typical Panera bread! I always enjoy their tomato sou","useful":2,"cool":0},"jmK4ogK_u10NP5vIo7a8rw":{"text":"Just too expensive what you get. The strawberry summer salad is really good but seems to g","useful":5,"cool":3},"GfZcxbcFiVkXwXwUZqnYLQ":{"text":"I've been meaning to try this Panera since they came out to MidCity. I had them once befor","useful":13,"cool":9},"WWtKwRQ_6n4o1yIpTb1G-Q":{"text":"I hate to do this but after several recent visits that left me upset I feel I need to leav","useful":0,"cool":0},"_QQuXRRTN5157DDtyoekfg":{"text":"If you have a special order or are making any changes to the food they already have list d","useful":0,"cool":0},"7JIG4U-iJSdkA8U492OggA":{"text":"The order pick up people are so ignorant and ghetto. Also they're requiring that guest tha","useful":1,"cool":0},"KgbgWVkk7tBzJqxbKYApWg":{"text":"I'm a sucker for their chocolate chip and cinnamon crunch bagels! Whew a sinful but good m","useful":1,"cool":1},"o5kUcHpTGsB4jk29OFGppw":{"text":"I like Panera Bread, I really do. I am buying into the clean eating thing. However, this m","useful":0,"cool":0},"PbZraUpASS6RRflXC5BT6g":{"text":"Panera gets 5 stars simply because everyone I movie order to the wrong store they still pr","useful":8,"cool":10},"yQZne5YiAxUccVxcl67GFA":{"text":"I'm a regular at panera but was very disappointed in this location. The only positive was ","useful":0,"cool":0},"CUlN8xrqDhHjl_UPp25vvw":{"text":"signed back onto yelp after years away to comment how great service is at this branch! I c","useful":0,"cool":0},"qskEvtbSjBS6XguiI8wjPA":{"text":"Ordered a panini, broccoli cheddar with no meat and a bagel. I got soup with bacon with it","useful":0,"cool":0},"SQA19s0HP2HZiOMWw5IXKA":{"text":"The food was consistent with other Panera locations, so I was pleased with that. I got the","useful":1,"cool":0},"7st0tcWkyuN4H2L87-H1gQ":{"text":"Why do I come to this chain when so many amazing local options exist? Answer: consistancy.","useful":1,"cool":0},"GxY68Te1CmFDJ7Omm0Ku8w":{"text":"This location wait time is beyond ridiculous, if the employees talked less they could get ","useful":0,"cool":0},"A3SmcV2fQ2KVhuQyPyOtJA":{"text":"I have given this Panera at least 6 chances before I pull the plug on them. When you walk ","useful":1,"cool":0},"TcNBZv_yJMvazeuByMKsLw":{"text":"amazing and friendly customer service the food here is always amazing love how cool and ch","useful":0,"cool":0},"t3vRPt6LLXa38UND8i0pcA":{"text":"Food is absolutely fine but not worth it for the price. Perhaps these establishments do we","useful":0,"cool":0},"yR1XdhXh93_v6R6-NbEGfA":{"text":"Now the the crowds have settled down at Panera the parking and seating problem that they h","useful":3,"cool":1},"xLLB0tqi3yu22jiYW1psdA":{"text":"A really good sandwich. My go to actually when I'm at work and need a quick bite. I got ki","useful":0,"cool":0},"CEXSAF47nK2dcfshcaqNug":{"text":"Found a piece of plastic in my bacon turkey bravo sandwich! A serious health hazard and ap","useful":0,"cool":0},"ZJr8_AfauYTGdic0TTjFRw":{"text":"This is the worst Panera location ever. Every time you're met with a terrible attitude. Th","useful":0,"cool":0},"ZAykNuK6VjtPVKShtaP6Mw":{"text":"This location is a franchise so I like this Panera because the staff are very friendly and","useful":0,"cool":1},"OTx7Rh6urEw-bOn2YPaYMQ":{"text":"Friendly staff at this Panera. Just walked over from my Airbnb for a cup of coffee. I was ","useful":1,"cool":1},"f3qQ1NFe3BxcrSY_Vt8KQQ":{"text":"The food was good but the service was HORRIBLE.... the staff in the  kitchen was GHETTO as","useful":0,"cool":0},"ZDAmxbJHRyQwo9E7oRi29A":{"text":"I ordered Uber Eats here for breakfast out of desperation. It wasn't bad! Most of the nega","useful":2,"cool":1},"tiO-BgzxUJoxG73qQ64PNw":{"text":"15 minutes for an order placed ahead. Needs new management & new workers. Absolutely ridic","useful":1,"cool":0},"doC2KIsg-_JZCmDPPEfCTA":{"text":"The location is my good to spot for a great healthy breakfast option.  With their online o","useful":0,"cool":0},"u0SKUXrEtEC17btNI6LwRw":{"text":"I've never written a review for something before. I'm not one to typically complain about ","useful":0,"cool":0},"mUouaTBzaP-6S73fml4-kw":{"text":"If you are on a low carb diet, the bread here....... is the devil. It will tempt you to co","useful":2,"cool":2},"DrO9RnW9Cfaz548tTDdgMw":{"text":"This panera had good service and good food! I'm not a panera regular so I wasn't expecting","useful":0,"cool":0},"nHKCy_SEL1_6FKhFSHtn2Q":{"text":"Thought I'd give it another chance during the pandemic, absolutely awful experience from t","useful":0,"cool":0},"ffYLJrC5QlYEyeFSHW5QDw":{"text":"Horrible customer service. I don't see how the allow Ree at the front cashier to continue ","useful":0,"cool":0},"XQDewGOufsAdpoTEOWEvQA":{"text":"When I asked the manager about my food that had been 20 minutes, she snapped back that the","useful":0,"cool":0},"2JfVtcoWvzd_Hwb1foAfnA":{"text":"Food was good as per usual. The atmosphere is so different tho. It used to be quiet. This ","useful":0,"cool":0},"d5ToZawbHp2ZxORUH6ke0Q":{"text":"It does me a world of good knowing that they opened up a Panera bread here in Mid City. Th","useful":7,"cool":5},"TgnRQw97Q0roqfAZmNdfYw":{"text":"I LOVE the salads, but make sure to check your order before you leave if you order to-go. ","useful":0,"cool":0},"IkGR5irGJabIZqL1qWiR4Q":{"text":"I was so happy when this opened up! I don't go as often as I used to but I'll be back for ","useful":2,"cool":1},"emrJOghnixWFZnK0l9kJnQ":{"text":"First n last time ordering here.\nOrdered pickup , $42.00, sandwiches were not put together","useful":0,"cool":0},"zbXd3XH81xWpCpVAgmkHTw":{"text":"TRIED TO EAT LOCAL: but Wakin' Bakin' is closed Tuesdays!\nSURPRISINGLY LARGE SEATING AREA ","useful":7,"cool":3},"V1AZaHcYKU3UvnwV4Da1sg":{"text":"I met some former coworkers here for lunch over the Christmas break. Plus I had a gift car","useful":3,"cool":4},"HdKxXhPKuvhyzmNLi6iziQ":{"text":"This has to be the worst location. Every time that I come here, I'm always given an attitu","useful":3,"cool":1},"2J2mX5EsEHhKA3zZKWe3fw":{"text":"This Panera has 3 stars, and I'd call that accurate.  \n\nPanera is pretty much the same eve","useful":4,"cool":2},"Q_iq-XBdirnK9u8JkJDtlg":{"text":"Panera is a chain, but I think their company is a fairly altruistic one.  They donate all ","useful":3,"cool":1},"WrRHCd2No_lOxPwwiwu_4A":{"text":"This is really a combination of Panera's rapid pick up service and food. I used the app to","useful":2,"cool":0},"yQsX1CXh8rhpcm9Hg3L94A":{"text":"i really like knowing that there is a Panera in my hood. Their chicken noodle soup/bread b","useful":1,"cool":1}}