{"USHpSzJttdIDXaIcodhB7g":{"text":"This place is amazing! our waiter Aaron was friendly and full of great suggestions for foo","useful":3,"cool":1},"JAnxnpcVg4hF7rmLRC64Zw":{"text":"We hit this place every day we were in New Orleans.  Even just went there for to-go Swamp ","useful":0,"cool":0},"XDvD0abwoyZaZQpAbilj8A":{"text":"We stopped in for a quick bite to eat and a round of drinks. I got the Bacardi Dragonberry","useful":0,"cool":0},"9cY340LnJ7kf_zNMSDlXXg":{"text":"The food was good, the wait staff was awesome and they were playing the game... great plac","useful":0,"cool":0},"_J2slwUpjKxdLOgdfHsmDQ":{"text":"You can usually get a table here even when bourbon st is going nuts. Good local beer selec","useful":1,"cool":0},"FN5FC-AeAwwR1Crb2N-9oQ":{"text":"It's Bourbon Street, I get it. But for the price, you could have given a little more food.","useful":2,"cool":0},"VHmSUZ-rw2w0laM7DsODNA":{"text":"The Bayou sampler is the way to go! Aaron was an excellent server and the atmosphere was c","useful":0,"cool":0},"IdIY8jngL7d58VXTOrMSdA":{"text":"Love this place. Everyone there is great. The oysters at the bar right on time!  Ask for D","useful":1,"cool":0},"kvjPqRqXOs7jH2ZVyXpF5A":{"text":"While in town for vacation, my boyfriend and I stopped by this restaurant for lunch.  We h","useful":0,"cool":0},"gSv-lpuHjCeWdvxV6M4tIg":{"text":"The food tasted great and we were able to get a table on the balcony immediately walking u","useful":0,"cool":2},"RdqkAQCZTgPOU3wtIYmBqw":{"text":"The food was amazing and our waiter Jabari made our experience a great one. His suggestion","useful":0,"cool":0},"NuaM2Xyl3qHteYhwxdp6vg":{"text":"The reason why this place gets 2 stars is because it did not require that long of a wait, ","useful":0,"cool":0},"8GmeWZAweKuxxy6N-fNakw":{"text":"love the open-front seating! truly get the feeling that I ain't in Kansas anymore; or, mor","useful":0,"cool":0},"wsbtsITuEGLKqN8RAkyH2w":{"text":"I have not gone into a single restaurant in New Orleans that didn't serve-up exceptional f","useful":1,"cool":2},"i39l2VW-ArdE7-PIeSb2Ng":{"text":"Excellent stuffed catfish and fried cheesecake.","useful":0,"cool":0},"EiCgzq6brTFKIGRH2JiK8g":{"text":"waited 15 min before any wait staff came by and when they did the guy was not wait staff h","useful":0,"cool":0},"26pPvJ_fm9TQ829kM2WxJw":{"text":"Worst service ever. After waiting 45 minutes for the waiter to take our order we decided t","useful":1,"cool":0},"QkEjTKJOybDnMFljudVENg":{"text":"You can't miss this place. When you start down Bourbon St. from Canal it will be just to y","useful":0,"cool":0},"63ed2oyaWTOE6ZdYMWS8Sg":{"text":"We ate here last night. Kelly was our waitress and she was wonderful! The food was excelle","useful":2,"cool":1},"ZTZLXW6IKTaJiI92X6c5Hw":{"text":"Only 4 stars because all I had were oysters, but those were delicious! Literally stepped i","useful":0,"cool":0},"-dfZQVh4xMTMAKs307Hc4w":{"text":"Visited La Bayou last Friday night.  Here are my recommendations:\n\nTake a break from the c","useful":3,"cool":1},"08yrGDXclaDPL2eneyYQQw":{"text":"The fried shrimp is excellent. I had the stuff fish wow it was fabulous!! Great New Orlean","useful":0,"cool":0},"ItJxWhG930pgtxA6qhqP6w":{"text":"This was my first time at this restaurant and my first trip to New Orleans as an adult.  T","useful":0,"cool":0},"QB--QH962_YF3Ev5OHZkxQ":{"text":"I learned about Le Bayou in a way that could only happen in New Orleans. With a friend we ","useful":1,"cool":0},"0eKJy8M8_PRDViLNrThp2w":{"text":"One of the worst dining experiences I've had. Other than the fried gator and the shrimp an","useful":0,"cool":0},"zjS5Bl-MNC6X12EbPGhkGg":{"text":"Fried alligator was amazing and the entrees were also delicious. The service was just righ","useful":0,"cool":1},"2SH0hD5UJ7xTVMQYe38zgA":{"text":"I loved this place! The roast beef po boy was the best sandwich that I have ever had. I we","useful":0,"cool":0},"3WH3oH4x4CC03uOMtJiGYA":{"text":"I come every time I come to New Orleans and I love it! Great friendly service, great drink","useful":0,"cool":0},"B_MERmNCGEyrVifx_0wA8g":{"text":"Three of us enjoyed a very nice lunch here and there was a Yelp coupon available when I ch","useful":0,"cool":0},"MERUAtVR8s2UPxbomvtFHw":{"text":"I came here with a group of friends because they saw it as we walked through the French Qu","useful":6,"cool":4},"t7vl3MmQIL6JJO1qtyi06A":{"text":"Overpriced bland food, ok service, there must be better options in town, still haven't fou","useful":0,"cool":0},"I8_ltEEr6kfth4Ha33YkAA":{"text":"I wanted to try oysters while in New Orleans and went with this place. While looking at th","useful":1,"cool":1},"q9kN0BWausxatmn_UX7FEQ":{"text":"Excellent food. Definitely excellent food. Great staff. The manager, George checked so man","useful":0,"cool":0},"SqOCrsI4RsVoalboQmrMig":{"text":"I was not very impressed. We went for a late dinner (around midnight). We ordered boudin a","useful":0,"cool":0},"4yWyqNn8f-IiClZH7VYZuQ":{"text":"Last night was our first night in NOLA ever and our waiter Joe was the absolute BEST!!! No","useful":0,"cool":0},"P1vajuFSsLOfQS1W0an1-A":{"text":"Muffelina good. Big easy po boy average. Not impressed sampler platter. Not bad for sure b","useful":0,"cool":0},"HZyM945TkU2k0ZOL6rAoeg":{"text":"AMAZING!!! The food was awesome. We went on a whim and tried it out. I was very impressed ","useful":0,"cool":0},"OXeKjXC6oY3F0ri3r6DHbQ":{"text":"The food we chose was awesome! This place was recommended by the front desk at our hotel. ","useful":0,"cool":0},"f7fi5P16tiMhDtaZgJe-OQ":{"text":"Had the Baked Bayou... And it was superb! The Swamp Water is a little too tangy for my tas","useful":0,"cool":0},"j-3GinXOQfE925Z1ijydKA":{"text":"My fiancée and I got the dozen oyster and 6 ya ya oysters !!!! Amazingggg !!!! We also got","useful":1,"cool":0},"2XYWvSBKFS4Z-bEeJJ-ugg":{"text":"The Hurricane was one of the best I've had so far in NOLA.  And the waitstaff were extreme","useful":1,"cool":0},"nW9hzROCGkyQad4-FaqTKA":{"text":"The staff was nice, food was ok. We used the free app coupon for the alligator and had cra","useful":0,"cool":0},"vYNOIuxPBrWs1yMBZliC5Q":{"text":"Monster oysters - and I'm a big fan. I sat at the bar and enjoyed all appetizers and the s","useful":2,"cool":0},"nA7D9o4LgfLzyUjHj7b-SQ":{"text":"Great service but food had a lot left to be desired. The best item was the crawfish cakes.","useful":0,"cool":0},"9pE9MbAPbWrhqp3DbiKUzQ":{"text":"Teddy at the oyster bar is awesome! Don't wait in line at Acme. Get your oysters here! Gre","useful":3,"cool":1},"ZkQQKOhuMBu5Wp2zIutelQ":{"text":"Right when arriving in New Orleans and checking into our hotel, we decided to go exploring","useful":0,"cool":0},"4hTi-LLkUur_j8-83qtTLg":{"text":"When staying in New Orleans in the French Quarter, there is no shortage restaurants from w","useful":0,"cool":0},"cxa0ASlkIdv5qiMvz75lPQ":{"text":"We walked in last minute with what started as 12 people and grew to over 20. Our server wa","useful":0,"cool":1},"vP3iIm4bRNj9LRNB2ukhHg":{"text":"Okay place. Full bar. Open late. Zero real food options , if you're vegan, but hey- it's N","useful":0,"cool":0},"YASEYX6Sk1OUeMXN4F1x7A":{"text":"Christina H was an awesome Server and sooo very nice! Great food! Enjoyed our experience a","useful":2,"cool":0},"K8KuzHbaERrZgWliVNT1zw":{"text":"Excellent food and the best service I've ever had. Kelly is a phenomenal waitress. We had ","useful":0,"cool":1},"nSuAGBamk4gOT_x5gNmzzQ":{"text":"So here Niki and I are on Bourbon Street in The Big Easy. It's our first day and her first","useful":2,"cool":0},"DmSK14zo8nJSlHitgkydGg":{"text":"It wasn't terrible wasn't good. The shrimp and grits were SALTY. The crawfish cakes were c","useful":0,"cool":0},"oI7S7T5ZmLZskMj312xvGw":{"text":"Good food but bad attitudes!\n\nThe server didn't know the difference between the alligator ","useful":1,"cool":0},"KLVKW5IvzR13VA4YXxtd5A":{"text":"We had a fabulous dinner on a first night in NOLA.  The oysters were the freshest and most","useful":0,"cool":0},"LdrjRcGB-NN6FgVZKPE-Yw":{"text":"We had the crawfish, oysters, and drinks. We both thought it was pretty good. Service was ","useful":1,"cool":0},"tsFxxOFzXlaj0tHck3l04w":{"text":"Food is excellent an the service is top notch....always my first stop on bourbon. I love t","useful":0,"cool":0},"teFs0RGVfYbybplMJ7DODg":{"text":"This was the most disappointing restaurant we visited, food was pedestrian at best and the","useful":0,"cool":0},"nxWvVcl3oNp9IKMsJ1saRQ":{"text":"Really tasty. Had the Shrimp & Grits Napoleon. Delicious, creamy, and filling. Bartender w","useful":0,"cool":0},"4RSiSc4eeBL-0hfMFXvulw":{"text":"The evening started off well. It was our last night in New Orleans and we wanted to experi","useful":0,"cool":0},"wJ_FW9jfG_mjRTnVubyZ4g":{"text":"Attentive service. Seated and taken care of immediately. Kenneth the waiter was adorable a","useful":0,"cool":0},"8Y3XqIwPPyc7RxSE2iG0Tw":{"text":"Fun spot to grab a beverage. Quirky crowd. Loud atmosphere. If you are looking for an upbe","useful":0,"cool":1},"XRUE9HwLbYAo36PN2d36hQ":{"text":"Okay, the red beans & rice is good too. YUMMIEST!!!!!! Roscoe was a good server too. I lov","useful":0,"cool":0},"pWW34vb3U0lb1C3Zf-ykKg":{"text":"A nice place on Bourbon Street for lunch.  Tried an alligator Po-Boy for my first time.  I","useful":0,"cool":0},"YKjuP0f95kdj01paxe1cLw":{"text":"Convenience has a price, though at the end of my meal. I was completely satisfied.\n\nThis p","useful":0,"cool":0},"4zOrdSc206fqgH3Xtok28g":{"text":"Open late to satisfy you when you are having the drunk food munchies.  The menu is very la","useful":0,"cool":0},"uZ_vL_AsrXHVPV1rVMLydg":{"text":"Coming from a landlocked state, we were pretty excited to hit up a local spot for some oys","useful":1,"cool":0},"eBrHn1IvUiGGA5yT9yWZrw":{"text":"fried alligator wast ok but the crawfish etouffee was excellent. Good food and good servic","useful":0,"cool":0},"CUpd93AVjR45v3DU0ZjT8A":{"text":"I stopped in here late one night to grab a bite to eat. I had to try the muffaletta, since","useful":0,"cool":0},"-3uezIKkWu0Gz_GF4ZLehQ":{"text":"The food was hit or miss for me. The crawfish etoufette was to die for, but the gumbo was ","useful":0,"cool":0},"TdkBPgOy-UUQQNEez-c41Q":{"text":"I'll certainly agree with the general consensus that La Bayou could fall into the tourist ","useful":2,"cool":0},"L_Xa_NkNnF7QmH0W4i5oig":{"text":"Service was great. We were seated right away and our server came up right away. Surprising","useful":0,"cool":0},"Qkefh3WYrdTNq-Ett7xYkg":{"text":"This place deserves more stars. FO SHO.\nWe walked in with a group of 6 on a warm Wednesday","useful":1,"cool":0},"c4ejBc8jeecfW-DnBdhROQ":{"text":"Amazing raw oysters! We ordered the raw oysters Bloody Mary and it was amazing. Also tried","useful":0,"cool":0},"yli3X7LEAzR24wLVAZKT_A":{"text":"People say avoid most of the restaurants on Buorbon street because they're not that good a","useful":1,"cool":0},"v-I_YFVlFaLjhqVicK25UQ":{"text":"First off, the food is pretty awesome and the prices are affordable for a New Orleans eate","useful":1,"cool":1},"rOm06U1q1k3FVjkZ2tFuKQ":{"text":"First off I am from NOLA and took my fiance here for her first taste of French quarter fai","useful":0,"cool":0},"QuJVMW516dCFRWfUwY2Ojg":{"text":"It was a cute place and the food was wonderful!  The shrimp and grits napoleon was soooooo","useful":0,"cool":0},"iHnrCQRAuC4oEIN45QpCGw":{"text":"Midday snack - dozen oysters 1/2 Bayou Baked and 1/2 Ya-Ya chargrilled.  Oysters were plum","useful":0,"cool":0},"KuCikihJYyFqklJYB7NkrA":{"text":"Taste of the Bayou. A combination of Cajun jambalaya, crawfish etouffée, red beans and ric","useful":0,"cool":0},"XMwOHTi7WfgXFDFi3RXssQ":{"text":"Our server Erica was super friendly and knowledgeable about the menu. She was very attenti","useful":0,"cool":0},"bQVXvAblB8Qrz_GtfjeU2w":{"text":"Shrimp and Tasso pasta amazing, get that (will go back just for this dish)!! Five stars!! ","useful":1,"cool":1},"dGY5MyE6YOjxw3EuoRvdNw":{"text":"Our server Celeste took amazing care of us and she really made sure that we were satisfied","useful":0,"cool":0},"e3A8AlUBUDhy5OukzHNWug":{"text":"Outstanding service and simple menu it is done well. We sat at the back bar and had Steven","useful":0,"cool":0},"sOSTKllmvWOzRJgx6W8G9Q":{"text":"So sad to hear this place had closed- was one of my favorite stops in N'awlins. Being our ","useful":1,"cool":1},"LQM-DQrRXGWfrsFQs0W2VQ":{"text":"Jumbalaya pasta and the shrimp yaya were AMAZING! Seriously delicious. Our waiter was exce","useful":2,"cool":0},"yfB-QaKuhr0UAQs5mLz6-Q":{"text":"You know, contrary to what others have said about the food here, they must have been to dr","useful":0,"cool":1},"anxHC880D37J0nzuARIs9Q":{"text":"Worst Experience Ever.... We had to get our own utensils from the table next to us, cause ","useful":0,"cool":0},"WoWP1MB98xRF7eOBlE1yBQ":{"text":"Wonderful oysters.  The gentleman who served us our oysters, Teddy, was super awesome.  A ","useful":1,"cool":0},"r_7eb94OpTNySjshkQmiyg":{"text":"The staff was so friendly and accommodating. The food was delicious and their hurricanes d","useful":1,"cool":2},"OFuPZVYvWT0OUAmWKMZIvg":{"text":"Bourbon street is busy, loud and smelly! However, this place was a very nice refuge from t","useful":0,"cool":0},"WY3nO4XIqsLl8s0LhlT2Hw":{"text":"I'm a heavy yelp researcher. This didn't have my minimum of 4+ stars but I was in a pinch ","useful":1,"cool":0},"8XlYpsfZK1hVX5GzJyJM8w":{"text":"I have no clue why this place only has 3 stars. \n\nMy hubby and I stopped in here on our fi","useful":0,"cool":0},"YVSZvGoibpxbuHl700E27g":{"text":"I had dinner at this location.  The jambalaya was mediocre, I can definitely say I've had ","useful":0,"cool":0},"UpG0z2dOpQp_GK1Vadmz5Q":{"text":"Having so many options for food in New Orleans, I don't know if I lucked out or every plac","useful":2,"cool":1},"WBu0EluzzhJjFdvanr5ggQ":{"text":"Great easy place to people watch from the balcony and get some authentic AND decently pric","useful":4,"cool":1},"vzO8DJZv03Rw33FkhnlrYg":{"text":"We had been walking around for a while trying to find somewhere \"not too expensive,\" when ","useful":0,"cool":0},"0pgExegreP7Zl-BurV943g":{"text":"nice view from the terrace but the food is under expectation at least for the combo. Servi","useful":0,"cool":0},"9MOCPOaOnN1FSG6A1GNTIw":{"text":"I would highly recommend the oysters on the half shell, I had the Chipotle garlic butter o","useful":0,"cool":0},"lYTtP9b8Rai25SDBDUlkPQ":{"text":"The food and customer service was awesome omg! The drinks are nice and strong and the atmo","useful":0,"cool":0},"GCz7qD7HqqYAA-CM-zjZzA":{"text":"Definitely try the taste of New Orleans!!!! Jambalaya, Red Beans and Rice, Crawfish Étouff","useful":0,"cool":0},"tv-8gtRK916VGw7zUpUByQ":{"text":"Some coworkers of mine and I enjoyed a nice late Sunday night meal here in late November o","useful":0,"cool":0},"73eZLG3DnXrlfVRTSUzX0A":{"text":"This place is horrible. The food did not come all at the same time. Service is terrible. F","useful":0,"cool":0},"aJPdyatYCa6M3bnNNTwwFA":{"text":"Best restaurant in the area!!! Mostly locals and absolutely a must try!! Kevin was the bes","useful":0,"cool":0},"z4n6ZBfqHJUolpwEdmCuVA":{"text":"Food was great but the service was amazing! Thanks to our server Aaron for his recommendat","useful":1,"cool":0},"QEBp9rRBXRtkl1u8wWkBKw":{"text":"I loved it!  Magen was a great server and recommended a great meal and fried cheesecake fo","useful":1,"cool":0},"8B8QhFOIc_P31_acaPHpfw":{"text":"Located on Bourbon St. so being a tourist trap and as expected, the price is a little high","useful":0,"cool":0},"Nqj-1qmjSdI5p6DVN5fzBw":{"text":"This was a terrible experience! We were with a party of 20 or so, we were the first to arr","useful":1,"cool":0},"EXQA9C3qZdmtc_WNWOQarQ":{"text":"This is our first time in New Orleans and our first stop since getting here and Kenny made","useful":1,"cool":0},"vR_1s1scWB8-a7r6tTvq-g":{"text":"Really mixed experience.  We were promptly greeted and seated when we arrived at 6:00 PM. ","useful":0,"cool":0},"EP9Hru1_FctAd8CYlnIsEQ":{"text":"We came to La Bayou because we wanted a dinner that was more casual and less expensive.  O","useful":1,"cool":1},"fKrYRAWyKmCBUtKkeJlpjw":{"text":"This place ROCKS!!! Come here for the friendliest and most accommodating hosts and waiters","useful":0,"cool":0},"P68XthvDFoSET2a7zGgqnQ":{"text":"Right on bourbon and easy to get to. Reasonable prices. Fun, traditional bar scene. Friend","useful":0,"cool":0},"ksVOzkopSJti4OBMGsj_TQ":{"text":"Small but nice - not super packed and not crazy with drunk \"college\" people.  The service ","useful":0,"cool":1},"RUgomhaX1_sEWrh0XsYc7Q":{"text":"We were visiting from San Francisco and had to enjoy the Bourbon street nightlife. After a","useful":0,"cool":0},"nmd2J7V1oXrZVDs0xF8H6Q":{"text":"Great food. Best oysters in Nola! You need to try the taste of the Bayou next time you hit","useful":0,"cool":0},"svBLen5Na8_bczsXTrc-8g":{"text":"Sorry, I don't get why this restaurant is rated 4 stars.   I had the blackened redfish wit","useful":0,"cool":0},"xDrZtV80QfVDnEVoEzeD8w":{"text":"Great oysters. Sit at the oyster bar with Nashawn and Teddy for some great entertainment a","useful":1,"cool":0},"1VU7u3tD2xPQxZw7NgJ4nA":{"text":"Wonderful service!! I especially enjoyed our waiter Aaron!he was awesome and offered great","useful":1,"cool":0},"xdlmNCtvaQ9M2j4OwpzBWQ":{"text":"I love the vibe of this place. We had balcony seating which was amazing for people watchin","useful":0,"cool":0},"yoCRXuZLaMmHkbGH0OIuCA":{"text":"We went here  just for drinks.  It was on Thanksgiving day so it was a little dead inside.","useful":0,"cool":0},"kUoW9bsOs4jMHN3JruAGKw":{"text":"I would not recommend this restaurant.   For the most part the food is mediocre and the se","useful":3,"cool":0},"75pXHW3rOgwbuOcLjiH-Jw":{"text":"We had a big group and walked in during dinner with no reservation. They sat us right away","useful":3,"cool":1},"4JnJEwXKlMF8g7npWXdOkQ":{"text":"Our waitress tenisha I believe was her name was great quick efficient and very friendly.  ","useful":1,"cool":0},"fQ7Xx9IPMFxc2YE3TwsroA":{"text":"Cold fries...yuck!!!!!!! Hope i can give this place 000stars...Gumbo ok...price overly exp","useful":1,"cool":0},"nY4e0HAsSOBOKr30-TuF5w":{"text":"Freshly shucked oysters and an Abita Turbo Dog is enough for a thumbs up in my book.  The ","useful":0,"cool":0},"AAtKQjT72Qeocd9Y_kimIQ":{"text":"The food here was fantastic! I would definitely recommend it. The location is great as wel","useful":0,"cool":0},"tol786XmZh52hPqwW4EqNA":{"text":"Nawlin's for Halloween what could be better! This city popped my Yelp cherry. Finally gave","useful":1,"cool":1},"P0yOUJFqiwTQ3CIp6yyI6A":{"text":"3.5 stars. We were walking on Bourbon street Sunday night and everything was closing at 10","useful":4,"cool":2},"DQOW6rpUyI3YzAENQYOKrQ":{"text":"I just finished the best meal so far. It was at Le Bayou. I had the Stuffed Fish and it wa","useful":0,"cool":0},"JY_sAxnT2VFIvERe29RFuw":{"text":"We came at the beginning of dinner service so the server was super fast and food came imme","useful":0,"cool":0},"4TbxYqFsPlgUFXTsKPg8vA":{"text":"I legit can't write about the food, but I can legit tell you of other things. In need of m","useful":0,"cool":0},"V8CdLOfPQ2GdlL7GEFLENw":{"text":"We stumbled upon this place after we slept through our reservations at Stella and then tri","useful":1,"cool":0},"nTnoSdBSIKKjkB-mJ1wKag":{"text":"I was looking for a cheap, casual dinner around my hotel at 6:30 on a Monday night.  Somew","useful":2,"cool":1},"zgz52-zTZFvH9y1G7RiR3w":{"text":"I had a pretty average Oyster po-boy. It was good, don't get me wrong, but it was not spec","useful":0,"cool":0},"ilUhSDmM6NNFLh7unpAf8A":{"text":"Very good Creol fare. Though clearly a tourist draw, you definitely get the bang for your ","useful":1,"cool":0},"N9wi1UCEikfER-2CHjWI8g":{"text":"Chargrilled oysters and poboys were excellent. Service was a bit on the slow side though. ","useful":0,"cool":0},"rWgrmd8fmjFUa8Bvhkbp9Q":{"text":"Food was good, but service was extremely slow. If you want a great atmosphere, sit upstair","useful":0,"cool":0},"br8RqNiQEwQ52tQac-D6gQ":{"text":"Excellent food and very personable staff. Aaron was top notch and took extra time to give ","useful":1,"cool":0},"Af0ubOqtdVvovw22b55Q4w":{"text":"This was my first visit to New Orleans- but im convinced there's no topping this place. Th","useful":1,"cool":0},"4nQbtcbpfFAG1VukoI-ZEQ":{"text":"This place was pretty average as far as New Orleans restaurants go. Our server was very ni","useful":0,"cool":0},"-1chRVtrOI_NzM2IXyCrSQ":{"text":"Excellent food and service!  It was so good I ate here two nights in a row.  Red beans and","useful":0,"cool":0},"fAb5SD5DxJEKhSXfG4oj-A":{"text":"Excellent oysters good drinks,  good beer selection, especially on draft. \n\nVery excellent","useful":0,"cool":0},"7q1nbfhsbROiLWEB1XR6jQ":{"text":"This place was amazing!!! The food was delicious and our waitress Kelly was very nice and ","useful":0,"cool":2},"J0gh2aLps8ZRgAJTIY2XOw":{"text":"Loved this place !  We were able to sit on the balcony on bourbon street and it was a beau","useful":0,"cool":2},"BEs6gLWnkVu3GcVUAybTyg":{"text":"Came here from Boston looking for some southern cooking and I had a very successful trip. ","useful":0,"cool":1},"l1lx7NxvkkqlLsTSzf6apA":{"text":"Came in at ~9:30pm as a couple. Were seated immediately  Ordered the bayou baked oysters a","useful":2,"cool":0},"1DnaD3D0AsxPfn15w_oi_Q":{"text":"One of the best meals of my life! We stumbled on this place on a Sunday night. It was full","useful":1,"cool":0},"EbJEb2Ab5EjWT_dt4k6k-w":{"text":"We eat here on every trip to NOLA. The Bloody Marys are the best I have found. Last visit ","useful":0,"cool":0},"ecArbTKCb80wFMoWh6wZWQ":{"text":"Had a very good time here. My wife and I stopped in for oysters and were not disappointed ","useful":0,"cool":0},"HQstSJX82sTcoJpjRKQwAg":{"text":"Food is extremely disappointing just like all the food on bourbon at. Go to to Frenchman s","useful":0,"cool":0},"zJW9JNzJ5UL1XP0vaqyudA":{"text":"First time eating raw oysters... Hated it, I didn't care for their patron margarita either","useful":0,"cool":0},"BPt-jLReRVZ0Ov_W_9wPtg":{"text":"The food was great and Kelly was a great waitress! Would absolutely recommend this place t","useful":0,"cool":1},"jjYOVMS6FwsvD2ut8vnFhQ":{"text":"This was a great place to eat and the service was fabulous. We had a 'taste of the Bayou' ","useful":0,"cool":1},"ji3BfZ5IrEc-h1jsE7o7pA":{"text":"Ah-mazing. If you are considering going here, I'm telling you. Eat at Le Bayou. You will n","useful":0,"cool":1},"5T-msH1cv7gLI0FU5wx64A":{"text":"We had the crawfish cakes crawfish soup, fried alligator, fried oyster platter, and a loca","useful":0,"cool":0},"sSJrJ6L9h2DXetEKuHLVrA":{"text":"This is where I found out I love oysters.  This was a great place to sit above Bourbon St ","useful":0,"cool":0},"lMai7nAFjbb2RviLHzmYgw":{"text":"Service: \nCame Sunday around lunch time and was seated right away. Our server was pretty s","useful":0,"cool":0},"xj4fm4OlglpmGjDP8vkrVw":{"text":"This was, by far, the best dinner that I ate in the French Quarter.  I had the Shrimp and ","useful":1,"cool":0},"coDf6BykM1urVl8PRpLXcQ":{"text":"Loved this place! So much so that we had to come back a second time before we left.\n\nThe s","useful":1,"cool":0},"00ESwjtrqH4ze5zPeFMvow":{"text":"They served us right away, the food was so incredible and not expensive. We ordered raw oy","useful":1,"cool":0},"zcwh01MrLS8W26hcl5qj0g":{"text":"They tricked me! Appears to be fine dining with fancy white cloths on table with wine glas","useful":3,"cool":0},"RulxhsJiPiZNea92ax_zew":{"text":"Service was phenomenal especially being right in the heart of Bourbon Street! Nice getaway","useful":0,"cool":1},"BUUbfBD3b6LmXoQ_nWBnkg":{"text":"My husband and I happened upon this joint while walking down Bourbon St. on New Years Eve ","useful":0,"cool":0},"axDPBs_GP8i3LYBAvB-goA":{"text":"Been in NOLA for a few days and it is foodie heaven here. I have to leave a 5 star review ","useful":1,"cool":0},"Podb0KH-wQDOhpqxPQeHbw":{"text":"I loved this place. The open air, the great bar, and the food!! I had the red beans and ri","useful":0,"cool":0},"_KvOFLgR0MgcKqloeJxrhg":{"text":"We had a seating at the Patio with a good view of the Bourbon St. There was a wedding gath","useful":0,"cool":0},"CWH1IJUrdXnWiTfBjEeMsw":{"text":"Service - Our server was lazy.  We shared a po boy and asked for it to be cut in half.  Se","useful":0,"cool":0},"UltYjZru0mo6v8B-SM5mKA":{"text":"Very good Authentic Cuisine.. from gumbo to fish, everything in between was awesome! Had a","useful":0,"cool":0},"4xZeY2pKZi25Ys0i9Y_YAA":{"text":"I was very unhappy with my meal. I wanted a fried green tomato po boy because I don't eat ","useful":1,"cool":0},"N-w1wEFruiJH_IyjRwluUA":{"text":"Great place directly on Bourbon Street!  I don't have many other places to compare these O","useful":0,"cool":0},"DFDsvlxPqIcJ7XDTucw81w":{"text":"Great po'boy sandwiches. The remounted sauce was to die for. Open until 2am so great place","useful":0,"cool":0},"ghzioC59ZinPKkqeusOR_w":{"text":"I loved this place. We were seated on the balcony so we had a great view of Bourbon Street","useful":0,"cool":0},"nz_NA4_RWEowDyO94OezWA":{"text":"Very cool place with a nice balcony to see Bourbon Street while you eat. The drinks are de","useful":0,"cool":0},"PXm9k8_zSNEf9TXawsMxFw":{"text":"Didn't actually eat here because: \n\nI bought a restaurant.com certificate for this restaur","useful":0,"cool":0},"uNKGvu67XYLyGZ2v-hM4ww":{"text":"Food was delish and Kevin M our waiter was on point!! Most def would eat here again and ag","useful":0,"cool":0},"afd7dAYH4bGVSj4sppDPTw":{"text":"Seafood restaurant on Bourbon St.  Fast friendly service. This was a spur of the moment ch","useful":0,"cool":0},"jxxlQp9TvTY3QJALVittQQ":{"text":"-Awesome server!\n-amazing shrimp & grits\n-good bourbon chicken\n-good rice & beans!\nVery au","useful":0,"cool":0},"m4mdHqj-QT7hU6jbpOO8qg":{"text":"Easily the best red beans dish I've ever had! The Andouille sausage was amazing and their ","useful":0,"cool":0},"gVHs43CIR9YXGIbRwshOXQ":{"text":"So... Le Bayou. I come here once a year for a yearly NO trip, and each time, I come away w","useful":0,"cool":1},"nz1Y5HtLa2wcsm2d29aPUw":{"text":"Very nice atmosphere, our waitress Sierra was awesome, the food looked and tasted amazing.","useful":1,"cool":0},"uhWwp3L2T7I5HSnZ_c6TfQ":{"text":"LA Bayou is your typical tourist trap restaurant, right smack on Bourbon Street. But, I th","useful":9,"cool":7},"VDhcZHyIfenwesaVNu1Skw":{"text":"I was very pleased with the service here. Rubin manager went out of his way to help us. My","useful":1,"cool":0},"wER9HrNGqVv1G9LfgBycrA":{"text":"Just wanted to start off by saying that this is on Bourbon Street, so you gotta expect you","useful":0,"cool":0},"MxFj1Xf71WzvBS2eduqBYQ":{"text":"My food was terrible. I had the shrimp and grits with fried green tomatoes. The tomatoes w","useful":0,"cool":0},"Wg3Gf3efX-LZzpC4qCTiYg":{"text":"Appetizers came out in a decent time, the waiters were very nice but sure take their time ","useful":0,"cool":0},"AJYCPm507NwKztFh8M0aFA":{"text":"I was very happy with what I ordered. Our server recommended a few different dishes and I ","useful":0,"cool":0},"8IN6pIf1gxOzWrO9J5EK7g":{"text":"Great oysters, large and fresh.  Also had the Taste of the Bayou which was excellent altho","useful":0,"cool":0},"5rXktoMUBLJvdh01LMWUyQ":{"text":"For my first meal in New Orleans I stopped by here because it wasn't as busy as other plac","useful":1,"cool":0},"0GrlRbawKmf9gjdKsb_ehA":{"text":"Kelly is the best.  Get the oysters and cheesecake.  Great atmosphere and great service, b","useful":0,"cool":2},"ztCVmfYG53uu3dTArjdLJw":{"text":"My husband and I went to le bayou expecting great service based on the  recent reviews. Th","useful":0,"cool":0},"qnIyMGjgmAlH2wFIuIOy2w":{"text":"Located on Bourbon, we settled here because Acme was too long of a wait.  The atmosphere o","useful":0,"cool":0},"Tfp3pJlTKhhhnXl9RS-UlA":{"text":"We wanted it to be SO much better!!\nLocation is great.  Menu looks great.  Service was awf","useful":1,"cool":0},"NsKoLVh-vsfvxB5n-xJulw":{"text":"Watch the crazy of Bourbon Street pass by in this little but good eatery...be careful thou","useful":0,"cool":0},"dewpHa5t91RwpSD04kYBWw":{"text":"I have absolutely no idea how this place has so many stars. The service was the only redee","useful":0,"cool":0},"PK2a-G-NkuDzjV0U3CR7GA":{"text":"Had a great meal that included the Taste of the Bayou that included four local favorites. ","useful":0,"cool":1},"6nb7dIyHWcDg71NuhiGW0g":{"text":"The food here was great ordered the shrimp and grits! Fantastic and the swamp water drink ","useful":0,"cool":0},"GMmXbzOHSKveClUtGJzKnQ":{"text":"Great service and food.  Food selection obviously slants towards seafood, but non-seafood ","useful":0,"cool":0},"pmvM1-xGCVtoWJ7Y8Ly83w":{"text":"What a great place! Immediately, from the time we sat down, Dave, the bartender introduced","useful":0,"cool":0},"Sd-NqNlfZ5xKq8wLYBpeqw":{"text":"This was one restaurant I didn't check out on yelp before the trip, but I am glad we stopp","useful":0,"cool":1},"GQrEN_Zrn8oMgbPppe2HPw":{"text":"The staff is very friendly and they recommend the must have dishes to the tourists. I give","useful":0,"cool":0},"NkPT_sOjqLuDPJjg8xT_aA":{"text":"My first trip to Bourbon Street was Christmas night and we decided to wait in line for the","useful":1,"cool":0},"ovfVRXKvgM1SBsPC5ewlZQ":{"text":"The three stars is basically because of the service and employees.\n\nThere were some people","useful":0,"cool":0},"A23vkWZVE8D5F5_UzOvsYQ":{"text":"My first meal in New Orleans and everything we had was delicious. I recommend the charbroi","useful":1,"cool":0},"AK0M0PIaeznRCDNqUk8TjA":{"text":"Stopped in on Saturday night and the place was packed. We were seated quickly and the serv","useful":0,"cool":0},"OXu_xnlnpT8-U7VSQDFCsw":{"text":"We came in with a group of 20, no reservations.  They very graciously and quickly set some","useful":3,"cool":0},"jwF8bg8B-DICnGlcbRNrsA":{"text":"I like the food we ordered here very much, so I give this place a five star. Since we got ","useful":0,"cool":0},"SJAWaO3EySs6A0CssLmwXw":{"text":"I loved there crawfish cakes and their bayou bake oysters it tasted like pizza ! The only ","useful":0,"cool":0},"Jv8qglDgtxhCkB9KgjYSaA":{"text":"My husband and I went here for lunch based on the reviews and because he had been craving ","useful":0,"cool":0},"NUw2BZDJqBH5G3T0t8r13Q":{"text":"I'm a local in Nola and normally you wouldn't think a place on Bourbon would be any good. ","useful":0,"cool":0},"Rl2Q_HZ7ZQ03e0Fr0Fsn3A":{"text":"Awesome jamalya met me and went through the menu i didn't know where I wanted to eat we ca","useful":0,"cool":1},"KQZ-zB-XfQ8DkpcnDPtIRg":{"text":"The redfish beignets and crab claw appetizers were delicious!  The sauce from the crab cla","useful":1,"cool":0},"cynKABQgQNFN_r4OpXaedA":{"text":"Not even sure what the name of this place is. Some signs/menus say \"LA\" and others say \"Le","useful":0,"cool":0},"3b_FgzmJ2bycSpn8v4ZwhQ":{"text":"Came here for a quick meal before going out, service was a little slow, but food was prett","useful":0,"cool":0},"JNgAiiaZPxVcNaZNUk782w":{"text":"The Bayou baked oysters were wonderful as were the Big Easy Po Boy and the Gumbo. I have h","useful":0,"cool":0},"b9QUDJ7SUgP2Pe9IIwdFaA":{"text":"At Le Bayou Restaurant on Bourbon Street un New Orleans. The Bourbon Glazed Chicken was am","useful":2,"cool":0},"odNw6uYGUB1oZUxteOfqPg":{"text":"Stopped in here, after walking out of an other place.  Due to non service.  I'm pretty imp","useful":1,"cool":0},"vEcPE3GuY30dPlhrioVynQ":{"text":"Truly enjoyed this restaurant! Great service, great food!!! We tried oysters, shrimp, rice","useful":0,"cool":0},"E3qxsQnd2iAE9TeQ2Nkn_g":{"text":"Fantastic! The raw oysters were awesome. The ribeye had great flavor. The veggies on the s","useful":2,"cool":0},"yuN_DNUJnrJORG9fGcYHuA":{"text":"Solid Po Boy but don't get roped into getting the Kings Sauce with it.  Our server asked u","useful":0,"cool":0},"j5OljwETH1marUIEKsfcAA":{"text":"They took the shrimp and grits and elevated that to a whole new level. Simply the best I h","useful":0,"cool":1},"IIqzNaaFG4JCxC7ttlLkrA":{"text":"Nothing spectacular, decent vibe, other than ppl coming to the patio to toss beads as you'","useful":0,"cool":0},"aDPuxKt6mPwpiMKlZudbVg":{"text":"redfish salad was awesome-- a big old slab of redfish on a tasty salad... yum.","useful":0,"cool":0},"U2uKFryJFtsTygueqC3oNQ":{"text":"We had eaten here last year during Jazz Fest, and enjoyed the food, so Vince wanted to go ","useful":0,"cool":0},"54Z4d6V2P3n2WafUmAt0Bg":{"text":"The food was delicious!!!  We had the oysters on the half shell, and it was really good!  ","useful":1,"cool":0},"wnSf-WhJ6FCRex3DzFTSPQ":{"text":"Bad customer service, asked if they have sweet tea, was told yes, was brought out pure syr","useful":0,"cool":0},"NP19TMt2idxPAy1R-4nxRA":{"text":"We went during Mardi Gras. The food was not great, not worth the price, the alcoholic beve","useful":0,"cool":0},"KLXFwjYolnx6YAJ9NragOA":{"text":"Me and my wife went to Mardi Gras this year.  We don't drink but we enjoy going to big eve","useful":0,"cool":1},"3y_CQGN-lM-CHeGjmziqXQ":{"text":"Excellent  service! Shrimp and Tasso pasta is awesome. Jabari is the waiter you need to re","useful":0,"cool":0},"3K7Kc82bhU6-qjAjsBs3Fw":{"text":"New Orleans is not so much known for their shrimp grits...it is better known in the Caroli","useful":4,"cool":2},"VtsQMOp_LXW6MHSIB1ybeQ":{"text":"Shout out to Preston at the oyster bar!!! He is awesome and provides the BEST service on B","useful":0,"cool":0},"j9BVF7CnLHd4Vrh9N2ZHNw":{"text":"We were here on Christmas Eve, just for some oysters and drinks. It wasn't too crowded as ","useful":0,"cool":0},"Anxv1Jafl38PSUhED8u82Q":{"text":"this place was much better than i expected.  the fried green tomatoes were good but not am","useful":0,"cool":0},"L2tTPOYlzdHFrxfq4HUugg":{"text":"Great patio lunch/dinner by Bourbon Street, but they only sit 4 in a table:( Garbage dumps","useful":0,"cool":0},"APgGwfcglfcdhg5kqYBL8g":{"text":"Service is pretty weak (even by New Orleans standards) and the food isn't too great either","useful":0,"cool":0},"qZcWncqJLQV7V0zRphMItA":{"text":"Just got to New Orleans 30 minutes ago from California and came here. The Oysters were hel","useful":0,"cool":0},"2iBOX-9aZIWGAerpf0pgAQ":{"text":"This place is open late night, which is awesome ... but the food isn't good. I had a Chick","useful":0,"cool":0},"mx--7l7_BMAhsc4CchN-8w":{"text":"A must! The Shrimp Ya Ya has the most amazing pesto sauce I've ever had! Also, the service","useful":0,"cool":0},"s4TYxTf4x9YQ59c-HCA0lg":{"text":"This is one of my favorite restaurants in New Orleans. I have been there a few times and I","useful":0,"cool":0},"hOBhFw14B1ZKe4tKKmApTg":{"text":"Overrated, expensive.\n\nWe dudes had the sampler, ($18) with cups of étouffée, jambalaya, g","useful":0,"cool":0},"Z_iP-W4JuJ7PxPudFtunsg":{"text":"Cool balcony and good menu. The crawfish was delicious and so is the jambalaya! The gumbo ","useful":0,"cool":0},"pd4Ux1D1MHPQLIgtXoKKEg":{"text":"Boudin balls good, so was Shrimp Ya Ya, but fresh oysters smelled like dirty socks, and se","useful":0,"cool":0},"RSC4J-Kc1HwHRcCoYB9zZA":{"text":"Le Bayou is amazing. The food is really good especially their oysters!  Their pasta is gre","useful":0,"cool":0},"t6d4OTOlJOqWNsTAlkVryA":{"text":"This is the first place we went to when we got to New Orleans and we absolutely loved it. ","useful":0,"cool":0},"jGvk0xJM_Cq_an50tNo3Bw":{"text":"As someone who wasn't enjoying the permanent vomit smell emanating from Bourbon Street, th","useful":2,"cool":0},"KZ80PD1mQV54cAPXeZeTQA":{"text":"Really neat place almost set in a Victorian Home upstairs. A group of us only ordered a bu","useful":1,"cool":0},"zwNuKLV3syIy3KMvnvANMQ":{"text":"Giant hair in our French fries :( wish I could give zero stars. They gave us new fries but","useful":1,"cool":0},"F38vpe0VeroRQtRn7uKkgA":{"text":"First time going to an Oyster bar in New Orleans... They did not disappoint! the food was ","useful":2,"cool":0},"5SjjzdpJaHZWd-698HhPqQ":{"text":"Oops!  Dug into the BBQ shrimp appetizer before I took a pic. Mmmmm. Jumbalaya was great w","useful":1,"cool":1},"atlautvh6Rh9f-ghUchIrQ":{"text":"Horrible service.  $14.50 for my drink and the server dumped 1/2 of it on my leg.  Stay fa","useful":1,"cool":0},"EoOV7l2AvuJuBo75rP4KBQ":{"text":"Clean restrooms good pasta.  Not bad for bourbon street","useful":0,"cool":0},"67h2xibZZDOwpU05fSvz_w":{"text":"Just good damn food!  The Tasso Shrimp pasta phenomenal. Good fried alligator appetizer. G","useful":2,"cool":1},"3P32JNjpJEJT6Lg5se9AJA":{"text":"Bartender at our hotel recommended this place as a good local restaurant  that would be ha","useful":0,"cool":0},"B6wRDQ6mY0z4mxry7_IrgA":{"text":"The service was extremely slow and only 6 tables were in the restaurant. The waitstaff spe","useful":0,"cool":0},"Vex0hy3BIDWhwrA0T3VQpQ":{"text":"Don't waste your time food served warm, cost way too much waiters seemed to be just to bus","useful":0,"cool":0},"j1-XOIDU60wXm0rEKLZRJQ":{"text":"The oysters are awesome- huge and fresh. I got the baked bayou oysters and they were delic","useful":0,"cool":0},"llnHEwXy4EoGWWY5tYJH4Q":{"text":"Good food in an open air setting. Service was slow but the gal was good. One of the best o","useful":0,"cool":0},"i84k9L2KL6cSfvukJQaccA":{"text":"I had my first shrimp and grits, which were served with a fried green tomotao and this won","useful":0,"cool":0},"R73avU2GnYRw7QSS7sThWQ":{"text":"My most recent trip down to New Orleans almost didn't happen.  Everything that went wrong ","useful":2,"cool":2},"xM1ghCcLYFhBKL3YKSdbUQ":{"text":"We only had two items off the menu but they were superb!! The oysters were ginourmous and ","useful":1,"cool":0},"8qGNYpK8cyudeMrJLrzlFg":{"text":"I wouldn't recommend this when it comes to dining in New Orleans, there are so many great ","useful":0,"cool":0},"f-J-wdJSYFCNuUPr_nHNGg":{"text":"It was an okay place, but not what we expected for quality. The tables were a little small","useful":0,"cool":0},"CfVKEGxGC83cL_oe4LqyUw":{"text":"The food was good, though a bit pricey (as with the rest of the French Quarter). I was hap","useful":0,"cool":0},"XuQz1v8mMm_4JKtCBcQLeA":{"text":"This is a cute restaurant, with a nice open space, but the food is ok. I've ordered the ba","useful":0,"cool":0},"ktra4FHZGD-ogmH9ZVChGA":{"text":"Great food, had the taste of the Bayou.  Service was not so great.  Wrong orders came to t","useful":0,"cool":0},"u10uFRh5UNxzHQ-RSQzcqA":{"text":"As a late-night dinner/snack, we walked to La Bayou.  This is a cute little place among ev","useful":3,"cool":3},"ZelLrC4T6pNnesnJBjjl8g":{"text":"Had dinner here on our last day in New Orleans and it was just perfect! Our server Mitchel","useful":0,"cool":0},"_SNXdNa3vaSwp1KaMJuFqA":{"text":"Started off with fried alligator, cooked perfectly...yum!  \n\nDinner was shrimp and grits w","useful":0,"cool":2},"TdUxh7RNTshglk5HRGXrcg":{"text":"Hidden gem in NOLA loved the food so fresh and very reasonable priced.\nWe were served by T","useful":0,"cool":0},"D5knFMrECMnWGeCcxRI5Xw":{"text":"Took a moment to get seated, once seated took 10 min to get drinks then we waited bout 20 ","useful":2,"cool":0},"BjukXgYs-6lnvGJ5IwGwJg":{"text":"In town for one night for business and wanted some Southern Food. Waked down Bourbon Stree","useful":0,"cool":0},"BXb4JNPAOG5qXrGBoG2MkA":{"text":"This place surprised me. We were just walking around French Quarter trying to find a spot ","useful":0,"cool":0},"kvMbXmuXOGBf5triBdcUdw":{"text":"Well, it's what you might expect for a restaurant on Bourbon street - a little nasty and l","useful":0,"cool":0},"2QV10bPQs6kC-h6WISDUMw":{"text":"We had high hopes based on the reviews and pictures we saw and I definitely lived up to ou","useful":0,"cool":0},"gTD3UmusUGBModny-nOoTg":{"text":"This place was soooo good, came to New Orleans for business and this place was one of my f","useful":0,"cool":0},"hYxFTNSsY_CphXTJxkUCZA":{"text":"I was lucky enough to enjoy drinks and appetizers at LA Bayou when I was visiting New Orle","useful":0,"cool":0},"iaP3eGTKT-DwYH-5GAj_tw":{"text":"Average. The BBQ shrimp appetizer was tasty but small (not sure if that's because we used ","useful":0,"cool":0},"fQDJk8lO4jNGAKIdPyteEg":{"text":"PO boys are AMAZING! We had a great waiter...we ate at the bar. Most likely will return.","useful":1,"cool":0},"0PCOvcWpbQhPUyV7WhZ5Lw":{"text":"I love this place! I've lived here for several years and I always recommend this place for","useful":0,"cool":0},"oxuvOhX0IgDHELbsDJNGWw":{"text":"The fried alligator was awesome!! Shrimp ya ya , gumbo, French onion soup, crab claws were","useful":0,"cool":0},"7nGoFWQjshL7aJbiOeuUsg":{"text":"Wow! You can't go wrong with any of the oysters on the menu. My favorites were the ones ro","useful":0,"cool":0},"LJJ348WEgd9tBYde8JAwzQ":{"text":"Oysters and alligator appetizer were amazing but the Jambalaya Pasta fell short from descr","useful":0,"cool":0},"wcXy624N0pePoRPUHx4IAA":{"text":"This place is amazing!!! teddy at the oyster bar is the best shucker in town!!! He has the","useful":4,"cool":0},"FU3NsZdDLA1FElt1A3tc2A":{"text":"OMG, the shrimp and grits was the best ever. Gabby, our server was so informative. Ask for","useful":0,"cool":0},"FmUgh58CdUYsQL7s4RLflA":{"text":"Great food, ask for Steve he was our excellent waiter the other night so of course we had ","useful":0,"cool":0},"anoVmmC1OZbn-FCr5JqJLQ":{"text":"Corn and lobster chowder was excellent!\n\nGreat fish and Oysters!!\n\nVery nice service.","useful":0,"cool":0},"JJ5yXL2gAT002j15oVz6Yg":{"text":"Delicious fresh food and great service. We had just flown and checked in had hit the town ","useful":0,"cool":0},"6kKbwvIu32YueQoblubZmA":{"text":"I can't give this a fair rating because I'm a vegetarian and New Orleans is NOT friendly t","useful":1,"cool":0},"02q_LZr9fFA-kmNas5rPOQ":{"text":"I go to Le Bayou every time I visit NOLA. I LOVE THE SHRIMP NAPOLEON! The shrimp Yaya was ","useful":0,"cool":0},"ZsRNYANWN-kOrYbO_Y-zdQ":{"text":"Walked in on a whim on a Sunday Saints Gameday and was shocked at how wonderful everything","useful":0,"cool":0},"fJYGek38Y9p2X36Yl-yHeQ":{"text":"It took 10min for our waiter to even approach our table after he finally got there he took","useful":1,"cool":0},"ZnhwydDP1ATNW9AS2eZOfQ":{"text":"Got the jamalaya, gumbo, and an étouffée. Pretty great creole (and I was born in Baton Rou","useful":0,"cool":0},"XTxx_7lGESVDJWFXKesYZA":{"text":"Nice quick service. Baudin balls and crawfish cakes were great!  Po Boys and frys were nic","useful":1,"cool":0},"FBtoiFBihmzzHFFXu5P5rA":{"text":"We loved Le Bayou, Jason our server was exceptional with a great smile and service.  The f","useful":0,"cool":0},"qMSLaxeVWeXk0XwnXFJtIw":{"text":"Yummy down south N.O food right on Bourbon Street. Friendly southern style service. Nice o","useful":0,"cool":0},"zCuDrfnrQSjvbqT95xjn5g":{"text":"Walking down Bourbon St. and being hungry wasn't fun. The lines were out the door and down","useful":0,"cool":0},"-LN6JZvVGdaNU7OrP_R9fA":{"text":"Friendly service, great food. The red beans & rice & sausage was amazing, as was everythin","useful":0,"cool":0},"-Ew9_urBP_IZZfRkLcUfUQ":{"text":"Not a big fan of this place. Having tried 2 other Jambalaya pasta dishes this one was my l","useful":0,"cool":0},"Vm30uZM7UXA3AZtN2oi1AA":{"text":"Delicious food and great service! Loved our waiter Aaron! We were able to sit outside whic","useful":1,"cool":0},"Pe9pvN-QeCyIHB_r7nhdNw":{"text":"Comfortable restaurant in the middle of  busy Bourbon street, great service and was a  ple","useful":0,"cool":0},"NqjOO8m2NhjZPnAgNwaOpQ":{"text":"Great place to go anytime but we were glad they stayed open late. Must order their char gr","useful":0,"cool":0},"_wx3Aa5tFqtmGyZ1_fDhSw":{"text":"I really liked this place. It has a nice location on Bourbon with big windows that they ha","useful":0,"cool":0},"vR2oMOm_xyHVXM3aMOhiqA":{"text":"This is our first time in New Orleans and our first stop since getting here and Kenny made","useful":0,"cool":0},"VzsQEdPjFCVVVMYuzqsXww":{"text":"Try the crawfish étouffée soup and catfish. So Amazing. Love cliff at the oyster bar. Amaz","useful":1,"cool":0},"qel7zm6njAnPnPvUWGExJg":{"text":"Not bad, but not great either.  Some things were better than in other restaurants,  but ja","useful":0,"cool":0},"GMuSXfEvP609mOqxqhk2dQ":{"text":"Came here for dinner one night when we got out late.  It's a small place with doors openin","useful":0,"cool":0},"roO-Ffb1NXYekrgLmpNkwg":{"text":"Great fried alligator, fried oysters, and jambalya. Highly recommend! The service was incr","useful":0,"cool":0},"G9uvEz_yaJTSV5dOAjExMw":{"text":"This place was awesome! Had the stuffed fish, and fried fish OMG so good, if your around t","useful":0,"cool":0},"vDRCw2n1EwTAmdmofTFyzA":{"text":"The food was good...not great. The service could use some improvement...I think we saw our","useful":0,"cool":0},"MXXW0HldlK9YYQoIGoo5Uw":{"text":"Great food! We had the Alligator Bites, Shrimp PO Boy & Blackened chicken sandwich. All am","useful":0,"cool":0},"-jKRsiQRI9_ruRzM7RKzmQ":{"text":"Fantastic creole- expansive menu with something for everyone- we stayed at Ritz and JW and","useful":0,"cool":1},"k4sqatUy04wNSkuVMtRsbA":{"text":"One of the best places we ate at in nola. Definitely the best service  no need to wait in ","useful":0,"cool":0},"UP7nr4UO0gqWxKr5eGrplQ":{"text":"Awesome food, amazing service!  Aaron our server was charming and had some great suggestio","useful":2,"cool":0},"4AZ85qJ3JBFMsQIUWeM3bg":{"text":"We went tonight on a recommendation for blackened redfish was delicious my husband had the","useful":1,"cool":0},"vSpE4e6b9GXCzBmdo9EM1A":{"text":"After getting off of work Friday night, I went to meet my family who was in town for the n","useful":3,"cool":1},"-juHGO4tdL857GvztBuqnA":{"text":"Great Service by Charlie! Oysters (mignonette and Cajun Bloody Mary) we're both fantastic ","useful":0,"cool":0},"JbvK5Hucg5b2UiwMLVQHLQ":{"text":"This place is awesome.  crawfish cakes were absolutely delicious.  Shrimp ya ya and the or","useful":0,"cool":0},"XFo0-8QIgenSimzkti48Kg":{"text":"I'm not sure why this place isn't rated at least 4.5 because it was some of the best food ","useful":1,"cool":0},"vhObMd4TTPplkg5DoYhPnQ":{"text":"One of the worst dining experiences I've had. Other than the fried gator and the shrimp an","useful":0,"cool":0},"d19QGs2Dq-pYzxduiCwFZw":{"text":"Everything was DELICIOUS!!! Locals get 15% off! Service was top notch! The ya-ya oysters &","useful":0,"cool":0},"bPIzFipW3pN2ebPyNY8xzg":{"text":"Le Bayou is a perfect place to experience New Orleans at it's prime. The waiters are frien","useful":0,"cool":0},"73Q3zXGEKWxy6iXEst2FaA":{"text":"Wonderful experience.  Butch and Erin were are wait staff and they made the experience so ","useful":1,"cool":0},"5daXaMhTSw7TF-6X5g_wBA":{"text":"Stopped in because everywhere else had a line.  Had the fried oysters.  All I can say is, ","useful":0,"cool":0},"iS520_ODxTRVgh0PfpSJBQ":{"text":"The food here is really good but I would go back for the location!!!  Sit outside on the b","useful":1,"cool":1},"okBDRFWhp-3TkPx6ydZDWg":{"text":"Service is great as is the atmosphere. Had cup of corn crab bisque.  Portion was very smal","useful":0,"cool":0},"Wh0oNa87q15BtVfP7bXgEg":{"text":"Long waits at some of the other spots. Walked up to the Oyster Bar, and Teddy took care of","useful":0,"cool":0},"KboUiLj2Iq9EZpoOZpOAzA":{"text":"This is probably one of my fave restaurants in New Orleans when I visited. All of the othe","useful":0,"cool":0},"RTtSeFo4N8_gsPU3GdzCQg":{"text":"Service was great, food was even better! My friends and I ordered a variety of seafood and","useful":4,"cool":2},"1G6DrTMhCHV5pN4jzzv3Lg":{"text":"I ordered the Shrimp and Grits Napoleon. It had way too much sauce and not nearly enough g","useful":0,"cool":0},"ORKLyFOUd6PwrwAT_MtXdg":{"text":"The alligator is really good!! Better than chicken!! Had the taste of the bayou that comes","useful":0,"cool":0},"ZRR-l5zFkMNIngasl7hGtQ":{"text":"SO DELICIOUS!!!!\n\nGet the Casso shrimp dish!!!  I tried four different dishes, all delicio","useful":1,"cool":0},"a_v7-qMSWkGQu2VLhKqEzg":{"text":"Nope!!  Took over 20 minutes to get oysters with half melted ice.  Gross.  No thanks!!  An","useful":0,"cool":0},"bsA4wn0vNsW-KhO-I9Bsow":{"text":"We were walking around Bourbon St at night looking for a place to try a new drink and a go","useful":0,"cool":0},"PFqghZ2cL00mOPJtf04G0w":{"text":"Great food. Friendly service. Go eat the balcony for Free Bourbon street entertainment!!!","useful":0,"cool":0},"3pScGBu6H9Ur2kNOj55oJg":{"text":"Mitchell is the man. He recommended the shrimp and grits & the stuffed Cajun fish. My wife","useful":0,"cool":0},"peEWZ8Z7xA_GrlNl4EOEKg":{"text":"Service was extremely slow for a Sunday, but we had a party of 13. Don't order the Grey Go","useful":0,"cool":0},"oN89FuRc41D09Dng6cdn6g":{"text":"Pretty decent. Found other places to be much better. Wouldn't put on my list of places to ","useful":0,"cool":0},"1TVT9fzGUZqfyBvv4C-cNA":{"text":"I know most places you go on Bourbon St. in the French Quarter (huge all night party stree","useful":1,"cool":1},"wC1T1AJsTCnbAG5SFqKCdg":{"text":"(More like a 2.5 but I've only been to Le Bayou once so I'll be nice) Very average and def","useful":0,"cool":0},"2gAX4bzVY0giobiAn3Jirg":{"text":"My wife and I have eaten here the last couple of times we've been in New Orleans and it's ","useful":1,"cool":0},"BMuieutWNyBgMz--mzvPWA":{"text":"This place was a bit touristy for me but it came recommended so we checked it out while in","useful":0,"cool":0},"v8q9kjthAMl7i86k73Wieg":{"text":"Visited New Orleans for French Quarter Festival. We ate at plenty restaurants during our s","useful":1,"cool":0},"TGcIrQnqB8jlkPHKm30Cuw":{"text":"etoufee was terrible.. I tried to like it but couldn't go beyond 3 bites. Other food is ju","useful":0,"cool":0},"J-2PTzLqNrWOB3S9QxcjqQ":{"text":"After enjoying the fried oysters on my po boy, I picked up the bun to find a chewed wad of","useful":0,"cool":0},"tYNyEx3Y4XdZi_AbFisffg":{"text":"We were looking for some good oysters.  Originally we were going to Acme's but the line wa","useful":0,"cool":0},"ELx7Ujoq457nM6kpjSbPSA":{"text":"Okay -- Week of Thanksgiving and had plenty to eat all week, so stopped at this place not ","useful":3,"cool":0},"u2GpfD_pKfYQdd2dsQDzuA":{"text":"We decided to give this place a shot after reading through the reviews. Unfortunately, yel","useful":2,"cool":0},"LolFugO0rhrQS_24Lg36Sw":{"text":"OMG, fried green tomatoes, grits, and shrimp, was amazing!! Kelly was the best waitress! G","useful":0,"cool":1},"TQw7Z0BTbySHY2QB9Fsyqw":{"text":"To be honest I just came here on a whim because I was looking for a slice of cake on my bi","useful":0,"cool":0},"e3h2YSLvguWyV-90veHP3Q":{"text":"Ryan is our favorite bartender two nights in a row! ! Fabulous BBQ shrimp best in town!!","useful":1,"cool":0},"glQZmBBxUquYF2N38zO4aw":{"text":"Came here during Superbowl weekend and the line wasn't too bad, but saw some people leavin","useful":0,"cool":0},"ZGN868AfT1UVCXt_mj-WFg":{"text":"Killer shrimp and grits!  The waitress was very helpful, the shrimp and grits Napoleon was","useful":0,"cool":0},"lPkm-ZVRAbH2xHTaKtj0qw":{"text":"Definitely not your typical tourist eatery. The food here is excellent, as is the service.","useful":0,"cool":1},"4ljwVKaWB2xgpjeRwCPL3w":{"text":"The Bayou Oysters were really good. I also tried the spinach dip and Trio with Gumbo, Jamb","useful":0,"cool":0},"-y0FYObKrlnCQsyezW-AhQ":{"text":"Came here on a whim when we were sick of waiting for acme. Oysters are great, so are all t","useful":2,"cool":0},"kZUaH3uT6mZdxjBarVrcgQ":{"text":"Food was great. I had the Taste of the Bayou and tried all four. The red beans were my fav","useful":0,"cool":0},"2dX9iJnG9Mj5rQ2-x6FebQ":{"text":"I don't even know where to start. We were referred by the Hop On Hop off bus tour guide wh","useful":2,"cool":2},"lfpt-v8BuZ87yIX5Wd-Fuw":{"text":"We were walking to another restaurant when we were asked if we wanted to eat here...we had","useful":1,"cool":0},"Tikl7e3Z38RPflfE3QOf_g":{"text":"Real friendly staff and great cocktails.  Crawfish etouffee was  served warmed, not hot ho","useful":0,"cool":0},"m91hGLjQJPE09H6PE1ZvZA":{"text":"I think it's fair to say this is my favorite restaurant in New Orleans. During my three da","useful":0,"cool":0},"XY0jomPRT4Pla058n8arfg":{"text":"My wife got the vege past and she gives that 5 full stars. I got the red beans and rice. I","useful":0,"cool":0},"AtjwdTWsSBOcb8ezNvBwCw":{"text":"During our stay in Nola we went to this gem twice. The first night we came we were the onl","useful":3,"cool":3},"pVTJI3U0VXNgM408OrI2NQ":{"text":"Went to this restaurant during Mardi Gras for Mardi Gras last week and the food I ordered ","useful":0,"cool":0},"d_qW7TcXhDMgntK1-wsXNA":{"text":"The food was great and service was exceptional. The desert options were top notch. Can't w","useful":0,"cool":1},"9lN2oQuNH6ZqRMhXCvVNZA":{"text":"Okay so skip the Boudin Balls (dry and flavorless) but the barbecued oysters are absolutel","useful":0,"cool":0},"U9RiVT6vc8AFdyMADUvQAA":{"text":"It's loud.  A little impersonal. It's right smack on Bourbon St.\n\nI would not seek to go o","useful":0,"cool":0},"IWhvgGVqhyYIb4oX-TvyjQ":{"text":"While visiting New Orleans, we walked Bourbon Street the first evening there, looking for ","useful":0,"cool":0},"kxyKdTqSPBAfqeA-Gdkptg":{"text":"Went back here 3 times during our 7 day vacation - need I say more?  Highlights included t","useful":0,"cool":0},"eBnALacECNwUMPIng3Nx3w":{"text":"Fun atmosphere. Our waiter Mitchell was super fun and knowledgeable.  Crawfish etoufee was","useful":0,"cool":0},"Z3ipBems659u97IB5nOGTg":{"text":"Stopped by here before going to the airport after a solid Mardi Gras week. When we came in","useful":0,"cool":0},"4gAoI0cPUxj4UttkhnGgbA":{"text":"We wandered into this place after being told at Remeloude  that the kitchen was backed up ","useful":0,"cool":0},"IJRYXB_aPUrmN84nwB_rIw":{"text":"We ate here twice on our trip and both times it was very good. Each dish came out great. T","useful":0,"cool":0},"O6WQd_MZyocyRtp5eMmzqA":{"text":"I had never had raw oysters before...I figured \"when in Rome\" may as well risk it. I was l","useful":0,"cool":1},"bWLw6k7ONNzfmnuV5C2yyQ":{"text":"Good gumbo. Just as good as Gumbo Shop. Great spicy garlic wings and filet philly. Ask for","useful":0,"cool":0},"JmCmmefC1Ee6t0v8bHvQAw":{"text":"Yes it's on Bourbon and yes it's touristy but for the price and the quality it was one of ","useful":0,"cool":0},"QCod9DdL9-OF4VZau8XkiA":{"text":"Absolutely off the chain delicious. Taste of the Bayou was phenomenal and is highly recomm","useful":1,"cool":0},"KKj5mVRC7NmOSLxRJChWKA":{"text":"We had a craving for oysters and stopped by this place because it had an oyster bar.  The ","useful":1,"cool":0},"MC_hwoyBGLxGg4OdmuTrlw":{"text":"This place is on Bourbon St. inside the closed off street section. I wandered in here abou","useful":0,"cool":0},"6BDTl2Q-0fVksd4gfxsKMQ":{"text":"My annual trip here and never disappointed ! Great service by Cherie! Had the \"Taste of th","useful":1,"cool":0},"Elxb9cW5Wla1Hs8um83bbg":{"text":"I was a little disappointed in this restaurant. We came in here wanting crawfish. We were ","useful":1,"cool":1},"SoUkrpN2qnHlg8teKMsY7g":{"text":"Shrimp Ya Ya some of the best stuff, I would go back to New Orleans just to eat this. It's","useful":0,"cool":0},"89a6DMF-cCJLeRXrY1vWBg":{"text":"HORRIBLE service and OK food. Stuffed Red Fish was good but the service made the meal tast","useful":0,"cool":0},"wB3cw_E2GAQZcN7JRzQKGQ":{"text":"Place was awesome and our waiter was fabulous. We ended up talking for multiple minutes ev","useful":0,"cool":0},"KOA5ZJIOaMg90LbeubyP2A":{"text":"The food was just okay at best, however the waiter was fantastic.  Turned it into a full e","useful":0,"cool":0},"f0qSvMuIO0zkhBaAbygDog":{"text":"Friendly, generous portions, better than average food... the biggest Effing po boy I've ev","useful":1,"cool":0},"aoKaiKTblSEf7VsirDIIvg":{"text":"Great food. I'm the pickiest eater ever and I thought it was amazing. Aaron, our waiter, w","useful":2,"cool":1},"zGpn8DBmwS_nYVXuOtNXOQ":{"text":"If you're in the area, try this spot! Everyone is very welcoming and accommodating... Make","useful":0,"cool":1},"Y7QY8GcX_Xs65NyG8EXkyA":{"text":"Really some amazing southern food, without the heaviness of it all. Went here for a late l","useful":0,"cool":0},"6tKrdssqhNlPSmsC3N5cPw":{"text":"First time in New Orleans so an oyster restaurant was a must. The famous Acme was closed f","useful":0,"cool":0},"0JfaKj5Q-ClKU8RbI4istA":{"text":"Just know that the red beans and the pasta dishes will leave you weak in the knees.  And L","useful":0,"cool":0},"_V7-bOP15nSw7qzeWptPMw":{"text":"I have eaten here on a few different occasions when visiting NOLA. That's saying a whole l","useful":0,"cool":0},"oT4XGPhXuVVmOh1YsmB55g":{"text":"Service and food was pitiful. The icing on the cake was the cockroach scurrying about bene","useful":0,"cool":0},"Sak-v03-BaY2Ph8ATrTK-g":{"text":"I just had the fried green tomatoes, and they were fantastic. Actually the best I've had. ","useful":0,"cool":0},"6MF7JLuightOJMS3i0EWLg":{"text":"Jabari made our experience both  memorable and fun! \nHe introduced himself, greeted us war","useful":1,"cool":2},"zstFGdykIT7CfYTYyRcwxw":{"text":"We stopped in to escape all the craziness on Bourbon Street following the end of the Essen","useful":0,"cool":0},"oBF_v0u_yGyLG1_pXa4Bdg":{"text":"Okay after walking around with frustration in the French Quarter, we realized we are very ","useful":0,"cool":0},"ANHfYxl8Z_1-IYsT7R-MZQ":{"text":"I would honestly give this restaurant a 3.5, but yay... i am a fan. I ate there twice. Rob","useful":0,"cool":0},"UGJIuEu3T6b7ka_QJKQJKA":{"text":"Was at Mardi Gras and found this gem on Bourbon St.......awesome hurricanes in a great Tik","useful":1,"cool":0},"RPfrtdomR06tSM8QiFFk8g":{"text":"I tasted the Shrimp Po Boy and Bloody Mary my husband ordered, both were fantastic. I can'","useful":0,"cool":0},"0efqfaFVQyLZaA-0tF9ycw":{"text":"Great location and terrific oysters.  And no wait like some of the other places nearby.   ","useful":7,"cool":1},"BTQFzQUpO8VUfdg_nYsmwg":{"text":"My sister and I stumbled upon this place for lunch on a Sunday. The Cajun food is pretty g","useful":1,"cool":0},"NOZWajeU7hRAfdQd3TA-zg":{"text":"While on a road trip passing thru our group found this place open late on a weekday. Loved","useful":0,"cool":0},"555dK6cNWgK7nbH-_UZftQ":{"text":"Great ambience, succulent oysters and a deliciously fresh corn & crab bisque. \n\nNo lines, ","useful":0,"cool":0},"xN5BfyrsqowNRCU8GwY3lg":{"text":"We went on a Friday about 9pm. No wait at all, we were seated immediately. The restaurant ","useful":0,"cool":0},"Hv_8TXD_ixuD2V2qa1VRNw":{"text":"The food was great. Kelly definitely made a great recommendation of the crawfish po boy. I","useful":0,"cool":1},"y2gmEmtfTcELX2kj4r4MHg":{"text":"Conveniently located on Bourbon St., Le Bayou offers a wide variety of Cajun dishes and se","useful":1,"cool":0},"Yhw6UoGUWdhVU-buWhppNw":{"text":"The service was horrible and extraordinarily slow! The food was horrible and extremely ove","useful":1,"cool":0},"OsNxsiI8PCzoJCwmlK7-BA":{"text":"Great restaurant! Thoroughly enjoyed our waiter Mitch - his recommendations were spot on! ","useful":0,"cool":0},"0nlFfy621WsCpBL1tc_UGg":{"text":"Sampler was great!\n\n\nThey serve oysters with a nice size and reasonable price compared to ","useful":0,"cool":0},"8aEBvfNX0mSjta68TrIx0Q":{"text":"This place is amazing!!! Open at 2am for an after flight meal, and it was incredible! Fres","useful":1,"cool":1},"gGPk2KPZaVwzH46vnRllDA":{"text":"Bad experience. Went for dessert (Brennan's closed at 10). We were working on our cheeseca","useful":0,"cool":0},"IWg4FetJWGxotLoiKnvXaQ":{"text":"Food was better than I expected for Bourbon Street. We were seated quickly on a busy night","useful":0,"cool":1},"tFz2nWhJQ2iHz0gUoHx0PA":{"text":"oysters are nice! we went there because they hv balcony for seating. oysters are nice and ","useful":0,"cool":0},"-Va9cJpjO0fGI-tLJUoCPQ":{"text":"Just dropped in. Mitchell was great at in leading us thru a N'Awlins menu. Great dinner. E","useful":1,"cool":0},"IDXT-CqvUHKN2EgFy7TVWA":{"text":"Food was awesome and Aaron took great care of us. Alligator po' boy (w king sauce), crawfi","useful":1,"cool":0},"zJgzNCx04wDjICUwf7PFWw":{"text":"Late one evening while walking down Bourbon Street,  my friend wanted to go in to Le Bayou","useful":0,"cool":0},"pNg3jC7L1lwz_DuP_L67vw":{"text":"Amazing  food and amazing staff!  \nMy girl friend and I went there and both had a deliciou","useful":0,"cool":0},"669RQc3_0vs_UUHymYHo1A":{"text":"Had a wonderful experience at Le Bayou.  Food was wonderful.  Had all apps, and found two ","useful":0,"cool":0},"0DHrjFaid5b5EjOPN9GwbQ":{"text":"Boudin balls are delicious and suspiciously spicy. Rice,chicken,pork,pepper and  onion fri","useful":1,"cool":0},"Sg_xTbtOreU97bACWDxwHw":{"text":"Don't  know why this place is not crowed \nGreat food & waiter atmosphere balcony seating l","useful":1,"cool":0},"w-cpvAr7Am6NIYMyUyMVWQ":{"text":"had lunch here after a very long, hot tour of St Louis Cemetery.  The service was good, al","useful":0,"cool":0},"ZEhbBVuLnuSYO6W0P-wdjw":{"text":"For one of the few oyster joints that was open passed 10 PM, it was more than I could have","useful":0,"cool":0},"VLYKtO3s6c3fBiwsEiBBbQ":{"text":"I enjoyed everything about my experience at Le Bayou. On one of the busiest nights of Mard","useful":3,"cool":1},"Td7RVmZmX_5yhbCvqdP4CA":{"text":"We stayed here in NOLA for 3 nights and came here every night. The first 2 nights, we sat ","useful":0,"cool":0},"mrXRc4otRIbiCPN4WVxyKA":{"text":"Their Bayou baked oysters were AMAZING! The Ya-ya chargrilled (pesto) oysters were great a","useful":0,"cool":0},"hQUKm9gA4TKKa2VywNKngQ":{"text":"Good quality southern food.  Great service!","useful":0,"cool":0},"6Mj8p99s3IjbMg4YVAkikg":{"text":"Walking down Bourbon St. on a Friday night, you never know what might happen. I really wan","useful":0,"cool":0},"vfu11bSQXm8YP5ocGUGsqQ":{"text":"One of my last meals in New Orleans, originally I wanted to go to the ACME Oyster House. A","useful":4,"cool":0},"V46nyutixQvfGE1RXR8kug":{"text":"Love the oyster dishes at Le Bayou and the pecan beer is so tasty.  Worth a stop for a doz","useful":1,"cool":1},"4--wFEovF6962TERZ8ts6Q":{"text":"My husband and I stopped here because I had found out about their fried cheesecake after s","useful":0,"cool":1},"cUG7iJ7jpbaGBm_AQGkl9g":{"text":"Kelly is a fantastic server!!!  The food was AMAZING.  Ask for a seat on the balcony and w","useful":0,"cool":1},"6Sjw4L6FygAUEQJ2IjxBYg":{"text":"Quite loud and touristy but very good for it. We waited a short time for our walk-in group","useful":2,"cool":0},"x4FCqHul1wePmbGn1SDvaQ":{"text":"I'm giving it 2 stars because the balcony seating was pretty cool.\n\nThe food was pretty aw","useful":2,"cool":0},"dTcuRtYd6kXc7uXpsaIseQ":{"text":"Came here on our last night in New Orleans when there was a 30+ person line at the Acme Oy","useful":0,"cool":0},"NYHyPyTsZ3pQjm0nZcrWXQ":{"text":"Oysters were really small and so were the drinks. High prices and only mediocre. I'd go up","useful":0,"cool":0},"jdnKpRaOy95Dg_DA6hQF8g":{"text":"Great atmosphere and amazing food, but the best part was the service we received from Kell","useful":0,"cool":1},"onhHyVLwgUZ3jKRFfqH9zw":{"text":"Directly on Bourbon St., in the heart of the action. We came here with 8 STARVING GIRLS! W","useful":3,"cool":0},"yoY4NTAtnM1m7AIkbvBb3w":{"text":"I'm genuinely shocked that this place has an overall rating of 4 stars. Please allow me to","useful":2,"cool":0},"1oK-xHy4BPNKPQqznhfOkw":{"text":"The only reason why I came to this restaurant was because I was starving and tired of walk","useful":0,"cool":1},"3V3cWIOWaNLgjjyZDd1imQ":{"text":"After a search for oysters, I'm glad we ended up at Le Bayou on Bourbon Street. We were dr","useful":0,"cool":0},"fcHHMkyNDNXWJz8Kpsk2NA":{"text":"We lucked out in getting a table on the balcony here on New Year's Day. Although the servi","useful":0,"cool":0},"7Wv2G4MQWXny3dQ-_KHMtg":{"text":"Average food.  Price is high anywhere else, but about par for eating on Bourbon St.  Don't","useful":0,"cool":0},"-Wqrp4R7VTTebBijNcepRQ":{"text":"The best!! Stephen our server was so amazing!! Tommy the bartender is so cool!! \nTheir shr","useful":0,"cool":0},"na-xPz_t8xZZd6nsSk-u7g":{"text":"I used to crave this place....this trip, though, we couldn't sit at the oyster bar (that's","useful":3,"cool":1},"PGUp8atQajn-lXy43ZRbRg":{"text":"The shrimp and grits were delicious. We also got the free appetizer thanks to yelp...allig","useful":0,"cool":0},"X9uwOpZRpftrr11ZkDe5Xw":{"text":"This is a great place to get a bite to eat. I tried the gumbo my boyfriend had the he bisq","useful":1,"cool":1},"si4Y2Hs63Pl1c0MUMbRhJA":{"text":"Since Mother's was closed on Mother's Day (what?) we wandered around looking for a place w","useful":0,"cool":0},"pj8cgBkZQ2AwJHpnYIekNw":{"text":"Ok restaurant and ok food, but nothing special. We were seated upstairs on the balcony whi","useful":0,"cool":0},"wVJR6WfDsCXBPH6LpyhrNg":{"text":"This is the first oyster house we tried in New Orleans. It's really good. Highly recommend","useful":0,"cool":0},"nuawgBsPQpcBOYCEy_ybEQ":{"text":"Great spot, we ate on the patio/deck balcony and enjoyed the people watching on Bourbon St","useful":1,"cool":0},"4TSXu-2ch5ux0wn24TEJSQ":{"text":"Had dinner at this place Christmas Eve and our server Doc was awesome and made great recom","useful":0,"cool":0},"x8jDjE0yj9x5IRF_jhtj8g":{"text":"These guys KILLED IT. Shout out to the manager, Josh, who got my frustrated phone call fro","useful":2,"cool":1},"GAt1ZHZ2Lh2dMvMGP6idEA":{"text":"Ribeye was disgusting! Avoid this place and it's terrible drinks and service at all cost.","useful":0,"cool":0},"Bn5pYXpJXdx0aJ1w5ZLrNQ":{"text":"This is like a tale of two restaurants. I ate here about 3 weeks ago and it was horrible. ","useful":1,"cool":1},"2eA2e8EC4DXgZaY8Cven5w":{"text":"My husband and I ate here on our first time in New Orleans, upon recommendation from a loc","useful":0,"cool":0},"EEwlyPPG4BwnTODZbXJozA":{"text":"After searching for a restaurant last night that served a regular 'ol crawfish boil, we se","useful":0,"cool":0},"BlbZOqdyPcBXaPB-yEHAyg":{"text":"We were wanting raw oysters and were heading to Acme Oyster House. The line was so long, w","useful":0,"cool":0},"1g433qOBvh82tibuM_4Wbw":{"text":"Staff was very push, trying to sell alcohol when we asked for water. So boys we passable. ","useful":0,"cool":0},"Ax7aolqPp2T1t2PE9EZADA":{"text":"Yes it is on Bourbon St and yes it is indeed a tourist trap that we spent waaaay too much ","useful":0,"cool":0},"3SZIVpYwHitZCUNc3nwByQ":{"text":"Got the bayou burger. Pretty good. My server, Kelly was super attentive and knowledgable a","useful":0,"cool":1},"jN5aiLu62vBkYgoG05jctA":{"text":"The best oysters and the service was amazing! Teddy was great, sit at the oyster bar. Stop","useful":0,"cool":0},"QWt6NyyfmQvDhQlN1qsS-A":{"text":"We woukd have loved to write about the food hiwecer we never got to try it.  After being s","useful":0,"cool":0},"s1p6m_ZJNgf9eus7EvOfLQ":{"text":"Don't waste your time or money.  We ate here because our hotel recommended it and offered ","useful":0,"cool":0},"JqLjXm2k-GPy_8jjkFnqhQ":{"text":"This was a nice find for Burbon St. I expected less and got a little more. We sat a the oy","useful":4,"cool":2},"VMm8t6nnbNv-p9jToFYXcA":{"text":"Decent food, amazing location and top notch service. Went on St. Paddy's Day (crazy night)","useful":1,"cool":0},"Z2YhoIyjywJhwDf_HcLh3w":{"text":"This place is slightly different than your typical restaurant on Bourbon St.  First off, t","useful":0,"cool":0},"-Dis8BdEHma8PNmYgTKgIg":{"text":"Poor service with an attitude!  There are way too many places to get oysters to wait 30 mi","useful":0,"cool":0},"93piXcPE3ZUBwSoE0Th64Q":{"text":"We stopped by to get a quick bite while on Bourbon Street. My boyfriend's burger was cooke","useful":0,"cool":0},"vbOQTAvahViB7Z4GjTPThQ":{"text":"It's 10pm- do you know where the oysters are? After walking up and down Bourbon Street, Ju","useful":2,"cool":1},"QfE2up1yjS6vNPmXJiZuxQ":{"text":"Haven't tried this restaurant, yet, but my friends and I are looking forward to it! I can'","useful":0,"cool":0},"BIL0yAdoHZkL3JxdtZrMJw":{"text":"Not bad, but not great. We sat on a balcony overlooking Bourbon st.\n\nThe food is largely f","useful":0,"cool":0},"v3EeJTWtj_JTs0ypdNI-FQ":{"text":"bad taste with high price，wait for long time to get the order, even the for the oysters.","useful":0,"cool":0},"Ojqs_dAb49oEwWP6O1mwbg":{"text":"Our group of friends stayed in NOLA for a few days and came here for dinner on our last ni","useful":0,"cool":0},"S4Me59S2nSqJo2SlPQooHw":{"text":"Horrible experience, the waiter accidentally added a cup of fried shrimp to my order, I th","useful":1,"cool":0},"eST3hefEhSpJfxzyQYB1PA":{"text":"Mitchell was a great server there. Full energy and attentive. The food was great for a qui","useful":0,"cool":0},"0m-CLJ4SESj527osGlqYkg":{"text":"We decided to stop in because my husband wanted red beans and rice and he saw it on their ","useful":0,"cool":0},"wML2EWSgJcOvDbEUs92THg":{"text":"The best dinner I have had in French Corner. Service was great, I recommend the Shrimp and","useful":0,"cool":0},"vPk4QwQXR34vj17OwJRvKw":{"text":"Service here was fantastic. Beers were close to dangerous... almost as potent as a hurrica","useful":1,"cool":0},"XzZXnqehX8AjB8syGc8UVw":{"text":"Le bayou restaurant is conveniently located on bourbon street. My sister and I were lookin","useful":0,"cool":0},"t3kL3HaLEj_vlWmkoJSMXA":{"text":"The food here was amazing! I got the bayou tasting platter which came with crawfish étouff","useful":0,"cool":0},"dqLusX2JgvWLzaMvlhjJsw":{"text":"I typically would like to avoid tourist trap places, but given the fact that my friend and","useful":0,"cool":0},"velnyDTGgsWKoFf5TN_5aA":{"text":"Came here because we wanted to have some fried alligator.  We ordered some beer (Abita and","useful":2,"cool":0},"H9Twd0Kfyp9atA_cdoLR8Q":{"text":"Great southern hospitality from the moment I walked in the door. I had a burger, wasn't an","useful":1,"cool":0},"Iz2CtYztklpQTD2nblG6Fg":{"text":"I'd give the food & service 3+ STARS but the seating is very cramped and the prices seem s","useful":0,"cool":0},"D6xhg7VVOP7oJecRiZLlTQ":{"text":"First  Cajun creole spot. Tried a lil bit of everything. Alligator, charbroiled oysters, a","useful":0,"cool":0},"cXqLO35MaxWBKCC79UDsDw":{"text":"Very disappointing. The staff were nice but that's about the only positive thing I can say","useful":0,"cool":0},"U890ZtXT8ze6DB_RHpCvrw":{"text":"The food was decent for a Bourbon Street restaurant. I never go in expecting Eleven Madiso","useful":0,"cool":0},"p1WHcWkcseKIx10kGMqN-Q":{"text":"I had the Blackened Chicken Club, to my surprise it was pretty good, the ingredients were ","useful":2,"cool":2},"RkpRoA4BA1m6xVZRaaBxcg":{"text":"ok this place is conveniently located on Bourbon and there wasn't a wait...\n\nbut there's a","useful":2,"cool":0},"zLOJDLiV4HximKaaf2GhKA":{"text":"I got an appetizer of fried alligator and and a shrimp po'boy. The food was amazing and wa","useful":0,"cool":0},"xWYT4oLWXOjKsgy_SVlJdQ":{"text":"If I could give more stars I would. Only because I LOVE their gumbo. I have never ever in ","useful":1,"cool":1},"LnMcdddQD21EOQb3VF-Zfw":{"text":"I ended up here by default because all of the other restaurants were closing up.  It was j","useful":0,"cool":0},"rnWMxm4CtiIrhjfg-6UxOA":{"text":"Great Food! GREAT SERVICE! Erica our server was AMAZING! The BBQ Shrimp is amazing! Their ","useful":0,"cool":1},"k1onWTOrpk3f76hcpBrBVQ":{"text":"I visited Le Bayou the evening of 8/8,, We sat outside upstairs on the balcony and it was ","useful":0,"cool":1},"X1feZZDJ_yhsDtmhKP9jKA":{"text":"Yummy yummy yummy\nShrimp Napoleon was great!  The food service are excellent.  We had raw ","useful":0,"cool":0},"cItdhdFzXMPNn_dreq7DJg":{"text":"Nice atmosphere and good food, reasonably priced.  The crayfish étouffée was exceptionally","useful":0,"cool":0},"UO4NSJU-E2Mw2MBZlvr3TQ":{"text":"ALL PASTA DISHES ARE PREPPED FRESH. The key is to stay away from the rice dishes that are ","useful":0,"cool":0},"9mV8xlxbI_MmZl5Aiaxqhg":{"text":"Visiting from California, my girlfriend and I sat down to eat lunch here and loved it. Our","useful":0,"cool":0},"DLa5N0Do0yshu9yeHNln1w":{"text":"We were attending Mardi Gras for a bachelor party with my future in-laws.  We were all pre","useful":0,"cool":0},"FYYFxa2Wsh2htOoJcLLL4Q":{"text":"Enjoyed the shrimp yaya. The shrimp and grits Napoleon was good but enjoyed the sauce more","useful":0,"cool":0},"q-DWdegNydVi013it8SkXg":{"text":"Right on Bourbon Street the doors are wide open with a guy standing right in front trying ","useful":0,"cool":1},"kW0XoSoCYuryKuJiP3rcdA":{"text":"Two words: Shrimp Ya-ya! \nDelicious spicy pesto!   \n\nWe went during dinner on a Wednesday ","useful":0,"cool":1},"PtuZAKez0ffapyoCVxQokw":{"text":"Went several times this week and enjoyed each meal. Corn and crab chowder a must. Gumbo is","useful":0,"cool":0},"Ev0pKZ8jrOrfHDq2v90DHQ":{"text":"Amazing restaurant! The service is great! Troy is The best! He recommended The yaya shrimp","useful":1,"cool":0},"1o2SAPS14cVu5jL6XrlvfQ":{"text":"COME SEE PRESTON AT THE OYSTER BAR.  He is THE best. Very attentive. Best oyster shucker I","useful":2,"cool":0},"SytatSpxrluty-zIwVJTnA":{"text":"Uhm, no. Super less than average. Boudin had no seasoning. Bread stale and hard as hell. C","useful":1,"cool":0},"Se6lYeUfGShOEdjMBDlmLQ":{"text":"Don't miss out on the Shrimp Ya-Yas! \n\nJust arrived in N.O., and stepped out of our hotel ","useful":0,"cool":0},"fxVrPf8SIz2f72SlWDnXEg":{"text":"The service was phenomenal!  Our server Aaron helped us select the Shrimp Ya Ya, the blood","useful":4,"cool":0},"-JHHzhqS3Av16Omo04myng":{"text":"It definitely feels like a tourist trap when you walk in and it is.  But I have to say tha","useful":1,"cool":1},"8BWjJ2Qdm9qvUYFa3eXMWA":{"text":"So I got in to New Orleans a little late.  By the time I got to Bourbon Street, both Felix","useful":0,"cool":0},"NXybD2sHkkpdSkMGT83qzw":{"text":"I loved it. I've been there a few times. Each experience was interesting to say the least.","useful":0,"cool":0},"uGr9D_M6RyGdwB1l7GkN9Q":{"text":"The fish platter is the bomb.  No sausces needed.  Couldn't even come close to finishing. ","useful":0,"cool":0},"I0cxseQgrCpQbs-n6lzXQQ":{"text":"We ordered the chargrilled oysters, and Ribeye  steak cooked medium and some other stuff. ","useful":0,"cool":0},"FQ7p89hl5W5_mwqwHAUTVA":{"text":"Great place to pop into for a quick meal.  This is not high end cuisine but decent portion","useful":0,"cool":0},"ZDcMXYzMxoAutDqT-P-CRg":{"text":"Well worth it. Reasonable prices for white table service. Excellent choices. Had the bayou","useful":0,"cool":1},"CC7DN_7Wk2q1InnRrQP3jg":{"text":"Host was very nice, actually the reason why we came in to eat! He sold us on the bayou oys","useful":0,"cool":0},"aEQCcddSWIQUkwabp7-F7g":{"text":"This is a little gem located on Bourbon street. We came right around closing time but we w","useful":5,"cool":2},"1kzwPnLz12RmhS23rjOFcg":{"text":"Loved the food, drinks, and atmosphere!\nDefinitely order a side of the remoulade with ever","useful":0,"cool":0},"2oS0RQlp9oN8y05-D99eTw":{"text":"The most delicious food in New Orleans without going to an upscale resteraunt. Laid back c","useful":0,"cool":0},"PMqjqF80QAgV3HVpGE6v6A":{"text":"This delightful, authentic gem is a great spot to start out your night on Bourbon Street! ","useful":1,"cool":0},"R9CXx26VcdlPCUlo0rzQdg":{"text":"The service was great and the food was even better! Kelly is a wonderful waitress with a g","useful":1,"cool":1},"GhuZrAHSGTUoUtt0oS5KSw":{"text":"It's a nice location, but there is no longer anything here for vegetarians to eat.  They u","useful":0,"cool":0},"0Xl0DwiP4tIpPJensU5fig":{"text":"A very casual place on Bourbon street offering pub style foods. The service was solid and ","useful":0,"cool":0},"4jU7pZQYrut0RUHQA-lbQg":{"text":"The charbroiled and baked oysters are freaking delicious,the pasta was just ok,the service","useful":0,"cool":0},"z4zwrd10BHFGe6HLaQo_ig":{"text":"They charbroiled pesto oysters were wonderful!  They have such a great selection, all of u","useful":2,"cool":2},"mnlYQRTP4hsPQaL3UkXpkQ":{"text":"Just happen to walk into this place as others have stated it was not as busy as some of th","useful":2,"cool":0},"f_luqLJInVdakWWaiPF9Rg":{"text":"My party of two split the osyter po-boy.  It was nothing spectacular - just fried oysters ","useful":0,"cool":0},"bNx_RwaRvSLfkam1qbmj8A":{"text":"Walked by and decided to give it a try. Was seated on the balcony which was really nice. W","useful":0,"cool":0},"zkQUfPHs5lrGArTg-mlFeA":{"text":"Fast service; great open-air seating! The Grey Goose Pear Lemonade...refreshing, light, de","useful":0,"cool":0},"pwteZJqa0seJxqCX6LXM6Q":{"text":"Didn't think a restaurant in New Orleans could mess up grilled oysters but this one did no","useful":0,"cool":0},"XF8mRrqUFHFBccrw9e1k8A":{"text":"Just got off the carnival cruise and decided we wanted some Cajun food. Saw this place and","useful":0,"cool":0},"hhMCmVBRo5ldea_wcqHQSA":{"text":"If we're speaking exclusively about the food I'd give this restaurant 5 stars. But I've su","useful":0,"cool":0},"sBErL28lp6ff51rQX911mg":{"text":"So damn good!!\n\nThat bourbon chicken was so juicy and tender. The jambalaya was excellent.","useful":1,"cool":1},"RUTVsoyIvTxUqTaAvkUJxg":{"text":"Our waiter was very friendly, but our food came out cold. We had to wait several minutes b","useful":0,"cool":0},"sxNqNxejs4eviBLjLwiH7Q":{"text":"I know this place screams \"tourist trap\" ... we went because it's close to our hotel. \n\nWe","useful":0,"cool":1},"xERs5fdMjjwkRmNyTaX91A":{"text":"This was our second attempt at grilled oysters on our one day stop in NOLA, after an epic ","useful":0,"cool":0},"jQR7Zmeki79dDYwKsR9jtQ":{"text":"Just awesome. First and foremost the waitstaff rocks. Probably some of the best service we","useful":1,"cool":0},"KHnuZLGpCey69p0R_nm7QQ":{"text":"The food was really tasty and our waiter - Mitchell - is the warmest, funniest, most helpf","useful":1,"cool":0},"6KKxwwbvrXdlONM1Bd_kHA":{"text":"Went there for lunch. We got the bayou burger, it was pretty good and a decent sized burge","useful":0,"cool":0},"8i5sQq2Ap2RXAFWrSbM7LA":{"text":"After searching Bourbon for a restaurant that served spinach dip, we found Le Bayou. We fi","useful":0,"cool":0},"Kw6kC-R5ahzBJivMcqHGfA":{"text":"Teddy and Neshaun at the oyster bar are amazing! Fastest service and very nice and persona","useful":0,"cool":0},"hLTz4Rshf3QSNqRUVFyT_A":{"text":"Kenneth is the MAN at the oyster bar. Awesome service, attitude, food and oysters! Will be","useful":1,"cool":0},"6IhohLVudg3iuUEr2KLADQ":{"text":"What a wonderful experience. Chicago girls coming in for a bday weekend and we were treate","useful":2,"cool":0},"UqnE3l8wzC_6_71goIxPIw":{"text":"My friend had recommended this place for me during my first trip to New Orleans. I wanted ","useful":3,"cool":0},"ntVLLb9IYD_yQDqvqrB-og":{"text":"The staff is great, and outgoing. But the food is terrible and way over priced. You could ","useful":0,"cool":0},"mZkGa-t8QAh_YLZ9yPJx5w":{"text":"First night in NOLA we had dinner. My wife was recommended the shrimp and grits. It was de","useful":2,"cool":1},"PPFaDAbwKLCjNvUEzEUCiQ":{"text":"All of us went to this creole cajun southern seafood.  It's one of the best, servers are v","useful":0,"cool":0},"qmmQAAzh6SaowL_9efz9uw":{"text":"We LOVED Le Bayou!  The service was excellent!  Mitchell, our waiter, was the best!  The s","useful":2,"cool":0},"ldSr4_FOoEPmufkVlJgd5A":{"text":"Shrimp Ya-Ya was awesome. The crawfish cakes were good. The cakes were a little overcooked","useful":0,"cool":0},"KCSn-4DMDpSmRZFa2Ba7XA":{"text":"Eat here!!!!! We had a large party that included a 2 year old and an 86 year old .party of","useful":0,"cool":0},"-V0l4s4O-wf5rWIul2IIeA":{"text":"Love the oysters, local beer and upper deck for people watching. A first stop every time w","useful":0,"cool":0},"FtFOzGaPLALolTktxlft3w":{"text":"Stumbled onto this place while we're were walking down bourbon st. Try their raw oysters, ","useful":0,"cool":0},"btkpzkhj1ktWTeBZuauemw":{"text":"The BF and I were on a mission to find some boiled crawfish and went to 4 different restau","useful":1,"cool":1},"glwXnzbdj-Ox-4_5CIi_Kw":{"text":"Loved the late night service when I was there for Mardi Gras. I sat at the oyster bar and ","useful":0,"cool":0},"0sGrkincu8MQwCASOSLi4A":{"text":"We sat on the balcony and would have had a nice view of Bourbon street if that section of ","useful":0,"cool":0},"rj78yBb63EIgn4PO-LFfsg":{"text":"We stopped in this restaurant for dinner one day while in New Orleans and were pleasantly ","useful":3,"cool":1},"pqYd5h02EJO1mfVmAnGcpQ":{"text":"really unexpectedly delicious. was a little bit hesitant at first but wow. great oysters, ","useful":0,"cool":0},"03EIhR4IWTL6vjEHBLEfSA":{"text":"Nice staff and food.  Ask for Aaron's section.  Held back a star because gumbo wasn't our ","useful":0,"cool":0},"2xr66H_Peucw7hsekdMy5Q":{"text":"The food was excellent and the service was amazing as well. Waiter Troy is the greatest!!\n","useful":0,"cool":0},"eYnN4FIPL2M7iXARDsZhwA":{"text":"Nice setting, including an intimate second floor with a balcony. However, Le Bayou seemed ","useful":1,"cool":0},"s6iSoSL89CuZM0J_P_25UQ":{"text":"great friendly service. food was spot on. manager George was very nice and personable. wai","useful":1,"cool":0},"E9-X3u-e4T_mV7OBKtZaFA":{"text":"We just got into town and needed a place to eat. This was one of the first places we happe","useful":0,"cool":0},"Bx-KXtTwFrQe7Rs9vR_aHg":{"text":"It was our last night in New Orleans and I felt like a walk down Bourbon St. was in order.","useful":2,"cool":2},"w_40FU6zmQAvIyVlqt1KOQ":{"text":"Not bad food until I got to the bread pudding.  It was AWESOME! Large,  warm piece with fa","useful":0,"cool":0},"7iw4S2SWTijG53qcWRWWDw":{"text":"First time in New Orleans, first meal, and I'm SO glad this was my first!!!! The food was ","useful":0,"cool":0},"kqiNsgAJvsErszW7drw1TQ":{"text":"This was exactly the sort of place I was pining for when I came to New Orleans with my gir","useful":1,"cool":0},"fdSP9YZtoelfD0xc98LxMg":{"text":"We just got done having lunch at Le Bayou with Mitchell as our server.  He was so friendly","useful":1,"cool":0},"kddLmqSdcXUqrenc4brkfQ":{"text":"I sat at the oyster bar and had one of the best experiences of my life. Fun atmosphere, gr","useful":0,"cool":0},"bWsLABfdRhR9MPrcaXWnWg":{"text":"Loved this place. Great prices, and phenomenal food. Can't say enough about our waitress M","useful":1,"cool":0},"Y6ymN8AivhMZ_zwHUQKUEw":{"text":"Everything was extremely salty. It also tasted like they used the same batter to fry every","useful":1,"cool":0},"JfOq9It0x-lKzbd0R2udFA":{"text":"Best burger I've had on Bourbon St. I got the black angus burger. It was pretty amazing","useful":0,"cool":0},"8mn4qRC0IAfVDFe-PpawPA":{"text":"Tonight at the LeBaron the food was delicious.  my husband and I had the Taste of Bayou wi","useful":0,"cool":0},"BkIKyWp_-Ca1YZT0AN_YUQ":{"text":"I'm sad to hear this place closed. I came here any time I was in New Orleans. Food was so ","useful":0,"cool":0},"dQm7CYfa1gC1rTK-Q4zESQ":{"text":"Overall a great experience and excellent food!  We went here 3 nights ago for my bachelore","useful":0,"cool":0},"cVtJPbIW_fiqube6kfOuJQ":{"text":"Ha! Ha! Though things were a bit busy on  Saturday Night me and 4 of my girlfriends came o","useful":1,"cool":0},"UjFwgGpp0eHuJRKTJCr0EA":{"text":"I go here every time I'm in new orleans! Ask for mitchell he is an amazing server that can","useful":0,"cool":0},"Hpw_101wTKlSKkMevYRYbA":{"text":"I loooved my grits and shrimp perfect to the teee!!! The Fried green tomatoes were just ri","useful":0,"cool":0},"s2AX11iVJOajOTJ4dXU2aw":{"text":"The Big Easy Po Boy....my god I've never seen a sandwich so huge. It was delicious: friend","useful":1,"cool":0},"x2DuYzFWoSBaBuJOVD4Eag":{"text":"Had a great experience tonight. Jennifer greeted us with a smile and talked us into enjoyi","useful":3,"cool":0},"NsvH1u00TwqbUDVDRA2kIQ":{"text":"Our group of 6 GREATLY enjoyed our meal and experience at Le Bayou on Bourbon Street in NO","useful":1,"cool":0},"RxzWw4rVvKQfzpTRl8rUHg":{"text":"Worst dining experience I had in New Orleans. The food is not anything special and the ser","useful":1,"cool":0},"zO86kYPwSIGH1cfeE0oAOw":{"text":"this place is so fun! And food is awesome! Our server was awesome that's why we came back ","useful":2,"cool":0},"s-_f-OHFQyvZYkfS1JO5qA":{"text":"Great place, quick service and oysters are the best around. Of course the food and restaur","useful":1,"cool":0},"W2MwRtUaghJ0TiqNEnGjSQ":{"text":"Oysters on the half shell -- highly recommend! They are huge oysters and very fresh. Also ","useful":5,"cool":1},"EC6UFZuwFCwlM0s8w1SMuA":{"text":"My friend and I were walking down Bourbon Street checking menus and decided on this restau","useful":1,"cool":1},"g44lyUDH8WqchcA9oawBxQ":{"text":"This was our last stop on our 2016 trip to Louisiana. The theme seemed to be waiting. A lo","useful":4,"cool":1},"BDYBJ-WXfWpfMDkwz8P42g":{"text":"It was not super busy like other restaurants were the night we went, it's why we chose to ","useful":0,"cool":0},"UpAyRoWEfM17deRFh7BdQQ":{"text":"This place is very clean and has great AC on a hot day. The Alligator bites are amazing. O","useful":1,"cool":1},"2C-dT0Dt77K68ZMizyoGWw":{"text":"What a great way to spend our first evening in New Orleans. The food was excellent, but th","useful":0,"cool":0},"LKgjposfl5-y5zjCoQPE2w":{"text":"This is one of the only reasons to ever visit Bourbon St.  The food here is FANTASTIC.\n\nWe","useful":1,"cool":0},"7U0SmcapTwz1bSjg_GZVkA":{"text":"The corn and crab bisque with fresh bread is the best of it's kind I have ever had.  I spe","useful":0,"cool":0},"wP7dUdTkJbVAw1qfHq5n3Q":{"text":"Best corn and crab bisque ever!! Best alligator bites in town! I tried from 6 different pl","useful":0,"cool":0},"R7HnLpWMV-lVwfArAWk-pQ":{"text":"Long flight delays put me in New Orleans at 10pm. I was hungry, but didn't want a large me","useful":0,"cool":0},"5_MFdj0t8vOo0yUSsK8AgA":{"text":"Food was ok.  I had the blackened red fish.  You're able to choose your level of spicy.  I","useful":0,"cool":0},"t4B5Dt1tsWPpDWjxajBuCA":{"text":"Tourist trap on Bourbon Street; should anyone be surprised?? I was glad to get some late n","useful":0,"cool":0},"4E-dvWXx3Cyy8SeQ1WZvJg":{"text":"Preston provided great service and entertainment. The shrimp ya-ya is tasty but stay away ","useful":0,"cool":0},"M-T6KWI8lFZNH9UzfFGfKA":{"text":"I sat at this place for an hour or so and enjoyed a nice New Orleans dish of fried shrimp ","useful":0,"cool":0},"O77KN1H9c78pVQDgcWfLlQ":{"text":"Great place great atmosphere great service!!  Dave provided the best service ever!!  Fanta","useful":1,"cool":0},"-u6-hvXdRrezSbG0TtXaAw":{"text":"Great open air seating where you can hear the music and watch the crowds go by all while e","useful":0,"cool":0},"Dz_qGlIUoY-cNQtbsz0EuQ":{"text":"Extremely disappointed. Probably won't be back and can't recommend to anyone else. Food wa","useful":0,"cool":0},"zAArDiPOWG0PAiZneNRCIA":{"text":"Came here with a group of friends for Mardi Gras. We were greeted by a very friendly hoste","useful":1,"cool":0},"4rarDWlx-TT0CJZ5Oqxqqg":{"text":"Le Bayou Restaurant is amazing!  Try the Shrimp Ya Ya!  The atmosphere is lively and if yo","useful":0,"cool":0},"9lszAVyzXVeEroUnbo60GQ":{"text":"The perfect little spot on Bourbon. We ordered the BBQ Gulf Shrimp and the Chargrilled Oys","useful":0,"cool":0},"79zYwLW1EgFqJrDbzAW82A":{"text":"Very much an over-priced Bourbon Street tourist trap. It's a restaurant/bar with seating f","useful":1,"cool":1},"JjqaieiLSyjwnShoxkzrYw":{"text":"Great service from Aaron our server.   His suggestions were our favorites.   Ya ya shrimp ","useful":1,"cool":0},"jzxy7Ykh6UA7vQbr0eM4tA":{"text":"This place is on Bourbon St. and is very easy to find, that and the pecan ale are the only","useful":3,"cool":0},"sVGCHbfCAotIroBJym0d7g":{"text":"Stopped in to get some charbroiled oysters and was blown away! It was some of the best I h","useful":0,"cool":0},"tI0F-udh2dw4cz1kJXFscg":{"text":"Had the best waiter! Ask for Preston at the oyster bar! Best service and seafood I've ever","useful":2,"cool":0},"ayGoY17zv0dDETRS_DQW4g":{"text":"Mitchell s. Was awsome one of the most original , down to earth men I've meet in a long ti","useful":0,"cool":0},"8AZ3xB6Yw3qT32iDqxp8xw":{"text":"Only giving this place 3/5 stars for their overpriced food. \n\nDon't get me wrong... The fo","useful":0,"cool":0},"pzC-e3MePqqAXHahkqgnig":{"text":"The oysters bayou were fantastic! Definitely coming back! The corn blue crab bisque was eq","useful":0,"cool":0},"PlyGFkL-CkdSWnPMsT382Q":{"text":"Enjoyed eating on the balcony and being served great food by Aaron.  My husband, son and I","useful":0,"cool":0},"L4hLnLWgftxEv5nugd3JzA":{"text":"Ate here twice.  Here is a breakdown of the things I've sampled.   1.  Red beans and rice.","useful":0,"cool":0},"OPAIxYX-8yEfQeTjmSmagQ":{"text":"This was the first place I ate when I was in New Orleans. It set a very high standard. For","useful":2,"cool":0},"nvw6ibX315Hq9en-X3vL5g":{"text":"The alligator tails are a must taste just like chicken. And the chicken Alfredo was even m","useful":0,"cool":0},"d5sAXxBw0XuKxEykuuBYZA":{"text":"This place was open late which was really great! The free appetizer was a great deal for u","useful":0,"cool":0},"zPc9Ztp4gm_NASbJepYV-g":{"text":"The drinks were far from great.\nThe gumbo was pretty solid. \nThe fried gator was tasty. \nF","useful":1,"cool":1},"WvDQB3jhyYCzAnvqPIanew":{"text":"I have to write a review for LA Bayou because they do have a few employees there that are ","useful":3,"cool":3},"JFF4leCrpiCJAg-EidU8zA":{"text":"Great food and very entertaining! We are out here from the west coast and we absolutely lo","useful":0,"cool":0},"cBxs0TW-Ft_gvYLj1YAO7w":{"text":"The food is amazing!!! Tried Chipotle Chargilled  oysters, blackened redfish & corn & crab","useful":0,"cool":0},"wjD7cDKeKU-LyA-QAROLeA":{"text":"Perhaps the worst steak of my life.  Barely ate it an left hungry.  Stay Away!","useful":0,"cool":0},"qzxqlh2NBW_G_yEDKXOzlQ":{"text":"My friends and I made a trip to New Orleans recently for my birthday. We almost didn't eve","useful":0,"cool":0},"zxh11U1oBMF9Yw5C7pSuSw":{"text":"With so many choices we decided to have dinner here and we were not disappointed. we were ","useful":0,"cool":1},"EixES0jhOV7sUvPNhTA-Mw":{"text":"THE WORST PLACE EVER!! AVOID AT ALL COSTS AND SAVE YOUR MONEY! \nLike every wrote, this pla","useful":0,"cool":0},"nHBESunxaBjetZbFt0Wyzg":{"text":"In NOLA for my wife's birthday and this was the first spot we stopped on Bourbon St. and w","useful":2,"cool":1},"RkMzG-G2TMcYKGMGBjx57A":{"text":"Every since I happened upon this place my first NOLA trip, I have been back each time sinc","useful":0,"cool":1},"jQ_Z8uCCEjuQ-Rb4P6T92g":{"text":"We had the best server ever- Kenneth j. was fantastic. I'm not the easiest yelper to pleas","useful":2,"cool":1},"A-LmD3vv7wxqA8gc2CrkBw":{"text":"Not only was our server so sweet and nice, our food was AMAZING!!!! We are actually going ","useful":0,"cool":2},"eH0q3hDoGYUP2JIh7UbnkA":{"text":"The best oysters around. I've never seen the different selections of ways oysters are prep","useful":0,"cool":0},"Z90FzAMVgEOUy4lBU3J1OA":{"text":"Acme Oyster House had a long wait, so since I'm not the most patient person when comes to ","useful":0,"cool":0},"rUUNe4UnHKazI7A5k2ElyQ":{"text":"Ate here 3 times. AMAZING FOOD AND STAFF!!!  Shout out to Kevin, he was a great waiter","useful":0,"cool":0},"Emu4xJRw_aJUXTyJKsNQ2Q":{"text":"My family and I came across this restaurant after waiting at coopers and redfish for forev","useful":0,"cool":0},"88vE2M-drbv0C4FmunsHtw":{"text":"Came to Le Bayou with friends when we saw that they had fried alligator. We all agreed tha","useful":5,"cool":2},"dNqW9yhc3tI7dxqd9vDawA":{"text":"We were just here last evening. The service was excellent, thanks to our server, Aaron. I ","useful":1,"cool":1},"PZi5LP4O5YUwLpWNsRB2iw":{"text":"I thought the po'boys were exceptional.   Everyone of them and an enormous amount of meat ","useful":3,"cool":0},"iojRYc_qNPpugW-OE6zw5A":{"text":"I was in charge of booking dinner reservations for our formal group in New Orleans. I want","useful":0,"cool":2},"2qOfZMoalCmCXUKGUNdA8g":{"text":"I will admit that I'm partial to Le Bayou partially for sentimental reasons, but it is rea","useful":4,"cool":2},"X31vqrOtC4ASrZsZDUaaPw":{"text":"Stopped in for my birthday brunch & was pleasantly surprised! First, we sat on the balcony","useful":0,"cool":1},"8BJzl7IdjDQbkSA_LhAkWg":{"text":"Decided to try something new downtown with my husband. We had an awesome server here named","useful":2,"cool":1},"WwTqlFECB_8KqUmNfs4-Lg":{"text":"We came here on a lark and a decent Yelp score, but it was actually quite nice. Make sure ","useful":3,"cool":1},"dwzoqDfNZl4W5LhDRTZyiw":{"text":"My wife and I popped in just to get a couple of appetizers before hitting the jazz clubs f","useful":0,"cool":1},"4F09JSjffoCT-SonamAjmg":{"text":"My wife got the Shrimp and Grits it was phenomenal! I got the Taste of the Bayou and it wa","useful":2,"cool":1},"BSsYOX87zKvhHFgB3tm5Rg":{"text":"I would have enjoyed this place more if it was not right on Bourbon St.  On this street, e","useful":1,"cool":0},"rfPqJpLdxInXN-SCVp6XRA":{"text":"We were looking for a place to grab a late night eat that wasn't pizza or fried food. As w","useful":2,"cool":2}}