{"mq3JomK08lUxC3aA_Pw6bg":{"text":"I'm middle age and this company is the most incompetent and most unethical company I've ev","useful":2,"cool":0},"JC-h-zx8q68cp68ciq0eHg":{"text":"The worst company, service, and customer service EVER.  Tried for over 2 weeks to just get","useful":0,"cool":0},"6av1QLw6iLmoMYmK2nDdpg":{"text":"Having only been to other cable prividers' stores before in other cities, I steeled myself","useful":1,"cool":0},"G6XND5GVwD9yngfMOKHftQ":{"text":"The very first time I visited this location to swap out a broken remote control, I was not","useful":3,"cool":0},"2Jn_LrpUdH_Amcs13_NEKA":{"text":"I was just here, was overwhelmed with exceptional, speedy, super-friendly service!   They ","useful":1,"cool":0},"9AIX4mDHjlcKGCp38Xn6Ig":{"text":"I just had a horrible experience with one of your service techs! We had just switched to t","useful":0,"cool":0},"sRfnBJOnuxhngNwf4in42g":{"text":"POTENTIAL!!!!!\n\nA year ago when I first had the unfortunate pleasure to visit this Cox Ret","useful":7,"cool":4},"pp0Z71lS04JoYeMSA7Z4JQ":{"text":"Let me start by saying I've had some pretty terrible luck with Cox in the last few months.","useful":2,"cool":0},"Lp54imqPotmYRpqsIp0pHg":{"text":"In and out in under 5 minutes?! Yes please! Very clean store with an extremely polite and ","useful":2,"cool":2},"88NLmti_FcYW1BdKV0KlmQ":{"text":"I went to the Cox Solutions Store to set up an internet account, as my roommate was moving","useful":1,"cool":1},"MZXRLSo8NlNTQ1YnYkFrEQ":{"text":"The worst cable service provider Ever!!!! I was promised that a technician would come out ","useful":0,"cool":0},"-ADF6pu2X35cf0Qivk0I_w":{"text":"Internet is included in my rent or I wouldn't bother with Cox at all.  But there is a prob","useful":0,"cool":0},"Kx6lSMQUoPrKg1LYZqE_Tg":{"text":"Don't go to this location if you are planning to rent equipment from them. I had rented a ","useful":0,"cool":0},"_QLGbDToTcotsg1Zn2lk4Q":{"text":"The sales people are almost as bad as the service. Cox will use and abuse you. They are th","useful":0,"cool":0},"XmRir3SInJK8s415bxgHgw":{"text":"I wanted to put negative stars,but obviously you can't!  This cable provider is the absolu","useful":2,"cool":0},"eBpahkyMMuaqV5fJeZq-aA":{"text":"Garbage Corporation Defined\n\nI've been dealing with the fuckery of Cox for the last year a","useful":0,"cool":0},"PLEizT167JNPt5CHOgsgPQ":{"text":"Every time I'm here the service is quick, and the staff is friendly and helpful.  \n\nToday ","useful":11,"cool":11},"itsjuY06zfXMOmpDdMyF5g":{"text":"Not happy about how much I pay Cox every month, but this review is about the \"Cox Store\", ","useful":9,"cool":4}}