{"Yn_RJRSvv0K6Ewh0Dy_9uQ":{"text":"This hotel seems very nice in the lobby, but the rooms are sub-par. Ours was located on th","useful":6,"cool":1},"YBsiJvDfhVrzvRBCgpLnNw":{"text":"I got this deal on hotwire great price, great location, and would definitely stay again.","useful":0,"cool":0},"t6qCL6n8VOMLQIYy1GgG8g":{"text":"Understand first that this was a party trip with some buddies so I am reviewing the hotel ","useful":2,"cool":0},"eEmlZuI8Uu57Y9UqG8MhJA":{"text":"The 3rd floor King Room had a balcony on the side overlooking Bienville. The hotel has liv","useful":0,"cool":0},"3J0DcFukAxpmR9JXByAxFA":{"text":"A group of 12 girls and I came here for a Bachelorette party and had a two bedroom interio","useful":3,"cool":0},"yggTn0OPh3VaGsxvBFCHsg":{"text":"The staff were exceptionally courteous (the front desk for check-in could follow suit with","useful":0,"cool":0},"DBiqVd-kDH-cF9n4GkC8Qg":{"text":"Place looks nice but really isn't. The rooms are low quality and small. \n\nOur toilet is th","useful":5,"cool":0},"wsRRxwY9zaEOHtofnwAImA":{"text":"Simply the best stay you will ever have in the French Quarter.\n\n  The Royal Sonesta is con","useful":2,"cool":0},"9MjWKZ524w72nhDk6-tjpw":{"text":"Ok my 4 stars are a little more biased than usual. First off, this hotel IS pet friendly. ","useful":1,"cool":0},"lR29wee-Ok7jD8-msJFDCw":{"text":"hulamom and i stayed here during her birthday jaunt and it was actually pretty lovely.  th","useful":0,"cool":1},"7V_Y24EZOBqtuZA6Vm4lqA":{"text":"Wish there was an option for ONE STAR. An epic disappointment on my wedding weekend. To be","useful":1,"cool":0},"Pkuk_vxjE5TIX93CZgBSMA":{"text":"Ok. Room was nice but nothing special. They are in the middle of renovations so I'm  sure ","useful":0,"cool":1},"0zWPBWnyCFlLQRi83GMO5g":{"text":"Last weekend I had an incredible weekend in New Orleans with my family. The amenities are ","useful":0,"cool":0},"Ec5bhp-TkvE15P4_Q_14-g":{"text":"The Royal Sonesta New Orleans is well located (try to get a room overlooking the pool). Th","useful":0,"cool":0},"BrmSYk_m0NdtvdV-JGr8Bw":{"text":"CAJUN Bloody Mary's! I have to write this because I searched yelp up and down for a true b","useful":0,"cool":0},"kExidRC-KLQCd9uCYzy_6w":{"text":"This is a really great hotel.  First class service and most of all the best location on Bo","useful":0,"cool":0},"siEaoL_ZsQhCftd60zN5DQ":{"text":"Awesome hotel for events, especially if you're a bunch of dudes, or a couple in town to pa","useful":2,"cool":3},"lLYComiYORFgNkqMlOgbAw":{"text":"This place is perfect if you are wanting to stay on Bourbon and the staff is very nice the","useful":0,"cool":0},"0_LQOpJ4u5NFAlcABUFdOA":{"text":"I loved everything about this hotel! The staff is super friendly and they really take care","useful":1,"cool":0},"QvDoP7QnCpaWWUa3fFAWZA":{"text":"Very rude staff... with the bands permission, I took the bands tip jar around to collect t","useful":1,"cool":1},"-GEVShs3NfHLXs_P5D6FNQ":{"text":"Have been staying here each year for a number of years. They have a renovated section that","useful":0,"cool":0},"GnzIwfWQ1yjetnA8SqnKtA":{"text":"I stayed here for a weekend and they made my stay so pleasant. Located in a great spot on ","useful":0,"cool":0},"I9NwBcOS-RqH-CN8d33AZA":{"text":"Fast check in, comfortable beds, clean rooms, no coffee maker on room :(  , other than tha","useful":1,"cool":0},"AmCi7F7Yo1Utgzkj886a-w":{"text":"If I could give this 0/5 stars I would. The front desk staff is EXTREMELY RUDE. They are u","useful":2,"cool":0},"vZopWcpBiQ_RcY2S4uaZhA":{"text":"I never in a 1000 years thought I would give a Royal Sonesta a super outstanding rating. L","useful":1,"cool":0},"mVavmp-Tl25KKChfXTCyIA":{"text":"So there was so much that could have been so good here, and it ended up going downhill.\n\nS","useful":4,"cool":2},"rH0EtVvo7n60J0vRXlCs0Q":{"text":"I really love this place \n\nIt's very elegant \n\nOutstanding food and service \n\nI tasted a 6","useful":0,"cool":0},"ZXL3wQzRL3tV_NS2gMhYuw":{"text":"The hotel itself is really nice, clean, quiet ( on the 5th floor) - the staff is very nice","useful":0,"cool":0},"8U_4N6U1c2FyFZBXx8J4xA":{"text":"The real stars are the staff.  After a long day, we came back, and looked longingly into t","useful":0,"cool":0},"zW3xYn9XU9jy-Fs0CnbAYw":{"text":"Great clean and attached restaurants are amazing. The location is perfect being on bourbon","useful":0,"cool":0},"hLF7uYCA8Y3BSm421yL1EQ":{"text":"I love this hotel. My initial impression wasn't great because the front desk guy was very ","useful":2,"cool":0},"Lf8Uwax8ihCgSRAlTyjBIg":{"text":"The most striking feature outside of the obviously stunning decor is the friendliness of t","useful":0,"cool":0},"fxSLrLoZ-BPT0hIhDNKwPQ":{"text":"Großes Hotel auf der Bourbon St., welche man sich wie eine Mischung aus Reeperbahn und Bal","useful":0,"cool":0},"SwsmY9mywzuaBhRB2657hQ":{"text":"My entire experience with the Royal Sonesta in New Orleans was a disappointment from booki","useful":1,"cool":0},"K16XU5jcYLUefNCFWwnh9g":{"text":"The only thing I have to say against the Sonesta is, the redo for the bathrooms won't stay","useful":0,"cool":0},"ZbTEFdO0YqTMyjLs-exf3A":{"text":"We stayed at the Royal Sonesta a year ago and it was a fabulous experience. Unfortunately,","useful":2,"cool":0},"kWGKhws_O8ozv95X4goVLg":{"text":"Stayed here for 5 days, 4 nights for Christmas for less than $200/night for a deluxe room.","useful":0,"cool":0},"8FkuqTkkH9Bq-oHnuHozEQ":{"text":"Super-convenient location, but be ready for incredibly loud music until about 4 am if you ","useful":0,"cool":0},"2Z9MCHeQS3XwEoUJDpjCFA":{"text":"This hotel is on the verge of becoming something very special.  The service is fantastic a","useful":0,"cool":0},"P8rdFHZBCevBSyDffpQhAA":{"text":"Ask for a balcony, the few dollars for the upgrade is worth it.  The last time I was there","useful":0,"cool":0},"ijIloMEAxEJhaqRfYpshYQ":{"text":"We had a small problem with our room and Mel at the front desk made everything right. Than","useful":0,"cool":0},"OglT_CzqKzWkUyyQshLBPA":{"text":"Great hotel right on Bourbon St.  Craziness outside the door, sanctuary inside the door.  ","useful":0,"cool":0},"DM7SKw2b1cXXLcfRBhuZKQ":{"text":"We spent part of our honeymoon here last week for 5 nights. It was our first time in New O","useful":0,"cool":0},"Lz7qr2muH-ygcYKwwmnFAA":{"text":"I loved my stay at the Royal Sonesta! All the staff were friendly, knowledgeable and wonde","useful":0,"cool":0},"eOfKjAvj45GMCzS4T3km8w":{"text":"The Rooms are nice and the place is clean and it is an historic landmark right in the midd","useful":0,"cool":0},"AnqtZDbx3PgufTnN6iBZhA":{"text":"Beautiful hotel. Great location. Really would love a bottle of water in my room or the abi","useful":0,"cool":0},"_UbbsiN9yaK6nqapsvPIKw":{"text":"Zero star is more apropos!  Surly operator and housekeeping staff do not contribute to the","useful":0,"cool":0},"rZjTXftZXtQmUPGrWZoFNg":{"text":"Loved my stay here a few months ago. One of the rooms was amazing, brand new and very clas","useful":0,"cool":0},"lGIzVepFmswxuQ1Q5liXiQ":{"text":"Loved our stay at this hotel. The inside was beautiful and the staff were all very helpful","useful":1,"cool":0},"Kxs1gQONmSfBnFEkOeDyKQ":{"text":"The best hotel in New Orleans and pretty much the 50 yard line on Bourbon Street! The staf","useful":1,"cool":0},"C-BSH4V7JFxvZVqo_hk2YQ":{"text":"Very disappointed in the Royal Sonesta. Major construction happening outside the hotel whi","useful":0,"cool":0},"pPOyq4Es3tMDf3BOlS_xHg":{"text":"We sought refuge here after checking out of the nightmare experience of the St. Marie, a f","useful":0,"cool":0},"po0tR9n0Fklw1sS3cfwJxA":{"text":"The good:\nHospitality is awesome here. We were greeted at the door, and the staff made us ","useful":2,"cool":0},"UxtSsnZuNAhbDXo0y4AUMg":{"text":"Stayed at Royal Sonesta for a conference and liked the place very much.  You get the feel ","useful":0,"cool":0},"mrYmFNFQyae__AhaarxI6Q":{"text":"**Location - You can't beat it. right on Bourbon...you can stumble right back to your hote","useful":0,"cool":0},"vjp78cPakwoNxD2OrNMoQw":{"text":"Disappointing experience on most levels. Unfriendly service, poor food quality, slim ameni","useful":1,"cool":0},"ixx8Yu9CRFDx2AajB-oRJA":{"text":"This hotel takes up one side of the 3rd block of Bourbon street so the location is perfect","useful":0,"cool":0},"zkw_ImaDT7SByp3g92ZsEg":{"text":"This hotel is wonderful. My husband and I have stayed here twice in the past year. The sta","useful":0,"cool":0},"KtiPpqVplvo5L-9G2ihKLQ":{"text":"Checked in last night. Got absolutely excellent service from Mel at the front desk. He is ","useful":0,"cool":0},"Ge_EbFfcMBlr0ohOI0NIRA":{"text":"I have never had worse customer service at any hotel I have ever stayed in. First, our val","useful":0,"cool":0},"xxntiVOdQtpnkiuWNAVFig":{"text":"Great Hotel Fabulous stay here \nWe loved the R club floor and Even more we loved Darin the","useful":0,"cool":0},"LIgjvNNFn5xtf9Zy19icEg":{"text":"THE  place to stay to get a balcony overlooking bourbon street and party all the time. It'","useful":0,"cool":0},"_byJU_grd_4Baw48UNuShA":{"text":"Our favorite stay of the 3 different hotels on our recent trip, and the ONLY room that did","useful":0,"cool":0},"HF_8ZP803mMScTJXv1EtuQ":{"text":"The staff was nice, but so was pretty much everyone we met in NOLA.  The hotel was tired a","useful":0,"cool":0},"v5T5siTsXHNc_q1Sq9kk4g":{"text":"We have stayed at the Royal Sonesta Hotel in New Orleans three times now, and will be more","useful":1,"cool":1},"4u37IHEP8YRUTt7BUYuWcA":{"text":"We stayed at the Royal Sonesta the last weekend in August. This is a great hotel, but we m","useful":0,"cool":0},"S8AQky0TDpfEt0om3LNeoA":{"text":"A last minute vacation turned into a wonderful vacation in part to the fantastic staff at ","useful":1,"cool":1},"epgMjxERHzmx8ZxSAAguxg":{"text":"A lovely lobby with a coffee shop.  We stayed here 3 nites for a conference and found the ","useful":2,"cool":2},"PRq9hoI7T6L9LPmIYFzaTA":{"text":"We stayed here for our honeymoon in May. We were upgraded to a huge suite in a private cou","useful":1,"cool":0},"pvNQHjujWXktm_SqemqAIg":{"text":"Great Bourbon St. location, but the hotel did not live up to the hype.   The room was disa","useful":0,"cool":0},"ST0QASKPvAzLY7YVzPAw5A":{"text":"Great location, but very noisy. If you stay here, make sure you get an inside room. The Bo","useful":0,"cool":0},"xjNND5a8V1bn3J79QhitLQ":{"text":"First trip to NOLA for a 50th birthday weekend. YES it was in the best location for  the n","useful":0,"cool":0},"cgCd6W4GVzh7B6hJp56VjQ":{"text":"Awesome hotel. I have been here twice now and love it as it is i the middle of everything ","useful":2,"cool":0},"Dd-U6Bdv50b6DdK3fti4MQ":{"text":"This was a great hotel.  Since it is on a main street, we asked for quiet room and it was ","useful":2,"cool":1},"HRBRMFtp31-AvN8Gii_DTw":{"text":"My first time to NOLA and was crazy excited. Also this was my 19 wedding  anniversary. Thi","useful":0,"cool":0},"lnFgJvyEwRMwf3zGom9BTQ":{"text":"Our stay at the Royal Sonesta Hotel in the Nola met my expectations.  We stayed on the pri","useful":4,"cool":1},"3GcsWa4W4SkrhHhZOrntqg":{"text":"Ok so bourbon street was fun but I would not stay on it again.  The rooms were small the m","useful":0,"cool":0},"9eszjOhvTN4qwForR7-eLA":{"text":"Quite possibly the best customer service I've ever had in a hotel. Nice rooms and great lo","useful":0,"cool":0},"fEJWOVkDoVaWE0m3o-3fRg":{"text":"The hotel itself is nicely appointed. The lobby, grounds and rooms are nicely done (consid","useful":0,"cool":0},"4YIbFcSlurtPhyuXOy_6Gg":{"text":"Best hotel in NOLA hands down.  I love that place and will also stay there.  It was a myst","useful":0,"cool":0},"6G6qYlawgcnp_RKorOGOtg":{"text":"Very nice hotel right on bourbon street! Very beautiful hotel. Extremely clean! Very nice ","useful":0,"cool":0},"OpPfXRZ2JhQ8F1sO1lIvjw":{"text":"Booked this hotel through Expedia and got different info on what I'd agreed to at the hote","useful":0,"cool":0},"fKC1kJlzdw6i5cqTdTCrBw":{"text":"even in the heart of hurricane season, our romantic getaway was amazing at the royal sones","useful":0,"cool":0},"vZJRzNIM3sZIijVw6IqYPw":{"text":"Great location.  Walking distance to everything.  Nice pool area, but gets crowded.  Could","useful":2,"cool":1},"zgVfSlBMvjnB08iA8mGkYQ":{"text":"This is probably the nicest hotel ON Bourbon Street. In fact, it encompasses and entire ci","useful":1,"cool":0},"Kd0qcWH-0zHDmgvZej0KQA":{"text":"You want to have a GREAT time in New Orleans? Come to the Royal Sonesta. Its smack dab in ","useful":0,"cool":0},"jyXdflf8QP-v4IV70gFb5Q":{"text":"Stayed here for a weekend in Dec. with my boyfriend. If I ever go back to Nola I would def","useful":1,"cool":1},"JGm056l7jUZpsG4Ltc3y0A":{"text":"The worst hotel I've ever experienced. Let's start with an old rust spotted bathtub, stain","useful":2,"cool":2},"cTxe8TY7JLcBVqL39AkcOw":{"text":"THIS PLACE IS INFURIATING!\nUninterested, uninformed, and unprofessional staff make this pl","useful":0,"cool":0},"2dKvK53VbvgdcPVlXvOZvQ":{"text":"Nice hotel. Last night people partied outside our room til 400 am. No one downstairs would","useful":0,"cool":0},"uF_GfGduNgJLea7gTs4UMQ":{"text":"Pros: very friendly staff. It's on Bourbon Street. Nice pool. Nice fitness center.\n\nCons: ","useful":1,"cool":0},"in_iZRcqJSE1T9wftVD8pQ":{"text":"We just revisited the Royal Sonesta in July. We stayed here last year and had a nice time.","useful":1,"cool":0},"XCvkawaD4xaUcggCZpKp1w":{"text":"Pros:  1.) Great Location !!!\n            2.) Clean and well appointed Lobby\n            3","useful":0,"cool":0},"eCrrACqVvjFZbA5pT28yTw":{"text":"i simply can't say enough about the staff at the royal sonesta. when our wedding was cance","useful":0,"cool":0},"YOaHcjNQTmlrspXdP7udRg":{"text":"Beautiful and Luxurious. Great reception desk: Jasmine and Rita. Situated in the French Qu","useful":1,"cool":0},"mNFjWBeEN9Q6nEi6Bl6gUg":{"text":"I just checked out of the Royal Sonesta on Sunday and the service here was some of the wor","useful":0,"cool":0},"jcYaCph3Ip8TFcq1a9eL3g":{"text":"This was a nice place to stay because of location. I have a few issues with the hotel room","useful":0,"cool":0},"hbt2n_ICvtCv2uzN2okDXw":{"text":"ROYAl DUMPESTA. SERIOUSLY???  Four star reviews are a lie. This place smells like a damp f","useful":1,"cool":0},"3rsaGYAPqKjIqvxNTCeD7w":{"text":"Overall a decent place to stay. We requested a quieter room off Bourbon street. However th","useful":0,"cool":0},"f0lBjR-RWisbCpKx_YG03g":{"text":"A friend and I stayed here for a conference we were attending which was also hosted by the","useful":2,"cool":0},"_GyQmMpvrYgFpBVLXCWyjg":{"text":"Excellent hotel. The room was clean, up to date, ample soft towels, large tv, cold refrige","useful":0,"cool":0},"49MbwawUkO1kS6fBnsrcgg":{"text":"Excellent hotel right in the heart of Bourbon St.  I felt very safe here and enjoyed the l","useful":2,"cool":2},"OgE8yHUMQWNMyxpT9m2CWw":{"text":"Without a doubt one of the best hotels and now my #1 choice to stay at when I go back to t","useful":0,"cool":0},"W-XasElY9OumtKlo9ZaUZg":{"text":"My husband and I stayed here for our honeymoon and it was so nice!  Centrally located in N","useful":0,"cool":0},"aZ0PaHXVWcS3zqmS8gAHew":{"text":"Excellent staff , well except for the concierge who had a little bit of a an attitude, Any","useful":1,"cool":0},"DPg4EsSq91xwrggPkJY2HA":{"text":"First time to the Royal Sonesta on a trip with a friend. Loved every minute we were there!","useful":0,"cool":0},"J1_5CXdYwDDFXM-vs7IjLg":{"text":"What's there not to like? Simple as that. Great location and easy access to Bourbon street","useful":0,"cool":0},"l3ShcNqJyis2hQqH7LvehA":{"text":"Convenient location, walkable to most parts of the city.  It does sit right in the heart o","useful":1,"cool":1},"h1Onh1ftyfcCZFuNmk1L9A":{"text":"We experienced the best and worst New Orleans has to offer at the Royal Sonesta.  If you r","useful":0,"cool":0},"R9LRZEIgoaQwKqPRBHIOiQ":{"text":"I was visiting NOLA a few months ago (a little late to review) and had a great experience ","useful":0,"cool":0},"Fyh7qDSqDOJubw5qrDy38Q":{"text":"I am not one to write a review but I definitely had to give this hotel my review.  From th","useful":0,"cool":0},"1dH1bBHulsWyge3uy7JgoQ":{"text":"It's right on Bourbon St. Staff was exceptional. Rooms were on the small side, but that is","useful":0,"cool":0},"kLXiSnaxBwgtLjB4MWuVQg":{"text":"My husband and I stayed here for his b day weekend and we really enjoyed our stay.   Our r","useful":1,"cool":0},"SzNY8crFKwdLXj-walu1qQ":{"text":"We normally stay at Le Pavillon, but for Christmas we wanted to be smack dab in the middle","useful":3,"cool":3},"bymmJ9ljiS_raQL1Z4ls-w":{"text":"The balcony room was really small, despite being described as having lounge furniture and ","useful":0,"cool":0},"UTnT5bS7_BF4-q072nZQcg":{"text":"This place is perfect! Nice and clean, and the staff go out of their way to accommodate gu","useful":1,"cool":1},"RFZblujuEoVP0wZKY5DTEQ":{"text":"Can I say fabulous because this was just a fabulous stay!!! The thing I guess I liked the ","useful":0,"cool":0},"Ehz0QTPRq9Mgum5z2I8U_w":{"text":"Had a 3-day business trip here - was a good experience overall.  Nice staff, cute (but sma","useful":0,"cool":0},"2dpb04FrP6xd4viGvA7nPA":{"text":"I stayed here during a conference, and really enjoyed it! It's located right on Bourbon st","useful":0,"cool":1},"m7mI1VOdoQzib-M8cBcfcw":{"text":"Everything was amazing!!!!!! The Desire had the best oysters!!!!! The concierge Russell to","useful":0,"cool":0},"e5W_N_iAendiqi5U9-q1Iw":{"text":"We stayed at the Sonesta on our first trip to New Orleans. Considering that this is a four","useful":3,"cool":1},"dg43QDSMOIv-Bt0P4gsOcg":{"text":"Wow! I have been to New Orleans many times. I have stayed in some nice hotels. This one is","useful":0,"cool":1},"_zS1mRnK-LjhvSZ1km3vVQ":{"text":"I just returned from a weekend trip to NOLA, where 7 sorority sisters stayed in at the Roy","useful":1,"cool":0},"UIRZYzHICDqo53w2tg6y8w":{"text":"I've stayed at the Royal Sonesta a number of times. Since my last stay they have done some","useful":0,"cool":0},"86qQlCdF1O8wJzxEMQILQQ":{"text":"A beautiful hotel with fantastic rooms and great service. I had my wedding there, along wi","useful":0,"cool":0},"ptqCL8_zHohIfHCPyZScFQ":{"text":"Had a wonderful stay here for my birthday. The entire staff was amazing and helpful. It Ch","useful":0,"cool":0},"Riwls1k6Nj_jK7aYrqqfaQ":{"text":"Stayed here for 4 nights last week for beginning of Mardi Gras \nWonderful, clean and frien","useful":0,"cool":0},"0sikPDQTJEsi8AtWyeTLKA":{"text":"I'm staying at the Royal Sonesta now and it's a very frustrating experience. The internet ","useful":1,"cool":0},"GZcXS4o7GHipu7YYjEn2Qg":{"text":"A lovely hotel right in the middle of the action.  Out one door - It's Bourbon Street with","useful":0,"cool":0},"_2af41EPCEENpaTCSCUs9Q":{"text":"Friends and I moved here post-Jazzfest this year and they were exceedingly accommodating t","useful":0,"cool":0},"quXdCm9qJEKFe5zwiN-uXA":{"text":"In my New Orleans love hangover, its tempting to give the Sonesta 5 stars, just by merit o","useful":1,"cool":0},"0I9fgFme0b_HpsJ-GLKRdQ":{"text":"Overly priced hotel that charges extreme prices for substandard service. Don't stay on Bou","useful":1,"cool":0},"LGca6sXTupNzhKs_gJKiGQ":{"text":"The Royal Sonesta is an upscale hotel located in the heart of the French Quarter of New Or","useful":2,"cool":1},"ERPu8kbn1WHc9Ebd-_nALA":{"text":"Real nice. Well furnished rooms, great service, quick retrieval of car from parking garage","useful":0,"cool":0},"wAHhtp6pO89EcyZXJ36fEQ":{"text":"This hotel is too aesthetically pleasing to be located on a the corner of a street that sm","useful":0,"cool":0},"KJMdFQH9ffv3kbIOPf92FA":{"text":"Really cool hotel in the French Quarter.  Utilized their ballrooms during Tales of the Coc","useful":1,"cool":1},"gt1w1R_akj6LZIqJJgbl5w":{"text":"I arrived at the Sonesta on a Thursday for my very first New Orleans wedding. Since this w","useful":0,"cool":0},"h2PVp01Tfm5vz-rm-Oriqw":{"text":"Wait wait... this hotel is on Bourbon Street, the rooms are exquisite with balconies to ov","useful":2,"cool":1},"y4lpUnzs8Mm-gd_4KGnE4g":{"text":"BED BUG WARNING:\n\nWe were in New Orleans for Easter Weekend (April 14-16) and stayed at th","useful":1,"cool":0},"IpsRlJwrqyHF2pBldiW1ow":{"text":"I stayed at the Royal Sonesta in August for a bachelorette trip and the location and accom","useful":0,"cool":0},"DLZpRP-NyMOPnn71_J8zKg":{"text":"Came to new orleans for my honeymoon of course we had to get the hotel right on bourbon st","useful":0,"cool":0},"1rUTZWxEuAs2q_6VJ3JkKA":{"text":"Stayed for one night on a business trip.\n\nHighs-\nvery nice inside\nquiet hotel despite loca","useful":1,"cool":0},"LLdh-E-AZmMzI7OgQ2sesw":{"text":"Dirty, Loud and Cockroaches\n\nThere is no way this is a 4-Star hotel. Nothing about it said","useful":2,"cool":1},"ZaTMMrdidDngvPj46Bv5aQ":{"text":"I went to New Orleans with my boyfriend in October and we both absolutely loved our vacati","useful":1,"cool":0},"ylOqOECOw0P6NyPk1LrOZw":{"text":"Beautiful hotel in the heart of Bourbon Street. Fantastic Concierge! \n\nWe were close to it","useful":2,"cool":0},"7Jx0HOpLlXEQWYpys9o49A":{"text":"We stayed there for my nephews graduation.   We stay at here every time we visit new Orlea","useful":4,"cool":0},"JvjKHO8H8aPNBYtTcw2pBA":{"text":"My fiance and I booked a trip to NOLA on a whim -- think \"7 am flight booked at 11 the nig","useful":5,"cool":5},"6qaPRtp3PCEMmRyOdwrJig":{"text":"Stayed here from July 25-28th.\n\nWas down for my cousins 21st birthday party turned family ","useful":0,"cool":0},"NGrtCJETySv_z50NrAP5gQ":{"text":"I stayed here for a few days during my first trip to New Orleans. First off, bourbon stree","useful":3,"cool":0},"SXNpdOlba9tZdjisw99NCg":{"text":"Lovely little piece of history. Wonderfully renovated with a fabulous staff. Everyone from","useful":0,"cool":0},"c1gYEdCqGTjm039cW7E4mA":{"text":"Very nice hotel. Brand new, comfy rooms. The staff is very friendly and accommodating. The","useful":0,"cool":0},"6g_BYTMPBubFrLBNPL2AGg":{"text":"From what I saw, the nicest hotel on Bourbon St. The pool was a bit dated, but it was a ni","useful":0,"cool":0},"e-d9xWIu34cKVfHmHTwdEw":{"text":"So many great things to say about our experience at the Royal Sonesta in New Orleans. \n\nWe","useful":1,"cool":1},"RpgfRzcjExPM4c5r7pAB1A":{"text":"I had a terrible experience dealing with the management of this hotel. I had to cancel my ","useful":0,"cool":0},"gZbmSu0YORrEPIqA04n3-Q":{"text":"Great place to stay mostly for the great location! Right in the middle of it all. Beautifu","useful":0,"cool":1},"I5rkv496_kP2yNlXKyr60A":{"text":"Hotel is beautiful  Make sure you get a room facing the courtyard - or you willhave a lot ","useful":2,"cool":0},"XXfU4-BU6LF7HuT-_bFRjA":{"text":"Lovely hotel.  It's in a good location in the French Quarter.  I would recommend  a pool s","useful":0,"cool":0},"aQ_Ol1vail14A3ExrbdQjg":{"text":"Great location and beautiful hotel. \n\nDownside is an incredibly too soft mattress that is ","useful":1,"cool":0},"19PSeKY49R1knnRdU9X0kQ":{"text":"Nice hotel.    Clean.  They accommodated our request for a room away from Bourbon as we wa","useful":0,"cool":0},"TS9ympUNtvHAYYhwX48Jyg":{"text":"Beautiful hotel located on the corner of Bienville and Bourbon.  I always say a little bit","useful":0,"cool":0},"piQKDt-d8nUxmDJxmQCj-w":{"text":"The fact that Royal Sonesta has a computer terminal for guests to print out boarding passe","useful":3,"cool":0},"R33AE6AFWjtkptLaWgigpw":{"text":"Beautiful hotel, great location, world class staff. They have a club level on the 7th floo","useful":0,"cool":0},"z2uMe-3LPdXbFz_Zo5K_ZQ":{"text":"My wife and I stayed here for a few nights on our one year anniversary and we could not ha","useful":1,"cool":0},"t4ll9RbFVMSeAfLazfj4JA":{"text":"I travel a lot and his has to be the worst hotel I have ever been in. We checked in at 9am","useful":1,"cool":0},"LCF4IGZi5V9QKPJtQs-Nfw":{"text":"I lucked into the bargain of the century when i got a room at The Royal Sonesta.  It isn't","useful":1,"cool":1},"pjDZ3RzhBj_s8sqAYfofnA":{"text":"I really liked the hotel in general. It had a relatively convenient locale and the lobby w","useful":0,"cool":0},"SRxOb-j0jct2NfUfCkmzcA":{"text":"Royal Sonesta - Best Place to stay @ Bourbon St.\n\nThis was my the third trip to New Orlean","useful":2,"cool":0},"5sdhyi1rrgZTEk7UYXSfww":{"text":"Nice hotel centrally located. Have stayed here before and would  agsin.  Rooms are getting","useful":0,"cool":0},"-0q05gT_Jya6zXynM1NuuQ":{"text":"We stayed there only overnight, my sister , my cousin and myself; just three gals turned l","useful":0,"cool":0},"bzd3H_Nn7dbtG0hVGK3lMA":{"text":"Reserved two rooms with verandas on Bourbon Street for a full week and had a lengthy conve","useful":1,"cool":0},"CCbIUJvxeVfycccr4b9cag":{"text":"So glad we stayed here! Beautiful, well maintained hotel right on Bourbon St. (nevertheles","useful":0,"cool":1},"BaDMfortbgSPJweWFX3PpA":{"text":"The Royal Sonesta offers excellent service. The staff were quite accommodating, friendly, ","useful":0,"cool":0},"sb95GYxuhYnqqMPB0GQ-iw":{"text":"We booked online. Upon arriving they put us in a room that smelled very musty. Changed our","useful":2,"cool":0},"KSzLpr-0j11YScIlvgVbRw":{"text":"I stayed here for two nights during my first trip to New Orleans. I didn't book the rooms ","useful":0,"cool":0},"ZsjNilfB4aq9FORbICwfJA":{"text":"Nice size rooms, clean, great mattresses & Pillows and a very friendly and attentive staff","useful":0,"cool":0},"q4HOFJ9sDQZDKsIL9ReCzA":{"text":"This hotel is the perfect place to stay where all the action is which is Bourbon Street. T","useful":2,"cool":0},"vhNdJg1e3BifqG86EGHRiQ":{"text":"Nice hotel but service is a bit lacking.  Left for 7 hours today and returned to keys that","useful":1,"cool":1},"MnyiYgVHkakpPfPNR6MukQ":{"text":"Stay on the R level for the great service, open bar, breakfast, and the fun of being on a ","useful":1,"cool":0},"bSpmDbcgkGTZYPaQZEuNQA":{"text":"Royal Sonesta New Orleans is always so consistently good, I wonder why I stay anywhere els","useful":1,"cool":0},"qEwiRwxKnzxCV0kveCX6vA":{"text":"The name Royal Sonesta should give you a hint\n\nThis is our second time.  each visit is a p","useful":0,"cool":0},"ya3Qpn8p66Al27H2u8CwHA":{"text":"Not bad.....rooms a bit over priced for what they are.....very very basic.....however they","useful":0,"cool":0},"6pVDSaNKcPhD5Fy95TSWAQ":{"text":"Maid came three times before 9 am trying to clean the room, which after a night on bourbon","useful":1,"cool":0},"zpjmhFyhRAnLPR42O5Os9w":{"text":"Stayed here last spring on a trip to New Orleans, perfect location right in the heart of b","useful":0,"cool":0},"RXTqZ2oD2wvJYXu9VAyRLQ":{"text":"The Royal Sonesta is right on Bourbon St- basically ground zero for French Quarter debauch","useful":0,"cool":1},"Q4T_If9wnNOSIOfJzx6OxQ":{"text":"Our trip started out okay, Tony the bell hop was great, and funny and since it was our hon","useful":1,"cool":1},"PC9-pQqZ-DNF9v5PtrMEjg":{"text":"Great facilities, decent internet speeds, friendly staff, perfect place to relax off of Bo","useful":1,"cool":0},"Idge9yDIWPn5Kpm_o8KwZg":{"text":"(This is from pre-Katrina, although I've heard the Sonesta's caliber of service has not ch","useful":1,"cool":0},"kNgMqYzDRdJlCBOaJ_hiZA":{"text":"My husband and I stayed here for our 1st wedding anniversary.  We made sure to mention tha","useful":0,"cool":0},"hq5O-Zm6x8ghOXAbuWeeyg":{"text":"Amazing hotel!  A bit pricey but you are paying for location location location!  Right in ","useful":0,"cool":0},"do-iH39xg6BRdHzCMyPrBA":{"text":"I can't believe I have not wrote a review on this place.  This is my Fave hotel to stay wh","useful":1,"cool":0},"uLc3O6YcJ_pTyJwC6UR3ZQ":{"text":"Sooooo ....this is my second vacation this year to NOLA which I ADORE. My first stay was a","useful":2,"cool":0},"LrGMuMJNiBUTfjaB4-DUEg":{"text":"Fantastic decor, great service, clean, and worth every penny!!\nI did a ton of searching fo","useful":2,"cool":1},"q1-RcxuEsGtl2ZEAu5tIkw":{"text":"Situated in the heart of the French Quarter but managing to keep the rabble outside of its","useful":0,"cool":0},"zbdgjLpt_NjkP2EXeAKVfg":{"text":"My husband and I were married in May 2000 at the Royal Sonesta.  We had 150 guest from the","useful":0,"cool":0},"l1553WJSkq-jkuC6hWtvPw":{"text":"I am currently at the Sonesta and felt the need to write a review:\n\nPros:\n- Decor\n- Locati","useful":2,"cool":1},"LWEd40IZu_83SvZ5w4C2bg":{"text":"First time down to NOLA and stayed here. I absolutely love this place! Stayed in a Conti R","useful":1,"cool":0},"RPAR4mXMXi_yL0PNJZyYHg":{"text":"Stayed here during Essence Festival. It's been over 20 years since I visited NOLA and want","useful":0,"cool":0},"8nZJXhjVQBS3RiA_cX4Xbw":{"text":"This is a beautiful hotel which is located in the heart of NO.  If you are looking for an ","useful":0,"cool":0},"A_1P5twZ2lLWBBSX-AbbgQ":{"text":"Love this place. They are pet friendly and they actually remember my dogs names from visit","useful":1,"cool":0},"NWQ-77eDsMmnWnN6iDMOCQ":{"text":"Loved it!  I will be back next time I am in New Orleans.  Everyone was so nice and helpful","useful":3,"cool":0},"GbhKXrV0rfIBa-sd0YvK5Q":{"text":"You might catch a rash right just as you step outside the door of this elegant hotel, but ","useful":4,"cool":3},"f70yg3u85Wndcq9hJMlKSg":{"text":"This place was totally unacceptable. Location is flawless, the way they treated us was bey","useful":0,"cool":0},"KEtigB6aT8WXGP8LTjuqdw":{"text":"I got a great deal not knowing anything about the hotel and relying solely on the reviews.","useful":4,"cool":0},"oI8VuDSYRw1WLVHi9Onwaw":{"text":"Location, location, location!\nIt's a very nice spot, we landed a good deal online, and the","useful":0,"cool":0},"kReoqmO27vDIAVKlR2I-Cw":{"text":"Pros: Location, Courteous Staff .... \nCons: Old, small rooms, NOISY! \nthe location could b","useful":2,"cool":0},"I1h4kx1tn03uuXq9J9zdvg":{"text":"First of all let me tell you that if you stay at a property in NOLA on Bourbon St in the F","useful":6,"cool":3},"0B6kymVFhkTBufAfErGvkw":{"text":"I do live here, so I've only stayed at a few of the hotels in New Orleans.  But this one i","useful":0,"cool":0},"yqx0A2J7jxLryPEWW3XZgA":{"text":"This hotel was secure and beautifully decorated- fancy! It had a cool jazz lounge and pool","useful":0,"cool":0},"xzlwM68CxUdHSK7Gnn25GA":{"text":"Loved this place. Great location on Bourbon Street. Service from everyone was excellent. R","useful":0,"cool":0},"HlHAJTKNmrz41fpeRMQRGA":{"text":"Clean rooms, great location in the heart of the French quarter and right on Bourbon street","useful":1,"cool":0},"fBh-678kSq15Q6DAVbIKHA":{"text":"Our Road Trip 2017 to NOLA resulted in a very nice room.  The hotel is gorgeous and the pe","useful":0,"cool":0},"Ihtjnh-5_C1VxWaekTcf2w":{"text":"I must stay I was nervous about staying here due to some of the reviews, however I reminde","useful":0,"cool":0},"JumJR1klp50tc0gUq_myRw":{"text":"I am giving them 3 Stars because of the perfect  location on Bourbon! I went for my Bday a","useful":0,"cool":0},"m9ygcujsboURLT-iYx4ZGA":{"text":"This looks like a nice hotel, close to the action on Bourbon Street. Unfortunately, the re","useful":1,"cool":0},"R_FP6bZ8cxF5YNTJctyzWg":{"text":"The hotel is beautiful and well kept. The staff is friendly and helpful.\nI am giving the p","useful":0,"cool":0},"kW4o5_1mNWpH7IbIyBMgpg":{"text":"I love you Royal Sonesta.\n\nI had eyed you from afar, coming to New Orleans and shyly walki","useful":5,"cool":3},"4ep784wS_3YOr5McbYgY2g":{"text":"I did not have the opportunity to stay in their rooms.  But I did take advantage of their ","useful":0,"cool":0},"x-zb-pD1g5MULqKfeXpOXw":{"text":"I stayed here when I attended the Mid-South IASA: Insurance Accounting & Systems Associati","useful":0,"cool":0},"QbcbQWLWVEKpu6Fa-uVYZg":{"text":"Bourbon Street is under construction so there was a lot of commotion going on right in fro","useful":3,"cool":0},"GSSanJ6_zyPHS9Gb-oIYQA":{"text":"nice Jazz，great oyster and awesome drink. We had a wonderful night. The small garden and t","useful":0,"cool":0},"ft-Fg1YpMD8k6qrdaORKSw":{"text":"Nice hotel, and very accommodating to make sure the guests are comfortable. We were excite","useful":0,"cool":0},"_WkCYOWQl1j14QsTwb9jaw":{"text":"The Manager claims they do not allow smoking. I guess they do not enforce their own rules.","useful":0,"cool":0},"O_fBvrfJ0D0nUQViVM6f6A":{"text":"Having just returned from a few days at Royal Sonesta I am still high from the experience.","useful":1,"cool":0},"WLYVT2L8X6GtiYwtrSalig":{"text":"Along with the Monteleone this is the Gold Standard for Hotels in the French Quarter. Staf","useful":1,"cool":0},"URvXcn1xNy3FA8k7RBsGAg":{"text":"Great place to stay that's in the heart of Bourbon Street. Very classy and you can walk to","useful":0,"cool":0},"SeS_Q1vRxtcsbGK9lfCM1w":{"text":"Reasonable price, a good location, and nice hotel\"\n\nThis hotel is located on Bourbon stree","useful":4,"cool":3},"TdTxNO_8-PH1gd3EHZCIxA":{"text":"Great hotel on Bourbon street. Great location. Located on Bourbon street across from the s","useful":0,"cool":0},"QkepVavbw7FEyfy3HN0hbA":{"text":"Very disappointed with this hotel and will think twice of coming back.  I have been to 100","useful":3,"cool":0},"nBrO-fTegaUWgweTls2yZw":{"text":"One of the nicest places I have ever stayed!  The Royal was located in the heart of the Fr","useful":3,"cool":2},"Lh9w18V-rPfNFSd6cWjFsA":{"text":"Great older hotel right smack on bourbon street!   Right where I thought I wanted to stay ","useful":0,"cool":0},"G3Ns8IbSlvVyxHXPgUdFUA":{"text":"This was my second stay at the Royal Sonesta, meaning yes I would go back as often as poss","useful":0,"cool":0},"876JH6hRKg2EMoroxNFxcw":{"text":"Terrible! I booked this hotel because of all the amazing reviews. I was very disappointed ","useful":1,"cool":0},"ZqtxnIdmxCjUObNsH9kCfQ":{"text":"Had a great time in New Orleans.  I loved staying on bourbon street and having access to e","useful":1,"cool":0},"VWNzUfXDDD_UYxXXOxvdOg":{"text":"clean and nice pillows. cant say the same for bourbon street. be sure to have an extra $36","useful":1,"cool":1},"3kAJmSLQIoIutCuiCxJGfw":{"text":"Dirty, old, musty, dusty, yikes! After looking at about 10 rooms, we finally chose one of ","useful":0,"cool":0},"7YjSvKo0NXHxC8enJBXf0w":{"text":"I love it so much. We stayed for five nights. All of the employees were so great. The room","useful":0,"cool":0},"r9jLpc_hLn9oYahHsCjGmg":{"text":"my sister and i recently stayed at the Royal Sonesta and had a lovely time.  the room was ","useful":0,"cool":0},"z9TYJkwuaaHLXjdJnCm3mA":{"text":"Great location!  We asked for a quiet room and actually got one!  The room was really clea","useful":0,"cool":0},"I6dJutz19hEjPhVtjJTGHg":{"text":"I was actually really impressed with our stay at this hotel. After reading previous review","useful":3,"cool":1},"J41OMKwMpQ8KE9AhjRmx5Q":{"text":"Nice hotel.  Amazing location.  Love the courtyard!  There's a Pj's Coffee on the main lev","useful":0,"cool":0},"uWPfYPhBoS2q6KQQtfSwNw":{"text":"I've never been treated so royally in my life.  \n\nThe Royal Sonesta is a top-tier, old-sch","useful":9,"cool":3},"2wmRU5BGCHgmoyEA9c4OJg":{"text":"I was nervous when I saw the recent 1 star reviews but kept my reservation and I am so gla","useful":0,"cool":0},"1ZmGodfD6Zhwop2fNj7GiQ":{"text":"Great hotel!! I had a room with a balcony that led to the pool. I was able to order food a","useful":0,"cool":0},"diKSOs66sjHxlTkr2_zjgA":{"text":"I recently stayed at the Royal Sonesta with my sister. There are no words to explain how a","useful":0,"cool":0},"tBP8Z2dBuQvmC6diQVfMdw":{"text":"We booked a room through Hotwire last minute for $99/night. We arrived at 3pm and were tol","useful":0,"cool":0},"XUQxAPTmwRBZBdOmqyxg4A":{"text":"Very beautiful property! Highly recommend staying at this hotel right on Bourbon street in","useful":0,"cool":0},"nXFHKw8kmAc-I4jLcKiHtg":{"text":"This was our first trip to New Orleans as a couple and i wanted to experience the whole Bo","useful":0,"cool":0},"kCcg38ijKodEpHO_j9DNpg":{"text":"I didn't stay at the hotel, I just parked in the garage. Great ticketing system. Everythin","useful":0,"cool":0},"bCe7EN_GkhHo8B2KrfDlQQ":{"text":"You know I was going to only give 4 stars, just because I feel that I usually always give ","useful":1,"cool":0},"0nNilOBuKtTEqQCkYdAwog":{"text":"Extremely disappointed with this shady hotel. I cancelled my reservation to this place and","useful":2,"cool":0},"K8MkLkSQX3mxY1LvRYdL5w":{"text":"It's 1:15 in the morning and a maintenance man is trying to fix our door. The lock has bee","useful":0,"cool":0},"qQH6RM9GUQhM10RGK268fA":{"text":"My mother and I stayed in this hotel for a business trip of hers.  We opted for a Bourbon ","useful":0,"cool":0},"l_uPyJrRrzf06mtisg1E4g":{"text":"Great staff, great coffee shop & jazz club, great location. The rooms are nice but certain","useful":1,"cool":0},"ChKfaBrLzU-PA4ya2V69tQ":{"text":"In the room i am staying in there is nails sticking up from the carpet. When walking in th","useful":0,"cool":0},"TtpAHdqC55KL_ZF5D3Efkg":{"text":"We rented a balcony right on Bourbon Street last night. The location was fabulous and all ","useful":0,"cool":0},"lzr3Td2T3X7VTn65NSEtGg":{"text":"Beautiful hotel located right on Bourbon Street!! Stayed here while visiting NOLA with my ","useful":6,"cool":7},"jDkQ92-9rH50FhXMW0VWMg":{"text":"Had lunch. The staff are slow and seem to not care. The food was not good enough to make a","useful":0,"cool":0},"psF3m29fpXClPcQwnqqU1A":{"text":"I enjoyed staying here. The location is right on Bourbon St. Which can be a good or bad th","useful":0,"cool":0},"O4WAkm2z-it-axPRj79mhg":{"text":"Amazing hotel, amazing location, amazing staff and put that all together and you got yours","useful":0,"cool":0},"SOAshG_VJzDJw-b6r_KE5g":{"text":"Will never stay at this hotel again! It's right on Bourbon st. We decided to stay because ","useful":0,"cool":0},"icIHpvZHEecHSzaytFPJJQ":{"text":"On my recent stay here, I enjoyed the uniqueness of this hotel and the entire experience. ","useful":0,"cool":0},"tRMS7FHGcFsyYn_MHhOUuw":{"text":"Nice hotel with a fun historic feel.  \nAlthough when you are in the hotel you don't seem t","useful":6,"cool":2},"gbM6dT8lMLn370SVx4FezA":{"text":"Stayed here on my first trip to New Orleans for the Sugar Bowl.  Location, location, locat","useful":0,"cool":0},"z7_-hfxVuil7eq8BOMvqmw":{"text":"If you are looking for a  unique hotel in the quarter with great entertainment and dining ","useful":1,"cool":1},"p9wNbA2F_TRM3dT575FhTA":{"text":"I was in New Orleans for the night and stayed at the Royal Sonesta Hotel in New Orleans. T","useful":4,"cool":2},"tP9-Y0pAbYCr-s5iVaDQag":{"text":"We really wanted to like this hotel. When you have limited vacation time and funds for tra","useful":0,"cool":0},"mmwQQ0fiofhlOUfXyM5FlQ":{"text":"Walking into this hotel is just beautiful coming off of Bourbon Street.  From the front do","useful":0,"cool":0},"cBcjJdK3VBzJ-CgW3BrN8Q":{"text":"Excellent location. Service is ok. Might have been better if they had more staff to help w","useful":0,"cool":0},"uaNkiLybA0iiQ0yFALZH6g":{"text":"This was a nice location for my first stay in NOLA. The staff was friendly and very accomm","useful":0,"cool":0},"u9QsbFeo4WC3WIb6Yme82w":{"text":"The bar is amazing. Dropped in for happy hour. Relaxing jazz, mojito and alligator for $10","useful":0,"cool":0},"BeoIgZT0gOSmJkynBT-PfQ":{"text":"We stayed at the Royal Sonesta in mid April 08. We had just completed a week of helping to","useful":0,"cool":0},"vJZ4WzVNYpNejZoiP1YZ6Q":{"text":"Stayed here on a getaway weekend with some friends.  Really enjoyed my time at the Royal S","useful":0,"cool":0},"4tBXcJptW1HAbw37UaaN9Q":{"text":"Slice of Class on Bourbon Street\nVery nice hotel in the middle of all the action on Bourbo","useful":0,"cool":0},"69Ke0JvPy-xQpNYJ7i4huQ":{"text":"We had a good time staying here due to its location and the comfortable rooms and the beau","useful":0,"cool":0},"3LVKzB92bW784fJIG_djCw":{"text":"Just checked in and not here 10 minutes. \n\nCheck in was lovely and she gave me the option ","useful":1,"cool":0},"sgbGxRQF2xckhm36x5qLyA":{"text":"This hotel is beautiful. Located right in the center of the hullabaloo that is Bourbon Str","useful":2,"cool":0},"JBcI9mI52LTiujFGy7YZKw":{"text":"OK heres the skinny on this place:\nIf ya stay on the CLUB LEVEL... U R in the $$ the rooms","useful":4,"cool":1},"9VrummZs6r8FsUkUM-V_QA":{"text":"I'll start with the positives first. The staff and management were pleasant enough and the","useful":0,"cool":0},"8pWbv1U5PRYhNmsvKsfEmQ":{"text":"Hotel stay is a nice experience\n Security dose a amazing job of keeping the busy Mardi gra","useful":1,"cool":0},"x3s1Xvr9zBmZbwpENXA3zg":{"text":"There is nothing more important to parents happiness than when one of their children is ge","useful":5,"cool":3},"enz4PNWSa-5GUStec-u-jQ":{"text":"It's maybe not as fancy as it was when I stayed there in the seventies, and Bourbon street","useful":1,"cool":0},"EHxZijcwAQNvdjtovmEg6w":{"text":"Room is adequate but a bit underwhelming given the price. Some the services are unavailabl","useful":0,"cool":0},"QHQWPpl8bet1Cly29P6FzA":{"text":"Just a wonderful experience. Sure it is on Bourbon Street but you can ask for a room away ","useful":0,"cool":0},"lHTFHUOZlT9KqSjE2V9_Ng":{"text":"My wife and I stayed here March 23 and 24. The location was fantastic: right on Bourbon in","useful":0,"cool":0},"TqISHBRTHfAJPfSJLSVoww":{"text":"It was a very nice Hotel and the staff was so helpful and friendly.We had a good time.","useful":0,"cool":0},"6qlGsErvT9zv0pEmI7n_Kw":{"text":"Stay here Labor Day weekend in New Orleans. Last time I stayed here was around 20 years ag","useful":0,"cool":0},"wZocugi5W0sccdPUHIh7Vw":{"text":"This has been on my list of places to review for a few weeks.  \n\nI find myself roaming the","useful":0,"cool":0},"N_qDurfvuPeBtXm4TIii-g":{"text":"Always courteous! Never have had any issues except my loud neighbors but it's New Orleans.","useful":1,"cool":0},"ZEFSSWcgIiz7dh8dqBtllQ":{"text":"My husband and I arrived on 7/15 at 2am for our long weekend stay for his birthday. The lo","useful":1,"cool":1},"uXpA2h-505XaY3PqdFcTsQ":{"text":"I was here for a work trip, and excited to stay in the heart of the French Quarter. Upon a","useful":1,"cool":0},"TlgibycvcGYmXMW4wDZehg":{"text":"Disability Accomodations at the Royal Senesta Hotel, New Orleans. \nJune 2011\nDisabilities ","useful":3,"cool":3},"OCXKkXeyKtyMZEUu5Sdmhw":{"text":"The Royal Sonesta Hotel is a New Orleans hotel located right on Bourbon Street and a few b","useful":9,"cool":4},"6nFhztJFlgtBYJ9CUuTkcQ":{"text":"Unbelievable rooms and location. Staff was very helpful even upgraded our room over a smal","useful":0,"cool":0},"9EMH5Y6snI8OB5aKsFo_gA":{"text":"It might seem like a good idea getting a massive balcony suite right on bourbon until you ","useful":8,"cool":2},"RL_SzjubUGewVBJigxLKqg":{"text":"We have stayed at this hotel numerous times over the last 10 years! We love the location a","useful":0,"cool":0},"9UdUIZMShm_mCHWo6uufDw":{"text":"Beautiful hotel. Valet parking quick and efficient. Front desk, bell staff, and in-room di","useful":0,"cool":0},"ZkpDLc_dnuAWUoanmKA_6Q":{"text":"Would you like to immerse yourself in the Bourbon street experience without having to be i","useful":2,"cool":0},"qBifEfGq_g6QsiE3wKvs8w":{"text":"I Need to write to tell everyone what a great trip we had in NOLA. The hotel is beautiful.","useful":0,"cool":0},"zdF7qKf367Psekj2qymDOg":{"text":"I was so looking forward to spending my 50th birthday here.  I rented my bourbon street ba","useful":1,"cool":0},"TpEOmGs3wm9S9OssE8JqRA":{"text":"Second floor Room Directly off Bourbon Street.  I can attest to the fact that the street d","useful":6,"cool":2},"Sf9PfrBVPMN-1Jxlyzs-lg":{"text":"Room was total disappointment!! We were there 5/21 to 5/25/19. Hotel otherwise pretty good","useful":0,"cool":0},"P-gTub6eDiAIClIQWDHAww":{"text":"Meh. Very pricey for a tiny room, so small there wasn't adequate room between the bed and ","useful":0,"cool":0},"IEumEfmATsMSDnk9ozbEDw":{"text":"Very nice and clean hotel. Located right on Bourbon Street. The staff at this hotel really","useful":0,"cool":0},"PzsI4_aDZJU74WhusGML2Q":{"text":"This is the only place we stay in Nola and thanks to Raquel we will 100% continue to stay ","useful":0,"cool":0},"nYq3PlqzbOup3owAWwvykA":{"text":"We had a wedding here in January. The staff was great. The food was awesome. All of our gu","useful":2,"cool":0},"4VSg2QVNLTBKl3pxP0k5cA":{"text":"Quite literally the worst cocktails in the French quarter. There's a one drink minimum at ","useful":0,"cool":0},"bi7uouGLagZyrYW774ZDuA":{"text":"Nice hotel in the heart of Bourbon Street. Staff was attentive and helpful when needed. St","useful":0,"cool":0},"tlLZBSTqwXli0veVSUbKuw":{"text":"Just did a walk through to soak up some culture...ultra high end and they take the time to","useful":1,"cool":1},"ZsAuIV-j5CN8XvvyAvL-HQ":{"text":"Stayed here Sunday night June 5th.  We decided on a balcony room overlooking Bourbon St.  ","useful":1,"cool":1},"Z8fGF9yJc1QOuopyWT-A0g":{"text":"If you want the all around Bourbon Street experience, the Royal Sonesta is a good hotel th","useful":4,"cool":2},"DrxefzBA4cfECe6M6VkNbw":{"text":"First time in NOLA so wanted to stay on Bourbon St. The hotel itself was fine. The staff h","useful":1,"cool":1},"S1boflXWDt3Yq-72gt9-iQ":{"text":"Staying at the Royal Sonesta was a truly great experience. This hotel feels like New Orlea","useful":4,"cool":2},"AGKENStQKu5cgKPdeVRaVg":{"text":"This place is nice but very old. The rooms are tiny. The amenities really stink. The locat","useful":5,"cool":0},"6hiuUV7YdID1u-Q-s7WVzA":{"text":"This review is a little delayed, but we had such a good time staying at the Sonesta in New","useful":0,"cool":0},"uvOcULjyHqD51kYT2AHrew":{"text":"I got married in New Orleans and had my reception at the Royal Sonesta.  \n\nI sent this let","useful":3,"cool":1},"vmeTQ2gLvuRyJsKsVi_yLA":{"text":"This is a tired hotel located right in the heart of the action.  If you are going to parti","useful":3,"cool":0},"QY4qII6o-5LQBtioz1zyRw":{"text":"We stayed here for a weekend in December.  It was our first time to NOLA and we had a love","useful":2,"cool":2},"6Q-LT4VSVhrWY2cUz4pMdQ":{"text":"After a perfect trip to Nola for a friends spectacular birthday celebration. I think back ","useful":0,"cool":0},"La4turb8ZmHCbHB3VSTV_w":{"text":"Came in during Memorial Day weekend to listen to jazz and hang on for the midnight Burlesq","useful":1,"cool":0},"kuYd0jPs1wFMN_lNpAx1VQ":{"text":"Right on Bourbon Street with paper thin walls between rooms and the street. The kindly pro","useful":0,"cool":0},"Jpo-LG8CGGUyC6FMp-watw":{"text":"Beautiful hotel! Restaurants lovely.  Hotel staff - hard to find when needed. Concierge - ","useful":0,"cool":0},"sMvDTNgq9UfPoT_O0MX_EQ":{"text":"Staying two nights. Only been here a few hours and already disappointed. The bathroom is d","useful":2,"cool":0},"ne_Jculer35A1U0mBsFd0w":{"text":"This is a beautiful hotel in a good location if you enjoy the Bourbon Street environment, ","useful":0,"cool":1},"M4J-r6AeYEDEHjJetbXR0w":{"text":"We hosted an awesome balcony welcome party at the Royal Sonesta balcony suite on friday ni","useful":1,"cool":0},"6_vsvW1mF5iaKx-n84X3TA":{"text":"Beautiful garden, amazing restaurant, jazz club and cozy breakfast place with fresh local ","useful":0,"cool":0},"e7ZySDRPMKUhpqQivBvmTg":{"text":"Royal is how you feel.  A beautiful hotel with great security and friendly hospitality fro","useful":0,"cool":0},"uVS6k7u3hDyG8mt4Q02U0A":{"text":"Just back from staying here four nights as we enjoyed the French quarter and attended a we","useful":3,"cool":1},"TOAK6QqvxoA-urvVTUjI2A":{"text":"Beautiful, beautiful, beautiful.  We stayed here during Christmas time and the hotel decor","useful":0,"cool":0},"GP38z02M4alLCYxOOh9iZw":{"text":"This is a beautiful hotel located right on Bourbon street. I've stayed here during the sum","useful":3,"cool":2},"74eJzXyYzHYcyg3V8rAwBg":{"text":"My new husband and I went for a long weekend to New Orleans to celebrate our honeymoon and","useful":6,"cool":0},"IOF8zqGvPrAhgIB2oj2v8w":{"text":"This is a fantastic old hotel on Bourbon Streeet, after a long day and night its a nice co","useful":0,"cool":0},"2tTwtIcxVLDjVT4TRYWbPA":{"text":"Hotel is currently being renovated.   Made a mistake of not booking our room directly with","useful":1,"cool":0},"E9t5QfTqj4kNbWvSoohvLw":{"text":"An update to my last review:\n\nWe stayed here again for a quick girls trip. With the points","useful":4,"cool":0},"NIInLBUjCx65NPvV84GVpQ":{"text":"I loved this place! Our stay was absolutely amazing. The hotel staff were such kind people","useful":0,"cool":0},"k5jdw-ex0p-Ny8h9bO_z2g":{"text":"I stayed here for 2 days with my fiancée and had a wonderful experience. Very friendly sta","useful":0,"cool":0},"NMfdxSRH4-0OP2q5rA4CEQ":{"text":"For my first trip to New Orleans, I knew I wanted to stay in the heart of the action.  The","useful":5,"cool":5},"UChMASHkMp4iBmSMQiQPPg":{"text":"I loved everything about this place! The location, the service, the room, the hotel itself","useful":7,"cool":6},"gz0J3-dkfrIazVli9ohXIg":{"text":"We stayed here over Christmas and Im not sure I would go back...I expected more.\nThe Royal","useful":0,"cool":0},"uUXuEMij7HiCBhp6HiG1Rg":{"text":"I wish I could give three and a half stars, but I cannot.  The place is conveniently locat","useful":0,"cool":1},"wn3MEAtRRs5RZ05aXP6VKQ":{"text":"Currently staying here and I felt obligated to write this review after my last two experie","useful":4,"cool":2},"ma2uDqOsY6ossM2An8QN4Q":{"text":"If I'm being honest, I was fairly disappointed in this hotel. I only glanced at the overal","useful":5,"cool":0},"Zpc3-d77wvIqx6Ze2IZ-9A":{"text":"Sorry, but experienced the most vile service at the pool area where all bar tenders, with ","useful":0,"cool":0},"uziFG6NobsUEGICI0mRAJA":{"text":"My husband and I chose the RS for our wedding ceremony and reception because of the locati","useful":1,"cool":0},"vB4XY8cq8f7_GMP_XjOnCQ":{"text":"Since our experience was brunch, not the hotel itself, I hesitated to write this review. H","useful":5,"cool":0},"dWl3mQZguTrN_tWWY8Oesg":{"text":"It is NOT a 5 stars hotel. \nI am so sad about this experience and never never try it again","useful":1,"cool":0},"QccinkqZlU7aKt7UfywpZw":{"text":"Beautiful hotel and friendly staff. Jasmine checked us in and assisted us with finding the","useful":0,"cool":1},"ByQE0w_ibwGltrOhGVYLEQ":{"text":"I am extremely grateful for the kindness I received from Malcolm & Cesar\nThey greeted me a","useful":2,"cool":0},"vXbKla5QZojS3wfWqiNDJw":{"text":"I must say I was very impressed by the staff of this hotel.  There were a few bumps due to","useful":1,"cool":0},"XENUKT4KzStvx8LSkD0j9g":{"text":"So I gave this hotel 3 stars since some people will really like the location and some peop","useful":2,"cool":0},"tVEJZD-1Rut39rMMmucMAQ":{"text":"Very nice hotel ideally located right smack in the middle of Bourbon Street. If you need p","useful":0,"cool":0},"k-nUIbqX22fkEUdObBbRfA":{"text":"Our experience was pretty awful.  First, the guy at the desk tells us that the deluxe king","useful":1,"cool":0},"jaLcIEO6lFmaL8bwwnmUew":{"text":"My wife and I stayed at the Royal Sonesta 4-17-4-20 2019. The hotel is beautiful and if yo","useful":0,"cool":0},"rx6WUsSuRwensYKaCskadA":{"text":"We spent 5 nights there. It was great. Rooms very clean, but small. We upgraded the room t","useful":0,"cool":0},"npsW-4txZZdvc4rs1Jk_6Q":{"text":"Would you believe that after leaving my number asking to hear from the General Manager and","useful":4,"cool":0},"p4emTcn2d6p5o1er9vbeyQ":{"text":"The hotel is of course beautiful, but we came here for the Dining in the Dark experience a","useful":1,"cool":0},"jt5aHYOnk_n0mOYYjqb8qQ":{"text":"Hotel was very elegant, and polished. 5 star hands down for the cleanliness of the rooms a","useful":3,"cool":0},"zBIBqmqJ5QoZ6Msawmc80A":{"text":"Thanks for the PC response but Yelp is forcing me to say more so not impressed, overly lou","useful":2,"cool":0},"q1JZDKv7zYS0RdRyVQRwFw":{"text":"Good experience, they have coffee, shower caps, iron board, shoe shine in the room, decent","useful":0,"cool":0},"XhBDueXL6ebGRuvw2PmjMw":{"text":"I loved this hotel..\n\nYou walk in and you are at the heart of the French Quarter.  The sta","useful":2,"cool":0},"1pNA5j_E5Givj_t00eGoaQ":{"text":"I have stayed here over the years and always enjoyed it. Amazing Bloody Marys in the bar, ","useful":0,"cool":0},"9uRqUVpTIBgZTEfdPx06UQ":{"text":"I've stayed in many places and have traveled quite a bit, and I can say hands-down this is","useful":1,"cool":0},"DA_Dkj3Owu2_aGQ1bBi4Dw":{"text":"My family and I decided to decend upon New Orleans for the after Christmas break.\n\nThe req","useful":2,"cool":1},"0sVKyGm-_cko38eYfD8ntQ":{"text":"What can I say- The Best! Stayed here from 12/20-12/24. From the minute we walked in, unti","useful":0,"cool":0},"cYn4m-QPNQ8QMIiXlMNx2A":{"text":"Nice hotel, friendly and helpful staff, fun pool and convenient location. I ate at Desire ","useful":1,"cool":1},"iMMpmyZRWvpfF3gViQ59Aw":{"text":"I am 5 nights into a 7 night stay and this hotel is sooooo nice.  The staff has been super","useful":0,"cool":0},"z7e63z7ZSH3aZ_7e-umtxA":{"text":"Impeccable customer service from Russell, the Concierge. I'm in Los Angeles and my Manager","useful":0,"cool":0},"71F3kccxNBuumyu4mk1q6w":{"text":"Loved royal Sonesta. We spent three weeks in Nola and chose this hotel because of the loca","useful":0,"cool":0},"3nNYQiYan0mTK1nQNCNgig":{"text":"Horrible, Horrible experience. \nFrom early morning time(6am), I couldn't sleep at all. \nHu","useful":1,"cool":0},"TkwfkhuMtj1ssbMo0iC38A":{"text":"Loved the location! Great first impression. Awesome location, right in the middle of it al","useful":1,"cool":0},"T5hPsgnoVDkVdODkNEAe2Q":{"text":"Not very satisfying for 200+ a night. \n\nThe room was not very clean, very worn and beat up","useful":0,"cool":0},"tPus-Xc1OJWhS10WTfbMPQ":{"text":"We stayed here for 4 nights this December and it was a beautiful hotel. Perfect? No, but a","useful":6,"cool":1},"Xi3axwoP-6p512gCfzAaIQ":{"text":"I absolutely love this place! The staff is soo nice, I originally was suppose to have a bo","useful":0,"cool":0},"M7EJAt5YJlbpbBBQLOWqMA":{"text":"Did not feel comfortable with check in process guy at front desk asked if I would like to ","useful":0,"cool":0},"KbAPopoVliUgBtLLvJGjag":{"text":"I've stayed at the Sonesta in years past, and it's understandable that all hotels are doin","useful":0,"cool":0},"wQDB89QCjpwr_TGJQv3Q-Q":{"text":"This was a great all around hotel. The room was clean and the hotel was located in a great","useful":1,"cool":0},"bs-v9wDrKtXF20wMqZcMsA":{"text":"If you want to be on Bourbon in the middle of it all there are only four hotels that face ","useful":10,"cool":5},"k90-b5oLDRK3coEMAivdhQ":{"text":"This place is a dump. I checked in at a normal time of around 4. I was supposed to get a k","useful":3,"cool":0},"yGetJl1Gaav9pCbkz1Sc-A":{"text":"What a lovely hotel.\n\nHere are the perks and keep in mind we were two gals sharing a queen","useful":12,"cool":6},"e5eZWdTKFR8BYEwLDu2_xw":{"text":"ExPensive\nGreat location \nBalcony loud\nComfortable small room\nShower terrible low pressure","useful":1,"cool":0},"PMlzYjxyNlx0dwvoWkjcGQ":{"text":"We met Jacari the front door bellman, we were immediately impressed.  Truly a great person","useful":1,"cool":2},"w2Pl4Zulzlb0H1-G86I8eQ":{"text":"I have been Coming  here for 47 years, we spent our honeymoon here, not bad since they are","useful":6,"cool":6},"N83MTPLZkgzkOuVpEkNXgQ":{"text":"Nestled right on Bourbon St. in the heart of the French Quarters, this beautiful hotel off","useful":0,"cool":0},"AXFqnYC90IN5GzZQyEoiAA":{"text":"This hotel was beautiful, cozy and quiet. Our room had an interior balcony that looked out","useful":0,"cool":1},"_4qR2mmxQ96O3Cj3luL_8g":{"text":"The room and location was really nice, we loved the pool and having a coffee shop so easil","useful":5,"cool":4},"hvqcnRaH2A_61XxG3uW3iQ":{"text":"We had a great stay, and we'd stay again.... Why you ask?  Read on....\n\nFirst, the service","useful":5,"cool":5},"IhbRsH4f6hvOy0qFwHMXpA":{"text":"My best friend and I stayed here during a recent (Feb/March 2016) trip to New Orleans and ","useful":2,"cool":0},"msBO59dvkYqMwwfD0edwhg":{"text":"I LOVED this hotel. For one thing it's really beautiful. The courtyard is lovely and we ev","useful":1,"cool":1},"rU0zzIrFGno3JBq1guGm4w":{"text":"Stayed here during our annual Food Blogger's Conference. When they close off Bourbon stree","useful":16,"cool":9},"vThT94SvZ9s98lJZ2zroOw":{"text":"TERRIBLE SERVICE - NOT WORTH IT!  The only one star and bad review I had to give this week","useful":1,"cool":0},"uvPREpYJ2K7yM_YrxMPi7w":{"text":"Not so great. At check in I requested a quiet room. I was put in a filthy room at the end ","useful":3,"cool":0},"F94ymq6CZ65UF2671fUl3A":{"text":"Where do I start? I got to New Orleans and we stayed at the Roosevelt, which is an amazing","useful":0,"cool":0},"DKNxC1ZvkLjS3UUmXSBPYA":{"text":"After a less than positive experience at another hotel when they were overbooked, we got t","useful":0,"cool":0},"vUxRF6TsZdwMZgTgR1jhsw":{"text":"Wow I could not ask for a better experience. \nThis is my second year booking with this hot","useful":0,"cool":2},"bD39dtnYR0QUO12DKJy2MQ":{"text":"Short of it: not worth $. Small, semi clean rooms. Paying for location. Nothing special. \n","useful":8,"cool":0},"_UKGMfkViDM8elHY23_KVQ":{"text":"Do not stay here. They made an error booking our rooms and charged me for an additional ro","useful":0,"cool":0},"3Ao1Jx5BEjnyOblgLrrOPQ":{"text":"Highly recommended hotel around French quarter. Clean room , comfortable and amazing staff","useful":2,"cool":1},"f0V9oWd13zH6vxCepYsDDg":{"text":"There are lots of luxury hotels to choose from in NOLA. We've stayed at Windsor Court, Rit","useful":1,"cool":0},"xMuqGVa3JLRxcESAqNDQuA":{"text":"This hotel has been one disappointment after another. It couldn't have started worse than ","useful":3,"cool":0},"HoXbZ4ZM-60wgLnPH-b-bA":{"text":"Don't use the concierge. They booked us on the wrong tour twice and ruined our trip. There","useful":0,"cool":0},"fJHhKk4zfh_hJb0XCgCyYg":{"text":"Sadly, this will be my last stay at The Royal Sonesta. After many enjoyable years, this vi","useful":0,"cool":0},"2mAxdbMIJiKYhYt-9YIPRA":{"text":"We arrived on Easter Sunday at 9pm. I had booked reservations back in Feb. Went to check i","useful":1,"cool":0},"NouVXztMXHnJZhvL6ESLsg":{"text":"Beautiful, historic hotel located in the heart of Bourbon Street. The hotel is about 25 mi","useful":0,"cool":1},"PfAFsAn1-HPgMKSqwVC62g":{"text":"Life is about learning from your mistakes and trying to learn about thine true self. Like ","useful":0,"cool":0},"OeSpKYrJUdxZ_TpK5JmvRA":{"text":"Beautiful spacious 2 bedrooms, 1-1/2 baths, with full kitchen. Dog friendly. Outdoor pool,","useful":0,"cool":0},"3hU8kA1qG6-77bXIRVXikg":{"text":"My wife and I stayed here for our anniversary April 15th 2014.  We started off on a living","useful":2,"cool":0},"GPqIJ9J8nW7lpLl9TA-Nvw":{"text":"My dad stayed here when he visited me last month. Since I'm not a fan of Bourbon St. overa","useful":3,"cool":0},"5wIDsqm2vDiomWSpR1XVuw":{"text":"Amazing place, beautiful pool and rooms, staff is very friendly","useful":0,"cool":0},"Oi3BZBANVOLoGktk8P28NA":{"text":"Celebrated my 70th birthday, was not able to sleep on the Bourbon St side, asked to have m","useful":2,"cool":1},"IGnqldHy2jj-Vzz6J7a4Yg":{"text":"So, I have stayed here in the past and found it to be a great place. Made reservations to ","useful":0,"cool":0},"zpzNEpM4AtOKg5LKJfjgRg":{"text":"The very worst customer service I've ever experienced in my life! In town for a two-day co","useful":0,"cool":0},"gDBv6lf-ikcijcMufYuUbw":{"text":"We stayed at the Royal Sonesta over Christmas break for a family (parents, grandparents, 3","useful":0,"cool":0},"73xxHljnTrRsKB4FKc-3Hg":{"text":"New Orleans is not all about the French Quarter. For first timers, however, it is the plac","useful":8,"cool":4},"SLNZqMjTMbq-MdtoOXcnpw":{"text":"Beautiful hotel, the lobby was like walking back in time- the woodwork was amazing! Rooms ","useful":0,"cool":0},"l6ZGvCOVMagN97hxDWy4QA":{"text":"Stayed here in early December. \n  The good: Lobby was impressively decorated for the holid","useful":0,"cool":0},"knwYxBjUqZ3Y8pq4ErhxQQ":{"text":"This is a very nice hotel with a heated pool right in the middle of the quarter on Bourbon","useful":0,"cool":0},"piWfM9RObWLp2fhjC35cvw":{"text":"I had very poor experience here. For 2 days no one came to clean the room. Even than I had","useful":1,"cool":0},"yVhVBZY3f0o6uOiCsX_i3Q":{"text":"We had the most amazing experience!!! They saved our honeymoon!!! After having a HORRIFIC ","useful":0,"cool":0},"puyo09nuP-sBV2vIc8YoeQ":{"text":"Beautiful hotel and it's perfect if you want to be at the heart of the fun on Bourbon Stre","useful":1,"cool":1},"9Krq7hOQAoPNlQu7krWoHQ":{"text":"It's a nice hotel, but not $380/night nice. Luckily we got a Priceline deal for $200/night","useful":0,"cool":1},"2nFVI_0b8QNvLXC0hYXdtQ":{"text":"Stayed here for 6 nights for Mardi Gras.  We've stayed at a decent share of hotels in New ","useful":3,"cool":2},"HEedfRyHcoBfJ2b7Y91IXw":{"text":"Intensely noisy hotel, particularly for the price. We got an interior courtyard-facing roo","useful":1,"cool":0},"87w81_rge5USPlKUdrjpwQ":{"text":"Run in the opposite direction! I paid for my room via priceline. When I checked in, the fr","useful":0,"cool":0},"pP4EIZ23ZrV7mw46RMGUHQ":{"text":"If you are ever in New Orleans as we were during Christmas season a must visit is the Roya","useful":19,"cool":13},"F2fmEm2YNvuDkRDRXUJ8mQ":{"text":"In the spirit of things we thought why not immerse ourselves as this hotel is right on Bou","useful":1,"cool":1},"sfXmkSAg9E5K6Yr4eeqBPA":{"text":"Visited NOLA and the location of this hotel being on Bourbon street is so convenient. A be","useful":0,"cool":0},"_h2xl8f3mYKW8bRSE-OFlQ":{"text":"April at registration is the sweetest and so welcoming to New Orleans. Nothing like starti","useful":0,"cool":0},"KEq3Zyx0bIQdFV-p02kAXA":{"text":"This hotel is the perfect location right in the middle of everything. Shops, bars, restaur","useful":0,"cool":0},"ZK0rqe9X-19vAcUzQqRgXg":{"text":"Wonderful historic hotel. Great jazz bar and perfect location. My only issue was the balco","useful":1,"cool":1},"G7KUPWrtw_H35PpY4HVIaA":{"text":"This hotel was a complete delight at every turn. The staff makes you feel as though you ar","useful":0,"cool":0},"KQMCJaTZ5lpB-FSt1QXquw":{"text":"My wife and I stay here 4 times a year as a quick vacation from St Louis and as a result a","useful":2,"cool":0},"EtzZiWkr1j4CuWuzxMKaBg":{"text":"We are currently staying here for our work conference and the stay has been incredible! Th","useful":0,"cool":0},"TyjEuajuv_6E6Lq3OajEsw":{"text":"This was my first trip to New Orleans, and I'm glad I stayed at this hotel for it. From as","useful":3,"cool":0},"gymEJfDldQ40Danq_Cbc3A":{"text":"The hotel was clean but hot water was an issue. 3 out of 4 days there was none.  Staff at ","useful":0,"cool":0},"uEOuCMQ57UMbflqPnFOs3A":{"text":"I had a terrible experience dealing with the management of this hotel. I had to cancel my ","useful":2,"cool":0},"PZw-D7vh2gIo8iTYGOZhyQ":{"text":"What a horrible place. Front staff was so rude I did everything to avoid them. One of them","useful":0,"cool":0},"CrHjBMjptvSBO6ih6nVgzA":{"text":"This hotel is in the best location on Bourbon Street. The staff are so helpful, kind, cour","useful":1,"cool":1},"6kWaOQzEwtfoIcFU5bDKKg":{"text":"Extremely unsatisfied with this Hotel. When I spend as much as I did for a Hotel, I expect","useful":0,"cool":0},"pNqh89KSaKSgZR32G0h5uw":{"text":"We chose to stay here because of the good reviews here on Yelp. I first discovered the hot","useful":2,"cool":0},"PpUcoipdyAHoogVAoiK6vQ":{"text":"Great place to stay! Superb location. So easy to get back and forth to Bourbon Street and ","useful":0,"cool":0},"T71IhFQBDe8hX9iDb4BAcw":{"text":"So many people sitting around asking for money or smokes. it's way too much For the price ","useful":0,"cool":0},"lHtK1SBX_tr7Mh2-QDAhAw":{"text":"The worst hotel I've ever stayed in. \nAs this was a girls trip and also a birthday celebra","useful":1,"cool":0},"k8JPyG8Cdg_Lvd11RT_yTQ":{"text":"This hotel has to have the worst customer service I have ever experienced!  Would definite","useful":0,"cool":0},"VOTICWCu2S7SsdrOGc1BIA":{"text":"Located right on Bourbon street! We took our two teenage kids to celebrate my husband's bi","useful":0,"cool":0},"LhOwZ2lN9Df9SVMWUSGgrQ":{"text":"I attended the hotel for a conference  and overall I have no issue with the hotel itself. ","useful":1,"cool":0},"RP6JNLTTsYKda4S6Ygspxw":{"text":"Considering I paid 320$ for my room, it sure would have been nice to be able to go to it w","useful":0,"cool":0},"MKZNZhmFddFFLQK_pe43dw":{"text":"Being a @Kimpton hotel regular, my expectations are very high when it comes to hotels. Thi","useful":0,"cool":0},"AZPxPliwmOy7nGIVasp3VA":{"text":"If I could give this hotel no stars, I would. I have been back and forth with hotel staff,","useful":1,"cool":0},"_g79bzOsW87xeHsyzv5sdQ":{"text":"We have been staying here for years, as a family.  12 of us.  I just had the most insultin","useful":1,"cool":0},"xRwSHg4AnfwX1pNidBMQpA":{"text":"I booked the king bourbon balcony room and stayed one night (3/31/19) . When I arrived I n","useful":0,"cool":0},"bDBDOGmgzogB0Tvh73qdJg":{"text":"Loved our balcony unit and the dynamic it added to our trip. We sat out there for a while ","useful":1,"cool":0},"Ti43A_fkA2LT9sQE339FOw":{"text":"Paid 1850.00 for a balcony room over bourbon st.for Halloween that I had to reserve in Feb","useful":0,"cool":0},"I-G7GeVxQRoWAMIBBqpRrg":{"text":"Location!!\nRight on Bourbon Street and an easy walk to the tourist areas or the street car","useful":0,"cool":0},"_xLHDdGBuJdX-zPcuRZQpQ":{"text":"Ok, so this place is a disaster. We were given a room with a walkout under the stairs righ","useful":0,"cool":0},"faOBVsASYTWjZcBwyoKngg":{"text":"Walls are paper thin, pillows were pretzel dough, great location and jazz club was cool, l","useful":0,"cool":0},"8-X6gACx-A88_lpD_tcfUQ":{"text":"Beautiful lobby in a great location!  Located on Bourbon Street, Royal Sonesta is right in","useful":3,"cool":3},"V9I2hbS8gteXdv-H8AsxrA":{"text":"The staff was very friendly! Lovely gentlemen to help you and very cheerful. The reason fo","useful":0,"cool":0},"rlhDeiDq9Mtf1TausfuKdg":{"text":"If you want a place with a balcony over looking Bourbon Street, then this hotel at least h","useful":1,"cool":0},"eWr7-UUV2CZ-fxh_PDmDQQ":{"text":"This place is beautiful , we went around the holidays and stayed a night I booked a side s","useful":3,"cool":2},"P9wNqjq-XlxxsrqYoun-NA":{"text":"This was a very nice hotel and although I didn't stay here, I can say that I'm SHOCKED thi","useful":2,"cool":0},"qvA8mNLjPrvzSYNnKdIFEg":{"text":"Location, location ,location! If you're looking for a hotel within the French quarter, loo","useful":18,"cool":15},"Uu6z28TTQMNCdF3ZkD-LZQ":{"text":"This hotel goes beyond to make you happy and comfortable. The front desk employees are so ","useful":0,"cool":0},"JJbzr7gsHgvWQXkIw32DFA":{"text":"I liked the room, the location and the public spaces a lot, but had one major issue that o","useful":0,"cool":0},"7QseMu7W3lFU0g7hgnVRWw":{"text":"This was my first stay here, but my 9th stay in New Orleans.  Previous stays were on club ","useful":1,"cool":1},"iNvAzi3lRb7tKFPZeBaGkg":{"text":"This was a beautiful hotel and the customer service was excellent. Right downtown and clos","useful":1,"cool":1},"GCE0CFnDghVu9cul7cZ-8A":{"text":"This is our go-to hotel every time we are in NOLA. Located right on Bourbon Street with ga","useful":0,"cool":0},"yz8FN0vRJ0PEH4lTkkA75Q":{"text":"This is a very beautiful hotel inside the lobby area! The pool is a pretty area as well - ","useful":0,"cool":0},"DRoM0ix31_kxHj0AO3zTQQ":{"text":"My first time traveling since COVID started, and let me tell you the Royal Sonesta was saf","useful":2,"cool":1},"NZ5qorfSdQPeesWFD-bjog":{"text":"For a hotel on Bourbon Street, you can certainly still escape! When I checked in, I was as","useful":2,"cool":0},"wRcaO6ewtpZ0ZvWXF7Z4Gg":{"text":"Awesome hotel in the French Quarter! I was horrified when we pulled up in our cab - the lo","useful":7,"cool":1},"vKFUhcnWtCOAV5IQKprr1g":{"text":"Lobby: elegant\nRooms: spacious and clean\nLocation: convenient\nNoise level: loud\n\nThe front","useful":2,"cool":2},"SpW1OIWXRgxpUvTWptdIAQ":{"text":"wow this place is an amazing place to stay at if you are in the French Quarters. This plac","useful":5,"cool":5},"k9RyuiTJBfs4ia2Qst7vcw":{"text":"After my previous review, I was told to reach out to Malcolm, who has also not responded a","useful":1,"cool":0},"ctEk6iIPWcwNclLtTVYwcw":{"text":"Ok... I'm going to drop some pearls of wisdom after  my 3rd bender vacation on Bourbon Str","useful":4,"cool":3},"jFPHtBR173HGx2n238BOIA":{"text":"One of the best hotel stays I have had.  The service is impeccable with the staff going ou","useful":2,"cool":2},"f-jQuu9PbkTPCv8heveXIg":{"text":"My experience at Royal Sonesta this time around was not pleasant. Things started out reall","useful":3,"cool":1},"YrlxwyNe8uDC4ziOGTIjZw":{"text":"Nothing much to say as about this place, except that it's on Bourbon  street and it's not ","useful":3,"cool":2},"5-1K-CbRpbnN4-DIutFB8A":{"text":"When we arrived the reception said they were sending housekeeping to do a walk through and","useful":0,"cool":0},"_sOK-vA96qrI4hNAT58U_Q":{"text":"Tap, tap,\nTap of the kids \"playing\" plastic buckets radiate thought out this hotel.  So ma","useful":2,"cool":1},"q9kpIdRjbV5lrLKVKhLp-Q":{"text":"House cleaning does not wear the mask properly. She's going into every single room to clea","useful":4,"cool":1},"QG7bGTZmA5BSQvJ7notfpA":{"text":"I'm changing the review score due to the hotel resolving the issue but still not a 5 due t","useful":5,"cool":5},"7920gprKabX20lROg6WEdw":{"text":"We had a lot of issues with this hotel.. in fact we decided to check our after one night.\n","useful":3,"cool":0},"31C2wxJ1Qkg0M_UvXW85dQ":{"text":"My boyfriend has been staying at this hotel for decades and even knows Malcom the doorman ","useful":1,"cool":0},"PXc2KLOZb_lJMhpb-UURNQ":{"text":"GORGEOUS Decor!! With Balcony views that faces the 'Heart of French Quarter!' From Conti t","useful":15,"cool":15},"U9-PU7Ql8UBzzjH_2r785A":{"text":"I want to start this review with the person who made this experience 5 star.... APRIL is b","useful":3,"cool":1},"n1vTSVmLVroqe1xch7thsg":{"text":"I'm just returning home tonight from a three-night stay in New Orleans, and I'm about to g","useful":6,"cool":2},"UwPN0viEzwPgOCyVQejb5Q":{"text":"We booked a balcony room with 2 beds for over $300 for one night after the awesome 3 Doors","useful":1,"cool":0},"g2bj7j7rGieYD0Rwf8BRdQ":{"text":"I was not happy with my stay.  At check in the hotel said there would be no room service. ","useful":0,"cool":0},"-Uo0F-BOi9LgRFQVCn88wg":{"text":"Book a room.  We stay here 4 times a years traveling to my wife's hometown in Alabama.  It","useful":0,"cool":0},"QWV7REw0CZ3ucy8OLrUYXQ":{"text":"Since we are in the hotel every day at 3pm the Fire Alarm is tested in the hotel during at","useful":4,"cool":0},"OMjqhM61FfboMW9IJMLjMg":{"text":"I LOVE this hotel!  We've twice now and both experiences were wonderful. They have the mos","useful":0,"cool":0},"amOu_4-fxWnCJqSiKH9DZA":{"text":"The hotel was SPOTLESS!  Fresh coffee downstairs was very convenient, along with muffins a","useful":0,"cool":0},"wFOsRCjKeJ4o_9xI1ma61g":{"text":"What a great place.  We just had an excellent stay here for a well needed R&R break.  Righ","useful":0,"cool":0},"1JLkZbGU1A91sfrBbW6AWA":{"text":"For the cost, I definitely expected a lot more.  For the good: the best mattress and pillo","useful":0,"cool":0},"kUZCJxXc5iFmQ4uyCIhuug":{"text":"We absolutely LOVED our stay here!! My husband and I came for our anniversary for our firs","useful":0,"cool":0},"3PrVUFN9eViIgUib2v-S6g":{"text":"I took my man to the Big Easy to celebrate his 40th, and our stay wouldn't have been nearl","useful":5,"cool":3},"-4_Iyejm3QyDOevWItYxyw":{"text":"Horrible experience. Stayed here while trying to get some cool air from Isaac's destructio","useful":0,"cool":0},"HkNul-r-V8_7zQsNqDRJSA":{"text":"Found a bug on the plate of my room service and squished it.\n\nHotel did comp my meal and b","useful":1,"cool":0},"w1wJ5Y1Y6vYZPdUr43BB0Q":{"text":"Everytime we visit New Orleans We stay at the Royal Sonesta. We been coming here for about","useful":1,"cool":0},"VD5ExChiCVmYjD5Ugw-SQA":{"text":"This is the best hotel on Bourbon St. Its right in the center of the action. The staff was","useful":0,"cool":0},"B-8bGE4ScJyPvqVKx3Vwwg":{"text":"This was the best and worst vacation at the same time!\nI planned this vacation months ago ","useful":3,"cool":3},"2EqQc9WMbLSeupu0WW4b7Q":{"text":"Why you should NEVER support Irvin  Mayfields jazz club. He stole millions from the childr","useful":0,"cool":0}}