{"rNrCFzEwMkHcXzulnjLobg":{"text":"Amazing !!! As a vegan this was the place to be. Crepes fresh and made right in front of y","useful":1,"cool":1},"XhHEw7mo0951jeGR9UKbSQ":{"text":"Business contacted us to let us know that the location they were at previously had given o","useful":1,"cool":0},"yraan7EiyvSNcHfxizU7iQ":{"text":"Stumbled upon these gals and needed something filling and simple. As it turned out these l","useful":1,"cool":0},"TsT2wo5ZElnpuSO_29Ez6g":{"text":"Amazing food! All the crepes looked so delicious and they are cooked fresh right in front ","useful":0,"cool":0},"hgd3L33a0cvgm5OJmHMYRA":{"text":"So very good. I built my own with strawberries, brown sugar and Nutella. My husband got th","useful":0,"cool":0},"u00-U_Vgi9QMpx46aIdy9w":{"text":"Brilliant food! I love to see healthy options in touristy places and this cart is just tha","useful":0,"cool":0},"37XMlDKdhOKNzFUgr6S2lA":{"text":"GLUTEN FREE CREPES!! \nI was so excited to find a place that serves gluten free crepes, and","useful":2,"cool":0},"Pba0EONDrS83h8HNfogWfw":{"text":"Awesome gluten free Crêpes that did not disappoint!! Totally check them out if you're in t","useful":1,"cool":0},"y7L2PcUwqBnZD-1E3Btsag":{"text":"I asked the guy who worked there what is the best crepe for vegans.. This fool told me tha","useful":1,"cool":0},"15LBZZYWsFjbjw983yBXyg":{"text":"I was happy to find both gluten free and vegan options. Any crepe can be made either glute","useful":1,"cool":0},"gFgNNSx2SLY3ime8w9eeyw":{"text":"Oh. My. Gosh. This place is awesome! We stop by here every time we come to NOLA, and it ne","useful":0,"cool":0},"KGi0egjPfav1XBJur70W7Q":{"text":"Everyone must get a crepe! They are amazing, filling and come in such a wide variety of op","useful":2,"cool":0},"jCOSgh8io4dDXr2H_mQtTg":{"text":"We tried the Savory \"The Lower Garden\" [with Mozzarella, Tomato & Spinach] first and then ","useful":0,"cool":0},"7zDixjar1vi8MFTI0nsSzQ":{"text":"We had the most delicious strawberry and Nutella crêpe for dessert. \n\nThe cart was lovely ","useful":2,"cool":3},"CxsKV6rMn-G40wvwrlKLBQ":{"text":"We're local and were taking a stroll thru the Quarters and stopped here... We decided to s","useful":0,"cool":0},"IcwBxiL1pMIM5TYiddy1JQ":{"text":"You have got to try one of their crepes, gluten free available even.  Be sure to add the p","useful":0,"cool":0},"-829JeUNcQmIAV5H9TTdbQ":{"text":"Stopping here is a must if you are in the French Market! I tried the bacon and Nutella cre","useful":11,"cool":3},"rV4lMr851eTSQPOzOimcXg":{"text":"Stopped by for a quick bite. One savory and one sweet. Both were delicious. The prep was q","useful":0,"cool":0},"KQ6U3iXUA396cY8sBmxXMQ":{"text":"Love Love Love The Crepe Cart!!! What a wonderful place! We went to the brick and mortar o","useful":3,"cool":0},"iOeo0605edH4aiJHZpyYBA":{"text":"What a crepe !!!!! Delicious so fresh and the ingredients you can taste that they made wit","useful":0,"cool":0},"kwAoaCL3q2FIlVU2J1Nwjw":{"text":"One thing I told my boyfriend was we need to come down to the French market. We had no clu","useful":0,"cool":0},"a13R5oYBPc9SB1zNZddV3w":{"text":"Probably the most affordable meal option in the market!! And worth every penny and then so","useful":0,"cool":0},"ReYx_w6gsTSd2YJMSRn7iQ":{"text":"Amazingly delicious - from savory to sweet, from vegan and gluten free to not.  Quick, del","useful":0,"cool":0},"7frOdsG5ANWGfmv-ILhk_A":{"text":"Five stars for crepes you say? Yes sir! This lady knows what she's doing! Tucked half way ","useful":3,"cool":0},"VmY_ZxHmCHEdpTs37VlTtA":{"text":"This place is divine... From the bacon,  peanut butter,  and banana to the savory crepes, ","useful":1,"cool":0},"9lHupEhg5FsR8_sqj2c_ow":{"text":"These things are delicious. Also portable which is very convenient when walking around the","useful":1,"cool":0},"93oINmaHtWmWRAXExzexEQ":{"text":"These ladies are absolutely amazing as well as their food. If debating between getting a c","useful":1,"cool":0},"oZbRyIcn-DKWAhqb6PwE9Q":{"text":"No doubt about it.... This is the best gluten free crepe I've ever had. They are knowledge","useful":1,"cool":0},"DTuAmxrCN5_uq45royNLUQ":{"text":"Excellent vegan crepes!  I love the pesto one...fresh and savory!  Good for non-vegans too","useful":0,"cool":0},"MpWMBfehpM08fv3cXyl9-w":{"text":"Very delicious and they offer all of their crepes GF and most of them can be made vegan. I","useful":1,"cool":0},"zWS59BjcafpYZlgtizapYw":{"text":"Awesome crepes! Great selection of both savory and sweet, and the cart is really unique. T","useful":1,"cool":0},"6DP6ueeK9UL0A2HM-vGbkA":{"text":"My friend recommended grabbing crepes for breakfast, but with all of the other extensive o","useful":5,"cool":1},"Kjzln4Udo4gogvjFihkeUA":{"text":"I'm now addicted to peanut butter, Nutella and banana crepes!  I love the tomato, basil, m","useful":4,"cool":0},"9cFixp6CMENs61kd0cPltw":{"text":"Amazinnnnggg!! Don't miss this cart in the super fun French Market! Do not miss their deli","useful":0,"cool":0},"MUlT6SbxoUbpCC0tEH0MnQ":{"text":"So amazing.\n\nI love their coconut cream with caramel. Ugh!!!!! And add in some banana? Wow","useful":1,"cool":0},"HYNqm4fDgXh-0PlxVWMoxA":{"text":"Dett var virkelig gode greier :) Forsøkte både saltmat og søtmat. Ferske ingredienser.","useful":0,"cool":0},"nFtNxir2ZZRNaA9z-iLBFA":{"text":"This place is delicious!! I got the gluten free vegan crepe with bananas, chocolate and co","useful":0,"cool":0},"Psmhk1p7GWZ1rzUW8P-A7A":{"text":"Great spot. They give crepes in a good folded way so it doesn't make a mess. Delicious cre","useful":0,"cool":0},"eNdiPSfDoMOdf_GPSucuCA":{"text":"VEGAN CREPES! My dreams have come true. You have no idea how long I have yearned for a tas","useful":3,"cool":1},"MB8j8-qPJxsNsb9JTDP2NA":{"text":"First vegan crepe place I've seen, it was great! There are plenty of toppings to choose fr","useful":0,"cool":0},"leJ32kPhlCZV5zU9wHcfYA":{"text":"Cute little vendor cart in the French Market. Ordered the strawberry with nutella crepe fo","useful":0,"cool":0},"YpQBGuUcY_W70djuDZT1_w":{"text":"Amazing gluten-free crepes, they are to die for! I ate there twice on my trip to New Orlea","useful":2,"cool":0},"fN8mnNRMpsz0piTkuiFcAw":{"text":"Came to the French Market in search of food, found a mouthfull of heaven with these crepes","useful":0,"cool":0},"MsCR6iIPYMN9sgjkC70IVA":{"text":"This is about as good as it gets without going to France !  After my trip to France 10 yea","useful":0,"cool":0},"Xtg-Afjv-g_2UwhYjA7Llg":{"text":"Very nice stop in French market ! Extreme vegetarian friendly. They even had a vegan batte","useful":0,"cool":0},"RMS3TGSoScBR_fxWyzoLxg":{"text":"We were in NOLA for 5 days at the end of January. It rained the first two days and once th","useful":2,"cool":0},"FVqrOsUAfTULS9zM6x_fqA":{"text":"This cart was located in the French Market.  It was a good selection that my friend and I ","useful":1,"cool":0},"uXL99UJWO9UYhjrwZfDw4A":{"text":"Came here on a rainy day to try some crepes. I got the strawberry, banana, and Nutella cre","useful":0,"cool":0},"xEfw8KPewSZKyedK00Ixaw":{"text":"These crepes are delishhhh!! I love crepes and eat them everywhere I can but unfortunately","useful":0,"cool":1},"ac0bZNnjGMsu-VN_MYDg3w":{"text":"Great taste, filling and healthy options... I love the simple butter and sugar.., but the ","useful":0,"cool":0},"Dcch3oEihS6wkXKXy8_UJQ":{"text":"I'm vegan, so THANK YOU  I had the pesto crepe, and it was super delicious. I Googled vega","useful":0,"cool":0},"UNkj6aZyNhnWakLCZ-XpmA":{"text":"Loved the crepes! Went with my vegetarian sister and she loved the vegan options. The crep","useful":0,"cool":0},"-mxaCgZCFNVw6u87syd7Rg":{"text":"It is indeed inexpensive because the crepes were big. My sister and my mom only got the sw","useful":0,"cool":0},"eR6zmCPLOZ4daD-JGiDSKg":{"text":"I came across this place on Yelp while researching Vegan options for my friends coming to ","useful":9,"cool":9},"4AwA0s_yAlPtMsqQzR2tBA":{"text":"You can't go wrong with gluten free , vegan food. I recommend the caprese or The World. Co","useful":1,"cool":1},"lIzWR_JkHU1At5vx73ZXTQ":{"text":"How can I forget to review this spot. The best crepe I had ever had. This cart gets so bus","useful":1,"cool":0},"NDRtS7aY4KcYGG2VLGI97A":{"text":"Super cute spot that serves a wide variety (sweet, savory, GF) of great crepes.  I've stop","useful":0,"cool":0},"ctaTRF6wZ_Uz4EXuZ1Empw":{"text":"So so good!! I got a strawberry nutella vegan/gluten free crepe today and it was delicious","useful":1,"cool":1},"KqGCs7_dT1zWXhKFu4UhXg":{"text":"This was so delicious! Everything on their menu can be made vegan and/or gluten free! I ha","useful":0,"cool":0},"AVDoJ7dgMRN7K7VRc4DFaA":{"text":"Yummy! Not many vegetarian places, with vegan and gluten-free options, in the French Quart","useful":0,"cool":0},"apLj7skpkB4tlOYqyApExA":{"text":"I grabbed a crepe on the way out of the market before heading back to Texas. Out of all th","useful":0,"cool":0},"rmDr0JLLHRxZ9X80tb-7OQ":{"text":"Holy moly was this place good. It's a little hard to find tucked away in the French Quarte","useful":0,"cool":0},"v-BduiOv053xLhe1PO-_xQ":{"text":"Wonderful crepes. Great presentation. Yummy, light and filling!  My son who is a picky 7 y","useful":0,"cool":0},"jyu11Rn2iB-DocyZtE3_zw":{"text":"Was looking for a good alternative to Cafe du Monde in the French Market, and this cart ke","useful":0,"cool":0},"Cq2a_ylnXlCme80gKtq4eQ":{"text":"Yummmmmmmmmmmmmmmmmm. This food is simple but exquisitely executed. The crepe itself is fr","useful":1,"cool":1},"Qnb5pIWYp8bVmLvrbb_KsA":{"text":"I only have one word for them AMAZING!  I was in New Orleans with a friend who is Vegan an","useful":0,"cool":0},"PMMTNIdICWEi_AAumji9-g":{"text":"I haven't had too many crepes before, but I really enjoyed this place. When I say place, H","useful":4,"cool":4},"rieaysshk6afoq1CTGSFXA":{"text":"Amazing crepes, absolutely in love. They are practically everything friendly, my friend go","useful":2,"cool":0},"V2UvTnIbr2DusD-42BRM7Q":{"text":"This place was amazing! I visited over the summer from Atlanta and I will definitely be ba","useful":0,"cool":0},"7yEy8Kwfa6a6yoWBQCIr0w":{"text":"We went here so many times in a 3 day span that I became the duchess and I live in Houston","useful":4,"cool":1},"BEfADD0h0eJelBKs1GVzdQ":{"text":"Seriously the best crepe I've ever had. And it was gluten free and dairy free. I had the p","useful":0,"cool":0},"TMOvKcaW7GGw3MlCIg7sTQ":{"text":"My husband and I had lunch here today, wow, we both think these are the best crepes we've ","useful":0,"cool":0},"sAMwMib2pCsYxKoeupeduw":{"text":"Gf crepes? You can bet your butter I'll be searching the city for a crepe cart boasting fr","useful":4,"cool":3},"2mawVudozNkrciyBmNmoWg":{"text":"I randomly stumbled across this place while wandering around the French quarter on a Frida","useful":2,"cool":1},"UNgbMcpPBOhjK-iPOhssvw":{"text":"The Crepe cart easily has the best food in the entire French Market! Anyone visiting NOLA ","useful":1,"cool":0},"1BwExfMcLe8h9JW0AmJS9w":{"text":"Delicious made-to-order crepes. I has the Orleans which was stuffed (but not too much) wit","useful":0,"cool":0},"AT5YaMYEx_v8c4_WGqGB5Q":{"text":"Gluten. Free. Crepes. It was delicious. Kind of messy though so grab extra napkins. I trie","useful":0,"cool":1},"cpuLgV-lvWNmaYfdXCoehQ":{"text":"This cart is genius. Business was booming throughout the day! They made my Strawberry and ","useful":3,"cool":3},"4s6DM0IrWittx1Kl3FUOBw":{"text":"A quick and delicious option, especially for the vegan tourist! There's hefty menu that ca","useful":2,"cool":1},"KnRLZ7YMkZmZqTU7clpO8A":{"text":"Love that there's vegan options in Louisiana! I typically get sweet crepes but I wanted to","useful":1,"cool":1},"Nbg4zVvf3KbtnjlXy0_MgQ":{"text":"The crapes were fresh and delicious. The staff was friendly and the kids loved watching th","useful":0,"cool":0},"0hw3kJ2zbMw2ZTY2POtIeQ":{"text":"Try the Fromage (cheddar and mozzarella) savory crepe with spinach! Absolutely phenomenal ","useful":0,"cool":0},"FCffvd8SErUptXZOLs1aTA":{"text":"This place simply was not very good. The vegan cheese was abysmally bad and the \"savory\" c","useful":0,"cool":0},"4W6jyu8XGfrE90Cl9PEd3g":{"text":"Amazinnnnggg!! Don't miss this cart in the super fun French Market! Do not miss their deli","useful":0,"cool":0},"DWqoA83KAUvuMCp-PWSM1g":{"text":"This little cart in the French Market is simply amazing.  The lady ribbing the cart provid","useful":0,"cool":0},"HP5udgsI4uYZ9d_vV8cK2A":{"text":"Amazing gluten-free crapes they are to die for! I ate there twice on my trip to New Orlean","useful":1,"cool":0},"ZBufwtKgnYD5IAZ225P75Q":{"text":"The woman who started and operates the cart is so friendly and genuinely loves what she ha","useful":0,"cool":0},"r6gWIfO8SN-FVdHv3zqwLA":{"text":"Yes, please! We were at the market with our house guest and really wanted a quick treat to","useful":2,"cool":0},"fWX8fuWPV4gg3tZYVbnigg":{"text":"The most beautiful Crepe Cart serving some delicious Crepes and King Cake.  Enjoy great mu","useful":0,"cool":0},"4y6xvj5Dm2pfXBb4zkKMPA":{"text":"My husband I went to NOLA, from houston and if your craving for some crepe this cart is th","useful":0,"cool":0},"WwN_XYH9ERYA-GZxeVBw9g":{"text":"Outstanding crêpes. We only had the strawberry and Nutella crepe. The lady making the crêp","useful":1,"cool":1},"KU8e_N12lcb6ON-Btbe30Q":{"text":"Repeat customer here. What better way to enjoy some fresh crepes than watch them being mad","useful":0,"cool":0},"myZcr7hX_Rmbo-a00e55xg":{"text":"Was so excited for this. Got the vegan butter & sugar and the whole thing tasted like shri","useful":2,"cool":1},"sbFpYKJJjbBv5wacr4a5EQ":{"text":"Great spot for a healthy snack when rambling around the French Quarter.  Will go again.","useful":0,"cool":0},"4DPfRXgFZfJW--fkGS7iiA":{"text":"The crêpes were amazing. All of the ingredients were fresh- you could see them cutting the","useful":0,"cool":0},"xNJwE2r50aWIyn9OvYUX9w":{"text":"Very fast and busy! This place is perfectly located in the middle of the French market. Th","useful":0,"cool":0},"5oN5EjrrHcW3cKQnwhX-Hw":{"text":"They have the most amazing crepes! It was stuffed with so many veggies and cheese that one","useful":0,"cool":0},"t9mQF-loAl1G9UX4J57Kdg":{"text":"DELICIOUS! Vegan friendly options, as well as meaty selections - something for everyone! P","useful":1,"cool":1},"axbM0fOl8G12aNTnO0t0Jg":{"text":"The crepes were delicious! I love that they have a vegan menu with so many options. The gi","useful":0,"cool":0},"XQGSVTymqA1oPRqbbRHK6w":{"text":"GFers when in New Orleans DO NOT miss this‼ The staff are very knowledgeable about GF, cle","useful":1,"cool":1},"XPOtV1uwAPkmbGpZhi5abw":{"text":"An inexpensive and healthy meal, made fresh by a young entrepreneur, the crepe called, \"th","useful":3,"cool":0},"u6zw4N0NV5RUc3FXG3yYAQ":{"text":"I was looking for a gluten free dessert and found this fabulous gem! The service was frien","useful":0,"cool":0},"gDIy3jaPCcQvNfPeS_h16w":{"text":"Props to the GF dedicated cooking surface, ingredients and even chef! \n\nUnfortunately our ","useful":0,"cool":0},"OFwRwjNBBTWqQIUacglgkQ":{"text":"Best crepes I've ever had in my life. I tried many different ones during my stay in NOLA a","useful":0,"cool":0},"IfMs0JyC_vAtpAaAdzE18g":{"text":"Yes!!!!! Stumbled upon this gem while at the market doing some shopping.\n\nI don't think I ","useful":7,"cool":2},"8N_vBGHwFPOROlMxl2UrCA":{"text":"Amazing! We had four gluten free crepes. Two savory and two sweet with buckwheat. They als","useful":0,"cool":0},"Wsmd5GyOW5VdIW_WMy3EMQ":{"text":"This is one of my favorite places to go when I was recently down in New Orleans. Enough so","useful":0,"cool":1},"3T13wVsPHfzV3LN-rVXJIA":{"text":"I think it really says something that it's been weeks since I've gone here and I still thi","useful":1,"cool":1},"oWJOr7Lr4kHdhX-SFbddFQ":{"text":"Wow, should have had these sooner when we came down for the long weekend to New Orleans!  ","useful":1,"cool":0},"abMDQorURhFDPBUOPA32EA":{"text":"Gluten free crepes are amazing!!!!  I am a full celiac, so travel is Tricky for me.  Findi","useful":1,"cool":0},"7NmgBPetzuaypyV8g0XORQ":{"text":"We passed up beignets looking for a desert crepe and stopped here to get a chocolate and s","useful":1,"cool":0},"MyYFUcFmXVDXEL_9GvZvGQ":{"text":"We found this gem in the French Market this past Saturday and I couldn't be happier that w","useful":0,"cool":0},"Qg_Z_RtDbDysnMQrl_-7rw":{"text":"First time having crepe and I wasn't disappointed. Service was quick and easy. There are n","useful":0,"cool":0},"oL7CYf4AVglUjRXgt_4rnA":{"text":"It's not often one can find a vegan AND gluten free crepe let alone in New Orleans. Thank ","useful":0,"cool":0},"Gg4Or5_PgsKVoBCy1giFVg":{"text":"This place is awesome! The crepes are amazing! I'm so glad I found this place! Definitely ","useful":0,"cool":0},"oL0Rrtj96RlV9ukdFcZ93Q":{"text":"Super cute spot that serves a wide variety (sweet, savory, GF) of great crepes.  I've stop","useful":0,"cool":0},"BoSd5VagbC82hRtkJNyDhw":{"text":"It took one crepe for me to fall into a deep abyss of gluttony. After 5 crepes in 3 days, ","useful":17,"cool":13},"UIdq9p7Zu1r0c0fG6HG1hQ":{"text":"Amazing vegan crepes here! We had the pesto crepe and the hummus crepe. Both were deliciou","useful":0,"cool":0},"Pz3uq81rJEOVqeNC94DH1w":{"text":"A very good option if you are wanting breakfast but have already done the beignets from ca","useful":3,"cool":1},"FWxvJn83n-tUzBBbYK3BoQ":{"text":"We visited this place for that first time and was in heaven. I tried two vegan crepes and ","useful":0,"cool":0},"2ZewiAB-EIRi39ZycI0ztg":{"text":"The cart is located in the Historic French Market area. Parking is madness if you want som","useful":1,"cool":0},"5l25c8iBhSlFqbpce54XPQ":{"text":"This place is super cute. I got the elvis style crepe. it did not disappoint :). its in th","useful":0,"cool":1},"9h7wxhDXQUGjnDdoBliv3w":{"text":"We had a strawberry, banana, and cream crepe. It was great and really hit the spot after w","useful":0,"cool":0},"Da76b8DWniMw_bhUPVSFFw":{"text":"Cool little crepe spot with a lot of character. Excellent selection of crepes including gl","useful":0,"cool":0},"p4OYx9NtzU-WF3Z45GGHSw":{"text":"Best vegan crepe I've ever had! If you ever make it to this market please do yourself a fa","useful":2,"cool":0},"ccTCs4kuLpKy_hiGPj3-pQ":{"text":"I am a New Orleans local by choice (meaning I moved here) and one thing I LOVE about this ","useful":3,"cool":0},"msNt7aSEbITXFjYYD_oOag":{"text":"The guy making the crapes today was a total jackass. Wow, u have a street food type cart a","useful":0,"cool":0},"vcwM-tCnht8v8OKo6d_lSw":{"text":"Amazing. The banana boat crepe was filled with coconut, walnuts, and awesomeness. Must hav","useful":0,"cool":1},"J_lIP6tNMjYQQJxOddHnog":{"text":"Im giving this place two stars because the crepe was actually great. The Big easy was a gr","useful":1,"cool":0},"tFSXufYFrkqrMhOPuRcI3g":{"text":"Holy Crepes=HolyCow! What an awesome find.  Whether gluten free or not,  the food was outs","useful":0,"cool":0},"9Xl_x00a0J3sPwij3xOoYA":{"text":"Found this place at the end of a long week for struggling to find gluten free dairy free f","useful":4,"cool":1},"_nEDaWBLk_hHc4JqgNmf5g":{"text":"I ordered the Elvis Crepe which was PB, bananas, nutella & bacon bits. It was so good. It ","useful":0,"cool":0},"e7Qq8Uw223ptwrIHeJ60bg":{"text":"Separate grills for GF & regular crepes. Also it is rare to find A place with gluten-free ","useful":2,"cool":0},"ZuQhyyKnuJR1HpkNyl-AmA":{"text":"Pretty darn tasty crepes. The batter tasted like a thin French cookie I used to have when ","useful":0,"cool":0},"CTNYehPeXkG-YNFxvOmQeg":{"text":"It was 40ish degrees, rainy and windy on the 2nd day of my 1st trip to NOLA.  My son was o","useful":0,"cool":0},"APeyWbkKOJwYgarCojBhKg":{"text":"Holy Crepes has a stall in the French Market that makes regular and gluten free crepes wit","useful":0,"cool":0},"iP-eJpgwnJPZGwtLJzg6eA":{"text":"Nothing compared to Crepe A La Cart BUT THEY ARE BADASS FOR HAVING VEGAN OPTIONS!!! The cr","useful":1,"cool":2},"CWuEfSFSLJv9ZTFgVJSa5A":{"text":"Wowza what a great vegan crepe. Had hazelnut and chocolate vegan crepe and it was amazing.","useful":0,"cool":0},"hj-rA9rVrl9DdZTuxpC6sA":{"text":"Very unimpressed. All three of our crepes were burnt on the bottom! My mother's crepe had ","useful":4,"cool":2},"MUGHOFyFeqDQnAnDsP7csw":{"text":"I placed an order with the owner of the company. The order was placed and served at a fare","useful":0,"cool":0},"K421n82rvp9D8XNnriBi8A":{"text":"Excellent! Split an S.B.T. crepe (Spinach, Bacon and Tomato) with pecan pesto with my part","useful":0,"cool":1},"6Sbl9isR9bH-3_Rik0t8kw":{"text":"Holy Crepes was AMAZING!! We had the works for our savory crepe (all the savory fixins!) &","useful":0,"cool":0},"pLAUjOOx5ytxShQZDyqh7A":{"text":"Fantastic crepes and a nice walk too!\nThe sweet crepes were terrific but the surprise was ","useful":0,"cool":0},"4ISIRNi0icAKX0x4VKvZkA":{"text":"So, I read the Yelp reviews before heading to The Crepe Cart and knew I probably shouldn't","useful":2,"cool":1},"bYHOMMgM3S1UGah2uUetDg":{"text":"This place is a nice little periodic treat!! What you feeling !?? Something Savory ?? Some","useful":39,"cool":27},"Fr04RZq88uJnQqGDoHWQNg":{"text":"Great stop for a fast vegan bite that will be both savery or sweet. Located in the French ","useful":0,"cool":0},"bm1awT0DFOthy46huI2o5w":{"text":"Seriously amazing crepe at a great price! Although I just finished eating lunch a half hou","useful":0,"cool":0},"9gsK1eNSutUogxEKAbiEZg":{"text":"I already have to give the place a good rating for offering gluten free. But on top of off","useful":0,"cool":0},"GEp0-JZwkDX5x5mEHa5KXQ":{"text":"Love love loved this cart. Delicious gluten free crepes - we got their Thanksgiving specia","useful":1,"cool":1},"P8GVs1DIZZpuER5Wk-afNw":{"text":"I got strawberry banana with honey and cinnamon.  It wes pretty good. The staff was very n","useful":0,"cool":0},"hMIperLu5cU5bmqJCy6hUQ":{"text":"If you've had crepes in Paris it's hard to compete, but this is a fun snack and/or light l","useful":3,"cool":1},"6ZQP7QwKYzi0B8x4saTZDg":{"text":"Awesome staff, awesome flavors, and.. well, CREPES. You can't go wrong. \n\nWife and I have ","useful":1,"cool":0},"5D8YG-kL4L7KTJIvDeMBww":{"text":"The significant other was too excited for this place. The reviews are legit; this place ha","useful":4,"cool":2},"xjE9kaACgcYi0q2l3qwYGw":{"text":"The works crepe is probably the best crepe I've ever had! It's a bit pricey for a food sta","useful":0,"cool":0},"KFSS2CTmyiyriCS98QhlJA":{"text":"Absolutely the best!! Offers Gluten Free and Vegan options that are to die for. For the Gl","useful":0,"cool":0},"jC0STzDr6o08y-FmbH8LTg":{"text":"Fantastic crepes!! Great coffee prep, friendly and sooththing (cool) atmosphere. Just be c","useful":0,"cool":0},"0uf5iTPDV9SPRyKZebElGg":{"text":"This is a awesome food cart and it has lovely crepes that range from different flavor. I h","useful":2,"cool":2},"dx1_r3QLvZ1jM5lDP4zrXQ":{"text":"Yum. Just yum. So great to have gluten free options AND a dedicated gluten free griddle so","useful":2,"cool":1},"V1SZ6g7UmljAqgR6xIt07Q":{"text":"Fantastic crepes and a great find a in a city that isn't very good at gluten free food. If","useful":0,"cool":0},"tZ0QAXRuijZYZvs0eDe2FA":{"text":"Delicious!! I had a gluten free crepe with Nutella, strawberries and powdered sugar. It wa","useful":0,"cool":0},"LO7bi9siq_dPFh0KDqNLxQ":{"text":"Nice gluten free and vegan a bit overpriced but what to expect in the neighborhood. It was","useful":0,"cool":0},"UWhHi_FAzLC3BFG1iUCcew":{"text":"Amazing vegan options so delicious I could sat it everyday!! Best breakfast or lunch or di","useful":0,"cool":1},"YDTtIjnYI-8AwJefmfP0tQ":{"text":"We decided to stop by this place while walking through the French Quarter. We weren't sure","useful":0,"cool":0},"YSyJSs4HuWZbpwtvWHVilA":{"text":"This place is SO GOOD! They have incredible sweet and savory crepe options. Not to mention","useful":0,"cool":0},"JqXLG7J9EJf21JluJlwl6g":{"text":"The gluten-free crepes have there own hot griddle and made away from the normal ones.  I'v","useful":1,"cool":0},"U8B7hu5ozMeW-i0ZGL7yWA":{"text":"A great place with a lot of options! Very vegan-friendly, and all of their ingredients are","useful":0,"cool":0},"IJdeLCu4IiKrZLAeMmsTJw":{"text":"The crepes were a little piece of heaven! Yum yum yum yum!\nThey accommodate for any type o","useful":2,"cool":0},"5DETZBk4-t53IGgCAt0t8Q":{"text":"I was so excited to find something gluten free in New Orleans with its very own cooking sp","useful":4,"cool":1},"Sh1ZtNPFg-pNdN5wN4zmVw":{"text":"Yummy! So good!! Traveling with a GF gal is sometimes challenging, but these crepes were p","useful":0,"cool":0},"QNnhrGRXgBZxsuRrH3UIQg":{"text":"This place had good reviews on Yelp, looked adorable and had a good variety on the menu. B","useful":1,"cool":0},"L36Z4EpPm7A2_CiihGGYmg":{"text":"Gluten Free crepe was Soooo good ! Will definitely visit this cart again","useful":1,"cool":1},"aaWM7jByQRGlNmVQnJ4kkg":{"text":"Super Good!!!! Best place for passing through!!\nI had their Amor and the Elvis and both we","useful":2,"cool":1},"Ax5au24EFxVr8qRM_8I33w":{"text":"Amazing vegan crêpes!! & The regular ones are great too. Really nice staff and great servi","useful":0,"cool":1},"qZpRxldnnjaAccmpvjkeFQ":{"text":"I've always wanted to love crepes but I never could. I feel unfulfilled when I eat crepes,","useful":2,"cool":3},"yosiM5Cqc4Dc2nipHE3k0g":{"text":"This place is wonderful for vegans! I got the vegan special which was broccoli cashew chee","useful":2,"cool":1},"6R9ObzBLdzE3lyZPd4mz-g":{"text":"My favorite place for a quick breakfast/lunch we never come to New Orleans without visitin","useful":0,"cool":0},"ZHdxMxyiAAazd4kPStBjww":{"text":"Insane!! This place is awesome.  The gluten free crepe was the perfect replacement for som","useful":2,"cool":0},"wKPLoSCRK2BQkQv21cutNg":{"text":"Unbelievable crepes. Just, wow. And if you're Celiac, they make the gluten-free crepes on ","useful":2,"cool":0},"Yo4GHwPO00BFx4YZ5_yOpQ":{"text":"I got the le pesto veganized (because they not only let you but ENCOURAGE you to customize","useful":0,"cool":0},"WLdVcwLcmDSXsfKwj7WrvA":{"text":"Holy NoLa, there's a creperie with crepes that are simultaneously vegan and gluten free?  ","useful":5,"cool":1},"sBEguNWIJYfRiLImJEiLmw":{"text":"Nestled in the open-air French Market at the end of the Quarter, there lies one stand that","useful":3,"cool":2},"SOd1S61j2NEsKKHIeC5RQA":{"text":"Wife has been gluten free since...feels like forever. Haven't had real pasta or bread in y","useful":0,"cool":0},"S-K8YmGf1SrsWfP5mnfiwg":{"text":"This is in a cute open market area in the French Quarter! They also have gluten free crepe","useful":2,"cool":0},"JrNMi1o5_7cXlDx-SSdCDQ":{"text":"This was my first crepe. I tried the garden veggie crepe.  It had spinach, tomato and mozz","useful":0,"cool":0},"Vcd8V9ro0RgPUeTLXtaOQQ":{"text":"Soooo bummed! I was sooo looking forward this having a crepe and we went 3 different days ","useful":3,"cool":0},"W1QLyJtTlQ87Ofyj0PBFXg":{"text":"I have always wanted to try their gf crepes. When I saw they were doing a pop up in the Ga","useful":0,"cool":0},"sKLOZapG-ZbsjUaqkhOZ8A":{"text":"Came here with some friends from out of town and really enjoyed it.  My friend eats gluten","useful":0,"cool":0},"zLeKMsPkil1rNiKSwU3x4A":{"text":"Well, it's kind of them to offer vegan and gluten free options, though rather sad that the","useful":3,"cool":1},"cvLkvro1kQFwXjGgwy6Pgw":{"text":"Wholeheartedly recommend for vegans!  Phenomenal and delicious.  I had the strawberry, ban","useful":0,"cool":0},"ld-SMIKLy1cchxG99cJEUA":{"text":"I stopped here two times during my stay in New Orleans. First time I got a dairy free and ","useful":7,"cool":6},"zpsrWeYEFjzXKyj2bwytHg":{"text":"oh. my. god. these crepes were so good, i wish they had a stand where i live. plus the 2 g","useful":1,"cool":1},"-gRf2EI416AWz7tr6ZBlCA":{"text":"This was great! It's often hard to find a gluten free crepe place, so I was excited when I","useful":0,"cool":0},"jGWYpTlYGaWzpZwBn8tTbg":{"text":"I didn't expect to find vegan crepes in the French Market but Holy Crepes was there for me","useful":2,"cool":0},"xqlwtEDmVkVm8-dFKBTnhQ":{"text":"OMG!! What can I saw? Sweet, savory and AMAZING! They have Gluten Free Crepes and stuff th","useful":2,"cool":1},"fhn-yfQJFvYOqrYXevNdKQ":{"text":"SO YUMMY! \nThis place has Gluten Free crepes made on separate equipment. In Nola, Being gf","useful":2,"cool":0},"nPwKQqobB4CKTan2IVspzg":{"text":"Great for this GF girl! Highly recommend. Filling as well. We liked both the savory and sw","useful":1,"cool":0},"j-NlSbKu_vsnRp-JKppAXg":{"text":"After cruising the city trying to find gluten free beignets with no luck, I was so happy t","useful":2,"cool":0},"rXEBv6Zyv0Q9KngLxefIRg":{"text":"The best crêpe I've ever had! I definitely recommend ordering the veggie grill crêpe (the ","useful":3,"cool":2},"9StSYJG12V1ihjWVQDGCag":{"text":"Got the prailene crepe, decent taste, long wait and the creeps was about half as filled as","useful":0,"cool":0},"ylEaTrNJ6i2nKg1e5_T7Lg":{"text":"Fantastic!!!  Two in my family have to eat gluten free which is what led us here--but we a","useful":0,"cool":0},"pjETFNzqIMmarzfmCS8R7Q":{"text":"There are actually more vegan options than you might think in NOLA. I followed my fellow y","useful":1,"cool":1},"L7UNAl2H9KhmcgwAEliK_g":{"text":"Most delicious crepes i have had! They have a good variety on the menu.  We got the strawb","useful":2,"cool":2},"G5egOuVgJbo1Czo7psermQ":{"text":"Love love love love love love love my \"beignet crepe\" (or so the woman who helped me calle","useful":6,"cool":3},"M7hDf7xT-m44NOIpXXWNRw":{"text":"OMG this place is a must stop !!  They have GF & Vegan crepes .. they even have a separate","useful":0,"cool":0},"L4mWOFKM7rWiTnvx0SCrBQ":{"text":"Friendly face took my order and he helped with suggestions too. Part of the French market,","useful":1,"cool":1},"7VDSuG_MycxJ6RQpmpTcFw":{"text":"Wow -- absolutely delicious! I heard the owners talking about their cashew mozzarella and ","useful":1,"cool":2},"gkELNxBPRYpIAi2BmlQV4A":{"text":"Holy crepe these are good. We tried the beignet crepe which is butter and brown sugar on t","useful":0,"cool":0}}