{"NP3iAdjxnk4iE2Q3SQSh6Q":{"text":"A major caveat to start: I live 20 minutes from Mexico. This is not Mexican.\n    That bein","useful":0,"cool":0},"nXNAUWavSkqqEt3wmkRTWg":{"text":"Amazing Mexican food at an amazing price. I got the plato which comes with soft tacos, mea","useful":0,"cool":0},"u1XBn-7S2vqb1DP83MdAUA":{"text":"So I come here on my visit to NOLA and after our walk thru the Berlin Stripe. They were ri","useful":1,"cool":1},"8KQrABpITFAGY72EP4WG2g":{"text":"Felipe's does the cheap taqueria thing well.  Fresh ingredients, tasty food, light on the ","useful":0,"cool":0},"agPSBzfRwITt1w_4rIzsew":{"text":"Great place to get a cheap dinner and decent Mexican food in NOLA. We were walking around ","useful":0,"cool":0},"pDKBYxjvJ9GrOQLvmakyiw":{"text":"Look. Felipes is awesome, cheap, and fast.  It's set up like a typical burrito place.  You","useful":0,"cool":0},"Ke501mb0u88OOe_X6YL56A":{"text":"I work in the French Quarter - a few doors down from Felipe's, in fact... And this is HAND","useful":1,"cool":1},"VaKENifKqxfIHR599dYs0g":{"text":"Nice variety, prepared upon order in a counter service format. More of a fast food type se","useful":0,"cool":0},"L--XgYnVyC5qNG5DPvqh8A":{"text":"Good Mexican fast food made to order. The customer orders by walking through a serving lin","useful":1,"cool":0},"SKYpSsemrUm9uvJw_1tUkQ":{"text":"Had the worst service there,had to wait an hour and a half for 2 burritos so to make our s","useful":3,"cool":3},"vgJOdVZe6Or30nr5S3_VOw":{"text":"the food is delicious, very fast quality. i will definitely come again. I am in the car (n","useful":0,"cool":0},"byBekTFsIDhmcxcmwoabsw":{"text":"This place was so amazing it even lowered my uber cost from $100 to $32. We requested an u","useful":0,"cool":0},"IhMPVQec76AkHrYv_WZKyQ":{"text":"I always come on Taco Tuesday. Perfect location. Super friendly staff. Fresh food and very","useful":0,"cool":0},"O3WpMear_4ttA0pLa1etsg":{"text":"Sub par at best.  Not to mention management did not help when the guys on the line were in","useful":0,"cool":0},"T6XRyh_jkKi7KLUXJVhfyQ":{"text":"I like the dining room in this location more than the S. Miro location.  There's more open","useful":0,"cool":0},"O_1lQ7JGIeNtkf_GoiwQ3g":{"text":"Great shrimp tacos!\n\nEnvironment was a little chaotic because they had two lines and picki","useful":0,"cool":0},"SRnqk9oyuOfmpZTmdvUZ6g":{"text":"Felipe's has really good burritos.  We had the chicken  burrito.  Quick service, walk up t","useful":0,"cool":0},"ciYX_XWPpvmdNA9CnJKPVA":{"text":"Very good, ordering is a little different, but the food was great! I'll be eating here nex","useful":0,"cool":0},"rk6QZRtKpBYdxNNjdWBjJw":{"text":"Felipe's is okay.  I have found over my numerous visits it can be hit or miss.  Sometimes ","useful":1,"cool":0},"EeUqnwldtzusGKV8T1aQ0w":{"text":"Most authentic and delicious mexican food in the city, hands down! This place is the bomb!","useful":0,"cool":0},"pZl-Ed8ecgudR9BZll6VYw":{"text":"Do you want cheap Mexican food and yummy margaritas??  Look no further than this gem.  Loc","useful":5,"cool":3},"S2ptHQjc8f7k2dLKzAhXoA":{"text":"This place is awesome and SOOO REASONABLY PRICED, particularly given its location!\n\nThey a","useful":0,"cool":0},"FTXiEZYIElDoOQSvocfQMw":{"text":"I do not typically write reviews but for Felipe's, I must because it is so GOOD.  Pretty c","useful":0,"cool":0},"Q8Ju8yMQalwFPerS9F4GAQ":{"text":"Ooooo baby! Felipe's after a sick show at the HoB or just in general is a great idea, ever","useful":0,"cool":0},"Lx5gE9VwmCD-2_eldV78Mw":{"text":"Excellent and inexpensive. Great bar downstairs and upstairs. Trust me. Check this place o","useful":0,"cool":0},"54M0tI5WDrHzGcH9gYNy_Q":{"text":"Came here not expecting much. You stand in line and order like at Chipotle. I ordered the ","useful":0,"cool":0},"A-MmhNJk9EtHnmrN167nrA":{"text":"If you are looking for something different, something inexpensive, and something vegetaria","useful":0,"cool":0},"NMcXXYArMC_nEPuqsAMR5w":{"text":"Delicious chicken tacos from Felipe's! Chicken was flavored perfectly and was tender. Lett","useful":0,"cool":0},"OYXbFUJ6dMF__Lj3ULfsaQ":{"text":"This place honestly was the worst. Staff was unfriendly and the food was cold and not good","useful":0,"cool":0},"BcKY6rcdeTp5EeHZiRuI-w":{"text":"Yummmmm.. Delicious Mexican Food. Found this restaurant thanks to Yelp.  I had the burrito","useful":0,"cool":0},"D1wXm37iUpT_kACjPfjDIw":{"text":"Food was ok.  Steak is fatty and full of gristle, and we were spitting it out.  The shredd","useful":0,"cool":0},"Hos_3tjJVJUNs1RdUjd6zw":{"text":"Baja shrimp tacos were great and the prices were reasonable. Boisterous, casual atmosphere","useful":0,"cool":0},"e9OWvyfGbRRwmM36dR8OQw":{"text":"I've eaten at Felipe's 15+ times as a French Quarter employee. I was originally planning o","useful":0,"cool":0},"89IrEUmAGazbAGt7VQ0Hnw":{"text":"Delicious! It's like a nicer more delicious Moe's, q'doba, or chipotle but still has good ","useful":0,"cool":0},"D7j4Gm-Bfa0FrreSphxnbg":{"text":"Food, Decor, and Service were all excellent. The location was fairly good (about 2 blocks ","useful":0,"cool":0},"-91LaaKj8F0kUq2ZYoPrdQ":{"text":"Good food. Great value. After dropping a significant amount of money on a dinner for my wi","useful":0,"cool":0},"27TeOWlXVMMDkAQ-rLring":{"text":"Went to a wedding rehearsal dinner here. Sarah was awesome and made up for lack of custome","useful":0,"cool":0},"Vj5itY9tm7s4YvcjaV-F-w":{"text":"This place is great fast food. Don't get the horchata, though, it tastes like you just lic","useful":0,"cool":0},"tGRl4d4N9EiHevNUP0h3GQ":{"text":"This place rocks!! Delicious tacos. The condiment bar is stocked with sweet onions various","useful":0,"cool":0},"MgLRRX2OSf-Fm95Jx2eZ8g":{"text":"We ate here for lunch based on the Yelp reviews.  My family was not disappointed.  The foo","useful":1,"cool":0},"epHhBkCmi3f8wF3xlLyRpQ":{"text":"If the menu on your door says you're open until 1am, and Yelp says you're open until 3am, ","useful":1,"cool":0},"NAbNQD1qQfCrKSKHwYLeBA":{"text":"Located in what was once a Hooters, the French Quarter Felipe's serves good food and drink","useful":1,"cool":1},"CEeEZf57n4vy2rKGN4Iatw":{"text":"MEXICAN HEAVEN!!! Food was very delicious and staff was quick and very friendly. As an out","useful":0,"cool":0},"CP0bK1JbNWzaDwbS95fVuA":{"text":"From a Texan very well versed in Mexican food or should I say Tex-Mex. This place has grea","useful":0,"cool":0},"tpMSNpJvkstTqFzN0yI9vQ":{"text":"I went with my boyfriend the portions are small and definitely is no good Mexican food I a","useful":0,"cool":0},"SRSGk0aDrTV2fITX-pp0JA":{"text":"I have been eating here for years. I recommend the quesadilla with the chicken rings but a","useful":2,"cool":0},"9I8mmUA3tqHLn5iIkjMzeg":{"text":"Amazing spot, a lil reasonably-priced refuge in the French Quarter -- where the prices can","useful":1,"cool":0},"fkYzEVqfL0j9IVdd_bT8KA":{"text":"I came in to New Orleans late from Austin at around 9 pm, and I was hungry and tired. I ha","useful":1,"cool":0},"217ifqAt4UYhAv-Vujsa1A":{"text":"This place is good for run through food. Its not really a nice sit down area. I went after","useful":0,"cool":0},"dNJchTqP4usuuOzGJ8aeaA":{"text":"Went here for Cinco de Mayo.  Wish I would have gone elsewhere.  By the time my date broug","useful":1,"cool":0},"XvETlLLjvgnL2toOqLm7_Q":{"text":"Great food!  So many options to make your meal exactly how you want it. Even better, the p","useful":0,"cool":0},"lwB3Fxu2_iY2W52U006uyg":{"text":"I tried Felipes for the first time coming down to New Orleans for Mardi Gras this year! ( ","useful":0,"cool":0},"nK_YvThkgga8mYp1fOhGwA":{"text":"I can not say enough wonderful things about this place. We were recently on vacation and h","useful":0,"cool":2},"-eLvr09oGKvg64x5q6fQYw":{"text":"This is one of my favorite places to grab a taco, burrito or anything coming out of your s","useful":0,"cool":0},"syyblZEU37SM23ZcNGhLLQ":{"text":"Food was ok. Using unique ingredients with certain meats was a fail. For instance, cinnamo","useful":1,"cool":0},"w-0sRw-Y_gjlM2H3FUOpbw":{"text":"Pretty good food.  I got the corn tortilla chargrilled chicken tacos with guac, sour cream","useful":1,"cool":0},"g6KMKNVLov_4tdzLD4RXWg":{"text":"amazingly authentic feel to the resturaunt i feel like im going to mexico itself to get my","useful":2,"cool":1},"LR5XlqcD4bG_CAQrr_2-RA":{"text":"One of the best fast casual mexican food places I have ever been. Good prices, if your eve","useful":0,"cool":0},"KQ9Q4XJ723ns64296Pl2Eg":{"text":"Got fish tacos with fresh pico de gallo. They were light and zesty on a hot day. The chips","useful":0,"cool":1},"gqm-184F72k2acIRrX9SqQ":{"text":"Fast and delicious! Never disappoints me when I'm craving quick mexican.","useful":0,"cool":0},"HHmjwKGOO6rKnSVYXhbxdQ":{"text":"The ambience here is exquisite--I actually feel like I'm at a cantina in Mexico, I don't f","useful":0,"cool":0},"3nPDutOg1p2ARz51gbM8Jg":{"text":"Taco Guererro across the street is soooo much better mexican.  Posole Thursdays and menudo","useful":1,"cool":0},"kBzE2k8f9FajNlKVESNUZw":{"text":"Best Mexican food in New Orleans... \nAmazing margaritas... \nThat's all you really need to ","useful":2,"cool":0},"FzGje6ysxABYnBsOv2YKWQ":{"text":"Felipe's how I love you.  \n\nThe set up here is a subway style assembly line style.  Read b","useful":2,"cool":0},"FmuUjtJykcy0gjIwkn5vtw":{"text":"Great place to eat. Fresh ingredients made to order. Everything has its own flavor. Perfec","useful":0,"cool":0},"EeDWd98ElAE7NpTYODlteA":{"text":"Came here for a super quick bite before a tour. Hubs and I both had two tacos (beware that","useful":0,"cool":0},"vBCaEGnsV7mOqAD1E9h-rA":{"text":"Really liked this place they have great tortilla soup and the tamale was really good loved","useful":0,"cool":0},"MaUz5z4aw8xQVB8TNI5rig":{"text":"Amazing.  Just like the one Cambridge.  This place has great burritos, salsa bar, friendly","useful":0,"cool":0},"ixv3qMsZuUiuwVcl9LjlWw":{"text":"Definitely a place that I need to try once more in order to believe that I have a thorough","useful":3,"cool":3},"DeTebWlZDCgN2EzF40ir5Q":{"text":"3 times in a week. ( But that can possibly have something to do with location, as I work 3","useful":0,"cool":0},"H7KSoTDmd754HKW9iVfPhQ":{"text":"This place was FANTASTIC! We had Rory as our waiter and he was the cherry on top of the ex","useful":0,"cool":0},"RBc5ssds7LBb4m66aLwZTg":{"text":"Baja Tacos are delicious they have a punch of flavor.  Yum! The quac, chips and beans, ric","useful":1,"cool":0},"_j8r-wVVHLADa5J7CzRFhg":{"text":"The fam was looking for non-seafood near the french quarter, and somehow ended up walking ","useful":0,"cool":0},"gk7hUz3-_MKIjJ8VTqez2A":{"text":"This place is worse than Izzo's illegal Burrito. You would think by the reviews and the li","useful":0,"cool":1},"r-v4OHNOZNZBUqCsbsBxgA":{"text":"I used to think Chipotle was the best place to get quick, relatively healthy Mexican food.","useful":0,"cool":0},"RlCKqAskU1YNeAiVTBbudw":{"text":"Great little find in the French Corner! Fresh delicious food! \nHad chicken taquitos- prett","useful":1,"cool":0},"zXnYUzN5R2FAR6W3xf8P2Q":{"text":"Great place to get something if you are tired of Cajun cuisine. Service was good. Helpful ","useful":0,"cool":0},"8YVvA_0fRqNfFS25UywnOQ":{"text":"I have to give this one a rating below juans because their food was kind of bland and I di","useful":0,"cool":0},"i48RKAGuFWu2y_mZClXoXw":{"text":"Awesome casual and fast place. Highly recommend this place for something a little differen","useful":0,"cool":0},"cIRw-oY_8ZUrNxEgpPdK4w":{"text":"Food was good. You can get a 40oz tecate for less than $5! Great salsa. If you get tired o","useful":0,"cool":0},"xmUP1fd5zVdOYBb2hjQmOg":{"text":"I finally went! So many people have talked about Felipe's and we have not been more disapp","useful":0,"cool":0},"Q-VB8VybvlaoRosTDr6ZVA":{"text":"The margaritas on the rocks were amazing! The bar we definitely killin it when we went for","useful":0,"cool":0},"t88HyTlSH3MLWz8w703-OA":{"text":"This was probably the worst service I've ever had.  The bartender literally whistled at us","useful":0,"cool":0},"oSrm97ytfxz088ejuMScEA":{"text":"It's cheap, but great. Margueritas are strong. Burritos are amazing. It's hard to find goo","useful":0,"cool":0},"S3EYg1A_Yhm5jP4ZmXHoWg":{"text":"I was once the Duchess of Felipe's. Alas, now I am but a regular, although that should tel","useful":3,"cool":0},"JU4lGZwP4Hf9nbcm9y19wA":{"text":"The place is pretty basic Mexican food, but reasonably tasty and VERY reasonably priced! I","useful":1,"cool":2},"d8wPBYElKw59yz7GDk6--Q":{"text":"Of all the restaurants I have eaten at in New Orleans this has been the best one. Even tho","useful":0,"cool":0},"NbTeYQ7-Vy8MhO61ZouPlw":{"text":"I would give them 0 stars but that isn't available. Allow me to state that I was not aware","useful":2,"cool":0},"nVtKj7OweRBLV1RTwojOiQ":{"text":"WOW!  Talk about a STRONG drink!! The bartender definitely has a heavy hand...which could ","useful":0,"cool":0},"Ls7umchRVHQrdATmNWqRsA":{"text":"My coworker and I came here for a quick lunch after sales calls in the quarter and DAMN, i","useful":0,"cool":0},"gqv7w-QbaIa1q19LnAQhpA":{"text":"When you finally get sick of fried foods, gravies, sauces, and more gravies... GO HERE! Ve","useful":0,"cool":0},"dc6YHE_uP5GIBL2XK6qBrA":{"text":"Great food, great spot, great prices.  My husband and I each had two tacos...steak and shr","useful":0,"cool":0},"s-pR6GV3w2X_7XWCWsp5zg":{"text":"Good, cheap Mexican (ehm, \"Mexican\") food. \n\nI always get the Taco Salad (wink, Marielle S","useful":1,"cool":1},"W9WdDASmdV0o5qXDhOtKYQ":{"text":"Food was bland and they overcharged me significantly from the prices listed on the menu. F","useful":0,"cool":0},"44U2J9g4CZj0eubaHQW3vg":{"text":"Nice atmosphere. Afforable. Killer margaritas. Horchata. \nNOT like Chipotle, because that ","useful":1,"cool":1},"uk_jKZVNPBCIFcCrlCGJMA":{"text":"A bit overrated IMHO.  Decent food and cheap but not really that great.","useful":0,"cool":0},"4UOdMlLM_QwZDJd6ls-18A":{"text":"We came to Felipe's for a last minute meal on a sunday night and we were not disappointed-","useful":0,"cool":0},"XMk3hmYZWFZWaVz_6QSpZg":{"text":"Came here when I couldn't take any more rich traditional New Orleans food.  Got a grilled ","useful":0,"cool":1},"X-_2XcU0BZ-JEWfVkcMnCA":{"text":"Shawn is the bartender. He is always ready to put a smile on your face. He runs the bar. H","useful":0,"cool":0},"l4WeacXfhdahUN10gwy7kw":{"text":"It's a fun and friendly place with average bar service. The tacos and salsa/guacamole with","useful":0,"cool":0},"oEl25P_DK06ROo4WmGq0NQ":{"text":"Finding good food at reasonable prices in the French Quarter can be tricky...finding amazi","useful":0,"cool":0},"_Q6Mslqs-2Nu25SJDYqv4A":{"text":"This place was perfect for us! With my husband being vegetarian, sometimes it was difficul","useful":0,"cool":0},"4L-aPMXK1qk4OwgtguSqNQ":{"text":"A decent place to get a burrito, quesadilla or taco in New Orleans, especially when I am m","useful":0,"cool":0},"17PArc79MhBxYQCDfKk_hw":{"text":"Taking two stars off for bad attitude and snarky comments from waitress about my dietary n","useful":3,"cool":1},"3LRoG8LORFkD3IlmzVVifg":{"text":"Loved the tinga chicken but I wish they would give more. It's about half as much of the in","useful":0,"cool":0},"bQnAOpG3GPfG2xO6XEcovQ":{"text":"Love this place for a quick bite and string margaritas. Their tacos are pretty yummy and i","useful":0,"cool":0},"vhKxc-KTWYGWCMMmARr-og":{"text":"If you're looking for good, cheap Mexican food or just good, cheap food in the quarter, th","useful":0,"cool":0},"qL9fAv6YOntnrP8X_MyqJw":{"text":"It was ok.  And here's why:  The food itself was decently seasoned and the green sauce was","useful":0,"cool":0},"boBVSwwdgNmi2UfKw4RzUg":{"text":"The burritos are small but good. They rush you through the line without telling you that y","useful":0,"cool":0},"-i2xRsjRRW-_VjJxm8ojYA":{"text":"This is the first Felipe's I ever went to after Hooter's shut down and they opened up. It ","useful":0,"cool":0},"DM2KbOWsqc70iHYB5qIqvA":{"text":"I've heard great things about this place. But no one warned me it wasn't a sit down restau","useful":0,"cool":0},"O8FwV02hyyAzMZD4DFevEw":{"text":"Felipe's is the best quality and least expensive food option in the French Quarter and sur","useful":1,"cool":2},"nlWfoeyvE0kb3BdBmQW3EA":{"text":"I like Felipe's. The food is yummy, the service is consistent and I look forward to eating","useful":7,"cool":4},"1tkv8uMn8Dr8lqnkaZVcVA":{"text":"Yes!!!!! Finally some Mexican tacos! I mean seriously as close to authentic Mexican tacos ","useful":1,"cool":0},"0CJ_7cXpjQ_e4Aq-GtAJPw":{"text":"The best mexican restaurant in New Orleans, everything is fresh and great prices","useful":0,"cool":0},"qwzE6oYnB3HlQOEw0snTdQ":{"text":"cafeteria style line and you have to pay for a tiny cup of salsa, pay for a brown bag of c","useful":0,"cool":0},"y1kixZGwGmHLF3t7DRuFyA":{"text":"I love Felipe's! I'm not sure if it's actually for the food as much as for the combination","useful":0,"cool":0},"VLD8rkN4TCdiXAxpSky-lg":{"text":"Love it. Working in the Quarter it is my go-to place for good food and good prices.  Love ","useful":0,"cool":0},"v442rrpbIvTrEITXhtaTYw":{"text":"very inexpensive dinner or lunch option for locals and visitors alike.  \n\ndecent food, gre","useful":1,"cool":0},"-0h6Hpl-U1qVMAFqImInDQ":{"text":"Four stars for quick, fresh, cheap, fairly tasty food that's kid friendly in the Quarter.\n","useful":1,"cool":0},"VPaFht_DWs2-SonCWhlKBQ":{"text":"Felipe Navidad! I don't think that makes sense but I am saying it anyway. It's my Yelp rev","useful":1,"cool":1},"J3kxeUfh4BPQsYJ0e8ne7Q":{"text":"Felipes changed the cheese formula for the queso blanco. It was more yellow and not as goo","useful":1,"cool":0},"na1LqvetUzAQuD5-AqL-jA":{"text":"The best Mexican food in New Orleans. I ate there 3 days in a row because it was so Good!","useful":0,"cool":0},"7aHSq2CUYbZ7YJBCuERI5g":{"text":"Wonderful Mexican?/Cuban? whatever it is.  We are from South Texas so are used to a lot of","useful":0,"cool":0},"PKR780DDc1ylnMNTDbbDVA":{"text":"Food was good not great. Nothing to compare it to in New Orleans but if I compare it to Ch","useful":1,"cool":0},"Nel23nSNBMj4GRfBNebSQg":{"text":"Monday night, 8pm.\nThe bartender was talking smack about the kitchen to her upset customer","useful":0,"cool":0},"fZsOpqvx426SNNJodMbyRw":{"text":"This place has good food and a good atmosphere. Employees are polite and courteous. I woul","useful":0,"cool":0},"tJef7lJXXMRikoslj7SbRA":{"text":"Food was good, however prices are pretty high for what you get. They were going to charge ","useful":0,"cool":0},"QDosa70UQN8a5VGFQj4eAg":{"text":"We were in search of late night dinner from being at a concert and we came here on the rec","useful":0,"cool":0},"TLULsxPw-rZtt_qAwf6_Ng":{"text":"Awesome food! Super fast, cheap, and delicious! Big portions and terrific value. Great sal","useful":0,"cool":0},"s1pWkZLaJjxdMQeSJpVT8A":{"text":"First place my family and I ate at in NOLA and it did not disappoint! The ingredients are ","useful":0,"cool":0},"95hLQLHayafIX3srBZh8ig":{"text":"I eat/order food from here at least once a week. Their queso dip is crack in a cup, and th","useful":1,"cool":0},"sT-8izHZLW69hfgk8kyUXQ":{"text":"I'm here for the third time and I always try to use Yelp to explore new places. \n\nI was so","useful":1,"cool":0},"ygJTePsRf_BW_MGfB7ih5g":{"text":"Hard to screw up mexican food, but these guys have got it going on.  Made a stop for lunch","useful":0,"cool":0},"StWTFFwT_zaZK4Hre926qg":{"text":"Asked for guacamole, got half an avocado.  (No Joke.)  Just go to Chipotle in Harahan wher","useful":0,"cool":0},"TdyynqbApevr5CeyQqjV5g":{"text":"No, this isn't what I expected - It was my second attempt after I went there on Christmas ","useful":0,"cool":0},"9svOggNJvct7-yCCwsaP5g":{"text":"I am actually embarrassed as to how much time I spend in this place. I loovveee Felipe's. ","useful":0,"cool":0},"b7oxXw77Zm-uYSX7qFGnxQ":{"text":"Good vibe and food. Best things are the margaritas. I don't know if it is a coincidence or","useful":0,"cool":0},"JFexh9AHdobHpq3yQe0_aQ":{"text":"Felipe's is a cheap, bog-standard taqueria, which is a good thing. Meats are fresh and tas","useful":0,"cool":0},"ONWuLE-5DF0F4ZbGw5ztLw":{"text":"Awesome food, Vegetarian Paradise in NoLA n French Quarter .... the Taco Salad and the Chi","useful":0,"cool":0},"YOR2ecfiFz8pwaU0V-HmcQ":{"text":"The food is bland and the cooks and cashiesr are not very friendly. \n\nI would suggest Juan","useful":0,"cool":0},"9gVA9Bxr-nUHg_Tyq1v8HA":{"text":"My dad and I ate here twice while we were in New Orleans. We aren't big fans of seafood or","useful":0,"cool":0},"Anloo4vdrHtvIJCvn_cFIQ":{"text":"It's a small mom and pop Mexican resteraunt. It's margaritas are amazing! A little on the ","useful":0,"cool":0},"pm0opD0WEObmDWb1olBdmA":{"text":"Food was great, but service at the bar lacking. Bartender was more interested in chatting ","useful":0,"cool":0},"72kthpMOaFK8T1rcXXyF4A":{"text":"This was awesome! The bar tender was great! Hand crafted Margarita's starting with fresh s","useful":0,"cool":0},"3jRnkxPSenRIAlPr2bN4tg":{"text":"My second time in New Orleans I made sure to come back to Felipe's. This is some of the be","useful":0,"cool":0},"Oe1J5_1gE-gQ-sn3QhQvHg":{"text":"Cheap, fast and good food! Great for a late night snack on the weekends especially. Their ","useful":0,"cool":0},"YmfMyfDEiu_3aItE1-6vOQ":{"text":"I went here because it was open till late and I am a vegetarian so it becomes difficult to","useful":0,"cool":0},"MPOieflvnndRgvZ99HQ1Ow":{"text":"Come here a couple of times a week because their chimichanga is simply that amazing.  You ","useful":0,"cool":0},"KXPNykoMUN7dm2_LUF5NXQ":{"text":"Decided to have a quick bite in the afternoon. Found this place and it was perfect. Two co","useful":0,"cool":0},"wFhCzUfVQAtYQtbqjX5arw":{"text":"This is sooo good !! We came here right before leaving New Orleans and it is just quick an","useful":0,"cool":0},"AzlWNyRpXbyAcIBABGQmUQ":{"text":"You walk in and it looks like a chipotle. It's soooo much better than that. The meat was s","useful":0,"cool":0},"XjQs-T2k-xgjHfseYzIChA":{"text":"Where would I be without you Felipe's? Well, probably in the same place but without yummy ","useful":5,"cool":2},"Gb0oCpFHxh5-623rl5aG9g":{"text":"I love Felipe's.  The food actually is authentic.  All the people who say otherwise don't ","useful":2,"cool":2},"M2yYnsSFqnoq8ELXkaB_bg":{"text":"Great place! Good prices great food and good atmosphere.  We sat outside in the back court","useful":0,"cool":0},"ihrshHYj3AXkWswgoyvCDA":{"text":"Good for a quick eat.\n\nIt's cheap and the exact same as the uptown version off Claiborn.  ","useful":0,"cool":0},"IepiOefEaM5Fqxqd0V5iBA":{"text":"The food was ok. I had to chicken tacos with cheese, guacamole, onions and cilantro. Every","useful":0,"cool":0},"Gzr1m1RvG6UKAHMqMYOtdg":{"text":"On Guy Fieri's recommendation we wandered to this joint. I had the recommended Tinga chick","useful":0,"cool":0},"c31OQ90kE1BPuL8hXKRqDA":{"text":"Ok so my step mom and i went their for dinner tonight. The food was well the service was g","useful":0,"cool":0},"kxU9YBdaRbzPgin1xSepmw":{"text":"It's no El Gordo in San Francisco, but this is one of the top taqueiras in New Orleans. I ","useful":0,"cool":0},"t_7Yg1K4r87SB3D5MkUl3g":{"text":"Went to Felipe's during the busy Mardi Gras season. Hands down one of the best tacos I've ","useful":0,"cool":0},"JIAATj90Rujc3R8BQm_akA":{"text":"Horribly overpriced, lousy extras, and bland bland bland entrees!\n\nAfter three days of vac","useful":1,"cool":0},"CCWDhGLUkzV4dW0tcXOnmQ":{"text":"Tasty and inexpensive.  Their sangria at $3.50 a tumbler are pretty good.  During the Chri","useful":0,"cool":0},"uvUzra5lV3ROnns3mNYX2A":{"text":"I did the pork platos. Great portion size. Well flavored rice.  It was delicious (Arizonan","useful":1,"cool":1},"Njimo0C04lLomrDxHbynDA":{"text":"Have been here many times over the years and try to make it a habit when in the French Qua","useful":0,"cool":0},"CeVLPmbkunCgt_Q6ZlXGfw":{"text":"finally a local answer to Chipotle Grill!!!\ngood,fresh, hearty, and fairly priced!\nwe like","useful":0,"cool":0},"tjxbYqgkxQPF9lLJleC5XA":{"text":"My 6 month old gives Felipe's 5 stars for their refried beans, but he hasn't registered fo","useful":1,"cool":1},"1BK1IYqKrvQ2KbBTX86wFg":{"text":"I use to love this place and was a regular every wed. for the $3 margaritas.  Awesome marg","useful":0,"cool":0},"uK4Rl9fK7eNFBT1ZnPfTPA":{"text":"We love Felipe's! Coming from Fargo, which has a serious lack of Mexican and MexAm cuisine","useful":0,"cool":0},"W9fq4f1HSH0zWUeyvdHQpA":{"text":"we stopped in very late....they were still serving taco's at the bar....FANTASTIC pastor s","useful":0,"cool":0},"5P6alttDAivJmXfbhM6l1Q":{"text":"The people working there got mad that I ordered something in the first place. Then seemed ","useful":3,"cool":0},"f9R0zzUEfdtU-59veCXwOQ":{"text":"Cheap prices for the Quarter. Food is plentiful and delicious enough that you see many loc","useful":0,"cool":0},"L1Ld-gFotdVsk0L8c5wcVw":{"text":"The food was average; not bad but not terribly good either. The service was sort of lackin","useful":1,"cool":0},"mmFEuN0-1olYEEEAXmyaEg":{"text":"Love, love, loved this place when we visited New Orleans. Now, I know many people want Caj","useful":1,"cool":1},"tWP6KlcaulK-grWyiQ0rdw":{"text":"Well, I never thought I would be eating Mexican in the French Quarter but saw the reviews ","useful":0,"cool":0},"PUYiUJa50E0EQo9XVyAhzg":{"text":"I know what you're thinking. Who comes to New Orleans to eat Mexican food. Well, I did. An","useful":1,"cool":0},"8FIKYztnRrkzlS34db3EQA":{"text":"Always great. I make it a habit to stop in for the fish tacos every time I'm in town.","useful":0,"cool":0},"iIgw2b1a8tLuGN6kaMkveQ":{"text":"It's cheap. It's fast. And the food is really good. What's not to like about this place? I","useful":5,"cool":2},"Vk03N_htM_No9l0ZuRZqtQ":{"text":"I've developed an increasing resistance to Felipes since I moved to New Orleans. This is a","useful":5,"cool":3},"gGwSv2yfmnkOm4N4GPPcog":{"text":"I believe this is a great option for visitors or locals, but I didn't give it four stars b","useful":0,"cool":0},"2eXxkf4j4WeYq-LbOwnBeA":{"text":"We went to Felipe's for dinner after a day spent tubing, starved and looking for something","useful":0,"cool":0},"Xi7reHuN4hDKwEMKdXcxOA":{"text":"I work in the area so I go there often and the food is pretty consistent. Just had the mez","useful":1,"cool":1},"z9Jn58japRHLTzaHs3VMMw":{"text":"Hands down, the best place for a hurricane in all of New Orleans.  They make theirs using ","useful":1,"cool":0},"jjEwXilKWM8faxpoyK1E7w":{"text":"Both the service and the food is absolutely terrible.  I wish I could give it zero stars, ","useful":1,"cool":0},"Vx2eotXS50KTdZt72_goTA":{"text":"Yumyum for the tumtum. Inexpensive, flavorful, good portion. We rolled in at midnight afte","useful":0,"cool":0},"m1QPriA7WAtsbAL1dELC-g":{"text":"Ate at Felipe's last night. The food was good so we went back. Today we ordered the fish t","useful":0,"cool":0},"rp9FJGJm6aMEyJDBS8dRyQ":{"text":"Eh. Really. Eh. I wasn't all too impressed with this place. It's almost like a knock-off C","useful":0,"cool":0},"elJns1-H1Qhdr_gFT5oJJQ":{"text":"Not the best but great for a quick meal the drinks are awesome queso could be thicker and ","useful":0,"cool":0},"-sZsQi2xxYF-e1sWX_D6BA":{"text":"Great value. Got the Platos with the pork/pineapple meat option (forgot the name) for only","useful":0,"cool":0},"zSWFUYU4Gw__FKJ5ia0MnA":{"text":"Eh. This place is okay, I guess. Maybe if I weren't such a failure at not being a vegetari","useful":5,"cool":3},"s-NSoj6LvAd9bVxj0gWYLA":{"text":"SO glad the hooters is gone cuz Felipe's tacoed its way into my life and I am happy about ","useful":1,"cool":0},"CFW-Y-0eKiAOnyXjTeE9MA":{"text":"Four of us stopped in for a quick dinner. I ordered the steak quesadilla and the others or","useful":2,"cool":0},"UrmYBluTbB9qfVkJT3oeXw":{"text":"Ok, I know this is not terribly authentic Mexican food, but I'm originally form Michigan, ","useful":0,"cool":0},"ykdm_R6ybja3ZBfCvLMLLw":{"text":"Good tacos, simple, neat bar, inexpensive.  Definitely a local hangout, every one at the b","useful":0,"cool":0},"VAhTnk4BWQYRMqzvyiGBeQ":{"text":"Very friendly & fast service. My husband and I had the nachos with steak & 2 tacos-carnita","useful":0,"cool":0},"eXlBtiGYW4qckaq5Fe910Q":{"text":"I would have given it All Stars except they price gouge, by rushing you through the line s","useful":0,"cool":0},"dRsnLa-kfW6iB5-oHt1mhw":{"text":"Being from SoCal, eating Mexican cuisine elsewhere can be pretty risky. My family and I da","useful":1,"cool":0},"F9491P-CTKVQDQdhMx3CxQ":{"text":"Pretty good Mexican food for NOLA in my opinion. I like that they make your taco's to orde","useful":0,"cool":0},"9fBvhO87txO13fM4lFNUpg":{"text":"So in love with this place, I've never fancied seafood and tacos together, but after havin","useful":0,"cool":0},"4OuKgN1oi3Vt2NVciJ3A4Q":{"text":"This is one of the best places I've been to, especially if you're looking to a cheap meal ","useful":0,"cool":0},"qUL2wyQvP9SB6oNfBjECvQ":{"text":"If you just read the 1st sentence: FOOD POISONING. \nYes, I know that restaurants in NOLA a","useful":7,"cool":1},"2HQJhvQ7DpzoexNAUjuzBw":{"text":"Awesome food try the queso! We stumbled on this place when passing through town. I ordered","useful":0,"cool":0},"F87ayIgN9A2mP_iDV_iHcg":{"text":"Very fast and good service here. Just did lunch and had a couple of tacos. Food was tasty ","useful":1,"cool":0},"ekSHz_Z69VOSqfwKSulJ4g":{"text":"A step up from Taco Bell, which isn't saying much.\n\nStarted out promising when it first op","useful":0,"cool":0},"rH24Ic46d0glIW2X4tfuaQ":{"text":"Food was awesome! The price even better. We ordered taquitos and guacamole. The staff was ","useful":0,"cool":0},"R6wPCYlyPIXjHlTLuBiVtQ":{"text":"Felipe's is a pretty good place to go to if you're a vegetarian. The burrito is okay, noth","useful":0,"cool":0},"WRhW9x03u0BAnm3VUm36Xg":{"text":"Best food!!! Great, FRESH cocktails!!! I'm not a seafood fan ... So this place was awesome","useful":0,"cool":0},"7nGQeu-xZGGBvck6gGyiIA":{"text":"Pretty good Mexican food that is quick to order. You can custom make whatever you order so","useful":0,"cool":0},"wXI8FVoQL3LKxWZ1SOyR7A":{"text":"My favorite food I had in NOLA.  I'm a bit fond of burritos though, so I'm not sure if tha","useful":0,"cool":0},"tohEzu-4_l-C5ZuOGlAjyQ":{"text":"Bleh is about as much enthusiasm as I can muster for this place. I love good Mexican food.","useful":2,"cool":0},"fmc404r5AF-S_BmAxvzKqg":{"text":"Good, fresh cheap eats in the heart of the French Quarter. They serve a mean drink, too.","useful":0,"cool":0},"Vce5YG8jft8p3XlF4yZArA":{"text":"Delicious, quick, and cheap Mexican food with great locations (Uptown on Claiborne and dow","useful":1,"cool":0},"zPgzle_v8UE3pTjaZdjUaA":{"text":"Get the chimichanga and drown it in the queso!!!\n\nPetitioning to bring Felipe's to Miami A","useful":1,"cool":1},"RinEnmBReHJnN_v-2yWkVg":{"text":"Not bad. This was a necessity meal as we had to put something in our stomachs before headi","useful":0,"cool":1},"_s25A7jbYAu-ZSFFHojR-A":{"text":"The bartender was awesome.  The margaritas and mixed drinks with the fresh squeezed limes.","useful":0,"cool":0},"M5UlPwe7_u_47yOjUJiNvw":{"text":"First time going to New Orleans and i saw that they had a Felipe's so i had to try it, I'm","useful":0,"cool":0},"ExulLHWGFDxH7Nx53Ai2KA":{"text":"Just picked up my first carry out from here and OMG, why did I ever wait so long?? Not any","useful":0,"cool":0},"BFh-WiA5bdaz6KtaLP5PDw":{"text":"This is place is the bomb. Food was fresh, tasted good and better than Chipotle. I wish th","useful":0,"cool":0},"PN6kbwz_0n0hYrOHQaBi1A":{"text":"Ringa chicken is amazing. Cilantro red onion topping had so much flavor. I planned on gett","useful":0,"cool":0},"PSharNUwp712gC7hF1mJiQ":{"text":"Friday lunch time and this place fit the bill.  Fast service, fresh veggies and clean, fri","useful":0,"cool":0},"KnwTTz__6xjudhTbH-W7Rw":{"text":"This place is so gooood! Al Pastor, Carnitas, Shrimp, Chicken, Steak... Any way you want i","useful":0,"cool":0},"lnP9zd16Ozn68X3Tja5iZQ":{"text":"My new favorite place for lunch. \n\nI heart tacos. And these are SO good. Quick and delicio","useful":3,"cool":3},"FN8Ftc1Aql88ENw7_bYflw":{"text":"Ate here on a Sunday afternoon while craving tacos and being too lazy to go outside the Qu","useful":3,"cool":0},"HT8W5qLRkA0nAocBtkImyQ":{"text":"Came into New Orleans for a week for halloween and was exploring and came across this rest","useful":1,"cool":0},"bJtlpEbMSzwhVLiqfT_J0w":{"text":"For Mexican food in a Cajun capital this medium sized spot was very authentic.  The steak ","useful":1,"cool":0},"0s_bZVsBR4ImDNl-0dxCPw":{"text":"I work in the CBD and visit this place almost weekly. I can't imagine anyone having a bad ","useful":0,"cool":0},"qpf74LPNmm5ePXSTI731JA":{"text":"If you're in the French Quarter and in the mood for a mexican meal, Felipe's is definitely","useful":1,"cool":0},"FrwoQ2iiPKIHM0swRfv5EA":{"text":"I have always been a big fan of Felipe's. Used to walk there all the time in college to sa","useful":0,"cool":0},"aS7-waaYCGe4lXNWkzdyGg":{"text":"Food was great. had to be told to order then sit down but the steak fajita nachos hit the ","useful":0,"cool":0},"FpnbZoFiNi-sJnkCKKg_FQ":{"text":"For those of you from the north, this is an upscale Chipotle or Qdobas with a bar, which i","useful":1,"cool":3},"-uidyoHnylqUAkVj_MalKA":{"text":"Busy! Busy! Well, maybe because my friends and I went to Felipe's after the Usher concert ","useful":0,"cool":0},"OEAmLRild1Vc8Sk-GFIVLg":{"text":"Delicious and inexpensive. Had 2 al pastor tacos, 1 carnitas tacos, a drink, and chips wit","useful":1,"cool":0},"pUnDMP7UulVfHLVpQ3YgIQ":{"text":"I hail from Texas, so an establishment boasting the word \"taqueria\" in its title must real","useful":1,"cool":1},"TRs-TzOitT1lSHvx48W7Pg":{"text":"Ask for extra meat! I got the Al Pastor quesadilla, which would have been a lot better if ","useful":0,"cool":0},"Jv9SUt5EzgE0EaDwUHMArw":{"text":"This review is mainly about my friends' and my experience at the bar. As for the food, it'","useful":4,"cool":0},"mRkpNFeUzdozM2K8sVyYJA":{"text":"Order at counter, relatively inexpensive, to as were tasty (had fish and steak), good chip","useful":1,"cool":0},"Nw7Y8xRV2z6O4Mp1syav8A":{"text":"On any other day, I would give Felipe's 5 stars. I work nearby and eat here at least 3 tim","useful":1,"cool":0},"dX1y-7uieoNm29OzUNH1KQ":{"text":"Nothing to complain about. Beer cold. Food good. \nLow prices. Employees nice. Bathrooms cl","useful":0,"cool":0},"E1AdNbOdPH2npRgiomCvYQ":{"text":"As a Mexican from Southern California I was really surprised at how good this place was! G","useful":0,"cool":0},"FMyprveiED1AO-FmJpGw3g":{"text":"For me, tacos from super super chain-y tex mex do not satisfy my taste buds at all. I like","useful":1,"cool":1},"VIjsEocUTUZhbyceA7O_VA":{"text":"By far my favorite Mexican place! Many Latinos were eating here, which says a lot! I had t","useful":1,"cool":0},"t6EscZw1a36wblxL4mdaXw":{"text":"I love this place!! My family and I frequent it as much as possible! The service is good a","useful":0,"cool":0},"4cvtDyp9CpPqUElZuJeetw":{"text":"Good for a snack.....good selection of Salsas.....Yea, we liked it here.....Yea, we would ","useful":0,"cool":0},"2aSNIPlk_0Y5_ICzQ7xB3w":{"text":"I love this little place. Food is yummy, salsa stand is so good. We stop in for a light sn","useful":0,"cool":0},"CiWjaZF9nm5mp2UfW0dajg":{"text":"So I was meeting a group here and stopped at my hotel bar on the way to grab a travel pop.","useful":0,"cool":0},"uJq8zIZ2DLKF8BaSfvEVlQ":{"text":"Cheap, delicious, home-made, what more can you ask for?  Oh, killer $4 sangrias?  Yes plea","useful":1,"cool":0},"Zb3JVnWtPvzzBMfYwp9uzQ":{"text":"Very, very good authentic mexican fare. Cheap too. You order yourself and pick it up at th","useful":0,"cool":0},"Wj-K_eCD9lqjVkcfFQXloA":{"text":"What was I thinking of?  Having Mexican food in New Orleans.  But in my quest to eat in at","useful":0,"cool":0},"ZDz9EuMNdtuJOn6-xEehdA":{"text":"Sunday evening, sat at the bar, and they gave us menus.  Then proceeded to ignore us for t","useful":0,"cool":0},"wXx85owxr6eDb9bXvshyFA":{"text":"My shrimp tacos were pretty good but my girlfriend who is a Mexican fanatic did not like h","useful":0,"cool":0},"lnHhLPIewyLla0sr6V5i0A":{"text":"I was mesmerized about how quick and efficient they are.  But the food quality wasn't grea","useful":0,"cool":0},"qrZXZcHH-Ls34G-LxviwRw":{"text":"Food at Felipe was fresh and delicious. The salsa bar had some fun selections but my favor","useful":0,"cool":0},"1l93lcJaV7eVKQLrfuai7w":{"text":"Awesome, cheap, delicious comida! Go with the carnitas or al pastor on anything, plus you ","useful":0,"cool":0},"0_MuC87KXxRRKiyeKhlHAQ":{"text":"I can't sleep so I suppose I'll Yelp! Came to Felipe's a few nights ago with friends after","useful":1,"cool":1},"4jvroFsCFYbDEGK1_NFacA":{"text":"Nice, friendly staff.  Nice decor, clean.  Had steak burrito - meat was non-seasoned, rice","useful":0,"cool":0},"knZd3-4CqR5KA4rz05DdsQ":{"text":"My favorite thing about Felipe's is the combination of mediocre food and an incredibly inc","useful":1,"cool":0},"xT-2q5yL24vIx8-45nzssg":{"text":"Food was fantastic. We had the beef tacos and Baja fish tacos. The food was fresh and the ","useful":0,"cool":0},"o3qRQmx_d95ngMuAEbp89g":{"text":"I really enjoyed Felipe's last time I was in the Quarter. The food was delicious! I was ab","useful":0,"cool":0},"N3YUg6NZyWwSX7KQ7Oucfg":{"text":"So good!! I got a bowl with carnitas and my fiancé got tacos and both were so good! We got","useful":0,"cool":0},"08nRTBvXoxiEmVYU4xgM1A":{"text":"Good tamales for a chain.  Really good selection of hot sauces and nice variety of options","useful":0,"cool":0},"pnoJa2-9Y5vwulO3bZmuIA":{"text":"Seriously, nothing special. Could get better food at a Taco Bell and drive in darquairi sh","useful":0,"cool":0},"gX_eKXWfgI3YMuETmyf1dQ":{"text":"Great food at great prices! The queso is a must have. Daily weekday drink specials are not","useful":2,"cool":0},"4KpQxz0YJgnYUvDYleRVYw":{"text":"Fantastic lunch spot or for late night re-fuel.  Margaritas are very tasty and I'll just s","useful":0,"cool":0},"5U0EZehzkR8i0nt4aaAY6g":{"text":"Well I sat at the bar and after 10 min or waiting to be helped I decided to get up and go ","useful":0,"cool":0},"l1knIMjjOdSWl6E4PkTlRQ":{"text":"I came to NO for a birthday and we stopped there for drinks and appetizers before dinner. ","useful":0,"cool":0},"ATasd_kE1mfaYBsk6oC8Gw":{"text":"This is another Chipotle, food ok the staff was not very familiar with the Mexican food me","useful":0,"cool":0},"irjdZzDN6wgJIuWUjFFHqQ":{"text":"My favorite in the quarter for Mexican. The staff is friendly, the food is cheap, and it t","useful":0,"cool":0},"zW_Uca3YR_etH5ERSI57Mg":{"text":"As a Tulane student, there is a Felipe's located on Claireborn that I like taking my bike ","useful":0,"cool":0},"T0X9X8GMWu0nGaqgAvufUQ":{"text":"Ordered a super burrito to go, walked 6 blocks back to my hotel room, burrito fell out of ","useful":0,"cool":0},"_yifQF8eQ8uWUgBcv89Xow":{"text":"Good stuff.  Everything is custom made. The bar is roomy and the servers were quick.","useful":0,"cool":0},"K-yR9tmlo0m9nubZGUJ-Lg":{"text":"After falling in love with Felipe's Uptown location, we decided to give this location anot","useful":1,"cool":1},"3HLQi_yJMAihWpX0iTlC2g":{"text":"To be honest, I've never actually eaten the food here.  But I always hear that it's really","useful":0,"cool":0},"opMtg0oIZRhqF3KbD6Qaog":{"text":"Felipe's is the spot to get drunk before a concert at the HOB. \n\nIt's so hard to try somet","useful":1,"cool":0},"dqs4I5AMddMXgIrUvidkBw":{"text":"Who goes to a taco place in New Orleans?? Me!\n\nWe wanted to grab something quick and easy ","useful":0,"cool":0},"wl__oHQTkbVvqPK4EVDA5g":{"text":"The food is FRESH!! and you can taste that quality in their menu. Friendly, energitic staf","useful":1,"cool":1},"mM5_YNaPxUGWH-L32qgGTw":{"text":"Inexpensive & delicious!  You can sit at the bar and order food or go to the food counter ","useful":0,"cool":0},"_z0oGMiHUj_usCjXRovn-A":{"text":"We came in for a drink.  We did not try the food.  I was excited to see the bartender usin","useful":0,"cool":0},"-bbBjULjZpmNGDH4V9pJ1w":{"text":"I work in the fq and always get food from this place. Fresh and authentic, the quesadillas","useful":0,"cool":0},"QkvWlUTiWLeETmJMFNkbbA":{"text":"Not great service - 2 people in front of me and waited 10 min and left - customer service ","useful":1,"cool":0},"GaRWmuiPjcduTSLQqCLs9g":{"text":"Went here twice within two days because it's so good! So many options for what to order an","useful":0,"cool":0},"Xb0QiPO3gIX_dPiqVm8-Fw":{"text":"LOVED THIS PLACE!\nThe best food I actually had in NOLA! After being called 'Mexican' by th","useful":0,"cool":0},"J8qnLGp-6y3UMc0WSTjS5Q":{"text":"Great food. The bartenders suck, which is unfortunate. I am a bartender so I know how it c","useful":0,"cool":0},"qQwHxQtQYl599Yws4dcp6w":{"text":"I am a vegan which is a foreign concept to most nola restaurants, but not Felipe's. They a","useful":1,"cool":1},"HO1ms6F6OYHEldocg8tmBw":{"text":"Food is decent. Service is slow. Zack the cashier couldn't care less how long it takes to ","useful":2,"cool":0},"z4xoeV1zuIPD4OL2egMjfA":{"text":"Was introduced to this place by some of my service industry friends meaning that it is che","useful":0,"cool":0},"3kiL-gWTP4Ip-BAJZGRUHA":{"text":"So gross. Dont waste your time with the food here, its the equivalent to Panera for Mexica","useful":0,"cool":0},"WTiaFPTJ9mvvwDbkig8Hlg":{"text":"Went in thinking it was going to be just so fulfilling and wonderful, all I got was disapp","useful":0,"cool":0},"W4jIZGXmGXhPzwl3xWwCfQ":{"text":"We absolutely loved this place. Went there three times in three days. The nachos are amazi","useful":0,"cool":0},"k5uNqZIlMPQ8ccJNdkrkmQ":{"text":"I believe I just ate the best nachos in my life. OMG! I can die a happy person now. My hus","useful":0,"cool":0},"wLgxSCASm0rSmXuZfUaK8Q":{"text":"Hmm, Hmm good!  Love this place.  Felipe's has daily drink specials and great FAST mexican","useful":2,"cool":1},"Ra-882dRMcVia54yaC_9lw":{"text":"Amazing food. The taco salad was delicious. Big screen tvs playing the game. Very reasonab","useful":1,"cool":0},"wjtr0J1fehkJ87u24jkaaA":{"text":"You can choose to seat at the bar and order from the menu or get to order like subway. I l","useful":0,"cool":0},"Xtgw47UFAiwV4r5RKKeYYw":{"text":"Here we go folks, another I love this place because......Hello sheeple, this is just a bas","useful":0,"cool":0},"2LqAP5DXzyLFHwIVy15gDw":{"text":"Very good Bajan shrimp tacos & the margaritas are superb!! My friends enjoyed their shrimp","useful":0,"cool":0},"Iq-8ij_dmxGgyU1iLcT47g":{"text":"Got burritos 2 nights in a row to go. Fresh and tasty and reasonably priced.  Queso dip wa","useful":0,"cool":0},"0FJ6uBwnZwXq09lCcIHtxg":{"text":"I can't imagine how this place has 4 stars.Must be all the drunk tourist stumbling in from","useful":0,"cool":0},"lnpUa_NMquXUMC3Ou3szXw":{"text":"Recent trip to Nola for new years and we ate and ate. After eating at Nola's on new yrs we","useful":0,"cool":0},"K9GpEiCPndCWirSJQWLU6Q":{"text":"Good margaritas, consistent food. Menus seem overly complicated, could use some editing to","useful":0,"cool":0},"rDNVBJb-MoEDSOxGm7Yq7w":{"text":"Usually I love this place but after the worst experience at the bar I will not be back. So","useful":0,"cool":0},"dbkX_7GrgMKM6nEhpG8d0g":{"text":"Excellent meal!  The food was adequate in size for me but for my teenage son the large bur","useful":0,"cool":0},"NN3veHG1aO5GKXxe6hzrNQ":{"text":"Great food. Prices are a little high but it's really yummy. Decor is pretty cool. Even has","useful":0,"cool":0},"vAEeB8e4NWuthZgJT3WH8g":{"text":"Went there earlier today and I have to say the service was quick, prices were reasonable, ","useful":0,"cool":0},"myscV_dD08B2M1Ihpk-xtg":{"text":"We had nachos with steak, steak tacos, and shrimp tacos.  For $24, it wasn't bad.  The shr","useful":0,"cool":0},"wYRs-IbwTuMTMkcoT7tF1w":{"text":"We frequent the Acquarium and Filepe's is right around the corner.  I took the family and ","useful":2,"cool":1},"-3Ghvne1HvCYCGkWzhUNNA":{"text":"This place is amazing and cheap. And they do corn tortillas so it is both authentic and gl","useful":0,"cool":0},"eP5vckGPiF91Xi7scjOtHQ":{"text":"Great place, walk up and order and get your food.   Only thing that was missing was a tray","useful":0,"cool":0},"pBMalFlIjsgcqP8hI4Uzcg":{"text":"I had a blast with friends here. Drinks are Excellent and Food is the best! Awesome bring ","useful":0,"cool":0},"J7PSFomAtZLyl56fwBzp-w":{"text":"Had the Nachos with Carnitas.. Pork was really flavorful. Toppings were really good qualit","useful":0,"cool":0},"DoUIj9mFqv8lh9pZmx2xOA":{"text":"Good food, good value, good variety. It was CRAZY PACKED due to FQF shows being rained out","useful":0,"cool":0},"bEicHC7oYlNaQrZTA41AnA":{"text":"So because it had a bar I thought it was sit down table service-  it's not. But it still g","useful":0,"cool":0},"jUDLj7pF5pT5rB9xdPa4bQ":{"text":"very good and fresh! Fun bar and good food! Great prices, kids would like it here too. Fre","useful":0,"cool":0},"rC4PQWsJTLGCK-0onBYg-Q":{"text":"Felipe's is one of my favorite spots for a quick, cheap lunch in the French Quarter. It's ","useful":2,"cool":1},"9sN44LxKcISs9vV5BM6ywg":{"text":"The food was good and plentiful.  My wife had the chicken burrito, and i had the Tamales a","useful":0,"cool":0},"SPtY1O3m34zvefYcnSW4pQ":{"text":"Best cheap food in the quarter! Try the shrimp or the carnitas, and don't leave without ge","useful":0,"cool":0},"4dsjiYqWZasC9sq6G7jc6g":{"text":"Felipe's is a fast-food style Mexican restaurant. They have a decent selection of items an","useful":1,"cool":0},"naUo2W3mGZ8UtaSuYU_Ikw":{"text":"This review is proof positive that so many things go into your rating, not just your cuisi","useful":1,"cool":0},"twx25W6j7gZLUWOtQDSnlg":{"text":"Great food. Their chips & queso is fantastic. The quesadillas are awesome. I love that you","useful":0,"cool":0},"VKqJUQ_AQT_ypGJxx3Ytdg":{"text":"Pretty Damn Good and cheap to boot.. I had the tacos al pastor which was awesome . my wife","useful":0,"cool":0},"OxM5J-EuhKoq_WcOJL-2Sw":{"text":"If you advertise that open till 2 and customers come in at 12:20am .. then you should be o","useful":0,"cool":0},"aCpO56SFkr5yZ5JKhBoKVg":{"text":"Simply love and frequent as much as possible when visiting NOLA.\n\nChips are fresh & tasty ","useful":0,"cool":0},"WbhxEnL-gtijKd4Xx0jJ0Q":{"text":"Pretty good.  Not as good as I expected, but pretty good.  Not as good as Chipotle, though","useful":0,"cool":0},"bwJRPoA82svF7omDjfIeew":{"text":"After a night of bar hopping, our group was craving some cheap food that wasn't fried chic","useful":0,"cool":0},"vYKfgHPcJLThOvhAWv8flw":{"text":"I loved this spot. It could be my daily jam. I'm a taco fanatic and it would be living to ","useful":0,"cool":1},"WnKQyqQ2k7GQICYqUJJa_Q":{"text":"Great place to eat some good Mexican food in the midst of Cajun seasonings and seafood. No","useful":0,"cool":0},"0sw4ZA0K-cOTet6M5Zw5-Q":{"text":"Yes!!!!! Finally some Mexican tacos! I mean seriously as close to authentic Mexican tacos ","useful":0,"cool":0},"UWGSmtqQcEPm80Ev5nQ7ng":{"text":"Got the baja fish tacos and the flavors were so rich and fresh. My boyfriend who originall","useful":0,"cool":1},"TxoOnBt6LjnHmPAR5G1XvQ":{"text":"Great place to stop for a snack and good location on the fringe of the Quarter.  Try the C","useful":0,"cool":0},"QjwZ25vTLMxpZH3oUx9hag":{"text":"congratulations french quarter on getting a decent taco place. i was pleasantly surprised ","useful":0,"cool":0},"ew6wVidrkVyMn3xdjCt7gQ":{"text":"Located on the outskirts of the French Quarters/Bourbon Street, Felipes provides an afford","useful":0,"cool":0},"WNsRYujEVwmUxeBX59fDGg":{"text":"I've been here twice and each time I've felt sick. First time it was just an uneasy and up","useful":2,"cool":0},"erWRCTNX0anGQV4K-eoUhg":{"text":"There isn't a whole lot of Mexican food in the French quarter so I decided to try Felipe's","useful":0,"cool":0},"kKxQyLhRZmB0pApfU0uWMw":{"text":"$3.50 Sangria! What?! Being an employee of the French Quarter for many years, I know it ca","useful":0,"cool":0},"F7xMs0gNj7Fbz6X7ff6cAg":{"text":"Great place for cheap delicious food!  Great margaritas as well.  Always see a very eclect","useful":0,"cool":0},"IVhMsqxiip6lniF_us2toQ":{"text":"I have to admit I was not impressed at all. Maybe Chipotle has me spoiled on burritos but ","useful":0,"cool":0},"6rwT8VnHcuiDwsK_lLcnUA":{"text":"Food is fresh and made within view, to order. Pick your own fillings and a nice fixins bar","useful":0,"cool":0},"OrbRhKXGGcjy5sTevutCrw":{"text":"Great place in the French quarter.  One of the best margaritas I ever had.  The shrimp tac","useful":0,"cool":0},"LNCI-kCOmQif-1GpfgsWlA":{"text":"I don't know how I didn't review this in November when I came to New Orleans, because this","useful":0,"cool":0},"7XJqvcs1qeAGv4h8nnWnoQ":{"text":"Awesome food for a drunkard!  1) It's quick; 2) It's cheap; 3) It's fricking tasty.\n\nFelip","useful":2,"cool":1},"DUHXWBKudBdPS5Y88HIKpw":{"text":"This place is unique and great. I like this place more than Chipotle. It has more variety ","useful":0,"cool":0},"emS34H1a2h1sXMGVLJIUeA":{"text":"I'm sure this will be unpopular but Felipe's did not hit my spot. I like the one Uptown an","useful":3,"cool":0},"dPbBHNIpW_gGTri-OuYeFg":{"text":"Absolutely love this place. It's my go to easy lunch spot in the quarter. The ingredients ","useful":0,"cool":0},"GonMsc-eT0rrC4JiUGmnvg":{"text":"What a gem to find off of Bourbon Street!\n\nMy friends and I stumbled through here inadvert","useful":2,"cool":2},"xw4Ffz7s2ILQDfeY2EdfYw":{"text":"The steak tacos with onions, cilantro and guacamillo were really good, and the salsa bar h","useful":0,"cool":0},"km7c14Or5ITYXXJNaguLWw":{"text":"Since i live in Texas now i have had my share of authentic Mexican food and this place is ","useful":1,"cool":0},"vIO-HT7B_V1MRchp7-kAow":{"text":"After a night of daiquris and hurricanes we decided we needed to grab some food.  Found th","useful":1,"cool":0},"8yTW7MxdgJEK8LHzKsTjJQ":{"text":"I order a whiskey and ginger ale and then say, \"oh, wait, do you have ginger ale?\" and the","useful":3,"cool":1},"Q8uqGgyrcgWxqFDr9HTHwQ":{"text":"Was like any dine in fast food place you can go. Friendly staff but nothing to complain ab","useful":0,"cool":0},"qigFNJn2yIyIg2f1QFiHXg":{"text":"So I'm eating it as we speak and I have to say this is prolly Gods favorite burrito! Wow, ","useful":0,"cool":0},"2cORQRr7U2-YUH62sEDHMQ":{"text":"straight up...  nothing too crazy here, just solid good food.   THE best part of this plac","useful":1,"cool":0},"pqta0iJQOnpHNdHdfRngAQ":{"text":"I think the food here is pretty good for a mexican food place which are slim pickings in N","useful":3,"cool":0},"YEuWUs7u6XfVF4skKxrqxg":{"text":"Delicious food in a vibrant atmosphere! I like that the restaurant is \"order your own styl","useful":0,"cool":0},"mtyG-zkbQIIiZW2h7AZG7g":{"text":"Fantastic food, served quickly in a great atmostphere.  Fresh ingredients and nice people.","useful":0,"cool":0},"NoXjn8okeAYwAOMUfOWf_g":{"text":"Great food. Reasonable price.  Watch your recipt though. They tend to charge for things th","useful":0,"cool":0},"Yux1_VLbW3TlRcFjTsR_HA":{"text":"Food is great, service is great and clean with a little ambiance. You cannot beat the pric","useful":0,"cool":0},"2DIrh1XdjmIleaGVAZ-ZmQ":{"text":"Sometimes you need to step away from the craziness of the Quarter and this is a good, inex","useful":0,"cool":0},"oh_ajZ9cDyqFQmGJStwzmw":{"text":"It's good if you want to drink, watch the game, and then eat. If your not drinking then fo","useful":1,"cool":0},"vp1OlSPd6Z9lja9QqMOWWg":{"text":"I originally hail from Arizona, and after living in DC for a while, I have come to expect ","useful":1,"cool":1},"MIAbf6fX49OdkRB2aQ3PKQ":{"text":"I see the reviews that this place has gotten and start to wonder if I ate at the same rest","useful":2,"cool":1},"D-1Ue9Fjzw76I240dmnZ2g":{"text":"Delicious shrimp tacos. We were both pretty drunk so our review might have been swayed but","useful":1,"cool":0},"_zmgiVqKQCYIj8Mms-Ttiw":{"text":"Felipe's is great. I've never liked the margaritas there, but the food is so good that I'm","useful":2,"cool":1},"hGLwVISfjvQmuSK7BcN5dg":{"text":"My wife and I were in New Orleans and craving tacos and mezcal. Felipe's delivered on both","useful":1,"cool":0},"scieHaFK8Obrf5sfF0OvYw":{"text":"Awesome lil place. It was modestly low priced. They just like to charge you extra for thin","useful":0,"cool":0},"2kenkeHcG0kyE6o1XfFRPg":{"text":"Food is bland whether it be burritos, tacos, or nachos - no flavor is to be found. The ing","useful":1,"cool":0},"aeZi1M961PY7ooYFCIzC_g":{"text":"Really like this place.  While I am not a big Burrito person the (not even) $2 tacos are a","useful":3,"cool":2},"6bwq1ICeEkmv_uFxkpnarQ":{"text":"I can't fathom why anyone would give this place a negative review. I eat here weekly for l","useful":0,"cool":0},"lPVzeg9F0hh5yq26gZS09w":{"text":"Just add my recommendation to the other posters - good Mexican food, cheap and friendly.\nC","useful":0,"cool":0},"CgEOxQzBjExRt0fPOhvI6w":{"text":"I finally found something I really like at Felipes and that was the fish tacos. Damn were ","useful":3,"cool":1},"MPjDRM1eXljlulaHvH296g":{"text":"The best Mexican food in the quarters for the price ....\nAdd bonus you build it yourself \n","useful":1,"cool":3},"0qCCxa8MN2_j7-F5sm0uPw":{"text":"We come here whenever my family comes to town. Great margaritas. Customer service lacks bu","useful":0,"cool":0},"4t2vznWevAJpbZ4HGwfxuQ":{"text":"Great food for the $.  My wife and I both wanted nachos at 9:30 on a Friday night.  We wal","useful":0,"cool":0},"2XPjCJDdEsg4gVv-gXhd6Q":{"text":"It's like a spin off of the restaurant Chipotle (but with a bar and open wayyy later).  Go","useful":0,"cool":0},"G2pWnJ0-4GFxlZ3MIjSCOw":{"text":"I like this location better than the one Uptown.  It is more laid back.   The bartender to","useful":0,"cool":0},"Q750TgS8hzO7HcDle9LXPg":{"text":"This is a perfect place to eat when you've had too much to drink.  Big, cheap, yummy.  May","useful":0,"cool":0},"D1_bRSGGJ3voefym5dAR4g":{"text":"Terrible service. Surly bartender. This is her. Who knows how someone like this gets a job","useful":0,"cool":0},"uH-_wDq8qgM1NT6Rjomudg":{"text":"I was searching for a place to get scrumptious late night nachos and Felipe's delivered! W","useful":0,"cool":0},"UuycKZrQF0PykuVoNO2d4Q":{"text":"Great spot for something good and cost effective.  Quick and clean. Kind of like a chipotl","useful":1,"cool":0},"vyWSvjouBq9s3SOUD4DNsg":{"text":"I come here very occasionally for a workday lunch.  Service is usually pretty quick.  Food","useful":1,"cool":0},"uv0h6BntDHHp8Q_BbheZ7A":{"text":"Went in late. Waitress, Miranda, was a sweetheart. I had carnitas and husband had Reuben, ","useful":0,"cool":0},"7-KWn3uEdN4oqMv9QKkRWg":{"text":"Fantastic, authentic tasting Mexican food. My friend and I came here at midnight for $2 ta","useful":1,"cool":1},"NQeZm64zCWxLterjfqgoCw":{"text":"As a foodie and veteran of new Orleans benders, I long for authentic Mexican cuisine after","useful":3,"cool":2},"9fQQePvWdIUImrvhgt14qA":{"text":"A favorite in New Orleans.  Their pork tacos are heaven..  I always get two and add extra ","useful":0,"cool":0},"6f6MJU8DcVaiqspQTr5dQA":{"text":"This restaurant is the closest that gets to real authentic Mexican Food. Taste awesome!","useful":0,"cool":0},"Kq4tpyKxDUnAZjTeusVBxw":{"text":"Fresh, tasty, affordable, quick food made to order. If you're staying at one of the hotels","useful":0,"cool":0},"oVYQJ2YQ9OIRYPT_c4ckVQ":{"text":"Nice little Mexican place in the Quarter, well priced, big portions. Guacamole was off the","useful":0,"cool":0},"WqFLkmT1SrDBAOCObVA5gQ":{"text":"We experienced terrible service, inflexibility, and bad food particularly because we neede","useful":1,"cool":0},"rA_NU8rcL8OewyaqA7sjWw":{"text":"Brought here by a friend and wasn't sure what to expect was just told \"trust me\". I'm usua","useful":0,"cool":1},"I1jqmLz4Nm1OPRBsZcKWPQ":{"text":"We had tortilla and nachos here. Very happy with the quality of food and price. Plus, it's","useful":0,"cool":0},"RQMqbHOijpUlPP2l_h2b0g":{"text":"Super cool atmosphere & the food was incredible, fresh & CHEAP!  The bartender made me a t","useful":0,"cool":0},"Fbgfhq4cYYOefZaLbRVlJQ":{"text":"Ate at Felipe's last night. The food was good so we went back. Today we ordered the fish t","useful":0,"cool":0},"56XTp-hrD96pDz7SSUigeQ":{"text":"I called in to Felipe's on 6215 S.Miro st and spoke with a cashier name Roneka ,she was ve","useful":0,"cool":0},"lWnU95FX39PyCYMwoiI2kQ":{"text":"We got a quesadilla and nachos. They had this veggie mix with broccoli that I was hesitant","useful":1,"cool":0},"W9qb1NE0s_57fz5HgvCfFw":{"text":"Possibly one of the worst Mexican restaurants I've ever been to. The queso didn't even tas","useful":1,"cool":0},"qULTgPZwIgCV5_GxQorlLw":{"text":"Words cannot describe how much I love Felipe's. I've never lived in the Southwest, so I ca","useful":1,"cool":0},"K2_rIkKdTScsmFoEF5WbRw":{"text":"My wife and I just visited New Orleans. Unfortunately, she does not like seafood, which po","useful":1,"cool":0},"GKxcu6VbRwuWO8zolYgUQA":{"text":"Good choice for a quick bite in the qtr. Reasonable prices and fresh food. I always get a ","useful":0,"cool":0},"MakeQmgzCs4IwoCG4Nwz4Q":{"text":"So, when in New Orleans you will need a break from the awesome creole food. May I suggest ","useful":1,"cool":1},"RELB7iDmppi_Gw1aMK5esQ":{"text":"Felipe's is my favorite establishment in New Orleans. I love this place to catch a sports ","useful":0,"cool":0},"NH0VN2qka7GX_V1t4X9xeQ":{"text":"No complaints. Food isn't fancy, but it's good and prepped in front of you. The service is","useful":0,"cool":0},"MJzMcjZfVNEP9jzG17Oo3g":{"text":"Meh describes my experience at Felipe's perfectly.  Order at the counter, got approximatel","useful":1,"cool":0},"LeGgGQZjyJfBCa3jPnOXwQ":{"text":"I really liked this place!\nIt's like chipotle or izzos in that you choose your own filling","useful":1,"cool":1},"9MOsqjCEuwCegeMs_sXxfA":{"text":"Another great Felipe's experience.  a great break from \"fest food\" quick inexpensive and q","useful":7,"cool":3},"4FD_f6UEWyFkUV_M4nox3A":{"text":"I LOVE FELIPE'S.\n\nSeriously though. I'm slightly obsessed with how fresh and delicious and","useful":3,"cool":1},"q_k43toZHzIUQjFEXECamg":{"text":"Felipe's was my absolute go-to in Harvard Square and to stumble upon one while walking aro","useful":0,"cool":0},"YuxJA6ujxMjcna3sv-syzw":{"text":"I came to Felipe's Taqueria under the guidance of a local proclaming this place to be the ","useful":1,"cool":0},"MyayXHu9JZFM-UaJ1weoAQ":{"text":"I normally write a longer and more involved review of restaurants  but I find myself with ","useful":0,"cool":0},"Mbh-kiFt5ydNhOKxnE6o_g":{"text":"Update:  my initial review was a 1 star due to my experience and the quality of food but I","useful":1,"cool":0},"VijLIKxwMkEZ0tk-gpaEJQ":{"text":"Be ready to pay! Delicious chicken chimichangas. Very, very good, nevertheless.\n\nThe Bajas","useful":0,"cool":0},"Am2CcV1t11SyUQhxTysjlA":{"text":"Food was decent. Service was horrible. Rude staff.  My friends food never came out. Gettin","useful":0,"cool":0},"kqbDnydY2laMai0No4PE6A":{"text":"Hmmm well there's nothing wrong with Felipe's, but I also didn't find anything to be above","useful":1,"cool":0},"VqUPiXgLMYG8G8qu8K9Npg":{"text":"Found this place on Yelp and decided to give it a try. You walk up to a counter to order, ","useful":1,"cool":0},"AEa8dBTIp3PGzbJV6nPVRw":{"text":"Don't think this a Chipotle's just because your burrito is made to order. Same concept, bu","useful":0,"cool":0},"oeyHEDtzMZYIK2m2UUY36Q":{"text":"Loved this place the first time in NOLA and I'm a San Antonio guy, but Austin was not digg","useful":0,"cool":0},"4IOVTHllGMcFtPpYtilPPA":{"text":"I have to say this has been my least favorite restaurant in all of New Orleans. The custom","useful":1,"cool":0},"FB8MBNyIFPFL5avAwo8NyA":{"text":"Last time here was about nine months ago but, since we were back in the Big Easy today and","useful":1,"cool":0},"k8Ud_DuCqfoUVQtWrLR8Jw":{"text":"Great Tex-Mex in the French Quarter.  We enjoyed chips and queso/salsa/guac along with a v","useful":1,"cool":1},"0LySvOH2_jepwQzhzTC5Bg":{"text":"Drunky food. Yes.\n\nDrunky Mexican food. Double yes.\n\nDrunky Mexican food that's served int","useful":18,"cool":13},"htnDZPKCE2bUcTXgU5xQsg":{"text":"We really enjoyed the lunch here.  It missed the 4 stars by a hair. It wasn't really clear","useful":0,"cool":0},"ZGOoDFHMgz_0NT6NZQoxxA":{"text":"Excellent counter Mexican cafe with a good selection of usuals. Fresh food and good servic","useful":0,"cool":0},"gNX2P_txVe6VGQDMOoKDUA":{"text":"Kitchen looked super dirty.  Staff looked like they didn't want to be there.  Went when th","useful":1,"cool":1},"R6df464rc1CE0P8Yh24Vrg":{"text":"So, it's Mardi Gras Day.  I'm hungry.  Every place I want to eat is closed, because it's M","useful":2,"cool":1},"yWJvl2sK7j0xT3SvLqoRdw":{"text":"I've been a big fan of Felipe's for years. It's consistently fresh, tasty and affordable. ","useful":1,"cool":1},"ar2qonijZtB5o13GUEBppQ":{"text":"Think Chipotle, but with actual Mexican food. Same efficient service and customizable opti","useful":0,"cool":0},"mTTsLIE95UIhmBjJ7UFK0g":{"text":"Amazing food and drink and they make foods that are not spicy .The cocktails a good and gr","useful":0,"cool":0},"qmc_EOVULBEHBH46TQZUYA":{"text":"Food was fresh and portions were big. Loved the chicken tacos!!! Exactly what I needed at ","useful":0,"cool":0},"9A0e583eLCb0IMknITyjAg":{"text":"Every time I'm in New Orleans Felipe's is a must stop. When wondering around the quarter a","useful":0,"cool":0},"mlR8dMNtD7q1wLgw9lknrA":{"text":"The food is decent when you're walking around hungry.\n\nCame here with a group when we were","useful":0,"cool":0},"upmLMqrPCZ0kEDZECVypgQ":{"text":"Vegetarian friendly cheap eats and great drinks!\n\nYes, it's Chipotle-style semi-fast-food ","useful":0,"cool":0},"sYbGT3Q9Q9V94qFwPbyXFw":{"text":"Quick to go orders are great. Stop in for lunch break while working in walking distance of","useful":0,"cool":0},"0_1BBgZ0tVh01lbmMXhwlg":{"text":"Delicious tacos y flautas. Friendly staff and delicious authentic food, I am actually glad","useful":0,"cool":0},"9jjdhQGmsHxb3GqRuPtggw":{"text":"A GREAT experience with an awesome bartender. Even after a very busy weekend this place wa","useful":0,"cool":0},"04dnMldVAGxpzws3rZKnbw":{"text":"The wifey and I come here ALL the time. She loves the food more than me but I love tequila","useful":0,"cool":1},"m4klukKHyr1ST3fqHqQu6w":{"text":"Cheap, good food. Can't beat that. The service was quick, but it looked like the line can ","useful":0,"cool":0},"9ZfmvL-2MuNLp8-K-KK1VA":{"text":"This food is cheap and edible, and that's about all I have to say for it. There is much be","useful":1,"cool":0},"tmgCc5QvnlCmmKpKTjyXlA":{"text":"Wanted to hit the French Quarters, but needed some food first. Checked Yelp! and this was ","useful":0,"cool":0},"t9DY6HquIOlowW26hemFig":{"text":"They deep fried my chimichanga right in front of me!! It was stellar. Their chips and sals","useful":1,"cool":1},"-Ji4glrFF3aE_sHosmZLUw":{"text":"I walked here from the recommendation of someone working at a local hotel. It was perfect!","useful":0,"cool":0},"fXFq_sFpI6D-3IQ2TWnbAw":{"text":"I've been going to various Felipes locations for about 10 years now and have always been a","useful":1,"cool":0},"jmvaT5NgtXH5STLezImC5A":{"text":"Ordered through Postmates and my super burrito showed up cold in the Bywater to a Sunday n","useful":0,"cool":0},"E8ifiUfv95p8r6JsK1Mcmg":{"text":"I love Mexican food and the quality of the food here was not bad. However there are things","useful":1,"cool":0},"7V7L53GQZ0NVw0cF3OaVtw":{"text":"Yes, their queso is good but I've had better. I couldn't believe we were the only ones in ","useful":0,"cool":0},"9f2WFKP96cIkS-SAl_x2Rg":{"text":"I had a quesadilla which was amazing. I enjoyed every bite. I can't make it here often due","useful":0,"cool":0},"8XTwlJWyj71PK77ZP839YA":{"text":"The place was packed, and so noisy that I had to shout my selection to my husband (tacos) ","useful":0,"cool":0},"9uiq3BLd9mmQZuQs5Po3dA":{"text":"Felipe's is great. Thinking about the chips and queso is making my tummy rumble. It can be","useful":0,"cool":0},"6G5z9DeRDW_6zvUfBMGk0g":{"text":"Ate dinner here my last night in town. I wasn't sure what to expect, but boy did it blow m","useful":0,"cool":0},"pyIunxIWI-wXhqrSegfMOg":{"text":"I've said it before and I'll say it again: this place is open late, DIRT CHEAP, and makes ","useful":1,"cool":1},"6RyDQvsNof3nBUoR88yPPQ":{"text":"I love this place for so many reasons. The food, the drinks and Austin. The food is always","useful":0,"cool":0},"AZjShhuTUz0Qiivom-B_pg":{"text":"Literally the best margaritas in the city. They hand squeeze the limes right in front of y","useful":0,"cool":0},"19W46_WVpagma8BG-wnCng":{"text":"One of our friends recommended Felipe's as someplace we should try while in New Orleans. W","useful":0,"cool":0},"R7vsa_Ks0Hk0rDWeJSFL5g":{"text":"This place is chill. Great day on Tuesdays when they have sangrias! I come here for the qu","useful":0,"cool":0},"6fNgmzGKQZgVbeMeSDXqVA":{"text":"Thank you Mr Howard for reaching out and asking for more info. I can tell how much your sm","useful":0,"cool":0},"Pa7P2JIbB2mbXZ_AbqkfsQ":{"text":"Out of all my friends, I think I'm one of the least infatuated with Felipe's. I blame this","useful":1,"cool":0},"Aw1I0G_n1hZ60JyzbevStA":{"text":"After eating NOLA cuisine all week long, I was craving comfort food. So, I hopped on yelp ","useful":0,"cool":0},"aRkWZCEoM8Gn9sOTt05pFw":{"text":"My husband and I ordered Felipe's as a delivery to our hotel. Not being able to fully rate","useful":1,"cool":0},"3GpgtznsQB-Y-amZHA_LBg":{"text":"I'm from So. Cal. So if I go too long without Mexican food I go into withdrawals. This pla","useful":0,"cool":0},"5bdrPspBNYTzIKIRtFlGwA":{"text":"El lugar tenía muy buenas recomendaciones, dice que cierran a las 12 am, sin embargo, lleg","useful":0,"cool":0},"2J4YvMiGO6H686DOgppAFw":{"text":"There are a lot of different options of meat and toppings to add into your entree! It coul","useful":0,"cool":0},"vqIb8XtqO_sWl9RtySWVGg":{"text":"Had two orders of tacos and a quesadilla. The meats (Al Pastor and Carnitas) did not have ","useful":1,"cool":0},"nosHE_003ZLg-9FUnFP43g":{"text":"It's like subway - you go in and basically just ask for what you want on your taco. Everyt","useful":0,"cool":0},"UpWu458ZZgN6-nIiv3PtNQ":{"text":"I was craving a burrito and Felipe's was so clutch!!! The shrimp burrito did not disappoin","useful":0,"cool":0},"zE-0UE4UIdlwqWEdVUwZlw":{"text":"I saw the photos on Yelp and thought it looked somewhat like what I'm used to getting in C","useful":2,"cool":2},"WlteVpAJvPbDgkMiXCfyNQ":{"text":"The food was ok. Customer service was horrible. It feels like you are bothering them when ","useful":1,"cool":0},"t4w4ym1HWJQehaWmurGqOg":{"text":"We came here primarily because we were starving after our flight and wanted something quic","useful":2,"cool":1},"InIVt9tyqF87NqtgHl9E6g":{"text":"Gave Felipe's a second try this afternoon. Got a plato with a heap of rice and beans and p","useful":3,"cool":3},"Tp54vAsWKmDQ3nl1Re8lWg":{"text":"While visiting from California, had a craving for some Mexican food.  Felipe's did not dis","useful":0,"cool":0},"GRuMpJADOx60QZ2IJU1nlA":{"text":"We got back to our hotel late and our options were basically tacos or pizza, so we went wi","useful":0,"cool":0},"0CUkO2h1nvWyftC0FTszSA":{"text":"My boyfriend and I had an excellent experience at Felipe's, when I travel I try to go to a","useful":0,"cool":2},"RuEKdffIFvaFvPXbRaFKrw":{"text":"We were on a hunt for tacos in NOLA and ducked in here during a thunderstorm. I had the ch","useful":1,"cool":1},"W_9BLcUMoi2U0pSXPVmWEw":{"text":"Felipe's is a great place to get delicious Mexican food at a reasonable cost. New Orleans ","useful":0,"cool":0},"RldKJFSGMoYKGopViunecw":{"text":"Call me a Pig, say what you like. But when I tell you the shrimp tacos are disgustingly DE","useful":0,"cool":0},"Q4-B4bjXPwaCk2-ODykeyA":{"text":"The tacos are fantastic! And I'm from Los Angeles, and thus a Mexican food snob. Super fla","useful":0,"cool":0},"UjPZUmErKleSPhdATOGU-g":{"text":"I've also been to the Cambridge location a few months back and was glad to see that the Ne","useful":0,"cool":0},"KYgKR--t66xJ4Vkn6PAR5Q":{"text":"Tacos arent authentic but they were good. Drinks are amazing. They also have horchata whic","useful":1,"cool":0},"jOSroIk9LzK5qFgtqh1wGQ":{"text":"Ordered through Postmates and my super burrito showed up cold in the Bywater to a Sunday n","useful":1,"cool":0},"XSjPAdJITOfCsEJ0pBVaPw":{"text":"A bit out of character for us to stop in on a Mexican restaurant when visiting New Orleans","useful":1,"cool":1},"T0WUTFL2PUWUOb0Il3l4SQ":{"text":"i've been coming to  felipe's for years, but girl with blue hair and bull ring working the","useful":0,"cool":0},"Xv3L4mlIkG2iAhH3z0pLsA":{"text":"So the place looked really good and we decided to try it out. Honestly the food was really","useful":0,"cool":0},"NVBXM8bBvjlQQDrlSHJjoQ":{"text":"Cold food, salsa all tasted old. For being only one of the Mexican places, they could use ","useful":1,"cool":0},"JxA1TsmDbCmNbptCN8eKJA":{"text":"Cant say enough good things about this place. My friend and I stopped in on a recommendati","useful":1,"cool":0},"OfIskosHbMcVeamPRj-8uA":{"text":"Very \"meh\" food for what I thought was a pretty high price. The tortilla soup was pretty g","useful":1,"cool":0},"685Q65O2XBam372mI2XVbA":{"text":"This is probably one of the best taqueria in New Orleans it's a great place to have compan","useful":0,"cool":0},"V4Ms6hK-Eb8vVk4cTKOdLw":{"text":"Love the set up. Pick your meat and put in to your favorite dish. Great prices! Fresh sque","useful":0,"cool":0},"NkVIfcwEaSCIQom9TFvxHA":{"text":"I absolutely love Felipe's! I have been about a dozen times and I just moved to New Orlean","useful":0,"cool":0},"n-OWcDhFhVcJfV1Zr-DODg":{"text":"Felipe's is one of the cleanest establishments I've ever seen in the French quarter. Excel","useful":1,"cool":1},"Ps_XHHc8B5dI-XoplFrnWg":{"text":"Amazing food! We got the plato, taco bowl and soft tacos. Plato was better than the taco b","useful":1,"cool":0},"w01MH7mXe7JypQh31DuFZQ":{"text":"It's a little nicer than a chipotle.  They have a few more options but I wasn't super impr","useful":0,"cool":0},"WcOpJz0YfDgy7cYJIzQCXg":{"text":"My experience here was okay, but nothing that would make me want to come back while in tow","useful":5,"cool":4},"FIhxrlveHG-u5fjG4A0FNw":{"text":"This place got a bunch of good reviews so we decided to check it out! You go up and order ","useful":0,"cool":0},"c65XZ9svv3Kw-ZTCutgbAA":{"text":"to give you some background, I am a New Mexican, have travelled through mexico and have ea","useful":1,"cool":0},"qk3Z9xVznYeZ-W4ZRKHLuA":{"text":"This is a staple! Literally my fave mexican joint in the quarter. Try the red sangria and ","useful":0,"cool":0},"twlZI6KV3--O2ZmeFDySFQ":{"text":"The food was ok. Customer service was horrible. It feels like you are bothering them when ","useful":1,"cool":0},"iTG7Y8gr_Pbtac6_oOgFyQ":{"text":"Ok so were do I begin. This is by far my favorite place to eat and drink in New Orleans. T","useful":2,"cool":1},"AEpnsEI8m7xvos32e_gk2w":{"text":"A lot of options!\nService could've been better but good food made up for the wait and chao","useful":0,"cool":0},"v71aBmlVHaWB3Ow5lBytYw":{"text":"Wow, great Mexican food.  Efficient, friendly and helpful service.  I was new to this plac","useful":0,"cool":0},"pBzSrBAtAtmHTA6Pajct2g":{"text":"Good size portions for a reasonable price. It's a nice change from the southern fried and ","useful":0,"cool":0},"0ZB1qQYBUPTP5P6Php9L1g":{"text":"Currently on vacation in New Orleans and I decided to get some food delivered to my hotel ","useful":2,"cool":1},"YEaIn2NrLe8KC8A7dkgwYw":{"text":"The food was good, but they were out of chicken and most sauces (we went at 10pm so it was","useful":0,"cool":0},"yqnQ_OfdzE_5dcJUokVHqQ":{"text":"Service is always great. Bartenders are always personable and professional yet friendly!!!","useful":0,"cool":0},"9kDaAUEBFYKtrMKXgYG0Sg":{"text":"Monica the bartender is awesome! She hooked us up with some fresh juice margaritas. All th","useful":0,"cool":0},"KSiRq4PweJrJQlSJpXgrsg":{"text":"The food and atmosphere are great. Staff are friendly and helpful. Very authentic Mexican ","useful":0,"cool":0},"gVcrSksK-YgDyGO2xzULMg":{"text":"Big fan. When it's packed and only one side is open (which is often the case), it can take","useful":1,"cool":0},"pSijtOOnhLqpfRTTjD3sbA":{"text":"One of the top 2 or 3 Mexican places in the city. The nachos never disappoint and the marg","useful":1,"cool":1},"-6P52A_NsLINobtRjXCFnQ":{"text":"Simply delicious! That's all I need say. Geaux there. Have a margarita with your tacos! Yu","useful":0,"cool":0},"P2o8rEQ8jKHxxljg2SKWkQ":{"text":"Can always count on Felipe's to get the job done. Only drawbacks are occasional slow-movin","useful":0,"cool":0},"GMx2AQrmAhkM2szgohA5mA":{"text":"Good food. Had an issue and the manager called and adreesed it at once. That's a good thin","useful":0,"cool":0},"XMSgCOsd2BqnDByd2ybNyA":{"text":"Great margaritas, service, music, overall this place is great. Noah is wonderful. Came her","useful":0,"cool":0},"sSCEvxi3rh-wBvZKoPy-UQ":{"text":"Best place to get vegetarian tacos fast and jenifer is always nice and friendly . The bar ","useful":0,"cool":1},"tYJ6K_VkImU2EsKWdHG07A":{"text":"Incredible food and great staff!! Great for margs and Mexican food. They took care of our ","useful":0,"cool":0},"XxGWVveQH7CaWviQTaqwCg":{"text":"Stopped here for a quick bite while out wandering the Quarter. Guac was delicious. Nice at","useful":1,"cool":0},"6tn_2uJK43Wrd7jn_T_g9w":{"text":"I've been coming here for years, I love the quesadillas and recently get the taco salad an","useful":0,"cool":0},"5-IQlG_SUAnNXKAkFUqEBg":{"text":"Delicious tacos, super friendly staff, and yummy Bloody Maria's. This place is the perfect","useful":0,"cool":0},"BfUcrwlGiteUWT_J7sx73Q":{"text":"Super good SF Mission style burritos! Completely hit the spot. Had a veggie burrito exactl","useful":0,"cool":0},"F93lIg2TkPSPpLcWMZzFMw":{"text":"So I was craving a margarita and some fish tacos so we made our way to Felipe's - and I'm ","useful":0,"cool":0},"tk8tlzFomfJW4Y_mfJ9d6w":{"text":"We are so glad we found this place. Really casual, you order from the chalk boards above t","useful":0,"cool":0},"c0YyFBRy9tk3a6AeToB8Hw":{"text":"Who knew Felipe's had kick ass tamales?.. Not me. I've been to Felipe's countless times fo","useful":3,"cool":1},"el2ersHaZpXEYq4n170Law":{"text":"The entrees were very good. I am in love with the steak tacos! The salsa, queso, and gauca","useful":0,"cool":0},"HwrUtfzV3s7SF6Pj9uTHaw":{"text":"If for some odd reason you are looking for tacos in NOLA, this place is for you. The food ","useful":3,"cool":3},"XfmCxRPwRWoS2llfZOUZJg":{"text":"Noah is a wonderful bartender. i've been here before and it really seems like this place s","useful":1,"cool":0},"UVBunBfb_KWr057T9BKg2A":{"text":"This review is for the bar only. Loved the ambiance. Great waitstaff. We only got drinks b","useful":3,"cool":2},"RNsVLIPYcmws5CBN89PoHA":{"text":"Phenomenal. It was our first time in New Orleans and we decided to check this place out du","useful":1,"cool":0},"Wbu-EWvK59o6HoR6dJQDFg":{"text":"Definitely not my favorite Mexican spot but my family and I were in a time crunch because ","useful":1,"cool":1},"-R1UZq8cr1vtsZsFgqOy3Q":{"text":"Want great Mexican in the bayou, this is the place.  Food is out of this world delicious. ","useful":1,"cool":0},"J5a8QoPVxb9VeCJH08ieeQ":{"text":"The margaritas are great! Our bartender, Monica, was excellent! Her customer service were ","useful":0,"cool":0},"cNXHdNR5a0-bAj4GL18dlw":{"text":"The bartender, Lunchbox, was really nice and attentive. Our food came out really fast. I g","useful":0,"cool":1},"hnr0VCe6BevQuEQpfknW_w":{"text":"I freaking love Felipe's. Mini quesadillas are the BOMB. And the workers are very sweet.","useful":0,"cool":1},"GcLIm89rvxcV-VlFDnL46Q":{"text":"This place isn't bad, but it isn't great either. I think it's sub-par in comparison to Chi","useful":1,"cool":0},"eRyx142RXeVye-jmrCSvrA":{"text":"5 stars because of the bartender Jason making it so fun to stick around! Great food, great","useful":0,"cool":1},"xEnpyq6__yNlnKMIhQbh0w":{"text":"Good food. Queso is bomb. Terrible service. Attitude for simple questions?? And demands yo","useful":1,"cool":0},"zj70niDhAHncKHzYteNQug":{"text":"Cheap and simple lunch. We got chips with the guacamole, queso and salsa. Guacamole and sa","useful":1,"cool":0},"EX8x-FlGLlUC-N6NLJhXng":{"text":"Felipe's is amazing!\n\nI didn't expect to find such a great Mexican food gem in the land of","useful":1,"cool":0},"OwxvMv1Oj38k_hOm8RYppg":{"text":"This is the tale of two experiences. We ate in the restaurant on Friday around noon. Servi","useful":0,"cool":0},"P79s93U3eM7txzTCAUnASg":{"text":"Been coming here for years. The bartenders are always great as is the food. Noah has becom","useful":0,"cool":0},"s0JxeN4RMB_3UT3-txezZw":{"text":"Great options that are simple to see and customize! Nice atmosphere. Clean. Football games","useful":0,"cool":0},"bc_8X3gbBS3PlB-ENKbkEw":{"text":"I absolutely love this place! This is my best friend and I's go to place to eat before and","useful":0,"cool":0},"Wr4UN70fppZ0zRq4Mzx21A":{"text":"Best Mexican I've had in entirely too long. \nNachos are to die for and portions are great.","useful":0,"cool":0},"wtWufd6ZEa1N-bkrN8tijA":{"text":"We found this place because we were tired of the fried food and wanted something just a li","useful":0,"cool":0},"i8NU5ARX_AXeHqcGwTq3VA":{"text":"Okay, I feel awful that I haven't written a review for Felipe's until today. This is my fa","useful":1,"cool":0},"ZPlBI2lQVaaZPiKxjGSCuQ":{"text":"I wandered into the bar on a random weeknight, a week or two back looking for cold drinks ","useful":0,"cool":1},"c5-VqyKmPQLLFF6I0dCerg":{"text":"Showed up on a Sunday with a group of 11 and they were really accommodating. A guy cleaned","useful":3,"cool":0},"GnRTBzA8j8W_AITS8gUH5g":{"text":"This place is awful. I went here because it was highly recommend - took trolley to this lo","useful":1,"cool":0},"e7z8Io07Aj639QyTy3RsfA":{"text":"Ordered delivery of two bowls to a hotel. Order arrived as two bowls in a plastic sack and","useful":1,"cool":0},"f6LjIW8397dshs9HWZA7ig":{"text":"Ordered a platos with veggies and guacamole. Literally only received veggies, beans, and g","useful":0,"cool":0},"C8FDJIs5DGpJp1aruUDcag":{"text":"I usually come here for lunch. It has gotten much better since they reopened.  The food ta","useful":0,"cool":0},"weT6Trj_gQiVkwcYxsi7qw":{"text":"I felt like an update was needed....still one of my favorite places to grab a marg and a q","useful":0,"cool":0},"PG1GyRfsE8okUfLdLbTkjQ":{"text":"If you like mediocre Mexican food, fast food, rude attendants, loud crowded environment, t","useful":5,"cool":0},"aPkM52kE7U4qpKSN27f74A":{"text":"The bartender aka \"Lunchbox\" over shook our margaritas, it tasted like water and tequila. ","useful":2,"cool":0},"m4c5lb9CYgf9Yq0NAKfAFw":{"text":"Looking for a nice \"sit down\" Mexican restaurant...this is NOT it. This is a cheap \"Subway","useful":2,"cool":0},"I_Ebo1wki6jAjT7tCdKFHg":{"text":"Food was really good! Def recommend it. Food is very fresh. I got a steak bowl and several","useful":0,"cool":0},"SF6jBr4akurYSEubuSJuJQ":{"text":"The food there was terrible! We went there for dinner and I ordered the nachos and my husb","useful":1,"cool":0},"3qSfWIf0v3eSV1PhnC8YCA":{"text":"DELICIOUS! I'm in town from SoFlo and a waiter Broussards told us about this place!!! Serv","useful":0,"cool":0},"kBk_w3gVZnYHW5Hu9xv7lA":{"text":"Every location is always the same.  Usually more employees working than customers, hard to","useful":1,"cool":0},"ZOyqtPCP2Fvf9iwXHTcq9w":{"text":"I haven't been to Felipe's in a while but I'm so glad I came back today. The food was abso","useful":0,"cool":0},"Eqv6j4Qa1_R5p5LK3yjaqg":{"text":"TACO TASTES LIKE THE BURRITO LIKE THE NACHOS\nlike the quesadilla, like the salad bowl; and","useful":7,"cool":1},"rpMmR9fLmPVdqJMJOzsgDA":{"text":"Cheap eats in the French Quarter?? Oh yeah!!\nCheap eats in the French Quarter with gluten-","useful":4,"cool":3},"ASEuUsI7tjOUTVKzhecIbA":{"text":"I don't know what to say other than I loveee their add on options and build your own expre","useful":0,"cool":1},"UM1SavuWGjNC-u3h8UcS4A":{"text":"This place was amazing! Noah was an awesome bartender! He gave a great recommendation for ","useful":0,"cool":0},"qj5FqCjeekSKFSnVZOFyDw":{"text":"Updated Bonus: the owner reads and responded! \n\nI was admittedly going cheap tonight and e","useful":0,"cool":0},"--pXkkAnJZ1-5fbLqKMLvQ":{"text":"In a word: NASTY. Full disclosure: I hail from San Diego where Mexican food is ubiquitous,","useful":2,"cool":1},"aH-Ke6yrdSk3ve_VGqOxsQ":{"text":"hello im visiting from out of town... and i decided to try your guys restaurant and i unde","useful":1,"cool":0},"WyFQtan5Tl5w2lhx9ZJQtg":{"text":"This worker was soooo polite way and patient with us. I didn't catch her name because it w","useful":0,"cool":0},"lQkQu15xTANurO4XIoPwOg":{"text":"Okay, let's start with the good:\nThe bartender lady was real nice. Service was good. Quick","useful":3,"cool":1},"vfutC8aF0RBEql0KdBI6bg":{"text":"Order at the counter and then sit wherever. Reasonably priced options, decent amount of fo","useful":1,"cool":0},"nJYOGW5rwLVhcPthTHxuyw":{"text":"This is a breath of fresh air in the French Quarter!! \n\nI was in NOLA the last couple of d","useful":1,"cool":0},"icd894qL6h6Haqx2JdbBFA":{"text":"I don't know what's happening on Carrollton but the new staff there is horrible! The cashi","useful":1,"cool":0},"AVfe9EYQv9-vae9mmYMkoA":{"text":"The workers are rude and disrespectful. They are racist and shady. They weren't wearing wh","useful":1,"cool":0},"KJfmgOxkg073IORcWPPcJQ":{"text":"Variety of things to choose from.. very inexpensive and great bar!! It was very enjoyable ","useful":0,"cool":0},"9yMzvTGyNvJbRdcQZCqI9g":{"text":"I came here a few nights ago and sat at the bar. My bartender was named lunchbox which was","useful":0,"cool":1},"o9HYB47KT8UTrQ2TN6NkMA":{"text":"Like I said before we'll never eat here again I'm not sure why 2 months later your still c","useful":2,"cool":0},"pOPq6HckQ0f72i5ghVhTxw":{"text":"Great place to eat whether you are on the go or just want to relax.  I've had their tacos ","useful":0,"cool":0},"cD8pXzYENalzNXu9bAAHFw":{"text":"A great meal. Covid has so many places that are being held down, but at Felipe's, we could","useful":0,"cool":0},"J3R-YYhcXd57zuE6tJzLIg":{"text":"the food is very bland and overall not good 0/10 don't recommend! had the worst experience","useful":1,"cool":0},"CmHjHzq_aBXTHtG_F1lqYA":{"text":"I came here for a late night bite with a group of 6 friends. When we arrived we ordered at","useful":4,"cool":0},"gMLXqJizAXvlgvY6G6m6zg":{"text":"Jessica usually helps me when I come in on my lunch breaks and she is very pleasant and pr","useful":0,"cool":0},"kG8Yh6_5IiOqL7ktQwNgXA":{"text":"SNIDE: smug and often rude serving-line hash slingers;\nINEXCUSABLY LONG WAIT LINES: becaus","useful":6,"cool":0},"WTV5lSfRHQ5MX5aMMDjAFw":{"text":"Good food.  Good service. Great margaritas. Also this place stays open late. Who doesn't l","useful":0,"cool":1},"yqhYjyrAuwjpCNqHM55tbw":{"text":"Stopped in for tacos on the way to work, and I'm so glad I did. Felipe's, it has been too ","useful":0,"cool":0},"LFbI4cxd9DWH_SsYsZKKlg":{"text":"My cousins and I were in desperate need of micheladas after a long night out. Felipe's mic","useful":0,"cool":0},"FSX3pq5Tcm-XpbimboEGlg":{"text":"The Baja Tacos are my absolute FAVORITE! The shrimp are lightly battered & fried & All the","useful":1,"cool":0},"qDwPpNmC3fNjVX1KkIc28A":{"text":"The staff  here was very rude. When we went to order she told us that this isn't the line ","useful":2,"cool":0},"duAebBmW_VcAJLcPMPwpcg":{"text":"Courtni with an I , WAS SIMPLY AMAZING ! She's the best bartender we have interacted with ","useful":0,"cool":0},"_qF7PhDXQqgadHGJ_tcFFA":{"text":"I just want to give a special thanks to Jason and Lunchbox for making eating with y'all du","useful":0,"cool":0},"P5j2FGgslkB4zKLB14aMaQ":{"text":"Horrible\nHorrible\nHorrible\n\n$8 for \"Felipe's Special\" is advertised to include cheese dip,","useful":2,"cool":0},"NYcVI2LIAlx32j2TKCQ9Cg":{"text":"Had high hopes Because it had 4 stars. Food was cold. Service was minimal. The queso didnt","useful":1,"cool":0},"7qg2vW2dZWxafxnRN9cYFQ":{"text":"First off when me and my friends walked in there was a line, no problem we figured it was ","useful":2,"cool":0},"v8kihr2T9NIeSgOG1l4OtA":{"text":"I'm 50/50 the flavors weren't wow it's a decent place, it's comes more off as a Mexican ch","useful":2,"cool":0},"IQpQlFyyZhOD2VCR3vF7Kg":{"text":"Maybe it's just me but there's nothing authentic about this \"Taqueria\". Actually how dare ","useful":2,"cool":0},"zei9IukgAEZ0Pvls2bH1iw":{"text":"Food is decent, the staff is very rude. Be very specific with your order. When asking for ","useful":2,"cool":0},"jmzofZNIIdWEzlBnnhEw4g":{"text":"For a place that has been a personal favorite for years, it has become a true disappointme","useful":2,"cool":0},"QABJ9Wxh-VoLxKwgj4P0TA":{"text":"Food is good but the real gem here is going to Jason at the bar or even better when he is ","useful":1,"cool":1},"PXBE2GeMh6s_075IeKHVQg":{"text":"The food was ok. I had to chicken tacos with cheese, guacamole, onions and cilantro. Every","useful":2,"cool":0},"eBF8gLcTiPRcg_q2o0NRfA":{"text":"Perfect stop on the way to Jackson Square. Get a little bit of Mexican while in this Creol","useful":1,"cool":0},"e9HNwAhJq2NI7oh-022zfg":{"text":"Omg! I was rushing to get back to work from my lunch and stopped by here. The attractive b","useful":1,"cool":1},"fa0oSgy7rXQe_ptjb2ILHg":{"text":"It was late after the Pelicans Win! I ordered a taco salad with fried shrimp. They were ou","useful":0,"cool":0},"Nt7-5q7n6HtWKFo6fkLMUg":{"text":"My sister recommended this place and it was great. \"Really yummy food that is inexpensive\"","useful":0,"cool":0},"j-amjSTzD5VBiTLwZOd7LA":{"text":"Felipe's has something for everyone. There are various options if you don't eat meat. It's","useful":0,"cool":0},"KroM8ofyP-k1oVhx3BzPJA":{"text":"Some of the food was good, some was meh, if a bit pricey. The staff were helpful. Highly r","useful":0,"cool":0},"h456Q-tebH44K6WxQhMyGA":{"text":"Love this place!  Huge portions but Felipe's is an ala carte restaurant.  Don't expect to ","useful":0,"cool":0},"tte-GQop1cN0jFuBTHGahQ":{"text":"Good Mexican food but a slightly confusing assembly line process. There are tons of option","useful":1,"cool":1},"avV_J7rwXRtcrvRKrmkRjA":{"text":"Ordered food through Uber eats and had ordered flour tortillas for my 3 orders and got 2 o","useful":1,"cool":0},"URc74el4EbdCSaLaUVUS7w":{"text":"It was good in a pinch. My friend and I were pretty hungry after walking around New Orlean","useful":6,"cool":4},"YE3BhvZ-qyXAa99Nn45qlQ":{"text":"Had a super burrito with shrimp.   Shrimp was fried, not grilled which was a bummer.  Howe","useful":0,"cool":0},"WkI0MD9TMUdGQ_YD1IM1Ww":{"text":"If you just want to stop in for a quick marg and taco...this is a good place. The sangria ","useful":1,"cool":1},"bUFSDljAiwKXo7aMU3IjtA":{"text":"Ordered 8 shrimp tacos and beans & rice with chicken for delivery. Each Taco only containe","useful":1,"cool":0},"F7smucxuADAsxq5OKTF6NQ":{"text":"Stopped here for a late-night dinner and the food was very good considering it is basicall","useful":0,"cool":0},"yE0PV4ApS6vuBMTGepm9VA":{"text":"Nice clean place with a large menu and great bar. Andrea, Jessica, and Ebony behind the co","useful":0,"cool":0},"5gT02YPZIpT7BpkfeHDXEA":{"text":"Stopped by this location to get some food and some margaritas before Krewe Du Boo! Everyth","useful":0,"cool":1},"en5vDGbxaItWooJDR7KyEg":{"text":"Absolutely love Felipe's everything was so fresh and such a clean place! The manager Nick ","useful":0,"cool":0},"i_CAPBE27-We4lWB-dww0Q":{"text":"Courtni and Jasmin were awesome! They were prompt and allowed us to get our work done whil","useful":0,"cool":0},"iOXDFyue5dgT6BIpgO7fjA":{"text":"This was a good lunch time option during our visit to New Orleans. I took 2 tacos to go. T","useful":0,"cool":0},"Q7jhWpS0gEREnAyWu2_WZw":{"text":"ordered ahead through their website on a saturday around 5 pm so i could grab it real quic","useful":0,"cool":0},"Rxs3wNvd2yJhagrZoJev5g":{"text":"Average food.  Everything is dirty or sticky -- seats, tables, floor, salsa bar, etc.","useful":1,"cool":0},"Hb4-0n5TbK9ABTgIE32tvA":{"text":"Felipe's is one of my go-to's in the area. If you've ever been to a Moe's, Izzo's or Chipo","useful":1,"cool":0},"cpyMjO_8KcnVnlTptp_51A":{"text":"Courtni is the best bartender ever.. I will make sure I only come to the bar when she is w","useful":0,"cool":0},"5cZ0jn5pZt25P7vjznL94A":{"text":"Ate here it was so good corrine was a very attentive manager she's the best I live in Mand","useful":0,"cool":0},"Mi115ZutiA9g5BzrD_gOXA":{"text":"I'd give the food 5 stars... but the cashier and bartender had MAJOR attitude! Be clear on","useful":2,"cool":0},"kL3gdclgoSPqKDA25ikZ6w":{"text":"Great menu and service. Neighborhood convenience. Traditional hard shell tacs! Oh & The Be","useful":0,"cool":0},"LCdvgqjo53mjV6vG5Uh3Bw":{"text":"Almost didn't come here because I have had issues at the one on N Carrollton( they have si","useful":0,"cool":0},"S6ow94_K3IgQVntC2a9dcw":{"text":"It is always a mistake to come here. The folks behind the counter are miserable. And they ","useful":1,"cool":0},"LzE_fMZzoI0Un1VS_7ojDQ":{"text":"I don't know what the hype is... this place is more for the white washed Latinos and white","useful":6,"cool":1},"4ic2o7k25BmzQquzwN3OFQ":{"text":"Extremely disappointed in the quality of food I received from this place. I was most annoy","useful":2,"cool":0},"MARx8-uHSz052Ey57Osa5A":{"text":"Jason and his team at Filipe's have done a nice job throughout the pandemic.   My last vis","useful":0,"cool":0},"tEWoGAXztcBAkc4ByY4llA":{"text":"Horrible experience. Don't order the flautas unless you're in the mood for some TINY TAQUI","useful":1,"cool":0},"8uRS9SSvL_Lo27KHk7QfBA":{"text":"This taqueria had caught our eye. Wanted to order a small plate and cocktail to then head ","useful":0,"cool":0},"M1I-TFh1y8nYMzq5gyn3dw":{"text":"Assembly-line Mexican food joint in the bustling French Quarter. Not too crowded on an ear","useful":1,"cool":0},"hxDoUn12UD1RASwGqLrecA":{"text":"Literally the only place that can cute a Nola Hurricane hangover. Thank you for saving my ","useful":1,"cool":1},"wsDXiO8n1kfMMQT0UpVJAw":{"text":"This place is set up kinda like a Qdoba or chipotle - assembly line process. The staff see","useful":5,"cool":0},"DCSnygTCa8-fqHgbrdH-mQ":{"text":"Good food for the money and you can pay with a credit/debit card.  Tinga chicken has a lit","useful":0,"cool":0},"9nu4u5eyTu9ACAGAjeoExA":{"text":"Okay burritos, good for a quick lunch if you're in a hurry. Not my favorite place to sit d","useful":0,"cool":0},"bnsH8pxnsvIxHbZD0K2vyA":{"text":"Felipe's has ALWAYS been one of my favorite restaurants and always will be.  Recently ther","useful":0,"cool":0},"h1gC2Wu4VeYnHv-FKORDGg":{"text":"Great restaurant managed well during COVID!  Special thanks to Jason for doing such a grea","useful":0,"cool":0},"ZysqqS_GCecdy1fLwdiqWA":{"text":"My buddy Dale said this the 'the' place for Margaritas.\nWe stoped on on Friday afternoon o","useful":4,"cool":1},"kYvdcLCAp_AYT7oF3FWb9Q":{"text":"Prices went up but food is still good. Typically don't wait long. I love when they have th","useful":0,"cool":0},"OjRdiZwh3oh65TXeSq4UxA":{"text":"How can you not like Felipe's?? They have some of the best mexican food, wonderful drinks,","useful":4,"cool":1},"yYObFnfOMk6usvJpA3C8DQ":{"text":"Came in for a quick afternoon pick me up on the recommendation of someone who use to live ","useful":0,"cool":0},"I5VNfuYkQ2gRJD6RrMkomQ":{"text":"Great fresh food, prices so reasonable you won't believe it. Nothing we've had is TexMexie","useful":0,"cool":0},"f_eaCsXQlVHj-LpEygIFRQ":{"text":"My husband and I stumbled upon this place during our first visit to NOLA a few years ago. ","useful":1,"cool":1},"NodUVvpcZ7-OiZPo311vuQ":{"text":"Meh. If you need something  fast - this will do, but don't come here expecting anything - ","useful":1,"cool":1},"3-WfVVBr2ZVKT8g0kMTobg":{"text":"Terrible service, this bartender ignored my wife and I even though we were only one of thr","useful":4,"cool":0},"7X89PjsWivwT8P8pN5oK9A":{"text":"Not the typical tourist trap.  The prices are very reasonable and the food is really fresh","useful":0,"cool":0},"tCw8arfM4VybcQftd0RpVA":{"text":"Hello guys!\n\nAre you looking for a delicious mexican food?\nWell, I would like to recommend","useful":0,"cool":0},"p4VMzJ-heg1AuanOJkX77Q":{"text":"Felipe's is definitely my favorite burrito in the French Quarter!!! I always get the veggi","useful":5,"cool":3},"IGkuDEfK3j74jZAXvmD8aw":{"text":"the best soup i've ever eaten in my life\ngreat family like environment good food\nand event","useful":0,"cool":0},"Se-EkJU3iZCxsiDvo0DfFw":{"text":"We came here on our last day visiting NOLA, and absolutely regretted not coming sooner. We","useful":0,"cool":0},"mvmrFEskrKe7Pt62JIBQkg":{"text":"GO GET TACOS HERE. Best tacos in NOLA hands down. Staff is allotrope stand offish but the ","useful":0,"cool":0},"UWM4so8yUwXk9fVXgjoZ9g":{"text":"Just a bad experience!!! The manager asked for me to put some of my food that I paid for i","useful":2,"cool":0},"Qx1-9W4b8Zxns1VzKJoFBA":{"text":"Great Fresh-Mex. Inside seating was a plus. Great street tacos. The Pastor was killer. Fre","useful":0,"cool":0},"XJUKtdVgB8cOHHS2X7xkcQ":{"text":"Food is okay, but made us pay 2.50 for chips seperate from our queso. Manager wouldn't let","useful":2,"cool":0},"H-0tM-jZoUbfsGSmlIsUOg":{"text":"Love this place. The frozen margaritas are to die for. Great food and great bartenders. No","useful":0,"cool":0},"64OoMDbilnlzZhwfU4V8Qg":{"text":"Pretty gross assembly line Mexican food in the style of Chipotle, only without the delicio","useful":2,"cool":0},"8Mw7f1NLD74sIYEp_ZUFOQ":{"text":"1 OF 7 RESTAURANTS I HAD TO REVISIT BEFORE MOVING OUT OF THE QUARTER. Yep, after almost 20","useful":4,"cool":2},"dEYqJf2Zt84mg3QwhC1_Vw":{"text":"I ordered lunch from here this week and it was delicious! I ordered their Plato with black","useful":9,"cool":9},"ykZ9eyLAa3JymZQJoFliow":{"text":"Was looking for a quick bite for dinner and we ended up here.   I really like the vibe of ","useful":1,"cool":0},"1l-eZXw3PNicvEvervhJDg":{"text":"Food is great, but was really looking forward to a good margarita but was disappointed. So","useful":0,"cool":0},"hYsGjTgWXOkbkVjO1lsdvg":{"text":"Te amo Felipe's! Felipe's is great, made-to-order Mexican and fairly inexpensive compared ","useful":6,"cool":5},"uDdDG5EM5n3fhJi4JlPLlg":{"text":"Fresh Food, great drinks!!!! Staff is super friendly!!! Shout out to Nick!!! Great attitud","useful":0,"cool":0},"jwUvZswGTxRPZyqijJtr2A":{"text":"Super overpriced for what you get. Felt embarrassed and angry when the staff seemed to be ","useful":0,"cool":0},"fZlIklOLrOiHGsMRa2d-4Q":{"text":"The staff is completely rude. They over charge the shit out of veggies. $2.50 for a 1/8th ","useful":1,"cool":0},"VgmveqZPzhGYXGhG__y-WA":{"text":"Right by my hotel, highly recommended by staff there. Food gets the 3 stars- it is good an","useful":0,"cool":0},"i-yPjX7lsOzeyLYPHkD4VA":{"text":"Worst Mexican food ever, not to mention the service was totally unacceptable there was sev","useful":1,"cool":0},"K3Ye7l45bLmrdXy_oxzj-w":{"text":"Visited with a girlfriend on vacation and couldn't have had a better time!!! the food was ","useful":0,"cool":0},"GN4SsgkRpD_SMZ__u5ZX5Q":{"text":"I'm sorry but it's worst mexican food I've ever tried. Tortilla soup seems more like an It","useful":1,"cool":0},"dKmUf4LpsPozdTnWmzgazw":{"text":"Surprisingly good tacos in the French Quarter! I only say \"surprisingly\" because New Orlea","useful":0,"cool":0},"hDlEWqsDtISHn_Vmds365A":{"text":"This place used to be good but lately, not so much. I ordered two fish tacos and got the t","useful":1,"cool":0},"s3QfyvN3Q8Uy1hB7D4EwZw":{"text":"After checking into our hotel, the super woman at the front desk gave us a laundry list of","useful":1,"cool":1},"QY93hJ1XQuomrhu3_msg3g":{"text":"This is legit my go to spot I don't care if I just ate! Ok so listen you gotta get a chick","useful":0,"cool":0},"J46lwczAo9UOFvc4GCnSCg":{"text":"Awesome service very homie feeling good food drinks an nice an enjoyable music especially ","useful":0,"cool":0},"i2f27w9shSLuSVj5ood24A":{"text":"I have lived in New Orleans for some 13 years now and Filipes is one of my favorite Mexica","useful":0,"cool":0},"7Ar82u7RpgPGO0ahLRFGVw":{"text":"The reviews for this place are very deceiving. This place is not a sit down, authentic Mex","useful":1,"cool":0},"1JC96Sz4Bf2VMqtN67Bg1Q":{"text":"I've avoided reviewing my beloved Felipe's because words can't do it justice, so I'll keep","useful":1,"cool":1},"ozmlXVOVYWOMBNiR8I4V4w":{"text":"If you love Mexican food this is not the place for you.  I would have rather eaten Taco Be","useful":0,"cool":0},"6RCOo922xSDiYrm2zposWw":{"text":"The only positive thing you have to say about this place was it yes they were sanitizers o","useful":1,"cool":0},"mWHGzc1MosEe0g69yAvgjw":{"text":"I am not a burrito snob, so many West-Coasters will probably rip anybody that gives Felipe","useful":3,"cool":1},"6taNFnffIuuydRe3tWbVpg":{"text":"One of my favorite Mexican food spots in the quarter. They're pretty quick even when they ","useful":0,"cool":0},"dgi9_b0T6vUNMS2621wNtA":{"text":"Walked in just to grab a taco and keep walking, but at the bar Noah made us delicious drin","useful":0,"cool":0},"Dn7u2167uZ4yQn7x0RClVA":{"text":"This is the worst Mexican restaurant I ever ate in in my life.  What this chain has done i","useful":2,"cool":0},"-YH2N_2-zh5Om5vK2xdmow":{"text":"Flautas: They are missing something. Maybe not rolled correctly or filled properly but the","useful":2,"cool":0},"gPUYXcUsFUeX3aXF7f1Z2A":{"text":"A lot of the staff really sucked. First the server tried to give me a go plate after telli","useful":2,"cool":0},"vbd0IPrcWlnByq74_lpAmA":{"text":"The food was ok. I had to chicken tacos with cheese, guacamole, onions and cilantro. Every","useful":1,"cool":0},"7npYx07HEGM_WeLz27MB0Q":{"text":"I used to look forward to Wednesdays and the Margarita special at Felipe's. It's been seve","useful":1,"cool":0},"mF2GjbE-plLueksPDmkdNA":{"text":"We stopped in for dinner last night around 10pm ordered flautas, rice and beans, and chips","useful":1,"cool":0},"8qtYjWx3u_hKJkFeTDm7Eg":{"text":"Okay so I normally come in Felipe's, I'm a local I know the crew members by first name bas","useful":1,"cool":0},"2RKTLFNJ8pNq1JpRjTd35w":{"text":"Really good quick service Mexican food made to order!  Good value and fast service in the ","useful":0,"cool":0},"dbyz5l74dbQI7Xq9L_Gldw":{"text":"The food was good, but they were out of chicken and most sauces (we went at 10pm so it was","useful":0,"cool":1},"2uMk01UhPZMhV5OdZbLhag":{"text":"Update: To answer your public comment, I didn't respond to your last message because you a","useful":5,"cool":0},"jTf5U_xTQslTIzURbyxLjw":{"text":"As a girl from Boston, this place is absolute TRASH. This place bears no resemblance to th","useful":1,"cool":0},"FrXPWxJGrMe2Zy2vYUJJoQ":{"text":"I was in the Q for Easter and a fellow comedienne and bartender extraordinaire Sierra  F. ","useful":8,"cool":4},"W4b4gJmx62yKsPjgXUoWgA":{"text":"I got the super burrito ask for extra chicken and extra rice still a pretty small burrito ","useful":0,"cool":0},"6VlhdebaIBeM8Wt_ugeO1Q":{"text":"Whoa! This was TERRIBLE. Bland. Undercooked chicken. Disgusting queso. Honestly,  and I'm ","useful":1,"cool":0},"B6OGALGDZR3z5-Ds5amS3A":{"text":"So, we were out to have a mexican food. We came across this place and decided to stroll in","useful":0,"cool":0},"Mp_THkAkY0poJW5FS3oWyw":{"text":"Disappointing  \nI'm from Southern California and this place could not compete as a taqueri","useful":2,"cool":0},"MzQT3vAe_8as9q_NqluAAw":{"text":"Been a regular here since my college days (over 5 years ago). Consistently great food and ","useful":1,"cool":2},"LnFO5iP3T5sa-R6QdNVOaQ":{"text":"After a long business meeting, I was looking forward to having a super burrito and a marga","useful":1,"cool":0},"eRmbF8SPXRjgEAFnRGFd5A":{"text":"Went here today and ate at the bar. Noah was our bartender and was so friendly! The food a","useful":0,"cool":0},"aBx-JFKlvoUUdrrWLZpOlQ":{"text":"Came in to get chips and dip and drinks. $12 for such a small amount. The food might be go","useful":1,"cool":1},"tkjwT3SzhKnLnF8Tt-fA4g":{"text":"This has to be the dirtiest glass I have ever seen in a restaurant.  I can feel the film i","useful":0,"cool":0},"DLIZgElO2iMWRtm7JEWR7g":{"text":"hits the spot for some mexican, especially if you're on NA vacation and are trying to eat ","useful":0,"cool":0},"zEsWCSyhxSGRiSRt6aSBZw":{"text":"Extremely rude staff. Went in to look for a table for our large group and was promptly sho","useful":0,"cool":0},"EpHcPR9Uw26yzIn2QC-njA":{"text":"Edit: the owner contacted me and asked if I would accept a gift card to give them another ","useful":2,"cool":1},"DLEUKOGvxAAA5cPjgstRAg":{"text":"Awful, just awful Mexican food. We ordered a delivery for one steak burrito and one plate.","useful":1,"cool":0},"SSCNmdDDAm-BNRgj0_LXpA":{"text":"This place has great drink deals, some of the best burritos in town and a super friendly s","useful":0,"cool":0},"FQVpM7S_kyLRTffiXvp2kw":{"text":"Overly priced! Not authentic Mexican food. For a family of 7 I paid $100 and it was not ev","useful":0,"cool":0},"VghFJ6XB1Rvp8yYN_7JFXA":{"text":"There are mice running around in the dining area by the bar. Also the only reason it got a","useful":1,"cool":0},"qqD1XbT2IeDzSs_eLoGv7A":{"text":"After walking and shopping around the French Quarter, my friend suggested we trip Felipe's","useful":0,"cool":0},"7AsWzbun8tKBje9sTwvdag":{"text":"Found this gem during Essencefest in NOLA. Asked a local where to get a good taco and they","useful":0,"cool":0},"i6Ohkt3hJRXaeC8r6P5S2w":{"text":"It is 2018 and just wanted to say that I still love this place so much!","useful":1,"cool":1},"ZDvRfKzpJgCJnbIJhi675g":{"text":"Came in for a quick drink around lunch time and my bartender Noah went above and beyond. H","useful":1,"cool":1},"HB_-XC8m7w2WNR60UAxFuw":{"text":"It was alright. The beef was cold on the nachos... there were like 2 pieces of diced chick","useful":1,"cool":0},"gQt4-aHWEkT3hKq6OO0qfg":{"text":"I must first disclose I am a born and raised San Diego guy. Although, I will do my best to","useful":2,"cool":0},"lwVdInFb0poupjOi7Tnf8w":{"text":"I'm sad I wasted a meal here. The food was mediocre and didn't taste fresh, but this revie","useful":1,"cool":0},"ULieEjVHlg7Q3wI8PF78OQ":{"text":"I love felipes it's a great place to eat , have margaritas after work , or to have family ","useful":0,"cool":0},"s1wCzLhmohvSTPN4_UWmaw":{"text":"I've tried several times to like this place but the food quality is really random. I tried","useful":2,"cool":0},"-X011HI79bN5Hzp7ilz40A":{"text":"I stopped for a few drinks after doing shopping in the Quarters. The bartender, Noah offer","useful":1,"cool":1},"AYny0XHAz3WgCG2lejWJlQ":{"text":"Ordered this from Felipe's the other day: 2 burritos, chips and queso, and an order of chu","useful":2,"cool":0},"2lUU8UkFczGSB_IB2f_WnA":{"text":"The bartender, Yen is the bomb.com! Visiting from Chicago, I'd already reviewed other yelp","useful":1,"cool":1},"DtmENlkJNLutQ5SejPxhOQ":{"text":"I used to look forward to Wednesdays and the Margarita special at Felipe's. It's been seve","useful":2,"cool":0},"zQvIkPTUxoXAnwd9S4oYGg":{"text":"Went for Cinco de Mayo. We had  Chips with Queso, Three Tacos with chicken and steak, Thre","useful":0,"cool":0},"OkAA-iV3e2pCPLSTGJDIEA":{"text":"Great food and reasonable prices. Just make sure you tell them how you want your food, mak","useful":0,"cool":0},"9otY2PmlYs-FHs4lnxZtKA":{"text":"This is the absolute worst Felipe's in New Orleans. The management is clearly the issue he","useful":2,"cool":0},"znJg0PVxv-4hF9snlOkg7A":{"text":"This is the best Mexican restaurant in the City of New Orleans.  When you walk in you feel","useful":0,"cool":0},"4_Ahqw-hHsEEUhzfXEwJAw":{"text":"Ever since I first interviewed in NOLA back in 2009, people have raved on-and-on about thi","useful":2,"cool":0},"7Pwv_lnZyacAHuGBDzW4xw":{"text":"Went to Felipe's for a quick dinner before we continued our night out in New Orleans. Firs","useful":2,"cool":0},"y8SFeyN3ryE3tVr4oqMHUQ":{"text":"I ordered this to-go. 8 ounces of queso $5 and 4 ounces of chips $2.25. Yes, they charge f","useful":3,"cool":0},"fnwwdvdtVFFR1fBuYGTH3g":{"text":"Oh ouch!   What an ugly, poor tempered, and unprofessional bartender!   Yes, that means YO","useful":5,"cool":2},"wivFiQDC3rjEJJ9_CvdKeQ":{"text":"Worst experience I ever had last night. I've been here several times and it's always been ","useful":0,"cool":0},"dnQVSrlG7urzyXs7RhEcAA":{"text":"I was a little thrown off by the fact that it wasn't a sit down restaurant but that's not ","useful":1,"cool":1},"DG4XmNnPQeNHmfhKt9Fbqw":{"text":"it's alright. it's a good, fast burrito if you're in a rush. the al pastor is pretty good ","useful":0,"cool":0},"SPKwjYYoPtsJUC8nBk1AGw":{"text":"EDIT: the owner has reached out to me directly which I greatly appreciate. We will give it","useful":2,"cool":0},"1b4uEtDc_8po89cfNJev8g":{"text":"Felipe's could not be in a more convenient location - right smack in between two tiki bars","useful":1,"cool":1},"ixX_lEBipTUl65r-orLRpg":{"text":"Simply amazing!! I lived in Guadalajara Mexico for 4 years so I have a little knowledge of","useful":1,"cool":1},"prPjywEJuxYJoZ8bbeB7cg":{"text":"If you're looking to sit down and be waited on, Felipe's isn't for you. If however, authen","useful":1,"cool":1},"psQhYBIut_WEhkDfU8mfrw":{"text":"Great tacos in New Orleans!   Not an oxymoron.\n\nWhen I walked in I _almost_ turned around ","useful":1,"cool":0},"M1P8O8PEGk4OUEU7HQQlhA":{"text":"This is a \"order at the counter\" place. We loved the food! We had gringos tacos, a quesadi","useful":0,"cool":0},"w_BsMGufCC2BV2Y9Nrm8yg":{"text":"This is by far my favorite place to get fish and shrimp tacos! It's about $2.50 for a smal","useful":3,"cool":2},"Fsx9GnlLl7hb7fOKRSeJiw":{"text":"Very below average. The guacamole was the only decent thing  on the menu. FYI you order at","useful":0,"cool":0},"g5YfcrfPbfDdKpFIaMtrwg":{"text":"This is a good place.\nI had the burrito bowl with spicy Chipotle sauce...it lived up to it","useful":1,"cool":0},"G--Z981BiX9YfqpgTCkOFQ":{"text":"So fresh and so good. Really glad we came here. Reminded me of the places I've been to in ","useful":1,"cool":1},"FKZLEWem4VG2zTZrueaeLw":{"text":"Great location and great food. The staff were all courteous and friendly. One in particula","useful":0,"cool":0},"_vrrWkxsqZ5kkDE9mm_E8g":{"text":"This is a good place.\nI had the burrito bowl with spicy Chipotle sauce...it lived up to it","useful":1,"cool":0},"4adkHji7dUod1zsGuM9YHQ":{"text":"The food was so very tasty! If you want a taste of home, here is a nice spot to land on. F","useful":1,"cool":1},"OjShJRhVCBWZ5ixzFgrwGQ":{"text":"After a week away from So Cal I was in need of some tasty Mexican food.  There are not of ","useful":1,"cool":0}}