{"bLLrX4Nrl5PbO8q8GbmAoQ":{"text":"The restaurent is very clean inside. You can order either from the menu and from the bar. ","useful":1,"cool":1},"ol-HMAVL3s4GqpswJwUjyQ":{"text":"For a hole in the wall kind of place the food is freaking phenomenal ! The mashed potatoes","useful":3,"cool":1},"uDD3rzOikzx6yww3J5Lufg":{"text":"I love boiled crawfish and this place has some of the best I've ever had! I will definitel","useful":0,"cool":0},"zGqjlx92wlwKLgpjRhztVQ":{"text":"Food was good and the servings are huge. The customer service was great as well which is a","useful":0,"cool":0},"jsW6uhC_ZKXHLqq18_Ie6g":{"text":"Since this is the ending of the season to get crawdads around 8 pm on a Sunday. We made ph","useful":0,"cool":0},"jMI_vSdtx9BgQP1rbd_MCw":{"text":"I come here all the time, as it's around the corner from my house. \nFirstly, the crawfish ","useful":1,"cool":0},"RKEz9uMJMlUlE52Cy13yKQ":{"text":"This review is way over due! Lets start of by saying that I went to multiple places to eat","useful":0,"cool":0},"g6WU-O0qKXT8PYVCrmlucA":{"text":"Had a plate from here for dinner. Cool lady serving the food was nice enough to let me try","useful":2,"cool":0},"19XZsQedRSqZyeOgkZRrYg":{"text":"They make it fresh right in front of you. My wife bought a pound of crab legs here. We are","useful":1,"cool":0},"2KQp3RVRt8zk_ygBfosp2Q":{"text":"I really like this place. It's big and clean with a good flow of traffic every day. I'm us","useful":6,"cool":3},"8UMg_BrcejOi4FKXoeLl-g":{"text":"Great food for cheap. The mash potatoes is phenomenal. It is as mash should be - dense and","useful":0,"cool":0},"-g52W8JPe9LYFn9Boo5Wpw":{"text":"Love this place! The portion sizes are big for the affordable price. Their crawfish was se","useful":0,"cool":0},"noQik3Fk_qWcU6FITT7NNw":{"text":"Best Crawfish in NOLA, Super nice service and well worth the walk. We will be back next ti","useful":1,"cool":1},"EXX2ihv_lZHNfmBBHbhVIA":{"text":"Wow! What a great accidental find.  I can't list everything but chicken, pork chops, catfi","useful":0,"cool":0},"JC2ROxcJ4Hz2HytpEW8pCA":{"text":"Came here because Kayla's was closed.  Had gumbo and cornbread on recommendations of other","useful":1,"cool":0},"D5RFn71f17xwvDYHM1qDqg":{"text":"Worst boiled shrimp I've ever had!!! Had gumbo, boiled shrimp and cabbage cause they ran o","useful":0,"cool":0},"2R_YoH6sPvYUAc2b_IyqyA":{"text":"Forever will this be my must visit when down in nawlins. The prices are great and you can ","useful":0,"cool":0},"L6AxUUSUqi_EKqi-4Fzb3A":{"text":"Gumbo and red beans and rice are awesome!  Try the shrimp o boys too. Really good food","useful":1,"cool":0},"WdTeW5DWZaemS06zMGJZ_w":{"text":"This was a real disappointment. Their seafood is over breaded and fried until it is hard. ","useful":0,"cool":0},"g9nM4i8uzIuBneRFjCRdgA":{"text":"Crawfish were cold and half of the bag was claws. Flavor was decent. I didn't get a chance","useful":1,"cool":0},"HN0lHtJQToyTD7hbxwvDDw":{"text":"Not fancy but you get your no-nonsense Cajun-style itch scratched here. I saw a lot of loc","useful":1,"cool":0},"6t-CgIYkVFhMM-ZFV8r0fA":{"text":"Extremely disappointed, went there for the crawfish and seafood. Despite what photos show ","useful":0,"cool":0},"zSVjryuSunCVl_3yyoVN7w":{"text":"Wholesome, delicious, reasonably priced, and as long as you don't need ambiance, it's perf","useful":0,"cool":0},"lzMwXaajoBiEmZh03Tma0Q":{"text":"My husband, daughter and I can here today. BEST decision EVVVVERRRR!!! My daughter had the","useful":1,"cool":0},"8Hp3BkTWO1jsFxJmsiEDIA":{"text":"Had dinner here for like the 30th time. The food here is always plentiful, hot, and fresh.","useful":0,"cool":0},"OMo2MI0eCnD_q60wUQw2HA":{"text":"Loved this place we ended up here after way too much eating at \"high\" end places over the ","useful":1,"cool":0},"AhC4g1S1Finh53SATTcjGw":{"text":"Definitely worth the trip. \nThe crawfish have just enough spice to be perfect. \nThe soft s","useful":1,"cool":0},"KEERjlZs8A6jRkqNgaNayQ":{"text":"Maybe, it was because I had not eaten all day, or maybe it's just that damn GOOD!!\nFound t","useful":1,"cool":0},"hGWzDAtWgC_CPzJrn-p8QQ":{"text":"Googled this place before going out of my way to try it out since I kept hearing from co-w","useful":0,"cool":0},"hVmdfI5KI39-FNeBfTRvoA":{"text":"The food here is SERIOUS. They don't play with their po' boys, gumbo, or red beans and ric","useful":2,"cool":0},"avFgVXUJtHrMyfQbskTbkQ":{"text":"Not lovin' it, not even likin' it. Was in the area to have beignets @ Loretta's & decided ","useful":0,"cool":0},"-sLZh0xLjHe6Dijh7OzLkg":{"text":"This place was an unexpected surprise. The parking lot was pretty empty and it was raining","useful":0,"cool":0},"xvIQEwL1uROHJ1gRcE2kXg":{"text":"I go here at least twice a week on my way to work and on my way home. I've tried almost ev","useful":1,"cool":0},"aEW8Z_fX2tHsSaoYUH30YA":{"text":"I got the gumbo as my first experience with the dish from its birthplace. I was pleasantly","useful":1,"cool":1},"jvB0GbNWRa72mZY8_qGDaQ":{"text":"Loved it! Had their crawfish and gumbo both had great flavor. Fairly priced . The lady let","useful":0,"cool":0},"_3x_uQDk5NbAOPYiWOMAwQ":{"text":"Full disclosure: This place gave me nasty food poisoning and cut short my only night in to","useful":1,"cool":0},"zcgGR2QMF25zHdmHE2ICIg":{"text":"What is wrong with the people that reviewed this restaurant!? This is a shit hole!! The fo","useful":0,"cool":0},"TzVCVhyNybPNQyJH4TivEw":{"text":"Cheap off the beaten path and nice people. They were even nice to the slight crazy guy the","useful":0,"cool":0},"zCvuTmvc9S0vC7irtGJocw":{"text":"Very tasty steam table food. We liked the gumbo the most. Definitely good value for money.","useful":0,"cool":0},"usXJpPJRVUIws9ri3nRaGQ":{"text":"The 3 day pot roast is awesome.  They give you plenty of food.  I highly recommend this NO","useful":2,"cool":0},"MSJTn-MZr-sCHIQatWfB5A":{"text":"This is one of the best places in New Orleans to eat. Every time I come to New Orleans I m","useful":1,"cool":1},"bjM88pCuiHtl4wlplzCtHQ":{"text":"This review is for the gumbo only. Though I have not tried every menu item at this restaur","useful":0,"cool":0},"fwhHPtiOzaLYYsSpesWrPQ":{"text":"The gumbo was so tasty!!! Po boys (shrimp & oyster) were also spot on. Friendly staff and ","useful":0,"cool":0},"f-S7F6eFhroed2H_Nix1fQ":{"text":"The food is delicious, large portions, fresh, looks appetizing and it was under $8. It is ","useful":1,"cool":0},"S5zu6YuDwS7_IyqsevcPTw":{"text":"Great portions!  Delicious food. I got  a huge piece of fried catfish, shrimp frienrkce an","useful":0,"cool":0},"iJm4R8BCSMaboT4Ym1Vr0g":{"text":"Great local place a little of the beaten path.  Loved the gumbo..I mean really loved it!  ","useful":1,"cool":0},"Rcl8An38ZU_9Mnk7EUd_pg":{"text":"Hot dam! Ate like 3 ponds of crawfish.\n\nWe was just driving around the N.O. and seen it. M","useful":2,"cool":0},"FxvCIcAh7B6jRgDA-zo6Cw":{"text":"Best Bourbon Chicken, Mac and Cheese with Shrimp is a must and mashed potatoes... Wow deli","useful":1,"cool":0},"B8Z8Lj6E4CiuHZZCt69U9Q":{"text":"Fried chicken, greens and red beans/rice are delicious!!! Gumbo and crawfish etouffee are ","useful":0,"cool":0},"_idduEOy77MY3sPuQVG9UA":{"text":"Good spot to eat that's a ways from the tourist areas. If you're looking for authenticity ","useful":2,"cool":0},"xPU9Vfo-TSqCUyXb4-8lTA":{"text":"The crawfish was SO delicious! Perfect place if you're looking for a great price on amazin","useful":1,"cool":0},"pLhWkvYk6bTS_drEEDXjPw":{"text":"Delicious! Delicious! Delicious!! \n\nI ordered a pound of boiled crawfish. Such a bang for ","useful":0,"cool":1},"usE_kGlrdzzq2TX6N30QUw":{"text":"Wow. To simply put it, there are tons of yummy options to choose from. A really great spot","useful":3,"cool":0},"rcOYSRlkA4MIuHBY5lqbYQ":{"text":"The portions are big here. I had the Salisbury steak, wings, shrimp pasta, and gumbo. All ","useful":3,"cool":0},"ZNamwkglDvKeGjyFR10_sg":{"text":"Not good. We had crawfish and gumbo. Gumbo was room temperature and did not taste great. T","useful":0,"cool":0},"GkN_JVGuXxSsTEZ3LYKHDw":{"text":"Walked in and walked out. I wasn't impressed with the service and the place seemed a bit u","useful":0,"cool":0},"FcmKRrIpXolBWtQe12TTNw":{"text":"Everything on their menu is amazing.... I had to go back there again when I came to visit ","useful":0,"cool":0},"26GPV5SXq6M3k26_QbP95g":{"text":"I've eaten at Today's Cajun a few times. It's hearty and tasty food at a great price. The ","useful":1,"cool":0},"RnsYhwYVWwtzuHJ_gHPdcQ":{"text":"At amazing and good and fresh!!!! \nThey have a buffet style look which is that you can see","useful":1,"cool":0},"yqf-8aJx5RVuqcUTn8TI3A":{"text":"Found this place by accident, glad we did! Staff is cool, portions and prices are right an","useful":0,"cool":0},"1ZjPQN4KH_rjZO1zXcFF4Q":{"text":"Prices are awesome! HUGE portions! Lots of options to choose from.  Good food but it's not","useful":0,"cool":0},"U3_PLXm6cmxCSUeLbl0Eyg":{"text":"So so so so good. \nGo there now. Really. \n\nThe food is amazing, cheap, and there are a ton","useful":2,"cool":0},"CsziBpT6l1alfYf8L08hzw":{"text":"Holy mother of god talk about a deal on food\n\nBest gumbo I've had below ten bucks\nBest piz","useful":0,"cool":2},"ZDwjAeYzZZ9RRkZzZ8S_VQ":{"text":"Food is excellent, portions are huge and service is really friendly. Hole in the wall type","useful":0,"cool":1},"aIT45JR9e8BvE0s_d80WYw":{"text":"Good food, clean restaurant, nice and friendly staff! \nThe price is very affordable... wou","useful":0,"cool":0},"RzjPOT3Oo50wc4Bj5_HFlQ":{"text":"Off the beaten path but worth a trip if you want inexpensive crawfish cooked fresh and ser","useful":1,"cool":2},"DL2A1hUBPI01cEecJY8yBQ":{"text":"Stopped by for a quick bite to eat. The food is delicious! Unfortunately I didn't snap a b","useful":0,"cool":0},"HbF4S-EK2Tr0kSry4ziplA":{"text":"Totally delicious crawfish boil! We brought it home, because the restaurant was boring and","useful":1,"cool":0},"J2S467xwThDluTOVEMcXJw":{"text":"My boyfriend and I came here on our last day of our trip to New Orleans and I didn't reali","useful":1,"cool":1},"lCH_yAIN4JZyhEJS5KaimQ":{"text":"It wasn't the best boil but  the bourbon chicken was good. Interior was ok, the bathroom n","useful":0,"cool":0},"4-Ac-_z3o8mlTEj1odw_ZQ":{"text":"WE LOVE TODAY'S CAJUN SEAFOOD! We came as a big group (~10) and they had no problem keepin","useful":0,"cool":0},"48bXgisbYWhwF0ve9LPskw":{"text":"I'm from DC and was looking for a place that has good cheap crawfish. It is Louisiana afte","useful":1,"cool":0},"T6dWx0n_ciAa_GnOAvvzKQ":{"text":"Amazing boiled crawfish (spicy so beware) with corn and potatoes. Shrimp po' boy was good ","useful":0,"cool":0},"j5qztlPbjn6JtySxGVihfA":{"text":"Best catfish, gumbo and seafood pasta ever. This place never disappoints. I blew my 1300 d","useful":1,"cool":1},"eL4yj3MSq6iykeqCJ7yHhg":{"text":"Stopped in on my way to my hotel. I was surprised how good the food was. It is cafeteria s","useful":0,"cool":0},"5vNEmNCTBHU0x8CrHlbE1w":{"text":"This is a down home local eaterie. 4 stars is for the quality of it being what it is, mean","useful":2,"cool":1},"XPek3Vogwm5umDQxCCTg9A":{"text":"Get the gumbo! Get the gumbo! Get the gumbo! Pair it with their amazing cornbread and you'","useful":1,"cool":0},"jMsDHQSWHP_yLUVBUII7cA":{"text":"This place was definitely off the beaten path but the food is super cheap. I tried crawfis","useful":0,"cool":1},"v1wWZX_gC-cIyxi0NAeaTA":{"text":"We hit this place up on our last day in NOLA last year and I thought I wrote a review at t","useful":0,"cool":0},"cIDT66E91PrtWFz7Hlm74A":{"text":"While visiting New Orleans one of my main goals was to try Gumbo so I would know good gumb","useful":1,"cool":0},"klsyhqIak3s6fQgyudHeBQ":{"text":"For local cuisine done good, Today's Cajun Seafood is the place to go. Away from the crowd","useful":3,"cool":3},"bNrZ_oAiXkvGICUrcRCdlw":{"text":"The cashiers were really nice. It was clean in there. They let me sample a spoonful of stu","useful":1,"cool":0},"YUCWinjdZEoYsFVeFrKFww":{"text":"LITERAL BEST FOOD IN NEW ORLEANS! It has the perfect amount of spice (unlike the tourist t","useful":0,"cool":0},"oZOpjdpExqqkM4P_mcJH7Q":{"text":"Food looked kinda shaky when I walked in but small shrimp pasta was $2.99 so I took a chan","useful":0,"cool":0},"0YbBr5epsswUMURPw_4lAw":{"text":"Had the catfish and seafood gumbo.  Price was very reasonable. The catfish was lightly sea","useful":0,"cool":0},"CkZ_5eB1EOJfOjxcG-oMyw":{"text":"Cheap and good food.\nBourbon chicken: 8/10\nBBQ chicken with pineapple: 8/10\nShrimp poboy: ","useful":0,"cool":0},"2J4jxMtHU23VDzZEyjifCA":{"text":"Arrived the place was pack  but line moved quickly. Ordered 3 lbs of crawfish,corn,potatoe","useful":0,"cool":0},"QxL_Gm3t5mPYvZuCwWH0Hw":{"text":"Best gumbo I have ever tasted, fried catfish was awesome,  jambalaya also good and the red","useful":0,"cool":0},"fbmJZn0NxZ27hMXuPc0maQ":{"text":"Hands down best home cooked food. I had walked in the day before and walked out because it","useful":0,"cool":0},"x7hJMrDlmHGUDG418f5OJg":{"text":"saw that they had great reviews for seafood boil, so headed over on a bus.....but alas..th","useful":0,"cool":0},"8HgN_qkTpjeRnmL_Ie2bXg":{"text":"If you're looking for atmosphere this isn't the place. If you want good food that's got gr","useful":1,"cool":0},"BKkOy1Hg1ISTMjLmO5LDHA":{"text":"While visiting New Orleans one of my main goals was to try Gumbo so I would know good gumb","useful":1,"cool":0},"p7DC2zaAE0iCng8z85dxBg":{"text":"Only place that I found Boiled Crawfish in the City in the summer. Loved it! Crazy Vietnam","useful":1,"cool":0},"lwen4-aafV9zvwrZLTRPGA":{"text":"Not too bad for a cheap buffet.\n\nBig portions, and the Bourbon Chicken is actually quite g","useful":0,"cool":0},"WudycGAvynJkgcE4_YbhyA":{"text":"This place is delicious ! The food is great they offer a great variety of foods cooked and","useful":0,"cool":0},"g2IO8RGgGE136vp0aPr4RQ":{"text":"Stopped through here on our way out of NOLA. It wasn't necessarily the cleanest place (the","useful":0,"cool":0},"sXyiVwYcL0rdNxfdes6zxA":{"text":"Best Food in New Orleans to me, simple yet so well put together. And they will deliver to ","useful":1,"cool":0},"I_D5HTiQtrKlT30SuP7x_Q":{"text":"Absolutely love this place! The food was amazing and service was fast.  They definitely do","useful":1,"cool":0},"IWFovX53QLJ6XDnNh8Q6rQ":{"text":"Awesome food and customer service. Was visiting New Orleans for Mardi Gras and decided on ","useful":0,"cool":0},"FygcT7DdqNNrkM6OwspRMg":{"text":"Aside from the food being really good, the customer service was on point. I just got my br","useful":2,"cool":1},"6In44RLSIgYTlyY458Ma7w":{"text":"i love the food here. the cabbage is to die for my favorite dish thus for. the baked chick","useful":0,"cool":0},"lqFIPum_rkqBOLJG1wemaw":{"text":"This place was totally worth the walk out of the French Quarter! I had red beans and rice ","useful":2,"cool":0},"m3_e5fuXG5u7aZwWYrfJHw":{"text":"The turkey wing was boiled in a hazy whitish liquid. Unfortunately it was not seasoned at ","useful":0,"cool":1},"4ks9hLV6vFgxVaXgtzEqSA":{"text":"The people here are extremely kind and the food is delicious!  I had a red beans and rice ","useful":0,"cool":0},"j80Lwjyg2WIfD3jU2onlpA":{"text":"The gumbo was tasty but the crawfish not so much. These were the smallest I've ever seen. ","useful":0,"cool":0},"uiR87vIHkdjWr5NIscqarQ":{"text":"If you're in the mood for seafood then this is definitely the place.  All entrees are a he","useful":1,"cool":0},"KtfkMDdecawQF5YmoLrpvA":{"text":"I picked up some poboys at Today's Cajun Seafood for a picnic in City Park. I think it's r","useful":3,"cool":6},"qDKiOL76CA7XW-qDPnUrvA":{"text":"It's like Chinese buffet style western food,they had shrimp /snow crab you can buy per pou","useful":0,"cool":0},"lR1ZAKLSB1zQWZqI8eRAKQ":{"text":"I Should probably keep my mouth shut about what apparently is one of the best kept secrets","useful":2,"cool":0},"9JGDBh51BagYDotUnLCQ3w":{"text":"Good local fast service place. Has a variety of items, including stuffed ground beef bell ","useful":1,"cool":0},"mJtf3F0FBSA5uKezVcowqQ":{"text":"I stopped by for a quick lunch and have no regrets. Best shrimp pasta I've ever had!!! Per","useful":0,"cool":0},"i3aApud7hxhOmMATNfdZpg":{"text":"This restaurant? definitely everyone have to go when you guys came to New Orleans！！！Every ","useful":0,"cool":0},"cqDaSgHASENV7fmkowKRVw":{"text":"They have the absolute BEST grilled shrimp that i have ever had. There are a variety of ch","useful":0,"cool":0},"rFaiudfksBI9kMvV-VnqmQ":{"text":"They were closed when their site stated they were open. Second to Cajun Seafood, everyone ","useful":0,"cool":0},"giHWow9ZSvEkM9GtlvEv0w":{"text":"I was craving for some crawfish and saw this spot suggested on Yelp and decided to give it","useful":0,"cool":0},"jaE9rOBlLsZE9rmFwhEh9A":{"text":"This place is amazing! It was hard to decide what I wanted to so I got 1 spicy drumstick ,","useful":0,"cool":0},"M2fhCitZmwB1kuzmrB0uVA":{"text":"Gumbo was great. I got a large order of different items and all were very tasty. \nService ","useful":1,"cool":0},"hlmuMzHBUhL5E2d37uQJjQ":{"text":"This is such an odd hole in the wall.  They have Cajun food and Chinese food.  A strange c","useful":3,"cool":2},"K_TYf-qcP9bksCN0DbOb9g":{"text":"Looks just like a food Court setting.  Hot food on a buffet line, with someone serving you","useful":2,"cool":1},"SeyRz4iSoqQpFXmY3l_NBw":{"text":"This place is awesome! Get out of the quarter & get the best gumbo ever. Easy walk. Price ","useful":1,"cool":0},"y2ZAb0trndtTJ78rtjxWDA":{"text":"I had never had a seafood boil prior to this and I was NOT disappointed. The seafood was f","useful":0,"cool":0},"Qog7-p_Ca2Zo3VIS6uYaNA":{"text":"Ate here the other day for the first time with some friends and we loved every bite. Stevi","useful":0,"cool":0},"8hwBMZ4kWPKVapjQlA7eUQ":{"text":"One of the best oyster sandwich I ever had. I enjoy the quality of food and portion they h","useful":0,"cool":0},"WW0ozBvuHv0NpcgogcTPJA":{"text":"I have no idea what this place is. Chinese takeout? Yes. Cajun seafood? Also yes. Grandma'","useful":1,"cool":0},"ZARv12TFq_rZ3-EFtT46qA":{"text":"I spent $36 on food(soft shell crab, gumbo, shrimp pasta, and crawfish pie) and I didn't e","useful":1,"cool":0},"zKXnOhJWzv1MwgFLTWeAHg":{"text":"I want to start off by saying excellent staff! The kind lady who was helping us was such a","useful":0,"cool":2},"P9-J72i8JF6YpnQcH7KHYQ":{"text":"Hmmmmmmm. So if you know this place, then you know its the former King Rogers Seafood... T","useful":7,"cool":2},"k4R3-xuxrspSWVDFTVUhAQ":{"text":"What's the opposite of tourist trap? It's this place! Unassuming, local, authentic. Great ","useful":1,"cool":1},"CYZ-4FlUfzMIihF6R25skw":{"text":"Absolutely wonderful roast beef poboy with added swiss cheese! A meal I won't forget!","useful":0,"cool":0},"sVQg-nyCm2leHbsSBSlSPQ":{"text":"Stopped here for take out on the way back to MS. Based on the reviews and pics of the Bour","useful":1,"cool":0},"AYldmmBqKJkXcFc8PvWT1A":{"text":"OK so this place is more of a hole in the wall type of atmosphere it's a takeout restauran","useful":2,"cool":0},"ulbnmKo7K5gM_WwIgdhirA":{"text":"Went in for crawfish, not sure if it was frozen or just overcooked. But had a weird flavor","useful":0,"cool":1},"tz3zTaB17e5U6bu3XY3FVg":{"text":"The crawfish were very overcooked making them tough and rubbery along with having lots of ","useful":4,"cool":1},"EviIK53MenT7vtDObM5s5Q":{"text":"Love the crawfish and pig feet! Unbelievable flavor. Definitely worth my time to pick it u","useful":0,"cool":0},"eCM0zRn-H1jKxdLDXqk2Ow":{"text":"This place used to be good. I wish I had taken the food back and let them taste it. Horrib","useful":0,"cool":0},"lnhcMORlWKo8HsgAn4J3MQ":{"text":"We came -we saw and we should have left. \n\nWe went in there looking for a good ole low cou","useful":0,"cool":1},"yNcdt2mATybaYTYhXeWbEw":{"text":"I expected the crawfish to be spicy and seasoned. Instead they were lukewarm and not spicy","useful":0,"cool":0},"oavsi6pk_trviTbsKuexYg":{"text":"Great tasting food and price.  Friendly service.  Looking forward to coming back the next ","useful":0,"cool":0},"yMJcW0nNDPceRwTp4hhZGg":{"text":"Wow, Today's Cajun Seafood was definitely incredible. Truly enjoy the atmosphere and pleas","useful":0,"cool":0},"zmhSv_mPYc05IEN-RhnhRQ":{"text":"Some of the best crawfish I've ever had. When we went place was pretty packed but the line","useful":0,"cool":0},"dg5tiIhfpRnOggLXEFul7Q":{"text":"Omggg this food was soooo good. Fresh, steaming hot, and large servicings for the price. T","useful":0,"cool":0},"EGzTF4gVPabOlbaczaW5fQ":{"text":"The food is  here. \n\nFrom the buttery melt in your mouth cabbage to the fall of the bone s","useful":4,"cool":3},"707YcjzH9nT9gsJk3WoDjQ":{"text":"The gumbo was pretty tasty. I bought crawfish but was quite in shock when I got home. Tini","useful":0,"cool":0},"jvnEti8yLO9cV4eK0LTmLQ":{"text":"The food is not fresh. Blue crabs  served cold. Turkey Neck stale. They camouflage everyth","useful":0,"cool":0},"BvSf_CU8oujMgACnTNhPLw":{"text":"Jerry Springer and Judge Judy were on competing TVs the first time I walked in. The bright","useful":5,"cool":4},"zgXKmH8AzA1JujtDWNsfGA":{"text":"Gumbo was fair (not much flavor), broccoli & cheese was fair, pasta & shrimp fair, shrimp ","useful":0,"cool":0},"_q3cxNfp04k3djZv1y2LbQ":{"text":"The staff if extremely friendly. If you're looking for a no frills meal.. this is the plac","useful":0,"cool":0},"S3n0CE_xlefoovRv-XKLqw":{"text":"Okay food in my experience,  sitting on a bain marie for HOW LONG? SO the wings were overc","useful":1,"cool":0},"uUaxRA2YOZIvvRnoBEZLVQ":{"text":"Dude! I'm from Nashville and I try hard to find hole in the wall, authentic places that ar","useful":2,"cool":0},"rn5DI0MuASY9QvEPEuW5Vg":{"text":"When you are over a thousand miles away, there is bound to be some homesickness. This plac","useful":0,"cool":1},"BIgO0lGC8IVBJsLT-egTng":{"text":"The crawfish wasn't that good, super salty and a little cold. They boil them and just left","useful":1,"cool":0}}