{"rx_9lvk90KPOdHUS6l-tJQ":{"text":"We stayed there overnight Fri 4/48 - Sat 4/29 2017 . We have stayed in 4 star rooms in Par","useful":0,"cool":0},"riG0BcVSYuWUSWfyyZP51A":{"text":"My stay at Le Pavillion was probably the worst hotel stay I have had in some time. I expec","useful":0,"cool":0},"uUb9lhgl-CMgJyCP0zP9Iw":{"text":"Bah Humbug... scheduled our visit in December and this was the only hotel not to have Chri","useful":0,"cool":0},"1zlihoSojXnx0K77Akx0Xg":{"text":"Stayed here for 3 days in mid-July. Service was excellent. The room was clean if a bit wor","useful":0,"cool":0},"0QQ3eRV5SeJpG8_6m_MTbQ":{"text":"Can we just say AMAZING!!! My first time in NOLA and I was a bit nervous. Enter in a fabul","useful":1,"cool":1},"drLira4dGP_pMr0nxSj1CQ":{"text":"Loved this hotel so much! I would highly recommend this hotel if you want to be near the S","useful":1,"cool":2},"FsFxXxy661Oh3wxQ16bsGg":{"text":"Where do I start? Our room wasn't stalked with toiletries. Ironing board, no iron. Our blo","useful":1,"cool":0},"8fogdOZL1VMiBheONZwgCg":{"text":"Place is old and needs upgrading... staff super on point and helpful.\nbest thing is that t","useful":1,"cool":0},"QBbHrJLwbUbEZJ-0J-ftPQ":{"text":"New Orleans - has been great - but our hotel leaves a lot to be desired. Namely despite be","useful":1,"cool":0},"ghZe1goXrEflGoYH7Ynaig":{"text":"Thanks Clark and Albee for making my birthday amazing!  Best staycation hotel a local coul","useful":0,"cool":0},"Snp56ozmmbM2eJkt_vxgkQ":{"text":"We've come to JazzFest for 29 years since 1985. We like to try different hotels in New Orl","useful":1,"cool":0},"vg31chHE1tEcNEGSV7DhFg":{"text":"I'm so in love with this hotel. The decor is so beautiful. This is not your typical hotel.","useful":2,"cool":1},"BVsWAYoBxOvKY3sztf9U-A":{"text":"This review is only for the restaurant at lunch.\n\n- Very good service\n- The salad bar had ","useful":1,"cool":0},"OCi-iU9WnNdm__zd6VjgeA":{"text":"My husband and I came here in 2013 for our honeymoon. Our trip consisted of a cruise leavi","useful":0,"cool":0},"iWspZjO2w-QrdCgk5vXAjA":{"text":"Highs:\nIt's frikkin fancy! Easilly one of the classiest hotels I've ever stayed in, with a","useful":0,"cool":0},"fG5zFqcy50KsMJ_7y-e0eQ":{"text":"Lunch at the Crystal Room was delicious.  The have a large variety of salads (pasta, seafo","useful":3,"cool":0},"Bjt10daSqKhSL8DPjhnqqg":{"text":"My first Sazerac, but certainly not my last. A classic, beautiful bar. Worth stopping by, ","useful":0,"cool":0},"F_90mrO75xdPRL7Ah-Ki8Q":{"text":"I stay here every time I'm in the Crescent City, and I make no bones about telling anyone ","useful":1,"cool":1},"tpkFmnqI9oebcztcnE6mow":{"text":"Classy and unique, the place is worth a stroll through and a drink even if you're not stay","useful":2,"cool":0},"wDrP3TtFkF4NwHTX3T2tMg":{"text":"Absolutely fantastic hotel!  The decor is absolutely beautiful, the location is great, the","useful":1,"cool":0},"OxIMUFagW7mKUWLOo17Y3Q":{"text":"I have stayed here 5 times for a lengthy amount of time. The staff is the best in the indu","useful":0,"cool":0},"t7MkZ2lmXhsNic9dYyYmtA":{"text":"This hotel is beautiful and the staff are extremely helpful and friendly. I booked through","useful":0,"cool":0},"iFEsPOrctqv4jKtcaV1QBg":{"text":"The hotel is awesome.  The lobby is spectacular.  The rooftop deck is fun.  The 10pm PB&J ","useful":0,"cool":0},"Ypu2_kOboImE6A5A7TkH3w":{"text":"Everything from reservations to check-in, to changing rooms, to check-out was awesome. The","useful":3,"cool":1},"3sx6Ssgmp8Hu_2IwQzdVkw":{"text":"Our family stayed here during a recent trip to New Orleans.  A lot of the hotels in the ar","useful":1,"cool":0},"MVeSt02RrRJT5Tdo-UFe-Q":{"text":"Beware- this hotel lost my hotel reservation. Not fun having your flight delayed and getti","useful":0,"cool":0},"xfwe23QLVIoASHo8dlyEbw":{"text":"My family recently booked a block of rooms here for several family members who were in New","useful":0,"cool":0},"f2EycWQYbz7aJF7Ja3ex6A":{"text":"I just had a lunch meeting at La Pavillion and it was a hit. Food is excellent and service","useful":0,"cool":0},"j4oCQ-v-3HWJPo8cN5Wt0g":{"text":"Highlights: \n---the feeling of splendor in the grand lobby\n---cushy and comfortable beds a","useful":0,"cool":1},"_o5-bwwxhsJy9w1QpAVdcw":{"text":"This is by far my WORST hotel experience. The hotel itself was nice (old but charming) but","useful":2,"cool":0},"bz1Zc2QsCQMXeecM8H8U4g":{"text":"Yes, Le Pavillon is going through some renovations.  Yes, they only have two elevators, an","useful":0,"cool":0},"y77MujhEXMdbtQyxXVjqxQ":{"text":"There are better places for the price in New Orleans. This hotel is just a few blocks from","useful":0,"cool":0},"x3M2lqvGx9SPohqh8FrJfQ":{"text":"We booked this hotel through Hotels.com last minute. It is really beautiful and seemed cle","useful":0,"cool":0},"ODhZIMTw4AkAjLpKWtdG5Q":{"text":"For a nicer hotel in New Orleans I was disappointed that they didn't pay attention to the ","useful":1,"cool":0},"MfVbsjXQU_QPS5pznwVDzQ":{"text":"The hotel is an old classic recently renovated. Rooms are somewhat small. Lounge only open","useful":0,"cool":0},"vmse22KiVNzEBiQOYwXlOQ":{"text":"I loved the old feel of this hotel. It was in a good location in the Central Business Dist","useful":0,"cool":0},"LtmYhYPpzqGmD2rgMnjUrA":{"text":"My husband and I spent 2 nights during inauguration week at this hotel. The hotel location","useful":0,"cool":0},"DkE3pCK3ohJUtIy-wYj7sQ":{"text":"Beautiful, up-scale lobby and restaurant.  Nice rooms with comfortable beds.  Luxury ameni","useful":0,"cool":0},"PbIzSHpkUaiKbjSsjVqrvA":{"text":"We got assigned to this hotel through Hotwire and for the most part our experience was pre","useful":1,"cool":0},"IeObmKZyykV_iFn_ozhDtQ":{"text":"This hotel is by the best place I've ever stayed at!! My boyfriend and I stayed here this ","useful":0,"cool":0},"f6Y9rTNbn-plbrGgxtgu6A":{"text":"My travel agent booked this hotel for us when I came down here for a marathon trip. It was","useful":0,"cool":0},"388E4urZDRhWtPiXgiFqZA":{"text":"When we first checked in I must say I was a little disappointed.  Everything is OLD.  Old ","useful":0,"cool":1},"-Yhvg7gSvxWbas5YyDzUWw":{"text":"We got an insanely amazing deal on Hotwire. Airfare from San Francisco + 2 nights here for","useful":1,"cool":1},"QeLOWO3h6qZnfZKBdbcWew":{"text":"Historical place in NOLA. A great place to be with family. The place was just too pretty a","useful":0,"cool":0},"0iCQ1t9dEq7GzTPWZY6ptA":{"text":"Am a fan of this hotel. We found a last-minute rate that could not be beat and I thought i","useful":0,"cool":0},"WFKODeGrrISSTbzBYGxgrQ":{"text":"3.50 stars Love the old school feel!\n\nThe peanut and butter jelly sandwiches from 10-11pm.","useful":0,"cool":0},"WMj4z-zN35ONMC6L4PAUlA":{"text":"I will be visiting NOLA again, and I would stay here again in a heartbeat. This is a gorge","useful":0,"cool":0},"tn7Ye5riRr_6bUcU2VFbiA":{"text":"This is a very charming historic hotel with very friendly staff. My wife and I stayed here","useful":1,"cool":0},"sVMZi3saOYOCM3QKcqrnIA":{"text":"Stayed here on a business trip 12/14/14 - 12/19/14. Pros: The hotel staff was very friendl","useful":1,"cool":0},"j8J29Eyu4VgsYjEaky0E_w":{"text":"Spent a week in a great suite here....miss the room and the nightly pb&j!! Waiting for my ","useful":0,"cool":0},"KpHEfUDB5NyNbwZS5G8Bbw":{"text":"My wife loved it.  During a confirmation call I mentioned it was our 13th anniversary.   W","useful":0,"cool":0},"-P0QBCYZNonup6V6haYK6w":{"text":"During our vacation in New Orleans we wanted a hotel close to everything without being in ","useful":0,"cool":1},"_ulFgf1vmzEE-JB46eZNaw":{"text":"The good: the hotel lobby is beautiful and well cared for. The doormen were great. The bed","useful":1,"cool":0},"wDL8w-xguVBJfLsQMQw07A":{"text":"Love visiting New Orleans we usually stay at the Marriott on canal street but decided to g","useful":0,"cool":0},"XezGZ5AcqS2HHhH-eLfnQQ":{"text":"Ok I will start with the good..this hotel is gorgeous.  The most comfortable beds anywhere","useful":0,"cool":0},"V3yH8_HIzH4oXlunmw_OWA":{"text":"This review is much overdue. Before I say anything else just let me say that I love love l","useful":0,"cool":0},"etf9BQOwanj8_LbRo0nTjQ":{"text":"This place is amazing! This is one of the most beautiful hotel's I've ever stayed in. Grea","useful":0,"cool":0},"PngWNE4PML-b9MHkoMxn4w":{"text":"Let's just say that short of staying the French Quarter (Not recommended unless you are un","useful":3,"cool":1},"6cGnsbFZFBaroyC-iPQLRw":{"text":"I really loved this place, the room service is great, the people there are very nice. And ","useful":0,"cool":0},"DyxtHXbA_rQPHZEejzUUmw":{"text":"Stopped in for the lunch buffet.  Classic grand hotel, great architecture.   Formal but fr","useful":0,"cool":0},"XLE_6WIWs0GbwOholOu5nQ":{"text":"Arrived at 10 am on the day of check-in after disembarking from a cruise--initially intend","useful":0,"cool":0},"nd__f6rSLel3tYvvZEvt3Q":{"text":"I just made a yelp account so I could do this review. 6 months ago I booked a room at this","useful":0,"cool":0},"RqJ33_96No7vzv9jYibKEg":{"text":"Love this hotel! The rooms are simple but elegant, and the lobby and rooftop lounge/pool a","useful":0,"cool":0},"p3ftr5pYNM9tTxJs2dViHA":{"text":"I was having a great visit here until I was told that there are no microwaves available to","useful":0,"cool":0},"9EMuN96com2UP7TA5TbQ7A":{"text":"The hotel pictures look beautiful but the property is deceiving. Not well kept. The hotel ","useful":1,"cool":0},"F8PpweenPGkLrKJw-ThW9w":{"text":"This place sucks. We got a Hotwire deal on this place and I know you don't always get the ","useful":1,"cool":0},"0G_U0W3jHToG1haT8N5nVA":{"text":"Stay was great. Everything was clean & nice. PBJ bar was a pleasant surprise. Only 3 stars","useful":0,"cool":0},"EI3fIBDEiLVSP-Smm_c7wQ":{"text":"Stayed here over July 4th weekend and was extremely happy we did. The hotel is right in th","useful":0,"cool":0},"HN0_txxNCqyB8SFXoHNDig":{"text":"I've wanted to stay here for awhile and was just waiting for a trip to New Orleans to do s","useful":0,"cool":0},"t3NZW06vNi1NPPJ2vi_HxQ":{"text":"We heard all of the ghost stories from the ( slightly inept , but sweet) bartender. \nDrink","useful":0,"cool":0},"LTk9tqejFENbu-Z_HdxwHA":{"text":"Receptionist tells me my room is gone. Nm it is a multi day prepaid stay. When I ask what ","useful":1,"cool":0},"VonlZyCCjJ-s9xkWPdpc5Q":{"text":"If I could give a negative 5-star review, I would. We booked multiple hotel rooms, receive","useful":5,"cool":0},"cWloKxQ8UZHA1vZRCKIA-g":{"text":"Parking is $35! They didn't change the bed sheets after the previous person.  We were give","useful":2,"cool":0},"Rkr2PqE8F4mnT0LAxjKnYw":{"text":"Very few amenities. Thin walls. Old fashioned.\n\nGood price for the area.\n\nThe service in t","useful":3,"cool":0},"4Ee688qOutJS7J0WF9TyFQ":{"text":"Absolutely the best experience we could've asked for.  My girlfriend and I just finished a","useful":1,"cool":1},"zAckggyILFm5xVt8GsompQ":{"text":"The building is pretty. Beautiful antique furniture and light fixtures. Now on to the real","useful":1,"cool":0},"jnO-SrEGrpNFRabOtblb5w":{"text":"Stayed here for our 30th Wedding Anniversary. Shortly after check in a card and a bottle o","useful":3,"cool":0},"Iz8I8yQs2BjfDY2MLk07bA":{"text":"I work in a hotel, y'all, so when I go into a guest room, I've been trained to look at EVE","useful":2,"cool":0},"s4U95oJGXEOYu_a4quJilg":{"text":"We stayed here two weeks ago for four nights.  We like this place. It was like staying in ","useful":1,"cool":0},"dVCfallmbZwfR6jrPfz_2w":{"text":"I love beautiful, historic grandiose hotels with ambiance and that is exactly what you get","useful":0,"cool":0},"VulVIDOl6VbDmKylzyWn0w":{"text":"By far this is absolutely the worst hotel experience I have ever had. I travel frequently ","useful":0,"cool":0},"8VvdHfldt2FpVQOdvO25Jw":{"text":"I have never in my life written a bad review but I think it is important for anyone travel","useful":0,"cool":0},"QSsvZjEHTXDHOE2epWMJTw":{"text":"Great choice for stay in NOLA. Close to the French Quarters( easy walk) .\nFresh coffee dai","useful":0,"cool":0},"bsCrR4xkwDnpDwacCdZ82A":{"text":"I had really high hopes for this hotel based on yelp reviews and friends recommendations. ","useful":1,"cool":0},"Ipe1XKgnqbEVuS01Afr_xw":{"text":"My friends & I stayed here during Memorial Wknd  5/25-5/28/12. we booked our trip a few mo","useful":13,"cool":5},"M9rxcraf73NOLJwC16dScw":{"text":"Ok... let me start out by saying that this hotel is beautiful. I was positively blown away","useful":2,"cool":0},"XKUulLHmtbzIgyh8GRl_rQ":{"text":"Very nice traditional hotel.  Very friendly.  Nice guest crowd.  Knowledgable and attentiv","useful":0,"cool":0},"qs_B9Uj93NELLGMh6nQZvg":{"text":"I forgot a bag of four pair of shoes in the room. And i have called all day today just to ","useful":0,"cool":0},"JhMuToX5EotHdOQYvLW7sw":{"text":"Yes, I'd stay here again. Yes, the roof top pool is pretty ligit. And Yes, the pb&j bar re","useful":2,"cool":1},"f_WHXTri3_RTEkk1Tx_WDw":{"text":"We just landed from warm Orlando FL. Now driving the cold streets of New Orleans. Here com","useful":2,"cool":1},"tThbjtDD6Fm5a40vP86ExQ":{"text":"I stayed here for a week around christmas time. Don't get me wrong the place is very nice ","useful":0,"cool":0},"2uVNS0jG3L7X3afAQYj5OQ":{"text":"A great stay!  PB&J and milk btwn 10-11pm a great added bonus!   Rooms are NYC small, but ","useful":0,"cool":0},"-vY_qB0all9ta9SqoSuciQ":{"text":"Talk about CUSH, but worth every penny. Walking distance to the French Quarter, authentic ","useful":0,"cool":0},"9SfDlCgpi_2x0RyZU86zeA":{"text":"I am OBSESSED with this hotel!!!! My family and I had the best stay with them!\nI always st","useful":2,"cool":0},"frTe689UcYdz4nkls1Svqw":{"text":"This has been the worst experience in a hotel that I've had. I could expect such service f","useful":1,"cool":0},"GiWJgI_vbA1j8MiOKLfpmg":{"text":"This is a lovely old hotel.  Yes, it's dated (think geriatric starlet), but it's more than","useful":1,"cool":0},"XPH5urNkuipq7zeNDIIb6A":{"text":"We stayed for 8 nights, just for vacation.  The service was outstanding!  Our first room w","useful":0,"cool":0},"AI6OclN932Xb6ccowsNhxw":{"text":"Hotel stay for 3 nights with 11 girls for a Bachelorette party. We had such great treatmen","useful":0,"cool":0},"bYOm_enXgT01uPesnNCL9A":{"text":"Room were nice and updated, while lobby was traditional New Orleans style. The elevator is","useful":0,"cool":0},"NgaKWGPCf0W2BfvDBsITxQ":{"text":"Was very nice and had wonderful staff. Although the plumbing wasn't very good, our toilet ","useful":0,"cool":0},"DemIslVKlmuznBhH4bURew":{"text":"They cancelled our reservation, and at least half a dozen others, without alerting any of ","useful":0,"cool":0},"iv_hNRTebm19KaVCFwMJ8g":{"text":"This was my worst customer experience ever.. my 30+ years traveling and staying in a hotel","useful":0,"cool":0},"YTwc9d-2q95rlxK_rZheqw":{"text":"My visit to Le Pavillon Hotel was a breakfast meeting in the Crystal Room.  If you have a ","useful":3,"cool":1},"ICl7zUC-EEmB5IFzS3-HvA":{"text":"Abysmal customer service.  Ignorant staff being supervised by apathetic managers.  Stay aw","useful":0,"cool":0},"GiPuo1NG_fNIyuy8DunL3A":{"text":"An absolute pleasure to stay here. The elegance and historic decor was breathtaking. The a","useful":0,"cool":0},"f-XpU1m3rYChnvtlZaOxgQ":{"text":"The hotel lobby is beautiful, as is the view from the rooftop view.  We loved the nightly ","useful":0,"cool":0},"u6rBqAyY2SFdsW7jbsCy9A":{"text":"Although most mortals infrequently--if ever--get to partake in the life of royalty, those ","useful":1,"cool":0},"BkgpzlxOitnWJiQSs6d1GA":{"text":"Ok, this is the first time I have ever been compelled to write a review for a business. I ","useful":1,"cool":0},"0c0O9dhPENpIKObgtPKovA":{"text":"The worse experience we have ever had at a hotel. We arrived on a Monday at 3:00. Our room","useful":1,"cool":0},"w4aLeRAeOuvXUJ3nrsJf-Q":{"text":"What a beautiful Hotel!! The staff was exquisite. Nice size room and clean...I had read ot","useful":0,"cool":0},"b9uubGQBjY4xauDpFX_1Rw":{"text":"My boyfriend and I stayed there for 5 days to celebrate my birthday and absolutely adored ","useful":0,"cool":2},"kap5g427lJh6zVTR7x9SOQ":{"text":"First visit to New Orleans and I am not disappointed! The historic hotel has lovely charm ","useful":1,"cool":0},"r6I1SPcWLEEQCOGu8Ma0Dw":{"text":"This is my second time staying here and it was more awesome than the last.  It's truly lik","useful":0,"cool":0},"fu5tM6Irmj9a3WiBE66-vA":{"text":"This is not full 4 star review but it's worth mentioning that the hotel has special ambian","useful":1,"cool":0},"dlp8JhoO7hM_Lics-5a3qA":{"text":"Let's start with the important things. Terrific bed (wish I could have brought it home wit","useful":1,"cool":0},"7QC0vDOnXoyjpuwqeQLj0w":{"text":"The hotel is very old so I didn't expect things to be as updated as a newer hotel.  Howeve","useful":0,"cool":0},"1og3pz9wRgSBOkggKu12-g":{"text":"Great service at this hotel. They have that we will do anything to please you kinda attitu","useful":0,"cool":0},"s86Cc9wkW9bNCse_dqzfVw":{"text":"I am staying at this hotel as I write this review. It is now 3:38 am and I cannot sleep. A","useful":4,"cool":0},"fEakITFlCIeXS4g9vNXfwg":{"text":"To say the least it's under construction which is sad they failed to mention. Twice I had ","useful":0,"cool":0},"xxnCFbcBK57BrkFfIsI7Lw":{"text":"The room prices at times can be a decent value for the quality. Other hotel bar and restur","useful":0,"cool":0},"a2h4p_jRqwiudJEj5pbI-g":{"text":"This hotel is absolutely GORGEOUS! However, the customer service is abysmal! I encountered","useful":0,"cool":0},"KKNKtt5Mb4BG0-5tpkPuaA":{"text":"If I could give it 3.5 it would be more accurate. The hotel is historical. It has characte","useful":0,"cool":0},"ckF7ioXjcQCS-Y3nKdNTsA":{"text":"Gorgeous hotel. Close enough to walk to the French Quarter. Staff was EXCELLENT, very resp","useful":2,"cool":0},"lOANDDH8AEy5-DdA7CWv7g":{"text":"I don't normally review hotels but in this instance, I figured I would. Le Pavillon is one","useful":1,"cool":0},"SdEbtHUIr78WNiUuiTG-LQ":{"text":"Beautiful hotel and nice rooms. However, the customer service is not up to par. Customer S","useful":0,"cool":0},"w8avijOwtdetDeD1FYWVaQ":{"text":"Old new Orleans style hotel. Great little rooms with everything you'll need. Close but yet","useful":0,"cool":0},"LcpEHiqOe6mF9IybJCBG_A":{"text":"The have a late night PB&J bar happy hour. If that alone doesn't win you over, let me also","useful":1,"cool":2},"Xt67An8sYkkEEPObEeaNQg":{"text":"Very ok hotel for French Quarter. I've stayed in several hotels in the FQ, this one was no","useful":0,"cool":0},"jBJOTMX7c8R-1c4leIoB3g":{"text":"Worse experience ever ! Very over price for 4 breakfast plates came up to 159$ soda is 5$ ","useful":0,"cool":0},"PZIc8g-m2FTw-eITQEi70g":{"text":"I expected more from a historic luxury hotel. All the little problems made the stay feel l","useful":0,"cool":0},"oPFnQIILMqbJzOQ3250mug":{"text":"Along with my most recent best meal in awhile on this NOLA visit,  came the best hotel sta","useful":1,"cool":0},"0osv2011f22yTgx1m1gaPA":{"text":"A gorgeous hotel with wonderful and friendly staff. They staff remembers their guests (and","useful":0,"cool":0},"QlBKj_ssxSPvXJfIQOpJtQ":{"text":"This hotel was the absolute worst...from checking to checking out. Upon arrival the hotel ","useful":0,"cool":0},"3RrOdTtSRbmx4B3mvkTvMQ":{"text":"Beautiful historic hotel,  very well kept.  The rooms are pretty spacious, beda are comfor","useful":0,"cool":0},"Q8kHfDA-MjpCBG-J4_ZPoQ":{"text":"Le Pavillion\n\nMy stay stay here, and probably the last. It age is not the factor. It's man","useful":1,"cool":0},"768uTZkPK-l74xqVG1mj4Q":{"text":"Please be careful how you pay at this hotel. They charged $380.00 from my cc without my au","useful":1,"cool":0},"0lZIqnfBYMp4cBxEXambkQ":{"text":"I loved this hotel, the staff was very courteous and friendly...and it is gorgeous inside.","useful":0,"cool":0},"hEUKTlTvmijrJ1zItmcB0Q":{"text":"I needed a stay cation in NOLA so I chose this hotel. I looked on yelp and trip advisor an","useful":1,"cool":0},"fz2sot0uMpSqk4gxsG6q9A":{"text":"Very horrible experience . There is no shampoo & body wash etc.. In our room.  The wall is","useful":0,"cool":0},"xVPy7j-YX6mN4xHC890D_w":{"text":"I'm in love with this hotel.\n\nHot chocolate and Peanut Butter Sandwich late night snack ba","useful":1,"cool":0},"hrfpzNdTrIR399zNwKzMpw":{"text":"I stayed at Le Pavillon the weekend of Jan 14, 2017. Had a great time in New Orleans and t","useful":3,"cool":1},"P4x1bdEjKjelu-yqq5pdKA":{"text":"This historic Grand Dame of a hotel has a richly appointed lobby, bar and dining room. The","useful":0,"cool":0},"WzSW82NayozTt3w1Kh5d6Q":{"text":"Neal and I wandered in to this hotel after the Krewe Of Bacchus parade to use the bathroom","useful":1,"cool":0},"C1YIM26l5_7ieNgVB_goeQ":{"text":"The LePavillõn Hotel is a historic and beautiful place to stay. It's a charming comfortabl","useful":1,"cool":0},"DHIDkXa_Q8b6pBPnqcIpwQ":{"text":"Very nice hotel, but make sure that you check on room size.  The first visit (about a mont","useful":0,"cool":0},"cYwgnyPWsutlWMG7vt0z9g":{"text":"Stay FAR FAR AWAY from this decrepit shell of a once beautiful hotel. Nothing is right sin","useful":0,"cool":0},"R6WbRDP6hOayYQNtq4x9Qw":{"text":"I am staying here with my 11 year old son, because it was recommended as a family friendly","useful":0,"cool":0},"yxigJ1V0WcV0rXi76IYWoA":{"text":"Our stay began when we arrived at 4:30PM, 1.5 hours past check-in time. We were told our r","useful":0,"cool":0},"SseyF9wKxDb9-7eGdTzDHA":{"text":"We stayed at the Pavillon for our wedding weekend. The hotel is absolutely gorgeous, but a","useful":0,"cool":0},"tc-PiFx6gOBbT4zaSUqIYw":{"text":"I am fortunate to travel all over the world with my work but UNFORTUNATELY had an event to","useful":1,"cool":0},"WNlc5OO3MyELbnJ7-gXM-w":{"text":"Message to the management: Hotel is outdated - the rooms need better upkeep. Our bathroom ","useful":1,"cool":0},"85D09EJgwo8x_TC6aqOaSw":{"text":"I have stayed at every dynasty New Orleans hotel over the years and I have to say Le Pavil","useful":0,"cool":0},"n1PAd7h5iB0LAPea_BghtA":{"text":"Liked the hotel for its old, regal, historic feel. For having so much detail in what makes","useful":1,"cool":0},"Ud_LFoeTPqFvPzV4VZo9cg":{"text":"Lovely hotel. Friendly staff, nice sized rooms, pimp bathroom, love love love the roof hot","useful":0,"cool":0},"fLJ8TxOovMvM7OvMl2K17w":{"text":"So glad I booked this hotel. I wanted a hotel that didn't look like all the others, someth","useful":0,"cool":0},"eWg0UUx7shyTJiOV_SJQrg":{"text":"Even though we were not here for the night (we came for the seafood nachos at the bar),  w","useful":0,"cool":0},"fA0pZRiKt18qCQ1EDN-2Pg":{"text":"After my horrible experience I was compensated for my whole stay. I am leaving the three s","useful":2,"cool":0},"KBLg87hPpUAR6LY0M1ymlA":{"text":"In my humble opinion, it's one of the best hotels for the price. That is the room quality ","useful":0,"cool":0},"pVyzyP4kubjn2h7C_5p8bQ":{"text":"Magical, beautiful, well located and historical hotel. Check in was exactly on time (on th","useful":2,"cool":1},"9JG0O7adnN1Nua30PYU8PA":{"text":"Stayed here for 5 nights for the SfN conference. Managed to snag a room on the 8th floor, ","useful":2,"cool":0},"cejK1Ed9SM2JhSvJlGM4GQ":{"text":"Staff have been so helpful! The hotel is beautiful and clean and actually priced well!\nWe ","useful":2,"cool":0},"qNLAwhA2HO6i9NoJQUVX4A":{"text":"I think I'm being generous with two stars. My friend booked this hotel through Expedia. We","useful":3,"cool":0},"ZFJdrbgL41NQ2lLPk1Ug0g":{"text":"Very nice old world hotel.  A short walk from bourbon street and the superdome.  Free pb&j","useful":0,"cool":0},"R62aKVAfY-YNzMI_vLOGpw":{"text":"Let me start off by saying walking through the front doors of Le Pavillon on its own takes","useful":1,"cool":0},"l4HJ1CptrhW-8ul_kuuoRQ":{"text":"confession: i'm a wannabe vampire. \n\ni guess that's why i was so butt-crazy over le pavill","useful":3,"cool":4},"n6lzVvTtYihK7iP4dWSB-g":{"text":"WORST HOTEL IN NEW ORLEANS! Spent $250 for 1 night, thinking it would be worth my money. W","useful":0,"cool":0},"E5VqqnhsL5Bs7yFs-U6DdQ":{"text":"Remodel of the lobby and bar ruined the place. Had a great and real vintage and classic fe","useful":0,"cool":0},"Nj4qOOtYjMjvh3k-sDYcww":{"text":"First, for the money, the location and the service, you can't beat this place. In fact, I ","useful":2,"cool":0},"kuR8EU05X7bcsWRyt_1gNQ":{"text":"Southern Hospitality at it's finest! Amazing staff! Thank you to the following employees f","useful":0,"cool":0},"2VaumwFAWO9g0k-3YIZYKQ":{"text":"In large part because I was booking a bit last-minute, I ended up at Le Pavillon. It's not","useful":5,"cool":2},"rORper_xQZR6zqWd2_V8jQ":{"text":"Hands down the noisiest hotel I have EVER stayed at. There was at least one wedding party ","useful":5,"cool":4},"O_QkUlA1uTQ9sjcSN6syWA":{"text":"Great customer service. Parking is $$ at $39 a night. Food here is $$$ for us. Maintenance","useful":0,"cool":0},"jEJc1h_ROpVnjAEcBeOYmg":{"text":"The staff was helpful and friendly as soon as we arrived. They helped us unload our luggag","useful":0,"cool":0},"o9lgvgZsm1v2_4AKjsfLNg":{"text":"This is regarding my stay in your hotel during the Mardi Gras. My fiancé and I frequent Ne","useful":0,"cool":0},"Cl8iSOX9-ywLCuLca6wXRg":{"text":"I don't want to be histrionic, nor have I ever been so upset I thought I'd ever write a ba","useful":1,"cool":0},"FRO68h3nhKwpsDiCPLK4nQ":{"text":"I stayed here in early June for four nights. When I first arrived at the hotel, I was gree","useful":0,"cool":0},"JCKg4jwdYbLOn44eNr_few":{"text":"BUG INFESTED!!!! We arrived home from a 4 day stay opening a suitcase full of insects. Hou","useful":2,"cool":0},"bU6Mzwd-B3VrybQtvMyZ7w":{"text":"Amazing experience at Le Pavillon! My mom and I recently visited for my 30th birthday. She","useful":3,"cool":1},"ZRwaFJ49_g15PgfSGVzFbg":{"text":"My favorite hotel--of all time.\n\nClose to the Quarter and right off the streetcar line=con","useful":0,"cool":0},"A61D7ZzpSckP8at7DlulYQ":{"text":"This is a very nice hotel for the money! The pool on the top floor is spectacular! We got ","useful":1,"cool":0},"j0lY8fxy3b0p36xU0med8g":{"text":"this hotel was OK. it was very pretty inside. the staff were very helpful. however, the ro","useful":0,"cool":0},"T1w8Ir55h00K5Ja82SkdKQ":{"text":"The nicest and most accommodating staff in New Orleans! We were able to check in early and","useful":0,"cool":0},"QmbTwugu_0nSzk4181lvFA":{"text":"Great hotel at a surprisingly good price. We stayed here during the Christmas holidays sea","useful":4,"cool":0},"WGgAcP870516wYv0jq6HIQ":{"text":"Beautiful hotel, very attentive staff. Great location! We had a suite that was fit for roy","useful":1,"cool":0},"W6NS1nEtlz8k_hjaVdoCSg":{"text":"The hotel is pretty old and that in itself is cool because of the history. They could help","useful":0,"cool":0},"UJ4p9gO-3ZMHDmqc5CzQpA":{"text":"We arrived very early in the morning at around 2am and we were promptly checked in. Our ro","useful":0,"cool":0},"J65EnQrprpYRTc1qpgl3Rg":{"text":"I feel bad writing this review because the staff here were all very nice and helpful but w","useful":1,"cool":0},"VSoiTGfwGyb7nxBX6aEBDA":{"text":"*EXCEPTIONAL SERVICE*\nLobby, Rooms, Gym, Restaurant, Rooftop Pool & Terrace were all AMAZI","useful":0,"cool":0},"CK7XNtiAeIcxoueTKnMZeQ":{"text":"Our first trip to NOLA and this hotel made it memorable. Elegant hotel with white fascade-","useful":0,"cool":0},"rfyBZqigawTfl5vt6QOJkQ":{"text":"\"Dallas TX Group buys in Le Pavillion Nola in 2015 and is ruining it\".  I am going to be k","useful":1,"cool":1},"IwULsUyFFSF-sRnnBM5GrA":{"text":"Excellent staff at this hotel. Nathan was awesome and so was the concierge Robert. Beautif","useful":0,"cool":0},"GREic4XOeQr5cTImxICx4w":{"text":"Great hotel and historical landmark. Excellent brunch spot on the weekend. I often have br","useful":0,"cool":0},"7FbZZFbtxj4raLWPTssJ1A":{"text":"I will never return. The biggest concern of mine is your lack of concern for the safety of","useful":3,"cool":0},"EOt4BdjVHto5X0Fzu3eDFg":{"text":"Our check in was a great experience. The Bellman was very friendly, took us to our room an","useful":1,"cool":0},"YcB72oHBJSE7PLv8xQbbPg":{"text":"This place rates a 4.  Building is over 100 years old, has a lot of charm, style and chara","useful":2,"cool":0},"oAOUkW2ghlxJFBW9esY_kw":{"text":"This hotel is awful, it just hides under the facade of a \"luxury hotel\".  The room itself ","useful":0,"cool":0},"r97b_bweck56xIZn5eTibw":{"text":"Yep 4 stars for this place. It would of got 5 if the parking wasn't $30.00 a day. The deco","useful":1,"cool":1},"WBLqQKzm5SvpYku1WKFpkw":{"text":"Gorgeous Hotel! Truly is the \"Belle of New Orleans\" The rooftop pool and hot tub, along wi","useful":0,"cool":0},"8fZptGi-KHNhFDixwBkEkw":{"text":"What a difference a year makes. The room we stayed in was dirty. I found a couple of hair ","useful":1,"cool":0},"EX-VRmTeMOI2r9sjWdc7_w":{"text":"The only thing preventing me from giving this hotel five stars is that our 9th floor room ","useful":0,"cool":0},"38mi5mVBDE_HPWIdIGr1sQ":{"text":"Stayed here with the family during a vacation in the Summer of 2012. This place has some t","useful":1,"cool":0},"INIz1nECb89oLQi5XIe1ig":{"text":"Wasn't bad because we stayed but not the Marriott. Clean and staff pleasant. Doing renovat","useful":0,"cool":0},"-V-_fFZiB9uTJY6eWgFJ3w":{"text":"I've passed this hotel so many times and always thought... one day I'll make a reason to s","useful":0,"cool":0},"hSY2MVTBHAY3xeLCyC33_w":{"text":"Had a great stay here, was perfect walking distance to the Quarter. Trolley stop is about ","useful":1,"cool":0},"9JmwBt8Ly03LlGv6KBrEig":{"text":"We stayed overnight last Monday. I hear the hotel is under new management.\n\nWe arrived at ","useful":6,"cool":1},"0Jd8WhrnZAcKDHe0bG2oMQ":{"text":"BEAUTIFUL hotel! Seriously, super gorgeous. I booked this room off of bookit.com, and got ","useful":3,"cool":1},"arkueur_i7Xk7i_WwEB9PQ":{"text":"My friend wanted to celebrate her birthday in style so she paid for a one night stay in th","useful":0,"cool":0},"gDXM3TqeA7N0J2cu9ZHLkw":{"text":"Le Pavillon was a great hotel. From the moment we arrived until checkout we were well take","useful":0,"cool":1},"H5RWR_jB8ZxFP_BVPEy2KQ":{"text":"We booked this hotel on Hotwire for a little over 100 a night with tax. First, Hotwire lis","useful":2,"cool":0},"r1W-rG35hEJLceyL4NOHsA":{"text":"Let me start off by saying the next time I go to New Orleans I definitely won't be staying","useful":1,"cool":0},"-qZuTbJQxMHUQ19KeIqqfg":{"text":"Here for work.  Three nights.  First night $369 (Sunday), next two nights, $565 a piece.  ","useful":0,"cool":0},"lNQoHgFAkUGDH0b7yg3tug":{"text":"Great stay. Great staff. Great location. We used the hot tub and pool. Great view from the","useful":0,"cool":0},"_rSRfE2H8NfhX2slgBW6sg":{"text":"Gorgeous, historic building just a short walking distance from the French Quarter.  I did ","useful":0,"cool":0},"pyQWQd8Iq0GeZdtsySXSxQ":{"text":"Nice hotel: comfy beds, powerful shower, good service. Warning: THIN WALLS (heard a little","useful":0,"cool":0},"HO5XLkUO35WtEopgXOg5Tg":{"text":"Lovely older hotel with so much style. Loved the details of hand painted ceiling corners i","useful":0,"cool":0},"jjgWkXQDc5vYUaU_nSmAQQ":{"text":"I would have rated Le Pavillon higher except their restaurant, The Crystal Room, was ATROC","useful":1,"cool":0},"yR25mQkbPh1zZ-TEjn9PiQ":{"text":"I was booked to stay here from my employer for a change for something nice and upscale!!! ","useful":1,"cool":0},"sCB0vYvMBYU3PhvaBJeB7Q":{"text":"Checked in about 4pm. Concierge  is helpful (p/s tipping well have it's perks!) \n\nHotel is","useful":1,"cool":0},"aZYlcdrFu38FYpUSgn7j2A":{"text":"I am beyond disappointed.  I previously had two great trips to Le Pavilion hotel but after","useful":1,"cool":0},"xf3T0gD6EFOVvZd6lPXThQ":{"text":"This is a great hotel to get off of the busy streets of the French Quarter.  The hotel was","useful":0,"cool":0},"PeROvOw_tmtlNDVrjk-9_g":{"text":"Staff is very friendly, clean rooms that are spacious and never have had issues with noise","useful":3,"cool":0},"BsKo_S1ncoV6gOiJ8Eu-tg":{"text":"Wonderful! The hotel as a whole and the individual room were beautiful. The rooftop pool a","useful":0,"cool":0},"TJGdN1roqW3oe67AZlkQEQ":{"text":"Stay was great. Everything was clean & nice. PBJ bar was a pleasant surprise. Only 3 stars","useful":0,"cool":0},"986aFtlZuPbD41D_H_TfJQ":{"text":"My husband, daughter, and I have been staying here since Wednesday.  The nightly hot cocoa","useful":0,"cool":0},"oISuRu_BRxgjsPIdk8h8xQ":{"text":"The roof-top pool!!!!! If only the rooms wouldn't have so thin walls and you must hear oth","useful":0,"cool":0},"uoVXut8vw40SnLdfsutG1w":{"text":"it was love at first. Then small details made me want to breakup. \n\nWe arrived early and a","useful":2,"cool":0},"7hZocdeH-OhbVwfcNemNiQ":{"text":"The hotel itself is beautiful and within proximity to NOLA night life. We enjoyed our stay","useful":1,"cool":0},"tTf62zuTUJuOPIJsl9zYXA":{"text":"I forgot a bag of four pair of shoes in the room. And i have called all day today just to ","useful":1,"cool":0},"VDDzbVC6xOgimNmlaIMgbQ":{"text":"Bartender at the lounge was very nice but receptionist had an attitude that makes one feel","useful":0,"cool":0},"8LbtULnIyqxHjG4HoWjHWg":{"text":"I had a terrible experience with this hotel. Both mine and my boyfriend's credit cards wer","useful":0,"cool":0},"sIrz5UHK-InCZVR2lZvqpQ":{"text":"This place is beautiful and comfy \" Southern Comfort \" . The classic architecture is amazi","useful":0,"cool":1},"b8Cp9Jd0ofrvYPZqLYppRw":{"text":"A friend of mine stayed here and I was able to visit through her. The hotel is beautiful. ","useful":1,"cool":0},"ncX5oS6xgo0Y9rBbWRshxg":{"text":"Staying for a conference. Beautiful historical hotel, just a 5 minute walk from the French","useful":0,"cool":0},"EuJtAQzz9bur3pVb_v_hKw":{"text":"Whew! No ghost encounters during my stay.\n\nI booked this hotel for a weekend through Group","useful":2,"cool":1},"FiLfEt2LmdTLYDRs9eaD3g":{"text":"As we were checking out my wife said : \"I want to live here\".  I'll miss her while I sell ","useful":2,"cool":0},"clZNH2UDgIBKvEzVAzoEow":{"text":"I was really nervous staying here after reading the horrible reviews.  Fortunately, our st","useful":0,"cool":0},"K0w7IheahRo6IvGbEXD8aA":{"text":"This hotel is super cute and comes from a completely different period in time. The furnish","useful":0,"cool":0},"LDPbObVowRdX59Ih8xP6VQ":{"text":"Great place to stay while in NOLA. The customer service at this hotel is fantastic, the ro","useful":2,"cool":3},"qHQcKMvRyhg4wkwvZZao3A":{"text":"The room and bathroom were not super big but the bed was very comfortable and well decorat","useful":0,"cool":0},"eT9RpvHxuPhZLnsJ_2nrcw":{"text":"This was once a pristine 5-star hotel that is now starting to show wear and tear.  It is a","useful":1,"cool":0},"s0n3mz26rUV0MHCCxVsBDQ":{"text":"I cannot sing high enough praises about Le Pavillon.  My boyfriend and I recently stayed h","useful":1,"cool":1},"_jNiWhvsIDWjmerbikPF8A":{"text":"A great value!  Very comfortable rooms. Kind of a French rococo sort of vibe.  Curtains wi","useful":0,"cool":0},"iuJnySTguDgwUi8a7i81bg":{"text":"I forgot to mention the ROOFTOP POOL!!! Could there be any better place for watching the s","useful":0,"cool":0},"Y7kh9fHsEUspcikFh2MvHA":{"text":"I celebrated my birthday weekend at LePavillon and everyone was wonderful. Rayucaa and Shr","useful":0,"cool":0},"Lk6DSxCzBlllJBxRbHzU9Q":{"text":"Was in awe of the structure upon entering, loved the old French décor. The concierge desk ","useful":0,"cool":0},"3GZ_daoSZBCQsduQN6Bzew":{"text":"This hotel is really beautiful! In addition, the entire staff is professional, attentive, ","useful":3,"cool":4},"D-2u-OmYDPrwXsC7KajErQ":{"text":"This is a 5 Star hotel on any scale.  Luxurious and comfortable at the same time.  \n\nLe Pa","useful":2,"cool":0},"VTY63czm054X2eSTabppPA":{"text":"Yummy late night pbj and choco milk! Great mid century French decor. Great history. Bathro","useful":0,"cool":0},"NScJYeoEGUGkf_eldFPw2w":{"text":"We was impressed with this hotel. Heard good review from if through friends and of course ","useful":1,"cool":0},"WXF2vKGKHjzAnSURXbwVug":{"text":"LOVE IT. So elegant and accommodating. Very personal staff. The 10pm complimentary hot cho","useful":1,"cool":0},"FwWnPcjNZahN2ACqpk7vCg":{"text":"At $437 we were put in a dingy room with a broken hall light and broken tv. After hours of","useful":3,"cool":0},"bTOexzn-te834NAUukiF4A":{"text":"We stayed here on our wedding night in June.  Got a great deal on the room, and found the ","useful":1,"cool":0},"p3GhEhA2M6Us1GN2VmTP3g":{"text":"Very exquisite hotel! French theme and artwork is absolutely amazing. The decor makes you ","useful":0,"cool":0},"lLXWWLLewacaJDcKnSWu-A":{"text":"What an exceptional place! I can't believe there would be any reviews under 5 stars. We ju","useful":0,"cool":1},"C9WA_HwS0VAd_CJhdsUoVg":{"text":"I stayed here for work. The hotel is lovely in many ways, but I want to highlight the staf","useful":0,"cool":0},"_T3CYS3Hi5S4ujbQGtpk7w":{"text":"I stayed here during Mardi Gras and it turned out to be a very optimal location.  We were ","useful":1,"cool":0},"gw5w8YqaeISLg7UoAScNCw":{"text":"Elegant, a taste of the bel époque. Attentive staff, and a great buffet breakfast, served ","useful":1,"cool":0},"RuTWZ8fRQeIBaqDwSrVqmA":{"text":"This hotel is for the birds. I booked on hotels.com to pay at the hotel when I arrived. A ","useful":0,"cool":0},"aYTcYJyWc9wyM_cBdj-Uvg":{"text":"I had a photo shoot here and this is a review of the aesthetics of the place.\n\nI'd always ","useful":4,"cool":3},"AsVRDmeT_1maJxWvB2yhNA":{"text":"Service was superb, hotel is gorgeous and has an amazing location to all the sites.  The b","useful":0,"cool":0},"wEGzlVpqLCEs4owMuTJ2Ng":{"text":"Le Pavillon has its charm, but then again, charm can only take you so far.  The reviews on","useful":1,"cool":0},"NsX8rzqukbUaNO5n3eH6Cw":{"text":"Great customer service!  Old historical hotel which is close to the action of The French q","useful":1,"cool":0},"nVUDhovGKJ0M5UGDg3MDfQ":{"text":"DON'T STAY HERE!! I travel a lot! And I like\nnice hotels! I recently stayed at this hotel.","useful":3,"cool":1},"gw-ilRQsiJHwrW58NKIS2g":{"text":"Incredible ! Family had a blast!  Best service we have experienced in years. Planning a we","useful":0,"cool":0},"ASCpl_HoIVrQEfro62FMSQ":{"text":"Just a lovely, old-fashioned hotel.\n\nI got a great deal on Priceline--the middle of July n","useful":0,"cool":0},"-9jHeJnktryQlO5FhA8fpQ":{"text":"We checked in during the week of Mardi Gras. This hotel needs to train staff on customer s","useful":3,"cool":0},"YItGHZaVPVstLcSr_Egzhg":{"text":"just spent a week at this grand old belle of the south.  from the get go?  wonderful.  chr","useful":1,"cool":0},"H5wtSfES_67t0BJpJnheMQ":{"text":"Had to stay an extra night in NOLA so I booked a room here last minute and considering it ","useful":0,"cool":0},"12gG2sryIQPppq3sfWTMdA":{"text":"Can I tell how much we loved this hotel?! We travel twice a year to get our New Orleans fi","useful":2,"cool":0},"Yy3Fw30N2UctswmNDZDPcw":{"text":"Being that I travel to the tune of 100 nights a year or more you learn what to expect from","useful":7,"cool":1},"s4p6rSLzfhXggtqSBkL-2w":{"text":"1.  Reception desk fails to even acknowledge her standing there for two minutes while they","useful":1,"cool":0},"18IOlXHUkZA3ZKqGwMFDaw":{"text":"Absolutely loved my stay in this historic and opulent hotel. I am a history lover and felt","useful":1,"cool":0},"MqSBRkwH5unlQUVJLtw1uA":{"text":"Pure amazing.  The decor of the hotel is great.  Very old fashioned and marvelous.  The ho","useful":2,"cool":1},"IubUQ01jlKEb4xJdzK0CWA":{"text":"First impressions mean everything, Cedric was the first person we saw as we pulled up and ","useful":1,"cool":0},"3auBpP-Io8u8F8AH4svuGQ":{"text":"I had a fantastic stay here!!! \nEverything about this hotel was amazing! \n\nLocation: 4-5 b","useful":0,"cool":0},"Kqp-2GFAgoL5M52PFi2arg":{"text":"Excellent hotel, service is superior and comfortable at the same time. Other yelpers have ","useful":1,"cool":0},"GBnIdX4sE_3UFgn-OEuZQw":{"text":"This hotel had the old style Parisian décor and very polite employees. We stayed here two ","useful":3,"cool":1},"nnJG_yL1mOvDOQ5mHeYBgA":{"text":"Loved Loved Loved my stay here! Myself and two girlfriends came to New Orleans for Memoria","useful":0,"cool":0},"ra50RmKyOvJ7Sa7fkn5amQ":{"text":"Le Pavillon was one of the hotels chosen by my sister and her fiancé for their wedding gue","useful":0,"cool":0},"AEGe6sN7eszqa9jq23S-dA":{"text":"We really enjoyed our stay at this hotel.  The location is very good.  Loved the roof top ","useful":0,"cool":0},"4YMwcWF-UMfv9W5g8S7O6w":{"text":"NOT worth the price tag.  We booked last Spring for a 4 night October stay.  While the pub","useful":0,"cool":0},"wtrIUt82Fv35evq5Hp1INA":{"text":"Love love love this place! We chose this hotel, as we loved the older classier feel, and w","useful":2,"cool":2},"mt0R3GTcSkzjzKTzY5YWdQ":{"text":"This is the second time we have stayed here, and it's going to be the last.\n\nThe lobby is ","useful":3,"cool":0},"WvkbI-HyzQSh4gp9TCNWIQ":{"text":"Le Pavillion has obviously never heard the saying \"if it ain't broke, don't fix it\". I say","useful":0,"cool":0},"dvG0JtGlPsSyd6DUE2LlpQ":{"text":"GORGEOUS hotel! Amazing location and super nice staff!\n\nWe are from Los Angeles and the su","useful":1,"cool":0},"VtKJwkHYWwz2L712gSzwSQ":{"text":"So after all they have billed me for parking but at the time of check out I was told I wil","useful":0,"cool":0},"DhgAWeeP1GiOQYAZ9rTQ0Q":{"text":"On our honeymoon!!\n\nThe good: Historic hotel with nice restaurant/buffet, friendly staff, ","useful":2,"cool":0},"qIiWUMyIooF3LMjZ2Zighg":{"text":"Excellent staff. Beautiful facilities. Would absolutely stay again and recommend. \n\nFront ","useful":0,"cool":0},"_Y0B6oEVeBFSi8CkVmr2YA":{"text":"We had reservations for 11:45 on Christmas day brunch.  There were 60 people waiting...30 ","useful":1,"cool":0},"FjQfKkM8XKY97LZ9AEnn6A":{"text":"This place was amazing! Tthe manager Gustoff was awesome.  He really listens to his custom","useful":0,"cool":0},"5oj1EYipas_xGsY6FJjaYA":{"text":"I did regret picking this hotel for our five night stay. It's an older hotel with a certai","useful":1,"cool":0},"dwwl9d8PnaaipUFt3kukLA":{"text":"As a hotel snob, I would definitely not consider this a 4-star hotel. However, I had an en","useful":1,"cool":0},"lB1C20c7dkYdYCjQs1jRQg":{"text":"We stayed here 9/26/16 through 10/2/16. We had 3 rooms booked. When we arrived we were ask","useful":0,"cool":0},"aybfXVtU3s-J1TyA4az7uA":{"text":"Bad customer service. We weren't greeted when checking in. No one picked up we we called f","useful":0,"cool":0},"blH11BgPvuK13z4ZT8Nz9A":{"text":"We just returned from a great business trip to New Orleans and had a wonderful stay at Le ","useful":0,"cool":0},"WpjQbrVXBPWwah1fIbiAbA":{"text":"What a disaster of a stay. We went to New Orleans for a bachelor party weekend. We get to ","useful":2,"cool":0},"2_ZsC9kB_sSgynwMH6i-aQ":{"text":"Nice \"fancy\" old school hotel, pretty reasonable, in a good location for access to various","useful":0,"cool":0},"Xf9zc-Ubn20sAf4it_MO8g":{"text":"Travelling for business hotels can be a hit or miss and you develope a list of goto places","useful":0,"cool":0},"qESC4y01_ZgGwRCyMhbOtQ":{"text":"Of course Tulane would put us up in the fanciest of hotels! They have a valet service outs","useful":5,"cool":1},"gfPMlo5f0zpl8NaZI6CNXA":{"text":"The breakfast buffet is awesome. I visited there twice as I only spent a week in New Orlea","useful":1,"cool":1},"3nx_igMZ1LIuqfOu3pXpMA":{"text":"I really, really enjoyed my stay here at this hotel. It's very close to Bourbon St., etc. ","useful":1,"cool":0},"S1vTUaCPqfD3SyNk_iHxNQ":{"text":"This place was great! First off, the staff is super friendly and helpful (must be that sou","useful":0,"cool":0},"Vgd8514eyv-UwCDuNrDY5g":{"text":"When my husband booked this hotel, I didn't realize it was one of the most haunted hotels ","useful":3,"cool":3},"txjfNgJ_62wIRny8h-DKSw":{"text":"I definitely enjoyed my stay. Staff was really friendly and the location is great since it","useful":0,"cool":0},"1NEV6nRNRURBcKER2XES4w":{"text":"Beautiful rooms and close to all areas. Especially if you are in town for a Saints game. T","useful":1,"cool":0},"WfNwOlhFVjWeaj0g3LeARQ":{"text":"Don't believe the reviews!!!! This is the worst experience I've ever had. Bad service bad ","useful":1,"cool":1},"YPt_qBvMyAVmtSFxD8XwsA":{"text":"I just had a really pleasant staycation weekend at Le Pavillon. Here's some stuff I loved:","useful":1,"cool":0},"-20rhE2ZsMyIk_LqFJgZsA":{"text":"This hotel is quaint and well located but the service is horrible. The front desk staff is","useful":0,"cool":0},"aVgpS2TGDsfWbddEZ4JrZg":{"text":"The hotel overbooked for the night of March 14-15. Several groups of people who had reserv","useful":0,"cool":0},"xL7d3zw4T5Hl-gVcpyN0eA":{"text":"This is the nicest hotel that I have ever stayed in. You really do feel like you've steppe","useful":3,"cool":0},"qtrkQtZugSh57MtvfUn6Mg":{"text":"It's pretty enough, and we may have had a paranormal visitor... Sadly, the housekeeping st","useful":0,"cool":0},"hcCwQOQEt1rKGZfJuJCPlg":{"text":"This was a great place to stay. Very clean, friendly and attentive without being pretentio","useful":1,"cool":0},"P8WAKuadOW4Fc3EUvl1z9Q":{"text":"I'm torn on this hotel. It's got some high points and quite a few lows. Let's start with t","useful":1,"cool":0},"JWHLIh6epDVJK_p4JejNyA":{"text":"This should be on your list of places to stay at least ONCE. The staff was exceptional and","useful":2,"cool":1},"AmPaB5OkGJk-rS771OoRWw":{"text":"The hotel was pleasant and gorgeous. Hot tub was out of order during our stay. No fridge, ","useful":1,"cool":0},"AUwrGR8B7Ul83j4XGIyG7Q":{"text":".","useful":0,"cool":0},"ui7l5P9oLDkTG4F9EhCJLw":{"text":"Everything about this hotel is top-notch! We spent a wonderful weekend here. \n\nFrom the mo","useful":4,"cool":0},"zYHmV0i3B6Qb9gj3Wf6wbQ":{"text":"My husband and I rode our bikes downtown and spent Friday night here.  A couple of things,","useful":1,"cool":0},"kSDdnK5loDLnJtR87aeeGw":{"text":"We found genuine hospitality here.  Everyone we met: Mr. Eschete the manager (thank you fo","useful":0,"cool":1},"CIR-bVrmoDiEjafXK-rARw":{"text":"Friendly staff, good location and awesome style with strong assets like swimming pool, hot","useful":0,"cool":0},"HSqafq8-jBek0KYkX7jwGQ":{"text":"What a haunt!  This place scared me silly on arrival and I literally reconsidered the thre","useful":0,"cool":0},"TdMDFujvaYzAB_GaBNM0mg":{"text":"Awesome staff and beautiful lobby area! We booked a room at the last minute and got a grea","useful":1,"cool":0},"Dts-zlmHw648CckT9iQxMw":{"text":"Extremely nice staff and the pb&j sandwiches st 10:00 every nite are perfect!","useful":1,"cool":0},"IrkbxgxYdzhznmt7RBG-iA":{"text":"If you're looking to get the full New Orleans hotel experience Le Pavillion is definitely ","useful":0,"cool":0},"LbzK0i2tKBa6c-SJ3-khvg":{"text":"It is the first and the last time I am staying at this old cranky hotel. Internet connecti","useful":0,"cool":0},"qWPICZgtePupO3cUesAklQ":{"text":"Five-star service with two-star facilities.  While I appreciate 19th-century French decor,","useful":0,"cool":0},"s-kOd63u1rl3dITBCp02Sg":{"text":"An older hotel with character and charm, Le Pavillon is one of those formally decorated es","useful":2,"cool":0},"KXyrwfo1Cqd2h7tI4K5kRw":{"text":"Our room was very small. Upon arrival the toliet was dirty. The bathroom sink drained so s","useful":0,"cool":0},"AT0h7-jH7U66-8TBlj-tMQ":{"text":"Definitely feels like a hotel from the past. Beautiful. And the bed and pillows were very ","useful":1,"cool":0},"Jh76fWz3swPmWv-_xx9WeA":{"text":"I really enjoyed my stay here. It was inexpensive. Quick walk to Bourbon street but still ","useful":2,"cool":2},"aq9tgvPmVerimRQu1pavsQ":{"text":"From start to finish this experience has been less than pleasant. The aesthetics of this p","useful":3,"cool":0},"-HzqPVcHx0Bk3F4G1O0iNA":{"text":"Best hotel ever! Concierge helped to plan my day down to the last min, Paula at the front ","useful":2,"cool":0},"kv5anhrffDZPLzyHDAZaQQ":{"text":"It was a decent experience. The old building does ooze old world luxury and, if you love t","useful":2,"cool":0},"ei5KPTzwGWUQE1hOA7aFiA":{"text":"From the moment we walked in we were wowed by this hotel. The lobby was impeccable clean a","useful":0,"cool":0},"mDUbpdNz28UomgqpRRBKPg":{"text":"Weekend getaway with the family. Booked this hotel through Priceline for a great rate. A f","useful":1,"cool":0},"T4dq40CjltOau4tRyCnWUw":{"text":"Everthing was great except BRITTNEY at rhe front desk! The rudest person i met . I have ne","useful":0,"cool":0},"2czAP9JV58uTal0LG6Vmbw":{"text":"Loved it. Rooftop pool + hot tub + lounge area was the highlight. The hotel itself is awes","useful":0,"cool":0},"jBwlv1iC9JYZq7eoy7D6xw":{"text":"Absolutely amazing! They heard it was one of our party's birthday and delivered cake and c","useful":0,"cool":0},"CR5O3UqoNiWoZ1BdJTv_EA":{"text":"The Le Pavillon hotel experience was exceptional being a first time tourist to New Orleans","useful":1,"cool":0},"LPqgvygw0w8BDuYRhnXVyQ":{"text":"Great centrally located hotel.  Close enough to walk to everything but far away enough not","useful":0,"cool":0},"U17PEnIFdB564c4L1FHwyw":{"text":"Literally just checked in and the only reason I'm even giving stars is because the hotel i","useful":3,"cool":1},"sxJh3lvSVkS7_d3Q3tUVSw":{"text":"This is an older hotel so it's a given that it's going to dated in some areas but it's was","useful":0,"cool":0},"bie7kZ2L2_GF4j-8e-rwKQ":{"text":"This is without doubt one of the coolest hotels in the city.\nThis review is based on just ","useful":1,"cool":2},"ZpGrhDxeH1DDKVkhFhfU_g":{"text":"The staff here is very helpful and the location is great.  You're literally less than half","useful":0,"cool":0},"j4Ag0QuGn9ef5hD2nUOuwQ":{"text":"I'd definitely recommend this hotel if you want to stay around the tourist area of New Orl","useful":0,"cool":0},"2J8qfF7pduaJFyqbh9Y3Xg":{"text":"Disclaimer: This review is for event services only\n\nI attended a wedding at Le Pavillion a","useful":1,"cool":1},"P9vAkof-9uFYa0ERHGco2A":{"text":"I have loved thi hotel since i first stayed in it back in the 90's. they are going through","useful":0,"cool":0},"G3BtZdM2qLTmhAbAErWt7Q":{"text":"Great vintage hotel in the heart of New Orleans. Great amenities on the roof !!! Gym, Pool","useful":0,"cool":0},"cJyQrgGznIyz8yvyeuaRyg":{"text":"My husband and I stayed here on a recent vacation to New Orleans. It is a STUNNING hotel, ","useful":3,"cool":0},"UzAv4S1rDPV1uNXzEziuvw":{"text":"Well, where do I start?? The pictures on their website state that the rooms are \"Gorgeous ","useful":1,"cool":1},"-RG_fxVq2gwUg_91r7ceGg":{"text":"Overall, my stay here was good.  However, I had some frustrations with the hotel.  1) The ","useful":0,"cool":0},"25BgcqAzXGyACbJznpo3bw":{"text":"This was absolutely the best hotel experience of my life. The staff was wonderful and pati","useful":0,"cool":0},"0NpQwVOnzHPe24NwWDW8EA":{"text":"wow!  i can't say enough about the service at this place.  from the valets to the bellhops","useful":0,"cool":0},"7Re-VlQuXTT-1eKEyOR59Q":{"text":"This hotel is unlike anything I've ever seen. Although, I've also never been to a place li","useful":1,"cool":1},"XYzEFwVvzdA68G-4ZkOnPw":{"text":"The room itself is wonderful and the hotel is neat, the concierge was also very good. The ","useful":0,"cool":0},"zNn-1d0vgKdl8Gaw3dFtmA":{"text":"Horrible customer service. During my stay they were filming a movie in the lobby as well a","useful":1,"cool":0},"SS_QWXP48LCmggj-f57sEQ":{"text":"As of this date the Gen. Mgr. of the Hotel still has not responded to my letter. Shocking ","useful":1,"cool":0},"PDFrCy9_njPCCeXk7HWBng":{"text":"Stayed here and was disturbed to see brown spots on wall by toilet and stain on the ceilin","useful":1,"cool":0},"AY8f9K_bhyw71sTVTA-M3Q":{"text":"We had such a great experience at this hotel. We were here for my 30th birthday trip and m","useful":1,"cool":1},"p4FA-JBQarCgDy15U_-jHQ":{"text":"Hands down, best brunch in New Orleans! The food is great, there is usually a live musicia","useful":0,"cool":0},"ZLRwdALx-sp_EEQbLJvP5w":{"text":"Horrible.  Customer service is totally absent at this gorgeous hotel. What a shame that th","useful":1,"cool":0},"MsxkXftkPT6Orsso2b6ONA":{"text":"Very nice hotel and the tradition of giving PB&J sandwiches is fantastic!","useful":0,"cool":0},"Ty2GZO3OiYa9LMTECWiejQ":{"text":"Made a reservation in September and arrived on our day to check in- they didn't have our r","useful":2,"cool":0},"sOHAtWiY4VTlExrclbfIeQ":{"text":"Beautiful place, but very disappointing. One of the reasons why I booked was for the rooft","useful":0,"cool":0},"P1IXY0CHRLugH6jLDaOYiA":{"text":"Stayed at Le Pavillon for five nights and had a pretty good experience. Beautiful hotel an","useful":1,"cool":1},"2fwl3V0TePSaroZd77oPzw":{"text":"This review is only based off of the Crystal Room for their lunch buffet and not the guest","useful":4,"cool":4},"PbVlf7WxcTr_ef39OuDr5Q":{"text":"I had a room with a king size bed. I was very impressed by the elegance and newness of the","useful":0,"cool":0},"TOogScNUHIX4UydQvS2g7g":{"text":"This review pertains only to the dining room, haven't stayed in the hotel.\n\nExcellent gumb","useful":1,"cool":0},"wRCQQLjks9zUCo768O-Ayg":{"text":"We just stayed at Le Pavillion for 4 nights during our honeymoon and it was the best hotel","useful":1,"cool":0},"JiCFvRrkFtrkaGLVK-An4A":{"text":"I'm amazed by this hotel! I booked it for 4 nights because of great rates on Orbitz. THEN ","useful":5,"cool":3},"oDQwv-RkuuRYFcIhayyYTA":{"text":"Stayed here for 2 nights: If you can easily afford it, do it.\n\nService is what you paid fo","useful":4,"cool":0},"X-emHH8d1cQu1zgKmTgiHg":{"text":"Beautiful Historic Hotel,Located at a Great spot . Walking in It shinning a d chandelier a","useful":1,"cool":0},"i4vu9qR0Yp6yTm7lW95iHQ":{"text":"At its convenient downtown location, this elegant hotel is within walking distance of both","useful":0,"cool":0},"R4u5Y892kyh9v7T9Nodq4w":{"text":"Absolutely fabulous place to stay.\n\nIn the CBD, a few blocks' walk from Canal Street and t","useful":4,"cool":2},"JloMBt6m4pUdiaJZXnaogg":{"text":"Pretty old hotel with excellent service and fantastic location. The lady friend and I stay","useful":0,"cool":0},"qof5Fh9xCSvI-QCmaRgq-A":{"text":"I'm from New Orleans so doing things like a tourist has been a learning experience for me.","useful":0,"cool":1},"b2UFFutod2DHbf7pQ4AP8g":{"text":"Hotel is historic and beautiful especially the lobby area however they under going renovat","useful":1,"cool":0},"64ezQIImhVxdb5O77dtJfw":{"text":"This place was very classy, staff was so friendly, from concierge to housekeeping. No comp","useful":1,"cool":1},"xT1FK8Ckb8JokRcKl5gLcA":{"text":"The lobby is fantastic aesthetically. The late night snacks of PBJs and hot chocolate choc","useful":0,"cool":0},"31Ob2BvS5FV5VV_6KuWT5g":{"text":"I picked this hotel on a lark. Initially, when I was researching this hotel it was out of ","useful":0,"cool":0},"r1ivAIiJQAwiBDak4QYQ2Q":{"text":"This was one of the best hotels I've ever been to. Especially with all of the modern hotel","useful":0,"cool":0},"mPDDS7bjW6V-od1v5kk1TQ":{"text":"No hotel has ever measured up to this one wherever we have travelled. The hospitality and ","useful":0,"cool":1},"NIhhoaPkQfO3ZSB1NeyP4Q":{"text":"First Day at the Hotel\n- Ending up having to move to another room because the floor (carpe","useful":0,"cool":0},"AoUVl5McXtWCaH6AMHGAdw":{"text":"Perfect example of slightly threadbare Southern charm.  The hotel is very ornate, but also","useful":1,"cool":0},"U5rWDS3QpWQKUVEzs1rLiQ":{"text":"I hate to have to give this visit one star... maybe two, but lots of things didn't go well","useful":11,"cool":1},"uNe5EQHGq4UAxYhs4CbjGg":{"text":"I stayed here over the holidays this past year, and I would definitely recommend Le Pavill","useful":0,"cool":0},"hjzJsarHxEhbLrTON3y55g":{"text":"i gave this hotel 3 stars- let me tell you why.\n\nWe decided to stay during Mardi Gras (for","useful":1,"cool":0},"kjDKNdbBOX8KvdDxAH7Ntw":{"text":"Yar\nYar\nYar!\n\nOur friends had a suite, it was suite.\n\nRooms/Decor, absolutely amazing.\n\nDr","useful":0,"cool":0},"TBTxmTLXDyWtFrK4SP1hkQ":{"text":"Wonderful hotel. All the rooms have been recently remodeled too, so ignore most of the pic","useful":4,"cool":1},"qpqHNN3c4YiE7hgWv1ruWw":{"text":"I was in NOLA for the first time for an interview and the program put up half the cost for","useful":2,"cool":0},"XD6Bg4sDqAQeK2BQFWWR3Q":{"text":"An awesome hotel with great charm and lots of nice amenities. My mom and I stayed here for","useful":0,"cool":0},"9sUyudrmT5DQsIIn6DcLSw":{"text":"My friend and I just completed our stay at Le Pavillion for Jazz Fest. I must say, I don't","useful":4,"cool":2},"Q1EgPDN4Gfy6OK-SrfyU5w":{"text":"Magnificent and delightful! What a great place to stay for my first time in NOLA.  Le Pavi","useful":0,"cool":0},"1C0xdTLSP-2m-oHL3zxv0Q":{"text":"Very easy check in. The entire staff is super friendly. The rooms are small but very nice ","useful":1,"cool":0},"yPnqoPD4iEk-32jelsfucw":{"text":"My boyfriend and I spent a few days here over Valentine's/Carnival/pre-Mardi Gras weekend,","useful":2,"cool":0},"4jpMhTakx94zJCt43pL_bQ":{"text":"If you are ever in New Orleans come visit Paul at Le Pavillon Hotel. Paul makes some aweso","useful":0,"cool":0},"L086vkgAQX8S0TpHZ5QPrg":{"text":"Overall Rating 3.5\n\nAmbiance : Charming, Old fashioned\n\nHotel Staff : Pleasant and accommo","useful":2,"cool":2},"nLKQc2oWOOPavwa2iOTH3w":{"text":"I've only been here for events and never stayed in the hotel.  This is a nice hotel and it","useful":2,"cool":2},"9hUP-EjT1ZxUn7nBaBKmHw":{"text":"I was very disappointed after staying at comparable hotels in the area.  The lobby and fro","useful":0,"cool":0},"K2gc2AdbeT374RXALat6Jg":{"text":"The hotel is absolutely beautiful. The service isn't. I had prepaid for the room, yet when","useful":0,"cool":0},"AqnJ_FOTtFxuAcusWbCfmw":{"text":"I love this hotel! I left a few days ago and I wish I'm still there!\n\nThe decor in the lob","useful":0,"cool":0},"P2cZRtUt5cSkJjTn9g0k0A":{"text":"Check-in was abysmal. We arrived at about 3:05p to a lobby full of travelers waiting for r","useful":0,"cool":0},"cvQOJVSVfkHUwymB3TlNOg":{"text":"Booked ~20 rooms for a large group.\n\nStaff was very friendly and helpful when booking. Mad","useful":0,"cool":0},"ND7ElRcvjG9JoYjwFmAz_A":{"text":"Me and my sister stayed here for French Quarter Festival April 2018. I found it to be a ve","useful":0,"cool":0},"D19e-CttznkaS-HZKO67nQ":{"text":"My friends and I stayed here for a long weekend visit as it was fairly close to the starti","useful":4,"cool":3},"tCue7z69pYH7GeJkQ2ypyQ":{"text":"You must visit the bar and ask for Paul... he is awesome with his drinks being 10xs better","useful":0,"cool":0},"uHOYVvclxzWxxhxk2ElpVg":{"text":"Nine.  There are nine STUNNING chandeliers in immediate view when you check in to the fron","useful":1,"cool":0},"Z5bGTap93t6xEb6hRpsyAQ":{"text":"Le Pavillon is a real nice hotel rather close to the Mercedes Superdome, That was the reas","useful":1,"cool":0},"77gvzgQp1wMgAXcpkngRdQ":{"text":"We came to hotel at 10:00am to check-in but they told us room wasn't ready yet but would d","useful":0,"cool":0},"SQbQKXAzXd60YmJ2IlAjcw":{"text":"This hotel is truly a 5 star! The unique quality of the hotel, outstanding staff service, ","useful":0,"cool":0},"kBo6HhNUAAOwkN3bRjFWTQ":{"text":"I don't like to form my opinion on other people's experience . I believe that you should m","useful":0,"cool":0},"Dci5fD_tGGeeB1dZryvNDw":{"text":"Le Pavillon is amazing! We just had our wedding there and it couldn't have gone any better","useful":0,"cool":0},"6wY82hac6TDnmKeWSBNkfQ":{"text":"I'd stay here every time I visit NOLA honestly.\nIt's not too far from everything,\nEven rig","useful":0,"cool":0},"YufE8QGknj9WNmUYe9xX5Q":{"text":"This was the worst stay of our honeymoon. Being local, we booked this as our room for the ","useful":3,"cool":0},"xr-iAG7hKpcOpgXvnTyMWA":{"text":"Very disappointing. I took my son to NOLA to experience some culture and history. I though","useful":2,"cool":0},"maeRwtzaCbjag3QpcqeLsg":{"text":"I was introduced to this hotel by a friend who is a Louisiana native and considers this he","useful":3,"cool":2},"P-V4vLrl4yy3Qp6N4KUvNw":{"text":"The lobby is very nice but management will lie to you when they make a mistake. So I check","useful":0,"cool":0},"qp1r9B4QpGo2tKfxj2UusQ":{"text":"The hotel is beautiful but they might as well not have any staff. We checked in 30 minutes","useful":1,"cool":0},"Jpm-7OUbJiCNSz-JBtvOeQ":{"text":"The staff was very kind and nice to interact with. The rooftop pool and rooftop gym room i","useful":7,"cool":1},"00fdjnfkS7jNIYehYIwh1w":{"text":"We spent Easter brunch here. Definitely wasn't worth the $50/person price. Every drink was","useful":0,"cool":0},"2FPOeGzoxcnam5zcdJ7prQ":{"text":"Beautiful hotel!! Staff is very friendly and helpful. The rooms are clean and beautifully ","useful":1,"cool":1},"UUgUXof-qpJoP5WZvzLOaQ":{"text":"Upon first walking in, the hotel looks very luxurious and well appointed. However, everyth","useful":0,"cool":0},"tD2596cDMaPBFRpcKMb2_A":{"text":"Big thanks to the evening manager Gregory & his wonderful team who took great care of my m","useful":0,"cool":0},"jmmIkDQxAa0_ArTMNNu_Bg":{"text":"First, this hotel is gorgeous. The lobby is ornate and beautiful and we loved the peanut b","useful":0,"cool":0},"JL2XyvY6x9f1lFPTpZKRfA":{"text":"Hugely disappointing experience so far. We checked in yesterday afternoon and were put in ","useful":1,"cool":0},"tkXZRJwqcuy1_qokaXdkng":{"text":"Pros:\n- Can feel historical value in its architecture, and interior design.\n- Great value ","useful":0,"cool":0},"w3yQ_M_ELpNdgaFiKzcgRw":{"text":"Great place! Staff was very nice & helpful. Room was quiet, had a nice view and a comforta","useful":0,"cool":0},"4IV-7WHABVbdcoMF0hGM1g":{"text":"This hotel is a rip-off. Checking in took forever even if they had six people behind the f","useful":0,"cool":0},"tkD4xDBlXjiMmHg_Cp8zwQ":{"text":"Let me start by saying this is a very beautiful hotel but if their service could match up ","useful":0,"cool":0},"Y3w34bYCdSGWjud0Jhmmqg":{"text":"We were in town for a wedding. The bride and groom recommended this hotel because it was w","useful":3,"cool":0},"Tr9Acp9g3A4Trut3JEqYLQ":{"text":"Five stars all the WAY!!  The staff is very friendly and helpful.  The beds and pillows ar","useful":0,"cool":1},"QuDmcgkF-4rs4FuAdwL5nQ":{"text":"I used to always say this was my favorite place to stay.  New owners now, and gone way dow","useful":0,"cool":0},"GOP4AoMgefxeUxNioEo-uA":{"text":"If you are looking for something modern this hotel is not the place for you.  If you want ","useful":3,"cool":0},"xMevIJpUfyJCcTexfnsVGQ":{"text":"Not bad, not great. Location is a little out of the way if you're looking to party on Bour","useful":1,"cool":1},"sutn2fdGf7fu48lMswbhOg":{"text":"Beautiful place to host events. Feels like you are stepping into a different time and plac","useful":0,"cool":0},"AOH61aUiSbyG6Q7an7wDgg":{"text":"Beautiful hotel walking distance from many interesting parts of New Orleans. Our room was ","useful":1,"cool":1},"6MxeVY2-vrO_tg4XJildGA":{"text":"Stayed at Le Pavillion Hotel two nights. The hotel was beautifully decorated especially fo","useful":0,"cool":0},"RWSCOJCmBlIsgQn5iRJwUg":{"text":"I stayed at the Le Pavillon the week of May 14th - May 18th.  I left my apple watch in the","useful":1,"cool":0},"olgFi20zCpEdzkcP-xT94A":{"text":"I can not say enough great things about this beautiful hotel! \nFrom the attention to detai","useful":1,"cool":0},"mmkAO-ogIe7HTyR1Iw82aw":{"text":"Comfortable, classic, great ambience!  Can't ask for more in service or comfort. As soon a","useful":0,"cool":0},"06whP0B1tNfq-V65hQEAUQ":{"text":"First things first... \n\nWe were here for a wedding so we had a group rate so this was a po","useful":1,"cool":0},"rMCJ23wqfWoLzuYPanQOWA":{"text":"A nice stay in a beautiful property, soured at the very end by attitude from the front des","useful":0,"cool":0},"UrVPww7rpcf1EkJ8-m-U2A":{"text":"I loved every moment, that I was there and didn't want to leave. The staff is amazing and ","useful":0,"cool":0},"XaXbbhC_T-GJydNMZzfyFA":{"text":"I don't know why no one has commented on this hotel yet but I'm proud to be the first! Thi","useful":1,"cool":0},"y-JKB2xhn3WodZy4yp6abg":{"text":"Really great service! \n\nRooms are old fashioned, Victorian or French, feels almost like B ","useful":0,"cool":0},"rivyVqOkpcw6z1NiMYtiSg":{"text":"We had a recent stay here for a little romantic getaway and it was very nice.  I have stay","useful":2,"cool":3},"zgodBYgJAGD0Xq77uEgCcw":{"text":"My stay at this historical elegant hotel was anything but good. I've had much better stays","useful":0,"cool":0},"HIhLX6o4Z6t3zB7JXWCSMw":{"text":"I stayed here 2 years ago when I was volunteering for Rebuilding Together.  it was a fluke","useful":1,"cool":0},"ocpcI3az9j4nhqUO0hHP6w":{"text":"A grande dame of hotels and a stunning bar, which is where I spent the majority of my time","useful":10,"cool":4},"IsF-ydoMix9aHsjvHMVcgQ":{"text":"Had I written this review a couple years ago, it would've easily been FIVE STARS... from t","useful":4,"cool":5},"qBiShpOsKdjEY_apQVuBLQ":{"text":"Hugely disappointing experience so far. We checked in yesterday afternoon and were put in ","useful":5,"cool":0},"6jprZYL4EYTA1yIhnQlbDg":{"text":"Booked through Hotel Tonight app. Always great experiences with them - this hotel has over","useful":0,"cool":0},"PcuNwpND2nRJ2KfkCZKFQw":{"text":"Location was nice, room was very comfortable, the style of the hotel was very chic. I arri","useful":0,"cool":0},"HRgV0UVgw_c9FTyPLFlKBw":{"text":"Amazing amazing amazing. From the decor to the service. I wish I could have stayed longer.","useful":0,"cool":0},"iQDowE8YPhhrfj0w8f8ZVA":{"text":"We stayed here for our family Reuion August 4th. The last night of our stay August 7th our","useful":0,"cool":0},"NAtzkRNquQyXIzarlQIRhw":{"text":"The first time I saw this hotel I was staying at the Hyatt and walked by admiring the buil","useful":12,"cool":7},"b0W9JXH4QqP4ACjrGhOaJA":{"text":"It pains me to write this review... Our last stay here ended early this April, 2016. This ","useful":8,"cool":0},"j_Ik3ulRsVq6pT2OqDZocg":{"text":"Good location, clean rooms, and the free peanut butter and jelly sandwich along with hot c","useful":2,"cool":0},"p5ctdOYCfFCOeUw0B4Wi7Q":{"text":"Beautiful architecture and traditions with modern upgrades - Le Pavillon does not disappoi","useful":0,"cool":0},"rnSSEKfIrCIa10Ax3SEuWg":{"text":"Family & I stayed here for 2 nights on our 1st trip to New Orleans. This place was so wond","useful":0,"cool":0},"6N_YqrvFAzZyKD_qX_Nb3w":{"text":"Probably the best hotel I've stayed at. From the start the bell boy, Nick, was super nice ","useful":2,"cool":0},"q_DzR_s5eW_QnvW384aDiA":{"text":"I stayed at La Pavillon in October 2018.  It's a beautiful old hotel and the rooms are ver","useful":0,"cool":0},"PP-Xya5fgpCGpgPoAa0qaQ":{"text":"I can't believe it took me 8 trips to NOLA before I stayed here. Gorgeous hotel, phenomena","useful":0,"cool":0},"s2hD9m0jj7OuNaDgtrJKZA":{"text":"Located in the financial area and has a cool old French hotel feel. Upgraded the look to h","useful":2,"cool":0},"PlbLe9vrV_b7sJHheCqK8w":{"text":"We decided to stay here vs Marriott where the rest of the family was staying.  We are extr","useful":0,"cool":0},"SdHGNhJcxyWPSHJdK5Tv_A":{"text":"This is advertised as a four star hotel but I think it's more three stars.  It had a lot o","useful":6,"cool":2},"C8xlBjJPJKiF7P-NWUQSSQ":{"text":"We decided to take a trip to New Orleans and we were looking for some hotels and found thi","useful":14,"cool":10},"WyPNqFdU9eGqrFxVEJNbQA":{"text":"Tho the hotel is very nice, I basically got looks like I was in the wrong hotel. We got to","useful":1,"cool":0},"S8fw4ehNvXjkxyuCMFv0gg":{"text":"This hotel looks very nice, but is poorly run.  We arrived at 2:40 for a 3PM check in, and","useful":0,"cool":0},"xHbghJdeRLfeyGk7yn7ZeQ":{"text":"I grew up in New Orleans although I live in PA now, but I was in town for a work conferenc","useful":0,"cool":0},"-_daW5iEG47rrD62pfafjw":{"text":"I would not recommend this hotel if you are looking for the type of hospitality Nola is kn","useful":0,"cool":0},"lrVdD2Qgj5stmvf7wxEL0w":{"text":"Truly enjoyed myself.  Celebrating my friends 40th bday. The bday dinner was so pretty the","useful":1,"cool":1},"9Qp0dsV20OvrvfBmTDuRRw":{"text":"Great value for your buck hotel (we paid around $108 before taxes in July).  Rooms were cl","useful":0,"cool":0},"2HRwclmLP-8TFyBrYxw-aQ":{"text":"Stayed in a two bedroom suite here over Christmas with my husband and his parents for just","useful":0,"cool":0},"_IOjGGtb3DMkSaHHYshCgg":{"text":"This is a very nice hotel. The staff was accommodating and helpful. The rooms look and fee","useful":0,"cool":0},"VxBK5BnGGqw7754c6oyhvg":{"text":"THANK YOU SHRONETTE DAVIS!!! \nNow, let me explain why that is the first line of my review.","useful":2,"cool":0},"Gf2nyrmoEVrWz0K6DUviCQ":{"text":"I wish they had half stars because honestly I would give this place 3 1/2 stars. First off","useful":0,"cool":0},"kXNQQIYu_C8CPIrGcISfuQ":{"text":"Breakfast buffet is world class!!  Classic cajun food!!  Or they will whip up whatever it ","useful":0,"cool":0},"aajrwvRbX6IeL2mVTthnzA":{"text":"DO NOT STAY HERE! They offer nothing here. No food service only via 3rd party and they do ","useful":0,"cool":0},"DllQWXMLF7y0NzLUWvF1vA":{"text":"My husband and I stayed at Le Pavillion back in 2006, the weekend we got engaged and we de","useful":0,"cool":0},"my5UaMzL2rQ4WYkp19zB1Q":{"text":"This is the best hotel I have ever stayed at! It has an old school charm that throws you b","useful":0,"cool":1},"EWRubDN7jkoalGsp1R_mZQ":{"text":"This hotel does an amazing job of giving you not only letting you feel welcomed but very m","useful":0,"cool":0},"rqasX87Jjc7xuKyQRLcYyQ":{"text":"The exterior is grande as well as the lobby but the rooms fell short. \n\nFor one, everythin","useful":4,"cool":2},"3_rv9MDP7xNUkL-jgt1HGA":{"text":"One of the best hotels in New Orleans.  Normally, if you're traveling off peak, you can ge","useful":0,"cool":1},"zPacKUr2P8_AIS4F7mcMpw":{"text":"Le Pavillon is beautiful, historical, friendly, and those complimentary PB&J's and hot coc","useful":0,"cool":0},"0ZjMRvJfysiQSCYIOcbTLQ":{"text":"Getting ready to stay here for a conference and really feeling uneasy about the reviews. I","useful":0,"cool":0},"qSPsbXNhk4AyKdBQVA7Jow":{"text":"Don't let looks fool you; at first blush the property seems lovely. The lobby is decked ou","useful":0,"cool":0},"TtBWSj_VnWD_gT_e8CJjhw":{"text":"Gorgeous hotel, great service. Awesome hot chocolate. Would be a 5 star review if not for ","useful":1,"cool":1},"5t8NKVzZrHo5J0gRJM3g3w":{"text":"DON'T STAY HERE!!!!! Warning, WORST HOTEL EVER. My family and I stayed here for my sisters","useful":1,"cool":0},"U7Z6OgyXMy3g0367SskcOQ":{"text":"This was my friends and my first trip to New Orleans.  The minute we walked into the lobby","useful":4,"cool":0},"zWX2tUN4o59CpNiCKzOaMw":{"text":"BED BUGS!!!! Besides the service at the front desk being so so with Glenda, I had to clean","useful":1,"cool":0},"dLVIdyZ8N8exCW22Spsqew":{"text":"We stayed here in February 2019, I came into town for 3 night's for business at the Hospit","useful":3,"cool":1},"XYdhsyAynjlAsaxHnFx5lw":{"text":"I live near Baton Rouge but come to NOLA often. LePavillion has always been my \"go to\" hot","useful":3,"cool":0},"5Hvb195Yo-rbG2EQxRRPbg":{"text":"We stayed here for a trip and we absolutely loved it! Every single detail from the history","useful":1,"cool":0},"th35JrLVHZnQZeyNDbzzfQ":{"text":"For the price I paid....it was a disappointment. First. The WiFi didn't work. Second. I ca","useful":1,"cool":0},"eQGywr1685Odha3nxZi_IA":{"text":"Overpriced. No guest services to speak of. Better places to stay downtown with actual amen","useful":0,"cool":0},"wuIhhlXpy36lFpByjLQsjg":{"text":"I dreamed of staying in the Napoleon suite for years after seeing it featured on the Trave","useful":5,"cool":4},"pGaAcDwvmElAy6rBmBWu4w":{"text":"Taking off one star for the size of the \"queen\" bed. Taking off another star for the lack ","useful":0,"cool":0},"HWkURmwPxAX6IT3Nv7Nm8A":{"text":"I had a terrible trip to this hotel. I attended a business conference for two days here. A","useful":3,"cool":0},"Y5N_Z8dHcn7MEcJ6qzOTgg":{"text":"100 Year Old Hotel.\nListed in the List of Historical Places for New Orleans\n\nLet's see....","useful":2,"cool":0},"unBac5b2P4eEVgrTAXJxvA":{"text":"You can't go wrong here. It's beautiful and elegant and so comfortable. \n\nI visited New Or","useful":2,"cool":1},"ajHskCB8UtmIb9-iwxzgDw":{"text":"Love Le Pav!!! As a local I love taking visitors to their 10pm peanut butter and jelly bar","useful":1,"cool":0},"v9d2EgUi-qukh1NEcPetlQ":{"text":"Checked in today. Paying $1,220 for 3 nights. A premium room w king bed. Room is right beh","useful":2,"cool":0},"xls7IKi_9DM-bw7XeUH3uA":{"text":"The most amazing hotel experience.\n\nIt seems like they regularly have those hotel stays+fl","useful":3,"cool":3},"5ODs15Fci6GjcLyNNx9jZw":{"text":"We came back to Le Pavillon this year after a truly wonderful experience last year. Appare","useful":1,"cool":0},"bFyCGI-QEfDsp6ndZWxLCw":{"text":"Sooooo...I ended up here on a hot July night to celebrate love. Y'all, it was hot outside-","useful":0,"cool":1},"x3lGChSkJz-LtcGD0W7JIw":{"text":"Peanut Butter and Jelly sandwiches were available from 10pm to 11pm! When I first walked i","useful":4,"cool":2},"CH2d_JD7WyIuPLx0fhAgzA":{"text":"What can I say about this hotel, well the bathroom was not clean the toilet was the worst ","useful":0,"cool":0},"MwS9sH_9mYFJX5cWQjbxUw":{"text":"Worst customer service.  Michael said he could not explain why my room was charged 30$ and","useful":0,"cool":0},"4-RdQu_oIFH-zidZQs4Ocw":{"text":"Beautifully restored hotel in the business district. A couple of blocks from the super dom","useful":0,"cool":0},"YZEuIsiR6fILMGDW9zIU-g":{"text":"I loved staying in the New Orleans hotel!! The staff was very helpful and professional. I ","useful":0,"cool":0},"szt4Iz1_yb0e1GC0WpBacw":{"text":"Booked for my family (two young children) thinking it would be a neat historic hotel, NOPE","useful":2,"cool":0},"hTB_PUGWUASmd99rYPZDfQ":{"text":"We just stopped for a couple nights while we were passing through. My husband wanted to st","useful":2,"cool":1},"w-DawEEx-DpX9kAYpZCr4Q":{"text":"This is by far, in my opinion, one of the most beautiful hotels in New Orleans!  I love ho","useful":1,"cool":3},"riFUbkkvtuImQdiPqWpXAA":{"text":"Patty Cake is, for me, a NOLA icon. She works the breakfast and the lunch shift. She greet","useful":1,"cool":2},"Km5eAf7AB1IVmilmoXLaWA":{"text":"Once again I'll say that Yelp reviews are hard on hotels. I'm not sure why but I think it ","useful":2,"cool":0},"MzcvK-pOKz_ybtk_Pvv2zg":{"text":"Not sure why people complained about this hotel. I was hella nervous to book it based on s","useful":5,"cool":0},"kxhtBOCkCSjoS4IYlGwxvg":{"text":"This looks like a beautiful hotel based on pictures online, however some of the individual","useful":4,"cool":1},"UJebVECO80xkHip4vJSVWw":{"text":"Wonderfully inviting and beautiful historic hotel. Outstanding hospitality!  Clean rooms, ","useful":0,"cool":0},"525aJ9vVODuYq6chRAMUjQ":{"text":"I go to lay down and the bed had a foul odor I pull back the sheets and the mattress and m","useful":0,"cool":0},"plOSd-LkaodBC-lcbgUGZQ":{"text":"I was born and raised in Mew Orleans and have always dreamed of staying at this hotel. As ","useful":1,"cool":0},"0jysi3y16-Tdg4SgMqOwpA":{"text":"We stay here every time we come to NOLA. Great hotel convenient to downtown. Beautiful lob","useful":0,"cool":0},"7VamGSnA3QtSHin5ZewWLA":{"text":"So.... this was a spare of the moment trip, and we wanted to try something new. Been to NO","useful":3,"cool":0},"ChpYDvR6B_qK4zQuyVmTTA":{"text":"A great, old hotel in a great location, right between the Garden District and the Quarter ","useful":2,"cool":2},"moZ39bFdspf9W0UJYkPQnA":{"text":"Love love love this hotel. It's a little pricey and they updated it last which is amazing.","useful":3,"cool":3},"7cMSxNM_KOwT__G4nKb9cQ":{"text":"When you pull up to the historic Le Pavillon Hotel, you know that you have truly arrived. ","useful":6,"cool":3},"YAqOq44WO-SZaoFYj7UjIQ":{"text":"Don't waste your time and money on this hotel.  The 4 star rating is outdated and this hot","useful":1,"cool":0},"k-xFNaczUr3Ve_u9pTGrfw":{"text":"We stayed for 4 days and on the last day the vent located right above my husbands side of ","useful":1,"cool":0},"1AySwnhzU2v0CWVgZgIpZA":{"text":"I wanted to stay close to the Quarter, and I wanted to try something different.  I've stay","useful":3,"cool":3},"bGhPnDeLOo5ghyf-iNZXkw":{"text":"FIND ANOTHER HOTEL!!!  Absolutely the worst customer service I have ever experienced from ","useful":0,"cool":0},"UiiIB_egWxERgNDLGmjunQ":{"text":"My experience here isn't the typical one. This was our Honeymoon hotel.  The room was the ","useful":1,"cool":1},"xi3WszGtvHSITvq0PSN6aw":{"text":"Our friends chose this hotel for their wedding invites to stay here. They have been here s","useful":11,"cool":12},"Iv0eX8tXuKpTq5LEQnx8hw":{"text":"This hotel is one of the best I have ever stayed at.\nThe hotel its self was very nice. Plu","useful":0,"cool":1},"mj-VxAQ7q_nHPOkDjcmRPw":{"text":"This place was really nice ! And beautiful ! Staff was friendly , the only thing was the s","useful":1,"cool":1},"1jT73UE2CJNb_YCHTsuO0Q":{"text":"BEWARE OF THIS MOST UNPROFESSIONAL, OVERPRICED, UNKEPT SH!THOLE. \nIt i s 10 pm and I am in","useful":4,"cool":0},"t__ARX2e2lnw731gV1ldSQ":{"text":"This hotel is adorable! It's a National Historic Hotel and the decor in the lobby, restaur","useful":1,"cool":1},"umw-4Ni97JP7eG4FJK593w":{"text":"We recently stayed at the Le Pavilion for our wedding and it was a disappointing experienc","useful":0,"cool":0},"KznwAIi3pNathzFiWHyjHw":{"text":"What a beautiful hotel!  As soon as I walked in I was already imagining a fancy ball...  t","useful":11,"cool":10},"VAu9JQlptFRaM9m2bZzCdQ":{"text":"Head chef Derrick was rude and when I asked for a cab he was off-the clock then he came ba","useful":0,"cool":0},"HVfWTOcZ6X0i9ToWF3UMcQ":{"text":"Here's the email I wrote to Le Pavillon after our stay. They still have not answered. \n\nHe","useful":4,"cool":1},"bcQr6_rPOK4rTGrSzCqUJg":{"text":"After a delayed flight, this was the absolute perfect hotel for our stay. A grand entrance","useful":3,"cool":2},"aaJDfwPqHoUbebsyint9nw":{"text":"This hotel is in the central business district, so it is in a quiet area.  However, it is ","useful":2,"cool":2},"Khjvhsby0181k550tes25g":{"text":"It's a beautiful hotel, the staff is great. The rooms on the upper floors are small and do","useful":0,"cool":0},"HbeFL78Eeu-f1yQ4GJOk0A":{"text":"Stayed here during our 1yr Anniversary. I loved everything about This hotel. I will defini","useful":1,"cool":1},"0bA_SdDA8jfoqJq7ldrvug":{"text":"The Hotel is in need of major maintenance.  Two of three elevators were out for the durati","useful":0,"cool":0},"BACnKBQPhbB-G8h0r1SSqQ":{"text":"The staff is very friendly and the hotel looks very fancy and old fashioned, so it's very ","useful":5,"cool":0},"tha32rLNsFc6eGz7SOZ1pA":{"text":"Outstanding service, beautiful accommodations, perfect location. Our family was in NOLA ce","useful":0,"cool":0},"O4saE5UTnpGcWNubVfvj9Q":{"text":"Le Pavillon is a historic, elegant hotel. The chandeliers in the lobby, very friendly staf","useful":1,"cool":1},"aTUhHi3Tqi3eSxILhtqGDw":{"text":"Sometimes a friends recommendation can really improve a trip.  Luckily for me, a couple fr","useful":5,"cool":4},"5YpQeJJYFcF7g9u1KTS3gA":{"text":"Real. Friendly. Folks. A homey little hotel with an old-time big hotel feel. The roof sun ","useful":1,"cool":0},"P9egIRnLkqsLjaqbBI4sCA":{"text":"The Hotel is beautiful and service was polite and professional but it would have been nice","useful":0,"cool":0},"AXUi9G9F0Adf4qsbpX8M1w":{"text":"Do I have to give it one star?? Disaster of a check in process- so slow I was surprised I ","useful":2,"cool":0},"ID3jiBshCPIQklDjthC1lw":{"text":"We made reservations for valentines night and we were sent a special menu for dinner. The ","useful":0,"cool":1},"zJ51eP0QIamRjuWOiFYUhg":{"text":"The hotel is beautiful from the outside. Interior is tired but I'm sure at one time it was","useful":3,"cool":2},"OIUIHoBzuKlnPmeX_hFnQw":{"text":"This is my favorite New Orleans hotel!! I've stayed here a million times, but today they e","useful":1,"cool":0},"ipMTykKWj_ilPK5_1UJt_Q":{"text":"Beautiful hotel. Stayed 4 nights for a ladies getaway. The room we stayed in was clean, mo","useful":0,"cool":0},"MGqbQB9V1m0BW1NZe2D5Pg":{"text":"Just enjoyed a wonderful stay at the Le Pavillon Hotel.  Gorgeous, traditional interior wi","useful":1,"cool":1},"yP9WlgRUc4sYMKGh7CB4EQ":{"text":"Horrible hotel.  If I could give it zero stars, I would. \nNo bellman offered to assist wit","useful":0,"cool":0},"9MiaI4Fbch4I0_4bP3Xwng":{"text":"The good - comfy beds, the rooms and hotel decor were attractive, the staff were friendly.","useful":3,"cool":1},"PjYeO6k6IjXePmkPI3qDBA":{"text":"I stayed here a few years ago with a friend who organized a business meeting at the hotel.","useful":2,"cool":2},"j1BU6Lsz6pJVHo5A-Kdx-w":{"text":"The hotel is very pretty and check in was quick. We had booked directly through the hotel,","useful":0,"cool":0},"-rJz80-Cfj9ELR5aqbqpSg":{"text":"We had very high expectation from this hotel. Our rooms were a bit smaller than shown on t","useful":1,"cool":1},"LlNgd1htgwpEupvmB7AV_A":{"text":"This hotel is beyond beautiful. It's probably on of the most elegant hotels I've ever stay","useful":3,"cool":2},"48tTeOtAmg9kgTbJHiVjWw":{"text":"I am very disappointed to hear that you all treat your guests so disrespectfully. I cannot","useful":2,"cool":0},"MhEd2UmqtUSb3uYKAjHqcA":{"text":"I am a local! I used to respect this place- I want you all to know this is the first YELP ","useful":2,"cool":0},"Hd0t6iU10QiHlW-MRkG44Q":{"text":"We had a nice stay here.  It certainly didn't blow me away at $400/night, but it was comfo","useful":3,"cool":1},"GDG2KslUW2jPH7Cx44dwAQ":{"text":"My husband and I stayed here over the Memorial Day weekend. Beautiful hotel and historic b","useful":4,"cool":0},"RJ02_7o_Wt7YptbyI6sd4A":{"text":"After paying and checking into the Le Pavillon Hotel, I was accused of squatting illegally","useful":2,"cool":0},"S7MIggvkxbww_WVPgORkgA":{"text":"Pros \n- Location Location Location!\n- They keep up a small tradition of hot coco and refre","useful":5,"cool":0},"s20W6-a3XHXqIcCcBk76aQ":{"text":"Beautiful hotel with every single french style details, plus Christmas decorations make th","useful":2,"cool":2},"b5G7-KNCRULimIudeTeSAQ":{"text":"Our entire stay was going very well till the end. When we checked in and valeted our car, ","useful":2,"cool":0},"gI_DVBBk_KEeb3bcrrURxg":{"text":"PEANUT BUTTER AND JELLY BAR. \n\nYeah, you heard me. No, I ain't messing with you. This is, ","useful":7,"cool":4},"DHylyER1gZrB6yJBH3rqBQ":{"text":"Awful service. Don't stay here. Manager is rude","useful":1,"cool":0},"QUBXDIAO0kB51xnslOWTWg":{"text":"I waited to post this review because I was supposed to receive a call from the Manager and","useful":0,"cool":0},"TYBjPoNfSd6OJniqTLQ7vA":{"text":"Checked in late November 9, we were told by the desk clerk that we would be charged $70 a ","useful":1,"cool":0},"h1gcUFZyhSaBYb0Uxsq4sQ":{"text":"The Crystal Room at La Pavillon Hotel is amazing. The hotel itself exudes Old World charm,","useful":2,"cool":0},"nAp-ANeDKh8hYgNbq515rw":{"text":"Numbers numbers numbers \n\nService (in the lobby) 7 out of 10\n it truly depends on the pers","useful":3,"cool":0},"ap_JfEHcbkDAxsSYFmsdxQ":{"text":"The front desk staff was amazing! They all need to get raises! I felt so at home after my ","useful":0,"cool":0},"20lJm475RPdaIB-EB3AJag":{"text":"~~~Gorgeous, Ornate, & Old World~~~\n~~~~~3.25 stars~~~~\n\nThanks to Groupon for offering a ","useful":23,"cool":18},"xdcsH1LURRXXcokkLMiOCg":{"text":"Great hotel...intially hated the location when I was informed we were staying here but I w","useful":1,"cool":1},"uECG6gzjTQmcWooxt6ksQw":{"text":"DO NOT STAY HERE. The manager Michael Gray  accused a Black gay woman of illegally squatti","useful":2,"cool":0},"UWIzy4yG-AUP2CaTiyjM5g":{"text":"Such a beautiful hotel! It's been years since I've visited here but only for an elegant Xm","useful":1,"cool":1},"TsYf0oSgSrlP_U4MgoYMiQ":{"text":"Line moved quickly. Staff was friendly.  AC in the room and in The Bar was very cold!  Tha","useful":0,"cool":0},"BpC5fcrQiXa9pNUAdyXFdA":{"text":"This place is so damn pretty that I want to die here and haunt the halls.\n\nIf you are read","useful":6,"cool":4}}