{"mi4bOYBYSxdCi24HrAROHA":{"text":"Wow. We visited NOLA last week and took the truly awesome and informative  Steamboat Natch","useful":0,"cool":1},"qla2rud5biJAYTaPATQ6Qw":{"text":"This tour is one to take when you want to have a lazy day, but you want to do a passive ac","useful":5,"cool":1},"CG5L8_aOOZKkKpcGywUmgA":{"text":"A big disappointment.  It began to rain heavily soon after boarding and we had a difficult","useful":3,"cool":0},"aRC5HAJfdh2stGEHmJ135A":{"text":"Probably my least favorite thing I did in New Orleans. It was a boring boat tour with a gu","useful":0,"cool":0},"fsykmHzKuQWhn4jibu_nCQ":{"text":"Skip it! Not worth the $27.50. The cruise itself is really boring; all you can see is tree","useful":1,"cool":0},"X1catw_NYqqLHQJ1p2dGKA":{"text":"My boyfriend & I went on the Sunday Jazz Brunch Cruise today. I'm from New Orleans, but he","useful":1,"cool":0},"UdREKGErnjt-3rPv0eRvxQ":{"text":"Romantic experience, fun and relaxing.  Great for a date night.  Music was good, food was ","useful":0,"cool":0},"boqMMCWivZbhU5rWeRrrjA":{"text":"Had a great time on the dinner cruise with friends. Thankfully the weather was breezy so i","useful":0,"cool":0},"yv69hZDz0T1EugsXrGTwRw":{"text":"Ok, the dinner was terrible. Just awful. I am not fond of tasteless fried chicken and near","useful":2,"cool":0},"JU-7s2aFA5zJFib_tx4USQ":{"text":"I've been on the Natchez twice this year.  Once doing the dinner cruise (which is overpric","useful":1,"cool":0},"UKnHJhpnWbk3MYl4CMnJNw":{"text":"Worth the cruise down the river, but do NOT bother with any of their food promotions.\n\nLoo","useful":10,"cool":2},"CSFxl73pqer7ZiNKuxJcKw":{"text":"The dinner cruise pros: evening time is better for cooler weather and a great view of the ","useful":5,"cool":0},"rc2Utjjn624Ijm_jwVZWCQ":{"text":"Great tour offering a lot of facts about importing our table sugar, salt, coal, etc. Saw m","useful":0,"cool":0},"GsU9MLbipNvnug_2deeMnA":{"text":"The ride is quite boring but you'll learn about depth of water and the history of the boat","useful":0,"cool":0},"u71UY-GWKGd0Zo6jmKavlg":{"text":"Amazing ride! Cornell is the best bartender ever. Makes a mean jazz punch! Look for him in","useful":2,"cool":1},"VY0ZH2YOy35Rio2hD7JAoA":{"text":"Another tourist trap, and I don't care. I liked it. I liked the whole campy experience.  G","useful":2,"cool":2},"GP5cjWGPwagNM1wzcD0Rwg":{"text":"We did the 2:30pm lunch on the Natchez. The boat was pleasant, we got the $12 beverage add","useful":0,"cool":0},"ElXGYB9CZgPCoihvc1wahw":{"text":"Sunday brunch was delicious. Cheese grits, cream spinach, and gumbo were the highlights. E","useful":0,"cool":0},"WFfXLDsZFmGbGZDVACfFWw":{"text":"The Steamboat Natchez was excellent! The ride was lengthy and enjoyable and the guide was ","useful":0,"cool":0},"rUB9wOJd-bhgXoDndtMDoQ":{"text":"We took the Natchez to get a better look at New Orleans and the river; and were not disapp","useful":1,"cool":1},"G6joL9p2lAAtZc27VNJ3vQ":{"text":"I give a couple of stars because the steamboat ride itself was really nice and the jazz ba","useful":0,"cool":0},"MHNPY64FzdBqFUIXT6qW_Q":{"text":"My wife and I took the afternoon jazz cruise and really enjoyed seeing a bit if the mighty","useful":1,"cool":1},"7swwl67MIv9-dJTl8zafow":{"text":"Sunday jazz cruise without the lunch. Heard people say the lunch was good, but I'd wager t","useful":3,"cool":0},"C_5Me5-YGpWUrnB46ADW5w":{"text":"We did a dinner cruise. Unfortunately, we picked the one day of our trip with 2 waves of t","useful":0,"cool":0},"8dO8GEFaeF2WKfHuLMEd8Q":{"text":"What seemed like a tourist trap actually turned out to be one of the highlights of our tri","useful":0,"cool":0},"s2fPUdXuoIN8hFYhCaBHOg":{"text":"I thought this was a really fun experience.  The buffet dinner was good.  We had green bea","useful":0,"cool":0},"TC1OoDsyGTCdWXDCARIpQg":{"text":"#NOLAtourism #chifoodie #foodtourism We did the jazz evening cruise.  The band played two ","useful":0,"cool":0},"7HmVwehoeb-sVMZm_lT-uw":{"text":"We took the dinner cruise and I was very suprised to have a very good meal.  The chicken w","useful":0,"cool":0},"e45iRWTlSo4KRndsX4GiAg":{"text":"We had signed up for a lunch-time jazz cruise, minus the lunch.  It was relaxing being on ","useful":0,"cool":0},"E7s8Ms_2qB8xP7E7jVJiGA":{"text":"The food was cold and disgusting.  The waitress was rude. We were supposed to get a glass ","useful":0,"cool":0},"WaFzqs0UC4Wd2U7I3baM3g":{"text":"It was a nice experience, we took our two young boys, and since they could get up and walk","useful":0,"cool":0},"n3scPSMc1Aod7u7HwzPSBg":{"text":"We ended our mini vacation with this evening dinner cruise. It was a perfect ending to our","useful":1,"cool":1},"9Q3MabuZxufqEYaHLBF_RA":{"text":"Great thing to do while in New Orleans.  The food was good, the view was great, the narrat","useful":0,"cool":0},"Upv9b9TKRs8QCgHtbDh3dA":{"text":"Interested in lunch plans elsewhere but wanting to go on a steamboat, me and my parents pu","useful":3,"cool":2},"XK-zmARVZTr4xogaeLU-lA":{"text":"Took an afternoon tour on September 12th.  They take your picture as you get on, so you ca","useful":0,"cool":0},"VFJ1PK1IohhJOnHV2SquCQ":{"text":"BORING. \n\nThe food was ok  - jazz band was cool. \n\nSteamboats are lovely but this was not ","useful":0,"cool":0},"DpoGZysdCTUoeEKL2b7T8A":{"text":"The best thing about this is the jazz band. They are AMAZING and super entertaining. The b","useful":0,"cool":0},"Ad_DlWVQGXil2T1hNaP6Pg":{"text":"Loved the boat and the trip but the supper is trash. I mean come on - this is NOLA where t","useful":0,"cool":0},"pHLJSxfRVY3o4NFNkc2z8A":{"text":"We had a great time.  It is a real steam powered riverboat, and the two-hour trip was educ","useful":0,"cool":0},"_1dIXsaP6Th6tcSQHaSs6A":{"text":"We opted for the cruise portion as we only wanted to experience the steamboat on the Missi","useful":1,"cool":0},"gfe_BL1Ag0djDoMUopXLHg":{"text":"Do this every year for our anniversary.  Their food isn't as good as many of the other NOL","useful":3,"cool":0},"x2d8fxFsn4FFWYGqIpzF2A":{"text":"The food was sooooo good! The drinks are strong! The band was great! But the service from ","useful":0,"cool":0},"Sj2IRuiQpzcLSm_K9DDsaA":{"text":"My family and I went on the Steamboat Natchez tour on our first full day in New Orleans. W","useful":5,"cool":3},"ZALqV3jsuTJMUMvD0vIyqg":{"text":"I opted out of the dinner package , seems like the folks that did eat enjoyed it , I was i","useful":0,"cool":0},"Na8u8szRUYDpAYo6AtaSIg":{"text":"Ok ride, food not worth the price. Not much to see along the Mississippi but other ships a","useful":0,"cool":0},"v-26yAO9CKZPjNzWLOMKtA":{"text":"How do people like this?!?! The music is the most terrible noise I've ever heard. I think ","useful":1,"cool":0},"VchsaCAvttVk5zAynsm-oQ":{"text":"Overall experience was good well organized and on time. The experience was very informativ","useful":0,"cool":0},"psm7Cdq_JMFsk5FNjcmVxg":{"text":"The Natchez Steamboat was extremely touristy (we were tourists) but an appropriate way to ","useful":1,"cool":1},"HetMK1dGXmblaWBFZGxuhQ":{"text":"Took the Sunday brunch cruise and was pretty disappointed. As many people have already sta","useful":1,"cool":1},"g6D5Nlc9RNWaZV7-dm8lWA":{"text":"It is with great sadness and concern that report that my business partner, Brian Cain,​ an","useful":34,"cool":5},"3Wn-ovg2-LewFDe8MtEJ0A":{"text":"Great food and great staff! The bartenders were more than patient having served me and abo","useful":1,"cool":0},"PtyTvAFIlJrA9V2f_NeVHA":{"text":"Great time! One thing we didn't like was having to eat the second we got on the boat..do N","useful":0,"cool":0},"8e_6aP1CKxtFLl6OavDh6g":{"text":"Dinner, live music, while on one of the last steam driven paddle boats that exist in the w","useful":1,"cool":1},"Kwgq53al3b7LVayiw6CNmQ":{"text":"For the cost it seems cheap to go up the port and only turn around and no food or refreshm","useful":0,"cool":0},"kYLFzAv93Rak3iFYaGqL0w":{"text":"Its a great way to spend a few hours, explore a steamboat and some history of new orleans ","useful":0,"cool":0},"AplfQF2unRb-lPecxRKf4w":{"text":"Opted for the lunch cruise because it was much cheaper and the only big difference between","useful":0,"cool":0},"6UsSiXR2sJN3gPq0MHZZcA":{"text":"Steamboats are legendary as are the Dukes of Dixieland, and on the Natchez river cruises, ","useful":1,"cool":0},"4THSLCEdaG_eomR8SeUJkQ":{"text":"Amazing night!!! The jazz band was spot on. The food for great. Each side excellent. The N","useful":0,"cool":0},"-StnYvGWtyRSy48t9LRwRg":{"text":"Dragged my hubby here since I've never been on a real steamboat.  We did the evening dinne","useful":1,"cool":0},"r4dQoKPbBbdY2WAXK5KAcg":{"text":"Great little experience, although maybe a tad overpriced. But if they can command it, why ","useful":0,"cool":0},"XGhuAboQqEjLfWCaGdeKpA":{"text":"We had a fantastic time on the steamboat last night. The atmosphere was great and food was","useful":0,"cool":0},"CztD4Ob7G3-aKQtoGU_PPA":{"text":"I was in NOLA and my friend Jesse G suggested doing a this dinner cruise.... So he made th","useful":1,"cool":0},"KZpgjGzvGTRN_3j9f9lzJQ":{"text":"Great tour of the Mississippi- it can be extremely hot depending when you go and where you","useful":1,"cool":0},"ZMRVls-5vmE2RwpTtgi_4g":{"text":"My brother and sister-in-law came out to visit from California for a long weekend. We were","useful":1,"cool":0},"0c6KUzOMUQbcTa2QnBIBkg":{"text":"Since I had some free time today, I decided to take the Steamboat tour. It was reasonably ","useful":0,"cool":0},"l85ePeMB1qASHHxelB9UIA":{"text":"This is a really good break from all the craziness of downtown & Jackson Square. $60 for t","useful":0,"cool":0},"64sziptPiOxvYxO-DTdFKw":{"text":"First let me quantify that \"one star\" actually equals ZERO. While New Orleans is clearly a","useful":0,"cool":0},"i6P_yCXVY0CzTXuzzU8Avg":{"text":"My daughters and I did the jazz dinner cruise last night. The cruise itself was nice and i","useful":0,"cool":0},"oIm-ukycQrhVj9NJ2FLwag":{"text":"Boat ride was very nice and informative. Was not impressed with the food, but it was $11 s","useful":0,"cool":0},"aGtfuhQ8kGbrWQVVpeA0VA":{"text":"Overall meh, we opted not to have the buffet, the announcer was informative, and the jazz ","useful":0,"cool":0},"5tB1d5WrquPSbUEGkjig8A":{"text":"We were in the south so of course we (I) had to experience a steamboat/paddle boat. We did","useful":1,"cool":1},"hcTq_QI93QkakUzAVlwrvg":{"text":"Fun trip. Wouldn't waste time with the buffet as it is typical \"buffet\" quality (meaning p","useful":0,"cool":0},"jTSlDnGtlartcg0ZwyRL5w":{"text":"We took the Jazz lunch cruise to celebrate my birthday. The crew are friendly and the food","useful":0,"cool":0},"V8AOQNmbM9-MLJkIi44gqg":{"text":"Booked a same day morning cruise and from the beginning to end, it was wonderful! \nI had m","useful":0,"cool":0},"kPRqc1Np3HFuMR710XKpZA":{"text":"Food was good. Sights and live jazz was fantastic! Great photo ops! After dinner be sure t","useful":1,"cool":0},"R7w62VPGFYozRlAlOoKXTQ":{"text":"The 6 of us in our group bought our tickets for the Steamboat Natchez on the day of our cr","useful":3,"cool":1},"QwvKW4_MWvv9zvbZJyeGQw":{"text":"Great experience of New Orleans on a real steamboat. If you're hungry, the lunch with a li","useful":0,"cool":0},"MQBhLfvg19pHf1hWtEaacQ":{"text":"The experience is what you are paying for and not the food. I believe I read somewhere tha","useful":0,"cool":0},"sgSW3_QD_hO0hmxVNZBhYQ":{"text":"The good news is that it's fairly affordable. The bad news is the long lines and the lack ","useful":0,"cool":0},"QVPOfe10_EaTN_e_ua-sYg":{"text":"The only exciting thing about this river tour is that you are on the Mississippi River.  O","useful":0,"cool":0},"D5vCJfdeFarrmzysCwfd2w":{"text":"I really don't understand the negative reviews for the Steamboat Natchez!!! We came here a","useful":10,"cool":5},"LERTsIAzSktW5xDKaGVC8Q":{"text":"Went for the lunch Cruze and enjoyed the view from the boat the food was good (buffet). If","useful":0,"cool":0},"FnH5Dk6gSjdSdbEDUjO-Pg":{"text":"We were only in New Orleans for a few days and wanted to get the most out of it.  This is ","useful":1,"cool":2},"BRRNxX-WAEx-PqoheWWbtw":{"text":"This is a must do if your new to New Orleans and want to learn about the city and the port","useful":0,"cool":0},"Gp-CdtTop3n66r0uTggK0w":{"text":"For something billed as a Jazz Cruise, the band didn't play very much. The cruise was good","useful":0,"cool":0},"oZT0qalmsI1SflqQPf7ThQ":{"text":"I absolutely love boats and anything to do with the water but I feel like I had more fun w","useful":0,"cool":0},"i13dvQQdCx-EGhJ2zuox3Q":{"text":"Fun short trip to view port, battlefield, and city. \nCan be crowded so get in line early.","useful":0,"cool":1},"4g8jZj5LjJOukXxj74nz4g":{"text":"Food really wasn't that great --eat before the steamboat ride and go with the cheaper pric","useful":0,"cool":0},"vT2V2vOX_28Ms8grqWJVyw":{"text":"Ride on the boat was kind of boring. Nothing much to see other than an industrial port. We","useful":0,"cool":0},"ujVp54dc0GZb1wmmH1Y-DA":{"text":"Very nice and informative boat ride.  The only bad thing was that my husband and I had a t","useful":1,"cool":0},"eKJ5MFrpBrqmk42PEHrSfQ":{"text":"We only gave two stars due to experience. We went on the brunch cruise. The food was TERRI","useful":0,"cool":0},"n9i3Boeu1_KVH3Alv7NGFg":{"text":"Its a fun way to see New Orleans from an old fashioned steam paddle boat.  Right before we","useful":1,"cool":1},"9z0RJSxzwMR4lI2UxUO1_Q":{"text":"We heard Jazz lunch cruise and thought that would be a great mid day activity. Getting on ","useful":0,"cool":0},"WxvaALSKgnAQktDiv6R4gw":{"text":"Nice charter boat ride when in the area. I had to say I was expecting more of a beautiful ","useful":1,"cool":0},"FmT-SBSs-9cUMOP9v6QE9g":{"text":"Boarded and went to buffet. Food cold, tasteless and unappealing. Fortunately, we were abl","useful":0,"cool":0},"9idTV07GH6Ck9ZTNelnmfA":{"text":"Great experience, food was ok buffet style, drinks were good, Jazz band was awesome.  Only","useful":0,"cool":0},"4KQXFXJOfzeTzv4NL9n3zQ":{"text":"I road the steamboat a while back, but I remember it being really cool.  We had dinner on ","useful":0,"cool":0},"0kwZzPzyqSq6ECJhzw-Y8w":{"text":"Well I've done this boat ride since I was a kid and if your a tourist or a student or just","useful":1,"cool":0},"0GAVzfDnd3mOJtw7Y2f7qQ":{"text":"My wife and I just took the \"Jazz Lunch Cruise\".\n\nThe good:\n\nCool boat. Pretty scenery. In","useful":1,"cool":0},"aw_WZiPWnnNXh3PYoL8KtA":{"text":"I didn't have time to take the river cruise on the Steamboat Natchez last time I wad in Ne","useful":11,"cool":3},"DFWefJija7bKSSaLvNrLNw":{"text":"Keep your plan simple, like we did:\n1. Go eat lunch beforehand at one of the many great di","useful":2,"cool":0},"GpvCZ1UwYP_9Cu-LAt_CFg":{"text":"Cruise is good for the two hours you are on the river, the food though was terrible don't ","useful":0,"cool":0},"S_S02s_WmT13Wj482xl1Ig":{"text":"Pretty disappointing!  Other than some additional views of the French quarter, there reall","useful":0,"cool":0},"ILkcETdFm6mptxOsH2LXXQ":{"text":"While the ride for the Natchez was long (2 hours), there really wasn't too much to see. It","useful":0,"cool":0},"Jx1r9gVxTrMj3gBvc9ko-A":{"text":"This was a nice cruise and well worth the price ($36 including lunch, $25 without lunch). ","useful":2,"cool":1},"P4P4IhRGF_ACCCIfimjHGQ":{"text":"Enjoyed the cruise, the band was good but food is AWFUL!!! I've had better TV dinners.   D","useful":0,"cool":0},"xkSE5uOSVpFzVExFrWr67g":{"text":"What trip to NOLA would be complete without a steamboat ride down the Mississippi?  The bu","useful":0,"cool":0},"kK1dN7TsXUCW5uWWoBLSdw":{"text":"The cutest little experience so far in our trip. We were a little confused at the start be","useful":1,"cool":0},"o7FyA_Vt5FApPBGP0GYu0g":{"text":"They say service can make or break an experience. The rudeness of the woman serving food w","useful":2,"cool":0},"kI5GyBGWelrn80aB5apIAA":{"text":"In a last-minute rush, we were able to snatch the family day special at a cost of $15 for ","useful":9,"cool":5},"nhrdkA8f75AHgaJ63NrJ5Q":{"text":"Why would anyone do this? There is nothing to see on the Mississippi River!!! Unless you l","useful":1,"cool":0},"WQqc9bKqZAeEqLWdGSqfdg":{"text":"I've been to NOLA several times already, if this was my first experience I would have been","useful":0,"cool":0},"EzXWZvGuntfBGemLMKHTJA":{"text":"Honestly, this was a waste of time. Don't recommend. Information was pretty much useless.","useful":1,"cool":0},"2YZT140_0l0mZRbNtI6P9A":{"text":"Great boat ride with decent narration.\n\nThe bar on the upper deck was a set back...horribl","useful":1,"cool":0},"ZdrygGg0xqsI62X8vLzXZg":{"text":"This was my second time to New Orleans, but my first time with my wife.  My wife purchased","useful":0,"cool":0},"jG9wNi2nXNZyhNVipaeZdQ":{"text":"Natchez, lemonheads, my dad's boat.... \n\nAnyway, this was disappointing but not by the fau","useful":4,"cool":0},"1yrkxn0zinW3L7nUO3NyPg":{"text":"The tour was very informative. I did not select the food option because there where so man","useful":0,"cool":0},"KoGGwr20J8BxZSFviLCnOw":{"text":"I have never been on a steamboat except at Disneyland, so I enjoyed the ride and nice bree","useful":0,"cool":0},"PfVV3gOEMKKuMTFYe9aXxA":{"text":"This is a somewhat pricey activity but worth getting to ride down the Mississippi river in","useful":0,"cool":0},"G5zBZjtByofXIaNrOSe4xA":{"text":"Pleasantly surprised.  I've done a few of these jobbies and always felt ripped off or defl","useful":0,"cool":0},"KNEyMrakszB45cHxP1i95A":{"text":"Super touristy. Don't care. Had a BLAST!!!!\nGreat bar, freshly made drinks. Best bloody ev","useful":0,"cool":0},"WJLCWpI8X323vLTIH4zNyg":{"text":"Very nice experience. Food was decent for buffet. Fried fish was excellent. Enjoyed the en","useful":2,"cool":0},"hIR_TZgackn4lc30pCTO2g":{"text":"Historic Steamboat Paddleship Still Plies The Mississippi River!\n\nSITREP\n\nI love opportuni","useful":19,"cool":19},"lHO8ySpZEA5DOUoe_RKOHQ":{"text":"I had not been on the Natchez for a cruise since grade school and guess what? It's as fun ","useful":10,"cool":6},"RnqG0SFgDOrJhjTDKEWpIg":{"text":"The most fun part of this boat ride was getting off! In a nutshell, it was BORING! I didn'","useful":3,"cool":1},"BH6ORbQ-NJaaM_nBqWe0LA":{"text":"Rain rain rain when we went.  But it was a great way to lazily spend a few hours mid-day. ","useful":0,"cool":0},"cXjZ3wSIuAZ3MjQsIoHSsQ":{"text":"I'm probably being generous here. It sounds quite appealing to cruise the Mississippi on a","useful":0,"cool":0},"TDYKAzqTaLIws70kIZkYnw":{"text":"Fun ride w good tour guide telling us about sights along the way. Also good bar drinks & l","useful":0,"cool":0},"GMIebAXwwzNL4WtyA4LnFA":{"text":"Great, chill atmosphere. Relaxing. Great historical information followed by great jazz. Th","useful":0,"cool":0},"xfcRcxAdiVpvaDTJbaVEbg":{"text":"If you are a first- timer to NOLA, then your tourist eperience won't be complete without a","useful":0,"cool":1},"QvTlM0fn239TE1jakjbsSw":{"text":"Went on the Natchez 2nd week of Oct with my wife. Been on a few tourist river cruises of t","useful":0,"cool":0},"vDfyM7vakzHeh7FGVPmQNA":{"text":"My wife & I went on the Jazz Dinner Cruise aboard the Natchez last night.  It was a 5 star","useful":0,"cool":0},"zzTMRBiLpF1QE5eK2BOIpg":{"text":"Located at the Toulouse St. Warf, the steam boat runs daily and offers lunch buffet along ","useful":2,"cool":0},"HW_rqm3kH7pQZW4mqKzwhg":{"text":"My husband and I booked the brunch cruise. All I have to say is disgusting, nasty, and old","useful":0,"cool":0},"2V27Gkd2R-GV82Y2opWJbQ":{"text":"It was okay. Nice to be able to see parts of NOLA that I wouldn't have otherwise seen. How","useful":0,"cool":0},"ySl34rRu8_cyIZXILHZBnQ":{"text":"The boat ride is nice. The narrative was good but hard to hear. The music was good. I like","useful":0,"cool":0},"XwQmuT74RW1lG2zwkBgrCQ":{"text":"Very nice, relaxing.  Sit on the port side (look it up ye landlubber).  A great tour guide","useful":0,"cool":0},"XX8IacB6c6FgugTPE2Fp6A":{"text":"Great excursion. Excellent  buffet meal and wonderful narration. Loved hearing about the s","useful":0,"cool":0},"nHjHBQLCsKQvSktSz56j8Q":{"text":"The Steamboat Natchez is promising. In one way, it is a good way to burn an hour and a hal","useful":7,"cool":3},"kJ3JYz4wlMwTEEcA8UVOzA":{"text":"Make sure you sit on the left (New Orleans) side of the ship or the landmark narration wil","useful":0,"cool":0},"wChfDLFZrI8mNvV-wkq6_w":{"text":"The tickets, without a meal, they offer a buffet meal but I don't know what they charge fo","useful":0,"cool":0},"LnL1IMMDP0aWabjOJaYzsg":{"text":"It wasn't like a super awesome great trip but I just like listening to jazz on a steamboat","useful":5,"cool":2},"RM3DLYh7fLWnQ4ixFWxaPw":{"text":"Oddly enough, I never took the lunch or dinner cruise, but booked my wedding there having ","useful":2,"cool":2},"I5BKO82N6SnwpFSGMP3_2Q":{"text":"Steamboat Natchez offers several different options at varying price points, and I chose th","useful":6,"cool":4},"ypYqHTtFrLK3y2wHPRz2_A":{"text":"This is all right I don't recommend you buying dinner it's not necessary to have a good ti","useful":0,"cool":0},"Um6smp-LYaAbPG6U7Gi7Hg":{"text":"The tour sales person was the rudest person I encountered in my week in New Orleans. Needl","useful":1,"cool":0},"s4ABihhnc98nSBW9wiD6tQ":{"text":"I took my wife on a lunch cruise.food was good.engine room was open.a very relaxing trip. ","useful":0,"cool":0},"2E0mfZIUJ0Q-0GZuSfS5SA":{"text":"I have been on the steamboat for both the day time tour and the dinner and jazz cruse. The","useful":1,"cool":0},"BRnmtDFlUDPAksKr-9BpIQ":{"text":"Lovely experience! Staff was very friendly, food was tasty, the boat was clean, and the to","useful":0,"cool":0},"akvJA8Tzzr4uMfk2AD51pw":{"text":"We decided to get last minute tickets because it started to rain and we figured we could w","useful":1,"cool":0},"FdrEkpfCwgOPSRjFsxK75g":{"text":"When you board grab a table and chairs on the port side of boat (left).  This is the side ","useful":3,"cool":1},"AuELfisxQd2WDarO4I3qzw":{"text":"It's a cool tour to learn some interesting facts about the area and the Mississippi River ","useful":0,"cool":0},"TmN3wLKQnLzB-2fIpK8ImQ":{"text":"Very touristy and the price reflects it. The food was ok with a very limited menu. The on ","useful":0,"cool":0},"Bk-BvRaRTLjZ9JXHopryiQ":{"text":"Ok so you cannot go to New Orleans and not ride the Natchez...its like a right of passage ","useful":0,"cool":0},"xCoT_ZXM5RZK97DrKKvLgA":{"text":"Went on this afternoon cruise for a friends wedding in November 2015. The boat was comfort","useful":0,"cool":0},"LhZWsGa6WXe1q0u-8d25ZQ":{"text":"I'm glad we did the steamboat ride. The information was interesting and you can see the en","useful":0,"cool":0},"-Jj-fPbjOrNcENqEfnGDww":{"text":"What a beautifully restored and amazingly run boat! \nThe food is good, the drinks are okay","useful":0,"cool":0},"yFLQkob9zHmieIoq8NPYKw":{"text":"We loved the dinner cruise. The Jazz Band, The Dukes of Dixieland, were superb. They playe","useful":0,"cool":0},"q-6BIk0rYo-dJ6TkXdG1uw":{"text":"You definitely need to take the nighttime jazz cruise. The music itself was great, but the","useful":0,"cool":0},"F9MBvdUWVT17cV6hF1sb-Q":{"text":"Lovely boat and trip. Its a solid 2 hours, but i wish it went down the river a bit more. F","useful":4,"cool":3},"g5afgVjc47ApItjregRviQ":{"text":"Terrible waste of lots of money.\nOnly good part was some interesting history on NOLA/river","useful":0,"cool":0},"6xcX1rL8MQT0FkYLtwIJ7w":{"text":"the boat ride was relaxing and even on a hot day, the moments of cool breeze was welcoming","useful":1,"cool":0},"Jr75KadHe99gcQpdf2hrCA":{"text":"I was on this boat for a wedding and it was a great place to get married.  A must see when","useful":0,"cool":0},"JpT-o06BAvF4Tcc1dAUYiQ":{"text":"If you are looking for a different view of the Big Easy hop on the Steamboat Natchez! This","useful":0,"cool":0},"lCK7Ru8Rl1cPkkyvzdAnGQ":{"text":"Great experience!  Definitely a must for anyone visiting New Orleans!  My wife and I went ","useful":0,"cool":0},"d4wFhmhNGOfy5UpHbggPuA":{"text":"Our feet needed a break so how about a ride down the Mississippi!!\n\nA real steam boat.  Co","useful":0,"cool":0},"IpEdEAX--x8xHYknkKCTdg":{"text":"Peaceful cruise down the mighty Mississippi\n\nOur group recently was in New Orleans and had","useful":0,"cool":0},"OrlCt-j8PqfirYXysZC8ow":{"text":"Great cruise! You get a good history of the Mississippi river. I recommend the bottom deck","useful":1,"cool":0},"Uf0qV9gSC3muesakaamynA":{"text":"The dinner - jazz cruise was a nice simple evening. The atmosphere on the riverboat was ve","useful":1,"cool":1},"ic5rRNcV2jf_TMcWguqXYQ":{"text":"We had a special VIP tour. We were greeted at the dock and brought to our seats before eve","useful":1,"cool":0},"J--rM0fRGXXSUXWIZtR8wQ":{"text":"Great experiance. Two hour tour for about 30 dollars. However Google coupon codes, easily ","useful":2,"cool":0},"k6vVnFl_p4tKqsLu8cfwXQ":{"text":"A touristy New Orleans adventure.  I wouldn't put it up there with the Must Do's of the ci","useful":1,"cool":0},"9NAWsLBoq04ORQEo8Igsdg":{"text":"This trip while in New Orleans was one of my wife's favorites her comments to others is sh","useful":0,"cool":0},"TBPzoCPAsVbAeD4BWNrFrw":{"text":"Cruise is nice but food is cafeteria like. If u r good with that go for it otherwise just ","useful":0,"cool":0},"a0nw54K4Y_DvHkYyYC4UVQ":{"text":"We went on the Sunday evening dinner cruise, first seating.  The food was good with a sele","useful":0,"cool":0},"Ol9ebFaGUDltsWSdiRTxLQ":{"text":"If you are doing the dinner thing, opt for the 6pm seating. Dinner is buffet and very good","useful":0,"cool":0},"2ni998_J84sw--pWIllwwg":{"text":"Meh. My husband and I were sucked into this on our honeymoon. We went on the jazz lunch to","useful":0,"cool":0},"7B8e90bDr_qwUcDJYFhIAA":{"text":"I really enjoyed the Sunday Brunch. Come early cuz boarding time was 11am and buffet was s","useful":0,"cool":0},"CnxX5BB_tDh3sKqrCLFWYQ":{"text":"Came here on my birthday and it looked very promising. The problems were that it was very ","useful":1,"cool":0},"U5YL6qZUDlgjWlHF8cyFcw":{"text":"Food was excellent! Bread Pudding didn't look so appetizing but I tried it and it was deli","useful":2,"cool":1},"IaN8cuyykWZfZW1k0_yBzg":{"text":"My husband and I were seeking out some touristy things to do while on a long weekend trip ","useful":4,"cool":2},"3M_TxqLHqaZ5yzt0uK3Egg":{"text":"Nice steamboat ride. I didn't opt for the food part the menu as it didn't look too enticin","useful":0,"cool":0},"Ay3gxca-xyZUb6nCo__5PQ":{"text":"You have to book a cruise on this boat. The staff was great, the food was decent. Sit on t","useful":0,"cool":0},"34z-NJM7el4cQXiI8KGpmg":{"text":"The boat and atmosphere were lovely. I would skip the dinner. The food isn't that good and","useful":0,"cool":0},"3FtcdmcLdwlQ_YJElcj9hA":{"text":"We loved this experience! The staff was friendly and welcoming. The ride was nice. The fir","useful":1,"cool":0},"5MMxHwYY9aJm-JV8rZDppg":{"text":"Good place for a laid back lunch and cruising down the Mississippi River. If you buy ticke","useful":0,"cool":0},"USLxld-LV801pyrz89Izaw":{"text":"This was probably one of the most relaxing enjoyable boat tours. Gina defines the best sou","useful":0,"cool":0},"ObfwMirQHlN_NUW07GSmGw":{"text":"Cruise is good for the two hours. Cool way to relax and take a reprieve from stomping arou","useful":2,"cool":1},"Qa6ORmwx8KcJA3jWQrrJXA":{"text":"Absolute mess! Huge line to board. 20 minutes in the line, ready to board only to find out","useful":0,"cool":0},"JEWSMZxCp2UoDeEPHRU_Jw":{"text":"THIS IS A HUGE TOURIST TRAP! NOT WORTH IT! \n\nI went with my family and it was cool for the","useful":2,"cool":0},"GWlp80IWxu9E2dl7AiFc9Q":{"text":"This tour should be on everyones list of to do's if you are visiting NOLA. Informative, re","useful":0,"cool":0},"qRvChsWEpTFUfOWx2HEVyw":{"text":"I saw some mixed reviews for this. My wife and I did the dinner cruise with the 7 pm dinne","useful":0,"cool":0},"B9QU_Ky9j5PUQiliD5NOFQ":{"text":"Unfortunately, this was really lame when it came to the food, the service and the product.","useful":0,"cool":0},"Z_tU9dCQjhUZOEg1yI2C9w":{"text":"We did the night jazz cruise and loved the entire thing! We didn't do the dinner just the ","useful":0,"cool":0},"4wM02Rb173ajzppSjcfVsg":{"text":"On the morning of the 9th of December we had the opportunity to sail away on the Steamboat","useful":0,"cool":0},"l_lqAXQ92MYDXqFQ_Mmf0g":{"text":"Tourist trap!!! Boarding took over an hour, so we hadn't 5 min. left to eat (yes, you have","useful":0,"cool":0},"3nJec_aDh8nDcoWzhdoX1w":{"text":"Not worth the price, in my opinion.  The weather was pretty bad and I think that made the ","useful":1,"cool":0},"sZGhK0lGaeeKwRp0_lEwDg":{"text":"Great service and history along the trip. You can take in your own water and snacks if you","useful":1,"cool":0},"wq04A4wFssDG_KGIOj7DrA":{"text":"I have never been on a steamboat before, and it was both my and my girlfriend's first time","useful":1,"cool":1},"kohjY4D8uuSbkia21iQTsw":{"text":"I have never been on a steamboat, I was in town for 6 nights for I figured why not! Plenty","useful":1,"cool":0},"oV5mxwgrY8qQ8vQGFO0MdA":{"text":"Wife& I took night cruise and really enjoyed the atmosphere!  Not crowded, great music, be","useful":0,"cool":0},"JHZw2jASznFqiJ4Y0-DtPw":{"text":"Really? I've read the other reviews and I can't believe that anybody rated this trip highl","useful":1,"cool":0},"VnBvUCsJZhPBMfy_T-BNqA":{"text":"Fun, touristy activity. We visited the site of the Battle of New Orleans. Probably not goo","useful":0,"cool":0},"hKVrIaeeicW2xIfeLlSuEg":{"text":"We really enjoyed our ride on the Natchez.  Great history narration and, if you ventured t","useful":1,"cool":0},"y82T-MxDEzfsF4eRT1mfJA":{"text":"A rainy, cloudy day in New Orleans but we still took our tour. The view was a bit cloudy b","useful":0,"cool":0},"dQsJJ9zdrUuicTy4i-rr2A":{"text":"I fell in love with the French Quarter nearly a quarter of a century ago, and one thing I ","useful":2,"cool":2},"HGfQw_4rvodFdmaVDwsbqA":{"text":"The best part about the Steamboat Natchez is seeing the Steamboat itself since you are abl","useful":1,"cool":0},"fSOGU_ujCYXrHeZoph4Obg":{"text":"I know it may be cheesy to like this, but I did. We went on the tour with family and it wa","useful":1,"cool":0},"-JBLk9YGRVHyqxbNR_MiDw":{"text":"It was ok, food ok, good drinks upstairs, music was ok. In the end nothing really impresse","useful":0,"cool":0},"fL0NjS-i1RG_LZvQtCM3Dw":{"text":"What a great way to spend an afternoon. The drinks were cold the food is what you would ex","useful":0,"cool":0},"UxsvrJmM1k_sHT_7enfmPg":{"text":"Best bloody mary of my life! That may be an unexpected feature on a rather touristy boat t","useful":1,"cool":1},"6kBXRJjDvLZoedFOA1zKGA":{"text":"My sister and I did the Jazz Brunch Cruise on a Sunday. We made reservations and noted tha","useful":4,"cool":1},"p77f48TY2sGGoNzqesrMGg":{"text":"Steamboat Natchez was a delightful experience.  We went for the lunch departure (11 am).  ","useful":2,"cool":0},"NHf3PVHAIQWJTYBmIi4hQA":{"text":"The Natchez provides a great tour of the Mississippi River in a steam powered paddleboat. ","useful":1,"cool":0},"klXK6-_-SSJEMNtiOA12Cw":{"text":"We went on the Steamboat Natchez tour. Tickets were pretty expensive for roughly a two hou","useful":4,"cool":2},"OWTlg1HCFdNX3TLqAnGoOQ":{"text":"I was really excited about the brunch cruise but unfortunately it didn't live up to expect","useful":5,"cool":0},"Op2Xq_7BgHc-oPoov4sYrw":{"text":"Went on the Jazz dinner cruise. The music was great, but the food was not good as we were ","useful":0,"cool":0},"_uDWvs49y854hIruTTa3qA":{"text":"I highly suggest that the Natchez please post signage and notifications on their website a","useful":2,"cool":2},"u9bU6kRP_6BbU7uK6kQN6A":{"text":"We had a business group recently take the dinner jazz tour.  Everything went well although","useful":1,"cool":0},"augotYkLy2n3Mrrd1FQCQA":{"text":"Must go on this steamboat if you are visiting New Orleans, the food is buffet style and it","useful":0,"cool":0},"CpshdF3SlNpeZWSSBRKsMg":{"text":"New York has the Circle Line and New Orleans has the Steamer Natchez. Looking for a divers","useful":1,"cool":1},"h03Nz04gR0oWug5eJk_8LQ":{"text":"We boarded the Natchez and started dinner before the boat left the dock.  Dinner was prepa","useful":0,"cool":0},"P6VJHB-7HLeIP3eTQlhIiw":{"text":"This was the best conference banquet I've attended.  The food was ok, which is far more th","useful":0,"cool":0},"gFqG9saWdyCDXNN-pQIRNw":{"text":"Get a bloody Mary! I like that it's a real steamboat but it's expensive for what it is. Th","useful":0,"cool":0},"0CNGtEPalsu0b-etefbuKg":{"text":"Did the jazz brunch tour and it was pretty nice. Cruise gets a little long at two hours an","useful":0,"cool":0},"ztrKWQyvgOlIGxlrHaiTSA":{"text":"Relaxing cruise on the river in a Steamboat (rare to find).  Historic narration by pleasan","useful":0,"cool":0},"U0nVAnQ6pERJWKDHbobZfw":{"text":"My family took the dinner jazz cruise and had a fantastic time. We loved the friendly staf","useful":2,"cool":2},"Z4vnxiTkkI1TdBlVyX1YuA":{"text":"***Buyer BEWARE *** DON'T WASTE YOUR MONEY!!! I don't usually rate things, but this cruise","useful":0,"cool":0},"KpX-s7baB-djcjnKY55nFQ":{"text":"My very first time on a steamboat. \nI was a bit disappointed to say the least. \nI expected","useful":3,"cool":0},"o1LBP-tydBrwGhXiD-hU4g":{"text":"I did the two hour boat trip in the afternoon. While seeing the river area  was cool the g","useful":2,"cool":0},"5kCcigclmjMGYznNsFHfag":{"text":"This was one of my favorite activities we did in New Orleans proper. True, it doesn't do m","useful":2,"cool":2},"PvPQnApXKirKUVGlNmWDiw":{"text":"We took the lunch cruise again for our anniversary in June, and had a great time!  Just a ","useful":1,"cool":1},"mbqVtH3-BcWPIoGXBYdTpA":{"text":"Participated on the steamboat ride thinking it was something grand other than a tour on th","useful":3,"cool":0},"SNLmAVFasFHgTo9RY0NdSg":{"text":"Two weeks ago we held our wedding on the Steamboat Natchez in New Orleans. It was the seco","useful":0,"cool":0},"yIipWa64KhJ6klvBLd6ZfA":{"text":"We have our annual Christmas party on the boat.  It's always so much fun.  The staff is al","useful":1,"cool":1},"nZ_HgIEq-XKX1V5vMbXM7Q":{"text":"This was a fantastic ride down the Mississippi! My wife and I had a great time riding down","useful":2,"cool":3},"89y1_-C5hOK6bROaEYnFbg":{"text":"For historical significance alone it gets 4 stars along with being one of the best ways to","useful":9,"cool":4},"-qLSOBNg3Kdos7ksUpSCmA":{"text":"A tourist trap, but a necessary one and expensive.  We opted to add on the buffet lunch an","useful":0,"cool":0},"rAAnKp9buvPbkhoeXbCAEA":{"text":"A lot more fun than I expected it to be! My boyfriend and I decided to take the dinner cru","useful":2,"cool":1},"aTqFpDNzwucYGbjYps47uQ":{"text":"What's a trip to NOLA without a steamboat ride! A good tour and great price! Definitely do","useful":0,"cool":0},"_hvpjOmav7H7Y4mfllSq9g":{"text":"The food was okay (greens mixed with spinach and bread is many what I enjoyed), because th","useful":0,"cool":0},"9qTSC-705PxrnT4NJMgneQ":{"text":"Touristy, but worth it! It was fun and relaxing to ride down and back up the river, see th","useful":0,"cool":0},"4VyhV4ICebAiIawNpbKCDA":{"text":"We had a great time on the steamboat Natchez. The Fried fish was excellent,  along with th","useful":1,"cool":0},"UZdPITuYm0wnkX6t8HMdQA":{"text":"Really enjoyed the cruise and all the information that was narrated.  All the staff were h","useful":0,"cool":1},"QDlEGMQ3TGLXdygIL6lj6Q":{"text":"I chose the Steamboat Natchez for my wedding reception. I did not rent out a room on the b","useful":0,"cool":0},"cEJTiTHtnm3Sgrj6w738pA":{"text":"We went on the lunch cruise and weren't expecting much in the way of food.  These types of","useful":0,"cool":0},"joKBbufoThuLhyONCxwFbw":{"text":"I have heard mixed reviews about this tour but we wanted to try it out. The one thing that","useful":4,"cool":2},"5Hz4MXC7Z16YePS6-wYJpQ":{"text":"I do not get the hype. We actually VIP. We were met by an attendant and sat at a reserved ","useful":2,"cool":0},"B2rVc61hqF0OGN-Y_eBjPg":{"text":"The boat ride was not unpleasant (aside from how infernally hot it was), but I found it a ","useful":1,"cool":1},"ynrFbMT8XU0o6wNmAeMpkg":{"text":"The two stars is for the narrator.  I had a very hard time understanding him and I finally","useful":1,"cool":0},"5X-nifnz3MjQbfb_yCEhCA":{"text":"Steamboat Natchez is your opportunity to travel the mighty Mississippi on the last authent","useful":9,"cool":6},"uh7bH_knJ7pouPzsdrLpPA":{"text":"Nice different way to see the city. Great views and narrated half way. Very windy though o","useful":0,"cool":0},"_1bZqnVJfNuSDHDwh-g-Nw":{"text":"If you heart is set on a boat ride on the Mississippi I am not aware of anything else.  Th","useful":1,"cool":0},"jkLIHk4GTnKPJQlHpBEB4w":{"text":"Nice relaxing cruise, get there early to get a good seat. Take plenty of sunscreen, lunch ","useful":0,"cool":1},"a5wwse5EqsAL5VEejETfyg":{"text":"Fun time.  If you take the dinner cruise you can either eat dinner early in the cruise or ","useful":0,"cool":0},"B9KI6zZhsYZAXNQmYg89wA":{"text":"Mauvaise expérience. \nPourtant il faisait beau. Pourtant nous étions en bonne compagnie.\nM","useful":2,"cool":1},"UroRJHBlHUNTVJ-OAmqCVA":{"text":"Ok, it is really touristy thing to do, but what the heck, it is fun and if the weather is ","useful":0,"cool":1},"SavuAhoIoe1FptZOytysCg":{"text":"Use dining room bar. Less people = faster service\nGo to the engine room for warmth on a co","useful":0,"cool":0},"C-wV4Xq8ujmlzAXxGkPhKA":{"text":"Don't book this for the food. It's cafeteria food at its worst. Napkins smell like old gre","useful":0,"cool":0},"CuOMxqcDygOg7P2biZsIGQ":{"text":"It's one of those things you do only once and never again. We did the 11am cruise with lun","useful":3,"cool":0},"DQPR4zJBM-6JTvExRF-z2g":{"text":"Had a surprisingly good time riding down the Mississippi on the Steamboat Natchez. Good be","useful":0,"cool":0},"sw34hiMLkgfPK8hNuilEYQ":{"text":"It was a nice day however the jazz band did not play very long. Also at our dinner the wai","useful":0,"cool":0},"_JLwDfHgaFetvFSVoaHu7g":{"text":"We had a great time! It goes without saying that this is a tourist-trap but it also was on","useful":4,"cool":2},"dZSGjzHAfBz1KyK7smE6xg":{"text":"Did the Christmas Eve dinner cruise. Hard to find worse food in NOLA.  Service was very su","useful":2,"cool":0},"lYWulBYRvtwc6pjTHhvQ7A":{"text":"My friends and I bought tickets off of Groupon. It was affordable and not far from where w","useful":5,"cool":1},"LJljDkMpxGGqqVQQucIWDQ":{"text":"Adorable boat ride on the Mississippi River at night. All embark at 6pm, boat leaves at 7p","useful":1,"cool":0},"ypNwheGvuqpR05SzO1Sonw":{"text":"The cruise was very nice and the lunch was excellent, well worth the two hour boat ride.  ","useful":0,"cool":0},"FQv9DmuYpzIkLUCIkdF44g":{"text":"Might have been my favorite part of New Orleans. Maybe that's because I can remember most ","useful":5,"cool":3},"egCJJtNFy-0imYnO7qN__A":{"text":"4/5 great experience\n\nfirst, come early to board and enjoy the steampipe organs on top of ","useful":4,"cool":5},"rOJFaJHzreZhWazDnyjSOg":{"text":"A group of 6 went on this steamboat and had lunch. \n\nThe staff was friendly. \n\nRiding the ","useful":0,"cool":0},"NlzmVi55VUO-QB8QhANPlw":{"text":"Highlight of our trip.\nThe evening cruise was amazing and everything you want from a small","useful":0,"cool":0},"XhXqtI0lKvZOdW2330lZNA":{"text":"The experience and history was unique but the food for brunch was really bad. I think the ","useful":0,"cool":0},"rIAXBn4GFeeU-z89C_1Cqg":{"text":"We thoroughly enjoyed our river tour on the Natchez. It was well worth the price and we di","useful":0,"cool":0},"b_Kg3IM8hYaU5gO0p34yzw":{"text":"We did family day which was nice *after* we got on the boat. \n\nWhat really sucked is they ","useful":3,"cool":0},"Ir1ZA9hOinwc885llWQpKw":{"text":"Atmosphere / Location - It's the Mississippi on a steamboat.  What an awesome trip....  Re","useful":0,"cool":0},"8PsYDKLQu98g9IbXg3fIWg":{"text":"We decided last minute to do the cruise. After a long weekend of partying and being on our","useful":1,"cool":0},"lZIJfc_OukZ6YH1beGHNGQ":{"text":"Went there on a Tuesday for the dinner cruise. It was a beautiful night and my girlfriend ","useful":2,"cool":1},"nhu6IqhNhD0gOjN9ZwANkw":{"text":"I kept calling this Steamboat Nachos because Natchez is far too difficult for me to rememb","useful":0,"cool":0},"heiC-KzLeHQ4T9_h1m13KA":{"text":"Disclaimer: we were not expecting a gourmet meal and a world class jazz band for the price","useful":2,"cool":0},"xCc85eFFuv0BkDi3JSZunQ":{"text":"We decided to do this tour on our recent trip to NOLA and we were glad we did. I did not b","useful":3,"cool":1},"yK-W-2Un5JMRQKHSJqhJYQ":{"text":"The worst steamboat tour we never made. Nothing to see but industrial factories. \nMy dream","useful":1,"cool":0},"ZgKn4Ge1WkOPzx19XyL4KA":{"text":"A nice touristy thing to do to kill time before you hit Bourbon street ;) It was Christmas","useful":2,"cool":1},"h41R0qwQp9zr3SImOMJFDw":{"text":"Was an excellent experience! We booked the VIP tour with open bar. Was more at $340 total ","useful":0,"cool":0},"AeRbdGz3Tt3ehXcvtHH0iA":{"text":"Awesome time. We reserved a table for the easter brunch and I'm glad we did. We were waite","useful":1,"cool":0},"z1QNyOGnSEUenq1sOgDjxg":{"text":"I went on the dinner jazz cruise on 8/2. Even though my family bought online tickets, prio","useful":1,"cool":0},"B79F8z6iyeYemCU_RRbjOw":{"text":"Beautiful day for a local cruise with the kids. Living here in NOLA, we don't take advanta","useful":0,"cool":0},"gZkmW3lE8PsY9wNffS5-Dw":{"text":"Always fun.  This is definitely a tourist attraction however, it is also the last steam po","useful":0,"cool":0},"i_uXymezWLof-6YUW_hY6A":{"text":"Had to try out this NoLa tourist attraction!\nWe opted for the dinner cruise minus the dinn","useful":0,"cool":0},"bOV7cqXUA9Sy44v2SwlFtw":{"text":"We took the Jazz Brunch cruise, which is well worth the extra few bucks than just the crui","useful":0,"cool":0},"zQg8l7sqN39wVuT6AD78kw":{"text":"Relax, enjoy the music, the food, the breeze. Customer service was perfect. The food was a","useful":0,"cool":0},"eD2kH4ubP9xoWRGDkEESzw":{"text":"I cannot thank Melissa and Gina enough for making our Steamboat experience so special. My ","useful":1,"cool":1},"On-LZ3aO-hWQJf_VxVLZMg":{"text":"The boat is huge (probably 1000+ people). Takes forever to board. We are on the cruise as ","useful":0,"cool":0},"91rfQG9XuzI-cK1noLyonQ":{"text":"Very enjoyable, relaxing cruise on the Mississippi River on the ONLY actual steam-powered ","useful":0,"cool":0},"AlbPdIHtkRdZwvLSbUlDHg":{"text":"Must do activity for all tourists. Everyone was really nice and best part is you can bring","useful":0,"cool":0},"2iOD0Eb-zJuI5MXMakc3yg":{"text":"The cruise was great! There was a tour guide/commentator who told us what we were seeing a","useful":0,"cool":0},"eSsY0VOXkqoGhj4g5l5Qog":{"text":"We did the lunch cruise and found the food very good given the amount of people they had t","useful":0,"cool":0},"cvINI8VDxuSZxVODiWhU4w":{"text":"The people working are very nice but the entire experience for the money..... not worth it","useful":1,"cool":0},"RU2YGgdC9Bcx6dYh7hoxQg":{"text":"The boat ride was great, not authentic New Orleans cuisine, however the food was decent. I","useful":1,"cool":0},"rujmDtZVC7XR4X1wm9dXDw":{"text":"We did the Sunday brunch... it was highly hyped up when we were booking our tickets so may","useful":1,"cool":1},"wR-5VZyhS450iuYSumRPoQ":{"text":"I went on the morning cruise with the lunch buffet and I had a reallly great time. I reall","useful":0,"cool":0},"Cp5tDLmxhOEx6cvmzTbd1g":{"text":"Save your money. Save your time. It rained on our scheduled trip so that's not their fault","useful":0,"cool":0},"sk7w2K1W7UBaGgf-aV4Heg":{"text":"The entry was horrible... We bought our tickets at the hotel and apparently if you buy any","useful":2,"cool":0},"fz8hMNPdSnMITP9Numuu6w":{"text":"I did the lunch cruise many years ago and had enjoyed it. I decided to take my husband to ","useful":0,"cool":0},"TbwH3_0JdRPe5W-uyzz5Fg":{"text":"I did this cruise for the second time this weekend and it was just as good. We did the Sun","useful":0,"cool":0},"feukASVtrcELHNgyGS9SlQ":{"text":"This is not worth the thirty dollars they charge, unless you like to spend thirty dollars ","useful":0,"cool":0},"C8nv2aHw4WZkD29GRLAguQ":{"text":"Get me out of here!!! \nThe food was awful, we where told by Roy(manager) to get up and sto","useful":3,"cool":0},"56w4zX45HcnERfEYJ1-MJg":{"text":"We went on the lunch jazz cruise. It was a very nice relaxing trip (2hrs)! The scenery isn","useful":0,"cool":0},"TFgW6UOB519IJFHk1jKjiw":{"text":"We did the dinner jazz cruise. The boat is so smooth running that we didn't even know we h","useful":0,"cool":0},"h-1vjU0-jDTSR0B_Yr5DsQ":{"text":"What a GREAT way to wile away a couple of hours in the BIG EASY. It was like a floating hi","useful":0,"cool":0},"Cgmd5TV4_fWcmmRK1Bluag":{"text":"This was such a fun and relaxing thing to do! I loved  it and i will definitely do it agai","useful":0,"cool":0},"dJ70o8DchgKMNXmIeCR_HA":{"text":"Great experience once we boarded, BUT...\n\nThe woman who sold us the tickets was completely","useful":1,"cool":0},"PcvCZFo2f-qeWzXFXg8auQ":{"text":"I wanted to get my money back for the salty food. They gave me free drinks. I almost had t","useful":0,"cool":0},"dfTvCzNY73h6u9KJunDhRA":{"text":"River boat ride was fine.  Worst food ever.  Do not pay the extra 40$ for the dinner.  Jaz","useful":1,"cool":0},"rxZA5z_C0XXZdX87ZnUfgw":{"text":"I went on this boat for the dinner cruise. It was NOT worth the money at all. The food opt","useful":0,"cool":0},"ZXym-m1tmHVQe7dUOBICow":{"text":"Nice cruise, narration was informative, and the band played really good jazz. A very nice ","useful":0,"cool":0},"oo1Mt9wkBOkUfaisaJPU7w":{"text":"I can't speak for the food as I only went for the cruise, but I had a great time. The New ","useful":1,"cool":0},"YEla38L3B8gi4Vy9FASSLw":{"text":"We went on the early afternoon tour and requested the 2nd seating of lunch. While we were ","useful":0,"cool":0},"uw3S0QCPDbbW7cXiYm2Cfg":{"text":"Overpriced- do NOT get the food, but go to enjoy a relaxing sit and hear the music on the ","useful":1,"cool":0},"1gRFxlf1XBT_hsaa-hSpFQ":{"text":"This is a horrible, over salted BUFFET... The only good thing about this steamboat is the ","useful":0,"cool":0},"Sr6h-bN4ytsqifMU9nMsCQ":{"text":"Worst ship tour ever! Nothing to see but waiting container ships. Totally overpriced and t","useful":0,"cool":1},"NL2ZFct7doQUeGpRL45TEA":{"text":"White chocolate bread pudding is so good.. never thought I'd say that being that I'm not a","useful":0,"cool":0},"gBMZ6EYwNfp76C6v8__fWA":{"text":"This is a nice cruise to take and a good value for the low cost. The cruise was only $44 i","useful":0,"cool":0},"0PJHRbJT-Y90iqszf-azOg":{"text":"I went on the Steamboat Natchez for a Valentine's Day cruise a few years back. Although I ","useful":3,"cool":0},"I6fs70Jb-bCehzz1pB2X2Q":{"text":"we took the 11:30 2hr jazz  steam boat cruise on the mississippi.  parking in the lot was ","useful":5,"cool":1},"A_I3cXoWOVZWDkwajP0VXQ":{"text":"My experience was ruined by a handful of issues. (1) completely out of the companies contr","useful":1,"cool":0},"Y7ZcSZP5995v53tCQU_RQg":{"text":"We chose this day trip because it was highly recommended by someone at our hotel. We opted","useful":0,"cool":0},"OiEMG7BYtcZZ-dfDy8_JYg":{"text":"Very cool. 1 of 2 steamboat in the USA. It moves faster than I thought. Good views of NOLA","useful":0,"cool":0},"JHUkkzCB49ZW1ZfS48S5XQ":{"text":"Had a great time. Very informative tour, fun history.\nEverything was fantastic.","useful":0,"cool":0},"dg3mMKWgKwFWSO--JIs6SA":{"text":"Gina was an amazing host. Crew was friendly and helpful. You definitely get your money's w","useful":0,"cool":1},"vEof2hqBLQf4qNnKyA7MzA":{"text":"Very nice experience, but overpriced for the food that's offered. I thought the food would","useful":0,"cool":0},"SF7HDqFwiEd6ovLaBwPTSQ":{"text":"We just got married here last Sunday and I've never had so much fun in my life!  Since we ","useful":0,"cool":0},"PG4x2R5kX6MirmfPS8fjIA":{"text":"I took my husband on the Steamboat Natchez for his birthday. It was amazing. The atmospher","useful":0,"cool":0},"GiQJz-cPIxLZIvApBAurFg":{"text":"Went on brunch cruise today. Had a good time. Food was really good. Surprisingly good whic","useful":0,"cool":0},"SoB9kXaGgqfkZnE3Lr3DIw":{"text":"I would give the cruise itself and the bar 5 stars. However,  the dinner portion of the cr","useful":3,"cool":1},"g3L8t7WgZpsU7Bw-NyEroQ":{"text":"Here we received true Southern Hospitality from the staff and especially Gina who went out","useful":1,"cool":0},"E-0JZzaFBfUrr2jqChQRSw":{"text":"Definitely a wonderful experience!! The sunset cruise was fantastic, we would go back for ","useful":0,"cool":0},"qn9owkuWD6a2del3iOB15g":{"text":"We really enjoyed our day cruise on this boat. It was I believe $30 a person with the unli","useful":1,"cool":0},"mjlqLbvcKJtt1bAPmuvHDQ":{"text":"I really had a good time. Food smells really good but was not impressed with how it looked","useful":0,"cool":0},"Y8r0-n2FN1segEVKtwmfjw":{"text":"We did the jazz/dinner cruise with 6PM seating. I really wanted to love this cruise, but u","useful":4,"cool":0},"TeSqbLpbEVNl5WFtTNbURw":{"text":"I went for the buffet brunch - for a special event - and really enjoyed the food and the 9","useful":2,"cool":1},"w1oSPDh4Odb0mjuD7pZ99w":{"text":"I have been here before and had a great time, but my review gets 4 instead of 5 stars beca","useful":0,"cool":0},"M057VTlDINm-nyh5i0MViQ":{"text":"Do this if you get the chance!  It's a nice relaxing cruise up and down the muddy Mississi","useful":0,"cool":0},"HeEWAdl4BbOINHt_yA_fkw":{"text":"So this was my first trip to New Orleans and I decided to try this Cruise. I'm from Philad","useful":0,"cool":0},"j2dO3tIPQSUpprUAD1fL1w":{"text":"This is informative and might be more fun if you have never been on a ferry or tour boat. ","useful":0,"cool":0},"2fdtAuo6_owO0bn8AeEWYQ":{"text":"Fun times on the mighty Mississippi! DRESSED like a pirate for the pirate cruise....\n\nLove","useful":0,"cool":0},"u3j16rwB8hG1b06pAtN_ww":{"text":"If you're on this page you probably already know the basics of what to expect; a nostalgic","useful":2,"cool":0},"6cvazCWe2bLnMLBmN7K1yA":{"text":"This was a big disappointment!   The food was just okay and there was very little jazz mus","useful":1,"cool":0},"a9COr7TwXb3zdjRzorJ2AQ":{"text":"When we were in New Orleans we took this river boat cruise. It was so fun! We sat in an ai","useful":2,"cool":1},"S_CNBONNynZRIE3fOEFTQQ":{"text":"Terrible experience. The captain only makes reference to their internal grosery store, the","useful":0,"cool":0},"IxWRLgCvb0psWSHTzuRw-w":{"text":"This was a wonderful time. I was so excited to get on a steamboat.  It was informative. Th","useful":0,"cool":0},"qOvwhcMNuc_ottiHIw2cXQ":{"text":"Wanna know what's interesting about the Mississippi river?! NOTHING. The water is puke bro","useful":1,"cool":1},"rFnyVAeqQT3AE3cSp2FL7g":{"text":"I purchased tickets on groupon 3 months before our trip. I noticed that it was only for th","useful":0,"cool":0},"T-pDjw6Zz5_jw1xyn9z9bw":{"text":"Kitschy and touristy, but cute. I was attending a private party on this trip. They had peo","useful":0,"cool":0},"9aEJc_qq81LNc9sFEe2kqQ":{"text":"Do not buy online or from a concierge for this boat.  We have now been in s line 30 minute","useful":0,"cool":0},"H7l6mmJiXBUhhJKUljY3cg":{"text":"I thought it would be nice to take a cruise around the city to see the sites from the wate","useful":1,"cool":2},"NCMvEZI3hDp4HjrvC10s3g":{"text":"It sucks! The captain never shutsup.the food is horrible and the staff is not welcoming an","useful":0,"cool":0},"cGwMWDibll8WVWk1ll9PtQ":{"text":"Enjoyed a nice afternoon with my family out on the Mississippi River. \nThis tour was aweso","useful":1,"cool":0},"p9EY2o9OxTocTEMO0kiwmw":{"text":"Well what can I say? The steamboat Natches was definitely a wonderful experience. Nothing ","useful":1,"cool":1},"ZOq6aPmOXNZem1_aGoczlA":{"text":"The jazz daytime cruise is nothing like what the website led us to believe it was going to","useful":0,"cool":0},"I9x_4F7-Kpfwx4s8UTbJJQ":{"text":"A great way to waste a couple of hours in the afternoon and get out of the heat. Hubby and","useful":1,"cool":1},"cIrujTalNWmungk5rFyFsw":{"text":"This would be five stars, except they do not seem to care about the illicit smoking. We we","useful":0,"cool":0},"E_XpJCx2Y4t56nzpUt5Uyg":{"text":"First time in Nola and I wanted to do something unique and stumbled across the Steamboat L","useful":1,"cool":0},"p8LG26WoOJ4aSsiS8LZqBg":{"text":"Overall it was a great thing to do! The food, not so great. The buffet wasn't much of a bu","useful":0,"cool":0},"9_-7cp_GknzT_2UEBsUeyA":{"text":"Over all the experience was amazing. The ambiance was great with the band sounding amazing","useful":0,"cool":0},"6ZbbJi_A914muAayrq-iJg":{"text":"This was one of the very best things we did in New Orleans! Well worth the money. Be sure ","useful":1,"cool":0},"v3o8roMr3E8gcwleehEY-w":{"text":"Taking a ride on the Steamboat Natchez is a good way to see the coastal sections of New Or","useful":0,"cool":0},"zqNan2LwUwctm6jXFdu7fA":{"text":"Great evening on the Mississippi. Cruise plus delicious meal. Amazing to see so many cargo","useful":0,"cool":0},"fsp9HEZX3PzDcBAFNwR-VA":{"text":"Overall there wasn't anything that made me think \"This is so (bleep)ing awesome\" or anythi","useful":1,"cool":0},"2als1ur11zW-Kl-YvzCXGw":{"text":"Second time on the Natchez. First time we just went along for the ride. This time did the ","useful":2,"cool":1},"ZQpNXWSEUuw_6_n0_97Qzg":{"text":"Definitely something you need to do at least once! Took the dinner cruise to cap off my ba","useful":2,"cool":0},"5PvsIWDR_lN84OyYM6uMBw":{"text":"Cruise the Mississippi on the only real steam-powered paddle-wheel ship in New Orleans. I ","useful":0,"cool":0},"Qsw0JMjzBqQem46vKWmXPA":{"text":"The actual cruise, cleanliness and quality of the boat was just fine.  My problem was with","useful":1,"cool":0},"pljpt0srAYsRtfUI5X3lBw":{"text":"We did the lunch and ride option. We went on a Monday, so it did seem a bit less crowded, ","useful":0,"cool":0},"DZAsXbe9bXjhvz5KVW-1og":{"text":"Steam boat Natchez ,I don't see how they stay in business,I have tried  to reserve and boo","useful":0,"cool":0},"HPi_JPFTTKZOS6b_qSwdgw":{"text":"This boat sets sail on the Mississippi river for about 1/4 of a mile and turns around. I w","useful":2,"cool":0},"NzCD8GsmRYSaNZsGapoRAw":{"text":"!disclaimer!\nOkay so my opinion is a little biased as my boyfriend at the time (now fiance","useful":1,"cool":0},"KsVfQb39sOn39St_CpR5MQ":{"text":"Horrible!!!!!!!! 900 people exact!!! Not even standing room!!!! Huge rain storm everyone p","useful":0,"cool":0},"0a_GAnIrJYgHRkOrBRQo8g":{"text":"Nice break from the intensity of the French Quarters. Good tour information but we passed ","useful":0,"cool":0},"zJN7gqOrPP1HlAVcPx2sqA":{"text":"We loved this steamboat tour. We took the 11:30 lunch tour and opted for the early lunch s","useful":0,"cool":0},"Mv6biOKE0yXRTgtAOznEVQ":{"text":"This is our 4th trip on the Steamboat Natchez! I can't believe that I haven't posted a rev","useful":1,"cool":0},"RQe7t62FO3QmQ4gQvZm8hA":{"text":"One of the best random tours I ever booked!\nIt was fun just to be on a real working steamb","useful":0,"cool":0},"wfGDpb_d4vPrQ7C8qzNvfA":{"text":"I went on the steamboat jazz Cruise last Saturday night.   I loved the whole boat ride!  W","useful":0,"cool":0},"p9_Tz1NVzV3txt8BSb-bbg":{"text":"We weren't sure what to expect because of the reviews. We had a great experience and the f","useful":0,"cool":0},"pOYLdheMi-Tyj3FwyKHHgA":{"text":"We loved the Dinner Jazz cruise! The food was okay (probably could have skipped out in fav","useful":1,"cool":0},"YJIEXc6iF7trie5kamuKiA":{"text":"Cool trip for the tour, the food is over cooked and the bloody Mary's downright suck, BUT ","useful":0,"cool":0},"HVWl-TW6o7mF4Y4e5wsv-Q":{"text":"The cruise on the river was nice and relaxing.  Don't buy the meal ticket, not worth the m","useful":4,"cool":1},"MWNs9hXSLAFqbABaJTL85g":{"text":"Great experience from the start, just wish the band woulda let me sing Oran Juice Jones...","useful":0,"cool":0},"gbuMkr_nZviwTYNbzpODRA":{"text":"This was a pretty cool tour.  Based on the reviews here, as well as people we met in the c","useful":0,"cool":0},"J5pFOdy9x-6e3dTkpe2HYg":{"text":"Loved our Sunday jazz brunch! This is a slick operation and well organized, from getting o","useful":0,"cool":0},"W7DOp3sS7iQI-r5IYGG7Ig":{"text":"Been on this tour a few times.  Doesn't take much planning unless you are into that sort o","useful":1,"cool":0},"zNfJLz6N-_mkwg7lXdxlNw":{"text":"I cannot understate how much I enjoyed the brunch cruise on the Natchez Steamboat. We prep","useful":3,"cool":2},"AyJPdCzKPPt4_M8o71elxg":{"text":"Fun informative trip with great music. I would skip the dinner option as the food was bare","useful":0,"cool":0},"shxwD9C8G0qQMew3_vtPLg":{"text":"The actual boat was awesome! The food was not so good. Served like it was a buffet at a se","useful":2,"cool":0},"DCUExk9zRsbLVGCTuVq4-A":{"text":"On our last evening in NOLA we didn't have plans and were walking along the Mississippi an","useful":0,"cool":0},"5YUfPOFVg6MQkQsMhmDM8Q":{"text":"Our family of 6 had a great time rolling on the river on our recent trip to New Orleans.  ","useful":0,"cool":0},"eCuTQzuSbr6Rk6gntz0qaA":{"text":"I wouldn't recommend this to my worst enemy. It was quite possibly the worst boat ride I'v","useful":6,"cool":0},"-BGN3eXqMK4rcVdfvTpOfg":{"text":"This boat ride was not only a waste of money, but also a waste of time. Spent $40+ per per","useful":0,"cool":0},"ZGHL_nCKyPTGEJ8jXf0KbA":{"text":"Food was good (not great, but good for a buffet). The Dixieland jazz band was fun, very en","useful":0,"cool":0},"7p3jTmzEWiDbESCOhBVaaA":{"text":"You have to. Really. You have to. If you're local you've been on a cruise on the Natchez a","useful":9,"cool":7},"G2Teq6gbaJ_x394RZS-iNQ":{"text":"This was a very lucky find. You get to spend 2 hours cruising down the Mississippi River w","useful":2,"cool":1},"jlSIbHADiR9RaBsPv-vo5A":{"text":"Strong drinks. Like woah. He measured and then kept pouring. \n\nWorth the money and a great","useful":2,"cool":3},"xFZs2OroFqnyvYPBPae5_A":{"text":"S.Sharp was our ticket agent at the Toulouse St. kiosk. She was the most pleasant person w","useful":0,"cool":0},"Idd3SxRpVD_igrpEYLP88w":{"text":"Tour wasn't great. Food was ok. It's supposed to be a buffet and they time you, forcible b","useful":0,"cool":0},"M9ez8b1D8Cyz-bkZXCWOvA":{"text":"An adventure on a real steamboat! We chose the lunch cruise which had a \"southern style\" b","useful":0,"cool":0},"emkq1Y1md6lI4AVD-pcKGw":{"text":"My husband and I went on this boat during our honeymoon. It was so beautiful going down th","useful":1,"cool":0},"tjnIG8p2eqWAUFZvHThlZw":{"text":"For an obviously tourist 'thang' this was actually not too bad. Reasonably priced, okay is","useful":0,"cool":0},"IRHrxrjcPl00EReyEEPFfw":{"text":"Did a private party on the boat. Our customers enjoyed the food and tour. Don't forget to ","useful":0,"cool":0},"QfwhyAKJGq7jvKwkAPyZKQ":{"text":"Sound system is good! You can hear anywhere on the ship so no bad seat in the house. Going","useful":0,"cool":0},"U2Gczbr4T3KKUuoOy7XBjw":{"text":"Eric and Zach made our night. If you want a real local experience and conversation find th","useful":0,"cool":0},"DJfU03Uwb-jED6-odgvfhA":{"text":"For $161 (for 2) dinner cruise,.. eh\nMain course was good.\nThey ran out of desert !! \nServ","useful":1,"cool":0},"Gc6Fd0gaovklPbbu81i0xA":{"text":"Second time having the dinner cruise. First time was three year ago. Once again, they did ","useful":0,"cool":0},"0a5xwgtNDJrMsVwOerpJow":{"text":"Poor food, music good but inaudible unless you were close to the musicians, and not all co","useful":0,"cool":0},"3UJ43Hs6bwc8vxrDi2Z2oQ":{"text":"This steamboat is so nice! Who doesn't love a steamboat ? Went for lunch & had a great tim","useful":0,"cool":0},"OHV5d7I1f9OU5AW9v46E_w":{"text":"Our bad for not realizing what we were getting into, but we had recently come off a river ","useful":4,"cool":1},"0dvQ2eaoG_QBKqGWiXJo1A":{"text":"All aboard!!! \n\nSet sail on the Steamboat Natchez, gliding down the Mississippi on this pa","useful":56,"cool":52},"TcE5hv2kV7QGni6qCkxZYw":{"text":"We had a nice experience on the Natchez.  We didn't get the food and we enjoyed just cruis","useful":0,"cool":0},"RYZE1BYSPtsJwcSSu5wMlw":{"text":"Steamboat Natchez has one really great staff member by the name of Gina. She's really upbe","useful":1,"cool":1},"zjGFbXB1oFqaTDW0erhSAw":{"text":"fun, interesting and pleasant.  I reccommend this activity.","useful":0,"cool":0},"icq3YANJyost-9KIw9Anqg":{"text":"Learn From My Fail! I checked the Steamboat Natchez website for parking information and pa","useful":2,"cool":0},"ahiDvOi0bFh5IJlSEfK_Pw":{"text":"After a few nights of debauchery, I just wanted to relax. A river cruise on the Steamboat ","useful":1,"cool":0},"h6VOE1geieRhwNsPep-Iaw":{"text":"Best part was the ride.  Dinner was ok - best dish was shrimp pasta. But typical buffet.  ","useful":0,"cool":0},"hoKyFc49TJinE5rt0X44MQ":{"text":"So we imagined a relaxing ride along the Mississippi . We arrived 30mins before the boat s","useful":0,"cool":0},"hXoZjCiDLzaNX3iuEueh7Q":{"text":"I've been on the Steamboat Natchez a few times before for just the boat tour. This time we","useful":0,"cool":0},"3NDeVCGqvesLGPZLaf9ExA":{"text":"Just got off the boat for the 11am trip! We had a great time and love the commentary as we","useful":0,"cool":0},"9Pb1eEVVWyuAVVuw3uIcQA":{"text":"I had been asked to accompany my boyfriend and his company with free passes to the Dinner/","useful":8,"cool":6},"Z4KVO8uYfiEcLIKe5CVg4g":{"text":"Super fun and relaxing! It's cool to see the city from this point of view. I took the dayt","useful":0,"cool":0},"EgogD3EEXGxms67Uadu9Dg":{"text":"I went on the Steamboat Natchez and was disappointed. My boyfriend and I got the lunch pac","useful":0,"cool":0},"I6JwLfA1-cwLu6hvbeHr-Q":{"text":"Non-US Citizens watch out! Read on...\nVery pretty boat ride with great sights and fun jazz","useful":1,"cool":0},"YRgAGKJ91XvhJghhslAbTw":{"text":"So after a couple of days of waiting as the girls shopped, I didn't fight too hard when th","useful":3,"cool":1},"Qh-uA1FJsiJb_Gi5OJEvtQ":{"text":"This was such an enjoyable evening! The live music was wonderful, they were very efficient","useful":5,"cool":2},"7XabBeVG54jINfTPhtfB3g":{"text":"If you can get over the somewhat steep price, this will be one of your more memorable Lunc","useful":5,"cool":1},"riT1O8PaxxUcwGpRcRTVKw":{"text":"Man wäre wohl nicht in New Orleans gewesen, wenn man nicht ein paar Meilen den Mississippi","useful":1,"cool":0},"zMunRAgbEuP30gB7kJTX9w":{"text":"Steamboat Natchez is a must in New Orleans, we went and had the buffet lunch!!! Was very t","useful":0,"cool":0},"GDBzJOu5LE0T5-UDDuf7qQ":{"text":"If you are looking for a good live band(jazz) and  beautiful seenary,Steamboat Natchez is ","useful":0,"cool":1},"S-wO-MabuvRA1n33nf4LFw":{"text":"What a treat to take a ride on the great Mississippi River.  A great experience.  My favor","useful":0,"cool":0},"tbntk8kJ_j857OkDhBdAOg":{"text":"This tour was awesome and the food was great! The staff was so friendly, welcoming, and he","useful":0,"cool":0},"ir94BLY9f7ygvE4LIy-tqA":{"text":"Booked this trip on line, pleasant way to spend a couple of hour on the Mississippi River,","useful":0,"cool":0},"1vwzScKMV-9ihklZynpZbg":{"text":"Brought a friend on the Natchez this weekend for the lunch cruise. It's cheesy and it's to","useful":3,"cool":1},"KCOv_UV2spujligSLLP_ew":{"text":"Even though I've been on this tour a few times, I went again because the friend I was with","useful":2,"cool":3},"d-RdL0OftyM-XzRm7L_roQ":{"text":"Excellent cruise! Food was fantastic! Staff was so friendly! Cruise director did a great j","useful":1,"cool":0},"0w4Az9G6YGufy7NYbStnlg":{"text":"Unless you have kids and/or you are really bored, you should skip this long boat ride with","useful":0,"cool":0},"RLZ7Kgl-71uccMcliO-ryw":{"text":"Nice idea, terrible experience. Me and my fiance spent $96 for a Jazz and Lunch ticket. We","useful":0,"cool":0},"PXIJ3zjuAR3MJonvHIwlng":{"text":"My family and I bought tickets for the 1:00 steamboat tour around the Mississippi River. W","useful":0,"cool":0},"NuilM6sZuJ6zdcZN8CjlTg":{"text":"I went for day cruise lunch time. The food was just OK, the fried fish was good, and that ","useful":0,"cool":0},"0pmzprEArdc30Pd1NGmxkg":{"text":"I visited with my family. This was our first time bringing all of the kiddos along to New ","useful":0,"cool":0},"76nUBp9Ao5J4f7DNfXDc_g":{"text":"The experience of riding on a paddle wheeler was fun but a short trip on a historical rive","useful":0,"cool":0},"PbGIZQTTDV70CH6xODRHcA":{"text":"I can pay the same amount of money for a better tour which I just did in key west. \n\nWe bo","useful":2,"cool":0},"5ch-xAWRxSAaaL5SPIU8vQ":{"text":"LOOOVE!!! \n\nMy boyfriend booked us tickets for an evening of dinner and jazz for my 30th b","useful":1,"cool":0},"YJNF-hE-hjk5URhKawuCuw":{"text":"We had a very large group of navy veterans in town for a reunion.  They were able to seat ","useful":0,"cool":0},"HBhmvBN9BMQMDsVvk3cYRg":{"text":"Do not waste your money on this Jazz Brunch\nReally. Scrambled eggs, grits, ham, creamed sp","useful":1,"cool":0},"d21hP6h9j7ic-zflHQzQrw":{"text":"A nice 2-hour cruise up the Mississippi River with an excellent Dixieland jazz band. Sugge","useful":0,"cool":0},"BMai-ZSJ-GfzUQuMsLoz8w":{"text":"Stop taking yourself too seriously and enjoy this gem of NOLA. Relax, enjoy the ride, have","useful":0,"cool":0},"BRbUQ2OBFmFsBibcQWGvxQ":{"text":"THE BEST STEAMBOAT CRUISE. \n\nThe lunch cruise was $48 dollars. A 2 hour cruise and lunch~ ","useful":1,"cool":1},"gWO41aabCOCI1PO0N1j8tQ":{"text":"Dinner and Jazz Cruise!  Yes, it can be a bit costly but I feel it is worth.  I paid aroun","useful":0,"cool":0},"UFAPEZL-1IDDX8G9DWAUKA":{"text":"Cool way to relax & take a reprieve from stomping around the Quarter. Luckily we read the ","useful":2,"cool":0},"X2aDCqRbiqR3NmTdT-4Vrg":{"text":"We took the 2PM Jazz tour on a Sunday. It was two hours long. This was nice because we had","useful":3,"cool":2},"6FPDBVWWhnvrK6Rh9mN8vg":{"text":"Great vibes it was my first time going on a boat I had a great time but it was a bit longe","useful":0,"cool":0},"2_BcMS9ieU1on0GUoiZg0g":{"text":"Food was eh, which is expected on something like this. But what was worse was the attitude","useful":1,"cool":0},"yeHIpUwxeBdDkcRBalIefw":{"text":"My husband and I booked a night ride with Natchez for the New Years Eve dinner and firewor","useful":1,"cool":0},"lLPDxI89brwTNoc7YWrqWQ":{"text":"If you haven't been on a steamboat and don't mind being on the water, then this is the act","useful":0,"cool":0},"N0i3qLxXnKX_HZZb9Phoew":{"text":"I can't believe the negative reviews:( This does not boast to be anything but taking a ste","useful":1,"cool":1},"Q7N2NdXQllRedvGZfE9m3w":{"text":"I freaking love boat rides. There's really no other way to see the blackness of the Missis","useful":4,"cool":1},"QfV1I9cVfE3UHWVMUPG7wg":{"text":"Must do when visiting N.O.! We took the 7pm jazz dinner cruise and had a blast. Great way ","useful":0,"cool":0},"CjOiNSwllXdaQnwgAZHAVQ":{"text":"Fabulous food. I didn't expect the food to be so good and was pleasantly surprised. Seafoo","useful":0,"cool":0},"nILcwZ2Ow_717zPwlkhcxw":{"text":"There are other tours that you get more bang for your buck for the price and length of tim","useful":2,"cool":1},"mLR0eOFTP5fnx1peb-3AvQ":{"text":"The boat ride was okay. But the dinner really sucked. I can't see spending that much money","useful":1,"cool":1},"VZTzFrQab_DfAreaB_wuqA":{"text":"I'm on a boat, I'm on a boat is what kept going through my head as I was boarding this New","useful":16,"cool":11},"0ClFlGn3phvLPfYgFUilQw":{"text":"This was such an enjoyable evening! We're visiting and this cruise was the best thing we'v","useful":0,"cool":0},"huLx8FHiBMei7uo4uvvBYw":{"text":"I love it , love it , it's worth it ever penny, breathtaking view, enjoy fresh freeze from","useful":0,"cool":1},"vcJrYjGXwmgqW5P_baGtnQ":{"text":"My husband and I took an evening jazz cruise (without the dinner option) aboard the Steamb","useful":2,"cool":1},"xS215Tfzz7mp5-1xbMq0Bg":{"text":"Great boat and sightseeing from the water. Bartender at the Texas bar made excellent drink","useful":0,"cool":0},"jVgNOCF_3U_mRARM7K3JqA":{"text":"Had so much fun on this river cruise! Beautiful sights and sounds. The speaker was very kn","useful":1,"cool":1},"4ZMLMHlrdQNZw5-NMbnfsQ":{"text":"This is definitely a big tourist attraction for out of towners . Me and my sister did the ","useful":5,"cool":6},"UUaRTF8bWAEvb6z1eg3iBw":{"text":"Food was fair, but come more for the atmosphere. We came for the brunch and it had decent ","useful":0,"cool":0},"J-_rNDRFLbRB8x4xgSpovQ":{"text":"My wife and I spent a week in NOLA attending a seminar and wanted to catch some sights.  S","useful":0,"cool":0},"sexCXfHuvS3cc0W63VXCgQ":{"text":"Super beautiful from the outside and a great first time experience but really it get old q","useful":0,"cool":0},"S9XgJnCroZmuONmfRCbihQ":{"text":"Amazing food super great service, must do if you visiting New Orleans. Amazing jazz band a","useful":0,"cool":0},"12_0L0LxQOeDEspNBgle5w":{"text":"By overbooked, I meant that we were trying to have lunch on board. We were told they where","useful":0,"cool":0},"qcFArfmNNNLCKLRgfCpKzQ":{"text":"Do NOT stake the steamboat Natchez in new Orleans. It's a huge huge rip off!!!! you pay $1","useful":0,"cool":0},"c19dHogJ-W6vlJCSG3wnig":{"text":"My family took a dinner cruise on the Natchez last Saturday and everyone had a good time. ","useful":0,"cool":0},"_sH-XGFSaD70AE3JeLwghw":{"text":"We did a lunch jazz cruise at 11am with a 5 year old and bought our tickets a month in adv","useful":3,"cool":0},"eaISfOw_EiWGamyptnkb3A":{"text":"I've been on the Steamboat Natchez a few times before for just the boat tour. This time we","useful":0,"cool":1},"oBnhblWYBJm0FGrfjfmvpA":{"text":"Going into my trip to New Orleans (for the first time) I was very excited for this steambo","useful":2,"cool":0},"v5K_AAK6t2k4AobWmdWhVg":{"text":"Seeing New Orleans from the water is like seeing it again for the first time. I fell in lo","useful":0,"cool":1},"sMvQ58wnVAqvTxRKsy9VPA":{"text":"I'm so upset that I wasn't feeling my best on my recent voyage on the Steamboat Natchez, t","useful":6,"cool":4},"9xZHAYmFi_u93G3mIk_XFg":{"text":"We are in NOLA for the APC conference! Tonight we're celebrating on the river boat jazz di","useful":0,"cool":0},"lqViq9QwP1NQ6JFl9034Rg":{"text":"It was as expected except for the short staff. It took forever to get service. Food was su","useful":0,"cool":0},"tljcz5mOMtzbN8oZG9Il5g":{"text":"Loved the evening cruise and my husband loved seeing the inner-workings of the ship's engi","useful":1,"cool":0},"_zXRY0zojTg_OZcyzPo45g":{"text":"We came to New Orleans just as it was reopening and were thrilled that cruises started up ","useful":0,"cool":0},"QSvk-HRunRE8W76OwRW25A":{"text":"We had a delightful server. Anna, who was extremely attentive and very helpful. She helped","useful":0,"cool":0},"jl2ZwVkaJqcRYD6j84EOyQ":{"text":"A 2 hour cruise, a 2 hour cruise. Now here is a tale from a castaway....\nget the ticket fr","useful":2,"cool":1},"vg1V3_FLtbH_mpioQHtUQw":{"text":"Excellent, historical steamboat cruise. We did the jazz sightseeing harbour cruise on a Mo","useful":0,"cool":0},"kX8zbE9jrpm_a7QdkNAMYQ":{"text":"Je ne vais pas donner d avis sur la croisiere comme je n ai pas voulu depenser 48& only fo","useful":0,"cool":1},"FUTe5i5tl9Em6cTypqVQyg":{"text":"An enjoyable cruise along the Mississippi but 2 hours was a bit too long for us. We starte","useful":2,"cool":0},"XIxv2uwvBB5uWlg3N-sWrQ":{"text":"This tour is a 2 hour trip down the south of the Mississippi River back up towards the bri","useful":2,"cool":0},"wR6EzpL6T3RfNW5lwJD-wA":{"text":"We booked this night out for a special event, while we were on vacation. \nGot to the boat ","useful":0,"cool":0},"w7jyQ4SQz0unSLYGaVlkSg":{"text":"Excellent trip down the river.  We had dinner on the boat and rolled down the river.  Big ","useful":0,"cool":0},"hZ8BouDCmXZ6WRk-Q776Bg":{"text":"I don't mind acting like a tourist, and this was perfect for that. We booked a VIP experie","useful":0,"cool":0},"-1GQpIIqSNabxgV-awcYKg":{"text":"Take a trip back in time! \nSteamboat Natchez is a Mississippi river boat cruise. If you do","useful":7,"cool":6},"6O1U1xPDBUm47rNDONbeTw":{"text":"This was a nice tour on the Mississippi. I enjoyed learning about the history of the ports","useful":0,"cool":0},"gd3fJqtg4gmpuul5b9ttEg":{"text":"Service was great, but the food was just ok. Could have been better but great views and ni","useful":0,"cool":0},"ZLU2gKsYLGcEcbPIaWjR4A":{"text":"There's so much to say about the Steamboat Natchez... I'll start by saying if possible cho","useful":0,"cool":2},"gszOKSWz8vL9rptTlKBmfg":{"text":"What a nice and relaxing way to spend an afternoon! \nArrived at 1:45 for our 2:30pm cruise","useful":0,"cool":0},"BF6Sg5H60tecc6OwqdSqfw":{"text":"our waitress Cleo was AMAZING! We had a party of 17 and she didnt upset is at all! WE LOVE","useful":0,"cool":0},"SRve_u0uLMXT6npXDaIANQ":{"text":"This would be the option for you if you like rude employees or views of brown water.  Not ","useful":0,"cool":0},"Gvzm49V6_ShTGaLNRzj7QA":{"text":"DON'T DO IT!  At least not the dinner cruise.  The food was OK at best and if you happen t","useful":0,"cool":0},"pFaCw1FYOKmyNhh2sLT_uQ":{"text":"Cleo was the best the server hands down!! She was so nice, good, amazing, and was on time!","useful":0,"cool":0},"8GdJqtSdn2Zv7MXkqfw8Jw":{"text":"My husband and I took the Dinner Jazz Cruise, we had booked dinner for 7:45 and while we w","useful":3,"cool":0},"j7ntNurlafcndroj4B9lcA":{"text":"If I can give them 3 1/2 stars I would. $200+ for 4 people. Live jazz and buffet style foo","useful":2,"cool":0},"aH0pQ-iXu5H6g32e85cjZg":{"text":"Geavona Yvonne, the bartender was the sweetest woman I encountered on my trip. She made th","useful":0,"cool":0},"2NqwzZPLwCnEGm0kr6VvBQ":{"text":"The music was great. The food was great. The seating was difficult to find for a small gro","useful":1,"cool":1},"YOUyM6srRZ4QYVmqk2SFfA":{"text":"With so much to do in New Orleans it is hard to decide whether this is worth the time. On ","useful":2,"cool":0},"i5J54-A3SzU7ieevF3Xc1A":{"text":"Oh my gosh! We had the BEST time ever! Our waitress Anna was so amazing! She was so attent","useful":0,"cool":0},"x8PglVgDLsH1s5pCMwwTng":{"text":"We took the Sunday brunch cruise and totally enjoyed ourselves.  The selection of food was","useful":0,"cool":0},"iI-sqlMpaherYZ0GBRamCA":{"text":"Super fun and friendly staff. Food was ok. Minus one star since food could be better. Over","useful":0,"cool":0},"2A7U5VWfc5MIj_ND6e2fNA":{"text":"We ended up booking just the regular boat tour/jazz cruise and not the one with a meal.  O","useful":1,"cool":0},"gzLJdz6aU6WVXZunSNpjvQ":{"text":"I friggin' love the Natchez!  I went with my parents when they were visiting and took my b","useful":1,"cool":2},"32bJ_nqtFbRpqIX6aMj-rA":{"text":"I would love to give a better review, but the food was absolutely horrible. The boat itsel","useful":0,"cool":0},"hyDlGc7xvyB5ywi9Bank5Q":{"text":"Took the Steamboat Natchez Dinner Cruise, and it was okay, but not as I expected.. The foo","useful":0,"cool":0},"7jvw9g-B0sjTUaxf5QqXFQ":{"text":"The steamboat was beautiful. Outside while waiting to board they had music. I thought \"hey","useful":3,"cool":2},"mdM_XEYTwmTYZy-8X_b3wA":{"text":"Hands down--the best part of our New Orleans trip.  We took the sunset cruise our first ni","useful":2,"cool":1},"sxUpc0obD4MZlJYE9HJqEw":{"text":"I took this tour because I guess you're supposed to.  It was disappointing, but I would ha","useful":0,"cool":0},"nZG6_TdJ5f413IT2-AyPkQ":{"text":"The boat was gorgeous. Delicious drinks. The jazz band was fantastic. Definitely something","useful":0,"cool":0},"DSmKPIcIhoEgfYvGEtS8wQ":{"text":"Well had to wait in line for a refund for like an hour since the boat broke down. Would of","useful":0,"cool":0},"Tq9RO0OzACFS_dP3YufLhw":{"text":"On the first night, we had decided to take a steamboat tour. We did the evening cruise but","useful":1,"cool":0},"mfFyk4mGiV4g0ZRvcWsWtw":{"text":"Such an upsetting experience. My grandmother and mother came to visit, we booked this boat","useful":0,"cool":0},"SALHz2xZ3QjQMMseueoj9A":{"text":"Having always wanted to go on the Mississippi River I really enjoyed myself.  You get to e","useful":2,"cool":0},"dEYhnJQqP2tk1q-XFHz-QQ":{"text":"The food was bomb and the cruise was fun. They have interesting facts about the river and ","useful":0,"cool":0},"lVXhzkFVQft6-HBQct92RA":{"text":"We went at sundown, and it was GORGEOUS to say the least. We did get a good bit of History","useful":0,"cool":0},"my0k-GN9ZYhbqD7GUOW3Ww":{"text":"Oh this steamboat... Got stuck doing a little steamboating on the Mississippi River with s","useful":7,"cool":0},"zuT5TQwDFvhG8BDKo0ZBgw":{"text":"We booked for the dinner and the cruise.  The food was surprisingly good. It was pretty aw","useful":0,"cool":0},"9pTFirXD2xVpJhHTJHIHVw":{"text":"Starting with the positive, boarding was smooth and staff was positive. Our dinner server ","useful":0,"cool":0},"96knlXcswznp1w1uVWFlqQ":{"text":"Cute little tour! Maybe a little overpriced, but not unlike other tourist attractions. The","useful":0,"cool":0},"kXWh7hvt95ILvlZFo-y5sQ":{"text":"A unique dinner cruise experience in NOLA.\n\nWent on a dinner cruise In September as part o","useful":2,"cool":0},"YE6ufLj8s3Nh4RdIA7MaMQ":{"text":"This dinner cruise was amazing! Anna was out hostess and Alvin was our waiter. The food wa","useful":0,"cool":0},"SR489mzzv5Pj9pcSLRgvHw":{"text":"3.5\n\nIt had been a while since I was on a steamboat. I have a history with them. I'm from ","useful":10,"cool":6},"UgNX4hQDLsjn7HBm4btu5Q":{"text":"I have been to New Orleans ten times, but never took the time to sail on the Steamboat Nat","useful":4,"cool":0},"kMJdSaNtJbg_bOvSeDhc6Q":{"text":"We did the dinner cruise on a full moon night.  No annoying caliope music!  The jazz band ","useful":0,"cool":0},"dnpq8is-nUh7BKuIpJn2Ig":{"text":"The boat trip itself was very enjoyable and nice.  The bar in the stern down stairs was gr","useful":0,"cool":0},"5coPDQmEi7tE-ft83UQHhw":{"text":"JoJo from the Hospitality Team was the hi-light of our time on the Natchez! She is wonderf","useful":0,"cool":0},"-dP6-Bkn6BbOrCB0-3fwPA":{"text":"When looking at the Natchez from shore, it looks majestic. My husband and I purchased the ","useful":0,"cool":0},"2ADgz9hWU1ybacKy3vkAUw":{"text":"I love the idea of being on a steamboat while sailing the Mississippi and enjoying jazz. U","useful":0,"cool":0},"WZ38u4-Wy6DNWM5NIphAHw":{"text":"The Steamboat Natchez is a must see for any visitor to New Orleans.\n\nMy love of the Natche","useful":8,"cool":7},"qvrH9qZhYVcaEmHcgImy0w":{"text":"This was a fun, touristy thing to do. But a word for the wise, wait until they bring out t","useful":5,"cool":2},"POYo6brzbJNJIcgOqJSDag":{"text":"I enjoyed our time on the steamboat Natchez.  Good way to kill a few hours.  I enjoyed a v","useful":2,"cool":2},"XpfW_0feXcMxdlMN57bGbw":{"text":"We had about 30+ in our group and I think everyone had fun. We went on a Friday for the lu","useful":1,"cool":1},"vgrPTTWWYo5xEBwrf5fxPA":{"text":"We had brunch on the Sunday Jazz Brunch cruise, and our server Milton was amazing! He was ","useful":0,"cool":0},"P5O5Y3pQTl792-BVj-ErPg":{"text":"Our ride on the Steamboat Natchez was in October 2011.  We still laugh about it to this da","useful":6,"cool":1},"HuBLRhqYDq7C83vJHtGvGA":{"text":"So, I'm basically a local and had never done this, since it is the \"touristy\" thing to do.","useful":2,"cool":0},"EvhmDQqw4fefb_Fgq6VP2w":{"text":"Organ music is so loud!!!!!!!!  My ears are bleeding. Hopefully they don't play through th","useful":0,"cool":0},"kBzC6qSJ0ei3rCHxbYTm9g":{"text":"There are lots of great things to love about the Steamboat Natchez. Unfortunately they are","useful":2,"cool":1},"-m6bDlu945j9cO_jOBk79A":{"text":"The experience would be much better if the staff would implement a visual method to distin","useful":0,"cool":0},"rh5NsW0iJlta9OLyev7k9Q":{"text":"Was so excited to take this trip - but the chicken was so salty it was almost inedible! If","useful":0,"cool":0},"N1B0IVTiuld0CY-DHVI3ww":{"text":"We did the lunch cruise.  It is just what we expected a slow cruise down river and there w","useful":0,"cool":0},"XK2ivjzWMawJL_rx2ua6Lg":{"text":"The Steamboat NATCHEZ, owned by The New Orleans Steamboat Company, is the last authentic S","useful":13,"cool":16},"17EOiCmT20Fdyv7ImQT8yA":{"text":"Today we did the boat ride and listened to the jazz band and had  Buffet lunch.  We had a ","useful":0,"cool":0},"jHfblGMUF3D7ITXCyoZHrQ":{"text":"Had a great time on our dinner cruise! The food was great, music was superb and the servic","useful":0,"cool":0},"KyK4DtQs6PR6d56CTzBV1g":{"text":"Such a fun, lowkey night on the river. Dinner was delicious, the jazz band was lively and ","useful":0,"cool":0},"HLwFzRXV2cES418neeP0cQ":{"text":"It was an unexpectedly cold and rainy trip and we had to wait outside for the second seati","useful":1,"cool":1},"eXjWBLJSIOpXoMSLRzjZdQ":{"text":"Took a tour when we were in NOLA. It was a nice boat ride with lots of informational histo","useful":1,"cool":0},"oCAp_iDQ6ExUMcNfEA3zOw":{"text":"I was a bit disappointed. Should have taken the night time tour, I guess. The view was not","useful":0,"cool":0},"T-ae5Or7kq9ywu-Hntw5-Q":{"text":"We were in town for a few days in April, and thought the steamboat would be a great way to","useful":0,"cool":0},"C4ukyN_-olHBhBRVVsYG9Q":{"text":"I did not eat on the boat but the ride quality was smooth and the customer service was goo","useful":0,"cool":0},"8FzUObhwPriIiDsF9aOrMQ":{"text":"Had an amazing time on the steamboat. Food was great, cash bar was also good. I visited on","useful":0,"cool":0},"cF68tIQI8xv3xsdLFBq1_A":{"text":"The sever Bree was very helpful love the services also the manager kim from Dt im love to ","useful":0,"cool":0},"judFA_RbXHoodjZdaHEqFg":{"text":"Like most of NOLAs biggest attractions, you can expect mega crowds when it's a vacation-y ","useful":0,"cool":0},"FZxcZ5eJfQx3a0awB2jc7w":{"text":"All aboard the steamboat Natchez!\n\nThis boat somewhat resembles the delta queen in CA howe","useful":6,"cool":3},"R7V7jRxDRxheNd2xktZLpg":{"text":"So many people had said this was just an ok trip and over rated so I wasn't going to waste","useful":3,"cool":1},"iCUhdgCp3vJviX57qpEeOQ":{"text":"We came for the Brunch Jazz Cruise, it was absolutely beautiful to watch the scenery and s","useful":1,"cool":1},"CoZOIeaWga3gkN6_43nhKQ":{"text":"Sit on the left side of the boat, there is nothing on the right side. Left side meaning th","useful":0,"cool":0},"yAv5pPk1fKZxslWBg85QSg":{"text":"One of the big attractions in New Orleans is riding on the Steamboat Natchez. If you have ","useful":4,"cool":2},"8BJTSNYidY8_gQZTgNh8bA":{"text":"Please read this if you want some good tips. \n\nMy friend and I decided on the dinner cruse","useful":13,"cool":0},"dsJIG9-rx_kYcxrEl_8L0g":{"text":"This review is based on the weekday 2-hour cruise with lunch.\n\n1. Go on this cruise if you","useful":2,"cool":1},"Isnf-zV95VwHYaDDPgTmUg":{"text":"My Wife really wanted to go on this 2 hour cruise. We called the same day and they were so","useful":1,"cool":0},"WvwAW3YSfUlkMMWqRbKteg":{"text":"If I could give negative stars, I would. \n\nThe customer service my girlfriend and I experi","useful":3,"cool":1},"8ZaX3SE7aBEby-mDb5wRgA":{"text":"A thoroughly enjoyable experience.  Nothing like riding down the Mississippi River on a st","useful":3,"cool":4},"ZPas71tjqkNChAa0o8GjXg":{"text":"Taking a cruise on the Mississippi River is a must do  while in New Orleans. This steamboa","useful":3,"cool":1},"5LYtW2a5Ipaf6h9gdrNP_g":{"text":"Everyone always say to make sure you go on the steamboat when you go to Louisiana. Honestl","useful":9,"cool":9},"jaT0_2qpkEeRlwASsJdWuA":{"text":"This is a must do in New Orleans, especially in good weather. I didn't do the buffet lunch","useful":1,"cool":0},"xzWTfxnCTO8dzkKQXtjEeg":{"text":"The boat was neat. My husband and I paid for the dinner to celebrate our anniversary and W","useful":0,"cool":0},"CtlYHE4vLr1kHPbwSAPm9Q":{"text":"I would pass on this unless 1) its summer time, or 2) you enjoy siting around for 2 hrs af","useful":0,"cool":0},"YUayqtpqqGyzlrifK9FYvw":{"text":"This was a Raider take over event so that made it fun. The food was horrible so don't pay ","useful":1,"cool":1},"J4lVVkv70BXLAtNiyc7i-Q":{"text":"Named after the city of Natchez, Mississippi, this is one of the last authentic, operation","useful":11,"cool":9},"1LObn6l00B3jj-7wXfw0fQ":{"text":"This was a very cool boat ride. Our guide/narrator for the trip just has the best voice - ","useful":3,"cool":0},"GQxzJrJekalEqgJTdQboBA":{"text":"Wanna take a ride down the Mississippi River in a charming steamboat? Yes please!\n\nMy husb","useful":6,"cool":3},"zYqNxL5qiyGLjIfB7MyO_w":{"text":"We went through groupon and bought our tickets for the \" jazz cruise with lunch\" , which s","useful":3,"cool":2},"2I8bK61HwPAowQRTnw58Vg":{"text":"While visiting New Orleans my friends & I knew we wanted to check out this tour. \nwe had o","useful":9,"cool":3},"t_SO0atjjmlpwUW5IhGDmg":{"text":"Overall this boat cruise was nice and informative.  The captain provided a great synopsis ","useful":0,"cool":0},"5_zVmpe3rLxa5WE2DD5rbg":{"text":"Absolute highlight in NOLA. The buffet was damn good & well worth the extra. From the call","useful":0,"cool":0},"GCiM-DexKDzDdMwKHM7M8g":{"text":"Pretty good, but nothing too out of this world. We didn't eat on the cruise since we had b","useful":1,"cool":0},"7GuAg1osbZSiAOOE_T9Jog":{"text":"This is just okay. If you grew up anywhere around a river it's nothing spectacular, just a","useful":0,"cool":0},"0przWCnM6ZtfPQ59jJuHXg":{"text":"I wasn't sure what to expect when we first arrived and were boarding the steamboat Natchez","useful":2,"cool":1},"SeJbEDonlDML8iTnxX_6VQ":{"text":"If you only one day in NOLA, you need to do this! Really. Do this. It's fun, it's educatio","useful":10,"cool":8},"ZV1htbHwd8wxRILyL6HSbg":{"text":"Great experience. If it's your birthday be sure to tell them when you buy tickets. They'll","useful":2,"cool":2},"gOYrT1FqmaJjXkXEJoGFzQ":{"text":"We boarded the boat prior to departure and found the bar and jazz band that was playing on","useful":0,"cool":0},"KZG1_Y2uXvEwNWm8RXMkAg":{"text":"Get your reservation! Book that cruise! Buy that buffet! We went on a brunch cruise here o","useful":15,"cool":14},"UVojkdUeBYQoukWSFAGqhg":{"text":"Save your time and money and do just about ANYTHING else and you will thank me. The pipe m","useful":5,"cool":1},"lgakKSQK4HjcW_HBKu1vSQ":{"text":"I did a cruise on the Steamboat Natchez in New Orleans, LA on 4/16/2015.  It was the 1st c","useful":2,"cool":4},"anfJpynqL8nbbZiLCRZgYg":{"text":"My husband & I bought the night cruise no food ticket. It was a nice little booze cruise! ","useful":0,"cool":0},"5Izc2JJfYyaWYEV8-9oxMg":{"text":"Taking a ride on this steamboat down the great Mississippi was such a chill experience. We","useful":0,"cool":0},"r9mZVTHvjVuB0FBGlhbPJg":{"text":"We took the jazz brunch cruise and it was fun and relaxing! However the food was not very ","useful":0,"cool":0},"yidrZMYq0HBT8kp3mJOoWA":{"text":"May 2013 tour highlights:\n- Relaxing 2-hour lunch cruise. Do yourself a favor and skip the","useful":5,"cool":2},"XjnP_1eIibRopNvMLQEGOQ":{"text":"Because of the way the banks of the Mississippi River are built up, it's tough to get a go","useful":8,"cool":5},"jVI4WhT7Zo63U7Ba24G5KA":{"text":"Our foursome enjoyed the Luncheon river tours Food was fine, narration about the area was ","useful":0,"cool":0},"JqGEH8DamZeugOb1pd7-uQ":{"text":"This is a late review, but I finally have some down-time thanks to the COVID measures, so ","useful":0,"cool":0},"OFr3rQ6AkixA2XgUyBrzag":{"text":"Took the dinner cruise, dinner and cruise were outstanding. The jazz band was very good. W","useful":0,"cool":0},"5MjcBLR6J2tqtF9N8Lclpw":{"text":"We really enjoyed our cruise on the steamboat Natchez. The boat is cute and it is convenie","useful":0,"cool":0},"b2DMpyH5R4Y4cdgiNxJCCA":{"text":"Keep in mind, it was raining for our trip on this boat.\n\nWe were supposed to have jazz on ","useful":1,"cool":1},"hP0ubytkNoquXwetoHpOlg":{"text":"This was an excellent experience. Sai made sure we had everything we needed. Don't forget ","useful":0,"cool":0},"BzTCDUUzT3svaqjOJUiAxA":{"text":"Decided to take a ride on the historic Natchez this past summer down in New Orleans.  One ","useful":0,"cool":0},"WETkhWvS64hWqxLjDvNq-w":{"text":"It's one of the iconic things that you can do when you visit NOLA.  However, it's not my c","useful":1,"cool":0},"1eVVJGSo-kXN-gxMQIH2RA":{"text":"My best buddy and I ate dinner on 7:45 seating we had to pay for dinner I spoke to Jordan ","useful":0,"cool":0},"xX7Z_B3VeQdyGto06v3RXQ":{"text":"It's an unbelievable view of the city. From the beginning, everyone was very welcoming and","useful":0,"cool":0},"rPMYOps2O7JXwtKYzkgSKg":{"text":"I had been looking forward to experiencing the Steamboat Natchez for quite some time. Afte","useful":4,"cool":2},"jO_qS0lgdw1WYYn773_NWg":{"text":"We did the 11:30 lunch tour. The food was pretty average, and we got complimentary tea and","useful":0,"cool":0},"kv1gR7Y0jBrIA9Li7xRkMA":{"text":"I love going on the Natchez every summer I visit town. I love hearing the music playing as","useful":0,"cool":0},"cY51A2nXjUNoyvdKNTeraA":{"text":"We rented the boat for an event we organized in New Orleans, therefore my experience is mo","useful":0,"cool":0},"KQgQOrdAM8D7Ec_xj6QK8w":{"text":"I booked a tour for my family during out NOLA stay. Every boat tour we've in different are","useful":5,"cool":4},"4ksvfrFOXtO_wcTLRYY0RQ":{"text":"Get in line early as the boat can pack over 1200 people and the line can get really long t","useful":0,"cool":0},"L5L144jE8qHYtpau8xXTqA":{"text":"The first thing you'll notice is the incredibly LOUD ice cream truck like whistles that ar","useful":1,"cool":0},"WFDcaqguS2iHcaC5gYuQBA":{"text":"We took the dinner cruise on the Natchez. Beautiful night, lots of fog rolling in on the w","useful":0,"cool":0},"JWiIPKD5QYvBohPXmV-sBQ":{"text":"The view on Mississippi river is bad during the day. Old worn-down factories, deserted pie","useful":1,"cool":0},"W4emw6gLUzedUeFAZwqVxA":{"text":"What a great way to spend a lazy afternoon in New Orleans!! My friend and I bought inexpen","useful":1,"cool":0},"4c2aHdkGwuMFAf96YXgG2g":{"text":"Absolutely fantastic dining experience. Our server. Sieda was the best. Friendly, attentiv","useful":0,"cool":0},"WDUSxQ4PhW39AHaQq8bFHg":{"text":"A great trip on the Ole Mississippi! Steamboat Natchez is a icon of the New Orleans shorel","useful":3,"cool":2},"nN4rk2T_QHoHPuPVDLZZWg":{"text":"Evening Dinner and Jazz Cruise\n\nYou need to do this if you are in NOLA.   I don't know if ","useful":0,"cool":0},"3HYONorJVgV7DOcs4Eg6OQ":{"text":"(Dinner cruise, Jun 7, 2016)  Listened to the calliope that afternoon while waiting on a d","useful":0,"cool":0},"XuYXJkjUTLvvyPh9W9gAGw":{"text":"The cruise was ok, you mostly get a view of the tugboats and barges with some music added.","useful":0,"cool":0},"7aawb2RuJAblgYUTH4q8bA":{"text":"Our tour group did the afternoon cruise.  Buffet included. Chicken.  Catfish. Rice. Beans.","useful":2,"cool":0},"bHvy2hVbaOtEmO9cs2UkjA":{"text":"My wife and I didn't do the dinner or jazz thing...just sat on top deck listening to the n","useful":1,"cool":0},"ey5lDBkzLqXeKD2o0HREbA":{"text":"Gina, Jordan and David! They were the best at the Natchez Cruise! The food was amazing. Th","useful":1,"cool":0},"zQzy_tyTI2K55Rj2VGMMcQ":{"text":"Anna was our waitress and she was awesome! Great personality and wonderful customer servic","useful":0,"cool":0},"UhuAlhbvWDMWunv29hgkGA":{"text":"On 12/23, we had dinner on the Natchez. It was overall a wonderful experience. Unfortunate","useful":0,"cool":0},"31L4Ei-WI5vO6W3W91MiZg":{"text":"This is a tough one. My family and I came during COVID for the breakfast cruise. Perhaps n","useful":1,"cool":1},"48Sw5YDZieJ2aYybCvxQ2A":{"text":"Was so excited for the steamboat ride. We were one of the first ones on. Sat in the back, ","useful":0,"cool":0},"6H-q7kAZrEyG6AK2JwxiTA":{"text":"Cruise- super relaxing. Awesome setting. Tons of info. Great jazz. I suggest you take the ","useful":0,"cool":0},"7So_myDv0l579umL4k2l1Q":{"text":"Went last night with my two 17 year old girls. They loved it. First time to NOLA for us al","useful":0,"cool":0},"PEcRPEhCRtwZkFmQbDjmXQ":{"text":"The staff are not friendly the boat went for 2hrs which was half an hour to much \nthe prom","useful":3,"cool":0},"mB7iIHBwtm559Ny2OFyrrQ":{"text":"We took a dinner cruise on a Friday evening. The food was very good and the staff was very","useful":2,"cool":0},"vh_x1Bt7LxetqkktCCR_uw":{"text":"We did the lunch cruise on a beautiful sunny day - food much better than we expected, Jazz","useful":0,"cool":0},"EV3cjhk8VXtO-tEGwa5Wjg":{"text":"This is a must do cruise, the food was delicious we had an excellent waitress \"CLEO\" is th","useful":0,"cool":0},"SjVOfk3nMiptSuhOfKrBog":{"text":"Steamboat Natchez Paddle Boat River Cruise -Toulouse St & Mississippi River., New Orleans,","useful":0,"cool":0},"92qj9lARCBB5Z2NRECVipg":{"text":"Enjoyable ride down part of the great Mississippi River while receiving some history of th","useful":3,"cool":1},"bkCTjnNskabyqC3tk7SJPw":{"text":"A great way to get a feel of New Orleans culture. We did the 2 hour jazz cruise but did no","useful":1,"cool":1},"69LdpoRfu23fK4p4kg4m7A":{"text":"This was such an amazing experience. It is a must if you are in New Orleans! The cruise wa","useful":0,"cool":0},"jrJFZwQz_kYNWMNrIgMcWQ":{"text":"A bachelorette party on a boat, with open bar. Yes, we loved the Natchez. \nAll the waitsta","useful":2,"cool":2},"10uTjNEl5cV3NTrdULMk4w":{"text":"The food was mediocre so I wouldn't recommend paying extra for the dining experience. We w","useful":0,"cool":0},"OzGfqfD1deJj-WG6piTA2Q":{"text":"This was so relaxing and nice! Melanie was our server for the night and took great care of","useful":0,"cool":0},"PyFq5zFwCGrnJyuTKgATkg":{"text":"Had an amazing experience on this steamboat brunch cruise. It was timed nicely and the foo","useful":1,"cool":1},"NajB71DHWL5BQ7ati0v3Tw":{"text":"Enjoyable, lively, and great view!  The lunch buffet was well organized and delicious!   L","useful":0,"cool":0},"K68ny85dUIZq8SWw56OaJA":{"text":"Hey y'all! Let's take a ride along the muddy Mississippi River and see what we can see. On","useful":15,"cool":11},"vNCq0m0HwJJy9t3grapM3g":{"text":"We decided to take a break from walking around the French Quarter by hopping on the Steamb","useful":4,"cool":2},"mMUdme79VdcXc_OhmzQhWw":{"text":"I did this tour without the meal option. While it didn't feel too authentic, I appreciated","useful":3,"cool":0},"CioW7syJLAMjkWYw6u94bw":{"text":"The Live jazz music from the \"steamboat stompers\", multi deck, multiple entertainment opti","useful":1,"cool":0},"veUspk4aRkwh4IWCM9eyZw":{"text":"Very cool activity if you are in New Orleans. I took the site seeing tour with 2 girlfrien","useful":1,"cool":1},"EMJfWl9IxToCtG_UNuC2nQ":{"text":"Disgusting brunch. Avoid... plus they don't check if you have a brunch ticket so you can e","useful":0,"cool":0},"DmKlLkRu7v9nSLBNnnLqsg":{"text":"The Steamboat is a must on your trip to the Big Easy. Check out the bar and grab some souv","useful":0,"cool":0},"FOffGNI0GwDWbooG_ZIoZw":{"text":"We had a wonderful time on the Brunch Cruise.\n\nI particularly liked the fact that it is an","useful":0,"cool":0},"vR9oiWJLnZ_f-lK3335hGw":{"text":"This was our first time riding the Steamboat Natchez. I'll start with what I would have li","useful":0,"cool":0},"-mIDCRMuy_TyKqfkUWFpcw":{"text":"Don't expect much in the way of sights on this trip. It's mostly industrial buildings in v","useful":0,"cool":0},"0T_t-88_uo278hcdqQkpDg":{"text":"I really enjoyed my visit on the Steamboat Natchez. I arrived in the city with a couple ho","useful":0,"cool":0},"rXox9ykku3WIsVY1r9CRLg":{"text":"We booked the jazz brunch cruise and really enjoyed it! The buffet was tasty and I can't r","useful":0,"cool":0},"LBUmAhG88-O1k4xUKeId8A":{"text":"I loved it. My family and I had a great time. It was wonderful to learn some of the histor","useful":1,"cool":0},"Z_mgZ0VgO3wqW4ODqTYFbg":{"text":"We are visiting on our honeymoon and did the dinner cruise. We definitely enjoyed ourselve","useful":0,"cool":0},"ksmKSGdrDF9EWyJ_JSQpgQ":{"text":"When your downtown on a beautiful day, then why not hop aboard the Steamboat Natchez.\n\nI h","useful":3,"cool":3},"6nFX1S2jTPDnM1Lbhx7koA":{"text":"We went in the early afternoon, and although lunch was available, we did not partake, we j","useful":2,"cool":0},"4MjFKvuNJBwPQlrV_5khuQ":{"text":"We were just walkin along the river looking for any kind of boat tour and found Steamboat ","useful":0,"cool":0},"dbKgYPBckDAC8ee_GzhJow":{"text":"Hyper-touristy?  YES!  Fun for the young-at-heart, old-timey enthusiast, adventurer, and b","useful":2,"cool":3},"HtvyWfukGUR18yeDdD0YRg":{"text":"My wife, two kids (ages 9 & 4) and I, had a terrific time on The City of New Orleans for t","useful":0,"cool":0},"8wEBTmtD46BIXJGM0vZ0dQ":{"text":"I had to reschedule our cruise because I messed up the dates and they were very kind about","useful":0,"cool":0},"yhiwieJHDRTdg36cLWoebw":{"text":"Had an excellent time on the Natchez Steamboat. The crew was very friendly & courteous. We","useful":0,"cool":0},"Cy2UEwL7XxJ7hydnE4tTuA":{"text":"Food was just okay. Staff was great! Tour was great! And, Jazz Band was wonderful & truely","useful":0,"cool":0},"Zd4QOIbM-IHthMQKYHaMyA":{"text":"My husband, 11 month son and I rode the Steamboat Natchez. We enjoyed the Sunday Jazz brun","useful":3,"cool":0},"jpLZj0wVhHi89Y5mfHOybQ":{"text":"The trip was very nice but our server Cleo stood out to make the tour amazing. Great servi","useful":0,"cool":0},"7GONROQsCU3lRgSPejnExw":{"text":"Purchase of tickets at the Toulouse St. kiosk was incredibly pleasant. This wonderful swee","useful":0,"cool":0},"z_juTbjOmpK910EFd0cs1A":{"text":"The steamboat on the Mississippi was a great experience! The jazz band was exceptional and","useful":0,"cool":0},"Zgxa0k5uwlRVMQucaQhIhA":{"text":"The food was ok at best . The buffet style had no safeguards for germs . None ! Give a was","useful":0,"cool":0},"PY393scRgnn40_U2hPGfMg":{"text":"Five Stars .                                                                     Had a won","useful":0,"cool":0},"BhvVnLRf5Tal96Etea2zGQ":{"text":"Had a wonderful time with family on the dinner cruise. Buffet was good and our server Cleo","useful":0,"cool":0},"4YBd6rzi_NNA1FADBIWiVw":{"text":"I really enjoyed this 2 hour trip up the Mississippi.  There was plenty of space (so you d","useful":0,"cool":0},"jOAtDH7zHDvKTyGZfICTiA":{"text":"Overall, good times. It was crazy hot, and we sat on the wrong side to get the full value ","useful":0,"cool":0},"5uz5cM3Mz-n7aoNh2O2i9g":{"text":"I love the Steamboat Natchez!! It is a great way to kick back relaxing for a few hours, se","useful":8,"cool":5},"cD9bwDAqdcXSdJhZQSNNsg":{"text":"I booked this 2 months in advance for a cruise that was stopping in New Orleans during Mar","useful":0,"cool":0},"XWIpIZh99AW5LffEUWKdfg":{"text":"The Good: The cruise was enjoyable and relaxing overall - there's a guide talking about th","useful":0,"cool":0},"EZOmoj4hzrdTMiBZXPFgqw":{"text":"I surprised my husband for his birthday by purchasing Jazz dinner cruise for two, also arr","useful":0,"cool":0},"_2DUjUR0bzqVP961BRvO4w":{"text":"I kinda agree with the guy below, the 'security' picture is a scam, the drinks are just 'o","useful":2,"cool":2},"KB0DZzdpXH0NVWkqj-7X0w":{"text":"I d wanted to go on a steampaddleboat on the Mighty Mississippi for years. I live in New E","useful":0,"cool":1},"6y63EWfHbdjk9U7QbGuMww":{"text":"Food was good and the staff friendly.  We had a good day on the ship with the sun coming o","useful":0,"cool":0},"C2rQqWjz9pkIzfGAEH_GSg":{"text":"Everything was great. The food the staff very memorable experience. Gets a 3 because of th","useful":0,"cool":0},"eYnPUpu_dTgfJ2pcTklbBA":{"text":"Two hours of rusted-out buildings and flood-battered docks on the muddy Mississippi.\n\nIs t","useful":5,"cool":3},"2kYQETyK9ExRT6LUt--qgw":{"text":"We went on the 2pm cruise, on a Tuesday, so there wasn't any crowding issues as I was afra","useful":1,"cool":0},"fhzgCsjakMNNpnW-JtvBYw":{"text":"I know there are some 4 Stars but I have to go with all 5. We did the lunch cruise even in","useful":0,"cool":0},"3571T9rXckizc6tQxJ47-g":{"text":"Great service! Lunch was excellent!! Overall definitely worth the money. Line up early if ","useful":0,"cool":0},"eQEi7h6YxOLuq4MfP9rI7Q":{"text":"On our vacation we wanted to experience all things New Orleans. We booked a tour and the S","useful":2,"cool":2},"iYLNISotzl6p5zNuYIcagQ":{"text":"We had a wonderful time during the Sunday Jazz Cruise! The staff was friendly and the esta","useful":0,"cool":0},"I3L5zY0El12c9DytK-bqdw":{"text":"Best part was the ride.  Dinner was ok - best dish was shrimp pasta. But typical buffet.  ","useful":0,"cool":0},"uWIRKdwm-dJZcgmJVb4w9g":{"text":"Came to Sunday brunch to celebrate my Nieces birthday, and this was a wonderful experience","useful":0,"cool":0},"ULOz-ifIOirzQYvSXoKn0w":{"text":"Nice boat ride , get there early to board and get good seat and shade on a sunny day to vi","useful":6,"cool":3},"h8JomVP7p3PgPKZpRo4NbA":{"text":"The sunset on the night of our cruise could not have been more perfect. 5 stars to the uni","useful":1,"cool":0},"P_-fEGCJD-t2Cke57ONV5A":{"text":"Some of the best views of the skyline of NOLA can be seen from this old school showboat wi","useful":0,"cool":0},"KfnRPqoUKnSc44mvgb0QcQ":{"text":"We had great time on the Natchez steamboat. We did both, day and night jazz cruise with fo","useful":0,"cool":0},"5Qw25lJZPQzLTLUUibKVKg":{"text":"We took the 2:30 pm lunch tour on a weekday in January 2020, and had a great time! \n\nSome ","useful":2,"cool":2},"6gRtAwi5QH6afN5-NTO4XQ":{"text":"Such a fantastic time. Moderately-priced drinks, a fantastic view - the best way to end a ","useful":0,"cool":0},"Ol6H9PDMW9csVol2Y3iy2w":{"text":"Our foursome enjoyed the Luncheon river tours Food was fine, narration about the area was ","useful":0,"cool":0},"ftkbBeb54_zAUl7RTuO-GA":{"text":"Not exactly what I expected. It was a nice, peaceful and narrated ride along the Mississip","useful":3,"cool":2},"aT5O-9v3obHAHoglk0aybw":{"text":"We ended our vacation with the Steamboat Natchez dinner cruise along the Mississippi. Ther","useful":3,"cool":1},"UHCWbuCX4SC1sE6s3Hzk7w":{"text":"This was a last minute decision to go on and not only was the tour very interesting, the s","useful":3,"cool":0},"8o_pxOxI4Sa0YXhMru6dgQ":{"text":"What a great and inexpensive way to tour the Mississippi river and get some New Orleans hi","useful":5,"cool":5},"P_jAIHcWIRpCkGjMuGzGLg":{"text":"***REVIEW FROM AN EXPERIENCE IN JUNE 2015: I just wanted to let everyone reading my review","useful":2,"cool":0},"ebO9owMQUxJ8enFkMf_cKw":{"text":"Whoa this is my 950th review. Kinda bonkers. I'm very happy to be reflecting back on a bea","useful":8,"cool":5},"_KkNNgS6S1FX1Q8WLbezDQ":{"text":"We had a wonderful time on board the Steamboat Natchez, getting a taste of the  New Orlean","useful":1,"cool":0},"Zt2hHvRUgiq4OVV9HPu5cQ":{"text":"This is a joke.  The jazz band played around 45 minutes total for the 2 hour cruise.  The ","useful":0,"cool":0},"WPKrhC0ES57MhkTZBCWMFQ":{"text":"I don't know what people are expecting from a steamboat tour to NOT give this a 5-star rat","useful":0,"cool":1},"-1bagGe6E0hADxBa7Wqbnw":{"text":"The employee at the boarding area was screaming at everyone like we were idiots because ab","useful":1,"cool":1},"4elREn7nqcJhGiQa-BiI4A":{"text":"Great experience with a phenomenal tour of the Domino sugar factory. The tour guide really","useful":0,"cool":0},"-GER1Y4StRatn1detTEl0g":{"text":"I recommend the Natchez for a \"day of arrival\" activity.  You'll pick up some history from","useful":1,"cool":0},"WK1DtzcZVM7D7UNPQEvP1A":{"text":"This is our first time to New Orleans and we had the perfect experience on the steam boat.","useful":0,"cool":0},"N1GQHSNQTF34IOQIbMucQA":{"text":"Alright, so, I kinda waivered on how to rate this riverboat cruise, but i think it deserve","useful":5,"cool":1},"iISILB5VgbbHPhJOvwXYnw":{"text":"Our tour guide was extremely knowledgeable. There were great sights to see the whole way. ","useful":0,"cool":0},"xHGL8k-u9oET-1qnxZSkLA":{"text":"This was amazing and the best.  The crew was amazing and out host for the lunch Mélanie wa","useful":0,"cool":0},"LyCbWtkhkZyH3f5T3uanOQ":{"text":"Since the weather has been hot in New Orleans these past few days (even at night), we deci","useful":1,"cool":0},"k8WsQkY9EtfFwyy--JEahw":{"text":"The VIP on the River party cruise was apart of my Essence Fest package and I must say it w","useful":3,"cool":0},"m-TUNwBPdzKwBsm_z4s7Nw":{"text":"This is one of those hidden gems that I found on groupon and decided to take a chance on t","useful":4,"cool":3},"In7mNwtjN7uQ2MzZ0ZuLxA":{"text":"Come here if you want to catch Covid. True to cancel our Resy because of possible exposure","useful":1,"cool":0},"0uWhB0JDXkwTy2VhIfme6w":{"text":"This was a fun historical tour of New Orleans. The boarding time was 2pm - but many people","useful":1,"cool":0},"dVQ_cEtqCQiGk-0wjA4Tkg":{"text":"Loved this experience! The captain was very knowledgeable which made it even better.  The ","useful":0,"cool":0},"zpwPUwZccifWyHXhSL730g":{"text":"Decided to take my boyfriend on a jazz brunch cruise for his birthday!\n\nThe good: It was a","useful":3,"cool":0},"rlmvY-ygk0lslYkmGGIQJg":{"text":"It's a great tour down the river.\nI don't know that I would do the brunch cruise again sin","useful":0,"cool":0},"i1lh4Gt_WsDjrG5ua-8ogw":{"text":"I sailed on the iconic Steamboat Natchez during my quick visit to New Orleans two weeks ag","useful":30,"cool":21},"xudM5e90qUn1YXlrukW4jg":{"text":"We had a wonder time on our evening dinner cruise.  The weather was cool, but the jazz ban","useful":0,"cool":0},"GH38M_SraEWSHqSyvjTU4w":{"text":"This was cool for the first 15 mins. This is the guided tour portion, learn cool things, s","useful":1,"cool":0},"5qfDVI9I0drVQRgft82J1g":{"text":"My fifth time aboard the Natchez in 25 years.  A delightful excursion up/down the river wi","useful":7,"cool":6},"SAP2JuzW4mccbb5pUnySCA":{"text":"We on a boat, steamboat that is...Mickey or Minnie don't drive this steamboat but I did re","useful":2,"cool":1},"3dNF-AyHqtoE_RrX_4wPtw":{"text":"The trip was worth it just for the view of the Paddlewheeler. It's one of the few left in ","useful":0,"cool":2},"meSW2S75s_gAr8k9V9K91Q":{"text":"New Orleans is a place that is nothing short of magical and there are an infinite number o","useful":10,"cool":3},"zAKMGKtdIST3KCyUAxryWw":{"text":"A family owned steam driven paddle boat on the Mississippi River in New Orleans. Had a ver","useful":1,"cool":0},"xNJB-lvcIONUW5iWuJGhsA":{"text":"We enjoyed the Sunday Jazz Brunch cruise on the day after Christmas. Not only was the tick","useful":0,"cool":0},"m0PX_WEuvARtBC7UFWvcFQ":{"text":"We took an evening cruise and the 3-man band was great but they weren't playing the entire","useful":0,"cool":0},"6rAKBpXXr6v5gTCCVbRxtg":{"text":"I'd say if you're looking for something historic and a little different, then this is a pe","useful":5,"cool":1},"TPWt4smE-wy5Nqvq4rW6Ag":{"text":"What an incredible night. The staff was so friendly and helpful. The cruise was a perfect ","useful":0,"cool":0},"cNBNRzX8lG_ElJHZ-Mn03w":{"text":"Looking back, my husband and I probably should've spent the $ 80 on something else. The wo","useful":1,"cool":0},"tq78L-eha5_IYJRQlaZDHw":{"text":"Definitely one of the most relaxing parts of our NOLA trip and worth every penny! We did t","useful":0,"cool":0},"w8yOpxuPd88hLaSeFt_ywg":{"text":"In the times that we live in nowadays it is neither shocking how mistreated consumers are.","useful":0,"cool":0},"5JV-7MGK58rIgjPO7pAzDA":{"text":"When you purchase \"dinner cruise and sightseeing\" it DOES NOT include dinner. It is only s","useful":0,"cool":0},"xpLkBWziMyjWm7Q-bK8m6A":{"text":"Such a fun, tourist experience. We last minute decided to hop on the steamboat Natchez. Th","useful":1,"cool":0},"DCkmuecUDgr3Z_N_QEJ42g":{"text":"I did the lunch boat tour on Halloween & it was relaxing & enjoyable.  They offered a buff","useful":3,"cool":1},"jhe2yGVYfj15q62MCqNudg":{"text":"STOP. NO. And DON'T. Now these people knew we were going to be eating at all of these othe","useful":5,"cool":0},"64V7sGJve3jfNq0fMW8HrA":{"text":"This was on my bucket list, to take a steamboat ride while listening to a Dixie Land jazz ","useful":23,"cool":18},"W3-S193Q1zcfVmzhM1r7Eg":{"text":"If you are under the age of 65, you will likely be younger than 99% of the passengers on t","useful":23,"cool":14},"bji5GgS-MNgxHmslh0Tvjg":{"text":"This is a MUST for tourists! My wife and I really enjoyed the couple of hours we spent cru","useful":1,"cool":0},"FR2AG97sKIJjuJdP1ub4_Q":{"text":"What a fabulous experience! Our hotel booked us on the 2:30 pm Sunday brunch cruise on the","useful":0,"cool":0},"4Cpjfvn_DH0XBCwkyBAWJA":{"text":"Definitely don't have to do this again, my bf legit stood in line for 40 minutes to get  2","useful":1,"cool":0},"ui4QyhqG5rOa0JRrx1wBDQ":{"text":"Enjoyed a pleasant Saturday dinner cruise on the Natchez.  Although the gumbo was mediocre","useful":0,"cool":0},"LSG4d9Gusb0bm9CPSwm6vw":{"text":"Nope just nope. We did the Sunday Jazz Brunch. No where does it say you have to wait to be","useful":0,"cool":0},"hy0dzG_D1fBpVShXQgGw1Q":{"text":"Normally, I'm one to eschew any sort of tourist-y things on the basis that I like to avoid","useful":8,"cool":3},"8n_Kuyi68YLEmAVoWgnJSg":{"text":"Melanie was our server and was amazing!! Friendly and took good care of us. The boat was c","useful":0,"cool":0},"xWkxXWnNxaDjSbPZxxTgig":{"text":"My son and I were there during Spring Break weekend and decided to take a tour. The tour i","useful":0,"cool":0},"RHelonN7-xzdI7pF5-psDg":{"text":"Boring for my family. \nLiked the tour and the jazz music but nothing much to see for the p","useful":2,"cool":0},"GzRUF9PBPYX8Pkbzsqeq-A":{"text":"Not sure why people are complaining about the food and touristy vibe....it's literally a s","useful":2,"cool":0},"QK0hJPrmlMJJ6VCgJoUSPg":{"text":"I went on a birthday charter and had a blast, my sweet server Melanie was awesome  she tel","useful":0,"cool":0},"P2ij3hRE7Fi-57L3Sb9PQg":{"text":"We had such a great time and were so well taken care of Sieda aka \"Sy\" our server.  The st","useful":10,"cool":11},"BqD8VSA0Z64fZgB1CP5LDg":{"text":"This is the definition of a disaster waiting to happen if you book for a private event. Do","useful":1,"cool":0},"R0AAdo99iJqJdR79Ve4tXA":{"text":"We just had dinner on the dinner jazz cruise. Milton was an excellent server and one of th","useful":0,"cool":0},"CgZTagERjVj-9meQdHIi3A":{"text":"The second we landed and checked in to our hotel we rushed to the Steamboat Natchez and th","useful":2,"cool":1},"y-IHlkzYv0TOt_6Hm3AFxA":{"text":"This is a relaxing experience when you're wiped out, but still not ready to leave New Orle","useful":7,"cool":5},"KwVgim2TslS2uJK3yb2O6g":{"text":"Don't bother wasting your money. All you do is take a ride down the Mississippi River for ","useful":1,"cool":0},"vuVv4hZ0LlIbjd3W4CpAlw":{"text":"Booked on get your guide site that advertised many options on this cruise. I selected spec","useful":0,"cool":0},"us8J6Lq4i8VmY43-V5dXvw":{"text":"I guess it all depends on what you're looking to get out of it.\n\nThe food was decent, the ","useful":2,"cool":0},"Ks_YS7uBja6u4ust5QZI0w":{"text":"Love the jazz. Hate the food. Way overpriced. I way overdone. Only things worth eating wer","useful":0,"cool":0},"-uciQj3Z7KOqjK9TynpuRQ":{"text":"I would recommend this cruise as a must if you are in New Orleans. My wife and I went on t","useful":1,"cool":1},"drjxevWBj-p5clDz-LTJuw":{"text":"Right as we got on the boat, there was a tornado warning and we weren't allowed to leave t","useful":1,"cool":0},"6iqcEsvnNw7q3XC5dniCJg":{"text":"The evening cruise was great fun and the jazz band livened up the trip down river.  Beauti","useful":0,"cool":0},"Mm49VsKEfuDLgYnqGwINGw":{"text":"This is your typical tourist ride down the Mississippi.  We were doubtful that there would","useful":0,"cool":0},"BcNNCFiKekaaPZjH9tZWDQ":{"text":"I've been on this cruise/tour a number of times, but I was surprised this time by how much","useful":3,"cool":0},"ItbzPzAeUbR0HvHMNSu0fw":{"text":"DO NOT get the dinner option. If we had left that out I would have given this five stars. ","useful":1,"cool":0},"_5A6y-VpxKss49XnQcGkTA":{"text":"So after three days of the French Quarter Festival we were all in sensory overload.  Our h","useful":5,"cool":2},"c9OGSseq4qyyCy9ARYAxGg":{"text":"We booked this cruise through Expedia 4 months prior to cruise date. When we got to the ga","useful":1,"cool":0},"oRFAIRbF3ZkTBPPi0xbBFQ":{"text":"Nice informative river cruise on one of only two remaining steam ships in the nation!\nBuff","useful":0,"cool":0},"1vWqcpqHoDLu9_okMBynGw":{"text":"Overall this wasn't a totally bad experiance but I was somehow expecting more. Bought the ","useful":0,"cool":0},"9R19mhYIUOnjLAAEV6zMhA":{"text":"Good music,l and good staff. The food was delicious, I loved the seafood pasta and the bre","useful":0,"cool":0},"JDn0bt2yDhzJk4SFwpMuJw":{"text":"Nice little trip up and down the river. Good information and local history. We went for th","useful":0,"cool":0},"qIPAh_Brw1RvU93DxfzbmA":{"text":"The food is okay, but the service is phenomenal. Our server, Cleo made the whole trip wort","useful":0,"cool":0},"CWybxVlMq4pVAOFSjCsJcA":{"text":"We did the dinner/jazz cruise but did not eat dinner. We had a great time listening to the","useful":0,"cool":0},"QEd0BpdmmMMobtJsKse7mw":{"text":"I had such an enjoyable time riding on the steamboat. Guess what I didn't even get sea sic","useful":15,"cool":12},"82cebtKRt-9MS27dWuWk7Q":{"text":"A different way to sightsee throughout NOLA and get hands on with the Mississippi River. W","useful":0,"cool":0},"NKmjLVQcFeeMOCnkmzQQyQ":{"text":"This is our second time in NOLA Asnd was excited to finally do my first ride on a paddle b","useful":0,"cool":0},"biZ9K5oi51zsUvcofs9tQQ":{"text":"We decided to check this out for both our birthdays and did the buffet dinner. Our server,","useful":0,"cool":0},"msv11s3fWg7hb6dDzpMXvw":{"text":"This boat is okay for regular riding and paying for a random night. I wouldn't recommend i","useful":1,"cool":0}}