{"ZnDGtgLO2nHhd7swQif91Q":{"text":"NEED AFFORDABLE VEGETARIAN FOOD OPTIONS! (No, not a salad).\n\nThe weather is great, music w","useful":0,"cool":0},"cO-JdI37vhcBx2udRa-KXQ":{"text":"I went on Sunday evening this year.  The lines were not bad, only 2 or 3 deep.  I had the ","useful":0,"cool":0},"iQ_X-AqwEm9RR6jL_iTXTg":{"text":"Jonathan Boogie Long.... Great music.\n\nReally great food.  Nice atmosphere.  good drinks. ","useful":0,"cool":0},"MnKKql7gkM2N3712NXTUUA":{"text":"The blues and barbecue festival is a free event and starts on Friday evening and continues","useful":1,"cool":1},"aXVXqbQz9ML696UOg8hphg":{"text":"Always a yearly highlight for me. The BBQ and blues are outstanding.","useful":0,"cool":0},"9D4iYgSr2K6ylzIDo7pzXQ":{"text":"My favorite festival in NOLA! Free admission with great Blues music and plenty of great be","useful":1,"cool":1},"TtyoSARFAVPYb1lo7hY6sg":{"text":"A review for the October 2010 Blues & BBQ Festival\n\nThe musical line-up was solid and blue","useful":2,"cool":1},"mfho--W5zYiDoUx_2F4R7A":{"text":"This was a nice surprise. When we originally booked our trip we started doing some researc","useful":2,"cool":0},"JO31HayM9AUmxzUThgECIg":{"text":"I am local and enjoyed the music and food but had a bad experience with the daiquiri vendo","useful":2,"cool":0},"xXxyk3r_ozBadQH5ETeC2w":{"text":"The music and food were very good. Having two stages made for seamless music, As soon as o","useful":6,"cool":7},"5Y2nekkwRrNMMSx3b-2EhA":{"text":"Wow, this festival is so amazing.  You can get signed cd's... new performers, established ","useful":2,"cool":1},"Z1IqdFPNdddFSzS-xDPuWQ":{"text":"The music is always great at this festival while the food just frustrates the ever living ","useful":4,"cool":1},"lxbpK_nr9dURZpt4Br76UQ":{"text":"OK, so I just experienced the Third Annual Crescent City Blues & BBQ Festival and as we kn","useful":2,"cool":0},"hbbYsycsIZoty6d_y5JvJA":{"text":"I just stumbled upon this FREE public music festival while strolling the streets of New Or","useful":6,"cool":6},"MvDcIUdHDx49DcQRjGFLIw":{"text":"This is a great festival and has come a long way from it's humble beginnings.\n\nAs to food,","useful":2,"cool":1},"4pH7rwdDg7g1ucBoyaaY8g":{"text":"This might be my favorite NOLA festival.\n\nVery laid back, which is a plus for me. We had n","useful":1,"cool":2},"w4x0whTMzzf3vlnQiMC08Q":{"text":"I went on Saturday afternoon. Crowds were normal and lines for food not that bad. I was st","useful":4,"cool":2},"cuRT-PStzQmoaznSdC7teA":{"text":"This is a solid, laid back festival. It's in Lafayette Square, which is a smaller venue, e","useful":0,"cool":0},"jIW9LZ0Y_WQng7VhHGuLiA":{"text":"FREE admission and GOOD food. It's rare to go to a festival where most of the food you ord","useful":3,"cool":1},"M3qnJ-A3_M-qwvCPz97chQ":{"text":"That's it! More employees than customers (4)  and I still waited to be acknowledged.  I at","useful":0,"cool":0},"TMndx8ioolvYfr0LtVEIAg":{"text":"A mellow, smaller festival in Lafayette Square on a beautiful day! There is a modest craft","useful":7,"cool":5},"3wqg2KhK5Dl1SxXugtimVg":{"text":"Family friendly festival for anyone of all ages. I love how this festival takes place in t","useful":2,"cool":2},"n7KFc_Tkhvb69tpHUvuzQg":{"text":"Every year I volunteer with the NOFF on the weekend so I can finish my shifts and head ove","useful":2,"cool":1}}