{"rGcmDqCH_2BQikVEqCFoWg":{"text":"Such a great spot for accessible local art! The do have a few large pieces in the patio ou","useful":2,"cool":0},"KS61vAMRREn4R6YBglmnvA":{"text":"First off to start let me say I am a local and love this city and most of the people in it","useful":0,"cool":0},"QzWClipy3tuGHkwLv10nOg":{"text":"Just had the most wonderful shopping experience at Le Jardin!  The owner might not want a ","useful":1,"cool":0},"G9_y6sEnzK2QSgfgerx4Ig":{"text":"Le Jardin is one of my favorite shops in New Orleans. It's full of wonderful art, handmade","useful":1,"cool":0},"PN9h92Iq1jEJxHGrCDl4nA":{"text":"Great shop owned by great local artists! The space is absolutely beautiful as is all the l","useful":0,"cool":0},"g4Wh_TvZVV2JwRLrSxRgFA":{"text":"Found some quirky paintings that are perfect for our house.  Lady working was incredibly f","useful":0,"cool":0},"26H8roM8D_jkRe1M1Yz42w":{"text":"This is review is for the next door store Adorn which based on their site appears to be co","useful":0,"cool":0},"yLXmMNGsNJQGSnCeeJgbOA":{"text":"This is a fabulous gallery/art/gift shop in NOLA. As a bonus, there is an excellent violin","useful":0,"cool":2},"B_Hy6JGDCziO2eF5UD0Oow":{"text":"There must be another entry for Le Jardin, a gem of an art shop in the middle of the Frenc","useful":3,"cool":1},"AXDQTrDnf0UJo_UX9O537w":{"text":"I have been looking for a specific type of New Orleans style painting and Le Jardin had th","useful":1,"cool":0},"BK2y_-ktawY45Ic78lpLUA":{"text":"WHERE DO I BEGIN? IT'S A PLEASURE TO WRITE THIS REVIEW. I found this jewel that I believe ","useful":1,"cool":2},"tFNgOpuZrCDykBBFjGC-nA":{"text":"Le Jardin truly supports local artists. Love to come here!\n\nBeautiful space on Royal Stree","useful":1,"cool":1},"6lE2rZLSg4s6XQWJ1foMgQ":{"text":"Quick shout out....this is my 100th review!! Whoop whoop!\n\nI specifically chose to write a","useful":2,"cool":0},"uLM3oaopYvfB3Oj7MQ87-Q":{"text":"This is my absolute favorite store in all of New Orleans. Everytime I go back to New Orlea","useful":3,"cool":2},"WQyHk05UcUsfd-fuUbuAIg":{"text":"I fell in love with this little cute local art store while on Royal street in the French-q","useful":0,"cool":0},"xlqDG6yeXqFF6gnm0D_RYQ":{"text":"Mr. B! This review is long overdue!\n\nWe stopped in to browse his shop/gallery and absolute","useful":4,"cool":4},"7M6NNtT3e16oUpYO-2__Zw":{"text":"Lovely shop with lots of local art to fit all moods/decors.\n\nI like to stop in this shop w","useful":7,"cool":6},"r5u-6HKkERui67C-lWX6Pg":{"text":"I love to visit here every time I visit NOLA. They always have a local changing collection","useful":2,"cool":1}}