{"r2BjDlp8IW0t7rOFeGL-yA":{"text":"This is a cool tour. However, I think it is too long. After about an hour you lose attenti","useful":0,"cool":1},"aT7FSVEFMzR9WZFBxlyDZA":{"text":"It was ok.  I kind of wish there was something between Meh and A-Ok.\n\nIt was more of a his","useful":0,"cool":0},"v_WjQpVFS_dRqRuN6LIEfw":{"text":"Our group of six just finished our tour. I CAN NOT RECOMMEND THIS ENOUGH! Being from a tou","useful":1,"cool":0},"q8LdwsNxh5aQ0dyjL1SbMQ":{"text":"We had a wonderful time!  Brian was an excellent guide and added a lot to the event.  Than","useful":0,"cool":0},"AeOAaeBce7gno7n4MoiqsA":{"text":"WOW!!!! This is just the feeling you leave with after two hrs. with Ernie as your tour gui","useful":2,"cool":0},"myZLBmeq2BmVgqFcNKsyyw":{"text":"I'm sorry to be harsh, but it was pretty terrible. \nWe paid and lined up below an awning, ","useful":3,"cool":1},"5fl1RrFcBbume8dSOhhHqw":{"text":"Traveling between Christmas and New Years with the family.  Hubby is a History Professor a","useful":2,"cool":0},"OlhIK5HdOQbel67scq9QFw":{"text":"My husband & I signed up for this tour not really knowing what to expect - hoping like hel","useful":0,"cool":0},"_5zxjH4Wrb7awyr8ONz3Tw":{"text":"We did the 5-in-1 tour with Drew at night. It was better than expected and Drew not only w","useful":1,"cool":1},"DM0x2GJx5REsgIjDfMJn3g":{"text":"Excellent!  Took the ghost tour in April 2012, with Andrew as a tour guide.  One of the mo","useful":0,"cool":0},"xpi19d3sFM6Q_dIAr7JWwA":{"text":"If this review was solely on the tour guide, it would be 5 out of 5 stars.\nI already poste","useful":1,"cool":2},"fW8RIqutTHXBufvuOZkO8w":{"text":"Being here for a long weekend, we went to 3 different tours! The 5-in-1 is best for someon","useful":0,"cool":0},"AdoUkugnXuf9GP4wRRMgwQ":{"text":"It's pretty rare that I ever try to give negative feedback about something we experienced,","useful":6,"cool":0},"ovywtg6xpRaK3hTjEpJ4Kw":{"text":"Awesome tour! Our guide had so much in-depth knowledge of the city and spoke with such con","useful":0,"cool":0},"iyNhZOFD9EMxmKfdcTwbsw":{"text":"When I say that the haunted history tours are worth every single penny, I mean that I so t","useful":1,"cool":0},"h0xT56uMCUqsfRXRXY587A":{"text":"Took Ernie's Cemetery Tour here in New Orleans, very entertaining & informative would go t","useful":1,"cool":0},"HxYF1olRK-hinyT9OoDnhQ":{"text":"I LOVED IT. We went on the French Quarter Ghost tour and I had the best time with Lisa as ","useful":1,"cool":1},"xcw7fpco4gak4JphVfgz8Q":{"text":"My group had Trent which is very knowledgeable and animated. Please expect to walk and sta","useful":0,"cool":0},"oqv7uzTIviRfFqrR3Xb7aw":{"text":"Hands down best tour!  Get Ernie. He was fantastic!  Lots of great stories and entertainin","useful":3,"cool":0},"wfEJYdsmJ9_v3XHokU2e3g":{"text":"Our tour guide Lucy was a fabulous entertainer that kept our spirits up despite the hot te","useful":0,"cool":0},"S0hBcH_QKnuRd3xVNXYQCA":{"text":"Really enjoyed this tour! Found a pamphlet at the Museum of Pharmacy (also amazing!) and d","useful":1,"cool":1},"JDRPV3_fjnyZL7xCCUkbPg":{"text":"We truly enjoyed the 5 in one ghost & mystery tour.\nTrevor was an amazing guide!! he was s","useful":0,"cool":0},"pAA6GTVX3iyv5D0MiGm6lQ":{"text":"Randy, our guide, took us on a two hour ghost and vampire tour one evening in the French Q","useful":1,"cool":1},"UNTLo9f4nGiVp_glw3iuXg":{"text":"Loved the tour!\nHoped to get a cemetery tour included, but our guide Trevor was awesome an","useful":0,"cool":0},"EJWJR8cjWlhO46UdQl8Rew":{"text":"This tour was exceptional.  Our tour guide, Trevor, was funny and knew his facts.  He pres","useful":0,"cool":0},"OaVA4rE7sq0SrvN1JxGDTA":{"text":"We had Eugenia for our French Quarter Ghost tour and she was great! So animated and intera","useful":0,"cool":0},"lDvqGxGigUM01iflv2rU5w":{"text":"So, I do a ghost tour pretty much every time I go to New Orleans, and must admit, I was ki","useful":1,"cool":0},"9e4dV67fIdEA8_Dxrts_MA":{"text":"The tour has some history but our guide was very long winded and gave his opinion of telev","useful":0,"cool":0},"bvIxHJTB1X4OaNqz4NlXug":{"text":"I really enjoyed this tour! I think it was as good as it was because our tour guide, Lucy,","useful":0,"cool":0},"ckulHWSh__xKli3Q9K6QBg":{"text":"An amazing tour! We really enjoyed it and loved Eugena's tour. We highly recommend it if y","useful":0,"cool":0},"_KbEcRiRVPBGJAPZU8i7PA":{"text":"When we planned our trip to New Orleans a haunted tour was on our to do list. After readin","useful":0,"cool":0},"3t9T8udHQgKahoEccVjH0A":{"text":"My group decided to go on the Haunted Bar Crawl since I had been on the Haunted History to","useful":2,"cool":0},"bPDflQEyoIsT7C8IfmosUQ":{"text":"This tour was pretty fun and started in front of Reverend Zombie's Shop on St. Peter Stree","useful":8,"cool":5},"tgWlMS5lWUCkZ5XFJq-YAg":{"text":"Terrible tour, we left after an hour. In that hour, they showed us only 2-3 buildings. The","useful":1,"cool":0},"oUSO2-e7K6d4HTBGi0fQWw":{"text":"We did the ghosts tour of the French quarter. Thought this was a very cool and informative","useful":0,"cool":0},"XqOoapIJXG9OmalAR_31ow":{"text":"Took the Garden District Ghost Tour with Mikko and had a great time.  He really seemed to ","useful":0,"cool":0},"RyE5qB4ch8BP9R0VwfnGsQ":{"text":"This was fun! We did the 5 in 1 tour and our guide was great, amount of walking and talkin","useful":0,"cool":0},"6_6t2Plqu8O9jB2ymqtENA":{"text":"Had the amazing pleasure of walking through the streets of the French Quarter and learning","useful":0,"cool":0},"mPQVySEb_8VD5TGMP-VFww":{"text":"Price and availability were good.  Our guide Marilyn was animated,  informative and entert","useful":0,"cool":0},"-ldT-6TFwAsSeIZ7KBqkGg":{"text":"We took the ghost tour through the French quarter.  So much fun!  Very informative and kep","useful":1,"cool":0},"vNzQ1lgNHyQAVlOdfCXYtQ":{"text":"Great tour!  We booked the Garden District tour and spent a wonderfully drizzly January af","useful":0,"cool":0},"SMa5ScoCy_IeFIxbXH2AwA":{"text":"My friends and I booked our tickets ahead of time for the haunted history tour and showed ","useful":2,"cool":0},"ULxdoUEMMb23rPb-qqr6DA":{"text":"Our guide Trevor was very knowledgeable about the area and gave a lot of history of New Or","useful":0,"cool":0},"1h10Jl4M9coG7tk7GGwOvA":{"text":"My fiance and I were pretty disappointed with this tour. Disappointed enough to walk away ","useful":1,"cool":0},"7hW2hvJoUeWpbTVWIcFz9g":{"text":"Went on the Vampire Tour with Jonathan tonight and it was great. Lots of fun, lots of hist","useful":0,"cool":0},"FPTlb4MnwOdGqXJC8afnYw":{"text":"My girlfriend and I had an amazing time. It was our first time in New Orleans so we decide","useful":0,"cool":0},"09unu_C_7bO3TLhd5oaY6A":{"text":"I really liked it and u recommend the cemetery or all in one tour.really happy with it","useful":0,"cool":0},"mubRmKNez5skTVwEn6cZsw":{"text":"The tour itself was very good. Our guide was fun and knowledgeable and you could tell she ","useful":0,"cool":0},"wGRYOwBZuofr432CW72jIg":{"text":"Group size tour big and to much noise to hear what was being said I could have stayed in a","useful":1,"cool":0},"OaQbjL9UVpsSfLcQvqTnlA":{"text":"I am beyond glad we signed up for this guided tour of the St Louis Cemetery #1 - Our tour ","useful":1,"cool":1},"789doNHX8fjuAiJLOQUGRw":{"text":"I recently took the new Underworld Tour with Jesse. I thoroughly enjoyed it. The informati","useful":0,"cool":0},"yVtYHY7T13R7G5bTpSAcBA":{"text":"Make sure you have Andrew as your guide for the Ghost Tour and you will be treated a world","useful":3,"cool":1},"d82ZlJOBhuDdt9T4SYd5ow":{"text":"This tour was so much fun!  It was a great introduction to the French Quarter and the guid","useful":1,"cool":0},"7EizL3eCbBcS8GyPHIUwaQ":{"text":"My husband and I decided to do the Haunted Pub Crawl on our last night in NOLA. It was def","useful":1,"cool":0},"pI7N_oiB4Hg4bvrOfH-5pg":{"text":"Lisa, our guide made this the most amazing experience. Part history, part criminal facts, ","useful":1,"cool":1},"_4I88aTMGbvKhW-3PWCuTw":{"text":"Really lucked out and got Toast as our guide. A wonderful story teller and history buff. L","useful":0,"cool":0},"xmTW-0r_R3G14OxDvljlHw":{"text":"Absolutely LOVED our Haunted Pub Crawl! \nWith bad luck and a lost Uber driver we didn't ma","useful":1,"cool":0},"-DSOKdMWa_azAiH8jWfUZg":{"text":"Went on the French Quarter haunted tour. I do not believe in ghosts but it was amazing any","useful":1,"cool":0},"a9gLCtSjUiO7CkCMUrC-Ag":{"text":"Took the New Orleans Ghost Tour for 2 hours and the tour guide took us to 2 different bars","useful":0,"cool":0},"yGoVYGj5xLYH_3_wygQlKg":{"text":"This was not haunted in the slightest, and in fact, most of the stories weren't even ghost","useful":0,"cool":0},"JoDUVjeJEalKr9N2ZI-38A":{"text":"We really enjoyed our Vampire with our tour guide, Natalie. Lots of interesting stories an","useful":1,"cool":1},"Bjyg097LNLpeqRL0SB0YFg":{"text":"I loved it!  You can't really complete the typical New Orleans tourist experience without:","useful":3,"cool":3},"eUWEveF03mVUrvcFXmH_PQ":{"text":"Me and my best friend went on the 5 in 1 mystery and ghost tour. The tour was almost two h","useful":1,"cool":0},"tnorKIqx2uJkc958wNuh3g":{"text":"Lisa was the most fabulous and captivating vampire tour guide! The way she tells the histo","useful":2,"cool":1},"wtFQtbsQ3F-kFOckyOXjcw":{"text":"We took 2 tours both great but I want to focus on the 5 in 1 tour, our tour guide Lisa was","useful":1,"cool":1},"kTudliDnJMvqzN8jlAACFw":{"text":"I'm a fan of the macabre, so I definitely wanted to check out the historic cemeteries in N","useful":4,"cool":0},"9e3ExvvKqRxZYgFfoCU24w":{"text":"Mr Jack could literally be a ghost himself. He made the experience so good, and as a skept","useful":0,"cool":0},"8uEW4JbWwGoS9su6txbO1Q":{"text":"I thought this tour was ok...the tour guide gave us some information but not much but hey ","useful":0,"cool":0},"d-c7QZL0nuiusr47nmCnKw":{"text":"Fun tour.  Renee did a great job and enthusiastically explained the history of above groun","useful":0,"cool":0},"cRkgT5Hy_68gsU6HyHsMJw":{"text":"Took a Tour with Drew. He was a amazing!! So theatrical. This is my second tour with this ","useful":0,"cool":0},"BKxEz30EN42ST-govSVjWg":{"text":"Took an afternoon ghost tour with Matt during a bachelorette trip. He was AWESOME! We got ","useful":0,"cool":0},"Bs2RgDQlbiNGY7hE1-Of6g":{"text":"First trip to New Orleans and first ghost tour. Natalie wad great, really had a good time ","useful":1,"cool":0},"P_BFueL4cFhKMPAgrakq1Q":{"text":"Tour was freaking awesome! Always nice to gain some knowledge from someone who actually kn","useful":2,"cool":1},"EDOO8YCxvW33KbpoCiziVA":{"text":"My husband and I booked two tours in advance for our trip to NOLA. After our first tour wa","useful":1,"cool":1},"mwYoBl2iCGrfiMjr7fD5Mw":{"text":"The most important thing to know about this tour is that it is a historical tour, not a sp","useful":0,"cool":0},"lFfcve-prT6mDuf1qiEkqw":{"text":"During our week vacation in New Orleans, we took three tours with Haunted History (Cemeter","useful":0,"cool":0},"wCI6SjORHVVETWN9GC9J6Q":{"text":"My 9 year old son, 9 year old niece and husband took the tour.  Their guide was Jonathon. ","useful":0,"cool":0},"VQsiBKQDzinB5ZghgWUxOA":{"text":"Hearing how haunted and spiritual New Orleans is, I was so excited to go on a haunted tour","useful":0,"cool":0},"NflILyCCJ-YOrlakWgJw3A":{"text":"Three of us took the Vampire tour and it was fantastic the tour guide was originally from ","useful":0,"cool":0},"UZGLfxJrhGS0DIx9lM0r5g":{"text":"I went on the haunted pub crawl, and I really enjoyed my time drinking and listening to th","useful":1,"cool":0},"kuV_OBFItaYNstdULJZBfg":{"text":"I loved my experience. Guide Andrew was wonderful. Emphasis on History here, including gru","useful":0,"cool":0},"Z8V7RVb-cmnT-vTUlcVX4A":{"text":"Went on the New Orleans Scandal tour on a Fri night.  Small group but the guide (Kent?) di","useful":0,"cool":0},"neMw97tu5JQu0PsKdlxq2A":{"text":"What a fun tour. Daphne was our small groups guide. Her style was more story teller than t","useful":1,"cool":1},"CKqGI3pzsM5swxolPzGzmA":{"text":"This was such a fun time! I got to learn a lot of new things about the city, not just abou","useful":1,"cool":0},"P5yGgJc6GOVCQqStJuwM6g":{"text":"Took a few tours of NOLA and none compared to the one I took with Haunted History Tours. J","useful":1,"cool":1},"W4CMQtM-0lKJ99YSG3a5WQ":{"text":"I took two tours with them! The 5 in 1 French Quarter combo tour with Trish and the cemete","useful":0,"cool":0},"8fVZL4TH0lSRwG4ZrsG2wg":{"text":"We did The Vampire Tour with Lisa and she was INCREDIBLE. \nThe tour was a good mix of spoo","useful":0,"cool":0},"uMRJlhMqMh-77_YnZZE9sQ":{"text":"There aren't enough stars for the tour and Ernie...our guide. Ernie was very articulate, k","useful":0,"cool":0},"Q5HYEyo_VjIPcd2K5PEDvQ":{"text":"Woohoo! This was a great find. Had a blast on the French Quarter Ghost Tour. It's a walkin","useful":0,"cool":0},"WxrQc0vD14lkbZvg17Y7eg":{"text":"The tour was great! Pam was awesome - full of great stories and had a great sense of humor","useful":2,"cool":1},"QNLjm-_5gHRq6VyrcikJxA":{"text":"We loved this tour. We had a great tour guide and lucked out on a great group of people. I","useful":1,"cool":0},"T67XXz1VFK2Uya2n5stwvQ":{"text":"Just went on the vampire tour and it was amazing! You don't have to be an avid vampire lov","useful":2,"cool":0},"RLnVWm5d8aL_Q4Jg-LaqFA":{"text":"We did a 5 in 1 haunted history tour on a Saturday night. The group The Reserve was so lar","useful":0,"cool":0},"edREGhiJiN6RV_gqHLleUQ":{"text":"Did the 5 in 1 tour. Voodoo history and story of the creepy dentist hypnotist was the best","useful":0,"cool":0},"iSuKXxJBmZGVe33eOIgEoQ":{"text":"This was my first trip to New Orleans and this tour was a must do! Toast was our guide and","useful":0,"cool":0},"LoiweJywlcmKLC9A_D4tDw":{"text":"It's very interesting , if you like to listen to some interesting old horror story go ahea","useful":0,"cool":0},"rgOhkTQ3yyI-NlbLEDt-kg":{"text":"My friend and I took a trip to New Orleans and booked the 5 in 1 tour and it was amazing! ","useful":1,"cool":0},"ukudCG5djIIajhDM3IPbdQ":{"text":"Tour was great and so was our guide Kyle. Highly recommend. Didn't feel like 2 hours becau","useful":0,"cool":0},"g5chJP9-WkDWCot4cbjjkw":{"text":"Our tour guide Drew is a funny and charismatic guy who knows how to entertain his audience","useful":0,"cool":0},"S-VxMtxhPNbd9vynpd4kyA":{"text":"Went on the cemetery and walking Garden District Tour. Our guide, Katie, was great! She wa","useful":1,"cool":1},"on30zEBc9Q-KquV_nFgf8w":{"text":"I did two of these tours because I enjoyed the first one so much. The tour starts outside ","useful":0,"cool":0},"1AQDr_hRXGyPlPInOkIl_w":{"text":"I've always wanted to do a haunted tour and finally got my chance during my first trip to ","useful":0,"cool":0},"Gq6fZd09FI0HQy2uR3lqEQ":{"text":"So....\n\nLet's start off by explaining the deal that these companies have with the other co","useful":0,"cool":0},"2ltTmOCh2mgae2QtqgcdTA":{"text":"Lucy.\n     Had the pleasure of having Lucy guide this tour.  She made the tour interesting","useful":0,"cool":0},"L5EagN27b5zQSqgOFsOlVg":{"text":"The tour was entertaining, we were disappointed that when we went home my wife looked up t","useful":0,"cool":0},"7Qafa4GDXF7_CXN6K4rBQQ":{"text":"We really loved our tour guide Drew. He was a wonderful story teller and was very knowledg","useful":0,"cool":1},"3VmAaNRaBfhenns6-c5oPQ":{"text":"My friend and I went on a cemetery tour today. Our tour guide, Drew, was fantastic. He was","useful":1,"cool":0},"LkN9qj37fzkh2wt0SVcFDQ":{"text":"We did the 5 in 1 tour that gave you a sampling of scandal, murder, mystery, hauntings and","useful":0,"cool":0},"7P12xg-teiIf7tBv_AhnfA":{"text":"I totally agree with Christy B.  I wasn't totally sure I was going to enjoy a 2 hour walki","useful":0,"cool":0},"imBcqBqYgXuAIrSyLi3J_g":{"text":"Our guide was Len. I felt like I was on a tour of movie locations and places the guide fel","useful":3,"cool":0},"cPn7PRzStu2lZJEtfLbIXQ":{"text":"We couldn't have asked for a better guide or experience! Ernie was fabulous! Funny, witty ","useful":0,"cool":0},"LgW8fPfMB8oPcsCAKCZYbg":{"text":"It was extremely exciting taking a 5 in 1 tour with Kyle and learning about the history of","useful":0,"cool":0},"7IbtQDQYt1ZUvB-m4az2dg":{"text":"This tour was nice and spooky. Telling us all about the things that go bump in the night i","useful":0,"cool":0},"yXHp1M7rKzWjcQr1QPcryg":{"text":"This is the second time we have done this tour. Fair warning: it's so excellent that any o","useful":0,"cool":0},"MUwph-sK-PzpH5IW10JygA":{"text":"Both times I've gone on these tours they have been incredible entertaining and fascinating","useful":1,"cool":1},"MkNSJWbLrDEUtfh5waGAQw":{"text":"This tour sucks. The guide we had was not that great. She talks while the whole group was ","useful":0,"cool":0},"fNUimNU5U8GHdO2EM16rbQ":{"text":"OMG! All they do is make you walk around in the scorching heat while they point at houses ","useful":0,"cool":0},"XLVa0Qxq4zwtdL4i6UYpMg":{"text":"I honestly think this was a great tour! Our guide Wendy was wonderful, very animated and f","useful":2,"cool":1},"CPbuQz5Tmidhm5i6WS_h6g":{"text":"This was horrible. First we spent 90 dollars to drive around hearing about towns history\n ","useful":1,"cool":0},"9-Bx0A_LF-3qPRa2pmiqjw":{"text":"Me and my family did the five in one tour for 25 dollars here and I was really disappointe","useful":0,"cool":0},"ocQteEH5BEBCFcySwxJPxA":{"text":"This is my go to tour company in New Orleans.  Over 4 trips to New Orleans, I have been on","useful":1,"cool":0},"1JHN-aPQwGj3zjFDhU3YGw":{"text":"Absolutely phenomenal tour.  We lucked out and the weather was absolutey perfect for an ou","useful":0,"cool":0},"o06EFRdiHb8x5kWe8-wy9A":{"text":"The New Orleans Cemetery Tour was fabulous!!!! It was pouring rain but Ernie the tour guid","useful":0,"cool":0},"TxvY57dZ3y2qnbmiuE376A":{"text":"Ernie was excellent!! He is so knowledgable about New Orleans and made the afternoon a mem","useful":0,"cool":0},"NUHSeFCCr5sYuxjZq-iLSA":{"text":"We purchased the 5 and 1 tour with Daphne. She is very knowledgeable and a great guide. Ho","useful":2,"cool":0},"3QJvEm3QXQfnHmgIVhYnng":{"text":"I did the ghost tour with Carla and she was fabulous! in fact she was so informative we di","useful":1,"cool":1},"LpssXLBrbITaIf4LVkuLMg":{"text":"Ernest was the best! Gave us some recommended readings to check out after the tour. Guy kn","useful":0,"cool":0},"5hviyKqHernGTL82F5mmlQ":{"text":"Very entertaining! Ernie is the best! Remember to bring water though, it is super hot in t","useful":0,"cool":0},"QD8qG7BTsXi4_vMv-_xcXw":{"text":"Vampire tour was a waste of money., stories were way too long.. Didn't see much.. Can't be","useful":1,"cool":0},"Cnh79kOnSe7OBcTl_efnwA":{"text":"Loved this tour. The guide made the tour what it was, entertaining and informative. Andrew","useful":0,"cool":0},"D5evhkT4Ecioopg39vcVHg":{"text":"My husband and I searched the web and other peoples' reviews to get the best bang for our ","useful":0,"cool":1},"sAd9qV1L2W_BlMMyvSPMcg":{"text":"Having been to New Orleans just a year prior, I recommended to my group that we do the Hau","useful":0,"cool":0},"2a6CHYh2Jbx3nnY58gEIsg":{"text":"Our tour guide was Kalila Smith, who also wrote the book, \"New Orleans Ghosts, VooDoo, and","useful":3,"cool":1},"AwF0qo3dH8dQL3en5EZijQ":{"text":"Tour starts in Jackson Square, 768 Decatur St. We were a little confused, but arrived earl","useful":0,"cool":0},"WSRDWOSfXLSkN2YYVIOMvA":{"text":"Eugenia was a very cool tour guide. I did he garden district tour and it was very informat","useful":0,"cool":0},"Jsg8T_WAa915zVikPZ0WdQ":{"text":"My friend and I spent our last night in NOLA on this tour and it did not disappoint! The t","useful":0,"cool":0},"N0fohngigRUUogDEFdqISw":{"text":"We did the cemetery tour and were disappointed. Too much about partying in New Orleans and","useful":0,"cool":0},"87buGWhPjSgx3_kGNuEoXQ":{"text":"Tour guide was good, but this tour was the first thing in NOLA that we found was a waste o","useful":1,"cool":0},"RmtErF3R-TLJmyXrT6cIhw":{"text":"We enjoyed our tour of the garden district with Drew! He was very knowledgeable and articu","useful":1,"cool":0},"w22lSIpYnt-elnv20Ehx9g":{"text":"Not worth it. The only thing scary on this tour is that you might die of boredom. Our grou","useful":0,"cool":0},"2jj6tT4DRfvjJAieHLhpwA":{"text":"Loved it. We did the 5 in 1. Trevor was extremely knowledgeable and kept us on our toes. H","useful":0,"cool":0},"ZAciWWDTIuSOKlVf5CkjMg":{"text":"Very fun and educational.  Love the fact that our tour guide made it fun but also respectf","useful":0,"cool":0},"Sx2GuT-w4aGt1Js22q-Ezw":{"text":"Ernie ROCKED our tour!  We went on the French Quarter Ghost Tour, and it was worth every p","useful":0,"cool":0},"kCE75bz4Sy0KAeP3qfMXCg":{"text":"Fun and informative tour leading from the French Quarter to the St. Louis cemetery. Ernie ","useful":1,"cool":0},"tqGSgjf7itTiLFj62EHSMw":{"text":"This was the best ghost tour I've ever been on (granted only went on two others in Edinbur","useful":0,"cool":0},"sLXqlwQu63Tg4qT_p37rDw":{"text":"awesome tour for a NOLA first timer!  i was excited to see the cemetery and pleasantly sur","useful":1,"cool":0},"Hnf8MytMh0Ei3rFzER-hdg":{"text":"The 5 in 1 tour was meh. The guide was funny, but thin on depth. He did call it a \"poo poo","useful":0,"cool":0},"dqGhRpF7G4hayuFTKOeSRw":{"text":"I thoroughly enjoyed this walking ghost tour. Mind you it was 40° F with a wind chill that","useful":2,"cool":0},"KecRH0d9TTAYK7V7vCJbDA":{"text":"Took this tour when my dad came into town for a visit, just to kill time. \n\nIt's not parti","useful":1,"cool":1},"GTp0qXhmMfy3hKk-CZ69EQ":{"text":"We decided to do a Haunted History tour with an out-of-town guest since we'd never done a ","useful":0,"cool":0},"LW6FGOnA5xzyHweZW8W-nA":{"text":"Ended up in a relatively large group, but everyone was great and the tour guide, Ari, was ","useful":0,"cool":0},"2HgTOoqtbsW-ObIZr7G9eA":{"text":"Went on the Ghost & Legends tour on a Friday night with my boyfriend. Marilyn was our guid","useful":0,"cool":0},"vSvVgCit0jIu98GA2agdnQ":{"text":"My wife and I took the 5 in one tour on our first visit to New Orleans. Our tour guide Tre","useful":0,"cool":0},"5biStrZiWtd0DmUfUmd5-A":{"text":"Trevor \nWe took a tour today with Trevor as out guide, he was awesome ! \nHalf way through ","useful":0,"cool":0},"m1hit0xFrVe_9M-RM6u4Iw":{"text":"Not worth it! We were interested in learning about strange deaths and hauntings in the Fre","useful":3,"cool":0},"MEM6WOJpZsflZa_jbDPFBg":{"text":"OK, this was fun and I recommend it -  but with reservations.  You're going to get a good ","useful":0,"cool":0},"ZU2ugvxm0YQN2mBT5BRh8A":{"text":"My wife and I took the Garden District tour with guide Jesse.  A great way to spend  two h","useful":0,"cool":0},"_LSoKPInVOmEeZV8hhsWjw":{"text":"Our guide was amazing and really knowledgeable about the voodoo religion. It was definitel","useful":0,"cool":0},"5ko0TSN7JIA2SIFNEe5JWw":{"text":"I was really looking forward to this tour and learning more about NOLA's haunted buildings","useful":1,"cool":0},"u7OC6qQuqHHXO5iPE8iyZw":{"text":"Ernie was amazing! He's really good at his job - it was at least 900 degrees the day of ou","useful":3,"cool":0},"02RSjFBPR2BSSg9EIx4-7g":{"text":"I just went on the Garden district tour and Jessie our tour guide was awesome. He was very","useful":1,"cool":1},"MFxofaAmqJye28fSeQmqPA":{"text":"I was very excited going into it, but there is not a lot to see on this tour.  We were bor","useful":2,"cool":0},"s2LMhd2ROIb3wT4pUWBW1A":{"text":"Just got back from NOLA! Did the Ghost Tour. Great information, great entertainment. Wear ","useful":2,"cool":0},"IIEDquWbs-zZSVYI-offuQ":{"text":"Horrible! Care about $ more than customers. Pushed aside people with tix to sell more. Rui","useful":0,"cool":0},"8s3hvFnyTlV15dJkM4n95g":{"text":"As a tourist and someone who is interested in ghost and vampires, I loved this walking tou","useful":1,"cool":0},"2HRYQK3PfV2VLjOd_hZRIQ":{"text":"Ok, so maybe not the best weekend to take a tour of the French Quarter.  The tour started ","useful":0,"cool":0},"o5XxNMFTWaOmU9qTNLO23w":{"text":"For $20/person for about 1 hour and a half (break for 15 minutes), it may be worthwhile bu","useful":0,"cool":0},"rfe2b0qdGOvT89UdXtdHaQ":{"text":"Lisa led our tour. The tour is an hour and a half, and well worth it. Don't expect a hokey","useful":2,"cool":1},"3j14RHnWoxDk_9oefhqHDQ":{"text":"Lucy was our tour guide, she was ENTHUSIASTIC and a wealth of knowledge.  I love walking f","useful":0,"cool":0},"7r30bVh1k_NOrcfE5b8Vjw":{"text":"Had a great time doing the Vampire tour. Our guide Gwedyon (sorry if it's misspelled) ende","useful":0,"cool":0},"AvWX1BCbQYeEMzmnT9gPfg":{"text":"It is what it is. Keep in mind, it is not an accurate or informative historical tour about","useful":1,"cool":0},"wxCchYWHTDQ8OIrbGf7Unw":{"text":"My wife and I along with two friends took the tour last Thursday.  The tour was very inter","useful":2,"cool":0},"SPRV0CEFCb46P3kpNo3vrw":{"text":"Daphne was our amazing tour guide. She tells you all of the fun and interesting history, h","useful":1,"cool":0},"JZh3LHpykHXqIEHNkC-yMg":{"text":"I really really want to like this tour.  I mean what can be more fun than a haunted histor","useful":0,"cool":0},"zbwWPmaX-uGUix8R17CcVw":{"text":"We took their Garden District Tour hosted by Carla.  Nothing haunted about this tour but C","useful":0,"cool":1},"qblYSEf2Iwpm0cW8uaJvgA":{"text":"We took the 5 in 1 tour that was meant to combine the ghost, vampire, etc tours into one. ","useful":2,"cool":0},"EhYMOS3FJAyQHgmgPfcJVQ":{"text":"We went on the Ghost and Graveyards tour with Brent. What a great tour! Brent was entertai","useful":0,"cool":0},"yBFF8HhjgRox_cixHiagjA":{"text":"Eight of us took the Ghost Tour with George on Sunday night and had a great time. Half of ","useful":0,"cool":0},"mAsOiIAly5rWN1PeGDRR-Q":{"text":"On our second day in New Orleans we did the 5 in 1 tour. It included vampires and ghosts a","useful":0,"cool":1},"kNDAS596Yo9sVfTPTSGxFg":{"text":"We took the Ghost tour one evening and we had fun.  Our tour guide was very animated and s","useful":2,"cool":0},"PpLfKrlWs_nFLNGvemcoAQ":{"text":"The haunted pub crawl is a \"must do\" when visiting New Orleans. Kyle the tour guide was gr","useful":0,"cool":0},"1Mnp6LLy2EEN4SJ65vTg6A":{"text":"Cool history..\n\nLonger than I expected and you have to pay attention \n\nLarge touring group","useful":1,"cool":0},"--8oLoe0L-htbjSBpS5osw":{"text":"My favorite part of my visit to New Orleans. I went into the tour expecting to be scared o","useful":0,"cool":0},"X0BEKc1yTvSTF-DX4LfnjA":{"text":"The storyteller was very long-winded.  (Skinny guy with a tattoo of some guy hanging from ","useful":0,"cool":0},"uFwKyHCuhj9MPNUEOj5BDQ":{"text":"We did the haunted ghost tour in the French Qtr when we were here six years ago so this ye","useful":1,"cool":0},"Or3Tiws8tHBFUp6Dg5JO5w":{"text":"Two of my friends and I settled on the 5-in-1 tour. We all loved our tour guide, Stevie, a","useful":1,"cool":0},"C4myWiOZyY62WtMg2TDPxw":{"text":"Took this tour on a night when it was lightly raining which added to the spookiness. Our t","useful":0,"cool":0},"hMF-HnXkRS6bMZCUunuWSg":{"text":"Very very cool! A lot of history! The guide (drew) was amazing! Kept me laughing! A must t","useful":0,"cool":0},"eA5AnRXYMFMeslGJTBk5xw":{"text":"We were soooo disappointed in this tour! After all the good reviews we were amazed. No gho","useful":0,"cool":0},"wIeJ0G0jFoaUEbTMHTtUEw":{"text":"This tour is a waste of time.  You don't go into any buildings, just a cheesy toy guide gi","useful":0,"cool":0},"hCPyywBctb0C0UnZZG721A":{"text":"I took the Cemetery tour first with Haunted History, and enjoyed it so much I took the Gho","useful":1,"cool":1},"VfDe4jWdp66ERFQOWM5Y9A":{"text":"Good fun safe entertainment for the kids at night. No cheesy jump scares and the stories a","useful":0,"cool":0},"vgEGtDSP8RgK0C1FRYJeXw":{"text":"Don't know what I expected but for 25 bucks, this was whack.  At least my hurricane was de","useful":2,"cool":0},"9ftyOB0J9vYxfiDqUwwz4w":{"text":"According to my nine-year-old daughter:\n\nThe tour was awesome and sort of spooked me out. ","useful":0,"cool":0},"eZI7IiZfuIJy5iVMQBICag":{"text":"It was \"okay\" they took us to the dungeon which was the name of a bar- it was cool except ","useful":0,"cool":0},"_WEUG8JmokoLWLm9piUdsQ":{"text":"Excellent tour! I have been on the Vampire tour at least 3 times. One ghost and a cemetery","useful":0,"cool":0},"OJSfLFFL_fsxk-4UG3Gd5A":{"text":"My friend and I enjoyed this tour a lot, but don't be deceived, it's all about history and","useful":0,"cool":0},"2vfD7LGnk-rcS12Sw8UITA":{"text":"We did the 5-in-1 tour with Trent as our guide. He was an absolute joy and full of great h","useful":0,"cool":0},"pjgGT5xgi_ZUgXX3NXvHJQ":{"text":"Daphne took us to the St. Louis Cemetery 1 and we had a great time, learning more about NO","useful":0,"cool":0},"oM4FLBB_8GUskAJ86oW5KA":{"text":"Just went on the vampire tour and our guide Wendy was lovely.  She was personable and live","useful":2,"cool":0},"A0YX8iK1rzvX9ZXUShN32w":{"text":"The hubby and I opted for the 5 in 1 ghost tour during our trip here this weekend for his ","useful":0,"cool":0},"8yDvEKMqN3p9XiOF0VUSRQ":{"text":"I cannot even explain how excellent this tour was. Drew was our guide for the walking tour","useful":1,"cool":3},"ZRyI69ScAFmC9_KVG-zkoA":{"text":"A very informative and fun way to spend 2 hours.  Ernie is a wealth of knowledge and gives","useful":0,"cool":0},"ZGAXLKfnDqr78w9NLqeVUA":{"text":"TREVOR our tour guide was horrible! He basically talked only about himself! He was so weir","useful":1,"cool":0},"ki0LlelnMVIGVP3ZzdmmWQ":{"text":"My girlfriends and I spent a couple hours on the haunted history ghost tour on the night o","useful":1,"cool":0},"vPNBPCIhmKO1sg9yCPmP5w":{"text":"Our guide, Lisa, was very knowledgeable and very entertaining! My love for history and the","useful":2,"cool":0},"aVaja7DHdFdyz88_wTUwrw":{"text":"A great tour to learn about the history & culture of the whole city, not just its cemetery","useful":0,"cool":0},"Ac8dOpP6OByeNynepC_JPw":{"text":"We did the 5 in 1 tour. Lots of history, but not really intregueing. We did the vampire to","useful":0,"cool":0},"AyNWlHltTw20Z7JZPMD1Kw":{"text":"If you don't mind walking tours and sometimes braving the temps to do so, THIS IS THE TOUR","useful":2,"cool":1},"2KM7UkzEp_hXrprGWFqLTQ":{"text":"Did the Vampire Tour with Adam and he was fantastic!  Fascinating stuff, especially the st","useful":1,"cool":0},"35cL2e5cAEK5Nz_cqtZqcg":{"text":"Pretty disappointed in this tour. As many say the guide makes or breaks this tour... Unfor","useful":1,"cool":0},"AYy0YTH8x1XFbif2m3ziNw":{"text":"There is nothing haunted or mysterious about this tour. It should be called Celebrity/ mov","useful":0,"cool":0},"tVmJA7tFwCIDIju6Sc6sFA":{"text":"Lisa, our guide for the Vampire tour fit the part perfectly.  She was knowledgeable and en","useful":1,"cool":0},"zFmEpIHdPDq0QwLNCQGLfw":{"text":"Informative! But not too many ghost stories...\n\nWe had a guy named Miko (not sure of spell","useful":1,"cool":0},"JFpc7a9avDomR4baPdCEjQ":{"text":"Ray Glass was an excellent tour guide, very entertaining and knowledgeable. Highly recomme","useful":3,"cool":3},"PpVF_jix5aPVgQFXcgLXCA":{"text":"I came to New Orleans for the very first time.  My friends and I thought taking a ghost to","useful":4,"cool":1},"QgWqbiyBAGWu1UVybmq0dQ":{"text":"$20 is way too much when you are walking around for two hours and never get to actually en","useful":0,"cool":0},"BFk_wBkYsWpTy9CdAXuvWQ":{"text":"We took the Voodoo tour. EH!   The guide was full of \"jokes\". He took us to a fancy schman","useful":1,"cool":0},"mVxMHcGWZQ92RpfC7BzacQ":{"text":"There are many things that I absolutely love about New Orleans.  I love that you can order","useful":17,"cool":9},"b-gZ1TpcsdODezqOnr4CHg":{"text":"Lucy was our guide and she did a fabulous job of capturing our attention and bringing the ","useful":0,"cool":0},"PxW6Jgv32wzcADV1IuS_lA":{"text":"We did the 9:30pm ghost and graveyard bus tour. Pick up was well organized and we were all","useful":0,"cool":0},"QGWO4QhT-xzgUPF_41l46g":{"text":"We did this tour on Sunday night during Mardi Gras. It was a highlight of my trip, and I a","useful":0,"cool":0},"wB_l8to7w2wkSo8XU3AclQ":{"text":"I highly recommend doing one of these. Go at the 8pm showing because you'll get the full f","useful":0,"cool":0},"bk7mtso-ziFAOWMlmB2VhQ":{"text":"We took this tour on a Sunday night so it wasn't too crowded.  I have to admit, I was expe","useful":1,"cool":1},"p3w_Ym3VNacLxihnW3wpQQ":{"text":"Worst tour ever,  complete waste of money. Basically walk around for 2 hours and point at ","useful":1,"cool":0},"onE3yd1VIc9cw6682uV8AQ":{"text":"Just finished our vampire tour with Lisa and it was definitely well worth the price of adm","useful":1,"cool":0},"TP0muXYHlACsOSl3Sgeo2w":{"text":"So glad my dad and I chose to go on this tour!  I am not one to buy in to the tourist tour","useful":2,"cool":0},"gRSOr8OpQ6lEfdJ9qPWsTw":{"text":"This was a GREAT tour! I really enjoy tours like this. I must warn you that it is quite a ","useful":1,"cool":1},"C90UxL6j2Q16Zt2wnkvuiA":{"text":"I have no idea why this has such a good rating. There were no ghost related facts on any o","useful":1,"cool":0},"HHWRA-xy9R_HYdXKRe_czA":{"text":"Lisa was a great guide!  We enjoyed the tour and loved hearing about the history of the ci","useful":2,"cool":1},"HJf-L6aGqOS87AOG7q3zYQ":{"text":"Soooo cheesy, and not good cheesy. Our tour guide was laughably ridiculous and I know ghos","useful":0,"cool":0},"VwYHvKDYorTjEIQthbBYxQ":{"text":"We went in the New Orleans Cemetery tour, it was very informative and gave some unique ins","useful":1,"cool":0},"qmcCygl_BeH_NSiEApw-pg":{"text":"Taking part of the cemetery tour was probably one of my favorite things I did when my fami","useful":1,"cool":1},"X1rSXGAJJDq6SzQh8ZXG5Q":{"text":"The Garden District tour is a MUST see!!\nWe've been to all of the rest and this one knocke","useful":1,"cool":0},"EWEKwPiaQ5D_ejSE1E0Byg":{"text":"As somebody who went to college in Gettysburg, PA I love the spooky tours that each place ","useful":0,"cool":0},"et4HLo1P5xt2qHyLP2qKdg":{"text":"The scandal tour (used to be called underworld tour) was atrocious.  We couldn't even make","useful":2,"cool":1},"s2yTbN1bM9guG6sYc0FbQg":{"text":"Was in new Orleans last week with a friend for her birthday! Took the 5 in 1 tour with Nat","useful":0,"cool":0},"lAMPUKIaywwJD9HaTphhFw":{"text":"Better information than you can get from a guide book. She told us a lot about the burial ","useful":1,"cool":0},"HRnaZlxxOqu0u-pO6MuF-Q":{"text":"Lisa was amazing!! Knowledgeable and a wonderful story teller! I don't believe in vampires","useful":3,"cool":1},"NvLUejW4SnoNtq1WkNmKVA":{"text":"We did the Vampire Tour with our guide George & we had a great time learned interesting fa","useful":0,"cool":0},"cLRdfdZYqUi7p-vNnh0X5A":{"text":"A must-do when visiting New Orleans! Our guide, Christine, was entertaining, informative, ","useful":0,"cool":0},"tJuM037x5K7f4pHzfCwc7A":{"text":"Overall this was an excellent walking tour. \n\nSt. Louis Cemetery No.1 is a big and ramblin","useful":1,"cool":0},"p6pcN5iLXblhMJI2w3u1Sg":{"text":"I have been to many ghost tours!  We actually left this one at half time!  The tour guide ","useful":0,"cool":0},"cWOcyGxjMyhvfePpBc-cpA":{"text":"We did the tour with Lisa and she was amazing. She was clear, funny, and knowledgable. She","useful":1,"cool":1},"As3Is7cLdSaPqSQE4WfLsw":{"text":"I did the French Quarter Ghost Tour on 4/17/18 with Bobby. \nHe did an amazing job with ent","useful":0,"cool":0},"Kzvyvsc4utgnxj-EGXVt1w":{"text":"We were walking through the French Quarter with no plans and wandered into a tour shop. To","useful":2,"cool":0},"3w0709W6tHUyfz3RkH9rUw":{"text":"I think it boils down to who you get as a tour guide -- and unfortunately you won't know u","useful":3,"cool":2},"-EcYc3I9cXzSx6iOErHfJw":{"text":"We went on the vampire tour...not the best. For one, we didn't stop at many sites on the t","useful":1,"cool":0},"PzB7N-64LoO_aawfsm3DDg":{"text":"Loved our punk rock ghost guide Randy, an earnest historian and great storyteller so he ge","useful":1,"cool":0},"q3bXQTcitdKmsn-uzjH2pg":{"text":"Christy was fantastic. Best ghost story teller EVER. She made the tour for our\nGroup.","useful":0,"cool":0},"5nZTpdYQWSVRMba1DK74yw":{"text":"These tours a quality. There are cheaper tours in the Quarter and many of those are just a","useful":4,"cool":0},"414vaGeSU_XD97k6ieYILw":{"text":"DREW was an awesome tour guide!! I'd never been to NOLA. Never gave much thought to the hi","useful":0,"cool":1},"CVEp99zEm0lx0_aN6F-i1w":{"text":"Creepy fun, especially with a group that's thrown back a few rounds of drinks beforehand. ","useful":3,"cool":0},"evndRufY5RlM9lEDewpc_A":{"text":"I had the best time on this tour and would recommend it for anyone visiting New Orleans.  ","useful":1,"cool":0},"6VV9vDcaF7zU8NJ8CXIatw":{"text":"So fun and interesting!! If you don't ask for Len as your tour guide them you are missing ","useful":0,"cool":0},"R7hpkwrIFFk7LeeMieFJgA":{"text":"Ok. I have 3 different reviews. We have spent a few days in NOLA and were interested in th","useful":0,"cool":0},"unxBI2X--_jkMy_Y6eSZcg":{"text":"We took a Ghosts and Legends tour with HHT on a recent trip to NOLA, and loved it! Our tou","useful":1,"cool":1},"FCNSAgj4ByDaLqGtdFrfhw":{"text":"We did the morning tour. Ernie was our tour guide and he was FANTASTIC. A wealth of knowle","useful":1,"cool":0},"I1VdcxMQz36_Owh6OtSm-Q":{"text":"Amazing! Drew was a great tour guide. Love NOLAs history. A bit longer than I expected but","useful":1,"cool":0},"rH0F9t_QyDTjSOONuR3I8A":{"text":"We took the 5 in 1 Tour. Our host Trevor Aubin was totally beyond what I expected. He is a","useful":0,"cool":0},"kFlNv5BqZza2Akzw--YBBA":{"text":"My friends and I did not enjoy our \"Haunted Pub Crawl.\"  Our guide was more Army Sargeant ","useful":0,"cool":0},"YyosxS4qABBGPIG9IobNvA":{"text":"If you sign up for an SOC tour, make sure you get Ms. Renee as your tour guide - she's ent","useful":2,"cool":2},"3Z6LTY3rk0R66LbyqP2jZw":{"text":"We did the vodoo tour and our guide Lisa was fun and was very informative. It was a lot of","useful":1,"cool":0},"KHgWRxDvpVYu_XwCmUHGBA":{"text":"I signed up for this Ghost Tour along with a group of coworkers as we were in New Orleans ","useful":5,"cool":2},"G62ory6G6vSJCMx85vI0jg":{"text":"We went on the Vampire Tour last night and were not sure what to expect.  It ended up bein","useful":1,"cool":0},"KML9cSEIUpfbIadz9Q9WZQ":{"text":"I just took this tour this morning and I am so glad that I did!\n\nWhat an amazing job Renee","useful":2,"cool":0},"bn_1qLN2TZQKGsXHLzaENA":{"text":"Went to NOLA for my bachelorette party, and aside from the food.. this was the best thing ","useful":0,"cool":0},"PcrZ-HC1fhtp_0NTD5bcxQ":{"text":"The voodoo tour was quite interesting. The tour guide was very effecient. He explained the","useful":0,"cool":0},"J6npis1madZttZvMUcA_kA":{"text":"We enjoyed the 5 in 1 tour. Trevor did a great job as our guide & narrator!  He was very k","useful":0,"cool":0},"GQA_WOrVvvV4R_Mk14On_g":{"text":"This tour was so much fun! The history and stories are really brought to life by the tour ","useful":0,"cool":0},"EnDg1ual25XjkdCOa4RWuw":{"text":"Did the ghost tour with Daphne, was pretty disappointed. Was expecting much more. Literall","useful":1,"cool":0},"Of7KRFgcvozYEroQsUIR7A":{"text":"Claire was our tour guide and she was awesome! I tend to stray away from \"touristy\" stuff ","useful":0,"cool":0},"-w3TxkeOByan62XBLYr2WA":{"text":"Much more historical not so much scary. But you can learn a lot of interesting stuff if yo","useful":1,"cool":0},"y6U3D8tnYR0nO-YeOnOvZg":{"text":"For my second trip to NOLA I wanted to do a cemetery tour. I used this tour company rather","useful":1,"cool":1},"P3RhS24izX8OGShJZQGYXw":{"text":"I am a NO native and found the Gaden District tour informative and interesting. Drew was a","useful":0,"cool":0},"a04JHUCMDwW-sbwQrtRWig":{"text":"Great two hour tour. Our guide, Lucy, was extremely knowledgeable and enthusiastic, keepin","useful":0,"cool":0},"pOQXBILBSmxoiB7m9IYcFA":{"text":"Please Note this tour isn't meant to be scary, if that's what you are looking for you will","useful":1,"cool":1},"VBnRwJw_SZdQoefKtfu83g":{"text":"Lisa was the best tour guide EVER! She was so knowledgeable and funny. She made a point of","useful":1,"cool":1},"jIlHa0ICy_HPg8ClK7tPvA":{"text":"Did this tour last year during a sweltering August day last year . Cannot remember our gui","useful":0,"cool":0},"aepPCK4BG85iR12T71zyVw":{"text":"Our tour guide was great and funny. Very informative about the city and it's history. Some","useful":0,"cool":0},"5KjEWlae-gCTEOvTRfxVEw":{"text":"Like some of the other reviewers, I had trouble with the online booking but no worries we ","useful":0,"cool":0},"WlLtL2g8QSW7PYDVPl7-5A":{"text":"Daphne was our tour guide and she was PHENOMENAL!   She clearly knows her town and loves h","useful":1,"cool":0},"oykjn7N8EdYWqTq7THrdiA":{"text":"My friends really, really wanted to do this tour on our last trip to New Orleans, so as th","useful":2,"cool":0},"6bMHUnhMBX1pgnRdV6-2XA":{"text":"Ask for Randy! I took my 10 year old son, and we both really enjoyed ourselves. Randy has ","useful":0,"cool":0},"PwwCg8Qfmk8N3wSAEka5Rg":{"text":"Gydeon? Spelling? ....was an amazing tour guide. Awesome stories. Great energy! Fun to lis","useful":0,"cool":0},"li9kk29sCwLES93fm3TC7A":{"text":"I feel bad, but I cannot for the life of me remember my tour guide's name. All I recall is","useful":0,"cool":0},"T7UD-I72PoyEMjpxIWB34w":{"text":"Went last night with a group of girl friends. There was a sassy girl who was interrupting ","useful":0,"cool":0},"gNEDQrCtY-LclDSUyVyEwQ":{"text":"Our tour guide was very passionate about the subject matter, but the stories were wayyyyyy","useful":0,"cool":0},"IdOZ3nwQuej3CjLSTToX7A":{"text":"Charles was our tour guide, he was a great storyteller and answered any questions which is","useful":0,"cool":1},"jgTeV65J9bPFP-BZl4jBaw":{"text":"We were excited to go to the Ghosts of New Orleans from Mikko one of the tour guides but w","useful":0,"cool":0},"9uPNjFGyoddwCA0q1QbgLA":{"text":"The Scary part of the tour is that you lose people in your party as you dwindle from 20 do","useful":0,"cool":0},"CGlmXJ-mw-Xasn9wk56OEw":{"text":"Liz was a great tour guide!I had done the ghost tours twice in the past and knew how great","useful":1,"cool":0},"0dDMkd6ERXprPN_4xdPgfQ":{"text":"Seriously upset. We paid $125 for nothing. Before booking we were promised we'd actually g","useful":0,"cool":0},"Gf5qHyzAz4u6FQNAbZIuww":{"text":"I did the scandals tour led by Kyle a few days ago. I am SO glad I went with that one! The","useful":0,"cool":1},"aiIs2Mp0P1yK4ptVCyKzPg":{"text":"We've done 2 tours with this company the regular Haunted History tour and their new \"5 in ","useful":0,"cool":0},"jx5dkq5xszfAkX41IBydOw":{"text":"Visited NOLA for the first time ever and this was pretty awesome tour!! Our tour guide Mar","useful":0,"cool":0},"hJ8CvZ6CPmjpLrktU8C8cA":{"text":"Daphne was awesome.  The cemetery tour was fun and very informative.  We are looking the g","useful":1,"cool":0},"x5ecIMNQtmLVyNFJ--m6cw":{"text":"We were excited to learn and hear stories of NOLA. Instead it felt like we were walking ar","useful":1,"cool":0},"GMNkKx5Hvovdr1ZkA2Mgyw":{"text":"We did the 5 in 1 tour, we had Trent as our guide. His stories were historically accurate,","useful":0,"cool":0},"9YHx1eBdKCi54Xd8Nn_QSg":{"text":"We love Jonathan! Great tours! We have seen the Vampire and Ghost tour multiple times! I c","useful":0,"cool":0},"_T9hN6y8POmxyHNSo1NNUQ":{"text":"Jennifer was fantastic.  She and her husband (George?) presented plenty of history deliver","useful":2,"cool":0},"azMXtrSe1VvkgKkLaT_jGg":{"text":"Lisa was incredible on our 5 in 1 tour!! She was extremely knowledgeable about all the cre","useful":2,"cool":1},"ifI7CTx2B6WY4WAj4K0Shw":{"text":"I was so excited for the walking Ghost Tour of the French Quarter. I expected to hear abou","useful":0,"cool":0},"9Meu5vAFFHoZhO8IeDVW9Q":{"text":"I took the Haunted History tour and it was great!   My tour guide, Ernie, was very knowled","useful":1,"cool":0},"MGF7SJQHR3YDcO8ZprsZ0A":{"text":"Drew was an excellent tour guide! He was very educated and passionate about the city! I wo","useful":1,"cool":1},"d98gP5Lt5gPv4Nrbu06Pog":{"text":"So, I want to give four stars for the cemetery history tour. The information and tour guid","useful":0,"cool":0},"qbg4FgzhLLN6GMAgdRinnA":{"text":"We did the Vampire tour with Wendy & it was awesome!! It was freezing cold but we stayed t","useful":1,"cool":0},"KpvINJGBIVgDn5Lpq4Gz3w":{"text":"My family, wife, and I just took the 5 in 1 tour with Drew Fitzgerald. It was informative ","useful":1,"cool":0},"8H65HQxlfMCIQQADVqzEyA":{"text":"We did the 5 in 1 tour, It was ok... a lot of quiet walking. I really thought it would be ","useful":0,"cool":0},"FfRbBL9Y-6ro-V4OCNiuyA":{"text":"My niece is into horror movies, ghosts stories, etc. so I thought the haunted history tour","useful":0,"cool":0},"Z5wFeQh66FriVK7XyYgtQA":{"text":"I've had two tours with this company, the voodoo history tour and the vampire tour, both w","useful":1,"cool":0},"V-YpW8g4Dai_My5TFna5iA":{"text":"Real stories around the French Quarter that will stay with you for days. Excellent tour gu","useful":0,"cool":0},"xyC9d_YeOgNjkzWliulveg":{"text":"Our guide Charles, was entertaining. No ghost stories which was disappointing for a cemete","useful":1,"cool":0},"EGgzTU2HASwhvKm54g10BQ":{"text":"So, I thought I would be the FIRST to write about our great experience with tour guide Ern","useful":3,"cool":0},"zkdEYskkPpihbC-up4jXrg":{"text":"It was my first time visiting NOLA so I wanted to see it all. I took three tours with this","useful":0,"cool":1},"HZMuEusTFvLMPSKKARLgog":{"text":"We did the cemetery tour on a Sunday morning with Daphne.  We were surprised how many peop","useful":0,"cool":0},"fnUlafetPKN-5evsX26VYQ":{"text":"Great walking tour led by Dillon.  Started at the Voodoo Lounge with 2 for 1 Hurricanes.  ","useful":0,"cool":0},"CmaDxDzHqVP4aNfd0YT_sg":{"text":"Fantastic tour. The tour guide was knowledgable and entertaining. The places we visisted w","useful":0,"cool":0},"x5tlu2Utv_4XnMrGn6FJEQ":{"text":"OMG this was the best tour EVER. Our guide was Christine McArdle and she was killing it. I","useful":0,"cool":1},"LUYvVq0VJAYU-Ethe9k_sA":{"text":"Did the vampire tour and it was a great time!   Fun, history and a lot of vampyre lore!  D","useful":1,"cool":0},"DuiiO6CYp4C_3WUuJ8yEOw":{"text":"Thoroughly enjoyed this tour and our guide, Kyle.  Great stores for our 8 pm evening walk ","useful":0,"cool":0},"gPIIj_hzR_CT_0GeDdMwBA":{"text":"This tour was really informative and fun!  Daphne has a great sense of humor but she's als","useful":0,"cool":0},"g33cRBDM5YmoqfbwQhE7MQ":{"text":"Loved the historical content of this tour.  I imagine one's experience is only as good as ","useful":0,"cool":0},"KjKtbwCsY5pvNqt4p2fFwg":{"text":"BORING! Don't waste your time. There are no real evidence of \"ghost\" besides a he said she","useful":2,"cool":0},"VYi8pKED0JBrQQZQWzBYcw":{"text":"We were quite pleased with this tour and surprised it was as good as it was. \n\nErnie is a ","useful":0,"cool":0},"kl_8aVot2VOjzKR6pKOX6g":{"text":"A big rip off! The tour guide wad nice but we heard only 4 stories about the haunted histo","useful":1,"cool":0},"Uw1_V7c0tZSFnAfQ4z3TKQ":{"text":"I have been on MANY of the Ghost, Vampire & Voodoo tours in the last 10 years.  Have enjoy","useful":1,"cool":0},"akQH2XXWpu9kudAZ55aq3Q":{"text":"Last week my family did the French Quarter Ghost Tour with Toast. The tour was great. Toas","useful":0,"cool":0},"yt_-tKx7WdwUuCKfmO604A":{"text":"We ended up doing two tours in the same evening - the scandal tour at 530pm and the 5 in 1","useful":0,"cool":0},"Y2qY5eODzvwo6FmYwftM4w":{"text":"The tour was awesome...make sure to bring water because it's a bit of a walk, but the tour","useful":0,"cool":0},"UrD7126AC4R78hcbVtdXvA":{"text":"Taking a haunted tour was top priority for our visit to New Orleans. Unfortunately, the to","useful":0,"cool":0},"NxgEm1IAM9EY4_dDx_cYbg":{"text":"I did the vampire tour. My tour guide was Jonathan and it was a great experience!!\n\nI high","useful":0,"cool":0},"kD-V4UDVgbY5Kxijllv1jQ":{"text":"This is the second Cemetery tour I have been on.  I love learning about the history of the","useful":0,"cool":1},"Lh3U5Mz6YWfuKc8gw4WsGA":{"text":"It was a fun tour, didn't visit as many locations as I would have liked, given the time, b","useful":1,"cool":0},"uKgDqSnez9d6HlMZcBUfdg":{"text":"We were only in New Orleans for the night and completely captivated by the sheer history t","useful":0,"cool":0},"USfVqHTAQgfl3-KJYT8lbA":{"text":"My boyfriend and I did the vampire tour back in March and it was really cool. We learned a","useful":0,"cool":0},"6mmgXZpT2Y5WfY7v9HrfkA":{"text":"This tour meets at Rev. Zombies House of Voodoo on St. Charles Street.  I popped into the ","useful":1,"cool":0},"JsWb8ki6iwvAhcNMSi4RNg":{"text":"Jessie was a great tour guide on this haunted history vampire tour. It was super informati","useful":0,"cool":0},"dpoXKC_bQ6CUpzwrY5AZUQ":{"text":"Our first night in New Orleans and my husband insisted we do a haunted your. I wasn't sure","useful":1,"cool":1},"mBL-eoTyqtGqieEFv1xXVw":{"text":"We took the 5 in 1 tour last night.  After having taken a few of the others over the years","useful":2,"cool":0},"9DgHyHQC-MT3aLGUJBC83g":{"text":"This is my first time in New Orleans & I'm completely in love! I did the 5 in 1 tour & our","useful":1,"cool":0},"QvSL5FFuVitIBli3W0wKJA":{"text":"Took the Garden District History Tour with Drew. I was overall very pleased. He was inform","useful":1,"cool":0},"sbDmBSBtMBpAZDkRBZjnig":{"text":"Great experience. I didn't know what to expect, I had never done a haunted tour, but it wa","useful":1,"cool":0},"6dMUDwgGyQfOjwrKxuXyXA":{"text":"Gabriel did a fantastic job and was so emphatic, he talked till past 10pm. The walk was ve","useful":0,"cool":0},"Nhn647CwNpOdXUM42rOsNA":{"text":"Midian was my tour guide and he was just ok.  The tour is split between the two hours by a","useful":0,"cool":0},"VWhiR_jMnPO3J2fi6GecPg":{"text":"I do not recommend the 5-in-1 tour.  We were really looking forward to it but it was very ","useful":0,"cool":0},"80FSkvkslRbodH-ZhIVA7Q":{"text":"Do NOT waste your money. One of the worst tours I have taken. The guy with the mohawk was ","useful":4,"cool":1},"0gXvBRF4iXRm6FUT_1rc_w":{"text":"If you're thinking about a tour, DO THIS ONE!!\n\nWe did the haunted pub crawl. Oh man! We l","useful":2,"cool":0},"OgE-YuleUDZ_BRmaJCF-Yg":{"text":"These tours were outstanding! Coming from out of town, you never know what you're going to","useful":0,"cool":0},"SeihyHixAWyUPrQ8DXU1gg":{"text":"We had a great experience with our guide Renée this morning. Note that tours of St Louis #","useful":1,"cool":0},"9cl1ameKmOwxRtZ6RB6Hvw":{"text":"Tour guide was Daphne. She was very good. A New Orleans resident, she showed us the cemete","useful":0,"cool":0},"ll7dMv8uB6L3ph_322C1Jw":{"text":"I had a great time with the best \"story teller\" Daphne. She was informative, great story t","useful":0,"cool":0},"_1Pd41Jn4HWQahYr7IKTgQ":{"text":"We did the cemetery tour with Andrew and he was AMAZING!!! \nHe took his time telling about","useful":0,"cool":0},"ThyRN59wtN6vZSb4UUAkFA":{"text":"We found this tour after doing an internet search. I liked the ability to pay for our tick","useful":2,"cool":3},"tTUY5bolr0f8nwKANasDVQ":{"text":"We decided to do the 5 in 1 tour. There is just so much to see & do in New Orleans that we","useful":1,"cool":0},"5et_jiNIonRqSqhzFqA20g":{"text":"Our tour guide was a good story teller, but the stories were boring. My husband and I went","useful":0,"cool":0},"iilH4rFGu9tAGsVlhxomIQ":{"text":"Tour guide was Jonathan, and he was amazing!  The tour was highly entertaining and the sto","useful":1,"cool":0},"rtwL6AV3BoOsU2tQaNfZVg":{"text":"My husband and I went on this tour with Ernie as our tour guide. He was really knowledgabl","useful":0,"cool":0},"OFPgwLm3xm9GpRuj4PFSDA":{"text":"Ernie was the best!\nA wealth of information.\nNot that I know any of the other tours or tou","useful":1,"cool":0},"SG7T-Ek0UsuPnGCWN_ARog":{"text":"It was ok. I expected less talking, more sight seeing. It was difficult to keep up with th","useful":1,"cool":0},"Utj5aB4CohoN5KGOZBc5OQ":{"text":"We went on the 5 for 1 tour and anDrew without the \"An\" was our guide. He was awesome! He ","useful":0,"cool":1},"Jfytlul7cbg9vHt9X9fh7A":{"text":"Did the 5 in 1 tour yesterday evening, Natalie was a great storyteller, made everything sh","useful":0,"cool":0},"8Usu6FaR9ZvU0BiPFduu9g":{"text":"I've done the Garden District tours many times over the years--both the historical tour an","useful":0,"cool":0},"L0OUaJWMGIVppdXKA1h6eQ":{"text":"This is my second tour and it was a better experience than the last time. Daphne did a gre","useful":1,"cool":0},"_RrcWOA0Flpe_r2LhQDfPQ":{"text":"I indulged myself in a 5 in 1 tour. Great history and legends. Our guide Drew was loud eno","useful":0,"cool":0},"knJpDFalV8fsczkh90VB5A":{"text":"My mother and I went on the 5 in 1 tour when we visited New Orleans this past weekend.  We","useful":0,"cool":0},"gcB4Pp7diLE7KfGo_JozPg":{"text":"We had a blast. We took the 8pm ghost tour and had a blast. Our guide was amazing (I can't","useful":0,"cool":1},"wPE8v38u4ug5bZp-EI4sdw":{"text":"We did the ghost tour with Ariadne (I think that was her name?) and it was awesome! We saw","useful":0,"cool":0},"hHKeamnKSnmeYeFu2LS_EA":{"text":"The same company from which we took our French Quarter Ghost Tour -- and practically the s","useful":4,"cool":1},"QHpAV6MwBjMdRAlw0o64Uw":{"text":"Me and my kids had such a great time on the haunted ghost tour!! it was so much fun and so","useful":0,"cool":0},"ry1Vjx8HxLG0fKHx-pP0VQ":{"text":"We had great fun on our 5-in-1 tour. Adele kept us engrossed in stories about ghosts, vamp","useful":0,"cool":0},"Rl5u_EtMN1hiPhvRfQltrw":{"text":"The tours were great!! The guide had so many great stories and history on the haunted plac","useful":0,"cool":0},"9aIRHUCUWmqTixB2ijiqcA":{"text":"My family took part in the 5 in 1 Ghost & Mystery Tour of the French Quarter last night, a","useful":2,"cool":1},"-TAEY4TqR6HJ2l0sIdTY_g":{"text":"This was a fantastic tour! Our guide Gwydion was funny, informative and entertaining. We a","useful":0,"cool":0},"z08uNc36kOQhTHkQmHBd_A":{"text":"My boyfriend and I are in New Orleans for our anniversary and took the vampire tour last n","useful":0,"cool":0},"tbSJmHvgtmpQzBDwRlSRqw":{"text":"Our tour guide Ernie was amazing!!  He was informative, entertaining and we would highly r","useful":0,"cool":0},"Kb5B_IsYa7N5Z2a7YQiAsg":{"text":"Three of us took the French Quarter Ghost Tour. We were very excited about this tour, but ","useful":2,"cool":0},"iUsXbs0vmhCg4U1fLvwHiQ":{"text":"I did the Haunted History tour in the district because after one day, I wanted nothing to ","useful":0,"cool":1},"yGuT1CxRvI0jPnVHku-OVw":{"text":"Was definitely worth the two hours! Great history and our guide was awesome! A must see & ","useful":0,"cool":0},"OGVVthfnl7RmiMWGWNQYhQ":{"text":"In one sense I think I was lucky.  The lady that gave my tour was also the one that wrote ","useful":3,"cool":4},"6mrIklbrBpn062ySpl1cxQ":{"text":"Our tour guide Randy was the best! The Haunted History Ghost tour, is just that- the dark ","useful":8,"cool":8},"sx97PDPstF2XVf9KSOcS6A":{"text":"Horrible business. Only reason they get one star is because I can't give a negative. They ","useful":0,"cool":0},"4uPU58sE9fkX2LIeik8JqQ":{"text":"Best tour company in New Orleans. They have quite a few tours to choose from. We have been","useful":7,"cool":1},"zmmOw-HBks6K3TJ8o9S_Yg":{"text":"This tour is a great way to get to know the French Quarter.  Our guide (Charles?) was very","useful":0,"cool":0},"7pW9-K9Ouwdf-3IA6j9OFw":{"text":"Daphne was our guide for the 5 in 1 tour and she was great! She was very informative and k","useful":1,"cool":0},"7j_Xofrru8b2zf7Kvb0EcA":{"text":"For $25 a person there's no better way to see New Orleans. You meet in the evening at Rev.","useful":2,"cool":3},"3kvlZPKyiCAX0W3rwRhq0A":{"text":"Overall this was a good tour, especially after a AAA discount.  The one thing I didn't car","useful":0,"cool":0},"-UZYQp2SB5yb1FCH__wRBg":{"text":"The haunted pub crawl was a blast! Probably one of our favorite things we decided to do. T","useful":0,"cool":0},"IUmj0OaxxuG11oz5cyJa2w":{"text":"6pm French Quarter Ghost Tour with Johnathan.\n\nStart in front of Voodoo Shop but you don't","useful":1,"cool":0},"7YYz7iKwT9_mlOdX_kpezw":{"text":"I've been on several ghost tours, but this was probably my least favorite. This could be d","useful":0,"cool":2},"p6G7yHhSz5LlrNo3FFpqhQ":{"text":"We did the dead of night ghost and graveyard tour. This was not worth the hype or price. W","useful":0,"cool":0},"1RvYBaYq_bfFaozJ6z1OMQ":{"text":"Amazing!!!!! Jonathan is sooooo awesome and really looks like a vampire!!!","useful":0,"cool":0},"oa2Hj5_3llnQAwq-P28ikg":{"text":"We took the vampire tour  awhile back, and although my travel companion wasn't that impres","useful":5,"cool":5},"6MU0VoxEJZ3UlTf7oyKScA":{"text":"Tour guide was very enthusiastic. Checking in was easy and no problem. The tour was more o","useful":0,"cool":0},"G5gMdJPIw3jfyfqYI0s54g":{"text":"The 5 stars are for the Garden district tour, and for the tour guide Katherine Young. She ","useful":0,"cool":0},"BlW_hraqpYebFXaY_-b5ww":{"text":"We booked online the Vampire Tour-they have online coupons or offer a discount for Triple ","useful":2,"cool":2},"X_ctolxho9IFSu-kodNePw":{"text":"We went on the Vampire Tour with Lisa and she was excellent! Personable, knowledgeable, el","useful":0,"cool":0},"x-IybsEw5fm2YaDek8Slfw":{"text":"This was probably the least interesting part of our visit to New Orleans. It had the poten","useful":2,"cool":0},"L8CYAMJ0GBaKVjzWxnBieA":{"text":"Did the 5 in 1 tour. The Guide was a good story teller but that is all you get. One word \"","useful":0,"cool":0},"I_tCLuQYUry9qq11YPXAZw":{"text":"I did the Cemetery tour with Ernie as our tour guide.  This was a fantastic tour, worth ev","useful":0,"cool":0},"HX43fVSBTpyHSTe5pT8s1A":{"text":"The Haunted History Tours was an amazing event for my wife, our friend and myself!! Our gu","useful":1,"cool":1},"Lwvt9a-C7A_ms2zZeknrtg":{"text":"Did this tour today. Our guide was Chrissy. She is a great story teller. We enjoyed learni","useful":0,"cool":0},"NORDhIXyFiWsniLYfGE5yQ":{"text":"Fun and interesting way to learn some o the history and folklore of New Orleans. It's not ","useful":1,"cool":2},"MOH85V3HL1e6At9HKjKPcw":{"text":"Once you get to the tour location, you're met by a set of guides on the street, and then s","useful":0,"cool":0},"faDb223kyakg3aFAWWwgHQ":{"text":"Drew was awesome. He is an excellent guide, a delight to watch and listening to his monolo","useful":0,"cool":0},"PNaRUcFvLXfFPWnCQjTivg":{"text":"So glad I spent the money to do this tour! \n\nI sometimes shy away from these epically \"tou","useful":1,"cool":1},"zfYHZ1GCC2B4zkxMuXK1vg":{"text":"Our tour guide, Drew, gave a very informative and entertaining tour of the Garden District","useful":0,"cool":0},"kf541-G1vMwYKpWfsG3F5Q":{"text":"This tour was ok.  The tour guide was a pretty good story teller and knew the history of t","useful":0,"cool":0},"WEQoifhmFqeMIx8nxJ3V8Q":{"text":"I was totally underwhelmed with this outfit. We didn't go into any of the places that we w","useful":0,"cool":0},"QSYrJhe48UpRHYhi3eDwRA":{"text":"We had Gabriel for the 5 in 1 tour and he was great. He told the stories really well and w","useful":0,"cool":0},"Kr2CFZqx_E4BqdT1g6pPaw":{"text":"Had to do a day tour & think we paid too much bc bought at a kiosk & price more when we go","useful":0,"cool":0},"0gJEzpko6FLLVy-J0yf2sg":{"text":"My friends and I are in NOLA for the first time and booked a ghost tour. Our tour guide, D","useful":0,"cool":0},"JSwYrOItdqMl33A6h63i6A":{"text":"We booked a tour for the Garden District that started at Lafayette Cemetery.  Jessie was o","useful":0,"cool":0},"Ah5qZDT2fLFuEw7PySDr3A":{"text":"George is a fantastic tour guide!  5 stars.   Ask for him by name.  Sounds very knowledgea","useful":0,"cool":0},"VGDS3Lr730HP-07CYnBdTw":{"text":"We took the 8pm Haunted History Ghost Tour with Jack. \n\nI think taking a later tour adds t","useful":1,"cool":2},"Eu2Rd8NMa7nsBVN6gUE4Mw":{"text":"I've done the tour twice and its a fun break from all the partying on Bourbon St. However ","useful":0,"cool":0},"o-fxH-p9HJA4WNakGLK4eQ":{"text":"Our tour guide was Toast and he was not only very knowledgeable but also very funny!  Even","useful":0,"cool":0},"PjKbf9WtpepUIy9PJ22ExQ":{"text":"We signed up for the ghost tour at the last minute.  There was a pretty large crowd gather","useful":1,"cool":0},"uarWgrLfYNnTnXwG9UAkEA":{"text":"History tour-- yes\nWalking tour--yes\nSightseeing---yes\nHaunted tour--no\nGhost stories--no\n","useful":1,"cool":0},"jr-iK-zBj3rhVP8X7z8O3A":{"text":"5-In-1 tour was excellent! Our tour guide Trevor was funny and engaging. He also apparentl","useful":1,"cool":0},"Qk2iLekg35Iyae53QRr7lw":{"text":"I took the Haunted History Tour and had Lucy for a tour guide. The tour itself was ok, but","useful":1,"cool":0},"fZPHOYQWsw8un5FbVrrZSg":{"text":"We took the cemetery tour--pretty boring  and nothing haunted about it. After an unnecessa","useful":1,"cool":0},"mclNuHcf-sQJ32Hqf1SlLg":{"text":"THE BEST OF THE BEST! \n\nWe did a different walking tour every day during our stay in NOLA ","useful":2,"cool":1},"3HI61XhQG2B7kU4Krk069A":{"text":"We loved this tour! We grabbed the two for 1 hurricanes at the bar next door to the meetin","useful":1,"cool":0},"EMeZtKAwix4hZf1r3pL2hA":{"text":"Ernie did an amazing job with the cemetery tour!  His knowledge of the history of the city","useful":1,"cool":0},"UrTyzEWbBjPxXf0RsYxDYg":{"text":"If you have a spare evening in New Orleans and want an entertaining and informative view o","useful":0,"cool":0},"t9Z9JFDuaQJBYBuBiWo9-A":{"text":"Thank goodness my author signing group had the wonderful idea to book this tour!\n\nMy siste","useful":0,"cool":0},"TRL_JvW2USr6V9s4aLTWsg":{"text":"Do NOT give this company your money. Four of us paid for our cemetery tour in a kiosk at t","useful":1,"cool":0},"LUijpe8fhUIp-eQTRIyMIQ":{"text":"A fun way to spend the afternoon into the evening. The tour is well organized and leaves o","useful":0,"cool":0},"IPrcb5d664D5bOMgypuF0Q":{"text":"We took three tours from Haunted History Tours during our New Orleans stay in June/July 20","useful":1,"cool":0},"-z-X2rsTTGk3eGkvabDpWw":{"text":"We did the haunted tour of the Saint Louis Cemetery. I was disappointed. The tour guide sp","useful":3,"cool":0},"jZAPDpXcp3Iqc3BESLkdHA":{"text":"GET THERE 15 MINUTES BEFORE YOUR SCHEDULED TOUR. I say this, and I mean this, because you ","useful":2,"cool":2},"z4S2rZLbuxhrnp8ydlLlzw":{"text":"I really wish there was a \"0\" star rating.  Midge was our tour guide and he was EXTREMELY ","useful":1,"cool":0},"Nl93BG6lWandPpn4tbOV7Q":{"text":"We went on the Ghosts and Legends tour at 3pm and had tour guide Jonathan. It was a great ","useful":1,"cool":0},"EByIVzq7Jdg6TDg_geGlrw":{"text":"5 in 1 Tour is terrible.   You move from corner to corner and the Stella talks about Witch","useful":0,"cool":0},"nnNS5mS7usJqJzukWRPoSQ":{"text":"Awesome tour! I highly recommend it. Our tour guide, Trent, made it really personable & fu","useful":0,"cool":0},"01M79byGGF-uBOgymtrGww":{"text":"I got a few photos of vortexes.  I also noticed someone on the tour got a picture of a ful","useful":1,"cool":0},"W_VdvrK51GkBMfn2cDt36Q":{"text":"Annie and Erich loved the tour! It was a lot of fun, filled with great stories and even a ","useful":0,"cool":0},"61CGhIXsCt2hjgqz-nGAzg":{"text":"So, let me start off with saying, I am very easy to scare and spook. I was not at all scar","useful":3,"cool":0},"na3tOSovjdittnpD5mJJXw":{"text":"Really enjoyed the haunted pub crawl with Drew. He was very knowledgeable and engaging, wh","useful":1,"cool":0},"XQ_1ZQxnt7Sd4xo74T6VHA":{"text":"Brochure is very misleading interesting stories but in no way close to what the brochure p","useful":0,"cool":0},"3FiHOP5ckzo8A3pTsgiR_A":{"text":"Knowledgeable guides, frequent rest stops & down to home humor. Thoroughly enjoyed it!","useful":0,"cool":0},"frd4oLTOoycs_e8WC52DJA":{"text":"Been on many ghost tours. This tour will not creep you out. I lost interest. The guide was","useful":0,"cool":0},"C2oK5eRB-ZstMZfNZsoq3g":{"text":"My wife and I did the vampire tour and our tour guide was Lisa. She managed to still pull ","useful":2,"cool":1},"Wh_b2kzaFzfcVsU4CYSYSw":{"text":"I went on the bus tour not long after it was started.  I must say I was very impressed wit","useful":0,"cool":0},"As5aSSKbkweMPawI8LUR5A":{"text":"Really awesome tour. Learned a lot about New Orleans that I had no idea about. Worth every","useful":0,"cool":1},"VvOKjqDgvjv4IyCwxLH-bA":{"text":"Now that I've stopped my head from spinning, onward to part two of my bon voyage tour.  We","useful":3,"cool":1},"qzs7YIvBOG0eonkEcW6VhQ":{"text":"The tour was fantastic.  We had Jack as our guide.  The group was huge that paid for the 8","useful":1,"cool":0},"maQ3eINmMs7I1sO13Ths_g":{"text":"The Vampire tour with Jonathan was one of the best (out of 4) walking tours we went on dur","useful":0,"cool":0},"AZsyGs_K0JgCREMeKQm2RA":{"text":"Well worth the money to hear about history of city even though we had no ghost sighting. G","useful":0,"cool":0},"CumdevURA-O82_U0Fryt2Q":{"text":"This was one of the best tours I have ever been on.  Our guide was Andy/Andrew.  I was ske","useful":0,"cool":0},"uG5y4dvHPizLrMpcVjDH_g":{"text":"We did the Scandal tour last night and it was awesome! Natalie, the tour guide was incredi","useful":0,"cool":0},"2kWQAwmsVidzj-t4O9BVNQ":{"text":"I'm not normally one to post reviews because different people have different opinions, but","useful":0,"cool":1},"k7qwUh714ajsYf1leRZzVQ":{"text":"My boyfriend and I took the Haunted History VooDoo tour and we had Chrissy as our guide. I","useful":0,"cool":0},"ohPDcA_NEE-hrM1eiKDH8Q":{"text":"Excellent tour! I did the tour during my bachelorette party weekend and it was so much fun","useful":0,"cool":0},"R2lRDqvl9H8NKAsC-ZALaA":{"text":"I highly recommend this tour. Our guide was a master storyteller. Unfortunately, we were h","useful":3,"cool":1},"BsXje237SkcZJ8RffhqCzg":{"text":"Really slow moving, didn't hit enough sites, way too long of story at each stop. Lots of s","useful":0,"cool":0},"XGmJZhKbl_ZDL4dXMx4wMQ":{"text":"Jesse was a great tour guide. He was very experienced giving the tour. My GF and I enjoyed","useful":0,"cool":0},"VtZseMWF_oVGvh7rim6Icw":{"text":"My wife and I took the tour on a Friday evening. George was our tour guide, and even thoug","useful":0,"cool":0},"2zBrHyyYNEeySzHNHd6Fvw":{"text":"We went for the cemetery tour and had Trevor as our guide. Great story teller with a sense","useful":0,"cool":0},"0SSL7-74lQOb8fDATib8Xw":{"text":"Definitely the best way to see NOLA.  You grab a go cup and hit the streets. You'll learn ","useful":1,"cool":0},"4pBiGfaW4lC_QLha7TNdiw":{"text":"I went on a previous ghost tour and was kinda bored and didn't want to try another one bec","useful":0,"cool":0},"0XFwZ5fh2Plx6YeVm9uGFA":{"text":"Ugh, where do I begin. Super excited about this tour, however, we found it super boring.  ","useful":1,"cool":0},"GFgya2Itiivp4zqvspOhow":{"text":"We did a 5/1 Combo tour with Lisa and it was great! She had incredible knowledge of the ci","useful":2,"cool":1},"PT8-al22oG4B6wgva9QQ3Q":{"text":"Can I vote zero?  This was horrible!  Just horrible!  The guide got drunk, lied about a ph","useful":2,"cool":1},"xan2H4BCg0wrVIu9iQ7TKA":{"text":"Disclaimer: I'm generally not a \"organized tour group on vacation\" kinda person. But since","useful":2,"cool":0},"HAzC6Zh8SacPSz_EVDm7Iw":{"text":"From ghost, to voodoo, to haunted bar crawls to vampire tours, Haunted History offers a wi","useful":1,"cool":0},"dAzcPiEQ2mKuuZvrkmReag":{"text":"My family and I decided to visit New Orleans for Matthew's 15th birthday. We happened to s","useful":4,"cool":4},"QxgSP4X2NnUDb2JjXOcK1A":{"text":"Really enjoyed this tour. The Guide did a great job giving us haunted history of the Frenc","useful":0,"cool":0},"f4BtrK6bTybVf0VzK-1T-Q":{"text":"This past weekend my husband and I were on a couple's retreat and he allowed me to pick wh","useful":1,"cool":0},"fKfUEZ9rA2cHfpaobObSsw":{"text":"We have been taking tours with this company for years! Back to the days of Midian being a ","useful":1,"cool":0},"XQ3WrtubNypvz6sS5sXgFg":{"text":"This is definitely not a \"family friendly tour\" as they would like to advertise.  Our tour","useful":5,"cool":3},"Sv_CnnR0FEnzXE4Xnm_RuA":{"text":"Enjoyed our little haunted pub crawl- this is not a tour for those who cannot handle drink","useful":0,"cool":0},"Y-7zzP4LgPQbDP-Bbdv8nw":{"text":"We had Daphne as our tour guide on the French Quarter Haunted History Tour and she was bey","useful":1,"cool":0},"IeamzrAg8MLeAdc5SRCDpw":{"text":"I've been way down south to sweet ole' New Orleans 5 times... and every time I still play ","useful":4,"cool":2},"NI1OWAOc6RatP1YAL0tLIg":{"text":"My wife and I took the Vampire tour. We had a great time. Our guide was knowledgeable and ","useful":1,"cool":2},"wMGBqQKj03jucWIwxBpWng":{"text":"I wanted to write this review while the experience was fresh in mind. This tour consists o","useful":0,"cool":1},"HUiiYzhOG2cYjqgZIkz4yg":{"text":"My boyfriend and I took the Garden District Haunted Tour with Jesse today.  Jesse was supe","useful":1,"cool":0},"bf0pXcGdFUJmMGTl2-86_A":{"text":"Our tour guide Jennifer was funny and engaging.  You get some interesting tales of hauntin","useful":0,"cool":0},"sQxqRxJgOErGZLc3-MUurQ":{"text":"No horror stories, a lot of attempt to be funny, random blabbering. Not recommended. Some ","useful":2,"cool":0},"KNsZ5MetKoc947TYntv2ig":{"text":"This tour was fun.  Good way to spend 2 hours without having to think of where to go to li","useful":1,"cool":0},"HvDRcQyQ5vaA4Hw9jLZ5OQ":{"text":"My mom and I took a walking tour of the Lafayette Cemetery and the Garden District with Je","useful":1,"cool":0},"3tLn8GMaRbx8tHVKriaNSg":{"text":"Ernie was our guide for the cemetery tour and he was fantastic.  I learned so much and had","useful":0,"cool":1},"nsKZEdfYw_c8iUtUTvpgJA":{"text":"Was there Halloween night and maybe I had very high expectations. I found the tour boring ","useful":0,"cool":0},"cRBdJxVSP1YDxX-zQpx9tg":{"text":"The voodoo tour was good with Christine, she was entertaining.  My big complaint was with ","useful":1,"cool":0},"yDYDcdsIi1kNy8cEdUIj_w":{"text":"It really depends on who you get as a tour guide.  ANDREW is amazing!!!  So much history, ","useful":1,"cool":0},"N0icakN8Ur-fCZMxonA_SA":{"text":"Lisa gave a wonderful tour. She is extremely knowledgeable and presents the material in a ","useful":1,"cool":0},"E2RHAkI4wasggwV9rYb-Fw":{"text":"We did the cemetery tour today. Randy was so full of facts and jokes it was a pleasure to ","useful":1,"cool":1},"NZ9kdQ7qvQLtg8kdG0iY2Q":{"text":"I wish I remember the name of the woman who was tour guide. She was from New England, or C","useful":0,"cool":0},"TKp0sR4l4C1sI8HkcnutTQ":{"text":"Two of my friends and I did the ghost tour & we were very happy with the content, and havi","useful":0,"cool":0},"brcgmk61LoncbiDLEGf6Ow":{"text":"Brent was an absolutely amazing tour guide! It wasn't frightening like I thought it would ","useful":0,"cool":0},"GNyd-UXHsYvuGoY8JthAlw":{"text":"We had SUCH an awesome time on this tour! Myself, my mother and my cousin did the 8pm tour","useful":0,"cool":0},"6smqGSBnZtcb389Wusun-A":{"text":"This was a really fun way to start out a night in New Orleans. I didn't find the tour to b","useful":0,"cool":0},"AAn6kH-EcLcuPMDSl4nxTA":{"text":"We did the ghost tour, it was fascinating and intriguing. Our tour guide Jack, was the per","useful":0,"cool":0},"lZ9bGDjSbqoEjWC6KHlg2Q":{"text":"I'd advise against taking this tour. \nIt's expensive; $20 for a walking history tour and y","useful":3,"cool":0},"qb98oXP60tJRm_PniWNcww":{"text":"We spent a week in NOLA for our honeymoon, during which we took 4 Haunted History tours. T","useful":1,"cool":0},"ZeXbMwt10QmwqjHkjRK8mQ":{"text":"The only reason I give it a 3 is because the first hour of the ghost tour my mother and I ","useful":0,"cool":0},"NrfD3Cw_gMHH-akY8a39eQ":{"text":"Every time I go to New Orleans I book a tour with Haunted History.  They really are fantas","useful":1,"cool":1},"2FJN8lBchmENG3SBabyOZA":{"text":"I heard about Haunted History tours from my sister who raved about them when she visited. ","useful":0,"cool":0},"O_yM5arPQF9LOeVGhGgHig":{"text":"Had a fabulous tour with guide Lucy. She was super animated and incredibly knowledgeable. ","useful":0,"cool":0},"Llzo-PAb1UJ6w4lJfITz2A":{"text":"Fascinating, interesting tour. Our group was lucky to have TWO awesome tour guides, Andrew","useful":0,"cool":0},"JEm0xQOZj8fZKz7iDRxvFg":{"text":"I dragged the boyfriend on this while in NOLA.  I'm a big history freak and thought this w","useful":0,"cool":0},"cRGRjbBOQT1yON4ZKByKQA":{"text":"We went on the 8pm tour with the student discount. We were debating between this tour and ","useful":0,"cool":1},"yA_P7yfv_gjRLX58Rd3Dkg":{"text":"We went on Lundi Gras and had a blast.  While we weren't drunk (I believe that spirits and","useful":0,"cool":0},"61BzvMXXqNRQ80NcXhAcqg":{"text":"Stevie was a wonderful tour guide. She was so informative, absolutely hilarious, and reall","useful":1,"cool":0},"nR7aRQ3OFlkIjclf5nF9kw":{"text":"I believe we had George as a guide and he was great! Just a sincere, nice guy with a lot o","useful":0,"cool":0},"zWUzs9QlWR44HvTw_1M42Q":{"text":"We did the Five in one tour yesterday with Elizabeth and it was phenomenal. She's such an ","useful":0,"cool":0},"vH4NDmTPIQCQXRtzPhkryA":{"text":"The haunted history tour was the first tour my family and I did in New Orleans and it was ","useful":0,"cool":0},"gbtW9ezQ-qHkoS2H8aI52w":{"text":"This tour was absolutely terrible. DO NOT WASTE YOUR TIME OR YOUR MONEY! Our tour guide, K","useful":2,"cool":0},"Dt9XRAdk23wJsFXKyXoALg":{"text":"Trent was an awesome tour guide. Saw the 5 and 1 tour, great background and stories of the","useful":0,"cool":0},"Zd1d5mzEZ24JuyL__CLuag":{"text":"I thought this tour was GREAT. The BEST ghost tour we've ever done.\n\nOur tour guide (Short","useful":0,"cool":1},"kjaL1CQ7sB3PQgZJ5Z-7DQ":{"text":"Loved this tour. It's purely history-based, so if you're hoping for something a little mor","useful":1,"cool":0},"ieEaCC8WzFOQwvDFEm_C2Q":{"text":"This was my favorite tour in New Orleans! Lisa was an amazing tour guide. She was very kno","useful":2,"cool":2},"nmmcYUC7uG7XpppDjMbikQ":{"text":"First time in New Orleans.  I was looking for some interesting and unusual experiences.  T","useful":1,"cool":0},"qdhzSR5PzrskkwEJ41uMsg":{"text":"This was awful! If I could go back in time I would have rather given the $50 to a homeless","useful":1,"cool":0},"-cQ2kIIqYSNn56R2WXSuiQ":{"text":"We signed up for a haunted pub crawl with this tour service and it was a lot of fun! Matt,","useful":0,"cool":0},"kfm0pSoeRtZ9SJhVWEDuUw":{"text":"I was there on the 11th of July. It was the worst! The group was too large. The girl prese","useful":1,"cool":0},"KPqntrrjOYVAAH2hDg09eQ":{"text":"Highly recommended, I'm not one for tours because coming from sf where our tour guide are ","useful":0,"cool":0},"i6yILM7VqqzywVtS6gGrHw":{"text":"I went on the vampire tour March 26, 2012 and had a wonderful time. We had the best tour g","useful":1,"cool":0},"ntmWYa1Ut0uH7JpGEV_OaQ":{"text":"My kid loved it. For first time non history buffs, excellent fun. For barroom fun before y","useful":0,"cool":0},"dpx8zyVXyviPT1ljiQj0qQ":{"text":"Wonderful  guide!!! I believe  her name was Kristi. Was a little unorganized  gathering  f","useful":0,"cool":0},"wDKfdOE5rAwmy_ijPxQtFg":{"text":"French quarter ghost and legends your had lots of good history info on where vampire myth ","useful":0,"cool":0},"gv_tTSXp7_X4JMXJwiUATw":{"text":"We took two tours with them because the timing and price were right. The first was their c","useful":0,"cool":0},"OjwJkC4xcX4BCF03F0mvzA":{"text":"We did the Graveyard & Ghost Tour by bus and it was amazing! Our tour guide TOAST knew how","useful":0,"cool":0},"RApb34bNpWqSogX92wn8ig":{"text":"I have to say our tour guide really tried. Great guy from missouri and well he knew his sc","useful":0,"cool":0},"kmd6yfqhUKMtqic0uSxDVQ":{"text":"We went on this tour on Saturday night Nov 9 and were disappointed.  We felt like cattle b","useful":1,"cool":0},"DC2F80SaXDCwX9th0Efpdw":{"text":"Boring....too bad i was expecting more. Save your $25 for a suvenior T shirt. Also the fem","useful":1,"cool":0},"QPcYs2Xctr7nzCGO3tOzsg":{"text":"Our guide didn't seem to know anything about the city let alone the tour. This is an embar","useful":0,"cool":1},"ToATuyUH9kCUmwBxd8c7_A":{"text":"This was an outstanding walking tour that we took today of the Garden District, led by our","useful":0,"cool":0},"_w7E2pkidpICcVruYuhE-A":{"text":"Awesome tour, highly recommend it. We took the cemetery and garden district tour. Our guid","useful":0,"cool":0},"URALO3qFIfVtRR5HA-5ThQ":{"text":"Tour very informative.  Not just about ghosts, much history as well.  Would do it again","useful":1,"cool":1},"7da34GQyT-4i4hfcSp5J6A":{"text":"So here's one of my guilty pleasures you may not know about: I love hearing ghost stories,","useful":5,"cool":4},"FqJC9przfCGJdviGxSKpRg":{"text":"We booked this tour on the advice of our hotel clerk but we booked it directly ourselves. ","useful":0,"cool":0},"Y6zfp3Zt3iCCc6PIUgGfGw":{"text":"Daphne is extremely knowledgeable about the history of the area. She really kept my intere","useful":0,"cool":0},"Bdc8iH4U-vstMWZG1nVJEA":{"text":"We took the walking tour, which included St. Louis Cemetery #1, and a small portion of the","useful":3,"cool":0},"GNh4ki9u7BAaLJ6QdCrmgA":{"text":"Even in the rain, we had such a great time gearing these stories. Thank you for a great ti","useful":0,"cool":0},"QUuiyipjTJ09MVOfsJ-Rlg":{"text":"We had so much fun on this tour! Drew was our guide and he was outstanding!! He was extrem","useful":0,"cool":0},"6J8vl26oYumAF5FNxg64rQ":{"text":"Daphne gave us the 5 in 1 tour which truly gave us the full package of New Orleans haunted","useful":1,"cool":0},"Vb_WT5XKTEfLzr4MZQ2vFA":{"text":"I did the vampire tour while I was here in New Orleans. Daphne was my tour guide. Her deli","useful":0,"cool":0},"RI31KTB5IlbVlMYOnL89_w":{"text":"Jesse was an great tour guide and kept us involved with the tour. He was very informative ","useful":0,"cool":0},"-4z7UqtP6g9Fmk-2p-GWKA":{"text":"I recently went to NOLA for my(long) Bachelorette weekend. It was such an amazing trip and","useful":0,"cool":0},"UuxI3KUuka_eJFa2rTekdw":{"text":"My daughter and I enjoyed the tour and all the history of new Orleans French Quarter and t","useful":0,"cool":1},"1Q9zR3QW26Xypy4TwhFUlw":{"text":"We really enjoyed our haunted French quarter tour. There were other tour groups along the ","useful":0,"cool":0},"ZcivLWpoJP4BpcQyISDVAA":{"text":"Convenient departure point and multiple departure times. Knowledgeable guide, well-orchest","useful":1,"cool":0},"A7AN0E7m0F4v-OkfKDUG9Q":{"text":"Met outside Rev. Zombies Voodoo shop to head off on a cemetery tour.  The tour guide was i","useful":1,"cool":0},"K8MiNlv04cgPU-z7dnIZ_w":{"text":"Awesome tour! Great combination of history and mysterry stories. Out tour guide was very p","useful":0,"cool":0},"cXRd4rxGK_QJ-o5k-ojdOA":{"text":"We took the Voodoo tour with Lyndsay and my group had a good time. We were a large group o","useful":2,"cool":0},"sG0rBR_hP5JZ9Plvf5t-uA":{"text":"This tour was one of the highlights of my trip in New Orleans, thanks to Natalie, our capt","useful":1,"cool":0},"5WUlGTMM0GOCKC94frTQtQ":{"text":"Gabriel is awesome, quirky and fun! Recommend him for a tour to learn more about New Orlea","useful":0,"cool":1},"l1ugNqKLnBaMFgwp2LAjag":{"text":"This was the most highly rated tour on trip advisor so we gave it a shot. We really liked ","useful":0,"cool":0},"-9Q8cRm83pkdRF2U3TFCVA":{"text":"The check-in process was super disorganized and a total nightmare. We waited in line for 2","useful":0,"cool":0},"8TMaaxKw3FE_bmq9XmhRNA":{"text":"We took the tour with Renee and I honestly couldn't have asked for a better tour guide. Sh","useful":0,"cool":0},"ODXrJhlbzz0AYRKiVCxVYA":{"text":"Was super fun. Had a great time. Definitely recommend the vampire tour with Mr Bobby. I ha","useful":0,"cool":0},"ItFoW5OUJYj7htyJOCpBaA":{"text":"Went on the tour last weekend with a friend.  I read good and bad reviews on here but want","useful":0,"cool":0},"Hl58UDbvvOz3e3oAOHh-AQ":{"text":"We took the Cemetery Tour this afternoon. There were so many people that we needed to be b","useful":4,"cool":1},"ePaSHTKh8HfPzo29HHx67A":{"text":"Must have been our guide that was a downer.  He even warned us he would be by stating that","useful":1,"cool":0},"3Mbdl4SAszAl4mQMCkpjQA":{"text":"This was my second ghost tour in New Orleans during my week's stay and first tour with thi","useful":2,"cool":0},"BCxkj_0KXEh9LM7TqUguaw":{"text":"I would have gave it 3 stars but knocked out a point (I should have knocked out 2 points) ","useful":0,"cool":0},"3U1JPBibAT4cn82HeWscbg":{"text":"I went on two separate tours while in NOLA. The ghost tour was with Andrew and he was wond","useful":0,"cool":0},"rDnFjUVkPqXosFN3SKQJNw":{"text":"It was a fun experience! :) Elizabeth was awesome and friendly! Great choice to do if you ","useful":0,"cool":0},"yP0-JroNzELiS_2wUFMaaA":{"text":"Jill was an amazing tour guide! Super knowledgable and fun! She made the your what it was!","useful":2,"cool":4},"_kDxiGzAu05-SrVVDEa5jg":{"text":"This proved to be better than the Ghost tour (see review) because the tour guide was knowl","useful":2,"cool":0},"toL8g7neEchi37RIhv1D5g":{"text":"This was a fantastic tour!!! Our tour guide Andrew was awesome. He really went above and b","useful":0,"cool":0},"WJDCcFDXt5DBHH_6m-xLzw":{"text":"Highly recommended if you have any interest in history, ghosts, and creepy stories that wi","useful":0,"cool":0},"R0WJCKsTudDI8Vca3ilXJg":{"text":"Scandal / Underworld Tour\n\nOn a recent trip to New Orleans, a few friends and I took this ","useful":0,"cool":0},"KjmQXXA_Q4JjVQ79sIImRA":{"text":"This tour was really fun! We were hoping that it was a bus tour since it was two hours, bu","useful":0,"cool":0},"eGhX0rjmD4iJoq_Xy4IjCQ":{"text":"Sarabelle was an amazing tour guide for the 'Ghost and Graveyard Bus Tour' in November 201","useful":1,"cool":0},"ZO_GJBkpjhawEo8f4b6WhQ":{"text":"Came to New Orleans specifically to go on a vampire tour. It was everything and more. The ","useful":2,"cool":2},"6heOPoUCv4JjnxrOtOToAw":{"text":"Amazing! So much fun! Tour guide, Matt, was the best. Definitely recommend! The entire tou","useful":0,"cool":0},"p21b21fGHjm4zIN0F1eCtA":{"text":"Okay, so we went on several tours and because each guide worked extremely hard for us I de","useful":0,"cool":0},"K2jfg6hmNsIZWzplPExzMQ":{"text":"We loved this tour. Our tour guide was really knowledgable and fun. We walked around impor","useful":1,"cool":0},"Lz6ebKZh9RNVakDYX6PwWg":{"text":"We did two tours, the Ghost Tour one evening and the Cemetery Tour during the day. We had ","useful":0,"cool":0},"QSVedbn8ervL7Cex61SxrA":{"text":"We've had tours before, but this one was outstanding.  Drew was our guide and he had a pas","useful":0,"cool":0},"bHYj_KPEvxnG4yn0mRlHpw":{"text":"Definitely worth checking out, we got to go see the oldest bar int he world, a lot of cele","useful":0,"cool":0},"cInzOoOvhpBti9Y468TdVA":{"text":"Tour was great!! So much New Orleans history. Daphne was an amazing tour guide. Really rec","useful":1,"cool":0},"qFd7KVDFs6ZsoZPLXlQPnA":{"text":"I have taken this tour a few times over the years while visiting New Orleans. My first gui","useful":0,"cool":0},"_mJBDlig4pr84gJhEpF_HQ":{"text":"Jack was our guide on this Sunday 8pm tour.  He did an excellent job, he has the perfect m","useful":1,"cool":0},"Yb-P4GO4PJiFBO7a7SmLqA":{"text":"I've spent most of my life in New Orleans, so you might think it's weird that I occasional","useful":1,"cool":1},"29D8BaLnvCSXn0k5TYihkQ":{"text":"Trevor was a great New Orleans tour guide with a lot of character. He shared personal expe","useful":0,"cool":0},"xZCHvntgKooYtJdpzTzneA":{"text":"This was SO FUN! \n\nMy husband and I took the 2:30pm Garden District Ghost Walking Tour wit","useful":0,"cool":1},"M-Q_ufYS_oBxsocjQpFA5Q":{"text":"I live in New Orleans, but my family came in and wanted to take a tour. I'm SO glad we pic","useful":0,"cool":0},"puxeVhQ5ytxU-PgPX2kOeg":{"text":"My husband and I took the ghost tour. We enjoyed our guide and the way she told the storie","useful":0,"cool":0},"cU_PrjO9pcmCWq_6LIaCSA":{"text":"We did the Haunted Pub Crawl. Totally worth the price paid. Our tour guide was knowledgeab","useful":0,"cool":0},"jh6ozzCIkxTQeTmYQDFIfA":{"text":"A great ghost tour.\n\nI've taken a few ghost/walking tours in my time and I would say that ","useful":0,"cool":0},"MPwnp4So54emYm-NZsn1FQ":{"text":"We took a haunted tour with Jesse, our tour guide/ghost buster. It started out at just lik","useful":0,"cool":0},"l7MsW1-BamYjju2zViyzrw":{"text":"I have to say our tour guide really tried. Great guy from missouri and well he knew his sc","useful":0,"cool":0},"D17DGb_jdf_sJ2x1uf9Rnw":{"text":"Go on this tour. In fact, Haunted History offers up a variety of tours in the city - thoug","useful":3,"cool":0},"lHiJQ4CFFUhCTHubv6rrYA":{"text":"This tour was amazing! Adam was our guide - and there was comedy, history and spook! Wear ","useful":0,"cool":0},"GhRsL6vNM6qcZ-3ZNUujjQ":{"text":"I love Yelp because it saves me from suffering through bad food or tours, except this time","useful":2,"cool":0},"xLEwMhpHjTMi7WKLSjUHcw":{"text":"This was the most boring thing I have ever purchased. I wasted two hours of my time in lis","useful":1,"cool":0},"aGiympcLMzNBesTZWSY-Og":{"text":"I went on the Garden District Tour with my family and we had a fabulous tour of both the n","useful":0,"cool":0},"8N5ynDVo5A_JEuqWcHfv7A":{"text":"I did the Haunted History tour during my stay in NOLA this past Sunday.  Randy was fun and","useful":0,"cool":0},"N3otbSpauwtLaLPppHrmfQ":{"text":"Hanuted History does voodoo/vampire/ghost tours but we went for the cemetery tour. We met ","useful":3,"cool":2},"XVxr9dsLFLYi6H-SYaUGOg":{"text":"Without a doubt, one of the best tours I've ever taken anywhere. We did the cemetery tour ","useful":1,"cool":1},"ENZd2rHNsfSYKtCgXRufrw":{"text":"This tour was enjoyable, but (at least during the day) not particularly spooky. However as","useful":0,"cool":0},"YI-a7aOR8BBPjDRSQxEi5A":{"text":"I was excited about this tour on my trip to NOLA. I'm a big fan of haunted\\spooky\\mystical","useful":2,"cool":0},"-thRA0KGqWkmDlHSVivb1A":{"text":"Definitely check out a history tour if you want a little more out of New Orleans than a ha","useful":0,"cool":1},"3KluTVVuA3oG0lDuGlbg0g":{"text":"Did the Vampire tour with Lisa on a Sunday evening, 3/6. She was very knowledgeable and fu","useful":0,"cool":0},"sO_kH90GVf5w9KqqiqhwzA":{"text":"totally boring. But the guide did his best. I think the vampire genre is overexposed and b","useful":1,"cool":0},"9R1JEd46vDjjtrJDC_2Xng":{"text":"This was the worst tour ever.  So disappointing.  New Orleans has a rich history and sadly","useful":4,"cool":1},"jXv1wWA0S0HRZxYu52jNrA":{"text":"As a lot of people have said already, our tour guide Ernie was great!  A ton of great info","useful":1,"cool":0},"gIqM3o2hWZf7b0SqoHID8Q":{"text":"I've been on several different versions of the ghost tours in New Orleans and each time ha","useful":0,"cool":0},"FT1Wyj8FI3V7ofEgUeiTBw":{"text":"Gwydion was awesome! Definitely made our night interesting! Awesome story telling! Great t","useful":0,"cool":0},"HQl15iV2CfFkJFoFrKdyEw":{"text":"Wear sunscreen... because Ernie is actually more fiery than the sun. It is possible, peopl","useful":7,"cool":0},"qCTPOvbVIVUC3TFUsJH9jg":{"text":"My friend and I were in town and stayed at an Airbnb. We really wanted to see a ghost tour","useful":1,"cool":1},"rbT3T1VyAtPUmi0mc3sr8Q":{"text":"We came to NOLA on a short trip and decided to do this tour. Our guide, Lucy, was super an","useful":0,"cool":0},"T6zBUFgHUIAR5jG-lIfX5A":{"text":"Fascinating tour with Gwydian; he's personable, thoughtful, and knowledgeable. The tour wa","useful":0,"cool":0},"ujtPlEPaXdW_jHVkx4815w":{"text":"My husband and I come to New Orleans several times a year and we have never done a tour he","useful":0,"cool":0},"GmhkG0fp368ub_JHeVX5TA":{"text":"These are the best haunted walking tours in New Orleans.  The guides are informative and e","useful":0,"cool":0},"jXx-SuZ53n941ebrN4lEdw":{"text":"We went on the Ghost Tour with our awesome tour guide Gabriel, who was quirky,fun and  kno","useful":0,"cool":0},"inyz2rrnmAZEahdwzdoNrw":{"text":"Best tour we took out of many in our week in New Orleans.  As many reviewers have mentione","useful":0,"cool":0},"0UcDlZM0anVG1W7vV7IBoA":{"text":"We had an incredible time. DREW was super knowledge and entertaining. I learned a lot and ","useful":0,"cool":1},"3nViHuncSRYlX6zkQC4LhQ":{"text":"We went on the 8pm tour with Randy. He has a contagious passion for and is very well educa","useful":0,"cool":0},"P21DB9BAzDivt8hccAusWQ":{"text":"Very good tour with Johnathan. He was a very  knowledgeable guide. Plent of stops and good","useful":0,"cool":0},"puaEAptNCq3WMaUiauBEkw":{"text":"Skip it, you can do the tour yourself by googling places. No seriously, I did some researc","useful":1,"cool":0},"XgyMfCnwRD-KEC6liW1g0Q":{"text":"My wife and I did the Cemetery tour.  It's more a history tour, not a haunted tour.  Ernie","useful":1,"cool":1},"2I0m_ToB-Z1IHH9N8IYWHg":{"text":"My son and I spent $90 for the night cemetery tour which was supposed to last about two ho","useful":0,"cool":0},"yVLCHlbfexCe7tHGAyLRpw":{"text":"This was a nice night (or evening) tour of the French Quarter with anectdotes about differ","useful":1,"cool":0},"JpmBJmoooETEpYhsZuRwHg":{"text":"What an amazing tour we had. Our tour guide Ernie was fabulous. He was able to keep the to","useful":0,"cool":0},"twldIHvDglxutGERHOnKZw":{"text":"Great tour! It was a great mix of history and ghost stories. Ari was an amazing guide! Ver","useful":0,"cool":0},"aOChetUUnDCWopuELP-10w":{"text":"We just did this last week while in NOLA, really fun!  The tour guide, Jennifer, was reall","useful":1,"cool":0},"pf6UsF2xMjqk8RTnxsssiw":{"text":"We did the Vampire and Ghost Tours on different nights.  The first night we did the Vampir","useful":1,"cool":0},"o-jhZXIdleQMvRwNRYoixQ":{"text":"Super fun tour. It was a little hard to figure out where to find them in Jackson Square (d","useful":2,"cool":1},"7JtK0qgRwDXd8-dT9fQVOA":{"text":"Lots of walking but a lot of cool stories and information about New Orleans history. Our t","useful":1,"cool":1},"P7ps0QyF65_b-32-MRLfTw":{"text":"We took the Haunted Pub Crawl tour with Drew and frankly, it was one of the best tours we ","useful":0,"cool":1},"Q3_1pWBCG8jgyKuIq9lvQA":{"text":"Ari was a fabulous, theatrical and friendly guide.  We learned so much and were a little c","useful":0,"cool":0},"eG2bWkXWVKMsMt43DThs2w":{"text":"My friends and I really enjoyed the Ghosts and Legends Tour. The material was genuinely in","useful":0,"cool":0},"joqBmYny6O3XJpFvPwhiaA":{"text":"First off: Trisha is an incredible storyteller and warm, funny tour guide. I felt myself w","useful":0,"cool":0},"jXiZneRPG_sOfhIXW89rqg":{"text":"Last night we took a Haunted History ghost tour in the French quarters and I must say we w","useful":0,"cool":0},"zTSKx1EkO-7t5JIm8DB36A":{"text":"We took the 5 in 1 tour. Trevor was very informative and had the large group laughing.  Hi","useful":0,"cool":0},"eX7WbM6a16MtW_0VoBwwyQ":{"text":"We did the Vampire Tour with Lisa on our last night in New Orleans, and it was one of the ","useful":1,"cool":0},"fuNNDBRmB75chZhOOq9e2Q":{"text":"I had the absolute best time on this tour. It's a little goofy, as most ghost tours are, b","useful":0,"cool":0},"BPfpK78rnAKkEgNnG741bw":{"text":"We first did the St. Louis Cemetery 1 tour with Andrew and then an hour later did the Ghos","useful":0,"cool":0},"8Ar5MDFHvj10QWvNVMksqQ":{"text":"I can not say how awesome Will was as our guide! He really knew his history and he present","useful":0,"cool":0},"HjsHxAmd0duR09JvVJyxpw":{"text":"My favorite tour the entire trip! My tour guy was awesome! It wasn't one of those boring i","useful":4,"cool":2},"aM-8PSYeECSMlVHjBuyAJA":{"text":"Doug did an exceptional job of keeping us interested and entertained on the pub crawl. His","useful":1,"cool":1},"rYyqyFDaJZ4jt00KOMvJBg":{"text":"We did the haunted pub tour Saturday 14 with \"toast\" our tour guide.  This was a 50th birt","useful":1,"cool":0},"LGuPC-HCSWJnH_5bGSVFEQ":{"text":"I am actually on this tour right now - he tried to kick me off the tour for leaning agains","useful":1,"cool":0},"wQUbtm-KJ2YWTBZGWJQhwA":{"text":"Great tour! Toast was the best tour guide and storyteller. He answered all our questions, ","useful":1,"cool":1},"SEssLWNXLkoKDpaeXI_O8g":{"text":"My friends and I had a great time on this evening tour as part of my bachelorette weekend ","useful":0,"cool":0},"XugsYnHMGxZY9L8DHR_Lkw":{"text":"This company offers several tours. We did the Scandals Under World tour.Our tour guide Ran","useful":0,"cool":0},"5ghyMMBxVRegQ4xwLH4iSQ":{"text":"We scored a bonus night with 2 guides, Midian and Jennifer (or Julia? I'm sorry, I can't r","useful":0,"cool":0},"Gf5wpOFsJhwYGEpSP2Gs9g":{"text":"We had so much fun walking around the city with Andrew on the ghost tour!! He makes the to","useful":0,"cool":0},"A73GkaEmY4YmT9BIPO1NQg":{"text":"Jack was an animated tour guide that made our ghost tour very exciting. We did the walking","useful":0,"cool":0},"5rj8RYoLpVcDpxWR0wN6dA":{"text":"My tour guide was not good at all, and the group sizes are too big.  I skipped out before ","useful":1,"cool":0},"I0LFlztiJHsbNRTpEng6Uw":{"text":"Daphnis was such a cool guide, and very familiar with the area. Super chill, knew here sh#","useful":0,"cool":0},"ypN_pCyDfAX4Q96mPEA3Cw":{"text":"Gabriel was our tour guide, and was very knowledgeable about all New Orleans history. We h","useful":0,"cool":0},"xqRLzyfYNo1oGhpurRRf0A":{"text":"What a great night!  Adam is a fantastic host and not only shared laughs but also a great ","useful":1,"cool":0},"u3Uf9qBf7HDGI2_mP6WpYg":{"text":"It had been several years since I had taken a haunted history tour when I decided to do th","useful":1,"cool":0},"6GSjDMFd641pINGXaU6CJg":{"text":"I brought my niece to New Orleans specifically for a Haunted Tour.  After reading all the ","useful":0,"cool":0},"Awt6Hot0XFSrFLXbxlU_cA":{"text":"Doc was a wonderful your guide. Very knowledgeable, articulate, and well spoken. Had a won","useful":0,"cool":0},"BiJJSYXLV6aEwYyVPdgp5g":{"text":"Great tour guide. Kept us entertained, provided interesting information while making sure ","useful":0,"cool":0},"0r9sJMAIItD71oOkj_A70Q":{"text":"This tour was the best ranked when looking online for tours. I am 99% sure our tour guide'","useful":1,"cool":0},"p2J3JFl3yjZKm0Gjd0cdsA":{"text":"I went on the Haunted History Tour the friday before halloween this year and we were on th","useful":0,"cool":0},"Z16Ph9nfqMyXNIKEr2wUUg":{"text":"My daughter and I took the haunted history tour on July 1, 2017 and Ernie was our guide. H","useful":0,"cool":0},"nPHR4HjXzy0laQfS_rcKDw":{"text":"This was my first trip to New Orleans and I had heard that I needed to experience one whil","useful":0,"cool":0},"8AGZEKbqOrXu4VirDK9g5g":{"text":"Just finished the French Quarter tour with Gabriel- he did a great job and we learned a lo","useful":1,"cool":0},"1OJHR5WpDL5TCzIeRdPy5g":{"text":"A series of lackluster ghost stories, corny jokes, and a wee bit of history delivered in j","useful":1,"cool":1},"hPv3ZggVrxX4Xieee4YWEQ":{"text":"Renee and his demon dog were our tour guides. Fun, not scary as anticipated, but full of h","useful":1,"cool":1},"00qYcAn8KrpC7HUW-DVdIg":{"text":"I took the Cemetery and Vampire tours and enjoyed both of them very much.  I was very surp","useful":0,"cool":1},"O-OhOd7sqOoCJi7j1oIFWQ":{"text":"It was sooooo bad. Let me give you the breakdown. \n- first it was bullshit from start to f","useful":1,"cool":0},"Pirsr-wWNorkBu_FF3-YYQ":{"text":"The tour was amazing! New Orleans is my most favorite place in the world, and our tour gui","useful":1,"cool":1},"JtZ3oFp8FmEUuZUChJWpBw":{"text":"We really enjoyed our tour. Our guide, Ariadne, knew a lot about each stop on the tour and","useful":0,"cool":0},"kFQZymqvcVI0PaxTQZCFQw":{"text":"We booked 3 tours through this company and each one was great!\nOur first was the Dead of N","useful":1,"cool":0},"9u9nFAhb0F4c2KRoQGMJBg":{"text":"We went on the 1:30 pm New Orleans Cemetery Tour on 08/27/15 with Ernie.  He was a fantast","useful":0,"cool":0},"Vt9yLz8nOw1lLy78cNhGuA":{"text":"For $20 a person, it is a great educational experience. \n\nMy husband and I went on the Sun","useful":0,"cool":0},"gEFAeFFh9spw20BpOp6vog":{"text":"We spent 3 days in New Orleans and took 3 fantastic tours during our visit. All unique and","useful":0,"cool":0},"dlKaK5Fu4B6CkmBIcaa1Gg":{"text":"Just finished our ghost tour with George. He was very friendly and knowledgable, I definit","useful":0,"cool":0},"0wLc1ttWEgeqlmLk-jIYbw":{"text":"A FANTASTIC TOUR, but make sure to only go with Jonathan Weiss as your guide.\nI have been ","useful":0,"cool":0},"Si_M-npoJwWRlTtDDe2_ug":{"text":"I've done this tour twice and love that the stories are based in actual history instead of","useful":0,"cool":0},"Jd-I7iEK8UgzOUjm5K2B3w":{"text":"Andrew was very knowledgeable. We took the 5 in 1 tour since we were strapped for time. He","useful":0,"cool":0},"KTNzn6Tmv6TmCQ9Ywls_Zw":{"text":"This was one of the things I was most excited to do while in New Orleans. I thought a vamp","useful":2,"cool":0},"2IZnuafyDCvohwZGlJh9aA":{"text":"No nonsense ghost tour with tons of history. If you want a tour that isn't full of crap wi","useful":0,"cool":0},"vXrAWLjRmtwg7P7R4h-c1w":{"text":"We had Drew as a tour guide in the garden district and he was FANTASTIC!!  Not only did he","useful":0,"cool":0},"fFiT9O0O3ohQ_Q49Ei022g":{"text":"As a local sometimes it's fun to play tourist and then again when I do stuff like this som","useful":2,"cool":0},"bejrHjLm7Xnc4WyQsClR8w":{"text":"Our tour guide Ernie was very knowledgeable about history of New Orleans as well as the ce","useful":0,"cool":0},"uKdE9k2p4aLu-ERCy1W4Yg":{"text":"Toured December 13, 2018. Best thing about this tour is that the meeting place is across t","useful":0,"cool":0},"dB_APYnMOsgRGO3vMWI-KA":{"text":"This is my first trip to New Orleans, during my research of what to do here, these tours c","useful":0,"cool":0},"MGybROd8QT7ySRq2GTv7Bg":{"text":"We did the 5 in 1 walking tour and it was ah-mazing!!! Stevie is the best! She has such a ","useful":0,"cool":0},"aIFJMWYBx7U9LJ1z4yx9KQ":{"text":"Went with three friends to the Vampire Tour with Lisa. She was fun and explained everythin","useful":1,"cool":2},"lXMZRnTWvX3SqWz-D817Fg":{"text":"We had attended the 5 in one tour with our tour guide Trevor.  He was extremely entertaini","useful":1,"cool":0},"UKVbMJ4R2GdvAyCE9lG1mg":{"text":"Loved this tour!  Our tour guide was extremely funny and cocktails while learning your loc","useful":1,"cool":0},"pROXVYs48_9AS9V_UDamvQ":{"text":"We did a 6pm tour on a rainy night - made it a bit extra spooky. Ari took us around to the","useful":0,"cool":0},"X8TRe5IKLsPNdVrOB8hN3w":{"text":"Andrew was our incredible tour guide! His sense of humor was always cracking us up and he ","useful":0,"cool":0},"w_k2oxPTWelWa6u_JymvYg":{"text":"First of all this company is the worst and greediest Ghost tour company I have encountered","useful":0,"cool":0},"E7x5JMbAzhy9feqHH3TK4A":{"text":"My wife and I went on the Vampire Tour earlier tonight... Lisa was THE BEST! She was infor","useful":0,"cool":0},"C9qr0tL85jbc7mY3HzSoxg":{"text":"Toast was the very best part of our entire trip to New Orleans. He was absolutely hysteric","useful":0,"cool":0},"nOoUl2oB9lYP1CVQFkd0VA":{"text":"We did the ghost tour,  and it was not a total waste of time.  Our tour guide,  Laszlo, wa","useful":1,"cool":0},"Dt9t6-hfTn61glJQaUcMtQ":{"text":"I took 2 ghost tours during my weekend in New Orleans. The first one, in the garden distri","useful":1,"cool":0},"VxhCQFleEarSyXeHNEFJew":{"text":"I really really wanted to go on a cemetery tour when I planned my NOLA trip and I'm so gla","useful":1,"cool":0},"5cins0PpKtQ-mEc0WPGw8w":{"text":"We took the Ghost Tour with Lucy and the Cemetery Tour with Ernest. Both tours and guides ","useful":0,"cool":0},"1VQ8V1VAQnwTVxPtUUOFEw":{"text":"Lisa was awesome. Lots of fun and worth the money and tip","useful":0,"cool":0},"Q1k_MmessR-WC8sVAvUgRg":{"text":"drew's the best. i usually hate history and also hate tours and i loved this one so that s","useful":1,"cool":0},"5KyXIbOg4BcOugSp7qHghQ":{"text":"Atmosphere / Location - Well worth it...  Had a great time walking around one of the most ","useful":0,"cool":0},"4lBiUNxhHpUUTyved5bZBg":{"text":"We did the vampire specific tour on May 25. It was Memorial Day weekend so the tour was cr","useful":0,"cool":0},"P5AOySyJP-eoFeCdBuKexg":{"text":"Katrice was our guide and she was awesome!  She did great job of telling stories, going in","useful":0,"cool":0},"qRxrrLbddphCdIKvb3ZByQ":{"text":"Walking tour?! With a guide? Bah.  All my past experiences have led me to believe that wal","useful":5,"cool":1},"NDmmlK31mMknA6zTW5UXEg":{"text":"Jonathan was great! Informative, hilarious,  knowledgeable and nice. We want to now learn ","useful":0,"cool":0},"tziMZck9AyZCDz9wlp6qhA":{"text":"We did the Dead of Night tour at 930pm with Toast. He did an amazing job with our tour! He","useful":0,"cool":0},"TPghQbpxlMoxfbock343Vg":{"text":"Andrew was awesome! He was informative, knew a lot of historical facts and added some humo","useful":0,"cool":0},"7GMzqzz9Deo-uYZf5nnHjQ":{"text":"The tour was cool especially if you are history buff. Don't plan on going into places and ","useful":0,"cool":0},"9nTYOg-pghKyHh2a_kx9Ww":{"text":"We did the Voodoo tour. Lisa was our guide and she did an amazing job.  Th group was a goo","useful":0,"cool":0},"bN7yKAqzXwUrUvqxMSbL1A":{"text":"We did the 930pm tour on a Friday! We were lucky that it was not booked. Sara was the tour","useful":1,"cool":1},"713lNtKpATk3L4fH7_KrWg":{"text":"The tour was not amazing. You don't get to actually see much...  Not to mention you'll hav","useful":0,"cool":0},"_-NEj1yVkqVO3nwSSDnumA":{"text":"This was my second tour of the cemetary in 5 years and Haunted History again came up short","useful":3,"cool":0},"RBYWwsrUTTdZWatq9ald_w":{"text":"This was my first tour and it was fantastic!! Our guide was wonderful, entertaining and kn","useful":1,"cool":0},"XDGYjo2jMX0SKKi5Ec8odg":{"text":"I was disappointed with my tour.  I had been on these several times through the years. How","useful":0,"cool":0},"x77MhKmzZaD63q75bE0piA":{"text":"We did the Cemetery Historical Tour and loved it. Plenty of breaks in the shade, a reasona","useful":0,"cool":0},"f_S6MwlDRj8NyO08qoTm5Q":{"text":"Me and my friends did a haunted pub crawl with led by Tiny. He was fantastic! It was a gre","useful":0,"cool":0},"FaOaQCddkj7j8uuSLvxc1A":{"text":"It was ok, but I wouldn't take another tour with them.  $20 + tip for not much.  The guide","useful":2,"cool":0},"87uOI55q9Va90aC_D7nnXA":{"text":"Went on the voodoo tour with Daphne. Was very informative and you get to visit two voodoo ","useful":0,"cool":0},"UNvo9GM-UGDdSy-R0sO39Q":{"text":"I am a huge ghost and history person so I make sure to do a tour in every city I visit. Th","useful":0,"cool":0},"hIYMkWJr0ItBhJJove2s-w":{"text":"This tour was great! Much more than I expected! It's two hours of walking around the Frenc","useful":2,"cool":0},"mVIui_MqVmPaWUw_jPFQLA":{"text":"Was very dull could have got a book for a few bucks and took tour myself it was so uninter","useful":0,"cool":0},"ha3IJFsjd3fbIYfgyyfciw":{"text":"So pleased I did this! I was only in NOLA for a few days and wanted to soak up us much cul","useful":0,"cool":0},"4zSUM13V2A9iSuKTmmISIA":{"text":"Sarah was our tour guide and she was great! A great actress and super knowledgable about t","useful":1,"cool":0},"tJ3bM0s7AYHYe0ZL-MHU-g":{"text":"Took the 5 in 1 tour at 5 pm yesterday with Rose. The tour itself is nothing special with ","useful":2,"cool":0},"Eb1_2gIyQINXUiaUam_neQ":{"text":"What a fun night out. I had friends visiting from out of town and thought what better way ","useful":1,"cool":1},"wb3C2y7ppDhjSO-O54XRnw":{"text":"Tiny was our tour guide and he showed us an amazing time. His enthusiasm, energy, and know","useful":1,"cool":1},"xfDvwD2H35PuAZiJe_umEQ":{"text":"We had Jerry (Jarry?). This was the second tour we went on from HHT, and it wasn't any bet","useful":2,"cool":0},"NKBt33N0ISWPjnZX2YgMBA":{"text":"Guy told too many jokes...about 25 percent of them were funny.  I wish it would've taken u","useful":0,"cool":0},"qUpne4gMyaZqtrh15TUOFQ":{"text":"I've done a couple of haunted tours on trips to Nola and I'm sad to say this one was the m","useful":2,"cool":1},"pFEU4yg62_w9B4cCmzBPkQ":{"text":"The tour we received was amazing.  Our tour guide Adam was terrific, he made the tour fun.","useful":0,"cool":0},"bbqvFMUAiRMripVH-XntlA":{"text":"The tour was a major let down.  While it was fun to walk the quarter and see some of the b","useful":0,"cool":0},"pq31Tx9DwXUOwlvTMxCPzw":{"text":"My girlfriends and I went on the Vampire Tour. Gwydion was an awesome story teller and hig","useful":0,"cool":0},"UOHzvxzcAiz_QZpdc0dHLw":{"text":"Pretty awesome tour, with an awesome guide. I can't quite remember his name, but he had so","useful":0,"cool":0},"pjfBL6cJannlknaeudN5Gg":{"text":"Do yourself a favor and request Randy as your tour guide. This guy was exceptional. He's a","useful":1,"cool":0},"zHiynhujfFbkd9uTRN030w":{"text":"Our guide, Daisy, was very energetic and phenomenal at telling the stories of the differen","useful":0,"cool":0},"yAkOjD9r_4syjNg-J_iYbQ":{"text":"My boyfriend had taken this tour before, but we decided to take it again and see the spook","useful":0,"cool":0},"A8m6VDWHhAjpNXVGdtVvGw":{"text":"I love to play tourist everywhere and this tour was fun.  Ernie was our tour guy and he ha","useful":2,"cool":0},"wyJwEgvEE93_vCJMxHPZ2A":{"text":"We were in New Orleans for a long weekend and wanted to learn more about the supernatural ","useful":0,"cool":0},"JJQKlSth_FNrry91YCw1dA":{"text":"A couple years ago I did the ghost tour which was awesome and informational. Last night I ","useful":0,"cool":0},"pvyh1tvoCD11rvaXns3u5w":{"text":"I loved this tour. Our tour guide was great. He was very  nice. He explained things we did","useful":0,"cool":0},"YYLJdULQv384fORL3bjB2g":{"text":"The idea of the tour was great, however, our tour guide (Renee) was very passive aggressiv","useful":1,"cool":0},"IwysmtTepN4jslsi88qMgw":{"text":"We did the Scandal Tour with Drew last night and it was awesome! It was really interesting","useful":0,"cool":0},"kGEw__4k2XfF_bncAWElzQ":{"text":"What a great tour of the St Louis Cemetery. Our tour guide was Ernie. He was fantastic. Fu","useful":0,"cool":0},"x1E3OJtufgJUPixO5A1egA":{"text":"I took the Garden District tour with Drew and highly recommend it.\n\nI called a day before ","useful":2,"cool":2},"OwWOHvWM5t4BBM1T5_DrzA":{"text":"I've been way down south to sweet ole' New Orleans 6 times... and every time I still play ","useful":0,"cool":1},"wKDwv-D2qSRixbvr43TVBg":{"text":"Did the 5 in 1 last night. Wish tour was a little longer but our tour guide Matt made the ","useful":0,"cool":0},"Akl4QhMfhCD-AOdbW6k6SQ":{"text":"We had Will, and he was incredible.  He had a bunch of energy, and really seemed to enjoy ","useful":0,"cool":0},"0NH0saApuwGK6w3d7YtOnQ":{"text":"My niece is in town and all she wanted to do was take a ghost tour.  I booked one for all ","useful":11,"cool":10},"5U1nZ5Ay9otUGZhiDuREXA":{"text":"If you're in NOLA this is a must do tour and make sure you take it with Lucy!!! She was am","useful":0,"cool":0},"Btk5fk69cZ3tBwjl_0OPlA":{"text":"This ain't your high school history class. Say what you want about boring history lectures","useful":1,"cool":0},"NFmOUCnpSA4N-RJU-7k9Ag":{"text":"Ernie was amazing. I was surprised when we received SO much history about the city, beside","useful":1,"cool":1},"8kzoPElqwyccMCvCyaRYaA":{"text":"We only had time for one tour so we decided on the  5 in 1 tour. Lisa was our guide and sh","useful":1,"cool":0},"D5V0jFp6ryO8Tcfo-DR5FQ":{"text":"5 in 1 Haunted Tour \n\nFact... You walk around the French Quarters for two hours.\n\nFact... ","useful":0,"cool":0},"3hQyzc8AKRSBQy7xcPb28g":{"text":"This tour guide company offers several different tours. The only one that is scheduled ear","useful":0,"cool":0},"LWQ1oknKVSaAxQii9dCMqA":{"text":"On this vacation trip we did two tours. One a vampire tour with Gwidean  which he is amazi","useful":0,"cool":0},"HGEY6AbQz6jhimLckMOAUQ":{"text":"This is a must do! My husband and I are both first time visitors in New Orleans. We did th","useful":0,"cool":0},"CIho5uR_D_aE4GewM04hxg":{"text":"Amazing tour company! A friend and I did the 5 in 1 tour and had a blast. Our guide, Gabri","useful":0,"cool":0},"HyZXqN1Fih8WJf_mdls6pw":{"text":"Not very scary, not very entertaining, had interesting bits of the cities history and cool","useful":1,"cool":1},"-ksRuNwRPA-xCRSHHme_gw":{"text":"We took the Ghost Tour with Jonathan and the Cemetery Tour with Ernie, and both were excel","useful":0,"cool":1},"hvyfNNWrV53oCy9uC5tCUg":{"text":"I took the French Quarter Haunted tour and it was well worth the $20 per adult.  Lynn was ","useful":0,"cool":1},"_NAi7rbQfOciy2rud01d8Q":{"text":"Had a great tour tonight with Gydion. Had a great time and it seemed true to the history. ","useful":1,"cool":1},"8UnSlX_o7BYKBsMSOFOuvA":{"text":"We did 3 tours!\n1. VIP bus tour\n2. Dead of night ghost and graveyard bus tour\n3. 5 in 1 to","useful":1,"cool":1},"QhUS6PlRwC0bpbCH_vvGpw":{"text":"This tour is worth doing.   It gives an incredible history of New Orleans, as well as a gl","useful":0,"cool":0},"Sb_ZXC0vk4fVfIrVyWSoKw":{"text":"While visiting NOLA I went on two tours by this company, the 5 in 1 and the Cemetery tour.","useful":0,"cool":0},"qs5Etzo-7SCDtFscIsUTsg":{"text":"Oh Man, where do I start?  My sister booked this tour prior to arriving at NOLA.  The tour","useful":0,"cool":0},"RvRr2ZmD8QTrHtvhDtWPKw":{"text":"Went on the voodoo tour and didn't like it very much. Not what I expected. We left early..","useful":0,"cool":0},"BRMgVCHomh96rmavXesr0A":{"text":"In my opinion this new Ghost bus tour was not worth $45 ... It felt like we spent most of ","useful":0,"cool":1},"ldsvMGUQRdV5xtdV0atS6Q":{"text":"Awesome tour! Would definitely go again and highly recommend. We wound up dropping halfway","useful":0,"cool":0},"uXGYQM0HXOk9TRBxqDr17Q":{"text":"Went on French quarter ghost tour last night. Clint was our guide. He was engaging, witty,","useful":0,"cool":0},"7N-Dz8Bbbw4qmU3mEru7Zg":{"text":"Lisa is the best guide.  This is not a scary tour. It is, however, very informative.  It's","useful":2,"cool":1},"hg6Hbh1qMJnXmsUs9h-8Zg":{"text":"We took this tour this afternoon at 2:30 and our tour guide was Drew. He was wonderfully i","useful":0,"cool":0},"qRO4Dj7G5EXyUYrH0p4lYA":{"text":"First of all, I would HIGHLY recommend this company to anyone looking for a good tour guid","useful":0,"cool":0},"n-XdNglFUhDz5aNbCYJbgg":{"text":"29 people and one guide gathered on French Quarter sidewalks is way too many. For $25 a pe","useful":4,"cool":1},"LUwNIy4LQOHwccSbVTZLfA":{"text":"We learned more about New Orleans ghost from our waiter at the place we ate at after the t","useful":1,"cool":0},"_HLXs51TzV_Dlaacp0KFeg":{"text":"Ghost tour with Moira was so enjoyable went back for the Vampire tour with guide Gwydion, ","useful":0,"cool":0},"fROXjie4nTRRV4RTb2Bgeg":{"text":"Always the best our in town!!!! Brought some Friends to Nola This weekend did the ghost to","useful":0,"cool":0},"oUd_JEMTrjcy-32p_F2prg":{"text":"Wow this tour was amazing! We decided to do a haunted tour on our second night here and so","useful":0,"cool":0},"Nk3_kqJMf_Ami4Knhsr0wA":{"text":"omg i am terrified of ghosts and paranormal activity! but i wanted to learn more about nol","useful":2,"cool":2},"WJC_C4d8EfJDoLH9LMfhvQ":{"text":"Signed up for the haunted pub crawl. Drew was our tour guide and did a wonderful job! Not ","useful":1,"cool":0},"2f3snKMQLO2Y076lnaQ0Vw":{"text":"My friends and i had a great time on this tour! Definitely should check it out. It was on ","useful":0,"cool":0},"sQDM-lVrpH-klfaKPSIG4w":{"text":"This was a wonderful family friendly haunted history tour. We didn't see many ghosts, or a","useful":0,"cool":0},"nbrY3Lru0s2Cvhfz8Ezhwg":{"text":"If you're going to NOLA and you wanna take a ghost tour, I HIGHLY suggest Malika to be you","useful":0,"cool":0},"Xh2wgUKVCIFgXJLeEPNCkQ":{"text":"Our tour was awesome! Gabe loves his city and shared so many unexpected jewels with us thr","useful":0,"cool":0},"yHI6MO5GCJMiFveRmUlk2Q":{"text":"We took a cemetery tour. Our tour guide was very knowledgeable and funny. We had a great t","useful":0,"cool":0},"jquUMeB5qkVNn9WZ9DEHnQ":{"text":"Chrissy was awesome. She's really animated and believes what she's talking about. I don't ","useful":0,"cool":0},"QuhfT6USoP1hqlIWw3vKuw":{"text":"Wendy was rude and not very knowledgeable and we were rushed through tour. We will never u","useful":0,"cool":0},"jveWPO7pAqPnFYCdrUfvug":{"text":"We took tour two tours with this company. The Cemetery Tour and the 5 in 1 Tour. Stella wa","useful":0,"cool":0},"9JIB16HKGzrCsI8dVmYx1A":{"text":"We went on the French Quarter 5/1 Combo Tour. Our guide Lisa was energetic and entertainin","useful":0,"cool":0},"iGzXuBpbMIsRUL9gV13tXQ":{"text":"I'm so glad we did the the vampire tour!  I almost didn't after we chose to do the cemeter","useful":1,"cool":0},"pVR4NuPfj5BZO48oLWgLmw":{"text":"This tour was so informative and so interesting! Lucy was such a great tour guide. She is ","useful":0,"cool":0},"MmVdJUvadY9Xn89lct-CbQ":{"text":"Douglas Bookhouse was an amazing guide, very detailed and patient with our group. Worth ev","useful":0,"cool":0},"2DDNhlYV55V557snS6qhug":{"text":"We had the best Haunted Pub Tour with Tiny last night! He gives a great history lesson, in","useful":0,"cool":0},"xkPAHtMuu5kay7zr7mR-hw":{"text":"Ok , so my  friends & I were excited about taking the Voodoo Tour we thought it would be c","useful":12,"cool":2},"B42gu6F_4NJ2gkKWGsFxBQ":{"text":"Tiny was the best. He's very funny and a great story teller and very accommodating when 2 ","useful":0,"cool":0},"AGmCYtwM6cicyrsF9k0W2w":{"text":"Def get Gwydion for your tour. His personality plus voice plus reccomendations after the t","useful":1,"cool":0},"0_aBiQAcbyjxsGskulKIUw":{"text":"Great and very informative tour! Highly recommend. Dauphine was an amazing tour guide. Tha","useful":0,"cool":0},"aShnT2ynGNAMdNurjuxz3Q":{"text":"Recommend the 5 in 1 with Drew! He was super animated and had me and my boyfriend interest","useful":0,"cool":1},"8zmx6u9pyiC-Vzww2SXkOA":{"text":"Toast was a great tour guide! Very knowledgeable, very funny, and VERY easy to hear, which","useful":1,"cool":1},"2x-QqzjSDD4wsBDRglqpWA":{"text":"Great way to learn about the history of the city!  Had family in town and we took the haun","useful":0,"cool":0},"vLsHTfP40gyZMPml56qmzg":{"text":"We went on the French Quarter Haunted Pub Crawl guided by Doug whom was AWESOME! Amazing a","useful":0,"cool":0},"FTobCQf2Nt3XkHoCkSRKcg":{"text":"The 5-in-1 tour was great, and Gabriel was a great tour guide. I've done previous tours in","useful":1,"cool":0},"LrzOyGR-ZI_Zz8eL1dWCJQ":{"text":"This was a great tour.   We walked along the French Quarter and were given stories of ghos","useful":0,"cool":0},"GhG0oYaRLLrAV892UdXKOg":{"text":"We did the 5 in 1 tour and had Chrissy as our tour guide. She's good, knowledgeable, and e","useful":0,"cool":0},"tP-OIRq2QeCdPcwHErBpxg":{"text":"Ive been coming to New Orleans for many years and Haunted History Tours is the best hands ","useful":0,"cool":0},"V92jvDIwJz8DuT9pGBKZwg":{"text":"i took this tour before a few years ago with ouisa (she was great then) so i had to do it ","useful":1,"cool":1},"-AjjiZkqmF_F_BEbl5lhdQ":{"text":"Lucy was our tour guide.  She was very good at setting the mood for each of the locations ","useful":0,"cool":0},"NsFgI9Wccju508WuZmpMzg":{"text":"Ok, first off this tour was totally amazing. It was informative and historical, so for a h","useful":1,"cool":0},"eBcFuM08hHdczULrwxY10w":{"text":"I want to give a shout out to our #1 tour guide, Drew! He led a fabulous tour ghost tour o","useful":1,"cool":0},"1eQZSkJR1an-sIJDH1FFsA":{"text":"Drew was absolutely amazing!!! We were a group of 10 and Love the Pub Crawl haunted tour. ","useful":0,"cool":1},"3m3ySBnhYcYKEjzvp-EPDw":{"text":"Went on the cemetery tour this morning with Gabriel as our tour guide.  It was fascinating","useful":0,"cool":0},"GV7KQJslVWm2QkHC9yGNZQ":{"text":"We've been on haunted tours of Charleston and Savannah this year and by far Daisy's tour o","useful":0,"cool":0},"3U0-z3LwcyfYly1wTg46Mg":{"text":"This tour was just awesome! Tour guides were knowledgeable and tons of awesome stuff to se","useful":0,"cool":0},"7n76zWL1lRpADUK9FHmLjA":{"text":"OMG!!! We went on the 5 in 1 Tour and It is so STUPID!!! Total FALSE ADVERTISING!!! Our to","useful":0,"cool":0},"hWLYMp1v7M_N67lXZPoEzQ":{"text":"I was prepared to sh*t my pants, but I left the tour sh*tless. You don't know how disappoi","useful":0,"cool":0},"2YCnpzOsaH63Vn0lWmmOrQ":{"text":"I know I am SUPER late to this review, but I couldn't just ignore it!\n\nI've done a couple ","useful":2,"cool":4},"N-77xGVuzLMoZnzh0bHp_g":{"text":"This was a great tour! My moms been dying to come down to NOLA & this was one of the ones ","useful":0,"cool":0},"VnXIjKWNYgXsJdUZRAE5VA":{"text":"Had a blast on the tour tonight!! Sedna (omg can't remember her name but it wasn't Karen) ","useful":0,"cool":0},"gyJdXUgNKXJaqZz_s8QZyw":{"text":"Did the 5 in 1 walking tour- ghosts, vampires, voodoo (forgot the rest lol). Definitely re","useful":0,"cool":0},"mWJaWuU8JkZQ3KFzFn_7ug":{"text":"Great tour!   Our guide Drew was very good.  He was very informative, entertaining and han","useful":1,"cool":0},"QoMe9nL29oKTe8q0Xd91tQ":{"text":"Sarahbelle was an amazing tour guide! She was funny, fresh, and told great stories! She is","useful":0,"cool":0},"EoZ97N3jJhYImDf09yXzyg":{"text":"We took the French Quarter Ghost and Ledgends tour.This was a great tour.. We had lisa as ","useful":0,"cool":0},"KpDDH1w_5g9F8HvLAfxXLQ":{"text":"A engaging ghost tour of the French Quarter. Some of the stories sound a little too far fe","useful":0,"cool":0},"n__e4K9Fp8XbUpNKF7bj4w":{"text":"We did this tour on our last night and our tour guide Cassidy was amazing - a wealth of kn","useful":0,"cool":0},"t_X7WhOYQ34s9KvLcmLeCA":{"text":"Highly recommend the Haunted Pub Crawl!  Very entertaining.  Our tour guide, Doug, was ver","useful":0,"cool":0},"NJ4QeTnEiCCOsQnPxSQ3og":{"text":"This was a pretty fun experience. I don't believe in paranormal happenings, but it was ver","useful":0,"cool":0},"P3YdvRH9NaLV1L_DYbMhdQ":{"text":"A tour is only as good as the guide.  Obviously a \"vampire\" guide has to be engaging, pers","useful":1,"cool":0},"c8OGpb93xulIaW7waoOLdQ":{"text":"I have done the French Quarter Ghost Tour several times. It's always a great time. Lots of","useful":1,"cool":0},"fPc2Ho5c-PmRae7CfHnhKw":{"text":"Daphne was an excellent tour guide.  You instantly feel and sense that she genuinely cares","useful":0,"cool":0},"XuepJhj_weLl4s6kfS5FZw":{"text":"Our tour guide, Luke Siddall, was fantastic. I wish I could have recorded the whole thing.","useful":0,"cool":0},"CdRiCkpLCcr4E-_tGwL8eA":{"text":"We took this tour with Charles and it was really neat. Lots of great information and stori","useful":0,"cool":0},"oE0zcLwBMJjFemj85u3OHA":{"text":"Easily in the top three things we did in New Orleans!  Would highly recommend this to anyo","useful":1,"cool":0},"tqU-NNGwv9esbUIO5IEldg":{"text":"Dead of the Night bus tour was excellent with Toast, our guide. We heard stories from the ","useful":0,"cool":0},"pq8mn3WfE6rllyf155jlDg":{"text":"We did a haunted history pub crawl and had such a fun time! They take you to bars that mos","useful":0,"cool":0},"OpyIeuwh7xqJ3le6sOnW9g":{"text":"Jack was our tour guide and he was great-provided lots of details into the stories and was","useful":0,"cool":0},"MYl_rxKeYYocbbW-wof3hA":{"text":"We decided on the 5 in 1 tour...to give us a flavour of the Quarter.   Our guide was Trevo","useful":0,"cool":0},"iNB77To59foiYz_60ZAaIQ":{"text":"For those of you looking for a ghost tour- do NOT take the haunted history tour. Some of t","useful":0,"cool":0},"Np0GQRbTvzd1b4LIkEAePQ":{"text":"This is the fourth time we have visited New Orleans, but our first cemetery tour. We booke","useful":0,"cool":0},"BGURR0GWySLxBCiWE3xxaQ":{"text":"Me and two friends did the ghost tour in August and it was a great experience. I believe i","useful":0,"cool":0},"i8nbEdFlI-eA1UBoE_Ajhg":{"text":"Fantastic tour! We did the evening tour and despite the rain it was a great experience! Ou","useful":0,"cool":0},"9--SPTJ-K67sFSq6g5D6hQ":{"text":"Went on the haunted pub crawl tour--was hoping for great drinks and spooky stories. Haunte","useful":0,"cool":0},"21bgTmeEif_usNhp9lSxGw":{"text":"This was a blast!!  Definitely one of the highlights of our trip! :-)  Our tour guide was ","useful":0,"cool":0},"VKu6VjhQqHjxFiV2YDzFcg":{"text":"GET GWYDION! Best tour guide, so enthusiastic and entertaining. 10/10 recommend these tour","useful":0,"cool":1},"iVllOCUCtFsD8CK2ZyDYrg":{"text":"Tour guide was lacking so much passion and personality. This tour was a horrible waste of ","useful":4,"cool":0},"HZ7VyXqv8Y-P7Zcm0r4Msw":{"text":"Our guide, Kyle, had great charisma and quirky personality which was perfect for the 5 in ","useful":0,"cool":0},"S0k1lN9_bR0XCCT-1qsgLA":{"text":"Rude rude tour guides who are not even from here. Don't waste your money the kiss wanna be","useful":0,"cool":0},"M6ie0QzU3aZ_QnEcUoWUbA":{"text":"New Orleans Cemetery History Tour\n\nI did 2 tours with this group and this one definitely m","useful":0,"cool":0},"1m0fV6RW9kiMOXentNQkyw":{"text":"The Voodoo tour was very education and answered a lot of question I had! Tiny was funny an","useful":0,"cool":0},"ovBfQELCi6gC2wEV3rRs3Q":{"text":"Took this tour 10 years ago and it was sooooo AMAZING! Could not wait to take it again and","useful":2,"cool":0},"-u9xg_oLfOzinp2Eix7REQ":{"text":"Gabriel was a very fun and intelligent tour guide. We did the 5 in 1 tour and got a little","useful":0,"cool":0},"pnyWHa2OGDDOBUppwuPxMg":{"text":"We were visiting NOLA and of course wanted to take a haunted history tour. Our tour guide ","useful":2,"cool":1},"23tMcmR5-tp7SBWVKBjdmw":{"text":"Our tour guide was pretty good, could have been a little louder and more animated but stil","useful":0,"cool":0},"_D-0KimW9lzQmbbytuCSmA":{"text":"Our ghost tour guide was a complete snooze. I wanted to hear about murder, pestilence and ","useful":3,"cool":2},"6T_RO_wev4_2-pu_099Jbw":{"text":"Fun time! The tour was interesting and our guide was excellent! Ernie was entertaining and","useful":1,"cool":0},"Ljwvly8sHGupJ_kgHxreLw":{"text":"I went on the French Quarter Ghost Tour. I don't believe in ghosts myself, but the tour gu","useful":0,"cool":0},"59OgnTFp7bCWuVZiMP2j2g":{"text":"Let me preface by saying that I love ghost tours.  I think they're fun and let you get a g","useful":1,"cool":1},"YpV4BvOeI6tXU1tjfwFeHw":{"text":"We were trying to decide if we should just walk to the St. Louis Cemetery #1 on our own, s","useful":0,"cool":0},"nMpg8ThpSXFlPCONwghVJQ":{"text":"Was recommended for this tour by our hotel as the \"go to\" walking tour. Needless to say it","useful":0,"cool":0},"2mhopCF2lI1fjIK1mt8LSA":{"text":"We did three tours with HHT and each one was great. Charmaine, Chrissy and Gabriel were ex","useful":1,"cool":1},"IYHnC0zkMdaZ30iJSz6xOg":{"text":"I'm a total history nerd so naturally, I go to New Orleans and go on these tours. I went o","useful":2,"cool":1},"2qKBQNtbuWeQfylhRVJleg":{"text":"Gabriel was an amazing tour guide. Very informative and captivating tour that never left y","useful":0,"cool":0},"9tX8jh1Nnei4JYrWthpFrg":{"text":"Absolutely loved our dead of the night tour! Toast was our tour guide and he was very know","useful":0,"cool":0},"ds-67IqbO5clayQl_ESabQ":{"text":"Took the Cemetery History tour and our guide was Daphne. I thought she did a marvelous job","useful":0,"cool":0},"qZ7RWQQmEf1fBnwewe4aTQ":{"text":"Cheesy...but isn't that what we were expecting?  C'mon reviewers...you cannot expect tour ","useful":0,"cool":0},"A9xQXZQbuAZZD1BOhjNxag":{"text":"We did the vampire tour with Lisa and it was a beautiful experience! She is such an engagi","useful":0,"cool":0},"gVzN5-43M2wy35bgS3pfgg":{"text":"We had missed the save the cemetarys tour and were a little worried about signing up for t","useful":0,"cool":1},"ywIN9pOgnTjtD3_FqPD53Q":{"text":"Such a great overview of all the \"weirdness\" of the city. Our guide was super knowledgeabl","useful":1,"cool":0},"NDPEyOC9pfwXOzOP_HAifQ":{"text":"It is what you expect. Touristy walk around the French Quarter with a scripted guide. You ","useful":0,"cool":0},"W2q5W2JVojviwXo9dmwEfg":{"text":"Matt was a really awesome tour guide. He really told stories with a great amount of passio","useful":0,"cool":0},"QsSEYJ27LHegFAgXrHKZsw":{"text":"Great tour of the French Quarter.  The mixture of ghost stories and local history was a lo","useful":0,"cool":0},"KlSrn5P8cAA_afxpmzpGqg":{"text":"We took the cemetery history tour and it was great. Our tour guide Ernie was so knowledgab","useful":0,"cool":0},"lGSy6VTMueSl8Fay1MpJrA":{"text":"I just finished the 8pm haunted ghost tour today with Eugenia. She was amazing! This was m","useful":0,"cool":0},"Vw9D4Cz2rLJxMrpoxTFJAw":{"text":"We went on the 5 in 1 Ghost Tour at 7:30pm with Gabe for my bachelorette. It is definitely","useful":0,"cool":0},"RVZOlf-MIqsAOMVAs5Z4rQ":{"text":"Updating to half of a half star due to Sydney's professional response to show the Overall ","useful":0,"cool":0},"fBLX00NdI7QGU2qTYA3GSA":{"text":"The tour guide really tried to entertain us while telling us haunted stories. Unfortunatel","useful":0,"cool":0},"h-5IEnqSuYSRI6XywkJwwQ":{"text":"We had a great time on our 5 in 1 tour!  Treavor was an AWESOME guide!!!!!!  He was knowle","useful":0,"cool":0},"RHMsQum7DaPQmCLM9dQmUg":{"text":"I hardly ever give reviews online but felt the moral obligation to review this company. My","useful":0,"cool":0},"Hv_KHSVhdpyDpyUYAQGJ8A":{"text":"We had a fun girls weekend in NOLA & had to include a ghost tour on our agenda! The bookin","useful":0,"cool":0},"9WLlT9mBdr6HaVG7JOT75w":{"text":"Stella was great! The tour was fun, informative and showed us a few bars with some great h","useful":0,"cool":0},"aSOp183nF06_vNo_Avdl6A":{"text":"We were in town for my mom's 70th birthday and decided to take the Cemetery tour. Daphne w","useful":0,"cool":0},"sr0kHkQhf6m0U2AwkU8yNQ":{"text":"I've lived in NOLA for 26 years and finally decided to do a Haunted History Tour when a fr","useful":0,"cool":1},"mAkZQRFajJkVmJaT_bOqhQ":{"text":"Not worth the money. The dead of night tour which advertises going to a cemetery at night ","useful":0,"cool":0},"isQ67vzaG0JT1dpD4QPPVg":{"text":"Ernie was a GREAT tour guide.  Very informative, and involved in the tours.  You could tel","useful":4,"cool":1},"mZeD9GJ51c9XbSEI1PlOvQ":{"text":"Our tour guide was very good and informative. I would recommend looking for a tour that ha","useful":0,"cool":0},"klhXQoEyo0n5244NgC6n6g":{"text":"We had high hopes as we've been on ghost tours in other places before, but this tour was a","useful":0,"cool":0},"gpB6RLTho2DX2px0aE02-g":{"text":"Our first time in New Orleans and we couldn't wait to go on a haunted tour to hear the gre","useful":0,"cool":0},"AG5BrSVd4PHoAr1seCi6OQ":{"text":"Ooh spooky.  That was fun and I learned a little. I didn't mind being heckled by locals an","useful":0,"cool":0},"pV_9GhulqeZnsWiJ3dghUQ":{"text":"Saturday night my friends and I went on the Dead of night tour with Chris as our guide. He","useful":0,"cool":0},"jYQNM9FKxW9-7QW4Mxs5Jw":{"text":"Our guide was Charmaine with driver Tashanna. Charmaine was really passionate about her wo","useful":0,"cool":0},"zOwDWrtJuanyFfV6ta6I4Q":{"text":"Our tour guide was Ari, and she was delightful! We purchased the tour off of a stand in th","useful":0,"cool":0},"e1tzHJI8jYfo6xHzldvjVA":{"text":"I did the 5 in 1 Tour while in NOLA for a conference. It was excellent. Matt Brown is a gr","useful":0,"cool":0},"Oxc4TzTPM7W3RpuqXo5nCw":{"text":"This tour was a lot of fun! My hubby and I decided to take this tour after seeing many peo","useful":4,"cool":5},"VveMBGWZa77cT3iBv3YxPQ":{"text":"Gabriel was our tour guide for the haunted garden district tour. HE WAS FANTASTIC. He clea","useful":0,"cool":1},"Y0Rj0UaOCI3mDamyFuVl6w":{"text":"Highly recommend the Haunted Pub Crawl! They take you to several bars in the French Quarte","useful":1,"cool":2},"4CYgoQ4fYnrfLq28uFEK8A":{"text":"My husband and I took the 5 in 1 Ghost and Mystery tour after I extensively researched whi","useful":0,"cool":0},"fHCmhLQ2n1L7OvfDDsUSUw":{"text":"I went on the Cemetery History tour with Gabrielle. I love the that fact that he explained","useful":0,"cool":0},"Y7U-I99HP7fIdZgH749shQ":{"text":"We had a great time on the 5 in 1 Ghost & Mystery Tour.  As a first time visitor to New Or","useful":2,"cool":2},"JwwEEdDeucWkDKAeL32fEw":{"text":"Our tour guide was amazing. I believe his name is Gabriel, hard to keep up with all the na","useful":0,"cool":0},"SqQPnJGYYarq-5uf6c6Z8g":{"text":"My Sister & Bro-in-law only had a day & a half to explore the city for their first time. W","useful":0,"cool":0},"8MNF_ke0Hz8w7_3DQqbIKQ":{"text":"Worst tour I've ever been on! Dont waste your time or money. I Left halfway through the Fr","useful":0,"cool":0},"k0cCe_zS-eUpfYv3-FvrMQ":{"text":"Ari was a fantastic story teller and guide. She was animated and really entertaining. Awes","useful":0,"cool":0},"Ko4S2cVRaveoqQ3LUIGeJw":{"text":"We reserved spaces for this tour and put down a deposit with our hotel concierge for the 8","useful":2,"cool":0},"lc2iM3EUXeLk54jbdmAeFw":{"text":"Took Drew's Garden District tour on gloomy Thursday afternoon.  This led to only 6 of us b","useful":0,"cool":0},"kvzmJRhmrikabbm-FE3VsA":{"text":"We had an awesome time! Great stories! I wish we did more tours with this group. Great job","useful":0,"cool":0},"tAwln2ZnS6lKaKhESi8nbQ":{"text":"very interesting tour, offers a lot of historical insight. my tour guide was amazing, hila","useful":0,"cool":0},"fzpoIxmmtgWXKsNKrGVL5w":{"text":"I don't remember our tour guides name, BUT we went in the ghost tour @ 6pm.  I am from Chi","useful":1,"cool":0},"EACsUF0fXw0Iee_cR6eHAg":{"text":"Rose Sinister was a top-notch tour guide.    She has an encyclopedic knowledge about all t","useful":1,"cool":0},"L5Kd6z6y-dMVqq0nR-QNoA":{"text":"Our ghost tour through the French Quarter was one of the highlights of our first trip to N","useful":1,"cool":0},"ZG0w2B5XS2ZRwTjJnbm9QA":{"text":"I did the cemetery tour. Andrew is the best! He gave us the history of the city before the","useful":1,"cool":0},"Qpj9MLAQQHrHWE8Df7ZoAw":{"text":"Evie is the best! I could have stayed and asked her questions for hours. My mom and I drov","useful":0,"cool":0},"XwKosGAZFEjmGurZfOrMmw":{"text":"Will was an incredible tour guide and was so informative! Learning about the history of NO","useful":0,"cool":0},"-r0YyBHHuHjNxxcdSdq5Fw":{"text":"Tiny was a fabulous storyteller. He was very knowledgeable in sharing the history of New O","useful":0,"cool":1},"iDF0Z2v0n27Ks9UDNZ9k6g":{"text":"Drew was amazing! Ask for him when you go:) He even kept his cool when a real JERK of a ci","useful":1,"cool":0},"yFCPAknLsWLpZfwYGic5NA":{"text":"During a time when a lot of places are currently closing down, this tour company kept the ","useful":0,"cool":0},"fq8pEg_jBn4arVAHrN71Ow":{"text":"I enjoyed the tour, lots of other tours were going on, so its obviously a tourist thing, b","useful":0,"cool":0},"rWL0BeRtJJNbiWeFSIT7yA":{"text":"Andrew was awesome.  Gave great insight on some of New Orleans most fascinating stories of","useful":0,"cool":0},"E7azawTaKsc4QJfEeOQK-g":{"text":"Gwydion made this tour amazing for us! We went about 8 months ago and even though we would","useful":1,"cool":0},"mr1MIHUzOU7K8yNJ0fCtmw":{"text":"This tour does involve history, as the title says, but it was better than I expected it to","useful":1,"cool":0},"Vtsc0b0dGwSg_WmZWzNIFw":{"text":"Ghost tour? Ummmm no. Historical tour yes. Bloody Mary drip drip drip is not a ghost story","useful":0,"cool":0},"cnwLcKpJCuSRcUeEXwFxSA":{"text":"My wife and I were really excited for what we thought was going to be a nightly ghost hunt","useful":0,"cool":0},"y2DayGwMNMnI0mv4hTLmAg":{"text":"Had so much fun!! Great way to see parts of NOLA you may otherwise miss. Kyle, our guide, ","useful":0,"cool":1},"6YX5xUtlb67lvglNZdzPEg":{"text":"On our first trip to New Orleans, my wife and I wanted to get a cross section of the spook","useful":0,"cool":0},"d3dsv0pIHASGnks78XCAwQ":{"text":"Thorn was our tour guide on the cemetery tour we went on . He was very informative. There ","useful":0,"cool":0},"r4jtpxDtWlXBFRjRXQzSaQ":{"text":"Be Aware!  This tour company came across as very friendly until there was an issue.  Signe","useful":1,"cool":0},"g1GHIBIChVA6_LcNeXvaGQ":{"text":"Are you creeped out by noises in the night? Do you get a sense something is lurking behind","useful":20,"cool":19},"vNLLutxJyXJemwg2GF6-6Q":{"text":"Drew was our tour guide for the 5 in 1 tour. Excellent! He knows his stuff. Definitely rec","useful":1,"cool":2},"cQSxDWNBoJh8-QFu7M6gYA":{"text":"Matt was great! We did the 5 in 1 tour and it was a fun night. He's a great storyteller an","useful":0,"cool":0},"l1rnn3aQ6W4xBkZuo-aMFg":{"text":"Highly recommend. Took two tours with them. Sedna and Sanford with the cemetery tour and D","useful":1,"cool":1},"QU5zM6n_OpNFtks9mLyGFw":{"text":"I had a great time with my dad walking around the garden district. the ghosts and legends ","useful":0,"cool":0},"apz_9ZhDVjxn55yIsZSu3g":{"text":"This tour is not meant for teens or younger. If you are a history buff you will find it in","useful":0,"cool":0},"5VVfiwgE5QeKFFvA2EJYBg":{"text":"Stella is a gem! A big personality. She even chatted with me as everyone else on the tour ","useful":1,"cool":1},"6OB3t8M5loZ2khqsLkZTOQ":{"text":"Best in NOLA. We have been on several over the years. The single best tour guide we've had","useful":0,"cool":0},"hvWX5TYPlIWx3zM5Up7Bjg":{"text":"The Ghost tour is a close to two hour walking tour of the french quarter, that departs at ","useful":1,"cool":0},"AkWKrSWUgImK9_3IUsakuQ":{"text":"We had Eugenia. While she was somewhat knowledgable and had a decent array of ghost storie","useful":3,"cool":0},"sbqE0_4px5t8NDeXSOyh6A":{"text":"We loved Earnie - the BEST guide we have ever had. He took us on both the Cemetery History","useful":2,"cool":1},"1Ul1ngXi9sAjVN1YQ_ee_w":{"text":"Gabriel was an awesome tour guide! Super funny and knowledgeable of the history. He was fr","useful":1,"cool":0},"llpfohAg5leBt8zEyLdD9A":{"text":"From someone who works in the tourism industry, Rose is an outstanding tour guide. Her pas","useful":2,"cool":1},"yhZ5WgEk2ANrsjXgSvOgeA":{"text":"If you go on this tour make sure to ask for Mikko.  Our tour would not have been the same ","useful":0,"cool":0},"bu-a_bzmtTybZIhwCsaaOw":{"text":"The more I took in New Orleans, the more I wanted some history of this amazing place. I di","useful":0,"cool":0},"I-w2cDE0BBofEBRRsgPwZg":{"text":"I've taken this tour about four times since 1997. I'm always pleased.\n\nIt's much more than","useful":0,"cool":0},"2pxqfGYKXRVZqGiC82TlOQ":{"text":"The 5 in 1 tour was great. Our tour guide, Sarahbelle was amazing! She had great stories a","useful":0,"cool":0},"s2bje0DNQ20BAD9cyEvtUg":{"text":"We do a different tour by the Haunted History Tours when we come to NOLA. This evening we ","useful":0,"cool":0},"82VGmHD_JD_-9puIhsFUoA":{"text":"We really enjoyed the tours! It was a lot of walking and my youngest was four years old at","useful":0,"cool":0},"1LvF7qA6us5cgvx4kO0Xeg":{"text":"I do not mean this as any disrespect to the other tour guides, but there is simply nobody ","useful":3,"cool":0},"4PVK9p0z5ySJ69Ac-2hhkQ":{"text":"Went on the new tour they added recently. It's a nighttime bus tour and we really apprecia","useful":1,"cool":0},"_82qnNBlHSmTkXRqLaiBtw":{"text":"Our tour guide, Lucy, was just plain mean. She called someone out for drifting away a litt","useful":0,"cool":0},"OGXCSgwfHSmSSPp-OZ6tvA":{"text":"We have taken several tours with this company and enjoyed them tremendously.  Yesterday we","useful":0,"cool":0},"eeW9QIlu9mVNtL5vTwe-tA":{"text":"Always entertaining.  I've done a few tours over the years with new friends and family whe","useful":0,"cool":0},"lMhC_ptwdCDC6L-qQgjMgQ":{"text":"Rude rude tour guides who are not even from here. Don't waste your money the kiss wanna be","useful":1,"cool":0},"PptoEOP_A3ieHpSXoBqhBQ":{"text":"I've been coming to New Orleans every year for the last ten years and finding a new haunte","useful":0,"cool":2},"qv8MRR0Ng45_8Fc8xNZZ8g":{"text":"The cemetery tour was excellent--entertaining, informing, and funny. Andrew was a great to","useful":1,"cool":0},"hPlPyIhC5MJGkZBYtjSotw":{"text":"Great tour. Our guide Daphne was awesome and has tons of cool stories to tell. So glad we ","useful":1,"cool":0},"6BsiDitcV5sQieHIv9i4_Q":{"text":"We took the 9:30 pm ghost & graveyard bus tour. Beware no breaks to go to bathroom if you ","useful":2,"cool":2},"9C9xEEtR57FlV1rqAYFMAg":{"text":"Personally, I've been on a number of ghost tours in my life. Mainly because 1) I love lear","useful":0,"cool":0},"q3flBCd4MdabnZAs3Wewaw":{"text":"Fun tour. Our guide Bob was awesome!!!!! He took the time to answer all our questions. I w","useful":0,"cool":0},"-F8CBZNuFec5S36brhcsAw":{"text":"I was a little skeptical when I saw the title Haunted History tour, but this tour definite","useful":1,"cool":0},"cuYoy6tPowwuTWfvNnnBNA":{"text":"I gave it one star only because I couldn't give it zero stars. This was billed as a Haunte","useful":1,"cool":0},"SK5RHWO8OS5b9altcJmL4Q":{"text":"A group of us did the vampire tour while staying in the French Quarter. We were lucky enou","useful":1,"cool":1},"UxKyDJF8YiKaPiB1lEKXeg":{"text":"Our Tour guide, Ernie, was exceptional. He provided all on tour with engaging historical f","useful":1,"cool":0},"cSFhA9U6msb57GT10wRWDg":{"text":"We came here on a Sunday night at 8:00 pm on a French Quarter tour. Our tour guide was Ari","useful":0,"cool":0},"VIpl9tYLz1EcN3Kis24qhA":{"text":"This was a great tour - we did the 6pm ghost tour. We learned a lot about the history of t","useful":0,"cool":0},"FloTt1odTpeXtKGFQxfqcg":{"text":"We did a cemetery tour with Sedna and it was great! She is very knowledgeable and entertai","useful":0,"cool":0},"iZn1m_XktHkSjmsw0Jn-xQ":{"text":"Love, love the tours. We took the Garden District tour, Ghost Tour, and the Cemetery Tour ","useful":0,"cool":0},"4hCdQspwtah4xeMO3jm3NQ":{"text":"I've experienced better -- on past Haunted History Tours.  This is not an indictment of th","useful":2,"cool":0},"EnJ7Iin4eIVPr1OMzMqB8g":{"text":"Lisa was fantastic! My wife is the vampire buff but, I loved the presentation and intertwi","useful":0,"cool":0},"CiYXM5Eb5m5AID25cQ3U7Q":{"text":"Tiny was awesome, energetic,  and an amazing tour guide!!! Would definitely recommend this","useful":0,"cool":0},"cUQBi9pHs12RlRabmYd2qg":{"text":"Went on the ghost tour with Squid as our guide.  So much fun and interesting stories.  Squ","useful":0,"cool":0},"Z8EszZWrdHTool11xhDlmQ":{"text":"Loved my tour! Loved our tour guide! So worth the money! Loved hearing all the cool storie","useful":0,"cool":0},"snWpTdjcYwTPWsTvyrWnbg":{"text":"I took four tours with this group while I was in NOLA and they were all great! My favorite","useful":0,"cool":0},"ffWZzbOKgmpgph0-FXEDQw":{"text":"I did a bus tour the other day with Sedna she was an amazing tour guide dispite the fact t","useful":0,"cool":0},"iHyPkx0EaXqrjVVbBnODUg":{"text":"My husband & I have been on a couple of Haunted History tours before so we decided to book","useful":1,"cool":0},"udifPY82PvMPTDntHeatxw":{"text":"To start off the tour you have to meet in front of rev. Zombies voodoo shop (on St. Peter'","useful":1,"cool":0},"u9vNfmTg6115xNcmwMPH-A":{"text":"Great tour that offers unique stories of New Orleans. Loved our tour guide Drew, who is a ","useful":0,"cool":1},"1_OFKFJBqnhKmGSJLfknwQ":{"text":"Great tour, very informative and fun, took the cemetary tour which had a little bit of his","useful":2,"cool":2},"3LrId8O2Uv5KZPlNZSHqLg":{"text":"Squid gave us a great tour full of interesting, goosebump filled historical stories that m","useful":1,"cool":1},"idBLUZ3ltYrSIz_I2Vv8kQ":{"text":"Our group of 8 loved the haunted history pub crawl. Our amazing guide took us to a few dif","useful":1,"cool":0},"7S95g4wPbHMxNdRVZL0rfg":{"text":"We went on the Pub Crawl tour with Toast as our guide and had a blast! Even though you are","useful":0,"cool":0},"27PYcacgAnjy7GfZSIiGcg":{"text":"Our tour guide was Kyle for the 5 in 1 tour.  He had a few good stories but not the most e","useful":2,"cool":0},"F8IjUHexlGaDrSdAxUduKw":{"text":"Tiny (as he called himself) brought us through the French Quarter on our tour of the histo","useful":0,"cool":0},"85M5MRgjQWgYsQEuOqUt2A":{"text":"I lived in New Orleans for awhile and every time someone would visit they wanted to go on ","useful":0,"cool":0},"nazsqT7b1XMZU7WG9DxukA":{"text":"My mom and I attended this tour and we absolutely loved it!! The checking-in process seeme","useful":0,"cool":0},"gbz7B1VDtD0XCTq1Cap8Xg":{"text":"It was by far the best of my trip. \nDaphne was engaging, fun, and very passionate about hi","useful":1,"cool":0},"qzf2DyiThdt6_kqSBDLvrg":{"text":"First I hope you get Deanna. \n\nWe opted for the 930 tour. The bus picks you up on Decatur ","useful":2,"cool":2},"knuG56CGhQznKexSTw0szA":{"text":"I loved this tour. It is not about being scared. It's about the darker history of New Orle","useful":0,"cool":0},"tFj_ffFodipsWmukYS4QMQ":{"text":"We did the Cemetery bus tour and weren't all that impressed. It was by no fault of the com","useful":2,"cool":0},"99pUuX6_mPLANLAouHqH7Q":{"text":"Seeking some New Orleans scary history, I attended a walking vampire tour with Lisa. Her s","useful":2,"cool":1},"wpJoT8fwxepeUk7Qs3SwmA":{"text":"My 13-year-old daughter said this was tops on her list of things to do, so we all went alo","useful":3,"cool":1},"HjdqTfp23Lw1sok7l3P8wQ":{"text":"Ask for Ari, she lead an amazing tour, fantastic story teller...she did an amazing job!  G","useful":0,"cool":0},"EmFlp0n2eD5ts-fROe3ZaA":{"text":"Lucy was our tour guide and she was great knows so much about the city and could answer an","useful":0,"cool":0},"tlBaliBCQctaSknpaJuJ9Q":{"text":"A great tour usually means a great guide. That's why I'm thanking our guide Charmane for a","useful":0,"cool":0},"uwlIlTNY91sxfFExQqnVgQ":{"text":"Definitely a scary tour couldn't sleep that night. My friend and I wtnessed some paranorma","useful":0,"cool":2},"CA99LhQ4UVZpSWtni5S_0Q":{"text":"Did the 5-in-1 tour with Kyle. He did a great job and we enjoyed it. You hear some spooky ","useful":0,"cool":0},"eXhVM0BRKBCcJ5NZKcpgzA":{"text":"I took a tour on my family vacation with Lucy! She knew a lot of history and told stories ","useful":0,"cool":0},"4nB6_IrUMW2ax6BsVApfrw":{"text":"My sisters and I recently did the French Quarter Ghost Tour and had a great experience. Se","useful":0,"cool":0},"TEasRr1zD3WIYH-bk0JpsQ":{"text":"We went on the haunted tour with Evie. She really knows her shit. We learned a lot about t","useful":0,"cool":0},"-qyIWS4scP7xFaH1HKE0kg":{"text":"I was really looking forward to the 5 in 1 tour. It\nwas suppose to have a mix of different","useful":2,"cool":0},"zNsdh0PhYqtAX6nW653R0w":{"text":"We took the New Orleans Cemetery Tour on our recent visit to NOLA.\n\nVisiting St. Louis cem","useful":1,"cool":0},"w_qwpjCXv7izIXWypwtm_A":{"text":"Toast was awesome!  He was very knowledgable and easy to hear with his loud voice. I would","useful":0,"cool":0},"AEe0IDwFnyPRbZku5VBuhw":{"text":"Awesome tour guide, great info on the French Quarter and it's Haunted locations!  If you a","useful":0,"cool":0},"41vYYjVhpTd84ibFzjQz7A":{"text":"we did the graveyard and ghost tour, which turned out to be the fastest two hours since St","useful":0,"cool":0},"sRcoNGcFibpoWlcfgj0-sg":{"text":"Loved it!! We did the Haunted Pub Crawl and had Doug for our tour guide, and he was super ","useful":0,"cool":0},"mY4dWGlwxmpYy7gTH11pHw":{"text":"I really can't say enough good things about the haunted pub crawl- \n\nI was in NOLA for 10 ","useful":1,"cool":2},"sBckpQ32qLNwlDIDJj5MSQ":{"text":"GWYDION, is very passionate about what he does. Great Tour! Excellent explanations. Learne","useful":1,"cool":0},"nvoS-VWT_E2kXhfcw1Y_Xg":{"text":"We attended the Haunted History Ghost tour on a visit (July 2014) to New Orleans and had a","useful":0,"cool":0},"6MXCVh4PsbQmWDAzqC2_FQ":{"text":"Really the best tour I've taken in New Orleans. Cedric was a great tour guide, giving us n","useful":1,"cool":0},"0bL7OEcBzg7dcNdQ7vZNLw":{"text":"MIORA IS A DREAMBOAT. I'm not even kidding, she is so amazing and answers all questions du","useful":0,"cool":0},"3vOGLum6DRSxoMAQMZdVvQ":{"text":"Drew, our tour guide was awesome. He was Extremely knowledgeable and fun. Took all the tim","useful":0,"cool":0},"HjSzL9RmtNjM10BzrndiKw":{"text":"Drew was a very good and informative tour guide. The tour went by quick and we learned so ","useful":0,"cool":1},"aLTu9pwleZg1K8rrZpHYig":{"text":"Evie has been an amazing tour guide. Her knowledge and personality is outstanding.  Very v","useful":0,"cool":0},"iqvrKxe75eA_BX0jD_zsYg":{"text":"My friends and I did the 5-in-1 tour and it was a great mix of haunted history: vampires, ","useful":0,"cool":0},"hFL4i4a8pSbXuSiRLhrJHA":{"text":"Nicholas not Brandon is the best guide. Good socks. Must type more for review. Great job b","useful":0,"cool":0},"eUNVXfChoi5sAMUEu5_pYg":{"text":"5/24/18 \n\nWe did the Haunted History Tour with our guide Toast!  Let me just say that his ","useful":0,"cool":0},"66AaxC5Shgbdd-KE7rHvsg":{"text":"If you are in the French Quarter you must do one of their tours! Len was our guide and he ","useful":0,"cool":0},"7CJnhAklHaEBAo1JOs7m3A":{"text":"We  booked a tour with them and when we arrived we found out that they had cancelled the t","useful":0,"cool":0},"GXgwytKU4a0F2aoEW2R9YA":{"text":"I was disappointed with my tour.  I had been on these several times through the years. How","useful":0,"cool":0},"c1ggJleUob0m4_UQmY9mkA":{"text":"The Haunted Pub Crawl led by Doug was fantastic. Great historical tie-ins with actual inex","useful":0,"cool":0},"JSXjxyaCUy4qpG0M-gaIfg":{"text":"This tour was great, Toast(our guide) had lots of knowledge on the history of New Orleans,","useful":0,"cool":0},"G1xpK0B85-Orag6iofZHoA":{"text":"We did the vamiper tour. It was just ok. Not alot of history , got boring at times. Was go","useful":0,"cool":0},"BR53sO06XlNoLL79aMlP0A":{"text":"We had an AMAZING tour with Rose.  We booked a 5in1 at 530 on a Wednesday.  To our delight","useful":2,"cool":1},"o9urXBfeWPH94fxG3WyB5A":{"text":"Just got done with a tour with drew! So knowledgeable and charismatic! Made learning reall","useful":1,"cool":2},"kv8FXS3DqduyD7cNzOMjew":{"text":"New Orleans is where the voodoo culture came into existence.  It's an underground religiou","useful":11,"cool":8},"3I5e95tBbCeUDd0FmejCeQ":{"text":"The 5 in 1 haunted history tour was really enjoyable. Our guide was Drew, who combined his","useful":0,"cool":1},"GJqdW-_opOU_jOD6acl1JA":{"text":"We took the French Quarter 8pm walking tour with our guide Katrice. She was very knowledge","useful":0,"cool":0},"3S_o0m2zsltPh54ru1YVLA":{"text":"We did this on our first night in NOLA, what a great treat! We sipped on some hurricanes a","useful":1,"cool":2},"14Uet35xA3YOnEgKUqpeNQ":{"text":"This was so bad we bailed out and took an uber back to the French Quarter.  Mostly riding ","useful":1,"cool":0},"FnyMOR8m4SGe9Y-16YSkqQ":{"text":"Drew was very entertaining and informative.  He certainly knows the local history and has ","useful":0,"cool":1},"8AbrxpE8c4yt0-UojCjqdg":{"text":"If you're looking for a fascinating ghost tour with just the right balance of memorable st","useful":0,"cool":0},"XJbXBt-TkZoz6-2I8ahUYQ":{"text":"Had a really nice tour with Evie today!! She was wonderful and me and my other friends had","useful":0,"cool":0},"l07kkwWceVLTeaBBqrs9ZQ":{"text":"If you don't get Jack, you're not doin it right. It's all about the stories!! Amazing time","useful":0,"cool":0},"JVvmYmoE7RXh4il8UfU-LA":{"text":"The two hour tour consisted of 45 minutes in the graveyard and the rest outside. If I want","useful":0,"cool":0},"jTMvdRkQhWXw-tlhAULEXw":{"text":"Enjoyed our 5-1 sample history tour!   Evie was a terrific tour guild- story teller.  Very","useful":0,"cool":0},"FP1rwtNfiKMD3Se-4l8Okg":{"text":"Lisa was our tour guide,and besides her period costume, her passion for New Orlean's haunt","useful":1,"cool":0},"fX2shvDPOIw77BEoGRP99g":{"text":"Went on the Haunted Pub Tour and got 4 stories with different bars all over the French Qua","useful":0,"cool":0},"cdhX1OD_pXMhgmyr9QWfKg":{"text":"Haunted History Tours company was professional, informative, and fun.\n\nOur first tour, wit","useful":1,"cool":1},"QnzqcpfGfKSCdVcvYDarbA":{"text":"The quality of the tour seems to depend completely on which tour guide you receive. Went t","useful":0,"cool":0},"xG0HltHN5LFEDoXsdjwnIw":{"text":"We had Kyle as our tour guide.He was so focused on making room on the sidewalk for pedestr","useful":2,"cool":0},"sJcH5TN0fjSvz8mFe2ZRjg":{"text":"My friends and I went on an evening walking tour. Our guide was great at sucking us into t","useful":0,"cool":0},"yj7XNNQKmwrdrV5eiLb_2A":{"text":"The tour guide and other guides were extremely friendly and knowledgeable. Ask for Jill!","useful":1,"cool":1},"Ol5WyJcnu79L7j6L7y8mTw":{"text":"Took the ghost tour with Squid this evening...outstanding!  She had a unique way of mixing","useful":0,"cool":1},"JisoY4LoZILDcesHtkX4jQ":{"text":"Our guide, Drew was the best part of our Garden District Tour that began in the Lafayette ","useful":2,"cool":1},"sHNfR62Ui8e4GN43qfhb1w":{"text":"Didn't get past the rude \"guest relations assistant\" parked out on her throne on the sidew","useful":2,"cool":0},"aieix-lgI6c77qTsB45V4g":{"text":"My husband and I loved this tour!  Our guide Ernie was very educated about the subject, an","useful":0,"cool":0},"QQeEk7yftr2nZ0OD3vTxxw":{"text":"Went on the bus tour, with Cedric as the tour guide, VERY knowledgeable and entertaining. ","useful":0,"cool":0},"W3FCjc5Wc1eOgq9UFb2hRw":{"text":"Walked around in circles for about 29 minutes. Visited only three pubs and the stories wer","useful":0,"cool":0},"5SKCEkNvRO6TsJiYcmdgnQ":{"text":"Really cool vampire tour - interesting stories - cool tour - best part was Gwendyn our gui","useful":0,"cool":0},"F6kAcXzJ2Wl6MEfcLF6ETQ":{"text":"A MUST!  Clint was our tour guide on this fascinating tour and he could spin a great tale!","useful":0,"cool":0},"l8Fsh0VYhiz6M3FvTuQtUA":{"text":"AWESOME TOUR!! Best thing my family did in NOLA (teenage daughters approved) We took the D","useful":1,"cool":0},"6kkvlDnjXKOw86daKaMshg":{"text":"Don't waste time and money. The \"vampire\" who leads these tours is soooo long winded and b","useful":2,"cool":0},"kox26e0vf0W89C2TZm0peA":{"text":"James was excellent and provided a super fun tour. He was very enthusiastic and animated w","useful":0,"cool":0},"Gpt_y3hzRIROx2SGgRfnRw":{"text":"Our amazing tour guide Toast was both knowledgeable and entertaining. We learned so much o","useful":0,"cool":0},"1jBypHjBZkn1NrSbUvATnw":{"text":"This is the average score of two visits to this tour. We did the 5-in-1 tour. The first to","useful":0,"cool":0},"1J_MgYnHgbF0gG-EoVob9A":{"text":"This was a dowright blast.  We loved every minute of it.  I wish we could have had a whole","useful":1,"cool":1},"SfVTwLvf2-HgHTzph5hmLQ":{"text":"I admittedly am not a tour person. I prefer wandering cities on my own without a guide, wi","useful":1,"cool":0},"rjY6PnceKXZ_i3pM8DM_oA":{"text":"We were visiting from Fort Worth and took the History Tour with Kyle.   \nWe were throughly","useful":0,"cool":0},"4RlURrEbqJzAadp0ljEDkw":{"text":"I am a total tour monger.  And, I'm telling you--Ernie reigns supreme in the realm of New ","useful":6,"cool":4},"R_CLBOdfRF-18TSNjPM-aw":{"text":"Great Haunted History Tour by LUCY! She is by far the most entertaining guide in NOLA.","useful":0,"cool":0},"KAs66G2IqiAubZpVEXzHKg":{"text":"Thoroughly enjoyed the 5 in 1 tour. Got a taste of everything. I'd recommend this if you a","useful":0,"cool":0},"2nlppudccwrnUnHV6okQ2Q":{"text":"Such a fun time! We had Kyle as the guide and he was awesome. Knew all his facts and threw","useful":0,"cool":0},"UKdvso9TDOC8ziXFJJQGJQ":{"text":"Rose was our guide for the vampire tour, she was great! She wasn't over the top in theatri","useful":0,"cool":0},"HIPQUB4_QrHq3NEY2Qxt7g":{"text":"James was our tour guide and it was super fun. We did the Haunted Hoatory Tour and got a l","useful":0,"cool":0},"Bn8NGEA3FKlqhtq51jWtsA":{"text":"The three of us had a wonderful time with Lisa (our guide) on the tour.  Very fun, informa","useful":1,"cool":1},"da4QVgkDSXKQZlX7yDigAw":{"text":"I go in to these guided tours pretty skeptical of having a good time, but this one was awe","useful":2,"cool":1},"x5QuF2gRWibtemeXWDlguw":{"text":"We showed up at 8:02 for an 8pm tour. We had a group of 13. They said we over booked the t","useful":0,"cool":0},"RzgRuIxRiz1fnkHJztB6og":{"text":"This was a great tour. Felix is an awesome story teller and the history he gave with the s","useful":0,"cool":0},"Hx9xgutC3ZX8Ug7L4SDE-g":{"text":"We came for a bachelorette party tonight. Our guide was Doug and he was amazing! He was so","useful":1,"cool":0},"JpzaTZ8boSSyc4t2lPp3Eg":{"text":"I've been on a lot of ghost tours in the quarter & this one was not the best. It stated th","useful":0,"cool":0},"y4L805HUu7nAHxAAld38IA":{"text":"We did the haunted pub crawl with Doug, the history he gave us and the drink recommendatio","useful":0,"cool":0},"uCxV3c45bSfZmBotI-4bbA":{"text":"I enjoyed the tour (Haunted French Quarter) and found it to be reasonably priced. We saw p","useful":0,"cool":0},"ylBpf9Zudf2farSML_q-xQ":{"text":"We did the scandal tour with Natalie. She was awesome! The stories she was telling were in","useful":0,"cool":0},"GEJd1fbjPomncaHjG4tmzQ":{"text":"Gabriel did an EXCELLENTLY job of sharing New Orleans history. He is a true historian of t","useful":0,"cool":0},"bOAM5Ecv8j9DkodyXZdBtw":{"text":"We did the vampire tour last night with Rose Sinister. She was super knowledgable, engagin","useful":1,"cool":0},"b8XbzigkyNQXA5ueKvL5KA":{"text":"Signed up for the haunted bar crawl went to the bathroom at the first bar and tour guide n","useful":1,"cool":1},"b46Ioqblugvx2rs_pnm2_Q":{"text":"Very interesting and informative tour. Our guide who's name escapes me, she's a lovely blo","useful":0,"cool":0},"BJTtJlNnyT8cXL6PgITm4w":{"text":"Cedric made the tour! His knowledge and experience is unmatched. Not too spooky but he can","useful":0,"cool":0},"0IaBt4azyPD0P5oY9o_XWA":{"text":"My husband and I just did the Garden District Ghost Tour with Gabe. It was just the three ","useful":0,"cool":0},"4yvFxoVR8n_WWyo90RqS_A":{"text":"We just finished our Haunted History's Dead of Night tour with our tour Guide ,Toast .We e","useful":0,"cool":0},"mJkOiwFvI5W4YprCyFnJMw":{"text":"The tour guide we had was rough. She spoke as if she was a 3rd grader making up a book rep","useful":1,"cool":0},"pIYrXiWKDTgwaShzy5N-FA":{"text":"Drew our guide and storyteller was very passionate about the stories he told.  Early Septe","useful":0,"cool":1},"_3LQ3pCV8BRoo81YTp2kXQ":{"text":"Tour guides make or BREAK this type of experience. Matt totally MADE IT.  His history/poli","useful":0,"cool":0},"d_4PO7QaCifiwocD-3-DwQ":{"text":"We went on the tour with a couple friends.  Our tour guide was awesome, very knowledgeable","useful":0,"cool":0},"8YKxAArZP8UmHjC9eZshTg":{"text":"A \"toast\" to our tour guide Toast! His tour was super informative and fun. Great time and ","useful":0,"cool":0},"SVFEzxBDEyp8vTfvkmGzKw":{"text":"Jill was very informative and friendly on the cemetery tour. And we got to see Nic Cage's ","useful":0,"cool":1},"FtU84JXAj2G1p7NSiWnGdg":{"text":"If you're looking for something to do in New Orleans and are interested in history, I high","useful":0,"cool":0},"m2rMiURNt3Wfbj1NmhO1ww":{"text":"It was a great tour! The 5-in-1 consisted of a lot of interesting stories, legends, histor","useful":0,"cool":0},"M2F9cv-vF7EL3oQSfBO6nQ":{"text":"We did the St Louis #1 cemetery tour today with our tour guide Gabriel. This first half-ho","useful":0,"cool":0},"QD1I3GnLLsx-OCNoO0T30w":{"text":"Our tour guide was very good, however we paid for tour in advance $30 then upon arriving f","useful":0,"cool":0},"BXcWITvrqhlmrA2feAY4WQ":{"text":"Guide was a good speaker. Didn't know if he was our host at first it was kind of sketchy. ","useful":0,"cool":0},"RuM24v9GaNVfAYq0_3StBA":{"text":"Lisa was amazing and informative. It was an awesome tour. My husband and I learned a lot.","useful":3,"cool":1},"YcWXf5EvZr8PQ7Ro84SsIw":{"text":"Tiny was our tour guide tonight! He was awesome, very informative and very accommodating t","useful":0,"cool":0},"4cRNA-aXSefTNS_tPusOUA":{"text":"Evy who was our guide, was fantastic in every way shape and form! Her stories were very in","useful":0,"cool":0},"Fz6QMelP29QRB5AgeFV7fw":{"text":"Tiny took us under his wing when we got lost from our original group on the haunted pub cr","useful":0,"cool":0},"sD0l_qPbZ4UQBR1Rg-Ri6w":{"text":"We got the bus tour deal. They claimed to be the only bus tour that takes you inside cemet","useful":1,"cool":0},"ctOyI1jQysrJ1SSGsqyqUw":{"text":"I left the tour after an hour to keep my sanity! \"Haunted\" is not the word to describe thi","useful":7,"cool":0},"rQMKwVSoAdsRYtyhw5gZJw":{"text":"Absolutely loved our tour guide (Chrissy?) as she was knowledgeable, a great story teller,","useful":0,"cool":0},"WjHxLhluj5I0C1tkhFJbZw":{"text":"Very rude... do not recommend!!!! Bob our tour guide took us to a bar on the tour and the ","useful":0,"cool":0},"rH1ET-VbpkpSMb7JH1IlyA":{"text":"We took the ghost and graveyards bus tour on Friday Dec 27 in the 9:30pm time slot. We had","useful":0,"cool":0},"zT4mBvTEFxHmEuaR7jCX9A":{"text":"This review is for the Haunted History Tour. Travelled from Chicago and met some of our fr","useful":6,"cool":0},"hvIyhGPc48XPAl5J7DtsUw":{"text":"Tiny was amazing and very informative!! We went to all the best spots and learned so much!","useful":0,"cool":0},"qEj0OdFnaGb8ztEhogrbZw":{"text":"This was a great inexpensive tour that we did with some friends. Our tour guide Ari was aw","useful":0,"cool":0},"fl8yycKgpwsqP88otJZSbA":{"text":"Len was our tour guide and he was awesome! Gave an excellent tour, he was very knowledgeab","useful":0,"cool":0},"n2ATS5PO4AgMs-fCh5A9-w":{"text":"Ariadne was our tour guide.  She was great. My girlfriend and I enjoyed the whole experien","useful":0,"cool":0},"ZetPDs1qPlfs3F06FUvKRA":{"text":"Will was absolutely incredible. He truly knows his stuff. One of the best haunted tours I ","useful":0,"cool":0},"FmAXpuRhzL_Aj9ha-0zf3w":{"text":"I was a bit disappointed with this tour.  I live close to New Orleans and have seen these ","useful":0,"cool":0},"TVQpPmJVACTiX_U6MbJTCg":{"text":"Just took the 8pm Ghost tour with Ernie. Gotta say, his energy and delivery was on point. ","useful":1,"cool":1},"OCOntKob7L6UdPLKWkMftA":{"text":"Did the Garden District Tour. Such fascinating stories- excellent if it's your first time ","useful":1,"cool":1},"pDDe_-lEasCNlPFv8x2iSA":{"text":"I had the best time on the vampire tour last night I highly recommend! Our tour guide Toas","useful":0,"cool":0},"CZekbA7b3YJdbKFyb3g_3Q":{"text":"Squid was beyond awesome.  She knew her stuff, worked well with the pack (even with some c","useful":1,"cool":0},"akrP5GdnQq9Dd9imSnanzg":{"text":"Loved the pub crawl, saw some awesome bars I never would've seen with really good stories.","useful":0,"cool":1},"-d_pCAAemva5q3wZ-Jf3DQ":{"text":"We went on the St Louis No 1 tour with Andrew this morning. In spite of the early hour, An","useful":0,"cool":0},"gN3kV-QasKeZQ6vPqEfGpw":{"text":"Stella our tour guide was awesome on our haunted pub crawl and very informative. She made ","useful":0,"cool":0},"p1P1MLJA312nlVlj8iVzBw":{"text":"We did the ghost tour yesterday at 8:15pm with Squid. It was just my group with one other ","useful":0,"cool":1},"Y4ko1t9U233Eg32b9hbXag":{"text":"Fun times in New Orleans. We thought it might be fun to do this on Friday the 13th. The to","useful":21,"cool":20},"BbyCyTasio8EHo4u-9dpkA":{"text":"I took the Cemetery Tour with Andrew, who was phenomenal. Not only did he provide humor an","useful":0,"cool":0},"DarYT7Bosv5YMM1XWmnnTA":{"text":"JAMES was the best tour guide! Not only was he knowledgeable but, he was passionate about ","useful":0,"cool":0},"NeXPs4JvSNiIyIPFjAwMUA":{"text":"Listen, I'm a judgey high-standards Aquarian, and Bobby was the best part of my tour in Ne","useful":2,"cool":0},"65pMyv4cRi3JsNZON3jWnQ":{"text":"I went on the 5 in 1 tour today with Lisa as our guide.  She is awesome and has a great st","useful":3,"cool":1},"vQ4Hk3VSBjNF9bJL2kcuZA":{"text":"Spooky tour and so worth it! Our guide James was so knowledgeable and made me wanting more","useful":0,"cool":0},"WEJFtxAAgOIYhTmTbIq5IQ":{"text":"We decided last minute to go on a walking cemetery tour on our last day in New Orleans, an","useful":0,"cool":0},"nrwCF4Y8yirOOdpQsSaxxA":{"text":"We went on the Ghosts and Legends tour with Squid as our guide. We absolutely loved our gu","useful":0,"cool":0},"jp5JWLOMMdLO12g2qqvP9w":{"text":"Went on the Garden District tour with Gabe.  It was fantastic!  He was very informative an","useful":1,"cool":1},"LttbKWmDFj6zJwCNE0Xh6g":{"text":"Had a blast with Johnathan as our tour guide. The night was cold and damp. Johnathan is ve","useful":0,"cool":0},"WT3U-CNyGPBS8TJfszVbOQ":{"text":"I've gone on the Haunted History Tour several times over the years, and have done the ghos","useful":1,"cool":0},"myTlyM7d201EyD5swXvy_Q":{"text":"My husband and I took the haunted pub crawl tour with Tiny and it was awesome! We had a ru","useful":0,"cool":1},"AEZ4aIp7t8Wak-S5OR8z0Q":{"text":"We took our tour with Ari. She was awesome! You could tell she loves the history of NO. Gr","useful":0,"cool":0},"OQ_QwaJT-9njU0XPIF_OiA":{"text":"In town for work and finally got a few hours for some fun and I decided to take the 5 in 1","useful":1,"cool":1},"CbIYNW70oayjVx--lOCLbg":{"text":"It might be best to get your tickets online. They do have a ATM/credit card system availab","useful":0,"cool":0},"YwjimLjUtU90UrCe5XF4zA":{"text":"We did two tours. First one was the St Louis Cemetery tour with tour guide Daphne. She was","useful":0,"cool":0},"sWt6M4R0Io5hCGWaKbY9xA":{"text":"Elizabeth made the tour exciting and interesting! Did the 5 in 1 and would definitely try ","useful":0,"cool":0},"5isfnC2HEfZ_zkEIh4h_-Q":{"text":"We took the 5 in 1 tour. Before I say why I gave 4 stars instead of 5 let me set the scene","useful":0,"cool":0},"bX1cmAmtClhBLK_7IJaHAA":{"text":"We went on the haunted pub crawl and had a blast. Our tour guide was Kyle and he was very ","useful":0,"cool":0},"c5q5QcnU36sQSSZTy14MVQ":{"text":"Don't let the haters scare you away - this is a walking history tour about the creepy hist","useful":2,"cool":0},"oBk-wDT0kqVeH8xC08UATQ":{"text":"Eugenia is the greatest tour guide ever.  Amazingly knowledgeable and super fun, this tour","useful":0,"cool":0},"Bws1xxjea3g4f9fVI-Xm4Q":{"text":"Jessica and Solomon (her baby-on-the-way) were our guides on this Haunted Tour around the ","useful":0,"cool":0},"tPrlhAHPqO85H6twI5Qgmg":{"text":"Had a great time touring around the Frebch Uqarter with our guide Eve! Second time doing i","useful":0,"cool":0},"KKlekb4VQU26-QwIqIt6AA":{"text":"Joel was a great guide! He was very accommodating for my 70+ year old mother who was havin","useful":0,"cool":0},"iXbIJo9BnebHmcez6lzojw":{"text":"We're here from out of town so of course we had to book a haunted tour! After looking arou","useful":0,"cool":0},"_4k6vNAuWcTiebiLhv24lg":{"text":"We ended up doing the 5 in 1 tour after a recommendation from a local tour operator and on","useful":2,"cool":1},"ZBI9UL13n_kYZniVDADYdA":{"text":"James was amazing and very enjoyable. Definitely recommend a tour with him you will not be","useful":0,"cool":0},"_r63RUsK2pGwnWxh_1qvuQ":{"text":"We were not sure what to expect, but this was great! An accurate history lesson combined w","useful":0,"cool":0},"oha3yi5a9ml33nHQ6l-G3A":{"text":"Did the ghost tour with Tiger and she was wonderful. She was funny, knowledgeable and enga","useful":0,"cool":0},"fzySVYFO-9VGagoFHIj3Bg":{"text":"My kids and I went on the most amazing Haunted History Tour with Cedric as our tour guide!","useful":0,"cool":0},"J823tv3xnzfSNeH-9lVpgg":{"text":"Drew was an incredible tour guide for the 5-in-1 tour. He was really engaging and funny. M","useful":0,"cool":1},"tlLH4is1JvaLZ3cMLYVaBQ":{"text":"Bobby was entertaining, very knowledgeable, and passionate about the Vampire history of Ne","useful":0,"cool":0},"eHpPCD68nz0mcZLUAfAtPw":{"text":"After many trips to New Orleans I was dragged to one of these tours on my most recent visi","useful":0,"cool":0},"XuuvKEx9xNfbfvV2vxVuxg":{"text":"I took the ghosts and vampires tour on a recent trip. Our guide was great and so fun, but ","useful":0,"cool":0},"LyrudM_Zo-u684QPWuTe5w":{"text":"We did the Dead of Night Ghost and Graveyard bus tour, and it was fantastic! Our tour guid","useful":0,"cool":0},"GzKmq39QXL-icSns0zNshg":{"text":"Sooooooooo much History! I loved the tour and our tour guide \"LUCY\" she is super awesome, ","useful":0,"cool":0},"78mpGcognUvNHn6uNNLlwg":{"text":"The 5 in 1 tour is a great sampler filled with crazy, twisted stories that make Criminal M","useful":0,"cool":1},"le09qQJFl0zm7lRW1_xbkw":{"text":"If you're ever in New Orleans, definitely take the Haunted History Bus Tour. It's well wor","useful":1,"cool":0},"ZqplyXt8ns0LthdG7CM_qQ":{"text":"Loved our tour by Squid on 10/3/2021. Very knowledgeable and super professional. Handles t","useful":0,"cool":1},"C-N8pdZL0pXUG4XgH-MCPA":{"text":"I'd have to say that not much can make me venture out into the hot 90 degree, 80% humidity","useful":1,"cool":1},"-lJxvmoa9Qqijj9YljeUAA":{"text":"Amazing tour company! We chose the nightly Vampire Tour, and we were not disappointed. The","useful":0,"cool":0},"620-vXnzjOQAmp8A2JRnrw":{"text":"Toast was a great tour guide. He was very knowledgeable, but kept the mood light...with a ","useful":0,"cool":0},"PV3dPqn3O4HglYztisdjLA":{"text":"I went on this tour for my birthday and had Kyle as our tour guide. He was awesome!! He wa","useful":0,"cool":0},"w_xBDlspVRjMLnEWy97grg":{"text":"Had a great tour today of the cemetery. Ernie was our guide and he was amazing.  Full of a","useful":0,"cool":0},"D4Z_wMv1og_dSSCnxkgVkQ":{"text":"If you're remotely interested in the history of New Orleans and the French Quarter or in t","useful":0,"cool":0},"B8O4F8mFqhtXpZGuJtlOQQ":{"text":"Tiny is the man! We did the haunted pub crawl and he made us feel so at home, like a frien","useful":0,"cool":1},"JE3jiA5y4XrI6R0O-GhffA":{"text":"Tiny was the best guide! Loved this tour and all the bars we went to! The stories he told ","useful":0,"cool":0},"2_njuuiSKRPdcGnT6ps5YQ":{"text":"Drew was awesome! Had great energy and great passion in his work. Had a great time with hi","useful":0,"cool":1},"5rtODLEtLq0vsmrkM_UK5w":{"text":"This tour was well worth it. We went on the French Quarter Ghost Tour and Eugenia was awes","useful":0,"cool":0},"5MknizHCBH3jpj5DJd-6Uw":{"text":"This was such a trash experience. We signed up for the Voodoo tour thinking we would get m","useful":1,"cool":0},"qs-DNZjD-a6U14y78sKuhQ":{"text":"Cannot recommend the haunted pub crawl enough! We visited three bars and enjoyed fantastic","useful":0,"cool":1},"PhbLw-aw-fwanCQzvSQl3w":{"text":"We went on an awesome tour with Stella. It was very informative and fun. It's worth the mo","useful":0,"cool":0},"pXLDszWH54sxIXzfEXn0Jw":{"text":"We were really disappointed with our cemetery tour guide Renee.  It seemed that she was mo","useful":3,"cool":0},"owxsRLb7HweD9vC3-LG1Dg":{"text":"Sedna was absolutely amazing!!!! She was not only extremely knowledgeable, but very charis","useful":0,"cool":0},"TwNq9-E0TlHu_D9KB90cmA":{"text":"Tiny was amazing! Had a great tour. Told lots of great stories and had great energy. will ","useful":0,"cool":0},"EM9dJQr9Qvpox3J_To0SNQ":{"text":"Awesome tour. Very interesting and the tour guide, Toast was very knowledgeable. Would def","useful":0,"cool":0},"bU6SVMZg5y3Tn_6LZEpuBQ":{"text":"Truly enjoyed the 5 in 1 tour experience with Drew. He kept us thoroughly entertained the ","useful":1,"cool":0},"AR-ptgKJEB_zkM_67GwTJg":{"text":"Our tour guide Cody seemed to be very knowledgeable about the facts and history of the pla","useful":0,"cool":0},"pv_JI7fvsG7Hv3wjYbewQg":{"text":"Signed up for the haunted bar crawl went to the bathroom at the first bar and tour guide n","useful":2,"cool":1},"iUADKZqLmX1t6OU2BBBgWg":{"text":"Our tour guide was James!! He was awesome and very knowledgeable. He made it super fun!! h","useful":0,"cool":0},"3JSxojvwQxaYEJJYsGVkWw":{"text":"Took the Haunted Pub Crawl tour with Tiny as our guide, loved the whole thing, he took us ","useful":0,"cool":0},"DLT5luniH066iZhMN4xhvw":{"text":"Thorn was our tour guide ansd the tour was great.  We all enjoyed it ans even our 13 year ","useful":0,"cool":0},"5Jx7MDv9QsDSbP9rSf9Teg":{"text":"Tiny was amazing we did the Thursday tour at 5:30 and it ended up just being me and my hus","useful":0,"cool":0},"6DfIRPyuC3S4CHRPJsKh4A":{"text":"This tour was well worth it. We went on the French Quarter Ghost Tour and Eugenia was awes","useful":0,"cool":0},"2mDEu2VEQhGHAS6aPu5NoA":{"text":"We went on the 8pm ghost tour and it was well worth what we paid. We were looking for a to","useful":0,"cool":0},"7yAXmcjfPdO6Z45zsDbPeA":{"text":"Went on two Haunted History tours during a recent trip to New Orleans: the Ghost tour with","useful":0,"cool":0},"XhA5TAkwZHHriqkx-LzQTA":{"text":"This tour started out fine, but took a sharp turn downhill about 45 minutes in. Our tour g","useful":3,"cool":0},"xN54l8MJwd3T3gbERlxctw":{"text":"We had the pleasure of being on a tour with another computer when your tour guide at the S","useful":0,"cool":0},"e17-FXDHUGsCrny9LWbeTw":{"text":"I took this tour on a Saturday morning (10am) to avoid the heat.  Our tour guide was Eddie","useful":0,"cool":0},"_pSASLRiB1M591cbQR769g":{"text":"If you're considering going, go! Our family had tons of fun on the French Quarter Ghosts a","useful":1,"cool":0},"7_FDuXk3NXLI8y340gmY0w":{"text":"We went on the cementary tour with Thorn, it was the best tour we ever did and Thorn made ","useful":0,"cool":0},"qE2tQ4eRiKQDOdAFlqDoqw":{"text":"Specifically, James was an exquisite guide, he really made the the experience 100% enjoyab","useful":0,"cool":0},"3i9_RZaaVO7ikIlBj6a64Q":{"text":"We did the Garden District Tour. Jesse was our guide and he was very good. He knew a lot a","useful":0,"cool":0},"pukNrNTZJqzdhXMUsuRsJw":{"text":"It had been a lifelong dream to come to NOLA and specifically to poke around the city whic","useful":0,"cool":0},"KP7x3ykS3yshVP4BK4jeKw":{"text":"My boyfriend and I attended the Haunted Pub Tour this past Saturday and we has an absolute","useful":0,"cool":0},"I1ViUfbKvd0BZgNHCZARmw":{"text":"I took the 5-in-1 tour and had Sedna (sp?) as our guide. Enthusiastic and knowledgeable, s","useful":0,"cool":0},"jn2aE3PObMrmKhFhjp21Cg":{"text":"Just finished a tour with Eevie, but she far exceeded my expectations! Perfect mix of hist","useful":0,"cool":0},"aDctifULdQPPnqoiszK2Gg":{"text":"Clint was our tour guide and he was amazing!!!!! Got to see all the famous haunted spots a","useful":0,"cool":0},"3ZFboCg_aNZB1_arbf9bxA":{"text":"This was so boring I wish I would have died, become a ghost, and haunted the tour group so","useful":0,"cool":0},"SM9IS4Gq_fnyqGVHZD-5YA":{"text":"Lisa was our tour guide and our group found her to be extremely knowledgable and even more","useful":1,"cool":0},"HbvTDNsOaQqu9LZJwEkxUw":{"text":"Loved Katrice Brown. Very entertaining and informative. Loved the stories and the way she ","useful":0,"cool":0},"Qxb6GoQ7khDCeSH4_hUF8Q":{"text":"We took a tour yesterday and our guide was Dominic. It was thorough and entertaining.  He ","useful":0,"cool":0},"LneOEOExWlxT0J_cm-hXyw":{"text":"Gabriel was the best! We did a morning cemetary walking tour and enjoyed it and him so muc","useful":0,"cool":0},"RaQe9A2-nIPQdlzum9Rdnw":{"text":"This company probably advertises with yelp in some ways because most of the negative revie","useful":1,"cool":0},"R3WdF96ZyuHEyGbIf4mg-Q":{"text":"My first time in life ever doing a tour and glad that this place was the first the tour gu","useful":0,"cool":0},"0tffNqOvxzavfkptC02jaw":{"text":"I can honestly say the best tour I've gotten. Unfortunately I can't remember the lady's na","useful":0,"cool":0},"H0O-7SHlZlQdPYDUuDcRww":{"text":"this tour was amazing!! our guide was nicholas and he was perfect. the jokes he was cracki","useful":0,"cool":0},"JoNpaiP4qgTy60-xzTIHeQ":{"text":"I'm a NOLA local and thought it would be fun to do a little local tourism.  I went on the ","useful":0,"cool":0},"xwm4Kc6o8JNCydmoF8XTfQ":{"text":"Tiny took myself and my girlfriend on a phenomenal tour. Told us amazing stories. Showed u","useful":0,"cool":0},"1rqVZ8AXVQ8ZJ7eFcRtPdg":{"text":"Lucy was an incredible tour guide and storyteller, she was such a delight to listen to and","useful":0,"cool":0},"E42c1OGo6UaIYAUoSOVgOA":{"text":"We had Lacy as our ghost tour guide.  It was great to get on the bus and go around and see","useful":0,"cool":0},"6VPfJCO7fvRVTRVckjx99A":{"text":"I was a confirmation when I paid online that included instructions on where to meet the to","useful":0,"cool":0},"nQEJq4Kx-2NUTvbyWtegHg":{"text":"My family and I went on the 5 in 1 tour with Sarahbelle as our tour guide. She did an amaz","useful":1,"cool":1},"DHbqBelhbXSuLzlaIX4rEg":{"text":"Based on the reviews, my friends and I booked this Vampire tour with Lisa.  I have to say ","useful":2,"cool":2},"Nge2E54naj27uIZsqucZ4Q":{"text":"Stella was both informative and funny as heck. I'm a history buff, but my girlfriend isn't","useful":0,"cool":0},"WW0i08E4Gi0L-pzU_sBWgw":{"text":"Thorn took us on our night tour. We had a lot of fun and learned some cool things. I would","useful":0,"cool":0},"unXnr9A89cwCqJaiRpN-Xg":{"text":"We took the Vampire tour with Rose. She had a plethora of knowledge of the City of New Orl","useful":0,"cool":0},"F12_yOT1T4m8ToGLebtGeg":{"text":"We were passing through on a road trip.\nNot much of a drinker at this point in my life so ","useful":0,"cool":1},"gz-Eg7TZJMrUEwmfQKAabA":{"text":"James was amazing! He was thorough with all his information and made all the tours really ","useful":0,"cool":0},"PZ6eePN5nuyNQoGI5ZG23A":{"text":"Don't bother spending the money on a night cemetery tour the cemeteries are closed after d","useful":2,"cool":0},"JQs7wCx2s2ueDcvJ52QYBg":{"text":"I was really looking forward to this. So much so that I convinced my parents and brother t","useful":6,"cool":2},"d1veGwEAc5hd3TZWQTC_1A":{"text":"I have no clue how this tour itself even has all these stars. The tour SUCKED completely. ","useful":2,"cool":0},"1JfpEzrrU3fPcnnINnEq8A":{"text":"My favorite ghoul, gal and I did the 5 in 1 ghost and mystery tour last night. It was grea","useful":0,"cool":0},"0RlMWFXF7UpB_j7Eyanh9g":{"text":"Matt was an absolutely fantastic guide! My husband and I had a terrific time seeing the si","useful":0,"cool":0},"6Q0ZuZ1wjxpQq1BRQ6WCwA":{"text":"We had Renee for a cemetery tour. I'm giving one star not zero because the owner was apolo","useful":6,"cool":1},"aAbw1Q81FBRqKLzHl-BKOw":{"text":"5 in 1 history tour with Stevie -  who was sweet and engaging. \n\nPros: relatively small gr","useful":6,"cool":3},"4yuMxSsm32o04TeJ4B-2iw":{"text":"We had Rose for our Vampire History Tour! She was amazing, she answered all of our Origina","useful":1,"cool":0},"x4dt1WPYNiuDXDE5uMuSZA":{"text":"We did the 5 in 1 tour while visiting NO. Our tour guide Trevor was AWESOME! He was a grea","useful":0,"cool":0},"WSqyHYWdiHuJPcrFqHR2JQ":{"text":"We always enjoy these types of tours when visiting a new city and chose Haunted History To","useful":0,"cool":0},"eCcOzoGPlGVBggRy5rC51A":{"text":"I highly recommend the cemetery tour with Renee! She was a wealth of knowledge and a great","useful":0,"cool":0},"wcgNrKmSh6gTtM_6aoQuxA":{"text":"I've been on this tour several times and have never had a more knowledgeable, caring, and ","useful":0,"cool":0},"_7FH44pmDfncV8zxixraPA":{"text":"We went on the Vampire Tour. Let me start off by saying the humidity is overwhelming if yo","useful":2,"cool":1},"BdSNIGUKALLDtADEULalIQ":{"text":"We purchased the ghost tour and would absolutely do it again! Our tour guided, Ariadnie, w","useful":0,"cool":0},"XNs9xAYL-1f0VkSdtOhzEw":{"text":"We took 2 Haunted History tours. Our first day here it was rainy so we took a bus tour. Ou","useful":0,"cool":0},"lHcxymPllnd7r6sRSS8YNA":{"text":"Paid $195 for a family of 5. They packed us in the bus with no social distancing. They put","useful":0,"cool":0},"PQbPKwjQb6ao-e2ZEShORw":{"text":"We had Thorn as our guide for the cemetery tour. He was an excellent tour guide very knowl","useful":0,"cool":0},"BGYnjF6yBv3POi1zNDxwmA":{"text":"The lovely Lucy was our guide the evening of our tour. She's a brilliant storyteller with ","useful":0,"cool":1},"UT1TVigwx4Sm8GkbkaaEqw":{"text":"I love history, especially when it's haunted. Arrive 30 minutes early and hang out at the ","useful":2,"cool":1},"v4lj2Ydv9uDC1ONl_cg8ZQ":{"text":"Let's start with saying Lucy our tour guide for the 2 hr ghost was very captivating. Her e","useful":1,"cool":1},"L5CY3RlKcsQGxOxOgn8DZA":{"text":"We took this tour about four years ago (during our first trip to New Orleans ) and we real","useful":0,"cool":0},"y8UlZLXBwb6Hq7CQh4JmJw":{"text":"Sedna I hope is the name she said it was Felicia if we didn't like the tour lol we loved i","useful":0,"cool":0},"m3gq2KrnMPBD1oatWs5W4A":{"text":"Sedna is extremely knowledgeable of the City, its intricacies and very respectful of the d","useful":0,"cool":0},"-lZvTbFtJt08kM7Z8-CPlg":{"text":"My family and I had an amazing night with our tour guide Drew :)! It was my first time in ","useful":1,"cool":1},"WkijDYj1QFsCaMvCitQaBg":{"text":"Okay so in NOLA gotta do haunted tour right! Well this one sucks. I'm not sure what I was ","useful":1,"cool":0},"Mmfh5XJJ3otpMG0H8F718A":{"text":"Our 1st night in New Orleans & our daughter wanted to go on a ghost tour. To be honest, we","useful":0,"cool":0},"6K0Ow_U5r1f3qFxSzylhwg":{"text":"Tiny was DA BEST tour guide! Made everything interesting and fun! Would def recommend!! An","useful":0,"cool":0},"aT0jxRJOTrLLSr84GGTmJg":{"text":"SAVE YOUR MONEY! We just went on this tour and approximately 1/2 of the people that starte","useful":4,"cool":0},"fB4gpvsjwiwdQ0eWAjhYBQ":{"text":"From our initial contact with Cher Miller at the ticket sales store on Decatur Street to t","useful":1,"cool":1},"f0VyO-jcCkZHFriHvIXkwQ":{"text":"I just got off of what they call a haunted history tour, it lacked history and haunting. W","useful":2,"cool":0},"3yVQbSr9ji94wGM9KU-FJA":{"text":"Enjoyed the tour. Our tour guide Arya was very informative and fun. This was one the highl","useful":0,"cool":0},"k7LgCXAbarSYQeH0IWgpGg":{"text":"Lisa is the best storyteller!! Do yourself a favor and stop researching all the other tour","useful":1,"cool":0},"svgdohyJODQSc2RRxaaKYg":{"text":"Not so good\n\nGuide could pick a better less congested route.  Only heard half of the story","useful":1,"cool":0},"Gy6y4w7UAxfDVfwR1B6gmg":{"text":"Did the Cities of the Dead Cemetery tour and it was AWESOME! Our guide Drew was fabulous. ","useful":0,"cool":1},"MSOZM44H4pmAXFEJ06DzIw":{"text":"My friend and I did the St. Louis Cemetery #1 and the 5 in 1 French Quarter tours with Ste","useful":1,"cool":0},"Z5PRK6R9_cxlG0uLbUtwog":{"text":"Absolutely perfect! Our tour guide Drew, was not only knowledgeable but clearly passionate","useful":0,"cool":0},"22KM_Pit6p7JVE_pvaCZOw":{"text":"Meh. The guide had a strange intonation to his voice which although the stories were detai","useful":1,"cool":1},"2vpU7xi7ZzSuLWCIg7plDQ":{"text":"Lisa is an awesome tour guide! We took the 5 in 1 tour last night and it was awesome! She ","useful":0,"cool":0},"owkP6y9gonwwET42zUr3CA":{"text":"We did the 5 in 1 tour and it was a lot of money with not much value, we stood in 2 spots ","useful":1,"cool":0},"fxbNizxAh3DU1pTmT2ZmXg":{"text":"A couple of friends and I did the haunted pub crawl on our last night in New Orleans and i","useful":0,"cool":1},"fexLbecQiirtC15fdDmVbw":{"text":"Whoever rates this good must be crazy!! This is nothing more than a walk stopping a few ti","useful":1,"cool":0},"SX_aSwStLlwnsq5GPm27jg":{"text":"Drew was f$&@ing great. Had wonderful insight and actual history knowledge. Haunted pub cr","useful":0,"cool":1},"1O4Eao2Viih0MDZeCS6n2Q":{"text":"This was a really great, informative tour! I think our guides name was Christine? She was ","useful":0,"cool":0},"--AA7AlVmcx7C9ivUibvfA":{"text":"I completely disagree with what was said below about Adele. They are sooooo wrong . I did ","useful":0,"cool":0},"KlbDliOE_wa4olhp6EzYLQ":{"text":"My family recently visited New Orleans and were hoping to enjoy some campy stories along w","useful":3,"cool":1},"KaTCONtsBNYd8IE7FrLtuw":{"text":"A great all around tour! The five in one tour covered all the interesting spots. Our tour ","useful":0,"cool":0},"_DYAp68cT7qtzrA0xZODFw":{"text":"I used to feel confident taking all my friends who came to visit on their ghost tour. It w","useful":1,"cool":0},"05I5lurZXSd29QlIR_TwKg":{"text":"Lacey  is amazing! My group of 14 loved having her as our tour guide! She is super informa","useful":0,"cool":0},"ZjVes8-FbTB3g8hnwatitA":{"text":"This tour was outstanding.  James our tour guide was fun and knowledgeable.  We did the 5 ","useful":0,"cool":0},"55yTUdDpCoA38OGm7k1dEg":{"text":"Good time with a pretty good story teller. I felt that our tour guide was very knowledgeab","useful":1,"cool":0},"t0oMBbx1RivqMT4ZopGeMQ":{"text":"We did the 8 p.m. Ghosts and legends tour with Claire. She is an amazing story teller.","useful":0,"cool":0},"krJ27B65k7jLrIg2rSzgkA":{"text":"I cannot rave about this company enough. This was my fourth time going on a tour with Haun","useful":1,"cool":0},"igYmSth4UrDf5cww3CYyYQ":{"text":"French Quarter Haunted Ghost Tour\n\nGreat tour with Clint! We had a better \"haunted\" experi","useful":49,"cool":49},"Rj8O1s06Au0fwfT_nyJ5wA":{"text":"5 In 1 Tour Experience \n\nOne of my favorite things to do when husband and I travel somewhe","useful":58,"cool":49},"QBXmCv8bQlquYheS_GPqkg":{"text":"I've been to New Orleans and have had a couple of tours but this was my first time with Ha","useful":0,"cool":1},"OdwOjxA7l3uG2r31sHplaA":{"text":"My boyfriend and I went on the 9:30pm tour and the last weekend in January with Cedric and","useful":0,"cool":0},"eLBzAm0POJnYI64Cc1guqw":{"text":"The Cemetery History Tour was excellent. Ernie was incredible. You know he's told the same","useful":0,"cool":0},"IQsqBjDGd-HpC00j_u9vHQ":{"text":"Cedric was awesome and amazingly knowledgeable! He was super funny and we had the best tim","useful":0,"cool":0},"DQ0GZP2NXBsYcAw6HCz0Lg":{"text":"My husband and I were in New Orleans three weeks ago and took the DEAD OF NIGHT TOUR.  Toa","useful":0,"cool":0},"kk-mGBkAK4IhReDhH1rtWw":{"text":"Still on the tour and can not wait to get off! A total scam !! We were told we were going ","useful":0,"cool":0},"Sx89TjHFFKrUM_hraYZfYA":{"text":"I did the 5 in 1 for my birthday and bobby was amazing all of the stories were interesting","useful":1,"cool":1},"tZ7kfrSs4OMEWvT3-pTfzA":{"text":"I'm in Nola for business alone and decided to take a walking tour. Our guide Drew was info","useful":2,"cool":0},"Q3So3fMsvKYkd2FV_BysVg":{"text":"Trent was super friendly, very knowledgeable and I would definitely recommend his tour to ","useful":1,"cool":0},"nu3YghTf3MEhkTPUlJHBsQ":{"text":"We did the French Quarter tour recently and James was a terrific, theatrical and very ente","useful":0,"cool":0},"Yh-C-Rtb8JYZYUzVLJjqbQ":{"text":"This tour was great! Tiny was a really great guide, informative, a good ghost storyteller ","useful":0,"cool":0},"PB_KUdLwuiPqgXsaLZkSKA":{"text":"We took the bus tour with Lacey as our amazing tour guide, she was awesome! I learned many","useful":0,"cool":0},"0VgK7ezEEK4mIykY3en8gA":{"text":"My friends and I were in NOLA for a bachelorette party and kept hearing about how awesome ","useful":0,"cool":0},"Sf1APz3JKPHtglcz4P-Hag":{"text":"Ari was a great tour guide - very knowledgable, entertaining and definitely knew her stuff","useful":0,"cool":0},"lRXzwdBDQJ1AKcRlG36VLA":{"text":"I really need to write two separate reviews for the tours we went on with this company. Th","useful":0,"cool":0},"MTDIYhj6YriNIcXC0ooIsA":{"text":"I was very excited to visit this vibrant city and to have the opportunity to experience Ne","useful":2,"cool":0},"v3zfOenfBxvwl_k0loJRZA":{"text":"We took the 2-hour French Quarter Ghost & Legends Tour (offered at 6 pm & 8 pm nightly yea","useful":2,"cool":0},"1GVIl6RmWmqwkY-wFpnU0w":{"text":"We went on a haunted French quarter  tour on 10/30/20. \nOur guide was Evie and she was exc","useful":0,"cool":0},"DuAw-lhyadNk2Or7pX5fDg":{"text":"Traveled from Austin Texas and enjoyed the activities around the city! James was a great f","useful":0,"cool":0},"9f3IeM-4VgY9V0nI99l1WQ":{"text":"First time on a ghost tour with haunted history.  On a Saturday evening it was a big group","useful":0,"cool":0},"VgFb3nZPTWwem_-gg-uziw":{"text":"We recently did the haunted history and legends tour and enjoyed it. Guide was very inform","useful":0,"cool":0},"sCJMiI6Yc9mbNUPVn5UNpA":{"text":"I had never taken a tour like this before and had a great time.  Claire was our guide and ","useful":0,"cool":0},"8GMZTmby-13PAySVBmNagA":{"text":"Gwydion was our guide on our Vampire tour and he is very passionate in what he does. Conti","useful":0,"cool":0},"HM_iiJU-PUJ04C4_14dQNQ":{"text":"Soooo cool and spooky. The tour guide was VERY knowledgeable and acted out her stories. Th","useful":1,"cool":0},"IyOIZFCkbwjkeXCNVZB2SQ":{"text":"We took the 1/2 hour haunted history carriage ride and we were very disappointed. The driv","useful":0,"cool":0},"M2-Vwhu9HtSXB-MMqgP25A":{"text":"We took the French Quarter Ghosts & Legends tour with Will last night and he was a fantast","useful":0,"cool":0},"QIEXuEJDPdJcJ9kmUnrcAg":{"text":"Drew was an AWESOME tour guide! He was animated and informative. He filled in our folklore","useful":0,"cool":1},"z76jgkv4ajrFHDUJIDxgug":{"text":"James is a snappy dresser with an impeccable sense of style. Also very theatrical and the ","useful":0,"cool":0},"F1xeF5Cizkn_MnntJCrLVg":{"text":"We took the Haunted Pub Crawl Tour with Orion as our guide.  I cannot say enough good thin","useful":1,"cool":0},"D8_KKS51YLbQ3t0iaBA5SA":{"text":"We brought our 14-year-old son for his first trip to New Orleans and one of the first thin","useful":0,"cool":0},"CwxU60l9dLQzFOTpQ-dJ3g":{"text":"We took the Garden District tour from Jesse and it was excellent. A lot of really great in","useful":0,"cool":0},"Lw3njiEQ756xtMt6fch1bg":{"text":"Haunted History Tours were very informative. We could have went all day. Toast was our gui","useful":0,"cool":0},"Ru7h0I4BOYpaU_zgPlUYCA":{"text":"Drew was our guide and he was absolutely amazing! He makes the stories come to life and is","useful":0,"cool":2},"8ZZUvzTycKZ8onvatejWIQ":{"text":"My family (husband and adult kids) and I did the 5-in-1 ghost and mystery tour. James was ","useful":0,"cool":0},"5JX-Y7TUl66B21eZRzR95g":{"text":"Went on the 5-in-1 ghost tour with Moira. She was AMAZING! So interesting, charismatic, an","useful":0,"cool":0},"592es26uEy9s84ciaOOOaw":{"text":"Our tour guide, Evie, is the reason I'm giving this a 5 star rating. Ghost tours in genera","useful":0,"cool":0},"DKTkQFtU11PporekybAbEA":{"text":"Ari was our guide. Such knowledge and respect for the people in the stories she was tellin","useful":0,"cool":0},"TFdv8BjVdGTpstBTUxGbSQ":{"text":"While i have enjoyed your tours before, as a resident of New Orleans, the venturing out in","useful":0,"cool":0},"5MlRCqMcPZP75SYcANgSkg":{"text":"Wonderful tourguides!you can always get a good tourthey have good experienced guides best ","useful":0,"cool":0},"2Kb8hGjzCo7uuul9jEaOuQ":{"text":"Gabe was our tour guide for the five in one tour.  He did a great job piecing all aspects ","useful":0,"cool":0},"oBBF1cXFaD6THr3NSG4i0A":{"text":"I was on the Haunted history your with Stella and she was very energetic and captivating i","useful":0,"cool":0},"eOktdgZf_s-ZzQHlXbcWkA":{"text":"Taking the vampire tour was a last-minute decision, and it did not disappoint. Our guide w","useful":1,"cool":0},"lzO2DSjMr43WS29N-p-Pug":{"text":"Had a great tour with Toast\n  Awesome guide with alot of local knowledge.  I've been on at","useful":0,"cool":1},"Dg6-sHxmIE0mNDlPiDiomw":{"text":"Your guide was very rude. Had a bad attitude and was prejudiced against non locals. I can'","useful":0,"cool":0},"GFuHoVXlyjfa7S_H8ef4uA":{"text":"Squid is a great storyteller, and her ghost tour rocks!  She has vast knowledge of New Orl","useful":0,"cool":1},"i0KVsO_kNB4iTtUK377zBA":{"text":"Rose was great, she was very helpful and knowledgeable. She tells amazing story's and give","useful":0,"cool":0},"iOz6B54t5BT2gbHbcfrUVQ":{"text":"We went on a haunted bar crawl with Drew. He said he'd already given three other tours tha","useful":0,"cool":1},"G_3YbKKSVQQ7uqPkLIRi2A":{"text":"I've gone on three tours with Haunted History, and I've loved every single one. Our tour g","useful":0,"cool":1},"dddGpSye2jzeui7sMGDGzQ":{"text":"Squid was super awesome, and really helped us visualize the interesting, dark history of t","useful":0,"cool":1},"k-i5y4R7xm0yDA0kxJ0u6g":{"text":"Sara was the best guide! Such a great tour! We highly recommend this tour! A great way to ","useful":0,"cool":0},"951BmH3fHmCqHPn8_hKzxA":{"text":"Always a great night for a good time, and it is well worth the time and money.\n\n  The tour","useful":6,"cool":4},"O5eirPPDTUXWaG-HiC6Fug":{"text":"This company is awful.  Last August my boyfriend and I booked this tour for September 1st.","useful":6,"cool":2},"i-iTXqvFBUd2N262e_SGqw":{"text":"We did the 5 in 1 tour with Drew.  It was a lot of fun, and was more creepy murder stories","useful":0,"cool":1},"2CEWJBu5xEJVVJbQkkXUrw":{"text":"so we decided to do a ghost tour wh ile we were in town. It's a great way to learn about t","useful":1,"cool":1},"L5Iw6Bdfk52w3Sf-naPckw":{"text":"Stella was amazing. Loved her spunk and depth and breadth of knowledge! I would love to sp","useful":0,"cool":2},"Oc1QhMCwq-GkU9NzXg0mHg":{"text":"This is a must if you visit Nawlins! The guide was charismatic, funny, and knowledgeable. ","useful":3,"cool":3},"BCkXQPJL9PK17-yWumk3eg":{"text":"I went on the cemetery tour with my friends and their kids.  My friends and I are from New","useful":0,"cool":0},"s-Bm5ifdoG1tVxXsqEPZJA":{"text":"Great for history buffs.  Gird your lions for some of the real history, however...there is","useful":1,"cool":1}}