{"1aNrSU9CHuFnBuNFTD2cBQ":{"text":"Brother Rabbit you are young, hip, and tasty!\n\nMet friends for drinks and an early dinner.","useful":4,"cool":0},"7hFykwCH2jxzpW9f6m_Y_g":{"text":"Amazing. We had; Steak Tartare, Caribbean Seafood Pepper Pot and the Curried Goat. Everyth","useful":2,"cool":1},"P2RmX3ubUp_ZSQGV4zMGNQ":{"text":"Of all the restaurants we tried in New Orleans, this was by far our favorite. I had both l","useful":0,"cool":0},"kifghlzCVco0t-8K82cN0A":{"text":"Great place. Had the Louisville Slugger cocktail. Abigail is an amazing bartender!\nWe went","useful":0,"cool":0},"-SvgE7ykP1up5_iyaAQ5zw":{"text":"Sublime! Came here on a recommendation from a NOLA native friend and was not disappointed.","useful":1,"cool":0},"hPWOeQxtmm9iMSeHVjux3A":{"text":"Just a quick update to note that Yelp's hours for this restaurant are incorrect. CL closes","useful":0,"cool":0},"9ab-OmzB8VWmHiPY1l4syw":{"text":"This is my new favorite restaurant in NOLA.  I've been several times and can't stop raving","useful":4,"cool":4},"pC6AmXHKaKcAiLETbCr8zA":{"text":"I was in the mood for beef. The tenderness and flavor of the meat was excellent. Service w","useful":0,"cool":0},"zZ83pUxhkOWduva12sCsFw":{"text":"Loved everything -- had great cocktails and wine, steak tartare that was awesome, broiled ","useful":1,"cool":0},"w_B-cTrnjYtRJgjwV4gcWw":{"text":"I was here a few weeks ago and this experience really stood out for my trip. Kerry was a g","useful":0,"cool":0},"rrMUoe7AdH6gLnMC0XuOyw":{"text":"This was my favorite place on my trip to NOLA! The service was the best I've ever had (Gav","useful":0,"cool":0},"iRerw4S4I_4n8_q3DGIAWw":{"text":"This food experience was very well accepted. Claire, our server was awesome and knew exact","useful":2,"cool":1},"8jhrRK-zGsf4umLBqbQLvg":{"text":"Unique environment but was not obsessed with the quality of food, for the quantity of food","useful":1,"cool":0},"SVQKNUuhQrRMLxvz-mNYcw":{"text":"They had me at the copper bunny...vodka, pineapple jalapeño tequila, lime juice and sparkl","useful":0,"cool":0},"ttZxPWstaWHBOC7Gyzh2Sw":{"text":"One of the best meals I have ever eaten; took a few colleagues here for a celebration and ","useful":0,"cool":0},"Oh521hZbx_AK45F3XIzMNw":{"text":"The food was good. It really was. I don't think it's better than a number of other restaur","useful":0,"cool":0},"3hPAxLtr6LsJwl41BnggRw":{"text":"Sunday brunch, it's an experience!! Food is extraordinarily, high quality and the use of h","useful":1,"cool":0},"esANBbqbYZxrE6y7R9mQFQ":{"text":"The dinning experience here was a little off.  We had reservations but were made to wait 1","useful":1,"cool":1},"LF1VBvZnXhsBSIVIglGUww":{"text":"I went opening night. It seemed like a few small things needed to be hammered out but over","useful":0,"cool":0},"1pEndvBr-VFvnYQ99xdhCA":{"text":"Great experience at the preview tonight with my mentor S!\n\nService was a bit slow but we e","useful":12,"cool":10},"zTqRXuAzDmiYvKzduUQBIA":{"text":"Great restaurant in a hip new hotel, it's naturally not as cheap as a chain restaurant but","useful":6,"cool":4},"YbUZAx3h1smTEFFmFr9Gnw":{"text":"Yummy Caribbean bliss.  Tuna tartar fills your entire mouth with smokiness is it cut by th","useful":0,"cool":0},"T4e0ipxXx568PnS3S6lT8Q":{"text":"Beautiful restaurant, good drinks, good food. While the server did a great job, the food c","useful":0,"cool":0},"tUGrYe8fDeXbp_pXBY64CQ":{"text":"Stayed in the Old 77 and was excited to see Nina Compton's restaurant was in the hotel dur","useful":0,"cool":0},"bdtRGdhWaZJpQfkcthTZGQ":{"text":"Everything about this place was amazing. The atmosphere, the service, the food, and the kn","useful":5,"cool":3},"jT_WxNr63eJe8-ajblWogQ":{"text":"This was probably the best meal I've had in a long time.\n\nCurried goat.\nShrimp\nGnocchi ---","useful":0,"cool":0},"0ZOzqJfCXdTBpD-p18JK6Q":{"text":"Delicious! Lots of flavor in every bite, from the carrots to the filet of beef.  The chef ","useful":3,"cool":2},"4Aurt7lrTNrJlm-7NqLQKQ":{"text":"A wonderful dining experience, food AND drinks are phenomenal! We did Cochon, Restaurant A","useful":1,"cool":1},"gp_6ALm44nJ35TWUE0BAPg":{"text":"Always a winner!\n\nThis place is located right next to the Old No. 77 Hotel and is always c","useful":1,"cool":1},"B06WeuZataNxuyhHnYINcg":{"text":"Wow! The hype surrounding this restaurant is certainly merited. Loved the conch, gazpacho,","useful":0,"cool":0},"XgD1M3RBvetdMJx8IcHr4w":{"text":"Everything we had was spot on. We started with the crispy dirty rice, tuna tartare, and th","useful":2,"cool":2},"DGJet9UKgepErq2-Xc6Asw":{"text":"Went here for brunch a couple of weeks ago and I was very pleased with my meal.  After fol","useful":2,"cool":1},"yVJY6VB17-s780Cr6Q1aiw":{"text":"5 star review for their brunch! We came here at 11:30 AM with a group of 12 and were promp","useful":1,"cool":1},"qlNZX_LtR1PryFj7B5IZDA":{"text":"My girlfriend and I had an incredible time at Compere Lapin. Everything from the cocktails","useful":0,"cool":0},"Vm65JL6wXEyGNCP7HSoDwQ":{"text":"Could do without the appetizers that were a bit greasy and nothing great but, fish first c","useful":0,"cool":0},"atCXgLrRyP8IY-U3sWGpnQ":{"text":"Pretty tasty food but the prices are outrageous and portion sizes small. Ordered the curri","useful":1,"cool":0},"1rOrfBVg3VQFTzIVI60juw":{"text":"Our inaugural post comes from the Warehouse District's newest restaurant: Compère Lapin. T","useful":0,"cool":0},"ur2DS1wWhV5xdnjQX1GUmw":{"text":"This was excellent. We came for dinner and got conch croquettes, crispy dirty rice arancin","useful":3,"cool":3},"8z11Sdhd4lpwUPS06VlrJw":{"text":"Super great lunch - wagyu burger and drum were fantastic!\nFun atmosphere and great service","useful":0,"cool":0},"9GQ74GVVkXv-4jCzKDPXxQ":{"text":"Decided to go here after hearing the chef was on top chef! I'm a little bit between 3-4 st","useful":0,"cool":0},"6zyteONq2LtzXWQ09mTEdQ":{"text":"Amazing food.  Great ambiance.  We had a little bit of everything.  Not gonna list all the","useful":1,"cool":0},"-HNbVv7ZXDPjYNSVVbXFHQ":{"text":"There were four of us and we each got a separate dish. They were all delicious.  We were s","useful":2,"cool":1},"xBBo6EAiVDpoODWFsICumA":{"text":"Compere Lapin on paper is everything an exceptional restaurant should be.  Excellent desig","useful":6,"cool":3},"ay9oX4axPf_VynkX5bdExg":{"text":"We enjoyed breakfast here a few days in a row. A nice quiet atmosphere with great food.","useful":0,"cool":0},"XKR_5hBtD_xp5yjd5R4wcg":{"text":"This is a fantastic restaurant. The atmosphere is great, not too formal or stuffy, has a v","useful":0,"cool":0},"z3kttzVft8SpwHus_oQkWw":{"text":"I've been eager to try this restaurant once I learned that Nina Compton opened her own pla","useful":0,"cool":0},"cQx_3X7avfft8R9Eb-fPZQ":{"text":"So great - I almost gave 5* but the prawns were so big I was uncertain of how to eat them ","useful":0,"cool":0},"ghkrolJ7U97QvBNeNThDRw":{"text":"An excellent restaurant if you want to experience a full dining evening.  The hostess was ","useful":3,"cool":2},"dfJT7pJr1A_NMgKGU2vFLA":{"text":"New Orleans in is one of our favorite foodie cities to visit.  Have been here at least twe","useful":0,"cool":0},"y_86yDIR2oz8WiW_DbqFYQ":{"text":"Love the atmosphere and also the food! Drinks were great, bartenders were friendly and rec","useful":0,"cool":0},"hO6PtELLjznveQjDAPkvIQ":{"text":"Awesome decor. Great service. A very busy place so either get reservations or sit at the o","useful":0,"cool":0},"lv2kb782aPl7rqdow0wHcQ":{"text":"The atmosphere is trendy, kinda loud even in the back of the restaurant but it is a beauti","useful":0,"cool":0},"bSMVepa4WycLvXqUTllyiQ":{"text":"Great atmosphere, dimly lit in the evenings, and the biscuits are literally to die for. \n\n","useful":3,"cool":1},"5JyyttxVFVq7rUB5rYihxw":{"text":"The drinks were very creative and delicious. Food was good. The pig ears, pasta, and panna","useful":0,"cool":0},"Ya_uRKt6qHtSmMbTa370gw":{"text":"Perfectly fine brunch here with friends - nothing to write home about.  Nice setting.  Sma","useful":1,"cool":0},"eaGNujUzTjNp3BAR5ma6lg":{"text":"Great bar! Abigail was very knowledgeable and friendly. Learned a bunch while having fun a","useful":0,"cool":0},"otWwhZhY7EYEugoLFXzoEg":{"text":"Not very impressed with menu flavors/ and the contemporary mix of ingredients.\n\nThe \"snack","useful":0,"cool":0},"-CPd4xVkGZf_2ek9QdHgWg":{"text":"This restaurant is located in the Warehouse District inside the Old No. 77 hotel\n\nWe had a","useful":0,"cool":1},"6otaDnBwnfoVSv3yOKHSdQ":{"text":"After finding this on a list of hot new places & seeing the glowing Yelp reviews the bar w","useful":0,"cool":0},"TkRuLgcxF5xXC6_f2FYkQQ":{"text":"From the drinks , to the Tuna and the roasted chicken this place is beyond delicious !!","useful":0,"cool":0},"OCMKcraNQg_dllhd4G2hNQ":{"text":"We had friends coming into town on a Sunday morning, so, over the course of the week,Hubby","useful":2,"cool":4},"kaFaMl9-Ba85ZziAuRLZQg":{"text":"We came here for our last dinner in NOLA and I'm so glad we did. Yes, the biscuits are del","useful":0,"cool":0},"FCLR5X2JDX2To2JhC6Dilw":{"text":"I stayed here for a conference across the street. Let me start by saying my worst experien","useful":1,"cool":0},"rpkmM4mBnlfbiCoDK7xZsg":{"text":"What a cool atmosphere full of BS! Half the restaurant was empty yet the rude hostess woul","useful":1,"cool":1},"JlDHQ6MnkA-T8tiRIsxO_g":{"text":"The place has a great vibe. The hostess is a darling. The bartender is efficient. The serv","useful":0,"cool":0},"qJDy3buOMhpga5zq80C_6w":{"text":"THANK YOU FOR RUINING MY CHRISTMAS DINNER. Huge rip off $75 per person prefixed (the worst","useful":1,"cool":0},"YUxTGd62wA92ZdoYxqegZg":{"text":"Just had a client dinner at this restaurant with exceptional food. Tried a variety of cust","useful":0,"cool":0},"99S5j4g3GOCVOat1gCaYFA":{"text":"Writing this review after my third time dining at Compere. It is consistently good every t","useful":0,"cool":0},"oWeIskpfJHG3f6GvaAo8Hw":{"text":"Loved. Loved loved. The biscuits. The pig ears-soft and addictive. Goat curry might be one","useful":0,"cool":0},"F9iB1OmYYHdjjPwQZ5TUFA":{"text":"We had high expectations for this place and it was just OK in comparison to all the great ","useful":2,"cool":0},"hLpWOm3RBnbhut1xV3K5YQ":{"text":"Great cocktails! Very good service. I had the dirty rice arancini which was really really ","useful":0,"cool":0},"XKi86DPUQpBuUu6sTdIqjA":{"text":"I was extremely excites to brunch at this restaurant because I am an avid Top Chef fan and","useful":0,"cool":0},"wAqyOgoW-Ie_QdXTodSXrA":{"text":"I have eaten all over the world...and this place ranks number 4 on my list of \"best places","useful":3,"cool":2},"fCtwFHj7VBoku3CDZKQXCQ":{"text":"Best meal to-date in New Orleans! Our server was very friendly and helpful, sommelier help","useful":0,"cool":0},"fLf9GoLZTIlYtXBx0j3fig":{"text":"Has been on my list to check out for a while and it did not disappoint. Great food and por","useful":0,"cool":0},"c-wf0SDOjIL8v9d1X2GrPg":{"text":"We had an incredible dinner with the best waiter I have ever had in my life! His name is B","useful":1,"cool":0},"naeRVftINpoFDeNs1OMUaQ":{"text":"Truly amazing meal. Favorite part by far was the hamachi curry. Cocktails were excellent. ","useful":0,"cool":0},"UOfSBv9TroE48EoILDZZlw":{"text":"This place was AMAZING! Chef Nina Compton has put together some of the most tantalizing fa","useful":2,"cool":2},"tXi1WQpDg8-R1YIC_B8sig":{"text":"When my fiancée said he found chef Nina's restaurant in NOLA and there was goat curry on t","useful":0,"cool":0},"jmR2KIWOU_GFR6Ax4EnX7w":{"text":"Just about every restaurant in New Orleans have amazing food. they use just the right spic","useful":0,"cool":0},"7EFfggnXHu__0Y6IUW5Q3w":{"text":"Excellent food in a really cool space with a lot of warmth is the best way to describe thi","useful":2,"cool":1},"g1GhH02AubfRO_M2dR8cqA":{"text":"Having participated in top chef and tasted ninas food during the competition, I was disapp","useful":2,"cool":1},"RUBGABqzQdFJalHXRaIkWQ":{"text":"Zack the bartender gets 10 stars. Made us phenomenal cocktails and one was a reverse Rob R","useful":0,"cool":0},"beOn790Fw03zwEb5LLzx8Q":{"text":"The food and service was exceptional.we were looking for a unique dining experience for lu","useful":1,"cool":2},"C6VG_2Pldlu3vHU6qnuh3w":{"text":"I went here for lunch last week with some friends I hadn't seen in over 30 years. It was a","useful":0,"cool":0},"wuJ0rsi1CdRRIpdKJWKVbg":{"text":"If you are going to splurge and over eat this is the place to do it!!!  Plus , Domingo is ","useful":0,"cool":0},"QGwtf-CAdspwWtcwUlLYdA":{"text":"Love the old time New Orleans feel with modern drink menu. The wood bar, brick walls and m","useful":0,"cool":0},"9kapxwMAwveMHXCwg0FzZg":{"text":"Impressively creative.  Luscious.  Everything we tasted was fabulous.  Definitely recommen","useful":2,"cool":2},"5ilo_l5UtmHfAwabZYpBSQ":{"text":"I admit I was a little shy of the adventurous menu.  But it was all very tasty.  We had th","useful":0,"cool":0},"pwow7t5WgSB5tMLendN74w":{"text":"We came here a couple weeks ago to check out the new happy hour menu and we really enjoyed","useful":0,"cool":0},"c-zZIobouONjNpF7ltBBQQ":{"text":"Excellent brunch. The squash fritters with crawfish are amazing. Best Bloody Mary in New O","useful":0,"cool":0},"nbcCJKfqNJKfAlXYFTDJag":{"text":"After many raves from friends, I decided to visit this restaurant on my short visit to NOL","useful":1,"cool":1},"7Ad4IX-GDm3NHWrmjIhRYQ":{"text":"Upon arriving for my 7:30 reservation a bit early I was told quite quickly by the host tha","useful":2,"cool":1},"X3EbFRGIMaIdpdRQCkO9Rg":{"text":"Don't waste your time with this restaurant. The service was slow. They forgot a drink orde","useful":2,"cool":1},"kgCHyncFzGxx6Fs3yNQTeQ":{"text":"Came for dinner Sunday night. The food and bar program were outstanding, as was the decor ","useful":1,"cool":1},"TDph0Nkr7kCAqrj-aDM3Mw":{"text":"Well crafted innovative offerings in a neat space.\n\nVisited for pri fix brunch. Tuna bagel","useful":0,"cool":0},"xB42Yy5CO6GEENDmXwcZLQ":{"text":"Amazing meal! The staff is fabulous- especially the bartenders/mixologist- love the entert","useful":2,"cool":3},"2y7aX_9WvnUQ-OVJ66tE_g":{"text":"Really great food and fabulous cocktails - went here my first night and stopped off for on","useful":0,"cool":0},"E0spszFPFC0XDXqn6BW9wg":{"text":"We had our last meal on our recent trip to New Orleans here. The food exceeded our expecta","useful":0,"cool":0},"ttki0RgWrTtj8_QUIkB_QQ":{"text":"I'm so glad this place is in our neighborhood!!\nNew, hot, a gorgeous room, a solid bar, AN","useful":2,"cool":1},"ryqV9jhBr2Kxi1FJTbTRYw":{"text":"For me long awaited and much anticipated and it exceeded expectations.   I quit watching T","useful":2,"cool":3},"BZuL1Mp7aVyr1tJOOJITLw":{"text":"This place has for a really cool vibe to it. We started our morning out with there coffee ","useful":0,"cool":0},"RusEhOXKIIJA2zSqYhvHGg":{"text":"We were in New Orleans for a conference and we are big Top Chef fans so we decided to try ","useful":0,"cool":0},"tGaSIOa9MSnrCT_kr2GdgA":{"text":"I'd give it 4.5 stars if possible, but it's not.  Host station needs some work on greeting","useful":0,"cool":1},"s5v2M_ibAzIxZlSMY4ni-w":{"text":"Everything and everyone here, from the hostess through our waiter to an earnest conversati","useful":1,"cool":0},"vbJTg1-mX2SszRD2dcSnqQ":{"text":"We had eaten here a couple  of times before  relocating from Nola. The food and service wa","useful":0,"cool":0},"9vd30H43L2uWst59qMazDw":{"text":"The decor of the restaurant is incredible, but the rest of our experience wasn't very grea","useful":4,"cool":2},"v9GGUzzpz0yCJmSXuCJ6hQ":{"text":"Don't bother coming here for happy hour. It doesn't exist. We had read a NOLA.com article ","useful":1,"cool":0},"xU5v2QboeJ40NeN74-ra_A":{"text":"I visited this restaurant on a Sunday after church for brunch last min reservations , it w","useful":0,"cool":0},"QGULIAcxYl4W_D1MsNslrw":{"text":"Another amazing evening with our friends at Compete Lapin. My wife truly enjoys the extrao","useful":0,"cool":0},"8rvs9EsU8vw-WAZZ9xucag":{"text":"My wife and I went to Compere Lapin last night. Been waiting for this to open since I was ","useful":4,"cool":4},"LdCmzSGTvMRz7H1oobhEXg":{"text":"Had an absolutely delicious brunch here. Our server Nicole was so sweet and enhanced our e","useful":0,"cool":0},"UMAR6T8h04dV6huZJO7VFA":{"text":"Everything about this place from start to finish was perfect. The hostess and servers were","useful":0,"cool":0},"iOWp9Fc9ghZP3sz6SOJ7cw":{"text":"Hands down the best food & drinks during my stay in New Orleans... I eat here many times w","useful":0,"cool":0},"zs1YX_5z90QS4CF6rfz1oA":{"text":"Heard about the attention from the James Beard folks. Went for lunch with high expectation","useful":0,"cool":0},"-bE0-R2gpfl0Bi92cvxjdw":{"text":"Yes, the biscuits are amazing, the food creative and flavorful with Caribbean notes and ve","useful":0,"cool":1},"d368GooRrKvAyWDEyLQRqg":{"text":"I believe that food is a channel from which we learn about our own lives. When I want to f","useful":0,"cool":0},"9aQ6w14iE-JXMalv_LEMwg":{"text":"Lovely Atmosphere!\n\nWe ordered a bit of everything! Presentation was on point!\n\n* Small bi","useful":0,"cool":0},"2YmGJNCamgwC-r0GZ5nAdQ":{"text":"Came to CL on a weekend trip to New Orleans and was very pleased with my experience. The i","useful":0,"cool":0},"M0dbGyrkTteZmGQalV0fgA":{"text":"One of the best meals I have had a NOLA this year.  This new restaurant lives up to the hy","useful":1,"cool":1},"_2NrzokQKu0yIjGseQ0T-g":{"text":"Sunday brunch was very satisfying. Food was tasteful. Portions was perfect is size. I thou","useful":0,"cool":1},"47A4iBTOuT43z6Dw4JoB5g":{"text":"Hubby and I have differing opinions on this place. I thoroughly enjoyed my meal, but hubby","useful":0,"cool":0},"c1FnWJJVFYjxdIeMUdrJ-w":{"text":"To be clear we ate none of the food that danced by us, rather our station was firmly poste","useful":0,"cool":0},"nKqD5fLmHbfsbnt6bl_tuw":{"text":"I actually can't say anything bad about the food. The food, indeed, was delicious. I think","useful":2,"cool":2},"IzTI7c_Zm7K5VKcUM9jf6A":{"text":"The decor of this place is really unique. Food and service have always been very good. Thi","useful":1,"cool":0},"-c5wWlVaiiZ9FTQVe7tCiA":{"text":"This has been one of my favorite restaurants in New Orleans so far. We ordered the dirty r","useful":0,"cool":0},"_8jn9nfgcYrla-TFmlWB-A":{"text":"Our group ordered a dozen oysters and shared several of the small plates. We loved our wai","useful":3,"cool":1},"dinbVnGdfsZY6st2AKPsVw":{"text":"We had the brunch menu, not extensive but very tasty and unique. The tartar was great with","useful":0,"cool":0},"29DD6paSrO9KgJHk_o7qPQ":{"text":"Fantastic meal and fantastic service. Everything we ordered was absolutely delicious. Will","useful":1,"cool":0},"dDWLlWJ_vcOeqXSpIc3Uuw":{"text":"Great restaurant inside of a hip hotel. We had the conch croquette, steak tartar, curried ","useful":0,"cool":0},"jkMwSmk4vwxSttioLxTWQg":{"text":"Food was rich and amazing.  The half bagel with lox and sauce was really amazing spin.  Th","useful":0,"cool":0},"J67DR0Akxid1okqbzVEXnw":{"text":"This was the best food experience I had in New Orleans.  Everything was absolutely delicio","useful":0,"cool":0},"slTZN2YLKj9bhfsd78Msnw":{"text":"I had the pleasure of attending one of the preview dinners and I can honestly say it was o","useful":1,"cool":1},"SkPRj6IWPW0SESYs_850rg":{"text":"I can't stop thinking about the meal I had last night at Compere Lapin. We made a last min","useful":2,"cool":1},"8KmZxyfD2ybBIDffc9hZTg":{"text":"My wife and I ate here a few weeks ago. We thoroughly enjoyed our meal. The waitstaff was ","useful":0,"cool":0},"AoameQ1U1Ip1ac60YxrAVg":{"text":"Even by NOLA standards, this was an incredible meal!\n\nTwo of us had the CL Pimms Cup - way","useful":0,"cool":0},"L6Miy3qDhJ7iAonblWS_cQ":{"text":"One of the top three meals I've ever had in New Orleans... And that's with fierce competit","useful":1,"cool":0},"eXK-U5kXtMV6IONDKzFWKA":{"text":"Great restaurant and service. Ordered special - bone in pork loin with grilled brussel spr","useful":3,"cool":2},"obVZz4W-YjV-DZYU3v8XTg":{"text":"Tourists feel free. Locals -sigh- try once and then go back to your local favorites so at ","useful":3,"cool":0},"7mnQj6lpsdG0ZuRH5x9XLg":{"text":"#NinaCompton is the new queen of New Orleans cuisine. Depth, breadth, zing, pow, bam and a","useful":2,"cool":4},"aaI2gHAALRMXOxImzxQLdw":{"text":"Although the food was delicious, the fact that several servers repeatedly tried to snatch ","useful":5,"cool":1},"fCRtnobwNfajZseLB6s08A":{"text":"Wonderful, wonderful cocktails. Asked for something with cucumber and they gave exactly wh","useful":0,"cool":0},"H8odf5vrYHwTESvrnfrFlA":{"text":"Another delicious meal at Compere Lapin. So sad that they no longer serve the Harvey Jones","useful":0,"cool":0},"svCqcaqKgkhH4poAlnvlBg":{"text":"Stop #4 on the NOLA food + cocktail tour... me thinks we should've quit while we were ahea","useful":2,"cool":0},"SQcSIcZRP-dLLkTPKeDCiQ":{"text":"I was at a conference in NOLA for a week, and Compère Lapin was one of the restaurants I p","useful":0,"cool":0},"ZHJR4ELsWOop8UO_oHINcA":{"text":"As a Top Chef fanatic, I was super excited when I heard that Chef Nina Compton was moving ","useful":7,"cool":4},"wiJLA3iy8hpNjEnsuD7uvg":{"text":"I ate here last night. I had the drum it was good. The other three people with me were ver","useful":2,"cool":1},"bs87Y3FJU8derBSyTr5WIA":{"text":"Went here while visiting New Orleans. From the New York area and enjoy good meals. \nParts ","useful":3,"cool":0},"pp7rNRXI1APSSz1vMSxCoA":{"text":"Absolutely incredible.  Started with drinks at the bar CL Mint Julep and a gin/tequila/cuc","useful":0,"cool":0},"cWthpGZYAr9_duqrOLc2dg":{"text":"My husband and I visit the area at least once a year. When we discovered Compere Lapin, we","useful":1,"cool":2},"FQg72na6FojIfcLvfGSNOQ":{"text":"I found this place walking by as I scoped out a place to have a quiet afternoon business m","useful":0,"cool":0},"bCbJH0jyhfzQ8Zp1oeqTTg":{"text":"I've been here a few times, and each time I become more of a fan. The ambiance makes you f","useful":0,"cool":0},"HZmjlV2koQpAcpl6tFqLog":{"text":"I enjoyed my dinner here.  Service was outstanding. Good was hit and miss. Chef's didn't h","useful":0,"cool":0},"nhsn1s-ohKCQtGNeTuiWDg":{"text":"From a local's perspective, new restaurants in the city can be a run-of-the-mill experienc","useful":1,"cool":1},"RVwoTJFxjG3KGRAr4utfSw":{"text":"Went here for lunch. While the food looked delicious, we waited over an hour for our food ","useful":1,"cool":0},"4mCCr2vOoD3xr03SDtrcZg":{"text":"Yum. Everything was really delicious. We did the tasting menu for brunch between the 4 of ","useful":0,"cool":0},"zyr32xj4JJfvd5x27nGBdA":{"text":"We had a wonderful meal and enjoyed the lively, relaxed ambiance.  Benjamin and the entire","useful":0,"cool":0},"1UPmldYNkB2rT0IIUoGXAg":{"text":"I've been here four times now, and while initially I was head over heels in love with it, ","useful":1,"cool":0},"hwEk-6Sw58VW7iIU2erYeg":{"text":"Came here for dinner the other night, and it was amazing...  where do I even begin.  The c","useful":0,"cool":0},"XY0mwPD6Dp2vbrhwH0qgQg":{"text":"Compère Lapin was the scene for dinner for the wife and I on our second night in town.  We","useful":3,"cool":3},"QSwunUFUkCb3NveBB35oZg":{"text":"Wonderful on all counts...Food, drinks, service.\nMy companion and I shared conch croquette","useful":0,"cool":0},"ow0MHmZWUUcsuiL4XgeJYg":{"text":"First visit here so this is a one time experience review since I am not from the area and ","useful":3,"cool":1},"BUiCJy6pSt9QveKIcrBLwQ":{"text":"Amazing, well thought out dishes by Top Chef chef Nina Compton. New combinations of creole","useful":0,"cool":0},"t0EkbCZswD6XRnK5OUkvuQ":{"text":"I am giving Compere Lapin 4.5 stars but the app won't let me!  OMG it's amazing. I have no","useful":0,"cool":0},"AIRfteU9psaWNmVUj8eHhw":{"text":"This is an absolutely excellent restaurant in all aspects, from the amazingly attentive se","useful":2,"cool":1},"_UgZwTPiN-YQyiuiWw-dqQ":{"text":"Wonderful lunch with friends the Tuesday before Thanksgiving. Our servers Nina and Larry w","useful":0,"cool":0},"jCIz8tEGwW8nLmHSdbirjg":{"text":"It's a very nice place with nice ambiance, The cocktails were good! The host was terrible ","useful":1,"cool":0},"ctVQ3ur-djIRgIeheJ6POQ":{"text":"Worst customer service experience ever - had lunch here earlier today, was nice enough to ","useful":1,"cool":1},"S6TH3-N-NlTkONIE0AN8BA":{"text":"This rating is strictly for the service as the food that we did receive was excellent. Fiv","useful":1,"cool":1},"NGVELSL8ZLJK34UbNyGS1Q":{"text":"Loved this beautiful restaurant in new orleans.  It was closer to our hotel than to bourbo","useful":0,"cool":1},"sEhOU9BXWaTREBU6G1muSA":{"text":"Excellent breakfast! Our party tried the chicken/mushroom hash, spicy black beans, biscuit","useful":0,"cool":0},"VRVvx5-M7nKB32niGb3Efg":{"text":"This is one of the most diverse and well thought out menus of any restaurant I've visited ","useful":0,"cool":0},"9rxBnpSclu67b6h39IV_hA":{"text":"I've never been a fan of New Orleans dining, until I came to this place. Menu is full of w","useful":1,"cool":0},"jhgZrgwxFkWcj4qKczY3gA":{"text":"Great food, Best cocktail I've ever had (I've had a lot).... but-- who cares!? There so ma","useful":1,"cool":1},"9Jx39CunVIrIqMn7P1yLuA":{"text":"Food and cocktail and wine selections were extensive. Bar and restaurant was very vibrant ","useful":0,"cool":0},"1tdEEZSdgiV3JUl2cx1mPw":{"text":"This place is the \"Apple\" of restaurants! Casual yet classy. While at the same time the at","useful":1,"cool":2},"1Jg9N5Q8RoGfLGkp7zqFyw":{"text":"Had dinner there on 9/ 12/2015 and probably one of the worst meals we have had in a longti","useful":2,"cool":0},"KbeinQeSU_a1kYUr-djTkw":{"text":"Bite for bite, one of the best, truly excellent meals I've ever had. The conch croquettes ","useful":1,"cool":1},"tJFrxYAhJVT9QnpYDmXiqw":{"text":"I ate dinner here Friday night and it definitely lived up to the hype. We had the best cor","useful":0,"cool":0},"-_s6H9noUqn5th6hF7_4zA":{"text":"Please please if you go to New Orleans, take time to\ngo to Compere Lapin. It's an amazing ","useful":3,"cool":2},"OeqDgV7HN3xGEbv3F7IIxg":{"text":"Atmosphere and service ok. Disappointed in all three courses. Conch croquettes were gooey ","useful":0,"cool":0},"LjvU4JXm55G2BXBYQJdZpQ":{"text":"Trendy hustling vibe, if a little loud. This new, year old eatery is a hot ticket. Very bu","useful":0,"cool":0},"3qUuBZzlthqrGmEHCda8Dw":{"text":"The Travel Papers drink is watered down Jose Quervo Gold tequila, and the Scialatielli wit","useful":0,"cool":0},"m-0BVD1JLZKygGwB7ojenA":{"text":"Bread is sooooo good! Service and food is crazy awesome. Highly recommend everything. Reme","useful":0,"cool":0},"W-CiZCCM9xLdKScMzyhwlg":{"text":"What an amazing meal! We sat at the bar and had oysters, roasted veg with almonds, and cur","useful":0,"cool":0},"Fm-hCToh3HPbDgvj568sPQ":{"text":"I've been here twice for lunch now and the food has been fantastic.  I had the tuna tartar","useful":0,"cool":0},"DOot_BxBJ5AU6jPXixBnhw":{"text":"Yummy Caribbean bliss.  Tuna tartar fills your entire mouth with smokiness is it cut by th","useful":0,"cool":0},"vJJZyQJvBwdgqcHkR7PgIA":{"text":"Amazing food.  Awful parking.\n\nGood news:  Unique flavors, all amazingly different and won","useful":0,"cool":0},"kE0w_94HoHrxFbLL-YppKA":{"text":"location\nin the lobby of one of my favorite hotels, the old no. 77. if you stay at the hot","useful":0,"cool":0},"pcgzbDTJyFIw3Tcm20c1sg":{"text":"A fairly mediocre experience, overall. Definitely overpriced for the food and service rece","useful":0,"cool":0},"KcLhFSE5KJT9WZ1yw4oy1Q":{"text":"Food is excellent. And the menu is incredible. 5 stars start to finish.\n\nHowever, I didn't","useful":19,"cool":11},"zOj19iCWvUyWMXPep47RDQ":{"text":"Here now. Stopped for lunch while waiting of my hotel room to be serviced. I can't tell yo","useful":1,"cool":1},"8bz7Xg60OWsipnVAq1CymA":{"text":"The food is outstanding but the people who work here especially the hostesses need an atti","useful":2,"cool":1},"5_fBX4nGvLSWe_M06R00Ew":{"text":"One of my new favorites in my neighborhood.  The smoked tuna appetizer is simply amazing! ","useful":1,"cool":0},"zgt-Y0bRASBN1gnqmUxC0Q":{"text":"Upon learning of Chef Nina's James Beard award, i was excited to have the chance for lunch","useful":2,"cool":0},"kayx3yk8RtGuRH4twpBvGw":{"text":"Wow! 2nd experience here and even better this time...1st turn was 5 stars as well. The ser","useful":0,"cool":0},"QlIJjpT2fxNdbPxmSxVz0Q":{"text":"I've eaten at this place a hundred times. It's always awesome. Please eat here. The wine l","useful":0,"cool":0},"8CdTrwMIwoRyvi9S6R85Gg":{"text":"We tried this restaurant on a last minute recommendation and we were not disappointed. Our","useful":0,"cool":0},"UQMrAHgyuCWrh-Ak-ujwAA":{"text":"Let me start off by saying Nina Compton is a brilliant chef.  I ate at the hippie Compere ","useful":0,"cool":0},"9M0jXki5ICrScQqH8Wq6ow":{"text":"Great experience -- inspired dishes, fun \"hoppin\" atmosphere. Drinks were stroooong but th","useful":0,"cool":0},"-Ru3jCA6TbnW9gg-F-nmxA":{"text":"Caribbean hot pot - Sounded so good on paper - A  ton of seafood and a coconut type broth.","useful":4,"cool":1},"Cy6rece5XkuasJwZvmbj-Q":{"text":"After a long day of traveling all I wanted was a good drink. While waiting for the room to","useful":0,"cool":0},"SQun7kH6_hBVHcbeDZfe9w":{"text":"Pros\nGreat cocktails (Meyer cobbler was very refreshingly, lots of tequila cocktails)\nAuth","useful":1,"cool":0},"ojOUDOPD3HMo8tL5Wfsb0g":{"text":"Wow! One of the best meals I've had in a long time. The cocktails are special: subtle vari","useful":0,"cool":0},"z14814EwlJQs3-K5KmYISA":{"text":"limited menu, food was tasty, but only 5 entree /app choices. Would have liked to see more","useful":0,"cool":0},"xfjp4Wakz08IqgVsdsFWhg":{"text":"I didn't eat there, but enjoyed a couple nights at the bar. The bar staff is fantastic and","useful":1,"cool":0},"uNDfICKq6XiLXPWeToLI_A":{"text":"Fantastic food and great atmosphere. We had the oysters, raw tuna. Great drinks. Food is a","useful":0,"cool":0},"txW0XXX7wUkBIEh3czfgvQ":{"text":"Amazing!!\n\nThe ambience and decoration are truly well done. The food from the bread to des","useful":2,"cool":1},"3f93XjWBBp2NP509BwzihQ":{"text":"A surprise late night dinner....a wonder experience from the moment we walked in until we ","useful":0,"cool":0},"8nVGEeo2vRQUDH7l72YPig":{"text":"Interesting menu and cocktail choices. \nI feel in love with the ambiance, great music whic","useful":1,"cool":1},"mdCnixY_fDHbDfsMBkXdEw":{"text":"Everything about my experience here was incredible. The service was on point and drinks an","useful":0,"cool":0},"h2NStEOJZF9lhPHWLy65mg":{"text":"It's been a while since I've tried somewhere new, so with a friend moving to Chicago, this","useful":18,"cool":6},"L3dPeKBsgYFF5MSr5kLqcg":{"text":"With a few hours to kill before a flight home, I searched for \"restaurants nearby\".  The r","useful":1,"cool":0},"uPA85U8mZBe40wzL-544tQ":{"text":"The only positive aspect was the Linebacker Larry of this establishment. The bartender Nin","useful":1,"cool":1},"AwQ1LAMYRgLoTZ-g5Y-LxQ":{"text":"Hands down one of the best meals I've ever had.  We arrived without a reservation and the ","useful":6,"cool":2},"PK3Kk087KXSAuj4tjPtCTg":{"text":"An incredible NOLA epicurean treasure trove. The jerk shrimp roll was amazing, along with ","useful":0,"cool":0},"qSs6ie4NjL3grKAwHXgYqQ":{"text":"Great food- portions are on the small side but great ambience and attentive staff. The pig","useful":0,"cool":0},"4qfXl3IdgAd5qplMqZo_Wg":{"text":"OH my freakin god I just had one of the best lunches ever! We each had to get our own beet","useful":3,"cool":3},"plaMyJwCVjyyIPqzYqUmuw":{"text":"Giving this place 4*s though it's really a 4.5.\n\nWent with a friend and we sat next to a f","useful":2,"cool":1},"lq7vpGOLK4Uml7eh2Zm81w":{"text":"Could be 5 stars but the service was not the greatest. Waited over 30 minutes for dessert ","useful":0,"cool":0},"I5V7mkMWKcmK_OGPO26GPA":{"text":"This place was a real treat. We made reservations the day before and still ended up waitin","useful":2,"cool":1},"HK0dNkm_RvQkqmeFU_uIyg":{"text":"I met some family for lunch at Compere Lapin, the restaurant inside Old No. 77 Hotel. The ","useful":0,"cool":0},"VFdVWCalSCEhnhMEV2RCUQ":{"text":"Finally made it to Chef Nina Compton's (of Top Chef New Orleans fame) new restaurant. It's","useful":3,"cool":3},"7D0fZ0hiN7lmlOW2uv9ROg":{"text":"Without question, our favorite newer place visited on this trip to New Orleans. This wasn'","useful":1,"cool":0},"pmgzFoty3WHFD4ZqrNRYAA":{"text":"I think Alex described this place best by calling it a \"gem.\" Went here last night for din","useful":1,"cool":0},"ESlc9ApB-hPNz_YHCkcwKQ":{"text":"This place came highly recommended and is always full so we were able to come early and ge","useful":0,"cool":0},"ByOO0jiMMlug95CysiW1PA":{"text":"Excellent service, delectable menu selections, charming atmosphere, and superb cocktails! ","useful":0,"cool":0},"JRrFgVXSupmEL_GcNItcnA":{"text":"Had a great meal. The service was attentive. Sometimes maybe a little too much hovering I ","useful":1,"cool":0},"1D8y9RwfqapHy4mTCD9EFQ":{"text":"I really do not get the hype of this place.  I found the food pretty unremarkable overall.","useful":0,"cool":0},"6oJz8lWJeCypAGQZ9xxELQ":{"text":"I was invited to dinner with friends to try this new \"hot\" spot in New Orleans, lured by t","useful":0,"cool":0},"CkSVoVAGSfdb5uQa6wBNlA":{"text":"Less than food and service. We ordered the broiled shrimp, brussel sprouts and the seafood","useful":0,"cool":0},"9wyLQa6VdXKBwPjDjUbYJA":{"text":"First of all, sit at the bar and have a Copper Bunny.  The bartenders are great (full of s","useful":1,"cool":1},"GLNtSrJ2KTnwodeiFxp7lg":{"text":"Curried goat is just incredible. It's been a few months since I've been here, but this mea","useful":0,"cool":0},"RVtJFPAktB-jd-UJ56vgzA":{"text":"Staff is lazy and only working toward shutting down for the evening. Even as a guest in th","useful":1,"cool":1},"kPfcDV05hjfwFpKvSW3vDA":{"text":"Curried goat and drum were amazing! Delicious biscuits, and the best steak tartare ever! O","useful":0,"cool":0},"0wECu1PlRs5pIWMWiERyhA":{"text":"#NinaCompton is the new queen of New Orleans cuisine. Depth, breadth, zing, pow, bam and a","useful":0,"cool":0},"M3hyHVt_heFz6t0FkFZaDw":{"text":"Great. Birthday dinner introduced me to goat and truffles in one night.  Ridiculous. Also ","useful":1,"cool":1},"szJxNGTY1Z-c7VfVYXMgCg":{"text":"Ich war am 29:11:2016 mit meinem Mann und wir haben super Feind gegessen, kleine Portionen","useful":0,"cool":0},"xz_TLgxdbKfHTc5pwSXsRw":{"text":"Compere Lapin had 5 stars for its antiquated/restoration hardware-esque decor, and the eas","useful":3,"cool":1},"x0Ee_jAs1ZSHFs3whAH7TA":{"text":"Acckk!! What happened to this place. Did we catch them on a bad night? Went back on 8/11/1","useful":0,"cool":0},"I5eKf_dTtFmLA1Y0lR5Zgw":{"text":"Love everything we had. \nIce cream sugar cane was the bomb!!!\nBanana Nutella dessert also ","useful":0,"cool":0},"7Ou_79mbOQe9kWBuGd6GnQ":{"text":"Best Conch Fritters and Curry Goat I have ever had. Second picture is the scialatielli wit","useful":0,"cool":0},"W_TALPIVyyN6q5nhLLL2vw":{"text":"This was hands down the best meal my husband and I have ever eaten.\n\nWe planned our trip t","useful":0,"cool":0},"iCIzYtNFAiyaIuVviD82MA":{"text":"Walked in without a reservation 10 min before their posted closing time of 10 PM, and was ","useful":0,"cool":0},"XhSpJaR-a4VgBp_NXH0tIQ":{"text":"Ahhh!! Such a great night here. The restaurant is in a hotel, which usually doesn't do it ","useful":0,"cool":0},"_kID2B3pC6LAjaxsEPbQgQ":{"text":"Had dinner here on Christmas Day with the pre fixe menu. Since we were without a reservati","useful":0,"cool":0},"pFkVqb6VAteDZboXjsCJIA":{"text":"You don't need a long review.  All you need to know is every dish was buried in full cilan","useful":3,"cool":0},"55zYhmEDShTnWsGaH1emKw":{"text":"If you're looking for your next date spot, friends in town nice dinner, or genuine culinar","useful":1,"cool":0},"AKHLYlIAzFFrTHXtw5gPVQ":{"text":"Awesome new restaurant!\n\nMy next-door neighbors (hi Chad and Mary!) both work at CL -- one","useful":18,"cool":17},"Li5omIGwxherhRP-fM_YFw":{"text":"Amazing cocktails and happy hour deals. Very swanky and chic atmosphere with awesome barte","useful":1,"cool":0},"16g6iKOrUSP5CVxQyBgiNg":{"text":"The brunch was outstanding! Thighs recommend the small plate CL tartar on a bagel and the ","useful":0,"cool":0},"R-AO19I-Dq2ZkxxInnMLTw":{"text":"Cocktails, curried goat and beef duo were fantastic. Oysters were imported (which is fine ","useful":0,"cool":0},"Mu8T6J_ZGBLUhpEyLTLYag":{"text":"Upon entering Compere Lapin, I immediately loved it's urban/rustic feel with the exposed b","useful":6,"cool":3},"g6hmgJa7cm8bVyGrMeuDPA":{"text":"1/2 Chicken but the name does not do it justice - dark meat leg with crispy skin while the","useful":2,"cool":0},"dYPSzzEdQGn0xYoX86pBrw":{"text":"Wish they had half stars, this would be a 3 and 1/2. So I rounded up. Had a very sweet wai","useful":1,"cool":0},"GbArPpo6363NyH-uTxlLYQ":{"text":"To think we almost left town without eating here. What a flavor experience from the cornme","useful":0,"cool":0},"roK_jNdv4VxMEAbEJgnwtw":{"text":"A wonderful dinner.  Really nice space.  Excellent food and good wine. \n\nEverything here w","useful":0,"cool":0},"7WkDPhCBmgGqfUqDfdrVdw":{"text":"Coming for Sunday brunch, I tried the goat bolognese with cavatelli & ricotta. This was a ","useful":0,"cool":0},"Buewue6xbAO8wGsW7o8cMw":{"text":"My favorite meal of all in NOLA. Better than the recommendations we had received for Cocho","useful":1,"cool":0},"m45dq-DTlznaf8Tzb9NBXw":{"text":"Place is straight ridiculous. The food was excellent and they should be charging more. The","useful":0,"cool":0},"0Xw2he4435lgTZkeju70LA":{"text":"Amazing food and atmosphere. Be sure you make a reservation. My wife and I tried to make o","useful":0,"cool":0},"ddGHDK24GwAiLK8bTjlenQ":{"text":"Absolutely beautiful restaurant! We were somewhat turned off at first - we were staying at","useful":0,"cool":0},"Dt_vKZALR8EcLWqwBoI6-Q":{"text":"Not as good as I thought it would be....disappointed at menu. Service was just okay.","useful":0,"cool":0},"7VpVW3Rgl0Lz-z__VNdfZg":{"text":"Beautiful experience from start to finish. Service was excellent. We were greeted by one o","useful":1,"cool":1},"SKhhiJn8A0pfzh2iK9t-wA":{"text":"We went to Compere Lapin after reading a very promising article about their boutique fresh","useful":0,"cool":0},"hTJWBPEivYGV4nhM_6JDIw":{"text":"I stayed at the Old 77 Hotel with some friends recently and we were delighted to find the ","useful":1,"cool":0},"63z7xsTavr80A4PlFiSA3Q":{"text":"Had an amazing experience for dinner. The service and food was on par with some of the bes","useful":0,"cool":0},"pGJ3VIVR1ZcUv53pBOul_Q":{"text":"Such an awesome experience at Compère Lapin!  Denzel is THE BEST and made us the most perf","useful":0,"cool":0},"L5liAov_A0KFhJNu64nCZw":{"text":"From the ambience, to the impeccable service, and to of course the flavorful meal - this s","useful":1,"cool":0},"JfLXJEJgOeqmZZVxwTQnYg":{"text":"This was the first restaurant we went to here that we weren't amazed by. Got sat at the ba","useful":0,"cool":0},"PvC8-OQpgPzRFmzSIOU4ng":{"text":"Them Alabama oysters were heaven! We devoured 2 dozen in less than 30 minutes I think..I w","useful":0,"cool":0},"VGPOukYtso28rWClBLsPqQ":{"text":"Excellent food. The curry goat is amazing. Also get the smoked tuna tartare. Such great fl","useful":0,"cool":0},"a-nYupzvbtnCBCPeFcbKdg":{"text":"Food was good service was not very attentive at all. Regularly had to ask for my server fr","useful":1,"cool":1},"1PNsfSB4M6ftkNx85bkhuw":{"text":"Best food ever. We literally ate everything on the menu and everything was amazing. The go","useful":1,"cool":1},"kSfNisM-ogTz5hP-H8-7dg":{"text":"The oysters were listed as \"MP\" for a dozen.  Having just eaten at another top restaurant ","useful":1,"cool":0},"xvbwGSjsO_jrbIWXWSiSrg":{"text":"Totally didn't realize that Top Chef alumnus Nina Compton opened her restaurant recently, ","useful":5,"cool":2},"R5qw4ZHcfq2ygUJrTkWnhA":{"text":"Ok, maybe we just don't get it.  We ate here last week and the setting and the service wer","useful":0,"cool":1},"rWAWZd8tO81LLzLB5WkkwQ":{"text":"Dreaming of this food...\n\nAfter endlessly researching places to eat, somehow this place is","useful":1,"cool":1},"iKqTshfxtrRx8eaP01t2Ug":{"text":"The ricotta pancakes here are incredibe.  You are gonna spend alttle more than usual for s","useful":2,"cool":2},"7_cw-AjVtx7PibMn7Q6F7Q":{"text":"Drinks were creative and served with a smile by strapping young bucks behind the bar.\n\nDin","useful":6,"cool":3},"XL0vM7n1jj1ha3ghN3pkUg":{"text":"I went today for lunch and this place is absolutely amazing. We started off with the Heirl","useful":3,"cool":1},"LHODQb2s6RxpLQ7yzZ6XwA":{"text":"Wonderful food here with attentive staff. Menu is ambitious but they really met the challe","useful":0,"cool":0},"s2EuqphxRNo8J5EPPn0nVw":{"text":"Great place for small plates and sophisticated cocktails. The entire team puts their heart","useful":0,"cool":0},"_3GRf3cLrXbYxJ2z-1-YIQ":{"text":"Great food and drinks. I thought the caribbean/Italian flavors were a nice change from the","useful":0,"cool":0},"KvrLPsz_xUHC7-2_BAi3uw":{"text":"This was a divine experience not only for the food but the company as well - the person I ","useful":0,"cool":0},"eLN-r0Yq4YYKC4s3moQAIQ":{"text":"Really cozy place. Staff was amazing and incredibly helpful and attentive. Food was a mix ","useful":0,"cool":0},"WSRqorJd-SifkikBVz-xsA":{"text":"Great place! We watched the Mardi Gras parade from the window. Steak tartare, roasted pota","useful":0,"cool":0},"NcsmQ24Q7eIn5V46RuZtRw":{"text":"I've enjoyed a cocktail here previously, but today was my first time in for brunch. My com","useful":0,"cool":1},"VuKw2q5at5_CflU5pVNYNQ":{"text":"I love this place. First time here. We are at the bar and had great service from all the b","useful":1,"cool":0},"4FaVraZQihSbX70Iy2M9DQ":{"text":"My heavens what a treat. The brunch is at once funky and yummy. The runny and sunny eggs o","useful":1,"cool":0},"gl02jtiiX1ruIUR3PTe6ew":{"text":"First time visiting New Orleans and it's the first bar that I just walked up to the bar an","useful":1,"cool":1},"2s_7UYw1xRYQO5Ds_9lzkA":{"text":"BLUF:  This very well be my new favorite place in NOLA.  Everything was interesting and am","useful":1,"cool":1},"LOQ7THuF91nJe8aL6r6xPQ":{"text":"Wow. Food was delicious, drinks were thoughtfully crafted. Pricing is on the higher end bu","useful":0,"cool":0},"HtSlDPG9SmUjCQvbNyCoyA":{"text":"I had such high hopes, but was kind of disappointed. The vibe looked really promising as w","useful":0,"cool":0},"vrwkCgkFdo6YXUBx2Wh0Cw":{"text":"Came for brunch. Got the prefix; great portion great taste and great service! Love the chi","useful":0,"cool":0},"ia7Cq8o0eNgn_JtuuJ97Jg":{"text":"Excellent food, a blend of creole and Caribbean cuisine. The food is flavorful and satisfy","useful":0,"cool":2},"p0OUANCOVpm45F8W65RdpA":{"text":"Always a favorite when I travel to NOLA.  The craft cocktails are well thought out, and th","useful":0,"cool":0},"-67m7muUBpIK8Yc9TUYoSg":{"text":"This place is my favorite restaurant in New Orleans so far. Big claim but this place backs","useful":0,"cool":0},"hFZaSuaSuXM8fiq4TkcU9Q":{"text":"Just stopped in for drinks and an app before heading to dinner at Meril's.  Wine by the gl","useful":0,"cool":0},"t9W9xtcYngrlJgapaskHkw":{"text":"Have been wanting to try Compere Lapin for awhile - and so happy I finally did. Everything","useful":0,"cool":0},"_Q_CPhydjcqibNCidcmhBA":{"text":"Food, service, drinks, atmosphere.  All amazing! Chef Nina's food is out of this world. Ca","useful":0,"cool":0},"ZyJ15z8zT81XRC9yBoJXBA":{"text":"This is my go to place for a special treat dinner! I love the atmosphere and the service i","useful":0,"cool":0},"H88rfdf9XxeuvgIzmxXK6w":{"text":"5 days in New Orleans and we had to eat here twice. First of all I'm a big Top Chef fan. I","useful":3,"cool":0},"-YJRcFyePd4kGWZM5vzl7g":{"text":"The food and the beverages are great. The only reason I gave three stars was because we fo","useful":1,"cool":1},"9zbqEBRInXvvHa0J-WGBdw":{"text":"Service and ambiance were spot on--not overdone or stuffy, suited the mood. For out-of-tow","useful":0,"cool":0},"DkQVqqTpLfxCcERuFU6sRw":{"text":"The biscuits alone make this place my favorite. BACON BUTTER! Also, the cocktails are deli","useful":1,"cool":1},"JA_Wskt6NwaBdCLcBO6E5A":{"text":"I watched Nina Compton compete on Top Chef and was excited to try her restaurant. It excee","useful":0,"cool":0},"DWrzvL7N5UGmCQtEpYORng":{"text":"Terrible service. Had a 9 pm reservation. Got there at 9, was told that our table was bein","useful":0,"cool":0},"dfNEFaeYiKHrdyg4T6BHAw":{"text":"Where do I begin with this restaurant? The food is very good and the atmosphere is unique ","useful":1,"cool":1},"aI9nZBdRZAymKnMb76mo3g":{"text":"We loved our dinner here.  I had the curried goat and plantain gnocchi and it was great BU","useful":0,"cool":0},"JPs0jDMxPpWJp_oVYfx0LA":{"text":"When you're in New Orleans, you eat beignets. You just do! And if you're not, you're doing","useful":2,"cool":1},"ku2otQWbAyRzklQb5F1xhw":{"text":"I took my fiancé here for his birthday and I can't believe that we did not visit Compère L","useful":1,"cool":1},"7tpA1nOAq7XomZeECwpZYA":{"text":"For this visit I had the Hot Fire Chicken......DELICIOUS!\nThe house made pickles and mango","useful":3,"cool":3},"0PG_CQ5tEDZ1jU3ba1KtRA":{"text":"I had high hopes for this place but thought it was only so-so. The food was...too busy? I ","useful":0,"cool":0},"NDweymNfdcxVUlCNnAHH4A":{"text":"We visited New Orleans for the marathon this past weekend with the primary objective to se","useful":1,"cool":1},"tZrlO2p6Dty0XnmzQjcsCw":{"text":"Lots of hype for this restaurant - we went there with a group of 4 and were able to try a ","useful":0,"cool":0},"VLjOeyYDulcVwEIqYEQo3A":{"text":"Ate here for first time today. Only had one dish, the Butternut Squash Ravioli, but it was","useful":0,"cool":1},"dGcy45Q4rCe5sQbRWwfXkw":{"text":"I wish there were more stars that I could apply to this review! My friend and I went here ","useful":0,"cool":0},"aG24R7ePqQOXCsYQ8Otsig":{"text":"Delicious! Consistently impressed with the quality of food and service.  Curried goat awes","useful":1,"cool":0},"iv_bPu4nBW5uv9yFNC0FNw":{"text":"I came here last night for dinner with my boyfriend and another couple and we all agreed t","useful":0,"cool":0},"CWqxWdUcU57Q0J4D3dMDgQ":{"text":"OK, I know I was supposed to love this place. It's one of the current darlings of the Nola","useful":1,"cool":0},"YCPsFY7wq0pj74yAUKTXrg":{"text":"Chicken & hash is awesome... Original and very flavorful. Chai coconut pudding with fresh ","useful":0,"cool":0},"e_wRpKiG_mxAApZZpiEOmQ":{"text":"Exceptional! I had both vegan options, avocado toast and then chia seed pudding. Other mem","useful":0,"cool":0},"X1OSLgQRSdjJ0mlu7Xxh7w":{"text":"I travel a lot and enjoy fine dining. This place is in my top 3 in the country. It has all","useful":0,"cool":0},"oHvyEvFQbrnhVbQ-c0jMUg":{"text":"We came here for brunch on Sunday before heading out of NOLA. We were sat right away and e","useful":0,"cool":0},"-eXnfhJ8ll60i9FCl9C81A":{"text":"The food was outstanding!! However, the service was horrendous and the only reason why I'm","useful":1,"cool":0},"qehZEnXsE7ZzjfaxC1-feQ":{"text":"Food was delicious but definitely small portions making it overall an expensive meal - ove","useful":2,"cool":1},"uSU6DWdui84z35dRhZltWQ":{"text":"Tried this restaurant for the first time this weekend. Wow yummy!  The portions were on th","useful":0,"cool":0},"AOG2BBlBVPCP8vzliDmIQw":{"text":"Ate Christmas Day dinner here and found food and service to be top notch! No white tablecl","useful":0,"cool":0},"7KnTGf4IE7M-r4bX6zk_JQ":{"text":"Really cool spot in the old Ambassador hotel  (I'm sure it has been plenty of other hotels","useful":0,"cool":0},"wrvn1geWiPQ5pdgjJaxAig":{"text":"Accidentally realized this restaurant was in my hotel when I visited New Orleans. Great co","useful":2,"cool":1},"9zXWPk1upWbXoUBB3H8Mqw":{"text":"I returned back to compere lapin this past weekend and I must say that my experience was s","useful":2,"cool":0},"EdBFOMort-bz63e_PBFrAQ":{"text":"This was our second spot for dinner last night (limiter time in NOLA and so many good plac","useful":0,"cool":0},"oa61ITWMPXpP--Kww7ac7A":{"text":"I eat here 2 times (stayed in the dapper hotel as well). \nThe cocktails were EXCELLENT. Th","useful":0,"cool":0},"ir6TIAtcwTAroMe18AZ0kg":{"text":"The here food is amazing!  Unique dishes.  Very impressed.  \n\nOur waiter was not the great","useful":0,"cool":1},"52O-YJtZeE09y8sDWC6dcg":{"text":"One of the best brunches I've ever has and thats saying a lot. Incredible fusion of flavou","useful":0,"cool":0},"3_9T3ORcjhb7mwYPx9Ghgg":{"text":"Llegamos prácticamente por error al hotel donde está ubicado este restaurante, reservamos ","useful":0,"cool":0},"P14QDjatkuiYyZW3HxJTXA":{"text":"The zeppole!!!!! Heaven! Everything was good, and the service was top notch! There were a ","useful":0,"cool":0},"yWOFt1uKP-14hpDfkxCYbg":{"text":"Lovely meal at Compere Lapin. A special shout out to the server -a women of @ my age which","useful":1,"cool":1},"C_-04spiTAXdnj4XgejStw":{"text":"After reading great reviews, our actual experience was disappointing.  The cocktails and b","useful":2,"cool":0},"aFi_Dp3uojcFc2muG4pf_g":{"text":"Why the hell would a place accept a 10pm reservation on open table then tell us on arrival","useful":0,"cool":0},"vjVYu41UuKob81IAMmNu3Q":{"text":"This place is great! My brother in law turned us on to this bar and now we are not only re","useful":0,"cool":0},"CsxS_UOj7vVVVAocjh6n0g":{"text":"This was my least favorite place we visited for brunch. The service was not up to par. The","useful":0,"cool":0},"j_tp_OXsdY2KpMepC45ZVg":{"text":"This place is trying to do some ambitious food innovation things in a fun way, with a Cari","useful":0,"cool":0},"XUkf5dqtZxms6oi2spg0YA":{"text":"Positives:\n1. Intense flavors in many of the dishes most notable were: Tuna tartar with Ba","useful":0,"cool":0},"X_19_jUX0kLDk9IxGbX6bw":{"text":"Very good restaurant. I'd say the food was definitely better than average, and the waitsta","useful":0,"cool":0},"yMX0W0WJWgY-X0D43Mf02Q":{"text":"Food - good, but not great (3 stars).  The ceviche (Cobia/Passionfruit/Yucca) was fresh, b","useful":0,"cool":0},"4_KFZrt8hELhzlmbv7pqDA":{"text":"Became a huge fan of Nina Comptons while she competed on Top Chef and was excited to hear ","useful":0,"cool":0},"nwJEcPvZ5YGPB1VP98vliw":{"text":"Excellent dinner last night. Had the Louisville Slugger cocktail which was so good, I had ","useful":0,"cool":0},"cZlfmotXjZgKNmjsjIk8NQ":{"text":"Perhaps our visit was just an anomaly but...  Brunch was not impressive.  Bad service (we ","useful":1,"cool":0},"TysH2Z5FwDjB8Naxj9-YPQ":{"text":"Beyond incredible! We started with the pigs ears, roasted corn and dirty rice balls and th","useful":4,"cool":2},"n5wsgJqruN5jvMe6665Q5Q":{"text":"This was an awesome Birthday Dinner! Lindy was phenomenal, the Fried conch, Ravioli specia","useful":0,"cool":0},"F3QaplcLNgsM2nvjtKofkw":{"text":"Amazing space, great food. Came in for lunch, turned out it was brunch, I really enjoyed t","useful":1,"cool":1},"umYSwQFM0TKcBhgj-aqrdg":{"text":"Biscuit to start tasted like nothing. Pig ears tasted like BBQ Lays potato chips with onio","useful":1,"cool":0},"46i1sF1XiZxx1oIS7LLQ_Q":{"text":"The food is to die for, specifically the gnocchi, steak tartar, and the goat! Really, ever","useful":1,"cool":1},"P8YITe3CJ4VaF1RAmZf2iw":{"text":"We were in town for New YEARS and found this restaurant on Yelp due to good reviews. Defin","useful":0,"cool":0},"XOK3lMgMZTc7pDgzHZYSgw":{"text":"Came in for lunch on a Tuesday and were basically the only guests in the restaurant.  The ","useful":2,"cool":2},"BJbnJKsR0z1docYHOhx4ag":{"text":"Exceptional service and incredible food. Had a truly memorable meal here. Cocktails are to","useful":0,"cool":0},"0InmmWbzf1t6jXvLlZxmvQ":{"text":"I had the pleasure of dining with 6 friends on Monday night. The atmosphere of this restau","useful":1,"cool":1},"LM_qF6cMIUB_gHZRCqTFMw":{"text":"Superb Really enjoyed the crispy cauliflower, oysters, and gnocchi! And save room for dess","useful":0,"cool":0},"pQ4StX9CLvmj2MWueQig-w":{"text":"The restaurant had a great mix of interesting cocktails, appetizers, first and second cour","useful":3,"cool":2},"ZfuQBuRMrOgpwVS7N0aMFA":{"text":"What can you say here that has not been said?  Excellent service, trendy atmosphere and pu","useful":0,"cool":0},"d9ehGh8o2_nWJwg-Xs0J2w":{"text":"Our last day in NOLA and cruising around on bikes to check out some places that were \"on o","useful":0,"cool":0},"HeMQoRjYTQD_nHuE_gaiGw":{"text":"AMBIANCE/ENVIRONMENT: very nice contrast with red brick walls and wooden tables, polished.","useful":0,"cool":0},"lg-4dXkE26CQ2JoTvzAY7Q":{"text":"I've been to Compere Lapin twice in the last few weeks, the first experience was excellent","useful":0,"cool":1},"TrULDN5M2Tki3-mtrmd09A":{"text":"We stayed at the Old No. 77 where Compère Lapin is located for 4 days during JazzFest. We ","useful":0,"cool":0},"6GzlAD2uo7rLxKt23Np92g":{"text":"Lunch here in February ~ Can't wait to visit again. Everything was delicious. In one of th","useful":1,"cool":0},"7CdrL-S-b3Z41rFlxPgA2A":{"text":"Stopped in for a light lunch and a cocktail. I had the Red Witch cocktail. It was excellen","useful":0,"cool":0},"UnUe3q4tWGqiWRyupixjXw":{"text":"Great service and out of this world food. Creative menu options - being with a large group","useful":0,"cool":0},"rqL7KRWL-YfcgD_okshcnQ":{"text":"Disappointed.  Booked a month in advance.  Was looking forward to pepperpot and pork tende","useful":0,"cool":0},"FlpS0gRJiFdYnnykGygUJg":{"text":"Had dinner the other night.  The space was very nice and comfortable. The resteraunt has 2","useful":0,"cool":0},"fkGyrFKxPcuzDWBsY1S5Tg":{"text":"Went here on our last day for lunch and we ordered the burger. It came with fries or a sal","useful":2,"cool":1},"sOZt_V4dthWl3_Fs3sKZhw":{"text":"The food was exquisite, the service was excellent, the wait staff was very attentive and e","useful":0,"cool":0},"-QcCihUIoJysRRAjNh9DNQ":{"text":"This food experience was very well accepted. Claire, our server was awesome and knew exact","useful":1,"cool":1},"ccR5QYF8gL_7SeNlU_P5Lw":{"text":"5 star food, 4 star service (only because the restaurant is insanely busy). If you can get","useful":1,"cool":0},"4-AmBbkldpHC7Q-WAm4BOQ":{"text":"Well...the hostess was great. We were early for our reservation but the place was empty so","useful":1,"cool":0},"yv1eh06CRrDMJgk830r_rA":{"text":"Our dining experience at Compere Lapin was one of the worst I've had. Was the food good? Y","useful":1,"cool":0},"chnjcAj--nF6niJwU3aXEA":{"text":"A great Bloody Mary is indeed a wonderful thing. Asked for it to be spiced up and it was m","useful":0,"cool":0},"TjUSEjhuSElOic9x_SG1rg":{"text":"Table Service time was slow. Biscuits were amazing we ate another basket! with two kinds o","useful":0,"cool":0},"HdcPjN5hE-rEqwkg9fJIhA":{"text":"This place has unique amazing food and I always recommend it to anyone visiting. The goat ","useful":0,"cool":0},"5s1B_QxMt7hjSV7M9mjuQQ":{"text":"Amazing culinary experience- delicious, creative, different. One of the best meals we have","useful":0,"cool":0},"_AAHIE7DtQSATQPpoAYANw":{"text":"This restaurant is the bomb.com \nWe loved everything! You had me at biscuits. Oh, and did ","useful":1,"cool":0},"Pj9Kl7LY1SEwUtRLxobzpg":{"text":"One of the best meals I've had in New Orleans. Everything was cooked perfectly and tasted ","useful":0,"cool":0},"QLMz_88BO0i1t9fTEm01zA":{"text":"I had high hopes for this restaurant. Trying new foods is one of my peraonal joys.  The se","useful":0,"cool":0},"inKIj8q8JHoSWkTB7G7kyQ":{"text":"I had an amazing meal here a couple nights ago. I was going to write a review of it, but m","useful":2,"cool":1},"CMAmkggsQOUD6xBzxKB04A":{"text":"I came here to celebrate my anniversary with my boyfriend after my sister, a frequent NOLA","useful":2,"cool":0},"MGNpbCX_k1iQ1wvRSrFrZg":{"text":"A rustic yet romantic restaurant with exposed brick, tile floors and dark wood tables & lo","useful":0,"cool":0},"WH0S0yefXM38oEseYNBkQw":{"text":"I am a big fan of the chef and had high expectations. It was a mixed bag, but the service ","useful":0,"cool":0},"lIYM-HIAJSnSvNbx_wQkzA":{"text":"Compere Lapin is such a beautiful restaurant in its menu, drinks, service and food. Here i","useful":0,"cool":1},"ATxlcyxG5RI0inw5CZaN_Q":{"text":"Very yummy, a bit loud, and not the best service, but overall worth the visit! The duo of ","useful":1,"cool":0},"ecajzTNotgeAGxD5CO_rvA":{"text":"Overwrought and overpriced.\n\nThe food here was decently presented and not flavorless, but ","useful":2,"cool":0},"UKQRMmuiJZbRw8F0uLR4Kg":{"text":"Just so pleased with the whole evening! Our food was outstanding! We shared around the tab","useful":0,"cool":0},"Cy3MMA9Oe15nZNjb3VQOLA":{"text":"I find it hard to review New Orleans restaurants. The expectations are so high and the opt","useful":1,"cool":1},"c6zqgaZfws5zBCEFYhzFYA":{"text":"I was blown away by this place. The dress code was a bit more upscale than casual but noth","useful":0,"cool":0},"cWyPHTY5lFc8fT_TirZ8-A":{"text":"We stayed at the Old No. 77 Hotel (where this restaurant is located) for four nights and h","useful":2,"cool":1},"f-LLosBtjt79l9lhtKuQOg":{"text":"I really loved this find for lunch on our last day.  Hidden away in the No 77 Hotel, the l","useful":0,"cool":0},"B3tlVq55gHDv5zWdpObWxQ":{"text":"My husband was so excited about visiting. He is originally from St. Lucia and was thrilled","useful":0,"cool":0},"2FEBCMIw_uOkc-4ifJuH_A":{"text":"Staying at the hotel, I expected far better service from the bar. My husband and I were ig","useful":0,"cool":0},"ofBkju2IHul5iwBLbvyE-w":{"text":"Fabulous -- food, ambience, service -- felt like a queen for a day!","useful":0,"cool":0},"16Y-0sMZv38Tuw9eZAT2Tw":{"text":"I don't know where I should start. I came here a couple days prior with some coworkers so ","useful":0,"cool":0},"vAPmO5zcTNuo7gjjK33qSg":{"text":"Went on a special dinner night with Community Coffee as part of the WYES series. 3.5 overa","useful":1,"cool":2},"27DKyGViCr3xfe1YIba_tg":{"text":"I cannot thank the staff enough for our experience here. The food was amazing and the staf","useful":0,"cool":0},"CD4YQUQDetp8A8c8KamQcQ":{"text":"Service and atmosphere is wonderful! The host and hostess are masters at greeting and invi","useful":0,"cool":0},"LHrRVW2Hvfyp5QtCb945Dw":{"text":"The craft cocktails are beyond compare. The Happy hour  crudites are worth the trip. The a","useful":0,"cool":0},"udRKkI8YR5s-zwOqtMmA-A":{"text":"Brunch at Compère Lapin is a celebration of everything good and true, filled with the righ","useful":0,"cool":0},"zpt7QirsQj0ABixCDxu0og":{"text":"Love the industrial vibe and decor. But the food wasn't worth it to me. It took a very lon","useful":0,"cool":0},"CxKy_n81IEMNExxscYqQUQ":{"text":"Stepped out to celebrate our one month wedding anniversary and it did not disappoint! We m","useful":2,"cool":0},"Wlw98vXIVKWPyqqqmBt0QQ":{"text":"Top Chef finalist Nina Compton is the chef of this new resto and the reason why we tried i","useful":5,"cool":3},"hLIcoctrx6KuM2D1J_kevA":{"text":"This place has a great vibe, trendy decor. The dirty rice Aricini balls were packed with f","useful":0,"cool":0},"-I1rLCnMIQvEoELIL2XdWQ":{"text":"The food was flavorful. Unfortunately, the curried goat was less tender than promised. I h","useful":0,"cool":0},"IwU40fxX8IRLRhNgzGGicw":{"text":"If I could give this restaurant more stars I would. It was amazing. Our server Lyndie was ","useful":0,"cool":0},"LKQj0aXLg85fd3Q6eYa2Tg":{"text":"Loved! SERVICE was great and food was delicious.. my favorite was a shrimp and jalapeño di","useful":1,"cool":0},"5CBEeYH8989JM5VlwogVRg":{"text":"My wife and I actually found out after booking our honeymoon room at The Old 77 that the i","useful":0,"cool":0},"bkImhOXhhkGJwE4KWQkShg":{"text":"Amazing food in a great atmosphere.  We fell in love with our server Nicole at first sight","useful":1,"cool":1},"-UVcZnBcXAPTeXv_O7AmhA":{"text":"I want to go back for their shrimp appetizer!!! The best shrimp dish I've ever had. Full o","useful":0,"cool":0},"lIus1TD1I3uPE_S3Fl-VWg":{"text":"Had the red beans and eggs.  Was really good.  The burger is good.  Had the bagel,  very n","useful":0,"cool":0},"tbzZ7vQ7UN8f94m7ob-hNA":{"text":"Such a great spot!  The host Jeremy and hostess Queen were so friendly and the bartender h","useful":0,"cool":0},"iy8_5eUFDgdquo6_3Z-HJg":{"text":"First things first. Happy Hour is 3p-6p Mon-Fri #YoureWelcome\n\nFabs and I came here to thi","useful":4,"cool":1},"iplIsTPMkTiAKumOzlu0BQ":{"text":"We went here for lunch with a group of 6 of us, on our way to the airport. We let them kno","useful":1,"cool":0},"BHUNTexeFZjENS2meGVGKA":{"text":"My girlfriend and I were completely blown away with the exceptional food and service! Be s","useful":0,"cool":0},"BareRdw0IPb-ZIUfiZbvYw":{"text":"We visited in late December. \n\nGreat food (goat curry and pepper pot, especially) and serv","useful":0,"cool":0},"kDO138vPRoK-q-KGGtI4dw":{"text":"Having visited New Orleans for more than 30'years, I have eaten in the city's best.  The f","useful":0,"cool":0},"2ZQe3DaR_oeNbANOun-uOg":{"text":"I absolutely LOVE this place!!!! Came here for brunch with my husband while we were visiti","useful":0,"cool":0},"8ngt3PWZSiZwW-86l3hb-w":{"text":"Found on the lobby floor of the Old 77 Hotel (really cool boutique hotel). Cool atmosphere","useful":0,"cool":0},"OD4C_oggmKeNH3Tjm3Qa7g":{"text":"My meal here was good, but not great. I kept feeling like I was missing something integral","useful":2,"cool":0},"UZkORpU92ejBd2Fs3p3-JQ":{"text":"Kate (hostess, would not give full name) was incredibly rude from the moment we walked in.","useful":3,"cool":1},"T_8Jq2kJr_GNF9VfrJkm8g":{"text":"The food is so delicious but the service is terrible.  We never received one of our entree","useful":0,"cool":0},"QrsM65emsUj6hgWjONxlLA":{"text":"Great cocktail creations, excellent small and larger plates, great vibe, service and a raw","useful":0,"cool":0},"58eQagYMbOwUJ4zr6GIdjA":{"text":"If you're not coming here for a nice date dinner, you are absolutely missing out. Wonderfu","useful":1,"cool":1},"PwG9SAlkGfUY0UZ29RXh0Q":{"text":"The new restaurants in Nola that I've been going to lately have all been five star in my o","useful":2,"cool":1},"pF5UoJSZM-weu_ppzhhvKg":{"text":"Wish I had taken pictures but I was too busy shoveling the delicious food in my mouth. Eve","useful":0,"cool":0},"K107r2tDcqTgn5H-M0_wVA":{"text":"Awesome food in the middle of New Orleans. I was staying at the hotel here, the old 77, so","useful":0,"cool":0},"_6x8-30luAb4foJOACIFsQ":{"text":"The best dinner I've had in New Orleans. \n\nService was wonderful-- although a teeny slow a","useful":1,"cool":1},"rWLUcp6Tf5wmXJhGsXc06A":{"text":"Book a table and go!  This place was a lucky find (a friend heard some buzz about it and s","useful":3,"cool":3},"ENszOCjXXmTfebeM74AFpQ":{"text":"Great thanksgiving dinner.   Great service, great atmosphere, great cocktails.  I can't wa","useful":0,"cool":0},"HxYMjisQnaACivRBM_QDaQ":{"text":"This restaurant has the best food ever! The flavors come together so well; each serving is","useful":0,"cool":0},"2cklTXZR8DddUj0gyZbkwA":{"text":"American bars have been co-opted by themselves. They take their iconoclasm too seriously. ","useful":0,"cool":0},"7EMFr0wK1Mx7BBFSjecVNQ":{"text":"The bar was set high for Compere Lapin b/c we ate at Sac A Lait the night before. Compere ","useful":0,"cool":0},"kGRN7L_PbuSAhQpvRmr09A":{"text":"This place is like a culinary experience. So much flavor! Everything from the biscuits to ","useful":0,"cool":0},"QYSSzQTKBs0wRP6S36koIw":{"text":"Great food. Staff was lacking something...I can't be sure since almost all of NOLA is so l","useful":0,"cool":0},"XdYZ7uvPiaxx1fPOIdAYKQ":{"text":"This restaurant is quaint.  The menu is exceptional.  The wait staff gave us a lot of posi","useful":0,"cool":0},"RpvZX0IZh5BP7x3oSmv41g":{"text":"I may be totally out of line for reviewing their breakfast here but it's definitely worth ","useful":2,"cool":0},"KcSA7DP9a3sUHekf3diaEA":{"text":"When we first arrived we were slightly thrown off on the check in experience but once seat","useful":0,"cool":0},"hdInp1c8kGPIpk6ep2fs5Q":{"text":"Awesome, taste inspiring.... great food, great cocktails!!!  Shared lots of choices..... m","useful":0,"cool":0},"F7kC24zuVknVVEIjueXDgg":{"text":"Only decent meal in New Orleans. It was seriously excellent. Thank goodness a friend recom","useful":0,"cool":0},"4Bb67lBY_BwwgqhjvAwimg":{"text":"I sometimes feel like I give too many 5 star ratings. If I could I would give Compère Lapi","useful":13,"cool":9},"7A4eOWHhDlS_ExlqSEOgYA":{"text":"Went here for brunch. Food was amazing. Check out the pictures. Everything was delicious. ","useful":0,"cool":0},"dqboWPeFE4jkiiG_lqXgKw":{"text":"The food was delicious.  I sat at the bar and the wait staff was very attentive.  They mad","useful":0,"cool":0},"MCbM2d1EvGmhSk9x7wP-xA":{"text":"Sometimes the menu at Compère Lapin is too meat heavy, but I ended up going when there wer","useful":0,"cool":1},"wMDk4qcKIm_6pfSGlOplCQ":{"text":"As far as hospitality, these people \"get it\" & that's why I'm giving it 5 stars. The chef'","useful":1,"cool":0},"geDfPRho9KZt5MYtqS4_tw":{"text":"I wanted to love this place but I left feeling underwhelmed. It's a lil ways off from the ","useful":0,"cool":0},"eRWkG4VLaNgrh2f-6Lp7gw":{"text":"In NOLA for 3 nights. Had 3 GREAT dinners on this trip. But this dinner was THE BEST of th","useful":0,"cool":0},"y2hsOEPPSKIMF9D973i0VQ":{"text":"Absolutely delicious. The subtle layers of flavor, creative cocktails,  and amazing front ","useful":0,"cool":0},"CmROdvbljud1it9TgLH5Ag":{"text":"Omg why do the make the food so salty in this place?\n\nService is great ( positive kids wit","useful":0,"cool":0},"HI_j48mC1Un-A4OqtZ0Xsw":{"text":"Arrived early for 9PM reservations on Saturday night. Was seated at 8:45 and promptly got ","useful":0,"cool":0},"JQ_n-CfTk8nS4OT-eowwdw":{"text":"Compere Lapin exceed my expectations...and they were already pretty high! \nWe went on a Th","useful":1,"cool":0},"p9526sfr73pAUIxIj9ufDg":{"text":"Finally got to go here 2 weeks ago on a Thursday and it was awesome!!  Definitely lived up","useful":2,"cool":2},"ZaFG_fmpJVGL8iHiidh9fQ":{"text":"Outstanding food. We shared a few dishes and every one was amazing.  Marinated shrimp with","useful":0,"cool":0},"aq-694MhV8C1f1Cr7wKDsA":{"text":"The biscuits are to die for! Probably some of the best I've had. We had seconds and I want","useful":0,"cool":0},"kmBIXwgNpDuXafyJCFtP4A":{"text":"I started the evening with the worlds best bartender, Joshua, who makes cocktails with ski","useful":0,"cool":0},"F4OzNJ3kh-1nxrLyR_fz5A":{"text":"Every time I go to New Orleans, I come back with a new favorite restaurant. Compere Lapin ","useful":4,"cool":3},"sYR6m5I1L4olQbDXOYZvaQ":{"text":"Killer old fashioned made with rye whisky. Also a great Martini made by the bartender duri","useful":0,"cool":0},"nJQ5BzTfx1jbfNtqZ5bWkg":{"text":"The food was excellent, however our server \nNina was not! From the beginning we received v","useful":2,"cool":1},"zo2lqiSbS56YV4J4BMVc-A":{"text":"Excellent restaurant! Food was amazing... If you can.... please order the conch crouquette","useful":0,"cool":1},"6HQMXYJN6h8Idx189tbWlw":{"text":"Came here with a friend to grab some drinks and small bites at the bar. The bartenders wer","useful":2,"cool":3},"bqE6N_Ba_kGpcL95185I8w":{"text":"This was hands down the highlight of my recent trip to NOLA. I've read on, and know of the","useful":3,"cool":2},"zcx8KnWQGaSUVsrkvZqrrA":{"text":"From the bread service through to the soursop semifreddo, everything was wonderful. Highly","useful":0,"cool":0},"-OtBOQGxxl3yXl5clbfHZw":{"text":"Returned to town for Tales of the Cocktail and once again this place rose to the top. This","useful":0,"cool":0},"dZyKoTebJYGMKn3zrdetgQ":{"text":"We just spent a week in New Orleans and did our best to try as many of the great restauran","useful":0,"cool":1},"_m0J0KsG5Cp51j5thtXaFQ":{"text":"I was pleasantly surprised by this smartly decorated bistro just off the lobby of our New ","useful":1,"cool":0},"YcQzKTgreN83VAim68upNQ":{"text":"An exemplar of friendly, skillful service with a complex and satisfying menu. We had great","useful":0,"cool":0},"Je0Pihqhc2dYVz9aJ73XYQ":{"text":"I was very disappointed by this meal. I first of all do not like writing bad reviews but t","useful":0,"cool":0},"jsS1lz73ToYQlyiPbVOHYA":{"text":"We were getting ready to leave Nola having had a terrific 21st birthday for my beautiful n","useful":0,"cool":0},"PtwWHg0EdVlDmWcOIAdBTQ":{"text":"One of my favorite meals in New Orleans so far!\n\nHere's what we had:\n\nBraised Shrimp/Calab","useful":2,"cool":1},"7lO2CZv-fHzuSwaaRppurA":{"text":"So where to start.... My group of 7 had a reservation for 10pm. We showed up at 9:45 and w","useful":1,"cool":1},"U_zD7H8P_igQVHuevCrxAw":{"text":"This was my favorite place on this trip. I've gone before a long time ago for an app, but ","useful":1,"cool":0},"NCpf6hjkuTSc6tVB-1O-lQ":{"text":"Small Bites\nSpiced Pig Ears/Smoked Aioli\n\nCrispy Dirty Rice Arancini/Sour Orange Mojo\n\n\nFi","useful":2,"cool":0},"4ue_cGUdA-Z4FMM7Qz2VNQ":{"text":"Food was good but honestly thought our server, Amber was horrible. Amazing how a server ca","useful":0,"cool":1},"lNFG_GhRBiJgF-8Qi8jCRg":{"text":"Service, atmosphere, drinks and bread service were perfect!  \nUnfortunately, we may have e","useful":1,"cool":1},"vmunWmhg6StAbD8NGLwZ4A":{"text":"This place ended up being the highlight of the trip recently. And it wasn't even on the lo","useful":0,"cool":0},"pYguwfcpbWBdTpChNhBSyw":{"text":"Loved the ambiance and staff. Started with a delicious Bloody Mary and the most delicious ","useful":1,"cool":0},"5YU-L3cfS0keo1l9aYcUqA":{"text":"For real. You should go. I have been twice.  Never disappointed. Fish always perfectly coo","useful":0,"cool":0},"94POTqWfdZjOPRY4Ic5UZA":{"text":"We were lucky enough to have this restaurant in the lobby of our hotel.\nThe layout is very","useful":0,"cool":1},"uYjiZG_DdmBK-6YecRPptg":{"text":"I am so glad I found this place on Eater New Orleans. Definitely worth a visit if you are ","useful":3,"cool":0},"72oME3xJ7tsp6EP939TM7A":{"text":"As promised, I gave this place 6+ months & came back.\nThe atmosphere & location of this pl","useful":2,"cool":2},"qlHLuS2JsVbCj74_e3e0kQ":{"text":"Best craft cocktail bar in NOLA!  Their Old Fashioned is a thing of beauty. The bartenders","useful":0,"cool":0},"z2UqFcZTj7Ls_9TEhYjDCQ":{"text":"I made a promise to myself to make it to Compère Lapin before this month was over and I di","useful":4,"cool":4},"wS7eDBI_Yl1dI3bkzdpXAg":{"text":"Came here one morning during Mardi Gras. Reserved a table for two for 11am and it was pret","useful":1,"cool":0},"r8asYZ1rvKUQAJmKPvIiwA":{"text":"Bravo Nina!  \n\nThis is my 3rd trip to \"Compare Lapin\",  celebrity chef Nina Compton's soph","useful":4,"cool":2},"vNenFNOcnIsobPA8bGeNxw":{"text":"Wonderful restaurant, the rustic decor gave it a warm feeling, the food was amazing. From ","useful":2,"cool":1},"vQS77XwxnL1uXcdr0-ejlg":{"text":"Excellent!!! Atmosphere, service, food, drinks....all amazing! vera is an amazing table ho","useful":0,"cool":0},"18b2nwez7q5ZlXT4LZbbvg":{"text":"Unfortunately one of the worst experiences recently....and on a Tuesday night!\n\nOur waitre","useful":3,"cool":0},"KRaD-sAv9x07GZPbWY5gzA":{"text":"We came and ate here on a cold, rainy night. We had reservations, so we were seated immedi","useful":13,"cool":11},"zhDRkwoIoemxtCj4GClZHA":{"text":"I was very excited to try Compere Lapin, as I had watched the season of top chef with Nina","useful":1,"cool":0},"udZvQtUOOua-WhxQes60qg":{"text":"As everyone else mentions the complimentary biscuits that come with your meal are outstand","useful":0,"cool":0},"0C0Im0sxCHMYDuQKSqKrLg":{"text":"Chef tries way to hard to make the menu 'unique' when this cuisine is meant to be simple a","useful":0,"cool":0},"iVvbhCMnQK82x-h7mvAEHQ":{"text":"Kate (hostess, would not give full name) was incredibly rude from the moment we walked in.","useful":1,"cool":0},"39DvdykfMvZSjJISGLIlVw":{"text":"I don't normally review but I feel compelled to do so.  Outrageously good food unique from","useful":0,"cool":0},"A-MDq9ZTEa6RXOLnsuqBGA":{"text":"Amazing! Delicious perfect meal. With the Introductuon of the biscuits,I knew it was going","useful":0,"cool":0},"-_Ks2oe9V5rLv7XxVlNHUQ":{"text":"Compère Lapin (kom-pare la-pan) n. 1. French for \"brother rabbit\" 2. traditional Caribbean","useful":0,"cool":2},"tJ5yQBb7jZfRdT9mt2AXpw":{"text":"If you want good food, this is a great choice. Probably one of the best pork loins I have ","useful":0,"cool":0},"qgTrihrKFCVPs5U2jkouRg":{"text":"This is one restaurant that isn't rated high falsely. This has been our favorite meal sinc","useful":0,"cool":0},"_km65MimqR96tyQWuBD3aw":{"text":"Compère Lapin in a word: Amazing!\n\nThree of us started the evening with adult beverages: a","useful":0,"cool":0},"eBpfqYOE2k8ZY_k849ylFw":{"text":"One of the best offerings NOLA has. Biscuits, pig ears, curry goat. You can't go wrong wit","useful":0,"cool":0},"zkGemdR8e4qztu6_Gpb8gA":{"text":"I had a great time here when I came for dinner. The lighting was very low and the decor wa","useful":1,"cool":0},"_hvb0_PLAOYiW9Mf3L2jlw":{"text":"Amazing biscuits and enjoyed a delicious goat curry gnocchi. Best meal in NOLA so far.","useful":0,"cool":0},"SAtCMzP_oxpDM_X9zFXytw":{"text":"Myself and girlfriend had an amazing dinner. \nCocktails and food are both well thought out","useful":0,"cool":0},"GWvpOVa3s2U-6jWmskf_4g":{"text":"If more than four people prefer the bottomless brunch, you get a PUNCH BOWL. And it was a ","useful":0,"cool":0},"HNA0KmPtO3LJCqvzL_BsBA":{"text":"I was visiting NO for a Tulane graduation and had brunch at Compère Lapin. The shrimp, pic","useful":0,"cool":0},"cFKpxaXtu2x0P10qu6ObrA":{"text":"This has to be one of the finest meals I've had in a long time and the service was excepti","useful":1,"cool":0},"u_sNqfcwQQ3-EEaE82IeRA":{"text":"This beautiful restaurant sums up to one word...AMAZING!! Chef Nina is phenomenal at what ","useful":0,"cool":0},"AZkQzp6CzoSjwb75kaSXAA":{"text":"This was probably my favorite New Orleans bar on my last visit. The bar staff were inventi","useful":0,"cool":0},"0-_Wk47Acjab_MS4aK1kfw":{"text":"Always one of my favorite NOLA spots for afternoon cocktails & nosh! Fabulously friendly s","useful":0,"cool":0},"9n8xvEPH31bpenXDfbvlzg":{"text":"Your boy was 7 for 7 on food spot choices on my extended weekend, initial visit to New Orl","useful":2,"cool":5},"z1zctrpJHgR_8lquAzqbDw":{"text":"We were unsure about being able to fit in a visit to CL during our trip to New Orleans, bu","useful":0,"cool":0},"mi0u7ukeo5ouPRP1y8Je4A":{"text":"Pretty incredible find. Goat curry gnocchi and spinach fontina side were well flavored and","useful":2,"cool":0},"UxLlFp_oR_InSaKVJe1XqA":{"text":"I had 4 dishes and 3 were exquisite. Beautiful in concept and execution. The entree just d","useful":0,"cool":0},"fozz96rIM1FXs493Df-Acw":{"text":"I was a little underwhelmed on my brunch visit.  I wasn't blown away by the choices, odd s","useful":0,"cool":0},"Wfw5atC0asI6cb-WU--JKQ":{"text":"For our last night in NOLA we lucked out and was able to get reservations! I was really lo","useful":0,"cool":0},"6YM_k5dE_GUYTNhb2AwX_g":{"text":"Met with the ASM and must say they address any issue immediately . Nice to see","useful":0,"cool":0},"8we4kEcHv38lGZ5FoVkZag":{"text":"Compere Lapin was an amazing New Orleans experience. The menu is unique but approachable a","useful":0,"cool":0},"R3jWnrbwIj-BDPZFb2mW_g":{"text":"Meh. In NOLA a good rating is below average as there as so many fantastic spots. Mind you,","useful":0,"cool":0},"GKt3rRJrHMRnk68i7WwxlA":{"text":"The food here is sooooo good. Too bad I'm only in New Orleans for 3 weeks. \n\nThe broiled s","useful":3,"cool":4},"PMybh1w2CfuYv_JWHuTRHA":{"text":"I was not sure about trying this restaurant, because of the chef's jamaican influence. Som","useful":3,"cool":2},"lRykiyaC5PxlqVdPlDLnsw":{"text":"Let me start by saying I fell in with Chef Nina on Top Chef New Orleans. I'm so happy she ","useful":1,"cool":0},"oreYRiyZ6dqLuvOmnnQdxg":{"text":"One of the best restaurants I've been to! From the vibe to the food. I love their menu sel","useful":0,"cool":0},"SbMAMBik4-P1n2HM7JsCWQ":{"text":"I went with a couple from St. Helena, California, so they are spoiled by fabulous food. Th","useful":0,"cool":0},"0PcQDZ9QY3VmqEDMvvT1nQ":{"text":"The restaurant is located in a hotel. The neighborhood isn't the most attractive, but once","useful":1,"cool":1},"UafzGFHn-1_wCfL1c1n1Gg":{"text":"We had an awesome lunch here yesterday. The atmosphere is fun and lively. I love how it sp","useful":1,"cool":0},"57Jc2AW-S48gV6CpBZgxjw":{"text":"I'm not sure if it's I went in with very high expectations, or if it's because I hail from","useful":2,"cool":0},"PY2ZvkYX1VfpeaMPsVvQ9Q":{"text":"Really interesting flavors! We sat at the bar and enjoyed a few appetizers and an entree o","useful":1,"cool":1},"rB-hJGlDQTj-_hi0rGzLmQ":{"text":"Hands down the best restaurant in New Orleans. Have been there three times just this trip.","useful":0,"cool":0},"zgKiFbEivoxcBxVTLEpzPA":{"text":"Last minute choice for dinner.  Pleasantly surprised with service and food quality.  Menu ","useful":0,"cool":0},"hS-c9ln0fkoV34pPWTtIzQ":{"text":"Dearly departed... We are gathered here to celebrate the life of the Jerk Black Drum Fish.","useful":7,"cool":6},"SpqXpnqA3Kg5ze9e89X9ow":{"text":"ETA:\n\nLooks like they have some serious continued service issues based on recent reviews. ","useful":0,"cool":0},"gwscd2wQhZqvZmnXOPxSeQ":{"text":"Came here for dinner but decided against going all in on Caribbean in Nola.  Coming from N","useful":2,"cool":2},"tgXZHgP7HqcGHDZJjwoq7A":{"text":"Last night I had a business dinner here. The staff was friendly, but I was immediately put","useful":0,"cool":0},"VelqZUOfZbNiwz140VL1wQ":{"text":"I very much enjoyed my birthday brunch at Compère Lapin. The atmosphere is fresh and trend","useful":4,"cool":1},"3DGBPD7WB9G2I882QXIL7w":{"text":"Of my experiences here, brunch really stood out ! We live down the street and this will be","useful":2,"cool":1},"4F9e5gU-w7KZC0lLIFvQtg":{"text":"Sorry ..this place didn't do it for us. We ordered croquettes , cauliflower which were rea","useful":1,"cool":0},"M-XN6vm5z5JUB6tc9AKtTw":{"text":"First, I love how serious this restaurant is taking COVID. The tables were generously spac","useful":12,"cool":10},"gY3Gxkepgl2Ivd8IO4buXQ":{"text":"This place is knocking it out of the park. Every cocktail we tried was superb, and Abigail","useful":2,"cool":3},"B7IxRwhBnVrrXOdZH0C7Dw":{"text":"My husband and I enjoyed a delicious dinner here during our summer vacation in New Orleans","useful":0,"cool":0},"HBJ7UO66SI4leIdBvf1lKw":{"text":"On my recent trip to New Orleans, I had my single best meal here.  First, the decor is ama","useful":0,"cool":0},"gYP8wa8Qn6sxlRIwgfWObA":{"text":"I couldn't wait to visit this spot. Nina Compton was one of my favorite Top Chef contestan","useful":0,"cool":0},"pxKII-ADiTTs92S-32mnPA":{"text":"Hands down one of the best meals we've had in a while. We left so happy and so perfectly f","useful":0,"cool":0},"5T5MvscmxbKF0G8VRJfgGw":{"text":"This place is amazing! Before it was suggested I come here, I had never heard of it....but","useful":0,"cool":0},"-n3zTMdO5xWmGQAU8MqBDg":{"text":"Feel like this place deserves a Michelin Star if the Michelin rating were a thing here.  W","useful":0,"cool":0},"gMQYqGfDL9HSrDSQf0XDWg":{"text":"3.5 stars. Stracciatella (burrata) w roasted squash hazelnuts and pumpkin seeds were super","useful":1,"cool":1},"7NRBgwxJevJEpIfY_XAcIA":{"text":"Wish I could give this more stars! Heard of this place from a friend and was excited to tr","useful":3,"cool":0},"jJ-BYThje5CnF6d1DpXkaA":{"text":"Adobe pork was delicious.  Tuna tartare amazing as well.  Great ambiance.  Open late.","useful":0,"cool":0},"Lorc3AJoqCcQ491ERosbfg":{"text":"I went to Compere Lapin for brunch recently and was very pleased.  \n\nThe Location: \nRight ","useful":2,"cool":0},"2260OyfD8M849NHHCP_1VQ":{"text":"Pepper Pot. This sticks in my mind because you went to the grocery store on vacation and s","useful":17,"cool":13},"lAQuk2_4rCw0LD2R7XJnPQ":{"text":"Sat at the bar and had good drinks and dinner during our one night layover in NOLA. This i","useful":0,"cool":0},"vL0Uj9M2StjDfF3L4TNZpQ":{"text":"We had a wonderful dining experience last night. The restaurant is located inside a cool h","useful":1,"cool":0},"WlOFbC7lUh0pjoZ0xlElyg":{"text":"Definitely one of BEST restaurants in New Orleans.  Nina pulled this off and then some. Th","useful":1,"cool":1},"TqrcfNRvQ99Bn2vUpNacBw":{"text":"Brunch Sunday, January 1, 2017\n\nBeing Top Chef fans, we were excited to learn about CL's e","useful":1,"cool":3},"o6lLBZk71Kt4AWoWDtOj1g":{"text":"Went with a friend and we sat next to a friendly couple who summed it up perfectly: 'it's ","useful":1,"cool":1},"d0QaSaxGfTO9yyA-vS-Vyw":{"text":"Delicious food in a cozy/modern space not far from the French Quarter! Our group had a gre","useful":0,"cool":0},"0GQ5jOjQOGmb9YFKRet5Fg":{"text":"So I went to this restaurant for an event and the food was amazing. It was a Chase Sapphir","useful":0,"cool":0},"jYkePYLzUeHMdfjXamaHJA":{"text":"I hate to be one of those jerks who review a restaurant on the quality of the service, but","useful":5,"cool":0},"9PkI7LOuIkFI0qZqSMigAg":{"text":"An excellent restaurant. In the CBD but NOT in the heart of tourist country-ahh. \nTo start","useful":1,"cool":0},"eRmcnQtBmS3EJvll9mxASQ":{"text":"Visited a good friend in New Orleans during the holidays and this was his recommendation f","useful":1,"cool":0},"daKBlkIn17YieSv2Cs_pWA":{"text":"Absolutely amazing from the atmosphere to the food to the flavors and playing and the drin","useful":0,"cool":0},"QeuIl36xNFhl6qvB-Rpmug":{"text":"How the heck does she DO that with food?? Best meal of my life. Period. Chobia (I can't ge","useful":0,"cool":0},"fMRs3h_WFLRuQ8Scn6SeDA":{"text":"I'm actually a huge proponent of eating insects. They can be sustainably raised with minor","useful":1,"cool":0},"wQf2mBshZsicD_lCsB8Q0w":{"text":"Finally tried this place the other day for just drinks and appetizers and really cannot wa","useful":1,"cool":0},"kAwZICmfdnQuk51ugz20Cw":{"text":"This place is fabulous! We started our meal with a couple of delicious, hot, flaky biscuit","useful":0,"cool":0},"aatj50TMB-y2LUZxC_hHlA":{"text":"The reason I gave 1 is not because the food, the environment but because the servant attit","useful":4,"cool":1},"T33Mf3-2kCRvnhqpRGkwgw":{"text":"Came here for cocktails and they were fantastic. Scott and Joey were truly the MVPs of the","useful":0,"cool":0},"9YAl8J4e6jLl5vi3rw_Hyg":{"text":"Came here in August for a late lunch (2 or 3 pm). We were around CBD and found it on Yelp.","useful":1,"cool":0},"LyZJ6GQT6xqJTu6hxK18ew":{"text":"My buddy and I had our best meal in New Orleans here. Sat at the bar and ordered 8 items a","useful":0,"cool":0},"4MnbNC40jEgS3B3ql5z7oQ":{"text":"Janice and I are huge fans of Top Chef. We have made it no secret that we are merely food ","useful":0,"cool":0},"2y2bSqJgB0qzVVUI2U1-AQ":{"text":"Wow, this was the best meal we had in NOLA and the food is just as good as any I had in LA","useful":0,"cool":0},"FIfsgfxHILjzLgDL7uxN-Q":{"text":"Fantastic!  Love chef Nina Compton's food.  Love the Caribbean twist.  Had the curried goa","useful":0,"cool":0},"ag6tnD26FKvTTvpEQi0azQ":{"text":"Staying at the hotel and popped in for some drinks. A little bumpy at first but the manage","useful":0,"cool":0},"BcZ7TCLpmSTyiE0B1SC8OA":{"text":"Excellent food, friendly but slow staff.  Everything we had was delicious.  The pig ears w","useful":0,"cool":0},"VM3flWvpfed4Gdtg-41ZfQ":{"text":"I came here for a midweek lunch to celebrate a friend's birthday. It was an early lunch du","useful":3,"cool":1},"7YAOMhW4ZIsViNvlfAbmtQ":{"text":"Blown away with restaurant. Each dish of their coolinary menu made our mouths explode with","useful":0,"cool":0},"wyNpuJxPuHIm5hXAjFTQWg":{"text":"My only knock on this place was the service. We had a reservation for 8:00 and arrived on ","useful":1,"cool":0},"s3iU-RhnkZth2LXr5-nSzQ":{"text":"This is a very unique restaurant! It is in a very cool hotel lobby. Everyone on the menu i","useful":0,"cool":0},"BDL7ZJpkiePxw0SZSiwjSw":{"text":"Horrible service, horrible food. James beard should be ashamed. A horrible representation ","useful":0,"cool":0},"CfWq-VGJJbpxCoS0xQ52xw":{"text":"Omg!   Lackluster ambience.  Slow service and cold food.  Just really poor attention to de","useful":1,"cool":0},"5RAi9umaeo0NmDIO-9ZMIQ":{"text":"I've had dinner here 3 or 4 times, enjoyed a happy hour in the lobby from them and recentl","useful":2,"cool":1},"PO4oy_SzQbcH8tu_S_uFUg":{"text":"Excellent, interesting and well balanced dishes, top shelf service and interesting craft d","useful":0,"cool":0},"h1fu14xD82YSqiIdw69Jzg":{"text":"Nina compton and team!! I wish you could run every restaurant! The decor is stunning + ind","useful":0,"cool":0},"5yP72cH1Stfq-X-VLbkuPg":{"text":"I loved my experience. Walking in the door the smell is intoxicating. We sat next to an am","useful":0,"cool":0},"oyZXKh0FRG4It1Qn_LypTg":{"text":"Absolutely one of my favorites in New Orleans! The bread and butter to start was awesome, ","useful":0,"cool":0},"B1H-QoSXeMQTnePeVSrsPA":{"text":"Food was excellent but expensive. Enjoyed the apps and shared a bunch of entrees. The home","useful":4,"cool":1},"sBnB0hdJ1Wpd5Np27p_fpQ":{"text":"You know those pleasant classmates at your high school reunion that you vaguely recognize,","useful":24,"cool":25},"zXwiA7ODDRkX6ld5K1wxVw":{"text":"Best of!  Every bite a dream. Had dinner with friends and everything was delicious. the la","useful":0,"cool":0},"DclPSr3H3s4kYuF8-2GSEA":{"text":"Amazing brunch and service is fantastic! Avocado toast and chia coconut pudding is a must.","useful":0,"cool":0},"BQ0skrCSSuoXHY4uzJgyNA":{"text":"A new restaurant that exceeded my expectations in the hallowed New Orleans restaurant scen","useful":1,"cool":1},"IcTV2TyvChYVhK3o1HE9Pg":{"text":"Great ambiance, balance of class, romance and fun. Great lighting and music that is not to","useful":1,"cool":0},"Ps96el595tQJmWXYHoL_fg":{"text":"It is so tempting to give five stars for a single thing -- the marinated shrimp with roast","useful":2,"cool":0},"_9WElak766cwbAP4vNblWg":{"text":"Considering its address, I was expecting a pretty disastrous experience at CL. But then I ","useful":13,"cool":8},"dMjBiFeUyJjjbFj9japgOA":{"text":"Hip and Trendy through and through. Refreshing and unique menu with a great blend of the c","useful":0,"cool":0},"TKsPG9ZpwTnKbbfvL5vPKQ":{"text":"Service was great, food was good. Why one star?  I ordered a double vodka soda. It cost me","useful":6,"cool":0},"utnG0jpknPAmPBkdEXn4SQ":{"text":"This restaurant has a nice cozy rustic  feel decorated beautifully with eclectic decoratio","useful":1,"cool":1},"4IBWUfLfhDJMOP0dIb1rZg":{"text":"I made two hydration pit stops here over the course of my time visiting New Orleans, and i","useful":3,"cool":1},"iwk9ob5zbMlierXgnaJEYA":{"text":"This is one of the best female chefs in town.  It's a twist of American and Caribbean. My ","useful":1,"cool":0},"cVVIhjkU6LO-w6-sSo09Xg":{"text":"Amazing evening. Spectacular service in beautiful setting. Great wine list and creative co","useful":0,"cool":0},"T4eoysLVBOET97LIKX6zGg":{"text":"We returned to Compere Lapin after having an exceptional meal earlier the very same week (","useful":1,"cool":1},"PPo1i_iZE96cvDAA-hqtUA":{"text":"We attended a special event featured by Chase Sapphire and hosted by the Chef herself Nina","useful":0,"cool":0},"rKPOrKwq_UYIc3sgqlaRzQ":{"text":"We got the prix fixe for lunch and really enjoyed ourselves. Would love to come back for d","useful":2,"cool":2},"GghsIsmVaBI-BircEUwYlQ":{"text":"It's good, just not mind blowing (see shaya)\nThe cocktails are well crafted.\nSpace is Shin","useful":1,"cool":0},"mXxOWBlFaMfk17ckD9ovxQ":{"text":"Server was very knowledgeable and pleasant. Atmosphere is cool, but, so similar to other r","useful":0,"cool":1},"fbensUuMt5ixWPmEc6JEAw":{"text":"My favorite meal on my recent trip to New Orleans. I dined at the bar and really enjoyed t","useful":0,"cool":0},"fCHLQwOjEpn7e-b-BNPqfg":{"text":"I was here four years ago when I visited New Orleans last time. Everything is still amazin","useful":1,"cool":1},"AlbNNfz3LsS_3KPWYLAhQQ":{"text":"Stopped by for what I thought was going to be one drink before I teetered off somewhere el","useful":2,"cool":1},"eF1EXtcUDXK4gEc0YSUEiA":{"text":"Only thing that brought it to 3 stars was the service which was excellent. Ambiance is nic","useful":3,"cool":2},"tWE1_b9aW58asbl0cgZMjg":{"text":"We will never go back to Compère Lapin ever again. I was there with a group of 8 and wante","useful":0,"cool":0},"iaGfca3i8E56qhY5C5439A":{"text":"Awesome food! We really liked that this place asked us about any allergies we may have, re","useful":0,"cool":0},"LwQBQQ5QNNv0XkE9YEoMSA":{"text":"Absolute stunning environment, knowledge wait staff and brilliant food! The chef has a del","useful":0,"cool":0},"_svz6k5e-FcyK0A05JH4Jw":{"text":"A chef from St. Lucia made this meal quite unique. Excellent drink menu with local flavors","useful":1,"cool":1},"3mBG1qEdcOIokcmC4IvLKw":{"text":"Had a great experience at Compère yesterday. Saw some comments about poor service but hone","useful":0,"cool":0},"4Ct7w90DWTmd7eC2GlfdQw":{"text":"Compere Lapin is the real deal. Came here with a party of four (including a 1-year-old) fo","useful":0,"cool":1},"7dnoDArDNlIpA28T8caoPA":{"text":"Everything was delicious! The hostess Angela was very friendly & welcoming! Our waiter was","useful":0,"cool":0},"uKGPEO-4Q26DE2mnJl3h-Q":{"text":"We are here because we stayed in the hotel, but it turned out to be delicious. The atmosph","useful":0,"cool":0},"spN4GYZL7azTLxsb3RBOuA":{"text":"Everything was amazing. We got the tuna tartar as a starter. I tried the pisco sour and it","useful":0,"cool":0},"ExEoUHwU84AwSdZCoyddDQ":{"text":"Horrible. I was so excited because I love Top Chef and loved Nina but this was absolute ga","useful":2,"cool":0},"5cIzT6FJCeEtKQE6FTWZVg":{"text":"This experience was not the best--in full disclosure, this review is not about the food at","useful":9,"cool":6},"6Pr6o2GV8D_RjhWBAim2qw":{"text":"wow, fantastic food! go there - loved everything from the cocktails, the wine list, and mo","useful":0,"cool":0},"Df_apZkUum4qtukfzcGsjA":{"text":"The food and the drinks are delicious! Cow heel soup, to die for! Steak tartare, amazing. ","useful":0,"cool":0},"6XDLP92mJzzMsSM4dB4ttQ":{"text":"Compere Lapin is solid.  We have eaten here a few times now.  I do not remember the chef's","useful":3,"cool":2},"l8UVAXNAw1J2Y40yXHEg9A":{"text":"Went for brunch and thought it was just OK... \n\nDon't go here hungry, you'll starve.\n\nVery","useful":0,"cool":1},"5N7kywmP7bbm6Xzi_TllfQ":{"text":"Wow!! Absolutely loved Compère Lapin and will definitely return on our next NOLA visit. \n\n","useful":3,"cool":2},"letQDA8pEw4j-Kz95QEuqw":{"text":"A Friend of mine is staying there this week, so i joined her for drinks and light bites la","useful":0,"cool":0},"oDhHsV8MLiCMfrxbrqxRUQ":{"text":"We had the best meal of our entire trip at Compère Lapin. The food was excellent and reall","useful":0,"cool":0},"3AZmgX1zLmkfgBQdZQ1j5g":{"text":"Classy place where I hid from the rain and had a delicious cocktail and a warm focaccia ap","useful":0,"cool":0},"8WqTHXVx8xqfSMFbzc7akw":{"text":"The carrots are every bit as good as others have reported. It reminds me of this middle ea","useful":0,"cool":0},"B0V339_f2yFzmwHxJs952w":{"text":"This restaurant is ok. It's fair but the food isn't memorable. It's too pricy for what you","useful":0,"cool":0},"-HOtp-FCleX7mwJXD5C3rQ":{"text":"How did I not review this delectable and uber delicious meal??!! Excellent service was pro","useful":1,"cool":1},"wmhkzrRs9-nKKSjdFoc6Cg":{"text":"Fantastic night began with custom Mixologist James serving up special creations just for u","useful":0,"cool":0},"6N0duT_jP_Yspmh_rwQYDw":{"text":"We just had a fabulous Xmas eve dinner here.\n\nHighlights:\n1) Service was fantastic and cou","useful":0,"cool":0},"HcxykTs4AQNLdKn09oT0Fw":{"text":"Great new restaurant - service was a bit slow for lunch!!  Food was worth the wait!!!\n  Wa","useful":6,"cool":4},"ufyiWaZJqbPXBPRYsWN47g":{"text":"If you have plenty of time and cash that's simply burning a hole in your pocket, stop in h","useful":0,"cool":0},"1iPFT3LC8hHPIgWI2dduAw":{"text":"Went with a larger group and got to try several of their small plates as we shared family ","useful":0,"cool":0},"ML6fvhIrsbFJYe5tCT212w":{"text":"I had a lovely solo lunch date here a couple of weeks back. The biscuits that come first a","useful":2,"cool":1},"DS9VNYoyjG0jDCm4urIwOA":{"text":"This is about the $21 dollar brunch burger. \n\nDon't get it. It was sub-par and oh did I me","useful":0,"cool":0},"-GhCayk0TydAahyXC7S0DA":{"text":"Conveniently located in the French Quarter this Gem is an absolute must go for brunch lunc","useful":1,"cool":0},"BoKmIhzkZLFHqH2cnzf9jA":{"text":"Absolutely delicious food and great staff makes Compere Lapin a great choice for a new and","useful":0,"cool":0},"3o1-AtdM7ITJBLsah3lzhQ":{"text":"This used to be my favorite restaurant in New Orleans. I would visit 2-3 times per week du","useful":1,"cool":0},"CT5T6dw8L0oPg4dJPt7lsw":{"text":"What a huge disappointment.  We have been looking forward to dining here for months.  They","useful":2,"cool":0},"J11MlriRmq2vFjVa2lCx6w":{"text":"Speaking of fancy and pretentious, while this place isn't that to me, perhaps to someone w","useful":1,"cool":0},"LDg8e5wz-gNUx61TlyB3hw":{"text":"Delicious meal and fabulous service. Enjoyed my evening at Compete Lapin from beginning to","useful":0,"cool":0},"fuD56RrLuIkh7-L6stynDg":{"text":"Food was wonderful, lively place, we sat at the bar had delish cocktails & service was ver","useful":0,"cool":0},"5yZ6DBsWKrB8fsIzCxLvvA":{"text":"Bourbon, biscuits and a catfish sandwich.  What a wonderful experience!  I am a Louisiana ","useful":0,"cool":0},"7S3KfjaonpoER3ofZYzeSw":{"text":"If I could give 6 stars I would! Best restaurant of my NOLA experience! The ambiance, appe","useful":1,"cool":0},"sI4gkRCJn9m4Vt0GTUQaAQ":{"text":"Wow. Just wow. Words can't describe the CL Bagel tartar. Everything we had was AMAZING!!! ","useful":0,"cool":0},"82iUatx_WIhwHwG552WA3w":{"text":"I had high expectations and was somewhat disappointed on the flavors in the dishes I order","useful":2,"cool":2},"gZHnT1w8SUBDKInTgA-Y5g":{"text":"So good...I was hoping for a Nina sighting but a No Go. I started with a glass of Riesling","useful":2,"cool":1},"gt9JpGfDbE9hparZLRApAQ":{"text":"I have eaten here a few times for lunch and recently for dinner.  Lindy our server was gre","useful":1,"cool":0},"TO7QkdqMgKothGy6r5AeVA":{"text":"I enjoyed this jewel, one of my favs in the city. Especially enjoyed the staff, very comfo","useful":0,"cool":0},"pksZaegyMqa3fNV7pfxZ2g":{"text":"This place is my favorite place to sit and relax with some tea and a pastry on a quiet mor","useful":1,"cool":2},"jdXFB8kSWZdZMHcrP3lUig":{"text":"Lovely place. A bit crowded but still comfortable.  Service was really first class. Stewed","useful":2,"cool":2},"7Sf_Q2NW5b3DKWAsKWZVNA":{"text":"This was my second visit to CL.  The first time I was solo visiting family for a short tri","useful":2,"cool":0},"dL-GInuT0T1zJK6LNqz5fA":{"text":"You've got a great mix of dishes and flavors here at Compere Lapin that are all executed w","useful":2,"cool":1},"M_dIdwqex3JDy2u1FbUR9w":{"text":"Stunning décor and outstanding food, paired with lovely service. We had the cold smoked tu","useful":0,"cool":0},"N4kEOUnelQeqFQLG3xKwoA":{"text":"I had extremely high expectations based on the reputation of the owner. My server was funn","useful":0,"cool":0},"o8H1uDicXQlhQXJKq0T8gQ":{"text":"Best meal of my life. I am a picky foodie, so it takes a lot for me to give a meal 5 stars","useful":1,"cool":0},"tVMCt2KhM1IVPlleDEF-lw":{"text":"Ordered most of the menu and the only letdown was overcooked jerk chicken. The banana zepp","useful":0,"cool":0},"DM6iIVc6Z62u2rwMlbbe-g":{"text":"I went here a couple of years and ago and remembered how enjoyable this savvy spot was so ","useful":2,"cool":3},"_h4BAOAwKYu53x7bcPgqmA":{"text":"Excellent local cuisine with a Carribbean flair. The conch fritters and and dirty rice bal","useful":1,"cool":1},"uqawMtNM3KuLe29Cm2y0bA":{"text":"Everything was creative, server was great, fresh briny delicious oysters. This is a must h","useful":0,"cool":0},"U07wWRZd0OK3Oba8bBBO9Q":{"text":"Favorite food highlights: \n\n//Pici pasta special (chanterelle mushrooms, grated fois gras)","useful":0,"cool":0},"5yiEDcykH_lYIdP8zFXbnQ":{"text":"The food was incredible. We got the curried goat and the scialatielli in run down sauce. T","useful":0,"cool":0},"zcSoo_oUFt8mMDp0RH4FeA":{"text":"I had such a great time that I wish I could book a flight and go right back!! I ordered th","useful":4,"cool":2},"ZjMOz0ApJm_keFmC3XYKSw":{"text":"I've heard nothing but good things about this place and finally made it.  \nWe were here wi","useful":0,"cool":0},"_-vTpnMYZMTgjEhsRTCjpA":{"text":"Holy crap- this place so far exceeded our expectations - we were with a large group so we ","useful":1,"cool":0},"XjbSA9V2VjRmY5lz-_UvPQ":{"text":"We had 8:30 reservations, and arrived at 8pm. The host (Jeremy) told us we were too early ","useful":0,"cool":0},"FDFjU_y1eKpvLyS03H6BAA":{"text":"I was super excited to try Nina Compton's restaurant as she was one of my favorite top che","useful":0,"cool":1},"4FBmpBOtwT6fdJDDUNgD1Q":{"text":"Best food Ive ever had. Scrumptious complementary biscuits, far out food that I probably w","useful":0,"cool":0},"SHIF476hsaqjexrIOJyEMA":{"text":"We came to celebrate my friend's birthday-- the poor service was disappointing. Both the h","useful":0,"cool":0},"30gaqK2oSWDEkiFL_fMipA":{"text":"Right off I'll say - the food is 5 star!  Delicious, unique and quite tasty. The chicken w","useful":0,"cool":0},"bYtxO9C48rGyQYTFxgNDVA":{"text":"So, SO GREAT! The service was wonderful. The food was incredible! Every bite better than t","useful":0,"cool":0},"AUYFTvIh5ZEGzTNswwQw7A":{"text":"Full disclosure, this is only for the bar. I was staying the attached hotel and decided to","useful":0,"cool":0},"pcTELwCf7S6kcIKwpD0YWg":{"text":"I don't care how good the food is supposed to be at this restaurant, I have never experien","useful":1,"cool":1},"Ub4c7FvrFSgdfzB0RpdRbw":{"text":"We did not dine in all the way for dinner but just sat by the bar to have a few drinks and","useful":2,"cool":2},"Yo8HKinJtJDs7GSMsYThwA":{"text":"Absolutely delicious.\n\nI stayed in the hotel this restaurant is in, and this restaurant wa","useful":2,"cool":1},"Zz4QXpBhZe8rmtjVFQNdNA":{"text":"I have been dying to go here as a huge fan of Nina Compton from her top chef days!! Coolin","useful":0,"cool":0},"3hNT_QP6z6IyevHMEnxX_A":{"text":"From the hand poured cocktails to the unique brunch experience! I savored every bite, ever","useful":0,"cool":0},"3oK61f3-x7HMtC9EV-rdEA":{"text":"This is exactly the standard we need to push for new restaurants in New Orleans! It moves ","useful":3,"cool":2},"A8Z7doFB-a2NDWvIfVujVA":{"text":"This is a nice bar/ restaurant in the Old 77 Hotel. I didn't try their food, but I had a g","useful":9,"cool":7},"gNP1LKF8_hpYdoNvSxTouA":{"text":"Drove in from Houston. found this gem. Enjoyed a delightful brunch-- had the Copper Hopper","useful":1,"cool":0},"31mlvKU4H1hALWktAth0JA":{"text":"Easily the best food we ate in the whole city. Every single part of the experience, from t","useful":0,"cool":0},"DjMcr5bl6RWTHuzN7tud-Q":{"text":"Unbelievable meal and great service.  The staff are committed to the mission of the restau","useful":0,"cool":0},"O0eqkNSORZWsaDKX3_BHRA":{"text":"Compere Lapin's brunch deserves 5/5. The coconut french toast with pecan rum sauce (15$) i","useful":2,"cool":2},"SDNRrg2MrJ9x3J5cuy5Reg":{"text":"Food was excellent! Great interweaving of flavors and textures. Truly a great dining exper","useful":1,"cool":1},"3lhHWxdGW254tOm_yPOTFQ":{"text":"The food is delicious at Compere Lapin, but: How many times do you have to tell servers an","useful":0,"cool":0},"keOATPOnNxl0QQv4-Ywjmg":{"text":"Compere Lapin is set in the lobby of the Old no. 77 hotel in the Warehouse District. Decor","useful":2,"cool":1},"F1HPruJKB5zleteznIhHcA":{"text":"(Actually 4.4 stars). This is a very attractive restaurant with a hipster groove. It accom","useful":0,"cool":0},"Q0TEq6aemwlMwjVtSGUQhg":{"text":"I was thoroughly disappointed with the food and service at Compere Lapin.  Among all the r","useful":4,"cool":0},"-Q1ubnuyVa--FUIF3pKlUQ":{"text":"The brunch was delicious- especially the bagel tartare. The cocktails were some of the bes","useful":0,"cool":0},"6I7No_9YaM8K8aBziJXvFg":{"text":"Amazing food and service. Chef/Owner Nina Compton has created pure magic with this menu. C","useful":0,"cool":0},"mxpMz_ONrOCYtp7mJCP_JA":{"text":"Went there right before mardi gras this year.  Had the brunch.  Was very good.  Didnt know","useful":0,"cool":0},"eixQzmKg2xNZNOWpA175wQ":{"text":"Nice decor, friendly staff, mediocre food. I would love to see the flavor kicked up a notc","useful":0,"cool":0},"x2iIJEnDf0zl4Q4k05nJCA":{"text":"Best restaurant in NOLA ! Make sure you visit.\nBest food best service best place !  I met ","useful":0,"cool":0},"nHW25cHKrR1Cfn24aYP8kQ":{"text":"LOVE their menu... LOVE.\nThe seafood hotpot is the best dish I've eaten in New Orleans thi","useful":6,"cool":5},"TxGRvaLSW7FK0pJQea_b1Q":{"text":"We loved dining at the restaurant for lunch!  We had the cold smoked tuna tartare with cav","useful":4,"cool":2},"G_08GZmTZ8N8SvPHvCOz3w":{"text":"I ate here with my friends during their Black History series. The food was fresh and delic","useful":0,"cool":0},"3LjE6W7jz5YaEKctTSLT1A":{"text":"Nina Compton should've won Top Chef. Any other opinion on this matter is wrong.\n\nThe biscu","useful":3,"cool":1},"La5nb3jwNR7It6sAjkv1Pg":{"text":"Excellent! We had a party of 6 for dinner on 1/9/16 to celebrate the start of Carnival, no","useful":0,"cool":0},"GVNm-3PB_uutaze6_tVEOA":{"text":"Poor service. The waitress was very rude; she embarrassed our host in front of 7-8 of his ","useful":2,"cool":1},"EvuKHZbH6Ih2PtU_l0z15Q":{"text":"Saturday night dinner at James Beard Foundation Award winning Nina Compton's gem of a rest","useful":0,"cool":1},"zbgGeGkiYhvqnSUD07bCzQ":{"text":"The best cocktails and ambiance in New Orleans. We had the Papa Legere, Dash and Willow an","useful":0,"cool":0},"Cn5OLulkvJu2_b2bKfctng":{"text":"Very happy to have had the opportunity to try out Compere Lapin with a group since I was a","useful":28,"cool":16},"ZqvLNjbnOtNIfL923hBKXw":{"text":"I've since been back to Compère Lapin, too many to count! In my opinion, Chef Nina Compton","useful":1,"cool":1},"q8TmuM_773JVxzySbQSgSw":{"text":"At first, the strange items on the menu seem daunting, but I was delightfully surprised by","useful":0,"cool":0},"BAMdBiz5CdOQDyxo4c-59w":{"text":"This is a hotel restaurant at best. Slow service. Sour unappealing drinks. Lamb belly was ","useful":0,"cool":0},"sGsniTCw3-h6DXIccq8wfw":{"text":"We did not eat in the restaurant but sat at the bar several times during our stay at the h","useful":0,"cool":0},"nm7kLWQRYC9r9nGGJhFGKg":{"text":"Such an amazing experience. The atmosphere is so relaxed and refreshing. The server was ex","useful":8,"cool":4},"4cyx2SlX9Kdbvkf0_45EfA":{"text":"Compère Lapin is the bomb.com! However, you already knew that. They won a James Beard Awar","useful":16,"cool":11},"7CZ7jw_cAuFasq7B-GVUfA":{"text":"The food here is really just overall absolutely fantastic! We went for brunch and I ordere","useful":0,"cool":0},"gRGA57V9aCblBZQCGS9QZg":{"text":"During our very brief stay to New Orleans (31 hours to be exact), this was the only dinner","useful":0,"cool":1},"c3bzBTrFua7anHtEdYfdRw":{"text":"Great place to eat at NOLA downtown if you're looking for good food, good service, elegant","useful":0,"cool":0},"Hin6YoC5O9FD0MD1J-7sMA":{"text":"One of our favorite spots in all of New Orleans. \n\nThis place got it all, \n\nThe scene \nThe","useful":2,"cool":1},"E542jmxMSV5mHz3fLKjyoA":{"text":"The service was absolutely deplorable. I cannot believe the disrespect that I felt from th","useful":2,"cool":0},"net2JKaLnOo1wUZyKskMDw":{"text":"I really enjoyed my dining experience at Compere Lapin. I came in with a friend on a Monda","useful":3,"cool":3},"h2jnkSlYR42r3ARNPLLD-w":{"text":"I think the reason this place gets such high marks is that it is so different from other p","useful":3,"cool":2},"se2rc6oDEZDRV5xATwSp_w":{"text":"I was in town for a conference and meeting up with colleagues for dinner. I persuaded my b","useful":0,"cool":0},"vwBgO_Y5dyDOuNb6u7a-GA":{"text":"One of our favorite spots in all of New Orleans. \n\nThis place got it all, \n\nThe scene \nThe","useful":2,"cool":1},"33JFdqJWcW0hKcwRFvwAuw":{"text":"This review has been sitting in my draft inbox for way too damn long. \n\nOh Chef Nina Compt","useful":18,"cool":11},"F_84FuGthRSMM8TeEZmPHw":{"text":"Went for brunch. The food was pleasant, although the banana zepoles were excellent. Servic","useful":0,"cool":0},"6qxsG3qzE2VGbpFIYK5YXA":{"text":"This is a great spot in New Orleans, not super far from the French Quarter, perfect for so","useful":0,"cool":0},"gPk216yMPm61v7OG4cfClg":{"text":"I was amazed by the flavors I have experienced at this restaurant I have enjoyed the ambia","useful":0,"cool":0},"btr2KkZun7RlddY5Mhlh2w":{"text":"This is absolutely one of my favorite restaurants I've been to. It's better than some Jame","useful":3,"cool":3},"L_tmWFRhceNwypmnc6x6hA":{"text":"Most amazing dinner!!! Nothing we have had before here in New Orleans: such an amazing com","useful":3,"cool":3},"gcR3BIAaVHHIoNm3idSywg":{"text":"We came here for my birthday! My bf surprised me by agreeing to dinner here when we were v","useful":1,"cool":1},"fY_ocs70lHYKB5zyttYWcw":{"text":"The biscuits were SO GOOD. My husband and I had 3 orders of them and tried to order anothe","useful":0,"cool":0},"AIfQxRfEZQOPfglf42jRjQ":{"text":"Wow a must for any foodie. \n\nI had the lamb gnocchi with brussel sprouts and potatoes. It ","useful":1,"cool":1},"Gpu9g-XJSHrAGo7cLd4m2Q":{"text":"OH MY GOD.\n\nTo give you a sense of how I felt about this meal - as I was eating my dishes ","useful":3,"cool":5},"8gWz7Cm0IgBwjljE9rPiMA":{"text":"Everything about our dining experience was incredible at Compère Lapin. Our server, Mignon","useful":0,"cool":0},"4TX-vNu8p8qt77jeGOY5aA":{"text":"When in NOLA.... well there are so many great restaurants packed into this small cultural ","useful":0,"cool":0},"zWwquFlHn8oV08Q9oXJhiA":{"text":"Chef Nina Compton is Caribbean native that was one of the top Top Chef contestants on the ","useful":6,"cool":3},"eaqVhZcoSB7zBaFDpO_2ow":{"text":"NOLA is a town with some pretty amazing food, and Compere Lapin is one of the best places ","useful":0,"cool":1},"P_y-0BjsdvjfaS6oaipvzA":{"text":"Great atmosphere! Incredible food! \n\nYou won't be disappointed by the quality and creativi","useful":0,"cool":0},"kjspy4yjnH4XnFVxGD1sNA":{"text":"Great happy hour drinks and food selection. Def will go back for dinner. Has a carribean v","useful":0,"cool":1},"QP-x-JFrCGpm2b_ToqKYow":{"text":"What an amazing restaurant. Everyone and I mean everyone was amazing. The host (so sorry I","useful":1,"cool":0},"taoJ5f2fiHstM-6i2ToIJw":{"text":"Delicious dinner. Standout smoked tuna tartare and Snapper perfectly cooked over sweet car","useful":1,"cool":0},"gpvoGyJ-EcfhZ7m09_kx2Q":{"text":"Definitely one of BEST restaurants in New Orleans.  Nina pulled this off and then some. Th","useful":2,"cool":1},"ZDHz_YoViuTBcdHOyofMUQ":{"text":"Great place to grab a well executed cocktail. Great selection of bourbon and whiskeys.  Ol","useful":0,"cool":0},"rqzKVVfr8RseZMoMSGKbcg":{"text":"*inside information* Ok allow me to give yall a different perspective, as with anything in","useful":8,"cool":4},"_M0JFlp3ytQbLHYrtz66iA":{"text":"Outstanding food, helpful staff.  Ordered the shrimp appetizer and had a few drinks.  Home","useful":0,"cool":0},"iO08-1XAsVBhRJg7TjALyQ":{"text":"Booked reservations for Christmas night we'll in advance. When we arrived we were shone to","useful":0,"cool":0},"j6Qlcde1kA1APmOczaeYwQ":{"text":"Great decor and the waitress was well informed, engaging but not pushy. Chef Nina did a gr","useful":0,"cool":1},"SndrpbiEW6oOMBuQubjG_Q":{"text":"A colleague made a reservation here and a few of us were a little skeptical but that chang","useful":1,"cool":1},"XDOJ9YGd1u0QeSbr5vLOZQ":{"text":"Great food, really really great service and a nice fun atmosphere.  First, the staff just ","useful":9,"cool":4},"gP6-VptStazrAMjEDsaGoA":{"text":"I wanted to try a little bit of everything so we did just that. For our party of 4, we ord","useful":1,"cool":1},"i6qmy__ik22LHudW1sSnnw":{"text":"Great food! I love Top Chef and was so completely excited for Nina Compton to open \"Brothe","useful":5,"cool":1},"XaaDAzm3Onmdce_MUcaIKA":{"text":"Had brunch here on a Saturday. Everyone was really nice. The cocktails at the bar were fan","useful":1,"cool":2},"GjAMSDmUNBqUeHFQHKS54A":{"text":"Fab-u-lous! Artsy, relaxed atmosphere. Can't say enough about how good this food is. Selec","useful":0,"cool":0},"bj2GGNn5_GSppyCXhMyJmA":{"text":"Had heard a lot about Nina's restaurants and was so excited to have dinner here! Did not d","useful":1,"cool":1},"zVXuaL5c0358YoKfeJujXA":{"text":"KenScale: 8.0/10\n\nEver since its opening at The Old No. 77 Hotel in the Warehouse Arts Dis","useful":2,"cool":5},"XZ-muFUmo6b_54XH61WtfQ":{"text":"Welcome to the 3k modern reboot of American classic luxury  lWalkimg in to a unpretentious","useful":0,"cool":0},"dx3WHOaR8vtYB6YaflM4Bg":{"text":"What a brunch.  We make it a point to eat here whenever we are in New Orleans and the food","useful":2,"cool":0},"Wmzf6TboYjQnEE6iwitSPQ":{"text":"We walking in a bit after 5 on a Saturday without reservations. We waited for a bit but we","useful":3,"cool":2},"WkgCeO2VQaj8rEUq66JRkA":{"text":"Awesome experience for brunch!! We sat at the bar with Quinn and he was fabulous!! Don't m","useful":2,"cool":1},"p8qt1DER47iINMgZGe00Sw":{"text":"Had an amazing meal there.  Cute restaurant.  Amazing service.   Loved the hush puppies.  ","useful":0,"cool":0},"yf8uruTFS5GrKcd5lZYlSg":{"text":"Came here for lunch and we were blown away! This restaurant is located inside a hotel, and","useful":1,"cool":1},"Fo0mnW7zoxgz3-QxPStDXQ":{"text":"I had went to Compere Lapin on a quiet Monday night. Reservations were easy to obtain and ","useful":3,"cool":0},"4Jhrp0I531t98G6i9yl4HA":{"text":"Out of all the restaurants in New Orleans, I dined here 4 nights in a row because the food","useful":8,"cool":2},"v6rotkBIGeZK8Kuw3ntjVQ":{"text":"Food was fantastic, but the time between courses was frustrating. Definitely recommend goi","useful":0,"cool":0},"1eW4P1Nf0-uqW1lyaPi26w":{"text":"NO PLACE IN TOWN DOES VEGGIES BETTER\nI now regularly do take-out: those sublime carrots, t","useful":6,"cool":2},"luiS1fmmtqzPIiqZflVlHQ":{"text":"What a disappointment I found in lunch at Compere Lapin. As a guest at The Old No. 77, whi","useful":1,"cool":1},"aU18_4_pMF_QeDGUIAd2kg":{"text":"Stayed at hotel and dined several times... so good! Best recommendations: chilled potato a","useful":2,"cool":0},"TH4Vt72DbLZKljJykEVD9w":{"text":"Wow. If you come here for just the biscuits, you're already winning! They have their own t","useful":0,"cool":0},"3zzRyqDKMJi9IJ30zyvYNw":{"text":"Wow. Compere Lapin is a great choice for dinner. Here are a few points:\n\n1. Warm, inviting","useful":2,"cool":2},"2mpbHHQciNFcVjDnNZW2sg":{"text":"We visited New Orleans for Christmas and read a ton about Compere Lapin, so we were dying ","useful":0,"cool":0},"e-7mbKFa7VtdusPOxX6nBA":{"text":"Went for brunch with the wife and it was simply outstanding. The ambiance was nice and the","useful":0,"cool":0},"LT1H3c-VHuWOZH9Pad-cKw":{"text":"Great service. Food was good. We tried the Coolinary menu and spiced pig ears to share. I ","useful":0,"cool":0},"R2DM3-hSv8Jio-v1T5CxUg":{"text":"What a fun establishment. From the decor, to the service, and of course, the food, this is","useful":3,"cool":2},"jOAQZb1EQAP-XRfERcwcqA":{"text":"My main course was seasoning with a side of meat the bartender was helpful and funny. They","useful":1,"cool":0},"0IdeBJuioXLMdGAC3y5WxQ":{"text":"Beautiful first restaurant to visit the night we flew in from San Diego. Great service. Ch","useful":2,"cool":1},"Fc9C4u_OcShwlTvqQhfjGA":{"text":"I saw another review that said that Compere Lapin is a tricky restaurant to review and I'd","useful":4,"cool":0},"pxCwC6Qq0cq_GlQmetf_Yw":{"text":"Phenomenal flavors and experience. Compere Lapin has been on my list for a long while so v","useful":0,"cool":0},"QRB8tz3AG_XkJ3YpxNefLA":{"text":"5 stars is not enough.\nThis is the definition of a perfect meal.\nService is phenomenal (if","useful":0,"cool":0},"jz4g_2ISXIBFvBsvl47oCw":{"text":"This spot is an incredible value for brunch. Only $35 for prix fixe menu of three courses.","useful":0,"cool":0},"N_0XSi1rTSbLS7nkliKSaA":{"text":"I like this little area of NOLA. Do we call it the warehouse district? I don't know. Big s","useful":2,"cool":1},"7NLbRjpS0cqIsKTLPk-tLA":{"text":"Before I ever thought I'd end up living in New Orleans, I watched Top Chef. Apart from add","useful":11,"cool":9},"m7uXUAQgIL7J-Yv0lFB79w":{"text":"Horrible loud music blared as I attempted to enjoy brunch.  Food was excellent but the aur","useful":0,"cool":0},"optBfFPdBfYDDCKirUnidw":{"text":"We celebrated our anniversary with dinner here, and it was amazing as always. To start the","useful":0,"cool":0},"-LrUiXZ8JG_0KuIlYKEtmw":{"text":"Very, very delayed in trying this one out but better late than never! Everyone had recomme","useful":0,"cool":0},"X4MG-fSPiEPMpXwvU7E1YA":{"text":"Lovely little restaurant with excellent service. Very attentive staff at this quiet, littl","useful":1,"cool":1},"rMQqzm2cwSyLJ5rMRqPMQg":{"text":"If you're in NOLA, this is definitely worth checking out.  Cool space, great staff and tru","useful":4,"cool":4},"k-SxZ5n6gAsYHknWE9AS1A":{"text":"Phenomenal meal, all entres seemed poised for TopChef but didn't feel too exaggerated!! Ob","useful":0,"cool":2},"A9OBZa9dJIA_GvWef-hjYQ":{"text":"Compere Lapin is a tricky restaurant to review. The food and drink are undeniably outstand","useful":1,"cool":0},"3amjw1ILhwUZnUT3pFMDzw":{"text":"Oh my god WOW  I honestly\nDidn't expect to really like the food but it was incredible and ","useful":0,"cool":0},"1v8tYyuOkxS4E_a66ZY_3A":{"text":"S'MO SPROUTS!!!\nCompère Lapin's seared brussels sprouts are truly sublime. The nutty garli","useful":8,"cool":3},"8O2nXfuKSCPlllLHSp6kxg":{"text":"Best meal I've had in a looong time.  Flavors are bold, pacing is perfect, and clearly att","useful":6,"cool":4},"Nk6DgSQqjv2O9biTaqa0Sg":{"text":"Extreme disappointment. We were seated at 8 PM, sharp and ordered shortly thereafter. At 9","useful":7,"cool":4},"UzIDTGayna8F97p0Y1uLzw":{"text":"Fantastic brunch in Hotel 77 lots of great brunch choices specialty drinks and a full deli","useful":1,"cool":0},"7eQUMkb809l5Sh7kysZjiA":{"text":"I stay at the hotel that this restaurant is in at least once a year and was so happy to wa","useful":0,"cool":0},"Bxe36W87gkdNsg0iX16FkA":{"text":"This place has the worst  employees I have ever seen.  I went there on two separate occasi","useful":2,"cool":2},"G3f86baaKuJIvAD1kpRXyA":{"text":"The prefix brunch was amazing & a price you can't beat! The brunch punch was smooth and de","useful":0,"cool":0},"9zCGL3h9YBnZq6JBRrgOag":{"text":"Probably hands down the best food I've had. We visited from the Bay Area, California, and ","useful":1,"cool":0},"PtpDD_ILNbPyR2NkpX7w4A":{"text":"Claire was our server and very knowledgeable about the drink and food menu. She suggested ","useful":1,"cool":1},"LKxptrtXKTa2L8Hr90C4DA":{"text":"Delicious, inventive food.  Wonderful service.  Energetic, exciting atmosphere.\nExcellent ","useful":1,"cool":0},"j2AxpBvfiCdmKvzvOJDhWw":{"text":"A really beautiful space and so bright during the day.  I wanted to try the goat here and ","useful":6,"cool":4},"UsP0xsmjHXiU9FHHkk6EuA":{"text":"Excellent restaurant. The complimentary biscuits were amazing with the house butter. The c","useful":1,"cool":0},"s09oGc-Nzf4Pm0Mgpt8z3Q":{"text":"Awesome experience for brunch!! We sat at the bar with Quinn and he was fabulous!! Don't m","useful":4,"cool":5},"3fWbegqF_CA0P3hVNgdaOA":{"text":"This is my request as my last meal before I die ... anything out of Nina's kitchen. \nHands","useful":3,"cool":2},"LFrVI2aGl1bo-cF7PcPB_g":{"text":"This was an absolutely amazing dinner. The biscuits and hush puppies were absolutely fanta","useful":0,"cool":0},"T4IK_DLHPYmPS_7izo12lg":{"text":"The Beet salad is a fav! The goat is to die for! And, as ridiculous as this may sound...yo","useful":3,"cool":2},"iEGPVR1K5H_wCcE8zxVuvQ":{"text":"This place was great! The atmosphere is sophisticated but modern, connected to a hotel. Th","useful":1,"cool":0},"jopZ4Q0W6GkJEqB9dWAk5w":{"text":"Lovely classy space with great light in main dining area for lunch/brunch. Took a longer t","useful":0,"cool":0},"wkSmWIgGbJ7TJhceNOJSTg":{"text":"I am a bit sad to have to write less than a stellar review. I had a great lunch in the pas","useful":0,"cool":0},"DP2Le5LnsTOwbWjVES-p6Q":{"text":"Well the food is AMAZING! Who knew Seafood Pepper Pot would have a hint of Amaretto! Loved","useful":0,"cool":0},"lrIui0B7_ZsqX8BUqvMvFA":{"text":"This was our 2nd visit to this award winning restaurant. The food most definitely lived up","useful":0,"cool":0},"fMlLZkDB8S4c2HN5iPs3pg":{"text":"The best pina colada I've ever had. Pineapple-y, coconut-y, and creamy. Don't knock it jus","useful":2,"cool":0},"eeDwVknlDT-tInVI4hRmTQ":{"text":"Spent a wonderful Saturday evening here for my bachelor party.\n\nWhat we had:\n\n- Biscuits: ","useful":0,"cool":0},"qvJ0DgQLbYNYrtcIVbiYEQ":{"text":"At first glance this is a very upscale hotel restaurant. Our friends had a reservation and","useful":2,"cool":2},"-izAQsAXHcBKft6FnXQuKw":{"text":"Recommend! This place is trendy, modern, clean, yet authentic. The food is delicious. \nThe","useful":1,"cool":1},"adK4Gii_Ya6LKaudEgI9yQ":{"text":"Cool place.  Interesting food parings.  The bacon butter is a must.  Service was very frie","useful":0,"cool":0},"qewGNblaeqsEHgNSpPj-Tg":{"text":"We were so excited to come to Compère Lapin for my bachelorette dinner and made a reservat","useful":0,"cool":0},"ub9tE5MEFJygOx8NymWqAQ":{"text":"So i'm going to start by saying the food was phenomenal, but i'm knocking off two stars fo","useful":0,"cool":0},"NafPhq_uD0fZ8LsQK7rA0Q":{"text":"It was tough narrowing down our dinner options in NOLA and Compere Lapin was one of the fe","useful":1,"cool":2},"uMsEOAaiXeTLBqGKg_AzxQ":{"text":"We ate there for Thanksgiving dinner, and each course was phenomenal! Went back the next n","useful":0,"cool":0},"3x2fsDfIjrFFvAORgXpSqw":{"text":"I had high expectations but the food or service did not live up to it.  I  Every course wa","useful":0,"cool":0},"X5MdfylsR-ey8NgaZi609Q":{"text":"First off, amazing cocktails and service by James and Deborah. Try the mixed rye/cognac sa","useful":2,"cool":1},"PAaosVFRdsOGAPE9ROUXAg":{"text":"It's hard to review a place when you have great food and terrible service.  The food was s","useful":1,"cool":1},"ZexEpGvzgiGWqQXBuyr7xA":{"text":"One of the most disappointing dining experiences I've ever had. Compared to other reviews,","useful":5,"cool":2},"UxpnDlHJBmRxUkMT6oht8A":{"text":"Every time I've eaten here, the food is top notch. The bread and butters are always delici","useful":3,"cool":1},"3wgjTa9ZfAaF5l5srhgV4Q":{"text":"We stayed at the Old No. 77 Hotel and didn't want to go far for some drinks and appetizers","useful":1,"cool":1},"WnqHNRklJASF8tNdV1lsHw":{"text":"Beautiful first restaurant to visit the night we flew in from San Diego. Great service. Ch","useful":3,"cool":3},"6o9nHpnAHooLEuhan8q5KQ":{"text":"Great little out of the way spot.  Lets start with the cocktails.  Drinks are great I have","useful":1,"cool":0},"HbuEozeUyL2569zwp4BA3Q":{"text":"Always a great time at Compere Lapin. Excellent service and everything we ordered was deli","useful":2,"cool":0}}