{"XsXAeyCgocWZC56qJGNYSg":{"text":"So on our last night in New Orleans we really wanted an awesome meal. \n\nWe had eaten at so","useful":1,"cool":0},"kOMPLf3DZRIeFKjMoHpEwA":{"text":"If there is one meal in New Orleans worth splurging on, it's Restaurant August.  Chef Besh","useful":5,"cool":3},"n5bfroiEjMlbqcQtTFqTEA":{"text":"true old school new orleans fine dining, world class service, celebrity chef, james beard ","useful":0,"cool":0},"2O3AuhHHnP6Ug6yJtfpjbQ":{"text":"What a beautiful dining experience to be had at August!  Check it:\n\nLove: Frisee Salad wit","useful":1,"cool":0},"28qbN3yp29FDbkBhe6SJYQ":{"text":"Overall 4.5 stars, bumped it up instead of down. \n\nService: was great at the tables, the b","useful":0,"cool":0},"swl6rBglsowPKoOhtW1r4A":{"text":"What a spectacular dining experience.  The ambiance, service, and especially the food were","useful":0,"cool":0},"6PfXeofyeSInNK27LOorYQ":{"text":"Wonderful. I was looking forward to this meal and it did not disappoint. We walked in on a","useful":1,"cool":0},"1Nn8XRaY7Ei7dR5j67cDBQ":{"text":"Went with my wife in March of 2011. Thoroughly enjoyed the \"degustation\" (tasting menu). T","useful":0,"cool":0},"MP3C4RTTl7oUGzzq-m8uGQ":{"text":"Excellent meal with spectacular service.  My wife had the vegetarian tasting menu with the","useful":0,"cool":0},"HcGgfoD9dIuaJHcihTT6Rw":{"text":"What an amazing meal! Started with trio of foie gras and moved onto duck more foie gras. T","useful":0,"cool":0},"-t8kQG2sSmcCCRePNOj5Jg":{"text":"This place is beautiful inside! Very upscale and dressy. \nDinner: The royal red shrimp & c","useful":0,"cool":0},"PpNIKbbpRdUSYpoFXQXu9g":{"text":"Wonderful evening at August! Fabulous food in a beautiful atmosphere. First time there and","useful":0,"cool":0},"HsHRXGRKpzSmjeW_4Q4BVw":{"text":"Wonderful experience!\nSteep pricing ( but appropriate ) for a fine meal.\nTry the economy l","useful":1,"cool":0},"YGFZF0KFYXObHUzq_NFSog":{"text":"Life is short and you have to make Restaurant August a New Orleans Destination!!!  Amazing","useful":0,"cool":0},"zjivUsZathcGKFeUfCw3fw":{"text":"Our favorite dinner from a recent trip. Everything was perfection - and actually less expe","useful":0,"cool":0},"sGQsMB0KvhUE7lraF2FaCg":{"text":"One of the overall best meals I've had in a long time. I love duck, and thought mine was c","useful":0,"cool":0},"gY7AQbdObn50rA7uJznXxw":{"text":"Great place and great experience. Service is 5 star. a bit expensive but good food and ser","useful":0,"cool":0},"Pc0VfLwop1sH2snLTcGLgw":{"text":"This was my 2nd time eating at August and once again it did not disappoint. The gnocchi is","useful":0,"cool":0},"lwSu6ButIqsfyPlzZK892g":{"text":"We tried the tasting menu with paired wine. Everything was mind blowing delicious and the ","useful":0,"cool":0},"VlRGiGqxzzOtSrEjaP4yJw":{"text":"We had dinner here the other night after hearing some pretty fantastic feedback from local","useful":4,"cool":3},"W6KfmUhm7jQHbmmc1k-Gcg":{"text":"My boyfriend took me here for my birthday. The ambiance of the restaurant is nice, but ser","useful":0,"cool":0},"cnzMsHeE3ISa5a0i5dCJlw":{"text":"The gnocchi was PHENOMENAL. The only reason it doesn't get 5 stars in my book is because I","useful":0,"cool":0},"oO-zPGnSILkNsvidRfB_uA":{"text":"If dessert is any prediction of what a meal here could be like, you'll need to find room f","useful":0,"cool":0},"3l99W7iQ6PCf1UD27H9Tlw":{"text":"A sublime dining experience. We brought our three children, and they were extremely accomm","useful":0,"cool":0},"Pt4fwDtxeac84ZBTzHIQNQ":{"text":"My husband and I had dinner here a couple of weeks ago, and it was everything we thought i","useful":1,"cool":0},"hsS4v8cdgMK9VUe9A23oOQ":{"text":"My wife and I had a lovely lunch at Restaurant August today.  The $20.11 price fixed lunch","useful":0,"cool":0},"O-sHw4RUvxz5T5Q4yzA7VQ":{"text":"We went for the prixe fixe lunch- what a great deal! We had an amazingly attentive waiter ","useful":0,"cool":0},"Ks_oneMhnlbXibYl2PMW5w":{"text":"Such a nice experience for farm to table dining in Nola. I'm vegan but chef was able to re","useful":0,"cool":0},"laJnuQd62UR9qhj6aNrkvQ":{"text":"We are staying at the Windsor Court Hotel and decided to try August for lunch upon the rec","useful":2,"cool":0},"k4OJcUsAK-CIsWOMSrssGg":{"text":"We had a prix fixe lunch here and it was very good. We didn't get the chance for dinner bu","useful":1,"cool":0},"82UkPiFCmPwHh3y3u79nTg":{"text":"We were traveling to NOLA to celebrate our wedding anniversary, and Restaurant August was ","useful":1,"cool":2},"2oTKK2daTa9jNMw8PNCIeA":{"text":"A Yelp friend received this restaurant as a recommendation.  We ordered several plates to ","useful":0,"cool":0},"buDfBPkPmuX907Ou8H8sPg":{"text":"Restaurant August benefits from the famed chef, John Besh, and its beautiful location with","useful":1,"cool":0},"GhRNjMJcC0XFYkezi6_IoQ":{"text":"I was sitting at the bar so I'm not sure how was the service in the main dining room, but ","useful":2,"cool":1},"1mbqpaI6z1EwH7eQjGq6Aw":{"text":"Every meal here has been nothing short of amazing...from the food, to the waitstaff, to th","useful":0,"cool":0},"7XXrNxm6VAv98S4APEv1FQ":{"text":"chef John Besh creates some awesome dishes. full of flavor but with delicate precision.  h","useful":0,"cool":0},"U3d8KjDQrJ9i_3v8jR3Dnw":{"text":"Highly recommend! The food is exquisite but the restaurant isn't stuffy at all. We went in","useful":0,"cool":0},"SjHFT8yevu0fjOH9cmUK2g":{"text":"Had dinner there this past Sunday for our 10th anniversary.  One of the best dining and ea","useful":0,"cool":0},"Jfk-m2LRYa3OOZpm1r3F4g":{"text":"Eh.  I don't know about this place.  The decor is nice, warm and inviting but I came here ","useful":0,"cool":0},"EXf3y5dtZQGaZXok4ONHQA":{"text":"I was seriously disappointed with this restaurant. The front door staff was nice and seate","useful":1,"cool":0},"Cy_1bJtLIiBTHte4R0DNHA":{"text":"World class dining on par with any 3 star Michelin restaurants you will ever fall into. Im","useful":1,"cool":0},"Q_PIjcnEU7_GnGsbzHaKbw":{"text":"My fiance and I got a reservation a month in advance for our Holiday trip to NOLA.  I had ","useful":0,"cool":0},"UHRTkMTxaREHSh8hR9eFOA":{"text":"Had high hopes for this place, as heard nothing but good things about the food & service. ","useful":1,"cool":0},"lhUJzhNCFILxQzFMdbpDgQ":{"text":"By far the best meal we had in New Orleans - probably in our entire NOLA history of visits","useful":16,"cool":9},"CVemRd8BxVrx-I1YWeuwrA":{"text":"We chose this restaurant since we had such a great dining experience at one of John Besh's","useful":2,"cool":2},"EXexB4eNhZOdfNhDylRaAA":{"text":"Had an early dinner tonight, alone.  Restaurant August lived up to my expectations.  This ","useful":2,"cool":0},"Ij9cFuX0EdfMIPqEoJFaow":{"text":"Service is impeccable.  Was not a fan of the food - with the exception of the amazing bana","useful":0,"cool":0},"CfEWW6zxqMqaqSr1gEeAYQ":{"text":"I had very high expectation before coming to dine here. It was definitely a very memorable","useful":0,"cool":0},"LbpUD4T796eH3H3TKCjg4g":{"text":"Friday lunch is a must here; be sure to make reservations far in advance unless you can ge","useful":0,"cool":0},"W1SliKAobTLQPjVUYBCdbg":{"text":"Restaurant August, from James Beard award-winning chef, John Besh is a swanky eatery that'","useful":1,"cool":1},"uLzl_rbMokHBYFwXtCKNYQ":{"text":"I have eaten at Michelin star restaurants all over the world and I can sincerely say this ","useful":0,"cool":0},"i_eUa5Sc0epBAyJI3icceQ":{"text":"Good taste and service. \n\nThe cookies in the end is a bit too sweet but everything else is","useful":0,"cool":0},"uO9aj0FCFUTiFvzRi8R5-Q":{"text":"This was the best meal in New Orleans for us. We had early reservations and were seated qu","useful":0,"cool":0},"MZkj2LG5vuh25i0_iZ7fDg":{"text":"Wellllll I'm going to start by saying that this review is going to be very biased, but sti","useful":1,"cool":1},"EvBTooBYEQ6LHMW9XILIiw":{"text":"This was the ultimate dining experience, and probably THE BEST I have ever had. Do the deg","useful":0,"cool":0},"TYSPN00REdpd-7kgPPosZg":{"text":"Divine food and superb service. It was definitely a splurge, but the meal was well worth i","useful":0,"cool":0},"9dsU6GMMhoBNW1wArskbXA":{"text":"Verdict - beautiful restaurant, exciting food and great service.\n\nWe went to Restaurant Au","useful":0,"cool":0},"GsNoWDZgA8JrxsMDRo9xtw":{"text":"My friend and I dropped in at Restaurant August right before an hour long rain pour. For $","useful":0,"cool":0},"L-2IFMNrv_1-3wEWl5vTog":{"text":"This is by far the best restaurant in America. I love the space and I love the way JB has ","useful":0,"cool":0},"DOw5XG4HVgudV1C5Gjjilw":{"text":"Best food and service in town.  Waiter Mark was very informative about all the dishes and ","useful":0,"cool":0},"L0gTv52f2ITjOQlWxiA5cQ":{"text":"What an experience.  The service makes you feel like you're their only client. Drop a piec","useful":0,"cool":0},"LujqKr_ByW_5ifBLoIHytg":{"text":"Everything about our dinner was perfect from start to finish. Food was delicious and well ","useful":0,"cool":0},"8TWejg07jckwe2a5P_sNSg":{"text":"I knew that most of my trip to NOLA would be consumed with consuming traditional NOLA food","useful":1,"cool":1},"ctddrbMQNB3VkNecjkriLQ":{"text":"This was one of the best restaurant experiences I have had.   It's a very modern take on t","useful":0,"cool":0},"sfgI8VJnJuQfVwboT-VdfQ":{"text":"We had to wait a bit even with a reservation but the drink list was great. I enjoyed a Hem","useful":0,"cool":0},"kdFgOADBA_GGeyooOv01nA":{"text":"i was here on a 4 day business trip.  as a rule, i never go to the same place twice on sho","useful":2,"cool":0},"-VbJk2gUw9jtumYCHeECZA":{"text":"I thought the food here was good but not great for the price it commanded. I didn't care f","useful":0,"cool":0},"MlXKbqUifrvdXpbw0xMCOw":{"text":"So terribly disappointed.  We felt rushed, I barely finished my appetizer when my entree c","useful":1,"cool":0},"45znjoDpkcMBfLZMCMRCZw":{"text":"My name is Angela C. and I have a culinary crush on John Besh. \n\nThere, I said it. It star","useful":3,"cool":4},"Sa4T6qVNIGoHL7rKaufV8Q":{"text":"Absolutely excellent. Every dish done perfectly: both delicious and beautifully presented.","useful":0,"cool":0},"L4UkppngDK9AAbaaLzmyvw":{"text":"I know this is a favorited spot for lots of people and has a reputation for impeccable qua","useful":0,"cool":0},"eFz6aLK-khHB4h7QZREtjw":{"text":"First off, I want everyone to know that the two stars are for the service, otherwise I wou","useful":1,"cool":0},"_bQrRLUnsK-dQCCATu4Q-w":{"text":"We came here to celebrate our 15th anniversary and we enjoyed every moment of it.\nThe food","useful":0,"cool":0},"E-yU-cyOp71-YTkR8OFEgQ":{"text":"Oh, August. You've ruined me. The meal I had here makes all other fine dining establishmen","useful":9,"cool":8},"goks-AijSWsExLBu491jbw":{"text":"The food the atmosphere the staff five star! Wow... And yummy is a starting place when it ","useful":0,"cool":0},"eEJf2FLi9lUAAgfszCmgQg":{"text":"I was treated to Restuarant August for lunch this week and it was devine! From the food, t","useful":1,"cool":1},"lrx2eV_rzTCAorcgZhkjwg":{"text":"Nothin short of amazing.  The meal was great and the service was even better.  We will def","useful":0,"cool":0},"zitgBydCBo5mHd8a-kxVAA":{"text":"Absolutely amazing experience! Wow. Where do I start? \n\nThe restaurant is absolutely gorge","useful":1,"cool":0},"YUvzWk4lOzLt7mdcLwn0mw":{"text":"This place is actually 3 1/2 for me.\n\nI need to stop having high expectations... maybe I'l","useful":2,"cool":1},"hJDYvwr3IS8RkVs8eQ9kyg":{"text":"As soon as I was aware my work was sending me to New Orleans for several days, I knew I ha","useful":2,"cool":0},"Yg7T2QBB4OLKqSS10vRzIg":{"text":"Go for the lunch deal.  Excellent food, reasonable portions and great atmosphere. They're ","useful":0,"cool":0},"dIYWuoIdW4f0SnA_M-pi8A":{"text":"I went to august on a quick lunch referred by my friend. The waiter offered me to have pri","useful":0,"cool":0},"tjXk1ctiB77JlvmGH01-rw":{"text":"If u look up yummy in the dictionary, u will find a picture of this restaurant. Service wa","useful":0,"cool":0},"ydrrr_14IF8AF7fKkPlbLQ":{"text":"We came in for lunch on Friday. Someone told us about their Prix Fixe friday lunch menu wh","useful":0,"cool":0},"sKEaTpepTNqDhzE9Hl_bCg":{"text":"So we thought service was great, ambiance was great, but the food was over the top. We cam","useful":1,"cool":0},"TMWOr58UUechfuxIlY2ybw":{"text":"What a great food and atmosphere. I got gnocchi for my appetizer and a baked oyster main c","useful":2,"cool":2},"a8UKSfA25iv0fnANc3UowA":{"text":"What can I say that has not already been said by myself or another 10000 people. That was ","useful":0,"cool":0},"vGoOi_YsnrNKp0F5MxSd7w":{"text":"We had an amazing dinner here - August lived up to the hype!\n\nWe started with the cocktail","useful":1,"cool":0},"_Axpcot9GzIsR8VNLi1ONQ":{"text":"August it's definitly worth it! They were atentive, welcoming and the food was just delici","useful":0,"cool":0},"oVZevPN7UVnhAUf23Juz0Q":{"text":"Wow!  My family was in New Orleans on vacation.  Walking back from the World War II museum","useful":0,"cool":0},"VhgiR6D19WG6LbQ6dE6M1g":{"text":"This was our 2nd visit to August, our last being the precious summer. The good, ambience, ","useful":0,"cool":0},"YSTE1BkrXrbGh3Cd6s4Qkg":{"text":"This place was amazing. Not only was the service impeccable, but the food was more than my","useful":0,"cool":1},"Uzks1Fc4z1RcUk0dj_lXwA":{"text":"For our last night in town, we decided to stick to a restaurant closer to where we were st","useful":0,"cool":0},"RB4yPd9VO1QKlyrI534PdQ":{"text":"Not really sure if John Besh has anything to do with his signature restaurant, but if he i","useful":0,"cool":0},"7H_e6LPWQz2Qo2cM5Stn9g":{"text":"Ate here with my boyfriend as kind of an early birthday dinner/gift.  It. Was. Spectacular","useful":1,"cool":0},"cDbiJfkLfBSpaKNxuhaBKQ":{"text":"Traveling to NOLA from Boston as a vegetarian was at first a bit daunting, as the city's l","useful":1,"cool":1},"Im0oCI5Xs-60t8RCMRYqZQ":{"text":"Top notch, very professional and curtious wait staff!! I had the lamb and it was outstandi","useful":0,"cool":0},"bL0S0GnUwanBnH9YZpWQNg":{"text":"Our first dinner was an early one at Restaurant August which was around the corner from ou","useful":0,"cool":0},"V8LG8eFAhZdsnO11Q5ydKA":{"text":"One of the best meals of our lives! \n\nWe got an awesome deal in the lunch special (it was ","useful":0,"cool":0},"1ih9UONHNPu_LpfJqlzprg":{"text":"From soup to nuts, an unforgettable meal. The $20.12 lunch prix fixe is a steal at twice t","useful":1,"cool":1},"asZYrW9bh9FgIIJH4WN0Wg":{"text":"Had a reservation at 9:45 so we couldn't resist and had oysters again at Felix around 6pm.","useful":0,"cool":0},"lX62xk4vGTVBz-rxPPd3rQ":{"text":"Our whole table did the 9 course - not on the menu - tasting dinner with wine pairings and","useful":0,"cool":0},"UCjnUeyje4PYZTmbtoco0g":{"text":"Delish. Started with two-amuse bouches. Proceeded to eat much more. I can't seem to rememb","useful":0,"cool":0},"qiCbvxmLnBLtPIjt7yHjUg":{"text":"Stopped in here on my first visit to New Orleans on the recommendation of some colleagues ","useful":2,"cool":0},"es_jsEcJiuVUFAf-FV5hlg":{"text":"One of the best meals I have ever eaten. Atmosphere. Price. Presentation. Taste. \n\nWe had ","useful":1,"cool":1},"DPEMZH0_cS7SuToD3VQkwA":{"text":"Wonderful dinner with fantastic service. Would recommend Restaurant August to anyone visit","useful":0,"cool":0},"oF71s1JGtAZiSOXF_WjoHQ":{"text":"Very good restaurant. Servers were knowledgeable but a little stiff. Gnocchi with blue cra","useful":0,"cool":0},"cxkikJvC3-i0AkljzXsHtQ":{"text":"A bit over rated and pretentious.  The food was good, rich and tasted somewhat processed (","useful":1,"cool":0},"TXFyZ2ewDR3x7ijkJYFwyQ":{"text":"Dined there with friends 3Nov08.\n\n\n Has a large but rather dark bar at the entrance, from ","useful":0,"cool":0},"9MNA7hBjoTLShjq3dqXQtA":{"text":"Yea this was the best restaurant that we visited in NOLA! \n\nWe didn't do the tasting menu ","useful":2,"cool":2},"TRoWv-8oE3jy3QQRWqm2EA":{"text":"Absolutely a 5-star experience from beginning to end. I was visiting New Orleans with a fr","useful":2,"cool":1},"pYGnkl8DaoWlp8ut1E-YOA":{"text":"Located across the street from the Windsor Court Hotel. Upon entering the restaurant, we w","useful":1,"cool":0},"E4pn2pwoZXXAkvFRYQ423A":{"text":"Finally a place that meets expectations. There is so much buzz about the culinary experien","useful":1,"cool":1},"dowMjnj5OWf1r3Q2boHr3g":{"text":"Beautiful building, amazing food, and a generous staff made our evening extra special. We ","useful":0,"cool":0},"t1DVzCi8CwhgbujtJyIvuw":{"text":"Obligatory one star.\n\nI ate here once with my mister a couple of years ago when we were yo","useful":2,"cool":1},"ED2GI5yk5LTZFKnIiMksKw":{"text":"This is my favorite place in New Orleans!! Great French dinner with foie gras which prepar","useful":0,"cool":0},"ZaeXPTgD3UZ624Vhdrznlw":{"text":"We went for my birthday and were treated like royalty!  Plus everything we ate was fantast","useful":1,"cool":1},"Kn5b6AFrgLRWbodCYh4Wtg":{"text":"In town for one night, I decided to check out Restaurant August after reading many people'","useful":0,"cool":1},"AVxNdAbxmFBh_NLgFTe0IQ":{"text":"Went for the prix fix lunch. Portions small, but very tasty. Was hoping to be blown over, ","useful":0,"cool":0},"_Iga6r8YaRCB7loSUJvCJw":{"text":"Restaurant August was very good, but missed \"great\".  I must say that the staff did an out","useful":1,"cool":1},"yS1VtIjObBZXXB4pzj5eFA":{"text":"Lunch Special!!!!!!!!!!!!!!!\n\n$20.12 for a 3 course meal! \n\nRestaurant August's lunch spec","useful":6,"cool":3},"PzgxRVYdbU_kG5a7GV9kdQ":{"text":"Not sure what the big fuss is about August.  It was the worst dining experience in New Orl","useful":3,"cool":0},"4MMS8hidgnEeZX-pTvMTAg":{"text":"Coming back to New Orleans this year, we knew we wanted to make August a return visit & we","useful":14,"cool":13},"nt1-5rWkTSY8CuwvEm2_5w":{"text":"From the attentive and friendly service, the knowledgeable and engaging sommelier, to the ","useful":0,"cool":0},"wqx5XxCLzPjbEXJabruRJw":{"text":"August is a delight. In many ways, it is near perfect. The gnocchi is about the best you w","useful":0,"cool":0},"78Mr6Oxq1n5qZAgc8uiR6A":{"text":"Rather than spend another $20 at a chain restaurant, mall food court or overpriced poboy s","useful":1,"cool":1},"CV7tm2_CIKDJeCxIYHM6Ug":{"text":"August is the BEST French restaurant I've been to, outside of France. They start you with ","useful":0,"cool":0},"zP5XWxB4EdC2z8bZ70tEhA":{"text":"We were able to stop here for a lunch one Friday, and after that experience I'd recommend ","useful":0,"cool":1},"sQuyk0OnBFHyOyVlXf6twA":{"text":"One of the very finest restaurants in NOLA.  Both my wife and I ordered the tasting menus ","useful":1,"cool":0},"ViurSMYTautgVLiwhtye3Q":{"text":"This review is for LUNCH.\n\nStopped in for the prix fixe lunch at August, and boy was I imp","useful":4,"cool":2},"BOQr3ZUFOidO3LTI2_akUg":{"text":"One of the best lunches I have EVER had and what a smoking deal - $20.11 - really?\n\nServic","useful":0,"cool":0},"SIu-6dORbgemsL8lYy1XpA":{"text":"Zeke and Jackie took excellent care of us for dinner. The duckling was light & phenomenal.","useful":1,"cool":1},"fuVWzfUV7cGMYmrCqm3BNA":{"text":"Managed to squeeze in here for a late-ish dinner while it was carnival season.  Nothing li","useful":0,"cool":0},"QVW5F7DEOK4yeoANzq1tJw":{"text":"This place gets five stars for menu, creativeness, atmosphere, outstanding service, and so","useful":0,"cool":0},"yTO9C7AqASPNvxm1IxYfZQ":{"text":"August was a destination restaurant for me while I was in NOLA. I was determined to go to ","useful":0,"cool":0},"szRhU335f356S8KXaiEo-w":{"text":"for the price .. no thanks.\ni have a feeling John Besh has never set foot in the place.\n1.","useful":0,"cool":0},"lwZZx9tRjhLY10z5PBPVUw":{"text":"Every visit is an experience in fine dining. Dress up, feel like a million bucks. Taste ex","useful":1,"cool":0},"Smg_GXwhqt9A1UVxIvO7Uw":{"text":"I've always been a fan of Besh's work, so I had to go to his flagship.  The place has grea","useful":1,"cool":0},"NpsiBX5VOkGqiyAYjP0Kew":{"text":"I had high hopes for this place because of the reviews. When we had called the restaurant,","useful":0,"cool":0},"5RJrpIuhixP-lgev0lz4mA":{"text":"We arrived fashionably late, despite the kitchen closing at 10. We were treated like royal","useful":0,"cool":0},"6FAl7gJLjteQnHGmA4MXbg":{"text":"Exceptional. The food and service were outstanding. The hanger steak was literally melt in","useful":0,"cool":0},"3CAvkCZKc_asnGyoO-eJyA":{"text":"Loved it. Portions were perfect so I wasn't stuffed by the end of the night. Ambience was ","useful":0,"cool":0},"7gbASCQNgZHkDmGqSGOKqw":{"text":"Perfection!!! From the moment we arrived to the moment we left! Food, service & ambiance w","useful":0,"cool":0},"c4MU0qZGXXH-HnyTiwTa_g":{"text":"During my most recent visit to New Orleans I've heard about the famous chef John Besh and ","useful":1,"cool":1},"0uI8wsEF6wveeU0YujItlw":{"text":"Awesome restaurant: great decor, great ambiance and a wonderful menu. Some of the best fla","useful":0,"cool":0},"bYfyp5NPxGnnsoshtSBDfg":{"text":"My husband and I spent some time in New Orleans recently and our meal at Restaurant August","useful":1,"cool":0},"r0pn6w_X07ks_b5_URHNtg":{"text":"This was my first time visiting August. I have dined at similiar places and have been let ","useful":0,"cool":0},"t7ZBNLa6r63I-wExX_vyQQ":{"text":"I should have known better when I saw the chef had sold out with Besh Steakhouse in the du","useful":2,"cool":0},"E3i-E8D2YZW9cVFHHO5YYA":{"text":"With all the attention August has been receiving in the press, perhaps my expectations wer","useful":1,"cool":0},"EMxQL-8QjpvJrfdfzdqbpg":{"text":"The second best restaurant I've ever eaten at. Steak was incredible. The atmosphere is per","useful":0,"cool":0},"aIahV3Qvn9C3uYFDTHmT1Q":{"text":"I coulda swore I wrote a review for this place already but I can't find it. I went in Nov ","useful":0,"cool":0},"IvaVj5so_FfFByClWRVe7w":{"text":"TALENTED CHEF, BEAUTIFUL ROOMS\n\nThe problem I have with many restaurants is that everythin","useful":1,"cool":0},"nakOEq-leXKcgfQeBliLhw":{"text":"Had a great brunch here - got my sister, the chef- the cookbook from here.  Modern, fun th","useful":1,"cool":1},"iXhotSP0zzhY3s7bjxtBpw":{"text":"Excellent food, great service. Save room for dessert.","useful":0,"cool":0},"XJbELxoYjjrdsIU1KnJFkA":{"text":"I have absolutely NO hesitation giving this restaurant a solid 5 stars!\n\nBefore going to N","useful":2,"cool":1},"_cYQV0hFf5oIIAUxephn4A":{"text":"Def on my list of favorite places I've been down here in NOLA.\n\nCame here solo at around 5","useful":3,"cool":1},"dzw2Y31Q-XjAwcB-RXPqlQ":{"text":"Second time at August separated by 5 years (we don't live in NO). Second time was not the ","useful":0,"cool":0},"HHk8rARJC9wMsHpzHKAJZQ":{"text":"This was our 2nd time trying out lunch at Restaurant August.  We love the prix fixe 3 cour","useful":2,"cool":0},"o1YcER9ztRyIgYIdYFcmyg":{"text":"Top 10 restaurant at which I have eaten.  Creative, flavorful. Gnocchi with truffles and \"","useful":1,"cool":1},"7YR6gQS0Bb3oRV9r3AqHLQ":{"text":"My husband and I hadn't planned on eating here while in NOLA, but his boss had reservation","useful":0,"cool":0},"c2ql-TUuc-8d7LGSLt4Zmw":{"text":"A true foodies restaurant. \n\nFrom the service to the menu - everything is thought out and ","useful":1,"cool":0},"Z2SJosfOiS5UWEwHY3ocUA":{"text":"I have died and gone to August heaven! Oh my gosh... Saying the food is amazing is an unde","useful":0,"cool":0},"YkT-YX9rt4GYx8SI-_3T_w":{"text":"Food was amazing- service was impeccable- worth the price. Tried the foie gras three ways ","useful":0,"cool":0},"7VjEd8Z5bF0u9QqFJEeX8A":{"text":"Going to the Friday prix fixe lunch ($20.13...WHAT?) is liable to be the best decision you","useful":2,"cool":1},"I9eMf7RUrSOXkK-JgQEXiw":{"text":"Beautiful and elegant restaurant in NOLA serving up delicious food.  The waiter was friend","useful":0,"cool":0},"nqs8BbJSAa-hcn4CiR9nqg":{"text":"Excellent food.  If you're not a seafood eater, try the pork.  It was delicious!   As an a","useful":0,"cool":0},"4GrHAZR9C0LzFTHYnHFpEA":{"text":"The chef is wonderful, BUT AVOID WAITER CHRIS.  Elegantly dressed, we arrived on time for ","useful":1,"cool":0},"YCNs2I6MXjPoe_SuHdr97g":{"text":"On our last night at NOLA, we decided to try something nice and after reviewing many place","useful":0,"cool":0},"mxRqJkRzbrP5mIB_U7pRwA":{"text":"If the rating was for service and ambience then this place would be hall of fame, but the ","useful":0,"cool":0},"Vz60318OLPa_TwbN6hyV1w":{"text":"I will keep this short and simple - the food was amazing and this was the best meal I've e","useful":0,"cool":0},"83QrM6yg8armWyIr7IxbRw":{"text":"John Besh, will you have my food baby?!\n\nValerie G. found this absolute GEM in NOLA and ma","useful":2,"cool":2},"CuyflhLuV6ozmDEOjfrmsw":{"text":"EVERYTHING we ate was AMAZINg!  The squash and crab bisque was to die for!  I could have e","useful":0,"cool":0},"zo8BaAgKbt4Fj_1sf-Z7Iw":{"text":"Absolutely everything we had there was fantastic.  We started off with the crab tart, frie","useful":0,"cool":0},"uiNgA3HpFLtwMhvZzJE1kA":{"text":"Amazing!  We took our three adult children for a celebration and it was the best!","useful":0,"cool":0},"FdjrNtOhGuWuduVOGD8LSg":{"text":"I have never had a better experience at a restaurant!! It was hands down the best service ","useful":0,"cool":0},"OYDnNiYFVPraoPeAbT7Z5g":{"text":"All the dishes I had are very nice. The duck breasts and beef strip are particularly nice.","useful":0,"cool":0},"K4N_GPbVZfbOWvqoxlQZcQ":{"text":"We ate here for a celebratory dinner with friends.  At any given time, I was unsure of wha","useful":0,"cool":0},"4r-sDmweC99g4fNeXKevpQ":{"text":"I couldn't agree more with the review below me. This place is a class act. The chef has so","useful":0,"cool":0},"mgnMHptctbRzXAgslXOzIA":{"text":"Our meal was lovely.  The short ribs practically melted in your mouth and they were very a","useful":0,"cool":0},"1TqCfoGjgrRwvLC6E2R2jw":{"text":"Yukon gold potato gnocchi tossed with lump crab and black truffles\nPate de Campagne/Salad ","useful":2,"cool":0},"ZWWbX0rJeFXQZySTuJNFiQ":{"text":"Service was excellent.  From the moment we walked in the door we were greeted cheerfully, ","useful":0,"cool":0},"JUwHkjLoLE7_MaXM7jMB2g":{"text":"Wow, was this place delicious. The food was fantastic, service was wonderful and we were h","useful":0,"cool":0},"fCSwpEvRim0clbDbRyJq1w":{"text":"Excellent experience--food, service, wine, company. I called ahead of time to ask if vegan","useful":2,"cool":1},"DhOOcjxWhu-3fxWf6UgAvA":{"text":"I've heard so many wonderful things about this place, too bad it wasn't true.\nThey is no v","useful":0,"cool":0},"5Cv0xrk-pjWpcw2lmSoTIg":{"text":"My wife had the veggie tasting menu and I had the gnocchi app and flounder, accompanied by","useful":0,"cool":0},"fydjlvFncuQp-ztW0rii1Q":{"text":"This is the kind of restaurant that you want to visit year round to take advantage of the ","useful":0,"cool":0},"mqbIDuDzkGYL8ihXB9savQ":{"text":"If you are around the area and want some awesome food and service just walk into August. Y","useful":0,"cool":0},"jd9AOYiIO6oSKSDkwJbltw":{"text":"Best vegetarian Prix Fixe yet, and I've had several, mostly in Chicago at Green Zebra. Thi","useful":2,"cool":1},"OLrd-eQRkPEXjZ4pzLNgLw":{"text":"Sublime.  I haven't had anything this good since eating at Charlie Trotter's in Chicago.  ","useful":1,"cool":0},"wX6QrlbxYlbIRP3v4yAEEg":{"text":"Livin' up to the hype\n\nBrent and I were fortunate enough to have our first experience at J","useful":4,"cool":0},"9NRmw4n4CJcBDtDZCsUm6w":{"text":"Best meal of my life to date. Everything cooked to perfection, creative and looking forwar","useful":0,"cool":0},"8sCaUb59W7D5U-B5hJ3s8Q":{"text":"Was really looking forward to our dinner here and sadly was very disappointed.  The food w","useful":0,"cool":0},"uvRTbrifQLVWe_ultDd12Q":{"text":"this place is perfect, food is delicious, wait staff is proffessional. i love the brick wa","useful":0,"cool":0},"hbXk_HDLbNhAVXPf8I_tEw":{"text":"Quite simply one of the best meals I have ever had. Went with a friend and did the four co","useful":0,"cool":0},"YSt-Rrq0lXgOhYlC_SQHjg":{"text":"The very short review, for people with ADD:  best meal I've had.\n\nThe long version for any","useful":0,"cool":0},"cX1OYCwa_rUROWcB0Ra8cg":{"text":"Dined there twice in one week and the food and service are excellent. The last time we had","useful":0,"cool":0},"INlhj5UVkKr2NVXWM9iPrQ":{"text":"It's not quite the French Laundry--but close. The food was impeccable and so was the servi","useful":0,"cool":0},"FprbamIorrTDxcZtRLhOyQ":{"text":"The food are so gooooood. They gave a lot of small dishes for free which are not only cute","useful":1,"cool":0},"N1s1qRq72EJQ_NUMcqhpGw":{"text":"People use the term \"a must\" often on Yelp.  I'll just say that you really, really should.","useful":0,"cool":0},"-KhMvqZcv0hvZMvrzNLB0Q":{"text":"Hands down one of the best meals I have ever had and absolutely the best service I have ev","useful":0,"cool":0},"kINI1a_Er0qxkhfEgyJoMQ":{"text":"Second visit here.  Great experience both times.\n\nThe first time I was here, I was with gi","useful":0,"cool":0},"GyhfN1xwfumcZ3BZqqiBqg":{"text":"5 star hands down!!! Service was perfect, food was beyond excellent! Gnocchi with blue cra","useful":0,"cool":1},"jS_-kc1dglaQvgMBhBeN5A":{"text":"Everything at this restaurant is top notch - the food, the service and the atmosphere. Whi","useful":0,"cool":0},"C3vz1VH6SfbHja8dhbEjSA":{"text":"This is the best restaurant at which  I've ever had a meal. Food is beyond description. Se","useful":0,"cool":0},"24bjTGSsGM7DtwgXfEBvjQ":{"text":"The food here is great, the staff friendly, and the physical space wonderful. We were extr","useful":0,"cool":0},"NE-yHbPRQD_cICDZLc53hQ":{"text":"Restaurant August is becoming a bit \"over-yelped\"; hence, I shall limit the scope of my co","useful":1,"cool":1},"iBDd5gke-P9QM4FaX1pnVw":{"text":"One of the top 5 eating experiences in my life. Arrived with no reservation & told we coul","useful":0,"cool":1},"mToh7KH9IUz8lLXPA4Cv3Q":{"text":"The best dinning experience I've had in New Orleans! The restaurant is beautiful! The serv","useful":0,"cool":0},"gqa525ML9QOVvECjTc6bPw":{"text":"The food here is AWESOME.  John Besh did a great job on the menu in this Restaraunt.  The ","useful":0,"cool":0},"fHC-hyVIBsrkoyz82RMJug":{"text":"August is the best fine (finest) dining restaurant in all of NOLA. Besh and his team, kitc","useful":0,"cool":0},"It8CZcXaoqhxty08QOoDcA":{"text":"To start, we visited immediately attending the Endymion parade, so we felt a tad underdres","useful":1,"cool":1},"EFF_zMAUO9RjyroHLLCh1g":{"text":"I recently had lunch at Restaurant August.  The restaurant is beautiful and the service wa","useful":1,"cool":1},"oYWN2CUcbrPSUCbcgjYSKg":{"text":"There are very few meals, and I mean singular restaurant experiences that are memorable. T","useful":0,"cool":0},"dErBDLeZPnUzn5JSyFmnFw":{"text":"I had been to August once before a few years ago and had what I recall to be a very enjoya","useful":0,"cool":0},"33I1OtDGBykhgzifzJdn5w":{"text":"I chose Augustus for my birthday dinner and was the not disappointed. The food was amazing","useful":1,"cool":1},"5kWYekfkhMIskewZfcRVMA":{"text":"Exceptional.\n\nBased on tasting menu experience in January 2011, guess you can say I am slo","useful":0,"cool":0},"yhleOCC9FgEnraxU-HmHRA":{"text":"What can I say about one of the most memorable meals I've ever eaten?\n\nService was above-a","useful":0,"cool":0},"C_savpn9q9L0UOIFdYWO7w":{"text":"Very similar to the great dining experience we had at Emerils.\n\nThis is a fancy place and ","useful":0,"cool":0},"b4xyLT0zs2dJ5G_5a6X4Vw":{"text":"Restaurant August fulfilled two criteria on my food trip to NOLA.  One was a request to di","useful":3,"cool":1},"QSta3UjudpfV5q4VTiRxcg":{"text":"Oh my YUMMM!    I had the lunch prix fixe menu and my husband did regular menu so we could","useful":3,"cool":1},"5ego8RHY0rYmMoL0qM-HaQ":{"text":"This place is amazing.  Let me start by saying the service here is impeccable and the best","useful":0,"cool":0},"b14Q_oJMF2lODcGQjc69Lw":{"text":"We arrived on time on Friday, and the folks at Restaurant August generously agreed to move","useful":0,"cool":0},"1sWq97SD7AnpE3ba6_7KuQ":{"text":"I try a new restaurant every time I visit New Orleans, and I finally got to August.  I'm s","useful":0,"cool":0},"oKps9ApX0QdZ9MMjUSWoBQ":{"text":"Our dining experience was sublime.  Made all the more memorable by our \"Host\" Robert.  His","useful":0,"cool":0},"eeT5rSAVNT64iQbEnJVE6g":{"text":"Fantastic service and delicious food.  Took advantage of the lunch special, which made thi","useful":0,"cool":0},"d9Je2uDt3z5kQtwMoYekxg":{"text":"Unbelievable. The best meal you'll ever eat, hands down. Service was amazing and the food ","useful":0,"cool":0},"AwGIqh_WdnlJkjMhos-10w":{"text":"The meal and service lived up to our expectations.  The space is lovely and elegant.  The ","useful":0,"cool":0},"9oBOdZlSGPe6JUqo03oMlA":{"text":"Wow. My tastebuds are still thanking me. This was the only place my friend and I reserved ","useful":3,"cool":4},"yjMU4OiDlmpxWv9_rVEFqQ":{"text":"Resturant August was the highlight of our recent trip to New Orleans. One of the best meal","useful":0,"cool":0},"YcOovjVmR5QrAf1DEQLSYQ":{"text":"An amazing meal. We had the degustation menu and it was superb. The wine pairings were abs","useful":0,"cool":0},"B9WfkrBrzkH4NF-half9HQ":{"text":"Since I was traveling for business, without my wife, I decided to try this restaurant base","useful":2,"cool":2},"AuA5IlcRGEx2V2v-9XBmyQ":{"text":"Restaurant August is what fine dining in New Orleans is supposed to be.  The ambience is w","useful":0,"cool":0},"iIuM7jSVFULPcMjM_JiqPQ":{"text":"I am giving Restaurant August a lower rating because I left the restaurant feeling disappo","useful":2,"cool":1},"57jayGzwD3XnO82yoPv6AA":{"text":"I truly believe this is the best fine dining restaurant in the city of New Orleans. I have","useful":0,"cool":0},"ldo9aolC-tyuS3-GeSoSYg":{"text":"Inventive delicious dishes and attentive, professional service. Formal in atmosphere witho","useful":0,"cool":0},"hxUi-EfFU9gdJRb57RxyKA":{"text":"The best dining experiences in New Orleans hands down. From the service, the ambiance, to ","useful":0,"cool":0},"e1WA0YE3JpTg2Zb_lrHKQA":{"text":"I'm from California. I am used to eating in 5 star restaurants in a casual dining room. No","useful":3,"cool":0},"2ZmvKqK43kRRFhhlDp9h5w":{"text":"Awesome food! Had the Duck / Trout, \n\nGreat dishes full of flavor. Also had the crab appet","useful":0,"cool":2},"Y0tgzsFCrMnABQj12mUkbQ":{"text":"I was expecting this to be good, but not THIS good.\n\nThis easily rivaled fine-dining in NY","useful":2,"cool":0},"8pk7pJ7J1y-ISCkW6Yd3Jg":{"text":"My husband and I booked our reservation for August restaurant last week. We arrived late b","useful":0,"cool":0},"Y1QeCagRjXoLQccgeLE7Hg":{"text":"August was amazing. \nWe ordered the four course tasting menu with the wine pairing at $90 ","useful":1,"cool":2},"OMR8br56mA683RTIi1MPUw":{"text":"Restaurant August was absolutely exquisite and one of the best dinners I've ever experienc","useful":1,"cool":0},"iSHID1g_J8HLc_AZGhkdWg":{"text":"As the flagship for a star, the place should have been outstanding. Maybe its just the ant","useful":1,"cool":0},"8rmXcJk_pKZcc3waIvI0Sw":{"text":"I never knew that I could have such a great and affordable dining experience for lunch.  M","useful":0,"cool":0},"At5fNNZ3YJmBtqCroC5Hww":{"text":"What an amazing experience, we were referred by two friends. This has to be one of the the","useful":0,"cool":0},"EP-b-lYWKmVVea_SgQ2CUw":{"text":"Dining at August was a five star experience from the food to the service to the ambience. ","useful":0,"cool":0},"uco3CCK1ZSXczgxdf7VU2w":{"text":"What a truly great experience. As a New Orleanian you hear about the great restaurants in ","useful":4,"cool":2},"HfZ4CXg0yDATtYtMF_eImQ":{"text":"Bottom line- even with the great impeccable  innovative food August restaurant has, the en","useful":0,"cool":0},"6uZFPCSwStnw3Fic6eUOnw":{"text":"Great food. Everything was so yummy. Staff was very friendly, polite, and checked in with ","useful":0,"cool":0},"DuBcXFk02CPrxSkhyz3fyg":{"text":"Came here in October with my sis-in-law for our first meal in NOLA -- what a fabulous expe","useful":3,"cool":5},"0P-tLPCijnI1nCjHUS1JaQ":{"text":"Have to try the duaugust course ...97$ or 152$ with paring of drinks , course had truffle ","useful":0,"cool":0},"rxOSgb0QzTc1KfmIIakY4Q":{"text":"My second night in NOLA, decided to make a visit here for dinner.  I opted for Degustation","useful":3,"cool":1},"5C1KHJMIDiRm4xXeSAgEGw":{"text":"My husband and I were lucky enough to squeeze in at the end of a lunch rush on a Friday. I","useful":0,"cool":0},"G8_sU6toodMnjokA_6G0gQ":{"text":"How can you look at the menu and make a decision? Nearly impossible.\n\nLet them do it for y","useful":1,"cool":1},"sa_dZzKwPG0Xgl5BH94k7w":{"text":"I dream about the blue crab gnocchi appetizer. My perfect meal would be a nice stiff drink","useful":0,"cool":0},"f7doFwOq-6NwdGt6BgbJ4w":{"text":"We came here specfically for the banana pudding.  It was one of those random late night ad","useful":0,"cool":0},"qWdPBa62CDuQAa8AFx5e_g":{"text":"Gnocchi topped with crab and truffle started this lovely culinary tour de force. Perfectly","useful":0,"cool":0},"syuSXDnkz5UVpMgVyClMsQ":{"text":"Disappointing.  Maybe my mistake was planning the perfect meal, which to quote Anthony Bou","useful":1,"cool":0},"GtnSvXJ-9RyA-8zlZfbIcQ":{"text":"Best restaurant service and food that we had in New Orleans.  We had lunch there and order","useful":0,"cool":0},"0F9NWeAkiULrIQJbcMCD3w":{"text":"Not a good dining experience and certainly not what is or should be expected from what is ","useful":0,"cool":0},"EMFy06PbZ03mAj_hK-JCqg":{"text":"Last time we were in NOLA, we had dinner at Besh Steak at Harrahs, and it was the best mea","useful":0,"cool":0},"CVflDTQk7KadzD1yvqiFog":{"text":"A vegetarian tasting menu? Yes please! It was six courses of creativity and deliciousness.","useful":0,"cool":0},"bUMntRBamVOPwWvXY9lupg":{"text":"Restaurant August is the reigning culinary monarch in a city of gastronomical stars. John ","useful":2,"cool":2},"yDZGjOKWPgNstvCAzc3dsg":{"text":"There are some lines that divide the South.\n\nLines we don't always discuss or acknowledge.","useful":4,"cool":0},"JNHvl_O6BI6M_TKx20sB9Q":{"text":"Elegant dining.  I had the three course fixed price $20 lunch.  Fantastic.  Service, atmos","useful":0,"cool":0},"pO6NGn5B6c7RAO6fEldCQQ":{"text":"What can I say that hasn't already been said?\n\nThis:  the $20 3-course lunch is the best c","useful":10,"cool":7},"YJGhYsTmm5GCPC4ARGnuYw":{"text":"Amazing food, beautiful space, excellent service!\n\nWe booked a table for their Friday lunc","useful":0,"cool":1},"Z3-d5P_M1EQEvOjoi4TJ8Q":{"text":"The food was pretty good - the gnocci, watermelon & crab appetizers were delicious.  My so","useful":0,"cool":0},"AltCl4indZjw5t4s2FXhdQ":{"text":"I really wanted to like John Besh's flagship Restaurant August; however, both the food and","useful":1,"cool":2},"LgWJ070oj6up_AWtZzMtqQ":{"text":"I thought a jacket was recommended here, so I wore my suit. Upon seating I saw people were","useful":3,"cool":0},"KLTpeVTP3LapdEftLVN0Uw":{"text":"Restaurant August definitely stands up to its reputation.  I have wanted to dine here for ","useful":0,"cool":0},"XAIy8qS_XyPczDldPwtCAA":{"text":"Yes. YES! YES!!!\n\nSeriously, I was moaning in ecstasy and tears were streaming down my fac","useful":2,"cool":1},"wUorvCt7Nm7WjjLcjIuUiA":{"text":"This review is for the prix fixe lunch I had today with my dear friend Zach. It costs $20.","useful":1,"cool":0},"b01hvD-L6fIciuLxwZ8a5w":{"text":"Ate here as part of a conference. Had American \"Kobe\" wrapped around a lobster tail. I cou","useful":0,"cool":0},"ZgOKvBkPa29KufFjOCdccw":{"text":"What an absolute treat!\nThe ambiance, the service, the creative spirit, the quality of the","useful":0,"cool":0},"sz0m3SIyM5k4-xATXhQdbw":{"text":"One of the best restaurant experiences I've ever had.\n\nA couple friends and I checked out ","useful":0,"cool":0},"Nd23HbkUuB4xBc0stE_PVg":{"text":"Delightful tasting menu. Each course was better then the next. Each course was complex bot","useful":0,"cool":0},"NsHN0w0GRyiXd2G26jkpYQ":{"text":"Service was great, staff polite and friendly and very helpful when selecting menu items. I","useful":0,"cool":0},"F_C8ojQRafg0N2Dr8158BA":{"text":"I remember thinking \"I know this restaurant is top rated in New Orleans, but I am from NYC","useful":0,"cool":0},"_1dXeILy4XaYB5q_6-vvaQ":{"text":"This meal was perfection. Service was fantastic.Started with the goat cheese and pear sala","useful":0,"cool":0},"hGMz_q2oUvA1Og-wBjU-xg":{"text":"We are foodies. Wherever we vacation,  food is #1. These guys amazed us.  We have eaten al","useful":0,"cool":0},"490XTVuDYaXaj5dbFV4CKg":{"text":"Outstanding! Delicious and creative food! Attentive service! Beautiful surroundings! The F","useful":0,"cool":0},"hCZvHhfa02c9qPyc-ygS4Q":{"text":"Service: 3.5\nFirst plates: 4.5\nEntree: 4.0\nDessert: 5.0\n\nThe service was not spectacular f","useful":0,"cool":0},"0MiBMXxGLb48dw7iTSrh3A":{"text":"Amazing dinner. The tasting menu offered several courses with wine pairings. Everything wa","useful":0,"cool":0},"yzAfiY4eDsmOpJke3w81fg":{"text":"All of the food was delicious! Everything was properly prepared and just tasty.  Although ","useful":0,"cool":0},"uOgXrVI9cVvsFOKbRfFUNA":{"text":"The second night of our trip to New Orleans we were fortunate enough to dine in this amazi","useful":1,"cool":1},"aUeKl8q7usMNG2fl1rgZ1A":{"text":"Everything was expertly crafted and delicious.  Make sure you dress up so you fit in with ","useful":0,"cool":0},"aQah7_dwy6Sc4yyWunrZOQ":{"text":"What can be said that hasn't already been said about Restaurant August. The service was in","useful":1,"cool":1},"0F2OpUUjYdf4zkQVgUET_w":{"text":"Simply amazing! The best of John Besh's restaurants that I've eaten.  We ordered the 5 cou","useful":1,"cool":1},"DcomC1ToR11pDVFp2_rFVw":{"text":"John Besh is New Orlean's new celebrity chef, supplanting fuzzy little Emeril as the city'","useful":2,"cool":2},"4jtOIY0UZOxzcQr_qzPlZg":{"text":"MUST-EAT in NOLA! We had the pleasure of dining here on the last night of our trip to New ","useful":0,"cool":0},"15zD4_ordpntwfXFkelLOg":{"text":"If you are ready to splurge for a top rated dinner this is the place!! The chef sends out ","useful":0,"cool":0},"iJ2ubYzXsGPZu3RCRXnVhA":{"text":"It's really hard to go wrong in New Orleans when it comes to food. But August makes other ","useful":1,"cool":1},"NkDfsbqZ_xxXW16Pd_VbwA":{"text":"Finally got to do a Friday $20.15 lunch at August!\n\nThe space is gorgeous but comfortable ","useful":5,"cool":2},"vWwvj-eabktQJo2b-WDtjw":{"text":"Phenomenal dining experience. Finally, a restaurant with tremendous food, perfect service ","useful":0,"cool":0},"R-N77Pe090w_fwX13J_VgA":{"text":"Ah, Restaurant August. This was to be the highlight of our trip (eating-wise) in New Orlea","useful":1,"cool":2},"7uhPMpjpYHfuHTVw71_10g":{"text":"This is a great high-end restaurant. I went here twice - once for dinner, once for lunch t","useful":1,"cool":0},"OXFvQ9E6dWRqPmb6iWi_jg":{"text":"I can see why people rate August so highly. My husband and I spent a pleasant meal here, b","useful":0,"cool":0},"RiYv1nRWz59tOGS5TRwWyg":{"text":"I had incredible expecations for Restaurant August coming in. I'm a fan of Chef Besh after","useful":0,"cool":0},"o6eupUOVQFUGFMN1uW--uQ":{"text":"We made reservations only about a week prior to our trip, so had to take a 5:15 reservatio","useful":0,"cool":0},"Tby-wKtAmAWSovHQKrzkrw":{"text":"Amazing food and nice service. A very impressive bourbon selection to boot. Delicious.","useful":0,"cool":0},"edMPHVIXRMaz8DgQBuGinA":{"text":"\"Speechless.\"\n\nUpon stepping in, we were already blown away by the Old Victorian interior ","useful":3,"cool":1},"YVHY-1UGDw1d_w_hAhpM0Q":{"text":"More so 4.75. The service was tremendous. Two waitresses and a sommelier. The food here is","useful":0,"cool":0},"1cnZ2vcLPTWkji-fk8ehPQ":{"text":"This restaurant is very high class feeling, very dressy, and prim and proper.  If you are ","useful":1,"cool":0},"aiKgaNkhHxbG2v1g4vLZMg":{"text":"World class dining.  Amazing service, beautiful atmosphere.  Inventive, creative, flavorfu","useful":0,"cool":0},"TuGVk2-2o5Un_b3LVKA_xA":{"text":"Excellent venue, the service was outstanding, the food fantastic.  I was told that portion","useful":0,"cool":0},"vI08tOqj9JkD1-e5iVM9_Q":{"text":"Came here for a dinner with colleagues and it was an amazing experience.  The servers are ","useful":0,"cool":1},"fhDe2MV4w1d52PHxPXatOA":{"text":"Not only was our evening at August an excellent dinner, it probably was the best dining ex","useful":0,"cool":0},"OP3d2em5KI5CVaKjd0A7qA":{"text":"Amazing Friday lunch experience. One of us had the Friday pre-fixe ($26) including drum fi","useful":0,"cool":0},"vOtS4nyRN01WXfVB5Bl_Og":{"text":"I've been meaning to review this place since I ate there over Halloween weekend. I went wi","useful":1,"cool":0},"jolQie7tvM8nasq8WnePXw":{"text":"Super fine dining.... Innovative... Special.... Pretentious... Lovely... And a total steal","useful":0,"cool":0},"Aw6OYobl3DW0SVm98RO_Pg":{"text":"Stopped here for lunch on our way to the airport.   Needless to say, we were in a hurry.  ","useful":1,"cool":0},"clZ3pc1_sSyGlXt8VgRQDg":{"text":"Cajun chic at its finest.\n\nLiterally, I did not eat anything at this place where I didn't ","useful":2,"cool":1},"8FZg88qeMoDdSp4gL4zF9A":{"text":"I've lived here for 4 years.  One of the best restaurants I frequent.","useful":0,"cool":0},"N1FpBjJLfHJ-w5S9URKRbg":{"text":"Top favorite flavourfull experience\n\nWorths every (and that's a lot) penny. I had the eggp","useful":0,"cool":0},"gms0kd0mxn4gWE1P66olSQ":{"text":"We had a delightful meal at August -- from the amuse in an egg and sweetbread appetizer to","useful":0,"cool":0},"8rY3lOwjUGA9C5HndXXLmg":{"text":"Lovely, romantic meal in what appeared to be an old house.\n\nI ordered the vegetarian degus","useful":3,"cool":1},"HukpMhQ71-XBNhcb-k3LkA":{"text":"Service was 100% wow.  Was able to substitute few of tasting menu..and the food was devine","useful":0,"cool":0},"hYB1gDTauaKoXBOl9Fh5Kw":{"text":"Beautiful restaurant.  Impeccable service.  Helpful sommelier and nice wine list.  Sat in ","useful":0,"cool":0},"17OdogFIYIltVYYwMHdYcA":{"text":"I was not disappointed!!! I feel like a lot of people have a stigma for celebrity chef's r","useful":0,"cool":0},"MUKIbPcadQLr6BjHluHDZw":{"text":"The Last stop on my Restaurant Rouletter Tour (that's when you select a handful of restaur","useful":0,"cool":0},"4SDV4LhIKrs4BjFKsxponA":{"text":"Amazing!  This is what fabulous restaurants should be. Went for lunch and everything was d","useful":0,"cool":0},"p_ufhHCainvEsPOiFmn8kA":{"text":"This was definitely one of my top culinary experiences. My party opted for the smaller pla","useful":0,"cool":0},"pwHYD0OvqIuGbcYvSNZGqQ":{"text":"I wasn't blown away I'm afraid and I'm so disappointed to say that. \n\nWe went for my birth","useful":0,"cool":0},"PDoXAnnYvf_Axxx8Th0HWA":{"text":"Damn. Just damn.  this restaurant is everything it is billed to be.  Every course was a de","useful":0,"cool":0},"vljQlsnL7ct4qDYnL3NYHA":{"text":"Wow. I felt about as calm, pampered, and well-fed as I ever have. Spent a lovely hour on a","useful":0,"cool":0},"Qz1qIsRO_YCuz-EyuHOQRA":{"text":"Oh, August. How I love this place.\n\nThis was my introduction to John Besh. I had been in N","useful":1,"cool":1},"mSe8tu6pxYCmgQTPxrrQYg":{"text":"Hands down one of my best dining experiences EVER! From the impeccable service displayed b","useful":0,"cool":0},"3wkFM1035LkVgvIRMZkstQ":{"text":"I usually don't give 5 stars but this review deserves each and every one of them. This is ","useful":1,"cool":0},"tlYxurbqRc9P7-uyk5HpgQ":{"text":"I had an amazing meal at August. I was hyped after reading the reviews and scoring reserva","useful":2,"cool":2},"RB4Zm1CBQkzE54XtffU86Q":{"text":"My girlfriend and I had a spectacular dinner here a few months ago, one of the most memora","useful":2,"cool":1},"VBzdNavo3ovpU-ImeiwTRA":{"text":"Very good food served in an attractive and comfortable dining room. Service was good not g","useful":0,"cool":0},"K0xSWNpExO9Pn2xc5GfjFQ":{"text":"From food to service to ambiance - August gets 5 stars all around! It was a total splurge,","useful":0,"cool":0},"WUa_kZK035XhXthv8gO0UQ":{"text":"Anyone reading this is sure to know something about the restaurant and the celebrity chef ","useful":1,"cool":0},"Ej1n8F09w9YG1doVBRt19g":{"text":"Simply amazing. From the ease of make my a reservation, to the service, and of course the ","useful":0,"cool":0},"Dvqt6QsARNAP7-pgcfp5uw":{"text":"Amazing amazing amazing. August lived up to my expectations and then surpassed them. Every","useful":0,"cool":0},"rhBAWSqxhl4zEossicPi-w":{"text":"I was very impressed with the quality and creativity of this restaurant.  The food was del","useful":0,"cool":0},"9VkWmWL2CMXJggQmW8IkMQ":{"text":"One word sums up my experience: AMAZINGGGGG!!! \n\nI loved everything about this place. The ","useful":1,"cool":1},"u_VvWzvN0NjZeftDxBMckA":{"text":"I have eaten twice at August and the food and service are to die for. A must visit when in","useful":2,"cool":0},"aq2-bUoLHLw1oa_K7nChrw":{"text":"A dream made real. We have New Years dinner and all was perfect! The ambience, the service","useful":0,"cool":0},"8h682R8qWvmgCPlA3T2_pQ":{"text":"I really don't know where to start with this one other than it was an incredible experienc","useful":1,"cool":0},"bn-mcpncqxCj_DqHmgGpWA":{"text":"Not every fine dinning restaurant should have a tasting menu. Tasting menus can be a fun e","useful":0,"cool":0},"-FL7kiQ1H9xkpTLtdHhq5g":{"text":"The food was great.  Actually one of the best filets ever.  But I was eating that filet fo","useful":1,"cool":1},"JRMWeNasRcz60R9gQYeA_g":{"text":"This review is strictly for the conversation that I had with Restaurant August's Catering ","useful":0,"cool":0},"yIlKg3PWwKV2ZTkv2aQlNg":{"text":"Best restaurant in NOLA.  Hands down.  The three key dimensions of service, ambiance and f","useful":1,"cool":0},"ZtI7C6gmZs1YHS4k6ntuNw":{"text":"Service and imaginative plates are amazing. Disappointed in the rib eye. It was tough and ","useful":0,"cool":0},"k0J756-DCPCW5aA_12aCvQ":{"text":"review of dinner for two: Saturday @ 8 pm\n\nATMOSPHERE: The vibe and feel of the entire res","useful":3,"cool":0},"_0nBth_ayUc3tuWyqbA_TA":{"text":"Came to NOLA to celebrate my cousins birthday. We made a reservation for August for his bi","useful":0,"cool":0},"5d-ktDkXrrpkpb32ALc3uw":{"text":"One of the Best meals I ever had in New Orleans.Excellent level of service and food...worl","useful":0,"cool":0},"JHhE_PTbFwYEEStZQx-O6g":{"text":"Staff is real nice and attentive.  Restaurant was real hot, must've had a broken AC, felt ","useful":1,"cool":0},"q04fwuXTM6MoH4gXcIpcTw":{"text":"Come hungry, and ready to indulge. Everything we ate was rich and delicious, and \n\nOnce we","useful":0,"cool":0},"Ydb4SS3YRjiJ27Ki-SirJQ":{"text":"Exquisite.   Great atmosphere,  and the food was breathtaking!  The staff was great - smil","useful":0,"cool":0},"C8vqISea0hLPLVspzshzDw":{"text":"New Orleans is full of good restaurants so in order to stand out you really need to be spe","useful":1,"cool":0},"CHfmQGKaKbbSdx-1bQIvCQ":{"text":"The $20 Mon-Fri prix fixe lunch is an incredible way to try this amazing restaurant at bud","useful":1,"cool":1},"MVvm_BYJnF5xOa-pcaQA4g":{"text":"Excellent food.  The service was polite and attentive but not necessarily friendly.  Anywa","useful":0,"cool":0},"2poTemueIf0H96Kl6N2sXA":{"text":"Fantastic.  The trout was amazing.  A overall great dinner experience for some fine-dining","useful":0,"cool":0},"wzyUrl0X36HYHe74SIhaaQ":{"text":"Best meal in years.  Great ambiance,  great service, and even better food.  Even though th","useful":0,"cool":0},"xbsmf06jBePVA34HRHADQA":{"text":"I want to give August a 4.5!!!  Started off with their signature appetizer of the gnocchi ","useful":0,"cool":0},"6G-DVspKPdhAjUVOXyTmaA":{"text":"What a great way to cap off my first weekend in New Orleans! \n\nVery engaging staff and ama","useful":2,"cool":0},"WroKliTEx6ZTPA7-5JVjRQ":{"text":"I had to write a review for this one since I am on Yelp Now... Hands Down the Best Restaur","useful":0,"cool":0},"jzN5N_mtcMqezX-y-Bv7Yg":{"text":"I liked Restaurant August although we had a fixed menu and there wasn't anything particula","useful":0,"cool":0},"rcQ2_jBhW8-KcOhVoGJdpg":{"text":"I'll start with the good and work my way backwards down the rabbit hole.  The service was ","useful":0,"cool":0},"W4qapHEbrpI63Gikw9G4xA":{"text":"Food, wine, service and atmosphere were all outstanding. Would definitely repeat next time","useful":0,"cool":0},"GJcNsUo_iMpIzkjLnPNxHg":{"text":"I thought the venison was perfect.  I love venison and August took it to another level.  O","useful":0,"cool":0},"R05EOJ8A5fUmxL3JWMn_Rg":{"text":"I just ate something amazing out of an egg shell. No clue what I was but I had caviar on t","useful":1,"cool":1},"-OlRfoxujXRZ78YaJQPzAA":{"text":"Amazing dinning experience!  The hanger steak was wonderful! Foie gras was really well don","useful":0,"cool":0},"Km6MXNLTC7rnWyJ2bGROGg":{"text":"Absolutely loved this place. Service was impeccable, everything was delicious. Amuse-bouch","useful":0,"cool":0},"TKIrkbxEVBD78YLn1QxD8Q":{"text":"Fantastic food in a great atmosphere.  \n\nThe gnocchi was outstanding as was the trout!   \n","useful":0,"cool":0},"sxv1AUCeQ-SFJ6Fwd2yf0g":{"text":"Restaurant August is the best dining establishment I've ever patronized. The only eatery t","useful":0,"cool":0},"Pqkpbeg0VDPGQyejwqxYUg":{"text":"Beautiful dining rooms, and very professional service.\n\nI had the degustation menu with wi","useful":0,"cool":0},"lsis_CjwWJG1LH-FGdzgMQ":{"text":"took 4 guests here for dinner and I was very happy with the ambience of the entire restaur","useful":0,"cool":0},"dwzk_RdqcWXE0Wz-NSD9bA":{"text":"This is a classy, fine dining place, and great for an upscale business dinner.  It was als","useful":3,"cool":5},"MytZ29Czz28W_dnI5UhVIA":{"text":"A truly wonderful experience. We had dinner at August during our honeymoon and loved the f","useful":0,"cool":0},"pHWiG32398zm0aM6AxmcaQ":{"text":"The service is great. The food is okay not too special. The potions are amazingly small co","useful":2,"cool":0},"ZTuC_pJNQjOq0l-Cqsu4Cw":{"text":"Trout Pontchartrain was awesome! Had  while traveling for work but was so good would come ","useful":0,"cool":0},"ui6V125GKPUydhdktlloQg":{"text":"I came here for spring break (so it's been awhile between my review), but I still remember","useful":0,"cool":0},"CprNmd4BLkahsAu5qT45BA":{"text":"I came here upon the recommendation of a friend, and I'm so glad I did because it was defi","useful":2,"cool":0},"XI6BvtW7MRYczDKJLFebXg":{"text":"I've been intrigued by Josh Besh since I first saw him cooking on all the various TV food ","useful":0,"cool":0},"xbpZ25a90B39Y1jFw0hYUw":{"text":"Love this place. When I saw John Besh on next iron chef, I knew I had to eat at his restau","useful":0,"cool":0},"k-KBQbO3bTHcnoI1pyFusg":{"text":"I had one of my birthdays here and it was the best meal of my life. Seated in the wine cel","useful":0,"cool":0},"ppRBR_0ZEHoD0QYhjRejhA":{"text":"Whimsical experience. One of the best (if not the best) meal I ever had. Impeccable execut","useful":0,"cool":0},"d9DZNPA_t1-QHXmKsYaQcg":{"text":"bar none the best meal i had in new orleans.. i called in earlier to see if they took rese","useful":2,"cool":1},"tK1oBrPahXiJI8ZflygpXg":{"text":"I came, I saw, I wasn't impressed.  Maybe it was the build up that this was going to be  s","useful":4,"cool":3},"abvzKX0QznXpknQgsaFhjA":{"text":"Amazing meal! We sat at the beautiful bar and enjoyed the Friday pre fixe lunch menu.   Th","useful":0,"cool":0},"VZ8d1D2Xnq6Jk_085MTKPA":{"text":"Excellent meal! I had the trout pontchartrain, which was a wonderful entree. Gnocchi was a","useful":0,"cool":0},"RTcHHtcv6XxjiPTy6LfByA":{"text":"After enduring a couple of tourist traps in NOLA that colleagues had suggested, this was h","useful":0,"cool":0},"gV3tYGZMZcdbdjSBHmhCBQ":{"text":"Yes, this is a really good restaurant.  In fact, it's exceptional.  I had the Foie Gras do","useful":0,"cool":0},"fWAMNx8bOlX-evRg_sFBvA":{"text":"I was just in NOLA for a short vacation, and made a point of coming to August once again (","useful":2,"cool":0},"d9Gs035INsBF4WpQqN2lOg":{"text":"My meal at August was excellent, up until the dessert. The desserts were a little dissappo","useful":0,"cool":0},"em94ezuWiwgOtx2tIoyfKw":{"text":"I went for the prix fixe lunch.  Unbelievable.  What a deal!  You would be foolish not to ","useful":0,"cool":0},"HQEMKBCkZ635BjWo0svQjQ":{"text":"Restaurant August did not disappoint.  Of course I am a John Besh fan. My meal started wit","useful":1,"cool":1},"kXtTY-xXtXqpVoKS4lGPyA":{"text":"This restaurant for us was a great introduction to fine New Orleans dining experiences.  T","useful":0,"cool":0},"3V62rdAs7V_FTaB5QCLNzw":{"text":"What an awesome culinary experience. The food was really top-notch. We came here for the l","useful":0,"cool":0},"hyiDFYONtXtA85N_cBI7QA":{"text":"I was a little bit underwhelmed from what I had heard about this place.  I am a huge John ","useful":0,"cool":0},"L3xRZ7i5CsD9DGHMNkHbxg":{"text":"We have eaten at August twice, both during lunchtime hours.  This time we noticed that lun","useful":0,"cool":0},"fECnR151k6eL0J3twJI6Cg":{"text":"Visiting from STL. Whenever we travel, we try to hit at least one 5 star restaurant.......","useful":2,"cool":0},"Vd2SPlz9JK6d2uiphTm-yg":{"text":"Being the huge John Besh fan I am, I was overjoyed when we got a last minute reservation. ","useful":1,"cool":2},"qOnFw3dhXejT82t6jb1fyg":{"text":"We had high expectations for this place and it turned out to be underwhelming and SALTY. W","useful":3,"cool":0},"HaubnYo0FLWdY8hgGBowUg":{"text":"Considering that this is a John Besh restaurant, I was expecting quite a bit from Restaura","useful":2,"cool":1},"OHvLyYCvoqJTxpUqidoUOQ":{"text":"We attended a corporate private dinner in a charming room on the third floor.  Everything ","useful":0,"cool":0},"IlG_tH0JLHwdM-ZBg0-MZQ":{"text":"Came here for the $20 lunch pre fixe and wow! What a deal! Seriously, I could hardly even ","useful":1,"cool":0},"uvzxcTu0tfHFWYf3IULflw":{"text":"Came here for dinner with the hubby and it couldn't be more perfect. Husband had the foie ","useful":0,"cool":0},"DAVjnaSZnYfeHusDciunvQ":{"text":"August is what fine dining is all about.  \n\nA friend and I had the Reveillon dinner with w","useful":0,"cool":0},"FM8IEqTK8n-lVXtmNaBsLw":{"text":"Hands down the most complete dining experience I've had in New Orleans. Possibly ever. We ","useful":1,"cool":0},"eRXesuChQ05-OTf7J85InQ":{"text":"Absolutely wonderful.  We got the chef's selection with paired wines; both the Farmers Mar","useful":0,"cool":0},"JR1qAy29RYoRoNVJplg9uw":{"text":"I don't give a lot of 5 star reviews.  \n\nAugust is, hands down, the best restaurant in New","useful":1,"cool":0},"v6e4CaUCBazAQ81drvK3hg":{"text":"Sat at the bar.  Food was so so. Not as amazing as I expected. Great service and lovely at","useful":0,"cool":0},"dyv5-GwFjV0R_fPDgptJdA":{"text":"The chandeliers can be seen from the street and they are just beautiful! When you first wa","useful":0,"cool":0},"H5x3I_9-vGWHKuVmXAlyFw":{"text":"One of the best all around meals I've had in years from service, interesting menu, executi","useful":0,"cool":0},"IZ6o2o_Qt4gxFeYWQxO6PA":{"text":"Vegetarian foodie heaven!  Rarely do I get more than a couple of options at a restaurant o","useful":1,"cool":0},"QDlovCF3fyJXjN8HKbgAXA":{"text":"Exceptional experience - excellent food, exceptional service.  Tasting menu is wonderful, ","useful":1,"cool":0},"sV0bwh3qY4X6Y8v6o8saqA":{"text":"The room is beautiful as well as the food and wait staff. The pre fixe lunch for $20 is th","useful":0,"cool":0},"STvBzpoUbsECszkEIulfLQ":{"text":"Superlative. Amuse: cauliflower puree in an eggshell; interesting if not totally compellin","useful":0,"cool":0},"0d4o3Vw_I9HdrWHlkOJlHg":{"text":"Although I made reservations here for a fun work dinner I was apprehensive since I am vege","useful":0,"cool":0},"R_ZPDNjkBvBc_f_yOZyh3Q":{"text":"Had four courses that included great wines and a healthy bourbon selection.  Overall, an e","useful":0,"cool":0},"UMMSqwLWnETjFASHrsJJFQ":{"text":"I was lucky enough to have a gentleman secure a reservation for me at this amazing establi","useful":0,"cool":0},"fU8e9ArCKZZQHGbNhDAssg":{"text":"Definitely my favorite meal in New Orleans and up there in one of the best meals I've ever","useful":1,"cool":0},"g7e8fQLiM_vTC5hhdXYFQw":{"text":"Was here for a business dinner mid-week. Service was great. Started with goat cheese salad","useful":0,"cool":0},"Jy0_MPmtyEqJjKm2EE61Dg":{"text":"Some of the best food I've ever eaten.  Period.  Great service, beautiful ambiance and ama","useful":0,"cool":0},"5hYztqzz5z5hHsYZ090L4g":{"text":"After watching Top Chef for a number of years, I was on a mission to try some John Besh re","useful":0,"cool":0},"yVRq2MU77tBwf3Vv6a04eA":{"text":"I was visiting New Orleans last week and we went to restaurant August because of Chef John","useful":0,"cool":0},"Us6TBkAOY05JIs_VyeAS7Q":{"text":"The \"food\" highlight of our trip was dining at restaurant August. I've heard such great th","useful":3,"cool":2},"Pg5QvzgUJyJ7J4NH58Om3g":{"text":"Consistently great food and outstanding service. My favorite place to visit when I travel ","useful":0,"cool":0},"8xZUIdsf96lGLJ_pZSHV8g":{"text":"Let's just say that this is the kind of place that even your starter salad is gonna have y","useful":0,"cool":0},"WAExGf5N5pt6lRZcFDZ4FQ":{"text":"We ate here on our first evening in New Orleans and immediately became a John Besh fan.  W","useful":0,"cool":0},"EItXU7zDTKiJjsnnvTvqEw":{"text":"Had a bottle of Pinot noir, venison sausage for appetizer and lamb for entrée.   It's a gr","useful":1,"cool":0},"NIChEY9Uor94F9HQkrjh8w":{"text":"If you have to visit one \"not-to-miss-restaurant\" in NOLA - this is the place!  Gorgeous s","useful":0,"cool":0},"5GI5jXPrCVPOfQ3WTdN5Og":{"text":"This was easily the best meal of my life! The restaurant was impeccable: style, decor, pre","useful":0,"cool":1},"NDsbII_3ywjrclx2LPUQsg":{"text":"The food was incredible; exceptionally prepared, incredibly flavorful, and beautifully pre","useful":7,"cool":0},"561NWfEE2tJpE3J3QRVMOQ":{"text":"In my opinion, it was not as expected at all. I had the degustation menu with wine pairing","useful":2,"cool":2},"jyYgPTk36gE0GDl-kocQ0A":{"text":"I'm a fan of most thing's Besh, with maybe the exception of American Sector, but even on t","useful":0,"cool":0},"7mxA4Dus0fZhtuqB_Fov1Q":{"text":"This is one of my favorite restaurants on the Planet! We come here every time we're in tow","useful":0,"cool":0},"EdHpIQtxlkXw9B5DNb0wdg":{"text":"loved it! The best $20 you can spend on such superb quality!  OMG, i wished we could have ","useful":0,"cool":0},"sMx2MA7_uG8VWf9KBU2ePg":{"text":"A great fine dining experience.\n\nThe vegetarian tasting menu is delicious. The cocktail me","useful":0,"cool":0},"hYrJgWVEwPhuPfjT4jqQjw":{"text":"It was fate. We saw John Besh walking through the Saint's Super Bowl Parade and then we en","useful":0,"cool":0},"fY8Ka5fs9pkIs9bwN1Xfzg":{"text":"This is my favorite restaurant in the world (so far) Staff, food, drinks, ambiance, everyt","useful":0,"cool":0},"r4EHg2m3TDTp7blAc8dpvQ":{"text":"Ok. It should probably get 2 stars. But it is so over-priced for what it is. I would never","useful":1,"cool":0},"eOX41Qp_YUJcRCVIH6Pyxw":{"text":"Came here for a fancy bachelorette dinner. Super quaint and quiet place - good for romanti","useful":0,"cool":0},"kM07xp5dvnU8gk7K3B-ZwA":{"text":"we spent 3 days in NO recently, showing our friends from overseas and taking them to top n","useful":0,"cool":0},"TJlZetevegJ9-uvs8eYNGA":{"text":"One of the best meals I have EVER had. The chef really understands how to marry multiple t","useful":1,"cool":1},"ncJjznO7D_uBua9opt4aPg":{"text":"Came here for their Friday Lunch Prix Fixe for $20.15. Yes, only $20.15! I read a lot of r","useful":0,"cool":1},"GPEewag7ZA5eXkrgMhylqg":{"text":"Not as what we expected a little disappointing but will give it a second try next time wer","useful":0,"cool":0},"stJGeLz8vgsE_HpaOj_TaA":{"text":"This is a nice, special occasion restaurant. In fact, we were seated next to a couple who ","useful":0,"cool":0},"ko3AwBNLLnZk3b5TyJuP7w":{"text":"It was dinner time and we walked the two blocks from our hotel (International House) down ","useful":0,"cool":0},"NOgsbn1c9sEIhulRAEYiqg":{"text":"Great food.\nGood ambiance.\nWait staff efficient but decidedly distant. I could have given ","useful":0,"cool":0},"yyOdRiQY-GAviUPfe25aPw":{"text":"In a beautifully remodeled 19th century building away from the crazy dirty Bourbon Street,","useful":0,"cool":0},"5gF3r39KoYd3xOy-yKZbKg":{"text":"Incredible food, lovely atmosphere. We went for the 3-course lunch for $20.14, what a trea","useful":1,"cool":0},"u9DF2zyMNqc7FZijd4SZ2A":{"text":"Hands down one of the best meals of my life.  No reservations available so I sat at the ba","useful":1,"cool":0},"iTtMg8MSQ395dFKegu4Q3Q":{"text":"We had the degustation menu and partook in the sommelier pairings. This is definitely wort","useful":0,"cool":0},"LCSIO3esFfmT83SR6d0SUg":{"text":"Everytime I have eaten at August I have walked away feeling like it's my favorite restaura","useful":12,"cool":9},"KZGShs25N69BVS9AQquVag":{"text":"As I was very much looking forward to dining here I wanted to wait a few days after the ex","useful":2,"cool":0},"muQmSeBzX0yp3C6Uowtq0A":{"text":"Lunch here is such a great experience and deal. For $28, you get three solid courses and w","useful":1,"cool":0},"hctlfLj7zHOHjBuG91kiYA":{"text":"Reservation and seating was painless. The waiter (who very much reminded me of one of the ","useful":0,"cool":0},"vN9S4VQFsTOiSN_0V8Oagg":{"text":"Oh my god the food was so good. The portions were small but the flavors and the food were ","useful":0,"cool":0},"GGJxc0EgjkTunus-6iO2CA":{"text":"We were unable to get a reservation on New Year's Day so we decided to take a local's reco","useful":1,"cool":0},"jSy9GPKZe4kNPtjXqaTHuw":{"text":"I think the Friday lunch prix fixe is the way to go. They only have lunch on Friday and lu","useful":1,"cool":0},"XJgGGQZz5OoVcqd_7N-QZg":{"text":"I went to this restaurant a bit under a year ago and was unimpressed.  Despite that, owing","useful":1,"cool":0},"aU4S1opp2a4MFVJdfd_kmQ":{"text":"Glad I didn't have to pay to eat here and that I ate here.\n\nAll food is good in NOLA.","useful":0,"cool":0},"jludjJja583zNAAwVbB2Zg":{"text":"If only I had enough money to go eat at this restaurant more often! We went for the Friday","useful":0,"cool":0},"xuZstMRR4uzDAjTahptq9w":{"text":"We at at lots of places in New Orleans, in out week trip, but this was the best lunch we h","useful":0,"cool":0},"1Y1wJoJC-6PSXZkCTfoDUQ":{"text":"This place is just perfect.   Favorite restaurant in NoLa.  Just wow.  Sometime we go two ","useful":0,"cool":0},"IxbgGGO8vYwiwFemG7gVRA":{"text":"We mustn't count ourselves among New Orleans's refined diners. The allure of August is los","useful":1,"cool":1},"L_qugpx3WHMj9E1ss0Cvkw":{"text":"Restaurant August lives up to the expectation!  We were running late for our reservation, ","useful":3,"cool":0},"qtzT7GWUJWTXkQzBgCWTKg":{"text":"We had a wonderful experience with the chefs menu. Great meal. The courses were excellent.","useful":0,"cool":0},"4_0DijkEFHsTm_nzotMBww":{"text":"I have dreams about this place.  I ate here with friends years ago, after visiting Nola fo","useful":2,"cool":2},"mSUeDL7LQ8v5IdEWQl2XZg":{"text":"Everything was amazing. From the host stand to the kitchen. One of the best meals you will","useful":0,"cool":0},"WMDWNgaDIqq16TJBLXPzBA":{"text":"Not necessarily my favorite in NOLA... but just fine, maybe fell a little flat after all t","useful":0,"cool":0},"5ZMIJEWk04STZSwcjKOUmQ":{"text":"After my poor review of Luke I have to make up for it with a wonderful review of August. T","useful":0,"cool":0},"PqHWB1u2VgoKJ6xPmeoJKw":{"text":"Hands down one of the most delightful meals I've had in a long time. The menu is varied an","useful":0,"cool":0},"YI88i4Un2J_AUTvf3crJpA":{"text":"A John Besh restaurant.\nFine dining. Three dining areas. \nWe were seated in the two-story ","useful":1,"cool":1},"ztr1QFsL80miCoOirAqlOA":{"text":"I had a splendid dining experience here. It's another John Besh restaurant. The cuisine is","useful":2,"cool":0},"aXN2i2EOu9CpQ9dXx6tOPw":{"text":"Food, service, experience - all exceptional and perfect for a very special evening. If you","useful":0,"cool":0},"ewMfRNTBZi2KF3tAZc0rgg":{"text":"This is an exceptional restaurant. The food met my high expectations, and our waitress was","useful":0,"cool":0},"TAyishZYLR7rfaQ2tbfGzQ":{"text":"I'd eat here every time I go to New Orleans if I could afford it.  Every waiter treats you","useful":0,"cool":0},"-SZLBcM5i-1unOOBICOqMg":{"text":"My husband and I found the menu and dishes simple and pleasing.  Chef John Besh is a creat","useful":0,"cool":0},"38mPxZAwCxr1ovDA-hcDlw":{"text":"This is a fine dining experience; the wine list is great, the food choices are interesting","useful":1,"cool":0},"3Bwf24HSPJ30njfA24IX0A":{"text":"Modern fancy pants food in a modern space with an old-fashioned theme. Well-trained super ","useful":0,"cool":0},"KDZPo7B4FCKet5SA5z3Guw":{"text":"Hubby and I did the tasting menu. He did it with the wine pairings, I opted not to. I hate","useful":3,"cool":1},"UgOOeW7FpVsSO2bqkmgdGw":{"text":"Solid service, decor, and presentation but the food was too salty to eat. We had the veget","useful":0,"cool":0},"HownXMO0wZPL0pvKJqN1KQ":{"text":"Restaurant August is not exactly a place I can afford to visit on a regular basis. I wish ","useful":2,"cool":0},"jpBXtGeTFGmfJLo4FPsRAg":{"text":"Service was impeccable but the food was below expectations. We started with the fois appet","useful":0,"cool":0},"vS_t_js0azr3C0rVGOKIpA":{"text":"Why do waiters at high end restaurants constantly ask u how u like the food? If I say it s","useful":0,"cool":0},"QBoWHH7UF0zchK5T9u0tow":{"text":"I would return to Restaurant August just to have their duck again.  I love duck and it is ","useful":0,"cool":0},"9sEd28v_vqBkW5YtLCG9Tg":{"text":"Simply wonderful!  We started with a complimentary amuse bouche of cauliflower puree serve","useful":0,"cool":0},"A6mUeXMC41e1SRLSzzIiSw":{"text":"I'd consider this more of an experience than a meal. Robert was impeccable at bringing the","useful":0,"cool":0},"YiNJ-QCFH8NpnNnII7hZDQ":{"text":"I've wanted to try Restaurant August for quite some time and kept hoping to find someone e","useful":13,"cool":5},"EwcSrRNefPpDZhlT7qMfCw":{"text":"After 700+ reviews what is left to say about Restaurant August? My friends and I had a rea","useful":0,"cool":0},"rXFqPPUcTHA6mxQ37eK0og":{"text":"Fantastic. Such hospitality here. Truly a great experience.","useful":1,"cool":0},"uRywrd5GORy58Nkg27QiMw":{"text":"I expected it to be an upscale nice restaurant and it delivered everything I was expecting","useful":0,"cool":0},"dd_4r5PYMfYTYygYzfTZzA":{"text":"After reserving online, I wasn't sure how to pronounce the name of this restaurant.  Was i","useful":0,"cool":0},"zWCwXE3SX69XGskHDYu1uQ":{"text":"Can't add a lot more than what has already been said here.  Food was incredible in taste, ","useful":0,"cool":0},"1xqhTx01FCcKbQzuBKa7Bw":{"text":"Being the obsessive trip planner that I am, I knew the $20.11 prix fixe lunch at Restauran","useful":3,"cool":1},"K1SGRm8nven33D1dxiiagg":{"text":"We had a great dining experience at August, everything was extremely well thought out and ","useful":0,"cool":0},"jly4H-FPTlUKGFX7gfU2pA":{"text":"The service is to die for. Oh yea..so is the food...\n\nTake your time and enjoy...these guy","useful":0,"cool":2},"LgrkQvqsHx6NrmB-Ou096g":{"text":"Had the 5 course degustation menu with a friend.  Also added the foie gras appetizer.  The","useful":0,"cool":0},"boqUJiVQLcXSiCx1iPgIgg":{"text":"The Handmade Potato Gnocchi was excellent, and somehow the Breaded trout Pontchartrain out","useful":0,"cool":0},"G3rWR3np_iDykS1g02XtAg":{"text":"It had been a number of years since I'd eaten at August (although I've sent a few out-of-t","useful":7,"cool":3},"IuszrWtpGQWWkLrGegJJHw":{"text":"Was awesome! Had Trout Pontchartrain.  Had while traveling for work but was so good would ","useful":0,"cool":0},"4YUc9ki270_90pOc5AhCBw":{"text":"My wife and I dined here on the first night of our honeymoon. We wish we saved it for last","useful":1,"cool":1},"B6cCaZeoYDFFzRs0d5yu2w":{"text":"Amazing food!  Beautiful restaurant, roomy and elegant.  We got great service.  This resta","useful":0,"cool":0},"y9dCTamqdtLyu5u_wlfLDw":{"text":"Excellent.  From the service, to the wine pairings, and obviously the food everything met ","useful":0,"cool":0},"YV5vsZemGE-O12yklHx3rw":{"text":"Spectacular!  Our group had the scallops, grouper, and fixed menu with wine pairings.  The","useful":0,"cool":0},"SiDSjdd3JTCgPGmZg4fi4g":{"text":"This is one of the top two restaurants I have ever visited, with Jean George's.  Had three","useful":0,"cool":0},"--7cO-FpHmmrocxfYI7ykQ":{"text":"Had a simply great meal at Restaurant August a few weeks ago.  This place deserves its ste","useful":2,"cool":1},"KFLPItredys5VL3maEgdfA":{"text":"What a terrible disappointment at lunch - - of the 4 of us dining none of us liked much of","useful":0,"cool":0},"u8jo3d2BLAmlAMwzI3fOzw":{"text":"Came here during our visit to New Orleans for my boyfriend's birthday, I had to find a fan","useful":6,"cool":3},"AvTk00SNQrM_0D1gKlir-Q":{"text":"Culinary Heaven! \n\nI had the three course prix fixe lunch for the amazing price of $20.12!","useful":0,"cool":0},"fdSdyRvJeVh204SA44V1BQ":{"text":"I keep dreaming about this place and it dawned on me, I never bragged about being lucky en","useful":0,"cool":0},"LH-rrk4vEA5iWnyFBN4YtA":{"text":"This absolutly the place to go if you are trying to impress someone or make-up with you wi","useful":1,"cool":1},"h9TQk9QxECqi9-SmmZyVlg":{"text":"I ate here once several years ago and this is still the best meal I have ever had ANYWHERE","useful":2,"cool":1},"W0lJFh-cW6g9x2MlPmmq2A":{"text":"We went for the Friday lunch prix-fixe ($20.14).  The food was generally good; some dishes","useful":2,"cool":1},"BPIEkEjez1z3rXkjRDYDHw":{"text":"I'm not a \"foodie\", just a New Orleanian...to me that means I like good food and lots of f","useful":6,"cool":5},"ISVC85cxPNu-9H0LMWRqLw":{"text":"Was in town on business, came in for an early solo meal. Beautiful restaurant, amazing foo","useful":0,"cool":0},"Aev5buDYnbs5xbjkI2ssgA":{"text":"Service was fantastic and very friendly and the food...  Oh so GOOD!  Must try the gnocchi","useful":0,"cool":0},"15Ap1LMgXXKsvCjdekWaNA":{"text":"Came here with a few coworkers excited to try John Besh's gem! Such a beautiful restaurant","useful":6,"cool":4},"fRh2dWOcjPXCKQAgsRHYLg":{"text":"Great food and great service.  The beet salad was amazing and the crispy Pompano was so yu","useful":0,"cool":0},"60r3dC2K-kXUoAdXUUMC8w":{"text":"People have ranted and raved about the food at this restaurant and I've been to a couple J","useful":2,"cool":0},"88ZFMvY04gePpAHS7rL5Kw":{"text":"Restaurant Indescribably delicious!!!\n\nOkay, I hate fancy pantsy restaurants that try to p","useful":1,"cool":0},"H7C7DAuz8u9LqbdGanrQaA":{"text":"One of the best meals I have ever had!  WOW!  I went with a couple of friends for my birth","useful":0,"cool":0},"y2HSJ8N-0txriWGDY_6pMw":{"text":"OK so this place is the real deal, and easily the best restaurant I have been to outside o","useful":0,"cool":0},"7z6I5v_5j1ty2uSKzLolCA":{"text":"Very very good food. Extremely expensive. If your in the mood for a longer dinner I would ","useful":0,"cool":0},"jY-lmcC8VHG2peOCmlSm4A":{"text":"Fantastic service, food was wonderful, wine parings were perfect.","useful":0,"cool":0},"oIxIX_BReseHrNjIXhYS1A":{"text":"Absolutely wonderful food! We did the SEVEN COURSE MEAL with PAIRING! \n\nImmediately I must","useful":0,"cool":0},"3JesbCETNbq_2bNzZTQf4w":{"text":"This review is basically for the prix fixe lunch experience ONLY.  At $20, it's an unbelie","useful":2,"cool":1},"VlxvwLzrNt3lFHO2oAUL_w":{"text":"This was our first visit and we were able to get a reservation for Friday lunch. Todd and ","useful":0,"cool":0},"KmONhdmaaB1Phq2IQzwq2w":{"text":"They really nailed it! The food and service were simply perfect. We felt attended to, with","useful":0,"cool":0},"zDikeskIEXpvP6iGd5O5uA":{"text":"Have dined here twice, definitely looking forward to dining there again.  Food, service, a","useful":0,"cool":0},"zKNWMRvzv71pOEF213mmzw":{"text":"As far as ambiance Restaurant August has everything covered. The building is beautifully r","useful":1,"cool":0},"wIXhDs7xqMK6R2fp_cvlTw":{"text":"Prix fixe lunch! We started this tradition in 2012 when the price was $20.12 This has to b","useful":0,"cool":0},"3bknOjXz1HEycSXTLIeRow":{"text":"Great time in the big easy.  Beet and apple salad fantastic, duck excellent,  all apps won","useful":0,"cool":0},"HEreVwRhSn10SEm0I54sPA":{"text":"Great experience with fairly large party in private dining area upstairs.  We had prix fix","useful":1,"cool":0},"-X-V0kX7VzxI91bTIWwx4A":{"text":"We finally had an opportunity to visit Restaurant August on our trip to Nola this weekend.","useful":0,"cool":0},"3BunaFkARY7As7VnAjS9sw":{"text":"Was in town for a convention and we decided to head to Pat O'Brien's for some hurricanes. ","useful":0,"cool":0},"zGxZ7DXxUM-YSZ-7UzALsg":{"text":"I'd be a total asshole to say the food wasn't good.  It was.  But when I am paying this mu","useful":0,"cool":1},"7_XaqfPs5lpD9KzJngzS2g":{"text":"As other reviews have said, this place is fantastic. Luckily, my large party of 10 was abl","useful":0,"cool":0},"A2uI05txJP9SdMXTlhUhBw":{"text":"There are a lot of reviews so I will keep it short and sweet.\n\nAt the time, I really enjoy","useful":0,"cool":0},"O4Ni1Ef-bng4uHTUTS78rA":{"text":"First night with friends the food was amazing and great service ( 5 stars). The portion si","useful":0,"cool":0},"xdJdWxsuPCSGNFEVkfocXQ":{"text":"Fine dining to the MAX!!! Husband and I are foodies and this dining experience blew our mi","useful":0,"cool":0},"YmHvP0Ah3Ro3UWPavrkQiw":{"text":"August is by far the best experience ever!!! Each item was a burst full of unexpected flav","useful":0,"cool":0},"JBgVh9aXabUmQFC3_WGwAw":{"text":"All and all I would say that this was an excellent dining experience and we very much enjo","useful":0,"cool":0},"mL5g7qfB31tQ4u_X3dM8jw":{"text":"I'd like to give five stars, but reserve that for the world's best like 11 Madison Park or","useful":0,"cool":0},"5_hZvjg-7bcLL05Y-9VRRA":{"text":"Exquisitely-prepared food, delicious flavors, and a minimal frills environment.\n\nAfter a r","useful":0,"cool":0},"kMGnRr3lZRCFZb86i9QZzQ":{"text":"My wife and I dined at Restaurant August on 4/14. Dinner was great. We ate ala carte becau","useful":2,"cool":1},"XOVw9cHyiexAamN6a0ziOQ":{"text":"Last night a friend and I had the chance to enjoy dinner here at August. So many tempting ","useful":0,"cool":0},"975rS9FQPYhB0OiIA3qCkg":{"text":"I can't say enough about this restaurant. The whole menu was exceptional. My favorite was ","useful":0,"cool":0},"rtvL5qHCUM1netkCUTprIQ":{"text":"I had a great prix fixe lunch here with a couple ladies from work. I don't think I've foun","useful":1,"cool":1},"ZOqXkqnM7MuE1tjSneyDZA":{"text":"Yes, the 3-course lunch is a steal, and they didn't seem to mind that the boys walked in w","useful":3,"cool":0},"Md586C52qVh7al6bvinPyQ":{"text":"Great food and what a wonderful setting to share with good friends. Food is over the top. ","useful":0,"cool":0},"v8z-4rtpr0bUPxx6AOX64A":{"text":"I was on holiday recently in New Orleans visiting from NYC. One of my favorite things to d","useful":5,"cool":1},"fK_ahpQDVWBV9KpR1GmNBg":{"text":"Saturday night (4/10), we made our third visit (fourth?) at Restaurant August and for this","useful":2,"cool":3},"238_CR5sWCrFnC9oyxiSMg":{"text":"I was a little disappointed at my last visit here. It was my girlfriend's birthday. During","useful":2,"cool":0},"1nw7DpEUbpizy_0idTPnuQ":{"text":"Oh.  My.  Gosh!  SO delicious. I am so glad that I read reviews first, and tried the dishe","useful":0,"cool":0},"Mhepkrf_Id00gHtJG6ehhw":{"text":"I have to disagree with the five stars, and would have given it 3 1/2 if I could. The appe","useful":0,"cool":0},"JkfvJTp0zsCymTQDwNn6RA":{"text":"Absolutely amazing!! We had dinner here on our second night in town, and it has set the ba","useful":0,"cool":1},"_Jtjdvhrk5i3jnc7Ejoi_A":{"text":"Another solid choice in NOLA after weeks of research.  Not my favorite, but you can't deny","useful":1,"cool":1},"Ha-lQSsUOoPYIWQr4WqdVQ":{"text":"First two of four courses on the price fix meal were great.  Last two so-so.  Wine poured ","useful":0,"cool":0},"6K4Yli74DAtkB6ebi5djXw":{"text":"Magnificent! From the decor, to the waitstaff, to the incredible food, August was a real t","useful":0,"cool":0},"VvYYjIGcLKA8kI6Or0EAgA":{"text":"If you can splurge and do the tasting menu, DO IT!!!!! My boyfriend and I came in for our ","useful":0,"cool":0},"lUL3Gr1d1blAlsVZYYlt3g":{"text":"This is one classy and well executed restaurant!\n\nCame here to celebrate our friends paren","useful":0,"cool":0},"F3i8ZaK5sQErm1eZ8QQXug":{"text":"Eating here was a culinary delight in every way.  Bringing my six-year-old daughter could ","useful":0,"cool":0},"FO7QvSp6g1goMI5KbzB4Qw":{"text":"Sometimes I relish in being a contrarian, but in this instance, I almost regret my dissati","useful":6,"cool":2},"XL1Wb8C29JVRVR-2JnITHw":{"text":"We dined at August on Christmas Eve.  Lovely space but lacks soul.  From the moment we wal","useful":0,"cool":0},"aoAf-dREXDVT8iv0YcG0pA":{"text":"Restaurant August is amazing!  Attention to detail was impeccable and service was top notc","useful":0,"cool":0},"u7j3002jKdzrThZ6in3mTQ":{"text":"Everything about this restaurant is superb. The service, decor, and most importantly, the ","useful":0,"cool":0},"7-LkVK5l4QlYIPcwuQjLWw":{"text":"Food was delicious, great staff, and a wonderful atmosphere. The portion sizes are perfect","useful":0,"cool":0},"7jMRTk2oOHjBwX4B1kS95w":{"text":"A famous pastry chef friend of mine helped us get a table here on short notice and the mea","useful":0,"cool":0},"toRJldyRGQfd0XDqC7Tj6Q":{"text":"This is our second time to August and the food did not disappoint.  The reason for only 4 ","useful":0,"cool":0},"6RRGSSDbzB8gUi0jCMvDgA":{"text":"We went there for our first anniversary. Although the parking was tight; it was convenient","useful":0,"cool":0},"wEuZrwAGv0O1xqJovbiUPQ":{"text":"Loved the blue crab potato gnocchi, dessert, and the little touches like egg amuse bouche ","useful":0,"cool":0},"aIS3q8w8TG4hRyymlEHfeg":{"text":"My fiance and I came here after dining at one of John Besh's other popular spots, Luke, an","useful":2,"cool":1},"ZeOO6X2VhgpfSbGVqfEDjg":{"text":"This is by far one of THE BEST MEALS I've ever had. \n\nEvery mouthful was full of flavor, a","useful":1,"cool":0},"u8I_E5T_uUUhIl4Yve52NQ":{"text":"I had one of my most incredible meals anywhere at John Besh's Restaurant August. The resta","useful":8,"cool":0},"a41X3WWMzDRN_XHOmrThcg":{"text":"If you are going to eat at only one better restaurant while in town, EAT HERE.\n\nMy ratings","useful":0,"cool":0},"ap_OQQ_NBvXPtqRJIiudxA":{"text":"Went to nola for 4th of July week 2013 and tried all the local restaurants. I am sorry to ","useful":2,"cool":0},"YvcYxEIockhp7jr355Rwyw":{"text":"I've lived in New Orleans for 4+ years and somehow never made it to August. We usually sti","useful":1,"cool":0},"6wN379PrYFVXSjYvYYZ1Fg":{"text":"It was a mixed experience. The service, flavors and presentation were very good and the di","useful":0,"cool":0},"009lKqiOwb26B9YnDSiyqw":{"text":"This restaurant is amazing. It's beautiful, the staff is great and the food is incredible.","useful":0,"cool":0},"qjB3AdWtY2OV1KSPYKnGyw":{"text":"What a lunch deal! $20.13 for a gourmet 3-course meal and amuse. \n\nMost guests are quite w","useful":0,"cool":0},"qQagMd_k3Oc2ug2NJtUE7A":{"text":"So we came here on recommendations of other friends from foodie cities.  When we arrived t","useful":0,"cool":0},"lHdqfuMtWwNeRrG_eM-8gg":{"text":"This place never ceases to amaze me. Whenever I eat here, I think that the meal will never","useful":6,"cool":3},"GmCGjOeiXgIUBPhtCgRTWg":{"text":"Amazing dining experience. The food was beyond incredible and our server Nick was awesome!","useful":0,"cool":0},"y47nffVBAODsnZEnp2P_-g":{"text":"Oh my!  Where do I begin??\nThe gnocchi was to die for!\nMy husband and I split the \"breaded","useful":0,"cool":0},"CepfcvPBHaRlguC84J2d3A":{"text":"The food is exceptionally great!! Me and my friend sat at the bar and Matt was our bartend","useful":0,"cool":0},"O-ydp9iMBCB9qdG2W6SU8g":{"text":"This Prix fix lunch may be one of the most fabulous lunches I have had in a very long time","useful":0,"cool":0},"BwgVXPj5AjjMCipBNIoY4A":{"text":"We were processed by the over caffeinated Maitre'D.\nThe flounder was very dry.\n\nThe sommel","useful":0,"cool":0},"ERlAxYpIf21_NLavCquWjQ":{"text":"My favorite John Besh restaurant, hands down... Go for the cocktails, stay for the food.\nT","useful":5,"cool":1},"VDrnD5c-lZRJcvZrZdxRyg":{"text":"Skip the tasting menus if you want to find value.\n\nThe foie gras 3 ways is good enough.  I","useful":1,"cool":0},"bGjudmnQ7GK0UyI2WUEY3A":{"text":"I keep going to these super-hyped up places and feeling a little disappointed.  Maybe afte","useful":3,"cool":3},"Wwid5a10BVAwqv0XxD9-Gg":{"text":"Amazing food and service, traditional French cuisine with a modern twist, but neither too ","useful":0,"cool":0},"aVt0hm3DodePomxxtWD-Kw":{"text":"Absolutely stellar service, elegant and stately decor and incredible food! Gorgeous huge r","useful":0,"cool":0},"R8rwtuLJOgbQq19miEHS5g":{"text":"Terrific service, fairly priced wines, and inventive, beautifully presented food! What a p","useful":0,"cool":0},"6nhBGTHWncN6K-6W7fsmuQ":{"text":"A habit, a tradition, simply the best.\n\nGood enough for any important moments of your life","useful":0,"cool":0},"UPVt3OAW17R0fXwiiZ4YBg":{"text":"Went here back in the days after Katrina. Even in a world with no servers, they managed to","useful":0,"cool":0},"8fdSBNQlV7WVt1vSp82kEg":{"text":"Probably the best restaurant I have ever eaten in. The food is out of this world. The serv","useful":0,"cool":0},"0rsU7Cc-4fhVS47hJD06mg":{"text":"Just adding this is my favorite Restaurant. John Best puts different flavors in his food. ","useful":0,"cool":0},"P3LJpg_1yOvJkmMolWvV7w":{"text":"***4.5 stars***\n\nNo surprise, August is another success story for John Besh.  It's a fancy","useful":8,"cool":9},"BA6m-hHAWnQeKRH1wT2xSg":{"text":"Where to begin with this review, with such an outstanding experience it's hard to put into","useful":2,"cool":2},"bbVULYFJSzV2B8f5J9xgEA":{"text":"Update 11.29.2007\n\nOrder in the universe has been restored! Ate at August with a NYC buddy","useful":4,"cool":4},"x1JSgFt8WD3BA51CFC8vow":{"text":"Well, I'm disappointed in this former favorite in NO. The service was so far superior....a","useful":0,"cool":0},"Hdb-cWrznp0ig9hbh_B0yQ":{"text":"Restaurant August is perhaps one of the most overrated restaurants in this incredible culi","useful":0,"cool":1},"SkmgFZmihfokBrnvbL-KKg":{"text":"Possibly the best food I've ever had. The peach and goat cheese salad was amazing. Service","useful":1,"cool":0},"VVc95zwNjhvNAkWJafMZ3g":{"text":"August is absolutely my favorite restaurant EVER! Each meal is delicious, innovative, high","useful":0,"cool":0},"oiQEtgdDrl-9C8ObbgT6lA":{"text":"I live in LA and I feel like I'm pretty hard to impress when it comes to food. This place ","useful":0,"cool":0},"obQJFAkDAohLpEnn7TH5ZQ":{"text":"First let me say this place is gorgeous\nThe service was great but ended up being OVERSERVI","useful":2,"cool":0},"SdZ1S9aCgBStJAehxibV_Q":{"text":"Stop #1 BeshFest 2011 - Mission: Cocktails and snacks\n\nSlightly dazed from our day long, 3","useful":2,"cool":3},"fbFyw2FEWlHLevetGBq1aw":{"text":"December 2013. \n\nThis place overall is very classy and the waiters are very knowledgable a","useful":1,"cool":0},"XkNTuKJTZs1Lcy2M6W3nBQ":{"text":"Best meal I had in New Orleans - no question.  Anyplace that has bacon-infused bourbon on ","useful":0,"cool":2},"hWUrdlFlSJZOB2wPitrrqQ":{"text":"The food here was amazing.  Reccommendation - sample more appetizers with your table and m","useful":0,"cool":0},"NJ24NjEqtZ5HAHfDGcBcAg":{"text":"Saw this place on Food TV and it was highly rated so we made reservations when in town.   ","useful":0,"cool":0},"z-G2VxOjjaNgT1HHw1dDtw":{"text":"The lunch special is a great value and they throw in lots of tasty little extras. The serv","useful":0,"cool":0},"q8sVTL1RuRvAevQIJb19rw":{"text":"Wonderful experience in the lounge for a top notch dinner. I understand why it has been ra","useful":0,"cool":0},"_nSELpt2KNsEyq-Mhw2BPw":{"text":"Wine and food pairings were perfect. Pasta with garlic and tomatoes and mushrooms was best","useful":0,"cool":0},"6S_9XstNZGU0Pjr-l5RxHw":{"text":"NYC quality dining in NO. Dine here. You won't regret it.","useful":2,"cool":0},"ij9aVVXOxWjCq0oTi_HgHA":{"text":"A very enjoyable dinning experience.  The number of delicious flavors in each dish is amaz","useful":0,"cool":0},"fTBfBWthz44LFcTS5dk-Jw":{"text":"My husband & I fly into New Orleans several times a year to drive into Mississippi to see ","useful":0,"cool":0},"Om-C8p4TMDvHl3fsgcWd4g":{"text":"The food and service in this place was truly magnificient. Putstanding experience. Little ","useful":0,"cool":0},"zbsMv7xXy-mkCpib68K76A":{"text":"I'd heard about the five course vegetarian tasting menu so I had to check it out. It's rar","useful":0,"cool":0},"qbFgznfkbkZ-GTb7ezexnw":{"text":"I never write reviews, although I dine well quite often, but August must be lauded, even i","useful":0,"cool":0},"S8tRvQyb6u0_Vv9LCINbMA":{"text":"On my 2nd annual trip to New Orleans I was is such desperation to be whisked away by the c","useful":1,"cool":0},"DKqH1NbOdHsxt9shIKPKjg":{"text":"We were seated in the library - cozy, intimate and a little dark. The oyster appetizer was","useful":0,"cool":0},"05VJsZShHRKvvTK0IfgukA":{"text":"\"I think I cheated on my wife with this meal.\" - D/P (Shawn)\n\nChef Besh is a true culinary","useful":0,"cool":0},"pTIfR1KULzxm92-SVwS-uQ":{"text":"A classy place with great ambiance and friendly, but not stuffy, service.  To the food...\n","useful":0,"cool":0},"q7_6pA-SeYAHgaFwfeGQIQ":{"text":"August is very good. The chop salad is a thing of beauty; they prepare every component sep","useful":0,"cool":0},"PPJMOsWdLJ-0k3n_B34abw":{"text":"Small direct menu, not a lot of faffini.  Centers around seafood but with interesting spin","useful":0,"cool":0},"NLVd7YFhqjjOP-RgWN-V2Q":{"text":"We had been anticipating our dinner reservation at this fine restaurant by Chef John Besh ","useful":1,"cool":0},"HZXVi9x0mUrVu0j-NMeYXg":{"text":"This has to be one of the best restaurants I have been to in New Orleans. Well worth the s","useful":0,"cool":0},"DDggPug5XJtCqUNaXQze8w":{"text":"I came here on a Friday afternoon while visiting the city. Their lunchtime pre-fixe menu w","useful":0,"cool":0},"_8jYlMiC5BWD5E5OiaIGqg":{"text":"I don't know what else to really add to all the other reviews. This restaurant is pricey b","useful":0,"cool":0},"zHYNDHtKBfyA9JPY-6L26Q":{"text":"My fiancée and I dined here recently and our meal was excellent. The service was above ave","useful":0,"cool":0},"aranHdDByZMIklJ4hdevlg":{"text":"Both my girlfriend and I were very excited to try Restaurant August for my birthday, and m","useful":1,"cool":0},"SaR1rsGqv5sPmGAnQzgUsA":{"text":"Hands down this was easily one of the best fine dining experiences, if not the best, on al","useful":0,"cool":0},"3k84_XABYA6JNpP9dIp4bA":{"text":"I love shelling out for good food, and I will literally throw my money at this restaurant ","useful":0,"cool":0},"HznwDOdG9A1vx0Icr0tW9Q":{"text":"Everything was perfect: portions, service, flavor, atmosphere. However, I would have to sa","useful":1,"cool":0},"CkssGTWjw_AFRAPbr_AP2Q":{"text":"This restaurant is my top three. This establishment is marked $$$$, but really it's not th","useful":0,"cool":0},"TmD9RjXaq3wOd6Qjxgr6Xw":{"text":"Our first dinner in New Orleans and I was already so full from our cocktail crawl.The Reve","useful":2,"cool":1},"rlRlImVKQOaj8Sj9U13BTg":{"text":"This beautiful restaurant has not slipped a bit since Besh's exit. It is a gorgeous room w","useful":0,"cool":0},"6OEGKUpsjGkvJlQITyzsQw":{"text":"Went there for the 3 course lunch and it was great. We had a cauliflower type soup for the","useful":1,"cool":0},"z6LX8xaCSBAqtsTH1bldFw":{"text":"Restaurant August was a real treat.  Great ambience and great service as well.  Were were ","useful":0,"cool":0},"xqGhlQm8FOXs9Pnu8TKADQ":{"text":"I was in town on business, and so I ate here alone. While the rest of the conference atten","useful":4,"cool":2},"ijlIt5N9ncidDA2t6EssuQ":{"text":"Food is exceptional, space is beautiful. Service is exceedingly slow. I would recommend it","useful":0,"cool":0},"qzbd14QCVa65pvwhDqcKrA":{"text":"my husband and i dined here when we were in town for the jazz fest, second weekend.  the f","useful":0,"cool":0},"12pW9-MMaEC2mX5fgRppAA":{"text":"One of those great food but a little too stuffy places. When the atmosphere gets reserved ","useful":0,"cool":0},"V-4rq9lSDH8M_Gfp3CV9Gw":{"text":"If you have the chance to dine here and you don't go, you have missed one of the best dini","useful":0,"cool":0},"oH7RMvmigB-2sPCDdQAsxg":{"text":"We did the tasting menu for a special occasion. Every plate was memorable, every wine pair","useful":0,"cool":0},"525vRzSmJMUZ3jpM8HGQhA":{"text":"I've sat down a few times now to write a review for this place, but haven't been able to f","useful":6,"cool":4},"tc_JrRcat33NRqAuV1-fsg":{"text":"The Mr. took me for a decadent anniversary evening. A little fancy for my raggedy ass, but","useful":1,"cool":1},"2rC4yt5gRju5GmOD2WWs4Q":{"text":"Oh. My. God. Best meal we've ever had!","useful":0,"cool":0},"Cw06dC8dl5z1LlGaF4KHOQ":{"text":"Well I think that their Friday (only) lunch is the best that I have ever had. 3 courses fo","useful":0,"cool":0},"49KmOJ6G3_5TBMKt3EmQ2w":{"text":"Hands down our favorite restaurant in New Orleans! \n\nWe arrived early for our reservation ","useful":0,"cool":0},"bmgP0PfDG_sAzBFtor5xVw":{"text":"Fun and delicious but not enough food for this hungry girl...guess I should stay away from","useful":0,"cool":0},"dzVOIWzQVmH1bZnS8w2snQ":{"text":"This was only the second time I had eaten here and it even surpassed the first time which ","useful":0,"cool":0},"7-x3t5mjzb8PDJKc8B1hrQ":{"text":"I tried the prix fixe lunch, and you can't beat that deal.  There were things on the menu ","useful":0,"cool":0},"azrrrs8rLLus0dZLIANKVQ":{"text":"One of the best meals we've ever had!\n\nDining at Restaurant August was incredibly memorabl","useful":0,"cool":0},"F11oYWB2JXO3Hzxn1FcxoA":{"text":"Flew into New Orleans to visit family. Took the wife to Restaurant August because she was ","useful":1,"cool":2},"euZiGtUlkzUCf0yGm_zgGQ":{"text":"One of the best restaurants we have ever dined with.  Service was superb and passionate.  ","useful":0,"cool":0},"ntkqmSXyjfAHQA44VpJR2Q":{"text":"Located downtown, almost directly across from Harrah's, August is in a beautiful space, wi","useful":2,"cool":0},"K5bos6WgQh9xuLDIpZuQqA":{"text":"This place is my favorite restaurant.  Period.  The degustation is fantastic and the wine ","useful":0,"cool":0},"hwUeQtdpseb-QLIbQRWZGw":{"text":"Again in New Orleans ... exited....happy to try  this food again my  husband loved this pl","useful":0,"cool":0},"b8YVtBKVD2ObECmjZCLRIg":{"text":"Possibly the best meal in my life! I had the potato gnocchi to start with blue crab, black","useful":1,"cool":1},"V0tcOjq7yAw87zKw7lTLaQ":{"text":"We returned to August on Friday, August 28th.  We were a little apprehensive about returni","useful":0,"cool":0},"irBG0b-wKZgXKXAtHzD1CA":{"text":"*Mobile Review*\n\nCame here bc it had an excellent rating.\n\nDecor: 4.5/5\n-Bar is separated ","useful":2,"cool":2},"mjVtGVok5MhfxAKCrcXZbw":{"text":"Hands down, one of the best dinners I've ever had. As a vegetarian foodie (self proclaimed","useful":0,"cool":0},"MvNy7Zw2kEuPuxVIkNDt2g":{"text":"I am clearly in the minority, but I wasn't really that impressed with Restaurant August, c","useful":3,"cool":1},"qRpPOsNfju8tFooK9sN8bQ":{"text":"I usually do not provide many reviews, but I need to share our experience at August.\nA rel","useful":0,"cool":0},"xg5kWXBDQAucYu31eMrZWg":{"text":"We went for dinner and I have to say without exaggeration that it was far and away the bes","useful":1,"cool":0},"myvJi2R4CklhYLX91RVtNA":{"text":"I love fine dining. I thoroughly enjoyed my meal, and great customer service. I will visit","useful":0,"cool":0},"jKh-fyrpHrp4k226j5XyAA":{"text":"lunch 04.25.  the dining experience was outstanding.  5 stars 4 ambiance, staff, food prep","useful":1,"cool":1},"AR4p7aIAsR6LuwIQb1tCvg":{"text":"I would have gave it a 5 star review, but the matredee kept coming over and talking to us.","useful":0,"cool":0},"qnifwSUgS7zU4j7IXi987A":{"text":"Goat cheese cheesecake oh my. It brought tears to my eyes. August rivals The French Laundr","useful":2,"cool":0},"bn9AC69bKYxHlOrgq73P9A":{"text":"This food was phenomenal!!  John Besh is a food artist.  My favorite restaurant in New Orl","useful":0,"cool":0},"J5QhGQL8kO-1yQsJzrrjbA":{"text":"A great meal and wonderful atmosphere and service.  I don't think I've ever felt so at eas","useful":1,"cool":0},"PfQaFKHqBbVBTZk8K_kNAQ":{"text":"I visit New Orleans regularly and love the food. Was looking forward to August with a bunc","useful":0,"cool":0},"Be7D6RiHhyWe8Bf1dtrHkQ":{"text":"Great food always has been.. Unfortunately if you have dietary restrictions is not the pla","useful":0,"cool":0},"4XiE8DtmFYiPrXzvkPl1NA":{"text":"This is just the best restaurant in New Orleans.  We have been coming to nawljns for decad","useful":0,"cool":0},"2DW6EA46zhxal-l_KwehGQ":{"text":"We came to this restaurant at 7:30pm on a Saturday night hoping for some availability. Alt","useful":0,"cool":1},"XfsX1kwOiNWvMgE1mQrsug":{"text":"Definitely not just food...it's an experience. After eating at Luke in San Antonio, defini","useful":0,"cool":1},"efGGKpZ-yqFSxtp2yaDLBQ":{"text":"Market vegetable chop salad may be the most beautiful thing I've ever seen on a plate, and","useful":1,"cool":0},"gk1GjfwGZC0KCIhUMRJvrg":{"text":"This is the ultimate New Orleans dining experience. I love dining in New Orleans, and do s","useful":1,"cool":1},"Pi4rkr9xQ4mQ1ss9BgFdSw":{"text":"Went on my first date with my future husband here. It was such a magic night. We had dinne","useful":0,"cool":0},"3meMGzaTnRkIKam-AkOGIg":{"text":"Definitely a nice fine dining experience for New Orleans which i do not believe holds many","useful":0,"cool":0},"1mkVD3AE28wzAeh0snGmzw":{"text":"Have you ever had an oral symphony? I hadn't until I ate here. I would mark this the best ","useful":0,"cool":0},"sCR5Q6LKyNz28bqP3iwyag":{"text":"Very good French cuisine, though not as good as the price would indicate in my opinion. I ","useful":1,"cool":0},"zHIEcVQl67Yg6PX-5zNOMA":{"text":"The best foie gras dish ever!!  Every component was so one of a kind. My favorite entree w","useful":0,"cool":0},"gRGX0BPE6rzxoorv44My9g":{"text":"I LOVED August, one of my favorite fine dining experiences in New Orleans. I had the bigge","useful":0,"cool":0},"sWpocbw8QZ3dQfkyLoFQbQ":{"text":"I can't even begin to describe how amazing August is! The cocktails are delicious and crea","useful":0,"cool":0},"fh1AvBcxfm_gB66SCHkWug":{"text":"Top notch dining experience.  Beautiful place, fantastic service, and exceptional food.  T","useful":0,"cool":0},"q7uYrOg3k9MfT2zIIyIrbg":{"text":"Great food experience in NOLA.  \n\nWe'd wanted to eat here for some time, and were very ple","useful":1,"cool":0},"74IYoPYV3_8csgYMoz6cog":{"text":"I had a wonderful dinner here! I'm allergic to dairy products. After I ordered the chocola","useful":0,"cool":0},"6-YxI62Q4UQkKAMrVjxyng":{"text":"Some dining experiences are enjoyable, others are memorable for different reason - Restaur","useful":0,"cool":0},"w7VlNjmumzSSMFvpT1FAMA":{"text":"We went for the Friday brunch and had excellent service. The 20 dollar 3 course meal was a","useful":0,"cool":0},"Q6E4DiP1v-Ky9V3plp_8EA":{"text":"My first meal in NOLA during my 4-day trip did not disappoint. I was\nimmediately impressed","useful":2,"cool":0},"hM8JvmDC40-7mSwNij1GSw":{"text":"Second visit to August -  First visit a few years ago was awesome   This not so much \n\n1. ","useful":0,"cool":0},"2TO8yVoQHwJo-QG6GxkyTA":{"text":"I arrived in New Orleans on a Friday morning, and after a stressful departure from Chicago","useful":1,"cool":0},"MDTrqbcjpv01aEkM8DwV4w":{"text":"If you're dining NOLA, you will likely dine at a place that he owns or is involved with. A","useful":3,"cool":2},"FD4xdqO46Z3NghVZLKJEWg":{"text":"Utterly amazing. Strongly recommend.\n\nI was afraid I'd be underdressed in a polo shirt and","useful":0,"cool":0},"6zTEH8sEppXklC750Cvd7w":{"text":"Exceptional service and creative food made this dining experience wonderful.  \n\nI have nev","useful":0,"cool":0},"E8B0tO1phLwn60YVuq6KtQ":{"text":"Every thing was perfectly prepared.  The snapper with sauce was out of this world.  Desert","useful":1,"cool":0},"dZ96tREEXIcNrsxMWEm63w":{"text":"Wife and I are foodies and we left Restaurant August completely satisfied.  The chefs tast","useful":0,"cool":0},"CQYkIk_Krs_FlD97pJRwEw":{"text":"\"Degustation\" tasting menu was mind-blowing.  12 courses over 4.5 hours for our party of 6","useful":0,"cool":0},"oWe0NjO7kjQzPYUdNQCm5g":{"text":"A once in a lifetime dining experience. While the staff could have been stuffy they were a","useful":0,"cool":0},"IcSAmsPvr0baka37-fzPsg":{"text":"My experience at August was very satisfying.\nAll the entrees and starters were top notch a","useful":0,"cool":0},"wCxDPGxzu10auxYTVSZrEw":{"text":"Easy to park, service is top notch, and a really nice, beautiful space.\n\nHowever, my group","useful":0,"cool":0},"zgd-pokApLKeg4akp2e4Uw":{"text":"One of my fave meals in all of my 31.5 years!\n\nDid a Farmer's Market tasting menu with win","useful":0,"cool":0},"yW8pkOA6d2gikjUnL99Abw":{"text":"This place has a very nice old school classy feel when you walk in. The staff are superbly","useful":0,"cool":0},"5HsRh25HZTwnMfqhOmWysg":{"text":"This was our last night in NOLA and we were recommended August by our server at Commanders","useful":1,"cool":0},"ugp08KJBMzPh9KUo78UR6A":{"text":"Wonderful meal from start to finish, and an extensive, varied wine menu as well. You reall","useful":0,"cool":0},"yEREllQJ_7gFOlDBmstBvA":{"text":"I was looking forward to this place, but had to deduct a star based on service. We arrived","useful":0,"cool":0},"N7vRAIjs_guVM12xfLhxmQ":{"text":"I suppose I'm one of the few who did not enjoy my experience at August. Our waiter did not","useful":0,"cool":0},"LZVOAb7EgMVmU61NcGihnA":{"text":"Dear Everyone at August that Makes it So Special:\n\nMy husband Victor and our good friends ","useful":2,"cool":1},"QlUoO_W-r-00Xz0rjSh-2A":{"text":"Awesome restaurant in New Orleans. Service was impeccable and the meal was delicious. With","useful":0,"cool":0},"kB949o7n858ojfSbkOr76A":{"text":"For my birthday, my hubbie surprised me with a lovely dinner at Chef Besh's Restaurant Aug","useful":2,"cool":1},"V2J4nObH-7aMIy4gYZ5-ng":{"text":"Fabulous food and wait staff.  A very elegant dining experience, but the wine list is as u","useful":0,"cool":0},"Ua0PA1kLOo3UqCdqV6YQ6g":{"text":"we celebrated our 58th anniversary at August in March. the meal was outstanding as always,","useful":0,"cool":0},"UfQgTkgraJSKObfdhgvJEA":{"text":"Excellent dining experience.  Every dish was delicious with a non-traditional twist (and t","useful":0,"cool":0},"YG3h1etAAs0YR1w49bI_ig":{"text":"Like all the food I had in New Orleans is was quite rich and quite good. I tried several d","useful":1,"cool":1},"YkBJYqBaYCqrLRxirygxcg":{"text":"I just finished my second meal at a John Besh restaurant today. The first was American Sec","useful":4,"cool":2},"dLlD17cnCS-4E5ujoxwOnQ":{"text":"Best food we've had so far in NOLA.  Hands down so much better than Antoine's.The crab and","useful":0,"cool":0},"nqJIyExuVUSmA2mXiWELAg":{"text":"A 5 star place all the way!!! The gnocchi is unmatchable, I can say the same for the devil","useful":0,"cool":0},"bSMTtBknsRbCKIqO6ieJZw":{"text":"Nice ambience, nice food. I had the fried Oysters and they were a little soft for my taste","useful":1,"cool":0},"db7Ns2dBelwff4F8f8Xm9Q":{"text":"Every foodie should eat here. EVERYTHING was excellent. Pricey but worth it. Didn't see a ","useful":0,"cool":0},"xCPS9YmNlQlzin9aC-3sDg":{"text":"This place was fantastic. I had the duck and my husband had the trout and lobster bisque. ","useful":0,"cool":0},"EF0yhcQhOHii-l5kW4sGJg":{"text":"Absolutely amazing!  We had a 10 person private table upstairs.  The food was amazing and ","useful":0,"cool":0},"SjGjm9zimzLnUGY-dovVbw":{"text":"Food ranged from great to meh. The matsutake soup was delicious, the best thing we ordered","useful":0,"cool":0},"UKEwzfJsWVYgkHXE3xb38w":{"text":"OK here we go, if you look at my- who am i,  you will understand me when i say i have been","useful":1,"cool":0},"tlVF0f5zRHFaW7rxUO-mtQ":{"text":"It's still worth planning your NOLA trip around a Friday lunch at August.  The 3 course pr","useful":0,"cool":0},"N9iEXv78N7Mk27Dsr-s-6g":{"text":"This was a worthwhile restaurant to spend our birthday dinner together. The fig and mixed ","useful":0,"cool":0},"EbNjShE2lPzBiFt8CY4UpA":{"text":"Looking forward to my meal at August, I have to admit being a little worried. Chef Besh is","useful":4,"cool":3},"nN9mF_AiW1xlAuPnmRx5Sw":{"text":"Look for Amber behind the bar...kicking butt and taking names.  By that, I mean that she i","useful":1,"cool":0},"Z6N4PYH7D45UnMhUiIOYRA":{"text":"Dear Mr. Besh:\n\nWhat has happened to Restaurant August?  We dined there Valentine's Day at","useful":3,"cool":1},"d58iJq9s2iRXjllFx1gILw":{"text":"A John Besh restaurant! Great place for a more serious date night. Definitely higher price","useful":3,"cool":1},"MMxux1NGF9OT5RRWPwTqNQ":{"text":"Absolutely delicious French food. It was dish after dish, non stop from appetizer to deser","useful":0,"cool":0},"gRam9u2ufbKCemBDPcMhVg":{"text":"After all the stellar reviews I expected so much more. We went with 2 other couples and at","useful":1,"cool":0},"3B7kC_rXfg83EYHnfoyA3Q":{"text":"My meal began with an amuse-bouche from the chef, an eggshell filled with some sort of crè","useful":1,"cool":1},"WQxTZ1iddRzSBjrcB7Mayw":{"text":"My husband and I popped in early on a Friday with no reservations, and were seated in the ","useful":1,"cool":0},"J1IWSCWRkBh8ctH9VBajUA":{"text":"Our dinner at August was fantastic, but be prepared to spend major $$.  A 6-course menu wi","useful":0,"cool":0},"7P5UdYqM-l7ZOA3RjcY4qQ":{"text":"The service alone that you get here is worth the trip in and of itself. They are friendly ","useful":1,"cool":1},"HhpJO0X2H_FFoxsxVr7CjA":{"text":"It was difficult to get a table so we ended up in the bar.  They offered full menu.  I ord","useful":1,"cool":0},"IjnlXz2IxrJqDLbt8_m1lA":{"text":"One word - WONDERFUL! We went to Restaurant August with another couple during a long weeke","useful":0,"cool":1},"dBcoyMx_8K-n5AICn4sXQg":{"text":"Good beer, food and people. Easy access from Westin down town.","useful":0,"cool":0},"ID8V4QlwuVHgPFu0k71D7Q":{"text":"My new favorite restaurant!  I had trout ponchatrain for dinner.  It was cooked perfectly.","useful":0,"cool":0},"BROd35oMZ0EjQCtFiVuCFQ":{"text":"This was my favorite meals in New Orleans and one of my favorite meals period. We stopped ","useful":0,"cool":0},"GXvCsB_G5-4XYMHfDB2Qpw":{"text":"We had several large group dinners in New Orleans, but the food at August was the best of ","useful":0,"cool":0},"EdyCvsDXHZ53bsG7Xz506w":{"text":"My wife and I had dinner here for our 1st wedding anniversary. The. meal began with a real","useful":1,"cool":0},"Q3PHlxBltLUho3i33z1H0Q":{"text":"Amazing!!! A little worried from some of the other reviews but was soooo happy we decided ","useful":0,"cool":0},"hyJKTSt6mrVnXz0_cKxTjw":{"text":"This was, without question, one of the top five dining experiences in my life.  The servic","useful":0,"cool":0},"8zKoGmJPdQMNWFZrC5hHag":{"text":"Fantastic!!!\nSpent more money at other well known restaurants around the world but this pl","useful":0,"cool":0},"8_Xhby9dU0P7Is28XU7ZUA":{"text":"Went here for dinner with some friends and had a very nice time, although it was not AMAZI","useful":0,"cool":0},"blMv-zX0j9ysYzwH36MiQg":{"text":"My absolute favorite NOLA restaurant HANDS DOWN. Attentive but discreet waitstaff, beautif","useful":0,"cool":0},"9BcgvdGvRAFxG_z9yNileQ":{"text":"Rush, rush, rush.....we were in and out within and hour and 15 minutes. The food was lovel","useful":1,"cool":0},"ggrPIXHh1b2-TnnVdMCqwA":{"text":"If I could give this six stars I would!! Matt - our bartender - was wonderful, friendly, a","useful":0,"cool":0},"pTEwpjekydmfSn4cb_UUBg":{"text":"We were a party of 7 that was coming to dine for lunch at August, and we were set up nicel","useful":0,"cool":0},"4SrDwhfids374aVnXwwBDA":{"text":"Went for lunch and WOW, what a meal. The service was top notch; very professional and genu","useful":1,"cool":0},"n-2TYv0hZmjZx5oJQ3Ka5Q":{"text":"The food was unique and impeccably served. We had a group of seven with everyone having a ","useful":0,"cool":0},"aqG6Ivp4Se6mH-dOHyYvmg":{"text":"I had my best meal of my trip to NOLA at Restaurant August, hands down.  Both the food and","useful":4,"cool":1},"wCsO5zEaETDoN1C9t8u6VA":{"text":"Restaurant August was darned near perfect.  My wife and I recently dined there for our wed","useful":0,"cool":0},"pgI2cqezGjVClbugeo3Urw":{"text":"While the service was a bit stilted at times, this is one situation where the food and win","useful":5,"cool":4},"FTDNsSMMMneYEkaUNeYW6Q":{"text":"Amazing experience and awesome food\nVery expensive But worth every penny \nAnd really not e","useful":0,"cool":0},"aamdWG7I4VO6tXTT5xlPjQ":{"text":"My husband and I ate here for our 1 year anniversary. My expectations were high, the appet","useful":0,"cool":0},"T6BLQM9045g-y2fs_jSE8w":{"text":"There is a reason that New Orleans is considered the food capital of America.....this is i","useful":1,"cool":1},"UoUmMiKiq_MzyAgKHaE_4A":{"text":"Wow! This place was just unreal. Everything from the service to the parking (they have a f","useful":1,"cool":1},"bWnwVx9et2UHzwzP3f5xZg":{"text":"Second verse same as the first. One of the best restaurants in New Orleans. Excellent wine","useful":0,"cool":0},"1MSdyAh-TKJDH8nxI7L0Qg":{"text":"My wife and I had the 3 course prix fixe lunch.   This is absolutely the best deal in town","useful":0,"cool":0},"kzZ9YqHSvLSbrOS_jUSgCw":{"text":"Skip it. Don't believe the hype. \n\nHere's what you can expect from a visit to August; an e","useful":4,"cool":0},"Awfqbg9Xk7Y7RMJmJPK3aA":{"text":"The food was fantastic.  I highly recommend the four course dinner. \n\n The place is quite ","useful":0,"cool":0},"wjsyWVmE-sFp53lFeUhWoA":{"text":"Restaurant August was a breath of fresh air. Beautifully decorated, great service, not stu","useful":2,"cool":0},"EQbbHAlLW5EoRDstELu4vw":{"text":"I've been to August twice.\n\nThe first time was not overly memorable - that is, I was not w","useful":2,"cool":0},"TdS1XX5qxeIB69kt-6n-SQ":{"text":"Writing this review makes me want to question every other 5 star rating I have given. This","useful":0,"cool":0},"yE45uQzL063yN9shej3t9A":{"text":"I am a little late with this review - my husband and I had the prix fixe lunch at Restaura","useful":3,"cool":0},"xqiisvJUv2MaMb1_WNppMQ":{"text":"High fives all around at this joint! It was a treat my friends and i highly recommend that","useful":0,"cool":0},"Ix1HpcdPRsLziC6uP_LnHw":{"text":"I went here for lunch this afternoon. My goodness the food is wonderful! I'm in town for a","useful":0,"cool":0},"Ay0ahmg5ldl60tpGfVrAaQ":{"text":"One of our favorite restaurants in 2017. Service was impeccable. Can't remember the name o","useful":0,"cool":0},"Ohx2WdAslijnFqvuejG1kA":{"text":"Whenever anyone asks me about the best restaurant meal I've ever eaten, I respond, in a re","useful":2,"cool":4},"Kvppvyuh1CsV6pJWDr3bwg":{"text":"New favorite!!!!! I had the shrimp étouffée, roasted duckling, and the goat cheese cheesec","useful":0,"cool":0},"2SmRKIJ9tyulC_vM5EB4bQ":{"text":"My wife and I ate here with John R earlier this year when we visited New Orleans for a wed","useful":1,"cool":1},"JKCrc0eYPLm7N8aJN9HUAQ":{"text":"One of the best meals I've ever eaten. I had the duckling and my wife had the grouper. We ","useful":0,"cool":0},"xbJSP3FroF1ot4jmhjaYpg":{"text":"Easily the most expensive and most creative meal I had during my recent trip to the Big Ea","useful":0,"cool":0},"y-4pmLuNK0-DX6K0FtZ4uQ":{"text":"The place is handsome. The service is outstanding. The food is mediocre\n\nOnly the first di","useful":0,"cool":0},"2WMByqXQCNlHvCFuWKVwCw":{"text":"This service is excellent and so is the food.  We were greeted warmly and our table was re","useful":0,"cool":0},"OQ4Allxzlm2VmsNvQx7kdQ":{"text":"I went to Restaurant August last night for the first time because of the $35 dinner specia","useful":2,"cool":0},"J_AqRLtF5syXL7h0bQx39g":{"text":"Restaurant August for dinner.  This was our first time to August and will definitely not b","useful":1,"cool":0},"fwunfXF-UtJAlTJiVMHKlw":{"text":"I'm not going to detail the nine course tasting I had here. What I will tell you is that t","useful":0,"cool":0},"fvDqxZvWdl6bO95onu-DSQ":{"text":"Pricey, but soooo worth it!! Staff was wonderful! They really made us feel welcomed and we","useful":0,"cool":0},"vPqXGDrjuIOGchY-dhsqrQ":{"text":"John Besh has to be one of the nicest people you could ever meet.Oh,and his restaurant is ","useful":0,"cool":0},"8d-IlChabiKUna8bgt5tXg":{"text":"Went to August for our first anniversary and now for our tenth. My wife and I had a great ","useful":0,"cool":0},"WMbHYTALjHa1Ttpcxsvlsw":{"text":"We took advantage of the Friday Fixe Price Lunch.  It was an amazing deal!!  Food was deli","useful":0,"cool":0},"335FQf9542KNMcfcN6QyFQ":{"text":"Five stars for the AMAZING lunchtime offerings.  We had a great experience here in Decembe","useful":2,"cool":1},"UYSO4_BvSz0s6izoiCPy5A":{"text":"Just excellent!! Took very good care of me as a vegetarian !  Shout out to Lucy who is sim","useful":0,"cool":0},"ZCW5uJnZ7nqo3kxbS5C5VA":{"text":"$20 prefix is an amazing deal. Probably the best food deal I've ever experienced in my lif","useful":0,"cool":0},"donA9zGT3i1HKWuWoNU9sA":{"text":"August was possibly the best meal I've ever had in New Orleans (and I've had a lot)!\n\nFirs","useful":0,"cool":0},"5Y18eps2VRmnXaBgzoKW_A":{"text":"Decided to visit the John Besh flagship on a regular visit to NOLA - joined a local friend","useful":0,"cool":0},"9HNOu36qIiSpzHH548kKoA":{"text":"I found August to be slightly stuffy.\n\nIt is the sort of restaurant where I am given all s","useful":16,"cool":10},"xZqO4TDIFZVIQWxbUhHwgA":{"text":"We unfortunately tried August as they were in between hiring new chefs.  I had part of a p","useful":0,"cool":0},"Afjps8RYKPHhWPfzzYissg":{"text":"I am gluten free (celiacs), and everyone there knew about what foods I could and couldn't ","useful":1,"cool":0},"ymir64WFbtEEbok9iyMWYA":{"text":"This was near the convention center so I thought it'd make a good place for lunch, especia","useful":0,"cool":0},"-h7lWXU8YG8iXjYwCDkmAw":{"text":"This meal was perfection. Service was fantastic.\nStarted with the goat cheese and pear sal","useful":2,"cool":1},"Z-zm8Uxe3nm6T1B2L5z6Yw":{"text":"Very upscale restaurant with classy décor. Appetizers and deserts were beautifully done. B","useful":0,"cool":0},"GNkmszPTPLpAXbyJc1REIw":{"text":"I will join the chorus of the previous reviewers who praised the lunch prix fixe.  There i","useful":3,"cool":0},"C8ubDf9ydRi3NQipVcQxQQ":{"text":"When it comes to the cuisine, August served up the finest experience of our three days in ","useful":2,"cool":0},"1VrT7wAIn1QgCEydeeZXkw":{"text":"What a disappointment. Our favorite chef in San Francisco recommended this place. The serv","useful":3,"cool":1},"Ez8xlFZqrfjGoGcYsHtVAA":{"text":"Just a great dinner overall.\nThe service was top notch the entire time- they really got al","useful":1,"cool":0},"_1x3QFkZFD71747Aa4pkZQ":{"text":"My wife and I dined at August in 2006--when Chef John Besh had just competed on Iron Chef-","useful":0,"cool":0},"pLuiqHx2Snopy4rT0Tk17A":{"text":"Amazing!  I don't think of this as a \"steakhouse\" at all even though I did order the Waygu","useful":0,"cool":0},"7kWkr05-B4CercY5M0h1vQ":{"text":"Hubz and I had a pretty close to perfect experience at this gem of a restaurant. We came o","useful":0,"cool":0},"8x_uZVPm-sdZxWzTI2Cjrw":{"text":"I love this place, I try and go every time I'm in New Orleans, the cocktails are delicious","useful":0,"cool":1},"iUS3W-Yr10SSxqakg_Qwrw":{"text":"Super great lunch for $20.15. Make RSVPs early. We tried at 11:30am and they were full. We","useful":0,"cool":0},"mqjilehtc7iae1Gnt7YVXQ":{"text":"Wow!! What a beautiful meal from start to finish. We were able to get in day of for a 6:30","useful":1,"cool":0},"5h0gncdZdMmrgZfGc-9nsA":{"text":"I don't deal well in these sorts of \"fancy\" restaurants .. The tables were so close to one","useful":2,"cool":1},"YcPtIPUkboaiUjaeqY432w":{"text":"I've traveled all over the world and eaten in the finest restaurants anywhere. Best meal I","useful":0,"cool":0},"V4O0ZZznTz-wBYTaV3mCgQ":{"text":"Restaurant August can make you do crazy things. For starters, how about a dinner reservati","useful":3,"cool":1},"qjmLEUd0cSNTAtTKyyeskw":{"text":"Very classy upscale restaurant with great food and even better service. Perfect restaurant","useful":0,"cool":2},"S_gPgMDcFGwhUwagtm-riQ":{"text":"Has the 4 course tasting menu with wine. It was a slightly unusual dining situation becaus","useful":0,"cool":0},"kj9pdk9k8bFGPZ1PVGeA3g":{"text":"This is only my second review on Yelp in over a year, but I feel compelled to warn my fell","useful":1,"cool":0},"5TYwYBCV1aaP60zpRsfw0Q":{"text":"I *really* wanted to like August more than I did. I think Chef Besh is pretty darn creativ","useful":4,"cool":3},"xfUB2HpI1ygkrg6Kxp1B_A":{"text":"My overall opinion is....meh. \n\nWe arrived on time for our reservation, but ended up waiti","useful":0,"cool":0},"VZvZz9pWqQbpvy8otbKfnw":{"text":"Amazing place for lunch.  One of the best anywhere.  No disappointments with anything we o","useful":1,"cool":0},"mpGFkLy52d_F4ef_16u5fQ":{"text":"I planned a last-minute weekend trip to NOLA which coincided with a medical conference. I ","useful":3,"cool":1},"ILFF2OmKbRGrysrV3gnvDw":{"text":"Absolutely fabulous experience. \n\nI'm a fan of Top Chef and John Besh was one of the maste","useful":1,"cool":0},"M4PHsd1RN13eFofIxAsqJQ":{"text":"Great food and service. The lunch prix fixe menu is the best deal in town. The chocolate h","useful":1,"cool":0},"UCNnfmD-cxvMT-RPUyDdVA":{"text":"Our favorite restaurant in town! Love the menu changes so we can visit regularly and have ","useful":0,"cool":0},"ECtLhQpgEQiOSOHPz3iIvg":{"text":"Tried tasting menu with wine pairing- service just average- surprisingly-waiter not knowle","useful":1,"cool":0},"szqJQS_-Q9BdqyUyoHBceQ":{"text":"Loved the Chopped salad and 3 amazing appetizers (the gnocci, the oyster trio, and the bee","useful":2,"cool":1},"1x9uNrA80z7qV8NCrTM9Xg":{"text":"By far, hands down, the best meal we have ever enjoyed!\n\nWe were in town for my 40th Birth","useful":0,"cool":0},"RvzZ7vU0A1Sq27_34RS8fQ":{"text":"This was the best restaurant of my week trip in NOLA. Great service and delicious food. Th","useful":0,"cool":0},"lYWj0PhNkX8uB-oQG2s6NA":{"text":"The service here was phenomenal! I ordered off the prix fixe menu the butternut squash sou","useful":0,"cool":0},"qht9ysiWm0-BW0-HVwzZSA":{"text":"I had high expectations for my solo lunch here and I left feeling very satisfied with all ","useful":1,"cool":0},"PhynQaKZVWTNC2y6ktqKhQ":{"text":"Went here for lunch.  The pre-fixe menu didn't look that great so ordered the blue crab sa","useful":0,"cool":0},"jPcAIHZZtS1kEFgpt_R_KA":{"text":"Through Instagram I saw an event at August for a Classy Cookies class with August's Pastry","useful":1,"cool":0},"HAeA_xGifJoIJ58gbvjn-g":{"text":"Just not liking this place. The ambiance and service is top notch but this review is about","useful":1,"cool":0},"FitvJFjcuvZ2ZDy3kPb5PQ":{"text":"Delectable food. The tasting menu was excellent. Great variety. Caviar in the chilled cucu","useful":0,"cool":0},"Dvi61ZMm3zv-2aLBZGCoZQ":{"text":"I was really excited to go to August for dinner during a recent trip to New Orleans with m","useful":0,"cool":0},"k5_pedco4MSQWmke1_kLKQ":{"text":"I have to admit I have a huge crush on Chef John Besh and I've heard such great things abo","useful":1,"cool":1},"m6plmmOqlC8qoEny1-fGpQ":{"text":"Holy what the...  We had an incredible dining experience here, so much so that we were del","useful":0,"cool":1},"PMUYxonRSzgdan4J0K1sLA":{"text":"Rib eye dish was good, except they left thick, hard string around the cut of beef, which I","useful":2,"cool":1},"bpZwWmm2PebFC19UwBGRmw":{"text":"The BEST gnocchi we have ever had -- my husband looked at me sadly and noted that after th","useful":0,"cool":0},"3N2DEahFma0LVzcuBcgbiw":{"text":"I came to new Orleans for a 5 day conference. After reading the reviews, I immediately boo","useful":0,"cool":0},"SRtwi8uoN2Fn0Z_lZYP3Rw":{"text":"Lunch for $20 was the bet $20 I've spent in a long time. Yum yum. Every bit was amazing! I","useful":1,"cool":1},"Pq6njiZl-CCpB213l2emEQ":{"text":"First I should tell you that if you are walking and using GPS the address takes you to the","useful":6,"cool":4},"p4WAw9-yyerxsw1Doz_rbw":{"text":"The sommelier was probably one of the better wine stewards I have come across.  She really","useful":3,"cool":0},"_DS4rNTplXFtoBOP5uFCbQ":{"text":"Mixed feelings on this one. Brought my mother-in-law for her 60th. She was very impressed ","useful":0,"cool":0},"XWVfO-Pov6X3dS9r_LEgWA":{"text":"Very friendly staff. Perfect accommodating special requests. A little funky but good.","useful":0,"cool":0},"ZjMfG74xWTWwX7pn5krj9A":{"text":"My wife took me there for my birthday.\n\nIt didn't turn out well. \n\nFood and service were j","useful":1,"cool":1},"Kh7nGPH3awZFXhQAOOsxBQ":{"text":"Made a reservation for lunch a few weeks ago so no wait when we showed up on Friday around","useful":0,"cool":0},"MuEeHQq5ua6Qngn-zyC15g":{"text":"I've had better service at Olive Garden.  A $270 per person meal with wine, a waste of mon","useful":0,"cool":0},"mo3wetyYgxBFA6xSVaHH6A":{"text":"Restaurant August is in a beautiful old warehouse, that was converted into a house, and ev","useful":0,"cool":0},"h3wIoyKoTWXedAS46ZEq6g":{"text":"definitely in my top 3 new orleans restaurants. along with commander's palace and cochon. ","useful":0,"cool":0},"Bh00TszmBivCt4X_qA_cMg":{"text":"Coming to New Orleans, my restaurant must was Restaurant August and it did not disappoint.","useful":5,"cool":0},"bfNp58DIjseacTUBnsDRGw":{"text":"I have always wanted to eat at a John Besh restaurant. His cooking has always intrigued me","useful":0,"cool":0},"Tny8mhQn-zN6Gf_SymuQKg":{"text":"Fixed lunch menu superb!","useful":0,"cool":0},"4aPjBsU_kGVplr3cS5nLsA":{"text":"This was my second time at  August, I had gone there two years ago and remembered the expe","useful":0,"cool":0},"DYUC19b0hDkG40vS5gPR0w":{"text":"Very good service, the waiter was extremely polite and helpful. Nice atmosphere. The food ","useful":1,"cool":0},"U1r-kc6h8OPnz5L1oyEXOw":{"text":"A relatively classy ambiance, August is considered one of New Orleans' top restaurants. I ","useful":0,"cool":0},"tYSqXINRciIeJs8l7gSpEw":{"text":"aah was dying to try this place out but  was disappointing. We were expecting so much more","useful":1,"cool":0},"tj6ypJ60lXZvlzWGeZBRpQ":{"text":"I am so happy that I can finally leave a positive review for my New Orleans trip.  This wa","useful":1,"cool":0},"zyGLadoYuJNJq0RPs7rJyw":{"text":"I'll keep this short and simple.  Fried oysters are ubiquitous in New Orleans and pretty m","useful":2,"cool":1},"Wm9GaiPGzvK8KK-2WJKwqA":{"text":"Pros: Great presentation, excellent  staff , and value. \n\nCons: Small serving (Ideal for p","useful":0,"cool":0},"HNvWF-199TqqXO9ZVxRb-w":{"text":"If you are in New Orleans, you should check this place out. The food is very good and the ","useful":0,"cool":0},"aNW8jAOUgrM1kTtPLB1CQQ":{"text":"This place recently started offering brunch so we decided to give it a try. Nothing short ","useful":1,"cool":0},"q5LQTfr9w-CvgGF2t6MjSQ":{"text":"My two star rating is relative to expectation and the fine dining level of August.  That b","useful":1,"cool":1},"hSnVJYTSZoak1ww817l9PQ":{"text":"DELICIOUS! And great service too! The heirloom tomato salad is the BEST salad I've ever ha","useful":0,"cool":0},"qHxh858zLEqLpxYO7Zf0jA":{"text":"A good restaurant with old school charm. We went as a large group and had the tasting menu","useful":0,"cool":0},"iY-HRNOIok5r8fQruY7Jtg":{"text":"I am so saddened to have to rate this restaurant so low. I wanted to love August and have ","useful":0,"cool":0},"pGC7nvikZi_7vJMVICfFUQ":{"text":"This is, hands down, the best restaurant I've ever been to. I've eaten here twice for dinn","useful":2,"cool":1},"mL-03eQrdWwZEVhYvJVIiw":{"text":"Unfortunately, we went for Happy Hour before dinner so I was not too hungry by the time we","useful":0,"cool":0},"mO94RWjZkQREzKqqfe9X0Q":{"text":"Eating at the many different John Besh restaurants around the city me and some friends fin","useful":3,"cool":2},"69vCxPm5BQA6jAcsKUIIxg":{"text":"Unbelievable. Vegetable and Meat tasting menus are incredible. If you have the money - go.","useful":1,"cool":0},"bLl8FUdWeK3hrM5cg8y-5Q":{"text":"Last night and we go all in hoping a big dollar purchase reaps big flavor bites.\n\nAnd F me","useful":2,"cool":1},"kf5cfoXwzu9tyfQQmWV2cA":{"text":"The service was great, the food was so so. The flavors were decent, but I'm rating this ba","useful":0,"cool":0},"y_XGAIQMj_CzOcEQgmjuTA":{"text":"Went for lunch and boy was it a treat! Walking in you are welcomed with huge fresh flower ","useful":0,"cool":0},"W84R7GLtstHhaOLohqTGvw":{"text":"Wow! Best food I have had in a long time, loved everything about my visit. The Prix Fixe l","useful":0,"cool":0},"ECkYmonrmpalnSEUz7oMWQ":{"text":"My rating here is based on the service not the food!  This is an upscale dining experience","useful":1,"cool":0},"TchRBL5zMz8zuyT_TmC-iA":{"text":"A mastery of flavors, ingredients, service, and interior design","useful":0,"cool":0},"USQhHsozV_5bBkKlpCW0BA":{"text":"One of the top two food experiences I've had in New Orleans, and I eat out A LOT.  The ser","useful":0,"cool":1},"swwuOX3aizWv8nTUJK9wpA":{"text":"Tasting menu with wine pairings. Get it. I swear on my unborn children you won't regret it","useful":1,"cool":0},"8jbOTMg4pXwQmSlBDz6Ouw":{"text":"After booking our flights to New Orleans, my friends and I were extremely excited to try A","useful":4,"cool":1},"DX2Q37Uc69AlYaKp8DqHzQ":{"text":"Disappointing. Food ranged from interesting to pedestrian.\n\n We were made to wait for  des","useful":0,"cool":0},"V9vd3M6sciTUARvUfUMW2w":{"text":"This place was conveniently located across from my hotel the Windsor Court. On our last ni","useful":2,"cool":0},"gBC9ltXfTuYi3c_igXr7lw":{"text":"Classy, cosy setting and flavorsome food!\n\nExpensive and worth it. $25 wine glasses. Appet","useful":0,"cool":0},"jg3KmMQ3nr7fAENOFzuR-g":{"text":"There is not a thing about the experience of dining at August that is negative.  The servi","useful":1,"cool":1},"HLdAGxTIqtRU1Aesm9kkeA":{"text":"We did the tasting menu, and while it was a splurge, we really enjoyed it. Here's what we ","useful":0,"cool":0},"PkpnQfnE1gRP7fsEvPeVAQ":{"text":"I am stunned.  This restaurants ranks high in service, speed, flavor and overall atmospher","useful":0,"cool":0},"gkTtyomcazfo-pNts8EMaw":{"text":"Went for lunch and it was great. The prefix lunch was a steal! Highly recommend the desert","useful":0,"cool":0},"EFN06tKPRPeAtDU9r2yrvg":{"text":"We had a fabulous lunch at August. Both food and service was excellent. We will surely go ","useful":1,"cool":1},"qdz72gKA9oSTUUksl6LxKg":{"text":"Wow....that was a total fail for me!! \n\nMade reservations for my birthday at 8:00 pm for 2","useful":2,"cool":1},"R1yk2QSh9JzDoDCvhW1RtA":{"text":"Absolutely the best restaurant in NOLA!  I have been to almost all the major restaurants i","useful":0,"cool":0},"6eRzdWuwkFugXtn4fzjqgQ":{"text":"$20 special 3-course lunch menu from 11am - 2pm. Monday-Friday. I would totally and defini","useful":1,"cool":0},"4MV1Lx7JIGV-uCO3C2oRdw":{"text":"We had a very nice dinner here, and the amouse bouche and creme brulee was outstanding.  I","useful":0,"cool":0},"p81XbA4nipPoYtR4DF1icw":{"text":"Another trip to NOLA and had to come back to August. That first dinner two years ago made ","useful":0,"cool":0},"joazbM367pAcMOr1mwodwA":{"text":"Best meal in NOLA and the service was wonderful. For fine dining the price was reasonable ","useful":1,"cool":1},"fQ5SiXbsEdHBDLx2Acxcxg":{"text":"Beautiful restaurant with excellent service. We had a group of 4 and decided to do the tas","useful":0,"cool":0},"t-a77So9fMZ76XwfHn27Gw":{"text":"This place honestly didn't match up to my expectations. I walked in thinking I'd have a #m","useful":2,"cool":1},"xThxHhnQvUKlydu6-s0oNA":{"text":"I, too, had the 5-course tasting menu with wine pairings on a recent visit to Restaurant A","useful":0,"cool":0},"-Lgq2VHtc5g_U_3tP_Nqzg":{"text":"Wow!!! Is the best way to describe this meal. Everything was perfect.  The service was exc","useful":0,"cool":0},"TGc7tWiONM1gRK2YUcCIWQ":{"text":"I went by myself and sat at the bar.  I came for a conference and it's very close to my ho","useful":0,"cool":0},"wwEFuoiq5dFG2p0FgWgFGw":{"text":"Four of us went to Restaurant August for dinner to start off our trip to Jazz Fest. It did","useful":2,"cool":0},"sPv3kOYnrDGMgv1cdSnqbw":{"text":"Ok, I'm a food snob, and I booked a dinner for my wife and me at August just because it ha","useful":0,"cool":0},"A8pThP9NTRHzdE-62ecQ_Q":{"text":"Complete fine dining experience! \nIt was a business dinner for me but the food, service an","useful":0,"cool":0},"Bokjmw8uVBT3rZzfDa3INw":{"text":"Restaurant August was my pick for dinner during our recent family vacation.  \n\nFirst, when","useful":1,"cool":0},"t2701xiYGf8nWXJyLgydsQ":{"text":"Very good. They may have rushed us through our meal a little but that's what you get when ","useful":0,"cool":0},"mfxPU3gj1mSqXwdDcDOm3w":{"text":"It was ok, for the price, I feel the food could have been better. I can't even remember wh","useful":1,"cool":0},"nVPzC2iJzvrfAgvna-4_kQ":{"text":"*Grabs you by the face* LOOK AT THIS! \n\nThe weekday three course prix fixe lunch at Restau","useful":7,"cool":6},"7zbyQfdy1h38BgmTjRQKzw":{"text":"Truly excellent food and service even though the restaurant was quite busy for a Thursday ","useful":0,"cool":0},"18XlCBfxmWG-s1fP7VchTQ":{"text":"Possibly one of the best restaurants in NOLA!!  The service is outstanding, and the food i","useful":0,"cool":0},"rdTBFBMANAsCCTf_8_StQQ":{"text":"First time we came here was a couple years ago for my birthday.  Great experience from sup","useful":1,"cool":1},"ex8Xiit51u96WhmIdgFvFQ":{"text":"Restaurant August is one of those restaurants that does what it does so perfectly and seam","useful":0,"cool":0},"BnKFk6J9KPZstxO630cgAA":{"text":"We had a reservation and we had to wait few minutes to be seated, it is not a big restaura","useful":1,"cool":0},"MY1Wo4JMZ8PNzavX1MZ14Q":{"text":"I literally teared up during this meal. Legit had tears coming out of my eyes because the ","useful":0,"cool":0},"v5myRfoh0vlIS18bT-JKoQ":{"text":"Server was excellent and made several suggestions to us. \nWe went for lunch and had: \npota","useful":0,"cool":0},"LFVTdokPKVZj4XRLFH92VA":{"text":"1000 people aren't wrong.  Food, service, and atmosphere are phenomenal. The oysters are p","useful":2,"cool":0},"qqdcmDXgRLSLN0qYnxCQDQ":{"text":"Another awesome meal at August. This time I brought out-of-towners with me to hype up and ","useful":3,"cool":4},"tUDzIS4en7VbSHrrZp8KDQ":{"text":"In this city of amazing food, I was expecting to be blown away. Especially since I am a fa","useful":0,"cool":0},"O6Lt5T9HvAG17lOBP3Z_tw":{"text":"A friend recommended coming here, but somehow I didn't realize it was a more formal place.","useful":3,"cool":1},"srDRYFwkzBhuiyVNObx7wg":{"text":"Food was great--wine service was very poor- you apparently have to beg to get wine with di","useful":0,"cool":0},"d9OcHQOpO7FlmIx1ay2qNw":{"text":"Went for a group dinner. Redfish with corn and crab sauce was the highlight and the steak ","useful":0,"cool":0},"5mcvF4uN6bOpHFjBAQ9_4w":{"text":"Great restaurant, great food (albeit a bit too southern for my taste). The service was OK,","useful":0,"cool":0},"ebH-Xjyldf5HhrJLErvBIQ":{"text":"If you want an amazing meal with amazing service, this was the best restaurant we found in","useful":0,"cool":0},"nCbpcV71e8iwrzNPqD72Qg":{"text":"We chose August to do a 5-star 4-course tasting menu and I was very happy with our choice.","useful":0,"cool":0},"KwOiec2D0u6PJjyNYGTJtg":{"text":"I made a reservation at August for last Sunday night and it was certainly the highlight of","useful":0,"cool":1},"g2DFyU-NVHfedWXMaduDwA":{"text":"I either hit an unusual night at August or my expectations were extremely high as I was no","useful":2,"cool":2},"6g7b1UT_ebsCw3dxm-y3tg":{"text":"Somebody wise told me once to make a reservation ASAP for a Friday lunch at August. It's $","useful":3,"cool":2},"NRcoS8LiHXy1gAtPDB0VTw":{"text":"I need to start this review with the following disclaimer: I have never actually been to R","useful":4,"cool":10},"gkPmzKK8omL4eu0W3rKHpQ":{"text":"As a disclaimer I like to start out by saying that my husband and I travel around food.  W","useful":8,"cool":2},"aNLyCyCwfXphYyzIFBPLzg":{"text":"My husband and I drive to New Orleans every year, and this time we wanted to experience Au","useful":0,"cool":0},"1jruD0H8JQsNuvAZqGZW9Q":{"text":"I visited this restaurant the last time I was in New Orleans.  I had the degustation menu ","useful":0,"cool":0},"BiEpdk8WhthBELZA_qpD-g":{"text":"One of nicest dining experiences we've had in NoLa.  We went for the Friday prix fixe, whi","useful":0,"cool":0},"xwr3d8EYq2JMSqMVju-PmA":{"text":"Planned a dinner after set one night for my directors and cast. They were great about gett","useful":0,"cool":0},"VIRhPJi58990UmOiMJDNQQ":{"text":"Overall the food was very good and the wait staff extremely conscientious.\n\nThis is one of","useful":1,"cool":0},"a6gdyfIWoOQD54Uz-dD_fA":{"text":"Overrated, the food here is very ordinary, compared to those served at fine dining restaur","useful":1,"cool":0},"yz4T5gRqYIfX_3ZvWxRiQw":{"text":"Why You Should Go To August:\n\n1)  When I asked former N'awlins folks for recs they ALL men","useful":6,"cool":6},"uGk-uJI2XMl365WL3DEG5Q":{"text":"JOHN BESH.  You really know what you're doing, man.  For the most part, I prefer great foo","useful":3,"cool":3},"5UIJMjrGEG-q3SoUd2xluA":{"text":"New Orleans is beyond description, as is August.  I loved my time here. It was rich, relax","useful":0,"cool":0},"UypmsttpqL-U4sxz2evUKw":{"text":"After considerable research on New Orleans best \"new\" restaurants (i.e. not the tourist cl","useful":0,"cool":0},"JweoGysa8DkTOarwccHILg":{"text":"We read reviews of restaurants prior to our trip to NOLA.  We were looking for a nice, rom","useful":0,"cool":0},"lDrzxm7_mEGz12pWCNXuKQ":{"text":"I have mix feelings about this place. It was three of us having dinner. Although my two co","useful":0,"cool":0},"5wCOeUe4m8A9q_1m-qQImQ":{"text":"Came here while on vacation. Food was decent. Egg custard was good. Highlights were the po","useful":0,"cool":2},"JWO-K3MMFnwrCGjH_vUbAA":{"text":"I came to August at the suggestion of friends and so glad I did. Amazing experience all ar","useful":0,"cool":0},"ppawDekG3ARkVg7ZjPF1Rg":{"text":"Very mediocre. Pork chop had a lot of fat and gristle--what we call puppy bits and feed to","useful":0,"cool":0},"Chpw2HNJL0EiqdGwP_94AA":{"text":"My friends and I are seated and browsing the menu. Then my friend Kevin says \"Umm guys I t","useful":0,"cool":0},"Wc9KFouoiVxP7MpPgx_mxw":{"text":"$20 prix fixe lunch is an awesome deal for the service/food/atmosphere that you get here! ","useful":3,"cool":0},"weDRmbz3Zlquk1wYTqAQcg":{"text":"The staff here was incredible.  I have NEVER had dishes that came out more perfectly timed","useful":2,"cool":2},"XKzoT_Q43IMhVcA8bB7apg":{"text":"By far the best dining experience in New Orleans!  A coworker and I enjoyed a fantastic, f","useful":1,"cool":0},"7n9zk1yY7ImjjhbJBnNUWQ":{"text":"Ever have one of those meals that, at the end of things, you just leave happy?  One where ","useful":7,"cool":3},"mzbiNdB7lHUNjANuQpTCwg":{"text":"This John Besh flagship restaurant was everything I wanted it to be. The esthetics of the ","useful":1,"cool":0},"qXhR39r67R8ljoVCTcQsuA":{"text":"This was on my must-do list for my trip. I've only heard good things about Restaurant Augu","useful":0,"cool":0},"OjEWjAmF74riErKpg5mQZQ":{"text":"The prix fixe lunch is an amazing deal, at 3 courses for $20.12. The meal is also accompan","useful":1,"cool":1},"zQODs2XpHV2sl9sQFJLnvA":{"text":"My boyfriend and I went here while we were vacationing in the big easy. Tired and sore fro","useful":0,"cool":0},"Ycv8ydcTBo-4hUGjJeHhBw":{"text":"This was one of my favorite dining experiences..ever. Yes, I said ever. Service was impecc","useful":2,"cool":8},"zAukQ9EsooCcEVsBgk9HCQ":{"text":"Absolutely a great dining experience!\nFirst of all, our server Robert was so great!  So kn","useful":0,"cool":0},"nxWR0wuoYvo0vm0vE1jn1w":{"text":"FOOD:\n\nI went for brunch. The menu was limited with only 6 entree options from which to ch","useful":0,"cool":0},"oQMQD6lg22wN6iQFZ3Wd6Q":{"text":"I had to come into NOLA on business and was perfectly OK with this. Why? Because it meant ","useful":3,"cool":2},"FVPYm3kvwMKL4yCuXp_yCQ":{"text":"Service here is absolutely impeccable.  We came here the weekend before Mardi Gras and hea","useful":0,"cool":1},"SbZPcAf3-STTOOwVWC_miw":{"text":"And of course, I had to complete my week of all things Chef Besh with an exceptional dinne","useful":1,"cool":1},"QWIF7dTjeSgAA43X88iRUQ":{"text":"Spectacular in every way. Food- Service- Ambiance. One of the best meals my husband and I ","useful":0,"cool":0},"0JgO6ci4SK8PEICXuaGvCw":{"text":"I went to Restaurant August to try out the Coolinary Menu. I had the corn and crab bisque ","useful":1,"cool":0},"-m_8IqUtf20ZaEZZwExO_g":{"text":"Restaurant August serves a three course fixed price lunch with plenty of options.  The foo","useful":0,"cool":0},"pZCqQ6SeT8ZihAIHBCYPHg":{"text":"Stupid.  Just straight stupid.  If I were to have a bro-crush on anyone else besides Justi","useful":2,"cool":3},"zjhkCeNWQ2IE4Yd1SwKudA":{"text":"Not worth the money!!! Unless you want to feel invisible and eat tiny, salty, over cooked ","useful":3,"cool":2},"Z3PTb3b7eUWc-5Z2u2SA_A":{"text":"We came here for Valentines day dinner and our last night in NOLA. It was a great choice. ","useful":0,"cool":0},"CgbGc_-_LGYUIegHQMLrGQ":{"text":"Wow! Restaurant August did not disappoint. The food and service were superb. I sat at the ","useful":1,"cool":0},"Az7RO2nFrXcchVxjSku3vQ":{"text":"We ate Thanksgiving dinner here. This restaurant provided a wonderful experience, top to b","useful":1,"cool":0},"8hrUoRddYvvyo3Bm82UVMA":{"text":"Absolutely fantastic lunch here! Walked in as 1 around noon on a Monday and was able to si","useful":0,"cool":1},"2R9KOwvZILcwF_8YbnbFrA":{"text":"Wow!  We definitely saved the best for last!  Our last meal in NOLA was lunch at August an","useful":5,"cool":1},"-cRHOMMyL3TuO98eaJoxQA":{"text":"John Besh earns his title as culinary king with Restaurant August.  The four-couse tasting","useful":3,"cool":2},"RcNyq8f-oh4INXVqg9jN6Q":{"text":"So yummy! Everything about our dinner was great. The food the service was excellent. I ord","useful":0,"cool":0},"9ZsXrWnxP-d6Uk8O5sptgA":{"text":"Part II, Interested in reading Part I look up Borgne.\nWe arrived around 8:45 last Wednesda","useful":0,"cool":0},"42Z_NXvcnSI-7td1Yal-Bg":{"text":"From the historic elegance of the restored dining room space, to the attentive but non-int","useful":0,"cool":0},"9vkoQA1DnCPMPeo-vwYxJw":{"text":"This restaurant lived up to all the hype. It was beautiful and all of the food was both in","useful":0,"cool":0},"ZG6kHs2sYbQPjBlPrVJo7A":{"text":"Super delicious! Had the 3 course prix fixe lunch for $20.11 and it really IS the best dea","useful":0,"cool":0},"ZHXJB0XfyTwrkPDF65dtzw":{"text":"So amazing. The service was impeccable, the food divine. We came in for their lunch prix f","useful":0,"cool":0},"jG_EgJ0zYbaC_pPyaDv-EA":{"text":"Came for a work event and dinner was D-E-Licious!\n\nThere was an open bar cocktail hour bef","useful":2,"cool":0},"Gpg2ILIW9hRrxG4t3y5lfA":{"text":"I've been to RA on a few occasions over the last 8 years; never disappointing.  Food and s","useful":0,"cool":0},"WsGkldnAx_imXhATarVl2Q":{"text":"What can I say, everything was great, everything.\n\nAtmosphere - Elegant, yet not over the ","useful":0,"cool":0},"5-YUfbb1apXGx5xyLmhNsw":{"text":"I would like to agree with CK's review of Restaurant August.\nFurthermore I'd like to expan","useful":0,"cool":0},"8vMYOJ-xnSN7138yyrVQzg":{"text":"By far the most amazing dining experience of my life! My boyfriend just returned from a de","useful":2,"cool":1},"INhtBHM95gePtdyztrxQew":{"text":"Very tiny portions but the food is ok. You should order multiple dinners to equal what you","useful":0,"cool":0},"y4jbLkkK8orWXa1L6SlBQw":{"text":"Restaurant August is one of the best restaurants in New Orleans. It is no wonder that this","useful":16,"cool":10},"lQahlgYbrh1scJnkQ3GKNw":{"text":"Nice ambience, great service, delicious food.\n\nThis place reminds me of somewhere you'd fi","useful":1,"cool":1},"98u0gOMBzblKSTbfHM_b-Q":{"text":"Simply the best meal in terms of service, atmosphere, food, and value that we've had in Ne","useful":0,"cool":0},"cMntWUmeeDGs_pTgBIlicg":{"text":"Great spot for more fine dining. The chef gives you an amuse Bouche, the service is great,","useful":0,"cool":0},"-YmJjvgBALoTlR1wjATXgg":{"text":"Outstanding -- truly. Wonderful food, excellent service, beautiful dining room and great a","useful":0,"cool":0},"8_1B81slQnuNUaJql5ltow":{"text":"I had the opportunity to meet John Besh a few years ago and have always wanted to dine at ","useful":2,"cool":1},"Nq9N8JYtOGssGidrH-og2g":{"text":"Our favorite meal during a one-week vacation (a.k.a. eating tour) in New Orleans was lunch","useful":3,"cool":0},"P0JVNcaQjxQpQbCUBcOlcw":{"text":"Absolutely spectacular all around. The duck was incredible perfectly cooked and fat seared","useful":0,"cool":0},"a4S3mjcnrzT8X9m05jk7ng":{"text":"Great service and food. I had the pre fixed menu, and I got the tomato heirloom salad, Lou","useful":0,"cool":0},"5X7hZE9i6F5H3BK8aTp5fw":{"text":"There are few restaurants that are as divine as Restaurant August! We ordered the hanger s","useful":0,"cool":0},"VAygtWYeC3yd5W8wwuaCBA":{"text":"So had lunch here with several friends, it truly was amazing. The service was great and th","useful":0,"cool":0},"_hmOktrEkJYGEholxRojMA":{"text":"I had the pleasure of celebrating my 40th birthday on 08.01.2018. What a dream. It was pur","useful":0,"cool":0},"_ir92GmI1FADdgmlgtHYHA":{"text":"Market Vegetable Chop Salad.\nFoie Gras.\nPotato Crisp P & J Oysters.\nScallop & Pork Belly.\n","useful":0,"cool":0},"s-RFCSo76lUPAkqTablxGg":{"text":"This  is an excellent restaurant to try while in New Orleans. They have very good service ","useful":0,"cool":0},"27WDRaDYnXlSNRpN3JjN0Q":{"text":"Dined here for a private event in the upstairs dining room. Servers were very nice. I had ","useful":0,"cool":2},"Jj46mV1JFCE6rlY_9T0Edg":{"text":"Oh, man.... just no. Okay, we did the prix-fixe lunch, so maybe the food gets better at di","useful":3,"cool":1},"-Wll4jljEqGJ5yjBIybi_g":{"text":"Immaculate service, breathtaking ambiance, and incredible food. The amuse bouchee was a de","useful":0,"cool":0},"CnAd65yuDbSxJ9AVSAlbIw":{"text":"I've lived in New Orleans (I think that gives me some streed cred) and am chubby (meaning ","useful":2,"cool":2},"6p-PF-AsGaxNP2gibvPQvg":{"text":"Absolutely loved this restaurant. The food was delicious. Everything we had was better the","useful":0,"cool":1},"NLsaivdo6Xv0wdIwPRwlzw":{"text":"Five stars! Five stars! Can I say six stars? After having a spectacular meal at Borgne in ","useful":4,"cool":2},"G3Lhdc68c80mj6IaX-xX2Q":{"text":"We've toured the world and been at a few 1-3 Michelin starred restaurants, but Restaurant ","useful":0,"cool":1},"_BdCFymdrBgd0c644-bbOg":{"text":"I've eaten lunch, dinner, and been to some special events at August.  I've certainly had s","useful":2,"cool":1},"jJv2-ooN2iNnFBmg7MJTAA":{"text":"Always a satisfying meal at Restaurant August. The service is impeccable - attentive and v","useful":0,"cool":0},"zNhpoCmL1X2qAoXFMdXwAQ":{"text":"A culinary delight!\n\nWe were seated in the wine room with a great view of the wine selecti","useful":0,"cool":0},"bPC6CidmoFJBufBmhV8ZRA":{"text":"Completely underwhelmed with the food and the service. I guess we came in late on a Wednes","useful":0,"cool":0},"p2I2ZLrOHIDKU5MaPm89_w":{"text":"The meal my friends and I enjoyed at Restaurant August in July 2012 was, quite simply, one","useful":1,"cool":1},"T6azw9JO5t6n65HF6ixJxQ":{"text":"I wish I could leave a zero review. Hours claimed open till 10. Every birthday of mine we ","useful":1,"cool":0},"Q8LUZWlBJSQQ63ne3V1OBA":{"text":"Went there for a special anniversary meal. Everything at the place was fantastic. The free","useful":1,"cool":0},"_dPGBhpZOmSMsY0Yvy57kQ":{"text":"Treated myself to a birthday dinner here; so glad I did! The staff was fabulous, knowledge","useful":0,"cool":0},"pCxM3alA-o5akUYD8Sx-CA":{"text":"Steak tasted like a shoe.... Medium rare and still tough. Not good tonite. The wagu tasted","useful":0,"cool":0},"jvqgY6cay8Hs8ddUHLK8-Q":{"text":"A++++\n\nAn absolutely fabulous dining experience, in every way! I don't have enough creativ","useful":1,"cool":2},"-SfniaPfsG6X9wnnFS1CBg":{"text":"A tasting menu served to a work group could be a disaster. Who is the vegetarian, which gu","useful":0,"cool":0},"JJPQB4Zq_8izChF73TUiYg":{"text":"Great service, food, and place to celebrate a birthday.  We went for lunch, and it was a b","useful":0,"cool":0},"2FrbKfloahzlAot-nT1gIA":{"text":"Restaurant August has been in my bookmark under \"to review\" for a few months now.  I hesit","useful":2,"cool":0},"A5FDUQ6Yf7Ix7Q6kSSTT3w":{"text":"Fabulous Amazing Wonderful~\nFair price and great services\nThe quail is the best, tender, j","useful":1,"cool":1},"Cy6a6vnYioHSLBmUpz-QJg":{"text":"Worst service at an upscale restaurant in many years.  Ate here several times on business ","useful":1,"cool":0},"sgQz61KkV8wQRVPMWxk5Pw":{"text":"I wanted to bring my Mom here for her Birthday dinner. It was an important birthday so I w","useful":17,"cool":16},"IfoZIVkx9waDTQBm2iF9CA":{"text":"Easily one of my top 10 meals ever. Excellent service, solid wine list, and the food was a","useful":0,"cool":0},"w06uGA5wxEQhL36W4R1F4A":{"text":"One of the finest dining experiences in New Orleans. If you only eat one fine meal while i","useful":2,"cool":1},"EHaKLl3CKvjpEMF9u8HZSg":{"text":"Recommended by a friend- We tried to get a reservation last minute but they were booked. I","useful":0,"cool":0},"gy99XclOf8gyTNKaafiZCQ":{"text":"We booked an early evening reservation as we were bringing the four year old; they were ve","useful":0,"cool":0},"982FxG-VtIOCuDwJzF9Cng":{"text":"My wife and I chose August for our anniversary dinner when we were in New Orleans in late ","useful":3,"cool":0},"9_mpgtUdi_BUH9JtXS8qHQ":{"text":"After an amazing lunch at Commander's Palace, dinner at Restaurant August was a bit of a l","useful":0,"cool":0},"2FLn6_9OT1xspcIkm05kIQ":{"text":"Went here for our anniversary dinner a couple of weeks ago.The waitress was great, but I h","useful":1,"cool":0},"GzP6OouiyXfCdlWPx5hTKA":{"text":"Great service and food. I had the pre fixed menu, and I got the tomato heirloom salad, Lou","useful":0,"cool":0},"94_9Cz9dr_7JdamCoStszQ":{"text":"Enjoyed every bite of the tasting menu.  Other members of our party very much enjoyed the ","useful":0,"cool":0},"w7hKDsQkzjZWlAMOuMAp9w":{"text":"At dinner last night I had been describing the wonderful yet vulgar praise that I had verb","useful":0,"cool":0},"FHH653gpcgZltWpr3r1DxA":{"text":"What the what now?!?!? This is possibly the best restaurant I've eaten at in a LONG time, ","useful":1,"cool":1},"CcaftPUWyk_C7ASXKpSR6A":{"text":"FRIDAY LUNCH REVIEW\n\n5 stars for the food. 3 stars for the service. So... 4 overall. John ","useful":4,"cool":2},"kOCOLRVZUwT3dkamAPDwUw":{"text":"Awesome food and great service! We had pre-thanksgiving dinner here and we ordered the tas","useful":0,"cool":0},"MjWppuJ1SiNJluTtWRH_lg":{"text":"I dined here with my husband on a Friday night while in town. The food was really good but","useful":2,"cool":2},"8Lh14BOWNhi51crAqvrhhg":{"text":"Amazing foodie experience.  We ate here our last evening in NOLA and it was a phenomenal e","useful":0,"cool":0},"0uqLdd5Olps-jZal60DouA":{"text":"The entire dining experience was amazing. Our servers Erica and Stephen were extremely kno","useful":0,"cool":0},"Xrc4yM201ZpLDJSs51e-ZA":{"text":"Tried the tasting menu which I thought was reasonably priced. Started off with swordfish c","useful":0,"cool":0},"19yYBmlGmASZkagczbejxw":{"text":"Beautiful room. Menu is concise with a choice for all. Excellent service. The soft shell c","useful":0,"cool":0},"5GeP_bCQwp-BjOUFe_yxrg":{"text":"This was a really excellent meal -- truly fine dining by John Besh.  I can see why it's on","useful":2,"cool":0},"IIf6be62L1zO_2yY-BXzLg":{"text":"Didn't have a bad meal but I didn't leave raving about it and wanting to go back. I say th","useful":2,"cool":0},"m-oMvFuMNG3VukosWNkVXA":{"text":"YES! Go here. \n\nGet the pansotti if it's still on the menu. I almost licked my plate. \n\nGr","useful":0,"cool":0},"0ZxWlce6qqP1mO_wP7WR7w":{"text":"Absolutely wonderful restaurant! The food and service is truly five star. I had the chicke","useful":0,"cool":0},"5rslMLd5MS9PDAtrvGugAQ":{"text":"Best meal ever and I'm a foodie. Highly recommend a tasting menu. Great fun! High class!","useful":0,"cool":0},"eb7_mIOYIOk89cXHe8TgTQ":{"text":"Restaurant August holds such a special place in my heart. After having dined there several","useful":0,"cool":0},"L8rbzThlTfQ1nu7jwFvTHQ":{"text":"Absolute perfection.  Restaurant August was an amazing experience in every aspect.  Servic","useful":0,"cool":0},"T05hjXIAcIDhznS3x7-XUg":{"text":"Yea, it was really that good. Delicious Bourbon Old Fashioned to get things started. An am","useful":0,"cool":0},"lRdus-KroRo8imqOOUKE6g":{"text":"Dined here with my parents over Labor Day Weekend.\n\nAte here several years ago with a grou","useful":0,"cool":0},"pdW8dB-plhZXAaIVGu-4hA":{"text":"This was the best food I ever put into my mouth. I had many dishes the service was fabulou","useful":0,"cool":0},"d40bSSkDpDK2iVWcMTSMfw":{"text":"Could be the best dining experience the wife and I have had!  Everything was absolutely su","useful":0,"cool":0},"T20wrAa--XYBwFY3625OjA":{"text":"We came for the Friday lunch,  which (if you get the prix fixe) is easily the best food ba","useful":0,"cool":0},"EwcLSokwb5OROP6_6Vhqkg":{"text":"The building is beautiful!  Service top notch.  Food presentation was beautiful, almost to","useful":0,"cool":0},"y1WMG5MXTsTP9jMN3rVspQ":{"text":"Pretty pricey but pretty damn good!  Our host was superb, he knew the menu inside and coul","useful":1,"cool":1},"fdNTfWCV0EY_-48bCMNrMw":{"text":"As the title says, the flavors and presentation were fabulous... but the serving sizes wer","useful":1,"cool":1},"NNlQ3ftq4XQzl_U23fCF4g":{"text":"Absolutely incredible! The service, the food, the experience as a whole, was just phenomen","useful":2,"cool":1},"NVmnekdKOUsE_Hn1PUg7Fw":{"text":"I didn't want to eat here while in New Orleans. I read the Yelp and Chowhound reviews prai","useful":1,"cool":1},"oxqFxLsKgOXjiTqyO3p-oQ":{"text":"One of the best restaurants in NOLA. Great service. Fantastic ambiance. We did the tasting","useful":0,"cool":0},"Cuc9uTmOkZ4V8JCGMOnudA":{"text":"Came here on a business trip and probably one of the best meals we had here in New Orleans","useful":2,"cool":0},"VdJdrXNsPb0RNrhrj1RSfg":{"text":"Despite being a Yelper, I sometimes find it hard to get out of my shell and try new restau","useful":17,"cool":17},"TBJ4d9KdjvLXl3g49iThGA":{"text":"Sometimes you save the best for last. August was literally the last meal we had planned be","useful":5,"cool":4},"CxiPkWoaOJSGsNAe-1GWwg":{"text":"Simply the greatest dining experience I've had yet. The family came to NOLA to celebrate M","useful":0,"cool":0},"b8UyDoAmy4q3RNqhJ8TWSQ":{"text":"We tried the degustation tasting menu. My mom and sister both requested to swap the lamb w","useful":0,"cool":0},"R3CAiDsLlPIgo2G5rE2qEA":{"text":"We had a great experience when we invited 30 of our customers for dinner at Restaurant Aug","useful":6,"cool":6},"wO5rJyMKedccDzeYYwrczA":{"text":"Lovely dining experience! :)\n\nThe hostess at August was completely understanding when I ca","useful":0,"cool":1},"2eLznIEMqMwW6NqhFg6Xlw":{"text":"OMG - everything here is fantastic!!!  Service is way over the top - the food to die for. ","useful":3,"cool":1},"T-mH9cMaH0uE-jqOu3qvpQ":{"text":"I decided to try August after Andy Cohen said it was one of his favorite restaurants in No","useful":0,"cool":1},"NG8tkaF_Qsw9T7HTLQa_Yg":{"text":"It took me a while to get around to dining at August, but after our recent visit, I can't ","useful":0,"cool":1},"i8i7Pg8j7eqxfOl_PFVOYg":{"text":"I wanted a fine dining experience in New Orleans and was between Commander's Palace and Au","useful":0,"cool":0},"ug05ZcbBLwuMSqlC9Q84nw":{"text":"This is hands down the best meal I have ever had the pleasure of eating in my entire life.","useful":1,"cool":0},"xGhJ7TniyHBnnWwcdyB_yQ":{"text":"Great meal with my wife, from beginning to end. Everything was perfect. I had the flounder","useful":1,"cool":1},"6J8FzrrS1BzNYkhBJ3hhEw":{"text":"After having done Commander's Palace and Le Petite Grocery earlier that trip, was expectin","useful":3,"cool":1},"h9z5P71oGXPLDBwSvzelJg":{"text":"Why four and not five stars?  Hands down the most fabulous food. This was my third time to","useful":0,"cool":0},"UF0H5CjbEHwGepuCO24oxg":{"text":"We ended our week-long trip to Nola with this place, and what a way to go. While not as go","useful":0,"cool":0},"LSK2h4LUa5Lm_cCf11nZYA":{"text":"This restaurant has a lot of acclaim.  Therefore, by default, it had huge shoes to fill.  ","useful":1,"cool":1},"Wu9sG5ocmAEzfO6VwIUbqg":{"text":"Damn this restaurant is good!  Took my husband there to celebrate his birthday and it was ","useful":0,"cool":0},"Fysrz39bE69STPu_h-IwIA":{"text":"Wow, nothing short of amazing. They have a 3 course prix fixe $20.14 lunch for a meal and ","useful":1,"cool":0},"blToBugfDNLlWhBJwFFPIg":{"text":"It's a beautiful space with lots of texture and creaky wood floors. We loved our meal, how","useful":0,"cool":0},"ijrcWE1WQUl8gH4pBPLrfg":{"text":"If the thought of gambling a fortune on dinner at August is giving you anxiety attacks, th","useful":3,"cool":1},"y6zS324ktzxPJE0uJ1y2MQ":{"text":"This restaurant was recommended by a friend who is from NOLA.   The Chappapeela Farms duck","useful":0,"cool":0},"pM8ZnIFnCrKnkZ7qxwYvXg":{"text":"Not sure why this place gets such great reviews....made a reservation three months in adva","useful":0,"cool":1},"Cm9xgMUmayJeUYjMYjAfpA":{"text":"We went in for their pre-fixe lunch deal on our New Orleans trip, and months later I still","useful":0,"cool":0},"mj-BNr2Q4uiEIcTp__VZUQ":{"text":"One of the best restaurant in New Orleans. The food is a little bit pricy, but absolutely ","useful":0,"cool":0},"dY5nvUZG7LjU7yPQWxKAbA":{"text":"I had an amazing dinner at Restaurant August.  The cocktail menu is innovative.  (I wish i","useful":1,"cool":0},"sOvRhlIvE03Y6yc7T0GreA":{"text":"My review is only for the $20 prix fixe lunch - This is the BEST $20 3-course lunch I've e","useful":0,"cool":1},"-GJQTGOZ6WVtWohbUU05hw":{"text":"Had a fantastic lunch here.  We opted for the prix fixe for $25 and everything was excelle","useful":0,"cool":0},"rZqtYn2Y2zwIz3GfgGch4w":{"text":"It's a shame that Michelin does not review restaurants in New Orleans. If I was a Michelin","useful":0,"cool":0},"EjbXWAba_MwnQ31EAiI3bw":{"text":"Tastes amazing! I was not at all disappointed with my fine-dining experience. We did the s","useful":0,"cool":0},"9d5ovQgM-9ojn-Byn2KrLQ":{"text":"Another winner by local superstar chef John Besh.  All I have to say is wow, what a meal!!","useful":3,"cool":1},"JP0qcZw70xoEkxjsZVT91w":{"text":"Waited a long time for this visit. Sat down immediately in th antique mirror room. Very co","useful":0,"cool":0},"-_jSsTZK5FlkYZ-3Jhoe9A":{"text":"August doesn't need my reviews, but, if you're on the fence about whether or not to go, YO","useful":0,"cool":0},"eE_1Lp2lM851Mbp_W64YBA":{"text":"Prix fixe 3 course lunch for $20 and change. Even at reduced rate, the service is superb! ","useful":1,"cool":2},"0fPGPTux-MNJlWh1NN2Yug":{"text":"Beyond delicious. Venison sausage, lamb saddle with house made sausage, duckling with grit","useful":0,"cool":0},"VpnnLYZDthaTwgubZCQrfQ":{"text":"(see explanation of ratings below)\n\nMight be the best meal I've ever had.\n\nWent for the fi","useful":3,"cool":0},"8hgCKpR3IojrJ8kZsSHbyg":{"text":"Had an amazing dinner here.  I ordered the lamb and it was prepared like a roast.  It was ","useful":0,"cool":0},"doQ0mOR5aHiIc2dctD1GUg":{"text":"What a wonderful experience!!\nHad the gnocchi and it was to die for!!!\nService was outstan","useful":0,"cool":0},"nnfBXWDZiVl6Axs2-woS4A":{"text":"Green goddess was so much better than Augusts. \nI think the upscale decor and large prices","useful":1,"cool":0},"jOvPKNdR0cbEKX9TIxNqKQ":{"text":"Best prix fixe lunch ever. Would have been worth it at twice the price. Considering headin","useful":0,"cool":0},"PP2nW0LZsEBIt4rm5XeGUQ":{"text":"Best meal ever in NOLA and one of best meals anywhere in 2014. Innovative menu with prices","useful":0,"cool":0},"_95rxdFh3n40KyGG6tn0xw":{"text":"I have found my true love.\n\nIf only it didn't live in another city. . . \n\nVisiting New Orl","useful":0,"cool":0},"eU2xP8R4g5W4dvyzD9hQtg":{"text":"One of the better meals I had in New Orleans. We went for lunch and we were one of three p","useful":0,"cool":0},"m8-qGAJsFcjFzDgP7e6mUQ":{"text":"Like this place needs another great review, but what am I supposed to do, lie?  Elegantly ","useful":0,"cool":0},"TGupAenbNsb_wgh5dmwt5Q":{"text":"I would like to start with the obvious. It is a beautiful space. The panelling in the bar ","useful":0,"cool":0},"XuzLXilLWZ8A7z6_95CN1A":{"text":"So, sometimes the third time is the charm. That's what happened with August. My husband de","useful":1,"cool":0},"dAP9aTsHzuDKfXFF7ZpJmQ":{"text":"I recently moved here from Boston and am a foodie.  I am a big fan of Commanders Palace an","useful":0,"cool":0},"n83mKp5L5uoQ0GX_oqVnbw":{"text":"What a surprisingly- and disappointingly- bad experience. We arrived at 8:00 to check and ","useful":4,"cool":1},"2fSf1DeItbCzEKkfUd5wjw":{"text":"Holy cow! This place never fails to impress.  The staff is beyond super nice and I love ha","useful":0,"cool":0},"s6umJ2GPNrcKbW1Alnh2fw":{"text":"First time to eat here!!! It was the Bomb!! Everything was wonderful. Great Food and the s","useful":0,"cool":0},"94lWioprkp0uj0kR7MIyJQ":{"text":"Awesome restaurant. The food was incredible although the portions were quite small. Servic","useful":0,"cool":0},"AKTecpoO_LugyGJtmTk7vA":{"text":"If I could give it 6 stars I would have. It's THAT good. I had a number of bite size apps ","useful":0,"cool":0},"IK6bJfITgayZ64EweCuhvQ":{"text":"4.5\n\nFantastic service (Commander's Palace could learn a thing or two)\n\nFantastic food (am","useful":0,"cool":0},"UkcjRnHioPIW_PIDciy4bw":{"text":"Do not miss the Restaurant August experience. I say experience because it is a full blown ","useful":3,"cool":0},"u7bRl1u67tt2CLlNG7-Z_A":{"text":"Super fancy dining, this is the type of place where you pull out your phone to google word","useful":0,"cool":0},"hq5ShnFpzERjC8mhX6kLjQ":{"text":"I can't believe that it took us this long to make it to this restaurant. We loved it. We s","useful":0,"cool":0},"_qhieYkAfpIn8P8tNrQfbw":{"text":"This was easily one of the best dining experiences I've ever had.  And it was by far the b","useful":0,"cool":0},"NzP0aDAl75zBJCL1BMM5iw":{"text":"Wonderful upscale place to eat if you are looking for a treat, and price fix menu is very ","useful":0,"cool":0},"QGqAeCke6YM22_V1SUA_zw":{"text":"Best restaurant in New Orleans.  However, if you are looking for something more classic, t","useful":0,"cool":0},"ZdyT-eA_pBDUS-23cmBgcg":{"text":"I highly recommend this restaurant for the food, experience, ambiance and especially the s","useful":2,"cool":0},"YVF9_DmUhGx7X6u9rTN7mw":{"text":"5-course tasting menu with wine pairings.  I had high expectations b/c the Besh is my Food","useful":0,"cool":0},"MoNksK5naIE7nHIej0F8mQ":{"text":"Only our second time in this great city of food and music but we hope to repeat that many ","useful":0,"cool":0},"27PVJjbuAFiNUtRV4NC0wQ":{"text":"This restaurant really deserves more than 5 stars. Our dinner was absolutely amazing. Ever","useful":0,"cool":0},"vUek8jaZtrS6_g2RqZuydw":{"text":"Damn near flawless service and food. Very expensive but beautifully prepared, delicious de","useful":3,"cool":2},"01FpJ_RhObgWE3SSFRJO4Q":{"text":"changed my life! okay, thats a little dramatic but seriously. i am a cook and not so happy","useful":0,"cool":0},"IvmhI_KqIvVAXmlcMNfcKw":{"text":"Restaurant August was simply amazing. We ordered the tasting menu with wine pairing, which","useful":1,"cool":0},"SIrjTYq6KoxSjvB-y9H-1A":{"text":"Used to think this place was great, but it's really gone downhill. Amuse bouche tasted lik","useful":0,"cool":0},"UP_kLyPhpTjF_iG6fnCGWg":{"text":"This restaurant is wonderful!  From the moment we entered the doors, the service, the food","useful":0,"cool":0},"y5KnCM8sKmdSD2CnduplcQ":{"text":"The amuse bouche was magic in a little egg shell.  While I was jealous of my boyfriend's p","useful":1,"cool":1},"e2bJL4pVSsBB_KU8ITBscQ":{"text":"What an experience! All senses were taken on an adventure. The restaurant is beautifully d","useful":1,"cool":0},"poNf9WOtBmDn-3AQ_s_rNQ":{"text":"Restaurant August is a very fancy place with outstanding food.  It's dressy but there's de","useful":0,"cool":0},"Izpom5W4ea03wyiaL5vbIg":{"text":"Great food in an environment that I expected to be stuffy, but was definitely not. \n\nMy hu","useful":1,"cool":1},"sSh1C_7O3Aab15bz1zgP4A":{"text":"Absolutely breath taking food  French touch from chef John Bresh on really Innovating plat","useful":0,"cool":0},"o9dNlYfhc2Rywh8---eMlQ":{"text":"What can I say... best meal I've had in the last 10 years. Starting from the amuse bouche,","useful":0,"cool":0},"BWasPMc9wJhcc7nNc122TQ":{"text":"Very impressed!!!! Everything taste good!!! Like a Michelin rated restaurant. Tried the bl","useful":0,"cool":0},"XSc3SsOUTDEPGmrZbw4o2A":{"text":"This is a wonderful restaurant. The vibe is really great and there are healthier food opti","useful":0,"cool":0},"Nj8y2NvEfEYUI8-GjjxxYA":{"text":"$20 fix price 3 course lunch at a great restaurant.  YEAH!\n\nOur visit:\nThey take our jacke","useful":2,"cool":0},"d0lhZh03zVBP-D40TpkIwQ":{"text":"AMAZING French-fare! Not only when my boyfriend and I went there was the service first rat","useful":1,"cool":0},"oWGzqAojz2iRRcpwfHNvpg":{"text":"The restaurant is exceptionally beautiful, as is the food! I just wished there were more v","useful":2,"cool":0},"19iQtW6b6bJWPj6Sc6JDYw":{"text":"Went for the $20 set lunch. Redefines my 5 star yelp scale. Best restaurant food I've had ","useful":1,"cool":0},"hsa1qkkshWtu6pGpVtDP_Q":{"text":"I'm reviewing the lunch, not the dinner.\n\nCame here yesterday while in town for a conferen","useful":0,"cool":1},"gQGobpn99DyQ11lpKANr-Q":{"text":"Wonderful food and service! had the steak and was beautifully presented and delicious! Hig","useful":0,"cool":0},"JwQ92f5XxpBAjYv43_K3Pg":{"text":"I am sorry to be critical where others gush so profusely, but since having better meals at","useful":1,"cool":0},"OyfYlUKGl6fz3AIFYSjj8Q":{"text":"Best meal I had in NOLA. I do tons of research for weeks and came up with this as one of o","useful":0,"cool":0},"l52LVnaR_3DY8fXfVqs0pA":{"text":"Easily one of the best go to restaurants when visiting New Orleans. In my past visits to N","useful":0,"cool":0},"V4vMUPKUtbnfZS1XJJkFgQ":{"text":"Other than handsome decor I recall being slightly disappointed. I really can't say which d","useful":0,"cool":0},"1s-i7r-jZaaj8Q4ICiWlow":{"text":"I only wish I had been more patient... taken more (still and not excitedly blurry) photos ","useful":2,"cool":2},"KFXMWvGmJS0PmVy4BhpRUQ":{"text":"Lived this restaurant. From the moment we walked in we were greeting with elegant hospital","useful":0,"cool":0},"0z9Lq0wMW4l9oxo_AB72HA":{"text":"I don't go out to eat often but this was got a special occasion and August made it even ex","useful":0,"cool":0},"2fGsrH-XEeAxW2ZfwEQoNw":{"text":"This restaurant is a John Besh restaurant and a must go if you are in New Orleans. The foo","useful":0,"cool":0},"FhtMNTmRZZi80u4kbj6Vuw":{"text":"My family and I had gone to Luke (another John Besh place) for dinner the previous night a","useful":1,"cool":0},"-ktEGbSD7qA73SEP6ZDivA":{"text":"I did the tasting menu with my sister and everything was perfect! The pairing were really ","useful":1,"cool":1},"1cbnk1CY_I7LnVyVidowYA":{"text":"Ate in the bar area, and got a table surprisingly fast. Really great food. I wanted to ris","useful":1,"cool":0},"OTmcT71Ti7AyUtVPu7z3Cw":{"text":"Absolutely delicious! Best food we had on our trip to New Orleans (and we had a lot of goo","useful":0,"cool":0},"QJcvJsMR6VUvwsdhTMKhMg":{"text":"Amazing restaurant. So beautiful. Wonderful staff. INCREDIBLE food with perfect wine pairi","useful":1,"cool":1},"IPiNMJlTU_9oIEOX9eH8Ew":{"text":"They say the portions are small.  Let me be explicit.  The gnocchi appetizer had 5 pieces ","useful":1,"cool":0},"0f7AbYayfyNSiVgc09Qidw":{"text":"I'm probably one of a very few people who gave August 3 stars. This is not a reflection of","useful":1,"cool":0},"VOBLCzw1U416ibMoHWM2hw":{"text":"Took advantage of the Friday lunch special here, which was worth every penny. Dessert was ","useful":0,"cool":0},"33Yzzcyp5qZOVGbj9xuR2Q":{"text":"This restaurant is a joke. I have been eating in fine restaurants for many years. This pla","useful":0,"cool":0},"TnK70YOR5CA16aMvaUpM9w":{"text":"Flagship restaurant of Chef John Besh's empire, this place did not fail to impress. We gav","useful":1,"cool":1},"pcVI2BZEaueCl1zup33O-Q":{"text":"As an update, the manager sent me this note:  \n\nWe are saddened that you had a less than s","useful":2,"cool":1},"mnb7FpMk06qxj3wxAeTN2g":{"text":"Yes, yes, yes...omg...yes! Not going to lie; dinner here completely rocked my world! Every","useful":3,"cool":2},"fm52xySd0z2zTbLAeEL4mQ":{"text":"A most memorable experience. Chef de Cuisine Corey Sharp is an artist. The food was delici","useful":1,"cool":0},"sQaTFMA2hpMmoCDKg5MW6A":{"text":"My wife and I had a delicious lunch at August to celebrate our Anniversary.  There was no ","useful":0,"cool":0},"YWm97xrdUIGX3yUUJKWEqw":{"text":"OMG, Restaurant August was perfection. We went for the $20.10 prix fixe lunch and each dis","useful":2,"cool":0},"FHoA2rwtgNQnmAfph0QIjg":{"text":"New favorite restaurant in New Orleans. Food here was the most elegantly prepared and serv","useful":0,"cool":0},"Uma8tr4WX6dU3q39KJavAQ":{"text":"5 stars for the Vegetarian tasting menu! We had heard good things about the restaurant but","useful":0,"cool":0},"92Y-BD6ZHBW6pAEm4uZ0Gg":{"text":"August made us very, very happy. Great food in a very inviting environment. Service was ex","useful":1,"cool":0},"WAaLdrNSvnfaovXATnQ7BA":{"text":"I made a reservation for a table for 4 on Sunday, Sept 20th @ 5 p.m. through Open Table's ","useful":4,"cool":3},"7RSidwER6U0lowyaOz20SQ":{"text":"Celebrated my birthday here. Amazing food, amazing dessert. I could really dive into speci","useful":0,"cool":0},"gP38F-DhdSwQXpTlUH12CA":{"text":"A+ all around.  The limited menu options could cause concern but with everything so creati","useful":0,"cool":0},"nJ8bKTX15khrqrAOCcA80w":{"text":"Had a really amazing meal here, the best I've had in NOLA (with the caveat that there are ","useful":0,"cool":0},"1_DvDRfnql80ZlDqVgNwIA":{"text":"Great atmosphere, wonderful staff, high quality food. I will say that the food was a tad t","useful":0,"cool":0},"jV-Jk5GoBCOYgMJuyRtkwQ":{"text":"This is everything a french-nola-noveau restaurant should be (not to say there are many). ","useful":2,"cool":1},"Fu8Gn_3T99eEm6Zm41dS8w":{"text":"This was easily the best meal that my mother and I enjoyed in New Orleans during our trip ","useful":1,"cool":1},"_Q8SLFuGd3E2NMFt1TiLNQ":{"text":"New Orleans Fine Dining at it's best!!!!\n Refined food with the great flavors of New Orlea","useful":0,"cool":0},"c9-3jLqTeLlMDbWvB7BXgw":{"text":"I heart Chef John Besh and this place was nothing but spectacular!   Delicious, fresh cuis","useful":0,"cool":0},"2AY3EwGiWMVVy-vjt2ytBQ":{"text":"Food, drinks and service were good. Not knock your socks off, but thought I would try some","useful":0,"cool":0},"LSNGjWH5BT3Y0fadiub9MA":{"text":"A beautiful space with equally beautiful food, August was a highlight of a week spent eati","useful":0,"cool":0},"n8taGRLSyMoWZ-rR4IRTjw":{"text":"Incredible food.  Excellent service. Great ambiance. Very easy to walk to from the French ","useful":0,"cool":0},"9o-EbJQ69QoaCkhNYFa8Ig":{"text":"A true dining experience. After 4 days of gorging ourselves in New Orleans at small places","useful":0,"cool":0},"-qHf6oa05g9mbFqREhCDsQ":{"text":"Very elegant appearing although we were seated in the middle dining room which is not as n","useful":6,"cool":5},"XVdBvVuBiT8s3qwk3K7rNQ":{"text":"Truly a perfect end to my first trip to New Orleans.\nThe service here is amazing. I came h","useful":4,"cool":1},"yBYjfg_7w9T7QLdRHqfy5g":{"text":"$20.14 for a three-course lunch on weekdays!\n\nIt's a great deal, but they sat us all the w","useful":1,"cool":1},"SqTql8sFYKjKr9YtGaloyg":{"text":"There are good restaurants, there are excellent restaurants and there is Restaurant August","useful":0,"cool":0},"Zoh6_xgxcmlq3Y3_j-FPbA":{"text":"My favorite restaurant ever. We just spend five days in Nola and this was our only repeat.","useful":11,"cool":8},"NVvTEQUEVNpi3RD-FJjTIQ":{"text":"Fine dining in New Orleans. A signature menu with fish, meat, and local dishes. An interes","useful":0,"cool":0},"MS3upBRWc-RmC_Og07dgmQ":{"text":"Stopped in for lunch and it was fantastic. Reminiscent of our trip Nice. Will be back for ","useful":1,"cool":0},"iziYCboRnlIM5RaD-CfdrA":{"text":"Dear John -\n\nHave you missed me? I've missed you. But I will boldly stroll thru the front ","useful":11,"cool":9},"vdM9vU-vihPP-IaDyiYqcg":{"text":"I went here during Restaurant Week In New Orleans, which is where the common folks can eat","useful":2,"cool":1},"Q-yvVADACOPMnUy676w46g":{"text":"Couldn't make dinner so we went for lunch. Excellent in every way. Really not much to add ","useful":0,"cool":0},"Evlxqvy5SeRduanPlFItsQ":{"text":"I do not have a long review like some of the others. Let me just say that the food and ser","useful":0,"cool":0},"bfPRcJ6WgoLfjb9Mq1MnJw":{"text":"When I found out that we were going to New Orleans the first thing I wanted to do was look","useful":0,"cool":0},"tNgtUq6516n1mcgtxXTieQ":{"text":"I've found Light in August!\n\nVegetarians everywhere need to worship at the altar of John B","useful":26,"cool":22},"v0AqqZVTSdn_Kez9oQMJCw":{"text":"After leaving a restaurant where the service was terrible, we called Restaurant August in ","useful":0,"cool":0},"hyLt5mgmxHZp3pg55Kbf0Q":{"text":"You will not be disappointed!  Top notch service - they anticipate your needs before you. ","useful":0,"cool":0},"QTcG5rtqSYjpVhvaUyT5TA":{"text":"We had a reservation and they put us in a back side room instead of the main dining room e","useful":0,"cool":0},"ogkhrS9HSRgVtGJAULHuWw":{"text":"I have been to many Michelin star restaurants and August would be right up there with them","useful":0,"cool":0},"aBJAlE7lgrv7_7FxelRjVw":{"text":"My birthday weekends always fall near Mother's Day.  So quite appropriately, August was th","useful":2,"cool":3},"hFj-LaMDCv41h5r7lgfs5Q":{"text":"Perhaps I've been spoiled when it comes to fine dining French cuisine, but Restaurant Augu","useful":0,"cool":0},"VPZf_yWeendvDzWEkeuGTw":{"text":"Only reason I am not giving it 5 stars is because the Desserts were not the best, but othe","useful":0,"cool":0},"y8T9IUfWm2yAaMeU_jUiug":{"text":"Oh, how I really wanted to like Restaurant August. Really, who doesn't like Chef John Besh","useful":4,"cool":1},"PdOJYb74oV2OGU6E_zquGQ":{"text":"Came here for the $20 prix fixe menu and had a great experience. There is no better deal f","useful":1,"cool":0},"shH6M89ggf_7nL9-GUms9A":{"text":"I went for lunch since I planned on getting the $20.15 prix fixe lunch but later changed m","useful":2,"cool":1},"Sd6D-8Q0KaCdvF5XJJoFmQ":{"text":"We'd only planned to dine at the bar but on arrival we were invited into the dining room, ","useful":4,"cool":2},"orMXscxDmAI_xQSub_yWuA":{"text":"I've only been here once (so far) but it's now my favorite restaurant in New Orleans! \nGre","useful":0,"cool":0},"9vT6CygPVgbL-LPJWgJfWA":{"text":"I feel obligated to update my review of August, as their lunch prix-fixe deserves one of t","useful":28,"cool":16},"6a_nRGyfizGSIWRe6oFvng":{"text":"HANDS DOWN one of the best meals I've ever had.  If you're heading to New Orleans or live ","useful":0,"cool":1},"guZ9Egk2JO_AWmFTrHjnGA":{"text":"Delicious food with perfectly adequate service.  In my book, it fell just short of \"wow.\" ","useful":0,"cool":0},"_C468nv5ncwEpKrUW-yyeA":{"text":"We waited 45 min past our reservation, for what ever reason they sat 2 parties that came i","useful":0,"cool":0},"snBVv3QRnfJR0Jh-RmNkjw":{"text":"This place was absolutely spectacular on the service--one of the best I've experienced. Th","useful":0,"cool":0},"kaxnJz_7vJP16ZVPhfkkxA":{"text":"This review is based on a dinner party I attended upstairs. \n    The atmosphere has a fanc","useful":3,"cool":2},"gwnybB4MjgCl814Z5-p2Yg":{"text":"I have to say that Restaurant August is the epitome of inconsistant service.  The food is ","useful":6,"cool":0},"ipJ5DW7sVbd7_pStpV_i4A":{"text":"My group had the meat and vegetable tasting menus and all agreed the flavors were not grea","useful":0,"cool":0},"s9LNaGDF4QeNQmuFn53JrQ":{"text":"Honestly, this place is overpriced and overrated. I was disappointed with every facet of m","useful":2,"cool":0},"7Q7OcK5lHhnVWLYGiODa5g":{"text":"Restaurant August is my favorite restaurant. Not in Louisiana, not in New Orleans - anywhe","useful":0,"cool":0},"D0iw3LNI459kIWpX72wdww":{"text":"An evening at August had me slipped into one of the most delicious food comas I've ever ha","useful":0,"cool":1},"gMZgWfoinhlbiPmqbHqWEg":{"text":"I've been here three times. Always on point no matter what you order both in the cocktails","useful":0,"cool":0},"qTmaM2jHJ6LHXiJMaV8KQg":{"text":"Loved the historical building, the service was top notch, the waiter was very knowledgeabl","useful":0,"cool":0},"e745IwFK9FGB4FHvdyb_wQ":{"text":"This place is amazing. It is a michelin star is almost every part of the experience.  I wi","useful":0,"cool":0},"8bC8Z_UWMJ-GfmYj65eAjA":{"text":"\"That's a Wrap\" dinner with my client. A lot of good, solid work was done these last three","useful":1,"cool":0},"PFBDQ9KsgsGOw0X_WgCw9w":{"text":"To ring in 2011 the right way, the girlfriend & I spent the week around New Year's Eve in ","useful":5,"cool":2},"cXHBWe0hCP5baeJl-TdLdg":{"text":"My companion (a vegetarian) and I (vegan) dined here on my birthday a few weeks ago.  I kn","useful":3,"cool":2},"hMVLxcnm_U_7R47vU_fNJw":{"text":"Staff is great and knowledgeable.\nLove the grilled Pompano.\n\nGreat for lunch or a night ou","useful":0,"cool":0},"PMdfFF9yhMRWZClvq8wEbQ":{"text":"Loved the food. I took a off day from eating vegetarian meal but taking a skip day was wit","useful":0,"cool":0},"fAWe1pLkq7hTL14IVKVMDA":{"text":"I love good food!! But this place is beyond amazing, service, quality, ambience and extrem","useful":0,"cool":0},"FQLuBzgEuhQc7PC9Rbj9ug":{"text":"The food was out of this world for the most part. But the \"venison sausage\" for 11 bucks t","useful":0,"cool":0},"pbsQM7wiz7BVtkYcx-TUuQ":{"text":"One of the best restaurants I have ever been too. Both times I went for the Friday lunch s","useful":1,"cool":1},"qiyTjPIGjloaxtiSlQBPBA":{"text":"OK, so I did not stay for dinner.... so please keep that in mind.\nWe walked in, no strange","useful":3,"cool":0},"mDomqA77KiYKlMmqtWx5yg":{"text":"The service was excellent.  My  2 star review \nis due to lack of vegan dishes available af","useful":0,"cool":0},"zPOvAGBtRpxYTJCcuYZqFw":{"text":"I'm not going to waste too much time on this review like a pompous jerk. Last nights dinne","useful":31,"cool":17},"EGhPOrvlEeUmJYWDgFpEPA":{"text":"Hands down THE best meal I had during our entire stay. \nNo contest. \n\nIf I were up to me, ","useful":2,"cool":1},"_JXQ-ot_h1SUkkhGlg__BA":{"text":"It's a fine French dining. Located in New Orleans. Street parking. Need reservation if you","useful":1,"cool":1},"vjTd20DM8Xc3MUIXqdFnYg":{"text":"Oh Restaurant August, I cannot possibly say enough wonderful things about August and Chef ","useful":1,"cool":1},"i1Twy1dEqXoOdCMV-CJeHQ":{"text":"Amazing. Totally worth it and at the end of the day reasonably priced considering what is ","useful":0,"cool":0},"14Ove1o4tpYsBVZwOFJc9A":{"text":"The waiter, Mark and our waitress, Elise were very detailed and calculated. We got here 15","useful":0,"cool":0},"DZa8rlQ1qasXY7J14Pj61g":{"text":"When you're tired of all the fried, heavy options in NOLA, Restaurant August is a welcomed","useful":19,"cool":26},"B9I-VjdSk4-dM90WbmB1ew":{"text":"This was my first time at any of the John Besh restaurants.  I love his food as I see it o","useful":2,"cool":0},"egkuwBVvYILSnqCrZQNC9w":{"text":"When visiting a city I love walking around it and New Orleans was no exception.  As I pass","useful":1,"cool":1},"8pcxo2iEYeVsWDdmf3CrBA":{"text":"First impressions are everything and Restaurant August does it right.  Beautiful bar area ","useful":0,"cool":0},"2-RUWj8QiDgE3jo4FEqPUA":{"text":"We anticipated a good meal and we were thrilled that it was perfect in every way. Good foo","useful":1,"cool":0},"XzQMewbaJwU1zuzm3RH9wQ":{"text":"So disappointing. The heirloom tomato salad was just ok but the gnocchi were terribly unde","useful":1,"cool":0},"5jPSpdtxOI7oY1njSlsJPA":{"text":"Great food, service, and ambiance. The tasting menu was awesome. I have been to a good amo","useful":0,"cool":0},"N6gMVs_KP1ftG664FiA1qQ":{"text":"OH MY GAWD. AHHH-MAAAZING. I am so glad I consulted yelp before my trip! I wanted to feed ","useful":2,"cool":2},"kaF4VLhE8b8NIHVhN4LaFw":{"text":"I travel a lot, have eaten at  a lot of amazing places and this( as of now)is STILL the be","useful":0,"cool":0},"13X5gz61itfeOwjLGS1LBw":{"text":"August is amazing on all levels, truly a meal I will always remember. The restaurant itsel","useful":7,"cool":6},"6ZHAthXSmCPLvGm-wmUj6g":{"text":"Dining at Restaurant August was such an amazing experience! We started off with the compli","useful":9,"cool":7},"EzTekUOlmkxFsdmKTPe_1A":{"text":"I've experienced much better food at the same price point as \"Restaurant August.\" Every si","useful":0,"cool":0},"Nvs_u7UkI04ZJVvBwOBSQw":{"text":"After a week's worth of eating my way through the south, the first review I must write is ","useful":14,"cool":14},"1JkIdM57DPxDSTYD9HI45w":{"text":"Was here for the prix fixe lunch with relatives. Items were overall not bad, but for the m","useful":2,"cool":0},"Zjh0i-zos0C21qS2F0EuEg":{"text":"What review could even come close to the quality of this restaurant?  Amazing wine pairing","useful":0,"cool":0},"z_EZqx1JkIVF1ESu-Bs7RA":{"text":"Got lucky on my bday for them to serve us the dinner tasting menu for lunch! Wine pairing ","useful":2,"cool":2},"xG7YqRMwr9QQARNjxWD5cQ":{"text":"My fiance has dined at August a few times in the room upstairs for private/work events & h","useful":2,"cool":1},"TuVy0VNm-npXGIbKwbfRQA":{"text":"My family and I had a fantastic dinner at August! I made reservations the day before on Op","useful":3,"cool":1},"zknlLIwbO_VSgbEoqS5GzA":{"text":"Spent Christmas Eve with the family there. It was my 1st time. The staff was very accommod","useful":0,"cool":0},"QqyIY7784zdw0ZtP0JCBhg":{"text":"Excellent visit. Although online reservations were full as this was a last min request, a ","useful":1,"cool":1},"Ep7BF41qVDavfUTmwY58QA":{"text":"This place is a gem. I absolutely fell in love words can not describe, the moment I sat do","useful":0,"cool":0},"-LLQ1VxX6WDE5wCJG-SqgQ":{"text":"Restaurant August, a classy and upscale place, was one of the highlights of my Nola trip. ","useful":1,"cool":1},"7E1VWLOR1vhMuhkxs8WYvQ":{"text":"This was my second time at August, the first time I went there the young lady I was dating","useful":1,"cool":0},"wwijTjVgCIf1Cf1Cjw1uwA":{"text":"Seriously one of the best meals of my life and we had it as TAKE OUT. \n\nNot the friendlies","useful":1,"cool":0},"Z2PfDVUOTkup-yBxv6oqFA":{"text":"It was our 1 year wedding anniversary. The food was delicious and the waiter was amazing. ","useful":0,"cool":0},"p7ld313CTQmrsifQpcfXyA":{"text":"WOW.  I'd say the FOOD at this restaurant simply can't be beat.  It was extraordinary.  I ","useful":3,"cool":3},"br9cMdCTYnXetBkUJYewtQ":{"text":"If you want an amazing fine dining experience, look no further. I've been accused of being","useful":0,"cool":0},"zLlUZ0MXtC8RfFkn-BNxOg":{"text":"Awesome food and experience. Looking for lunch outside the French Quarter, Yelped it, and ","useful":1,"cool":0},"J8su03-cSRQf9IGVNNdZCg":{"text":"Easily one of my favorite restaurants in the US. The elements of the various tasting menus","useful":1,"cool":0},"VmbRhKiceH8c7zrdSSU-QQ":{"text":"Great service, elegant, great food. Expensive but for special occassions its perfect.","useful":0,"cool":0},"8uJMt-yk6cTMHTXqMht9JQ":{"text":"Service and Food Excellent.  Surprised to see August DOES NOT validate parking... Also, or","useful":0,"cool":0},"UpDQhUxMnJjNpnd6fV4bjw":{"text":"One of the best restaurants in Nola. If you're looking for an elegant formal French meal y","useful":0,"cool":0},"JZ0XiLKVzdpZtUIlYpoKwg":{"text":"We were pleased to return to this longtime New Orleans gem during COVID, to support the lo","useful":1,"cool":1},"XHtLqoY31k1oaiDA4-C7tQ":{"text":"The service was fine but the food was inconsistent. The first two courses...AMAZING. I had","useful":0,"cool":0},"16sHBk7RLpNIma3HqKYlnA":{"text":"I was pretty disappointed after reading all the great reviews and seeing online that the p","useful":0,"cool":0},"dgR1u3UjjTUvgQmJI2m8Uw":{"text":"We didn't love it... the food was bland to say the least we had the duck hoping for big ex","useful":1,"cool":0},"Q1-lN6Sp-S7vVefwDJybHA":{"text":"Was is town for only two days and was here for their lunch on a Friday. The cavatelli truf","useful":1,"cool":1},"Zh48JQs236Q5mzBQaS9BRw":{"text":"This was the best meal we had during four days of non-stop eating in NOLA (others visited ","useful":0,"cool":0},"ovH7fHDJjniTmX8bt0W4qA":{"text":"So special! Thank you Zeke! I mean what are the odds of having the same person take care o","useful":1,"cool":0},"xGOSr0lBsveKI0iklAn5Bw":{"text":"My boyfriend and I came here for our anniversary and It was excellent. Everything we order","useful":1,"cool":0},"F0xolBSiTJ9p6nbZcXTy_Q":{"text":"Came here for my birthday last year and it was lovely.  The atmosphere was cozy and intima","useful":0,"cool":1},"zlKv_ITpNI6DwfILWRdEZg":{"text":"Love this place!! The food was amazing and every bite melted in your mouth. The service wa","useful":0,"cool":0},"VFTSdhIL3JDwikJfxzYHOw":{"text":"​\nI think it's only safe to say that they do fine dining like no other. With the hefty pri","useful":1,"cool":2},"J-BxBOQ56CoGOCBcWgpRzA":{"text":"I need to come back to do August justice, but this was only a pit stop in-between lunch an","useful":5,"cool":4},"I9d6gJTGOQHGa8KqOz3jXg":{"text":"What a bargain! The lunch prix fixe for $20.12 was a great deal for 3 courses at a super f","useful":10,"cool":9},"U-fUwynmr3FZwdAE-XDhAg":{"text":"Came here last night for my fiancé's birthday and our experience was simply amazing to say","useful":1,"cool":1},"ka66WiiyW4woDAFUk7wrJQ":{"text":"My girlfriend and I were looking for a Michelin star restaurant and August is the closest ","useful":0,"cool":1},"LTqoFOaz8aTt4NSSXwzrpA":{"text":"Definitely unique to New Orleans. More of an upscale vibe and pricey but worth it. Great c","useful":0,"cool":0},"88w0JN0ogsanjkpOUOjtXA":{"text":"I came to this restaurant with no expectations. I was even sort of hesitating to go becaus","useful":1,"cool":0},"0Gfz7Tgv6H8UymLA_Q-KVw":{"text":"Wow! Just wow! The ambience was wonderful with good lighting and luxurious interior. Our w","useful":0,"cool":0},"tBU3J2xQp0vlY310TRywJA":{"text":"The place is gorgeously decorated with beautiful chandeliers and huge windows that allow y","useful":1,"cool":0},"IG_U8VX7Tr9QZmmCurMyIQ":{"text":"A beautiful restaurant. Stunning interior and atmosphere. Great date spot. The food is ult","useful":1,"cool":0},"hjN0udtoGVL9Zw9F_cD20A":{"text":"My foodie dreams came true. I have longed to eat at August for years. The stars aligned wh","useful":1,"cool":1},"NCHSEIGlXMeg1NHwDr51gw":{"text":"Describe perfection in two words?  Restaurant August.  It's walking distance from the W, L","useful":5,"cool":1},"1YHW8NTxewG1_NvszATj9Q":{"text":"My wife and I visited here for our anniversary, and it may have been the finest meal that ","useful":1,"cool":0},"LQrbAKIqs9PnKeJdvbOWFg":{"text":"This is a beautiful restaurant, and the service was excellent, but most of the food was pr","useful":1,"cool":0},"z6X9JBpMn3KgOdrgIpm_pg":{"text":"Loved our dining experience at Restaurant August. The restaurant is elegant and the food w","useful":0,"cool":0},"Rf-myOnDttRQFsuv9OUnBw":{"text":"I've never actually eaten at August but I recently attended a holiday cookie baking class ","useful":1,"cool":0},"AT3VyIhePKYGvRL-w5FElA":{"text":"Had lunch with mum during the Mardi Gras. Wasn't packed that day for lunch, still had to w","useful":2,"cool":2},"3qhC4OoT2FhoyFoyueq85Q":{"text":"Outstanding!! Everything was excellent! The staff was very friendly and helpful when order","useful":1,"cool":0},"Q0JkTnNsNUA8w0ub4dAybw":{"text":"Phenomenal all around dining experience. Impressed from the moment we waked in; the restau","useful":3,"cool":2},"ZIMW8rqX37XhhsWsD4O8KA":{"text":"For my 200th review in just 3 months--yes I'm fully on the yelp obsessed train--it's only ","useful":5,"cool":5},"3kx9GnU7nBe3Ft71lut3gw":{"text":"I came with some good friends for dinner the week of Christmas.  Food and service were bot","useful":2,"cool":1},"K7awC6fH5yxDyf_Zf0RLEQ":{"text":"We were done exploring for the day and passed by Restaurant August. I wanted to try their ","useful":1,"cool":2},"X2ZzxfJGdP76k4rQ2BFy_g":{"text":"What a gem this restaurant is. I would never have known about this place if I hadn't done ","useful":1,"cool":1},"2jpiPYW3HOonY94a6nxtGw":{"text":"So we had heard nothing but good reviews about Restaurant August so were looking forward t","useful":1,"cool":0},"BAqhJguiWCfV2NpvzyoPQw":{"text":"I chose this place because it was the closest to a Michelin star that I could find, and th","useful":1,"cool":0},"iHtFewjdICbpxM7TWDrsnQ":{"text":"Reserved a table for dinner for a special occasion. After hearing the rave reviews of the ","useful":0,"cool":0},"aIoE2BQtEgMyqYL40ci2Ug":{"text":"I am starting to think my expectations are too high after reading the other reviews here, ","useful":2,"cool":1},"StzecTIPc8lsS2ql55GwPA":{"text":"Get the pickled shrimp appetizer. It's spicy, but wonderful! My meal was pork steak. If I ","useful":1,"cool":1},"yAJAruVZGmMv6aViH8CVxA":{"text":"We came here to celebrate our wedding anniversary. Our experience at this restaurant will ","useful":0,"cool":0},"Swfaplsif8v53Vt-VqlmKg":{"text":"I was excited to try August when I was in New Orleans for my wedding.  We didn't get a res","useful":1,"cool":0},"KO_oOCGznJALbAznzf-L1A":{"text":"Quite easily one of the best meals I've had in New Orleans. Our group of 8 was able to mak","useful":1,"cool":1},"q2JDutmsh8lDDBf3dxzebQ":{"text":"It was a long day and we were tired to the bone. But we don't get to Nawlins often so on t","useful":1,"cool":0},"Dyk5H8T-X-XonX-Q6gzckg":{"text":"We did a 5 course tasting with wine pairings and overall the meal was good, not great.  Th","useful":0,"cool":0},"qc-FjcHRhRCHOC7r3z-vUg":{"text":"In a city that boasts so many excellent restaurants, how we rate them on Yelp will largely","useful":2,"cool":3},"HfL5iomMNMuJZ89iHX86Iw":{"text":"Came here for a girls trip and we were very excited about August! If you're a foodie like ","useful":0,"cool":0},"Czad81-yg7sJbCF4ZgQzAg":{"text":"Our family has a home less than 100 yards from Restaurant August. The food has ALWAYS been","useful":0,"cool":0},"m0a_-pusi2xGtO4dwccRlA":{"text":"Wonderful!! In a rarified class all its own. The drinks were perfect and they waited for u","useful":0,"cool":0},"7hQLnAlkwJh0uP-hE1wcLQ":{"text":"so surprised that we did not enjoy August, especially after reading so many glowing review","useful":1,"cool":0},"5LK0r26zkL952hTgnkYG8w":{"text":"The most amazing culinary experience of my life. Everything was perfect-- service, food, a","useful":0,"cool":0},"g6xnaz-K5nmWn-0LCuZUTg":{"text":"What can I say that hasn't already been said? This place is amazing!\n\nPersonally ordered t","useful":1,"cool":0},"M9uVVRrh_x04SwoDKyL7jw":{"text":"Wow!  I would seriously give this place 10 stars if I could!  This might possibly one of t","useful":4,"cool":1},"MqUuVnPuHxZvS7atH6p7vg":{"text":"One of the very best places to eat in New Orleans! Food is always amazing, staff goes over","useful":0,"cool":0},"h5hiRNDJRi4ptw-vJFQ21w":{"text":"Every time I come to NOLA I plan out my meals like a crazy person. I search and plan and m","useful":5,"cool":6},"52K7fJkBoSHuTcX1AMVV6w":{"text":"Of all the decadent foods that we ate during our trip to New Orleans, August wins hands do","useful":1,"cool":1},"d1uuRyg1K4RiUt5P9LzK-w":{"text":"I was so, so excited abou this meal. But, boy, was I let down. I had heard wonderful thing","useful":11,"cool":0},"_LnDq1DrecNbQSTssLf5-A":{"text":"WE WERE JUGDISHED*!\n\nJUGDISHED*!!!  \n\nNOTE TO AUGUST: \nNEVER seat locals with 504 area cod","useful":10,"cool":5},"0hIpsMi-TroIJA-7QRcWJA":{"text":"One of my best restaurant experiences to date. \n\nMy friend and I had the five-course Degus","useful":2,"cool":2},"QEDCqvcwyArj43syTo9W7w":{"text":"After calling all over the city for a fine-dining restaurant that also offered vegan optio","useful":1,"cool":0},"vzRwjdQXzjraB7XPWcthjw":{"text":"The atmosphere, service, food and drinks were all 5 stars.  This is my new favorite restau","useful":0,"cool":0},"i40gP6duu4L1oQTIqYM-7Q":{"text":"Consistently good food and service. The tasting menu is a must try and they are generous w","useful":0,"cool":0},"5HF3yM1vul9bAodqiyJjxg":{"text":"For years I have heard people rave about August. I even had some friends invite me to lunc","useful":26,"cool":22},"Hj4eO35oxx3ZEYYwZGfYdQ":{"text":"I wanted to like this place. \nI'll admit the food wasn't bad, just seriously overrated.  I","useful":1,"cool":0},"dXeo_c0tRxMP1jle85VWuw":{"text":"what is the big deal about this restaurant?? I'm giving 3 stars but only due to service! T","useful":0,"cool":0},"LD0F9D4wxmM9qG7124iu9Q":{"text":"This is what a James Beard award-winning restaurant should be. Not only is the venue absol","useful":0,"cool":0},"tb46rl4xtrKjinDtlK-n7A":{"text":"Wow. WOW! The experience at August was better than we could've ever hoped for. The ambianc","useful":1,"cool":1},"Mrp8HhHorpt_jXVM83Tjwg":{"text":"You can not visit August and not at least try the gnocchi! Also, whoever comes up with the","useful":0,"cool":0},"oJdUz4jAdveOc2pGwR1nbA":{"text":"We were seated in a back room with bad lighting and unpressed, wrinkled tablecloths. Our d","useful":0,"cool":0},"fh3YgxQGBalWQwm_cdy6aw":{"text":"I really enjoyed my experience here - I had the five course chef's menu with wine pairings","useful":2,"cool":1},"Q4cMXdHoakr4C-hB9MDOmQ":{"text":"Absolutely delicious! great drinks with great service. Would come back in a heart beat. A ","useful":2,"cool":2},"X81K34pf_48B5wp5HVrQpg":{"text":"When researching NOLA fine dining restaurant august comes right at the top of the list. Wh","useful":3,"cool":1},"G7lptBnsuDqUcoHVIveBdw":{"text":"Recently attended Restaurant August for a company Christmas diner. \n\nThe event took place ","useful":2,"cool":1},"qLF5xu0XCx3IrpVrrnODhg":{"text":"Our first-time experience at August was truly fantastic. Mark tended to our table and was ","useful":2,"cool":1},"aTTPdXhZy41Y7PtmgOFJ6A":{"text":"lovely menu in a very nice setting. nice job accommodating a group of 6 at a late hour. al","useful":0,"cool":0},"g7SM9BpUrOq_SBil9jBuJw":{"text":"Ah - Restaurant August. This was the best meal of our trip - thank goodness I wisely saved","useful":1,"cool":0},"kATxDcTxn1V4OK6ap3CAtQ":{"text":"Outstanding meal.\n\nBest dinner in New Orleans, and a massive step up from the overdone, fr","useful":2,"cool":1},"vLk4ulUir3yDz_--5N_UuA":{"text":"Amazing ambience. Amazing food. Amazing service. Definitely worth the 5 star review. Would","useful":1,"cool":0},"BQu2-1LlLIz8mOfOanS1BQ":{"text":"My favorite place in the city for a fine dining meal. I come a few times a year and it's a","useful":4,"cool":1},"PzbIFAvczjwXq11wo5evJQ":{"text":"Wow.  Ate here during the first weekend of Jazz Fest.  We showed up having no idea how fan","useful":1,"cool":0},"mzZTFumaHhduow6dgPfIkQ":{"text":"Excelente service, food came out very quickly, all of our plates were delicious and elabor","useful":0,"cool":0},"tD3qTkTqST0fSbbGdeER6w":{"text":"If you're going to have one big ticket meal in New Orleans, this is a great choice. The di","useful":6,"cool":4},"BztfChYhoq607ct11_lnYQ":{"text":"With all due respect, if you come to New Orleans and not take advantage of Mr. Besh's thre","useful":17,"cool":15},"ScjRUdMFY-MIYMXqSpY7eA":{"text":"Lunch with friends in beautiful August.  Relaxing, upscale atmosphere with excellent servi","useful":1,"cool":0},"v8GI8-S2431QHl_1DqRwNQ":{"text":"First impressions are everything and Restaurant August does it right.  Beautiful bar area ","useful":2,"cool":2},"qdtAP75Fbg9Wrz5DrgEHlQ":{"text":"Full review w/ pics in my blog - Positives as below\n\n.  Greeted by a pair of friendly host","useful":3,"cool":0},"LgjSUtYWKdi4nHxB6Oo5RQ":{"text":"Our second visit to restaurant August. This time we ordered off the menu (in lieu of the t","useful":1,"cool":0},"e0aZcyuWVzQT_LYfgWBmuw":{"text":"Stopped at this spot for our first night of dinner and was it an experience...for this cal","useful":4,"cool":3},"z0tyUUkNEKxyvchXuJ3eCA":{"text":"I honestly don't know where to begin with this review. I have absolutely no complaints abo","useful":1,"cool":0},"hePoTsBsC6Fr1UiSLSYGFg":{"text":"August was recommended by a friend who was previously a local. I quickly found out that th","useful":0,"cool":1},"cxBiGxVU1rLj8-9O9HUL-Q":{"text":"I first came to August 5 years ago. I had such a memorable meal that it was the first plac","useful":1,"cool":1},"GBrz-ETOXIuZ0B67WJlyuA":{"text":"I flew to NOLA just to eat here. My gal pal had been obsessing about this food since her l","useful":2,"cool":3},"i6f3ygXg9NLJybolB6Agxg":{"text":"We came here for our last dinner in Nola and were really looking forward to trying some go","useful":2,"cool":0},"1vxuWfKA2aGMTnMCg6WBLQ":{"text":"Heavenly.  I don't even feel worthy of writing a review, so I'm going to make it short and","useful":5,"cool":5},"qvD5fqqd-U9AXO_5NcEZuA":{"text":"I feel like the little boy in The Emperor Has No Clothes. Everyone raves about this restau","useful":1,"cool":0},"z8oInEEnXW5PYkDP3VF3FA":{"text":"Restaurant August is amazing from the moment you walk in. We loved the very attentive wait","useful":1,"cool":0},"huZJMw1C2-CUO5X4q_z1NA":{"text":"Six of us had lunch here and it was clearly one of the best meals we've ever had in New Or","useful":1,"cool":1}}