{"A4n4YaE-owOVgTQcrVqHUw":{"text":"The cafe was extremely cute. We came at 8am and they even had a jazz band playing at that ","useful":0,"cool":0},"u0uSYPl0hYpNLGKKeINvKA":{"text":"Best iced latte and beignet we tried. The live music also creates a great atmosphere. We a","useful":0,"cool":0},"3djwsoWuYzfE8VD3jlNd8Q":{"text":"A nice alternative to Cafe du Monde, the beignets were as good if not better. But the real","useful":1,"cool":0},"S1qVm-KOO24iThYa9fM5hQ":{"text":"5 stars on the beignets.  3 huge beignets for $2.69.  I'm not really sure why each batch n","useful":1,"cool":1},"qxKnXPDA9p38GxISoS0odA":{"text":"Cafe Beignet and Musical Legends Park offers a great reprieve from the hustle and bustle o","useful":0,"cool":0},"YMZnHrxvtT1JkkaZZDjffQ":{"text":"Tucked in behind a number of other establishments, this is the place to go when you want y","useful":1,"cool":0},"Bn5P4jFThZiJQEy8mzUXtA":{"text":"Good price and hive atmosphere. Beignets are way better than cafe du monde, though you sti","useful":0,"cool":0},"048-fRFlIH_C-1Yf_kHApQ":{"text":"Amazing atmosphere! Everybody tries to get you to go to cafe du monde, but don't write off","useful":0,"cool":0},"8XQ4On6PWypBCV_zNinvQw":{"text":"In NOLA on business this week and had to make a stop here based on reviews and actually en","useful":0,"cool":0},"Kpmo7iNyr9ucOQbjI21gew":{"text":"Breakfast was vile, everything tasted like grease!","useful":0,"cool":0},"J3dl_BagtA9JnppdGkHlvQ":{"text":"Stumbled across the set back, sidewalk cafe on a lovely, sunny afternoon. Plopped down wit","useful":0,"cool":0},"ZcjK1pfqtIKTeSyhqVlFCQ":{"text":"This place does make very good beignets and is tucked away in a nice courtyard and has liv","useful":0,"cool":0},"m04XCs_G5jCLTFp2JuzbVg":{"text":"Right next to the police station in the grand old state bank building -- almost missed it.","useful":1,"cool":1},"TP2rF8s3Im2NUR749YuS9A":{"text":"I actually think the beignet here were better than Cafe Du Monde.  They were lighter and f","useful":2,"cool":0},"SnDC-3jh_NgKsDjnPD81mQ":{"text":"Love the courtyard and the coffee... I wanted strong coffee, and that's just what i got.  ","useful":2,"cool":2},"-tccFkczP6sIffBWm2kbEA":{"text":"Forget Cafe Du Monde, this place has faster service, and even accepts debit/credit cards. ","useful":1,"cool":0},"DxZ2jOknsxz1HafNosGCAw":{"text":"While walking around Bourbon Street, it's a little frightening to see white powder riddled","useful":11,"cool":10},"HnoP_SWsNg-Fvk-EbXJj3A":{"text":"Cafe Beignet was a nice little cafe on Bourbon St. with a nice courtyard off the sidewalk ","useful":0,"cool":0},"_q966DhCbsinO8j5s_-vPw":{"text":"The beignets were so bad that we didn't even eat them. They tasted like fried shrimp and w","useful":0,"cool":0},"pTnKh_9CtCzuVB2BL9m8jQ":{"text":"Holy  so amazing I can't put it into words, live music , fresh beignets, pastries, great !","useful":0,"cool":0},"rlB1uDJDfQwOULmyKjGQpg":{"text":"Far superior to Cafe du Monde in two aspects: the staff is friendly and smiles at you, the","useful":2,"cool":0},"oDieIIInqCBcOzViPUBP2g":{"text":"I ordered the club sandwich which includes cold turkey, bacon and cheese on French bread. ","useful":0,"cool":0},"IjZImSuYcBwlsTbofg51Tg":{"text":"The Beignets were delicious pieces of fried heaven with powered sugar. The pastries come i","useful":0,"cool":0},"za6Vi9OP_OBXL9zk0OvTxw":{"text":"Our work team took Sunday afternoon off and decided to wander around the French Quarter. T","useful":3,"cool":3},"g2WBKoaaADfPOZ2zOGsI6g":{"text":"the beignets give this place 3 stars, but the food and location are just ok. they do have ","useful":0,"cool":0},"cWARa_-bqLNoHBUb6wWedw":{"text":"Good outdoor place right on Bourbon to listen to some jazz music in a casual setting.  We ","useful":1,"cool":1},"v4m5Le8c03JjR27udLrE_w":{"text":"I stopped by Café Beignet (bourbon street location) during my food tour of New Orleans. I ","useful":1,"cool":1},"2UhGfwMdu3QWBT3YjfmZvw":{"text":"Breakfast is terrible. No taste. The Krystal's fast food breakfast was 100% better than th","useful":0,"cool":0},"2yEhKfz-jEHZ5s3s6nMPYg":{"text":"This is my first time in New Orleans and I had to come here to try their beignets. They ar","useful":0,"cool":0},"6kY2swP78uMXLwmrU8Vq5g":{"text":"Went here for brunch on a recent trip to NOLA with some friends. Decided on this location ","useful":0,"cool":0},"dXj8xfsfXapb4zgH-rQK3A":{"text":"I like the other Cafe Beignet location better but I have to give props for this location b","useful":1,"cool":0},"d84Dz4Yrgi1p91KNym5bgQ":{"text":"I like this location better than the one on Royal, not quite as busy, not as long a wait f","useful":0,"cool":0},"hmzXXvpE7sIWLzmVlMGBUw":{"text":"A very tasty blend of funnel cake and donut.  Made onsite and served warm with a pile of p","useful":0,"cool":0},"nkPBi6tXRakpVgcMA38WQw":{"text":"Per the recommendation from a friend, we braved the smell of Bourbon street on a Sunday mo","useful":0,"cool":0},"Mqt9Fc5JmQFavn3XCuTDSA":{"text":"Loved this place, breakfast, coffee and beignet, a little jazz in the morning, a little fi","useful":0,"cool":0},"6lIJ6YYUQd_faZXT0vh8lA":{"text":"4 stars, place was quaint and the music was relaxing. At night it's all Sinatra style jazz","useful":0,"cool":0},"QrfdAS9-1IardwEBG8p6iA":{"text":"For those of you who have gave this restaurant a 3.5 rating..... Shame on you!\n\nNow that w","useful":0,"cool":0},"z9zWCAMjAf3B_7ZoPUlfeA":{"text":"Like: I like their beignets better than Cafe du Monde. Their's is actually lighter & not o","useful":0,"cool":0},"jyKnBXcwffYGXgEXh2j6uA":{"text":"This place was just ok for me. The Pulled beef sandwich was so salty. The shrimp, fish and","useful":0,"cool":0},"rHKRxd7MEN2xtM5PsLJ4qg":{"text":"Amazing beignets, far better than Cafe Du Monde. Also, try the elephant ear pastry, it was","useful":0,"cool":0},"5U7lKi2Qrdr4OL-RrEbvCg":{"text":"Large outside venue with full coffee and alcohol bar. I noticed others eating food but we ","useful":0,"cool":0},"NmQG9xZFKQgLfGhxAo_ALg":{"text":"The music is absolutely lovely, but don't get the old New Orleans fashioned.... it's worse","useful":0,"cool":0},"XO5UfHxDE8Dq1pgUF8axHA":{"text":"BETTER than Cafe du Monde!!!\n\nLess crowded (at 8am my mom and I were the only ones enjoyin","useful":3,"cool":1},"3jmUQcTBi_-jYyqzFz3v2w":{"text":"Breakfast omelets were good, but the beignets were great! Live jazz band was playing at 8a","useful":0,"cool":0},"p7V1aZ9lFvf45vXDXmH0QQ":{"text":"We stopped in here to get our fliers beignet and they were outstanding, also had a piece o","useful":0,"cool":0},"LJeJ-VdzjxgR6P0wq3IOPg":{"text":"We were originally going to Cafe du Monde on recommendations from friends, but the line th","useful":2,"cool":1},"ac7XK9pQ9kYhvStBE0phIA":{"text":"My first beignet experience wasn't bad. Too much powdered sugar overwhelmed the wonderful ","useful":0,"cool":0},"tdZ579lXnrgW4UJXESKtZw":{"text":"I'm here for the sugary French pastries. I love being covered powdered sugar, like a bag b","useful":0,"cool":0},"-_gvJWAateM4WXPu4zGLBQ":{"text":"Wow this place is bad. My first impression is that this would be a pleasant spot in an oth","useful":0,"cool":0},"CsfiizFRtRXcKS9TYi8OQQ":{"text":"I went there two mornings in a row while visiting New Orleans. It was right across our hot","useful":0,"cool":0},"QgUWAh9k1o2T0LQJC5-a3w":{"text":"Great spot to listen to music and have a drink.  And beignets are better than cafe d","useful":0,"cool":0},"gsqsTwM3EPSwHxMzKXXiYA":{"text":"I guess i'll write a separate review for Cafe Beignet then i did for the Music Legends Par","useful":0,"cool":0},"QPUSkB8gG2mrTeu8XCW58w":{"text":"For the food, I would give it 3 stars, but the ambiance would kick it up to a 4.  This pla","useful":0,"cool":0},"D_lPLu_xHK54Ruzm5uqhWg":{"text":"Horrible experience dirty, flies in pasrty cases and then when they bring my food a live b","useful":1,"cool":0},"98kHHGNKu9lGmutqymA_YA":{"text":"Average at best. \nReminded me if cafeteria food from a hospital or school. \n\nBetter places","useful":2,"cool":0},"NLgHhtnsmGyPaiEvwOAm7A":{"text":"Great place to have a drink and listen to jazz. Beignets aren't quite as good as the other","useful":0,"cool":0},"bHXbiB7yKg96rgedOkXVMg":{"text":"This little gem is tucked away in Legends Park on Bourbon Street. It's completely passed o","useful":0,"cool":0},"bIhqx2hFFPlhqLQXdTyFAQ":{"text":"Local musicians come out and play while you eat. Great little place outside to cool off. H","useful":0,"cool":0},"NOd34ZRL7u3AF3eXWVWGJA":{"text":"Within 10 minutes I tried both Cafe Beignet and Cafe du Monde. Both fresh and hot. For my ","useful":0,"cool":0},"TafNebbqB_ATrcqEkCyKwQ":{"text":"Let me tell you, the beignets here are incredibly awesome! They are so light and fluffy th","useful":0,"cool":0},"ovIrocI5U3kiI14hOx7-dg":{"text":"Let me tell you, the beignets here are incredibly awesome! They are so light and fluffy th","useful":0,"cool":0},"NZti7bAD7rWqA8bx0EfmPQ":{"text":"Best beignets I have ever had, but still haven't been to cafe du monde so there's still ro","useful":0,"cool":0},"9HGBWfYZVJzmVToDGFWlJA":{"text":"Cafe Beignet is a gem in the cesspool that is Bourbon St. \n\nThe beignets here are a little","useful":1,"cool":1},"xB6GWyvlM5pR1WMr9JN--A":{"text":"Beignets are like down pillows and the powder on top is like something outta scarface. Thr","useful":0,"cool":0},"PDQ6W0K62aGuh7xyDW440A":{"text":"Loved the chicory coffee but I found the counter service to be pretty unresponsive. Perhap","useful":0,"cool":0},"B85EhvSJpNGy84xi_BW4qg":{"text":"Beautiful indoor/outdoor café. Had the privilege of sitting on the second tier above the r","useful":1,"cool":0},"6puWySlCYPYslFSb3M25fg":{"text":"This location is amazing. There is a small courtyard where you can enjoy your food and lis","useful":0,"cool":0},"GBneLelQxMI2gv-Kyz5akg":{"text":"It was later in the evening and we found ourselves in the French Quarter walking around, l","useful":0,"cool":0},"iI0YOpS8sAAvOgyPVKklig":{"text":"Hot beignets, delicious coffee, and smooth jazz! Great little place to relax off bourbon s","useful":0,"cool":0},"WATk4tmyAQHj_N0a4b81XA":{"text":"Hands down, without a doubt, THE best place to get a beignet in the French Quarter (maybe ","useful":0,"cool":0},"-HigxcgvbywZD8Wj1RzJWA":{"text":"This is some of the worst food I have ever eaten. I could not finish my plate.  This is an","useful":1,"cool":0},"HfycA53VfGXrvB3i6Ijhsw":{"text":"It was our first night on our trip to New Orleans and we were craving beignets.  The origi","useful":1,"cool":0},"o9rEFDdWjpss_brpXTScmw":{"text":"This location is my favorite. There's nothing like listening to Jazz on a lovely early aft","useful":0,"cool":0},"60wPUBuVR5CPDwekM7q35g":{"text":"Great spot to escape Bourbon Street for a bit if you are in that area.  The Cafe is right ","useful":0,"cool":0},"tK3Wqbw2eTJ6wkLon7si7Q":{"text":"We went there for breakfast this morning. Although the beignets were great, the rest of th","useful":0,"cool":0},"Nk2HJOEXNbRMyfl4C8Bb9w":{"text":"If you want an amazing, hot beignet without the fanfare of standing in line for an hour, t","useful":0,"cool":0},"ZioaWxdmwCzWakt76hWiqA":{"text":"Beignets are amazing....breakfast sandwiches are great as well as the French bread. The om","useful":0,"cool":0},"mbdgnEyQoat0cv6MCIeMMg":{"text":"The only good thing about this place is the live music, music was great the food is lame p","useful":0,"cool":0},"-5dADzbhRhGRxSxN3c_HbA":{"text":"I read that Cafe Beignet was better than Cafe du Monde on a travel blog so I had to see fo","useful":0,"cool":0},"Oj3bwoXrhOBnmAroMKGQDg":{"text":"I love that on a Saturday morning at ten am they have live jazz in the courtyard! They did","useful":0,"cool":0},"_8E5DR7TZkw_hRkWai1RhQ":{"text":"Coffe and Beignets were good but the veggie omelet I ordered was greasy, flavorless and ju","useful":0,"cool":0},"3FvlTXgU1T0k45HEzOqMGw":{"text":"BEST beignets everrrrrr! Better than at Cafe Du Monde. Too bad i didn't try any of the cof","useful":1,"cool":0},"z-dOXcrC9X1tuSIFQMxRnQ":{"text":"Of the two Cafe Beignets we tried in the French Quarter, this was our favorite.  The servi","useful":1,"cool":1},"xhxXoyeCI9vMPQB48ZGBiw":{"text":"I grew up loving \"the other beignet place that shall not be named\" but the last couple of ","useful":0,"cool":0},"zGO6Jq05q1MS-NOwGyMorg":{"text":"Who doesn't want a Beignet while drinking your way down Bourbon street in New Orleans?  Th","useful":0,"cool":0},"R7HS72RNwEKD0-MRsLT2JQ":{"text":"A great spot on Bourbon St and much more relaxed, calm and collected than the many bars he","useful":2,"cool":3},"DynudSR7c28I9Ri1uGKQ-g":{"text":"Excellent coffee, best beignets, great location. Yesterday I tried the roast beef PO-boy, ","useful":0,"cool":1},"qKUUfNumdbBIjmarsPEi3A":{"text":"Amazing outside diner! One of my favorite places to visit in NOLA. Love the live music. St","useful":0,"cool":0},"ufHt2rP2UJWuerkQZatxdQ":{"text":"Loved the outdoor seating with a jazz band playing....really great NOLA atmosphere.  We ha","useful":0,"cool":0},"MVnQ1yiiPGFrBM9jP3TorA":{"text":"Sloooooowwwwwwwww!  Coffee was cold by the time order came.  Check-in if you want to be co","useful":0,"cool":0},"Ki-U5nK1DhlofHoIDebrSg":{"text":"Wife and I went on Friday evening and ordered two gumbos. When the gumbos arrived there wa","useful":0,"cool":0},"aon-wAHrELyuT6FM1L0VCw":{"text":"Refreshing lil tucked in courtyard with live music. Son and I ordered a shrimp PO boy and ","useful":0,"cool":0},"xWnLvBDmOSjThSnoRRKKJA":{"text":"The beignets here are better than café du monde, they were light and fluffy. The outdoor s","useful":0,"cool":0},"PDHu2N_Npw5WDOjHRQMW7Q":{"text":"2 words LIVE JAZZ!\n\nWe came here around 9pm. My family and i arrived and enjoyed live jazz","useful":0,"cool":0},"QlYtUC82jvuyRDvFBKrcUg":{"text":"Although Cafe Du Monde is home of the beignet, we think Cafe Beignet does it better.  Thre","useful":0,"cool":0},"UfAGNmPQbG2Zg87yjGse2A":{"text":"I had been to Cafe Du Monde before and had read about this place.  So we thought we would ","useful":2,"cool":0},"k_-Wu3dmkItg7n5buVy0Wg":{"text":"This place sits right in the middle of bourbon street and I know it's not like the other b","useful":1,"cool":1},"WKhfIFr9Y-sZTPNmJ2y_-A":{"text":"Live Music. Good Beignet's. And Coffee. I love live music and there's ample seating unless","useful":0,"cool":1},"aYRcC_WMXUJt2f0oIcOTsg":{"text":"Came here March 3, 2018. Waited at a different one originally (it's a chain) but ended up ","useful":1,"cool":1},"8YpQXQ-HdkPGnVnjLI1xkw":{"text":"Let me start by saying that being born and raised in France, it is obvious that their beig","useful":1,"cool":0},"RTWzhpyl7AQsntAA6uqDog":{"text":"It's great to have a place to sit down on Bourbon have a beer, cocktail or coffee and list","useful":0,"cool":0},"pN0yj7TCg2psI3Gw7OQ63w":{"text":"We went here because our hotel was a 4 minute walk from this place. After going to Cafe Du","useful":0,"cool":0},"QgExb_tH0-0D5TqYqLx7aw":{"text":"Live jazz was playing while we had brunch. The crawfish omelet was good but needed a littl","useful":0,"cool":0},"xhITFBdggghb_EuaW5U0Sg":{"text":"First time in NOLA and really liked this place. \nSuper inviting courtyard, live jazz band,","useful":0,"cool":0},"UcLk-1j2s0360JXZe_0eoA":{"text":"Great drinks! Excellent Beignets!! Music was fantastic and an all around good vibe. Embodi","useful":0,"cool":0},"JJWXAEC6GIuR1AOnmdui7g":{"text":"Our favorite place to eat breakfast in the Fr. Qtr!  We eat breakfast here every time we v","useful":0,"cool":0},"vIKCAmDrJT1J_gRc8JNIYA":{"text":"This is a great place and alternative to Cafe Du Monde. The beignets are a lot larger and ","useful":0,"cool":0},"oa5PayWUd6lAHb-nNW_XqQ":{"text":"Overall a fun experience - great little park setting with live music and the statutes of f","useful":1,"cool":1},"tbnDzMOavXyxSMPzda6gkA":{"text":"The beignets here were delicious. If you go in the morning they will be hot and fresh- jus","useful":4,"cool":3},"Yg_1AMC_pyZHAu2eZt4ujg":{"text":"We were in NO the weekend leading up to NYE 2012. After having stood in the cold for half ","useful":2,"cool":0},"m3ds094SDmqn5VKStATQUw":{"text":"Easy to find, right there in the busy craziness of Bourbon street. The beignets are delici","useful":0,"cool":0},"gOEeHzWAEJ4I4TXWJ9Mmgw":{"text":"Best beignets in French Quarter!  I have had Café Du Monde because of a friend's recommend","useful":0,"cool":0},"TAIQCAZo1oFuOxbCWel_Ww":{"text":"We got our first taste of NOLA at Cafe Beignet. I didn't know what to expect. Honestly, be","useful":0,"cool":1},"ZLJ4XxMiXyfKFFeGftp06Q":{"text":"Cafe Beignet is like a hot chick with no substance. There's a reason you want to hit on he","useful":15,"cool":14},"MH3AEkEIFJUjY6ZS-81GSw":{"text":"Beignets are very good but I still prefer Cafe du monde! This place had very few places to","useful":0,"cool":0},"6YvFAK25624AoobVXhLNSw":{"text":"Scrupulous melt in your melt beignets. The coffee is the perfect compliment to this delici","useful":0,"cool":0},"IqKkMLGFD454S03TyzAsog":{"text":"Was expecting much better from the reviews. We had better beignets at other NOLA spots, th","useful":0,"cool":0},"c1kHvNLKeledN0FipI_D0g":{"text":"Nice courtyard with live music. Beignets are decent, but pricey. Fluffier than cafe du mon","useful":0,"cool":0},"Rfg5-xdsAmwSYI1yjKTOVw":{"text":"Love the fresh beignet..... great ambiance.... Love the music..... If you want to chill.. ","useful":0,"cool":0},"ceF0t-c_utfm2734YaOXYQ":{"text":"Beignets, music and history all in one place. Outdoor so a bit chilly at times and a bit p","useful":0,"cool":1},"8pb2xwY7VpsIWBDfU-gGSQ":{"text":"Cute courtyard with good live music - too bad we were grabbing these beignets to go on our","useful":1,"cool":1},"OdfKRqUq2A52oqclMbUbvQ":{"text":"I enjoyed Cafe Beignet. The beignets here are made fresh to order so they come out steamin","useful":0,"cool":0},"_QKRrluNZPMzxaZ_i_089A":{"text":"I love this place.  I don't understand why anyone would spend an hour waiting to eat beign","useful":0,"cool":0},"2vZ5g9VzraLy0TPfw787Gg":{"text":"Great drinks! Excellent Beignets!! Music was fantastic and an all around good vibe. Very r","useful":0,"cool":0},"CEfWV5sge11CiNHExdh38A":{"text":"We were tired and tipsy and needed carbs. Cafe Beignet looked inviting at night so we thou","useful":0,"cool":0},"c1Eds6RfvEcFCBRTdmbwaQ":{"text":"Love the Beignets and this location has a nice sunny outdoor patio.  Nicer than Cafe Du Mo","useful":1,"cool":1},"Y0spQCfEfaEz6Inm0L7viQ":{"text":"Was carried away by the amazing jazz music into Cafe Beignets while walking the busy Bourb","useful":0,"cool":0},"G5QAai7pmqufSHV3Cp-uXA":{"text":"I came here for breakfast because of the \"look\" of it.  Aside of the cool jazz band that w","useful":2,"cool":0},"VaNBRNZ8NxcaDBtmXuQteQ":{"text":"I didn't actually have the beignets here.  I decided to check out the music and have a bev","useful":0,"cool":0},"rgHFquNQcElORhe5R36tdg":{"text":"Great location with jazz musicians playing/singing while you eat. We grabbed a late breakf","useful":0,"cool":0},"Cj_GOWgWRCOQfferxW8V3Q":{"text":"Wow. If you're in New Orleans, you will probably have to go to Cafe du mond. ... they're k","useful":0,"cool":0},"JFgMR_RpDVVEZrKvKK0h9g":{"text":"LOVED this place!!!! Such a cool atmosphere. Cocktails were good prices and the beignets a","useful":0,"cool":0},"MGzL1kdrBMZEFjMT4prN1w":{"text":"Fresh beignets, good coffee, a full bar and live band in the courtyard. Can't go wrong wit","useful":0,"cool":0},"fnB8wlq16xykaf9WeLOteQ":{"text":"Long line to order and wait again, but it was much quicker then other places, and they bri","useful":0,"cool":0},"Ff89KfGKWj97xv0tpXO3_Q":{"text":"Alton Brown disappointed us by saying this is the best beignets he has ever had. It was a ","useful":0,"cool":0},"gYOy5flp84btBG33NQpCCQ":{"text":"The beignets here were light, fluffy and delicious!  They are also far better than Cafe Du","useful":0,"cool":0},"CSVoLdDb1F915INoOqFoxA":{"text":"The beignets are a must try or must try again and again lol!!! This was the first place we","useful":1,"cool":1},"1WsTU9ZCFsNPrVeRWBE1Vw":{"text":"El cafe esta dentro del Musical Legends Park, un hermoso lugar con estatuas de celebres mu","useful":0,"cool":0},"Fy0RgqzGsJ6MHtc6f5lLAA":{"text":"We were walking down Bourbon Street and came across Cafe Beignet.  They had great live Jaz","useful":0,"cool":0},"v2hq_0bdtJ9IbNW9B3GoxQ":{"text":"went here to avoid the cafe du monde crowd.\n\nshould have fought the cafe du monde crowd.\n\n","useful":0,"cool":0},"Pq1lHu8I49uiFko6IS8z9w":{"text":"Price - Average\n\nService - Fast and efficient.\n\nWait Time - About 20 minutes no matter wha","useful":1,"cool":0},"1h3hetO80HUpLnZrfLaEww":{"text":"This place was right across our hotel so we gave it a shot.\n\nWe loved it!  Situated in the","useful":0,"cool":0},"DuRn-VQB54k3Jli_VR78GQ":{"text":"We came here twice at the end of the year, the beignets were outstanding-prices seem good,","useful":0,"cool":0},"7Ak_aMwTHgl9NDi4lShWZg":{"text":"its small, long lines, small patio seating area (try to sit outside, inside can get a litt","useful":0,"cool":0},"bxwdwMHt7-0UlR1RSnBhqA":{"text":"So I will say this place has so much charm that ANY other beignet shop will fall short. Th","useful":0,"cool":0},"SS-R3-DJ4fvFTs5AyMeJbg":{"text":"Great atmosphere but have to say the beignets are better at Cafe de Monde..... Don't know ","useful":0,"cool":0},"q_5kaA_4Ev0nFKERUWJaXw":{"text":"I finally caught it open in the after noon. it bothers me that there isnt a sign that says","useful":0,"cool":1},"hDHA8rL-EtVrdE4m8q8HFw":{"text":"I stopped in quickly during a scavenger hunt and only ordered one drink - a $5 mojito that","useful":3,"cool":1},"ma6YaEZP-28TPCnGcM8WQg":{"text":"You have to wait in line to order. There are people who bring the food out. The beignets w","useful":0,"cool":0},"3vaOVl5-Ml03YMZttphNEg":{"text":"While walking down Bourbon street during the day into the afternoon you can hear the music","useful":1,"cool":0},"Bx0aQV8zFWEGTcRBvmwDgw":{"text":"The outdoor seating here is Heaven and feels like classic New Orleans. It seems like there","useful":4,"cool":2},"BcF-Dlf0-0ATGVjQMBpIoA":{"text":"Cafe Beignet on Bourbon St has a great outdoor patio and local live music from 8AM to Midn","useful":0,"cool":0},"GfGcZP5Sv3QQo8p8rX6DHA":{"text":"Nice outdoor patio area. Live music was decent. Did not try the beignets . We ordered cock","useful":1,"cool":0},"t2zA3W5zyu48E0uzeTlFEQ":{"text":"Whoever invented deep frying was a genius. It seems downright disrespectful that this cook","useful":0,"cool":0},"6cWAb3JpBImjnPn94XMSKg":{"text":"Get ready to inhale your fluffy and warm plate of beignets when you stop by Cafe Beignet o","useful":7,"cool":5},"rJGk9TFktxwBdX7hvImdgA":{"text":"Beignets were really good, would definitely recommend order this, only.\n\nI was hungover, s","useful":0,"cool":0},"TxZy2MUHJlqg9oHxfd2FuQ":{"text":"The jazz musicians are the reason to come here. The beignets are good but not great. They'","useful":1,"cool":0},"FNagMczETOBEP_2ramPsvA":{"text":"Best Beignets ever!!!!!! Way better than Cafe Du Monde. \nSo I accidentally stumbled upon C","useful":2,"cool":2},"YbpNSqqxBTGzbXqy8Se5sQ":{"text":"Place was good. Beignets were ok but waaaaaay better than gawd awful cafe du Monde. A jazz","useful":0,"cool":0},"mrUH9L3QdftJmRLcwDZYzQ":{"text":"Steamboat Willie played some awesome jazz. This is a good spot to hang outside and enjoy q","useful":0,"cool":0},"T7KCBP6-qJZr7OPcCi7FKA":{"text":"Good iced coffee, great music and fresh, warm beignets piled hi with powdered sugar.....gr","useful":0,"cool":0},"Xm6P9juXfg5O6KHA03h0_w":{"text":"The beignets are much better than at that tourist trap CdM.  Theyre bigger and always hot ","useful":0,"cool":0},"J7_Gg2Y2NuEx_Hz81QSfow":{"text":"Honestly I was a bit disappointed. I first went to Cafe Du Monde but reading reviews they ","useful":0,"cool":0},"XbHDhDMQO2xkp7DpY-0cBA":{"text":"I'm beginning to wonder if perhaps I just don't like beignets. I tried this place and Cafe","useful":7,"cool":3},"AfcSretISCCxdFfIB_xvUQ":{"text":"We spent an evening here listening to great music and watching some foreign students from ","useful":0,"cool":0},"a2PkbcipHG5mSqA4DsqJzg":{"text":"Cute little cafe right in the heart of the quarter. I had wan egg sausage breakfast sandwi","useful":0,"cool":0},"MRsDkvAhpor4fTitF4BGEw":{"text":"Went here today for a late breakfast. I ordered the Cajun Hashbrowns, and they were room t","useful":0,"cool":0},"CWpdG43xDS1yur30o63_DQ":{"text":"***Changed to 4 for service! I asked about some tea and the water wasn't as warm as I like","useful":0,"cool":0},"PY14-VFvGTM60IYCmHsLXw":{"text":"This should be your first stop for Coffee and Beignets, not that other place, which we wen","useful":0,"cool":0},"JfJV6J8fjeQivI7IRmRhGQ":{"text":"03/06/16 - Great little outdoor cafe in New Orleans on Bourbon Street W/live jazz W/Steamb","useful":2,"cool":1},"9UYt9CiS87ddXkVNVAX7_w":{"text":"Way too salty!  I mean it was like I was eating a salt lick.  The staff was very friendly ","useful":0,"cool":0},"v2exvAXbyxOOAiFPoN4Y2Q":{"text":"The beignet was very greasy, and not very warm. The omelet, beef posted boy, and the grits","useful":0,"cool":0},"ksnZilQ3RQRyN4dmf6UOWA":{"text":"The live band is great. It was late @ night, literally 5mins b4 closing, so the coffee was","useful":0,"cool":0},"nif9GDCIqP6qPfmu0K4L3w":{"text":"Best beignets in New Orleans! Light not greasy, perfect amount of powdered sugar.  coffee ","useful":0,"cool":0},"5hGhuI_JjUGP04iEZOkL1g":{"text":"Terrible service and horrible value! $9 Cajun hash browns took over 20 minutes and were se","useful":0,"cool":0},"fIIjTyFLn58yiHezoYB49Q":{"text":"We enjoyed the andouille sausage omelet with grits and French bread. The sausage is a slig","useful":0,"cool":0},"jSuis5Rn7FiYGWOQiOrAzw":{"text":"Definitely come here for the outdoorsy seatings and live jazz/rhythm and blues. I ordered ","useful":0,"cool":0},"oV69L_9dcpjXlWpaLDibgA":{"text":"Probably captures a lot of the essence of the quarter in the morning. The crawfish omelet ","useful":0,"cool":0},"cuDrgst0pixNwU_eeSvSAw":{"text":"My Californian husband thinks the beignets are better than Cafe Du Monde, but even as a lo","useful":3,"cool":2},"AVMPA7WfS7lAaKM3Aj2r5w":{"text":"I want to give this place 5 stars but I just can't. The beignets are delicious, the little","useful":0,"cool":0},"1naye4rAg0b4zfOjO0chpA":{"text":"Beignets are good and the bar there has the best daiquiri (SoCo Mango). Seating is limited","useful":0,"cool":0},"VGdSuN2hdinP8xEfEhQkwg":{"text":"Beautiful setting in the park with live jazz. The beignets were great and the bar is nice ","useful":0,"cool":0},"ttuOYX0DfvpMCnOkA5jkDQ":{"text":"Great beignets, live music without the Cafe du Monde crowd.  If you have to say you went t","useful":1,"cool":0},"qNguFHhHZhrTorZ4Ox8cJA":{"text":"I give them 4 stars almost exclusively because of the atmosphere. Their patio has live mus","useful":0,"cool":1},"qXLee0L8DN9EDqSmRi5b8g":{"text":"I hated it! The coffee was just okay but the beignets were just gross. They were thick and","useful":0,"cool":0},"rZmZL5Du1_hLCpKCce58pg":{"text":"My favorite spot in the French Quarter. It can get very busy, but the food was good, the b","useful":0,"cool":0},"WhlE3Mmut5fL74xTqrEkiw":{"text":"Well if I could give this place a zero star grade I would. I tried to eat there after I ch","useful":1,"cool":0},"kshX756Cggk5K-lb-QYw1A":{"text":"Cafe au lait was fine but beignets were heavy, and uncooked doughy in the very center. Dec","useful":0,"cool":0},"kusw82gXZfFdON5wfCHwcA":{"text":"Good place to go to enjoy some live music and hang outside. Food is okay. Prices are reaso","useful":0,"cool":0},"kGY34K89pdak3eee8yj0Qg":{"text":"Unlike many of the other reviewers, I unfortunately had a very bad experience in terms of ","useful":1,"cool":0},"29dCJxXkq6p9jIkiXvDwSA":{"text":"Great place to pick up Beignets in NO. Live Jazz band at 10:00 on a Saturday June morning.","useful":0,"cool":0},"jQRAr5e8VJYYS7V28a4sOw":{"text":"Located just inside the Music Legends Park is Cafe Beignet.  Ordered the jambalaya and sha","useful":2,"cool":3},"mcQMLsdzxjmvSjPKcps84g":{"text":"Great location, right at the heart of Bourbon St in the French Quarter. We were recommende","useful":0,"cool":0},"Tsbvwnu-UmhdTW1ywizL5g":{"text":"I knew I had to get some beignets while visiting New Orleans so my girls and I stumbled up","useful":3,"cool":0},"Nd338hNmLtK2QRuCqxpKdg":{"text":"Better beignets than cafe du Monde, I'm talking about melt in your mouth Beignets. Mmmm. M","useful":2,"cool":0},"UsPrDUlcGznbh9ccblqQEg":{"text":"Good beignets made fresh just didn't like the seating all outside. The tables were very di","useful":0,"cool":0},"Pm4Z21XKwrZdqWvWxombEg":{"text":"The Truth!!!!!\n\nFood is too bland to describe! You don't want to eat here! \n\nFast drink wa","useful":0,"cool":0},"iC_nB897hzWarllg2s29NA":{"text":"While this is a cool place to set and have a coffee (or a beer for that matter) and listen","useful":0,"cool":0},"da2YBWKAInQ-MSTy9E-2WA":{"text":"My first night in NOLA and I find perfect coffee and dessert.  The decaf coffee was full b","useful":0,"cool":0},"ngOnNJOaGdFHyfoFu6Vibw":{"text":"Beignets are 3 for $3.99 plus tax =$4.38\nToo pricey for beignets. The beignets here are de","useful":0,"cool":0},"10lbIkuL7PbaKxdmG0hhpA":{"text":"Fantastic place to hang out in the French Quarter. Escape the insanity of bourbon street. ","useful":0,"cool":0},"RrVWOdLU4tzTBzYf2KVSQw":{"text":"For my NOLA trip, I decided that I would review the two major beignet cafes in the French ","useful":1,"cool":0},"Zxu7lxp3uih9ezzwObPY1A":{"text":"One of my favorite places to eat Breakfast on Bourbon Street.  Not the BEST food, but all ","useful":0,"cool":0},"WKqtPNlXO32Bc8pULiSaMQ":{"text":"The Beignet were hot and fresh. The price was nice for 3 and they are pretty big and the l","useful":0,"cool":0},"Bl3hyEep_cXXl1KbGSfEsQ":{"text":"I liked the beignets but the whole meal was a rip off. The cashier was rude and unwilling ","useful":0,"cool":0},"4PS6U1rvAs0-OwxaNYXLbg":{"text":"Ummm....I don't think gumbo is supposed to leave a bitter after taste in your mouth. I und","useful":0,"cool":0},"1Gpdyny6odUXknYjPfbfFA":{"text":"Place seemed nice. Went inside, bought two drinks, quietly sat at a table and enjoyed the ","useful":0,"cool":0},"l7231c9l_fcvMIeKhNQHhg":{"text":"The food is overpriced for what it is. The food is not bad but certainly not great either.","useful":0,"cool":0},"pKWNRPC7ByTrY4flPk5OMQ":{"text":"Great place to get away from the puking crowd on Bourbon.  The party continues in here but","useful":0,"cool":0},"rdnUey9PKozLtbWlk5zh7w":{"text":"Meh. My husband insisted the beignets were better than at Cafe du Monde...I disagree thoug","useful":0,"cool":0},"pOQFjtdzHr9d-aoyWA1e0g":{"text":"The food here was horrible. The red beans and rice was bland. my friend had the veggies sa","useful":0,"cool":0},"9-p4ujR3rCNgJdyvmM1eMA":{"text":"We tried Beignet for the first time. So good, especially because it came out piping hot. I","useful":0,"cool":0},"YTsYIXAb3TsgBonLcDn6GQ":{"text":"cafe beignet is an oasis from the hustle and bustle of bourbon street.  the open patio are","useful":0,"cool":0},"3Ieu4lxJRf2r_JOtXMmFBQ":{"text":"Fairly good beignets. Awful breakfast otherwise. Adequate service. Three stars only becaus","useful":0,"cool":0},"bATMTaV4wXzM8_RuUe4-eA":{"text":"Great location. Atmosphere was awesome. Live music. Quick service. Beignet and Bloody Mary","useful":0,"cool":0},"2iL6KSG7Zu3ysNJjk06YoQ":{"text":"Very good fresh beignets and fair American mule and good Shirley temple drinks. Good jazz ","useful":0,"cool":0},"PpfeRurhTn2Tx_GOXAHO1A":{"text":"OMG!  Beignets!!! So decadent and good! Why do I have to leave New Orleans?!!!! Combined w","useful":0,"cool":0},"XeECel-hd6yma9jQxPfBgw":{"text":"Everyone knows when you visit New Orleans you have to try the beignets! Of course, everyon","useful":0,"cool":0},"oi9vbGXemeeqhJAf1od1nQ":{"text":"Great ambience with live jazz. Friendly staff. Beignet too doughy.","useful":0,"cool":0},"q5r6cJBxQe5PqwczBIjzMw":{"text":"I noticed this spot earlier in the day while walking by due to the jazz music coming from ","useful":0,"cool":0},"r5zAwucCsyEzrYHFNwq2fA":{"text":"Located within the Musical Legends Park, grab yourself a serving of 3 beignets for $4 whil","useful":2,"cool":1},"WSYJrupRBMDE-OcuYwTL_w":{"text":"So so so good!  I wish there was a cafe beignet in Minnesota... I would be there every mor","useful":0,"cool":0},"qWwKbllLH3MZwQDe8CPa5g":{"text":"A nice alternative to Cafe Du Monde, without the line. The beignets were hot and fresh, an","useful":0,"cool":0},"5tSQ2k2mzM0McEXxIhRwaQ":{"text":"Stopped here to get a beignet and listen to the live music. The music was good (Louis Arms","useful":1,"cool":1},"MqKMkViun6PGBVKV-clOZg":{"text":"I wish I could give zero stars. This was absolutely our worst experience in New Orleans.  ","useful":0,"cool":0},"At3JxT0gq7ASjPgAA-v72A":{"text":"First of all this place is adorable. Good beignets and coffee, but eclaire was way too swe","useful":0,"cool":0},"xAmmA4SucEJGTzba6iNoKw":{"text":"Outside patio with an open stage performances is guaranteed, a cup of hot tea and beignets","useful":0,"cool":0},"dQXrT1yfMZb0T5YFxnLb1w":{"text":"Music and food mid day is hard to find, this is a good option. Definitely drink beef or th","useful":0,"cool":0},"gNFQgCIiTn4JgFDuCQYpZQ":{"text":"Came here to the Bourbon St location  after our Ghost and Vampires tour. It was about 8:30","useful":0,"cool":0},"Thk4Tj6xbxLQ4fGp86ZGDg":{"text":"Om nom nom beignets with powdered sugar. Where have you been all my life. The music is coo","useful":0,"cool":0},"nD3rXAeaJfOYvuDOd7fvDg":{"text":"a proper southern breakfast: eggs-bacon-grits-coffee-beignets. al fresco. with live jazz b","useful":2,"cool":2},"C4jhg2cb8PWtq9cv9YD04A":{"text":"The food was OK. I wasn't feeling that I had to go to the register to order lunch. It's a ","useful":0,"cool":0},"jPCaxZU0cs4UOqK-bs7VNw":{"text":"Wow what a place! A must come if you are in New Orleans. We came for breakfast. Nice porta","useful":0,"cool":0},"CnT9mwZrczL8BzZH-3Zsvw":{"text":"Best beignets in NOLA!! So much better than Cafe du Monde! This place is like a hidden gem","useful":0,"cool":0},"lo4Q0w7h_AUkidfyey5tSA":{"text":"More powder! More powder! Okay, no more powder! This is the best beignets I have ever had.","useful":3,"cool":2},"5BofHNq2LA-d78VHzUn4qw":{"text":"great beignet and coffee \nthey are the best in the World\ndefinitely y'all need to try","useful":0,"cool":0},"OWR8pi0VnDubFEhFBnHrTQ":{"text":"Best beignets in New Orleans - enough said. \n\nA big plus is that the place is right on Bou","useful":3,"cool":3},"YAeHZBME-aqV_iQYQatZYw":{"text":"Great place to hang out for breakfast cafe au let and Biegnet...tge setup is like a beer g","useful":0,"cool":0},"JOJj5E88UnTAeZp4TaG26A":{"text":"When in New Orleans you have to eat beignet everywhere! The cafe has a nice seating area o","useful":1,"cool":1},"nQSeJvZgWn4bDjpasHbfVg":{"text":"We tried Cafe du Monde once and have spent the rest of the week having beignets here inste","useful":0,"cool":0},"FTOEMOIM2OV04YxIe4rDow":{"text":"We're NOT rating the venue. We went there strictly for the beignets, and they were delicio","useful":0,"cool":0},"fGfG2bc78fULlICP9meswA":{"text":"I didn't know that this restaurant only had outdoor seating. I visited after some rain and","useful":0,"cool":0},"BuJJ4FxHJrxO6LyeS93Z1g":{"text":"My wife and I really enjoyed ourselves here during the late evening. The Jazz band is soli","useful":0,"cool":0},"5KO09gy8HjaV10mCazxyBA":{"text":"Lousy slow service, pretty bad overpriced drinks ($4 bottle of water...), and mediocre bei","useful":0,"cool":0},"M7Vkzbc8d0apjvrmhd81PQ":{"text":"Some  places capture a moment in life perfectly. On a gorgeous January day in New Orleans ","useful":2,"cool":2},"zcMs0UQA55hFLRUswXDDxA":{"text":"amazing beignets, they come out hot, with powder sugar everywhere. so, so good!!the coffee","useful":2,"cool":1},"SMrkAiOUgxZZi5O49wfV5g":{"text":"This place was good!! I suggest getting there early because they do have a line..Not to fe","useful":0,"cool":0},"cA9zDbPZbygsKeOmi8AJzA":{"text":"Great place for live music and New Orleans cocktails! We have the Abita Strawberry (loca b","useful":0,"cool":0},"vlhng-D0BXblW3PpVypQBg":{"text":"grab some coffee, friends and plenty of napkins. I only ordered beignets... the sandwiches","useful":0,"cool":0},"P50isZMNcxN_ah-6qVbXMA":{"text":"Cafe Beignet is a \"safe space\" on Bourbon Street.  An island to itself right off the Bourb","useful":1,"cool":1},"Ry4Tmm7PZetk_kd035ZsvQ":{"text":"We visited NOLA December 2012. \n\nI liked the environment of the live music and sitting out","useful":0,"cool":0},"TJ56LU0aduzxdrqWhVNgnA":{"text":"I echo others when I say this is better than Cafe Du Monde. I went twice over my 5 day sta","useful":0,"cool":0},"p91CprNA_W08aewz8ay4Nw":{"text":"Always enjoyed this place, Beignets are good, would t say the best, had various of their b","useful":0,"cool":1},"GAo9sD4En80CY1lvXVrHLQ":{"text":"Beignets beat cafe monde easily, shrimp poboys were really good, and the live jazz is grea","useful":0,"cool":0},"5LNbMancfiduEjDOKxupqg":{"text":"The omelet was fine but pricey for a basic edible omelet. The grits were cold. Lame live j","useful":0,"cool":0},"ZMZNzdB13_o4wZcikFDtSg":{"text":"6am and 3 hours of sleep after my first night ever experiencing Mardi Gras.  I roamed back","useful":2,"cool":3},"l9CT93sCF9rOPw-Brknl8w":{"text":"I gotta say their beignets are better than Cafe Du Monde. Cafe Beignet beignet's are a lot","useful":2,"cool":0},"dZJ4p6HwW5OL1oQ6wN9sFw":{"text":"This is an oasis. Hidden along one of the busiest streets in the Quarter is Cafe Beignet. ","useful":0,"cool":0},"kaOi0OAVzVqAbwnE3hYKzg":{"text":"Great little restaurant on bourbon street! I loved the beignets and the drinks there! The ","useful":1,"cool":1},"xgFqFHj9_qAntNs2CYsphg":{"text":"Love the atmosphere. Hated my first poboy sandwich. So plain and barely any fish in it. An","useful":0,"cool":0},"tQu7fFihuVh5Zj9MFfeGgw":{"text":"Ordered the shrimp poboy which came with no sauce on it at all. I went to ask for some tar","useful":0,"cool":0},"9Agh04C4sJzTXr2lzenrfw":{"text":"Love the beignets, coffee, and live music! Great place to sit and chill out.","useful":0,"cool":0},"5DgvRRdXaY4qeSOYUdf_yw":{"text":"This was our first stop when we got in town. The food and service were excellent. The live","useful":0,"cool":0},"0pedK5eRZacN0xYBCc0Xlw":{"text":"Donuts and frozen café au lait are delicious.  Service is like molasses and we almost miss","useful":0,"cool":0},"IFUM-4phxkGuTsxK5wWbwQ":{"text":"When I was planning my trip to New Orleans, all I could think about was beignets!  When we","useful":1,"cool":2},"zYzvUaqWMZ3KkzcVbtjRPA":{"text":"Live jazz music caught our attention as well as the beautiful courtyard.  We stopped in fo","useful":0,"cool":0},"LWbmMZQXWyVprxFRtwGiHA":{"text":"The beignets are $4 an order, compare to $2.5 at cafe du Monde. Then it's not even as good","useful":0,"cool":0},"VEGHDSyOmLKDMxljIrtEEA":{"text":"I wanted beignets while visiting New Orleans because you can't go there and not have them.","useful":0,"cool":0},"WqPAKtr6oqpBtYSWYYeKqg":{"text":"Walking on bourbon st we found this cute spot. They had live jazz playing & the cafe is sm","useful":0,"cool":0},"2LOUMNAcr3PVG6pEQmkfnw":{"text":"CAFE BEIGNET better than CAFE DU MONDE \nGreat beignets and fabulous music. You can have a ","useful":0,"cool":0},"0lx8UuHuDDlYpO1GFWca4g":{"text":"This spot is pretty nice. The food in this park is pretty trash. Beer selection is also te","useful":0,"cool":0},"h3knu1pWcA7A63V9TIGhxw":{"text":"I stopped in at Cafe Beignet last month when I was on my yearly \"staycation\" and as always","useful":0,"cool":0},"MgZPimMbHGy5f6wbswhVug":{"text":"What a fun spot! \n\nIt is definitely a tour spot, with lots of statues to take selfies with","useful":1,"cool":0},"ACptkbvwQjknYoWXNoQQig":{"text":"Admittedly, Café Du Monde is something of a tourist trap, so there may be a bit of a wait ","useful":6,"cool":4},"L46ez3o8VdcsjclSSFnKeA":{"text":"So when I ordered a bag full of beignets I was expecting one or two inch beignets. These b","useful":0,"cool":0},"TaFydtZSRrMALVjzG99mww":{"text":"The Bourbon Street location is nice but I  always end up the 334-B Royal Street location. ","useful":0,"cool":0},"GXuuN-ia3w6f9iaDnsY1cQ":{"text":"Best Beignets in New Orleans. Great music, food, atmosphere. I recommend this location.","useful":0,"cool":0},"uTnne_nl0DfPPXb1jwUhkA":{"text":"Still the best beignets in the French Quarter. Crispy on the outside and chewy on the insi","useful":0,"cool":0},"wsj1G_AkjfsOuQHWLhrGRQ":{"text":"We ran in for a quick beignet on the way back from a nearby pharmacy. It started to rain v","useful":0,"cool":0},"X3SPJn_zGWXb8Q40ZbGVgA":{"text":"Great music, beautiful courtyard, delicious beignets and coffee. I'm so glad the line at C","useful":0,"cool":0},"ttESDTfw6zLFtzwD_-V7Gg":{"text":"On our 2nd trip to New Orleans we knew we HAD to come back here!  It's so no nonsense!  An","useful":0,"cool":0},"TWk4D2CaFFoY54txgshkAQ":{"text":"I came here at around 9AM, hardly anyone out since they were all recovering from a hangove","useful":3,"cool":2},"offduV8_mZlATUSNOr1c8Q":{"text":"If you are visiting New Orleans and don't go to this cafe, then you are missing one of the","useful":0,"cool":0},"zJYng1lEIMHqaGn0xuKqwA":{"text":"I was only in NOLA for a short time, so couldn't visit both Cafes Beignet.  I'm so glad I ","useful":0,"cool":0},"rcua5S27t0bOG-EZEeLAvw":{"text":"Better beignets than anywhere else.  I like the music here and the atmosphere.  Great plac","useful":0,"cool":0},"mBlszk5VeVtF8SifzFJ8Pg":{"text":"High expectations are tough to meet.  With everyone telling me I need to try a beignet whe","useful":0,"cool":0},"j2sJVCPIeBAgEXe4-Uz9CA":{"text":"We skipped Café Du Monde and went here instead. The line was fairly long at 6:30. We order","useful":0,"cool":0},"BD_ovncnriPrxGMn4kgZ3w":{"text":"excellent beignet.  oh and the bloody mary was good too.","useful":0,"cool":0},"bFfglidq29gjUTALtiodmQ":{"text":"The live music performers were great. We had the beignets which are made fresh and they we","useful":0,"cool":0},"JEi_3VLeRSsTb15wKTK3vA":{"text":"All I wanted on Saturday morning was a Beignet and coffee.  We walked into Cafe DuMonde, a","useful":1,"cool":1},"lARnzQKrFhm1cLyhrGFMdQ":{"text":"Recommendations: jambalaya & beignets\nSmall portions but short wait and great outdoor atmo","useful":0,"cool":0},"n2EEiOaUcqButkjLwaZuCw":{"text":"They play Jazz in courtyard. Lots of seating outside. I had my first shrimp poboy sandwich","useful":0,"cool":0},"IoED_cQw-c2N0JruICKnaQ":{"text":"The beignets are really good but the cafe au lait was not reall good at all. As these two ","useful":2,"cool":0},"-VKZXNvS30X3pDncMxhxzQ":{"text":"Came to Cafe Beignet for breakfast with 9 guys morning after day 1 of a bachelor party. We","useful":0,"cool":0},"xxHcWbXym0e2-oG5gUbieQ":{"text":"Great beignets and music. Beignets are just as good as cafe du mond without the long wait.","useful":1,"cool":0},"4OZKsuwkxb1v97ci2rfRxw":{"text":"I was drawn to the live jazz as I was walking along Bourbon St. Reasonably priced, warm fl","useful":0,"cool":0},"gO7zOVfY1NxMKpDq8M0evw":{"text":"If you are looking for a nice place to enjoy a beignet, sit and relax with some good music","useful":1,"cool":0},"rZmM0tpcJoYxwP-4sj2oJA":{"text":"Saw this place on some food channel and just had to stop by....we walked up after a long d","useful":0,"cool":0},"cuUHpFDIzb6OtI2TYnxTZA":{"text":"Fantastic beignets....way better than Cafe du Monde! :) we tried both in two days....and p","useful":0,"cool":0},"YWlUBYT4Qt2axRkEsEU56g":{"text":"I think I liked these better than CDM although both are very, very good! How can something","useful":0,"cool":0},"lVE55uwAnigFX5EgQeXElA":{"text":"Walked all the way here from our hotel. Apparently they close at whatever time they feel l","useful":0,"cool":0},"7Zi3-GQ4Xv9T74fxibeg9g":{"text":"Great atmosphere, good food. Long wait. Just a precaution: ~30 min in line, 30 min waiting","useful":0,"cool":0},"ZWJK9bTvR8qkZlnaAZGkQg":{"text":"First beignet in NOLA. Was drawn in by the live music playing and got hooked. Service was ","useful":0,"cool":0},"uGwJa0SIrc3m0EOrUFYcTg":{"text":"The beignets at this place are the best!! Lightly crispy on the outside.  It's a great pla","useful":0,"cool":0},"gAqfrSl-ikfL5xUONusvJw":{"text":"The music was great the beignets were out of this world!  However, there isn't much in the","useful":1,"cool":0},"3bSth2SvlZs3Jr7y8TPV8Q":{"text":"Review is for the beignets. I'll keep it simple, these just aren't as good as du Monde. Te","useful":0,"cool":0},"dupOnr0geBsgK0aMe0OeZg":{"text":"While wandering bourbon street we came across this out door cafe with live jazz. We were a","useful":0,"cool":0},"-eSOsmdoweYbopNG_Qo2jg":{"text":"Very nice and quiet place if you want to escape the clutter of Bourbon Street. Food is dec","useful":0,"cool":0},"HCZSJhDKmBOaw7PwDFIv-w":{"text":"Crawfish Omelette is delicious. Grits are think and just the way southerners like them.","useful":0,"cool":0},"-YMISEnqDEuLJE803oJPsQ":{"text":"The beignets are very good, the bar is ok, the live music (Steamboat Willie) was great, an","useful":0,"cool":0},"QkCzzFnRGxPUuCBkl2lukQ":{"text":"The ambiance is great! The outdoor seating area is lit by the twinkling christmas lights a","useful":0,"cool":0},"KCbkOcUnZC5VPKuOBfxsSg":{"text":"Horrible po boys! Salty and overpriced for what they give you. Location is nice in the mus","useful":0,"cool":0},"Z_z3kk3g0fnnQXmSDL0M7g":{"text":"Location, location, location... Started off our early Saturday morning with some Beignets ","useful":0,"cool":0},"l3IDGrOQyA7nWv8PN4pM4g":{"text":"Amazing beignets and a great atmosphere. You almost forget that you are on stinky Bourbon ","useful":0,"cool":0},"tk1cL2jcNQ1koTUBRC5-Cw":{"text":"Great food! drinks and live music! You can't beat it for a simple quick bite to eat and so","useful":0,"cool":0},"qpWYcvhONyQy_VTTwbw5FQ":{"text":"Touristy? Yes. But live band in a nice al fresco atmosphere. The coffee was good, but, can","useful":0,"cool":0},"PYW847rFzbwepeNwjVmgCA":{"text":"Great beignets and other classic New Orleans' fare. Love the music in the evenings and the","useful":0,"cool":0},"IN6i9x8_6-GIpQAPifzQ7w":{"text":"Much better option than Café Du Monde! Much better quality beignets. However, it takes a b","useful":0,"cool":0},"qsTTVgqpEyP8VvzdASRiaA":{"text":"Visited this location on multiple nights, it's a good spot to sit down and hear some music","useful":0,"cool":0},"Ipl6ecEEFj-rTdWOrZ3urw":{"text":"The beignet is the \"thing\" in New Orleans, and what kind of tourist would I be if I didn't","useful":3,"cool":2},"PNX61VWDkZTHtWSZLqQJlw":{"text":"Tuesday night at 8:00, out of Red Beans and Rice, Catfish, and Muffelatta. Ordered Gumbo w","useful":0,"cool":0},"_Vj6ApN99pzLM23_nryAJw":{"text":"Food was average. The atmosphere is nice though, I sat outside and listened to live music ","useful":0,"cool":0},"eKuB7zgMd_gwdGZiWAwKHQ":{"text":"Someone said there's no bad food in New Orleans because the restaurant would go out of bus","useful":1,"cool":1},"BbXNJB2r7Lr22HrjNdNIcA":{"text":"I highly recommend eating beignets and having coffee here at Cafe Beignet.  There's live m","useful":0,"cool":0},"srA38KUxKTZcLDRFWckulg":{"text":"I was told I had to try a Beignet on my first visit to NOLA.  Our group had a few other di","useful":0,"cool":0},"TD4GL0GUyD-RlUpOnLlBqA":{"text":"Overall good spot. Come here for the love music, outdoor seating on a warm night, they hav","useful":0,"cool":0},"nQgcyQTVbVIBDYv6VE1pJg":{"text":"I thought this was the same place that was in Jackson Square years ago. Sadly, I was mista","useful":1,"cool":0},"tzw-mACpik_xdYVagtM9Ug":{"text":"Cute little place with hot, fresh beignets, hot drinks & music.  Good for late evening sna","useful":0,"cool":0},"F_Z12YnuEvfyJGvxEtm3iQ":{"text":"Definitely better than waiting in a long line at the other two places we first checked out","useful":0,"cool":0},"kW6Gdm2JY1I2MTJaLikZEA":{"text":"We tried this location on our second-to-last day in NO, and I'm so glad that we did.  Alth","useful":0,"cool":0},"UvyT1pWnJkIqwDkXMm_p-Q":{"text":"My husband and I stopped in here after a few drinks. I wanted something that was sit down,","useful":0,"cool":0},"0dL7O684Y4Y5rOY7a4pwGg":{"text":"I should have gone to Cafe Du Monde. It you want a bag full of powdered sugar and greasy c","useful":0,"cool":0},"V-GMyCJFmrVoTBKhK0NboQ":{"text":"Great location! It's right in the Musical Legends Park so it's the perfect place to grab a","useful":0,"cool":0},"x28Y9j5BrHE-IiqzQIR1aw":{"text":"I tried beignets at Cafe du Monde (3 locations), Morning Call, and at Cafe Beignet and Caf","useful":1,"cool":1},"TB-HTRadc1UXxQgr4POJAA":{"text":"The beignets here are a few cents more expensive than Cafe du Monde, but I had to try give","useful":0,"cool":0},"MXhFbyCqUQ1qLYB-6R-kcg":{"text":"AWESOME AMBIANCE. I'd go elsewhere for food though.\n\nIf you talk to any locals, you know t","useful":0,"cool":0},"fj5GK-ZtE77uPzSYOT57hA":{"text":"This review is for their beignets. They are called cafe beignet. If you order something ot","useful":0,"cool":0},"h6P0BE79MEyAVlsusQR5QA":{"text":"I actually liked these beignet's better than the other more popular place! They were a lit","useful":0,"cool":0},"UUL25Q-OjNk_atY0QQ4HmA":{"text":"The true NOLA experience.  You have to enjoy a beignet here.","useful":1,"cool":0},"KQEf-SdCjEKY_s9-Psvv-g":{"text":"Tried their waffle for breakfast this week, not bad!\n\nService was fast and seating was com","useful":0,"cool":0},"6OXEuuYsXiVvKXuZH0hESw":{"text":"Delicious beignets, outdoor seating, great cafe au laits, and live music! But the service ","useful":2,"cool":0},"NgvRtbZaXjL7I1uz_cbW5g":{"text":"Went to this location while on a walking tour. Loved the Beignets. The atmosphere is amazi","useful":0,"cool":0},"nkAYW68_koEtD2Y9shXgRw":{"text":"I really like the atmosphere here. For a relaxing weekday afternoon, chilling in the court","useful":0,"cool":0},"f2MxwgA9nKeE86lkpoi_ZQ":{"text":"If you want a break while touring Bourbon Street, stop here.  A nice little outdoor seatin","useful":0,"cool":0},"r7pX8nPoSIjslTT55DTY2A":{"text":"Lynn make' the morning start correct!! Get the get the Spicy Bloody Mary and enjoy the tun","useful":0,"cool":0},"KtfVLwurro5tUiVE7nAFsA":{"text":"After driving 20 hours strait from Pennsylvania my friends and I arrived in New Orleans ar","useful":0,"cool":0},"ExKz_T9nQLk4bXnpNzeWVQ":{"text":"The live music got us to sit down and order some lunch. I had a ham omlette with cheese bu","useful":2,"cool":0},"i4MvLw9Y_MWnrtWB61C5VQ":{"text":"Great breakfast place. Interesting breakfast dishes including sandwiches. Outdoor cafe a l","useful":0,"cool":0},"4Jan1ErjGTXuCCV2CJTqHg":{"text":"We ordered some beignets and were pleasantly surprised. They make them fresh to order with","useful":0,"cool":0},"7iQXwf59ip-zDaFQ61ZgmQ":{"text":"Food was terrible. Shrimp po'boy was dry and the roll was stale. Roast beef po'boy was ine","useful":0,"cool":0},"CMaxLr7vtK9vaKewf1ol3g":{"text":"Crawfish omelet was ok beignets well let me put it to you this way. To a Northerner or Yan","useful":1,"cool":0},"GQBRAmW_w5xBKUp-mc3ZCQ":{"text":"This was such a disappointment.  Our family of 3 came here for breakfast today.  We had th","useful":0,"cool":0},"TAkODvrz-W7PwBEM_oSpHQ":{"text":"My son and I had the cheapest little snack here with the best iced coffee around anywhere!","useful":0,"cool":0},"W4rC6JRUJLI18PYrYj8MAA":{"text":"Great Beignet's without having to wait in line for hours. The coffee was good, nice atmosp","useful":0,"cool":0},"b21RlDqg_KidRp-fYe9e3w":{"text":"This is such a cute place to stop. The beignets were pretty good but food is just average ","useful":0,"cool":0},"0xchnmMrqFjkxoOV4hLxkA":{"text":"This place closes at 10 on the weekdays. Just a FYI. Because we tried to come by twice dur","useful":0,"cool":0},"9KdO99eMNTtuYTrUgmD-3A":{"text":"I'm sure drinks and beignets are better at this place than breakfast. My bf and I ordered ","useful":2,"cool":0},"0WKbn7kW7y68X7s3z4KZAA":{"text":"Two stars because the beignets were exactly what we wanted and the courtyard location is r","useful":0,"cool":0},"hV5O_lNGr8MlaoxuflRtfw":{"text":"Good breakfast. Andouille sausage omelet was good, and beignets were tasty. The prices see","useful":0,"cool":0},"AAXvNik0PCEMwUs2LqKgQg":{"text":"Apologies we did not go to Cafe Beignet\nWe passed by and the location  was packed but we w","useful":0,"cool":0},"67Gv-Jz7aPp6rOu2Kbm4bQ":{"text":"Eggs from a box. Grits straight from the box...just added water...small..very small portio","useful":0,"cool":0},"LRTb6UoFapL6uj_eFG0XXw":{"text":"The first place we stopped at on Bourbon St, looking for something to eat and some drinks.","useful":1,"cool":1},"03rMmhwL6xHD77gYnEJIlw":{"text":"IMO, the beignets here are no worse than Cafe du Monde's, with the added benefit of short ","useful":4,"cool":3},"fGRVUvAaz9b8Glp2VBi3jg":{"text":"Came here for a mid morning snack and I can't say enough about their beignets. So great ! ","useful":0,"cool":0},"wC0EkRB5w7nhvxbMU_Ug9Q":{"text":"Staff wasnt nice, slow service, the beignets were not that good either. The jazz band was ","useful":0,"cool":0},"27lKp5-rZ7uX2IEpGjGPGQ":{"text":"Very nice outdoor cafe space. Live music playing all the time, which was really cool and n","useful":0,"cool":0},"3L2VsobCU-TRl_NN2YzufQ":{"text":"Beignets and coffee for breakfast listening to some live jazz just off Bourbon St and besi","useful":0,"cool":0},"B9pxxM2ipfc9YWvSngtbCg":{"text":"Nice open place. It is outside, so note that. Killer pastries and heavy cocktails. Don't b","useful":1,"cool":1},"F1a4LexTHpjSxI1GdMPmIQ":{"text":"I love this place compared to Cafe Du Monde.  Cafe Du Monde is more of a tourist trap kind","useful":2,"cool":0},"4-k80l4AxezKQbz3rb3f2g":{"text":"Stopped in this afternoon for an order of Beignets at Cafe Beignet and was very disappoint","useful":0,"cool":0},"2N8Ph2FHfZ3d2GMzY-wBOA":{"text":"Awful. The drinks are overpriced and nothing special. The bartender took out the garbage, ","useful":0,"cool":0},"8Il1ysKM1uqH8ZSg3QWTwg":{"text":"This is one of my favorite places now. We visited New Orleans to visit Xavier University b","useful":0,"cool":0},"7q0ctunDnU28rjOWWHUUtg":{"text":"Great music and chill environment. Self service  place which means you would need to get u","useful":0,"cool":0},"1Ai8rgWxUKMRbxkHPEgUJg":{"text":"As good and tasty as expected. There is a ton of powdered sugar, most of which I dusted of","useful":0,"cool":0},"Cnw4VfMvYRvhbEBniBCuag":{"text":"Nice spot to enjoy live music while you eat. The beignets were amazing and the service was","useful":0,"cool":0},"_OO5FoESZxoxEYT1l7E7Fg":{"text":"Very nice and laid back. -1 star as the chairs and tables are rather wonky. Beignets were ","useful":0,"cool":0},"fLke6kX6E-0liNMFz7XUpA":{"text":"What a lovely place in Musical Legends Park right on Bourbon Street. Feels like a private ","useful":0,"cool":0},"lEavusigdLj7odHFwYlk1w":{"text":"This cute little cafe tucked away in a peaceful area of Bourbon street, was a great oasis ","useful":0,"cool":0},"Ld5NqGguL0QdNSlE6VuS2g":{"text":"Strolling up Bourbon St and found this cafe. The courtyard was welcoming with its beautifu","useful":0,"cool":0},"zRvR8Z_khQYOCklxl9WMOg":{"text":"Definitely best beignets in town! Try them all but these will be your favorite! Pretty gre","useful":0,"cool":0},"x2-hK5Dv_Ijbg6MXCto5GQ":{"text":"Came here because of the cute location and wanted to compare it to Cafe du Monde's beignet","useful":2,"cool":0},"6wr_-SQnislHjGeSixyfrQ":{"text":"Ordered a cheese omelette with hash browns.  I was basically served flavourless unseasoned","useful":0,"cool":0},"55Cen26pROfV0zjp45frUA":{"text":"Visited NOLA in May this year. Cafe Beignet was across the street from the hotel I stayed ","useful":0,"cool":0},"JxI1a_aay0A8PtjkRC403Q":{"text":"Enjoyed this little cafe. Catfish was excellent. Entertainment ~ Steamboat Willie was grea","useful":0,"cool":0},"G_cWxwzpzZ7VVN-HkSoM_Q":{"text":"Got to enjoy a nice latte and some yummy beignets in their air conditioned cafe while list","useful":0,"cool":0},"dR-pR1WtcAR-ai2XuMnJ9w":{"text":"Touristy. Of course. But I was a tourist. So, of course I had to stop in. My husband and I","useful":1,"cool":1},"u9SPH25xDylIX4PF7dRTmw":{"text":"We tried the beignet here after having them at Cafe du Monde and liked these ones better! ","useful":0,"cool":0},"6g4MmoykFsinScV4uKorqg":{"text":"I LOVE their beignet. Compared to other places that serve beignet, this cafe seems to serv","useful":0,"cool":0},"mWLHyXFTq0Fl4hvcBYO5Dw":{"text":"This is a great spot if you want to listen to jazz in a cute courtyard eating beignets and","useful":0,"cool":0},"DQxYQ4DWH4iO9Syr3YLfvw":{"text":"Would not recommend this establishment to my friends. The staff was rude and the food was ","useful":0,"cool":0},"Sv7QE85lkffAhgTrRtWBhA":{"text":"This place is not always open...maybe because I am still sleeping in the morning after a l","useful":2,"cool":4},"RkIClya7BIavxe95TyOS2Q":{"text":"If you like beignets, then this would be the place to try some on Bourbon street. An order","useful":0,"cool":0},"4sGsdqBuQ85WdKKntrWl7A":{"text":"Now this is the spot for Beignets!  Not only is there live music but the 10-15 minute for ","useful":0,"cool":0},"j0INkiY0_Z3BINifTA0tnQ":{"text":"Cool place to hang out small portions, the  beignets Really good with coffee really like t","useful":0,"cool":0},"uGiyF74iRmohnWwRSFPJuQ":{"text":"I do not see that much of a difference with cafe du monde's beignet. If anything i'd rathe","useful":0,"cool":0},"I54_pfLNsAW9aqwWQRLaYw":{"text":"Went here for breakfast and got eggs. It was ok. Too expensive though for what they gave u","useful":0,"cool":0},"EQd_iy90Qko4ty934-WLTw":{"text":"The beignets are fresh and made to order. This makes for a bit of a wait but it's worth it","useful":0,"cool":0},"IATOHvWfAa7FcjyLwftdxQ":{"text":"The menu is very limited, however the patio and the live band is EVERYTHING! I ordered the","useful":0,"cool":0},"xCgTEbhKcbWM3o7bm6MKVg":{"text":"Great place to get away from all the Bourbon st. craziness! It's tucked into a nice outdoo","useful":0,"cool":1},"kcFgIvlk5ZfLyp45seSHtQ":{"text":"This place serves hot, fresh-off-the-fryer beignets.VERY VERY good. Even better than the o","useful":1,"cool":1},"n--PJrwwLHqKF4uZj7tG8g":{"text":"It is a nice surprise that we found this charming courtyard café on Bourbon street despite","useful":0,"cool":0},"sN0hNQkgHFWnoZf2pMmDmA":{"text":"Had a quick breakfast here on our last day. Line was long. Have someone snag a table while","useful":0,"cool":0},"vxOOBuHs3Ln-w2tz5KrpiQ":{"text":"So cute! The courtyard is adorable and a great place to enjoy Bourbon Street. We wandered ","useful":0,"cool":0},"tScaCON4xMZlIpYuGwlkLA":{"text":"We went to Cafe Beignet a couple of years ago and it was very good and better than Cafe Du","useful":0,"cool":0},"HwfnNnjIh_syVshUCANekQ":{"text":"Cafe Beignet was my first restaurant stop in New Orleans! The menu was easy and prices wer","useful":0,"cool":0},"nXDiZe8_BIPUTevk83jI2A":{"text":"I hate patronizing businesses just off name only and that's exactly this is! Horrible serv","useful":0,"cool":0},"V5-jRHW4HgwpHwwxVbHb1A":{"text":"This place gets 4 stars based on the beignets alone. Hot and sweet, the literally melt in ","useful":0,"cool":0},"j75_dqTI_UhRs9vnwDU5kw":{"text":"Came here in January on my second trip to NOLA. Perfect spot for delicious beignets and co","useful":0,"cool":0},"uP3Uz1whaacZY37U3PsdeA":{"text":"Let me preface this by saying that I'm a huge fan of the beignets at cafe du Monde.... I b","useful":0,"cool":0},"-WsWQXQEZMo7nq4xgiTtZA":{"text":"Jazz in the courtyard all day! 3stars for the beignets (s/b light & fluffy, lightly dusted","useful":0,"cool":0},"mMlmT8VJmR2Vq9nhf-BYYA":{"text":"Me and my wife stopped at Cafe Beignet while visiting bourbon st in down town New Orleans.","useful":0,"cool":0},"lCgGTDn2OB5k7NJyqo6jxQ":{"text":"These are the best beignets we had! We had to have them everyday. I think they're better t","useful":0,"cool":0},"mH6r0ovOitSbMpDueahHAw":{"text":"If you call yourself \"Cafe Beignet\" you'd think it would have a good beignet very disappoi","useful":0,"cool":0},"fi9FjJO96-jBnqBONLnjpQ":{"text":"Unfriendly staff, low quality coffee (ok, I'm a bit of a coffee snob, but come on, one sho","useful":1,"cool":0},"306dsjgANh1kp1rxwHMlFg":{"text":"Very nice atmosphere and good food.  Me and my wife happened to pass this place while head","useful":0,"cool":0},"tHqOOrHz2MMDIXGQvwb2AQ":{"text":"Great drinks and great Jazz music. First time and first stop w live music - best choice of","useful":0,"cool":0},"kt3Ys6C7-UgwiKJnRo9YAg":{"text":"Avoid the food.  But do come for the live jazz.  The only good thing about this place is t","useful":0,"cool":0},"df2FYJoCwuHeX-lcjU70Pg":{"text":"very crowded and it took a VERY long time to get the Beignets. By the time we got back to ","useful":0,"cool":0},"ZBdFLNbfkYzZMDvX7WtHKA":{"text":"Arrived 30 mins after they opened on a rainy Thursday. Beignets were delivered cool to the","useful":0,"cool":0},"3WlHcesRK7_hjzohn66B7g":{"text":"There's nothing like a catfish po-boy in the heart of mardi gras.  The food here is delici","useful":0,"cool":0},"tyoMAKcbmoEQSRbvHdho5w":{"text":"Location, location, location!  We stayed across the street from this place and I just coul","useful":0,"cool":0},"YT_kpwKldJum2-tBBZG4fA":{"text":"Just came back from a spring break trip to Nola and we were told by many to go to cafe du ","useful":0,"cool":0},"3oH3_w-aOiz2XTSAXpuvmQ":{"text":"Service is great , music is great. Ambience is great. Drinks are Cheap and beignets were f","useful":0,"cool":0},"X8mBda7OFWtuNn8KtXGP8g":{"text":"Came here this morning and there was live jazz. Food came out fairly quickly. Got the beig","useful":0,"cool":0},"L2NIR00V7C3k1RCScN9Lqg":{"text":"Walked in this morning for latte and maybe a pastry. Pastry display was enticing. Problem ","useful":0,"cool":0},"QvK_zjIH43MxbO86K6n6hQ":{"text":"LOVE- 1st beignet in nola (very good), there's other goodies you can order for your sweet ","useful":0,"cool":0},"5ZAfNHaANVnAkRhdtFtWBw":{"text":"Beignets are better here than cafe du monde. Great little courtyard with live jazz. A must","useful":0,"cool":0},"xQoRYrC5p_xF13-pVZhylA":{"text":"A Mr. Brown said that these beignets are some of the best things he's ever eaten. I was cl","useful":0,"cool":0},"q_kTD3lxN3PM3KAKQp9-hw":{"text":"Went here while taking a break from the crazy Bourbon St crowd.  Live music was great and ","useful":0,"cool":0},"0Su7y6NMGMK0FLJc_hAgQQ":{"text":"I tried both Cafe Beignet and Cafe Du Monde while visiting NOLA and I gave Cafe Beignet fo","useful":0,"cool":0},"RgIPe50aihrNl_xy59O2AA":{"text":"Only spent a short time there. My cousin and I on our first night in NOLA strolled into th","useful":0,"cool":0},"VTg9Ln3Wod7Qt2_B5blVXw":{"text":"Small place \nOnly a few tables\nBirds flying in and out of the restaurant \nBeignets were ok","useful":1,"cool":0},"PD2jjZbEJZjG0yU2WHa-qw":{"text":"The Cafe Beignet location on Bourbon Street is the type of place that makes New Orleans sp","useful":0,"cool":0},"QYYT18YvUsAzn-hb7VZVgg":{"text":"Café Beignet was awesome! \nAll I had were the beignets, but they were awesome! I love the ","useful":0,"cool":0},"q0L67uuTa2suWpXhoKv6UQ":{"text":"Fantastic foood, coffee and environment. I recommend for an idea New Orleans experience.","useful":0,"cool":0},"Z0w0C4hk7gA2Tby_eCEcfA":{"text":"Bleh, skip it.\n\nAtmosphere: On the busy Bourbon Street. Decided to come here for breakfast","useful":3,"cool":0},"UQecb_Yzd0L3EMgOrs4vcA":{"text":"Came here two days in a row. Had the Shrimp Po-Boy on the first and the Breakfast Sandwich","useful":0,"cool":0},"CHUxJFAYjzh23OIXbmgQxg":{"text":"The courtyard its in was really cute, and they have live music for what it seemed all day ","useful":1,"cool":0},"mFWc6oR6CdXNh3y8y-FzCA":{"text":"I've been here two times now on my trip to NOLA. First time around I just had a drink from","useful":0,"cool":0},"KiobWJKyqTUL-yD87_-seQ":{"text":"Now this particular spot was just great!\nIt was chilly out, but we enjoyed some coffee and","useful":0,"cool":0},"tKKKZtHCtoOjVjGwGyyvFA":{"text":"This was the first meal I had in NOLA and it wasn't bad. It was a fun dinner with the band","useful":0,"cool":0},"EaqQs2cq3YTaW6poMoi9fw":{"text":"So after going to both cafe du monde as well as cafe beignet, I can tell you that cafe bei","useful":2,"cool":0},"Bmn6TwfX2yJMQdJpTtpNtA":{"text":"I love beignets because they are soft and just the right amount of sweet. While these were","useful":0,"cool":0},"-_3SIm-iGrlRQqp6Gg7YOg":{"text":"My DH and I stopped by on the evening of October 2, 2015.  We had a great time listening t","useful":0,"cool":0},"4TOpBx5stbNGA2j6s8PXVQ":{"text":"The Cafe Beignet On Bourbon has some kind of live music playing most\nOf the day. \nYou can ","useful":0,"cool":0},"t1dz3TAkyR_psd_lf3QwfQ":{"text":"My first time in New Orleans and my boyfriend was ADAMANT that I had to have a beignet (ev","useful":0,"cool":0},"gFjqxxpKVG4KGx6KgYgN7g":{"text":"This is way better than cafe du monde. It was large doughy but it tastes so much better. I","useful":1,"cool":1},"jtZu8CSrXBwRss9RnIGw_w":{"text":"This place is a little sanctuary on bourbon street.  The courtyard is lovely with statues ","useful":0,"cool":0},"GtlF28RBv8PAHAPnrPGVAA":{"text":"I literally stumbled into here (no, I was not intoxicated, just super clumsy) and was intr","useful":0,"cool":1},"N0FhiXzAfAFBaNhhD6GkVQ":{"text":"Mini and Mini were sooooo sweet and helpful since it was our first time there and we didn'","useful":0,"cool":0},"WWZOy9MsCDvTClBr_iZMBg":{"text":"Came here for breakfast.  The boyfriend ordered the Southern Breakfast and I got the Cajun","useful":0,"cool":1},"1IhjK6eI5H9HIanQHkEyeQ":{"text":"Gave this beignet proprietor another shot at its other location incredibly close and still","useful":1,"cool":1},"pYwsS9WbNLpFuRYaonNMUg":{"text":"The place for perfectly made beignet's.\n\nThe register area is tight and cramped when it ge","useful":0,"cool":0},"IPbY34GLAH7KqKqr3XKUfg":{"text":"I came here during the afternoon when bourbon wasn't quite as rowdy. There was a live band","useful":0,"cool":0},"WCtIJls6wKesWih_ugcmhw":{"text":"Had to check this spot out after going to the other Cafe Beignet and Cafe Du Monde.\n\nIt's ","useful":0,"cool":0},"QD-V6BpG6fe_pJT9zmHa7Q":{"text":"Great breakfast, great atmosphere & the beignets were just as good as those at the cafe du","useful":0,"cool":0},"p4lyjDRxsdtInhm2Qwvisg":{"text":"The beignets were great. Better than Cafe du Monde. Definitely stop by because they had cu","useful":0,"cool":0},"SKWj7BQVP1QCbVT9qQcW2g":{"text":"This is a hidden gem along Bourbon Street.   The mesmerizing sound of Steamboat Willie was","useful":0,"cool":0},"aCfd_zfmkxndonAqITB3Gg":{"text":"Beignets were good, greasier than others I tried in the French Quarter and about a buck mo","useful":0,"cool":0},"fSCVKZj4Va_qPyy-LBZ2Sg":{"text":"We stumbled upon this place inadvertently since we already went to \"Cafe Beignet\" on Bourb","useful":0,"cool":0},"erjob0JbVG-qVNd6Bnbs3A":{"text":"Ambiance was nice. Live music and great outdoor seating arrangements. But food was meh and","useful":0,"cool":0},"xowU57NKDdbb9o3Cvb-H9Q":{"text":"Although it's a nice atmosphere and the music is wonderful, the food isn't great. It's ove","useful":0,"cool":0},"F50RV3AasZrkrpx9J7fH6w":{"text":"Terribe food. Won't refund if you don't like it. They didn't even offer me something else ","useful":0,"cool":0},"aagV04UqOuLuiDxuCPpHxg":{"text":"This place was a nice quiet place to stop in for a break from the hustle & bustle of the F","useful":0,"cool":0},"owhrHm8svr3t6J8E_GOzTA":{"text":"I lost my beignet virginity to Café Beignet. And they set the bar high. \n\nBefore my trip t","useful":4,"cool":4},"6E5FYePVbg3djFt2YADNfg":{"text":"I decided to compare beignets at Cafe Beignet and Cafe Du Monde.  There was no contest.  C","useful":0,"cool":0},"oQZUCWuziiw5SE7jHQmsVA":{"text":"Great music, greater beignets. Overrun with tourists, but what the hell am I anyway?","useful":0,"cool":0},"bSJiyt44xcoetkl13pxJ6Q":{"text":"I throughly enjoyed this place for the beignets and live jazz music. We kept passing it si","useful":1,"cool":0},"V2oooZFQR-mNemQKSzXlAg":{"text":"Much preferred over cafe du monde. It was way less crowded, had a cute little bistro set u","useful":0,"cool":0},"W6RWOqHhBiSnoWmGGtKnDw":{"text":"UPDATE: Realized I wrote my review for the wrong location, but Yelp won't let me delete th","useful":0,"cool":0},"3mvzCDWeQViqg3mArbc7fQ":{"text":"Fun place to sit outside and listen to some music.  We stopped in a couple times to sit do","useful":0,"cool":0},"cn8cC4aqYk2vOCXu8PYOzg":{"text":"Great time, They have a great Jazz Band , Steam Boat Willie!!  We love the atmosphere and ","useful":0,"cool":0},"9agDKMor9i7YBHNW5oJ59g":{"text":"Great atmosphere. Great beignets.  Nice place to escape the madness of Bourbon St & sit do","useful":0,"cool":0},"cuY_Ou7ZLsH-D1zlRTIgYg":{"text":"Alton Brown's favorite beignets when in New Orleans and I agree!  Compared them to the bei","useful":1,"cool":0},"N-nQwvgtGP9frBODjSCouA":{"text":"The cafe is conveniently located in a nice plaza on Burbon Street.  It is a good place to ","useful":0,"cool":0},"vC7KnhfdlHfbYgK58Hfwnw":{"text":"Friendly Staff, Delicious beignets, Refreshing Lemonade, and Live Music!\n \nThis place is h","useful":0,"cool":0},"_EQjrw336LghRCV3wmD3fA":{"text":"This place is awesome. \nPopular, so a line can form very quickly. \nOutdoor seating. \nMy mo","useful":0,"cool":0},"1xk1flcq5LC6Kejwc9J3eg":{"text":"Uh oh. Tourist trap? I think yes. \nI've only had the breakfast and beignets, but that was ","useful":0,"cool":0},"AOh5Wx2bhf1sbxQvqQTs3w":{"text":"I wouldn't say their beignets are better than Cafe Du Monde's but they are pretty good. It","useful":28,"cool":28},"pmWAtCEZSM2YBU7_w71z-w":{"text":"In the argument of who has the best beignets, Cafe Beignet is one of the 2 most well known","useful":0,"cool":0},"_PzHsPc6HeTXC_gwEB-HjQ":{"text":"Nous avons découvert l'endroit par hasard sur Bourbon Street. L'endroit est accueillant, l","useful":0,"cool":0},"bBQhuF-q6NSVLyRCRAIDuw":{"text":"Fun! Open air seating, but covered and out of the wind / rain!  Live music entertainment! ","useful":0,"cool":0},"k_GwiBDVapT9djEBqTPQuA":{"text":"There is a huge debate whether or not this place or Cafe Du Monde has the best beignets.  ","useful":0,"cool":0},"PuYjKRQFQ5YAJO9fjGnnKw":{"text":"Fantastic hot fresh beignets.\nExcellent muffulettas\nGreat coffee\nClean restrooms\nMusic 10a","useful":1,"cool":0},"QQbT_Ocl_ZoIkMhoctsWGQ":{"text":"If you're a tourist looking for Beignet, stick with cafe Du Monde. These are too doughy, t","useful":0,"cool":0},"HK0FbQc_qDmjnPeLCYjp6g":{"text":"Probably the worst option for cajun food out of the dozens of places along burbon st and t","useful":0,"cool":0},"da7jvWDIA8YSOHBY8a5S5A":{"text":"I enjoyed it. The beignets were pretty good, although I had higher expectations (guess I'm","useful":0,"cool":0},"Cacw6AMebzvDWu5-tqztqg":{"text":"This is by far the worst attempt to pass for Cajun cuisine. The shrimp po boy had popcorn ","useful":0,"cool":0},"Mz7dsqC_p_5XiidDh9Y2Zw":{"text":"LOVE this place! It's my favorite beignet place in New Orleans. I like it better than Cafe","useful":0,"cool":0},"I1GasSPb6Z2uMb_6SwtSyg":{"text":"Nice garden area but way overrated. Too busy and crowded. Toilets were dirty. I was not im","useful":0,"cool":0},"gSGH3ex085KQ0Gq_vU_zmg":{"text":"Great atmosphere, great beignets, and great sandwiches. I got the bourbon tuna and I reall","useful":0,"cool":0},"7kURgTIUB_4YK_PTjltivQ":{"text":"I'd definately head to Cafe Du Monde rather than cafe beignet, but I had to try an alterna","useful":0,"cool":0},"OX3EmInNWP7Z2eS_JRLY5A":{"text":"L'endroit est très sympa en terrasse avec des musiciens mais pour les plats c'est moyen","useful":0,"cool":0},"J6ivriCbBe5c-GX5FnES4w":{"text":"I enjoyed the open court yard right on Bourbon St combined with the live jazz at 8:00 am i","useful":0,"cool":0},"2-NUvSezpXpLvmvsjfTqbg":{"text":"The beignets are awesome. The bar side not impressed , the barmaid was nice.","useful":0,"cool":0},"iWPF5CgXsrBpijxvF_yJzQ":{"text":"Our visit to Cafe Beignet started with me ordering a mint julep for $5.  \"You drink whiske","useful":3,"cool":4},"wqmL3Bq4C45QAq_TR0TEsA":{"text":"Really - why did I waste the calories.  Just go to Café Du Monde as these are no substitut","useful":0,"cool":0},"YMFOn-sYyP72foUwdkFuCA":{"text":"Me and my partner were in New Orleans for a conference and stumbled across Cafe Beignet on","useful":0,"cool":0},"Uc_XxQDw6yE3ZvaSeduAjw":{"text":"Was riding the hop-on-hop-off city tour and this was the last stop. \nThe line was long ,bu","useful":0,"cool":0},"YB_bCbk2DgB7Gg4E3Lp9Fg":{"text":"Crawfish omelet and beignets were delicious!\nThere was also a live band playing jazz.","useful":0,"cool":0},"CVdudwhs_7-oqQM1XlNK5Q":{"text":"Best beignet in the French quarter. Light and airy, served hot with ample powdered sugar. ","useful":1,"cool":0},"4-LVdoapMjHUfCMohVbpcw":{"text":"Came here twice in one day. Didn't try the beignet either time. Can't eat them. Will die.\n","useful":0,"cool":0},"lDueL8uOSvNyBtf8Cc4_qg":{"text":"When in the French Quarter for a vacation you will start to feel that the food is a little","useful":0,"cool":0},"oBXV6naxAO2QmPEolwoVEQ":{"text":"Delicious beignets. Live music on a nice day mAke it a perfect atmosphere to enjoy your br","useful":0,"cool":0},"dYy_S8fCsAcmqWVhkidUOg":{"text":"Of all the Cafe Beignet locations, this one has the best atmosphere!  The \"Musical Legends","useful":3,"cool":3},"83xaRbde2cFzmwwWP-3bww":{"text":"Wanted to try their beignets since I experienced café Dumonde beignets the day before. The","useful":0,"cool":0},"WS0BeYN_bUulToGaXdZt5A":{"text":"Beignets! Yes, please! Sugary, warm deliciousness! Three giant beignets for 3 dollars?! Ho","useful":0,"cool":0},"FCqzCvZs2MP0-uu8mJ0msQ":{"text":"Very cool place to hang for beignets. They were different than most beignets, bigger, thic","useful":0,"cool":0},"4XoJqlAKWOkDmw4-q4JGqg":{"text":"Food quality is poor.  Portions are poor as well. Service was poor as well. Not customer o","useful":0,"cool":0},"viPkQ_Mxk0RbCmO0i__Z1Q":{"text":"Frankly I do not see the difference between beignets here vs. ones in Cafe Du Monde. I act","useful":0,"cool":0},"GdNC8qRljJfcEiS8Tr6Puw":{"text":"Good beignets, but only okay service. The staff seemed overwhelmed and confused at certain","useful":0,"cool":0},"TaCC7hkAbDvOlMTxzLC_AQ":{"text":"Huge beignets... they were huge! ISugary, doughy, and hearty beignets loved the live music","useful":0,"cool":0},"oyGp9mYFxblitIPqEoGOpg":{"text":"Wanted to try this place to see how it held up to Cafe Du Monde and was not disappointed! ","useful":0,"cool":0},"gJrqScTik7mQVKUrD-T6dQ":{"text":"Best beignets on the quarter. Great prices, live jazz bands day and night. Nice patio in s","useful":0,"cool":0},"PUwdMVorh5aNRnxtzPykLg":{"text":"I adored this place due to its location and ambiance. Situated in Musical Legends Park, th","useful":1,"cool":1},"h4uWvFvKZncDIGCVKVA2vA":{"text":"What a great little place. In the discussion between the ultra famous Cafe Du Monde and th","useful":0,"cool":0},"3oZvXy5YVY1Y7V1jiSCwNA":{"text":"The cafe latte was horrible!!! But the beignets were truly delectable hence why the place ","useful":0,"cool":0},"YoBdw3jAupnfFRCX1qllEA":{"text":"Disgusting. Overpriced. Don't eat here. We paid 22$ for 2 cups of brown hot water that was","useful":0,"cool":0},"pWo55hDxvYTLsEOmumsoMw":{"text":"A lovely place to stray away from Bourbon's craziness and enjoy a nice latte and beignets ","useful":0,"cool":0},"JzD7FyFQe6CPpvJkfsZhjA":{"text":"Other than the beignets being over cooked, I brought  in a slice of pizza while the rest o","useful":0,"cool":0},"4Ka0VTM_tspZ84sYUDgmlw":{"text":"3.5. The beignets were good but they seemed a little bit like funnel cake. The cafe is pre","useful":0,"cool":0},"rhD4hgQjf3AW_z1wjAaQGA":{"text":"Last time we were in NOLA, I only tried Cafe Du Monde's beignets and was not impressed wha","useful":4,"cool":1},"MWYo_azjkWHAoBkmRht7vw":{"text":"I heard these were better than Cafe Mondue. So I gave this a try first. They come to your ","useful":0,"cool":0},"LogCCylYM--TGhFFefoOiA":{"text":"If you are looking for beignets in the French quarter this is my recommendation. Personall","useful":0,"cool":0},"hs7qqqyapU-9RT4RXUHFmQ":{"text":"Beignets were real tasty and fresh ! I myself don't care for them but my wife loves them. ","useful":0,"cool":0},"y9nFySIcpRUB__r7VByIlQ":{"text":"The beignets here were excellent, served hot with so much powdered sugar. So much better t","useful":0,"cool":0},"tZw0FrsVD8uyl0ddsjkWqg":{"text":"Quaint place, but they had yummy food. My mom had an omelette that was good. Not a fan of ","useful":0,"cool":0},"_hxZZ12ydBncGaKBmL73sg":{"text":"We tried this place in addition to Café Dumond and they are both very good. I prefer café ","useful":0,"cool":0},"AaT0q1ejJB-krCIEJn2rwQ":{"text":"A friend told me the beignets here were better than Cafe Du Monde. I didn't agree, but the","useful":1,"cool":0},"wkzCnyCci9kSlKQBd4fyDA":{"text":"Great little place....pretty much an outdoor courtyard with a walkup coffee- and-snacks ba","useful":1,"cool":0},"Vy7H9w4M7W9mT6JlSee9gw":{"text":"When doing the tourist thing in the French Quarter, we popped by on a Thursday night becau","useful":2,"cool":1},"w20dLe0gejDllTM-L5tsCg":{"text":"There is nothing better than an evening of hot cocoa, beignets and live music outside of C","useful":1,"cool":0},"Bn55s-E4QL2rI-hq1PQcog":{"text":"Had lunch here after looking for an inexpensive gumbo that was local. The atmosphere was n","useful":2,"cool":0},"DvLmUl62ntyX0vrBQJNPNQ":{"text":"If you love French toast, skip it. I can see the cinnamon but the bread has no flavor. For","useful":0,"cool":0},"CY2nfVgjGhPR9TP-hXhtyQ":{"text":"So we found this place on Bourbon St which was a nice surprise!  Great outdoor patio with ","useful":3,"cool":2},"9JlfPtmDIheRFqTN0JJ0aA":{"text":"Cafe Beignet isn't as hyped up as Cafe Du Mode, and it's a little more expensive, however,","useful":1,"cool":2},"8tc_XgFeS0D8lkTq0ThpHQ":{"text":"a great alternative to the overcrowded OTHER beignet cafe :).\n\nThe staff is super friendly","useful":0,"cool":0},"o4ymHJEE3xTE_oPuS0iU9g":{"text":"Let's get right down to it. After all the hype, I must say that I was mildly disappointed ","useful":0,"cool":0},"UuAyH0B7F_0eW-TITdz92Q":{"text":"This is a review of the original. The food was good but their shady business practices are","useful":0,"cool":0},"Mx8rdkDKgZr29zbONkbcDg":{"text":"This place is so cute! And the Beignets were amazing! We are them while listening to live ","useful":0,"cool":0},"Ns4TC2jE0MjiLUGdlrys4A":{"text":"Could the wait staff BE any more irritated to be serving?  My Cajun hash browns came a pla","useful":2,"cool":0},"UawJnka7tVn1wlm154pwzA":{"text":"Thursday night at 9:30. Atmosphere was great. Live musicians playing good music. We manage","useful":0,"cool":0},"zrX2EfukwBhpt0OTjnDWmQ":{"text":"Lemme sum up:  Best beignets in town, relaxing patio, great value\n\nIt's hot or it's gonna ","useful":0,"cool":0},"py-y-5WLbLbgY2p_d-F9jA":{"text":"Best beignets in NOLA way better than Cafe Du Monde and less wait. Also Du Monde puts way ","useful":0,"cool":0},"5BQ1svOqBfkUkJE-oAftEQ":{"text":"Travelling solo and popped into Cafe Beignet. I was drawn to the live jazz band and that t","useful":0,"cool":0},"EHN2h-QBvluNrgPsG4kU0A":{"text":"This cafe looks s such a disappointment! With all of that great ambience, good location, a","useful":1,"cool":0},"4dvFq9NV1atVppaeP9YhXg":{"text":"This is the main shop - with a sister cafe on Royal Street. I like the Royal Street neighb","useful":0,"cool":0},"egsifn7LyRJ79J3vOTLK4g":{"text":"I ordered The Chicken and Sausage gumbo, which I will admit was very flavorful and delicio","useful":2,"cool":1},"sbjDxg3hr2ALUlYVrYej6w":{"text":"We loved the atmosphere of this cafe! The outdoor seating and live music were so charming.","useful":0,"cool":0},"T4DdMsTLbweZ9cF0xDWNow":{"text":"Last year I tried out one Cafe Beignet location, this year I decided to try out this locat","useful":0,"cool":0},"ezc_gvYFCHW2SEOEphYjmA":{"text":"Late night Beignet's at this was place was delish! What a great way to end the evening. Op","useful":0,"cool":0},"BlTOOGdBUKuIpB5StcyOKg":{"text":"I tried beignets. They were soft but you can taste the over-used oil in it. They need to c","useful":0,"cool":0},"pSsCdBKVtO7UxJ_NkquJZA":{"text":"Delicious!!! They had music playing Friday morning as you sit in the courtyard enjoying yo","useful":0,"cool":0},"t73xcZFrQ9gRM_TGp5krDg":{"text":"While I was walking along Bourbon Street, I followed a path of white powder on the ground,","useful":1,"cool":0},"lSv9no2HUamjrhKQcnMH8A":{"text":"Cafe Beignet is a quaint little spot where you can satisfy your breakfast and lunch needs ","useful":2,"cool":0},"zQgQhMVRdXdOv0WQsW5Z-Q":{"text":"I stumbled onto Bourbon St to see what all the hype was about and found this lovely place.","useful":0,"cool":0},"keZze5LnySc8j2jfAP-5zA":{"text":"Went here on a weekend family vacation to New Orleans after my father suggested it.  When ","useful":1,"cool":0},"lUi5nDiwFc3GStcEc4gcEg":{"text":"the grandest in wait staff, fun, attitude and relaxing.  went there usually for breakfast ","useful":0,"cool":0},"VeyZ8S5q0AU9ezOBmtMt9Q":{"text":"I've been to Cafe du Monde and I like the beignet's here better. They have a crisp, golden","useful":0,"cool":0},"i0aArO_sbDiu16im4wdNdw":{"text":"Two words: POWDERED SUGAR. These beignets were different than Cafe du Monde because they w","useful":1,"cool":1},"IN-Th0WNLeJGJxuXb7ySWw":{"text":"Amazing music and great food.  We will be back for sure! Can definately be an addictive tr","useful":0,"cool":0},"8rxr0pedsf3MceqkM6D1FA":{"text":"LOVE this place! Outdoor seating, live music all three times we came here (yep, 3x's in on","useful":0,"cool":0},"A9GG4YpkQsKpVPoRrdwD5w":{"text":"Little cafe by the legends of Jazz park. I stumbled upon this place late one friday night ","useful":0,"cool":0},"Mbt74ID_4PXpltyXF8xcHg":{"text":"Please bypass Cafe Dumont and head here! It is in a rowdy part of the French quarter... Bu","useful":0,"cool":0},"pyEGA3pfyH831id3ccEACA":{"text":"Beautiful missing was playing, so I stopped by and decided to have brunch at this place. N","useful":0,"cool":0},"tF6RCpX9s45fS4tWVrdMkw":{"text":"Love my beignet just a little bit too much powder for my taste I love the set up also it w","useful":0,"cool":0},"UsRWREaUCXZ109tIXJVlbA":{"text":"I've visited Cafe Beignet twice, and on both occasions, my beignets were undercooked and d","useful":0,"cool":0},"aZyW2kr7KaF5oZzYnDoEeQ":{"text":"First breakfast spot when coming into town. You can never go wrong with a beignet, or thre","useful":0,"cool":0},"E1Hk5Y0sdBZURJ0zXiRyTw":{"text":"When my friends are all at the fifth Bourbon Street bar of the early afternoon, and my tol","useful":1,"cool":2},"ujK__hGvSECVQMvVR_qrIw":{"text":"Flew in from DC, dropped the bags off,\nChanged into shorts...\nThen off to the BEST BEIGNET","useful":0,"cool":0},"Ttodra-gVBMplvI8pstL7w":{"text":"I rank this place higher than Cafe Du Monde because of the atmosphere and because they don","useful":1,"cool":0},"x81SQ11K-b2mDWIbzEtjsQ":{"text":"Didn't feel like waiting hours at \"the other place\"\nSo opted for here instead. Arrived to ","useful":0,"cool":0},"tlFkptZspO2P5jL-5UgFtQ":{"text":"Between Café Beignet and Café Du Monde, it's really up to preference. Café Beignet has sli","useful":0,"cool":0},"Dah5w9zYXDHtHSDBP9zHiw":{"text":"Very happy with the food. Came here for my wedding anniversary and I couldn't be happier w","useful":0,"cool":0},"BsT0_xbHC_NrQidpQ--8ug":{"text":"The music was good but honestly the food was so sub par I really wish we had gone somewher","useful":0,"cool":0},"XX6cicaaV8KPrvACJDNK-w":{"text":"I LOVE beignets, and for that, I give this place 3 stars. The beignets are delicious, but ","useful":1,"cool":0},"D8jtC2K3gWf_Yev49DXMkw":{"text":"Horrible service!!!!!   Overpriced!!  When we finally got our food 30 minutes later and af","useful":0,"cool":0},"4_RMn8hiqNanotBSe9UBrA":{"text":"I have been to both locations. Both times I had Beignets (of course!) and they were delici","useful":0,"cool":0},"CbX90WcVVaz4Gr45Awf70Q":{"text":"This is definitely the perfect place to end your wild night on Bourbon St. After having dr","useful":0,"cool":0},"Wu0gr-xFyjUtxBPzTKqWQA":{"text":"Ok I know this is a classic but honestly not the best beignets. We waited forever for our ","useful":0,"cool":0},"BhteE1z_HwdXMeaKbY6v5g":{"text":"I love the open air vibe of this location. I've been to the Royal St. Location as well, th","useful":10,"cool":11},"hYbA4logn-q4ZsXXlfPbJA":{"text":"Wayyyy better than cafe dumonde. Plus the live music and drinks, amazing atmosphere. I act","useful":0,"cool":0},"c5Y_BmwslAj6ZygbpJr9bA":{"text":"Stopped by here because a band was playing music, and we needed a break. Music was great, ","useful":0,"cool":0},"BMr-s08vHq_D1fa0IAbHGw":{"text":"Good atmosphere, but our beignets were rock hard, and the batter was a little more sour th","useful":0,"cool":0},"WTRfguxzUaPgw7ECzaemlw":{"text":"This is a nice morning stop in the French Quarter. It's a recessed courtyard with a small ","useful":1,"cool":1},"lk7s5XFOPMrPhcntcH8iHg":{"text":"On a nice warm day this is the spot to be! The atmosphere was just delightful, enjoying th","useful":0,"cool":0},"FzIuFspVyT4JXrW3-ZqnEQ":{"text":"I love them! Beignets are one of my most favorite things in the world to eat. This spot ha","useful":1,"cool":2},"AkOHr_aJmyGeJZwx51LCbw":{"text":"Horrible food quality. $4 for stale hot water that you call coffee. It's gross. The beigne","useful":0,"cool":0},"4qv1iqW55gfxZcB8791zcw":{"text":"Amazing place!!!\n\nReally good live music that was playing at 8 am.  Excellent food. \n\nOrde","useful":1,"cool":0},"wu3KMZapkvr46t9JrtJ5wg":{"text":"A go-to stop when visiting New Orleans, Great service and amazing beignets for breakfast (","useful":0,"cool":0},"Qy5d4_8l_r-QeXasJFtL1w":{"text":"This Cafe Beignet location is a really cool spot on Bourbon Street. I'm a fan of live musi","useful":0,"cool":0},"wU_Paif2TePepkQpHESLow":{"text":"Our first night here and we found some chairs to sit in the courtyard.  Although there wer","useful":4,"cool":2},"8-40Gu_PxnzMy47uhsoHMg":{"text":"Ordered the shrimp po boy. While the shrimp was very well fried and seasoned, I wasn't par","useful":0,"cool":0},"f1D5uNE67qXWCXWAJolGMQ":{"text":"I had the crawfish omelet which was small but delicious.   My dad had an order of 3 beigne","useful":2,"cool":0},"EXLbzxKHjXJ_bPpS0RvsdA":{"text":"Live bands playing here! So awesome! And oh my god, the beignets are to die for!! Don't fo","useful":0,"cool":0},"pcvZsB2KtVlyrKNUqYCVNg":{"text":"Staying at hotel near by. Had lunch and going to relax and listen to some music.\nAs we  we","useful":0,"cool":0},"Fo9aYYqUhcI-sQFGie7m_w":{"text":"5 stars for the ambience( my everyday breakfast joint in nola!). Just looooove the live ja","useful":1,"cool":0},"n-7rnbEcO3DxCXPgZt2oPw":{"text":"Unfortunately, I never got to try their beignets here. However, I hung out here for a few ","useful":1,"cool":1},"8sZcL5RzJYsR9zqipV1ayQ":{"text":"This outdoor venue is located in the Musical Legends Park, where live music is a real trea","useful":0,"cool":0},"r2F-4C1f5DganClbHWBApA":{"text":"Been here years ago (5 years more precisely) and this place has not changed at all. They h","useful":0,"cool":0},"ZhuOp89_1wIDSO19-2ABSA":{"text":"I have to say it. \nHANDS DOWN BEST BEIGNETS.....EVER\nDoughy, good size, and about a half p","useful":4,"cool":3},"XuVFn48jU9U_usnxDgf4ug":{"text":"Their Beignets are so good!  You can't go wrong with fried dough and powdered sugar. We ca","useful":0,"cool":0},"C5Pxo50RNlx_XbF0hQEnaQ":{"text":"I visited this branch of Cafe Beignet on a Tuesday night in December and we had a good tim","useful":0,"cool":0},"C4f8m8hneT26BgmxggH5Dg":{"text":"You can't go wrong with beignets.  I can eat an entire shoe box full of these.  Eat them b","useful":0,"cool":0},"Lg1DctbeUtxU20NSdk6-eA":{"text":"Been here at different hours of the day and have continually been welcomed like they've kn","useful":0,"cool":0},"J2rvFWOtsok7ZtzNdMBM1Q":{"text":"Ate here Lundi Gras morning, the line was very long, out the door (which seemed to be the ","useful":0,"cool":0},"VobUR1zz88UH4kXpCmhzJg":{"text":"Great beignets and Cafe au lait.  Blew Cafe Du Monde out of the water.  They also offer ma","useful":0,"cool":0},"YrcpyqccrXMG87AxjNkSqw":{"text":"Nice place to escape from the Bourbon Street crowd.  Excellent Dixieland Jazz band and bei","useful":0,"cool":0},"LfWW3OF7o94drP46PlXgYg":{"text":"Not into the trashy, inebriated side of Bourbon St., so the hubby and I sought respite in ","useful":0,"cool":0},"t6aYnDjI6onyi3Kczux3-g":{"text":"Such a great establishment, but it is really busy. We ordered a shrimp po boy, red beans a","useful":0,"cool":0},"bqdixavhA9TASvuoOxQu2w":{"text":"THE SHORT NITTY GRITTY: did not have a chance to try anything due to  such a long wait. Hi","useful":1,"cool":0},"3aQa5thz_ZPf7hdYndLTZg":{"text":"Great breakfast. Beignets were so delicious, they are dangerous. Went well with andouille ","useful":0,"cool":0},"LXIL5KMnPsK7PHBh10XJ8Q":{"text":"Even though the brochure clearly said 2 for 1 drinks after 3, the bartender denied that th","useful":0,"cool":0},"Eb3POcS7xHxG5zoZMqwC-A":{"text":"I only gave them four stars because of the customer service & the beignets. I had my first","useful":0,"cool":0},"h9G2_BfJ2-E4qckFRIXp1Q":{"text":"We enjoyed this location and the outside seating for brunch twice during the week. There w","useful":0,"cool":0},"NzCXBn016zUmhIJD1cT7Yg":{"text":"They were good. But proly should have ate them when they were warm. We came down here for ","useful":0,"cool":0},"p_mTno71vw52E6kS1BnKzA":{"text":"Beignets are good but nothing to bring me back. You will probably go here as a tourist bei","useful":0,"cool":0},"9OqImd5tqQSqjiOSunTWDA":{"text":"I didn't eat here.  I had drinks and listened to music.  Both were good.  Only reason it's","useful":0,"cool":0},"ppSGauZ2jCz7tTEmYDgBQw":{"text":"The crawfish omelette and jumbalaya hash weren't good. Beignets were good though, and coff","useful":0,"cool":0},"AhURaM0ghs6J9IdyB_FmTQ":{"text":"Great place.  You come in the morning for breakfast (I recommend crawfish omelette, with h","useful":0,"cool":0},"PR6jQ5mGizBNWB85jXlXjg":{"text":"I loved the nightlife. We came here because I felt before I left New Orleans, I NEEDED a B","useful":0,"cool":0},"8gXwDzK_U3CgetrFAe05fg":{"text":"Beautiful scenery and great music.  I had the jumbalaya, which was sooooo good.  Service w","useful":0,"cool":0},"tEKXFzngb91I148lLPOm0g":{"text":"Great music in a Sunday morning. Not fancy but sweet ambiance and music. Perfect for a rel","useful":0,"cool":0},"mejzOO-GtmGjyF2dAo2_fw":{"text":"We had coffee and enjoyed the live music.  Perfect atmosphere to enjoy evening coffee.  Th","useful":0,"cool":0},"M0A8bdTdw_elPmudVRxpZg":{"text":"This was my first time to stop here at this outdoor restaurant/bar with live music. The we","useful":10,"cool":10},"AFkwGgCNIblBimWNgbGJvQ":{"text":"We went to Cafe du Monde on Sunday and Cafe Beignet the following morning, and Cafe Beigne","useful":1,"cool":1},"PlnU1qKW1JQtfe0QqI7dRA":{"text":"It's simple but delicious. Hot beignets with hot coffee is hard to beat. We also had cajun","useful":0,"cool":0},"MfjP4npsZh0eDMK_Gi36rA":{"text":"Must admit I like the beignets here better than Cafe Du Monde, especially if you let the s","useful":0,"cool":0},"tFBxVLCkVPt2IrSZjHFwcg":{"text":"holy schmokes the beignets are good!\n\ni came here for breakfast -- ordered the cafe au lai","useful":0,"cool":0},"r4fy-SZXbfY9px7R5wBVqw":{"text":"Awesome place!! Best Beignets I've had.   Prefer the outdoor patio larger location on Bour","useful":0,"cool":0},"tcoVVS-BdLgiV1llLGkFVA":{"text":"Nice authentic place. Very tasty Beignet.  Good coffee. Very crowded.  If in New Orleans f","useful":0,"cool":0},"arVgmrBhN00kVj0lsiJ5KQ":{"text":"Beignets were fresh and hot and delicious. Good variety of coffee drinks and food. Gumbo w","useful":0,"cool":0},"0Vq0rZs-Q1uI8CxKxb-MNQ":{"text":"The beignets were light, crispy and sweet without the crowd.  Throughly enjoyed these over","useful":0,"cool":0},"7AuTFeJYIH5b6eo7qS10uA":{"text":"I love the atmosphere. The live band was fantastic.  This place is open and airy and enjoy","useful":0,"cool":0},"74o7xJSMRE7a7AFx2WA-wQ":{"text":"Treating yourself to an order of beignets is completely normal. Ordering two on separate o","useful":2,"cool":0},"hMvbcjHR7arW_PWr5Z6Qtg":{"text":"Stopped at this place right off Bourbon St while just doing a stroll for a good spot for b","useful":2,"cool":0},"e5jUAQxiItcbcIgvLBIgKw":{"text":"At my dismay to having to withdraw cash at Cafe Du Monde, I was happy to find Cafe Beignet","useful":1,"cool":1},"h9p3Pf6wvHGBzN8q72bduQ":{"text":"Love, love, love this place! Can't wait to go back. It was early February, before any fear","useful":0,"cool":1},"hp4goA177VNWMHhoeWQ33w":{"text":"Like many others, we visited after dinner for some Beignets.  They're pretty cheap - like ","useful":0,"cool":0},"Y1uLju1pgb8oq52C_rCWWw":{"text":"Right by The Hotel Mazarin, I didn't even want to try the beignets at Cafe Du Monde after ","useful":0,"cool":0},"DDvn_7Xc3IVDo8M1418s3w":{"text":"I stopped by for brunch this past weekend.  The restuarant is located at the back of Music","useful":0,"cool":0},"fp9eXZzKAHme9Y3RGnJM-g":{"text":"mmmm the beignets here are PERFECT! The Jambalaya wasn't perfect, but the beignets made it","useful":0,"cool":1},"B5EhaBDGZBxWlXUFNHpFJw":{"text":"Food ok need to order from counter, very good live music but service need to be worked on.","useful":1,"cool":0},"mvXb3IcODPiF84NfgGcx2w":{"text":"There are 3 (I think) Cafe Beignets in the French Quarter alone, so don't get confused as ","useful":1,"cool":0},"tRgjoGTkbLBlj6HoZIJKag":{"text":"Lots of seating in the courtyard. The staff isn't that nice, a touch on the condescending ","useful":2,"cool":0},"NGbz3lRUe5N5IW-MUXXdmg":{"text":"The size of the beignets were perfect. The taste is slightly similar to a funnel cake but ","useful":0,"cool":0},"smAkqXjrKE9X5GzeQLuOmw":{"text":"Dope spot!!\nBreakfast and brunch \nDrinks and live music \nPartially covered with outdoor se","useful":0,"cool":0},"mScQr26aBs-Gm0AvofXqeg":{"text":"Fantastic place to get coffee and beignets. The ambiance is fantastic while l just enjoyed","useful":0,"cool":0},"EVyDzcmGuiUWKVENmdtXdQ":{"text":"Very French. I love the setup of the quaint café. The food was good. I would recommend thi","useful":0,"cool":1},"dSezeNyBtVUOX3rmfLtBRw":{"text":"As a Californian who has only had one beignet from Rubys Diner prior to my NOLA visit, I d","useful":2,"cool":0},"6XR7V8ahQ6FZfZzWYlnZAw":{"text":"Everybody raves about Cafe du Monde but this humble little gem served beignets that are  j","useful":0,"cool":0},"RI9Hj2eKSo2_5Dmfk-PYiw":{"text":"My beignets weren't cooked all the way through, I bit into a yucky, gummy mess.  No thanks","useful":0,"cool":0},"Cg-Mo513yRploP9xINqcTA":{"text":"Not as good as Cafe du Monde (they tasted a bit sour.. sourdoughy?), but they have a nice ","useful":0,"cool":0},"V-E7SPPWxRUUPmRwM9BNyw":{"text":"Beignets were deliciously fresh and plump! Love this place. Very packed when the music get","useful":0,"cool":0},"JHCF67ASYfxZwQRzTR1NSQ":{"text":"Great spot! Open patio seating and live music. The beignets were the bomb. Highly recommen","useful":0,"cool":0},"Q1n3TcE4DLigbOTNw80mvA":{"text":"Nice ambience, but food was mediocre. There was no true flavor of Cajun, thus was pretty b","useful":0,"cool":0},"wdNNc5FIdkXl-QA67EYaUQ":{"text":"This place probably wouldn't exist without beignets, and even those aren't that good. When","useful":0,"cool":0},"fIi7sQVNgerq7twJpri_5Q":{"text":"Hands down, their beignets are way better than Cafe Du Monde. Buttery and textural crisp o","useful":0,"cool":0},"_R5CcUqWdGL4zJDROpZB0Q":{"text":"First and definitely the last time I will ever visit this place!!!  I came here for the ja","useful":0,"cool":0},"6AHERSwACkq7owScH3rJ_g":{"text":"My friend and I were visiting from Houston because we was attending the Bayou Classic, whi","useful":1,"cool":0},"5pIbbkRm6Azg8wCci1j4Ag":{"text":"First of all want to start by saying how rude some of the staff were. The person at the ca","useful":0,"cool":0},"pqSbqaShBEpRMVd4vpbsOg":{"text":"The Best of the Best Beignet's I've ever had!\n\nWas here for a New Orleans Saints Game back","useful":0,"cool":0},"9uiwBxSnvvLr7JwL0jExww":{"text":"I prefer the beignets here over its much more famous competitor. The beignets are fluffy a","useful":13,"cool":15},"9ZNKjnFdReCbkmSpHhR58g":{"text":"I had a bad experience here yesterday. \n\nThe lady at register was rude and had the worst c","useful":1,"cool":0},"7eJ83VhIZpBtNDucz7F46g":{"text":"Adorable cafe makes you feel like you're in France. Breakfast is so yummy! My husband and ","useful":0,"cool":0},"CqJAzFx5LBvmKL48WoL7sg":{"text":"If you want a cold cafeteria style breakfast come here. Garbage customer service places li","useful":1,"cool":0},"YDvSfmF9t--zpNQZTi1h3Q":{"text":"This was another famous beignet stop we had to make on our trip to New Orleans. This was a","useful":0,"cool":0},"ok36Zog98KxjEWklr23kPg":{"text":"Who can resist deep fried pieces of dough, sprinkled with mounds of powder sugar? \n\nThe be","useful":7,"cool":5},"7ecOhImAsCQjGiujGWgGrg":{"text":"Love this place. Don't be fooled by Cafe Du Monde. Don't get me wrong they're good there t","useful":1,"cool":0},"_AoOrO2tZHgwJ7cvPx_E6A":{"text":"Super great place, love the music and the coffee was to die for!!! The French toast was am","useful":0,"cool":0},"wE6a-CCvnNVb6GN5mWLwiA":{"text":"Came here on the Saturday during the Mardi Gras celebration and this place was moderately ","useful":1,"cool":1},"is6tSEiEVK1oDEntHvGe-w":{"text":"Beignets are fine but beware of the omelets - more like a folded scramble with only minima","useful":0,"cool":0},"i7qV1LTfKvur5juSrqaNyw":{"text":"I heard great Jazz music and just started walking towards it.  There I found an amazing co","useful":0,"cool":0},"wtFwDbI1kzNyTCj6-P7Pjw":{"text":"The best place to have Beignets. Clean and nice jazz.\nI will be back for more next time in","useful":1,"cool":1},"BIqdIIlN9QRmaUbrMXe1gA":{"text":"After a nice meal, walk over to cafe beignet and enjoy a nice plate of beignet covered wit","useful":0,"cool":0},"6xcvKZM2Iv0ZyjsCQur4Hg":{"text":"I came here for lunch and was torn on what to go for but decided on the jambalaya. It was ","useful":1,"cool":1},"TTwqYuNDsYnig3tbnX3Glw":{"text":"Staying across street at Royal Sonesta, ran over for quick bite.  Royal Croissant lettuce ","useful":0,"cool":0},"bha2puZZQgxfNJS14u09PA":{"text":"Amazing time here the other day. After a few drinks on Bourbon street the misses and I dec","useful":0,"cool":0},"_YGfYz06yLPkChOXK46sqQ":{"text":"This place has a beautiful courtyard area where you can sit down to eat. They also have a ","useful":0,"cool":1},"nZ0b2JR1CJ26YgHGknuS4Q":{"text":"Cozy spot in a little square with live jazz and plenty of fans to keep you cool. Had break","useful":0,"cool":0},"fTbFJj79UK4q2JQGLrA3fw":{"text":"Cafe Beignet \n\nFirst night in New Orleans and walking down Bourbon Street, we walk by Cage","useful":1,"cool":0},"cLedKHV-XpEU-ZrF-HLspQ":{"text":"If there wasn't music at this place there would literally be no reason to go. The beignets","useful":0,"cool":0},"LK2nQ5Wb-XF2WVboDp58Hg":{"text":"Everything is pre-made and soggy.  Gross.  Won't come here again and recommend that you do","useful":0,"cool":0},"s4gk2ZObDAggETazGovQHg":{"text":"Having seen Cafe Beignet on Food Network, I thought to check it out. Going to the one on B","useful":0,"cool":0},"SmS0J5fhu2pqGC9LdTrlNQ":{"text":"The best live music with Steamboat Willie at Cafe Beignet. He plays 7pm to midnight daily!","useful":0,"cool":0},"-1b0UFW-gSIlnAVXkLeeug":{"text":"I found Cafe Beignet on my way to brunch at a different establishment but was pulled in by","useful":0,"cool":0},"cF_En_1U8P5PAMKvrBhRgg":{"text":"The best!!!!!!!!!!!!!\n\nBest beignets in the french quarter in my opinion (compared to cafe","useful":1,"cool":0},"Zug8KLTdUruQg-JuXyeiQA":{"text":"They were considerably better than Cafe du Monde!!!\nAll the rave about that place, I feel ","useful":0,"cool":0},"1dHilJv48WPnZ5pI2kUQQQ":{"text":"Not too crowded and the beignets were amazing! A local recommended this place to me vs. Ca","useful":0,"cool":0},"64lqcExI7KnBJrge7zU4-g":{"text":"Good food, great music! We had the beignets, French toast, the jambalaya. Food wasn't the ","useful":0,"cool":0},"oB752OL1X635svcG123kCw":{"text":"I normally love this place. They have great refreshing southern comfort mango smoothies, t","useful":0,"cool":0},"pF7XawjDN-VOe8uHUNac1Q":{"text":"Best beignets ever!!! They were super super soft and fluffy!!! I've had them before at oth","useful":0,"cool":0},"_AN3BiB5PO3-Q2Cpetal9Q":{"text":"Pretty cool the powder from these beignets goes everywhere so don't where black clothes wh","useful":0,"cool":0},"9mMOC7ExG0OC4K87NjHCTA":{"text":"The beignets are ok-- crispy, square and sort of flat. The flavor is ok and they came out ","useful":0,"cool":0},"njt3KB06mCjgyaHZTcwy8Q":{"text":"Great beignets and fabulous music. You can have a coffee or a daiquiri while enjoying the ","useful":0,"cool":0},"mnkBII42Lq8Cr5QfeRWXEA":{"text":"Hot fresh beignets. Made to order. Prefect amount of sugar and it just makes your taste bu","useful":0,"cool":0},"1rp1zoFCh4glxGYd5B25Qg":{"text":"OMG! Of the 3 Cafe Beignet locations in the French Quarter this by far is the fastest! Sup","useful":0,"cool":0},"ViMbGrRlgpRdZg1-J-DlIA":{"text":"This place was a great find and helped make our trip to New Orleans and Bourbon Street mor","useful":7,"cool":5},"vbRbghFaD76VI9wvw4ZPDg":{"text":"I prefer this place 100 times more than Cafe Du Monde. Better service and very friendly st","useful":0,"cool":0},"mKBRdyT3f3CtEHiBbC831Q":{"text":"I'm convinced that you cannot go wrong with either Cafe Beignet location in the French Qua","useful":0,"cool":0},"IEu78vik08Onltf1Xd-gdA":{"text":"Awesome beniets. Great price too. They were fresh, hot and delicious. Will be on my to ret","useful":0,"cool":0},"XJ3PjrtF4Lq18HwYJxxHeQ":{"text":"Love the cute dining area, great light fluffy beignets, and great jazz band during brunch ","useful":0,"cool":0},"Mtkl_pizeFYJa2te1jYIiA":{"text":"I love that you can eat on an outdoor patio with live music. Wish the food was better. Got","useful":0,"cool":0},"E8mEwj47wuskvEDn_tJJyg":{"text":"Love the vibe of this place, it's a hidden gem on Bourbon Street.  Family friendly, live m","useful":1,"cool":0},"U_EdrSek0jO6fps0hQTImA":{"text":"I ate beignets both here and at Cafe du Monde multiple times during my trip, and I prefer ","useful":0,"cool":0},"Yl3K_fNOwC0TDV-fyejFMw":{"text":"Great alternative to Cafe Du Monde. I went here twice during my visit and both times was a","useful":0,"cool":0},"bG4oaNl50kcUiM_vxgIawA":{"text":"Now watch me whip, watch me beignet nae. I've been to Cafe Beignet's other location on Roy","useful":2,"cool":2},"5QE1fdEhvCVm3zpFVCSJLQ":{"text":"I have to say in my own opinion these  beignets are better than Cafe du monde. They also h","useful":0,"cool":0},"hzIU2rXo_GURWn7QBRfTUA":{"text":"The eternal struggle between Cafe Beignet and Cafe du Monde.  The BF and I like Cafe Beign","useful":1,"cool":1},"4RujDqw-CWWvfs0CjbLXxw":{"text":"As soon as we checked into our hotel across the street, we came here to unwind, listen to ","useful":3,"cool":3},"O-l0Qhtuor3DRXzPZO_pVw":{"text":"The beignets were everything a good beignet should be - crispy on the outside, soft on the","useful":0,"cool":0},"vcuXxbz94fe1iHj2sOdLRg":{"text":"Not as good as expected. The hot chocolate was bomb but the beignets were just ok. I prefe","useful":0,"cool":0},"8PqdEqeIIBVEI_Lp4OzE5w":{"text":"Best beignets and the first I ever had a trip to the french quarter isnt complet without h","useful":0,"cool":0},"e1mDhBiwzqHmDO5cKWitcA":{"text":"Waaaayyyy better beignets than cafe du monde, coffee is not good tho... take your touristy","useful":0,"cool":0},"leis5MVP_-_GNRDPmoG6rw":{"text":"Love this place.  So cute.  Very good beignets and not a scene like other places and the c","useful":0,"cool":0},"iTQfsDbYQcazR3Kwv8ZS-w":{"text":"Food was fine, but not spectacular. Beignets were great! 3 to an order... Wish we would ha","useful":0,"cool":0},"uKIm_dmnpdASlSny2cvKOA":{"text":"Been back a few times now beautiful spot almost forget your on bourbon st. My husband like","useful":0,"cool":0},"ppuD6VhAhMbsqct0O-jM1Q":{"text":"Great beignets! Very light texture-perfect. Cafe Du Monde has very good beignets also-I li","useful":0,"cool":0},"Qlfua7U94nus1yV636ZwIQ":{"text":"Went there with my friend and it was a mess.The restaurant is very understaffed. The worke","useful":0,"cool":0},"fsbcl_oWrEY9UsuBq88JNw":{"text":"A great stop for a quick snack. The live band sounded awesome. This was a great choice for","useful":0,"cool":0},"QdJok2zGsuZ3lboSk8JEEg":{"text":"Great food, great music, and great atmosphere. Was on vacation in New Orleans and came bac","useful":0,"cool":0},"wiormJid7HnS3v76Un9j0A":{"text":"Cozy courtyard with jazz filling the air. Coffee was well made and beignets good though a ","useful":0,"cool":0},"eVZ3018QGuKMExtxD6Lohg":{"text":"So this is my second visit to New Orleans, and I've been to a lot of the must go places. A","useful":3,"cool":2},"GWbBi-yQw8_qZLxLw9Le_g":{"text":"This café is in the courtyard where there's usually live music playing. The atmosphere is ","useful":0,"cool":0},"DqsP85wQKRSRzstcSNJn_Q":{"text":"One of the places I like to sit and enjoy my beignets at.  They always have live music pla","useful":1,"cool":0},"984fpEwoekJ0cddQbl96JQ":{"text":"The line moved fast. It wasn't hard to find a seat, and the food was yummy. It was our fir","useful":0,"cool":0},"5AzcQhLWv6DZeyVi0WHSJA":{"text":"Great outdoor place to stop and listen to some music while having a sweet treat.   The pla","useful":1,"cool":1},"LHaVicZKwrxNXbPDo1P1nA":{"text":"You cannot beat the prices! The place was great and if you can eat less than 3, you aren't","useful":0,"cool":0},"wceOxB2Wmf2jBz-lKT6f7g":{"text":"AWESOME Beignets! Awesome Cafe Au Lait!\nWe tried Cafe Du Monde our first morning...blah! W","useful":0,"cool":0},"E0m7l9gCpQQL2Wvs_Qkq_Q":{"text":"Worst place I've ever been, nasty customer service. And would NEVER go back. They wanted t","useful":0,"cool":0},"Qf4vvOBwYcVWvyqkexuyNw":{"text":"Was driving through New Orleans and decided to stop for lunch. And of course after lunch w","useful":8,"cool":9},"wbn8PlSBQF0FY_UbuIURJQ":{"text":"This is not my first time visiting this establishment. It's small with limited seating are","useful":0,"cool":1},"-nQW1z8vomxV2HAOLUyDWA":{"text":"Our first beignets in New Orleans.  Order and pay at the counter.  They were not sweet eno","useful":0,"cool":0},"HG6lhyoN8q-ka-dGeYowiQ":{"text":"The atmosphere and the bar was amazing! The frozen drinks were delicious and the bartender","useful":0,"cool":0},"bnOLomt5dJPnWP7_UxBgog":{"text":"The line was very deceiving. Fast service. Easy to get a table. The roast beef po boy was ","useful":0,"cool":0},"8xS6w6hH9XuN24Jj15OesA":{"text":"Cafe beignet is a nice way to start your day in the French quarter of New Orleans. You won","useful":0,"cool":0},"--p52hiNDSkDmYoIkbquhw":{"text":"Great beignets, better than du monte in my opinion, great music. We also got drinks and a ","useful":0,"cool":0},"_eBS5Kt5Y31jGR4pu7cgcQ":{"text":"I haven't had a beignet before Cafe Beignet but I have to say I don't know how it could ge","useful":0,"cool":0},"VHAaWsNOMDmN6eevQma_IQ":{"text":"I was really excited to come here because it was recommended to me. Unfortunately I ended ","useful":0,"cool":0},"kZ6230FaDbUdXpqtnhriBw":{"text":"Yum, yum, yum!!! The quality of beignets exceeded my expectations.  These were significant","useful":0,"cool":0},"cvEqWwzg2VNKfYSg-42k4Q":{"text":"Went there on a sunny Saturday afternoon. Pretty good atmosphere with a good band playing ","useful":0,"cool":0},"BQKeSF4jL_QtNONIXz0E2A":{"text":"I mean, if you're visiting NOLA you need to try Cafe Beignet if not you haven't experience","useful":0,"cool":0},"Av5mqncbVjKs4SR_czKK2Q":{"text":"Best Beignets!! They were awesome! We came here yesterday and tried their beignets, they w","useful":0,"cool":1},"RAEJ5lPUcxD7XkZnT9hE0Q":{"text":"Three stars for the beignets and the atmosphere. \n\nStopped in mid morning.  Short line, fr","useful":0,"cool":0},"Tk2hDwYT4ASlFAx7eD3ogg":{"text":"If you come here first, Cafe Du Monde will seem like a small crowded cafe that only serves","useful":1,"cool":0},"dO0mmc3v08v2p4VH80QiFQ":{"text":"We came here a couple times for beignets because of their outdoor dining with the live ban","useful":0,"cool":0},"a9RF9rQjuodiBdfrmAnA-g":{"text":"Highly disappointed with this place. The beignets tasted old and heavy as opposed to Cafe ","useful":0,"cool":0},"wCIv_osB7h-a74NQ-D5kYQ":{"text":"Basic but cute.  Food was average as were drinks.  Nothing bad to stay and we did go back ","useful":0,"cool":0},"eOETfZwdc8AY4wPWDFM5zQ":{"text":"Beignets and coffee we're excellent. Husband's breakfast sandwich amazing. Can't n hash br","useful":0,"cool":0},"vrImBqjhfZv74pot6oBv0A":{"text":"Can't speak for the beignets, but really enjoyed the live jazz music in the park and the r","useful":2,"cool":0},"TAL8-KOYQ4kSgiIMrTSIWw":{"text":"Four stars overall but five stars for delicious beignets:) The line was only about 10 cust","useful":2,"cool":1},"Ag-q_AYyFFr6zozUxcRyjQ":{"text":"While on my first NO trip everyone had their suggestions of where I had to have the best b","useful":1,"cool":0},"3UrbZ71F7pfW5VcXfFrgfg":{"text":"This place was a waste of my stomach space and calories. There wasn't any flavor to the fo","useful":0,"cool":0},"rDQTmmTteWCYZYuWcpwP4A":{"text":"I get it, New orleans is a little slower and these women were really sweet- but they are s","useful":0,"cool":0},"neMBsJE44vCbVziX-bJjTQ":{"text":"I thought these beignet was better than Café De Monde, but people seem to have the concept","useful":0,"cool":0},"gPwfFZeT2I8Wv7u77c_IcA":{"text":"Went to be able to compare to Cafe Du Monde and this place was delicious, but I felt like ","useful":0,"cool":0},"TKIl-TWc2GJPB8z9M2Yi4Q":{"text":"Not my favorite. The food is just okay. I guess if you need a quick drink and a chance to ","useful":0,"cool":0},"Uy_FglO8Wf9AdryUtVYJMw":{"text":"The beignets at Cafe Beignet are just what you were thinking of when you thought of New Or","useful":3,"cool":2},"BnY1sDjQqAHqrbRCWqgSZg":{"text":"Worst food ever!  My friend and I ordered Shrimp Po Boy and it was dry and unappetizing!  ","useful":2,"cool":1},"GeOHed5jR81P3UmliExZLw":{"text":"This is a must try if you are in the French quarter. Everything is amazing while there is ","useful":0,"cool":0},"iKsosJltZokwP0T2WPHlsA":{"text":"Dripping with tourists, seemingly mostly from England today, but enjoyable due to live jaz","useful":0,"cool":0},"ykkIEHxqSXXI_6fVWMEkbg":{"text":"Stopped by here the first day we arrived to New Orleans.  For $2 something we got three la","useful":0,"cool":0},"eAxewUgo5x8zzNgxHdw2Sg":{"text":"Live music at night. One of the more relaxed and family friendly places with live music an","useful":0,"cool":0},"IyVriVUy8-NZnEPGocX0QQ":{"text":"They have every food you need to try in New Orleans - gumbo, jambalaya, and sandwiches wit","useful":0,"cool":0},"A4VGD3fjEU5EwQaz2a0qig":{"text":"I wanted to experience a great beignet & I got to.\nIm telling you, the couple of beignets ","useful":0,"cool":0},"I74aCNlv1Ck-PPSib6eh0g":{"text":"Great atmosphere as live music was playing. The lines were very long and only 1 person wor","useful":0,"cool":0},"krvdX6nDe9IHeMIt42qEXQ":{"text":"Great ambiance. Good food. Live entertainment. \n\nDrink alcohol straight or get cocktails. ","useful":1,"cool":1},"wnx6qjgAQyHL8MsnCuIBvw":{"text":"My friend and I went looking for a nice spot to have some drinks.  The outside patio is co","useful":0,"cool":0},"5vA5ufssImUhQjQ_VGjBBg":{"text":"Best place on Bourbon for outdoor seating. Music was great even with all the Mardi Gras cr","useful":0,"cool":0},"kZnlVRZyVsjFMrIslVnTgA":{"text":"Great spot to grab a quick breakfast and Hot fresh Beignet before heading out sightseeing.","useful":0,"cool":0},"Mypzxwj0NV6C3X_YdNX1mA":{"text":"Beignet was under cook and margarita was water down. Service and live music made up for go","useful":0,"cool":0},"prx7luSDwuDwXtXqsZDHGw":{"text":"Jazz & beignets can it get any better?  Very nice outdoor venue.  We popped in and grabbed","useful":1,"cool":1},"TflpzcK9xl8gkK79SmMejw":{"text":"Went for breakfast. The setting was cool with a live jazz band. Open seating and order you","useful":0,"cool":0},"mEZwux-B905FkGF10mVxCg":{"text":"We were really craving some beignets after walking around town last night and we stumbled ","useful":0,"cool":0},"qfLKJ8gnu26Da6YTRq4yVw":{"text":"My friend and I ordered food. I then went to grab us a beer (date March 13th at 5:30pm) th","useful":0,"cool":0},"gjpJIaPJQx-d4XbOzYKanw":{"text":"Found this place within minutes of exploring Bourbon Street upon arriving in New Orleans. ","useful":0,"cool":0},"QveXGAY8dNPcySDYBfAVVQ":{"text":"Large was the ONLY plus! They were HARD and extremely dense! Nothing like the beignets I'v","useful":0,"cool":0},"MJ71J0Vk1mhKy5bf6fnQJQ":{"text":"Haha, tourist trap but you gotta do it. Being vegan, I can't eat the beignets but the rest","useful":0,"cool":0},"zNYthIXSKZS-7WJXnkDmzQ":{"text":"There was always a line here but it does move quickly. You place your order then the 3 fre","useful":1,"cool":1},"dng0zNlht3KEyjIvsv6O6Q":{"text":"Super cute atmosphere with the open air jazz music & iron bistro tables, but don't come fo","useful":0,"cool":0},"YkjbbQOyeZ1j2JnJle3HiQ":{"text":"AMAZING!!!! Delicious roast beef po'boy, and their beignets... well, let's say their names","useful":0,"cool":0},"gJvc2W_US83CftRmD8t08g":{"text":"Walked over one morning to grab coffee and a beignet. They were jamming! A whole band sing","useful":0,"cool":0},"wD7xO7VWun_RSOhwAmgeIw":{"text":"Only place I found in the French Quarter that offers a veggie burger!  Set in a relaxed co","useful":0,"cool":0},"c9m-y-3UEPgVqNNg2s_iwA":{"text":"Incredibly better than that tourist trap cafe du mond.   This place does not just try to g","useful":6,"cool":5},"8hjqWQGIskM7KXeydv-IKA":{"text":"We had breakfast here on our first morning in town and enjoyed it so much we came back twi","useful":0,"cool":0},"BcitO7o7OSroph_faHRqeQ":{"text":"I was excited to try an authentic beignet, but really it's just kind a like funnel cake. M","useful":0,"cool":0},"D7KLuVDiWwovsQ-mnTAg2A":{"text":"5 stars for the beignets, 3 stars for the other breakfast options. If you've already exper","useful":1,"cool":0},"Nu1WcR3H2OC2Yp6DstoWwQ":{"text":"We went in here for a few drinks and to listen to some music.   It was a great place to ch","useful":0,"cool":0},"t2kt4mzXUlqvDEJYWJ1BCQ":{"text":"Five stars go simply for a breakfast of delicious, powder-packing beignets.  Makes me cons","useful":0,"cool":0},"2TYj19mTukQQ3avdtz2JVQ":{"text":"This area is nice and I like that it's outside, with live music! The beignets were 3 for a","useful":1,"cool":1},"YpXgHJyVw6gvkQFwaZ4fow":{"text":"The beignets are good however I ordered the Cajun hash browns and it was very cold. I brou","useful":0,"cool":0},"gbIuH2Z78jMc6cS-xTez9g":{"text":"I'm guessing because it was so busy, buttt the coffee was amazing a mocha cafe au lait, th","useful":0,"cool":0},"vQ2HxoetYwNjKEv6cgXZQg":{"text":"My boyfriend and I went on a self guided beignet tour and this place was the worst by far!","useful":0,"cool":0},"2TkldcZhbLjjy70RRB0yEg":{"text":"Cafe Beignet is not Cafe Du Monde good but a close second.  Honestly, in the whole Bourbon","useful":2,"cool":2},"C8qfGebFu6x8Dy7VnhOJRg":{"text":"We had breakfast here, the staff seamed annoyed/bored and the food was mediocre at best an","useful":0,"cool":0},"AF4ph1yqYDscq41bRVqUrA":{"text":"Reasonably priced, convenient location and good live music.  The beignets were delicious, ","useful":0,"cool":0},"XzZINcm0qsUAO-sjoaYzWQ":{"text":"Iced cafe au lait was delicious. The beignets were large but nothing special.  I'd go back","useful":0,"cool":0},"2OK5Y7MGkcQ9jtuQmdXkLQ":{"text":"Great cafe to sit and listen to jazz while enjoying a beignet. Try the chicory coffee, it'","useful":0,"cool":0},"34x8S-WXTQqPcvl_pAdf3w":{"text":"The best thing about this place is the live music and the courtyard. Drinks were just aver","useful":0,"cool":0},"sN8YKhs6xIll4Mp-hf75-w":{"text":"Hours are incorrect. We showed up at 9:30 and the gates were closed. Others were outside t","useful":0,"cool":0},"5nAOJwBQqymTG4E7n8PFhA":{"text":"Great little spot - Gumbo is good.  Hood area for music right in the courtyard. Moira is a","useful":0,"cool":0},"7iAEjNSNCEH4cn5vzzlVng":{"text":"Nice outdoor jazz place that provides a nice nostalgic feeling of New Orleans.  Although a","useful":0,"cool":0},"doVx3aZtmG7ujpLHPmKfXQ":{"text":"Fantastic. All we had were the beignets, but they were incredible. Super cute little cafe.","useful":0,"cool":0},"HOBUX5L4znedIx4cjWfAJw":{"text":"Live music was great! \nThankfully there's restrooms. \nExpensive beers, but worth it since ","useful":0,"cool":0},"kHN3Zro86ih7D55Y57A5Yw":{"text":"Stopped here randomly during the day. It wasn't packed at all. I went to the back and orde","useful":1,"cool":0},"J0DuSIAGmgPqfA83sn5qXw":{"text":"Great beignets, wonderful breakfast and live jazz music while we ate... Open air café. So ","useful":0,"cool":0},"m1B4hHTpveqqNvJXho3mNw":{"text":"The grits are awful but the beignets are oversized and delicious. \nMy friend and I had a l","useful":0,"cool":0},"d9ZRNhVCoH03TnTyXr7JBg":{"text":"Let's start with the atmosphere.  Little Jaz band playing feel good music. Good amount of ","useful":2,"cool":1},"AHLZYKsoZBVU68GLx2JCEg":{"text":"If I was judging a great beignet stand-off Cafe beignet would be the winner.  Great beigne","useful":0,"cool":0},"WjM4gtRUWaoK_Fo6bTV4OQ":{"text":"The beignets were good, but not worth the wait. Standing room only, at non peak hours. We ","useful":0,"cool":0},"BVr4ilX-POlm2KjvGpbPiw":{"text":"It always seems to be the age old question, who has the best beignets?  Cafe Beignet does ","useful":1,"cool":0},"p6K_RdHiPrkNXbGFpoE5YQ":{"text":"First stop of the day after arriving to New Orleans. I was going to go to the other Cafe t","useful":0,"cool":0},"AsKwtiGfA7NsnbIM9Ym95Q":{"text":"I had the jambalaya, the taste wasn't bad but it was 95% rice I did find a slice of andoui","useful":0,"cool":0},"9jgZQuVwJJ4ZzcOFVnqOPA":{"text":"The rudest Cashier I've ever met in my life. This was my first time visiting and I will ne","useful":0,"cool":0},"A-4L5ZvLpOSaR3M70hpFWg":{"text":"Came here recently for a weekday lunch and the service was very good and fast! They have s","useful":0,"cool":0},"9I9EF4Yid5zDAljs98uzsw":{"text":"Open 24 hours, we went on a Thursday after 10 and didnt have trouble finding a table. We t","useful":0,"cool":0},"paw_xYY7raULlTufHIy5AQ":{"text":"Love this place. Great food, music and service. Outdoor seating and pet friendly. We loved","useful":0,"cool":0},"1gD0i68Zd2oGOCzSxHF7tw":{"text":"Fantastic place to chill, listen to some jazz and have a sweet snack. Very good beignets a","useful":0,"cool":0},"zTMeMHrCfTvuczH_JIGBWg":{"text":"Super yummy place. First place to stop and eat on our trip. Passed a ton of loud bars and ","useful":0,"cool":0},"yE9-hfqwyEnodAWSODYN2Q":{"text":"If I lived in NOLA, I would find myself sitting here every weekend night right in the cour","useful":3,"cool":3},"EK3yNKFYRY5z5ahbR0bdNA":{"text":"First time in NOLA and I was taken here for coffee and beignets which was pretty delicious","useful":0,"cool":1},"oh1lHyRyYTzz468aK8DSog":{"text":"This little gem I stumbled upon while I was walking down Bourbon Street. The outside court","useful":2,"cool":2},"tLmLpMeQlXlxSDess-r_1A":{"text":"I guess I'm just not a beignet fan.  They didn't do anything for me at all.  My G/F, who h","useful":0,"cool":0},"D09yV0AswWgEIkz8H1OtQA":{"text":"Came here for a quick stop just for Beignets. BETTER THAN CAFE DU MONDE (more crisp on the","useful":1,"cool":0},"60TYeEqDSYYYbcsQbcAtQg":{"text":"Great beignets - no other way to phrase it. Hot, soft, and so very good. Wish they would o","useful":1,"cool":0},"j94CuYDf_U6QSJeSsuuOdQ":{"text":"If zero stars were an option, I would have selected it. \nThe food was terrible. Ordered a ","useful":0,"cool":0},"ABfkhGddyBGVVwH7yPR_gw":{"text":"Cafe Beignet wins out over Cafe Du Monde!  Our family tried the beignet's at both places a","useful":0,"cool":0},"N44M-ITY9FHcMvobvvXVag":{"text":"This place is a joke. Got a shrimp po boy and it came without sauce, toppings, and the bre","useful":0,"cool":0},"gD-8eMYduWSO-nFj4CzbXA":{"text":"This is a great little courtyard off of Bourbon Street. Given that the gates are cast iron","useful":0,"cool":0},"Kda6XPDnJiOqR7ZIPvqhog":{"text":"SO GOOD. Light and fluffy, crispy!\n\nMy friends and I like this place better in comparison ","useful":1,"cool":1},"j0wr2WuohaBAG078npqtxw":{"text":"We enjoyed the food & atmosphere here! The live jazz was nice. We tried the gumbo, jambala","useful":0,"cool":0},"PUlC5w5HCQFCW8nmcrVbug":{"text":"Came here for coffee and they said they have no milk, the people in line with me were all ","useful":0,"cool":0},"HEBPbUwVIvUGQr0HstLM8Q":{"text":"I think this place has  awesome  atmosphere, they have live music,the margaritas not so gr","useful":0,"cool":0},"NeKuUM0oWO4rGOOvlO9sVA":{"text":"This place has the best atmosphere. Sax player and singer, amazingly hot beignets and very","useful":0,"cool":0},"L5z9TODXOfTVmcnguAm0rQ":{"text":"First time ever having a homemade beignet... absolutely loved each bite along with the che","useful":0,"cool":1},"pjwJQUnatFY5cypypKvhMA":{"text":"The beignets I got were still undercooked and doughy inside, not light and fluffy like I w","useful":0,"cool":1},"kATM-vxLccE77RDO8sfHvg":{"text":"Live music at night was fantastic and overall great vibes. The food, however, subpar. We g","useful":0,"cool":0},"NhHX6I4onxqikCLbVH79KQ":{"text":"Terrible service terrible food and at a terrible price. The two PIeces of fish was the siz","useful":0,"cool":0},"5OdrT3y2SecfAh5_TKrB2w":{"text":"Cafe Beignet is a chain cafe located throughout NOLA downtown. This was also my first stop","useful":3,"cool":2},"r612tWit5iQ6yCGZCHI7KA":{"text":"The beignets are good .. fluffy . A little doughy . \nThe coffee tasted really good and I l","useful":0,"cool":0},"Z25XVhhwl3CTJbRWp-BcTw":{"text":"Very much enjoyed my recent trip to New Orleans and my regular visit to Cafe Beignet. I go","useful":0,"cool":0},"VmsmxzceImHi0TrLch2OuQ":{"text":"Pros: amazing beignets, cafe au lait, and live jazz\n\nCons: literally the worst breakfast d","useful":0,"cool":1},"KtfA9aQDrXDoLJC2bVu4vA":{"text":"We love this place. Live jazz music,water fountain, sparows to watch, great food. 1 compla","useful":0,"cool":0},"TEx0Sx6zngElPboZUEoy0A":{"text":"This was probably my most memorable evening in New Orleans.. with cafe au lait, beignet's ","useful":0,"cool":0},"6mmq6QhXppkqqVjA8ao5oA":{"text":"Good fresh beignets ice coffee good  nice open air location  good service  nice atmosphere","useful":0,"cool":0},"svf4ksavHAqPB_QnUtFI8g":{"text":"I had such a great time here listening to the live music, drinking coffee and eating beign","useful":0,"cool":0},"bySJTP-KFxiwFzFLPGfgyg":{"text":"Great experience for my first time in New Orleans. Had the Po-Boy and Beignets. They were ","useful":0,"cool":0},"6KCcrj-iK_YfDwHoS6qQGA":{"text":"Cafe Beignet vs Cafe du Monde for battle of the beignets!\nIn our experience, Cafe Beignet ","useful":4,"cool":4},"ntBvvFVgoUMcg-UFyqZZkA":{"text":"Overpriced\n\nWe ordered beignets and carrot cake. The carrot cake was really overpriced, fo","useful":1,"cool":1},"g1ClCbg3xlJYaQhUbToQDw":{"text":"Went for breakfast and it's like they didn't even try. I had the crawfish omelet plate. It","useful":0,"cool":0},"KjrS2yS0sazSWkI4OaX2wA":{"text":"Fantastic beignets, a super cute outdoor location with great live music. Took a star off b","useful":1,"cool":1},"008tyzV7WWUlEk3a_cyKpQ":{"text":"This is the worst food that I've eaten on this trip. The food was cold and needed salt. Th","useful":0,"cool":0},"_zHgj1AIc8Dalxp8nvzRgw":{"text":"The beignets I got were still undercooked and doughy inside, not light and fluffy like I w","useful":0,"cool":0},"vC7yLbTkMA2uDP7oMep85w":{"text":"We went to two locations​ of Cafe Beignet; Bourbon Street​ and Decatur Street. Both locati","useful":0,"cool":0},"asQBd7OzGRiAqy3fvMWVYg":{"text":"I will say this place has a great atmosphere along with coffee, lemonade, beignets and liv","useful":0,"cool":0},"PmLYbay2Z7kQPcNjTi8UBQ":{"text":"Decided to give this place a chance even though theresa lot of bad reviews, and I should'v","useful":0,"cool":0},"6J2PeOrEZnIiXwtq-y_Y8g":{"text":"I had my first beignets here, and so enjoyed the patio area. On a Friday night when the Fr","useful":0,"cool":0},"jkJxq7i-KZFkVYM5yvV_Eg":{"text":"Better atmosphere than breakfast food. While they had a decent menu for breakfast, the ome","useful":0,"cool":0},"OGFxMN6kBi3OBMt0zvuscQ":{"text":"Love love LOVE. These beignets are some of the best in the city, and the location is absol","useful":1,"cool":0},"I48nqlTFVOlycR0XqpwhgA":{"text":"Great beignets and lots of fun. Best place to enjoy it all when it rains. The band was won","useful":0,"cool":0},"z58fiBFMEGTE9i5Q3DaK6Q":{"text":"Loved this place!! It was pretty fast order since so many people were in there. Got a quic","useful":0,"cool":0},"wYDL59D5RsIL_W7UNfAHWQ":{"text":"4 stars only because the beignets were worth it. Tight building with a long slow line to p","useful":0,"cool":0},"rB4rQ_ZxCIu6lAx-AYPMUA":{"text":"I didn't love Cafe Du Monde so I wanted to give Cafe Beignet a try. However, I have to say","useful":2,"cool":1},"fnuyfym1K3xFU97kXQZ5xg":{"text":"With the current situation it's been really difficult for places to survive. I am sure thi","useful":1,"cool":1},"WYKYgzC8sHKIQBZl925FEQ":{"text":"A live band was playing when we came here on Friday night, surprisingly there was enough s","useful":2,"cool":3},"4FbWXze-88ZZmR2p4j7U1Q":{"text":"The beignets that my husband and I got were a little over cooked. I got the Cajun hasbrown","useful":0,"cool":0},"1Z8fkWsKKwD-MfHsZms12Q":{"text":"Our first visit to New Orleans, and our last stop to eat was Cafe Beignet.  We had heard a","useful":0,"cool":0},"6qMls120n9sRKAumxMUrAg":{"text":"Hubby had breakfast and enjoyed it. I went for the beignets.....soooooo good! Hot and fluf","useful":0,"cool":0},"I7f9H-ITB4KEDvdwptvlSg":{"text":"After dinner I decided to give them a try. I'd had my first beignet experience at another ","useful":1,"cool":1},"nPIcoz28u-1nKaoEf0At8Q":{"text":"Pretty overpriced for what you get. The portion sizes are small and the food is mediocre. ","useful":0,"cool":0},"PK-FAkgeMV7szpfo48bAxg":{"text":"Wouldn't recommend sitting upstairs since they won't check for your number up here as ofte","useful":0,"cool":1},"jU7debsxKjkgL5y8ozBXkw":{"text":"Great stop on the trip! The beignets were great. This location is in a prime spot. This wa","useful":0,"cool":0},"T7DWUD7mirJ5_fCRJ8YAUQ":{"text":"Delicious... and 3 come to an order for $3.99! There is a great band playing good old fash","useful":0,"cool":0},"qN-qDsXGzUADV8rIe5QV0g":{"text":"Café Beignet vs. Café du Monde. Which will prevail?\n\nI've heard how touristy du Monde is -","useful":7,"cool":5},"aJ2tg2JMWUSlbVEYsY4umw":{"text":"You can't beat outdoor live jazz in the courtyard starting at 10am.  In fact, it is one of","useful":0,"cool":0},"n6EQT4936HDORTIoT0LsiA":{"text":"Can't say I've tried any of their other food or drinks, so this review is based on their b","useful":2,"cool":1},"iEvZX5TetIjxDBWcRMvJgQ":{"text":"Great outdoor space with lovely live music and plenty of seating. Our server Marilyn serve","useful":0,"cool":0},"DoHKtGsnDkKVmeqf1jqZgw":{"text":"Was told by a few locals this is the spot for beignets.... it was eh... dough was too dens","useful":4,"cool":5},"BeLm8nQYDEMy6MJYI3ju-A":{"text":"Great courtyard to sit and grab a bite. You have to order at the window and then they brin","useful":0,"cool":0},"HU3zT8584OqktoaC-iq0Mw":{"text":"Good beignets, but definitely not the best you can find. This is a tourist trap on Bourbon","useful":2,"cool":0},"lOAqjVyVO08VMjiwrhgj7w":{"text":"I didn't really like my beignets!! That were super doughy in the inside, almost like they ","useful":0,"cool":0},"f2dRKE15Tw5JYcHfeEHZMg":{"text":"We went there for breakfast in the morning earlier about 7am. Couldn't believe the waiting","useful":1,"cool":1},"FPKL9iN1eSfqEkFetYKIzg":{"text":"I really love this place! It's bourbon street! The outdoor seating is incredible. The beig","useful":1,"cool":0},"DDiQ9QTKixlioHTwb6DxkA":{"text":"Me and my friends were just here.  I told my friend I was gonna use the bathroom and then ","useful":1,"cool":1},"1pfBlVrE4wyHfIIzb42aYQ":{"text":"Our order was quick and simple. An order of 3 beignets and an iced caramel au lait. We sat","useful":0,"cool":0},"tBt2ynMWWeZNy_At6bYs1g":{"text":"My very favorite beignets in Nola has always been from Cafe Beignet. Their original loc on","useful":0,"cool":0},"dfduk7Sc2PQL16DGtp5McQ":{"text":"In my opinion these should be the #1 Beignets in NOLA! I'm from the North and they reminde","useful":0,"cool":0},"4HRHQGOVz5F6p1RCBI8pbg":{"text":"Enjoy a cocktail to the sound of a live band. \nThis place is a little hidden from the stre","useful":0,"cool":0},"44EwirUhVm3Be2bJzU2RrQ":{"text":"3 1/2 rating but ultimately bumped it up to 4 stars because of their Au Lait and they have","useful":2,"cool":2},"DnRbCyEuxAni03otNw-VWg":{"text":"Cafe Beignet serves better Beignets than Cafe DuMonde. \n\nI. SAID. WHAT. I. SAID.\n\nYou don'","useful":1,"cool":1},"o_1Gs7nYNEpMKUUCdyw7FQ":{"text":"Beignet are a must have when in New Orleans and these are some of the best! The coffee was","useful":0,"cool":0},"lFVwyM5Q_L_iwK_Ji8WZXw":{"text":"For my money these beignets beat Du Monde's beignets hands-down. Beat them in to a doughy ","useful":12,"cool":11},"MIbjSo7qE-5qw24yJf-qZw":{"text":"there was a line. had to sign in with name and number. had to order food to order a daiqui","useful":0,"cool":0},"x0bwZqliBZPWKkY5qseapg":{"text":"My favorite things about Cafe Beignet is first and foremost the BEIGNETS! They are not too","useful":0,"cool":0},"7U0m2X6tUFgeSboPMAseOw":{"text":"This is my first time having beignets and I must say I am not impressed. Reminds me of an ","useful":0,"cool":1},"Ist5WKI60elVGXNSIfbeEQ":{"text":"My wife and I always stop here when we go to New Orleans the food is fun and I love relaxi","useful":0,"cool":0},"0h9UESAGoDVv6ReLnvhQOg":{"text":"Live music and awesome gumbo really made this place worthwhile!\n\nThe breakfast items and t","useful":1,"cool":0},"X4I1R1oCfl8yXL9VvD4QHg":{"text":"OMG so delicious! We had Beignets and iced coffee. Came out hot from the oven and drenched","useful":0,"cool":0},"LGHYTPSOU4HYmST2mRrfqg":{"text":"I was there after winning a giveaway for the beignet tower and bubbles and I think it's aw","useful":1,"cool":1},"axJdQf0ru6d1hILkEt1GXg":{"text":"Went here cause we wanted a decent brunch near our hotel. The menu looked good and the rev","useful":1,"cool":0},"lpzarl2dWMsI2WsUiY5aFA":{"text":"Had the shrimp po-boy and Decatur club. Absolutely horrible. They both had no flavor nor d","useful":3,"cool":0},"504hoRT0ytn1ptRUX-m7Jg":{"text":"Extremely long line but its for beignets in NOLA! They were pretty good, wasn't too crazy ","useful":0,"cool":0},"rL4dJEk4Qa8JYVXH7u-jiw":{"text":"Live Music! Beignet's in the Courtyard.. Complemented with the Daiquiri's. $3 for 3 Beigne","useful":0,"cool":0},"uvOYhrNd6ui3cHnr9qmJ3Q":{"text":"Had beignets here last night because Oprah said these are her favorite and all the reviews","useful":0,"cool":0},"ch8h5LKFyz6tUk9L50fB_A":{"text":"Went here cus we heard some great music playing.  It was this traditional jazz band named ","useful":1,"cool":0},"zHRxphHLrWX7lX_hZFbtxQ":{"text":"Loved the live music as well as the food. As a visited had to try these beignets everyone ","useful":0,"cool":0},"EMkMLv_4yTjsOpH_a6qjfA":{"text":"I love these beignets!!! They are delish!!! Lots of powdered sugar so every bite can have ","useful":0,"cool":0},"L473WimrTE0f-ufpbBeVmQ":{"text":"Late night beignet snack fix, yes please!  This Cafe Beignet is right on Bourbon St n the ","useful":1,"cool":1},"KnL-AzRHYt_rw7gsg84G-Q":{"text":"It's cute. Loved the live music. Very cold, but they had heaters on. The food was ok. Coff","useful":0,"cool":0},"6QI9ZHKTPcsFpDNtU8JU8g":{"text":"Luv this place. Will definitely come back again.\nTheir beignets are freshly made and liste","useful":0,"cool":0},"YzyDiAruT7dK2OwujdyJjQ":{"text":"The food wasn't great -- We got a vegetarian omelette, a hash, and a croissant sandwich, a","useful":0,"cool":0},"jW2kuf2oWsLv2RNbA_Sofg":{"text":"These were super fluffy. A bit dense more like donuts then French beignets. Or is this a N","useful":0,"cool":0},"BGcl20rWVhSQ_6Ez3gL5IQ":{"text":"The atmosphere drew me in here. This place is relaxing with jazz and soul playing in the b","useful":1,"cool":1},"htlXiOXH8x4Ulm8eXlh5Ww":{"text":"We stopped by specifically for Beignets and they were fabulous! Like a cross between a fun","useful":0,"cool":0},"SAMMEe1AbutowyxVKdtdog":{"text":"I think the location on Royal might've been better, but it's been years and I can't rememb","useful":1,"cool":0},"FM27czIqURnhCnPldw5SSA":{"text":"Open courtyard w live jazz on Bourbon St. After getting lost in the French Quarter trying ","useful":4,"cool":5},"1s0fv57Kw3WXEfN_tXrq8A":{"text":"I accidentally stumbled into this cafe on Monday night and it was a great accident to have","useful":0,"cool":0},"t0ML9g8jZpRdNTIoDd3Ufg":{"text":"On a rainy night, we enjoyed beignets here with some great music. We wanted to try Cafe Du","useful":0,"cool":0},"BhBXI2ZSaww3IvyUdX5kyg":{"text":"This is a place you ONLY come here for the bar. The bar has plenty of options between ice ","useful":11,"cool":10},"lrE0x5QVsWQtfVTkIj6gTw":{"text":"The beignets are only worth about 1 star but the courtyard set up is cool and they have gr","useful":0,"cool":0},"yc14pSdqRaCw2gZhe0pxzw":{"text":"This was a great place.  Could not wait to try a beignets.  Waited online about 15-20 mins","useful":0,"cool":0},"eYAGuwHbIz24LeQGWnT79Q":{"text":"Had to compare to Cafe Du Monde. The beignets here are more doughy and seemed more fresh t","useful":0,"cool":0},"0jlH0eFSi-q20_UPi1lTjw":{"text":"Located in the music legend's park, the bar takes advantage of the park's live band of Ste","useful":1,"cool":0},"IEuL7nVpkhvVP6-Ij1Zaqw":{"text":"Enjoyed sitting outside appreciating the jazz concert at this wonderful outdoor venue and ","useful":0,"cool":1},"8fCYOVgy8I3m08WJruCqcw":{"text":"Never had a beignet until today.  It was hot, soft, and sweet. I'm thinking it's everythin","useful":0,"cool":0},"YuaBX_d9uvmghFXIv5f31w":{"text":"In a recent trip to New Orleans - there is not one place I visited more than Cafe Beignet.","useful":6,"cool":3},"2hE4TKbkhnaDdbNfQOKYaQ":{"text":"I really loved the spot it's right inside the music legends park where they have a live ba","useful":0,"cool":1},"dM-QT9s9mfqlXJCOI9LJlw":{"text":"It's beignet a while... Nice outdoor-style cafe and amazing beignets!\n\nWe came here to get","useful":56,"cool":54},"L1lHBtvRH0_XLYkFfDffFg":{"text":"I stayed around the corner from here last week and stopped by a few times. The coffee & mu","useful":0,"cool":0},"KqjDXxvsMZKEmVSdo1jfcQ":{"text":"People are rude, I hope my second experience of having jambalaya is better than this one","useful":1,"cool":1},"iQ0-Lxf3o9GWsZIMcn-PTQ":{"text":"We stopped here around 3:00, no wait at all. You order at the counter, are given a number ","useful":0,"cool":0},"gs53lydYOFWbhL_sLCFHjQ":{"text":"First time ever trying a beignet, & I definitely picked the right place! Once you get your","useful":0,"cool":0},"37BDHHhjsuIF0hrFbFwAiA":{"text":"Great live jazz music, loved it here!\n\nDidn't  get to  try the food, but it was such a cut","useful":1,"cool":0},"RdEKgxEkum1pRNnHSJABYQ":{"text":"Very commercial. The food is only okay. The ambiance is nice tho. They had a live band and","useful":0,"cool":0},"L4Rzz8H7G88fUQB5CiGYbw":{"text":"While not as famous as Cafe Du Monde - the beignets are equally as good.  If not side by s","useful":2,"cool":0},"cWxPobO5rHihWtVQQpkRig":{"text":"After dinner four of us walked in to the café.  Finding no tables open on the main level o","useful":0,"cool":0},"JwqgZHT0ECnWmcCY0NGQ2A":{"text":"We had a great time here, considering it was the day we buried my Uncle.\n\nWe came to Bourb","useful":0,"cool":0},"niXtn7q1zt1ujAnZY9XZfA":{"text":"Visited this spot for the 1st time on a friend's recommendation. Sooo glad I did. I gave t","useful":0,"cool":0},"qZ0Dv3KteyU9ifbB3oj4KA":{"text":"Beignets = delicious fried powdery sugar goodness.   I'm going to send a text message to G","useful":0,"cool":0},"7QQKaqunpGs6oDpCPwUe4g":{"text":"5 stars for the ambience( my everyday breakfast joint in nola!). Just looooove the live ja","useful":0,"cool":0},"O1v-pFUnoZATNv03-MKhKA":{"text":"Enjoy the beignets but also wipe your nose after or walk around looking like a coke addict","useful":0,"cool":0},"5hJ9FM5WVwDELK5OyEcvMw":{"text":"If you want a true New Orleans vibe then hit Cafe Beignet on Bourbon Street. At night they","useful":0,"cool":0},"I1qP1WQwhDQvEqfopJGEdA":{"text":"We ended up here every day. Sometimes more than once. Breakfast. Lunch. After dinner drink","useful":7,"cool":6},"7PWSlhRAQmcTdTurqI0EHQ":{"text":"Cafe beignet is an amazing little place to stop. Went by before our Witches Brew Haunted T","useful":0,"cool":0},"SUbuzTlptqn2dg1-x1q7zw":{"text":"I love the feel of this place. So chill right in the middle of Bourbon street! This is a g","useful":4,"cool":5},"azrxZSoh2uYc1TRURwuRbQ":{"text":"Rocked it. Fast and friendly service.  Drinks were spot on and quick. \n\nA great place for ","useful":0,"cool":0},"SiVjj_JdyeDKQIvKNkT98Q":{"text":"So my niece suggested the place over Cafe Du Monde for beignets. Time to try this place ou","useful":1,"cool":0},"E9z0N5WWdsoHYmUWShb42g":{"text":"This is the spot if you want live Jazz, fantastic beignets, great coffee in an outdoor atm","useful":0,"cool":0},"0JbixUS8BSMbsKvusxLVxw":{"text":"Great substitute for Cafe D up the street. \n\nTo be fair, I'm not a sweets-kinda-guy. Give ","useful":0,"cool":1},"x8c6LuFA1UAJIiYDsxpVxA":{"text":"I know Cafe Du Monde is a staple in NOLA. However, the beignets at Cafe Beignet are far be","useful":0,"cool":0},"YgB75hjF6E3gqyb26t9i9g":{"text":"Better than Cafe Du Monde. Came in during the day to listen to some jazz, grab a drink and","useful":0,"cool":0},"YFmoOOx_ywmmfGldUEgtSA":{"text":"Voice and Co. - Leslie Martin on piano, Eileina on vocals- awesome lunch traditional NOLA ","useful":0,"cool":0},"VsnMi_mLXZF1UH78WrDgVw":{"text":"Walking along in New Orleans late one night we stumbled across this cafe that had live mus","useful":0,"cool":0},"dkeW-EsmXhi6HSmm6o8_Iw":{"text":"Had breakfast here once during our one-week stay. Perhaps we just weren't the biggest fan ","useful":0,"cool":0},"e8CzbowGy1Df-2ApiZ0a6A":{"text":"5 stars for the ambiance alone! On a sunny day, this courtyard is literally perfect. A ful","useful":2,"cool":1},"wJ9oImRXYyO-lwW5lPgTzA":{"text":"We were a group of 4. We paid for drinks and food. I went back to request water... they re","useful":0,"cool":0},"Rja-8pYyGbs-JqNJqqjUMA":{"text":"It was everything I expected it to be. I had heard a lot about Cafe Beignet and Cafe Du Mo","useful":0,"cool":0},"Dh5-QH5Hw_VH7nvXIM-EJg":{"text":"My family was obsessed with this place! Super great atmosphere rain or shine. They have a ","useful":0,"cool":0},"UsO0Ii6OjVfu22IEdVkXfA":{"text":"The worst food I have ever had. Just avoid this place. We had shrimp po boy and it was ter","useful":0,"cool":0},"DEj4xs-3tv7TESdRUb67fg":{"text":"Delicious beignets, the best in town. Also other good breakfast choices. Great coffee, hot","useful":0,"cool":0},"D_IhpevCzhf-WYeM7ZndCA":{"text":"Not impressed in the slightest. Nowhere clean to sit, expensive sandwiches that were medio","useful":0,"cool":0},"50gYVS9JILsEDRHVcCNdAA":{"text":"Little tiny restaurant but the food was good. We ate here on New Years Day and there was a","useful":0,"cool":0},"kjmAh40uT3yi0Cct7oBBIA":{"text":"Lierally the worst food and service in New Orleans. The person by the counter was exttemel","useful":0,"cool":0},"OI7Oc_3yHz4l5QIZBBwaSg":{"text":"Food is mostly ok, although our food came out cold, they just took it back and \"rewarmed\" ","useful":0,"cool":0},"Xt8jPZ3Fymc161J4fn8QMQ":{"text":"Maybe I got a bad batch of beignets but it doesn't excuse them for giving me 3 under fried","useful":0,"cool":0},"eFn7xdKj5SoeJ5sOs9Ui2g":{"text":"Wow! Some people are picky! Sure the prices are s but high, but um, look where you are at.","useful":2,"cool":1},"QwFpm6A1Bzb0vojEM2_5xg":{"text":"First Beignet stop on my tour de Beignet. I loved the cute parisian vibe at Cafe Beignet a","useful":2,"cool":1},"sz4DgHPzRMDGeo5__DBo7Q":{"text":"Food was good. The only issues was very limited menu, live music is nice was Way Too Loud.","useful":0,"cool":0},"J9FpHqi7k5BFHlrh9adOsA":{"text":"Great casual jazz bar. Jazz and espresso, I can do this all day!\nThe jazz is good, and the","useful":0,"cool":0},"ereaPwACw8JBrmGV7WqzFA":{"text":"Went to try these out in relation to Cafe du Monde. There was a bit of a line, so my frien","useful":0,"cool":1},"HM7PZaxfmeX3XhvUPJ8K3g":{"text":"If you want to get beignets in New Orleans, go here. If you want good coffee, go anywhere ","useful":3,"cool":2},"WJQTbDqOzEaMppYPrG_GXw":{"text":"The best beignet in the french quarter - and I tried a bunch of different spots. We waited","useful":0,"cool":0},"wwcCx891gLkMblbFZ7ZMTg":{"text":"Saddest po boys ever. Greasiest omelette ever. Live band was at least good and fun. Meh, n","useful":2,"cool":0},"k6g1C6Aii2N60dHNPAvO1Q":{"text":"Can you say delicious! I stopped by during Mardi Gras. The beignets were great and made af","useful":1,"cool":0},"6A9vEBmgT-KoIoETM7XNeA":{"text":"Fantastic place in the Quarter to grab breakfast and listen to some really great live musi","useful":2,"cool":1},"NdvrJIrUYrLiI8mjj2GCDg":{"text":"Oh no you didn't, boyfriend!\nI usually buy my coffee and bottled water here because it's e","useful":4,"cool":2},"ZledR4_dk2MNz0JVnHmu_Q":{"text":"Beautiful patio and lovely jazz band! \nI loved the ambiance, large patio, plans, a water f","useful":0,"cool":0},"w9pjbL3V66Cy3m5pHjbx6A":{"text":"Pain to order from, and be able to secure a table simultaneously.   Doesn't make much sens","useful":0,"cool":0},"99SC9oLd2eAvzHaMbjQaEg":{"text":"Such a beautiful place with live jazz music, it's all outdoor with beautiful courtyard sea","useful":4,"cool":4},"bjTROjTxh8SALgwG_VH61A":{"text":"I've been to New Orleans twice and I've been to Cafe Beignet both times!\n\nI love the atmos","useful":5,"cool":6},"5VND3TCZikMmvhCWs4q1SA":{"text":"The ambience is nice. The location is great. The live music is reminiscent of an old schoo","useful":1,"cool":1},"qn6t61qttmv3gcbblVebfQ":{"text":"Great spot for outdoor seating, live music, and delicious beignets! Last time I visited NO","useful":1,"cool":0},"BgdVPWoCKffeSd9-yryRDQ":{"text":"This is the more \"fun\" Cafe Beignet of all the locations, and it has much longer hours as ","useful":13,"cool":11},"-w4mcq4X7g6u714GgkavEw":{"text":"Probably my favorite little spot on the whole trip. We got coffee here every morning of ou","useful":0,"cool":1},"OLuDVLNBbwl8ktuOTvTxaA":{"text":"Sooo this was my first time in NO and let me just say.... this spot is crackin!!! It was s","useful":1,"cool":0},"4bxoOtqeZDwdolSGHTpu9w":{"text":"I gave this 5 stars because it meets all my requirements. It has a spacious courtyard that","useful":0,"cool":0},"WEgfu-ep4kAjH8sRW9kTbw":{"text":"Hands down, Cafe Beignet OWNS Cafe Du Monde.\n\n1. Cleanliness - I found a hair in my beigne","useful":8,"cool":6},"R1a3V2yzJ8mZKkhnmRo-Mw":{"text":"Had to hit the famous tourist spots on my visit to New Orleans and Cafe Beignet was one of","useful":1,"cool":0},"TIib5YCWNd39kdUhtV00qw":{"text":"Stopped here while walking on Bourbon St. There is live jazz music every day and it's a cu","useful":1,"cool":1},"_JGVIc1Hx85aA-Qpb9qroQ":{"text":"So I attended this establishment on a Monday morning around 11ish for brunch with my famil","useful":1,"cool":0},"YFX-ptS9jMww6Ch38A-NxQ":{"text":"The atmosphere here is awesome with the live music. It's nice to dip off here from Bourbon","useful":1,"cool":0},"nLdqrX07FpQGLCwEKiPALQ":{"text":"This historic staple of the French Quarter is truly for the birds. No really. Aside from t","useful":2,"cool":2},"HFxgP-GfcLd11i3nO2woYg":{"text":"I'm sure there's a battle of the beignets and I wasn't as big of a fan of the ones here. T","useful":1,"cool":1},"Z29ycByNBxWZPgZOkKhQpg":{"text":"Cafe Beignet was right across the street from my hotel while I was in NOLA. The location w","useful":5,"cool":3},"1ZCb9CbtJV9eelPHXOhNTg":{"text":"I came for the Beignets but stayed the live jazz, this open air courtyard is the perfect e","useful":28,"cool":23},"kSmtuDte7GxHDzggHZj0Cw":{"text":"I wanted to experience a new orleans beignet and stumbled across Cafe Beignet. I LOVED the","useful":3,"cool":2},"vbGMAdGDzohy3tzyLtAlgw":{"text":"THIS IS A VERY NICE SPOT!  The atmosphere is amazing. There was a live band playing jazz w","useful":0,"cool":0},"8vzB5mWdC8YAWzOlO-oojA":{"text":"This is such a nice little outside bar, that feels almost out of place in the middle of Bo","useful":8,"cool":6},"e1CND7AdD06HT6H8h6I5iQ":{"text":"Usually a great experience, but this evening a \"band employee\" parked herself next to our ","useful":0,"cool":0},"lx6VgzVFpDdY7XVebUTHbw":{"text":"Little bit of a mixed bag on this Cafe Beignet location versus the one on Canal street whi","useful":3,"cool":2},"qQY2xEGlD6EBMEqZ9W9LcA":{"text":"Cafe Beignet has a few locations throughout the French Quarter which is a huge pro meaning","useful":3,"cool":2},"_Me6uV31_1ULrG65rL4Q0A":{"text":"Beignets 3 for $4!  They're HUGE though.  You could definitely share with a friend.  Light","useful":0,"cool":1},"M5EoIUKGHLOMTPRzMG2XkA":{"text":"fame here for a quick bite to eat. i was very disappointed in their sandwiches. i got the ","useful":0,"cool":0},"a4oIHL9wvqvi1f8H_-9hDA":{"text":"First review from my NOLA trip! I absolutely loved Cafe Beignet, which I personally though","useful":66,"cool":66},"-GETwOd3mRVz8nYVGXtiZQ":{"text":"Wouldn't come here to eat, I've had better breakfast food at McDonalds.  The only plus sid","useful":0,"cool":0},"CFX6IMPDNMn3XHuzg12FiA":{"text":"I came here for my birthday and the band sang happy birthday! The service here is exceptio","useful":0,"cool":0},"neoTCZ1RzLOFesMjNqGKpQ":{"text":"Given the exceptional experience I had the other Café Beignet location, I had to check thi","useful":1,"cool":0},"GlZu0vB5s8uWjtFY6NnIzQ":{"text":"Cafe Beignet was a good place to sit and enjoy drinks and food. It was a little break that","useful":1,"cool":1},"rGxvS358nyN_QOh3Y74aiQ":{"text":"Omg! Food, music, service...EVERYTHING is great! The food on time and super fresh, friendl","useful":0,"cool":0},"FgqrCEQZYXb9dICoSjMnsQ":{"text":"These were pretty good beignets they were thicker than I like but I think it's because I g","useful":0,"cool":0},"HfkNJlR65ITElzB4j8t_Ww":{"text":"My experience here was a delight, the atmosphere with the lights and live music scream New","useful":0,"cool":0},"FNU1J86F2nkKRoQTc-tWxA":{"text":"Piping hot beignets on a cold night, cannot ask for more :),  we got the beignets here and","useful":0,"cool":0},"VaGldgzPZ_xDgwyJjQpFgA":{"text":"I think the beignets here are not as good as Cafe Du Monde's, but you can drink alcohol he","useful":1,"cool":2},"bd3XiVI7-Ke6maveR_pCjQ":{"text":"Instead of Cafe DuMonde, stick around Bourbon St. There are several of these around but th","useful":1,"cool":0},"GG2UC2txauPSxjZ-hxkF_g":{"text":"Their beignets are consistently hot and freshly fried, 1.5x larger than Cafe du Monde's an","useful":0,"cool":1},"ZQPmJcGkrI6tshPe5qlpzg":{"text":"Sucks I have to leave this review because the actual beignets were definitely 5 star. We c","useful":0,"cool":0},"6e08fpIqKAzl4vSTzzqe9Q":{"text":"Still a 5 star touristy thang y'all.  Visiting the Sip. Did a day trip with my mother to N","useful":2,"cool":1},"vmvyXDkwGU-2mnEkY50OtA":{"text":"Nice you can get breakfast anytime. Got the shrimp platter as well, delicious fried shrimp","useful":0,"cool":0},"o9XEC-bUBLiKVvb90JjtNg":{"text":"Tasted like Waffle House food. Everything was cold and unseasoned. I got the Southern Brea","useful":0,"cool":0},"CELxdV5PIkkQaP991wCjbA":{"text":"This is the best location for beignets- tbh I find these tastier than the competitor brand","useful":0,"cool":0},"SYH0JzUV3JEBJmt8wQWZLw":{"text":"We briefly passed by during our trip to NOLA . Live \nband good bar and awesome Beignets. G","useful":1,"cool":1},"VV8eMz8irjq9tB13mN44ww":{"text":"Great live music band, but the food is terrible. We ordered po boy sandwich, and a croissa","useful":0,"cool":0},"tkWv7TvMPT297fIHWzfUPA":{"text":"I really enjoyed coming to Cafe Beignet after a night on Bourbon Street. While crowded, we","useful":2,"cool":3},"L2rAlkXb3ZjlFf83at61JA":{"text":"Nothing against the other popular local beignets around, but Cafe Beignet is my favorite, ","useful":3,"cool":2},"03KgAe9AzUfMnJY71-We3w":{"text":"This is a fun place to sit and drink ice cold daiquiris on a hot night while listening to ","useful":7,"cool":8},"YgSHU8ptaio4vvRVMvoqYw":{"text":"The atmosphere can't be beat and it's a must-see in Nawlins! It is clearly pricey and clea","useful":0,"cool":0},"c863ruzHmFzAgnhUcYJIiA":{"text":"My favorite breakfast spot in the French Quarter. They have excellent coffee and the #1 be","useful":0,"cool":0},"8hD1C_zF_XAVbTB8KFvw6A":{"text":"Stopped in for beignets because I couldn't believe that the ones I had two days ago at Caf","useful":0,"cool":0},"pRTwJ85zMrluSRaYyfseUw":{"text":"If you don't like eating straight up powdered sugar on a smidgen of a fritter like a certa","useful":6,"cool":4},"DM28yocOiKXNlLL7PPeVkQ":{"text":"Love their beignets. This might get me harmed in some way as I know that there are plenty ","useful":4,"cool":4},"uGtDu9uZHICgeqe3RfDYVA":{"text":"So as I was enjoying  my time in New Orleans for Mardi Gras I stopped at Cafe Beignet. It ","useful":1,"cool":1},"iVWP2fn3YQ6ahOPtS-bv4w":{"text":"Delicious hot steaming beignets - can't stop at one, had to have two.  The cafe au lait wa","useful":2,"cool":1},"0eGNplVKqHwDSzTsp-sVTA":{"text":"I came to try out their beignets early on a Saturday morning. It was a perfect time to com","useful":3,"cool":1},"C_CD5ZEMMI7dcubfEYaDZA":{"text":"Was in and out in no time and the Beignets are as good if not better than other famous NOL","useful":0,"cool":0},"cXkUFnOaSzrSoXXHDf0oNg":{"text":"The vibes here are fantastic.  Right in the heart of Bourbon Street.  Loud, good, local mu","useful":1,"cool":1},"3l4P3b72Mq3JxuPJHzr4MQ":{"text":"Maybe because we're not from the South, but we thought the red beans and rice were delicio","useful":2,"cool":1},"qeiXuO8CFwzRaWWKeoI-bQ":{"text":"Stopped it to grab beignets on walk back to hotel. Live music, sunshine and friendly conve","useful":3,"cool":2},"uOgv164YAHRNW3ODbt84WA":{"text":"There is always a line, but it moves quickly.  The courtyard is pretty. The beignets were ","useful":1,"cool":1},"A94478gfHr8pX0uZ19KsWA":{"text":"Didn't eat here but gave it 5 stars for the patio, live music, and ambiance. It was a nice","useful":0,"cool":1},"Bxglz8J52Q7HltKNCFJw3Q":{"text":"We came here for breakfast on Saturday. It's an open air park style setting with live musi","useful":0,"cool":0},"zcgptmZAO9ul7bvSuDZzCw":{"text":"We heard Cafe Beignet was just as good as Cafe DuMonde. I hope that's not the case. Lookin","useful":0,"cool":0},"BZeNvqUiQWyS4CpVlLvnMQ":{"text":"This place is good for the live music. The beignets are ok but definitely not better than ","useful":1,"cool":1},"vQzM049xe7oxrW52newp_A":{"text":"Bouncers are very very rude. Abusive of power which is very strange considering they're bo","useful":0,"cool":0},"8RORDULsu5z_80uipjUCFQ":{"text":"Five stars for the ambiance, four for the food, and one for flexibility of menu.\n\nI had br","useful":2,"cool":2},"XtS1KBTSEGp4Aj6WhoqOIA":{"text":"Beignet is meehhhhhhh\n\nI tried Cafe Du Monde by far the better choice.\n\nDont know what els","useful":0,"cool":0},"WwvZ7zCz125XSFuxPVpWXA":{"text":"Absolutely love this place.  Do yourself a favor and come here for your Beignets.  Soooo m","useful":0,"cool":0},"tT7PpUyCqqQzvAVAVs7ekg":{"text":"First beignet of the trip. Sadly, it was just okay. Thick batter with an abundance of powd","useful":1,"cool":0},"Iv_lxQVmqwFOrN38fnHVow":{"text":"Wonderful. Great coffee, jazz and breakfast but get there early as this place fills up qui","useful":0,"cool":1},"ExvxqlbzSlSKJoIv6aCogA":{"text":"Great atmosphere, mediocre food, but TERRIBLE service. The bartenders don't let you take o","useful":0,"cool":0},"whybJ2rlNbWbXvHTF7nAaw":{"text":"Nestled in Musical Legends Park, this place is a little gem and arguably a great Du Monde ","useful":12,"cool":10},"PqJU-uxo6xXHOWwjKkzcoA":{"text":"We had the beignets from here for breakfast, and they were amazing! We got them as take ou","useful":0,"cool":0},"Ex06NXBF4ULhJFUwy2UdoA":{"text":"Music & atmosphere is great!!! My jambalaya was cold in spots and warm in others. I imagin","useful":0,"cool":0},"r6_B8tt_3noq4_u_KLViDw":{"text":"Checked out Cafe Beignet for our second morning in town after hearing that it was better t","useful":1,"cool":0},"3CrNvWaz0WhcTDLk0oAjgg":{"text":"Great low key place on burbon street. Live jazz was killer. The food was good but the serv","useful":0,"cool":0},"9GkocMaH_hTctImzJC_VdA":{"text":"Tried the fresh handmade beignets, jambalaya, praline, and the Belgian waffles. The waffle","useful":0,"cool":0},"CkZ8IaTgPq4dEOHPEjOdLw":{"text":"The first time I came to New Orleans I tried Cafe Du Monde. After going to Cafe Beignet on","useful":1,"cool":0},"Zv0Gt29akuxO9w2mT7JtGA":{"text":"We're walking down Bourbon Street on a Sunday night. Been in NOLA for less than 12 hours. ","useful":0,"cool":0},"GaGp5zdxrAdUiBD_CbkdIg":{"text":"This place has great ambiance. New Orleans jazz, open air seating as well as gentle mistin","useful":1,"cool":0},"z3Oeh2qQDUVneOjYG1_jeg":{"text":"Went here for a quick breakfast before a swamp tour.  I liked the fact that you order at t","useful":0,"cool":0},"Ax9PGCQjIMqmeKnlWjfRSA":{"text":"Great place to sit and eat and listen to jazz. I've been many times and usually for breakf","useful":0,"cool":0},"Ct9HrMnx1yGOj_zPgiBh4A":{"text":"Tony's music captured our attention as we were walking by, and we ended up staying for ove","useful":0,"cool":0},"9XlTeo2JmIccpFOgegKUyw":{"text":"We wanted to have some coffee and beignet and so we thought why not try the place that has","useful":1,"cool":2},"4f-MBgV8IbLFKMmHZ2d4mg":{"text":"Better than Cafe Du Monde for beignets- hands down. But the rest of their food is garbage.","useful":0,"cool":0},"pL_E8nYSRwttQBurJ88exw":{"text":"Came here with my family to enjoy the live music and have some drinks. It's a great atmosp","useful":0,"cool":0},"jQ71AqHSj1vU5lMMhXWvVw":{"text":"After going to Cafe De Monde the day before, we tried cafe beignet. It gets really crowded","useful":0,"cool":0},"JU3fXOnTpzuV0bxkj6ZP8w":{"text":"The line is crazy long and all the tourist that come seem to forget their manors. The beig","useful":0,"cool":0},"kKH0JUBoVrf5LlFXzxFPSw":{"text":"Great beignets and delicious coffee! I didn't miss not going to that other place at all! C","useful":0,"cool":0},"u4TCZWr4JxgPvM9Q4wUUBQ":{"text":"This is my favorite breakfast place in New Orleans. What I get here is the Muffaletta, Caf","useful":0,"cool":0},"n5l6DyAp4V-fb2UxHPjVBg":{"text":"We passed by this café on our way to another popular eatery that serves Beignets. However,","useful":17,"cool":19},"frX6W_c0K8oYg-jKOBuSgQ":{"text":"THE BEIGNETS WERE SO GOOD. My only problem with this place was the cleanliness... we went ","useful":0,"cool":0},"Kb69hJG7ZZPoYl5j0E2cwg":{"text":"I'm dropping an update for Cafe Beignet, one of my favorite little tourist joints, because","useful":1,"cool":0},"Et5EPzLCW6m7UFkMSxbW7A":{"text":"Had my first New Orleans beignet here, and I was totally unprepared for the experience. I ","useful":0,"cool":0},"ndBeEWB589ULd8TyothCog":{"text":"Big Ole Beignets with nice and fluffed the F$&@ UP... So goood!!!! plus I don't drink coff","useful":0,"cool":0},"GFS2INiUOXDNZifimRFung":{"text":"Wanted to try another beignet location, so stopped here to try out Cafe Beignet. I have to","useful":0,"cool":0}}