{"MQprkT4LBnTGAJ1kRT18_w":{"text":"Absolutely beautiful place!  It totally feels like you're in Paris. The drinks are really ","useful":0,"cool":0},"nwiw0MXjPQIi6pBGPze9ZQ":{"text":"We wanted to follow tradition.\n\nDown the elevator, to the lobby. Door pops open, and acros","useful":4,"cool":4},"Abih3StouoVQU6DPG6gKKQ":{"text":"A polished curvy bar made with African walnut, Sinatra playing in the background.  Soft li","useful":6,"cool":5},"eMxnwoRpQDCm0MlG_wxyJg":{"text":"The Roosevelt hotel is one of my favorite places to come when I am town. And also the Saze","useful":0,"cool":0},"JL9tLCUbfBYWaDvLO5CV8g":{"text":"Welcome to the original sazarac bar of New Orleans. I came to Sazarac bar after discoverin","useful":2,"cool":1},"t9ibaLfuebb3xxtFrGJUkg":{"text":"I've been to the Sazerac twice since it's reopened. The first on New Year's Eve - it was l","useful":0,"cool":0},"-JiL-mnLEtrnsMX93gBmEw":{"text":"Sazerac is the hotel bar of the Waldorf Astoria, and it has the swank atmosphere of a clas","useful":0,"cool":1},"o9F5mzg41PlZ2Go_K_kuwA":{"text":"Sarah is an excellent waitress. She waits on me and my guests excellently each time we vis","useful":3,"cool":0},"eoqUvlxwrZzl52jqcqcL9A":{"text":"The cocktails here are good, but this joint is fancy in a stuffy, self-important way.  If ","useful":0,"cool":0},"zxzMAVCjDtxho-7E7MUWSA":{"text":"True love. \n\nDecked out in gorgeous wood, with soft lighting and well-groomed bartenders t","useful":1,"cool":1},"vZmtAwabZhNp0bRdkO2B-g":{"text":"The Sazerac Bar is housed inside the Waldorf Astoria Roosevelt Hotel. The lobby of the hot","useful":0,"cool":0},"gJ8Y0H17NkOXTSYJtRYrrg":{"text":"We were oh so excited to go to the Sazerac bar that it was our first stop on our trip afte","useful":2,"cool":0},"dxfjBOYfiRFUX9naRQp84g":{"text":"Just what I was looking for. What a great room and great drinks. It's unfortunate that the","useful":0,"cool":0},"k4s3QT5tvsw9bIiPomNLmw":{"text":"Th ambiance is nice, reminds me of a speakeasy which is a fun different place in crazy par","useful":1,"cool":0},"vWVzQhqChvdb2Bg8TUo3Pw":{"text":"I knew one of the drinks I must try while in NOLA was a Sazerac, so what better place to g","useful":2,"cool":1},"ZdU7DHv7jyav9bmbKoHiNQ":{"text":"Sazarac bar is located in a very fancy hotel. Make sure you dress appropriately because we","useful":0,"cool":0},"X4J7PkWUnORSJLE5NhiJJA":{"text":"Swanky place, not so swanky people.  Not that I mind, makes the people watching more inter","useful":1,"cool":1},"Lrk5CPqfwok-KdIc4WMjBw":{"text":"Good atmosphere. Old school feeling, with wood panels. They provide some bar snacks (peanu","useful":1,"cool":0},"LBbCIlp3bqYaAKmHuMw3rg":{"text":"Our bartender was friendly and helpful. He made delicious drinks - I got a Cajun cocktail ","useful":0,"cool":0},"lffdsi09qTs5me72OyIv5g":{"text":"Good spot for a drink.  We arrived around 1:00am on a Thursday night and it was a quite de","useful":0,"cool":0},"83fq0oe2yVjd3OkTz6k6Rg":{"text":"Bad service. Waited 10 minutes at the bar with the bartenders ignoring us. Had to get our ","useful":0,"cool":0},"daGjQhze8_L3EjWFMRZ1SQ":{"text":"Went out of our way to visit this gorgeous turn-of-the-century bar in the Roosevelt (now t","useful":0,"cool":0},"PoQ1kGmz6Rq9GxY7vIGXRw":{"text":"I had high expectations coming into this place. Lets talk about the name, Sazerac Bar, the","useful":2,"cool":0},"5a5XNQqy2Q_YrvQAX5dP0g":{"text":"Great bartenders and amazing atmosphere. This place definately feels like you've stepped b","useful":0,"cool":0},"1yfGGySQd1rySENypK1KHA":{"text":"Enjoyed spending a few hours here with friends. Nice atmosphere with great drinks. Went ar","useful":0,"cool":0},"wNBgqJRRwj00uYPM42_1Pg":{"text":"With many options in New Orleans, the Sazerac Bar is  standout with its classic old New Or","useful":0,"cool":0},"81-5aeQ45_yEueROVwa79A":{"text":"Beautiful bar, delicious drinks, but way too crowded! If I'm spending $15+ per drink, I do","useful":0,"cool":0},"nin2LMd5dWFXkv_ThjDSkA":{"text":"We stayed at The Roosevelt so obviously we had to try this place! I'm glad we did because ","useful":1,"cool":0},"_r76HAiDym2v0Iv7AoIOkQ":{"text":"A piece of history! A piece of Cocktail history!\n\nSazerac Bar & Restaurant is on my must v","useful":2,"cool":1},"tMqlGrD4dnBqidTtWAxwDw":{"text":"At around $14 each, these cocktails are not cheap. But the bar and environs are gorgeous. ","useful":0,"cool":0},"fsx_uDZdZFWCoI_lZf9zCQ":{"text":"Hands down my favorite bar experience of all time. I'm pretty picky about my cocktails and","useful":0,"cool":0},"3Nh36CnGr3k-eNljOGDL8g":{"text":"Excellent cocktails poured with care and craftsmanship! We really enjoyed the Sazerac, Gin","useful":0,"cool":0},"iuU3kaMWeTNkgoss0AejxA":{"text":"Sazeracs are good, the other stuff is alright, but the service is really nice. Sarah was g","useful":0,"cool":0},"VgWQ4h8SPrhfnG_lKpnhQQ":{"text":"HANDS DOWN my favorite bar in all of New Orleans.  AMAZING drinks.  I loved it so!\n\nThe se","useful":2,"cool":1},"M56bHz7mxuQKGRFs7LLJFQ":{"text":"The Sazerac Bar in one word-swanky. I would definitely say that this is more of an upscale","useful":1,"cool":0},"U4SB4BLY2Ou14-onGpsmug":{"text":"There's a lot to like about the Sazerac Bar. Ambience is great and old South murals are cl","useful":0,"cool":0},"8I9Kr_4Ac7PxS6EMf8HSPQ":{"text":"I love this place! It just has such a classy old timey feeling to it. And it is by far the","useful":1,"cool":0},"W9-MfvVMplX4qTi01EDCmg":{"text":"The Sazerac is very fitting with the hotel's decor and atmosphere.  You feel transported b","useful":0,"cool":0},"gxaN7m5wGz9BtpqEOYQmHQ":{"text":"During Tails of the Cocktail, we stopped in the Hotel Roosevelt at the Sazerac Bar and wer","useful":4,"cool":1},"CwbJfSmVuY8LTmxRopDTlA":{"text":"Struggling to give it one star. Service by both the bar staff and the hostess was.non exis","useful":0,"cool":0},"jNFiHCWwC9Ikbrg0ZHSMRw":{"text":"I'd better see The Sazerac inside the pearly gates or I'll take the express trolley down b","useful":0,"cool":0},"qyW5ljnvoB8bPad2gfhM6w":{"text":"Old fashioned ambience and it was packed.\nThe bartenders were friendly but professional.en","useful":0,"cool":0},"wm3Iyj0qXLiSQEh84xdYxA":{"text":"The Roosevelt is the absolutely gorgeous Waldorf Astoria hotel in New Orleans. The Sazerac","useful":0,"cool":0},"vKWgNdu9eweD_0LdPTRkdA":{"text":"Great bar all around (although much of the clientele is not my age), but even if it totall","useful":0,"cool":0},"H5maW8rnLcE95QGwRK0USw":{"text":"Great cocktail bar and of course the Sazerac is outstanding!  Also had a good old fashione","useful":0,"cool":0},"4bkJfpj03-SZLXu6wNsPGw":{"text":"If you're in New Orleans you gotta have a Sazerac right ?! And if you're gonna have a Saze","useful":0,"cool":0},"aPN25vxh_iFNOryoUnddhQ":{"text":"This is classic cocktailing all the way. The bartenders were friendly-ish. They are seriou","useful":0,"cool":0},"bC3Pqu8YzRKwNQ7YdE6T8Q":{"text":"This bar was exactly what I was expecting from a bar in the Roosevelt: beautiful, over-pri","useful":0,"cool":0},"WhHN3k3pbnLOGAWgXhZ4qg":{"text":"Hotel bar had never been that appealing to me, mostly because I don't always travel in sty","useful":3,"cool":2},"5c2mZGfME566LPfrsDDi_A":{"text":"If you're going to be a tourist in a touristy place, then you can't complain about the tou","useful":0,"cool":0},"7JSF-ic636rdRwzHtG21Sg":{"text":"Good place for after dinner drinks.  A little on the over priced.  Still nice quiet place ","useful":0,"cool":0},"RlVfpquFsV4kabsJFocq3Q":{"text":"I've been to the Sazarac a number of times since it reopened in the Roosevelt Hotel, and m","useful":3,"cool":1},"KQ7HyQ1uyhR0RmCKZiBo3A":{"text":"Super classy, old school bar! No frills, just traditional strong drinks. We got the famous","useful":0,"cool":0},"4YT5WeYaFi59mvSoWffEsw":{"text":"Apparently this is where the Sazerac got invented. That's pretty cool. 17 bucks per medioc","useful":0,"cool":0},"SXZJkHQu6-K51NZ7N072bg":{"text":"It was my first time having a Sazerac and quite possibly I had the best already. If you ha","useful":0,"cool":0},"dMjMV5dKTcfE0n0Vhta76g":{"text":"Come here for the sazerac - properly done with cognac. \nStay for the people watching? Do w","useful":0,"cool":0},"GW33f9rjni5KLAfbganHMA":{"text":"Hey bartender...! I don't know what to look at more, these sharp looking bartenders in whi","useful":0,"cool":0},"oE0EAqfI1AE1s1Gnyxl-oA":{"text":"Have wanted to come here for a bit and on my 3rd trip to NOLA made it. I am sooo happy I d","useful":0,"cool":0},"23asPyzMClmglXifn4JGSg":{"text":"Having friends in town gave us the justification to check out The Sazerac Bar in the Roose","useful":2,"cool":0},"q4EKY1xh3iyuUn76ttLLDA":{"text":"Rude, Grotesquely Expensive, Shitay Service....and I don't mean that in a good way. \n\nBein","useful":2,"cool":0},"UQ9wMMPSYkojT_W7E4vg8w":{"text":"This was a nice escape from a busy, loud bar environment.  I liked the old, dark and upsca","useful":0,"cool":0},"qhfEIwxPoBmGH0SDMQrLug":{"text":"Can't really add much more to what others have written. Came here for a drink on a recent ","useful":0,"cool":0},"Ey-NpNddG3dcX-BwvCvxpw":{"text":"If you are ever dining anywhere around the famed Roosevelt Hotel, making a stop at the Saz","useful":7,"cool":4},"AYodpJP85BfiwEwdGmnadw":{"text":"The Sazerac is such an elegant bar. \nI suggest the Ramos gin fizz. Great place to have bir","useful":0,"cool":0},"C9_aW6tkM8isEWYnQMvJRA":{"text":"Fun and delicious drinks- but CRAZY high prices. Good for every once in a while but not so","useful":3,"cool":0},"pFtWywx4BO0V3Qzm6lxBuQ":{"text":"Lived in New Orleans for the first 23 years of our lives. Moved away years ago. On this re","useful":0,"cool":0},"MtQZyeqIKI9yhLaPcYu59w":{"text":"Rebecca's knowledge in making drinks is incredible!!!   A must have upscale bar/lounge to ","useful":0,"cool":0},"ZDZPVsnlDSgbtUi-bPpd1Q":{"text":"When in NOLA, have the famous drink! Not bad, they also make a gin fizz that is fun to wat","useful":0,"cool":0},"H3pP5U9ZkSznwt90zfABIw":{"text":"Good drinks, good service. Not a bad spot to grab a drink and sit on nice comfy couches!","useful":0,"cool":0},"amphLRoM5Irye_qFxBC0qQ":{"text":"The drinks were a bit overpriced. The crowd when we got there was insanely loud and annoyi","useful":0,"cool":0},"dAKH080WoVH5YBNshTYgLw":{"text":"A classy, cool bar in a comfortable environment.  Some bars in New Orleans have drink list","useful":1,"cool":0},"912xkKvFPCT-T9919zsL8A":{"text":"I stayed at the Waldorf for my birthday and decided to get a drink since the cafe and loun","useful":0,"cool":0},"9utc2DK7jpTl0oNx3f14ng":{"text":"The Sazerac Bar in the glorious Roosevelt Hotel is a place I highly suggest visiting while","useful":0,"cool":0},"ijXMez3a0HdzDYc0n58GdQ":{"text":"I came to Sazerac Bar on a personal Sazerac bar crawl and was met with great service and g","useful":0,"cool":0},"Gt_R0IIlzd3Qn2A_0lmLsw":{"text":"We locals know the Sazerac is a longtime favorite here in Nola. The redone bar is stunning","useful":0,"cool":0},"EwOGQZC2nh-Aw5p1xQFqUA":{"text":"The perfect start to a long weekend in New Orleans. The hotel is fancy & the bar is beauti","useful":0,"cool":0},"du90gfearJTxpJG3d-7iqw":{"text":"Great cocktails, but pricey. Get the feeling you are in a private club. It was good to get","useful":0,"cool":0},"sj4ff4l34-Yty-TJazBXSg":{"text":"Inside the stunning Roosevelt, this iconic bar serves up A+ cocktails and has so much to s","useful":2,"cool":1},"Y5OmFZRxG59h45BW2FJO7A":{"text":"The world's first mixed drink was served here way back in the day. Gotta check  that out r","useful":0,"cool":0},"-W7Qxw04aePxERO_4NF9Mg":{"text":"I loved the feel of this charming, old-school hotel bar. It was absolutely beautiful and i","useful":1,"cool":1},"lQd4BMO8EYeFPKEa3Da1PQ":{"text":"Ramos Gin Fizz - that's all I need to say - set yourself back in time to classic New Orlea","useful":0,"cool":1},"Zm0du0jRqkR14K9LGnceEA":{"text":"\"The Sazerac Bar Welcomes Guests 21 and Over\" -- a dream come true. Expensive drinks to be","useful":0,"cool":0},"sUHR6jRbsKik4Uhscr7ZtQ":{"text":"It's a small bar/lounge located inside the Roosevelt hotel. We ordered the classics: Sazer","useful":0,"cool":0},"w4tFI5P35EYLcxF4WqaSTA":{"text":"A couple of us went to the Sazerac Bar while being from Minnesota.  This was the best bar ","useful":1,"cool":0},"hRxSTYIimRyySbPF1VMpfw":{"text":"Sazerac Bar is located inside the Waldorf Astoria hotel which is best described as stunnin","useful":0,"cool":2},"J2Rx89M6BoB6e4zBNq718w":{"text":"Make sure you see Rachel, AMAZING mixologist!\n\nGreat Old Fashioned! The Sazerac is a must ","useful":0,"cool":0},"a0bFkj8si5Ln209uojawXw":{"text":"nice cocktail list had several nice ambiance too","useful":0,"cool":0},"oNd4PCWQCiNwdZ9VILKWvw":{"text":"Came for the original Sazerac and was not disappointed. Well made cocktail with excellent ","useful":0,"cool":0},"AMCG4SF7g1WxjghYeIxWew":{"text":"Sazerac Bar was highly recommended  by the almighty Anthony Bourdain, so of course we had ","useful":0,"cool":1},"KKvMuUbbMoaqiTN2b5Bg6A":{"text":"I love everything about this bar.  I get excited walking into the Roosevelt Hotel and know","useful":0,"cool":0},"8uyOpT9qxmpXfuehQNedLQ":{"text":"Quite pricy but very worth it. Must get the bar's name sake drink. Its the best in town. T","useful":0,"cool":0},"GY7R6lQwjqlggBb7l4Mu5Q":{"text":"Lovely atmosphere, strong drinks, perfect spot for appetizers and a cocktail before a nigh","useful":0,"cool":0},"hQSIemRc7hePXKiZJxeGsw":{"text":"** 3.5 stars **\n\nA grand hotel bar and restaurant, styled in old-fashioned Art Deco.  No o","useful":1,"cool":1},"sSmpku8ko_C6CR9uLKMm2Q":{"text":"Club chairs, table service, and a Ramos gin fizz.  Really, why would you drink one anywher","useful":0,"cool":0},"1Abjibz40hpMdnoIpy0Glg":{"text":"Great cocktails and service in a grand atmosphere. \n\nInitially we sat at a table that some","useful":0,"cool":0},"Re2sSPinoV26cxD2Jc1xRA":{"text":"Gilded lobby, alligator backed lounge chairs, original cocktails, this is a step back in t","useful":0,"cool":0},"CmgYZa-Aq_85iaUk-tlePA":{"text":"Take a moment out of time and enjoy a Sazerac or Pimm's Cup at this Art Deco bar. The Roos","useful":0,"cool":0},"Gxrr1DH-83ih5imVlY8BGw":{"text":"Staying in the quarter and looking for something a bit more refined than the bustle of Bou","useful":0,"cool":1},"87bU15sDqMCJ4-4zFyAXCQ":{"text":"Nearly everything else in NOLA has been a massive disappointment, but this was the sparkli","useful":0,"cool":0},"w_34OOwvocfk_Ro4jCz8BA":{"text":"Matthew, the bar tender, was wonderful despite the bar being over crowded and under staffe","useful":0,"cool":0},"ZET480jE7PQluwrHKiVaJg":{"text":"Excellent drinks and service at this effortlessly classy, historic New Orleans bar.\n\nAfter","useful":1,"cool":0},"RdNRR6LYbUGx_JpB4bt_8w":{"text":"Very friendly bartenders! Knowledgeable on the area too. Educate yourself on a Sazerac- sa","useful":0,"cool":0},"DVldJ2atIompT80YZLsmvA":{"text":"Great place for drinks and chill. Old fashioned atmosphere, dark lightening, soft music. N","useful":0,"cool":0},"fmcXnOYZSjgrHWTxQeHPCA":{"text":"hmm. Great time but that was the company. The paneling is beautiful and I loved the tile f","useful":1,"cool":0},"bfJRFp13BrKlySPEA7TQjw":{"text":"The signature Sazerac is bar none, the best sazerac I had in town. It was executed very we","useful":0,"cool":0},"OZB-JRv5Als0_AzbRFTdow":{"text":"Had a great Sazerac.  The bar was beautiful, seemed like it was out of the bar in the movi","useful":0,"cool":1},"2hqofBPJGyiw4eWDeoyaBA":{"text":"I really appreciate a good sazerac, so I was excited to try the namesake drink at the Saze","useful":1,"cool":1},"IhcSywkzF1tiSU42sIccDw":{"text":"So swanky and fun! I had two dark and stormy drinks since it was a dark and interesting pl","useful":0,"cool":0},"BMVA-x5RIRHS6e2STFX2lw":{"text":"I've been here several times over the past couple of years.  This is a beautiful bar in th","useful":1,"cool":0},"tAkpniFkOu7QWStR8CAr1g":{"text":"My friend has the 1840 sazerac, another had the yummy basil julep, and I had the fantastic","useful":0,"cool":0},"dgwUVlVC9jVR8Mvs8VXHwQ":{"text":"Eh. I'm more a beer and wine kind of girl, not really a fan of hard liquor. Friends wanted","useful":1,"cool":0},"xHLLR7Mkc-vITdWvgYQfJA":{"text":"Posh and classy; good escape from the Nawlins heat. Bar is dark; bartenders dressed to ser","useful":0,"cool":0},"UlwlCZYSZvOCL2IdmKoZnQ":{"text":"Was hoping for a 4/5 star experience but ended up dissapointed and only ordered 1 round. D","useful":0,"cool":0},"l_QqZ2-GkRIJTYBnEBpj_g":{"text":"Was there visiting two weeks ago.  Drinks ok.  Service terrible.  Bartender literally told","useful":0,"cool":0},"e0fh1rvh_qs0IEx5Lv3ucQ":{"text":"On a Saturday night at 9pm, this place was packed! It came from a recommendation from an e","useful":0,"cool":0},"TJUxg3kBB3uGhY-EzS4mqA":{"text":"Came in last night at about 10:30 to end the night. Sazerac was busy so we went in to the ","useful":0,"cool":0},"TRa14IlQAz9cEa5NJqBojA":{"text":"Everything about the Sazerac Lounge is first-class!  The ambiance is second-to-none, in a ","useful":0,"cool":0},"1zB0iBsbNEhUAkWD2pIsRw":{"text":"This is for the bar only...\n\nThis palace of posh pretentiousness serves its community quit","useful":4,"cool":1},"oPgVXN7gYoc2IUWjEHLUPg":{"text":"Old school class. If New Orleans was summed up in one place, it would be the Sazerac Bar. ","useful":0,"cool":3},"C_MjIz4abv40JotvVWQhRg":{"text":"This is a wonderful spot for a cocktail or two...or more. It's located in the refined Roos","useful":0,"cool":0},"uL7ZwoQ3NSHeuLqND3sjGQ":{"text":"I'm very much into cocktail history so of course I had to go to the place where the Sazera","useful":1,"cool":0},"T8_TicDiNpmQSQKE65M_rA":{"text":"Not sure what I can add that others haven't said, but I will say this: if you like Sazerac","useful":1,"cool":0},"-VOtIqW2YlsGL4h73xTg0Q":{"text":"Forget Bloody Mary's, say goodbye to mimosas...the new hair of the dog cocktail for me...d","useful":0,"cool":1},"HtFlsCmHuR9RjLMK5CGa4A":{"text":"This is an interesting place. It feels stuck in the 50's with the decor, bartenders and th","useful":0,"cool":0},"5ZyNzdg-DzW2kJ5jUzXq2w":{"text":"The Sazerac was very good, the southern gentleman is better! It wasn't a great environment","useful":1,"cool":1},"FZS5L5KI93DlQmHiOSgk2Q":{"text":"A consummate hotel bar/lounge, there are plenty of places to sit and mingle on couches as ","useful":0,"cool":0},"Lv1GcNLz2C6dhXOjQ6HNQQ":{"text":"Five stars for the elegant space and great cocktails once we got them. The room was packed","useful":0,"cool":0},"uBmyYmc2xPm1EJz8HruIiQ":{"text":"As guests at this establishment we were treated incredibly poorly by the bartender, Andy a","useful":4,"cool":0},"ph3JiTMz6NORa0Q0kc17XQ":{"text":"Great spot to check out at least once while in New Orleans! Decided to go to this iconic b","useful":0,"cool":0},"011S2_Z3YYTLejF5GtalIg":{"text":"Great place to have a classic cocktail.  The bar is elegant and the service good.  Try the","useful":0,"cool":0},"OL2g8lyux7AMLPKOP7k5aA":{"text":"A great place to get a real drink! The bartenders here make cocktails, they don't sling dr","useful":0,"cool":0},"rviMXeDNaOhV6XICUqZmtw":{"text":"This is a fantastic lounge in the beautiful and historic The Roosevelt hotel. The drinks a","useful":0,"cool":0},"dnVECSoJyV71QCMwXsFAew":{"text":"Love this bar because it's classic fancy New Orleans. The history of the place is fascinat","useful":0,"cool":0},"yqylNY-Oznd_Hm7PLt9gfA":{"text":"Walk over here to check out the Roosevelt's lobby, but walk right by the Sazerac Bar when ","useful":0,"cool":0},"06oIqFzSU_iFzXg4C6waYA":{"text":"We came here on Friday night and found seats on the couch right away. \n\nThe bartenders do ","useful":0,"cool":0},"9Le7YtACG-8WlqWJ_Qtpqg":{"text":"Great stop on our cocktail tour. We had a Sazerac and a Ramos Fizz during our visit. Well ","useful":0,"cool":0},"F32jM2xtb0gAhX2ze9IGDg":{"text":"Lovely bar. Good bartenders.\nI didn't personally enjoy the Sazerac cocktail, but no biggie","useful":0,"cool":0},"Jv-_CzthhKQCCNzFgxyDCQ":{"text":"I didn't spend a whole lot of time at Sazerac, but I came here after a lovely dinner at Do","useful":6,"cool":3},"fXV0EJC7_cmqpOo25-X3vw":{"text":"Unfortunately, the head bartender here ruined what is otherwise a very nice bar.  He has t","useful":0,"cool":0},"XsBASCnApGZQWDZASJ9QlA":{"text":"Coming here is like stepping back in time.  The dark wood and the glass feel you're gettin","useful":0,"cool":0},"lSIkYbKXouu4-CXt5gcDKg":{"text":"Sazerac is 14 bucks.  If you've never had one, it tasted kinda like a Manhattan to me.  Al","useful":1,"cool":0},"it7lnUkbPQJ61k1PHpY87A":{"text":"Apparently, this place is famous.  The bartenders do an amazing job, and the drinks are ve","useful":0,"cool":0},"QEAS_tOIoe6LRwgJJjWSsA":{"text":"Visited for a cocktail while in town for a conference and to see the sights. It did not di","useful":0,"cool":0},"9mT5jalXxgkIVIV3mBN-FA":{"text":"Great ambiance and even better sazerac! The drinks are pricy but knowing it will be one of","useful":0,"cool":0},"E9mJmM2vQCaWhwPmSmWKLg":{"text":"I'm a huge fan of cocktails, cocktail history, and classic cocktails (yes I read books abo","useful":0,"cool":0},"pKPp-uS7rvetGzOCb-Ltiw":{"text":"So I have been holding out for a very long time on ordering a Sazerac anywhere until I had","useful":0,"cool":0},"9bvKWZh8pIT4x7JbFTf2Qg":{"text":"This is the place where the first cocktail was born. Beautiful hotel houses this bar. Thei","useful":0,"cool":0},"RtHjckDapVr3qj5OHCFrSw":{"text":"Phenomenal bar. Amazing ambience and the cocktails are well made by knowledge bartenders. ","useful":0,"cool":0},"-yoc9RHhI5z2AAkYHqehrw":{"text":"I've had sazerac all over the country, and I can say this was the best I've ever tried.   ","useful":0,"cool":0},"SceUO09dM8t7e5SKTyHnJw":{"text":"Amazing drinks, really great service!\n\nWe've been getting into cocktails and have been doi","useful":0,"cool":0},"-y4USQgVSfzgqZIwi1pBnQ":{"text":"You can't go wrong with any of the fine cocktails here, but when at the Sazerac Bar, be su","useful":0,"cool":0},"01Cz6NyzZksxxCUjOSqBEw":{"text":"We had a business lunch there with a client.  The lobster roll-Iike sliders that I had wer","useful":0,"cool":0},"K57lZxla7hnxjsg6Om4A8w":{"text":"Everyone must try the Sazerac - it is the original cocktail according to legend. Not that ","useful":0,"cool":0},"eJgzMkorUfs47gfVRFhlJg":{"text":"The bar side is a high end cocktail bar in a high end hotel - they make a good Sazerac and","useful":2,"cool":1},"puoKSh-fHwApYBjv4Wx9FQ":{"text":"This place gets 5 stars because of high quality of the cocktails, while the scenery, ambia","useful":1,"cool":0},"tZA_J1zWz77u8iZf3slw4Q":{"text":"Very elegant bar in the Roosevelt Hotel.    This is classic cocktail making at it's finest","useful":0,"cool":0},"xhyOjrcwe-N2JB3kfRbFww":{"text":"What can I say about this place that hasn't already been said?  The decor and ambience is ","useful":0,"cool":0},"kjARe-vB_t_JMSUp_Ta0ig":{"text":"Quentissential New Orleans - dark, cool, comfortable. Love this place because I  saw the s","useful":0,"cool":0},"QJ1N5_HpDC-z8R3huNLj3A":{"text":"I mean, it's the Sazerac Bar. It's an institution. Huey Long used to hang out there. The l","useful":0,"cool":0},"ngRjNWDhZTt93tnd2z73Hw":{"text":"I stopped by here a couple of times when it re-opened in 2009 and had me a few real proper","useful":4,"cool":3},"hUgJt13gEQsYlkgKihJZ6A":{"text":"I just don't get the hype about this place. I it's a pretty cool space, lounge style,  rem","useful":1,"cool":0},"DJ5JgOcsMPQrCQBJKcaLtQ":{"text":"A very upscale place and very good cocktails. A nice upgrade from the Bourbon Street scene","useful":0,"cool":0},"Lf6INife5jbGhoOoVwQGwQ":{"text":"I came here for the original Sazerac and ended up ordering bunch more drinks over two nigh","useful":0,"cool":0},"D2woehyWdezEV8bkVxCKLg":{"text":"Tried the sazerac and Ramos gin fizz. Bartender was fabulous at making both and very profe","useful":0,"cool":0},"GR70utIu8mEtxA8njoXc2w":{"text":"Nice bar and pricey I had great service from Benjamin who made a great drink. Ron Zacapa d","useful":0,"cool":0},"H8PM96svsFQqFgqDEma_Ww":{"text":"sazeracs and gin fizz both were excellent! Old fashions had a cool twist and worth a try t","useful":0,"cool":0},"SvcDBTs_BB4cddvPG9wYCg":{"text":"Stopped into this famous bar for a craft cocktail on our visit with friends to NOLA.  The ","useful":0,"cool":0},"9htt8fKKKG07eBPszNMg4A":{"text":"The Waldorf-Astoria of New Orleans. Located in the famous Roosevelt Hotel, home of the fam","useful":11,"cool":11},"JuoDPXUjrZZMVLbTMnZA9A":{"text":"Gorgeous hotel and bar, with beautiful murals from the 20's-30's era.  The bar tenders wer","useful":0,"cool":0},"5TiiwciOFWRVpolxY8tS6Q":{"text":"Come in here and you'll be transplanted yo what seems like 1930s NYC which was interesting","useful":0,"cool":0},"uDTeZxn8xtFgNcco3QpLNQ":{"text":"We really liked this bar. The waiters are so nice and the drinks were amazing! I had the g","useful":0,"cool":0},"0gIelTLaAY2saBHN4hBDNA":{"text":"If you enjoy being insulted by rude young bartenders, do not miss the Sezarac Bar.\nVisited","useful":0,"cool":0},"r26al7AiQfTYp-XKq3JQUw":{"text":"This is a review of the bar.\n\nThe Roosevelt is a GRAND HOTEL but the bar is just WAY TOO S","useful":0,"cool":0},"B6_bkrJ4qhYw3K4waTLCfQ":{"text":"Snazzy place that throws you back in time! Really my favorite thing here is stopping by la","useful":1,"cool":1},"fumoXH2fVrtQZsoKKL5ISQ":{"text":"Bryson is amazing. He recommended the Corpse Revivor #2. Very unique and awesome! Bryson w","useful":0,"cool":0},"gJuwmm_3f7ptTqgD6g0IiA":{"text":"You must, I mean *must* try the signature drink \"the Sazerac\". Ask for Tom. He's going to ","useful":0,"cool":0},"IXvSNi7Yr76r_V71S8N65g":{"text":"Everyone once in their life needs to experience this bar. It is a thing of beauty and a th","useful":0,"cool":0},"EdzJDoKtSPtvtSdxOS0Lqg":{"text":"Another historic New Orleans destination. Famous for the Sazerac drink in the aptly names ","useful":0,"cool":0},"REZqhBlAD7p-Cc0WPQZwaA":{"text":"I'm shocked by the anti-southern hospitality here. I was celebrating a friends 30th birthd","useful":2,"cool":0},"T7xAX7rUZrcHftCJZ5Kdhw":{"text":"I had been craving a Ramos Gin Fizz for a while, and this was the best I've ever had.  Lik","useful":0,"cool":0},"2HhUjZhTT_V767wg0BdQXQ":{"text":"This lounge can only be 5 Star. It drips with old world ambiance and charm. I will always ","useful":0,"cool":0},"ldecIFE1JEqH3_9z8FTapg":{"text":"Our first night in NOLA, we stumbled upon the Sazerac Bar in the Roosevelt Hotel.   Becaus","useful":0,"cool":0},"80o0wFUR24hAHHwjICCAvg":{"text":"We rolled into this fancy art deco style bar in the lobby of the Roosevelt Hotel with a gr","useful":0,"cool":0},"9mV7vpSMBpRF_kIwP3zpCg":{"text":"You want swank, you want style, you want class, you want a timeless luxury, and you want t","useful":5,"cool":0},"GN0WTvz11SQ7sG0LeVrbgg":{"text":"Classy place, great vintage bar. The 1800 Manhattan was complex, smooth an definitely wort","useful":0,"cool":0},"Pi6_V5UKgVVSDfgc-Pyf5w":{"text":"Nice swanky sexy old-school lounge. Great cocktails - trust your bartender!\nEnjoy the oppo","useful":1,"cool":2},"dLn5yWjajpS4EhumbvQZxw":{"text":"Really classy bar with awesome bar tenders.\n\nA must experience when in New Orleans and be ","useful":1,"cool":0},"MokN4BNa3WTvBDVZEMg7FA":{"text":"This is such a classy bar. It feels like you are stepping back into the 50-60's. They make","useful":1,"cool":1},"NWAQLgtNyEp2nGBrawbblg":{"text":"I had to try the Sazerac so as a tourist in New Orleans,  I needed to hit up the source.  ","useful":0,"cool":0},"zT48APZ00VjPEYu26YOH4g":{"text":"This is a must in New Orleans.  Whether you are here on business, pleasure, with a group o","useful":0,"cool":0},"cJPv_xVnefEzUai6DTUgSA":{"text":"Take the great ratings with a grain of salt. I heard management let go half of long-time b","useful":1,"cool":0},"hdN5mKfEPFVersIN26hKqw":{"text":"If you like a good old fashioned, you're gonna love a sazerac. And what better place to ge","useful":0,"cool":0},"GEnC8i_ExmDxWIITHf1fwg":{"text":"Pretty terrible. We were so looking forward to going since they are known for sazeracs and","useful":0,"cool":0},"6XVvj2-fzuaaURg-TA-CuA":{"text":"Great drinks,and atmosphere in the beautiful and historic Roosevelt Hotel.  They do a grea","useful":0,"cool":0},"UM-vLajlwTzYSN-szs1SVg":{"text":"Beautiful space, expertly crafted classics and palatable atmosphere.","useful":0,"cool":0},"XnEvMeOc6_dLzMJeTQBpvQ":{"text":"One of those old-school, \"original\"-type places which lives up to its reputation, without ","useful":0,"cool":0},"ebU9Rb8wiSRLTAZLg9afEA":{"text":"We had to try a Sazerac while staying at the Roosevelt!  Very classy bar with very classy ","useful":0,"cool":0},"Okx_VFms4hZF5E4Ke90ZLQ":{"text":"Excellent old fashioned and ambiance.  A bit over priced but it's in a hotel so expected. ","useful":0,"cool":0},"5eRLEyrNOBJnxcMk2__rQA":{"text":"This place is so rich in history. Imagine a place that simply espouses cocktail \nhistory. ","useful":2,"cool":0},"mn_qoNAhtRC1aUyIvXkgxQ":{"text":"Swanky and fun! Lots of activity and great bartenders (making great drinks!) If I were a l","useful":0,"cool":0},"wRtD5pVFDN-O2hp0d98hyQ":{"text":"Nice bar in The Roosevelt that served stiffed drinks.  The bar is loud though so we had to","useful":0,"cool":0},"yxEdNT-GfiAZBsVaE-xUpw":{"text":"One night when trying to decide where to go, one of the guys in our party suggested here. ","useful":0,"cool":0},"zB8PzsNTfQ7sbT9v3gGl4w":{"text":"Best Ramos Gin Fizz you will ever have. Sazeracs were great as well. Knowledgable staff le","useful":0,"cool":0},"A8I23iVKsqGStlqeUuUQIA":{"text":"The gin fizz was delicious, the people watching was excellent, and the place just has a re","useful":0,"cool":0},"DmeRimRoqW6KRTtrSKOHDQ":{"text":"If you are into traditional old school cocktails  or real drinks served with pride, this i","useful":0,"cool":0},"ddDQbr9rdtPUZveUOXsTWw":{"text":"This was a fine and relaxed breakfast venue with very good service, excellent food, and lo","useful":0,"cool":0},"Bey3L4oFUJQq_ncIScMwWw":{"text":"Total meh. Watered down cocktails and pretension. There are many much better bars with sup","useful":0,"cool":0},"vFVBILNDwEL-JzgBF0xLyQ":{"text":"This is a review of the restaurant. We're staying at the Roosevelt and woke up too hungry ","useful":1,"cool":0},"iP-cpoHRix57UhJl5QTauw":{"text":"Ah the Saz. It's my favorite bar of all New Orleans. It's intimate atmosphere, classy yet ","useful":0,"cool":0},"lrY_r3njtSX8uhFe3LRgfQ":{"text":"Probably my favorite cocktail bar in NoLa! The bar is dark and feels like a proper cocktai","useful":0,"cool":0},"jVBcNb_K6rwQNm1ldP6IJA":{"text":"We came here on a rainy afternoon to enjoy the bar's namesake drink, which I have often ma","useful":2,"cool":1},"-KqIVoaVIxyaiMBJdMmwpg":{"text":"Dark, old beautiful. Great place to get a drink with the person you love. And the best Saz","useful":0,"cool":0},"q2XSkGNvt1kirUJU5kuvlw":{"text":"Classic bar that we stumbled upon because we were staying at the Roosevelt.  It's definite","useful":0,"cool":0},"wFk9p0bNApVAvtg5AncjcA":{"text":"Fanciest bathroom I've ever thrown up in.\n\nSazaracs are not for me.  But the bar was super","useful":0,"cool":0},"FfBYm_O5sHotBV4chIOyxg":{"text":"This is the typical hotel bar.  The guys next to us (all in suits) were high-fiving over t","useful":0,"cool":0},"IyGHH3Xx26Nq9KCrvm7cUw":{"text":"Excellent rye-based cocktails including the eponymous quintessential adult beverage which ","useful":0,"cool":0},"xyehyLDIpnXe4L5nkAQq3Q":{"text":"Great after dinner, start your night off roght bar, knowledgeable bartenders and well mixe","useful":0,"cool":0},"L3Xh3JtRrAjCqDQ-YjqsXw":{"text":"Oh the sazerac bar and grill. We made some memories there -- and lost some too. We started","useful":5,"cool":6},"VFyJUukWfKxCk5Ol3b9oNg":{"text":"This place was incredible!  The hotel is exquisite and the holiday decorations made it eve","useful":0,"cool":0},"yut8cxrdIpLMQsmSg_3Xiw":{"text":"What a fantastic place for drinks inside the Roosevelt Hotel.  This was on our list of pla","useful":0,"cool":0},"scieCWmF1WGv3VBAkDGdMQ":{"text":"I keep forgetting that this place reminds me of a submarine full of douche bags. 2 stars f","useful":0,"cool":0},"kd2ctKuTu8PLB3hHkOqcsQ":{"text":"We went to this iconic bar at the Roosevelt. Drinks were good but kinda expensive. Service","useful":1,"cool":0},"goNFP2FTBCKJTBvhyh_T9g":{"text":"Swanky upscale mixology at its finest! A go to spot for all Sazerac fanatics, as this is t","useful":1,"cool":1},"mlk4U-8KZQz0Ta39X7jgCg":{"text":"We stayed at the Roosevelt for a wedding, and I made sure to stop down at the Sazerac Bar ","useful":1,"cool":0},"YyeCEZbe_wgByRdeRXfwIA":{"text":"Legendary bar. Home of the Sazerac. \n\nVery pricey but a classy place and the drinks were v","useful":0,"cool":0},"8smS0yWxrWgQo03KzisePg":{"text":"Mellow, broody ambience. Would be great for a first date. We had a couple of drinks here a","useful":0,"cool":0},"S0m_mZXGpW4kVT66xPHgHg":{"text":"Swanky, gorgeous, and sophisticated. This is my favorite fancy cocktail bar in the country","useful":2,"cool":2},"Vi4XKp8Q1hUuMhatzFml9g":{"text":"Visited this beautiful place twice during our stay. My guest enjoyed the Sazerac while I e","useful":0,"cool":0},"5MsMcVKckEHv-V7Dxq8liw":{"text":"This is the first place my friend and I visited. We both ordered the Sazerac drink and it ","useful":0,"cool":0},"WoMsAV4a5Pq15z6FAOHUaw":{"text":"I had my first Sazerac in Atlanta about two years ago. I have been reading about bourbon a","useful":1,"cool":0},"FpVSfBMWFBDUB5YNO01QMQ":{"text":"This is my favorite bar in New Orleans.  When you walk into the Roosevelt Hotel, you feel ","useful":0,"cool":1},"tBG7Dw4ZoCa_3vr4TXgCNg":{"text":"Not worth it. Overrated. \n\nCame here to grab a drink with my girlfriend. Waited 15 minutes","useful":0,"cool":0},"rMJ1YkX4btgiJ64rM-m7ng":{"text":"The sazerac is one of my favorite cocktails of all time. So of course when I come to the c","useful":8,"cool":5},"FKxspB-_H6jKABIY_aM9ww":{"text":"Excellent, atmospheric bar during the off-hours.   1930s Mahogany, speakeasy decor.  Knowl","useful":0,"cool":0},"bcInqUEtqIqVeT9iDt92bg":{"text":"Well, you don't need me to tell you to order a Sazerac at the Sazerac Bar. I did, of cours","useful":17,"cool":17},"db1uiu1U01B7iLllcbmy8w":{"text":"This is the kind of place I could spend A LOT of time. It's like being transported back to","useful":2,"cool":0},"dJzduP0PmD1BVeL0eLOZfA":{"text":"The overall feel of this place is calm and relaxing. It's really a great place to bring so","useful":0,"cool":0},"XyispWEkc8wKpBpU2fJ8Ng":{"text":"Went with my boyfriend because we wanted to see the place and try the iconic NOLA cocktail","useful":0,"cool":0},"Nw19H465Hw0hGFuRNviFkg":{"text":"Wonderful specialty cocktails - christmastime ones are my favorite. The only reason it doe","useful":0,"cool":0},"XO7TQLzUASj3hZk298FufA":{"text":"You must go here and have a cold drink. Atmosphere is amazing. Hotel is gorgeous. Decorati","useful":0,"cool":0},"T8NjhMEFz57-co_0KCTuaw":{"text":"Bougie hotel bar to order bougie drinks so you can be....well bougie and frankly a little ","useful":7,"cool":7},"UqMQso5ITeRg6dMg2r16YA":{"text":"This is not just a fancy and historic bar. This is an experience. Come with me while I pai","useful":9,"cool":9},"oLOH-oTllWiZAPFQx4Beig":{"text":"The Sazerac Bar is touted as old school New Orleans, and it definitely delivers!  I have b","useful":0,"cool":0},"6P2roJUYP3CFVXi82ymMQQ":{"text":"I enjoyed my time here in the bar.  I didn't stay for a tremendous amount of time, but sin","useful":0,"cool":0},"zO-llm0URrpwRYJjpDojWw":{"text":"Swanky joint!  Appreciate the history of the bar and the setting in the beautiful Roosevel","useful":0,"cool":0},"qQlAO2m_MTRg6aNjSPRjug":{"text":"Meh, a little too stuffy for my taste and I've had better Sazeracs. Decor is gorgeous and ","useful":0,"cool":0},"aPZzu8_i5KRvIMWn4bkmJg":{"text":"Went on New Year's Eve with a group of friends for some pre-party drinks before heading ba","useful":1,"cool":0},"x1kJjHOxwImFElYpYd8wwg":{"text":"Wonderful breakfast in a classy setting.  The Southern Eggs Sardou was a perfect start to ","useful":0,"cool":0},"lZEk3Rlg0R3Rk7SsxZIJtg":{"text":"I love the Sazerac bar! I've been here many times, and I think it's one of the best people","useful":3,"cool":2},"5_rUgjPyqKhHdX2Y29UBTw":{"text":"Great bartenders, fantastic drinks.  Love the decor.  Did I mention they have amazing bart","useful":0,"cool":0},"1-Hpn65jD2y1nXqmcN26qw":{"text":"Great prix fixe lunch! Nice atmosphere in very historic landmark. Great service thanks to ","useful":1,"cool":1},"B9FIOdX2ywbViBtWeZjqOQ":{"text":"So this was a classy place.  It was neat to check out the old decor and I totally felt lik","useful":0,"cool":0},"wtkncwP_3VMJqZ6uAHNhFA":{"text":"I just don't get the hype about this place. I it's a pretty cool space, lounge style,  rem","useful":2,"cool":1},"ZQbP19_k6BTguor-7jsEuA":{"text":"Sazerac Bar is an upscale lounge/bar located in the Roosevelt Hotel. Make sure to be dress","useful":0,"cool":0},"nonEiOZ2OwV3qJcrzCkFig":{"text":"The Sazerac bar is like going back in time. There is a lot of history there. Be aware that","useful":0,"cool":0},"mgY8xFRZDmSXLUkNGMRHvQ":{"text":"The bar is cool and the hotel is gorgeous, but, it's so ridiculously expensive. $16 for a ","useful":1,"cool":0},"CmryENB207Vujatu4PEEPQ":{"text":"First time at this iconic place. It's of course pricey but by far the best sazerac I tried","useful":0,"cool":0},"Hd8IlGHBZDvPDKY1uqRC3w":{"text":"Sazerac Bar is the definition of class. Located in the Roosevelt -- a gorgeous, historic, ","useful":4,"cool":4},"vZlnP2HJTcYoi940PdJoOA":{"text":"Pricey, but excellent drinks. The Ramos gin fizz I had here was perfection- and the \"south","useful":2,"cool":0},"JdMiQ8fZPoYrXvxSo0pSjA":{"text":"I don't care who you are, it's simply a must do!\n The aroma of the Sazarac can't be beat!","useful":0,"cool":0},"hktky2SLgLEUt08hCC9VvQ":{"text":"Great room!  So glad this hotel was restored in grand fashion.  The sazerac was a bit on t","useful":0,"cool":0},"ANomrUgT9G6gHgq7cNOsDw":{"text":"This place is fabulous...  if you like hanging out with wanna-be Don Drapers who are actua","useful":0,"cool":0},"owd91qVs3UO2XFZDwjRwTA":{"text":"Really nice hotel bar.  Drinks are a bit pricey and folks are a little more dressed up her","useful":0,"cool":0},"YzERD7RNGG496S_QW4POWg":{"text":"I've been coming here for years. But am now moving on. \n\nYes, it's offensively priced. But","useful":0,"cool":0},"8Od89OeUPmBk_SjAMh0yJQ":{"text":"Upon my 2nd annual girls trip to New Orleans, having a Sazerac at the bar was on my \"must-","useful":0,"cool":0},"bMQb8nzb4hRQpWn-HIl2SQ":{"text":"Order the namesake and don't look back. \n\nThe place invented the sazerac and the bar tende","useful":1,"cool":0},"lE6x6GlH1RK_rIci4AJtvQ":{"text":"Ugh. This place . \n\nWanted to get a Sazerac - and where best to do it if not at the Sazera","useful":1,"cool":0},"nEKMJW6u0ZZlAngtl1x9qQ":{"text":"Awesome bar with a great bit of history.  Pricey but worth it for the incredible atmospher","useful":0,"cool":0},"y4SQnZDMPQYyg2NAA787PQ":{"text":"I stayed at the Roosevelt for several nights, and had read about this place on yelp, as we","useful":0,"cool":0},"2gQNgRwfpuiKuoJ3L25faQ":{"text":"Oh my! This was the best drink I found in New Orleans. Being from Las Vegas and New York I","useful":1,"cool":0},"apN0k8szkxrOcKINJ_lnWQ":{"text":"Great service. Always a treat watching the mixologists prepare drinks. Obviously the origi","useful":0,"cool":0},"_jZvJBIF46fEX_ADFOFofw":{"text":"Drinks are definitely tasty and priced at $11-16. Decor is so-so and the service can be sl","useful":0,"cool":0},"E7Z0V_27hfAcs1EHPLhE7A":{"text":"I love old school hotel bars and the Sazerac fits that bill perfectly. They have a long li","useful":2,"cool":1},"VDlAXzGAWL0oG3JP1uEipQ":{"text":"The Sazerac is one of my favorite cocktails.  It is a great example of a simple drink that","useful":1,"cool":1},"8Vk5izgxSuAn_OGlotOwRw":{"text":"What's a better place to get my first Sazerac at...Sazerac? JK...Probably a few things bet","useful":1,"cool":0},"ci8SW3PFuLVYflXqCijVrQ":{"text":"Fancy little place in dt NOLA.  The hotel it's in was decorated amazingly for the holidays","useful":2,"cool":1},"QP5xoXO3ueglM7iWdIHpAA":{"text":"Vintage style, and an amazing drink collection.\n\nThe sazerac was, of course, excellent.  T","useful":0,"cool":0},"4ITGlHom5gqqUM0wN5FpMQ":{"text":"We decided to stop in to Sazerac Bar last night after dinner (at Dominica - highly recomme","useful":2,"cool":0},"SWeFqVZqUpEB1hj27fl_Mg":{"text":"If you want a Gilded-Age, Prohibition-style, old-school jazz club bar, Sazerac Bar is righ","useful":2,"cool":0},"aN5DLp45uWFsHqm08fOBug":{"text":"A very, very classy restaurant with the pizazz to back it up.  I highly, highly recommend ","useful":0,"cool":0},"cWaoe2vD0FG4c7WKi-7Kpw":{"text":"Located inside the oh-so-classy Roosevelt Hotel, the Sazerac Bar is a great place for expe","useful":0,"cool":0},"r6pvHupkgdhN8pFRzarggg":{"text":"The Sazerac Bar is located inside the historic Roosevelt Hotel. The bar was packed on the ","useful":17,"cool":11},"46fvz0PDXBTDmccgAEqWpg":{"text":"Best Sazerac anywhere. Love this hotel. The hotel is amazingly beautiful at Christmas time","useful":2,"cool":2},"8ym4OdGSdvEpBypG0bOIXg":{"text":"Had 2 Sazeracs with the ghost of Huey Long last night. He paid for the second round, but I","useful":0,"cool":0},"mxN0LurHRrabqgINierEpw":{"text":"Elegance in historic hotel bar room with signature cocktails. Huey Long drank here. If it'","useful":0,"cool":0},"Bl5FN6IQF5rg1ctBIwUgsQ":{"text":"We went on our first night, as my SO loves sazeracs and this is the original.\nThe ambiance","useful":0,"cool":0},"MlPzLZhfLiqB0siowAhYZA":{"text":"We were dressed very casually so we felt a little out of place in the elegant bar, but the","useful":0,"cool":0},"EcykhM2kzsYXBEqR7WGp1Q":{"text":"Okay, if you're staying at the Roosevelt, or even if you aren't, you owe it to yourself to","useful":1,"cool":1},"jyJ0H_GLhBeCa8Oj0iqxLQ":{"text":"Classic New Orleans spot and a welcome little retreat from the nightlife madness.","useful":0,"cool":0},"oSdd54EQ1kyXtl-W5TbsVA":{"text":"If I ever make a lot of money and can afford to drink here more often than once in a blue ","useful":1,"cool":3},"BfJncrzSkTxca8Y6Cv5Ogw":{"text":"This place is as classy as it can get. We decided to stop in before going to a show at the","useful":1,"cool":2},"qSYtBCg_TRokgoxhxyE6vw":{"text":"A little bit of an older crowd in here... at least when we came in.. but located in the ab","useful":0,"cool":1},"o0ctb_-GkaXyeSLUlazulw":{"text":"This place is great, they serve up all the classic NOLA cocktails. Limited seating, and po","useful":0,"cool":0},"YpYs0zLwyYPcJx-nDx_hQw":{"text":"Located in The Roosevelt hotel, Sazerac bar is a historic gem that will give you the feeli","useful":1,"cool":0},"a2aLVeljLjchXtKawV8osw":{"text":"If you want a pretty good Sazerac (not the best in the city) with a slightly older crowd i","useful":4,"cool":3},"fz2Ds_ETOT9-7XWQu6lfzA":{"text":"Great atmosphere. Delicious drinks. In a beautiful hotel. What else can you ask for. The b","useful":0,"cool":0},"cTwlokjCfj6eEvcBn_9QAw":{"text":"This bar defines the word charm. The creative environment is literally from top to bottom.","useful":0,"cool":0},"NT83J7D1m2GHGBT0i06P1g":{"text":"This is a bucket list place. It's more for tourists than locals in my opinions but you sti","useful":0,"cool":0},"xAC_kG9Gobv1cKunOXnM9g":{"text":"The Sazerac is a classic.  You HAVE to at least come here once in your life, but beware, t","useful":2,"cool":2},"45sSYLEO3KJs93XYkJXBQA":{"text":"Located inside the Waldorf Astoria Roosevelt Hotel. You'll first be mesmerized as you mean","useful":2,"cool":1},"nEmjwF3iXaCyhFZ6vteCHw":{"text":"Holding the same name in which most people think was Americas first cocktail the Sazerac b","useful":9,"cool":8},"PMLFwaLSlOp-oa99M_RRiA":{"text":"What a place! I felt like I was walking into a Noir movie. Granted, the bar was having som","useful":0,"cool":0},"SFA8WVv1EU_hAsUg-g08xA":{"text":"We stopped for drinks before a dinner at Domenica while staying at The Roosevelt. \n\nThe ba","useful":0,"cool":0},"WvJE2n1lYcAuGOUflVPTSA":{"text":"Beautiful vintage setting and great place to have a classic cocktail. This place encompass","useful":0,"cool":1},"G5rO3DEcfYulTFOIusqbag":{"text":"A throwback. One bartender running a show multitasking like no other. The gin fizz was one","useful":0,"cool":0},"SI0xmK2v3AnbIYn3qEzKRQ":{"text":"Located on the ground level of the Roosevelt Hotel, Sazerac Bar and Restaurant is an upsca","useful":0,"cool":0},"j-qS7H__rqXSRa4Es_jkSg":{"text":"I rarely blast a bar or restaurant   I almost always give positive reviews.   My experienc","useful":0,"cool":0},"ab9Z4XV0sGGCif6LC15T8g":{"text":"Had a fantastic time here! Drinks are top notch in a beautiful Art Deco room. Shoutout to ","useful":0,"cool":0},"fBVeg1mnio5cD_P-WkM1aw":{"text":"Hidden spot within a hotel, that serves strong libations.  Came here with some friends for","useful":0,"cool":0},"gfh5FlWcJq3sn6chANAYcQ":{"text":"Located in the gorgeous hotel of The Roosevelt. Sazerac Bar makes some of the best cocktai","useful":0,"cool":0},"uHHD74q05TgzsbzFrVMD_w":{"text":"John and Rachel are very helpful. Enjoyed the quality cocktails of Sazerac, French 75 and ","useful":0,"cool":0},"E8ObLBeOlYMm2mXib6nM_A":{"text":"The service was great, drinks were great and the place is just gorgeous!!! Since NOLa is s","useful":0,"cool":0},"eErU3K9AZ-cNmOwwfdtvlQ":{"text":"Best place in New Orleans to get a Ramos Gin fizz.  This was Louisiana Gov. Huey Long's fa","useful":1,"cool":1},"srwyjkyQLfgW5tEBfysG4Q":{"text":"It's a classic and I was determined to visit during my last trip to New Orleans.  I love O","useful":1,"cool":2},"fFTWx44lyAuOCWc8c-nnbA":{"text":"Of course you should order a sazerac at the home of that drink, but beyond that you have t","useful":0,"cool":0},"YtCpPaLlS3n1cx6NV8yFxg":{"text":"Outstanding cocktails. Highly recommended for any visitor to the city. Note that table sea","useful":0,"cool":0},"zlXxRUq2THtKZl4WSaasgQ":{"text":"It's not Christmas until I visit the Roosevelt Hotel to see the lobby all glammed up lined","useful":0,"cool":0},"BZnCZNl3l6ImnweAkmAI9A":{"text":"When in Rome or in this case New Orleans, one must have the official cocktail of New Orlea","useful":1,"cool":1},"3JWYepD35qRIVzjJxR1ggg":{"text":"I've been to New Orleans a couple times and this place is one of my absolute favorites.  N","useful":0,"cool":0},"g5mmejec14xkjc2T3K-_ug":{"text":"Tucked in the Rossevelt hotel this bar was completely restored, as was the hotel, after Hu","useful":0,"cool":0},"z_VV9MtFZQzt16_cXv2b7Q":{"text":"The drinks were delicious however the service was the WORST service in my entire life. Bei","useful":1,"cool":0},"pyzq1WcSlBcwS5BoTKO64Q":{"text":"Fun spot that takes you back in New Orleans history. The drinks are great and the staff is","useful":0,"cool":0},"gOTVG3KzWJJaLfrzjUH3xw":{"text":"Located in the Roosevelt hotel this is a swanky Art Deco styled bar with classic touches. ","useful":3,"cool":0},"ObCP-XA2_MIe8Ir6hZCDnw":{"text":"The Sazerac Bar in The Roosevelt Hotel is THE place to get an authentic Ramos Gin Fizz. Me","useful":0,"cool":0},"hEGEAvYu1SA_2esivSQq5w":{"text":"Nice place..strong as hell drinks. Good service!!","useful":0,"cool":0},"w8NQ5JbjWf6laha4-Vzbtw":{"text":"This place seemed a little too fancy for our group of 10 who were all wearing shorts and t","useful":0,"cool":0},"p9zRT0461meauYmPmrDnHw":{"text":"A bucket list item for myself was to have a sazerac at The Sazerac Bar.  Mission accomplis","useful":2,"cool":3},"Sh7K3nfA6ddywyPs8h-tOA":{"text":"First time in Nola and excited. Headed straight from airport and luckily got free street p","useful":5,"cool":4},"fw36CiSF7zjxiTqIwncQ2w":{"text":"You have to come here and get the original Sazerac. The decor and style of the bar is so s","useful":0,"cool":0},"BIoZ7EqqqTBvB9veNWmKRg":{"text":"Oh how I long for the sazerac Bar. We go as often as we are in town. No matter what we wor","useful":1,"cool":1},"E7KWXIR8JBcLauNhOPFHZw":{"text":"Drinks are delicious! Particularly the Southern gentleman and Gin Fizz. The gin fizz can t","useful":0,"cool":0},"pIA1C9aYDlCY136Tilm81Q":{"text":"First visit for cocktails before a show at the Saenger. Very nice ambiance, I've been want","useful":0,"cool":0},"23Pb5bXnursmBbbiPlGOlQ":{"text":"We stayed at The Waldorf Astoria Roosevelt and found this classy bar by accident. I would ","useful":0,"cool":0},"txcjRADuG5fkR1quYRP6TQ":{"text":"Overall, we found this bar too fancy and pricey for us. But I was really impressed with ho","useful":1,"cool":0},"aOC_zo4OAA-AgE07ZqIkGQ":{"text":"First time visiting NOLA and heard that the sazerac was the oldest drink made there. Tried","useful":0,"cool":0},"8aYFwIIupHyRHCjvfLZI9Q":{"text":"A regal bar, teeming with the grandeur of old New Orleans. Named after the \"cocktail of Ne","useful":1,"cool":0},"eDjlkVPLQGsxHOXdWEl6PA":{"text":"Beautiful historic bar!! Drinks were pricey but delicious. My only complaint was that they","useful":0,"cool":0},"1IaUBf9UZNyAP-lkj9s8fQ":{"text":"We always have a great time here. A bit pricey for their namesake but you get what you pay","useful":0,"cool":0},"NvcbalFlothdMeUpF5Iguw":{"text":"If you're not white, over the age of 50 and wearing a tweed sport coat, you will most like","useful":1,"cool":0},"BCaj75WuVbOnVs73wLybLQ":{"text":"Historical, beautiful, fun, great classic cocktails.....I love the Christmas cocktail spec","useful":0,"cool":1},"NBX3sCY8CNOA9POT8E0WQQ":{"text":"We came here on Friday night and found seats on the couch right away. \n\nThe bartenders do ","useful":4,"cool":1},"2VFley4sN1SDzE7LPiO_-Q":{"text":"Perhaps if you go to this place for just drinks, it's fine, but if you go wanting food, pr","useful":0,"cool":0},"NvMyaX1YI194YdldXK0Nww":{"text":"This is THE Sazerac Bar; home of the original Sazerac cocktail. This is definitely one of ","useful":0,"cool":3},"PfC2O1DSmzuB8UrdnwJO0g":{"text":"Rewriting this as it seems the one from June was deleted. Awesome service first off. The b","useful":0,"cool":0},"HLoAIIv0iJN5dLYNk0tJAA":{"text":"\"O Sazerac, with your deep hue of sanguine, enriching my hemoglobin with life.\" -Me\n\nI had","useful":0,"cool":0},"i6Osr9f_1WWJIgo25kbHSA":{"text":"Walking into the Roosevelt hotel transports you to a place of luxury that would have made ","useful":0,"cool":0},"prHRBTcACAZMf9om_lUrcQ":{"text":"This place takes you back. When you get into the hotel and the bar you feel like you are i","useful":0,"cool":0},"a-xUFEjbX0Jr6a7jnnm2NQ":{"text":"Great place for a sazerac, obviously! But the vibe inside seemed to have a lot of upper cl","useful":0,"cool":0},"5PaNyg4MsElsIj6aXXD6Kg":{"text":"We wanted to visit the bar in the Roosevelt Hotel because it was known for one of NOLA's s","useful":0,"cool":0},"nrdZXWfOjTgp8swC95v4Sg":{"text":"I love hotel bars. The good ones are warm and inviting and when they serve and are named a","useful":1,"cool":1},"qf0d20WRn9cb30mdhxsIpA":{"text":"Before heading up to our room, we stopped here for a night cap.  Although it was a little ","useful":1,"cool":2},"T6g95ENjzDZpWoo2xU2LtQ":{"text":"You can't beat it for ambiance. You can, though, find better sazeracs in town, and you won","useful":0,"cool":0},"qT-GGogrZDryybMmkd5jgA":{"text":"Just the best, the classiest, the most wonderful bar we've ever visited. The BEST View Car","useful":1,"cool":0},"sGy4--D-dC-nhQXvZYyyWg":{"text":"Great looking bar in an old beautiful Roosevelt hotel. But unfortunately, and somewhat iro","useful":0,"cool":0},"_vR96mtHlfzautxRLB7h4Q":{"text":"Came here because of the history of the sazerac. Hotel is beautiful and definitely worth t","useful":0,"cool":0},"aMdNbMsfv2wv5-52fWnn9A":{"text":"Not a fan of drinking your cocktails out of fish bowls? No interest in guzzling frozen, al","useful":0,"cool":1},"tThLJAW4fJJrF6wOw1klKQ":{"text":"The Sazerac Bar sure has a way to make a gal feel fancy, especially after spending a lot o","useful":3,"cool":3},"j2bZiP3eJHm6etIS--IQ-g":{"text":"If you enjoy well crafted cocktails, it would almost be blasphemous to make a trip to New ","useful":9,"cool":7},"VP1DEg_5ThlD1ULqbfrb5w":{"text":"The staff is very friendly. The gentleman that helped me no it only explained my drink to ","useful":0,"cool":0},"tHCSalg7u6q9eD_gghw8ww":{"text":"Great service. Bartenders and wait staff are awesome! 4 drinks were $75.... Says it's a $$","useful":0,"cool":0},"8drkSDTP2NY5_9-CCJCSlg":{"text":"How is it even possible I have never reviewed this bar!  I can honestly say that I always ","useful":15,"cool":13},"wKz65IJCETxX1pos7EXWRA":{"text":"We came to the Sazerac Bar late on a very rainy Saturday afternoon on my first trip to New","useful":1,"cool":0},"xKyby80zMxPsJEfdpLFaOQ":{"text":"We stayed at the Roosevelt the week between Christmas and New Years (MAGICAL!). Several ti","useful":0,"cool":0},"ZmxWSilYDX-JE7M6O8IbXQ":{"text":"Awesome time at sazarac bar! Lots of history and PERFECT GIN FIZZ (oh and that sazarac dri","useful":1,"cool":1},"2KuR2yRp2CtkHJ6LKu7hvg":{"text":"~~~Sazerac Bar in The Roosevelt Hotel~~~\n~~~The Sazerac Cocktail~~~\n~~The Official Cocktai","useful":25,"cool":21},"qVjbINsALksKiThr-Dh3KA":{"text":"A wonderful unique place to experience high end liquor. Don't be in a hurry when visiting ","useful":0,"cool":0},"bw5f9AzsAebq20UGDYR52A":{"text":"Definitely something to experience. The mere ambiance and history are something to go for ","useful":0,"cool":0},"fdOwlDiLSwDg1fTbQU0Bpg":{"text":"I've walked into and past the Roosevelt many times, and if you go in during the Christmas ","useful":1,"cool":0},"pEgtX6hCw22L4WcvQ9ltgA":{"text":"We liked the atmosphere and vibe. Great drinks. We had a sazerac, French 75 w/ cognac, RIP","useful":0,"cool":0},"V1p3_HsGbbc6UkcOpPj-JQ":{"text":"Cocktails were fine but the bartenders were extremely arrogant and rude. I would not retur","useful":0,"cool":0},"1YagH1LPypzwmSQfzCa3Ag":{"text":"I came for a Sazarac and that's what I got! Strong but flavorful. Come Covid ready with yo","useful":0,"cool":2},"7OJENoOqvJyzFBWKzry3dA":{"text":"Love this place! I first heard about the Sazerac Bar on Esquire's Best Bars in America sho","useful":0,"cool":0},"g5MYLm2W8p_2tZxH2DrDlg":{"text":"Ack! *This* close to being the 200th review. Oh well...\n\nI came here and *didn't* get a sa","useful":10,"cool":10},"GBIYMKO4xpKGxu4V7nix0A":{"text":"Best bartenders in the city.  Great service, professionalism to the enth degree without a ","useful":0,"cool":0},"rgvQxCW6ZELhAeIUn3r7RA":{"text":"There are no words to describe how good the Christmas Cookie cocktail and the gin fizz rea","useful":0,"cool":0},"iX71Ctysrgrz2XhWxAt9dw":{"text":"Best Ramos Gin Fizz I've ever had. All my friends liked their cocktails, too. This was the","useful":0,"cool":0},"4X5pdfqYzAzGDm-GiGS4_Q":{"text":"Over price, inattentive service. My old fashioned was much tooooooo sweet and my old fashi","useful":1,"cool":1},"CpkiUtLf4Ln57ILtl7e6lw":{"text":"I love the Roosevelt. I've stayed there, gone to pop up restaurants on the roof. It's just","useful":0,"cool":0},"Aeled-ea0c4CXFkdlgoONQ":{"text":"Classy bar with fun bartenders! We visited Roosevelt hotel on Christmas Eve for the beauti","useful":2,"cool":1},"WW6gtbK2zLZlmmQ1iJICCw":{"text":"Beautiful bar, indeed. The wood paneling (not like in your dad's study, we're talkin Afric","useful":5,"cool":5},"cPRC4B-4nnLvRx2Y9kbswg":{"text":"Maybe I just went on an off night, or maybe it's just not my style.\n\nI couldn't hear any m","useful":0,"cool":0},"S05yDGR6cvR0ZFJVD-qkLA":{"text":"Elegant, this is the perfect word to describe The Sazerac Bar.\n\nInside the Roosevelt Hotel","useful":8,"cool":9},"zzKRUoUBC0Hmno8Gp5DtPQ":{"text":"Delicious Sazarac, although a bit pricy at 17 bucks a pop. Although not the best I've ever","useful":0,"cool":1},"qw8wEk6l1ui9nNDAazS1TQ":{"text":"We stayed at the Roosevelt and had drinks at the Sazerec bar which is in the hotel. We ord","useful":1,"cool":0},"WvMBKKyYMPwSwVpdjRDv7A":{"text":"We stayed in the Roosevelt, we patroned the Sazerac daily.  We used it as a pre-game for d","useful":2,"cool":3},"NpROIuVjfPZHmWYZ8vKdDA":{"text":"You know I believe in one person one vote but every once and a while I get a glimpse into ","useful":1,"cool":0},"GvMa4_pozl8QusC75MrUvQ":{"text":"We sat for 20 minutes before a server even came to our table. Three tables that were sat a","useful":1,"cool":0},"r8QpOI0qSsleOGq5dutS_A":{"text":"What a neat bar inside the old, but beautiful Roosevelt Hotel.  The bartenders are knowled","useful":2,"cool":0},"1LnTVOh0Znuo4Xquk5_4iA":{"text":"The bar is beautiful, but was way too crowded on a Thursday evening to make it to the bar ","useful":0,"cool":0},"RELKob6PJ2V4V8xaSNs6kg":{"text":"How have I not written this review before now? A trip to Nola isn't complete without a vis","useful":9,"cool":8},"UoZSpqSLpKKmWy8tot9hpQ":{"text":"The wife and I were in town for the weekend and our first order of business after unpackin","useful":4,"cool":3},"hQVnkxitaxZZy0Lx4jBHiA":{"text":"The gin fizz is absolutely amazing with the bar tender really taking her time to craft the","useful":0,"cool":0},"2Qa1l42l1_a7d7qdZ0EWYA":{"text":"Like everyone has said before me, this bar has a lot of history. The interior is beautiful","useful":1,"cool":0},"HcVMCB9Su43IWa0IUS51_w":{"text":"While in New Orleans, you must have a Sazerac at The Roosevelt Hotel. The logical choice f","useful":16,"cool":12},"d1zYxdCBT6zhyksieXx4Jw":{"text":"Phenomenal wait staff. Bartenders with character and genuine enthusiasm for what they do..","useful":2,"cool":2},"1sizlIm4RJKtE6h9Y3__cw":{"text":"After reading the many positive reviews we paid a visit to sazerac and were surprised to d","useful":0,"cool":0},"khGn9UqOXdUCzUNz5m5wew":{"text":"The Roosevelt Hotel lobby alone that leads to this classic bar is worth the visit.  The ba","useful":2,"cool":0},"vj1aDQQXBSKe-tgsVb8LTw":{"text":"i was expecting this place to be more boogey but given that it's in a hotel it's frequente","useful":0,"cool":0},"VfhYWvj65EaIMoZzOrLlTA":{"text":"We heard many good things about this bar before arriving in NOLA. We were fortunate enough","useful":7,"cool":2},"F1_6LMoe0y7gZspAXTRs7A":{"text":"I believe I began one of the most surreal nights of my life in the Sazerac bar; it was one","useful":4,"cool":4},"fbrObF5RYyXuXEuikWImUg":{"text":"I have come to revere this bar. The eponymous Sazerac was a cocktail that I always respect","useful":1,"cool":0},"BMuMKJpmhLrg9KH1hrNkDw":{"text":"Great classic bar with a lot of history and some fun stories behind it. Ramos gin fizz was","useful":0,"cool":0},"zzKGhZ9qtQDqW6OEW98vrw":{"text":"We stopped by in the mid-afternoon and ended up staying for hours! We were dressed casuall","useful":2,"cool":2},"LGokuZH3svyUKv5hIUAFsg":{"text":"As a self proclaimed \"lover of all things glamorous\", I couldn't wait to visit the Sazerac","useful":9,"cool":3},"A8ltgmbsfLhKqx1ZOGCG4g":{"text":"The Sazerac bar is iconic. And as most places that are iconic, it is heavily trafficked. B","useful":0,"cool":0},"5a1Tw3kSrPGsmqYmBhL59g":{"text":"This is a landmark bar from the days when people wore tuxedos to dinner and women wore gow","useful":1,"cool":0},"LZ2TBfu2-FHpMv2eWpIsfA":{"text":"One of the best places to spend an evening in New Orleans.  Talk to the bartenders and the","useful":0,"cool":0},"7O69fYFjmqOYIq-VLX3pJA":{"text":"Every time I come to New Orleans, Sazerac Bar is top on my list for a Gin Fizz. I honestly","useful":0,"cool":0},"IyURf-3FgRvEPnaq9bVxtA":{"text":"The original, traditional sazerac. Order it. You won't be disappointed.\n\nWe had quite a fe","useful":1,"cool":0},"Qj7hkZ4aH5e0X2TPjpqvRQ":{"text":"It took some time to settle on the star level for The Sazerac Bar.  The hotel and space ar","useful":0,"cool":0},"Spv0Ts6pPBsBvugBlfUkJw":{"text":"The Sazerac is always filled with young professionals and business people but is always a ","useful":0,"cool":0},"IHU5WXZ3du8WXg4scpZFvw":{"text":"Nice, elegant low key bar to chill out with co workers or    datenight. Perfect drinks !","useful":0,"cool":0},"U4sw6Ux6B_KV45gBBRAuvw":{"text":"My boyfriend and I knew we couldn't leave New Orleans without paying a visit to the Sazera","useful":0,"cool":0},"r0KUIkhS3teNekzaFORGeA":{"text":"Absolutley love this place!  Quality drinks made by professionals in a classic setting tha","useful":2,"cool":1},"42O5w7DROtn79SFjuRzkyA":{"text":"FANCY!  CLASSY!  What the heck was I doing there???  Well, my cousin and I were introduced","useful":3,"cool":0},"BPWm6IJOa3bnNzgzugn6cQ":{"text":"The service was so good that we came here 3 out of 5 nights for our trip. It's a great atm","useful":1,"cool":1},"aowAlBs9gbDHEUYPFFNQ8A":{"text":"I just had to stop by the Sazerac Bar while visiting New Orleans. This bar is BEAUTIFUL! T","useful":0,"cool":0},"S4Oj9YUK0-Q0YD_2E762rw":{"text":"The Roosevelt Christmas lights were amazing.  Definitely worth stopping in to see.  Also S","useful":0,"cool":0},"UUIZegb4HTFjZCMI6qEi9Q":{"text":"We stopped into the Sazerac bar for one drink and scored comfortable seats on one of the s","useful":1,"cool":2},"AjiL97itvQ5xSinlr4pabQ":{"text":"I honestly think that this place has some of the best bartenders in Nola. Every single dri","useful":3,"cool":1},"YKxEMV4Tyh-QTma5ylCjpQ":{"text":"Absolutely a must for every visit! The most amazing cocktails. Great staff. Atmosphere of ","useful":0,"cool":0},"mWA_n2daeOzCHt1DUimARA":{"text":"Had to try this place at Mardi Gras since I had recently learned how to make a Sazerac aft","useful":0,"cool":0},"bzkb9dJ65RqCBEMsG9sIdA":{"text":"I'm really torn on how to rate Sazerac and what to say about it. I'm going to start with t","useful":2,"cool":1},"mQONGLLS0WGnVjqWUnAdVA":{"text":"Fancy old school historical type place.  I had the famous Ramos' Gin Fizz and it was almos","useful":1,"cool":1},"B53jy-9jvx6xre2Y_7RLJA":{"text":"The bar is located in Roosevelt Hotel and they close the front of the hotel 11pm.  Where d","useful":0,"cool":1},"vUDOmN_a3avAeGp39U6Zng":{"text":"One of the best upscale bars in New Orleans. professional and friendly staff. Inside The R","useful":0,"cool":0},"-2UXNK3TOHxPI2Nd3Hpyeg":{"text":"To finish off my Yelp 100 for 2016 is a review of the  Sazerac Bar.   Love a neat Sazerac.","useful":10,"cool":9},"IUmPA4c_OFdV82tUtDY6yw":{"text":"I don't often feel fancy. Truth be told, given the chance I'd always be in a T-shirt in je","useful":8,"cool":8},"z-3hSclJTGXc6vCylrPeVw":{"text":"Wanna feel like you're a part of history or what it tastes like? Stop at the Sazerac Bar, ","useful":5,"cool":2},"ioBJIqAxorCUeoCr-q0Qdg":{"text":"When in New Orleans, one MUST, MUST, MUST go to Sazerac Bar.  Sazerac Bar is located withi","useful":6,"cool":6},"ByHMBEWloBynvEzE9a-WHQ":{"text":"Never lets me down a must on anyone's Coctail tour of Nola. The Art Deco paintings are ins","useful":0,"cool":0},"0yvuRHMsErMyAkkDI1bjcw":{"text":"The Sazerac Bar is one of those awesome places where the well-dressed, professional staff ","useful":0,"cool":1},"3QMWfD3KW-foibvJL0MKMQ":{"text":"We've been to this bar every night during our stay. All the staff, but in particular Alexa","useful":0,"cool":0},"dwy3J__FrQwtmwLu00iEHg":{"text":"This place has really great cocktails in an idyllic atmosphere. We came for sazerac after ","useful":1,"cool":1},"SpB-q8SogSXcrty5ZOAxJA":{"text":"If you want a great, well made cocktail, then check out the Sazerac. The wife and I love t","useful":0,"cool":0},"DjpoT92fEEmpwKcKLWST-g":{"text":"Classy and then some. While I didn't order a sazerac, sitting at the bar for a nightcap wa","useful":7,"cool":7},"1hmuxbpxwKsNUiJQZ5_-ZQ":{"text":"What a great atmosphere to relax and have perfectly made handcrafted cocktails. \n\nThe drin","useful":7,"cool":3},"hCaBCmb3xJRDsKHCX7dRkQ":{"text":"the man behind the bar OMAR/WILL made it all happen for us. I definitely knew the history ","useful":1,"cool":0},"zHrsLwn91BtoOYq4Oqt_ew":{"text":"If you enjoy craft cocktails, history and vintage art-deco then definitely stop by the Saz","useful":1,"cool":1},"OHIj29KWSBdkYzNYAamFmQ":{"text":"Sazerac Bar is Terrestrial, Tasty and Timeless.\n\nAn absolute incredible time warp beyond e","useful":2,"cool":2},"tQgnaYbQcrFVWhigDkuFgg":{"text":"This is one of the most fantastic and elegant hotel bars in NOLA!  Why compromise your sta","useful":4,"cool":3},"QPMt2WDJ8anrLlrt9ODcuA":{"text":"Nice classy bar in beautiful Roosevelt Hotel, formally Waldorf Astoria. Good Lemon Drops a","useful":0,"cool":0},"YU78qoA_wsKz7r6Vk8Bddg":{"text":"Sean and Aspen are absolutely amazing. Exceptional service!","useful":0,"cool":0},"N5od-4Hamn5Iy8tP9n7C2g":{"text":"Very cool bar in the Roosevelt Hotel.  The Sazerac is large, with plenty of bar seating as","useful":2,"cool":2},"EMxOIDEiUV9R5y67WEif4w":{"text":"This bar is inside the Roosevelt hotel with a really fun hall way - purple, green, and yel","useful":0,"cool":0},"YXvzmo2jjYb4FPTpO0aDqQ":{"text":"Located inside the Roosevelt Hotel, the Sazerac Bar is a great stop for a wonderful cockta","useful":2,"cool":3},"6WsdOAB4hKqYTu_-WShF6A":{"text":"This place is obviously known for the Sazerac but the service by Alexa and Jonah outshone ","useful":1,"cool":0},"l3Nfd-WpIB3shOFUKcLI7A":{"text":"The phrase that comes to mind when I think about this bar is to call it a classy joint.  I","useful":1,"cool":1},"dY9urYQUyJmYtqfqMztCvw":{"text":"Located in the beautifully designed Roosevelt hotel. We initially walked in the hotel as w","useful":1,"cool":1},"fLuk9yICOjUb3ozW4KKM4Q":{"text":"This is one of the most fantastic and elegant hotel bars in NOLA!  Why compromise your sta","useful":2,"cool":3},"3vXbbnn8vYscx_YwTPn4VA":{"text":"Stopped in a The Sazerac Bar on a recent trip to New Orleans the bar and Roosevelt hotel i","useful":0,"cool":0},"zMR_aChoFPW1_4b2yhOaEQ":{"text":"Love, love, love! The bartenders wear white coats, the surroundings are gorgeous, the drin","useful":0,"cool":0},"rXrBliRmKkEDDc46xKBIKw":{"text":"According to their web listing, the Sazerac Bar is named after what many consider to be th","useful":7,"cool":6},"jiSMeCBrwm9PFqEYyfMwjg":{"text":"Really disappointing. I feel like they are resting on their laurels or the bartender didn'","useful":0,"cool":0},"kmqpt1aNbxAWaocuhbnoxg":{"text":"Great great bar to visit when you're in New Orleans! I love the vintage, tad bit dark bars","useful":0,"cool":0},"klyWp9tVfk7TRYbXGPVTqA":{"text":"Terrible. Waited for 40 minutes in the table for the waiter come and get my order I told h","useful":0,"cool":0},"YcMXmrKUejlyOquDGuO2mw":{"text":"The Sazerac Bar gets five stars if for nothing else.....the nostalgia!  Located in the his","useful":3,"cool":4},"6prgNVFa00WcfzP2kL3Bhw":{"text":"If you're feeling fancy and romantic, take a trip to Sazerac Bar! Located inside the luxur","useful":8,"cool":7},"Wg3ZgUK1zjUi-Ea_fWcIlw":{"text":"Friendly bartenders and a great atmosphere make the Sazerac bar a must see!\n\nThis bar is f","useful":2,"cool":1},"w3XXig2FFxyJJpXmAQkFng":{"text":"Without a doubt, this was the most beautiful bar I visited in New Orleans. The interior wa","useful":4,"cool":5},"ocilHNbRV_XtXRGA0Og7yA":{"text":"A style and atmosphere of days gone by this bar was relaxed and not pretentious. Great sel","useful":0,"cool":0},"CiJPGaJgIbwjvWMqfDgYyQ":{"text":"The Best. Absolutely Spectacular. Between the elegance of the surroundings, the historical","useful":2,"cool":1},"RDk1hHZqNAG7ZGRkitFTdQ":{"text":"Whatever they are paying Eric and Jonah, it can't be enough.  They make the best cocktails","useful":0,"cool":0},"3o_VVcc4eAAtvk5amMSgfA":{"text":"What is the New Orleans equivalent of the phrase \"When in Rome...\"? \n\nObviously if you are","useful":2,"cool":1},"1vL3YtoLdmgO8XcetQJrNA":{"text":"As part of the entire \"Nola experience\" me, my husband and another couple recently shared ","useful":2,"cool":1},"7h1X4h_1bc-xn4SepO9epA":{"text":"Great bar inside the Roosevelt Hotel. We had their Espresso Martinis and man, they were am","useful":0,"cool":0},"jS022QkaprQX132J_KvlZw":{"text":"This is an iconic stop - surely. The Sazerac was strong, so make sure you like whiskey! Th","useful":0,"cool":0},"-WY0NGuCkF9BqyZ1N12P6A":{"text":"My partner and I LOVE a good Sazerac. We are from Texas and came here with high expectatio","useful":0,"cool":0},"OSARQt2rJkeiszyxJAwovQ":{"text":"Holy shit this place is fucking amazing. \n\nIn the event that you don't know, the drink tha","useful":2,"cool":1},"nNU6n1ayNOBbDIFpANyfnQ":{"text":"My husband and I stopped here one of the nights we were in New Orleans because we were tol","useful":2,"cool":2},"coEwThGVxJjIY8iecmsKnQ":{"text":"Sazerac is a gorgeous, grownup Prohibition-style bar & lounge that desperately needs to im","useful":29,"cool":15},"F4nkrmvBlGBjI5fniRXN6A":{"text":"Sazerac Bar's art deco style is gorgeous and sophisticated that has a Jazz Age feel to it.","useful":2,"cool":0},"D_0wU2vtvtVwOzWAKsXtzg":{"text":"Put on your fancy pants and head to the Waldorf Astoria, for New Orleans official cocktail","useful":2,"cool":1},"6O_DbZHf7RKD-QVm_4gfKQ":{"text":"Classy bar with amazing cocktails.\nI had this amazing garden district drink that was unfor","useful":3,"cool":1},"VY-STbB3YUHbqDfjvBG73w":{"text":"Really nice authentic fancy bar, we had a great Manhattan and a sazerac, as well as char g","useful":1,"cool":0},"oe6zIHh6FA8CigF89tdjtw":{"text":"Really great drinks!!\nI had the champagne lady and the Ramos gin fizz- both delicious but ","useful":0,"cool":0},"7bNZddrpuP5mWxbUdxGGOQ":{"text":"Beautiful and a serious piece of history. I had a Sazerac cocktail here as it's the birthp","useful":0,"cool":0},"xKcfQ-xft5GCF_WdXfGjdA":{"text":"Came for drinks. The Gin Fizz was outstanding! We will definitely come back here next time","useful":1,"cool":1},"7ZIeBp3AXDL_es_5IoSx9A":{"text":"We missed the Sazerac Tour so we found this place and so glad that we did!\n\nLove this type","useful":2,"cool":2},"iA4b2C08_vwrX9ZncmGWew":{"text":"The swankiest of the swank. This bar is what the other swanky bars wanna be when they grow","useful":6,"cool":4},"YyNvg0bTgmQq2CU1q1a0-w":{"text":"I would give this place 100 stars if I could! Everything about it is flawless. We visited ","useful":0,"cool":0},"h3WBSsF-8JMZc7PDxrzESg":{"text":"Very nostalgic yet cool bar in the classic Roosevelt Hotel, just off of Canal opposite the","useful":0,"cool":0},"EOzmsrLGNKfdgUPI6Pb3PA":{"text":"Fun little bar located in the Roosevelt hotel. Bartenders are very friendly and efficient.","useful":1,"cool":1},"DbJKyvyjFvmYthebIW97bw":{"text":"Sazerac Bar, home of the Ramos Gin Fizz. Had to pop in and check this spot out. Went there","useful":0,"cool":0},"9uJ8LQ-Wj6s1zoF6zBs-ZA":{"text":"The original.\n\nTucked away inside The Roosevelt, Sazerac is a little piece of history. You","useful":3,"cool":2},"ETSbhzqoOsrjJ5Y_Ixus9A":{"text":"Located inside the historic Roosevelt Hotel, Sazerac Bar is fancy and fun. \n\nThis bar has ","useful":6,"cool":4},"yActHhlv9aSp6BqtQ2PUDg":{"text":"Wonderful historic bar in a beautiful old hotel. The bar itself is a gorgeous space that p","useful":0,"cool":0},"F6NRjPLlLfP0lIjlEF9vLg":{"text":"This was on all the lists of historic bars with historic drinks in NOLA, so my self-guided","useful":2,"cool":2},"k95T27_lCrNqziQthlwGNQ":{"text":"The food and drinks were okay but Rachel made our experience awesome. She gave us perfect ","useful":0,"cool":0},"9xyufuRnJinRZPpF-SoTgg":{"text":"I was on orders from my favorite barkeep to go and try out a Sazerac from its \"home town\":","useful":2,"cool":3},"AbTHW-e9IbuFKqUlCq9I4g":{"text":"High class and very polished bar with a range of bartenders. Our favorite bartender was Ma","useful":2,"cool":2},"JwAHsAGeE9ZMY_BRp6MXdg":{"text":"The Legendary and one of the most famous and beautiful bars in New Orleans, and maybe anyw","useful":0,"cool":0},"OFUZxBhnFratFhqrtQovUA":{"text":"Often buzzing with a lot of activity, we were lucky to grab seats up at the bar and watch ","useful":0,"cool":0},"cyHsNSWAi2jgBgCAPIpKMg":{"text":"Was really happy we stopped here. The cocktail and whisky menu is superb. The bartenders w","useful":0,"cool":0},"XaR8VEEeA7HRDe6EAkMwNw":{"text":"Wow. What a gorgeous, classy space. Despite the opulence of the hotel and the bar, don't b","useful":1,"cool":1},"Dgzup8te1w7uTriw2W4crA":{"text":"Service was excellent, however being a high end hotel bar, expect the pricing to reflect t","useful":0,"cool":0},"EOtMQwfe6YzwF1mbceROrQ":{"text":"This is a great bar, but I'm not sure I'd consider it a \"worth $17 for a drink\" bar. My hu","useful":1,"cool":1},"VEkWAbc16yTGLLZJf3046g":{"text":"We visited the Sazerac Bar specifically for the Ramos Gin Fizz.  In a search to try and fi","useful":3,"cool":0},"qcFvefz6VenmAi-c-0i5YA":{"text":"I'd read about having a Sazerac at the Sazerac Bar at the Roosevelt hotel, and I was reall","useful":2,"cool":0},"wgicBuAMdMv9jHQ04tM40A":{"text":"The phrase that comes to mind when I think about this bar is to call it a classy joint.  I","useful":2,"cool":0},"wrg5kBr9fJ5A4NMaUAi-Fw":{"text":"I love a Ramos Gin Fizz. Sazerac Bar served the best one I've had yet. Honestly they could","useful":0,"cool":0}}