{"Kr-LkP7SYy511NVzs7Mqug":{"text":"It's a Ritz: old, nice, a bit stuffy and well located in the French Quarter but far enough","useful":4,"cool":0},"OTeMcRiyHBIXn9Dl8CX5Ww":{"text":"We stayed at the NOLA Ritz April 14-18. I have always wanted to stay at the Ritz Carlton. ","useful":5,"cool":0},"eFIAb-JfnSF7buuRxvkjTw":{"text":"Rooms seem to have a sound proofing problem with hallway noise. Was mistakenly charged for","useful":0,"cool":0},"HoOAqQp76aqo5oSY8lJuBg":{"text":"Fancy pancy! And we love it! Exceptional service and one block away from bourbon st!","useful":1,"cool":0},"rEozf-vuUvOJ6ue4im1fmw":{"text":"Still a great option. \n\nAmazing staff, excellent accommodations and money well spent. \n\nAs","useful":13,"cool":7},"9v6fRZ-7wjJ0-U_wHfIrzA":{"text":"Who could ask for anything more?\nI was in New Orleans for the Essence Festival. I had a FA","useful":0,"cool":0},"YnZxqzIwz26Ya4nrvgA4dA":{"text":"I want to give this a 4.5...\n\nYou can't dislike the Ritz - very clean, friendly, and accom","useful":1,"cool":1},"vkIimtWwZvxNIMhRWFn-tg":{"text":"We stayed here on our last trip for Mardi Gras. We had requested a room with two double be","useful":1,"cool":0},"eLDNORwu3BZ3dntrw3j6EQ":{"text":"Wonderful stay. Everyone was so nice. The beds were comfy and clean. The rooms were very n","useful":0,"cool":0},"FpEMZR-GojvWyHx_sMgXrg":{"text":"This property and very Nice.  Many amenities and the rooms are a decent size.  The beds ar","useful":0,"cool":0},"Qc1xe-O-CGQPfNkoQ-U2QQ":{"text":"This review is just for the spa part. $145 for 50 mins. Marilyn was fantastic! I told her ","useful":0,"cool":0},"RO3WDedCM5wHJiGT1dwfqw":{"text":"We were in New Orleans for a conference four days after Mardi Gras 2015 and we stayed on t","useful":1,"cool":1},"xEOK9faBIrzGmxrJWgRKDg":{"text":"The bartender named Byron was superb! He is passionate abt his drinks and the local fare. ","useful":0,"cool":0},"CfCqfS5cPIhQM7YBTCo96g":{"text":"I was surprised this hotel was on my company's preferred list.   I chose the Ritz over a C","useful":0,"cool":0},"zxczkCpLlhyDGVmLQnQTJQ":{"text":"You can't go wrong with the Ritz-Carlton - courteous staff and gorgeous interior. Strangel","useful":3,"cool":3},"jX4t7hkvskGjyporRElRvA":{"text":"Returned because we enjoyed the club-level so much last time. What a let-down.  We upgrade","useful":0,"cool":1},"k3RMRS8nqzeGPJkIRC8eCg":{"text":"Very nice hotel! Exceptional excellent service from the front door bellman to the front de","useful":0,"cool":0},"rc7_FEEiOEhnImoYFrINhg":{"text":"Incredible room as always. Paid for the club level but didn't use it much. Have to say tha","useful":0,"cool":0},"E_-hp9ILXmzCwmmr1UAKNA":{"text":"Ultimate Luxury. It has a great spa area with a hot tub and jet pool. The rooms are large ","useful":0,"cool":0},"3h7VPJ14h5EHvm1rnjD0Aw":{"text":"I hate leaving the Ritz and especially the NOLA location. The staff had their southern gra","useful":1,"cool":0},"sZ8IMX3L9eIuKH9aiLeuVg":{"text":"This review is long overdue.  I had  a work event in New Orleans at The Ritz Carlton last ","useful":0,"cool":0},"M9_hhwQyR97tGkpCwbsbSQ":{"text":"This hotel is right on Canal, it's absolutely gorgeous and huge. They have a beautiful cou","useful":0,"cool":1},"qK4GVqTMdCCnHQNSS3PLUw":{"text":"This is a gorgeous hotel with a perfect location ... on the edge of the French quarter. Ju","useful":1,"cool":0},"Xu9L5ZxM4aH3xNp6FZAamw":{"text":"Probably one of the most elegant hotel experiences that I have had.  Prior to the Katrina ","useful":0,"cool":0},"2ssL2p8iZX0MoEaCtUFEyg":{"text":"First time staying at the Ritz! Wow! They really roll out the red carpet! From the car att","useful":0,"cool":0},"QX-Pv0eTivPS6_AAvABiNA":{"text":"The most upscale hotel I've ever stayed in! The service was not even comparable to other p","useful":1,"cool":0},"xAVRncvbzV1q81lompTQoA":{"text":"Not a \"5\".  I had hoped you would be a \"5\" rating.   I rate you barely a \"4\".  The staff w","useful":0,"cool":0},"UOFfHyp77S-94erJuyerxg":{"text":"I'm disappointed in our visit. The hotel is decorated nicely, it's in a superb location, a","useful":3,"cool":0},"uWgd0a9IU0Yit4e2SX1APQ":{"text":"I have a hotel ritual.  Lately, I've found myself judging hotels by my bubble bath experie","useful":1,"cool":2},"_O8xdONQ2xsx1pLOyGLjFg":{"text":"The location is a little away from the hustle and bustle if the quarter, so you will need ","useful":0,"cool":0},"qt3j8cfDUX07bn_ZPQJjvQ":{"text":"Nice hotel in the French Quarter. On the 14th fl out of 15 floors. Well appointed hotel. N","useful":1,"cool":0},"nrKUbAnXrMnxzxw7OM3pOg":{"text":"This must rank as one of the better hotels I have stayed in. The rooms are very tastefully","useful":0,"cool":0},"Mkw3bkeRdpSPF6DmsPVhtg":{"text":"A tale of two cities. The location was great, staff was wonderful, courtyard and bar area ","useful":0,"cool":0},"MfON5ItJ-5vABLV9C8f5yw":{"text":"Yow. We were here at the lounge last night to celebrate moms 60th birthday post dinner. Sh","useful":0,"cool":0},"tqjjYZFEGCbSTn4YXajShQ":{"text":"I stayed here with my love and had the best hotel experience of my entire life. We dined a","useful":0,"cool":0},"H1-w5MDVGWeQ7J31HaolNg":{"text":"The wife and I stayed here last week. \nWhat a great hotel. \n\nThe staff is amazing and so s","useful":2,"cool":1},"ElkpWuerW2kCt4DwVP_pew":{"text":"Fantastic! Very friendly staff as is in the South! Ritz met all expectations! Beautiful sp","useful":0,"cool":0},"dq57UmBqb41ZfXoGe25q5A":{"text":"You can't find a better location. The hotel is very elegant, service is amazing the staff ","useful":4,"cool":1},"0KROVAMrQOG_cF-YqUQyfQ":{"text":"The first impression was poor....  the staff was not rude by any means, how ever they were","useful":0,"cool":0},"WvKN1dwF9kdXHaMeO0nu4g":{"text":"Oh, by far the best! If you're willing to spend the money, it is well worth the extra chan","useful":1,"cool":1},"c-aqhn4kzTIgrNwQ3IcZsA":{"text":"I recently attended a conference at The Ritz. Very Pleasant hotel. Beautiful rooms, confer","useful":1,"cool":2},"DN3c3ANXoQ8E1tfrrDQSBg":{"text":"Best beingets in the city if New Orleans!!! The staff is awe inspiring, warm courteous and","useful":0,"cool":1},"bgrsEfL-hXf002AmGbnpYQ":{"text":"The service at the Ritz-Carlton is always top notched. From my pre-reservation email from ","useful":9,"cool":9},"VaFchgssYApjibdmG7jOuA":{"text":"Great location, service and awesome gym and spa. Rooms were typical Ritz decor and bed is ","useful":1,"cool":0},"m04Pma9RaLLan1MVrol3OA":{"text":"I am not sure why the high ratings. I stay in hotels for a living, 200+ nights a year. Thi","useful":5,"cool":0},"BYRccKZhc7CcmJh47P6C9g":{"text":"Everything you expect from a Ritz-Carlton.\n\nFantastic service, gorgeous well-appointed roo","useful":1,"cool":1},"LuHGoSXA3fsQuLEflkBcag":{"text":"Great great great location, but i think that is about all you are paying for. The rooms ar","useful":0,"cool":1},"Pvle-NfidDUnJwGccAWZlg":{"text":"I'm not sure I'll ever stay at another chain hotel again other than The Ritz. I was quite ","useful":1,"cool":1},"MPsN3x_8QxmpArBMpseO8A":{"text":"Location and Service can't be beat!!  Close enough to walk to all the action, but just far","useful":0,"cool":0},"dwnY4knNO2KDRiZPohnyrg":{"text":"The Ritz is an oasis in the French Quarter. As soon as you step into the hotel, you feel a","useful":0,"cool":0},"ssJZTQ3o7K7alWs-53HP6Q":{"text":"Fabulous hotel! Service stands out, as does the awesome rooms with the signature Ritz feel","useful":0,"cool":0},"eFvmrbVsUthNfKgt8_Fngg":{"text":"This was a great place to stay for a conference. The rooms are big and really comfortable ","useful":0,"cool":0},"9ngNcbr-Cl8Jr68OcfNCLA":{"text":"Gorgeous, gorgeous, gorgeous property. Decadent and luxurious without being gaudy and tack","useful":1,"cool":0},"MFUf05FBV1baaddMM2Gkkw":{"text":"I have stayed at a many Ritz-Carlton properties throughout the US and the New Orleans one ","useful":1,"cool":0},"rvorIAO_gD7kCRpFgoHZQA":{"text":"Just finished a 3 day stay at this wonderful hotel. Clean, classic, and centrally located.","useful":0,"cool":0},"pg09Qr61gqGXfrcVp4NHsA":{"text":"In the Club, on the fourth floor, life is perfect. Nothing could be improved. Well, maybe ","useful":0,"cool":0},"ieMZ9mDZu7xsTZBt_4AX2A":{"text":"Was there this week for the Sugar Bowl.  I walked away after spending 3 nights there think","useful":3,"cool":0},"2Zos2FjtBJuWcwha4SACEg":{"text":"Ok I have to admit I didn't stay here but I remember the ritz having really good beignets ","useful":0,"cool":0},"12biwsJnqIusyFH9J1IDEw":{"text":"Customer service and ambiance make this a 4 star hotel. The small details are done with ca","useful":0,"cool":0},"OPs76h8w6djFphdKqTMMhA":{"text":"I have been treated very rudely here, unfortunately. I tried getting a drink at the hotel ","useful":0,"cool":0},"o9WMTP9a6yFVbzYMZDPmvA":{"text":"We went to brunch at the New Orleans Ritz, not Sunday, but special occasion for Christmas ","useful":4,"cool":5},"R45Xnkdn0-FsVawwTpxxMg":{"text":"The staff at the Ritz Carlton really made my day,all five days that my group of girls and ","useful":0,"cool":0},"zwGzpTR7KFrIEh4IQJ3d1Q":{"text":"I love this hotel so much, I've been fortunate enough to stay four times over the past two","useful":0,"cool":0},"gkPVESJSwNwdCKClZ2C50Q":{"text":"My husband and I just spent the weekend here for a retreat he was attending.  The Ritz emb","useful":3,"cool":1},"bpVZt_tOfav0VQ9DnuX4AQ":{"text":"Having stayed at the JW Marriott (basically across Canal Street), the Ritz is a whole othe","useful":0,"cool":0},"uaO0z_Ri5vBZBiOYx-HKkw":{"text":"Bumping up a star because I was just here again for a work meeting and had a great experie","useful":1,"cool":0},"Z415xgQ42FeU_068JqVj6Q":{"text":"Pros: excellent customer service, spacious club rooms with over large soaking tubs, top of","useful":0,"cool":1},"zaDd6k5lip3D30w0TW7Pmw":{"text":"I had a fabulous stay here and would LOVE to go back.  For me, it's all about the little d","useful":1,"cool":1},"SIbpd4eaIY8AXnkHCDCMlw":{"text":"A little pricey but you may be able to get a better deal if you call the hotel directly. I","useful":0,"cool":0},"gCVPMffB9B4eCvHwOtPZkQ":{"text":"This is a beautiful hotel with an excellent staff.  We had a great stay and all of our nee","useful":4,"cool":2},"-ehdH2X9Nf94taJFNeQW8Q":{"text":"Currently staying at the ritz. We blocked off several rooms for my sisters wedding. I arri","useful":2,"cool":0},"TH1SPstszpJGLpqgxJdnJA":{"text":"Stayed here for business conference had a great time the Davenport lounge the ritz is stil","useful":0,"cool":0},"q8aRG9EDZqap35nY3RfnBg":{"text":"Stayed for a conference with my wife. The room was great and clean every day. Hotel staff ","useful":1,"cool":0},"8hue_Volbea1GiqmoQMikA":{"text":"[Update 2008]  The Library is a private cigar club now but you can purchase a day pass.\n\nT","useful":0,"cool":0},"_1uVjSMjyXaKWQO85FBIdA":{"text":"I stay at Marriott frequently, Platinum status. I was excited about staying at a Ritz.\nIt ","useful":0,"cool":0},"xOj02CL-tHlo5VguoYIYYQ":{"text":"Nice hotel, but the rooms are a bit dated. It's the same as it was over a decade ago. The ","useful":0,"cool":0},"LhvfbspeJfqXiRgt3IhS6g":{"text":"I've never stayed at the Ritz before. It's pretty swanky though. What's been unique about ","useful":4,"cool":0},"U1-rrqlyFQZcfR3XZ52fQg":{"text":"I didn't stay here but I did have brunch here during Mardi Gras 2018. They have a great bu","useful":0,"cool":0},"SmUhNPeg9De6rYo68SOZwg":{"text":"Huge and labryinthine, the swanky Ritz is somewhat difficult to navigate.  See the earlier","useful":4,"cool":3},"gOwBhyeT-q1Tz_--CX0fDw":{"text":"Super nice staff and very beautiful property. It's a little more run down then other RC pr","useful":0,"cool":0},"MJy6gNnRmkaYGJCShdwCOQ":{"text":"Wow, unbelievably friendly people, very few nickel and dime charges, and super helpful. Ni","useful":1,"cool":0},"q2z5EM5vDEvv5X1I2WbyHw":{"text":"The best hotel experience ever..we have been coming to NOLA for 30 years, but this is our ","useful":0,"cool":0},"A7fkoR9OSl5lEWdrBLg6lg":{"text":"The Ritz Carlton is elegant and has class!! It's December and the hotel is beautifully dec","useful":0,"cool":0},"OvwnFj5QFMfSR72GCTb4QA":{"text":"Went with my husband for his medical conference in New Orleans and stayed at the Ritz; it ","useful":0,"cool":0},"6xT0mCOf8KzVK0Kj_pQc_A":{"text":"I went to New Orleans with a couple friends for two weeks and the four of us stayed in an ","useful":0,"cool":0},"_ngBAcU7l6jPpxIlVgfEag":{"text":"What an amazing display of 'southern hospitality'. This hotel continued to surprise me eve","useful":1,"cool":0},"rkP7C8k85rzHyFaPsGhcOw":{"text":"I was just in New Orleans on a business trip and loved staying at the Ritz! The staff is e","useful":0,"cool":0},"fV0UhWQtMDoi7ZSVXPI_KA":{"text":"I called this hotel home for more than a week during Mardi Gras. Needless to say, the phra","useful":8,"cool":3},"yaQQxIuzqNoJfsA410SbGQ":{"text":"I feel very honored to have the opportunity to stay here with my dad. They recognize Marri","useful":0,"cool":0},"nK3d4UW0rZzfBAPDlJhouA":{"text":"Stayed for a conference with my wife. The room was great and clean every day. Hotel staff ","useful":0,"cool":0},"gIoKJpHjOEPjWxGZObTxiQ":{"text":"What can I say, I had a special event here and the staff was AMAZING.  My crowd out grew o","useful":0,"cool":0},"LHaiCuYgEH47Of2-SPhOjw":{"text":"They piped floral scents into the lobby and elevator. The hotel bar is so great that you a","useful":1,"cool":0},"FL2NWUzWXVjSoRnwIE-IZw":{"text":"Staff is AMAZING!!!  We are here in Mid-late July...PLEASE make the A/C work better!!!  We","useful":1,"cool":1},"kHaKpWQKSBGCMxeRfMcX3g":{"text":"The Ritz, is the Ritz.\n\n\nHit up the bar to kill time after a bachelor party weekend when I","useful":0,"cool":0},"fOzEbwhP3xgzA7C5E7s5Qw":{"text":"This was my first visit to New Orleans.  This hotel was under some renovations during my s","useful":1,"cool":0},"J3UclLDUTfAOhnCJ7RBH9w":{"text":"Great location and service. And probably the most comfortable bed I've ever slept in at a ","useful":0,"cool":0},"eyDl6wjVUWtFLp-r5XAtCw":{"text":"We stayed here for a conference and received mediocre service. Our room service had someth","useful":0,"cool":0},"ILLzVnbWX-r5s9MAUzOuhQ":{"text":"Pro:\n- Location. A brief walk from the action.\n- Elevator access was fast.\n- Doormen were ","useful":1,"cool":0},"cnD9ZRyH2JUg0geJCMF0jQ":{"text":"Came later to listen to jazz music in the lounge -- the service was not ritz carlton's usu","useful":0,"cool":0},"dQqgdEHW9_l4wjfRQJ52xg":{"text":"Entertained clients and really enjoyed the ambiance and class.","useful":0,"cool":0},"mSwGnNgkLkBDKWEutcvKFw":{"text":"The service was inconsistent throughout our stay. The club lounge provided great service t","useful":1,"cool":0},"wTflQCMdOTLJc7xSYdc9Qg":{"text":"Beautiful hotel, excellent service and accommodations. You must consider this hotel when s","useful":0,"cool":0},"RmyxiQHQkAZQ4T1yH60K_Q":{"text":"WOW what can I say..... We went to New Orleans for a last minute NYE 2011 Trip we planned ","useful":0,"cool":0},"V8rLomKMR_6EQ0H0h4yzgA":{"text":"I don't know how anyone can give this hotel less than 5 stars.  The hotel is beautiful, se","useful":0,"cool":0},"HGkh1bDxxocpwq9R6_PZ7Q":{"text":"If this place had a better bar set-up for guests, it would be a 5* hotel.  Located in the ","useful":0,"cool":0},"eQf1KR6nI0D3PMA7DCO3iw":{"text":"We've stayed here twice and both times were an awesome experience.  I mean, it's the Ritz ","useful":1,"cool":0},"yq87U3gofZxFPr2UdaxPRQ":{"text":"My husband and I stayed here for a weekend for my cousins wedding. The room was beautiful ","useful":1,"cool":1},"5jxtsno-isZXJexvXopObw":{"text":"I didn't really stay here it was more like I LIVED HERE. I was doing a project in New Orle","useful":1,"cool":4},"i7-YRoGPFOJhP9iJZ6-7vA":{"text":"This Ritz is one of the best! We had an incredible time here in New Orleans, largely in pa","useful":0,"cool":1},"W_kNKC3pfx9soc8kMksc1w":{"text":"We did the fancy English Tea here.  My fiancée made me go w/ her.  This was the first 'tea","useful":3,"cool":0},"mGm6hQv9L5T0lNUd0ihH0Q":{"text":"What a beautiful hotel! We are in the maison Orleans club access room...it's very beautifu","useful":0,"cool":0},"q-hBAOT5KjF5ukwyt0A9Ew":{"text":"Terrible service at this hotel.  When I checked in, they put me in a room that was already","useful":0,"cool":0},"2Ta91ojRCJBFIPA3B5c7jg":{"text":"This particular Ritz is a standout for its phenomenal service and staff. The staff without","useful":5,"cool":1},"HhvGTKQzhumPdVkK9XcbDQ":{"text":"The New Orlean's Ritz is a really great example of the \"you get what you pay for\" saying. ","useful":4,"cool":3},"eh1AttJYefPihxq8LonmXg":{"text":"Hello New Orleans!  When our family of five booked a trip to the Big Easy, we decided to g","useful":6,"cool":5},"nW2KqouhaM-RLuk7g_KdCg":{"text":"This hotel, which is, in part in an early 1900s department store, is an absolute delight. ","useful":0,"cool":0},"rGSMy0RBKiVLYv7vJvuSUg":{"text":"Miserably uncomfortable double beds!  The room was big--why can't the Ritz Carlton have go","useful":0,"cool":0},"ohFwIbOHMapwDe2-wigI_w":{"text":"The Ritz is the greatest hotel I have ever been in.  The staff attended to our every need.","useful":0,"cool":0},"twg0WebFUeX2RFvz7j2Mnw":{"text":"Try the Beignets - light and airy puffs of pastry with three dipping sauces: chocolate, ho","useful":1,"cool":0},"j_9fzeGPARmDSVxocAl2oA":{"text":"Clean and plush. My room is exactly what I expected. I love the pillows, and the bed was v","useful":0,"cool":0},"vZKRmyU4KldftdUoIlhVNw":{"text":"The travel agency got our reservations wrong....... The hotel did a great job to rectify t","useful":0,"cool":0},"xPjRoMP_23PtCsUC_IB16w":{"text":"I've stayed in several Ritz Carltons before.   Always top notch.  This one is not up to pa","useful":0,"cool":0},"_J6bPMvVqsvafOgCdP8U0Q":{"text":"Excellent hotel (6/22,12). Lovely room. Nicely decorated and very quiet. Service was excel","useful":0,"cool":0},"q_GlUcsuN5Eakh568aEBdw":{"text":"Recently stayed again earlier in the week. NOTHING has changed and just SUPERB service! A+","useful":0,"cool":0},"DuKlKYG_CH0_7XsHodRqFQ":{"text":"The Ritz-Carlton in New Orleans is absolutely gorgeous. The food was amazing and the decor","useful":3,"cool":0},"Gjo5NwkyL6ra-DV8aFabeA":{"text":"This is a good choice for a hotel near the French Quarter. Since it is on Canal street, it","useful":3,"cool":0},"VqfGYGKqFBFI6c9j-zMPAw":{"text":"Beautiful hotel! Although the standard rooms are a little on the small side, it was do-abl","useful":2,"cool":0},"qfuxG-YB1LZP7utzn1xRBg":{"text":"Nice Hotel Good brunch and dinner inside the .Hotel. Friendly staff. Hung out in the Daven","useful":0,"cool":0},"nI-fbqjg4ggvwJ8EnLVuJQ":{"text":"The desk clerk when we checked in was fabulous. We were given a king bed, but had requeste","useful":0,"cool":0},"v2JxYEsbTGxVGRuw4jl4mg":{"text":"This has been an excellent vacation! Our hotel was wonderful: everything we needed was pro","useful":0,"cool":0},"wlEedMkDLXZUyrktAYRUbg":{"text":"We were beyond impressed by the quality of service we received here, especially from the h","useful":0,"cool":0},"_Rx1f9KfrYbCbAQShey3Tw":{"text":"Place is easily the best Hotel I ever stayed in. The only other I've been to in the same c","useful":0,"cool":0},"eD7h2jVtJ6QRBIuIVN_gUQ":{"text":"I was excited to stay here.  It's conveniently located 2 blocks away from Bourbon Street. ","useful":3,"cool":2},"ofWGoVPPdRpQUnaLZlVSRw":{"text":"great central location and it just blows u away just from walking in the lobby. i mean of ","useful":0,"cool":0},"OM7017j_32TCA4h_kNxPdQ":{"text":"Was in town for a conference. My room was spacious quiet clean and well decorated. The sta","useful":0,"cool":0},"pARBmWO9WQCdtEZaGzG9xg":{"text":"Stayed at the Ritz Carlton during the second day of Mardi Gras celebrations. The hotel was","useful":0,"cool":0},"adRhl0vM4ZA3ndLdg6sAhw":{"text":"We stayed here for our \"mini-honeymoon\" since we were not able to get away yet. We loved i","useful":0,"cool":0},"r4dMvRE4cx6YACGtRcEcSQ":{"text":"Tremendous stay minus the weather in New Orleans. Wonderful establishment, large hotel. Be","useful":2,"cool":2},"IE-cnH05ndczLGoUCUJcQw":{"text":"New Orleans at its best ! Eggs Benedict & Neworleans hash !! Perfect bed of hash browns ov","useful":1,"cool":0},"FBJCokNk0rzVeYtkM_yDcw":{"text":"Definitely beautiful lobby and common areas.  The room was OK to say the least.  I've stay","useful":1,"cool":0},"_Yx3A9a31niDiWmaVXF4bw":{"text":"Old school classic hotel in the heart of the French Quarter.  Great location....right on C","useful":1,"cool":0},"j6HVQg5NTZzv126pSS47Gw":{"text":"I was sick for most of my trip to New Orleans. Most of the food in NOLA is not appropriate","useful":1,"cool":0},"gPJxFk9BD-96rh1gWduJaA":{"text":"Great place and an amazing piano bar type setup in the evening.\n\nThe location is solid too","useful":0,"cool":0},"99354i6XVC-PEnXcK7vHDQ":{"text":"AVOID AVOID AVOID food tasteless drinks not good. This is not Ritz level service or qualit","useful":1,"cool":0},"wBoc2cxBfliq6UFoysdu4g":{"text":"Not the best Ritz I've stayed in, but nice. Valet takes forever, beds don't seem to be the","useful":0,"cool":0},"39Cw7a-37slY9IPh6s9ZqQ":{"text":"The Ritz is a little oasis in New Orleans. It's quiet, cool, comfortable and refreshing.\n\n","useful":1,"cool":0},"DeCUGf0BPmtBQ-Y92euKtQ":{"text":"I met a friend who was staying here while she was in town for drinks at their lounge.\n\nThe","useful":1,"cool":0},"-yRCvmCM8SWgR7tCDjJFGQ":{"text":"Nice place, good location, but a bit tired-looking for a Ritz.  Place needs to be spruced ","useful":0,"cool":0},"C0oXGyYDpkYn0hfYV0DpLw":{"text":"The Ritz-Carlton New Orleans.  Not just for Ritz Bitzes.  \n\nThe Ritz: The great room rate.","useful":0,"cool":0},"kZ19PnD6LQH9q98V_GK7HA":{"text":"We just stayed here for the G&R concert.. Great place to stay people were so nice took goo","useful":0,"cool":0},"YQOVaKjoLIyt7HN1dx4bRg":{"text":"I really enjoyed my stay here. Room was very tidy, staff very attentive & the location was","useful":0,"cool":0},"psN87o0RH30HVWvMu0aP2g":{"text":"I loved my stay at the Ritz Carlton New Orleans. Everyone was exceptional. It's a beautifu","useful":0,"cool":0},"z7E0JOQPfvEcPD0jeNzmYw":{"text":"Arghh. Well check-in was efficient despite changing room types to accomadate a second gues","useful":1,"cool":0},"obvMNlVgCLMbrq7eYFKn8A":{"text":"My husband and I came to NOLA for my 30th birthday and our first trip without our 2 year o","useful":0,"cool":0},"uov-C0Jfx21Vt7e3BJNBDw":{"text":"Very hard to find anything wrong here.  Staff were pleasant and professional.  Check - in ","useful":0,"cool":0},"HUTM7VR768dJ6Fc1Fs0rRg":{"text":"We stayed at the Ritz for our anniversary and were congratulated by almost every staff mem","useful":0,"cool":0},"bWY2x6pGfXtkjMP8qvs6AQ":{"text":"I have stayed 150+ nights in NO over the past 30 months. Most at the Monteleone. I figured","useful":2,"cool":0},"StX5AluLueQm1awtfF1p-g":{"text":"If you haven't experienced Ritz Carlton service you should.  I am lucky enough to know som","useful":7,"cool":2},"Mqf1_wTxruaJGrCOixIzwQ":{"text":"Everything you would expect of the Ritz Carlton.  Fantastic location in the French Quarter","useful":0,"cool":0},"s2jC2e5POOMyNa18EvDUYg":{"text":"This was my first time staying at a Ritz. I can see how the Ritz-Carlton brand sets the st","useful":2,"cool":0},"X-ktVJ6A_GaYN90B_3K17A":{"text":"If you ever stayed at a Ritz Carlton with Club Lounge, you know that is the only way to go","useful":2,"cool":1},"_ytjyluK5QYJ7-OcAccpzw":{"text":"Parking was a bit high, but that is of course due to the location.  Room was clean.  I did","useful":0,"cool":0},"_Iqa_2ibnEZmn8-VT_lmEQ":{"text":"I can't say enough about this hotel!  They saved me from a horrible experience at a local ","useful":0,"cool":0},"bdilWLx1jh2VUUY9WllQyQ":{"text":"We usually stay at bed and breakfast style hotels in the french quarter when we visit NOLA","useful":0,"cool":0},"sjtKV3XuSZkwZlF1i5R5pw":{"text":"After having been in other french quarter hotels this place puts them all to shame. Anyone","useful":1,"cool":0},"z6xwyOid64BJ24nyF4cjQw":{"text":"We enjoyed live music and cocktails with friends in the hotel lounge/bar area.  Our hotel ","useful":1,"cool":0},"wGl1H2iT2jbGnUq8xrGxpw":{"text":"This is an excellent hotel and in my opinion the perfect location.  It is on the edge of t","useful":2,"cool":1},"GqaQyP7lGDYfXoonAts9kQ":{"text":"We stayed here in February.   The hotel was very clean.  The beds are extremely comfortabl","useful":0,"cool":0},"3kAHmdzb-SnHqALExBqDZA":{"text":"Clean, convenient, and cheap (just kidding about this last part). It's a RitzCarlton and t","useful":0,"cool":0},"tj64XEtGW0f9XLMZR4I8eA":{"text":"It's the Ritz! Luxurious with a great location in the French Quarter.  The staff are wonde","useful":0,"cool":0},"bf64Xl_iN9PKTMGO_PGUVg":{"text":"Let me just say I  had a  wonderful stay.if  you like  nice people nice service  and a lov","useful":1,"cool":1},"7L9qWIi8Cu_cy8NpdtcFbw":{"text":"I have to start that this review by saying that Adalberto is the best man in New Orleans a","useful":0,"cool":0},"1ptcNDmrKznA7XpS88j35Q":{"text":"Had an amazing 3 nights stay at this beautiful and classy New Orleans Ritz with my boyfrie","useful":0,"cool":0},"HfZ2NIiZ_0kqWIdvL7qICg":{"text":"room stinks.  smoky must....  and who the hell still charges for wifi...  i'll use my hots","useful":0,"cool":0},"-p5AB9Dmnovb3F-U5Y7K4Q":{"text":"Really appreciate how everyone of the staff is very polite and genuinely friendly. The bed","useful":0,"cool":0},"ufY-PCecliw4lPrDTtZCdQ":{"text":"Our guest room needed a face lift and was not strenuously cleaned before we checked in, bu","useful":0,"cool":0},"MtuvExH8dAWcmDi_lBeYnw":{"text":"Relaxation at its best at The Ritz. The Concierge Floor. The amenities are too many to men","useful":0,"cool":0},"OWqGD67thSAy4HobRzESPw":{"text":"I was deep cover, an undercover agent.  I was NOT in my element.  I was at The Ritz.\n\nYeah","useful":8,"cool":6},"XukGX5AFlBlq-IAc4W93gQ":{"text":"Thia is one of my favorite Hotel in New Orleans. The service that you get here is unbeliev","useful":0,"cool":0},"BnT2PhNdVurPDPuVQaW3xg":{"text":"If you have Marriott status don't waste your time at the Ritz in New Orleans.\n\nThey don't ","useful":4,"cool":1},"q9Tp2jGS9HCTMNhYIpGAkA":{"text":"I would like to give 0 star if I can. The location is good and some nice staff. But the ro","useful":1,"cool":0},"SzfohBD97IHnLXPpviKjzQ":{"text":"I liked it. It was pretty good although perhaps a shade under the service quality we norma","useful":0,"cool":0},"8qsCPUO2hB1ggOHwJ-YC2A":{"text":"Do yourself a favor and stay here beside looking at other hotels. It's on a major street (","useful":2,"cool":2},"b0wR1HvQMdMllRShKUwShQ":{"text":"Magically! The moment we walked in a didn't want to leave. We got settled in to the club l","useful":2,"cool":0},"Is2bfTsffot651070vy4zA":{"text":"I plan on staying at this hotel everytime I visit the city.  Now I have to admit that I am","useful":0,"cool":0},"oOO2HNoCHJt6X7ymKZQyww":{"text":"I only stayed here once pre-Katrina for the Bayou Classic event. Its only two seconds away","useful":1,"cool":0},"ABuIyQdy3PVygsJZdSfYXA":{"text":"Close to everything. My room was clean and spacious and very comfortable. Good bar service","useful":0,"cool":0},"k2qubieEwQNPkhmujlxYQw":{"text":"Came for the memorable Mother's Day buffet. Fairly expensive, but appropriately priced.  E","useful":0,"cool":0},"rOfUat5njmVA7hS1F1KPkA":{"text":"A beautiful old school look right in the heart of the action. It was very affordable for w","useful":1,"cool":0},"DClInx5F5vSnSKkftUR_iw":{"text":"So this review is only for the lounge found inside this hotel. Met up with girlfriends in ","useful":2,"cool":1},"JP0RaeFcBDFoN0TiTG4ZZw":{"text":"Here's what you need to know: By far the best ultra luxury hotel in the city. GORGEOUS! Ol","useful":5,"cool":2},"_rOTvA27sVuPTf26RU0WeA":{"text":"Two words: club level.\nAmazing food and drink spread daily.\nBeds were so comfortable. \nSta","useful":0,"cool":0},"MxTQbj4OLqmRcQjOBPHRqA":{"text":"I gave them two stars, because our first experience with this Ritz-Carlton was when my fam","useful":0,"cool":0},"qJS5etR-VHE2-pAl4Y8d9w":{"text":"Great location on Canal about two blocks from Bourbon Street.  Quick walk to French Quarte","useful":0,"cool":0},"0A4KlbMZhAbjvxXWahk9Nw":{"text":"We absolutely adore this hotel and have stayed here quite a few times. We like it so much ","useful":0,"cool":0},"ME19txPnlx17jP5ZCaxFeg":{"text":"I was here for a conference and have nothing but good things to stay about the staff here.","useful":2,"cool":0},"F0rIuiymRMKb0Cf5Ob6q6g":{"text":"This Ritz holds up to all of the standards you expect from a ritz.  In 15 years of staying","useful":0,"cool":0},"j78F8Zf9X9diwDJQFoJzRA":{"text":"I've stayed here multiple times.  Service is always what you would expect....consistent, p","useful":0,"cool":0},"knPzqkmy6gOsbZuPYvZ6Nw":{"text":"This hotel is WAY too perfumy -- from the air in the lobby to the pillows and sheets to th","useful":1,"cool":0},"CL6P33TtbD64JBJNfX4PuQ":{"text":"We have been here two days now and are staying at the Club level.  Erica and Sandy have be","useful":0,"cool":0},"mflHrSXBF8I7c2ESeg_T5Q":{"text":"This hotel was super awesome. I got upgraded and early check in. I only stayed for a day, ","useful":0,"cool":0},"69APKQh2OOpXloN5zuKU8A":{"text":"My parents granted me and my wife a night away from our two young children. We decided to ","useful":0,"cool":0},"1UX_iaVXO1cJP38klGM4gQ":{"text":"Recently stayed there with my sister for myy 40th birthday celebration.  Had a nightmare m","useful":6,"cool":2},"BXWV6SnGbW2YTtC9HRVoxg":{"text":"The Ritz was the perfect refuge from the gritty streets of Nola. While we love all the cit","useful":1,"cool":0},"Oc4AnneQ83MQ0s-XNJp3EA":{"text":"This hotel is located on Canal just two blocks from Bourbon Street.  It was the perfect lo","useful":0,"cool":0},"4ulN68kc4oAL3U9-Pg44hg":{"text":"My husband and I were looking for a place to listen to some jazz. The ritz Carlton came up","useful":0,"cool":0},"F1MmrfrjtucsggumCtP5OA":{"text":"When I found out I was heading to NOLA, I needed a place to stay.  Forgetting it was Mothe","useful":7,"cool":5},"RWjo_kdVRoJeo3BhKFLSag":{"text":"It's The Ritz. Enough said. Hotel and staff lived up to all expectations. We loved our sta","useful":0,"cool":0},"mHo22nJOhFc-o3m2MNqrVg":{"text":"Can't believe I'm saying this, the name - the Ritz Carlton - standards by which all others","useful":0,"cool":0},"PhaTziZXA9zc3cpZuwCH1w":{"text":"I had an excellent experience at the RC because Ilene and Velvet in housekeeping, Ebony an","useful":0,"cool":0},"HxKvlTcFhKTrmpyxYUR45g":{"text":"This is a great hotel--the service is amazing and the ambiance is everything you would exp","useful":0,"cool":0},"qZMflQtVfu0R4S9r36HXWA":{"text":"The Ritz-Carlton in New Orleans is a beautiful property. Our room was pretty darn perfect.","useful":0,"cool":0},"_QgAs3BRnLjx-IPsw-4aSA":{"text":"This review is for the Spa at the NOLA Ritz-Carlton. Wow.\nIt was everything I expected and","useful":1,"cool":0},"5IKcceFapxtLVy1GJWjccg":{"text":"Truly a five star experience all the way around.  From check-in to departure we were treat","useful":0,"cool":0},"GNnE3kVW4BeIiNfY4U9dHw":{"text":"I love staying at any Ritz-Carlton property so I am already a fan of the chain. This locat","useful":2,"cool":0},"2AwuJpjPO-W0vt9AadWmyQ":{"text":"You have arrived.\n\nThis was my first time (I think) staying at the Ritz...  Though I like ","useful":0,"cool":1},"Nxs9Q_pg-pooui2h_cpr0w":{"text":"Beautiful room and bathroom, great service, friendly staff. I left my iphone charger at ho","useful":0,"cool":0},"4f9RZ4GI36FYiFWQVOYEKg":{"text":"My family owns a timeshare at the Ritz Carlton in Aspen, CO and so I decided to stop in at","useful":2,"cool":1},"absv_aBkCL9Oa9v6HeRdNw":{"text":"I love the Ritz ... This is a slightly older one re: rooms that I've stayed at compared to","useful":0,"cool":1},"752VfGnlVX91M28Dr13T6Q":{"text":"We stayed in New Orleans at the Ritz Carlton for just one night.  I cannot say enough good","useful":0,"cool":0},"WywnWzDHgE5zc9yI1OJTHg":{"text":"Okay, so I have this weird relationship with Ritz Carltons. My one other experience at one","useful":2,"cool":1},"QOd3OcZ6g5CYM5-uBh2oIw":{"text":"Nice touches as most Ritz have.  The patio off the bar you could eat was cozy and beautifu","useful":0,"cool":0},"xKFbsV0XOzGT662H4Dv3xQ":{"text":"Professional Southern Hospitality at it's best!!  \n\nThe staff was so helpful and pleasant ","useful":0,"cool":0},"Q61XcSkeGB2Qzny3YC151w":{"text":"This is my favorite hotel in NOLA.  The staff is amazing.  You truly get what you pay for.","useful":0,"cool":0},"cqwieuWHrUxk2x4gshe4Aw":{"text":"Absolutely perfect guest service. Each worker goes out of their way to help you and make s","useful":0,"cool":1},"xDqLUHfbhJoQOE6HK7uMgA":{"text":"Stayed here for a work trip and had the best service of my life. The staff was amazing, fr","useful":0,"cool":0},"_3Jwh42Mvm6TzgCCnarWJw":{"text":"Wow, that's all I can say.  This hotel truly rolls out the red carpet for its guests.  The","useful":0,"cool":0},"v2-b9HDVpXyjryx_EpDrTg":{"text":"This is THE place to stay in New Orleans. It is it for me... except when they are fully bo","useful":1,"cool":0},"ES-VdnA1sbBy9M3POWq5Uw":{"text":"Wonderful hotel. Ritz service!!   Beautiful rooms. Large bathrooms...nice amenities. Great","useful":0,"cool":0},"DBCNauFevraPizO5GNrkiw":{"text":"Hey, it's a Ritz...it HAS to be nice.  Its location is convenient on the northern end of C","useful":2,"cool":0},"K53ifbTHdLdQesAwnmLwfA":{"text":"Finally got the chance to stay at the Ritz Carlton New Orleans on Canal Street.  First, th","useful":0,"cool":0},"-K-JfPrTzqzjk-3RlkcLtQ":{"text":"I've never met a Ritz Carlton property that I didn't like! It certainly is Ritzy, and this","useful":1,"cool":0},"YHQ_sBtTf4fksNpLx5pgMA":{"text":"I went to the Spa for massage services and also purchased a $250 gift card for my mother. ","useful":2,"cool":1},"K5g5U0FoHyWLiB22xy8W8Q":{"text":"The NOLA Ritz is beautiful, stunning architectural and decorating details, friendly servic","useful":1,"cool":1},"8x0gj51E0vamAE1e4X_22g":{"text":"Very nice hotel. Gym is nice. Live jazz music at night was great. Only drawbacks were mino","useful":0,"cool":0},"XU_K2ekfd0_T9bccc2E0fA":{"text":"Overall i had a really nice stay. It's a very luxurious hotel - you get what you pay for. ","useful":2,"cool":2},"uYbyKIgVKkykP4OxSITYVg":{"text":"We stayed at this hotel again and the service was better. Not as good service in the club ","useful":0,"cool":0},"YKY56IbU9-M6JmAklnrQPA":{"text":"Staying here for five days and every morning I go to breakfast at M Bistro. Lataria is our","useful":0,"cool":0},"b4nJMqHxt4eoOViROiNaNA":{"text":"Service is excellent here as you would expect. Very friendly from the doorman to the front","useful":4,"cool":0},"OtGaqZ0HSsgcWnVHIeQrZw":{"text":"We arrived last minute to the Ritz and we were able to get a room right away. We had our t","useful":0,"cool":0},"qOfBtoQASMUdqdHE6Vr-Aw":{"text":"I have some very mixed feelings about this hotel. In some ways it is a delightful place to","useful":1,"cool":0},"cAfuU7qPenP04uyWwblW4Q":{"text":"Had an awful experience here. For a luxury place the staff had no idea where the wedding w","useful":3,"cool":0},"2ij--GlqLrgLxhkAjFyVXA":{"text":"YEAH BABY!  LUXURY!  LUXURY!  Room 1509, the corner suite with a view.  Because we are goo","useful":0,"cool":0},"7ttyzhTOMLMMj99pXjXMLQ":{"text":"Good Location, beautiful furnishings.\n\nHowever, this hotel is full of excuses and empty pr","useful":1,"cool":0},"i_Hnh6mYKmXA69gNWsy2ew":{"text":"Their beignets are wonderful - hot and chewy with powdered sugar, and they come with three","useful":0,"cool":0},"4rBBiYy5Sxs-re0RduU--Q":{"text":"I highly recommend the bar/lounge. We had a wonderful bartender, Kevin, who took excellent","useful":0,"cool":0},"4hl4IUiU8Lh8XRz0QwFq1A":{"text":"Clean, quiet, and dust free... staff was very courteous while we stayed. Near all of the r","useful":0,"cool":0},"P0yxc4a3JQEv8EN1YU9Dxw":{"text":"My boyfriend and I stayed here for 2 nights earlier this month.\n\nI will start with the neg","useful":1,"cool":0},"uOAAfwC7gVlmkSDI485AaA":{"text":"Came here for a Risk Management seminar and was extremely pleased with every aspect of thi","useful":0,"cool":0},"1_5FGkBddXF-IZps2uZUbA":{"text":"Stayed here for a family wedding.  I say that like it's my family, but you and I both know","useful":11,"cool":11},"p1goYt7HsC47w0HYhiRMCA":{"text":"This is my second time staying here.  The first was in 2007, not quite two years after Kat","useful":1,"cool":0},"b6KqhVxeosLx3m2A3GggCg":{"text":"I am a Nola local myself but I visit this RC from time to time. i am a frequent traveller.","useful":0,"cool":0},"Gkw26HwvckJndWlkprNK5Q":{"text":"Oh my God I LOVE this Ritz. It spews of old southern charm and it is so close to Bourbon S","useful":1,"cool":0},"0C2Ye2Ita9s_q6TbDTBbhQ":{"text":"Best ever. Everyone here is incredibly nice & helpful. It smells amazing. It's beautiful. ","useful":0,"cool":0},"N0SMQr6pkN9CdBX_BhtoCA":{"text":"Very friendly staff.   I like every aspects of it.  The hotel is located right on canal st","useful":0,"cool":0},"et9L-s4dSZA_hG7RpSNvgQ":{"text":"Best hotel I've ever stayed in. Impeccable service and delightful customers. It didn't hur","useful":1,"cool":1},"jEF_2ZtZBgHtz3rhyCzs8Q":{"text":"Stayed in a suite over three days after Xmas.  Booked king single online and upgraded afte","useful":0,"cool":0},"pz9vePKzHqS0hWaXHM6Ttw":{"text":"Cashing in airline miles was a plus so to offset the cost of staying at the Ritz. It's a n","useful":1,"cool":0},"ehR2qNo7bImMQNpHQPKU1A":{"text":"The Ritz-Carlton property in NOLA has been my go-to hotel for about 15 years. It's central","useful":0,"cool":0},"E5TQxOx8srhaQ8uzbKYvGw":{"text":"Not the Ritz-Carlton's crown jewel but still excellent.\n\nCan't beat the location. One bloc","useful":1,"cool":1},"WKDks8d3FGtcSxdrU1eimw":{"text":"I was spending a weekend in NOLA with the BF and his work paid for hotel accommodations. I","useful":5,"cool":0},"3E2X1gm8_ViX8tVgXIo86g":{"text":"I was here for a conference and used my American Express for a package which included free","useful":0,"cool":0},"FQxsngyIpMJzFrbeCjDSIQ":{"text":"This place was supposedly fully booked while we stayed here, which might have impacted our","useful":1,"cool":0},"7PUjNxSICbxIJmvdEGUvfg":{"text":"As always, the RC makes sure we are fully pampered and taken care of. Great location, w wa","useful":0,"cool":0},"EwdjVzUhpJk3JTFaB4wIeA":{"text":"Beautiful oasis amongst all the chaos of New Orleans.  They have a great jazz lounge and o","useful":0,"cool":0},"pYOmb16NQy5JYT2aaMLOYQ":{"text":"Good afternoon,\n My family has stayed in many Ritz Carlton hotels around the world and hav","useful":0,"cool":0},"NiCraNJeHyN9XznwEZzgZA":{"text":"Suzy and I used some miles from our credit card to stay here, so I can't tell you what a r","useful":0,"cool":0},"QX2wXYyOGWmzyPK64cknww":{"text":"We visited NOLA and stayed at a local AirBnB. We kept hearing about the amazing beignets a","useful":0,"cool":0},"gU9SMhbZ-MxArKHrwh9xSw":{"text":"1. I was told upon check-in that I will get a call on my cell # when room is ready; howeve","useful":1,"cool":0},"6f5Az82--kpkm0_X4bjqbg":{"text":"Very nice, old world elegance hotel.  Definitely check out Jeremy Davenport who plays regu","useful":0,"cool":0},"w7KHjM9z0AxSrUr5O1h3vQ":{"text":"This is a great central spot. The food and music was great. The lay out is awkward and my ","useful":0,"cool":0},"8TYY5f06fAIl8deu4vXoyQ":{"text":"First time staying at a Rtiz, so I have nothing to compare to.  It was nice, but I honestl","useful":0,"cool":0},"QkFo53deSONRAL7rGbb91w":{"text":"Subpar service that gets worse... I have never had a worse hotel experience. It became alm","useful":3,"cool":0},"_mxsi-OJIy9JmWvHTwHJuQ":{"text":"For an old labyrinth of a building, this hotel wasn't too bad, and the staff was mostly ve","useful":1,"cool":0},"VCnISu-EOBmr6WV5feFFaA":{"text":"I stayed on club level. It's about $150-300 above hotel rate. Thank you breeders who neede","useful":6,"cool":1},"LFv2joyLmQxWpu3VXPVPYA":{"text":"My review is of the Davenport  lounge and the hotel's holiday decor. This is a beautiful s","useful":4,"cool":2},"bzH2olY7SyWBSlm8_9rpgg":{"text":"Went to the Ritz for the Christmas Buffet. First off let me say that the service could not","useful":9,"cool":4},"rSm1-pZahsCd6zvdeICuTA":{"text":"Despite the location of the hotel I absolutely adore the Ritz-Carlton and I have stayed he","useful":1,"cool":1},"VFCeuwuiAFRozfbZKIn5KA":{"text":"This is one of the top hotels in New Orleans along with having one of the premier entertai","useful":4,"cool":2},"TLEm_dV7z351JWkCb6cJug":{"text":"I stayed here in October and had the best time. The staff was great and very welcoming. Th","useful":3,"cool":2},"CRH7balgBW1eyuqPGcDIIw":{"text":"This is my favorite hotel! We have stayed a few times and absolutely love the service. Won","useful":0,"cool":0},"PupxwLBwel_vviRm5SPNFw":{"text":"I loved the big crisp white fluffy bed and pillows, but the real pizazz was the bathroom. ","useful":0,"cool":0},"p8Nz3bjDayqjE8k6Z9cnrw":{"text":"This property is absolutely gorgeous, the interior decor was New Orleans themed and perfec","useful":1,"cool":0},"Ibk-Ilb1if2eNtvf-mSEFg":{"text":"This is a fantastic hotel! We stayed at the club level where the food and drinks were top ","useful":0,"cool":0},"jAfLsG166FpJOXNV-bf-5Q":{"text":"This is a beautiful hotel. And they have renovated the rooms, which are perfect. The front","useful":0,"cool":0},"xkd-C3-acc6WwUeyCw76MQ":{"text":"I am a Lifetime Platinum Premier Elite member and they still tried to hit me up for more m","useful":0,"cool":0},"OuTSzs8JTzGKjC8FTVZl2w":{"text":"This. Place! I would live here if I could. Location is perfect. Close enough near everythi","useful":0,"cool":1},"2oEP2il0b7PWOiga8NrwsQ":{"text":"This is a gem of New Orleans. The staff is wonderful and treat you unlike any other. You w","useful":0,"cool":0},"1fu4Rvec6g34Ti_mRMHI2Q":{"text":"What can I say... This is a total haven right next to the French Quarter.  Elegant, beauti","useful":0,"cool":0},"vMcYLrQ-syEVG9_llnNlrw":{"text":"The reason for posting this review so late is because while traveling in Turkey I had a ma","useful":0,"cool":0},"ajiRfN9p6gBZLnNAASJpSQ":{"text":"Exceptional hotel, warm, inviting (not stuffy), elegant mixed with southern hospitality. T","useful":2,"cool":1},"YvafQUzvhQDR5nmkE8rcwQ":{"text":"We can't say enough good things about this place. The whole atmosphere is amazing, the loc","useful":0,"cool":0},"IKEIjiKXgcK3qLT4rT1Inw":{"text":"Maybe my experience was marred by the fact that I was here for work & spent much of the st","useful":5,"cool":2},"6a-EK1XMV2crozfdLM_c6g":{"text":"Well I feel FANCY and may never go back to a courtyard ever again! Jk bc I can't afford ri","useful":0,"cool":2},"lYlBdLURG4VGSbFu-INmuQ":{"text":"Stayed here 2/25 to 2/28  Mardi Gras weekend. At check in we were received with 2 beads. A","useful":1,"cool":0},"yREbrMMAoU0CaajdnoQL-w":{"text":"The rooms, the lobby, the smell, the service ...unmatched anywhere in America. I made a mi","useful":0,"cool":0},"4mwzPCpAnaWSMMDKbcisZQ":{"text":"My bed was awesome and the exercise room had everything. Free weights. Treadmills. Station","useful":2,"cool":1},"mAB6oQiWpaNcSzaDfyc7KQ":{"text":"Gotta love the ritz. Our suite was a little disappointing, the setup wasn't amazing but no","useful":0,"cool":0},"vQLxUizZ1N_-4byvd8P5OA":{"text":"Absolutely DO NOT go to Papa Noel Tea. It was me, my mother, sister in law, and 2 children","useful":2,"cool":0},"hUCwOxQm-lch5t0vsEBULQ":{"text":"Great hotel, beautifully done.  The staff all get 5* except for the heavy set blonde conci","useful":1,"cool":0},"ALPHzAW1NEyp7d4NRrPrPA":{"text":"The service was quite good except at their bar. We waited 10 minutes or so for our room to","useful":0,"cool":0},"fhqsstQC7cTdF4hxBMrY6w":{"text":"We visited the Ritz for my birthday and we had lunch, the food was delicious, the Mimosa a","useful":0,"cool":0},"cVaKQHt6ParUvWEJRriF3A":{"text":"We absolutely love this hotel! We are treated like royalty from the time we drive up and c","useful":0,"cool":0},"Kl7PO7fZLV6isBuzZ9wAiw":{"text":"Day one: pulled at valet service an it took 5 minutes for the black valet to help me, the ","useful":1,"cool":0},"UIgGS-vfsMMCNEETriRBcw":{"text":"I had the opportunity to stay at this hotel in August for a wonderful gay wedding. I can s","useful":1,"cool":0},"Izb_bMkFy2XVgmfZ3YjoMg":{"text":"Eating breakfast is not a five star experience at the ritz. The food is taking forever, th","useful":3,"cool":0},"3UbJjBE1joeXXuc9XeR4Wg":{"text":"You can't go wrong with a stay at the Ritz.  Fancy interiors, top notch service, comfort a","useful":1,"cool":2},"6WiXwzhSQ0UxHNLT8EHiyw":{"text":"Stayed over the holidays.  Decorated nicely.\n\nCommon areas are very nice.\n\nI found the roo","useful":0,"cool":0},"441zOLfP_6_l7QfR73726A":{"text":"Set on busy, smelly Canal Street, the Ritz Carlton is a nicely air conditioned retreat loo","useful":0,"cool":0},"EwLNBdzr6EKbt_oymQozOg":{"text":"This was our oasis of peace and cleanliness during a recent New Orleans adventure.  It was","useful":0,"cool":0},"Gj_uVKv0ejI7Ew81rhy-Dg":{"text":"This review is specifically about the afternoon tea at the Ritz-Carlton.  I did not stay a","useful":1,"cool":0},"O0b6oi8WVeX7ozaldominw":{"text":"Actual rating: 2.5 stars. \n\nThis is supposed to be a Ritz Carlton?  I guess every chain ha","useful":0,"cool":0},"hMYe2i4XWhQtfqGt4PtOag":{"text":"We recently stayed at the Ritz in New Orleans during a family vacation. The experience was","useful":1,"cool":1},"QjqM47vVv0oRF5-N8qxJMg":{"text":"Packed my AirPods in my backpack, in a little bag with my power cord. Remember thinking no","useful":1,"cool":0},"bmqWHshXXK1sp-yjzknWwg":{"text":"We had been in quite a few Ritz-Carlton Hotels all over the States. And this is probably o","useful":0,"cool":0},"QhdIL6c2LUgbZko_P9egNQ":{"text":"Incredible stay while visiting to see Ed Sheeran!\nWe stayed while I town for the concert a","useful":0,"cool":0},"av6p5axPYiR5kjPdd_5zBQ":{"text":"A hotel that prides itself on a guest 5 star experience does not disappoint. \nWe were upgr","useful":0,"cool":0},"zZJdOaUs9zfZrNLBqTTuNw":{"text":"Normally we stay at The Ritz but we just visited for the well-known breakfast buffet. We w","useful":0,"cool":0},"fzM-z8pdRYDVYUVAKc2GWA":{"text":"I've stayed in a lot of hotels in NOLA for business, and this was by far the best. The hot","useful":0,"cool":0},"rupHX_1EGfPoslwmDgZEog":{"text":"This place is gorgeous. Front desk is okay. I've had much better hospitality at a 3-Star. ","useful":5,"cool":0},"tOQ1KXGypM5JGz5K-MPGxA":{"text":"My wife and I stayed there for 5 nights around New Years and booked through Expedia.  This","useful":4,"cool":1},"MDXv_CF1Oz4vYoisjjl6Kw":{"text":"Reccently stayed here for a work/business trip, and I am so glad I did! This was one of th","useful":3,"cool":1},"Q1_pAIQWlK2qHu4Wdw3Vkg":{"text":"Stayed for a few days when I came for a conference to New Orleans. The rooms are great. Se","useful":1,"cool":0},"03rV15P5ngF_0pgP7W3mrw":{"text":"The location is wonderful and the hotel and its amenities are spotless. Honestly, the most","useful":0,"cool":1},"BPEltD4WDiDBDnIhUlvNlw":{"text":"Didn't stay here so my review is entirely based on Infamous Christmas decorations we came ","useful":0,"cool":1},"dOQPeXu27YmjYFfV5tX-Zg":{"text":"A Bridge Over Troubled Water\n\n\"Yes, I'd like to request a late checkout please.\"\n\"Absolute","useful":1,"cool":1},"MAywutmB0K4Ss9Lop7FY7w":{"text":"Just returned home from a 3-night stay here to celebrate Christmas - the epitome of wonder","useful":1,"cool":0},"-oFTLOBPNUaaGwcIVM9OHQ":{"text":"Ritz?  Was there for a meeting,  It is a fine hotel but with traditional decor and nice fi","useful":0,"cool":0},"tpJtbzAHJeXpWTXmNIL_Ag":{"text":"You get what you pay for, and this stay was well worth it. All employees I came in contact","useful":1,"cool":1},"8hMquWuq49rTvavq-jQktg":{"text":"I was looking forward to staying here. But about an hour after I checked in, I decided to ","useful":1,"cool":0},"eyStVdnJDaEFDN18J0R2Wg":{"text":"The Ritz pretty much sets the standard for luxury hotels and this location is not to be ex","useful":0,"cool":0},"s_igbWr6_1Kdga1I3Vqk_A":{"text":"Absolutely love the Hotel, its beautiful, and the service is exceptional. My review is abo","useful":0,"cool":0},"W-LBqxMBJkl5-zIG3uuarA":{"text":"This is as much of a Ritz Carlton, as a person would consider eating at Popeye's eating at","useful":0,"cool":0},"4H0JztKBF_vKOhL2LjmiuQ":{"text":"To say that we enjoyed our stay would be an understatement. This place is fabulous, and I ","useful":1,"cool":0},"RsVwk5Et4hzvCGdoTUWeOw":{"text":"Great location for accessing the bourbon street area...if that's your thing. The parking w","useful":1,"cool":0},"g0r27EalvVmTnaqQaun40g":{"text":"Although I've been to this hotel several times, usually for drinks or to meet someone, I'v","useful":1,"cool":0},"_Kxpk1PRiRYDxr6P_24DoQ":{"text":"LOVE LOVE LOVE this Ritz location! It's within walking distance to all the bars on Bourbon","useful":8,"cool":5},"RFKy2Nqx0QyO4_Ilel5LQg":{"text":"So much or too much expectation for Ritz-carlton...? I wasn't impressed at all. everything","useful":6,"cool":6},"oCrWUoQ3vlmOiZMQV1Wz9g":{"text":"Outstanding place for a staycation. Great location and staff was outstanding. We did not w","useful":1,"cool":0},"ZwaS-GDfv0EFTJe3MkrNIA":{"text":"I made an error while booking a same-night reservation on the Marriott app and within minu","useful":0,"cool":0},"JvxQAKVcU-bYL7p3Ab71vw":{"text":"Stayed here for 4 days while celebrating my birthday. Despite the Covid restrictions, the ","useful":0,"cool":0},"U_nvQo-f8wJgze7hw6jWSw":{"text":"This is the best hotel I have ever been to. The staff was excellent. We were upgraded to t","useful":1,"cool":0},"DiyZrUhywAIsI4L5Zx0ZXg":{"text":"I have been here less than 24 hours and my suitcase was left in the middle of the room, it","useful":0,"cool":0},"IBajqJbGksgkW01LhSwZrw":{"text":"So far so good.  It's an older style of luxury but it works for the location.  One block f","useful":1,"cool":0},"6j54bAoP5ck8vulIZJKybQ":{"text":"Mr Richard does a super job on customer service , the super heroes are not only in the tel","useful":0,"cool":0},"ngWA95UnvdB_EgEROVWKkQ":{"text":"Down here in Mardi Gras and the streets are so busy yet the doormen here at the Ritz are g","useful":0,"cool":0},"GZgFSY9YkH5gmo3KzZ98Rg":{"text":"Last time in NOLA I stayed here for 1 week, absolutely loved the hotel and the hotel staff","useful":0,"cool":0},"f8v-DblpMRHRRguSO4R8Yg":{"text":"Staff are thieves. I got home to find out my tablet had been left behind. I called the day","useful":3,"cool":0},"MYYnc8fWALMkOp_HyuL-mQ":{"text":"Overall I was quite impressed with the level of hospitality I experienced in the entire ci","useful":3,"cool":3},"NS0thPeFT5Rcw-bC_NUsDA":{"text":"Multiple visits here over many trips to New Orleans so a regular guest.  When I have to ju","useful":1,"cool":1},"suVQrCx6xj9XxX9hO-M4HQ":{"text":"I realize we are in the midst of crisis.  Hotel was empty, lounge, pool not available.  Ev","useful":0,"cool":0},"qTgm9oRAnj6Q5fbWt4b2tQ":{"text":"Visited NOLA for first time and stayed her for 4 nights.\n\nPros:\n- centrally located & very","useful":9,"cool":4},"GdsqhBUxE-iKXjyrIH-uZg":{"text":"I have been here less than 24 hours and my suitcase was left in the middle of the room, it","useful":1,"cool":0},"ZxwuBG6ebJUCTy45UOe5bA":{"text":"The Best Hotel in New Orleans\nReview of The Ritz-Carlton, New Orleans\nReviewed 1 week ago\n","useful":1,"cool":1},"_0vUYfIgdl8LazAGmh3gOw":{"text":"I came to the Ritz for Christmas decorations, I did not not stay here...so this review is ","useful":7,"cool":4},"t23-WXRKjrVaYI-FzHakLw":{"text":"Hands down this is a hotel well worth the uptick in price. There are other great spots to ","useful":2,"cool":0},"OE2l2i1UOQ7RwhlR2jeWZA":{"text":"We started our stay for our conference, not knowing it was the week of NOWFE.  We were sch","useful":3,"cool":2},"IaQ_-0sCdLmX8mG9V4ET7Q":{"text":"We stayed here 2 times in the last 3 months and if I was writing this review back in Octob","useful":0,"cool":0},"jarGIhJYpxY3CI7DihrepA":{"text":"Rocky start to our stay. Not just staff issues. It's OK but really not as good as a Ritz-C","useful":0,"cool":0},"RcYUR8dU79M0laTZz-21Iw":{"text":"My wife and I are currently staying at the Ritz. This is our fourth time here. The Hotel i","useful":1,"cool":0},"na89nEzATkNiJF_NWFzq-w":{"text":"This review if for their HIGH TEA SERVICE. Great atmosphere but I was very disappointed in","useful":0,"cool":0},"aDVxKVFnVburGsOLxg7XOw":{"text":"Didn't stay here so my review is entirely based on Infamous Christmas decorations we came ","useful":1,"cool":1},"-Ur3WrZGwBrApr3yia5Dkg":{"text":"I live the ritz normally but this one I was not impressed with costumer service and the am","useful":0,"cool":0},"pmH_r4IKJoPOn-2do8OQLg":{"text":"Worst hotel ever. Staff has no clue what there doing. Room had hair and not frim there hea","useful":0,"cool":0},"dEbBzbtUGAeShxBarWhGCA":{"text":"The fact that there is a formal tea offered daily and a champagne vending machine in the l","useful":3,"cool":0},"zDiYc1ctujdcrhnmM8FfCg":{"text":"I am a plumber, sole proprietor here in Southern California.  I fell in love with the bath","useful":1,"cool":0},"oCp0XQpFCYGHaBPbooCHTg":{"text":"Old charm New Orleans seems to be common for this ritz. Very nice staff. The rooms are spa","useful":0,"cool":0},"NMj6LqC1VWTUfHb7opdZmA":{"text":"The ritz is a staple for staying away from home . It probably doesn't get much better than","useful":3,"cool":0},"j3H_oDrjKob_L8p-u5yxLQ":{"text":"This is my first Ritz-Carlton experience, and I cannot lie, it was a treat, literally and ","useful":1,"cool":1},"6GY9Tvgd-t4AwAjEU9U0tA":{"text":"I will forever be a client of The Ritz, I got stuck in New Orleans Sat night when I lost m","useful":1,"cool":0},"sKqGg9rBc_I8VZmHpCu7Dw":{"text":"Spent two nights.  You could not find  more friendly and helpful staff in \na hotel.\nRoom w","useful":0,"cool":0},"52XPglvNlQPm-3KGy5heQA":{"text":"They have overpriced rooms and nickle and dime you by charging for internet and other basi","useful":6,"cool":0},"jOkW0penAbTG-D9C_9nE7g":{"text":"I know every hotel is not in the same league as the Ritz Carlton but I do think every busi","useful":2,"cool":2},"7DsPU9jfU1KSDMjrVPQbDQ":{"text":"We were a bit disappointed that the gym opens at 7 am, and not 6 am ( we had to get on the","useful":1,"cool":1},"4uSVcF_oqtnFI-ZHx8b5Jg":{"text":"My family and I have Holiday Tea every year at the Ritz Carlton. The kids have a great tim","useful":3,"cool":1},"9AOZY_9RjDyVU5bqEB4PAw":{"text":"How can you go wrong at The Ritz? We went for NYE and had a fantastic time. The hotel is a","useful":0,"cool":0},"SeuAGir_YHty4zjd3yFfbQ":{"text":"I absolutely loved our stay! Not a single detail missed from the moment you step foot into","useful":7,"cool":8},"-FD2lwBik9kfW_6RllpDSw":{"text":"So incredibly beautiful and a perfect place to escape the busyness of the city while still","useful":0,"cool":0},"lpmLVoqBr_ENdBaWuNR-SA":{"text":"Nice hotel, but be careful of tricky billing.\n\nI took the \"bait\" and pre-paid for the enti","useful":2,"cool":0},"QfoxXnFxFd_pWdj_VNBV7w":{"text":"Greeted with a warm smile and excellent service. The lobby was breathtaking and the wonder","useful":1,"cool":1},"Vt6YIbfH9wBpdvGF0lLIWg":{"text":"I have just received an e-mail from TripAdvisor as the property is apparently trying to ge","useful":0,"cool":0},"JBUmFUqtdcwpK2QJvNj0pw":{"text":"This place is a yes.\n A complete yes \nan absolute yes yes yes. \n\nEverybody is trained very","useful":4,"cool":2},"Wr77F8iXrQkCfC2KCebnTw":{"text":"Garbage check-in by Cecilia, not sure how this hotel could label itself a Ritz with that t","useful":2,"cool":0},"m4vFlD-xbo-2pNymwZ6QVA":{"text":"Overall, we loved our stay. We had a little getaway vacation over Valentines weekend. We w","useful":0,"cool":0},"TnyUI6SpZT5rnX4imw809A":{"text":"While in New Orleans we stayed at the beautiful Ritz Carlton property everything and every","useful":1,"cool":2},"zuBItTnSRaztFjmsYWtykQ":{"text":"Beds so comfortable! All employees treated us great. Rudy was amazing, always greeting us ","useful":0,"cool":0},"ZWGWcWfiOvGBYw1DwXISsQ":{"text":"Attended my second Christmas tea at the ritz-Carlton and it's really a lovely event. Delic","useful":1,"cool":0},"e_r31dXWTQMYRgAHPw0D0A":{"text":"I don't stay in Ritz properties often as they are just super expensive.  The meeting I was","useful":3,"cool":3},"SDg-FVsUDM4VW8gK_X1O9Q":{"text":"I'm a lifetime Titanium elite member with Marriott and have points to burn, so I decided t","useful":1,"cool":2},"AnfMGaAdUwPJppJVVcw-ew":{"text":"i give this place -100 stars. first off it is WAY to expensive for what they provide. our ","useful":0,"cool":0},"G_YELtYuSHHg7c1JfdBm5w":{"text":"Really nice hotel. Excellent and quick service. The hotel rooms are beautiful and very cle","useful":0,"cool":0},"-K4JEzHkrth2x4ChdZCRZQ":{"text":"Ummmmmmmm i have nooooooo idea how this place has 5 stars or ANY stars !!!! Absolutely so ","useful":2,"cool":0},"9Rrys5ogBos8lCPE6S2vzA":{"text":"Attentive staff and amazing finishings just around the corner from Bourbon St on Canal.\n\nT","useful":0,"cool":0},"RxYHtqb5PQtIOwjb6r6DAQ":{"text":"Stayed through Amex Fine Hotels & Resorts program.  Refused to upgrade room even though th","useful":1,"cool":0},"97qLZK55EM9l8zAzzvUV5A":{"text":"The M Bistro Sunday Brunch was a great experience.  The food was delectable--the smoked sa","useful":0,"cool":0},"AmHhY2aIh75S5fZbw_7NJA":{"text":"It doesn't matter how awesome you are it's 2020 u don't get to charge for Wi-Fi. It's akin","useful":0,"cool":0},"6H9wAXFUAwmHbmx7dTb_vA":{"text":"I was expecting a bit more from the Ritz. Here are some of the issues I had with this loca","useful":3,"cool":1},"8mhBd00TA9_Td7vuGDUcMw":{"text":"The place to be for all that tea and jazz. We attend annually with a three generations of ","useful":4,"cool":0},"JGhdr8CamB-wCSL09k2lIA":{"text":"I came to the hotel and tried to book a room. The woman at the front desk told me I had to","useful":0,"cool":0},"W0KyPmXceMDmYejW-PxBtQ":{"text":"This is not my favorite Ritz, or even my favorite hotel in New Orleans, but when I catch a","useful":4,"cool":2},"eCj-IPSr67cBSrepg5u3mg":{"text":"Good location--by French Quarter but close to downtown as well. \n\nThis is the least fancy ","useful":0,"cool":0},"wjZ45-dps09N1EtfQPQggg":{"text":"I don't normally go out of my way to review hotels, but I just had to after my wonderful e","useful":0,"cool":0},"kmJHxJbMLSKa1J7SsA_P-w":{"text":"Perfect location. Southern hospitality. Amazing decor and furnishings. Heck, it's a Ritz .","useful":1,"cool":1},"r6nJVgVn7m2kk_IeHal93Q":{"text":"This was the first time I've ever stayed in a 5-start hotel and this Ritz Carlton did not ","useful":1,"cool":1},"-yvIbMb12T7K1QuGo-QUgg":{"text":"I am born and raised in Las Vegas, and am used to the over the top hotel environment, so w","useful":1,"cool":1},"gvDB3RU55DrT-PYtR2l55w":{"text":"We checked in to this hotel today - our third time staying here - and cannot express my di","useful":0,"cool":0},"4y46d2x8M6-nPe_pu8BxJw":{"text":"This was one of hte most wonderful luxury hotels I've ever stayed in. It's beautiful and  ","useful":0,"cool":0},"Qxj4oqAXl2NlEtAOcZG5Bg":{"text":"Nice and refined, with pretty decorations. Doesn't feel like a Ritz though. Also they neve","useful":0,"cool":0},"muX7b3qHrE822p6xzvZeEg":{"text":"This stay was not up to par for a RITZ. First the room service was super slow on every occ","useful":0,"cool":0},"cDeFD1ehqmQtVKCW6px0qw":{"text":"For my inaugural visit to NOLA, it sure was nice to end our two week Caribbean vacation at","useful":6,"cool":6},"Es6KyEORe8saVA5qaqX8uQ":{"text":"The ritz-carlton new orleans is a big luxury hotel with shockingly poor housekeeping servi","useful":0,"cool":0},"fHdatEEGHbxcCLWgAM95Bg":{"text":"DO NOT stay at this Ritz!!! My husband and I had a reservation here for 3 nights and we we","useful":5,"cool":1},"Emlkvh9YbYiAw9by-2GFfg":{"text":"So pretty! I loved staying here. They have a awesome bar area- it didn't get the chance to","useful":1,"cool":0},"YYZHiWhEWjfAPA57WBqWww":{"text":"Having High Tea at RCNO has been on my bucket list for as long as this hotel has been open","useful":7,"cool":5},"QVf6BNlgIetKxWCMJ_UCgA":{"text":"Even with pesky first floor construction going on, nothing dimmed the wonderful experience","useful":0,"cool":0},"XPRq3dmbep34nGL7nKR7-A":{"text":"Stayed in the executive suite. Felt a little dated and stale. The restaurant was nice and ","useful":0,"cool":0},"ZgueHiu5orEX7a5k-VxbwA":{"text":"What I loved the most about the Ritz, was the service. Everyone was very courteous, attent","useful":1,"cool":1},"wUEob3UcnHNq_3Oj3F1GfQ":{"text":"When you choose \"The Ritz,\" you expect a get little more quality and customer service. In ","useful":0,"cool":0},"iJxhvyL2ltX_EdbOmHyfpg":{"text":"It's not the A-#1 hotel in the Ritz chain, but it's still a Ritz.  \n\nThe complaints--diffi","useful":2,"cool":1},"jn_xw8MEofIQFHX5DnGSYA":{"text":"You know its going to be an epic trip when upon check-in the front desk person says \"Mr. D","useful":12,"cool":12},"sy02m9wBIrDXPb_gCIeW3w":{"text":"Stayed in the Ritz-Carlton Suite here at the Ritz in New Orleans. It's definitely luxury a","useful":0,"cool":1},"EviXS5DGRSFUbLc1AoWTww":{"text":"The Ritz-Carlton, New Orleans is an august hotel near the French Quarter in New Orleans wi","useful":1,"cool":0},"nIO1H5w3lTkf3dMrSBba0w":{"text":"Covid has changed everything. My family has stayed here many times in the past. The hotel ","useful":2,"cool":0},"-U7N5jgLSjKzpug_2EvdgQ":{"text":"I am very glad that I stayed here on my recent trip to New Orleans. Got a great room rate ","useful":1,"cool":0},"ADPx2UvGyoGsoTS8Er9Cqw":{"text":"A clean nice oasis in the middle of dirty nasty New Orleans. Convenient to all the shoppin","useful":0,"cool":0}}