{"OZF0iqSpRlzJP3eeyOmtvw":{"text":"You gotta make a reservation, of not you'll wait an hour.  But the wait will be worth it.\n","useful":0,"cool":0},"pEDjO6Qnb9_nO3cj9tdjmg":{"text":"Locals, we visited Chophouse for my wife's birthday dinner on March 2.  To be honest, it w","useful":0,"cool":0},"VgHBo2kG7o9HSSDlmijtiw":{"text":"One word: amazing! Great service and great food! Piano player was great. Loved every secon","useful":1,"cool":0},"_mQpaiDe4Sp5pmAatowUSQ":{"text":"Great salad, very good loaded baked potato. My mom steak was good. Manager was very nice. ","useful":0,"cool":0},"YzJHomkcbrYP5bV93PD6qA":{"text":"Everything we ordered was fantastic! From the super expensive but super delicious a la car","useful":1,"cool":0},"Ej4rjcOVO8i3HUicCGJOWg":{"text":"We were sitting outdoors having a reunion dinner and 4-5 rats/mice were running around und","useful":1,"cool":0},"J7_jTsOV28ZJmpP83Nw2DQ":{"text":"Far better atmosphere, menu, and food than Ruths.  The atmosphere for me really makes it. ","useful":0,"cool":0},"CVH8yveQCuri4AWUWiSFlw":{"text":"Came to Chop House for a work dinner- reservations for a party of 8. Hostess greeted us an","useful":2,"cool":0},"MJ9bBob7k8UYCdHAfwRDTw":{"text":"First time dining here...I chose this restaurant to celebrate my boyfriend's birthday, and","useful":1,"cool":0},"e-knfywdGB8BhJderUuXaw":{"text":"I was here because of our annual employee Christmas Party. As soon as you walk in the ambi","useful":1,"cool":1},"7AuSt-ZvfZFcFJL1rk3u4g":{"text":"Yes, you are supposed to eat Cajun or creole in n'orleans, but I was taken out to  dinner ","useful":0,"cool":0},"svMbLgskOYDH8WS5bpseUw":{"text":"This place is awesome.  It has the sophisticated steakhouse feel and vibe, yet its so laid","useful":1,"cool":0},"193sOv8KpFLFVQsTJXtoVg":{"text":"Felt and tasted like a chain steakhouse.  We had a reservation ahead of time (a MUST in Ne","useful":0,"cool":0},"T4_0I3kmugBh-dXE25PH_Q":{"text":"Food is ok but service is slooooooooooowwwwww. And poor service for the prices they charge","useful":0,"cool":0},"scAGLdpBDiXppXkcH72ZBg":{"text":"I thought the steak was decent. Mine came out a little on the salty side and my husband as","useful":0,"cool":0},"qsB2Y0oawSSJwaF6bJeRGw":{"text":"Chophouse was great! I loved the atmosphere and with someone playing the piano in the back","useful":0,"cool":0},"JfJSDPPGtv7ByZEJimt_gg":{"text":"We were staying across the street at the Country Inn. After a long day of sightseeing and ","useful":2,"cool":1},"g2YNGb1DxDkXj3cAKwWWUg":{"text":"This place is fantastic,, I eat steak in many upscale steak restaurants but something abou","useful":0,"cool":0},"-__MQNzcaAseL1I2CAUMEw":{"text":"This is not the place to go to if you are used to fine dining steakhouses in the Los Angel","useful":0,"cool":0},"Iw9qjYBnmsfRFwgzsEQUpw":{"text":"I was in town for Mardi Gras and decided to have a little date night before the festivitie","useful":2,"cool":1},"KwEl-0G4jzFsCMI7MCy7Ow":{"text":"Tremendous food and a truly wonderful location.  The steaks were better than even Ruths Ch","useful":0,"cool":0},"OSrsXnjJBrOFo6j0Jk-pBA":{"text":"The restaurant decor was inviting for the 5 of my colleagues . We were in NOLA for a confe","useful":0,"cool":0},"eoOVG1bEGGoYE6l6GqZ0JQ":{"text":"I went to the chophouse with my GF with high expectations and I have to say that these wer","useful":0,"cool":0},"3MPiK1xDCDwj-ZEJCXrLUg":{"text":"While walking back from the National WW II Museum, we happened to come across the Chophous","useful":0,"cool":0},"NW-jSAohURWti73bz7trTA":{"text":"Undoubtedly the best meal I've had in New Orleans. Perfectly caramelised crust on the New ","useful":0,"cool":0},"zKybGJKoBmnLGrUiKMuHRg":{"text":"Make sure you have reservations before you go! I ordered filet mignon and creamed spinach ","useful":0,"cool":0},"M_MAi9HLxxPiXDt0un_dOQ":{"text":"In my opinion, the most French-style Chophouse in New Orleans provided with many different","useful":1,"cool":0},"9PeGZ03kquzOD36verQK8A":{"text":"Chophouse is consistently one of my favorite steaks in the city.  It is better than alot o","useful":8,"cool":6},"6WbkVDnCIFc4N9qEPQpcmw":{"text":"DELICIOUS STEAK. My fiancé and I came here for dinner while visiting New Orleans. Reservat","useful":0,"cool":0},"aCe2rq63ywCvmjiNGF5KQw":{"text":"The service was exceptional! Ask for Jason!! The table is set for each course! The best fi","useful":0,"cool":0},"f387kRanS8KWMZo7IQZQ8w":{"text":"Yuck! The food was not tasty, badly seasoned and over cooked! His steak was tough, my shri","useful":0,"cool":0},"Rc-QuQVlbKmh743AAuIEkg":{"text":"This is another place we went to with our 2.5 year old (we called in advance to make sure ","useful":0,"cool":0},"JWWvQfbGFxRcn9a0BbbLsg":{"text":"Service. Service. Service. Number One. Hands down. The professional level of the team here","useful":0,"cool":0},"JmpDfHWR9-X-oGqKbuYiZQ":{"text":"Food was amazing. I had the sea bass. Piano player was so talented. Great atmosphere.","useful":1,"cool":0},"grCmmIdx2BufxGctizgrmw":{"text":"Keeping this short.  I travel a lot for work. I've eaten at alot of great steak houses. Th","useful":0,"cool":0},"CcZEQj0GjfjF7Evy27i8vw":{"text":"Great food! great vibe!  Came here for a business meeting while I was in town for beachbod","useful":0,"cool":0},"K-CsmEJBW1Iu1nY8KXtsmw":{"text":"Wow!!!  I'm speechless. The food and service here is the best in the world!  Had the steak","useful":1,"cool":0},"5fHZVoCij2D44wRQyZzEaA":{"text":"Crab bisque was freaking awesome! The bone in rib eye was cooked to perfection and the asp","useful":0,"cool":0},"sw-1vLLUyPnclogsbjI1Jg":{"text":"Best dinner choice we made. We started by ordering a couple drinks. Strong but not over po","useful":0,"cool":0},"mhBaGTA2Re9LSQA4awwwLg":{"text":"The bacon was the best part.  Steak is normal. Atmosphere was a little stuffy and they had","useful":1,"cool":1},"8DCxO1b5VXvJhzBzuLU4Jw":{"text":"Great dinner, excellent  filet and delicious  appetizers. Love the atmosphere, definitely ","useful":0,"cool":0},"DQpvMFC36H6hE1POChJ6yg":{"text":"Disappointing at best. Went here on business and we were all shocked at how bad the servic","useful":2,"cool":0},"dBGsP7dY6ovfq4yRxSaynw":{"text":"Wow, probably one of the best, if not the best restaurant I've had the pleasure of experie","useful":2,"cool":1},"8xfOa5toJ8kJ8Yw_WANlMA":{"text":"This place is the bomb.  Great and I mean great service great food. Steaks are tasty, lobs","useful":0,"cool":2},"NMEBqs2n3yMFMkg_d0CoIA":{"text":"GREAT ATMOSPHERE. High energy. Nice bar. Excellent service. Food good, overall.  Steaks we","useful":0,"cool":0},"jG1evX5zg8XgiHBIBoHRYQ":{"text":"We had reservations but still needed to wait a long time for our table.\nThe food was good!","useful":0,"cool":0},"29oPQAlmxSnlv7smExzNFQ":{"text":"Hands down the best service I've ever had. This place is a gem in the CBD.\n\nGreat wine lis","useful":1,"cool":1},"wy-FjKIDtgKh8-paVpzlDQ":{"text":"We went to this place hoping to find another great steak house in New Orleans and were dis","useful":0,"cool":0},"4R9KpJw34BMmzzhn4_V5IQ":{"text":"Attentive staff, excellent food! Highly recommend the delmonico steak cajun style. Comes o","useful":0,"cool":0},"cY0Npeeg0VFVkSux1JOTVQ":{"text":"Everything was fabulous! We had a party of 4 we ordered steaks, one of us ordered the stea","useful":0,"cool":0},"IdXxMP4ZV11Un1PMFgumFw":{"text":"Traditional, high end, old school steak house.  I'd take my dad here and he'd be in heaven","useful":0,"cool":0},"9lkRS8RB6NrIF5WO2s-EvQ":{"text":"A great and eloquent place. Good food and music. I am not sure who the female singer/piani","useful":1,"cool":1},"c5bhYmH8VmgSHAidjVpqfg":{"text":"We were recommended the place by the hotel concierge. It was average at best.  The place i","useful":0,"cool":0},"R6HGl0jNPyjWFafe4zeU5A":{"text":"Thank you so much to Chophouse for their Veteran's Day special. My wife and I had an amazi","useful":2,"cool":0},"YoKbvTc_FRUIhe3DbevKug":{"text":"After a long day at Jazz Fest and a shower at the Queen and Crescent Hotel around the corn","useful":2,"cool":2},"3yZd2-CFVy_8f9-j4xvmmQ":{"text":"Excellent service and very good dinner.  We started with the fresh Florida crab claws. The","useful":0,"cool":0},"jbktH6WP9-Uoo6gujqgzaQ":{"text":"Very nice, upscale resteraunt. Food was excellent and the service was great. It was a litt","useful":0,"cool":0},"_cWC2z3FahJAMjvGzUzsVw":{"text":"Went here for my first time told the waiter I wanted a steak. I ordered a chop house steak","useful":0,"cool":0},"skiohUkO98mK-VdxdMf7_w":{"text":"The ambiance of the chophouse is rich, it is a great place to take a visitor to the city o","useful":1,"cool":0},"ROxNslG_dbwsftFNpGSSmQ":{"text":"The steak was DELICIOUS! By far one of the best tasting steaks I have ever had. The sides ","useful":3,"cool":1},"2_0a5wCdgR89e20KHFLf4Q":{"text":"The food was amazing as well as the service. Four of us went and we all\nLoved our meals. T","useful":2,"cool":0},"krtFuLuT36PHaYazgF42HQ":{"text":"Great atmosphere great steaks!  Basic menu but everything was done to perfection.  We had ","useful":0,"cool":0},"Bakc8Xf9Q2mRlLpgyH-5yA":{"text":"Food was amazing, definitely get the baked shrimp! The portions were just the right size a","useful":0,"cool":1},"JHgq1x1ck_pR_j-sKXLZMw":{"text":"The redfish almondine......OMG you just can't get any better than this!!!!! We just can't ","useful":1,"cool":1},"qP8i-aYcQwNc2Vi9dWGf3g":{"text":"Chophouse is the best steakhouse in New Orleans. Yes, it is better than Ruth's Chris steak","useful":0,"cool":0},"1CH6UjFdQ5XCLrecIbvF7Q":{"text":"The steak of prime was huge for one person and absolutely mouth watering and delicious!!! ","useful":1,"cool":1},"AcJ5sSOGAym3hUJn6wWgjQ":{"text":"PERFECT!  That's the only way to describe our experience at the Chop House New Orleans. Th","useful":1,"cool":0},"4UYGdkrK7y24IK9dEw-yaw":{"text":"Incredible dining experience.  We had reservations at another local steakhouse but our hot","useful":0,"cool":0},"5PRCcnAkr6uBSevM8n1yfA":{"text":"You need three things for an amazing dining experience--great ambiance, excellent service ","useful":2,"cool":2},"U-NBXa-Ji62svXkhCPi0cQ":{"text":"We decided to do another steak house for our second  night in NOLA, as we were very disapp","useful":0,"cool":0},"rG_9vvCEILvrQDLizr-Zaw":{"text":"John was the best server that I have ever encountered. His timing and suggestions were sup","useful":0,"cool":0},"RhrGzcqCHV0wTWraHXvUvA":{"text":"I'm in NOLA for work and was looking for a great steakhouse experience. I was a little tor","useful":3,"cool":0},"wruYNEiOFPBD1NvFgZUXyw":{"text":"My wife and I had dinner there on Sunday July 27.  Our server was the lovely April, very a","useful":1,"cool":0},"fBxj52nbR86yI-B-lI8Kow":{"text":"Exceeds all expectations.   Service is what you'd expect at a fine dining establishment.  ","useful":1,"cool":0},"_57AYBSFwvbeBPuaKWHKhA":{"text":"Everything about this place was great! The service was excellent, our waiter was very atte","useful":2,"cool":0},"SNduF06G4TeY6qDJg6inQw":{"text":"Overall, I love this place. Stone carbs are amazing and fresh, when they are in season. Th","useful":0,"cool":0},"nHDBeUmHpsg3X3HXIGw7Bg":{"text":"The rib eye was amazing, I knew it was going to be a great steak just by looking at it. Th","useful":0,"cool":0},"e72Ew9fnC6rcp-Ucx1FVZA":{"text":"I've eaten at all of the high end steakhouses in Vegas as well as other big names like Lug","useful":0,"cool":0},"IvUoEwLlTgmqPM9DsLoePA":{"text":"Dinner for first time last night.  Nice small dining room with warm exposed brick, white t","useful":1,"cool":0},"_a_Yx80D_OODR6LI4rY3YQ":{"text":"A pretty good choice for a steak, no doubt.  My 8 oz. filet was ordered black and blue and","useful":0,"cool":0},"1iULm4iG0UovH0UL-9fcBA":{"text":"The ambiance is very nice. The food, not so much. The steak fries were under cooked. I ord","useful":0,"cool":0},"Gdl-t9XTuqKT8NB2MJT0Ow":{"text":"The food was amazing!! I had the Delmonico steak Cajun style. With a side of creamed spina","useful":2,"cool":1},"Ybvaj2Wb2mR-HjQoyzih2A":{"text":"My fav restaurant hands down the food and the big chocolate cake just make my heart melt .","useful":0,"cool":0},"Q7WwqTScHvVOUtixHFUWTQ":{"text":"This is really good food at really decent prices. The waiters are fantastic but it is the ","useful":0,"cool":0},"q_B1BZplwBh-xLG0Gdcjyw":{"text":"Unlike some of the other reviews I do give the Chophouse 5 stars. Went to New Orleans to s","useful":0,"cool":0},"2C9kRlSS8SS9FuAbHUlTpQ":{"text":"World-renowned for a reason. I highly recommend the Thick bacon appetizer, a curiously gou","useful":2,"cool":2},"9NPIcmIo9Xo3b88Vbp7njQ":{"text":"Phenomenal. Up there with the best steaks I've ever had. Definitely go with the filet. Jus","useful":0,"cool":0},"kpyPM2e9aNsox5I0SLbMmw":{"text":"Solid steakhouse in the CBD. Not sure if I would regularly shell out the money for this st","useful":1,"cool":0},"Ly4K6gEmlpyv4uXFTUZXeg":{"text":"I'd have given them a zero. After setting a reservation,we arrived and they were not able ","useful":0,"cool":0},"0gHsFoc4HxTpHkVJ3IX2lw":{"text":"New Orleans perfect place for a business dinner with good layout of choices for entrees an","useful":0,"cool":0},"iT_a-lGO-nsY72Sb9toQfg":{"text":"Very adequate food and service. Would not recommend. Seriously, if looking for great food ","useful":1,"cool":0},"zOhB24XCTVmVC08yftvx3g":{"text":"Excellent staff, impeccable food. Crab cocktail appetizer, two sauces. Delmonico cut at ta","useful":0,"cool":0},"yBcVTTBtrDtJ6VH8vFr2zg":{"text":"Martin our waiter was awesome along with the Redfish! The Cajun spice for the steak was a ","useful":0,"cool":0},"mfAdCjD7sxlWU9RrEiz6bQ":{"text":"We made reservations the same day (Tuesday) with no problem. The service was prompt and co","useful":0,"cool":0},"E2QXxJE2yk5yVe98Mpqnhw":{"text":"I was here Saturday and my steak was cook perfect, I had spinach on the side it had a hint","useful":1,"cool":0},"BBVykpR6gSe1PZ9NXE91cA":{"text":"Oh Chophouse, how I wanted to give you more stars, but alas at the end of the day the food","useful":2,"cool":1},"DhkNGB6nLk_VHlkP7N53lA":{"text":"A good steakhouse when in a pinch. Service was excellent, food was great but could use mor","useful":0,"cool":0},"z_X44RmWPOTURaQh0VhPWg":{"text":"Fantastic meal! Steaks were great, and the unexpected star of the show was the lobster. Ap","useful":1,"cool":1},"I-NlTPsBZPFVddo2Ll30pg":{"text":"Interesting spot in the French Quarter... during my time spent here, I looked all over thi","useful":0,"cool":1},"vLKeiSIQ2_a6fgn2XPcKfg":{"text":"So I'm at the Chophouse and I'm thinking it should be good. Wow! The steak was as good as ","useful":0,"cool":0},"Db0asdNP5aXEAhZu4gvhyA":{"text":"Still, hands down, the best steak we've EVER had.  I had a filet mignon, and my husband an","useful":2,"cool":1},"tHjwL6e2tSM4CMMiVhp53w":{"text":"Chop house was nice... smells really good when you walk in .. the staff and service are ve","useful":0,"cool":0},"j1Yrk-LOK35fdKuWAUyHig":{"text":"Soooo disappointed in this establishment!  The porterhouse came out raw (purple) on the in","useful":2,"cool":0},"ap4Y5gN-dcWICqDWYegz3Q":{"text":"Dinner & business Social Fav!  Absolutely love the baked shrimp w/ lump crabmeat...and coc","useful":1,"cool":0},"9HWk0esybcBQ8XOYTau2BA":{"text":"All around delicious! We took a little break from all the amazing local eateries to experi","useful":0,"cool":0},"ECYjQloKyUq7GK3W_DS74w":{"text":"We ate here because it was dark outside, we'd just got into town, and it was the closest t","useful":2,"cool":0},"fAr_ec-JvDdNjHPf-W_vcA":{"text":"We had an early reservation for dinner so we could walk it off in the French Quarter. Our ","useful":3,"cool":1},"GUsMis46M_-SdJmCOG-7sg":{"text":"The food was great and the service was top notch.  I had the center cut ribeye, which was ","useful":0,"cool":0},"WNu2KMf6HG995SryfNDdKQ":{"text":"Outrageous is an understatement......staff, food and ambiance a six if you could.....any 1","useful":1,"cool":1},"Dy9wEGfwLrsVhlkxKjSvug":{"text":"We had a fabulous meal here tonight! We had a reservation but when we arrived decided to e","useful":0,"cool":0},"SyuC1Y5_rVVFQNuIcBOKfw":{"text":"For a chop house not worth it. Just okay at best. Steak was average service okay steak fri","useful":1,"cool":0},"jehSpO3Bg-1znF2yT_Bv-w":{"text":"I could not give this a 4 even if I tried.  I just say this place is \"stupid good\"...there","useful":1,"cool":1},"XcMYVHUcdnqmEdm63D6T9w":{"text":"The best dining experience I've had in a very (very) long time. Service is impeccable, ste","useful":0,"cool":0},"-qNnqJG-1CEVGaSkya9cnA":{"text":"The center cut ribeye filet was the best steak that I've ever had.    I hate to say this b","useful":1,"cool":0},"X8Ai5cm7EOGVb3PgjCxozA":{"text":"Oh boy, I couldn't say enough good about this place. We stayed next door at the St. James ","useful":0,"cool":0},"WdWngQODsnbp-XGxMlPy4A":{"text":"I dined at this establishment last night for the first time. I and my business associates,","useful":0,"cool":0},"ztMIfDT3ouG39ia72xOpGA":{"text":"Professionally operated with the customer and food as priority #1\n\nWe stopped in early on ","useful":0,"cool":0},"w57pIXAhjXMVeECZNDlr2g":{"text":"Bad experience here.. looks fancy but food was not cooked to par especially for their outr","useful":3,"cool":1},"sP83UXKxNqK6xjt3s0Il7w":{"text":"One of my favorite steaks in downtown New Orleans. I have eaten here multiple times and ha","useful":0,"cool":0},"g8vCLtnHxOmz0cDzWqC7RQ":{"text":"One of the best steak houses in New Orleans moderately priced for a melt in your mouth ste","useful":0,"cool":0},"dDT0uzh_i5aNkcNQolQYpQ":{"text":"I have had dinner at a few chop house restaurants. I stopped in to get a drink with friend","useful":0,"cool":0},"r1yObFJeeKFiB8byucir5Q":{"text":"We had a large group of eight. They were able to take a reservation (even during jazz fest","useful":0,"cool":0},"mHvLHZkZfY7Z5nsmWV7npQ":{"text":"Rather than the franchises steakhouses around our group came to Chophouse instead. We wait","useful":0,"cool":0},"sUY3coT8gvxg3JVsG-Vy7Q":{"text":"Food was rapidly served, assistant servers were great, personable, prompt and professional","useful":1,"cool":1},"dPPEHxEdSrqXZjXMyl2eQg":{"text":"The Chophouse is an embodiment of everything a steakhouse should be. The service is great,","useful":1,"cool":0},"NcF7lbnlw0gye6ySW2PSRg":{"text":"Everything was perfect! Food, service, drinks and even the lovely lady playing the piano. ","useful":0,"cool":0},"0Z4swZn3fpVuLVzXCYfUeg":{"text":"We chose Chophouse after being exhausted with the seafood/fried everything that is New Orl","useful":4,"cool":1},"y3knVLhRKG27avTNSAgFRg":{"text":"The service was very good. The del Monico steak was great. The stand out items were the ba","useful":0,"cool":0},"0q1Hrh2Cb4ALtimy117-EA":{"text":"The live piano music made the atmosphere. The service was very good. All of the items were","useful":0,"cool":0},"Bt6uYbyHOgDxtI7FZmGaiQ":{"text":"I decided to check this place out, and it seemed like the typical high end steak house. Ru","useful":0,"cool":0},"cy9L1r1FkqwdUInvhEEqJg":{"text":"Our first visit and were not disappointed.  Chose to sit at the bar and so glad we did.  F","useful":0,"cool":0},"DsTV5Xt8lxwva8JYRetrew":{"text":"Yum - this place had perfect service, steak, everything delicious and we will definitely r","useful":0,"cool":0},"rR1AS_HD0VM23GsgJu-PQw":{"text":"Came to New Orleans just for mardi gras. The first night me and my friends came here we we","useful":0,"cool":0},"dv0JDn2Qc7aeQSxvO7k5qA":{"text":"This place was amazing! The baked shrimp was absolutely wonderful.  They gave 6 large shri","useful":1,"cool":1},"cZLexto8bKramoqIDSauLA":{"text":"Very nice to have sat a party of 12 at 9:45 knowing we were most likely going to stay unti","useful":1,"cool":0},"EgOWHrfv6FvB58xtUEA5nw":{"text":"My new favorite steakhouse! Delicious food, excellent service and the best key lime pie! I","useful":0,"cool":0},"tpe9G0IeGCnDKCw3uMvStQ":{"text":"Had a late meal here and it was everything you want from a steakhouse.\n\nGood prices, great","useful":1,"cool":1},"QTdvCZD15pu5Rq7-P9tSTQ":{"text":"I was craving a good steak and this is probably the best Delmonico steak I have ever had. ","useful":0,"cool":0},"OkR95S_bh0SDitx_CJW35A":{"text":"Wow, great little find on Magazine street.\n\nI had a birthday dinner here and can't say eno","useful":1,"cool":0},"v9Hs_GLMzZxubmnYfgEDzg":{"text":"OH MAN!  I made a reservation on Open Table for 7 of us who had flown into NO for my husba","useful":1,"cool":1},"735GWqS7zA9PIZF1-LojiA":{"text":"Excellent filet 14oz filet mingon - cooked perfectly medium rare!  Definitely a fan of the","useful":0,"cool":0},"QqhCPGF1ytHjjfeY-j-QlA":{"text":"We can to Chophouse to celebrate our 3rd anniversary. While we didn't notify the staff tha","useful":2,"cool":1},"U8kbA16F5V_cfVV8OLiyBw":{"text":"I called to make a reservation (for my husbands birthday) a week in advance. Upon reading ","useful":0,"cool":0},"qVRkQNcTtpc92bHBGkFKqg":{"text":"Food is ok but service is slooooooooooowwwwww. And poor service for the prices they charge","useful":0,"cool":0},"xUVCp_UzeHEwHpsR9jNLzQ":{"text":"Crab bisque was the best. Bone in ribeye was great. Very cool old school steak house. Dark","useful":0,"cool":0},"oUhbhLuUn0YDqs8oxxW_XQ":{"text":"Excellent food at reasonable prices for a steakhouse.the piano bar is especially juice tou","useful":0,"cool":0},"VkelSknGYIHD3nVsf8x3-Q":{"text":"This is probably the nicest fine dining restaurant I've visited as far as atmosphere and d","useful":0,"cool":0},"1wSjg861UCLaapy_1H8YSg":{"text":"We came in with a group of 9 and the service from start to finish was excellent. The staff","useful":0,"cool":0},"WIDp_rPus23V7rv1Foe9GA":{"text":"Delicious!   I dined here with a group of friends & everyone loved their food! The steak w","useful":0,"cool":0},"oEfO3j4YSdZS1gLbTlZ_vA":{"text":"My husband and I ate at Chophouse for our anniversary! I ordered the fish with crabmeat, i","useful":1,"cool":0},"mliEu4kQz_nI0WrGr2gN3Q":{"text":"Parmesan Garlic Butter Shrimp (14$). There really wasn't anything special to this appetize","useful":1,"cool":1},"vBzIQiTOWXznL3BARVL8rg":{"text":"Visited this restaurant with my husband and everything from the moment we were seated unti","useful":0,"cool":0},"v-2IUYVNHvs4Aml7zJEcQg":{"text":"Amazing food! Great wine list. Upscale Ambiance. Great mix of dressed up professionals and","useful":0,"cool":0},"Mo2nZx09xq2eRluo9s8ZNw":{"text":"This is hands down one of the best restaurants in New Orleans. The food is amazing, the se","useful":0,"cool":0},"CUt2FHT0LOQtleU6eY6hvg":{"text":"We went to this restaurant with a party of five.  From the bar tending to the time we sat ","useful":0,"cool":0},"-Fh8nDkPW4uUYy6H378vhQ":{"text":"The food was not as good as expected based off of the reviews from yelp. The baked shrimp ","useful":2,"cool":0},"k_1dlt0hFWrmhxMqtZNl1A":{"text":"Unequivocally, this was the second best meal I have ever had in my life. I have high stand","useful":3,"cool":0},"L04kQ9Oyr4NBIwvW1h-jOw":{"text":"Excellent choice for our birthday celebration    My twin and I decided we wanted to go som","useful":0,"cool":0},"M40xikVGi1e9ZNN7hUPY9Q":{"text":"I can say, without a doubt, this place has the best steak I've had in my life and I've had","useful":0,"cool":0},"v0J681fWxiL9UYPKrEQphg":{"text":"I love this place! The waitstaff was warm and accommodating- when we weren't certain about","useful":1,"cool":1},"2BMzcaN0bjPEJrE3K8lOzA":{"text":"Made a reservation and was greeted and seated on time. The staff is friendly.  We started ","useful":1,"cool":1},"-HfFnUggzBpNJXUDoGtkeQ":{"text":"My dining experience  at the Chop House was wonderful. I  started with the baked shrimp  a","useful":8,"cool":4},"z5rkBpnjGN15bPAJvqNXiA":{"text":"my wife and I ate dinner at the Chophouse on Saturday night.  It was excellent in just abo","useful":0,"cool":0},"FLV_tZWsFzJ1pyCXKRldmQ":{"text":"Fantastic food and service.  It is a must go place.  Loved it.... stone crabs are back.  E","useful":0,"cool":0},"U4iZfbkmmZrjRWgWO3sExw":{"text":"The food here is amazing. Everything (steaks and shrimp) were cooked to perfection. The re","useful":0,"cool":0},"xS9FQmxgzj2LNRycsObSEQ":{"text":"Best. Meal. Ever.   We had a large party (45) and were treated like royalty.  The seafood ","useful":0,"cool":0},"zeRkJQoX34YePAHibmL_1w":{"text":"Ok, really disappointed tonight, was expecting a lot more.\nFirst off thou the service was ","useful":1,"cool":0},"dO-Z76Rs0LJP3MjGZDUagw":{"text":"My first time here and the food and services was great!!! Jason our server was very pleasa","useful":0,"cool":0},"xwzDR6AXQItgRJQXLCBhIQ":{"text":"The Chophouse is at the top in New Orleans. The food was great, excellent service, the man","useful":0,"cool":0},"yZTRvFLeMDEH_ODXEKzDcQ":{"text":"Completely enjoyed our meal last night. Went with a large group and the staff was very acc","useful":0,"cool":0},"pdtzl8d5S4-AxOr9X1X0Vg":{"text":"Chop House New Orleans offers 'Pittsburgh Style' Steaks. Got my attention! Food was wonder","useful":0,"cool":0},"nkg7Qm6cGJV4NBr6u_5f-g":{"text":"Dinner was phenomenal! Between the service and the food, I could eat at this place over an","useful":0,"cool":0},"gNZv7WBONxglwmIzrxG2jg":{"text":"We went with a group. The waiter forgot my appetizer and salad order. A person at our tabl","useful":1,"cool":0},"XiMNCMGlm3_tUquUex_LhA":{"text":"We went there with another couple.  We wanted to try a new steakhouse in New Orleans.  I w","useful":2,"cool":0},"gCr6bcDQumNv7xBaPzEhcg":{"text":"Visiting Nola for a conference.  Arrived late on a Sunday night. Was in the mood for steak","useful":0,"cool":0},"eeVSEhiWd-JcoeJY_APpSw":{"text":"Never did hear from the establishment for follow-up. Received a response to Yelp but never","useful":0,"cool":0},"rHDi9Ai5sTLkLlYRKfpR1Q":{"text":"Amazing dinner spot.  It's an intimate and very well done establishment.  My fiancé and I ","useful":0,"cool":0},"scQT3O0gQ5E3FhjejbBjfw":{"text":"I celebrated Thanksgiving this year at Chophouse New Orleans. My Wife and I both had steak","useful":0,"cool":0},"Ay44mnn95HtR_bz63HM3Gg":{"text":"Best Stone Crab flown in fresh from FL each day.  Excellent  service with prime New Orlean","useful":1,"cool":1},"j_1U8dEPrZLx8keYEWoJJQ":{"text":"We were seated immediately, though it was a busy night--we just were lucky. Our luck conti","useful":0,"cool":0},"NO2k7VgPU4Hplh2iwZIACA":{"text":"Went for my birthday on 10/30/15. They stuck us in a corner so in order to get up and move","useful":2,"cool":0},"BNqiD9nq0Bj9AZ0wVihtVw":{"text":"Service and food were good however we have had better.  We travel often and our friends al","useful":0,"cool":0},"7BC8UzGpNjyzyw32pwEuzA":{"text":"5 stars food, service and atmosphere. Steaks melt in your mouth.","useful":0,"cool":0},"Ix4s5BpI2KtqtgVi2skC8w":{"text":"The service and ambience were excellent but for $72 I expect the food to be good. I ordere","useful":1,"cool":0},"k1dCoZPC3_gPfhpRNOb5AQ":{"text":"Omgggg where do I begin. Chophouse is freaking amazing. I enjoyed everything about it. Gre","useful":0,"cool":0},"dW0jEXhPXGvSL_ed03OhHw":{"text":"Ate here on our recent trip to New Orleans. From the pictures on the website and reviews w","useful":0,"cool":0},"O53GZ8GV6oAg7NfN-dkJmg":{"text":"Loved this place! Great service. 3 of us loved our dinners! The potato cart prepared my ba","useful":0,"cool":0},"L_1CqEHIGk00wwzwE2e1zQ":{"text":"This place had the best lobster I have ever had, anywhere! I have to say that I was very i","useful":0,"cool":0},"haT4cjI1cpX2yw7xDyhlKA":{"text":"On our last night in New Orleans, we decided to live it up and eat somewhere new an a litt","useful":1,"cool":0},"6IX1PSGnidS3fNDtdqtzeg":{"text":"Great place with amazing service and quality food. Went here for a birthday and the staff ","useful":0,"cool":0},"7GjVvvBg1sU5M6OXrRFT7w":{"text":"Perfect!  Nothing bad to say at all.  Our server, I think his name was Garrett, was funny ","useful":0,"cool":0},"Ta-BfH4AAizDurkJxAhpWg":{"text":"I'm not sure I have enough superlatives for the Chophouse. Everything was absolutely excel","useful":1,"cool":0},"DTmkZHz2Tb7-P0dF0vPxxA":{"text":"This is definitely a tourist place. I really wish the reviews that other people had left h","useful":0,"cool":0},"ikgqWrhArhLZuR_z4B_hqg":{"text":"Excellent food and service,  I would recommend it. Piano player was off the charts. Handso","useful":0,"cool":0},"3Kq1T-bXbHCFVhVKOuLtjA":{"text":"Incredible just like last time... bacon appetizer was fantastic...  the center cut ribeye ","useful":0,"cool":0},"yBZWX2dWxtW5IcsnUrDtfA":{"text":"Never got a chance to taste the food. The guy doing seating  in an empty restaurant did no","useful":6,"cool":1},"QJZWcdj804zw3ULp1RifoQ":{"text":"Had dinner tonight. Food and Service was outstanding!  Tommy and the service team were mos","useful":0,"cool":0},"3Vu3jAFpiF-7LUlyRn1qeA":{"text":"I went here alone while on a business trip because my hotel was right across the street an","useful":0,"cool":0},"QSphgY-4ApFhbinr4dTiRg":{"text":"We really did not want to go to a steakhouse in New Orleans but after 9 nights of Cajun/Cr","useful":0,"cool":0},"gycNA_fSnw4jNT4NZn6lsQ":{"text":"Today we are Celebrating my pops birthday. We are from California, and a local referred us","useful":1,"cool":1},"yrsFioImUmLbpCRZ8X7vEg":{"text":"No waiting area , the place is nice . I ordered the center cut ribeye , medium cooked Caju","useful":0,"cool":0},"dgrjNOH348jPyyhz2ifdnQ":{"text":"Everything here is AMAZING!!!  Food, atmosphere, service!  Our server (Rhymes with Monica)","useful":0,"cool":0},"uDN0I3PNwvxUUc8f64CJHg":{"text":"7 word review:\nGreat food, atmosphere. Pricey but worth it.\n\nHad the petit filet. Awesome!","useful":0,"cool":0},"0tjj8QE89PCq4h81-_i48g":{"text":"Wonderful find within walking distance from the Hilton Riverside - superb steaks and ambia","useful":0,"cool":0},"U2XoTaQdWEs9U7w8RzxmwQ":{"text":"Great food, good liquor but by far the best thing in Amanda walker at the piano.","useful":0,"cool":0},"lrT5YKIJLg9MjakQN7mWRQ":{"text":"I have dined at Chophouse several times. We went to the Saints game on Sunday and had earl","useful":0,"cool":0},"B-atkMGLoCpZFB9R-fHgeg":{"text":"My husband and I went here for the second time last weekend on a date night and I must the","useful":0,"cool":0},"prrF1Tb9XNsQOOY0U7CPWQ":{"text":"As someone who is regularly at steakhouses for business, I can tell you the food here is g","useful":3,"cool":0},"LiJXrFHDe1qiJ4Vwnkzj1g":{"text":"Great place with fantastic service, amazing atmosphere with pianobar and perfect steaks. N","useful":0,"cool":0},"YJhXUnfwaVHadm_cUBYm8w":{"text":"Very nice restaurant. Baked shrimp and lobster tail was mouth watering, filet mignon was a","useful":0,"cool":0},"hH9nOzCNPGk__jh6xm14jw":{"text":"I loved this place! The staff was friendly and the food was delish.  I had the steak and l","useful":0,"cool":0},"76vUm9caxFvhqbA3t8A0sA":{"text":"Great drinks & an amazing ambience usually. I've lived in the city for years & always come","useful":1,"cool":0},"_AwIGyRhNRGGhMMBZ9s1ig":{"text":"Old world table-side service suits this proud NOLA establishment and apparently its client","useful":0,"cool":0},"8c38C3VYAFKJRgGMq8sXzA":{"text":"If you have a great appetite for some wonderful food and service please come to this amazi","useful":1,"cool":1},"PX_-C__bO0xd2NXGHF9EhQ":{"text":"Came here for a bachelorette dinner, wanted something very chic with great food of course.","useful":2,"cool":1},"_8G9KAUWZwBB-3Z14P57kw":{"text":"The Chophouse's 12oz filet was so Amazing, we came back the next night for a repeat and we","useful":0,"cool":0},"nK2tnYsd8vAwOL0khAQd_Q":{"text":"Easy to just walk in. Have had many good meals in the past. This time 10oz strip was mediu","useful":0,"cool":0},"GQVzKN2Bj2kHaRztIaBgnw":{"text":"Perfection!!!! That atmosphere, cocktails, and divine menu were a perfect Friday night out","useful":1,"cool":0},"iNkVEgaaWE8Hg7uLvZ7krw":{"text":"The food wasn't as good as I we would like it to be. Friendly service and good ambience. T","useful":1,"cool":1},"QBbI3fIAPFmEXWCM64Rsaw":{"text":"Garlic Parmesean Crusted Shrimp. :)\nNew York Strip, Cajun Style. Charred but delicious.","useful":0,"cool":0},"JgPNjb2crdGTACuK8cxFtQ":{"text":"Chophouse is usually the first stop on Thursday nights for me and my girlies. It's  Ladies","useful":4,"cool":1},"gN6-RlVILTpLWaN4cHChCg":{"text":"No serious complaints. I'm just not a fan that they grill all steaks Philadelphia-style (c","useful":0,"cool":0},"v85pruQs9HNPAXoNgqB_cw":{"text":"We had a party of 8 and everyone enjoyed their food. The service, the food, and the ambien","useful":0,"cool":0},"BfFVgDxKI0MEoWexT2zEow":{"text":"The best steak house we've ever been to! Best service, wait staff, atmosphere, and food. T","useful":0,"cool":0},"m8KYLjAF66Rz56VsgD05BQ":{"text":"Ate at the bar. Great service.  Del Monico was awesome.  Sides wew great as well. Would de","useful":0,"cool":0},"NdDMCO5tUAhgRwbFBcVoKg":{"text":"I have been wanting to write this review for MONTHS now, but lazy/tired/busy ...excuses, e","useful":5,"cool":3},"jnb9WHZjug8XIeRrufbo8w":{"text":"The food is simply amazing. 14 oz Filet was the best steak I've ever had, and yes that inc","useful":0,"cool":0},"NpkuA6SCdD_p1yZMvL0NrA":{"text":"I was completely underwhelmed.  Considering the price point, I recommend avoiding.  There ","useful":1,"cool":0},"sXuJTQ_-yvU4F0LlQdtLMg":{"text":"Officially my favorite restaurant in NoLa!!!!  I highly recommend their seafood platter th","useful":1,"cool":0},"QKPBTuEDWnTIknzLH_gx-A":{"text":"Yummmm ... Enjoyed a nice small steak (center cut rib eye) and steak fries.....also ordere","useful":0,"cool":0},"Uhe3AFnZcWLurlmLO5IigQ":{"text":"Great Place only reason for 4 stars is the wait in the food. Our waitress took forever to ","useful":0,"cool":0},"kC38DFWIRqDshhH8-5An9w":{"text":"So this place beat out my regular steak house, in a local name the best steakhouse competi","useful":1,"cool":0},"092YlfDRX9vCNJWYokcl0g":{"text":"Oh my. I live in big steakhouse town (Dallas).  Chophouse would be my regular here, especi","useful":0,"cool":0},"WJa-Av5kQYMqtd7EG6iFhQ":{"text":"Great ambience, wonderful food and absolutely perfect wait staff. Highly recommend. (Steak","useful":0,"cool":0},"1xTcT8G-eYySo-MfWezgBg":{"text":"I had by far one of the best steaks ever!  My medium well + filet mignon was cooked perfec","useful":0,"cool":1},"ooC_LKlxV1mD1bptAiTYvg":{"text":"This may be my favorite steakhouse in New Orleans. If you go order the seafood platter app","useful":0,"cool":0},"3__3YN-mhbKv42LqtD3z8w":{"text":"Very attractive high end steak house. Valet parking. Went early on a Tuesday night and onl","useful":2,"cool":0},"5M6AlUKZL0LQhn9pfDT6og":{"text":"Quite possibly the best steak I've ever eaten. I had the Delmonico prepared medium rare, a","useful":2,"cool":2},"k_-fDKG39ezuSdWDQtHW4Q":{"text":"Made a reservation the day of our wedding and stated we were excited to spend it at the ch","useful":0,"cool":0},"NHoIMTZEoFuxNl2QaBRVdA":{"text":"Walked in without reservation and we were able to seated at the bar.  The bartender was ve","useful":1,"cool":1},"LTiK257vm7bJ_KA6SiQRiQ":{"text":"Been to a lot of steakhouses in my day. My belly shows it. Rome wasn't built overnight and","useful":0,"cool":0},"zFOKbDlZt09LiMHAxKQUKQ":{"text":"The best....\n\nAppetizers- Shrimp cooked in butter sauce, with Parmesan cheese.....deliciou","useful":1,"cool":0},"_gqCFn1jWpPgQhg6qIN5ZQ":{"text":"This will be a complete review of my entire experience-  \n\nThe wife an I decided to stop i","useful":0,"cool":0},"msoVV38BlBvWcseduYGGCQ":{"text":"Went with a group of 13 for a bday dinner. No one's steak was cooked to the right temp (al","useful":1,"cool":0},"6hfg92pLP0CpMcSnKoGs2Q":{"text":"Good food, good service and nice atmosphere can sum up this spot. I ordered the Delmonico ","useful":1,"cool":0},"Xxia1tmLtuk_PuuiEk3qwA":{"text":"Great service! Went and sat at the piano for my birthday. They sent me cake and a card! It","useful":0,"cool":0},"bw5vMy84SGqPlgGwDoTQMQ":{"text":"Loved the food! Went here on a Sunday night and ordered the chophouse salad and the bacon.","useful":3,"cool":3},"KdTFUEqoAS06PN9Bjgx6Pg":{"text":"We had an amazing pre New Years meal here.  Even though it is a steakhouse I ordered the s","useful":2,"cool":0},"4iMkkZLka6hEiGzAI7r96g":{"text":"My husband and I celebrated our anniversary at The Chophouse and we were impressed. The at","useful":0,"cool":0},"lVMHWcgSvCXne5TMAhJzlg":{"text":"Staying at the W nearby and surprised about this place. It ranks among the top steakhouse ","useful":0,"cool":0},"xP1HZXTcbxNBaXTcdv3wQg":{"text":"Filet mignon was delicious. Be sure to bring breath mints after eating the sautéed spinach","useful":0,"cool":0},"P-btPILEmFzcywYnHnqvPg":{"text":"This was a very rare experience for our group. In that all 5 of our steaks came out very r","useful":0,"cool":0},"3QoM0MKOA835CBXhhXojKQ":{"text":"Can't go wrong with this place.  Perfectly seared steak. Awesome baked potato.  Service to","useful":0,"cool":0},"H4U6E79M2BAmr_emTuosVA":{"text":"We had reservations at Bon Ton Cafe across the street, but since we needed to kill some ti","useful":2,"cool":2},"mKIY2z-wGRrad-wo2dpSAQ":{"text":"Had a good meal here tonite. Hosts were polite, and a professional piano player / singer p","useful":0,"cool":0},"N6hoGeTr8HPXAlMVvlt2RA":{"text":"10oz strip,garlic spinach,baked shrimp,loaded 1lb potato, mushrooms n onions. Wife had the","useful":3,"cool":2},"EGlCzZgD4psoonU46R1ujw":{"text":"We happened to arrive on an evening when Amanda Walker was playing the piano so we sat in ","useful":0,"cool":0},"qpIjNsyx0b8JM7pI5ESzHg":{"text":"Had the most fabulous dinner. To start we had the seafood platter of stone crab, lobster, ","useful":0,"cool":0},"sVJ_LyjUNtLcrwR9xrwtvg":{"text":"For my appetizer, I ordered the crab bisque, it was the best crab bisque I've ever tasted!","useful":0,"cool":0},"JStqNcJuCtsHPERl7ZmYQw":{"text":"Fancy dining, get your good clothes on. I know 'Chophouse' is a steak place. Full disclosu","useful":3,"cool":1},"GIl4j9HVzvHRsd2LxR85cw":{"text":"Chophouse has an old New Orleans atmosphere with brick walls lined with gas lanterns and w","useful":1,"cool":1},"s92cL5epInZGS1WfqzCs-g":{"text":"I was searching for a good steakhouse and confirmed this one was the best one in town with","useful":0,"cool":0},"XESKT309kfSdI65qCs2DFg":{"text":"My best dining experience to date. \n\nCame here with a large group to celebrate my brother'","useful":4,"cool":0},"tzuCva48iD4J_l_4AwVpCQ":{"text":"The best sea bass in town! Really good service! Manger was awesome! Horst was great! Food ","useful":0,"cool":0},"F9f_uS82cmdwKTDXybTDAQ":{"text":"We made dinner reservations for our anniversary dinner, but I made them for the wrong nigh","useful":0,"cool":0},"f78JwK42Vh-js4qOQuFmig":{"text":"Hands down the best steak I've had in New Orleans! I also had the crab bisque, creamed spi","useful":0,"cool":0},"QeXgna1_xYvNDGt9mUokrg":{"text":"Love this place! The food was really good! I originally discovered this place in Buffalo n","useful":0,"cool":0},"M9pDAXdDVy7OVlFRO4vCBA":{"text":"The Stone crab is back for a limited time and is phenomenal!!  We got it added on the seaf","useful":0,"cool":0},"S35q6teSht6mpxbsdPs4Lw":{"text":"Will start with good:\nYou can make a reservation online which is very convenient. \nGood lo","useful":0,"cool":0},"-fs9xvvlhb-eC-7RgYpcaQ":{"text":"So disappointed. This is one of my family's FAVORITE restaurants in New Orleans. We had a ","useful":1,"cool":0},"i9uUQkJmNashp_60Ba9TVA":{"text":"Stopped here for a late afternoon drink. Great space reminiscent of an old school New York","useful":2,"cool":0},"dYH9bkmVEVZu1SccyQrp0w":{"text":"I had dinner here recently. I was looking for a nice steakhouse during a visit to New Orle","useful":2,"cool":0},"fnCZVx4R8oX4OPK1fRcNWw":{"text":"I was surprised we were able to get a reservation on Fat Tuesday but I am glad we did, thi","useful":0,"cool":0},"sRL5aq14Yudtk5s6-c4SpQ":{"text":"We had a wonderful time in the bar at the Chophouse. Steaks and food  was great.  Piano mu","useful":0,"cool":0},"Q1zhcMATfRPxGtfiO56KCA":{"text":"The service was outstanding !! Steaks were cooked perfectly and excellent cuts of meat.  T","useful":0,"cool":0},"hl6N9K_CL1JS1gnWANFdrw":{"text":"I've visited New Orleans a few times, and have always gone to Ruth's Chris. We had Ruth's ","useful":2,"cool":1},"ltW_nxeanqR-YK-QvZ73dQ":{"text":"I hate to write this review because the service was great and I know everyone was trying..","useful":3,"cool":0},"8TE1VyDf2w46khjSPLZrGA":{"text":"We would highly recommend this place.  The service was fabulous. \n\nStarted with chopped sa","useful":0,"cool":0},"z-s4I1EdVRK1QI1W5gFSjg":{"text":"Got to say I was disappointed.   Had a bone in ribeye.  Was suppose to be medium rare and ","useful":1,"cool":0},"f-p3nk0SeXoU6SfTKEc1mQ":{"text":"Great steak! Wonderful potatoes and creamed spinach! So so good. Would recommend!! Attenti","useful":0,"cool":0},"8jgzh27f36tr7ASTWcNOKQ":{"text":"Unfortunately, I brought a group of 10 visiting Japanese friends for dinner and I would sa","useful":2,"cool":1},"w0CZOunGdf31Akc929sEEA":{"text":"Visiting from Atlanta , California and Va . Party of 16 late reservation... the restaurant","useful":1,"cool":0},"5fgsHem0I28g3wVAN6_0ZQ":{"text":"Chophouse is quickly becoming an annual event for myself and my husband. We first experien","useful":0,"cool":0},"kXVbVMa59xUsVUUyvG4JTg":{"text":"...I feel like this is one of NOLA's best kept secrets!  This is one of those..\"special oc","useful":4,"cool":2},"2eSbWo0xK1lecWiQD_Fn8g":{"text":"Over rated. We made a reservation for two and were promptly seated. After looking over the","useful":1,"cool":0},"TWudSBcAEh10y1bcVQyd5A":{"text":"The service is exceptional!  The food is delicious and the service staff will wait for you","useful":0,"cool":0},"h9wtZAb_dYPKuxxFqcyLqA":{"text":"First off, this place is ridiculously loud - you have to yell at the person next to you to","useful":0,"cool":0},"7wlR-u6clP4PCipuNiZu8A":{"text":"Make sure you make a reservation, as this place gets filled pretty quickly. They do offer ","useful":3,"cool":1},"L1uKdXZ5ZsOMsfuN_5hlXw":{"text":"Chose this place to come for my anniversary because of the good things i've heard from man","useful":1,"cool":1},"IZ0gi4rybnyJ9hU7hNjqJQ":{"text":"I thoroughly enjoyed my Chophouse experience.  The food was delicious, the service impecca","useful":6,"cool":4},"7p3QBAtfT6h5yFc7G2Xh_A":{"text":"Great food, great service and great place!\nI ordered the bone in ribeye it was amazing! Al","useful":0,"cool":0},"2z5jwvKO_y4ycwKms6bsTA":{"text":"The NY style thick-cut bacon was a tasty starter (and is geared toward bacon lovers). I or","useful":0,"cool":0},"lFKO10_43Tr27x9SYzTBJA":{"text":"Obviously, you come to a chophouse for steaks. Turns out, they don't know how to cook a st","useful":8,"cool":3},"bBZWysy4i1_zqIYwCpoz6A":{"text":"Went in with friends last night for dinner. Ordered the delmonico steak and family sized s","useful":1,"cool":0},"crD4Qzxs9idEkiB2I-Qmog":{"text":"The food is great. Seafood is top top top. Steak was prime. The staff is very accommodatin","useful":1,"cool":0},"r9uMXIsshNFetegxLr5VaA":{"text":"This was a really nice steakhouse.  We decided to celebrate here for my 30th birthday and ","useful":0,"cool":1},"5dt2NjqxZ9_775k8MDxNHQ":{"text":"Daniel the bartender was amazing. Very kind and made great drinks too. Went back for dinne","useful":1,"cool":0},"5qSDx5ozbL7F0UdiA0yx-w":{"text":"We had dinner here for 10 people.  The food and service was outstanding.  We recommend sta","useful":0,"cool":0},"_AyRsbWJoExYNViaf3uGhA":{"text":"This was an amazing meal. The service was perfect and there was never a moment we needed a","useful":0,"cool":0},"yTyI9EW4Mc_hyWbf2K6IZw":{"text":"My wife and I popped in here for a light dinner. We sat at the bar and had a fantastic bar","useful":0,"cool":0},"wmQauzuIxckjBMmNVQd6BQ":{"text":"Great service. Very good wine selection. Actually everything on menu looks amazing. Had 8 ","useful":0,"cool":0},"2CS_nxI92B4iBcIRTZwCGQ":{"text":"One of the best steak houses I have been to. My review is a little late, but I can remembe","useful":3,"cool":1},"3ArouftXS6ZUT1-daAwICQ":{"text":"Absolutely delicious!  What a gem of a place.  My steak was mouth watering delicious.  Whi","useful":0,"cool":0},"WCAA8inirRgABufHhDY5Bg":{"text":"0 stars. Birthday perfectly ruined due to Managers inability to resolve my husbands issue ","useful":0,"cool":0},"2eOg0OZ8bjOyPTkYzB58RA":{"text":"The food and service were amazing. I love the shrimp and specialty cocktails.\n\nThe pianist","useful":2,"cool":2},"PyhAj9d8CicNGNnv9BThTw":{"text":"I did a search online and in tourist mags to ultimately find Chophouse. It was consistentl","useful":1,"cool":0},"NzIYrJgyFEP7jxxAZ11t-g":{"text":"Home run! Best meal, ambiance and experience maybe ever for me, my wife, plus one. Cocktai","useful":0,"cool":0},"pOqzEG-7as255JAOrFQA5g":{"text":"Simply put this place is awesome!!!  From the service to the steaks that they offer. It wi","useful":0,"cool":0},"lZgoCrNn8sUNCIXOVxgang":{"text":"First time in New Orleans and this place nailed it.. after eating Oysters all over town an","useful":2,"cool":0},"XoTUItsIkm9mdIRdnyaK8Q":{"text":"We ordered snow crab legs @ $23.00 per claw.... that was the best part of the meal, but no","useful":3,"cool":0},"hODxnJI1o3Pny2j7kdJTWw":{"text":"I have been to the Chophouse a few times, and I have never left disappointed!  They have l","useful":0,"cool":0},"nZSdy6OuBwUUgowF6XZGNw":{"text":"This place rocks!! I had the bone-in ribeye cooked medium rare. All their meats are usda p","useful":2,"cool":1},"dxEL5Vi3CbmohMc8i4qSFw":{"text":"A group of us ate here last night.  We had some kind of a mix up making our reservation bu","useful":0,"cool":0},"MYlhBBcHe128L5oTaKQN7w":{"text":"Was in town in business and found this place. Sat at bar for a steak and a coupe glasses o","useful":0,"cool":0},"Qs1altPyXEz17awyAa6E4w":{"text":"Chophouse is by far one of my favorite places in the city! We had the most amaze experienc","useful":8,"cool":4},"oE0FsOGqs8rt-pnYLZ3nSw":{"text":"Best steak I've ever had!! Perfectly medium rare and full of flavor! The loaded baked pota","useful":1,"cool":2},"CZUVeXrcz7ScfDRCUn1qQA":{"text":"I do not think my words would do Chophouse justice.  We went last night for the first time","useful":0,"cool":0},"u2OjleEJPUYbLULi7d94Zw":{"text":"I made reservations on a whim at Chophouse for Father's Day.  I've passed Chophouse a bunc","useful":2,"cool":1},"k2Glza1hkX5YcW0WgKJ4ZQ":{"text":"Since practically the whole city shut down for Hurricane Nate (thankfully, the storm drift","useful":0,"cool":0},"fJeoKsK30GiBNo_-Mya23w":{"text":"Essentially a steak house, but with some good seafood options too.\n\nCame here with five ot","useful":0,"cool":1},"ov83Sxh-y6rZ-eiE6Bxguw":{"text":"We were really excited to come have a great dinner before the Taylor swift concert. The se","useful":0,"cool":0},"XiHqzIf9RFsGt_1JxBKyfw":{"text":"What an amazing experience! From the wait staff to the food itself, we loved every minute ","useful":0,"cool":0},"JBqlq4X4NRaSZuKLk_rP-A":{"text":"In late March five of us met for a Thursday night dinner. We delighted at the drink specia","useful":2,"cool":2},"rUWXM-GCqQ5GjcWGWae8QQ":{"text":"Good steakhouses are all a bit pricey, as expected, since they are serving  good cuts of b","useful":1,"cool":0},"sLn2Ywkm3MFacpBmxl9u5A":{"text":"This place was nothing short of incredible. Steaks are amazing and the sides are so delici","useful":0,"cool":0},"J8dWCj3usSHKKWLaBHmo-w":{"text":"I recently had the opportunity to visit the Chophouse on a Saturday evening for 6pm for a ","useful":5,"cool":2},"FkqIUmXL7M3UaH1b7K5PoA":{"text":"I really enjoyed this place until the last time we dined here. It was Easter Sunday for lu","useful":1,"cool":0},"RJLTAUyt0iieFP1iBhvwtA":{"text":"Sooooo good! Crab bisque was amazing. Also had the baked shrimp as an appetizer, really ta","useful":0,"cool":0},"1fMMrR8o5Anb2I6xbBhbkg":{"text":"Great service and presentation. Steak was a bit charred and lobster overbroiled. Pricey to","useful":1,"cool":0},"fg9NJ6Wwx9iTozncbCHdUQ":{"text":"This steakhouse was so good! We ordered the crab bisque, it was the best crab bisque I've ","useful":0,"cool":0},"qceU4NaKKbxRihZv8aJbDg":{"text":"Seafood Platter was AMAZING!!! The staff were all very nice and attentive. Great steak and","useful":0,"cool":0},"fmwGQrIICvPSgiuE4w4uNg":{"text":"The crab bisque was, as noted by other reviewers, excellent. All the food, in fact, was ve","useful":0,"cool":0},"e21Wo1IcfEJX1tII2rZkvg":{"text":"Celebrated my wife's birthday and we were not disappointed! The food (steaks and seafood ,","useful":0,"cool":0},"3bn1nR_N1_aKYZfaQVETtw":{"text":"From the moment we walked in we were impressed!  Made a reservation for 6 pm on a Friday n","useful":0,"cool":0},"h-4WRf0_l-cDDWO31zWDdg":{"text":"I love trying local businesses so I was really excited to have a date night at Chophouse. ","useful":0,"cool":0},"PgmogKdVi_kWGs_NP5QsuA":{"text":"An excellent dinner complemented by very good service.  We had salads to start, one Caesar","useful":0,"cool":0},"qGbEFhAkDAMHCc20eJwh_Q":{"text":"We were in town for Jazzfest & our anniversary and went here solely because it was the onl","useful":2,"cool":0},"wIrER9G6TSMzlR3f4LE4bA":{"text":"Very noisy, steak was burnt, cocktails not the strongest in the world. If you are with a l","useful":0,"cool":0},"xSZeeEin6TEZPccc3tI3JQ":{"text":"My wife and I were looking for some good food near the Windsor Court Hotel after 10pm whil","useful":0,"cool":0},"ND4kucSDjvLMGOoOR5K_Bg":{"text":"Oh my...where do I start? I can say without a doubt I had the best meal of my life here...","useful":0,"cool":0},"GQfxV1uZ9qX5y24Zg0Ku4A":{"text":"Visited here on a recent trip to NOLA and had a pretty good experience. I ordered the 16oz","useful":0,"cool":0},"Vb5zr6r9f8iVmaEVoS3AHQ":{"text":"I went to this restaurant last year and got the twin lobster tails and they were good, jus","useful":0,"cool":0},"kBpNId84Y2nGvLtY1_KWGA":{"text":"This restaurant was recommended by the hotel we were staying at and after asking the waitr","useful":0,"cool":0},"4W-5atsvoHIB5dKnKfXgrw":{"text":"Made reservations and still had to wait, which was slightly ok. Food came out hot and quic","useful":0,"cool":0},"JdXjhMNBLL6jeutRgfdv1A":{"text":"Always good when the steak melts in your mouth. I'll also take a second to repeat the earl","useful":0,"cool":0},"pcehCZ_BnttUsRRHmUo80A":{"text":"Came for a birthday dinner. Atmosphere was nice. Food was good. Would not recommend the le","useful":1,"cool":1},"x9L124g2DSWslx0Rilu0KQ":{"text":"The concierge from my hotel sent me there this evening without reservations or mentioning ","useful":0,"cool":0},"5pr3yBgPzg-yNoazp0I6rA":{"text":"Made reservations at the Chophouse as the culmination of a trip to New Orleans.  Perhaps t","useful":2,"cool":0},"7Tu7LmteafkMP4TALJ81aw":{"text":"We were here last Friday night for dinner. (9.17.17)  I cannot recommend it highly enough!","useful":1,"cool":0},"7po8aNBQ0IANoroJgGNdjQ":{"text":"What can I say? I knew it was going to be great when I walked on the door, the sweet smell","useful":0,"cool":0},"0PIlX3zGk1on0j81N9nCbA":{"text":"Chophouse is a really delicious restaurant with a nice atmosphere and good service.  The b","useful":1,"cool":1},"C5UVTkVv_EEdS9Me6qoRKA":{"text":"great atmospher with light music. The waitress is considerate and nice. Ordered seafood pl","useful":2,"cool":0},"RL7QSYMPTeLr84KneYPEPA":{"text":"Prime, and when asked for rare on the rare side, they deliver. I hate it when anyone cooks","useful":0,"cool":0},"yPukkE-tlqgnqw7nGo1T6A":{"text":"I selected this restaurant for my birthday dinner for 12 people. Food was amazing! Very ac","useful":0,"cool":0},"sTGujT8oBgHJEpwFE6OVBg":{"text":"This place is trendy and very good, our waiter Jason was very nice and fast, the only down","useful":0,"cool":0},"CtobVsbNL-JtONKgv_GGpg":{"text":"First of all dinner was absolutely amazing and beautiful for my friends birthday tonight, ","useful":0,"cool":0},"yEy0acf6xSpW1cs8D8TRkg":{"text":"Chophouse has quickly become our go-to steakhouse in NOLA. Our most recent trip was to cel","useful":0,"cool":0},"mieDvfBKra02JEKjJ3SFeg":{"text":"10oz strip,garlic spinach,baked shrimp,loaded 1lb potato, mushrooms n onions. Wife had the","useful":1,"cool":1},"797crVXOr8tE45Quv5YTeQ":{"text":"I was New Orleans for the French Quarter Festival, having had a great time at day 2 of the","useful":3,"cool":1},"lHKzV5zYRwy5RhEhQV9lsw":{"text":"The environment was a pleasant setting, we dined outside, and an A+ to the wait staff the ","useful":1,"cool":0},"4R11h0-nCqZCpd5EyziUsw":{"text":"Went here for my birthday dinner. The food was amazing. The service was impeccable. Highly","useful":1,"cool":0},"wAjgStpid4nTV6RO9SUYzQ":{"text":"Great place and ambience. Celebrated our Anniversary weekend. Food was delicious. Didn't g","useful":0,"cool":0},"uNeGuOMIwJB2QW5_C3h8_Q":{"text":"We had the 8 oz filet and the center cut rib eye. Cooked to perfection! We also had the ga","useful":1,"cool":0},"WfdOcEp1eL1BwEf76SAj9Q":{"text":"The girls in the restaurant took the best care of us.  Hans the manager in the restaurant ","useful":0,"cool":0},"uPT-e9P1WGvAm31m90F8fg":{"text":"One of the best steaks I've ever had. I got the delmonico Cajun styled medium. It was made","useful":2,"cool":0},"d9KBD0177M6KNCm-XwyYnA":{"text":"I made reservations for my family and me to eat here on  the 4th of July.  There were 6 of","useful":1,"cool":0},"51RJt-q59ssbHVU2nZOsrQ":{"text":"Server and back waiter was the best but the food lacked so much. I had the 8oz filet migno","useful":1,"cool":0},"018HGBM-BvzFaGpRxglICQ":{"text":"This was a Huge disappointment. For the $$$$ \nMy children and I came here for Mother's Day","useful":1,"cool":0},"hqYr8jG4p6hn8pU8TjF91w":{"text":"OMG, this was a delicious meal for our last night in NOLA. We were a little burnt out on f","useful":0,"cool":0},"TQAzymY3ObzY8FgqYdnf2Q":{"text":"The atmosphere seemed nice at first. There was even a singer at the piano who wasn't half ","useful":0,"cool":1},"oLp1mqwr1P35YXUY8gTwmg":{"text":"Spent my Birthday in New Orleans and was craving a nice steak, this place did not disappoi","useful":1,"cool":1},"FrdM2wH0jrdhEI8vB12s7w":{"text":"We went here for a fine dining night. Let me start with how it ended. The waiter swiped th","useful":1,"cool":0},"u4Hor19OoscuM4tOyz_xvg":{"text":"My first time here was about a month ago for a birthday dinner with about 20 guests. \n\nSer","useful":2,"cool":1},"47Q4IVfFbcDHP4PLKSCUPA":{"text":"Martin was an amazing waiter! The food was amazing and hope to get him as our waiter the n","useful":0,"cool":1},"XFFATDEg1inp5E9MXpAlaw":{"text":"I just left the Chphouse in New Orleans. I bought gift cards for the Chophouse but it not ","useful":0,"cool":0},"T4upY0nYmIYHKofvZhc_0w":{"text":"Hands down! This was the most welcoming and best dining experience we've had during our en","useful":0,"cool":0},"ELmsY2P5SjIEybQr9w7x-Q":{"text":"Came here for my birthday with my boyfriend. We love chop houses so we went in with some p","useful":1,"cool":0},"CFKTt67LqeP71bI9HHFXzA":{"text":"I will start out by saying I love steak and this is my favorite steak house . The service ","useful":0,"cool":0},"CpsjyE3YfHGqF05dYKIG9g":{"text":"My boyfriend and I came here to celebrate our 1 year anniversary and were not disappointed","useful":2,"cool":0},"nBXf65Ouy1eqEVmMqI6TPQ":{"text":"Chophouse of New Orleans, you were simply amazing, elegant, classy, and hands down one of ","useful":1,"cool":0},"poAyye1Sh7tZakauDmqNTg":{"text":"This was my last dinner experience in Nola. We were there this past Monday evening. Be pre","useful":0,"cool":0},"2y3RlIw56jW-h58HpO99kA":{"text":"If your favorite steakhouse had sex with The Bayou and produced an offspring, The Chophous","useful":0,"cool":0},"RLPnjujnsUjo-lzTV84FbQ":{"text":"Went into this restaurant for a bite to eat but wasn't feeling too good so my companion an","useful":4,"cool":1},"0Mr62CoGK_M86-DBF8P9wg":{"text":"Words cannot express enough good things about this place. The service is impeccable and th","useful":0,"cool":0},"dg2iCMf-bs68t2pCOsUnIA":{"text":"This was my first time at Chophouse. I am definitely a steak girl and was excited to try t","useful":0,"cool":0},"w-g8XM3VhqDl6srm8f6Keg":{"text":"My girlfriend and I visited New Orleans for her birthday and chose Chophouse New Orleans f","useful":1,"cool":1},"qSz1Gs2fXyWshZZf94DmYg":{"text":"The Chophouse was a pretty good steakhouse. The service team was amazing! The crab bisque ","useful":0,"cool":0},"WSHRPDXfM5VLj4EiTPdOSw":{"text":"Amazing steaks and service.  Everything you'd expect from a high end chop house.  \nComfort","useful":1,"cool":1},"wwVRD6U5PMgML94BVqappQ":{"text":"This is now our favorite steakhouse in NOLA. My wife and I went for our 16th anniversary a","useful":0,"cool":0},"sDktNbY6GZ1nLtI4PL4dNA":{"text":"Honestly, I had high expectations for this restaurant. They were not met. Our waiter was n","useful":1,"cool":0},"6cZjup5kZ86wvHXUmxWglg":{"text":"First time at the restaurant and it did not disappoint. The atmosphere was so relaxed. The","useful":0,"cool":0},"rxDpy8xHCk5mZ81FXGf0dQ":{"text":"Oh what a night! We wrapped up Mardi Gras Saturday night parade, had an early birthday din","useful":1,"cool":0},"kwU6YG_vsw5-T6lyeZQhCg":{"text":"We decided last min to make reservations on a Sat night for about 15 people on a busy week","useful":1,"cool":0},"eF4FsluSWPm17qup-YOW6Q":{"text":"I have lived in the Warehouse District for the past 3+ years and passed by Chophouse many ","useful":2,"cool":0},"mZx3rfQLPJ-hTDSDwdoxOw":{"text":"We were celebrating my daughters 22nd birthday. Had a wonderful Derrick waiter named Brad ","useful":1,"cool":1},"EsZ7NfG-zUtNy2rNjYZ4FQ":{"text":"I went to Chophouse for my girl's Birthday dinner.  The food was ABSOLUTELY AMAZING.  You ","useful":2,"cool":0},"od_e3PIrJk2rbldsHFoNvQ":{"text":"I've been to Chophouse several times and I'm never disappointed. From the superb staff to ","useful":0,"cool":0},"e34o1PKjzqI2FmoUUvr_YQ":{"text":"Fabulous!  There was a mixup with our reservation (our fault) but they still worked with u","useful":0,"cool":0},"vHQEXIclt55ElgFiRaUmnQ":{"text":"Plain and simple. Go. Don't wait. Go now. Unbelievable service and food. Don't forget dese","useful":0,"cool":0},"3q_KxHpCBaVAozyNUFzBxw":{"text":"Great food and service! We had the carpaccio and crab cocktail for apps which were great. ","useful":0,"cool":0},"ytUrIpS5oGUEb0XzQRZT7g":{"text":"The restaurant looks clean in the dining area but it had a weird smell. Service was god bu","useful":1,"cool":1},"7qdaIFbteN1zDSeYlq363Q":{"text":"I have tried many steakhouse's but this one by far is on my top 5 list exceeded all expect","useful":0,"cool":0},"TIJfdSABgiv76mRGGmBpdw":{"text":"I wanted to like this place but my steak was saltier than a pickle. I want a steak to tast","useful":1,"cool":0},"nze6wPYJPQzOUj_69adfRg":{"text":"Second time coming here and it was just as fantastic as the first time. Food was perfect o","useful":1,"cool":0},"1lh5VdovAESbyugKVed0_A":{"text":"Omg love love love this place..i took my husband and best friend here last night. We were ","useful":0,"cool":0},"Rte3i0iqdAt5YAgSA4MZiw":{"text":"Always great! A very nice upper scale ambiance with great food, drink and service. Our wai","useful":1,"cool":0},"RuOue8hQQhYkIk4QyiMTuw":{"text":"Visited this establishment while in New Orleans to celebrate my boyfriend's 33rd birthday.","useful":0,"cool":1},"bJm93G-hwriHg0igAEnPfg":{"text":"Had a fantastic time with my friends here. We try and eat at at least one steakhouse per t","useful":1,"cool":1},"WKdWNyb5_AVr0R9ZTlJgkg":{"text":"Amazing food! Awesome vibe! My husband and I loved everything. Martin was a great server. ","useful":0,"cool":0},"Be2hGm79QmqsHI3sC5WbGA":{"text":"Very good location. Food is at the very high end. Lots of attention from the friendly staf","useful":0,"cool":0},"IDVzACT45PIDNIKjY67Lng":{"text":"The food and ambiance was exactly what you'd expect from the top steak house in New Orlean","useful":0,"cool":0},"qS4a1yuUgvk4xw-LPZ1y2w":{"text":"While staying next door at the St. James Hotel, I dropped into Chophouse twice.  The first","useful":0,"cool":0},"S6iRnRXWyEg1xe7XaxTNEQ":{"text":"Had reservations and walked right in and was seated. Service was fantastic and tableside p","useful":2,"cool":1},"WX7F4KEDjLADCmZAoeoUrA":{"text":"Came to the chop house to celebrate my Friends birthday  party of 9 orders and ate paid $8","useful":2,"cool":0},"cFrwl8hg0gIQQgMLtLth0A":{"text":"I went here for a romantic date night after taking engagement photos. The restaurant's atm","useful":0,"cool":0},"IoQl8nxwA1yi2s-dh3RoxQ":{"text":"We visited the Chop House of New Orleans on Nov 8 because my cousin wanted to go to a stea","useful":0,"cool":0},"jkP8PMYWfW2c7Xq6ybdKZA":{"text":"Martin accompanied by Chris and Martin were the best. The food and the pink kiss martini w","useful":0,"cool":0},"pNkDr96yHgXQlsp6LhAPzA":{"text":"My server was great and that's the only reason I gave this two stars. I was sat outside; i","useful":0,"cool":0},"yey7qLguaFJ6u5BMYyKVvQ":{"text":"I visited chophouse for my 22nd birthday, the staff was very accommodating. The steak was ","useful":0,"cool":0},"B664dFz_9mW-cZ_c5ffaEw":{"text":"Amazing! Make a reservation to be sure you get a table. The food and the staff/service was","useful":0,"cool":0},"NgUI7cRzzRTH3n6UBk9MPg":{"text":"Culminating dinner for my birthday weekend and dinner was amazing! Our waiter was wonderfu","useful":3,"cool":2},"bAX9HPCsK9sTeqPS6u7DmQ":{"text":"Great experience..  a bit pricey. But worth it. Bone in ribeye. Tender juicy and nicely ch","useful":0,"cool":0},"TN8vdxhhwWOrYlnUhNLMJA":{"text":"Went there for Valentine's Day. Spectacular service.  Food was wonderful.  It was a lovely","useful":0,"cool":0},"mr_dw1DT5yq0YmgZQmSjzA":{"text":"Do not try to get in without reservations-make them! The food was amazing - steaks cooked ","useful":0,"cool":0},"MxjHEVrnyxFlBg2Bwodrfw":{"text":"This is a must try..... the ambiance, food, cocktails, and service were all top notch for ","useful":1,"cool":0},"XHGOOe6msIAiQT4qFIxAnQ":{"text":"Absolutely amazing dining experience!\n\nMy husband chose the chophouse to celebrate our ann","useful":2,"cool":0},"0LhWv35b-_gFTS6QWe7pRA":{"text":"My husband and I wanted to go to a really nice restaurant on the last night of our vacatio","useful":0,"cool":0},"CvafNOJEMJMhY8UJ1jGISw":{"text":"Excellent steak, perfectly cooked. Voltin was a great waiter. Very great atmosphere with t","useful":0,"cool":0},"XlGpOpcSCdd1zQw8ny9oQw":{"text":"I am not sure how  This restaurant has 4.5 stars .it took 20 minutes for someone to acknow","useful":2,"cool":0},"ZMlQippOFUG9YQzAysO3Zg":{"text":"This was the best steak dinner I've ever had. The steak was charred to perfection. The sal","useful":0,"cool":0},"LjFjP9TRH5VZbTO8KuqyEw":{"text":"Amazing food and the entire experience was amazing. Excellent service, perfect atmosphere,","useful":0,"cool":0},"nBhOB00hK29fpm9CadJOfw":{"text":"I've been wanting to go here for the years and finally got the chance to. I'm happy to say","useful":2,"cool":1},"zMF5QQ7Cw8Ch__uAn-rDSw":{"text":"I'm visiting from Birmingham and wanted to treat myself to a good meal, so I stopped by Ch","useful":0,"cool":0},"Gwqtu3xv9_-C6Z6GOp4UQw":{"text":"Not impressed with the host, not very welcoming, I didn't feel like I was valued as I walk","useful":0,"cool":0},"2qpjl9JUsdl2MckBeV9Cew":{"text":"Wow, you guys.\n\nBooked Chophouse New Orleans as the hubs wanted to go to a steakhouse for ","useful":4,"cool":1},"qLylcWeWUJGeNy92y9RP1Q":{"text":"amazing! the bacon is awesome, must get! the shrimp appetizer was great also! steak was fa","useful":0,"cool":0},"jcNhjHnT38mTSVzipYK0MQ":{"text":"This was a terrible experience for me. \n\nThe waiter obviously did not want a \"single\" dine","useful":5,"cool":0},"d0B6HWaK6PjVqPM-y9DKCg":{"text":"Wow..Everything was incredible. I am in town until April working on a TV Show. I dined alo","useful":0,"cool":0},"4s5DoHLoOLu_L1pSLxDung":{"text":"Possibly the best meal my wife and I have ever experienced. Service was on spot. Didn't Ho","useful":1,"cool":0},"GIW20F4MacRN0IgB0TY_WA":{"text":"Wow, already a bad taste in my mouth and haven't even visited yet.  My daughter's fiancés ","useful":0,"cool":0},"M7jXLL2WGMUYL0k8CnZjVQ":{"text":"This might be the best restaurant I've ever been to. A definite 10 out of 10. I had the \"P","useful":0,"cool":0},"f7OhkK3l4uCrG5EOlwb37Q":{"text":"If I could give more than 5 stars I definitely would. OMGoodness, everything about chophou","useful":0,"cool":1},"XA2WAXVkMDJjgZFYgRZtaw":{"text":"Great steakhouse overall, but I'm from the New York area, so maybe my standards are a litt","useful":0,"cool":0},"C-3THXY-hfFbtz7SVK45sQ":{"text":"Excellent food and service. The seafood platter was great, the shrimp were huge and the lo","useful":0,"cool":0},"Pu564g1Izy-GwTZfv94RdQ":{"text":"I wish I could give more stars. This place is Amazing! Not just the food but the atmospher","useful":0,"cool":0},"YcN9uXZ_Vl5dSg7voZK92w":{"text":"What an amazing dinner. We got the seafood platter for an appetizer and the Tomohawk for d","useful":0,"cool":0},"O9yDkupDiWQpavdOd29Xig":{"text":"Absolutely outstanding! The carpaccio and the crab bisque is superb!!!!!  The service is e","useful":0,"cool":0},"q-dfKtSWFYxirm68KNMo0Q":{"text":"My fiancé and I like to try different steakhouses whenever a special occasion pops up, so ","useful":1,"cool":0},"GAT1anGqxwKuGD-_P-8Plg":{"text":"Everything about the meal was perfect.  The food was amazing. Took the servers recommendat","useful":0,"cool":0},"S9JgOGhWcvdarpII0D4ISg":{"text":"The first time I saw anything about this restaurant was in a magazine  I was reading in Th","useful":4,"cool":2},"Vw7bYExV6gEhfT-amQ9aQw":{"text":"Amazing steak. We shared the porterhouse and had the mushrooms and onions. Well worth it. ","useful":0,"cool":0},"ptjDEx1ouzMuXirdHs0n2g":{"text":"Excellent service. Good Great food!  We added snow crabs just in season to our appetizer. ","useful":0,"cool":0},"ozok5Y2-4fWXDd3D2RrhZQ":{"text":"We were very disappointed didn't allow our service dog in, and then we arrived 20 minutes ","useful":0,"cool":0},"oLk3R5jmU0dD7HsoBfuTvg":{"text":"Great place to go if you have food allergies. \n\nIm not usually big on steakhouses, but thi","useful":0,"cool":0},"kE8yyiKZ-K4gpvRtFBlNtA":{"text":"Chophouse is an outstanding restaurant that totally blew us away!\n\nFive friends and I deci","useful":7,"cool":7},"L8YaM7q5dR1K8IkX30ZKVQ":{"text":"Delicious food! Looks like a nice and fancy place. We arrived at 8pm after driving all day","useful":0,"cool":0},"Q-T-BmJZV61OWEG8TlhDOQ":{"text":"We come here 2-3 times per year when visiting New Orleans.  We are never disappointed.  My","useful":0,"cool":0},"OQbVdPwxM85NKOyH_21qkw":{"text":"We have been wanting to go for some time now and last night we finally got to go. We start","useful":1,"cool":0},"fNnh_ZcwlczA8K_70_n4UA":{"text":"In a city of amazing food, Chophouse just doesn't make the cut. \n\nMy partner wanted a brea","useful":7,"cool":1},"I05UDsGS1o6iOUSEEy9JGA":{"text":"This was the most disappointing meal I've ever had. I'd understand if I ordered fish at a ","useful":2,"cool":0},"L1ppfmF45Opg6yKOK3MJ_A":{"text":"This was my first experience at Chophouse. The atmosphere was stellar. I had the house sal","useful":0,"cool":0},"fUrZlSnHGX3jMWBHx0i74w":{"text":"Such a nice dining experience. Our steaks were cooked to perfection and everything else wa","useful":0,"cool":0},"q5sdmyd5R6A0_y4r4EgK2g":{"text":"Come here every time we visit. Consistently the BEST. Food is perfection followed by relax","useful":0,"cool":0},"Jh5H1e4yO0iaS0ahAi5cAg":{"text":"Where do I begin?! This restaurant was beautiful inside the atmosphere was dim and romanti","useful":0,"cool":0},"7V5e8pzob_zFphqjLU_tGg":{"text":"Phenomenal! \n\nMy husband made a Monday night reservation to celebrate our anniversary and ","useful":1,"cool":0},"_lOLFINo5AccPEIr9OPz6A":{"text":"Absolutely overrated. Def a tourist trap. \nI don't mind paying for good food- but what we ","useful":0,"cool":0},"TOT5ZJPO6IcsQlc7nghUJA":{"text":"Outstanding service, excellent food, highly recommend!  We had the Filet Mignon, New York ","useful":0,"cool":0},"ZA3IGbB9OQRR2KQv8xFZEw":{"text":"We were in town for a quick getaway before school started back and couldn't get reservatio","useful":0,"cool":1},"o0liG86dAc-RGsnNmuLSEA":{"text":"So this might be my new favorite steakhouse in the New Orleans area. I'll say this much, f","useful":1,"cool":0},"bC53rkc355YPY40nUgmz7w":{"text":"My boyfriend loves this place.  I find the service excellent and all the staff so, so swee","useful":1,"cool":0},"89E1buBwP3CIjMXxPi7J2Q":{"text":"Had dinner last evening. Great ambiance and a very friendly staff. I ordered the 8oz filet","useful":1,"cool":1},"BsVU4nkLO4WTBiilaDrF5w":{"text":"Oh my where should I begin?? Chophouse is one of my favorite steak houses in the city. Con","useful":1,"cool":1},"HtaTt29yEcVuMywnZ-o8KA":{"text":"Excellent service from Raquel with a solid showing from Jacob, floor manager. \n\nSo let's t","useful":2,"cool":2},"viNvVv_9DnX35DyP-X4rxQ":{"text":"The food is divine. The service is superb. Very happy I was able to dine in here. I made a","useful":0,"cool":1},"oAnA8L4tc85i9JjhpJEX5w":{"text":"Excellent.  Without a doubt the best meal I had on a four day stay in New Orleans.  We wal","useful":0,"cool":0},"GtCRp6u0W21QHdKssf9Oqw":{"text":"Spoiler alert, this was the BEST meal I have ever had! I went to Chophouse on a random Wed","useful":0,"cool":0},"QyGtBrbhsYBAUDZPSNqCNg":{"text":"Loved this restaurant! It was my first time here and I loved the ambiance as soon as you w","useful":2,"cool":1},"45zMc5WEc2yhlqRim8-ZUw":{"text":"Had an amazing experience at Chophouse while in town for a convention. We sat out on the b","useful":0,"cool":0},"2NxpE8WBDOwIbMSd-IdXIg":{"text":"In the birthplace of Ruth's Chris, and a town that is the American cradle of the culinary ","useful":3,"cool":1},"QCKgi1-w5X06HyfVmBXLeA":{"text":"So professional and balanced. This is a step back in time in all the right ways! Not at al","useful":0,"cool":0},"d_iS6pIAnZe7sjseAoA7Gg":{"text":"Great food, excellent service, one huge hiccup. \nThe triple crusted steaks are great.  Sid","useful":2,"cool":0},"VLbgYUnWcfOpz7IqZVW76Q":{"text":"Amazing!\nWe came here for a date night.\nThe service and the food was above and beyond deli","useful":0,"cool":0},"IKjLBzoMWJ280PZIm0f3mw":{"text":"I just got back from dinner at this establishment.\n\nThe ambiance was positive when I walke","useful":0,"cool":0},"pV7emfn7ox0AilsP-Ty5bg":{"text":"Went for a romantic dinner...probably the best dinner I've had in a very LONG time! The at","useful":1,"cool":1},"00-0XDEcFCX8XXERDSfqtw":{"text":"Fantastic food and service. The steaks are seasoned and cooked perfectly. The side dishes ","useful":0,"cool":0},"fNEBDVVUvG7kSX3Hz4Q3Nw":{"text":"My wife reserved a table tonight for my birthday and we had a great time. Service was impe","useful":2,"cool":0},"oOSCsyvio9ml1DDLyd35aA":{"text":"Best steak dinner I have had in NOLA in a while. Wine list is good and not as overpriced a","useful":0,"cool":0},"iSn30qa-Z29k4f4e6_OIIg":{"text":"Excellent service and food. A little taken back by the cost of Stone Crab Claws which were","useful":3,"cool":1},"L419k2uR8NHCW4DdxroMCw":{"text":"Had a lovely evening at the Chophouse. I have known about this place for a while and saunt","useful":2,"cool":2},"nVpjMthJfdEebs2TWdvSoA":{"text":"A group of six of us all tried out Chophouse for the first time and we were not disappoint","useful":3,"cool":1},"LTjN3xsoZplj9XVC1S1ZCA":{"text":"This place was pretty nice I'm crossed between a 3 and a 4 so I'll tell you my experience ","useful":3,"cool":2},"qzTa3z6d21YLAUM8wP3r5Q":{"text":"Love this place. Great service and food. It was so good we ate there two nights in a row. ","useful":0,"cool":0},"JeN_CIwH9kQpBNreVNLk-A":{"text":"First of all let me say the food is delicious, but I probably won't return because I was d","useful":3,"cool":0},"CcATAmbLkhqtySBDXR8ilQ":{"text":"Everything was outstanding! The seafood platter was incredible!! Top notch customer servic","useful":0,"cool":0},"aJNEXzK_oC4Q5SLaqzJdGg":{"text":"Something I never knew I wanted to do....eat dinner on the piano while the piano man Micha","useful":0,"cool":0},"iMaxU340B3Gz43hAsaDmRw":{"text":"ChopHouse\n\nWith everything going on in the world, it is a must to treat ourselves every no","useful":6,"cool":4},"XZjbDhIGu3J96wkXpNOTEw":{"text":"First time to visit. Food was amazing. The waitstaff was a slow and not very attentive how","useful":2,"cool":0},"C8s1x6lT_0sBzsDg7cptVQ":{"text":"Sooo I'm a little late with this review but I had to make sure that I posted this. My husb","useful":0,"cool":0},"--9nUqhKuILH_qWYRNKJJg":{"text":"I spent the time researching this restaurant, cuts of meat cooking method. 28 day dry aged","useful":0,"cool":0},"7onexC-rygG3RrmhBzoVTA":{"text":"Celebrating my friends bachelorette party we made reservations for a large group, the grou","useful":1,"cool":0},"wLsrhrt66JzODKgnwEVfRw":{"text":"Amazing food. This is one of the best steakhouse experiences I've ever been to. Amazing se","useful":0,"cool":0},"zEe9dpEqfmRcJRSxB_wafQ":{"text":"I was on the fence about writing this review, but the food just isn't great. The drinks we","useful":1,"cool":0},"pLtKIexRuDRqXYAT7s7MhA":{"text":"This place is mediocre at best. Waiter, Brandon, was a joke. They screwed up 2 out of the ","useful":2,"cool":1},"X64N70KjxkLxurqaVN51aA":{"text":"Chophouse \nBeyond expectations even though I had none.\nRaquel, Jared, Jacob, Thank you for","useful":2,"cool":1},"O8iW3WeKDIYGoBhtdl8wPw":{"text":"This was such a lovely meal. \n\nIn New Orleans to celebrate my mother's birthday, we ate to","useful":3,"cool":2},"7Yv3xJ041upgmaLaDgiV_g":{"text":"I really had high hopes for this place considering it's great reviews - however it turned ","useful":4,"cool":1},"uxUo2-hIMLDkuM-weC30yg":{"text":"After a very long week and last day in the field working, my co-worker and I were looking ","useful":0,"cool":0},"iam0ezIVPNDCa_QRlkoJbg":{"text":"The best surprise in the Big Easy. First off, this resturant was reccommended by the Conce","useful":3,"cool":0},"VFMqMKgTlN1l9WcuTLKN_w":{"text":"A nice traditional steakhouse in the CBD.  Began with the thick cut sizzling bacon - excel","useful":2,"cool":2},"AH6l25vGYeO0oUpuiMzeNw":{"text":"Excellent ribeye execution, amazing colossal shrimp appetizer, and an old fashion cocktail","useful":0,"cool":0},"NE8xRPYdL3Y-jxutLTR28A":{"text":"Still a five in my book. We celebrated our 5th year wedding anniversary last night and my ","useful":2,"cool":0},"iRhE4G9ZiqK4za7jzkSkUg":{"text":"OMG!!  Died and gone to heaven!!!  This place is wonderful.  The steak, the apps, the sala","useful":1,"cool":1},"32qmRlkC324HBneiDyILNQ":{"text":"I really enjoy a great steak with wine or martinis and Chophouse is a good choice to enjoy","useful":2,"cool":2},"MNSxtiVvSersBYItFaXlnQ":{"text":"The chophouse food was Terrible\n1) their recommendation was the Delmonico(chuck ribeye) so","useful":5,"cool":0},"iaxfdcZ8MY7Md7Lu5DFJcw":{"text":"Aside from being seated 20-minutes post our reservation (on Christmas Day), and a sorta sl","useful":1,"cool":0},"0lEHTZFXDnyx53S_4xFScg":{"text":"I've done a few company dinners here and it's always top notch. Of course it's a bit price","useful":1,"cool":0},"tEaGbpG2uF9EF5GURD6mOA":{"text":"That's all that's left of my\nShrimp! It was so good, I forgot to get my photo in. I had th","useful":1,"cool":0},"LHrIWIVyyJ1AY_3VQ3ALeQ":{"text":"Best steak I ever ever ever had was here! #whirl Amazing and unforgettable dinner! Go ther","useful":1,"cool":0},"MGqrrNGeZaMoXCiafbF2qw":{"text":"So disappointing. I joined some friends for dinner at Chophouse last week (their choice ba","useful":1,"cool":0},"woTuv7oR5upQnWnbKGs-GA":{"text":"What a fantastic five star experience. I needed to move my reservation up a few hours and ","useful":0,"cool":0},"Q8IZr9qCihBjlBawyyAycg":{"text":"Great experience! They check our vaccination status to ensure we were vaccinated. The Fren","useful":1,"cool":1},"STTCSzYveK84vL9ls1OF8A":{"text":"Hands down the best steak I have had thus far. The Cajun delmonico is the top dog.  Throw ","useful":0,"cool":0}}