{"vY8-4JxE-PWJqze0yf5qNw":{"text":"Best pate chaud hands down!\n\nThe food in the restaurant is decent, but nothing special.  T","useful":3,"cool":0},"C_BvHuGpkdqzC3bigywkxA":{"text":"I was completely taken aback to see a banh mì sandwich place on the far outskirts of New O","useful":2,"cool":2},"GA-PYmxWAJsTWvVeSt1sqA":{"text":"been here a few times and haven't been wowed yet. I ordered the pork chops over rice. Fatt","useful":0,"cool":0},"AGBv6ztMKU96AF9k8VVGLg":{"text":"I have never been in the restaurant itself, but have eaten many a sandwich in the parking ","useful":1,"cool":0},"nFXoGx1-L3Za0Ry0WyeBwA":{"text":"I've lived in New Orleans for 15 years, and this entire time I've considered New Orleans E","useful":0,"cool":0},"KB6uijqqq-BIWfssX-YjWQ":{"text":"King cake is amazing. Flakey but not dry. Like a cinnamon croissant. The cream cheese fros","useful":0,"cool":0},"qv9XhheBiciUKe9710zwdA":{"text":"The craving for pho can be intense. That's why while sloughing through the workday, I ende","useful":9,"cool":7},"5-LwdJdOiqZ9eV47gsHRNQ":{"text":"My goodness. This pho is heaven . Pho is 4.8/5\nI tasted the broth and it reminded me of my","useful":1,"cool":0},"ZSJ4umoprnOTn2aLue6Xbg":{"text":"Post-Katrina:  Not the same as it used to be....\n\nI'm all for the reopening of any busines","useful":0,"cool":1},"VmCNeVmyrMTqjlnCm87PaQ":{"text":"I have eaten lunch twice at Dong Phuong. On both visits the food was excellant. \n\nFirst vi","useful":1,"cool":1},"n6jEwirTlmsQZUz2RGq1oQ":{"text":"It's rare that I find myself in New Orleans East. However, every time I'm out there, witho","useful":3,"cool":4},"PdVcQQ9NE5VL0s_56vcoxw":{"text":"Made the trek for lunch to buy a king cake from the bakery. Two flavors were available - c","useful":0,"cool":0},"pAtUdDTbg3ykxktaM44G0w":{"text":"The holy grail of Vietnamese baked goods and bah mi sandwiches. Pick from 10 different var","useful":0,"cool":0},"KBpnrNWDu_6Bo6Sr6ta-tA":{"text":"Cashier girl in the bakery was really rude. Bakery is overcrowded with no room to walk. Ca","useful":0,"cool":0},"LkGWGSy7_X7lTKKCD9NysQ":{"text":"Well what a mistake when I am on a \"eat less carb\" diet. The pastries look and taste very ","useful":2,"cool":2},"dakV84PxXDYzTUJ2qxj8Dw":{"text":"Soo nice to have the comforts of Vietnamese cooking so quick n easy n soo good too! Just h","useful":0,"cool":0},"_XkukFz5UJyn-pWl7LD_tQ":{"text":"This place had yummy bread. The banh mi was just okay. We wished that the veggies were mor","useful":1,"cool":1},"f04-WT8KKaSXbecd7aaITQ":{"text":"OMG! was so happy to find my Vietnamese hoagies away from home! The sandwiches are excelle","useful":0,"cool":0},"qDOFsBxLgswHUUAiF-dTmg":{"text":"This restaurant deserves high praise for its delicious food (both Vietnamese and Chinese),","useful":2,"cool":1},"NiYt-xgloXNNWnX9Up2gnQ":{"text":"This place really hits the spot. Its cheap and fast! They have the best Vietnamese poboys.","useful":2,"cool":1},"sdImpx8kl3UWSg1uo_898A":{"text":"It was good, busy down right to business , \nKinda of in the hood, just like Vietnam where ","useful":0,"cool":0},"ighQk5PSvLPRUrWCU_8Evw":{"text":"I love Dong Phuong. Large portions, cheap prices, full in flavor! The menu is extensive. T","useful":2,"cool":1},"HPa30z_fjQ_nAiTZKvbgHA":{"text":"Love this place! I give it two Vietnamese thumbs up. It's kinda off the grid, but it sure ","useful":4,"cool":0},"CmMTkrhAPyptzznBxYCmbg":{"text":"i disclaim that i have not made it to the restaurant, and this short review is but a simpl","useful":2,"cool":1},"EAtBU_7GPI-nOsicaK0uug":{"text":"Best rice plates in town!  It's our 15th time here and food are just good. I came here wit","useful":0,"cool":1},"lPlMZhzDbBkF9EzCpPQSuA":{"text":"I eat at this place EVERY SUNDAY after church with my family. I actually look forward to i","useful":1,"cool":1},"yEoZC1D9YxXCCCcQuLH_Lw":{"text":"Best king cake in the entire city. Get the cream cheese filled. I promise you won't be abl","useful":2,"cool":0},"Evn9MwFiesGtmdPEkcPyPg":{"text":"My latest favorite king cake. Grew up on Randazzo's king cakes which are by far the best, ","useful":0,"cool":0},"nbP7Z09iRLUctzEVHJUlcg":{"text":"This place has been around for as long as I could remember, and I'm glad its still standin","useful":1,"cool":1},"0vkYkUB21fdwNnK3up96sA":{"text":"I can eat everything in the bakery and then go back for seconds. I love this place and hav","useful":2,"cool":1},"Ag5FWfnG3im9AoltdCp2qA":{"text":"Bahn mi is my go to here.  Never fails to satisfy and the price is right coming in at $3.2","useful":0,"cool":0},"SN-YehuHOccUeZzbSN7_2w":{"text":"This place is a diamond in the dirt. Hands down the best Vietnamese I have had in the sout","useful":0,"cool":0},"EIYVxuYRK8f2xnhbxVQ7vA":{"text":"So I went here recently for there king cakes, well my grandmother dragged me with her beca","useful":3,"cool":2},"etJCr1xMn8jCSR6UgKuuoQ":{"text":"I've only tried the bakery. I love this place. recommend the pork buns and the banh mi's w","useful":4,"cool":4},"VgDx0BNFPtL7Qeq0SuDRPg":{"text":"Everything, especially the delicious banh mi, is so cheap! Wonderful sweet-savory baked go","useful":1,"cool":0},"TYJAqwg0fbHHM_4UB5b1sA":{"text":"Don't listen to Dianna down below. Can't trust someone who orders 3 different types of sou","useful":2,"cool":1},"z1rxyBPPEfFssFdhOyKVZA":{"text":"Love the noodle bowls, bahn mi and pho. Don't forget to pick up some baked goodies and som","useful":0,"cool":0},"9n6isvU9t3pLtueBEWzOcA":{"text":"OH MY HECK!\nShowed up for the Bakery (that was closed!!) and stayed for lunch. Almost 2 o'","useful":0,"cool":0},"JDmLNGBRvEUfrH8dCTZodQ":{"text":"Best king cake and delicious pastries and always so fresh. Authentic Vietnamese and friend","useful":0,"cool":0},"mYrStHJ1SYvOP8EahLi28g":{"text":"Skip the sit-down restaurant, go to the bakery and sandwich bar in the back. Amazing! Wort","useful":0,"cool":0},"nd9dUzjAewr9wGIqOcWMSA":{"text":"The baked goods are very fresh and buttery but I got these meat filled pastries that were ","useful":4,"cool":1},"ejnTkKJB7iRkM-25aq-tmQ":{"text":"Today, I stopped by my favorite bakery to get a few festive King Cakes to bring back to CA","useful":3,"cool":0},"4uWVKp5XVxzV-oVLQWLcWA":{"text":"A very good place with great affordable food. Ordered grilled pork and soursop smoothie an","useful":0,"cool":0},"iHDsWFPncrn4HQ0BTY-6WQ":{"text":"Amazing food, casual atmosphere, good service. Make sure to hit the bakery & get french br","useful":0,"cool":0},"QYylcwWmgaATBrvvXuUgQQ":{"text":"First time trying a Bah Mi sandwich (veggie), no regrets. This place is only 5 mins from m","useful":2,"cool":1},"FuUp1R2duNs5BxuJfQuP_Q":{"text":"My favorite place to get pho and bo luc lac (sautéed beef cubes). Really hard working fami","useful":0,"cool":0},"ocs8bjyES5gXRahUmmUWwQ":{"text":"Restaurant food is ok, but the highlight is their bakery. If they expanded their bakery, I","useful":0,"cool":0},"DlESViaiZ0x3aeFh4GmyBg":{"text":"Haven't eaten in the restaurant only at the bakery. The bakery items are a delicious treat","useful":0,"cool":0},"P1iffQtydj3cBS1EgmkSvg":{"text":"Their Bánh mì is one of the best sandwiches I've had in over a decade. Fantastic and worth","useful":0,"cool":0},"5Y-PRpUAzoDDXvuHviJzvw":{"text":"Delicious Bahn Mi.  And at $3 a pop, probably one of the most affordable meals you can fin","useful":2,"cool":0},"50zv3IYrRA0bthbxYckKkg":{"text":"I can sit here and type a novel about this place, IT IS AMAZING.\nOften busy and crowded, b","useful":0,"cool":0},"vA2cE3480QLcQq4Rx2fHEQ":{"text":"This was my first time going to this restaurant and bakery and man I was impressed. The fo","useful":0,"cool":0},"d64CkAxyjFDVxoeI5-4SgQ":{"text":"I grew up on the Dong Phoung bread! We used to source them to make banh mi of our own. The","useful":3,"cool":1},"_PZb_Let7ESVVgMe8UzT5w":{"text":"Best bowl of bun bo hue in a really long time. Plentiful big bowl of meat, noodles and sou","useful":3,"cool":2},"QixfhCsHiQCZw9ZSKr-uKg":{"text":"They have the best Banh mi in town. I love their pastries too. Too bad its far from my hom","useful":1,"cool":1},"3FURGxUUEhFQUW8dYSF8mQ":{"text":"The best Vietnamese bakery in the greater New Orleans area.  I love, love, love the durian","useful":2,"cool":1},"wcvt2E5WfA6kuubPPhgEvA":{"text":"There are many good places to get Vietnamese food out in New Orleans East, but Dong Phuong","useful":1,"cool":1},"TApuvLvK55n_j9M0AQhfsw":{"text":"The bakery has awesome pate chaud( French stuffed meat pastry). The restaurant side has a ","useful":4,"cool":2},"0yF1rJOvD4y7I1vzGsRIRg":{"text":"Love there bake good. That says it all. They have sweet, savory, bready, flaky, meat, dess","useful":0,"cool":0},"n4fyJE6P-eUQ0R24vPAAQA":{"text":"I've gotten Bahn Mi hear many times. Especially because I thought the odd color and consis","useful":2,"cool":0},"VdksFBAi36vpFK-L-7oa5A":{"text":"One of the best Vietnamese restaurants around. They grow all of their herbs fresh. The bra","useful":2,"cool":0},"xe4DpvTKo3uXaAg895uLxQ":{"text":"still love this place, cause its rockin.   I went and got bahn mi for parades in new orlea","useful":2,"cool":1},"cJQG8z0mv1o6_8yavc48hw":{"text":"Rekt an early lunch today at THE best Vietnamese spot around IMO. Bakery and banh mi stati","useful":1,"cool":0},"EOK7YbEH2OhtUl7QCRMw2A":{"text":"Best Banh Mi Sandwich I've ever had.\n\nPreviously I've said I don't think I've had enough e","useful":0,"cool":0},"6zePX14SzeGJm0KR3ZKk0w":{"text":"Thankfully I reserved my king cake online and was able to skip the half a mile line around","useful":2,"cool":2},"uGoIP_QGRKluJD4ea1ZLPg":{"text":"After hearing so many of my friends rave about this restaurant I decided to try it out.  W","useful":0,"cool":0},"oQPjgdhdTZ58aJFIGbvvDg":{"text":"This review is for the bakery, I did not go into the resturaunt that is connected to it.\n\n","useful":4,"cool":2},"WY5s91gjtlkKAtod-pjN_g":{"text":"I usually only trek as far as the West Bank to get my Vietnamese fix but I have heard so m","useful":0,"cool":1},"xucrTyX_SP0i9XLJqYmgZw":{"text":"After James Beard recognized their king cake I just had to try some of everything I could ","useful":2,"cool":0},"sCQCyCOrOp4YdbPlfXg96Q":{"text":"The bakery is an adventure and I would give it 4 stars, but the restaurant underwhelmed me","useful":1,"cool":1},"tiMyZ_mEUAJ2X5-aBBtLvQ":{"text":"Come to New Orleans and miss the tatse of Vietnamese food? Dont worry, you come to the rig","useful":0,"cool":0},"ZqR8ZAY8WopDxmpCDBwabw":{"text":"THEY ARE VERY RUDE..they're the \"hurry up and buy\" type. I stood in front the counter, wit","useful":2,"cool":0},"07gb0ZIfL0ehdC1UMCO1Aw":{"text":"I love visiting Dong Phoung for its bakery. Everything is hot and fresh. Pate chaud is my ","useful":0,"cool":0},"76CjtNxjKvYYJb2abnba-Q":{"text":"Another GREAT visit to dong phuong.  The restaurant and bakery are divided by a shelf of p","useful":0,"cool":0},"2nmR2zkF31pkofR18kWmlw":{"text":"There dessert and poboys-Banh Mi are delis! I always leave with over 10poboys to bring hom","useful":2,"cool":2},"3tnlsodd3Ie3MvkjboH0sw":{"text":"This restaurant is unassuming, but the meat pies alone are a good reason to take the drive","useful":0,"cool":0},"5tf0v3Mt1X1XsCPju-B71g":{"text":"Go there for the pastries and sandwiches. They are very good. Heck even the king cake is g","useful":0,"cool":0},"b98ok7C0-1QA4eAt2g7q1Q":{"text":"This is a review for online king cake orders. \n\nDuring my trip home for Mardi Gras, I plac","useful":3,"cool":1},"Y7UAkq9tO4ZJNt3rLlPD9w":{"text":"Delicious, no frills Vietnamese bakery in New Orleans East.  Everything fresh and tasty","useful":0,"cool":0},"bjytNl3rcC1vuJXoRvsOWQ":{"text":"My boyfriend and I decided to take a rainy day trek here after reading such great things a","useful":1,"cool":1},"qrGWiUI6PDncec_Wme50EQ":{"text":"I have to say that I am an idiot at times. I didn't really get into Vietnamese food until ","useful":1,"cool":0},"WfndMEBFwVczkfh1GpaY_g":{"text":"The best Bun vermicelli I've had -- the grilled tofu w/ vegetarian egg rolls is a favorite","useful":0,"cool":0},"5LaE4NkjYw7iT2KoHditsw":{"text":"After a rough night, pho was in order. We carpooled out to the East with some phellow pho ","useful":2,"cool":0},"diUjXJ-Xr-pNz9H2gA_Lng":{"text":"The bakery, out of bounds good. Any traditional breads, desserts, or snacks you can find h","useful":0,"cool":0},"qzbVsTGbtJx620RIbg0gDw":{"text":"My roommate and I have almost finished an entire cream cheese king cake from this awesome ","useful":10,"cool":5},"nu-MiJb9pxwcRU28EPyGJQ":{"text":"Easily the best Vietnamese food in the  city. Banhi Mi, Vietnamese poboys are the best and","useful":1,"cool":0},"NIa3IAhlz_oA6HOtvVGPBA":{"text":"This place was recommended to me for the best Banh mi ever. We stopped by on our way home ","useful":0,"cool":0},"5YwWFGpYzlL662o1HEEpbg":{"text":"I recently took a group of friends from California to taste New Orleans Vietnamese food an","useful":0,"cool":0},"PyBVcrmngypvrpSqvPXNfA":{"text":"Very good tasty reasonably priced. Only open till 4pm so glad we made it. Also, bought ite","useful":0,"cool":0},"eU2y3fy3Ei1RVTw3OGXvGQ":{"text":"Finally made it here! We were there a few minutes after 8am and were looking for breakfast","useful":0,"cool":0},"84_FE350mmDELeXV7WXjGA":{"text":"Found this gem driving around the outskirts of New Orleans when heading out to Biloxi, MS.","useful":1,"cool":1},"-8aH8iZ-xm9R0fvDcmxxew":{"text":"There is certainly two distinct parts to this establishment; the bakery side and the resta","useful":2,"cool":3},"hNCjz-UaYer7uncJhxHU1w":{"text":"My place to go to when I am in New Orleans East. Service is as expected. Food is ok too. T","useful":0,"cool":0},"drq37Tfn_I8OwF55WjNSfA":{"text":"#1?  amaazing.  Pate, pork, mayo, on delicious french bread, topped with carrots, cilantro","useful":1,"cool":0},"UcqFBa81oigV1YiJjg0Cyw":{"text":"So, this has always been the MECCA of Vietnamese places in Nola. I always was told by chef","useful":6,"cool":5},"mN9YYsY58-dOwCweQqGcuQ":{"text":"I try not to go here, but on this particular occasion my boss and I was very hungry and I ","useful":0,"cool":0},"Yelvxd5WNYpFPoaiBgcmYw":{"text":"One of my favorite things to eat are banh mi.  Banh mi Dac Biet here are probably one of t","useful":0,"cool":0},"goKkCHfiBC6ipotZ80P-Rg":{"text":"The building and décor is nothing exciting, but if you're in New Orleans East this is wher","useful":1,"cool":1},"OitMXh4W2kr2cGHS6aVAeg":{"text":"This was a great experience! A NOLA gem!!! Clean, food fresh, a lot of visitors! Don't let","useful":1,"cool":1},"NDmxEVgm4EkBnDvYiYJ0YA":{"text":"As for the food, I give the food five stars. Hands down, you  are not going to get a more ","useful":0,"cool":0},"zH4qNZ-bfIVvsmVUKf2rxA":{"text":"Tried Banh Mi for the first time ! I tried out the Roast Beef and BBQ Chicken(they gave me","useful":2,"cool":1},"h0WSWfQX1BJCpkzy2x9ARg":{"text":"Though I live far away in Metairie, I was anxious to go to Dong Phuong, because of all the","useful":1,"cool":1},"nCduXcowrTcHwP8qMfvaFw":{"text":"I ate here a few months ago and I can't wait to go back. I had the grilled pork chop with ","useful":1,"cool":1},"n8QpFznku-QqIgAVly8VFA":{"text":"Believe the hype on this one. Not only do they have the best banh mi in all of South La. b","useful":0,"cool":1},"UEsoEBEfY7Htr9fm4plxEA":{"text":"My friend and I shared two banh mi, a roasted pork (#4) and a BBQ chicken (#9), and they w","useful":0,"cool":0},"Ej5QiNZjnlyNfn9m1amCQw":{"text":"Words can't express the food it's worth the drive anywhere\nIn their bakery is phenomenal","useful":0,"cool":0},"ygkcne-9B5O_-s1PjjcZWA":{"text":"This is an amazing bakery.\n\nAwesome meat pies and turnovers.  Tasty desserts (I had some t","useful":0,"cool":0},"DlNyHJ9Y_mxg73fPLSjFgQ":{"text":"Came here for the Bahn Mi and it did not disappoint! The bread was crispy and chewy if tha","useful":1,"cool":1},"poOOj1qqR5oxPTGEGfbkxA":{"text":"Very succulent . I am very hard to please with King cakes . However , Yesssss Honey Yessss","useful":0,"cool":0},"-m-up32jrLwp4zJpJmYoQw":{"text":"This place has the best banh mi (Vietnamese sandwiches) I've ever tried. Most places use h","useful":0,"cool":0},"5UjjHZ5VqaN6kzqQxT80Yw":{"text":"The French bakery there is awesome! I grew up eating their food and you can not go wrong w","useful":2,"cool":1},"UBVpSq6BZayQ1YyZ9ZkA1Q":{"text":"STOP READING THIS REVIEW AND GO GET SOME PATE CHAUD IMMEDIATELY.\n\nDO IT.\n\n\nDO IT NOW.\n\n\n\n\n","useful":3,"cool":3},"nZXzcxuQ8Eg1Byfe7vlsBQ":{"text":"Skip the restaurant and just go to the bakery and order the sandwich. I tried a little bit","useful":1,"cool":0},"vT5j1eoMuWakCmucjcjMfw":{"text":"Absolute best Phö in the New Orleans area hands down. Sandwiches, pastries and deserts are","useful":0,"cool":0},"izlMZc0xGsaR8M2a9B-agQ":{"text":"I love Dong Phong restaurant and bakery.  They have amazing food.  One of my families favo","useful":0,"cool":0},"90DM9qo-RCg61X59MURzrw":{"text":"OMG! I almost forgot about this place! Although it's been a couple years since i've been, ","useful":1,"cool":0},"N95mb-AJ2if67mxfEljcMw":{"text":"My most favorite bang mi in the world!! FREAKEN scrumptious","useful":1,"cool":0},"h3iOvx7pUlra_Bcagl8Gdg":{"text":"Lots of vietnamese restaurants in this area. the pho was not bad, but not great like some ","useful":0,"cool":0},"x9J8pOBCMF-Bdu8wwRm4ZA":{"text":"WORST PLACE EVER!!! \n\nOne day we decided to go have lunch here and it was the worst mistak","useful":0,"cool":0},"skJpftbLUM0B2wIVJkL_Fg":{"text":"A really good restaurant/ bakery: known for best home-made French bread that you can buy. ","useful":1,"cool":1},"JrGEZB1EV4pTQJnbHTzteA":{"text":"Fantastic almond bun.  Consistently amazing, reasonably priced and worth the drive.","useful":0,"cool":0},"BnX-wKP-sKMrdBdv8qKLpA":{"text":"The best Vietnamese in the New Orleans area. And don't forget to stop in their bakery on t","useful":2,"cool":2},"j28fohRF_EDDu4igCrGs5A":{"text":"After one day of eating New Orleans cooking (and there is nothing wrong with it) and heavy","useful":1,"cool":1},"GV1V7PnDvINfAZ70Q8NQ7w":{"text":"Love love love this place and always want to eat here when in town. The buns, the po boys,","useful":1,"cool":1},"HkFQ4R74c8Fd6uuwq-pV3w":{"text":"I have not been to their actual bakery in New Orleans East but I purchased their king cake","useful":0,"cool":0},"cVcSWsCoyXyho9xcft90Mw":{"text":"Good friend of mine took me to my first authentic Vietnamese restaurant. I thought it was ","useful":2,"cool":1},"Xu31NQ1z0sggO2Unc8-FJQ":{"text":"Worth A Journey. Great bahn mi spot, and they sell beautiful baked goods. The inexpensive ","useful":0,"cool":0},"WI6oLgfwTJLsQ1oku1EQew":{"text":"Everytime I come in here, the bakery is stocked full of banh mi which is very reasonably p","useful":0,"cool":0},"wIzgoFdIUOwK61ZG84h05g":{"text":"I have been to the restaurant now, it took two trips to find the restaurant open.  If you ","useful":2,"cool":2},"w7WCA9mn3aWQdxXRu38MrA":{"text":"Delicious sandwiches and baked goods. #7 was the right balance of meat & veg for $3.25. I ","useful":1,"cool":1},"UIkz5QqmmLvLAN5lukvYnw":{"text":"Believe the hype. Dong Phuong will not let you down. Amazing food and extremely affordable","useful":0,"cool":0},"xwtMFHMW1huoPyyULvV8XA":{"text":"The King Cakes are so delicious. They are less sweet and very tender, we bought a few Feb.","useful":0,"cool":0},"OVQF5xzd0YkTGQRO6WbxVg":{"text":"This is one of the better Vietnamese restaurants along the gulf coast area, if I don't say","useful":2,"cool":0},"G8Rv5KfaSRO8KmXu7Eh8zg":{"text":"There is a restaurant and bakery side.\n\nThe bakery has the best french bread in town, hand","useful":0,"cool":0},"fj8_dtJbJ-BlUSZA2b9rMw":{"text":"One of these days I'm going to sample every one of the seemingly dozens of banh-mi sandwic","useful":2,"cool":1},"mAG3u9CB3yhJNm9v9U6J_w":{"text":"If you haven't been to this bakery / restaurant you are missing one of the most fantastic ","useful":0,"cool":0},"Ng2eu2MWle5zHWLJ4t358w":{"text":"This place is a bit of a mission to get to out to, but trust me, it is well worth it. Dong","useful":5,"cool":3},"8bNFjkyo_CLM-D_O4XYObA":{"text":"I have had my share of king cake and I was intrigued by the hype of this place.  We got bo","useful":1,"cool":1},"2liWRpXjzGcE46ATfjmc0g":{"text":"This place has THE BEST banh mi sandwiches ever !!! The sandwiches are always fresh, cheap","useful":2,"cool":1},"ge2YcSpYQMYjnySzpAvGwQ":{"text":"Bakery has very good products and bread that melts in your mouth.  The #1 Banh Mi, French ","useful":2,"cool":1},"Gl_adGyC42nXIUjMpuP6-A":{"text":"I have been to Dong Phuong twice now and everything I have tried has been delicious. I hav","useful":2,"cool":1},"LNZR-R0pw3QcCqNA_9z0Ng":{"text":"Not that good.  Summed up as buffet quality food, with less than great service. \nWent here","useful":0,"cool":1},"Ws3vAghbaxZHEmr53B5MaQ":{"text":"Best banh mi I ever had!! & that's after eating banh mi's in Oakland, San Jose, and even H","useful":3,"cool":3},"K6p1tYQcOciUIMZ7Z7wEJQ":{"text":"A frequent stop heading home post culinary binge in New Orleans. The lemonade is a refresh","useful":1,"cool":1},"wUw4jsVKSt9xMjqMVdkSQQ":{"text":"i grew up a few miles away from dong phuong (and i take personal offense to all the previo","useful":1,"cool":0},"r6uHcmC2pBsu5TimgoRlKw":{"text":"Out of the way place - been there a while but new to me. Drive around back. Food was excel","useful":0,"cool":0},"DJ_pITSeC5JFVsR7nMZOFw":{"text":"King cake is perfect!!!! No other in New Orleans matches it. Not even Ran'ñ;:/ buahh.","useful":0,"cool":0},"M4LzSVCRSIbZcVYzijromg":{"text":"This review is for the restaurant; I haven't had the chance to try the bakery.\nAbsolutely ","useful":2,"cool":1},"Lqud7IMyrMAARpJyjEuomQ":{"text":"This place is a local favorite and have been around for a while.  We never have a trip to ","useful":3,"cool":1},"d-QmY8LlyyrgbdR0NrjN1A":{"text":"This place is AHHHmazing! Love all their food and service is fast but food still comes out","useful":0,"cool":0},"_btx4ZbRveVFSuHghTrh4w":{"text":"Very cheap. Bakery is cheap too. Food was quick and great. You are in New Orleans east so ","useful":1,"cool":1},"ZlQbY69RjAgE9jGqXvojBQ":{"text":"Just passing through, looking for a place to eat.  I don't know how this place gets so man","useful":0,"cool":0},"wPz_NeFEZjui-lWSUEUc3g":{"text":"I award 3.89 stars to the bakery (I haven't eaten at the restaurant half).  I have only be","useful":1,"cool":0},"zqOupmCuOikY0p-QyL6zqw":{"text":"Food - the food here is AWESOME!! I ordered the Bun Nem Nuong, Bo La Lot (noodles with por","useful":0,"cool":0},"8eBiHGSqsXILUn9yx9EQtA":{"text":"In these parts some peeps refer to the banh mi as a Vietnamese Po Boy!  Go figure!  I'll t","useful":5,"cool":4},"wex7YQAW-ezDIPW0SqKAAg":{"text":"I always enjoy this restaurant.  The Vietnamese food is consistently high quality.  Always","useful":4,"cool":2},"EM96c0vHM4UDKktVxtuqRQ":{"text":"This place has one of the best banh mi ever, in and out of Vietnam. The banh mi dac biet/c","useful":1,"cool":1},"YwUkTCNCbot40YBMpeelrA":{"text":"I grew up eating here as a child and the memories never go away.  The food taste great, th","useful":2,"cool":2},"knNWq1buhn33-fMv3aAKyg":{"text":"Meat pies are tasty. I CRAVE their bun bo hue and banh mi (French deli style is my favorit","useful":1,"cool":0},"NY2wDNyBAjHkR2al9jNhpw":{"text":"I treck out to the East when I REALLY need my vietnamese fix.  This place can get crowded ","useful":2,"cool":1},"is7L5DwymqWRDDNh3IWZ2g":{"text":"Stood in line for an hour for king cake and it was worth it! Great flavor. Different than ","useful":1,"cool":0},"zeSLh4xRzSadg2VU9fLDaQ":{"text":"this is what dreams are made of when it comes to bahn mi.\npunch card?  why yes thank you.","useful":2,"cool":2},"4cjd_KWSEU5-XSWwxmfkIw":{"text":"This is the best, well-rounded viet food in the area. The bakery rocks too. Grab some Banh","useful":1,"cool":1},"ltUToq5Dpgbcmm9_uyuvow":{"text":"Why have I never had this before? \n\nEverything is super cheap, super fast, and SUPER DELIC","useful":0,"cool":0},"NmmDN5gTbexedl0wyI-IBQ":{"text":"On the way to New Orleans, after a search with Yelp for place to eat, it leaded us to this","useful":0,"cool":0},"00K8qr_Tc8a34Ry9vdIKvg":{"text":"Wanted to explore that area of LA but there wasn't much of the community. This was the onl","useful":1,"cool":1},"i6AQm24dfa7Wvti_DiF82Q":{"text":"Good food for a decent price. If I ever visit New Orleans again, I'll definitely try to co","useful":0,"cool":0},"wHblGySy8M-IKpOlPZn1kg":{"text":"Everything was great food is amazing food comes out fast great for groups family dining at","useful":0,"cool":0},"ydh9Ro_jpxzjICGfIx0uoA":{"text":"Best place ever!! We always get pho and coffee. Of course gotta get Banh mi to go! The pri","useful":0,"cool":0},"ut34zE44RdDNT0gdnMEimw":{"text":"This restaurant is divided in half one side bakery, other a sit down menu. We ordered boba","useful":0,"cool":0},"lnDHUhChDV-l7RUQZ9_y7A":{"text":"I had to try the Dong Phuong King Cake. My friend highly recomended it. They sell them at ","useful":2,"cool":1},"ce6DqegElQoL7Xh6JD9bXA":{"text":"Like Vietnamese food? Dong Phuong is worth the drive!! They offer amazing, authentic Vietn","useful":1,"cool":1},"BhaPTUCtTF3y0rSlhJ0JCQ":{"text":"When ever your headed east you have to stop at this jewel of the Vietnamese community. The","useful":8,"cool":5},"LTHNlMAalvWg091s2ORY4Q":{"text":"I'm surprised I haven't eaten here more, but I love the food they have here! I just love d","useful":1,"cool":0},"tEFLHwlTpnQXJYgGjAiQxA":{"text":"New Orleans got more than just gumbo and crawfish, y'all. Vietnamese folks have had their ","useful":0,"cool":0},"BMsSFnFsoELhacA3vm4ONQ":{"text":"I love Dong Phuong and I'm so glad it is apart of our community and it's like 2 mins from ","useful":4,"cool":1},"hUs_gSDHAUvpzuHJaRNgdg":{"text":"Needed a veggie plate.  I ordered vermicelli tofu with spring roll.  Great dish, very fill","useful":0,"cool":0},"5YOsDw8IAXbQpYA1rn4fbA":{"text":"This is a nice Vietnamese Restaurant for a quick lunch or dinner, they also have a little ","useful":0,"cool":0},"nYIfx0YgvEFk1EJQAxctlA":{"text":"This review covers both the restaurant and the bakery. It is also written with Chicago Vie","useful":0,"cool":0},"U5wzsbGutcYDLgmBOe87rw":{"text":"Made a quick stop here after visiting the Vietnamese farmer's market on Alcee Fortier Blvd","useful":3,"cool":1},"-wBUUim3F4NWXW5CeaIztw":{"text":"Best King Cake & Banh Mi you will ever find, everything else is also amazing. Plenty of va","useful":1,"cool":1},"sSO6PxSWd5I9VoBbjaRl-g":{"text":"You're going to come to New Orleans and at some point you're going to talk about Pho and B","useful":7,"cool":5},"_Tyi3cES_vx7tnwm7U13Lw":{"text":"This is the home kitchen Vietnamese restaurant that you can either get your Americanized f","useful":17,"cool":19},"dM3Uam15lgCHGcTYlnxS5Q":{"text":"Really enjoyed the wonton combination soup..service was awesome and it very family friendl","useful":0,"cool":0},"BaMIaKBEUgV5ZJUczKM4Tw":{"text":"By far the best bahn mi I have ever had . Extremely fresh and fast. We visit from Slidell ","useful":0,"cool":0},"wj-SBaFKhLGc2qDxUR0qaA":{"text":"Amazing banh mi! Let's start with the bread which is baked fresh every few hours it seems.","useful":1,"cool":2},"KQiALeLwO7Rczpp3ovaeHw":{"text":"So I heard about this place via social media and word of mouth. I was told that this place","useful":2,"cool":0},"ARib7pFLXo-4aaCnmuWvoA":{"text":"When I'm at home I'm the weekends and can remember this is my go to place for pho. Not to ","useful":3,"cool":2},"nXAOs62gW2KGHrZIwMtfQQ":{"text":"So if you haven't already heard, this is one of the top places for a king cake in Nola. I ","useful":1,"cool":1},"3g4UJJlIzCOyqkMAPv8Qxw":{"text":"Best pate chaud hands down!! My family always visits here whenever we go to New Orleans. W","useful":0,"cool":0},"rrGjrZBg1nEurla_jxh2JA":{"text":"What can I say?? I've lived in the east for the entire 23 years of my life and DP never fa","useful":0,"cool":0},"tlHc-GZAM9noXYYy_bZMsw":{"text":"Absolutely love this spot! Egg drop soup is to die for, grilled shrimp and their veggie ro","useful":1,"cool":0},"iN8_TTlH0ghzLE2ZeAU7QQ":{"text":"Very clean with delicious looking bakery items.  The Banh Mi Phap had a thin layer of crun","useful":1,"cool":1},"mnuGBHvggh3e9xFuSUYq7w":{"text":"Lots of pastries, soy bean milk, bread, and Che for decent prices. Large parking lot, but ","useful":1,"cool":0},"Wb5u-pM3l3hwxMZb5eMuxg":{"text":"It's the best king cake in town. I just wish no one else knew that. But I guess the secret","useful":3,"cool":1},"yrqNclm_cBvlTngGUI936w":{"text":"Just go! Get up on Saturday morning drive out to the east and stock up on your baked goods","useful":1,"cool":0},"vvIyaQ96-L_6RE5riWZWnw":{"text":"This is both a restaurant and bakery of wonderful cakes, pastries, and French bread (with ","useful":5,"cool":3},"TRxUzPZLL2AUAS8eh_FV9w":{"text":"Had Pho with flank and soft tendon.  Broth was quite bland.  Price is right.","useful":0,"cool":0},"1k1dzIuJXpqvNDJwJCmXHA":{"text":"Bahn Mi and Pho are exceptional and the prices extremely reasonable. I will return next ti","useful":0,"cool":1},"RMIFzorItlypooDcmiLZBA":{"text":"Delicious. Not the most safe place if you are vegetarian. Plenty of meat:vegetarian cross ","useful":1,"cool":1},"m3-Gx8lKrT6fKDplbs-rzw":{"text":"With all of the hype surrounding the bakery I was a little disappointed with the restauran","useful":0,"cool":0},"C2GNyfhSjt-CUNd-JvpbdA":{"text":"I don't even know where to begin.  Their bakery is off the charts.  Best king cakes anywhe","useful":3,"cool":1},"tz-_SS22qekPyGcttOPPhg":{"text":"Banh mi and pho here blow everyone else out of the water. Bakery is stellar as well. King ","useful":1,"cool":1},"enuZONP1CC0RJvLQCDi43Q":{"text":"On Monday I purchased the Coconut Cookies, they tasted like store bought cookies, with les","useful":0,"cool":0},"kpWF8pZNuZXfoL53Z7rsYA":{"text":"I'm not big on stir fry but the stir fry here is amazing . The King Cake we stood in line ","useful":0,"cool":0},"guUiZZGlBt3C7Hr50hFvXQ":{"text":"Get the Bun Bo Hue. You get a HUGE bowl of noodles and so much meat. I couldn't even finis","useful":0,"cool":0},"Y4zTGjx6yUjepjPLnJ77ig":{"text":"I've been eating here every Sunday for lunch for as long as I can remember. I used to go i","useful":2,"cool":1},"3VdnYr6qqv_x9T7W32Emqw":{"text":"Amazing bonh mi. Fresh bread makes all the difference. A bit of a hike, we took a 45 min b","useful":0,"cool":0},"48f-ryoqhOpkuzAP3VgHsA":{"text":"The Dong Phuong king cakes have been a growing craze and they didn't start off as my favor","useful":1,"cool":1},"-haXB-SvMqmy0ewnOAlO2Q":{"text":"Favorite childhood bakery place.  Still good and even better today.  Great place for Vietn","useful":1,"cool":0},"s37aJmq6HCa99Y8XEMM5kA":{"text":"On a terribly rainy windswept summer day, I decided to drive out of my way to eat here. An","useful":4,"cool":2},"02hg9mCs-xKZW_5vCt6-4w":{"text":"I bought 10 po-boys and i just about to eat 1 today and its have sand in it. Omg. I have t","useful":0,"cool":0},"qrBE1ent3uoHUPxrlM0WCA":{"text":"Decent price. Nice portion & There's a bakery next-door which is a bonus. The best place t","useful":0,"cool":0},"QIDZyi8qBrMtUJZrRBStsw":{"text":"The kingcakes here are out of this world. But you don't need me to tell you that, just rea","useful":4,"cool":2},"PX5Bwbu7aFLyQEWoP5UAUg":{"text":"Ok, so I want to give this place 5 stars, but, my review may be a bit biased. I felt rushe","useful":0,"cool":0},"h_ZEZor_EnbNAv0jC-iMHw":{"text":"Best bread in the east and wonderful sandwiches too, I always get a number 4 add sausage f","useful":1,"cool":0},"f9NwOpcZx_MQ9nT4onXLfQ":{"text":"One of the most legit Vietnamese restaurants. If you like bahn mi, you won't find one more","useful":0,"cool":0},"KmnS3ZvxLZiq8Lh6cSoNrg":{"text":"I have been wanting to try this place since I moved to NOLA! They have such a wide array o","useful":0,"cool":0},"4q-C0YF7UVa8NYorPv8Iww":{"text":"I finally tried the famous king cake. I must say it was the best king cake I've ever eaten","useful":1,"cool":0},"iuIfChZJ9iF6uOt_SXOkBQ":{"text":"Vietnamese food is my favorite cuisine, so it makes sense for Dong Phuong to be at the top","useful":9,"cool":5},"nL88ujCuP6AXk9Jz15lDhA":{"text":"Can't say enough good things. It's far out there all the way into the east, but you can't ","useful":0,"cool":0},"063Cr8w0-r3KVmkm8f8ptg":{"text":"Y'ALL. I just tried their pecan king today. I didn't think I'd ever try a king cake that w","useful":3,"cool":1},"eQXZA2tF0nysGezxPqSk2Q":{"text":"So there's this guy in my life. He's sexy and funny and is pretty much every girl's dream ","useful":21,"cool":15},"vpz-tsAjl9Se425uS8g8eA":{"text":"I ordered some of their meat pastries and they were delicious! My mom makes similar pastri","useful":1,"cool":0},"a-4aJZbB_wnsivu6t_VjMQ":{"text":"3 different stores here\nKING CAKE - fantastic and kinda hard to get, you gotta get in line","useful":3,"cool":2},"yO7Fvo7BoJ3FqYv4Z5Db3Q":{"text":"The worst Pastry I ever had King Cake? Really I'm sorry I'm 56 been eating king cakes as l","useful":0,"cool":0},"BzVtreYtOx2-Lmk7zecCLw":{"text":"I would skip the restaurant and grab the banh mi from the bakery attached to it. They are ","useful":1,"cool":1},"jVpMkG7sgYA3Vjur-0Rniw":{"text":"Es la temporada de King cakes y no podía dejar pasar la oportunidad de comprar uno aca. A ","useful":0,"cool":0},"SJTR_KcT7kitn-zhOcbC9A":{"text":"Came here for the bread and pastries and left happy. Some stuff were a little bland but th","useful":0,"cool":0},"ri_C1pH8gEbvDRhNiYq6eA":{"text":"The food here was good, and I like that they use large, fresh cuts of meat for their banh ","useful":0,"cool":0},"l52Ao7mqJ9VDJV6YaIXU5A":{"text":"This is the worse Pho I ever ate in my life. The bun rieu was editable but it was salty as","useful":2,"cool":1},"MkMYUekwtDEna2V11DCTNw":{"text":"Best king cake ever!!!!!! Cream cheese filling is my favorite, however, the traditional is","useful":3,"cool":1},"Bj_w29pP7laamgMmGFbY-A":{"text":"This update is for the bakery side and also the grilled chicken and pork chop rice dishes.","useful":0,"cool":0},"nSeP999BQJywcf1J4gj_gQ":{"text":"I stopped by here while I was visiting New Orleans.  The sandwiches aren't bad at all.  I'","useful":2,"cool":2},"_5fCARatKSn0cY5OQxi7xw":{"text":"King Cake Review and How To as a Not Local New Orlean Person:\n\n1. Order in advance but tha","useful":0,"cool":2},"UH1FD2g_N7u_wWV36D8uyw":{"text":"Been coming here for years. Tried alot of their products. The banh mi sandwiches are great","useful":0,"cool":0},"qZwfumfbpgtrlrBnGPDJ1A":{"text":"If your ever in the area and you have a chance to come to this restaurant I highly recomme","useful":5,"cool":6},"042jDihZKThqSERvFSJ6HA":{"text":"The BEST banh mi in New Orleans.  When driving to the Mississippi coast I will drive out o","useful":1,"cool":1},"AHEyn1lRcHELndJ8PhG8Pg":{"text":"I've been going here since I was little.The food never disappointed me or any of my family","useful":1,"cool":1},"HJ-CseduTMioGeV6rDLFbg":{"text":"The best damn king cake I've ever eaten! It was a dream come true because I love Croissant","useful":0,"cool":0},"7pFVkodTvJHoM1yqu23h1A":{"text":"4-5 stars for their meat pies and steamed buns \n2-3 stars for their chicken & pork chop en","useful":3,"cool":2},"jqf6dKsTqdrbLYYv1V0V8A":{"text":"Great banh mi!!! Every time I come to nola I buy in bulk go being back home. Great sandwic","useful":0,"cool":0},"kTB8WaFJYC4bfAAUxjtgMg":{"text":"We were visiting from Atlanta. I wanted to try out this bakery that we've been hearing so ","useful":1,"cool":2},"_ELAGawyHsY5Iygge4D4ew":{"text":"This was really good! Delivered in a timely manner and it was still hot.. I ate every drop","useful":0,"cool":0},"7BLAVNSUGKD9WdSC0-2HwQ":{"text":"This Vietnamese bakery & restaurant's Yelp reviews let me know there would be something ve","useful":3,"cool":3},"CTFhZwRG3-1ctgf3p0vvkQ":{"text":"This is true authentic Vietnamese food. We always order the pho from here and it always br","useful":2,"cool":0},"J3X3cNhHmiEbRPcIdlMgsA":{"text":"Want the most authentic and cheaply priced Vietnamese food in Orleans Parish? Then come on","useful":2,"cool":2},"Qt77bGyk_C8k8gsHdwpARw":{"text":"This was a well reviewed place so we came on our visit on our long road trip home. We got ","useful":0,"cool":0},"JT9p45moZaUF-6hBjdEpQg":{"text":"Super delicious pastries and meat pies. Unique pastry items to purchase to go. Didn't try ","useful":0,"cool":0},"S2IjQE6hSbfl7HEImSZSsw":{"text":"Seriously out of the way and seriously worth the trip.  I really loved eating here and als","useful":2,"cool":1},"1ks9JLdK4j9byLWWu9eVeA":{"text":"King cake review\n\nThey are not open on tuesdays. \nGo on a Wednesday 1030 am\n\nSign says no ","useful":0,"cool":0},"HKGBFxkk10L-PIAv6xWIwQ":{"text":"I used to frequent this place as a kid so I had to go back there again. They also have the","useful":0,"cool":0},"pooav9I6J3hS-pAngG4-dA":{"text":"I've been going here since I was around nine years old, it's a great place and the French ","useful":7,"cool":5},"fYlFz538EzK65xdZE7vHiA":{"text":"Great Vietnamese food, right in the middle of nowhere!  Seriously.  You have to drive to t","useful":0,"cool":0},"JDWFFG5Jv9QEsFpxz9qf7A":{"text":"This place is AHHHmazing! Love all their food and service is fast but food still comes out","useful":0,"cool":0},"xn9W-J5Vtk7hYXplu9v7Wg":{"text":"Lucky me! I'm never in the East, but I had to take a work trip out here, so of course I kn","useful":6,"cool":3},"G2AEQfA01AKyMzeOuWc2nQ":{"text":"THIS PLACE ROCKS!!!! Veggie bahn mi only $2.25!!!! And the little canned ice coffees are s","useful":2,"cool":2},"s6z28R40KInXJ5UKfYi_og":{"text":"The place is packed at lunch - with Vietnamese customers (old and young), refinery workers","useful":2,"cool":2},"ws0p5ftm57BQHHo8MrCIlg":{"text":"This is just a review of the bakery... I had the French cold cuts banh mi. Very good and f","useful":2,"cool":0},"l21NjybABUf0hLDjr4jrAg":{"text":"This is very good Vietnamese dining or lunch. Large servings cozy interior. Always busy fo","useful":0,"cool":0},"kra9umQSaHThgGW3fjMbng":{"text":"I arrived at 7:20am (they open at 8am) on a Monday and was the 5th person in line - no iss","useful":0,"cool":0},"OnFjZAdSRyBgC5LIP8nnLw":{"text":"Absolutely delicious bahn mi and noodle soups. Yes the service here is slow because of how","useful":2,"cool":1},"bvZHwoG-lqAql4YQPAETIQ":{"text":"This is the best Vietnamese eating we've had in NoLa. Let's summarize why...\n\n1. Service: ","useful":1,"cool":1},"_UHjLW38j76hPhtbsHYA_g":{"text":"Ok here it is the chinese meatball sandwich out of the bakery was awsome the house special","useful":1,"cool":1},"OG03m089VNbl0EmzeVpiOA":{"text":"The pho is so freakin' good! Big portions, and the sweetness of the broth warms my belly. ","useful":6,"cool":6},"NSKIziowoddZG7Ophc06QQ":{"text":"Coming from Houston, it's hard to find a Vietnamese restaurant that matched nonetheless be","useful":2,"cool":0},"cXtUAu6VPBFfoxO1Bl_7iQ":{"text":"The place is packed at lunch - with Vietnamese customers (old and young), refinery workers","useful":3,"cool":2},"f9Ax-AKkC-aHpwW7Y4LlWg":{"text":"Quick service for sandwiches and they have a few vegetarian options which was unexpected a","useful":1,"cool":1},"gS6rkHuNms_mt2Ey_TBBdA":{"text":"This was easily one of my favorite restaurants I went to while down in NOLA for the week. ","useful":4,"cool":0},"0fNGvEs2u3u8KHnHi0uGwQ":{"text":"Small place ... service is kind of lacking. Food is above average. The location is not opt","useful":0,"cool":0},"I3XJyC5L-m-MGhBh7yQmSw":{"text":"Excellent bakery and poboy bread. Many local restaurants use this highly coveted bread so ","useful":1,"cool":1},"1vocliJh9uxJ9amB02XvBw":{"text":"Always a favorite spot for my wife and I on a Saturday afternoon. I always order the manda","useful":0,"cool":0},"eVlkdQmpRP2mtX_EZgDU6g":{"text":"This place is a diamond in the dirt. Hands down the best Vietnamese I have had in the sout","useful":0,"cool":0},"SXnX68XgAuieUY2B07etlQ":{"text":"It's been incredibly tough to get hands on their famous king cake and I've been trying to ","useful":2,"cool":2},"G2pCfrDxLP_B_oBZabRvhg":{"text":"I'm not a Vietnamese cuisine expert, but I think this place was legit. I had the vermicell","useful":1,"cool":1},"H5kEOhR9O3TWgGYcW2iN5Q":{"text":"Busy traditional Vietnamese bakery and restaurant off the beaten path from downtown New Or","useful":14,"cool":13},"Q3kQkI6spmuuaRTmyUES8A":{"text":"I really liked my Vietnamese Ham Bahn-mi! The bread was absolutely spot on-I think I liked","useful":4,"cool":3},"ADwB-eG6aQgxbMwlrlU0Ng":{"text":"So sorry to have to leave this review because I like to support hard working immigrant bus","useful":1,"cool":0},"tlf07jODpjS-HdUjXC0e5w":{"text":"Dong Phuong is a staple restaurant of East New Orleans. When you're craving for some good ","useful":3,"cool":2},"oOQmUW9oIfvEegtkRZlTdw":{"text":"We have been coming to this place for years. We moved to Dallas and we still come here whe","useful":0,"cool":0},"x06wkDzy4BqpPoFcbC-h1g":{"text":"Five Star Rating for the Bahn Mi at the Bakery. Three-four stars for the restaurant. The r","useful":5,"cool":3},"yrLX4BcWaTpTVgYplBCKMA":{"text":"I did it y'all! I got tHe best kingcake in Nola! I pre-ordered and drove my happy butt to ","useful":8,"cool":5},"kadeT5NCroj4Zmu6PvxxOQ":{"text":"My fiancé tried surprising me with a king cake from here last weekend since he knows they'","useful":2,"cool":1},"fAtVCI2ynOhseUON9z3kYA":{"text":"This review is based on the bakery only:\n\nI always come here for baked goods throughout my","useful":6,"cool":3},"Hf8Rd50fQQ59TxeJba2b0g":{"text":"3 Years after Katrina and I trek back to my old hometown.  After eating cajun food for a f","useful":2,"cool":0},"ZGq3yOEnrVT8sy588L5rcw":{"text":"Wow! While it's really out there in the East, it just might be worth the drive! For someon","useful":1,"cool":0},"OhdPyQ3vZmaQ5xj_lctKUQ":{"text":"If you want to try different authentic Vietnamese food and Vietnamese baked goods, this is","useful":0,"cool":0},"EiqKyHKPwd1hqiFNHMNvmw":{"text":"Finally drove to Dong's lace to have lunch with my wife.  You have the bakery full of past","useful":2,"cool":3},"gUDRcigVSA4zZsifhie1eg":{"text":"I just tried out the bakery side of this restaurant this afternoon.\n\nI must admit, the dri","useful":2,"cool":1},"NFVfAxm_5zg-WdZtzy9uwg":{"text":"My kiddos love the bakery. There bread is divine. The make a mean bai mai sub. They say th","useful":1,"cool":1},"6lRF6lBOVLZtDjf3Q5Z8JQ":{"text":"The restaurant was like a typical vietnamese restaurant with solid offerings - note howeve","useful":0,"cool":0},"m8SWm6TqYmQUIUNFX0gGwg":{"text":"The situation:\n\nGoogle Maps and Apple Maps will take you to an empty lot, keep driving abo","useful":10,"cool":3},"sqopm3xzLwpVmbUTx1EIkQ":{"text":"They have the best king cake, the bread was like croissant bread, I bought the almond crea","useful":0,"cool":1},"_iFxukw1oOaCafjPBbPDpg":{"text":"Wow near perfect rating? The owners must know a few people, cause this place sorry.\n\nIf yo","useful":5,"cool":4},"cEctsF81q8Faf_wZ4_c1fg":{"text":"I'm pretty sure if you're in the New Orleans area then you already know about this gem! It","useful":0,"cool":0},"i8EnKiPKCNtcbp3U46Fp-g":{"text":"Holy ****, they have the best king cakes I've ever had! The cakes are super moist and the ","useful":1,"cool":0},"0M7LCOykl5fulgPn_A_bBA":{"text":"I have always loved Dong Phuong Bakery, and am surprised that I didn't write a review for ","useful":1,"cool":1},"NGvJCIVR_CbgcnqQn03e4g":{"text":"The bakery was closed so we had to eat at the restaurant . So bad! We are from HOUSTON so ","useful":0,"cool":0},"rt3qXNWP7lO9ocdKt_rAxQ":{"text":"#5 Vietnamese grilled pork was a very tasty banh mi. Note, the banh mi is only available i","useful":0,"cool":0},"9uC3QsJdkEIzwkiMb00-kw":{"text":"The restaurant provided an excellent meal. I pre ordered king cakes and decided to have lu","useful":0,"cool":0},"Kv7SG1mPGSSSrYm_FovUlw":{"text":"I eat here all the time for lunch. Bahn Mis are awesome especially the pork, service is ni","useful":0,"cool":0},"rbn7VXd8IaASZ8gkSPRlzA":{"text":"Seafood pho was good, but not the best I've had. Broth was on the weak side, and there was","useful":0,"cool":0},"Y_EMYOwab5cqpWPzUzeFvQ":{"text":"I love love love their cheese cake and lemon pie everything is homemade every morning. Hav","useful":0,"cool":0},"yRW8C2iW9-iEQ0LRCy1skg":{"text":"Really great Vietnamese restaurant.\nExtremely inexpensive && authentic.\nUnfortunately, the","useful":3,"cool":2},"RbopFRWiNgkeA03tyRmVYA":{"text":"O.M.G.\n\nThat's honestly all I can manage to say because their king cake has rendered me sp","useful":5,"cool":2},"qG6H-pJOa7XqhIUy0r4igA":{"text":"when I go to New Orlean, I always go to this location to enjoy my Vietnamese Food. I can g","useful":0,"cool":0},"_TAIM6dP9v0wYXYStLc7pw":{"text":"We take a drive once a week from the French Quarter out to Dong Phuong Bakery. This time, ","useful":1,"cool":0},"JAnQGF7cbpuFf6yPygih-w":{"text":"Simply the best king cake in New Orleans.  Now there is new gold printing on the box - two","useful":1,"cool":1},"FC7rSQyzqo_QDsqAk6W0jw":{"text":"This place deserves 5 stars so much, if I can say that.\n\nA few miles out from the city cen","useful":1,"cool":0},"6t2NDVxBK99GwZwzpfd9RQ":{"text":"Limited capacity seating but the restaurant is open, and bakery allows 5 people in at a ti","useful":0,"cool":1},"JxJjfpC2S5hq73mf11hVNw":{"text":"Drove from Baton Rouge to find out they are closed for \"Chinese New Year\". Their expensive","useful":0,"cool":0},"U51xLHSxbA0LlsP_Pm-igQ":{"text":"Best po boy in new Orleans.  Hands down.  4 bucks, you can't beat it.  I've had the vietna","useful":1,"cool":1},"hc2alrFKsq_UQbyqFvFzxw":{"text":"Forget the po-boy. Dong Phuong's Bahn Mi is the best sandwich in New Orleans. \n\nBefore you","useful":14,"cool":6},"wzJvb10id9fPenUwKJ02Bw":{"text":"The service here is horrendous. We're never going back. I was in line waiting to order whe","useful":2,"cool":0},"GhsTknBwy6RxMl7kK69sbg":{"text":"WORTH THE DRIVE from New Orleans. Get the banh mi - they're so cheap and delicious it's ac","useful":1,"cool":1},"6j8hb4QNCGUWsgbowIfYqQ":{"text":"This place seems Vietnamese to the bone. Not that I'd know for sure, but it glows with aut","useful":1,"cool":2},"1t-GDjNFv4OZXOrC71szKw":{"text":"Recently got some meat pies from here, had multiple meat pies have pieces of rubber band i","useful":2,"cool":0},"zFe0fhuJ-XDxzkzMLz7QoQ":{"text":"After hearing so many great things about Dong Phuong's king cakes, I had to order one!  To","useful":2,"cool":2},"zLT166EkZxhOFPLG0xDGlA":{"text":"The best king cake in the state and in America! Get there early because the line will form","useful":0,"cool":0},"osH4NgLphAOVuqQGIUk2Iw":{"text":"JAMES BEARD AWARD KING CAKES\n\nFour decades ago \"Village de l'Est\" was home to several thou","useful":12,"cool":9},"j92brVcU6YDaku7RM-R6-w":{"text":"This seemed like a bakery in the middle of no where. There were many places which looked c","useful":0,"cool":0},"AvtFjzhSndtze1tzYT47sw":{"text":"New Orleans may be recognized for its wonderful offerings of Cajun eateries but it also ha","useful":10,"cool":6},"9_64qwgThHqYR_Om0s_Jzw":{"text":"By far the best Vietnamese restaurant in New Orleans.  Portion sizes are huge and the food","useful":0,"cool":0},"9JD5Qe92aGowGMkwniNLhg":{"text":"My family and I love stopping by this place every time we visit my grandparents for the ho","useful":0,"cool":0},"mqOPFZP8goRw8LE-c7FBvA":{"text":"Oh man. It's king cake season and you already know Dong Phuong is poppin'! Located in NOLA","useful":4,"cool":3},"kAFEv0t_xgHMsqGH7S0Wng":{"text":"King Cake was amazing. Restaurant service wasn't the best. One person taking orders. One p","useful":0,"cool":0},"5CPmifFThyBmUdT9AAyiwA":{"text":"I bought 10 po-boys and i just about to eat 1 today and its have sand in it. Omg. I have t","useful":1,"cool":0},"Tsi6XhdZqVXWwe1OPGzT8w":{"text":"My husband and I had the egg rolls, grilled pork rice plate, and beef rice plate. All were","useful":3,"cool":2},"LTnpX_M3eZ6nVG48syco-Q":{"text":"OWNER FEELS THEY CAN NEVER BE WRONG AND REFUSES TO TAKE ANY RESPONSIBILITIES FOR THEIR MIS","useful":5,"cool":0},"E-pWjf6cm26Hz5w7v47KvQ":{"text":"Five stars for the greatest king cake in all the land! Driving 30+ minutes to the East is ","useful":3,"cool":0},"A-xKbilLmgInfT0woKtJUg":{"text":"Finishing up my review for this place.  Excellent banh mi, just love them, buy 10 get 1 fr","useful":1,"cool":1},"bo_ELTQ6gV-bbjTTJYWVqA":{"text":"The only reason I have rated this two starts is because of the daughter of the owner who i","useful":0,"cool":0},"2dfHnsca0POJKsu4SE8fuA":{"text":"First off, if you are visiting like me, know that what looks close to Vieux Carre on the m","useful":0,"cool":2},"e78ORXfyvCFEkVURQFKuAA":{"text":"This is the BEST banh mi I've ever had. In my ENTIRE life. Dong Phuong is truly as good as","useful":0,"cool":0},"xWPdFzKZtTiNALmLUGbTug":{"text":"This king cake was so good! One of my coworkers braved the line and grabbed a cream cheese","useful":0,"cool":0},"3avAuQuc3dkoqlVE-Dq_DA":{"text":"Oh man, I haven't been back here in so long! So much have changed! From building remodel t","useful":3,"cool":4},"pJJDvu1S0CzhKMH8O6UHTQ":{"text":"My first time here and definitely the last. Bad customer service. Staff are rude and no ma","useful":0,"cool":0},"3GN2t-z030UbNSaCxJEIpA":{"text":"I LOVE Dong Phuong. Every time we head back home from Mississippi, we make a point to stop","useful":0,"cool":0},"3AR04uMRv3-GyAX2iiZWlw":{"text":"It is with great pleasure that I get to review this place. It's almost as great a pleasure","useful":7,"cool":5},"jb0ru7eY1PqTGI4_clAU0Q":{"text":"This place is a bit off the beaten path, especially if you're a visitor to New Orleans, bu","useful":3,"cool":1},"dHtDYmiK0yg7EPsW25w86w":{"text":"This place is such a disgrace to Vietnamese food. I ordered Thai tea boba and I took one s","useful":1,"cool":1},"43rWruAk2D1-NnjrG0oglg":{"text":"Went there on the first day with hopes of getting a king cake.  I got \"rolled over\" by a s","useful":3,"cool":3},"lZSPP9Jdd6kdsRQoQ5340Q":{"text":"I went out of the way to find this place (X2). The pho was good (I usually get pho tai nam","useful":0,"cool":0},"yPs1B1ubQtIxTR3jge5tBg":{"text":"Best pho and bakery in Louisiana! Huge portions and the french rolls are light, fluffy, an","useful":0,"cool":0},"vghAWKSUIiFCGea9rknhlg":{"text":"Simply put, their bakery is AMAZING. The bread is always hot and fresh. \n\n-The banh mi is ","useful":2,"cool":2},"XsvjBI2qhOo4VcHggCYVag":{"text":"I dont know where to start. I have heard so many stories about how good their king cakes a","useful":2,"cool":3},"iPgjAJhAFuIerbtk7wTKaw":{"text":"King Cake King Cake King Cake\n\nI don't need to go into a full story because their cream ch","useful":13,"cool":11},"7O_5UxrOiF3-B-7xTlmizg":{"text":"I finally got to taste the mythical Dong Phuong King Cake and it was delicious! I had alwa","useful":9,"cool":9},"YfleJzNTLMEmOCi9S2S7lw":{"text":"The  patê sô was soooo amazing, the best I ever had. Wish I lived closer. This place is am","useful":1,"cool":1},"KRzhM0ZSuzWC8TLEnCf_bA":{"text":"The pho and spring rolls are great.   Get the Lemon grass beef with vermicelli and add egg","useful":2,"cool":1},"Bqhv48hRyDD1aIQedrlDjw":{"text":"Quick low-down of why I love Vietnamese baked goods: for those who don't know, there is so","useful":3,"cool":3},"3YNIWLeunQ1W6rkVU7jyug":{"text":"The hype is real! My boyfriend and I decided to make the drive over for some pistolette ro","useful":3,"cool":1},"yCZIzk9GJJie-v-PKbwGfQ":{"text":"Their king cakes are legit.  Had a friend mail one to our office for celebration of Mardi ","useful":7,"cool":5},"zm7xXMv95POtKNr5EptgAw":{"text":"Got a #5 Vietnamese grilled pork banh mi to go. This was the best banh mi I've had in MY L","useful":0,"cool":1},"QgjBDSfSTc-13zsFE85ROg":{"text":"Arguably the best banh mi sandwich I have ever had. Sooo juicy and fresh. The bbq chicken ","useful":2,"cool":1},"SlsYrtQ2jfzsAybO8mrvSA":{"text":"As soon as we landed at the airport for our week long vacation in NOLA, we made a bee line","useful":1,"cool":1},"gHZnYQdyzMurlci0-GrcSg":{"text":"I have been waiting to try this and didn't think my husband would be interested in going a","useful":4,"cool":2},"myj4ehlZSLfAiBCv4aOzjg":{"text":"The BEST banh mi I've ever had!!! \n\nWe were driving out of the city when I decided I wante","useful":3,"cool":2},"d8HuDvOgmv_L183GN-oG2Q":{"text":"Amazing food. I love the pate chaud from the bakery. Definitely worth the drive to New Orl","useful":0,"cool":0},"oM1vMAs1wcio6C69snZkNA":{"text":"What's with all the stars?! We went out of our way to come here due to recommendations fro","useful":1,"cool":0},"8qgtZiw-3QgxWwWXt__LPA":{"text":"As everyone has said, this place is super Vietnamese. Whoever said that the clientele was ","useful":0,"cool":0},"nFUwrVLfB5yKa6RflWvWsQ":{"text":"Oh how I wish we had a place like this in Denver, CO.  In, Denver, in the few places I can","useful":0,"cool":0},"j1LCNXTpZ3AFSGSKkGYGqA":{"text":"Ok, I do hate repeating but this bread is the bizness.  For reals.  The coconut macaroons ","useful":4,"cool":2},"Qz7mhEDJXwq_futKfuSFyw":{"text":"Dong Phuong is New Orleans East's gem. My review is for the bakery and not the restaurant.","useful":2,"cool":3},"mYxgSvfONFo__wgWD212Xw":{"text":"Lines begin at 8:\nJames Beard Awarded King Cake\nDong Phuong; Journey East\n#NOLA_Haiku\n\nSim","useful":3,"cool":2},"aVWeRKqWjA0rzE3aHG3TlA":{"text":"This place would be impossible to find. It is in the middle of like literally nowhere. Thi","useful":2,"cool":1},"74JzEi2sxMU_WMrWbkzVAQ":{"text":"My boyfriend flew in from California and wanted to try the best king cakes in New Orleans ","useful":1,"cool":0},"eeyhNRnsGXWXDSAmCWjnNg":{"text":"They're not getting one star because of the quality of the food. I went and took some pict","useful":1,"cool":1},"rtumC6IO1moidg6aCrcpCg":{"text":"Finally was able to come and try the famous Dong Phuong I've heard so much of. Ordered pho","useful":0,"cool":0},"5k63n-E7VSU170KTftgmHg":{"text":"Maybe it's good that Dong Phuong isn't closer to my house because y'all know I love the ba","useful":5,"cool":3},"-APDfpSOoudb2H2Zk2CqKw":{"text":"If you have not tried their King cakes yet, what you doing in New Orleans?","useful":7,"cool":7},"Xe0uYMzsmC7JmzZSKyjc2g":{"text":"Hands down, the best king cake ever. Tried for the first time 2019 in town. Saw great revi","useful":1,"cool":0},"D78hI-cIgaQWdZeaYJ0lkw":{"text":"My friend's mother was so sweet and pre ordered us a king cake for our visit. She surprise","useful":4,"cool":2},"lgPYCvtWUj771Dx6V4cn7w":{"text":"I really wanted to like this place and had higher than average expectations for it because","useful":0,"cool":0},"p734GFhbqm7aW6pgm6IA8g":{"text":"Stopped in both times just passing thru Louisiana.  THE BEST Bahn Mi we've had in a long t","useful":0,"cool":1},"M56Ky__I49DOohIipYhfcQ":{"text":"Originally from New Orleans, tho now living in san jose. Just discovered these guys last m","useful":0,"cool":0},"h7XPtVXuhLOufZrpFiSgUQ":{"text":"A friend from NOLA suggested this place for lunch and it was great. I have the seafood pho","useful":3,"cool":3},"eDG98CeTVhwYG6RMcbi6Pw":{"text":"I hate their pandemic hours! Closing at 3:00pm? It irks me because my cravings for their f","useful":6,"cool":3},"r41Hz9GPYALuLpvNDluu0w":{"text":"This place is definitely good for banh mi and its pastries. Restaurant is OK. That's why I","useful":1,"cool":0},"-wCZoYurQ77vunnd0FodJA":{"text":"Wonton noodle soup (mì hoành thánh)\n\nIt consisted of slices of boiled pork, fried fish cak","useful":0,"cool":0},"Dnrhoo0UU1eEGk_mVmihow":{"text":"Ok sooo I finally got a king cake from (DP)\nTHE BEST KING CAKE IVE EVER HAD \nIt's more lik","useful":3,"cool":3},"HR4hkP-SjEE4kb8pgqZWAg":{"text":"Totally awesome, delicious, tasty king cakes!!! Ordered three (cream cheese, pecan and cin","useful":0,"cool":0},"fF4Zb4Rv38shS3edBNRgtQ":{"text":"The soup that they give with some of their meals is so salty. The rice is probably the onl","useful":0,"cool":0},"s_W9o-RJ23jLhOSm9OpsYA":{"text":"Incredible pastries. The banh mi competes with any of the best sandwiches in New Orleans p","useful":0,"cool":0},"hyG0ph8xV-kdLiGSvBZy7A":{"text":"I crave banh mi like an addict craves crack.  For me, the bread that cradles the meats and","useful":4,"cool":2},"pH9yG97k_MpzoGv_HkS3qA":{"text":"The king cake here is TO DIE FOR. I can easily eat half a cake in one sitting. It's danger","useful":3,"cool":3},"663nGpJr_P2j1wkSDzSQUg":{"text":"I love Dong Phuong because they offer a pretty good range of baked goodies, from banh mis ","useful":0,"cool":0},"CgqkBEXgU8CqRrZKwtN5Ng":{"text":"I received my Cream Cheese King Cake today, thank you thank you thank you! It's delicious!","useful":1,"cool":1},"0K1pxEGx661Dl-X6kNLCdQ":{"text":"This place deserves 5 stars so much, if I can say that.\n\nA few miles out from the city cen","useful":0,"cool":0},"I5v4WQy2ys2rCXtVJhz8MQ":{"text":"This review is strictly on the cream cheese filled king cake. Fire! Super moist and awesom","useful":0,"cool":1},"6IhBOw4U6L6E9rmQwXdODA":{"text":"Consider yourself lucky if you can get one, bomb dot com.","useful":2,"cool":1},"NXdPKA5pjHRgvf9Eep0Yng":{"text":"Yassss! This bakery and restaurant is it. Fresh baked goods and delicious food next door a","useful":0,"cool":0},"CuR8NSn9uAQ6-6Fe7RHg0w":{"text":"The newest flavor of king cake is coconut. It is really good. I love the king cake from he","useful":1,"cool":0},"7GXmmmBfzxWs4jbldmMm7w":{"text":"Ordered bbq steamed bun, delicious. Almond croissant , Fried pork bao, and chicken meat pi","useful":1,"cool":1},"lQVKLbYHK-GWDwjZvgrUAg":{"text":"chinese vietnamese.  not really worth the drive all the way out here.  however, you can se","useful":2,"cool":1},"NCqmBqGeKPHO1Bl6_9M43Q":{"text":"The best pho & bubble tea hands down. Great service every time. Have been a customer for y","useful":0,"cool":0},"SdINiKhrTzouqg8bJbKabw":{"text":"11/10/2019: Today I ordered a bowl of Hu Tieu Sate. I think Dong Phuong is the only restau","useful":1,"cool":1},"OLZl9biosEuB1coK9iYP2A":{"text":"Of course, everyone loves the king cakes... my quick analysis is that they are good, uniqu","useful":2,"cool":2},"0xlf3GpM6wNnMdTDEz6vxQ":{"text":"What the hell have I been doing all of my life? I FINALLY made to the east, planning to ju","useful":2,"cool":4},"PKDZCXRZ8NTBsjJQZrsclQ":{"text":"Parking lot is pretty decent sized. I normally don't comment on a different city's restaur","useful":2,"cool":1},"_a4YHqS6JVPZ1mYuUxV_yw":{"text":"This review is solely for the king cake. This is an award winning cake and I have heard ab","useful":0,"cool":0},"s57qXTXInz0C2UqGbdxPyg":{"text":"I have only been here for the bakery items and the king cakes. This is definitely out of t","useful":0,"cool":0},"-HQrWex2ucCXHbnc9Zn1yQ":{"text":"Dong Phuong means \"The East\"  in Vietnamese and it is definitely far far east! But you wil","useful":3,"cool":1},"Nc6oEfoYWAdw6NhZOTAjaw":{"text":"This is probably the best banh mi in the US. I lived in Vietnam for a long time, and this ","useful":0,"cool":0},"I4ZSynRBSI1Znbyl6MeJiw":{"text":"Ate here yesterday and I've gotta say the women making the sandwiches kills! She got my gr","useful":0,"cool":0},"55xQ6C3Z82x_jZC7ezfsqg":{"text":"Love  all the pre bagged pastries, definitely tray all the stuffed meat pies of different ","useful":0,"cool":0},"N5NII2HcLosuWmnIT1UYlQ":{"text":"I preordered my Dong Phuong king cake back in December for pickup yesterday just so we cou","useful":2,"cool":1},"rCN_gJvsyfciGTS9yXxfDw":{"text":"If you're coming for a king cake, they're available on a first come, first serve basis on ","useful":1,"cool":1},"_qvQ1HNmzChRVcfamSFolQ":{"text":"King cake is amazing and well worth the weeks long wait. We got food from there just becau","useful":0,"cool":1},"aOOL8CuAwX7_fzBWE5ErXA":{"text":"Great Vietnamese place in New Orleans East. Banh mi at the bakery is a great value, very d","useful":0,"cool":0},"FRbyrZON5b8IBulZg9tZTg":{"text":"In my opinion this King Cake is top 3 in the city bar none! The bakery is solid and I like","useful":14,"cool":14},"C92GUudkGliEx93e5gBmzg":{"text":"Their almond king cake is the best in lousiana. The bread they use to make the cake is lig","useful":2,"cool":2},"rkgqxZujeNcth3tYw26PoA":{"text":"I *finally* got to taste their king cake after years of hearing about it but not knowing a","useful":2,"cool":0},"b7budO2MgQoHCb67hcecdA":{"text":"Best King cake I've ever had...& trust, I've had a LOT! Haven't tried the restaurant yet b","useful":0,"cool":0},"Xzqwhsmu7AdBFNrKTlnsdg":{"text":"Totally worth the drive! Absolutely amazing baked goods and the restaurant next door is fa","useful":0,"cool":1},"Jk7Isxv_noJl3xVWhvg9sg":{"text":"Great king cake! LARGE as the cake is not traditionally shaped link a ring, instead the ce","useful":7,"cool":3},"oC3up2FxrFLxEJFGwDsHEQ":{"text":"It's taken a couple of presidential terms, several Olympic games, and nearly a decade for ","useful":7,"cool":7},"zWzFJp7cQBmPEjyl8mZKdw":{"text":"best place ever the pate chaud is the best thing ever. so is the meat turnover. Bread is a","useful":0,"cool":0},"0fgUSE_-jFvbuZCsrCr45A":{"text":"Oh bakery goodness, how can I express how much you meant to me? We FINALLY made it out to ","useful":9,"cool":3},"s8D73oYA6V_yAt0fXD6oFg":{"text":"Great experience, as a previous local of the city I would escape the cajun, creole, fried ","useful":0,"cool":0},"649w3EIBf-P1IdXZIcOTFg":{"text":"Really tasty king cakes! The icing isn't my favorite but the bread and cream cheese fillin","useful":0,"cool":1},"wajcOBPAJRkBsk_LYx9CNQ":{"text":"Stopped going. Too crowded and once we stood in line for King Cake several years ago found","useful":0,"cool":0},"IvaiJ8LW8UmLvLTcy_Xd6g":{"text":"I haven't been to Dong Phuong in a long time due to the long distance travel. But for my b","useful":1,"cool":1}}