{"Fez7SlnnSD8zNDJywAONZg":{"text":"Last year, I went to O'Delice for a king cake to take to a Mardi Gras party. I spent $31 (","useful":2,"cool":0},"36xND7IN5-dDR9VMbi6qww":{"text":"Part of my soul is made of cake.  I guess that's one reason I like this place.  It's a sma","useful":1,"cool":0},"s5ccN1KRtbH3WeI4utHAnQ":{"text":"I ordered a chocolate cake on July 19, 2014 for my mothers birthday.   I was one of the be","useful":1,"cool":0},"efrg-n86XHr8YqSX4kHyPA":{"text":"O'Delice is a small vietnamese bakery on Magazine, however, their cakes are a huge hit.  I","useful":2,"cool":1},"WHD7xcNvWGjW3Wt4vPYQRw":{"text":"A cute place and friendly!  I stopped in for a quick break from running errands and bought","useful":0,"cool":0},"E5khVxsqsYFmghSZJeAVUA":{"text":"This place is amazing. They have the best almond croissants I've tasted (with the yummy fi","useful":0,"cool":0},"SGwD2OODeEcuwRy9ZF-IZQ":{"text":"Their petit fours are divine. The prices are a little on the high side but still a nice li","useful":2,"cool":0},"SqtgJpc619_KXjkRNPUQBA":{"text":"I feel like I shouldn't leak the neighborhood secret, but this place has the world's best ","useful":5,"cool":1},"NhReqIM_2Jly_lioLbquew":{"text":"I want to marry their almond croissants!!!!\n\nHonestly, I haven't been to France, but I ima","useful":0,"cool":0},"pvohFX3nC_z4uDERU5JPfQ":{"text":"Yowser, I had Googled O'Delice's for the best red velvet cake in Nola and they lived up to","useful":1,"cool":0},"fUjY37icWUTq5t6mcvydRg":{"text":"Wow! This is absolutely a charming place.  It's in a house, parking in the back or mainly ","useful":3,"cool":1},"Pc3yvyo83IMxf99eqOZyXA":{"text":"O'Delice has simply put the best king cake in New Orleans. Stays fresh for days, very stro","useful":1,"cool":0},"1irOjeVwBAxx8xKNQzZ5pQ":{"text":"TERRIBLE customer service, very overpriced! We went there this morning to get a few croiss","useful":2,"cool":0},"VjVI9NWMinCjcY1XiRyDeA":{"text":"This is my go-to bakery. Have deeelicious cakes and cookies. The lady is always very there","useful":0,"cool":0},"AjwqgmLrwN7oNRYD_u0G0Q":{"text":"Not great, not awful. Got a chicken salad croissant sandwich and it was somewhat disappoin","useful":0,"cool":0},"zcbS9eYGVJpY2_hRuR74ZA":{"text":"This is a small French Bakery owned by a Vietnamese family. The cakes are super delish and","useful":1,"cool":0},"60s2FSPhvxqQZhJntfIh6g":{"text":"The best in New Orleans. The cakes are beautifully made and are so tasty and delicious and","useful":1,"cool":0},"rG9VOPg_ijsuqz64Dz-ymA":{"text":"Even though its a French style pastry/ cake/ sweet shop, I'm there for the croissant sandw","useful":0,"cool":0},"UUANkDsa_VesrF8E03223g":{"text":"Delicious pastries, darling neighborhood. We were in a pinch and the owner helped us out w","useful":1,"cool":0},"hDKxiwb93UBOzLKIm9m6kw":{"text":"If you somehow find yourself in need of a custom birthday cake, prepared on short notice, ","useful":2,"cool":2},"vTNdRrjvEWI9bv7QqYB7SQ":{"text":"Received rave reviews on a fondant cake made here! Beautiful and tasty! The best fondant I","useful":3,"cool":0},"IFUltYjqK7IwNMNBcpLXOg":{"text":"I got the almond buttercream cake, and it was the best cake I have ever had. I brought it ","useful":0,"cool":0},"u22RP4koqQbH5wmkdHhCCg":{"text":"Flaky croissants.  Delicious!  In the heat and humidity of NOLA in June its amazing that t","useful":1,"cool":0},"Zhd26bEzopI-sFNo6GbY1g":{"text":"A situation regarding this place still annoys me and what better place to express my displ","useful":7,"cool":0},"MVMyU3UYSXWpynQ9RxbCNw":{"text":"I picked up a cake for a friend's birthday and we were all in agreement that this is one o","useful":0,"cool":0},"zT3cZFDp1j9y-AAQuHR_XQ":{"text":"Someone recommended this bakery to me on a Saturday night. I needed a cake by Sunday after","useful":0,"cool":0},"wNDbgbNc_FRC3zH58qJ-lA":{"text":"Cute small place with a very sweet owner! I got the ham and cheese croissant, which was si","useful":0,"cool":0},"P5E9TQQS5_uTRd_RZ2jGZw":{"text":"She never fails with her red velvet cakes. It's on the simplicity side with her design but","useful":1,"cool":0},"Wmb_Ag-ZyOhkmgdZUEjkXg":{"text":"The cakes look absolutely gorgeous.  I want one.  Or five.  And my birthday is coming.\n\nBu","useful":6,"cool":2},"XIdDYz9bSS0mHkBfVW3WIg":{"text":"I see that Alma D wrote  \"Amazing, amazing, amazing!! the best almond croissant ever!!!! c","useful":2,"cool":0},"OhzpMG9xRkhvzyM3vsXv9A":{"text":"Owner is very sweet. Bought a strawberry shortcake for my boss on her birthday. Everybody ","useful":1,"cool":0},"xv8zJ6n9K2DfXjvR-MMNYQ":{"text":"What I love:\n-the ability to purchase small, 2-4 bite, cakes in about 6 different flavors\n","useful":5,"cool":0},"7EijUCuHyIe6vQtSd-EDnA":{"text":"Went yesterday to get coffee and a crescent. The coffee was ordinary cheap tasting coffee ","useful":0,"cool":0},"iSnSGrkL_h2sVNt3r58DZQ":{"text":"Amazing amazing amazing!!!The BEST almond croissant EVER!!!!- crack almond croissant!!!","useful":0,"cool":0},"PVk1elj4XFv0sO3SjY6McA":{"text":"That's great that you're on summer vacation!! \n\nIt would be thoughtful if you could post t","useful":0,"cool":0},"KsdInLF6FDwR0XFmWKUE7g":{"text":"This is a good place to stop by for King Cake. They have the best King Cake ever! Try one ","useful":1,"cool":0},"Wi8MbkEVsBMafF3wXTLUbQ":{"text":"This is the second year in a row that I have ordered my mother-in-law's birthday cake from","useful":1,"cool":1},"tuw9qxuDovU1GFGszOVotw":{"text":"This place is a perfect little neighborhood bakery. Lots of choices, but my hands down fav","useful":2,"cool":1},"5k3yJ4hO47kPyHIjZ033Yw":{"text":"Shari V and I tried this place out for lunch.  Not a huge menu but we knew they had a few ","useful":12,"cool":9},"-RwoVAmLtODu-fk6rx1OGQ":{"text":"This review is solely based on a cake that my sister ordered for my husband's birthday din","useful":2,"cool":0},"Js9lL1LY8reFybazR5iXOw":{"text":"I LOVE this bakery. It's fabulously delicious, unique, and there are beautiful creations o","useful":0,"cool":0},"hwFBSIBBxXWSNAg9hvHmmg":{"text":"This is absolutely one of the best bakery's in New Orleans.  The cakes are good and the st","useful":2,"cool":0},"F2ETuiqRm29GWLT4YCYEKA":{"text":"We have been regulars since they had first opened for a reason. They provide excellent cus","useful":2,"cool":1},"CLVqmf4kFlfucrv9aQW83g":{"text":"I lived in New Orleans for 5 years after originally coming to volunteer post-Katrina. Ther","useful":1,"cool":0},"gkVkruv4-9ogin2UQxafHw":{"text":"On a whim, I ordered a cake from here for a baby shower only because I was worried I would","useful":1,"cool":0},"lJOl6liOqE3zmsBgJVIu4Q":{"text":"Love the cakes especially the German chocolate cake. It's like coconut with chocolate. If ","useful":1,"cool":0},"d0eCpkxAdKR94DaDjdfXEw":{"text":"This is a hidden gem of a bakery. It is run by a Vietnamese family, who make the best almo","useful":0,"cool":0},"35zGwrbMyOidHCDWoPvkUA":{"text":"This place is a delight! We got small cake pieces, and talk about light and fluffy! The co","useful":1,"cool":0},"D-8PS6bzTKhrt9CnYeEfqA":{"text":"Almond croissants are heavy and overly sweet: they're frosted! There is no balance to the ","useful":0,"cool":0},"bHXZC8D66HYmKx5K0SOhzg":{"text":"This review is solely based on the king cake we ordered for Mardis Gras.  I tried a number","useful":2,"cool":1},"kC-5iEuPcI73pk6iZoCcSA":{"text":"I was looking for a good dessert to take as a gift to a dinner party and a friend recommen","useful":2,"cool":0},"NebWZ5Wd7Dc3KHNn6eHwuw":{"text":"Oh my.\n\nYesterday the secretary bought a cake to celebrate the month of March birthdays.  ","useful":3,"cool":0},"JOQKNTX4_RpElkL784PGrg":{"text":"Nancy is a goddess.  I don't mean this is the way people usually mean, like \"Etta James is","useful":2,"cool":0},"ergxX5RhX6LUB4t43vt3xA":{"text":"My go to place for custom cakes uptown. Made with care and it always impresses everyone wh","useful":0,"cool":0},"Vj39kDWjcItwHaM7N2wZYA":{"text":"Awesome bakery store! Always my best birthday cake store ever!!!\nThank you for opening thi","useful":0,"cool":0},"-Mu8do8Ph4DVlIAFzi4XgQ":{"text":"Worked close by this bakery a few years back. Former coworkers recommended the strawberry ","useful":0,"cool":0},"Etwd44EnY-Oe94FyA4sYxQ":{"text":"Ordering cakes here is so easy. I usually call at least a week in advance, but my most rec","useful":12,"cool":10},"m8O7nExBYTDE_QtmlZ5LGQ":{"text":"Great little bakery. They have amazing fruit tarts and croissants.","useful":2,"cool":0},"kmxG3ZdP5kKmh7F3p7URnQ":{"text":"After dessert laden breakfast at Court of the Two Sisters, my company and I decided to stu","useful":3,"cool":0},"xjynoMRNtVOMpsj3RHLsOA":{"text":"Oh my. We live by the lakefront and this amazing bakery is on Magazine. Worth every stopli","useful":0,"cool":0},"N2Dc-AM-lcYFk3xbspIeGw":{"text":"So I have never understood why this place has good yelp reviews. Since it is by my house, ","useful":0,"cool":0},"wSo2W0NRDkMPoGId5gdYrw":{"text":"I have lived around the corner from this bakery for years and have marveled at the good re","useful":0,"cool":0},"Uh6YChmTnKQiW7SQru0F2A":{"text":"The chocolate mousse cake is to die for!  The \"frosting\" is really thick, rich, gooey fudg","useful":3,"cool":0},"HIJ9I8jzc8K0_1Izv3qvQQ":{"text":"So... NOT open. No posted hours. Are they late this morning? Closed for vacation? Permanen","useful":0,"cool":0},"4S2xrlSyPpaIt2H1o2GlHw":{"text":"Delicious local bakery, such a gem for those who live in the neighborhood. Their croissant","useful":1,"cool":0},"UZT7OPn61fnDHD0skK1xoA":{"text":"Stopped in on a Sunday morning. No line...is this a tucked away treasure? I had heard O'De","useful":3,"cool":2},"Th8gkTciNNa6bTiKwkYwEg":{"text":"The 4 chocolate eclairs were old, stale,and worst of all the pudding filling was Sour and ","useful":1,"cool":0},"bMCcsdpKtK0NEqgwc2ha8w":{"text":"I was gifted a box of their Almond Croissants a couple of weeks ago for my birthday and I ","useful":0,"cool":0},"sDWMTLbjoewUPgQqeiej-w":{"text":"I ordered this year's birthday from O'Delice. Great customer service and no hassle with or","useful":8,"cool":5},"fZzX2HlmihCgQFeJeTpwow":{"text":"We heard the King Cakes were soo soo good they were to LIVE for!! And yes!! They are! Oh M","useful":2,"cool":2},"3H4CVzovx7umGp-1CR63kQ":{"text":"Substitute for the now subpar La Boulangerie.  I'm all over it.  \n\nThe lemon tart I had th","useful":4,"cool":3},"2fKzOkfZAxfPVE1gCUSYnw":{"text":"If you prefer traditional cakes with buttercream frosting then this bakery is right up you","useful":4,"cool":0},"1XHts3dmrN1w2h8TKqYyXg":{"text":"My friend and I stopped here for dessert. The prices are amazing! I got a tasty eclair and","useful":3,"cool":4},"Y-HelEIgRqW_6KVTAeCBbQ":{"text":"I could write an ode or sonnet praising the O'Delice almond croissant.  They run out quick","useful":0,"cool":0},"f7KMYtFJL0Vo-IYGNcw6Cg":{"text":"I used to live across the street from this place, and it was dangerous. I ate so many pies","useful":3,"cool":0},"0tCT4M-r5_zC1KCXEgk5xA":{"text":"I just want to thank you guys for hooking me up last minute.  I forgot my sister's birthda","useful":3,"cool":2},"sU8cGLep1B4XheUFP7A3vg":{"text":"Nancy, you delivered again with another beautiful spread. This cake was designed for my ba","useful":1,"cool":6},"teEW5Kl1OyH5sHFYrtC-xA":{"text":"I live in Slidell, but head to this bakery whenever I am uptown. It is owned by the nicest","useful":2,"cool":1}}