{"g_yALOQsfkrsZ3xT_5u_kw":{"text":"Sexy space, hipster crowd, cute appetizers, and fancy cocktails. But some of those fancy c","useful":3,"cool":3},"TaTwwcb0pp4rvMO5POAsYA":{"text":"Love this place! The decor and overall ambiance is so sexy and cool.  It's very reminiscen","useful":2,"cool":1},"P1ZnMqFsZaI7GE8iir4IjQ":{"text":"Stellar service from extremely knowledgable bartender and terrific drinks. What else is th","useful":0,"cool":1},"ol_7GSDceOlHBlzBGpb7Mw":{"text":"Solid cocktail bar.  We took a cab to Freret to have pre-Cochon cocktails, only to arrive ","useful":1,"cool":0},"lw7zFCpXhT2mvKTMO1lKKQ":{"text":"There are some people who might say that this bar is for obnoxious hipsters. There are oth","useful":8,"cool":3},"jxY1ck6kAb0ElsTb7gvd4Q":{"text":"Cure is not my kind of place. I've actually visited it three times but only once actually ","useful":4,"cool":1},"FMfbYIk5F0__k5_HWmwmSQ":{"text":"The place is gorgeous. The cocktails are fabulous. Most of the people there on Sunday nigh","useful":0,"cool":0},"E7bqt6Xg5jEtMSMumRbpBg":{"text":"Food was lovely and drinks excellent. Unfortunately it was FREEZING. My two friends and I ","useful":0,"cool":0},"X6_8w2HVbgssOjywtKs2TA":{"text":"Cure is just great and judging by the crowd it is no secret that it's open. The Ambiance i","useful":0,"cool":1},"fWoRIs2QvNHDsvGzwCeu5g":{"text":"My favorite wine bar in New Orleans. Thursday is 40% off of wine bottles which attracts me","useful":0,"cool":0},"bB_RMYWGnkfsp6AtWVl-2w":{"text":"Great cocktails, but they know it and will make you pay dearly for them. If you manage to ","useful":0,"cool":0},"P2O3O76Cdza_9lgT1zLC9A":{"text":"I may be crucified for this but, deep breath, here goes...\nIt is OK to be surly to your cu","useful":9,"cool":1},"xW6erxQLiG__dq3fDABrHA":{"text":"Congrats Cure on wining James Bears Award for best bar program! That itself says a lot. Th","useful":0,"cool":0},"31dwLS-xzqmT169vGL8stA":{"text":"WOW ... Discrete little bar in a beautifully restored old fire station in the up and comin","useful":0,"cool":0},"QofgVerv_gKMLwQFePzOEA":{"text":"Maybe three stars is a little harsh, but it's been my experience that they're hardly hurti","useful":1,"cool":1},"lp67B40EaxyF-bdxpSiGfQ":{"text":"5 stars to this amazing cocktail bar. A James Beard award winner for Best Bar Program is w","useful":0,"cool":0},"_XzVYjhtW2B9iPhmhnnYEw":{"text":"Pretty sure this is my favorite spot in New Orleans. It reminds me a lot of my favorite ba","useful":0,"cool":0},"CZm9OiCpOfWUdWwO_ibycg":{"text":"I had been to Cure once before, but since I'm not usually a cocktail drinker, I wasn't imp","useful":8,"cool":2},"cx5XN9AzyclBMlXqZOwIrQ":{"text":"One of the best places for drinks in NOLA, good small plates. Great place and great servic","useful":0,"cool":0},"O-w4sdLpBOxRmjXu9IN7Hg":{"text":"I like coming to this place and try to go every now and then.  The mixed drinks are very d","useful":1,"cool":0},"XlsIRHcMV7Ah2D33YsFGvQ":{"text":"I've always wanted to grab drinks here. Finally went with a friend the other night. As you","useful":1,"cool":0},"yQPBI-S_S8uMgjB7avlxzQ":{"text":"Reminds me of a contemporary twist on an 1890's gentlemen's tavern - very cool ambiance.  ","useful":1,"cool":0},"bnx5vMb5x_pY5JTtg1QNGg":{"text":"Better when it's not packed.  Bartenders can work magic.  Great for date night or a night ","useful":0,"cool":0},"E3C5RodnoGobV35KH1T2-w":{"text":"They make a fine cocktail at Cure.  And trust the bartender's recommendations. $6 classic ","useful":0,"cool":0},"EUPvl6rJBPwcc57h4zTkHw":{"text":"It doesn't take much at all for a \"mixologist\" to transform into \"just a pretentious barte","useful":2,"cool":4},"H6ygFpar9XlHrnl9KLvWZg":{"text":"I researched Cure before I came NOLA and was eagerly awaiting their cocktails! I am so hap","useful":1,"cool":1},"QOPWBLZu0O3DVov0MCFkhg":{"text":"Amazing drinks!!!! Amazing vibe... no drunk tourists; just a classy bar with the cool week","useful":1,"cool":0},"Rzrrt2DS8A2PRBzBdyxP9Q":{"text":"I really liked this place... It's very modern & the drink choices are very good too! Nice ","useful":0,"cool":0},"S24qvVzFBFy4eQPfQzRJfQ":{"text":"Stopped by here one slow Wednesday night.  Had never heard of the place before, was not ex","useful":0,"cool":0},"Jcfz7LvYW0-zRRTO52B-1g":{"text":"Not sure why this is only our first visit here but it was. Don't think it'll be our last t","useful":3,"cool":2},"2N_hJ9p-ohjtfUhH3X8r2A":{"text":"After a stop at Company Burger around the corner, we walked over to Cure for drinks. It wa","useful":1,"cool":0},"79xQlODNXM7Y1tvEhDgtYQ":{"text":"I guess I enjoy the concept of Cure...\n\n\" Inspired by the historical period when cocktails","useful":1,"cool":1},"0RllfNs9wQH_tdnWFtAfNw":{"text":"Definite must do while in Nola!  Loved this Bar.  Drinks were very good.  Atmosphere was s","useful":2,"cool":1},"u51dWrfA9Ic24uXtClT8MQ":{"text":"Nice atmosphere, kind of rude bartenders and by comparison to the signature drinks at othe","useful":1,"cool":0},"I9lRJ_xycvGyRR1ZPycRiA":{"text":"Absolutely adore Cure!  I came here during happy hour for their $5.50 selected cocktails a","useful":2,"cool":0},"kOuSQ7aXWlSG6sZVC5uGEQ":{"text":"Dropped in for Happy Hour; \nM-Th 5-7 Fri-Sun 3-7\nYes! Weekend Happy Hour!!!\nCool vibe and ","useful":1,"cool":1},"WwL1ZU0XJg5D9XB-ur6Zxg":{"text":"If there's a better bar in New Orleans, it's hiding under a rock or a password protected d","useful":1,"cool":0},"Z33oGv2IMuxDfvPI5YjM3Q":{"text":"Went here with a group for a pre-dinner cocktail right when it opened. We had the patio al","useful":0,"cool":0},"7iVHJFqSnLwwSq-ZMJkUjQ":{"text":"Great Ambiance and service.  I usually go for happy hour which is 5-7.  During that time d","useful":0,"cool":0},"-dnfEnRsBe4OTOR-9qu73Q":{"text":"I heard some negative things about Cure, so I stayed away for a long time. The chief compl","useful":3,"cool":1},"uV44Wvr39TKOJ-BpScWfAg":{"text":"I ain't a big fan of alcohol and mixed drinks. If I'm gonna do it, I'm gonna do right with","useful":0,"cool":0},"F9ZuLwxUR7zB2CLIhk8WdQ":{"text":"Cure is the epitome of Hipster bar. Logo is a cockroach and the ambince has classy music, ","useful":0,"cool":0},"V9OEIRSjS0srZminsa3wtw":{"text":"Great atmosphere!! Extensive drink selection and very reasonably priced. If its nice out I","useful":1,"cool":1},"2nJjZwHvdLeQKswQ5NF3MA":{"text":"Cure is far from what I would consider a \"New Orleans\" bar. In a city littered with dive b","useful":4,"cool":2},"duX5v_mPouXHOF3cx9953w":{"text":"Cure was our other favorite cocktail bar in Nola. The bar itself was crowded, but we wande","useful":1,"cool":1},"CkqA60dPriFUmtWaF6y54A":{"text":"One thing that I immediately noticed with I moved to New Orleans back in 2009, is that mos","useful":1,"cool":0},"PuPMx7LDMyUXvjh3IQOBYw":{"text":"l0ve love love this place... ask for andrew, he's the man...","useful":0,"cool":0},"I9K88LMcR6TRcX4NvfIMZA":{"text":"I love the happy hour at Cure which features select cocktails for $6. I personally love th","useful":2,"cool":0},"QjafANQG9LvtnMnY2K_53Q":{"text":"One of the best bars not only in the city but the country!\n\nSpace is slick and modern, bar","useful":3,"cool":2},"OaLkOVHmlpZ_H-qMHinA5w":{"text":"FANTASTIC happy hour deals from 3-7pm! Classic cocktails for $6 - and I'm talking negroni,","useful":1,"cool":1},"LWUHdns36KZQLUhyiLnJ3g":{"text":"The best cocktails in New Orleans. The atmosphere is lovely and they have a great happy ho","useful":0,"cool":0},"J3iaPwMKgpZB-xy0V6Ka5g":{"text":"An excellent place for happy hour specials and a relaxing atmosphere with well made cockta","useful":0,"cool":0},"h4HEnQwwIaSgRgjqbf5TVw":{"text":"We came on the recommendation of NOLA Eater. It's a tucked away bar in a developing neighb","useful":2,"cool":2},"DzjNbxn39dvCF0uyxsP60g":{"text":"Cool vibe and very trendy. Kind of inside. Not very comfy seating. Would go back. Costs mo","useful":0,"cool":0},"cU3vR0N3-1urDg2t9XH_yQ":{"text":"Cure has the most helpful, the most knowledgeable and the most talented bartenders of all ","useful":0,"cool":0},"OPN8izBiSPZsNfrkNtFQqw":{"text":"Very cool setting and vibe.\nIncredible selection of liquor!\nOur waitress was very attentiv","useful":0,"cool":0},"wBkNwmT4hzXxvGB-58flIA":{"text":"I've been to this bar twice lately and enjoyed it both times. The atmosphere is elegant. I","useful":0,"cool":0},"FgHStoDl5R1VKlN5u1N36w":{"text":"Late Friday night, during girlfriends/law school buddies reunion weekend, we decided to gr","useful":0,"cool":1},"U7tS5Tb4Jg3wfA77OTJsuQ":{"text":"Sometimes you just want to sit in a dump, have a beer or 10, and munch on fries covered in","useful":7,"cool":6},"uJK5cmbNWfOvxx8LzPyNOw":{"text":"Beautiful decor.  Extremely extensive list, very knowledgable bartenders.  Wonderful servi","useful":0,"cool":0},"xzIpjvGxJvrWvxikkPxF8w":{"text":"4/5 like home\n\nfirst, congrats on your gallivant feature: http://gallivant.com/sip/cure/\n\n","useful":1,"cool":0},"Zh1JlWfg8eI6TOB05HME1g":{"text":"I need to update my review since I want to add it to my list of great places to get cheese","useful":1,"cool":1},"oMvqzdbi9jUbgCwGcTdp6w":{"text":"We just happened into Cure halfway through their happy hour, and they have a very good hap","useful":1,"cool":1},"hnUN00N7YmdhApnbVm0wkw":{"text":"I have heard rave reviews about the food and drinks here, but I was not so impressed. I th","useful":4,"cool":2},"XAcbe705jIY86mBnLRj4xA":{"text":"Where. Do. I. Begin.\n\nMake the trip, plan ahead, and go. \n\nThis bar is perhaps one of the ","useful":1,"cool":0},"wgz_z8KP6Qpk16XP5z-p1w":{"text":"We love their drinks. The portions are too expensive for the size. I'm not cheap - but you","useful":1,"cool":0},"pih0Ql0yOcVbLUI9eovGIA":{"text":"I can't say anything here that hasn't already been said. The place is lovely, low-key, a l","useful":0,"cool":1},"IkE1QtjYA6xq3pQov9SZfA":{"text":"Absolutely amazing!  Well worth the cab fare to get to this upscale cocktail bar.  I recom","useful":1,"cool":2},"zMDJlNGjW3bnDujxSwZCwg":{"text":"If you are looking for a bar carries great variety of whisky and scotch, this is definitel","useful":3,"cool":2},"CU37zJFa1Aj8cJFnbjHvvg":{"text":"Wow... I have my favorite drink, I have had it perfect and I've had horribles. I have had ","useful":1,"cool":0},"UWM3iivr0oNXStLGZkKIiw":{"text":"I was tipped off to this place through a friend of mine from St. Louis (I understand the p","useful":1,"cool":2},"ytvLPlK886rqr9UeoAyhBA":{"text":"LOVE this bar for a late-night gathering. The mixed drinks are good and it has a great env","useful":0,"cool":0},"hTcs66WSqZYW026d9rIkJA":{"text":"This is an update for Cure. I think my first trip was so great due to the wine I had befor","useful":3,"cool":1},"tQ4BvfeMV1cHSn8nfDupkw":{"text":"It is no easy task to become rated the #1 bar (out of 50) by local publication Gambit in t","useful":2,"cool":0},"M6qd0nRWU3X_uBVhVGgV5Q":{"text":"awesome place for a fun time and good drinks","useful":0,"cool":0},"A6MckV_hzb3vkzXnTkMHIw":{"text":"Great bar. Great vibe. Great drinks. Can't go wrong here.  Of all the bars I've been to th","useful":1,"cool":1},"x40fgQClE3GxcfadfDdp6Q":{"text":"A select happy hour menu with both cocktails and small bites. Their patio is spacious! Alw","useful":0,"cool":0},"B1SU58xkD_2lIOgtU1sPhA":{"text":"Other bars have a thing or two to learn from Cure. \n\nFirst, the bar is well-appointed, ins","useful":1,"cool":0},"cQAN10adJNk9amDiCx7ZTQ":{"text":"Cure isn't just one of my favorite bars in New Orleans; it's one of my favorite bars anywh","useful":2,"cool":2},"9OCyd88us4pWFlIPjZVoTw":{"text":"The staff is very knowledgeable and nice. The cocktails are just to die for. This is one o","useful":0,"cool":0},"XnxZ4KX8jvksgFQ3ZLRuug":{"text":"After a big meal at Mr. Johns, a group of us were looking for a good place to wind down th","useful":0,"cool":0},"rBO9rF7N06Xz0L4ii3rBsA":{"text":"The staff is not my favorite here-- I've been many times and can always sense a major diff","useful":0,"cool":0},"UgfYCAzUisGs2t1whBLRWw":{"text":"I have bartended for 8 years now, and I am still blown away by the concoctions that these ","useful":1,"cool":0},"Xue_0kOnQvHdimbRCzj4zQ":{"text":"Bars these days man. I miss the good ole days in this town. Days when bartenders drank whi","useful":5,"cool":5},"z6fB2UPUoIKtq88yIA6exQ":{"text":"We arrived on a casual Monday evening, and was welcomed by Hannah. We were ready to enjoy ","useful":1,"cool":0},"EtbgjAVQBeCvLxD0aFhdFw":{"text":"Love Cure! One of my favorite places to go, not only are the drinks top notch, but food is","useful":0,"cool":0},"vMHTGpC2wzBLDlyY6JuS5g":{"text":"Several of us tried to go to Cure tonight for a late night bite and cocktail. We were stun","useful":1,"cool":1},"6PkxgdhBFgfWsW51U9kPpQ":{"text":"Located away from the hustle and bustle of Bourbon Street is a classy bar and one of my fa","useful":2,"cool":2},"S-qcoDqC-WTOzl23vbX0pg":{"text":"I have been to Cure 4 times now and each time it scratches a cocktail itch that other plac","useful":1,"cool":0},"9ABk6d-9ff6-ym9SVpGa7g":{"text":"Great gin martini. After having a three cheese plate, all the cheese I normally eat now ta","useful":0,"cool":0},"3DGRbX7x3HhwnAkbc4DAmQ":{"text":"Recently revisited this bar and I forgot how much I like this place! Reminds me of Restora","useful":0,"cool":0},"-tzi3djU0WUd_128UNCf9Q":{"text":"Tried the happy hour appetizer trio - all are really good - really enjoyed the olives, if ","useful":0,"cool":0},"w1JAZJTlwqForXWMbkz7Ug":{"text":"Picture an episode of Sprockets on SNL. Then make them into bartenders. That's Cure. \n\nYou","useful":0,"cool":0},"Qb6u92cBBuDW93zTRfQpAA":{"text":"Really rude and unfriendly staff!! Overpriced and snobby place. They don't even allow dogs","useful":1,"cool":0},"HhtnsdYiNFKVmVSu-fK8-A":{"text":"I adore this place!  The staff, the room, the DRINKS, the food... all top-notch.  Nick and","useful":1,"cool":0},"jDKZrix3upzqSdXt79bq7A":{"text":"Aesthetically, it is an attractive bar. An almost unnoticeably plain exterior (the first t","useful":3,"cool":0},"OjqlBaEg7633Eh5JLyg6gw":{"text":"Many pundits call Drink, in Boston, the best cocktail bar in the U.S. -- my office is arou","useful":1,"cool":1},"9mulUKzPgrCUDDrXap-KTA":{"text":"Love the ambience and interior. They serve very unique cocktails. It was decently packed o","useful":1,"cool":0},"knYBOxwHAH1-kZFzQJLw7g":{"text":"Legit cocktails in New Orleans. Cool vibe, friendly bartenders, and really great drinks.","useful":1,"cool":0},"zPB4K0qYjsbEtRvgEsXghg":{"text":"This place was really good! The setting was nice and romantic, dark, but not too dark. The","useful":0,"cool":0},"VRv5KhLEdW9UEfV69Mro9w":{"text":"Such a cool bar! The bartenders were amazing and gave a great selection of cocktails not f","useful":0,"cool":0},"-HwbtW0g48NLl9byNdoPhA":{"text":"Really cool bar I didn't expect to find in New Orleans.  In fact, it reminded me a lot of ","useful":2,"cool":1},"Ivq1jn9XvmvLrUtq7TSkIg":{"text":"Worth the search! I don't know about tomorrow but as of today, CURE is the best mixology b","useful":0,"cool":0},"V42YQbQCMZbFbgguqaP5QQ":{"text":"Took quite a long time to print out receipt when we had a show across the street, but asid","useful":1,"cool":0},"QO1GNp1yJ9TSsEFUIzX0mw":{"text":"Almost fifteen years ago, I discoverred the Pegu Club in NYC, then PDT, Drink in Boston, a","useful":2,"cool":1},"ngZj_HbjkPn9TwCXTU_HQg":{"text":"Wonderful bar. I wish it was open earlier in the day just because I would go there more of","useful":0,"cool":0},"2gajJ4bWqFJ7R9jd3_rf_Q":{"text":"Great staff and sexy atmosphere. Cocktails were.... meh... Depends on what you're looking ","useful":2,"cool":0},"B2Y6aToZF46yxZWb2AlqJA":{"text":"A long overdue appraisal of one of my favorite places in the city. Cure opened my eyes to ","useful":0,"cool":0},"JIT_US8oNQ8TDWFXrrbH2w":{"text":"This is not only one of the best craft cocktail bars in the US but it's started the whole ","useful":0,"cool":1},"vw9Paz_1qQ71_h2dSjCS-w":{"text":"Very cool place.  As Celeste L. said, it was very SF.  The interior is really nice, very w","useful":0,"cool":2},"ZxYPznzYTgBE23dJmzPtGA":{"text":"Went here for Happy Hour drinks after hearing great things about the place and it did not ","useful":1,"cool":2},"cfupbwKZY3UljeGkxRQnNA":{"text":"It was Tuesday at 9 pm (time on our tab 9:02) when we came in. It was Tuesday at 9:30 pm w","useful":1,"cool":1},"mPXMl_Bb8f6FEO4gC2vIXw":{"text":"Really gorgeous spot, high end craft cocktails.  Service was a little spotty, but we had a","useful":0,"cool":0},"t4drEfAlziW7A7tDEUjfTg":{"text":"Beautiful bar on a nowhere street with slow, languid service.  The drinks are well made an","useful":4,"cool":10},"ElhVT_g1G9ZLNrwQz8MlQw":{"text":"A fan of the craft cocktail. If you get intimidated by a lengthy drink description and ing","useful":0,"cool":0},"8oVfz0eLDKYJqWHZj4Dhvw":{"text":"I'll admit, I have been avoiding Cure from the beginning, as it seemed like an uptight, ov","useful":3,"cool":2},"A4rfSMhWg6jmmmeyoDGjTw":{"text":"NOLA. Your culture, food and cocktails can make the best of folks backslide. \n\nUnique liba","useful":4,"cool":2},"hmxJuw8TA_Xv9o8NCn-2iw":{"text":"Great place. Very classy and it's won a few James Beard awards too.  The staff respected m","useful":0,"cool":0},"G1tsalUZXbc5UWEUV_lupA":{"text":"Love this bar. It's upscale and low key. Nice for first date impressions. They have an ori","useful":1,"cool":0},"BZ1B_vEXjcvyfQ8UkAbOhA":{"text":"Best La Palomas in the city. No one else seems to know how to make them properly. Great ch","useful":0,"cool":0},"qAhk-0LwPo_q3BReVAWSFQ":{"text":"Eclectic ambiance. Great selection of drinks. Not overly crowded which is perfect for thos","useful":0,"cool":0},"DYKiyw8DeHqSS3VFzfQ0nQ":{"text":"This is the best cocktail/mixology bar in town!!!\n\nBest part about this lounge is that it ","useful":2,"cool":0},"FWjFGaPegf6KRUu0zMZl3w":{"text":"Aesthetically, it is a great bar.  Problem is that I just felt like my jeans were not tigh","useful":3,"cool":0},"PvEk2peZ5SaUVsFM6OMReQ":{"text":"If you're a cocktail person, you gotta go here! Awesome selection, interesting combination","useful":1,"cool":0},"OpbtThpKQxw6_fbbHqHzMQ":{"text":"I am so impressed with Cure, it makes me want to move to New Orleans and drink delightfull","useful":1,"cool":0},"HhEJ-nNgsxWQ0rAtIJcgyA":{"text":"I visited Cure with my husband on a Tuesday night, and we had a nice time. Our bartender R","useful":0,"cool":1},"SyXlEjGYsbAnrJMjR-Jz_g":{"text":"We went here on a Tuesday night and got the last seats at the bar so it was surprisingly b","useful":1,"cool":0},"AMii1ugML4fqAgofALXnWg":{"text":"If you're feeling trendy, this is the place to go. You'll get hand-crafted cocktails that ","useful":1,"cool":1},"Nr2fuHWvDkiiC-ivWVPaCQ":{"text":"If you like whiskeys, they have a ton. Like a TON.\n\nBig booths inside as well as an outdoo","useful":2,"cool":2},"0KQqq4GRpqT2bdhejVinsQ":{"text":"If you are looking for inventive cocktails this is the place to find them! I am not a huge","useful":0,"cool":0},"hBdwh-bHZ2DRpuY8vN-ybQ":{"text":"Really enjoyed my meal and drinks and food here. Made a special trip from Baton Rouge just","useful":1,"cool":1},"n7Vjn2jRg0yr1BnVunSthg":{"text":"One of the more sophisticated bars in New Orleans. The crowd varies from upperclassmen fro","useful":0,"cool":0},"wpCMNSOPFvMtMThHH9ZynA":{"text":"Matt is amazing! I can't say enough good things, every drink I had was perfectly and strat","useful":1,"cool":1},"hixHNKlbZ82U6EvSWwZs_g":{"text":"Total duche bag bar manager acted like he owned the bar. Typical 1st round manager. Kicked","useful":1,"cool":0},"-Cd_YzJWfOR72mKWzJSl4A":{"text":"Cure is a fantastic little bar on Freret Street. Accommodating those spanning from a matur","useful":4,"cool":4},"Dnx34-fV0YPu4ZP8wls_Tw":{"text":"If you're a \"mixologist,\" does this mean that you can't serve a god-fearing man in a Snuff","useful":0,"cool":1},"OI6uWwu8GuMniOzPNAkXJw":{"text":"I went here with some friends after dinner on a drizzly Tuesday night and it was a perfect","useful":2,"cool":1},"Ox7PKCow_uaJhJChMaNT1g":{"text":"cool interior and atmosphere - - lots of it.\nGreat bartender (Ryan), knowledgeable, smart,","useful":0,"cool":1},"2yXAMeI5L-uRi0P28Munvg":{"text":"Great service, amazing drinking! Reminds me of a San Diego bar at night. \n\nStop reading an","useful":0,"cool":0},"Wz1KTWIagbRaopgZ4ozANA":{"text":"This seems to be a local, neighborhood-y place that we can say serves great cocktails and ","useful":1,"cool":1},"0JhXB3ZowRtPHlK-tL1hLA":{"text":"We had a bunch of people and moved a table to accommodate a few more coming. Our waitress ","useful":0,"cool":0},"miW6YmIChO4tPyxWoXjw1Q":{"text":"Very nice bar that both invokes a sense of modernity and nostalgia at the same time. The a","useful":1,"cool":0},"p0_MsN6oFqcVNb5BQriLmA":{"text":"This is the bar that sets the standard I have held every other drinking establishment agai","useful":2,"cool":2},"7iMRf_9JfwMwJDHP81Jlog":{"text":"Did you know that Cure is not just a cocktail bar, but a restaurant, too? And they're open","useful":5,"cool":3},"wp7Bd13Ww6D5tIArsYM_ig":{"text":"Cure is exactly what you imagine a swanky hip cocktail bar to be. It is not in a touristy ","useful":0,"cool":0},"4XjYBtoKcN13t5bJ07h4tw":{"text":"Stopped in for a cocktail during happy hour, and became notably happier! :) The bartender ","useful":0,"cool":0},"HjKH8gAsrmISK2rJEyrgog":{"text":"Came in on Wednesday night with a few friends and wanted to sit at the bar. Drink menu had","useful":0,"cool":0},"EgAHLD7vy3gkfNlygovMng":{"text":"Yes, I visited this place as a tourist, but I can see why this place has gotten TONS of go","useful":1,"cool":0},"Dh-mcJUuOO7g-OrFeWz4XA":{"text":"This is my neighborhood bar. The margaritas are some of my favorite in the city, although ","useful":1,"cool":0},"O_D-ehX7k2gnCglW7aYwIA":{"text":"Service is super slow even when they aren't busy. But drinks are good. Food is small.","useful":0,"cool":0},"p0xIRXOpN_SdBWhsGrpQ1g":{"text":"New Orleans does many things well; Creole and Cajun (which are apparently not the same thi","useful":5,"cool":3},"mxkggNLAl3rkrZzqafrtoQ":{"text":"I do love me some fancy schmancy cocktails (sorry, John H:) and Cure does 'em up straight ","useful":15,"cool":13},"G6CMKvmBDXU-h2Ck4CPgtA":{"text":"Craft Cocktails, romantic Setting in the backyard patio. The bar Food was a small selectio","useful":0,"cool":0},"T6uS6O9uO5F_Ju4HXx4aIQ":{"text":"The atmosphere at this place is nice.  However, the drinks take a long time and we were lo","useful":0,"cool":0},"KlzvC_VJq7YUE5PSuPR38A":{"text":"Overrated, overpriced, sooooo over this place and I'm only a sip into my first drink. If y","useful":1,"cool":0},"XxI9W9g7dDX9mipY9jzBSA":{"text":"After searching all around on the internet for a spot in New Orleans with a great happy ho","useful":1,"cool":0},"8ZvNvPFuMELSBIAWsdX9vg":{"text":"Cure feels like a neighborhood New York bar with New Orleanian hospitality. Talented barte","useful":0,"cool":0},"My5e2IXpJwZ7B1MNt--7Yw":{"text":"lovvvve this place.....warm and inviting.....cozy yet ultra chic.....great place to meet f","useful":0,"cool":1},"tdz-8EiHKvFb-6nuUMq4cA":{"text":"It was a night in NOLA, and after a recommendation, we dropped by for a nightcap.\n(Happy H","useful":2,"cool":0},"XvkvuG66aJAZ0RGVDL_ERQ":{"text":"Literally the best drink I have ever had in NOLA.  You feel cool just by being there.  The","useful":0,"cool":0},"GrOQuzyq-j7wePA7ypGrqw":{"text":"I love this cocktail bar- outside of the craziness of Frenchman street!\n& I hear they have","useful":0,"cool":0},"6kpVK3Qqdrj903xB6Rsycw":{"text":"omg! i can't begin to tell you how amazing this place is! omg!! there is amazing bartender","useful":0,"cool":0},"XuofKlZAPVaK98EyWyd_Uw":{"text":"Cure is quickly becoming one of my favorite happy hours in the area. There's a good variet","useful":0,"cool":0},"k0RjRbMZG5mz3JLzXQHHCw":{"text":"I have been a customer at Cure for several years. This is \"our\" bar. The staff including t","useful":0,"cool":0},"Th2JirqAbR5XUUTt_tAbJw":{"text":"4 bottle limit of champagne on a 7 top on new years eve? One star. Dont come here. $30 mix","useful":0,"cool":0},"TB1Tg_t9jYaCN4YPFFCPRg":{"text":"Yup. I'm a fan. Drinks are unique which I love. Atmosphere is laid back and sophisticated.","useful":0,"cool":0},"zcG0ouAY0eVqW8eVBxb0eg":{"text":"The drinks at Cure are really, really good. I mean the food is decent, but you come to Cur","useful":0,"cool":0},"bcB873OSahiyONG57m8GBA":{"text":"loved this place! the beer and a shot is great deal and the reverse happy hour is also som","useful":0,"cool":0},"BGIiE5zNxEMS5jTpqcJYRg":{"text":"Wow! I could go on and on about what a fantastic experience we had here. \n\nMy boyfriend an","useful":0,"cool":0},"ZOsH7ZGW_eUP4629DWwkoA":{"text":"Amazing cocktails in a very chic atmosphere.  You are going to find a cocktail to suit any","useful":0,"cool":0},"ZJIdyDICr-VrjnZ656Neiw":{"text":"I went last night with my girl Sarah for the first time and LOVED it. I felt like I was in","useful":0,"cool":0},"Ac6a4FxzJqp4B__L0jPWyg":{"text":"I was pleasantly surprised by Cure. The inside is clean and trendy. The patio is amazing. ","useful":0,"cool":0},"kwfjtmqnw_HSV9cF4dnRbg":{"text":"Cure gets it spot on when it comes to drinks and small plates.\nI celebrated my brithday th","useful":1,"cool":0},"vXxF-ITAW_A5fiyF0QLbrQ":{"text":"Stopped by to check out their cocktails and was underwhelmed .... If you want anything tha","useful":0,"cool":0},"vHYEpxnDXnXggou6Xie5OQ":{"text":"There are plenty shot-and-a-beer and LIIT crapholes in this town. You want to get your Ke$","useful":1,"cool":2},"ddkCqXnJ6iBILOS-nRkHKA":{"text":"Great food, drinks  and great networking opportunities for young professionals in the city","useful":0,"cool":0},"oKgOL4QuVbKctqRMNHEzJw":{"text":"I love artisan cocktails, and this place really takes pride in their offerings. Not only t","useful":0,"cool":0},"z2b8iUV1_Z9dPwtSUVn9nQ":{"text":"Cure has fantastic cocktails, great small bites (seriously, try the pimento toast), and a ","useful":1,"cool":0},"fe0uGgPToLO7RMh3roSZcw":{"text":"Place was a little hard to find due to the lack of proper signage. Bartender was super ina","useful":3,"cool":0},"yi4bjrJGp5EnJiUCSoP6lQ":{"text":"If you are looking for a chill place that has a beautiful bar, extensive cocktail list, an","useful":0,"cool":0},"A3eHc3C9AvVm2cA5OPAFnQ":{"text":"Seeing as how Cure has been reviewed over seventy times already, I feel a little late to t","useful":6,"cool":2},"V0CCYKXK3mTIkMaV_6xAwg":{"text":"Went with a group of 8 and everything ordered was amazing, nothing just \"ok\" or \"pretty go","useful":0,"cool":0},"pYUHD9Rc6_-t2hINuMsGOQ":{"text":"We braved the heat and found an outside table- much quieter and more conducive to a good c","useful":0,"cool":0},"tS2cge9OMYGww-N_cA3pxw":{"text":"Lets be clear- this review is purely about the mixology- no food consumed. \n\nThe rise/rebi","useful":1,"cool":0},"2hWZwooInQ1_d74LK4dmQA":{"text":"What an amazing little gem on Feret.  Don't look for a sign displaying its location. The o","useful":0,"cool":0},"rlLszqrEXDfSYfn-63vv3g":{"text":"Pricey, but as my dad always says \"you get what you pay for\" and that certainly rings true","useful":0,"cool":0},"QXBMoKc-_hJhiIgc8VGlOw":{"text":"Drinks are extremely well done, taste great, and you don't even know they're almost entire","useful":1,"cool":1},"5EtEZQVGpnUcpGMZr2PSDw":{"text":"\"If you have the means I highly recommend it.\"\nVery romantic! Great for dates.\nFabulous de","useful":1,"cool":2},"NI4_kOzk3DvPw4wuJIGLRQ":{"text":"Cure is pretty much my favorite bar.  Cocktails are something you either love with blissfu","useful":1,"cool":1},"Vh2vIexETZRsT6b79h14mg":{"text":"My man Ryan makes the meanest Harvey Wallbanger in town. Possibly in the world. I just rea","useful":0,"cool":0},"GfyETHVN5HOI4j6hbp4z8Q":{"text":"Like authentic, bitters based, artesian cocktails? Go here. Right now. \nClean, modern inte","useful":0,"cool":0},"iBAl2vwl0IeaTzRw2HaCug":{"text":"Finally made it to Cure after a Yelp event last week. We split a bottle of wine for the ta","useful":9,"cool":6},"ql8VUNRNPrgT5jFyLFj9sQ":{"text":"Apparently I blew it on this first trip as since I've been reading that Cure is all about ","useful":2,"cool":1},"A8xHeVS80Yr9MSC40w_Qag":{"text":"On a recent jaunt to New Orleans, a friend recommended Cure so I went. I am usually suspic","useful":1,"cool":0},"BAuzk0WtyrWV-JYFXqA_Lw":{"text":"Fantastic cocktails. Don't be scared by the amount you get, but get ready for a lovely coc","useful":0,"cool":0},"kPVHzw04EUMW7A2U50PKCw":{"text":"Love the craft cocktails here, and the atmosphere/ambience is great! Our waitstaff and ser","useful":0,"cool":0},"sA2RVpj4oGu6TxaJdtqYAA":{"text":"We rented a table for a family event from 5-7pm. The place was understaffed, the waiters w","useful":0,"cool":0},"iwvmAXRyuxojBpuzbnIdow":{"text":"I love love Cure. Expertly crafted cocktails by artisan bartenders in a welcoming setting.","useful":1,"cool":1},"efdGR30Jj69P9SDr170rlg":{"text":"Drinks are a bit expensive but you have to expect that when it comes to best cocktails in ","useful":0,"cool":1},"LtDrwhpq5l5dgKM0t6ksaw":{"text":"I thought the drinks here were good, and happy hour is a great deal. $6 cocktails that are","useful":0,"cool":0},"Ukr8n-bfx4HocYZLW58yQg":{"text":"**Changed my rating to 3 stars, because the owner reached out to me & was very apologetic.","useful":3,"cool":2},"GMudK3k92dkoWRtluN_YPg":{"text":"I came here late on a Sunday evening with my better half and DAMN is it a good way to end ","useful":2,"cool":1},"wIvqDUi5r3f5N4JIMdOyLw":{"text":"Eveyone raves about the patio. Yes, it's great (but only when the weather's nice).  Inside","useful":1,"cool":1},"hoiuTOA0kK0YhZc75oeFNA":{"text":"This is my second time here. Both times, the bartender has been the same. He is great!  Gi","useful":0,"cool":0},"pUvp7LPGtE5rMzSbEYmUfw":{"text":"Delicious drinks, delicious food, and the most ludicrously pretentious service that I've e","useful":3,"cool":1},"O0t29he0jFSlbF3gGe1Mvw":{"text":"Great craft cocktails and small plates!  Chill atmosphere with a great playlist, too. Exce","useful":0,"cool":0},"ULyrzugBZlqrq03zHUz--A":{"text":"I love you, Cure.  I love that you have a note on your website asking your patrons to dres","useful":0,"cool":1},"_rP4WAYq_x2V4vPn0o2tbA":{"text":"The drinks were fabulous. The main motive of going there was because we were American Horr","useful":0,"cool":0},"VOhDZW6LpOHlr6_8L6PY-g":{"text":"Love.\n\nI couldn't leave NOLA without having a well-crafted cocktail and CURE didn't disapp","useful":0,"cool":0},"TRCVE4RfmjxgwBRy9sraPw":{"text":"I feel like Cure is special in New Orleans, but sort of meh to me. Their drinks ARE good. ","useful":2,"cool":0},"3v9UQP8uk0bOnyjYE8Ul0g":{"text":"This was an excellent choice as we were looking for a low key delicious meal. Great drinks","useful":0,"cool":0},"otWpOFOp_b5iWnYEonBUGA":{"text":"I love Cure, because there is an a various amount of drinks that are very well made..the b","useful":0,"cool":0},"IoqWKxdCM2XCz8jMN3_kkg":{"text":"What type of bar has a rule of \"no pants after 10pm\" for men?? It is the middle of the sum","useful":1,"cool":1},"p1-yDSpJQkqfSt85GwSBvQ":{"text":"Cure has extremely high quality cocktails.  Sure the drinks are expensive, but they're usu","useful":0,"cool":0},"EfX9wqUI3xBf7RJ_XOufYA":{"text":"Cocktails were excellent and well executed. The country ham plate was large enough to shar","useful":0,"cool":0},"NQ2IHaXorRvNDYzVaN5s_A":{"text":"Freezing and out of multiple items on the menu, but nice decor. Overall, I won't be back.","useful":1,"cool":0},"3NXCIqeX1jnHDHNRciCLoA":{"text":"I love Cure! If you're an old school cocktail enthusiast - this is your place. Plus, Happy","useful":1,"cool":1},"1ujZ99G8uBg1Hj9vB04ryA":{"text":"This is truly where you go to have an amazing drink. Super knowledgeable bartenders and be","useful":2,"cool":1},"U4hLR6ymR4K-tfqpU2sj5w":{"text":"Actually heard abt this place from our lyft driver who had driven the owner. Theyre gainst","useful":1,"cool":0},"LqNX7IcvJtNOQAfP2XhY3w":{"text":"Our favorite bar on Freret. The best selection and atmosphere by far. Can't wait for it to","useful":0,"cool":0},"Qf_jQH2JcVGId7205WMiwQ":{"text":"My fiancé and I came here before a dinner reservation and loved it! We both got seasonal c","useful":0,"cool":0},"uulix1rvxRhzED_acfKTRQ":{"text":"I'm sure you've heard people derisively mention  \"...paying for the atmosphere\" to describ","useful":1,"cool":0},"VVP6F9Yr4PA6Qxsn6KSojw":{"text":"Cure is exactly the type of bar that New Orleans needed. For all of the locals (and, why n","useful":0,"cool":0},"1uhyK_K9RMmzELiyJiOgaQ":{"text":"Cool place to hang out! Love the little bites and great drink selection! Friendly servers!","useful":0,"cool":0},"4qHpEmNgfRLz3asBYwHICg":{"text":"Man did I get lucky.  Went to Cure after the Saints destroyed the Patriots in MNF.  A perf","useful":3,"cool":4},"Yjep_iykB3RhvzSGWncLzw":{"text":"Off the beaten path but well worth the trip, especially if you like a good, strong cocktai","useful":0,"cool":0},"efLkMV-lPIaVublWZ8HDEA":{"text":"This was my first weekend in New Orleans and I went to what feels like fifty different bar","useful":0,"cool":0},"SfBJE1TUDbdqLkot1H26qg":{"text":"The drinks are top notch...but the place is expensive and hella pretentious and you can't ","useful":3,"cool":2},"LDOEslju9nagNw43pB8m9Q":{"text":"This place is very much focused on being a cocktail bar and their very limited and tiny se","useful":1,"cool":1},"3KOIN2oxvE9NnAJQ7wrSFg":{"text":"Lovely, lovely, lovely.\n\nFirst let me mention, they have $5 classic cocktails 5-7 on weekd","useful":2,"cool":2},"zbmyhBVbbKIFPnurs0NrlQ":{"text":"Witnessed a customer completely berate one of the bartenders after said customer also didn","useful":0,"cool":0},"MsyFcK0dKR4dxLYZgcX8_Q":{"text":"I have only being here for drinks, do I can talk about their food. But the menu carry some","useful":2,"cool":0},"Fb5s9kfqKU40o-4rkzXMOw":{"text":"This is such a fantastic bar, slightly hidden away on Freret street. Cure is one of the es","useful":0,"cool":0},"wWlzGHXPf2cIx-2FBcoJQQ":{"text":"I tried all 11 cocktails when I came here and it is pretty good. I would say the style of ","useful":1,"cool":1},"tjDv2NwX9zYkyPDaMTLMxg":{"text":"Cure is my cocktail Mecca in New Orleans! I wished i lived closer and could walk there sev","useful":6,"cool":3},"KcH1sArk9KT4CURNsV9A2w":{"text":"Sexy little hangout. I'm not a big drinker so I only had a glass of white wine, but they d","useful":1,"cool":0},"HeagRPqYCvtBC_9VREQ9Vw":{"text":"I finally had the opportunity to try out Cure. Very nice bar! I love the neighborhood its ","useful":2,"cool":2},"Sqso6DFsuYFvabhV5Kwu2Q":{"text":"With so many fun and interesting bar choices in NOLA,  you can easily skip this place. \n\nS","useful":1,"cool":0},"GMpznTt5ibZuiUYH9sGx4Q":{"text":"So we stopped by cure yesterday to visit with some friends who were in town for the weeken","useful":2,"cool":2},"1ky_Yo-Sz9EFRLs9FqmcdA":{"text":"My brother and I were on a Sazerac crawl while we were in town. This was our first stop. W","useful":2,"cool":0},"WtWoP5WnTzHB15nKyNpUyQ":{"text":"Really great spot for drinks -- they have a ton of interesting cocktails to choose from an","useful":0,"cool":0},"l9xrlmnx74LbNPBaAYAuwg":{"text":"The first time I went to this place was a few weeks ago with a co-worker.  I live in the W","useful":3,"cool":1},"Z-pa3rEsEcFOxhkco_CRAg":{"text":"Love that they have such a wide variety of drinks, unfortunately every single one we ended","useful":0,"cool":0},"HpS4gXhb7_YBSJRFPsG_cQ":{"text":"The food and drinks are always great. However, I have to stay the service was horrible. My","useful":0,"cool":0},"25YekQLl4zoX-RwuDDnGYQ":{"text":"MMMmmmm.\nI have little to add to the previous reviews, except that I chose to order the we","useful":2,"cool":2},"zOTVgwQGxbveCF1ZR_uBNg":{"text":"I will never go here again. The server I had was a blatantly racist white woman. \n\nI went ","useful":2,"cool":0},"7N7vWqhhNrtR_GCpsjns4A":{"text":"No disrespect towards the service because everyone was amazing but it smells like a swimmi","useful":0,"cool":0},"PNEWrLspRGgcyrLQA72tbw":{"text":"This place isn't really my scene; the customers are a little pretentious for my tastes but","useful":7,"cool":1},"Ff7DCihLHmwa9gq1uJ1Wxg":{"text":"Hip and trendy cocktail bar in a great part of Nola ... Excellent, original drinks. Food w","useful":0,"cool":0},"BgrC5VPa1kL63FQIJltKww":{"text":"Amazing cocktails at this place. Very friendly bartenders. The happy hour is not bad, but ","useful":3,"cool":1},"QL5_ORSjNzbhCSmY3p7QtA":{"text":"I love the atmosphere our waitress was very pleasant. My cocktail was exceptional....The o","useful":0,"cool":0},"j8APULi4bn_0loBlS4FB9g":{"text":"Worst. Service. Ever. We arrived at 10:30 last night and sat on the patio. 15 minutes late","useful":0,"cool":0},"YeJm7JlJJ5cYFfQ8qu4egg":{"text":"Cocktails are amazing but the waitress service is unbelievably slow. Serve your customers ","useful":0,"cool":0},"alaF71Pfez4W2tTpYunTCw":{"text":"***This review is only for the cocktails.***\n\nThe wife and I decided to work off some of o","useful":6,"cool":4},"GoFmzBpBVCVm58UASJ2Vjg":{"text":"Gorgeous, intimate little bar. Great semicircle booths for larger parties. The drinks are ","useful":0,"cool":0},"QToV22kBlWX4y2IV-yhM2A":{"text":"Overall I would give Cure a 8.75/10.  The bartenders were great and my rum old fashioned f","useful":0,"cool":0},"cXArPjXCLgEUqLyaE8n_aQ":{"text":"Great happy hour!\n\nThe cocktails are amazing here - both the classics and the originals. T","useful":1,"cool":1},"WP1_JZHpaaZWJ3zS6CBW2Q":{"text":"This former firehouse has been tarted up into a very stylish and comfortable space for min","useful":1,"cool":0},"pJbLM8D0BSAK78DQ9tDG1A":{"text":"Cure is a neat bar with a decent happy hour! The daily punch was tasty and they have a del","useful":0,"cool":0},"5kAlbAIx-T6lBVchf9jp9A":{"text":"I love this outdoor dining spot!!  I've never sat inside, but it's a cool atomosphere too.","useful":0,"cool":0},"EcyM5DlM9pYPAOMLvvNBSA":{"text":"Really? THAT was Cure? \n\nI'm a huge fan of cocktails. Secret bars, $15 drinks- no problem.","useful":5,"cool":2},"kCjjyUf4poYYDfCRO9dvTQ":{"text":"Really great place to grab a few drinks & catch up with friends or even have a nice intima","useful":0,"cool":0},"y2-76StjHN-Jb1qgSI7K3w":{"text":"In love with this speakeasy type bar. Without any signs on the outside, the bar has an elu","useful":0,"cool":0},"gaeL15DlTGjZvUiI7Vnw9g":{"text":"Trendy cocktail bar with great happy hour over the weekend! There's not a lot of bars on t","useful":0,"cool":0},"A0pPPNEb-kD_krXfRhhrRQ":{"text":"If you're looking for a nice date spot or even just to have some very tasteful yummy drink","useful":0,"cool":0},"Q7bL0gvEMhfS2gXfOxB-eg":{"text":"I used to love this place, but my most recent visit had me not wanting to return. Th place","useful":0,"cool":0},"ZLAR-_6xAbwDC6snZ_Or3w":{"text":"Food and cocktails are superb. Service was almost nonexistent for our visit. We had a rese","useful":2,"cool":0},"j67DD07vo_-xJMiScKD8kg":{"text":"James beard winner! Great cocktails! The patio looked very nice but it was a bit chilly to","useful":1,"cool":1},"DHj7gk5iVUktwSd5WKzxUQ":{"text":"I really enjoy going to Cure for a cocktail.  I love the tight focus on the experience of ","useful":1,"cool":0},"VqrvqC19izFacrkOdvfUrg":{"text":"I have read several reviews stating that this place is \"pretentious, service is slow, bart","useful":9,"cool":5},"LcZk5AYd5_y51Nsw1Mny5g":{"text":"Very delicious cocktails. Unfortunately they are pricy. This place has a lot going for it,","useful":0,"cool":1},"ejvSnrx7PV-JVP1L2xyoiw":{"text":"Just an awesome neighborhood bar!  Its got great style and a beautiful outside place to si","useful":3,"cool":1},"E0i11K5SupTExfdzYY_RwQ":{"text":"I would give this place 10 stars if they let me. Best cocktail bar in the city! I've being","useful":0,"cool":0},"p-HjXOiXCq1XuQkEk6plNw":{"text":"Love this place! Best happy hour in the city along with great service. Their menu cocktail","useful":0,"cool":0},"czWU_IJ59bj1j2TqLJ9G5A":{"text":"Cocktails were very good, loved the neighborhood and outdoor area. Waitress was a little p","useful":0,"cool":0},"vk592SG4qeSVAwV61GUJ8w":{"text":"Get there early! They open at 5!!\n\nCure is such a sweet spot the tables and bar fill up qu","useful":0,"cool":0},"toC0LcxfIjasrmUzpoGl5Q":{"text":"We came in from Houston accustomed to the mixology snobbery of The Anvil. Being eye rolled","useful":1,"cool":1},"jrmXhJkc_nu9IYJgFJvq1Q":{"text":"Cure is a pricey place, without a doubt, but what you get is worth it. The bartenders here","useful":0,"cool":0},"TnmcY39y4bzae3QOG5_HbA":{"text":"Went during happy hour -- place was super cool and the drinks were awesome. Staff was extr","useful":0,"cool":0},"6DF7KCiaINQy2AK2CC7HbA":{"text":"I only went there for drinks so am unable to review their food but I wanted to write a rev","useful":0,"cool":0},"hHaQWHhXT5wHJFe9jGgGOA":{"text":"UPDATE:  Since posting the review below I have spoken to the owner and I have been back to","useful":6,"cool":2},"2M3nn5rw3fDzeNxLS_-nww":{"text":"Love the daily happy hour here--including weekends. Classic cocktails are $6 during happy ","useful":0,"cool":0},"TBpdei-huqoqrYiCtTZBBw":{"text":"I came here with two of my friends because the concierge recommended it while we were stay","useful":3,"cool":3},"MsbgpwANzzeVvpjYLj4XeA":{"text":"Okay, okay. Okay. I went to Cure awhile ago, I know, but I never reviewed it and I keep th","useful":1,"cool":0},"Xgja60VDscJCH5mq5M6--w":{"text":"I visited New Orleans with friends and made a worthwhile trip to the other side of the cit","useful":1,"cool":0},"mWwr6Yy23EpmoVcZFHq9tQ":{"text":"While Cure has yet to officially open its doors the buzz surrounding this shot in the arm ","useful":1,"cool":1},"V2KB-eHD6Z6E3VYkRkJjpA":{"text":"We came in town from Pensacola to visit a handful of craft bars and this place was our # 1","useful":0,"cool":0},"I3vYydJg4NIwoInkS9Yvvg":{"text":"Very cool decor. Food was very good but the portions were on the small side. I would defin","useful":0,"cool":0},"Uo1QvVrdIja5G5QrEZUVoA":{"text":"Drinks are great I would say 4 star. The bummer about this place is someone went cheap on ","useful":0,"cool":0},"iSKe507O5AUJ3A3hg-gYRA":{"text":"This is definitely a do-not-miss experience of New Orleans. We ended up arriving there on ","useful":0,"cool":0},"43TrIOuzskAMaaRkiF7eRw":{"text":"love love love this place. Craft drinks and great food in a cool atmosphere","useful":0,"cool":0},"rUv7fkdu99mKNUi_kvQBaQ":{"text":"No kids allowed??!!! Wish I could have tried the epic drinks I heard about but my well beh","useful":0,"cool":0},"vQngGTRxsN28T3B0VxhaYw":{"text":"Very nice place with some tasty drinks, great bar food, and a fun but relaxed vibe. The se","useful":0,"cool":0},"vFJRYrr9oiJDn6Evuwht8Q":{"text":"I'm a man of the people.  I like to sit around in divey bars and drink beer (poured carefu","useful":6,"cool":2},"Lvw93PYi9bKRVgzpvf3aXw":{"text":"Cure is a very trendy and hip bar located in Uptown New Orleans on Freret. They recently w","useful":0,"cool":0},"vGFX-g3ZduXvu0UHv07tIQ":{"text":"Love that there is a Cure in the airport now! Food and drink were excellent, and the team ","useful":0,"cool":1},"0dy2Ks7xnhdYkEgmhdedjQ":{"text":"Went for my first time and can't wait to return.  This was one of the best cocktail experi","useful":1,"cool":1},"dw6lBgzEPErzTcK3MN4B2A":{"text":"Cure is about a 1/2 mile from my house so I drive by all the time.  And the crowds of glit","useful":3,"cool":2},"9OhL6DyTBpwl1Ljcj5mYkA":{"text":"Really cool bar with a great whiskey/bourbon selection.  They had the most bottles of the ","useful":0,"cool":0},"bVxYNqWhlu0r36WFODpNaA":{"text":"The bar had a great atmosphere, but the service was abysmal. We ordered drinks that never ","useful":0,"cool":0},"C81QeV_nCk6F8tD56EfKFg":{"text":"Considered one of the best cocktail bars in the city in terms of creative drinks. I'm nor ","useful":1,"cool":1},"JGo7GAqSYi_YVWoTXoO_9g":{"text":"Before walking into Cure I knew it wasn't the bar for me. I had this feeling that this was","useful":2,"cool":2},"BPzUlclaw9OetOyXLcYO5Q":{"text":"Cure is the best bar in New Orleans. And the have a phenomenal happy hour with a solid sel","useful":4,"cool":3},"fnfL-ITg6sjhbjafCBPy9Q":{"text":"I haven't been this close to God since my car accident 8 years ago. The drinks are so good","useful":0,"cool":0},"BoGFLx5Mxnty86aQgKe2Jg":{"text":"This is an awesome cocktail bar. :) Great ambiance, drinks, and menu. I loved the staff th","useful":0,"cool":0},"UVtlOYwURD9d2Iyef7-lsg":{"text":"The best cocktail bar in NOLA, bar none!\n\nThey knew what makes a Hendricks gin and tonic a","useful":0,"cool":0},"7hO0SWGE1k35TXDdfpgUTg":{"text":"I always have a great time when I come to Cure. I went here a few days and tried the food ","useful":1,"cool":1},"SlWecaGMlsTTW9oZiD5y0g":{"text":"Really great, off-the-beaten-path NOLA restaurant.  Food (all small plates, I believe) and","useful":0,"cool":0},"stABi9u-cRO--3DN1-xeaw":{"text":"I usually wait for reviews until after i've been a few times. But I think this place deser","useful":7,"cool":3},"NLPt5mg9YX1hWH2O9VMO7w":{"text":"call cure \"theatrical\", \"pompous\", \"swanky\"... whatevs.  it doesn't matter cause, truth be","useful":0,"cool":1},"afz_OsbuNE5bLxdVCYcAuw":{"text":"When I think of a craft cocktail I think of Cure. I went here with 2 other friends and we ","useful":2,"cool":0},"CSqxmb2o2ySv_nlKsryFjA":{"text":"The service wasn't bad when you saw you waitress every 35. They were under staffed on a ho","useful":1,"cool":0},"4owkl8TemgoRda-zKbpQkA":{"text":"The Army & Navy drink was wonderful! I thoroughly enjoyed how different the menu options f","useful":0,"cool":0},"XPr-zDFXWUiS0drFsvAKMQ":{"text":"Great bar for craft cocktails. Excellent lighting and music. Cocktail Menu was a little ch","useful":0,"cool":0},"ydv6-7-oXapnLjy_xuvmHQ":{"text":"We arrived on a Saturday night at happy hour with a small group. All of the cocktails we t","useful":6,"cool":2},"CnpN9W30KgOD8qkIEhmNCg":{"text":"Some people I know loved it. Some people I know hated it. And after my first visit, I now ","useful":7,"cool":8},"3DoyOXKoG4PZZvyHNVG4bg":{"text":"How this place doesn't have a 5 star rating is beyond me. Best cocktail spot in the city.","useful":0,"cool":0},"JjVIUt_14Z3WpF94pfFZsA":{"text":"Boo. That's what I think about Cure. I realize this isn't a popular opinion, but it is min","useful":7,"cool":3},"7jVoGQ4TFG7nIetswgws1A":{"text":"Fresh off the high of an amazing dinner at Brigtsen's on our last night in NOLA, we ended ","useful":5,"cool":6},"9sQoflqAbWY4GsleSTQ8MQ":{"text":"The bathroom lights are motion detected and turn off mid potty.  Wave your arms.  You've b","useful":2,"cool":1},"-RWjMI8ibxVqIP0nDuntyg":{"text":"Yesterday was my first time going to Cure. My first impression when walking in was \"man th","useful":1,"cool":1},"ZQbKwZVUzrd70yXGloU_5Q":{"text":"A couple of my friends from Loyola and I decided to check this place out a few weeks ago. ","useful":1,"cool":1},"BIZtMFK4KGmycDV5j7Nbzg":{"text":"Came here after just landing from my flight it. I was transported to hipsterland/ williams","useful":0,"cool":0},"9MaU6Fg23iNJYe1zcjXXzA":{"text":"Every time I've come to New Orleans to visit my daughter we have to go to one of my all ti","useful":0,"cool":0},"O61Ym6akG5GIK-1XONstGg":{"text":"With the plethora of upscale drinking and dining options in the great city of New Orleans,","useful":7,"cool":2},"5Vk0U7HPtPbjfB1slSf9tQ":{"text":"My husband and I visited friends in NOLA. We went for happy hour on Sunday. We each had a ","useful":0,"cool":0},"qtI4YPktQCm2SYXptg3EaQ":{"text":"Very nice place for a drink. I happened to stumble into happy hour so that was great.\n\nIt'","useful":0,"cool":0},"cFzaIZuJz7dVv7wTJXWBWA":{"text":"Drinks and atmosphere were great! HOWEVER the menu lists HAPPY HOUR prices, not true price","useful":0,"cool":0},"tj6QehD9DNTPKaDRWGWZnQ":{"text":"Wonderful because..\n-It's right on Freret, right around the corner from my house.\n-The atm","useful":0,"cool":0},"0UPtIbxyydmo_yvize2D0w":{"text":"I used to love going here since I lived right by it, but they have absolutely lost sight o","useful":0,"cool":0},"8Wynlbv51yLZDD_mzka0Ow":{"text":"The cocktails. The pate. The smoked trout. The meatballs.  Every plate was a delicious, se","useful":0,"cool":0},"sKUs1V8CwIbk4rkxviNrJg":{"text":"So, I get it. This place is super hyped, really modern, yada yada. I'm actually not the bi","useful":0,"cool":0},"DCur5NK8wN4vV7Z0zgBLsA":{"text":"Great cocktails. Beautiful bar. Friendly and attentive staff  Music so loud you can't hold","useful":0,"cool":0},"kXmfJAfeyOzEdeCTdyju1Q":{"text":"Love this place!  Unique & incredible drinks that are like mouth-explosions.  Classy place","useful":0,"cool":0},"NCPS_ScIsfmHqJUZAxdSzg":{"text":"Neat little spot on Freret. I knew I couldn't miss it after reading the cocktail menu onli","useful":0,"cool":0},"EHU9ONpfbWVf4OqFBbcyTA":{"text":"Cure has been everything to me in New Orleans.  Remember that New Orleans has Happy Hour e","useful":2,"cool":2},"yk0gFEOrfpvFE2YGauBBPA":{"text":"This is undoubtably the best cocktail bar in New Orleans. \n\nPerfect place to go when in ne","useful":3,"cool":1},"lZY_eQbTaL6YHqM3BTuRrg":{"text":"Hmmmm.... not sure what to say\"\n\n1. classy\n2. trendy\n3. long bar\n4. good food\n5. tables av","useful":2,"cool":1},"otQHbosua7-f05U0oaD4xA":{"text":"I wish I could have experience \"Cure\" but I couldn't. Why? Because the dorky bartender wea","useful":4,"cool":1},"w6EXpoa6TvWWwz56f_flSg":{"text":"A two star improvement for Cure?\n\nAfter my previous visit to Cure, I have rethought my dis","useful":8,"cool":4},"Y9p1-VpBt9cDjvcuXXuDkQ":{"text":"The first time I went to cure was over 5 years ago. At the time Feret St wasn't as popping","useful":2,"cool":1},"_C1sqYzbZKTJndwvNIjodg":{"text":"Bartenders drink on the job, also disrespectful crew. Good drinks though and crowd. Not a ","useful":0,"cool":0},"hvhNgvfvknMjK44jRPNSzw":{"text":"So glad we stumbled upon Cure while exploring Freret Street - only to later hear that this","useful":1,"cool":0},"NIdVL71w4Tvqgc3PNeSlZA":{"text":"Totally worth a visit! Professional staff, perfect ambiance and sophisticated cocktails.","useful":2,"cool":1},"ABhpKrTjkHE8kSxmcp0Wmw":{"text":"Great space, friendly staff, good cocktails!\n\nThey were very generous with restaurant info","useful":0,"cool":0},"Mh0apC2UmuO8gtTI-qQvsw":{"text":"Loved this place! Come here if you're looking for a a nice cocktail bar. We came before ha","useful":0,"cool":0},"4PXICzoV6FnMixbJc6PNGA":{"text":"What an excellent bar! It has a pretty hoppin' vibe without feeling too much like a club. ","useful":0,"cool":0},"iKXcyEg2aLBKZsH3fvT5BQ":{"text":"With a swank kind of \"apothecary\" atmosphere to compliment their intricate cocktails and e","useful":1,"cool":1},"dObC1nd1aLRYEyhHJSbm2w":{"text":"I really wanted to like this place.  Ordered mini tomato-crostini and bacon dates as well ","useful":1,"cool":0},"gx__dzTLfbulaDNTIlSnAg":{"text":"I was in town visiting my family and celebrating my birthday over the long MLK weekend. Wh","useful":0,"cool":0},"N3wSO1y9ANP6SYkX81J6zw":{"text":"This is definitely the best stocked bar I have ever seen! No way they even use half of tha","useful":2,"cool":3},"n8ZVljMjf5As89awfqSq2w":{"text":"Cure is one of my favorite bars in New Orleans. I fell in love with cocktail bars on a tri","useful":8,"cool":4},"v3aisX5wtGGQOiyUYBXzdw":{"text":"Love love love this place! Very chill vibes, great staff, and great drinks. This place rem","useful":2,"cool":0},"R_hac7o8uXogDXS2U9d5OQ":{"text":"We hosted a work happy hour for about 15 colleagues at Cure and everyone had a great time!","useful":0,"cool":0},"HJJ-gCPu6ezGUvd298SW3A":{"text":"Oh the woes of bad service in my review writing today.  I write with a frown on my face. A","useful":11,"cool":3},"bXP6nZeLj-gwVsiZg_zJng":{"text":"Per usual The food and drinks were great. Must orders are the delivered eggs and the fish ","useful":1,"cool":1},"yljyVS7mEFCrng-NMXm_BA":{"text":"This place is fantastic. \n\nSwanky, chic and cool. Such a great vibe and super service.\n\nRi","useful":0,"cool":0},"GX3qYu0kd3Jeaif4QIXQpQ":{"text":"A group of 18 of my friends came for a birthday party. We each ordered two drinks. The bar","useful":0,"cool":0},"2aHqk3HUm2GbHYQpMXF8qQ":{"text":"There are so many great things about this place! Easily my favorite cocktail bar in the ci","useful":0,"cool":0},"l_XRyNbdhMfe4GaKM5anJA":{"text":"sure... it's kinda pricey for new orleans. but it's also kinda cheap for other big cities.","useful":1,"cool":0},"8z6Vxd0HtGR_J8jy8xFk4w":{"text":"We are locals who live in the neighborhood so we knew Cure was different as far as bars go","useful":0,"cool":0},"ZYaOxfHplYfNGzXp8ih02Q":{"text":"I've been here a few times and have always had a positive experience. It's a great craft c","useful":1,"cool":0},"Z1Zv71ZnZiS8GMyRzeuGhQ":{"text":"I went to Cure during happy hour on a Sunday (3-7 pm Friday through Sunday). They have a g","useful":3,"cool":1},"BSUHbMA9x-5H7Tx273aVEg":{"text":"Cure is a darling happening place. We popped in for happy hour and their specials are dyna","useful":1,"cool":1},"1JginIgeh5tCgWoMpng7zQ":{"text":"Cocktails are my alcohol of choice, so I was pretty pumped to come to Cure after seeing it","useful":0,"cool":0},"_OcJk-U1SZ4Dy3I1KNERYA":{"text":"This place has the most amazing cocktails of any place I've tried in Nola. It's typically ","useful":2,"cool":1},"p4DUh3TOlhMou2wnb5e8Bg":{"text":"In terms of selection of Bourbons and the knowledge of the staff, I cant think of too many","useful":0,"cool":0},"BawzqEGXt3yjR3VGiFsILw":{"text":"Very disappointed. Took a group of people since my last experience was excellent. Sat on p","useful":0,"cool":0},"Vmk9SBMhmos7vITRE2iEtw":{"text":"Killin it. Excellent cocktails at very reasonable prices in a beautiful ambiance. Dim ligh","useful":1,"cool":2},"rp1qXGy7htx8J-dN7As1eQ":{"text":"I waited for food for 60min and watched the table next to me served 2 courses, dessert, an","useful":2,"cool":0},"UhM-OkSZpuQUzAYew-2fmg":{"text":"Every time I come to NOLA I make sure to stop at Cure. If you are a cocktail fan, it is a ","useful":0,"cool":0},"cK_DAyy_a217MWhde17VQQ":{"text":"I went to cure to celebrate and have some different and delicious cocktails.  They definit","useful":0,"cool":0},"4A-K0lupY6oJoM5mo8HLWg":{"text":"I feel 100x classier coming here for drinks with friends. Stellar interiors and service! W","useful":0,"cool":0},"Oy_zAeXf4D0vA25a_dhfsA":{"text":"Pretty awesome place! Went during happy hour on Friday which is 5-7. A good amount of cock","useful":0,"cool":0},"o9hriSL6DZIh7lFCSU3mkQ":{"text":"I love a good cozy bar and Cure is definitely one of those to go to. With a chill setting ","useful":6,"cool":2},"CcQPn1Q6wYbwEmlDollDzQ":{"text":"No disrespect towards the service because everyone was amazing but it smells like a swimmi","useful":0,"cool":0},"odBwWvxmDxkmxb4MpodiHQ":{"text":"Terrible service, took 30 min to even get out orders taken, then 20 min later, still no dr","useful":0,"cool":0},"6hQtrpYjjMEUEA6X6N27aQ":{"text":"Awesome, creative cocktail list with a plethora of amazing liquors on the shelf.  The venu","useful":1,"cool":0},"YGJa6-eyIK3JtS8jI7CcwQ":{"text":"What a  fantastic sophisticated, yet casual venue in The Garden Quarter! \nThey got me stra","useful":1,"cool":1},"vfhNdC_sCElgPqwBKL8ESQ":{"text":"Such a great place to have a late lunch at. Their award winning cocktails do not fail to i","useful":0,"cool":0},"8A3RZPk3_4hpYJe8GQGGDg":{"text":"Delicious cocktails. Gorgeous atmosphere   Clean bathrooms. Friendly bartenders   Thank yo","useful":0,"cool":0},"OxDAS5zIQrCNu6T_g1IWsA":{"text":"Cure is craft cocktail bar located in New Orleans (Freret area).  According to their websi","useful":5,"cool":7},"iCfJJcCnDGLsgw35GpwELQ":{"text":"I wish I could leave less than a one star. The server completely ignored our group and ref","useful":1,"cool":0},"B6DUT9VY10CdwD33tjdx3w":{"text":"Remember - if you have been reading my reviews - when I mentioned that some of the cooler ","useful":2,"cool":2},"ZTfUN66GuAcTOMic99kyag":{"text":"Great place for a hot date.  I love the fancy drinks and the happy hour.  The daily punch ","useful":5,"cool":2},"2W3p0WT0xmq2ugSZuoBUQA":{"text":"Insanely good cocktails.  Happy hour is a great deal with six dollar standard cocktails.  ","useful":1,"cool":1},"9UGtKGA-LEOi9QluJlkwsA":{"text":"Very cool deco and environment. Went during happy hour and it was a very nice vibe. Had th","useful":0,"cool":1},"td4k8fS_MnrXIHSJsZbOZQ":{"text":"This is a review that's a bit overdue. \n\nI think I'm talking about the owner here... \n\nI r","useful":0,"cool":0},"NJ6vNbEMEUfxNE_NRuO8-g":{"text":"Cure is cool chic bar that is upscale while still being casual.  Cure, 1st and foremost is","useful":3,"cool":1},"ldhcs9li7bmGf4ESmtC-uQ":{"text":"Atmosphere was great! The staff was nice. Cocktails  were perfect. Great range of choices.","useful":0,"cool":0},"pYhNVqIPNeOLF4R6yOcesA":{"text":"Menu pricing is intentionally misleading. Prices listed on the menu are only happy hour pr","useful":1,"cool":0},"go3odQpRvTZT7xXPxFH3RQ":{"text":"Wow wow. This is the cure for all those dreadful, overly sugary drinks and boring standard","useful":15,"cool":15},"dBMDBg5j90rMAoB-S9b5vg":{"text":"Great food, delicious drinks, and top-notch service! The atmosphere is warm, relaxed and r","useful":0,"cool":0},"4DDz2DX74_hBJ73vQKGoaQ":{"text":"Poor service, bad drinks, hipsters. Went to have a night cap after dinner, only to sit at ","useful":0,"cool":0},"Oq2npTnN3aj3gvGALDuoDw":{"text":"My husband and I finally made it to Cure as we were visiting NOLA to see some family and h","useful":2,"cool":1},"3SVM8IDOoVSagDma2p-Wvw":{"text":"Referring to my friend Niki G's review, here's my input on the party. \n\nActually, the host","useful":1,"cool":0},"SwWwKCeUfyCxvM2lCKTNrw":{"text":"Hands down best cocktail bar in the city! It has a great atmosphere to chill day or night,","useful":1,"cool":1},"P4mqQSI6k0MoqRz_ZqSEow":{"text":"Maybe it's because it's the first place I went to for happy hour when I first moved to nol","useful":1,"cool":1},"OfzthlJD8KFu8sxKSAqHvA":{"text":"Cure has been a favorite bar of mine for several years. Even though I live across town, it","useful":14,"cool":9},"YwoDFnpmoAs4u-s_mL18CQ":{"text":"Cure = Happy Hour\n\nI'm not a math wizard or anything but don't double check my math. Cure ","useful":16,"cool":11},"Pk61VZIKWg3HRDkD-nAmoQ":{"text":"This is a review for the MSY Cure. Thomas and Justin were beyond excellent! I walked into ","useful":0,"cool":0},"Xhg7q63yH3zK3ln2NNT1aA":{"text":"THIS PLACE EXCEEDS THE HYPE.\n\nif you're reading this review, just shut your computer and g","useful":6,"cool":4},"nMHH1_ZLANa_Dt9GXNsvTw":{"text":"Although I'm getting older and my metabolism and I aren't BFFs anymore, I can always stoma","useful":8,"cool":3},"F8JG53lDzuWKbbDQWeraNg":{"text":"I loved this little cocktail establishment! Hubby and I make a point of discovering cockta","useful":0,"cool":0},"K7Io-m0vQi8RTJKyDfJJ7Q":{"text":"Good service, good selection of drinks and beer, with very unique mixed drinks. Good place","useful":1,"cool":0},"18s6E0mtuwoKemMRMA344Q":{"text":"Hipster bar with Boutique cocktails.  Creative drinks, helpful service staff, and upscale ","useful":2,"cool":0},"b2ikCpWNNHtsIpuVa-HViw":{"text":"Gay men with capri pants and flip flops just turn around.  It looks beautiful  from the ou","useful":1,"cool":1},"mqAHlE-RlDLjQ-ZD4GW5AQ":{"text":"Came down here with friends for drinks before dinner and it's no wonder this place is awar","useful":2,"cool":1},"6rjIhbwbtcp2M5llLPg7Gg":{"text":"Completely satisfied with everything about this place. The waiter, the quality of the drin","useful":0,"cool":0},"wjkjBpdzZtVGvfrXWoBGfg":{"text":"My sister and my family came in to have drinks. It was a large group. The waiter forgot th","useful":0,"cool":0},"c68-xFqmHcjdWH58mJ6jCg":{"text":"The cocktails were unique, tailored to the season, and most importantly delicious! This ki","useful":0,"cool":0},"JEehCSXyPE90ycjdoAPTDQ":{"text":"They were super accommodating of my group on a Friday night even though we did not have a ","useful":0,"cool":0},"cUTJ1R2aYeLoCeTedxh80A":{"text":"Living in NoLa and appreciating a craft cocktail, Cure is always on my list of places to s","useful":1,"cool":0},"Jz-pOHhvBgBq0sLZsQ5BnA":{"text":"Love the feel of this place. So modern. So chic. So UPT.\n\nLove the ambiance indoors and of","useful":19,"cool":13},"S_Ai2zNwdd8cn86zHARiuA":{"text":"Cure is a really cool place. For me, this is THE cocktail bar in New Orleans. I usually co","useful":7,"cool":1},"QY3oYXqP1SkWu7Kt7oy0Og":{"text":"A little swankier than I like. \nA little pricier than I like. \n($4 for a High Life..seriou","useful":3,"cool":0},"ZpuHTNhKCkBn5ivY7tu4nw":{"text":"After years of winning best cocktail bar every year according to The Best of Gambit weekly","useful":3,"cool":3},"skNVWbPsm0g1oOhSf74qGg":{"text":"Nice atmosphere and good drinks that could be stronger. Great price for happy hour. 2 star","useful":0,"cool":0},"U2zwRJXvYaOnX-wI4dFeRA":{"text":"Im so happy they open! Place was spotless, waitstaff was attentive, Matt mixes the best dr","useful":0,"cool":0},"zaKshv4fEy9rr8FFOiMxFg":{"text":"Wow Cure.. I went there months ago but, just for drinks.  This time, we had half the menu.","useful":1,"cool":0},"PMZ_UTv_YQ4k0Cmer3gEBg":{"text":"Drinks were good and tasty but if you're going here with friend(s) I would not suggest it.","useful":1,"cool":0},"z5G0P6HnYkmuqHwnbYbBYQ":{"text":"Great cocktails, love the atmosphere and will definitely be back to sit out on the cute pa","useful":0,"cool":0},"73SrliOX5ke4IVZiF8CKDg":{"text":"Wonderful decor, great drinks, sophisticated pallet. \n\nRecommended weeknights if you want ","useful":2,"cool":0},"EBkq3AXQuC3HYQ6k7tvrog":{"text":"I love to come here because the drinks are good and I enjoy the ambience. \n\nGets really bu","useful":10,"cool":4},"z5oZBWagmp2U8IW5BANzFA":{"text":"Underwhelming. Drinks were alright, but the staff was dreadful. Clearly neither bartender ","useful":3,"cool":0},"TyGohWGr4cDOhaDXBaZVCA":{"text":"Food and drinks are phenomenal- top notch. But the service is utterly atrocious. Spent 2.5","useful":0,"cool":0},"xHR6gydmJV6LnAjrBegdyg":{"text":"Cure is the best mix of this is a neighborhood bar and I'm so comfortable here and hmmm...","useful":0,"cool":0},"Kdfl81nFKlDvylqUKo28RQ":{"text":"Cute bar on freret that's perfect for a nice date night or just catching up with friends. ","useful":1,"cool":0},"IN1ToKCw05bzKvYUXjAYcg":{"text":"Staff very knowledgeable. Great atmosphere. Very relaxed crowd. Drinks reasonably priced. ","useful":0,"cool":0},"imJkChI8lLygMRlxWzi6FA":{"text":"If you took someone who's never been to Cure, blindfolded them and dropped them off on a F","useful":11,"cool":8},"32G35O8buZWALf-AIzGCHw":{"text":"My first time visiting was yesterday. My friend and I came here to get some work done and ","useful":1,"cool":0},"AwUnZsRBEXfEW5MR5Ue9Cg":{"text":"MAN!  I remember when you'd go to this place and you'd park your car strategically so you ","useful":4,"cool":1},"uKFmfH9bieQSozNDok1ezQ":{"text":"Hey there Neal, it seems what you heard from your staff does not align with reality, as yo","useful":0,"cool":0},"liWk-XGBo11vkKW1yUTlog":{"text":"Stumbled upon this bar while attending a conference in NOLA.  I was immediately attracted ","useful":2,"cool":1},"Xw1L-L5dSWf4QOuHMtFtCw":{"text":"Found myself here on a Saturday night. Soon after sitting down, I was asked to take off my","useful":6,"cool":5},"i85Yzi-bK8FglvxZzCPevQ":{"text":"This is a great place for tasty and unique cocktails and small plates!   The atmosphere is","useful":0,"cool":1},"PYuFUwhjmr0uX_byML1Ocg":{"text":"I had high hopes but the service was practically non-existent and the food was mediocre. T","useful":1,"cool":0},"Me54G9s-qBzLWxQYWW74nw":{"text":"Okay, only came in for a couple of cocktails but ended up eating. Let me tell you, nothing","useful":0,"cool":0},"Lt3ZGv2jkv9eUlykZxhwTQ":{"text":"I feel this place is way overrated, I was expecting much more.  The place was pretty empty","useful":0,"cool":0},"GyAc14iM7PttKV_miAeZQQ":{"text":"5 star cocktails and even better service! Not to mention that they've been doing a great j","useful":0,"cool":1},"IlXsK6Z_cvf56nz4yDb3vQ":{"text":"American Horror Story brought me here. \n\nI literally did so much research to figure out wh","useful":7,"cool":8},"l5z_qplL1VGIW-OHxyVEGA":{"text":"Cure does pretension like not many places can. If you want a bespectacled, mustachioed man","useful":1,"cool":1},"gQyE8hgnIaAEILpP8e3PnQ":{"text":"Despite my inclination to punish this place for being too \"trendy\" and too \"NY\" I will put","useful":7,"cool":3},"7T8MLXgrnWAcdcDiI5LzUA":{"text":"Cure has great cocktails and a trendy/romantic ambience for when I want to dress up a litt","useful":4,"cool":2},"b05_0pnj_zg_QomUq_gS8A":{"text":"This is a 100% bar with a limited out of the box delicious food menu. While there are few ","useful":1,"cool":1},"52zk-fqgnB-JKqoO0ouH7g":{"text":"The cheese was good.  The wine selection was terrible and in fairness it's probably just a","useful":0,"cool":0},"2guPTg2NLN71H-7DweMidQ":{"text":"My girlfriend & I were visiting from California and a friend recommended this place, soo g","useful":1,"cool":0},"pDWFZbKoxp2WKMeSDklPyg":{"text":"We came to Cure for a quick cocktail prior to dinner reservations. When you arrive, the do","useful":0,"cool":0},"7SoflI7o26A8Ek3j9LvifA":{"text":"I came here with a group to have after dinner drinks. One of my friends warned me ahead of","useful":0,"cool":0},"DXj_1assQBRG5t0eFKRBtw":{"text":"Yay!\n\nGreat mixologists with creative drinks in a gorgeous space, this bar is off the beat","useful":1,"cool":0},"ZjVoHV8WhUyRammI6go6LQ":{"text":"Great selection of scotches, some I never even knew existed before like the Japanese ones.","useful":0,"cool":0},"JY03KWBjx5-JXwosRT2vlg":{"text":"Absolutely amazing place. We have several cocktails, all of which were tremendous. I will ","useful":1,"cool":1},"LW2k9y0SNyWUJtZTy2pMDw":{"text":"I wonder why this place is named \"Cure.\" It doesn't cure anything but my sober state--whic","useful":4,"cool":3},"Vz0OslG47qrflNqWaUUmtw":{"text":"Charming cocktail bar with a STUPID good whiskey selection.  Never had BTAC or pappy?  Thi","useful":2,"cool":1},"EBTQAlumtslB6b6cqmxjVw":{"text":"Came here on the recommendation of a local and so very glad I was directed to this Gem of ","useful":2,"cool":2},"1_BihK3smakgj97EY9h72A":{"text":"great location and great drinks!! any Pappy?!!\n\n\nlove this location! James Beard Award!","useful":1,"cool":1},"X2n3-Tyr4jsb4r4ABpJhRA":{"text":"Such a wonderful spot for cocktails in NOLA. The interior is beautiful (especially the ins","useful":1,"cool":0},"44Mz4NbbYKpE1mvxsaq8nw":{"text":"IN A NUTSHELL my 1st impression: Loud, Over-priced, Waspy-crowd.  \n\nI remember hearing abo","useful":5,"cool":0},"0wpxmXq8imb8nJt1Dssh4A":{"text":"I was wondering around Freret street on the way to a beer spot I had been dying to try whe","useful":11,"cool":7},"_0HS3cVdjMQVnVWR5EBuNg":{"text":"Cocktails delicious with well knowledge bartenders. Getting three stars instead of 4 becau","useful":2,"cool":0},"0IaehZ_ujUHyfAoKul8-aw":{"text":"Yeah, I was not impressed by this place at all.  The inside was dark and sparsely decorate","useful":2,"cool":2},"RV7_eHV9DqbI3ISbf1sLog":{"text":"This is a nice little hidden place on Freret St. I probably would have missed it if my fri","useful":2,"cool":2},"m9Gp9_lLb1jJX2rpwwF49w":{"text":"Seriously, can I just move in here? \n\nWe came because of an adamant recommendation by a fr","useful":3,"cool":2},"_QbqU6uQdvlfYPTam4Qxuw":{"text":"I was excited to try this place out, we were in NOLA for the weekend and this place was su","useful":1,"cool":0},"XlDLSzmnwHOuyJ8FfHmkYA":{"text":"Matt took exceptionally good care of us both times we came in.  The food was delicious and","useful":2,"cool":2}}