{"LXHb1TdWOss46LCg_MawnQ":{"text":"A down and dirty bar that has so much character and so so much beer options.  Went to watc","useful":2,"cool":0},"mldahIu71SPdIMkW_e51JQ":{"text":"The service is TERRIBLE, the guy at the oyster bar was rude, i asked if i should pay now, ","useful":0,"cool":0},"Eu6429AKN0CvqliPwwI3_g":{"text":"I didn't realize Cooter Brown's had switched ownership until I walked up to order a sandwi","useful":2,"cool":0},"0I_eXOwYa0drl-31gTMNDQ":{"text":"A good bar for the evening. You can get oysters half off after 10pm, which is great for se","useful":0,"cool":0},"fthwayhwoF0rBZk_JRvwXg":{"text":"Super loud and rowdy inside early on a Friday afternoon.\n\nNice outdoor seating at picnic t","useful":0,"cool":0},"ZgAiIVpfBGvQA1IO-hhZIw":{"text":"One of my favorite establishments to go to whenever there's a game on. They have huge flat","useful":0,"cool":0},"Hvym1hb_35n3f-5G_4VDtA":{"text":"Best tasting, and best deal for raw oysters!!! Be sure to tip your shuckers. They'll shuck","useful":0,"cool":0},"pD5kEBMwL8UxL1zeicLhYg":{"text":"The beer list is extensive and impressive. Fresh oysters are shucked at the bar and only $","useful":0,"cool":0},"_Sdxv0HAGOQf2SPnJBf1OQ":{"text":"Taverne sympa; je n'ai pas eu la chance d'y manger mais j'ai goûté la bière à la fraise lo","useful":2,"cool":1},"wtAuA76k0dZqXCJPWAUDqw":{"text":"Old school dive bar featuring some of the best oysters live or fried in town with plenty o","useful":3,"cool":0},"pK4ezIrPAjccSmRjt2b6Ig":{"text":"Not a bad spot for a night at a sports bar considering what people tend to look for: large","useful":0,"cool":0},"vK2DnJwznTMRuBKx4kjK9w":{"text":"Only been once but excited to go again. I had the bayou philly and it was delicious and bi","useful":0,"cool":0},"x93SlkPssLY412tGUD14Dg":{"text":"Raw oysters, beer, fried shrimp, oh yeah!\n\nThe beer was super cold, with great selections.","useful":0,"cool":0},"jLgf6PXxVXUV_n4__VaWHw":{"text":"i visited with a friend(local) enjoyed the service with a smile, the food(had oysters), tr","useful":0,"cool":0},"zDLf6BWcz8Qbh6iXX0Puzg":{"text":"Great place. Worth the hike out there. Too bad not many tourists make it out here. Just le","useful":0,"cool":0},"S_fmLCF1Hf2syUeunCPVjQ":{"text":"Went here for lunch with a huge group of people. I guess there was only one cook there tha","useful":1,"cool":0},"2fdFE7dVdAZpEdCqFAt_0g":{"text":"Great local sports bar just packed during sporting events especially football season. I am","useful":0,"cool":0},"qfZjTzk5Va4SKMyCHNICVA":{"text":"Local Hangouttttttttt!\n\nGo here for watching sports.  We went last night to watch Monday N","useful":1,"cool":1},"r0R8PKHCysXB4_aTgz-iWA":{"text":"Came to this place mainly because it was a 5 min streetcar ride from my place in New Orlea","useful":0,"cool":0},"J765_v368lqdkF1ZpTtxNg":{"text":"Wide selection of beers and the food is great. The buffalo chicken sandwich turned out to ","useful":0,"cool":0},"Zx9xW1N3b0M18_Bf2qHk3w":{"text":"Nigh-incredible menu of beers, bottles, cans, and draught, but many are overpriced so be c","useful":2,"cool":0},"KfwzU80TIQp4NqDDGXsecA":{"text":"Ate the raw oysters there twice recently at lunch and the place was full of other oyster e","useful":1,"cool":1},"q5NJqy-0Pt-iPZ5JtMw8gg":{"text":"Came here in college when it had the \"world's 4th largest beer selection\". I recently rent","useful":0,"cool":0},"17l8m3KqXjdXK2SKAHShHw":{"text":"Definitely my go-to sports bar in the city. There are screens everywhere, food is good, an","useful":1,"cool":0},"WbmkgATRKoMeWlKmw14KtQ":{"text":"Decided to go on my daily run the other day and lead me way down st. Charles.  I was caugh","useful":0,"cool":0},"-xNJZ7yngUyzqckytRZBRg":{"text":"Great oysters on the half shell!  We went there recently to watch the LSU game and had a g","useful":1,"cool":1},"76KzVnhD8fTkPB9FWxRpxw":{"text":"Great little neighborhood bar just at the intersection of St. Charles and Carrollton with ","useful":1,"cool":0},"91w9uTYYkhWIZGnkoW1dIw":{"text":"I love trying a great beer I've never heard of, and that is DEFINITELY an option at Cooter","useful":1,"cool":0},"8UgNkUpeoUPw6JvKWIOROQ":{"text":"Great Po'Boys and reasonably priced drinks.  The seating is terrible though.  It's a fun p","useful":0,"cool":2},"wI5JALZFuHWieUV6hJx94g":{"text":"This is a great spot to watch your favorite team or to get some oysters.  The food is pret","useful":1,"cool":1},"69uAtTA5RU8nZTPMSdOpEg":{"text":"This is one of the best restaurants for bar food Uptown. It's so delicious. The Streetcar ","useful":0,"cool":0},"-DGf72eXBoXd_-0ehXBwEw":{"text":"Might've been good for drinks but to eat at? No thanks. \n\nWe went here one afternoon to me","useful":1,"cool":1},"oez1AvsCZY67SB0Gy4ZzGw":{"text":"Had the crawfish special, it was awesome, had a nice spice (a beer will be required to pro","useful":0,"cool":0},"asgSFE09c522CRaf1di-kg":{"text":"One thing I love about New Orleans is places like this. If you want a drink go to the bar.","useful":0,"cool":0},"Sw9bkfXtZ1kZrEP27EK2Bw":{"text":"I had been looking forward to my first Po-Boy for months before hitting the Big Easy for t","useful":0,"cool":0},"UcZCRIFn7CN7StxtAIkHLA":{"text":"Review only for food - Came here on a saturday around 12:30 on my hostel's employee's reco","useful":2,"cool":1},"2QloYxlC6ppRLTfDM4aMYg":{"text":"being a foreigner, i am still amazed at the simple beauty to be found in NO.  one of my to","useful":1,"cool":1},"SBsj8pu7SVL4XU2cQDogFw":{"text":"this is the ONE place in New Orleans i visit every time I'm blessed to be in the big easy,","useful":0,"cool":0},"VbyXuiSpTF_XSpWLF-8v0g":{"text":"Orders were taken quickly and food was plentiful. Atmosphere is not like a modern sports b","useful":0,"cool":0},"zjZagK3sWpkLeP-imG6j9Q":{"text":"This place is GREAT. I had the habanero wings and some fries. The beer selection is excell","useful":0,"cool":0},"MK-7u_TjUGyT0oiJ6UQHdw":{"text":"This was my first trip to New Orleans but I was lucky enough to have a great traveling com","useful":0,"cool":0},"25JawzLP5Sz-U7bZiOGjnQ":{"text":"Amazing beer selection. Great service. Food is always great and fast. Can't forget the raw","useful":0,"cool":0},"4uk9v_IrOixGbStvBcMREA":{"text":"Are you freaking kidding me? $3.75 for a \nf$&king Miller Lite? What? Do you think you are ","useful":3,"cool":1},"5kVcgFfdpAcyo06WMbxnPQ":{"text":"Fresh shucked raw oysters, every kind of liquor and beer you can imagine. What else is the","useful":1,"cool":0},"yb3Uvtczdm86joK4e6ac8A":{"text":"Ok this is really 3.5 stars, only because of the inconsistency of Cooter's (pardon the pun","useful":0,"cool":0},"NMmd4Hmae_n4jfE1tdTXkA":{"text":"The cheese fries are absolutely perfect, and the Bartender's Special is out of this world!","useful":1,"cool":1},"Wtt1V5w8wMAB8-22YDdGdw":{"text":"This is a great bar for sports watching. Our little group has been coming to Cooter Browns","useful":0,"cool":0},"mITav__q6hyqf0mgykhdgA":{"text":"Sports bar with a TON of beer available by the bottle. Lots of draft too including Chimay ","useful":0,"cool":0},"-vJa0TNzhUxHsfGOZwkxKA":{"text":"I'm so happy that Cooter Brown's brought in a new chef and upgraded their menu! I could no","useful":0,"cool":0},"AFI_0j2uSmQwOuXyv4GPzg":{"text":"Very impressive beer selection, both draught and bottled, coupled with great sandwiches an","useful":0,"cool":0},"L-cgLI7GDFv89QaAo48q7Q":{"text":"Love the food and beer selection at this place, but I'm not sure that we will be going bac","useful":0,"cool":0},"ysjrP-H3BdZfdfKN0ZdWfA":{"text":"I had the catfish po boy and buffalo shrimp. The buffalo shrimp were GREAT! \n\nHowever the ","useful":0,"cool":0},"BTX3dTHSKS5B5cCPvnDk0w":{"text":"I really don't know where we were walking to when we took a hike to Cooter Brown's. \n\nWhy ","useful":1,"cool":1},"zAr8SYHC44vTc49OR2BTlg":{"text":"Enjoyed the experience! Ken was an outstanding bartender. Food was excellent! Will return ","useful":0,"cool":0},"puDTNpfjaHjjq6PFuzFovQ":{"text":"As a N.O. ex-pat I'll stop in from time to time every couple of years or so. Cooter's was ","useful":2,"cool":0},"iZxyQNe56ZXu91qJNf0rMg":{"text":"I can understand the mixed reviews about this bar.  The service could possibly get under s","useful":2,"cool":1},"F8J7iWvgvJVzmkY7SkzCGA":{"text":"Stopped in here for a drink and enjoyed it. The bar has a nice laid back vibe without bein","useful":0,"cool":0},"Jx26DePaDRZDxxATg0yS2A":{"text":"Every time I come here I stick to my Reuben. I'm not one to not venture around a menu tryi","useful":0,"cool":0},"dPyHBeLcUXGC3IQaRQCzZw":{"text":"DO NOT EAT HERE. The food was SO BAD that I had to make a Yelp account just to review it t","useful":0,"cool":0},"o0QoorzAHLgY774E4QAJFA":{"text":"Great place to watch the Saints game if you can find a seat. Definitely packed, and I wish","useful":1,"cool":1},"g3pqqP7EEL6OnT5wk8etzg":{"text":"GREAT OYSTERS! And their Blu Cheese Bacon Burger is delish! Great place to kill some time ","useful":0,"cool":1},"suhCuo6ZZdenxqpNqvy_Nw":{"text":"Under new kitchen management! The food is off the chain! This is one of my late night food","useful":0,"cool":0},"0i-wIq2z0-Y7AjG_uz4d-w":{"text":"Cooter Browns is one of my favorite bars. It's just simply a great bar just to go to hang ","useful":0,"cool":0},"5xMgbT0x5JR6p6crTJy3bA":{"text":"After reviewing the menu, we were excited to try both the beer selection and the food. Sad","useful":0,"cool":0},"hz_OHpAhE3RRR01k3EyYIA":{"text":"Cooter Brown's might be the best bar in New Orleans: incredible beer selection, outside se","useful":0,"cool":0},"iRCP5DD-8cMV9gWmto9RJg":{"text":"The roast beef po boy is awesome and the house made pickles and veggies are delicious! I w","useful":0,"cool":0},"yE1XFqOBgAvKUoOHmb4YIg":{"text":"It's everything you can expect from a place called Cooters. The bartender was friendly, to","useful":0,"cool":1},"rvvK5JoGN-Qpun6uwFEIuA":{"text":"This was the perfect place to watch the Golden State Warriors rout the Rockets in game 3 o","useful":0,"cool":0},"ryb1YCcEVa9fbnIP4LNGsQ":{"text":"I n every town I've ever lived, I always wanted to work a local job.  I mean a job native ","useful":4,"cool":5},"JiquGIFUc6STwByNvjsJ7A":{"text":"Cooter Browns is an alright bar Uptown. There are plenty of other bars that I would choose","useful":0,"cool":0},"WZYuID_uzUtSl9DJkBky6w":{"text":"pretty amazing sports bar and a must for days with either multiple sporting options (i.e. ","useful":0,"cool":0},"dDbfJUCCRWg-hD-TWp4uJg":{"text":"Beer selection is ok.  Most of their beers are actually in bottle and there is no telling ","useful":0,"cool":1},"sIfclbdUEHmIkayPkiP_-g":{"text":"Jumped off the streetcar to grab a bite to eat - first time at this place. Nice place and ","useful":0,"cool":0},"TBAymhEVsXCZI8EKToLzhw":{"text":"Massive beer selection and solid food. \n\nFavorites are: raw oysters, Nola Philly, Bayou Ph","useful":0,"cool":1},"Y6GpauTsXBnpPtfpVSD1pA":{"text":"Good bar food. Over 100 beers\nI recommend the wings and beer of course. \nLots of large scr","useful":1,"cool":1},"3n7_CvLd3cuI9fDqXx9N8g":{"text":"So we dropped in for a beer and to catch up on the Saturday football scores.  The beer was","useful":0,"cool":0},"6M94Duvc_1-cnGST2Lyy4Q":{"text":"Now walking in here you'd think that you found a fantastic spot to have beers, watch the g","useful":1,"cool":0},"fRlm8fz5NMjhWg_4b6Cbwg":{"text":"Found this place by accident. It's the perfect sports bar that serves oysters. The staff i","useful":1,"cool":1},"IN11-adnINo42VBNUR2vNw":{"text":"Cool little sports bar with a nice laid back atmosphere. They have two separate bars - one","useful":1,"cool":0},"VOwIgl3IEvoRKwsnGpNeFQ":{"text":"I really want to give this place a better rating but I just can't. 2 stars go to the bar a","useful":1,"cool":0},"oTb2yTTf4UEjFnvuGAVE4w":{"text":"Um, yea. As the 3 Star rating defines, it's \"A-OK\" for me. I'm not a fan of places that ar","useful":1,"cool":1},"tGyx5fpfMbcKBFfkJ36Gtw":{"text":"great drinks and good food,  i love their alligator sausage po boys. perfect place to come","useful":1,"cool":0},"T8JrJEET43S7xATaUEvERw":{"text":"One of my favorite bars in New Orleans ! Great food and beer selection . Prices are reason","useful":1,"cool":0},"FA8DeCrIrCSC490p-2PAXA":{"text":"One of my favorite bars in New Orleans ! Great food and beer selection . Prices are reason","useful":1,"cool":1},"cQOKTj4LDYiiIcZABGgY-w":{"text":"Definitely a great hangout in uptown NOLA.  I frequent here with friends just to grab some","useful":0,"cool":0},"aKDjTXwgcKIE_ey6JAD_LQ":{"text":"I'm back! The bar is still great-a solid 5 for beer selection and sports watching. \n\nBut, ","useful":0,"cool":0},"dCtE6jttcXhitX0t_Csoig":{"text":"We came here one day after my son's baseball game. I wasn't too thrilled to be dragged int","useful":0,"cool":0},"dzmvQUoJODolBnSFVzsRZQ":{"text":"Wow did Cooter Brown deliver. I arrived late to NOLA on a Tuesday night around 11pm. I was","useful":0,"cool":0},"UDuugGEMSdIF6MtDgU5L0A":{"text":"Good place for a larger group. Lots of space, and many many beer options. There is a ton o","useful":1,"cool":0},"6VW-ZPClvPk6V0_O12jpKw":{"text":"Now this place knows how to do it. Especially for it being so close to college campuses. L","useful":0,"cool":0},"d__rUdgMgl9rAsw1kQZScQ":{"text":"it's a bar.  with lots of different beers.  smoking allowed.  lots of tvs for the viewing ","useful":1,"cool":1},"s91z5HcJMObpA8x1rleHJQ":{"text":"Only one reason to go here - nostalgia.  Dark inside, multiple screens for viewing the day","useful":0,"cool":1},"bgp2fvMUTs6xTdMOYY_z5w":{"text":"Absolutely the best Muffaletta in New Orleans hand down!!\nIt is a little shady on the outs","useful":2,"cool":1},"UiBqFlAJYy7wFsp8UoY5kA":{"text":"Very friendly staff and neighborhood attitude. Enjoyed the po-boy and fries. The cocktails","useful":0,"cool":0},"_2LnKQLJHAySaz9DKDUMkA":{"text":"After an 8 hour layover, a 1 hour flight and another 45 minute commute, all I wanted was o","useful":2,"cool":4},"9Vjg41Mkfjn6ZtflF5scUA":{"text":"Great selection of beers on tap, and the Bayou Philly never disappoints. Gets crowded when","useful":0,"cool":0},"d5wzUg0hJ578TsGQOL2q9Q":{"text":"For me there is no better place to watch an LSU away game!  If you get there early enough ","useful":4,"cool":3},"19gftAHY0BSo3_J0pl_j7g":{"text":"Great place to watch games and the bar food is delicious.  They also have a wide variety o","useful":0,"cool":0},"WhSVFu40ZZ42sFeCwX4Qpg":{"text":"Yes, lots of beer. 400 kinds? I didn't count.\n\nFood was okay-to-good. A very nice poboy. F","useful":0,"cool":0},"i9xLeCYTs82luElhcl1zoA":{"text":"Great beer bar. Big screen Tv if like sports. Outside seating. Big fan for years. Tons of ","useful":0,"cool":0},"-kj7rmrWeDCEJ98sYcUEYw":{"text":"Distinctly New Orleans I suppose.  This place has a quasi-feel of a bar in Center City Phi","useful":1,"cool":1},"5CI7lCCKNOZMhNPM0nC29g":{"text":"Zonk out the tip field if you pay for bar food with credit card. Mother truckers will fill","useful":1,"cool":0},"zy1P5-XwUmv-ZK0eu21zvw":{"text":"Great beer and good oysters - pretty good bar food otherwise.  Usually a fun crown and fri","useful":0,"cool":0},"oepMgKo0z_1iSnavH37EeA":{"text":"Great place for sports! Awesome beer selection, great social seating, and awesome bar food","useful":0,"cool":0},"fygMbtLWwOOWE0TloWULGw":{"text":"Friendly staff, fantastic beer selection, and plenty of screens to watch any sporting even","useful":0,"cool":0},"uYjhOuIrwru7CaWQZP2G1Q":{"text":"I've been to several oyster happy hours around the city, and Cooter Brown's serves some of","useful":5,"cool":2},"LQtKx_j8Sif1Bdf1f45GXA":{"text":"They have friendly bartenders, and good selection of beers. The place is spacious, and the","useful":0,"cool":0},"Rd5cZbpAcWhFnTPFQXPyLw":{"text":"Service: bar crazy slow. Cooks are good. \n\nGreat muffuletta and alligator sausage. Oysters","useful":0,"cool":0},"qwr5PLm_Q6OVb6p2X_Wv2A":{"text":"Excellent oysters and very good bar food.  And TVs galore. One of my favorite sports bars","useful":1,"cool":0},"FPagl6I7S8zbAWGMpcRvaQ":{"text":"Cooter Brown's is good for what it is: a sportsbar dive with great fried seafood. Expect a","useful":0,"cool":0},"M6yp_oH39kRywzTFGHFY3Q":{"text":"Over-priced and gross food. Watered down drinks. I could elaborate further, but it's barel","useful":1,"cool":0},"FyBEiooiZkqdeTxyEobpig":{"text":"Love the food but have never enjoyed this place as a hang.  Hard to have any sort of conve","useful":0,"cool":1},"IbaRhyY0qiDtPFZ-7xoVcA":{"text":"I'm not much of a beer drinker, but my go to dive bar in New Orleans is still Cooter Brown","useful":0,"cool":0},"L1iPS3yEpRqFE7JEhTkE7Q":{"text":"Raving about the oysters. They were incredibly fresh and we enjoyed them. You also can't b","useful":0,"cool":0},"zMN7CvEbsjgP7_reXgS9dw":{"text":"Went here on my last night in NOLA. It wasn't very crowded at all and we were greeted by g","useful":1,"cool":1},"KfONurrOXeQAMwpkd28w0Q":{"text":"Back into CB for the first time in several months.  Party of 4 looking for a place to watc","useful":0,"cool":0},"Sc2SeRbHXnvYwui0rsesyQ":{"text":"As a disclaimer, I've only been to Cooter Brown's during the day, when the dust & dirt are","useful":0,"cool":0},"p7rET3Yz9Z-m_Uyi21Dnrw":{"text":"Why is it so hard to find decent late night food in New Orleans? For a city that never sle","useful":0,"cool":0},"dTo2RF9k6PCLVA2thQKSIg":{"text":"Stopped in for a couple beers. Cool sports bar atmosphere. Huge selection of beers, both i","useful":0,"cool":0},"W-gnYUyVJgUiCXrz4S4pRA":{"text":"The Tito's strawberry- basil lemonade was amazing\nAnd only $5. The food was fresh and deli","useful":0,"cool":0},"HMe5VpxoJ5Ya4vRZXe6WWQ":{"text":"Cooter Brown's is the epitome of rude, tourist centric, non-repeat customer service.  The ","useful":1,"cool":0},"iD_QO6Yvv_xlQyWHRozOaw":{"text":"This was our go-to sports bar when we lived in Riverbend. They have a ton of TVs, a great ","useful":1,"cool":0},"t7my2R3MlmRH7kX7uG5xMw":{"text":"I have zero idea what neighborhood this sports bar is in since we took an Uber to meet fri","useful":0,"cool":0},"eHcAByYRpnwDext5YxcxLQ":{"text":"Nice local and some tourists as well. Food is great and huge selection of beers. Great pri","useful":1,"cool":0},"l7Kh8SQz7bjzIdLGlz5C_A":{"text":"One of my favorite po boy spots in NOLA. Huge TV's. Lots of sports!!! Great drinks, Fresh ","useful":1,"cool":0},"cURJrw7YbJroEnBXnuIgWw":{"text":"Coming here may have been the highlight of my trip to NOLA. Seriously, if heaven is anythi","useful":0,"cool":0},"7HbVNIHAYr-_UjxZ0GSiLg":{"text":"Had a few good times here watching ball games.  When it's crowded and a popular game is on","useful":2,"cool":2},"kKQyc20bCn3TJ3kVBb-wkA":{"text":"OH,WHAT FUN !!!! \n  I went to Cooter Brown's last nite- hadn't been there in AGES,& forgot","useful":0,"cool":0},"8kEbOVve1vriYbxZFEt--g":{"text":"Went in here for a quick and simple meal on a Sunday. I wasn't expecting much in terms of ","useful":1,"cool":0},"CvR9zGRrW1AmVpAguyIkuQ":{"text":"Fabulous fried oyster po'boy!  We were hot and tired from a long bike ride; pulled off whe","useful":0,"cool":0},"xFluuKuiuykyqSbe9eo-hw":{"text":"The best beer selection I've found in the city. 86 rotating taps and extremely knowledgeab","useful":0,"cool":0},"owPDL_QmvgXa0kwN-i3OkQ":{"text":"WTF HAPPENED TO COOTER BROWNS ???  It was my FAVORITE place - it was FUN & everyone,includ","useful":1,"cool":0},"dWKbupqp7qXps7C0efc2QA":{"text":"A great place with oyster love the fresh horseradish there. I usually eat outside there be","useful":0,"cool":0},"bL1-FF3SGqpkusirfDi9rw":{"text":"Friends recommended Cooter Browns as a good March Madness destination - and we were not di","useful":0,"cool":0},"59jBZlpO5kOaSJ-BNqwWkg":{"text":"Good bar to go and watch a game at with a group of people. There's a lot of TVs and a good","useful":0,"cool":0},"yStUE-QdIxiefUWtqP5l_Q":{"text":"Great beer selection. Good prices. Try the fried mac and cheese. Only bummer is the a**hol","useful":0,"cool":0},"w-JKBgN7dC_XnNhv3tUu7A":{"text":"Horrible service and the food is tragic. You have to know what you want almost immediately","useful":0,"cool":0},"H5BC5PZe4vWTnNIMjtv5VQ":{"text":"Heard amazing reviews about this place.\nSorry, we were disappointed!\nThe wings tasted just","useful":0,"cool":0},"dhmIFPsGLIBu1V4E3KgVPg":{"text":"Great place to watch any game or fight. Open late with pool tables and FOOD!","useful":0,"cool":0},"cnDOpreRrAfTnmMzQyIWCw":{"text":"Awesome place to watch sports, great food and great people.","useful":0,"cool":0},"gb-Npg_5Y9PJsfYtPjnMdw":{"text":"This is my first time at Cooter Browns. I have to say parking is limited but we can defini","useful":1,"cool":0},"N147EEQ67BEqlzXMjceyZQ":{"text":"Delicious and fresh food. Ordered fried pickles, green beans, onions, boudin balls, bacon ","useful":0,"cool":0},"kNV74LPyndAqkTQSnYug2Q":{"text":"They have a great beer selection! I'm not a fan of most beers but this is a good place for","useful":0,"cool":0},"cSxwp86zYiCGPRQfoX5WfA":{"text":"While the beer list is quite intimidating, it's excellent for people (like me) attempting ","useful":0,"cool":0},"DgytRKJV264MMyBXmfbxsA":{"text":"Came in for lunch and ordered fried shrimp with cheese fries instead of regular fries. The","useful":0,"cool":0},"II6rI9JktzRDUqh3z8lRmQ":{"text":"Can you still smoke in bars!? Yep, you can...in NOLA we make our own rules. So, if smoke b","useful":1,"cool":1},"x9Yda-IjHKHUaBlTp-nz9A":{"text":"This si probably my favorite bar in the city. The beer selection is great and they frequen","useful":3,"cool":0},"SGLTyZ8iGbA0-xV9abfoOQ":{"text":"Great shrimp poboy for a Texas boy. Overflowing with crunchy coated large shrimp Awesome e","useful":0,"cool":0},"ngFxuYKc5uVfGV14VY2JXQ":{"text":"Best burger Uptown!\nFries are weird fried potato chips, but pretty good.\nGet a burger here","useful":0,"cool":0},"EzAiIDU2KR8c3WaMp95uiQ":{"text":"Great beer selection, oysters aplenty, and hot food from the grill. My favorite were the d","useful":0,"cool":0},"Udye7IEQK130KAARqDCq2w":{"text":"Food was ok, great beer selection but very expensive for uptown. Cramped feel with so many","useful":0,"cool":0},"mnxYIPRbg9k9JTwE4koMBQ":{"text":"Ceaser E learn correct grammer. If you are going to respond to comments and block the resp","useful":0,"cool":0},"KlPCOabuqi12axWfZ2pmZg":{"text":"I remember eons ago having late, late nights at Snake and Jake's that led to late mornings","useful":1,"cool":1},"0VSg4IolbmQxVikuEI7JcA":{"text":"Cooter Browns is my go to place to grab oysters, I must get them here at least once a week","useful":0,"cool":0},"ORRNp_OATdJuKlGBvf04HA":{"text":"This is a great bar and restaurant for the locals. The food is spectacular and both the fo","useful":0,"cool":0},"fUOLdbPSqqHp1kos8MvVoA":{"text":"This used to be my favorite place to go after work. Now their food isn't as good. I ordere","useful":0,"cool":0},"RK87m6KiFVXpHmC2Zhk9uQ":{"text":"It's been a long time since I been here but I must say the they have the best horseradish ","useful":0,"cool":0},"W65xX66PX0yKYVWX8ancPQ":{"text":"Great selection of beer. Bartender at first seemed more interested in watching the game th","useful":0,"cool":0},"9lzMi6xnfCCWQ7KWXtylHQ":{"text":"\"5 stars?? Really?? Nick did you hit your head??\"  \n\nCome on!  it's a bar.  Lets give it f","useful":6,"cool":6},"fsN9qJjhHbn90rlTNEdsdA":{"text":"Went to Cooter Brown's just a few weeks ago. Now, I will admit, my review is a bit skewed ","useful":1,"cool":1},"trGkbSYvHtYOzcpHU-1zyQ":{"text":"If you like a mind-blowing selection of beer, and home cooking, this is the place for you!","useful":0,"cool":1},"9BKrs58aJHzDczKwGwD9YQ":{"text":"I love this place for football.  Swooped in today for a quick lunch and got the blue bacon","useful":0,"cool":0},"E4SuZWs2IZsPH5exeaZJKA":{"text":"getting better. food is a LITTLE less painfully-salty than it was a year or so ago.","useful":0,"cool":0},"zTVnJ8xvIq_qZyLxfV2hEQ":{"text":"Here on a jazz fest Saturday night. 845. Great beer selection. Oyster guys do it well. NO ","useful":0,"cool":0},"A1bnN2hS889Qm7YdSr8HUQ":{"text":"I like this place, When the back bar is open, this place is better than Avenue Pub.  \n\nI l","useful":0,"cool":0},"i-zaACq6l2BLH5Q5a_m_NQ":{"text":"thank you,whitney !!!!!","useful":0,"cool":0},"kUgwITlt1ZZ2GHbS8qe9_w":{"text":"A generous 4 solely based on how bomb my oyster po-boy was! Freshly made and right off the","useful":0,"cool":0},"EVYQ-Of_UAEgcVWD1r568w":{"text":"Wow. Creative menu and delicious oysters. This place is old school and ultra casual. No wi","useful":0,"cool":1},"6ueDQFNNWrMQWyhYNNeOVQ":{"text":"LOVED It here! Excellent oysters, extremely friendly staff & awesome music. Had a blast!","useful":0,"cool":0},"8gspR3tQfg3fnXEeELNIgA":{"text":"Great little neighborhood bar. Both the drinks and food are good for a late night. \nI got ","useful":0,"cool":0},"21w1jZXRqQyfqsFF3nIErQ":{"text":"Maybe it was because we rolled (literally) into Cooter Brown's after an epic face-stuffing","useful":2,"cool":1},"W0sZR8G_S4wAKr5W317C9g":{"text":"This place has the best bar food in New Orleans. Hands down. Such a classic place to take ","useful":1,"cool":0},"m22U9ZzQR7cU7bu2pleNog":{"text":"It's been a while since I've been back to Cooter Brown's. It was much different time and I","useful":1,"cool":1},"Ugk9Lg6Ny-xnVKO7CtoEpw":{"text":"Great bar ambiance. My girlfriend and i went there to check out the kickoff of the 2015 NF","useful":0,"cool":0},"be33h4elvBeUSqMWWg2jdA":{"text":"I'm come to New Orleans twice a year for over 5 years...and never miss coming here each ti","useful":0,"cool":0},"NqQmYDmhoulb37SzsPcvYQ":{"text":"This place is pretty good because of their wide selection of beers. It's also good if you'","useful":2,"cool":1},"j8yXw4261JZ_l8t5YXDs5w":{"text":"I ended up here sort of by accident after roller skating around Audubon Park the other aft","useful":1,"cool":1},"bV-wEyg_V4MucjSD7nlnzQ":{"text":"A sports bar with a ton of beers. Easy enough. Cooter's also has a decent kitchen - oyster","useful":0,"cool":0},"MJ2ZnnL03xmUu4aiOmRJtA":{"text":"Ok - I'm an oyster snob. So we have that out of the way. But my wife and I drive in for a ","useful":0,"cool":0},"UtNwdOB5fYsNeY5p5FsqJw":{"text":"This place is as \"bro\" as it gets, but the food is good and affordable. Just be prepared f","useful":0,"cool":0},"3B4r9CDGsVwzjp9vRMTmLA":{"text":"Now no smoking. Great draft beer selection, awesome cheese fries and burgers. Great neighb","useful":1,"cool":0},"DXhuhgsTpz8sFZDhKgT5bQ":{"text":"Tonight I placed a to go order for chicken fingers and upon biting into them realized they","useful":2,"cool":0},"Z0CJeK9puoaVw84KgfmRjg":{"text":"** 3.5 stars **\n\nAn unassuming neighborhood sports bar that also has an outstanding and ex","useful":0,"cool":0},"J5rMUazfa_6br4qvWL-Kww":{"text":"Raw Oysters!!! They're good here. We ordered 3 dozen. You order the oysters near the bar, ","useful":0,"cool":0},"i18z-T44NOG2ljvLh8sdoQ":{"text":"Two stars for beer selection. One star for the hot food. ZERO FOR OYSTER BAR. \n\nThey're al","useful":0,"cool":0},"z2_kLfpInPa5hjiORuwvAg":{"text":"Awful, over-priced hell-hole.\n\nThe bartenders are widely known to be some of the rudest in","useful":0,"cool":0},"GBVxz0Ux2OeCoxuo_5ikKg":{"text":"This will always be one of my favorite taverns. They have an awesome beer list. And all qu","useful":0,"cool":0},"bBq8W8qdlqZzISfV7vZWmQ":{"text":"Service is ok. You have to order beer and food in different places. The corn beef was dry,","useful":0,"cool":0},"vuZfyEvXAvYj0Su-lLKVFg":{"text":"Just who does that British bouncer think he is??? Does he think that he's better than me??","useful":0,"cool":0},"5reaEbW2JFmCN7WsmE5a-A":{"text":"Beer heaven!!!!  Hundreds of beer available, from around the world, bottled and on tap.  C","useful":1,"cool":1},"-v1VYyCP03mroAUBrSrjOg":{"text":"One of my favorite sports bars in the city. They make excellent sandwiches and po-boys, al","useful":2,"cool":2},"uu52o3m3dqkoozGQbD3rNg":{"text":"I'm a New Orleans girl. Born & raised, and this is one of my all time favorite spots for a","useful":0,"cool":0},"7t2o2FYT_UOsDTRoJBKFSw":{"text":"Finally got my wife to agree to go to Cooter Brown's, last time i was in the place was 27 ","useful":1,"cool":0},"T92_2uHVkTZ7phmnVr-P9w":{"text":"I ordered the Radiator Special, which is my favorite poboy here. The sauces are delicious ","useful":0,"cool":0},"EEDf78jsj9RfANhZgMtNpA":{"text":"Great place to stop and have any type of beer you can think of.  They have over 100 beers ","useful":0,"cool":0},"ME-pd8CNXQqDzR-Jhj3fcQ":{"text":"decent dive bar at the end of the St charles trolly line. cheap drinks. dark atmosphere. t","useful":1,"cool":1},"eBLePGHGErSZYC16tZGSJA":{"text":"Cooter Brown's is my go to place for oysters.  I used to be one of those people that swore","useful":0,"cool":0},"KW34jqv95lhKk94-OLk2fg":{"text":"Review for drinks and ambiance only:\n\nMy big party came here for a round of drinks at our ","useful":0,"cool":1},"YOFnFjuujFFpYRv3FGFaDQ":{"text":"Some of the cheapest (and best) ersters in the city. Epic beer selection as well! I love t","useful":0,"cool":0},"L1_a_mXyI2su4EOAxoHkFg":{"text":"pretty much experienced everything everyone else said. Our first meal in NOLA because of p","useful":0,"cool":0},"uPuIaKtXR_RXrvitByBkiA":{"text":"Maybe a new class  - dive bar with enormous beer selection, great oyster bar and enough TV","useful":2,"cool":1},"P2UQx_kZMND2p5VM9Z5Xqg":{"text":"went with friends who have a relationship with the bartender. i put up my card for the dri","useful":0,"cool":0},"gdkzsCU4NE_ehoiu3OBZlQ":{"text":"If i could give this place a zero I would. They were rude, obnoxious, and disrespectful. D","useful":1,"cool":0},"cjsyCajM1xed5UCZPdZ_QA":{"text":"Cooter Browns. My ex loves to call me up when he's friggin drunk and hollar at me to meet ","useful":0,"cool":1},"c6AlBUkiuJC4aVrp-yhjWw":{"text":"Oysters, burgers, and steak sandwiches. Oh, and a great beer selection. Everybody loves co","useful":0,"cool":0},"edc0-9uQoXzGQn6nCpZQaA":{"text":"Best selection of beers and delicious raw oysters.","useful":2,"cool":1},"W2hzGkcFYC1AcHAAtLhkdQ":{"text":"HOOOOOOOORAAAAAYYYYY !!!!!!!!!!\nNew owners at Cooters- new attitudes st Cooters & new vibe","useful":2,"cool":0},"nkp8uXUHGhvrxuTZI_r1Lg":{"text":"Great place to catch multiple games at once as usually needed with fans from different col","useful":0,"cool":1},"quYwy1oeQmpmo0RvgVggLA":{"text":"Great date night! This is such a fun bar. The drink specials are fabulous. The oysters are","useful":2,"cool":1},"dzB03zYqZnM54FR8u5qgog":{"text":"Really loved this place! 6 of us came here for lunch and drinks, and we were lucky enough ","useful":0,"cool":0},"ZGeL11QaBn5rZW0ra2QTCQ":{"text":"An uptown institution, Cooters maintains a holy trinity of dozens of ice cold beers on tap","useful":1,"cool":1},"ea_AoZazq7VDqeyZD84NHA":{"text":"How can you go wrong with a tavern that rocks the name 'Cooter Browns\"?\n\nHad my very first","useful":0,"cool":0},"JS1CyKn9TLrDnkuiUO3EcA":{"text":"As a local I'm very disappointed with the kitchen staff.  Bad attitude when I called to or","useful":0,"cool":0},"vmXfD-4uJW71WnxCZO2JbA":{"text":"Very tasty cat fish & po-boys. Great portions. I didn't drink but I did see their excellen","useful":1,"cool":0},"JW4_JbjE7q6iL1v5-NLhzg":{"text":"We go here to watch the games on Sundays, that will no longer be the case. My husband orde","useful":2,"cool":0},"sOeXXlmgMMb8a43jAeVtTg":{"text":"Lot's of TVs, good beer, good food. Really not any need to say more!","useful":0,"cool":0},"JHpScxlQXeyLZwu9AhdE_A":{"text":"I stayed with a friend in New Orleans for a week, and he lives a few blocks away from Coot","useful":1,"cool":1},"rwSNMrxZsCBk7A9jLKBUHw":{"text":"Cooter's is my favorite sports bar in uptown Nola by far! It has everything you need: all ","useful":0,"cool":0},"mlVHX34ed9j93VVaVoP5dw":{"text":"GREAT place to watch a game or just grab a few beers. They have a ton of food and drink op","useful":0,"cool":0},"JlKPdbFU_3dn0XXMOFpzfQ":{"text":"Under new kitchen management! The food is off the chain! This is one of my late night food","useful":1,"cool":0},"njfJBRzx0CbaUAaDP35K2g":{"text":"Cooter Brown's is a great place to enjoy the game or some good bar food and beer with frie","useful":4,"cool":2},"j3IC9MymFqZbhliVjSkXmQ":{"text":"If you are my friend, and you are coming to New Orleans, you can definitely schedule a lun","useful":10,"cool":6},"ONR8WRwYlB4JomoDneTHmA":{"text":"Not the same as it used to be. Poor quality food and even worse service. Kitchen staff was","useful":0,"cool":0},"Cp0iOX1RN28EotTNsWaMpg":{"text":"Frank is one of the most attentive bar tenders I have ever met. His knowledge of the beers","useful":0,"cool":0},"rB2ZARPCcb3KsNGmIwXf3g":{"text":"Good place to watch sport games and drink some beer. Awesome happy hours and my opinion, t","useful":3,"cool":0},"5N8H6lJ-iUxKXE1Cyfj-9A":{"text":"This was a nice, cool respite from the sweltering afternoon heat. Jumped off the trolley c","useful":0,"cool":0},"70-QZ0c6ANWckmkNR258vA":{"text":"definitely have to be in the mood for TVs when you go in here, but it's a great spot to wa","useful":0,"cool":0},"ba5r9rCfUyg5uD7mv8R5RA":{"text":"Crazy loud, but it's a college sports bar.  They have Restoration Ale on tap, plus any oth","useful":0,"cool":0},"jL4qlSf6O4uhELU_Caycfg":{"text":"I should really come here more often; my friend says that this is a spot were the ladies h","useful":2,"cool":1},"YFH29KFT8gmgknHOyGQ90Q":{"text":"3/5 solid option\n\nnot my first go-to (just since it's a little far-off), but a great spot.","useful":4,"cool":1},"a2uu44n0Ay5ot-nhOHbFuQ":{"text":"I've died and gone to Beer Heaven. Over 400 beers available, more countries with beers tha","useful":1,"cool":1},"Z3GoarpiEv0MBXsqCYIXTw":{"text":"It's hard to believe how cheap raw oysters are in this area. Under a buck an oyster shucke","useful":2,"cool":1},"RHwiXG3Y6Ybmb8bPpMkn1g":{"text":"Are you seriously charging me $0.50 for placing a food order over the phone!!!!\nAnything t","useful":0,"cool":0},"ZZCb2hZ-XXePkDNbYK0RGA":{"text":"Maybe it is the fact I was traveling with several of my boys for jazzfest...maybe it was b","useful":1,"cool":0},"GpmsoeBVW589ciVvcZeyXA":{"text":"Stopped in for lunch while visiting from out of town. Great beer selection. Philly Was ama","useful":0,"cool":0},"GZCTrBeWjBAMhGDwx4PFMw":{"text":"This is the place to go if you went to a big sports university and it wasn't LSU.\n\nYou wil","useful":0,"cool":0},"9Ux_Bmu1gWCo5Jf8Latasw":{"text":"We love to ride our bikes over to Cooter Brown's and share some oysters and beer. Their IR","useful":0,"cool":0},"mbqT7jRsz6-89_sPSzSymw":{"text":"This is where me and my wife met and is a favorite spot for us. The food is great and the ","useful":0,"cool":0},"PyLsIO05O_BRme6MDKGAmw":{"text":"One of my favorite bars to go to in New Orleans. The food is really good and not a long wa","useful":0,"cool":0},"0UVuUhd8io6nhpkCl53j-Q":{"text":"This place has made some great strides in the last few years. It was always the place to g","useful":1,"cool":0},"EOYBV8N9R6KyMxiihc_FoQ":{"text":"If you want to watch the game in New Orleans, and \"the game\" isn't the Saints or someone i","useful":2,"cool":0},"z-UTyZ6qsIhSuWVr-NDsUA":{"text":"Here's all you need to know:  Best. Barfood. Ever.\nWhile I'm sure it is contributing to my","useful":1,"cool":1},"I4yGPyao0h36uLG-XJbJrQ":{"text":"The pulled pork sandwich was great. I was expecting BBQ sauce drenched pork, but it's not ","useful":1,"cool":1},"1I5TISRhrMnfm41dEAsDhQ":{"text":"This place was recommended to me primarily for their oysters.\n\nI can deal with the loud, t","useful":1,"cool":2},"YS9x_1qkVUn3KQB6gzfrXg":{"text":"Fun hidden away gem in uptown.  Great beer selection with around 20 taps and hundreds of b","useful":0,"cool":0},"lAgURTUY9FB7_-eiSIjkRw":{"text":"Still smoking in bars?? Damn you Cooter Brown's with your thousands of choices for beer. I","useful":1,"cool":1},"igrKOdd8Nqm9MzNRGpJRFw":{"text":"I came here on a Sunday night for a late dinner. I had the oyster poboy which was deliciou","useful":0,"cool":0},"EJIWz2BysQ-3oazAls9p1g":{"text":"I was craving a good burger and fries, so my husband suggested to get it here. I usually g","useful":0,"cool":0},"_qFD2NuAAlvgYAAvCywTvg":{"text":"If I ever choose to move to New Orleans, it will be the death of me: I'll either drink mys","useful":8,"cool":6},"497pv5YKKMCP6WYOAZ8axg":{"text":"good for sports, but the setup is just not for me. Wooden chairs are uncomfortable when wa","useful":0,"cool":0},"LckG-LDpVj06Uqx7n2nnGw":{"text":"Been here countless times back when I used to live in Mid-City and went to school (oh wher","useful":0,"cool":0},"qeMm_1uUgEUlwdjlHmwmRA":{"text":"I must have drawn the short straw here.\n\nMy burger had absolutely no flavor. Like they com","useful":0,"cool":0},"myIRPFPk15vtRTgWwYJIPA":{"text":"A fun welcoming neighborhood bar in Uptown. You can grab a drink and some good food, while","useful":2,"cool":1},"zevkHFOwAocqtq-p9ys6jQ":{"text":"Fried Seafood Platter is a little more greasy than what I'd care for and when you want to ","useful":0,"cool":0},"T-cpgAstMO87w0TdG-7niA":{"text":"This place is a laid back dive bar with one of the biggest and best beer selections in the","useful":0,"cool":0},"mYp_QqBTENObWL6aQHuL3g":{"text":"Wide selection of beer, oyster bar and delicious phillies. \n\nI highly recommend the Bayou ","useful":0,"cool":0},"bZC7oQJ9N66CgYvagaaORw":{"text":"Sports Bar and College Vibe aside, Cooter Browns has some of the best food in the city.  F","useful":1,"cool":1},"M48sveI08HC9OPaIleGi7g":{"text":"Had been to Cooter Brown's once before for a pint. Tonight I was there with some friends a","useful":1,"cool":0},"hT0fC72fENAhaipONaScWA":{"text":"Awesome local haunt. I always come here when visiting NOLA.  Local atmosphere with no craz","useful":0,"cool":0},"XnMTXuxmGIbi54rKMSm-0g":{"text":"Headed there on a Saturday afternoon to check out the Snooty Cooter...The two stars are fo","useful":5,"cool":0},"CJzG6DvmgJO2dq6zUSdC5g":{"text":"Just what you'd expect from a place called Cooter Brown's. Good bar food.","useful":0,"cool":0},"R5D2oABDNOMkgnqsbrcXcw":{"text":"Best remoulade sauce EVER.\n\nYes it's a little expensive to drink, but these people keep th","useful":1,"cool":1},"HNPEXk-qEmDm5i-3IhHgLg":{"text":"Awesome place with lots of TV screens to catch pretty much any college football game on Sa","useful":0,"cool":0},"trMFxY_OUI9SjaS7zvfShA":{"text":"Well...\n \n\nbesides the grim and debris build up on all surfaces this place has cold beer, ","useful":0,"cool":0},"CDup9p1b3tdn66M8uWDYIw":{"text":"Wonderful atmosphere. Great people. Went one night and realized renovations were done in t","useful":0,"cool":0},"RXw9Dih_IO1yGNISiLD2gQ":{"text":"What is wrong with you Helpers!?  Y'all need to rate this food. I'm a healthy California g","useful":0,"cool":0},"n1tpfzcXdh-m5xe9T-vLbg":{"text":"I was disappointed from the start.  There is very limited parking and no one to greet you ","useful":1,"cool":1},"bPQh6NTsOW7YWaWO55jtzQ":{"text":"I have only eaten food from here once and it was a \"to go\" order.  I was in the mood for c","useful":1,"cool":1},"eS8bev38nqWMWNVjJVbmzg":{"text":"A nice local Uptown bar to indulge in wide variety of beer, tasty oysters and one of the f","useful":0,"cool":0},"WiyGv8eo1oqOrBz9YgAghw":{"text":"ok more like 3.5 stars- the place is kinda like a larger cleaner dive bar than normal with","useful":0,"cool":0},"GxDZRihH8Fr-jtPKyuku0g":{"text":"Raw oysters on the half shell ... Fat, juicy, nice size, but not very briny. \n\nDeep fried ","useful":4,"cool":2},"C5KJ635OJ6ZY7Xiwlau4CQ":{"text":"Good local food and lots of beer. Many TV's so it's rather loud, especially during games. ","useful":0,"cool":0},"p9st9dEMQUtw4k4fOTKUqA":{"text":"Came over here on my trip to New Orleans. Needed a sports bar to watch college football an","useful":0,"cool":0},"ivxsmsC3-t2388mfnXexJQ":{"text":"Non smoking!  Love it. Great selection of beers. Comfy place to hang out. The place and ba","useful":0,"cool":0},"1coiwVbp72HPE8XyoHGCDA":{"text":"It's a dive, albeit a popular one. It's a greasy spoon, albeit with interesting menu items","useful":1,"cool":0},"YvBCsWlugllxTGGeZH6Trw":{"text":"At first you think it is a typical dive bar. However, the bartenders were great. They reco","useful":0,"cool":0},"A8XytMeNfhv_-V57kPHM-Q":{"text":"So this place gets five stars for overall experience: this is my new Sunday home as a Penn","useful":0,"cool":0},"cPfH3UaD7bR60adJsz6xgw":{"text":"Do you like fried oysters? Do you like fried shrimp? Do you like fried catfish? Do you lik","useful":0,"cool":0},"g3EZoTvWXJFgw8yekF9Fhw":{"text":"Great place, 400 beers and good eats.  Went in, got a pitcher and a few dozen Oysters.  Fo","useful":0,"cool":0},"CWLKp9G9A608gSnjkgLR1Q":{"text":"Cooter Brown's is local dive in the Black Pearl area. They serve a huge selection of beers","useful":0,"cool":0},"fGaT0DFu_7nC1f2pDiEm5g":{"text":"Friendly staff...you order inside at the food side then sit down and pick it up when ready","useful":0,"cool":0},"EuN1kQTXBDcE8Qs5iswrzg":{"text":"Last time I had their awesome cheese fries was 30 years ago in college days.  They were ju","useful":0,"cool":0},"vsysGLiU1NeNEWZJFV1eeQ":{"text":"Great beer selection and raw bar.  Also offers some fried fare and sammies that are quite ","useful":0,"cool":0},"3rNbM422eZc8WIK8vfpaGg":{"text":"This bar is great.  The seating is a little funky because there are just long ass tables f","useful":2,"cool":1},"U7QxCfzqtNgNIsY1X8yRFQ":{"text":"Cooter Browns would get a hire rating if not for the beer prices. My friends call it 'The ","useful":0,"cool":0},"dtGIUtrr-QM-vl4f6RpoYg":{"text":"A great place to go hang out and watch some sports on TV.  They have a great bar selection","useful":0,"cool":0},"KE62AA7yLeXudwQh-5YI9A":{"text":"I ordered the Catfish Basket with onion rings with a side of Hot Wings ! Overall pretty av","useful":0,"cool":0},"oP4BqpVIO7oHVC0KjxxiEg":{"text":"Up over by where the St. Charles streetcar turns Uptown.  Great beer selection, good food,","useful":0,"cool":0},"HODCsqlshpk45wvnWOz4zA":{"text":"Very fun bar and if you want to catch a game (particularly LSU), you might not find a more","useful":1,"cool":0},"qmBTsSiODpSpOH5Y8a_X1Q":{"text":"Man was I impressed by this place.  We literally got dropped off here straight form the ai","useful":4,"cool":4},"tTl8sJLSNTCxMk4NMVSOIQ":{"text":"A cool place to stop in uptown for a beer and the best roast beef po'boy. This is definite","useful":2,"cool":0},"73HTS3APxfU4FsSVbmt9YA":{"text":"I use to come here a lot.  It's not as crowded as it use to be.  They have a very extensiv","useful":1,"cool":1},"2i3mIqVfVNx_btfXXKgY6Q":{"text":"That's restaurants a piece of New Orleans history. It is about a $15 ride by taxi from the","useful":0,"cool":0},"yl7EdQBy6T_OJs53McnOHA":{"text":"Nice little bar.  Looked like it could get lively.  Was almost empty at 4:00.  No waiter s","useful":0,"cool":0},"DlmGoSi4VRPvQ05h1Rt8RQ":{"text":"One of the best places for raw oysters. Nice and cold and shucked very well with no shell ","useful":0,"cool":0},"brAy9_ycc351uTasY6sPvA":{"text":"Hey! Love your bar. Been going here for 20 years plus. BUT: YOU NEED TO CLEAN YOUR EFFING ","useful":3,"cool":1},"SQvlm92C80TiqIIZOnDV1g":{"text":"Great for those that are big fans of sports & of oysters. We somehow ended up there during","useful":0,"cool":0},"V7mDA3Q9l9-pyolf-TjsxQ":{"text":"I can still taste the Radiator Special way over here in Texas! Shrimp & Oysters swimming i","useful":0,"cool":0},"jkC0IqKJqqPil5FlPbvQuw":{"text":"Great sports bar with huge TV wall and smaller screens placed throughout the venue, perfec","useful":0,"cool":0},"5gnarAnuasyVqu2NNO8Igw":{"text":"I have incredibly fond memories of Cooter Brown's from college.  The bar's name itself inc","useful":5,"cool":7},"crc90QnqJIxQ1bmzvtOAXQ":{"text":"HOOOOOOOORAAAAAYYYYY !!!!!!!!!!\nNew owners at Cooters- new attitudes st Cooters & new vibe","useful":2,"cool":0},"NJ8W8VVyiDaVJmPgOaHrlw":{"text":"Came here twice on our visit to New Orleans and enjoyed both times.  A very local bar and ","useful":1,"cool":1},"OggEjT7DdTrfa0f7r0g-fg":{"text":"This was my first experience with CB. I ordered several nice stouts from the snob beer bar","useful":0,"cool":0},"0WmAjDehAsEu5op6Sh26iw":{"text":"Long picnic tables, cheap drinks, all my favorite liquors on tap on huge blocks of ice. To","useful":0,"cool":0},"Jx1_8rvjkvx9seCrbtNBLQ":{"text":"I would really rate this at 3.5 stars.\n\nI live down the street so I am here much more ofte","useful":1,"cool":2},"CMMsPOp3ATTh5UDcYUklLw":{"text":"Great place to grab a pitcher, with 100s of beer options. And the food is good ol greasy b","useful":1,"cool":1},"E0uIAwBBd6gMSLK17h0djw":{"text":"I love this place no matter what. I'm from Boston so boudin is completely unfamiliar to me","useful":1,"cool":0},"w-bczH4Tg6iFp2JTJuOFgA":{"text":"Great spot for raw oysters and the coldest beer in town. Dixie beer to me was almost unswa","useful":0,"cool":0},"wcd3XOEWZW12rEneQDVNiw":{"text":"We went on a Wednesday night (trivia night was happening) and found the atmosphere very fu","useful":0,"cool":0},"IMKEcjzxvWHEi0SzNtoMcA":{"text":"Cooter Brown's is a very cool long time hang out to get a really nice variety of beer & ve","useful":0,"cool":0},"leGMzH-9o9hSRfbIw-zPxw":{"text":"We absolutely love Cooter Brown's! Judy is one of the friendliest Uptown bartenders, and t","useful":0,"cool":0},"c-3pHJU_RnRyz_B6Iq-ysQ":{"text":"Came here for the super bowl. Super super packed but we found a table\n\nBartender was so kn","useful":0,"cool":0},"tQOD01eo9PpajMkSkMEWnw":{"text":"I live a few blocks away,gone there out of convenience.Kind of exspensive for a NOLA sport","useful":1,"cool":0},"EHVEvWqMQJR3xs72cP-zig":{"text":"Stopped in for a cold pint with some friends during an afternoon of bike riding.  Cooter's","useful":3,"cool":3},"p1dG7hc5tlFUDoU6Gk0dbA":{"text":"Just had the most tastamazing oysters, tenderest fish and freshest gulf shrimp in the Univ","useful":5,"cool":2},"A4DnXrOgCxsPIq9IjN6MbA":{"text":"Cooter brown's is a favorite in uptown. Located near the levee it's half a block off the s","useful":0,"cool":0},"YwxYLKWx49DLZiK1NoK3FQ":{"text":"Great oysters.  Great alligator.  Great wings.  Almaza beer, strangely familiar...","useful":0,"cool":0},"lm9iddr2QuaMxRuFdMXmfA":{"text":"I'm a New England guy who eats a lot of oysters. And I have to say that these were the bes","useful":0,"cool":0},"nwrPnmKIb_TMGMTii100yQ":{"text":"For a late night snack Cooter Browns for the win! This is strictly about the food. You lit","useful":0,"cool":0},"ETxcpvLGSraj-XL4I2NsqQ":{"text":"Lol I was pretty hungover when we came here and it was the sugar bowl so it was a crazy bu","useful":1,"cool":1},"PLrfRoQCwLICnsNVtzorjg":{"text":"New CB is just like the old CB except cleaner. New menu has some good things that I really","useful":1,"cool":1},"aKqxGaxbUeneDR0Q52jdBw":{"text":"Other people can better comment on its status as a sports bar, but I do love their oysters","useful":0,"cool":0},"gcduJIOw4XRXXVJw-bvldw":{"text":"Great food and bourbon selection\n\nVery clean and warm spots wife loved the cold beer\n\nDon'","useful":0,"cool":1},"nYVzZ4VadxiZzMsw8mmpdQ":{"text":"post-tip scandal update: \n\nthis is still a den of iniquity, it is still a great place to w","useful":0,"cool":0},"iPwKH6lqgxtRlWBGmfFF1g":{"text":"It's a sports bar - lots of TVs, lots of bar food - love the oyster bar! Customer service ","useful":0,"cool":0},"rpVFPW20V44C92mZESbkjw":{"text":"Another great time at Cooter Brown's watching the Saints game ( BLESS YOU,BOYS ! ) with my","useful":0,"cool":0},"-qpgYUWY9tb_w5fdZe8C4w":{"text":"He's a smoker\nA sports fan\nA true bachelor\n\nWhen I want oysters, he's the one I call\nBut o","useful":1,"cool":1},"VjBGxCPLPMMRMD2p6tnZ5A":{"text":"Great oysters and atmosphere. My husband ate a hamburger and it was very good too. Come on","useful":0,"cool":0},"TCz5DOlYyq6ZXqyz56EYLQ":{"text":"My friends and I came here so that my husband could watch his GA Bulldogs play their seaso","useful":2,"cool":1},"T2CxKpjXj3Ln2r_wTB0RLg":{"text":"the po-boys really are that good here. \n\nI had take out once. I had the roast beef po-boy.","useful":1,"cool":2},"ie8yO46dCjW-_23ppbVn4w":{"text":"As everyone else has mentioned, this place has new owners! It definitely has a cleaner fee","useful":2,"cool":0},"CxfPZ_7jaSX2JdrgNnB7tw":{"text":"this place used to have some of the best po-boys I've found in the city, but they must hav","useful":0,"cool":1},"JAomv6fPhVH1-vWKeKtbkg":{"text":"So today we road the street car down towards the end of St.Charles St. thinking we would f","useful":0,"cool":0},"ZnTbO-Prk16v8JRA6BfVUA":{"text":"In the 2-3 months following Hurricane Katrina, I was living uptown in the Riverbend becaus","useful":6,"cool":7},"TXiJeiYojDmk06_nHBwzPg":{"text":"Cheese fries good...burgers ok...beers wayyy to expensive.  Especially for New Orleans","useful":1,"cool":1},"gZLnQB_dDdtc5YsFindqlQ":{"text":"I ordered in and on the phone I was greeted by some of the worst quality service I've ever","useful":1,"cool":0},"qyGRbjWXt8JRO7WJ7qhPqQ":{"text":"Hadn't been her for YEARS...used to come here to watch college football and NFL WAY back w","useful":1,"cool":0},"xPsCBy0uye-JD95BEq0wqA":{"text":"OK SERIOUSLY...BEST CHEESE FRIES IN THE CITY!  They were beyond awesome.  This place takes","useful":1,"cool":2},"i85HcG3odcM3q8VhSdmMFQ":{"text":"Cooter's is a stop on the family tour of NOLA.  Why?  Because it's the location where my p","useful":2,"cool":4},"BRIehlaPqGCvvAVoe4UIpA":{"text":"This place was great! My husband & I walked here from the zoo one afternoon. It was about ","useful":0,"cool":0},"BlXEtbBSxYyelkpSbwjdWQ":{"text":"We were visiting New Orleans from Dallas for the weekend, and chose Cooter Brown's to watc","useful":0,"cool":0},"Rp-oXda5WHqSPV7sLDzrHg":{"text":"First stop after a late flight in, a dozen raw and a Shrimp Poboy washed down with an Abit","useful":0,"cool":0},"a9HCSOKbbQzrOXOib41y9w":{"text":"Every Sunday when my gal pal Sharon & I come here to watch the game we always order food. ","useful":0,"cool":0},"CJNHx4Bk4bnPZHK1Mhr6ng":{"text":"Good food good environment and consistently friendly staff. Ordered half dozen oysters the","useful":0,"cool":0},"pGK3928vpM1JsanRD0Lj0w":{"text":"Best oysters ever. Also had great oyster poboy. Excellent service and very friendly consid","useful":0,"cool":0},"fofVpqgpPjbHyfccOrUzrg":{"text":"As I look back on a long weekend spent in NO earlier this month I realized that the best, ","useful":0,"cool":1},"M7zGWfoLNHMdXNzWCNXlsw":{"text":"Cooter Browns is one of the many stops I bring my out of town friends. With one of the big","useful":2,"cool":2},"z7RZLTs3V_rd61BeFUdu6w":{"text":"This place is a good dive bar with good food. I really like the oyster po-boys. It's also ","useful":1,"cool":0},"f_b15v7UJU_5XGLc85GcxQ":{"text":"Would have gotten five stars but it is really smokey. I love their super unhealthy food an","useful":0,"cool":0},"xb6UnsPp_BlJi-s-dXrIqA":{"text":"I love the food and the service.\nThe radiator po-boy was fantastic loaded with shrimp and ","useful":0,"cool":0},"T6rsD9g2RljmmK6Iyz0lqg":{"text":"Cooter Brown's may have the most active bouncers of all New Orleans establishment. It's on","useful":4,"cool":2},"dw4r7q3JO4NwBcJobFqyxQ":{"text":"I legit have been here at least 20x and have never reviewed this place...i know..im slacki","useful":1,"cool":1},"f9rr4ouw4FoqoZOHjmlXBg":{"text":"Take the St. Charles street car all the way through the Garden District for a lovely ride.","useful":3,"cool":3},"0preoEbgXZNidzAoZLUPow":{"text":"Went here with friends for holiday festivities.  The beer menu was extensive, but not the ","useful":3,"cool":1},"UQeCRW3fO3sMNoiy1DTBow":{"text":"One of my go to neighborhood bars.  Whether I am in the mood for a beer or some good bar f","useful":4,"cool":2},"nzVJZfovyBea4fDf2Kahsg":{"text":"After arriving late to the airport in New Orleans from a rain storm in Atlanta on July 3, ","useful":0,"cool":0},"QAV5r334nFaNyAD1WE6S8A":{"text":"This is one of my favorite bars in New Orleans -- it's definitely a dive!\n\nThe bartender a","useful":3,"cool":1},"bw6nGZ5RmxtmoSglaeaH2A":{"text":"It's worth the trip! The oysters are top notch and no frills.  It is clearly a sports bar ","useful":0,"cool":0},"RX2NLlpVxwXg3L563NVg3Q":{"text":"I always like coming here for football or baseball and quick good New Orleans bar food amo","useful":0,"cool":0},"_mIFSxRta6H-0K8parY8kQ":{"text":"First thing I ate on this trip to New Orleans Shrimp and Oyster Po-Boy it was great..the s","useful":1,"cool":0},"fIjM7vokru1MEo1wUqbXHA":{"text":"The bartender is the best. Will let you try the beer you are interested in (there are tons","useful":0,"cool":0},"QkhMHxrmVMowkb9nQEC4yA":{"text":"This is a local sports bar with all ages in the crowd. The oysters are excellent! The wait","useful":0,"cool":0},"3r8aWOwhkro0QRYeXH2lVA":{"text":"This was one of our stops during my bachelor's party.  It was one of my groomsmen's birthd","useful":0,"cool":0},"wUkxK_9wmPTxkJQLqq6kIg":{"text":"This place is one of my legendary early spots for getting into craft beer, for that alone,","useful":1,"cool":0},"iacqOLOMtiPgwdV3RCpZ9w":{"text":"So, we were going to go to this other place, but it was too small for us. They play Star W","useful":0,"cool":0},"_HVdAxZ_22dBxfWxK6ilDw":{"text":"Perfect Uptown spot to catch a game, eat some oysters, and grab a beer. Wide selection of ","useful":0,"cool":1},"Hv6nDriqaS5xwjmkNxkWow":{"text":"Went to watch an NHL Playoff game and enjoy the half-off oysters (Tuesdays only, about 3pm","useful":0,"cool":0},"50MQxMzBe5ZH4euuoQrvgQ":{"text":"I ordered the Catfish Basket with onion rings with a side of Hot Wings ! Overall pretty av","useful":0,"cool":0},"Y142Vbfi4XLjOwjLu93gUQ":{"text":"Worst poboy I've ever had in New Orleans. Please explain how you use the wrong bread?! The","useful":1,"cool":0},"TW-n7WYHc6ELI2z55bQe2A":{"text":"I wish I lived in the area so I could try half of the other things on the menu.  I chose a","useful":0,"cool":0},"jzopVPYx-Rc-ZvJW5teOPA":{"text":"Cooter Browns is THE PLACE. The bartenders are great and remember regulars. Also the food ","useful":0,"cool":0},"kUH111RKLElRewEf8GFu_Q":{"text":"I hadn't been in here is such a long time since my college days \nStill the same \n\nMy frien","useful":1,"cool":2},"gzkjzBKOj-9BGZf445jKAA":{"text":"I love this place. Yes, there's smoke, but I've never found it oppressive (and I hate smok","useful":2,"cool":2},"trq9p5Qd0TcOit_zeK4x1Q":{"text":"My only problem is i couldn't finish my half of my fries and po'boy.great food good atmosp","useful":0,"cool":0},"g9UQrkHBo9GDbFwvQo86yA":{"text":"So I figured I'd try Cooter Brown's after seeing it featured on The Travel Channel. I took","useful":0,"cool":0},"8CY8FcAhlb0jvHYwUm0RMA":{"text":"Awesome local style bar on banks of the Mississippi. The prior reviews ring true. Hit the ","useful":0,"cool":0},"0KkJcjlgaR7AVryJSdNZAA":{"text":"If you want to get away from the touristy parts of NOLA head out to this area and go to Co","useful":0,"cool":0},"nLbVgPO9A6nm6pD4NMwzBg":{"text":"Cool sports bar. I ordered the turkey burger and fries and they were decent. Typical bar f","useful":0,"cool":0},"dALWSRItB09pKotImFwWZA":{"text":"It's dark in here, which is really perfect for the task at hand. Namely, downing large pla","useful":1,"cool":1},"TaE3UoRjZI5AtZDun9SmJw":{"text":"Swung by tonight with a few friends tonight to grab some food to go. Ordered the Black and","useful":0,"cool":0},"nUe5jfEyx4LPSg3JN0mdng":{"text":"What can I say...I'm a sucker for meat pies...the BEST meat pies....love everything on the","useful":0,"cool":0},"m_6VZ28ORc4n1wKmIlqu9w":{"text":"Do not get the Muffaletta!  The olive spread they put on it makes the sandwich unbelievabl","useful":2,"cool":0},"LbCXEqD3al84l6yiFPfR6Q":{"text":"My friends and I went to Cooter Brown's to get some drinks. We asked the bartender if they","useful":0,"cool":0},"i-28b1vfLAXJMHDCKyzaBQ":{"text":"Picked up 2 shrimp poboys and 1 roastbeef poboy and was extremely disappointed in the qual","useful":0,"cool":0},"RA_CGLNP_gv5MgE2DCU2Gg":{"text":"I ate oysters after this incident, but of course, with skepticism. They were good and fres","useful":0,"cool":0},"KKG1sTa6PxyyPbAex0162w":{"text":"Really love this place. \n\nDozens of TV's. Lots of beer on draft and honestly the best frie","useful":0,"cool":0},"8_teMfqHtSLzeCEM2_FdVw":{"text":"Big fan of their raw oysters. I never knew oysters could be so clean. Every oyster was cle","useful":1,"cool":0},"5WGStImlkJL3QS3tdfBrQA":{"text":"Omg their loaded cheese fries are the best I've ever had. The juice from the bbq is soaked","useful":0,"cool":0},"fFN-nATk1h1ETSGqlsi9Dw":{"text":"More of a party type place to watch a game.  It was very crowded and lots of people cheeri","useful":0,"cool":0},"G2lApa5XAABqHzButn0EBg":{"text":"Another home run in New Orleans.  Since others have discussed the bar and its amenities (w","useful":3,"cool":2},"-5zTHzvzt_OwKiBF46ggTg":{"text":"How could you go to New Orleans and not go to a place like Cooter Browns??\n\nThis place has","useful":2,"cool":2},"OznQaNTpfqJAMPltMhIwaA":{"text":"Always a good spot for drinks and to catch the game. Multiple bars with plenty of tenders.","useful":0,"cool":0},"ej8M-V-wmF0hebWr7W5lhQ":{"text":"They always save the day for me when I'm at work. Call my order in and it's usually ready ","useful":0,"cool":0},"MUEJ3EVv89vI1ux5LBBPGA":{"text":"I've been coming here for years and have neglected to write a review. Shame on me. I'm pre","useful":1,"cool":0},"q0Ws1cVmA3uLYb7i0kOFoQ":{"text":"I've been going to Cooter Brown's for many year & its always your late night spot foR grea","useful":0,"cool":0},"XxHirJQ1FxCH9EJlzPNKdw":{"text":"Dive bar with great food. Came here on a Sunday while tooling around Riverbend. The shrimp","useful":0,"cool":0},"761WvTqB193b_AYN976xqw":{"text":"We had the catfish poboy and boudin balls that were amazing.  We also had the best hurrica","useful":0,"cool":0},"cnnuhO3bl5FbgrzxVBGrXQ":{"text":"What a great local watering hole!  The selection of beer is extensive and the Muffaletta, ","useful":1,"cool":1},"qIbR_oK6tX7sKzzPRDcUvg":{"text":"Extensive beer selection!! I was shocked to find Peroni. Had wings and they were good. Gre","useful":0,"cool":0},"TBHdwYpuqrvgRZPqXyuFtg":{"text":"Get some drinks with the Badger and some yummy grub from the kitchen off to the side. Love","useful":0,"cool":0},"VvX73WUdtXI1EU0k7rsZBg":{"text":"Although the food and drinks are ok, similar to a generic sports bar, I will never return ","useful":2,"cool":1},"T1Y-5HDIaxWnBWeZw4Bi_w":{"text":"Great spot for food and drinks. Usually plenty of seating for groups, but the bar tables a","useful":0,"cool":0},"0jBUOfPDVXTFwFpzBfRx5Q":{"text":"Cooter Brown's is a solid sport's bar. With tons of TVs, you can watch any game you are lo","useful":9,"cool":8},"mj6U6rJCIdIO5yhbcH7vgw":{"text":"We were in from out of town and I had rbis place on my list of spots to drink and or eat a","useful":0,"cool":0},"ecJXZVSUki-ikReSP8xp3Q":{"text":"Walked in this place around 2-3 on a weekday, the place was fairly slow.  Went into the ro","useful":2,"cool":0},"TnaDrW8aa3PsMcEcaVIuaw":{"text":"Cooter Brown's is a great hole-in-the-wall bar to watch a game, play pool, drink a pretty ","useful":8,"cool":5},"ag6QYoDpy0bkaUHnAQqBlw":{"text":"One of my favorite bars in the city! We come here for all sorts of things whether it's hal","useful":0,"cool":0},"6buluHaXML2y8KzLpIsAJQ":{"text":"I loves me some oysters.  That ain't no secret.  Well, it's not a secret anymore.  I decid","useful":2,"cool":1},"oAPyafKtdivnNcY8GbNpQA":{"text":"Great place to drink but john the bartender  was a a rude individual who inserted himself ","useful":1,"cool":0},"-B_DrmvN0Rir1lqv6AIKuA":{"text":"Host was terrible, the man at the front with white hair couldn't of been worse.  Not worth","useful":1,"cool":0},"8iJ6N2VMP7pp7g_UpiNYdA":{"text":"In town for a baseball tournament and wanted to grab a sandwich...we ordered at another sp","useful":0,"cool":0},"6OW1cW8k6iMRSPuiSPkzmw":{"text":"Word on the Street is CB's is now non-smoking. Right on!","useful":1,"cool":0},"1VMOTjR6DoK1nOdELcZ5PQ":{"text":"Not the best service. It's Friday night and you are in walking distance of two universitie","useful":2,"cool":0},"5dDlms4glpUal7Msot_YDA":{"text":"I go to cooter Browns when I can. My friend Ken knows everything about history. Other frie","useful":0,"cool":0},"5PrOkuUt3O-hA_6KJ95eOw":{"text":"So I forgot you can still smoke indoors in NOLA.. aside from this, this place was awesome.","useful":3,"cool":3},"SZDAYQm0YhuGhV9P3aOS_Q":{"text":"Such a fun place to watch a game!! We watched the LSU/Clemson game there and there was suc","useful":0,"cool":0},"h9JBukOLqkEOMJNB68keyA":{"text":"Sweet, sweet Cooter Brown's, I have dreamed (and drooled) about your cheese fries since my","useful":1,"cool":2},"9V_ziPFo_Jcp6kfeqUmmEQ":{"text":"Stopped in on our weekend in NOLA, manager or host (older gentleman with long white hair) ","useful":1,"cool":0},"xMkdgldb3hSz14xktnyl9Q":{"text":"Best shrimp po boy I've ever had.\n\nTheir shrimp po boy ($12.50) is absolutely delicious. I","useful":0,"cool":0},"5yRM6AEZ7L1rSAZYdwedpQ":{"text":"Oh, Cooter's. You were my place. I would go there every week for oysters and beer...\n\nunti","useful":4,"cool":1},"3UeDNZL-qnNlg-T4lklQaQ":{"text":"Quick lunch spot while my friend was on his break but not bad at all, tables were separate","useful":0,"cool":0},"SP1IFbE15LOQgGO0qNKjgw":{"text":"Fighting and adjusting through COVID, this place keeps delivering. Yeah, nobody is excited","useful":1,"cool":0},"xD1FkGqx70ECV6UTEz_9pg":{"text":"Lots of beers on tap and bottled. Neat place to grab a poboy or oysters. It's a bit divey ","useful":3,"cool":2},"j6SLFNYlXCFFAko9fBiM8A":{"text":"New Kitchen!!! WOW!!i was here on their opening night. The line was long but the guy takin","useful":3,"cool":2},"CJLKHX4QCOohLWf8yu4G7Q":{"text":"Great fresh oysters!!! Half off on Tuesdays is the best deal in NOLA. Very friendly bar te","useful":0,"cool":0},"fznnBol6RTOJI1ZvJxVSfA":{"text":"This spot has some of the best bar food that you'll find in town. Prices are super reasona","useful":0,"cool":0},"0bkgqpWRf2aSXLlQlYk4DA":{"text":"Tired of ranting about Louisiana ways of life...so I'll keep this brief. \nPros\nThey are op","useful":2,"cool":0},"rmtpJTbNix3sZPixs-hbhg":{"text":"Great English style PUB dive bar. Honey BBQ wings are great. Good local beers. Lots of TV'","useful":0,"cool":0},"YCmd6obVE6s-NxbbfGlItg":{"text":"We we're out for a bike ride and stopped by after visiting the Audubon Park. We got there ","useful":1,"cool":0},"ldnhkCc6eyBnC5Ug5_U9Ag":{"text":"Went into this place(Aug.2nd) with my wife for a quick eat and was so disappointed. I had ","useful":0,"cool":0},"5x3_8X5p5cmjbfwot5ROIQ":{"text":"Forgive me if I am biased, but Cooter Brown's burger sold me. Maybe it was the excessive d","useful":0,"cool":1},"GUvXLSdZx9FgrXSVY7TzMg":{"text":"tl;dr Come for the oysters, stay for the sports (but really just the oysters)\n\nAdmittedly,","useful":4,"cool":0},"f3Eh1FTUFJkJh-AtwWKwfw":{"text":"Brightly lit (thanks to the glare of tons of flat screen TVs) + the stench of cigarettes a","useful":17,"cool":13},"MZvmTe8GqdD3NSBNEW9kdQ":{"text":"We were in town looking for a good po' boy and decided to try this place. We triee the bou","useful":0,"cool":0},"C-87A9bphBBHSgtryobbSw":{"text":"Place has decent ( but overpriced food ). This punk is always the \"moral authority\" and se","useful":1,"cool":0},"GSiQym6687SHujDvO0HdHw":{"text":"The wife and I were in town visiting and wanted to get away from the quarters craziness. H","useful":1,"cool":0},"9ezEK9Qe7zcX6Guz-qtvhg":{"text":"It's a dive bar that is near the St. Charles streetcar stop. We stopped in for a quick dri","useful":5,"cool":3},"n0uaewzWPHrVs-tNllb0YA":{"text":"Really cool bar to hang out and get some food and beer. Huge ass tv screens to watch games","useful":1,"cool":0},"7Yo6YFK-slVEKDo9GZQYLQ":{"text":"I called in early to avoid sitting around waiting... but when I got home and realized I ha","useful":2,"cool":0},"KqjdfRe22Yqxq5ueXQkgtQ":{"text":"I had such high hopes for the \"new\" cooter browns after reading the reviews. Sadly, my lun","useful":3,"cool":1},"NGn0_2bpn6Kkyg9IHAPyfQ":{"text":"Here visiting from Washington state...\n\nWe got a referral from the trolley driver for this","useful":0,"cool":0},"vMdmcv4e0u3EFeu52Mf67g":{"text":"I came here when I was craving some cheese fries on a Sunday night. I placed an order onli","useful":0,"cool":0},"lcVI_S-0mSeIz8tnBKnfeQ":{"text":"Cooter Brown's is a cool bar.\n\nI have been coming to this bar for nearly 15 years. While I","useful":11,"cool":10},"ekfXxAB6Q1ME0w_2WxeHbQ":{"text":"We had our ride share driver to swing by here on the way to airport. Ordered to catfish po","useful":1,"cool":1},"S_r70zsrtlK3DXKVLK4toA":{"text":"this isnt teally a dive bar. more of a sports bar. one time tebow one a playoff game here ","useful":0,"cool":0},"L8P326jIqvL5wpzeD8asSA":{"text":"I love when you find an amazing place completely by mistake. Destiny brought me to Cooter'","useful":0,"cool":1},"xvszGnMSdDvXe52aKp_CcA":{"text":"Found this place completely on random, after being lost and being too stubborn to consult ","useful":2,"cool":2},"slh8Xuc5G2EYhZSva5Ch6Q":{"text":"Wow , got the managers special (a ferdie for you mothers connoisseur's).  Real roast beef ","useful":3,"cool":2},"hmNouwydSzcntGQdmdqrfw":{"text":"I may hate this place, but I've only been there once so I'm sort of undecided.  It's crowd","useful":0,"cool":0},"WnL5K0BKaTYbJPDKTg2gKw":{"text":"I've eaten at Cooter Brown's several times on various trips to New Orleans. I've never ste","useful":2,"cool":1},"L1hV-j75LQ8gW-COsxEcKw":{"text":"Easily the best place Uptown to drink beer, eat oysters, shoot pool, and mellow out all wi","useful":2,"cool":3},"89TAneJQnZ8MDLY8DPZojA":{"text":"I hadn't been to Cooter Brown's in years, so it was kind of like stepping back in time. I ","useful":1,"cool":1},"fQxMQ9zhIDV30XWvmbgAhA":{"text":"Stopped in for lunch. Grilled shrimp po-boy and fried pickles nomnom. Great bar food and t","useful":0,"cool":1},"t3PuWOmLTypZ8qWM3d6Kcg":{"text":"Stopped here for some lunch on a Saturday afternoon at about 3PM. No line to order food, w","useful":0,"cool":0},"04BWT61qKwCe6ZcXOF0uoA":{"text":"The food and drinks were great. You can tell it's more of a college scene! My only real co","useful":0,"cool":0},"WAUo3FrWBTBJ8J0BA_hYeQ":{"text":"The beer selection was great as you've seen in the other reviews. I'm only giving this 2 s","useful":0,"cool":0},"rcaBTYTCLIguhYvmYcB66w":{"text":"Got into town late so nothing else was open. Hungry and thirsty, Cooter Brown's fit the bi","useful":0,"cool":0},"LQYXOzHtrPGwWXm-LJwaQQ":{"text":"We were joy riding on the streetcar one day and got hungry. We did a thorough search on Go","useful":2,"cool":2},"5xWFkQBlqWKbDf1vOtl0PA":{"text":"Just picked up a burger to go.  First time at cooters in a long time (when i was younger, ","useful":0,"cool":0},"DIhu9nbKomjr4BgFfLwJKQ":{"text":"Fun sports bar. It's common for people to write/ carve their names on the benches. I did m","useful":0,"cool":0},"qTkVxwYTQSGQM4xfdPpomg":{"text":"Get the cheese fries! \n\nCooter Brown's is a decent streetcar ride out to the river bend ar","useful":1,"cool":0},"6ErVleFufmveyh0fF78H9g":{"text":"You pick a table and sit down, order your drinks from the bar (bartenders are super sweet)","useful":1,"cool":0},"iny41um7KMDFJzlz87Zg3w":{"text":"The Cooter Brown's of my youth:\n\nDark and Dirty\nLots of beer options on tap\nFresh oysters ","useful":7,"cool":4},"qjai19FZ6u3dng-kkuFXSg":{"text":"at least 5 years have passed since I was here - and it's improved! The food is really good","useful":0,"cool":0},"0_qHIk_2udgngsaqJU0T9A":{"text":"Such a fun place!  We planed our trip to New Orleans around being at this place for Saturd","useful":0,"cool":0},"JXQSAQqd41_PX1-iX_nJag":{"text":"Ambience-2\nFood-3-4.5\n\nThis is place a hit or miss for me, but when it's a hit--it's a HIT","useful":2,"cool":0},"iWCv2uVrTv9kAgCS2ND_VQ":{"text":"Food was ok at best. Gross bouncer with long whites said some extremely disturbing stuff t","useful":1,"cool":0},"45o-ubIKRzaJbHAFk1ehJA":{"text":"My favorite neighborhood hangout! The Irish channel special is the only thing you need to ","useful":2,"cool":0},"NDm2wpYXLo7A2-pfArGMgQ":{"text":"I'm not an oyster person, but they serve excellent waffle cheese fries with Tony's on top!","useful":1,"cool":0},"NWhUnuocAz0NtvuV1NsIbA":{"text":"First time in Cooter Brown's and we absolutely loved it! We felt comfortable and safe with","useful":2,"cool":2},"KeQ92M8y4G7xcNX66acXdQ":{"text":"Another great local find outside the beat of the French Quarter......  Oysters, spinach sa","useful":0,"cool":0},"YJvXBFVrnzIrp3EdDizgmQ":{"text":"Really not sure why people referred me here.  The shrimp was unusually fishy tasting, the ","useful":2,"cool":0},"VIVgNAFoNAgTR3fY8Pz50g":{"text":"Here's what you need to know about Cooter Brown's, in a few easy nuggets of information.\n\n","useful":7,"cool":5},"BbKmEltk0DCxRL36me1tsQ":{"text":"Stopped in late night after work for some food. The bar service was good. Grabbed a drink ","useful":2,"cool":0},"UkxVZzcVuMiM4TK9YpSD7w":{"text":"At the end of  a street car ride through the beautiful Garden District. Amazing selection ","useful":0,"cool":0},"dRZljhUH4GyEj77feplPtQ":{"text":"I ordered the habanero wings, they lack flavor honestly. Very spicy, but it does not have ","useful":0,"cool":0},"Wei7Q6LB9-YLiSEJLdpX_g":{"text":"This place is heaven for sports fans! Seriously, they will put on whatever game you ask th","useful":3,"cool":0},"-ifovyZ23StbaLYg5K861w":{"text":"Holy moly, I had heard of this place but we'd never been since it's a little far from us..","useful":1,"cool":0},"e5EDs8sTEpXGH4AZ1aWAqA":{"text":"We came during the sugar bowl so it was crazy busy so the food took a while to come out. W","useful":3,"cool":3},"BsMYAgeB-GmMJoJqZe_jFw":{"text":"The tables and floor are sometimes sticky. The beer selection is plentiful and diverse. Th","useful":0,"cool":0},"CUYRyCGuyqffgFndUQY5HA":{"text":"It was a good time but I ended up getting food poisoning from the catfish. Everyone in my ","useful":1,"cool":0},"fQ8EEPyUYR6Ar7rxIOShng":{"text":"This will always be one of my favorite taverns. They have an awesome beer list. And all qu","useful":1,"cool":1},"4bx7bW-Xnz5oy-U-qGZGJw":{"text":"Stopped by this place in between meetings due to the close proximity and was pleasantly su","useful":0,"cool":0},"QATpQ0uZVkQ8wOfXrjAZsQ":{"text":"Love the selection here, friendly bartenders and any game you wanna watch on tv. What's no","useful":0,"cool":0},"jDTc9YvE0astmfQeauN38Q":{"text":"Went there to pick up food and it took forever. OH and did I mention I saw a RAT in the ki","useful":1,"cool":0},"Rv1LpdUAa7OKch0wrrzMVg":{"text":"It is discouraging that when I open the where y'been fall restaurant guide, this place ain","useful":0,"cool":0},"1Q9-UBL4XGg2JHsfGvJdQg":{"text":"Walked in yesterday, haven't been in about 16 years.  Sure it's a bar, tons of beers, but ","useful":0,"cool":0},"PBLPWgEHr9LuSQtXTXqvIA":{"text":"SINCE 1977...\nCooter Brown's epitomizes that '70s college bar genre: dark paneled walls wi","useful":7,"cool":4},"LkN0rURqEQVLzxOzt34E-A":{"text":"Do yourself a favor, get a dozen oysters (or two) and sit outside on a beautiful afternoon","useful":5,"cool":5},"AqtXBek_JGdov_1i5kgRjQ":{"text":"My wife and I both think that every item on the menu is fantastic.  Having said that-- \"tr","useful":0,"cool":0},"-LgiKAebbDjZYohiwLaR2Q":{"text":"A solid sports bar located in the Riverbend that has the best raw oysters in town, great b","useful":2,"cool":2},"j0LCsQjfu8VETz6xLm2oRg":{"text":"People are so lacking in passion.  As for me, I call it like it is- and if I give a food p","useful":2,"cool":2},"sgGmseY71CPk8YMr_83Ubg":{"text":"Awesome atmosphere with over 100 beers to choose from. The oysters are the best in the cit","useful":0,"cool":0},"1RaU9J1QvOH3uFnaU5aRHQ":{"text":"Terrible service. Hour in just got a pitcher of water and drinks. The tables already full ","useful":1,"cool":0},"HiQovLcDq5pdv2swvaON6w":{"text":"More like coochie brown's. I had one bit of food and it tasted fucking horrible. Yuck.","useful":0,"cool":0},"4pkFFROcJ-FZg0jE8DM6ww":{"text":"Live it, live it, love it  love it\nDynamite Black & Bleu burger  \nSuper nice lunch bartend","useful":3,"cool":1},"Hipcsj8DTjmqoMsmWsWzkw":{"text":"Parking can be tough because it's located at the end of Carrollton and River Rd. I parked ","useful":2,"cool":1},"QPNw10DtphVz3kDjIbXmMg":{"text":"I was enjoying lunch having a drink OUTSIDE, and the bartender storms outside and \"thought","useful":3,"cool":1},"gkayA_mUP-aP9GnVw0g-5w":{"text":"A New Orleans tradition.\n\nThis restaurant and bar and tucked away in the river  bend area ","useful":2,"cool":2},"wPBLOVF6my2fAjXO8VNswg":{"text":"We love this place! Great oysters! Everything is s 5 till you go into the bathroom.  My hu","useful":2,"cool":0},"8L-v2muC-NEpIvuak0ZKAA":{"text":"The beer is the freshest in the city.  A friend of mine works for Air liquide as a vice or","useful":0,"cool":0},"9dtj_U8nraboakyoExJfXw":{"text":"This is one of those places that when I moved nearby, everyone said, OHMYGOSH YOU'LL BE NE","useful":0,"cool":0},"_piDBk095yJFDVtDaL86VQ":{"text":"First of all, It was hard finding a parking spot.  The bartender gave the worst rude and h","useful":0,"cool":0},"l1Zp7mJtd2TSuKr6BIM4NA":{"text":"It has been a year since I have been to Cooter Browns.  I went there last night and could ","useful":0,"cool":0},"XRTyxPrEVsesz_6bfmiiXg":{"text":"3.5 stars.  Rounded down because of service.  \n\nI went here for lunch today because a sudd","useful":1,"cool":1},"N7sKjlSvQ5iNIJ09PGrXbw":{"text":"Quintessential old school bar, a neighborhood staple. Cheap drinks and amazing burgers. Gr","useful":0,"cool":1},"czxskDu6Rk_li0tHul06Fg":{"text":"My dad and I came here for some hangout time and had a great experience. We went into the ","useful":1,"cool":1},"wdZ6qQ2I0GRWZ203W7ZNAg":{"text":"Cooter Brown's is unarguably the gem of the Riverbend. Definitely in my top 3 when it come","useful":2,"cool":3},"O-E1jQRbil-Y7kYsgmnW4Q":{"text":"So glad we got Cooter Browns amidst this pandemic, always great food (be careful with the ","useful":1,"cool":0},"aUQMVDitUCIGd83U-T4kFQ":{"text":"This is my favorite bar in New Orleans. Great food (esp the wings and oysters). Gosh I lov","useful":5,"cool":7},"Ym_OnvJ-AlTOAY4cKjdQdQ":{"text":"i would return  just for the service, and for the atmosphere.\n\nshrimp po boy: only OK. too","useful":1,"cool":1},"JvPeC6cKCHyWeSnu-A2HPw":{"text":"Omg their loaded cheese fries are the best I've ever had. The juice from the bbq is soaked","useful":1,"cool":1},"_93zYj7g3CPLEC5pjpSpTQ":{"text":"I don't make it to Cooter Brown's much, considering it's less than half a mile away from w","useful":5,"cool":2},"vIwBt1T_p_ab9cwSO4Iesw":{"text":"Well Donkey Balls the new ownership got rid of the real pint glasses and gimped up all the","useful":5,"cool":3},"_7K1myZnzWNzyPXm1pSg7Q":{"text":"Great place... love their food. Burgers & Fries are the best & they have Abita Root Beer o","useful":0,"cool":1},"nGN-gw7cwp_8QyBCSWy5og":{"text":"Cooter Brown's is a local hot spot! It's a great place to watch a game- lots of TVs and lo","useful":0,"cool":1},"FYz2MadBesRnGxzJmfOiRw":{"text":"I came here for a quick bite and got pinched by some people.  Well, it was the tourists-  ","useful":0,"cool":1},"dbZvqnXsWQH5gz59K0ou5w":{"text":"Cooter Brown's is fantastic.  Not only is it a great place to watch a game (the place is h","useful":8,"cool":8},"cMGrrMxWmnSeMwqS3HBQEw":{"text":"I really was not impressed with the place. I defintely got a strip club feeling when I fir","useful":0,"cool":0},"spIuV4APQ090ZRajNrdW7w":{"text":"One of my wife's favorite hangouts in college.   I can see why.   Great staff, good drinks","useful":2,"cool":1},"dRcPP0GlRn1zixEFV0l4gQ":{"text":"Cooter Brown's is a popular uptown bar by the levee where St Charles meets Carrollton. We ","useful":1,"cool":0},"RdY15hTz22BsGjoRy6Du_Q":{"text":"Having stopped in here a few more times I can say yep - good bar. Drafts have gone up in p","useful":1,"cool":1},"JuuNXOResRReqMJDpbjo-A":{"text":"At the suggestion of one of my friends from Louisiana, we decided to check this place out ","useful":1,"cool":0},"RLY8Iaf70EsVrTw2Fv7_Mg":{"text":"Shucks, I can't believe I haven't reviewed Cooter Brown's since 2013, hot damn. \n\nLate 201","useful":20,"cool":13},"Zn83mK3ZhDNCKGAMkp0LPg":{"text":"We came to Cooter browns on a Sunday during football season. Let me briefly say best bar c","useful":2,"cool":1},"mTWLm-MSvxarF71xrUR-RQ":{"text":"Cooter Brown was a cool spot. No frills but the drinks were good and they have plenty of t","useful":1,"cool":0},"WDW9Bj1aXavIwASzIDY6Gg":{"text":"Looking for a place to watch Sunday football we happened upon Cooter Brown's because of th","useful":3,"cool":3},"vNErY2Ou5pJxbVo1nz6RUQ":{"text":"My chicken fingers and fries were bussin. Add in the ranch dipping sauce, Fire! So good! I","useful":1,"cool":1}}