{"VO-F_Vse1tuiCBfwl4Bk1w":{"text":"This place has unexpectedly good coffee choices of all styles, modern and clean interior, ","useful":0,"cool":1},"_nhZNHK_oWK3KVqHQu0TOA":{"text":"What a cute little place, the owner is very kind and I I had a great conversation with him","useful":0,"cool":0},"aYi4KGxecjFKGVtsUTfzzw":{"text":"New Orleans Coffee House is a wonderful new addition to the Lakefront.  The atmosphere has","useful":0,"cool":0},"5vDMciVHHyBaQKw9o_97UQ":{"text":"Owned by a friendly family! Excellent customer service. Delicious coffee and pastries! The","useful":0,"cool":0},"WuBejZ70oBIS-QgJblHL3Q":{"text":"The owners (or maybe they were employees?) were sweet, the inside is very cute, and most i","useful":0,"cool":0},"ci-ZlXhajIMefoybmWR6bw":{"text":"Great tea and coffee, very clean, and friendly aura just a suggestion: make the menu more ","useful":0,"cool":0},"XH8foDBhI7NOOWhyYegnOw":{"text":"Stopped in for my first visit and I will be back! My latte was perfectly brewed and the al","useful":0,"cool":0},"RdBiJfcwPt1wlTetW5OwUA":{"text":"The Americano was delicious and the staff behind the counter were so friendly! Also great ","useful":0,"cool":0},"vld4IwbBB2rNfWs_0pLoUw":{"text":"I love this coffee shop!\nI found them on Yelp when I was in the area! Love my Yelp App!\nRe","useful":2,"cool":1},"VQKOKRfDLNcJtBN77iUhvg":{"text":"Frozen Dirty Chai is my go-to . This place is nice , clean and they work pretty fast . The","useful":2,"cool":2},"SU9zA7Btzo8mlgnbJWTsCA":{"text":"I will give it a big thumbs up. We have waited since Katrina to get a coffee shop back on ","useful":0,"cool":0},"7pRBCeGi8_Mh2Une3dqSLA":{"text":"I visited yesterday with one of my friends and I was blown away! Amazing Vietnamese Coffee","useful":3,"cool":1},"1K-mde9YPDquZvC4LSNaYA":{"text":"So happy have a new go to neighborhood coffee spot! The coffee was delicious and the servi","useful":0,"cool":0},"vnoOu22hSyLtgcLPO6A-7g":{"text":"Totally brand new coffee house.\n\nFriendly folks and kind service.\n\nNice place to meet, wor","useful":0,"cool":0},"Om64rYZKc8F3jzj68Kfpww":{"text":"I couldn't be more thrilled to have a coffee shop in this neighborhood! I recently got a f","useful":1,"cool":0},"UNfvEEJAsDKC5GJJZ_e18w":{"text":"I am beyond excited for this place to be open! It is so airy and welcoming. The staff is f","useful":0,"cool":0},"k6WjFvHgd5jZlYUXAMdH_Q":{"text":"Good coffee and plenty of outlets. Agave nectar on deck to sweeten yourself if you're not ","useful":0,"cool":0},"JtsfYOWjU3TBzX79nXySlg":{"text":"I've been in here a couple times pre-Covid, but I went in today and there was no signage a","useful":1,"cool":1},"vi9FGMY2SBI5MzvCXDhuQQ":{"text":"Coffee House New Orleans is probably the best coffee i tasted. It has the perfect taste ne","useful":0,"cool":0},"QlYhbXzPPHCo4H8VyAQPcA":{"text":"Cute place, yummy latte, plenty of space to work with WiFi. \nThe staff is super nice makin","useful":0,"cool":0},"he-v75X6EDAmT30B3_vB2Q":{"text":"Cool spot. It's new so they don't have a large menu. Cafe style menu items (paninis & chip","useful":1,"cool":1},"liuiW99-J0ChYZRbQf5TBw":{"text":"This is one of my favorite neighborhood coffee house. Great customer  service, pleasant en","useful":0,"cool":0},"IrQGLDXlrCHn_9aQ62wJ3g":{"text":"Coffee House is an amazing brunch and date area. I visited back and was pleased with their","useful":1,"cool":1},"3tlvViW3_z62MQ0FjK6tLQ":{"text":"This is my new favorite coffee shop! I've been there times this week; the service is great","useful":0,"cool":0},"aHdNDu7Of0mrTuqIEaa77g":{"text":"Definitely a place worth going to. Coffee was amazing and had such a smooth taste. My favo","useful":0,"cool":0},"vUcb6KfuqGA_31l1rqj0ag":{"text":"Not the friendliest place I've been to, but they had Oatmilk latte, and they have a good e","useful":1,"cool":1},"suWvtmP2eH-SCGqNBi0eNA":{"text":"Love the vibe of this place. The owners are very welcoming and make it a priority that the","useful":1,"cool":1},"J1Qzdf38dYDYYZN9rPYkAg":{"text":"Nicest people own this shop.  You are like family.  It is needed in this time of individua","useful":1,"cool":1},"J7dUYd_GSer1GbbPa01kiw":{"text":"I stumbled upon this place after a quick google search for a coffee place in the area, and","useful":1,"cool":1},"-bBHHBnKXjU4AzJf0ektfA":{"text":"Cute little place. This week is a soft opening so they are still working out the bugs, not","useful":3,"cool":2},"xVJcu3KH6SIQIBgux-hUhQ":{"text":"No posted hours. Google says 6:30. I'm here at 6:45. No sign of opening anytime soon.","useful":1,"cool":1},"MkvdG21hFZTxAMbktz1a1w":{"text":"Stopped by for the first time on my lunch break. I was pleasantly surprised by the inexpen","useful":1,"cool":1}}