{"tN4nfcBg8qdSgVe_B35HNw":{"text":"I discovered Favori when I went to Tulane and have been going back ever since. Located wit","useful":1,"cool":0},"A5dTbr4tAWvcurD_NeJNZw":{"text":"First off, the delivery took an hour and ten minutes. They told me it would take forty-fiv","useful":0,"cool":0},"Nc42wFkHt_n_jia1lQYLnQ":{"text":"The food here is dirt cheap yet still manages to be delicious. I strongly recommend the Ch","useful":3,"cool":0},"0_I4ysXVnA4UKXq3oPEaTg":{"text":"My absolute favorite hangover food in New Orleans.  If you start your day with a pounding ","useful":2,"cool":0},"AFeQEjJh--dRkeh7haJbxQ":{"text":"Good local deli, my main complaint is the the French bread is not that great. The sandwich","useful":0,"cool":0},"ZwJRwIFwDXkJTtFqGCFlkg":{"text":"The food only tastes good when you're drunk.  Don't expect fresh cold cuts or bread.  They","useful":1,"cool":0},"CExRzBmCXHPdQcFaX_aFVQ":{"text":"It's hot in New Orleans. Really hot. I'm a Texan, more importantly I'm a North Texan. We l","useful":6,"cool":2},"jy_3I-EydYrHJ7YDsiN_fA":{"text":"Love this greasy fork and spoon deli!  This is not a fine dining establishment.  This food","useful":0,"cool":0},"NoWBOqmjVAVtCxdRRvZctA":{"text":"We found a new favorite place in New Orleans in this little deli. Our little corner grocer","useful":0,"cool":0},"xrMtdzs8KywmSVPb2iISTw":{"text":"Get the macaroni and cheese. Trust me.\n\nI don't eat meat, so \"delis\" aren't really a langu","useful":4,"cool":0},"9lYsTiSuQkDJjnMhi5BDwg":{"text":"Thanks for suddenly changing your delivery footprint and not including that in your info n","useful":0,"cool":0},"j7b46-GZZ9D3JYLURhO2AQ":{"text":"Great comfort food at an even better price. Delivery times can be inconsistent but still w","useful":0,"cool":0},"8AmpzNAbBVrnXbhoUP46ZA":{"text":"Big, delicious, fairly priced poboys made on Liedenheimer french bread. There is a huge se","useful":0,"cool":0},"u8fYI5MzSKKmWaDPlGoDGg":{"text":"Had excellent po boys here after a long day of drinks. Fried shrimp and sausage. Omg.","useful":0,"cool":0},"G3fSqvpnQ13QqzHKThNAag":{"text":"Best po-boys in uptown with excellent bread and seafood. They always get my order right. T","useful":0,"cool":0},"pEcKb6NsSUDzsS9c0lilwA":{"text":"A solid staple to the college atmosphere. This is one of the great cheap sandwich places t","useful":1,"cool":0},"xNDhd_2vFPkRzovUrpFOUQ":{"text":"Really good food. Love how I can order cigs on my splash card","useful":1,"cool":1},"WQ4CqSlVgr-ZOHRWdPw3yg":{"text":"Favori is one of my favorite spots to hit when I'm out in New Orleans.  I frequently visit","useful":2,"cool":0},"vUSujt3eKEnED5_PyBh_xA":{"text":"Best sandwich shop Uptown. Food is great, huge portions for great prices, and really nice ","useful":0,"cool":0},"oy9QMtYR9l7cBIWebN1SGg":{"text":"We love this place. From the spicy chicken wrap, to the steak egg and cheese, to the Phill","useful":1,"cool":0},"8qTYTJEmdt9NrvCqdSKkYw":{"text":"their steak n egg breakfast sandwich is the best. awesome hangover food and they delivery.","useful":1,"cool":0},"cI5NpQMIUV21CPaQpduYBQ":{"text":"i love favori. they are easy and delicious and comforting. everyone who works there is ver","useful":0,"cool":0},"AlTeS_sjOiJdB4qJSVougg":{"text":"Get the Philly cheese steak with two fried eggs on top and the slather it in hot-sauce. Yo","useful":0,"cool":0},"rMIcnfvU4_hEHQI3LwwN3w":{"text":"A favorite spot of mine out in New Orleans, their menus variety reminds and interior vibe ","useful":0,"cool":0},"jScgacKgaH9pRbY6OBMiLQ":{"text":"We stopped in here during a visit to NOLA. PoBoy sandwiches were AMAZING. Don't let the at","useful":0,"cool":0},"kmXwTDApRDNbrEFI8zB9YQ":{"text":"Best Poboy in New Orleans bar none!\n\nI used to live in Nola and would eat there at least o","useful":0,"cool":0},"fFRlBpn3zdlg_YMqF4rFqA":{"text":"Super awesome! It's owned by two Asian young adults and there is one cook who is just incr","useful":0,"cool":1},"lVcL7IvKdY6V_qdzc4WM4w":{"text":"The steak n egg. Nuff said. Oh and be sure to ask for extra sauce ;)\n\nI order from here qu","useful":3,"cool":0},"I_4EJ7G235pI_4wwPKqk-w":{"text":"Love love love this place. I always get a philly cheese steak and some cheese fries. Not a","useful":0,"cool":0},"MIh8kQsoGLJG0Fb1F3eSxA":{"text":"Very quick little deli and grocery. Try the maple feast! Call ahead and in 10 min it's sit","useful":0,"cool":0},"NIjZoXRdsPHYwVmu7NwixA":{"text":"When I went in, gentle wait, but what can you expect when you know your sandwich is being ","useful":0,"cool":1},"oV5ouHpvZsj4lqFsJsJUjA":{"text":"\"Favori hold please.\"\n\nThis is the first thing you will hear when calling in an order. Bes","useful":4,"cool":1},"HLBOZSkVY1mNKsQ-ypr2_Q":{"text":"On my way home from work and Tulane University, I came across this deli. Even though it wa","useful":0,"cool":0},"MmlQ6oZDxLT29e_cIKQFkw":{"text":"Great food, large portions for cheap. Awesome people working there as well. Really nice li","useful":0,"cool":0},"LbWARaXeCRv_17_9Nh-1bw":{"text":"I like the menu. Traditional poboys and some non traditional items like rubens, tuna salad","useful":4,"cool":0},"5kn1KxybhaxPcs25AxHYlA":{"text":"I love ordering from this place, very friendly staff and delicious hot food.\n\nonly open fr","useful":0,"cool":0},"U28MJnYbnvL37ZKIRQKk5w":{"text":"Great local business that is cheap and easy. Definitely the tastiest Po-Boy in the neighbo","useful":0,"cool":0},"Uhw-0_pgPLOXIVTToezsag":{"text":"Favori has really great food and sandwiches at amazing prices. This is as good as it gets ","useful":0,"cool":0},"Adl6uPXYymubM50kShXqCg":{"text":"Classic Style. Used to joke that I had the \"favori mealplan\" because I ordered from here s","useful":0,"cool":1},"umGAJS7SbqEmO_2cczjAsQ":{"text":"I love this spot for quick and casual lunches. The steak and egg breakfast sub was very go","useful":2,"cool":0},"VxNdb0QJH7mSlSDhDNbzKQ":{"text":"Great sandwiches, great deliver service. Good Sandwiches:\n\nMaple Feast, Philly cheese, Spi","useful":3,"cool":0},"nOmWKPua3W-Jw6HxxDk57g":{"text":"Favori Deli is a little gem that we found one day looking for a quick spot to get a sandwi","useful":2,"cool":0},"E1A6cpyro4_Lx60kyZycqw":{"text":"$ Reasonable price, very low key and clean. Fresh food well seasoned real shrimp I don't k","useful":0,"cool":0},"gNeFqDmGCMCvOyYkCDP9RQ":{"text":"A great deli! Great prices and incredible sandwiches and Mac and cheese. Great for every m","useful":0,"cool":0},"I4JSsb06TKfyKdFze1X2qw":{"text":"I got the chance to check this place out recently and I'm so glad I did because I loved my","useful":0,"cool":0},"e7nbn21tmGfJRmg1rSnaGg":{"text":"Favori has one of the most diverse menus in the area. From wings to breakfast to grilled c","useful":0,"cool":0},"vJ2a0ATEC1uBFNybq863jA":{"text":"Pure hangover fuel. \nGood service lacking heavily, food is decently tasty (hard to mess up","useful":0,"cool":0},"AjQ55ZUSxnoEJTxrKKMQ9w":{"text":"Best philly's in town!! Always consistent, fresh bread and fresh ingredients!! They are ve","useful":0,"cool":0},"hTYy6vnrcxhVICYa7CV2YQ":{"text":"I discovered Favori long, long ago when, without car as a freshman at Tulane, I ventured d","useful":5,"cool":1},"beRF29Yptc112cLlFRxrZQ":{"text":"My family and I were looking for something quick to eat before heading back on the road to","useful":0,"cool":0},"Sgu8jaMir1zu6mEMhZ_tDw":{"text":"Favori has the best food in town! You can't go wrong with most anything on the menu! I sug","useful":1,"cool":0},"HkTNfgZ15ouoae7N6RUIGg":{"text":"Ordered lunch from this location accidentally and the wings were terrible. The grease was ","useful":0,"cool":0},"SstSkpsDed5R4NABS5kZ9A":{"text":"Ordered a shrimp plate using uber eats. I enjoyed it. I would order again. The shrimp were","useful":0,"cool":0},"eoqEjBXdaIfpPjvYMTr_gQ":{"text":"Food here was so good!! Service was quick and the bartender was super helpful and knowledg","useful":0,"cool":0},"XE3rG74CfjnUAwA01FbEYw":{"text":"Rude staff. Don't go in even 45 minutes before they close causenot only will you get an at","useful":1,"cool":0},"DKCC6ruQssC5MTJQ7gbMvw":{"text":"Great convenient location. Really quick with your orders and the people there are friendly","useful":0,"cool":0},"UgJFc0eYjA-BfuYVRxZUuQ":{"text":"Super yummy sandwiches. First time here we would come back next time we are town! Everyone","useful":0,"cool":0},"Q4q_ufDMWS1HCQ9Wyo-SgQ":{"text":"The shrimp Po'boys trump those at more well known establishments. Prices are super reasona","useful":0,"cool":0},"rr76FO--91dB8WbusooFhA":{"text":"Stopped to grab a quick side salad. I tried to order ahead but the girl that answered put ","useful":2,"cool":0},"mSJtV68nWTo_p9ScRdc2Yg":{"text":"friendly staff, great quality of food. Fresh ingredients and made to order. Really enjoyed","useful":0,"cool":0},"v8VjVZY-qKijSOifPF2NTA":{"text":"That steak&egg was legit. Each bite was filled with meat. They also slapped a hash brown i","useful":0,"cool":0},"evqtEQDyY_lgoEhvnc-2UA":{"text":"popped in to get a poboy because it was cheaper and closer than parran's. took about 30 mi","useful":0,"cool":0},"DxeOypAbEMWTozZuP6X7vQ":{"text":"Great sandwiches. The grocery items are overpriced but I go for the food. Excellent reason","useful":2,"cool":1},"IMEVp-YgKEyMWd2FgWz_QQ":{"text":"Went in to pick up a meal to go. None of the staff was wearing a mask while preparing or h","useful":0,"cool":0},"G9muOV2lNHsSGNKRpzFM0A":{"text":"Sad to say that the the divine steak and egg sandwich cannot make up for the service and t","useful":2,"cool":0},"98lBTVE4M8Fqam8N20HPTw":{"text":"Wow what a hidden gem!!!! Very clean and tidy place with ample seating and enough room for","useful":1,"cool":1},"1s9cHhNGNzKyGTk-ng-UGg":{"text":"These po-boys are OK, but not great.  I've had far better.  They put too much mayonnaise o","useful":1,"cool":0},"mmBF0jz1XQ-2KFZvfP1Vcg":{"text":"This is hands down my favorite deli in New Orleans! The food is always made fresh and quic","useful":1,"cool":1},"g8bDfORkHQlfxUIuSSxxyA":{"text":"Tried the wings. I got the bbq wings, not my favorite. They weren't seasoned and it seemed","useful":2,"cool":0},"S23_79zIbdbz-9cP_88vyQ":{"text":"So it's been 3 long years since I've had a chance to make it back to NO.  I've been cravin","useful":1,"cool":0},"ZWnKOaq5zIa5DjOpRNDmXQ":{"text":"The portions were large, the price fair and the food was good. Best of all the staff was g","useful":1,"cool":0},"IRi0FHAlfRh7y_jmtbytvA":{"text":"It's sad to leave a bad review but as much as I love the Poboys is from this restaurant ev","useful":2,"cool":0},"FnJP8hYgmuC4U9kPZ3oC4g":{"text":"So it's unfortunate I have to leave a terrible review because I did enjoy some of the food","useful":3,"cool":0}}