{"IRMbEuQx5XctmqLimNZvGw":{"text":"Yummers.  Your staff at the outlet mall , when dealing with tourist  could appear more hap","useful":0,"cool":0},"u2q737zr0mtUgf77OqpwhA":{"text":"Great spot 3rd time there but my beignet was a little hard but it was late in the day. But","useful":0,"cool":0},"nl6_QGoErZc4cJP7d3XsTw":{"text":"You guys rock!!!!!! Seriously I come in and eat and everything was just perfect never have","useful":0,"cool":0},"Z9lhIRQMcF4O6kWfQLeXhg":{"text":"What is there not to like about the Cafe? One can't come to New Orleans and not stop at th","useful":0,"cool":0},"7o3-9ah2ZGK1eFhzFiuImQ":{"text":"Eh not sure what the hype is about. I love sweets and have a huge sweet tooth but I did no","useful":0,"cool":0},"lQ6E7NyD89ST0DBCLML2yQ":{"text":"Great beignets and a great location, especially on a hot day since the Riverwalk is well a","useful":0,"cool":0},"gPrTS9238WFuFVWyGoVUiA":{"text":"Breakfast Saturday morning-\n\nHOT coffee. Put a few cubes of ice in before scolding tongue.","useful":1,"cool":0},"4jDXNNIPvb_SHAAHSJKfYg":{"text":"This place is great every time I go. The line is always long, but moves fast. It is worth ","useful":0,"cool":1},"-Uk1BMC7H-wbcNNmf915Og":{"text":"Stayed at Hilton and this was connect through riverwalk. When in Nola you need to have beg","useful":0,"cool":0},"s6-Oq-cH9oi41JMm0ghSfg":{"text":"The beignets: it's alright. For those who never tried it ... it is literally fried dough d","useful":0,"cool":0},"f_koR60O9cSx5QyoK0kR2A":{"text":"From Dc. I would say, super delicious! The best donuts in my life. Even now, I want to eat","useful":0,"cool":0},"pkxv7rIAOtuFJ5K7-0Nheg":{"text":"A must-do. We tried six different beignets while in NOLA and these are still our favorite.","useful":0,"cool":0},"2mIrZKP48VZVkPNIMCppaw":{"text":"I don't understand the hype.     Foreign (Asian) staff doesn't exactly speak English.\n\nThe","useful":0,"cool":0},"URuRzCLpKVtz8yjzIOlnQQ":{"text":"A must if you are in NOLA. Great service and a nice place to start your day of sightseeing","useful":0,"cool":0},"2XG-njdZsVfqWthhfTb63Q":{"text":"I definitely like the location in Jackson Square better, it just feels a little more like ","useful":0,"cool":0},"7Yy3Pmvo0vw7RuPaKfU6jQ":{"text":"A must!!  Beignets and Cafe au lait (chicory) are great!  Service was pretty fast.  Just w","useful":0,"cool":0},"hvldsTIPooYrpwVlkILu_A":{"text":"Crappy place. People working here behave like they are having fun in a beach resort while ","useful":0,"cool":0},"lXFn99CqIOTbUYrfurQmDQ":{"text":"I never stopped in here before because the line was out the door. That was a big mistake o","useful":0,"cool":0},"zf1MAm2-UtbldvyhUdH-Xg":{"text":"If visiting New Orleans, or being a local, Cafe du Monde is your infamous beignets and cof","useful":0,"cool":0},"86BCmf3hr6uHPWpfV4l3gA":{"text":"Exceptional coffee, beignets and service. We stumbled across this Cafe Du Monde on acciden","useful":0,"cool":0},"ZuZXz-O0BIZIDRUN1iXF2g":{"text":"My first and best beinet experience. Yum! So hot and fresh. Lots of powdered sugar. I went","useful":0,"cool":0},"LyZt1PzDdB9-UJy3QtiqfQ":{"text":"Tremendous wait of at least 40 minutes for a table and 30 for takeout. An order of 3 beign","useful":0,"cool":0},"cj8qFu2YJospymVbEg-O2g":{"text":"It was my girlfriend and my first beignet experience. And it was well worth the cherry pop","useful":0,"cool":0},"Ott5McWkJIGoanwGg2ikPA":{"text":"Love love love this place! Make sure to get a coffee with Beignet! Just makes it that much","useful":1,"cool":0},"khUkzG-4Xtz2q6KpSyGy4A":{"text":"OMG! Never had beignets before but I'm glad I did! Very delicious!! I had to get some befo","useful":0,"cool":0},"AEJFGFeXMI415cBUf8OSvg":{"text":"If you are not diabetic, want a good sugar rush or want to take a chance on experiencing N","useful":0,"cool":0},"dTZRMvtciqyUet91jUGqNg":{"text":"Everyone told me I needed to try the beignets so I went there. I was disappointed that the","useful":0,"cool":0},"MJgHwur42ZAofetCvO37ig":{"text":"Located in the Riverwalk mall. I went there on the same day with thunderstorms so I was no","useful":0,"cool":0},"DGQN9rb2uqs5N9AA_hjudA":{"text":"Missing the charms of the Original in the French Market, but the staff is quick and friend","useful":0,"cool":0},"BIKCcrgkZ4WUu9zzodQzxg":{"text":"We've been to NOLA before and of course you have to get beignets. That said, if you want t","useful":5,"cool":0},"01tEdAOBLmfi_tetWaDTcA":{"text":"Love the beignets & their frozen cafè Au lait! I was in NOLA for 3 days and I came here al","useful":0,"cool":0},"DD3KnqzvEkEHdYkbFS9trg":{"text":"I had to try beignets, so I popped in after my conference. I ordered beignets and iced tea","useful":0,"cool":0},"ZXHyDJ9i4keCnYe1MUL7rA":{"text":"I love fried dough and powdered sugar. This place doesn't disappoint. I only give it 4 out","useful":0,"cool":0},"-_ezc_ig21q0GLBpRkKVmQ":{"text":"Fantastic! I like it so much better than the original Cafe du Monde on Decatur. Both have ","useful":0,"cool":0},"W5fdFl36mdr1PuW-aqmx0A":{"text":"So glad we went to this location not the one by the French quarter. This place is located ","useful":0,"cool":0},"lpjmkpRjxC49TaZTbwrv6Q":{"text":"Visited the Riverwalk location for an afternoon treat. Beignets were AWESOME and hot Mocha","useful":0,"cool":0},"KsyOfAivDiBSMp_cIC-DwQ":{"text":"I knew I had to come here after hearing time after time that nobody does beignets like Caf","useful":0,"cool":0},"Kj0ts0jyg53XUajrUFd1Qg":{"text":"Everyone told me that Café Du Monde was the place to go if I wanted to try my first beigne","useful":0,"cool":0},"JEIU0T4-qeAHjqOkCJEaiQ":{"text":"Located inside the riverwalk mall, this place is BUSY and i see why.\n\nBeignets served warm","useful":0,"cool":0},"-OHpRMoxugZGSQLnwL25sQ":{"text":"Definitely had to make a stop for beignets and coffee.  There were five of us and we order","useful":0,"cool":0},"PLvGgysOTFuNw3UQWUI3ZA":{"text":"Beignets are to die for!  Very worth the wait. The wait is not very long and the good thin","useful":0,"cool":0},"10diQwta2CA-jfUiPvpu7g":{"text":"Cafe du Monde is a definite must if you are in Nola. You can't come to New Orleans and not","useful":1,"cool":0},"kWbDiWlZ71U80sE3fuuzlg":{"text":"This is one of those things you have to do at least once I suppose. I found the beignets s","useful":0,"cool":0},"wLLo2YHbYpZELM_aoXYD8Q":{"text":"This is a very much unpopular opinion but I don't really see what hype is about a fried pa","useful":2,"cool":2},"WdBEsZMVFqUN7S2rR7TKPg":{"text":"It's so cliche but come here if you're in the area. Come during off hours as I don't think","useful":0,"cool":0},"e8aok9Lh4DV4rwYDSVinOQ":{"text":"Note to visitors:  they only take cash!!  Ok, now for the good:  beignets are piping hot a","useful":0,"cool":0},"Js3FUcNkJwujaDzAN3kqCg":{"text":"The must-have doughnut in NOLA. Epic tourist trap but you must try it at least once. Don't","useful":0,"cool":0},"LwT4zvLd3f3X_7NH1LyTAg":{"text":"The beignets were fresh and tasted great. However, the service was horrid. The waiter coul","useful":0,"cool":0},"3e_T6BxU4Lc9_8-Z4yah8g":{"text":"We went to the Riverwalk location to avoid the crowd of the original. The beignets were ta","useful":0,"cool":0},"uYUdz7FzyQ-QH9I3e8qxNQ":{"text":"Supposedly the best beignet in New Orleans.  They were certainly good but I have had bette","useful":0,"cool":0},"TZutudSnEA3jZQzvEgXt4w":{"text":"Anytime you are in New Orleans try their famous beignets. Delish! I visit this location ev","useful":0,"cool":0},"xPFWI-ujimMse3NxroNHlQ":{"text":"Not worth the hype. Seating was crowded. Staff wasn't very friendly, but what can you expe","useful":0,"cool":0},"ulfQm4hI8NX7leRvayIf3w":{"text":"It is always nice to come here.  Service is great although they are always really busy. We","useful":0,"cool":1},"xJzHwc_zKZb0tL1oclBWDw":{"text":"So good!  Coffee is way too strong for me though.  These are the beignets everybody talks ","useful":0,"cool":0},"ywTnGrXWLF2ZRpxaALJX0Q":{"text":"Yummy. Great prices, quick service if you go early in the morning or to the To-Go window.","useful":0,"cool":0},"PH3D5N4doN_aQpB5AlmLWg":{"text":"Beignets and coffee/milk/orange juice, what could be better!  It ended up being our dinner","useful":0,"cool":0},"nQlRLb5UCb9FeOiEiuekWw":{"text":"Yummy is all I can say. Someone told me the Beignets are like funnel cakes and that is so ","useful":0,"cool":0},"6zbsnofbfai0I9TwbApgrQ":{"text":"What can I say?  It's an institution.  Beignets were hot and sugary, but ever so light.  C","useful":0,"cool":0},"JmRS8_3EE3kY6HgaUGZzJQ":{"text":"This is the paired down version in the mall, but if you want the highlights of beignets an","useful":0,"cool":0},"Tc3hOFzYXL1YcB2THWPK9Q":{"text":"This is definitely a stop you must make when visiting New Orleans. Those beignets taste li","useful":0,"cool":0},"yKoNiU93EEgPUgY0HZHSuA":{"text":"Can't get enough coffee and beignets. Good spot if you are looking to get something quick ","useful":0,"cool":0},"vQRcqKUnA1w3dXOh172F6g":{"text":"NOTE THAT THIS IS FOR THE LOCATION ON THE RIVER WALK, NOT THE ORIGINAL IN THE FRENCH MARKE","useful":0,"cool":0},"b5HdMJQAO1Ku-M02POoVeQ":{"text":"Traveling through and wanted to try this place before our cruise...the cashier who took ou","useful":0,"cool":0},"QA31tZAz40J2u6q4Pr_tPw":{"text":"This is it people-THE place for beignets!!! Don't be fooled by the imitation spots!!! Thes","useful":0,"cool":0},"3A6ROxQRGGRNV0EUAJEhWA":{"text":"For breakfast I had the hot sweet and fluffy famous beignets. The were perfect. Ofcourse I","useful":0,"cool":0},"yAQni2peHn-caB3NnSoBAw":{"text":"Walking through the French Quarter, had to stop for beignets at Cafe du Monde. For $3 you ","useful":0,"cool":0},"G5TgUYZMu0K8STnuw0TC7A":{"text":"A must when you travel to Nola! If you have the time, walk around the back of the building","useful":1,"cool":0},"W5-sfeMF9Xpy8VlUu0X6bw":{"text":"Came here during Essence Festival 2015. We heard that beignets were a staple treat of New ","useful":0,"cool":0},"hxYV_3lq1BDFb8RmJFrzXw":{"text":"This is probably one of my favorite places to have taken the time to visit and eat at whil","useful":0,"cool":0},"xifhjhUHLAtsfyiqRQBHvw":{"text":"Thank god for Cafe Du Monde and there 24 hours, seven days a week service. I came here dur","useful":0,"cool":0},"1UZas3axOSZde_iTcsELlg":{"text":"A must-have for any New Orleans tourist!! I'm sure the French Quarter location is better, ","useful":0,"cool":0},"8ZCoBlcfkMbi3bAicSCcPg":{"text":"Watch your money at this spot! I gave the cashier at the window a $20 dollar bill and 50 c","useful":0,"cool":0},"2jBWh9joNuQ0jY5UVG1o9A":{"text":"I didn't understand the hype of this place. Yes the beignets were delicious but I thought ","useful":2,"cool":1},"2vkkYBBAelerQHfn3o4PeA":{"text":"How could I forget posting this review. I am not a donut snob. Simple glazed donuts from D","useful":0,"cool":0},"Sg9H0YCL8NTkQfrBGjVweA":{"text":"It's probably been years since I've been back to the original cafe du monde. I feel like t","useful":0,"cool":0},"pAl_vTyY8Blfya-BJgMRWQ":{"text":"This is definitely a must try if you are in the New Orleans area. However having tried the","useful":0,"cool":0},"1rToTDOP1IsjAFaQ3oAMqA":{"text":"Beignets are great the staff are arguing and cursing in front of customers. It's sad to se","useful":0,"cool":0},"K6wEfdGtvyYFtW2AHPPOZA":{"text":"Service was surprisingly good and we got our food quick. Beignets were DELICIOUS and coffe","useful":0,"cool":0},"legAO3XKWkro556LH_3DRg":{"text":"The coffee and beignets are as delicious as when I first moved here in the mid 90s.  I hop","useful":0,"cool":0},"QUbhXmk3rkrkYV4gNy6E9g":{"text":"Great location if you want to avoid all the tourists in the French Quarter. Plus, they acc","useful":0,"cool":0},"o7lr9P3e3FwpdwqPGL9nZw":{"text":"We waited in line as usual to order and eat our yummies ... lady working the register was ","useful":0,"cool":0},"hzkml2Q7ZoNFRrzLty6Xxg":{"text":"Long lines, old school style. Have always made a point to stop at any of their locations w","useful":1,"cool":0},"Tut9I1bzbfHwgjqz7pwrng":{"text":"the beignets were awful. \n this place should be ashame to sell beignets  tyey were heavy a","useful":1,"cool":0},"iW8OjJw5tJE7o3N09YneQA":{"text":"This is a must try for everyone visiting New Orleans.  I have been to the original locatio","useful":0,"cool":0},"7j-nZrefHf8V03VzDFKKbw":{"text":"This is a New Orleans staple. If you haven't had beignets, get some (it'll also explain th","useful":0,"cool":0},"iHUvUjQZkMK74ziXwvdqjw":{"text":"I love this location because it was closer to my hotel and the weather was terrible so j w","useful":0,"cool":0},"9aq4--wDBpyyB9aidXezpQ":{"text":"I had a great experience!! Service was quick and really nice! Be aware that it is cash onl","useful":0,"cool":0},"FH3uQrSd5I3OUMjiobN8-Q":{"text":"The most amazing beignets ever! But how can you go wrong with fried dough and powered suga","useful":0,"cool":0},"7S0oQ2p8qQ-dyMjTZ9s0OQ":{"text":"The most delicious beignets, and wonderful coffee. The beignets are delicious, and especia","useful":0,"cool":0},"ZzFrHGRcsANKY5y1PXh-Bg":{"text":"Finally got a chance to try out the infamous Beignets at the Cafe Du Monde. Did want to go","useful":0,"cool":0},"tuZI5fHCsdQg5WWEY0I3AA":{"text":"AMAZING!!! Went around 10 p.m and didn't have to wait in line!! Make sure you take cash! T","useful":0,"cool":0},"pW-ItFCmGEgUY2RmCVSoYA":{"text":"Bucket list  warm, fresh, and very yummy! Long line but it moved fast and worth the way!","useful":0,"cool":0},"ICfoI9i8u3nfhkU5HeZkZQ":{"text":"So good! They made our beignets fresh and brought them to our table. I had a delicious hot","useful":0,"cool":0},"2Zh3SAS3fT0nYWW8lHvJ1g":{"text":"Cafe du Monde and their famous beignets and cafe au laits!!! This place lives up to the hy","useful":0,"cool":0},"3rxVyRy_DNF5A-M4iLx1aA":{"text":"This is a lesser know and less popular location of Café du monde so no wait and there were","useful":0,"cool":0},"Q-mdrWqVO9oeQ6mpsLT5Yg":{"text":"This is my first beignet and it's wonderful. I hate that it was raining on Sunday and I co","useful":0,"cool":0},"3kerSD12nNDgtJ-iWY_WUw":{"text":"This isn't the original Cafe du Monde - it isn't open 24 hours - but at least they accept ","useful":7,"cool":3},"4x8pPv1NEIdAAGj7v-qKLw":{"text":"This place is a must if anyone visits New Orleans.  I went to New Orleans and I visited ca","useful":2,"cool":2},"g8T6fnezZIzGRsy1gNEw6w":{"text":"It's a must do & the beignets are great. I wouldn't do it again on a weekend. This is a se","useful":0,"cool":0},"17LH1OteGci_HeSDbjkViA":{"text":"You came to New Orleans, which means you went out. If you went out, you maybe had some goo","useful":0,"cool":0},"ILbmPTb7__vCWFhU2Ga1uA":{"text":"The one at the mall the service was beyond amazing they were quick and friendly and very p","useful":0,"cool":0},"FwlG-Tt3K1rBZezmeoLFVw":{"text":"Finally made it to New Orleans and finally got to try beignets. We tried both locations, t","useful":0,"cool":0},"5Y61GfD3W3SjKp2zvOyJ_A":{"text":"Great Beignets! Had tons of powdered sugar. 3 for $3. Great view of the water where you ca","useful":0,"cool":0},"Gjp3UZxmJPLdaUvi2ACGOA":{"text":"Long lines but they move fast. Everyone says you must go here atleast once and I missed ou","useful":1,"cool":0},"pxYRe2n4_6WSl9LLcOYQ2g":{"text":"Sooooooo, we've been here on 2 separate times a year. During New Years, the beignets were ","useful":0,"cool":0},"dX3X9KxUzixFurnP3wxGiQ":{"text":"Ok we thought we were headed to THE Cafe Du Monde, ya know right in the french quarter wit","useful":0,"cool":0},"GpzQOkrPgu2l_VutyfYAKw":{"text":"What's a trip to New Orleans if you don't at least get beignets and Cafe du Monde coffee. ","useful":1,"cool":1},"Kwbfzlg-BW3hXtB2ork_WQ":{"text":"Had to stop by the one in the mall due to not having enough time to go to another one. Was","useful":0,"cool":0},"V5jXS6fGmNFbWq77X-8Qqw":{"text":"Great little place for coffee and beignets. First time having them and truly the best thin","useful":0,"cool":0},"I8K6y7biTdRDek21eErtGg":{"text":"I think the theme of my trip to NoLa was ridiculous long waits for food that never lived u","useful":0,"cool":0},"LmGd5r9uMl9ntQyhWanNcg":{"text":"If your in New Orleans you have to go to this historical landmark. Open since the 1800s th","useful":0,"cool":0},"Q0hQt7mP6bRcbNDz_9Me3Q":{"text":"We used the takeout window instead of waiting in the long line for a table.   Got the cafe","useful":0,"cool":0},"UKiq9uEAse18jZmd8Ze6Tw":{"text":"No words can describe the taste. It must be experienced. This one at the Riverwalk had no ","useful":0,"cool":0},"Xl7jP7jTjAXx3mVRAfujag":{"text":"I really wanted to love this place but I just didn't like anything about it. My beignets w","useful":0,"cool":0},"bYi6i69XuFt1ms9tFpImhA":{"text":"I liked the beignets! I just wish there were more options and varieties, like maybe adding","useful":0,"cool":0},"ZNZd6XgRQKBSrhY7UyJ5_w":{"text":"Flavio the manager was so rude. When I didn't receive my beignets they weren't in the corr","useful":0,"cool":0},"w3gWdA6NqO678yxszVX9hg":{"text":"Café du Monde always comes highly recommended to anyone who is planning on visiting NOLA, ","useful":2,"cool":2},"oi9pTMknh4yermJQIS2LIQ":{"text":"Cafe Du Monde is an obvious must if visiting New Orleans. We were glad we visited for deli","useful":6,"cool":3},"sMLvQQXcBt_1sUS-L4mIeA":{"text":"We loved the beignets and the coffee is fantastic. It looks crowded but because the only s","useful":0,"cool":0},"z21eSRucL6WDKnaKqJwn1w":{"text":"We can't help but stop here when we visit home because it encompasses everything that is N","useful":0,"cool":0},"XYaNfWsRxmJ_46G6FwF0Yw":{"text":"This is the BEST KEPT SECRET in NOLA.  We were surprised to find Cafe du Monde at the Rive","useful":0,"cool":0},"vLqwWd6eQh517bQEMCbDyg":{"text":"This location of Cafe Du Monde lacks a lot of the charm (and 24/7 hours) of the original s","useful":0,"cool":0},"I_cy2_H0WwJq9FpXHwbU4A":{"text":"If you like waiting in long lines for donuts then this is the place for you. It's a touris","useful":1,"cool":1},"tzykwNS5rCXHDwOZjFz5Zg":{"text":"This place is a win times ten! So for days everyone was telling me that I had to try these","useful":0,"cool":0},"EFgA97cpvsayyaHL72rDtw":{"text":"The beignets here are world famous so I had to stop by while in NOLA. It was a little crow","useful":0,"cool":0},"iqAY4iGDQUllr5QYmsQtqA":{"text":"Great beignets but super crowded. I'd definitely go back! The price is super cheap too. Ca","useful":0,"cool":0},"KRDmeWzqsVsAAJBLlNO3Rw":{"text":"This was my first time experience a beignet.  I had high hopes but I wasn't impressed.  Ju","useful":0,"cool":0},"GF59N2taHStk0Z8SIEpXIw":{"text":"Service was fast and courteous on a frigid night.  The classic hot chocolate and beignets ","useful":0,"cool":0},"zf-tjikT5NIFYlvB3aVrNA":{"text":"Yep! Drove an hour and a half early in the morning to spend a day in New Orleans and did n","useful":0,"cool":0},"XQmGC5jBVmfj5KsjIWjLSw":{"text":"It's much better to come here to enjoy the same cafe au lait and beignets with a river vie","useful":0,"cool":0},"ShHWcMjLnCwxuOwk7yzXRw":{"text":"I couldn't come to New Orleans without trying this place! LOVED the frozen cafe au lait. I","useful":1,"cool":0},"GCUGfhtMs-5wD_SZdoLI2A":{"text":"As always Café Du Monde doesn't disappoint, good beignets and service, the main one by Jac","useful":0,"cool":0},"PEv54omEnq4kmo8kyQ8zSQ":{"text":"Must do when in town ! Great place to sit down have a treat and enjoy all the buzz around ","useful":0,"cool":0},"XDQxuLWc49cL291wjD1SDg":{"text":"Cafe du Monde hack - visit this location in the Riverwalk Mall! Shorter lines, they take c","useful":1,"cool":0},"YVaQ7ASnufkoxAUe-4dXQg":{"text":"They run quite the operation! The line was about 50 people deep, but moved so quickly! We ","useful":0,"cool":0},"_DSUJM4I_m4LI7aowwg75w":{"text":"The coffee and beignets were absolutely delicious! I would stand in line over and over for","useful":0,"cool":0},"vBBe23_3XmwUrVFKesWsTA":{"text":"It's a classic joint!\n\nThere's always a line, hectic and can be a little messy but it's al","useful":1,"cool":2},"rQ9ThdyMH9wAyTGC_8Q1Tg":{"text":"Oof, sorry to say that the beignets are rather heavy and not especially yummy -- and yes, ","useful":0,"cool":0},"l0PzZ5CzML1mnOC80ZD1qw":{"text":"Returned to Cafe Du Monde on a second trip to NOLA and loved it just as much. This is a mu","useful":0,"cool":0},"csk0lFAvNaH0u0XkBwnung":{"text":"Beignets were good, employees were very lazy and not very welcoming. Probably 8 people beh","useful":0,"cool":0},"-JdU2YblduJtBLLUYs-9PQ":{"text":"Didn't expect 3 in a pack each. One of my last stops before we headed home. Tastes better ","useful":0,"cool":0},"16SW8Ep2ICahKYletLjjgw":{"text":"I actually prefer this location closer to the convention center though it was very early m","useful":1,"cool":0},"3Nr3mYW-mJvlsgQwr1OptA":{"text":"We spent a few days in New Orleans and this place showed up in every google search and had","useful":0,"cool":0},"AVKiYeQE-6zNPpE503y2fg":{"text":"This cafe shop is known for their banette, I think that's how you spell, it's like the don","useful":0,"cool":0},"pTfEtrGSqnSuEVn5QZYHmw":{"text":"For my 1st time visiting and trying this place I was not impressed. I order the Iced Mocha","useful":0,"cool":0},"pofNcNV-FoN4ybUl9t9nDA":{"text":"Well when in NOLA they say you must go to Cafe DuMonde. So I did! More than once;) \nThe em","useful":0,"cool":0},"iXnwiQJsvQcelxkkRYYqQQ":{"text":"Very good beignets and cafe au lait. This location is in Riverwalk shopping center. Its sm","useful":0,"cool":0},"UC4fxJuIkybp700dQE4VbA":{"text":"If anyone travel to New Orleans please stop by This place. One of the most famous place in","useful":0,"cool":0},"TVh6yVfhESgnkqsNoYENJQ":{"text":"This place holds up for its name. With only one menu item, they have perfected the French ","useful":0,"cool":0},"epJ2AOVboMvQOIiAp3qRvw":{"text":"We had to visit while in New Orleans. Service was friendly and as quick as possible as thi","useful":0,"cool":0},"q5yN6DluTco1x9WX7hE60Q":{"text":"Great beignets! It may sound like a tourist trap but honestly it is good! The beignets are","useful":0,"cool":0},"dlN-pXYJ7pEOx2REUvY5pw":{"text":"Beingets we're yummy. Hot chocolate was great. This place was extremely packed with people","useful":0,"cool":0},"iw0vf0NPNJHLkWxyjGEIuQ":{"text":"As a french, i think they have really good beignet that taste the same as french one! But ","useful":0,"cool":0},"LXJu5zWigwJ_Gw97UUv2Jw":{"text":"The boyfriend and I went to this Cafe du Monde location by mistake on our first day in NOL","useful":3,"cool":2},"Fc6xE6bU35z5tvGbHiyvMw":{"text":"I prefer the other location but this is OK. It is not run very efficiently but nonetheless","useful":0,"cool":0},"aoOcL7AJQ0Rfa3u7wOlB6w":{"text":"What a treat! We've had beignets throughout Baton Rouge but you can tell Cafe Du Monde was","useful":0,"cool":0},"M1EWn2pzj1sEYffVIJYAEw":{"text":"This place is an institution. Simple menu, few choices, keep it simple to achieve greatnes","useful":1,"cool":1},"CWkpNZD0GyUMZ8swicsSlw":{"text":"I've never had beignets before my trip to New Orleans. I found that Cafe Du Monde came hig","useful":1,"cool":1},"vKFnK6haaLmBBz46IWYZiQ":{"text":"Perfect place to just sit, chill...drink some coffee and eat some great beignets! Love com","useful":0,"cool":0},"I23cSK8pa4THbr4pRIWFWw":{"text":"Bring a dining companion for breakfast, order two cafe au laits and one order of beignets ","useful":1,"cool":2},"mbYltbqEvMmA0gXjoJ5Euw":{"text":"Rather than add to the 12k reviews for the flagship location on Decatur street, I thought ","useful":2,"cool":1},"RW_RYyf9wv0J1bX0EqgXyA":{"text":"This was my first time having a beignet and it's essentially a thicker fried dough. I hone","useful":0,"cool":0},"moatimNco324YUDhLD9ekQ":{"text":"What can I say? This place is famous for a reason! One of our favorite parts about visitng","useful":0,"cool":0},"3DgaaWtKPsfAXrylB42jZA":{"text":"Top notch. Long line but we found a hack. Very hot today but we got in a side door to the ","useful":0,"cool":0},"b08_kLJjHGnnlHWmdcotYw":{"text":"If you don't come here when you travel to NOLA your missing out.  This is a must at least ","useful":0,"cool":0},"bFBenNrMBt712xlozbomyw":{"text":"Best beignets I've ever had. Quick service. Touristy. Cafe au lait on the side. Start the ","useful":0,"cool":1},"eTDlfaYP8hj3tn3Y6c36Ow":{"text":"Place in Port NO is open at 7 am . Went there at 8.10 ( like the website said)  it was emp","useful":0,"cool":0},"0QYmoZjvtRTy-hnL1sSe0g":{"text":"This is seems like the lesser know of the locations but the line was long and there was a ","useful":2,"cool":1},"gEMh3uCAoLrCtgYwsxuhXg":{"text":"Pleasantly surprised when I was looking up directions to the original. We walked by the or","useful":0,"cool":0},"Jy176ZLvMWbgLkh2iz6SCw":{"text":"Really, really busy and quick service. We ordered a few coffees and beignets after dinner.","useful":0,"cool":0},"wFLzlGUtnldMx74OPQRsrQ":{"text":"I went to the cafe in the mall, because I was in a rush, and I heard it was less crowded t","useful":0,"cool":0},"3iJLHilGrvUkzMQdctn7MQ":{"text":"You can't beat a place open 24/7! And if you want to buy cans of coffee and beignet mixes,","useful":0,"cool":0},"56iomf0uP9dYQ8A6ADrhkQ":{"text":"We came here for some beignets and to buy some souvenir packages for my family back in New","useful":0,"cool":0},"rjIUXWALXgW_l41wPpj4gw":{"text":"We liked this location better than the original, the Beignet's were hot and the line was r","useful":0,"cool":0},"85ar536ZoXIzJzzw4B8Alw":{"text":"Cafe du Monde has the best beignets in NOLA. They are delicious, fluffy and so fantastical","useful":0,"cool":0},"sf4DDtHm1bsukWeJoYv4IQ":{"text":"Coffee and beignets/doughnuts. Doesn't get better than this for a morning snack before a b","useful":0,"cool":0},"eCRP4k3WKOciBv3poXTT-A":{"text":"Good place if your in the mood for something sweet. Also a good option to have a simple br","useful":0,"cool":0},"WkuGZLc53LsIof5hl-Accw":{"text":"Okay is this an institution, yes. Is it worth the hype, not sure.  We went later at night ","useful":0,"cool":0},"ssBmpWl6tL3iLh76cb9JUg":{"text":"We came to this location as 1) we were in the area & 2) we heard it wasn't as busy as the ","useful":0,"cool":0},"3DslOomgXnElLLjmOkGV1w":{"text":"The joint in the mall was awesome we were lucky and got a table outside and didn't have to","useful":0,"cool":0},"QGqbL8sQMl6kllCD8ldbWQ":{"text":"Three beignets you'll never finish on your own cost ~$2.40. You don't want to throw them a","useful":4,"cool":6},"2GQsfeY1peuZCrQlxaPY9A":{"text":"Coffee is good, way too crowded. The beignets were fine, however it's a lot of trouble to ","useful":0,"cool":0},"pwy0ZCiRHcEiq31Rqk_luA":{"text":"Long line to get in but it moves pretty quick! The service was a little slow, but it's cha","useful":0,"cool":0},"Comd2rOfpZL_vzmqxdzacQ":{"text":"had to many people say this was a \"must\".  at first the long line outside the patio was a ","useful":0,"cool":0},"EcRb7MZzo67byARTEXuLaQ":{"text":"Must try! That's all I need to say.\n\nPs. Lines are a bit long, but place is open 24 hours ","useful":0,"cool":0},"5zt9cNb8ao6LOfYf-H198A":{"text":"We came to town from Los Angeles and knew we needed to try the Beignets. We tried twice at","useful":0,"cool":0},"ATg7PzrGp5zdhHlXYWzzqQ":{"text":"I have had the privilege of frequenting 2 locations in NOLA. The Riverwalk is less busy bu","useful":0,"cool":0},"wiPnnmbfyd9vaxSnIdjrfw":{"text":"This place was packed!!  But they move quick!  Maybe because it was hot!   The beignets we","useful":0,"cool":0},"FLuKEQxNCOZjyyIvAarNcw":{"text":"We went here twice and the beignets and coffee were very good! The staff was wonderful the","useful":2,"cool":0},"14MMJq8-vXin_8-gfVB-AA":{"text":"Poor service, dirty, sticky floors, horrible restrooms. The server placed a dirty tray on ","useful":1,"cool":0},"n9L9xL0FAjRwpU02frR2TQ":{"text":"First time ever coming here. The beignet was pretty delicious despite the fact that it was","useful":0,"cool":0},"VyVsNSo3eVsARoilUyOoCg":{"text":"I loved that you don't have to wait in line. It was a pleasant surprise that you can sit d","useful":0,"cool":0},"TmM3SHv3kkNq32pbgQEE9Q":{"text":"These beignets are also delicious, but if you haven't been to the original location, I rec","useful":1,"cool":0},"xDsbnIXVl39XRIfu5OR0IQ":{"text":"Lol I agree with the other reviews... this place is a must. It is open 24 hours so you hav","useful":0,"cool":0},"IAt3oquzKnU-zdeWMvvVKw":{"text":"Mandatory stop if you are visiting New Orleans. No line when we visited in December 2017 b","useful":1,"cool":1},"CgvUg2dnkbdxcuK1rDmWYQ":{"text":"If you just have to go to the Cafe Du Monde, this is a great alternative to the super busy","useful":0,"cool":0},"Bhm-cRIkbqFw_3EFVRec7w":{"text":"I love the Beignets at this place of business ... The line was long.. But it moved very fa","useful":0,"cool":0},"lOgEAjgof7OQS0ovbFvwfQ":{"text":"Ok , wow, they know how to make beignets! And the coffee is the best! And that's all they ","useful":0,"cool":0},"nEGXHBh2wO70hcsv0GHcfQ":{"text":"My fiance and I were just in New Orleans yesterday.\nAnd sure, just like everyone, you want","useful":1,"cool":0},"m2S_5uHlQl7P2NQngRnVRw":{"text":"This place is a definite tourist trap, but it also never disappoints. The beignets and caf","useful":2,"cool":0},"ulImF5yJYpCsfbnE9O08DA":{"text":"It's inside the Riverwalk Mall. We came here because despite being tourists ourselves, we ","useful":0,"cool":0},"F2azMQmOerJRPxCSvMeUbQ":{"text":"I was told this palce was a tourist trap and I think it may have been.  However, I don't r","useful":0,"cool":1},"PtTVuP0zfSDXS1fzPOrCfA":{"text":"The cafe au lait was deliciously very hot! The beniets were just right... Puffy and tasty.","useful":0,"cool":0},"2hN4cWpw6cYaZlE2st7MJw":{"text":"Beignets lived up to their reputation. Do you want some pastry with that powdered sugar? C","useful":0,"cool":0},"bj6Ez6slKNh11sLJo1vE7w":{"text":"I am a huge donut person but don't really care for beignets so don't know if I should be r","useful":0,"cool":0},"1n2qhkV6a3TsOmuWlJQIQw":{"text":"It was ok.  There is a lot of hype surrounding this place and the wait to get in was long ","useful":0,"cool":0},"BjeE8yYYU6V58lAjAw1-tg":{"text":"First time in New Orleans, so we had to stop by and try Beignets! Warm and delicious. Busy","useful":0,"cool":0},"GXKmOU1riZzgG49j6Gl_7w":{"text":"Amazing! There is a \"to go\" window on the back side of you don't want to wait in the super","useful":0,"cool":0},"AW3j_sWj5PkuEAPLw3BZ4Q":{"text":"Pure sugary delicious! Waited all weekend to finally come to Cafe Du Monde! Although we sa","useful":0,"cool":0},"xvbexOtQW0n4P6KQweKwyw":{"text":"If your a tourist and you want to have a delicious snack without the people and the crowds","useful":0,"cool":0},"YVXx1kJnmOLkwza8jKo-Bw":{"text":"So very good. We 3 had a plate of warm beignets each. I would suggest a glass of milk as a","useful":0,"cool":0},"1JG0K4AUhWqLImoD8UnAgA":{"text":"I really obviously enjoyed this place! However I still think it is just a little bit over ","useful":0,"cool":0},"9z5NIUkznHj_7qMbFzmnDg":{"text":"Yum! Of course these are great.  Explains why they have been around so long. A must do whe","useful":0,"cool":0},"CFV9RNQkmmK_pZ_DllVBYA":{"text":"Pour la Bucket list de voyage de la Nouvelle Orleans ... beignet bon mais rien pour écrire","useful":0,"cool":0},"yZoVogIDkBmILeShP8RS7w":{"text":"Very delicious beignets! And their hot chocolate is so thick and creamy! Expect it to be p","useful":0,"cool":0},"S8Ahc0k1lkqe9l1SCE5WNA":{"text":"First time having a Beignet. \n\nAnd it is a delightful treat. \n\nI was figuring it would be ","useful":1,"cool":1},"0MAQI31Zm6ZCaLVWE4HZ3A":{"text":"The food is completely underwhelming. Didnt see what all the fuss is all about. Definitely","useful":0,"cool":0},"xlJinDDk6LawxkBwEgxwTg":{"text":"Absolutely delicious as always! The beignets were delicious and fresh, loved being able to","useful":0,"cool":0},"kLKoQ0d56_XMENEfADnkRw":{"text":"A must do when in New Orleans.  The one in the quarter seems to always have a ridiculously","useful":0,"cool":0},"3bP3YlDAk7HPRKCy6F1jYQ":{"text":"This is always a must stop when I come to New Orleans. What can I say? It is Cafe Du Monde","useful":0,"cool":0},"PhthhJU74jX51T_0SVbQhQ":{"text":"These beignets were AMAZING, and there was no line compared to the original location. If y","useful":1,"cool":1},"3ek30c60DpFhc5JM-IWOSA":{"text":"Second Attempt - different location. The beignets and frozen mocha coffee was delicious. C","useful":0,"cool":0},"zE9DsnY4ulRS2mVv5mniGw":{"text":"When you come to NOLA, beignets are a must. After seeing the line wrapped down the block f","useful":1,"cool":1},"H4hfegJITPomxA5A4TyxQA":{"text":"My third time in Nawlins, and I can't believe I hadn't been to this spot before... The bei","useful":0,"cool":0},"qmUkdsoaIZfBlyrm5dcsaA":{"text":"Because this is in the Riverwalk shops - if you are staying at the adjoining Hilton or wor","useful":1,"cool":1},"uKD1xBQIgt68kPLQWin_Lg":{"text":"Everyone told me that I must go to Cafe du Monde to get some beignets.. so we did. They we","useful":0,"cool":0},"HwwrRGaWhdurQgzfN2UIuQ":{"text":"Cafe du monde is a fantastic place that specializes in beignets, heaping with powdered sug","useful":0,"cool":0},"jHoFQmsoyjhZT5FKyy6JwQ":{"text":"Service was fast and on point. Menu is basic beignets and coffee so even if there is a lin","useful":0,"cool":0},"aDxmTcAt50jhdR4yHYj20A":{"text":"I could not get in every time I want.the place was alway full of people.coffe must be good","useful":0,"cool":0},"sEM0NlGolwmHwpu64ffEfQ":{"text":"Fun place with great coffee. I would have loved to try the beignets but can't eat them so ","useful":0,"cool":0},"wjeMOiMvXM7mNIEVNE8d1g":{"text":"I'm in New Orleans for 2 nights and 3 days. My first night in New Orleans we went out on B","useful":0,"cool":0},"ExtjH-l16rDHpZKAZS7LJw":{"text":"Legendary name but basic taste.  I was very pleased with the service at this location but ","useful":0,"cool":0},"ZTJWxD5hBaL_DghuomGO-w":{"text":"Don't be afraid of the long line.  It moves suuuuuper fast!\n\nI was in the city for a quick","useful":0,"cool":0},"n01xX3YL0TLp8F8ZHBkWpg":{"text":"I am not a fan of sweets but my son loves this place. We came twice during our trip to New","useful":0,"cool":0},"OE-dGyGkd-LJG9w4zRFmnA":{"text":"Our first visit at Cafe Du Monde was not at the original, instead we went to the outlet ma","useful":3,"cool":1},"LfGCCSxRIe0rNP6qwI43PQ":{"text":"The beignets were delicious. I did not prefer the excessive powdered sugar but you can alw","useful":0,"cool":0},"TeUsHH8nMwFuvw-djm_bCw":{"text":"During busy times, expect the lines here to be substantially shorter than the original Fre","useful":0,"cool":0},"dBWp8BNwklNTa6EYlAqLwQ":{"text":"May not be the original location,  but it's inside the River walk mall and it's has  Air C","useful":0,"cool":0},"u6uSb9v7WMmLxXzg5p5FZg":{"text":"The line was long but went by pretty fast. And the coolest part was being able to watch th","useful":0,"cool":0},"WwITuWP5es-AZCVDlcZp-w":{"text":"What can I say?!? The delicious reputation is well earned. Walked over 4 days in a row whi","useful":0,"cool":0},"v3nN8g8hJTTWghl9xsv-qw":{"text":"Went to this location twice while in New Orleans in July 2017 and it was nice to sit down ","useful":0,"cool":0},"xBUQu8ANSRRetPTzIK9bOw":{"text":"Great Spot. This is a must when in New Orleans. The beignet was fluffy and delicious, the ","useful":1,"cool":0},"nuZCU-vE9BvcM95eRBbxvw":{"text":"I love, love, LOVE the beignets from here!  Finding this location was amazing!  Its less c","useful":1,"cool":1},"yWHVc6XSeSs8AE5aHhAj0A":{"text":"The beignets here are pretty good, it's light and tasty. Caffee on the other hand was wate","useful":0,"cool":0},"0vWchWA9PH5MbpiZ__l4Ow":{"text":"ONLY THE FIRST STOP IN NOLA!!! And the great thing is, you don't have to stand in line at ","useful":0,"cool":0},"S_-DCRlmsUzqE4CF3foJqA":{"text":"This is a must stop anytime I'm in New Orleans. The beignets are fresh and the powdered su","useful":0,"cool":0},"coGAcBQDAmKynx2WiK0rVQ":{"text":"I was here every night of my stay as my dessert before bed!! Every time it was just as gre","useful":0,"cool":0},"vhAbRzmf5jborgRwdab-hQ":{"text":"What is a trip to New Orleans without chicory coffee and beignets from here. This is New O","useful":0,"cool":0},"tVrIerwsk8oZQBafo38zUg":{"text":"Coming from New York this is what we call zepolli's 3 good size and a bottle of water was ","useful":0,"cool":0},"y-lhl9ZLOi0ABduDldm6LA":{"text":"I will dare to argue that this location in the mall serves better beignets than the origin","useful":12,"cool":7},"Y7JSCKAMQUGo6XvN6Zn_DA":{"text":"Yum! And worth the experience. While you can find beignets in many places, there is nothin","useful":0,"cool":0},"yxOxBJg7u6yMHSkZUN8dOA":{"text":"It was fun to try it once especially since it's an original restaurant in Nola. The beigne","useful":0,"cool":0},"H7_jdAzDY5Y7KL-ijZ0CIA":{"text":"Pretty good.  Wouldn't say it is a must have for New Orleans as it is pretty much a funnel","useful":0,"cool":0},"-aB-QvPSjEZMyeMfokrqvA":{"text":"The food was OK.  Nothing fantastic.  It's just one of those places you have to try at lea","useful":1,"cool":0},"I3SUrzjUF1UVAE6aHssFew":{"text":"Yesssssss! The beignets are amazing. Obviously. This location is super quick and efficient","useful":0,"cool":0},"t4RYfJ8rQv0tLOveJ12Kfg":{"text":"Amazing little spot in New Orleans! Easy to get in and out regardless of how busy it is. A","useful":0,"cool":0},"CHD5mbT197LnhBIgGIYt_A":{"text":"First time I tried beignets! They were awesome. I tried looking for other locations that s","useful":0,"cool":0},"5BVQn3blA-kDcczLN47fRA":{"text":"Sorry!  More hype than substance.  Overrated tourist trap with poor service.  Coffee was g","useful":0,"cool":0},"Xglp8AjcOJ0Pa6R74xAtZw":{"text":"of course, everyone loves the beignets here. the more sugar, the better. just don't inhale","useful":0,"cool":0},"juoMZsGR3beNQSTdufCPSA":{"text":"Were basically talking about funnel cakes and coffee and neither one was worth the hype. T","useful":0,"cool":0},"52HeaU7rnMz19O023qawmg":{"text":"It was the most disgusting place I've ever eaten in my life. Go inside and watch the waite","useful":1,"cool":0},"IrzWV86f8VaNcTonHJyOvQ":{"text":"Listen to locals this was amazing!!! Bring cash lots of it you will eat 3 and then take 3 ","useful":1,"cool":1},"taWSFv_sOMMcHOWDJIAGbg":{"text":"Must go just to say when you get back home \"been there \"dumonde\" that\". One of the oldest ","useful":3,"cool":0},"Ry8IFh8LMCAjZJ-wujtLmQ":{"text":"I am not going to pretend I am above behaving unabashedly like a tourist. I love the origi","useful":0,"cool":0},"ZOPe_JcDLZUG1GiJvUNPuA":{"text":"It must be an acquired taste because one sip of this \"coffee\" and in the trash it went! It","useful":0,"cool":0},"6fT6B6pBXsKfJufJwaw_IA":{"text":"Amazing. The line may be long but they keep it moving.  The beignets and coffee are so goo","useful":0,"cool":0},"456X-2f0IW6_cP6VDjdBqg":{"text":"Good. It is a must do while NO.\n\nTip- crazy busy, but the tables turn fast, so be ready to","useful":0,"cool":0},"FuzHY5gbsuWzacm-QDZ7PA":{"text":"Such an amazing ambiance Can't wait to come back!!!! Looooove the Beignets! Such a staple ","useful":0,"cool":0},"bm73m2-gbSTPj5jiKRMroQ":{"text":"I heard lots of hype about beignets and they are certainly tasty, but does it take much cu","useful":0,"cool":0},"0g4ytQRuMw-0nRRGf5j9hA":{"text":"It's a required New Orleans stop, right?  There was no line, which was really nice, but th","useful":0,"cool":0},"kUpk_3VjRdRtEqXJRXwTxQ":{"text":"Great beignets. They come in portions of 3. They each have powdered sugar on them-very goo","useful":0,"cool":0},"l4J2TFSlz9_bOmkK1kZZfg":{"text":"Not much to say here as the quality of the donuts and coffee is the same as the original C","useful":1,"cool":0},"Gpemmn8wWys5Ftivvhyzzg":{"text":"Horrible service at this chain at riverwalk mall - We.ate there for.breakfast ! We asked f","useful":0,"cool":0},"rdb_PxhrzM3CcCBhDWTDsw":{"text":"It is location right next to the river walk inside a mall. Take a walk next to the river a","useful":0,"cool":0},"7x76LN0XZ-9Gp0D63KOWdw":{"text":"It's a touristy must, even though it's messy and mobbed. However, I'm not sure the locals ","useful":0,"cool":0},"YY-GexZI6urHBFqPqPqAtA":{"text":"Lived up to the Hype! Would definitely go back again and this location only had a 5-10 min","useful":0,"cool":0},"VQn0rpCBH875ytYqDnlvvQ":{"text":"It's a tourist trap more than anything I guess you have to experience it at least once.  I","useful":0,"cool":0},"Yf4z2r3UKQoDmUsAYaiEYA":{"text":"It's a one of a kind of a treat with a long wait.  They really need a Maitre'd or traffic ","useful":0,"cool":0},"3ec622pOD7sxiSVcTl-UKQ":{"text":"First beignet. And second.... They are so good. Cafe au lait was a great compliment. Hot o","useful":0,"cool":0},"R6DQb1N660e7ZKSupSVJwA":{"text":"Don't let the name fool you. Cafe Du Monde is part of the food court at the mall. All the ","useful":1,"cool":0},"72AHVZRPD5seVm6LREmqNA":{"text":"I prefer this location. Beignets and coffee are just as good. Minus the chaos near the FQ.","useful":1,"cool":1},"pFCup2By8T7rB7co9or_jw":{"text":"This was a must visit in New Orleans and we enjoyed our cafe au lait and beignets. We foun","useful":0,"cool":0},"NBfXbvpyib8ybRLIMJAtag":{"text":"If you love a 1/2 lb of powdered sugar on top of fried pillowy pockets, then this place is","useful":2,"cool":1},"rfXOm12tNLv3st26NEqWNg":{"text":"We love the cafe au lait and beignets.  We could not get anyone to serve our table.  Some ","useful":0,"cool":0},"jZJ3oa4XUCMxgEWmdmJ-Yw":{"text":"\"World Famous\" Beignets and coffee. We were not too impressed with either.  Beignets were ","useful":0,"cool":0},"dkjGnUBRd0eWtrtFqeOAkQ":{"text":"I came here because I was leaving NOLA and wanted to bid goodbye to my fav southern desser","useful":0,"cool":0},"OAa6KTIE1N0UMN0e736jVw":{"text":"The hype was a little too much as the beignets were alright. Lines were definitely long fo","useful":0,"cool":0},"yvWThZmz5r_8wl0_DpmTow":{"text":"I asked for two orders of three each, one order with no sugar. I got one bag of 3 beignets","useful":0,"cool":0},"pwZ4PIT8Kl2QD3oPf25a7Q":{"text":"Melt in your mouth beignets! My word I was so in love. Super messy, but super good you don","useful":0,"cool":0},"7Tl02wuG2rPUwMXrP9_u8A":{"text":"The beignet was light and fluffy and served fresh however it just was not my thing... I'd ","useful":0,"cool":0},"3R0mpplEcz5SljGnseLhEQ":{"text":"We walked up and there was a long line, but it moved quickly. The beignets were hot, fresh","useful":0,"cool":0},"Mazcca3-qJ9djGr7eom-Bg":{"text":"Good eats \nHad better beignets at other places \nLots of tourists \nGuess if it's your first","useful":0,"cool":0},"sqBn0NGghzJMKZ6gqLcAdg":{"text":"I'm new to beignets, but the hype is true about Cafe Du Monde. I visited on a weekday when","useful":0,"cool":0},"KvWhJyqWMt-K8CGhRc_0Bw":{"text":"This location is staffed by people who don't have the best interest of the company. Teenag","useful":0,"cool":0},"oYtr5XLLWbf8SrFPwYCvOQ":{"text":"Loved the food, but hate doing business with people who refuse to be nice to a paying cust","useful":0,"cool":0},"-183sOuOI-1k6SEUiR2Sng":{"text":"What's not to like about fresh beignets covered in a mountain of powdered sugar? We arrive","useful":0,"cool":0},"NknFpRnTkAWXZGt-yxm6KA":{"text":"Best coffee I have ever tasted. The service is very good, everybody tries their best to be","useful":0,"cool":0},"ois-lQjVIyAZHh4PJFjYYQ":{"text":"Awful! 6 employees, all but one doing nothing. ignorant and loud playing on phones, listen","useful":0,"cool":0},"J4cPRKeL-SjkkifqMCCt7g":{"text":"Very authentic French donut and love the location! Highly recommend to try it at the origi","useful":0,"cool":0},"ShFBMuT8NIuDngCd6pJLIA":{"text":"I'm shocked:) a lot of locals recommended us this coffee shop and I have no idea why? I gu","useful":0,"cool":0},"Lt_sq71v2ubvqzn5ylRenA":{"text":"We went to Cafe Du Monde on a Sunday morning, it was very busy. People are lined up to eat","useful":0,"cool":0},"e_JiEnm2LK4ARmwzCkm6Zg":{"text":"Nothing beats warm beignets and iced coffee while sitting on the patio enjoying the breeze","useful":1,"cool":0},"_AgW48OyYsG8qMox2mjvBg":{"text":"Sure, not as lively as the one near Jackson square, but that means the line isn't as long.","useful":0,"cool":0},"X-vDcuf4LTNPptTNQtjuhQ":{"text":"Flew all the way from Florida to try these things out, I came on a Friday night and it was","useful":0,"cool":0},"-2OFc8sSIyDoc34CRehNvg":{"text":"So...we were down at the French Quarter hoping to eat at the original place, but even the ","useful":0,"cool":0},"wbg8Xv9uJYRITyaY8NjCTA":{"text":"Ever since I arrived in New Orleans, everyone has hyped this place up. Their beignets were","useful":0,"cool":0},"irsiPGSIp2eJ1iJWALmH7g":{"text":"It's everything you dreamed of and more. The beignet and hot chocolate was the menu for me","useful":0,"cool":0},"QVyEjZ67ZQNd3iEKGiPcrw":{"text":"This place was great.  We didnt get a chance to eat here when we first visited NOLA.  But ","useful":0,"cool":0},"hgNg_MMnMHyEshWQnUTQpg":{"text":"So good. Here are my 2 cents -- \n\n(1) If it's not obvious, this location is IN the food co","useful":0,"cool":0},"8drCI8vphIdTYZpc3vEgvw":{"text":"- Best donuts \"Beignets \" in he city and a must to try; the coffee is delicious as well\"","useful":1,"cool":1},"Sp6w145FUvEQBEVs2eWd5A":{"text":"This place is so over hyped. The beignet here is very average. Very thick and dense dough ","useful":1,"cool":0},"QbaGKtnJQWgsIRt--RIMqw":{"text":"Of course the coffee and beignets are always delicious!  Only problem it is always so crow","useful":0,"cool":0},"NcbgS3YHOOTl6jLWkeLqEw":{"text":"What's left to say. Delicious. A must try if you are in New Orleans.  The staff was friend","useful":2,"cool":3},"zD32a3cl55MY8eLsZYOA-Q":{"text":"Fluffy, sweet (but not overly sweet) pillows of deliciousness. Yum. You must stop here, an","useful":0,"cool":0},"AgQzToVd00kPHqO3WuRvoQ":{"text":"What a pleasant experience. First of all, if you're in NOLA and just HAVE to get some beig","useful":0,"cool":0},"LiJjwaGG377uuwTjkTgCSw":{"text":"Come here for the famous Beignets and chickaree coffee if you don't want to wait in line a","useful":0,"cool":0},"UL0MGEUTyv2y4K1jY4r1Pg":{"text":"Lady at the register this afternoon was not very friendly. It was so obvious one of the gu","useful":0,"cool":0},"UROY6epSN2Lg4KY5FJSCUw":{"text":"Service was surprisingly fast for how long the line was on a Saturday morning! The frozen ","useful":0,"cool":0},"8RZI40223x6TxH8zJmEZzA":{"text":"World Famous for several reasons. Always delicious, always fresh, always available, always","useful":0,"cool":0},"vYYQsASblDxZ7nmG-mkwng":{"text":"I don't understand the hype for the coffee. The beignet was okay okay. I feel bad for peop","useful":0,"cool":0},"zfIZlnX9s64DDYxkzHlx0w":{"text":"We've been here twice already so far and the beignets & cafe au lait are always good. Let'","useful":1,"cool":1},"WWiYukHKTu5iHmvHzyCKbQ":{"text":"This was an experience. Very historical. Barely waited to sit down once we got there we pi","useful":0,"cool":0},"vI3Bhg1jm0UXnac61fh-Yg":{"text":"Ummm, I watched a server wipe down a table with water that a patron left on the table...DI","useful":0,"cool":0},"R7HIzXQbvFNPyS8un7_vMg":{"text":"Very bad food...!!! \nVery bad service ..!!!!\nWaitress asked for tips seconds after she  dr","useful":0,"cool":0},"zXx1TT68E9B0QHE8h3fYDg":{"text":"There are no words. Warm, tasty, powdered, heavenly and sweet. I can fly home now! Thank y","useful":0,"cool":0},"jTC1iXX2uZCtM-Mdb2f2ag":{"text":"Nice try but I think the ice coffee taste pretty smoothly. Suggest hot coffee if you prefe","useful":0,"cool":0},"IkhfHyvfhfv8e17OYnGq9A":{"text":"I was really looking forward to trying Beignet's and decided to stop here while shopping. ","useful":0,"cool":0},"qJUr9VkgOSg6bZIRWLNalg":{"text":"Located at the end of the mall, north of convention center. Outrageously long line during ","useful":0,"cool":0},"wWI-XumroZwBraH-oXeU9Q":{"text":"My first time- super excited! Been need omg to try since I saw Tiana w them in the Princes","useful":0,"cool":0},"hLk1rgE0VCNqDgx3FytkjA":{"text":"Best times to come are any days before the weekend begins lol \n\nThe lines are long but the","useful":0,"cool":0},"0xp2_QEEb4RDvATADFMIbw":{"text":"We waited in line for 25 mins on a Thursday morning for a table to open up for 3 people. I","useful":0,"cool":0},"oP024hnh7HEjc9_q5gWnQQ":{"text":"Long line, quick moving, fast service for how busy they are. See a table, grab a table eve","useful":0,"cool":0},"W1zqHBw6nR4GKF5KPEcikA":{"text":"I was really excited to visit Cafe Du Monde. It is all the rage with family and friends. I","useful":0,"cool":0},"Zf9LJvtVyHvGKo_DQfh8bw":{"text":"LOVE the Beignets!!!  Classic and inexpensive except THEIR SERVICE SUCKS!!!!  I actually w","useful":0,"cool":0},"His0IJZCqQ1fICPrkU4jeg":{"text":"I wanted to love the beignets, I really did, but alas it was not meant to be. The order of","useful":0,"cool":0},"1aOe-zxNGGJm5e9CJcPEQQ":{"text":"By mistake I ordered 4 beignets thinking I was getting 4 individual pieces. 4 bags are han","useful":0,"cool":0},"A1pn7-tppbVlKXWNBogcXQ":{"text":"You would be missing out if you don't make time to stop by this Big Easy staple! Needless ","useful":0,"cool":0},"jET7BRnftG_Y_RRKcb0M7g":{"text":"We arrived a little later than we wanted (about 1130) and they have two separate lines. On","useful":0,"cool":0},"_o_8oPCDWkJN_mDjo1swcA":{"text":"What can I say about such a famous place. Recently on my visit to New Orleans with my kids","useful":0,"cool":1},"gIaOIg-bOm8SoN2iOWUGEA":{"text":"There beignets were amazing if your looking somewhere to eat this is definetly the place t","useful":0,"cool":0},"deI4NZiPqR4loGW8RIdD7A":{"text":"Go eat beignets, drink coffee, get full of powdered sugar, (get lots of napkins) and enjoy","useful":1,"cool":1},"OP1KX_XYpRU702xBfg3XlA":{"text":"Warning: CASH ONLY at their main location! They have it posted on their menus, but how wer","useful":0,"cool":0},"YtL-n9DpMxwB-GxnM1-2vw":{"text":"Best beignets ever! I got some to take home to Baby Girl! Cafe Beignet was great! These ar","useful":0,"cool":0},"GTMxv5Zvpw26roNFrxolvA":{"text":"Absolutely AMAZING!!! The beignets were EXCELLENT! We didn't know about this place, howeve","useful":1,"cool":1},"rwPKdmuRlJ-DP4B2hvtgCw":{"text":"Honestly, this is my favorite location and I like it more than the original because it's l","useful":1,"cool":1},"LUJ1sCdW-4EBvRc4e7Z1aQ":{"text":"Even though it is a tourist overload it is a must for New Orleans and has delicious beigne","useful":0,"cool":0},"wK4kAokszsy33iGUUosrxQ":{"text":"It was good but over rated in my opinion.  I mean it's fried dough with powdered sugar on ","useful":0,"cool":1},"KvsqmRcdHU-k0UOO9DrPOw":{"text":"Yum yum yum ! The line is always long at this place, we decided to go with to go line inst","useful":0,"cool":0},"TpgSJz4ua55kqAFdiQ8d4Q":{"text":"Any trip to New Orleans is not complete with trying Cafe du Monde. There are many replicas","useful":0,"cool":0},"o20mwKCJIHAzZtKwQyUQ9g":{"text":"The young lady taking our order was very nice.  Thus the one star.  It looks like most peo","useful":0,"cool":0},"c7Ea9LKWG765Jh4aQi80PQ":{"text":"Love this place everytime we come down. Good food and good service. Just go at a dead hr a","useful":0,"cool":0},"0KWYWIfBr6CBoL4rJUHwng":{"text":"Meh. While the beignets were freshly-made, they were not very good. Too firm and dense for","useful":0,"cool":0},"Rcw-u2ZhF0Jj-pVlBcUmhw":{"text":"Pretty good beignets, but not as good as the original location. \n\nPros: convenient locatio","useful":0,"cool":1},"1qQwovprkXPAxIgb8y1TNA":{"text":"FINALLY I got to try the famous Cafe Du Monde after hearing about it from eeeeeveryone who","useful":0,"cool":0},"gBsxbF22daCva5FE6s7t9w":{"text":"Place was filthy. Person frying beignets was throwing them across room where they splashed","useful":0,"cool":0},"7j4AvtZTooS8Q3KLqNfC0w":{"text":"Tourist trap! BUT you need to go anyways just for the experience. \n\nWas it worth the wait?","useful":0,"cool":0},"pb8pdVM98ORlX2S2VGBVUg":{"text":"I would never visit NOLA and not stop here for beignets.  I've never had better.   The lin","useful":0,"cool":0},"49g8hDIbBSBxAwbtpi-_OA":{"text":"Great quick service, plenty of seating. If you get there early (prior to 9:00) . Food was ","useful":0,"cool":0},"Rqq-6zIQML2taAx1SdbXfA":{"text":"Went here to try the famous beignets.  Got an order to go, as our hotel was about a 10 min","useful":0,"cool":0},"iVFULuiPJVg-5xSkHp8L9g":{"text":"Wow, wow, WOW!\n\nCame around 10:30a and there was a semi long line, around 10 ppl ahead of ","useful":0,"cool":0},"Bq98XdPHq8_Os612B1V9rg":{"text":"Cafe Du Monde is a cute little shop inside the Riverwalk shopping mall. The line wasn't lo","useful":0,"cool":0},"J-7VLrJjN8ASuTIlAZp06g":{"text":"Cafe Du Monde was not as expected. The line was almost an hour wait and the service was ho","useful":0,"cool":0},"jcnHumCxA8g1ufH-GxvcVg":{"text":"Oh what pleasant experience......This was my second time here and as usual the beignets wa","useful":0,"cool":0},"bcXLKhQnXUtOJU2oJD5X8A":{"text":"Went after breakfast for a cup of coffee and a order beignets to share. The line was long ","useful":1,"cool":0},"MDTPWCtnm615yppPmSyMIg":{"text":"Delicious beignets. They're made fresh all day and night and are served straight from the ","useful":0,"cool":0},"gRS8rEf165LfCTJ8gQKhoQ":{"text":"If you like Beignet's and only want that, this is the place. Café Du Monde is coffee, juic","useful":0,"cool":0},"hRwFFosQBbddiE4CfZN7aQ":{"text":"Great in the early morning before the crowds. The servers are too transactional. Suggest t","useful":0,"cool":0},"FFQeoMP3tMu-_epUw8P9Tw":{"text":"It was a little hard to find because I was expecting it to be separate from the mall but i","useful":1,"cool":0},"cA1_pWmUguFEDvHwJwGMlw":{"text":"There are two of these little gems near downtown, one in the Riverfront Mall, and one on D","useful":0,"cool":0},"Lwis0wmF8v0PbQUoDXoH5g":{"text":"Delicious beignets that were definitely worth the wait! This is the taste of New Orleans t","useful":0,"cool":0},"NPekFLS-1D6-L3j7wpsEpg":{"text":"I ABSOLUTELY LOVE to stop at my favorite spot when I come to the NOLA!! The beignets are t","useful":0,"cool":0},"WQ60iARdv_BjVY11lOKZiw":{"text":"The beignets were absolutely DELICIOUS; however, the staff was f'in HORRIBLE. The workers ","useful":0,"cool":0},"ObPwSqtBBgoZZwpGdE8E0A":{"text":"What is the saying, \"When in Rome...\" so of course if you're ever in NO this place is a mu","useful":1,"cool":1},"lIRX1Ll3sr2oQo92tqWmnA":{"text":"Beignets delicious! This is a little place and all they have is basically coffee, water, m","useful":0,"cool":0},"FTSuEq8lwOGGYn_bLfPcXA":{"text":"There are no words to describe the way these beignets melt in your mouth. Such a charming ","useful":0,"cool":0},"rY0BUAWUaUAMyPUn3ioVOQ":{"text":"this place was everything i expected!\nBeignets were delicious! my only tip is to let them ","useful":0,"cool":1},"ZXw2fWMUOm6daQTjxBowgA":{"text":"I can stuff my face with beignets all day, every day. They were warm and fluffy, light and","useful":1,"cool":0},"jXktqWE1CzalmtW-Zl2SSQ":{"text":"My first time here was in 1995. I remember feeling very fancy and sophisticated because I ","useful":0,"cool":1},"wRkAg_Q1eWWMk7LbsFkjig":{"text":"I tried the beignets for the first time, and they were really good, there was a huge line ","useful":0,"cool":0},"OUAHV93gLcnkhQPi7woK8A":{"text":"Another historic place that is a tourist trap. When you're somewhere because you're told t","useful":1,"cool":1},"OwxUPYxiaOFof3-F0__ewA":{"text":"This is definitely a tourist trap. We came here, rather than the original location, becaus","useful":0,"cool":0},"1EponRkK-UrNRMVD-N_uuw":{"text":"Very nice night. Great for some Cafe du monde. \nParking down the street and a nice walk do","useful":0,"cool":0},"19Fo8XJohHzmcyfDY02qLQ":{"text":"Recently stopped by. At first I was a bit thrown off from the line out front wrapping arou","useful":1,"cool":1},"nar0Hm08gpd6FOYIoCBOTw":{"text":"Fantastic beignets. Warm recently cooked. They are delicious!! You have the same selection","useful":0,"cool":0},"Sp6fSWYpGGV27UzyTBBLyg":{"text":"Rude staff! But the coffee is good...make sure you go to the French Market location. The o","useful":0,"cool":0},"fLmW5fSKHtmAWoHaqI4Dbg":{"text":"I was looking forward to this place but was so upset when they literally had only whole mi","useful":0,"cool":0},"TH-hHYxUbh_55x3_d_t1Ug":{"text":"Shake the bag!!!  It took me 3x going there this week to the take-out line to realize they","useful":0,"cool":0},"ZnSaIQbAuXYJ62dm_7Z76g":{"text":"My first time experiencing the sounds and culture of New Orleans. the bienas and the crioe","useful":0,"cool":0},"O5zS4-EBYEIQfbXw16Ca1g":{"text":"This location has AC. I really enjoyed watching the beignets be made behind the glass and ","useful":0,"cool":0},"7xSXVz24ownnJixpym-2xg":{"text":"First time in New Orleans and I was told Cafe Du Monde is the spot for beignets. I was ama","useful":0,"cool":0},"JLdsnxNrxaOFU2JU-1LbpA":{"text":"This location is cleaner than the original and less crowded. I got an order of beignets an","useful":0,"cool":1},"US3p70H5NnUa1NVvkDQtMg":{"text":"I would give this place zero if I could. Total rubbish. Beignets are fine for what they ar","useful":0,"cool":0},"f2uIN5wym9KphLkgvmNu3Q":{"text":"Such an awesome place with great vibes. I can go here day or night. The beignets are so ta","useful":0,"cool":0},"OYqUSdjZF8Z6xZ0er4UUfw":{"text":"Omg they have the best beignets ever! It's goes great with early morning coffee or brunch.","useful":0,"cool":0},"vDBj3ifQ8Gu7Y9DL-gZ6Jg":{"text":"We went to the location inside of the Riverwalk.  Its not as crowded as the one in the Qua","useful":0,"cool":0},"WyviJ2heqaGcuMUfSmyuWg":{"text":"Coffee and beignets were great. Cafe Du Monde is cash only, but they only tell you this af","useful":1,"cool":0},"nTcuuLY-OUaEjQ-q-Oc-gg":{"text":"These place is a most on New Orleans if you don't stop and have a coffee and French doughn","useful":0,"cool":0},"QsV38WjZNk88wJh5siWZfQ":{"text":"The beignets were fantastic and the coffee was good as well.  The only reason I'm giving i","useful":0,"cool":0},"sJ_DZPNa-ifTlmKFb2o_wQ":{"text":"The beignets are delicious, the place was packed at 8pm, I believe it was cash only $3 for","useful":0,"cool":0},"LgrGYSst0rCJJClGj2r-UQ":{"text":"It's always packed and if you've never been to NOLA it's worth a visit given it's institut","useful":0,"cool":0},"UaQsOfChfL8KhWqtE_z1MA":{"text":"Everybody needs to come here once, I guess. Beignets are good (tough to make one that isn'","useful":0,"cool":0},"5WL5YJ2I8mraP7zMLRNMMA":{"text":"Was fantastic, I was told if I ever came to new Orleans I needed to give this place a try.","useful":0,"cool":0},"Q8csiG4biZMqlh8hTWNS3A":{"text":"So good!  Glad we had a chance to try it in vacation!  Got there early so the line wasn't ","useful":0,"cool":0},"MO_yCpkCFo2F2LrKGX1New":{"text":"A lot of health code violations here. Place is not clean. Workers playing with their hair,","useful":0,"cool":0},"FHLrxrQ3wMI2SD9Rhx7i9w":{"text":"Beignets and hot chocolate in New Orleans! Hot chocolate was very good and came with whipp","useful":2,"cool":3},"0vmpTOR0LHOLyzMFtnv5zA":{"text":"The beignets are a classic which never disappoints. I would however suggest to grab them T","useful":0,"cool":0},"cunrqQLAbMAhXFgfkC5zGA":{"text":"Yummmmyyyy I loved the coffee and Beignets. DO NOT I REPEAT DO NOT WEAR BLACK. Unless you ","useful":0,"cool":0},"gOKvK2zEWWd-XI15HcXcKw":{"text":"We had a great breakfast here before the opening day of Earp Expo 2019 started. 3 orders o","useful":0,"cool":0},"jMICBV5xOdqsad0pS8NcCQ":{"text":"Perfect stop if you're near Riverfront.  Quick service and clean.  Cafe au lait was grown ","useful":0,"cool":0},"EaRF2TF3EZlheGSMSaJUJQ":{"text":"I would wait 24 hours in the freezing rain in order to have some of the pastries and coffe","useful":0,"cool":0},"-IcOjdI1emi2RvG4Fp7JdQ":{"text":"Really, first time I come here and the service sucks. After they sit us, the table wasn't ","useful":1,"cool":0},"jydhvhAQLOZE03sMMstRqw":{"text":"AMAZING! Amazing beignets! I would eat these everyday if I could. No line when we got ther","useful":0,"cool":0},"o5pn7LVMWO7baUMh47PBrw":{"text":"The customer service was horrible. I'm currently here visiting from Los Angeles and I was ","useful":1,"cool":0},"zGaLvHe-uHhxMYVm9PF50g":{"text":"- FRESH AND HOT  had the perfect amount of sugar and was actually fulfilling. Literally fe","useful":0,"cool":0},"RbLtv3scD94O4ZZpgBKnjw":{"text":"From our hotel on Canal Street, we walked to the Cafe Du Monde in the French Quarter. On t","useful":1,"cool":1},"8zklxl9U5aeQUamQxfgp-A":{"text":"This place was crazy, crazy good. It was super busy, but the tables opened up quickly.  Th","useful":0,"cool":0},"3CmlcMtgw6z8AP2wLQxUCw":{"text":"Go for the history of it. But, be advised--the place is a dump. \nYelp says they open at 8a","useful":2,"cool":0},"3qBfxZJwM65jyplQuQEwfw":{"text":"So delicious. Like, the first bite and you feel right with the world. I doubt I'm telling ","useful":1,"cool":1},"OriTRrnauLj0iMfwoti3Ig":{"text":"I would rate this place 3.5 stars. They had great coffee, strong and rich in taste. Howeve","useful":0,"cool":0},"JSX236MX-NVZszDp6PwAQA":{"text":"We stopped by for a quick snack and it was packed! A man took our order as soon as we foun","useful":0,"cool":0},"Bd3kNrySaqMi6VmRU29Msg":{"text":"Always a great and enjoyable place to visit each time I visit New Orleans.  The crowd was ","useful":0,"cool":0},"L1hrNSL-1QwR-YBa3cAyYg":{"text":"The chilly air while we were standing in line at the Port Cafe du Monde only heightened ou","useful":0,"cool":0},"oAItUvEdcdI03nfJL6_jjA":{"text":"Beignets so yummy !!! I was glad about the convenience of the coffee shop. The personaliti","useful":0,"cool":0},"jwji1xT2gwoAADoIdUU0zg":{"text":"They live up to the hype. Delicious . Line moves quickly if you just want to pick up a few","useful":0,"cool":0},"FH0QgcFdQvaKazhYdieNSg":{"text":"Conveniently located away from the mob that is French Market with fast service. I was in l","useful":0,"cool":0},"jdhlMmM4VrY4Em1Q-iuL-w":{"text":"First time trying their beignets and it was everything that I imagined it to be. It is a v","useful":0,"cool":0},"2QI5KCHNCHwMuwYhSZolRw":{"text":"It's a mall location for a famous New Orleans restaurant but despite that everything was e","useful":1,"cool":0},"d6DMyLL3aDJa2Ml-Dgg73Q":{"text":"Well well . I love me some cafe du Monde ! You have to  try it  in NOLA ! I had about 8 al","useful":0,"cool":0},"q39y72lA3ygH9iBPJAyypA":{"text":"This location is cleaner than the original and less crowded. I got an order of beignets an","useful":0,"cool":0},"TpX_WNNtrWvU-EK3wvIaBg":{"text":"This location is a miss- go to the original location!\n\nThis location is inside the outlet ","useful":0,"cool":0},"8frvtTSj50qnWDa6R0rNqQ":{"text":"Even though it seems like a tourist trap, still worth going to if you visit NOLA. It's ope","useful":0,"cool":0},"l8lQBWEenwkAZMtfNdDNiA":{"text":"The service at the counter was very rude and seemed like they could not care less if anyon","useful":0,"cool":0},"6R0dHvHkv2rjRJYNIBEfww":{"text":"Worth the hype? Absolutely! I went to Cafe du Monde EVERY DAY during my trip to New Orlean","useful":1,"cool":1},"PxU4Z7ho2EjWweghTS_orw":{"text":"After hearing all the hype, I had to make a stop at Cafe Du Monde during my visit. This lo","useful":1,"cool":0},"GYy3_XL5JS-hZSpIjawQJQ":{"text":"It's all been said many times, many ways. So all I will weigh in on is that nothing tastes","useful":0,"cool":1},"m4swtfPyv36U1zQklUYR3g":{"text":"Best coffee and best attendants we could have! \nBest experience... even though the coffee ","useful":0,"cool":0},"9v1vmw9O60UjnnJ2LujXZg":{"text":"RUDE.AS.HELL\n\nAll the workers we encountered were VERY rude.     They were not very busy s","useful":1,"cool":0},"rIhYeED6yJ0X0yTW4hbhmQ":{"text":"Stood in line at 10:30am on a Sunday for 20-25 min because they ran out of beignets... on ","useful":1,"cool":0},"5Vw4uVzMSNi8UvRiXt0Khw":{"text":"This was not the place to visit. Especially for a must visit review. The waitress was extr","useful":0,"cool":0},"5JU5Zq8jwDVTqAcK0ziS5g":{"text":"When your in NOLA and you're a tourist, you have to try out Cafe Du Monde's beignets.  Pre","useful":1,"cool":1},"PrZ_2PuSc-XuUQDTY0znSA":{"text":"I love beignets. Delicious!! I like the original location better though. But still happy!","useful":1,"cool":0},"WnZZhYXsgBzME-Q4Dx1TQQ":{"text":"Dirty. Asked for a spoon and I was given a dirty used utensil. This speaks volumes of the ","useful":0,"cool":0},"H5lKPyApBVYI1kfyVhx_Uw":{"text":"So this was the first beignet I had on my trip to New Orleans. Unfortunately they were raw","useful":0,"cool":0},"x2QsUZJnyVGe9BovI9WHCg":{"text":"Please! Nothing but delicious beignets & strong fabulous coffee here! A must every day! St","useful":0,"cool":0},"FnsonWbLxPXhzjtX4-ILhQ":{"text":"It took these guys 20 minutes to get begnets ready. The coffee got cold by then. The staff","useful":0,"cool":0},"F52hFo3g9iL5TleElCjWKg":{"text":"Expect SUPER long lines, but the place is worth it. I definitely recommend the frozen coff","useful":0,"cool":0},"0G43TyIThQmxy8KGfqD2ng":{"text":"Very good-for beignets, nothing note worthy but I'm more of a donut guy myself. They do ha","useful":0,"cool":0},"Q6KmNGoPW1D11v8pEYpt0g":{"text":"Stopped in this  past weekend to try\nthe famous beignets. Though I\nenjoyed them very much ","useful":1,"cool":1},"Ss8L49r4-jQ4OTCHfubBlw":{"text":"This is a beignet??? Not sure where to begin. All I have to say is stick to the original l","useful":1,"cool":0},"x9UlRDhfVvV6WKAyqg2nKw":{"text":"Aight, here's the run down.\n\nDo you love fried dough from carnival? Cafe Du Monde is the p","useful":0,"cool":1},"qkj_x5g5oRmJZsj1gmPoPQ":{"text":"Super crowed Saturday morning, but I guess there is efficiency from having a limited menu.","useful":0,"cool":0},"dk3N7KBDslSyzXsgUdLJyQ":{"text":"Meh. We heard such great things about their coffee. They did not meet anywhere near our ex","useful":0,"cool":0},"c_fdjhRAfwyyaKFNkCPuvA":{"text":"A NOLA MUST.  If you visit and don't come here there's something wrong with you!  JK but n","useful":0,"cool":0},"1bV_7sojPN3bWFmgRuCXhA":{"text":"When visiting New Orleans you must try praline and beignets.\n\nDon't waste your time just f","useful":3,"cool":0},"i4JK0L2OW0rAohcr1ipmhg":{"text":"The donuts were to die for. The Cooke and hot chocolate was good as well. Go early in the ","useful":0,"cool":0},"XtyP75sqM0NUwLDw3uVytg":{"text":"Got in line 15 prior to closing and then they said they were out and closed.  Pretty crudd","useful":0,"cool":0},"WV8ZT8dh_KNHWLsT30Ik2w":{"text":"Had to give this another try. I went to the main one on French market st but was very disa","useful":0,"cool":0},"gWGhqBl26SM7D0mhqf7Y0w":{"text":"Did not disappoint, fluffy and sweet. The line is long but it moves pretty fast. Service w","useful":0,"cool":0},"aBWWH7p9vVc7rrq1IwXHNA":{"text":"Everyone is told they have to try Cafe Du Monde. The problem? The original Decatur locatio","useful":0,"cool":0},"OZRuXn9ICpDAUCjl1fCTvQ":{"text":"A must have when in New Orleans! Can be a bit crowded but we managed to find seating insid","useful":0,"cool":0},"ayvn9I56xL4VFfV10JdfDw":{"text":"Traveling from Indiana Cafe Du Monde was  recommended as a must stop location. We are glad","useful":0,"cool":1},"Nj9hRHxaOoAQmUxKcSARNQ":{"text":"Long line but moved fast. Delicious beignet and try the hot cafe au let. Together, they ar","useful":0,"cool":0},"kBGdXhzmbgml9ONag7YVMw":{"text":"The lines at this location are much less insane compared to the lines at the original loca","useful":1,"cool":0},"zcnvrLS_qfnU7mBXFCPiXg":{"text":"We came here for beignets yesterday since it was also another NOLA must haves! As soon as ","useful":1,"cool":1},"dcnURIqz3VdWmGj4jQ0Fcg":{"text":"You've got to stop here if you're visiting NOLA.  The Beignets and cafe au lait were both ","useful":0,"cool":0},"MSjh_SrSGxfiBjiI_bD_hA":{"text":"Beignets were OK. They were hard and disappointed. \nCafe au lait was OK too. \nService was ","useful":0,"cool":0},"rmphssxfT9N-QRz2NVcBXA":{"text":"This is a classic spot for everyone visiting New Orleans although I don't care much for th","useful":0,"cool":0},"E2pBqakwZrv0gSmUUIQgbg":{"text":"Pro tip go later at night 8 pm and after to avoid the long lines. We went at 8:30 pm and w","useful":1,"cool":0},"qI4Peg9LHqqGaJi5o7mlGg":{"text":"I don't know what more can be said about Cafe Du Monde-the legend is true.  The place was ","useful":0,"cool":0},"NneHL-9POnAcItLTAnXaWw":{"text":"I am still wondering that apart from  being open round the clock, what's great about this ","useful":1,"cool":1},"SNc3TaITOOS37QjOMqal0g":{"text":"Of course you have to go to cafe du monde when visiting New Orleans. Wasn't disappointed. ","useful":0,"cool":0},"cfwGkJGO5vkGc9jf8Gzfzg":{"text":"The beignets are what these stars are for. I would give 0 stars for service. The method of","useful":0,"cool":0},"O_FOD9d-0-o3_1OKuogPBg":{"text":"Fresh and crisp! These little pillows of fluff. Iconic to the area and so much powdered su","useful":0,"cool":1},"iOWYh9zKgxGO6ky_WA5BNw":{"text":"This café is a great place to grab a Coffee and a beignet while shopping at the outlets or","useful":0,"cool":0},"SacQ-5ZyR9dSA3P9dZx8Yg":{"text":"The place was filthy. Dust webs on the wall and i dont know when was the last time the flo","useful":0,"cool":0},"o4IHjyhrfe9HuJYEVKZjvQ":{"text":"It's just alright. It's a fried dough with a lot of sugar powder. I am not sure if it's wo","useful":0,"cool":0},"VbcHuYmlVjy4bFqa-9i3XQ":{"text":"This is a perfect date night little cafe. The beignets were fresh and amazing. We got hit ","useful":0,"cool":0},"RS3puaATzPFOvSuRyoq_2w":{"text":"Excellent as always. A must if you are in New Orleans. WARNING!!! It will get messy! Get p","useful":0,"cool":0},"HoIlpz89Cc2bJkXIGmKUmA":{"text":"When its raining and you dont want to wait in the long line of the French Quarters branch,","useful":1,"cool":0},"ASMiFG7xea4ntSvc65eK8A":{"text":"I loved this place. It was so cute and the beignets were great. Super crispy and fresh. I ","useful":3,"cool":3},"Prz7COkRRdFrJJIra0hPkg":{"text":"Quick service, no line when I got there. It's inside the outlet. Don't be like me and walk","useful":0,"cool":0},"g7NoidQqlLvlJIO1moH58g":{"text":"Unbelievable beignets at such a reasonable price. Fast, excellent service and good coffee ","useful":0,"cool":0},"0RBhnqeLB61ZUPTf0MIWSQ":{"text":"Don't be intimidated by the line they got it down! And they move fast! It was worth the ma","useful":0,"cool":0},"1AdnFBIvJ--WwB85NxFZ3A":{"text":"Cafe du monde is a mist try when visiting New Orleans but you have to go the original loca","useful":0,"cool":0},"YQal3dVIswJGYg-Fvhnw4Q":{"text":"Just another tourist trap here the Benigets here were really good and hot and fresh. Howev","useful":0,"cool":0},"sUW73w-DVXtl5EWgeSv0ng":{"text":"I've heard so much about this place so once I was in New Orleans I had to try them. And I ","useful":0,"cool":0},"Y32gbme2cqLfWszCR-vFGw":{"text":"Honestly this place has the most sweetest staff ever. It's a little fast paced when busy b","useful":2,"cool":1},"w2d2BgpjCE5eZrTGPTgIDA":{"text":"In Boston's North End you have to go to Mike's and no other for cannolis.\nIn New Orleans..","useful":0,"cool":0},"SUSXbEmS5fjUOQWLyuJfAg":{"text":"We were on bourbon street, had dinner and saved dessert for cafe du Monde.  Really glad we","useful":0,"cool":0},"tXrJfiJgOIQ5bBdGrjVM1Q":{"text":"I've had beignets before, but never had Café Du Monde beignets until last week.  They were","useful":6,"cool":5},"3vAdwsTRvtMHFPn8N2M87w":{"text":"Didn't realize this is right inside the Riverwalk outlet/mall. Came by around 10am. No wai","useful":0,"cool":0},"5KGCHZa8pAFqMUaVk4_wcQ":{"text":"4 stars because hot, fresh, sugary beignet's just deserve all of that and more. Great cafe","useful":0,"cool":0},"TmvLlSgEnvupvpul7MWppA":{"text":"We been talking about coming here for a long time finally made her today the coffee was ju","useful":1,"cool":1},"Le3CYkJkgxo3KTycsnNe4w":{"text":"The powdered sugar NOLA donut is a must. The sweet is a perfect match with the chicory cof","useful":0,"cool":0},"5zmXk-PLCL7tCX_gWnYKYg":{"text":"So, Cafe Du Monde is a must go place, but sadly, we noticed at both locations that the sta","useful":0,"cool":0},"yHabSy0qmrNA40piY0fsgg":{"text":"This place is an old time great can't say anything bad about this place great stuff had it","useful":0,"cool":0},"HMy8oibd6eKjnTgkDw0krw":{"text":"This is a \"must\" when visiting NOLA, but honestly it's not fantastic. Don't get me wrong, ","useful":0,"cool":0},"ANFKly-bwKY1VD34dRGNMg":{"text":"The Cafe Du Monde mall location at Riverwalk sucks. The beignets we're hot and fresh which","useful":0,"cool":0},"GFMaLQJO7_fEW3s7iqfrRg":{"text":"Best coffee and beignets in New Orleans - tough bar to clear. \n\nA coffee and beignet and a","useful":1,"cool":1},"_1bpEiShn92PMsWci-1GLQ":{"text":"Cash only. Coffee was somehow watered down and wasn't as hot as it should. \nThis one is in","useful":0,"cool":0},"LCyH2_SkhPRH66KL7Qmnbg":{"text":"The beignets are delicious, and this is a \"must do\" (once) in New Orleans.  famous landmar","useful":0,"cool":0},"3_s20IKjap8d7sjm0kIGZA":{"text":"I enjoyed this Cafe Du Monde location way better than the Original Cafe Du Monde location ","useful":0,"cool":0},"tBB14XeH5UrRlnQLLNQ9Dw":{"text":"Best place to go get beignets & coffee. Open 24 hours a day. Always the place I come to wh","useful":0,"cool":0},"kCRdlQ3UBt_GtBLo-XNgEw":{"text":"So we waited for 15 minutes for the famed beignets.  Too heavy and nothing to substantiate","useful":0,"cool":0},"WkpVzBki76krmdWNM0TW2A":{"text":"I was sooo excited because I just knew this was going to amazing. Well the line is gruelin","useful":0,"cool":0},"b-aFN79nNiN-Uk0OFlQtMA":{"text":"If you don't go to Cafe du Monde while you're NOLA then honey what are you doing. You must","useful":0,"cool":0},"u9EVGHClJPYdNAA5augX_w":{"text":"What can I say? Beignets are great, dip them in the cafe mocha and they're even better. Th","useful":0,"cool":0},"x_r87xHVp8WOco51yZAq1w":{"text":"There's always a line at Cafe Du Monde... But if you visit the one at the Riverwalk mall, ","useful":7,"cool":4},"mKU1pJ5mNVGrZXfh9ukPUQ":{"text":"Must go to place when in NOLA! The beignets are delicious!! Service was fast! The line was","useful":0,"cool":0},"C2SMT7Jystjrp1EU9hJuHA":{"text":"Can't go wrong here. The beignets were on point, you really can't go wrong. Literally so s","useful":0,"cool":0},"2SvT7Mi1NDymSBlhxkVGVQ":{"text":"Located in the Riverwalk Mall which is connected to the hotel we were staying at.\n\nSuper c","useful":22,"cool":22},"uZ8bLsB9o50n3KOn1Orl3Q":{"text":"Came here twice. Came for dessert on our first night in New Orleans and then for breakfast","useful":0,"cool":1},"i8mZoHYffHIqkQqcS6Hh5g":{"text":"Lived up to the hype? 4/5\nWorth waiting in the line on a rainy day? 3/5\nBeignets? 6/5\n\n\nOb","useful":0,"cool":0},"y3GCo5wcRbbTPEqddblyGw":{"text":"Wait time is pretty quick hardly a table to sit so make sure to go early, the early bird g","useful":0,"cool":0},"Bl_0v6_EMa7SS9G7J7R-yg":{"text":"We got here at a great time that wasn't busy but after we got our food the line was long! ","useful":1,"cool":3},"MqsVJ4WFmQiscKN5JWzUNg":{"text":"5 stars for location, efficiency, and delicious coffee! \n\nI mean, you gotta go to the orig","useful":7,"cool":4},"7SnDmJX2xd0AObIjvWFi6w":{"text":"I really like this more low key location in the mall. Super convenient to walk here from t","useful":1,"cool":0},"YID3Covo77Lx5tnJ54tstQ":{"text":"Yes, finally I got the coffee  with chicory! I'm a coffee lover and So enjoy  a strong cup","useful":1,"cool":1},"rUamcFjyjI9A5CjjAgzQwg":{"text":"It was raining hard and we wanted to be indoors so we went to this mall location. We waite","useful":1,"cool":1},"ZQHO38LOph0OhNVscGVPaw":{"text":"A New Orleans original. Hot soft beignets with powered sugar on top, what's not to like?? ","useful":19,"cool":16},"ik-dgr5P11LkOFVwO3J-dA":{"text":"This place is packed! It's honestly all hype and not much to back it up. The wait and serv","useful":1,"cool":0},"Ey4gonG_ZykWdn600ETJ7w":{"text":"Located in the Outlets at the Riverfront, it's a lot less crowded than the French Quarter ","useful":0,"cool":2},"-fiTZlZuLWNwmosfu4vfxQ":{"text":"Being able to experience Cafe Du Monde is a privilege. You're surrounded by beautiful Fren","useful":0,"cool":0},"dDntY4x1jkHFbRXYB8MLeg":{"text":"Einzigartig, Großartig & einfach lecker! Kräftiger Kaffee, der mit den meisten Coffee-To-G","useful":0,"cool":0},"Ii6QFfIL2sZ9QlXkp7fQwg":{"text":"Success can deliver a host of unintended consequences, long lines,  challenges keeping you","useful":0,"cool":0},"otT7KoXJdqd_Idu59NhOpw":{"text":"It's a MUST to stop by and try their delicious beignets and iced coffee!!! You won't regre","useful":0,"cool":0},"fFbsm0E90dzkMMVtc2Zmqg":{"text":"Obviously the beignets were incredible. The hot chocolate was pretty solid as well. There ","useful":1,"cool":1},"_ykwGiUhdBxPj9enFXtOTQ":{"text":"For beignets these were worth the drive but I just expected MORE (more pazazz),this was my","useful":0,"cool":0},"RuoQtR2H4PnQypp1sWhR-A":{"text":"Giving it 2 stars because the coffee is basic, coffee truck basic so don't have high expec","useful":1,"cool":0},"PWiOSs1n4ArkNWlukhWH_Q":{"text":"First time at this location and idk something about the original spot just made my experie","useful":1,"cool":1},"T5HW30MpV6SQPEvKFvSguw":{"text":"This location is located right in the outlet strip next to the convention center. I took a","useful":2,"cool":1},"iN8NjYQpbBVJrWoVrZ3_PA":{"text":"First time in NOLA! Tried everything I needed to try, from beignets, gumbo, jambalaya, shr","useful":0,"cool":0},"6cmQNISZzd1Be7HGrJtfSQ":{"text":"Horrible customer service. Staff very unprofessional and rude. There was barely any custom","useful":0,"cool":0},"0QkkRnTn5ALagL4I-vHPGA":{"text":"Complete let down... don't waste your time. Terrible location in a mall. No one keeps trac","useful":0,"cool":0},"h5TcATu-k3VMiRBKHW-8lQ":{"text":"Stopped by here because it was highly recommended. Did not disappoint. Beignets were fresh","useful":1,"cool":2},"uCOV6Bf5ER848xg52m7lxg":{"text":"Over rated!  It one of those must do tourist spots in New Orleans. You feel rushed to eat ","useful":1,"cool":0},"objGZ6cSwTUrax7AmEM6QA":{"text":"Great iconic pit stop in the French Quarter. Always a little crowded but the cheap prices ","useful":0,"cool":0},"Id3trK4Dm_I9cJZkE12TKA":{"text":"This place is right inside the outlet mall, it was really busy, but the cool thing about t","useful":1,"cool":1},"KvfVs9TK5RU9VsoyRl18lQ":{"text":"How did I miss this review, HOW?!\n\nFresh donuts....copious amounts of powdered sugar....ch","useful":0,"cool":0},"pTILEHYMNUhBeI1UCEKYrw":{"text":"Best beignets anywhere. Cafe Du Monde is open 24 hours a day and serves perfect, fresh bei","useful":0,"cool":0},"_QG7tI8oB9gGsRUwFn86Og":{"text":"An iconic spot with one of a kind specialty, the Beignets with powdered sugar. \n\nCash only","useful":0,"cool":0},"LcA4ReqtdYXbNFW-pteIzw":{"text":"Came here at about 10:15am and there were about 4 parties ahead in line. I had the mocha c","useful":0,"cool":0},"QHs4XiAJ0k9hL6LXNdXICA":{"text":"This French Quarter icon never disappoints. Best beignets I've tasted and excellent servic","useful":0,"cool":0},"VlZ7i2TTPTvbL4zetXu4Mw":{"text":"Delish!!! Got the beignets and the iced coffee to go. We ate it on the Riverwalk and enjoy","useful":0,"cool":0},"6mzd-cUaDUkss7_Ob1OjxA":{"text":"Get your beignets here ! So fresh and yummy but the only thing is the seating and wait tim","useful":0,"cool":0},"kfiv4-CMSr1Grz61Sr6_1Q":{"text":"I never made it to the flagship Cafe Du Monde but I'm happy that I got to at least taste t","useful":16,"cool":18},"h1itgcCEhGREAMEM4CBt6w":{"text":"The beignets here are awesome... That's where the awesome stops! The employees are so rude","useful":0,"cool":0},"2CChXPFYvdOyW_FQb0tuVw":{"text":"The attitude of the waitress is horrible and arrogant. The food is just ok. Too much sugar","useful":0,"cool":0},"LUjEcwPCYJ5BYMXbJ3vM8g":{"text":"Very long line, even though most of the tables were available. Slowest service possible. F","useful":0,"cool":0},"M28Vo4ZkzOfWova7jSl7DQ":{"text":"Best in New Orleans ... one star because the employees were not customer service tranined ","useful":0,"cool":0},"_jnu1vMq0TOkqoC36-Da3w":{"text":"We quickly found a seat in the air conditioned part of the restaurant. Our order was taken","useful":0,"cool":0},"Zxr1rLLzqHELaov7-1mdRQ":{"text":"There has been so much written about Cafe Du Monde that I don't have much more to add. It'","useful":0,"cool":1},"wxt1YA9nEwIbJHF4rMiLBw":{"text":"I heard this was the best place for beignets and coffee .. Due to pandemic we had to.. sta","useful":1,"cool":0},"grjzKNWSGsB-KylHWDtDBw":{"text":"What more is there to say about Cafe Du Monde and the beignets? We were in New Orleans for","useful":1,"cool":1},"d88ui6pWMJHPSiiMT30pUQ":{"text":"Famous for beignets and chicory coffee for a reason: they are the very best in town. I opt","useful":0,"cool":0},"U7Sl5aZD6zxaV9y1wvvLng":{"text":"Awesome must have while in New Orleans,  great shopping pit stop!!! Clean,  quick and fres","useful":1,"cool":1},"nQcKAVgDdLPe3XRo5DIYgw":{"text":"As great as we anticipated!! The line moves so quickly. Quick service once you're seated t","useful":0,"cool":0},"aRjIMpmGR_mso_TErFSQCg":{"text":"I mean, cmon it's a MUST!!! \nWalked 18 blocks from hotel for 3 beignets in 45 degrees and ","useful":2,"cool":2},"SOBNkYTyrbi3Z8vw7mr4_g":{"text":"We had to stop by for the infamous beignets and cafe au lait. The beignets were hot, thick","useful":0,"cool":0},"mf_xbKh-P7gMtuyO7awHWQ":{"text":"Really yummy. The wait sucks but there are TWO LINES! To go orders to the right and sittin","useful":0,"cool":0},"CIUY-ccWoicWpRf4Z3Dnhg":{"text":"The mall location provides much faster service than the original location.  You order and ","useful":8,"cool":7},"n1KjhUOgHme_dPeXGrbUnQ":{"text":"Café Du Monde beignets are amazing. That much goes without saying. \n\nPros: This location i","useful":1,"cool":0},"8HPcpBk67t3inF7Kn7oJEw":{"text":"Of course, the place is iconic and its a MUST go-to restaurant to visit especially for bei","useful":10,"cool":8},"gzXICSP_q3haMksWOY2-0g":{"text":"A 'must do' of NOLA, but the beignets (pronounced ben-yays) are just fried dough covered i","useful":1,"cool":3},"6NJHXIyhFZ5OIH98ItSeTg":{"text":"Great place! Even tho you have to get a table for yourself, its fast, friendly and great e","useful":0,"cool":0},"cS4niRMhlRxS-Ks4DJvV3w":{"text":"I finally had the chance to enjoy their  yummy beignets and coffee. I'm staying in New Orl","useful":0,"cool":0},"AooEEMrgLFokga3A4MYlIg":{"text":"This restaurant is inside the riverside mall. My husband and I were debating whether we sh","useful":1,"cool":2},"vh0ToftW0PGDppoXGJ6u0g":{"text":"The coffee was great. The beignets were not my thing. To me it seemed like a funnel cake b","useful":0,"cool":0},"91NmELkl5Nq3OvTTR1iNsQ":{"text":"Had to take the hubby here for his first time! He loved it! Their hot chocolate is the bom","useful":1,"cool":1},"ycAxjsP0zjVimB9ArtlOgw":{"text":"Best beignet I tried in New Orleans and great coffee as well to go with the great atmosphe","useful":0,"cool":0},"KmJLLkY5Tr8FBwEn4cp77w":{"text":"Of course you must visit the legendary FQ location, but once you've done that, you might d","useful":3,"cool":0},"LPvixDeSnQpkT_Q72Gom0g":{"text":"Unbelievably awful service. I've been in line for over twenty minutes and have not moved e","useful":0,"cool":0},"nwbRNVqdET2I3X_cuZ9rpQ":{"text":"I heard about this place as a New Orleans culinary institution which I had to visit while ","useful":0,"cool":0},"n4j3d9rzh-r6af_XAjC5Ig":{"text":"Located inside of the mall next to the Expo center and behind the Hilton Hotel. This locat","useful":6,"cool":1},"swmK2heM8pe-b6kTyDUobg":{"text":"It's a complete shit show - everything is sticky from the powered sugar and it's a wonder ","useful":0,"cool":0},"q59SKFTmM5JkGvN3ogHK4Q":{"text":"Everyone raves about Cafe Du Monde and their beignets, and I had high expectations. I was ","useful":0,"cool":0},"AGYC6ykkvzZAm1y1g4zDUQ":{"text":"I mean, say what you will but this place is the GOAT beignets and cafe au late.. which I'm","useful":0,"cool":0},"8annvsJBN7xrvIKDt171wA":{"text":"This is located in the river walk mall, and is quite a different experience from the origi","useful":1,"cool":0},"b3hUrh1RXXpFpg3dOJTo2A":{"text":"I was so happy to discover this location of Cafe Du Monde! I was recently in New Orleans f","useful":0,"cool":0},"QouX6uS-BzwnAL1E_DprDQ":{"text":"This location is very easy to get to and has so much around it to offer too. The staff was","useful":1,"cool":0},"d1mZM3srk0TN0ZVjcbT30w":{"text":"A must do in New Orleans. Coffee and beignet are the standard order. You get three beignet","useful":0,"cool":0},"8VhdgISgn8bg7A7w55asYA":{"text":"Its good to try things the locals are talking about so we went to this cafe. It's all coff","useful":0,"cool":0},"aSZ_7ViOsHDj8tf4N1sYeA":{"text":"Had beignets all my life, but never in New Orleans. Glad this was the first place we went.","useful":0,"cool":0},"l2lro8ZnKNvdNPC9dLyoBg":{"text":"One of the worst. Terrible terrible service. The staffs FRIENDS were showing up to talk to","useful":0,"cool":0},"4mgWP1iLAgtPSBA_N0pkJA":{"text":"Beat place I'm NOLA to get beignets! They are located on the corner and there is usually s","useful":0,"cool":0},"_l9nOambyCogYvhmQx9o3w":{"text":"Cafe Du Monde is a staple in New Orleans, and as such we HAD to try it. \n\nThe good: the be","useful":0,"cool":0},"Gcm4dkdJ8rZJeLH1nEvxMA":{"text":"Stopped in here for the beignets only. There were good but I suspect they are only good wh","useful":0,"cool":0},"mJrJ8I2f_MFVbhrLFcx94Q":{"text":"The coffee is so thick that it will stand up a spoon and is just amazing. The beignets are","useful":0,"cool":0},"Fwy-TZRaOAdT4rJeBD3axw":{"text":"Best beignets! Staff were super nice. Come early before people start coming for breakfast.","useful":0,"cool":0},"8t1xoERO44SX9Vuv7TDg_g":{"text":"I had cafe au lait and the beignets. Delicious! Found a seat in front of a band on the sid","useful":0,"cool":0},"XTpWbiyxW_h4fd7a3NFwiw":{"text":"Fun fact #1: Beignets are not pronounced \"Big-nets.\" Just because everyone has that one fr","useful":0,"cool":0},"iUE4uQISrdyARWb0I-it1A":{"text":"Now I know why everyone raves about the place! The biegnets were delicious - fluffy and no","useful":0,"cool":1},"4UVtWHj3byzgMm2eg4FU3w":{"text":"Quick service and great food!!! We went late one Saturday night. There was no wait and the","useful":0,"cool":0},"THBRQ2HMCqhfyYwtGIYF4Q":{"text":"The beignet business in New Orleans reminds me of the competition in Philly between Pat an","useful":0,"cool":0},"Yfakyx7K6y2sv860RL0dLQ":{"text":"Yes it is a tourist trap.  Get there early because the original one gets a line down the s","useful":0,"cool":0},"x7uiS8CLNgwuYa8lmF307g":{"text":"So, I had to try the beignets here because everyone has raved about this place! The line w","useful":1,"cool":0},"9GtqzmE4nLPnhg1owBzdGw":{"text":"So fun to re-visit this NOLA landmark...the coffee was great and the beignets exactly as I","useful":0,"cool":0},"KngxMU8If6CnjKKNEgJk-g":{"text":"We dined here during Mardi Gras weekend 2020. Due to Covid, I'm late on the review but it ","useful":0,"cool":0},"d_xzZyzhPZLltmJRNpFUZw":{"text":"I stopped in before 9am while it was raining. It was busy but there wasn't a line to wait ","useful":1,"cool":2},"wwvtKr9gMM4HvID8etdDpA":{"text":"My favorite cafe in New Orleans, the line went very fast and the service was prompt and pe","useful":0,"cool":0},"2fnfM1B3nOPZGw6xBjWdjg":{"text":"When in New Orleans, you must treat yourself to a trio of such deliciousness and coffee! N","useful":0,"cool":0},"DZ4qvrTAGGFCZx2O4J69CQ":{"text":"I rarely give any place five stars, but wow, was I impressed with the beignets. My husband","useful":0,"cool":0},"w2hXgCpAQNx_nLpR1eRWcw":{"text":"So glad we found this location! We tried the beignets and they were as good as I hoped. Lo","useful":2,"cool":4},"-zNd76-9ig0l74P4lrWChA":{"text":"Amazing beignets and okay coffee, But the people who work here talk and do everything in s","useful":0,"cool":0},"Zw9os2YqRHh04c8cyzgG2w":{"text":"We knew there would be a huge wait if we didn't get here at a good hour, so we got here ar","useful":1,"cool":1},"sU7TacbVcF12PGUvKo-7Gg":{"text":"Not as good as the original, but when you are at a conference, it's easier to get to!\n\nThe","useful":2,"cool":1},"vHmLN0X9pOF96Ip4Jr9oLA":{"text":"Best beignets hands down!!!!Quick service and messy confectioners sugar floors. Like diner","useful":0,"cool":0},"1s-oIedgt_R35OjkbJ6iPg":{"text":"Beignets! Best ones.  With cafe au lait, you have to have it daily while in NOLA.  I went ","useful":0,"cool":0},"9m8trMPUcnbKgMy09-Eszg":{"text":"Best ever . A little bit of a wait but considering how many people it went by in no time.","useful":0,"cool":0},"4ooVmu_0PylABnzlkz0OcQ":{"text":"It was good , just wish it wasn't hard , cause I heard they're suppose to be soft ? & it c","useful":0,"cool":0},"qtWxHJ30EW2BvxgX2m3N6w":{"text":"I had been here several years ago I wanted to show my wife, the beignets were outstanding ","useful":1,"cool":1},"cdWCXJlRfWweR3spqPsiQg":{"text":"A visit to New Orleans is not complete without stopping here. It really doesn't matter wha","useful":3,"cool":1},"r-50rqPLWfHyER15GarShg":{"text":"Best beignets in French Quarter. No need to dine there so wait on the line without seating","useful":0,"cool":0},"MUKs5bm_QyXwtYF4UX7Yyw":{"text":"The best hot chocolate & of course the beignets are delicious. It's a cash only spot, so k","useful":2,"cool":0},"BjItIYrRhLRa82tFvd0Ttg":{"text":"The Beignets were the best I've ever had! I truly wish they were able to ship them. I woul","useful":0,"cool":0},"eDxZSHzCsILNA9tSNJSG3A":{"text":"I had beignets. They're square French donuts. I had an order of three for $3.40 smothered ","useful":0,"cool":0},"NOJN3GjT1O8j8u7lhBDgAQ":{"text":"I came here to on my latest trip to NOLA. My group opted into doing the to go service whic","useful":0,"cool":0},"T9CHWk6w8Q3gxTjpBTSzGA":{"text":"Beignets and coffee au lait hit the spot and cannot be beat.  Wait staff leaves something ","useful":0,"cool":0},"KMBPu-vatc_UwKXxVTXuWA":{"text":"The staff need to be trained in manners. Take care and pride in what you do, customer serv","useful":1,"cool":0},"gzUsWhPgk8RrY7lvu0J5Gg":{"text":"Ate the beignets here 3 times, once every day we were here in NOLA LOL. It's THAT good. Th","useful":1,"cool":1},"e129Uhn2pnGzvXXEiS1Dgw":{"text":"The name speaks for it self for this company, their menu is simple, just plain beniets and","useful":1,"cool":1},"TDGk8QFKEXCUHcih-CoQ5A":{"text":"Very disappointed. We walked 20 minutes one way to try some beignets. We ordered takeout a","useful":0,"cool":0},"F1qKZX3_joiN0O3p9GZotw":{"text":"My family and I came here expecting to try iconic beignets... but all we got was horrible ","useful":1,"cool":0},"bdHQRpX_yaiHldcvExSYuA":{"text":"This review is partially for the quality of food at this location, but mostly for the serv","useful":0,"cool":0},"VRmEpntgewnluh3Y6kfGZA":{"text":"This is not the original location. It is a mall version. The good thing about it is the li","useful":1,"cool":1},"68Us7v8B8wIhwNJNBlQRGA":{"text":"The infamous Cafe Du Monde... we were told since we were staying at the Hilton Riverside t","useful":1,"cool":1},"z34WLrkXgD0NXdh11oORtg":{"text":"If you don't make it to Cafe du Monde, then you didn't go to NOLA, thassit, don't even arg","useful":0,"cool":0},"2rl2sUubAC8CzON3DTB5jQ":{"text":"What can you say fried donuts and coffee. I mean it's good and they are very filling and w","useful":1,"cool":0},"2Xvg25THKAa-QhS4iVW0Gw":{"text":"Beignets? Great.\n\nCafe au lait? Not great.\n\nLong lines? Also not great.\n\nIf you want to co","useful":0,"cool":0},"nLv9r5c3dWqjYIFQEsKFGw":{"text":"Very disappointed in the quality of the Beignet's at this location. They were flat, cold a","useful":0,"cool":0},"_eLs1aF0hcO8xHmD_mp_Bg":{"text":"Tried this place because come on you cant go to NOLA and not. It was good, beignets were w","useful":0,"cool":0},"doOWSxI3iOi5cwWwIxrqzg":{"text":"The beignets were absolutely phenomenal. The environment is very open and the service is g","useful":0,"cool":0},"2dKg3USn8EClHhnNWHEH3Q":{"text":"Obviously Cafe du Monde is a place one goes while visiting New Orleans. We actually ended ","useful":12,"cool":9},"PixZB45oZtfVXUayDPBPiQ":{"text":"Great service, no lines, clean tables (no random powdered sugar on my clothes!), and a gre","useful":3,"cool":0},"mTAfdFR_VfdUB3-_M72kfQ":{"text":"GO AT NIGHT! we went around 11, sat immediately and had great service. the hype around thi","useful":1,"cool":1},"voRFCmti1nfZJrK6cTihjw":{"text":"I am pleasantly surprised with the Cafe Du Monde. The Beignets were great along with the i","useful":0,"cool":0},"Y4VOYlz9rJ5bvJbvT83pEg":{"text":"Not all it's chirped up to be. The fried dough is obviously the best thing they are servin","useful":0,"cool":0},"iODV1tkeuuaOhyqHDZGISw":{"text":"I wish we had had a chance to enjoy the beignets here! We arrived at 6:30 pm from Orlando ","useful":0,"cool":0},"7ZYKlB0SzHbHj1ezBPsrmg":{"text":"First time getting cafe du monde was in the Riverwalk mall as a snack to watch the 4th of ","useful":0,"cool":1},"wN5RPiBI0_h9XVC4fGlIjg":{"text":"Nice treat to get while shopping. It is small but with enough space for coffee and a treat","useful":0,"cool":0},"LsxhNwco9IT5I4o9Tb6oyA":{"text":"Slippery floors from the beignets residue ... Crowded and waiter had a smile anyway ... So","useful":0,"cool":0},"gkv8pj4nn9MBlDbzUJ38QQ":{"text":"You have to go try Cafe Du Monde when visiting New Orleans. How could you not! They are kn","useful":1,"cool":0},"60zmTa5TSeoj0vgmrp-yyQ":{"text":"Beignets are a must and cafe du monde is the place to you. End the night with a beignet an","useful":1,"cool":1},"I3QmKTzwhKw4Zp4KiSYjOw":{"text":"Whether it's the jazz music outside or the location beside Jackson's square or the simple ","useful":0,"cool":0},"YHopecqmuOpY4MA6Nvnu-g":{"text":"I enjoyed the beignets 3X  they are made fresh to order so they are warm  dusted confectio","useful":1,"cool":1},"0tlp9Cynb4a1SjGTrOq9QA":{"text":"Gotta try 'em, just to say you did. The beignets are super yummy and I had a mocha, which ","useful":0,"cool":0},"_psIvXtgH0hfirP2bDm9XA":{"text":"The beignets were alright -- I think my expectations were a bit too high because Everyone ","useful":1,"cool":0},"HLYYnX1-qr3vsFbycOqP3Q":{"text":"I went on a Friday afternoon around 2, and the takeout line wasn't long at all. It moved q","useful":0,"cool":0},"0CYo3nsb7gmxZC3Pk-zmRA":{"text":"Well just don't get there at 8:20 on a Saturday.... they say they close at 8:30, BUT hours","useful":0,"cool":0},"1qc7PMgtuTZyKA45GTCvsA":{"text":"This place is a waste of time & money. The iced coffee literally tasted like if you used a","useful":0,"cool":0},"-3l__ELvOD8iORYysBsfjw":{"text":"I was told two things about food in New Orleans, get some fresh crawfish fish and go to ca","useful":0,"cool":0},"UFhOmIQ2B3OWnh0YDkyaQg":{"text":"Still unsure of what the hype is. Tried a second time to enjoy their beignets and their ch","useful":20,"cool":13},"YRR04Kwq1_TrHPzoScY34g":{"text":"Went to the location in the mall it Was an Absolute disappointment.  We waited online for ","useful":1,"cool":1},"Ws508iOdbJSXY90FONSu2g":{"text":"If you want cold beignets and burnt coffee, this is the place for you! We showed up on the","useful":0,"cool":0},"O7Zu1nU0en2s0B9iMbkHgQ":{"text":"So tasty. These little treats are dangerously good! This cafe was suggested to us as a \"mu","useful":0,"cool":0},"cc3KTbUhYeN8xAt-ur5TVA":{"text":"3rd time here, 2nd time for our kids and 1st time for their friends. Hot and delish with i","useful":0,"cool":0},"TmVrCGS3DTOzcmZRrtryTA":{"text":"Classic New Orleans.  I had a delicious pre-dinner treat!  I was only in town for two days","useful":0,"cool":0},"ZKtr7gvKaJIb6mxp2-C-Zw":{"text":"Decided to stop in and have a beignet while visiting NO.  You get an order of three so I j","useful":0,"cool":0},"uxmhNjXtNE-2gFNLZDjB2Q":{"text":"I love there beignets I even decided to make them myself to mom is from New Orleans so whe","useful":0,"cool":0},"GJVf5qAjeg83QegKXLhnfA":{"text":"I guess it's all about the experience and history. Coffee was good and the Beignet was goo","useful":0,"cool":0},"5Gbt2-9kIYChDOmIXW9A5g":{"text":"Lots of hype for a powdered piece of dough. There's many breakfast places that you can get","useful":0,"cool":0},"58AvKa_ejsrmg2KTqIL8AQ":{"text":"Tried beniets for the first time and they were really good. We also tried the frozen coffe","useful":1,"cool":0},"X5Ms8E8NJ1EcAjeGiUEs2w":{"text":"You can never go wrong with Cafe du Monde. The beignets are amazing, unlike any others I h","useful":1,"cool":1},"4aF-uI-CaThpBrMWEowcnA":{"text":"The Cafe Au Lait was delightful and the Beignets were great! Our first having them and we ","useful":0,"cool":0},"hqaQYbtHGHtE5u0UpEOe3g":{"text":"If you like to wait in line a half hour to be treated rudely by asian wait staff so that y","useful":0,"cool":0},"HDZB3EEmVKY6yru4TBJVdA":{"text":"I had been to Cafe Du Monde 20 years ago and had very fond memories. I was very excited to","useful":0,"cool":0},"Ht-dNOka9zkydLjtn_uAMA":{"text":"Wow now this was sweet. No pun intended. The wait is long but completely worth it. \n\nCoffe","useful":2,"cool":2},"fA8ZhnVMol0q0Kboqlg0Gg":{"text":"Is it worth all the hype and the long wait? Probably not. Is it worth most of the hype? Ab","useful":1,"cool":0},"fKGLcjGE3Z_hh7vV0Nk10g":{"text":"Yummy a little heavier then expected but who doesn't love beignets. The bad is loaded with","useful":1,"cool":2},"1_rch9gLiAw-j3kGMIezBg":{"text":"Beignets are amazing. Coffee or Cafe Au Laite was delicious. The orange juice was nothing ","useful":0,"cool":0},"i-OMozeUvGcT7SdSxKXjsQ":{"text":"Simple. Delicious. The beignets were amazing and fresh. Don't even get me started on the c","useful":0,"cool":0},"nY0O35-g3sMJFA8JmsWEXw":{"text":"If you want to avoid the long lines at the French Quarter location this is the place to go","useful":2,"cool":2},"RfiVxyTNJwq1VzXO2JaMkA":{"text":"Go to cafe du monde for the beignets. The coffee is terrible! Don't let the long line stee","useful":0,"cool":0},"ndmdK6zM_fiJBwszZX2sDA":{"text":"Overrated. I really don't think it is any better than fried batter at the amusement park.","useful":0,"cool":0},"uD5kyXwGCrOqqe2rJHDODQ":{"text":"We went to the original location across from Jackson Square at 3pm on a Saturday. The plac","useful":0,"cool":0},"1fnev_E-gYn0o4spHL4b-A":{"text":"It's a must for New Orleans!! Only place to try it!! \nThere are two lines. One is for take","useful":2,"cool":0},"nlt_WXKC0CpyFwmBOw_okA":{"text":"Two words: just go!!!\n\nThis place is a New Orleans staple! Just look how happy I am. They ","useful":0,"cool":0},"D1oBvUjFswby-7mCRgzLdw":{"text":"Omg! OMG OMG OMG! These beignets...... Can't talk - my mouth is too busy chewing lol sugar","useful":4,"cool":3},"108HQwFM3AVjCCCN_cgwow":{"text":"This is a New Orleans classic- don't overthink it. Beignets and Café au lait - out. #lebom","useful":1,"cool":0},"VCUcbVz7lwToUVAA7HuvfA":{"text":"It was a very beautiful day out on in New Orleans on Sunday morning May 23rd. The Original","useful":2,"cool":2},"RIpiu0Ge-q_2B_UbCMzCnA":{"text":"Love the vibes of this place. Smells very good. Super hyped up though. It was just okay fo","useful":1,"cool":1},"2cIVPDU2Pvzv9vhrav8TvA":{"text":"A place with a lot of history and we wanted to try it. Their coffee was delicious and bign","useful":0,"cool":0},"a-lAb_LwMXxHpg3bL7-eJw":{"text":"This is my second time to New Orleans and of course we had to go to Cafe Du Monde! \n\nThe b","useful":1,"cool":1},"xx0nTGpIhrjcJNebomPeqg":{"text":"Simple and stupid good. The line moved quick and it's chaotic inside but once you're sitti","useful":0,"cool":0},"ZlC36-1QWOxX50shmgM7pg":{"text":"Elephant Ears made famous! This place is a tourist gathering so don't expect to just walk ","useful":0,"cool":0},"6bGThag7XopMoyVxm4ur5A":{"text":"Love it! Located in the Riverwalk mall. Here u get to see them make the beneits through a ","useful":0,"cool":0},"AV5CVF6pTdVkxCBSxp8a6g":{"text":"I have looked forward to experiencing the infamous Cafe Du Monde since I was told it exist","useful":1,"cool":1},"hAT2N9VY4n0GPgId0N_dZw":{"text":"If your Fitbit is covered in powdered sugar, should you lick it? Well, I did! I had to! TH","useful":6,"cool":9},"nZ8gjNpzaRo8GyqbFzS04w":{"text":"Busy place, friendly service.  Coffee menu is limited as they didn't have mochas.  I did h","useful":1,"cool":1},"Xza-kevjQWP1gBBLGZnciA":{"text":"Too much hype for nothing. Yes beignets is something NEW and not so often found anywhere e","useful":1,"cool":0},"MReV89XvxlWw8gC7niIrQg":{"text":"Visiting from Dallas. I'm mad I wasted my money and time. First of all, this place is over","useful":0,"cool":0},"fcNL_GDhQDTtBUaAUjpr5Q":{"text":"Cafe du monde is by far a must if you are traveling to NOLA. The wait to be seated can tak","useful":0,"cool":0},"VaMfVLTE-2vPua_l0ADC5g":{"text":"My first time here was in 1995. I remember feeling very fancy and sophisticated because I ","useful":0,"cool":1},"wfOliI49ycLo520DBTlpnA":{"text":"Ok so this place is legendary for a reason.  I've certainly never had better beignets, and","useful":0,"cool":0},"1p28ZY-pvuJvkhItzPqq8w":{"text":"We arrived about 9 a.m. and only had to wait about 10 minutes. Expect cramped dining and s","useful":0,"cool":0},"GSfMenInrQ3M3miT_AT89Q":{"text":"Great beignets and coffee. \n\nThe line was quick to my surprise. We got their just in time ","useful":0,"cool":0},"-0lKuv5OcJB03FFCxP4iWQ":{"text":"It's 8:15am... No signs posted of opening later or being closed for Easter. Been waiting b","useful":1,"cool":1},"N3M24lsKByS19gWwhzklmA":{"text":"Beignets were delicious, and people watching superb. You just find an empty table and they","useful":0,"cool":0},"icmOBpCo_M4IfBhIqpY8gQ":{"text":"Don't really understand the hype. \nThe hot chocolate is basic and the beignets are kind of","useful":0,"cool":0},"gThmxKMyzwi37AQL6Eevow":{"text":"On a stop in a city tour, we had a 20 min rest stop at the famous Cafe Du mined. I was exc","useful":3,"cool":1},"J-EWo9Z6v22lh0m2STaTYA":{"text":"Taste overall amazing they were a tad hard but they were so good I chowed down !! Hot choc","useful":0,"cool":0},"62XA7wBWXm11vLZvy-eIAw":{"text":"Before hitting up the Original, I decided to go to one of the other locations to avoid the","useful":5,"cool":5},"VSrp5OoIKjKrgREP0LJwGw":{"text":"Must have while in New Orleans. Lines were very long. Come prepared to wait. Totally worth","useful":0,"cool":0},"w1t0z1o-TSx-4zcT1K8P0w":{"text":"Was delicious Beignets and wonderful coffee \nWas assisted by a wonderful gentleman tipped ","useful":0,"cool":0},"fDgKmlCmbzRZRJU7GnnXeA":{"text":"The best beignets you could possibly eat. If you don't like crowds, this is not the place ","useful":0,"cool":0},"SKu6KhIpLOiiQ8tXapoYww":{"text":"Located on river walk, this location is a great place to try a New Orleans favorite. I enj","useful":1,"cool":1},"JdiuBFpOJOEAmDhrHnvjOQ":{"text":"This Cafe Du Monde location was at the outlet mall. I intentionally went here, instead of ","useful":1,"cool":1},"xYOSCTplBbs3JG4MnTIMQA":{"text":"Awesome food! Beignets we're fresh and hot. Fast service. We came by around 10pm and had n","useful":0,"cool":0},"ye11Nk0BcgRbCwQYRN5KRQ":{"text":"Oh my goodness!!!! I was told by a cajan friend and a coworker from across the country to ","useful":0,"cool":0},"3f2AhsfUfWZIl4UlqQE5kQ":{"text":"Love, love, loved it!!  The beignets some of the best I've had and frozen coffee , I would","useful":0,"cool":0},"rDu2RHPtj7ZGkTHjzi7RTw":{"text":"The beignets here are always up to par and I have never had a problem with the service unt","useful":0,"cool":0},"XeOKNHUINBbQFP7TyGjiDw":{"text":"A fan FAVORITE! Cafe du Monde is a wonderful cafe with THE BEST beignets on the planet! Al","useful":0,"cool":1},"B_FJal3jIOKF1gYKBEil4w":{"text":"Beautiful view of the Mississippi River. Not the same ambiance and experience as the origi","useful":3,"cool":0},"BCYbgODKhp3hGL9O1Do0hQ":{"text":"This is something we look forward to in NOLA as is one of our favorite treats but I have t","useful":0,"cool":0},"4emmxbl09AgzDtFVpQliMw":{"text":"This place is connected to the mall. As we came around the corner, the line met us. The me","useful":0,"cool":1},"RGa1QsyvsRHwGtOUtuuQfQ":{"text":"ABSOLUTE MUST if you're in NOLA! I went crazy over this spot when I visited in November. B","useful":0,"cool":0},"D5UZNWLcBh3CjdtM4lUzVA":{"text":"We ate at this location two mornings in a row after visiting the original one in the Frenc","useful":50,"cool":45},"7pR0Ww2TRTakSamavEUuJw":{"text":"Walk in, grab any table, and someone will come and help you! When it gets busy, I recommen","useful":1,"cool":1},"AxtZ6RpB4MRQO_XwTNW8tg":{"text":"For whatever reason either if the parking is too hard to find within the quarter, the line","useful":1,"cool":1},"Gp1QuAGQ4djt90cKzocMXA":{"text":"This powdery delicious hot treat is a New Orleans must.  Can't come to New Orleans without","useful":0,"cool":0},"41eQrs4A1axhjCZ_CNVDaA":{"text":"Sooo delicious! A treat of pillowy crunch and sweetness that puffs and plumes all around y","useful":0,"cool":0},"tVI0JpngLk7JtqAC4LstgA":{"text":"Came here on a Wednesday late afternoon with my cousin who was in town for a conference. T","useful":2,"cool":1},"8SDn3pHUujn5DcU2iL5CZw":{"text":"We headed across town to get their at 6:45 ahead of their 7pm closing time.  Paid a $10 va","useful":0,"cool":0},"4u_tFwEFHmLozrFI2PrqGg":{"text":"My daughter had beignets from Cafe du Monde as a must-do item while in NOLA. We had stoppe","useful":0,"cool":0},"YqplqJ8lIMMAepEk5h4Xew":{"text":"Same rules as the Cafe Du Monde in the French Quarter: but takes Credit card. This one is ","useful":1,"cool":1},"sJyym2KpCNshZpa9SgDVoQ":{"text":"Always a treat stop for the best in town. The music outside was perfect the coffee hit and","useful":1,"cool":0},"Yw9xfPQZ1LFMcBc8pz-L-Q":{"text":"Both locations are nice.  Cafe Au Lait was delicious.  The chicory is subtle.  Beignets ar","useful":0,"cool":0},"W2D6sucNmK0cqyID-8fVSQ":{"text":"Beignets... been there done that.\nNot worth waiting in line forever... I had better beigne","useful":0,"cool":0},"EUhkkQ0btJtCT8f8zLPy4A":{"text":"OMG!!! What can I say...addictive! The staff is great! For such a busy place...you just do","useful":0,"cool":1},"rupZdFIZcf1eXzyCJ_SiUA":{"text":"If any rightful tourist never tried the original Cafe Du Monde and doesn't want to mingle ","useful":5,"cool":6},"J99lt-HuLdHBek6myj05XA":{"text":"When in NOLA... you have to get some beignets! When I visited, I got beignets every day of","useful":3,"cool":3},"9-9w7GxD2-k5pdRRCfrXsQ":{"text":"The frozen coffee was delicious. The two cups of hot coffee was mediocre at best. I've had","useful":0,"cool":0},"9SPD1-vqNyc1xOQ-Riqz3Q":{"text":"This is the location in the Riverwalk Mall and it is delicious!!!!! The line is long, they","useful":0,"cool":0},"5jq9Yl-MXJjhUWZiFRKA-g":{"text":"One of the must do when you go to New Orleans is the get some chicory coffee and some beig","useful":51,"cool":50},"CYXVqAckfukMuVXN8N5B7A":{"text":"I stopped here  in the port mall area at first opening in the morning. There was already a","useful":1,"cool":1},"9p-r8hdzMDRWvLax8tQNYw":{"text":"It's just friend bread. Nothing super special about it. I usually drink black coffee. But ","useful":0,"cool":0},"XoHRJMQCacczPtbrHc6nmA":{"text":"I honestly feel like this was very overrated. The beignets and coffees were good, but noth","useful":0,"cool":0},"Zs5U_eO9z-hcNP2UdtoNRw":{"text":"My google maps placed this in the middle of the park, but actually its in the Riverwalk Ou","useful":2,"cool":0},"c-acy1WDKxPtiiwnj7dllQ":{"text":"This place is absolutely magnificent. So magnificent that we came here twice on our trip. ","useful":0,"cool":1},"5YiChnGVuYN-Z5X0Cxc6TA":{"text":"I came here for one thing ... to check out the hype around these beignets... yes the hype ","useful":14,"cool":11},"ug2v2yu6b6yAEimQTTTcrg":{"text":"Three powdered sugar-soaked deep-fried and served warm beignets for $3.40 ... ohhhh yeah! ","useful":0,"cool":0},"ldMZZGGzhy9lGanYfKTJKQ":{"text":"The staff was a nightmare to watch. Out of 12 employees only 2 of them were working during","useful":0,"cool":0},"vKge5SCRr4PqSFDrfwi7Tg":{"text":"I don't recommend this place.  The beignet is good.  The coffee is ok comparing to other v","useful":1,"cool":0},"OitN85krqoS86VhkkP_MvA":{"text":"Everything is amazing. The frozen cafe aut lait is to die for. Lol. There has not been a t","useful":0,"cool":0},"aSJVFLvJBELeFBeg366V6g":{"text":"Let me say this. I don't know if all cafe du mondes taste like this one but if they do, th","useful":0,"cool":0},"jTTJLzZ3HZFy7Kus1CUncA":{"text":"Cafe Du Monde will be one of the things my sister and I talk most about from our New Orlea","useful":2,"cool":1},"ExHrhxxZXGqJPGPnZyZSQw":{"text":"This location is not as busy as the one in the French Quarters. However, the line can get ","useful":1,"cool":1},"_Ce_PXUFEsHbLDRuMxs0Yg":{"text":"Honestly, I was a disappointed. There was a lot of hype around Cafe Du Monde, so you can i","useful":1,"cool":1},"Ma1V9LDiPopBXHkU70hRsA":{"text":"The beignets were delicious although the iced Mocha was not good, it tasted like coffee wi","useful":0,"cool":0},"AnZrPLhwA9HjjORc1thVOA":{"text":"Came here for the famous beignets and coffee that pretty much every single Vietnamese pers","useful":0,"cool":0},"24fUXM3I_cOFMCTgFupRhw":{"text":"One of my favorite things I Ate during my NOLA food tour were these delectable beignets. I","useful":9,"cool":8},"R1P_6AESki08sB420yOD-Q":{"text":"This was my first visit to New Orleans so my first stop had to be Cafe Du Monde. The line ","useful":0,"cool":0},"tFcSl412RIuIuHGXrQ_aug":{"text":"CASH ONLY\nBeignets were so over cooked, not by a little but a ridiculous amount.  If you l","useful":3,"cool":0},"GQInhre--PUQe_d8wA0gQQ":{"text":"After getting some chargrilled oysters we end up walking around the mall and decided to ge","useful":1,"cool":0},"7iDacHP2SHfVGHjDefYrqg":{"text":"Fried dough topped w/loads of sugar. It was just okay, not worth the calories. At least th","useful":1,"cool":1},"rLGQvG6V-QQIaJj0nsb24A":{"text":"Delicious if you're just looking for Beignets and coffee! Showed up right as they opened, ","useful":0,"cool":0},"cCFUG5ZQFDERa5d53D6c7w":{"text":"I was so excited for the New Orleans staple. I wasn't impressed.. the staff was really nic","useful":0,"cool":0},"J09WK8ok_x9Kw-Tfpblf-A":{"text":"I visited this Cafe Du Monde location a few years back and the delicious beignets taste ju","useful":19,"cool":18},"JI6gzjyP1ahq0o9N61ring":{"text":"Was going to give them 4 stars, but it's not possible.  Hot fresh beignets, delicious coff","useful":12,"cool":11},"gH5PbZ4IyqGTLt5HRaXnkw":{"text":"As far as the beignets go, it's pretty close to the original. As far as the space goes, it","useful":1,"cool":1},"CqKrUVqmFy8oFaWst5X7wg":{"text":"pure amazing! we are coming from Los Angeles and we have heard so much about this place ! ","useful":0,"cool":0},"rv7UATcYrF1TN4b5sqE8kg":{"text":"Firstly, beignets are the best invention, ever. So much amazingness in one bite! Dough is ","useful":1,"cool":1},"MsFgMY0vsg7WDO17DF6pvg":{"text":"Ah the infamous Cafe Du Monde. \nThis is the first place I had to go. \n\nThe begniets as you","useful":1,"cool":0},"dhM8MTxZMv7mAYnhv5qq2w":{"text":"Terribly disappointing beignets for all the hype and positive reviews. Not made fresh. Spi","useful":0,"cool":0},"ITdnbF40ksl8AOrlqI_l4A":{"text":"Mmmm... Beignets!!! \nNot the original store, but still the same chain. The beignets are go","useful":2,"cool":3},"jEDX7zG5voiaFUeBGjvFCA":{"text":"Classic and a staple. Super sad that it's no longer open for 24 hours but no matter. We go","useful":0,"cool":0},"brDI0hGZvi6G-j4wEUpNMw":{"text":"This place is sometimes else. On a Sunday morning with a line the length of the mall did n","useful":0,"cool":0},"FjK7ojmjJkSzOC5b5Mx3MQ":{"text":"CoVid changes ruined the atmosphere of this famous place. It's now coffee in foam cups and","useful":0,"cool":0},"M-zzUeYWN5FsuRjfH6epFg":{"text":"Came to this location since it was close to my hotel. The staff behind the counter was not","useful":0,"cool":0},"i30V0d1zQw9CauLJnQCfwg":{"text":"The line was long but moved quickly and efficiently. If you see it don't be turned off bec","useful":0,"cool":0},"umedzVbe7PzFxNdHmXxh9g":{"text":"Let's just be real, real quick.... \n\nI was just waaaay too excited to be here coming from ","useful":8,"cool":8},"zZt3l2x3uy9djrpBK2sSSg":{"text":"Being from New Orleans I would never stand in line in the French Quarter, but I did take o","useful":0,"cool":0},"-EucRgL1e7ox9E1oAX5vmA":{"text":"Not a sweets fan, but this place is a MUST, when you're in New Orleans. Big, fluffy beigne","useful":1,"cool":1},"OLmsNToJQuSczVQ0s62-xg":{"text":"We showed up at 10:45 and the cafe said it opened at 10.  The employees were sitting outsi","useful":0,"cool":0},"TfvZ2TfC-EW2DrZniPQ7Ng":{"text":"This is the Riverwalk Mall location, which has both outdoor and indoor seating. The lines ","useful":0,"cool":0},"aEw0tW7tpC3WBFZE4eJq0A":{"text":"Good place to stop for a coffee and beignet break while shopping in Riverwalk. This locati","useful":0,"cool":0},"kv6ZbtsqTO4yi6kI6AQDTA":{"text":"Not only is Cafe Du Monde the only place that gets beignets right, but they also gladly se","useful":0,"cool":0},"qktlw-XNaZhTCCo6deUBDw":{"text":"You must do this! Best treats and coffee around and come on......... New Orleans style! Ri","useful":0,"cool":0},"GLv-uUvk7xGDTLR00wbTvg":{"text":"Riverwalk location- Don't get there at 8am, first beignets came out at 830 and the coffee ","useful":0,"cool":0},"fLtj9iT4O5r1RmrXp_7zWQ":{"text":"Coffee is good, not too hot. The beignets weren't fully cooked. And 'jazz' band playing on","useful":1,"cool":1},"u_g17hz_-FmiNnmYruiULg":{"text":"We were told you have to try Cafe Du Monde if you are in New Orleans. So we did. We ended ","useful":0,"cool":0},"PWjGIfIJKVej8n45BjTYZg":{"text":"This isn't the original location, but tastes the same! We ate here because we had an hour ","useful":2,"cool":0},"c3f41Zj2rMpOrGYDFln3Zw":{"text":"Definitely have to come here because well the beignets are famous. However because everyon","useful":0,"cool":1},"aZF7wHB-bQNmSVLRCRTpNQ":{"text":"One simply *does not* visit New Orleans without going to Cafe Du Monde. This is THE place ","useful":6,"cool":6},"HjF1dK9Y8JCbe2QXHQUgnQ":{"text":"Go here if you want to just claim that you tried their beignets and conquered. There are w","useful":1,"cool":0},"SEP04s1hUU01AUkaVUmpWA":{"text":"It's nice that they opened up a cafe du monde on the Riverwalk, however it's not the same ","useful":1,"cool":0},"Jl8-yFzeykUDU5CMJ3uDYA":{"text":"I love beignets.  I love coffee.  I've made CDM's beignets at home, but they never turn ou","useful":2,"cool":4},"jS_XF0M4kzUqOjxA6RALxg":{"text":"Second time in New Orleans and this is a must! They are worth every bite. The menu is smal","useful":0,"cool":0},"wK6xzZLknEdJXFD84hysag":{"text":"You ever get yourself so excited and hyped up to try a new place? Especially when they've ","useful":0,"cool":1},"alHXRFx_5egSc8xbTl2c8w":{"text":"The best beignets around, many places will have them but none will compare. Now getting th","useful":0,"cool":0},"90S6UtJfFvTRNMozC-AdBQ":{"text":"First time at this place, busy, hard working and friendly waiters! The place looked super ","useful":0,"cool":0},"J5W7lZOk0fwA-jtGdIUafw":{"text":"Where to Beignet?\nThis is a tough one.\nOn one hand the 'Experience'\nWas worth it.\nOn the o","useful":0,"cool":0},"-wN-ymwyT1IxAG-MH1m4ng":{"text":"Waited I line for almost 30 minutes but I was told these are the best beignets in New Orle","useful":0,"cool":0},"fxYukTwGeWm3zTUrzUHcnw":{"text":"Cafe Du Monde will always be a New Orleans staple!  Their beignets are DELICIOUS and they ","useful":0,"cool":0},"ndjqkKk21RUtNBe_9b3igA":{"text":"Best beignets in the city! The line is long so just be patient. Try to get a table and the","useful":1,"cool":1},"LHbd1X18ENPUeLVnPaH-jA":{"text":"I was in New Orleans and heard about Cafe Du Monde, who are internAtionally famous for the","useful":51,"cool":43},"O_ynm5FcHtj7LMGaVE1pbA":{"text":"Classic Café Au Lait and Beignets - in 2 locations\n\nOur group was recently in New Orleans,","useful":1,"cool":0},"dy2gvMMI5MIykOiWuXwIow":{"text":"The last time in NOLA we were unable to experience the beignets, the line was just way too","useful":2,"cool":1},"NEGlDDS_DA3qQyzJFt-8Gw":{"text":"I'm not sure what the hype is about. \nI fell for the tourist trap.\n\nThe beignets are sub p","useful":1,"cool":1},"8nz84p_qiM_7hEzj88p_Wg":{"text":"If you've never heard of this place before, you gotta be kidding me. It is THE MOST famous","useful":1,"cool":1},"iKmzXhoPvP1epdx7YTEm2Q":{"text":"The beignets were just as good as I remembered: soft, little, warm, sugar coated pillows o","useful":1,"cool":3}}