{"1aNro6MiC4tQwPhJc7S5tg":{"text":"I love sweets! I really really do! So it doesn't help that a cupcake place was next to our","useful":1,"cool":0},"dk4eZgPoeZJAbhFG9_kAiA":{"text":"Let me start by saying that I am a cupcake fanatic and have tried lots of cupcakeries in t","useful":2,"cool":3},"T0fV1HDoa7IpNDLuDUgy7w":{"text":"Expensive? What isn't in this stinkin town! Tasty?  Oh yah! Lots of fun, creative selectio","useful":1,"cool":0},"Lr0f7BXMV07ojM4HS_2TNw":{"text":"Two tasty cupcakes (Strawberry Fields and Reese's Pieces) at only $5 total? Huge selection","useful":1,"cool":0},"FGuHKy88AkxtTy4Oj8nl_A":{"text":"I was excited about the flavor variety and the concept of a build your own, but when I got","useful":2,"cool":1},"tO_Eww137j6AgQiwXAW_Uw":{"text":"Great red velvet cupcakes - just the right balance of sweetness.  Day old coconut cupcake ","useful":1,"cool":0},"qcGvlKez3EG_r-2ljfOoPg":{"text":"Guests at my wedding FLIPPED over the Fat Elvis cupcakes. I agree that the cakes have a we","useful":3,"cool":1},"Ay9ja7s0lBlb42hoal1bFw":{"text":"We stopped by this place on a whim after walking by Emeril's NOLA. The cupcakes were reall","useful":1,"cool":0},"g-F-BThNHhs-EXhXXSuyGg":{"text":"OOHHH MMMM GEEE! I LOVE this place.\n\nBeing from the D.C. Metropolitan area, I've been to m","useful":2,"cool":0},"y_Zys9arXM6FXrtfIcnn9g":{"text":"My boyfriend and I both love the cupcakes here. So for his birthday, I decided that instea","useful":4,"cool":0},"sj8wPiwMlVGv6gpx4UcFHA":{"text":"I loved the wedding cake cupcake and the raspberry with lemon cheese frosting cupcake.  Th","useful":1,"cool":0},"ciJQqd4njftjg-50RjtDTw":{"text":"Icing was ok, cake was dry.  Maybe I'm spoiled by Sprinkles but then again, I'm spoiled by","useful":3,"cool":2},"Ky_xNit0yWsWcpU9fI-CTg":{"text":"Well, I was impressed with this place, but that glimmer of hope and joy quickly faded 24 h","useful":2,"cool":2},"CXIl5rWGotuV3bKqyD4DUQ":{"text":"Have had better at home.  Icing is no better than Betty Crocker in a can.  The cake itself","useful":1,"cool":0},"NC9Q3inO7cvngWdOFdez4g":{"text":"This place is great. Situated right next to Johnny's, you can stop in after your Po boy. I","useful":1,"cool":0},"vyVUZ2NLjkgPCW0lGSqgmA":{"text":"Heading up St. Louis I stopped short when I saw a small sign in the street indicating a st","useful":3,"cool":2},"11FCkwUsPWbPofGvkCPOXg":{"text":"I love cupcakes, and these are good, not great.  Very moist, but with a bit too much icing","useful":0,"cool":0}}