{"ZCGPdWqGiJ8La6Ht8qoonA":{"text":"Stopped by for a late lunch and fortunately could order the Saturday -Sunday only brunch o","useful":0,"cool":0},"lC1fe42dmA0bYmCMOjLXhw":{"text":"I was shocked how good the food was, the environment was cool with lots of unique painting","useful":0,"cool":0},"d8mFYi2KCenKMq7ovYR7Nw":{"text":"Love the Velvet Cactus. The best hing on the menu is the Deep South taco. How can you go w","useful":3,"cool":1},"JwkTmbIZElyHh0IJwv4VmA":{"text":"Came here for happy hour for the first time with friends! Camille at the bar passed us by ","useful":1,"cool":0},"U6LHr0cIZFrRQl9Rjmjkbg":{"text":"This place is awesome! There was a bit of a wait (the place is small), there is outdoor se","useful":1,"cool":1},"B3gAWKYDRh1-oIH4tk-1gw":{"text":"I'm kicking myself in the ass for not eating here more last year.\n\nI was turned off after ","useful":7,"cool":2},"4VcKqgc0s_0tPLeR5LQfPQ":{"text":"This place is the shiznit!! Get the white queso as an appetizer and the texas quesadilla a","useful":1,"cool":0},"b6Ywk637MlnW0IFlXPqeMQ":{"text":"Number 1 place to get fantastic food, Margaritas and their special cocktails. Best place t","useful":0,"cool":0},"cSbkZPwG9x9KpovMLoP0zQ":{"text":"Was far from what i expected. If you're expecting Mexican flavour, pass. The wait staff wa","useful":1,"cool":0},"YTVHJW4tPPX9AZgGdnw6CA":{"text":"This was my second trip here in general and it didn't exceed my expectations. Ally was our","useful":0,"cool":0},"3bIYr-mDcgQkwXMjl8gJ-A":{"text":"I don't understand why this place is so popular. We went for a late lunch and it was still","useful":0,"cool":0},"oq2HYWN1ALiSY2XPdBLo1Q":{"text":"Both of the hostess and my waitress were rude for no reason. Acted annoyed that we were co","useful":1,"cool":0},"ve83qRSYwklrtOeRHgx6wA":{"text":"It sucks that this place is so beautiful and has so much potential, yet it has terrible re","useful":7,"cool":3},"hWOsMbecVwrlC4fOdXtBTQ":{"text":"One of my favorite places for good Mexican food in the city. Great atmosphere as well.","useful":1,"cool":1},"5ggLuKf6SXFnDDf4vtENBQ":{"text":"I've been missing Tex-Mex for so long and this place hits the spot. The tortilla soup was ","useful":0,"cool":0},"7MQ3ssSuICOp6BklzNXirA":{"text":"Completely unprofessional, take out was missing several order pieces and when I asked the ","useful":0,"cool":0},"AF38cp_L5Vi3Q8KYge-CKQ":{"text":"I've been going to Velvet Cactus for almost 3 years. The quality of food is consistently g","useful":2,"cool":1},"558ZP3y7MDEgwnBBxwQTHQ":{"text":"I like the outdoor area. We went on a Sunday and sat outside. I had the pineapple cilantro","useful":0,"cool":0},"Q19DihW_tBAxn7ITx8CArA":{"text":"Great food.  Loved the decor.  Lots of food per dish and the queso dip was wonderful.  It ","useful":0,"cool":0},"b69gHy3fXUgoq5Go1vmZ5g":{"text":"Its been a while since I had been here but my return visit today reminded me of the cool a","useful":0,"cool":1},"xxmvkKIzd9PYYAMoUWjP0w":{"text":"So it's been about 2 1/2 years since we last came to velvet cactus. Mainly because we drea","useful":0,"cool":0},"E_HpaeMc0T9PO8-nr-A5nw":{"text":"I knew the reviews weren't great, but decided to give this place a try. And it was packed ","useful":6,"cool":2},"xuhnYDeRgHbYk-azgdk1FA":{"text":"My family and I love the Velvet Cactus, the outdoor seating is perfect for New Orleans whe","useful":0,"cool":0},"Pg4YiPCmv_ABLjX2jQdrlg":{"text":"Our group thought the visit was great! We had various margaritas and the sangria (deliciou","useful":0,"cool":0},"qQpVdrzaKcogIIVtl6Aaug":{"text":"Don't bother eating a full meal here. After my blissful happy hour experience, I returned ","useful":7,"cool":2},"NDOTMh2i7jDt4n5AOXTJbQ":{"text":"We had to give this place a few months after opening for it to \"calm down\" and actually be","useful":1,"cool":0},"9f077-ZngaDVkzYc6UdkUw":{"text":"There was a 45 minute wait for a table, which considering we arrives at 7:30 on a Saturday","useful":1,"cool":0},"Dvso8KJgo5Ma0XB0LPePzw":{"text":"delicious food and margs! the jerk chicken skewers, cerviche, healthy heart chicken dish a","useful":0,"cool":0},"kZ_TO9tYwYT2YaeNdSyYMA":{"text":"Mexican food with a funky New Orleans twist. Food was great, service was even better, just","useful":0,"cool":0},"StT_bTjk2VGGmBvDaT6SuA":{"text":"I love this place. The funky setting, great drinks and delicious food. Awesome patio to re","useful":0,"cool":0},"bIZcqBbQLt8SpRK7ptk9ow":{"text":"Great local place to go. The Ambiance is great and the food always consistent.","useful":0,"cool":0},"UV15my37wKOKC-mK2lGgZA":{"text":"I actually enjoy myself when I go here. The Margeritas are delicious! And I love the atmos","useful":0,"cool":0},"xx-uPeTG90t6ytdfke7W1g":{"text":"Usually not a big fan of Mexican food but this place is pretty good. They're always busy a","useful":0,"cool":0},"aOF6DHdf3VBc-b-n3K1IxQ":{"text":"Don't believe the naysayers. It's a fun, exciting experience. The atmosphere rates a 5 out","useful":2,"cool":0},"K5ieaLe7-QF56We-33937g":{"text":"Cute\nLots of variety\nPatron margaritas are delicious\nAtmosphere good\n\nWe had shrimp tacos,","useful":0,"cool":0},"ftc2f2aSVScxCFCo3FWhlw":{"text":"The place is beautiful, but the food is very disappointing. First of all, we were seated, ","useful":0,"cool":0},"aLNiHKg9oipj4QG88r9JAw":{"text":"I've been to the velvet cactus multiple times since they opened a few years ago but today ","useful":2,"cool":1},"i40nPtm0zRwkfzBUYTc_wQ":{"text":"Go here for the drink specials and chips & salsa. Skip the food!!\n\nDarn, I really thought ","useful":4,"cool":1},"0DLGode8ZAoMgNSBuBel9w":{"text":"I really really want to like this place. Been here a few times - cute patio - good service","useful":3,"cool":0},"F-l1Ks7H2mdx46QjbZxYDQ":{"text":"The customer service was excellent !!! The food was great !!! We had a nice waiter and he ","useful":0,"cool":0},"4D6xBT8RRpQSKWBVe3LlKw":{"text":"Vegan tacos + strong drinks = good out of the norm place to go\n\nI was so excited to go her","useful":0,"cool":0},"BuzcskgHrx7GM-UGeSq07w":{"text":"As far as New Orleans Mexican goes, this is some of the best I've had. There aren't too ma","useful":0,"cool":0},"DppIK9duX2vwgBlTKCPO3w":{"text":"One of my all time favorites. Atmosphere is amazing. Sit outside on a nice evening and tak","useful":1,"cool":0},"SM0f0COe5iA-pHsm_aTXsA":{"text":"Super busy with their bogo Margarita Wednesday.  The drinks were fabulous.  Everything tas","useful":0,"cool":0},"y869rllnMfYqAHIim6WgEw":{"text":"I love Velvet Cactus! Their salsa is unique and smokey which I definitely now crave! This ","useful":0,"cool":0},"JnCoq26O4t1xH1cVALRftg":{"text":"Chowed down on the complimentary chips and salsa hard. Can't remember if it was that delic","useful":0,"cool":0},"fXGVf3Ja9Hp41Oleebq9NQ":{"text":"Came here with my gf and a friend.  We all ended up getting salads oddly enough.  The free","useful":0,"cool":0},"I0ZxPMMQkY_wrrKcoogb9A":{"text":"They have great atmosphere, love this place. Great service, food, and drinks. Great patio ","useful":0,"cool":0},"koruEvuUTufmdJU8j2iq2g":{"text":"Went here for the first time today.  Sat outside under an umbrella and there were fans blo","useful":2,"cool":2},"7nf0NwWWSOFFRnGs6UweAw":{"text":"Friday night date.. absolutely loved this place. The look is fresh and vibe is very relaxe","useful":0,"cool":0},"ccZm9iBxYY6im9KJB8RgHw":{"text":"my absolute FAV restaurant...been here over 20 times & the food...service..& atmosphere is","useful":0,"cool":0},"sXhih8M-P1c6hhp0Tnjsqg":{"text":"Wonderful dinning experience and our waitress (Ariana) was very accommodating.\nWe'll be ba","useful":0,"cool":0},"JMpqIUdFP67N7jE0RlEP3w":{"text":"Absolutely love this place! The atmosphere is lively and family-friendly. The service is a","useful":0,"cool":0},"oJN4CYGwaY8VzQ0TiuM3eQ":{"text":"Service was awful. They sat us outside under the trees and birds crapped on us the entire ","useful":0,"cool":0},"SIwu47yVICnAGErO-mpTTw":{"text":"I've come here a couple of times before, and to be honest, the only thing that has impress","useful":3,"cool":0},"7t0LCun-eAEwvyLSKVg2xQ":{"text":"I was curious about this place after passing through Lakeview a few weeks ago.  I'm a litt","useful":6,"cool":1},"TuFsxywB79rep_A_Wj30-A":{"text":"Great margaritas but pretty average mexican food. Fun atmosphere out on the patio on a nic","useful":0,"cool":0},"Yc1LZALc_eLbugcMyQo6Eg":{"text":"The food was good but our service was mediocre and the appetizers and entrees came out wit","useful":1,"cool":1},"miUKkRktYMJASuGaCT5T2A":{"text":"Wow! This place is delicious! We got the mixed grill and had a ton of food to take home. I","useful":0,"cool":1},"8bPabkbpqg6VOhzjrdMnsw":{"text":"Friendly bartenders. Great salsa and unusually salty but good chips. Quesadillas very good","useful":0,"cool":0},"bzefx9MFEUQnEgIuyBze6w":{"text":"Enjoyed the food here the three times I've been, BUT we've never had to wait long. Don't t","useful":1,"cool":1},"iPCuTaBea8HCy8GOXrKp7Q":{"text":"Love their margaritas, strong and just the right amount of acidity and not too sweet. Tex ","useful":0,"cool":0},"DjkRNE3ZISccPIda8xsRNQ":{"text":"Love this place! I love the outdoor patio seating and the food (and drinks!!) is great. I ","useful":1,"cool":0},"WTu1p7ZlTo9d2L5iQvVhWg":{"text":"Please check out Lauren O's review.  My quesadilla was as burnt as her chicken.  What rest","useful":0,"cool":0},"mx9c_4YuBzBw2bNOlg0Qbw":{"text":"I'm from Houston and I would say this is the Best Mexican restaurant in Nola by a landslid","useful":0,"cool":0},"yTD5L7lAMkfHnBP6RFeTxQ":{"text":"This place gets 3 stars because of its great atmosphere, and great service. If I had to ba","useful":0,"cool":0},"7DaB_MdoZnVKNf4XO9AXMA":{"text":"I always really enjoy eating here.  The drinks are great, food is great, and the atmospher","useful":0,"cool":0},"lUuKOUp-73UkVIi6reKH4w":{"text":"The food at Velvet Cactus is so good. It's almost like Mexican, redone. I haven't had a ba","useful":0,"cool":0},"D9VsSs5C_Q48qh3cVLBblA":{"text":"We decided on this place for a ladies night with good recommendations. And it was great. T","useful":1,"cool":0},"p2T0fUxy8OK70z45zekLDg":{"text":"If you want good Mexican food and some bomb margaritas for a good price this is the place ","useful":1,"cool":0},"fuEHp8gNycbwwXgbue-7vg":{"text":"This was hopefully my only experience here. The food was way overpriced, and the service, ","useful":1,"cool":1},"DjORhSh15oonyRzn6mVsvw":{"text":"It's not my favorite place to come to for food,  but it is a great place for drinks! The o","useful":1,"cool":0},"X5I_rRjKa4WaEJAJtR09Ww":{"text":"The food has gotton better since it first opened. We always go early since the place becom","useful":0,"cool":0},"x74lKZ8Vw2tb5Whk05pkdw":{"text":"I give this place 4 starts based on ambience atmosphere and service.  in all honesty taste","useful":1,"cool":0},"Bia_5SLc1eK3UaUpRfUxvA":{"text":"Great art!\n\ngreat staff, fast fast service, and great margaritas..\nwonderful ambiance and ","useful":2,"cool":0},"kaNNiE7bYhMWI8qkzrJj6g":{"text":"I love velvet cactus for a lot of reasons, but two of my top ones are BOGO margaritas and ","useful":1,"cool":0},"tdOe9e5NxrrbTE1BHFC-5g":{"text":"I loved this place!\n\nGreat outdoor seating and atmosphere. The margaritas and sangria were","useful":1,"cool":0},"OL6zE1YzohKr8Aly1Egyng":{"text":"I haven't even started my meal and i'm wildly impressed with our server Matthew! My friend","useful":0,"cool":0},"B15WOMPJXmoIg2g4DOqqyA":{"text":"Food is great! Service is great! Lucas and Chris were nice and had great customer service!","useful":0,"cool":0},"HtRxgIUYAglD0xDVpBPqwg":{"text":"Gotta give this place 5 stars. We ordered some sort of Mexican platter to share and the se","useful":1,"cool":1},"CGZqtN5hscCKGV4C_1BN7w":{"text":"NACHOS!! NACHOS!!! NACHOS!!! I mean like, a mountain of nachos.  Like so big that the heav","useful":0,"cool":0},"16yp09YIiERgciyPXR93vQ":{"text":"OMG! I thoroughly enjoyed this dining experience!!!  I happened upon this restaurant on my","useful":4,"cool":2},"sZny0JTYsRHKp4xcom29VA":{"text":"Truly excellent. From the decor to the service to the tastes to the price, a nice experien","useful":1,"cool":0},"hEEoMxD1Pdsp_LdfQgJqGA":{"text":"The Velvet Cactus is the BEST!!!   The food is sooooo good, the drinks are awesome, especi","useful":0,"cool":0},"GQ9xiK_W6_xc-S-oTyZ3GA":{"text":"I LOVE it here. The scenery, the atmosphere, the food, the drinks all around is amazing! W","useful":1,"cool":0},"0naCjiGOZIQ8GS7KbsYJoQ":{"text":"This place is so bad, I keep watching for candid camera. 75 bucks for bad nacho cheese, wo","useful":0,"cool":0},"Mn-5ytp_l4K3Vt7PyUuH9g":{"text":"I know a lot of people don't like the food here but I always get the same thing:\nDip Trio ","useful":2,"cool":1},"TH6wb9jdajLA1zFUk5ZOoA":{"text":"I was curious about this place after passing through Lakeview a few weeks ago.  I'm a litt","useful":9,"cool":2},"RDlihsFMCW_ncuIEZPklmw":{"text":"The only reason to go out of your way to get here is the atmosphere. The decor is hip, but","useful":3,"cool":4},"y8aqTJD9au6fRPA43R0Iww":{"text":"Great atmosphere.  Pretty good service.   I really like their menu choices.   Food is grea","useful":1,"cool":0},"rOGYDTbD53eZ4trB6uckMg":{"text":"We were staying at a friend's house in Lakeview over the weekend.  Wife and I ventured out","useful":3,"cool":0},"_stDdp0dq-gBMVtGPpH_0w":{"text":"We love Velvet Cactus! Their patio is awesome. Their drinks are awesome and their food is ","useful":2,"cool":1},"Ve6Mpkt2co0RHYPdATOhdg":{"text":"Cocktails/Drinks are awesome..The food is ok...we just go for the Margarita's !","useful":0,"cool":0},"SdLI15VAHB3Re2cvuTXBpQ":{"text":"The worst!!!!! The service was great but... Third time ate here waited to give opinion tho","useful":0,"cool":0},"oHhs1AefG6D8ClvNTSnmqw":{"text":"I wish the designer of the restaurant would have designed the food, because then it would ","useful":0,"cool":0},"_9fOgja-D406ZbZmwZS1aA":{"text":"Nice decor and ambience but food is mediocre at best. El Gato Negro slightly better food. ","useful":0,"cool":0},"ltMi6qj2bo3C1QzFRfsbtg":{"text":"My first food experience at Velvet Cactus was not very good. I had ordered the chicken enc","useful":4,"cool":0},"vh-0WfdAbdX4nEQJUHS8VA":{"text":"This is a neighborhood place for my friend. To not cook dinner we opted to head here. \nGre","useful":0,"cool":0},"sq-szrPhFShl4Z0mdZgzug":{"text":"Atmosphere is amazing but that is the only reason I would come here! The food is not anyth","useful":0,"cool":0},"Cb-M770pA9SljUngnrAFcg":{"text":"We love the cactus! Our server Brent was the best! He was so knowledgeable about the menu!","useful":0,"cool":0},"f1YldZXiNaMrPebIvWql5g":{"text":"Brought my brother here while he was in town. Had a pretty long wait but was not to bad, r","useful":0,"cool":0},"8XttXHV3ZOcQKLZymnAZNA":{"text":"This place was amazing.  The restaurant is an eclectic place, lots of quirky pop culture f","useful":0,"cool":0},"t3iGsifTfeNB46iL0nM86A":{"text":"Rarely do I go out of my way to give a bad review but I had been told by many friends to c","useful":2,"cool":0},"gs8F5NLH3HdxtT0v9fdjmA":{"text":"I'll be honest. This isn't the best Mexican I've had. But when I've gone to other Mexican ","useful":1,"cool":0},"RjxG4e_svQBdv_Uyz6cAXw":{"text":"It's a really average Mexican restaurant . The only good thing is its location and they ha","useful":1,"cool":0},"c4p3emxnQKNSmbjL0JfCpw":{"text":"I went for a light lunch. I shared the tortilla soup which was amazing and had the Tampico","useful":0,"cool":0},"bSv4yjzB90U3R1zrhI546w":{"text":"Good food and drinks in a nice atmosphere. Outdoor seating was nice, as the weather was a ","useful":0,"cool":0},"mefGvSOb7IiffaNQUvXHNw":{"text":"I've been missing Tex-Mex for so long and this place hits the spot. The tortilla soup was ","useful":1,"cool":0},"UcCRSweLEgwHjJW0YeLuEw":{"text":"I hate to have to write an update because as you can see from my first review...I was all ","useful":5,"cool":2},"UqIoHcbBUvMd5l2otbw8IQ":{"text":"The queso, chips and margaritas were really good! We really enjoyed that part of the meal ","useful":0,"cool":0},"gGW8yxQLZIOnNWBW2pNMRg":{"text":"Best compliment would be atmosphere. Food is so so as well as service. Good place to watch","useful":1,"cool":0},"YiUI_gC2348zWMUKTzY0Dg":{"text":"Love this place! \n\nThey seem so well-staffed that I've never had ANY issue with service. I","useful":0,"cool":0},"qNxzhHvVIDgpijXC6sF6xA":{"text":"Bring your rubber gloves so you can flip through the menu.  Not sure when or if they ever ","useful":0,"cool":0},"hURgo73_jIH2W7v_5G79sQ":{"text":"Let me preface this review with this statement. I am not a Mexican food connoisseur. I don","useful":2,"cool":1},"EkscS0ExUV4J1JQsbjaGTw":{"text":"Great experience here last night! Great food, great atmosphere, excellent service! The gua","useful":0,"cool":0},"onYp4yryVsRfewSkA5Ac8w":{"text":"Went there last night.  Wont go again.  It's over priced tex-mex.  You can get the same th","useful":7,"cool":1},"qy7BvsxSSUsWFRqC-e-r9w":{"text":"Second visit to the cactus and must say it was a much better experience. \n\nBeers were cold","useful":0,"cool":0},"hXmZJbhLtdetBCL9viOSbQ":{"text":"The food here is really bad...like really bad. I've had a better meal at Taco Bell. The co","useful":2,"cool":1},"ycuAt9-sOwyLdEBpfhYQAA":{"text":"Food was very modern Mexican. Very good. Service a little slow. Chips and Salsa the best. ","useful":1,"cool":1},"QTkhkINbqf5Dl78QOjexrw":{"text":"All I can say is that the margaritas are good food is very average Mexican food. When i go","useful":1,"cool":0},"jmQ2ji6QB8VNAkMU136Z7Q":{"text":"Paying $4 for a side of beans & rice with my 2 $4 steak tacos? No thanks. The atmosphere i","useful":2,"cool":1},"XYA7fNuer2GBzt_-RMkV0w":{"text":"Great place! Awesome drinks and they even had an EatFit menu with several options for less","useful":1,"cool":1},"lwMNkx7T11g83C-0bf4Fqw":{"text":"The food is mediocre-good but the atmosphere makes up for it. It's a great place for a dat","useful":1,"cool":0},"fcS31ytp7b5Z9Wwyc23Ufg":{"text":"Always heard about how this place has given people food poisoning but I gave them the bene","useful":0,"cool":0},"kbg_0k_5_UO5lfZV__G9Aw":{"text":"Unbelievable!!! I live in Lakeview & love to patronize my local establishments. So it's \"t","useful":3,"cool":0},"l4D_8gq1egTS_5SkPF8VPA":{"text":"Cost doesn't equal value.  Great location but snotty hostess and snotty patrons.  I didn't","useful":0,"cool":0},"Ljvl2m9ykHS_gJ0Pi6hp6Q":{"text":"I love this place! We always take the family here and the service has always been great an","useful":0,"cool":0},"bAS0Tuistw3vqXQjLkv2Fw":{"text":"Went with my husband and met his brother, sister-in-law, and her parents for dinner last n","useful":0,"cool":0},"IZXLFT11E_ksItvR0FSZzg":{"text":"Great atmosphere for a date night. Love the fish tacos and jerk chicken. On a busy weekend","useful":0,"cool":0},"ENnqAYYpxmjH9AMMqchOhQ":{"text":"This is actually my first visit. This restaurant has been on my bucket list for awhile and","useful":2,"cool":1},"IIEKv-cyyFVGeo-GWWeKiw":{"text":"We met here for a friends birthday.  She wanted margaritas and we wanted dinner so we figu","useful":1,"cool":0},"udtQ_pMSowjULJ54gKFJBw":{"text":"Saw a worker scratch his butt.  Ole!","useful":1,"cool":2},"BrxGkHo66DhZUEHxsE1mlA":{"text":"I've only ate here once when it first opened but the food and service was excellent. I alw","useful":0,"cool":0},"Njyykmeku_WtbeIAIj2Cww":{"text":"We had some great appetizers Mexican style egg rolls, jerk chicken on skewers and their wo","useful":0,"cool":0},"sXYzT4TdkzRxESIT_Lu6dw":{"text":"I love this place!!!! Awesome  drinks. Goat loves the watermelon Majarita - cool for the s","useful":1,"cool":1},"nvixAlCCqYQzRz6IJb-dag":{"text":"I came here for the first time, for my birthday, and I was surprised on how good it was.  ","useful":3,"cool":2},"5RSSs0tdyFOcD1dxAZpr6w":{"text":"Why is this place like so much by many? Every time I eat there I'm sick through out the ni","useful":3,"cool":0},"cLpfBDBFxYy1so1F8vjdCA":{"text":"This place is simply amazing! Beautiful atmosphere with great food! They had  a gluten fre","useful":0,"cool":0},"PKF1UHx1wW_S-goUCvL-aw":{"text":"I've tried this place several times.   The ambiance is great.  I love the building and the","useful":0,"cool":0},"PIYipM38XVmZivzcQ154EA":{"text":"The atmosphere is fabulous. Lots of tables and space for everyone. If you sit outside, the","useful":2,"cool":1},"fmq8lQHslQrVuQ-z-WZy2A":{"text":"Best atmosphere!! love the margaritas and the staff  \nAwesome place!!","useful":0,"cool":0},"Z_APAgL0tpXRIaNuFUcGxw":{"text":"This is a average place at best, the best thing going for is the patio area. I've been mul","useful":0,"cool":0},"x3h-FtFoY7w0pXqoy1Fsug":{"text":"Great Tex Mex if that's what you're looking for. Fast, friendly service, great drinks, goo","useful":3,"cool":2},"NH59mlFyZEqcLis-T9oERg":{"text":"My biggest disappointment with this place is that I hadn't been here before! Seriously. I ","useful":0,"cool":0},"bDNFxQ_y8Ip319xNAgtYdw":{"text":"Nice atmosphere for a fun, casual evening.  Pretty generic food, not bad, just expected.  ","useful":0,"cool":0},"G7JeTjekPd7bU-DGrwsxFA":{"text":"A great place with friends , excellent bar, super food and service . On a cold might they ","useful":0,"cool":0},"-SCM7sDLnTRBrqCtBSS89w":{"text":"I think my anticipation to eat here made the let down worse. I was hoping for a laid back ","useful":0,"cool":0},"wQJeitkmYdrdUZtYKFUubw":{"text":"Good Happy hour specials, nice patio and ambience, but the food is very sub par.  The guac","useful":1,"cool":0},"X06fzl8klpsnWyfv5chrZw":{"text":"The front patio has a lot of character. Every inch of the walls have unique and tacky deco","useful":0,"cool":0},"cZeJFZQSOzu3f5Uz-d4oxQ":{"text":"I was looking forward to try some good Mexican food with interesting dishes and menu. Hone","useful":1,"cool":0},"0-Et7mnyGn_NdC3JTGcq2w":{"text":"Truly shocked to see this restaurant is rated below 4 stars. Velvet Cactus is my absolute ","useful":0,"cool":0},"f9DikOx_OttAE827FkKv-w":{"text":"sooooo yummy!  and we went during really nice weather so the garden patio seating was perf","useful":0,"cool":0},"aKypcSPpl7FmguGbpjeSuQ":{"text":"Ok food. Terrible customer service. Waitress made a scene when she refused my so-called \"b","useful":0,"cool":0},"GssEp2P9sWr25Nt8Htifvg":{"text":"Honestly, this place was better than I expected. It has a nice patio and the service was v","useful":0,"cool":0},"jo7zSTxF8xce1AJiIEs3hw":{"text":"We called this restaurant to see if they were dog friendly on the patio and were told yes.","useful":3,"cool":0},"cL_MKI33mHBHO1raTCGkRA":{"text":"I really enjoyed my time here! I went on a cold, rainy Friday night, so the patio was clos","useful":0,"cool":1},"ujAOTqo8lymGS74VegzKXA":{"text":"Good Tex-Mex and well-priced, too. The portions are huge! Margaritas were tasty, a good pr","useful":0,"cool":0},"G4TNfswEc09ODK5ah8vmug":{"text":"This was absolutely my favorite place in Lakeview/ New Orleans. They have a good happy hou","useful":1,"cool":0},"dlpiuSR9Ce3fk--qp47J0w":{"text":"The velvet cactus is sort of like a funnel, it starts out very big.  We waited to be seate","useful":2,"cool":0},"s4AqtQATCzUiYH4yGGO3WA":{"text":"I've been here enough times to know what to expect, and my experience Wednesday night met ","useful":0,"cool":0},"ZOGy4GTcAKJgKJJnThcKKQ":{"text":"This is the perfect time of year to come to Velvet Cactus. Good service. Really good Rita'","useful":0,"cool":0},"_2Ehk9DMKETUdJazaedueg":{"text":"I LOVE Velvet Cactus...when my husband and I lived in Mid-City, we came once a week! I'm o","useful":1,"cool":0},"vXD9wj3dmg27H4T7UfgbHg":{"text":"I have been to Velvet Cactus twice now. They do some things really well and some things ju","useful":2,"cool":1},"dHfUKiR7m8FS86PQXM6R6g":{"text":"If you come here on a Friday night, get here VERY early, or expect to wait FOREVER. This i","useful":1,"cool":0},"N26sbtzOIKlgEpodHuEGJg":{"text":"This place is awful. The food and drinks are expensive and gross. Don't waste your time- i","useful":0,"cool":0},"77ZxqQkIXUkHotl9Dg2H4g":{"text":"This is a 'happy place' for our gang, as in riding Splash Mountain at Disney and hearing t","useful":0,"cool":0},"zNqciVFQOpjuJn8kxI7vSA":{"text":"I am incredibly sick, so I thought, \"What better than some hot chicken tortilla soup?\" I d","useful":0,"cool":0},"7p8r0rHHK37XRBWIrCWgBQ":{"text":"Another bad experience.  Management is the worst!  They should do what ever it takes to re","useful":0,"cool":0},"Dkt8qxlq7G296l5wdHnsXw":{"text":"Well, this place is pretty great. I love the doors when you walk in. Mosaic sugar skull on","useful":1,"cool":0},"ib5Pd9-xjqvVYM9j3bJiJg":{"text":"I loved my hard \"gringo\", I usually like soft, but this was the best hard (taco) I've ever","useful":0,"cool":0},"ISPYNAeKVMPR-tYYwDcetQ":{"text":"The drinks, the meal, and the service were all amazing. Love the atmosphere and decor both","useful":1,"cool":1},"DQBOL2dpNwTmbkzJt0GHqw":{"text":"Busy place on a Saturday afternoon. Great margaritas!  The tacos are great. Highly recomme","useful":0,"cool":0},"Eexz7J_AZ7rpcP6qx7Wgvw":{"text":"I'd love to update this terrible previous review. I still stand by the fact that the previ","useful":15,"cool":13},"xw0B2iVLg9XKU1KLte9XBA":{"text":"As a transplant from the Lonestar State, I been craving a Tex Mex meal after 6 months away","useful":0,"cool":0},"rk4XL73DeGRPrdzf0zVhvA":{"text":"Went here Thursday evening to have dinner and drinks. Great atmosphere,  service, food.","useful":1,"cool":0},"h_RPPAnXRm3gmXXaQBRixQ":{"text":"Great food !!! Great atmosphere!!!Love this place.\nThe fish tacos are delicious.Got a side","useful":0,"cool":0},"oKIdSq93ddH2eRDZpDzpnA":{"text":"My reviews are usually really long,  this one is going to be simple.\n\nDrinks, chips & sals","useful":7,"cool":2},"IjSnorGC3oqJ7fFvXOL6Fw":{"text":"Overpriced drinks, horrible service. The final straw was trying to place a to go order ove","useful":1,"cool":0},"rG5Qn92HCOYIFATwZ1he-g":{"text":"Went here last night thinking it would be a lot of exotic and well-rounded latin american ","useful":1,"cool":1},"hUIjYGPcW_j2WjQ36mJ1lQ":{"text":"Had a wonderful birthday dinner for my brother here. We loved our apps and entrees.  The d","useful":0,"cool":0},"VHZOuIAIfLt0s0U76HuTnw":{"text":"Full disclosure: I am a Mexican food snob (having learned to eat and appreciate Mexican fo","useful":6,"cool":6},"0ScKiBVj1gpY5jceGnuR8g":{"text":"Okay. Not the best Mexican food I've ever had. Not the absolute worst. What is lacking on ","useful":1,"cool":0},"-hJZV80KSauokodc2jkBYg":{"text":"Yummy! We loved everything we ordered. So fresh, especially the watermelon salsa and uniqu","useful":0,"cool":0},"aHAPAVCSzxNMch2yRphTqg":{"text":"I can't believe there's only one review for this place as of today.  Every time I go, it's","useful":1,"cool":0},"_cpllmARJ--KAlmkHBvxsw":{"text":"It was a nice place but food not that great.  Chips and salsa were AWESOME! Very limited m","useful":2,"cool":1},"FxmdiwTkAjmoUxtQjwqTcA":{"text":"$$ and not worth what it was.  We had 3 ice tea and the family platter it said for between","useful":1,"cool":0},"8k0nP3p-MV6jUnQMYQgFcA":{"text":"This place is absolutely AMAZING! Great drinks, food, service, and even music! This place ","useful":0,"cool":0},"ZAyhYwMqNSYppW976aHnEw":{"text":"Love, love, love the drinks here...and I have worked my way down their drink menu since th","useful":0,"cool":0},"vIcOTw0m5pR7aW7i6oeIVg":{"text":"Went to The Velvet Cactus last night for a fund raiser for St. Francis Animal Shelter. \n\nM","useful":3,"cool":0},"SYC_39_g5VopDqES7UvNgA":{"text":"Running an errand during my lunch break, I stumbled upon the Velvet Cactus & decided to ha","useful":1,"cool":1},"Q17aNt4SikAkr9TmCL5A1w":{"text":"Tuesday night the place is almost to capacity at 6...we get lucky enough to get one of the","useful":0,"cool":0},"A1KmrKoy0K9Sk9R37LAn_g":{"text":"Very disappointed with taste of food ceviche, and fajitas were not so good to my liking , ","useful":0,"cool":0},"JLcU2uino0KR0HPFpjP8AA":{"text":"Love the margaritas! Love the atmosphere. Love the outside seating. Love the food. And bes","useful":0,"cool":0},"fT8k-RR4DpP4pXODiKsCEQ":{"text":"We went w/some friends...everything was delicious! I had a watermelon margarita and a clas","useful":0,"cool":0},"L9rj-a_zN0yvhQxstFO0zg":{"text":"The Velvet Cactus exceeded all of our expectations! The food was absolutely amazing. And t","useful":0,"cool":0},"G29IQpaD4JtJwscD9dj-3w":{"text":"A brief review of another okay Mexican/Tex Mex restaurant in New Orleans:\n\nTo preface, the","useful":0,"cool":0},"NjMkr2QEmvQhT5OQdmkM3w":{"text":"We are from AZ and were traveling recently , we loved the food and the different cocktails","useful":0,"cool":0},"GtR1oqypknOKhcRkqO4f_g":{"text":"The outdoor seating area is amazing, and the food is pretty good.  I have gotten the chick","useful":0,"cool":0},"tSH-qepLJBL3jS-Ud3s8dQ":{"text":"This place has an amazing patio, great margaritas and tasty chips and salsa. Unfortunately","useful":1,"cool":0},"8DvJ6001vwwFPWHUpvTkTQ":{"text":"Two stars for the professional staff. That's where my review ends.  The Nachos Sencillo we","useful":0,"cool":0},"IvJOzEgR8shgtTs9ixrVtA":{"text":"Alright Velvet Cactus, longtime fan, first time reviewer.  This place is great, I like it ","useful":0,"cool":0},"DG451UbmwDq9ZZUEQVrFFg":{"text":"First time trying it, (not like I'm going to reserved judgement because A. It's a REVIEW s","useful":1,"cool":0},"fgzA-VtPX_8yRLnoquQMdQ":{"text":"This place sucks!!!  Drinks are expensive and premade if you order a margarita.  There is ","useful":2,"cool":0},"J6E2vuU097QP6wo4RO-qZg":{"text":"Went there today. Got the Louisiana Boil Quesadilla $12, big disappointment. The wife got ","useful":3,"cool":1},"7tzmOWtshcvU_FwfkJhEtA":{"text":"I've been looking for a spicy drink and I finally found a habenero margarita at The Velvet","useful":0,"cool":0},"aeWoAQF-mxYOdFhMkCBgEA":{"text":"Only reason I can't give this place 5 stars is because of the lack of parking, and the fac","useful":1,"cool":0},"KBewo5ntxDjMEVphsKKlxg":{"text":"I am glad I didn't listen to reviews and decided to try this place.  I thought it was real","useful":4,"cool":1},"tEaZjo1rZRwNVH0duZ8Zog":{"text":"The service was horrible. My coworkers and myself decided to visit on a Friday afternoon f","useful":0,"cool":0},"gkBm05HY-IQvzJLyvb0Ynw":{"text":"I don't know if we just came on an off night or what but the food was horrible. I ordered ","useful":1,"cool":1},"vzMPONk6cHlevCADNUxTKg":{"text":"I went here with my roommates for one of the girl's birthday. I didn't absolutely love it ","useful":0,"cool":0},"9YBY3LOMTqMXye0C_FbVPQ":{"text":"Awesome place! Best tex mex food in New Orleans. All the tacos are great. The free chips a","useful":0,"cool":0},"-HOU-XSs_IFLGRRztiGoPw":{"text":"Absolutely LOVE the atmosphere!!! Great place to go with a big group. We sat outside. It w","useful":3,"cool":0},"i4cc3cZ_HQRYxSSFWA5rIQ":{"text":"Favorite place in town. Really good burritos and drinks are fantastic. Love the lights and","useful":0,"cool":0},"cg2lHzmrq32bCQQy0mBXFw":{"text":"YUM!    Great recc for Nicki.   They have a \"SlimRita\"  100 cal so good.   The Mexican is ","useful":0,"cool":0},"khv_UPQA_b2gXYSiRgv85A":{"text":"We love this place! It's always packed so don't be surprised if there is a wait. The nacho","useful":0,"cool":0},"X_o_meDnS1G8RS-tNyohLA":{"text":"Great margarita. Terrible Moscow mule. Idk why I would order a Moscow mules from a Mexican","useful":0,"cool":0},"X4DZiWcK8y5w5M0TOzFLDw":{"text":"Although the atmosphere at the restaurant is descent, the food is mediocre at best. I deci","useful":0,"cool":0},"Yh2Ol7xaczSfoz0ej45Ifg":{"text":"Bar service lacks, seems as though bartender is uninterested in serving guest , did not fe","useful":0,"cool":0},"Mztz8xeSaiEAxi4v85Fj_g":{"text":"i got the chicken tortilla soup and it was pretty swell until i got towards the end then i","useful":0,"cool":0},"IwtZ07MbrIKwsFmWxb2iiw":{"text":"The Velvet Cactus.... Where to begin? I have nothing but love for the VC!!\n\nPros:\n- Large ","useful":9,"cool":6},"S4Q6Xb2CJLgkYoHNiHoV4g":{"text":"Love this place, this is my favorite Mexican Restaurant much better than Casa Garcia. The ","useful":2,"cool":0},"P0534wPHd5-IMS_q1vgXjw":{"text":"The artsy atmosphere was great! We tried the steak tacos with grits and beans. It was good","useful":0,"cool":0},"eVwoZ0x4_THOLAKAT55eEQ":{"text":"Meh. Maybe I shouldn't judge too harshly but living 10 years in San Diego I guess I have b","useful":1,"cool":0},"ZftNVoQsZV5iYnbqDU-4ow":{"text":"Took a trip outside my comfort zone & decided to try the Velvet Cactus in Lakeview that I ","useful":1,"cool":0},"xjdy0_-cLbLpTbM0IgzXYg":{"text":"Well, the Velvet Cactus is ok. I like the nachos more than anything else. My husband likes","useful":0,"cool":0},"bwbGrA0NsBa1InzR593u8g":{"text":"Delicious Tex-mex in New Orleans! My absolute favorite thing on the menu is the tex mex eg","useful":0,"cool":0},"vcLnRbv1jZfqjiBfZCqzsA":{"text":"I dig this place. The food is an 8.3 out of 10, but the atmosphere and location are def a ","useful":0,"cool":0},"BD6Top5qRsEb5Ms4kR-Xow":{"text":"Seriously, went here on a whim and fell in love. Our server was such a doll and very helpf","useful":1,"cool":3},"oaLG3FXyd2NcgErXAINA3w":{"text":"I met a friend here for Margaritas and totally enjoyed the place. The drinks were tasty, t","useful":1,"cool":1},"nBKakPEnvKtxy82KfoPE5g":{"text":"Ended up here after the CC10K. Yum yum! The Coconut Mango Habanero Margarita was the bomb!","useful":1,"cool":1},"K-HR0D824i2_nA8PdNQaiQ":{"text":"I'd heard a lot of mixed reviews about the Velvet Cactus so I was somewhat hesitant to try","useful":1,"cool":1},"GvQZuKU1iB9373M9HM2-dg":{"text":"We just got back from The Velvet Cactus and like other yelpers, I'm not sure what all the ","useful":0,"cool":0},"FeBvXQXL7XjU2daQNz6U8A":{"text":"The atmosphere here is amazing, and the food is very good. This place probably has the bes","useful":3,"cool":2},"I28bzKBcDfYPexFhy1rRfw":{"text":"I have been to this restaurant a few times, and the food is pretty good. The service on th","useful":10,"cool":2},"1VpZ5-qeMEBtvWzOehkdDQ":{"text":"Nice atmosphere, good service, not so good food, fair margaritas.\nAfter seeing this place,","useful":3,"cool":0},"Jgy42NY0gn5FalDXqLK6yA":{"text":"Great food and drinks! It was my first time having shrimp enchiladas they were super good,","useful":1,"cool":0},"0grMe1FvHt2d4YISb8cH-w":{"text":"First time here. Didn't eat, just ordered margaritas, which were pretty good and bar staff","useful":0,"cool":0},"E5jrZpFllxQZG8lGaXA9gA":{"text":"Ok, this is a follow-up on my original review (eeeeuuuwwww!  gross!).  I can't believe it ","useful":2,"cool":4},"jQf1craw-JJR5bSflOnFQQ":{"text":"The outside patio is the only reason for more than one star. Other than that, the food is ","useful":2,"cool":1},"Sw3vLF9Ldwk9w3qpw8CSKg":{"text":"Las fajitas no saben a nada ! Solo tienes dos pedacitos de carne sin sabor y 4 camarones p","useful":0,"cool":0},"b4S6KMbuE9CM5P6TACEd7A":{"text":"The restaurant it's self was a very cool atmosphere- lights everywhere! Drinks were very g","useful":0,"cool":0},"PsrUHUQbNKRXOtgMqLySVg":{"text":"As someone born and raised in Texas, this is NOT Mexican food...but that doesn't mean it's","useful":1,"cool":0},"F2aZdN7_lLOB-3WFZh1p9A":{"text":"I have been to The Velvet Cactus about 4 times. The first time was for Cinco de Mayo about","useful":0,"cool":0},"5Ykr16MMmqoLy6IC4-e4AA":{"text":"Came here to eat with my friends after a business trip to Conviction last October. The atm","useful":1,"cool":1},"vE1ybVX899wZUNOgg-IWXA":{"text":"Well, there was a 30 min wait so we decided to stay, we figured it was crowded for a reaso","useful":0,"cool":0},"-bwB_YbmWAwXZA0c3vJ3jQ":{"text":"After trying the house Margarita and speaking to the manager about its orange hue and flav","useful":0,"cool":0},"Sp5nU36NFViGiVJbd6QxOA":{"text":"First time here. Great atmosphere, service and food. Will definitely be coming back. Cauti","useful":0,"cool":0},"IIDDSgbNj_KxijC3cdCnlA":{"text":"NEW REVIEW: Okay I just went there recently and I am changing my review from a 3 star to 4","useful":2,"cool":0},"CDbqs-W2Yf06iBRu2Sv_6g":{"text":"I picked up a to go order last night. I had a beer while I waited. They were FAST! Only ha","useful":0,"cool":0},"mtlBPwxLzaVAjM1LFtK4KA":{"text":"I was beyond excited to have a new cool restaurant in my neighborhood and was convinced I ","useful":2,"cool":0},"mPgO9ajHocPbelJJ1tPJvg":{"text":"A waste. Velvet Cactus can't make a Paloma- as in, the bartender told me there is no grape","useful":0,"cool":0},"9vUOnibIT3ogHjL8Cz9Q4g":{"text":"The first time I came here for dinner, it was not very good. The food is pricey for Mexica","useful":2,"cool":0},"sZQ1hHDzIdsv2bL3lHhKJw":{"text":"Ok just as a disclaimer I'm not the biggest fan of Tex-Mex as I got really burned out on i","useful":3,"cool":0},"BYKVnNjlDgL1S52uHNlZPQ":{"text":"Late lunch at the Cactus was a slightly strange experience for me.  Nothing was bad, or wr","useful":4,"cool":1},"ZrzmmGJalWzTs0RJwTkpOA":{"text":"The Velvet Cactus has a simply beautiful exterior and interior. I ordered the Two Beef Enc","useful":0,"cool":0},"c4TBf2pXdeDMBPthiVyceg":{"text":"Chose the ceviche option for dinner and a blood orange margarita. The margarita was incred","useful":0,"cool":0},"5sPa816TfNw5LVCf21O0eQ":{"text":"The go to hot spot by my house.  Had the best brunch yesterday... mojo pulled pork!  Out o","useful":0,"cool":0},"O7oaRK0Dk_p3JVSGzaE7tw":{"text":"Pros: Nice atmosphere and yummy drinks\nCons: If you're going just for the food, don't. I'v","useful":3,"cool":1},"NFBfmDjOzRuzyl46VTFhbA":{"text":"Food gets 2 stars ; Ambiance gets 3 1/2 stars.  She enjoyed the Redfish, moist and flavorf","useful":1,"cool":0},"QsYk_mX-ps5DcR4XCJK5TQ":{"text":"I truly wanted to like this place, seeing as there is such a shortage of good Mexican rest","useful":4,"cool":0},"L1AD5Uf_0kOuZzg-vpGGCw":{"text":"Having lived in Texas for 11 years, I consider myself something of a connoisseur of Mexica","useful":0,"cool":0},"JPex_YrbmWn_47Kz3m4Lgw":{"text":"First of all, Love the patio. Inside is just as eclectic. Strawberry jalepeno marg is my f","useful":0,"cool":0},"D8PrPKGwONN6eynHcvJ6-g":{"text":"My one knock on this place is that I wish they were open for lunch during the week and the","useful":0,"cool":0},"9DyKJ9lRJ6ODOUv0ELXyMA":{"text":"Ok just as a disclaimer I'm not the biggest fan of Tex-Mex as I got really burned out on i","useful":1,"cool":1},"biNOp9RsDIeDyUh7FU_TZw":{"text":"The food I got here I can only rate 3 stars . The people I went with likes theirs better. ","useful":0,"cool":0},"_fjhexwqlJC6hPNjwbsGyA":{"text":"Came here on the Cinco (de mayo). Was expecting it to be busy and get bad service as a res","useful":0,"cool":0},"CUZtJnBOYfh8GMPkcAFZGA":{"text":"We went on a Saturday night so it was crowded and there was a wait; however, there were wa","useful":0,"cool":0},"N5-HggciahCJRoDqwcccxw":{"text":"Diego - fish taco, watermelon fresco, & veggie skewer - awesome. Service is always good. G","useful":0,"cool":0},"S9AV7fcPjV50ONmN3xTNrg":{"text":"Cool atmosphere and good food. I got a really good watermelon margarita! I would go back.","useful":0,"cool":0},"ZgO9RTZVvcwDfYbrZHHlrw":{"text":"Only reason to come here is for happy hour. \n\nI've eaten here quite a few times and have n","useful":0,"cool":0},"f-93lY32yrUL0pqopBesOQ":{"text":"Vegan beware. I ordered the vegetarian tacos. Fine print said hold the cheese to make them","useful":1,"cool":0},"CPiQlaiR3MQ-k4ZLOgnjRQ":{"text":"The only reason for 3 stars is because we had excellent service. The food was just ok. Not","useful":0,"cool":0},"2hexg5ajmNPze15EsnCAwg":{"text":"Sarah is literally the sweetest/best ever. So nice and accommodating and patient. 10/10 wi","useful":0,"cool":0},"gK2RLKsqMwdTUsuZOc70YA":{"text":"Giving them a 2 Star as a combined review\n\n4 stars for their dine in and 0 stars for take ","useful":0,"cool":1},"3JWVkIuPGEgTdSmxN_4g1g":{"text":"So my husband and I finally got to go to the Velvet Cactus...the first time we tried the w","useful":1,"cool":1},"d-iq2zUoflEh1oAu7KOtUA":{"text":"Eaten here twice since they opened and have not been disappointed.  Can't beat the atmosph","useful":0,"cool":0},"c9wolzSsxoMxfsdmwkfo6g":{"text":"I live in Lakeview and have always looked forward to the new restaurants that come into th","useful":5,"cool":1},"Ar7uG4Dcu-F8_rdWuOiTKg":{"text":"I came here with my fiancée and her family the other night, and we had a pretty good time.","useful":3,"cool":2},"4tXoEtfZMwPbSaaftaSWmw":{"text":"I had a great experience at The Velvet Cactus!  I'm not sure where all these negative revi","useful":0,"cool":0},"DuepLxpnpkq3eP1vi6zUHw":{"text":"Went here last week with my family and really enjoyed it! We're trying to try new places a","useful":4,"cool":0},"0d0X7WtU4P8Fd6KnINEQjw":{"text":"Okay, so this is my second review of the Velvet Cactus. Tonight my wife and arrived around","useful":3,"cool":0},"ZPOE6MVym9hmm_llYy4j1w":{"text":"Great atmosphere! Have been multiple times to eat and hung out at the bar after.  Apps are","useful":4,"cool":0},"Jr13xVBSK7jqgO2AhdYULA":{"text":"Decent food. Cool atmosphere. The tacos here are pretty good. However everything is overpr","useful":1,"cool":1},"V5j0di-PRPPXr4COFpqNdA":{"text":"Food was cold, service was awful. Pretty sure our waiter was raptured because he disappear","useful":1,"cool":0},"y0A_6_YAsvOBBLfZGPiFCw":{"text":"Service and atmosphere pretty good. Food...meh. Definitely comparable to chili's in qualit","useful":1,"cool":0},"uAkpfhl7sSZOYrr_e_HnIA":{"text":"Always my go to place when I am looking for Mexican! I've tried just about everything and ","useful":0,"cool":0},"FDOPwPRtaPKMif2j3YABag":{"text":"My SO and I came here after volunteering for the Rock N Roll marathon.  We waited about 5 ","useful":1,"cool":0},"s2_aiV_75lFZ-ckejzGc3g":{"text":"I have heard some friends try the Velvet Cactus.  I was looking for some fantastic Mexican","useful":2,"cool":1},"11QG6AHVSY9skPrZXRK6jA":{"text":"We went out to Lakeview on \"Lundi Gras\" because we were trying to avoid anything in NOLA's","useful":0,"cool":0},"uf5iaYfIM2y34AbsgYK0Aw":{"text":"This place is great to go with a group day or night.  Casual, fun atmosphere with good foo","useful":0,"cool":0},"MCdIUtRiVjRbuMA1yx7WMQ":{"text":"Inexpensive happy hour drinks!  The grand margarita is delicious!  It's only $7!  Great se","useful":0,"cool":0},"jY80USxITXHeEHgMuAC9cQ":{"text":"I've been several times since they opened and it gets better every time. They've obviously","useful":1,"cool":0},"F7-2ewLU0RcAWl6R4XYKqA":{"text":"First visit today. Really had a great time. Very casual and fun atmosphere. Indoor/outdoor","useful":3,"cool":2},"5e_x073U-xu9svkrc4Jacw":{"text":"I'll make this review short and sweet..  Velvet Cactus is a cool place with a bit of an ec","useful":2,"cool":1},"NMmjWaihXLxwxUVTeVwLEQ":{"text":"Really good Mexican food and great paintings to look at.\n\nThis was a great find the food w","useful":2,"cool":1},"TES_hAb1fLBU97j8YfdzCA":{"text":"Attempted to give this place another chance after  my first experience, however the custom","useful":1,"cool":0},"9nQbFEdRUaxML2P4EZNIVg":{"text":"I had a great experience at the velvet cactus! The atmosphere is fabulous inside and out. ","useful":1,"cool":0},"64CfVC5huTcfJQO2GuJhkw":{"text":"Great addition to the wonderful restaurants in Lakeview!  Fantastic atmosphere, super cold","useful":1,"cool":0},"_sfvV6gwIPF6YxZ2sP21gQ":{"text":"Great food. Great ambiance. Strong margaritas. A+\nChimichanga with brisket and horseradish","useful":0,"cool":0},"j4mSZsEYN5sk5UYKajARVA":{"text":"This place is classic Lakeview cute- spacious, sparkly clean, and straight up the best atm","useful":1,"cool":1},"f44-cyP80dBkFabfbnZsJQ":{"text":"Food and service are always impeccable. Hardly any wait on a busy Friday night. Amazing!","useful":0,"cool":0},"df_8HA1iRVszfwaBuqyb1g":{"text":"Great atmosphere! A great place to hang out with friends. Food was great and margaritas ro","useful":0,"cool":0},"kTb1v2iLEFUn3-FpyhphoQ":{"text":"Went there today to check out the new brunch menu and I am so full and happy.   I had the ","useful":0,"cool":0},"wBOFES-dFK9-E6GDrZE4UQ":{"text":"I sent back a burnt quesadilla and a side of burnt plantains. The food runner returned wit","useful":0,"cool":0},"jqAVrNcVnrefBNmGAax0Zw":{"text":"Wow, if you enjoy chic upscale Mexican food.  Everything from the highend tequilla choices","useful":2,"cool":0},"0HnTYAh_ckr3mbkiGtYfsw":{"text":"Great atmosphere Food and Margaritas were excellent\nService was excellent also. We went be","useful":0,"cool":0},"Y-jsmvXuJfwkT8mtwNCMNQ":{"text":"I recently attended happy hour with about 40 of my coworkers and we all had a great time. ","useful":2,"cool":2},"scOjtuPg05Tp8ydw9JNX9Q":{"text":"I love this place , the food was amazing! the service was amazing , Everything was great! ","useful":2,"cool":2},"lVn5dMsX8477kVB3cf6dXw":{"text":"Had a WONDERFUL experience! Our server Brent was helpful, efficient, and HANDSOME. Brent w","useful":0,"cool":0},"H6I-q1-WREJ4WiiBjYywFA":{"text":"One of my fav spots for Mexican. \n\nWe stopped in for a quick bite over the weekend and I w","useful":4,"cool":2},"-zerdN4nDiIn-H2fFlp7Ww":{"text":"This place is great! Perfect for dinner and drinks with friends. It's big but it gets busy","useful":1,"cool":0},"EAUfyK_f1glsbN9n4jB1Fw":{"text":"Me and my wife's favorite place to unwind and eat. The margaritas are the best in the area","useful":0,"cool":0},"-ITeoZFf6nVBS-gjJGG_Ew":{"text":"I only give it high rating because the food was good and the service was outstanding.\nThe ","useful":2,"cool":2},"ca5T5fhu_Poi9l4NM7CU-g":{"text":"I'm definitely a fan. I'm going to start off with the chips and salsa, awesome. Guacamole,","useful":0,"cool":0},"IStb9kGLlI0MNJktAbsABw":{"text":"The DEcor is Great I would rather come here to drink than to ear, don't really get the pop","useful":0,"cool":0},"YaAIG0GGglcfV9obArlQ_Q":{"text":"I eat here all the time! I love the seasonal drinks, fried plantains, street corn, and the","useful":0,"cool":0},"aU5TQPwk0ydhUNl6urvHUQ":{"text":"When I think of New Orleans or even Louisiana food, Mexican is the last cuisine I'd think ","useful":1,"cool":0},"-OwKSCjXO8_l-tR6cvFDuQ":{"text":"Funky, full of art, and the food really hits the spot.\n\nCame here for a fundraiser and was","useful":1,"cool":1},"RDc_N3cmCBleMRP2YEihWQ":{"text":"Hubby and I second round today . Our Server Nathan ,the Bartender Alle  and the Hostess wa","useful":0,"cool":0},"JCYjRhneovi2O5joZFDAUg":{"text":"It lived up to my expectations. I'm here visiting from CA and my family always talks about","useful":0,"cool":0},"_2RqcI8tjqkNr5sn-_ZtAA":{"text":"This was a delight! I enjoyed my margaritas, food, and the ambience. This is worth your ti","useful":0,"cool":0},"Km4NIJp3DED-GcTprlvmNQ":{"text":"Fun spot for groups of any size. Can be a bit of a wait (especially on the weekends), so b","useful":0,"cool":0},"hqo5-EejjbbubkOKdcesCw":{"text":"The velvet cactus was a great experience. We had a large group (15 people) and did not cal","useful":1,"cool":0},"pBz2SD1ZIxlIWXKom4Whew":{"text":"Excellent atmosphere inside and out. Fantastic margaritas and fajitas. Try a combination o","useful":1,"cool":0},"ZmLm6-rE_-wtOJ1789EIbw":{"text":"We were seated immediate outside and the atmosphere was nice and comfortable night. Once s","useful":0,"cool":0},"nP-PassWa-_l2wxTl_tD8Q":{"text":"My new favorite restaurant!! I can't believe I just recently stumbled upon this gem. The d","useful":9,"cool":7},"WVfEBlNlQD7iPD9oiOvYIA":{"text":"I love the atmosphere of this place, and the food's darn good too!  We like to start with ","useful":0,"cool":0},"Lg0xjUgbZ7uB2xUYsGd_LA":{"text":"We have been to the Velvet Cactus many times, but our last visit was not great. I asked fo","useful":3,"cool":1},"fdLdyIg-jwNYCW5hYvDHag":{"text":"Had the most awesome waiter Brent! From start to finish he took great care of 9 women.","useful":0,"cool":0},"KhZgnBhTWXi4rPNhLTB_PA":{"text":"I've been eating here at least twice a month for over a year. We used to love this place. ","useful":0,"cool":0},"jinq8CfXye_21h23McmdDQ":{"text":"I had high hope for this place as I've been hearing great things. The best thing was the d","useful":0,"cool":0},"cb7btgzvTtsU-ijqicaiKQ":{"text":"This place is great from the paintings on the wall down to the waterfall outside. The food","useful":1,"cool":0},"DgIz12LM6s9muM7gC7jlNQ":{"text":"We LOVE this place!!! The food is always so delicious and fresh. I've never gotten anythin","useful":0,"cool":0},"YdLiRL_EGIWG1alyn3Q3Vg":{"text":"Fun, colorful place for drinks but that's it. Don't go running over to get anything better","useful":1,"cool":0},"tT2bpV3yrttveJQAxsY6Xw":{"text":"Great atmosphere and strong drinks!  Perfect spot to start a girls night out!    We got th","useful":0,"cool":0},"yZT5EFdJITPWV7U0uGokYA":{"text":"I'm giving this review 5 stars. If there were more than 8 reviews at this time, I would gi","useful":2,"cool":2},"HNoFoSVZ5WD_jkzd7j2-Lg":{"text":"We really wanted to like this place, a Mexican restaurant with vegan options and a cool, f","useful":3,"cool":0},"ct5uNQ-QcwPqHB-icpJcWg":{"text":"If you have any respect for Tex-Mex or your taste buds, you should avoid this place at all","useful":2,"cool":0},"3PHwy0jOpHXQIJUkRQ0jFw":{"text":"Good food. Excellent margaritas. Love outside patio in fall and early spring. Usually crow","useful":0,"cool":0},"i9oig1x75DuNRp7ikL7IXg":{"text":"When I am in the mood for a nice and strong patron margarita, I head to Velvet Cactus. The","useful":3,"cool":1},"NDasmhyb4zwLYjUxm_xESw":{"text":"We were seated immediate outside and the atmosphere was nice and comfortable night. Once s","useful":0,"cool":0},"nnzKBxJqz3b5DFxtaICb5g":{"text":"Very good! Love their margaritas, love their quesadillas! It can get a bit crowded but if ","useful":0,"cool":0},"M3H9bCsQ6dgDoIGhgv5k4Q":{"text":"Crawfish queso??? Ummmm...very questionable. I usually come here just for the ambiance. I ","useful":1,"cool":1},"SuqQIwO2zPwBtoWOdXBn_w":{"text":"Wont be back.  VERY THING is soo overspiced it's inedible.  What a let down. Nobody is sur","useful":0,"cool":0},"FosK7SRpxe_XX1g3IAOSPg":{"text":"This is a pretty solid place for good Mexican food and drinks. Be prepared, though, for he","useful":0,"cool":0},"AVHbPZtr_tUDMhAmnGGFcA":{"text":"LOVE The Velvet Cactus.  We go here about once a week.  The salsa is made daily and so goo","useful":0,"cool":0},"OCoTWn3aEHKrqB3mwN5V2A":{"text":"Excellent service, friendly atmosphere, delicious food, and yummy drinks! Brent was our se","useful":0,"cool":0},"7Nlw80v160V9JcIdKqYeNg":{"text":"This place is the tits. Guy with the handlebar mustache is a total G and Kyle makes a mean","useful":0,"cool":0},"lzaxf9bbhTczQfP2iJIEvg":{"text":"The atmosphere is definitely the best thing this place has going.  Fun vibe, young profess","useful":0,"cool":0},"F5zb8-_dMwgWrhbQpTqitA":{"text":"This authentic local restaurant has the best Mexican fare I've had in a long time. Three o","useful":0,"cool":0},"q1eG6xUbqFy6uS14JhOVhw":{"text":"Nice Vibe, great patio for outside seating if the weather is good.\n\nCeviche and tamales ar","useful":0,"cool":0},"PYelWDtTXUQ2arSwVcnHuQ":{"text":"If you want the kind of \"traditional Mexican\" food that you get from most Mexican restaura","useful":0,"cool":0},"lxE4iqR-F5sAGbJvezojyw":{"text":"When Velvet Cactus was first suggested, everyone have me the,'it's not real Mexican food. ","useful":3,"cool":1},"upCSjuszhG-YkDMXvg9FRQ":{"text":"I often just come for the drinks as i don't think this restaurant is anything spectacular ","useful":0,"cool":0},"bERg8iESlYwbIIN7lBiiwA":{"text":"This restaurant was wonderful. We came to NOLA on a short trip and were looking for a fami","useful":1,"cool":0},"MtlHMyB9RJXTPm4fp68ZnQ":{"text":"This place sets the bar for quality food drinks and service. I tell everyone I know that i","useful":0,"cool":0},"OyJQidWBC_Qs_kBy9n0x5g":{"text":"I really enjoyed the atmosphere, very chill. I had the brisket chimichanga, rice, and plan","useful":0,"cool":0},"JeBWV4qhqVT9623OLwXybg":{"text":"This food was horrible! As you can see my sweet plantains are all burned. The enchiladas h","useful":0,"cool":0},"jIylPdhpyiMpwRi2BV1RLA":{"text":"Great atmosphere, and this place obviously does very well because it was packed. I thought","useful":1,"cool":0},"uXnvnhgfkYkClzP7xFhRRw":{"text":"Always a go to! It has never failed us. The best salsa in the city. Service is always wond","useful":0,"cool":0},"BLz4fSK0k1MSr3tXdTt7LQ":{"text":"I'm giving four stars mostly for the patio and margaritas. The food, although good, was no","useful":1,"cool":1},"aVyXtJasEldebOQJY-1MsA":{"text":"Im from Texas. I love this place good food and great atmosphere and SUPER FAST service!!","useful":0,"cool":0},"3x8AKKwPx2hArXmXpHQaAQ":{"text":"Great atmosphere. No wait even though it was packed, the food was soooo delicious and ther","useful":0,"cool":0},"Tcadh2pxmHkX3bwY01qO2g":{"text":"This place was amazing!! The atmosphere was really unique and the staff members were incre","useful":0,"cool":0},"OoZ4pHwS6t5Tsgh69tcHGA":{"text":"It looks like everyone has the same thoughts I had. Atmosphere is great (maybe a little to","useful":2,"cool":1},"CVgv5P_7Fwz6h1atN9hYJg":{"text":"TexMex with a southwestern flair. The atmosphere & menu have that quirky Austin/Hill Count","useful":0,"cool":0},"mu1zNDt9_ljCRpqlswwhiQ":{"text":"Came here again yesterday and had great food and good service.  Love the casual atmosphere","useful":0,"cool":0},"mgLSXBMAW-cIkapcahl1-w":{"text":"Good food. Excellent margaritas. Love outside patio in fall and early spring. Usually crow","useful":0,"cool":0},"nvcgd2u4w-HHwzWwibzvqQ":{"text":"Probably my favorite restaurant I've ever been to. They have the best margaritas I've ever","useful":4,"cool":3},"ujwNQk6b5t_5QWZl7SSBwA":{"text":"Cinco de Mayo 2019 . Here my Hubby and I go . Lots of fun today . It was a very lively cro","useful":0,"cool":0},"J7lB00m7OANUXvQF4Xe-sQ":{"text":"In NOLA for vacation and found this place.  Great food and great service! They were busy b","useful":0,"cool":0},"58LArxDSR-RZ7kHzsthxoA":{"text":"This is absolutely my favorite place to grab some margaritas and tacos. Our server was so ","useful":1,"cool":0},"HTn4eZKTpYYNsEhVHPCMOQ":{"text":"Loveeeeeeed this place!!!! From the decor to the margaritas, I was sold  My Friend and I w","useful":0,"cool":0},"LtjOjPEedzFxZrmX73soaw":{"text":"We arrived around noon on a Sunday, and it was pretty busy.  There was a 15 minute wait to","useful":0,"cool":0},"e23Da63aPMgLmLug8dQpWw":{"text":"I am incredibly sick, so I thought, \"What better than some hot chicken tortilla soup?\" I d","useful":2,"cool":0},"18mlVFCguGecre9l_yyObQ":{"text":"This place is like stepping into an installation art market that sells Mexican inspired fo","useful":0,"cool":2},"TfV9AvMt9IXjORmdGBfY_w":{"text":"The smoked pork taco is ah-mazing! So are the plantains and tamales \nDon't even me started","useful":1,"cool":2},"t0PPTyAkQOE_VOBTd6CqKg":{"text":"We love Velvet Cactus. It has a very unique New a Orleans feel to it. \n\nI recommend the ve","useful":0,"cool":0},"84JaJ45YUX5aFmDKaqsI1g":{"text":"Great queso but the rest of the food was mediocre. The chicken was tough, the vegetables w","useful":0,"cool":0},"F7RjdSuwYBZMiFX5i96zJg":{"text":"The Restuarant was cute and eclectic, but the food was terrible.  The price was 11.99 for ","useful":0,"cool":0},"6buYIn8VFkaGuuCyw1wtHA":{"text":"My husband, mother-in-law, and I went on a Thursday night. It was very busy but we were se","useful":0,"cool":0},"PCROWbtJ-M4COtQl2a8vAQ":{"text":"Food was delicious, atmosphere is amazing. Sarah is such a wonderful server! She was atten","useful":0,"cool":0},"jI5pSVpavEF-dWLeIMFMEw":{"text":"One of my favorite places for Mexican food of all time! Great atmosphere, great food, and ","useful":0,"cool":0},"2G-ffwc82O0-PPol_BpqAA":{"text":"Literally the best pork taco I've ever had in my life. Wow. I was also a big fan of the co","useful":0,"cool":0},"Y-w0wuoJmUp_09NaFl-9Ug":{"text":"The food is super fresh and tastes authentically Mexican (steak fajitas and cheese enchila","useful":0,"cool":0},"CmzI-UIsPx3OLjp8Tg-o6g":{"text":"The service is great and the cucumber jalapeño margarita is to DIE for. Super cute atmosph","useful":0,"cool":0},"X9Znc5s6ADQodPK4hLhxIw":{"text":"This is one of my favorite places! The margaritas are on the pricier side but they do not ","useful":0,"cool":0},"p2W-5jmLlqBcLgk2Kc7cNw":{"text":"I was drawn here by their Christmas display. I'm a Christmas fanatic and wanted to take pi","useful":2,"cool":0},"F5JMw-YKWAG_hjn8mDqrQw":{"text":"It's been a while since I have been here, decided to stop for dinner last, few drinks. Ove","useful":1,"cool":0},"u-GdD09mnsuokoabemEBLQ":{"text":"We went here for our Christmas party and there were only six of us. Service was pretty non","useful":0,"cool":0},"6UXNemgQCIN5Z8hCVk8pTA":{"text":"This place used to be pretty good, but now, not so much. \nOver the last 5 or 6 years I've ","useful":0,"cool":0},"CfNmbdaff7c9OtaSWiRDYA":{"text":"The Velvet Cactus is one of my favorite  Mexican restaurants in the City. Good food, great","useful":2,"cool":2},"LC0lU911zgCTihxbMK2hsw":{"text":"Pretty good Tex-Mex food, definitely a step above others in the city.  Their egg rolls are","useful":1,"cool":0},"df4kN0aQnV0ijEiOPNtW1g":{"text":"What's not to like about this place? \n\nThe service is wonderful. Girls are swamped in this","useful":6,"cool":5},"flCX-SxlseMrDXQoODH_cA":{"text":"We stopped in at 7:30 on a Wednesday and it was honestly busier than I thought it would be","useful":0,"cool":0},"NJVgKMWGAodhPw9PluZuBQ":{"text":"I ate here once and will never come back. Cauliflower nachos was terrible. Also my server ","useful":0,"cool":0},"6hNnEbGsvWJy-w8VPdy7bg":{"text":"I love this place! The chicken tortilla soup is GREAT! It is full of shredded chicken, avo","useful":0,"cool":0},"wxtQ2b_Q4qfcVrA6Tfk4cg":{"text":"Excellent Friday luncheon.  Margaritas are really strong and the food was so fresh.  The c","useful":0,"cool":0},"ZMhW1cXLK_38EXA_CoNYBw":{"text":"Awesome food and some vegetarian options! Also cute decor and fun outside patio. I got the","useful":0,"cool":0},"aMsfoyPcFRV7t7iMnsR-HQ":{"text":"I live in the neighborhood and have been here many times.  I've finally decided that I won","useful":0,"cool":0},"RYPVkGWG08qbtW5mjIL_Dw":{"text":"The Velvet Cactus has great Mexican food! My party of 4 all got the Taco Plate with two si","useful":1,"cool":0},"zI4D4rz3BAq_uR1upttnzQ":{"text":"Came here for an early dinner. Told the waiter my wife and I are both vegetarian. They pro","useful":0,"cool":0},"PNU3mDoMyk1b9OeUC9eplg":{"text":"Another Sunday brunch visit and my emphasis is on the friendly sprit of the Cactus and the","useful":1,"cool":1},"Pc8LzZEX8GF8qqfaiXP74w":{"text":"Delicious Mexican food fabulous frozen margaritas well worth the visit food is always fres","useful":0,"cool":0},"BdUBKi49fpXKdRz2NZ2wgw":{"text":"Asked for a dry margarita, got pure syrup. Asked to exchange some some tequila and soda in","useful":0,"cool":0},"XuAW4NdmJ0YTKnalhvM_rg":{"text":"Our waitress Lauren L. was the best! She was very good at checking up on our group and is ","useful":0,"cool":0},"x8VXc35L8SK0f3Z0t3pgcg":{"text":"Where can I start? Good margaritas, good food, very good service, and perfect patio!\n\nWe u","useful":2,"cool":2},"fZXcyKBac17mj5uihCtnEA":{"text":"Terrible, terrible experience - do not recommend for large groups or on busy nights, whats","useful":1,"cool":0},"IoG5m_BjVHd_H3wI1ocZkA":{"text":"The first two times I went here, I wasn't crazy about it. The third time I went I ordered ","useful":2,"cool":1},"-cKv20cuvQ7c5bW6xx823w":{"text":"The Decour of this place is phenomenal, really sets the scene for a great social night out","useful":0,"cool":0},"2NIrovQDoF91b0Yx9AiA0Q":{"text":"Interesting parking lot.  Not too many spaces so good luck! I was dropped off by my DD! I ","useful":3,"cool":0},"kT_Tgoo5AkolS0cvVPxo4g":{"text":"I had heard much fanaticism about the Velvet Cactus since it opened a few weeks ago, so I ","useful":4,"cool":4},"6tjsxuv99kffZLfRJD6U0g":{"text":"Had the enchilada combo with two sides for lunch today.  One of my sides was the watermelo","useful":1,"cool":0},"L3EHJ_5MpMFsyEjSCqR98w":{"text":"Great atmosphere and drink specials! Such a cute place, loud but worth it! Got smothered t","useful":2,"cool":1},"bj4a3163Zhp_9JYp05Vkow":{"text":"This is my favorite go to place when I want to have fun and eat delicious food. You can't ","useful":0,"cool":0},"yDVwCCW7P_NV9S_rF-P3iA":{"text":"Brunch fest was a bust, so we came to the Velvet Cactus for lunch. I'm used to eating in U","useful":1,"cool":0},"vcTwPPOJ_AoUo8HJzstwKw":{"text":"After a long day at the parades, with my skin a wonderful shade of red, it was time to ref","useful":2,"cool":0},"WrxqcucEALm4XXNzPVkwAQ":{"text":"The aesthetic of this place is off the charts. \nWe had to wait to be seated a little over ","useful":0,"cool":0},"sbKqB4tRmnFaUAqnZuiIeQ":{"text":"We love this place!!!  Great atmosphere!  Indoor and out!  Margaritas are awesome!  We hav","useful":0,"cool":0},"--Q3FUc2cFsNODV40gqo7w":{"text":"One fountain coke was $3.86 with tax. What world are they living in? Salsa is no good. Chi","useful":0,"cool":0},"20dM_HHG2bV9RE2YnM-nlA":{"text":"The prices are pretty high for a restaurant which such poor customer service. I was not im","useful":2,"cool":0},"rL8ttKXpO7Q4saSKJt0fVA":{"text":"Such a fun and funky vibe! I loved the interesting Margaritas, chips and salsa as well as ","useful":1,"cool":0},"EcYLLnlxm_NPxUpVfHRLtg":{"text":"So Far...So GOOD! . To say it qas COVID Nd Hurricane Vibes This spot  still delivered with","useful":3,"cool":0},"3PpK7fc9tfJYEq81r_CmLA":{"text":"I am VERY impressed!!! I have been wanting to try this place for sometime and finally was ","useful":0,"cool":0},"rdeMxxPuK8IM1VRGM2f6Yg":{"text":"Still would not eat the menu if I could avoid it, but it's the perfect place to enjoy a ma","useful":3,"cool":2},"C3rZmo8MnqsjPeyY32Vtvg":{"text":"Good drinks, solid appetizers and great tacos. The paintings also give the place some life","useful":0,"cool":0},"8E1vOPDu-f0Mx_0xlakDCw":{"text":"Yesterday was the second time I've been to this restaurant and it's delicious! I'm not a f","useful":0,"cool":0},"3e6yaCP9v0-DJqWDaahRVw":{"text":"The atmosphere was excellent, the outside patio seating was open and great during this tim","useful":0,"cool":0},"gGiVstO8wC0K2IXjEbLLdg":{"text":"This was such a great find when leaving the Metairie parades.  The decor, service and qual","useful":3,"cool":3},"0CSIrMN_dSbWrhU5d8TX_g":{"text":"Ate here with 5 friends on a Saturday night and had the best time. Arrived around 6:30 and","useful":0,"cool":0},"wJvtJ8_Cw2wrKYObaRV6XQ":{"text":"This place is my go to for a very relaxed evening with a bohemian atmosphere. This place h","useful":0,"cool":1},"wd-vNnS4mOddOT0EhHyfvA":{"text":"Velvet cactus, food is really good.  However it is disappointing when you place a pick up ","useful":0,"cool":0},"Rr6wCttXmCVjWMgIa1712Q":{"text":"The frozen margarita and queso were the best.  I did order the chimichanga but it was a li","useful":1,"cool":0},"UDDbQNZltuEWVjT97VCaZw":{"text":"I've come here a few times with friends and coworkers and the food is always of pretty goo","useful":0,"cool":0},"OJ23ecM-0Gjec2TQbvHGZA":{"text":"The atmosphere and the service were good, but I'm not sure why it's so popular? \n\nWe got t","useful":1,"cool":0},"jmeDvrO07cunQAC6mWC0aQ":{"text":"Food was very yummy, and their vegan options are amazing and the staff is very friendly! W","useful":0,"cool":0},"tohW4xEntMeHi0ocQCYJcw":{"text":"Cool place to chill with family and friends. Salsa and drinks are great. Food was overpric","useful":0,"cool":0},"MEwhyWD1g3g4264O_NZS1w":{"text":"We went to the Velvet Cactus on Mother's Day. The weather was nice and we wanted to sit ou","useful":0,"cool":2},"fzB4Sjo-pe9EaPCxU0mzAw":{"text":"What a cool place.  Deep in the Lakeview neighborhood, this place offers some really delic","useful":1,"cool":0},"nFnejRWPFH1jIRyG7nmjxQ":{"text":"Warm salsa, delicious refried beans (weird thing to shout out, but their beans are ridicul","useful":2,"cool":0},"bJS0sMzWrxaO0ZZh7yZNow":{"text":"A fantastic spot for Mexican food!  Plenty of outdoor dining.  Everything is delicious. Do","useful":0,"cool":0},"EFO8gGKtEs6sM9grKOdFzA":{"text":"Prominently displayed, this sign is inappropriate. I am not an alcohol drinker myself. And","useful":1,"cool":0},"v-2Z1CJdxbHfOX4RD1U3yA":{"text":"First in-restaurant dining experience since COVID! The wait was about 45 minutes on a Frid","useful":0,"cool":0},"RJHVwaXibWNJ78Fbd8xhkg":{"text":"Fabulous restaurant in a fab neighborhood in Lakeview. Talk about colorful views. The scen","useful":3,"cool":1},"3Hxxx7D4bMR-37ZTl9tSSw":{"text":"Food is excellent, atmosphere, employees, everything. Love love love this place!! Great fo","useful":0,"cool":0},"fj-cVrJ-xm8g3Oh40t8Qhg":{"text":"Love the complementary chips & warm salsa to start. I had the shrimp and  chorizo cheeseca","useful":2,"cool":0},"uvVrggEtVjhKJKbETobz4A":{"text":"I'm always hesitant to try a new Tex-Mex place. It's like trying a new move in bed...eithe","useful":13,"cool":4},"qilZAbwmqEFvnQ4Wt2QpXA":{"text":"As a vegetarian, a restaurant offering portobello mushroom as their veggie option is overp","useful":1,"cool":0},"0ylAK0UlQtr-MK6A9zkoGg":{"text":"The food was delicious although scared by a \"skinny margarita\" that was literally neon and","useful":0,"cool":0},"JoB18cEgoPuUL_zwwTO3TA":{"text":"This place does social distancing right. If your looking for somewhere to go to get some s","useful":0,"cool":0},"T7UPlzQi1d5T6civEmlmdQ":{"text":"Poor to go ordering experience, rude manager.\n\nTBD if we'll ever return to support.....","useful":0,"cool":0},"lXp-U5F0uITD1FEf1RW6wQ":{"text":"I practically live here, so I figured it's time for a review. \n\nFirst of all, the atmosphe","useful":0,"cool":2},"0wGUaaQWz6y-QftBlZSWKQ":{"text":"So I truly consider myself a frequent flier here and I am ashamed I've not written a revie","useful":9,"cool":7},"9PW5jEWKizBDEDJMbKSXAw":{"text":"DO NOT order takeout from here. And unfortunately that's the only thing available at this ","useful":0,"cool":0},"LjRN01GC6FFuaGWBdM4fAA":{"text":"This place is always busy, but I'm not sure I get it, as I've never had more than an avera","useful":0,"cool":0},"wcPQYby2warnMnNMbDaA-Q":{"text":"A good Mexican styled restaurant.! \n\nThere are so many to try in New Orleans (most of whic","useful":0,"cool":0},"cqlROk89-PQdjPgUA4dSvQ":{"text":"I avoided the Velvet Cactus for a few years as some of the people I know who frequent this","useful":2,"cool":4},"LvyqYvSZHp8EnBQJ011CjQ":{"text":"5 words\n\nChips and salsa\nFish Tacos\n\n'Nough said?  I think so!  Ok I will add.... Yummy an","useful":0,"cool":0},"N9mFqRg0XkAdy3n2Kri5eQ":{"text":"Went for lunch and it was pretty crowded/loud inside since the patio was closed.  the atmo","useful":2,"cool":1},"uVhee_LT13mvkaszEWcKQw":{"text":"Great atmosphere comfy outdoor dininh exmexwith fans and moisture texmex style food bores ","useful":0,"cool":0},"QBIWlC-xkfCh7DAUPSyCJA":{"text":"I went to velvet cactus for the first time last weekend. The wait was long and that was fi","useful":2,"cool":0},"iB07NN4VLvuIOyn7gxRcsg":{"text":"I love the outdoor seating. The portions are big and the food is good. The drinks are fant","useful":0,"cool":0},"5whsAWG5IFspEbz_b1jbEQ":{"text":"The food was really good. I had the smoked brisket tacos and it wasn't bad. The margaritas","useful":0,"cool":0},"RTWqQQEIln6cCdCruNfQEA":{"text":"Lunch at the velvet cactus was not a good experience food was bland at 1st I thought it wa","useful":0,"cool":0},"vKE859h2vAVW3U5Oh16-lg":{"text":"So delicious, it hit the spot. Would totally recommend to anyone visiting and even locals.","useful":0,"cool":1},"NLsJ_jXJbVJtWsYa7IyWYg":{"text":"Great food, Great service, Great environment!!\n\nEasy access from the highway.\n\nThe \"Crawfi","useful":0,"cool":0},"mw7vfC5rP9va6hOYPIDscg":{"text":"The food here was phenomenal and the atmosphere was really laid-back and cool. Artwork eve","useful":0,"cool":0},"fGEjtHOxPa-0o0rWRdFGwA":{"text":"Good service, love the vibe, good food. Large enough space to hold an event. Drinks are re","useful":1,"cool":0},"UGkkfJOeWvoJD1MQGsAimQ":{"text":"I really love Velvet Cactus. Not for their food, but for their drinks and atmosphere. They","useful":1,"cool":0},"9n3KBfHrLjUlCvgwSfpCRQ":{"text":"This place never gets old.. the food and the servers are great. John was our server today ","useful":2,"cool":0},"eHF5YLfF840Z7fNT53JUaw":{"text":"I usually love the Velvet Cactus, but I took off a star because as I walked in their takeo","useful":0,"cool":0},"oneXUdx1e_gaxVKnVpfj4Q":{"text":"Mexican was the choice of meal for Monday! Mexican Monday! \n\nMy friend and I had a short w","useful":0,"cool":1},"eFYzW8pbRQpVzy_o5nK41g":{"text":"Stopped in for beer and tacos and was not disappointed (I was completely expecting to be d","useful":7,"cool":3},"DgglECSCNBzrb6aHt2FOTg":{"text":"I have been to The Velvet Cactus many times and they consistently provide good tex-max foo","useful":0,"cool":0},"8sBBnVOgsMIjDnU3JOPRCA":{"text":"The food is good, drinks are great. However, I don't feel like they are taking the proper ","useful":3,"cool":0},"i6dK26DQCye2ysElqfplOw":{"text":"This place has really gone downhill. It was never amazing by any means but always a cool p","useful":1,"cool":0},"Xh0n8x4TcckPuDLGUVTikA":{"text":"This spot is super cute and several area good for photos. You have to sit on the patio if ","useful":0,"cool":0},"DIGM5Y6O4WHTibzqPMA9Jw":{"text":"This little gem has an outdoor and indoor seating. Outdoor seating is very charming. The d","useful":1,"cool":0},"ZtjpcH4v9tIJal7mbo3yQQ":{"text":"Perhaps more of a 3.5 star. The service was great, our waiter was personable and since it ","useful":2,"cool":1},"Kk1n4Zj1yR4qqoN6IsuU3Q":{"text":"They absolutely suck, $16 top shelf margaritas coming out of a plastic pitcher is NOT acce","useful":0,"cool":0},"09rkZLo2HycUA41U7C-OXQ":{"text":"The velvet cactus puts on a great illusion. It's ambiance is on point. Big restaurant; lot","useful":2,"cool":0},"j0H0K6mM0DXx-9P8rCMcGQ":{"text":"Food was good.  I had an order of egg rolls and the filet mignon quesadilla.  Super cool c","useful":0,"cool":0},"bArErNlRv02_UeV93nhfew":{"text":"I could have sworn that I wrote a review on this joint? Is Yelp deleting my stuff again? O","useful":9,"cool":6},"cPbk83MnyigpgDLiNn1GeQ":{"text":"So, we decided to go here for taco Tuesday. Turns out they don't have any specials, our fa","useful":0,"cool":0},"b71WR7bEss7Vljp1wlM4KQ":{"text":"Let me start by saying I probably go here about once per week - I wish I was exaggerating.","useful":1,"cool":2},"POlC8-UEMoXmgJiM98vnig":{"text":"What a cute spot! Also probably the cutest date spot in town! Great variety on the menu, t","useful":0,"cool":0},"d3xp8VC6riQI_koLED5COg":{"text":"Atmosphere is unmatched among all other Mexican food establishments in the metro area.  Th","useful":1,"cool":0},"rvawxuB19XmtCO9BjUSCWQ":{"text":"Save your time and money \n1. Service was terrible the waiter acted like he really didn't w","useful":1,"cool":0},"AmZHw5pd6M63mlBJhpB-hA":{"text":"This is a unique place with ample interior seating and a large outdoor space. The inside i","useful":0,"cool":0},"cJeFsdKHlgayp8SzoFRhEQ":{"text":"Unfortunately, I was not impressed with entrees at Velvet Cactus.  My wife and I visited t","useful":0,"cool":0},"h3g8oJhjgIHqoQ-q4901LQ":{"text":"Great outdoor space and margaritas. Only got an appetizer but I'll definitely be back to t","useful":0,"cool":0},"F9wb7NLUROmY-Wy-usgUEA":{"text":"Atmosphere is excellent! One of my faves in the city. Staff is always very friendly! Servi","useful":0,"cool":1},"Tw3XFHhtg9BQF-D3rXcdHA":{"text":"From the beautiful outdoor vibes to the food this place is 100 percent amazing! You can no","useful":3,"cool":3},"D0Pr07KX_tIVnoPh8RzHvA":{"text":"I hate when I have to leave a bad review. So I'm giving them 2 stars for ambiance (patio i","useful":1,"cool":0},"T2JOJAK4hfG95sZidqRolQ":{"text":"Second time at this location on  (3/21/20) First time w friends, this time with hubby. Pla","useful":1,"cool":1},"7KinUsMKL9kM3UcsfjF--g":{"text":"Great place in Lakeview to sit down and enjoy the weather, good Tex-Mex, and great margari","useful":0,"cool":0},"aBEt-Q3E9vHdqnNebwo-xA":{"text":"50 minutes for a table. The first thing we're told as we sit is that their is an hour and ","useful":1,"cool":0},"zb8eJvzoNDsHFI42UEursQ":{"text":"Had lunch there today. Walked right in and was seated right away. I suggest getting there ","useful":1,"cool":0},"jAe0kGL7L8aJW22wAFJ7pQ":{"text":"I've never been to this velvet cactus before February but I've been to the one in Baton Ro","useful":0,"cool":0},"hmRTYFKb3f8uxiVYWQ4qbw":{"text":"I sat outside and it was really nice. The service was good too. The food was a 3/5 and the","useful":0,"cool":1},"ngRO7g_7WcIWjgHpGwHCoA":{"text":"This is a review of an outdoor event that Velvet Cactus put on for Cinco de Mayo.\n\nSo, usu","useful":8,"cool":6},"pn1_3UojsIHMr9iOuNwIlw":{"text":"Pork Pibil tacos!  That's all I'm gonna say.  I haven't had anything else here because I j","useful":2,"cool":1},"LPEWsuXp8b42hzrwX93eLA":{"text":"Unfortunately, they are closed due to the Coronavirus. \nI love their fajitas. It's a great","useful":5,"cool":5},"iGukkDIlCeG1_YusjqdPgg":{"text":"The Velvet Cactus is an awesome \"Mexican Dive & Funky Art Joint\" near City Park. They have","useful":3,"cool":3},"NsFX1fcsSeERdciCNWwXPg":{"text":"Tried the velvet cactus recently. The service was friendly but messed up our order. I aske","useful":1,"cool":0},"s7U7EIbcaV4-HoN89PVccA":{"text":"Unfortunately I had a bad experience here. We sat outside, so we had to order on the phone","useful":1,"cool":0},"LYebVlMlZjgaZvh3aC5ZDA":{"text":"Food was great today and our waitress was jam up! I was overly impressed with how fresh th","useful":0,"cool":0},"XYja1pHThxl1N2I93l3XEw":{"text":"Amazing amount of outside seating. We visited for lunch and had the tacos. I had one brisk","useful":0,"cool":1},"iZBa_eTPpKsEv7-vbOXVvg":{"text":"Beautiful atmosphere, great food, lots of delicious vegetarian and pescatarian options","useful":0,"cool":0},"y20HmhAijy9ag-oXNhyOoQ":{"text":"First, I love Tex-Mex and will try almost any T-M restaurant so I was really looking forwa","useful":1,"cool":0},"LoDgQTDnSVotTyiB6OKsbA":{"text":"This painkiller was delicious except it didn't kill the pain of the Saturday night wait at","useful":2,"cool":2},"4IgSnN1DPt5hC7deqQKDpg":{"text":"First visit since moving from Phoenix area. Friend recommended any of the taco dishes. We ","useful":1,"cool":0},"Yxa3PBFbpyVwCNYmYQIjrw":{"text":"I've been here a good bit of times , I'm always pleased great margaritas great atmosphere ","useful":2,"cool":2},"mwxxdFDBVEg6p34kvF_8ew":{"text":"I went here because I heard of them from their response to the Gentilly robberies (they of","useful":0,"cool":1},"kkWnukqhv7qR_jtuV5AYng":{"text":"This was my second visit to The Velvet Cactus. But I often recommend this place to my frie","useful":3,"cool":3},"XiCPcRQUTJZ-xPabjwsjkA":{"text":"The atmosphere is what gives this place the ratings. And because I base my reviews on surr","useful":1,"cool":0},"kzcyhvYGwnWyg_fncUxNUg":{"text":"Wish that I could have left a more positive review from my last one, but things have seeme","useful":3,"cool":1},"DQyscQQzB40kgxdi36OzQg":{"text":"The Cactus gets a 4-star from me thanks to the restaurant's awesome and unique seating env","useful":1,"cool":0},"BkkgWquu5K0Dwq6-KdYMhQ":{"text":"Service was excellent. Arrived about 8:30pm on a Saturday. We were seated quickly. Waitres","useful":2,"cool":0},"o38ZasIEKrHFL0yZtM0ukw":{"text":"This place is not very good. From the outside (well-manicured grounds, nice lighted sign, ","useful":3,"cool":0},"25Z3yNZ0xT4bScvrc03vlg":{"text":"Cool decorating and probably a great place to drink during fall on the porch. But I got th","useful":1,"cool":0},"Yjd4NPkLz9Q7OEvrmUhG2w":{"text":"Oh My Goodness. I just want to take my server and put her in my pocket.  So absolutely won","useful":2,"cool":1},"FhiJ6BINuPDkAAqpmMGHZA":{"text":"I'm always down for a margarita with my friends.. so this is normally our first pick. Ther","useful":1,"cool":1},"j1UTjBZgX3_fkBX-jd7vgQ":{"text":"Decided to come here after a long day of work with hubby. It's been about 2 years since we","useful":3,"cool":2},"zTbCVLuy9nLhcnpK2KQyYQ":{"text":"This is an excellent place for tex mex food in New Orleans. It's in the Lakeview area on H","useful":2,"cool":0},"WTQURRJNU4PXAWF7VADj8w":{"text":"Megan was our waitress and she made the experience very awkward. She was so nice to the ta","useful":0,"cool":0},"u2iO7BZ-LQWM0bO29S3oFQ":{"text":"I highly recommend enjoying a beer while eating chips and salsa on the patio, but wouldn't","useful":3,"cool":0},"KM9gWpG2h2R_HKBjEJ3h_A":{"text":"Loved the VC here. Tried the one in Baton Rouge two months ago and had to check NOLA out. ","useful":1,"cool":1},"zOpnerTEFwhXZZrPpXIX3g":{"text":"This is a great restaurant. The food, atmosphere, and service were wonderful. The only rea","useful":0,"cool":0},"LAVE9ChvGQzOs1tPAc_gsQ":{"text":"The Velvet Cactus has exceeded my expectations!!! It is by far THE BEST new restaurant! Yo","useful":4,"cool":1},"TI9Vy90H6mBxBd3i45SVVQ":{"text":"I visited this restaurant just after it first opened and was disappointed with the food an","useful":0,"cool":0}}