{"seMaH99ZPiiB4H5C9HfRMA":{"text":"I don't know whether the other reviewers know nothing about motorcycles or I was just unfo","useful":0,"cool":0},"qd6eD1rD5LUO3LtNRqVAnA":{"text":"this place is so amazing! i brought in my scooter with a busted tire and a bent rim on lun","useful":1,"cool":0},"B-lRDSaBcSu20AhqMRrLwA":{"text":"I bought a Scooter today, and David was one of the best salesmen i've had in a long time. ","useful":4,"cool":3},"kwCziZw_gAJaHZ3_NhKv8w":{"text":"This place is great. Really nice guys that do honest work for an honest price. Really luck","useful":1,"cool":1},"Ougq3ei2B7dMFlgnxUd0ZQ":{"text":"I cannot begin to tell you how helpful Dave and the folks at FX were. I was passing throug","useful":5,"cool":3},"piKWXbhkUU78uD0cGEor-g":{"text":"Great staff and service. Dave is always trying to help a customer find what they need whil","useful":5,"cool":2},"2dLPDzWghZjGXLDIUsHrCw":{"text":"These guys are great! They've fixed my scooter and motorcycle so many times it's absurd. T","useful":1,"cool":1},"OjM2mLsPeetxozhKIE5UXg":{"text":"I deal with FX Motorsports on a fairly regular basis, and always find them professional an","useful":1,"cool":0},"PAryBqCRuCGxyq3_DsrOEg":{"text":"This is my very favorite business in all of New Orleans. David the owner is an awesome dud","useful":0,"cool":0},"nn0IOQUsqBLfjLvZuKYYfw":{"text":"David, Tom & Jeff. 3 great guys who REALLY do know how to handle any motorcycle issue you ","useful":2,"cool":1},"zO6SnfivEaL2941luym6mg":{"text":"This is the highlight of the review: RED SPARKLY HELMET. \n\nHere's the rest: \nUpon Jen B.'s","useful":7,"cool":3},"EKsSQi0NqkW0HrdXY17qTg":{"text":"I have had several my motorcycle and several scooters serviced by these guys over the past","useful":1,"cool":0},"qItgcc772WwrrI99JxmmIQ":{"text":"FX Motorsports does it all and is very professional with your repairs. On top of that they","useful":4,"cool":2},"E8OlMewrOiNWQHmggqzSgA":{"text":"These guys go out of their way to provide the best solution to your problem. I had a motor","useful":2,"cool":1},"PzUHF_foHIV8hwqGQ3meYQ":{"text":"I have been taking my scooter to FX for 6 years. I have always felt like they did a great ","useful":2,"cool":1},"XYBTWUHtIKoVBAfJkWsDyQ":{"text":"Have a weird vintage bike?  Take it it FX motorsports.  They're the only place in town tha","useful":6,"cool":3},"BXHdDnfYQcyevru31WkTTw":{"text":"I bought a used Honda Ruckus here.  I got a great deal and they really took care of me wit","useful":0,"cool":0},"BthpGSGb43qmn8o9gvXTbA":{"text":"I took my scooter to FX and they called me the next day to let me know what was wrong with","useful":4,"cool":2},"Xz3YZFJrAuKhDqcB_7WKKQ":{"text":"Dave and his crew have been our EXCLUSIVE scooter repair team for a VERY LONG TIME!! Dave ","useful":3,"cool":0},"AvmKTZPTu54zIhCK5YKeLg":{"text":"I LOVE FX. Always friendly and helpful. The staff is always helpful and has a large supply","useful":0,"cool":0},"4F_11t-IRLzrZuubnmiqfQ":{"text":"I've used them twice now and they are just so dang nice and their prices are super reasona","useful":0,"cool":0},"DSc8hZ07ZTJ40bNxRrm7dA":{"text":"Great to work with Fx. The whole crew is very friendly and responsive. I will certainly be","useful":0,"cool":0},"Y1thdnC0NxKRw6AX-is0AQ":{"text":"Great group of mechanics that focus on what matters. All the other shops wont work on my b","useful":0,"cool":0},"PYuqQApV5HTxuLouzmPy_A":{"text":"The people at Fx Motorsports at top notch. From the friendly receptionist to the highly sk","useful":0,"cool":0},"9kZ2GvEyJ2Y3vHUd0G9kKQ":{"text":"The ONLY place we take our scooters for any repairs, maintenance or supplies. ALL the guys","useful":9,"cool":8},"PGiaR6_QJ4hReARya05H2g":{"text":"FX motorsports is my go to place for scooter repairs. I have gone there several time for v","useful":1,"cool":1},"RY4uZmllSzQF6sO8K8K6Gg":{"text":"This is a great business! These guys are nice, up front, and really know what they are doi","useful":0,"cool":0},"YxLt-U-cr7nCRnR4UevgJw":{"text":"The owner Dave is super nice, incredibly knowledgeable, and exceedingly helpful. I pulled ","useful":0,"cool":0}}