{"IQl40Y7cTgWp7_rnniYWuw":{"text":"Get what you expect from a sports bar.  Good Bloody Mary.  Decent service. Recliners for t","useful":1,"cool":0},"iE49gIFbSNITevIzCwmbDA":{"text":"This service was epically slow.  No one apologized after we expressed our frustration on t","useful":0,"cool":0},"Hd5Ly-Kp1JN3gbSAlAsFmw":{"text":"Avoid this fake football tourist trap at all costs!  Went here upon wrapping up JazzFest w","useful":0,"cool":0},"n97FfPAQdtGscBr3kloXVQ":{"text":"This was one of the worst experiences I've had.  Ordered appetizers and took 35 min to arr","useful":0,"cool":0},"amR1d7nN6m-Q1hBMseVbNw":{"text":"Went to Manning's on a Saturday night during Memorial Day Weekend.  Awesome place to watch","useful":0,"cool":0},"PAYSSlBICPGvOcvyJHcN9A":{"text":"The BEST beignets in NOLA!  Go take your photo at the \"famous\" one and keep walking to Man","useful":0,"cool":0},"HZqIzXrYklmsNMuqdw5AiQ":{"text":"First time to NOLA and to Manning's.  Our server \"Q\" was fantastic. Took the time to give ","useful":0,"cool":0},"n4LhKA01rnC-iyYnnYRYZQ":{"text":"Don't go here unless you want to watch the game on recliners and have people serve you les","useful":0,"cool":0},"FNTfCfLRn7L_qsAxHIJTJQ":{"text":"Great food! Great atmosphere! Perfect weather for food in this traditional quintessential ","useful":0,"cool":0},"plgG7UJDEEK-RGJjfnukRg":{"text":"I've never been anywhere in the world with as incompetent service.   Dozens of employees i","useful":0,"cool":0},"QHDGZ8a1iv8viZcU45iFEg":{"text":"Good place to watch the game. Overpriced prosecco!! Watched the game upstairs, bartenders ","useful":0,"cool":0},"OC-GN5FrrnGQRCjlyF89_A":{"text":"Visiting New Orleans and thought where better to see the Super Bowl, what a mistake! The s","useful":0,"cool":0},"lIWcZbFqomLmptOFby_20A":{"text":"I'm sure their trying.  But service is non existent and the excuse of were super busy in t","useful":2,"cool":0},"ZUZ-K1t_AFL5gN66bzjklw":{"text":"We had high hopes for this place. We went on a Saturday to watch some football and grab so","useful":0,"cool":0},"Q5hR-w1fhW-0QGFbViDdYQ":{"text":"Yeah just go somewhere else...food was terrible and the service was worse than the food.","useful":0,"cool":0},"Rja1KFTSNoNxXUCOAlgxBw":{"text":"Likely will never be back, I'll spend my hard earned money elsewhere. Transaction started ","useful":2,"cool":1},"Kc7IDWHKeX1g35CTHbrSiw":{"text":"I had the artichoke dip appetizer \nA few cocktails\nTook a to go order of a steak coleslaw ","useful":1,"cool":0},"UJFJ1sjOz14PSaH5whQ-eA":{"text":"Food misrepresented on menus. Waitresses boyfriend keeps distracting her from working. She","useful":0,"cool":0},"iEVHtPX4h46ODJHcWn0ygA":{"text":"Not only was the hostess and the bartender rude, they wouldn't accept any of our IDs becau","useful":0,"cool":0},"YUF9AOWBs0-nU7bJNv3xzw":{"text":"Slow service and bland food. However we stayed to watch the NFL games. Lots of tvs, you ha","useful":0,"cool":0},"N-kIc2T_qv6zJ8u0vIr-bg":{"text":"This was our first dining out experience in NOLA, and we walked away with a skip in our st","useful":1,"cool":0},"m-kzKybwiWDhxQWzhXT-dQ":{"text":"Former long time New Orleans residents, our family met up in town for the Saints Monday Ni","useful":1,"cool":0},"aa4gSAgjjnvgMFcTa-DChA":{"text":"My husband and my cousin arrived at Manning's to watch the game. We walked in and was crea","useful":0,"cool":0},"bpO8_3pYYopPfge9WbmC8Q":{"text":"Very poor and slow service. I wouldn't recommend this place to anyone. We waited 40 minute","useful":0,"cool":0},"aMgsMmC6cblZVAcrkgLT8g":{"text":"Good place for TV's and cold beer - the food - not so. Limited menu but not your typical s","useful":0,"cool":0},"sIuf3NXGEEyXoizWK_Vprw":{"text":"Post Mardi Gras Day parades we stumbled upon this restaurant as it was super close to our ","useful":0,"cool":0},"ECnfJtVmvZ9GrktP6Ffkeg":{"text":"My first mistake was stopping by the opening Sunday of the NFL season, that being said, by","useful":2,"cool":1},"H8b0GfakWjDTTREjiMOYvg":{"text":"STAY AWAY FROM THIS PLACE! \nJune 6, 2017 Tuesday around 7pm. We noticed the popular name M","useful":2,"cool":1},"mp7_rGoQVoKs79-fcJKRow":{"text":"Nice interior; decor is great.  Sit in the \"reclining section\" - this is a JUMBO televisio","useful":1,"cool":0},"wGhCrFB8T4NXsaGOqiX4Rw":{"text":"I had an absolute blast here! The Blackhawks were playing and they played the big game on ","useful":0,"cool":0},"0qWD60j4weYTPlhIUnmNaw":{"text":"We had heard that Mannings was overpriced, but my friends and I just wanted a burger and f","useful":2,"cool":0},"mYnbhzlPJ7b-1CM2Mh02cA":{"text":"If you're looking for a classy, cool, modern place to watch a football game this is your p","useful":0,"cool":0},"WAuH8NzNXitxm-q1NiGSXA":{"text":"The quintessential Sports Bar and who could argue with the Theme--one of the best names in","useful":0,"cool":0},"3T3sQf0y8Cv5Oq6UW_4JmA":{"text":"I believe the Mannings need to stick to football.  10+ minutes to order a drink at the bar","useful":0,"cool":0},"2MU54gdfGL7q3h3ErjDVUg":{"text":"Food over priced. The meat was extremely too tuff to chew. The setting is pretty cool that","useful":0,"cool":0},"0XLHOGXNtf58dtO4WVR-JQ":{"text":"Highly recommend to all my military friends when they visit the city have to stop in for a","useful":0,"cool":0},"wZGMW_fIwpRLiyQLRUFslQ":{"text":"This review is written more in sorrow than in anger.\n\nPreamble\n(If you follow my occasiona","useful":6,"cool":0},"iAzb_fUJwoycrJi4L_VnaQ":{"text":"Recently ate at Manning's twice during my stay in New Orleans due to it being connected to","useful":0,"cool":0},"CyBmE0wOi0ppoRD-uvgqVw":{"text":"Waitress was attentive and friendly. Nachos are huge and delicious. Enough for 4 people. R","useful":0,"cool":1},"i2PhHRDa2ERIpDQ_jQMjjQ":{"text":"Second time at Manning's and I will say that we are very disappointed! The service is terr","useful":0,"cool":0},"ar58mT7XnoKRUuM3H0-MxQ":{"text":"Sat in the stadium seats. Waiter never acknowledged us.  Had to go to the bar for drinks. ","useful":1,"cool":0},"jl3V7c3Dg0LdNBLSKTMjnw":{"text":"Try the just added to menu sliders u won't regret it. It's basically a variety of smaller ","useful":0,"cool":0},"QfQFGclOEFtmYi0UNZW6jQ":{"text":"This place has the weakest club sandwich I've ever had. They charge $11 for something that","useful":0,"cool":0},"ozRwDhM5NWyjonI2TvmL-Q":{"text":"Do not plan to watch a game watching here. Made a reservation for a birthday a week ago; t","useful":0,"cool":0},"KGsw4nlveGZNINuzHl4YXg":{"text":"Horrible place. Dirty, bar is unkept. Had to flag a bartender for service. Restrooms nasty","useful":0,"cool":0},"4AfUIG0ghbxCfZEZsFQIbw":{"text":"Worst experience I have had a restaurant. Upon arrival we go to the host stand and say we ","useful":0,"cool":0},"57BDA1jvPQ9pNUQD7t5psg":{"text":"Very nice sports bar as far as appearance! But the food barely held up. The deviled eggs a","useful":0,"cool":0},"TgNfsSitXGTqOg-64bdEjw":{"text":"Eh...so my boyfriends parents had been talking about this place opening up for ages - and ","useful":0,"cool":0},"jktexnE7eCnGYALV1VBjpQ":{"text":"I would say don't eat here just drink here except the drink prices are more expensive than","useful":3,"cool":1},"3MiTvmp4aKTJit-knzL0Qg":{"text":"Due to having complimentary meals from the casino I have eaten here several times in the p","useful":0,"cool":0},"lHvKWhlUCKt9kT347SJu3g":{"text":"Reading the reviews I was hesitant to try this place out with my group of friends.we walke","useful":0,"cool":0},"2m7eom8QiSRjv0tvqDxrdg":{"text":"This was our second visit to Manning's, the first was right after it opened and it was.. j","useful":0,"cool":0},"xwN96Dmr3NaIIl6QImTgzw":{"text":"I would honestly write a negative review if I could. First off, we walk in the restaurant ","useful":0,"cool":0},"vdn6MuQVu9X17JUPUIlwnQ":{"text":"Manning's has some of the best grits I've ever eaten and you bet your ever-expanding a$$ t","useful":19,"cool":12},"Is4WyPwlkrczQUfRBacxnQ":{"text":"Went for lunch here. Was hardly anyone in the place but it was on a Tuesday. Had an Archie","useful":0,"cool":0},"PolUD4GsRVz0qK856jfuCA":{"text":"Absolutely awful service. Must be new management. Food quality was sub par. Pulled pork na","useful":0,"cool":0},"rSg1s4KEZYhiDLnvoIS0aQ":{"text":"Went for game day this past weekend and had a great time. I have a weird drink I order and","useful":0,"cool":0},"vKOqZGzKU8Fp5PQCKLXZCQ":{"text":"Server was very informative. Food seemed to take longer than I should have since they were","useful":0,"cool":0},"2BrGde5qE1zZlnr-mxnNuQ":{"text":"There are LOTS of video screens in this place. We came on for dinner and a few beers. It w","useful":0,"cool":0},"iEa5LSvMYbfJVwIGpHn8FQ":{"text":"This restaurant was absolutely fabulous as far as service and cleanliness is concerned. Th","useful":0,"cool":0},"XK-9V8XJfKlOvbksP7OQ0A":{"text":"Good atmosphere. Tv's everywhere with a great layout. Food is not that great. I've dined t","useful":1,"cool":0},"8DK3Y89-i-xNtrLu3JyqjQ":{"text":"Service was excellent. Food was standard fare, but good. The best part of the bar (the onl","useful":0,"cool":0},"YJp4Z24vVDBt3DkBjNyvVA":{"text":"Beware...the reclining seats are not free!\n\nWe had people in town from San Diego for the C","useful":6,"cool":0},"P5lmaXSXhQFMJCMinT0dnw":{"text":"This was the ideal place to catch a game, especially if you worship the Manning family as ","useful":1,"cool":0},"OBWC3xaQ_Ugsajh1LmxqIg":{"text":"Food is good, but endless wait for the food.\nBest, you already order while you wait for a ","useful":0,"cool":0},"0pGPiilI1264j5SqRDIVYg":{"text":"The entire Manning's team did a wonderful job hosting our party of 37 people. We had some ","useful":1,"cool":1},"kdOBzFgVw5m065QGpc4miQ":{"text":"Disappointed. I used to enjoy this spot. Drinking glasses were really spotty almost seamed","useful":0,"cool":1},"_tTpYAHMviCskfXzkb0JDw":{"text":"Horrible food that came out cold and bland. Food was sent back and came out cold the secon","useful":0,"cool":0},"thI3bjsn8C9RqY2OQXIA-Q":{"text":"Great atmosphere, friendly staff, tasty drinks and good food for what it was, bar food. Th","useful":0,"cool":0},"XNzJPozK3hNAiGp5EV9kGw":{"text":"The pork nachos are watery and kinda gross but still edible. Come for happy hour as the dr","useful":1,"cool":0},"mDAW3Be1WSW89FOfh4PVFg":{"text":"A group of us had reservations at Mannings at the end of French Quarter Fest. They were ve","useful":0,"cool":0},"hU4GQKZoM4WSSmz3VAaqiQ":{"text":"Luv luv this place. Touchdown margaritas and bloody marys were wonderful. Very nice little","useful":0,"cool":0},"TNsHfzsUiNqWasVI1G52Cg":{"text":"The food I had was awesome but very pricey.  It was very clear the staff were not happy to","useful":2,"cool":0},"OW2ykl27xcqT2Rr0ADQtWw":{"text":"Food was okay, the pulled pork was sandwich was not hot and the bbq sauce was very sweet. ","useful":0,"cool":0},"LqO6PL24jL2Ss8_WUZ_N9A":{"text":"Seriously awful.  Whenever Manning's first opened, I could get over the awful service and ","useful":0,"cool":0},"Grb8h_oXnDfyhnpZprLPiQ":{"text":"I was very impressed with the food here. I came in expecting it to be average bar food and","useful":0,"cool":0},"wkLM1WxZb_QYUd9e4DTYAQ":{"text":"If my last name was Manning I would be disappointed regardless of whether or not I was par","useful":1,"cool":0},"RbgdxxrZdCOyQnJLlo4v-w":{"text":"Food is very bland and not appealing what al ever. First time at Manning's and defiantly g","useful":0,"cool":0},"sahOFXj326DGO4i8YnAw0Q":{"text":"The only good things about Manning's were the bartender and the NFL ticket. After being se","useful":0,"cool":0},"Q5Oft_P9RsF0TC9XWjyiEQ":{"text":"Foods good for a sports bar. The Wild Caught Catfish Fingers was pretty good. Not fishy at","useful":0,"cool":0},"U0-M2j5Bz6Xbv6Tq91ru2A":{"text":"We checked in and the host wouldn't give us any idea of how long the wait might be. I aske","useful":0,"cool":0},"9I9UwvXTRdHVlO-4hcmA3g":{"text":"My meal was disappointing. A grilled chicken sandwich with NO grilled chicken? I wanted a ","useful":0,"cool":0},"0REjEqOmy8BhBjnlA6L-Mw":{"text":"Pros: Cool tribute to the Manning family's sports accomplishments, TVs everywhere, and out","useful":0,"cool":0},"RPWn1Vr7Ubw9T9hTcfG2PA":{"text":"Great food great times!  Must ask for Q!  She is amazing!  Will be a place to visit EVERY ","useful":0,"cool":0},"RvwXKASJZOtQ9giVV_OUvA":{"text":"Had dinner with several coworkers. Staff was attentive, ambience was nice, but in the priv","useful":0,"cool":0},"cnj4P76zoe2WpALDTPX7JA":{"text":"Ate lunch on patio, fried green tomato salad and pulled pork chilli was delicious, service","useful":0,"cool":0},"U737sGhWMzvhdu4Dduk2uQ":{"text":"What a complete joke! Food is as unimpressive as it gets! Were it not for being backed by ","useful":3,"cool":0},"2jv7KYqW23oTg4JF8bDiTw":{"text":"The good: \nMany options for beer on draft.\nSeems like a busy, hoppin', popular place - my ","useful":0,"cool":0},"JzHgxItbwFsOUxGh3LAezg":{"text":"This place was pretty bad.  If I was named Manning, I would get my name off of it as fast ","useful":4,"cool":0},"-h6iCukU6e88kCoHFF_hHQ":{"text":"HORRIBLE!!!! Absolutely horrible. Unless you want to just drink AVOID Mannings. Horrible s","useful":0,"cool":0},"-Ygehg4u7DMQzeJvXDdMlA":{"text":"Food blah, waiter slow and unattentive. Overpriced. Didn't seem like anyone cared because ","useful":0,"cool":0},"DFWuQHBhIuf3q8-D_IVl_A":{"text":"In NOLA for jazzfest, needed to watch Knicks-Heat game two, saw the ad for Manning's on th","useful":1,"cool":1},"iFGLwrqLoJ6oCRDg-z0Aew":{"text":"First place we tried on our trip. I wasn't to impressed with there menu but seating outdoo","useful":0,"cool":0},"f570hNUcmv5EVg8DyUPpNQ":{"text":"We were here for almost two full days for March Madness and the entire staff was great! Ou","useful":0,"cool":0},"MuD3sn6D_TvVPmpaWs_qTQ":{"text":"From the outside, a typical looking sports bar. Come in and try the food  and I promise yo","useful":0,"cool":0},"GE9tFykOkpYzHYmFuxoAzQ":{"text":"This is no doubt the worst food I have ever attempted to eat in NOLA. I can only assume th","useful":1,"cool":0},"9o-ipIL5f3kHY3DFGPq6sA":{"text":"Everyone so friendly!  Delicious BBQ shrimp with grit cakes and Manning pineapple mojito :","useful":0,"cool":0},"uQRiJEB_J_8gk8LrDpICJg":{"text":"This is the first time I have ever ' yelped' but my experience was so unpleasant I had to ","useful":0,"cool":0},"FmYRJpY7Uwtw_LPEM67aWg":{"text":"Had the ribeye steak. It was cooked perfectly! Had the apple bread pudding. Awesome! The s","useful":0,"cool":0},"RylkqXdsnbcqi8l_wQtenQ":{"text":"I was looking for a place to catch the Astros/Dodgers game on a regional channel that my h","useful":1,"cool":1},"F1fKocsEeWj68JAfvLm2Vw":{"text":"Chef Mike was awesome! He was friendly & personable. He guaranteed me there would be crawf","useful":0,"cool":0},"uaV-lIpWuYHBjyH1bB2v2Q":{"text":"Well. I was starving so I stopped here for lunch. It is near the hotel and near the french","useful":1,"cool":0},"UEVseWCwvHiIWBqsFv2Dcg":{"text":"Very disappointed. I booked a reservation for Super Bowl Sunday in November and was told t","useful":2,"cool":0},"3dU_n9dBCvDTNPm--G6Trw":{"text":"After being at Harrah's across the street our group came in for a quick dinner. We came in","useful":0,"cool":0},"dLUdLpDeSdZzWr0oxPlfAg":{"text":"Do not fall for the appeal of going to the Manning family restaurant. It is a total touris","useful":0,"cool":0},"UK88PqckRbbTDLEkb7GD_w":{"text":"We went for appetizers and a beer during happy hour. Beer and appetizers, half off, sounds","useful":0,"cool":0},"kg098PeO-4y0IoX0DcAtWA":{"text":"Don't bother coming here to eat. Takes way too long took over an hour to get food and it w","useful":0,"cool":0},"i4I4Hx7KHJmzrhNewaa4Dw":{"text":"While the waitress was nice, the service was terrible.  Nobody helps anyone else, so your ","useful":0,"cool":0},"HlDQ5bOehwhbnhvRwg2l8g":{"text":"When we got here, there was a good wait of 20-25 mins they said for a table for 2, which w","useful":5,"cool":3},"KqbxqQUlGVrzHMo-oQ4TSg":{"text":"Thinking this place was just another sports bar.  Wow, was I ever wrong.  First the hostes","useful":0,"cool":0},"yfhXiClwSjgcTUQmYcsAYA":{"text":"I recently visited Mannings restaurant during a road trip to New Orleans. My family and I ","useful":0,"cool":0},"vX8-AWGFYW_7lAnCXI6Krw":{"text":"Nice clean place with reasonable prices.  Great place to watch a game.  Had the fries pick","useful":1,"cool":0},"BIYhau6z0ie-f5UthZOGow":{"text":"There is a good selection of bar foods and southern cuisine, which gives tourist a good sa","useful":0,"cool":0},"n996Tw9WL39-WcVVB2nRZw":{"text":"Great sports bar! Big screen outside showing football, with open windows for ordering at t","useful":0,"cool":0},"84cVijCUzYNsv4ZS84i7DA":{"text":"The staff and management were extremely friendly and super nice. The meal was excellent!  ","useful":1,"cool":0},"Gu8rCInFVEmLAxIj66_5ug":{"text":"Too bad a respectable NOLA family is associated with this mediocre offering. Arrogant wait","useful":0,"cool":0},"1k_Z36WvwcVz0KSbOwSKFw":{"text":"Another sports bar....and a welcomed one in this tourist trap!  The staff is friendly, foo","useful":5,"cool":2},"RICzsesgTCpthPaF2YcVlQ":{"text":"Great service.  My husband spilled his tea & it went into my purse!  Two waiters grabbed i","useful":0,"cool":0},"MQVJ0vHr1_SOBRKjE_TtDA":{"text":"Wow. So disappointed. Redfish poboy was bland and the bread was disappointing. The nachos ","useful":0,"cool":0},"TcCXhPsxTRT9i_PetDsiKQ":{"text":"Ice cold delicious beer with great service but mediocre food. Might come back for sheer no","useful":1,"cool":1},"aa7ArfMlo2pODUW7MFY4AA":{"text":"Disappointing unfortunately. Our server took our order and that is the last we saw her unt","useful":0,"cool":0},"VJo317Gl-mgJnggHqlMPFg":{"text":"Lots of TV screens to monitor every and all athletic events-it was a plus for us as we wer","useful":0,"cool":0},"1bNhoVZ3eFynrvOLW7ezKg":{"text":"I really enjoyed our meal here! We had a large group of 8 teens and 2 adults and they had ","useful":0,"cool":0},"Gbekykry0mdAokx96yufjw":{"text":"I don't get the bad reviews at all. I've been twice this week and the food is banging! I'd","useful":0,"cool":0},"Nc3Jj5GtoHdymDqEjhjODQ":{"text":"Waited 15 min yo be seated at 2 PM,  while the restaurant was empty. Then waited 15 more f","useful":2,"cool":0},"tR2Ipe8iGDxWJKoULq7XCw":{"text":"The food is very good actually for a sports bar. However the service for the price of the ","useful":0,"cool":0},"jtAtsQzH_xg-LVjIegl8HQ":{"text":"Terrible. I ate here on my vacation to New Orleans and got good poisoning and it ruined my","useful":0,"cool":0},"Rz8R4v0YF8AZxSHlndRlpg":{"text":"If you are going here for the TV's and beer you are going to the right spot. If you want t","useful":0,"cool":0},"OaERhM6yKSTzPsVQaZq8CQ":{"text":"We've been here a few times. My biggest problem with this place is the small menu. Now tha","useful":1,"cool":0},"-PnN5tTJrwP_Xm3gk7uiNQ":{"text":"This place used to be special. Not any more. Blah menu. Slow service.\nMy order got messed ","useful":1,"cool":0},"tdS9CZKB3ElpHKKShFzrDg":{"text":"We came here to watch Giants game!  The beers were cheap and the food was better than expe","useful":0,"cool":0},"LNiUUo5Tl0YW0iEGFdjytA":{"text":"My husband is a big fan of the Mannings and wanted to eat here.  I was pleasantly surprise","useful":0,"cool":0},"WQSTkBzWhZ1s3hLb9bOn7w":{"text":"Really disappointing - Sysco caliber crap. Shocked the Mannings would put something so sub","useful":0,"cool":0},"lMeEF-27_trwmQGNzKffqg":{"text":"Food was terrible.  Shrimp gumbo was the worst we had in New Orleans. It was watery and bl","useful":0,"cool":1},"KFVKYpBT792bC30gD-QMKQ":{"text":"Expensive bar food. Wouldn't accept a large reservation (10) on a week night so we had to ","useful":0,"cool":0},"bhWfaZ6uFIkZ9o8szfdmfA":{"text":"This place is not good. Service is very slow and the food is mediocre. In a city known for","useful":0,"cool":0},"sxx-BGt49aiVoxW8CNyxLw":{"text":"Very cool place! Fun! Our server was good! The food is fine, nothing great. Burgers were g","useful":0,"cool":0},"jh5rL5xRZaLocAoWBuQuEQ":{"text":"The whole place felt like a glorified Applebee's. The service was very ok, the food was su","useful":1,"cool":0},"feq7US2rJe8gouYBpuSccA":{"text":"Great food and nice, loud atmosphere.  During Mardi. Gras you want someplace comfortable a","useful":0,"cool":0},"RA8xO_Zy_DulLFB_r9BXaA":{"text":"First time in NOLA and wanted to try different restaurants. Came to Manning's because of t","useful":0,"cool":0},"UVmekvVrT_Gf69qH_KkH8Q":{"text":"My husband and I had a great experience here. I am a vegan so I look at menus before sitti","useful":2,"cool":0},"fzVI1C85DPrCdqJLM6JXqg":{"text":"The hostess was a ditz.  I asked how long for a table of two and she told me 5 minutes.  S","useful":0,"cool":0},"It_j5pNfM4sC7MwD4PsleA":{"text":"Cold food, horrible will never go back. Manager needs to read reviews and make corrections","useful":0,"cool":0},"zfvDIfplz62Y7wv16Eggjg":{"text":"Great place for a Sunday funday! Food is average. Make sure you sit in the lounge vhairs4","useful":0,"cool":0},"XWfohetg1xpw81sOzSQ3zQ":{"text":"Been to Manning's a few times before just for bar service. I took my family there to watch","useful":0,"cool":0},"eG4x5kbV3hC0j39UlYTMnw":{"text":"Really nothing to write home about this place. I really wanted to like this place because ","useful":0,"cool":0},"rajTQuEEeT-O9wy30DIyZA":{"text":"I love the fact that this is owned by the dad of the Mannings crew! I am a huge football f","useful":0,"cool":0},"U6CawiHJ_WwPuRn6TWsHjA":{"text":"Food is great and service is just as good.  The jambalaya is AMAZING!!","useful":0,"cool":0},"yVmWufMuN0JmWeWjfG55Sg":{"text":"Overpriced mediocre food. Ordered an $8 \"bowl\" of gumbo that was the size of a cup and hal","useful":1,"cool":0},"UutgfzG0Kz1iemjJxoScJg":{"text":"Placed a reservation at 10 am Sunday morning for the Broncos game at 3 pm on the big scree","useful":0,"cool":0},"Y1X_UD-HQq2lF8eJnZHjNg":{"text":"Just came to watch a Broncos game and they said it would be on a smaller screen. They said","useful":0,"cool":0},"v-2TF1NYOxMCl59Qo0NRow":{"text":"As a sports fan my husband gives this 5 stars. Standard bar food. But excellent viewing of","useful":0,"cool":0},"ikViKj0QCmATNRftw-W2Lw":{"text":"I'm giving 4 stars for customer service by Chris.  Kitchen was real slow but Chris went ou","useful":0,"cool":0},"2B7JwnytF1QCAfVIqYdIiA":{"text":"Great people, great atmosphere and great food! Quasha was a true gem! She was so fun and s","useful":0,"cool":0},"e23tAmp4sHNtAbnPHkP-3g":{"text":"Worst sports bar in the continental US.  Food is horrible, how do you screw up wings?  The","useful":0,"cool":0},"cVXzMHM3IMMAkO1oYYFdjg":{"text":"I gave Manning's one star because I can't give it a zero!\n\nWe wound up not even eating the","useful":1,"cool":0},"JcbiP5F5A4ioCUa_zwLSSQ":{"text":"Tried the nacho's. horrible choice. The chips were soggy. All of the toppings were on one ","useful":1,"cool":0},"BhXHuZYWkG7cS_JiXBflmw":{"text":"The venue completely fits with the Fulton Street vibe of sidewalk cafe and offers somethin","useful":4,"cool":3},"7lyHAvJTEPQTkTB3D82PyQ":{"text":"The lovely servers took good care of my with gracious Southern hospitality.  We wanted to ","useful":0,"cool":0},"VERvUHJaN1-KOcwinlbcxw":{"text":"The food is incredibly good! I give it 3 stars just because it was so yummy!! \n\nUnfortunat","useful":1,"cool":0},"DIREbS7N4R9YjU5hziJNhQ":{"text":"I'll preface this review that my three stars is probably a bit generous since my meal was ","useful":0,"cool":0},"eaQV4ZWdUpsH84_cmkeevw":{"text":"Excellent place to eat. \nHad dinner with my son and girlfriend.\nGood service.\nRecommend an","useful":0,"cool":0},"VQMKklqwL0qnUUySdGmpAQ":{"text":"Upon arriving I was pretty excited. It looked really nice with a great atmosphere. We put ","useful":0,"cool":0},"NLM-EfbMXHdPXpdkP1boDg":{"text":"Great sports bar with stellar food. TVs galore with an amazing outdoor patio area. \nVIP ar","useful":0,"cool":1},"9GMV1Pb2y-woBKxHhTkrsA":{"text":"First impression upon walking in is that the place is huge and they have more TV's than yo","useful":3,"cool":1},"vMkyQqNmAQLhLaCB763oyQ":{"text":"Just plain bad menu for this or any location in fact, but the food options don't work. Who","useful":0,"cool":0},"SzdE4IUHCs9k1CHh7Z_p1Q":{"text":"I went to the Restaurant because it is in a great location and I am a big fan of the Manni","useful":0,"cool":0},"JVLqJJN5aKkQY6PjWqDeOQ":{"text":"For an all star family of quarterbacks to have their name of this restaurant is sad. The f","useful":0,"cool":0},"SUb_AOOnrIKgfcCeaSNHlQ":{"text":"It took an hour and twenty minutes to get our order. The waitress was very apathetic. We h","useful":0,"cool":0},"DxEvXgwhU8bhMjsI-VByaQ":{"text":"Disappointing drinks and food. Sangria tasted like cough medicine. Burger came out of an a","useful":0,"cool":0},"r6pZ_fis_OmQUzTTUYjT3A":{"text":"Best sangria i have had in a long time, came here for lunch and loved having all the games","useful":0,"cool":0},"LopNYzuwB2S2hsbpzwY5cQ":{"text":"This has to be the worst restaurant I've ever been to.The food was the most vile thing I'v","useful":0,"cool":0},"M9zByUiFy2z578YtIWVe1A":{"text":"Food was amazing!! The service was amazing too!! Ashley was so attentive and thoughtful!!!","useful":0,"cool":0},"TeV_xomSLwd4J7UDpOBmWQ":{"text":"Drinks were bad, really watery. Food worse. Service slow. My friend couldn't eat more than","useful":0,"cool":0},"eXX688zl-50WAHo2ZWPBrg":{"text":"We had a group of 8, which isn't hard to accommodate here. We were told we would have a 30","useful":0,"cool":0},"Z6CB61BIeNXOwwdq6-cHdQ":{"text":"Theater style seating to watch a ball game.  You cannot beat it.  The outsoor courtyard is","useful":0,"cool":0},"liX6jcRluqe5mTdbOES33w":{"text":"Great location, service and food!  The seafood special, gumbo, and shrimp po boy were grea","useful":0,"cool":0},"5PLJ9t72aq84f_zYZE4r0Q":{"text":"Good food, attentive service. Got to interact with Archie, which was cool. If you go on We","useful":0,"cool":1},"4mTZGsKRBywA1qvrYCQmvw":{"text":"Service at the bar was poor. When my glass is empty I'm used to some help. It was so poor ","useful":0,"cool":0},"0ggZsp_FOlNkEmUXFwcZ8Q":{"text":"Great atmosphere to watch a ball game.  Went there to watch the A.L. playoffs on their 15f","useful":0,"cool":0},"sh14xOX95xNUZFpH9wg5Ag":{"text":"Sitting outside watching the LSU/A&M. There are very uncomfortable wicker chairs and couch","useful":0,"cool":0},"J9jzBZNqy8Z03NKIx0YOqQ":{"text":"Well my friends and I stopped here for a breather on our bike ride last night  and recieve","useful":1,"cool":0},"NnYJEOyLn0tgET9TdAzJgw":{"text":"The bar menu is not great and the food was average. The nachos were mostly covered in chee","useful":0,"cool":0},"3ITM-v_kMV3BO2sxGnwZQA":{"text":"Mannings is one of my favorite places to come and watch a game in New Orleans. They have a","useful":3,"cool":2},"5lAORAU4OHJUsnqOXoHFtw":{"text":"Hostess sat us down at our table and 20 minutes later no server came by our table, Servers","useful":0,"cool":0},"EzmrkcBC9vgSlqcI7kEAYA":{"text":"Decent bar food - the sweet corn pudding is worth the trip alone. Good place to go when th","useful":2,"cool":0},"1sHD6HGDlKMTzAtvu02icA":{"text":"Sorry Archie. loved your football days and respect your boys but your restaurant needs hel","useful":0,"cool":0},"niKuHPql_1WmPb_sSj5RSg":{"text":"Went in on a Sunday to watch football. They were not overly busy even though the Saints ga","useful":0,"cool":1},"lI5hDE2gvP6iySriiEEqUQ":{"text":"I was pretty disappointed with this place.  I had expectations that this would be a cool s","useful":4,"cool":1},"-s_xW1jSLaWl5emkae605Q":{"text":"Horribly managed.  One of the worst sports bars I've ever been to in the country.  30 TVs'","useful":0,"cool":0},"6Pb2FBHv-V5z3EZoWBcPHQ":{"text":"If you're staying nearby, Manning's is fine as a sports bar - plenty of TVs and drink choi","useful":3,"cool":1},"Kh4HmIyxxgA_OOuaTywcOQ":{"text":"Poor food and service. Was not impressed.\nThe crab claws were tough and dry. They forgot t","useful":2,"cool":0},"hJyt1quYziQtYJigKY4RRw":{"text":"Food wasn't too bad and service wasn't too bad after a shaky start where I waited for what","useful":0,"cool":0},"k_BMrgbj6vEo_TOqd_S0cQ":{"text":"A huge let down! Not only was service nonexistent, the food was disappointing and overpric","useful":1,"cool":0},"F-7E1V_sLaYsoAXg64_3ew":{"text":"Waited almost two hours for a table, which we understood because it was a Saturday but tur","useful":0,"cool":0},"NvteHLE2FOq_CABsa_tdWQ":{"text":"The restaurant is filthy and the food is terrible.  The entrance doors are dirty and so ar","useful":0,"cool":0},"5srk5yomX5VxIN12QsYFzw":{"text":"Had the BLT and It was really bad.  Friend had the French Dip and said it was fair.  Been ","useful":1,"cool":0},"DEfYpLBqLVyBhHq2cTk9_g":{"text":"So disappointed that Manning's has lost its charm and become an arcade! When it opened, it","useful":1,"cool":0},"lDmYY0c_ah0040-AFyluTA":{"text":"I took my best friend from out of town to Manning's Sunday afternoon just to show her the ","useful":0,"cool":0},"7oVWlS7PUa6gOUJg8_Fk6g":{"text":"This place is just... forgettable. I went once and sat inside. The burger was juicy, fresh","useful":0,"cool":0},"G5vdv7A887AbTETdqsd-eQ":{"text":"As a sports bar, its very fancy-schmancy. Like the kind of sports bar a girly-girl (like m","useful":4,"cool":0},"SQhi9--AgfVtL8ifSeFqbw":{"text":"We were seated immediately!  The service was great.  The duck wings are a must!!","useful":0,"cool":0},"WDFmHwk5cwuI_MkY90jk6g":{"text":"Terrible service. Bartender was rude. And hostess laughed at us when we told her we had a ","useful":0,"cool":0},"PlhHzpvr1Czyg1viWudDMQ":{"text":"Stopped in for drinks and a light lunch with the kids.  Saw the very inviting movie theate","useful":0,"cool":0},"au6ni3gc_QIc2zKsNiUnrg":{"text":"A great place to go and watch the games if you are able to tolerate the most deplorable se","useful":0,"cool":0},"FyQ_3gQRAiDg3nIly7fJLQ":{"text":"Great Service by Fleming. Very attentive throughout the dining experience! Archie burger w","useful":0,"cool":0},"lQt8BPjglGkP27G2ThIIcQ":{"text":"We were super disappointed, the service was poor, the music and TVs were too loud. Prices ","useful":0,"cool":0},"tH_FuNnFajX4MMTwrHEU-Q":{"text":"I WAS DENIED A TABLE - \nI was in town for a convention (like everyone else in New Orleans)","useful":1,"cool":0},"u3bpDu3Ugiem6Vus42FiOQ":{"text":"Wow. What a waste of our vacation time. We arrived on a Saturday at 6p to watch the UK gam","useful":4,"cool":0},"25tuYix0fiEwhpSiTqcRVQ":{"text":"Was watching the Saints game Thur nite upstairs.  Nobody gets the recipe for a Gibson mart","useful":0,"cool":0},"WB6PpttXyFePaTQmVTUtMQ":{"text":"Lacey was an amazing server however, the overall service from the hostess to the managers ","useful":0,"cool":0},"4Zg8fUuPAQszBI2Jnah_TQ":{"text":"Manning's was the first place I hit in New Orleans.  I returned 2 additional times.  The f","useful":0,"cool":1},"UupRdbVoiseQ41niYJlSKg":{"text":"Three stars for the food and service. Shrimp poboy was tasty. Had to suffer through a LSU ","useful":0,"cool":0},"zEM1KqzUO8dNJRptILX9PA":{"text":"I wouldn't know how the food tasted. Went there while in town for Mardi Gras. Was told the","useful":0,"cool":0},"v4rlThSOUk2XBuLms4oJAg":{"text":"We stopped in for happy hour (since there arent many places in NOLA with a happy hour). Th","useful":0,"cool":0},"izIXYpVEJSMzN9XhePYjIw":{"text":"I decided to visit this place because I heard it was a great place to watch football.  Wel","useful":4,"cool":0},"oX69Y2Ft1kOcWwO3GFRj3Q":{"text":"Absolutely the worst service I have ever had in my entire life. I spent 2 hours waiting on","useful":0,"cool":0},"CydmVbuRWToMGpzh1NDjFA":{"text":"The atmosphere is cool, but don't get the pork chop it's way too dry you can't even cut it","useful":0,"cool":0},"cM3YmZ3YdHNc2SAo_mlAyA":{"text":"We were staying at Harrah's and decided to try Manning's,especially since they accept comp","useful":0,"cool":0},"s_AgoIOl8bxduyLyh_U8nA":{"text":"Great food pretzel bites are a great starter the dipping sauce could've been a little thic","useful":0,"cool":0},"FcJIO3zUnNHNI-eSeeyLKA":{"text":"I had no preconceived notions about Mannings other than a slight disdain at all the Ole Mi","useful":1,"cool":0},"LJ_YvlztUg0Tlko-3JP-7g":{"text":"New Orleans style sports bar.  Food is good not great.  Brown Snapper cocktail is worth th","useful":0,"cool":0},"At6pJzDqnNLBfTKosxb76A":{"text":"If you are a fan of the Manning family - then by all means pop in and check it out. Grab y","useful":4,"cool":0},"zTN_E1q9KY-IbNH2T_5SKA":{"text":"Terrible service at the bar ... Waited 10 minutes without our order taken so we just walke","useful":0,"cool":0},"B0BnTEEec_BARF-6VrIK4Q":{"text":"Poor service, food was just ok. Given the other options in the area it's a tad overpriced ","useful":1,"cool":0},"JDlOOTVb23kAtYbYKQ3kuw":{"text":"First off, this is a sports bar.  Yes, a sports bar with po-boys and owned by the widely l","useful":0,"cool":0},"iSZxnvs9gjmCE8EC1mXUDg":{"text":"I'm only giving 4 stars due to service and on such a beautiful day NO patio service.  Food","useful":0,"cool":0},"oV846YxGrMcCaHcng5Zc3g":{"text":"boring expensive tasteless food. But massive indoor and outdoor TVs make the place worth a","useful":0,"cool":0},"Q3KbQWeoAZnEtQyJMIWbGw":{"text":"Great sports environment with good tasting food. I wasn't going to eat here because the lo","useful":0,"cool":0},"Qz6KpzpbKeZxWnutfsSnLw":{"text":"Great atmosphere, great service, and just okay food. It is located on a clean street and i","useful":0,"cool":0},"0_hFfipcKaAO3JFRUGSpZw":{"text":"I wrote a review back in January of this year and it was not positive. I have since return","useful":0,"cool":0},"z7UnL1mMVVrnZA4W6T7PPw":{"text":"We had a great time at Mannings.  The staff was so very nice.  Camille the bartender was a","useful":0,"cool":0},"IkCg9b1UY_SzDsfD0orQ0A":{"text":"You'll find good, sports bar food and friendly service at Manning's.  My wife loved her ch","useful":0,"cool":0},"_yoiUeZ1dISlVnod-zaqww":{"text":"The food is okay. Could be way better. The atmosphere and drinks are better than the food.","useful":0,"cool":0},"5YFcsN8mb7X6uH4d6JlcWA":{"text":"Very slow service.  Average food.  Good place to watch football. That's the only reason I ","useful":0,"cool":0},"b_VdfYB-K9amNBZ8GgkyuQ":{"text":"A little disappointed.  Go there today around  11am. No oysters No crab claws and the kick","useful":0,"cool":0},"JcvokLIrXZw78o9cQwAh-Q":{"text":"Place was dead although mid week not surprised. Shane our bartender was a fun guy for the ","useful":0,"cool":0},"4m_sNfuDEBX4qUG9PCeOSg":{"text":"My wife and I enjoyed our meals. Our server, Jamie, recommended the beignets because she s","useful":0,"cool":0},"TheeLf7-0a7FEjYYSt4OjA":{"text":"HORRIBLE FOOD! I am not kidding when I say the food is some of the worst food I ever ate! ","useful":0,"cool":0},"P43BEnlO_oRLOZUjipKbuw":{"text":"I'm surprised there's not a Drew Brees restaurant in New Orleans and so was our server! I ","useful":0,"cool":0},"pWBSMs4ooX0ew1dL7AgLlg":{"text":"This is a review of the bar.\n\nAfter leaving 12 Bar, but wanting more drinks, a friend and ","useful":3,"cool":0},"dgPnZge2V4LtxWmqmHSZeA":{"text":"Went last night with a group of nine people. Immediate seating which is nice.  Food averag","useful":0,"cool":0},"JkZ2Pfo53OhmpMNidc94tg":{"text":"Great place to watch sports. Tons of TV's and pretty good food. The wings were good, the F","useful":0,"cool":0},"o4YcjXddBpmtr06TPx9xpA":{"text":"Didnt have no more Alligator Sausage which was a bummer. Had the Shrimp Po Boy which was a","useful":1,"cool":0},"WoJlHQMA8th9rw_l8B5hxw":{"text":"First of all, great atmosphere to watch sports. Lots of tvs, and all games were on. The pa","useful":0,"cool":0},"96EutNh2Hkxc71CK9HQndw":{"text":"Giant, super-loud sports bar. Average food. If your game is on, it's a solid choice. If yo","useful":0,"cool":0},"56eb3CjaRpc9BCHVMi20XQ":{"text":"We reserved a couple of the recliners to watch  LSU in the Chick-fil-A bowl on New Year's ","useful":0,"cool":0},"CTff17EvmXeqJntfb4YRSA":{"text":"Just returned from a weekend trip to New Orleans. On our first night, we stopped into Mann","useful":0,"cool":0},"4XrV1oKW4Ohz4jVYXlxQWg":{"text":"7 hungry gals found a great place to dine in The Warehouse District. We had a 15 minute wa","useful":0,"cool":0},"2rlrKPAPK8iQrlR3F-4pAg":{"text":"We found ourselves needing a quick dinner and Manning's was RIGHT by the condo we rented. ","useful":0,"cool":0},"72iEB7VGgIgtb4_-OmOzKg":{"text":"Very good experience here!  I was a little worried after reading the reviews!  Lunch was d","useful":1,"cool":0},"ya8GWOasuzHN9knYrVVTpg":{"text":"I feel like 2 stars is generous, but it's clearly better than a McDonald's.   Maybe Archie","useful":0,"cool":0},"eLVKPbqBnEotjgYjMyTtlQ":{"text":"What a waste of space on Earth! These guys need to stick to football.  Food is expensive a","useful":1,"cool":0},"mLZfTBMDfi_-MlWX6aW65w":{"text":"Ok ok, since the last time I've been there I have discovered new menu items such as cochon","useful":0,"cool":1},"hk2K2c4f5fWl8LARxNpsBQ":{"text":"I just walked out of there, the waiter at the bar (Hottie 10) was awesome, the beer was ni","useful":0,"cool":0},"AEwQTN9cpQtT4sxd29SB-w":{"text":"Had a great meal yesterday at Manning's. We had a huge group (14 people) but our server Ma","useful":0,"cool":0},"Q6LZPxYzaxFSas4CKBpuWg":{"text":"My third visit, will be back again before I head out over the weekend. Easy, quick, consis","useful":0,"cool":0},"ohDYHwF4uh4LAKIsPeLEQw":{"text":"We visited the bar after our cruise. The food and service were both great! The portions ar","useful":0,"cool":1},"wojtC3DmhICFdQIA_RKhfA":{"text":"Food very good, prices good, Beignets AMAZING.. BEST IN NOLA. \n. \nThe ceaser chicken salad","useful":0,"cool":1},"pHTVA873yC6W0mwHvZGFog":{"text":"The restaurant and tv selection were great.  BUT, the food was barely edible and the servi","useful":0,"cool":0},"JM1-RaNLJS9SHOKP9EzQzw":{"text":"Awesome service and food.  I've been here 5 times and this was the absolute best service I","useful":0,"cool":0},"cvrXpwEJr2MVcAA2KhnT2g":{"text":"Went to Mannings for lunch today. I will never get that hour of my life back. PLEASE do yo","useful":0,"cool":0},"9WwxoZ2JJ1meuKq573eWww":{"text":"If you are looking for a shrine to the Manning's, this is the place! Lots of great memorab","useful":0,"cool":0},"1TBXOG4wO90CqYLkhp-ZpQ":{"text":"Blah.  Just another sports bar and an unimpressive one at that.  I am not going to waste t","useful":5,"cool":1},"Jka4e7HABIBh5qBQOQ8mmw":{"text":"it was just ok.  Not bad and not exceptional.  We stopped in for an early dinner on a Frid","useful":2,"cool":0},"n72CE9Thvi92IjVKOxhLGw":{"text":"Too bad there are so many reviews that don't give Mannings the credit deserved.  Great atm","useful":1,"cool":2},"yEFJBdrd03gaDMcHK-c2oQ":{"text":"thought was a pretty cool place to watch the football game. food a little over priced. the","useful":0,"cool":0},"MOLJoo9RvR3b7eH8Tobc3w":{"text":"GREAT LOCATION JUST NEEDED TO EXECUTE  nothing I mean nothing gets under my skin more than","useful":0,"cool":0},"DLiekkThNVkoKErpxtFxlQ":{"text":"7 of us were in town from North Mississippi area (Oxford is also Manning country). We went","useful":0,"cool":0},"2DtwlFwqo_xGrMp8wvMIQg":{"text":"Great game day atmosphere with tons of TVs. Had a bit of trouble getting seated but after ","useful":0,"cool":0},"wefeH9qvVKsGfWOZ9W8ZAA":{"text":"GREAT LOCATION JUST NEEDED TO EXECUTE  nothing I mean nothing gets under my skin more than","useful":0,"cool":0},"6YyOzJO--zeOIYl5eFYVAQ":{"text":"I'm sure these are lovely people, but you are in New Orleans.  Go out and find some local ","useful":0,"cool":0},"fg6U0GTwa1sKmy42Cp6GQQ":{"text":"My grandson wanted to go here for his 17th birthday.  What a disappointment!  Fried pickle","useful":0,"cool":0},"2yHgjZp3ZdxY-Qy4VMDAKA":{"text":"We were staying at the hotel and ended up here for dinner when we found out that we couldn","useful":0,"cool":0},"eH_KBPeS30gKVBY-6gPksA":{"text":"Do not enter. Worse service in the quarter! It seems that the waiter could care less about","useful":0,"cool":0},"-y6hGRCVIkjWTXrn86OkOA":{"text":"Not a bad place, but it definitely has the feel of a chain restaurant. I had the filet mig","useful":3,"cool":1},"XtKKofWcngUF6Yz7Bg9ZBg":{"text":"Gave this place a three because it's kind of middle of the line and mediocre compared to o","useful":1,"cool":0},"nGmIf0h55NdVQdxAooSM6A":{"text":"Five stars for one of the best sports bars I've been in.  One star for some extraordinaril","useful":2,"cool":0},"IEnisTvP1vhah3IkncqBPA":{"text":"Pretty good sports bar for sports bar food. If tou dont eat meat your options are very lim","useful":0,"cool":0},"R5vjyiM5Z1Jy7huPW_PBow":{"text":"Really poor service. Took an eternity to get seated even though the place was half empty. ","useful":0,"cool":0},"huaiKrbxLGFyQ0fA_mYvMQ":{"text":"Website states happy hour 4-7pm. We slid into bar seats at 6:10 and were informed by the b","useful":3,"cool":0},"keo1Huvi_E_IWv-v096n6g":{"text":"Was there this summer with my spouse celebrating my birthday. We did not eat, but we did g","useful":0,"cool":0},"qEzroCVGXwg6PMvbmn3K5A":{"text":"The food was pretty good, but the service was pretty awful.  There appeared to be one serv","useful":0,"cool":0},"dOelLMDClqC2fesOsK6bbw":{"text":"Was in town for the Labor Day weekend and decided to give this place a try. First and fore","useful":1,"cool":0},"sJSCblRXFhjg6Zi8DSnwtQ":{"text":"Horrible horrible horrible service!!! Been here waiting i ordered my food at 1:42 its now ","useful":0,"cool":0},"Z_uabqZh-IByFfUXh1kpJQ":{"text":"Its either the service or the crowd that sucks. But its no fun either way. Pimm's cup, whi","useful":0,"cool":0},"C-x9HSHomW6zyp_sZV5rIw":{"text":"This is a cool place.  A friend and I were in the area, so we decided to stop in and take ","useful":10,"cool":6},"NLw9iBJvVXIqC2Keap9n9w":{"text":"Waited over an hour and a half. Our table was called at 8:34 pm we were then told we could","useful":0,"cool":0},"GDM0sFaut5Yppm_nS7SRCQ":{"text":"I'm only rating this place 4 stars taking their happy hour into account. \n\nI did not order","useful":0,"cool":0},"YgnhzYxZuk7WJvUrtcqK5g":{"text":"Would be a great place to watch a game but that's really it. The food was mediocre at best","useful":0,"cool":0},"vEjPUV6gmeJkmmM1MSqIYg":{"text":"I had read the reviews, so had low expectations but was hungry and needed a place w/o a wa","useful":1,"cool":0},"mBNNFG1sN89h74_qQBRZjg":{"text":"We came to manning' as a group of seven without a reservation to watch the Warriors game a","useful":0,"cool":0},"u1JwN8AhK36C948hlVzZPQ":{"text":"Cool place to watch the game with cold beer. We ordered hot wings and when it came out we ","useful":0,"cool":0},"j-1Br90qW0_FR_ycZeiVag":{"text":"Never got my sandwich, took forever just to order, and the staff seem very disinterested i","useful":0,"cool":0},"_tIW5TGIOPaoyF2sl6FZ6A":{"text":"Went the weekend it opened and everything ran smoothly for a new restaurant. We got the du","useful":1,"cool":0},"27WBQsOYTFLk_Fr3K6vabA":{"text":"I was really looking forward to trying this place out! The hostess told us that it would b","useful":0,"cool":0},"ABWkfHvShIRPsBoAz21neQ":{"text":"Got a chance to visit while at the ESSENCE festival. Both the food and drink where delish.","useful":1,"cool":1},"qOBH1udpq14VwXei9fOUdQ":{"text":"Manning's should be embarrassed to have their names on this place. Long wait with many emp","useful":0,"cool":0},"WHQ4ymg1QopPyQ2H9nxHhQ":{"text":"Half-off on some food items..and beers...food was great, delish, and large portions, !! Sp","useful":0,"cool":0},"bLlx0ZTg5wnaPFDtoqXbgA":{"text":"The drinks were amazing....the food was even more amazing....but the service SUCKED!!!!! W","useful":0,"cool":0},"9Z3JZY81KP25sVdUgiaplQ":{"text":"Service was great and the atmosphere was certainly appealing to my husband, but the food w","useful":1,"cool":0},"aZ6xm8npSn2rsTjxHHdGdw":{"text":"Got to the empty restaurant around 8:30pm, got seated and ordered drinks and an appetizer.","useful":0,"cool":0},"VYa9qqbzRud1seSkUs5rBQ":{"text":"I was not at all impressed with the food. Ordered a Cajun Style Chicken Breast Sandwich. I","useful":0,"cool":0},"9IR3w2Nxy8tHVRXUx-tC1w":{"text":"Stopped in for drinks and apps after a day at WWII museum during a storm. Huge football fa","useful":0,"cool":0},"PeWkHZfMSUyRX91lb9ZACg":{"text":"Disclaimer: I dislike the Mannings. That whole Eli is too cool for San Diego thing really ","useful":0,"cool":0},"82Go_6Bc5cuK-3-h4Wg70w":{"text":"The menu has changed too many times, no poboy on the menu?!? French dip sandwich meat too ","useful":0,"cool":0},"K-qH2h0AvjXWixuucJV9Sg":{"text":"The atmosphere is incredible! So is the food!! Great place to watch any sports game.. Huge","useful":0,"cool":0},"TlcMcZMWWFhJJ_a5n7FJbA":{"text":"I have to say that I was quite disappointed in Manning's this evening.  I took my wife and","useful":0,"cool":1},"4MLNn-ADM8M8mtkzqhTT3w":{"text":"This  was our third time visiting Manning's.  Our first visit was for my son's 30 birthday","useful":1,"cool":0},"xT-DBYtaXFmy9_JSLLv2vA":{"text":"Atmosphere is Great.  \n\n\nI expected a little more than just alright food. \nI'm sorry for t","useful":0,"cool":0},"Ko6wYXfylI4RgpIA6zbJDw":{"text":"Great food, great beer, but Quasha made it the best ever.  She was wonderful.  Closed it o","useful":0,"cool":0},"IJwVHyUisXFogo0SgDC-qg":{"text":"The prices here are a little higher than average and the service was slow (40 mins for one","useful":0,"cool":0},"JQU6cDXZzL0dbCwSWosLWA":{"text":"We went shortly after noon and it wasn't crowded.  Our server came to our table within a f","useful":0,"cool":0},"DPJZ97K8Cxb7fMVsbRnKXQ":{"text":"Decent service, decent food.  Does not stand out in a crowded warehouse district.","useful":0,"cool":0},"tWdZTkJ3wIbu30EogFQHmg":{"text":"The restaurant looked very cool with lots of TV's and a great place to watch sports. Only ","useful":0,"cool":0},"TTM_q-sHM3z5PPWxj7kNaw":{"text":"We went to Mannings after getting off a cruise to watch Auburn vs LSU before our flight ho","useful":0,"cool":0},"fdc6Rw5ea9It3MyvxbOa6g":{"text":"To celebrate our Christmas party for my staff we made reservations for a party of 12.  The","useful":0,"cool":0},"J2by1N9X24KReIWnOw-CLg":{"text":"Overpriced food that leaves much to be desired. I think my ribs were served on a bed of ri","useful":3,"cool":0},"tSJbEjL2j42DvbcpMEK9kA":{"text":"The staff was really nice and accommodating. The food and beer were pretty good. We happen","useful":1,"cool":1},"HMKMkROw0z8l9n1JLbzMCA":{"text":"Nice area of NOLA... The moment I walked in I told the wifey this is probably the best spo","useful":1,"cool":0},"5jHj4xYhncO68cQCUxMCqQ":{"text":"This is one of my favorite place. Food is fresh and yummy. Nice sports bar. Light music se","useful":0,"cool":0},"ZqZOlaNYktczoCVymXTSKg":{"text":"Best place to watch a football game. Food is ok. Nothing spectacular, but Katie our waitre","useful":0,"cool":0},"1pBqfttbc3ly7TUrihrstQ":{"text":"Really just average IMO...  I wanted to like this place simply because of the very cool st","useful":0,"cool":0},"_eHA9L30ujAKuQ_Qq3to0A":{"text":"After waiting 20 minutes without even being acknowledged, we decided to leave. As we were ","useful":0,"cool":0},"rjsyT199OJhBmJ-NoN_iNA":{"text":"Great sports bar. Enough said. You want to watch sports come here. Here's the deal...\n\nTVs","useful":0,"cool":1},"OVOIKJcjX3tWyRtFveJEoQ":{"text":"No wait time to be seated but we had to wait a little while to get our food. A little pric","useful":0,"cool":0},"bv754p1n5ZMsBmwqJVm68w":{"text":"The two stars is an overall ranking.  5 star for sports watching ambience.  -1 star for th","useful":1,"cool":0},"ryYbBVBeT35nHGw1C4DRfA":{"text":"On a slow night took us forever to get our food and when it came out it was cold.  Was eve","useful":0,"cool":0},"YQT2--X3bMr3vjRaTivtgQ":{"text":"Best restaurant in NOLA during my 8 day trip here. Good food selection and cooked just rig","useful":0,"cool":0},"LlrfwVIfV7IgzEKI9S7smA":{"text":"Nothing special, service ok, food just ok... prices too high for what you get. Inside with","useful":1,"cool":0},"vxoyuvjE1Vpn1cgtoZzo7A":{"text":"Went to Manning's Saturday night w/ another couple& started at the bar.  The bar was great","useful":5,"cool":0},"rKinkXmq7Xftnt-Iqk-0pw":{"text":"This is without a doubt a great sports hangout spot!\nLots of Seating and lots of TV for an","useful":1,"cool":1},"Jibp3Q9EgO1rBqowfOHYDA":{"text":"Delightful experience.  Well above average food, creative pairings, excellent presentation","useful":0,"cool":0},"w2Ky7U2v0aqBL-gdD6MuNA":{"text":"We ate at mannings during mardi gras and we had an amazing server named Kia. She was fun, ","useful":0,"cool":0},"zaSwcDu7Vlo3XjjlHq6V4w":{"text":"This was the most disappointing part of the trip, was eating here! \n\nBeing from the Bay Ar","useful":1,"cool":0},"2x2j0UV5O3-QvORkNUx-_Q":{"text":"When they brought out my burger, I was mindlessly chatting and started eating around the e","useful":0,"cool":0},"ZEuLuBDc3gbllDDQGemdog":{"text":"Great sports bar. Bartender Arlene gave terrible service. Couldn't get her attention. Empt","useful":0,"cool":0},"hdIAWDP9v4YHFD5U592VQQ":{"text":"Two stars because the bloody Mary\nand chicken wings are okay. Beyond the food, this place ","useful":1,"cool":0},"8gk4XKBYTzOvC4hkqzzC1A":{"text":"Waiter was  new and messed up the bar drinks repeatedly even tho we reminded him several t","useful":0,"cool":0},"GJfmvxnFNgcp0B2rXeurjw":{"text":"TV set up is GREAT!!! Just eat and drink before you come.  The drinks were very weak. So w","useful":0,"cool":0},"zvv7481Wzp_V7RfSgS86aA":{"text":"This was a terrible place. There was literally 12 folks in the entire place and it took 45","useful":0,"cool":0},"YyWckGoZ9merXgQn86AWXQ":{"text":"First, I am a big fan of the Manning family. I have been to the Manning restaurant probabl","useful":9,"cool":4},"Ms8KE39ooK-2_r8D6N-yEQ":{"text":"You travel all the way to an American Mecca of cuisine, a city steeped in culinary traditi","useful":3,"cool":0},"zb9cOsV0vaDfrGlUUDgBDA":{"text":"Really enjoyed my dinner at Manning's. The staff was incredible and the food was on point.","useful":0,"cool":0},"XtiFHBBoond_wFPUA5LVGQ":{"text":"Came with coworkers after our conference to watch the Saints game. The place was crowded i","useful":2,"cool":1},"73KwFtOojy5vZ6QsfqfAfQ":{"text":"Very cool place. Always busy. If its nice outside make sure you sit outside and watch the ","useful":0,"cool":0},"zlViImvPIdyOl3448JnyFA":{"text":"\"Q\" was awesome an waitress... Food was great and good price!  Definitely going back!","useful":0,"cool":0},"dw1v5-LdRucYueBb9IVfCg":{"text":"This is a cool sports bar.  Lots of tvs.  They have a huge one in the courtyard that has t","useful":0,"cool":0},"fcoAi7uGODGs2gVI4S8mFg":{"text":"We had dinner at Manning's on Saturday June 9 and the service was horrible! Collin was our","useful":0,"cool":0},"v18gL6qwYdXQ2cvhsYQjZg":{"text":"The food is good. Typical southern flare and common prices. It's a great place to eat if y","useful":0,"cool":0},"GfTTIsIJtETYs6ZJGpRICA":{"text":"First time at Manning's.  Thanks Brittany B.  for the  great service.  Had the catfish fin","useful":0,"cool":0},"hZ5gZyvLOEP1mvbimd6crA":{"text":"So I went here by accident. And boy was it a good accident. Everything was good.  I didn't","useful":1,"cool":0},"_-utg6T7Ez6-r_noLFZ88A":{"text":"Awful service. Here for Sunday night football and they gave us the check without asking us","useful":0,"cool":0},"zNoQ-iVkdAhWcH7j0T4KHg":{"text":"This restaurant has a great location and perfect if you love sports. Plenty of big screens","useful":0,"cool":0},"Ej2h-9zI5LbkfZ4RiaCGug":{"text":"The service on the back patio is very slow, the bartenders are taking care of the front an","useful":0,"cool":0},"blMDmrN0tiq7GBTyUvGByw":{"text":"Food was very good.  The bread was fresh on our sandwiches.  The beer was cold and the TV'","useful":0,"cool":0},"PeKlLzp3aDZC3EtEOhSAvg":{"text":"I was at Manning's restaurant and my server name was Mykel ! She was so amazing ! I never ","useful":0,"cool":0},"NLfeFf_MT4K-Ex4OZ0EG5w":{"text":"Do not eat here! Don't eat here don't here.. you will be lucky to even get what you ordere","useful":0,"cool":0},"5jLvSmJZaT1YVbAX11_nbQ":{"text":"Terrible service even when the restaurant was relatively empty. After 35 minutes we still ","useful":1,"cool":0},"yTl5M47thXhqEQtrAZC3dw":{"text":"To give you a little background, I am a visitor from out of town and haven't eaten at a to","useful":0,"cool":0},"6KYh9EqYcsVEn3QdOS08Kg":{"text":"Food sux, drinks are watered down and the staff could give a shit about the customers.","useful":2,"cool":0},"k0HFpSa9mdWJXXgn18SxgQ":{"text":"Cheap drinks but the po boys and gumbo are mediocre. Go there if you want a happy hour dri","useful":0,"cool":0},"WC2sNbTecWvr7fxqYF0ajw":{"text":"This restaurant is super cool! The atmosphere is like an upscale sports bar, complete with","useful":0,"cool":0},"9K5KqKGkne7jEDCUDb_spA":{"text":"Of all the places to eat in NOLA dont go here just because of the name.  average food at b","useful":0,"cool":0},"aHo5KRQj6AgvP5f7B1MsQQ":{"text":"Q was the best! Great food and good advice. She was super helpful and accommodating. \n\nGo ","useful":0,"cool":0},"Pr5Rr3UFEhdunROCNmNOCw":{"text":"I'm not gonna say the food was bad, but it's nothing special either. It's very forgettable","useful":2,"cool":0},"ugsFC6VopEdYz5XX1PFgTQ":{"text":"This place is awful!  They must microwave their food.  The mannings should be ashamed to h","useful":0,"cool":0},"XbN5KE4bfVZMAt1VpjY2Ow":{"text":"Great bar to watch a game at, but it gets exceptionally busy. We went there for the Saints","useful":0,"cool":0},"iNv8xr1Zw0FznuqZPmPJaw":{"text":"This is a sports bar/ restaurant with a typical bar type of menu. On a positive note, you ","useful":0,"cool":0},"d358e0kcZO8dyGzXOLqO0g":{"text":"Manning's on Fulton. Owned by a family we love to claim as 'our own', has a great location","useful":5,"cool":0},"kwqVUUHnf5gGcM0U78YYjg":{"text":"Manning's one of my favorite spots in the city to grab lunch and drink!!! Love the staff; ","useful":1,"cool":0},"fy1dnHFnva0BGe_m1H5b8g":{"text":"Food was good - service was awful - had an appetizer and we were there for almost two hour","useful":0,"cool":0},"MdGJT5d9pf8DmZ0HQs_DFw":{"text":"Made reservations for a party of 5 for 4:00pm on a Saturday afternoon. Not the place to go","useful":1,"cool":0},"puz00SykCMqaExeFFeZO5Q":{"text":"The food was a disappointment. The menu was minimal and the burgers were very dry. Have to","useful":0,"cool":0},"wT4x__flJaDZEBGHMRQyqg":{"text":"Made an attempt to drink and dine at this establishment on Wednesday June 6, 2018 but appa","useful":1,"cool":2},"Nj9-qLUcMfbHQPl-iJIO4A":{"text":"Food was just \"ok\".  Service was lousy!  Waitress ran off, with no explanation, in the mid","useful":0,"cool":0},"YJ0UmGvWTn41Aegeo3tCyg":{"text":"Great place for lunch.\nCold beer, great food.\nThe best service I have received since I hav","useful":0,"cool":0},"J957BkGpw9X0NlJilG1jkA":{"text":"Sat outside to watch Thursday Night football. They had no servers and bartenders were rude","useful":0,"cool":0},"-WzuSsYCSADQeQmUfLHETw":{"text":"Visited the location on 12/11 to watch the Fins game! If you're looking for somewhere to c","useful":0,"cool":0},"Ie4wXycgGfjSAeNalEc67g":{"text":"This place is a complete mess. Overpriced and the food is average at best. Service is horr","useful":2,"cool":0},"gvEQR5pUA-9aR7sOaXBx-Q":{"text":"A great place to go watch the game. Tons of televisions and it even has stadium seating. W","useful":2,"cool":0},"EG9Bf0750N4PAHzkHIxp-Q":{"text":"Manning's is off the beaten path - but Camille will make it worth your while! Camille made","useful":0,"cool":1},"lw6F8cxGNQ72BKHFAfwWkA":{"text":"Horrible service and planning for super bowl Sunday by management. Was in town for a bache","useful":0,"cool":0},"7yRRrfVkVDgPAd7JZBcfFg":{"text":"Worst service ever. Sat at the bar 2 nights ago. 2 bartenders for Thursday night football?","useful":0,"cool":0},"WKISxyvSsTG-sAVXiD5lBQ":{"text":"In town for a conference and a coworker and I stopped in for lunch on a college football S","useful":0,"cool":0},"uurt8iLZ8UrvZ5-qYFVB_Q":{"text":"I went to Manning's after my college graduation. The atmosphere was comfortable and clean,","useful":0,"cool":0},"Tc7mPrntMJ_9GPYzuyS1dA":{"text":"Clean, nice server, immediate seating - that is all.  There are too many great places in N","useful":2,"cool":0},"NW5a_zXICzHkAXiwY1mqzg":{"text":"Food was ok, regular bar food and nothing special for s city that has outstanding food. It","useful":0,"cool":0},"eyKlG9xilePQrSAo7T76bQ":{"text":"I was in Mannings tonight for happy hour with my wife and daughter, I never heard of this ","useful":1,"cool":0},"vZNMGDkKJpcniXXFS8XyzQ":{"text":"Was here twice so far. didn't have a problem! In fact it was great. First time was at the ","useful":0,"cool":0},"PWL2rq3Jz76sTYvcZQPOjQ":{"text":"Eh... As far as sports bars go, this one is fine. I guys what makes this exceptional is th","useful":0,"cool":0},"W4-WUNb83E1D6iM5aIrYYw":{"text":"Manning's was nothing that we expected. All the other reviews were good but our visit was ","useful":0,"cool":0},"v6Q-0KKTUXvaIYC24SAaBg":{"text":"Was told by hostess I would need to spend a minimum of $25 before even being seated. Obvio","useful":4,"cool":0},"flYZFc-JMfo4iefwcnVD4Q":{"text":"Laquisha (\"Q\") recommended the gumbo and she nailed it.  Best gumbo I've ever had!  Only t","useful":0,"cool":0},"p7C_K2YpKvD36o9Cj9cM3Q":{"text":"Very disappointing. Took forever to get out food. Half the orders were 15 minutes behind t","useful":0,"cool":0},"60gA4_BF7wY7avt-akBpNA":{"text":"I'm not going to lie. They messed up on my order. However, they took excellent care of us ","useful":0,"cool":0},"LpU9o0yCqzuZ_1o-7KIszg":{"text":"Went here soon after opening and some of the food was extremely salty. However, recently I","useful":0,"cool":0},"7LykAkQsDlEqfSECJ37plg":{"text":"The service here is among the worst I have ever experienced.  It took 15 minutes for our t","useful":0,"cool":0},"y_OFSMgiVsdMZlIwmFjMqQ":{"text":"The food was just alright we both were sick afterwards. I had the shrimp pasta and the per","useful":0,"cool":0},"3w-BrouI5P5g9HXajGiGGw":{"text":"We celebrated Super Bowl 50 in the Fan Cave at Manning's. All you could eat and drink for ","useful":0,"cool":0},"OS1juRG4pSWXUsNU7DB8Jg":{"text":"This was probably the worst sports bar I've ever been to. It has a great location, but ver","useful":0,"cool":0},"5j93EXYMM7SaP7d_jcP7Dw":{"text":"So for starters they did not have enough servers to cover the floor because people called ","useful":0,"cool":0},"pED1aJbwQ0RjVYJsZ0PjoA":{"text":"The female bartender that was working on Friday the 9th during dinner hours Is a complete ","useful":0,"cool":0},"R3wiKU-bXY2HaeVUdx2ohA":{"text":"We just got into New Orleans a few days ago, came into Mannings and Ashley was our server.","useful":0,"cool":0},"dYLubNN7l1FdWlPOxEHUZA":{"text":"The food was very good, we ordered burgers and they were cooked perfectly and delicious.  ","useful":0,"cool":0},"pxfEwFIw6NtTEFzrnQ-u9w":{"text":"Good food. The shrimp pasta and the nachos were both good. Service was great. Our waitress","useful":0,"cool":0},"QOeW0Zpr7q1nmr5KPMRZ7Q":{"text":"Was not impressed at all! Would not go back. The service was horrible. The menu was very s","useful":0,"cool":0},"kpO-wVwSIWYoRqELisIzdA":{"text":"Made reservations here after a graduation on a saturday afternoon. THe place was not crowd","useful":0,"cool":0},"9vVPfQQW8J1-0xMXLobMgQ":{"text":"Pricey for the quality of food and drinks. The gumbo was horrible. Watery and weak flavor","useful":1,"cool":0},"Q3J_6VIgqtJtu8GfOsWjTQ":{"text":"I just moved to New Orleans a few weeks ago and as a Giants fan, I just HAD to come to Man","useful":3,"cool":2},"hvuOmiX-fRYblgh6qaVxrg":{"text":"Big football weekend.   Went to Mannings for the LSU v Alabama game.  Waited to put in our","useful":0,"cool":0},"jXX8Uy3cCkS6SKLqX2YqQQ":{"text":"I'm sure this place will be fabulous to watch a game on their big screen. For dinner...naa","useful":0,"cool":0},"GPTyD-hqlbGG-tcT2bQH6w":{"text":"I was so excited to try out this restaurant. Inside is cute, but there was a little wait t","useful":1,"cool":0},"oye8UtMp8mgX1cO1vo_ZMA":{"text":"Bad service.  Hostess inattentive and had to flag the waiter down.  Not a great start.","useful":0,"cool":0},"HOzYvwgJWGGngKsVPNCsiQ":{"text":"This was put second attempt at enjoying a meal here because we love the atmosphere but the","useful":0,"cool":0},"D7VYRadh_Tq8vnCErVTGNw":{"text":"I've been here twice and have been highly disappointed each time! I will not be back a 3rd","useful":2,"cool":0},"h0005zJxguSIV40FpXY2HA":{"text":"If I could give this place zero stars that would be 10% better than they deserve. Understa","useful":0,"cool":0},"rJfUbbmPjd_I2HwaOm_HcA":{"text":"We went here last night. I had the white sangria it was ok. For food I had the alligator s","useful":1,"cool":1},"dGdyrlIx6EsckbkPdwo_bw":{"text":"I had the Oysters with Grits. Very good.  So why the 2 stars?  Everyone else said their fo","useful":0,"cool":0},"LDcSMLVcCUogAw3UdQx3ww":{"text":"Love this place!!!!! Q the bartender is the best ever! Come to Mannings for fun in NOLA!!!","useful":0,"cool":0},"qVo_T2I9jU_b4hTKUxP9aA":{"text":"Great, fun upscale sportsbar with very reasonable prices.  I can't imagine a better atmosp","useful":0,"cool":0},"K4Yy0EKQKQ338uTlO_BrGg":{"text":"Was pumped to come in, nobody was waiting, went in on an off time. January 2nd. There was ","useful":0,"cool":0},"b-6xQBQH3GV-djfjp1-a9Q":{"text":"Nice to have a drink & watch some games. Bartenders are great & friendly!\nHowever the serv","useful":0,"cool":0},"IORdBU895FCNXk0eBsDHyg":{"text":"Don't come here waste of time and money. Worst customer services first they make you wait ","useful":0,"cool":0},"ifgISzljfwdFpknWCa0LMw":{"text":"Great burgers and fried pickles. Only reason I gave it 4 stars instead of 5 is they didn't","useful":0,"cool":0},"9xtxI7yUuO8Edwv0pmB8Nw":{"text":"Contrary to some reviews I see on here our service was excellent.  Delysha was attentive a","useful":0,"cool":0},"Qre5Rb1246Z8xMPYNF-Nig":{"text":"Great little sports bar. After driving eight hours from Nashville to Nawlins, I wanted to ","useful":1,"cool":2},"MpIGFQ-S78zEySoPUc8e8Q":{"text":"Casual dining environment, great staff. Good food fairly priced. Try the red beans and ric","useful":1,"cool":0},"tJg4jJ8hvVkqPoT_nEZIog":{"text":"Great place to watch the game. TVs everywhere! Amazing sound, cool outdoor amphitheater an","useful":2,"cool":1},"KMxgV0PjcEPFoFHV8fL6LQ":{"text":"Watch out for the wait staff and look at your credit card statement or you'll find a littl","useful":0,"cool":0},"z1EH01BIIjsleFpwBco55w":{"text":"First of all, the begneits are a MUST. Better than cafe du monde. My amazing servers at th","useful":0,"cool":0},"rjXSudMuQ1Wa7QStgpUM-g":{"text":"Went here after a Saints game. Wait wasn't long at all. They sat us in about 10 minutes. T","useful":0,"cool":0},"7moHxVM4mPytaNxXIavqcw":{"text":"This place is as mediocre as Chili's and Applebee's. I had the Catfish and sliders. The bu","useful":0,"cool":0},"4HbBICLvoERNtXWPHDbOiA":{"text":"This place is as mediocre as Chili's and Applebee's. I had the Catfish and sliders. The bu","useful":1,"cool":0},"aYp3GR3x3TM9KCo2qgigow":{"text":"Appetizers were good but wow we can tell why it's dead and empty in the restaurant, the se","useful":0,"cool":0},"riAbPCskYwyIfJeNHN3uZQ":{"text":"This place i think is more for tourist than locals. I liked that they had a lil gift shop ","useful":2,"cool":0},"Hj6FmrAWhCDuHdQmlOp5mw":{"text":"Long Island Iced Teas were a bit sweet with not enough tequila. Probably a premix. The win","useful":0,"cool":0},"E1Ja-TQ-jyrmMoGYk2ZN_g":{"text":"We wanted dinner that was not creole/Cajun. The food was good, it satisfied what we were w","useful":1,"cool":1},"xPUgkj-3noCKLRHZUVrYzA":{"text":"First time here in New Orleans and try manning restaurant! The place look very nice a lot ","useful":1,"cool":1},"ZBPizt4yMhXR3_tTkNifjw":{"text":"Sunday we went to Manning's, and we were lucky enough to have the End Zone Recliners for t","useful":2,"cool":0},"bbPXmeQfSIfbzkz_7SCgQQ":{"text":"This place fumbled like Peyton manning did in the super bowl. \nFour dollars for a slice of","useful":0,"cool":0},"Yn9dGbzWwJAgOQaGjJ50tg":{"text":"The place is full but bar area is empty yet there are no chairs. Wtf? No, I'm not going to","useful":0,"cool":0},"9z-BkT0zLmKcbBeN9_-SeQ":{"text":"Horrible, horrible food.  Blackened fish and vegetables.  Fish undercooked and they think ","useful":0,"cool":0},"2ibKRGBOCqdduOo2rqlwDA":{"text":"Burger was great but the cheese fries are a must! It's almost like they have magical chees","useful":0,"cool":0},"JZraejlSGNTjnNp_4mSojA":{"text":"Great place to watch a game. The outdoor patio was a great area. Inside they have lazy boy","useful":0,"cool":0},"0R_XHiZ5wUcLhwsdtnUrRQ":{"text":"Food was okay- Nothing super great- Its a sports bar-a little more upscale than some other","useful":0,"cool":0},"0l2yBtGy68skJDpGSYzrVw":{"text":"I legitimately have no clue why this place has such a low rating.  As far as sports bars g","useful":0,"cool":0},"EkRktsR6t19WRQMJ9fikYw":{"text":"Overpriced, chain style food.  Roast chicken served in about three minutes.  Frozen French","useful":0,"cool":0},"qCEKsMlxklS3RAB3iwic0w":{"text":"Best waitress in New Orleans - her name is Quasha. So attentive and delightful! Thanks so ","useful":0,"cool":0},"B5rpZ9PvV1NZD76HUjeQMg":{"text":"Ole Miss watch parties here are the best! Huge screen set up out back, tables set with pla","useful":0,"cool":0},"tYFgNbHml4AEaGDHS1ANFQ":{"text":"If I could come here and not have to deal with the hosts, then I would probably love this ","useful":1,"cool":1},"RLbDXw6QK2TIKc3SvqQteQ":{"text":"Peyton burger with fattening fries.   Nice bar with outside tables under a tent and huge t","useful":0,"cool":1},"l1SYnJmj9MsTIXqrafFxFw":{"text":"We decided to pop in despite reviews.... we were seated right away.   The place had a hand","useful":0,"cool":0},"MgGEh0i2u9jchC5pSTfNcA":{"text":"Honestly, this place deserves a two star rating but the service was solid and the decor is","useful":2,"cool":1},"xA9eV0qQEN_TWIYVDXLM-Q":{"text":"Very disappointed in Archie Burger. Signature dish. Need to do better on burger. Boring. N","useful":1,"cool":0},"cS_stCDAS8P_s4COD4264A":{"text":"I recently put on a dinner for 100 held at Mannings in their upstairs Stadium club room an","useful":5,"cool":0},"7QXLJJDb2JBtAFVsKC3SqA":{"text":"Last week 11 of my co workers and I came in for a quick lunch. Kaity served us very well a","useful":0,"cool":0},"5AElVtvPcWHQLJLoS8cc9A":{"text":"My wife, myself and another couple were in the Big  Easy for along weekend of fun. We went","useful":3,"cool":0},"XkwkIlzLoYfO1drd6bAqTA":{"text":"Had (shockingly) the BEST experience here! \n\nFor starters, I am dairy free, gluten-free AN","useful":5,"cool":3},"lcVaQnFKA-BXlP67WjJARw":{"text":"Service C - very slow and did not know her bar\nFood C - rice and corn not fresh - fish was","useful":0,"cool":0},"9xNgLxN55_mnINweMmAHKA":{"text":"We planned to spend the day at Manning's watching our college football games last weekend.","useful":1,"cool":0},"H4mYSZ5UpPyOCnuDTRA2Wg":{"text":"I love coming to Manning's. I live in Alabama and also own a place here in New Orleans so ","useful":0,"cool":0},"BmNcpfU7RsY0phVoQbxxKA":{"text":"Swing and a miss for this one. Food not served at the bar during games. Phone in reservati","useful":4,"cool":0},"6bPp847JC8sYfwMK49M46Q":{"text":"Third time in here and each time the service was horrible. Waited to get a table for 10 mi","useful":0,"cool":0},"rEoRRNIPYpX1jxTXDVLRrA":{"text":"Absolutely not worth your time. Under staffed. Over 15 minute wait just to get a beer at t","useful":1,"cool":0},"DPi3WZ0TQ231B4RqcQF_qA":{"text":"So got a bucket of Corona! Menu says it's $4 per Corona! Waitress says we can get a bucket","useful":0,"cool":0},"YnWCSGTzaASOcj_PcdFm-Q":{"text":"Amazing food. I had a long day ahead work and wasn't able to eat. this was my first time c","useful":0,"cool":0},"5xT2NI1-1C-lBRaM1Y9hRA":{"text":"Have been here a couple of times before & have not been disappointed.  Had the catfish nug","useful":1,"cool":0},"4e6jkTP69Zl6NziARz9Ucg":{"text":"Packed for games\nService was mediocre\nNothing on the menu was worth discussing. All the it","useful":2,"cool":0},"OlXVO_oVPQo9T_Chi_79Hw":{"text":"Food is great, service is ok, but the hostess need act like they want to be there.  The ki","useful":0,"cool":0},"tQl6z_A_Z66n4eRCi8xEzA":{"text":"Not sure why anyone wouldn't give this place 5 .   In town 3 days and spent at least 2 hou","useful":0,"cool":0},"a6bGfcf2AHZZXv-_gumZDw":{"text":"Went to Manning's for a welcome party for my Nephew's wedding.  Because of a major rainsto","useful":0,"cool":0},"nZ4j1k_zFJ9enrrdRmW9qA":{"text":"Worst game day place ever! They won't play the sound cause they \"don't want to favor any o","useful":0,"cool":0},"Ro752TlsDfKeaYSrZuETOA":{"text":"We strolled in early on a Sunday at 8:30am (they opened early because the Saints football ","useful":6,"cool":2},"d6E8DCSbF2mTl-P0qFxzkQ":{"text":"Ashley was amazing. We sat at the bar and she was very attentive in her service. We had na","useful":0,"cool":0},"nBSUuYFo9Lp-clbnqqXDtg":{"text":"Manning's isn't bad for a restaurant and bar that's attached to a hotel/casino. The beer s","useful":0,"cool":0},"_IG4qMOFf3QH2AKlBkFksA":{"text":"Manning's was absolutely amazing. The burgers were highly suggested by the bartenders Alan","useful":0,"cool":0},"n_92KbD-OJ5JKY2nv2XQ2w":{"text":"Great location ( in Harrah's Hotel & Casino) with it's own entrance. Indoor and Outdoor ga","useful":2,"cool":0},"IM-q7j7QrKXnFZB2GwbGgg":{"text":"Awesome place.  So fun.  Recommended the best beer I've had in NOLA. Good apps. Great plac","useful":0,"cool":0},"7BKA5TeOk3m7-wpZ2HFjug":{"text":"My husband and I ventured here during our NOLA trip. Mainly because my husband is a huge P","useful":0,"cool":0},"hYB6KQ_XK8AT59wtbZm-bg":{"text":"Be sure to have reservations if you plan to come when there is a Saints game on! Comfy cha","useful":1,"cool":0},"C87tD9xz5Z8t5smN5iGeYw":{"text":"Been here 10 times in 1 month because of comps from casino. During that time I didnt have ","useful":0,"cool":0},"6ny2Tck8T7wBjViRW8rtBg":{"text":"The service was fantastic. We had a conference event and they served us like kings and que","useful":0,"cool":0},"Vq63aTnrGsjXsEJSrR6w8g":{"text":"This is an excellent restuarant the barmaid jessica was polite informative and gave excell","useful":0,"cool":0},"uaoD8s2K8rL9furarV-U7Q":{"text":"We were in Mannings on Sunday to watch the Cowboys play the New Orleans Saints in a victor","useful":0,"cool":0},"Bt71Bx5p74_h4DW56TpsPA":{"text":"I can understand some peoples complaints but I had a great time here when it was packed to","useful":2,"cool":2},"8zEh1MZF0GCyajNedDbKRw":{"text":"We went into watch a football game.  It was on one screen so we stood for the entire game.","useful":0,"cool":0},"jO1O0qb8at8cXvr7Le4vew":{"text":"Went to Manning's to get a to go order. When I approached the bar I immediately noticed th","useful":0,"cool":0},"Nhadgf9sH4827fU9cfBV0w":{"text":"Poor service. I was really excited to try the fried pickles but sad that they were over co","useful":1,"cool":0},"U2AnaDNwxo379jUoQaPIQg":{"text":"Stopped here on a whim. Was interested in something a bit lighter than traditional NOLA fa","useful":0,"cool":0},"YQQi9C0D97Fsy9Vfu6DlmA":{"text":"A group of 6 of us found this place after exploring the area.  We were pleasantly surprise","useful":0,"cool":0},"UukegA6XEXVMTDp6XjViQA":{"text":"Got our nacho app in no time.. maybe 5-10minutes, but the entree easily 45min.. on a slow ","useful":0,"cool":0},"Cl05fWyNyk_-EXjUmRFM7w":{"text":"Lots of TVs throughout the restaurant but if you sit at the bar you are pretty much restri","useful":0,"cool":0},"fofo9tXT5MZiFHk3eyGHvA":{"text":"I wish there was a Manning's where I live.  This is one of the best places I've ever watch","useful":0,"cool":0},"zMo2M-2QNYmJPzzBwglSPg":{"text":"Burger was tasty, French fries weren't great. Drinks were cold. We went at 2pm during the ","useful":0,"cool":0},"APhrDuG161jjhMBWTpE-1w":{"text":"Poor service. Employees that don't know where one can and cannot sit and how much they hav","useful":0,"cool":0},"EK3bmrpYuXRVCEVZDYrh6w":{"text":"We came here with a very large group of 20 and the service was pretty decent.  The servers","useful":0,"cool":0},"zGLy0Xk29c04AChLx9oIhA":{"text":"We sat at the bar and Ashley is our waitress. Very cool place, awesome food! Good for game","useful":0,"cool":0},"ttJ5raSJ8jceOyuuG_rdNA":{"text":"Tried it again. My fault. Long wait for ice cold food. If it's going to take over an hour ","useful":1,"cool":0},"YqC88zvrjlSWTb3NY9o1WA":{"text":"We are staying next door and we have been hitting Manning's for just about every other mea","useful":0,"cool":0},"0zajh4R64t30wWrGWJPHdw":{"text":"First try at Mannings and last.  Should have done an about face and dined where the real v","useful":0,"cool":0},"TREnhxGF8qTmpMi8_syLHQ":{"text":"Arrived 15 minutes before they were closing and it was obvious they did not want any custo","useful":0,"cool":0},"TMBl2G4DGqFBq9bFJJT39Q":{"text":"Very friendly staff!  The french fries were to die for.    My so. Loved his po boy...half ","useful":0,"cool":0},"2DqeHnIJ6izPmvn7tsfbZw":{"text":"I came on a Monday night during football season with decent expectations. It took me 30 Mi","useful":0,"cool":0},"QUXvo89gHHeRtfsba_Ug8g":{"text":"Made it back to Manning's again to give them another shot. My girlfriend ate there last we","useful":0,"cool":0},"xa-PAY227bG1m8X-zR-M6g":{"text":"Don't judge a place off on one person's good or bad experience. That being said I had an a","useful":0,"cool":0},"wkJ7F0U_CqZ3CabyIfOacQ":{"text":"Mannings is in a great location.  It is super fun for a football game. They have a great o","useful":2,"cool":1},"37sNlxQgq-jO_W-uminkrw":{"text":"Very disappointed in service! Went to watch college football and had to sit in a different","useful":1,"cool":0},"_r9_4zexU-XM-pA5JIP0Dw":{"text":"We really expected better from this eatery.  We had a group of 9 on a Sunday at 6:00, and ","useful":0,"cool":0},"ewvWSKrrfrd0ip-X1G1jWA":{"text":"The only reason I'm giving Mannings a star is because of the venue itself. It is a perfect","useful":0,"cool":0},"D5xwnVaWNIBaht8ae5BRSg":{"text":"Addendum to my earlier review: Rec'd response fairly quickly from their customer service t","useful":0,"cool":0},"EHUKaeBEYWUVWpqynpvIlw":{"text":"I was not impressed with this place. The workers were cheerful but the food was mediocre.\n","useful":6,"cool":4},"Y49-4vzItHssGe6L7UffCg":{"text":"The place was very cool and very packed. We had to go upstairs to find a spot to sit with ","useful":0,"cool":0},"mDusgKbQe1pZzv99FbOlOg":{"text":"The food is beyond terrible. Jesus hire a line cook and let him take over the food. Seriou","useful":1,"cool":0},"pPSbEMlOoy_KdkV0ESsgrQ":{"text":"It is Thanksgiving day and several patrons have been waiting more than an hour to be seate","useful":0,"cool":0},"Oo-UGM0Ty0H2ZrGuiNVP3w":{"text":"Walked in and I asked how long of a wait is there for a table and the hostess proceeded to","useful":0,"cool":0},"u7B56o4x0EB4ZYOD_uVh3w":{"text":"Really sports friendly atmosphere, with loads of TV screens. they do have lounging chairs ","useful":0,"cool":0},"MNwvfzkQ_OOYkrdWIlOH5w":{"text":"This place has the best Beignet.  Excellent gumbo and fried catfish.  The waitress was so ","useful":0,"cool":0},"GjPPEDLJwP1d8EOZIFvxlg":{"text":"Sierra is the best!!! She's such a great server and kept us laughing the whole time. The r","useful":2,"cool":2},"wtdCXlYcOtujTtSNopwEPQ":{"text":"I'm sure this is a great place to watch the game and have a beer.  The bar seems pretty go","useful":0,"cool":0},"K4f4aIYIhLjjpb7CkODVCg":{"text":"I came here during the college football playoffs and the food was typical New Orleans fare","useful":2,"cool":0},"cqDbyYXBbpdphqZwneYSnQ":{"text":"HORRIBLE EXPERIENCE!!!! I am sitting at the table writing a review because this has been d","useful":1,"cool":0},"v8LutM57bVhLQ2akXHW4FQ":{"text":"I have been trying to reach someone via phone for the past week and they never seem to hav","useful":0,"cool":0},"b0M_2ALLFHUx-nEPx4LxHA":{"text":"We didn't want to walk to far from our hotel, the Hilton, as it was late. It was Sunday ni","useful":1,"cool":0},"pmRqDokgd23JRSiIrJKh3g":{"text":"I was expecting more and received average food and service.\n\nI came here for lunch on a Sa","useful":1,"cool":0},"NKY3jAWdcdw_REqO8LSd3g":{"text":"Nice spot, very spacious---the shrimp po boy was very good..shrimp were literally falling ","useful":0,"cool":0},"GCGfZ0LZ8QtUhGpGBY5PgA":{"text":"This is by far the worst food and experience i have had in new orleans. This is just a tou","useful":1,"cool":0},"6wH2Mm9sEF5jNj8wb-nUCw":{"text":"Absolutely horrible! Went when just opened and gave it a second chance, and I will never b","useful":2,"cool":0},"oJa_qQbEdPUmln2NM5HUMw":{"text":"Just have to echo some of the other comments.\nGreat place to watch a game, but the service","useful":0,"cool":0},"G_5yj0j2z0npn_5VaIWQxg":{"text":"Great atmosphere! Ordered the buffalo chicken wrap. The chicken was poor quality and over ","useful":0,"cool":0},"RXaCb6XyU7BbpxdtDo2Bkw":{"text":"If there's one restaurant in New Orleans I don't recommend, it's Manning's. We sat for alm","useful":2,"cool":0},"FPu0LrFcaK7MNqC6X_6C3w":{"text":"My wife and I stopped here one night for a couple of drinks.  The drinks were expensive.  ","useful":1,"cool":0},"us6dSsL-ywpD4FIqVxO4eA":{"text":"If you're coming for the \"sports\" aspect of the bar there are better choices in NOLA--name","useful":0,"cool":0},"DGzsnCep71goGCj61UVieQ":{"text":"It was late and we were hungry. Stumbled upon this place and decided to try it out. We all","useful":0,"cool":1},"USsRUWZ3QbOXRQ2RXkp1Ow":{"text":"Let me start off by saying the decor around this bar is super cool! If you're a fan of the","useful":0,"cool":0},"8HoISuC_K-kPGz34o1Fn4w":{"text":"Absolutely the worst place to watch football ever. Reserved their best seats; recliners wi","useful":1,"cool":0},"ioNAIkQbW_pvVdgFmfawkQ":{"text":"First time in New Orleans and had dinner at Manning's on Monday night. Food was good so we","useful":0,"cool":0},"DQ02vo16YKeob5-9cvOYww":{"text":"I am not sure  how to explain this spot. It's fine, good, seems to be a popular place. The","useful":0,"cool":0},"uucTNnJfCuLkn-jXTpnp7g":{"text":"I hadn't been here since they first opened so it had been a while. My impression back then","useful":3,"cool":1},"5d4o4nr7Cn-m1KTyjMtqOg":{"text":"We were in NOLA for two days. We went to Fulton street. We were hungry. Manning so was the","useful":0,"cool":0},"KaYI_XMYJe1EPMVGKpM4Lw":{"text":"Not horrible. Good service, cool atmosphere. Just remember this is Caesar's palace propert","useful":0,"cool":0},"9o0_tVcn4wF8x9LCawpZfw":{"text":"UPDATE: I reached out to the restaurant like they asked me to. I politely gave them all th","useful":1,"cool":0},"_PgMO957wufT3YyJ6GMoMg":{"text":"Great place to watch a game. First time we went we were upstairs for the LSU game. The dri","useful":1,"cool":0},"A9v_fewEVaC4yGiXcmOdMw":{"text":"We drove from Lafayette (2 hours away) to meet up with family that were in from New York. ","useful":2,"cool":0},"qH3KhXmbQXQcJ_Xe3PP3Cw":{"text":"Great place for watching sports. Food was good, the pours were good. Most of all my server","useful":0,"cool":0},"PYJM9SmCUuD_wWjAr5dGTA":{"text":"Great bar/restaurant. This is one of the more updated/modern joints therefore it is a spac","useful":0,"cool":0},"KpqJo_tTwe_lrzTF3JB8Yw":{"text":"Great improvement since my last review. Steak and yellow fin salad and wings are the best.","useful":0,"cool":0},"iuBG-Iv9aYHLrB1yOT0Bsw":{"text":"We went to Mannings while in NOLA for a conference. My boss is a huge Colts fan and a seas","useful":2,"cool":0},"TXEPeaWoXbkXADCo15LEgw":{"text":"Our experience was awesome! A lot of food for the money and everyone who works there is pl","useful":0,"cool":0},"hzqTIlwlzx5GV9_yMQphuQ":{"text":"My boyfriend went to find a snack place near the Hilton Hotel, found Manning's and ordered","useful":1,"cool":0},"aLG5u2YTpyADPI61abSchQ":{"text":"Went here for the first time tonight, kind of shaky since a lot of people told me it's \"ov","useful":2,"cool":0},"CpZ-FAC_WIf1YCZkSmNMyg":{"text":"Sadly this is another of Harrahs sad, terrible service venue. As a 7 star, I decided at th","useful":0,"cool":0},"EUM7dFy5C25sGToOzrX8Wg":{"text":"Horrible service and they had open tables and we still waited 62 minutes. Manning's please","useful":0,"cool":0},"ZKAiCzJMxqGkmwgbbpUlqQ":{"text":"Well, this isn't happening again. 1st time here, from out of town, no one at the front to ","useful":0,"cool":0},"Y583quBlJW9Cqg4s7Z1QGA":{"text":"I like this place and have been here several times. Great place to watch a game with frien","useful":0,"cool":0},"bxFvaauxmeVgFatVhCAUVA":{"text":"Manning's may not be the best place for a quiet family dinner, but it's great for just abo","useful":0,"cool":0},"3zWcX7jK97OlcISXcLhxQw":{"text":"I sadly have to give this place one star :( - it's super cute and spacious on the inside a","useful":0,"cool":0},"95Dbh_lXI-1M1Xutd5T77w":{"text":"We r in New Orleans again at Mannings.  The crawfish boil outside with the band is awesome","useful":0,"cool":0},"I7LUhicVTP5inJOsnRF3kw":{"text":"Came into town from LA highly recommend it here , food is delicious and great service from","useful":0,"cool":0},"thB-UtMhW4YstttpNuAMrg":{"text":"Been a few times and unfortunately its always underwhelming. With so many food choices her","useful":0,"cool":0},"ioMogZJDnMS2SHARLSrG8Q":{"text":"Stop in during Essence Festival for a quick drink. Loved the lively atmosphere. Bar was bu","useful":0,"cool":1},"7s4xmYixqry64CfjEAOsSg":{"text":"First topic of business: While I never like to see anyone lose their job, the young lady g","useful":0,"cool":0},"kifxgsz2-rvIuoyhr2Zl9g":{"text":"This place is a Tourist Sports bar for the convention center! I went with a group of 7, we","useful":0,"cool":0},"DHUj1zvKAbvOQ-PTpfUnmA":{"text":"This was our first visit to New Orleans. Mannings was just a couple blocks from where we s","useful":0,"cool":0},"YoGTRthcp77AKsXxeT1LtA":{"text":"I came here to celebrate a birthday and there was a very short wait for how busy it was. T","useful":0,"cool":0},"fpBLIBdaIqeUEGgBwOz7zg":{"text":"We tried to eat here! The bar was busy but the tables mostly were empty. There were 4 of u","useful":0,"cool":1},"EpGV-mYWSQEbOTw-M-ATrA":{"text":"Average. Service was pretty slow. Food was just ok. I can honestly write that I won't go b","useful":1,"cool":0},"WqxZ7T3WYlL4jBz7Amn-kQ":{"text":"Great sports bar! Came here because it was near my hotel but it ended up being a great cho","useful":2,"cool":1},"XPUX14HtfV5MIWuYaU0iGA":{"text":"Had a burger at the bar.... excellent food and service. Very nice. Made me feel right at h","useful":0,"cool":0},"rsJ0EmewVsjbQB6zOZ6ckw":{"text":"My family was so excited to come here based on the Manning family tradition. Sadly, we wer","useful":0,"cool":0},"6b2GKeoau5GZ3M3kGPmveA":{"text":"While in New Orleans for Teacher Leader Summit my cousin and I chose here for dinner. She ","useful":0,"cool":0},"RIGDWDVI-O4RydyVzxn9kg":{"text":"The food is delicious!!! And their Beignets are to die for!!! For real!! People underestim","useful":0,"cool":0},"RBrlfETJTGCaIk63WytFCg":{"text":"Ok but not great.  Most people I know who have been here complain about the food.  I'm ok ","useful":0,"cool":0},"pFrvctFvkSwOKLGuIBiWHw":{"text":"This is a great place to watch any sports event. \nMy friends and I come here often. The fo","useful":0,"cool":0},"JGJMEbB7ej1UUQFdp4AdXA":{"text":"We are from ft Lauderdale we went to  mannings to watch giant vs saints 11\\1\\2015  the bar","useful":0,"cool":0},"XNDKQsVM2iao4BY6mvONyQ":{"text":"As a disclaimer, we live in the warehouse district, know Archie and really want the restau","useful":0,"cool":0},"SzLU6KCxwXT4WDg-V2rwYQ":{"text":"The good: I got a free T-shirt for ordering a drink after trying it  and the beignets were","useful":0,"cool":0},"R16VQM6c0Np5qOJq-W-4WQ":{"text":"Was underwhelmed with everything about this place except the amount of TVs.  I am guessing","useful":1,"cool":0},"zvVRz41QHcvDa475n6tDRw":{"text":"Poor service and small food portions.  Too many other places that excel in those areas to ","useful":0,"cool":0},"TN2b5IneOANVcsPt7GehdA":{"text":"I strongly recommend avoiding this place. Group of drunk people in the VIP area being loud","useful":2,"cool":0},"kDf-JD634jmnBbhwXD2ehg":{"text":"Had the beignets and gelato. Their beignets are better than Cafe Du Mond - more flavor. We","useful":2,"cool":2},"87lCA1otm4tgoFUB6PBcsQ":{"text":"Staff is rude. This was my 3rd time to mannings. I thought they were just rude the first a","useful":0,"cool":0},"ESqQ58eB5XqKv2X2zIANTg":{"text":"Came in to relax and watch some BBall. Seated in recliners section right in front of scree","useful":0,"cool":0},"cUrFC0UR9_wSj2kFgWhFWQ":{"text":"Service was good.  Food was good for bar food.  The beer was a little flat.  I liked the w","useful":0,"cool":0},"St-EYbHI5oJb4wXPOoxnUw":{"text":"At the start I felt this was going to be a disaster and I was correct. It took 20 minutes ","useful":1,"cool":0},"v66d5T8ZClXbF2nyfUlB5g":{"text":"So 3 years later, we have decided to take another chance on this establishment. \n\nI can sa","useful":3,"cool":1},"FG8njWr9LRrG_zWQJPwuBQ":{"text":"Disappointing. Especially for New Orleans. For $10 a cocktail I would like to at least tas","useful":0,"cool":0},"x_vMQCu3uE7cgBTbRL_LDg":{"text":"Food was ok but overpriced. Lunch service was incredibly slow. Painfully slow. Pleasant bu","useful":1,"cool":0},"nkYbNmD_v_qFQGqldL3Nbg":{"text":"Poor slow service! Food was cold and had to remind them to bring it out. Drinks took forev","useful":0,"cool":0},"i8OAEgZXxfTKtF14wUAxyA":{"text":"Hey Manning family, these wings are horrible. Service sucks too. Honestly this place will ","useful":0,"cool":0},"QQMIseDZMIluGbUMLztc6g":{"text":"Poor service but good beer selection and spacious seating options. Cool atmosphere and ext","useful":0,"cool":1},"JErkpT_ZAi5sGJKMmpWW6Q":{"text":"Our first experience at Manning's was wonderful. The food was great and the service was ou","useful":0,"cool":0},"KPqHT_5k6LU3jrFx9quQ7Q":{"text":"Great location. \n limited menu and average to poor wait staff. They always always seem ove","useful":0,"cool":0},"DCQDYLm6ANLBKaOEzIZSEg":{"text":"Very good food. Easy to walk to from our hotel in the French Quarter. We had the burger pl","useful":0,"cool":0},"ZxoFD2MR419YCLj8C5ZPGA":{"text":"Came here for a drink on a Sunday afternoon and the place wasn't terribly crowded. As a ma","useful":1,"cool":0},"AMvvzHV5iDnMd_cau_8z7A":{"text":"Horrible food, terrible service, expensive for what it is. It took over an hour to get our","useful":3,"cool":0},"l6gcdLVRC7GUoFvAhcNcpw":{"text":"Came here for Breakfast at 10am, but that was over at 9:30am. The restaurant was half full","useful":0,"cool":0},"XdcLzX73_YRyK4xW4-Az7w":{"text":"This is nothing but a loud, over-priced sports restaurant that people go to because of the","useful":0,"cool":0},"QtGaQ6MSeQbCeNk9aGY3oQ":{"text":"Showed up here for lunch. Extremely hungry. Food came a little slow but may have been the ","useful":0,"cool":0},"4dIRx95TyjgdY-8iEcC8xg":{"text":"Stopped in on my last day in town, sat at the bar it was empty but the service was ridicul","useful":0,"cool":0},"efb5ubUoAP8pgJOlyuM2Iw":{"text":"First time in New Orleans...First restaurant...BIG Disappointment...food is not seasoned w","useful":0,"cool":0},"B07VcUNPlwNq6kLTjikRZw":{"text":"Great combination of food, and friendly bar staff. Bartenders Jessica and Alana offer amaz","useful":0,"cool":0},"KFtNLJguhWRaV7cOQdt2cw":{"text":"Mannings is located in a nice pedestrian friendly area in NOLA. After reading other review","useful":1,"cool":0},"7jrjypC0qubCxIY4zGaHrQ":{"text":"Be very cautious if you plan to watch a sports game in the stadium seating area. They fail","useful":0,"cool":0},"bglHAdDonjP5UtrSfPK3zA":{"text":"Such a chill place with unique features. this sports bar set the bar SO high!! Customer se","useful":0,"cool":0},"OkEZOpXMdXR5KACjAOR8YQ":{"text":"Outstanding food. Try the French Dip and sit at the big bar and let Eric take care of you.","useful":0,"cool":0},"wtQfRao50CP96rrqEIsacQ":{"text":"Me and they wifey usually come here to watch the UFC fights in the outside patio area on t","useful":4,"cool":2},"m4oeY5EwC8ZRK9VacqNxXQ":{"text":"Pretty much your standard sports bar. The food is nothing to brag about but the outdoor pa","useful":0,"cool":0},"1QvOi6DHspQEOA5QmZtJtQ":{"text":"This was by far the worst restaurant we ate at in NOLA.  I was surprised how poor the serv","useful":0,"cool":0},"7SrPASZb-E4XrxBHRoOX_g":{"text":"Great place to catch sports events and good bar food. Ideal for brunches with large groups","useful":0,"cool":0},"ACftiSfZwpigIvIoHVvGlw":{"text":"I was curious about this location and layout.\n\nIt's a nice open bar and restaurant. Behind","useful":0,"cool":1},"a6AE84okGHX4087MNf_eKQ":{"text":"Probably one if the worst managed sports bars I've ever come across. We tried to call ahea","useful":3,"cool":0},"DPUDVx08rucscIwHaquKfg":{"text":"Been waiting for 45 minutes for a 4 top. Waited 25 min for a drink at the bar. Friday nigh","useful":0,"cool":0},"tQCtQwG0hYRvwiWXRCBXdw":{"text":"I've been here twice in recent weeks.  Once just to get a beer with my Jazzfest crew befor","useful":2,"cool":0},"PyoLWy0XghviEwH6FyezmA":{"text":"At the convention center and starved. I had been in NOLA for a few days and with all the c","useful":0,"cool":0},"qrNJLsRICh7QVSf0BQ9EoQ":{"text":"Very slow, not worth the wait. Staff seemed confused. Took a long time to be seated and ev","useful":0,"cool":0},"f1WwRs1XQwbbQNaf2fuvmA":{"text":"Service was good but the kitchen took over an hour to get our food. Unacceptable consideri","useful":0,"cool":0},"RZtGNzp6lSsGGG5XnG6Yew":{"text":"Great service, location, food and drinks. My fiancé, a huge Tennessee fan, is obsessed wit","useful":2,"cool":2},"YEzA8dIURA4l_eBqNPx83A":{"text":"Love the Mannings as a family and as New Orleans icons, but I would take my name off this ","useful":0,"cool":0},"BLFMMeusGZ1vW8qOm94Gtw":{"text":"Service is hit and miss at best and usually a miss. This has been at times when it's been ","useful":0,"cool":0},"ighqhcRPuCzsdoUpzG-ttw":{"text":"WOW!! What a fun place. We sat out back on the patio. We watched the game on the big TV. T","useful":0,"cool":0},"KQUF0Yc1yA6G0Qx-stWYCQ":{"text":"We visited this restaurant while in NOLA for business. The portions are huge but the food ","useful":0,"cool":0},"kyS-1oqimg7la51FYzu0Dg":{"text":"Visited Mannings for Saints/Atlanta game and had the pleasure of sitting outside to watch ","useful":0,"cool":0},"Gq_OU0HI2BsNmnjjhvv_4Q":{"text":"Looootttsss of TVs. Not a good place to have a conversation or go on a date. The food is p","useful":0,"cool":0},"DNm1lFOW52eVnyNNQbXA0A":{"text":"Manning's was my go to spot near Harrah's Hotel and casino. Food was delicious and atmosph","useful":0,"cool":0},"DMmNlhIWNVI5brZ503hHdw":{"text":"service was ok atmosphere was good the burgers were good. There are better places in town ","useful":0,"cool":0},"fB6M6ltSk1Y6quXxIeo_mg":{"text":"Second time eating here. First time the service was completely horrible but I always say g","useful":4,"cool":1},"gJs-5Sg9A1JKhqurhc860w":{"text":"While walking down the street a woman suggested we go to Manning's for beignets after seei","useful":0,"cool":0},"Ae_cyUvYFj5ZFOc_Ye9A2A":{"text":"Honestly it's prolly closer to a 3-star, but given the minimal options of true sports bar ","useful":0,"cool":0},"ZX-lwrdBlF6-UwytXDNC4w":{"text":"We have been to Manning's on other occasions while visiting NOLA so this was a return visi","useful":2,"cool":1},"jAqNcnoGWM2b1deRzaIjAw":{"text":"I always stop here to have a drink at the bar. When it's time to go up to get my parking v","useful":0,"cool":0},"H3OgAg12O99NNXDJnpkf4Q":{"text":"Nice place. Service is great. Friendly manager and very attentive server. I give them 5 st","useful":0,"cool":0},"vb6WuNT0a_dhL_1har2EBg":{"text":"If I could leave 0 stars I would. We got cocktails and appetizers outside and closed our t","useful":0,"cool":0},"d3Vx_042M_AecZYpi6pgYQ":{"text":"I have been to Mannings for a long time. Mostly for pre-parade lunches, or saints games. N","useful":0,"cool":0},"ooDTWmRIcy05KXi7WNWgpA":{"text":"Were there in the height of Mardi Gras season, and it was close to the hotel and it was po","useful":0,"cool":1},"3mEn50hlIcc_HeTiteWV0A":{"text":"Great waitress. Best beignets around. Different style but so good with caramel and pecans.","useful":0,"cool":0},"2CqbwXT6o_F_yiDM5feyfQ":{"text":"Drinks were horrible! Ordered a vodka tonic and a mule that tasted nothing like what we or","useful":1,"cool":0},"pBR5JaWyt7jznrkEPzsDhA":{"text":"Great food (catfish poboy is spot on), nice beer selection. Good service too. Alana does a","useful":0,"cool":0},"2DFa1xFw3d8cmh_fHU0MUQ":{"text":"My wife, and I stopped in to Manning's today for a late lunch.  There were only a handful ","useful":0,"cool":0},"697Myoyx7ljhdFYWuEbOjw":{"text":"In town for business and was looking for a place to eat and watch some sports. This place ","useful":0,"cool":0},"vln4vXqQ5R6ztu9fec8xvA":{"text":"We went to mannings twice on our trip. The food was excellent!! The second time we went ou","useful":0,"cool":0},"bVLKGyIlkVDGSbSwzPAr_g":{"text":"I'm going to give Manning's 3 stars on this first review.  I have a feeling that return vi","useful":1,"cool":0},"ct3tfRey_1vtOP4yt7tSww":{"text":"Made a reservation under open table as stated on yelp. Got a confirmation email. When we s","useful":0,"cool":0},"NHf4g4Og9xgdQFebBNOf1Q":{"text":"We came to Manning's hoping for the full game day experience- great food, drinks, and foot","useful":0,"cool":0},"P8gv6EGIS_3L-BQhI1DdCA":{"text":"We stood near the bar for 15 minutes as multiple servers walked by and ignored us.  Finall","useful":1,"cool":0},"nprSp8eCK6g8HhvU06Xg8w":{"text":"Ate here a year ago and it was great, but got it to go this weekend and i can't say the sa","useful":0,"cool":0},"B37VDIIjOTutQRlh3N5ECA":{"text":"We went to Manning's since it was close to the hotel. Food was good. Our server, Whitley w","useful":0,"cool":0},"DhlRr22kvzrrzwFZN1dalQ":{"text":"The food is fantastic! The bartenders are even better.  I had Jessica and Alana servicing ","useful":0,"cool":0},"VhuNSPxkDMIzwHUss1UHsQ":{"text":"Jason was super helpful in suggesting the Peyton Burger and the Fried Shrimp and Fried Cat","useful":0,"cool":0},"gjcd0QIUrk1EtCFPP3IIuA":{"text":"Great place !! Our sever, Patrick was awesome !! We got the Peyton hamburger and it was de","useful":0,"cool":0},"xfsMQz2nfVlYeYzkwo9Clw":{"text":"Like so many others, my experience at Manning's was very poor. I am in New Orleans on a we","useful":0,"cool":0},"w__6JBAgw_RbComt6TQ-pw":{"text":"this is the life!!! outdoor seating with a huge tv!! awesome seating inside! outdoor bar! ","useful":0,"cool":0},"y8aZ1vbxAF3aClrAsuO7kg":{"text":"Food was great and service was even better. Apps were terrific and an oyster po' boy was s","useful":0,"cool":0},"aRNFpPhq1UaXSEUByDOpmg":{"text":"Wondered into this spot... was pretty empty at first. Liked the atmosphere and the music. ","useful":0,"cool":0},"0zj5Qusfviz6FB-pCBRwNw":{"text":"We enjoyed this restaurant. The memorabilia of the Manning family was nice. The food and s","useful":0,"cool":0},"WFYixJjH8X2DD6TDAhWR6w":{"text":"Quick service, great food, and a good atmosphere. Ask for Patrick as your waiter. He was a","useful":0,"cool":0},"ncEqRK2NS6zmMaBk-O9X_w":{"text":"Came here twice during our trip. Food was good and big portion sizes. Recommend the mac an","useful":0,"cool":0},"3FtDIeiFcwO0Esb1HZy7SQ":{"text":"Came in here since it's a block from our hotel and it had good reviews. We were seated pre","useful":0,"cool":0},"xqdfr57PD6vE93dZwugXug":{"text":"Oh man, this was one bad experience. \nCame to grab some food before a show on NYE around 7","useful":3,"cool":0},"Z5T9gB_u6ynKi9HC3fYS-A":{"text":"Food was decent although the wings come 9 to a basket ?? Rather pricey - $8 for a local cr","useful":0,"cool":0},"7VIFxEXiuG1DpUak2_2QhA":{"text":"Happy hour at Mannings is awesome. The deals are some of the best in town! Live the food a","useful":0,"cool":0},"UZ6EFjBpet0llYeg3ByCXg":{"text":"Can only comment on the drinks at the bar, as we only stopped in for a quick drink before ","useful":2,"cool":0},"nhVCB_qYSLmxoQqxVDoWew":{"text":"Best Beignets in town! Jessica, Dylan & Ashley were all very attentive great servers! Pull","useful":0,"cool":0},"jecGxnqF3ynopm5j3hvjtg":{"text":"This review is based solely on the bar. Stopped in late to grab a drink. We did look over ","useful":4,"cool":0},"idkaYL5k9Og0j3BIZ3CrWg":{"text":"Basic bar food.  I had the catfish fingers.  It was okay.  Husband had red beans and rice ","useful":0,"cool":0},"orIGfx4HOUMj7XX3wAjx2Q":{"text":"Hands down the worst spot we visited during our trip to NOLA. We were excited to check out","useful":4,"cool":2},"6V5Jq8vuiSISxnYbYeJzUQ":{"text":"I was excited to try this place while in New Orleans for a weekend. We added our name to t","useful":1,"cool":0},"a6FobULHEaFiAwmB2iTpFg":{"text":"We tried to visit on a Sunday night; it's NYE weekend so lots going on but the place was h","useful":0,"cool":0},"iQquvvhKmUJhfeoUbntPeQ":{"text":"Service was bad slow.  Food was mediocre at best. Bread on my poboy was hard enough that i","useful":0,"cool":0},"2WJPEzucF9cFLaGMdnl8cQ":{"text":"An excellent choice to get a break from seafood and enjoy some wonderful menu choices and ","useful":0,"cool":0},"54qfnn1GOUvkjcg0Vwa3wQ":{"text":"Wings was the best part at this place, dip n kids meat was ok can't complain lol but price","useful":0,"cool":0},"kIDIW3kbEhdtqDC-QMI1sQ":{"text":"I work in this business and I have never dealt with such a rude and unprofessional host. C","useful":2,"cool":0},"w5eYApc0X6Xfva_M6tv3NA":{"text":"food was decent but service was terrible. i was pretty much done eating by the time my dad","useful":1,"cool":0},"pHJ37X5NjaeWkFv3BcD_Dw":{"text":"Amazing. Great food. Great service. If you're a sports fan, this is a must stop in NOLA. A","useful":0,"cool":0},"bnRXqQi9ntB4-u0v7MZt-w":{"text":"Came here to watch football after the Saints game. The hostess said that if we can find a ","useful":1,"cool":0},"8h7VTj1ZLGTOoyjipANH8A":{"text":"This place was great! We had an awesome waiter name Langston who went above and beyond to ","useful":0,"cool":0},"BF0wI_z4lEissvLlEQ8gPQ":{"text":"Dirty, dirty, dirty.  The restaurant is short staffed. The staff really hustles, but just ","useful":0,"cool":0},"wU0rnv-mml_h822XyGiSEg":{"text":"We are from California and went to Mannings after the Giants vs. Saints game. The restaura","useful":0,"cool":0},"qSG3wfVo8wxt7OwVtQB6cg":{"text":"Just returned from New Orleans, and had dinner one evening at Manning's.   I have to say, ","useful":0,"cool":0},"Lf6b_Wf0_afTq4NOexJ0iw":{"text":"I love this place like it's amazing  when my kids and I travel from Atlanta we are always ","useful":0,"cool":0},"-ae377AtFgnyyV3PFF8Mtw":{"text":"Listen.  I know it's a tourist trap.  But it's in the middle of New Orleans where it can't","useful":0,"cool":0},"LxxosZ4uav3YAWCZeB9tTQ":{"text":"Possibly the worst bar I have ever been to, and that's really saying something because I h","useful":2,"cool":0},"im8A9kJDa2Hj7D5uIfLLdQ":{"text":"Menu was incredibly limited due to COVID but the BBQ burger, wings and Poppers were terrif","useful":1,"cool":1},"T86WL2skpZWH2TEXdyEiIA":{"text":"Seems like there should a time limit on the tables there we're groups there for 4 hour's n","useful":0,"cool":0},"NzbDfT5DxQZxdLSbH-BHrQ":{"text":"The one good thing about this place was the beignets. My mom and I both ordered the steak ","useful":1,"cool":0},"5UOE_706Ig96SQbEA4R1GQ":{"text":"My wife and I had a wonderful experience here! The waitress was very polite, attentive, an","useful":0,"cool":0},"x9r2Cf9qObdSST1zG3zIzw":{"text":"Hard for me to review since the didn't actually eat my meal. We arrived at 1:00 to a resta","useful":0,"cool":0},"DxkYRrjRTwQnzjtJ14X4JA":{"text":"We are rating Manning's for what it is, bar food. Wings and Beer! We ordered po' boys, but","useful":0,"cool":0},"dfFqwwBs8Q6dt0VbHFISKA":{"text":"Mannings need to spend more time at their restaurant.  Poor service, employees with attitu","useful":0,"cool":0},"K4Q2dKcuhUu2MaQ1zhfCVQ":{"text":"We really enjoyed our visit. Our cheeseburgers were exceptional - juicy and perfectly cook","useful":0,"cool":0},"-lcQg8bd2qMJ1H4CHgZTFg":{"text":"Had a great burger for lunch at this ultra sports bar and grill. Split the single patty Ar","useful":0,"cool":0},"dL8yvyG8Eq4FrK-alZxNvw":{"text":"Service is horrible.  Food is not great.  This place is all about huge TVs and sports.  I ","useful":0,"cool":0},"q73OKOfRLPY8ts60FyYwPA":{"text":"The service was not really good.  That's my reason for 4 stars.  They were not really busy","useful":0,"cool":0},"7GXrd-a8cqPxKB2NUVu98Q":{"text":"It was not too busy for lunch but I enjoyed the feel of the place. I had the tail gate sou","useful":1,"cool":0},"QvL90QqK1tr1GT2DFwxjLw":{"text":"If I could give zero stars, that's what they would get.  Worst food I've ever eaten.  Frie","useful":0,"cool":0},"f7da_DxayOE-VQldICspDA":{"text":"Terrible.  Went in with my sons on a Sunday afternoon to watch our team.  Hostess sat us n","useful":0,"cool":0},"VE71pJIfkE12_YBnjbQ3Zw":{"text":"I really wanted to like this place - fun atmosphere to watch a game. However our service w","useful":0,"cool":0},"G2Y_S5yZqkRtyshqn_eZpg":{"text":"I visited Manning's in NOLA in March of 2017 on a mini vaca with my friend. I loved the at","useful":1,"cool":0},"UPHzX6R_IXHos-C2e2pFMw":{"text":"In town for Mardi Gras from SD, I'm a chargers fan so I was hesitant coming into \"Mannings","useful":1,"cool":0},"Jh2qvupUd1RFbYmsPAzteA":{"text":"Food was good, service sucked.  45 minute wait despite several empty tables. Server never ","useful":0,"cool":0},"iKsik2velIO9XMW-oZn3xw":{"text":"Went to Manning's recently for dinner, and it was great! Our server, Drika, was wonderful.","useful":0,"cool":0},"tNaEYiiwIk2_Wxdhfv3aKg":{"text":"Was in town, and decided to give this place a shot.. The ambience is nice, laid back, and ","useful":1,"cool":0},"9lTpXEGnUx8oxQEFjB1ckw":{"text":"We went to this place to catch some of the Sunday football games. They didn't have access ","useful":0,"cool":0},"jcq2oIjZL3hlg2Jou7egLQ":{"text":"Food way below par, especially for New Orleans.  Everyone had an attitude:  bartender neve","useful":0,"cool":0},"uEvIdUtBVlwhjD77XfiDBA":{"text":"We got gere on a friday afternoon and also monday for lunch, and it was great food and ser","useful":0,"cool":0},"yuk9dRSlIRT1uCutH-wSFw":{"text":"I had to wait to write this review.\n\nI came to Manning's while in New Orleans on vacation ","useful":1,"cool":1},"kZo442RaVPweqn3dbu8vAQ":{"text":"Initially I was not going to leave a review. However, the service received at the bar was ","useful":2,"cool":0},"OXTiMgarIx_PEfNyAUxmIg":{"text":"Refused to serve seat and serve food 32 minutes before closing.  Their priority is to leav","useful":0,"cool":0},"VyjHx8G_plmEWCsuEq1Xnw":{"text":"Good service but small menu. Went here last year almost to the date and the menu was amazi","useful":0,"cool":0},"rFJmJ5qjksmwo-d2zm9dQA":{"text":"Great atmosphere, beer, and food! We were there for the Saints Steelers game and had a bla","useful":0,"cool":0},"ZGO34h2HZhm6ysAtxAVqUA":{"text":"Went back yesterday after our regular poker session at Harrah's and received wonderful ser","useful":1,"cool":1},"ZXKLYiXrB-Np9OGgzDJFPw":{"text":"Very good service, special thanks to Marchelle for brining positive vibes to our evening! ","useful":0,"cool":0},"_jUU3pwZ1phnPVDcbruScQ":{"text":"Being out of town during college football season is rough. Luckily, we found Manning's to ","useful":0,"cool":0},"434yneUMFmHM-y6WX9CIZg":{"text":"Our waitress Melanie was amazing. She was so attentive & sweet. Will definitely be returni","useful":0,"cool":0},"2bBu2lrSOhPatKEICVfF5Q":{"text":"The restaurant is owned, and I assume operated, by Harrah's Casino. The Mannings should be","useful":1,"cool":0},"Jd7BJ1GDFQ1ZwrA1lK-Ptw":{"text":"Cool place but terrible service. At a table for four and our server was miserable, we move","useful":0,"cool":0},"XR70NZt-nNASo5lvZjCrXw":{"text":"Went in for a couple of cold beers, didn't eat any food.  Service at the bar was OK.  Had ","useful":0,"cool":0},"wyjEbF5MBYZsC_kXmCTmkg":{"text":"Limited menu due to COVID wish we had know. Website didn't state but food was great. Great","useful":0,"cool":0},"MEP_OKNIATamJLpnsFIBxw":{"text":"No one even came to our table to take our drink order after 15 minutes. The restaurant was","useful":0,"cool":0},"BQGzRd5GGqpa0XnrvKbFlQ":{"text":"On my birthday, i came to New Orleans, I've been around the sun 54 times, figure that one ","useful":0,"cool":0},"qnULAp6SZr-rbmX7Ec59Jw":{"text":"Underrated, solid food and good prices. Don't know why the rating is so low for them.","useful":0,"cool":0},"oMiiIG_z4xUGoP1IlYT0Mw":{"text":"So they said 30 min to an hour wait and 3 hours later!!!!!!!    Ridiculous!!  After an hou","useful":0,"cool":0},"3vahQ3Oejja9-bR-YBcDFQ":{"text":"In New Orleans for a few days..burgers and brew. Lots of Manning memorabilia. Archie/Peyto","useful":0,"cool":0},"k7EqxZ0gpoB34HlfNVW5QA":{"text":"2 stars for the abundance of TVs. Busy night for CFB playoff games, but geez you're a spor","useful":0,"cool":0},"UapFcNUkz5wBKY9rybGJyg":{"text":"I don't know if the Mannings actually own this restaurant or just sold the naming rights, ","useful":0,"cool":0},"GQTT9ouRng74IzcQIVeanQ":{"text":"Tried calling Mannings phone # listed on their own website and yelp to ask a simple questi","useful":0,"cool":0},"NfAuU-pE52LCogLi3Nu7DA":{"text":"I've watched 2 football games here in the past 2 weeks. I have absolutely loved it , and n","useful":0,"cool":0},"SFEvVipdGRrnBuqAmnx5OA":{"text":"Manning's was just ok, but why settle for just ok in the best food city in the world? \nI c","useful":3,"cool":1},"j_Bt2X9Ia_SO09Hw5Srnxg":{"text":"Mediocre food; inattentive service. Came in and was seated fairly quickly. Then waited ove","useful":1,"cool":0},"A-qOVXiL6DJq0C-SwGiMjA":{"text":"Terrible service- host was rude. Told me it's first come first serve and I found a table s","useful":1,"cool":0},"9FPS7dJEkuh5eYdrpiGiSA":{"text":"We came to eat there on the 7th of December, we went to the game on the 8th.  The food was","useful":0,"cool":0},"jrpEmGf77iTdcOZpkYs_kQ":{"text":"We live in Kenner and go to Manning's for the duck wings.  VERY GOOD!  However, we were th","useful":0,"cool":0},"GrkLiEJpFwgZQeWdGXvFpw":{"text":"They lived up to \"#1 wings in New Orleans \" the wings were so good I ordered two orders. T","useful":1,"cool":1},"NuELSkzZRHA0-fkNCyapRw":{"text":"Delicious!! So so good! Nice and attentive waitress. Awesome drinks and food. The mojitos ","useful":0,"cool":0},"uz46UotDLwjtua-NE0YCKQ":{"text":"Courteous staff and cool breeze\n\nOur group decided to try out Mannings for lunch recently ","useful":2,"cool":0},"nyY5MUOZHoMkLB-7U8R4Fg":{"text":"My husband and I play at Harrah's frequently and walk over here for a bite to eat after a ","useful":2,"cool":0},"Bsy2PDv4HUFtdPb4jy-3VQ":{"text":"Some of the best bar food I've ever had. The service was also very quick and our waiter wa","useful":1,"cool":0},"PunYM6OcJkOAb9BYyCa-Ig":{"text":"Went to this place for a dinner on a rainy Sunday. We had the wings and nachos for appetiz","useful":0,"cool":0},"-iuRtyOFcsqxwwJQJTq4Zw":{"text":"Went here on Halloween night and it was an awful experience. We waited about 45 minutes fo","useful":0,"cool":0},"n6HvMqyY1DmQzXqXPzKkyw":{"text":"Went in yesterday. Service was poor, but didn't care because the hurricane and overall lab","useful":0,"cool":0},"DAgnbzic2Io1COTnOAC0VQ":{"text":"Place is not well organized.  30 tv's all have same game on? Come on you are a sports bar ","useful":0,"cool":0},"wVZwqj_85525t4URtCDvig":{"text":"The food was over priced and the service was very, very, very POOR. After ordering our mea","useful":0,"cool":0},"RdPUHh2ietj-drgErJv7Dw":{"text":"Over 10K sports health care professionals in town and 50 min wait with dozens of tables op","useful":0,"cool":0},"JzVOvm5FU-RX0ngdsj9NDg":{"text":"Poor service-mediocre food\nWhat a disappointment","useful":1,"cool":0},"b28SybTkD8JcSl3hvZ8PnA":{"text":"Hour and a half wait for food at 10 PM and it wasn't even crowded\nFood came out cold\nFirst","useful":0,"cool":0},"tKDgZw8RbE7Ha21wXV8P4w":{"text":"Needed a spot that had food and good amount of televisions to watch the bowl games so Mann","useful":2,"cool":0},"UYM_SE1k8Tn5eYNk5em7Hg":{"text":"I love Peyton Manning the football player, so I had to try this restaurant. The scenery wa","useful":0,"cool":0},"7tIbUvT3IaxXrPRWVcM3lA":{"text":"This is a premier sports bar/restaurants!! My husband and I are from Buffalo, and we (I me","useful":1,"cool":3},"DBc6_x48E1Cz8EYmWiHonA":{"text":"The menu was limited due to Running of the Santa's. The beef nachos were ok, but the \"Big ","useful":0,"cool":0},"tAhsJUdPYI-hkAWy_JZYfQ":{"text":"Morning! I am with Ole Miss cheer and I'm trying to book something for the group of 60+ at","useful":0,"cool":0},"RUcKos6kTEZMIk3JBDOHMw":{"text":"Wow, we come here several times a year and it is hard to describe just how far this place ","useful":0,"cool":0},"0DVBYW8OthZ4mYECmfE0UQ":{"text":"Cool place if you have sports fans on board. TVs and seating galore. \nTry the blue crab de","useful":0,"cool":0},"S7yaLJEZiBOA_Qt3Kp2xtA":{"text":"Great atmosphere. Great service. Amazing burgers. We had the Archie burger and the Cooper ","useful":0,"cool":0},"KYTPlep-ze-CqkQZUtre5g":{"text":"Came here to watch football and enjoy a \"good\" restaurant....15 tables were open and they ","useful":0,"cool":0},"dzLEiRt5W0yqMUCwyrKYIw":{"text":"PREFACE: I started the draft of this review back in January, the first time I went to Mann","useful":4,"cool":4},"3Fd-qxBfpPFKxaMF0zdZUA":{"text":"Was visiting New Orleans and wanted to watch some Monday night football, have a few beers ","useful":1,"cool":1},"Sy8hGgDysl9p2ueRVkD8yA":{"text":"Was really looking forward to going back to Manning's. To be fair the Bloody Mary s were r","useful":1,"cool":0},"I-Ebl095I0HnGzOeAduLjA":{"text":"If I could give 0 stars, I would.  When we sat down, our waitress said we could not order ","useful":1,"cool":0},"t-NqNKB62zW2DwPoihOufA":{"text":"We were staying nearby, so we dropped in for a quick dinner. The hostess was very unwelcom","useful":1,"cool":0},"57HuQdCy2atPjo15zfL5eg":{"text":"The wings and hamburgers were great. The service was good and there are plenty of Tv's.","useful":0,"cool":0},"UUtbYDZ6avmPiCIdoStyKA":{"text":"I will never go back. Horrible service and food. After writing this review my boyfriend go","useful":1,"cool":0},"HA2GaBlUbGnuGzn_inWPqw":{"text":"WORST CUSTOMER SERVICE EVER! My husband and myself came to Manning's and sat at the bar to","useful":2,"cool":0},"Tz8mE9IVMuineU_vFmPBsQ":{"text":"This is the place to be on Fulton Alley. They give amazing service, the quality is amazing","useful":3,"cool":3},"iqaUk4_0cix62_tNnrGLwg":{"text":"**4 stars for the chickens tenders**  I know it's simple but they were so crispy!! Also th","useful":0,"cool":0},"e9K44QMWUooTBsjoRlNJzA":{"text":"Not a bad place. I did notice it was VERY dark inside, but I guess that's to be expected o","useful":0,"cool":0},"OOvh2uD-u1yOg6nUsPzN-A":{"text":"Really 2.5 stars.  \n\nWent Sunday during a Saints game and as expected it was busy.  Howeve","useful":1,"cool":0},"COsBuqipwPlGBgcRtVfyqw":{"text":"A group of 3 of us went here on a Sunday night for appetizers.  Very disappointed.  Hostes","useful":0,"cool":0},"beZHFRh3qrq00znR6Q-NTw":{"text":"To be fair I just stopped in to check the place out & decided to grab an adult beverage...","useful":1,"cool":0},"UatC_jSPl9u2l_KTEzwZmA":{"text":"I arrived at Manning after a Saints vs Falcons football game. The service was a little slo","useful":0,"cool":0},"wKdbnap5US9MZltJ1e-afg":{"text":"No NFL ticket bad drinks and worse food. The service was good, but the only dim glimmer of","useful":0,"cool":0},"n6wbOErE-o4eolr-zjEYxw":{"text":"As a huge Ole Miss fan, of course the name Manning is a fave of ours so we had to try this","useful":0,"cool":0},"EIEvYJonCpPFdUgAXy9gig":{"text":"Nice place, very clean, large selection of sports bar style food. It is located in Fulton ","useful":0,"cool":1},"doCNcNg6JsDVnUhsgYuV1A":{"text":"We were really looking forward to eating here as we are Manning Family Fans! Well, not eve","useful":2,"cool":0},"ivOdicE4_1ajW1yIdidHcg":{"text":"Horrible. Very limited menu. Bagged chips. High prices. Not worth it at all. You're better","useful":0,"cool":0},"s2A-A_eg-pyKRtmQvoS0Gw":{"text":"Manning's bar is always a favorite to watch a game and have a drink.  They really do have ","useful":0,"cool":0},"TF7ar9uJxN9i_Ae3_mFwuA":{"text":"We went to Manning's for lunch on Sunday, 1/2.  There were plenty of empty tables.  We put","useful":0,"cool":0},"gmrbhAXG_oskCVDkxRiH_Q":{"text":"In town visiting and found this absolute gem.  Food is very good and service is even bette","useful":0,"cool":0},"EqfEgxGuhjiV0V2CQ55Ucw":{"text":"We were shocked to find out after researching their website and looking to watch another c","useful":0,"cool":0},"b4Lv2UWITAIf9qBbAT2S5g":{"text":"Great staff great food !!! Much love to Fallen and Ashely ! So friendly and so sweet! What","useful":0,"cool":0},"Bg73CLgAH3X0CI-_P3b08A":{"text":"I don't think I've ever given a place a one star review but there's always a first for eve","useful":0,"cool":0},"RWCPXv2dOsjlqcF-Cdb7lw":{"text":"My family was hot and tired and really wanted to sit down and cool off. We walked around f","useful":1,"cool":1},"HVlnNCL0aNRAFAQt4Nm09Q":{"text":"When you're sitting at Harris, every 30 minutes they blast an advertisement for Manning's ","useful":0,"cool":0},"FJ8M-3byfRK7UMl-SgjjDA":{"text":"go to trevor great guy will take care of you first time here and he made us feel so welcom","useful":0,"cool":0},"RUoXcuUZPGr3z7uQbvxPiw":{"text":"Came here with husband and son to watch the football game. Was really surprised they did n","useful":0,"cool":0},"UP6QcK88eLRHQfTpKx81ZQ":{"text":"This was our last meal in New Orleans this trip. Got here around six on a Wednesday evenin","useful":1,"cool":0},"wJ9xiO9bKw8pxWXv8N4LWQ":{"text":"This place is cute to go to get drinks and a bite if you're starving and in need of someth","useful":1,"cool":0},"0pjri_8ydCrvT5TmJjP6GA":{"text":"This is a cool place in a nice area. Im a Giants fan and traveled to see the game. Someone","useful":0,"cool":0},"M8q2MNOSWtXr6dTWkmE9Ag":{"text":"So wrong that they are not open for lunch during the week. Peolple that go on vacation exp","useful":0,"cool":0},"LQJzQ7hwTZxhRXbxs2wGgg":{"text":"I went here because I heard is a great sports bar. It did not disappoint. \n\nTim was our se","useful":2,"cool":0},"M0NzETNKhdp69fQzS0tSCQ":{"text":"I ordered a burger and fries were ice old , no condiments. I asked for new fries and the c","useful":2,"cool":2}}