{"YtxMNP3HR7QN3JJbxvNUKA":{"text":"My partner and I ordered food for delivery from this place. When the food arrived, the ord","useful":0,"cool":0},"Dt2JxxTSSGSGFLGsjq3W3w":{"text":"I was craving wings at 11:30pm and surprisingly this place was still open on a Tuesday! Th","useful":2,"cool":1},"YBVEfVcP9zoRTpN-fAqw_g":{"text":"Best wings in the city!!! Great flavors and very affordable! Menu also includes burgers, s","useful":0,"cool":0},"Yn4iPA6SsxGxfNujUiRLJg":{"text":"I had 15 Who Dat flavored wings fried well done and they were absolutely delicious and the","useful":0,"cool":0},"_9mjMr573O5I3XVPB1HD0w":{"text":"I'm so disappointed. I've visited the Old Gentilly location (if this is the same owner) an","useful":0,"cool":0},"2cMI-IZyvBJTXzagHqQA9w":{"text":"When there for the first time last night and clearly invented a new flavor.\nGot my wingpla","useful":0,"cool":1},"HIIQ_Uf46DE3RixuciBGkg":{"text":"Very disappointed with the way my fish was cooked. Very slimy and had no breading. And my ","useful":0,"cool":0},"gtFSkCWyil4Nf5aN509ghA":{"text":"Nasty under done chicken wings with stale fries that I could tell were sitting there for m","useful":2,"cool":0},"2Xg6lw2M11E_PyWSi32AOw":{"text":"Terrible! Ordered via UberEats, my order was not ready when the driver got there. They fai","useful":0,"cool":0},"d_g9NqUfMGsMrmAkV5WK0A":{"text":"This place told Postmates we picked up our $120 worth of food and we didn't. The employee ","useful":0,"cool":0},"T_AOW_ksQEfptqUM28xSVQ":{"text":"Stopped in last week to try their chicken wings.  We tried the Buffalo wings and the Hawai","useful":0,"cool":0},"yeVM99ItOZbpmNIAPWVhzQ":{"text":"Five stars all day everyday. We stumbled across Who Dat Wings on our first day of vacation","useful":0,"cool":0},"lxIXnFEgwgm7pB93-vszvg":{"text":"Sadly it took over An hour to get a 10wings and a gyro burger.. it's absolutely ridiculous","useful":0,"cool":0},"v7I7iA_RwZfdHmahWq8OQw":{"text":"We haven't been here in months and we won't be back after this experience!!!! $21 for 1 wi","useful":0,"cool":0},"o2tWrlyajaY8FnL6QELcbQ":{"text":"This place is horrible. I got sick from eating there honey barbecue wings and fry combo. I","useful":0,"cool":0},"HMFv5_QzpgYS1lUrqweefw":{"text":"Best wings in the city!!! Great flavors and very affordable! Menu also includes burgers, s","useful":1,"cool":1},"rk2WggEaMrSQxl_fV3o_vg":{"text":"Had it delivered by DoorDash so I can't comment on the atmosphere. The food was very satis","useful":1,"cool":0},"h1RPNh8EQNfvJK2Gp7sc-A":{"text":"I ordered from this place an my food was burnt y'all can do better, I am not pleased at al","useful":3,"cool":0},"m0AJK6bwSJ6ucpzemigPZA":{"text":"The wings were EXCELLENT! I will be back for sure even though I had to school them about m","useful":0,"cool":0},"vk09gHTT_rGsnLRfizf9Ig":{"text":"Best wings in the city. The Who Dat Spicy wings are perfection. The cheese ranch fries are","useful":1,"cool":0},"h1aJlZxax6l9nXP1dx6uYw":{"text":"Was good but not prepared how I asked other location is way better but if your up late and","useful":0,"cool":0},"d8xTYPoGKGAeElRZzy3y2w":{"text":"Food was really good. I ordered the hot sauce but my partner got the Wazzum sauce which is","useful":0,"cool":0},"8bzGiM7cMCUFvzoXHwH0rw":{"text":"Food was great. Well cooked wings and fries. Would recommend. Wings are crispy on the outs","useful":0,"cool":0},"KpOj-3CfQXMupNVIPGA2nA":{"text":"Y'all please don't order here. The owner hires and fires and then refuses to pays his empl","useful":2,"cool":0},"xEvFtEAZ-TSotJicexnNJA":{"text":"Order from this place today 30wings 2 order of fried mushroom which I only got 1 order an ","useful":0,"cool":0},"g7UFn7lPYtAXAW-9BNnAZQ":{"text":"4 x's this week and still the greatest. My son and I try a new flavor every time and they ","useful":2,"cool":3},"sncS-39LZ2ub5ObKKTymRg":{"text":"Another hidden gem! Best philly cheesesteak in nola! big strips of steak not that fake tin","useful":0,"cool":1}}