{"_XNGTLduNGu_I0_2JdcQhg":{"text":"The food and the ambience were fabulous. I had the shrimp and grits while I enjoyed some f","useful":0,"cool":0},"u-YNOYhm_n4vbV1c-oK6lg":{"text":"Fantastic service from Kim. Had an amazing fried chicken special. Seriously one of the bes","useful":0,"cool":0},"6ghRFwCojKuqGm1TEZ-Oqg":{"text":"Come for the music, not the food.  Dined here twice and both times the entrées were less t","useful":0,"cool":0},"qKaKqnKRrBUWgje6cuN0sQ":{"text":"This was one of my favorite music venues/restaurants in New Orleans.\n\nI had the Smoked Por","useful":1,"cool":0},"ZVfsyXg2psU5Q-3UHZyOSw":{"text":"I walked in by accident to this place and was tremendously surprised by the amazing servic","useful":1,"cool":0},"JyXBqCuilCHFZ3Jggsv7hA":{"text":"Most of these stars are owed to the food and the band, which were just lovely. While the w","useful":1,"cool":0},"drcR9G-9c5PiTE_X2ULBAg":{"text":"$13.99 buffet in NOLA unheard of!!! Only reason for the 4/5 stars, it needs more less carb","useful":0,"cool":0},"tBrPPOmaZu9hSrbvpK2N0Q":{"text":"Little Gem was recommended to us by the concierge at our hotel.  We walked around New Orle","useful":0,"cool":0},"thCHeyWAr_TmAgwvH3Tm8Q":{"text":"We saw Detroit Brooks and company on a friday night over dinner and drinks and we really e","useful":1,"cool":1},"RckNOMQG-CEKSXGlwG5dOA":{"text":"Ate dinner here before a basketball game with a friend and friends of hers. Received a gla","useful":0,"cool":0},"Zvsslu8ZsL22FkpdbuB7Tg":{"text":"I really like this place. My wife and I came here for dinner, and we got to see Ingrid Luc","useful":0,"cool":0},"Zj4NMdp1kluX37UQ0aQMCA":{"text":"They didnt validate the tickets we purchased when we came in set a tone we could have walk","useful":0,"cool":0},"veK_CGNLE5e0Xp9-zXHO_Q":{"text":"Went to hear music, blues blowout, and they switched menu to football day menu. It was Sat","useful":1,"cool":1},"lBM33crFUMj_wHp2jx9BUw":{"text":"As an overall experience, this was my favorite dinner in my 4 nights in New Orleans. This ","useful":0,"cool":0},"oTIakc8MM5znHnx98N2Vgg":{"text":"The band was amazing, the food didn't live up to the hype or the cost. Our server left hal","useful":0,"cool":0},"FDCNxvK9QNgejGF1z-xdmw":{"text":"Be sure to call and be sure they aren't charging for the show. We made reservations becaus","useful":1,"cool":0},"T4VQu6I3G2_xHxffuwZQQQ":{"text":"Came here for brunch. Great band, awesome food, fun ambiance, and attentive service. \n\nJus","useful":0,"cool":0},"4LSvXMfLni5Id9o0X4nLVQ":{"text":"Little Gem is a great spot to grab a drink and listen to one of New Orleans many great art","useful":1,"cool":0},"rNvWSqBcnNs4jGq9n21CYA":{"text":"Recommended by a friend who had a great experience the previous night and she wanted to ea","useful":0,"cool":0},"knjCki7GtCeA9Cn875qopw":{"text":"Good food and good times. Service can be a little spotty and slow but otherwise great.","useful":0,"cool":0},"907p8SAzZLlN1qREqBPfyA":{"text":"Spent one night and one day setting up for a special recording upstairs and the entire sta","useful":0,"cool":0},"_bmznrCEb5cVPqx6L1IlVw":{"text":"I thought the burger was good. We went for the Saturday night show Kermit ruffins, who I e","useful":0,"cool":0},"nvxMBvgKUIp690QK0V2iDw":{"text":"What an amazing night CCWC (Corporate Council Women of Color)  had at this place. It was a","useful":0,"cool":0},"acMprsZqiiGqe0sC1hrkAw":{"text":"We were able to get in without planning ahead during the French Quarter Fest.  Soul Projec","useful":1,"cool":0},"EjxoUQCkw4ko3__fPMhHXA":{"text":"Are you a tourist? No? Well then you should know better than to eat here. Unfortunately, a","useful":5,"cool":0},"g7FEzeJ4-uYbNnaRU4w6Yw":{"text":"Kermit Ruffins & the BBQ Swingers. One of the highlights of my time in NOLA, this time hur","useful":19,"cool":10},"VtPksrV_bIppba2nAgk3Tg":{"text":"A review as a music venue or for the food and drinks?  Both, an average sort of for both. ","useful":3,"cool":0},"tkUMRmc1D2JAmCxRaa278Q":{"text":"Service was fine ,Chicken over cooked almost burned , not worth price was excited about go","useful":0,"cool":0},"ERvRSidnLTuO2cNoznKhQA":{"text":"I visited here for lunch, I could not have been more disappointed.\nService was slow. It to","useful":4,"cool":0},"GZeMwTTLqoILuMuuFL60CQ":{"text":"Nice little place downtown. Just the right size to see the live performance on the stage .","useful":0,"cool":0},"waEMhig3wzrWfBQVufLGLQ":{"text":"The feel of this Saloon is so artificial. We all need to go in and spill more beer, scuff ","useful":0,"cool":0},"_nwmn48IDalOjBQDHuFsZA":{"text":"Coooorn bread is great. Had shrimp, fries, and crawfish Mac n cheese.  All good service wa","useful":0,"cool":0},"9aGjp_SeYGFrhjAJNHNQAg":{"text":"Good food but portions are very small.  Terrible service!!!  Think twice!!!  It was a very","useful":0,"cool":0},"0opEb9XQN3KMwsNu5VMD3g":{"text":"Great intimate jazz and blues club. Make sure you reserve one of the tables in advance - n","useful":0,"cool":0},"gKxAMZmYoeo1ScHWSPZZqQ":{"text":"Came here for Mother's Day brunch.  It was a very small menu, but really good.  The boys g","useful":2,"cool":2},"q4HYcrH-uGuNrCqU3-hsJw":{"text":"This place was great! They had a live band, it was conveniently close to my hotel (Le Pavi","useful":1,"cool":0},"UaBs0gjxK0zT7WpyzUvoXA":{"text":"I always hate that Yelp doesn't have half star options.  Little Gem definitely doesn't des","useful":3,"cool":0},"vC6Br_8lo6M2ZPOHDczOfA":{"text":"Zero stars for the worst place in a while. Horrible service, beer took forever, lost order","useful":0,"cool":0},"mzrz9qHXCcBMdsD1LgpiFQ":{"text":"Gotta give Kermit Ruffins and his show 5 stars.  What a great way to spend a Sat night in ","useful":1,"cool":0},"ip0MFwJK0Y0fKgftZAjP7Q":{"text":"5 stars for the entertainment tonight. 0\nStars for the service. Party of 5 with a 3 year o","useful":3,"cool":1},"zswEUHikwM7VCIGwBQVk7Q":{"text":"Succulent ribs, great slaw, and some very proper shrimp to kick off the evening- what a tr","useful":0,"cool":0},"tVfkVKkBXSgMGhKh6AvjnQ":{"text":"The service is rude or non existent and the food is barely passable. Thats fine because we","useful":0,"cool":0},"JmiX0K77jtgiNGndEXw1QA":{"text":"The service was horrible!  It took a long time for the waitress to bring our food. When we","useful":0,"cool":0},"4fksnNzyOgTU7jOBYI4v3g":{"text":"10:00 on Sunday Morning - game day!  Party of 4 looking for breakfast. \n\nIf you have been ","useful":1,"cool":0},"L9nYrk0RFDTx1bFa7zIMkw":{"text":"Good music.  One star for that.\nGood ambiance. One star for that\nNow I took 3 stars off.\nH","useful":1,"cool":0},"WShEjYIH25ekoSpH0mYOZQ":{"text":"Great music, good food and service.  A must if you are looking for the true NOLA vibe.","useful":0,"cool":0},"IpH-D8hDfZvPC7CtTl7ugg":{"text":"There was a blonde gentleman bartender with amazing hair on Wednesday night. Made my exper","useful":0,"cool":0},"3p1hhGFqp_JPWUPSq7OiJQ":{"text":"Friendly service, good music and great food. I highly recommend the Pulled Pork Napoleon!","useful":0,"cool":0},"ewBrolL9PTU2kT9kmLe05w":{"text":"The show was great but much too short. the food was ok at best .... extremely small portio","useful":0,"cool":0},"F-8E5tE1zhF2abpsoyXW3Q":{"text":"My wife and I ate here, had drinks, and listened to Kermit Ruffins and the BBQ Swingers, w","useful":0,"cool":0},"WswaClQjtdt68D1yrcj_gg":{"text":"I came here to see a band and grab a quick snack and drink. After ordering a round of four","useful":0,"cool":0},"tzICGZiW3WEkahAO5zdyAg":{"text":"Loved it!  Classy but not pretentious.  Casual and welcoming.   Shrimp & Grits, Kermit Ruf","useful":0,"cool":0},"35Q33YkqyNFDdaUyZg92qA":{"text":"Visited the Little Gem Saloon for the first time tonight. The theme is classy turn of the ","useful":0,"cool":0},"MSslkvOP9EEObzB6BmXv7Q":{"text":"Excellent food, wonderful live entertainment, but it really seemed like they were understa","useful":0,"cool":0},"I0KVrAsx4NOBCrYYtFHB7Q":{"text":"Our final evening in New Orleans we decided to go see Kermit Ruffins at The Little Gem Sal","useful":0,"cool":0},"8i5fsOorqWJR3OlhwoeuaQ":{"text":"What a historic, hospitable place this is. In the block where jazz was created. \nHad drink","useful":0,"cool":1},"IMuVfbuqPX1_XSGv2d2zgA":{"text":"Perhaps it was an off night for Kermit, but wasn't overly impressed with his show...and pr","useful":2,"cool":1},"pOBjiiLQ1kT9PMaFefYIcw":{"text":"Jazz show   \nFood  \nService \n \nReason why they get an overall 3star review. \nOur waiter se","useful":2,"cool":0},"YY_uHj8jK9LA4ISLQg2VDQ":{"text":"We arrived too early for the music - primarily because we were walking around to find a pl","useful":1,"cool":1},"AGX6uWtx924Pxvm-DanNfg":{"text":"Went here on a Saturday night for my girlfriends birthday with a party of 10. Ambiance and","useful":2,"cool":0},"DAw1Q6g9DRNUSmiPBQGG-Q":{"text":"My hotel suggested this location for great food & live music - it was perfect!  The name i","useful":1,"cool":0},"LAQbU5Ryz5epEb5KlHrukg":{"text":"I had heard some good things about this establishment and finally got a chance to try it o","useful":2,"cool":0},"isx_ruFZtLTXo-KwvKUWWw":{"text":"The best Brunch in town!  Night time has great events also upstairs!!!  The owners are ver","useful":0,"cool":0},"2qd0OhR-rhq8f_RAcNaScQ":{"text":"Not a gem. \n\nThis place is below average at best. Service is poor. Food is okay. Get the e","useful":1,"cool":0},"gm2XdxWxP3YOhRyNDQ6H_Q":{"text":"$50 per person for food and to watch the Super Bowl, they have refreshed the food once in ","useful":1,"cool":0},"U6rJ8GNT2pTC7WfyicR_0Q":{"text":"Got in to New Orleans at 9am and thought there would be no place to go this early.  I was ","useful":0,"cool":0},"bOgqFiGD0_g9JrxcZngaAA":{"text":"Travel threw me off by a day so I came expecting to see Kermit Ruffins, which was happenin","useful":0,"cool":0},"ellWI6iFdoRunbxnmjrmrw":{"text":"Do not eat here. Abysmal service. Legendarily laughable. Period. \n\nMusic was fabulous, and","useful":2,"cool":0},"YUeVyj4Rnmgn5InR48W-gQ":{"text":"Fantastic place. A stylish restoration of a jazz historic landmark. The food is exceptiona","useful":1,"cool":0},"IRit7bmO7CpHBMVGxtorNg":{"text":"This is the best place in downtown to pass by, eat local and Southern Food while you liste","useful":1,"cool":0},"9fWgTCCh2zzAzGke_XSrKg":{"text":"It was 2 o'clock and I hadn't eaten lunch yet. I checked Facebook and a friend had re-post","useful":1,"cool":0},"q8T7Rt_Eqolex4Txmh_J9Q":{"text":"Terrible service. Sat at the bar and the guy with the long ponytail ignored us for 10 minu","useful":0,"cool":0},"vNCbj2p176R819_YCawaYA":{"text":"Very nice place, in a historic location.  The theme is old school food and cocktail recipe","useful":3,"cool":0},"sVdcBTDYQdHdr0m0tLnglg":{"text":"Very nice cozy place. Was here for a comedy show called \"Hell Yes Fest\" . Great ambiance w","useful":1,"cool":0},"kTkJs9V0D8yPyzES1WQ2OQ":{"text":"Went for lunch as they are now open from 10-2 during the week. We were seated at 1135 and ","useful":0,"cool":0},"ktkspI3WybK4idIBYuGu_w":{"text":"Definitely not what we were expecting! Excellent live music. The venue felt like a hip win","useful":1,"cool":0},"vZzaPtuH7TlCOCI7S7gijA":{"text":"What a great low key, authentic restaurant! Our waiter, Geo was great. Actually, he wasn't","useful":3,"cool":1},"BfpaPK_5o9Zl1-nxWi3n_g":{"text":"Went here because buddy bolden used to play here. Food was great, Cesar salad actually had","useful":0,"cool":0},"9OULYtrTgz3Xz1EYrc56vA":{"text":"Brought s party of 12 here , which was prearranged by the NOPSI hotel.  When we arrived it","useful":0,"cool":0},"MS3eKJWm974UkKQC8ZV3Qg":{"text":"I always try to see Kermit Ruffins when in NOLA & his brunch show at Little Gem fit with o","useful":0,"cool":0},"yKnrffu1loDzfv7x75bsfA":{"text":"I ate the lunchtime buffet on a Friday afternoon. The chicken and Mac n Cheese were both e","useful":0,"cool":0},"ohlLtBd5Fxh_FcfCsC1J-w":{"text":"Great service...our waiter was very personable and we had front and center seats for the b","useful":0,"cool":0},"p4cF23LBbkaG-gT6Yp4W2Q":{"text":"I almost like I'm cheating by adding The Little Gem to my list after just having a few app","useful":0,"cool":0},"zske1a6H3jPngBNzg_CTSQ":{"text":"Great food, amazing vibe, and music that transforms the soul! Got to hang out with Kermit ","useful":1,"cool":1},"AVavKtg4yVKt_a9PsDybOA":{"text":"Can only speak for drinks. Dirty martini was \"ok\". Had to ask for more olive juice. Mojito","useful":0,"cool":0},"fmon83eC5zyJQNwHqqE_OA":{"text":"Had a great time watching a blues band and enjoying lovely southern food. Had the stewed t","useful":1,"cool":0},"BUD_fNufhc7pOWO5awhgEA":{"text":"Went their for lunch after a meeting... Very slow service and inattentive. Never got refil","useful":0,"cool":0},"4T_A4SRms90uzT1L-GI-ug":{"text":"Just waited 2 hours for our food. No apology from manager, even after complaints. Food was","useful":0,"cool":0},"VDLxrq7OCxm-qjKcmYoqbw":{"text":"This is a cool old bar within walking distance from the Hyatt Regency. It has a tin ceilin","useful":0,"cool":0},"2WWw2BE_8a58mRcXBX5BMw":{"text":"The bottomless mimosa brunch on Sunday with live music was great!!! Our server Brian took ","useful":1,"cool":0},"FJDzwUNwPT7mTkOmxmT6hQ":{"text":"Went to Little Gem Saloon for brunch today with a friend and it was absolutely fantastic. ","useful":0,"cool":0},"beiYS-bCvTawY4_PhQ3ZVQ":{"text":"I was at the Little Gem once about two years ago. We waited 30-40 minutes without being ac","useful":0,"cool":0},"2HFiKi9scosfdlCtqdxNIQ":{"text":"Nice idea. Restaurant at the bottom, entertainment at the top... channeling a little Snug ","useful":9,"cool":2},"ysDaBegxRFRnQNkxlujW-Q":{"text":"Had a reservation for 6 and got the table directly in front of the band! Our goal was to h","useful":0,"cool":0},"1NFUbmChBmAy3ZBLcso8Ww":{"text":"The Little Gem Saloon is in about it's 4th incarnation since it opened less than 2 years a","useful":2,"cool":0},"wl3u_D6CS2XRZkps8yJ5YA":{"text":"The music was five stars! Mark Stone, John Mooney, and Joe Kroeber put on a fabulous show!","useful":0,"cool":1},"si-YcPdRNxTKTK1GhyJL_w":{"text":"Went for the Kermit Ruffins show - great music, beautiful place, good food - horrible, hor","useful":1,"cool":1},"ORtSg_GhDhj2BDmZRU9VAA":{"text":"Came here to hear Jamison Ross Celebrate Nina Simone. Great show. Good food. Awesome ambia","useful":0,"cool":0},"j1eXVC7N3V3VpBULOBBUFA":{"text":"Went in last night with coworkers for dinner and live music. Had a local band there who pl","useful":0,"cool":0},"zZbCsdkDTavMxEKlsU1cDA":{"text":"Came here after our plans to go to the gospel brunch at HOB fell through (sold out).  We t","useful":0,"cool":1},"enRWbST3x0aazMdc0PrHUQ":{"text":"So 5 stars for Kermit show - but what a cluster of an operation! At the entrance they need","useful":2,"cool":0},"NwaGNl-H7BKEtSsrcYwqBQ":{"text":"Food needs to addressed - zucchini and squash soaked in oil - addressed it with waiter exc","useful":0,"cool":0},"SEN2LXdIwmaJadTHYrEgcA":{"text":"Went to see Kermit Ruffins who was excellent as usual and great value at $15! \n\nThe set up","useful":0,"cool":1},"6T_Yf0gnqe2i0WhXLe_jEg":{"text":"Great food, even worked with my food allergies! Awesome band and great service. Food was r","useful":1,"cool":0},"p94GB_sGIVnOo6Z0gbdLwA":{"text":"I went for lunch. The server was snooty (in fact, even the patrons seemed to take themselv","useful":1,"cool":0},"cK0Y35opN7KYunMAwhKs_Q":{"text":"We shimmied our way past a traffic accident that landed on the Little Gem's doorstep (mont","useful":0,"cool":0},"9E97DatEegJhsw0fWdOMrA":{"text":"This is not my first time in New Orleans.  But this was one of my best meals and times.  T","useful":0,"cool":0},"YkEB1hHUq7wUS0t_gQRstg":{"text":"Good music, great food and service....very nice atmosphere","useful":0,"cool":0},"Ayl7vHnLiaBo34qnGyFgKQ":{"text":"Just stopped in for lunch and glad I did.  Not only was the food very good but live jazz t","useful":1,"cool":0},"WpX9rWv1LzAsv8WxFi0yeg":{"text":"Excellent gumbo!  Nice atmosphere. Loved the staff.  Very friendly place.  Highly recommen","useful":0,"cool":0},"9YIw5bVsZgENOveIkc5Bug":{"text":"3/5 sometimes the menu is impressive, sometimes the service is a miss...\n\nhot and cold wit","useful":5,"cool":3},"48ILcGK-4QMuwaryd-Q26A":{"text":"I will give this three stars but it is more like 2.5. It really was disappointing. I never","useful":1,"cool":0},"aCvf4m9TzBgxBWjJAPLHPQ":{"text":"I'm not sure we would have stopped here if it hadn't been written up in one of the flyers ","useful":1,"cool":0},"pdUiRZfL_xUibIHPWvw2Ag":{"text":"The Sunday Jazz brunch is AMAZING!!  My boyfriend and I were able to call in for a reserva","useful":1,"cool":1},"PX783lBKpN2XrjIV7i43Mg":{"text":"Were here at little gem celebrating my God mother's birthday! My overall experience has be","useful":0,"cool":0},"ckmdkxf2hEVUo0RZnCiUQw":{"text":"Were visiting on Spring Break and wanted to hear some Jazz and have a little dinner. We al","useful":0,"cool":0},"4rJ6yyHwqJRP25JsGTkvlA":{"text":"Service was mediocre at best and food was average. The band was less than energetic. Felt ","useful":0,"cool":0},"QQOTzZO6PjqqMfR8d8-IWQ":{"text":"Before heading out to the Smoothie King Arena to watch game three of the NBA playoffs, War","useful":3,"cool":5},"st6YTm8FOhy1HYoE9geZag":{"text":"Extremely over priced.  Trying to present the food as fancy but the chef is pretty much a ","useful":0,"cool":0},"6VGtnBWVKbosRmGYPR8x3A":{"text":"Won't ever patronage this place again!!!!! What a convenient time to close!!!! I am going ","useful":1,"cool":0},"FQxA5OqVQ5wpBna2wqNgfQ":{"text":"We came for Kermit but stayed for the food! Just kidding, Kermit, you were fantastic as we","useful":1,"cool":0},"8Q21w9DXLcJ-CxYvwsYF8A":{"text":"Horrible drinks!!! The Long Island was too sweet and the grapefruit and gin had wayyyyyy t","useful":0,"cool":0},"PiGWZWi_N64jIlnWuelk9w":{"text":"Very nice place, good live music and great food!","useful":0,"cool":0},"Hn-_b53MavP02wYyzKm2ag":{"text":"This is way overdue.  We had a GREAT evening at The little Gem Saloon about a month ago ri","useful":1,"cool":0},"t3mkh9BIQZJ1QXxCx5jbPQ":{"text":"Had sunday brunch here. Jazz band was amazing. I had catfish and poached eggs. It was very","useful":2,"cool":0},"GZ_QjkrGmBat9V0ADcnOyg":{"text":"Here on business - wanted to get out of the hotel for a minute and discovered this great c","useful":0,"cool":0},"Wug7FpT_QNsSyh3e_53cRw":{"text":"Little Gem Saloon claims to have a happy hour.  Which in fact meant they had a rum punch f","useful":0,"cool":0},"kqxMaWyLJmX7zJL15TcQhw":{"text":"Really fun place and GREAT music venue. Not crowded and you can see from everywhere. \n\nHow","useful":0,"cool":0},"HiCCyLQMsXloNyFh26YM5g":{"text":"Came here for a poetry performance in the upstairs area and it was a great experience. The","useful":0,"cool":0},"7p4pIvW9q-eO4FGhJ5lpNA":{"text":"First, confirming what Christine said about the \"operation\".  They literally have no idea ","useful":1,"cool":0},"DxyemGDob7qB9Ihh4cLubg":{"text":"We were so thrilled to have found this place on our second night in NOLA. Went here to the","useful":5,"cool":1},"rspbyUKIuvE3i3C9yYwlkg":{"text":"The music was great, and the service was prompt and attentive. The fried green tomato wedg","useful":0,"cool":0},"3zitEn9NloOLfe2BsMskCA":{"text":"Service was terrible and food was mediocre. Only thing that keeps this place going is the ","useful":1,"cool":0},"OJPBxsF5Qat_ALLWwRACBw":{"text":"we just happened to stop in for a drink and were pleasantly surprised.  great live music a","useful":0,"cool":0},"mYZW1MSLAeZa6MRM6FeeNA":{"text":"Last night we attended a soft opening of the Little Gem Saloon. Their first day of busines","useful":4,"cool":0},"357a97maFf-0lT3enVRRWQ":{"text":"Came in with a party of 5 for an early work lunch. We were the only ones there for a solid","useful":4,"cool":1},"ZfQgTJ0DnYsfpUX8mo4kow":{"text":"I wish I could give this place a 3.5 rating. Ill start with the sign outside love it. I lo","useful":2,"cool":2},"U_4EDTRgFKzfzJOVrIIc4Q":{"text":"I've been wanting to check this place out for lunch. I was looking for someplace new to go","useful":0,"cool":0},"ozwv99EN2ImrKLygMc70rA":{"text":"This was the only disappointment that we experienced in New Orleans. The wait across the s","useful":0,"cool":0},"_UBMFiI7duVI6ITvG9MgCw":{"text":"Little Gem was kind enough to let the Chorus Girl Project perform here the other night.  W","useful":2,"cool":2},"5BqVnpsjFjdQnXc6d1c7qQ":{"text":"Stumbled upon this place while hanging with an old friend.  It is Truly a Gem!!!!! Great m","useful":0,"cool":0},"68qegIICKOUumMUnWh7nyg":{"text":"We had our wedding reception at The Little Gem on 5/20. From our first email contact with ","useful":1,"cool":0},"6sAsqLKEAs4nIE8EtHtCsw":{"text":"This restaurant was cool in a sense the food was just okay to me. I had the shrimp and gri","useful":0,"cool":0},"2K2Ld1r_iscDmZlC1RBGhQ":{"text":"WOW! Great place. Our server was beyond knowledgeable a great help and personable. The foo","useful":1,"cool":0},"iv0WG_RswLeIaqBzoOpP4A":{"text":"Worst dining experience of my life! Actually, I suppose it cannot actually be called a \"di","useful":1,"cool":0},"WqRx-KMyjb6xeBgNbl3mwA":{"text":"We saw Cole Williams Quartet last night. Their music was AWESOME!!! Ordered fried oysters ","useful":2,"cool":0},"F-zt6kPxOjt6chqnKELmww":{"text":"Awesome ambience, wonderful food, our server Lucious was phenomenal service!! This is trul","useful":1,"cool":0},"ZyjpwiP5LsWNS32BaQQ5Bg":{"text":"Wife and I saw Deacon John & The Ivories here last night. The musicianship and talent was ","useful":0,"cool":0},"bptpGJzf6oFmDl0tGsshdw":{"text":"My daughter and I ate here recently, because we had plans to go to another restaurant next","useful":2,"cool":0},"N85RTm1qAtrnEEHRGzPCQg":{"text":"The service is fine and the food is above descent. BUT this week you can see Jamison Ross'","useful":0,"cool":0},"EVVgr-mXyEZ58XUdDgj0xg":{"text":"First night in NOLA and enjoyed wonderful\nMusic and food. Great intro to the city - highly","useful":0,"cool":0},"w4LHeqVnC-NnC0RjT0Vb9w":{"text":"Great food and friendly staff! I stopped for lunch on the recommendations here and I was n","useful":0,"cool":0},"viAvohHMQ14mK8x2NARuVA":{"text":"Live music was great! Food was good, get there early it gets super packed! Try the fried c","useful":0,"cool":0},"kig2rmqgrXfp6f8heZqRBQ":{"text":"Tried a lot of their menu. I think the service is keeping from calling this a 4, along wit","useful":2,"cool":0},"dhuo791DGIvDkMnnUnXSvw":{"text":"If your in the CBD in New Orleans, definitely pass by Little gem Saloon, great food, live ","useful":1,"cool":0},"QqYJ_29t-JvqVSkXV9gUwg":{"text":"The food didn't taste amazing or anything out of the ordinary and the server just kind of ","useful":0,"cool":0},"qJs9wBPDgEnFmQBsOg5H8w":{"text":"This place was quite a surprise. They had a live band there in a Friday night that was soo","useful":1,"cool":1},"22XNaz_1raJfuWHR5AHFPA":{"text":"This review is based on the upstairs music venue only.  I went to see a concert but didn't","useful":2,"cool":3},"HekeyqeV6RVXXaOwtbEwRg":{"text":"Closely located near Champion Square, this restaurant offers a mixture of both local and a","useful":0,"cool":0},"sYkKYb3xm0hBctAqo8UokQ":{"text":"My boyfriend and I were here for happy hour earlier this year. They had some good deals. I","useful":6,"cool":3},"vVP_H8DR8E7r33XBNzSPtQ":{"text":"We visited on Easter weekend to see Kermit Ruffins & the BBQ Swingers and have dinner. The","useful":1,"cool":0},"xg1LhRuyf7Bl9TzK7TFfiA":{"text":"Ommmm Hello.   Why is the door locked?   8 folks are standing outside waitin to get in","useful":0,"cool":0},"U0Ssc84xAtvp884YoQFufQ":{"text":"I had the crawfish mac N cheese. That had to have been one if he best mac N cheese ever. E","useful":1,"cool":1},"wpaIH3P-o2hAolIsz9flSQ":{"text":"This place is charming. The food is tasty and the decor and ambiance are great. There were","useful":0,"cool":0},"vtIw8YICR7sutLSRjP0KXQ":{"text":"The ambiance and food were enjoyable! Service was underwhelming but wouldn't prevent me fr","useful":1,"cool":0},"ntiFl_jBP8jDpyyu9QfPog":{"text":"Nice location with great food and (when we were there) excellent live music. Really loved ","useful":2,"cool":1},"N3bAPs2wctRrvukXkJa3kA":{"text":"Came here in a group and got a ton of good stuff, with a dose of live music that we didn't","useful":1,"cool":0},"30W7_hx3_3pNI-2AHt-qRQ":{"text":"We celebrated our wedding at Little Gem Saloon last weekend (both the ceremony and the rec","useful":0,"cool":0},"KpQ1D_OZVjSezX7yduoqew":{"text":"Awesome atmosphere and food was very tasty. The crawfish Benedict was delicious \n\nThe band","useful":1,"cool":1},"aA7b8EUBwgCxTzstgx83qw":{"text":"Simple, typical New Orleans fair, nothing special. I used to love the collard greens from ","useful":1,"cool":1},"J2-eTOUT-3Ubl-rryed7nA":{"text":"Friendly service. But skip the food and see the show.  Overpriced for the quality of the f","useful":0,"cool":0},"9H4nRZFNRru3jnXNfcNI1w":{"text":"So, a group of us were in New Orleans working at The Convention Center for a week and I wa","useful":2,"cool":0},"gW_hkUcG-g1h3QQIMTMpEQ":{"text":"Back after two weeks, and this time was even more incredible than the last!  A full breakf","useful":0,"cool":0},"4n5N7_I5qxCq5WNZnYJIVw":{"text":"Nice place to gather for food and spirits.  The wait staff was excellent, upbeat and court","useful":0,"cool":0},"EzR5X5qik19j6il9HzJOIA":{"text":"Pretty good.  Venue was kind odd, but the food was good.","useful":0,"cool":0},"jxOgAWnr8R-AHOTd0vAWJQ":{"text":"The fool here is just ok.  Nothing to write home about.  The drinks are poured generously ","useful":2,"cool":1},"YlrD8Cg52oOpmT6EXtc9nw":{"text":"Ok\n\n I had high hopes when I came here when it just opened, but the food was simply uncrea","useful":5,"cool":1},"kIZyqaxkpAVOoT31HCJPbQ":{"text":"I saw some other reviews about how bad their service was and now I can attest to that with","useful":1,"cool":0},"f1d5NXcI8ga1hc6Ar3bfCA":{"text":"The mussels were great and sipping the bread in was great.   the harvests salad was smalle","useful":0,"cool":0},"p2xMEuyUCFxJDXD0fZXniA":{"text":"Holy cow was brunch a disaster. Apparently there was a going away party for a bartender th","useful":2,"cool":0},"eQYFsC_fhFoxHMz_x0VIsw":{"text":"Tasty food but lukewarm and often out of items on the menu.  Service was pretty horrid.  I","useful":1,"cool":0},"iAFbnBODn3iqcZHUTfdQ6g":{"text":"During my visit to New Orleans, I had 4 experiences at little gem. The food, service and m","useful":1,"cool":0},"x3BtFx3R8RhxYGuLlNmmbA":{"text":"More of a large bar than a restaurant, \"Saloon\" is actually a rather perfect description, ","useful":2,"cool":1},"2ngoYDrzUXOsqmDs_l0yAg":{"text":"This restaurant is rated 3 stars because the food was good. One dish was very good (countr","useful":0,"cool":0},"g94z68moX8O5RqXOhSFIOw":{"text":"Landed here for a much needed bite to eat after flying in from DC. We were seated promptly","useful":0,"cool":0},"EouZU0JWut6wIE4_Edz9bQ":{"text":"1. Location:  Easy parking all around.\n2. Entertainment: Great local music\n3. Service: Abo","useful":0,"cool":0},"hgb3Hmgic3wEPysc0O4_HA":{"text":"This place stinks.  Had a 9 o'clock reservation and we were early so when they asked us to","useful":0,"cool":0},"qYjGTnPhAY6emBwz489o2Q":{"text":"Underwhelming.  This was the most we paid for food in New Orleans (check was $100 for 2 pe","useful":0,"cool":0},"9DFjsb1OW4QzxBcq5VCipA":{"text":"Recommend checking out the Little Gem during live music happy hour.   The BBQ Shrimp off t","useful":0,"cool":0},"PnPIXhgtj4PbAms0ZWSsZA":{"text":"Visiting from NOLA and took in a show with Kermitt Ruffins who I have seen on the Series T","useful":0,"cool":0},"x0KZ2gskjD3K3kDsCHCB9Q":{"text":"Live music, great service, nice saloon, good food. We met an old friend here for dinner. T","useful":0,"cool":0},"DqghnCPVfL-LUSD5t-cCWg":{"text":"Don't pregame here. Before we to a New Orleans Saints game we stopped here. The place was ","useful":0,"cool":0},"rB1_7Dke1mT5_00Rnix_GQ":{"text":"We saw an amazing show by Kermit Ruffin!  The setting is intimate, the drinks are delish a","useful":1,"cool":0},"2DsraqbxANGUn3ikViFn4g":{"text":"The performance was absolutely enjoyable. The band was great but it performed for only one","useful":0,"cool":1},"-fGKw0M9lwcQ4lF5RwTtxw":{"text":"We had a great time here once we were seated at our table. Sadly, even with a reservation,","useful":1,"cool":0},"bUYvlrECExCkLOrEHLem_Q":{"text":"Great Food, Great Drinks, Great Staff, and Great Music when there's a band. All around Gre","useful":0,"cool":0},"BGuPF4k416rxOTeAt5rxJw":{"text":"We attended a jazz show here with tickets given as a gift. The show itself was fine but th","useful":2,"cool":0},"u7i-bRqMJA0i5YggXW9lVQ":{"text":"Attended yet another fabulous Little Gem saloon performance featuring the Ladies of Soul (","useful":0,"cool":0},"jBJtgCewHqq5ebABQMsSyg":{"text":"***Beware tourist trap*** My wife called to see if we can be seated without a reservation.","useful":1,"cool":0},"YAyhdG_LvNimqcNIH6jiBQ":{"text":"Awesome food and drinks!!! Great service!! Locally owned and operated. Great New Orleans e","useful":1,"cool":0},"D7SQvpeJSVKFkPKcHjK28g":{"text":"Our second time to see Kermit Ruffins, we love this place clean and great food, drinks of ","useful":0,"cool":0},"Y6JJkwgNnmIoLmee_5WnHQ":{"text":"While on vacation i visited New Orleans. While in Mew Orleans i stopped by the Little Gem ","useful":0,"cool":0},"j9DK9l-KdnmkHjBXp8rRpQ":{"text":"Overall, this place is a 2/3 star in city full of fives.The service, however, left a lot t","useful":1,"cool":1},"Xc_imaBF8jeoVPFQGTUTsA":{"text":"Excellent food, phenomenal music, the acoustics and the Decour blend of very inviting ambi","useful":1,"cool":1},"2GwMU5cHwfj990FTluV1uQ":{"text":"Attended yet another fabulous Little Gem saloon performance featuring the Ladies of Soul (","useful":2,"cool":0},"IJ3IxtZcx4Qcm6IHkFGI-w":{"text":"My wife and I came to listen to Kermit Ruffins and had a great time. Our server , Michael ","useful":0,"cool":1},"yOMsrVjcqD6CceVrYVgxSQ":{"text":"While this venue is a great place to go for live music, (I caught Kermit Ruffins there not","useful":0,"cool":0},"U-VstM_QtdWwyCEUKzyoQA":{"text":"One star bc cant choose zero stars.one of the worst experiences ever. Food was overpriced ","useful":0,"cool":0},"7jFA6mmYA9PoMnZ41J_QBQ":{"text":"Don't *ever* come here for a show! They do seating/reservations separately from tickets, s","useful":0,"cool":0},"6sWGWRHGi8xnRx6GVKgNLg":{"text":"Went here on a Friday night to hear Irvin Mayfield in a new trio. Quality entertainment, q","useful":6,"cool":3},"7S9MbTii7I6ls-Xj1jk03g":{"text":"Had a nice experience here with a pre fixe menu and a show by Kermit Ruffins for New Years","useful":2,"cool":2},"PjiBB0AMO80aYMJx1f51zg":{"text":"Uh...... I'm confused. \n\nThe truffle Parmesan fries smelled divine .... but tasted like fr","useful":3,"cool":0},"omYRAxzeDXfuF7fiKQQqJQ":{"text":"The entertainment was 5 star! The service was excellent, but the drinks were made inconsis","useful":0,"cool":0},"7VTU8miivotoCnqqoNn9kw":{"text":"We took a chance getting in line in hoping to catch a show without a reservation. We got i","useful":2,"cool":2},"JIbxaXdU_oD_SJoWu256dg":{"text":"I'm giving two stars; one for the lovely ambiance and because it was great to have valet p","useful":1,"cool":0},"m6ex5-VVPAp3-Xi0xVlADw":{"text":"New Orleans, bless its soul, has many wonderful venues for food and music, among them the ","useful":3,"cool":3},"7ug-vxwb3M8svmu5Kth5tA":{"text":"This place was really good for watching live jazz and blues and having dinner and drinks.\n","useful":1,"cool":0},"MDdvLh8WP9LXX8eUGmR9oQ":{"text":"One of the best music venues in my experience.  Little Gem is clean tidy well run. Food is","useful":2,"cool":1}}