{"ZRs149CVrvSyoVPLsEJcwg":{"text":"Amazing!!!! I have been a patient for about five years. The staff is extremely friendly an","useful":0,"cool":0},"cPvlVsp5mgpsXbpLThI53g":{"text":"I agree, he's the best. Cool, funny, great attention to detail and very honest. I made my ","useful":0,"cool":0},"V0aNBCxF_TJfZ4x2n4zb2g":{"text":"Located on the 7th floor. I hate office buildings, but I found street parking a block away","useful":4,"cool":2},"ij-nzYCxdJYQlWAeUFZLqw":{"text":"He is the best dentist I have ever had.  He also has an amazing staff. Highly recommend.","useful":1,"cool":1},"uD_c7bPIjUnHJhPrLXU5Iw":{"text":"I have never, NEVER, had a good experience at the dentist and still weep a little bit when","useful":0,"cool":0},"DReWYZ8f9VvWoepLG_DiVQ":{"text":"Great dentist. Easy to get an appointment, they actually keep your name on a list in case ","useful":0,"cool":0},"IkQp9bsmHRt1JQom85CiVQ":{"text":"OMG... I'm traveling and visiting in New Orleans and needed a front lower crown re-cemente","useful":0,"cool":0},"IWmVL0InMS4aRD4yunaIZQ":{"text":"I ended up seeing Dr. Roby under not the best of circumstances while visiting the great ci","useful":1,"cool":0},"w3zzv1Bc2XdG1fRSbtN1ig":{"text":"Thoroughly impressed. By no means am I embellishing when I say this is the best dentist vi","useful":1,"cool":0},"_l8vMUgTMhHTlcGS2Of2HQ":{"text":"Kent is great, I've been going to him for 7 years or so, since before the storm.  Very pro","useful":2,"cool":0},"xJODtLWhMEmsQVWyfhG0xA":{"text":"I've been going to Kent for a year, first to get a crown on a tooth, and was surprised to ","useful":5,"cool":3},"ete_HQ-P0i9NcF_p3frhjw":{"text":"Dr. Roby and his staff are the best!  I was referred by a friend, and have been going to h","useful":0,"cool":0},"TyRWEWTjwkKIKJ9Dgmr2yA":{"text":"Literally.  Hands down. No joke.  Best dental experience ever.  Clean, contemporary office","useful":1,"cool":0},"FByj6cQIsc4YVOfpxr31aw":{"text":"While visiting the beautiful city of New Orleans, I chipped my front tooth. Not knowing wh","useful":0,"cool":0},"TkuFTNjmov8MmYj6WF999Q":{"text":"Dr. Kent Roby is the best dentist!\n\nI went a few days earlier to Canatella for a routine t","useful":3,"cool":2},"UHYyfuW38f4axLPPhhiuPg":{"text":"I'm very diligent about going to the dentist twice a year and work hard to take care of my","useful":0,"cool":0},"LvrgDckzzNNUzXYWRoVYeg":{"text":"Kent Roby is the best dentist I've ever had, and over the years, I've moved a lot and had ","useful":0,"cool":0},"0dcqxc2unIbsFRNEoeOFDQ":{"text":"Dr Roby is an excellent dentist who can take care of any dental issue that may arise...roo","useful":7,"cool":5},"zJiBtw86EUuYsQiCmQP94A":{"text":"Best dentist ever. Love him already. He handled my crown after needing a root canal after ","useful":1,"cool":0},"RkAWxgQ0OxnCXAx4H_zy0w":{"text":"Best dentist and staff around! I have extremely sensitive teeth and am always nervous goin","useful":0,"cool":0},"OC4_7lrsftrpYqr4e2nsIA":{"text":"I visited Dr. Roby for the first time and was very impressed.  He has a very nice office w","useful":1,"cool":0},"GhP7VcJ58ePkyp3bj5pKbA":{"text":"Very friendly staff. We were kindly greeted at the reception desk. Then it wasn't long til","useful":3,"cool":0},"3l_EY2r0uEIS9UyFr5NHJA":{"text":"I love everyone in this office. They worked with me to get me in to finish a procedure as ","useful":0,"cool":0},"GjYlNEE5qJRuXqIRHlQoNQ":{"text":"Dr Kent was amazing! I got two bridges in two hours from start to finish. He does everythi","useful":0,"cool":0},"kDC4lbAjUYgyTTfcW6zwSw":{"text":"To be fair, I'm a weirdo who enjoys going to the dentist, but- I really do have nothing bu","useful":0,"cool":1},"BB1TjVjBcixsnaCYDnYgFA":{"text":"Dr. Roby has been my dentist for more than 10 years.  I drive from another city to see him","useful":2,"cool":0},"innylzCi-q__p8_TV_fqDw":{"text":"Called the day of suffering from a horrible toothache that sprung itself on me last minute","useful":1,"cool":1}}