{"Ki90-hauSIfW_7sBuBBqfA":{"text":"NEVER AGAIN. This is a so called restaurant that does nothing that a restaurant should oth","useful":2,"cool":0},"SsR30MKLikZUazS1L2ADfA":{"text":"I absolutely love coming here. Great outdoor place with a wine selection you can't find an","useful":0,"cool":0},"MCsvM0AX9l-UG641iQKacA":{"text":"Amazing food!! and  the whole experience is great there every time. I suggest going there ","useful":1,"cool":0},"bd5QvdMJJYPWK535BMJp1w":{"text":"Great hangout for wine, cheese, and some music outside.  Tried some of the food - bacon-wr","useful":0,"cool":0},"5Hk338X4XlYbVdFkWkfnRA":{"text":"Favorite place to go in New Orleans. Chill backyard bar with great local music options.\n\nS","useful":1,"cool":3},"rn9eF2dQTcOGLPdKd9pjnQ":{"text":"Such a cool atmosphere and unlike anything I've ever been to. You walk into the wine and c","useful":0,"cool":0},"9XwzassGe6EqIhhKXBeuxQ":{"text":"Really cute wine bar/patio with a store in the downstairs where you can buy whole bottles ","useful":0,"cool":0},"Vinh3nZcajgCRLheXFp73g":{"text":"We came on a hot sorcerer of a day to avoid the heat. There were a total of 5 people in th","useful":2,"cool":1},"y9vGcZ2YrpbRcqn0J2Sw_g":{"text":"My group came on a rainy night so maybe we missed what all the fuss is about. Felt like th","useful":0,"cool":0},"VIC5IRQmCsVD3nfdH7d__g":{"text":"Like walking into a cave with Bacchus himself trying to sell you a bottle or 10. Best sele","useful":2,"cool":1},"-Ujd_eyU7QYS7-TcWpBPcg":{"text":"Hey! This is the best place I have ever eaten at in New Orleans and quite possibly one of ","useful":0,"cool":0},"zVxRXCgs7oY4SHepPL8f5w":{"text":"What could be better than sitting outside with wine and cheese, listening to music? Get th","useful":0,"cool":0},"AITSRZpUhZKRP0IgnwvYXA":{"text":"First, location...if you are staying near the French quarter, this place is a little bit o","useful":1,"cool":0},"kbSD7op33xr1TLcr2sSIxg":{"text":"Perfect New Orleans experience! Live music, great food and drinks!\n\nThere are refrigerator","useful":0,"cool":0},"8Fl_liTivVzRKmhEDirRUQ":{"text":"Bacchanal Wine - one of the things that always serves to remind me what it is that I love ","useful":0,"cool":0},"S46ksmLKZfu4-Se8iqU9nw":{"text":"Great concept, perfect atmosphere, even better food.\n\nWhat looks like a small corner store","useful":2,"cool":0},"eqj5Hx3kG_JA-v3iLAgmBA":{"text":"Really chill atmosphere. Had the special sandwich for lunch which was delicious. Fiancé ha","useful":0,"cool":0},"vgtSOTEURkKTPmW9CrKEvA":{"text":"A great place to listen to live music and have an afternoon cocktail or three. The hodgepo","useful":0,"cool":0},"mGX6eNjDu8wLC2G6xSJtmQ":{"text":"Great atmosphere with a large outdoor seating area. Usually great bands. And love that you","useful":0,"cool":0},"aT1m41JSkUGOhXPK82MCQg":{"text":"My best friend and I got an Airbnb in the area and this place was suggested to us by the o","useful":0,"cool":0},"o8z8x6dw8EhO8oliXNQLMw":{"text":"I have no idea why this pretentious, dirty place is so popular... If you like terrible ser","useful":2,"cool":0},"X6h7uIRPioAGvWyOrPu8gg":{"text":"Great jazz. Great wines. Filthy bathrooms. \n\nThis place needs to invest in some Bon Ami ab","useful":1,"cool":0},"OB9FBVQTN5GlHL3F9tAALA":{"text":"Finally checked this place out last night. Really quaint with great ambiance. There is no ","useful":0,"cool":0},"HTzc_vq5blBbgRARhHoDxg":{"text":"Very cool spot with nice people, good drinks, great music. 4 stars instead of 5 because a ","useful":0,"cool":0},"8wCdjIvlh-iAWNsSycBmcQ":{"text":"Wow! What a spot! So neat. There's a store in the front if you're carrying out, or there's","useful":0,"cool":0},"2rY3UrDLi7xkqcnTgPdjpg":{"text":"I really wanted to like this place. I went in knowing about the unique setup, but didn't a","useful":1,"cool":0},"6KABt8CZB1CCCWE69xJmgg":{"text":"Came here on a weekday afternoon after a city-wide bike tour.  It only hinted at the music","useful":0,"cool":0},"vTJdhic98PNuA14DeGfaWg":{"text":"Had to check out this spot seen on every YouTube vlog ever. Luckily for us, our Airbnb was","useful":0,"cool":0},"QIad1lx1ktZobxlvnloHRw":{"text":"Fantastic food and affordable wine by the bottle selections. The ambience was very lively ","useful":0,"cool":0},"bAzfrielsCxwCb2SCiKZdQ":{"text":"Looking for a funky little place to hang out? This is it! Its got a huge wine selection an","useful":0,"cool":0},"eWQS1_qTNtXZ79gl1G1kcA":{"text":"Bacchanal is a fun spot to meet friends. They have a great outdoor section and an awesome ","useful":1,"cool":0},"ys8lGUinqqNRIJ3YR39_Xw":{"text":"Awesome vibe, great wine and food! The live jazz is great. Order the cheese and meat insid","useful":0,"cool":0},"1hKI1rl7sVkst-1s3-sKvA":{"text":"Hidden Gem! Great outdoor patio for spending a relaxing afternoon or evening in New Orlean","useful":0,"cool":0},"kTxihSWLVHeO9xsD_w0Wow":{"text":"Amazing enviornment, I love this place! My wife and I love wine, cheese, and live music. I","useful":0,"cool":0},"ftoaZjfjjYsMfHrlFQqVUw":{"text":"Loved it.  Great wine selection and patio/courtyard area.  The food menu was interesting a","useful":0,"cool":0},"vmfno4HtPiSnZJgzItU86Q":{"text":"I love the funky Bywater uniqueness of this place.  Great lunch sandwich menu with reasona","useful":3,"cool":1},"7ife3EZuh07a9tEzs_H7PA":{"text":"I had been introduced to Bacchanal about 6 month earlier and loved it. I am happy to repor","useful":0,"cool":1},"RwDOAIEnd0t6ifq8j1Jqsg":{"text":"Perfect place to spend an afternoon. Staff is great, prices are right (especially during h","useful":1,"cool":0},"nUqicwudteLb3ieIW8IksQ":{"text":"The 5 stars are for the uniqueness of this outdoor place for music, wine and food with a c","useful":0,"cool":0},"5AS0gnrphyL-SfYMQNUeGw":{"text":"Really amazing place. Definitely worth the visit but will be a more expensive outing! We g","useful":0,"cool":0},"5rh18UrFS58oyG7YIunXow":{"text":"This place is seriously so great. I would live here if I could. \n\nWine, cheese, chocolate,","useful":0,"cool":0},"0dUUAWUjkZ7lsIthyouCWg":{"text":"What a great place. A must go to when in NOLA. Not a Bourbon street bar or night club. Its","useful":1,"cool":1},"efTF7nccZqvs4nH1GpDgRA":{"text":"This place is really nice to get away from the Bourbon St. Environment. We arrived in a ro","useful":0,"cool":0},"_iAl2HilGKe4u0ka8Qkafg":{"text":"Cutest wine bar ever!! \n\nAmbiance 5/5.\nWine 5/5.\nCheese board 5/5.\nMusic 5/5.\n\nThis place ","useful":0,"cool":0},"dFVKCozY04kPwkrQKmi8iA":{"text":"This was by far my favorite place in New Orleans. I wish we had one in LA. Thank you for t","useful":0,"cool":0},"I9HBucniOX3QyrNcG_4F-Q":{"text":"This place fits New Orleans to a T. It's laid back, casual, unique - with good food and li","useful":0,"cool":0},"qIg0BA3FUxCUVnvDJXn2Qw":{"text":"Doesn't get any better that this! Loved the music, great atmosphere and the selection of f","useful":0,"cool":0},"PEO6es6OrBRNnB6g3IyK_g":{"text":"Great way to spend a Sunday in NOLA.  Cheese plate was delicious and the music was perfect","useful":0,"cool":0},"BS3Q67l2d2R1_o1MT9Gn5g":{"text":"This place is a pretentious dump.  The wine selection is basic and grossly overpriced.  I ","useful":0,"cool":0},"f-snSa0goITqmbq3QzBI1g":{"text":"An oasis of peace and inspiration, away from the touristy/busy streets of the French Distr","useful":0,"cool":0},"dyqO-M95n9r0Jhjsn1HX4Q":{"text":"In LOVE (and now that they have been featured in a \"spots NOLA locals don't want you to kn","useful":0,"cool":0},"Pw4eRN0SXPj3k-mXctMb4Q":{"text":"Off the beaten path, cool wine spot. Music, food, and great ambiance. It's at the corner o","useful":0,"cool":0},"9EMveqCbebDBskm-w0RBzw":{"text":"Great wine great cheese plate HORRIBLE customer service. From when they checked my ID outs","useful":1,"cool":0},"6-94XA4pp4PF0W2zgYK7IQ":{"text":"I lived in New Orleans for several years and have eaten at many of the city's finest resta","useful":1,"cool":1},"iuRkHKAwF10ptg0CXUMaLg":{"text":"Bacchanal is the icon of what I think a lot of us on Yelp look for - a hidden gem that is ","useful":1,"cool":0},"2fWC2aUA4vRf3mA0GHSIMA":{"text":"One of the highlights of our trip to NOLA. We gobbled up our charcuterie in delight, sippi","useful":1,"cool":1},"iklK69gWVVWzrAV6JvTnMQ":{"text":"Overall Bacchannal is just what any cool city needs....\nAfter a long Essence weekend, a fr","useful":0,"cool":1},"h8DG5Rp2eajaQVlIUYdZEQ":{"text":"Just a fun place. Great selection of wine with a very educated staff, great food, great mu","useful":0,"cool":0},"WTMKQ8mp7FJNMJY_-ByCGQ":{"text":"Nice place to chill with friends and have a relaxing drink. The staff was great. Very help","useful":0,"cool":0},"RxEgjMCilAX6Qat1iv28nw":{"text":"A place that is not to be missed! Special venue to experience really good jazz music in NO","useful":0,"cool":0},"9UeV3LwI9vdk5PprFtIO4g":{"text":"Absolutely fantastic!! We were lucky to have Bacchanal recommended to us by a local and we","useful":0,"cool":0},"VjbDjxXy7kck7EuPjJiLNA":{"text":"I went here more than a year ago and still dream about it! Everything about it was great -","useful":0,"cool":0},"L2dOi4k9Y4r48udv73sHoA":{"text":"Three stars for the atmosphere. I found Bacchanal to be a really nice place to relax, drin","useful":2,"cool":2},"O35QjXpEWL8QAtxyQ6pcvQ":{"text":"Bacchanal is constantly evolving, starting as a sleepy wine store with weekend tastings an","useful":7,"cool":1},"09fbDjOc6nRgelKnX4tv7A":{"text":"This place is a must when visiting New Orleans! The music was awesome and there is no bett","useful":0,"cool":0},"Qr-MVOTurvoIGhvyvZ-zfw":{"text":"I know diddly about wine but the boyfriend and I decided to make a visit before flying bac","useful":0,"cool":0},"bR6_hXLNFu9rc17w7TL5HA":{"text":"Loved this place and Bywater. interesting music, neat food and wine choices. Seating is a ","useful":0,"cool":0},"e1tShvXEgvdogimywLM4zQ":{"text":"This place is simply fun.  Where else do you get to buy your wine and cheese, have a custo","useful":0,"cool":0},"NYiz18LNot1Fc8qtFx8Ycg":{"text":"This place is amazing.  In general, the vibe alone is 5 + stars.  The back courtyard can b","useful":0,"cool":1},"nbFHOo52X9ApCsPPj2icFA":{"text":"Live musics, various choices of foods, large selections of wines\n I love it!","useful":1,"cool":0},"_7gyYlLCGmmCIgDQbgekIw":{"text":"Amazing food, great wine selection and a beautiful patio. We ordered the buccatini and bur","useful":0,"cool":0},"cnsynQpMiN0ecNUDVtsgwg":{"text":"Get off the tourist train, and dine like a local! I visited New Orleans for the first time","useful":0,"cool":0},"-1Vpb_hfA_0-kuemnMx8LA":{"text":"This is the place to spend time with good friends. They have live music and it's not overl","useful":9,"cool":5},"Ih2x3a7Y90T3TrBHMGkFDw":{"text":"Wow! So far my favorite place I've discovered since moving to New Orleans! The atmosphere ","useful":0,"cool":0},"GMkLF4EGymyJhQPFOd-VlQ":{"text":"This place is awesome, although a bit confusing for a first timer. It's not entirely clear","useful":0,"cool":1},"cV-DjpRDFhHcxzCtYMjqnQ":{"text":"I came here with a group of friends last night for the first time. Everything was incredib","useful":0,"cool":1},"pIcdDw9Fw8gbfCJm3FAfoQ":{"text":"Everyone has told me to come here and I am so glad I was able to. The music is never too l","useful":0,"cool":0},"6z1-Q1r_7IHDxSnEAeorDQ":{"text":"I HEART Bacchanal! Imagine if your best friend had a great backyard, the skills of a celeb","useful":2,"cool":4},"XKTUG8Ng4vEHdr2EhZ9uQQ":{"text":"Lovely chill spot to drink wine with meat and cheeses. Had a nice band playing. Enjoyed th","useful":0,"cool":0},"AWetb5SF5VsnWH6BK2jpmA":{"text":"My favorite surprise outing in NoLa. \n\nWhat's not to love about this place?  Everything, E","useful":0,"cool":0},"Wwwluwypiy_Ulr9o9-LNvQ":{"text":"This place is so cool! I was visiting NOLA from out of town, and one of my friends who liv","useful":2,"cool":0},"8QZ3-qTK5jMiP2jmZRsBMA":{"text":"Quintessential New Orleans atmosphere, were able to show our out of town guests what we ar","useful":0,"cool":0},"PUi_EOjJe0-AEwFIJfDjqA":{"text":"LOVE the outdoor atmosphere and cheese plate at Bacchanal. \n\nOh, and the selection of wine","useful":1,"cool":1},"ZmqF8wXzlDTD7jKAy78f0g":{"text":"What a wonderful hidden gem!   This is a very unique bywater dive.  You would never realiz","useful":2,"cool":1},"OBeMENd46y9UuiGpX8-UEw":{"text":"Their staff is knowledgeable and as much as I love coming for a bottle to have out back, i","useful":0,"cool":0},"vpC1Y8eAsNR8_sseyZY_Xg":{"text":"Such a fun time on a beautiful night. Find a table outside, listen to some amazing tunes a","useful":0,"cool":0},"pIOnqy79PsF69py8R0lZ6w":{"text":"It's like being in a friends yard, but your friend has an incredible wine selection, out o","useful":1,"cool":0},"XhrwSYRIojQY7KkLs88z2A":{"text":"Unexpectedly the best part of our NOLA girls trip. To say I'm obsessed with this place and","useful":1,"cool":0},"JXZkvB2N_bc4JeG2dkmfdg":{"text":"This place is amazing\nFood was outstanding wine choices good & prices excellent \nLive musi","useful":0,"cool":0},"sW7cYb0mg5MG1RG-xcjARQ":{"text":"Worth the effort to get here. Cool concept that offers a lot.  From the wine store on grou","useful":0,"cool":0},"etKhQqNXU2u56gwEI8HZiA":{"text":"When asked what my favorite place to eat here in New Orleans, I always pause and ponder. B","useful":2,"cool":4},"EvFIPKufkyTKzzJejMYQJA":{"text":"What a great unique place. My sister took me here and I loved it. The bites were inventive","useful":2,"cool":2},"WRxzmrNWtISxFajzFPDwYQ":{"text":"When you can choose your beverage, amazing cheeses and then leave it to the plating people","useful":1,"cool":1},"o3CxAiA-i3iZVGnQiRjxQA":{"text":"This place is awesome.\n\nYou walk in, place your order, and go chill outside at a table to ","useful":0,"cool":0},"BFk0qU8tAexbEvgje3FwVQ":{"text":"Very nice quaint place. Grab your wine and cheese head outside pick up your glasses and bu","useful":0,"cool":0},"8Y3Qnh74cQd2S-iTXjrLmA":{"text":"Through the wine shop and out into the back yard, uncovers a secret garden; this one is wi","useful":3,"cool":3},"OpBNCFY3wxS3_R9qfU9DAw":{"text":"How can anyone not love this place? Wine, food, music, and a very relaxed setting. All at ","useful":0,"cool":0},"sJx-XIw0m87VaQhE61vJ6g":{"text":"You know..I love the city of New Orleans, the people, the food, the music, all of it. And ","useful":1,"cool":0},"vc5EhTLwd-FIw5aTR_RGVA":{"text":"My wife and I have been going to New Orleans once a year or so for the past few years, spe","useful":0,"cool":0},"fFlyjYMzjeu2Qzlj0UR2_w":{"text":"I love this place.\n\nBacchanal should import their concept to other cities. Buy a bottle, g","useful":1,"cool":1},"0j31-OrChKdbENUu6-kwQA":{"text":"Yes, just yes. Because it's described as a wine bar, I really thought it'd be a stop on ou","useful":0,"cool":0},"B1JJvDwgYFKxSJIrRvu8NA":{"text":"I'm from San Diego and was told by a friend that no matter what, I needed to go to Bacchan","useful":0,"cool":1},"hIfVqLAEUPVWIIA08s__Ig":{"text":"Wonderful outdoor experience. Mingle w/ friends & strangers, listening  to cool jazz on a ","useful":0,"cool":0},"mNW90tEWL_JkkO0ZeXij3w":{"text":"Awesome layout, great music, interesting drinks, and knowledgeable bartenders. I had the C","useful":2,"cool":2},"6iF1T_pBZPOLpD33LUbdlA":{"text":"Stunning atmosphere, great live music, friendly, knowledgeable service, great wine selecti","useful":0,"cool":1},"KCScu_S8IqArff3IBipOQA":{"text":"Absolutely loved this place. Perfect ambiance for wine and live jazz lovers, this is a mus","useful":0,"cool":1},"F8Tk8u3HOxM-SMqt04BrEQ":{"text":"I came here with my mom and two of our good friends. We were lucky enough to get a great s","useful":1,"cool":0},"NQTCJS6plz0Ez02NnPncxQ":{"text":"Gorgeous place, great music and good wine. Was in New Orleans for a wedding and my coworke","useful":1,"cool":0},"p9WZXKakTNqv5ktbWVgF8Q":{"text":"If I could give a minus, I would. My husband and I ate there, and we both felt sick, after","useful":2,"cool":0},"Vph_GRN2jFl61xpkXrMmLw":{"text":"It's a wonderful place. My friend who lives in NOLA brought me here to hang out as the loc","useful":0,"cool":0},"6JA371DcXgDDUMIBGaZBvQ":{"text":"What a gem!  Great wines relaxed atmosphere. Very helpful staff.  Absolutely fresh delicio","useful":0,"cool":0},"I0Oxc3ju4fOQeEk_s08ftg":{"text":"I ordered the grilled octopus, ramen, and chocolate bark. The food is mediocre but the  am","useful":0,"cool":0},"3hczEkH3eHnl3y0hCGbolQ":{"text":"Bacchanal is the best spot in New Orleans for an afternoon (happy hour where glasses of wi","useful":1,"cool":2},"FumB70QhESOYjKvKEGSAXQ":{"text":"Atmosphere is amazing.  What a great concept.  Perfect for a low key evening. Wonderful wi","useful":0,"cool":0},"gFep_ejtaNO0gF4Mv7ryzg":{"text":"This is one of our favorite, must-visit spots in New Orleans. It's a wonderfully quirky wi","useful":1,"cool":1},"Y0AqYFeIZw1hu-F4nLiYfA":{"text":"Visiting NOLA for the first time with friends to celebrate my husband's 60th birthday.  We","useful":0,"cool":0},"X44YNoFkp9zi4TIjPGqZFw":{"text":"Spent a few hours here on a beautiful Sunday afternoon and frankly could have easily spent","useful":1,"cool":1},"_keNQO6bZwi4gHO53vESIw":{"text":"Love this place. The outdoor area is like a huge backyard with lights strung up and a smal","useful":0,"cool":0},"XiT5X0mKIyzZyRLlJiMrjg":{"text":"We picked our own cheese for a cheese plate and tried some great new wines. The atmosphere","useful":2,"cool":0},"_0ICPyyETOd4L-Djqf2A0w":{"text":"I love this place.  I've been coming here for years and intend to continue coming here as ","useful":1,"cool":0},"eCpAoxcX-5-K3DDouC8V3Q":{"text":"What can I say?  Its someone's backyard, which is nice and its help yourself, which is oka","useful":0,"cool":0},"o4YPTGT1TNKd03QU3eBBDQ":{"text":"THE place to go to if you are in the bywater, love music, and can't wait to drink some win","useful":0,"cool":0},"vtf9hGQC6CsRnv3bHQ1Bbg":{"text":"Tues afternoon, the message machine said live music\nHmmm must of missed it. But once you h","useful":0,"cool":0},"LkvkhYKTEicpqtOVrkHOrA":{"text":"A nice cozy place with a patio and live music. We came here on a Friday night around 7, an","useful":0,"cool":0},"37OAh7XYES3m1saLdNgrCw":{"text":"All I can say is ...WOW! Funky fun location, great venue, and amazing food! We had 5 diffe","useful":1,"cool":1},"RMVUxRTxz7vCXN18NRY0jg":{"text":"I am not a stickler for things like furnishings and clutter, but finding my way to the cou","useful":1,"cool":0},"Odc317OzkHUuYf4qO0ZtBg":{"text":"I was in NOLA the first week of January and Bacchanal was on my must-do list. We made the ","useful":0,"cool":0},"Ac0-NDET_xnl8XGhO5aGuA":{"text":"We had a great night here. The wine selection was great and the staff were more than helpf","useful":1,"cool":0},"BPbxj33noMYEHifyJKlktg":{"text":"This place is great on a lot of levels. The people know the wine that work there. Very hel","useful":0,"cool":0},"CTx6Ida-Y9QldSqG7T4mLA":{"text":"This place is it. Walk into the market, pick your wine, cheeses, and any other tasties you","useful":0,"cool":0},"ip57ZnVL4mX8SJwS2UQOig":{"text":"I wish I could give this five stars. I really do. The atmosphere is phenomenal - we got a ","useful":0,"cool":0},"eFYwSsWldcwNgqQKgiAbUg":{"text":"Like hanging out in a really cool friend's backyard with a really kickin' wine selection.\n","useful":3,"cool":2},"aymFqMW7A7gIx-qFa-D_WQ":{"text":"Off the beaten path and full of locals, which was amazing after a day of the tourist fille","useful":0,"cool":0},"GqFzqkYSazoSg2m8k-38SA":{"text":"I love this place. I even had my boyfriends surprise birthday party here. They have free w","useful":1,"cool":1},"vugIe58tNxKN6ZEyn8HdFw":{"text":"The front guy wearing ugly bowling shirt is rude as fck and it makes this place suck, but ","useful":0,"cool":1},"d-YK9uDvMo_3N733s0QFeA":{"text":"Read about this place from an article on enRoute, it sounded interesting so when I got to ","useful":1,"cool":1},"jVdw8wkiLUfemHy2yaGb4A":{"text":"It's been awhile since I wrote that first review. I've been a few times this year and am h","useful":1,"cool":0},"SHVEfnHY3c2lyCmH16rqfg":{"text":"Awesome spot! Live music, great wine selection hence it's a wine shop. Excellent bartender","useful":0,"cool":0},"k4tpk8CGMaFJ-1iIbVSnbw":{"text":"One of the best locations in NO. European concept of outdoor open seating. We were invited","useful":0,"cool":0},"iw3eu6fQuaEh-lcRgkg2Uw":{"text":"Absolutely amazing ambiance!\nOne of the first places I ever went when I moved to New Orlea","useful":0,"cool":0},"WALK-b4Nf2510uXk40y7Og":{"text":"This may seem a little out of the way but if you are within a 5 mile radius you must go. W","useful":0,"cool":1},"VKjUyhXzF9KuQMeQqgXiJg":{"text":"Our favorite mellow place to hang out with.  The food was great, wine selections were awes","useful":1,"cool":1},"votk0rnGRN1-vzyRRzgBqQ":{"text":"Great selection of wine from the wind store in entrance.  Staff provides informed advice i","useful":0,"cool":0},"xxLLFZrH87sb1t0Oj9RcFg":{"text":"I should have listened to the Bacchanal workers when I messaged them on Facebook and told ","useful":0,"cool":0},"akHEtoj_qa3D6GWI60vCAA":{"text":"Oh.  My.. Steak, and pepper with crab. Delicious. Atmosphere was VERY lively and fun and s","useful":0,"cool":0},"4BLEPKOaFgDMaM2JwUJrBQ":{"text":"Favorite place in New Orleans by far! Loved the vibe, food and love music! We ordered the ","useful":1,"cool":0},"7ZWuTmgEa20m81TdULXnUg":{"text":"Happened to catch Bacchannal Wine on a Saturday night with two competing events going on. ","useful":0,"cool":0},"SGW5WLYMiwn1c2_QPbuk8w":{"text":"Love love loved this place!  I was in New Orleans on a girls trip and I had heard about th","useful":0,"cool":0},"cYAN1kKkxkO1_8byCG8LTw":{"text":"My boyfriend and I went here for his birthday while we were visiting New Orleans. The guys","useful":0,"cool":0},"SqICpGQCJ3u3rfmKe9wlWQ":{"text":"My second trip to NOLA, went with family and friends in a group of 9. Awesome food. Easy t","useful":1,"cool":0},"um8Nqu4TbMDh0a33kwvshw":{"text":"We went on a Monday evening and had a great time. It was surprisingly crowded but we share","useful":0,"cool":0},"ADoHat1D0H9x98C8mlu37w":{"text":"Have you ever wished you could buy a nice bottle of wine (as in, at a wine store) and then","useful":0,"cool":0},"m1myCXvmn0nx3GNbLGgCBw":{"text":"We were told about Bacchanal by a bartender in town, who spoke highly of it. \n\nWe enjoyed ","useful":8,"cool":1},"1KCxYoo2p32Q0c_5N4WdEQ":{"text":"This place is really fantastic. I rarely find a place where I feel right at home. This pla","useful":0,"cool":1},"jVEQ1vHrb8MXTMwNP8B4pw":{"text":"This little treasure is by far my favorite go to spot! There's a wide variety of wines, ch","useful":6,"cool":2},"XcPdQWZMybFynZ6wQGbiUA":{"text":"I just fell in love with Bacchanal! So romantic  and laid-back and warm and welcoming. So ","useful":8,"cool":5},"Uvk5nmrM8u5l179tqVWpTg":{"text":"This place is a treat; you can spend hours there easily. Here's how you do it: get a group","useful":2,"cool":1},"YtO94Os73c6N_4_y3pwA4Q":{"text":"Amazing music and great wine and drink selection. Awesome place to chill and talk story wi","useful":1,"cool":0},"ASUwjQeLvnfvirMbFh32gw":{"text":"I really enjoyed my first visit to Bacchanal. Large selection of wine and raw cheese, whic","useful":0,"cool":0},"PHoY61R02_bKS_QneMKOIA":{"text":"Really cool ambience. I love the lights and the stage outside. Even when it's crowded, I'v","useful":1,"cool":0},"xNB6Z4FnHd4wBRXTGD8-RA":{"text":"I really loved this place.  It was phenomenal!!  The only thing that sucked was the servic","useful":3,"cool":4},"iwiAZkF635nnpmvDSrN2AA":{"text":"From the front, Bacchanal looks like a regular old wine store. You step inside and see ton","useful":0,"cool":0},"KjDZKCC-jPV4WNpmozVeuw":{"text":"If there is one thing I have learned in my time spent in New Orleans this past week, it's ","useful":1,"cool":1},"1HU4Gr6acq-bgU4EfWbG_w":{"text":"Wow, what a great idea for a winery restaurant!  The entrance is a wine shop where you can","useful":1,"cool":0},"nBfwF7GCBG9S66tenDMuKQ":{"text":"Hidden gem! A bit of a cab ride from downtown but well worth it for getting off the beaten","useful":0,"cool":0},"IA3YxZxLHdoPd1CyRUGD0w":{"text":"Unbelievably cool place. Wine store on the first floor, bar on the second, huge beautiful ","useful":1,"cool":0},"rnBffgr3QiXUpKef2YFScg":{"text":"I really dug this place.  We stopped by here after grubbing up a the joint and just maxed ","useful":0,"cool":0},"ohamIOGd3_sqAb6-zjPaAg":{"text":"Give me a bottle of red wine and a backyard, throw in some good company and/or good music ","useful":17,"cool":12},"iDogmXM-ApRzGufU8jJjPQ":{"text":"This place is wonderful. Cool vibe. Pick your favorite cheese and grab a bottle of wine an","useful":0,"cool":0},"uHZD1fnaO0h9gzMS6Hy5cA":{"text":"This is one of my favorite places to go in New Orleans.  The food and wine are really good","useful":0,"cool":0},"sCfto_ocmx76VVygExbEgA":{"text":"We returned to this lovely establishment because we enjoyed our first visit so much. Howev","useful":0,"cool":0},"eIAi4dkCAeXO3c4WwfcXrw":{"text":"Bacchanal is magical. Period. We stumbled across this per a friend's recommendation after ","useful":0,"cool":0},"jqORM9MWFhE0Jb8rpJOPhQ":{"text":"Amazing atmosphere and wine/cheese selection!  Was a highlight of our trip!","useful":0,"cool":0},"heqIe5TyMmnhvotbtRMZoA":{"text":"Great selection of bottled wine and they even offer a vegan cashew cheese! The music and a","useful":1,"cool":1},"UXq5_P5f3d03FCreuxanmQ":{"text":"One of my favorite places in NOLA! A great place to grab a bottle of wine, cheese plate, a","useful":0,"cool":0},"72Fq8qNEWkU0NGYhWXoUQA":{"text":"Great way to spend an evening out away from the typical Nola night. Great selection of win","useful":0,"cool":0},"RPw-mDB38CAhPIcDzXhcsg":{"text":"Bacchanal is one of my favorite places in New Orleans, having live music, an outdoor patio","useful":0,"cool":0},"VQDpX7dlX16YcLMKFdc2yQ":{"text":"This place is pretty unique in that you walk through it seems like a wine store to pick yo","useful":0,"cool":0},"q29FvFks2RXaozeXqXDedA":{"text":"If you like being insulted, treated like crap, ignored (because you're not a local), follo","useful":4,"cool":0},"8gPA_IvKuL_yLwTj0zuk2w":{"text":"Awesome place, reasonably priced and service was great. Listened to some nice music and ha","useful":0,"cool":0},"BPN4YgIUmLahIE-5yrm-5A":{"text":"Whenever I visit New Orleans I make the trek to Bacchanals.  It is away from most of the g","useful":2,"cool":1},"6lrkCaSQRNgEskM_27p3fg":{"text":"I am bipolar on this place. I've only been a few times since they closed and reopened a fe","useful":1,"cool":0},"UrCtjF3nMhzvcUR6aga9Dw":{"text":"The ambience (back yard/gravel/live band/mix & match furniture) was interesting... Unique ","useful":0,"cool":0},"ZHKfG_y1S6gO7wU3U7Q_5g":{"text":"As a non drinking patron, I feel like I'm missing out, but not by much. The selection of w","useful":0,"cool":0},"sfz0l-Avfy0ZR66gGOwbAg":{"text":"Doesn't get much better than an awesome patio, wine and jazz. I didn't have anything to ea","useful":0,"cool":0},"bco6W1-Mm8XjU-NMx7zG_A":{"text":"Bacchanal has a wonderful relaxed vibe, great atmosphere, and really fun for a group. Down","useful":0,"cool":0},"-QD-A1gzF9VbIbvXPY62Zw":{"text":"The vibe at this place is phenomenal - smooth jazz, string lights, greenery everywhere. We","useful":0,"cool":0},"EgQCpePEcvdyZhRHepWu9g":{"text":"I came here a while ago when my friends and I were in town for Jazz Fest. I keep recommend","useful":3,"cool":1},"6f6TNYInJ0DiFACLrZVpHQ":{"text":"Bacchanal takes no reservations so make sure that you show up early.  If you arrive past e","useful":0,"cool":0},"MMGR85efdS38RRM1vUxrKg":{"text":"My only disappointment was that they didn't accept credit cards in the back, however, I be","useful":1,"cool":0},"7i9-KGQ0NezbC-c3et80nA":{"text":"Love this place, just love it!  Ok it takes a little orientation but can't wait to come ba","useful":0,"cool":0},"4RXjp49x1BUgPDbjzxiLjw":{"text":"Amazing. Simple backyard wine n cheese. Great people. Great music. \n\nI highly recommend th","useful":0,"cool":1},"mXum5bP5X4mETS6aWkfHAQ":{"text":"Believe the hype, 'cause this place is awesome! We spent a whole afternoon at Bacchanal si","useful":0,"cool":0},"XXrFHwPaWoAYyriQcYRHfA":{"text":"I could spend all afternoon here listening to the band drinking bottle after bottle... but","useful":1,"cool":1},"vXrmR9BcLBdhRxXFkCmxVg":{"text":"Bacchanal wine was the highlight of our trip.  Quality wine, affordable prices, fantasy li","useful":0,"cool":0},"4-HNLeEQSuHgnoac48GF3g":{"text":"cool place! the workers are all so helpful, they helped us pick a wine bottle. you purchas","useful":2,"cool":2},"NlNnPEdabcfXdJmL_AV6pg":{"text":"Very cool place!  Live band playing.  Yummy food.  Huge outdoor area with string lighting ","useful":0,"cool":1},"Y2QiB8yY8m-1qJ21OV2p8Q":{"text":"What a fantastic place.  Fabulous wine and service.  Great music to relax in the By-water ","useful":0,"cool":0},"1zPHrM485EZFKcAGJAMazA":{"text":"A must experience whenever in NOLA. The setting is rather quirky but that is part of the f","useful":0,"cool":0},"a2RhEbwJa4Mk2e3JZc_MAw":{"text":"Perfect place! Beautiful patio. You can buy wine (nice selection) and a cheese plate and s","useful":0,"cool":1},"Quc_c_QTm-uQag1yuyEcpg":{"text":"Absolutely loved this place. Such a great atmosphere. The bleeding heart cocktail with the","useful":0,"cool":0},"GPsbrcBigwX_x675uxeImQ":{"text":"My friends and I visited this restaurant/magical wine backyard twice while vacationing in ","useful":1,"cool":1},"FJkf6Wz04y--tsvNC4ExCA":{"text":"I love this place, great NOLA experience! \n\nYou walk in, pick a bottle of wine and cheese(","useful":0,"cool":0},"fLJY_cTbW2cPg1dkhIKXGQ":{"text":"Words cannot express how much I enjoyed this place. Amidst the already stellar nightlife s","useful":0,"cool":0},"nW77iODjs58zamqvRdv0pg":{"text":"Great food, drinks, and ambiance. My one critique is that some members of the female staff","useful":0,"cool":0},"din2a_sAiVj1cMZz-63RWg":{"text":"My friend who had previously lived in New Orleans recommended this place since it was a no","useful":0,"cool":0},"uAquX7NfK0_8dFUjFeMNEg":{"text":"Bacchanal was added to our short list for must visit bars in New Orleans after coming acro","useful":0,"cool":0},"gYjty0b0ZHkh1ptDqQkQEA":{"text":"This is pretty unique place (at least to me). It's a corner store that is fairly dark and ","useful":1,"cool":0},"yOZs-cVyT1JEKU7YKPdYYg":{"text":"Super charming place. Awesome patio with lights and live music. Good wine selection, nice ","useful":0,"cool":1},"udEpsxFjTiZfhyh-Z3eypw":{"text":"Hidden gem of a wine bar in the 9th ward. The minute you walk through the door you feel li","useful":0,"cool":0},"3slkMnWLJN20p_s0j8CEEg":{"text":"You have to be a real dick to not love this place.  I love the jungle plants, the quiet st","useful":0,"cool":0},"KeXhwHy3EtckF7IzBYwxug":{"text":"5 stars for the vibe. And the music. And the wine selection. Definitely take the time to g","useful":0,"cool":0},"o1U6wYAoYqxrteNWD6w_zw":{"text":"This place was great! Even on a hot and steamy Nola evening this place was perfect. There ","useful":1,"cool":0},"l9muP6rXbZjTKEX5ppO0pg":{"text":"Bacchanal is truly special, and New Orleans is lucky to have a place like this. I wish tha","useful":0,"cool":1},"D6UamvUY-V1hI3-1oy8POA":{"text":"First night in New Orleans. Great food. Great music. Great staff. I would definetly come b","useful":0,"cool":0},"oVbPml-JFo-eYvvvmsrhkw":{"text":"I was visiting New Orleans in June this year. Some friends from the city said this was the","useful":1,"cool":0},"uirIhlMCBl71XFEXaaBpfQ":{"text":"LOVE this place. Great atmosphere, great wine, great outside area and music. Really is som","useful":0,"cool":0},"LRx2oPRvkcyAr48fQDo5qw":{"text":"Not sure how this place has any good reviews. Compared to other places in Nola it is certa","useful":1,"cool":0},"xzsg4sa1GrOT92HUHshQqg":{"text":"It's a cute concept.  Walk in, pick out your cheese and charcuterie, your bottles of wine;","useful":0,"cool":0},"-cvpX02KeMlXfQSRpB4XHg":{"text":"This is the place you go to when you're looking for respite from the seediness that is Bou","useful":1,"cool":1},"r-QrOymp1HV415qmU20Lhw":{"text":"Wine store in the front, party in the back.  Bacchanal is the mullet of storefronts.  Walk","useful":1,"cool":1},"jrsPrt8KFpq6Kj99HTkxpA":{"text":"My friends and I stopped here for a break in the rowdy festivities from my sister's bachel","useful":0,"cool":0},"wx-JWHV0kb-p3dyyUuVDfg":{"text":"Wow. This place is a gem. On our most recent trip to New Orleans, a large group of us stay","useful":1,"cool":0},"iyzOxzrS5OuYvbI34G5mhA":{"text":"Awesome wine and jazz bar in a more off the beaten path area of NOLA.  You walk in, get wh","useful":2,"cool":0},"rek44oA5OtQVAQul7MNUUA":{"text":"Came here with some Bywater friends and really liked this place!  It's just so pretty!  Yo","useful":0,"cool":0},"2iAh4jgoIwnatMJ8WEp4wg":{"text":"Came here while visiting Nola on the recommendation of a local. This place is awesome! I l","useful":1,"cool":1},"Axg-7zHpXYQxykDsrEkeKw":{"text":"This was a wonderful place.  Being from out of town and not wanting the French Quarter exp","useful":1,"cool":0},"sNTJ9fLlW6TeXAWekYGUWA":{"text":"I cannot say enough about this place!! Amazing set up: choose from there immense amounts o","useful":0,"cool":0},"nWxl5TV_EjRnJEYBwuWx2Q":{"text":"Great for drinking and outdoor music. The wine bar staff was very helpful in recommending ","useful":0,"cool":0},"0UsrRkvHMEHXfI7a_sHMRA":{"text":"Loved this place - there should be one in every city. It's not cheap, but the food is grea","useful":0,"cool":1},"JHwpomVirN8_kcqe3XT4cg":{"text":"Don't come hungry but do come. This is that place where you get all your buds together, gu","useful":0,"cool":1},"mL50ig2o1o1alaIoF3BI1Q":{"text":"Great wine, food, atmosphere, music, everything. Only downside is that if it's your first ","useful":2,"cool":1},"I_KmfzDkm-gAf4Y_ZaB7vA":{"text":"Very friendly and relaxing atmosphere. We are out of towners and were looking to escape th","useful":0,"cool":0},"7kTaZnxQ3YHY8di1RemRlw":{"text":"There is absolutely nothing I would change about this place. Its such a great place to unw","useful":4,"cool":1},"cmmdwc_W1cUNYGrqf9U9xg":{"text":"This place is FANTASTIC! We had an amazing time relaxing in the back yard drinking delicio","useful":1,"cool":1},"sOX1ekdYmogUzDMfsuGNog":{"text":"Bacchanal is definitely one of my favorite spots in New Orleans. I can't speak for the pla","useful":0,"cool":1},"c44J0MQtBg4MyuzXtO0uVw":{"text":"Interesting concept for food and drink. Live music and gastro pub fare with full wine shop","useful":0,"cool":0},"MxafvmvoVVUD1Spuj7aU6Q":{"text":"Situated in an old house, Bacchanal is a wine store with the option to enjoy your purchase","useful":0,"cool":0},"0fhFYQqq8G1sLvkdGQYqXQ":{"text":"Excellent cocktails for a reasonable price. Very personable bartender when we were there. ","useful":1,"cool":1},"EQkDWr0GSDeCc4bCE8rx8A":{"text":"If you are in NOLA you have to stop here. First here is some history- after Katrina this s","useful":0,"cool":0},"98pjE-xyio-OwDlOWxanQA":{"text":"We spent 5 nights in New Orleans and this was our absolute favorite dining/drinking experi","useful":0,"cool":2},"G6ydTOldvm0X2z36LsOrsw":{"text":"Funky, fun, off the beaten tourist path. Pick out wine, pick out cheese then have them mak","useful":0,"cool":0},"lIW891MZ9pumC2FYPY6pwQ":{"text":"Bacchanal is like eating dinner in the Secret Garden, if the Secret Garden had pretty twin","useful":1,"cool":1},"lrayt_lRuFxearyKgHKYhw":{"text":"Can't say enough good things about this place. Food was great, awesome wine selection, lov","useful":0,"cool":0},"eGm6Ejmne4LLWBrOOtu-NA":{"text":"Best wine bar in the country. Period. Great selection? Delicious food and they added a coc","useful":0,"cool":0},"sq8C4ZzkGdnByugExq7mfw":{"text":"My haiku review:\n\nOff the beaten path\nThe way sazeracs should be\nBack yard cheese plate vi","useful":0,"cool":1},"ECz-mQL1eg9Vp2tzdz8t5Q":{"text":"A group of us visited Bacchanal during a recent trip to New Orleans. After visiting severa","useful":1,"cool":0},"hcVAeIOhTA14RTws_J-35g":{"text":"This place is amazing! The concept itself is very unique (visit the wine and cheese shop i","useful":0,"cool":0},"MkW2MqDg3gyc2w8vYko3iQ":{"text":"This place had a great reputation - was recommended to me by three different friends/acqua","useful":1,"cool":0},"CKCRunr9votJZQUjtfDRew":{"text":"A must visit if your willing to venture out if the hectic hustle & bustle of CBC & French ","useful":0,"cool":0},"meVICTzdahAywwYjaoOcrQ":{"text":"Yelped this place to get a bottle of wine and stumbled upon an amazing experience with del","useful":0,"cool":1},"mS1P2jSPVcRpA85UjjbKGw":{"text":"I went here on July 4th. I was surprised that we didn't have trouble getting a table for o","useful":0,"cool":0},"Lc0Kpl60_D9UaNqqjEWK1Q":{"text":"I have had many wonderful evenings at Bacchanal, which is why I'm so very surprised that I","useful":10,"cool":7},"VXurqT84QNOJhB9B1wvInw":{"text":"We were recently on vacation in NOLA and ended up at Bacchanal because of a recommendation","useful":0,"cool":0},"hrYmsfVV13chmyWDjDBCOQ":{"text":"What more can be said?   This place is awesome.   A great cheese plate and a few bottles o","useful":1,"cool":1},"NKtg7hCywLsZ32Nnb8CqAQ":{"text":"I was in New Orleans with my son, July 14 to 19th ... Very hot .... Next time I'll come in","useful":2,"cool":1},"o9e5Lyx8Ut701JxEaaCyxA":{"text":"This place is more of a wine shop with a large outdoor garden. Very down to earth where fr","useful":1,"cool":1},"FUI_bCRLVsmhetLb6JAWiQ":{"text":"For some reason, I really love Bacchanal.  It's become my go-to place when I want to feel ","useful":0,"cool":0},"KNHjdpNpIK9kqMJOJlqNkw":{"text":"This place is great if you want to relax in a cool environment with great wine. Its basica","useful":0,"cool":0},"BcweRwKtPknHfazREOxzhg":{"text":"Ran into a friend on the airplane from DC to New Orleans, who recommended this lovely gem.","useful":0,"cool":0},"tdAWX4dRqNysauW2FLL-jw":{"text":"Bacchanal is truly a magical experience. We went on a Thursday evening during Jazz Fest. T","useful":1,"cool":0},"qGA-Rc02lyYDOd-26ZpJlQ":{"text":"This was definitely one of the coolest spots in NOLA. The open setting and outdoor seating","useful":2,"cool":2},"y_I68BbzWtyPsc_0YgQJ0g":{"text":"Defines laid back vibes. Cool idea. Ridiculous selection and good music. This is where you","useful":0,"cool":0},"syL7l4QGPP3990bfqMoAxA":{"text":"Love this place! Broccoli was delicious and so was the homemade butter! Loved the music do","useful":0,"cool":0},"xD5zp9wrmih9iQpGiGvdSA":{"text":"If you're looking for a great place to sit outside and listen to music and be with friends","useful":0,"cool":0},"B5PyTz0HMGntDTM2sATt0g":{"text":"Really awesome place.  Sip from various wines and eat a cheese plate while listening to li","useful":0,"cool":0},"o3aeakfVaXPfD1B-s6avfA":{"text":"Awesome local spot in NOLA. The food is awesome and the front end is a liquor store which ","useful":0,"cool":0},"7EcGhYTQ_LnZE3hQ7Zuj8w":{"text":"Friendly atmosphere. Delicious cheese and bread.\nA large choice of wine.\nWe had a pleasant","useful":0,"cool":0},"zW_N4-sM8odBGHIlA0ZabA":{"text":"This is a one of a kind place so go and see if you like it. I responded to certain things ","useful":3,"cool":1},"5xnQ_AhP3Kz-0mwNchnHTA":{"text":"Well what can I say that hasn't been said? I will just describe what I ate, I guess. \n\nWe ","useful":0,"cool":0},"4R3j5xRCajOqweYjujNgUA":{"text":"YES. I almost don't want to write a review because I don't want people to know about this ","useful":0,"cool":0},"praYwr_51OuxZoaY1P89oQ":{"text":"I'm not going to tell you about the fact that it rained a small amount for a large amount ","useful":1,"cool":2},"8B6dYIuApBj6JUL9qKM2og":{"text":"my boyfriend and I came here with a friend of ours who lives around the corner on our last","useful":0,"cool":0},"jmzfywzAUxgEP1a3sK_GSA":{"text":"Fun place for food drink and music. Glad they're taking credit cards now. Love their chees","useful":0,"cool":1},"c2Q05mx8KAmlOpfI6gOA7w":{"text":"Cheese and wine.. Hard to beat that. The place was packed, but lots of seating. A little l","useful":1,"cool":1},"tNxQLCh9KXMq2H6EClyxZw":{"text":"Lived in NOLA for 4 years. Bacchanal is magical. The only drawback is that too many people","useful":0,"cool":0},"c7o1QLwkWAR2-bmRPnSJKQ":{"text":"Big fan. Great outdoor seating and great concept. You buy a bottle of wine and cheese/meat","useful":0,"cool":1},"sM-9a9auA5tIPmkm-wjQPQ":{"text":"This was an amazing find and surprise for us. Great patio, balcony area and live music. Ad","useful":0,"cool":1},"LzYSHJ1I55oRvnTgrvVO8A":{"text":"Awesome concept and great, friendly service. We ordered some wine and a custom cheese plat","useful":0,"cool":0},"cuNuwmPI62tf2ZArVP3elQ":{"text":"Amazing experience. Loved physically being able to choose my wine and my cheese. Reading a","useful":1,"cool":1},"hsLi-Xsp31fgnraasrShVg":{"text":"I ended up here at about 10:30 on Friday night with some friends from out of town who had ","useful":0,"cool":0},"3UyXwRUGQDkTDThGcWWr6Q":{"text":"This place is amazing.  Get there a little early to avoid the crowd; I got there around 6p","useful":1,"cool":1},"CtWsYGq_70j_IecTB75cew":{"text":"We looooved Bacchanale.  Great food, funky courtyard venue, nice lunchtime solo jazz. Good","useful":0,"cool":0},"MlepKAdCEB7qARFNfTLt8g":{"text":"We *loved* it here. My partner and I stopped here for a quick drink and ended up staying f","useful":3,"cool":3},"CsebAIVX2ITp21NaHC4kAg":{"text":"This was my favorite new (to me) place I visited on my vacation.  I saw it on a travel cha","useful":1,"cool":0},"Aywcq_1VXUWlWKN73cr_pQ":{"text":"Lovely setting for a night out.  Can't comment on the wines themselves but the setup and v","useful":0,"cool":0},"ZExqLhQ4JJSiSdGcRPr8Sw":{"text":"Love the atmosphere! And the steak was awesome! I really likes the fact that nothing match","useful":0,"cool":0},"Mzc8_FXq8MoxYaWT0VehZw":{"text":"This is one of the best restaurants I've ever been to. I love the food and laid back atmos","useful":0,"cool":0},"nZNYOTIipJg7dwOR_VPu7w":{"text":"A great place to hang out and enjoy live music.  They carry so much more than wine, and in","useful":0,"cool":0},"2dAMgw0ZBDsP-xkm7_gvXA":{"text":"This place is so unique and fun. Quite off the beaten path but so worth it. The vibe is ch","useful":0,"cool":0},"rHlfW0Ve_jy_SLOuwRyIsw":{"text":"Came for a glass/bottle of wine with friends after a long day. Nice, relaxing spot. A few ","useful":0,"cool":0},"Iowxkg2XGzykcxzJL1_WWg":{"text":"The atmosphere is great. Mostly outdoor seating, but they do have some indoor now too. Nic","useful":0,"cool":0},"X86OeHxRcOqeoMG2C_CX0Q":{"text":"This is my all time favorite place in NOLA! Amazing atmosphere, food, wine and music! I ca","useful":0,"cool":0},"rP7z8V7kjZ96tS2UkGwrUQ":{"text":"This was by far my favorite stop on our eating your of NOLA.  I love the concept of being ","useful":0,"cool":0},"fMyMrc6QB1ibDZgmuB3DmQ":{"text":"A truly unique experience at Bacchanal.  We were able to choose from an assortment of chee","useful":0,"cool":0},"jEb_qqAT48XXWlYolfM3lA":{"text":"I am lucky to have a good friend who lives in New Orleans. She took me to Bacchanal one be","useful":0,"cool":0},"mBEIuxGAb3ktmE9MNEm7Qw":{"text":"one of my favorite places in town. Such a lovely garden party with music, wine, and bites ","useful":1,"cool":0},"HevquuiLWOErIv3PZV4xWg":{"text":"Another one on my list that I want to return to from my trip to New Orleans. Great food, g","useful":0,"cool":0},"MGQqW2uNM9B3khYh0VtSJQ":{"text":"My friends and I loved this place so much, that we came back before our trip to New Orlean","useful":0,"cool":0},"uhrloB1H67jHZ24p9pNfcw":{"text":"Is this place real life??!!?!?!?\n\nI was in town for a long weekend and completely over the","useful":5,"cool":1},"xlHRyMqBzTB3w3jClB8NRA":{"text":"A true gem! \n\nDuring my last trip to NOLA with family (visiting from Korea) we stopped for","useful":4,"cool":3},"InWT2bvGMqw-EZbuLyv8iA":{"text":"I've been waiting to experience Bacchanal in a variety of it's manifestations before writi","useful":1,"cool":1},"_et69GIW8TMR3aOTVjyX-w":{"text":"Great spot for jazz. Good small plates!  Awesome bacon wrapped dates ... Watermelon and fe","useful":0,"cool":0},"Rfl-NCdnKMhqh-ofK1zRDg":{"text":"My memory of Bacchanal is eating too much cheese, drinking too much wine, and listening to","useful":3,"cool":2},"8x8qIxypK6yAojT-ue_33Q":{"text":"Meh... Be prepared to pay for your own bottle of wine and tip someone to cork the bottle. ","useful":2,"cool":0},"uCGHokf3GYGpJ3P5STtk-g":{"text":"I would like to live here please. \n\nThey had an excellent wine and cheese selection. The h","useful":0,"cool":0},"Gk2kTjpGE4w45ROwo6lkBg":{"text":"I really like that this place is so non-assuming and relaxed yet still boasts a stellar wi","useful":0,"cool":0},"5qY0XuXgaEvsM3wCfzTWRw":{"text":"Natalie at the bar was AMAZING! This place was outstanding, from the location,  service, a","useful":0,"cool":1},"rgzSYZ57MNy4SZOAW6Clpg":{"text":"One of the highlights of my trip...a must! The only downside for those staying in the Fren","useful":7,"cool":5},"IyTS0URJP2rdY0is-cZC-w":{"text":"When asked what my favorite place to eat here in New Orleans, I always pause and ponder. B","useful":2,"cool":3},"ugQOXztyciSwRI3GlmHxzg":{"text":"Fantastic ambiance, great company, great wine, awesome music. Best vibes in the bywater ha","useful":0,"cool":0},"Y2LGO5-p70KsvxAF3br_AA":{"text":"Big fan if this place. It thrives at night, with live music, Christmas lights and tiki tor","useful":0,"cool":0},"dF_66hkETVsWDu8TswJZ_g":{"text":"This was my first time here.   Very interesting place. We bought a bottle of Cabernet, som","useful":0,"cool":0},"AIchQQGLWlKQjhkiVUagJg":{"text":"Very cool place. A tad confusing at first but the staff is extremely helpful and friendly ","useful":1,"cool":1},"vB3j_DhqfLlv4L4vb47UZw":{"text":"Great feel, good drinks, and nice atmosphere. Awesome bands and cool back patio.  They had","useful":1,"cool":2},"pDmEbz8PtU4E4Wf1MHAqBg":{"text":"We took a taxi from our hotel to Bacchanal.  We found out about this place earlier in the ","useful":0,"cool":0},"fLUbXkyNDcS3765CMojB_A":{"text":"Just arrived on Nola for FQF, and stopped in for mid day refreshments. Wow.  The food is t","useful":0,"cool":0},"v3ruZm5IV48Y8NPv8qEnKQ":{"text":"Loved this place. Great wine selection and tasty small plate options. Oh and great cheese ","useful":0,"cool":0},"-2GeUV7ecERaYG0eXuqQeg":{"text":"This place is so over rated. Only getting two stars for the atmosphere i guess. The music ","useful":7,"cool":2},"no0GdLkXTxbiWOFLGTFo1g":{"text":"Really cool place!  Helpful, friendly staff, great wine selection, delicious food and grea","useful":0,"cool":0},"FszfuI3ISCg7KfIxsUshfQ":{"text":"Neat and quirky restaurant concept! It's at the end of the street that looks like a house ","useful":1,"cool":1},"hC9OMO3hiwE3xxysRbIG-w":{"text":"Tonight we had hanger steak again and the smoked trout + ceviche .  once again we are deli","useful":1,"cool":0},"qO9X_MlWjTQKVFuofrTd6w":{"text":"My first visit to Bacchanal was a little confusing and, frankly, a little intimidating.  \n","useful":15,"cool":4},"pVFzGUQMFORT6T1rKHalyw":{"text":"Awesome outdoor courtyard. Amazing jazz band. Great wine and cheese platters. Perfect even","useful":0,"cool":0},"L-ZuA8KUDQ2YyG3AfHa7sQ":{"text":"This place has excellent products, an interesting location, funky decor and live music, fo","useful":2,"cool":1},"6S362UFM68KOQUEOv2KycQ":{"text":"Such a clutch local recommendation, even the walk itself in the evening out to Bacchanal w","useful":1,"cool":1},"OckfEqUH5TXpJD14W7wRFw":{"text":"I'm going to let you in on a little secret.  If you have a night to try out a new place in","useful":5,"cool":2},"A3hIrbi13ZF11Cg3phz5bA":{"text":"Ro·mance: a quality or feeling of mystery, excitement, and remoteness from everyday life.\n","useful":1,"cool":1},"zCAypyMcSzhXmvgW6xDz2w":{"text":"Tucked into a dark corner of the NOLA Bywater this is exactly the type of place you would ","useful":1,"cool":1},"YjsFXjwmX6pyfxjzzlyIZQ":{"text":"A completely unique location. When we pulled up in front we weren't sure it was open or ev","useful":0,"cool":0},"vtOgCYWNxvf886maxKlquA":{"text":"We were so excited to go to this place for the atmosphere. We were disappointed that we di","useful":1,"cool":0},"Fh3NeXE6yZAlLBvyLL6P_w":{"text":"Come early & beat the crowd so you can get a good table (or just a seat somewhere) because","useful":0,"cool":0},"h-fs705TU3Z52T1C5gOHuQ":{"text":"Do you long for poor quality drinks served in plastic cups all the while the smell of vomi","useful":0,"cool":0},"N8LvaeiPfSgXu2AReLkE1A":{"text":"Buy awesome wine practically at in-store prices, then sit on the patio under heat lamps im","useful":1,"cool":0},"xH7n4yUpsoXkkTfoDq8OJA":{"text":"A beautiful atmosphere, great live music, and a fun place to buy a bottle of wine and sit ","useful":0,"cool":0},"oOu_q0Koa7CpFNKH_-DEtw":{"text":"Well worth the trip to uber out to Bacchanal from the hustle and bustle of Bourbon Street.","useful":1,"cool":0},"Ogl_BZapXPNf3KIVJs5f3A":{"text":"Planned an evening out with some friends and we decided to give this place a try. I love w","useful":0,"cool":0},"KyG1toKfnp5Dw-bBcatcSQ":{"text":"If you love wine tasting, an eclectic, vibrant atmosphere with great food and music, this ","useful":0,"cool":0},"A2O7H9ZnzXMgcvlR_lsGWw":{"text":"Amazing place...I can't get past how rude and awful the two women working the wine shop ar","useful":1,"cool":0},"5xUY1YeIpsMZJg2U-cyVVA":{"text":"The wine selection was extensive. We just had wine by the glass which was very reasonably ","useful":0,"cool":0},"GhXofHvC4x58SA4_emQivQ":{"text":"This place is awesome.  Low key, casual, and exactly the right vibe that I was looking for","useful":2,"cool":2},"mqtTZk7b58ibYSCOUMMfLA":{"text":"Go Here!  If I had to choose one place to go in New Orleans I would choose this every time","useful":0,"cool":0},"bnlRwwSpxJeWb2f6i4shJQ":{"text":"I have been here for my friends St. Andrews party and it is amazing. I went the other nigh","useful":0,"cool":0},"uglahn2MvsIpZ7ybmHuTGA":{"text":"Love this place. The patio on a pleasant Sunday afternoon/evening is about as good as it g","useful":0,"cool":0},"5-PYPIRRBryhNTjuNxWwdQ":{"text":"My favorite place in NOLA! A friend and I went to Surrey's for brunch yesterday and while ","useful":0,"cool":0},"7AgAypUvu3bqNVZuF3uUug":{"text":"This place is full of rude 20 somethings and unfriendly staff. We had never been here befo","useful":1,"cool":0},"0uDxCPDPaEzf5yB3eZFZ5Q":{"text":"Must hit spot in NOLA. Very chill, lots of outdoor seating, awesome atmosphere. Staff was ","useful":0,"cool":0},"N1zh0Du_CHzX6vWQFMELJA":{"text":"This place was amazing!  They had unique drinks and amazing meat and cheese plate.  We enj","useful":0,"cool":0},"GS1Mr51YKicxzD3rVkGxoA":{"text":"I have to say that I was a little skeptical going all the way out to the end of the Bywate","useful":0,"cool":0},"OSuEvG6rdTjYMRVFDwyeOg":{"text":"A must go while in New Orleans! The perfect place to relax after a long morning or afterno","useful":0,"cool":0},"O9ErCBRGgS251rVh_IEdaA":{"text":"Large outside eating area.  The band was good.  I ordered chicken which showed up after ev","useful":0,"cool":0},"4GZMJMLhJIg-zAZRjrU-7g":{"text":"Disappointed. I had this place scoped out to pick up a bottle of wine on the way into town","useful":2,"cool":0},"k6Bmqmff_r1k8X5l9LJxiA":{"text":"Walk in, pick out wine and cheese, pay, sit at table, be delivered an amazing cheese plate","useful":0,"cool":0},"7nx4NIWwJtgesGc3VlQPWA":{"text":"I don't know if there is a heaven, but my idea of eternal bliss looks and sounds just like","useful":1,"cool":1},"qGo1SM4wOhIZiY3UgWn8Xw":{"text":"During my brief trip to NOLA, I was recommended by many locals to come here for a fine nig","useful":0,"cool":0},"-kBAjLKuvZxQz_7Y8Y8VHg":{"text":"What a fantastic lunch spot. We had an amazing bike ride along crescent park to this out o","useful":0,"cool":0},"SGo7MNuE91r0caFy-b7Prw":{"text":"This was my favorite place to drink that we went to on our last visit.  Expect there to be","useful":7,"cool":7},"mfNHo79kCec-9jgrAR8vVw":{"text":"OH MA GAD. \n\nWe wanted to come here at night on a friend's recommendation but ended up com","useful":1,"cool":0},"Yzv1EVyaQm_XOjIbcpaBKA":{"text":"Like much of the scenery in Louisiana, Bacchanal is a pretty little jewel all the way out ","useful":1,"cool":1},"CraHaHQk6pkGyvZmHtywhg":{"text":"Coolest place we visited in New Orleans - a little oasis from the crazy fun part. Definite","useful":1,"cool":1},"5gNCtmI_bLfkdoNHmE7ryA":{"text":"Great atmosphere, great drinks, and creative menu items. The outdoor seating downstairs is","useful":2,"cool":0},"BTmX45kaCECfU1_3qGPaJw":{"text":"This is more than worth the trip to Bywater, if you're coming from elsewhere. The selectio","useful":3,"cool":4},"--L0dAA2P926Qh0MhR97Mg":{"text":"What a fun experience! Great wine, delicious food, live music -- a beautiful night in New ","useful":0,"cool":0},"zjF1gMHQdILBkQ-O1oMlwA":{"text":"We made the looooong walk from the French Quarter to Bacchanal (pro tip: take an Uber or d","useful":1,"cool":1},"mn_eh1iU3HNEIOiTGI1RjA":{"text":"Charming and delicious, this backyard spot behind an excellent wine shop was one of my fav","useful":0,"cool":0},"CXKC5zygTNfh6v5ETr2X-g":{"text":"The wine is good, the atmosphere is fun, the crowd is chill, the food is excellent....but.","useful":0,"cool":0},"41K7QneHGG3JAayFyanARw":{"text":"Such a stellar experience. On the advice of the NYT we cabbed to the Bywater from the Quar","useful":0,"cool":0},"wVWjTwLWJnTyeqsVEGEaNg":{"text":"Arugula, Creamy Goat Cheese, Truffled Portobellos & Oven Dried Tomatoes\nwith Roland's Whit","useful":1,"cool":1},"sfEpPx-yfcds5OrBWqI5vQ":{"text":"Love it love it love it. Had some WONDERFUL cheese, and I know cheese, I breathe cheese. A","useful":0,"cool":0},"BX2xg7x3UMW5Wfl5cIWq7g":{"text":"My partner and I had an amazing time... We missed the music by about 10 minutes but it did","useful":1,"cool":0},"Rx3eDKeFOKmL0LA9s-pBHw":{"text":"Love the atmosphere, love the food, love the staff! Heard about it and wanted to try it ou","useful":1,"cool":1},"slfmf9RfRzhaJJjmP_PJYw":{"text":"This was one of my favorite stops during a long weekend in New Orleans. A friend and I dec","useful":1,"cool":1},"TAqMAaOGhWNbbMYWe53b-g":{"text":"WOW!!! First time to Louisiana, First time to New Orleans, and this place by for has won m","useful":0,"cool":0},"2D1TWeNs8RTOB1ubywUjVw":{"text":"Off tha chain delicious. It's refreshing; this being my third trip to NOLA finding a non-t","useful":0,"cool":0},"lBEl_jzBx1ypBcQEA4T4iw":{"text":"Amazing wine and beer selection. Even the take-away charcuterie looked good. The employees","useful":0,"cool":0},"LO_4yM5v-kXCy_5w4_dM5Q":{"text":"Oh I love it here. Delicious cheese, wine and other small plates. Like being in someone's ","useful":0,"cool":0},"cE-O09gVA9Kyl-NL8NQX-w":{"text":"I cannot get enough of this place. The wine, the cheese boards, the outdoor seating, the l","useful":0,"cool":0},"MkDUTpvYCVVfSSr_hi-ZqQ":{"text":"My new favorite place. LOVE this vibe. Walk in, pick your cheeses & wine, then head out to","useful":0,"cool":0},"PV5edWNhC9f5z_N6PJeN2w":{"text":"A absolute must if you're in NOLA! Amazing wine and atmosphere! Staff Was super friendly a","useful":0,"cool":0},"k8p_f2IcYUlShNX7h9BQiQ":{"text":"Love Bacchanal.  Excellent wine selection, Great small plates. Great music.  My only compl","useful":0,"cool":0},"F5Ad75kwMR4C23EQIfx9eQ":{"text":"This place is SO cute! You come in, pick a bottle of wine and some cheese, then go sit out","useful":0,"cool":0},"bsgNdsE3KU1Tlmk1bM4VEw":{"text":"Great service, great people, great wine!\n\nThe people that work here are so friendly! We wa","useful":0,"cool":0},"qpxqIZhdOS_VeTIXFKUY5A":{"text":"If you're in New Orleans, this is a MUST. Buy a bottle of wine, pick some yummy cheese and","useful":0,"cool":0},"rOljfemvtjpE1veiVGItKQ":{"text":"Went there last Sunday. I love cheese so I was looking forward to getting some cheese and ","useful":0,"cool":0},"yQeLSlIULDBeepLX9RUnVA":{"text":"We went here this past Saturday for girls night.  The parking is awful.  I enjoyed myself,","useful":5,"cool":3},"y9nS-PjX3e1VTJe4RA5hYQ":{"text":"We came here on a tuesday night and the place was packed. The garden seating was filled so","useful":0,"cool":0},"vSyHxWcTaxAvAdQjMiep6g":{"text":"If this was two years ago, I would've given this place a 5 star review considering that it","useful":0,"cool":0},"EvwAW6t3Ahm7pXaQNYcVcQ":{"text":"Fantastic spot that will leave you feeling relaxed and full!!\nGreat wine, delicious cheese","useful":0,"cool":0},"xR8PDWnqNdK2G2NV0cInuA":{"text":"Good wine selection and reasonable prices but the real appeal is the fantastic atmosphere ","useful":1,"cool":1},"jkZl5WoQrG1CIGpxdX4bSg":{"text":"This place used to be great but now it's a tourist trap. Don't bother. \nAlso, they are pre","useful":0,"cool":0},"v7azRd347yq0PUrk7_edKw":{"text":"Might actually be the best place ever. The atmosphere is so so good. Just go, you won't re","useful":0,"cool":0},"jM55UULnzd8Ym9C4in-T-Q":{"text":"One of my favorite place to eat in the city. Great wine and cheese. Local Chefs and nightl","useful":0,"cool":0},"1046_i7YXj1erbAzS3PSmw":{"text":"I can't quite decide if this place is a 4 or 3. First of all, let it be known to all that ","useful":2,"cool":2},"HJfeKCYpOS3NmG2fhvZZBA":{"text":"Yet another place to make new friends all day. Got invited to a bridal luncheon that was m","useful":2,"cool":2},"smjJrcoThMqjjZc6u0ifvA":{"text":"Great  concept, pick your own bottle of wine as you walk in, grab a bucket and ice, go fin","useful":0,"cool":0},"pFE_29y5b6hzhI3hlW24MQ":{"text":"I really loved it here. The outdoor seating with the live music, the casual atmosphere of ","useful":1,"cool":0},"DPoslfQ4FuO-Okm5BFyI8A":{"text":"Run don't walk to this place! Great music, delicious good, amazing ambiance. Tourists, thi","useful":0,"cool":0},"0c9kFevjSroBsa9zsRqqeQ":{"text":"If I could give no stars, I would. Actually let's just say the one star is for the door gu","useful":5,"cool":0},"r3eqTXb-__2HwS-q6C_iCA":{"text":"Really cool spot with great outdoor music. Felt like a local place but who knows really, o","useful":0,"cool":0},"I-erc0W_tpl5BaMKx2eYYg":{"text":"It's so cozy and just the best feeling here. I love it, someone has got to rate to bring t","useful":0,"cool":0},"HcbDG1dbB0im56z8ZE_UiA":{"text":"A lovely space overall, if a little chaotic. The live music and ambience were charming, th","useful":0,"cool":0},"cw6cAMIgV9_VM426SW-uGg":{"text":"Love love love this place! Excellent all the way around! Picked out a few bottles of wines","useful":0,"cool":0},"ut1UEKgEEykRZfkI7Ql_LQ":{"text":"very cool backyard. went during the day on sunday and the weather wasn't great so it was p","useful":2,"cool":1},"NwzhMq3ZYmLH_0gH_o_iJA":{"text":"Live music, outdoor seating, lots of wine and cheese... what else can you ask for!\n\nWe wen","useful":2,"cool":0},"TtQJmMVKTPW8XovB5rT9FQ":{"text":"I am in love with this place.  It's a simple idea done very very well.  Just buy your wine","useful":1,"cool":0},"kPjYB03eJm9FLy0GC4u3hw":{"text":"loved the atmosphere. Sitting outside listening to a band and eating really great  food is","useful":0,"cool":0},"xB3EOlz-Lm_qevKpV3jvHQ":{"text":"I feel like this is a really good date spot even though the couple of times I've been here","useful":1,"cool":1},"aZdpJSFd8npqndX-AFZ4GA":{"text":"One of those hole in the wall places that people dream about discovering. Very unassuming ","useful":1,"cool":0},"JdkBBmj2TMfDJ_UF8c36rw":{"text":"Bacchanal really is a lovely slightly bohemian place to share a bottle of wine and chat wi","useful":15,"cool":9},"KluY24_kY7IKHMcJl20JVQ":{"text":"Quaintly situated, the casual atmosphere and soft ones of the Jazz band mixed with the sme","useful":0,"cool":0},"f55mZ4zTOToUDj1y9OafaQ":{"text":"Bacchanal Wine is everything that is right with New Orleans. Music, ambiance and service a","useful":0,"cool":0},"R0Lglmv0PByHA3rtJZ1ofg":{"text":"Do you sometimes feel rushed at restaurants? Do you ever find yourself wishing you could j","useful":2,"cool":2},"yv2yguuAiOBtLYJh667l8A":{"text":"The hipsteriest hipsters that ever hipstered. Help yourself to paying $30 for a bottle of ","useful":1,"cool":0},"xzktHgwVM7pEVCG2-4exaw":{"text":"great location\ngreat staff\ngreat food\ngreat wine selection\ngreat bar upstairs\ngreat outdoo","useful":0,"cool":0},"vkCrPCPiBijMufBhf1P19A":{"text":"I have been here twice and I will be coming back again and again and again. I dabble in a ","useful":4,"cool":3},"W0Pmd8h0-eibMES35Fgzkw":{"text":"The most amazing night in NOLA. we sat outside and listened to music and drank wine for 3 ","useful":0,"cool":0},"eGAaiGsk0lL9Yz4_fpyU3g":{"text":"Amazing concept...buy your wine (by the bottle...it's like being in a wine shop as there a","useful":0,"cool":0},"innh9e6Yb0VSbwJkbVnpFQ":{"text":"A few local people recommended coming here.  It was about a $6-8 Uber ride from the French","useful":0,"cool":0},"yyusnJLh5a2g3vFvj1mQuQ":{"text":"Everything I thought it would be and more! We ordered food after devouring our cheese plat","useful":0,"cool":0},"0hfBItfI2Xwef9CJBBBHiA":{"text":"A place that truly captures the spirit and magic of New Orleans. The kind of place I take ","useful":10,"cool":4},"w2HNTLPlB7HICrRe_N-3MQ":{"text":"What a pleasant Bywater find! Great gypsy jazz lunch with wine, cheese, and small plates.","useful":1,"cool":1},"C1DbPQurbw_pxaY5nD_-FQ":{"text":"We were in the NOLA area for a short weekend, and Bacchanal was highly recommended to us b","useful":0,"cool":0},"QKMDa7QuE23yc8d_EvkwSw":{"text":"I'll give this gem of a spot 4 stars, and it would have gotten 5 stars, but one of the foo","useful":1,"cool":1},"lnsR-EX-LzE_aPnKrMkMgA":{"text":"This was my first visit and on entering you think you are just in a wine shop. Tell the st","useful":0,"cool":0},"dfI6JF5nCE0Bn4eKZmHF_Q":{"text":"One of my all-time fave joints...awesome ambiance, great food/wine selection, great music ","useful":0,"cool":0},"viJGQ535TXlOsT0RvFGb-w":{"text":"I came here on a recent trip to New Orleans, it was pretty amazing.  It's very unassuming ","useful":1,"cool":1},"wKvyogqYnqrJY6w6fwm_FQ":{"text":"Love the concept, hate the pretentiousness. Lovely wine and cheese selection but understan","useful":0,"cool":1},"2ne7AmDAw5omYeT5nfLguA":{"text":"It's been a couple of weeks since I left New Orleans, but the memory of the amazing, amazi","useful":4,"cool":1},"YIkGSYlxmls5eT60mI4ElA":{"text":"This was a top three highlight of our weekend in NOLA! I truly wish there was something si","useful":0,"cool":0},"A6F3c069vYmrMAzW2wbe1A":{"text":"Love this place. Great atmosphere, very reasonably priced drinks. The food is expensive, b","useful":0,"cool":0},"NxQTxgiDg_F3N280cckOVQ":{"text":"From the outside, Bacchanal looks like a dive bar that Jean Lafitte used to get drunk at. ","useful":3,"cool":2},"zops73BBdZN4iA4uIlnYWw":{"text":"Music and atmosphere were fabulous.  It was like being in Paris.  Plastic chairs?  Serious","useful":2,"cool":1},"2zvddnVZlSupYyMNTW5v4A":{"text":"What an awesome spot in Bywater! Bacchanal has a nicely stocked wine shop and cheese cold ","useful":1,"cool":0},"-fXS6nEhShsZWH8avHPxRw":{"text":"I go to Bacchanal as often as possible, though I can only make it out that far only so oft","useful":4,"cool":1},"Fl73VSILCqvsxwf6A2SEhQ":{"text":"Bacchanal Wine is a really unique wine bar to check out if you are in new orleans. This pl","useful":1,"cool":1},"GSCZCeHh-C8AkRPnNaiC7A":{"text":"While visiting New Orleans with my friends, we stopped by Bacchanal Wine for their happy h","useful":0,"cool":0},"Wya7UchychS8g-2pbM0n0A":{"text":"This is my favorite place in NOLA. It was recommended by all the bartenders I know that do","useful":0,"cool":0},"BKtuntTMrNK_0DQd44lv4A":{"text":"I had somehow come across this place while searching for things to do off the beaten path ","useful":1,"cool":0},"S-1z-XrSXAML04PxplX0uA":{"text":"You really can't go wrong with this place. Bring a date, a large party, or your mom....its","useful":0,"cool":0},"LUdvRpii0cq_b9v9aQEskA":{"text":"Absolutely love this place. Perfect when the weather is nice. Great place to go if your lo","useful":0,"cool":0},"P_8pk74cElFCHva1Wdsk7g":{"text":"Amazing bar.  Live music good drinks and food.  I particularly like the steak. The atmosph","useful":2,"cool":1},"_bdcxrTtQuGO_DUr52O0-g":{"text":"What an incredible concept. I wish I could find a Bacchanal in my hometown too!!  The expe","useful":0,"cool":0},"jyAG37a--FNacmVdY1wbHw":{"text":"When I asked for a wine recommendation the hostess just said \"there's only 3 options...\" a","useful":2,"cool":1},"DKf5vv3QwMX7LCRmbIurNw":{"text":"Chill place, good music, kool staff.  Put bug spray on, they provide it, pretty neat.","useful":0,"cool":0},"cAd5Q381HhLMijlBaqNr1g":{"text":"Loved the ambiance here! Jazz music,great food and larger wine selection.   Walk in buy yo","useful":0,"cool":0},"J_c2XI6upaXN-g-NXcV7HQ":{"text":"Interesting & cool concept.  Enter on the corner (parking can be tough at times) select a ","useful":0,"cool":0},"AHlQ5PuNIvdyu-pEKZl_vQ":{"text":"Visited New Orleans in July and this restaurant took the cake! Great ambience, awesome mus","useful":0,"cool":0},"IQVq45PZdolfRLFetV7DYg":{"text":"Bacchanal might be my favorite place to go to when I visit New Orleans.  At first, you wal","useful":1,"cool":0},"kI6tKmCZYl9lO0BoHUGH5Q":{"text":"This place is more known as a wine bar, but they offer a very nice selection of beers (20+","useful":1,"cool":0},"oD8GnXvL_UMApNcWifugSg":{"text":"This is one of my favorite places to go in New Orleans. It's out of the way so basically i","useful":0,"cool":0},"Rw_CfgP-1BCLMjm9--7uow":{"text":"Don't skip the cheese plate. \n\nIt's going to drink in your friend's backyard, with mismatc","useful":0,"cool":0},"EekfgUtAUxoju-8rZtLPJg":{"text":"What a unique experience! If you have the time & the means to get out of the Quarter, Bacc","useful":0,"cool":0},"0TRN1a9NxAu9_6dVNlAHvQ":{"text":"Bravo!!\nWhat a concept!\nJust loved this place.  When pulling up, you look around confused ","useful":0,"cool":0},"Bqh-mgE1nryNi3czMbjSfw":{"text":"What a great idea and fit for Nola! Reasonably priced wine and cheese. Great advice on win","useful":2,"cool":2},"GV5_3u0lpKihEF0iGfI1Aw":{"text":"We decided to give Bacchanal a try for our recent Valentine visit to Nola for their evenin","useful":0,"cool":0},"YAd71ckBhevxC4TzUJw7Uw":{"text":"We were off to 'The Joint' to eat some hearty brisket and bakes beans. The place has been ","useful":1,"cool":1},"nVj_-JxwW3aIWvjJfrUBGg":{"text":"This place used to be great but now it's a tourist trap. Don't bother. \nAlso, they are pre","useful":0,"cool":0},"F-jVJzl90v4lnaAhPnju-g":{"text":"Great atmosphere, delicious food and good music. It's a great spot to hang out, have some ","useful":1,"cool":1},"RvlU1irW77ACQ1FBWK2bvg":{"text":"What an adventure.\n\nMy local buddy takes all of us in his scion. Packs it to the brim with","useful":1,"cool":1},"qcf6ePc1mfDgfgx1Hllg9Q":{"text":"Free wine tastings Saturday afternoons. I love their pork shoulder soup. So much depth in ","useful":1,"cool":1},"7j7kAv_NDTzRd25AZRZP0w":{"text":"Even the food is palatable, this place is so pretentious. I do not entertain the idea of c","useful":1,"cool":0},"mF04bMF8CRep9E_H4mHi1g":{"text":"I owe Bacchanal an updated review. It's changed quite a bit since I first started coming h","useful":6,"cool":1},"56N43UwzIo31mvIBeVu56Q":{"text":"actually really loved this place. had heard great things and was not disappointed. food wa","useful":0,"cool":0},"f3ByO1-b6z9Upr6jAwqTDg":{"text":"Great stuff! I went for lunch, it was not crowded and very relaxing atmosphere. Grabbed a ","useful":0,"cool":0},"5DYpvmN44ruTvNOkORab5Q":{"text":"I am truly dismayed that I held back in my stardom with Bacchanal a couple months ago. I c","useful":14,"cool":12},"eN4CjISgMM0BBKwAXfuEDQ":{"text":"Hands down the most unique, fun, and cool dining experience in New Orleans. All of the foo","useful":1,"cool":1},"262vokUyhQE36RCkXwwNeQ":{"text":"Bacchanal was a fun place to be for some live music and enjoying the nice weather outside.","useful":2,"cool":0},"LulJxzyoNPHdJE04UeNFWA":{"text":"Ok I have to leave a post because this place is awesome!!! The food! Wow delicious. I had ","useful":1,"cool":0},"HoAz8pMjlDpJOr-7e8xsEA":{"text":"A must visit when in New Orleans. This place give major backyard lazy summer vibes and it'","useful":0,"cool":0},"CqW_PKhC9Vm_nwf6-pcK5w":{"text":"I absolutely love this place. Wine is amazing and the food is perfect. Not too light or he","useful":1,"cool":1},"oonaY3dj9fhqwjyDA3bCVA":{"text":"Stopped by on a whim and the food was excellent, the staff were quite friendly except for ","useful":0,"cool":0},"dLe3jrjc0hSXZpqDZK2YBw":{"text":"Went here on Monday night and it was busy! This definitely seems like a local hang out tha","useful":2,"cool":2},"e0g6gA3gFuLb9ItRukne2A":{"text":"The wife and I are always looking for new spots in NOLA. This spot is a gem in the rough. ","useful":0,"cool":0},"swShLcZ6WheMH6qs549yJw":{"text":"Anthony Bourdain would find this place....it is so cool!!! I will never leave NOLA without","useful":1,"cool":0},"wyzFWy4HRtR9M4c1qrwbmw":{"text":"This place is amazing! Just visited NO over the weekend and knew to stay off Bourbon Stree","useful":1,"cool":0},"-y-VSNhPBxdas41wQX5yJA":{"text":"This is New Orleans at its finest. Very broad selection of modestly priced wines, small pl","useful":0,"cool":0},"iPAOv5FsJWfPWXuhEzmDKg":{"text":"Bacchanal is a must go. I do mean must, and I make no exceptions.  Consider this #1 for \"m","useful":4,"cool":1},"pcRpX73gsPBDyAwP0zyy-w":{"text":"Don\"t expect elegance, but do expect backyard BBQ, mosquito's and all, with a complimentar","useful":0,"cool":0},"2FMaGMPos_v4bkXOsQBQ-g":{"text":"We loved this place! Cheeses, charcuteries, wines and live music! What's not to love! We e","useful":0,"cool":0},"oZTE-fwlDAPLObPF0aQZEQ":{"text":"Just absolutely delicious. We had a wonderful bottle of wine and some amazing food- includ","useful":0,"cool":0},"JDQH9lHs9lDoCenxBjg6_g":{"text":"You can have so much fun at this place! You can either purchase a bottle or bottles of win","useful":0,"cool":0},"p77rQj7vQGm_pUhyt89Ndw":{"text":"This place is tucked in a nook behind train tracks and we waited 40 minutes for the train ","useful":2,"cool":0},"zH4n3x5cuUNfc3FtayBShg":{"text":"Get the bread.\nThen get everything else.\nSeafood rocks.\nConfit chicken rocks.\nJust go. \nBr","useful":0,"cool":0},"ZZZRSm_VKu4FmMmsyI2Ifg":{"text":"Bartender & Service staff seemed rude. Did not feel welcomed. Quite pretentious. Hope it w","useful":0,"cool":0},"brFbHugkWl4MFgXuYsoMSg":{"text":"Just the best place to chill when you need to get out of the Quarter. Awesome, relaxed amb","useful":0,"cool":0},"VM8SKT26Rm9u3UyjxP3yBw":{"text":"Stunning! An original and excellent dinning experience from beginning to end. I highly rec","useful":0,"cool":0},"smg5LbH2LseG1_bEzsQWlw":{"text":"Trying to impress someone? Come to this charming joint out in the by water. You walk in an","useful":1,"cool":1},"wEFKnsDU6vwSPi7x3zJHgw":{"text":"What a great place! Wine, cheese, outdoor dining, live music - what's not to love?\n\nOn our","useful":1,"cool":0},"8sY7-8feh_jBPqcx_j1YvA":{"text":"This is the most relaxing, tranquil dining experience I've ever had. The food was fresh ta","useful":1,"cool":1},"5cGgTteon9URON1xJ86Cag":{"text":"Sorry, but this place was a terrible experience for lunch.  According to their website the","useful":0,"cool":0},"R-0CnEGLb1WCvPmZ1AhaUA":{"text":"Went for late lunch. Lovely patio in the back. Sat out for hours enjoying ourselves. But i","useful":0,"cool":0},"jb65fsR51roPuMH9cuE51w":{"text":"The Fideos was one of the most amazing dishes I have ever tasted. Only $12 and totally wor","useful":0,"cool":0},"7w1Z7KjHna2YK-9mKiIUVw":{"text":"Pretty good wine selection, everything by the bottle. Small menu. I always get the cheese ","useful":0,"cool":0},"g2q1PY9CEr01BXwuVoNimw":{"text":"Worth the drive!!  This Bywater establishment attracts an ecclectic group of food, wine, m","useful":0,"cool":0},"2ble06mWOFRcowG4xXtGrg":{"text":"A welcome respite from the sea of French quarter revelers, cheap liquor, cafeteria grade i","useful":0,"cool":0},"12YagU5HU4SO8NA_xdF9_Q":{"text":"They have a very rich selection of some really good wines. Also you must try the cheese an","useful":2,"cool":1},"U_X7TBQ057gITPb-6L_NAg":{"text":"What can I say that has not been said? Five stars and I bring all my out of town friends h","useful":0,"cool":1},"BXCXrUePACYArrjoEYqj3A":{"text":"BLUF:  Easily one of my favorite places in NOLA.  Awesome atmosphere, food, awesome wine, ","useful":3,"cool":1},"YOmDO5oU2MY5Ogw-FAcy1A":{"text":"What?!?!?! This place is too amazing. I got steak the hubby got pork we both got happy bel","useful":0,"cool":0},"NQejtmnKtCBdeoL3zahZrA":{"text":"Been some time since I last visited. Not a fan of self-serve, retail format of the place a","useful":1,"cool":0},"-qekQSfp7xMEGWfmssdf5w":{"text":"This is a great place ... on Saturday night I attended Gypsy Swing Night.  The music was g","useful":0,"cool":1},"vWUGF4Pm_et4LDqqu0_v6Q":{"text":"Cute and quaint. Great place to enjoy good music, drinks and company.  You can buy a bottl","useful":1,"cool":1},"ed6F-7xLcl97wlbge0fP8g":{"text":"Fun little spot for live music, wine/cheese and dinner in the Bywater neighborhood. Wine c","useful":0,"cool":0},"A6W3R6dWAN7-iUARQkEDAw":{"text":"What a wonderful place to spend an afternoon or evening with friends. Friendly staff. Exce","useful":0,"cool":0},"x8mGkWCRkxr9KqucbPbWDA":{"text":"I've never been a fan of compromising. I like what I like, and I want it when I want it.  ","useful":0,"cool":0},"ZN4cgBx3rVF3P5gdhGCn7A":{"text":"We had a great time at Bacchanal!!! It's a neat place, if a little thick on the hipster vi","useful":0,"cool":0},"ND-q3_akU4iOtav0LiAKSQ":{"text":"We have taken 3 different sets of visitors to this place because it is a cool setting with","useful":1,"cool":0},"Hww-SaEx3a553cYsY5txew":{"text":"I was having a cocktail at the swizzle stick bar inside the Loews Hotel in New Orleans. Th","useful":0,"cool":0},"2JOnzXWPHZk6E8w5OGGbZw":{"text":"Good times had here for sure. A wonderful wine shop with a cool vibe and a helpful staff, ","useful":1,"cool":0},"8mIBv321diWFG1KWpcGMaQ":{"text":"My favorite hangout spot. Choose your cheese, choose your wine. Pick a spot and enjoy the ","useful":0,"cool":0},"BtkfDsiJqe_FfK-ioUt5hg":{"text":"I wanted to like this place. I guess I was expecting more. The courtyard is amazing. The w","useful":0,"cool":0},"6rDC4vO0fpmoHfF0z1R5-Q":{"text":"My wife and I returned to Bacchanal after a decent experience three years ago. This place ","useful":4,"cool":0},"zzjoyTlhUNbwROcANcYLPw":{"text":"Let me start by saying this was my favorite wine concept in NOLA. I can't describe it as a","useful":0,"cool":0},"PYzGaBpzXwMQrjukzQJ8DA":{"text":"This place legitimately could be my favorite restaurant that I've ever been to.  I didn't ","useful":1,"cool":1},"8PE9UovpsZ5PY6YpcSetJg":{"text":"A hidden gem.  I'm from California and there's no way a place like this would get away wit","useful":2,"cool":2},"6RQcOukiA378AOy1fPc2hg":{"text":"I was recommended this place by a local and I'm glad I checked it out. It's pretty far off","useful":0,"cool":0},"qvmZAaZJ6_bhEp-FKRXIjg":{"text":"Oh Bacchanal, how I love you. I love your mismatched patio furniture, tiki torches, and co","useful":5,"cool":4},"0E2h8BbPf_cc50XzVLQWuA":{"text":"Uniquely delightful experience - Jewell of NOLA next to the Mississippi in Bywater\n\nWe Ube","useful":1,"cool":1},"rMJwoFoFcOVXZE76BfLa0w":{"text":"I've always loved Bacchanal and every visit there, from the wine to the food to the beauti","useful":1,"cool":1},"0tdkeN-uCpnn6ueTUwqRFg":{"text":"Besides the moody bar tender it was an awesome experience. The food looked amazing. Drinks","useful":0,"cool":0},"3x0Gj-ZkMsKVq27VxXw-4g":{"text":"Great food! Mussels were amazing, the pork shoulder was tender and succulent. Live music a","useful":0,"cool":0},"VWA9Qgr4IMNAcf3mZVaNUw":{"text":"Absolutely delicious food. The ceviche and bacon wrapped dates are a must have! Very cool ","useful":0,"cool":1},"5v1zvVMuzvHuVTZCKnMSMQ":{"text":"I loved everything about this place but mostly the vibe in there. The waitstaff was pretty","useful":0,"cool":0},"VJxN1loeTHO-JA52C9HUgw":{"text":"Nice place to hang out with friends over a bottle of wine. Nice area. Very hip and casual.","useful":0,"cool":0},"wWjZZMRZHvThh9yu12FRFw":{"text":"There is nothing I do not like about this spot! So glad a friend took me here and it was j","useful":0,"cool":1},"0OJ_Zq_p1edA8uMJRKEtsA":{"text":"I loved this place!! I initially found it on Yelp when researching our trip to New Orleans","useful":2,"cool":3},"CmAkgN2c1KaBork1u1MwAA":{"text":"Bacchanal is incredible! One of my favorite hang outs on the planet. Its like a backyard p","useful":0,"cool":0},"bkyFZotz-KcifolX_2PkXA":{"text":"Went here after having it recommended by a local. We were definitely not disappointed. Goo","useful":0,"cool":0},"cScMrWhX6oP3PVyuWjZiRw":{"text":"We rolled in with like 10 guys as part of a bachelors party.  What a great experience.  It","useful":0,"cool":1},"Sae35J1L-A2xNbT749ry-A":{"text":"Best night out in NOLA. Great food, drink, music. Hidden at the other end of Bywater, not ","useful":0,"cool":0},"ya-VbPQgwWJHIfL719ydnA":{"text":"Aw sheeshus I used to adore this place back when I lived in New Orleans.  It's places like","useful":3,"cool":0},"L5lNtyUyb40vYzDEeI8QTA":{"text":"Was in NO for the weekend and a friend of mine who's a wine maker in Abruzzo said I to vis","useful":0,"cool":0},"AJtc9ydTS3zOtFoUtxDG7Q":{"text":"What a great, fun place!  To sit outside, under colored lights and torches on a beautiful ","useful":0,"cool":0},"w8btRwKZjUr2OQbVAQV_jQ":{"text":"So I ordered the mussels and I thought it was a joke. Every third mussel was empty.   Seri","useful":0,"cool":0},"JbwtN2sDt9b1I3uReF_sQw":{"text":"Read a review while visiting & took a cab over. Totally worth it. Random neighborhood spot","useful":0,"cool":0},"vF4FzDw1YXi30nLaWn6MPQ":{"text":"Hot Tip:  Take bug spray!  (The hostess had some, but I didn't realize it until it was too","useful":0,"cool":0},"XCgbb9haiac8SANcrqtVVQ":{"text":"Great atmosphere! We were in NOLA for the weekend, and came out here for a change of pace.","useful":0,"cool":0},"ebpLsSoZrB3x8O6nnDNITQ":{"text":"awesome food and live music.  great chill atmosphere.  love that they don't allow smoking ","useful":0,"cool":0},"3r4MNGEh_DVZvm66Q3WwBg":{"text":"Damnn.... this place is amazing! Every dish that came out tasted delicious... such fresh a","useful":0,"cool":0},"rRqad5-eheX1bDgSxYNUmA":{"text":"All I can say is....AMAZING FOOD!. Chicken liver mousse, mussels, pork shoulder, pork chop","useful":0,"cool":0},"GqIu1AWZjqRau8mSKPYXrQ":{"text":"Live music, cheese plates, and reasonably priced bottles of wine in an intimate outdoor se","useful":2,"cool":3},"t__xKXJR5adrBzKqZmTu2A":{"text":"Gidden gem is maybe the best way to describe this place. \n\nBacchanal located far away from","useful":2,"cool":1},"Yl1EBTuE7dGdFS00yI7RKA":{"text":"This is 4.5 stars.\n\nWe were biking back from the lower 9th Ward, the worst hit part of New","useful":1,"cool":1},"71y-O7Kjbqkc8dxozwgfzg":{"text":"This is a really cool place. The other reviewers have nailed the food/wine/setting/vibe do","useful":1,"cool":0},"02eZm591aDQ9mVPGoY-4XQ":{"text":"The bartender wearing glasses who was working upstairs last night (10/20/2016) really put ","useful":0,"cool":0},"Whcud-eNl_fLXOJoKUw9mQ":{"text":"Perfect ten! Best meal I had the entire trip. The chef is amazing and her gastronomic visi","useful":0,"cool":0},"wD5CdfmxSTWhak4e9tKU-w":{"text":"Wonderful hidden gem in NOLA's Bywater neighborhood. So happy a this venue was recommended","useful":1,"cool":2},"BV8Y29mv2ZE9HNen18v-Xg":{"text":"There are pros and cons on why I wish I could be a regular, and why I'm glad I'm not a reg","useful":0,"cool":0},"6CDwiFnyZ29kxwumxCsjzA":{"text":"Wonderful local wine dive with tasty food. The wine selection varies to meet all grape pal","useful":0,"cool":0},"chSwG0aG6bIYzLSkbdFnKQ":{"text":"As soon as I heard Bacchanal Wine described as a **Magical Fairy Garden** I KNEW I had to ","useful":5,"cool":2},"vZ6QWJNYpnI4R1bqo0YITA":{"text":"Not a fan...yet. We rode bikes to sample a light Saturday lunch. Since it was our first vi","useful":2,"cool":0},"EcnusYEeyybBo-ffwDoTAA":{"text":"Loved this place. Great wine selection. Delicious food. Amazing cheese. Great band. Perfec","useful":0,"cool":0},"mXfXoFDNODGsOH5zuvuFlw":{"text":"Awesome place!! Last two times we were in NOLA we spent 2 whole days hanging outside liste","useful":0,"cool":0},"JoFA006whZ4j1DrNKcsPpw":{"text":"Bacchanal stands up tall to the high expectations from other reviews. Not only is the live","useful":0,"cool":0},"6TTKGFUvPRbKJB-e3YaWtQ":{"text":"Great place.  Very easy going.  You buy wine in the shop and then grab a table out back.  ","useful":0,"cool":0},"h1KMNPx3VhzlSxI5cDpryA":{"text":"Nice place to buy a good bottle of wine,  the sort of place you want to support.   i like ","useful":1,"cool":1},"oUFFQsLc93MliJqf1Rq-XA":{"text":"Pretty much the coolest. Great atmosphere, music, beverage selection, and the food looked ","useful":0,"cool":1},"nPbhmBwTibsIvUvPJC-lVw":{"text":"Bacchanal brings some of the best NOLA elements together - an eclectic outdoor space, live","useful":1,"cool":1},"5zOuBkGFE-tbMT49cherXg":{"text":"Love this place. So relaxing ...away from the craziness of the French quarter.  Mellow amb","useful":0,"cool":0},"3IYT6jFsA03sMKY6K-LQ1g":{"text":"Really cool place with amazing food (on days when the cook decides to show up), i really l","useful":0,"cool":1},"mULNI-lPhML3POy6GVgFpQ":{"text":"great place. friendly people. nice selection of wine that you can buy and either drink on ","useful":0,"cool":0},"ua5acOXpNxZusKyvctKG4A":{"text":"This is a very special and unique place. We had a great evening here - delicious drinks, g","useful":0,"cool":0},"0ouMQk3UBvn8da2dSshAEQ":{"text":"One of the best meals I have ever eaten. Me and my boyfriend were insistent on finding out","useful":1,"cool":0},"p9yoqocWlbrjsvHGoBZ_GA":{"text":"Great music, awesome wine selection and a really cool open air backyard setting. I had an ","useful":0,"cool":0},"Bf9GhJGmzWFUs6YSvaVdhQ":{"text":"I was pleasantly surprised by this place! The outside is a bit deceiving but once you're t","useful":0,"cool":0},"nbDHnGcdgePSLAlAdwHPKQ":{"text":"This is one of the best date spots in the city. Bacchanal is basically a wine store with a","useful":0,"cool":0},"3nTew-r4NKvomD148uqBeg":{"text":"One of my all time favorites every time I visit NOLA. We always buy The Frappato as a star","useful":0,"cool":1},"JwXrfscOxwScYRQpSWEzzA":{"text":"This place is an effing gem. Seriously. Whoever the brains of this operation is deserves a","useful":1,"cool":1},"AJisEgy4_xNnWiNvczCHsQ":{"text":"Expensive night out but everything was fantastic, so the price is well earned.  Great spac","useful":0,"cool":0},"6u60Wo8r-IOhtPQYjQvjLw":{"text":"the charm of eating at bacchanal is in the company you keep and the amount of time you hav","useful":1,"cool":0},"mlVX2TMMUe42JepCc0hVMw":{"text":"Went specifically for the food and was really impressed!!!! TRY the bacon wrapped dates! T","useful":0,"cool":0},"qo0A-38yTR7lBji7kO89CA":{"text":"Great food, cozy, casual, relaxed ambiance. ... Live music, great place for a date or a ni","useful":1,"cool":1},"OpX-aXuvZE5T9C_b8wQ0_Q":{"text":"My airbnb host, multiple Uber drivers, and the internet all directed me to Bacchanal, and ","useful":3,"cool":2},"c5bAgpUeJ0MYPhvTzZh2xw":{"text":"Cool beyond cool...amazing wines, great back yard atmosphere w amazing live music to match","useful":0,"cool":0},"9akJy8efX1busYphuPfheA":{"text":"pretty much my favorite late night staple. If you want really well made local food prepare","useful":1,"cool":1},"PUzCF_rH3kDQcQLGwRQwIA":{"text":"The atmosphere listening to the musicians while having dinner on a summer evening was very","useful":0,"cool":0},"B2fjJWT4erE4sG7Eagu26g":{"text":"We only had drinks, no food, but the experience at Bacchanal was so enjoyable. We had had ","useful":0,"cool":0},"8X4JsWYuxCMLrTFm1ued9w":{"text":"my favorite place in NOLA to gather with friends new, old or from out of town. You can nos","useful":0,"cool":0},"BZrUDPBRs2pmsr73i8th5Q":{"text":"Atmosphere: amazing! Live music: amazing!. The rest of the experience was terrible. I orde","useful":5,"cool":2},"dv4wYxSv-EmRyrKoAl24JA":{"text":"We went on a Thursday afternoon on March so the weather was cool.\n\nBacchanal was recommend","useful":0,"cool":0},"5ry5i4BEw4_u4gU6GmoILw":{"text":"Huge\nSpace for\nPassing time\nWith drinks, wine,\nAnd food. Spirit influenced by the crowd.","useful":1,"cool":0},"ovvvSwg7hV3OzT8KMLTyIg":{"text":"Love this place. Finding a seat is a pain but there is a good reason. Great atmosphere wit","useful":0,"cool":0},"Xygi6qIo-nDi_x9iEfSj_Q":{"text":"Fun spot for drinking wine, eating a cheese plate or a variety of small plate choices, and","useful":1,"cool":0},"UFygMi7oIo4nG6V8U3QYvw":{"text":"Literally a little whole in the wall, but amazing atmosphere. You pick your wine and if yo","useful":0,"cool":1},"32fxlcJxrTeZDyIS32yL5w":{"text":"One of my favourite places that I got to go in Nola \nThe armour was unreal, live music, po","useful":0,"cool":0},"gWXbcX49aTW-meSvvg17sw":{"text":"This place is a must visit. A local highly recommended us dining here before leaving NOLA.","useful":1,"cool":0},"abgqIHAyQ_qhd8g2v8SUkg":{"text":"When given the chance to make one recommendation about a visit to New Orleans... Bacchanal","useful":1,"cool":0},"XlIyQo_SiPCIAc4o0DSxyg":{"text":"Bacchanal might be my favorite place in the whole world.  At least my favorite in all of N","useful":2,"cool":0},"4p9za5tmUp44dONbpWZZTg":{"text":"WTH! Who is writing these reviews? The wine was mediocre--after we figured out how to orde","useful":0,"cool":0},"GIjRdQ2hEGD-CFu9A-BtDw":{"text":"Weirdly awesome!\n\nYou probably need a little guidance. This place is a fantastic find. \n\nW","useful":1,"cool":1},"5Z80shokn0TaTmb7rGjTmA":{"text":"I don't have a review for Bacchanal?! Bad Yelper, Lindsay! I love this place. Bacchanal le","useful":6,"cool":3},"Cs7KOHGTf3j4cPD-AhTQLA":{"text":"If I could sum up my experience briefly, it would be: Pretentious & hipstery.\n\nIt's slight","useful":2,"cool":0},"av7-FX75Sx51DXEeGqzRYQ":{"text":"Visited during a recent NOLA trip to find a tidy, stocked wine shop with a large, eclectic","useful":6,"cool":5},"kllsPYjnb4B2l9yKRkIlpA":{"text":"This had to be one of the coolest venues I've ever been to. It's been over a year since I ","useful":0,"cool":0},"9T82MAIAUaMHORE7ToE07Q":{"text":"What a charming gem in the Bywater neighborhood! We bought a bottle of good red wine, pick","useful":0,"cool":0},"E5uyCLozoxaMdXwpTp-w6A":{"text":"Awesome outdoor spot... Great wine, food, and live music. Super chill. Highly recommend! N","useful":0,"cool":0},"0TTJjSH8TD5bZfp3ocwJkA":{"text":"What a gorgeous setting! Can't wait until fall to enjoy the full scope of the backyard. Th","useful":5,"cool":2},"UqDyXatKDzirHSDYM997Dg":{"text":"Such a pleasant surprise!!! Lawn chairs could use an upgrade ..:) but other then that . I ","useful":0,"cool":0},"41uB0hOcrtEGiLPmE3H5vw":{"text":"Great concept. Buy wine and cheese in the store, then small plates in the garden. The food","useful":0,"cool":0},"NhX-gJWXnlEsBqsGMEBM_A":{"text":"A great spot in New Orleans. Off the beaten path, and really unique in its set up: you wal","useful":0,"cool":0},"6-7DS0Gal6y171tcdn4FTA":{"text":"Fantastic spot in NOLA! I had some trepidation in the beginning based on the crowd, howeve","useful":0,"cool":0},"z31PQ-rHcvOtiFehT8Mvrw":{"text":"My husband is not a wine person, he likes his craft beers, but even he said this was one o","useful":1,"cool":0},"G9OQ6djdMx2_jqmrvC38TQ":{"text":"Wow -- my friend and I truly had a 5-star experience at Bacchanal! Getting in, we were a l","useful":0,"cool":0},"s1c43rSov0xs-0dF9whEDQ":{"text":"This place is MAGICAL. Great time with my boyfriend and mom. Great assistance if you want ","useful":0,"cool":0},"1zN1XGDfEbJi7FCXBHW1zw":{"text":"We came here on a local's recommendation.  After 3 days in New Orleans this was by far one","useful":0,"cool":0},"-pNKH74PWpYmBBS_fbatGQ":{"text":"What a great concept! When you walk in you can buy a bottle of wine, some cheese and bread","useful":3,"cool":0},"YhzcaPHGEp8AeXvl4JxDeQ":{"text":"Just before our NOLA trip I got a recommendation to visit this neighborhood spot in the By","useful":0,"cool":0},"mSr30lHZCXolemRLRKVJ0g":{"text":"Great food! Innovative cocktails. We sat upstairs. There were a bunch of large parties enj","useful":0,"cool":0},"xFL58dwDE6aRkVnYIq7u3g":{"text":"A friend who lives in New Orleans took me here when I was visiting from out of town.  I lo","useful":1,"cool":0},"Rvqv28Gm4Ru-N0mIb_Rh4Q":{"text":"Bacchinal is one of my very favorite places in Nola - perhaps the world!  I have been enjo","useful":2,"cool":2},"GWFsBVeiI_7GND1qRyFrGw":{"text":"Ok so seriously guys this is the best kept secret of NOLA! Like i asked one is the waiters","useful":0,"cool":0},"ka8w9nwJXR6O4zwXyfobMw":{"text":"I've only been here once, but I enjoyed the experience greatly while celebrating a friend'","useful":2,"cool":3},"b3SvZdW1DdhbXXdTxgHqzw":{"text":"Amazing place tucked on the corner! The atmosphere was relaxing and its perfect spot to sp","useful":1,"cool":0},"lfrnbQAzS1_Hm6iy6guIUg":{"text":"I LOVE this place!  We found this spot after meeting some locals.  You buy a bottle of win","useful":0,"cool":0},"LLqohXzlDImZUUE8Uu-NaA":{"text":"Fantastic experience! We selected cheeses and and got a lot of help from the servers for t","useful":1,"cool":1},"vU41isP5E-gQvyxOo4oHjA":{"text":"My previous \"Best Kept Secret in New Orleans\" was Bywater Bakery, now it's Bacchanal. This","useful":2,"cool":0},"dLElrlvyTW9Pwj0rC-ThSw":{"text":"This is a great place to go and have bottles of wine, share some tapas and chat while a go","useful":4,"cool":2},"5YI8z-20PzoxVK1zm1fnIA":{"text":"I had such a great time at Bacchanal. You enter through the wine/cheese shop where you can","useful":0,"cool":0},"v8PtSg7SB7z9xO-VWui-Tw":{"text":"Cool outside seating area, not a great beer selection, but excellent beer and cheese selec","useful":0,"cool":0},"L2WdJMnuohrpBXrMwodWjQ":{"text":"This was the highlight of my trip to New Orleans. I heard about Bacchanal on the Gravy pod","useful":2,"cool":1},"vp84SHIC92nnq3bn4uNqtQ":{"text":"This little spot came HIGHLY recommended to us by our bartender, Andy, at the Lowe's Hotel","useful":0,"cool":0},"crUqwibN5VBYRcC1xlqEVQ":{"text":"Stopped at Bacchanal after having a bite to eat at Rosalita's Tacos (highly recommend, and","useful":0,"cool":0},"aOvyFNlbV6eo9ntTyxNBvQ":{"text":"Great vibe and an awesome place to hang out, especially if you can get a seat in the beaut","useful":0,"cool":0},"5bubNYGqga80gUG5jsQRNA":{"text":"Was here with a couple of friends. I don't know a ton about wine, so they picked it out. T","useful":0,"cool":0},"xhLV8rPyvzFpWW6UC2fuuw":{"text":"Had a terrible experience here. We wanted to go have a nice lunch and sit outside but we w","useful":0,"cool":0},"6dt30XynpHBd_zd94c9lmA":{"text":"You would never know by the front how amazing this place is! We walked in and thought we w","useful":0,"cool":1},"PYcWBLn3k6rOiHuXA551Vw":{"text":"For Thanksgiving, I was given a simple job of picking out 3 bottles of wine to bring over.","useful":3,"cool":2},"R9mTL0Z0gYLfCFgLkDEkxQ":{"text":"the most magical place in NOLA. always a good time + cheese boards. outside kind of sketch","useful":0,"cool":0},"MEwPdg5hsqMnhSxmLS68GA":{"text":"What an amazing afternoon \n\nCheese and meats and amazing wine selection. Awesome outdoor p","useful":0,"cool":0},"KLP8bpZxomZUnqWF1k-8TA":{"text":"Awesome last day experience! Do this one! Had some great wine, amazing cheese and food. Th","useful":0,"cool":0},"-uAETO931Xe8yckRxH-rfw":{"text":"Can't tell you how much we loved the wine, food and ambiance of this place. Wish we had kn","useful":0,"cool":0},"_-WWw8EB3zurxQWWNqmanA":{"text":"This place is all kinds of right. Atmosphere, food and music. My husband and I spent a lov","useful":0,"cool":0},"lsrzBSLB-BTy-x5hFy1DmA":{"text":"I love this place.  I come here at least once a week.  The food is great and the wine sele","useful":1,"cool":1},"-lkTFzfLZonV6BjVhGaTDQ":{"text":"Such an unexpected and delightful experience!  As you enter the small, faintly lit front d","useful":1,"cool":1},"k5SqdtEshxnQhlzIfaP7zA":{"text":"My friends and I were referred to this place for our trip to NOLA. We ended up spending 5+","useful":0,"cool":0},"1bdTaMohGYR7iQX9Xq3F5Q":{"text":"Bacchanal is a Bywater treat.  It is relaxed, pretty, and authentic.  They have a beautifu","useful":2,"cool":1},"VbHNU7zclDQdMckdGBgAjQ":{"text":"A true definition of \"hidden gem.\" Delicious food and large, varied selection of wine and ","useful":0,"cool":0},"YW6xrnaTBxCW7DKqXSImWw":{"text":"Great spot to relax with some wine and cheese outside while listening to live music. You p","useful":0,"cool":0},"IbuVc3e6_9MZlcLuEpIlkg":{"text":"Went here my first nite in New Orleans, it was close to our air bnb and our host recommend","useful":0,"cool":0},"l92xDlfpXD7Bv6ytXMve5g":{"text":"Such a fun place! Great music, great wine, and delicious cheese plate. We were visiting Ne","useful":0,"cool":0},"Fr1FoFcNzj6pM__uuKe6Fw":{"text":"Bacchanal has improved every year- the wine and cheese is amazing, we added  the olives, c","useful":0,"cool":0},"DC3L0cGDDNNNlw3YXOyIFA":{"text":"This is a festive, fun place with good food and wine.  You walk into what appears to be a ","useful":0,"cool":0},"o33bEIdyDRoIzNL1PlbQrg":{"text":"Incredible patio with tons of seating. Great music! Off the beaten path for the tourists, ","useful":0,"cool":0},"4BfL0ljKew7ob8Quy4gyEg":{"text":"I was a little out of my element and didn't quite figure out initially how it works at Bac","useful":0,"cool":0},"jQ4_iUU6hVIpjr9-F77doA":{"text":"Love love love! I had seen this place on Treme but my friend picked it based on a local re","useful":1,"cool":0},"Ny-_PLw4_9GN5PaJhVtuxw":{"text":"I enjoy going to Bacchanal...food and atmosphere are on point, combined with the bands on ","useful":0,"cool":0},"RA1o-wirzNHRhNmUbAQwpw":{"text":"Stopped in for music and lunch at the bar and loved it so much had to come back for dinner","useful":0,"cool":0},"06CfxqKu90FiHckYB5BosQ":{"text":"This place is awesome. Haven't had the privilege of coming for a live show but did come fo","useful":0,"cool":1},"T4V0jVBQ4Mxax2lfCCAQqg":{"text":"Solid place. It was probably the unseasonal cold but the place was sort of dead. There was","useful":0,"cool":0},"AkGnd2l5CBYzAaGsfkYZSw":{"text":"So this place was recommended by my Lyft driver, and I wanted to to call him later in the ","useful":0,"cool":0},"4mk_peKRn4M4MYm5P2fa5Q":{"text":"Bacchanal is a must visit when you come to NOLA. My friend and I were in town for 3 days a","useful":0,"cool":0},"_iSuznugWv1R0pwK77cmoA":{"text":"The wine, cheese, and food were all good. Prices seem fair, but this is not a a cheap outi","useful":0,"cool":1},"S2NkF5WVSroq8gR7GrZ2jQ":{"text":"My boyfriend and I went here for dinner a few weeks ago on the first night of a trip to No","useful":0,"cool":0},"1xeMmc98kGoo_kuB2tPwWQ":{"text":"Bacchanal is such an impressing find! Tucked in the Bywater district it isn't easy for tou","useful":0,"cool":0},"heQOHvGcB17DWQfBeGYaew":{"text":"Great drinks, live music and multiple bars! A great place in the speak easy. The bartender","useful":0,"cool":0},"foHVp_cIJMLpa__V5UJ9cw":{"text":"We went there for the wine and the cheese and boy we were surprised. Not only the wine was","useful":0,"cool":0},"xP7aPN5g2g33MEmTokxSxQ":{"text":"I can spend hours upon hours at this backyard wine bar. In fact, I did. \n\nWalk in to the f","useful":10,"cool":4},"gcA13eKlnn202Ac1wHns1A":{"text":"Really liked this place. You can buy a bottle of wine inside and then take it and go sit o","useful":0,"cool":0},"uzLzvztRgjVI0ybw_5YCyg":{"text":"Wow, this place is absolutely fantastic!!! I came here with my friend on Halloween because","useful":0,"cool":0},"TpvnNK5HGZz68nWLGIRNFQ":{"text":"Awesome place to hang out / lounge with live music and chill vibes. \n\nCame mid afternoon b","useful":0,"cool":0},"k3NWCA9FfroZhBDfvLgOdg":{"text":"First time here and this place was amazing! The atmosphere is so different and unique. It ","useful":0,"cool":0},"xRtnFxm6FE8-dgwD2Xuwrg":{"text":"Sometimes I do like to be able to pretend I am a sophisticate. Sometimes I like to pretend","useful":4,"cool":2},"WI2CQ6dr5PxbanaRZpmikA":{"text":"Very fun local atmosphere! It's nice to get away from the quarter and have a different lai","useful":0,"cool":0},"-5vTQhEbIeNfGtZc_7-N2A":{"text":"This was a very chill place. We came on a friday evening and it was packed. We like sweet ","useful":0,"cool":0},"6xeduVCKYEQo8CzM82y56w":{"text":"Great COVID setup. Felt safe and clean. Staff was great and food and drinks arrived quickl","useful":1,"cool":0},"bu3pNT-qF28nynmwz05E1w":{"text":"If you like wine and a low key atmosphere- run to Bacchanal!!!! We had the best time sitti","useful":0,"cool":0},"yir1eye_30zH9-lTMFR9Lg":{"text":"I am updating my review. Bacchanal is very much unchanged from when I was here last; the f","useful":0,"cool":0},"NOQ9jMi8rqf9X2RGEx4djg":{"text":"Our Airbnb host recommended this place as it's a quick walk from our place. It was amazing","useful":0,"cool":0},"y75slnL3w8P9VvHdkKT1xw":{"text":"THE place to go to if you are in the bywater, love music, and can't wait to drink some win","useful":0,"cool":0},"QNaLc917QH9vucPIyH99dA":{"text":"I have some mixed reviews here but for the most part good. Hopefully this post serves as s","useful":3,"cool":1},"jnCNzBqD_XD_h4h6F_RPPA":{"text":"If you want to be mellow, enjoy wine or beer, cheese, a unique atmosphere, and the coolest","useful":1,"cool":1},"PoGEJ2O66p4PuEfdd6ThYA":{"text":"The thing to resent about Bacchanal is the way they presume there's no reason not to overc","useful":0,"cool":0},"sU6gEvGMW7i_Kl5J8WJGAw":{"text":"5/5 a gem\n\nno matter how \"touristy\" this gets, even with the stupid line these days, this ","useful":5,"cool":2},"um6n7hCUpXWBLSdhlCmUqw":{"text":"Beyond wonderful. Went here with a group of friends and everyone had a great time. Althoug","useful":0,"cool":0},"ga062y7P2YuZ8DB9XttCnA":{"text":"Nice place, but it does get a bit crowded in the evening. The cheese plates are clean and ","useful":0,"cool":0},"gPs0791869a6F7Qt55Z9YA":{"text":"Wonderful service. As soon as we walked in, two guys greeted us, asked if we needed anythi","useful":0,"cool":0},"OEkBrMpiCFaRQ-9xwOlelQ":{"text":"I always have an amazing time here! This place is great for a date night or even a fun eve","useful":0,"cool":0},"69OEE7U8WAd9kyx1Cc3aOA":{"text":"For me, it was love at first sip.\n\nI have dreams of opening up a little place of my own ju","useful":0,"cool":0},"2nEyKoKuKR44c1hAxMi5ZA":{"text":"let's see..wine store with really exceptional wine and the back room opens up to a patio w","useful":0,"cool":0},"V8f5VfQ6omCJn6odO8pbHg":{"text":"Bacchanal is a must every time we're in town. I read recently that it is now considered a ","useful":1,"cool":0},"FO3EfPDWnvR7fRoT37_97w":{"text":"Uhhhh... What the heck... Why all the fuss about this place?   4.5 stars with hundreds of ","useful":4,"cool":0},"OryfOLxrgWE0GOkMJTQ7rQ":{"text":"Very unique concept and enjoyable experience. Wine store, serving cheese and protein pairi","useful":0,"cool":1},"RIfRKUoWUnxJKFQMc0_qcg":{"text":"Great place! I'm down for wine and cheese probably 90% of anytime, but this place is a sma","useful":0,"cool":1},"a6m_6FDjJ-r1RIkAbcxxpQ":{"text":"I really enjoyed this place. When you first walk in, you can look through the different se","useful":1,"cool":0},"uc1T0DQta2QqoRq0m5gbqg":{"text":"THIS is why I love Yelp!! Local finds outside of the touristy places. While sating in Bywa","useful":9,"cool":2},"g_24RF6oVISOB-9Apmev1A":{"text":"We visited after our wonderful Uber driver recommended this place....great atmosphere, ser","useful":0,"cool":0},"l6HAiZYhoc7lzSMTLtUzEw":{"text":"I get what everyone is talking about. We stopped here after our flight was cancelled and o","useful":3,"cool":2},"4Pb9MUAec0Cnx3N59T2agg":{"text":"Really nice place. Lovely wine store and they do wine tasting. Only downfall it gets super","useful":0,"cool":0},"TDVgK0fzhbPDrxUrAIJYKQ":{"text":"Had THE BEST TIME here!  That outside garden area is just made for communal enjoyment.","useful":0,"cool":0},"26SwMc5cvlYVaHunZTCSCQ":{"text":"I LOVE this spot and think the DIY cheese plate it great. What looks like just a typical w","useful":0,"cool":0},"qCpaLVN4rRfjTEOoruQZoQ":{"text":"You'd think Bacchanal couldn't get any better (and a year ago, I would have agreed). Oh bu","useful":20,"cool":16},"K4Tt_VtwPzEpBIBDWtH47g":{"text":"Great idea, great vibes. Platter is good for 4 to 6 people. The live music gives the place","useful":0,"cool":0},"jbKKXXomsnOSDQ9N7bLhug":{"text":"One of my favourite spots on my visit there!\n\nYou enter the wine shop, choose your wine by","useful":1,"cool":0},"s_R0ObvXIpQfU4o7WAQgQg":{"text":"Love the vibe here. Very hipster but still a great place to chill with your friends. You c","useful":0,"cool":0},"bECkHA7roLgFpG1cesps-g":{"text":"Thank goodness they got their permits back! I was missing me some Bacchanal.\n\nGreat place ","useful":2,"cool":1},"_LufUWCWKeYAiKcBUta85Q":{"text":"I'm from New Jersey and this place is exactly what New Jersey is missing. Cheese, charcute","useful":0,"cool":0},"uUrG2F8GRkyYo2SztOsAmw":{"text":"Very cool spot deep in the Bywater neighborhood where you can listen to good music and sip","useful":0,"cool":0},"2u9DUmnDFibYltWoWe4ZvQ":{"text":"A couple friends and I decided to check this spot out on Tuesday evening. We were hoping f","useful":8,"cool":7},"UqGi4iE8Wzn94VpkgtpmWQ":{"text":"Can I just say that this place is a hidden gem. If you are visiting New Orleans...make it ","useful":2,"cool":1},"1W1aPI6AwCO8fIOeBeFvUA":{"text":"Was really excited to try this place out after hearing great reviews from a friend.  The f","useful":0,"cool":1},"o6AQBY8hTG5d0RLyK5VE4w":{"text":"This place is this laid back wine bar that you have been trying to find your whole life. Y","useful":1,"cool":1},"2Aa51MQ0I_21Y7DRbm9m3g":{"text":"Great place to go with a group of friends. We actually biked there, and there is a bike ra","useful":0,"cool":0},"-oYxyzss3VetwKzNbe1dhg":{"text":"I love the tagline for 5 star ratings - \"Woohoo! As good as it gets!\" Couldn't be more spo","useful":2,"cool":1},"1sFPbW91iJFbkqRo0JF_og":{"text":"The food at Bacchanal is at a minimum solid, and often fantastic.  With the addition of th","useful":0,"cool":0},"28mL9Pwt6H42Ynq4YzvSuw":{"text":"A fun night out in New Orleans with a friend on a recent trip. We had a great time having ","useful":0,"cool":0},"zIKhWU2wA0qkTWqT7rNz9w":{"text":"We absolutely adore Bacchanal! We visited Nola for a few months ago and to our good luck s","useful":1,"cool":0},"d06viQgv40CHR9ttD4XjSg":{"text":"I've been here more times than I can count so I'm having a hard time thinking of why I hav","useful":2,"cool":0},"LyAqGTjHX4D4b06KuPmyYg":{"text":"Best to go when the weather is good so you can sit outside and listen to the live music.  ","useful":0,"cool":0},"q-LFZIaqo7qSGzJHQ3TQtg":{"text":"Such a cool spot to spend a laid-back night in New Orleans. I loved everything about the a","useful":0,"cool":0},"J9zvqX3DW_MzUEe1AJbjoQ":{"text":"This is an awesome place to come for a very chill night with friends- they make an awesome","useful":0,"cool":0},"BtTtnlU3xzH6LshBzBEixQ":{"text":"I love this place. I just wish it wasn't so far from my house and easier to get to with pu","useful":2,"cool":1},"b67Y4_6N2XydK-iybVj7zg":{"text":"This spot lives up to the hype -- definitely an experience & ambiance to remember for your","useful":0,"cool":0},"ILhI8mXAGg6LVM5xl24wkA":{"text":"The wine cellar has an excellent selection with plenty of people to help choose a wine for","useful":0,"cool":1},"lOQ-65wXR3dCr3JKz_Km6g":{"text":"This is my first review. Not because I'm technologically incapable, but because this is th","useful":4,"cool":0},"JarqY9yoqhLGW0DQaL7idA":{"text":"Since it's been 4 years since I last reviewed the place, it's time to update my review. I ","useful":13,"cool":8},"45zgSszltsrRBwXiDUkNXw":{"text":"After enjoying a long day at FQF with a former New Orlean, I asked her to suggest any plac","useful":0,"cool":0},"PHG16P1HXJbEBnbas13oBA":{"text":"I bring all my visitors to Bacchanal. It is great for groups and birthdays. They do not to","useful":2,"cool":1},"BYAfuqrJLEO5rIGPvpL6Zw":{"text":"Went with friends because of the ratings. I was not impressed the meat selection was very ","useful":0,"cool":0},"NP10fQuFErHGGpYYuxUKpA":{"text":"bar tender was pretty rude and it was very obvious she didn't care to be there. the steak ","useful":0,"cool":0},"_epAZ8DEcVFV9rAC9buFOA":{"text":"This is my favorite place in town for a date night or a relaxed girls evening. Picking you","useful":0,"cool":0},"JklxEwCJ51PBAx9hUXv-0Q":{"text":"Awful customer service! Besides that... cool atmosphere and concept. Similar concept in Mi","useful":0,"cool":0},"Fh-OPrShZ-Bu6x7e4V7U-g":{"text":"Came here and got a fantastic wine recommendation. There is a gorgeous outdoor patio to ea","useful":0,"cool":0},"oqp53DeSzvK_Uf46pb-glw":{"text":"*gasp* \"You don't know about Bacchanal?!\" \n\nIf you've heard this, you were probably prompt","useful":20,"cool":10},"HryMprdbg1tTuEj6ywrmlw":{"text":"I was positively blown away by Bacchanal's ambience when we stopped in just to take a peek","useful":2,"cool":2},"pIUPaPxefu-kkVOHl_nr_w":{"text":"Bacchanal is the #1 place to take out-of-towners when they hit you with the \"so what do yo","useful":19,"cool":14},"XO0gfBeQOJX45RCcleiOag":{"text":"Unique venue that combines outdoor live music with excellent food and alcohol -- nothing q","useful":0,"cool":0},"8oAu5HY-oAW3-ICaOA8Nxw":{"text":"Amazing place to hang out and relax to live jazz. They have a variety of wines to choose f","useful":0,"cool":1},"iaLC6rilJmvhoW5CkwdTOw":{"text":"This place is awesome!!! What can I say except that you have to experience it. Great food,","useful":0,"cool":0},"9qi--0yJcIKsfEr6_9Cx9A":{"text":"What a joke!! Wait in line for overpriced wine and terrible service!   What's the line abo","useful":1,"cool":0},"6kDIPTVWAYX_IkSIjKG1YA":{"text":"Great vibe, excellent wine, charcuterie boards, and the bacon wrapped dates were heavenly.","useful":0,"cool":0},"jSTyu9UOh5y4CCenUvm5PA":{"text":"Great food. Great ambiance. Great music. \nHOWEVER, ridiculous wait and staff with attitude","useful":0,"cool":0},"V2oxYU0UZYFn2Ww6yU60gg":{"text":"Great local place to enjoy a bottle of wine or two,snacks and live music from California l","useful":0,"cool":0},"KE-BmDBMcHnDyLNuh963wQ":{"text":"Such a fantastic spot tucked away in the 9th ward of New Orleans! I love the environment, ","useful":0,"cool":0},"K5qaDRoq4MUrfumjHPbwdA":{"text":"We walked quite a ways for this place and we weren't disappointed. We are enjoying any aft","useful":0,"cool":0},"N6l1S8PCxq_JyZ39pgD2Rw":{"text":"We read about Bacchanal in the Invader's Guide to the city and mentioned it to our host. S","useful":1,"cool":0},"qNf_xUx8teiMf0PKRpEOBg":{"text":"Fun spot in the uniquely situated Bywater district. I'm talking abandoned industrial build","useful":0,"cool":0},"WAjoIIzvewMpOqsg_BwX9g":{"text":"Great place !! Amazing wine selection! Great food and the atmosphere is relaxing and simpl","useful":0,"cool":0},"4WqzR6QI_IHpORn0C0eZ7w":{"text":"Bacchanal was one of my favorite spots when visiting New Orleans. You initially walk into ","useful":0,"cool":0},"9O3epmPDEEU_eSh51lOP6w":{"text":"This is a local jewel. The Mediterranean vibe outdoors and the live bands makes this a gre","useful":0,"cool":0},"-nNEcfYLOemcgWqwe2D_0g":{"text":"My go to wine bar in New Orleans. Walk through the front door and you enter a small wine s","useful":2,"cool":2},"JoohIuE7an8PyN4KVp9w9Q":{"text":"If you want to have a night of great wine, people, food and a magical environment go to Ba","useful":0,"cool":0},"luoAiDKF0o8M_lKc8yYBpg":{"text":"What I appreciate most about Bacchanal Wine is the element of surprise it presents. From t","useful":1,"cool":0},"UYdJB0-oPMFAYfCy_MnePw":{"text":"This place is everything you are looking for. Great wine options, purchase by the bottle, ","useful":1,"cool":0},"OVpWOQi-5FukWgJPa0kOMg":{"text":"Best place ever. Food is phenomenal. The summer squash sald thing is so amazing never real","useful":0,"cool":1},"8lWvO7ZoU-AcSQoNAU6FGQ":{"text":"Remember that time you had a good looking, knowledgeable lady help you pick out a great bo","useful":1,"cool":0},"wmZYqdjy1cefoXnBGV2w-A":{"text":"This is such a fun place for a group, or even a romantic outing for two.  I bought cheese ","useful":2,"cool":1},"gH-zOEWj79GrC81L7As0xw":{"text":"Amazing. Imagine a friend called and invited you to a chill backyard social. You pay for f","useful":0,"cool":0},"RZ2BmrjfkVX2Wir4-RojCQ":{"text":"I went on a Tuesday night and thought this place was fantastic. Like most say, you walk in","useful":2,"cool":0},"YHegBp2rqeStQ3LCq5hpHQ":{"text":"We don't have anything like this in Boston, and it's a shame!\n\nBacchanal and N7 were on my","useful":0,"cool":1},"zml6eVg_1Ta_4WNCFoPXCw":{"text":"Very nice place to spend an evening.  Nice wine, great music, terrific atmosphere.  Come w","useful":0,"cool":0},"db4QwpP8F-ZB0FCd2y5FTw":{"text":"Most definitely one of my favs  here in NOLA, staff is friendly.... service is great.....v","useful":0,"cool":0},"CaAOQ5PBj5TQllpYcZ9opg":{"text":"Oh Bacchanal... What can I say that hasn't already been said a thousand times?? THANK YOU ","useful":7,"cool":8},"D3M7oGp3wMtSc5vaiy4thg":{"text":"Love the concept. Love the cheese plate. Love the atmosphere. It's so neat. To walk into a","useful":0,"cool":0},"XwrWdiWC8RhzxY8NXe4RRQ":{"text":"love the vibe and the wine and the charcuterie! Unique and special place to relax and indu","useful":0,"cool":0},"sK-7fP6pd6EJ91LqG8lEKw":{"text":"I absolutely love this place! I have nothing bad to say except I wish they would stay open","useful":1,"cool":1},"FOj98ZcU72XQS75c8MVBSg":{"text":"We come here everytime we visit and it's always a great time. The whole ordering process i","useful":0,"cool":0},"ZEaZTMn5aij0ZOorysvNGg":{"text":"I came to thins place because I wanted to go to a new place for wine and cheese that was n","useful":3,"cool":2},"c_H8pZdBb-idNKu4RSkI_g":{"text":"Live music, wine and cheese! Pricing for the cheese/meat plates are very confusing so make","useful":1,"cool":0},"686u8Vw743AQvZSFefXOqg":{"text":"I took my boyfriend here as an anniversary gift while on a trip to New Orleans and it live","useful":0,"cool":0},"vAawUPHDb1XOsV-sOc2rMw":{"text":"I love this place! Such a cool vibe with live music and a wide variety of wine. You pick o","useful":0,"cool":0},"v-mu6yx00ls5pLzpjsa4vA":{"text":"If you want to see the back end of NOLA, i.e., where urban locals live and play, this is a","useful":0,"cool":0},"fGc0iv4jEeiNZBZ-Hi9WdA":{"text":"Goodness! I love Bacchanal.\n\nThis is the perfect place to gather with friends or a first t","useful":1,"cool":0},"4IIg185Mgpn0YkmjRlLFdw":{"text":"IDEAL SATURDAY=sipping wine & eating bacon wrapped dates stuffed with chorizo at the @bacc","useful":0,"cool":0},"jc8Ww2P2cS7bs062gaie_A":{"text":"Bacchanal's is hands down one of my favorite places to go when I'm in town. This place ser","useful":1,"cool":1},"UCplPX8_Gtx66jXJBJ2ITw":{"text":"Amazing venue.  Incredible wine selections and great bottles open by the glass.  Pick out ","useful":1,"cool":0},"zB1IEQV7qoaqiTwr-AqCzQ":{"text":"Steak and wine. Can't go wrong with those two things. Also add live music 7 nights a week ","useful":1,"cool":0},"wZ1h4iH0MZPBjUSFA4m2qg":{"text":"Don't judge a place by how the front of the building looks.  I was pleasantly surprised wh","useful":4,"cool":3},"cDCyshc9wCFkm4AZGyMojA":{"text":"Every person we met told us to check this establishment out-- and so glad we did! \nIt's lo","useful":0,"cool":0},"IeTyAglHoK3kqIhwDn-XSQ":{"text":"Well, this is my favorite place in all of New Orleans.  It's part wine shop, part backyard","useful":0,"cool":1},"asQBkRSY1wR0IJDV7-kZhw":{"text":"Really cute wine and cheese bar- you pick your own cheeses and they put together a plate w","useful":1,"cool":0},"cJubxVbOrCazUYUNl_tFWg":{"text":"My husband and I went on our second date here! I'd been a few times before and felt like t","useful":8,"cool":6},"7jAuNzhVKbI0N4tT9P7Q8w":{"text":"Cannot say enough about this place! \n\nCHILL AND ROMANTIC, AMAZING FOOD AND WINE\n\nGrab a bo","useful":1,"cool":0},"LMVKOHIAelkLsJFc5-RnNw":{"text":"I was a little out of my element initially and didn't quite figure out how it works at Bac","useful":0,"cool":0},"Y8eL7w_4EKpYL8dT1AoPFg":{"text":"This place was a great spot to enjoy a glass of wine accompanied by a plate of tasty snack","useful":0,"cool":0},"Yvi9mgWfJfhiwEiwW4J9xA":{"text":"Atmosphere was ideal. Amazing live music, sensual chill vibes. Service was subpar. 2/4 we ","useful":1,"cool":0},"g0Q4XXasv_ZKLyPrwEJ2xw":{"text":"I love the setup at Bacchanal-- pick your own cheese and wine at the shop, and then have i","useful":2,"cool":0},"0JBZ6bjHTeZ7-X04itLrSA":{"text":"I'm surprised by the review by \ndevon,short hills. I never had any issues with any of the ","useful":2,"cool":1},"xuR2UP90zDNrDhzkxHhapg":{"text":"This is one of my favorite places to go for a fun night with the girls! There is a quiet p","useful":1,"cool":0},"1hwlH2tjuaP7bk_peHTpTA":{"text":"It was the 2nd or 3rd day of our (semi-business) trip to New Orleans, and the drunken frat","useful":1,"cool":1},"IFoioZvuxqMcI_yJf01DXg":{"text":"Went here during  Mardi Gras. It's kinda in the middle of nowhere being the last street be","useful":1,"cool":0},"x--uxahK3Q9zipOaA1Rp6A":{"text":"What a fantastic place. The concept is amazing, the food is really good and the atmosphere","useful":0,"cool":0},"1Sj8MTphm52YHPcKVRUT6Q":{"text":"This ambiance here is so lovely. Got the steak frites and it was Devine with the lemon and","useful":0,"cool":0},"IDJ0G9muk6FlXeclw3JvwQ":{"text":"One of my favorite spots to hit for date night or a girls night out. Always great music pl","useful":0,"cool":0},"lqutPw8av8P33Vye1XLvkw":{"text":"LOVE everything about this gem - from drink selection to cheese selection and the outdoor ","useful":0,"cool":0},"_bzcJAfOKcDhrgYIoP6kEQ":{"text":"This is one of the most unique places I've been to. We went to Bacchanal our first evening","useful":0,"cool":0},"HDwzXYstwqyWbGIkSZrz1w":{"text":"What a great day to be at Bacchanal!  Our party of twelve trickled into Bacchanal in the e","useful":0,"cool":0},"5tsIHMod4cXkYnx8S7RLJg":{"text":"This place is soooo cool. Very low-key looking from the outside and you walk in and order ","useful":0,"cool":0},"f61x8t7pimf-crX7ebGkyA":{"text":"Love this place.  The shrimp was amazing, and the dark chocolate bark is a must.  We will ","useful":0,"cool":0},"HY37MqwPZp_NnegSG_qbsQ":{"text":"This a very odd, but enjoyable place to sit outside, drink well-priced wine, and listen to","useful":0,"cool":0},"YhC89j--i8vkG7x21Ohxtw":{"text":"This place has the feel of a secret, locals-only spot, and it may very well be one. Everyo","useful":2,"cool":1},"UHx9D3cDp-oguA4K6MybXQ":{"text":"This is a pretty sweet spot, like others have mentioned. We only did a cheese plate, which","useful":0,"cool":0},"KvALrE-LUemVKeBopnw8CQ":{"text":"Would have been five stars if it wasn't for the snooty condescension of the hipster bro be","useful":0,"cool":0},"t2BdC2QPzZf5vVOz7DR5nQ":{"text":"Unfortunately, the majority of my reviews for the past couple of weeks have began with, 'i","useful":11,"cool":5},"ekg1VjHAw9Flo6uyN1693w":{"text":"Phenomenal experience all around: excellent dinner and wine, keep live music, and lovely a","useful":0,"cool":0},"S5LEqxVtdt0aFtUNayPozg":{"text":"Bacchanal is my favorite spot for a chill wine night in New Orleans! Especially for a grou","useful":5,"cool":1},"kAUio_y9Cu7y893zRxJ54A":{"text":"This defines the Yelp classic description WOOHOO! As good as it gets! This was the first p","useful":6,"cool":4},"ecglpkUKDAbuLfUQG4f4Fw":{"text":"I've been in New Orleans three times recently  and each of the last three times I've been ","useful":0,"cool":0},"0CU68XFMfJbZeKipgrmFmg":{"text":"Bacchanal Wine is one of my new favorite spots in New Orleans! Some friends and I recently","useful":2,"cool":2},"_ubOfleePVhlVKPwiND8_Q":{"text":"This place is a must visit if you find yourself in the Bywater district.  Great wine selec","useful":1,"cool":1},"qKu9A9yBxhcWE4McsXVTGg":{"text":"Great vibes, bread and butter was so good lol. Live music and wine, what more could you as","useful":0,"cool":0},"J7uWkOMi0iguSOn1seC5gA":{"text":"If you're a wine and cheese enthusiast like me, then I highly recommend visiting Bacchanal","useful":7,"cool":3},"EoBQsqk8CAJpPz63rEBnXA":{"text":"Takes a while to get in, as others have noted (usually you'll be waiting about 20-40 minut","useful":2,"cool":0},"lJhyrVBPDAgrtl8c3JhtkQ":{"text":"Best wine & music venue I've been to. Great, unique operation. Large area. Cool concept wi","useful":0,"cool":0},"k1E31xb4HBUnOOk4I3SE8w":{"text":"Always a great place to visit when I come in for jazz fest. Love the ambiance. If u have n","useful":0,"cool":0},"aNpbQiGaaNeCKXv7_B5IwQ":{"text":"Wow, this place was amazing!! My friend who lives in NOLA told me I would love it, and she","useful":1,"cool":1},"K8szhxiS3N1hr2Pz0ozJ4A":{"text":"Outstanding! Excellent music, delicious cheese, perfect wines. Casual, affordable, high qu","useful":1,"cool":1},"qTppeezStGeGbX_SCn4YAQ":{"text":"Amazing amazing wine spot!\n\nEverything about this place is just so great. The wine, the am","useful":1,"cool":2},"FoiaPyVeRbUG5f69p-LBtQ":{"text":"\"Yay!\" I'm still a fan! BUT it's also the kind of place that acts militant about \"VEGAN\" o","useful":1,"cool":0},"uYhAghRgfJjyRyeVnD39EA":{"text":"A total diamond in the rough!  This place has the most phenomenal food. I went for a very ","useful":0,"cool":0},"XQRBOEHvjW3axzF9OspEOA":{"text":"My wife and I went here for our 6th anniversary and had a blast! Great recommendations of ","useful":0,"cool":1},"f4fCHS_syjhaFPlwob9-DA":{"text":"My favorite place to hang out with friends! Delicious food and awesome local bands! There ","useful":1,"cool":1},"p_sEzRQArfzFxhVHBp_dBg":{"text":"Not to brag, but a bit of a wine-o and the selection is good not great. The staff was rude","useful":2,"cool":0},"sVyqUiF4a3CeDtlw8FJONQ":{"text":"Stopped in for some wine as well as some off the beaten path hors d'oeuvres. The cheese se","useful":0,"cool":1},"-zmSvQZXy-LcOt4mgVA8-w":{"text":"A hidden gem... A local told us to come here. And I am glad we did... Located in Bacchanal","useful":35,"cool":38},"QnFV8AyN-iFqgBoEV4nXoQ":{"text":"Worth the Uber ride away from the tourist areas - welcoming and helpful service to show yo","useful":1,"cool":1},"UDhVe8fVrlTLERTr_VND5Q":{"text":"Really enjoyed this fun joint! Live music, wine and tasty food. Only reason I gave 4 inste","useful":0,"cool":0},"9FnF0lXROVR9AmzMF-EV8w":{"text":"I am so glad I spent a few hours relaxing in this magical little spot! We walked in just b","useful":0,"cool":1},"skJ6i90pOI3AgB2E__pi3A":{"text":"Way off the beaten path and a no gun zone. Young folks looked askance-at us seniors. Chees","useful":0,"cool":0},"-VmLo9laCWm-gl_kUVjqTQ":{"text":"Great spot, great ambience, fantastic wines and cheeses. A friend recommended it to us on ","useful":0,"cool":0},"XeC0RQqCWiDXUIvw6fJ-_Q":{"text":"A bit off the beaten path but it's totally worth the trip for the live music and backyard ","useful":0,"cool":0},"4pGe5pTeO--eYkDTuP7qMA":{"text":"I was reprimanded for sleeping at table. Disturbing the sleep such a crime! Pick your batt","useful":1,"cool":0},"q-L1iNHE-KpNfFbHV_afaA":{"text":"The atmosphere was excellent, musicians were great, and the cheese plate/food/red wine hea","useful":0,"cool":0},"ZrhPrDT8Uv-joNlayyuFIg":{"text":"Nice place for adults, but be warned: this is not a kid-friendly place.  It looks like a g","useful":0,"cool":0},"8YRXcRlPp0gj-IN1wt1xkw":{"text":"This is a fun find. Kind of hidden away and unless it had been recommended I would never h","useful":1,"cool":0},"CyTOZFSnUuuHHx2nLwgJtA":{"text":"Pros. \n\nAmazing setting\nDelicious food\nLive band\nDoor guys was really nice. \n\nCons.\n\nThree","useful":1,"cool":0},"06kN5SqnjLPtt_w4rOgb8w":{"text":"Got here too late to watch music but what a beautiful place! You can't miss a relaxed even","useful":1,"cool":1},"OMeQrbHQaQjuucPjNXULeA":{"text":"Bacchanal is one of my favorite places to take guests in town. It's magical. I get sad it'","useful":0,"cool":0},"G4Tj22c1PhMZ2vWNyFy36A":{"text":"More like a local place than a tourist location (which is good). The wine collection is de","useful":0,"cool":1},"vjqGDWUlSYa_7yx1Rc0Lbg":{"text":"Amazing atmosphere with great live music. So chill and relaxing on sunny day. Huge selecti","useful":0,"cool":0},"EUh6n698GecWfK5YDdZjSA":{"text":"Pretty awesome place to get together with friends. Wide variety of wines to choose from. L","useful":0,"cool":0},"HJNH5vn-n6-CDvw1upNrhw":{"text":"A + covid precautions. I was so happy to see how safe they are being with covid! \n- They h","useful":3,"cool":2},"GD_c-tdWBe5GI8SsgvBlDQ":{"text":"Wine selection is tremendous but the real hidden gem of this place is the cocktails from t","useful":0,"cool":0},"ftdH6bDI726OGLEdtzYucw":{"text":"Really great atmosphere!! Wine is great, cheese boards are amazing. Live jazz music. Bottl","useful":0,"cool":0},"0Dbsssk1o96C4K_i65scPw":{"text":"Great concept! Didn't know what to expect. The wine bar is situated across a scary, desola","useful":0,"cool":0},"UXuQnN1OlS0E1OXyjjVG-g":{"text":"Amazing.  Ambiance, wine, cheese, great live music, and delicious food -- perfection.\n\nLov","useful":0,"cool":0},"uCYmWzqy0x5_uUB-ruLhBA":{"text":"Hidden Gem In New Orleans which is a good thing because it's not crowded and comfortable e","useful":0,"cool":1},"sG7khuvWMfFtIJDgd7W6NQ":{"text":"Great outdoor seating, better than most on their selection of bottled wine, good food (som","useful":2,"cool":1},"aN8RLSBGTl8i9SzZ4LofOA":{"text":"Bacchanal Wine is great if you're looking for a low key place to hang out on a nice aftern","useful":1,"cool":0},"aOYJGhAMQXFCUJ9Jcry8mA":{"text":"This place is pure love. By far one of the best options in Nola, away from tourist traps o","useful":1,"cool":2},"ddQ_-p8OZx1O-QiEdyznkw":{"text":"We went on a Friday night around 5 ish and didn't really get the concept of the place. We ","useful":0,"cool":0},"Q5jfF9_vQt0IFwwgI-lL6g":{"text":"Wonderful wine. Wonderful food. Wonderful music. Wonderful ambiance. However be aware it's","useful":0,"cool":0},"jvdq8zFYrlQuUCR2C6DM0g":{"text":"This is the most amazing place to spend a few hours of the afternoon! My girlfriends and I","useful":0,"cool":0},"_IvYQ2mAqU6_rVmFhZ7jKQ":{"text":"Funky place, very hipster and laid back if that's what you're looking for I recommend it!","useful":0,"cool":1},"iJIx3Dcq9Nuv9EPjaBjsLA":{"text":"This is a hipster's paradise. Seriously. \n\nWe came here recently to celebrate a friend's u","useful":1,"cool":1},"Iibi8Qmo0ZUuuOnMRw5nzQ":{"text":"good. love the ambience. wish we could open up one in uptown or riverbend area. food was p","useful":0,"cool":0},"SDw1auoFccLUM-Ee5nRGRA":{"text":"Wow, I have never had service quite this terrible. \n\nI get that this is not a traditional ","useful":1,"cool":0},"lYdGsPQEr_3a3b4MAq8boQ":{"text":"A great oasis complete with great food, music, wine, spirit and atmosphere. If you are loo","useful":0,"cool":0},"NT5NmwG6zu9SoQ5fgfLRAw":{"text":"Sitting outside in late winter in the Marigny, enjoying live jazz at Bacchanal is what liv","useful":7,"cool":5},"eoNh6Hwj5rye8-hbxh1yLA":{"text":"First, can we just talk about the name Bacchanal? So perfect. I'm team Dionysus all the wa","useful":8,"cool":9},"_tB44hQr2sTHx8AV_gtlXQ":{"text":"Awesome concept, great space and live music. I was visiting Nola from San Francisco Bay Ar","useful":0,"cool":0},"FezoUy9etsGxVhnd66el9A":{"text":"Great spot that is always worth a visit when you're in New Orleans. I highly recommend.","useful":0,"cool":0},"dIy6xK8VYFel8Ze90szT0w":{"text":"This is my favorite place in town for a date night or a relaxed girls evening. Picking you","useful":0,"cool":0},"M6rooZeT9PI0IpHca07uzQ":{"text":"Very pretty patio, but it seemed like the band didn't play that long and service was a bit","useful":0,"cool":0},"rfwPN4wBN-YQfDJUbRUClA":{"text":"Absolute legend. my wife and I heard so much about this place from our friends here. When ","useful":1,"cool":1},"uuJgKxMQeHaJKidyHwz0zw":{"text":"Wine + Cheese + Outdoors + Live Music = one of my favorite New Orleans experiences. This p","useful":12,"cool":9},"BfV4RdkFNDE5E544q4ymXA":{"text":"Ladies and gents, if ya'll are going as group or alone at night, just be on guard as the l","useful":1,"cool":1},"JLw_XjSUU5OYpaf2lJz8OQ":{"text":"Highly unimpressed. Was looking forward to coming here for the first time with my parents ","useful":2,"cool":0},"ajDPz81n-cujC1DR6SLYHA":{"text":"Service with a sneer!!!\n\nGreat concept, nice atmosphere and okay food. A bit pricey and th","useful":2,"cool":0},"0HtTDXRXlVDeKbM7Jp8HDg":{"text":"Delightful except for the asshole bartender.  Great food, wine, atmosphere. Dude at bar, b","useful":0,"cool":0},"xrvCXJrESoUpu5agVe-tmQ":{"text":"Really like this place .Awesome music ,wine & cheese. Wine selection was pretty great and ","useful":0,"cool":0},"6TexnpKFh5sjqrjAjVpLww":{"text":"great food and music, great outdoor seating (april 2019)","useful":0,"cool":0},"qa-WLAobcrHgix7pAKNlzw":{"text":"So I've been here twice now and both times were terrific experiences. Live music with mult","useful":0,"cool":0},"KdpX27z8zj6LTi9eu9ekxg":{"text":"service: 3\nfood quality: 5\ndrink quality: 5\norder time: 5\naesthetics: 5\nnoise level: 5\nmen","useful":1,"cool":1},"FHqmGYx1vAN9BknJXcQLZw":{"text":"They have a really nice little wine shop down in the main floor where you can pick out a b","useful":0,"cool":0},"dS7P8BREIPcPC_WD14_jiQ":{"text":"This was a cool stop, and not far from where we were staying for Mardi Gras 2016. We were ","useful":2,"cool":1},"z6xg2XTJkDkVIFF-sgulBw":{"text":"Bacchanal is a great, authentically New Orleans spot. They have an excellent wine selectio","useful":0,"cool":0},"JNzP1p7zY3lKpnVMB4TN4w":{"text":"I cannot help but default to Bacchanal whenever I'm on the fence about whether or not I wa","useful":2,"cool":1},"5bPQ4aCbUw-0luogFekCow":{"text":"When you first walk in, you know you've entered wino heaven. Bottles cover the intimate ro","useful":0,"cool":0},"0_ZujSBK47hHBQJhzi1VQQ":{"text":"Wow!!! Amazed!!! Lost for words!! Spent 4 hours in this place and would do it again. If I ","useful":0,"cool":0},"Zeh3AVoAMaafresgBLlGsA":{"text":"Six of us went last night to Bacchanal and I cannot express enough how impressed I was wit","useful":0,"cool":1},"SokiMDYDM9Sg3fyKO_p0qg":{"text":"I love unconventional. I love innovation. I loved the music by Helen, but this business mo","useful":3,"cool":0},"b6yVdlyp2W8u55M4zCjHcA":{"text":"Such a cool spot! Definitely have to go when in New Orleans. Buy your own bottle and enjoy","useful":0,"cool":0},"wVyhhuwE7MdT_-oV_yDTmw":{"text":"This is one of my favorite places in New Orleans.  Located in the Bywater. Chill vibes, mu","useful":0,"cool":0},"mRYcycfcqVwKuak03vzOjw":{"text":"Love this place.\n\nI come here every Sunday that I can get off.  It's a great place to come","useful":1,"cool":1},"frxg7hinxSVV-4cbA7kBoQ":{"text":"One of my favorite outdoor spots in New Orleans! Best music and seriously one of the best ","useful":0,"cool":0},"cpFIBxJ8Yudpn_h2f45Ilw":{"text":"a place to chill outside the quarter. \nThe surrounding neighborhood is probably not somewh","useful":0,"cool":0},"Ez9mdGAkgA2E_Gvp2uyBig":{"text":"Totally unique experience and my taste buds are in heaven.  I will recommend this place to","useful":0,"cool":0},"p3ObafX3VNDiSYH_LDZEug":{"text":"This place is it. I can't think of anything better. A casual setting with bright wines, fl","useful":1,"cool":1},"4ueJf1HaC0eeWSmnqgU2Kg":{"text":"We're here all the time and we love it. I don't know what else to say other than I always ","useful":0,"cool":1},"LZ3-AAaMzb1j8rYP87Nk4g":{"text":"I've said it once and I'll say it again... \"wine and cheese, YES PLEASE\". Seriously, say i","useful":5,"cool":5},"aHt157Q1n56HXnrZRL5CPg":{"text":"A group of us came here on the recommendation of a local, who loves the food. We sat upsta","useful":2,"cool":0},"drDUt4v6lYDpmIcVQKTYOw":{"text":"This has to be one of my favorite places to go from any city. You get to select from an in","useful":0,"cool":0},"wddvrSvgqG6KJQ-OQiYKZQ":{"text":"Eeee! Love the vibe of this place. They have a huge wine selection, a full kitchen and you","useful":1,"cool":1},"7cXikWGHSLqmz7N0KQD8hQ":{"text":"This place was a recommendation from\nMy sister and I'm sooo glad we tried it while visitin","useful":2,"cool":2},"wKH00UIgb4pOK0IC42QRoA":{"text":"Greayt place for happy hour.  Enjoy outside and music. Selection of wine is great!!! Food ","useful":1,"cool":0},"fQyGGTooGiDSFhTEYGKLZg":{"text":"I really don't understand all the raving reviews. It was a cool spot to listen to music an","useful":1,"cool":0},"F5iuCB7JXRSX_roFQaWKaA":{"text":"This is the most impressed I've been with a restaurant in regards to covid precautions. Ba","useful":0,"cool":0},"ZA6r3wC2Uy-EDMf5kGToIg":{"text":"We weren't sure about stopping here on a rainy day but it was clearing up and they had liv","useful":0,"cool":0},"nEzu3HJAZKu40V0ISkHJRA":{"text":"I was taken here by a friend on a rainy night in the summer. It was practically empty, but","useful":0,"cool":0},"2oQBEeIF6j8oMYk19Fd50w":{"text":"This is really not where you expect a place like this to be.  The surrounding neighborhood","useful":0,"cool":0},"hnSEQFI8rTUEJqJUJkzAFQ":{"text":"One of my favorite places I've visited in NOLA. Great atmosphere. We came on a Tuesday nig","useful":1,"cool":0},"OO4h8ghLaOWwnKqIT1oLeA":{"text":"Treasure of a hidden gem tucked away at the end of the street. Very casual little wine sho","useful":0,"cool":0},"X_8_PAs80COHX0T8rej2Hg":{"text":"I love this place! It's the epitome of NOLA. Great service and great company. We had to ge","useful":4,"cool":3},"GdzFtUgFIRFFaGc6Jkwbww":{"text":"It was a cute place, the wine and charcuterie was good. The way their service is set up ri","useful":0,"cool":0},"bht50TynkrfuQcAdzLTckQ":{"text":"This tucked-away secret-garden kinda place was fantastic! I never would have found this ge","useful":1,"cool":1},"rfLPsggwIZ1Ls9egaOfWmA":{"text":"A cozy spot for live music, a variety of wines, and nice selection of cheeses located in t","useful":2,"cool":1},"UfCy76fuVL75pqSjp9t9pw":{"text":"I really loved this place. They have the best wine choices at great prices. Let's not forg","useful":0,"cool":0},"wqSDgB9LoYlyAqb5T53KBQ":{"text":"Covid.  I hate you.  I'm glad this place is back to no reservations...BUT...I dislike the ","useful":0,"cool":1},"HfGcgsLJ6US7d6QmL7kmgg":{"text":"This place was highly recommended by a friend so we dropped by in time for a jazz set arou","useful":5,"cool":2},"HHHYgaUqz5pj4_Op2FJiew":{"text":"Upon arriving we were a bit thrown off because it's in a quiet area with minimal lights. W","useful":0,"cool":0},"ErAQi3YWwglub4yWTwEUZw":{"text":"I'm going to lead upfront with a few tips/criticisms (this will be most useful to future v","useful":3,"cool":2},"wtKk7QdQ6U_Ys7yqq4kSvw":{"text":"The food there was yummy and well suited to sharing. The wine selection excellent. I'd cer","useful":1,"cool":0},"OOVIMbpaUmIjN6DSJGScOg":{"text":"This place is a hidden treasure, a gem, a glorious glowing getaway that feels like a vacat","useful":0,"cool":0},"B34MWpxpPnyMOIFA909QeA":{"text":"Oh, boy. Get a Lyft home from here. The happy hour at this place will lead you astray. $5 ","useful":3,"cool":3},"JlJES0fEhYnv--7puLNqHA":{"text":"Great atmosphere! The food is tasty too. The ordering system is a bit haphazard but you'll","useful":1,"cool":1},"fBlnsqwhz806vCZedbQNww":{"text":"We heard about the place from a bartender in Orlando and I'm so glad we checked it out! Su","useful":0,"cool":0},"aUqzf5l_0nSSywDqdDYV5Q":{"text":"We were pretty sure we were in the wrong part of town when we rolled up to Bacchanal. Need","useful":0,"cool":0},"TtkOiEhaTnzO7WE0fSovKg":{"text":"We had such a great date night here that I didn't even take out my phone once. Unfortunate","useful":1,"cool":2},"7ZPwF2bMi7M8rvpcl4HiEA":{"text":"There is no better place to spend an early Spring evening in New Orleans!\n\nA great selecti","useful":3,"cool":1},"dZVZw4R_SZMPe5ZxBs5Riw":{"text":"So fun, great atmosphere. Band was good, Nola jazz. Wonderful wine choices. Had watermelon","useful":2,"cool":2},"tDWET4S52JOl-UtQYoRSXA":{"text":"Delicious cocktails, creative and tasty food, live music, all combine to create a comforta","useful":0,"cool":0},"HtBm1ot4lc0Pk2v3kBt0Bw":{"text":"If a place like Bacchanal were to open in Charleston, I would be there every weekend. This","useful":0,"cool":1},"2M9LwKMM2eJkvDxIvlpRag":{"text":"Unique spot in Bywater area. We were recommended to go here by the homeowner of the Airbnb","useful":1,"cool":0},"yHONdUvMDxaRivVOb3icfQ":{"text":"Bliss.\n\nAbsolute bliss.\n\nThanks to Katie B's gushing recommendation - we joined her, Farra","useful":27,"cool":31},"kBxp4jyv8px-VE03Dyzlww":{"text":"My boyfriend's sister recommended we check Bacchanal out during our trip to New Orleans. W","useful":0,"cool":0},"NlSH_HzlJZcYx8qKQN-6VA":{"text":"Maybe we're just irrational and too demanding but this was one of the worst dining experie","useful":0,"cool":0},"BR6VzB_giVQaMs8DyWbXDA":{"text":"If ever there is a place that can be wrongly judge by its appearance it is this place Bacc","useful":14,"cool":12},"V9PYQN-xsyTp-YSPHkRTTQ":{"text":"It's quaint and quirky. If you don't pair your wine with plastic garden chairs and live mu","useful":0,"cool":0},"m-sReB1HBjstJQyQ_jS0xw":{"text":"We loved the outdoor setup with the tables and live music. The prices were relatively chea","useful":0,"cool":0},"Urp7dmLXpA0PyjwtZHJrog":{"text":"I love the concept of this place and that it's location is set apart from more popular are","useful":0,"cool":0},"-MiyhJp7SAJYYK9akthotQ":{"text":"GO HERE! I'm so glad we decided to take the 10 minute Uber ride from the French Quarter. T","useful":0,"cool":0},"vnlefRwavGy9QowO6xvucA":{"text":"Thank you Nola and the wonder staff, chefs, and customers at this amazing place. As enter,","useful":0,"cool":0},"09C_ZaSQP9l1htLfMuspTA":{"text":"Amazing food, unique set-up. A hipsters paradise far enough away from the madness of Bourb","useful":0,"cool":0},"0M8F8hgIxZdZD-xNwzlDBA":{"text":"I love this place. The food is fantastic and reasonably priced. You can get as much or as ","useful":0,"cool":1},"ZpfPOYNoH8BjQOOsWU9ZZw":{"text":"Meh. Too crowded. Maybe I got an off night. We were there on a Monday around 8. No place t","useful":0,"cool":0},"OWmSUJMsIyA516JbRdk75w":{"text":"Best meal we had in the city! The risotto and Patatas bravas were wildly good. Get in earl","useful":0,"cool":0},"rVXkuwpFgPo5sG19KIqTCA":{"text":"I'm a little torn on this review. The ambiance is perfect. Fabulous jazz. A lovely outdoor","useful":0,"cool":0},"_97CPiy1iMqmcdxRIbM5jA":{"text":"Bacchanal is something my boyfriend and I always look forward to on our trips to New Orlea","useful":1,"cool":0},"rNk9L2fBvFwM_lcF9t1aaw":{"text":"This is probably one of our favorite places in the city! Grab a great bottle of wine, some","useful":0,"cool":0},"9mAiuyLjVXCSq8NxzbCGkQ":{"text":"After countless trips to my favorite American culinary city, I search out at least one new","useful":20,"cool":16},"2w9Z8ReEq11IhcYjhRM8Ow":{"text":"Three stars for the excellent food .. unfortunately this is where it ends. While the indif","useful":0,"cool":0},"oo2LwCWkLANd3tit_Bylag":{"text":"What a cool place! Highly recommended from a good friend. Picked out a nice vino, couple o","useful":0,"cool":0},"4TAHGHto4jma-hv_bl-Y1g":{"text":"Great atmosphere, perfect place for a chill social gathering or a place to go after a date","useful":1,"cool":0},"OR3kY3AIaUqUsPr0Q5VuYQ":{"text":"A very pricey establishment in a low income neighborhood. The epitome of gentrification. T","useful":2,"cool":0},"c-DYNpfiWa1FPyHOrLRg6g":{"text":"Would've been 5 stars had the door guy not been a complete dick. There is a long line outs","useful":0,"cool":2},"Oxbm_AnDfp-7EYD2QrIlgA":{"text":"I'm really glad I read all the glowing reviews and ended up at Bacchanal! My friends and I","useful":10,"cool":10},"EpYvAs5EXXjDVHrGQHUZ2w":{"text":"The hubby and I checked out Bacchanal on our last day in NOLA and we felt it was really a ","useful":2,"cool":0},"xeY9Z00UVu-NTuZIPIAMNA":{"text":"Awesome, local, low key indoor/outdoor wine bar.\n\nAt the recommendation of one of the loca","useful":0,"cool":0},"piO7HUI-8wWUgxubKcAxDw":{"text":"Everything about Bacchanal was fun and fantastic. The service was great. Fun and funky.","useful":0,"cool":0},"b8lsrn4UcMndyArBGKVaXA":{"text":"Bacchanal is always a great choice in NOLA. It's far from tourist traps, yet close to down","useful":8,"cool":9},"TU_FlipZBJMHwSJmpOiFfw":{"text":"Bacchanal was everything that my fellow Yelpers promised! We were enjoying ourselves so mu","useful":0,"cool":1},"vAxQhjbRW6StlzpYhLbPNg":{"text":"Cool place definitely recommend.\n\nTips on tipping:\n1) Tip $1 per bottle of wine\n2) Tip $1 ","useful":1,"cool":0},"3-mvG60BEZPGZrC86tdDQQ":{"text":"Lovely place, hardly recommended.\nThe neighborhood around it is fantastic so charming and ","useful":0,"cool":0},"xJKEPtIkQeDnb0Qpbcvmkg":{"text":"One of my favorite places this trip.  Live music at noon, great food and a phenomenal sele","useful":1,"cool":0},"2GPdFZIe8zmjvA6-Xiryeg":{"text":"This is my second time going to Bacchanal. The first time, my group and I barely found sea","useful":0,"cool":0},"oEQ2__d6GF5-NRx2bCqv7w":{"text":"We came here on a Sunday afternoon. We knew that there was going to be quite a bit of peop","useful":0,"cool":0},"NUBhSxY5MxHg1Uz05Kt3iA":{"text":"This was an amazing find. From the outside, it's very unassuming; it just looks like a win","useful":1,"cool":1},"4sUYtkmwNsnmm74h3LE8gQ":{"text":"This place sucked from start to finish. When we walked in, no one greeted us to tell us ho","useful":0,"cool":0},"FqvoLd_QiWvbq8ElZAZJ2A":{"text":"This has to be one of the loveliest wine experiences I have ever had and I am completely i","useful":1,"cool":1},"6Lvj4RnjGCfss9iR-B36BA":{"text":"I love this concept so much and I wish they had something like this back in Southern Calif","useful":4,"cool":1},"v3vYFDhF40HS4KCZh2cyxw":{"text":"I was thoroughly disappointed in my experience at this location tonight. I had not been th","useful":0,"cool":0},"qfU7rzMRxc_OhTL7kxHjxg":{"text":"Five stars for the Band, the food, the atmosphere. Great beer here too. Park real close to","useful":0,"cool":0},"AaHxK4znfOoeNR3IwHlhtg":{"text":"As a longtime Bacchanal customer, this was my first adventure after (we all discussed and ","useful":1,"cool":1},"FlRRlRHxV1i4XGiigJsPdg":{"text":"This place came highly recommended. But the moment we asked for a cab rec and received a M","useful":1,"cool":0},"LItVl4TY_RhQqMxXlX5jTQ":{"text":"Great place if you like serving yourself. There's a line to get into the door then a line ","useful":0,"cool":0},"7-1vfkT7M28EtYtqCbZ99g":{"text":"Absolutely worth the trip to find this fun, affordable place! Phenomenal wine & cheese sel","useful":0,"cool":0},"glX-pxjuaVYfUXELojkRmA":{"text":"Bacchanal Wine and Spirits is a wine cellar with a kitchen that serves food and drinks. Th","useful":7,"cool":8},"1F72RyK0ug4dERPQnhvVcA":{"text":"Outdoors, wine, and cheese...need I say more?\n\nI love that you go in, pick out a bottle of","useful":1,"cool":1},"SFTt3zd0CSK6nM8patV0DA":{"text":"On a recent trip to NOLA I was tipped off to this gem. Boy am I glad for the tip. Not at a","useful":0,"cool":1},"v0WCm9lfExbzb2tvLVDOQg":{"text":"No idea why this star hasn't been added sooner. You can read my first review for tips on h","useful":20,"cool":13},"xjPbohVNwiFVaDRcm9QV-A":{"text":"\"THE PARIS OF THE SOUTH\", \" THE BIG EASY\"; are some of the terms that define NOLA. Bacchan","useful":7,"cool":2},"CyXHoonMXCk91BFSCYrAcA":{"text":"If you're in the mood for outdoor wine drinking, you can't do better than Bacchanal. It's ","useful":3,"cool":0},"RtghQAYKhTMO2Z7--xIxpw":{"text":"Bacchanal was my favorite dinner spot in NOLA this past weekend, although it was the most ","useful":2,"cool":1},"wwiEPrwtmrR3x_lX0dAPVw":{"text":"Bacchanal Wine is a wine shop that has a great courtyard with glasses and ice buckets for ","useful":0,"cool":0},"Tc2-boRMcv--i3GYphm4Xw":{"text":"I am LOOVVING this place. Easy backyard feel with wine and live music. I feel like Santana","useful":0,"cool":0},"O21wNMJjbvNhtMrOJW3xkw":{"text":"Bacchanal is a unique place. Unique in a good way. \n\nWhen I entered Bacchanal I was a litt","useful":9,"cool":6},"wjr3bjBhdR-GSr3baZcI8A":{"text":"Visited here at the recommendation of a friend whos a local and its in a quaint - upcoming","useful":1,"cool":1},"Uw3ptdwZ5StsunDzx037tQ":{"text":"Always a pleasure to be here! The pasta and steak were amazing, as was the cheese board. G","useful":0,"cool":0},"Kd6VclcSf4bFnfEmxI1T9A":{"text":"Amazing place!! You walk into the house and are greeted with a huge collection of wine. Yo","useful":0,"cool":0},"BEz1yv_FBtDKKRjDaSZLUg":{"text":"When you spend 8+ hours at a place without a care in the world and have the time of your l","useful":26,"cool":21},"q5W4ZkwVaJJ_Xp-jjm818A":{"text":"The food was really good (bacon-wrapped dates and cheese plate).  We made the mistake of n","useful":0,"cool":0},"es9GHqglc3ssRwicJPYAdw":{"text":"A very cool food experience. \n\nMy wife and I enjoy places that offer different way of serv","useful":1,"cool":1},"J9CoPutnEvNCMBBUiUSeXQ":{"text":"This place was MADE for me! Jazz, wine and charcuterie boards? And you can do it al Fresca","useful":1,"cool":0},"VghPA_9811TY6Zlv3WSwgw":{"text":"Fun place with cool vibes. Went during the day and it was a chill relaxed place, almost fe","useful":0,"cool":0},"8kkQSHN64z0A3EvDHa8oEA":{"text":"Never ate here, but the ambiance is everything. After 7 there's a jazz band. I'm not a win","useful":0,"cool":0},"I_YEeUtXJfbSAHeCupx2dg":{"text":"Fun atmosphere right outside the city center. Pick out your own wine, cheese, and meats to","useful":0,"cool":0},"1iiuGGxET3sFfjUw4LNHiw":{"text":"Look. If you like good priced wine, cheese plates, and hip music. Man, there is no better ","useful":0,"cool":0},"KysYLhk0vp3t26rnMqEoOQ":{"text":"Confirmed. It's my favorite place on the planet. Even on a Monday afternoon/evening, it's ","useful":19,"cool":19},"uS4HJlX96rmBXvyb847WFw":{"text":"If you're looking for a great wine selection & good music this is it. What I didn't like i","useful":3,"cool":1},"WgO-dVY3QaApwzM84_Xzvg":{"text":"Bacchanal is GREAT! I love the food, the ambiance, the music, and the wine! I do not like ","useful":3,"cool":2},"bOJEYydxzO9ltZCN1LZANA":{"text":"Nice back patio with live music, wide wine selection. Pleasant spot to spend a summer even","useful":0,"cool":0},"dPP9a3T-0zwpk9t-dwCtlg":{"text":"We came here on a Sunday evening around 6pm - there was no wait to get in. Yes it's nice t","useful":1,"cool":0},"GE9a4svc4ZMh4QF1R7vaEw":{"text":"I don't remember dying while I was in New Orleans, but I must have because I found myself ","useful":1,"cool":0},"jnGUCJ1yLTmeMDS_McsdaA":{"text":"This place was great! Beautiful backyard spot. Good food generally. Good cheese selection.","useful":0,"cool":0},"oDwd_7KknWBTWmnArVDQJQ":{"text":"This didn't disappoint! Great yard. Great upstairs. Great tapas. Great meat and cheese pla","useful":0,"cool":0},"juOwDM4vb6SKMxOEtNS0Vg":{"text":"Live band. Good wine selection at wine store prices. Experimental chefs with fusion flavor","useful":0,"cool":0},"CHrdLUyws_cgN2dMbR3_QA":{"text":"One of our favorite nights in NOLA . Fantastic music , ambiance , and cheese platter. Love","useful":0,"cool":0},"5xEyq5VU0ISurG_pykvHaA":{"text":"The crowd is cool, the patio is a perfect hangout and the wine selection is like whoa. Ord","useful":8,"cool":10},"kXBO6jmc0Nah5GYlqOPCxA":{"text":"I love, love, love Bacchanal. The owner/manager (not sure exactly who he is, but he's alwa","useful":0,"cool":0},"RV3djbL2XvIMTUa_iluxVw":{"text":"This was one of the best spots we went to while visiting New Orleans. You probably wont ru","useful":0,"cool":1},"U4-1Pom34vhXbhRe6ddurA":{"text":"Front door and downstairs cashier customer service was terrible. Very rude and condescendi","useful":0,"cool":0},"0478S0tMwscsduw8IkrSUA":{"text":"Everything about this place is amazing. This is one of those places your heart aches for. ","useful":0,"cool":0},"H8MUXsXO_pCZGrUNOJQzCg":{"text":"Great atmosphere, remarkable wine selection, nice cheese choices. Great way to spend sn ev","useful":0,"cool":0},"Csi7nnoa4Q1Etc1G2S2lvQ":{"text":"Went here with my girlfriend a few months ago. I forgot to write the review then, but the ","useful":1,"cool":0},"0vQaHQ2G1DQlRcxmmKkdkQ":{"text":"Terrible cocktails. Like the stuff you might find in a plastic cup at a random house party","useful":2,"cool":0},"5t3ugSCszQPnJulhrvuUEQ":{"text":"Omg!  I love this place! Pretty awesome atmosphere by the way. The bartenders are very nic","useful":3,"cool":2},"TPTDrLfHxe3OwBscbPRjvw":{"text":"Hidden gem in the Bywater!   This place is very cool. I heard that it started as a wine sh","useful":0,"cool":0},"KYeZDe37SU-qphx77Wykow":{"text":"Love the outside concept. Feels like been in your own backyard. The food is simple yet gre","useful":0,"cool":0},"sepbFSE-UuMKz7BnZaUWKw":{"text":"Came here on a Tuesday after dinner. The band was done playing by 10:30pm but we stayed an","useful":0,"cool":0},"GeJY1aIpaH0-PehpTbxT6g":{"text":"It's difficult to reconcile the positive reviews of Bacchanal here with the many encounter","useful":4,"cool":1},"Eje-BRoIZmwxl7u9NelVNw":{"text":"THIS MUST BE THE PLACE. The place to escape when you book a trip to NOLA not realizing it'","useful":11,"cool":8},"_WD8g-IhKbSKd7s839EMGA":{"text":"This is such a cool spot in the bywater district. You have to go through a kind of sketchy","useful":0,"cool":0},"bKxmch-YOSFWy791TfqYmg":{"text":"I can't talk about New Orleans without talking about Bacchanal. It is on every recommendat","useful":3,"cool":3},"mL7WwUT8m9B2s0uYKfTtrQ":{"text":"Excellent place for casual wine and shared plates. If some of the staff wasn't so horrible","useful":3,"cool":0},"K0HqpFL4XghGJWrC8nlaFg":{"text":"Bacon wrapped dates (so good), blueberry salad (omg so good), baratta/speck/mellon (baratt","useful":0,"cool":0},"Amo6Yuw6b0Q48OuEp30gTA":{"text":"I'm not sure which I know less about, jazz or wine, but what I do know is this is one of t","useful":2,"cool":2},"u0Wm2CSnCFeM_CpPXflGuA":{"text":"Friends of ours recommended Bacchanal as a must visit for a live jazz wine bar night. So w","useful":8,"cool":0},"p9VJEWtLvKd6MyGQvUeRDw":{"text":"Went here because it was featured on Treme. We get there and the person working the front ","useful":0,"cool":0},"Ohn0ZQtSrylcx44nk16U8g":{"text":"Bacchanal was a disappointment. We knew a bit of the shtick from reading about it - grab s","useful":2,"cool":1},"F7V0gorlxDWNb3Us75xEGw":{"text":"I wish the concept of this place was available in NYC! As other Yelpers have mentioned, Ba","useful":0,"cool":0},"RTjHbUd3gKViXyUVdzYfsQ":{"text":"Always a fun place with good music in a splendid setting. Romantic or just friends or just","useful":1,"cool":0},"1H_woqmm2m7237D9d29ymg":{"text":"Visiting New Orleans for a long weekend - I had heard that it was worth the trip to Bywate","useful":1,"cool":0},"ufD-HDsZ_WqNotcDJY39gg":{"text":"Not really a secret anymore, although it is a little far out from the very center in the F","useful":2,"cool":1},"czjbR9EYANIWjuNvC7jkeQ":{"text":"it's like being in Europe again. grab your wine, pick out some cheese and sit outside till","useful":0,"cool":0},"cbWNdyKfttbDu2JwJTNlXA":{"text":"5 stars for a truly unique experience in DIY dining - 3 stars for the food. \n\nYou create y","useful":0,"cool":0},"lPlGwD7WTYuMCmPBZHe2Nw":{"text":"When I walked in to Bacchanal, my first thought was, \"Hmm, this looks familiar.\" When I sp","useful":16,"cool":6},"fZE6kk-KQYLx72ZU-PtK0A":{"text":"This is only the second place I've eaten out since February, and I found the experience an","useful":0,"cool":0},"1zfF7P5vGVQBEU2CpwGZhA":{"text":"spend a night under the stars in a romantic comfy setting with great live music loud enoug","useful":0,"cool":1},"3Fio-73OdnyuVdFg76X08A":{"text":"Great wine, great food, great prices, great atmosphere, great music. It couldn't get any b","useful":0,"cool":0},"2I6W5XJEDiijtmaFOENkPw":{"text":"Just a perfect place. Gracious owner and staff, great ambiance, delicious cocktails, fanta","useful":0,"cool":0},"hZxUJKA4lG2UUSS1-R4ocw":{"text":"1. Come early to avoid lines.\n2. Buy a bottle of wine.\n3. Get a table in the courtyard.\n4.","useful":1,"cool":0},"Lhc7DVzDat9UOLW4rphv4A":{"text":"Amazing spot!  Great cheese, fantastic ambiance. I don't even like jazz and Steve Lands wa","useful":0,"cool":0},"DMg3JSMWA4oyHUYfy_o9bQ":{"text":"My sister said I HAD to visit Bacchanal Fine Wines on my first trip to Nola. So off we go ","useful":2,"cool":0},"rSF5BErHeWfTjuuiraDCjg":{"text":"My wife, who is 42 years old and I went there yesterday to have a drink. She realized that","useful":0,"cool":0},"Z0rtIRuaCpRlSneU1HrN3w":{"text":"Been a great spot to go for years. Wine, food and music. Pretty much everything you need t","useful":0,"cool":0},"uhIMul2aAAJ29ySjrteaoQ":{"text":"Love it!! We picked out our own cheese, meats and wine- found a a table outside, then kitc","useful":0,"cool":0},"kH6w1c1hnvPTmtI_lk2oaA":{"text":"DON'T order the RISOTTO! The place is lovely and will always be!! but OMG that risotto was","useful":1,"cool":0},"Ph9VLeShO-_Sw-zkqStUWw":{"text":"Nice place but really confusing of how to purchase food and wine - super crowded on a Frid","useful":0,"cool":0},"qQ2Uj0KikUFtS2pK1GFREA":{"text":"Located in the middle of nowhere, you have to take a 10$ cab from French Quarters to get t","useful":0,"cool":0},"CVW5zHXnCnwfPNbqYUJlLg":{"text":"The concept is great, the wine shop is amazing and cheese selection is great. I'd focus on","useful":0,"cool":0},"7TgXUWi0SyaUnWURFUzGRA":{"text":"Came here on our first night in New Orleans after a relative deluge of recommendations tha","useful":5,"cool":5},"_d5doT5hLCY0WExRW5vHcA":{"text":"This place is a treat. There's a whole open backyard with live music and amazing food and ","useful":0,"cool":0},"xpn9WcUCTiNMUBm1-gG2Xw":{"text":"I had a great dining experience here. And I had absolutely without a doubt the best French","useful":0,"cool":0},"8gaf6vVgAisKpnuKvkgY6Q":{"text":"So many people have been telling me to go here, and given all of the hype I was excited to","useful":2,"cool":1},"x1Cx79TzsFsq9NP3Rj_jnA":{"text":"Worst dining experience ever. Gentleman told me that i was holding the best value wine in ","useful":3,"cool":0},"BkVoz9GYJ2bi-pYx6WbiqA":{"text":"We had a true bacchanal at bacchanal. Awesome place, delicious wine and food, great music.","useful":1,"cool":0},"36kC63fJzz4xRHS-OeIwug":{"text":"My daughter and her boyfriend who live in New Orleans took us to Bacchanal late one night ","useful":1,"cool":0},"k4squi2QdjZgCsCCWe_6oA":{"text":"Hands down my favorite experience of NOLA.  DIY wine/cheese bar with live music?!  Can't a","useful":0,"cool":0},"Y-orGvKEUDGm1nzEXMhWKw":{"text":"This is one of those places I will miss most now that I am leaving New Orleans.  The atmos","useful":1,"cool":0},"xb0Pz6iFTNXgv9TW0ouRVQ":{"text":"This place has the perfect formula for a great date night: 1) Pick your wine; 2) Pick your","useful":2,"cool":1},"GN55OlGO3CW1UpEz85KYXw":{"text":"Highlights:\n-Great service and knowledge of wine collection\n-Outdoor patio with shade\n-Liv","useful":1,"cool":0},"04XIRWRvyNcKY8jFce9uUg":{"text":"My God, this might be one of the best bars I've been to. I hesitate to even call it a bar.","useful":2,"cool":0},"Jr_m2T9HHVRyXRXBABnWCg":{"text":"Such a great venue! Walk in, grab a bottle of wine from their very strong selection, sit o","useful":0,"cool":0},"UJaiuyKg1NszYjwkGFQTmA":{"text":"wowza. I couldn't make up a dreamier place for a nighttime hang out with a date or friends","useful":1,"cool":0},"-E3A1om1Dg_2uAPj6cndxw":{"text":"One of my faves in NOLA. In the Bywater (yes, get out of the Quarter). Take a cab, the nei","useful":0,"cool":0},"5_LbG-gfQrQeB4ZZhL4vww":{"text":"Delicious food! Lovely wine! Had a lovely cheese board with charcuterie, grilled corn, bac","useful":0,"cool":0},"skHJvJfJkxLacO0hU53GZw":{"text":"AWESOME!!!  Honestly this was one of my favorite experiences. When you walk in you choose ","useful":0,"cool":0},"fS1H7SUNYx8iVPAJSIxV0A":{"text":"When I first moved to New Orleans, I was told numerous times to head to this place and bef","useful":1,"cool":0},"FTh2VVo9z5Ja1mtmX1I8ew":{"text":"6 stars should be possible for places as special as this. Upon entering their back garden ","useful":3,"cool":1},"Ha9mN8RWZlX2c3uq7k3j4A":{"text":"Unmatched ambiance. There's a large backyard with scattered with patio tables, portable he","useful":3,"cool":1},"VDDh6ew9vpYLzmZcx_e6ZA":{"text":"Bacchanal is a wine & cheese shop with a fairly large added \"Heurige,\" which is an Austria","useful":40,"cool":24},"hfNZ_27mYmMDnjEIlynz3w":{"text":"I'm not a huge outdoorsy person, but I absolutely love the outdoor patio set up at Bacchan","useful":4,"cool":1},"V-qGOJ4bAG0It9NuTZxINg":{"text":"just moved to this section of town and everyone has been telling us to go here... so glad ","useful":0,"cool":0},"0iLJfYOAaYI1LIbOMz4VtA":{"text":"Three stars to Bacchanal for an awesome environment: a little out of the way (though in cl","useful":2,"cool":0},"Jh_6Ps3IP74eV7A53nrxIQ":{"text":"There are places in the city that I go to and love...and then they seem to fall off of my ","useful":8,"cool":4},"0bK3ONyYwe8-8wr-WjK_1g":{"text":"This is a great place to get your wine or beer fun on when it is nice outside as there is ","useful":6,"cool":6},"8QxIDHQP34qKKZIZryl0Zw":{"text":"Great ambiance and yummy tapas! Service was on point. We got there right when they opened ","useful":0,"cool":0},"5-b8zeacHJbZ72zXa8_T2A":{"text":"So nice I went twice on a one week trip! Spending time in the Bywater is like Mile Ex in M","useful":3,"cool":6},"f36uA6HWVqyZBqAhfpstjQ":{"text":"We never would have found Bacchanal without a true local who knows the best places to visi","useful":1,"cool":3},"1XQYDpElvZIXvPyA-fqGow":{"text":"Second time here...this one post pandemic.  Super venue to enjoy wine & good music!  Staff","useful":0,"cool":0},"oUWFbsHi3StIDi9RMJ2diA":{"text":"Great talented musician, a one man band....guitar voice harmonica all top notch entertaini","useful":1,"cool":1},"yntmT7RsTa7RHVxO-oBF3Q":{"text":"Could this place be any freakin' cooler?!? It's like a case study of how not to set up a r","useful":9,"cool":6},"i27M4kZnjgtTO7JJH7l9DA":{"text":"This is a great place for food, wine, and groups (if you get there early)\n\nPros: very larg","useful":2,"cool":1},"Eu-iCUqS3jYnXVWc-ajUUw":{"text":"Such a cool place. Live music. Huge wine selection and people to help you choose. You pick","useful":1,"cool":1},"x3RhIrKSQkEj03zIKT5tvg":{"text":"This is an absolute must! Our waiter from a different restaurant highly recommended it as ","useful":2,"cool":1},"xr69Et9EJ_ArUBnJdJrEeA":{"text":"I started coming to the Bacchanal in 2001 when it was a 200 ft sq place for wine and artis","useful":1,"cool":0},"I5jwAUH1lGcDc7Z4MitrGw":{"text":"Visited here at the recommendation of a friend whos a local and its in a quaint - upcoming","useful":1,"cool":0},"TXaTYPoeXAn5iZUf9V8D2A":{"text":"Highlights from a recent trip to New Orleans: \n- Brunch: Willa Jean or Ruby Slipper\n- Get ","useful":3,"cool":2},"pzHM042uBDG9ym9PBNvL-Q":{"text":"It's a cool idea. To go buy a bottle of wine and then go sit and drink it. I just wasn't i","useful":0,"cool":0},"kyLFKYLB9RL_3Pp1c8CA2g":{"text":"Filled with twinkling lights and amazing local musical talent, this casually magical jazz ","useful":2,"cool":4},"0wQoxUw_EjpZZ5W6-NKbew":{"text":"A friend and I stopped here for dinner after going to Jam NOLA. I love the Bacchanal court","useful":11,"cool":9},"dQ5LkEZCS0ZDFCMeSQODXQ":{"text":"So much fun! Stumbled on this place by accident while seeing it on the map when we were at","useful":2,"cool":2},"iqtW7cYc72Ic1HWMzjEq5g":{"text":"2nd visit, because we'd forgotten we'd visited before. Great wait staff (attentive & frien","useful":0,"cool":0},"J2rQaMgsbJ28fapGEkJwGQ":{"text":"We really wanted to love this place - the concept is great and people were with raved abou","useful":5,"cool":0},"sLlcIP4u3e0-k_-5RcQGpQ":{"text":"The drinks here are great but pricey and service can be slow. The food is not that great a","useful":3,"cool":1},"0Vka4D5JPGi7da51nnbzfg":{"text":"One of the coolest wine bars I've ever been to. Good food and drinks but the atmosphere an","useful":2,"cool":1},"SOpHRIVpOnTaw0vpmf4e5A":{"text":"Rose all day! As a regular visitor of NOLA, I've begun to seek music venues and eateries t","useful":4,"cool":7},"z2z0Z-ZuNWwwoallbn4cwA":{"text":"The concept of this place is similar to the Tchoup Yard, except with wine. Came here on a ","useful":4,"cool":0},"UPwaOIMXV-zhz6RZ015LlA":{"text":"I like wine.  I like cheese.  I like fancy food for super cheap.  Bacchanal is a place tha","useful":16,"cool":10},"bqrNpzR4C5rt6jY4A31Ryw":{"text":"I don't come often as I should but this is probably by far my favorite wine joint to go to","useful":2,"cool":3},"ieUalGPQoi11zIFScLja7Q":{"text":"This was a fantastic restaurant a little far from where we were staying so we had to take ","useful":2,"cool":2},"wITo9VUYYa_tas8CH0sGoQ":{"text":"Ok this is such a fun experience! Basically, you arrive and first go to the little charcut","useful":0,"cool":0},"h00grBXfvW1-IB6u0H_Zpg":{"text":"The staff are PRETENTIOUS as F@&k, bordering on rude! The food itself wasn't the issue. I ","useful":0,"cool":0},"q-nUor7Qky2eZYSRFmYgtw":{"text":"After reading rave reviews we expected alot and we got it. The time worn exterior betrays ","useful":0,"cool":0},"spmpxyAvBzuSMjF06OrhgQ":{"text":"Soooooo yeah!!!! I've suggested this place to others and had not actually been there mysel","useful":2,"cool":2},"EXLOBRftTbEkptH1h5rSBw":{"text":"I've been visiting Bacchanal every so often for the past 3+ years I've lived in NOLA. Pick","useful":2,"cool":1},"eKv3tMftAqREBcE8NHQptQ":{"text":"I may or may not be reeling from NOLA-nostalgia love, but I flipping love this place!  The","useful":3,"cool":1},"A0ebmVUVNDZBnYisY0NsZA":{"text":"This place is AMAZING!! They have a wide variety of unique and affordable ($20-75ish) bott","useful":2,"cool":2},"fi35fAUz6HpJ2XDKPZr1wg":{"text":"There's wine and it's whimsical! That is all you need to make for a top notch night out. I","useful":4,"cool":3},"U6RNHw1o5_pv-x5bbnmwQA":{"text":"Great environment away from the bustle of the French quarter! Pick your drinks and some ch","useful":0,"cool":0},"JaECxAo8MnOgQhR8QpSRIg":{"text":"Bacchanal is a super fun, unique wine bar! I have never been anywhere like it. It is locat","useful":0,"cool":0},"Y9j0OXLUAUW5Pd6SZxWjfw":{"text":"Beautiful spot! European vibes with amazing food and drink. They had a live bass and guita","useful":0,"cool":0},"KwlFoekH4oPwhYSD6y87Tg":{"text":"Finally got back to my favorite wine venue after a nearly two year hiatus.  Yes, it's chan","useful":31,"cool":26},"o6rsHGIu5ac74_cuQTcy-Q":{"text":"Met with with some friends here for music and drinks. First, staff was friendly while i wa","useful":1,"cool":0},"oQzzmBQtMdu53i_oxHE6pA":{"text":"Bacchanal. Lovely a year ago. Now, not so much. Being a wine establishment that has no exp","useful":1,"cool":0},"-MPXCPy8-AJIk1nI8Z68cA":{"text":"Very disappointed with our experience yesterday at Bacchanal. I used to live in New Orlean","useful":0,"cool":1},"4YF2LWjrIgtpPOUcV9uxaA":{"text":"I would LIVE in this place if I could.\n\nWho doesn't want to pick your own bottle of wine (","useful":5,"cool":1},"E9QK0ChM7A_BTfIlNoj9oQ":{"text":"I love Bacchanal.  It's a confusing system for newcomers so I'll explain it so you're not ","useful":18,"cool":9},"ylxLpuSmnWgceSmwXwUQJA":{"text":"I wonder if they sell their homemade pickled veggies & preserves.. better than I've ever h","useful":0,"cool":0},"x0B2ndnpSux_8dCSxqxM7g":{"text":"I haven't reviewed this place yet. And that just shows how much school sucks my soul away ","useful":2,"cool":1},"dVYZg3sNwgNpI0FoO9wrHw":{"text":"Darling little hidden gem in a town that was very different than I am used to dining in. T","useful":0,"cool":0},"MctAm9lwFlIgDJzQWu5ZSQ":{"text":"I'm so in love with this quaint jazz spot!!! They have a live jazz band that performs star","useful":2,"cool":1},"x61cIoT01K7tb1WjHKmETw":{"text":"This is definitely a unique venue. He went in line to get inside. You get inside the wine ","useful":1,"cool":0},"sZS9hTcIZd8sfplGE7c5lA":{"text":"An absolutely lovely place to spend a summer evening. The wines were reasonably priced, an","useful":3,"cool":2},"t7A-GcHLJjifHUAJL-6Rrw":{"text":"I've been coming to Bacchanal quite often since I moved to New Orleans a few years ago. It","useful":1,"cool":3},"rrXJ9Eux82kl7xm5YEUf2w":{"text":"Beautiful venue. Incredible live music. Staple for me when visiting New Orleans. Romantic ","useful":0,"cool":0},"zau0ouOUNu2zo76R-qGI3w":{"text":"Funky little unassuming corner joint that opens up into a courtyard with a mini stage for ","useful":1,"cool":1},"k6r_P-a7M8uR5qHE2N7KTA":{"text":"Wonderful neighborhood restaurant, wine bar, social place. Love the patio the live music t","useful":0,"cool":0},"oIhAvWQ3whqZdZE4a9FYZg":{"text":"A wonderful, eclectic wine and live music venue, even by NOLA standards!  Take an old hous","useful":0,"cool":0},"OYRfWHupq-gpmc5o06yvgQ":{"text":"Don't waste your time. Weird entrance policy and inhospitable staff who are definitely not","useful":0,"cool":0},"Fnmln3xHQYAf6HsHXN4SXQ":{"text":"Have had the pleasure of hanging out at Bacchanal on multiple trips before I moved here an","useful":22,"cool":18},"JpogkcRVIunVdsyKfEMxCg":{"text":"We rented an Air Bnb in walking distance from this wine bar. We searched for the closest p","useful":3,"cool":1},"GEcsJ2jyAVgpdGhT1Hrdrw":{"text":"I'd read up on this bar/music venue and it had great reviews. Very cool space with a lower","useful":4,"cool":1},"5W9gRcMm985BcbCutSQ-rw":{"text":"This was easily one of my favorite (if not my favorite) hangout in NOLA. This is a restaur","useful":2,"cool":1},"Lo5s4fON0dk5GyqcGWEzLQ":{"text":"Had some great wines here, especially internationally and the first place in the Gulf Coas","useful":1,"cool":0},"pK7kcGKKog9hkZDCyA-Cjw":{"text":"If you're visiting New Orleans, make sure to stop in.\nIf you live in New Orleans, congratu","useful":2,"cool":2},"KDTFN4qqQjb7B92kbz9f-A":{"text":"Another 5* review for this amazing place. First off, even if you're not staying in Marigny","useful":1,"cool":1},"LSPEFNFyeHdxvwyVZJMXGQ":{"text":"I've been here a couple times. Their service has been amazing, casual yet classic. They ha","useful":0,"cool":0},"wQYLVp0Q8rdpbB8LndSjsQ":{"text":"Wow!  I had such an awesome time here on my birthday.  We ordered a charcuterie board firs","useful":1,"cool":0},"zQxeqGZ7XAqUqq_xFLQgrw":{"text":"I like this place - it is eclectic and drWs an entirely different crowd every night.  One ","useful":3,"cool":1},"y0rD_Ede7LqnzUVha3P73w":{"text":"This is a great spot if you can find a table. Good wine, food, cheese, and music. It gets ","useful":1,"cool":1},"HdlNCjAyPixbXGXIdGlWgA":{"text":"Nola darling. This place is so cute. It's giving Nola darling meets solange while playing ","useful":0,"cool":0},"viMifnORX2vyBxMCzuiMtA":{"text":"I want to live here.\n\nCheese and charcuterie plates, gulf shrimp, and bottles and bottles ","useful":0,"cool":0},"cMCHpG0mrdLMoaR7ccC19w":{"text":"This wine bar was wonderful. Loved the picnic like ambiance and the surplus of options for","useful":0,"cool":1},"fbAFcxyRMTn-HvmF4YS4ww":{"text":"3.5 stars. This is a review about a visit during Covid. \n\nI came here for a light dinner o","useful":3,"cool":0},"MgJDA6dOm17bAZbmbpwqEw":{"text":"Ahhh I long for spring evenings, long summer nights and beak fall evenings so I can have a","useful":14,"cool":10},"pLCfIX-cbqSxIUsc6IZk8w":{"text":"I've fallen in love. And it's with Bacchanal. This place was so amazing, we took an Uber h","useful":0,"cool":0},"wc035N4WlSBeTgC-oqwtzQ":{"text":"This is a very casual place to hang out on Sunday afternoon. The music by Raphael Bas was ","useful":1,"cool":0},"2u67hX--nQi18t_zuMUCuw":{"text":"Nestled on the corner near the river, across from a dilapidated industrial building you'll","useful":1,"cool":0},"46xlWXRB8F8Zh7mBWXe1Wg":{"text":"We could not have expected a better night or whether to visit this incredible place. Not e","useful":0,"cool":0},"w7ljSYUIBZQNgNI41yxR-g":{"text":"The food can really miss the mark on busy nights, but if you get there early enough and th","useful":0,"cool":0},"peNaVEMOQlh_ZsDvhDywXg":{"text":"Fat bartender with short blonde hair was really mean and angry.  I honestly asked her for ","useful":2,"cool":0},"5boHo_wLJ91BDcMPbgDcHg":{"text":"Very good spot with plenty of outdoor space. The wine list is SUPER extensive. Love that a","useful":7,"cool":5},"JBMEndSIJyLIdBdXOPVraQ":{"text":"I came to the space to celebrate something with a friend and was really pleasantly surpris","useful":1,"cool":0},"HSbuqVy5VYe1np7SwEbl9g":{"text":"Hands down one the best wine spot in the city. Anyone who knows me knows I'm always down f","useful":4,"cool":2},"icju4tPOTaIaG4ZFDgSjPQ":{"text":"Bacchanal is my favorite place in NOLA hands down. Delicious small plates, cheese/meat pla","useful":1,"cool":1},"nmvcpEQb34R6EsvcDbA-bg":{"text":"Heard lots of recommendations to check this out while I'm in NOLA for the weekend. I was i","useful":1,"cool":0},"Vw_UGDrXrUbAtoyYZXr6vA":{"text":"Bacchanal was one of my favorite spots when visiting New Orleans. You initially walk into ","useful":3,"cool":1},"JgblFYHdvOXr5Rpa2iFE6Q":{"text":"One of the best date spots in the city featuring a huge wine selection and a great kitchen","useful":4,"cool":4},"v_NH6aBT7AUJBoDghp2aYg":{"text":"Amazing date night spot in Bywater that reminds me why I love the city - the charm, hospit","useful":0,"cool":0},"y5WF-BSgsj8xjkuRtxtksw":{"text":"Although I miss what it was in the beginning, I also love what it's become. Cheers to Bacc","useful":4,"cool":4},"1M0sUUlAEADQ8vNbQzskSQ":{"text":"I have mixed feelings about this place. The layout is so confusing and none of the servers","useful":0,"cool":0},"46t8s70T5GDKxP4YBOjvHA":{"text":"What an unexpected and lovely find in the ByWater area of New Orleans. Situated on the cor","useful":1,"cool":0},"I7h4gAH_c7jmpc-_jqd8jA":{"text":"Great spot for wine, music & conversation. The inside/upstairs bar gives those who need sp","useful":3,"cool":1},"YrP1slYb-FVEpW0SW5u_PA":{"text":"I hardly ever leave bad reviews but this place really beyond the pale or maybe pail(like i","useful":0,"cool":0},"u7GdJqEa2gX1Jn_TzezOMA":{"text":"Absolute legend. my wife and I heard so much about this place from our friends here. When ","useful":0,"cool":1},"LtWHRByAUnUmsuYp1gWn0g":{"text":"Thanks Morgan for this tip!!!\n\nLoved my visit.  This is a \"locals\" place for sure and a bi","useful":1,"cool":0},"M3soP2uYtbOVqkJaDoNAqQ":{"text":"This place is such a gem for the locals! \n\nThe vibe is laid back, the patio is amazing and","useful":1,"cool":3},"7kSu0pEpid22xXAhB25cqg":{"text":"This place is amazing. We came here on recommendation from a friend, and we were planning ","useful":1,"cool":1},"ZOtUnAZ7bbApdvayPiUNkA":{"text":"A really neat spot! What a fun way to spend an evening. We stood at the upstairs bar and h","useful":1,"cool":1},"AP7sVoLTf-f4U8oJDp3KVw":{"text":"Excellent music, perfect atmosphere, delicious food! Equals amazing time ! Such a unique s","useful":2,"cool":1},"R3bwgkHaxTHOKujWt3IPWA":{"text":"This is a GREAT find in the Bywater.  Great wine, vibrant culture, good snacky-food.  I lo","useful":1,"cool":0},"VOcgmDj6RP7UwNwOG42JsQ":{"text":"I went in the shop for a bottle of wine and asked for something in a particular price rang","useful":2,"cool":0},"3G2HAeqYSSniRfAPf7IFZw":{"text":"It is a mullet.  Do not let the area shine you.  Trust those who've been.  Best and most r","useful":0,"cool":0},"xoh6mM9KF2BiLggt83KVnw":{"text":"A great, unique experience.  Good is for foodies and not your average tourist.  Live music","useful":0,"cool":0},"1e7v7CmENIvoxtcAu93Veg":{"text":"I wish  we had more places in SF like this one. If tis was in SF, there would be more hips","useful":2,"cool":0},"JUOn38awovgpEBFYGtEY2w":{"text":"Dining at Bacchanal is a unique experience, equally grounded in fine dining, traditional S","useful":2,"cool":2},"iAn_zPYPo_bFUVN4nlBspw":{"text":"The bywater is where it's at. I want to live here one day.\n\nI came to Bacchanal for a frie","useful":2,"cool":2},"FdpxqUNktc_wN7grBc0b_g":{"text":"The only place in New Orleans that I didn't like.\n\nWalked in with my dad and asked for a t","useful":2,"cool":0},"SvV6SyOwkRbHfEtK9Fk1wA":{"text":"One of those moments where you sip from your glass and think that life cannot get any bett","useful":0,"cool":0},"Ghjnhbr5mZMtcsYdZoP_fQ":{"text":"Off the tourist path (I don't count as such anymore as I have been awarded \"honorary New O","useful":1,"cool":2},"mgyKpBB_72VasaV1tRBg8A":{"text":"This is my favorite spot in New Orleans and I've tried dozens upon dozens. I've been here ","useful":0,"cool":0},"JbnEd0LxeAFEfExCq_Zxgw":{"text":"Favorite place in NOLA hands down. Kitchen is excellent. The staff is well informed about ","useful":0,"cool":0},"h1Iam4J2dXK-GrrCdfjy5Q":{"text":"LOVE LOVE LOVE!\n\nThis was one of my favorite places in NOLA! \n\nYou walk in and there's a w","useful":5,"cool":5},"dj2gs_Sr3V7utSVkNRyvCA":{"text":"Yup, this place is pretty damn awesome. \n\nEven if you don't care for wine, Bacchanal is a ","useful":2,"cool":1},"LwqEO0ECRlKgqch79efi0w":{"text":"DO NOT SPEND YOUR TIME NOR MONEY HERE. Worst ever. With a group of 11 we spent over $350 w","useful":0,"cool":0},"KoVkQ5Ly5eS1IjgaOorutQ":{"text":"Came here on a rainy day during happy hour for a glass of wine. Though it definitely wasn'","useful":0,"cool":0},"_uwyTYDK905JqxuY2dvKuw":{"text":"This place is fantastic! The location is great and fun and totally hip, I felt like a loca","useful":1,"cool":0},"DDlMpwq59y6Uv54rh4AvTQ":{"text":"A great place, off the beaten path in the Bywater area of NOLA. Chef designed menus, using","useful":0,"cool":1},"zmFwa8oiRV9K1fuO1Tb58g":{"text":"Doesn't get too much better than Bacchanal. Walk in the front door into their wine cellar ","useful":1,"cool":0},"Ap0ogHn8qKcEDsOOQmgcHw":{"text":"One of the best places in New Orleans hands-down. The live music is awesome and the two-st","useful":0,"cool":1},"TQ11l5AHQMzfZxeFCAK16g":{"text":"This place clearly doesn't need any more stellar reviews. When we arrived on a Friday earl","useful":0,"cool":0},"0LG_K5vRX4U0yzt5xYrcFg":{"text":"Was sadly disappointed in this place...\n\nSo, love the concept, love the environment, but h","useful":1,"cool":0},"pMoMxDEOvDcZDeaSrxo_yw":{"text":"Sitting outside listening to great live music in the early afternoon. The cauliflower is d","useful":0,"cool":0},"Cm6obzmaGV4YRsSiMviA6g":{"text":"The concept was so cute and different. This location is listed online as a  liquor store b","useful":3,"cool":3},"CO4bYzxG6gwKP_c7SxUkAg":{"text":"Bacchanal truly topped my list for my weekend in New Orleans. I so wish I could visit them","useful":3,"cool":1},"xJ8rLytlN2vtY9RXs1-Q8w":{"text":"This is a great place that you most certainly would never stumble upon accidentally. It is","useful":8,"cool":6},"WKnn4qRMhzfSvMEclHXTqg":{"text":"This is an amazing place to grab dinner, do a date or just enjoy your friends' company and","useful":1,"cool":1}}