{"V0KSw7vmi1WlmSE09hgqWw":{"text":"They are very generous with the samples, you can almost just get samples and leave. We did","useful":0,"cool":0},"TBVCMM7DqJWd-zy7AFOnqA":{"text":"Maybe I'm going to be the naysayer here, but I find Sucre to be a little overrated. The ge","useful":1,"cool":0},"-a5QaBnG5rqho8Iz4DqmEg":{"text":"4 stars for great customer service, ample samples, and delicious macaroons. Loved the salt","useful":0,"cool":0},"Qx-grYjTOqIHeuy3lQajaQ":{"text":"I'm so glad this isn't in Seattle otherwise I would never stand a chance at being thin!  S","useful":0,"cool":0},"zCLVDjBVFVrZ2zdkgJEyGw":{"text":"Went in today finally after passing several times. The white chocolate bread pudding was a","useful":0,"cool":0},"JIS4KDBC5gJsCO0GndrmgA":{"text":"Best dessert and espresso anywhere!!  So many pastry/dessert choices. So many gelato flavo","useful":0,"cool":0},"uJEdoIdRPaxC6aye_2povg":{"text":"They would get a 4 for the quality/taste of the gelato, but the attitude that came with th","useful":0,"cool":0},"RTVaue4aMtEAPEjSfBzd_g":{"text":"Macaroons to die for - melt in your mouth, very well made, best I've ever had !!!!! Very d","useful":0,"cool":0},"wvOZoZtDFyxYFvevyLeCyw":{"text":"Recently visited NOLA for the first time and had to check this place out.  The store is re","useful":0,"cool":0},"jAhdVA6v07fXg1gUeoXPvQ":{"text":"The king cakes are beautifully glazed like fine china. Seriously, did not want to eat it b","useful":0,"cool":0},"CYdsTpx0X4nfieU0x4_wuw":{"text":"I will definitely be coming back to this amazing palace of sweetness!! The white chocolate","useful":1,"cool":1},"8mLosoaWS9T6kxqHFo7S2A":{"text":"I love sucré and will visit every time I'm in NOLA. Their macaron are always delicious. Ha","useful":0,"cool":0},"vi4_bXTxIA8NuXfgkicLGA":{"text":"I would have to say my first time here was good. Very clean & modern. I'm  very surprised ","useful":1,"cool":0},"JAnBE65fuiB2M45Ru_SCOw":{"text":"Not the best place for dessert....I'd rather save the couple bucks and go to creole creame","useful":0,"cool":0},"CtV5r8NwVL0Jx0sps7dtWQ":{"text":"Very cute and colorful dessert shop on Magazine St. They have a more convenient outpost fo","useful":0,"cool":0},"keiUNqqAg0hiTMzhVfFDHw":{"text":"Everything in this place is almost to pretty to eat...ALMOST. The strawberry cheesecake ge","useful":1,"cool":0},"MQ9YNMHcjXqziArwZivy0A":{"text":"We were on a trip to New Orleans and looking for places to visit. And luckily we found thi","useful":0,"cool":0},"XL_oNkWq5SyfC4uW81553Q":{"text":"Lot of hype & not sure why.  Not high on my list to go back.  Had a red velvet with chocol","useful":5,"cool":1},"ZZPXbUZUJ1FM-gEtaABYZQ":{"text":"I have come here several times with my kids. They are , well, we are , really big fans of ","useful":2,"cool":1},"2feq4LJUvGlGzKbnfEppgQ":{"text":"The first thing you notice about Sucre is the decor: so cute and sweet that your teeth wil","useful":1,"cool":1},"5rQD1bWVHMoc575tq0Jx7g":{"text":"Normally I avoid... \"Trendy\" places like this but I was intrigued by the offerings and the","useful":0,"cool":0},"YBynRBPHvXEDLEP0hmcImA":{"text":"There used to be a little green box full of Sucre caramels w/sea salt on that table over t","useful":1,"cool":0},"VDpRbP5-Clwt8rgKQ2Zo1A":{"text":"Here from California and decided to walk the one and a half miles to give it a try. It was","useful":0,"cool":0},"LwclAjmDpkjmGljGxT-WyQ":{"text":"Don't judge a book by it's cover . It's a really cute shop gelato chocolat drops macarons ","useful":0,"cool":0},"BB1y-v0lryVvgvIQOhJOjg":{"text":"Some things just defy explanation... \n\nAfter a couple of unimpressive visits to the Metair","useful":4,"cool":2},"CJjVSJW-IbJR10ebZcOxmw":{"text":"Beautiful packaging and presentation/plating of desserts, great friendly service (perhaps ","useful":1,"cool":0},"RIMSkufa8OhOUaD35Tvamw":{"text":"Sucre has great coffee. Great coffee, in fact. It is dark and full of flavor. The pastries","useful":12,"cool":7},"PvYiTMGACSv79Khvu8Yuvg":{"text":"Im addicted to this place everything is super yummy. From the gelato to the cupcakes to th","useful":0,"cool":0},"G-FLNgrnO9YejU_mQLvgFQ":{"text":"Went to Sucre yesterday to purchase a birthday cupcake for my very discerning employer. Be","useful":3,"cool":2},"c4oqHCSuQKbGNROdjdJtYg":{"text":"I did not think I cared for macaroons.  Then as I was checking out the amazing selection t","useful":0,"cool":0},"LTydBlfJcu1uwi8-TDEXIQ":{"text":"Like this place! Cute decor. Service was okay, but not as great as I would expect from a p","useful":0,"cool":0},"pLp8VuzDaacapa8es9frDA":{"text":"I have to change my review on this one. I've been here every time I come to New Orleans an","useful":1,"cool":0},"C6uQ9j8xCw2O2NWFPZp3Ig":{"text":"Everyone here is so enthusiastic and willing to help you figure out what you want! There a","useful":0,"cool":1},"wMePgLU9cxX5lDIL7zILeQ":{"text":"So I have an obsession with macarons and this place actually makes pretty good macarons! I","useful":0,"cool":0},"MzzfyjP6wSuOuCRvixkW9w":{"text":"The prices are Ok but flavors are \"meh\": cafe au lait tastes a bit too bitter and strangel","useful":0,"cool":0},"UCQiC2OKjiFbGhLYqgjSqA":{"text":"Sweets go glam at this NOLA dessertery. \n\nIn my quest for chocolate eclair indulgence, a b","useful":2,"cool":1},"xdXiME8AWU2949hM15A27g":{"text":"I wish my cupcake had more cake. What cake there was, was awesome. Tender and vanilla. But","useful":2,"cool":0},"euY3LkS2aqkCZmUBJgf7Hg":{"text":"Suggestions: Everything really was outstanding and we didn't have a particular \"favorite\",","useful":0,"cool":0},"2hxBvDSoxX3Q82vOK-BDIg":{"text":"Oh my! The strawberry lemonade torte was amazing, as well as macaroons & gelato! Try the c","useful":0,"cool":0},"JcmUMXV6JZu59RP_cwGIGQ":{"text":"PROS:  Awesome place to cure your sweet tooth.  Gelato, cupcakes, fine chocolates and maca","useful":1,"cool":0},"Ajr5K_vNKzvl8C20y6DK4A":{"text":"This place made me feel like a kid in a candy store. The cupcakes, the chocolates, the mac","useful":0,"cool":0},"vr0c381NXzE-7uFUvJsfQQ":{"text":"This place is so adorable. They have a variety of sweets to choose from: macarons, chocola","useful":0,"cool":0},"22ng1BdsI7d1FOEkkdAwqg":{"text":"I'm usually not a chocolate dessert lover, but, Good Lord, get Sucre's s'mores skillet des","useful":6,"cool":6},"N0vhEIY_P78E-HKXI0fm7g":{"text":"Ok, if you like super sweet deserts, this is the place for you.  I tried the gelato (wow -","useful":0,"cool":0},"3sx9aHqcWzmwB2Qoyz_ubg":{"text":"Sucre, located on Magazine Street is an adult Candyland. This whimsical sweet shop has the","useful":1,"cool":0},"6-I7-z8Jsq3UCo_10012AA":{"text":"I had several of their beautiful desserts and cupcakes and they were amazing. I also had p","useful":0,"cool":0},"8QxmePU6VLkZm7c7_aXlrA":{"text":"Ordered $80 worth of King Cakes overnighted for Mardi Gras party. They were dry and had NO","useful":0,"cool":0},"RtemVAk-CS3z4aFtSvCDVQ":{"text":"The macaroons are amazing. We bought a package of 8 with different flavours. The chocolate","useful":0,"cool":0},"x9ifCUMwufu6RCvh6fE2jQ":{"text":"I have to visit this sucre every time I come in to town. The macarons are incredible and t","useful":0,"cool":0},"2GtXnO1f8b_RMqiD3k5j_A":{"text":"I don't know how you can't love Sucre. Maybe if you are without a soul?\nHonestly, in the m","useful":2,"cool":1},"sRnkHyPBw4IJ7A1m5dot8w":{"text":"The brownie sundae is probably the best dessert I've ever had in New Orleans. If you've ne","useful":0,"cool":0},"KBZCqTc3pa-TlgldNvY5QQ":{"text":"Friendly staff, with a relaxed atmosphere. This dessert shop has some amazing treats for a","useful":0,"cool":0},"1m1aGFFi2BsSu6-rXlXsQQ":{"text":"(English)\nI have been here every time I come to New Orleans, the sweets vary between choco","useful":0,"cool":0},"HPGehhQziGY8U-G76jQhow":{"text":"Whoa!  The macaron cake that they made for a party I hosted was out of this world!!!! It w","useful":2,"cool":2},"7IrmIVYeu0W3DXtlJsKT8g":{"text":"Silly that two girls who don't eat sugar as a rule, would even come in here. We had heard ","useful":1,"cool":0},"3i6_6th7CzikQfsopKOeQg":{"text":"COME TRY THEIR MACAROONS. They are so soft and fluffy and delicious. I dare say even bette","useful":0,"cool":0},"wSmn5-jCZU4U7X3dQ3drqw":{"text":"Every once in a while, you find yourself in love with a certain sweet or food.\n\nWell, my l","useful":0,"cool":0},"RpN7_AspegjlzDzQJAn5Zw":{"text":"Literally the best place to go for gelato! They have a wide variety of flavors to meet eve","useful":2,"cool":1},"EbZJ8G5fcZrGtjuYDIDZdQ":{"text":"I'll admit it- I'm a HUGE fan of Sucre... \nThe gelato is incredibly refreshing on a hot su","useful":0,"cool":0},"EKbb8iZtBiHe61u3x6zW7g":{"text":"Got the cookies and cream gelato and it was delicious!! Wish I had known it was going to b","useful":1,"cool":1},"BMHhZ7vv3rgHF5YMBEEMCg":{"text":"Stratciatella americano . Ok\n\nCoconut basil. Good if you like coconut \n\nPistachio . Very G","useful":0,"cool":0},"QdvB4zWB_QwF4Te8r8_JKw":{"text":"Good Lord this place is delicious! Great little shop full of tasty works of art!","useful":0,"cool":0},"TfuCYU-vmwWN83BlFq6uHA":{"text":"Clean and inviting atmosphere. Good gelato and the staff was friendly and helpful. Much be","useful":0,"cool":0},"JehiCasar_nlNdYqdm99sQ":{"text":"The deserts are good. Came on a Saturday night and the server was EXTREMELY rude. We live ","useful":0,"cool":0},"C6wSHjjdIQx2XXrOXWlGow":{"text":"A great sweets show off Magazine Street.  Didn't get to try their chocolates or their gela","useful":1,"cool":2},"-B5I6cgTuWOlzlBxYq6ySA":{"text":"I have yet to to patronize any establishment with the a friendlier staff! Go here if you n","useful":0,"cool":0},"fDTOoAjoGIsrgPb--VSzlQ":{"text":"Cute, charming atmosphere and friendly service!  We highly recommend the AllthingsNola sun","useful":0,"cool":0},"GLrv9jAI2lPE_3yjr7cdxQ":{"text":"My favorite macaroon would be their seasonal summer blackberry and my current favorite is ","useful":0,"cool":0},"Gm-YCvXa1Ko0zazoDfnw_g":{"text":"A little pricey but very tasty. Two cakes totaled to $15 something. The cakes are pretty p","useful":0,"cool":0},"ZCXexj2O2rLSoMhImeFF-A":{"text":"SO GOOD! Cute shop, great service, delicious treats that are worth the price! My favorite ","useful":0,"cool":0},"j6IuvJ2dM4-tHF0EusdYUw":{"text":"THESE CUPCAKES ARE ABSOLUTELY DIVINE. not only are they GORGEOUS. The cake and buttercream","useful":1,"cool":1},"XJKbliztQaPJXo-2xtGXQQ":{"text":"I love coming here for the gelato. They offer a range of unique flavors that are delicious","useful":0,"cool":0},"SDmcRwzZqZmF22FuwA18TA":{"text":"Great place. In the touristy Magazine St stroll. \nGreat desserts, Gelato, macaroons, and a","useful":3,"cool":1},"mZ_RIrFR5z9-iFZO9gdQyA":{"text":"From the moment I walked in this place I felt an overcoming.....I didn't realize what I wa","useful":0,"cool":0},"JgUKm7C6v9Y-43U-gQOw6Q":{"text":"This is a magical store with many delectable desserts. It's a great place to grab gelato o","useful":1,"cool":0},"FFoDW9GgnrBXnhNCoC3Xjw":{"text":"LOVE LOVE LOVE this place! Sugar overload. I skipped dinner to have a brownie sundae and i","useful":0,"cool":0},"UaGRipsd1x4eCLrBdEj_gQ":{"text":"I love me some Sucre. It is clean, the macarons make great gifts, and the sundaes are AMAZ","useful":0,"cool":0},"s72cNKe2KAywNTRfAVRx8g":{"text":"at this very moment I am enjoying my favorite coffee...an amermicono. as a coffee connoiss","useful":0,"cool":0},"5SY19ZbtmTY1Ao1rxsnx_A":{"text":"My praline latte was awesome and the cute guy preparing it was an Angeleno too! Unfortunat","useful":1,"cool":0},"aAcBoGvZsG17ssUItU-fVQ":{"text":"Lovely gelato! I also enjoyed the chicory macaron. Definitely worth a visit to satisfy you","useful":0,"cool":0},"b0QQhfOKwkylsIghdpubpw":{"text":"I stopped by sucré to pick up some macaroons and will for sure be going there in the futur","useful":0,"cool":0},"qxA7tXFE_yeUCJ9PNBzNbg":{"text":"The macarons are delicious and I had a taste of my son's ice cream,it's okay but I'm sorry","useful":0,"cool":0},"9nop7gmsPOIJIgW2NlDbbQ":{"text":"I walked by and they were advertising a cool coconut mint tea drink on their chalkboard ou","useful":0,"cool":0},"hEF3n8byNaJU_1px6_sIPg":{"text":"I was REALLY bummed when I read the great reviews of this place and had such a yucky exper","useful":1,"cool":0},"18FrrhqBzQCeakEg2z2z5w":{"text":"This review is for their mail order business!  Their King Cakes are as beautiful as they a","useful":2,"cool":0},"R4PvKfgeqKaILOsFolb12A":{"text":"This place is like a roller coaster. .. dirty spoons, forgotten order,  no I'm sorry..shou","useful":1,"cool":0},"JmS2R3etSNrdZm0gXqbRig":{"text":"Happiness. That's really the best way to describe Sucre. This place is just sheer joy. We ","useful":0,"cool":0},"lsn_WVoXM3ledxA2Fwyt4g":{"text":"Whatever I say will not do it justice.  Save yourself the frustration of not finding it an","useful":1,"cool":1},"e_blpNHxRZsADWbSngJ51A":{"text":"This place is sugar heaven. I'm just being critical in not giving it a 5 star. Their Gelat","useful":0,"cool":0},"OFwVtT1WDUOAwXFIJUJ6Kg":{"text":"Sucre makes me feel like the inner princess hiding within me..Itsy, bitsy, dainty and of c","useful":1,"cool":1},"eOFcv9XwnJdDWCC458ddRQ":{"text":"Well-adorned but mediocre cupcake with dry crumb and weak flavor profile. \n\nI ordered the ","useful":1,"cool":3},"Fejv65uBGFmnxSxV03BFjw":{"text":"My love for Sucre continues to grow exponentially every single time I go in there. Lately ","useful":11,"cool":8},"GSH9RHQ_ZL6Kk7LqE_02iQ":{"text":"On a hot day Sucre looks like an oasis with the fresh gelato easily visible from the door.","useful":3,"cool":3},"NN0G4rifNSizGKQs4RFd9w":{"text":"Really enjoyed the gelato here. We drove all the way across town for some gelato when I wa","useful":0,"cool":0},"jpJvRYD4hpuAbCJ3lbe73g":{"text":"I have only been in here twice and I never returned because the staff was so rude. One emp","useful":0,"cool":0},"I4LCyKVnGHeyTr2lNPNxCA":{"text":"This shop is so cute!  It is very good place to bring out of towners for a sweet treat.  \n","useful":1,"cool":1},"Bo5AMq8a_3ASUiekkfijpg":{"text":"I've decided to add another unnecessary review to yelp for Sucré. Why? Because it's so dam","useful":1,"cool":0},"c_FPwtl5OXqleGC0ms8z-w":{"text":"I had never had macarons before this place opened. They are around the corner from my boyf","useful":1,"cool":0},"k0T2Srb481kyHUsGzf81Fg":{"text":"Bought a few macarons. Wanted to buy a few sweet drinks for my friends and I but the lady ","useful":1,"cool":0},"kL2ixknmYBmuZpF-zMgk-g":{"text":"Very nice looking sweet shop, with a large variety of pastries, gelato, chocolate truffles","useful":0,"cool":0},"8AGr69o9duI9N9bViAaDbw":{"text":"A little on the pricey side but yummy desserts. Went on a Saturday night and it was busy b","useful":0,"cool":0},"BmsO5-UtXy6peqQ6-S6MiQ":{"text":"I'm toying with giving 5 stars because I am not sure what more I would expect from a place","useful":1,"cool":1},"U-sSvTSVoPdh_d3PZZ8Q5A":{"text":"Enjoyed the treats. Eclair and apple pommel were delicious. A bit pricey for the size, but","useful":0,"cool":0},"va69OBANx6d9Es9Z2dJ2rA":{"text":"Expensive but very good gelato.  Great selections and quite authentic i.e. comparable if n","useful":1,"cool":0},"sIG5hJlCsvsSib881m8jBg":{"text":"Great gelato, macarons, chocolates and desserts. The service is excellent too. The hardest","useful":0,"cool":0},"w3z1vwEZL_xbLVBwYth9Hw":{"text":"The cute little dessert place is snuggled on Magazine. They serve desserts such as macaron","useful":0,"cool":0},"XMnVNjdIxxKeUSGjEx4HZw":{"text":"Great desserts on Magazine Street. I came here for the Macarons (or Macaroons). They had q","useful":2,"cool":1},"CZoFkHDCHEdf66urg5M7dg":{"text":"Who doesn't love sweets? Walking into Sucre is a delightful experience for anyone with a s","useful":3,"cool":0},"uTxTvxshIhvajNZbVGx2Mg":{"text":"I'm not sure what's happening to my taste preferences lately. I've never been really big o","useful":0,"cool":0},"ZKeIEzavyzruGLEEFCIvsA":{"text":"How cute is this place! I originally stopped by to get coffee to go, but actually had to s","useful":0,"cool":0},"ddm2Has7KIdp3vlnWvA_Uw":{"text":"Time to focus! Do not get distracted by the chocolate and cakes staring at you. They may b","useful":0,"cool":0},"TFeNLnsjdygWbFcg29Dyhg":{"text":"Great gelato, great service. I also ordered some chocolate explosion dessert cake that I w","useful":0,"cool":0},"k6fJjrtgID-NX15Ra1EGHw":{"text":"This place is great!! The sweets are sweet, but not overwhelming. We tried a variety of go","useful":0,"cool":0},"3Gi6EVPuW7ifum7wMx0QDA":{"text":"My girlfriend and I were disappointed. We'd been wanting to go for some time and we finall","useful":0,"cool":0},"rkhJlTCG3D0hPqnr5_HfgQ":{"text":"Pleasing and welcoming environment, with friendly staff.\n\nI only tried the macrons here, a","useful":0,"cool":0},"VZySbuDZ82CJYh_HIGHWOQ":{"text":"Eh. So-so. Ambiance: white walls adorned with whimsical paintings give the place an inviti","useful":0,"cool":1},"2JUmvgVIWqyCbr5b3PlvWQ":{"text":"In a quaint neighborhood. Beautiful display of wide array of sweets. We had an assortment ","useful":0,"cool":0},"6xT_LYu8tPhKKazXkwUZoA":{"text":"Short and simple review here.\n\nThe place to go to for fancy desserts!  The gelato is all g","useful":1,"cool":1},"RQT-tj8rYbvZXa4D95GYEQ":{"text":"We found this place by accident walking along magazine Street after dinner.  Boy am I glad","useful":0,"cool":0},"4PD8yLB2N_ncr_EcqNYUfQ":{"text":"Stopped here after a dinner date with my husband for some dessert. I must say the first th","useful":0,"cool":0},"vmvDSGNvTTEY5DpYIGqQuQ":{"text":"Great little dessert spot!! Stopped in for a treat after a very disappointing dinner and t","useful":0,"cool":0},"Krj-KLkyoxyJf69bY_oD6A":{"text":"I love the sundae's and sherbet. I always get the lemon lime sherbet since i like sour stu","useful":1,"cool":1},"lj7UaXX6QnBq48qxIOqH6Q":{"text":"Was thrilled to find this !!\n\nHad an absolutely decadent and wonderful cake, pistachio cre","useful":1,"cool":2},"gG01rjLIS5ORz2u_ux_Ryw":{"text":"Love their selection of decadent desserts! I always stop by here when I'm in New Orleans. ","useful":2,"cool":1},"Ulsp2L0aPdjFioMEyJ52vA":{"text":"I only tasted the gelato, and the two flavors I tried were yummy and had good mouthfeel. W","useful":1,"cool":0},"J_V6fTrKj91bZGBGEO-DaA":{"text":"We stumbled upon this adorable sweet shop while walking around the Garden District.  The d","useful":1,"cool":1},"bAgoAyzcltfdQqFoyXOseA":{"text":"The macaroons were delicious and very fresh. Try almond and salted caramel :)","useful":1,"cool":0},"VB-TqFw7WpIkvsXBAz7RiQ":{"text":"I had been dying to try this place for ages before we even went to New Orleans and it cert","useful":1,"cool":1},"-pE9ji1mYdV5BiK_PXgQWA":{"text":"I have mixed feelings. I adore their petit vanilla cakes, chocolates selection and about h","useful":0,"cool":0},"6Xm7f4QU-Eq8bgzX49LJiw":{"text":"Thank you, dear fellow yelpers for voting and giving me the distinct honor of Review of th","useful":12,"cool":10},"p13Vr90lbVOs5zUQ0UQ6ag":{"text":"This has definitely became my place of happiness, a place where only smiles live. A place ","useful":7,"cool":4},"uezP_woCStjmNk16X8-a_Q":{"text":"Fantastic spot for your post dinner sweet tooth. Full selection of assorted chocolate truf","useful":0,"cool":0},"tiEyiG8mLKTX3J16mEhzBw":{"text":"Don't come here if you're on a diet. You'll want to come EVERYTHING in sight! First, the a","useful":0,"cool":0},"Acw1dEkRM24QdJz3QJh9QA":{"text":"The staff was extremely friendly and helpful; they let you try as many flavors as you want","useful":0,"cool":0},"teYyv9HWHSnHh7sCLg2WTw":{"text":"Great little sweet shop with lots of options to choose from. They have several flavors of ","useful":0,"cool":0},"rAqE2ugukehgR28qqdO6fw":{"text":"I had the almond and pistachio macarons. The almond was the best! The pistachio one was go","useful":1,"cool":0},"qXE79x26YQsxsx2mfqfK2g":{"text":"This place is basically ice-cream, sweet things, and coffee heaven! The decor is very brig","useful":0,"cool":0},"svKVdFnUP1sjPBTxYSH6Qw":{"text":"Yes. Go. Eat everything that looks good bc you won't be disappointed. Have been before and","useful":0,"cool":0},"2pZCyq3EKLrTdIouFMXIbA":{"text":"YUM!!! That is all I need to say! The cupcakes are amazing and the gelato is so rich and y","useful":0,"cool":1},"3nrodCMg-3s1lhI_xxdnlg":{"text":"I'm like a kid in a candy store when I walk in here. I love their gelato, bread pudding, a","useful":2,"cool":1},"7mqrf4W_HvSKbQkr67rD9A":{"text":"Mmmmm...I have to say that I love, love, LOVED their frozen milk chocolate drink....SOOO g","useful":0,"cool":0},"1HVsFBZBAQWbD3glkj9wMg":{"text":"The gelato was fabulous, the brownies were amazing and the customer service & atmosphere w","useful":0,"cool":0},"KpEBLBGaOU9yGp8f61zSVw":{"text":"I LOVE LOVE LOVE this place.\n\nAlso on my list of must visits when I go back to NOLA to vis","useful":1,"cool":1},"wEdS2wA5-XQb4NoFRdMAgA":{"text":"Great options for all kinds of sweets. From gelato to pastries to cakes to chocolate. Can'","useful":2,"cool":0},"ybWDXLygJlaFMDPX9RTl_w":{"text":"I think I have food radar. I had no idea this place existed but we lucked into it after ou","useful":0,"cool":0},"jf2kPpb5-fDAcxwHxLF34g":{"text":"Sucre is so tasty and great-- Their macarons and ice cream are to die for! It's the cutest","useful":0,"cool":0},"9-3BpRoDsEmzSCh4lo1ekA":{"text":"Go early as it got quite crowded. Also claim your place in line. Numerous people walked in","useful":0,"cool":0},"KFML5bHcB7p5QQ7w9z7ODQ":{"text":"Come here for several things: EVERYTHING. \n\nWhere to start? Let's begin with one of their ","useful":3,"cool":2},"jd04oXz2zoP-OSG5rgHgCg":{"text":"My girlfriend and I stopped at this location as well as their location in the French Quart","useful":0,"cool":0},"x7gBCQF5YAvV0M4pE8sQJQ":{"text":"gelato in a purple cup? my place to be! I also loved this little cafe. strolling on magazi","useful":0,"cool":0},"YZITuJE_aHb8QcKY2s8dFw":{"text":"I went here Friday afternoon and was tempted by the chocolate eggs but the line was too lo","useful":3,"cool":1},"__Vvx_9qYNLwBBumc3jGHg":{"text":"New Orleans does not have Ladurée. It has sucre. It is a little bit wannabe at first but y","useful":1,"cool":0},"FB136Hat3zDf6lL4j8i6jg":{"text":"What a jewel in the French Quarter. I brought home a King Cake for Mardi Gras, everyone ba","useful":0,"cool":0},"-TCK3-4Ew2wTOT-47NkmSA":{"text":"I think what makes Sucré is the presentation of their desserts. Taste is excellent, but yo","useful":0,"cool":0},"1afiVoHSZwajZZSUIHHegw":{"text":"I dragged my husband to Magazine Street just to get some macarons and it was definitely wo","useful":1,"cool":0},"rfRIsGTyTf66xS_sYTq-Cw":{"text":"One of my favorite dessert places! The gelato is always my go to when I come to eat. The f","useful":2,"cool":2},"HTx3Eg6BiOVvGt1UGFAOKA":{"text":"Nice place and have great selection of ice cream. I had the butter pecan milkshake and it ","useful":0,"cool":0},"RHbIBfjje_gYxY9TQ3S7vg":{"text":"The gelatto-delicious. The toasted almond was just so...honestly words can not do justice.","useful":1,"cool":1},"tFbe8RNbV74CRHy1QVvY0w":{"text":"We ordered a cake from Sucré for my mom's birthday. Being from out of town we were nervous","useful":0,"cool":0},"5VU9LgXDU1uBSJCLfq6_PA":{"text":"The affogato is very good with the gelato - good & strong espresso. The caramel macaroon i","useful":0,"cool":0},"TTTrNMgtK-YqNtSiD5EjZg":{"text":"This is the perfect little dessert spot to sit down and share a sundae or grab macaroons a","useful":0,"cool":0},"B9a7-3w7p1qCInLGrWeP6w":{"text":"Beautiful decor and a great place to stop by while strolling down Magazine Street.  It is ","useful":1,"cool":0},"z4hL5SX_QldGINCELf5ImQ":{"text":"Always clean, visually pleasing arrangements, and creative concoctions. Took my ice cream ","useful":0,"cool":0},"h6r9wrfPDzaiqL0Doh7U6A":{"text":"We got King Cake and macaroons from here recently. While the macaroons are good, I think t","useful":0,"cool":0},"KhCdW8L1eRJWIdfLcq7fQw":{"text":"This place is really good. Cute and it's hard to decide what to get.....\n\nWe had the s'mor","useful":0,"cool":0},"xIrvyV5BlOqAIMhXl1Rojg":{"text":"This place is very busy on a Saturday night. No seats were available inside. A cute lookin","useful":0,"cool":0},"8sovXDh5hqg2hrvm0MX6Gg":{"text":"The gelato here is ON POINT. My only quip is they do what every American place does and th","useful":0,"cool":0},"jTPdj8GZLXWeLsXb-T6UhQ":{"text":"The macarons here are awesome. The coffee is some of the strongest in the city and the pla","useful":0,"cool":0},"AOKbEe_f-2dkuigSY2bHfw":{"text":"Sucre' is a nice local business that has great atmosphere, good looking gelato & desserts,","useful":3,"cool":1},"t_TVquNbf8_OPV_MCDxh4w":{"text":"To reiterate what seems to be the majority point of view, Sucre' is delightful! After an e","useful":0,"cool":0},"0dpvtinBaADNIoVf8x4TOg":{"text":"So I already thought this place was YUMMY. Now I'm obsessed because the staff is AMAZING A","useful":2,"cool":1},"7xac3zx0_N3Kze7TL8G4MA":{"text":"Remove the C in sucre and what do you get?  \"Sure,\" as in, sure thing!  Don't you C?  This","useful":1,"cool":0},"3hTj0VBDVF8KXbOrdcKfJA":{"text":"Such a fun take on dessert! Options include gelato, cakes, and chocolates. I ordered the l","useful":0,"cool":0},"wvxTmsOsnEPfXzitO_RPtQ":{"text":"I love little dessert shops but this one is the best! The Kings cake was so light and and ","useful":0,"cool":0},"w1Jhx8PrVf_DGv28TBHOUw":{"text":"I have yet to try anything here that isn't a delight to the taste buds.\n\nThe space itself ","useful":2,"cool":1},"7p5Yn56BchOI3L7mB5vYsA":{"text":"I found this place by accident. And I had a chocolate mousse cake with raspberry center, i","useful":0,"cool":0},"bYQqGxbAcgwOpHbRwSl3xA":{"text":"I really recommend the nectar gelato. As a visitor of NOLA I never really knew such a flav","useful":2,"cool":0},"Qn1FXtUhY98BQjAOotGcQA":{"text":"They have a variety of everything to satisfy your sugar cravings. I tasted a couple of the","useful":1,"cool":1},"nLD6d8-2I-kSetXDKnNWMg":{"text":"Butter pecan gelato was missing something. Peanut butter chocolate crunch was right on the","useful":1,"cool":0},"aqK2q3CYpUOK61auY_DBCA":{"text":"3.5 rounded up to a 4. \n\nShort & sweet:\n\nService: 2.5\nSweets: 4\nWait time: 5\nPrice: 3\nClea","useful":0,"cool":0},"D8re654JK2VPoraBhEUlYg":{"text":"Best macarons I've ever had. Not too sweet with perfect texture. Cafe au let was my favori","useful":2,"cool":0},"ykBQSGRagtQQyWkwfli1FA":{"text":"You must try the allthingsnola sundae. I dream about it! This sundae has banana fosters sa","useful":1,"cool":0},"UtuY2Io5TyeqmlR9cNuf1g":{"text":"This place is very good. The servers were nice, the gelato was good, the macaroons were de","useful":0,"cool":0},"ayWcmocOpL4WTesAlaVrlg":{"text":"Worst Eclair I've ever had in my life! The pastry (dough) part of the eclair was bland & h","useful":1,"cool":0},"-u499tQSL6AoGfXQBu_rKQ":{"text":"I'm a chocoholic and this little bandbox of a store on Magazine Street delivers some brill","useful":0,"cool":0},"oF6t7LOchDtlr_EXdeLYFw":{"text":"Delicious dessert place that offers a wide range of sweets to please all the sugar obsesse","useful":1,"cool":0},"Q3m2FzAO8m48w0GE34dXsQ":{"text":"Now they sell Sucre macaroons at Rousse's for $.50 less a cookie! Awesome. Also they carry","useful":0,"cool":0},"0Reo2FAcZdlFKKRrl712Sg":{"text":"Food porn that tastes as great as it looks!!\n\nI heart Sucre!  Sucre's magical creations ar","useful":4,"cool":4},"4uOUe0FhRzt3K8W3rcdNqg":{"text":"Sundae's are great though my wife and debate whether creole creamery or Sucre has better s","useful":0,"cool":0},"SBFoZBc0YVBVBLIPf97xIw":{"text":"The worst part about this place is deciding what to get. (well, and the screaming children","useful":0,"cool":0},"p2tf16wVrvzZZ6c0noQODw":{"text":"I'm typically not a huge dessert person, but I came with a gift card I received for my bir","useful":0,"cool":0},"gKfakMpX6lF0TXRukLIkog":{"text":"The best chocolate ever. Ever. It is all so pretty and well presented too, which is nice. ","useful":0,"cool":0},"AXYYg8SvI4OYy_wsgUJIWg":{"text":"This place reminds me of K-town, overpriced more than it should be BUT with that being sai","useful":2,"cool":1},"gpShtpmypEnvAjQDAhIT8g":{"text":"This is a review for Sucre's special event services.  I do love their macaroons and other ","useful":11,"cool":3},"lA4C-ONby5-cJch-ZtjkqQ":{"text":"The desserts here were out of this world! I had a delicious raspberry chocolate \"cake\", if","useful":0,"cool":0},"6dAUOjcb8kimO8DXMO2mRQ":{"text":"I've already reviewed Sucre before(5/5, best dessert place I've come across in New Orleans","useful":1,"cool":0},"GylPZPUozq3ymosGk0VaaA":{"text":"It's been a year since I was last in Paris and boy was there one thing I've missed terribl","useful":2,"cool":2},"UxP-ipyYW4PujPAPnNbrTw":{"text":"5/5 Macarons!. I actually did not like macarons until I had the ones from Sucre. Now I'm o","useful":1,"cool":0},"L-vInv3Xgr5jOU3YctRdqw":{"text":"I love macarons and I try them from different places. My friend loves this place and I Yel","useful":6,"cool":1},"p3r4hDM7vklouKMz4BSiNQ":{"text":"Amazing gelato, as good as anything I ate in Italy. The coffee was great too.","useful":0,"cool":0},"SXBjUCTk1-ZVL9W6eyiY9g":{"text":"This place is unbeatable. Everything is tasty. Everything is classy. You just need to expe","useful":0,"cool":0},"XcWp-YxwC9Thj5uPwlujPg":{"text":"this used to be THE pastry place in the city, hence my previous 5 star review. what happen","useful":1,"cool":0},"_HueLf-Hyobgy77EYNhRkA":{"text":"3 desserts & 3 coffees, sat at a table outside. The Sucre staff brought out a lovely prese","useful":0,"cool":0},"8EEL3g9amf_sc6ofXmTq1g":{"text":"Amazing gelato!! Had the peanut butter crunch but wished I could have had them all!\nAlso h","useful":0,"cool":0},"U7a1bDCKQ1h_90DLhn-jOw":{"text":"I have never had gelato before going to Sucre, and I was blown away! I think gelato may be","useful":0,"cool":0},"kiRM81vNyOc6JIYukPCoTQ":{"text":"Love this place.... Makes me feel like I'm a kid in a candy factory! Well I guess I am!!! ","useful":1,"cool":0},"SUq1GyVkx60A6Qfxkh-kJQ":{"text":"This place is amazing. I'm someone who rarely ever writes reviews, but I had to. I had an ","useful":0,"cool":0},"KhPldWodZ-2T-b4MI8kQ3Q":{"text":"While in town visiting New Orleans we stopped here and ordered an assortment of macarons. ","useful":0,"cool":0},"by6bPgBqUDzDkygARK3lqw":{"text":"The macaroons here are to die for! I liked these macaroons better than the ones I had in F","useful":1,"cool":0},"yraotFijVqeEeewrGW3Mtw":{"text":"What amazing and friendly service!! We had such a good time shopping for chocolate and oth","useful":0,"cool":1},"Yh-Vx9oYXbDs_JBC6YAstg":{"text":"Everyone raves about Sucre, but I must say, after 3 trips and 3 different items, I will no","useful":0,"cool":0},"B0IV_QDm8WOEVgVyzX9srA":{"text":"This bakery is beautiful, we got a box of 8 macarons and they were delicious, the bananas ","useful":0,"cool":0},"2RG3Z0ILepvJ4h8ZQQEj5Q":{"text":"My boyfriend brought me some macarons while he was in New Orleans and wow were they good! ","useful":1,"cool":0},"8NHpfGukO5mh4ggsUaa8lw":{"text":"Sucre is a charming, stylish sweet shop that sells macarons, handmade marshmallows, lavish","useful":3,"cool":2},"QkZi7zpOnwtae5xyQUv0jg":{"text":"It's a cute place in the heart of a trendy area. Great gelato and sorbet. Artistic and tas","useful":0,"cool":0},"qx0KN1XDoH1MpyjI3uKFog":{"text":"This place has the worst possible service but that's part because of the annoying clientel","useful":0,"cool":0},"q1atsMNlYaaURtaG_3Uztw":{"text":"My husband and I went to Sucre for some sweets after dinner on our 1st date.  The gelato w","useful":0,"cool":0},"0JJzfY1_RwYHNQxX7xMKuA":{"text":"Adorable and modern sweet shop with many options to hit that sweet tooth craving.  In sear","useful":0,"cool":0},"wfnGPL9126STHwIulid2cA":{"text":"I was disappointed with the gelato, but pleasantly surprised by the chocolates and baked g","useful":0,"cool":1},"RnYi4CfO4OpCEJvTlQZ9fg":{"text":"This place was great when it wasn't a chain. What was once edgy decadence has turned into ","useful":0,"cool":0},"BoQ-6n4DKtxM8LR34IRJpw":{"text":"Great gelato and a really cool store... bad for crowds.  We must have walked in during the","useful":0,"cool":0},"oNfEbWIsRRlWR1LhW8UALg":{"text":"This place has been on my list forever. Super cute store and delicious sweets. I had the N","useful":1,"cool":1},"IRg0zD4Gb8aLl5pvw0or2g":{"text":"I had the lemon pie gelato and it was refreshing and delicious. I tasted the wedding cake ","useful":0,"cool":0},"2H3mdGIQgHHhJt3_Vxum3A":{"text":"Yikes. High-priced gelato and fancy candy treats. But so yummy, in such a simply and elega","useful":0,"cool":0},"Yyd4JT41JLKLUvM2W5dhFw":{"text":"This is just a magic Willy Wonka candyland!!!  They have some fantastically decorated dess","useful":2,"cool":5},"p3CW91nk_rtBfXjaWMoN1A":{"text":"I love Sucre and I have been going since it opened.\n\nWhen I go, I usually get the cookies ","useful":3,"cool":4},"y1mW1Gp60BakrS4zUEyW-g":{"text":"The gelato was good, and the servings decent, but the service was terrible. The staff need","useful":0,"cool":0},"wX86G9u9UMdVYIl9wBMTrw":{"text":"Beautiful sweet spot!  I recommend their daily special.  We got a slice of red velvet cake","useful":0,"cool":0},"6764bikHU0JoZzZ_U7YQfQ":{"text":"This shop is a treat for all the senses, not just the tastebuds. The interior design is ve","useful":2,"cool":1},"inExa4UvhoPLV8rx95C2Jw":{"text":"Such a cute little shop! There's also a restaurant upstairs that is so adorable. There are","useful":0,"cool":0},"jxKJ7O7ATnqzBWcPZuohiA":{"text":"So pretty!  Unfortunately for me, this shop was all style and no substance.  The macaroons","useful":5,"cool":2},"pA0Pn9Qxq4JUnAR6W_Btsg":{"text":"No. I bought into the sandwiches but they were a disappointment. Every food item is pre-pr","useful":0,"cool":0},"v9f4110sZUPNx3p8A-dLlQ":{"text":"I have one motive when I truck on down Magazine Street to go shopping.  Ok, well there's a","useful":3,"cool":2},"fsqYaZS2ycMMsDpv2AjHNQ":{"text":"2 small ice cream and 4 macaroons $18 bucks! ridiculously expensive for sweet crackers and","useful":0,"cool":0},"0oD0nRaTrchr07oLDkmNTg":{"text":"Sucre was amazing. There are soooo many options from Milkshakes to pastries and their love","useful":0,"cool":0},"37gcQThkcCa2LT5N_QeUow":{"text":"Beautiful pastry shop on Magazine in the Garden District.  Wonderful macarons and amazing ","useful":0,"cool":0},"DZzh3DIeT1Rlialg2t0UeA":{"text":"Their pre-packed cookies and sweets are amazingly delish!  I took a couple bags home back ","useful":4,"cool":4},"28MoceEv54TgNDsmGxokPw":{"text":"A sweet tooth's dream. This place was fabulous. Recommended by our bed and breakfast caret","useful":0,"cool":1},"hygXQReiIbRN9xjSUq3d2w":{"text":"Amazing dessert and perfect for a quick fix for sweets. Staff was super friendly and very ","useful":0,"cool":0},"XoMc7Sketi-8fi_7Edu7dA":{"text":"I admit I am drawn to this place for it's looks...it is charming. The icecream didn't real","useful":1,"cool":0},"Qok0olz2HmyhHk7wowUaMw":{"text":"LOVED it. The have like 30 flavors of gelato, 10 kinds of cupcakes and cookies, a thousand","useful":0,"cool":0},"LffhNEegsat6ShDE-Pa4ig":{"text":"Waited in a crazy line for decent gelato. If I lived in the area I'd have to back to try t","useful":0,"cool":0},"TISGMD6cvLwZRv2O1CrVYQ":{"text":"Super sweet and expensive ...Popped in for a Mardi Gras macaroon, left with 2 macaroons,15","useful":0,"cool":0},"HbM25UQdeuvJ4mGKvEMN9A":{"text":"I'm with all the reviewers who don't see the attraction. First, two of the three workers b","useful":0,"cool":0},"vZg3Mmv4RJiMsWR5hRBglQ":{"text":"hot dark chocolate served by folks who can manage to be aloof, ignorant, snotty, and inept","useful":1,"cool":0},"dDOqdR1Ib_YuK3NuLeV2WA":{"text":"very clean and the employees were friendly.  I had the lemon sorbet and it was delicious,,","useful":2,"cool":1},"i03pyDXS0wc0PJdXCCjTFg":{"text":"The gelato and sorbet were all amazing with some very creative and fresh flavor that we ne","useful":0,"cool":0},"Nx9ZtZyTbozlPYry_Q8sDw":{"text":"thanks ladies & gents.  moved from nola to columbus 4yrs ago.  decided to have you send so","useful":0,"cool":0},"MOG7s1sh37hPebkt9iQIeg":{"text":"Sleek modern decor meets home made goodness.  The butter pecan Gelato was very good.  Pair","useful":0,"cool":0},"EpmYEt3FAwjxh_7o0g1xww":{"text":"*sweet heaven*\n\nThis is absolutely how I would envision sweet heaven, it would be full of ","useful":0,"cool":1},"eDXBusNC8wSieC_D-bZufg":{"text":"Awesome!!!!! No word that comes to mind when thinking about this place. Everything is impe","useful":1,"cool":0},"IEgPX0jZP1LuZySpgOWZ1A":{"text":"I really wanted to extend my trip to New Orleans as much as I could... so, once at home, I","useful":0,"cool":0},"Y_2KlBqPT6dHZ6hVhrQfSg":{"text":"We tried to get some ice cream right before closing (10 minutes before closing at the Fren","useful":0,"cool":0},"0DG-CAgQ9q-kHbWkIB7Fyg":{"text":"When I walked into this place I was in heaven.  In the front they have the delicious looki","useful":0,"cool":0},"WOYdUkQ0goTFQJootsYl1Q":{"text":"When I was in New Orleans last year I absolutely loved this place it's very nice ,modern, ","useful":0,"cool":0},"EotcxbS0DCfU0kQZNrjW4Q":{"text":"Absolute highest recommendation. We were in NOLA for 5 days and made a point to come here ","useful":13,"cool":0},"Arij5Iab_32cuPWSRInj2g":{"text":"If you like chocolate, gelato, expertly blended coffee drinks in a great vibe you'll love ","useful":0,"cool":0},"KCYvA23VA4GwBJszc9uKPA":{"text":"A must go place if you visit New Orleans! Get their macaroon!! Their sorbet is also delici","useful":0,"cool":0},"D4U-2tHC5EkbTH5yyVbV_A":{"text":"I'm the first to admit, I'm a sucker for presentation and branding.  The shop is beautiful","useful":0,"cool":0},"T6hxfEgnpozWSy-HCFmQ5w":{"text":"We ordered two macaroons- a bananas foster (interesting two-layered flavor) and a hazelnut","useful":0,"cool":0},"bl7Gd_7ySCD7eWYRfGmKOQ":{"text":"This place was recommended to me by a friend for Macarons, however I am extremely hard to ","useful":3,"cool":1},"G1e0zp38LB3jXLg4yHXTUQ":{"text":"This is such a cute place on Magazine Street! The decor really emphasizes the sweetness of","useful":0,"cool":0},"vTr8yf-HU_whuFzkM6lzow":{"text":"I have visited and ordered online many times, all great experiences! I wish they would com","useful":0,"cool":0},"_fwjnca3zXUz18UGgDhfwg":{"text":"Good desserts and coffee but a bit overpriced for what you get.  We had the gelato and fou","useful":1,"cool":1},"sHDHsJKIGiX03kPdTMKT8Q":{"text":"Beautiful display of desserts. So much shiny edible glitter, gold, and colors! Love at fir","useful":0,"cool":0},"BSYMi2cBOFY4hoMgISE8Nw":{"text":"You come here for the experience. The shop is beautiful and with such sweet aromas of dese","useful":0,"cool":0},"nEaN__cJo_WMorm-dNlsKQ":{"text":"I read about Sucre in our hotel tourist magazine and stopped at the words printed on the p","useful":2,"cool":0},"8SADwrqWUoKMvsHbUE0VYA":{"text":"Having followed this brand for quite some time, I was excited to finally make to NOLA and ","useful":0,"cool":0},"vlRbTiYnUKKd4qKxw3irkg":{"text":"Holy cow this dessert options are endless. The chocolatier area is one delicious bite afte","useful":1,"cool":0},"ux_Aqq_QberLK9tC7IgzgQ":{"text":"Of all the gelato places I've tried, this one was the worst. The fruit gelato was so sweet","useful":1,"cool":0},"pG32YnyybQCL2A9K_7bGzg":{"text":"Recently stopped by Sucré for a macaron, chocolate and champagne tasting.  $20 (plus proce","useful":0,"cool":0},"QC9dqPnAQDQ8Hbsr3Z7g4Q":{"text":"oh Sucre i miss u already.  if u are in new orleans, hop on the bus for $1.25 and venture ","useful":1,"cool":1},"ZqeO0k8SPhNkrl0AUklmXA":{"text":"Love the selection of macaroons. Been several times and tried a number of them. Maybe some","useful":1,"cool":0},"QsZJDTpIyGQykvcKHIG6jw":{"text":"First impression - \"Beautiful\".  The design is clean and simple and appealing.  The shop h","useful":0,"cool":0},"iejm2X07E5HvJZWl4iBNRw":{"text":"I love this place. Always and forever. Their desserts are so freakin pretty and are full o","useful":0,"cool":0},"Sd3k9CpZMrr5sGAeTgtOJQ":{"text":"I love finding wonderful dessert places when I visit a city! Sucré fulfilled my wish! I go","useful":0,"cool":0},"N__2oR56IiVf0-vH0lcOeA":{"text":"I absolutely adore Sucre.\n\nDuring my trip to New Orleans, my cousin, who is a native to th","useful":3,"cool":3},"JllOI9RvYvPHkipZFvO3aw":{"text":"Although I just ordered a pour over here, the customer service and atmosphere are amazing!","useful":2,"cool":0},"-Ytk9nV2vZ9RQTerjFOZQA":{"text":"Amazing macaroons! A bit pricey, but definitely worth stopping here if you're in New Orlea","useful":0,"cool":0},"_ummmPrUqzAbgOVyMhEwVg":{"text":"High end pastry shop, which is very good for posh little nibbles. I wanted to order two ki","useful":0,"cool":0},"X5BrRR8HvLXWrxuYp8NmPg":{"text":"I have to admit that i discovered this place when I overheard 2 little old ladies talking ","useful":1,"cool":0},"lGjGRmxwOrdPlm4dfMastQ":{"text":"Best milkshake of his life, says Dean of his custom chocolate-coconut-cookies-n-cream drea","useful":0,"cool":0},"w0PCFIvNMpch1iqf64OYEg":{"text":"Had the mini king cake; it was delicious and fresh! The tea came in a large oversized mug,","useful":0,"cool":1},"XKPnm9KuckI-nmhEtGBPlg":{"text":"This is the second Sucré  we visited while in New Orleans. The one on Conti St was so deli","useful":0,"cool":0},"HmoICzRbfqMXrAzH02S_zQ":{"text":"We visited this craving for good dessert and it's totally totally an awesome place. Must t","useful":0,"cool":0},"oTbdXFt5x1Dzf_mix_fSLg":{"text":"A customer of mine took me here and what a treat! They have icecream flavors you would nev","useful":0,"cool":0},"q08CUmkmOJrhgFO7wIlIeg":{"text":"I came here on recommendation of friend! Boy was she right! Divine and unusual baked goods","useful":0,"cool":0},"rIhl1haNhZSFw0w6GhbRaw":{"text":"great gelato. i liked their coconut basil, however i decided on an odd sundae with pistach","useful":0,"cool":0},"KvhVlpQhKYrEv6P5TrCy0g":{"text":"HANDS DOWN EVERYTHING ABOUT THIS PLACE IS AWESOME!!! From the chocolates to the cakes...my","useful":1,"cool":2},"cz-tEffupepOGQliyDgBUA":{"text":"SIgh...where do I begin.  I walked in twice when they first opened.  No one paid attention","useful":1,"cool":0},"cef3gRMGndao-4CgF-tdtw":{"text":"Really really good gelato. They have \"traditional\" flavours like chocolate, vanilla, fruit","useful":3,"cool":2},"4L5MnoHMWm_OqV8mA-AE7w":{"text":"For the love of Willy Wonka, this place is a sugar junkie's DREAM. If there is a heaven, a","useful":1,"cool":0},"5ItvucTa1EF8R4CEYy9glg":{"text":"Ah, Sucre.  I had such high hopes for you but the moment I walked in the door I had a feel","useful":2,"cool":1},"vm82VCpm-D6j3QqH6W-Vfw":{"text":"This place is all confection....so how could it be less than 5 stars? Gelato (not too adve","useful":0,"cool":0},"r4ajXlFGFRQVVIDpJUEzJg":{"text":"Tables were available but not cleaned when we stepped in.\n\nThere's something about the ser","useful":0,"cool":0},"SI58_rHOkJc7KI5ahR9QLA":{"text":"Really awesome gelato flavors! And their sundaes are the perfect dessert (a meal in my cas","useful":0,"cool":1},"sx9QKLMN-3YcgJ2if1Qq3Q":{"text":"Most delicious flavors of macaroons. Had seasalt caramel, pistacchio and roasted pecan. Co","useful":0,"cool":0},"OY7kN3G5oM-nEEu-KGLWJQ":{"text":"I'm not a hugE sweets person but their chocolate almost killed me it was so good. Rose and","useful":0,"cool":0},"5OAkHL4GAoEKYPs5rRl0BA":{"text":"This place is pretty solid. I must say, I have a very soft spot in my heart for sweets! I ","useful":1,"cool":0},"_82oOMmFHowPsmknrIZ40Q":{"text":"I got some herbal tea to counteract the eclair with chocolate sauce.  Both were excellent.","useful":1,"cool":0},"DsLrnZyfK1qs7wNxw2H3cQ":{"text":"Been here in the past for the macaroons and they are still just as good! Had the banana fo","useful":0,"cool":0},"n0WBS-PDPJ06b5d4f2ZCoA":{"text":"Just got my hands on a selection of Sucré chocolates. We received their Sugar & Spice coll","useful":0,"cool":1},"5sPgcODOY5084D3aJmo0fw":{"text":"this is my \"go-to\" place for fantastic sweets. Best of the best! Everything is so well mad","useful":3,"cool":1},"p9zAQQ_HCIXoctCi9gkDkw":{"text":"You will be pleasently surprised by this shop! It has an amazing variety,  fantastic peopl","useful":0,"cool":0},"ToaKgCSWnlFXxzKM6jfutA":{"text":"Sucre is actually kind of hard for me to review.   There are some things about it that are","useful":0,"cool":0},"5H5dcX2tZoKc1GXHXsJk3g":{"text":"We all know and love Sucre, the brown butter pecan gelato, chocolate spice sorbet, perfect","useful":2,"cool":1},"CIK6QL01_ruBeQ0Ml6c0Og":{"text":"Get the cardamom gelato and coconut basil sorbet. AMAZING!","useful":0,"cool":0},"BQOzxqv4OqYn-LVwXWTiNw":{"text":"Simply Fantastic. A great place for your daily sugar fix. This place is pleasant, well des","useful":3,"cool":2},"YXdWcmMgp7LfOgTV6CL1nQ":{"text":"I lovee this place! So cute, I love pastel colors! I think I first read/heard about it on ","useful":2,"cool":1},"fIHWCn-lQoiUTpXvIxD4Zw":{"text":"The most decadent and darling place I have ever been too, by far!! There are so many desse","useful":1,"cool":1},"47ZnAWF9pbYrd6jpHjq7Og":{"text":"Found this place by accident walking back from the Rum House and was glad we did. \n\nThe ic","useful":0,"cool":0},"RbdHkds8VDz1teOPSLD2mQ":{"text":"All of their desserts are delicious! If you're out shopping for antiques on Magazine, be s","useful":0,"cool":0},"QF-qWcH7dDfnHyn0Up30eQ":{"text":"My all time favorite dessert place in New Orleans! I have never gotten anything from here ","useful":0,"cool":0},"AI8fFwPCfdBC0lxWbZ8EDQ":{"text":"Expensive but wonderful. A perfect place to wait out a summer downpour with a cup of black","useful":3,"cool":1},"jlbmuid3bAgFuPPIgKEcCA":{"text":"I wanted to write a review on the best king cake I have tasted. I was not a fan of king ca","useful":2,"cool":1},"tq_hiIFnnUF_BqvCZsScxQ":{"text":"What a cute dessert spot! It's a high end bakery/pastry boutique, where their desserts are","useful":0,"cool":1},"NJTDOraCqksXW5oIFQ9Drg":{"text":"One night my boyfriend and I decided to go to la Divina for gelato. On a whim we went into","useful":0,"cool":0},"CEXmXfHB66_U9P2WBXjauQ":{"text":"I came down to New Orleans to go to the Super Bowl but I was also very excited to visit Su","useful":1,"cool":1},"W7U5tThCE4ffuC8WcxNh0g":{"text":"Low on the muffins and breakfast pastries, but just right on the hot chocolate, gourmet ch","useful":0,"cool":0},"ORTy1-wSFVaSkdj6rZSvAA":{"text":"I had to go back... it wasn't my fault.\n\nA friend with an impressive sweet tooth came into","useful":8,"cool":6},"CD-aNzx5A4ah_hOI4Voeqw":{"text":"Trust me and the 3 others in Brooklyn NY who devoured this cake on Saturday.  We put it in","useful":0,"cool":0},"3N-3yDER-dflCCIWJ4pqAg":{"text":"Omg! I felt like a kid in a toy store! This place is so pretty. So neat and clean and tidy","useful":0,"cool":0},"3aJz3bEl2n-WMIn5PsUgXg":{"text":"Cute dessert spot to my niece and nephew enjoyed a lot after a long day at the zoo. We all","useful":0,"cool":0},"OaoCimLFteX_CUNkhVH9Dg":{"text":"Got here 30 minutes before closing and our group of 22 got through the line with 15 minute","useful":0,"cool":0},"YTZrVFCZVdNUwiW0NmkO-A":{"text":"Always buy my valentines present from Sucre.  They have tiny, couple bite desserts that ar","useful":0,"cool":0},"91dJ4FEmRhRmJnXyo0-7ng":{"text":"This rating is for their marshmallows. Frankly, after trying them I felt they were over-hy","useful":0,"cool":0},"b84j_TSKkwrvtfloA1KBnQ":{"text":"Delicious gelato, macaroons and other sweets. Speedy service, great environment and good v","useful":0,"cool":0},"iEXwjS57U6kOdYmaRtzTjg":{"text":"My friend (who went to the Culinary Institute of America and is industry in nyc) says thes","useful":0,"cool":0},"m6T4U5goOcvMqsISx6Et2w":{"text":"The sweets are good and the location is great.  I will never return though- I wanted to ho","useful":2,"cool":0},"YAAL3jOLfRr5qSRTOiujlQ":{"text":"This place has the worst possible service but that's part because of the annoying clientel","useful":0,"cool":0},"wd3n7Xk7xzRAG7K-YUp0pg":{"text":"Wow, I walked by this and went it and checked it out, it's great! \n\nI had some gelato and ","useful":0,"cool":0},"a08ZjWWQKS8NeY6CU4Yeew":{"text":"Delicious desserts. We had the strawberry cake and the enormous chocolate eclair. Both did","useful":0,"cool":0},"gD-BEH8nVhamAu35CyaQnQ":{"text":"Had the red velvet mini cake and the smores skillet.  Both were fantastic. Free water in a","useful":0,"cool":0},"3w9p0vDwcOhqIsgVBle9HA":{"text":"I got some sort of strawberry shortcake sundae, and it totally hit the spot! They made it ","useful":0,"cool":0},"TeQKG4MhwMKT9frfabG0BQ":{"text":"I go every so often I'm in the area and I'm almost never disappointed.  Their gelato is de","useful":1,"cool":1},"cmPfzuit1YvZLMXzqNongg":{"text":"Great bright and open bakery with seating. On King Day I had a slice of their delicious Ki","useful":1,"cool":0},"NQJbIVOA1FlOsKQmEyFm9w":{"text":"My daughter and I were headed home from Whole Foods and I asked her to type in cupcakes in","useful":0,"cool":0},"RHJYh1xcOPdGTxc3vr98IA":{"text":"As a man with a sweet tooth, I can say that I have never had such delectable treats as I d","useful":1,"cool":1},"5aeu4GnrhJldUlymSQfngg":{"text":"Pastry is a work of art here! Very friendly staff and excellent gelato. My macaroons were ","useful":1,"cool":0},"QY1zowuiij-jMsWGxi9zYQ":{"text":"This place a a perfect example of why we should support small businesses. Here's a wonderf","useful":2,"cool":2},"-qFoxPyoKb54nN_f-1GPEw":{"text":"So hopefully you read my last review of Save Our Cemeteries and Lafayette Cemetery #1. If ","useful":0,"cool":0},"E9ackeuL1YW02Qk4y5I_ZA":{"text":"Used their loyalty card for some great gelato and pastries.","useful":0,"cool":0},"aaRqzPUpvjFLhDY_QbwdeA":{"text":"Solid macarons. I tried the chocolate, banana foster, and salted caramel. The chocolate ta","useful":0,"cool":0},"KWI2NSwJ42nZCNbKnpvmzg":{"text":"This place is adorable. You could spend a lot of time in here just taking in all the tiny,","useful":0,"cool":0},"0yKg4GsRgrOUkP5m_UCF1w":{"text":"Upon first entering into this Magazine street dessert boutique, I felt as though I had ent","useful":1,"cool":1},"GIdzMzVZTyjEPUUfFvgOtw":{"text":"What a fabulous experience!! It was a bit crowded when I arrived, but once I got the Banan","useful":0,"cool":0},"1kjzOkWuzYTDVQomYXa2og":{"text":"Joel Dondis, founder and owner of Sucre, recently read about my ice cream blog and invited","useful":3,"cool":2},"jq_Y7sctBuRykeiLZb11ng":{"text":"Decent macarons for being delivered via dry ice. Tried them from a little boutique Le Marc","useful":0,"cool":0},"oY_Q0dq4RuwvdSI9UZgdGw":{"text":"We had already had ice cream but couldn't resist the beautiful desserts in this cute littl","useful":0,"cool":0},"2B0BqW4W0Mu_9yZUygw5qA":{"text":"Visiting NOLA for the first time and wanted a delicious dessert.  I took a bite of my red ","useful":0,"cool":0},"d0wJaDUG0jW1SM8kMYB0SQ":{"text":"Toasted almond gelato. So simple, so brilliant. They let you sample everything and it's al","useful":0,"cool":0},"_NioO-x9MIlj8H0uZbeL2Q":{"text":"Dear Sucre:\n \nI don't even know what to SAY. I have NEVER had anything\nas good as your des","useful":1,"cool":1},"SP-no_wercuiz2cbhSv6ng":{"text":"The best sweet shop in the South and possibly America. Everything is impeccable and delici","useful":0,"cool":0},"HGiA1nASFDLc_7YwHWFKTw":{"text":"Oh me, oh my!!  Gelato, macaroons, and lavender white chocolate hot chocolate, OH MY!!!  \n","useful":1,"cool":1},"USMim22FaWYgxEzjH6KapA":{"text":"Maybe we chose the wrong things to eat. Everyone else seemed happy. I was so excited about","useful":0,"cool":0},"Gtw_lVwbt1xpeq8I-5e_Dg":{"text":"Walking back to the French Quarter from our most delish dinner at Cafe Abyssinia, we were ","useful":12,"cool":10},"gh0Eebi2_Pw0MZI8D7af0A":{"text":"I was just visiting NOLA and wanted to get out of the French Quarter.  I was directed to M","useful":0,"cool":0},"_1EUDgzfCAtUBfpTtw87vw":{"text":"While in NOLA I went to two different locations, the one on Magazine Street which has cupc","useful":0,"cool":1},"u8a0yST3RTTqL8buwTrRFg":{"text":"I can't get tired of their macaroons. Ever. And the store is super pretty and well set up.","useful":0,"cool":0},"qnLSUYoSq15sRINq76I7_A":{"text":"If you like desserts and can get there, I say run, do not walk, to Sucre! We went on a Mon","useful":0,"cool":0},"tv6f_uvZKcv8nOM_jHFHPw":{"text":"Delicious macaroons and adorable place. Hazelnut, almond, bananas foster, and salted caram","useful":0,"cool":0},"rldvRy_YRjjuB9OLHSJI-g":{"text":"I've only had the coconut basil sorbet here on one occasion and it was freaking marvelous.","useful":1,"cool":1},"IYf6h_d8ID_dWg-ctaRJmA":{"text":"This place is worth venturing uptown. We got an All Things NOLA and a Richoculous Bar. Bot","useful":0,"cool":0},"p2ccYH8esXucuDqSD-h_sQ":{"text":"First off, they really made the space look clean, modern and pristine.  The displays looke","useful":0,"cool":0},"2hui4yhIyFPbwMg-6m5KbA":{"text":"The macaroons are excellent and there's a wide variety of options! Every the coffee is gre","useful":0,"cool":0},"YTonyWNln3a9gfisVQDeaw":{"text":"I was excited to come here. It's right on magazine street a few blocks from commanders pal","useful":1,"cool":0},"04g3Sc1Wa3yCFjErJ-aU4w":{"text":"The decor is sleek, the sweets could hold their own against any big city shop. At two doll","useful":0,"cool":0},"2rcn-oyderOLaw7zZU7_2w":{"text":"\"Ohhhhhhhh..... PRETTY!\" \n\nInitally, that is the profound thought that usually goes throug","useful":2,"cool":3},"0vJtNFizfE1heuLngLqxGA":{"text":"Several years ago my friend and I randomly stopped in here for some wine and chocolate. Be","useful":1,"cool":0},"mjBFbrBlR_IpM79y1rSQng":{"text":"The service was very good. I went out of my way to purchase some macarons for a friend and","useful":0,"cool":0},"NQnDo8oHS7dCoTHvDNEfpA":{"text":"This place changed my mind about macaroons! I can't believe I've been missing out on these","useful":1,"cool":1},"vTR3mIx_I0YhjZ11Zhfeow":{"text":"My friend kept sending me Instagram photos of sweets from here, so it was on our to do lis","useful":0,"cool":0},"dmS6o9bePGeiAOktdk9bnw":{"text":"Stopped by in the evening and grabbed some macaroons and ice cream. Both were delicious. I","useful":2,"cool":1},"PWEmdmwX4i2HN0SQDf5G8Q":{"text":"Delicious dessert cakes, macaroons and ice cream. Everything and I do mean everything is w","useful":1,"cool":0},"fLdOfowJibVd8FZltbVDtw":{"text":"They sweets are delicious but don't miss out on the great food upstairs. Wonderful small m","useful":0,"cool":0},"zJz5irHhNNFzh6M8kc5-EA":{"text":"I won't be telling you much that others can't!\nThe atmosphere is very light and airy, rath","useful":0,"cool":0},"UlGWZW88PjPIcmixFGmTsg":{"text":"Best cupcake I've ever had.  (Salted caramel cupcake)  And I've had a lot of cupcakes.  Th","useful":0,"cool":0},"b9IaKTSbjPRQReNeutEn1Q":{"text":"Amazing macarons, eclairs, chocolates, cupcakes, king cake, paddy cake, gelato and everyth","useful":0,"cool":0},"5cyzWYHCxDpx5NJilxkOFA":{"text":"Delicious macaroons. The strawberry was glittery and tasted like unicorn dreams and rainbo","useful":0,"cool":0},"O3gbq-7uFojR9K0ptYa5fQ":{"text":"After having a terribly salty dinner, we decided to come here to balance our palettes out.","useful":1,"cool":2},"wVk6fpSNw_8TURYvgTEoGQ":{"text":"The window displays suck you in and the gelato case convinces you to throw down cash and t","useful":1,"cool":0},"J8dSbhQk-nJcjOfFKvNGwg":{"text":"Good dessert place. The turtle and the warm smore chocolate cake are the best.","useful":0,"cool":0},"nrZi99Lvbt0K8a93rW2_tw":{"text":"The macaroons here made me believe in the healing power of this dessert. The chocolates ar","useful":0,"cool":0},"pyJYxNa88CZXkdrH-4Wm6g":{"text":"This is a joint review on behalf of my friend Sasha and I. Sasha is in love with Sucre and","useful":1,"cool":0},"dmn5ZfBsI7hAn8uj35xKZg":{"text":"The macarons here......WOW! Great balance of flavors. We purchased the 15 count gift box a","useful":0,"cool":0},"ZKC0NLC7xmxweqobntWsyQ":{"text":"No yogurt here. Only high priced gelato. They did have one that was sugar free so I'll giv","useful":1,"cool":0},"OxeGTHxYLV2F5Cr2GXP6sg":{"text":"Sucre is adorable and the desserts are delicious! I have had everything from the gelato to","useful":0,"cool":0},"vQ1GlPIU88NW2Wh1Z43NQw":{"text":"Great macarons but it gets really crowded and pricey. Also there is a difference btw macar","useful":0,"cool":0},"ja8n4xT4BuIa24ZzRbxi1Q":{"text":"Love this place!\n\nGreat location and great ambiance. The variety is great from cold treats","useful":0,"cool":0},"F268PfJN1_F6i_ZdW0TtGQ":{"text":"Never had a bad experience here. I've also never been to a place that had every sweet you ","useful":2,"cool":0},"PJwht5yYQwvFHurvcKtCHQ":{"text":"I am usually very health conscious and rarely eat desserts but while visiting New Orleans ","useful":0,"cool":0},"NaOS0yN0atQ5FxunFi8Obg":{"text":"Parisian quality macaroons right on Magazine Street !! We stopped here after lunch and pic","useful":1,"cool":1},"A62lDgFFeSbQYDz-cpLhQA":{"text":"Chocolates here are impressive. I tried one of their cupcakes (chocolate caramel) which wa","useful":2,"cool":0},"seCvBPxI2c_XNEuzPRIAPA":{"text":"They have seasonal macarons, oh man. I had two and they were pretty good. One of them was ","useful":0,"cool":0},"T6u6omXptZ78dOrcyyP7HA":{"text":"This place was recommended by a different restaurant we went to! (Green goddess) we walked","useful":0,"cool":0},"r1KoW5G6YxEvjrTe2JyzLQ":{"text":"It was providence indeed that while sitting on my Southwest flight from STL to New Orleans","useful":2,"cool":2},"_Jj8046Zm-9EpyknFYq3gg":{"text":"Sucre is a great way to get through an awfully awkward evening. \n\nFor example, when an old","useful":7,"cool":4},"P5J14dQLbF77K3C7SdVKlQ":{"text":"Hello delicious desserts chocolates and coffees! Some friends and I stopped in for coffee ","useful":0,"cool":0},"1K5yfMW0OnKYCHWujrFv6Q":{"text":"Wonderful macarons, subpar gelato.  All the flavors just tasted like sugar, no decipherabl","useful":1,"cool":0},"4PNQNub2Xg0zTh_ODFQ9Zg":{"text":"Super sweet shop but is also pricey so it's definitely a place for a 'treat yo self' day. ","useful":0,"cool":0},"e-E2FScxBztHKq0PGhz1Dg":{"text":"FREE MACARONS?!?\n\nAnd free truffles. And free hot chocolate. And free candied pecans. And ","useful":3,"cool":1},"DecfwCdDIeBUZBX_MQ3Lww":{"text":"There's so much desert to choose from. They store just sucks you in, when you walk by. You","useful":0,"cool":0},"d_VXOCcCi-vstLSQBt00sQ":{"text":"These king cakes were awesome...so fresh and delicious. They also ship cakes for you which","useful":0,"cool":1},"hGpe7JLg7ubpyRX-XgPQPQ":{"text":"S'mores sundae the size of my head, with s'mores gelato and a toasted marshmallow on top. ","useful":0,"cool":0},"4cDj7F2Aasp56SSASEfYEA":{"text":"LETS GET CHOCOLATE WASTED!!!!\ngood god almighty, this place has it all. When I just want e","useful":0,"cool":0},"VyvTZNU3yfoMbXRGOdx31A":{"text":"WHY DON'T THEY SERVE KING CAKE YEAR ROUND? ;asdgh;aoighe;aoisjf;oihawet\n\nI guess their cho","useful":1,"cool":1},"NI6-iy7tsiyrgLISQSjgSQ":{"text":"Great place to pop in and take a breather when you're walking around the Garden District a","useful":0,"cool":0},"_DbWHRMaxLBDvd8PgmjWEg":{"text":"Stopped here for gelato after walking Magazine Street for the afternoon and after having a","useful":1,"cool":1},"l-Nyy7F1peDieyJTGxcDdg":{"text":"Sucre helps me forget about the fact that New Orleans doesn't seem to have too many (any?)","useful":2,"cool":1},"KHkKS9Mq5drOW2Irv4W-Iw":{"text":"Broke my diet just to come here. We really loved the French macarons, the eclair, the king","useful":0,"cool":0},"9T0Ts9LZzPN_R_pZ_XCVfw":{"text":"This was our last stop before leaving our 3 days vacation to New Orleans, and I have to sa","useful":0,"cool":0},"ixkkzVS11Pg6GiXZH2zTUg":{"text":"Yes.  All I can say is yes.  The pastries are incredible, the candies delicious and well d","useful":0,"cool":0},"6-NqsB7K25XgQjkqqI1o7Q":{"text":"I was on a road trip with my mother across country and our stop in New Orleans led us to M","useful":0,"cool":0},"eW5HyTv1-Ndj8itIZC9uSA":{"text":"I absolutely love this place!!!!\n\nIf you're at all into sweets, this is the place for you.","useful":1,"cool":1},"lNCu0AF9FM8J7UWbgMR04Q":{"text":"Always my go to for impromptu dessert or gelato! They change up their gelato flavors accor","useful":0,"cool":0},"8SKUZ69SokdUrVp33anzAA":{"text":"One of the most exquisite shops I've been been in. This is a must do shop for ice cream, c","useful":0,"cool":0},"1DkkFcmKKphjJk7VrVn3bA":{"text":"I love macarons! I heard of this place from my cousin's bf. He ordered macarons from Sucré","useful":0,"cool":0},"bGCqHnJo224uqw1ihrzU4g":{"text":"This place is heavenly in a sugary, inner-kid-in- a-candy-store kind of way!! I got a slic","useful":0,"cool":0},"oJZmkc_WdgG65I64DU85fg":{"text":"Little pretty ice cream shop and beyond; they sell not only ice cream but cakes, cup cakes","useful":0,"cool":0},"juau9pIoox4suE0ndk0I8Q":{"text":"This is a fun place to take out of towners. I also like to bring my little ones for a spec","useful":0,"cool":0},"9Gdw4rDgTNTlAgbvDFaUuQ":{"text":"Come here to get your gelato and macaron fix! Lots of flavors to choose from and delicious","useful":2,"cool":2},"WgYc_yEZoIreAPFTaXU7Bw":{"text":"Clean bathroom, decor skewed for kiddies, somewhat friendly service, good amount of seatin","useful":4,"cool":3},"g4gKmnvXmSLxhtxqLoLu6g":{"text":"If this place had better parking I'd give it 5 stars.  EVERYTHING HERE IS AMAZING.  Just s","useful":1,"cool":1},"jcydwxpX6vzuBJkgf46nbQ":{"text":"I originally came here in 2013 to pick up some birthday goodies for myself and the gal tha","useful":2,"cool":2},"p7HYAeHueoL8PlZpA9Q5QQ":{"text":"Omg. Everything we got here was amazing. It's hard to walk out of here and not be in a dia","useful":1,"cool":1},"odr90X2lVoo57NmIhoxkzA":{"text":"When I want a sinful dessert or gelato - I run to Sucre. And everything does sparkle - eve","useful":0,"cool":0},"rgckSW_7NSzqOh3Odvpq2g":{"text":"The main location for this local confectioner. I entered mainly because of the unseemly ch","useful":1,"cool":2},"0Bh__OCQqit4Y2WLnxFTMg":{"text":"VEEERRRYY CUTE SHOP! We went around 8pm and it wasn't packed. Awesome flavors like coconut","useful":0,"cool":0},"PTunuFV4JkE0PTDyHM4DkQ":{"text":"A friend took a group of us here when we were visiting. This place was really good. The de","useful":1,"cool":1},"cLzRrkOFosXksphJT1DCMA":{"text":"Love this place! Never fails to satisfy everytime I'm visiting home. There's a wide variet","useful":1,"cool":2},"kFe8H-vp_lDqgTjRTElCVQ":{"text":"I'm still a fan. But I had a stale and not very tasty pastry the other day. Alongside it, ","useful":2,"cool":1},"GrQN8sIvcz2uyhVItAhx1g":{"text":"Sucre has changed my life....have to say that Sucre in NOLA does it right. Its texture and","useful":1,"cool":2},"X3GMJfU-jYhDylUOi3dqVQ":{"text":"Went here with a group of 6 (5 of us were out of towners and 1 local).  Not sure why but e","useful":0,"cool":0},"jLmEn85ASLgaFxcF58WaZg":{"text":"Have dinner on Magazine and then reward yourself at Sucre!\n\nWhen you walk in, take a momen","useful":0,"cool":1},"MfYHFRz-c9nymAUS2eRKuw":{"text":"Trendy and good, but over priced. Get the nectar flavored gelato, or just screw it and go ","useful":3,"cool":1},"hrgWYtxhaaRVKVe4uXVGWQ":{"text":"Specializes in everything sweet, but nothing really stands out to me. I would come here af","useful":0,"cool":0},"3_UlVHI7HCJVy6OR9L-MgQ":{"text":"Such a pretty place. Loved the decor but the prices shocked this jaded New Yorker. Had the","useful":0,"cool":0},"vk8YIkobnC9UGV3dFHYz3A":{"text":"Sucre does not disappoint when it comes to indulgence.  This time around white chocolate b","useful":0,"cool":0},"_OXZu_p5LoP04Qq7L63JIA":{"text":"This location always has friendly service and the desserts are at the highest quality they","useful":0,"cool":0},"-WdCppQbEPpMqouh0t1xpg":{"text":"I had the coconut basil gelato which was wonderful!!! The bananas foster macaron has layer","useful":0,"cool":0},"a0E0Xs6Fnu22u1uQVOKZJw":{"text":"Expensive but fantastic. Great spot for a quick sweet fix.  The macarons are delish!!","useful":0,"cool":0},"gtMoyXP3RZp-4Prff8yNfw":{"text":"Delicious macaroons but too much sugar in it. We will definitely come back for more, but t","useful":0,"cool":0},"JYyah0wKbNQ-l2pAmMoOmw":{"text":"I love going here in the early afternoon when they're fairly quiet because you get to talk","useful":1,"cool":1},"Z9tChy-G8hMwKSkeZVj23g":{"text":"Those are not cupcakes. They are a sorry excuse for muffins topped off with terrible tasti","useful":0,"cool":0},"H2YMVAMEXSIJ0wK8DQdKaw":{"text":"Seriously, I go here to window-shop pastries. They're just so pretty! The macaroons are we","useful":0,"cool":0},"kAsuW95lpuODtmKkHLoyKA":{"text":"Had the bacon chedder crust apple pie with walnut sorbet.  Absolutely heavenly.  Hours are","useful":1,"cool":0},"2tueIHFEbUJQMqdvY4snZA":{"text":"This place has THE BEST macarons. They sometimes have different flavors. The staff has bee","useful":0,"cool":0},"1bwZ3nr761nugGjxdWJu0g":{"text":"Nice staff, good hot beverages and delicius cakes. Little too 'clean' atmosphere for my ta","useful":0,"cool":0},"vnTJdP5ME6T3-KOU7rdF6w":{"text":"I absolutely adore Sucre! The lavender white chocolate cocoa is wonderful on a cold winter","useful":1,"cool":1},"UJOEp0uq_DMNYlu_BYblUA":{"text":"The modern atmosphere of the place is great. The staff is friendly and helpful. Its not ch","useful":2,"cool":1},"9yG10G5FUgGrgHkLXumIFw":{"text":"Beautiful dessert place\n\nRecommended:\n* Salted caramel cupcake - their best cupcake\n* King","useful":3,"cool":0},"TA7RZWWhXNb3VPKIfGIMIA":{"text":"The macaroons are very good! The Gelato is a tad bit sweet. Great place for a hot day to d","useful":0,"cool":0},"I6srwVJEKLWZutN118Wa6w":{"text":"First of all, I definitely need to point out that this colorful little bakery is a girly-g","useful":0,"cool":0},"Wj5_TIGn2KvmgyVAnZJb1Q":{"text":"I love the decor and ambiance of the place, but dessert was Meh \n\nWhoever designed this pl","useful":1,"cool":1},"TTj66t0C4wsulo8vtabIng":{"text":"Walking into Sucre is like walking into my own personal heaven. The atmosphere is light an","useful":0,"cool":0},"18IWQMzcOWLcsb7OdzXuCA":{"text":"Gelato and chocolates are FANTASTIC. The macaroons and other pastries (cakes and cupcakes)","useful":0,"cool":0},"bhSNCmAhVSDhVSQQ-p5-cQ":{"text":"We were driving by after late night dinner on Magazine st, and found this at 11pm on satur","useful":0,"cool":0},"--6qi-T8ptOh7vyYtElEIA":{"text":"I heard about Sucre but never had a chance to taste the sweetness of their love. Finally, ","useful":0,"cool":0},"PHj0OzKjC50BRT8A3pSIaA":{"text":"Mother of god the bananas foster macaron is like crack. If I lived in NOLA I would have no","useful":0,"cool":0},"8Rd9WC14u2JJqIqFuiQTzQ":{"text":"Dropped into sucre to get a quick snack.  I got the salted caramel macaroon, which was goo","useful":0,"cool":0},"O4_XWQJzavO0OSsge5yWOA":{"text":"Dark chocolate covered macaron = heavenly. $2.20 though, but worth it at the time.\n\nThis i","useful":0,"cool":0},"WH3TUdmo6cXXH8qPulgf6Q":{"text":"After strolling down Magazine St and seeing the huge crowd inside, I figured why not see w","useful":1,"cool":1},"0QSmNrFc10RzSGJRffaa9A":{"text":"So I returned (January 2014), of course, but it had been several months since my previous ","useful":0,"cool":0},"OIuUxUHZAPtYBHQlgOKJCA":{"text":"Love the gelato, love the macaroons.  And if you love chocolate and raspberry, you've got ","useful":0,"cool":0},"fIPO1IATcOnc6IroUwLW5Q":{"text":"update = the hot chocolate here is excellent, and they have gotten rid of the weird funny ","useful":1,"cool":0},"HmKbk9F6maWQm9vmSMZ7KA":{"text":"The macaroons were out of this world. I had the sea salt caramel and hazelnut one. One of ","useful":0,"cool":0},"VLTW00oNtqZfGif8wnNHaA":{"text":"Oh lord, where to start?......\n\nAbsolutely delicious desserts. A large variety of deliciou","useful":0,"cool":0},"zjCFlxhkzM2qAbB0hYyCvQ":{"text":"Their creations are delicious.  There is no question about that.  I just never enjoy bleed","useful":0,"cool":0},"sQMJHXmI7dAjMa_E9sr8Gw":{"text":"Best food find of our NOLA trip. We saw a picture of one of their sundaes in the Where Mag","useful":1,"cool":0},"v1bMM43k1ijCKpXDPJ7CSQ":{"text":"Most of the reviews here are spot on: Sucre is a pastisserie/gelaterie/confectionary tryin","useful":0,"cool":0},"WU2RTLMassRDfHH6czv-gA":{"text":"When Sucre first opened, it was way above average. Their gelatos were flavorful and their ","useful":0,"cool":0},"5C4zUPDjQVzCYUK2S3tmdw":{"text":"Definitely the best gelatto that I've had, and for sure better than other places in the ci","useful":0,"cool":0},"KOwzMzPloIIYEZcprdujjA":{"text":"Score: 4.5\n\nPrice: $$ (expensive for macarons but worth it!)\n\nWebsite: http://www.shopsucr","useful":0,"cool":0},"sqTWHLkiU_B5ECeEj3CURQ":{"text":"This place is \"dope!\" \nI get the Tiffany! chocolate cake with raspberry filling. \nIf you g","useful":1,"cool":0},"6PrUtqr5BhyPYw9yKC1EOw":{"text":"Very clean and nice atmosphere.  Got a combination of Gelato and sorbet.  The sorbet was m","useful":1,"cool":1},"gCoKtWY3c7A7VBvvFvnT5A":{"text":"Stick with the gelato but still disappointing. Had high hopes for a brownie sundae. But th","useful":0,"cool":0},"FkMR6kYQ9G8KzUz0UFr29w":{"text":"I may need to edit this review after a few more visits, but so far I'd put this place midd","useful":0,"cool":0},"w-ZYn1k13cSrsrWkVPDmCA":{"text":"Eclair Heaven!! October is Eclair month so get them while they last. Had the salted carame","useful":0,"cool":0},"blt99lMg31sG7bUM2gVimg":{"text":"I am a native of New Orleans. Now I live in California. I recently went back for a visit a","useful":1,"cool":1},"mnbpEAS_gl8tjwFaZNcilA":{"text":"Sucre is a dessert shop that specializes in sweet treats like gelatos, cupcakes, and other","useful":3,"cool":2},"hpauTQv72_dtN-CqQvlsog":{"text":"I've managed to stop by here a few times in the last year. It's really pretty inside and t","useful":0,"cool":0},"xEUVqdD-cE9awIcUqQfchQ":{"text":"I guess one could read this as a vote of confidence, but Sucre is always busy everytime I ","useful":4,"cool":1},"0rv_q9HMPVHCPNieaE_9pg":{"text":"I LOVED this place! The ice cream here was very very good. Staff was super friendly..I tri","useful":1,"cool":1},"6k9V1NJQYWMn4_J9ivP7Sg":{"text":"A bit overpriced... if it had more character, I believe the prices would be more appropria","useful":0,"cool":0},"TAKmtyNtdS0GmtHSpLwc9A":{"text":"Decent coffee. The rest of the table assures me that the gelatto and the bread pudding kin","useful":0,"cool":0},"zPzvhf6dDdLMl7vQsxHh8A":{"text":"Sucre is a dessert shop on Magazine Street that showcases the talents of pastry chef Tariq","useful":0,"cool":0},"ADEhm-gVfDAa5jWUiUbh6A":{"text":"The macaroons are gluten free and delicious!  I have tried several different flavors, and ","useful":0,"cool":1},"WycIgezODYhcaMEvZo3fYQ":{"text":"This place is awesome. The sucre sundae had the right amount of sweetness and had chocolat","useful":0,"cool":0},"cHTYq9tQPlCJ6yEyO2NTFA":{"text":"Beautiful shop and excellent service. Offered me a macaroon after I bought a box because I","useful":0,"cool":0},"LVqiocrnNThOBKPrkS8C3Q":{"text":"This is always a great place to go if you are craving something sweet! They have a great s","useful":0,"cool":0},"nB-JJXJQYI59nDeqjFjJ2A":{"text":"BLUF:  Fancy desserts. \n\nI have only gotten their sorbets but they are amazing.  Lots of d","useful":0,"cool":0},"ot2lqLxh4OvDf1U2ZWCORQ":{"text":"Sucre is very attractive inside and outside. I wouldn't be surprise since they did spend 1","useful":2,"cool":0},"ZDbU-Bj69Sz6aKWOX5194w":{"text":"I just stopped in a few days ago on a recommendation from a friend. I can say this is a cu","useful":0,"cool":0},"cSBs2O3jUYyOY9zGOyRZfg":{"text":"Yummy!!!  This place is a perfect pit stop on a lazy afternoon on Magazine. The only bad t","useful":0,"cool":0},"Jwe9yvMsSlyn-wZ56Zm3OA":{"text":"Came with the Mrs for \"a few macarons\" and walked out trying just about everything they of","useful":3,"cool":3},"sOhQOscD9T-PcH4j3yRQ4Q":{"text":"Sucre is one of those places where you walk in and you want to \"squee!\" with joy. Oh, the ","useful":0,"cool":1},"_dUrnd66o6ucWEJQLn6Srg":{"text":"Best gelato I have had anywhere, hands down! The flavors are so intense, you can savor the","useful":2,"cool":2},"2kwIhhsYbfvKzMGK3RKu-A":{"text":"Where I come from in Wisconsin, there are no places close by that sell french macarons, so","useful":0,"cool":0},"YfaBv9yrPZb7ACKboLHGJA":{"text":"Nom.com! My Louisiana friend took me here and it's a sugar extravaganza. Their refrigerate","useful":3,"cool":3},"0F1CHsIkXhCbQ7QUHJYMDw":{"text":"I would have to give 3 stars. The desserts are wonderful and consistent! This is the go to","useful":0,"cool":0},"ItRLGdr2hHGwXTc0gP26fg":{"text":"Delicious. Beautiful.  Raising the bar.  A gem for magazine and new orleans","useful":0,"cool":0},"OifXIltUHB2Nw8UJnXZg5A":{"text":"Cute little bakery shop along Magazine St. where they have gelato, milkshakes, macarons, c","useful":0,"cool":0},"lWm8NpEEglFnFGZQDO8Qtw":{"text":"I just received my King Cake from Sucre and was very dsiappointed. Very dry and not much c","useful":1,"cool":1},"fdFOTkV_-J1leuKoO0nvQA":{"text":"I was in New Orleans for a business trip and decided to go here for dinner after realizing","useful":0,"cool":0},"IADYRG-CFgUyBEMXMTxt1g":{"text":"I always keep coming back over and over and over and over again. I even have the frequent ","useful":2,"cool":0},"2dk7vOTLrtlJb6Cqlf3N6w":{"text":"This review is only for their sundaes.\n\nMy friend who visited New Orleans a few weeks befo","useful":1,"cool":1},"6RsPW2BXgDCC1OhJt8UlsA":{"text":"If Willy Wonka and Martha Stewart had a child, SUCRE would be it! \nThis place is RIDICULOU","useful":5,"cool":4},"gQvxNz5H_BaO16DOoMIomQ":{"text":"Sucre is awesome. I love the ambience inside as well as the fact that there is seating out","useful":1,"cool":0},"4fi9CP5NmqlPMWBP1IOQbg":{"text":"Excellent gelato in a cool, modern 60's atmosphere. It's a bit expensive, but the quality ","useful":0,"cool":0},"6Qm12mTXEyd-eHSirdLMKA":{"text":"When I walked in I felt like I was walking into a tiffanys box themed dessert place! :D\n\nT","useful":0,"cool":0},"euGfX9s7_pWYWcbYCKIM5A":{"text":"King cakes look very pretty but are small and pricy-about $24 with tax.  Mine was not fres","useful":0,"cool":0},"AwJM_N5zQv5ehEywTOaZng":{"text":"Sucre is supposed to be a family establishment. I shouldn't walk in and have to hear about","useful":0,"cool":0},"UUpqTEK0oYEfL0SKM9t4Nw":{"text":"Everything is so beautiful you almost don't want to eat it... But you should. Everything t","useful":0,"cool":0},"1WPMd0cfP3e06-skFy_Eew":{"text":"I loved this place. the decor was amazing and the treats were spectacular!\n\nI would love t","useful":1,"cool":0},"SygfcH8gDePEhT8P_9rPow":{"text":"Stumbled across this gem while wandering around after dinner. The sweets and goodies are A","useful":0,"cool":0},"YIA33hOdAhdxmqeOx2Pf0w":{"text":"The place is so cute and charming and the cakes looked so beautiful. Unfortunately we were","useful":1,"cool":0},"GbWMcU9SLz806ZhGiWsZlg":{"text":"Very nice shop front and ample seating. I ordered one of their gellato specials off the me","useful":0,"cool":0},"4w0KjuEP_Xea4eC0UTmcIg":{"text":"YIPPEEE! I met Tariq Hanna yesterday and he's AWESOME! What a lovely, down-to-earth man!\n.","useful":0,"cool":0},"QbmN9cpLn8-vh6CE3f3Xug":{"text":"The most beautiful desserts that I have ever seen! Everything was so pretty.  We came just","useful":0,"cool":0},"rhrDZUbwo7odI-gKlFXBOA":{"text":"Love this place...but disappointed that on a busy Father's Day afternoon they feel it is n","useful":0,"cool":0},"gRwX9DPQ7Q-sleew_cyQZA":{"text":"This was my last stop during my NOLA trip with my mom, because of a recommendation from a ","useful":0,"cool":0},"jMKT23MYxPfaQCV8Q-tSPQ":{"text":"Oh Sucre Oh Sucre how I love you.  I dare not give you five stars but I have tinges of gui","useful":2,"cool":1},"kmjauu62vBdjno1Zf-RgKg":{"text":"This place is awesome. The gelato is amazing. Located on magazine street. Lots of great st","useful":0,"cool":0},"WTGJ0KvZpAfyK0CvDD87YA":{"text":"The brownies are amazing there! Get a glass of milk too!","useful":1,"cool":1},"wjAa-47dRDcSvp065Y4pyA":{"text":"3/5 i don't personally understand macarons.\n\nespecially ones that are roughly $2 each (8 p","useful":5,"cool":2},"6KYueKLL5c2DAMseRjDTsg":{"text":"Visited Sucre many a times at both locations, and I've tried all types of sweets except th","useful":1,"cool":0},"cinzyvbeWDRzlaejJ0e0LA":{"text":"Yum, delicious gelato and sorbet served in adorable pastel petal bowls (though I wish thes","useful":1,"cool":0},"3yK2ShS6R2-IUfBKUR_rHQ":{"text":"PEANUT. BUTTER. AND. JELLY. MACARONS. \n\nSucré is best known for their macarons. And the ma","useful":0,"cool":0},"gcmWY7B0wQRssKzA9BsT0g":{"text":"top notch. could be in paris or vienna. bravo!","useful":1,"cool":0},"UeIaVO-pRUHA-HGNtLenfg":{"text":"I love Magazine St, but I fawking love Sucre!  I swear it's like the food network came in ","useful":5,"cool":2},"Eg3mbt5bp_Ur3kVWFxl2iw":{"text":"I found Sucre on my last day visiting my bf during Thanksgiving break.  This is such a cut","useful":0,"cool":0},"F8_yj84DdBPTeMuBy6gQaA":{"text":"I would give Sucré four stars more because of the presentation than the actual taste. All ","useful":1,"cool":3},"69L2ZrfnGAlIcuRUAyU2dQ":{"text":"Amazing! They have the best selection of homemade chocolates, macaroons, coffee, espresso,","useful":1,"cool":1},"-qYvTGM4y6F9FHRX_qxp7g":{"text":"Best french macaroons ever! I am a devotee. The chocolate is truly delicious. It will chan","useful":0,"cool":0},"Mbe0CLPfyndEplIha59F6Q":{"text":"Great desserts! They now have gelato sundaes with lots of topping! \nI had the sugar free v","useful":0,"cool":0},"YnwqIF5MDf7sCyzX1MaOBg":{"text":"Everything in here looks so beautiful. The chocolates, cup cupcakes, macaroons, and desser","useful":0,"cool":0},"XKIY_EXmeJlSW-_GgHVCEw":{"text":"Very nice gelato/bakery shop. They have great selections of gelato as well as macaroons. G","useful":0,"cool":0},"lc_xfn2ejHAS4igEldlQDg":{"text":"Stumbled upon this place on whim while browsing on Magazine Street. What a lucky find! The","useful":0,"cool":0},"CaJ86O0tY1CS_hHRS-fhNg":{"text":"Had my very first king cake from here. It was AMAZING! I ordered it online and it shipped ","useful":6,"cool":4},"zjOq2pnVcD-bRx-QXQIVIA":{"text":"This bakery is a must-see destination for anyone who enjoys food art! This place was like ","useful":1,"cool":0},"-LX7hoZobNljD0lnERYNTA":{"text":"I can't say enough good about the vanilla malt, but the atmosphere reminds me of a cosmeti","useful":1,"cool":0},"it1kiUm_Fdh616KZPQPQSg":{"text":"The Lord has truly blessed the earth with Sucré... IM NOT PLAYING. This is the best desser","useful":0,"cool":0},"ZM07u-AGS-MIhg4UMJv-Sw":{"text":"What a cute place right on magazine street close to some neat little shops. \n\nI wish I had","useful":0,"cool":0},"jgj9Ee5057EB0mzqgtfJFQ":{"text":"I'm not much for sweets, but if you're going to buy chocolate, buy it here. The festival b","useful":0,"cool":0},"lAkjq5Un4PvMOc9TQRpSiQ":{"text":"I wandered into Sucre after eating at Le Petit Grocery down the street (a tip from the bar","useful":0,"cool":0},"T_xnmu0fvf4-zsdkWYoy0w":{"text":"I wish I could pack up this shop and bring  it home. We were able to visit Sucre twice whi","useful":1,"cool":0},"fMW2PqAK798XYgT0gXvtnA":{"text":"This was a nice surprise - a luxe, sweets shop serving great items.\n\nWhile they had chocla","useful":1,"cool":2},"GySMTvasAPYbxym6lnxwRg":{"text":"This place is awesome. The desserts all look good and gelato is particularly tempting. We ","useful":0,"cool":0},"ORr4cKk36pny6G48kDV9Cg":{"text":"Sucré is perfect for an afternoon treat! A friend and I stopped in and shared 3 (that's ri","useful":0,"cool":0},"4B9EUKsKhfJQUmHvrI7dpg":{"text":"I hate that I can walk to it...coz their deserts are the bomb. It makes it hard to avoid s","useful":0,"cool":0},"h5fyuA1ZucrD5-oKJIo0hg":{"text":"What an adorable place. Everything is so pretty, so perfect, so picturesque. Too cute too ","useful":0,"cool":0},"kMlkGzFdH0pzUGMb2w-0uA":{"text":"Frankly, I think this place is overrated.  I mean yeah, the stuff is pretty, but the last ","useful":3,"cool":2},"l8K-ifrkU-ic5oTFJLfEpw":{"text":"This truly is a special place! Really clean, high-class environment with friendly service ","useful":0,"cool":0},"nPRC-N5gZxco-ZBJlgoDmQ":{"text":"Yum!  This is an excellent sweets shop, with homemade ice cream, chocolate, cookies, cupca","useful":0,"cool":0},"iCOECEI-whg_DU2ST5M5xA":{"text":"Overpriced? Of course. Delicious? Absolutely!\n\nAs someone who doesn't love sweets, I dutif","useful":0,"cool":0},"H65IFeYCghnfqemle6CM7A":{"text":"The guy that helped me was super friendly and they bananas foster macron was probably one ","useful":0,"cool":2},"9gqxL75B8MIxbcG0h1e0wg":{"text":"I finally got to Sucre yesterday.\nI'm impressed and glad to have a good quality chocolate ","useful":1,"cool":0},"_3W9s6ZaZbpGY5HgDbYwqQ":{"text":"This job is too freaking cute. I'm in most recent trip to New Orleans I stopped in mostly ","useful":0,"cool":0},"uhARORvjnKNBKNkSlpV1iA":{"text":"Sucre is my go-to place for a special occasion sweet treat.  It is pricey, to be sure, but","useful":0,"cool":0},"OH2N2pVXqHJnWP-R8TE6Sw":{"text":"This place has an immense amount of hype for poor customer service and mediocre product. S","useful":0,"cool":0},"qX2FT2Tg96rntC7eIng5Ng":{"text":"I've had a slice of the cake in New Orleans and it was good. I ordered one for a birthday ","useful":0,"cool":0},"um4S2Pcm4Yt4GvsZBLqx1w":{"text":"So I went with my mom, friend and friend's mom to this place because they had such pretty ","useful":1,"cool":0},"JaHGOVQaByEY8vAAaXAimg":{"text":"Every once in a while I find myself in the car, frantically looking for a coffee shop or s","useful":9,"cool":7},"ZC9FupIf-lOEq218ZZcPGQ":{"text":"Sucre is such a lovely experience.  Make sure to skip the gelato.  I don't find their flav","useful":0,"cool":0},"dfEm8eBOoXMC9rdW_j6Jgw":{"text":"Must have when in town, in a really neat part of town with plenty of shops to visit. Best ","useful":0,"cool":0},"s-DpFhv6lND0qLGsghzigQ":{"text":"Suuuch a cool place. The staff is friendly and nice and upbeat, and the treats look AND ta","useful":0,"cool":0},"Us_6lxd4Z7_DnNacPQzH9Q":{"text":"If there was a place that could satisfy the pastry connoisseur in your group, as well as t","useful":1,"cool":1},"l96eC5ig305ZbKml32FhyQ":{"text":"They had some really yummy gelato....my fave was pistachio in very generous serving cups. ","useful":4,"cool":4},"v7QMGw3j9lRhMiWgZ2q0xw":{"text":"My husband and I walked from the Roosevelt Hotel to Sucre. It was a nice two and half mile","useful":0,"cool":0},"e1Ajai24UAt2VUIQ51GifA":{"text":"I love the morning crew here! And a couple of the guys I normally see in the afternoon are","useful":0,"cool":0},"lNCzu_GJR6ceVDl0aeCvNQ":{"text":"I want to hate Sucré because it's sooo expensive and everything is white/pastel and adorab","useful":0,"cool":0},"MJ4O7vbHQSAoQIskAB_ZJw":{"text":"I'll only come here for the ice cream... after I tried Kupcake Factory's cupcakes, I was s","useful":1,"cool":0},"h-NNgIhABVrp0sxXZghSfQ":{"text":"Now, I don't have the biggest sweet tooth, but this place is impressive.  Gelato, coffee, ","useful":4,"cool":2},"IGCLbWofqZRMtuEbIYdeQw":{"text":"Sweet tooth?? Anybody?? \n\nMy sister got my birthday cake from Sucre. It was the most delic","useful":4,"cool":5},"nUCC8I3gmv0_ctM_JvZsNQ":{"text":"I love this place - it's a very glossy high-end candy, dessert, and gelato shop. My mom go","useful":2,"cool":1},"G5yWw3t6iNfXfT9zhsRcFA":{"text":"Great place on Magazine to stop in for sweets (of the French bakery persuasion). I first t","useful":2,"cool":1},"jf8AXYzTTPw5m20ypx1QWQ":{"text":"Another NOLA gluten free stop!! All the macarons are gluten free- they had over 10 flavors","useful":0,"cool":0},"N-NdAHvl3axHE_52sjCyiQ":{"text":"All I have to say is that I WISH they had a locaton in Chicago. THE BEST cupcake i have ha","useful":0,"cool":0},"a06_3qYd2Bj0XM4Jwwf-sg":{"text":"One of the best king cakes in the city, the hype is true. The cake was more like a pastry ","useful":4,"cool":2},"Cuxs6ffSCkj821qMc2w1WA":{"text":"Would you like some overpriced diabetes? You've come to the right place. Do you like inges","useful":0,"cool":0},"QgkXBTYoNUHPECKFjpyn6g":{"text":"Sucre' tried the chicory macaroon.  Perfection!  The chicory was smooth and the macaroon w","useful":0,"cool":0},"v95S0ciZVm9bdm3k1vZM8w":{"text":"It's so nice having a place like Sucré in the neighborhood. Sometimes you just have to say","useful":0,"cool":0},"oG6rLn4t0sL3tCg0jueitg":{"text":"Delicious gelato with tons of flavor options. Beautiful looking cupcakes, chocolates (with","useful":0,"cool":1},"G6QQHfjE1zPJnN0HgUeW8Q":{"text":"They have the Best King Cakes. I've had plenty of kings cakes throughout my life (being fr","useful":0,"cool":0},"6I_4CRVuDvYKjEpIxmQEeA":{"text":"I really wanted to love this place because a client from NOLA sent us chocolates from here","useful":0,"cool":0},"tW5XVXfC3d4yexKU7Hu5QA":{"text":"Loved, loved, LOVED this place.  Such a cute shop that we stumbled upon.  They have gelato","useful":0,"cool":0},"Auvq1P41aSLAHBNU80RIfg":{"text":"the best dessert you will ever have! i think i fell in love with my boyfriend when he show","useful":1,"cool":0},"92UNTueGxXtzUwPMJRtmUg":{"text":"I am absolutely OBSESSED with Sucre. there have been times where i drove to New Orleans fr","useful":2,"cool":1},"fsu-H-IC0tQETBA4305MOA":{"text":"We came for breakfast to this little bakery, but it's probably better for deserts or in th","useful":0,"cool":0},"nxpMXYWXuZGMOkwyNIKOhA":{"text":"Cute store where the gourmet sundaes are the standout. The gelato is heavenly with interes","useful":0,"cool":0},"gVXquw7W46CQ_oGDfhgc4g":{"text":"WTH! Wow. Just do it! Get the everything NOLA sundae! It's 10 buck, you'll thank me... Oh ","useful":0,"cool":0},"LxjBCi9SoCB7XB2OA9SADw":{"text":"If only we had Sucre in California. *sigh* Yet another reason to move to NOLA. \n\nNot only ","useful":1,"cool":1},"xI8yB6KxInTWIzzU00wiqw":{"text":"\"Do you want to try one of our macarons?\" put a such a big smile on my face!\n\nThese macaro","useful":3,"cool":1},"D2pxSD2Od43jwVNX5e0ZqQ":{"text":"This place is cutesy & has a little bit of everything from pastries, macarons, & gelato! \n","useful":0,"cool":0},"U-eAYm2uK4GDVK98HAUucQ":{"text":"Yummy yummy in my tummy! I love this place. The strawberry cake rocks. Customer service is","useful":0,"cool":0},"20q6wRJSRqg9fM-bIFw8YA":{"text":"AMAZING deserts.  You must come here not only are they beautiful they are delicious. Also ","useful":0,"cool":0},"3FuIAZuRYriNZDu8eKIhuw":{"text":"Great desserts, nice atmosphere/interior, even more amazing sundaes, they even offered us ","useful":0,"cool":0},"D07moVxx80IoBMLnV5ZlbA":{"text":"Having lived around the corner for awhile, we would frequent this place every week!  The f","useful":1,"cool":1},"VAEMQEK1KRQbrHyldqahhA":{"text":"The gelato was amazing but the red velvet cake was quite mediocre especially at $6 for a c","useful":0,"cool":0},"X6jPTBjqRPtYJtqUAm7xNw":{"text":"I spent the summer in Europe and gained what I affectionately named, \"gelato weight.\" (whi","useful":3,"cool":1},"TPfAriBkHtBrydKN8aVKcQ":{"text":"The perfect balance a beauty, sweetness and decadence. The store is clean and attractive. ","useful":0,"cool":0},"JsW4oV_MdjC_2SJqZA85sw":{"text":"Great gelato and high class eats but a little too sweet in sugar and price for my blood.","useful":2,"cool":0},"WkD-BKD7cCiRSpeFoQ5ySw":{"text":"One of my favorite places for sweets. I love to go to Sucre when visiting New Orleans! Can","useful":0,"cool":0},"63uOzuYcb8ixP3Bp4OrRww":{"text":"If you love sweets you, you'll LOVE Sucre. Every single time I'm in NOLA I have to stop by","useful":0,"cool":1},"ZXwImYCcrqcUaVXYKZcuGw":{"text":"We walked in here after shopping. The atmosphere is adorable and has a great vibe. The mac","useful":0,"cool":0},"8nylvivCbKg2y_0z66x6_w":{"text":"A more relaxed environemnt than the one in French qtr. Lots of seating. Great desserts and","useful":0,"cool":0},"cqxO4h5R-kGqOv1Bxjz-GA":{"text":"Dessert heaven in my mouth, they have do many options that you have to be picky. I love th","useful":0,"cool":0},"WVjQWdiTwJZ11wUJe9hEvA":{"text":"I was once a fan, but they have lost me for good. The chef arrogantly feels like he knows ","useful":4,"cool":0},"0N1nZLGA46H-UV1cHJgDxw":{"text":"Great place to get a variety of fancy desserts at the last minute.  Prices are about what ","useful":0,"cool":0},"A0sMxsj9B8I39ugZHNg1hQ":{"text":"This place is made of dreams. Seriously. I've been here a couple of times and each time is","useful":2,"cool":1},"Uwk3Oh2yohhNGh3R7-Jgew":{"text":"Sucre has caused me to gain five pounds since moving into my new place.  I try a different","useful":1,"cool":1},"4JsWHG89Kbpf3o0Xuw6Q7w":{"text":"I stopped here because of the reviews. This review is based on the horrid customer service","useful":1,"cool":0},"3V9L2EuJO7AljbAVjPYBAg":{"text":"Fabulous Homemade Gelato....I could stop there, but I must talk about the eclair! It was t","useful":0,"cool":0},"BuNmFA4-8ipq8mTE7Oo4NA":{"text":"I'll come here once every couple of months to get my chocolate fix. I like getting a littl","useful":7,"cool":6},"GQ-b0BVAv1lHforNxJpw5w":{"text":"Friendly staff, with a replaced atmosphere. This dessert shop has some amazing treats for ","useful":0,"cool":0},"i5rzupT4NkQCXocw3g4Dfw":{"text":"Good candies. Good gelato. Service a tad sluggish. Definitely worth popping in when stroll","useful":0,"cool":0},"j3oxf3F0KucErapWCbp13w":{"text":"I came here for gelato and king cake. The gelato is pretty good, and the portions are fair","useful":0,"cool":0},"df4yLztI4QJXeq2T-7PDSQ":{"text":"So many things to choose from it's awesome!!! There is a variety of items you can get at t","useful":0,"cool":0},"Upn4LtFeKV3o9fKo8YbiAg":{"text":"Sweet sweet darling you have made me fat fat belly. This is one of those movie worthy date","useful":2,"cool":0},"a89jFEx8PWcRVvvMbWTbpQ":{"text":"This place is definitely more about the \"art of sweets\" then your average fro-yo place. Th","useful":1,"cool":0},"Cy8ei1vN6m1KwU4NIthmtQ":{"text":"I really loved this street, cute stores and restaurants, and all prettily lit. A friend wh","useful":1,"cool":0},"WMTJLiblYmWvj1KbqJptiw":{"text":"Everything sparkles.\n\nEvery item is a beautiful work of art.\n\nThis truly is as good as it ","useful":2,"cool":1},"JmpPLd8X-C8Ju6X2srSYxw":{"text":"A gourmet ice cream shop with a great selection of sorbets, set in the city's historic Mag","useful":6,"cool":3},"UE4QHLz_gkPpyntLU3Lj6g":{"text":"Absolutely underwhelmed on their Macarons!  The strawberry macaron was so beautiful, but w","useful":2,"cool":1},"L3gFmqmYbqWGrE4uadDrjg":{"text":"Beautiful store, delicious treats, clean bathroom, nice people. Gourmet ice cream, chocola","useful":0,"cool":0},"c58Jjtpw_X8PfhSMYGgd_Q":{"text":"Please think twice before having Sucre ship a king cake.\n My dad ordered one for me for Va","useful":0,"cool":0},"fDbVRmsQ26amu5JSed2IrA":{"text":"What's this? A present in the mail for me from a client? An adorable pastel-striped box fi","useful":7,"cool":9},"eFINPSX2XR90dOeZgs915w":{"text":"I had to move away from my best friend and I often miss her. Valentines day is coming up a","useful":0,"cool":2},"acm8Iv7t0NMHekeRzo52Ow":{"text":"I came here on a hot Saturday looking for something to cool me down while exploring Magazi","useful":0,"cool":0},"bzPUnOvsYsoK1KGUUDgrNA":{"text":"Sucre is one of the two gelato shops (almost next door to each other) fighting for dominan","useful":0,"cool":0},"cOL1rs3JCbkqsju24igoCA":{"text":"Stopped in here while having a walk down the shops of Magazine St! We got a box of 8 diffe","useful":0,"cool":0},"4gAe4KEBVUAZhWrW5nOxqg":{"text":"Just a regular sugar bomb place. Nothing special at all. Ordered the tiramisu, it's just O","useful":0,"cool":0},"o2YCL369jats_MiBmQn8VQ":{"text":"This is one of the best places I've ever been...amazing sweets and treats!  It was so hard","useful":0,"cool":0},"SwhMjYQOGQ4iDh0idsG5WA":{"text":"a great selection  to grab a treat .. sweets are one of my many vice's . these were lovely","useful":0,"cool":0},"T-lLD5NTEd-cuqfIOXXSVg":{"text":"it's a great desert boutique. my only concern is with the bright, airy, & modern interior ","useful":0,"cool":0},"-xdYSPSTkD3WB0URIALAPw":{"text":"This is a Macaron-only review.\n\nThe Macarons are pricey and mediocre - the cookie part was","useful":2,"cool":0},"F4nVSawA0kxbYgvWW6kIEg":{"text":"08/10/2011 - 09:30 am\n\nGarden District.  I totally forgot to check what the attraction was","useful":5,"cool":4},"6kZqd8kuSKGyuo7TgJCOFQ":{"text":"If Wonka's chocolate specialist Oompa Loompas were to ever bring sexy back, this would be ","useful":12,"cool":9},"vdgTLsheJAlC78Za-JhH4Q":{"text":"This is my favorite dessert place in the whole city. Not only are their desserts pretty, t","useful":4,"cool":3},"_9sJ-eZ4ZTCBlYitIuDM_A":{"text":"we got 2 cakes from sucre this past weekend for our wedding. A gorgeous 3 tier red velvet ","useful":1,"cool":1},"nIs1ihzJUjxxfnjOVNxjsw":{"text":"Being a huge sweet tooth, I had to visit Sucre because of all the great reviews. My boyfri","useful":1,"cool":0},"aXCFOQolvl_QjbPc07mIHQ":{"text":"If you have a sweet tooth, Sucré is your heaven.  Some of the best desserts I've had (and ","useful":0,"cool":0},"GCjorb-JdLX9fvFW4CuoYg":{"text":"Get the macaroons--especially Strawberry. Out of this world. Other macaroons flavors I tri","useful":1,"cool":2},"zCp58nBarv1I6lpBgmIq9w":{"text":"When you walk in it's very inviting. The decor and dessert displays are bright and makes y","useful":0,"cool":0},"oYdlPiT5tsxj548sQxafdw":{"text":"With the recent hype over macaroons, I've decided to make sure I visited during my road tr","useful":1,"cool":0},"V5lWT4VWj_Nx8IKgnAzB2A":{"text":"If I were strictly judging Sucre by the food, they'd get a 5 star rating now question hand","useful":3,"cool":1},"B3Soi5oBdRntrJ8L1-j2sw":{"text":"Everytime I go here for dessert I regret it! I always pay a lot and it looks pretty but th","useful":1,"cool":0},"-zC-HRx2twK9HgMKi9DczQ":{"text":"This has been a \"must\" for all of my recent trips home, but my last visit was slightly dis","useful":2,"cool":0},"MvrZOWrDUVPF9O8rWOn4lw":{"text":"I love macarons. Sucré never disappoints. I always get at least 8. Always be sure to try t","useful":0,"cool":0},"b3aupEHAUH2KgSmb7Oloxw":{"text":"After walking through the Lafayette cemetery i needed a refreshing drink, i walked into su","useful":0,"cool":0},"dl592Oe_zhTiqLnYEbjgJQ":{"text":"The macaroons are awesome here. They make them the right way and these cookies pack a flav","useful":0,"cool":0},"1Zspoitds0wmsZyVbWUU_Q":{"text":"We had the ice cream Po Boy! It was fantastic. The sprinkles really added something specia","useful":2,"cool":0},"gz0ztaWw6v_Dc9MgI9iSAQ":{"text":"Very good dessert, a bit pricey, charming location, would recommend for a treat but not an","useful":0,"cool":0},"bZ_zLS4n_cR22QmVjUCekg":{"text":"Honestly I wasn't terribly impressed. It was very busy. And the people were nice enough. \n","useful":1,"cool":0},"bn5T6CWcpYU5B56NVU0IYg":{"text":"Whenever I make a trip uptown for a Sunday Funday or just a stroll on Magazine Street, I m","useful":0,"cool":0},"m-nP7qBp3iIUvrPRLLBQRw":{"text":"Sucré is just wonderful. so just GO! lol My sister is a HUGE fan of macaroons. I don't get","useful":2,"cool":1},"JAUN2m11IPSmdV1tnJPlVA":{"text":"Everything Nola Sunday is the best!!! && the Strawberry Italian Soda is delicious! Everyth","useful":0,"cool":0},"bb8X-KWbHXvI4qnPNQjTAA":{"text":"Terrible attitude. The cashier was snappy and rude. Good vibes can make a place and bad vi","useful":0,"cool":0},"SjnP8F2pxozeQuOW9zZeKw":{"text":"I was killing some time on Magazine St and decided to treat myself to some macarons. In th","useful":0,"cool":1},"UN9AQzx4O-yM2B0JG6LQtw":{"text":"Honestly. It's the worst gelato I've ever had. Tasted like a syrup mix. I tried one of the","useful":0,"cool":0},"60yyR_-y1DNguRnvCx0UHA":{"text":"Best macaroons in the city!!! It's also a great place to get some pastries, I'm not a huge","useful":0,"cool":0},"dCc6pWLHaa5ujc2r5-MVXg":{"text":"We're visiting New Orleans for the first time and we got a recommendation to check out sho","useful":0,"cool":0},"motzb7r0Za8L9wVc9PUoXg":{"text":"My friend stopped here and got a gelato, she loved it.  The desserts look look phenomenal.","useful":0,"cool":0},"7OSzkiyZ-BE-0DDu8MBs2g":{"text":"Wanting a cup of coffee and small bite to eat while we waited for our 12:45 PM brunch rese","useful":6,"cool":2},"Nl64PmtUE-q7kzs0Joljyg":{"text":"I have to update this review because I'm addicted to Sucre cupcakes. I totally blame David","useful":8,"cool":6},"65KH2iHdAtwP15Vm8Iz1gQ":{"text":"Oh my sweet Sucre, how I love you so. Every sugar addicts fantasy comes alive at Sucre! \n\n","useful":1,"cool":0},"lQIHvQq0Bn9Bn6Zak_56Vg":{"text":"This place is a must-stop if you are on magazine street! The gelato flavors are fantastic ","useful":1,"cool":1},"qO13M0Dh6lDOgQh6Qft-Ew":{"text":"Their ice cream and sorbets are great but the actual food is lacking.  Their wedding cakes","useful":3,"cool":1},"92N4MM-2pQXPKtjEqj44SQ":{"text":"We loved this place so much we came twice in our 24 hour stay in NOLA. The Gelato was real","useful":0,"cool":0},"V1gyBfRqz2L2-kZf6NpsNg":{"text":"I just stopped in for a cupcake to go for my wife and I to share on the streetcar ride upt","useful":0,"cool":0},"7XJmkBrbvHneEZm6rtHX8g":{"text":"Sucre is a high-end patisserie chocolatier in Uptown New Orleans. I have frequented the es","useful":1,"cool":0},"9EZ6ARLGbtT0WhPdoqvcwg":{"text":"Pistachio ice cream has me feeling like I'm back in Iran! Pupelato has me feeling like I w","useful":0,"cool":0},"jh8XZKx4IbnsTYykiK6F3g":{"text":"Sucre was a delightful surprise. We were visiting the garden district and wanted to get a ","useful":0,"cool":0},"1SnJpt8W5armTw8NajZQPw":{"text":"2nd time in NOLA. 1st time in Garden District. These macaroons are so delish and melt in y","useful":0,"cool":0},"bAuFL_s0e-dyOUbaCbMppg":{"text":"MMMMMMMMMMMMMMMMMMMM, oh boy!!!!!!! I am a sweets fanatic so I was really excited to stop ","useful":1,"cool":1},"AgVLotGw1mF3rkVeQEGEIw":{"text":"Just got totally ignored for like 5 minuets need to hire better help. Was really looking f","useful":0,"cool":0},"LW2aRJGl7rQDtKaU7jGCjA":{"text":"The Gelato that I tried was wonderful.  \nNice looking shop with a lot of confection option","useful":1,"cool":1},"Fpf0fH1rwz8UnMWogZM5zQ":{"text":"I remember being in the Garden District and me and my friend Lisa found this wonderful pas","useful":3,"cool":3},"GdNA-_bauTDEe0AmFn_N4g":{"text":"The sorbet is out of this world!!! If you're wandering around the garden district this is ","useful":0,"cool":0},"cHkpzuN_NCdq_NWbzbGbzg":{"text":"Pistachio macaron was the best I've ever had (and I owned a bakery for 6 years ) better th","useful":0,"cool":0},"L9zXv88Y9ZVaCKbHIcjJeQ":{"text":"We really liked the gelato, and the strawberry champagne bomb was great too. The woman who","useful":0,"cool":0},"Km59sktQTTwKanNMSuXHXw":{"text":"Had a great peanut butter milkshake handmade and it was fantastic!!!\n\nThe shop is beautifu","useful":2,"cool":0},"x8GyueDLpcezZQqkUJfKVA":{"text":"Great gelato place, I stumbled upon on magazine street. They have numerous flavors to tast","useful":0,"cool":0},"hh03gexleRJxx-X0PyP8EA":{"text":"Just a look through the window from the sidewalk gets you excited about all the great trea","useful":1,"cool":0},"XmZF5GH4-cuSIWNjW5tf0A":{"text":"This is my dream shop. Sucre was absolutely amazing. The decor, the ambiance, staff, and d","useful":1,"cool":1},"9lHoZ_4ao0TdEoicoo6qjg":{"text":"A zillion flavors and a upbeat atmosphere makes this a win in my book.  I had the banana w","useful":0,"cool":0},"8E-1u8QNepenmeSY0kjiuQ":{"text":"This is heaven! I didn't know what to order because everything looked amazing. I ended up ","useful":0,"cool":0},"4ZkYQjX3NYdtZhvnlWip9g":{"text":"No lie, came here after a long day of walking mainly for the opportunity of a clean restro","useful":0,"cool":0},"0K4Cy3pwLdYeVpXO2zcTRw":{"text":"If you like sweets then you are in for a real treat.  A gourmet pastry chef fills his disp","useful":0,"cool":0},"_aH1PMzGedepugHEGQ4Mrw":{"text":"Huh, I don't get the hype. Beautiful shop but mediocre product. \n\nStopped in with my wife ","useful":7,"cool":5},"Oo1RbAFU0cOWvb09k8Kn-A":{"text":"We stopped in here while in NOLA for some treats and Sucre didn't disappoint. I was lookin","useful":0,"cool":0},"zPs_A5YXMNeRCu_F8pMMZg":{"text":"OMG. From the moment my eyes laid on the window display at Sucre (Valentine's Day and Mard","useful":3,"cool":1},"uwWrIz1jk0IZtxVqc6XuJA":{"text":"I love going to the wonderful bakery! The gelato is so delicious, creamy, and tasty. The a","useful":1,"cool":1},"W4YrWGEh2cWP_kK8evO1UA":{"text":"The sweets are excellent and I loved the Macaroons. Friendly staff and excellent environme","useful":0,"cool":0},"cYCpp4hKlW4mmWcomg5_-A":{"text":"cutest gelateria/bakeshop ever - could spend all day everyday here. perfect pastels - impr","useful":0,"cool":0},"tj3bV6jxbd0hplwpAoNwdg":{"text":"My third visit to my favorite bakery in New Orleans.  Today I bought mom some praline coff","useful":0,"cool":0},"xG6HrNPKSknNdqAdMExToQ":{"text":"This place is amazing. \n\nThe gelato is truly special... pistachio with toasted almond was ","useful":2,"cool":2},"yUSFB39zPlD2Hj4Dm3ZoJQ":{"text":"Nothing can be said about this place, you have to experience it for yourself. It's the kin","useful":0,"cool":0},"-7wCY58XTTz8qMaAV7nd3Q":{"text":"Beautiful shop. Pecan Macarons were the best of the bunch.  The size of the macarons were ","useful":1,"cool":0},"lBjcsU41s97o2fbMuz56TQ":{"text":"best pastry shop in town hands down\nfrom the interior design to the quality and appearance","useful":1,"cool":0},"qUl5aBRzz2x5zPGbjVvEEg":{"text":"Such a bright and happy spot!!!  I like going here after dinner for gelato or frozen hot c","useful":0,"cool":0},"D9ZazsVtGjdEblLsUHO-WQ":{"text":"I've been here both times I visited New Orleans. the desserts are so beautiful and tasty! ","useful":3,"cool":2},"WNnmjvvIB1xGzLHSvjwx2A":{"text":"Such a cute dessert place! A little pricy compared to most of NOLA but doesn't disappoint.","useful":1,"cool":1},"4CXDjLReXqWF6zWKtmqPjw":{"text":"Holy Christ almighty. Where can you even begin when it comes to Sucrè? The baked goods, th","useful":1,"cool":0},"JY6gFj9uwCbmVpauB_64lw":{"text":"This is my wife's favorite place for desserts. Always end up here for a treat on date nigh","useful":0,"cool":0},"gRd-T7HihkERKpZ2-dZ9LQ":{"text":"This was awesome on a hot day. However over $20 for three small gelatos and a regular Ital","useful":0,"cool":0},"FcYG5WbOAVWHP-AobY1a_g":{"text":"Me and my girls took a trip to Nola for my bday! We ended it by going to Sucré. CUTEST lit","useful":0,"cool":0},"yjqUodO_4jnwU13CeYx77A":{"text":"Gelato was pretty good, and I tried a couple of their treats, which weren't bad.  I very i","useful":0,"cool":0},"6IHZ9_G7V6GIXEwKY4X9AA":{"text":"AMAZING PLACE! This place is like a fantasy candy land come to life. The confections are a","useful":2,"cool":1},"QDkfpD4pDYXGSv19MDbOpw":{"text":"Pastries are overpriced and not really delicious. But they sure are pretty to look at!\n\nTh","useful":1,"cool":0},"DbjMRQlemRbnE1_FuS91zA":{"text":"I made my way down toward the garden district around 5:00 and wandered the mansions while ","useful":2,"cool":2},"Wm4nuqgbBsJ-HPZkvThjbg":{"text":"Visited NOLA over the holidays.  This was one of the best parts of the trip. Chocolates ar","useful":0,"cool":0},"0WUVQClUw2hZ8U798Fn5xg":{"text":"Quick stop to get a sugar buzz for the afternoon! Chocolate Hazelnut gelato and a seriousl","useful":3,"cool":2},"qADMrqrESS_waUyGXIZNdA":{"text":"Sucre is billed as a \"sweet boutique\" and - my-oh-my - it is sweet, indeed.\n\nWalking in to","useful":4,"cool":3},"MF4AWrXz6_IGCYP3kdszfg":{"text":"Great bar. Tasty food. Oysters rock with fresh flavor right out of the gulf. Servers frien","useful":0,"cool":0},"OpS1P1PWYpybeEz1UggXxw":{"text":"I would have given 5 stars for this place but one thing that I could not do it was coffee ","useful":0,"cool":0},"DQA7ElvxXslLKSEQ6uCVVQ":{"text":"Completely lived up to my expectations. The gelato is AMAZING. I can't wait to go back and","useful":0,"cool":0},"KVaYdrHE3A7-QhIPu298EQ":{"text":"Nectar cream. Nectar cream. Nectar cream. Nectar cream. Nectar cream. Nectar cream. Nectar","useful":0,"cool":0},"HOaBBvxeLH3qmjrxHuzxzg":{"text":"Beautiful presentation of their lovely sweets! \n\nThe staff was so friendly and helpful.\n\nT","useful":1,"cool":0},"U3siCbTx_EE7pLuF4EwbSA":{"text":"Sucre is a sweet boutique full of decadent chocolates, cake and gelato. We bought two boxe","useful":0,"cool":0},"xFe_cWetfFdpNDyyD5A7HA":{"text":"This is a great place for an afternoon treat after taking a stroll down Magazine Street wh","useful":1,"cool":1},"gRjtPmrByM9LMZx0rm6o-Q":{"text":"Delicious ice cream, coffee, drinks, macaroons, pastries, cakes ...  I was all amazing and","useful":0,"cool":0},"hhC19Kj92MOm-R-e4w4xTQ":{"text":"So. much. yum. The ice cream/gelato was awesome, the malted milk chocolate was amazing, an","useful":0,"cool":0},"2ZOyq79u_ur3lXnAnvafHQ":{"text":"Sucre was arguably the best dessert experience I had during a recent weekend jaunt to New ","useful":3,"cool":1},"T81uEuWQUG3Qyj57MsmNqQ":{"text":"Updating a 2009 review, over a decade later.\nI have to say Sucre was so different than any","useful":6,"cool":4},"cdSSPByopNx6defE3rBrRg":{"text":"I am probably one of Sucre's biggest fans. I fell in love with the place when it first ope","useful":1,"cool":1},"O_Z3voApCGYBZ89ECob_0Q":{"text":"Nate told me we can come back tomorrow cause I wanted everything! \n\nLife changing desserts","useful":0,"cool":0},"WGCqJy0e-420zYI1DjkbSg":{"text":"Best place for dessert in New Orleans. They have homemade gelato, artisanal sundaes, milks","useful":0,"cool":0},"yEUOEoXkdn1eWSbtGFHLYQ":{"text":"Best recommendation we got while in NOLA. Their gelato and sherbet is the best we've ever ","useful":0,"cool":0},"vorgwwkb-g3spZuIq6jxKw":{"text":"I've been to Sucrè many times in the past, and I always order one of their king cakes arou","useful":1,"cool":0},"a3-JTIyZq2Ox1XgX4t-IIQ":{"text":"I thought I had already reviewed Sucre but I guess not.  I've sampled the fancy chocolates","useful":3,"cool":1},"rd16xwiKg8NTMBs9WAGvgA":{"text":"I Had a Date Here Once...\n\nWe met for cocoa. So consider this my cocoa review.\n\nI don't ca","useful":16,"cool":10},"opsoIvwjPFLqV-8bRMYXag":{"text":"Great spot for dessert! Highly recommend the coconut basil gelato (dairy free for those of","useful":0,"cool":0},"ZPL3ty9Sq5sK141BYmBPXw":{"text":"I had a chocolate cupcake delicious! I wish I had ate it while I was in New Orleans. I bro","useful":0,"cool":0},"mWz6H8gfrYmAS8_BEKzxtQ":{"text":"It's our neighborhood spot to grab dessert. We enjoy their macaroons and gelato. Always re","useful":0,"cool":0},"G0HQSDqmnmpVLPN3_RkFGg":{"text":"Visiting New Orleans and stopped into here the first day. I picked out 15 hand-made chocol","useful":0,"cool":0},"H7t4CxRBqUi0Zf1aWuGHvg":{"text":"This is a must try bakery! I went in for French macaroons on vacation from Missouri and wa","useful":0,"cool":0},"sh-LDlnrNMh2ZlIVlq_RJQ":{"text":"This is a beautiful, modern, clean and extremely expensive sweet shop.\n\nThey have baked go","useful":1,"cool":0},"ws5-g1u3B93PmE9gNdKh5A":{"text":"Me and a classmate made a trip to New Orleans (before moving here)and gave Sucre a try...W","useful":1,"cool":0},"dQ2FYSIOhwuOkAT-y9AiYQ":{"text":"This place use to be top of line dessert shop. Now ALL seats are torn, ALL the tables were","useful":9,"cool":3},"t7AhxvGoo1lg07DKe-DtoA":{"text":"We came here for a quick pick me up on afternoon while wandering through the garden distri","useful":1,"cool":1},"PhzXRXZquVOwzYgp53SjaA":{"text":"This place has it all. From out of the ordinary yogurt flavors, to cupcakes topped with de","useful":7,"cool":9},"E7tmyFX1r4i5ZRP5trWGXQ":{"text":"I just tried their King Cake and it was fantastic. The ice cream, pastries, and chocolates","useful":0,"cool":0},"iBD2ieIBtMBx__0knV7wiQ":{"text":"If you're already in the Garden District, you must come here. Sucre is on par with some of","useful":3,"cool":0},"S_tb46Un_kls-8U8yADQww":{"text":"Very much enjoyed my tropical coconut basil and mango sorbet - refreshing and perfect in t","useful":1,"cool":2},"bX3KBHKdcgH94ws3XzrimA":{"text":"I fell in love with Sucre marshmallows on a trip to NOLA two years ago so I was on a missi","useful":0,"cool":0},"Ywfd5Y82LS_nrK5b3MGM-Q":{"text":"This place is the definition of the smiling face with heart eyes emoji. It has everything ","useful":0,"cool":1},"AEvz3VMFRud-kkuPRSuwKA":{"text":"I had such a great experience at Sucre. I went the night before Mother's Day to pick out  ","useful":3,"cool":3},"8Zu6lHaixMdNPvd5chcx2A":{"text":"Guys. The dark chocolate raspberry sorbet. I don't know what kind of sorcery this is but I","useful":1,"cool":1},"5WvMY2qUiYr8rpMinp4xmA":{"text":"Located in the heart of Magazine Street sits a great dessert place that mot only serves ge","useful":1,"cool":1},"0WsgTSzHVutGrVwvY-civw":{"text":"We got a cupcake and a sundae. Both were delicious, but the cake in both desserts seemed a","useful":0,"cool":0},"D6EwqpEfVFzwBaH7cOKJHw":{"text":"I've passed this place a million times and finally decided to stop in a couple of days ago","useful":1,"cool":0},"UNOVJ1VRmfXM_8txdFpKeQ":{"text":"I love gelatos here! Cakes and macaroons are bit pricy, but they're good! Good atmosphere,","useful":0,"cool":0},"76Fw28IAZQ9Eu9JORy_hNQ":{"text":"DESSERT HEAVEN!!\n\nokay, sure, I'm biased.  I love dark truffles, macaroons, and wine -- al","useful":5,"cool":5},"YjAEmd-YYy32bKbq5-AvzQ":{"text":"Every year when I visit New Orleans I make it a point to visit Sucre for several reasons. ","useful":4,"cool":2},"3TJUKfwijYUT908_PVWmlw":{"text":"Me and a friend stepped in here during a rainy magazine outing. We were pleased to be welc","useful":0,"cool":1},"F_Mxj6DZB7WsdxP0hxL_xQ":{"text":"Walking down magazine, we stumbled upon Sucré, and thank God we did! Samples abound! I tri","useful":1,"cool":0},"Gvgn9nTDTQr2ORKJmDmrkg":{"text":"Pretty good place for a good and quick desert. I love the blackberry Italian soda and the ","useful":0,"cool":0},"RE8sHczl2Bf-3bN4ZaC--A":{"text":"YES.  YES YES YES YES YES!\n\nEver since returning from Paris, I've been on the prowl for ec","useful":1,"cool":1},"aYccbKmcxEwzy51-9qCDaA":{"text":"Very pretty store ! It's made to take selfies lol also the Macaroons were amazingggggg! Ev","useful":1,"cool":1},"qh-Pwlmo4OuaUInOMoRueQ":{"text":"Went in when it wasn't too busy. They let me take my time choosing two flavors of gelato a","useful":0,"cool":0},"sv3TOcdvZX5FFS2Hn87TOQ":{"text":"I had a great experience at Sucre. I've only been once, as my sweet tooth is not as well d","useful":3,"cool":2},"tPHjyf92j1ZNTVaFp80HJg":{"text":"Delicious!  We happened to park in front of Sucre while down on Magazine street.  I had th","useful":2,"cool":2},"xjSFe9V41QqlLCUylN608w":{"text":"Pricey, but man oh man, I loved coming into the store just to stare at the gorgeous cakes.","useful":0,"cool":0},"j4Dh_ZRAFPXTJuwnWELs3A":{"text":"I must really be in the minority when I say this, but Sucre just doesn't do it for me.\n\nWh","useful":4,"cool":3},"VLykToKo8HxclTgo9dqeqA":{"text":"My husband and I stopped into Sucré as part of a foodie tour of Magazine St/the Garden Dis","useful":0,"cool":0},"psqPFtROMZAUV8Nvr8Q7rg":{"text":"Everything about this place from the decor to the treats themselves was elegant and adorab","useful":0,"cool":0},"u8oTfKqvlqrIqXkDimadmg":{"text":"This place is great. All kinds of dessert, chocolate, and ice cream. Something for everyon","useful":0,"cool":0},"kyrKb8rPdXuQT0nxe3Naxw":{"text":"Tried their ice creams, cupcakes, and chocolate. Pretty displays but nothing extraordinary","useful":1,"cool":1},"k8_ooGlFb8CDUqAg5pEn4Q":{"text":"Great stuff here, great little shop and a good stop on Magazine","useful":0,"cool":0},"l2ER6g_79yY3h6PvR-CyHA":{"text":"Sucré you are totally magnificent, I had a wonderful experience here yesterday. The vibe i","useful":0,"cool":0},"nwf3Zno2odwmCpiPFnKAyA":{"text":"Oh, Sucre, you are so cute. \n\nI stopped in here on my ramblings tonight on Magazine Street","useful":3,"cool":1},"azn8qCRP6NGKGKTdwYR-KQ":{"text":"Sucre is always fun for a treat but I think the interior and cute aesthetic is what it's r","useful":0,"cool":0},"Z17TDBvlFa9KyAs9G2bIVA":{"text":"Such a lovely little pastry shop. Everything we tried was delightful and the staff was so ","useful":0,"cool":0},"HoyIChZoqJjxzha-mbwkKQ":{"text":"I LOVE sweet treats. Especially when they are PRETTY.\n\nSucre accomplished both aspects.\n\nI","useful":13,"cool":12},"LDEBICpXQ0_MSrPWJ5e0Eg":{"text":"Stumbled upon them while walking through the area. The ambiance and sweets were all gorgeo","useful":0,"cool":0},"JcjdUEgJisKOWGPeR4CIAg":{"text":"I'm somewhat surprised by all the positive reviews of Sucré. Do those who love it here onl","useful":10,"cool":8},"qQx2aYiFSGez9AO1na4Cug":{"text":"These macaroons are like so good. They literally taste like Jesus made them and just ship ","useful":0,"cool":0},"3lqYwqha5ffq7LP1yaMASg":{"text":"Walked in expecting gelato... no gelato. Bought 3 pastries instead: vanilla cupcake, raspb","useful":0,"cool":0},"OdIGctFHiXe6WsV8j1vcfQ":{"text":"Delicious dessert in dreamy pink setting, even the bathroom! They have sugar free gelato w","useful":0,"cool":0},"-HnZMVEYFlUFwn27sW1PKg":{"text":"Macarons are expensive and aren't the best I've ever tasted but are REALLY pretty and are ","useful":1,"cool":0},"tcMonxP49RhirYCBFOKv0w":{"text":"Really nice place to go when you want gelato and to try their different desserts. Their ma","useful":1,"cool":1},"t1tYbmhd-q36z8W9LkBWkA":{"text":"Hot hot day walking around the Garden District so I came in for something cool. And for ai","useful":2,"cool":2},"z6OcGjoKO2bYum22WpYdFA":{"text":"It is amazing and worth going! The desserts are fresh and delicious and incredibly gorgeou","useful":0,"cool":0},"WLgK0AFFlvgGMTHu8exNqg":{"text":"Love their cute desserts! The cupcake frosting is so delicious, but not sickly sweet. Here","useful":0,"cool":1},"4y6wcAgWFRjLY42aCWAf1g":{"text":"I'm a diehard French food lover; so when I saw Sucré in my preliminary NOLA research, I kn","useful":1,"cool":0},"_Bs-h2YML7yztN2U6fopGg":{"text":"The decor was ERRTHANG!! I came to that street for The Vintage and beignets...but they're ","useful":0,"cool":0},"LBlTAHYy4MuycBfvVM1vZg":{"text":"Always a fantastic selection of chocolates, pastries and our favorite macarons. They have ","useful":0,"cool":0},"lMpEUsc_pQbK7-0sP5IZcA":{"text":"Great for dairy free gelato!  Also, the regular gelato was delicious.  And the shop is sup","useful":0,"cool":0},"EFXEb4nKhzvoTBqYHZ1fAA":{"text":"Sparkle, sparkle, so darn precious\nThis macaroon could be a necklace\nBarbie's favorite pla","useful":5,"cool":5},"D-Mlfa0gZ6F6_4hBa3GTEQ":{"text":"So much YES to this place. \n\nTHE GELATO. Unfortunately I discovered this on one of my last","useful":0,"cool":0},"ZV9Zs1CoZxTUIZ1-TbrPPQ":{"text":"We were so delighted to learn that Sucré was reopening and, with the original recipes.  Bu","useful":0,"cool":0},"favfjW6Q8mCNVczqYPfxsg":{"text":"The service was phenomenal and the drink selection was plentiful. I didn't feel like there","useful":1,"cool":0},"Y8OdzbUWHCD6W5rmw5eOMA":{"text":"First and for most thank you Shelly for your suggestions and great customer service. You'l","useful":1,"cool":1},"S_vxzhugp1zIT45-EooWIw":{"text":"I walked around and stopped by this place after shopping. I couldn't pass up such a gorgeo","useful":0,"cool":0},"D9eMpapCrn08pFZM2MJeTA":{"text":"Beyond disappointed! Had this macaron tree made by Sucre. No box. No appropriate packaging","useful":0,"cool":0},"73L7UlJTaDQgr6z_IBU9EA":{"text":"Adorable place, great customer service, the desserts are delicious, I especially love the ","useful":0,"cool":0},"ecXiMP8BYeZq_f9BHAu_Dw":{"text":"I am not ordinarily a chocolate/sweets person, but this place is very good. There are many","useful":0,"cool":0},"T4wuasPXSBNW78Pv2aqtXA":{"text":"So the macarons are heaven on earth. I could easily eat an entire box (or two). And the lo","useful":2,"cool":1},"Y-5Dca1ODA3eLLZauSEzgA":{"text":"A very cute little shop with good gelato and macaroons. If you need/want to take a little ","useful":1,"cool":0},"Jquxrvy3JP5G_Z05LuXT4A":{"text":"The strawberry macaron was the only one I actually enjoyed. The other 5 macarons were way ","useful":1,"cool":0},"6KsthDSBGHaV01Yquz4yqA":{"text":"One of my favorite places for dessert! Gelato, cupcakes, macarons and the prettiest variet","useful":0,"cool":0},"0J2qIkw1kXn4TATD_bfvBw":{"text":"I had the Lemon olive oil berry cake and it was absolutely delicious I couldn't put my for","useful":0,"cool":0},"IM0JcbrnrLNJDgBHJPHw1A":{"text":"Do not get espresso here if you enjoy good espresso. Espresso itself has a slight bitter t","useful":0,"cool":0},"g9u1Nl0Yr7H_hlBTqaebPw":{"text":"If you are craving something sweet and smiling friendly staff Sucre has both. The employee","useful":0,"cool":1},"NWNp5CE2wt4Qqs-S_olYqA":{"text":"Visited the newly reopened Sucre and it was just as great as before. New color scheme but ","useful":0,"cool":0},"q1z8fX3otjd5tCv8t8WVtw":{"text":"Typically, upon entering a dessert bar decorated in baby pinks and sky blues, you are gree","useful":2,"cool":1},"TT5gui5T-KYg4rVaLZScQw":{"text":"Great place for a dessert, kids loved the ice cream and cupcake. A few tables outside made","useful":0,"cool":0},"0xbnqmVXfLMCaVIbyH_dIQ":{"text":"Opened!!! Finally!!! The amazing chocolates and macaroons are now available again!  A choc","useful":0,"cool":0},"zaXNAQu8hyoXxuEh_yph3A":{"text":"Full disclosure: I have not been to the new location since, well, COVID. However, if this ","useful":0,"cool":0},"28_i2Vcgdn7hMwtYVS6laA":{"text":"I love everything about this Sucre. The location is fantastic, the shop is lovely and the ","useful":5,"cool":5},"imhyDsOWZft9hArmcdtdsw":{"text":"SWEETS\n\nNot only is this place fancy schmancy, it's expensive! \n\n$2 for a macaron smaller ","useful":6,"cool":4},"WoDyh_0feszlEf2W2Gq3Iw":{"text":"SO I TAKE EVERY0NE OF MY VISITORS HERE\nIt, the presentation, staff, space, price point, de","useful":3,"cool":2},"26mQJvDyz_2urBDfg4Ztjg":{"text":"It's reliable; it's a nice interior with fancy chocolates that usually gets my fiancé exci","useful":2,"cool":0},"1dpOk6oqojZcJp2g2JGckQ":{"text":"Amazing location, great ambiance; the cupcakes were bursting with flavor but a very overpo","useful":1,"cool":0},"GrRc_d4Q7s9kFxS2Fa3kJg":{"text":"Being a recent culinary graduate I knew I had to stop here on my vacay...boy was I glad I ","useful":1,"cool":1},"ikIaAC4l6Z45U-NMr1TODA":{"text":"The coconut basil gelato was so refreshing. The flavor is a bit tart, in a good way, and t","useful":1,"cool":1},"5dWh26ZFDPOR9hrNKoDBEw":{"text":"Neat and clean place with some of the best dessert art works and ofcourse it taste delicio","useful":0,"cool":1},"W-WMYyxi-BQZyiQgiSxE_g":{"text":"They're always so busy and I was on my run back home and there wasn't a lot of people in l","useful":0,"cool":1},"HI6shGyZlTyplFhUhvG0zA":{"text":"This was definitely not my first time here nor will it be my last, but I have to say that ","useful":2,"cool":1},"ps07H9xFtmKQt5hTWoqW-w":{"text":"This place is real deal, top tier dessert here!\nMacarons were on a whole other level, best","useful":0,"cool":1},"ccwZxr_mqsGprHZIS26k9A":{"text":"This place has hands down the best gelato I've had ever. \nI ordered the toasted almond and","useful":0,"cool":0},"xh3j4hdeVeqL_ZTLWoAi8A":{"text":"While walking down Magazine Street one evening I decided I wanted something cold. Voila, t","useful":2,"cool":1},"_hryEpYSdzHim4Rzfzg_Lw":{"text":"Tables outside were filthy. It's clear no one cleans them between guests. Not good conside","useful":0,"cool":0},"VsGCR57n7OUEbgv_2udXoQ":{"text":"Not really feelin' Sucre anymore. Their gelatos are straight, can't really screw that up. ","useful":3,"cool":0},"cv3cC6K_B-eTxuhCfOCsNg":{"text":"Gelato & french macarons- I have died and gone to dessert heaven. Words cannot express how","useful":1,"cool":0},"Jm5rt3HmbyKGsGb6UhooOA":{"text":"The shop is beautiful, and the staff are friendly, however they've got a lackadaisical att","useful":1,"cool":0},"xVHl-hcK1__1yU4u1tejVw":{"text":"Very cute, nice cafe. Lots of diverse options for sweets -- chocolates, gelato, cupcakes, ","useful":1,"cool":0},"MzE2CzawSwhsaKiDWdPNxw":{"text":"Here is a place you will always find a unique sweet treat.  Many items use I season ingred","useful":2,"cool":1},"0aDql1dNszWGRd1tUZYufw":{"text":"Very clean place! They have gelato and macaroons and gourmet chocolate.\nPrices are pretty ","useful":1,"cool":1},"_uQGNNbBVn7kAWh1AgBXMQ":{"text":"This is the sort of place tourists like me get a big smile! How lucky for the locals to ha","useful":2,"cool":1},"gIsmbAct00vGphJRtZRSzQ":{"text":"Sweet, sweet Sucre.  You make my lips quiver, my mouth water, and my brain sigh with pleas","useful":2,"cool":2},"vHbQjxmO7tLN7NjO9n1vpA":{"text":"Sucre is great.  Food, ambiance and service all show up strong.  Here's the breakdown.\n\nFo","useful":1,"cool":1},"7EfJqZWHP2kPozc0do_vRA":{"text":"Sadly, this is not the Sucré we have loved for years. I know. I know. They sold and bought","useful":1,"cool":0},"wDEA1DsSS0ih6CCMeusCZQ":{"text":"Wonderful presentation. Tried chocolate cake with vanilla gelato and chocolate pebbles. Ev","useful":0,"cool":1},"m9u39dD41XCEtwHvwRFjqQ":{"text":"If you want to wait 20 minutes for an idiot to weigh a piece of chocolate bark for people ","useful":1,"cool":0},"VpkW5T8Cs_8xEYFpvObMAA":{"text":"I have heard Sucre mentioned a few time since moving to NOLA. I decided to check out this ","useful":0,"cool":0},"Ib_O83F81IqUOCyv2oZsuQ":{"text":"This modern shop doesn't seem to quite fit in with other shops on Magazine: it's a little ","useful":3,"cool":1},"0-Sig_38u-UaJSqmtYWpZw":{"text":"Sweets like you have never seen before. Super friendly staff. Stuff looks fresh too.","useful":1,"cool":1},"LL5oInHEPnSgxEIcfvFyMA":{"text":"I stoped in for a fancy desert to take home. Pb & j doberge was delicious, pineapple upsid","useful":0,"cool":0},"cJ0ff_Gjiq0HYaMRL9SyNw":{"text":"BLUF: No, you probably don't wanna come here weekly for ice cream after dinner but when th","useful":0,"cool":0},"p1ZiJE1Kcq14ro4pqwr3Tg":{"text":"Not many things in life are as balanced as macaroons. These assorted little treats have th","useful":4,"cool":3},"yOzCXkoivsnQ8PGuGTdjHw":{"text":"Sucré has my heart! I've been coming to Sucré since I was a kid and they are simply the be","useful":0,"cool":0},"_uCTwu1nr-BvBMv_0cb9OQ":{"text":"Vistor to NO and found this place through Yelp. Awesome desserts ! Definitely recommend th","useful":0,"cool":0},"9H_19z7SvWR-I4szAfmtuQ":{"text":"Party like it's your birthday! Sucre's New Vanilla Confetti Cupcake was so fluffy, soft, a","useful":1,"cool":2},"IKpib3Qyxew_YJ4eGzcsrA":{"text":"So the new Sucre is here. This was a regular stop for me and Shari V when we needed a late","useful":4,"cool":3},"t11kgXsBxoPHBSuVcpT20g":{"text":"This was a great bakery/ sweet shop with the previous owner but the current management is ","useful":2,"cool":0},"YKc7iMr_cf1ALwWzAzg-UA":{"text":"I'm not a huge fan of sweets but when I'm in the mood they have to be homemade & amazing! ","useful":0,"cool":0},"-43xPmU71st2AF6M450JxQ":{"text":"Very fancy deserts! The s'mores was amazing the bread pudding was not a favorite but the C","useful":0,"cool":1},"pyFK0bhQbEcjAQaTAYc7iQ":{"text":"Went because my mom is Diabetic, they have sugar free ice cream \"stachatella\" choc chip.\n\n","useful":1,"cool":0},"0CeczIJrNOs7Fz5nsZfhJQ":{"text":"This was a nice little ice cream shop.  I heard they make homemade marshmallows after I we","useful":0,"cool":0},"m1s5LZhmFf7WWDBXmbUoPw":{"text":"TIMING: as with most \"luxe on trend\" spots, you'll have a better experience off-peak;\nACCE","useful":4,"cool":2},"4a-4xlsleHF02FyLuz3Bcw":{"text":"This place is a cute little dessert parlor to stop at when shopping around Magazine Street","useful":1,"cool":1},"pTxSj7UJqZrSOo9AQaRHVA":{"text":"This is sugar heaven wrapped up in an adorable bakery on Magazine Street. There are so man","useful":1,"cool":1},"FN8GpPcg4vrDuhxHCEIn0Q":{"text":"My friends and I were walking around on magazine street checking out all the fun stores an","useful":2,"cool":2},"6p3iWDP9Cu5k91lRtrivkA":{"text":"Had the chance to visit Sucré recently and was pleased with my visit altogether. Not only ","useful":12,"cool":7},"TmWKZ7h-0lNpGErgB6j0xQ":{"text":"Oh my... Excellent macaroons! I went just a tad crazy in Sucré last night and spent around","useful":2,"cool":2},"q7Fwmkf-IaW3s6vXZABAFw":{"text":"As an Asian. I highly recommend this place. It's meet our standard of not too sweet desser","useful":0,"cool":0},"cMu7fetEzAMVgv7QKHnX2Q":{"text":"**BEST GELATO IN NOLA**\n\nBetty N. star bump.\n\nGet the sundaes!\n\nRich, creamy gelato and re","useful":11,"cool":11},"KyBfkak88xF0DCMMYDPIQw":{"text":"Clean, cute, and delicious!! Perfect spot for an elegant treat!! Staff was pleasant! We wi","useful":0,"cool":0},"66VWo9j3mov8bIudQXpCdA":{"text":"I remember seeing an AD for this place in \"Where\" magazine where there is a box of macaroo","useful":1,"cool":1},"_zf8SwXDX_etXV1OKUnEmQ":{"text":"Well, Sucre has finally returned.  Hallelujah and start up the choir because goodness know","useful":1,"cool":0},"d1cgpaRehJILfsB2f9fMNQ":{"text":"The magic of Sucre brings me back every time. This sugar filled paradise calls my name eve","useful":3,"cool":2},"HoXGYpBwDb-LpXkgP7eqBw":{"text":"Continuing the sweet food crawl through the Garden District, we stopped at Sucre to pick u","useful":2,"cool":2},"fP-0gHqBK2h6uqqCt1NQyQ":{"text":"Sucre is back!! I was so excited to hear they would reopen with new management and the sam","useful":3,"cool":1},"SOHuK5Zp7m-3sECPMzQioA":{"text":"Sucre is my go to dessert joint! I really heart this place and have the frequent buyer car","useful":7,"cool":6},"2HjYVBV0SCZn2luwqQbleg":{"text":"I didn't go here, but my wife liked it so much she demanded i give it a review. \n\nI receiv","useful":3,"cool":1},"AAC8sr9Unyg4g2GtxxlMYA":{"text":"This is a French inspired bakery! Very touristy but worth the visit. The macarons are amaz","useful":0,"cool":2},"WH4ZwPWwzzPMFMcg9yMN-g":{"text":"Great decor\nFriendly staff\nEasy to get to\nReasonable prices, including the macarons\nOrdere","useful":0,"cool":0},"DxTdctNqGBv7CIcfeVqp8Q":{"text":"My husband and I stumbled upon this shop, and knowing they might have eclairs or choux puf","useful":2,"cool":0},"bLC4F7XwzdbYJwogwSfQpw":{"text":"Quick service and cute packaging. Macaroons were $2.75 for 1 (think they have better deals","useful":0,"cool":0},"1MT-frtSSj-_Kffm7H3lnA":{"text":"New, Modern, Flashy, Sweet. We enjoyed the sugary goodness here!","useful":0,"cool":1},"UHjRjA-HPLt8LtUZ2zP2tQ":{"text":"Beautiful and pristine inside! Even though we came in just for a grab and go, I really lik","useful":1,"cool":1},"NON6TbBYLJ2UAV3ZOyGYzg":{"text":"This place has some of the most DELICIOUS macarons I've ever had. The flavor selections th","useful":1,"cool":0},"4ZG6u9JNYD0Ci4tXA_Ir5Q":{"text":"I visited this place back in March and as soon as I walked in I felt like I was in a cute,","useful":3,"cool":3},"p5lAdnThPffX2GiI9oQfiA":{"text":"Randomly stumbled upon this place when I was actually on my way to another coffee shop, bu","useful":1,"cool":0},"wALE0Td2TrLlI75-yCBrFA":{"text":"Fabulous teas, coffees and sweets beautifully presented. Many flavors and helpful staff. C","useful":1,"cool":1},"dEolzS5aJMMD8JU4zxGzlg":{"text":"Cute place to get dessert! The place is a pink heaven! I got the gelato. I got the mango s","useful":0,"cool":0},"5yNKit_NE4K9dQtrZ2RSnA":{"text":"The shop is absolutely adorable. Perfect for photo op with date or friends. The dessert wa","useful":0,"cool":1},"bh-bPB_BJ99xtyIDb_IFcg":{"text":"I find this place EXTREMELY overrated. Prices are exorbitantly high--I remember easily pay","useful":5,"cool":3},"hwpxJCulcUrdMWWegDX0yw":{"text":"The new Sucre is a fraction of what the original was. The quality seems faked now. Little ","useful":9,"cool":2},"zjqdFqrXC6dEjlfy9uauOQ":{"text":"Incredible pastries and gelato.","useful":0,"cool":0},"W6vnRL3ld_hIKmLffty2lA":{"text":"Over hyped ! Nothing great . Normal tasting at premium prices . Macaroon was subpar . Serv","useful":0,"cool":0},"hkf1qgel6fNAt_u95PAuew":{"text":"I feel like anytime I walk in Sucre I'm about to be featured in one of those \"diabeetus\" c","useful":1,"cool":1},"HwUV6t1R5i5Kw-iqqU4tNg":{"text":"A lovely variety of delicious desserts. Free samples are always a plus to try before you b","useful":1,"cool":1},"FkKK-c4emroCvVpAsBEO5g":{"text":"We almost missed our flight out of Nola because of Sucre.  Well, really, it was our own fa","useful":2,"cool":2},"I2IIV_opy3_6M8tzGK3_pA":{"text":"Great place in the middle of magazine street for some really good desserts and nice, clean","useful":3,"cool":1},"loL-_vqvVwHqAYbFgtZP-g":{"text":"I don't remember how old I was, but I distinctly remember my first wet dream.  I was James","useful":4,"cool":2},"vOLIRArEC5TEpsUjju1D5w":{"text":"I've had lots of great macarons. These ain't it. Very very mediocre.\n\nAlso got a brownie a","useful":1,"cool":0},"xpMM32m6f8XceGjXGWYbhA":{"text":"This place is amazing! I went for macarons, left with those and cupcakes for the family. W","useful":1,"cool":0},"VmwRqBHAzXlZ4yoMYizeSA":{"text":"Sucre is a jewel box of a dessert shop, equal parts glam and spun sugar. It's a perfect sp","useful":3,"cool":1},"jv6_2Bo1IRzHg_lako631w":{"text":"I absolutely love Sucre. Seriously - the macaroons are always light and fluffy (with fun s","useful":2,"cool":0},"4PvQC7XvqFwHCiCKbD0Ztw":{"text":"Store was beautiful, but everything else was incredibly underwhelming. Cupcakes weren't la","useful":1,"cool":0},"pUclrFCJvugO0ZTcUg9aGA":{"text":"For those that haven't had \"king cake\" - it tastes a bit like a cinnamon roll, with less c","useful":2,"cool":0},"meU4EJ1aEr856HAOvO8Zmw":{"text":"Definitely beautiful desserts, but they're much prettier than they are tasty! I've been he","useful":1,"cool":1},"ZaLFl_S6EGQUeoTkZDgYPQ":{"text":"Four stars because some of the macarons were delicious and others were way too sweet. I wa","useful":5,"cool":8},"led4kZpCV4bmQxYOz5NIWQ":{"text":"As you can see from my previous review, I used to adore Sucre. My husband and I made many ","useful":2,"cool":0},"G0OeQZzm31SnwFh6Y26jmg":{"text":"This place has the effect of turning an adult into a wide - eyed kid in a candy store...wh","useful":2,"cool":0},"Rjh5F5fDgYrih6CGcvBGnw":{"text":"Omg, the banana fosters gelato is amazing and so is the peach eclair!! I wanted more lol. ","useful":1,"cool":0},"Z4fbA7CKAnBbgK-TdJzV8A":{"text":"The first time I walked thru the doors I felt happy. I felt like I was transported to a Eu","useful":1,"cool":1},"xMGbzUDjuYmjnJ1haOcg8w":{"text":"From gelato to macaroons to PB & J cookies to a mini Xocolat cake, I have had many sweet d","useful":1,"cool":0},"At2GYj5nTiCJzQCwsuSvSA":{"text":"LOVE.  LOVE.  LOVE.  \n\nAll my friends rave about Sucre.  Hell, EVERYONE raves about Sucre.","useful":1,"cool":0}}