{"e7gERzivg5F5tlt0HXykHQ":{"text":"This is a great green space in the Marigny. It has play equipment for kids and benches for","useful":3,"cool":1},"_y6qTv8uj0V0C6bE8rgEIQ":{"text":"Peaceful and quiet local park located at the corner of Frenchmen street, open daily and cl","useful":7,"cool":9},"DQd9ZYedvSiH85Psaq6pSA":{"text":"This is where all the white rastafarian bums go when they aren't playing music on Royal or","useful":1,"cool":0},"JxstrfMC-RIvhJHrteInkQ":{"text":"A fun little park in the French Quarter. You can usually see a dig or two playing, childre","useful":1,"cool":0},"LuoICfMYmb55hBYtVbSIhg":{"text":"Oh man, I love Washington Square park.  There are always a bunch of bums lying around, but","useful":8,"cool":2},"ilmaxs2X9zTWxGJnII7d3g":{"text":"This is a popular park in a great neighborhood. \n\nIt looses a star because lately it's bee","useful":1,"cool":0},"hCJdBXD4knidJx4CIG9f0A":{"text":"By the end of the bars on Frencman St. Quiet square with some chubby palm trees. Little bi","useful":2,"cool":0},"ASYM_wOcuV2m_Vk7LpwHmA":{"text":"Scruffy-Looking Man runs in front of me.\n\nSLM: Are those my sunglasses? Where did you get ","useful":20,"cool":21},"g_Y6ptMHkdUxMH5SeYWtgg":{"text":"Washington Square Park is a little park off of Frenchmen Street and Dauphine. Grassy areas","useful":1,"cool":0},"6aeX7mfHwr-hxyClf4Uufw":{"text":"This was a small but nice park in the middle of the French Quarter. There were dogs playin","useful":7,"cool":10},"cbavXnQ2GXTsHZ-uBR5GTw":{"text":"Washington Square Park is a nice place to visit when your batteries need charging.  Typica","useful":1,"cool":1},"CfHBK1b4yF39dkVzyKa4pg":{"text":"The 2.5 acre park is a nice retreat at the edge of the  Frenchmen Street music venues. It ","useful":6,"cool":5},"6IPuoAXU02dr4bI8Kh_6bA":{"text":"This historic park is an oasis in the Marigny Triangle on the edge of the Frenchmen Street","useful":12,"cool":11},"9dJYPVcnS0N0Td64Z7bMig":{"text":"A very nice very chill park in the vein of a typical urban green oasis. It's usually not v","useful":4,"cool":1},"vCf5D8tPFgaM38dYUlphfw":{"text":"A calm little park with lazy, low lying trees and a generally pleasant vibe. A good place ","useful":1,"cool":0},"nX3qmg33j6b16QL8KUoCVg":{"text":"Washington Square Park in New Orleans is a much prettier park than Washington Square Park ","useful":14,"cool":14}}