{"0Md26tm71MxhSD83-CJDKw":{"text":"Even though theres nothing ostensibly stand-out about 45, I spend quite a bit of time here","useful":0,"cool":0},"NFsOjMPt1AqYG-HDZ4tbKw":{"text":"There are bars you can still smoke in?! Yuck. Sorry smokers (I used to be one so I get it)","useful":12,"cool":8},"KkQdBic0Qk_wzHcKscZ4-w":{"text":"While I want to love 45 Tchoup because it's a Red Sox bar (WOOT!) with a good vibe and dar","useful":8,"cool":0},"05DdxDDMmR8LIG1NRBapNg":{"text":"I love tchoup 45!  Came to visit my brother and ended up moving here! So now I am a regula","useful":1,"cool":0},"8iOND8RgpZUpN8cTnCCEjg":{"text":"Yes this place has cheap booze. I used to go here because one of my friends considered thi","useful":12,"cool":7},"q6PHsjuhHWEY6-JpBHLkHA":{"text":"I am HUGE fan!!! Great bartenders, cheap drinks.   Divey bar. They had trivia last night. ","useful":2,"cool":2},"uizFgTg1OyS_1psYP62qHA":{"text":"I just visited 45 Tchoup after having lived here for 3 years.  I really regret not stoppin","useful":1,"cool":0},"YKCKlpCwFtxrL1ygYnh9eQ":{"text":"I love, love, love this bar! Debbie & Frankie along with all the other bartenders are amaz","useful":0,"cool":2},"bPZZ4m3V-d3q7lQLblUjLg":{"text":"Red Sox Nation, New Orleans Chapter #1! Good times, through the tough times and thrillers.","useful":0,"cool":0},"ojAqRNOIhBtBMV3ecxK-cA":{"text":"This is a solid neighborhood bar that is spacious and has MLB season pass (if that's impor","useful":5,"cool":5},"B9B11WklTo3_qzHrv7tWZw":{"text":"Just moved here from Boston and was excited to find a good sox bar! \nA Red Sox bar in the ","useful":1,"cool":3},"-E11EnhgFo2DxMewMOMKOA":{"text":"The best. Fun staff and great hidden area.  Nice clients.  And check out dick and Jenny's ","useful":0,"cool":0},"9KPxQlXcuizMfqkmZyQ5ag":{"text":"Great neighborhood dive bar. Moved down the street from here several months ago, and on my","useful":0,"cool":0},"X0YqQGk4CQOT-144HwH4DA":{"text":"Definitely a dive bar... pretty smoky and not the cleanest, but the drinks are cheap, and ","useful":1,"cool":0},"GMR0IP_z2sj02a9HR8dT1Q":{"text":"Been going since it was called shiloh's. Debbie is the new owner I believe. This is a grea","useful":0,"cool":0},"oGfmfX8GrGSqSdsEhzBVng":{"text":"This bar is excellent. They don't serve food but it makes up for that in every aspect of b","useful":0,"cool":0},"LWNXZFz5Q-lXngAaApN3Sw":{"text":"Being on vacation from New England, I looked up Red Sox Bar New Orleans and 45 tchoup came","useful":0,"cool":0},"ppyOhcB6H3zkzW0K55Dnhw":{"text":"Typical dive bar with a good beer selection.  This is a great place to watch a game, but b","useful":3,"cool":1},"0KU_uIPAvWsMma0o2QSAkg":{"text":"The jukebox at Tchoup 45 could have been stocked by my grandmother, specifically for those","useful":8,"cool":13},"pCOf37yAGWuyY_wtOcJwiw":{"text":"One of the better dive bars around. Killer jukebox. Cool staff. Decent beer choices. Darts","useful":0,"cool":1},"bkOY5KkO1VGEkuXyRzilHw":{"text":"45 Tchoup is a smokey dive bar. \n\nYears ago I wouldn't have minded the smokiness. Hell, di","useful":3,"cool":2},"krgxsieTZhvi_eyiCV1tZw":{"text":"Bert serving drinks at the bar.  Very heavy poor which is to be expected at any nola stapl","useful":1,"cool":0},"32zAqUY718Tweg4cqEHWXQ":{"text":"As an orphan Red Sox fan new to NOLA, I was in a tough spot trying to find somewhere to wa","useful":1,"cool":0},"m_fh7SvKOIlghmEacN85zA":{"text":"If you like to mix alcohol with your coffee I have two words for you... Triple Jitter. Dro","useful":3,"cool":1},"84klO1z7xEO16_lWHOyFHw":{"text":"This dive joint is the basement/ground level of a house right across from Rouse's on Tchop","useful":2,"cool":3},"SnYIKSNQGT85znNfL0MmZA":{"text":"45 Tchoup, pronounced \"CHOP\", is a great place to be before or after any event at Tipitina","useful":5,"cool":3},"hyKQ01KLq7kLuil1ecU35w":{"text":"I have been meaning to write up 45 Tchoup for some time, as this is one of the best neighb","useful":2,"cool":3},"zcId8ZtZc5BiZ1S9YzJAiQ":{"text":"I'm no Red Sox fan...but this is a great place!! The owner Debbie is AMAZING...I didn't ev","useful":1,"cool":2},"93zltLJZliC_OnkGjX8dgQ":{"text":"If you love dive bars then this is one for you. Only had one drink while we were waiting f","useful":0,"cool":0},"W3wGOLeqZkPjl1eWjrk08g":{"text":"Best bar owners in town! They hire great bartenders and they alll take care of their clien","useful":0,"cool":0},"eCDdL_x6aezVzZJEEH-xWQ":{"text":"Solid. Clean dive. Yeah those words go together for some reason in Nola. But if you dig a ","useful":1,"cool":1},"N0YQ5-Lf3cvmcnOFOzPqoA":{"text":"I absolutely LOVE this place! It has a great relaxed atmosphere and some of the friendlies","useful":0,"cool":0},"rBH8wJmImKvN2HeuwNthvw":{"text":"Came here a few months back because I've always noticed the Boston Red Sox flag hanging ou","useful":0,"cool":0},"U9ckM2zek9Cc9kRQbMkj_Q":{"text":"First time here, went after work with my staff, looks like a great place to throw some dar","useful":2,"cool":1},"G1_Xnc6rDFwlM49N9zdTYQ":{"text":"After starting the night, er, late afternoon off in a classy fashion, my friends and I dec","useful":2,"cool":5},"VuTNxC0xSlenhs-Sfmmf4g":{"text":"I have been coming to 45 Tchoup as long as I have lived in New Orleans.  As a lifelong Red","useful":1,"cool":0},"15Dq74PxrjaQoGQX_NSdVQ":{"text":"I came here with the promise of darts.\n\nSo last weekend a promised face off against the da","useful":1,"cool":1},"1Hvw5G5Fw-6SNjq6FKjd2w":{"text":"Sometimes a bar is great because of the bar itself, regardless of personnel, I find this t","useful":2,"cool":1},"SjJgXM0OyJ7_BA5dZsmuCg":{"text":"I had seen this place while shopping across the street. Red Sox banner, looks small from t","useful":3,"cool":0},"6_YP3RfSFBFmL4ylHe4Isw":{"text":"Great dive bar. Wonderful bartender and lots of fun decor to have conversations about. Rig","useful":1,"cool":0},"Saq7Nae1yA5UyInPdhrRng":{"text":"Before Tucks parade, the Elvis hangout.  Starts at 8:30 AM.  Always a blast and friendly b","useful":1,"cool":0},"Bsqu96BqqiGdAXVI6Zap4A":{"text":"I was visiting New Orleans from out of town during the World Series and hoping to find a f","useful":0,"cool":0},"Z0eQJeiNalHnXYW60pCkzg":{"text":"I don't know if I just had a bad night here, but I doubt I'll be back. It was very dead an","useful":2,"cool":1},"VQE_kDLEApRfgVG2jJj9fw":{"text":"Cozy cool fun bar.  Its barely a dive tho.  Categorized as a dive is what brought me in, d","useful":3,"cool":0},"7tODMO25_bCyKA7iHNZMUQ":{"text":"always a good time.    this is family here.   uptown new orleans.   home of the wild tchou","useful":1,"cool":0},"2KcC8VfrjROBtX-PwQKxkg":{"text":"45 Tchop was highly recommended to me by a dear friend who spent a lot of time here in her","useful":3,"cool":1},"eVPvMwISJirLC3rrCzEIZQ":{"text":"nice local dive bar for enjoying a Sunday Saints football game with all the locals...price","useful":1,"cool":0},"bkfY0B_Ow9oLfaRzx16awQ":{"text":"My favorite bar in New Orleans, hands down. Signed, someone who sits on a lot of bar stool","useful":1,"cool":1},"gRJjbtJZq8Ssu2CImVb9lA":{"text":"Has all the aspects that you would like to see / expect of a dive bar...\n\nSmoking.\n\nTVs pl","useful":1,"cool":1},"5KZ6YwiES5d0MqBrKsLzgw":{"text":"On the list of favorite dives where everybody knows your name.  45 Tchoup attracts new rec","useful":1,"cool":1}}