{"-lRH8YLiAgyOChjHZ21mrw":{"text":"The art in this gallery is very original. Artist Graig Tracy paints directly on people's b","useful":0,"cool":0},"ddWN861mKePB_Y74lkeNEg":{"text":"Very unique and incredible art.  Talented artist with such beautiful subjects - wish we we","useful":0,"cool":0},"Ag8Al-eQxvFKkdml-tGj7g":{"text":"Love his art, and make sure to watch the video he plays to know how special his work is.","useful":0,"cool":0},"OG7Bx9kSQNdAzp8S5Lxmlg":{"text":"Craig Tracey is an amazing artist and a very smart, entertaining, captivating guy. His wor","useful":0,"cool":0},"uWVn8TNF50sSmFfPOe0NAw":{"text":"If you watch Skin Wars on TV you know who   Craig Tracy is,one of the best skin artist the","useful":1,"cool":1},"tHqJffGmpHrs2W10T3ivLA":{"text":"A large gallery of bodypainted works located in the French Quarter.\n\nCraig is a true artis","useful":6,"cool":5},"ne7q-b4FGZ8yYuKkHKW6BQ":{"text":"Craig is probably one of the most fascinating people on this planet. What a great guy. I m","useful":1,"cool":0},"4kFdAJRFq4SysYNkrIvfvA":{"text":"Wife and I were determined to pick up art in New Orleans. We're more in tuned with the art","useful":0,"cool":0},"eTc95DockuXixINdImgzJg":{"text":"Amazing gallery. I got to personally chat with Craig for a good 10-15 minutes about his wo","useful":1,"cool":0},"K6V3uGFezAFmXZDsxHbpXQ":{"text":"Love the artwork, bought one piece and thinking about buying a second.  His work is stunni","useful":0,"cool":1},"ML5bPCgRn5IX88JkR5tMhA":{"text":"Painted Alive specializes in paintings on skin.  Don't be scared, no people or animals wer","useful":2,"cool":1},"7P42vypBYBdDyVUrGbDIng":{"text":"There are times when 5 stars is not enough.\n\nCraig Tracy is not only an amazing artist but","useful":0,"cool":0},"_6jPUx4KECuyQQw0GvCqXA":{"text":"My favorite gallery in the area! So beautiful and unique. The staff was incredibly friendl","useful":0,"cool":0},"dOYfD6tJZp5XCub_2-DZZg":{"text":"How breathtaking is the art here!! I was so pleased with the pieces on display, and the fr","useful":0,"cool":0},"7H-Zjxi7UvR_OtuTs6UoHg":{"text":"Craig is a brilliant artist, and I had been watching his work for a few years. On this las","useful":0,"cool":0},"un3MMTFGB0VmBbgOEwQAAQ":{"text":"Met Craig tonight finally.  He is truly a great guy and very friendly and down to earth.  ","useful":0,"cool":0},"Yw-gzPVl7Vnx5JWU0q499w":{"text":"First time I wandered into this gallery, I just couldn't help but laugh. Mostly because th","useful":7,"cool":3},"OrZ0G_y8LP2ajOYLa9SULg":{"text":"I found this gallery extremely enjoyable! His artwork is amazing and his brother is very n","useful":0,"cool":0},"7mdsytm18tlBkJLuyzpxMA":{"text":"Craig is an incredibly talented artist. A few years ago, I was lucky enough to visit Craig","useful":0,"cool":0},"NpJPJuZ9O4Wr5r6J02FXgA":{"text":"Around March 22, 2013, my wife and I were exploring downtown New Orleans and examining the","useful":0,"cool":0},"Kj68gigvjywvtK2O-bkxbw":{"text":"Outstanding Artwork, love his work,  have now collected 11 of his pieces of his art, frien","useful":0,"cool":0},"Q9e6fqGLgOEh5H4rZNz-xg":{"text":"The art work here is phenomenal and definitely a must see. I was soaking up the last hours","useful":3,"cool":2},"nG3PZfm9cTSWZoYgDHw6Rw":{"text":"We were wandering through the French Quarter after having a delicious lunch and we stumble","useful":0,"cool":0},"PGetEkPEzlFLveSutnAutQ":{"text":"Artwork is neat but extremely rude and disrespectful guy working there (artist's brother) ","useful":0,"cool":0},"a7a1E9uVaq0QDsF7jLSaWQ":{"text":"How do I even begin to explain how amazing the art was in here. While my mom is an artist,","useful":0,"cool":0},"2VTUCPBqHLePccKQlrzdvQ":{"text":"I have purchased several of his pieces for myself and as gifts. His approach is inspired. ","useful":0,"cool":0},"M3mnKSHZFr1Xec1zmfkx_A":{"text":"I am definitely a fan of this artist.\n\nWe stopped in here among many other places while ou","useful":0,"cool":1},"ml6yFpBQJSXiqgkEb8fvhQ":{"text":"Save this gallery to your hit list ( aka bookmark ), and you'll never set foot in any cont","useful":3,"cool":1},"BNKJSfOva-T7UWSM-Pbx-w":{"text":"This gallery is just amazing! We were window shopping in the French Quarter when we stumbl","useful":15,"cool":20},"pIlBsAV0BzDFyMd8TuOriw":{"text":"Nude and not so nude photographic prints with a twist.  \n\nCraig Tracey takes his art from ","useful":5,"cool":3}}