{"ulTuGW79qBaKFhBgQfyuKw":{"text":"Terrible experience. Made an appointment for an oil change and was promised it would be re","useful":0,"cool":0},"XP3aiHdRJlOQpy0tuz_Ikw":{"text":"Dropped my car off to have tires rotated and wipers replaced. Keith and Brandin were excel","useful":0,"cool":0},"4WcbfnQcVrePSBeZVrm9gA":{"text":"Brought my car into the shop on Sat. because it was making a rattling noise every time it ","useful":3,"cool":0},"3SpSBYr7lJl6g_JoBZ1LQg":{"text":"2/3/2015\nSo, my daughter ran out of gas the other day. One of her friends got a gas can of","useful":4,"cool":0},"DB2ayHzwIoWTVdhBSnsVmQ":{"text":"These guys did me a serious solid this past weekend.\n\nI know some people don't like Pep Bo","useful":0,"cool":0},"0BEbGvGNRAWjk0lC_dW4LQ":{"text":"This place has consistently given me fantastic service. I was dreading having to go to Toy","useful":0,"cool":0},"J-7xnOGicEsj-Kw2iVXYJw":{"text":"Called to schedule an appointment for an oil change, the guy was very rude and said he cou","useful":0,"cool":0},"E_ABBTuR8j4ZJirGMEXctQ":{"text":"The absolute worst place to bring your car! No one cares in this place. Mention the labor ","useful":2,"cool":0},"m9C4bd4DXFfFRh87NCwZ5A":{"text":"we went here last week because our car wouldn't start. We made an appointment and called t","useful":0,"cool":0},"Cr3l_gK07JQCfAx2maEtzQ":{"text":"I can't speak to their repair center in general, just tire service but I got a flat tire a","useful":0,"cool":0},"o1bkvSoqtrO9X4lmnP1fOQ":{"text":"Honestly, I don't ever expect a lot from car places, I usually feel out of my element and ","useful":1,"cool":0},"cc_iJQFz_CgzBdEJbTk5jg":{"text":"This shop has exceedingly slow and unprofessional service. We stopped by to get a simple b","useful":0,"cool":0},"FfkqdJS9kBktq_DGHFPvnA":{"text":"I rarely am one to complain, but I was truly astounded at the lack of honesty and service ","useful":2,"cool":0},"JA7h_haRS8aZyoM_t0UxLg":{"text":"Steve gave us great service!!  He truly listened to our concerns!  He didn't try to take a","useful":0,"cool":0},"Lpe48_fg9KYzuhEa0XrVXQ":{"text":"I've been to pep boys twice for a flat tire, helped both times by moe. moe is AMAZING and ","useful":1,"cool":1},"wA1S5EVuweOl7RWt-X73ZQ":{"text":"My initial thoughts of this place wasn't good at all. It was as if I was bothering the guy","useful":0,"cool":0},"zCQEsVPX6bZIYU2beGdojg":{"text":"Called 1800pepboys for a tow thinking I had something seriously wrong with my car. When th","useful":0,"cool":0},"0OqUn8tEoC4bqBCrkFKyUw":{"text":"I try my hardest not to leave one star reviews but in this case, if I could go lower I wou","useful":2,"cool":0},"8eCOR3m1SkHhWfbr6FhUsw":{"text":"This Pep Boys is terrible. The first time I brought my vehicle to get a nail removed from ","useful":1,"cool":0},"qFKCO6cX495QD85CwiyL0w":{"text":"I called in to see how long the wait was for an oil change, he said they weren't taking ap","useful":2,"cool":0},"TDFnAtqysgP_uwctVRWy7Q":{"text":"My daughter is a student at XULA and needed repairs for her car after landing in a NOLA st","useful":0,"cool":0},"tLETiOo-tVo3_vI0lOAC9g":{"text":"You already know what to expect. It's not often, if ever, you'd expect to be wow'd by a au","useful":0,"cool":0},"BwxizsBN5OSlpFqL6O4usg":{"text":"This is the absolute WORST PLACE to bring your car if you ever need anything done to it. O","useful":0,"cool":1},"vuer8Jy5OoqhVTO8NUh_Pg":{"text":"I've been to this pep boys a few times in the past due to the convenient location. Service","useful":0,"cool":0},"WOUfvktR0sAFQiAsjhx9WA":{"text":"Zo was very helpful in making sure I get everything handled for my car and tire issues. He","useful":2,"cool":1},"OxItlk0MzV-ZbObjeyjTYQ":{"text":"Brought my car in this morning when the plastic splash cover in my undercarriage started f","useful":2,"cool":0},"g4fUpLL92ZHzVNRH7QbvOg":{"text":"I decided to try the Pep Boys near my home because I was tired of finding my way to the de","useful":0,"cool":0},"mKCXY49KotmdACqy0igSvw":{"text":"Worst customer service...i drive there while on hold probably 10-15 min.  Attendants are s","useful":1,"cool":0},"ldcx9LneNxi1E0HBNurCew":{"text":"I do not know the manager's name or the people that worked there today's name but they wer","useful":0,"cool":0},"FpzgMZmWv5leAzuVomBcuw":{"text":"I've been to this pep boys a dozen times and have had about 3 major repairs done on my 200","useful":0,"cool":0},"ZACHOlnEGdf8W3j2KFIqeg":{"text":"Prior to visiting this store, I made sure to read all of the Yelp reviews to make sure I w","useful":1,"cool":0},"qK6U0wBB6f7ko0kcDIrK5A":{"text":"After having to wait a day for them to order a tire, and tben asking if they called and co","useful":1,"cool":0},"WD9ba-KSYk66UDS46vGmWw":{"text":"Terrible customer service! Had to wait 10 minutes after arriving just to be asked if I can","useful":0,"cool":0},"-ia_I26cezdS-tXnCgJMWg":{"text":"After 3 bad experiences, had to write a negative review. We keep coming back because it's ","useful":1,"cool":0},"L_UxcgYQo-h-YXdtluaBew":{"text":"If I could go lower I would. Rude rude rude rude. I expected more from the store manager, ","useful":1,"cool":0},"HXp6XGWuMGKqwW06dKkKMw":{"text":"I have a mixed review.. I really enjoyed the service at the store. I was helped by Duane, ","useful":0,"cool":0},"cCWrUUXby18De-ZcG2JANw":{"text":"I purchased an oil change at this place. When I walked in, there were not many employees a","useful":0,"cool":0},"YHWTm_3-9Ct64vaPnmQsJg":{"text":"I don't know what I was thinking when I brought my car for repairs to this establishment. ","useful":0,"cool":0},"VQOa97cxPZ3Oj6AXl4lUow":{"text":"DO NOT GO HERE.  We stopped here for an oil change.  After checking the car in, we were to","useful":2,"cool":0},"hRXqjnRji_nx_Plmwh4P_Q":{"text":"Abosolutely horrible customer service! Employees just stand around and talk on their cell ","useful":1,"cool":0},"rKYZX-x8XWirYdhJv57Lvg":{"text":"I went there to purchase 4 tires.  I had to hunt down anyone in the service/tire area. Whe","useful":2,"cool":0},"a7-UVU8_9zJAmqGh7WAzAQ":{"text":"Great experience with the auto service department.  My van needed major repair work after ","useful":0,"cool":0},"eYDG68nNL2xb8XGHc4bdOA":{"text":"Not much to say but needed brake service and 3 advisors were too busy talking to wait on m","useful":0,"cool":0},"ws0YeSVkSux3urPEBllseA":{"text":"I went their for a synthetic oil change on my European import. I made my appointment the n","useful":0,"cool":0},"BkFf63xOz83CDK-iumgN0A":{"text":"Came in for an oil change and tire rotation.  They weren't able to do the tire rotation be","useful":0,"cool":1},"1uOykULneUH3fNo_9hk4iw":{"text":"I made an appointment for a tire change.for five online day before and didn't leave the pl","useful":1,"cool":0},"B9qZ4JNjIZeESF4DYJGBsQ":{"text":"Worst car service I had ever experienced. I got a new tire and I don't think the tire was ","useful":1,"cool":0},"L6QXyhS69RWQ-MtGy4xyRA":{"text":"Pep Boys' social media team commented on my initial review, so I figured I would take the ","useful":0,"cool":0},"Vvcd9BnYO2CR0W5MbdPTXw":{"text":"Lots of positives; convenient online scheduling, text appointment reminders, quick service","useful":3,"cool":1},"IVI8gDFEpPD8QQvugutMoQ":{"text":"Took 3 days of coming in and appointments (they lost my appointment reminder anyway) to fi","useful":2,"cool":0},"xNXPFSvAChe85856s5tNcQ":{"text":"Changing my one tire today took more than 4 and a half hours. While I waited, a woman came","useful":3,"cool":0},"jAxgAWoUjTQmtBQrgDSd-A":{"text":"I parked in the lot that has Pep Boys and Ihop connected, to have lunch with my daughter f","useful":0,"cool":0},"cC_XVWCvqGF3FGo3Bcm4uw":{"text":"I was the first in line in the morning. It took more than two hours for a simple oil chang","useful":0,"cool":0},"TV4dBgnSqu5rs8t2srYDqQ":{"text":"PLEASE DON'T USE PEPBOYS. Just go to Firestone across the street. Worst customer service e","useful":0,"cool":0},"QHVsfPBAEcXGNf8yF2ZO8A":{"text":"I wish I would have checked Yelp first and seen all the one-star reviews.  Please take not","useful":0,"cool":0},"RHrKNuzIr7zdXLzCtdfeNg":{"text":"Tried to charge $100 for a repair that cost $3 at the dealership and I could fix myself. A","useful":1,"cool":0},"Xrm8Jrt9EF2Cc2nCPQ6BLw":{"text":"This company was recommended to me so I chose the location closest to my home. I didn't es","useful":0,"cool":0},"L9jENesOhLbicVumWLkMIw":{"text":"Went in for another estimate on my brakes. Because I am a woman they thought I didn't know","useful":0,"cool":0},"rEHeHKBo2qVGPpLs40PQQw":{"text":"These guys are incompetent rip off artists.  Brought my car in to get brakes fixed.  After","useful":0,"cool":0},"pGdxGhak0Tf_RVtOsRnWcw":{"text":"It went from being the worse to even worse. Way to outdo yourselves Pep Boys!\nOnline order","useful":0,"cool":0},"1lEEv3gR9Mfi-ksg-WYQcw":{"text":"They have been taking care of my truck for 5 years...o think they do a good job. They may ","useful":3,"cool":4},"VYrNH42t6THkH41AW83bAQ":{"text":"I know garages are fancy or pretty. But not a greeting by one employee or I'll be right wi","useful":0,"cool":1},"6uGzg6GrbM0Aaljm9_U2BA":{"text":"I dropped my car off for a simple tire change at 1pm. I never received the call or text th","useful":0,"cool":0},"kB0rkd2YNQympGzHYnEZ_g":{"text":"Sooo I've been here over two hours waiting for a new tire. I've had tires changed in ten m","useful":0,"cool":0},"1TMSNayrdViLUbPrCyMPEg":{"text":"The store for parts is not open anymore they should have a sign. And it is auto repair onl","useful":0,"cool":0},"kiWLcnByZfjREiUXjeu4eA":{"text":"From start to finish, everyone was helpful and nice!!! Brian was fantastic to work with as","useful":0,"cool":0},"ft05HgnUhQt6v14w0dFz5Q":{"text":"Amazing customer service equipment and auto parts called about a flat tire they allowed me","useful":0,"cool":0},"SV8w-1zkPFHJ6mvSsGFtvQ":{"text":"Pretty sad excuse for an automotive shop. Cheap tires, surly service and dirty. I was told","useful":1,"cool":0},"WQ4-mFdIhEVpLXMA6KHh9g":{"text":"Just make sure you deal with the middle aged gentleman and not the surly young guy who wil","useful":0,"cool":0},"o5pPXgbD7TT7jAs8OlGNYw":{"text":"I have come to this Pep Boys three or four times under protest.  I say under protest becau","useful":0,"cool":0},"xMHlHR8rOQ3OU6FyEEtFUQ":{"text":"Brian was so so helpful and professional. I was a stressed out after blowing both of my pa","useful":0,"cool":0},"zT-ksicjQfF7KxSXr6fqww":{"text":"While Manny, Moe, & Jack won't steer you wrong, the service here might slow you down a bit","useful":3,"cool":0},"LJoFKJcUAMyZoMxlakkxRw":{"text":"I am a regular at Pep Boys . My mom is a card holder so I've always gone there for my car ","useful":1,"cool":0},"pZvPNtOCDM4MU7GJXqXo_w":{"text":"Wish I could give zero stars. We bought 4 tires through Amazon home install and had them s","useful":0,"cool":0},"dHR4np7MiR13IwvI8ZIQmA":{"text":"I've been meaning to write this review for a while, so here goes.  \n\nWhen I got my first f","useful":2,"cool":0},"gsWF2ZxRVovl8aBpbpBxSQ":{"text":"I needed a head-light replaced, and I needed an oil change, and I needed new windshield wi","useful":3,"cool":1},"6_6mEuTM7F16QSNP1xoghw":{"text":"I had a thoroughly pleasant shopping experience here. I visited the store to get a price q","useful":0,"cool":0}}