{"50F0i01xrZv-I4sj5oreBw":{"text":"When I was staying in the French Quarter eating everything in sight, I found out mid stay ","useful":7,"cool":6},"1x1ufyZ1XhNt9fqkvMm72g":{"text":"I was immediately turned off by the pungent smell of must. I got my food and sat in the fr","useful":0,"cool":0},"zl2VcN2LcHUYjV5GhZ-Wqw":{"text":"We have eaten Popeyes plenty of times locally in our area. But was told by the locals that","useful":1,"cool":1},"Gfq5C-qZ4pXCu-VTrdMWTw":{"text":"Stayed at the marriot right next to the Popeyes. We were craving fried chicken so my gf an","useful":3,"cool":0},"hTcD6OdJWar9hm8oA96RGw":{"text":"One of the first places we visited on our trip to New Orleans. Walking distance from major","useful":0,"cool":0},"LonixW30Dajb3HVvbm3JGg":{"text":"I love this popeyes.  The chicken is always fresh and crispy,  the sides are never cold,  ","useful":4,"cool":1},"lPwXA6y3ZQD8i_8NjHr2Ow":{"text":"Popeye's Chicken, good food always bad service.\nWanted a dinner for 1 but only family pack","useful":0,"cool":0},"3BlWozpl31iJSQ6ZqAZlDQ":{"text":"While everywhere else was overly packed for FQF this past Sunday. My party of 6 decided to","useful":0,"cool":0},"8fnWHxq216jm4wPnrHszow":{"text":"Popeyes- fast food fried chicken. Seeing that Popeyes originated from Louisiana, we though","useful":12,"cool":12},"1OzVNMPdf8hnPCJQLR1GVw":{"text":"My friends & I wanted an easy quick lunch so we decided to eat here while visiting NOLA th","useful":6,"cool":2},"-KsQ9Y4FlhMlt353A8GpLA":{"text":"It's Popeyes chicken, one if my favorite QSR foods. But the overall service was poor, with","useful":0,"cool":0},"seg0wxt2xXMhCqwFxig6vQ":{"text":"Hands down the best food, best service, and best price of all these restaurants in town. A","useful":1,"cool":1},"Mpo9cItsv0gAmuAde4BUlA":{"text":"What can I say? I'm totally crazy for fried chicken--it's one of the few fast foods that I","useful":0,"cool":0},"q039yLm66W8Cpt9Eh90WxQ":{"text":"Thought I was gonna get a spectacular surprise, sizzling chicken skin... Pretty good thoug","useful":1,"cool":0},"761K37ulUcxi43JAY00wxg":{"text":"So basically. It's popeyes and after a night of drinking the girls and I ventured off to g","useful":0,"cool":0},"xF7VUmWGTnRQCWSp0fUPcQ":{"text":"Sure it's franchise chicken, and you can most likely get it from home, but if you are a fa","useful":0,"cool":0},"6jYYuYx-BTOS3h1JLVCqcA":{"text":"Everything here its the same as all other Popeyes locations. Except with the ordering proc","useful":2,"cool":1},"FHbW9yqGz1oOjUuHtJ7Klw":{"text":"I wanted and needed some fried chicken!  After a disappointing round trip cab ride to Will","useful":5,"cool":5},"EI-QmkDkrQ4uu94UG534oQ":{"text":"Wed lunch\n\nWanted fried chicken from 'the institution'. This is one opened after the storm","useful":1,"cool":1},"ATDYlhpjx9SuemcLg-WiLA":{"text":"I don't eat a ton of fast food, but this has become my go-to place to get a quick (and rea","useful":1,"cool":0},"u_ReYOduD7Hdk827ObsTlw":{"text":"God is real. Journey down to the heart of Louisiana to enjoy this Mecca of a Louisiana kit","useful":2,"cool":0},"lxZ13gr0mQYunCkfK0zRpg":{"text":"Craving chicken before ending our trip to New Orleans. This place does not disappoint! Fas","useful":1,"cool":1},"ThUkc4vHcu7GmK7LtCmEKA":{"text":"Something about Popeye's made IN Louisiana. I don't know WHAT it is, but it's fantastic.  ","useful":0,"cool":2},"gIeVUGumEezmGGWqUwnNRw":{"text":"The ordering is a laid out different, I eat here when I am in town and I love it.\nParking ","useful":1,"cool":0},"jzRcvTkfYZMkTTVgyRVG_A":{"text":"I needed some quick, authentic New Orleans food, and rumor has it, the best red beans and ","useful":0,"cool":0},"xS55A7ZbVGj_ph4upg7Mog":{"text":"The \"SPICY\" chicken (regular pieces & tenders) is super awesome and satisfying. It has a n","useful":0,"cool":0},"2-J-hh5v-TbgFPS6YT862w":{"text":"Sooooooo, we were just disappointed by Willies and needed a reprieve. Of course Popeyes ca","useful":0,"cool":0},"-mxRMK3nYJxFyG3v2PG4fg":{"text":"DO NOT EAT HERE. Horrible experience, we came here like many tourists to enjoy a food whic","useful":1,"cool":0},"BZ8D8BNB30IHfkN7tPSfoQ":{"text":"Love that chicken. Staff was friendly and service was fast. They got a good crew there now","useful":0,"cool":0},"5c6BXtguLCw1BhDgNNaTcg":{"text":"Mmmmmm,  just mmmmmm!!!!! For fast food this place rocks!!!!!! Get the spicy chicken with ","useful":2,"cool":2},"o5uDBH47l0b3fM6kbxcIAg":{"text":"Popeyes originated in Louisiana... and when in Louisiana, you have to get some Popeyes! Th","useful":1,"cool":1},"BAsxXpCJLE752o164ihfhA":{"text":"Saw this as we were walking around the French Quarter and I knew I had to get me some Pope","useful":3,"cool":0},"IRVgwSkcunDZ2lYBZP093w":{"text":"The best Popeyes I've had in life! It was made with a grandmother's love. Usually the bisc","useful":0,"cool":0},"lyUz3pFsm6Z59qAevj1XhQ":{"text":"For being so close to Bourbon St, this facility is pretty darn clean.  They do their best ","useful":2,"cool":2},"b4tAENbMx42Ohtn7DmPKZw":{"text":"The food tasted good. But the paying system is very inefficient. I don't like the fact tha","useful":1,"cool":0},"ha0t6UOxg7u11f7Q8Jnjew":{"text":"Best Popeyes I've been to. I'm from Baton Rouge, they could really learn from this locatio","useful":1,"cool":1},"IPyV3rwXhkp5kyz18BgnKA":{"text":"Chicken wings were tasty, but they were extremely small almost laughable. I didn't like th","useful":0,"cool":0},"hQ3N_MyAUxXOAZrEvY_XuQ":{"text":"Thank you for letting me use your restroom on New Year's Eve without asking me to buy some","useful":0,"cool":0},"Ikf5QLiENUZpB6VVtOX05A":{"text":"The hype is real. It really does taste better in Louisiana than any other state. It wasn't","useful":1,"cool":1},"RNUYI-qbxKTqc88rto2w2A":{"text":"Service was faster than the usual during the day time.  It's unclear where you go to get y","useful":0,"cool":0},"XuJj4BfRghnoTlndB3_u3Q":{"text":"A few NOLA words about Popeyes!  http://nolavie.com/2013/01/love-nola-to-popeyes-or-not-to","useful":0,"cool":0},"kj4VzHn6MJi3C8IEYUWlCQ":{"text":"First time trying Popeyes, and was very pleased!  Got the Louisiana Trio 3 piece special o","useful":1,"cool":0},"xcBlFguWXeZo506Xs5BaFQ":{"text":"The food is ok like most Popeyes the service sucks.The lobby people really?There is the be","useful":1,"cool":0},"F52GP6OcZWAewN425rblUw":{"text":"so i went in at about 9:55pm...they close at ten...door was unlocked...got half way to the","useful":1,"cool":0},"zmvV172Dbhs_bHP_bN6qHA":{"text":"Love this Popeyes because it's close to where I work. I get an hour for my lunch break and","useful":2,"cool":0},"1C8bUtWAwrb2wXYhATjBvQ":{"text":"First time visiting New Orleans and first time eating Popeyes. This was quite possibly the","useful":0,"cool":0},"BredHXSSC34E9Su3Wm_RdQ":{"text":"What a joke! Most unorganized Popeye's in America. Four watching the NBA Finals while they","useful":0,"cool":0},"c8SqTVnMm84DWd-P6tFfpw":{"text":"I was extremely excited to visit a Popeye's located in New Orleans. I was expecting a vari","useful":0,"cool":0},"pl5fD_pphzPItJ1bCxyLpQ":{"text":"Don't come here close to closing!!  No choice in chicken pieces and what's left is cold!! ","useful":0,"cool":0},"6zED0vqFW6LUlrZGRni0AQ":{"text":"Small portions. Little flavor. I'm giving it 4 stars because of the service. It's good to ","useful":0,"cool":0},"TXOIEgFBO6ckAXlwL_Y7QQ":{"text":"We went here because it was rumored to be the original Popeye's location.  Got to the rest","useful":0,"cool":0},"PUUbO1EooJ6eyfhMe3HqmQ":{"text":"Wooohoooo! Great chicken, great service and the place is packed! Can't wait to dig in!!!","useful":0,"cool":0},"DQMY_9XPu17l_Qu0DYfYVg":{"text":"Ghetto ass employees....\n\nJacked up our order along with about 3 other peoples...made raci","useful":2,"cool":0},"MIhIxZ5IPzmPpyVPVhYnVQ":{"text":"Everywhere is crowded here.  Being alone, just looking for something easy other than pizza","useful":1,"cool":0},"BrIXAUyyRbzPONeXdevxTw":{"text":"Can't ever come to NOLA and leave without stopping by Popeye's on Canal! This is good for ","useful":0,"cool":0},"AWdWsyig0xELM2UtckH0CQ":{"text":"Okay was in NOLA for a visit, I had to see if there was a difference from NOLA Popeye's \nT","useful":2,"cool":0},"DvM9U8bcSL37EEbqOYEgKQ":{"text":"I have never written a yelp review before but this place deserves to be my first one star ","useful":1,"cool":0},"dLkikKsVuQLh9AABLWs4ww":{"text":"So this is how a Popeye's should be! We came in the day before the Essence Festival and I ","useful":0,"cool":0},"rG5mSXyXPKThMrXZq7PS9g":{"text":"I came to New Orleans to try New Orleans popeyes.. to me, it tastes the same as if I was i","useful":0,"cool":0},"OTZluBmFRK-34Wu0DP565g":{"text":"Yes I am doing a review on a fast food joint!!!! This was the best Popeyes I ever had! Dam","useful":0,"cool":0},"3z1SfeoXDKR0AN-wmmn_hQ":{"text":"I don't know why I'm still keep going there. The one and only horrible experience in a foo","useful":1,"cool":0},"lsZ7i1CTNKzvmBa9cXnIMQ":{"text":"Every week use to stop and eat some great chicken. Driving a 100 miles would stop at diffe","useful":0,"cool":0},"iK00TNjxRzIs4ufnvXwEcA":{"text":"An interesting place. No drive thru!\nSome old tech but pretty good & quick. I've been to b","useful":0,"cool":0},"rF-rQW7N3dwNa3ZCVnRTuA":{"text":"Popeyes in Colorado tastes better.  If you are looking for a quick bite to eat and there i","useful":1,"cool":0},"4ImpAbl3yGJ_sSiHSyE6BA":{"text":"Okay, don't laugh.....but I did go to Popeye's for some chicken! I heard that the Popeyes ","useful":0,"cool":0},"JYNoEFHrm6SP8umXTctVEw":{"text":"I'm impressed by the service here; it's an assembly line set-up here. You order first, the","useful":1,"cool":0},"2E9BcyNckeHALc5VLlulXg":{"text":"Service wasn't that great but I DONUT CARE. The food is heaven!!!!!! \nPopeyes shouldn't be","useful":0,"cool":0},"2dHPNirxyz9fHjN2Ts1eoQ":{"text":"Like many of the other reviews have said, the staff at this particular location doesn't un","useful":0,"cool":0},"TL7ln6ThKaIcWrGsVm0uvA":{"text":"Usually you can't go wrong with Popeyes except when they get your order incorrect, but all","useful":0,"cool":0},"6p-RNOIQVYJL73eWb0TjEw":{"text":"I heard that Popeyes here is different and better than in CA so I figured I'd have to make","useful":2,"cool":0},"nWB5bL3QrFQSjgTKJeiMcw":{"text":"Highly disappointed. Word was this location was the original. If so, sure didn't live up t","useful":1,"cool":0},"cKWsj3vEJnIRhIjEUjnN3A":{"text":"Fast service - easy in and out.  Spacious seating.\n\nSmelled bad in here near the entrance ","useful":2,"cool":0},"fH0_Vp5IjmCsPPcOdq1tOw":{"text":"I've never been a fan of Popeyes. I thought it was because I've never had it in Louisiana,","useful":5,"cool":2},"zEb0hS15ciATYL5pPwZdKA":{"text":"the popeyes on canal in nola has the most rude and disrespectful employees on the planet e","useful":3,"cool":0},"ehKWUJ65qSUFUEYew9hjkQ":{"text":"Came here for a quick lunch before heading out to the swamp tours. After checking in, I st","useful":0,"cool":1},"4V84TM2ySZHo808ln2KMPw":{"text":"The food was good and we needed something cheap and on the go. But the hosts could have ca","useful":0,"cool":1},"lL9WrVMP79XnJouMTRrlDg":{"text":"This is a great restaurant. The lobby was clean, the food was hot and fresh in a timely ma","useful":0,"cool":0},"6C2ZBL5q4MaRVMngVbdaAQ":{"text":"Best  Chicken sandwich ever... hands down. I could eat several of these at one sitting but","useful":0,"cool":0},"a9ax0TbXka5xnjMDvOwSNg":{"text":"Fuck this place! Slow as shit, rude workers, and half the employees are standing around do","useful":0,"cool":0},"r2jKS1abGvkrOCKQZY-cWA":{"text":"Like many of the other reviews have said, the staff at this particular location doesn't un","useful":0,"cool":0},"9sVWaA0tto8FNLkPKe5PRA":{"text":"I've eaten Popeyes everywhere except where it originated! OMG, the difference in taste is ","useful":0,"cool":1},"nJbVn4Cgnwuvx6F1mi8rIQ":{"text":"Smh Lol this supposed to be the stomping ground for Popeye's but it taste worse than the N","useful":0,"cool":0},"9D5euO2Dpvc8CFUJivBr2A":{"text":"I will give them a zero star if I can. I love Popeye but this location at Canal St NOLA is","useful":0,"cool":0},"6qp6Up18BIjC0FSd05ETFA":{"text":"Tonight was a really rough night for this restaurant. I understand the chicken sandwich wa","useful":0,"cool":0},"1cxaWNlfSYZCxkmdyKg6rA":{"text":"The service was horrible. We waited over 30 minutes for our order. When we finally decided","useful":0,"cool":0},"OXZwkNAqc_9wsn_5tX2nRQ":{"text":"This is the worst food experience I've had in a LONG time.\n\nThe line moved slower than a s","useful":3,"cool":0},"asUcjryNvwosdB1HSPj-QA":{"text":"Update :    Went to Popeye's for lunch .  Trying to order was pretty bad . The employee pu","useful":0,"cool":0},"DUOcSYjS_g9zGSgQZorZkQ":{"text":"This location is just like any other Popeyes location except for one thing. There is a sep","useful":1,"cool":1},"YFiutPcnAeBz9qWIW40P7g":{"text":"The Popeyes restaurants in NOLA have food that tastes better.  I've been visiting them her","useful":1,"cool":0},"9UuRkG3hZcDmTUHrhd4VIw":{"text":"Terrible service. Filthy, no mask. Rude Rude Rude service. Too busy on their phones to bot","useful":0,"cool":0},"49i1mYsN9njEceza8e4Iow":{"text":"TWO New Orleans locals told me that one of best fried chicken they've had was at....Popeye","useful":6,"cool":4},"tBVa7hJFt7gVHkwDK93beg":{"text":"Why do you hate your customers so much?  \nIndifferent at best, hostile at worst. \nExcept f","useful":0,"cool":0},"5zrlql-BZKsdswa4BfPHXQ":{"text":"We were in New Orleans for our son-in-laws' 30th Birthday on of all nights New Year's Eve!","useful":0,"cool":0},"Tq7tZ6i6hmr1DWodmNTpRA":{"text":"The best place to grab a quick bite. Fresh biscuits and savory fried chicken seasoned with","useful":0,"cool":0},"VbwLqbIgoBMQ_-BzM71RiQ":{"text":"They were all really nice despite being super busy this Mardi Gras season. My order was se","useful":1,"cool":0},"FqkP7h5YUbLuFnTWGDla5A":{"text":"Fast and easy. Shrimp poboy was 'fishy' tasting. Husband loves the chicken so that's why h","useful":0,"cool":0},"-z793B1TngAbYRVE2WoCdw":{"text":"The food is always good. The real problem is the employees. You are bothering them by plac","useful":1,"cool":0},"mqE65BU9T4dQCAWaqcKSpA":{"text":"Been to this location a few times . .  Chicken always hot and crispy .  This time my spous","useful":0,"cool":0},"ONByXTLTKLJQW9wlCax_IA":{"text":"I was there in mid July 2018. We got there real late, so there were no sides other than fr","useful":0,"cool":0},"fpHogZ3hx8ItvoUEUlbf9A":{"text":"Popeyes is my favorite fried chicken, however this location is not good!  They frequently ","useful":0,"cool":0},"36VzZwKXh4dBggjemH_L9w":{"text":"chicken was not spicy, looks like chicken was sitting around for awhile dry, red bean rice","useful":0,"cool":0},"X2z1t0tI2rFDlhECWxcgHQ":{"text":"This is close to the bottom of my list of restaurants EVER!  I decided to call it a early ","useful":1,"cool":1},"1aBaD_SGYRUs6iDBe7qRTQ":{"text":"If their attitude was as good as the chicken sandwich they'd get 5 stars. However customer","useful":0,"cool":0},"v9r63DJYkPDJHKQvSY2M8Q":{"text":"This place is the absolute worst.  I waited for over 20 minutes for 5 chicken tenders.  If","useful":0,"cool":0},"EogEhDUZ3tNQSUhShJv9nQ":{"text":"This was the worst popeyes I have been in!! Our chicken was hard and burnt and our popcorn","useful":0,"cool":0},"QAm9H9RL5IRP9x0Y6kk9Vw":{"text":"We have been huge Popeye fans for years. I try to leave only positive reviews on all resta","useful":1,"cool":0},"OuiN2wujQ1yERDNL-zF6dw":{"text":"Popeyes is quite the franchise these days. The go to spot for fried chicken.\n\nHowever, thi","useful":3,"cool":2},"80IFBzW18jTwufD9-pLBkA":{"text":"I'd been trying to get the spicy chicken sandwich for months back in NYC, without any succ","useful":2,"cool":1},"iGEVaU60AH0piebk9I8JoA":{"text":"Very small portions for very high prices. Not pleased at all.... and i complain politely. ","useful":6,"cool":2},"48qNRq9VCyfL78-q7FIS-w":{"text":"Worst service I've ever had at a Popeyes and I eat that the Popeyes in Texas once a week. ","useful":0,"cool":0},"f-7iJnUzj3IesBhWlCb5DQ":{"text":"https://www.instagram.com/p/BwVHpuJHb2E/?igshid=174fe7zaxqrc8\n\nI've never seen a more accu","useful":0,"cool":0},"VUgQqpOr3WY_DkcFM680wA":{"text":"Legend has it that this Popeyes (well, any Louisiana Popeyes) has a distinct and different","useful":3,"cool":2},"6r_t5tLl12ZUxK-aNZ4Vxg":{"text":"During my NOLA vacation, I enjoyed eating at this popeye's location. I tried their fried c","useful":0,"cool":1},"-d2wMiE5w4xXV3aoOWYB6Q":{"text":"This place is insanely good!!! People working there were so enthusiastic and nice  we had ","useful":0,"cool":0},"G7sPSc_ANI3_sYLzZ7ezBg":{"text":"\"Popeyes in New Orleans just tastes better!\"  This is what people say anyway.  I hadn't ha","useful":1,"cool":2},"7H3c2UTntdhyeuAqD4HgAg":{"text":"This place is no different than other locations, other than cheaper compared to Maryland. ","useful":3,"cool":0},"oZyeWBXYBy32gQSKYeCK9A":{"text":"I didn't know that fried chicken is local to the South. But they really does a good job! T","useful":1,"cool":1},"_uN2Lg9_XAKV5tlzZAmIDg":{"text":"The food is great but the employees are assholes. It reminded me of eating in Army trainin","useful":1,"cool":0},"pvVogOnmyWXOFiFWzJCJEA":{"text":"50,000 KIDS IN TOWN & I STILL HAD SWIFT SERVICE\nthat might not be a big deal in Omaha but ","useful":5,"cool":0},"fdECMITRmiwkNV3l4PUPRQ":{"text":"We dined here during Mardi Gras weekend 2020. Due to Covid, I'm late on the review but it ","useful":1,"cool":1},"BQAqOX0-caL4_r0PC6Qg_w":{"text":"Typical fast food chicken.... good spicy tenders and red beans & rice, but the service and","useful":0,"cool":0},"-ehNVFmOOFfCaB63Jd74lQ":{"text":"Boy oh boy! These kids do not know how lucky that they are employed. Walked in and walked ","useful":1,"cool":0},"RslGVhWTi6S4SP7nMbKdEQ":{"text":"People no to friendly the server put his hand rubbing his nose was disgusting. I am from c","useful":1,"cool":0},"idiTHTQ265ndITqHKVTKMA":{"text":"We live on the Southside of Chicago, behind a Popeyes that we're addicted to. Naturally, w","useful":0,"cool":0},"FyXpWlg167lS4r-HxL-gBw":{"text":"This is the best Popeyes I've ever had. I would assume that Popeyes in Louisiana would be ","useful":3,"cool":0},"vZWX8hkA7YGYlQtVFXKCyw":{"text":"Came here today for lunch. Our tour guide told us popeyes is best here so we had to try it","useful":1,"cool":1},"sYLCePqYkCVS0CFlTlJuTw":{"text":"If you have not had Popeyes at 12:50 AM, 10 minutes before closing time after a night out ","useful":1,"cool":0},"o3yYQ5dno9JNXpztIDIjpw":{"text":"Clearly we hated the food . Definitely the most efficiently run Popeyes I've ever been to.","useful":0,"cool":0},"R-g5bJf1IYy7Kf_3imLIog":{"text":"We did not feel safe not welcome at the Popeyes near Bourbon Street.  Many homeless just h","useful":0,"cool":0},"aLMmG3N2tu_6TbigDgfXeQ":{"text":"I love popeyes, but its kind of weird to see some employees to start eating in front of yo","useful":1,"cool":1},"20pUINKPgjaZGQHa-_bdDw":{"text":"Horrible Popeyes.  Seems like they were out of everything.  No tortillas (for the loaded c","useful":1,"cool":1},"vTukyNDSNO_YpXs9P-KeYA":{"text":"Yes, I am giving a fast food restaurant 4 star, in fact 4.5 star.\n\nSeriously how could Pop","useful":1,"cool":2},"QKtXigwwoC2fbnFIX6osrA":{"text":"I must say, if there is one thing I NEVER eat, it's fried chicken. Unless it's chicken nug","useful":3,"cool":2},"HSl_Fz7mqQa3O5YX6CFBtw":{"text":"This review is not based off service or the staff, just the food. The fried chicken was re","useful":4,"cool":2},"qaStIR0_WbMG2_Hm1yEfQA":{"text":"Wanted to have a quick lunch during a rain shower. Bad luck, that we stumbled upon Popeyes","useful":2,"cool":0},"sDP1qzZj3fRjiF9as9PvOQ":{"text":"Not a pleasant experience at this Popeyes location, and I was not even under the influence","useful":1,"cool":0},"zmw5YTkPAS31DbsGUczCgg":{"text":"SERVICE IS AWFUL! Expect to be ran around this place when ordering your food. Let's start ","useful":1,"cool":0},"x7moKxkUvnCEFVbxKwQzTw":{"text":"I love popeyes, literally one of my favorite places to go to. The spicy chicken sandwich d","useful":0,"cool":0},"kJrAVDrTVtnPZJ_SRTCZjg":{"text":"Employees were nice. You use the drive through after ordering online.  With family coupons","useful":0,"cool":0},"u87gjRUnLq-aCpqG5EK_hA":{"text":"After a long day and a big lunch at a NOLA institution, we wanted an Abita beer in our hot","useful":0,"cool":1},"cUazquhYhS6bukR3S0oJbg":{"text":"So much for southern hospitality....The service was so bad here we canceled our order.   W","useful":2,"cool":0},"_OuTo0B_bh4707xdhRReNQ":{"text":"Food was good but the employees were awful. We waited forever for our po boy, so long our ","useful":1,"cool":1},"7IQz8tysmOfQVX2fOl1New":{"text":"What is wrong with the workers here?   They seemed bothered when you try to place an order","useful":1,"cool":0},"pWgW1Bv1E2iyyiFuKX713g":{"text":"Not a pleasant experience at this Popeyes location, and I was not even under the influence","useful":1,"cool":0},"VCOrdaXsyNZxyz1XTGdOaA":{"text":"THIS PLACE IS A CHICKEN MACHINE! Seriously. I love any and all Popeyes (in Louisiana). \n\nT","useful":1,"cool":1},"xWjdftgyFQ_zWifLD3eDGA":{"text":"Do not waste your time or money on this location. Placed an order for a tender combo that ","useful":1,"cool":0},"__IzDu4Oi4yvR-YVprOBQA":{"text":"First time in New Orleans and they say Popeyes taste different here. Tried to go to Popeye","useful":1,"cool":0},"G4kwbIUiMXKtrv2SALpFYQ":{"text":"If I could leave zero stars I would. Came in for a chicken sandwich only to find that they","useful":0,"cool":0},"IEPqqK60IVYtnqikJi43SA":{"text":"I think someone ate 1/2 my red beans and rice as container was on 1/2 full. Asked me about","useful":1,"cool":0},"XcsuG-8EFM5_10YW9jzWQg":{"text":"One of the best Popeye's I have eaten was at this location. New York Popeye's are a hit or","useful":0,"cool":1},"GGfqxbGLjkG0uqAquDDDww":{"text":"The new spicy chicken sandwich is Outstanding! Yes, it is better than  Chik-fil-a sandwich","useful":0,"cool":0},"yKayZSw0GJR7DgA24uW4gw":{"text":"If you're from somewhere else and seen the commercials,, this is that restaurant they show","useful":6,"cool":2},"DPevlukKVy1mUu-cIekEpg":{"text":"Please let this and the many other reviews here disabuse you of the rumor that NOLA Popeye","useful":4,"cool":1},"u3nL4ADqiOsgl30lb8jhgA":{"text":"We were singing love that chicken from Popeyes all the way to New Orleans! I finally got t","useful":2,"cool":1},"KoHmCVjsrJk5uZY9RHxlqw":{"text":"They laughed at us West Coast people for waiting in line for their fried chicken sandwich.","useful":14,"cool":12},"hQO4C9ZT8BDPnPba-0ImPQ":{"text":"Listen. Popeyes is my favourite fried chicken chain. And this was the best Popeyes I've ev","useful":1,"cool":0},"f0nMK_XHyszWvOcEofyMGQ":{"text":"This place differs from what I have had in other states. I was once told by a famous frien","useful":6,"cool":4}}