{"tPq4SGj_ccG7hbiTtog_UQ":{"text":"I have had problem skin for almost my entire life. I began struggling with acne and acne s","useful":0,"cool":0},"KNSNCsxfOVXAqj5KGXSfbA":{"text":"Dr. Holcomb has done a very nice job in treating all of my skin ailments. She is very know","useful":0,"cool":0},"UazRfLut970klp73aZK1TA":{"text":"I wanted a Fraxel treatment for freckles/ acne scars. There were other dermatologists and ","useful":1,"cool":0},"VqZXcxC9YzBr8adfxqkEOA":{"text":"Dr. Holcomb addressed the issue regarding the unfortunate events during my prior visit to ","useful":1,"cool":1},"H8MIH2rPelA9ugLsN9JuAw":{"text":"Dr Lupo has an incredibly gentle touch. The skin on my face is the most sensitive on my bo","useful":0,"cool":0},"jq5zNn2i19h__oLm6o3MJg":{"text":"Dr Lupo and her office staff  are really sweet and helpful !! Dr Lupo is a wonderful woman","useful":0,"cool":0},"KXfpDsYmdxeNMvayttRWGA":{"text":"I had my first visit today. The waiting room was comfortable, and there was a short wait. ","useful":0,"cool":0},"rGqFfsvXK8u02wQpswZtfg":{"text":"I have a red mole on the tip of nose turn out to be a misplace blood vessel. I got treated","useful":2,"cool":0},"UFv_6q-5ObOBxiNyNlnD2g":{"text":"I visited Dr. Souyoul for DPN removal & my skin is now much clearer. Very little pain invo","useful":0,"cool":0},"pimnLXq8RSFQr0H_-5vo6w":{"text":"Dr. Lupo is simply the best. I've been seeing her for several years and there is no one I ","useful":0,"cool":0},"AG1UZw09_zzgMEJYeauQMg":{"text":"Dr.Skylar Souyoul seems to not have any bed side manners. \nShe makes me feel rush and does","useful":4,"cool":0},"QtVj7itpM9KdrTA6nWoMcg":{"text":"I saw Mary Lupo  for botox and filler, last year at age 45.    She had other people in the","useful":4,"cool":0},"0Ye_sWSaKdA5jr3OOVIn9g":{"text":"When you walk into a \"dermatologist's\" waiting room and you see numerous pamphlets and lit","useful":3,"cool":0},"6NwUKQiCrZS9mQBGNIezRg":{"text":"I saw Dr. Skylar Souyoul recently, and, as someone who works in medicine, I have to say th","useful":5,"cool":0},"_zCa3eio8RmxZnGO-Aokiw":{"text":"I don't get the hype. Maybe she's good at botox and fillers? I wouldn't know about that. I","useful":4,"cool":0}}