{"FVS5Hv64AzemBKA1xRStSQ":{"text":"Really enjoyed seeing so many flavors of popcorn, especially flavors that are special to t","useful":0,"cool":0},"dQyISULmMyGD2aYiVJUF6Q":{"text":"Popcorn heaven!!!   Service was EXCELLENT!!  He was so patient as we sampled the whole sto","useful":2,"cool":3},"xgB_0SwmG8PaEI78-qsj9w":{"text":"So many choices and flavors to choose from!! This is popcorn heaven. Lol. I definitely tri","useful":0,"cool":0},"1T0XstdMCqHMVXuA-DhX7g":{"text":"I am a huge popcorn fan and seek it out whenever I visit new cities.  We were so excited t","useful":0,"cool":0},"KDQk2LEc6j1dkJ-AWmIC5g":{"text":"All the different popcorns were great. I got the cajun, and will be ordering from them in ","useful":0,"cool":0},"qxqu_biBQDjpb90KvnIMAA":{"text":"amazing!! wild variety of flavors such as strawberry cheesecake, oreo, barbecue bacon, mov","useful":0,"cool":0},"7MNIyWFuNh20rxxao1C33w":{"text":"Tiffany provided FABULOUS customer service at the Popcorn Bistro at the Riverwalk! She was","useful":1,"cool":0},"xM2RHEKizqnaP3xseKPlVQ":{"text":"Visited this store while at the Riverwalk Outlet in N.O. This store had a wide variety of ","useful":0,"cool":0},"zEGWZqe0_g7Pe_sIfhHX3w":{"text":"I always see Popcorn Bistro at Lakeside in Metairie but had never gotten around to trying ","useful":0,"cool":0},"c0qiTE5zax17XyBiuj2w5Q":{"text":"So many flavors I couldn't even decide. But the free samples were yummy. We bought the cak","useful":0,"cool":0},"Cm0fLBR28_JhGCUj2u-VwA":{"text":"Over 100 flavours of popcorn and you could be there for ages trying to choose just one. \n\n","useful":0,"cool":1},"xPid4ihB_MIxRHxqQN_qXA":{"text":"This place is amazing. Every flavor of popcorn you could imagine - from savory to sweet!  ","useful":1,"cool":0},"lqBpQHm42Fo1BimGa3j6sA":{"text":"The popcorn at this shop is delicious. The costumer service is absolutely awful. We asked ","useful":0,"cool":0},"9O_Ofm0XQVMOpBymbozkwg":{"text":"I was way intrigued by all the flavors at Popcorn Bistro. I mean come on, PB & J, birthday","useful":1,"cool":1},"uB4yY9KMvdrI87LRWAen2w":{"text":"As a popcorn lover, this is true heaven! So many different options to choose from, all odd","useful":1,"cool":1},"ZGtHtuN_w1rxt4abxkxbbQ":{"text":"Bad service. Wrong popcorn. Tried to work things out but no go. Haven't tasted the popcorn","useful":0,"cool":0},"wjnlcKtaXv7PGnq5ko4Hig":{"text":"I usually buy Popcorn Bistro popcorn (great popcorn) when they are set up at Lakeside Mall","useful":0,"cool":0},"eBbT1UzsoOGl_H4Ii2v0Xw":{"text":"Over 100+ flavors of popcorn, with NoLA specific flavors such as beignet and boiled crawfi","useful":1,"cool":1},"E_93LtiONkveUzSY645VUw":{"text":"Get the mini size so you can try a ton of different flavors for cheap. There are so many p","useful":0,"cool":0},"RIwRZze4Vo7BY-R5wcNWvw":{"text":"Tasty popcorn with numerous flavors to choose from! After smelling the popcorn as I ate lu","useful":0,"cool":0}}