{"4VY-RKQ1X1mSiQJ-yxYYnQ":{"text":"Very happy to have found Bob's Plumbing! I was without hot water and struggling to find an","useful":0,"cool":0},"FlOdLD_CEuTK8UkbQZAD7Q":{"text":"Greatest service experience!  Ever!  So professional.  So knowledgeable!  Such nice people","useful":0,"cool":0},"SjhzTjXvKJVLY4jtTGAF0w":{"text":"Great fast service very reasonable price. Thank you Bob's Plumbing. Trying to replace my k","useful":0,"cool":0},"az1oJPSaXv3KCy-_j4E7OQ":{"text":"These guys are fantastic--don't even think twice about booking them for any of your plumbi","useful":0,"cool":0},"tMz-htrJbVZQjhvWcOyFRQ":{"text":"I called Bob's Plumbing on a Friday morning and they answered promptly. I explained that I","useful":0,"cool":0},"yy36dqSUxDi8pkrDEzCxFg":{"text":"Bobs is simply the best plumber in the city!! Always fast and reliable and always reasonab","useful":0,"cool":0},"ZC-24MxFnlQK8kXVcT4FNQ":{"text":"We have used Bob's for years. They are honest, friendly and they do a great job. I highly ","useful":0,"cool":0},"jAjtoi3j_t3mTjgMQoJxRg":{"text":"Courteous and responsive. I needed my garbage disposal repaired and I got a call the same ","useful":1,"cool":1},"oWd75GapVw6IcQhILD1wPg":{"text":"I needed a new water heater.  Bob's Plumbing not only was knowledgeable, they were fast, f","useful":0,"cool":1},"IxNzo9RmMjp2P5UDMtOuKA":{"text":"Needed an outside faucet replaced, a leaking kitchen faucet fixed, and wanted a garbage di","useful":0,"cool":0},"7tzlgxuG7fOWr2Ur60H3Nw":{"text":"These guys have been doing our work for years. Very reliable. Nice people. They just insta","useful":0,"cool":0},"OuzB8HT9lrW5N4pGX9--_g":{"text":"Fast response and good service.  Replaced our garbage disposal and fixed leaks.  Highly re","useful":0,"cool":0},"UVadRI6uc3t1tGqtDp2cRA":{"text":"Bob's Plumbing was quick, professional, and they don't charge any more than is absolutely ","useful":0,"cool":0},"5EL3jLTzza53OeYOAxwPPA":{"text":"They didn't support the floor of the upstairs bathroom shower that they installed so here ","useful":0,"cool":0},"hzhTNo-HOA0PHHdhmYaRaw":{"text":"I called Bob's Plumbing regarding a hot water heater vent pipe that had become dislodged w","useful":0,"cool":1},"bobNKv926SvsBZ37fNgm-A":{"text":"I live in Boston and had \"emergency\" plumbing needs for our house in New Orleans.  I had o","useful":1,"cool":0},"wC5lEBhImsYnf1il5DLUsQ":{"text":"My 3  year old hot water heater needed to be replaced. I spoke to Frank, he explained ever","useful":0,"cool":0}}