{"nULpMQ1xi-WSxE3z0lMy4A":{"text":"Went to Three Muses our first night in New Orleans. The plates are tapas style, small and ","useful":0,"cool":0},"i9wzer9wJInHnlh6zVH56w":{"text":"Made reservation a over a week ago with request to be near band. On arrival they had no re","useful":0,"cool":0},"SbSE18-RPzZXtgxab3JW3Q":{"text":"Another gem on Frenchmen.  We made it in just in time to grab the corner tall table and en","useful":2,"cool":1},"agbkYpZm-S9ppWQBpfIxfw":{"text":"What's all the fuss about?  Food is mediocre at best , service was marginal. You are alloc","useful":0,"cool":0},"3TARi_spDx3FfTmZXktAiQ":{"text":"We had a reservation and were seated immediately upon arrival. The menu consists of small ","useful":0,"cool":0},"KH9O1_ibrfH3Ted7FKr6Jw":{"text":"Perfect place to take visitors. The plates are small and pricey but flavorful. Drinks are ","useful":2,"cool":2},"qR3bwLbHj7_vr7rCcrFX2w":{"text":"A lil cozy bar/restaurant on Frenchman Street.  Small plates, good music and service.","useful":0,"cool":0},"YEA52nWL2opYmwF5SHP8KA":{"text":"Came here on a whim a few years ago.  Was hoping it was as good as I remembered.\nI\nWas\nNot","useful":0,"cool":0},"daLSvHIhA3kJOwBC8Ojp-w":{"text":"Op suggestie van yelp- hier geweest op onze eerste avond in NOLA tijdens onze roadtrip (da","useful":1,"cool":0},"4TKdclnwnhBsKCwrq1Im4w":{"text":"Three Muses you are a gem and my favorite dinner spot in New Orleans. The wait was worth i","useful":0,"cool":0},"LIlWb1WTwvuomHZmMEq7cQ":{"text":"We stumbled upon Three Muses during our first few hours exploring Frenchmen Street. We put","useful":2,"cool":3},"Z31F-nugb_9kAUaFvb3rdw":{"text":"A tour guide perfectly described the difference between Bourbon Street and Frenchman Stree","useful":2,"cool":0},"LY382T-3Z9Q7AIY1c608Rw":{"text":"This was a fun place to visit for a light dinner and some great entertainment with the kid","useful":1,"cool":0},"pciKtFPjpBOXaBSdSK2VDQ":{"text":"The ambiance and live music here is fantastic. The band was pleasant and not overbearingly","useful":2,"cool":1},"6TQGwZbLo-j74NnNh81HqQ":{"text":"Girls at front were awesome. Empty tables being held for later reservation. They said you ","useful":0,"cool":0},"kL5JwIzR0Jga104O6pOBNw":{"text":"Three Muses is a tapas bar unlike any other I've frequented. Gone is the pretentiousness t","useful":1,"cool":1},"HN0eNvVrfbsNUF4WePlrAQ":{"text":"Had the best time at 3 muses! Made a reservation (highly recommended as this place is smal","useful":0,"cool":0},"HgtPv4yeoUDE7f9hf8-sKA":{"text":"I don't think I've eaten this much in a really long time.  I think we ate almost everythin","useful":0,"cool":0},"ee8FlqKRe6w9jD0UV3l9fw":{"text":"Great atmosphere and good music. This place is a hidden gem in NOLA and is away from the h","useful":0,"cool":0},"GHdeI2HLMWinzUgqcNnDNQ":{"text":"Specialty Sazerac. Specialty moonshine! Yucca fries. Brie, garlic cloves, onions, and brea","useful":0,"cool":0},"fyDqXjG6lsW9lYuzmPnxfw":{"text":"Wow, great meal on Frenchmen Street... scallops, feta fries, pork belly, lamb burger, very","useful":0,"cool":0},"4GqszIQE70FqdKWS91f-vA":{"text":"By now you've read what type of place this is.  It was just as fun and hip as others say. ","useful":1,"cool":1},"Uwhbs_vNGVG8badTsgVIAA":{"text":"I fell in love with Three Muses after looking at Yelp reviews and the restaurant's website","useful":0,"cool":0},"0Q8Rpwg1o2gzY2zdLRMbBg":{"text":"Phenomenal!\n\nI was in NOLA for a conference and a local suggested this restaurant to me, s","useful":0,"cool":0},"GOqMeinGFlom6JnYRhbs2g":{"text":"Yes! So good. Whiskey cocktails are infinitely complex and well made. Also, I have a thing","useful":0,"cool":0},"SGqE7VmQXLIXRLIZ0w_Cew":{"text":"Food and music were both fabulous. Our large group ordered a wide variety of dishes and we","useful":1,"cool":0},"FKIHUpt1mDxX907R34U-UA":{"text":"We rolled in here around 5:30 on a Friday night so were still able to get a table. It got ","useful":0,"cool":0},"aDUXrohQnPxmKcqH3_y95g":{"text":"This place is magical. Anytime I'm in Nola I make reservations here. The food is always am","useful":0,"cool":0},"tH6JH2GAmB9oBFQL5_dfZQ":{"text":"I came here on vacation with my husband via Yelp reviews. This place lived up to the revie","useful":1,"cool":1},"pFIHskLG0sp50WhxIr1prw":{"text":"I have traveled all over the country, and numerous places around the world...and this is o","useful":0,"cool":0},"K6owxJRIf7qC-YeYEwEF6w":{"text":"Great cocktails....music wonderful....small plates which was perfect.  We had the meat and","useful":0,"cool":0},"komu2KoDWPTmPxEyGdJj1w":{"text":"Kinda of a tourist trap. The setting is nice and the music was ok (although not really jaz","useful":0,"cool":0},"MNBKQrJD1ymX9eoHrN26lw":{"text":"It's a tight space and usually very crowded - you can often find 1-2 hour waits for tables","useful":1,"cool":1},"8Jr7pu-6BqujrrcZXwaK-A":{"text":"What else is there to say about 3 Muses?  Creative, reasonably priced food by one of my lo","useful":1,"cool":1},"b7Ml4J2NVBs97d6sUpB7dg":{"text":"I would live here if I could.\n\nOur first visit we got the lamb sliders, corn and crab frit","useful":0,"cool":0},"CEy1G4TZYlYQlpVMdlXFuQ":{"text":"I dig Three Muses, because it's close to the touristy French Quarter, but is so totally, r","useful":2,"cool":1},"9qlh4gxtwG3N6KFBol8XkA":{"text":"I love this bar and their food!  The music is always great too.  But I recommend going on ","useful":0,"cool":0},"VvQ243yQkze022fje6q9sA":{"text":"Cool spot. The band was awesome, the ambiance is fantastic, the service is good, the food ","useful":0,"cool":0},"cDs48tFVuqTZJTFmvUP3Gg":{"text":"Ah... Three Muses.\n\nWhat are the three muses you may ask? Well... if we weren't so lazy, I","useful":2,"cool":1},"5MIBCbkySa16kON7Zc-GzA":{"text":"can't wait to go back.  Tapas was the perfect way to go here.. because I wanted to try eve","useful":0,"cool":0},"D30l3Rm-HS7aCPvLL0FBkg":{"text":"We got to the place and there were no more available seats for the night. The hostess offe","useful":0,"cool":0},"xjfyW2bBWaVUX-U3d3IhFg":{"text":"This restaurant is such an experience. Live pianist, selective but fantastic and untraditi","useful":0,"cool":0},"xHScUzhUzmQ0oH0CwN84bQ":{"text":"In New Orleans, it would be shameful not to drown yourself in liters and liters of hurrica","useful":8,"cool":5},"CP0tAtc31lgNRXkb81ZiSA":{"text":"I had a wonderful evening there.\nNice, fresh and well prepared tapas, friendly staff, tast","useful":2,"cool":2},"L8mmlGjcRlwpoozxZqcltQ":{"text":"Love!! We got there right at 5:00 as they were opening on New Years Eve and without  reser","useful":0,"cool":0},"sI8XG8lPyDHCgHUhmhswrA":{"text":"I had the lamb sliders, my wife had the duck pizza.  Both were amazing.  The duck pizza wa","useful":0,"cool":0},"eebKcoXOCewHV0TlXwaS5g":{"text":"So much to muse about the Three Muses! Located in the heart of the French Quarter, it's on","useful":6,"cool":1},"Ng90VqoWj8RDiBPZwmEE9g":{"text":"This place is great, I really didn't want to love it bc I'm such a fan of green goddess. H","useful":1,"cool":0},"AkCUW79RyGimjXhnMO_OhA":{"text":"Prices are high but theres creative cocktails and trendy food. Lamb sliders were amazing a","useful":2,"cool":1},"LGUXIBaB5dsehlHeuYYVwg":{"text":"We had pork belly, bacon dates, fish taco and rice bowl. The pork belly is really good. I ","useful":0,"cool":0},"wqDYDVyOYFkVMCnY7KLAMg":{"text":"As with all other places on Frenchmen, the music was awesome. I enjoyed this place because","useful":0,"cool":1},"gpcCImob-7t3_knM_NTw1g":{"text":"Here for a medical convention. HATE Bourbon Street. If I wanted another fraternity party, ","useful":1,"cool":0},"Jv-ZBciul7QTr9xlFScMjw":{"text":"It thought it would be hard to get a res on a Saturday night, I called ahead & Candice the","useful":0,"cool":0},"t_R19AQYAASB4TY2eag4Xg":{"text":"Would you believe me if I said the best thing I've tasted on my visit to NOLA is from Thre","useful":3,"cool":2},"o0KUz8naAb0lrjekTgt92A":{"text":"Had dinner last night with 3 friends. The food was amazing! Everything we ordered (max n c","useful":1,"cool":0},"P8kgIQckTLPlZH2xR78d2A":{"text":"I liked Three Muses a lot more than I thought I would. It's definitely a small plates plac","useful":1,"cool":0},"IC91rmgk54jgSa0UDtQ7kg":{"text":"This was quite a surprise. We will never ever step a foot into this establishment. Hostess","useful":1,"cool":0},"YQgF7KN2yK21_ZyuvF63MA":{"text":"Pretty cool joint.\n\nA little tight, but the music was on, and 15-year old looking kid blas","useful":0,"cool":0},"8KiI1pM7wZH3TRTqb4PUKg":{"text":"This was by far one of my favorite places on my recent trip to New Orleans.  Our sweet bar","useful":1,"cool":2},"PSlSstJA0f_BRX1N_ju15Q":{"text":"The food, the drinks, the music. Make a reservation now and you won't regret it. Bonus poi","useful":0,"cool":0},"3SxKXFvE-SbVKKeD2_Ob5Q":{"text":"We saw a fantastic jazz quartet while in New Orleans here, and the blueberry martini...yum","useful":2,"cool":1},"yEOIOTJWhT5ngLhC94bMlQ":{"text":"my friend and I had reservations and were seated in the last seat on a busy Wednesday nigh","useful":0,"cool":0},"FNyMIg9GpS9ep5E7S4yjfw":{"text":"Oh Hell to the yes. Ma Moons Bulgogi Fice Bowl, with duck egg ! Korean food in New Orleans","useful":0,"cool":0},"hsG-QETvGNUbewBtUezx1g":{"text":"Open table allowed me to make a reservation for 9:30pm. I get there and  the band says, we","useful":2,"cool":0},"NGSgLuXFZvA1vccki7VsjQ":{"text":"Thank you Yelpers for helping us find such a gem of a spot! Three Muses feels like a littl","useful":0,"cool":0},"eHjbHAn1L-lg8Hi3Lz-2uQ":{"text":"Love this place!  Only place to sit is the Bar where you are over the chatter of dining pa","useful":0,"cool":0},"DzclVjmhFR3mavcsFl9Qgg":{"text":"Found this place Yelp and tried it out. Awesome atmosphere. Small plate dishes which was p","useful":0,"cool":0},"JfUnnHYz54UvajpeTHUFhQ":{"text":"I'm not sure why the negative reviews for this restaurant. It's very good. Nice selections","useful":0,"cool":0},"zXz3PNyDwwDdHORM45NB3w":{"text":"Adorable restaurant! Cozy atmosphere (quite small but that's another reason I loved it) an","useful":0,"cool":0},"UUkOmlYcL9upO_NNRgPgxQ":{"text":"After being at Three Muses twice, I can confidently say they're inconsistent.  First time ","useful":2,"cool":0},"dHsq9HK5DH6ZsEtI5KSr2Q":{"text":"Had steak and (crab) cake.  Ambiance and music was excellent.  Service was a little slow. ","useful":0,"cool":0},"2Mr3HBmyXDq2Bm3qGFqZ7Q":{"text":"Met Jennifer E and her hubby here for dinner.  The place is small.  There were five us is ","useful":0,"cool":0},"QCkkLeerWo87SreXADhAHQ":{"text":"This was our last--and favorite--stop in New Orleans. Part of that was the band (Loose Mar","useful":0,"cool":0},"fuanw0Q5YtATYSNi5I7-pw":{"text":"We arrived just in time before the place became packed.  It was Friday night and we wanted","useful":1,"cool":1},"q3b-0zVQS3eXnmHCqQ4-TQ":{"text":"My experience? Good...okay. It needed some flavoring. Too expensive for the size. \nThe att","useful":1,"cool":0},"fsMeQmcBg0j3b1HCteTGjw":{"text":"These were the best cocktails we had in all of our stay in NOLA, hands down - and the pork","useful":0,"cool":0},"3m7OlLMD6ICxrkhMd2C9-w":{"text":"My dining companion and I ended up at Three Muses by complete accident. We've made it our ","useful":12,"cool":7},"Y_EpeBeOJqghKDqNXUJD9A":{"text":"One of our best nights started out here! Make sure to grab a reservation! It's a great pla","useful":0,"cool":0},"e8wlYAgiY-my3FXkVmmt0A":{"text":"Awesome all the way around!\n\nYou expect a great atmosphere when you're on Frenchmen street","useful":0,"cool":0},"WAdOp_Mgb6SmmTK2N3u9CQ":{"text":"If I lived in Nola, this is where I'd want to hang out with friends. Cool easy going vibe,","useful":0,"cool":0},"Ntch_BWBUEQIivA1CQBKyg":{"text":"Great vibe, great drinks. Try the Only Child, a fancy take on a rum sour. Menu looked good","useful":0,"cool":0},"1AujHTWg2GOzPfv6jKSBxw":{"text":"This was the first meal on the first day of our visit to NOLA. We were prepared for a long","useful":2,"cool":1},"QHZlWLI6ZKjlSinpJXg0qQ":{"text":"Wonderful place! Great music, great food and great drinks. Lamb sliders and feta fries wer","useful":0,"cool":0},"lF8belyB0b-MjwCvgup7ow":{"text":"This place I must say was probably in my top 10 dining experiences ever !!  If you're read","useful":1,"cool":0},"-yxjRbiir1npmiqSRuzuIQ":{"text":"We were told to avoid Bourbon Street and check out Frenchmen Street for dinner, drinks, an","useful":3,"cool":1},"qhoLHL-OxzdAGiq5NBaUPQ":{"text":"We decided to make the Three Muses our destination for live music in New Orleans.  \nGreat ","useful":2,"cool":1},"78ebe8OVsdDWeXqccwutKw":{"text":"We really enjoyed our meal here. Inside staff was great and attentive. Young gentleman doi","useful":0,"cool":0},"0-6Aknvtt9Auf9ayNaM4Ww":{"text":"(I never yelp, I downloaded the App just because of my experience here). Truly atrocious s","useful":0,"cool":0},"bTc0GWUk4W0FE_Qy2G50RA":{"text":"So....went here again last night! I'm such a pig. There was real laid back band playing wh","useful":1,"cool":1},"76_9n_cr3S4haxHjAOc2kg":{"text":"I don't review places often, as you can see, but I couldn't skip this one. Here's the deal","useful":1,"cool":0},"cW0HNbol_IKmlTyGhVPvjw":{"text":"They have a very creative drink selection and the food was wonderful. Wait staff was frien","useful":0,"cool":0},"ZskfZNMJAFlIubcHCPccRg":{"text":"Outstanding!  Music was great and everything we tried was delicious!\nWe loved the kale bru","useful":0,"cool":0},"pbkbiwAiNeELJn94DJFQHA":{"text":"We ate here for dinner and waited a brief ten minutes to get seated. We were sat at the tw","useful":0,"cool":0},"_h0EVchLXVtPT83rEALVXw":{"text":"Food was good!  Music was good.  All in all a good experience.  It was a little strange th","useful":0,"cool":0},"oCauJIQOmkXeNnP1efHpbg":{"text":"This is a cool New Orleans bar and restaurant.  Want to experience the big easy like it's ","useful":0,"cool":0},"KlbNqjtY6xKnRqril3VdkA":{"text":"Great atmosphere. Very chill tapas place with intimate live music. The drinks were well ba","useful":0,"cool":1},"6srkK41qbsQjMkzq5FG3Kg":{"text":"It's unacceptable to wait 2h30 to have a table, the welcome waitress said 45min at the beg","useful":0,"cool":0},"TtHtfg6AaOgJ2Ju2ogAqAQ":{"text":"Cute small place, but filled with a lot of charm and a great staff.  Had the steak and cra","useful":0,"cool":0},"nN8vV4XP2tKtDlNctigtxQ":{"text":"excellent food and music.  super fun and friendly waitress and hostess.  Great night!","useful":0,"cool":0},"K4hDMOlfWXZAqcbrXvLhow":{"text":"I'll keep this short:  You'll be happy you ate at Three Muses.  The six plates we ordered ","useful":0,"cool":0},"yKbWNl1GoC_0gEiQ4mA_sQ":{"text":"First off, the restaurant is located in a great part of New Orleans!  The inside of the re","useful":0,"cool":0},"AyVw3Sy41k3etqSAv5nKdw":{"text":"The drinks were cool and fun. The food was great. The service was a little slow though. On","useful":0,"cool":0},"4Nt_DZ037Yg69JV7iLRceg":{"text":"Our Uber driver suggested that we go to Frenchman Street for the NOLA musical experience, ","useful":0,"cool":0},"l7V9UFKOnTXlDtKMora_bQ":{"text":"On my first night in New Orleans, walking down Bourbon Street to Three Muses was definitel","useful":1,"cool":0},"uhE8ElW7Xqt9N5b47M8rYA":{"text":"Wow! This place was amazing. This is a total package kind of place. Great drinks, food and","useful":0,"cool":0},"WW2UHNjtT-rWINLsGXSI9A":{"text":"I visited NO for a weekend and was told to go to Frenchman St.  This was my favorite spot ","useful":1,"cool":1},"Q22MulsTWk0oIxtnl2oWFA":{"text":"My wife and I stopped by the past Sunday (Memorial Day Weekend). When my wife asked the se","useful":0,"cool":0},"_uGEhgG-MnV8dA1PRIPTQw":{"text":"I'll keep it short and sweet. \n\nPros: Great atmosphere, intimate, live performances bring ","useful":0,"cool":0},"TfX-SeevVQjSXvh3Jqul8Q":{"text":"Best food I have ever had. Great music. Great service. Tempura shrimp is a must have as we","useful":0,"cool":0},"KYileu7KMkQRdyZD4KUXLQ":{"text":"We had an amazing time Saturday night.  Returned tonight, by myself, and was told they won","useful":1,"cool":0},"D_LGtI_il4KEi3Lq5-eU4g":{"text":"Casual and classy at the same time, The Three Muses has a wonderfully eclectic menu. For t","useful":0,"cool":0},"2uool-UbM6gbrWIV9U_Oeg":{"text":"Nice live band and food place, always busy and popular, make a reservation if u tried to b","useful":1,"cool":0},"2x7X-P_pELFilWmklgqR8A":{"text":"I was SO excited to try this place, but it was a Tuesday and we were leaving New Orleans o","useful":0,"cool":0},"LZvm4AGMSQXadhbaEFCPSg":{"text":"The food is OUTSTANDING! Service is patient and attentive, this place is a gem of Frenchme","useful":0,"cool":0},"LGEsEFP527XtlirZ7wx37A":{"text":"Simply the most pretentious condescending place you can go to in New Orleans .\n1.5 hr maxi","useful":2,"cool":0},"vayNcRBwvyuZ2bz2eoO07g":{"text":"We visited Three Muses on our last night in New Orleans. Wish we had found this gem earlie","useful":0,"cool":0},"8-S1fXGUkiUZRZKr2Sa10g":{"text":"Fantastic meal, great music, great cocktails. A complete New Orleans experience. The five ","useful":1,"cool":0},"7HLhfP8m4NEUVCTUK3wMnQ":{"text":"Just not that impressed with the lamb sliders.  Extremely gamey.  However I will try it ag","useful":0,"cool":0},"xGfFqwD6JGK3Q51umWdF6Q":{"text":"When we got there they were all booked up but had a possible table opening up soon. We wer","useful":0,"cool":0},"zQKIvgzgEPDQIdq3shEd5Q":{"text":"If your'e a scallop fan, this place has some of the best. They really know how to cook 'em","useful":0,"cool":0},"OCoOd6hkmN3693rLFdcdtQ":{"text":"This place has one of the highest yelp reviews on Frenchman's street and now we know why! ","useful":0,"cool":0},"CF-gp22RUhagZSdKg6yv5Q":{"text":"What a pleasant surprise. After a lunch at Couchon Butcher, I didn't think I'd find any be","useful":0,"cool":0},"Pv-BPgVM2nhcJELd5nXPYA":{"text":"So glad we stumbled on this place! Great vibe, excellent music and the food was ridiculous","useful":0,"cool":0},"Y9B7ZiMEj-W769lnIY7ifQ":{"text":"Mmmm... Three Muses, you saucy minx. We'd walked past on Hallowe'en night and it looked so","useful":4,"cool":5},"_79GVU5W5SJE-t1ohEosEA":{"text":"Lamb burgers were good.  Service was spotty. Some bartenders were really on the ball and s","useful":0,"cool":0},"Elobq1nEMI8MKye5q3ffgw":{"text":"Having not been in the Marigney for a couple of years this was a welcome new find.  Small ","useful":1,"cool":1},"iEJNiZttsIqt1M-IEVJ3CA":{"text":"Look, there are a few affordable yet refined dining experiences where this fat boy can enj","useful":0,"cool":0},"VaX5AHO83tl382WTotCQww":{"text":"The best cocktail I had in New Orleans. \nI just wish we had gotten there earlier for dinne","useful":0,"cool":0},"vWjyuYuHTFuxL4G3lhPLDA":{"text":"three muses was a gem!  it was within walking distance from the french quarter (give or ta","useful":0,"cool":0},"lCsAisddSFUyerRxOLDZ_A":{"text":"Don't waste your time. Long line. Touristic place. Bad service. Stupid hostess. After 2 ho","useful":0,"cool":0},"uJPa14R7Tv5h82TMOmZ75g":{"text":"I can't comment on the food as I have only been here for the music and drinks, both of whi","useful":0,"cool":0},"-u57aw0h_pUNjz84o1Q7wA":{"text":"A jewel - piano near the door - honky tonk & Mozart, great small plates - surprises & tidd","useful":1,"cool":1},"x2k1Jf2xUnA2Y--dnde3lw":{"text":"Following advice, we made reservations on a Saturday, and had no difficulty accessing our ","useful":0,"cool":0},"y63vhfxnE1dgNcQKbgWUgw":{"text":"Escape the tourists and come have dinner and drinks on Frenchman St. They typically have 6","useful":0,"cool":0},"F-Z7K7BeKCk1GrWPxhBMzg":{"text":"I just loved the piano-singer there the night we ate dinner there.  He was very talented. ","useful":0,"cool":0},"AR1DDLixoxbGtvJ6KkDrtg":{"text":"I don't want to repeat all that everyone has said so I'll keep it short and simple...\nGrea","useful":1,"cool":1},"6Iz_XHMT9-LMNYsfn6XGrA":{"text":"This place ROCKS!!!! Very cozy and casual yet eloquent.  We stopped in on a Thursday night","useful":0,"cool":0},"LeaDujNM01xcNxOIMV0xIw":{"text":"This restaurant does everything right.  Food, music, and service.  The ambience was what y","useful":0,"cool":0},"9iDqKTnOZuDMZjSwiAhU4w":{"text":"THEY DONT HAVE HAPPY HOUR ANYMORE!! For some reason they are not updating their website or","useful":0,"cool":0},"s57dDd5XuZvHcggYniaIfQ":{"text":"This is the best place in the Marigny for a night of dinner, drinks, and music. It would b","useful":0,"cool":0},"Hm_YpdShcr-NQGEH_r6F8g":{"text":"Great drinks and band!  BBQ Chicken pizza and fish tacos were the best.  Great date place ","useful":0,"cool":0},"_zyITmC-V9SoTE24_RUIuA":{"text":"Awesome restaurant with the added live music benefit!  Spent New Years Eve here and had a ","useful":0,"cool":0},"KYqc67AY5n6nVWalKS2y9A":{"text":"Great music. Great service. Really good food.  Definitely make reservations here as they a","useful":0,"cool":0},"vpNs5GB0TD8o41mS4CL4bg":{"text":"After my second visit, I'm elevating this spot to one of my \"all time favorites\". The food","useful":0,"cool":0},"E74mj04Mu-ahIFLDsuufEw":{"text":"Used to be a nice place to have small plates, good drinks and excellent jazz. Now it is lo","useful":1,"cool":0},"4OdLQj8m23yQob2a9fIrMg":{"text":"What a great place! Small plates were very good and drinks were delicious. Place was packe","useful":0,"cool":0},"jeZnzYP593ZW4LpPKiLnuw":{"text":"Tried it because it was in the best of Yelp category.  Food was interesting, kind of New O","useful":0,"cool":0},"IRseLaSf7vRY0SybtA0ULA":{"text":"This place is what NOLA is all about.  It's intimate setting sets the mood...it wasn't eas","useful":0,"cool":0},"3KWAsUQAxewDPd3ZYvimTw":{"text":"Really enjoyed this New Orleans gem on Sunday, it was recommended to us by our amazing coc","useful":0,"cool":1},"XsHoJTR8b9iCQ4Nh7AWdlw":{"text":"Fantastic experience at Three Muses. It is an amazing space with live music but we had an ","useful":0,"cool":0},"c5aNjcO_tl9zQiNC4CYHNA":{"text":"Really a great place for quality live music and lighter fare food that doesn't suck.  Came","useful":0,"cool":0},"ET2V-Out_wFQgTfP1gGGHg":{"text":"We had a reservation and the hostess told us to wait (outside) while she seated walk-in's ","useful":0,"cool":0},"lP5jK3vmDbiBHflBFC6sKg":{"text":"Good food, though small portioned for the price. Getting a seat was a bitch. Music was goo","useful":0,"cool":0},"smF2r41s87M0nJyumUZ6Jg":{"text":"I never give 5 stars unless you have at least one from Michelin, but rules were made to be","useful":0,"cool":0},"hEUOn-JwuJ_5TU7YhdCNyA":{"text":"One of the highlights of my recent Nola trip. I was in love with everything about this pla","useful":0,"cool":1},"9Lv3BvV824OKZrEikb-vew":{"text":"What can I say? I love you Three Muses.\n\nThe first time I came to this bar was a little ov","useful":6,"cool":3},"E_cJxQ-0mrZeWAvmNJq4EQ":{"text":"Came by and put my name down and was told it was a 1 hour and 45 min wait.  Table should b","useful":1,"cool":0},"r6ozVZnAYhv1hkcw1ecKaQ":{"text":"Great place! Tuna, Edamame, Antipasto, Pork Belly all delicious! Lobster Ravioli flavors w","useful":0,"cool":0},"APZDj_CwPJRsQJ8Txnvq6A":{"text":"Great spot. Smaller, quaint, but with a soulful feel. Not too loud even with live music. A","useful":0,"cool":0},"DaSeieISNDXf-ow4oVBVEw":{"text":"Minus 1 star because the  price doesn't justify the portion.\n\nGreat music and quaint atmos","useful":1,"cool":0},"X_9T_NmttrxAbX4DWmoB1w":{"text":"Hand crafted cocktails, live jazzy tunes, and the best meal I had during my week in New Or","useful":0,"cool":0},"bgOmpMQLRuL_7oO_lq7tZw":{"text":"Great little place on Frenchman's street with a small stage and live music with a tapas st","useful":0,"cool":0},"yZTmBYPlR3867UIn9rihRA":{"text":"Music was excellent and the three muses fries were delicious. The fries were served fresh ","useful":0,"cool":0},"J6sEDV53rTkIpeRZINwJ4A":{"text":"The best meal I've had in a real long time. My meager self will try to write a full review","useful":0,"cool":0},"xe0Nxdve9bCp4mORrJ7DdQ":{"text":"Yelp wait list for this joint doesn't work, hostess is the rudest person, will not spend a","useful":2,"cool":1},"ymtaF4_Tzlp5ny61n9AFQg":{"text":"This place hands down one of the best gems in New Orleans. Food was good. Great Live music","useful":0,"cool":0},"hJlKOm-g6WOivwEBJ7vopA":{"text":"This place is great! The food is very good, and if you like small plates you'll really enj","useful":0,"cool":0},"wKfsA4uTUDNxIAGBk_QjVA":{"text":"My wife and I recently visited New Orleans and went to Three Muses two nights in a row.  W","useful":0,"cool":0},"iLlrHF67qiqu_ZPcF9Z8Tg":{"text":"Sometimes simple is the best way to go. Absolutely delicious tapas-style menu, strong, dis","useful":3,"cool":1},"A43ceyAriDHgk3u46ST1hg":{"text":"This place is an excellent choice for food and music in New Orleans.  They have brought to","useful":0,"cool":0},"zzRGgzJPH-602OZhU7eaWA":{"text":"One of the best Tapas restaurant we've had !! Three muses have a fairly small tapas menu b","useful":0,"cool":0},"lf5tnhsNXiTT1haMNArplw":{"text":"Amazing flavors. A great environment with wonderful food and excellent service. Tapas styl","useful":0,"cool":0},"4u7BqBrZ1OocrjZveJt9Rw":{"text":"Definitely our favorite music venue on Frenchmen Street. \n\nAmazing talent\nLively crowd\nPle","useful":0,"cool":0},"2ISdt9Cc2etpgNUZfv1MAw":{"text":"Enjoyed eating Korean/Asian American fusion tapas while listening to a live jazz band.   M","useful":0,"cool":0},"3ihRi3meYpvuikDE2oeWbQ":{"text":"Went to Three Muses at the start of Happy Hour last night and stayed about 4 hours.  The H","useful":0,"cool":0},"LpC6abelsJrTrDK51ACE_Q":{"text":"True culinary bliss - the food was delicious and sophisticated, free of convention and rul","useful":1,"cool":0},"TSO_28pihFwxlmeURTzKYQ":{"text":"Wanted to start close to the airB&B I was staying at so I wondered down to this gem. My fa","useful":0,"cool":0},"b39pVfe_ob0pgTsxk6o7WA":{"text":"We came here to listen to jazz and drink cocktails - we had already eaten when we arrived ","useful":0,"cool":0},"Ov6a853RDApS5Zpii2-seg":{"text":"Made dinner reservations for our first night in New Orleans based on Yelp reviews. Sorry t","useful":3,"cool":0},"ABNKz8WqmDvXNK2hOXe6fQ":{"text":"Three Muses is my favorite New Orleans restaurant for multiple reasons.  First of all, the","useful":0,"cool":0},"9Ub9kJs8yE12a2w9cs7eiw":{"text":"Awesome Jazz spot that serves food right in the heart of Frenchmen's St.  We took a petty ","useful":2,"cool":0},"d5xSEoh7KLXUYeIDF4IhfQ":{"text":"A great establishment on Frenchman Street. This place stands out for its great cocktails, ","useful":0,"cool":0},"d9_stNaeDWGVZPxs3DZFmA":{"text":"This restaurant was amazing! It's got a small hole-in-the-wall kind of feel but the experi","useful":0,"cool":0},"jvNUz8Jp4G0Ru09Axd1Szg":{"text":"Great location for dinner and music if you want to avoid the crowds on Bourbon Street. We ","useful":0,"cool":0},"CF5MXF73-jqfpBh6GNhxiQ":{"text":"Super friendly staff...\n\nFrom the time you get seated, you get 1.5 hours to order and eat ","useful":0,"cool":0},"kIy6G3MDr9KZNJZmcFcJ6g":{"text":"This gem was ahhhhmazing! We stumbled upon this restaurant on a recent girls trip. They of","useful":0,"cool":0},"7M7Qfkcm0mATtI1qZIUEBw":{"text":"We arrived around 5:30 and found a spot at the bar. Best decision ever. Sat through two se","useful":0,"cool":0},"oa2X_OwuhLAZCywFCvfONA":{"text":"Well we had reservations,  we're on time,  and they didn't let us in. \n\nThat's it. Manager","useful":0,"cool":0},"JbqPLl0JwxXADuRDqFEP2A":{"text":"Such good food! I recommend the short rib lettuce cups","useful":0,"cool":0},"vFvRxAYutVLulW8Yt9NYKQ":{"text":"I made a reservation at three muses on a Wednesday for dinner mostly because Alexis and th","useful":0,"cool":0},"P5xyKABOO5N-nTk9A2rFDQ":{"text":"This place was such a perfect way to spend my last night visiting the city. The jazz band ","useful":1,"cool":0},"dr8AlT12pMY35TPcJmeNdA":{"text":"If you don't mind a long wait this place is amazing. The food is gastropub that can hold i","useful":0,"cool":0},"7qwafFbDh3PgV7j9gkE3ow":{"text":"I'm sitting in this tiny, cramped, and absolutely AMAZING SPOT! You walk in, there is an o","useful":0,"cool":0},"D3eqTG6Hmj32w-w0U7hkTw":{"text":"What a wonderful evening!  I couldn't have picked a more perfect spot.  As a solo traveler","useful":0,"cool":0},"Iy3lnvAj9dPixaEG8MgyEQ":{"text":"Good food, good music, good drinks, friendly waitstaff, clean bathrooms. What more could y","useful":0,"cool":0},"S_s4HrxEqauzo8QQY2g2tQ":{"text":"Feels like you are walking into a Speakeasy...and after all, it is New Orleans.  Jazz, Blu","useful":0,"cool":0},"t7mLlgtvb4wFiOnAIVEgVQ":{"text":"Premier arrêt à la Nouvelle Orléans et ce fut excellent autant les entrées à partager que ","useful":0,"cool":0},"LcmdPFH7tl7EebXNQvrmZg":{"text":"Had a 730p dinner reservation followed by an 8pm show featuring Linnsee Zaorski. We have s","useful":2,"cool":0},"osOWFHaTVyxp5Nh6jPW9gg":{"text":"My man is known as \"The Bar God\".  Let me tell you why.  No matter where we go, no matter ","useful":6,"cool":6},"Uq68IKvtTD5oHMmHUl5vZA":{"text":"Nice, quaint little restaurant. Music was nice and the food was wonderful! Steak and cake ","useful":0,"cool":0},"xhApg7qfjfUHbXu5Hwp22A":{"text":"I love the ambience, the food (ordered the bulgogi rice bowl - it was great) and most impo","useful":0,"cool":0},"w2Ltw_9G39hpQiz-XwwlNw":{"text":"Great little local place! \nIt's all small local produce tapas style dishes, I shared the p","useful":0,"cool":0},"zHkULVsdWZDxDPFBNfZjUQ":{"text":"Had a great experience while visiting NOLA. Awesome drinks and live music. I really apprec","useful":0,"cool":0},"GEeCnpJZuP0TxbApOmyUTw":{"text":"Holy crap!! I  cannot wait til I can come here again and bring friends and family! Every s","useful":2,"cool":1},"lNauSeKkzm56dshM2qPdug":{"text":"First, the good - we were able to be seated right away. The band was great. Servers were f","useful":2,"cool":0},"DZD7N292gzpj_tnlfPDtug":{"text":"it's a bummer i cant give this place four stars, but the service was somewhat lacking.  we","useful":2,"cool":0},"MOKtvNPdPQ7jVWxg6huYKA":{"text":"Great place, great live music (not too loud, just right), and (mostly) great food. Make su","useful":2,"cool":0},"7nXRfvobFOOR84lK3PI4oA":{"text":"Stopped here on my last night before leaving LA and sure am glad that I did.  It is quite ","useful":0,"cool":0},"JxQKfndVTZ-53MkzAe8Qfg":{"text":"Freaking love this place. Every time. Andrea is a fantastic bartender. The food is tasty. ","useful":1,"cool":1},"IyJhmZoc2i2dkYpfjGo_Ag":{"text":"Three Muses is a great place to go for a laid back, if pricey (about $25 per person with d","useful":0,"cool":0},"iItOB9-uERrIxDd9z6rQ8g":{"text":"This is a paradigm shifting establishment.  My experience with the  gastropub is that it i","useful":2,"cool":1},"6LiBwFrrT-p4czbFcZXRtQ":{"text":"If you have someone in your party that is a vegetarian, this place is fantastic and has a ","useful":2,"cool":0},"JjVTa2owECTVCvsOeHvBJQ":{"text":"3 nights in NOLA and this was easily the best dinner we had (yet also the least expensive)","useful":1,"cool":0},"XoFVGoMoyI39LdNoFpxnhA":{"text":"You must stop at three muses! I made a reservation and I'm happy I did it because they get","useful":0,"cool":0},"zszeEJaPcckxJgX8yTRu7A":{"text":"Always tasty food here at Three Muses.  Chef Dan Esses does a lovely job.  I also love the","useful":1,"cool":0},"Jz0ab29ugsg6_wW__vZmEw":{"text":"I go here all the time went in yesterday to go get a quick drink and there's a new bartend","useful":0,"cool":0},"dgiMJdnO2_1zRyjNhpu9vQ":{"text":"You must try the stuffed figs. And mussels, fries, and olives. And ice cream. And music. A","useful":0,"cool":0},"k3G6XPJnWvz11zIiIvGfvw":{"text":"Hit the spot.  Great service and great fresh food! yum.","useful":0,"cool":0},"yf1ZYwIYwaC5DYGaH5z9QQ":{"text":"The. Place. To. Be. What an amazing cocktail bar! We happened to stumble upon this place d","useful":0,"cool":0},"uOa-by7qzUrnjqn_xQ2U-Q":{"text":"We did what you should always do when you are in another city, ask the locals where they e","useful":3,"cool":1},"dak7a7j_kKz9KpdiDtVqfQ":{"text":"If America has a soul it's soul is in New Orleans. I spend three beautiful days in this be","useful":0,"cool":0},"riAyAx0-SYbUiqd4g7RYag":{"text":"This place is great one of my favorite places in New Orleans but before you go please have","useful":1,"cool":0},"Rveplimyu934RpiZxClViA":{"text":"We stopped by around 9 when it was packed and got a table (at that point it was seat yours","useful":0,"cool":0},"CT5AJfn9ufM7mEEO0jiRJg":{"text":"Great lamb sliders, great rib eye bulgogi rice, great steak and crab cake. Its rare you'll","useful":0,"cool":0},"IOuDe0V-uqUJQeJNYD2LCA":{"text":"Jazz and small plates with some tequila to go around. Great atmosphere. Watched Luke Winsl","useful":3,"cool":0},"QZ0FSfqOeA04-DRCU_Pvrg":{"text":"Came here not just once but twice during a quick trip to NOLA. As a vegetarian the kale sa","useful":0,"cool":0},"YT840OswjPCanQbzGc3qkw":{"text":"We went on a rare New Orleans chilly, rainy Sunday night and warmed up with craft libation","useful":0,"cool":0},"FEcHNdHH3UsBN5dcK7hSBA":{"text":"I had an awesome experience .The food was so good must try the scallops and the  home made","useful":0,"cool":0},"aZqxJf63tIhtjn6NJ78bVw":{"text":"After a long jaunt around the French quarter we found the three muses at the recommendatio","useful":2,"cool":1},"r--T6mZLoLdioqytJv0rYA":{"text":"THREE MUSES IS A MUST!! \n\nYou cannot go to NOLA without going here! We went on a Monday ni","useful":0,"cool":0},"TPpOHuwcPSnj28P257wWmw":{"text":"Three Muses is for real  connoisseurs of culture, good food and  music  not those looking ","useful":5,"cool":4},"H_55WbE3CACMf5-Wr81LDQ":{"text":"This place is really overrated. The food wasn't really good and the service was horrible. ","useful":0,"cool":0},"7NxCL2y-4tbEkMiYb7jjxA":{"text":"Welcome to my new favorite spot! The people behind Three Muses certainly know what they're","useful":0,"cool":0},"j_1khIdhqLehvgsaK1TmGQ":{"text":"Easily the best meal we had in New Orleans. Everything is shareable tapas style. All of th","useful":0,"cool":1},"EhZ3I2Hmhf5HUilBH2oYbA":{"text":"Good food and Jazz music...what's not to love about Three Muses!\n\nThe only reason they don","useful":1,"cool":1},"3ebciUg20XzGcd3B4-6Ysg":{"text":"This review is a little late, but this place was so good I couldn't not write one.  We wer","useful":0,"cool":0},"zD8ei1d55ffyc-ebg-EmSg":{"text":"Love, love. Fun, hip, not overly touristy crowd. Fabulous music. Intimate setting to tap y","useful":0,"cool":0},"-pvDFnmhmWc_afKsefjT8w":{"text":"Is this what Paris is like? A 200 year old building with too many tables stacked on top of","useful":1,"cool":1},"yVQn9hEdPduTaz7r6w0few":{"text":"Somehow managed to make a reservation for the day after Valentine's Day - doh!  Luckily pl","useful":0,"cool":0},"9lJ1qGcweEMZtnNJjBoZ2Q":{"text":"Picked this place because of the reviews on yelp. They were able to fit us in but had a ti","useful":0,"cool":0},"bA1aPZ8-nnrF3fjONT4ULQ":{"text":"Love, love, love.  The music, the location, the Mac n cheese. It was all terrific.  I ate ","useful":0,"cool":0},"2Nyo1MoL-1PPHTfpp1kyFg":{"text":"I don't think I could say anything that wasn't mentioned before - the music that will make","useful":1,"cool":0},"GRk21lysyr3jcix2wy9n4w":{"text":"My daughter and I had a fabulous vacation in New Orleans and our first night we had dinner","useful":0,"cool":0},"0xZ8eFgkUdQlhIuqK1f6CQ":{"text":"My friends and I stopped here for a quick drink and to have a listen to the music. It was ","useful":3,"cool":1},"bd8YFeHjUVZtN_49LYpQhg":{"text":"Went early before going to eat big. Ordered the cheese plate. Perfect to share with friend","useful":0,"cool":0},"xkQqpj6IMCLN2cqxlBB1Uw":{"text":"Food is overpriced. Most reviews say it's tasty and overpriced, but I was disappointed. I ","useful":0,"cool":0},"f117n8u1VdfI499PE38q2w":{"text":"I recently visited three muses with a couple of friends over Labor Day weekend. This was b","useful":0,"cool":0},"Z7GYws8so5BZovh9e5ey9g":{"text":"Excellent food. Average service.\n\nI came here on a Thursday night on my own. I don't recom","useful":0,"cool":0},"fQcoZFcX6HAgKcmqqMDjpg":{"text":"EVERYTHING WAS GOOD. The portions are small so if you've got a group, just order whatever ","useful":0,"cool":0},"6Tv-LTrioOO4XfcRtUu7aw":{"text":"Bad costumer service. Not that great food. They got a star from me just because the jazz b","useful":0,"cool":0},"kfwN7KuVqg5KsUFvFxMeVw":{"text":"amazing food, steak and crab cake was best ive ever had. cozy fun place and good music","useful":0,"cool":0},"zvijleYFRB2ezU8ho_dm9Q":{"text":"Great place to hear some local Jazz music while enjoying a few small plates.","useful":0,"cool":0},"p6T4d8paYe-fAeDQMhsMbg":{"text":"A Gastropub/ Jazz Club in the artsy area east of the French Quarter. No reservations, bett","useful":0,"cool":0},"IU_gQKI9CRV9QQQZEk8hOw":{"text":"Beautiful place with a delicious menu! Even tho we did not have reservations, the nice hos","useful":0,"cool":0},"3In7yMQYQd3j22ioilWnNw":{"text":"Not sure why all the great reviews. Food is tapas style, which is fine but very mediocre. ","useful":0,"cool":0},"EmZMfxywNeGp2ectK2btew":{"text":"One of my favorite places in NOLA!! Tiny place, we made reservations but saw many people t","useful":1,"cool":0},"NDvHOuhb-3Lz-0S5tALTxg":{"text":"I put my name down for a table for 2 on a Sunday night. Lady took my phone number and told","useful":0,"cool":0},"IJeMIG-TWUTaWLQdjhCV4w":{"text":"Tapas were delicious. Excellent service. Good music and nice atmosphere. The only thing I ","useful":0,"cool":0},"Tf14DLc_VlebmUtptENxhw":{"text":"I love this place! Such character!\nThe beautiful hostess outside squeezed us in for a book","useful":1,"cool":0},"IEKlo9d9glOql5jds-GEJg":{"text":"The live piano entertainment was great during our light supper stopover. This small restau","useful":0,"cool":0},"8ngsRLhoKi9mkGcr5YVbIA":{"text":"Wonderful food.  Possibly the best meal that we had in New Orleans.  We tried Feta fries, ","useful":1,"cool":0},"QWAKXB1wOGc0PrGXVujAMA":{"text":"This is a new funky gem for Frenchmen street.  From the extremely casual atmosphere to the","useful":2,"cool":0},"XI6S4wMmtry_Ly98apjQwQ":{"text":"Tapas style and so good.  Service was notably genuine.   Live band played a combo of early","useful":0,"cool":0},"GKu6jrOQqFxpraXXmj3HwA":{"text":"This was a disappointment. After reading all the rave reviews and not having anything but ","useful":0,"cool":0},"xVCdyo5VF6334p4HVl2MPQ":{"text":"It's probably not why they are called Three Muses, but this restaurant provided me with my","useful":0,"cool":0},"3-yd34MHvxY-EnJCnli0cA":{"text":"Live music was great and its a great tapas place! It's definitely on the pricier side for ","useful":0,"cool":0},"BhGCow1Luc_IbnJUPadtbg":{"text":"I LOVE LOVE LOVE this place! \n\nI travel to NOLA once a quarter for work, and one of my cow","useful":2,"cool":3},"HnZPn5jvL67LowhRyKvuHg":{"text":"Food and drinks both just wonderful. Not the most robust menu but what they make, they mak","useful":0,"cool":0},"b9c2bcynPgvy7986Ue3OBw":{"text":"Some friends and I were in New Orleans last week for a conference. We were looking for a g","useful":0,"cool":0},"hSOI2uzaULEOnV-cPLHisg":{"text":"Would have been 5 stars, but caught the waitress in a lie and it pissed me off. The food h","useful":0,"cool":0},"49mnFshp4Oiv8cyM0b5tJQ":{"text":"This is an amazing place. My mother and I went there and had the lobster egg rolls, eggpla","useful":3,"cool":3},"MSMQyUE4Mqmo_28KcAGeXg":{"text":"A famous Jazz bar. Before 9pm, there are only light music that is performed in the restaur","useful":0,"cool":0},"-x0Zk2VurOhvwqVZfSVzCQ":{"text":"I could eat here every day of my life.\n\nThe atmosphere alone is so #NOLA.  There's a live ","useful":0,"cool":0},"YpS5MglxDCnk0OCARAsRdQ":{"text":"Make a reservation! Small place and small plates. Don't come starving but come for a snack","useful":0,"cool":0},"6jzuiRHV0qSgx_A3ved3aQ":{"text":"We ordered bunch of things to try- lamb sliders, pork belly, Bleu cheese dates, steak and ","useful":0,"cool":0},"GAYZgzS-bpqMqwKsqEzH_Q":{"text":"We went here looking for something unique to eat that had that New Orleans charm.  We defi","useful":0,"cool":0},"uqKXfKTgERUUNB-3a3obCg":{"text":"This is an amazing place. The food, music, service, everything. The steak & cake is top on","useful":0,"cool":0},"-Mwx1jfQAfpfAMvUrb0sTw":{"text":"Great food and live music. We tried the Kale salad, bulgogi, steak frites, and Creole Pot ","useful":0,"cool":0},"PLYbcfaNql_cchKDeYge_A":{"text":"We were seated relatively quickly, but it took a long time for a waiter to return to take ","useful":0,"cool":0},"lZZdS4sqR9IHUJlXohvIFA":{"text":"WORTH THE WAIT! This restaurant is always booked up all night so I suggest you stop by whe","useful":0,"cool":0},"P9ff31qTe7sksfjAVMcrBg":{"text":"This restaurant was a small, cozy place that I highly recommend. I loved that it was more ","useful":0,"cool":0},"ksdBHYZIfy_CpkTNRgrksg":{"text":"This is a small venue that enforces a 90 minute table limit. Plates are meant to be shared","useful":1,"cool":0},"cZ9Q6kIzdLO70QJ25JfWWQ":{"text":"Music literally the only thing saving this review. \n\nExtremely disappointed. This was our ","useful":2,"cool":1},"jn-fOTknO5ETrWtuc5RvfQ":{"text":"Wow fish tacos were the best I've ever had. The chef knew what he was doing with that one.","useful":1,"cool":1},"s1oTACj7UQ6y6DtQDVozcQ":{"text":"Great spot to go for small plates of fresh goodness and live music. \n\nWe came here famishe","useful":2,"cool":1},"EKwsCMKiR8eTmK2JlKM3Yg":{"text":"Situated in the middle of Frenchmen, Three Muses serves as bar, restaurant and jazz club, ","useful":2,"cool":0},"7TdymyVvixuygFxvAm0vbQ":{"text":"What can I say about three musses? Well, lets first breakdown the name. The word 'Muse' is","useful":0,"cool":0},"V6lkSyuKeZ0MIqlI4gu1CQ":{"text":"Great live music last night listening to Shotgun Jazz Band.  While it took a little time t","useful":0,"cool":0},"UcmRdwo7Er8IfyjyhJO7Fw":{"text":"Great little neighbourhood live music bar. We had live swing band playing setting a great ","useful":0,"cool":0},"MowLSZZ-POZCmH7RDJWF4Q":{"text":"We wanted to find a place with live music so we came here. There was a piano player, which","useful":0,"cool":0},"4zWYs5tj1t40p8z6warTfA":{"text":"Super love! Stopped in while cruising Frenchmen and had a few drinks and got the tip from ","useful":0,"cool":0},"iSKcMXdreIoHV05DiPHluw":{"text":"Which was better...the food, the music or the service? I'm loathe to make a choice. The fr","useful":0,"cool":0},"ONW4RHlVVUAe6uOWXAiI8w":{"text":"Our first meal in New Orleans and it did not disappoint! We did have a 30 minute wait sinc","useful":1,"cool":1},"d2BzQaqi98yuWOV6vaexow":{"text":"Inventive tapas-style food more likely to be found in California than New Orleans.  Well p","useful":0,"cool":0},"6SbZ4bHpgHt29AxH_CQrZA":{"text":"We stopped in for lunch after a bicycle tour.  My husband ordered the Korean Bulgogi po'bo","useful":0,"cool":0},"BU9ejqOlksOATU_AVlpt1A":{"text":"Had a pretty unsatisfying experience here. For those unacquainted, I don't really think Fr","useful":2,"cool":1},"7a6aL9V_Tz-ykH4PyWO9JQ":{"text":"Great music (shot gun jazz band) and food. As a tourist, this is the vibe we were looking ","useful":0,"cool":0},"Xl-Cp9T3__vxUB6K9YQvjg":{"text":"Lovely restaurant to enjoy music and get some small bites, in less than an hour and a half","useful":2,"cool":0},"8uPV1WEHex1at83bM6pQvQ":{"text":"Such a unique and soulful place -- with people to match! \n\nSo glad the hubbs and I decided","useful":2,"cool":0},"FpMJm9NCqcZnQj8QQtUXZA":{"text":"Awesome band, drink prices were fair, and super tasty. I had the Muse, since I'm a sucker ","useful":0,"cool":0},"Z_OExKv_nKl2abZDRLtlgg":{"text":"AMAZING FOOD!! & I'm a Chef!!. Music was awesome. Started the night with a 50s era lounge ","useful":0,"cool":0},"sEQWrygQJFU3JgbWBjpYzg":{"text":"I wouldn't go here if you are really hungry or want more than just a small snack, but food","useful":0,"cool":0},"Ix6d4vRBoMR2II1Tiz5hMw":{"text":"Awesome tapas!!! Music was amazing. Overall a very nice place to go and enjoy nice food, d","useful":0,"cool":0},"QA_5spsFDYCXK_mCno6LIg":{"text":"Free live bands? Check. \nTasty cocktails? Check.. \nBut what makes Three Muses stand apart ","useful":0,"cool":0},"Od5Vja9rIsN0eugPnANg8g":{"text":"This is one of the few places you can take minors to listen to Jazz in New Orleans, so our","useful":0,"cool":0},"7aZx_WdUmwevplspdEiLNA":{"text":"The food is amazing.  I only heard one band, but they were very good and fun to watch with","useful":0,"cool":0},"j93eFYtPqgPe20bwDKO_PA":{"text":"Seriously some of the best food I've ever had. The Steak and Cake was cooked to perfection","useful":0,"cool":0},"jL15k3I8g5KbObb0aBVr3g":{"text":"Great great great food! Cool Vibe! Tried the Tempura Shrimp and steak and cake! Mmmm mmm!","useful":0,"cool":0},"7VvLGaiIGfOtS1ylEfmQpQ":{"text":"My friends and I came here a couple times during Mardi Gras. It's small, but the food and ","useful":0,"cool":0},"QSb9oU-BIIWN9Cb3gszNLQ":{"text":"The atmosphere was chill and the food plus service...INCREDIBLE!!!  We love New Orleans, b","useful":1,"cool":0},"jhY8Arta8n1maHzkzXEKKg":{"text":"Another place where the music was amazing.  It's a nice quaint spot where you can have a b","useful":0,"cool":0},"zcp2KSL4AszivE6pDlkBnw":{"text":"I was in New Orleans last week for my birthday and we ended up going here for dinner. It w","useful":1,"cool":0},"vZ1HYp78AoizWovSZLVLNg":{"text":"Think I liked Three Muses better when it was an undiscovered gem. Food was excellent as us","useful":0,"cool":0},"yb0FW-UMGs0DFT15fCslCg":{"text":"One of the best meals I had in New Orleans! Just thinking back to the food is enough to ma","useful":1,"cool":0},"-KGFxEADXiFL4KfJYiBSxw":{"text":"I really like Linnzi Zaorski...but I couldn't really get comfortable with this place...a l","useful":0,"cool":0},"FV_fQAcRe_ZE3JeT39wC6w":{"text":"GREAT INTIMATE DATE NIGHT!!!  I highly suggest this quaint unique establishment.  The atmo","useful":0,"cool":0},"0P__AlSwiCJ5hO6NQyZSKg":{"text":"This is an intimate (small space, compact seating) venue - small but mighty.  I understand","useful":2,"cool":2},"XC5CPHyqV4P4-RFhF1EQqw":{"text":"We will definitely be back. This place is classy and fun. The duck confit pizza is AMAZING","useful":1,"cool":0},"QAoLQNdsJvrcWbXZ4IKVkA":{"text":"(5/10/13) We were told that this was one of the good places to go if you wanted to enjoy s","useful":1,"cool":1},"DnSnouviQVFfHi9psb7lLw":{"text":"The food was incredible but the service was worse than a cashier at McDonalds. The waitres","useful":0,"cool":0},"Fiu3d1rMkgQ18cj1lKuIZg":{"text":"My second visit to Three Muses was just as fantastic as the first. For my first visit I we","useful":2,"cool":0},"HevlJ5pL1pLWzfzpfIXDcA":{"text":"I'm depressed.  I'm sick, my ass hurts from falling on it, getting overly excited during S","useful":13,"cool":16},"_x9RR5ep45h5neLQWH5Scg":{"text":"Went two nights in a row, we didn't have a reservation but they got us a table no problem.","useful":0,"cool":0},"fmGUl42PoKSBHInU12UjJQ":{"text":"Love the live jazz band inside this small and intimate restaurant off of Frenchmen st.  I ","useful":0,"cool":0},"AprdBYoOQRaFXw4oGGslvQ":{"text":"a very late review.\nIt's a cool music venue with good food/bar.  We stumbled upon it in th","useful":0,"cool":2},"hPVcLAJXCHY-OzkddSo8sA":{"text":"Great vibe, the shrimp is amazing, and down-to earth staff. I had a great, romantic evenin","useful":1,"cool":0},"W-boGwb9DVqsUFMz4gS_RQ":{"text":"I know that practically every bar in New Orleans has live music, but it was pretty awesome","useful":0,"cool":0},"zR7o_oPnW_ch5mt0XFcKOg":{"text":"Everyone said we should come here. Like good tourists, we did. We had a decent experience.","useful":2,"cool":1},"UXJlhIWZ4p4fvYMNZFqAuQ":{"text":"Make a reservation at Open Table before even thinking about this place!\nAwesome small plat","useful":0,"cool":1},"861ZyoHQGxxZ50juBMJCbQ":{"text":"Packed!!!\nIf you want to get a drink- just go in.\nIf you want to eat - be prepared to wait","useful":1,"cool":1},"VtFF0Qe3ILUntRIUs0xj7g":{"text":"Because it was a weekend we could get in there in a reasonable amount of time. We came bac","useful":0,"cool":0},"gY8moiQ-ERRmK29KYYRv7g":{"text":"My husband and I found this place my first night in town.  I liked that it had options bes","useful":0,"cool":0},"CmOI5n3gDQGCR1pTybl_ow":{"text":"Adorable. Sensual. Funky. Classy.\n\nThis gastropub in the heart of Frenchmen street is the ","useful":4,"cool":5},"61PptxfDxrFo-w0Ol40v1Q":{"text":"I went back and forth between 3-4 stars. The first round of orders were amazing. The secon","useful":0,"cool":0},"t511BJG1fJARm5Z0WEpi1Q":{"text":"This is our number one destination in NOLA for music and drinks. Their fries are fantastic","useful":0,"cool":0},"uHzir9VOonNqyKmWnHORfw":{"text":"really cool atmosphere, great food.  the bacon wrapped dates were amazing.","useful":0,"cool":0},"Xig53tMjLwA07Krk_cBZKA":{"text":"Everyone told me to go to this joint and that joint (all touristy), but no one said to try","useful":2,"cool":0},"1H6Q84bAjTxdTc8KT-Bnjw":{"text":"Amazing tapas menu of great culinary gems like feta fries and braised pork belly on scalli","useful":0,"cool":0},"K3Reub3Jtihq2A0YxFo-pg":{"text":"As with other reviewers, I wish I could give Three Muses 4 stars, but the service is a wea","useful":1,"cool":0},"RBQt6ALMtB-VQxQ1aPuj8g":{"text":"I'm still in shock at how we were treated at this restaurant. We had an 8pm reservation an","useful":0,"cool":0},"NdzYwOt774oPd5kyRabQTg":{"text":"I never write yelp reviews. However, the food here was so amazing that I felt the need. Se","useful":0,"cool":0},"VMMt8e5BVY3CMLzdwZ5UUw":{"text":"The gnocchi was so good, even in a town with such great food as New Orleans it kinda spoil","useful":1,"cool":0},"k_piJBvPQ_hinPK4SXE_Kg":{"text":"If you're looking for a laid back place with decent music, great cocktails, and a bunch of","useful":0,"cool":0},"br_hn0VaQOpKQCsDMwc2cg":{"text":"Best service I've ever gotten at a restaurant, delicious food, very reasonably priced, goo","useful":1,"cool":0},"xzQiUpoell_ysX5Whio59w":{"text":"We stopped in for drinks and live music... it was great! Fast service, good music and the ","useful":0,"cool":1},"qTMZzJx1MF_1zS2JkTA_hA":{"text":"The most vegetarian friendly place we visited in New Orleans. They had more options on the","useful":0,"cool":0},"InGbGbWvWQjCehNDaYvU2Q":{"text":"The hostess was not friendly. We were in town right before Mardi Gras so there was a parad","useful":1,"cool":1},"95b6fCB_BjB5m1aYoSrDZg":{"text":"Fantastic venue. Bluesy Jazz and delish tapas style food. Definitely recommend the pork be","useful":0,"cool":0},"cwqTHKrH9vNqfg3C6TrzMQ":{"text":"Three Muses was a recommendation from the Yelp Community, so thanks for continuing to lead","useful":1,"cool":0},"q55GurmrjAxoKEOxA8bRFg":{"text":"Amazing little joint with a great vibe.  Good service interesting and tasty food.  Best of","useful":0,"cool":0},"Zct_6qU-Ee8hnVeXVHgkUw":{"text":"Hour wait for a table, no problem as there is plenty to do around the area.  Once we were ","useful":1,"cool":0},"zyiwsRFmMxiMPUSRZtlSig":{"text":"If it were possible to give zero stars, I would.  The ambiance was great and performers we","useful":0,"cool":0},"nIBxSLPkPC-wt8WE5d8oVw":{"text":"Probably should give it 5 but I'm being cautious as I've only been there once.  But wow, w","useful":2,"cool":2},"ybXMYQUudLL1VUTj2t1Rgg":{"text":"I really wanted to like this place after going once two years ago. However the very loud a","useful":1,"cool":0},"Zb36so3G8Y_2uHw402-cdQ":{"text":"Excellent small plate dishes. For veggie friends get the falafel sliders! The Bellini w/bl","useful":1,"cool":1},"zcm1FJdnlEkg7Vd6oHMFSw":{"text":"AMAZING MUSIC. Incredible food. Small local joit, hard to get in to but soooooo worth it. ","useful":0,"cool":0},"Hx1WzvjWADZZ1kNdMUHfhA":{"text":"Amazing food! Live jazz band! What more can one ask for? While the food is good, the selec","useful":0,"cool":0},"8HPQbO4s0MnIxN5iWn8GGA":{"text":"When looking for a fun place to get dinner and listen to real New Orleans music, venture d","useful":1,"cool":0},"4hiNQo4-CzL64V5xZlm-HQ":{"text":"Nothing special. The mac & cheese, and the crawfish pasta were Merely average.  However, t","useful":0,"cool":0},"vTfDkDV3invTwtpUaX8a2Q":{"text":"My daughters and I enjoyed a wonderful meal and some great music at 3 Muses.  The staff wa","useful":0,"cool":0},"_JIgFToCuOsWa8afak6s0g":{"text":"Came for food and they were closing an hour before time on website. So they rushed us and ","useful":2,"cool":2},"qhfBHA6e4CUwRfKo6XAS0A":{"text":"Great place for dinner and music if you want to avoid the common folk at Bourbon Street. W","useful":0,"cool":0},"hYxknC6XKSTIwKr8MO0IiQ":{"text":"Amazing food, amazing vibe, amazing music with Dr. Sick. Frenchman Street is Little Bohemi","useful":0,"cool":0},"VKAVenraFOIc_a45q-NOXA":{"text":"In a series of incredibly fortunate events, we stumbled upon the Yelp listing for Three Mu","useful":1,"cool":0},"qUZXCuwVGd4Uohyjmsm-6Q":{"text":"I loved loved loved Three Muses! The decor is super cute, the food is great, the bourbon i","useful":4,"cool":2},"3qjC97e8tH2pUmylr9EYrg":{"text":"A must when visiting Nola! Off of the beaten path (aka bourbon street). The perfect mix of","useful":1,"cool":0},"75_bY5n4yOkup9R9yXzmFA":{"text":"The food - outstanding! It gets packed, so check in early. The reservation I had when I vo","useful":0,"cool":0},"kXJ2KBJCtQw-TW1Qt6-POg":{"text":"Ate here for dinner.  Staff was me great and got us a table without a reservation. I would","useful":0,"cool":0},"rPgbs-AJMEc-Gq09y7bmmQ":{"text":"A quality spot for dinner with jazz. The hostess is just downright charming, and has the f","useful":0,"cool":0},"xSCWMt__TLr9Rhq7fYeuYg":{"text":"Great food. Try the crawfish tamales!  Great music. Great bevs. Great staff.  Make a reser","useful":0,"cool":0},"h9lOv9cmGT9GvJwZJTiElw":{"text":"Had the best time at Three Muse. Live musoc was great. Love Jayna Morgan. Beef Bulgogi was","useful":0,"cool":0},"1I9b8BzL9_6VAA0JXMRoTQ":{"text":"Fantastic food and live music. We had the ricotta gnocchi special of the day, the special ","useful":0,"cool":0},"WFgN8UmYsqfapouhAwKH0A":{"text":"Ugh, New Orleans is already such a sultry siren, how am I meant to resist her advances whe","useful":2,"cool":2},"8eRNifovkJCmXJOuPOXeIA":{"text":"Love the music, love the food and the service. My friend and I went to the Three Muses on ","useful":0,"cool":0},"KerzBoJNlFVbijVOOd-N-A":{"text":"Great place for a drink, delicious finger food and local jazz.  My husband and I like to c","useful":0,"cool":0},"9J2fOHVrP87a9wFQJ_mCqA":{"text":"This place is extremely popular... so eating here right when it opens at 5 is your best be","useful":0,"cool":0},"rPbeJUOoe8yx-n1N6lqkug":{"text":"Tip 1: Get a reservation! Thankfully I did so, and when I walked in at 6pm on Saturday nig","useful":3,"cool":4},"Q_qT5-b7Bg9TNciOV8Km5g":{"text":"Came here on our vacation. This was. A great pace to dine and enjoy some music.  Especiall","useful":2,"cool":0},"qiha4T1tiggu3KnZtE0-Ew":{"text":"OMB!  Oh my Buddha, for those of you who are not in the know.\n\nThis place is amaze balls!!","useful":1,"cool":0},"DIRiVUz4eCkbuwf2Pb9Swg":{"text":"So, i spent a long time thinking about my favorite meal on my most recent NOLA trip. Three","useful":0,"cool":0},"hkm8wQpS-cxRQJW0alXBsQ":{"text":"Our waiter was awesome the food was delicious but the entire experience was overshadowed b","useful":0,"cool":0},"RO-IVKdjFzCdVFmGsvDycA":{"text":"What an amazing place!  Enjoyed drinks and live music from the bar while we waited for our","useful":0,"cool":0},"uQqKOLKXu08uDb9DfL-gTg":{"text":"Great food. Love the tapas menu. Disappointed in the Mac and cheese. Great atmosphere. Mus","useful":0,"cool":0},"IOju-W7YL4MGYyjwbrV-Kw":{"text":"We need to clarify the rating the food was 5 star but the service was 2. There is no wait ","useful":0,"cool":0},"lrRGTeUbIJz2U9mtu8ThWw":{"text":"made it on a friday to see glen david andrews. i'd say he is a must see. got there at 730,","useful":2,"cool":2},"faZbu1QNogiIiFHgJeiBLQ":{"text":"Last night was my first experience at 3 Muses and it was PHENOMENAL. Our server went above","useful":1,"cool":0},"IMByi5RXhOtl61wqlrZxhg":{"text":"Definitely coming back next time I'm in town. They have this amazing mac n cheese dish tha","useful":0,"cool":0},"f_D0U2ivrQ_TWoWNrlvsUg":{"text":"Great fun, good food, strong drinks, hip crowd, fair prices, and good, loud live music.\n\nT","useful":3,"cool":1},"vrKb3UGOm7Wp03MV48zyug":{"text":"Still talking about the lamb sliders! We were lucky enough to snag a reservation due to so","useful":0,"cool":0},"z2Zq6IDrkTYotXaBgvWjrA":{"text":"I really wanted to love this but unfortunately the food took a really long time. I'm not s","useful":1,"cool":0},"QWrcyse4rBnoatSavhcV2w":{"text":"No reservations...booked solid!  At the suggestion of the lovely, patient hostess we tried","useful":0,"cool":0},"nDSjcYZKgEXtDThsgamCWQ":{"text":"Three Muses is the best thing to happen to Frenchmen Street since Cafe Brasil opened way b","useful":2,"cool":1},"v6IoQaRHc67Ag7KKE3oxMg":{"text":"We had a great time here, the food was delicious and the music was spot on. We tried the s","useful":1,"cool":0},"udQ--7_Xnqv5kpOVIBkm4Q":{"text":"Service was EXCELLENT.  Music delightful & more than enjoyable! Food was delicious!!! Only","useful":0,"cool":0},"6HbW-S7UKmxELjhZobuKww":{"text":"We really enjoyed St. Louis Slim.  Dude is good!!  \n\nIt was well packed by 830pm and getti","useful":0,"cool":0},"Yo5cjkSMcekKxnVFcjitIQ":{"text":"Let's make this short and sweet. You want good love music, you'll find it here. You want d","useful":2,"cool":1},"CQuYk6WwkBB5D8uMh-2CXQ":{"text":"Don't miss the feta fries, you'll be sorry if you do!  Great cocktail selection, fabulous ","useful":0,"cool":0},"-m-hgHN2XJpdUhISROLY1w":{"text":"The draw was the entertainment (Linnzi Zaorski!!!) but the food was really good. We ordere","useful":0,"cool":0},"0_oy85KwMCbrYROeleaOEA":{"text":"Hmmm hard but great atmosphere and fabulous music. Food was good but warm not hot. The sca","useful":0,"cool":0},"etIkF6Cwk3J_Cp7ZzP5HCQ":{"text":"Sold 3.5 stars but since I can't do half stars decided to round up. \n\nThis place had so mu","useful":2,"cool":3},"25WsY_tzdx8p_llrCXJt3Q":{"text":"Great music and fantastic food! Perfect date place.","useful":1,"cool":0},"VHH4hMnrBhtlQ2Cd966oRA":{"text":"I can't say enough great things about Three Muses. We went there three time while in New O","useful":0,"cool":0},"nLxl2-NxuKySXZaoqM5q2w":{"text":"Decent bar food, but very confusing as how to get it. A 30 minute wait to get in, then ano","useful":0,"cool":0},"kU2Rpza6EP6YYYCmuZZRZg":{"text":"Food 4stars \nLive band 5stars \nBut prices for the portion sizes is 2stars at best \n\nThree ","useful":1,"cool":0},"jn-aSgaF6Pti3kRmowdc4Q":{"text":"Wonderful venue in what is a tourist filled street searching for real local music and Thre","useful":1,"cool":2},"tcyeh2zVR-FY_klJArfE2w":{"text":"We took a culinary bike tour, and our tour guide recommended this restaurant on Frenchmen ","useful":0,"cool":0},"FZ9NR9QNERuhgwY29nG7Fw":{"text":"Sure, head on down Bourbon Street to experience Nawlins in ways that cannot be experienced","useful":0,"cool":0},"p3GefNBoAmvZVbeMVRzujQ":{"text":"The fish tacos, steak and crab cakes, and feta fries were very tasty! We were also enterta","useful":0,"cool":0},"A02ZMoq3SxCdX8cNQp-0Hg":{"text":"Three Muses on Frenchmen never fails...always expert cocktails, stellar wine list, and foo","useful":1,"cool":0},"DkjYnSuM-Qb8EfzL1W0V9A":{"text":"Love it. Come here every time, wait as long as you must. Buy the cd, drink in the vibe, sm","useful":0,"cool":0},"S676lmGvnC3gk6r8NvQO3g":{"text":"Great service,  beautiful vibe with the live band and spot on idea of having the two sizes","useful":0,"cool":0},"UFD9N9i2Dn2OfYtHHsa9-g":{"text":"I knew I had found something amazing when I saw the cocktail list.  Their  Lavender Lace i","useful":5,"cool":1},"L66QQ9F2hxaCnSf7pxOTPw":{"text":"Very sad evening at Three Muses, after years of coming here and loving it.  The food was s","useful":1,"cool":0},"EKhmpp6cxYBjIqpX0fVAlA":{"text":"Great music, amazing food, awesome cocktails. Nothing negative to say. My wife cried becau","useful":0,"cool":0},"AJ1NoYFe1RtzBcarT2D8sQ":{"text":"The 1 star is for the poor service. I was told by the waiter that he was really busy. Was ","useful":0,"cool":0},"TCuyU-YqQXckCNv0u63N3A":{"text":"Ate here last night.... Food was beyond amazing! We all had the steak and crab cakes, shar","useful":0,"cool":0},"8RVcHLvLyrIYsCHiSswqmw":{"text":"This place is a can't miss if you are in New Orleans! It is in a prime location right in t","useful":1,"cool":0},"GszlinkFLA8qgnIaPjfpCg":{"text":"Soooo delicious! Would come back to New Orleans just for this place. The pork belly was my","useful":0,"cool":0},"FmybNQ-IlWbWwji2kYbpOA":{"text":"A huge disappointment. I was thrilled to find a place with good reviews in Frenchman stree","useful":0,"cool":0},"9xMG-w-618nMxo1tUto3KA":{"text":"The best fish tacos I've ever had, great music... cool\nVibe!  Don't miss this spot when in","useful":0,"cool":0},"WR0unczIWRyY3fvV5FC0kA":{"text":"We ate at Three Muses our last night in NOLA, and it was simply awesome! The food is only ","useful":0,"cool":0},"-nsFeKSTQaGOJt3d2ux-cw":{"text":"There is something about this place that is impossible not to like: cozy, great music, fun","useful":0,"cool":0},"JnfYmHHFchZTFjL9RiIRiQ":{"text":"Lively place with subtle lighting but not too dark. They have great music, constantly. And","useful":0,"cool":0},"8FQfkZb3YPcFxuLbKBH0Yg":{"text":"Easily the most disappointing dining experience during my time in N.O. LA. \n\nDon't get me ","useful":4,"cool":0},"oGJwmuVC6RWlpTAFnEaqBQ":{"text":"Absolutely delicious food, tasty cocktails, great music, great atmosphere, friendly servic","useful":3,"cool":1},"7ZNcx5gX1vf3LS1JnwAGQA":{"text":"Great place for eating a light meal (small plates) and listening to music. My husband enjo","useful":0,"cool":0},"RDBWs_tUJNQSSzIDHSJFwg":{"text":"I found this place on Yelp. I was looking for good food, nice atmosphere and good live mus","useful":0,"cool":0},"34u42hgtXDjQDQOVOALUeQ":{"text":"This place is simply marvelous. I think the food has gotten better. Everyone I recommend t","useful":0,"cool":1},"v5c9lZtZq5JLg9y7yfoKmQ":{"text":"If you are put off by the predictability and exuberant prices of the touristy spots around","useful":0,"cool":0},"rdJ64n0n_SmBQYSdjfg29g":{"text":"Had a good time here trying food and listening to music.  Limited menu but great drinks an","useful":1,"cool":0},"Jm3k-qrrz89LETntX5qMQQ":{"text":"Everything was delicious!!!! We ordered salmon spring rolls which were very good, refreshi","useful":1,"cool":0},"c053oVL4gU0YfwkTiqPbsg":{"text":"Great music and food. We were at NOLA for conference and Friday night was our only chance ","useful":0,"cool":0},"HXL2PdK20ZFqo2A13L2uLg":{"text":"I was in New Orleans for work for about two weeks. My co-worker friend and I made a list o","useful":0,"cool":0},"9joBZUEcHpN5fSKdAYFgMQ":{"text":"My girlfriend, her brother and I were headed to a John Bouteé show at D.B.A. and randomly ","useful":0,"cool":1},"cSdm2qj-dld7XQiBrYcJOw":{"text":"Best meal I had in NOLA. We sat really close to the live brass band who were also amazing.","useful":0,"cool":0},"5SudH4fOWMXlD7c7zvaRAw":{"text":"::Review disclaimer:: I'm writing this based on picking up a to-go dessert. \n\nI live acros","useful":0,"cool":0},"9jNLTY_-bKb5Ao64gTHTKQ":{"text":"We loved Three Muses so much that we returned twice in three days! The restaurant/bar mana","useful":1,"cool":0},"5blVcHzLgz5XDkVFb0yBIg":{"text":"great place for live music and they serve food~\nportions are on the small side but that do","useful":0,"cool":0},"97b9eZ6CYQiiO9ckp_jjZg":{"text":"Great food, great bar, slow service. Wonderful music. We loved our experience but we were ","useful":0,"cool":0},"N0iiaeUSZ6qtXO3T07fTHg":{"text":"Great tapas on the outskirts of the French Quarter. I recommend getting here early and enj","useful":1,"cool":0},"4zsOEtk08GZcTYiDSeNyMA":{"text":"Great music and small venue and it works well because the staff manages the flow into the ","useful":0,"cool":0},"NlTB-NyuuxKRH_dYSP1H5Q":{"text":"Warm and friendly staff! Excellent whiskey and Mac and Cheese! Music is just oh so so love","useful":0,"cool":0},"CflK-6HmaJFWUbXuVDlTjA":{"text":"Let me start by saying i did not have an overall bad experience. The food was good, music ","useful":0,"cool":0},"eVhw9U6K2DjhZ-PTVM4XAA":{"text":"Great ambience. Good music. Great staff. Good food. Highly recommend the Fried green tomat","useful":1,"cool":1},"CF9UIokg2m37MrvkOKjI3g":{"text":"Nice little place. They had music goin and tapas style plates. The waitress suggested we o","useful":0,"cool":0},"OhhKo14cRkKq7fYjldty-A":{"text":"The food here was delicious. We had the fish tacos, Mac and cheese, and steak and crab cak","useful":0,"cool":0},"nO9n8WIxrW2RWI6UbGX-FQ":{"text":"The food is well prepared and tasty. Drink selection very good as well as the music.\nOn th","useful":1,"cool":0},"xtCubvjWiBEC1A4LlIuw2Q":{"text":"Great vibe. Small place. 90 minutes to stay. Food is okay,small portions. They have vegeta","useful":0,"cool":0},"D8OEwN3lM21EbJ6Iu-sGiw":{"text":"Amazing music!!! So much personality to Glenn David Andrews band! Very very fun. And the l","useful":0,"cool":0},"2MXjHGiHpKjRIV0HFN99Sg":{"text":"As a local I typically stay away from areas like Frenchman and Bourbon street, but from ti","useful":0,"cool":0},"0ThhKwGdIulzLdbXjsNzrQ":{"text":"Very disappointed visit here! Reviews were stellar and food/drink was sub par. Drinks were","useful":1,"cool":0},"rZvqfCv4rvLkoUCXHKNWxQ":{"text":"Good food, drinks and music... unfortunate service. We had to wait two hours to get in and","useful":1,"cool":0},"MIVwRtbFBvG2nvtvUdtq3w":{"text":"Came here without a reservation on a crowded Friday night. We got a spot at the bar and ha","useful":1,"cool":0},"urheYyGf6xH3lcgSDwOYug":{"text":"I absolutely loved this place, everything from the people to the food, to the music, to th","useful":1,"cool":0},"PgT0unAukZ2htMFd-pO-xQ":{"text":"This is a NOLA treasure! Amazingly delicious, imaginative, simply elegant & down-to-earth ","useful":0,"cool":0},"UFkXluIN8vp_SPK9Is9YsQ":{"text":"If you could bottle and sell \"cool vibe\" this place would have more cash then Apple.  The ","useful":0,"cool":0},"tILLOG1ZTwaFX7pTqW9psQ":{"text":"I made a reservation on open table a month in advance for 6 people for a nice bachelorette","useful":6,"cool":0},"EgVk9TR15Tu8puejsBCDGA":{"text":"Best meal of our trip! Loved the pork belly sliders and kale bruschetta. Server was warm a","useful":0,"cool":0},"Y5EdA7WzyuRoTFJNCCLlrQ":{"text":"Came here on a recommendation.  The music was fantastic, the food delicious, Cocktail uniq","useful":1,"cool":0},"8q5J1tJPIGyo5sPmnr1b7A":{"text":"Good food, good atmosphere, good music. Tapas though so hard to get full (american full th","useful":0,"cool":0},"MGrKEUg6x4_76cAu6sTa8w":{"text":"Best dessert of my entire year was found at Three Muses: Banana Macarpone Strudel w/ Rum B","useful":2,"cool":0},"8dgAtrNwrbGToMWcItpaOQ":{"text":"best meal I ever had. appetizer sized portions. I would recommend dessert even if you're t","useful":0,"cool":0},"bSX-lVCaL_yuee_fpspo0w":{"text":"We really enjoyed this place, food is delicious and great atmosphere, but don't expect to ","useful":0,"cool":0},"WJJVB_gGJQglhVX7gVaUSQ":{"text":"They only place we found that had jazz and such a nice singer. Was a little annoyed we cou","useful":0,"cool":0},"6tGFEKFnHWh1YkM7e43dsw":{"text":"Delicious Tapas. Delicious Drinks! Great Atmosphere.  Get here early . Order at the Bar.","useful":0,"cool":0},"_JgPsbxatxyC3olWjpVDUg":{"text":"We were looking for a place with good food and good music and we found them at Three Muses","useful":0,"cool":0},"e-l-enquCNqb17EvhiSTaw":{"text":"The food is wonderful but the waitress failed to tell us how small the portions are. $10 f","useful":0,"cool":0},"2Oh9em8nsvlHCCrB3xSseA":{"text":"I have been dying to try 3 Muses for the past year. I went in with a tourist friend of min","useful":1,"cool":0},"-gnsjF0wa-1QZ-A12vuGsQ":{"text":"So far an hour on the wait list. Not a problem.  But then....another 45 minutes to order. ","useful":0,"cool":0},"UW4U42J1MBPJpFqZd45Ung":{"text":"The wonderfully friendly hostess was able to get us in from the wait list when another par","useful":0,"cool":0},"sM7LpyycChT1eJAgCfVZ4w":{"text":"Great atmosphere and live music but the drinks were lacking. The Wildflower tasted like a ","useful":0,"cool":0},"z29Eet7CHwIMvtJj9GeJyA":{"text":"This review is for drinks only. \n\nWhile walking through the Marigny, I heard some sweet so","useful":2,"cool":1},"XJsnKCRUoDRbvFHmMtRBpg":{"text":"Wirklich authentische Jazz-Kneipe mit guter Musik und sehr gutem Essen.\nMeist brechend vol","useful":0,"cool":0},"VFXZZdjt-Zzp3vVN1nQoBA":{"text":"Like this place needs another 5 star review.  Waited alone for about hour and half just to","useful":0,"cool":0},"GhslnJJ6kFI1_Y4XrjG_Tg":{"text":"Their food is really good!  I've had their cheese plate and Korean selections. It's small ","useful":0,"cool":1},"nWpIXaVS8VuAsHZYID4Lww":{"text":"Foodgasm in my mouth!\n\nMy hubby and I were looking for a quick bite and holy, the steak an","useful":0,"cool":0},"vGiZnH6cT1Qg7hMex7ZIKQ":{"text":"I was hesitant coming here but my husband and I gave it a try. The tapas were very good. W","useful":0,"cool":0},"a6cQwFZXL5r9Ldv4zM_FAg":{"text":"Our favorite restaurant in NOLA. Amazing service, food, drinks and music. Chris, working b","useful":0,"cool":0},"vwHS9MgVJb8AxqJ7pe35ww":{"text":"The menu and the food was a 10+!  Had the lamb sliders..awsome. The butternut sqash rav's ","useful":0,"cool":0},"p_T4AzylyuSMgY-GgF-c2Q":{"text":"Definitely a place to go if your into great music, interesting drinks and small plates.  T","useful":0,"cool":0},"oIvKE3THeOffHAEFIkn8pw":{"text":"Oh my, this was a great find. The food is great and the mixologists talented. What more ca","useful":2,"cool":0},"O5Qp_O40wgbAmynIHQ6_IA":{"text":"Great place Jeremy is a great bartender the food there is awesome a must have the lamb sli","useful":0,"cool":0},"ByuWvgqLPbSoYgTTpACBeg":{"text":"Horrible place! Really bad organized, I was waiting for ever. The food is bad, the service","useful":0,"cool":0},"qwEvUC6t7WtLbLV3lJFJIw":{"text":"We ate here our last night in New Orleans and HOLY CRAP... such a good choice (thanks to a","useful":2,"cool":1},"aunHmLrDlZv2b1zBxnyKdQ":{"text":"Such a great experience! We had a larger table (6 of us) and let the waiter choose our dis","useful":0,"cool":0},"VsLBIA-cW-uA_PiPfgX0hg":{"text":"Came here to eat on a Monday night before heading over to see Glen David Andrews at dba. H","useful":4,"cool":2},"NncTJjzXc97MZQhCbDvwTw":{"text":"My wife and I ended up at Three Muses because the original bar/grill we had stopped at was","useful":0,"cool":0},"crp3Pt4pM1WnuS0xOmLsHg":{"text":"This restaurant was recommended by a friend.  We made reservations and were able to get ou","useful":0,"cool":0},"wLqn7MaKPb0wTLCUdCaUug":{"text":"Great Location, but a bit on the grungy side.  Don't bother dressing up.\n\nKind of crowded ","useful":1,"cool":0},"H9A-IttKvNPqVmKFX_-xWA":{"text":"Very strange expirence this last weekend. Our group was told that we could not go in, then","useful":0,"cool":1},"Y3t_YbDGsm1Q6jlo0v8pgA":{"text":"It is simply the BEST food we have had, the music is great - love the waiters too!\nLoves t","useful":0,"cool":0},"l8oymfYYS0wzr463sN_2gw":{"text":"TIPS: \n- either make a reservation or get there right at 5 pm. It fills up fast. \n- you ha","useful":2,"cool":0},"GM-rM6ayKCIawGv_Q3Zv0w":{"text":"Stopped here for dinner on a Friday night. It was crowded and we waited 30 minutes for a t","useful":0,"cool":0},"Tmr2oMIzAJvYVAsBMMlXEw":{"text":"My husband I live in the Marigny and have been trying to get to Three Muses for a bit.  Ye","useful":4,"cool":2},"-EYiJvbqyLiI-Nb0mOTG2A":{"text":"Loved it. Food was outstanding and jazz was terrific. Service was wonderful too. My mother","useful":0,"cool":0},"5oPZMsEuqOXYUnumwV_e-Q":{"text":"Where to start.  If you are not into what Bourbon street has to offer than Frenchmen stree","useful":1,"cool":0},"nnyhFXNselkEtSArYK0MqA":{"text":"I don't know what I can add to the 151 (and counting) previous reviews, but there is no ha","useful":3,"cool":1},"OTNPa4CIpH9vVvs17wOHuA":{"text":"Fui con unos amigos a este lugar súper recomendado y nuestra experiencia fue pésima. Lo qu","useful":0,"cool":0},"C1h0R0mliWR5Y9gGiR8cAg":{"text":"Tapas and great music. A somewhat out of the way New Orleans restaurant, not quite as over","useful":0,"cool":0},"KT1tq8wKw0q8kkI_f2J8Ow":{"text":"Can't say enough good things about our dinner at Three Muses. \n\nThe place is cozy and they","useful":0,"cool":0},"RgWUpPyUoNbSzEZe35PiBA":{"text":"Three Muses: go for a beer and the music, skip the food.  Out of the four small plates we ","useful":0,"cool":0},"EM127VUbKPdAiAN7IX2Ekw":{"text":"Good food, wonderful hostess and GORGEOUS music. The ambiance of the restaurant was perfec","useful":3,"cool":0},"6_C-Xxo_OI23Q2AisFpAHA":{"text":"Awesome New Orleans jazz and some of the best food we had in the city. It gets very busy o","useful":0,"cool":0},"zEU1D1_q5NR8NUENmDBNog":{"text":"Another Yelp-Win for the books.\n\nThis place was awesome.  We wandered down Frenchmen Stree","useful":5,"cool":4},"eVc42hnLGKIk8NCLp0k5ig":{"text":"This place is great, if you're not a vegetarian. All of the vegetarian \"entrees\" are basic","useful":0,"cool":0},"mk4i_6AtzctBsy6uSjh4Pw":{"text":"Fantastic place to see live music and interesting food. We had a great time and I would go","useful":0,"cool":0},"0pEA7VvdHBYIKB2_mf3zHQ":{"text":"We found this place (thanks to Yelp) on our first night in NOLA and were blown away.  The ","useful":0,"cool":0},"_hVq4KuSNdcM-kwsJ1PkyQ":{"text":"What an surprise find, and I used local yelpers to help me find and make the proper reserv","useful":2,"cool":3},"_jVcL8EuGXe2WcEUrFeSeA":{"text":"My favorite cajun spot in town. Great food, cocktails, and live music. And cheap too!\n\nFor","useful":0,"cool":1},"K8jxwX2nxPC5Smq6A0MFnw":{"text":"We stopped in for a drink at the bar. The band and singers were good. It's definitely a pl","useful":0,"cool":0},"XcjeEaDwOrGlP3FaqOIMYw":{"text":"Three muses is an earthy, homey concoction of a Jazzy New Orleans Frenchmen Street Eatery.","useful":0,"cool":0},"bVyIDseW3xcHPlOvuJAoKw":{"text":"Just what we wanted on Frenchmen Street: live music, cool atmosphere, and great eats!\n\nSma","useful":0,"cool":0},"Cbdad-Jcp-VVqNJ1Tp7BrA":{"text":"We waited 1:45 minute for a table so be sure to make reservations! After that wait we got ","useful":0,"cool":0},"6_bJ1Ys9fMBbGu5ZQhsvyg":{"text":"Located in Frenchmen Street....this small live band gastropub is delightful!!  I made rese","useful":1,"cool":0},"xiaLNYkyTV6vU3in6wVvDw":{"text":"A lot of fun. Great ambiance and drinks. We came on a Friday night and it took about an ho","useful":0,"cool":0},"K2NbhgfvjbWRvvfpfAqWKw":{"text":"I read about this restaurant with its live music and great food and was so excited to go t","useful":0,"cool":0},"2JEvJQLRxQfMYt7eliyDzw":{"text":"In keeping with tradition, let me start with the all-important ladies' room.  Wow.  This p","useful":5,"cool":1},"CVmBJPZpviycNr0FjZIQ-Q":{"text":"Während meiner 5 Tage in New Orleans bin ich 3 mal bei den three Muses gewesen. Die French","useful":0,"cool":0},"klCT2QySuXMn-lLh599jMA":{"text":"Took our daughter here for her 16th birthday. We loved the food, the small plates were gre","useful":0,"cool":0},"5OW2-0122D6Et-mvNBBncA":{"text":"The food is as good as the cocktails which are as good as the music.  And it's non-smoking","useful":0,"cool":0},"7zQnULJKU8SWVfnu4F9uiw":{"text":"First rude person on my entire trip to NOLA - the hostess at Three Muses working on Sunday","useful":0,"cool":0},"kpVL9O55Ed5dlRVirPOgdQ":{"text":"Decor - Delightful\nMusic - Splendid\nFood - Phenomenal\nStaff - Amazing\n\nI absolutely enjoye","useful":0,"cool":0},"Xrys101QhOnzV9tS2aD5rg":{"text":"The drinks are creative and the band saved it BUT the food consists of mediocre, overprice","useful":0,"cool":0},"NSSlCjnLL4WdqXPA6yvtgQ":{"text":"Okay, one star, two reasons.\n1. Rudest. bartender. ever. What a shame that I have to give ","useful":1,"cool":0},"fyoRDWw35yTJSjAX7Tl0bg":{"text":"As someone who has been spoiled by the great nightlife in New Orleans for 4 years, I am al","useful":0,"cool":0},"NVFMkCjYE4MPQxh6DzwfUw":{"text":"This was a great time. It is not your run of the mill kind of place. \n\nFirst off, the musi","useful":0,"cool":0},"eneYzLcNAelcA2ManMUlmw":{"text":"Loved every morsel served at Three Muses. I wanted to try something other than shrimp and ","useful":0,"cool":0},"1McEEe8PadmOA6vlyYI6rQ":{"text":"Come for the Conjugal Visit stay for the Three Muses Fries and everything else on the menu","useful":0,"cool":0},"iH0R3MM-fwT2m3FBtALxVg":{"text":"This is a nice place to go for food and jazz. We were there this evening. Upon sitting dow","useful":0,"cool":0},"SfopcuIIfKZK1Ag5yM-PXg":{"text":"Everything was excellent, except for the Bi Bim Bap (but I didn't expect it to be good), s","useful":0,"cool":0},"PeveyrmTDfqFmGjy2yE4gw":{"text":"Great service at the best family restaurant in town, I love that you can still smoke in th","useful":0,"cool":0},"XIPYEIPXffVI_-kEIm4Igg":{"text":"Avoid at all costs!!! The service here is insanely bad and management does nothing to help","useful":0,"cool":0},"S6wa962k4md1Tjj_aS_ZUQ":{"text":"Amazing music, great small plate selection! And good cocktails with knowledgeable bartende","useful":0,"cool":0},"SKX_88X4IiMTo5AVK0v-aw":{"text":"Last night we went for dinner at Three Muses, we were seated by Emma and Benjamin our wait","useful":0,"cool":0},"RTB7asA3yWvG7kh-Pq7qWg":{"text":"The best of New Orleans all in one spot: funky, fun atmosphere, great local music and fant","useful":1,"cool":0},"uoGvrg3LDn95Gy70CfLwUA":{"text":"I can't believe my experience was so not great compared to the other yelper's. This usuall","useful":2,"cool":0},"yqzES-jOAgEEhyg2HYWxpw":{"text":"wonderful atmosphere, great music & fantastic food. definitely a fan of this place.  altho","useful":0,"cool":0},"Sb6l6GvjlV-klolpl-KeoQ":{"text":"This is a wonderful, happening bar/tapas place  perfect for a light meal and to hear some ","useful":1,"cool":2},"ZA4foKc0VCrqjdBhpEx_vQ":{"text":"Absolutely fantastic. The music, the food, the people -- all 5 stars. We arrived here pret","useful":1,"cool":1},"THB9GTfAfSu1yWnud2bTtA":{"text":"Had a Lovely experience here. I enjoyed almost everything that was served here. When we we","useful":0,"cool":0},"6hxe6uy4jvTuwqYuI-B-1A":{"text":"I actually want to give three-and-a-half stars ONLY because I think the prices are a littl","useful":1,"cool":0},"k2JQteiMl95mR9Z2iWFqNQ":{"text":"Solid tapas spot on Frenchmen street. Good music, great food and all round amazing ambienc","useful":0,"cool":1},"aZRnx0Lnux-MyQ7ppvzBvA":{"text":"Amazing !! Unforgettable!!\nBest food & cocktails in New Orleans with amazing jazz music as","useful":0,"cool":0},"RsWbZVkgaeqAIvD6sLjAsg":{"text":"Ordered the sublime Lamb Sliders, seasoned perfectly! The Pork Belly was great and well ba","useful":0,"cool":0},"3uWrturul511JYYSo7j0iA":{"text":"Awesome music and food ! Lamb sliders were just really good! Must try place for food and m","useful":0,"cool":0},"MDY3j2gD1Sp_XZY1HUSnEg":{"text":"Vert good music and dinner as well. Just a regret the waitress why os she pushing at the b","useful":0,"cool":0},"H1Vr1G_ZpeVUXiH2NbI-Kg":{"text":"My friend had recommended this restaurant+jazz bar, so I already had great expectations fo","useful":0,"cool":0},"v1JpOF0Lw0jsCQWqv9aj4A":{"text":"Live music is definitely top notch.. I tried Lamb Sliders and it was definitely 10 out of ","useful":0,"cool":0},"A_uDo9FRKwKRyxYemZAGGQ":{"text":"Heard some great jazz at Three Muses.  It was very crowded, but we managed to snatch up a ","useful":0,"cool":0},"9v-ZMiX7Kao8bcWCROB_xg":{"text":"A good long walk from the madness of Bourbon arrives you at Frenchman Street. This area of","useful":2,"cool":0},"l0CTDlcG9sEC-V6kdU4CEA":{"text":"The drinks here were great and the live music was really good! I got the daily riff which ","useful":0,"cool":0},"pTBTksmz-E_wPR3xVdqFFw":{"text":"We shared the bacon wrapped dates, bulgogi bowl and mac and cheese. It was all outstanding","useful":0,"cool":0},"81_aV1OM2Hy7tEpYyUwfIg":{"text":"Perfection.  Eggplant bruschetta was the hit of the night.  The goat cheese gratin (not re","useful":1,"cool":1},"-F_AZpgVrs4rnznSiPPxSQ":{"text":"Been in Nola a week now and was really looking forward to this place.  Huge disappointment","useful":2,"cool":0},"jbUUTRkhRbS-aK2rVyFzdw":{"text":"I would definitely recommend this little restaurant if you're looking for music and tapas.","useful":0,"cool":0},"Eq6MfX2NaCV0hD0B9cdmgw":{"text":"This restaurant was amazing! Great live music, attentive servers, and fantastic food. We h","useful":0,"cool":0},"axWjcIEOKq1q-nkFdEhllQ":{"text":"It may have just been the time we were there, but it was more of a dinner club. They were ","useful":0,"cool":0},"J7mYdj5rrFx_5IW4S3n9TQ":{"text":"Went to see Luke Winslow King perform--cool vibe, eclectic decor, great sound!  Definitely","useful":0,"cool":0},"HHeZZGFNu5P2G4VZZnXJyw":{"text":"This place is great. Went here during Jazzfest and got reservations luckily on Sunday(call","useful":0,"cool":0},"OY7lhEcwwKg5UXu7O81V2w":{"text":"I like Three Muses and would recommend that others try it. I took my family last night and","useful":0,"cool":0},"qG_EFkIcX5C6KboBXMBumg":{"text":"Can I give three muses 6stars?\nI LOVE this restaurant. I mean, how can I not fall in love ","useful":0,"cool":2},"ZvCdGmBJypkPS5nUfUUEoA":{"text":"I have to stop here every time I go to NOLA. I'm obsessed with those feta fries! I love th","useful":0,"cool":0},"ho_friMxZdaDkCbAC3p4hA":{"text":"Getting a table here wasn't easy.  The place is somewhat small and busy.  We had to wait a","useful":2,"cool":0},"WcloVc3Ecaih1IcMj8aIQw":{"text":"On a recent trip to New Orleans my husband and I did some planning and made a reservation ","useful":1,"cool":1},"LaWdI1MBh8xtJwtLrLxVEg":{"text":"I don't have much to say about this place. We stopped here on a party bus one night for dr","useful":0,"cool":0},"4Unu0veZNmn81lxQ0VJMow":{"text":"First i have to say, the live music was GREAT!! The Food was GREAT! But the wait time is o","useful":1,"cool":0},"TMxHtVfCGbWpuDs-FVVJUg":{"text":"My girlfriend and I loved this place. We where referred by a local. If you want to get a t","useful":0,"cool":0},"xeXrTuuKJbyr_PEB_JmsqQ":{"text":"Our favorite place in NOLA!! Lamb sliders were hands down the best, so much flavor. \n\nAlso","useful":1,"cool":0},"zyoKJXYkWZCZEjIw7o2Iqw":{"text":"This place might have good food, but we didn't get the chance to find out. The tiny place ","useful":0,"cool":0},"dyVzEMmEQj8a1wrcUvrDPQ":{"text":"Great music, good service, awesome small plates and drinks. Perfect recipe for good times.","useful":0,"cool":0},"SYyLBosLBpzgLaOXtF5moQ":{"text":"F**king great!! Super food, well made, nicely presented, and great tasting! Ambience fabul","useful":1,"cool":0},"Ne2RaGMfocQlPtbyRe9FbA":{"text":"Overall very nice place to enjoy jazz, good meal and cocktails.  On a Friday evening after","useful":0,"cool":0},"DUliOq5Z6jcWTYtmH75W-g":{"text":"Awesome place.  Small and cozy and terrific food.  Only a few bar seats.  A reservation on","useful":1,"cool":0},"Ne8Cg3jAw0hTw5TB5lIohA":{"text":"Bring a lactaid pill because the Mac n Cheese was good and was our filling plate. \n\nThis i","useful":0,"cool":0},"_UuN8gnxK-vsyd4KWDCj_g":{"text":"My review is for drinks and a jazz set. Three Muses served as the go-to spot on Frenchman ","useful":1,"cool":1},"ZoPgGB87CxI8yO7ipxI0Kw":{"text":"A must go for Frenchman street. Out of all places that has live music, it is the only one ","useful":2,"cool":1},"M0isZ0Hh8FIGpdfKxy_wCw":{"text":"Great restaurant. Music and food was awesome. Highly recommend. This place is on Frenchmen","useful":0,"cool":0},"Uxqyo05bfTPDw6BlvI7Uew":{"text":"I cannot review the food since all I did was drink here, but this was my first bar on Fren","useful":2,"cool":0},"QaePrIIN8-suh9u5xE0eQA":{"text":"The area around Frenchmen St. reminds me a little bit of Little Five Points in Atlanta. Yo","useful":3,"cool":0},"V9gzPe4xqF3FtJjSYDj4qQ":{"text":"Super good experience there. Off the beaten path for sure. Great small plates that come fa","useful":0,"cool":0},"7-l49Vb3j-JET1u251BIBQ":{"text":"One of my favorite places in New Orleans. The atmosphere of Frenchman... the local vibe...","useful":3,"cool":2},"0TciDA7P9M47hiyoq4dwmg":{"text":"Food was great service okay. Deffinently make reservations. The place was packed but we we","useful":0,"cool":0},"gLvJDDiZGgfbP3qpQJxZ4g":{"text":"This is one of my favorite places on frenchman.  The music is just amazing and on top of t","useful":4,"cool":0},"v_mTfOtuiKZs4fm6BoRXpA":{"text":"Absolutely amazing! Some of the best food I have ever eaten. My family and I came here whi","useful":0,"cool":0},"1KDxZ5wXMcBz4O0PE_jl8g":{"text":"I went to Three Muses on two seperate occassions and had extremely different experiences. ","useful":2,"cool":0},"RuW4BJa84QtLpVMsmbTi-w":{"text":"This is my place.  If I lived in NOLA, I would be here all the time.  Great atmosphere - a","useful":4,"cool":2},"2V5Z1ylaq8IbKWpehtEakw":{"text":"Good Music, Good Drinks, and Good Food with Korean glaze.  \n\nThis was a Yelp find, so firs","useful":1,"cool":4},"uffY-d7MrZd20igbNZHvLA":{"text":"First time to New Orleans, first time to Frenchman st. No recommendations and stumbled acr","useful":0,"cool":0},"3PQByT_Kyl_ROjkaAoQ8cQ":{"text":"I had the pleasure of eating here a few weeks ago on my first trip to NOLA. We were a larg","useful":0,"cool":0},"VdDFlUY7TlqI1o8_xjqVUA":{"text":"A cool spot on Frenchmen St, my friend and I were lucky enough to nab a table after a canc","useful":0,"cool":0},"PxVGZmcDefbjspbSdzwWcw":{"text":"The food was good, the ambience was nice with live music, however the service was suuuuupe","useful":0,"cool":0},"Wh3PxSvFSk-YBz10RNPI0Q":{"text":"My friends and I came here as one of the to try places since it had great reviews. We did ","useful":0,"cool":0},"IVrKEwIMICAXOMgSiK1twA":{"text":"Excellant food both veg and non-veg!! Great music and atmosphere. A little touristy at tim","useful":0,"cool":0},"Pjruf-pQSpTbl1ykgnikVQ":{"text":"Despite the small space and not very friendly hostess the food was delicious with many opt","useful":0,"cool":0},"-bbLCxYTWcjBXXLomiWL0Q":{"text":"OMG!  This place is absolutely delish.  Popped in on a Wednesday night, and the place was ","useful":1,"cool":1},"ZDG4tpKPZF_gH5r32EwfDA":{"text":"Conveniently located on Frenchmen, Three Muses never fails to have a unique sound on any g","useful":0,"cool":0},"i7GBsuBwTbcluN9JEhZhHw":{"text":"This is a fantastic little dinner spot. I loved my cocktail (the other redhead) and beers ","useful":1,"cool":1},"iG8bDMAVmlg0nAtCeyhEXA":{"text":"I went to this place last night with 7 friends and we all loved the food. They have a shor","useful":0,"cool":0},"QF3sC3Jl6PnU4rxOUUGCHQ":{"text":"I wanted to try this place out because they play live Jazz. The music was beautiful and th","useful":2,"cool":0},"MN8xJQNt5o4w9oY7fqbn_A":{"text":"Must haves: Mac and cheese, fish tacos, and tomato and ricotta salad!  Fabulous jazz music","useful":0,"cool":0},"q2q1WbwgvLoAwmrZePiKkQ":{"text":"Fantastic food. I give props to the chefs, but honestly terrible service, from the hostess","useful":1,"cool":0},"aQMsVUlXcLR8eXGiAhFH9w":{"text":"Maybe it was an off night? The music was okay, not great. One of us was seated behind a pi","useful":0,"cool":0},"lTJj_6CxpkaXszn0C6EsCg":{"text":"Food is great but most importantly, the music is dynamite. We were here for GDA plus James","useful":2,"cool":1},"QG6zHE19r26Y06t1SbyZKw":{"text":"Food was good but very expensive for what it was... $9 for lobster Rangoon with only 3 pie","useful":0,"cool":0},"gH-8_fOarY1P7CfSGLrxnw":{"text":"Food is acceptable. Best snack definitely the lamb sliders. Music can be pretty good. Good","useful":0,"cool":0},"JUT1N4qkeCDI_qP36z6xng":{"text":"Thanks to everyone's amazing reviews, I chose this place for dinner during my short, first","useful":1,"cool":0},"yaz5XjC7hIV-psWDP_3DnQ":{"text":"Great mixture of small plates! Live Jazz! Shotgun Jazz ban was excellent! I recommend tryi","useful":0,"cool":0},"_NtxHuzL7ciqYxV3ndujAg":{"text":"Craft cocktails made to perfection,  smart and engaging wait staff,  intimate sophisticate","useful":0,"cool":0},"gJCtEAo-8iqp1EgyQ7ZuTA":{"text":"Great place for small plates.  The service is excellent as is the music.  The food is terr","useful":0,"cool":0},"wI8U3OO0PaX9aPenatbe2A":{"text":"The food here may be great, and it may be a cool place to hang out, but they have so many ","useful":3,"cool":1},"gH5iEZrWZyDtG9YAe7fuRw":{"text":"Small plates. Interesting food. The jazz band that particular night we visited was not so ","useful":0,"cool":0},"kEn2HvFPSmQT2qzwSGGHmQ":{"text":"One of my top 3 jazz bars in all of the French Quarter.  I came here for the first time fo","useful":1,"cool":0},"PWJiVG6QUm8P2aLJke1Ndw":{"text":"Pleasant atmosphere, pricey but tasty tapas--first rate crabcake/hanger steak combo  and a","useful":0,"cool":0},"fcKOURwCKZslIzSXlT0Trg":{"text":"Came here a couple Saturday nights ago. Place was really great.\n\nFood was exceptional, rea","useful":0,"cool":0},"ly1afqPKg8L5qFQqLeRFKw":{"text":"We arrived on a Monday night at dinner time without a reservation and the hostess seated u","useful":0,"cool":0},"9G0QyGPUQlCJPJzZOA9fHA":{"text":"The music was excellent, the cocktails delightful, diverse and expertly mixed. The ice cre","useful":1,"cool":0},"7PlSrlEucTPyYKNEZRvyRQ":{"text":"Extremely underwhelming experience. Very overrated for basically mediocre food. \n\nI came h","useful":0,"cool":0},"Lsf4Hwym6ae4VlPVrHgi3g":{"text":"Awesome spot, great music, fantastic food, friendly staff. One of the best spot in new orl","useful":0,"cool":0},"QwsAOtsg4O3lhm9URhUTqA":{"text":"Neat atmosphere but the food isn't good enough to justify cost.  Service was good, they we","useful":2,"cool":1},"VgYh6DeweLsl0XcpZfXBfg":{"text":"Really Great Wine and Music!!!\n\nStopped in here with my wife the other night.  We've been ","useful":1,"cool":0},"fvXTyCdXNo3X_MYim8eQmA":{"text":"In all the hustle and bustle of Frenchmen Street, there is Three Muses. I really liked thi","useful":3,"cool":4},"-27XQSsp4zrQVkIXPPkSLA":{"text":"This place is awesome. We went on a Monday for dinner and it was crowded but we were seate","useful":0,"cool":1},"-kv_X3FpZEnbdzA2DVMvGg":{"text":"Solid vegetarian options at this great music spot featured on a Bourdain Layover ep.","useful":1,"cool":0},"MXzzxfow7gK9nTW_Y2751Q":{"text":"Cool atmosphere for a date on a weeknight.. It gets really crowded on the weekend. The foo","useful":0,"cool":0},"GtvdhH0SZL27B-7h4vh7zQ":{"text":"Great place for great music, creative cocktails, and filling tapas.  Staff was great, and ","useful":0,"cool":0},"rxSLJTXs_dBXgBlpDhXqfg":{"text":"Good Live Music + Good Food = So Much Satisfaction. Are you really looking for more? I jus","useful":2,"cool":1},"-C-XxmRtKSblDRTMMxI_dw":{"text":"I rarely write reviews for food but I had to share about Three Muses.  We were only in NOL","useful":0,"cool":0},"k5K_vhUFMxHawNR_UdW6FA":{"text":"During a recent visit to New Orleans, my boyfriend and I quickly became tired of the cooki","useful":1,"cool":0},"f0p8FOy13nKek-hBJcdORg":{"text":"Let me start by saying this place is as good as it gets. \n\n I stopped in here during my th","useful":3,"cool":0},"EJOLNF7MoWYlcBS0WcwYGA":{"text":"Three Muses is quite the fresh spot on Frenchman. It's a full change from the dingy or dar","useful":1,"cool":1},"fQ0J_pjnW4IrgW_oDimxaQ":{"text":"The food is fair, some dishes even great. However, I was unimpressed with the service and ","useful":0,"cool":0},"8_-MF4KT1BhjYWycaJue7Q":{"text":"Best place to end our New Orleans trip back in July. Frenchman street is the place to go f","useful":0,"cool":0},"pnUBA6NoT3YS4A0dZX6ovg":{"text":"This is one of my main go to and favorite spots in Nawlins. The food and music are always ","useful":0,"cool":0},"AbaeufFN2hFErj8lVmxR4g":{"text":"Had a great meal an time with our party of six.  The tapas style dishes were delicious and","useful":0,"cool":0},"_somkxb0qwJ8L-joJjWFLA":{"text":"I had a terrific evening of delicious food and great music tonight at Three Muses. The Rob","useful":0,"cool":0},"RTWUfM1d0il8DkQKKUIVMA":{"text":"Tapas were flavorful & varied.\n\nService was efficient & fast. Nobody smiled but nobody was","useful":0,"cool":0},"5S3F75eAiSqNeJxNl7PHUg":{"text":"Went specifically to hear Shotgun Jazz band play and was truly impressed by Three Muses. F","useful":0,"cool":0},"ysQutyjVnhlnAW4khSt3Nw":{"text":"This was a great find! So far this is my favorite spot in Nola; Frenchman is definitely mo","useful":0,"cool":0},"kaaU-3Yj_Iyy697iu8T0uw":{"text":"The trick to getting a table besides luck is to come here 10-15 minutes before the live mu","useful":2,"cool":1},"x6l9H-4lmm8vS-O2PUuykg":{"text":"Took an Uber over tonight. Great neighborhood. Probably should notify Yelp that you're NOT","useful":0,"cool":0},"MNXTzEQRfIhcx8mBHAyyEQ":{"text":"We have already been to Three Muses twice and both times have been great.  What a welcome ","useful":2,"cool":1},"68hjCy9LgxYHzDzJ8g78eg":{"text":"SO DELICIOUS. Food was amazing, music was awesome, wine was great. GOOO!","useful":0,"cool":0},"5toLlTx2FdNe18_xvmqSCA":{"text":"Came here for my fiancé's birthday. We're not huge drinkers but wanted to listen to the ba","useful":1,"cool":1},"AJ4rvZqToObHg6rOaIdZzg":{"text":"The best spot on Frenchman Street. Fantastic food, creative cocktails, fun and friendly st","useful":0,"cool":0},"1ZAtIo_LQy-l1skI1amBSQ":{"text":"I would put a 0 start if that was an option.  I went into Three Muses and ordered three dr","useful":0,"cool":0},"Qac12Ob0zZvaCKE_CL0Ybw":{"text":"I love this place. Every time I come here I have a great time. This time I went with lovel","useful":5,"cool":4},"dDnahb55DsnU4H9tgDTn6w":{"text":"The best cocktails, music, and food in N.O. \nIt can be hard to get a table, but always wor","useful":2,"cool":0},"hcML5kJonZb6AoMl2WGFjw":{"text":"It's a beautiful place.. indescribable... there is a live band.. the place is cosy.. ambie","useful":0,"cool":0},"i3eMjK0ZTkWlnwGqUuK-5w":{"text":"Wowza!!!!! The music, the food, the drinks!! Just perfect. The lovely red-headed tattooed ","useful":0,"cool":0},"T6uTXQkVjGZ8wcxTP16a4w":{"text":"Cute pub.  So-so food.   Egg rolls were good but expensive ($9).  Fish tacos were small an","useful":0,"cool":0},"dR7Xn4XcpUOGfDw67XU9gA":{"text":"We had some good food while listening to live jazz.  The rice bowl was our favorite food t","useful":0,"cool":0},"86ZFntKIdDT2zDBxLI6QAg":{"text":"Discovered via Yelp and certainly didn't disappoint.  \n\nHighly Recommend making reservatio","useful":5,"cool":2},"uXaG64MlaG9mRTXhGcNkPQ":{"text":"As noted before, you only get 1.5 hours at a table but the servers are so prompt and atten","useful":1,"cool":0},"jdD8pLjqPjnFmVarLHlOLw":{"text":"This place is amazing. Great food. Perfect ambiance. You get amazing food and cocktails wh","useful":0,"cool":0},"GWDN1TkBzxaO1UdwD4GrfQ":{"text":"Three Muses is a gem! Recommended to me by a friend in NOLA, it did not fail to impress! I","useful":0,"cool":0},"7xmiyfg-SwENQ9QVoJbFPg":{"text":"Great music on the several occasions we visited.  Good food was reasonably priced and the ","useful":0,"cool":0},"tXEoESwkfC_kSLHxGNjX3w":{"text":"Stop reading this and go!!!  Drink - Eat - Listen and enjoy!!!  The staff is super friendl","useful":0,"cool":0},"7K6UJSo2C50JkrMWWOQIdw":{"text":"All around excellent experience! We came on a Thursday night and had a reservation, which ","useful":0,"cool":0},"Ro-ZNDXPD55rhglme-04kg":{"text":"Three Muses satisfies all your New Orlean's needs-Drink, Food, Music.  Imagine a small clu","useful":2,"cool":1},"0bXSSaSFd0WyILCScK-AXA":{"text":"Simply the best. All the tapas were to die for. Such a variety of tapas. The mucus was fan","useful":1,"cool":1},"Wu72G6vy2Xqqr4GzIRiE2A":{"text":"Have always liked the Three Muses, but last night was a disappointment. Good music, nice v","useful":0,"cool":0},"l7vRSLA5VOQNmfMo4u1UYg":{"text":"The food was tasty but the portion size is very small. A group of 4 people would need to o","useful":0,"cool":0},"MiMU1C8GVvQZC3QBRxXYrg":{"text":"Great music, and good staff!!  The food is an awesome value for Frenchman street area too!","useful":0,"cool":0},"O79HyiAlzSGz22oCle7Oxw":{"text":"Yes, what you've read and heard about this place are all true! Great drinks (sazeracs were","useful":0,"cool":0},"b67IGHZlege7i1NX90_AFg":{"text":"Love this place. Food, drinks, and service were fantastic. Lucky enough to get in without ","useful":0,"cool":0},"8VpqW6skgSpkCfdNmz7ZKQ":{"text":"If I could give this place more than 5 stars I would.  I was in NOLA for a week, and this ","useful":4,"cool":0},"KrXuiAsEArvRJJpu-E-Pzg":{"text":"I finally was able to get a table to sit and eat there this past Friday! I did think and p","useful":1,"cool":2},"kEYtENdyEOYmS7rq8LN1jQ":{"text":"Very sophisticated but relaxed atmosphere in contrast to the revelry around it. Reservatio","useful":0,"cool":0},"f5-19yCF80T_2xeoqU4lSg":{"text":"Quintessential New Orleans at its best!! Delectable dishes, fantastic live music in a welc","useful":0,"cool":0},"veiJWNz6G6eiP9-DAwPcsA":{"text":"i'm going to have lower my initial five start rating by one star for a handful of reasons:","useful":2,"cool":1},"9CQoxDc_oMq7S4hVVn072A":{"text":"Everything here was perfection. The Rosemary's Baby cocktail, the fries, pork belly, duck ","useful":1,"cool":1},"oA4JU356PvdkHWqq75GjEQ":{"text":"LOVE LOVE LOVE this place! First time in NoLa last month and we stopped here for some live","useful":0,"cool":0},"BYNzLGsfVMesY5Vy0lVdDw":{"text":"WOW !!! Read nothing but great reviews,  had to try it for myself!! The tempura shrimp is ","useful":0,"cool":0},"XHRN6oyevqdhSaErQcejCQ":{"text":"Awesome drinks!!! Awesome food!! One of the best places I have ever been. It isn't formal ","useful":0,"cool":0},"Q8P53V2sxVe2s8TiTTsa4Q":{"text":"Three Muses was the best meal we've had in New Orleans. The drinks weren't shabby, either.","useful":0,"cool":0},"hCdBl_SBVCkCBkxZE8bUhQ":{"text":"Great place to take out of town guests, always a great little band, fun atmosphere, good l","useful":0,"cool":0},"wm1SHxJmytQ42zJbLUY2lA":{"text":"Such a fun dining experience and the perfect place to spend our first night in NOLA. Super","useful":0,"cool":0},"wBsnejaN0r-OCg_gkPyEbA":{"text":"Amazing food and music. We had the bruschetta and mac'n cheese. So good!!!","useful":0,"cool":0},"f02djCA_Zb-BdxFqKws6tQ":{"text":"Finally made it to Three Muses after wanting to get here for a long time.\n\nStarted with th","useful":0,"cool":0},"2ALEUlq6a_FkKpDGZpQhEg":{"text":"This was a tough one to review as there are pros and cons to a multi part venue.\n\nLet's st","useful":2,"cool":0},"pJiiJsm4Ir-NMHxj65Ulww":{"text":"Feta fries and the mac and cheese is where it's at! Yummy! I traveled to Nola during the w","useful":0,"cool":1},"BPYxT9vyZ2hUMuBp5vbUpQ":{"text":"AMAZING AMAZING AMAZING. Food was melt in your mouth delicious, the earl grey cocktail was","useful":0,"cool":0},"6s0V8D-gSKgowYAPwGSkQQ":{"text":"Exactly perfect. Great music. The bartenders are incredible. The food was good. Nice conve","useful":0,"cool":0},"1FHAKeTuTP4nOdIkCMBlsQ":{"text":"Music:  meh.  At least that night.  The singer was great but just not my type of jazz.\nFoo","useful":0,"cool":0},"_5kKey_hlRDOEnfRal6LmA":{"text":"The food is ok. The servers are over worked (so they are not very attentive) and the music","useful":0,"cool":0},"QY_EXFqIu36CmQd7jgGwjg":{"text":"Want to be told how inflexible they are? Have a food problem. Took a bite of duck starter ","useful":0,"cool":0},"H2OhDZbWRM83rpCXZvtMMQ":{"text":"Way more that the typical bar food, even for New Orleans.  \n\nGreat food, great music and s","useful":2,"cool":2},"TSJAqQZEq98JtDJC1vuaJA":{"text":"Love the music, love the food and the service. My friend and I went to the Three Muses on ","useful":0,"cool":0},"H1UgKiH_sN6dqY0neFMY_A":{"text":"This little place on Frenchmen Street is probably one of the best places I've been to in N","useful":0,"cool":0},"Xjcc1pbbyYNpVeGYcLfTqQ":{"text":"First of all, this place is very well located. You cant miss it! It is cosy, the band play","useful":0,"cool":0},"DkZLUgOveCCp9o0cX8x7sg":{"text":"This place has the best music around! Dr. Sick was amazing!  Service wasn't uber fast, but","useful":0,"cool":0},"vGWpduKN66kAWXHWzHf2SA":{"text":"The food here is fantastic! I recommend the tempura fried shrimp, charcuterie tray, steak ","useful":0,"cool":1},"KkEG4EBcrPLaZFsJ4HuDGg":{"text":"I am only giving this place 3 stars because of the value of the food.  We found this place","useful":0,"cool":0},"Oa5VjR0sZtYABIiFVOAhSw":{"text":"Sat. 5/14/16: Three Muses was a waste! too long to get our reservation: 1 hr. 40 mins. was","useful":0,"cool":0},"zhK8KefBugdRbF4p8bfCGw":{"text":"This place gets great reviews, and deserves it. Be aware that the tables (indeed, most of ","useful":0,"cool":1},"TfsvwAmPQHPh9N4hvR1AgA":{"text":"got there at 6:00 on an October Thursday night: just in time for the end of the piano/bass","useful":1,"cool":0},"myF3UYz8Uclb8eQo7oKdGA":{"text":"Gem on Frenchmen St - visit! Great vibe. Classy crowd. Friendly staff that keeps a good hu","useful":3,"cool":2},"Fd6Ajs_n9Xg1FKvd2v2sCQ":{"text":"I love this place.  It was a relaxed & intimate space with fantastically friendly service ","useful":0,"cool":0},"bDJ3ByAl0VKBfkEEjcN55A":{"text":"My friend and I loved this place.  The band was exceptional and the staff was soooo nice (","useful":0,"cool":0},"S1GP-5r2RBmv3TUsDWfuXw":{"text":"Went on a Sunday night and waited for 30 min, so worth it. Best meal I had in New Orleans!","useful":0,"cool":0},"SII34bqp6Vio_eFfhNFXmA":{"text":"I was staying in the French Quarter and wanted to get some quality non-touristy food.  Thi","useful":0,"cool":0},"iQctXSlvvnPbFCeCWjfMKg":{"text":"Wonderful atmosphere; live music, cozy seating (and cozy is a nice way of saying that tabl","useful":0,"cool":0},"PLnkxio4xvVwz8JBZDS5kQ":{"text":"The wilted kale bruschetta was phenomenal! It was a weeknight and seemed pretty busy with ","useful":0,"cool":0},"VJESH_wv4YKpnwJ0SwNMEg":{"text":"Great food and music.  My favorites were the tempura shrimp and the Mac n cheese.  Make a ","useful":0,"cool":0},"5SInas0UKXQ9BQoerlc6Tg":{"text":"Our favorite place that we ate at during our NOLA trip. Great location in Frenchmen - not ","useful":0,"cool":0},"wNFkKZAPXAzx7BbYYB_crg":{"text":"Dropped into 3 Muses the other night on my way home and it's as delicious as ever. I could","useful":2,"cool":2},"8yhHhxgNvyWWi5nLlC9RWA":{"text":"Food was so good! The fish tacos were my favorite, should have gotten two orders. Ordered ","useful":0,"cool":0},"KVw6jf-bbh_R9Jk6n-ZyKg":{"text":"I had been wanting to try Three Muses since it opened so when I was invited I jumped at th","useful":1,"cool":1},"0A7Ex2QVBv9M-MZZAgXlOg":{"text":"Loved this place. The band was great and the setting is understated but classy. I sat at t","useful":0,"cool":0},"JvqtUNrmwu2DQ9bJSYd3TA":{"text":"Food was outstanding. Really quite spectacular. Service sucks. If the food hadn't been so ","useful":2,"cool":0},"b-Sq6zLDOpNPAqt7ZnPsMw":{"text":"Place had great entertainment live music kids ok, until 10 pm. \nDrinks are strong, alligat","useful":0,"cool":0},"iKuVywMtB2SZwl9bed7Pig":{"text":"Best cocktails in NoLA so far. Good beer in this city is harder to come by. Knowledgable b","useful":0,"cool":1},"yobCS4yFdlHNQbuMjnXiFg":{"text":"Some items come out fast (basically anything fried) but waited 45 min for 2 orders of slid","useful":0,"cool":0},"w0noHsrH_iUqo36ZiWqKlg":{"text":"This was probably my favorite place that I went to in New Orleans. It gets crowded really ","useful":0,"cool":0},"8b_RZpv5WDKNKa6zrJSHyA":{"text":"First thing I must say is that the chef is really a close friend and I have gotten to know","useful":6,"cool":4},"NJ2wKcVzEuQL8-5914xaYQ":{"text":"Excellent food/atmosphere. Bartenders were both very good and accommodating. We went witho","useful":0,"cool":0},"NmdS0p452S-w1mOBqLwB2w":{"text":"Oh, New Orleans. Your French Quarter always tries to lure us in, but this time we found ou","useful":1,"cool":0},"XCFaeBvrcXaEH0gWvEVfxg":{"text":"I dined on Lamb sliders ($9) & feta fries ($7). I washed it down w/one of their tasty mart","useful":1,"cool":0},"XU5HvGwK-xApVnt_JtFlbw":{"text":"Intimate atmosphere, tapas style plates, great food. Make a reservation or just hang by th","useful":0,"cool":0},"xDlcSbKVCx6w61KVFV8ykg":{"text":"Very cool hipster type place.  Great ambiance.   Food was delicious.  Music was great.","useful":0,"cool":0},"1sFl-klma9CuCzd8EWjPhg":{"text":"We had heard good things about this place so we put our names down since there was a wait ","useful":1,"cool":0},"n3oLIn780cAgrWk7Rtn9ng":{"text":"Excellent experience all around - They happened to have a table for two no-show, so they s","useful":0,"cool":0},"l6ro1GoapbMCQA4dEUAozA":{"text":"OMG this place!\nTop 5 greatest things about this place:\nGreat service\nGreat Food- for real","useful":0,"cool":0},"DJ_1h8Eck1W0VejZ3wEwfg":{"text":"The food was excellent. The lamb sliders were a hit, as well as the Bacon wrapped dates st","useful":0,"cool":0},"RUCnGsKWIfl-S1Mcq7jjDQ":{"text":"Our hotel concierge turned us onto this place when us \"out-of-towners\" asked about where t","useful":0,"cool":0},"ofVnDPToR5UlXbRG6-5IVQ":{"text":"Came here with some friends ordered Mac and cheese, steak, pork belly, fried oysters, devi","useful":0,"cool":0},"HZYE6G8ufTxEp-yOgC91og":{"text":"Some of the better mix drinks I've stumbled across. Sadly the beer menu is a bit lacking, ","useful":0,"cool":0},"aYmNiKdFbKQesQI3eSMnxw":{"text":"Wonderful place! We enjoyed good food and great music! I recommend to try the sliders and ","useful":0,"cool":0},"6h-i9cJSggzsu-YON0Oovg":{"text":"This place is fantastic. Easily my favorite spot in NOLA. The food is fantastic, the drink","useful":2,"cool":1},"WE-dYnMke8PG304OkMlGZw":{"text":"I enjoyed the live music.  I think the group was Red Roses, the lead singer had a beautifu","useful":0,"cool":0},"a7pt7PyRnT3mzqpKSt2snw":{"text":"Great: Music. Lamb sliders. Feta fries. \n\nGood: Mexican chocolate ice cream. Beer.\n\nOk: Go","useful":0,"cool":0},"z9SA1wLXbXjmoLtFRX8OoQ":{"text":"Great small plates and a wonderful atmosphere. The blue cheese dates and fried mozzarella ","useful":0,"cool":0},"DAWlL3mrmyt3BKe_ktg6Fg":{"text":"So much fun jazz was great \nVery very very small portions but delish\nVery friendly crowd \n","useful":0,"cool":0},"Qd0W3h1zGeqJZb_CozwmSA":{"text":"Finely-played (quasi Parisian) jazz accordion and guitar, rosemary and cayenne cashews, Pi","useful":0,"cool":0},"4vraWuOaLGVrv0MKzQJOZg":{"text":"Went here last night to try out the food and I have to say, fellow Yelpers, that I was sli","useful":1,"cool":1},"iO70CPQlcqrWw3NO8brsjA":{"text":"We came here because of the solid menu items for vegetarians (was especially looking forwa","useful":5,"cool":5},"CAWbzxHFAkDGh3uU1ROCzg":{"text":"The second place to make me fall in love with gin-based cocktails on the same night!  Thei","useful":0,"cool":0},"koua2Fz4AU36Phs6E7eJ0Q":{"text":"I'll start by saying the food and live music was excellent - and the only reason I didn't ","useful":0,"cool":0},"okSkZUxtP5pjCqshVTHGDA":{"text":"Loved the food, loved the music. We were on vacation in New Orleans and came here at the r","useful":0,"cool":0},"cVv0Go8nFZ27VP75FIShxw":{"text":"Love love love this place. We went there for a first time visiting New Orleans and couldn'","useful":1,"cool":0},"gXv70GMBZSnegoz2kE8V_Q":{"text":"Amazing food, get the bulgogi and nutella ice cream. Music was outstanding. Would highly r","useful":0,"cool":0},"-bSjvaQPpzu3-iRxJk3V0Q":{"text":"- A nice place for live jazz and small plates food.\n- You will have to order directly at t","useful":1,"cool":0},"FBrrdETjIcVLfm45KmfCQQ":{"text":"cozy (that's real estate lingo for \"tiny and cramped\") restaurant/bar/live music venue on ","useful":3,"cool":2},"-tw5cD_J9BhQLOOdT9X4nA":{"text":"The best of the best!  Wonderful food, spectacular cocktails, and the best musicians in to","useful":0,"cool":0},"7Gil1g4fBdgSopzoEP1Izg":{"text":"Simple execution of the highest quality ingredients seamlessly blended with outstanding cr","useful":7,"cool":6},"JNxYmYixBvE3c0099aYSKA":{"text":"Walk in and start your drinking with \"The Dirty Dan\", a dirty martini like no other.  I'm ","useful":1,"cool":0},"OQGxTQVPYcnmlm6Zl42jPQ":{"text":"OMG!!  I would move to New Orleans just to be able to go to Three Muses often!  Great food","useful":0,"cool":0},"Xx3KY3hQtQIjfQ71AV8iig":{"text":"I LOVE this place! Of all the places on Frenchman Street, this is the absolute best, hands","useful":0,"cool":0},"0OVpwJ9y5gLgjO6gzrNhpg":{"text":"Wir waren den ersten Abend in NOLA hier essen. Wir waren sehr beeindruckt von dem Flair de","useful":1,"cool":0},"vE2T8VZrMNZrZb_PAS6FhA":{"text":"Good food, live music on Frenchman street! I tried the bulgogi, lamb sliders and the tempu","useful":0,"cool":0},"0T5NVqe0fG4Jz2ccVytWww":{"text":"The crown jewel of Frenchman street. We checked this place out at the recommendation of a ","useful":0,"cool":0},"_QnF_IJEFA2hrhA931U0MQ":{"text":"Fabulous evening....when you combine a great atmosphere, fantastic food, wonderful cocktai","useful":0,"cool":0},"7nOb0VzTVMuRWqNmcQAtLg":{"text":"Crave culinary master piece in your mouth? Eat here. If you are going with five or more I ","useful":0,"cool":0},"1567i5_EJbaBpJB93SuStQ":{"text":"Quaint jazz bar on Frenchman. It's a little awkward getting in the front door for a table ","useful":1,"cool":1},"pA80nRUljvapSI8_ODb9gQ":{"text":"Such a great dining experience. We were visiting from out of town and made reservations ah","useful":0,"cool":0},"JCCo_EduEC_hA7R4co-B9Q":{"text":"You can make a reservation on \"Resy\" app, but I made one via phone since I wanted to inqui","useful":4,"cool":1},"RaPfe8GsAUVqtRmWz3lwxQ":{"text":"We really, really like this restaurant.  Opens at 4 pm till ? Nice music, nice people, gre","useful":1,"cool":0},"vSA8rpw4p-uCNkfO3Ng--w":{"text":"I loved this place. We came here three times on our trip to NOLA! \n\nThe first time was to ","useful":0,"cool":0},"PdAqBJ0nQgSl6j-moT4AIw":{"text":"You know that vision you had of yourself watching jazz in New Orleans? Ya this spot did th","useful":0,"cool":0},"y44liUrvMJoc8Sw94v1uHg":{"text":"Great cocktails, good food, not a very big menu. Waited over two hours for a table (it was","useful":0,"cool":0},"YG_GELI0Lgq75xnQvttuwg":{"text":"Great place on frenchmen street, away from the crowded bourbon street. The Lamb Sliders we","useful":1,"cool":1},"fD6UQKDZ88bjsS5EKxr5rg":{"text":"Not sure that this place needs another rave, but here I go anyway. Last night was an alone","useful":2,"cool":0},"NFOO2-ojhGgVEBLo4dQLcg":{"text":"Wonderful food. Great music. Great service. However....very poor business plan. Seatings a","useful":0,"cool":0},"FB5z87z5xdlT1fP_8LeiIA":{"text":"I came into New Orleans just for fun, and for the pleasure of getting to know the city. St","useful":1,"cool":0},"h4G7Q8fkg2jt4kH6XJPlNg":{"text":"Good food, great drinks, good service, very rude hostess. Upon arriving with a group of fi","useful":1,"cool":0},"hgMHroO7LTqnyettkNvh9w":{"text":"LOVE this place! My favorite restaurant in New Orleans. Stumbled in right before closing a","useful":0,"cool":0},"37Ii_oFEatk-_cHIewPvFQ":{"text":"The music was good, but the service was not.\nOrdered drinks and food, but when the drink I","useful":0,"cool":0},"BFVkkaRvjHIcYaJQ6LV1PQ":{"text":"So I finally had the pleasure of visiting Three Muses for a private event. What a pleasant","useful":3,"cool":1},"-PpmNlVrYnUVHvgBsTTo2g":{"text":"2.5 stars. Overpriced food. Even though they advertise themselves as tapas style, the menu","useful":0,"cool":0},"Du9WrFiexQHH5bTcehjDPA":{"text":"Just back from a dinner at Three Muses. As others have noted, Candice, who takes phone res","useful":0,"cool":0},"HPsgBTcCizXlEgc6PrpYDg":{"text":"The food was fine, very limited menu with small portions.  5 Stars for the entertainment! ","useful":0,"cool":0},"XCvF1VDpa9VtLmZ-3g9izQ":{"text":"Friendly service, great small plates and drinks, and cozy atmosphere.  We sample the steak","useful":0,"cool":0},"aqxT3RXaS_pmahtbYkfnDA":{"text":"Saw a brass band play here back in May. They were on point, but the acoustics and mic were","useful":1,"cool":1},"tV0w4X9Cj9pkYyE83s-CyQ":{"text":"Went here on our first night in NOLA.  So glad we did!  Food was great, music was good.  I","useful":0,"cool":0},"AbED1PXsvSGGndpM1-qllA":{"text":"We found Frenchmen Street towards the end of our trip to New Orleans but boy, are we glad ","useful":0,"cool":0},"i-_3UhZLcAUDm13mKvm3ew":{"text":"I am sorry to leave a 2 star rating.  We arrived with great expectations as we had eaten h","useful":0,"cool":0},"_2msOdrOYW1XvwjiMXud-w":{"text":"Unbelievable! Came for a Bachelor Party and Three Muses did not let us down. Hats off to t","useful":0,"cool":0},"d8VO5EMFDbGpwmXOR4A19g":{"text":"My husband and I were blown away by the food! First of all, they have my favorite cider on","useful":0,"cool":0},"VITCjJuIhZeJv3fxUqwzGw":{"text":"Amazing place.  A must go when in New Orleans. Make reservations ahead of time, expect onl","useful":0,"cool":0},"pOHL6tTEgH-5Rpoi483XAA":{"text":"This is a small place. 1st, the food is inexpensive, and when it comes out, you understand","useful":1,"cool":0},"FPJ2HM_hlFmpW8kCjI4Yow":{"text":"I've been here three time in the last year.  Always good.  Crowded and busy and full of go","useful":0,"cool":0},"lhw_r1dYr_pXMXmyVTLwfQ":{"text":"Spent the last two evenings here. Great music and friendly staff. Frenchmen Street is a fi","useful":0,"cool":0},"v5I9bBjEzV0lHpcSAPmNuA":{"text":"Always great bands.  At least a couple of different ones a night.  Food is awesome.  The p","useful":0,"cool":0},"4l5pXQmiYD0SAmAXwbThsw":{"text":"Great food, great music and server Denna was awesome! Great recommendations for the stuffe","useful":0,"cool":0},"CMe7POPL3GQhQ6eq_vgW6A":{"text":"Vibe was awesome! Great jazz and fun bartenders. If you have any ounce of value in your ex","useful":0,"cool":0},"8h6D4N1-buB-vw44rR5hOg":{"text":"When we came here, the live music was a guy on the piano. It was good, but not amazing. I'","useful":2,"cool":1},"16lmGyA7F636cMI9rJ9KnQ":{"text":"Not sure what the attraction is that makes this place always require long waits. The food ","useful":0,"cool":0},"ExNK2C2QUDJS1QxY9pMBgQ":{"text":"We made a reservation on Open Table for a Sunday at 9pm. Reservations are a must as this i","useful":0,"cool":0},"dMaOXLuwnz8YgJnEyBpLDg":{"text":"my husband and i hung out at three muses every night (4 nights) while in nola for first we","useful":0,"cool":0},"UEt8zlzqvB54_4QLEaX52Q":{"text":"There was an hour long wait. We went to DBA to kill the time and stumbled upon an amazing ","useful":0,"cool":0},"9dDzsUjoyVzomBRqxlaqwQ":{"text":"Excellent tapas!  Great atmosphere.  Whats not to like.  Highly recommend.  Try the cheese","useful":0,"cool":0},"UjJMQxNtWmvzabavsl9qhg":{"text":"I am using this restaurant to mark my 100 review. This will be the restaurant I will likel","useful":3,"cool":3},"xZT3ViQqaLoavtnwA_lSDw":{"text":"We stopped in this place while the sidewalk was so crowded and we were hungry. This place ","useful":0,"cool":0},"1NTrTmFE-ZYlEdYGmjGRFQ":{"text":"They offer a combination of good food and live jazz music along the Frenchmen Street. If y","useful":0,"cool":0},"pC9tVNfm_RTKEgM6lhqfQg":{"text":"I really liked this spot, although at first I got a bad vibe from the pretentious bartende","useful":0,"cool":0},"YrWH8V69vNfifd0TYH3TKA":{"text":"Not too much vegan on the menu even though they have a vegetarian section.  Hubby is vegan","useful":0,"cool":0},"CXIwIqFcb8jb36vAhEDEJQ":{"text":"I JUST tried to get some information and the woman in front taking everyone's name was unb","useful":1,"cool":0},"-TQODeA0w9Ax57bMBjPQJQ":{"text":"Everyone said we had to visit the \"Jazz\" street in New Orleans -- Frenchmen Street.  So I ","useful":0,"cool":0},"5390EoyPAfpDNT07DqZ52w":{"text":"Great music, lively setting, delicious food and ridiculous wait bc they are inefficient in","useful":0,"cool":0},"fEaHI7hoX6XyAemmp7Y2jA":{"text":"My glowing review will just add to others here, but it is so well-deserved. We were in Nol","useful":0,"cool":0},"-mA7lUqw4x04S07uLlMLvQ":{"text":"L'une des meilleures expériences de mon séjours à la Nouvelle Orléans, c'est dire!\nÀ premi","useful":1,"cool":0},"C_dhOULk-P-_kWJGbwXuzg":{"text":"Great vibe and music. Order the steak and frites as well as the creole pot pie, you won't ","useful":0,"cool":0},"N4qDjeFLo24XzNIho3cXkQ":{"text":"We really enjoyed this place (yes tourists) but the food was gastropub down home great, an","useful":0,"cool":0},"1WUcCJ9lQWHwct7iRgdqnQ":{"text":"The night we went there was a lady singing and playing guitar. I was describe her as aviat","useful":0,"cool":0},"83sNQ9xvY3sbZvbATC4zYw":{"text":"The best place on Frenchmen to grab dinner and a few drinks and listen to amazing local mu","useful":0,"cool":0},"cw-DqHS0tBbyuqZFOpiJCQ":{"text":"The atmosphere is fantastic with live jazz music.  The food is amazing! We had the caulifl","useful":1,"cool":0},"wEZ-Ql8T-Kd-2IAJrYMtWg":{"text":"Tapas style dinner, very good food quality. Good environment to sit down and listen to mus","useful":0,"cool":0},"j1ABGAyFP6XypMU91a5Vgg":{"text":"This review is going to be short.... because there is nothing that I am going to say that ","useful":0,"cool":0},"tth_ReA6g3HHM341Jt0IuA":{"text":"Unbelievable wait. 2 hours. With tables open. Terrible service. Hungry? ! You should proba","useful":0,"cool":0},"BF1pxYQpGUr3ZftywG8i0w":{"text":"Excellent food and ambience. Falafel could be better. Delicious brownie.","useful":0,"cool":0},"Qw6reK1LyM5DwDYRTpe75w":{"text":"What was especially interesting on Thursday night was the fact the jazz trio was all strin","useful":0,"cool":0},"Qma2AExdiG_Omv-s65XwCw":{"text":"Came here twice, drinks were a little expensive but there food was great regardless if it ","useful":1,"cool":1},"7gIStMpXpVJXMl1nDHdHtw":{"text":"We headed to this restaurant because we wanted to find a place where we could take our two","useful":0,"cool":0},"gpF8ek72t1Xtcmw1OHsacA":{"text":"Divine. Simply divine. \n\nI came here as a surprise birthday dinner with my boyfriend, as w","useful":2,"cool":1},"B7VQuG1oHzI1O3A27Q1VyQ":{"text":"The gumbo is *clap* to *clap* die *clap* for. So delicious. The cocktail menu is also fant","useful":0,"cool":0},"YIm1yQY_IQkEj_ncdbnkrQ":{"text":"Great Sandwich. I love the place, the vibe, the music, and bulgolgi beef po-boy had great ","useful":0,"cool":0},"Y49sB0qpC3_aXESMnQnDaQ":{"text":"Amazing. Excellent service, and my favorite meal I ate while in NOLA. Definitely make a re","useful":0,"cool":0},"Kb-fEgVOIQUJoxZqZ3_xKQ":{"text":"We went on a Monday night, and really enjoyed it.   The food was great - tapas style small","useful":0,"cool":0},"KsFtjAemODPON2w75TuaKA":{"text":"First, make reservations! Our group (of 3) waited about an hour on a Thursday night at 8pm","useful":0,"cool":0},"3N22GxRKJYIvUDxTGYD1ng":{"text":"Really enjoyed this restaurant especially in  being that its in on Frenchmen's Street away","useful":0,"cool":0},"FzjyLgajpSH6oKB_Mv_nqw":{"text":"This place was great.  The food was absolutely fantastic and worth the price, the drinks w","useful":1,"cool":1},"LZbTB8_tF6tszSVrRviOcw":{"text":"Butternut squash ravioli is amazing! I ordered two large servings\nRecommend the pork belly","useful":0,"cool":0},"jyMIJC-DUdaee3v8gVj2qA":{"text":"Dropped in here and hour before they closed, but it was still packed with people and very ","useful":0,"cool":0},"vbR_cQCQ8WLA3pILT-bjJw":{"text":"Nice little piano bar/restaurant. They were unable to seat us for dinner, so we just poste","useful":1,"cool":1},"Sz_94cnb-GM6uSb357iJsg":{"text":"If Frenchmen Street is your destination, as it was ours, you'll sample a couple dozen bars","useful":0,"cool":0},"Rtfo2xwD8MYjhKNimlltgg":{"text":"It's not clear exactly what this place is trying to be, but I can tell you what it is *not","useful":0,"cool":0},"TaYzH_GWp6GoHxClc70HmQ":{"text":"Thought the place had great ambience. However asked Kate the hostess if we could move to t","useful":0,"cool":0},"LgZGHA05zxfeSH5vVsVSjg":{"text":"Fan-f-n'tastic!!! Everything amazing, after an admittedly looong wait time (hour+, only to","useful":1,"cool":2},"6AgIXNJYfri6KxdKiXDi9A":{"text":"One of my favorite places when visiting New Orleans. Its a must every time. Do yourself a ","useful":0,"cool":0},"CO5zqLO9mW3doi0FY-4nfw":{"text":"We did not have a reservation and got lucky to snag a table at 7pm on a Sunday. Tapas styl","useful":0,"cool":0},"D3SwGZ7dPigWw8ZqkoiGhg":{"text":"I've been to Three Muses three times. I only went for cocktails the first two times. I lov","useful":4,"cool":3},"dFWvF_ttmAynifDLBMXUDQ":{"text":"Have you ever eaten something so good that you just start laughing because what you put in","useful":2,"cool":2},"rEqDMMoWbGwAxbdGKGcg_A":{"text":"We were finishing up with a show and looked for somewhere to eat. Yelp said, \"no wait\" for","useful":0,"cool":0},"4CnAAx9BQWKWZSF-4Mi57g":{"text":"The food and service are great, once you get in.  The wait is usually about 1:30 to 2:00 o","useful":0,"cool":0},"BJnEATFOWwAJ-6K7QczljA":{"text":"Terrible service. We were told there would be a 30 minute wait, but two parties who arrive","useful":1,"cool":0},"l-1xLKiKK938QKoocDn9pQ":{"text":"Y'all gotta try the fries! \n\nExcellent live music ambience. I felt very comfortable here, ","useful":2,"cool":0},"H9yEbhgIFnbIFAnmtiruRQ":{"text":"Great atmosphere. \n\nRight in the middle of Frenchman Street, this place is pretty small an","useful":2,"cool":0},"-yxVm9i_3zhN9LPiUDwi6w":{"text":"Ms Moons Bulgogi Rice Bowl is a sure fire hit.  Italian Baked Mac & Cheese will not disapp","useful":0,"cool":0},"CqPF5tuRkLIXaIz69RFqlw":{"text":"Incredible food and live jazz. We were a group of 4- ordered the dates, bruschetta, fires,","useful":0,"cool":0},"zL67NmZKWwmP-HZN8H67bQ":{"text":"What doesn't this place have? Live music, delicious food, and bomb cocktails all around.\n\n","useful":2,"cool":0},"McBaJKrBPQKE6Kko_13Ckw":{"text":"My boyfriend and I enjoyed some of the best cocktails we've ever tasted, along with absolu","useful":0,"cool":0},"ObNkBnI6V6P1HA2QKE5VGQ":{"text":"TOURISTS BEWARE!!!!  This place will not allow anyone to stay for more than 1 1/2 hours.  ","useful":0,"cool":0},"i-jb_dl0M5JWaPSh2qwpaw":{"text":"This was my second visit and again I found this an interesting, delicious experience. Four","useful":0,"cool":0},"ovEViXjSCdZx4h_2DjwkEw":{"text":"The service was decent. I ordered a rice bowl that came with flank steak and kimchi and sp","useful":1,"cool":1},"IpY7xY8Q7kdO3csTpzaZ8Q":{"text":"Lost its charm to tourism. No longer serves the dishes wish made it great. Lastly gave me ","useful":0,"cool":0},"HXvywYTdi-0p2mNAH_hPZg":{"text":"Excellent cocktails and great jazz! We wanted to check out the live music scene on Frenchm","useful":1,"cool":1},"GRWkdl3EvZcI7pFmfco2jQ":{"text":"Smaller portions but the the taste is out of this world. Drinks poured heavy and very good","useful":0,"cool":0},"QFY_oMiq9ZGK3ZCLvqQMTg":{"text":"We walked up to the hostess and was told the wait was an hour.  We offered to sit at the b","useful":1,"cool":0},"TaQkDnEsgmf6pecVF1OOmw":{"text":"Put shortly, this place is amazing. The food is phenomenal, the music is good and the atmo","useful":0,"cool":0},"jkEd4bdNXlU-EEdzKpPBPw":{"text":"We had a great time here tonight. The band we had hoped to see didn't arrive at another ba","useful":2,"cool":0},"cvHO1VzwnmaP2IJKb7X-vQ":{"text":"Little gastropub on Frenchman with live music.  The food is OK, in some cases it's good wi","useful":5,"cool":0},"IZ0tdbA-vJ3c613R6AVrIQ":{"text":"Spectacular food. As a person who dislikes most cajun food, I have had a hard time figurin","useful":1,"cool":0},"ZXVCwRzoro_PgMKnK0kM1A":{"text":"My all-time favorite meal in New Orleans was at Three Muses in January, 2017. Delicious sm","useful":0,"cool":0},"ow92jjOtlpiNqpmqUxwSbQ":{"text":"This restaurant had a nice variety of small dishes to share. I went with a party of four a","useful":0,"cool":0},"kNCKi_3LamG4TrFsLqDNqA":{"text":"I found this place totally on a whim using yelp.com.  I checked out the menu online and th","useful":0,"cool":0},"eAcyWdAmQ-xm-EinwmU29Q":{"text":"This is my first review on Yelp and I'm pleased to say, it's a good one! Three Muses is no","useful":0,"cool":0},"S0VS2DxEy9Q9XQoNE3nc_g":{"text":"This little spot can be found along the south end of Frenchmen Street. The dimly lit inter","useful":0,"cool":0},"OePYN5Fxlt37QXj2iX-CGw":{"text":"My husband and I went with a friend from belgium. We had a few drinks at the bar waiting f","useful":0,"cool":0},"yzGTDi9a_gIurTKa6K-5HQ":{"text":"We came on time for our reservation and they made us wait 30 minutes by the bar. The barte","useful":1,"cool":0},"hGxBWIhSwtR9rjffyqG5Tg":{"text":"There is a reason this place has the highest rating on Frenchmen Street!  It's got GREAT f","useful":0,"cool":0},"y1rLv5cdrc5aYKQ0iJSEHA":{"text":"Superb find in Frenchman street. We had perfect pork belly, and other dishes which creativ","useful":0,"cool":0},"Rv69LJE4jTcibiFKNxhZxw":{"text":"The food was delicious the service was nice, and the band was cool,but very small plates f","useful":0,"cool":0},"9tOQZtVCRiNuZFI3eJ_8YQ":{"text":"Fantastic steak Frites. Really good tempura shrimp...come for the cocktails too. Live musi","useful":0,"cool":0},"-qxQ4eu7STXcLT4mva89qw":{"text":"Automatically gets 5 stars for the no smoking policy! I love music, but I don't love smell","useful":1,"cool":1},"_ugJJNnfBAO1Ih9os7oUJw":{"text":"Great place we came twice in one week.  And of course you know how many restaurants there ","useful":0,"cool":0},"38jzcDY28McADEoebUmEwQ":{"text":"Nice spot with great music.  We arrived at 5 on a Monday and had no problems getting a  ta","useful":0,"cool":0},"E_CnwvpURd2K8KFBV9qBYg":{"text":"Great little spot on Frenchman St away from the craziness of Bourbon yet good band.  Fish ","useful":0,"cool":0},"w-QWNltUV_YaXsXQ2tHk9A":{"text":"Excellent dining experience - and thats not an exaggeration. \nFact - great character, good","useful":0,"cool":0},"kn8MRfRk9bGFmj_pDQKf0Q":{"text":"Sat at the bar with the intention of getting a drink, listening to Jazz and heading elsewh","useful":0,"cool":0},"4_F5_o0pRpxQcZZMwL2RpA":{"text":"This is an experience.  When we first arrived it sounded like music from the movie Midnigh","useful":0,"cool":0},"0O_6tLBQ84zeZlktTSCyiQ":{"text":"Amazing place and the food goes with it! My wife and I went made reservations since it was","useful":0,"cool":0},"585LDw6rxfgt_bH_Ft9-8w":{"text":"Hard to explain until you've experienced it.  Small comfortable setting, very friendly sta","useful":0,"cool":0},"5uyBDH7F9qGZG0bH3S289g":{"text":"Quite possibly one of my favorite places in NOLA. The food is awesome, (try the new braise","useful":2,"cool":2},"6fLYpHJHhwYKja5qnIAaeQ":{"text":"Happened upon this place while walking down Frenchmen St, going inside was by far the best","useful":0,"cool":0},"rp9p2CS_a-R7plxOMam4ww":{"text":"Everything from the meal to the environment was great! The bar/restaurant is really small ","useful":1,"cool":0},"IVdoTgXQjqyQOxQOYt9FuA":{"text":"You know, what can I add that others haven't? We came here on a Monday night so the wait w","useful":1,"cool":0},"MZoQXBPpaIfkO0aq5P92Fw":{"text":"Probably my favorite place on Frenchmen. I don't always love the music (last time I was th","useful":1,"cool":0},"H5-V7igiNmN0bVMH2NV0vw":{"text":"The food was mediocre and the wait was horrendous. Totally understaffed. I ordered the sca","useful":1,"cool":0},"W_u-1i0y-ilx4_twKOVjQA":{"text":"Best cuisine I've ever had.... lamb sliders, pork belly. Amazing.","useful":0,"cool":0},"uQtEjh57GcbNDebjt8jcRQ":{"text":"We stopped here out of chance as it was the only location serving food past 9:30pm on Fren","useful":0,"cool":0},"Oxbifss9Hzj8cpRJo9v7OA":{"text":"Three Muses is awesome! It's tapas style so definitely make sure you order multiple items ","useful":0,"cool":1},"lPvMiv1rjUVJS4oFR53tdw":{"text":"Bartender and hostess were excellent. We enjoyed the drinks, and we spent two hours listen","useful":0,"cool":0},"acAOHwBvHnsjxH7HnAyxdg":{"text":"I love Three Muses!! Great live music, phenomenal menu and amazing ambiance. Everything wa","useful":0,"cool":0},"IFJV1Ge5hze8ZD_2BXEojw":{"text":"In a word: underwhelming. \nService - 2/5\nFood - 3.5/5\nAmbience/Music - 2/5\n\nThree muses wa","useful":0,"cool":0},"Vx0GaDHYMU8J7-kGbLZ5vQ":{"text":"Dreamy.  The food, the blues, the service, the cocktails, all five stars. \n\nI was hooked f","useful":1,"cool":1},"r6TLMDrxzq3p7h4CS2ce4g":{"text":"Tourists beware!  This place has a new policy of limiting your allowed presence to 1 1/2 h","useful":0,"cool":0},"O4YCUIKdtAFI-ToCqkxXTA":{"text":"This brand spanking new, upscale restaraunt and bar is a perfect addition to the Frenchmen","useful":2,"cool":2},"jioA-e8DBMGW2XWXaX43Ag":{"text":"Muses is the rare kind of place that made me actually stop and appreciate the food that i ","useful":0,"cool":0},"_TAuWUO2WTPoK76RuamnDg":{"text":"Greeeeat NOLA Jazz, really nice food (small plates but great selection and variety), nice ","useful":0,"cool":0},"sXnauULJQhZM4s6_E67eXQ":{"text":"lively jazz and a lively atmosphere.   \n\nwe got pim's cup (refreshing drink with cucumbers","useful":0,"cool":0},"dmdpKlzvRswzOWibZiesnA":{"text":"Went in for an early dinner on a Saturday night. The key is to get there early or else you","useful":0,"cool":0},"IluqTJZ6wO04hLZuFVeVHg":{"text":"I keep going to his place every time I go to New Orleans. This is the best place you will ","useful":1,"cool":0},"GWHHEk5sD0gfFzuvYJsTFQ":{"text":"The wait staff, food and bar are very good, professional, and friendly. The food was very ","useful":0,"cool":0},"su9xO4oJbv-yb6MN3rgOcg":{"text":"The place is not very large.  We had a reservation on a busy night where a parade was runn","useful":0,"cool":0},"58Pk-GPks_nLPGmyN-jevg":{"text":"Must try... Feta Fries, Lamb Sliders and the Macaroni and cheese.  The band was excellent ","useful":0,"cool":0},"V0GzjxyIKaqexGlJOmtW9A":{"text":"The food was superb and the jazz fun. We made reservations and ordered food. The local bee","useful":0,"cool":0},"G6n77v7nAo0k8nFzAUTzpA":{"text":"Three Muses is a great live jazz dinner spot on Frenchmen St. It's small and intimate with","useful":1,"cool":1},"JIkKu12eL4n0vtZ3rmdi-g":{"text":"Absolute must-try stuff. This will go down as my best, most prototypical New Orelans exper","useful":1,"cool":0},"EChPfmlmo0jvAqXagSG18w":{"text":"We made reservations here before coming and I highly suggest you do make reservations. I s","useful":3,"cool":1},"v8zi9W_Ym6PCp2-Z0j_eTg":{"text":"Great music club on Frenchman with no cover charges. Smaller place, with an awesome, intim","useful":0,"cool":0},"vHytYZTsYtmFIvaNdDUW_g":{"text":"Loved the brussel sprouts and the gumbo. I went a bit early, the music was just ok, maybe ","useful":0,"cool":0},"OxFyLXH37O4KTMgfztZBIg":{"text":"We had a great evening.  Got there like 6pm waited a few minutes for a table...not bad.  T","useful":0,"cool":0},"MVMrAKuVilvb4Diis-hu0Q":{"text":"This is my favorite spot in NOLA. Right on Frenchman St, it has live music all night and i","useful":1,"cool":1},"UI75XRRzRbYUfIlb2pO6sg":{"text":"My new favorite place in NO. The ordering situation is a bit odd but you'll figure it out.","useful":0,"cool":0},"u7O7vqP4wk_cVZ76q3815A":{"text":"Try not to go eat here late in the evening because it gets really crowded when the bands a","useful":0,"cool":0},"q5Zv8w3juf5uL593GlrKLw":{"text":"What a great place to share some plates!  And we love that you can still have a conversati","useful":0,"cool":0},"66YLuIZ9Hcjhlzv1j0rTDw":{"text":"When this placed opened up years ago I felt it was a 4/5 star establishment with great foo","useful":9,"cool":4},"X9ZFNtSnPlwUWuXrmDUx1Q":{"text":"This is the worst bar I've been to in New Orleans.  The were 7 of us in the group and they","useful":0,"cool":0},"rctk5b87be0b7zEotfJXXw":{"text":"This bar es AWESOME. We took the lamb sliders, bruschetta, fish tacos and fries. Prices be","useful":0,"cool":0},"Bv5dzZxO21M47ZA6A9KwIQ":{"text":"In NOLA for a few days, and this was -- hands down -- the best restaurant we ate at. A sta","useful":1,"cool":0},"PO_Lx-TLNfBSTuvBWbb16g":{"text":"Loved this place. It should be stated, because I didn't know this before going, that these","useful":3,"cool":1},"mCIG8XgM69AOPAsviah7KQ":{"text":"The food here is OK, nothing too memorable.  People seem to come for the atmosphere and th","useful":1,"cool":1},"Xa8pYRXjkzJJhMc_zLxQbQ":{"text":"Worst place rude host. Couldn't accommodate anyone. Also cursed while NOT seating us. Than","useful":0,"cool":0},"ouqXZsdYhwOWRhfl6_WASw":{"text":"Relaxed friendly vibe. Very welcoming. Favorite small plates were the mac n cheese, brusch","useful":0,"cool":0},"S58fI33Xq6ZP2yyso1IbsQ":{"text":"This place gave us one of the most enjoyable evenings of our NOLA trip. Great food, drinks","useful":0,"cool":0},"lw2lp3_kK0239BWsXoIdxw":{"text":"I was extremely disappointed in the hostess tonight. I always come here and bring out of t","useful":0,"cool":0},"k5bgWJJZMPewY35gfZUYKw":{"text":"One of my favorite restaurants in New Orleans. Great food!  Great music!!  Loved the bacon","useful":0,"cool":0},"5s8r9Bj1WWeZNEwkMLzC5w":{"text":"Just what Frenchmen needs!!! A classy joint that serves food and is smoke free! Epic veget","useful":2,"cool":2},"4w46PSQd-UItcDtv_LnOkQ":{"text":"Wow! Awesome delicious full of personality food! Nice and quick service in a cozy atmosphe","useful":0,"cool":0},"Yyv6y-XH4tC62V3SHSkptQ":{"text":"What a great restaurant! We ordered Brussels sprouts and fish tacos. Tacos were just ok bu","useful":0,"cool":0},"t5-LchhVjz6GUu-Ruyq6SA":{"text":"Great stop for a late night cocktail - prepare to wait a bit or get lucky with some bar se","useful":0,"cool":0},"6YAxCA6SZlYOW6R2DP9OhA":{"text":"A fantastic tapas bar in the Quarter owned by Sophie, a truly talented singer and owner of","useful":0,"cool":1},"CtGq10o1xRshajcLPREuHA":{"text":"Knock out small plate menu that paired perfectly with their cocktails and live music. High","useful":0,"cool":0},"E_drueJf1TGADdqmJHEjLQ":{"text":"Looks like a small divey place...but, no! The food was amazing and we loved the live piano","useful":1,"cool":0},"w7TW6Trjt1nBZbEr6pkUyQ":{"text":"This was the best meal we had in New Orleans. Great food, great atmosphere, delicious drin","useful":0,"cool":0},"s5sH4eAONRHxN06kqruPMA":{"text":"My wife and I effectively waited 24 hours to get in after we discovered that reservations ","useful":0,"cool":0},"2nRKvUwmVW0BQko9xaErlQ":{"text":"If you're looking for an upscale music venue where you can also grab a bite, look no furth","useful":0,"cool":0},"B48QOcWE6JIbFFpFxCD_Lw":{"text":"Are here last night as we were literally staying across the street and had checked Yelp fo","useful":0,"cool":0},"aYjx3nKAl56WP_Bx6FuLIg":{"text":"My husband and I had such a great time at Three Muses.  Food, entertainment and service we","useful":2,"cool":2},"AXbGXRkiph-iFO6tZY54Sg":{"text":"This place is incredible!  Amazing tapas style food, every single dish was unique and deli","useful":0,"cool":0},"IchPlmm3W1Vm-VSLIh8sWg":{"text":"Went here based on Yelp reviews when I came into New Orleans for a weekend.  This was easi","useful":1,"cool":1},"kjttYTAEgWzmT1Rn9w39SQ":{"text":"Amazing music, so disappointed in the service it took forever to get greeted:first drink a","useful":0,"cool":0},"iZGkxLcUbgPFRLBqpzWXbw":{"text":"Tiny romantic place with live Jazz music, great food, drinks and good service. If you are ","useful":0,"cool":0},"q1i3UnvYMLdue3ZGVajpBQ":{"text":"We went into Three Muses just after they opened and had the place to ourselves. It's not a","useful":4,"cool":2},"62bM6W5dIEOAhYaSja7Ojw":{"text":"This place has great food and great live music. Roasted eggplant bruschetta and seared sca","useful":0,"cool":0},"LQlMnSkYcjk_SFs_ihKTyA":{"text":"This was a random recommendation given to me and I was a little worried about it being a t","useful":0,"cool":0},"TiiXO3XONZvTb-i7_119Pw":{"text":"Good food, but the service wasn't great, which was more surprising because we arrived betw","useful":0,"cool":0},"uB069YVUpmk3qUuSd1n9oA":{"text":"My evening at the Three Muses was honestly my favorite evening while visiting New Orleans.","useful":0,"cool":0},"hOF6jQmvC6k2DBl_yNYMyQ":{"text":"We ordered 5 entres which ended up taking too long so we ordered them to go. They gave us ","useful":0,"cool":0},"rWBQXE6IJ4_MMbsSHFPtlw":{"text":"Probably my favorite place to eat in New Orleans [so far...]. The boy & I came here becaus","useful":1,"cool":1},"FYnpA1nuP3wM7AlykcbT6g":{"text":"Three Muses is a great place to relax and enjoy delectable dishes. The atmosphere is super","useful":0,"cool":0},"5BHl4oBg5UJhPON8i4Xwcw":{"text":"Was going to see a friend at the art market and happened upon Three Muses. Live music was ","useful":0,"cool":0},"qHzBJL5Q_sRXt1DGSrMkAg":{"text":"Tapas and Jazz - am I in heaven?    It sure seemed it.  Went with a friend to continue our","useful":0,"cool":0},"3rrF_09gDqtT8MZ8tdv6OQ":{"text":"The place is very cozy and had a great vibe. Good music and delicious food. The only drawb","useful":0,"cool":0},"7vgm_qyEOPA9VcVVnUdqzQ":{"text":"This was our favorite stop on our four day trip to NOLA. The food was spectacular and wait","useful":0,"cool":0},"EIP2av4PNgtOgh9n5cO37w":{"text":"We recently spent a week in New Orleans and visited the Three Muses twice for dinner and m","useful":0,"cool":0},"wstb7ldtMl9fDHSozf4QWw":{"text":"Gumbo, Brussels sprouts and bacon wrap cheese dates and ice cream cookie soup was great. K","useful":0,"cool":0},"2mrEEW6yx5pVWgb1FGZvyQ":{"text":"Great food. Wonderful atmosphere. Definitely would visit again. Servers very helpful and f","useful":0,"cool":0},"DSvUPQsQ5dVbr8bIVEz3kA":{"text":"Excellent time spent , with my wife. Seating can be a bit of cumbersome process and orderi","useful":0,"cool":0},"dZOZ7EP_e5mpO5WPtsL0rA":{"text":"This place was exceptional. The food was amazing and they had the best cocktail in Nola th","useful":1,"cool":0},"ZxIYP0aGBC9twix4g0AVTg":{"text":"This is a great bar,  the bartenders and the elaborate cocktails were amazing,  however th","useful":2,"cool":0},"IHzLQJXjd5lMI6c6RHZimg":{"text":"Made a reservation here for a Saturday night for four, and had a great meal, plus saw some","useful":0,"cool":0},"jl2MKzrYCG8uT9NRolGPdQ":{"text":"Dined here on 6/11/17.  We made reservations for 3 at 8pm. We went specifically for Linnzi","useful":1,"cool":0},"chfPuSkfSFr5CAnk7Ix5IA":{"text":"Loved the food!!! The menu is tapas style and pretty much everything we ordered was delici","useful":3,"cool":0},"tvo0jsFDOpxB7lMHKGGx6g":{"text":"Third time to this small, intimate jazz bar/restaurant.  Never disappoints. Served as tapa","useful":1,"cool":0},"_PpE5t_kqySkdOtKEetrcg":{"text":"Came on a Friday night.  Great music. Korobuta pork belly was very good, lamb sliders were","useful":2,"cool":1},"ab-nE-MEf4CTosqhNrI4dA":{"text":"We were looking for a place to sit down and listening to live music. Three Muses has live ","useful":7,"cool":7},"AJcYD5SPYT89CKXSbgnU7Q":{"text":"Had a lovely dinner with shared small plates, whisky and cocktails, and live music. Friend","useful":1,"cool":0},"tNHG-j5e2yAU5uwYcg9QKw":{"text":"I love the ambiance of this place.\nGreat food and great music.\nWe tried the Mac and cheese","useful":9,"cool":10},"OnT8RuAt6x__8gboMSRj3A":{"text":"My friend & I stumbled on this place a few years ago. I'm torn between recommending it & t","useful":0,"cool":0},"PsjLmKvQThPMVVw9oqNm8Q":{"text":"The rangoons were amazing. The sauce was perfect it gave it a special touch. The chief spe","useful":0,"cool":0},"vbcTyVSgNo0A0z1Nkuos6A":{"text":"Folks, if you are looking for a restaurant that embodies all that N'awlins has to offer (a","useful":1,"cool":0},"YAOz861rPCrsXvRZW_yE3A":{"text":"So, this place has changed quite a bit since my first review in 2011. I thought my review ","useful":2,"cool":0},"N5aIp4EFx30x4PLfW18Ayg":{"text":"Everything comes together here.  Great music, great food, yummy drinks.  Do try the feta f","useful":1,"cool":0},"U1UaDmdLjrkeeEecJF45PA":{"text":"Three Muses felt more like a cool hangout spot than anything else. The Jazz band that was ","useful":3,"cool":3},"KAXSg9yw_b4WVvlz2mqCWQ":{"text":"Great food. Great music. Great service.  Went here two nights in a row after randomly find","useful":1,"cool":0},"VValDGzKl-dLYEDFhw6fEQ":{"text":"We had a very unfortunate time at this establishment tonight. The staff was extremely rude","useful":0,"cool":0},"qvSfiK5xgWTQwpuOwdpQjQ":{"text":"Service was very good. Even though the place was packed, our Server took time to explain e","useful":0,"cool":0},"gKfixESSIF9VaFqCcu-8lw":{"text":"Amazing drinks, the food was heaven and the music right on. Loved the steak cake, ravioli ","useful":0,"cool":0},"oa7DVv5iMzuqAp3AyWXfHg":{"text":"My reservation was for 9pm. The band just finished their set so it was complete silence go","useful":0,"cool":0},"CxL-6X8FYPwb70myWnexQg":{"text":"Mmm! This place was amazing. Band was divine!!! The food was scrumptious and top notch cra","useful":1,"cool":1},"sA6sDjv19kz969qu1hT8AA":{"text":"I don't even know the words I need to describe the food we had here. \nWe stopped in and gr","useful":2,"cool":1},"HYJCsPF0P2BKAy74hiWE_A":{"text":"Bummed. Before I left on my trip to NO, I researched the yelp reviews and made a list of m","useful":3,"cool":1},"uk4w33txctIDQT-QrUIelw":{"text":"We came here in a group of 8 for a bachelorette. The ambience was top-notch, with the love","useful":0,"cool":0},"fB-dPP-ldX0VFYCOOg_Z3A":{"text":"Visited Jan 29, 2019. We were looking forward to drinks and listening to good New Orleans ","useful":0,"cool":1},"uJXQrG6Wt5nvcLXxyUjSfg":{"text":"A first stop on  Saturday night New Orleans and it was tough too leave. Short wait for a t","useful":0,"cool":0},"iDztFvZfSy9yDDRMBS9XFg":{"text":"If you like bites, small portions of very fresh creations that satisfy (read Tapas), you w","useful":1,"cool":0},"_tH2SqlAAoM1KsrOgyPXbA":{"text":"It's a great place to enjoy the night.\nI had spaghetti something drink, pork belly and mac","useful":3,"cool":0},"XFDYC8LAkRpp-BgJgWvAMQ":{"text":"Three Muses Rest. - 536 Frenchmen St., New Orleans, LA 70116\n\nQ-tips say: GREAT PLACE! Nic","useful":0,"cool":0},"-T-POZdnv_D9CWTNT1aQ-A":{"text":"Always lies about their \"live wait times\" never right.  This shouldnt be a very hard thing","useful":0,"cool":0},"S7r7jcbJe2WEr-GPJ7RPHw":{"text":"Traveling to NOLA absolute MUST visit. Off the path from cliche bourbon and that nonsense ","useful":0,"cool":0},"5_KvBuexR44gbV-nIPzXQw":{"text":"Great little spot on Frenchmen Street! The dining tables require reservations but the bar ","useful":1,"cool":0},"IBlPYvpW_NyJj-lhkTHTDg":{"text":"A great little tapas place/bar/music venue. Come, have a drink, eat a bit, sit and watch s","useful":1,"cool":1},"fTxQBQLaO07JN5bTAUZSOw":{"text":"Amazing food. Amazing service. And amazing jazz music. Couldn't have asked for a better wa","useful":0,"cool":0},"UKa7gafKeVwkYCiBIvummQ":{"text":"Had a reservation for 4 at 6:15pm on Saturday, the night Chewbacchus rolled down Frenchmen","useful":5,"cool":1},"puYrZdtM7SA4rbtKtYpemw":{"text":"Ended up being third wheel with a couple and we split three of the dishes which was perfec","useful":0,"cool":0},"N8n7O99EyXnElUICoe1s1A":{"text":"This place is awesome! My boyfriend and I recently had a very short stint in NOLA. We spen","useful":1,"cool":0},"8k3YGruCT_e0BWH9lTmrYw":{"text":"I love the Three Muses, the music, the food, the drinks.  It's all great.  But on my recen","useful":0,"cool":0},"hI3aTIEvHx8Vc71vR5MMhQ":{"text":"Oh yes! This place is great. The food here is so creative, the atmosphere is awesome, and ","useful":1,"cool":0},"hwd2PKcqrVHPMI9xRDEYMw":{"text":"We came in late (9:30) and hungry and we ordered 5 items. Food was not good at all. Clearl","useful":0,"cool":0},"RzmZbjC8hLsHxJMM3nhtMA":{"text":"Came here my last night in NOLA. FRENCHMEN ST.\n\nSo I was under the impression that since N","useful":0,"cool":0},"N2aUgb86fmapSIB1FDtXOA":{"text":"Enjoyed our visit here! The food was amazing, I would definitely recommend the tempura shr","useful":1,"cool":0},"-x7FPPHEgSwV53-1Dt5Ldg":{"text":"Three Muses was amazing! I went to dinner here with several friends and we decided to each","useful":2,"cool":0},"DX8VRCGPR8ZVJhYF2pkQ1w":{"text":"Music was great, very much over priced","useful":0,"cool":0},"5eyDFxEnQljFOmlIh3FcqQ":{"text":"Very cool little spot. Waited 30 min for a table but it was definitely worth the wait. The","useful":0,"cool":0},"OzIXq6P5wc2cMXD4otLPDA":{"text":"Amazing food!  Amazing music!  A fantastic experience on a once in a lifetime trip to New ","useful":0,"cool":0},"AlX_xTaymwO6yYB7TSMvyQ":{"text":"The food here was delicious, albeit overpriced for how much you get. We knew going in that","useful":2,"cool":1},"ZaFToCMNc9XJadtTlAaSAg":{"text":"My friend made reservations to dine here during our trip to New Orleans and was most excit","useful":0,"cool":0},"Os_CA93NBcECzmZ5gYAKcg":{"text":"Really professional and respectful of COVID protocols. Great variety of music by local mus","useful":1,"cool":0},"XE77YfT1sAY3zrpv45h-4w":{"text":"A cozy restaurant and bar with great cocktails and tasty small plates! We arrived before t","useful":0,"cool":0},"TlXigDy9y6js4JLGFCEifw":{"text":"First let me state that I really liked this place and would recommend it to anyone. The mu","useful":0,"cool":0},"MSXhT-3rWt_VTK0MH6Eapw":{"text":"This place is always crowded.  My wife and i walked in around 930pm on a Sunday and was lu","useful":0,"cool":0},"R0tBQshKY1Wsk1teucHweQ":{"text":"Unexpected food Choices available and the food  is absolutely Amazing!! Not to mention the","useful":0,"cool":0},"7k21sWC9tg-D5tTgQMfJBA":{"text":"After a hectic few days in the French Quarter for Halloween / Samhain, the last night of o","useful":1,"cool":0},"YKCUQYSUsfeLIQlnoa0SKA":{"text":"Before you go in, you have to commit to ordering something.  No free jazz listening for an","useful":1,"cool":2},"yVZSEL7zl5KOD0YMG4majg":{"text":"Stumbled upon this place last night while we were making our way through Frenchmen Street ","useful":1,"cool":0},"mcMk7F9lUMjPvwGkQxHa0w":{"text":"We came here for two nights since the first night we didn't make a reservation and only st","useful":0,"cool":0},"zZndzGz9xHNuKIMStOeJ4A":{"text":"Three Muses = trifecta of booze, music and food. Add me to your long list of fans, Three M","useful":13,"cool":11},"P5H2Adee8OI_ixZE1TKeag":{"text":"Glad we stopped in. The jazz on Frenchmen street is known for bringing in a less crazed cr","useful":3,"cool":1},"LbrK1CoOPH6qs9b-OepNNg":{"text":"Good food, friendly service. A good place to sit down and enjoy some live music.\n\nDefinite","useful":2,"cool":0},"HqnUq5yaHGacqsRhn9cLQQ":{"text":"Whilst exploring Frenchmen St. in New Orleans, I came across this restaurant and just like","useful":5,"cool":3},"uDG1MsHxVvLqTUyFefsV4w":{"text":"This is my favorite bar in the city. My favorite spot for jazz, and has a cool 30s speakea","useful":0,"cool":0},"VdNou_6Tf-I8qZceo3IgdQ":{"text":"I rarely leave a poor review and never have left a one star rating, but the service here w","useful":2,"cool":0},"wBz9_sTlteUkvIqJ4J7Jqw":{"text":"This was so good!  We ate only appetizers and the shrimp tempura was amazing!  Will defini","useful":0,"cool":0},"gbrPWFVPzbzyWWfNtt9JEg":{"text":"This place is a triple threat: they make the best craft cocktails in town, the food is gre","useful":2,"cool":4},"9HXbi1wl2YGYEh_D16WjCA":{"text":"Nice place.  I only came because the place was featured on G. Garvin's Road Trip: Best of ","useful":1,"cool":1},"ZDG_1z-n2h4K7khas3Ijtw":{"text":"Calling all you gastropub addicts- stellar drinks, live music, and incredi-mazing internat","useful":17,"cool":16},"rWvlVhI2-Jc3T7gis8tebA":{"text":"One of my favorites - I can't figure out how you can order 5-6 different tapas size dishes","useful":1,"cool":0},"VK82JDG3RMCNlpQzqu5LhQ":{"text":"Romantic and intimate? No. More like drab and stuffy. Why there is ever a wait to get into","useful":0,"cool":0},"EYw9c10TXxLlwU0nZkvUDg":{"text":"Ok forgive my terrible photo. But this place is a must visit. I'm traveling solo for work ","useful":0,"cool":0},"B0y-GvSpdKMyqe5x0J-jLg":{"text":"I selected this restaurant specifically for the live music to accompany dinner in a place ","useful":1,"cool":1},"pVZGpeceELC8D783O_TG9w":{"text":"I've been to this restaurant a total of three times, one time for each visit to NOLA. \n\nTh","useful":0,"cool":1},"wJD_MF1XA9C6N7r2rtj4dg":{"text":"We were told there was a waiting list and that we had to call in before 6 p.m. if we wante","useful":0,"cool":0},"xg3NJ-S1gfYtT-C_v4JmnA":{"text":"I used to come here during every visit to new Orleans, this time terrible terrible experie","useful":0,"cool":0},"4MtFuhpqGZ7U5xD8IoZtew":{"text":"A gem along Frenchmen Street! Knowledgeable waitstaff, helpful hostess and delicious food.","useful":0,"cool":0},"WOyC4cMgjGVQuwPc8Ijl0Q":{"text":"Small, intimate restaurant in the heart of Frenchman Street. Food quality was great, but s","useful":0,"cool":0},"m665b4kS0eREqPefdS4Dyg":{"text":"Disappointing. Picked this place so we could have dinner and music. Nice space and great s","useful":0,"cool":0},"K80MLy4OsiYUuoJgDrjb9Q":{"text":"Loved it! Had the lamb sliders, feta fries & a lemon drop martini. All wonderful!! A few o","useful":0,"cool":0},"KSZ3cxo4PNA9ITizuZ_uxA":{"text":"The food was delicious, but I seriously question their cleanliness and hygiene at Three Mu","useful":0,"cool":0},"VW_viaNu1K72MWoupVgSMA":{"text":"You put your name in with the host that guards the doors. You are not allowed to go in unt","useful":3,"cool":0},"n_ZXdq-hhfHqF7TgVvRxhQ":{"text":"The food and atmosphere here are great but the service is substandard for New Orleans.","useful":0,"cool":0},"79DbKuGLO4U2vghYDkE5xQ":{"text":"Great food and great music. Small plates and a very interesting menu. Had stuffed datrs, f","useful":1,"cool":1},"Fxc879aH0e76r86fidtkMA":{"text":"Love this place! It's warm and inviting and the live music is always great! The brussel sp","useful":0,"cool":0},"Lck6P6thKiu9grRBmui9fA":{"text":"Until recently, Three Muses was a welcoming place with a fabulous staff, a wonderful happy","useful":1,"cool":0},"wsgxDYUWovJ9kpgR4iQtww":{"text":"This was a great venue. The music was and service was good.  The menu was a little small b","useful":0,"cool":0},"iok_vNbJNRbym47ZNqNefg":{"text":"This place was a last minute decision when the other one we were planning to go had alread","useful":0,"cool":0},"fL3FXjK4ojquPx7yo9sl9A":{"text":"Great Music, Great Food and Great Drinks.  What more can anyone wish for.  \nFriday nights ","useful":0,"cool":1},"meBW00XEjUuS2HE9KQ6vYQ":{"text":"This place has good jazz but the owner was a bit of a dick. We had put our name in and tol","useful":1,"cool":0},"IZH2jG2GyuHRgv4rLuwfIg":{"text":"this place was so great! my party of four went around 7pm on a wednesday. the restaurant w","useful":0,"cool":0},"OaLJUwbFMiiwkn27gTBQ6g":{"text":"If you should feel the need to lose yourself in an evening of authentic Jazz, might I reco","useful":0,"cool":0},"-WtX8ugdhjFSPL4LsnEHfA":{"text":"Love this! Fun and funky, live music-- piano and sax to take us through our evening. The t","useful":1,"cool":1},"2zoIqzjeu64a9mhzVLpgVA":{"text":"Smallest plates I've seen in my life for $$$. Food flavors were great though. Very packed ","useful":1,"cool":0},"jIRghx1AJy-nG62sEz-FQw":{"text":"Great neighborhood place away from tourist traps. Menu is very eclectic. I was there with ","useful":1,"cool":0},"jHPsSuvIaPau2EMXjcqN0Q":{"text":"This place was so great. We arrived early and got seated with no wait. Drinks were served ","useful":3,"cool":2},"RxJ1PdWfAwyfnIk67b8QTQ":{"text":"Some of the best musicians + incredibly delicious small plates + amazing cocktails, all in","useful":0,"cool":0},"S8Q0nFH0c-Tyy5bLj6mUPw":{"text":"I want to give a higher rating but because of the way we were basically kicked out before ","useful":3,"cool":0},"sr8u2h-zEVJuUklcURTVtw":{"text":"Live jazz music was great! Drinks were fantastic as well. Very enjoyable evening NOLA","useful":0,"cool":0},"ECEbNkfl4Tvdg8Tr0xx4aA":{"text":"The lamb sliders are decent, nothing special considering this is one of the most famous st","useful":0,"cool":0},"XyqCCe8AplXsX9_gp0TnQg":{"text":"As I walked from the French Quarter to try this new trendy restaurant, my first encounter ","useful":5,"cool":0},"jcul1gx8kQiYGiXBfIaBkQ":{"text":"My friends and I went to Three Muses as our fancy outing during one of our visits. There w","useful":0,"cool":0},"7yozHGNyE5RTi59E9zEh7A":{"text":"I've really liked the music every time I've been here and they've all been really differen","useful":1,"cool":0},"ObCvGiywBjA_bgp9jwxChw":{"text":"Three Muses has such great reviews, which is why I chose to visit on date night. First of ","useful":0,"cool":0},"Duc3_aIMrt14nfcNr7neug":{"text":"We went for the live music (it was great) and stayed for the food (delicious).   Wonderful","useful":1,"cool":1},"poS3obdyFCDFyuiZcMj5ag":{"text":"I decided to give this place a try after checking out the menu at pretty much every place ","useful":0,"cool":0},"CEuSAkKoPG9UY3hVZ-LHqQ":{"text":"Great little restaurant. We've been twice now. The chef's choice cheese tray was a lot of ","useful":0,"cool":0},"91qqNrCOP7TGuEBu6pVUUg":{"text":"Yummy and creative food! The roasted calliflour salad was so good I am going to try to mak","useful":0,"cool":0},"u3Cf_pOrdqL9-GBEUdMIIA":{"text":"Came here on our last day in NOLA. We stayed closer to the business district and this esta","useful":2,"cool":1},"aompPDYE6oFkO6ylm0dnTg":{"text":"Was taken here by surprise for a belated Bday present.  I was thrilled!  Come to find out ","useful":1,"cool":1},"vu1CpLIBLlkllZqzB_08EQ":{"text":"From the door girl to the bar misses; the service was horrible.   I felt like I was in a f","useful":0,"cool":0},"n1yCV1Kej5v5aTsJOI2VXA":{"text":"Loved this place! So glad we came here! Right in the middle of everything, live band- whic","useful":0,"cool":0},"FRtw_Fa-7t_fssin2VJZ3g":{"text":"Decent enough space but the act we caught really was not what I was looking for (Washboard","useful":1,"cool":1},"en0Q3O3hb4pVMEZcwibpFw":{"text":"I need to dedicate a whole paragraph to the tastiness of the gumbo. I've had gumbo before ","useful":3,"cool":0},"eX38mhgqXEoD6_yrdXPsTQ":{"text":"1. get the lamb slider\n2. get the mac and cheese\n\nenjoy because its the best you can get o","useful":1,"cool":0},"76clI5JQLqw0JmS8n0QzoA":{"text":"The music deserves 5 stars\n\nThe service is 1 star, I walked in and had to sit at the bar b","useful":0,"cool":0},"PnW-nF4If_mx2HWjf_ZBeA":{"text":"Super cute and fun live music venue. The two nights we went had awesome bands. No cover, 1","useful":1,"cool":0},"7FKeyllt8y87GKkUVtQiwQ":{"text":"Came here to listen to some live music and have a drink or two. Both did not disappoint. W","useful":3,"cool":1},"8gYmkd7oyrSPgLpWzS_gjQ":{"text":"Solid, well-prepared small plates, good wine list and beers, and depending on the night so","useful":0,"cool":0},"ylluj_4U-Df3AXRKOat6nQ":{"text":"If your looking for a good jazz music  this is the place to go. Haven't had a chance to tr","useful":3,"cool":0},"hXbDbGFp_NkCQI5Um2Za1w":{"text":"My boyfriend and I came from out of town and read great things about Three Muses so decide","useful":1,"cool":1},"GV94JgCUNBMwWh8061rhkw":{"text":"My friends and I visited New Orleans during Thanksgiving weekend and decided to visit this","useful":1,"cool":0},"zOOS9qA6jG-JRVkMWDbeZQ":{"text":"You'd almost think this was a roaring '20s speakeasy if not for the big picture window. A ","useful":3,"cool":2},"j281xeWtSZOlm16I1CYP7g":{"text":"I'd LOVE to give a review on the food and/or drinks at this restaurant, however...after wa","useful":2,"cool":0},"dKyjwOEWuTXH9l6ooUU6Dg":{"text":"Stopped by Three Muses last night and had probably the best time I've ever had on Frenchme","useful":12,"cool":1},"Q78V4FcJzuLzMBYVzg8P1A":{"text":"We popped in to this cool little spot to catch some local Jazz. Looking to see John or Sop","useful":2,"cool":4},"CII8zjJ7122qhzzArCTGxQ":{"text":"Our front desk recommended Frenchmen St for great music so here we are! Our top choice was","useful":3,"cool":2},"MBuRQh4Hl0oi4jwY1tfdMg":{"text":"Live music and tapas style menu perfect to enjoy New Orleans life style ! Really nice wait","useful":0,"cool":0},"gPSXprVpMzFLr5EvYU7DsA":{"text":"What more can I say, other than, GREAT CUSTOMER SERVICE by the bald  guy with the big bear","useful":0,"cool":0},"ZW3l0as1L9CnR2jhXEWApA":{"text":"Excellent experience. Went on a Wed night. Great guitar based jazz trio playing. Pimm's Cu","useful":0,"cool":0},"_2vbr_zVehTtu8N8y3trkw":{"text":"If you are in a hurry and think u gonna just drop by and b seated then this isn't for you.","useful":0,"cool":0},"3j0-UAA_JoO5AsVMruzkiw":{"text":"Great vibe and live music. A lot less crazy and loud than some of the other live music pla","useful":0,"cool":0},"2HneYtqbENs4_iTtWpgwNg":{"text":"We strolled in here at 7:30 pm on Saturday of Halloween weekend, found four bar seats, ate","useful":0,"cool":0},"bX0gIddpndzy9VCAsNFiog":{"text":"The duck and shrimp tempura were absolutely amazing!!!! We didn't have a reservation, but ","useful":0,"cool":0},"9j5815qEdnOzueNTdTeVhA":{"text":"Quaint little spot on Frenchmen Street serving up tasty and creative appetizers, nothing f","useful":0,"cool":0},"JXx-iKepVgiDbjsoox8W9g":{"text":"A delightful jazz club in Frenchmen street. There's a one drink minimum during shows, whic","useful":2,"cool":2},"JPXIHXK2sxEDjHJBiJnrpQ":{"text":"Hard to beat the variety and exceptional quality of the food paired with great music at Th","useful":0,"cool":1},"yzedMZ4TOrs92NiSgWK7Ug":{"text":"Three Muses was wonderful. But just under 5 stars.\n\nFood was fantastic, all was a reasonab","useful":1,"cool":1},"qQSmD5YBMvKtE4WnXZkspw":{"text":"What a great experience! We chose to sit at the bar, and were not disappointed. The barten","useful":2,"cool":3},"U_Gmk2yfPLpilktInV_N-A":{"text":"We went to Three Muses for dinner Sunday night on the last day of Jazz Fest. The seating w","useful":0,"cool":0},"clV03W-DJUY8WrQ1BXJGOQ":{"text":"This place is absolutely one of my favorite to visit every time we come to New Orleans. Th","useful":0,"cool":0},"rMJD3R0kDqTJHLST26XVhg":{"text":"We enjoyed the music.  The food was overpriced, of average quality, and tiny portions.  I ","useful":0,"cool":0},"VF2M_1CzJwyznYJBe8RrYA":{"text":"I stopped in here on the recommendation of locals and was not disappointed. The music was ","useful":0,"cool":0},"VzVYVNLFKcnmUmgy8LvLbg":{"text":"Fish Tacos are the bomb. Make a reservation.... We walked up on a Monday and had to eat at","useful":0,"cool":0},"JRr1q9Uhh3Tui6P1XOu2zg":{"text":"Really good food and calm environment while you enjoy some live music. A must visit while ","useful":0,"cool":0},"OneR4nup2nL5aWV436o9Sw":{"text":"Had a great evening  here came as little early sat at bar and listened to solo piano playe","useful":0,"cool":0},"CzvKBcfu4mwMnOatVRyXeA":{"text":"Overall very disappointing. The pictures listed on yelp do not reflect what they serve. Ve","useful":1,"cool":0},"wOolmPtDjXgOtfV7U638Yw":{"text":"My friends and I came to Three Muses after being recommended by our new friend, Jeff! He w","useful":1,"cool":0},"fqEJScoUfc6ZxSLM6Xt5Yw":{"text":"Great food, terrific traditional New Orleans Jazz.  The night's special was Spaetzle- OUTS","useful":0,"cool":0},"QGkrHjye_jhnBqqAIsJPNQ":{"text":"This was probably the best food my friends & I ate in New Orleans. The only reason I didn'","useful":0,"cool":0},"CMdrQXy94TG1zMtSV1JinA":{"text":"Music and food were great. Our reservation was \"timed\" at 8:00 we were told we had to hurr","useful":0,"cool":0},"FFu6OwWWgGUWVrIKR5bzPg":{"text":"This is a very fun and delicious place.  I love Frenchmen St and this, like others here, h","useful":0,"cool":0},"LVZe1uh8rLnhaesLzYBtkw":{"text":"I'm sure I would have loved this place if the hostess hadn't been so rude that I decided I","useful":0,"cool":0},"8G7b64-1e1Ol2eJhYKJ20A":{"text":"We went here for lunch and had a great experience. The restaurant was really fun. Ambience","useful":1,"cool":0},"XI6augXjAJQIZGncTGlTlQ":{"text":"This my favorite place to go on Frenchmen St, possibly in the whole Quarter. I love to go ","useful":0,"cool":0},"298XUtIsbWSV6Xhi9Tf8SQ":{"text":"The customer service was definitely lacking.  We walked in, found a table and instead of b","useful":0,"cool":0},"zxoNP3SzdQSyHaz25uH81g":{"text":"Simply put the food, atmosphere, and music is New Orleans at its best. I thought the pork ","useful":0,"cool":0},"_OQGmA0AQCOst_KQ91Sxsg":{"text":"Great food and fun entertainment. A must while in New Orleans. The tapas plates are genero","useful":1,"cool":0},"2JZlDvWWJJcIPphDnJ-s8g":{"text":"We went to Three Muses at the recommendation of a friend from NOLA and I'm glad we did. It","useful":2,"cool":0},"rVRdgPEE8vwld5LP4zbA4Q":{"text":"Awesome place to eat at on Frenchman St. Would recommend making a reservation ahead of tim","useful":0,"cool":0},"kxqYNigPRbSezejtnMjDag":{"text":"Hands down, Three Muses provided the best dining experience during my stay in NOLA. Travel","useful":3,"cool":1},"aO8mOvh6Pu9cgcOIGFZymQ":{"text":"This was the only eating experience I had in NOLA that didn't blow me away.  \n\nHow can you","useful":4,"cool":4},"UVbo1r2R3VDmm39j8NqzXw":{"text":"Great, authentic New Orleans jazz spot.  Wonderful music, creative drinks and tasty food. ","useful":0,"cool":0},"1vyuAek8g4vl5eUoDeScDQ":{"text":"More like 3.5 stars. There were several gluten free options and all the food was delicious","useful":1,"cool":0},"A4ywJjxui7a83rO8FAHtLQ":{"text":"Nice place, very good food and delicate, but I suggest you eat something consistent prior ","useful":0,"cool":0},"1Q_JKj6v96kSc3sBHoynNA":{"text":"Everything on the menu, or at least everything we tried, was delicious. And cheap! Environ","useful":0,"cool":0},"F88t97sSOoL86gstvV373g":{"text":"We visited Three Muses for an early dinner and to listen to some jazz when we visited New ","useful":5,"cool":3},"KCzFo460CV3fOxRrRy7CQA":{"text":"Yikes! What happened to this gem? The hostess was horrible at seating people and mainly ju","useful":2,"cool":0},"gFpfXAix6ymjGzIqxNTqUA":{"text":"After a light dinner at Buffa's, a friend and I decided to grab a drink and check out some","useful":2,"cool":2},"ltfA3rNpUxMLU7ULxU77Zw":{"text":"This spot was my first introduction to Nola and Frenchmen street. I loved every minute of ","useful":5,"cool":3},"bDiZQ2kGOwDEsu3qmRt9cg":{"text":"Gonna try to give you the biggest things you need to know first:\n1. This is not a dinner r","useful":3,"cool":2},"rK-8123qUSWZ2uNUxZ3gww":{"text":"5 stars all the way, This is the type of restaurant/ lounge that makes you rethink all you","useful":2,"cool":3},"tg5PY8S91WcteQsCiBZwpA":{"text":"Tom McDermott as house entertainment, playing three feet from our table?  Here, Three Muse","useful":1,"cool":1},"dJ58pZ9pagCWQnl5bjdQ8w":{"text":"Damn, how many 5 star reviews can I write for Frenchman St?  At least one more :)\n\nThe pla","useful":1,"cool":0},"FjOjhcMCq2D3-I-FS3CHxA":{"text":"This place has excellent and inventive cocktails, incredible food, and a fun atmosphere wi","useful":1,"cool":1},"B1VmsSYcuUl13s23nYVQgg":{"text":"Pros:\n-Awesome friendly female bartender. unpretentious and made fantastic cocktails\n-Tast","useful":2,"cool":1},"Qln6F2gSUzis0SP_mIs3xw":{"text":"Very cool joint to listen to the best live Dixie jazz on Frenchman's . Large space where y","useful":0,"cool":0},"dSaUSEZy1CTNXTkc_bjUcQ":{"text":"Our experience at three muses may be one of the best experiences I've ever had. \n\nThe seat","useful":1,"cool":0},"tlKJx5gAPv7_76SbwaElxA":{"text":"Three of us enjoyed sharing a variety of plates. \nfalafel mozzarella, tempura shrimp, blue","useful":1,"cool":0},"HuXlpmqeqPH2sj1NhS99AQ":{"text":"The best night of our trip! This place was so great! The staff and the band playing was pe","useful":1,"cool":1},"j_VWmjt65cU2Fz-0T2SA3w":{"text":"If you're in the mood for small plates, this is a nice place to go on Frenchman.  The Whis","useful":1,"cool":0},"xSCIrwxPnzyuG6K0ChilXw":{"text":"This Place Is Great I always Bring My Family When They Visit. It's a Bit On The Pricey Sid","useful":0,"cool":0},"t3exZRJNzOimt2KaQaT8qQ":{"text":"you don't go there for the drinks, nor for the food. You go for the fun music and the snar","useful":0,"cool":0},"Wu4YSLMEa_ppwZFl6FRlKA":{"text":"I'm annoyed that we wasted our last night in NOLA dinning here.  I carefully read through ","useful":4,"cool":0},"KvFRBjnRzry5Xo90EmkfFw":{"text":"Three Muses, you are amazing.\nFrom your Fried Pickles with that bangin' homemade ranch to ","useful":5,"cool":4},"0TyIMzXS3liHumfofdK3eA":{"text":"Delicious food, the yaka main was an interesting choice as it fused Korean with American f","useful":0,"cool":0},"uLu_h44k_FceiRJqqS8-CQ":{"text":"Made reservations because I heard this was a great spot to have dinner and catch some live","useful":1,"cool":1},"4wRPwEST2wOVHcTsxXWXmA":{"text":"The food was very good and the band was fun, but the service was just okay and I left spen","useful":1,"cool":0},"HI410jCnEnx_cxBzuQLV-Q":{"text":"The drinks were great but the food was ok. Wish there were better options for vegetarian i","useful":0,"cool":0},"02bDB285evnuW_V_014wQA":{"text":"We went here for the first reservation of the night on a Wednesday at 4pm, which is when t","useful":1,"cool":1},"HagHlnd9dQMx5GsYqa_qUQ":{"text":"Awesome place to go and be serenaded while you're eating. The food was good but the portio","useful":2,"cool":1},"WtMUCwNfOp5_wVApGp7Kuw":{"text":"Great service, great live music - great food! Only thing I would opt out of next time is t","useful":2,"cool":1},"n50Mw0UvFbgzzNwLlbw6fw":{"text":"Really liked the atmosphere here: small space with live music and a decent menu. Food was ","useful":2,"cool":2},"tEiShpPbA0bag6kmvOu6pA":{"text":"I only stopped in for a drink during my time in New Orleans but this place really stuck ou","useful":3,"cool":2},"Z5P0N_BKDrwD5HPw_ZeGCQ":{"text":"This was such a cool little music venue. We came here on a Sunday night, not knowing too m","useful":4,"cool":3},"8-EZOCw_nny2soNUSoLzvA":{"text":"MELPOMENE\nEver have your cheery mood turn foul? That happened to me at 3 Muses. My experie","useful":6,"cool":2},"LzaqHHwIdNNibypNnNgLIQ":{"text":"Three Muses always has great food and music. The server we had this time was super efficie","useful":0,"cool":0},"NgW6bS7YuLjKlXO1yKfDsw":{"text":"My first meal in New Orleans was here at Three Muses. The space is appropriate for a music","useful":2,"cool":1},"rs8y2G9p_99pALcqztzPAg":{"text":"We confirmed that yelp was right!  This is one of the best restaurants in New Orleans. The","useful":3,"cool":2},"J8pMzWpRH0hE3Tz7mlsqSw":{"text":"Came here with a group of 6 to celebrate my dad's birthday. We had reservations for 7:00pm","useful":1,"cool":0},"Aa3avys0gyIWXNKZlbaDEA":{"text":"Delicious food, great tunes and excellent service!! The Burger was absolutely to die for!!","useful":0,"cool":0},"VmpPZEjtBiVpR4WjEFLrHg":{"text":"To ring in 2011 the right way, the girlfriend & I spent the week around New Year's Eve in ","useful":3,"cool":2},"6tZ4qgbFHvirSl2UFVjxpg":{"text":"Went in and had to wait a bit for a table cuz I had no reservation, very helpful staff Was","useful":0,"cool":0},"uj69pG5e6qz4EKKMm8-rgQ":{"text":"Located far away from the hype, this is a FUN place to drink and enjoy live music with fri","useful":0,"cool":0},"N22RLntqYG1sZ51FlcTRkA":{"text":"I really wanted to like this place. The food was decent and the music was great. \n\nThe ser","useful":5,"cool":2},"BVfoA221vtfbUavFFQB3Cg":{"text":"I went at happy hour on a Wednesday.\n\nFood: 4 stars\nService: 2 stars\n\nA lady bartender hel","useful":3,"cool":0},"zyPWUUkSnb651CMZrB1aiA":{"text":"Did I mention that I HATE the new \"GASTROPUB\" concept going on in New Orleans recently.  J","useful":3,"cool":1},"yiJpvmaGSEE5APeQPQZwiw":{"text":"In a city of great music, great food and great drinking, this place shines on all three.  ","useful":0,"cool":0},"b2llkrWPVq0MxnTOb9ji6g":{"text":"Small, nice, \"quiet\" piano bar on Frenchman's St. You can have a conversation here without","useful":0,"cool":0},"GYstMYx5tv9PwKevOSOvGg":{"text":"Friendly and intimate. Our group of 3 had no reservation so the staff put us at the bar. B","useful":0,"cool":0},"0LmjD8h8TV8LYSLE_sI3CQ":{"text":"I felt unwelcomed from the moment I stepped in. I didn't know there was a protocol and tha","useful":7,"cool":0},"8ZODgOQ6GA-9_0IBfkF4Pg":{"text":"Made reservations for a family of 5 and boy am I glad I did.  This is a tiny gem and by ti","useful":2,"cool":2},"9QBJrGO7yeeGSEsKQuZVcQ":{"text":"When I was planning our trip to Nola I had asked someone I knew for recommendations ( he l","useful":1,"cool":1},"p8_bqIkv2PmzmofmDwhuPQ":{"text":"To fully understand my review of the three muses I have to start earlier that week. My gir","useful":0,"cool":0},"WFPzVd7DxF5pjdhL6-KGIg":{"text":"Absolutely fantastic food!  We weren't aware that it was a tapas (small portion) kind of r","useful":0,"cool":0},"0vKYA04h9N6sYUFz2RtzTQ":{"text":"A great place for music and food! I really enjoyed it. The prices I felt weren't that bad ","useful":0,"cool":0},"S6eGAQLt25X82BE8cxMPeg":{"text":"Fantastic food, great service, the bartender knows her drinks and the Jazz music set the t","useful":0,"cool":0},"Oc53NQULF52eWPOIxRnU5w":{"text":"We spent three nights checking out the clubs on Frenchmen, and Three Muses was the best, b","useful":0,"cool":0},"RoYdpGkVBqZVY0jigWMk4A":{"text":"Don't have your hostess also working as your bus person. This makes for: \n1) an angry and ","useful":2,"cool":0},"HgafHmBuE1CgTaet7a6RYQ":{"text":"I loved the vibe of this place, but the food fell short. On the plus side, the music was r","useful":0,"cool":0},"a5aa1Agpvb6ytg1470lLWg":{"text":"Down in New Orleans on a guys trip. One of my associates has an acquaintance from work who","useful":0,"cool":0},"qt7vDqhL2ckxr27V5ye0Kw":{"text":"I love Three Muses. It's not for everyone, as there are some drawbacks (see below). But th","useful":7,"cool":2},"Jg-tT0e7uAiLoQiNbXa3Jw":{"text":"Did someone tell you that this was different then bourbon street? Not anymore. Joshua and ","useful":0,"cool":0},"Ojg5XJrYwDGk2aNFU0FAmg":{"text":"My new favorite hangout spot on Frenchmen!!!! Live Jazz. Check! Delicious Tapas. Check! Fu","useful":4,"cool":2},"YGk5bnzZLX5QstQy6JoxhA":{"text":"Oh Muses... you did not amuse me. I was totally enamored with you when I made entry to be ","useful":0,"cool":0},"n_RWD2mbPo_gEcuI1o0KdA":{"text":"Where to begin.. the food was amazing! Service was great, and the live music was superb! D","useful":0,"cool":0},"f8wrEgjXzsMs-xEt75Eq_g":{"text":"Great atmosphere, yummy drinks, and really good music. I went here with my boss during a c","useful":0,"cool":0},"IjOqeF0OMhSg46f0G0YPzg":{"text":"This place is super cool. Exactly what I had imagined when I thought of visiting a hole in","useful":0,"cool":0},"Moon9zjDzXGjZi4jhgTFkg":{"text":"Three Muses is a small little tapas spot on Frenchmen that I highly recommend. The food is","useful":2,"cool":1},"Z9WHnNt1lOFqj4MHVKowQg":{"text":"Out of all the places I dined at in New Orleans, Three Muses left the strongest impression","useful":8,"cool":7}}