{"7VEYPNtx6L9jVsCpWr3Ang":{"text":"Great tacos, slow service, drinks are on the expensive side. Nice patio overlooking St. Ch","useful":2,"cool":0},"268mzPIpTDvwFPxuXUAwag":{"text":"If you're in New Orleans but you wish you were in Slidell, or Kansas, this might be an ok ","useful":0,"cool":0},"SaFiLzZ92b0Zv80xJfkzag":{"text":"Skip the expensive restaurants and enjoy reasonably priced good food and awesome.service. ","useful":1,"cool":0},"gPuP3LLoE_vYLFH397FSHQ":{"text":"I come here almost every tuesday. And i have to say it one of my favorite tack tuesday spo","useful":1,"cool":0},"B3VRpwSkjpnxM_FAI1b_8A":{"text":"Was greeted immediately and received drinks promptly, but then waited and waited and waite","useful":0,"cool":1},"ZeVCQbDAOohOm-VBYMm-LQ":{"text":"We only came in for beers while we waited for a table at another restaurant. The service w","useful":0,"cool":0},"KDrpCWSHe4oYIHU87md20w":{"text":"Upon arrival I was \"greeted\" by the hostess whom rudely informed me that the wait time was","useful":0,"cool":0},"-WHLcjG2f1FrlSQueWmVow":{"text":"Went here as it is a few blocks from our place.  The decor is beautiful and the service wa","useful":1,"cool":0},"uJu2e7LII2PT070KtsAh1A":{"text":"Okay, I go here practically every Tuesday for Taco Tuesday. Me and the girls are regulars.","useful":0,"cool":0},"UDBA8LwJykkWGb7EJn7T6Q":{"text":"Don't waste your time or money.  As someone who lives in the neighborhood I  am disappoint","useful":1,"cool":0},"NeK7rlc_j5WavDwNDIENVQ":{"text":"Deee-lish street tacos!!! Great Salsa, definitely going back next time I'm in New Orleans.","useful":1,"cool":0},"1SEeHrifhV0vPx4EihYUBg":{"text":"So we were riding the trolley and saw \"tacos\" and jumped off. The place is nice, decorated","useful":0,"cool":0},"f3Ogt0uv1TJGUnujrkO98w":{"text":"This was literally my first time at this establishment & my experience was terrible.\n\nMy g","useful":1,"cool":0},"Aah8CU2_4-vzMXgemZbgwg":{"text":"Great service. No wait. Amazing food. We got the nachos and the chicken on top was super f","useful":0,"cool":0},"PtcosRgOLXFceSkNLRPJ0Q":{"text":"Service is good but ownership is not great. Chile relleno was okay but chewy. Margaritas w","useful":0,"cool":0},"saFLwVv9d3B8yDP-o6NgOw":{"text":"I almost had a mediocre experience here once but the food was so-so. My nachos were  burnt","useful":0,"cool":0},"C_DI___hjVO4tHcj6nxZhg":{"text":"If you are ever in New Orleans, Tacos and Beer is a definite stop you should make.  We had","useful":0,"cool":0},"BsSB2mbVWfRzD7tZ2jhknA":{"text":"Ive beben there many times always had a great experience and kept bringing all my friends ","useful":0,"cool":0},"Pb9mHSNG0wKiP2oi01oQQA":{"text":"Highly recommend the fish taco (fried) with corn tortilla. And the Big Ass burrito, wet. I","useful":1,"cool":0},"p1CBMSF50rV8h8m6w0skyA":{"text":"Great taco choices and a good portion of protein in each one.  My margarita was also quite","useful":1,"cool":0},"QXqSZCjJU-OT4ymV7VmBgQ":{"text":"My first visit was over this past weekend. I usually avoid places like this because of the","useful":0,"cool":0},"ypxuvOVRt0Z1d0stLSyWvw":{"text":"A Restaurant experience is always great when you have good service, cool place to hang and","useful":2,"cool":0},"BkRIZXcg9XCjU-spf27L1g":{"text":"The food is okay but we will never go back. We went there on a Saturday night around 10 o'","useful":1,"cool":0},"2-Erl2OVyoWgI8q_IqDIGw":{"text":"We went on Thursday it was pretty slow. Ordered the mango and mango strawberry Margaritas ","useful":0,"cool":0},"DkHp4oo74pZKEuWg2kWDrQ":{"text":"I have been having trouble finding authentic Mexican food in New Orleans,  as you can read","useful":3,"cool":3},"T2LZNnKN0x8iKH3N3A4P2A":{"text":"Service was great.  Food was mediocre at best.  I ordered a taco salad with al pastor as m","useful":0,"cool":0},"zwQO4fB0LCxQT-Qnoncewg":{"text":"My wife & I were in New Orleans a couple weeks ago & ate here twice. We ate at quite a few","useful":0,"cool":0},"GSjEiC5UVUqMlxfQyV9cRQ":{"text":"Casual, delicious food! The meats are well seasoned. The Al Pastor (marinated pork) is my ","useful":0,"cool":0},"GsmY5LSYGvrPYPvJBGYiIQ":{"text":"This is one of our favorite spots in NOLA! The margaritas are the best. Can't beat $1 taco","useful":1,"cool":0},"9pStNpam7HzPYMRrmSGBxQ":{"text":"The key to this place is going at the right time I guess. I've been here numerous times be","useful":0,"cool":0},"EJ0o7vjqpSfzs2BtQZt3bQ":{"text":"Ordered 2 house margaritas on the rocks from the bar, price wasn't posted anywhere, but fi","useful":1,"cool":0},"RgvCNwTS0p8mWVZOxlnyIg":{"text":"$1 tacos sounds great for happy hour until you realize how crappy the staffing is here. Ke","useful":0,"cool":0},"DHGtCqjan7AEOqSTo3G1FQ":{"text":"Found the tacos to be great. Al Pastor, chorizo, carnitas all were great. The chips and gu","useful":0,"cool":0},"k4o6P3fDf0EM5NQXr1sDnw":{"text":"Anybody who knows me knows I'm a sucker for good Mexican food. Especially and specifically","useful":4,"cool":4},"c1FF3ekiCt_XX4B-YASjPw":{"text":"If you go you have to get a large Marg! I love the mango raspberry swirl! Taco's are good,","useful":0,"cool":0},"YaoimyiEmqW6_yXM3mKSuw":{"text":"Went for taco Tuesday as usual. I was there early, around 5:30. My waitress was so unbelie","useful":8,"cool":5},"nj1lUeLyryXi4nNV8xwN3Q":{"text":"Beef tongue soft taco with the verde salsa  is delicious Caesar the manager is cool as hel","useful":0,"cool":0},"kglcQto_g0OOl_vqdWMXGQ":{"text":"The whole table became very sick after having the taco special there. Like VERY sick. The ","useful":2,"cool":0},"AEDd7Pny1eFHUdYUsPHRWw":{"text":"The place smelled like bathroom cleaner, decor was nice and seemed like a cool bar. Barten","useful":0,"cool":0},"B-LZodq1HD-8ckeyGE6wUw":{"text":"This would have been great but the server got slammed. We didn't blame slow service on her","useful":0,"cool":0},"Ytn96_inEOgy8gKKG1YDYw":{"text":"Great food, not the cheapest and probably not worth what we payed unless get the GROUPON. ","useful":0,"cool":0},"AdHylhIvQBlc5JAkKdsP1A":{"text":"Service \nGuac \nBeef tacos \nCarne Asada plate \n\nEverything was amazing, food was delicious.","useful":0,"cool":0},"9j-eucJqIc1e3iVEaolUyQ":{"text":"This place is very mediocre. It's pretty much sub-par Mexican food that definitely doesn't","useful":0,"cool":0},"wrrMzghFEtB10Mjgds8vhA":{"text":"Ohhhhh forgot to mention all the Tacos are only $1!!!! Come on son you can not pass this o","useful":1,"cool":1},"PaktFA6a1-o33Kud7FO9Qg":{"text":"I'll lead with what these guys get right.  Location, the restaurant is in an alluring sect","useful":0,"cool":0},"vTQQzk0LWVymkdQOpvR3HA":{"text":"Some of the best tacos in NOLA, and I'm from California so I've had my fair share of tacos","useful":2,"cool":0},"2nnSkbbXT1R4Br8H0jjkGw":{"text":"Tacos and Beer is close to where I live, so I love that I can have a beer-rita (recommende","useful":2,"cool":0},"VvxRQRw3HtB9fJsguaRFIg":{"text":"Food was delicious, unfortunately we didn't have time to enjoy our meal. From the time we ","useful":0,"cool":0},"LWR56D-RfXH6zFIg4MG9-g":{"text":"Can't beat the dollar tacos on Tuesdays. Great meat selection, including brisket and marin","useful":0,"cool":0},"K-Ju5jSUJ7QNAJH88JM1hg":{"text":"the service was very nice and worked with all of us (even if we were a bit rowdy) to make ","useful":0,"cool":0},"V2AOigNjjHQ1T1q-UH5PCg":{"text":"Good tacos. Went on a Tuesday night for $1 taco night. The carne asada was great. The fish","useful":2,"cool":0},"8ASMxf-Be1hzCnCwpwn61A":{"text":"Great as usual. Been coming here for years. Sophia was a great server. I'll continue to co","useful":0,"cool":0},"LjWLG8atAY18K8TJcsZNrg":{"text":"I have been a fan of this place since its first location opened in Slidell a few years ago","useful":1,"cool":1},"4mLyNTaLielButLfQ2E-kA":{"text":"Quick courtesy service. Food was good and fresh with a great price point for St Charles st","useful":0,"cool":0},"JoMfpWN3Z9AAfLnqyCyz5w":{"text":"The sound of this place struck as me a drunk and hungry place...maybe because I was with a","useful":2,"cool":1},"nuH_5KUV36-VmRvMqtxzFg":{"text":"This was my friend's and I first food stop for our New Orleans trip. We were not disappoin","useful":1,"cool":0},"SxlLCqHPsCJBb8ZD7idpCA":{"text":"I absolutely love this place for taco tuesdays! They offer $1 tacos but unfortunately no d","useful":0,"cool":0},"mSbdXn4mBhfQ54IZrmh4pQ":{"text":"Nathan is AMAZING! We had a growing group of people and he took care of everything, food, ","useful":0,"cool":0},"Jy2_CmQjSnta2qKkBp-Kkw":{"text":"As a Mexican it's hard to find a taco joint worth mentioning, alas I have found the one! \n","useful":2,"cool":1},"5EnFIKIDGphKdct4dJWeCg":{"text":"One of the best taco spots I've ever been to. Don't know if it was because of the drinks a","useful":0,"cool":0},"zp_OGD6Epzqwb6yZEI2OAQ":{"text":"Overall it was decent, but not great. The salsa was brought out in a very small bowl makin","useful":0,"cool":0},"pNwHAxO9_X1Od-ZZ-BmBBg":{"text":"Been to this place a few times, and the food has been pretty good, but the chips and salsa","useful":1,"cool":1},"DUe_B6wZ747ZKwEyDqVCXA":{"text":"Not a good experience. Atmosphere is fun but the long wait for food and drinks are ridicul","useful":0,"cool":0},"MVRnqEAZM-Gy2sExi-jUUg":{"text":"The manager and employees were SO INCREDIBLY RUDE !!!! Service was awful and they were SO ","useful":1,"cool":0},"2kWzFIi2Vyw3evnoE68zJQ":{"text":"This is my favorite Mexican restaurant ever. I've been a regular for a few years now, thei","useful":1,"cool":1},"xDLoe7tMMNbZ4G1VE1fRCw":{"text":"I was gifted a series of groupons for my birthday, including this establishment. When I to","useful":0,"cool":0},"-talrtajx-hgxSiDOq076A":{"text":"St. Charles street tasty tacos!  Casual eatery with authentic Mexican.  Get the Taco 12 pa","useful":0,"cool":0},"q84Rwgi7VJbhj_y7OHRViA":{"text":"Husband and friend went here while we shopped for fabric.  They were both underwhelmed wit","useful":0,"cool":0},"YlEtJS-nAMUBi7c56EKVfA":{"text":"Visited here on a Saturday afternoon around 1:30 and sat on the patio on a beautiful warm ","useful":0,"cool":0},"Rt3rbGedom3KictXxlOsRw":{"text":"Great soft tacos! Made the right way! Sometimes called \"street tacos\". I am from LA so I l","useful":1,"cool":0},"2SmROTjonQSYwNCFcQWKcg":{"text":"When my burrito came out, my reaction was to laugh, \"what am I supposed to do with this?\" ","useful":0,"cool":0},"5z2x62UMVGMEf0r5RdjLAw":{"text":"The food was REALLY good and being from California it's difficult for me to find enjoyable","useful":1,"cool":0},"mDL8F5_-KS9Cu3PpqU9j5Q":{"text":"The best Mexican I've had.....really awesome little  place for a midnight snack. Any kind ","useful":0,"cool":0},"Tw5_ojuB96W5RZ6Hi-UVGA":{"text":"The drinks are great! Not much else\nTo say. The food is mediocre. But for a late night dri","useful":1,"cool":1},"4epT18qyqkqIubEAXS4PbQ":{"text":"Yoga pants.  Ok now that that is out of the way,  the food here is good.  The name conjurs","useful":4,"cool":4},"I-McCy-pDzSndRut5cjtGA":{"text":"I can't really speak on any other day of the week, but on Tues, you can't beat $1 tacos. T","useful":0,"cool":0},"7n6jzoXO8JC3xICUObzNXw":{"text":"Probably understaffed, waitress was extremely overwhelmed which I understand (as a server ","useful":0,"cool":0},"i0i_VRmy3pxa-pOcbjS9sQ":{"text":"I ordered the \"Big Ass Burrito\", the wife ordered the tacos of barbacoa, carnitas and al p","useful":2,"cool":1},"vZkdu4ffRTsY8GKnl08JTA":{"text":"I signed up to Yelp just to leave this review. This was quite possibly the worst service I","useful":0,"cool":0},"mpXGBwYXJWxkuvsuxOhAJg":{"text":"Great as usual. Been coming here for years. Sophia was a great server. I'll continue to co","useful":0,"cool":0},"0enCqaBbejyEOgY-YuvuFQ":{"text":"I come from Dallas Texas were authentic Mexican tacos are in big demand and made to perfec","useful":8,"cool":5},"DCsKgjYEGQ9Zryv87mNvVA":{"text":"My family and visited this new restaurant a few days ago.  It has a nice patio over lookin","useful":1,"cool":0},"N3qtJV1dsqvopYBCSP_8gg":{"text":"Great service! I ordered a frozen strawberry margarita. The bartender mixed strawberry pur","useful":1,"cool":1},"wR3v6jsVPoMCUlCt1Ojb9w":{"text":"Service is always terrible. You have to chase down your server or ask another server to pu","useful":2,"cool":0},"jhjMBAdoWg2efp0jKNji5g":{"text":"Mexican cuisine is as complex as other ancient cuisines, such as those of China and Japan,","useful":0,"cool":0},"5412L85nlXG2eFX691Fp3g":{"text":"Nice location, very friendly staff, and great outdoor patio! \nI was a little disappointed ","useful":0,"cool":0},"SKQA_IplknI47L-6opJ0xQ":{"text":"Came here tonight with my mentor just to grab a quick drink (and honestly because there wa","useful":0,"cool":0},"DQkQ6pRwSy_iOhbaOKnZag":{"text":"I went last Thursday for a meeting in their upstairs room. It was extremely unbearably hot","useful":3,"cool":2},"11uxEWj5N9SqhcXuR2cHig":{"text":"I would consider myself a regular local that dines here about 3 times a month. WARNING the","useful":0,"cool":0},"tzr3yxiiZxhI-PfEewrZWw":{"text":"I gave it only 2 stars because of the service. The food was very large portioned and great","useful":0,"cool":1},"aaun456wtj3UWmAIYDq02Q":{"text":"I'm so happy I stopped in here.  I've found on this trip that your options are a bit limit","useful":0,"cool":0},"vlwQbPGVx8yJptsp_wgxeQ":{"text":"I am a huge fan of burritos and after seeing pictures of the \"Big Ass Burrito\", I knew tha","useful":8,"cool":6},"zFXrFoxInNk-kYkFKYma9g":{"text":"I love tacos and beer. A go to restaurant for my friends and me. Some of the best Mexican ","useful":0,"cool":0},"WWrxmlpHXfgwY8HXCe06wg":{"text":"Food is great but the Micheladas are god-awful... I am mexican so I would know. Aside from","useful":1,"cool":0},"iLdstqn5QqNu88fQf_bQcg":{"text":"Great Mexican, great service. Spent years in Texas, just as good! My wife had the quesodil","useful":1,"cool":0},"uN26ntWenoqZtTQb6L1UWA":{"text":"Been here a few times. Nothing you can't make at your house. Cool concept but poor food","useful":0,"cool":0},"XX0o3dlxAn6sEjeMyIaEHw":{"text":"We had the enchilada of beef tongue and barbacoa. It was good, but  not killer. Michelada ","useful":0,"cool":0},"zeUHE_AWEzAOJ_CkOrApgg":{"text":"Went there when it first opened and really loved the decor, food and service. The owner ca","useful":0,"cool":0},"fNaUduo71P5U8JMQAgh3ww":{"text":"Food is good and service has gotten MUCH better! Great atmosphere and chill vibe spot.","useful":0,"cool":0},"2bbyDVN6oFyLXNTifhnhTQ":{"text":"The food was good but the service was terrible. It took 20 minutes I get anything. The chi","useful":0,"cool":0},"Fw_9gjvjZ9eRaKXgfIPAuQ":{"text":"The taco tuesdays here are worth it! $1 tacos all day. The carne asada is by far my favori","useful":2,"cool":0},"N0WiW1HjDv7t81Uw4zh-Iw":{"text":"Y'all, this place is legit. And this is coming from an Austinite-where tacos are life. Our","useful":0,"cool":0},"NGRiAWEOTerLxbukkHlUzA":{"text":"A friend and I tried this place last week and while I thoroughly enjoy both tacos and beer","useful":3,"cool":0},"psfsy3RkY-WXsus1FIByGA":{"text":"It was a great experience. Not to mention dog friendly which is my favorite part. My serve","useful":0,"cool":0},"FmeJ_gmlLN0PEbAXXY9mMQ":{"text":"Chimichonga was great,  burrito was great.  Service was ok (just basically served our food","useful":0,"cool":0},"w208DoTu9lzrUqbLE06HQA":{"text":"Today, the service was great and there's no beating $1 tacos and cold beer.","useful":0,"cool":0},"L1ismbo9V7-2nVrzFn6GvQ":{"text":"Went here on a Saturday afternoon--it wasn't super busy, just a few tables. After a few mi","useful":0,"cool":0},"tOtpVNuoQzE3IVGX6DGxhQ":{"text":"Worst experience ever! Went for taco Tuesday and never got to eat a taco. Start: sat down ","useful":2,"cool":0},"o7RoXdgcLgIz_-Pv9oO7lg":{"text":"I've traveled to Cancun Mexico, Mexico City, San Francisco etc. and never would I have ima","useful":0,"cool":0},"_k1352sMgVRn0L-1r-kIQg":{"text":"Place has amazing and authentic food. I thought it was gonna be some TeX mex crap but when","useful":1,"cool":0},"wWUJgR7xPiBYLMA-0aPBlA":{"text":"1 stars for the tacos, that were very dry. I had to overload them with hot sauce to get so","useful":0,"cool":0},"10hvY8VaZE5ZuVMdSuxxyg":{"text":"Food great!!!!  Service on the other hand was extremely slow just because our waitress was","useful":1,"cool":0},"q18TY1oUx66gRXalVKqzoA":{"text":"Let me start by saying I work in the hospitality industry, and have for many years. I don'","useful":1,"cool":0},"SjQetBhcufls-yTj0NTqag":{"text":"Nice and quiet here. You have the option to sit outside on the patio or inside. Inside see","useful":0,"cool":0},"gkHlvA4gktZNV3zk-Eo7sg":{"text":"Omgosh. The bean soup is AMAZING. My old man ordered like three bowls of it it was so good","useful":0,"cool":0},"hB9fRr_cGgdOIhWKeLsmIw":{"text":"The name is hilariously obvious and to the point, but Tacos and Beer does deliver. They ac","useful":3,"cool":1},"2DZnzIHTMpe2vGpa9Fsg3A":{"text":"Had a groupon for this place so decided to try it. I had the shrimp chimichanga which I wa","useful":0,"cool":0},"0Cl3fODsovPufqkNnPuwHg":{"text":"I enjoyed my food here- there wasn't much choice in the menu at all for a vegan but I was ","useful":0,"cool":0},"KDL8FDPZ8NQQBJQTmVWOkQ":{"text":"We sat down and were immediately asked what we wanted to drink, though we hadn't been give","useful":0,"cool":1},"EoXDNkgfzfdekynMiB91RA":{"text":"Had tacos de lengua, asada, and suadero. Amazing! Great service. Had a michelada to end th","useful":0,"cool":0},"5go2Ya8Q7zY190ctqnLHOw":{"text":"Really delicious queso here! So yummy! This is a great place to go when there isn't much o","useful":0,"cool":1},"G9sqTIQURePBPgxOCVlx9g":{"text":"OK, I'm torn with this place I work down the street and try to go there for lunch because ","useful":1,"cool":1},"06F6NBg-Nd6S_I_z1tOY2A":{"text":"Was excited to hear about $1 taco night only a few blocks from my place. Started going and","useful":1,"cool":0},"OzEiY-3XfJDRuZmK5-CrRA":{"text":"First of all, I have come to Tacos & Beer multiple times. It's a decent happy hour with de","useful":1,"cool":1},"mvbmK38zRSqZ2NhVE1YlJw":{"text":"On the parade route so you can grab a drink between floats. The food is not good though. S","useful":0,"cool":0},"KbUxMuAs8C19-REJhiMvBQ":{"text":"Had 3 tacos for a $1 each and they were okay. The tortillas were kind of bland but the ser","useful":0,"cool":0},"lD4zv4JRoTHye5HZUQle0A":{"text":"Great staff! The food is ok, if you are looking for authentic Mexican food then skip it, B","useful":0,"cool":0},"l1G0pvUBEBUZf07OjSAEVw":{"text":"Great as usual. Been coming here for years. Sophia was a great server. I'll continue to co","useful":0,"cool":0},"om2YUgaf8x6rvdXahPlsrA":{"text":"Good stuff. Mexican style tacos with a good selection of meats. So corn tortillas with al ","useful":4,"cool":2},"VyRNmC3ssUIaP_5I6wnhdQ":{"text":"Service was fast and so was the food. If you like tacos and beer and don't want to wait to","useful":1,"cool":0},"Y-WJBLkRfFxIjK7xCsE-iA":{"text":"They make the most amazing drinks here. Must order drinks Michelada and Paloma from barten","useful":0,"cool":0},"GlQ1tVTEQxj62OLN2k8ZeA":{"text":"Went there for the $1 taco night.  The tacos were...worth $1.  They were fine, just small ","useful":0,"cool":0},"bIhLmUoo_8LGwR9ravWBJQ":{"text":"Tonight we wanted quick Mexican, so we decided to try Tacos and Beer.\nWe had the grilled s","useful":0,"cool":0},"uLWFl0wwwOeUcGQ0K7LlbQ":{"text":"We went to tacos and beer based on a recommendation and were really unimpressed. The \"home","useful":1,"cool":0},"10YOyVbE5MlSa_N-E-dS_g":{"text":"We in on vacation and saw there specials, beyond the great deals and absolutely terrific f","useful":0,"cool":0},"aftSKR7G8A6Xnta8Zs4FLg":{"text":"Seems pretty out of place to be on St. Charles. Pretty mediocre tacos, salsa tasted like m","useful":0,"cool":0},"zBI0iI6OZ0mhU3gGJG65AA":{"text":"I went into Tacos and Beer yesterday at 3:30pm after the Saints game and asked for a table","useful":1,"cool":0},"NkyhNCqiVb9GyN6XijCfQg":{"text":"SKIP IT!!!!! This place needs to reevaluate. Who doesn't love tacos & beer? That's where t","useful":2,"cool":0},"gOWj4BYfLrEypLXrtgNgJg":{"text":"Completely forgettable. Inoffensive. The pork on my Southwest Salad was fine but the Cisco","useful":2,"cool":0},"_k0ipTQcO_oq9Ab5FBP_yQ":{"text":"Good food bad service. Happy hour during the week is always a good decision!! Taco Tuesday","useful":1,"cool":0},"l7lk_-HXW1oEbJwtIqgdCg":{"text":"$1.00 taco Tuesday is great. Although seems to be unorganized. Took 10 minutes before some","useful":0,"cool":0},"5kPRnJWXZwHghzOMtq3L3A":{"text":"Burnt nachos, super greasy tortilla chips, terrible house margaritas, Really over priced f","useful":0,"cool":0},"_olXP_IJu3_6lylkTltyjw":{"text":"Awesome margaritas, definitely get the pitcher. Great deals on Tuesday with dollar tacos. ","useful":1,"cool":0},"d1HqPp2yeOgSJQE4a9vDMQ":{"text":"I know tacos. That being said, this place could be a winner. If the service staff wasn't p","useful":0,"cool":0},"XJYDO7QHnKU_6iFrMp6hkQ":{"text":"Went in for a early dinner around 4:30 only people in place thought awesome!!  Service was","useful":0,"cool":0},"-Ve1xITzPviu0ZY993crKw":{"text":"If you like being rushed.....pushed out the door with a thank you and come again attitude,","useful":1,"cool":0},"6RC-CF7CMzINV8TdrBgqGQ":{"text":"One star because zero isn't an option. The food is terrible. No flavor and bland. RUM HOUS","useful":0,"cool":0},"o9XPgOpHCgTT_bUpWcOBrw":{"text":"So we did a few appetizers and drinks on my last time at this restaurant and flavor wise, ","useful":0,"cool":0},"Ql3Xky3oSWk78XN4Uf1o3w":{"text":"This place was so good!  Huge Chimichanga that they call the Chimi-Chingon.  I don't eat m","useful":1,"cool":0},"2wOazxvndFKhydzGRksELA":{"text":"We tried 3 street tacos:  carne asada, Barbados and Lengua.  We're from Phoenix and know g","useful":0,"cool":0},"hYFMLJBR898QnWkeTmy8Fw":{"text":"Princess Picky Pants rant below. Please consume with grains of salt.\n\nIt took everything i","useful":0,"cool":0},"Pc45QV5pq6RxYVnuBQyihg":{"text":"This is a small local chain and they have other locations on the North Shore plus a Mexica","useful":6,"cool":2},"8yDQsFcEeaw3f5uRQ6Wh9w":{"text":"Taco bout cheap tacos! This is nacho average Mexican restaurant. $1 tacos on Tuesdays, but","useful":0,"cool":0},"pGP7LBOp1BEpGQtPdxuU7A":{"text":"Food was pretty good and a decent selection of menu items. Service made this particular vi","useful":0,"cool":0},"ZBVmsLTRDzrHWM-4XmF7zg":{"text":"This place has some amazing tacos! The atmosphere is very laid back and fun and they have ","useful":0,"cool":0},"YBupn2HVvbCz0MGeSTUb3A":{"text":"Came here for the famed taco Tuesday and proceeded to be ignored by the wait staff for 20 ","useful":6,"cool":0},"YG8Tz5jWBMXIbMBU_vMrfg":{"text":"We would come here all the time.\nThen the service started sucking. \nTonight, at 10 pm, the","useful":0,"cool":0},"5VetWqKXoLKPl-TJEwSJgw":{"text":"The cheese dip and nachos at this place was enough to make a couple of girls happy. The ma","useful":0,"cool":0},"UIRYpheIpBeniyZ51oYfEA":{"text":"Your typical average Mexican restaurant. Is there better options in NOLA? You bet. But, I ","useful":0,"cool":0},"z1n3ZW4igL7I1UU7egWTFg":{"text":"We have visited this location multiple times, and have always had excellent food paired wi","useful":0,"cool":0},"M15MD_DjHc3V047tmAhH3w":{"text":"I love Tacos & Beer.  Their burritos, tacos, and taco salads are really good.  I also love","useful":0,"cool":0},"Qs8CCCSbhl4xoqtkBSIiWQ":{"text":"Good beer selection. Nachos were good and plenty for two. Nice staff and jump off/on st Ch","useful":0,"cool":0},"tqmMIhxFXsNseVrHScK0zA":{"text":"I came here before heading to meet some people and had their Ceviche Tostada and Guacamole","useful":0,"cool":0},"RBXuycVnKS1HKa6HOJZ1Pw":{"text":"I was surprised by the food, so far one of the places I've liked the most in New Orleans. ","useful":0,"cool":0},"iiYB7HOwIpMwWY_h4CemLg":{"text":"Service was good. Happy hour prices were great. Draft 3 dollars. Tacos a dollar fish taco ","useful":0,"cool":0},"xrpllP1s7RbFRGJaGQ5i9Q":{"text":"How can you not give 5 stars to a place with $1 steak street tacos and $3 frozen margarita","useful":0,"cool":0},"lPCafQ8InXemcIEU9Mp5TA":{"text":"Pretty decent Mexican food, quality meat and good drinks list. The rice and beans could us","useful":0,"cool":0},"GWm5w8marFwstXYow75GVQ":{"text":"Best Mexican Ever. We need one in Memphis. There is a vegan and vegetarian option for a fe","useful":0,"cool":0},"I-i_CPQcCa7eHwhTpEuuZg":{"text":"The service was a little terrible, but only because the waitress was so spacey. BUT, the f","useful":0,"cool":0},"96aChXgqNUHj8Yp6OoVFkg":{"text":"To end our lazy weekend in, we decide to have a lazy dinner out by eating at a place that ","useful":4,"cool":2},"fEOR3eTswohalnG4er-dJA":{"text":"This was a huge hit. I could have had twelve flautas, they were so good! We sat outside an","useful":0,"cool":0},"WdFqiz0LpK0v5EHvJg-7kw":{"text":"Don't let the bad reviews get ya down. At the end of the day the food is delicious! \nHuge ","useful":1,"cool":0},"LbM5In38GSBbx1_d6rt7mw":{"text":"The food and drink are very good in my opinion.  My knock on the place is you have to seat","useful":0,"cool":0},"hBjD5h6KtpHNvZ7p2OkNrw":{"text":"This place gets one star only because I can't write a review without giving at least one s","useful":1,"cool":0},"h_ozINdEngn5bc_8Hpb2Ng":{"text":"The complimentary bean soup is a nice touch, I wish I could get the recipe. I got the taco","useful":0,"cool":0},"Lquc8bPey5CUoiQY-T82Nw":{"text":"I got here fairly early - happy hour time around 5pm or so. Sam was our server. I understa","useful":0,"cool":0},"ukgcZhojD8NtC02gpHrXvw":{"text":"$30 for chips, salsa, taco salad, guac & cheese\nWhile the chips are plentiful, I could buy","useful":0,"cool":0},"dFu0tPpSfeekBxLKe_NB5g":{"text":"So yesterday I came in with a group of 8 at a time when they had more than enough accommod","useful":0,"cool":0},"eI_nsDA9EqlNoOUZxyqCLg":{"text":"Not a lot for vegans here. We stopped on a \" Taco Tuesday\" , which means not only are basi","useful":1,"cool":1},"vaBclbadxRumq-og0lsUSw":{"text":"If I could give this place a zero I would.  The service was awful.  Maybe our waiters man ","useful":0,"cool":0},"apo2YmRUtknO1wqlMo4McQ":{"text":"Fun hang out.  Not gourmet food, but great for what is is: beer and tacos. And margaritas ","useful":0,"cool":1},"27bx-dNAgJ3JeJob4O5WZw":{"text":"This place sucks! Drove all the way from Mandeville to come get some Tacos and Beer at 12 ","useful":2,"cool":0},"JpN1oNwsXMIhHnAap3eEjQ":{"text":"So my husband could eat at this place everyday. He almost does. The tacos are awesome and ","useful":0,"cool":0},"3tZD2kTI4TH1bfORNvNVgQ":{"text":"Nice staff. Great location. Beer and food was very good.","useful":0,"cool":0},"zRZnlcws8KTEOuKR480b_g":{"text":"It took me forever to find a place that I felt I had anything resembling a street taco. Vi","useful":5,"cool":2},"npU52p7w1ZNAe7sNLP0geQ":{"text":"Food is so very good ! My husband and I have been here 3 times and really love the food . ","useful":0,"cool":0},"fQ7_ahUJIvMqP9gIunWsjA":{"text":"I have been going to T&B for about a year now. The drinks are cheap and the atmosphere is ","useful":1,"cool":0},"RS-vj5uOAl6CKiU9ySk5xA":{"text":"On Tuesdays we usually go for the $1 tacos which aren't too bad. I only get the mushroom t","useful":2,"cool":0},"0bETYvnOPCFTVAZoPcN8UA":{"text":"I have to say that the food is really good, but I don't think that I have had slower servi","useful":0,"cool":0},"5f35ENVG3tOo13Ctn1_pOQ":{"text":"The best place to watch the parades!  Full service bar and menu. Authentic Mexican. Hello ","useful":0,"cool":0},"uMUqfZkvm3tlflB04Q_uMw":{"text":"Very nice little restaurant. I love the torta. The margaritas not so much. For me the chor","useful":0,"cool":0},"-Eq2Brc83NvivyGePsFZ5Q":{"text":"Stopped by the blind pelican they gave us a shitty table so we went next door I'm so glad ","useful":0,"cool":0},"vGThWdNDL_SLlLHWLt_lng":{"text":"I've been here a few times now and each time I've liked it more.  Service is decent and fo","useful":0,"cool":0},"GpK0VqLZVYWDh8iPhqC7Hg":{"text":"Good $1 taco Tuesday's. Tall boys PBRS $2 on Tuesday also.  Great find good deal.  Sarah i","useful":1,"cool":0},"3Cig-WNkbqPZowEidkP4Pg":{"text":"Never been here, was really excited about trying it out, but the host ruined my experience","useful":0,"cool":0},"pvjux0B-e-zT52VRLnjIJw":{"text":"Sooooo, let's begin. We stumbled upon this place on a Saturday afternoon as we walked arou","useful":1,"cool":2},"AXz2o2XGhgjZtFXAL0m3Cg":{"text":"The manager and employees were SO INCREDIBLY RUDE and RACIST!!!!! Service was awful and th","useful":0,"cool":0},"_oGTLIixRQxtFk-9ab02ig":{"text":"We had a blast at the VIP Mardi-Gras Party. The bartenders handled the massive crowd and w","useful":0,"cool":0},"B28zHo0X6vzqFi98yp1VxQ":{"text":"After passing by this place many a time on my daily streetcar rides I finally decided to g","useful":3,"cool":1},"73gRvCAQlh8MDiJCmDeepQ":{"text":"Came here tonight on a whim. Started with the Cadillac Margarita and it was huge. Shared i","useful":1,"cool":0},"ii5O4JP9WBjxO3fvYmuFTw":{"text":"I signed up for Yelp just because of my visit to this place. Went in on Taco Tuesday which","useful":0,"cool":0},"Mtkgp890hcMAnuyNr5LW8w":{"text":"This place. Wow. I really liked it. Had some fun. Then maybe my third time, my friend was ","useful":2,"cool":0},"3bqDVKYA-ttELN-2HjHWHA":{"text":"Great place!!! the tacos were $1.00 (taco Tuesday) which I thought was so awesome, had the","useful":0,"cool":0},"uONp9h8Klt8xHjEDFhz9lQ":{"text":"This was our first trip to Tacos and beer and we were not disappointed! \n\nFor starters we ","useful":1,"cool":0},"RDmAD4Yt2wIiDxAAKHHaYw":{"text":"Good tacos, cold beer, strong margaritas, and best of all Reed Lightfoot playing acoustic ","useful":1,"cool":1},"8KEmGDZ8szxoTxIOmEB2yw":{"text":"I enjoyed Taco Tuesday. Great service and food and drinks aren't bad either.  I'll be back","useful":0,"cool":0},"No2_NE5lUyin1i3Gau5Nhw":{"text":"Is you love authentic Mexican food this might be your new spot. Everything on the menu is ","useful":0,"cool":0},"2xKzH-0LmBKoqJS7TLuVdw":{"text":"$1 Taco Tuesday?! I think yes. Hands down the best taco spot. The tacos are delicious (bar","useful":0,"cool":0},"IGQBBhqzD7-ZtdfGtTW7Ow":{"text":"The servers were so kind and accommodating but the manager was a total dick!!! So rude and","useful":0,"cool":0},"A8O1Eb7eRhno8QvJtmy5gg":{"text":"Taco Tuesday rocks. Tacos are small but for $1 you can get several and try different ones.","useful":0,"cool":0},"bJdkB5B2Px7BF0NuIUY4XA":{"text":"In New Orleans for the weekend and found this awesome place to have a Margarita and watch ","useful":0,"cool":0},"FDHdKbrdJiyKJwGq_AamxA":{"text":"Cold food, terrible service, loud music. $1 tacos, but debating if they were worth that. T","useful":0,"cool":0},"CL60XZPv4084bkq5ciTmiA":{"text":"I'm typically a bit cautious with restaurants that go with silly names. Like, I get that i","useful":0,"cool":0},"VEVQhGQpbhIihvl99pnVNQ":{"text":"Been here multiple times, count as one of my go-tos for mexican food. I stick with the mol","useful":0,"cool":0},"q_gJDg9xaVTlnwirPhM5gQ":{"text":"Good food, good atmosphere.  Beer on tap, what more can I say?","useful":0,"cool":0},"2bdQKY5PMcUvH2y2F5OdQA":{"text":"Visited and it happened to be $1 taco Tuesday. Now it's Friday. My husband still has food ","useful":1,"cool":0},"7sjg-YtSRCpUoqovkGaiOA":{"text":"If you want the honest opinion on this place here it is. It doesn't even deserve one star.","useful":0,"cool":0},"hUV1n2XwlP1aH4z38slPDQ":{"text":"The name says it all friends!  Tasty tacos, delicious beers, great prices, and friendly se","useful":0,"cool":0},"5NQxrz8BL66rkPfwRbAbvg":{"text":"Sigh. Where do I begin? Been here twice and both times a disappointment. Bad service, stal","useful":2,"cool":0},"ClizuOBxCowBWPatX-iLIA":{"text":"I REALLY wish their service was better because I definitely would have given more stars. I","useful":1,"cool":0},"tBSmLPAUMyxjg06LUNL_3Q":{"text":"I am not sure how I landed in this place.. Better version for f frozen food. Don't waste u","useful":0,"cool":0},"Hj1TZX5YAcZ2lOqvTwkigA":{"text":"Excellent spot for Taco Tuesday! $1 tacos and great margs. Our server Taylor was killer, h","useful":0,"cool":0},"bw7gUb-EtgqfcKz161HIxQ":{"text":"Great little restaurant with lots of character!!  Eclectic group of patrons hang out enjoy","useful":0,"cool":0},"Ga1TKbnaB3IZYpFjk3i0TQ":{"text":"I've only been on taco Tuesday night, but several times. The service isn't the greatest, b","useful":0,"cool":0},"DTbooSPH4FWKuKs_cfGZFg":{"text":"Happened upon this place when I was in town for a trade show. The bartender and locals wer","useful":0,"cool":0},"wP9ymESmWpewKenzRt_gYA":{"text":"This place is great for a late night bite, which is probably my favorite part about it. Th","useful":1,"cool":1},"tTcNec22no1N_TkMotw6lA":{"text":"I ate lunch with two other friends a couple of days ago and didn't have a good experience.","useful":1,"cool":0},"Ul6qK9UUo5nvdjzb_BdH8A":{"text":"This place is all about drinks.  My swirl was great.  The food was ok.  Bland, but ok.  I ","useful":0,"cool":0},"yUsCEK1izsSH5qwoBcliMQ":{"text":"This was one of our many HH stops on Friday. Needless to say it wasn't the highlight of ou","useful":2,"cool":1},"FROldShsUavmZ8453kjT7w":{"text":"Tacos were not bad. Service and drinks were poor. Manager was a douche.","useful":1,"cool":0},"mCMc1-pWQLnhYLH8wXsRgQ":{"text":"Don't let the three star rating fool you. Yelp guidelines stipulate that three stars means","useful":7,"cool":5},"722Xj4zvj5OHq_IWih2-PA":{"text":"This place might be decent, but the staff was to incompetent to get us food before we left","useful":0,"cool":0},"mFxlzxvaKU4aYBmeiVaoqw":{"text":"I only gave it 1 star bc I couldn't give it a quarter of a star. This place is horrendous.","useful":2,"cool":1},"AThz5--Y2G9x5tTO9Rkg8Q":{"text":"Salsa is very spicy; house margarita is good. Get the medium. The large is like a fish bow","useful":1,"cool":0},"gE66jnz4ApuOxNbf94b1GA":{"text":"I'm letting my kid give this review since he suffered through this ordeal. These are his w","useful":0,"cool":0},"LN3GFDinoyRDwhz2w3AT4w":{"text":"If I could give this place a zero I would.  The service was awful.  Maybe our waiters man ","useful":1,"cool":0},"oqdRN8gOlg5k6LNed7QSHQ":{"text":"Never ordering for pick up again. Took more than expected and they forgot the rice and bea","useful":0,"cool":0},"3elwpgWj1iHLCcda0gIVXw":{"text":"We were invited by some local friends to join in a small birthday gathering at Tacos & Bee","useful":0,"cool":0},"jtn18Xxe7FZzBkSa7CQiqA":{"text":"Very pleasant staff. Great drink specials for happy hour. The location is great with patio","useful":1,"cool":0},"xYQsa9bpuho09vkILFKLMg":{"text":"Although the food was good, when it finally arrived; the waitresses were slow. The women's","useful":0,"cool":0},"hjPdojmorUwYMSniEP3Lag":{"text":"Last time I visited this local, I had a good experience. But today we arrived at 11 o'cloc","useful":0,"cool":0},"ziQPYvbVV8jDuxIOz2298A":{"text":"Good food for a great price, 2 of us shared Molcajete and it was very filling. The service","useful":0,"cool":0},"hvls-GbvnMarw8XI1HjCIw":{"text":"Loved it!! I was looking for a great place to get street tacos and this was it! Plus the h","useful":0,"cool":0},"LV2xKKVKPYjcZXEU2hS_QA":{"text":"A solid two stars no better no worse. Their $1 tacos are not quality but edible. $1 is too","useful":0,"cool":0},"6-IBGkHp3N8z_Hbl-_ytLg":{"text":"i don't understand why this establishment only has three stars... the servers are so sweet","useful":0,"cool":0},"qZajG-d_UkmSljtxffVtxA":{"text":"Stopped in for a bite and I am so disappointed. Sat at the bar and everything seemed fine.","useful":0,"cool":0},"GJ3qvX4NbXCZBcpWbFS2Ww":{"text":"Been here twice over the past couple years, and both times they had great food and awesome","useful":0,"cool":0},"DCmtTD1IXVpAclqJ2T0bHA":{"text":"Our party arrived at 9pm on a Thursday and the place was probably about 65% full and looke","useful":2,"cool":0},"_F9RtxQWsroVQhbZN38N5Q":{"text":"Horrible service and the wait was over two hours. We ended up leaving. I would NOT  recomm","useful":1,"cool":0},"gjzoHmOLbe9HiYQR6GxK7w":{"text":"They have both tacos and beer, so that's great! The food is all really good and fresh. The","useful":1,"cool":0},"Z8ZUmBx77p6Y8DRkEZ4uxQ":{"text":"Outdoor seating is fun but inside leaves a lot to be desired. Good beer selection. Queso w","useful":0,"cool":0},"Aab0pgxJp_LEXUwl0g4Hjg":{"text":"Just had a mocajete. Delicious!  Great patio. Bucket of beer for ten dollars. Great servic","useful":0,"cool":0},"Zm20Tkz37N9AhgYwIWRQXw":{"text":"4 min walk from Prytania Park hotel and amazing!! First time trying lengua, and it was ful","useful":0,"cool":0},"iBnN_UOt7selY99oRjOekA":{"text":"Wow! I came into tacos and beer earlier this week to sit at the bar and was greeted by an ","useful":1,"cool":0},"AOGql3h5aua2-CBkGJB7Eg":{"text":"I have been here a couple of times for Taco Tuesday, but never again. Every time I visit h","useful":1,"cool":1},"EERQjZjvvC3tdPUOCK_d7w":{"text":"Subpar tacos. Dry meat and they mixed up the order when it was extremely slow. They only h","useful":0,"cool":0},"qtCTO2jfhFCsI6mVPAMuHA":{"text":"Pretty mediocre joint... food, service, atmosphere, the drinks. None of it is stellar. Not","useful":0,"cool":0},"qfEaPKI7V1gm_XLsDNNc-g":{"text":"Stopped here for some late night tacos. Tacos were very good especially for the price . Ho","useful":0,"cool":0},"n4DzlObmQhAvXViRqJg13g":{"text":"My 2 star experience started when I sat at the bar, and found out they recently changed to","useful":6,"cool":1},"kKxFOrpgRMnhhIP1ojFHkA":{"text":"Nothing special about the food here. At all. The night we went there the 'vibe' was really","useful":1,"cool":1},"plH7PvSrXYLNnWxoaMlwpA":{"text":"I usually have a great time day drinking during happy hour. I went tonight to watch a bask","useful":1,"cool":0},"kZ9xavgXJYnvsm1nFIOiAw":{"text":"I don't get the bad reviews!  We have enjoyed the drinks and the food every week or so for","useful":0,"cool":0},"8ZEa8VLkeS-_TWiqlo4AGw":{"text":"Went on taco Tuesday and the tacos were very good.  I tried another taco Tuesday type of r","useful":0,"cool":0},"5wtrhvSzqaTII31WJdU8CA":{"text":"It was \"just ok\" for me.  Got the \"beer battered\" fish tacos  and I had to order a beer as","useful":2,"cool":2},"Y7fyfymiALxy7r8RRk4LCg":{"text":"I went here earlier today for taco Tuesday and wanted to like it so bad. Service started o","useful":0,"cool":0},"Hwzuld71V-afuOTXz0UH0Q":{"text":"I've gone to tacos and beer in slidell many times and their service and quality is great. ","useful":1,"cool":0},"dktIodcHWOvzmkTJtr5WuA":{"text":"We had ceviche which is probably the best I've ever had! Big shrimp cut up and lots of avo","useful":0,"cool":0},"oZ93sPZbHvrJ5Wq70Bm0VQ":{"text":"Best place to get authentic Mexican in the city! Awesome drink specials and you can't beat","useful":0,"cool":0},"GIIe6m6HiEwSLCLHEyI72Q":{"text":"Worst of the worst, service wise, by far. We waited forever to get drinks and the few time","useful":0,"cool":0},"fZe5Xr3h1cyoX9KGMRwtRw":{"text":"This is my favorite place for authentic tacos! They have a good selection of meats and the","useful":0,"cool":0},"BgEesL0i-SuRbUUOyDvIeQ":{"text":"Great place! We were served very quickly! The food was excellent the Big Ass Burrito blew ","useful":0,"cool":0},"6c3e3z8at8mFThTgXwI5ig":{"text":"Taco Tuesday is awesome, the drinks where great. But Taco Tuesday is a busy night. We had ","useful":0,"cool":0},"T1OyBZnPHWjCnqt-accXqQ":{"text":"I downloaded yelp to specifically give them 1 Star. Slow service, bad value portions, and ","useful":0,"cool":0},"5bj49HmUvv27d44FHamWcQ":{"text":"Great atmosphere and food!! Our server, Blair, was fantastic and very helpful. Will defini","useful":0,"cool":0},"Q622SgAiKcefoD9frKf52A":{"text":"I wish I could have posted a picture for you all, but as soon as I tasted the food it was ","useful":1,"cool":0},"uA0usZJQjE2vKaxB3yOfiQ":{"text":"Tacos tacos tacos! This place is cool and comfortable. I love the outdoor seating space. T","useful":2,"cool":0},"F46IlPP6ugAlfFE88SBSaA":{"text":"I've been here on multiple occasions with fellow colleagues and have found that the food h","useful":0,"cool":0},"BNN4506KnZsT2UEeGPOf9w":{"text":"Tacos and Beer goin' Up! On a Tuesday!!! I wish everyday was Tuesday because of this place","useful":3,"cool":3},"RL281DLDBiieXc8QEn7q4A":{"text":"This is super authentic! The food is great, the vibes are welcoming. The prices are afford","useful":0,"cool":0},"35WUuX0IdaRxQVw2P4ZOvA":{"text":"really good food + terrific, friendly service + DELICIOUS housemade horchata with rum (rum","useful":2,"cool":0},"qhwECddOmOvpNAyarWaglw":{"text":"I've had good customer service here. I ordered the Baja tacos and they were really good. H","useful":0,"cool":0},"QCadcQ4mHgnwYCeH1q-Uog":{"text":"Perfect lunch spot, I love to sit outside on a pretty day and usually sit at the bar! The ","useful":0,"cool":0},"l9kHNx_-HNsBVitAsF8thQ":{"text":"This place is shitty. Idk why I've been here three times. Oh yeah... Keep falling for the ","useful":5,"cool":0},"6Xj_kt-r0g4cIS6QqqP7nA":{"text":"Went here for lunch today. On Tuesday's they have $1 tacos all day. I would've gave them f","useful":0,"cool":0},"dDsy8KFVNiyti9y6_XfjlQ":{"text":"Nice staff and quick service but, not great food. I got the al pastor and carne asada taco","useful":1,"cool":1},"oy_7Tah1unc6co-hyIaNtw":{"text":"We got to Tacos and Beer twenty minutes before closing. It's Mardi Gras, we're starving af","useful":1,"cool":0},"watt_7pK6jo1nmjf0-jRAQ":{"text":"We sat out front on their deck / patio w our dogs. We were welcome. It was nice watching t","useful":0,"cool":0},"0iM7fSUx3o2Y4c5DpCr_mA":{"text":"Tacos and beer has such a homelike atmosphere with an incredibly nice waitstaff and barten","useful":1,"cool":0},"SgEnT2_DLCBUiZPDTTIusQ":{"text":"Tacos N Beer. You have touched the lives of many. Sometimes inappropriately.  After failin","useful":7,"cool":4},"By_zHEvi443d2D89dsNHrQ":{"text":"I went there today and had good food and cold beer. It was very relaxing and nice sitting ","useful":0,"cool":0},"vFzm_fLyxezzo9X66BDZhw":{"text":"The Food is always consistent , the service may vary, this time it took the line 40 min to","useful":1,"cool":0},"bqtfUVf6x5D76xSpYFaF1Q":{"text":"This place is always busy but the beer and tacos are worth it. Inside is on the smaller si","useful":4,"cool":0},"tXfQMi6q62tK4h1KFT5P2Q":{"text":"I came on a taco Tuesday night and it was terrible! Parties were seated before my party wa","useful":1,"cool":0},"1nA9uZUEbnQNUQQ1ExNHJw":{"text":"THIS PLACE IS A HIDDEN GEM! The service is excellent. The Barbacoa is a great choice and s","useful":0,"cool":0},"KQI7qxJ_awAy1tZtr8terg":{"text":"The service here was SOOO SLOW we could of taken a nap and STILL been waiting for our food","useful":0,"cool":0},"l10IHrOrcVkj_OXLdoHwsA":{"text":"Went there today with my fiancé and service was terrible!!!! I walked in with my child and","useful":0,"cool":0},"xhBcyLPyNyWcQX4kIsJRmA":{"text":"Please don't go to this establishment the bartender and owner are unprofessional and disre","useful":0,"cool":0},"XwWxXqA0jlh1ST6EtHOVHQ":{"text":"I hate to give bad reviews but I think you would need a dangerous amount of beer to think ","useful":0,"cool":0},"GpXL0cn90m-oSPBlhBAkGw":{"text":"Pretty solid Taco Tuesday specials! All meat tacos are $1 each. Los Angeles-style, just a ","useful":18,"cool":9},"fLeu8s9lopHc8kH3pE9ODQ":{"text":"Oh my Gosh!!! We had the street tacos and they were bomb!!!! I was gonna go back for their","useful":1,"cool":0},"_-uy4Yt6gjlwoHBz6tMxOw":{"text":"It is what it is. Margs aren't the best but giant. Food is subpar but $1.00 tacos on a Tue","useful":0,"cool":0},"IQBnXNXIfKc9H6xR7GppTg":{"text":"Great Tacos & Drinks....& An Amazing atmosphere!!!!!!!!!! That was My First TimeEver Going","useful":0,"cool":0},"vfNlxCgbAJVTLcvtoRpyGA":{"text":"We stopped in after a long flight from Boston. Luckily the rain had stopped so my hubby an","useful":0,"cool":0},"KdW2ppbPwRpT3mY24X8mWg":{"text":"It pains me to have to write this... I recently went to Tacos and Beer for a meal with my ","useful":14,"cool":10},"Wn9AGmutoboyP_S0IJhwcg":{"text":"We ordered the 12 tacos for 19.99 on two separate occasions and were satisfied both times.","useful":1,"cool":0},"Zxo2hR09Nxgmr26m7ySQoA":{"text":"We had dinner today at Tacos and Bear.  I must say it's the best Mexican food I've had in ","useful":0,"cool":0},"Y_Halk6bHO-63XnQRB9GZA":{"text":"Good tacos -- love the shells, which are freshly made, it seems. Oh -- and the ceviche is ","useful":1,"cool":0},"cAatJ1sS2dcXurCCZUNgvg":{"text":"Lively atmosphere, good drinks, fun foods. The wait time is crazy, but they make up for it","useful":0,"cool":0},"AvKxfbg-kDqOTkoWnFdOrg":{"text":"We came here for tacos. We watched tables be seated before us. We asked the hostess what w","useful":1,"cool":0},"Pszw0Oj9EeVQAPlv8HtDyw":{"text":"Went around 8;00 on Saturday night. Not too crowded. Service was terrible. After we got ou","useful":0,"cool":0},"cQ_hA_ze5Lo-T5razcsgqA":{"text":"Great place for beers and tacos for sure, but my only qualm is with the bartender that loo","useful":0,"cool":0},"HauzU1nT-JFREYdlZiN1GA":{"text":"Great place to relax in New Orleans on a sunny day. Love sitting on their front patio - es","useful":1,"cool":1},"kjXytp1V_K9RxKbqdnzdhg":{"text":"This is the worst place for tacos on Taco Tuesday. They charge you 75 cents for toppings a","useful":0,"cool":0},"yVfMVucTBzBaY4XZMIbHOg":{"text":"i never met a burrito i didn't like. till i came here. the bathrooms were ok. other than t","useful":0,"cool":0},"s_fibYMihbvPwuiRkJj_Ww":{"text":"Jumped off the trolly car because we saw \"Tacos and Beer\" on the side of the road. Had tri","useful":0,"cool":0},"fp8DmOttD3hv3PAgcYDdhQ":{"text":"Disappointed. I love Mexican food. But this place just needs to do better in food. Our ser","useful":0,"cool":0},"uKY27813OciOJA09iRWUWw":{"text":"Worse place ever! Went here with a couple friends and got the slowest service, crappy food","useful":1,"cool":0},"OfmfyNolyUm7H2Gbx2wgSA":{"text":"We got a recommendation to come here for $1 taco Tuesday and it did not disappoint. Especi","useful":0,"cool":0},"T3g_gRgAxkDCb6lCNzki4A":{"text":"I have been to this place a few times and fell in the luv with it, the food and drinks wer","useful":0,"cool":0},"7ywr4kLsNUwiONVughtdrw":{"text":"Love it. Speedy service on a busy Saturday night. Waitress was super friendly. Dont rememb","useful":0,"cool":0},"U_vEILZdnvIoBn0-Bs0yKw":{"text":"Japaleno Margarita, an explosion of good flavor with a ring of New Orleans Cajun seasoning","useful":0,"cool":0},"sC2_6NHEc_pJzEmJn3fHUA":{"text":"Needed to get out of the rain and this was the perfect stop! All of it was delicious! Go h","useful":0,"cool":0},"gPLDVIe85mgaKI1ep7y0zQ":{"text":"Went on a Tuesday for the $1 tacos and my first thought upon seeing my order was that I wa","useful":1,"cool":0},"xgLRPplIx59u-viwyyPh3Q":{"text":"The name Tacos and Beer is what brought me in here. You can't go wrong with Tacos and Beer","useful":1,"cool":0},"CxdUwHlJ0i1EX5Wbzq9unw":{"text":"The tacos were the street vendor style I was hoping for and they were very good, I recomme","useful":2,"cool":0},"rMmPb5OdRgH8GGiQDo7Y-g":{"text":"Great for Taco Tuesday's with $1 Tacos all day and strong drinks! They were very accommoda","useful":0,"cool":0},"Un0DXWYVPTyuiTRfddLSlw":{"text":"For what it is worth, this place is pretty decent for the kind of tacos and Tex Mex that t","useful":0,"cool":0},"QQg-UUQ9BAzAqWfVUapvCQ":{"text":"I've never rated anything on yelp nor any other reviews platform. And while I'm enjoying t","useful":0,"cool":0},"VSgGuwiXDHHaOn09HrxQIw":{"text":"The wait for this place was extremely long for tacos that reminded me of lunchables . Oh a","useful":0,"cool":0},"UMNeXpbliQqtvzdhbmOMQQ":{"text":"No, just no. Terrible terrible service. Seriously the worst I've ever had anywhere. Ignore","useful":0,"cool":0},"_xhO5Aw1YCkd21Tp2V3Tvg":{"text":"The place is loud, so service will suffer since you can't hear your waiter/waitress and th","useful":0,"cool":0},"GxL57ZTbb_go9iq4Vtc1qQ":{"text":"Service is HORRIBLE. Went in for a late lunch around 3:30 so not even crowded. Sat at the ","useful":0,"cool":0},"PVKgeZHXWthJwVviKpBhnQ":{"text":"I visit for dinner.\nServer was helpful to menu n drink.\n was good .\nFood was ok.\nThat nigh","useful":1,"cool":0},"aFVwcY-Yr8eMagJHxH7Nvg":{"text":"Arrived 4 pm on Cinco, ordered waters on an 85 degree day, 2 large swirl margs, nachos. Se","useful":0,"cool":0},"h3_MdMrRGf2AeXZEmb5kPQ":{"text":"It's just a coincidence that I stopped into Tacos & Beer while I was on my way to The Aven","useful":1,"cool":1},"2ig7JeCxWme_9Acis470Gw":{"text":"Man the shrimp tacos were bomb and the drink and service from my girl jasmine were amazing","useful":0,"cool":0},"7xSCthWDlFQP99ALr73UYg":{"text":"After my friend and I ran a half marathon we figured we should get tacos and beers.  They ","useful":1,"cool":1},"XYSW5t_w5TsFcX2hp3Ay-w":{"text":"I've been here a couple of times with friends who live nearby.  It's a favorite of theirs.","useful":0,"cool":0},"Y7lMII-COWZncp4waM12Og":{"text":"I enjoyed the food and the margaritas, all delicious. The wait was slightly long but we di","useful":0,"cool":0},"pzcWvqC24HJ3u8-ZZfWlqg":{"text":"Great margaritas, love the atmosphere. Tacos are delicious and salsa has some kick. Queso ","useful":0,"cool":0},"L5rB_-7HkK_70pMcVSkp6w":{"text":"WORST EXPERIENCE IVE EVER HAD. Their servers are very POORLY trained, don't know their men","useful":0,"cool":0},"0SPPetuCwQ7QG7oJOC8kBg":{"text":"If I am discussing food the tacos are the closest to the tacos I get to street tacos in Me","useful":0,"cool":0},"syLOvnv1hFMhIvslWfGnFQ":{"text":"I was visiting NOLA for a few days and staying really close to this place. We came here fi","useful":3,"cool":1},"xcSewdsdWId1B2dIlBbFTg":{"text":"I wish I could give 3.5 stars. First, I'll say that our waiter here was dynamite. Super fr","useful":0,"cool":0},"4SoJnqfDz4Ar29Iai4jZwQ":{"text":"I love this place, tacos great, beer great, and service was amazing, our waitress Blair wa","useful":1,"cool":0},"jcKuig5JwaHbVV1po4Wm6A":{"text":"I've been here at least a dozen times. They're good about having Groupon specials and also","useful":4,"cool":0},"KC_qNDchYuITUmQj9OlBFQ":{"text":"We were staying just down the street and saw the sign for tacos and beer and we were excit","useful":0,"cool":0},"88nlTjiGH__1bjUHGXqGSg":{"text":"Colin is the best waiter there. I had a splendid experience. I'll definitely be back for t","useful":0,"cool":0},"NaNEjjpeIC-5nUNn04LCfg":{"text":"We were excited for a Mexican place walkable distance from our hotel and unfortunately thi","useful":0,"cool":0},"TOhq1riCjOw0rxEYr8izCQ":{"text":"Delicious!! \n\nI've only ever been on taco tuesdays, but the one dollar tacos and the happy","useful":0,"cool":1},"7I6UU654ytnAGhVP0aefrg":{"text":"I had a great time here for happy hour- awesome drink and taco specials. Portobello tacos ","useful":4,"cool":1},"v_3j6s8mKiZPytfgVRoqlQ":{"text":"Wow, hate to give this two stars because in the past I've had good experiences, but tonigh","useful":1,"cool":1},"BydGcwtcX-opLPRgHpVCTg":{"text":"The food was pretty good I would definitely go back . Our server was awesome. He was very ","useful":1,"cool":1},"4jXqIHgZeYx13P6yTeJXew":{"text":"The guac and salsa were pre-made out of a jar/plastic bag respectively. The bartender was ","useful":0,"cool":0},"A0N48gAQz7EPwY0P1gzYcg":{"text":"So. Good. I was excited to see a Mexican food restaurant as a tourist, because it was what","useful":0,"cool":0},"QBf44gzADHhRu-QNFSerEw":{"text":"Love love love it here! Nice spot off of st.charles service is always quick and awesome. D","useful":2,"cool":1},"edFy_Soo27fflM3a10F8rg":{"text":"Amazing service and staff. The aura around the street is to stop for! The food authentic a","useful":0,"cool":0},"DPtUOCuDgVFCJwloEDoJ-Q":{"text":"I always get the brisket quesadillas with a side of queso to dip them in. Pair this with a","useful":1,"cool":0},"172PtBJfi1fgGS5-S5QerQ":{"text":"Wonderful food!!! We had Tacos, Burrito Bowls, La Potana, Hotdog/Fries, Street Tacos, Beer","useful":0,"cool":0},"ZX9V6C9vl1Agv9u3R2z2_A":{"text":"Not good.  Very disappointed.  It's hot with the doors wide open and full of flies.  The s","useful":1,"cool":0},"qlEyPJ5OILyZSdL-1yDutg":{"text":"I lovvvve coming here. The drinks will take you above and beyond! The large size is enough","useful":0,"cool":0},"ejp5As0ksri8ZirvFur9GA":{"text":"Food is not good at all!   Refried beans and queso were runny!  Waiters are meh!  Waiters ","useful":0,"cool":0},"TNQPud-PZ4CXQbUw3lSgtQ":{"text":"Called ahead to make sure was vegan items but when we tried to order there were no greens ","useful":0,"cool":0},"idVaATsVGkc34-YCxQq5yg":{"text":"Elizabeth was the best waitress! She was fun and kept up with our bull shit. She need a ra","useful":1,"cool":1},"YXY8IpwcKGJStvQsPphT0A":{"text":"This review is only on food, as we decided to order take-out... After reading other review","useful":1,"cool":1},"L_yHUQVU0jsY37zIRuWPoQ":{"text":"A friend recommended this place which happened to be on the parade route during Mardi Gras","useful":3,"cool":2},"3UBSF7vQdNvX70rZ8h7-aQ":{"text":"I'm so glad we chose this place tonight! Johnalvin Hayes provides us with exceptional serv","useful":0,"cool":0},"we3wTfVpiiyR3Wz_9ZVbnw":{"text":"Check your order carefully upon receipt. I ordered chicken mole enchiladas via delivery an","useful":0,"cool":0},"EXvWiCeFP0ZAmHcJeOnU3g":{"text":"We just got in to town for my sister 30th birthday and got some tacos from the place next ","useful":5,"cool":1},"ZtVPj-LTFQbbGDBBO6bkfw":{"text":"Great tacos and atmosphere! Go see Kay she is awesome! The carbs asada tacos are amazing a","useful":0,"cool":0},"OIc3c0IyQZ8ph-QQ3u8ePw":{"text":"I'm not a local; I'm from the West Coast where tacos and taquerias are a staple. These are","useful":0,"cool":0},"xKBZpoGtHwqdvL1a0ON6NQ":{"text":"First time trying this place surprisingly, it wasn't all that honestly shrimp could have b","useful":0,"cool":0},"BI_6OOwoXXKu-qVXPr19Ow":{"text":"Delicious food, fast service, great location, good drinks...I highly recommend. They were ","useful":0,"cool":0},"hCWO6Ib6uZ-pTHN_t9u-nw":{"text":"This place was a pleasant surprise, best 2.50 beef tongue taco and shrimp ceviche I have h","useful":0,"cool":0},"PJkPpczXIiBT3mFtCgjHKA":{"text":"i am disappointed in tacos and beer because my family and i went to nola recently and i lo","useful":1,"cool":0},"Dq3E-RIW93FT_mo2phmseA":{"text":"I recently visited tacos and beer and found them to be    Prejudice Very rude    And un un","useful":1,"cool":0},"KkbvEMfuqJTBc61meIu4mQ":{"text":"The food tasted like microwaved garbage. I will never go back.\n\nLa comida estuvo malísima.","useful":0,"cool":0},"gY4J1fSn3UloF3xmKgniDw":{"text":"This place is pretty awful. I went on Taco Tuesday. it was super busy which i understand c","useful":6,"cool":0},"mbOEbYIgucnhaOXmGXbgmQ":{"text":"Black people not welcomed !!! I just let the restaurant and I had an issue with my order a","useful":3,"cool":0},"gqsMMvl1Jacx1D54eq-wbQ":{"text":"This is for a to go order of nachos and tacos dorados.  The drive home was less than 10 mi","useful":2,"cool":0},"C2A43o8qRsgUg-hTBPdJig":{"text":"Pretty good enchiladas. I ordered the carnitas enchiladas with red sauce. The meat and sau","useful":0,"cool":0},"lr8YdFfMeT1ONHWeoA4F6Q":{"text":"I have been staying a nearby hotel while in town for work. Stopped by this place on my fir","useful":0,"cool":0},"6NYVtEV03FcsXBrfHgJdvg":{"text":"Came here during lunch hour for Taco Tuesday.\n\nTacos are all $1.00 except for the seafood ","useful":3,"cool":2},"vCPdynAE7ErWjYiEuTcaAA":{"text":"Looking for a delicious, inexpensive, place to eat in New Orleans??? Well look no further.","useful":0,"cool":0},"iU4tKfqB2ErO7O8iBwfqcA":{"text":"We loved it. We were staying at the Wyndham Avenue down the street. My niece and I decided","useful":0,"cool":0},"PgK9RdY4PLuJ4ZaFFaWB1w":{"text":"Granted they were understaffed with only one waitress. However, I sat a a dirty table for ","useful":0,"cool":0},"Xclf0dI2NopE8Z5M31aZrg":{"text":"I usually love tacos and beer, consistent dank tacos. I even waited tables there when I wa","useful":1,"cool":0},"uYo0gdL4v5HrUzcsXNfw1Q":{"text":"Jumped off the street car for  $1 tacos.  These are authentic street tacos. Salsa was tast","useful":3,"cool":1},"-rNi6CJtjJugvmG6nSH-_Q":{"text":"I went tonight for my birthday. & the waiter was very apologetic for taking long to get to","useful":0,"cool":2},"At87FGRIRi8Ssrbl2zc3iA":{"text":"Nice vibe. Lines are long on Tuesday's.  Queso dip is really good.  Located on St. Charles","useful":1,"cool":0},"bM3rJduJIlC2XU9B4NMZ_A":{"text":"I went to this area to eat somewhere else, but they were closed and I noticed the large cr","useful":1,"cool":1},"011_h7OZ7E2w_j8kqjBIdw":{"text":"Terrible service. Doesn't treat all customers equally.  I would not recommend this restaur","useful":1,"cool":0},"K3QrrfHRttAZ7OOFL0Vthg":{"text":"Love love LOVE this place! I have ate here several times and every time is has been superb","useful":2,"cool":1},"19dB5fS42lUXzo69P5ao7g":{"text":"I've been  wanting to stop in here on a Tuesday for $1 tacos! My coworker and I decided to","useful":1,"cool":0},"SpCe-beYZ7f6Xp5Vbpvrtg":{"text":"We had multiple items off the menu. My daughter had the big a$$ burrito, I had 4 tacos and","useful":0,"cool":0},"LiVFUNCIf0iJaiu5dxulJw":{"text":"They put too much cilantro and onions on it and it is all you can taste nothing else the o","useful":0,"cool":0},"OQcJmj_Iq_wE_I7CsmO6ag":{"text":"A disappointing experience, overall. While the guacamole and cheese dip were OK, the servi","useful":1,"cool":0},"gTHj1BhIQClZDouLrJOOMA":{"text":"Paid $30 for a \"pitcher\" of \"frozen margarita\". 1st issue: it was listed for $22, and ther","useful":2,"cool":0},"GUjt_s4M4iTipM4q2wPbXg":{"text":"This spot used to be great. However each visit recently has been more disappointing than t","useful":1,"cool":0},"0Oqeuc3u17hzQdVsCCEgIA":{"text":"I have been to tacos & beer only one time before this and while taco Tuesday never disappo","useful":0,"cool":0},"tfE-envPJPW3KA6bm6hIzw":{"text":"We visited because this was my daughters choice of venue for her small birthday gathering.","useful":1,"cool":0},"wZfz3bfbtp8vuVkenkhgUw":{"text":"Tacos and Beer is a great place to go to for a cheap and good meal. The service is good an","useful":0,"cool":0},"FHqsB07DBCWlzlG8PpAmDw":{"text":"This is our second time here and we won't be back. Food is just okay, although pricing is ","useful":0,"cool":0},"pbAB6NmCBFbCCqLYAoO76A":{"text":"This is a hidden little gem on st Charles street prices are great.had tacos and wings  the","useful":2,"cool":0},"GMEjlLMCTk3bLBLgnmfbSg":{"text":"The customer service is definitely not like what everyone says! Our waiter, Justin, was ni","useful":0,"cool":0},"0lcVu9_z3tP787MlqceZsA":{"text":"I only wish I was in town on Tuesday because they have a $1 Taco Tuesday special. We got t","useful":0,"cool":0},"apmcyUGskkOGjUq0p6iHxA":{"text":"Food wasn't bad but wasn't good either.  They could do a lot better. Please turn the volum","useful":0,"cool":0},"9wnXuksEVSbAVIW_BZKEPg":{"text":"Great food and drinks! It's always consistent and an excellent go-to! Their Big A** Burrit","useful":0,"cool":0},"sDdMthmqStXzaKYznOMYVA":{"text":"Packed for Taco Tuesday,  so bring your patience. Worth the wait. Top-shelf margarita serv","useful":0,"cool":0},"79gFpVXLganVab1WA9uweg":{"text":"who charges for extra sour cream? how are you a full service bar but you run out of pitche","useful":1,"cool":0},"oKCeQQzJBvPiwQe_N_hJ0w":{"text":"WORST HAPPY HOUR our club has been to. First the $3 house margarita has little taste and e","useful":9,"cool":0},"TlVH-g_bA6b9bVbgDv_O3w":{"text":"Won't come back to this place EVER. Me and my fiancé arrived there at 10:45 and got on the","useful":0,"cool":0},"McRkI02NpF95QZI-oVzyUw":{"text":"Just had dinner at Tacos & Beer and and I have 2 words: bad & bad. Lousy food and even wor","useful":2,"cool":1},"O_P5f_rDceFFzbaVKj_V0w":{"text":"All I'm gonna say is that the bartender shouldn't be in customer service. Rude, asked me 3","useful":0,"cool":0},"RALRndlZ05DpmO7Wvde8mw":{"text":"Burritos and rice and beans should not have carrots inside. If any, carrots should be tran","useful":0,"cool":0},"cNu7LQUiAz5jeWrnWC1ONA":{"text":"If you are from Cali then you know good Mexican food is hard to find East of Utah. But thi","useful":0,"cool":0},"FtdJBTCSsr9zBS4QHLzkjw":{"text":"The food was amazing!! Birria tacos were all I had hoped for and even the cheeseburger sla","useful":0,"cool":0},"1rHuuR8km9xHcsj7vxQzWA":{"text":"This place is so close to my house, it would be a crime not to try it. I recently grabbed ","useful":2,"cool":1},"v-tne2rFAtjzdnMYH3E3pg":{"text":"Omg!!! This was sooo Delicious!!!!! We literally tried a bit of everything! The guacamole ","useful":0,"cool":0},"QZhOjp-LZpeqAI4ep_-KPw":{"text":"It has taken me a long time to rate Tacos and Beer only because I have yet to get a feel o","useful":2,"cool":1},"ErqySofFo7VC8kxC-oB5Gw":{"text":"Being a college student tends to be expensive and at times it is hard to treat yourself to","useful":0,"cool":0},"4E_Qs5DdVzUhy4TQCnMqnQ":{"text":"first time. ordered the family pack. 20 tacos. this was an order placed as a request from ","useful":0,"cool":0},"Qzts1frgz70t-wJK635ffA":{"text":"Loved our experience on Taco Tuesday! They even let us set up a birthday table and Varsha ","useful":1,"cool":0},"bC5UYDBR0BERaJxu24g89Q":{"text":"I've been having the time of my MF life and livin it it the best way at Tacos and Beer. Ca","useful":0,"cool":0},"PEsirwA_wlpR1xRhZP31kA":{"text":"Came here spontaneously with some friends to grab dinner, as it was one of the few places ","useful":5,"cool":3},"FZk8Kz8yLzlzJd5tJNpALg":{"text":"Awesome and best service! Good time for drinks with friends! Highly recommend!! Vivek is t","useful":0,"cool":0},"xpBcQSCL-Ybca12-uunLzA":{"text":"The service was terrible, it was overpriced and i got food poisoning. Please avoid this pl","useful":0,"cool":0},"2k5tmeTMFm1DfmyXE2U0Vw":{"text":"To be clear upfront: the two stars given are strictly for the few good employees who alway","useful":2,"cool":0},"nytnCta8onsAQRYOCoWgEg":{"text":"Had such a great time drinking and dining at Tacos and Beer on Taco Tuesday. It is definit","useful":0,"cool":0},"kyGu18izwFj8lr610WKzEw":{"text":"We went for Taco Tuesday! $1 tacos excluding fish and shrimp. The tacos are good and but s","useful":0,"cool":0},"44437j6-XsJyv1HxNpCjIg":{"text":"Ok the food is ok after a long day. I mean $1 tacos Monday's and Tuesday's how can u beat ","useful":1,"cool":0},"uUEC2sAig8kzopBy2wTGVQ":{"text":"The day Taco Tuesday officially died for me \n\nI have been coming here for quite some time ","useful":1,"cool":1},"yxVecL0IzXkn8aGt6wTvpA":{"text":"AVOID $1 TACO TUESDAY\nEven my waiter said that the crowds can get surly with drunk regular","useful":5,"cool":0},"tWr_kPtTFPKvCqlg_JQpNA":{"text":"I've been coming here for years since college in Nola and it really is the best place for ","useful":0,"cool":0},"it3BJhi8qTGRbyMRJSgBzg":{"text":"WARNING!!\nFood not fresh and the owner is clueless and very unprofessional wen told that t","useful":1,"cool":0},"SjwBM7or0dk0ikx2Fh1IpQ":{"text":"Dinner was fine. The service could have been a little better. Food was served hot and did ","useful":0,"cool":0},"ekzGox3W8NMJm49MZZZW_g":{"text":"Let me tell you when I say these tacos were the best, they were the BEST! Get out of your ","useful":1,"cool":0},"aA689MRLcD8_umDsYR3adQ":{"text":"This place is busy, so don't expect an \"at your every whim\" waiter, however when they get ","useful":0,"cool":0},"FpnYwonsYO9cUyFSIb2ABA":{"text":"This spot is so great. We've come a couple of times and me and the kids enjoy it. \n\nLast n","useful":0,"cool":0},"pcQt74spH5-5aWKOxcqpcw":{"text":"First time coming and I had to say I was NOT disappointed! Taco Tuesday went something lik","useful":0,"cool":0},"BilAtXnKyW61_aeD0VvEtw":{"text":"I'm a little surprised this place was rated only 3 stars-we thoroughly enjoyed ourselves a","useful":3,"cool":1},"1Ha6zJ05xNll1KD3DVGBmg":{"text":"Food and service was excellent one of the best margaritas I've had. Debbie was awesome as ","useful":0,"cool":0},"tjkiIQSM8WG--XXzCjpGsA":{"text":"This is a new review as of 4/3/21.\nI ordered TWO nachos and TWO quesos on Uber Eats. Once ","useful":0,"cool":0},"PHroM-4Jy-keiXkDhVgqCA":{"text":"Went in with an open mind and an empty stomach.  Was greeted and asked to select my own se","useful":0,"cool":0},"4hjdEo5lS2alDSaNZF04Ww":{"text":"Dropped by Tacos and Beer during my weekend bike ride for a nice cold beer. These guys are","useful":0,"cool":1},"88HOWCGBRdtSVR9svsMKvg":{"text":"We've been to Tacos And Beer a handful of times and we've always had an excellent experien","useful":0,"cool":0},"XI6A2x0aB2XyjrwRRCZDwA":{"text":"The worst service ever, every time. The food is ok but just barely worth the dollar on dol","useful":0,"cool":0},"DQfKSoaI8F4wts4pnewEtw":{"text":"Great taco Tuesday! $1 street tacos and $2 Bell's beers, what more could a girl ask for. H","useful":0,"cool":0},"cTOX3UFL_i5Ro_0QwQZ71A":{"text":"I was looking foreword to having a margarita when we arrived and was told that it wasn't g","useful":0,"cool":0},"o_TAZXXzZ2cxif2mY6Q2bw":{"text":"Get your tacos here on Tuesday!\n\nAshlyn was our server and took amazing care of us. Taylor","useful":0,"cool":0},"FpD-hw7UrH06-tnFivgsRw":{"text":"While visiting the city last week we stopped in on Tuesday for the $1.00 Tacos.They were d","useful":0,"cool":0},"SKo0VkqiXRw1v8c8MFX5Dg":{"text":"Will preface that I love it for $1 tacos on Tuesday, and friends got takeout with 12 tacos","useful":1,"cool":1},"Be7bwFOrfYZPtuHOZzTYmQ":{"text":"I've been to Tacos and Beer many times.  Food's good and service was fine.  Recently (a we","useful":0,"cool":0},"sxnQWcuIUKhpmcjW1N5RIQ":{"text":"Stopped in for a quick lunch, wasn't bad food wise and the staff was ok but overworked a l","useful":1,"cool":0},"Tw9TIpdOpCA4snFLBTRoFA":{"text":"Today, I met my husband uptown for some tacos. Ever since the Top Taco fest, I have been t","useful":3,"cool":3},"-OHhXCraTt7yTXX7afEXlA":{"text":"Wasn't to school in Southern California Los Angeles USC. The best tacos I found there were","useful":0,"cool":1},"CSPOmXdw4sNwhV4Qj19ekw":{"text":"Omg this place is bomb af!! Had Angel serve us and she knows where to steer the horse. We ","useful":0,"cool":1},"veoXaUu_2R_BBqkhKrDokA":{"text":"Really cheap happy hour deals. $2 fish tacos, $1 tacos M-F from 3 to 6. I've been here two","useful":3,"cool":0},"Kk1q9ofEGOrZiPDeYGBThw":{"text":"Good Food. Nicely Seasoned. HUGE Margaritas. Service a little slow. Might have to wait for","useful":0,"cool":0},"ljcqCUaMLzgQB5dylswwRA":{"text":"Great spot...dollar tacos for Taco Tuesdays! Had a bit of a wait but it was worth it.  Wou","useful":1,"cool":1},"o80a-WbQ2mZ1nk5RSvuSZw":{"text":"Oh my this isn't your typical taco joint.  Ok well it isn't my typical hole in the wall ta","useful":2,"cool":1}}