{"kztevxwrpYjrI1qKICibSQ":{"text":"Thoroughly enjoyed the fried chicken. The greens were excellent. Great service. We ordered","useful":0,"cool":0},"sN5NzXuPi6jynXNEIQY1Dg":{"text":"This restaurant is quite the little gem just at the beginning of the French quarter!  Huge","useful":1,"cool":0},"gQkrvDxi0Xw0vdU0PB_0JQ":{"text":"Absolutely delicious fried chicken! The crust was so flavorful, as well as the chicken moi","useful":0,"cool":0},"3kp_fg-ANESQncozoIxBMg":{"text":"Went for dinner last night. Hanger steak did not disappoint. Amazing dish! The bar tender ","useful":0,"cool":0},"jcgTIam6guiRzya9za04wg":{"text":"Excellent food, great staff, and late hours. Jalissa took amazing care of us--she's the be","useful":0,"cool":1},"ECIHPzCyKgii1HYjVlqbFg":{"text":"This place is always a stop when guests are in town. One of the best daiquiri's in town th","useful":0,"cool":0},"5u8m9HAzr_Mqqsg8IKzMaA":{"text":"I rarely give low reviews but when the food calls for it then it has to get it. The positi","useful":0,"cool":0},"bM9sQa6y-pj_zKpoVsRkRw":{"text":"Great lunch po'boys! Had the shrimp poboy and my husband had the cheese steak that were ex","useful":0,"cool":0},"WwI19ISv7IxemEqJhrHW0Q":{"text":"Edge of quarter bar that has no reason to be as good as it is.  They offer table service w","useful":0,"cool":0},"3eToIEogK2xI1aB1YSKnUg":{"text":"St Lawrence is truly St AWESOME!!!\n\nCame here for a late supper on a busy Saturday night a","useful":1,"cool":1},"iGrNVcoeMY9SlR-tROcn7g":{"text":"Food does not disappoint...the value and quality are top notch. Came in looking for wings ","useful":1,"cool":1},"NJsgCEFaLmtXoRJ6ONwWMQ":{"text":"Saint Lawrence had great drinks and the food was outstanding. The Gumbo was very tasty. I ","useful":0,"cool":0},"jYZ2-e9B_TKUw2HDpSj1xw":{"text":"Good for a more casual meal in New Orleans. The food was very good, service was a little c","useful":0,"cool":0},"EapOPSNy54cli9IKr0hWvg":{"text":"Went to have lunch here today based on the reviews...ordered a simple BBQ cheese burger co","useful":0,"cool":0},"WufCyG1YndGWnYGHcIt9mA":{"text":"Everything we ordered was amazing!  One friend mentioned her meal - the Crawfish Cocktail ","useful":0,"cool":0},"neSlMapMvF4HiPhMbFuKIA":{"text":"Sooooooo....im an active duty Marine and this is my 4th work related visit to New Orleans ","useful":1,"cool":1},"51QYC5GxQ55PB6u0jvtCVQ":{"text":"I popped in here during my Running of the Bulls weekend of madness.  It sort of gave me a ","useful":5,"cool":2},"pjeugHHuT4caBQrc34GBLA":{"text":"St. Lawrence is a clean, friendly bar with a short but interesting menu (with multiple veg","useful":0,"cool":0},"gIiN1pDFV_1rNrPqPyzHsg":{"text":"Just completely amazing place. Very good selection of beers and diverse in cocktails. But ","useful":0,"cool":0},"TfgHTuv1kjA3o7JWegvbEQ":{"text":"Came by for lunch with friends and I had the fried chicken SOOOOO GOOOOD! get it with the ","useful":0,"cool":1},"1VVVIyKINs9gF_pbJMCdPg":{"text":"This was my fourth night in NOLA and thus far I had had three amazing meals! After reading","useful":0,"cool":0},"CMAOGHMvKQWAVQhcBRR4lQ":{"text":"HO-LY Yum! I had both the specials, the sweet potato soup and the baked brussels sprouts -","useful":1,"cool":0},"9vXXG0tKVLvb6535JojE4g":{"text":"Look, if you are gonna call it a \"gastropub,\" in New Orleans, of all places, you have to m","useful":0,"cool":0},"T-BEj7OptVLb_BNk7aPpzg":{"text":"What a fun, friendly place! Y'know, I'm not normally prone to saying, rather, *appreciatin","useful":13,"cool":9},"CJRey_to415cXVZ6XabytA":{"text":"Spectacular staff, great food, great beer selection. Jay was our Aladdin through a magical","useful":0,"cool":0},"wvWjAqSC-TWcd_6s34M4uA":{"text":"This place is definitely a hidden gem! The valet at the hotel said that he had never heard","useful":0,"cool":0},"lAMAs9eiGkINaU-pUN1Uwg":{"text":"This was the perfect place for me to start my day on vacation in Nola.  I came in around n","useful":0,"cool":0},"vCkaqU0jO31pezCzGQGooA":{"text":"OPEN LATE and amazing food! We were looking for a place were we could have good authentic ","useful":2,"cool":0},"6tSYqc7Jmpbb3QLhn6N_eA":{"text":"I almost don't want to review b/c I love this place. Quiet, small, and slightly off the FQ","useful":2,"cool":2},"IYbsvIEqwgmNwiZ53RAlxg":{"text":"Great place! Loved the happy hour until 7pm after a long day of meeting. Great food all ar","useful":0,"cool":0},"W7b31ItyQsU1eW4ejXEngg":{"text":"I went based on the reviews from Yelp and they impressed me so i had to go check it out fo","useful":1,"cool":1},"sWs2N5XiDFV1vjnBct6QNA":{"text":"Needed to eat after a drinking session in the French Quarter at about midnight and did not","useful":0,"cool":0},"F0GLmN37DY7faAn38K8dHg":{"text":"On my recent, and first, trip to Nola, this became my favorite restaurant. I'm not kidding","useful":0,"cool":0},"Gpx9u7HXsQ0BjIOZUnSZSw":{"text":"Absolutely the BEST burger in have ever had in my life!  Homemade onion rings are fantasti","useful":0,"cool":0},"a2u3_TnwZzyZWvfq_u0qpw":{"text":"Hello, Pimms Cup Daiquiri.\n\nProtip: Get the huge one. You will think, nah, the small is su","useful":3,"cool":2},"8WrVnoKldU18oQfvnKQmNg":{"text":"Great food and excellent service. By far the nicest set of staff out of any restaurant we ","useful":0,"cool":0},"y5TtzUnmeHIOtBsctbzpfA":{"text":"Average. Bloody Mary was okay. Had better in the city. Very relaxing atmosphere with good ","useful":1,"cool":1},"p42_Li3uq8vpEfA0xWESGQ":{"text":"If it wasn't so hot in there, they would have gotten 5 stars. The food was incredible and ","useful":0,"cool":0},"4TcOK2LDZz-PZ6IEUtu9VA":{"text":"Not sure why this place isn't given 5 stars only.  It's really a restaurant in a bar. It i","useful":0,"cool":0},"bv2qgQcVhLbq6KR1Vuv69Q":{"text":"As a former French Quarter dweller, I always was short on great spots to have more than gr","useful":3,"cool":2},"ztykrljK1GJynCE8pAdyRg":{"text":"My husband and I decided to check this place out for dinner while staying in the French qu","useful":0,"cool":0},"aTQFqaNwN8vBJodi2S7UiA":{"text":"This place has an amazing vibe from the decor to the servers. Price is consistent with the","useful":0,"cool":0},"fkYI3VSeHJ2EepyJ89l8YA":{"text":"Pretty good food. The specialty fried chicken was just ok. The fries with gravy and cheese","useful":0,"cool":1},"FZv2X9e1meLo1XfSg7Fx2g":{"text":"No southern charm here.  Service was slower than expected considering how empty the restau","useful":1,"cool":1},"N9ZHNZJA4eYYXSR-dcyzHA":{"text":"Obviously, being new in town, I am up for any suggestions from the locals & this one hit t","useful":0,"cool":0},"B4dKO55sJZ-b14nzcrey6g":{"text":"Great food - although price point a bit higher - I think a lot goes into these dishes and ","useful":0,"cool":0},"vG98rw75U7CnQgol5axvcQ":{"text":"Sweet dive bar with good cocktails & tasty food. Order the St. Lawrence to drink & Smother","useful":0,"cool":0},"S7TkzapSwbvGKcQ-LCrO2w":{"text":"Our first visit was to feed a hungry friend fresh off the plane just after the 9 pm witchi","useful":0,"cool":0},"N6NQddezoNSt_9MWdyYCjw":{"text":"Ambiance- 4 stars\nWait staff personality- 1 star\nFood - 3 stars\nTap beer selection- 0 star","useful":1,"cool":0},"tia0l4T9GcZk3NWMJuDPPw":{"text":"A great spot for local & divine food until 2am. We had Mark as our waiter and he was terri","useful":0,"cool":0},"zDkRV_XHsOYVKSNG7VYhNw":{"text":"Very pricey place so expect to pay a pretty penny for good creole southern food. I got the","useful":0,"cool":0},"AVC8m55aUKbC3AbfdPBhXg":{"text":"Probably the best food we had in all of New Orleans. The mac&cheese is amazing and the Bay","useful":0,"cool":0},"ObfcXcZkNTN4qn72V7px0Q":{"text":"From Philly, so I have high expectations. Came because it was a 4 star near my hotel. Was ","useful":0,"cool":0},"b_tZfBrXoLuM-jH5t-3bpw":{"text":"Really enjoyed this restaurant... Seemed very slow for a Saturday afternoon... But to my s","useful":0,"cool":0},"-uFWeMRNkGhq2zU0_WrEJg":{"text":"1st time in New Orleans and 1st restaurant.  We were seated immediately, but apparently th","useful":2,"cool":0},"7GuhP2QUKs4AKtmxkYpvjg":{"text":"Hour and half wait. No steak left on the menu\nGood was cold service sub-par.  Very greasy ","useful":1,"cool":0},"zcrKxS5RmHBIbSJ0S0m6FA":{"text":"We stayed at the Westin so this bar was the first place we came across when venturing out.","useful":0,"cool":0},"cNo7_xMjMpI7xcCrajIJUw":{"text":"My wife and I were looking for a reasonably priced, positively reviewed restaurant in the ","useful":0,"cool":0},"B3WKyjgZ_quS-0CU46s6hg":{"text":"Very good burgers, although a little pricey at $15 bucks. Bartenders (we sat at the bar) w","useful":0,"cool":0},"1vtb9bkpVBtrkZlyMYNIEQ":{"text":"Gots what you need. A notch (or two) above bar food. A great Malbec on their limited wine ","useful":0,"cool":0},"gMWdwoK69sKWUruO_DWILQ":{"text":"Great service....everyone was extremely friendly.\nGreat beer on draft.\nFood is unique and ","useful":1,"cool":0},"nPmrQiQd8I67PNK40oi_rA":{"text":"I was pretty pumped that my friends suggested we grab a late dinner here after a comedy sh","useful":4,"cool":2},"MAM9L6I4xcUC6NYYY0SYng":{"text":"Name tags?!?\nFood and drinks had me drooling...name tags...not so much. What is this apple","useful":1,"cool":0},"q4eR98zDa7wh3MMZEKbcJQ":{"text":"We ordered some food to the room because we were tired and didn't want to walk out in the ","useful":1,"cool":0},"g-v1IP668G3mLhrB5jxOqw":{"text":"I love that the kitchen is open till 2am every night. Last time I was in I had the sausage","useful":4,"cool":1},"uqvNcAix_hW8yo_QJ9-wKg":{"text":"Great location, loved the frozen Pimm's Cup - reLly unique. Friendly and helpful service .","useful":0,"cool":0},"rPkVsDJAAa4P8SKuAijO0A":{"text":"Stellar service! Food is amazing-you can tell the menu is carefully thought out. Bartender","useful":0,"cool":0},"Wb8_COtggEzt8omFeuPxDQ":{"text":"Wonderful! I stopped here with my significant other and had lunch, and it was delicious! K","useful":0,"cool":0},"VnUHp0nOXJqVV-JdKDQKYg":{"text":"Delicious burger and onion rings, excellent service,  and interesting cocktails.  Enjoyed ","useful":0,"cool":0},"nd8L5ZAfDIFvfYEszdKRbA":{"text":"This place has a great chill vibe.  I love the location on the Riverside of the quarter an","useful":0,"cool":0},"69ZcWWteoYqhLiFtzzH4uQ":{"text":"Very lovely and super on top of it staff. The fried chicken is absolutely to die for. I pa","useful":0,"cool":0},"dF7EEOVLNbxcnN0_O30mxQ":{"text":"My awful dining experience happened back in February but I didn't have a Yelp account then","useful":5,"cool":2},"19dfm7hIDQ6jfML8e8x4WA":{"text":"Kayla was awesome! ! About time we found a place that was fun and had much better service.","useful":0,"cool":0},"K2zpCaVB-f0YXPvhlJs2Ew":{"text":"Seriously great grub.  Special \"Softshell Crab BLT\" was huge and to die for.   Wait staff ","useful":1,"cool":2},"la4c9dfOqjQTCwW_9GpOnA":{"text":"I popped in for a quick drink while waiting for friends to join up. Bartenders were really","useful":0,"cool":0},"56vtHWHw1N44NqR_pWqxDw":{"text":"Wandered in after visiting the Insectarium down the street. Shrimp po'boy was crazy good. ","useful":0,"cool":1},"JDGKYK6-31XZvD8hRkBvUA":{"text":"I am a french quarter resident and native new orleanian. St. Lawrence is my favorite go-to","useful":0,"cool":0},"UAbVHcewzbJGO1yd3fJ3Jw":{"text":"Solid 4 stars to this place.  Casual atmosphere. Good service. We actually visited this pl","useful":0,"cool":0},"_4AX6IGbub02xql5rbKWsg":{"text":"My favourite spot for dinner and cocktails. Always interesting conversation at the bar. Ha","useful":0,"cool":0},"T1ka0-iUJHweDF9w-t88sw":{"text":"We walked toward Bourbon looking for a restaurant that looked local and interesting and we","useful":0,"cool":0},"pDLccXj4wggt0ZrVAwmJJw":{"text":"The collard greens are to die for and really good gumbo. We enjoyed the drinks. Nice place","useful":0,"cool":0},"H1zaJTJvj4_49EXE4iPR0g":{"text":"Love the new menu! \n\nLast night I had the crawfish lobster roll; as a NOLA native, I wasn'","useful":9,"cool":6},"UrexCXO5R74AxFXjdmFauA":{"text":"I stop by here with some friends and family to have dinner. I ordered the buffalo chicken ","useful":0,"cool":0},"pGZLAEOE4BgKXho_VbhyIA":{"text":"This place is a nice gem. They have a fabulous selection of beer. The food was really good","useful":1,"cool":2},"LfWdO4vmS6dmqpMhqt_o_Q":{"text":"Came in late night after my shift and had the most amazing dining experience with our bart","useful":1,"cool":0},"03UwXGuDtHScwtY7To7zog":{"text":"The soft shell crab was one of the best ever! Great experience...Pleasant staff, good drin","useful":0,"cool":0},"4upQP6On4I49LHDtcQychQ":{"text":"We came for brunch and I had the Oyster Benedict...it was to die for!!!  We also had the c","useful":0,"cool":0},"4FR70f9S-UEMld60YNzauQ":{"text":"Best of both worlds, high quality liquor and great beer selection. The food menu also has ","useful":0,"cool":0},"18TQicZBmzD6D6ihJc5ZXw":{"text":"Of all the restaurants we tried this weekend, this was our absolute favorite. First, they ","useful":0,"cool":0},"mes0x-mBONj9RtmmDTBzVg":{"text":"I cant believe that I never reviewed this awesome place! I came to NOLA in March for a con","useful":0,"cool":0},"rrhN-_fbnWCJQ15lZ8IRpg":{"text":"Brandon, Casha rock this world! They had a difficult situation with some co workers walkin","useful":0,"cool":0},"62Gsdq79irJwwOzEGermDQ":{"text":"Service was great, however there were mice roaming around. The way they moved around seeme","useful":0,"cool":0},"5zwzKC1hKUCOvCWaJJkxfQ":{"text":"the food here is really excellent. well prepared fresh and at a good prices! check it out","useful":0,"cool":0},"R5W8Sfaka0KhqlpXog7ZNw":{"text":"Upon arriving on our trip to New Orleans, we did all of our research and went to very expe","useful":0,"cool":0},"5PTImjp7TEWeU85UdAlVJg":{"text":"Delicious food!  There was a good variety of items so everyone (including the teenagers) w","useful":0,"cool":0},"AxScxOMAixt1Jsv9_nyMKA":{"text":"Nothing was all that good. After being at many great restaurants the past week this one di","useful":1,"cool":1},"LA6qBeJMVfFGb-R-yhUi2g":{"text":"Very cool location and space. Very friendly servers. Portions are generous.  I had the fri","useful":1,"cool":0},"_b0sTlvOcVwAKYmPHv8IVw":{"text":"Great menu...,even better Late night!  Red brand and rice were fantastic!  The St Lawrence","useful":1,"cool":1},"HZTswS2X72ClpGjsKanHbw":{"text":"one of my favorite places to eat in the quarter. This place has a great menu for both food","useful":0,"cool":0},"rD7joa2Lkfw59bjZSTM-Uw":{"text":"Wow! We were the first customers in on Sunday. Seated by a very nice waiter. The manager (","useful":1,"cool":0},"rktUJ1e-zQeB75BHDMlHQw":{"text":"Good food, good drinks, and the owner provides great service. But you seriously don't need","useful":0,"cool":0},"46zPf40rDm_CHbfDs6KfaA":{"text":"Staying at the Harrah's and read some good reviews about this place. It's definitely a goo","useful":0,"cool":0},"gASrmqro7Jpo7_Aor-qEBw":{"text":"Excellent Gumbo and veggie burger with fries. Service was great meal was hot. Not pricey a","useful":0,"cool":0},"Abak7pHvt9mkmLVM8HxoIg":{"text":"We came in from Fort Worth Texas for a nice short vacation. Friendly, efficient staff. Goo","useful":0,"cool":0},"BqXGhxljSmqnmfnijv_-Cw":{"text":"We popped in here for a quick bite to eat - had the hanger steak frites, the spring rolls ","useful":2,"cool":1},"5ZXmLOHvjBhn9TcB2VvWZQ":{"text":"Headed into St. Lawrence after a long day of traveling and were very satisfied with our de","useful":1,"cool":1},"RjdetnK8UHRvKFle4SiJ_A":{"text":"Heard of this place from a friend and was a little skeptical since it was so close to tour","useful":0,"cool":0},"vHHNa-6YQUEOkecO8DmwyA":{"text":"Stayed around the corner at Westin, was starving and this was one of the closest places wi","useful":0,"cool":0},"c73bosRLX0BlkNcdPvlsiw":{"text":"St. Lawrence is an amazing little find.  It is a quaint little bar restaurant, with upscal","useful":1,"cool":1},"buXI5R6jKOnq5v3mLIqE_g":{"text":"If you're a vegetarian visiting New Orleans, this place is for you. I spent one evening li","useful":0,"cool":1},"GdHJUy27YvsE05i4HW3DCw":{"text":"I was in the French Quarter and happened to just stumble upon this place at lunch time. It","useful":0,"cool":0},"n7TBJHej5M2Wp8-y3-ef7Q":{"text":"This place has really nice and clean bathrooms. Unfortunately I'd had one too many sazerac","useful":0,"cool":0},"yCOue9XSS2R_LYQol0BPRw":{"text":"We were walking along the river and it was just coming up on noon.  I hadn't had nothing b","useful":2,"cool":0},"yTS6oUkjo5iyolz78BK6Vg":{"text":"I had the Saint Lawrence fried chicken and it was delicious. The chicken was not greasy an","useful":0,"cool":0},"sfmgd6ocvTd4Q9ES9mpEmg":{"text":"Great food, great first night in New Orleans. The service was awesome and were there at th","useful":0,"cool":0},"7LPIfKfJA1DOXq2szyre5w":{"text":"We came here on Sunday night for a bite to eat because it was close to our hotel and every","useful":0,"cool":0},"k5TDh1gW0Qp-ilNphKI_gQ":{"text":"Too hungry to continue, we stopped here because the specials looked interesting & creative","useful":1,"cool":1},"JzkMAhimGcZFK8rGsiyXTw":{"text":"Love this place. Favorite bar that's close to home that have consistent amazing food. This","useful":3,"cool":1},"JfQTy6o8OpuJYyakmNs5Sw":{"text":"Excellent cocktails and food. A unique spot in NOLA (and vegan friendly).","useful":0,"cool":0},"4O7vyrycP2DkMN8O1NECcA":{"text":"Chicken was undercooked. When brought to the staff's attention they apologized, and put in","useful":0,"cool":0},"RUB70sPnGQvR5nPKply5Pw":{"text":"Open til 2 am. Our last dinner in Nola. Had the fried chicken/mashed potatoes/collard gree","useful":0,"cool":0},"19dZMWU9mFJIYI7jzY2cZw":{"text":"This place is a sign that NOLA is becoming saturated with places to eat.  We love food but","useful":3,"cool":0},"RDzWgrAnFlcX4wfzT2qIqg":{"text":"Stumbled across this place while in town for the Essence Fest. I noticed that they had a s","useful":5,"cool":1},"eg4YBnzOeABbcozEHYyzcA":{"text":"Great food!!! Terrible service, and that's the only bad thing I have to say. I had the dai","useful":2,"cool":0},"7sq_wWCw0HlujJRPj4Ebfw":{"text":"Cozy & Inviting! A nice clean bar to relax with good friends & music can be hard to come b","useful":1,"cool":0},"MYtzuld1HA23lkmJ5w-Aew":{"text":"Great service... we thought the staff must think we were undercover food bloggers, they we","useful":1,"cool":0},"-ASrwM9k-L2C2lVQjw77TQ":{"text":"Excellent. Pimm's Cup, Cheese steak sandwich with side of potato salad (most places just a","useful":0,"cool":0},"E4lzNAMt_8T-xhMxoyYm_g":{"text":"First visit to NOLA. Starbucks guy across the street recommended this place. Awesome choic","useful":0,"cool":0},"yFOe4qX3HicZg4EOGVT2ZA":{"text":"This restaurant was great! There were three of us, we had the red beans and rice, fried ch","useful":0,"cool":0},"loeGerBWF0XgEEeaGmSCHQ":{"text":"The food was FANTASTIC, ESPECIALLY the potatoes au gratin. I ordered the steak and it was ","useful":0,"cool":0},"a3IqWb_1TcMfTq7DZ3_35Q":{"text":"St. Lawrence is the best place to get a 5-star meal at a reasonable price! The owners Jeff","useful":0,"cool":0},"TPgQQAMnWtxnSmdEFbDJKQ":{"text":"I placed a delivery order through yelp. It got a delivery time. 50 min later I received a ","useful":0,"cool":0},"2msyDjRi4Ug3XNmBAXWRqw":{"text":"We got the BBQ Cheddar Jalapeño burger and onion rings and split it.  It was delicious and","useful":0,"cool":0},"KZXh3otUJtyXDB3o7RYGQQ":{"text":"I absolutely loved this place! Didn't eat, but the drinks were amazing and the bartender w","useful":0,"cool":0},"R6p_AxxIn41rXHoT8D6yrg":{"text":"Really enjoyed the food. Our waitress was amazing. She was kind and gave us some great sug","useful":0,"cool":0},"BfYADt6iR60q0jK_-astEA":{"text":"Just got into town and stumbled upon this awesome restaurant. Nice vibe, great service and","useful":0,"cool":0},"tLLa4dN2EQPQpN5yeWR6XA":{"text":"Great atmosphere, unique and creative drinks, large variety of beers, delicious food and t","useful":0,"cool":1},"XM_HkH__jFulaeUYWhg4Ew":{"text":"In a word, lazy. I had the Creole Pulled Pork, my date had the Adult Grilled Cheese, and w","useful":1,"cool":1},"tp1-p2uHDG44qyIEbuMmAg":{"text":"We had a late dinner here when we arrived in New Orleans. After a delicious cocktail, I de","useful":1,"cool":1},"nWRUPIYjS8Y72Pzw4FF6Iw":{"text":"Was hungover in bed after a day of drinking and decided on comfort food to bring me back t","useful":0,"cool":0},"9MzZZLXsMaKyO46YPSiQlg":{"text":"Food: 5\n\nService: 1\n\nWe came here for my friend's birthdays. We all ordered different vari","useful":1,"cool":0},"YxoFuwtkXOjSteGYoESIMw":{"text":"Good gumbo and collard greens.  But the bar was sticky and and the bathrooms were unclean.","useful":1,"cool":0},"stHKfjM1QbIkGyfiVHAxAA":{"text":"Great spot for lunch! Fantastic sandwiches, Wings, Pimm's Cup daiquiris. A little pricey, ","useful":1,"cool":1},"2jm9axzLOVgJz4N5i_sOvQ":{"text":"With an nice assortment of entres for the non-seafood lovers in our group, we were really ","useful":1,"cool":0},"AnnNSjC99odiOBiVrgyjiQ":{"text":"I love this place. I am visiting New Orleans for a week and have been here twice. Great dr","useful":0,"cool":0},"b6WMMczfqfOa5Wc28tfDPQ":{"text":"Pimm's Cup daiq was super delish, as were the hush puppies, \"spring rolls\" and Turducken b","useful":0,"cool":0},"SRL5PBKcWZIyjl4acH5wfw":{"text":"We love this place and if we lived closer we would frequent weekly.  The beer selection is","useful":0,"cool":0},"K7W65x0wjWm6Y0SiXOcJqQ":{"text":"Try 1/2 a star.  Only because we were there to see my Ravens win the SB.  We had the worst","useful":2,"cool":1},"1GAXJi2zpI75hMWmnjLEbA":{"text":"This place was solid.  Good food.  Decent atmosphere.  We saw the house mouse that other Y","useful":0,"cool":0},"giy4GdT_x9BpFvgMNKwCQw":{"text":"Holy smokes. This place is tiny bar/pub. When I booked I thought it was a fancy restaurant","useful":0,"cool":0},"jVe65WTBGRP5qtHe5dPPhw":{"text":"Wow. We had a great lunch here. The menu wasn't overcrowded but the selections were varied","useful":0,"cool":0},"F6LRlFgy6huZAS7rIHRx6w":{"text":"Stopped here on our late night arrival in NOLA. We live nearby and like to try new spots. ","useful":1,"cool":0},"LHrYeuDNHtOiNnSMG5Kong":{"text":"This is my fifth trip to NOLA and my first time at St. Lawrence. I have to say it is my an","useful":0,"cool":0},"kO9SHwdmCZLMavgtGI-A1w":{"text":"My friend and I stumbled upon this spot on Saturday, and had an amazing meal.  We were so ","useful":1,"cool":1},"5eT2kuv41IohyRFWFmeKVw":{"text":"Had great service at the bar from Casha and Trace... really good beer selection and some g","useful":1,"cool":0},"lsj_1IdL-eBnl0jIZf4EaA":{"text":"No question the very best collard greens I've ever had. They were a little spicy, seasoned","useful":0,"cool":0},"DwAxzixXxpi79-fl7TxLlQ":{"text":"Visiting from South Florida and unexpectedly came across this place after another recommen","useful":0,"cool":0},"NmQ9sj3ahuFISGkaq2SfbQ":{"text":"Came here during my first visit to New Orleans about a year and a half back.  We were stay","useful":0,"cool":0},"n5U7UR-FBSQPUXjDJny65g":{"text":"This plack rocks. We were walking around the river front area for a little while, and afte","useful":6,"cool":2},"EHZUhjH3_FGUwVepxGJsXg":{"text":"Excellent food and service!  Establishment and staff are clean and friendly.  All around t","useful":0,"cool":0},"eRsbo9vuQUq7deX2Hrp8ug":{"text":"Friendly server, great food and great beer. Went in for lunch on a rainy afternoon. Server","useful":0,"cool":0},"nopkXRpoxeUu0EeKsDgs4A":{"text":"My sister and I ended up coming in here three times over our three day visit. The food is ","useful":1,"cool":0},"ZjXb346lRCuq9LC8eaxZJA":{"text":"I'm glad I found this place for some late-night dinner. Is the food going to blow you away","useful":0,"cool":0},"Su-b_BJW1tGqjLy2O9J_eA":{"text":"The food was delicious! The service was efficient and made things so easy for us... we wer","useful":0,"cool":1},"P5ebs5bJPt1eoEA12LJ7jw":{"text":"I don't know if its just the fact that I go to Saint Lawrence on the weekends or if I'm ju","useful":0,"cool":0},"NnDTusUkmu4Z1zHRv3cf-g":{"text":"The gumbo was not completely authentic. The chicken looked pre cooked and the sausage was ","useful":1,"cool":0},"qBYhOCLT-sqAGQatRVe2eQ":{"text":"Pimms cup was fantastic!  I had 2 smalls should have just ordered the large.  We had the F","useful":0,"cool":0},"v9I08oqzCtztu2TaGlEddg":{"text":"Seriously one of the best meals of my life. We dined hear during the rock n roll half mara","useful":0,"cool":1},"6y-HRDksN5bvm_qKzxqAow":{"text":"The food was great. Gastro pub with fancy yet edible food and expansive beer and wine sele","useful":0,"cool":0},"oszbHsJ-uP6U41SCxzF4Gg":{"text":"This place is unreal. I had high hopes based on the reviews I saw. I guess the food is sub","useful":0,"cool":0},"4V_cenlz4PP2a8hJyJxm6A":{"text":"Great place to stop for a bite. I had a delicious burger, skipped the fries and got a sala","useful":0,"cool":0},"XQ_CmQYPW8E6sZP25-1f3g":{"text":"God awful service. I don't care if it's Mardi Gras or not. \nIt should not take me 5 times ","useful":0,"cool":0},"MadtNq-t-UNV2-9335B2Hw":{"text":"burger rated in my top 5 burgers in the usa. just awesome. the onion rings are awesome as ","useful":0,"cool":0},"aMEOclPSE8IcTUTWSMNiWw":{"text":"Had dinner at St Lawrence last night.  Everything looks good, all dishes sound good.  Unfo","useful":1,"cool":0},"bvjUYJWfwJe3WqZ2wj-YOA":{"text":"Odd place. They don't want to turn the tv to sports. It plays black and white movies. The ","useful":1,"cool":0},"bpLGhx23vVM1fAt6Ua4NXQ":{"text":"Oh my god I saw a mouse!!!!!!!! It was SOOOOOOO cute :) but they didn't have wifi 4.5 star","useful":0,"cool":0},"9XmCQ0g4T0f70NuqbANsAw":{"text":"Finally stopped by this place after a movie at Canal Place. I really liked the feel of the","useful":4,"cool":1},"kSEmtXyxfAJMF69jPWAXtw":{"text":"St. Lawrence is the perfect neighborhood bar, even though it's in the French Quarter. This","useful":11,"cool":8},"6YmpvuiYymKGPubPi0GAPw":{"text":"Let me start by saying that I actually work in the service industry in Austin, TX....We ha","useful":2,"cool":0},"eGOMIVCmEmzN078JABc6TA":{"text":"The food is excellent across the board, and since it's located on a tourist-heavy strip of","useful":0,"cool":0},"3osXs24UIFQztN7BHG4bUQ":{"text":"Everything here was so good including Shea's waitressing and her cute little sidekick. We ","useful":0,"cool":0},"PzYi04GXRL_itUV107BpTw":{"text":"This was a pleasant surprise dinner while visiting NOLA. It was a local gem with a bit of ","useful":0,"cool":0},"bRMUVRtQrxZZbuLAd5-pNg":{"text":"The location was a nice stroll from our Canal Street hotel. The place had a cool vibe...fr","useful":0,"cool":0},"r0t31jzYykgQcyjdg7eyxQ":{"text":"This is a great find! Gastropub with old movies and an amazing Bartender named Tracy.\n\nI'd","useful":0,"cool":0},"aG3uPKYiq1teJOLsK_6Yaw":{"text":"Hit and Miss. Visited this late night spot twice in consecutive nights since we were stayi","useful":0,"cool":0},"PM3kLpHTfCOQ3cRQL_O2NA":{"text":"A nice lump crab meat mozzarella tomatoes salad and great fried chicken with collards and ","useful":1,"cool":0},"38khAPK4ittZqSJgPdPh2g":{"text":"We came in as a group. Ordered everything from the ahi special to Po boy to burgers to dri","useful":0,"cool":0},"gxheTtlP3eMza1oCmuGxhg":{"text":"We had the best time here. Coming from out of town, Trace and Shea were fantastic. We got ","useful":0,"cool":0},"QCtrMkiQJuat-mUJvkfvXg":{"text":"If you love healthy and delicious food and are fed up with the expensive \"fried fish\" (70%","useful":0,"cool":2},"FSLYniAUvCD6wQvYpLyILA":{"text":"This place was great!  Stopped by on a Sunday afternoon.  The waitress who assisted me was","useful":0,"cool":0},"D_QMTR9s_EPFnyNzVF2G1w":{"text":"Delicious cocktails and the Fried Red Fish with Brussels sprouts and crawfish beignets is ","useful":1,"cool":0},"4HwS1ks8NHXGU4UAMjvuFQ":{"text":"A beacon of gourmet delight in the otherwise lean streets of New Orleans, this narrow bolt","useful":1,"cool":1},"pGp1N_PHuT1FD0GsO96C5w":{"text":"Good late night spot that has quality. Had the burger which was great. Onion rings were de","useful":0,"cool":0},"324MAAVQ4BnUcCgNX4mPJw":{"text":"This is a very nice gastro pub with an excellent variety to their menu and very good servi","useful":1,"cool":1},"p2yJVH-wsh3kuldpj62gIg":{"text":"This bar's food is like finding a twenty dollar bill in your jeans after the wash. Great a","useful":0,"cool":0},"vwftCueknGkjzOhJevBn0A":{"text":"My friend and I stopped here for appetizers and drinks.  Let's start with the drink menu -","useful":0,"cool":0},"Ibp9r6pzyVMzZztQsgaphg":{"text":"Great late night food in the quarter. Just to be sure it wasn't a drunken late night palat","useful":0,"cool":0},"I07s9lZFiIhuNoDWPcs4-A":{"text":"Hidden gem in Nola. Went for the fried chicken and it did not disappoint. Also ordered the","useful":0,"cool":0},"-ej8B14IQVxWcDf2pyHzyw":{"text":"I really liked this spot. I love the fact that you can get really great food even though i","useful":0,"cool":0},"zRIrB_I2H1SqJornHSiftA":{"text":"Food was impeccable. Ordered the Shiitake Burger with Onion Rings. The beef was cooked per","useful":1,"cool":0},"SZjjpGIEQzolmYhq6aGDaw":{"text":"Not bad for a late night spot. When you have to compete in the NOLA culinary game 4th or 5","useful":0,"cool":0},"b8PXE3OHWmxOPraqXh2aOw":{"text":"I have walked by this place MANY times on my trips to NOLA and never given it a second gla","useful":1,"cool":0},"jlG6m1MhSqKmJknkQ23Syw":{"text":"The hygiene is very debatable: the cocktail shakers are merely rinsed in a sink (not even ","useful":0,"cool":0},"in8m0bAXkvQNUcPQG5QN_g":{"text":"The food is delicious!, but it took an hour and ten minutes to get it after ordering. Also","useful":0,"cool":0},"863N5KeTUzzvhvqpsudMaQ":{"text":"I've been to Saint Lawrence quite a few times before but usually late (after 10pm) when it","useful":0,"cool":0},"vojkmn2bIo4DSuaMXF2fgA":{"text":"Cosy bar near the beginning of the French Quarter. Nice beer and liqour selection with an ","useful":0,"cool":0},"0u2D9pyzBqc94IIPTz6ppA":{"text":"For a town that stays up late it's hard to find a place serving dinner late - and this is ","useful":1,"cool":0},"uGXkLL28YFn5MN9lB0LwDQ":{"text":"We ducked into this place when \"Super Bowl Boulevard\" became too overwhelming. To our surp","useful":2,"cool":1},"XJijVPYoUU_HB_PBYuTaCw":{"text":"Waited 45 minutes for our food when there were less than 20 people in the restaurant witho","useful":0,"cool":0},"3YLgXACv8g1kVm4NmvqN_w":{"text":"Went for lunch one day and had a great experience. Dinner the next evening ... a little le","useful":0,"cool":0},"2wTVpa0TXAe3BdLvj_YmKQ":{"text":"Great bar with awesome locally sourced food.  My wife and I recommend it to everyone we he","useful":0,"cool":0},"spLoP3JP7dwv__cwh1yrPg":{"text":"Super cool space and location, but my burger came out so over cooked that I felt my intell","useful":0,"cool":0},"hX_NzgT5rfXRQj5Gi2-YJw":{"text":"I don't understand how there are so many good reviews...maybe it was an off night, but we ","useful":0,"cool":0},"FGvf5__oa0vKJHz4KHjm7Q":{"text":"Good food, nice servers and Louisiana charm.  Their prawn and grits is amazing.  Also a gr","useful":0,"cool":0},"9g1eAfOh5D_jatr4eLJuGg":{"text":"After seeing Charles' review it made me realize that I've never gone back and re-reviewed ","useful":7,"cool":4},"LzM0O--TtGDXTRC3028Rqw":{"text":"While vacationing In the city we had a few mediocre meals and were looking for something c","useful":0,"cool":0},"upV_CyGnowvKMOitVedAgQ":{"text":"Came to New Orleans for a friend's 40th birthday extravaganza and went here on our group's","useful":0,"cool":0},"y97dcOVDMmswOprDSYbdZg":{"text":"We stopped in for drinks before dinner. My wife's friend had recommended this place for a ","useful":1,"cool":0},"kzD-I6hbcv9wLMc6XV9Wuw":{"text":"One of my favorite spots in the quarter. Love that I can get good, quality food, even late","useful":0,"cool":0},"9UnBjwTXPwqi33-fl_klRQ":{"text":"The perfect late night stop for a bite to eat when you've had a little too much. Local rec","useful":0,"cool":0},"qUUaoJKh_k7dYTH6wMUvFw":{"text":"My go to place every time I am in town.  Its in a touristy area, but it is not a tourist t","useful":0,"cool":0},"BbNptXdkKSnnRNK57MeoTw":{"text":"I just had my second visit to St. Lawrence, and I had to write a review. It's probably my ","useful":4,"cool":0},"t9ESSiHN7vZ-M99pCgZI_Q":{"text":"I had been craving good fish n chips. After being disappointed by what New Orleans had to ","useful":0,"cool":0},"X_zyl0bzLeCqsZJN8yc82Q":{"text":"Wings are delicious. The goat cheese dip is to die for! Our waitress, Cat, was so sweet an","useful":0,"cool":0},"Udndstv28RrFhLm-n7EGlw":{"text":"I've been there twice in the past week! First on Tuesdays for their special guest chef Jub","useful":3,"cool":3},"_933u4to-NBfNjEREfyZ3A":{"text":"St. Lawrence surprised me -- in a really good way.\n\nBased on its location and its appearan","useful":2,"cool":1},"r6z3MDICe-iE3n0xutlzAg":{"text":"Always a great place to start off an Day or evening in the French Quarter. I enjoy the dri","useful":0,"cool":0},"2MJvrDKaC_F3Nv7tBpEg9w":{"text":"It was ok. Good Bloody Mary's and chicken and biscuits. Gumbo was broth based and I like i","useful":0,"cool":0},"Srvha9UqAx9_l41nccJRfw":{"text":"Just amazing! The food was absolutely perfect! You've got to make a point to come visit th","useful":0,"cool":0},"QYJB70OwnTtoKcRUN0k4IQ":{"text":"My boyfriend, sister, and I came here last night for drinks and loved it, so we've made it","useful":0,"cool":0},"3NNQ61EUzAh9Z20g2ytQGQ":{"text":"The gumbo was so salty that we couldn't eat past 2-3 bites. The waitress was nice enough t","useful":0,"cool":0},"tfmwjhB5rYjlfXR67ZleLg":{"text":"This is the go to place that I take my family fresh off the plane when they want some orig","useful":1,"cool":0},"4_QX9m1Otrd07M4m1Xv08g":{"text":"Best hamburgers in the French Quarter! The staff is attentive but not overly, bartenders m","useful":0,"cool":1},"zGwA5wKlFKIpPpY-qiqoMg":{"text":"Spent some time in the French Quarter recently and enjoyed this little spot. We happened t","useful":0,"cool":0},"0YZc0MCZfEIcrhPpGcwB5w":{"text":"Service was not fast, but for a late night dinner, it was a good solution. the food was cr","useful":0,"cool":0},"MAMZpiHvmmjDEFlgwqZzkA":{"text":"Lauren and Derek are awesome. What a \ncool place. They make visitors feel at home. Great f","useful":0,"cool":0},"MRFxkvsL0S12CD8JIYQK3w":{"text":"I've been a patron of this place for a while but this time they dropped the ball.  The wai","useful":0,"cool":0},"VZBmLlVUuFzlsPiVUkvi0w":{"text":"This place was recommended to me by the bellman at the Westin, and IT WAS AWESOME!!!!  I n","useful":0,"cool":0},"Q9Su07e9o9puIt8WczVTiw":{"text":"food was great, wonderful recommendations from Shea, she was so helpful and kind and funny","useful":0,"cool":0},"jRCmZ-r9fYVm0MXxv12yaw":{"text":"Loved getting a last minute reservation on a  Saturday during a busy in New Orleans.  Good","useful":0,"cool":0},"MOqVuUkUoKVnV8qBq1yZgA":{"text":"Buffalo oysters were meh (way too small for the price) but PLEASE try the fried chicken! T","useful":1,"cool":0},"DKsWChbRqByYXaKyGFlBFA":{"text":"Visited here twice on our visit - we loved it that much!  Really chill atmosphere and so m","useful":0,"cool":0},"3KjL0qlVqabD26g0OYi6qw":{"text":"Terrific!!! The food was quickly prepared and was delicious! The atmosphere is pretty uniq","useful":0,"cool":0},"vU_Cv-8MZAguc-Xg1QQajg":{"text":"Traveling with my two vegetarian daughters and this was another great find.  They have a v","useful":0,"cool":0},"kjFaOyPZgw5pCla6kqLBvA":{"text":"Very nice beer list, great service. Had one app which was pretty tasty. Nice bar tucked aw","useful":0,"cool":1},"Jdu8vmBiNUQNZ08ozN53tA":{"text":"Awesome place. Food was amazing had the shrimp po boy and cheese steak sandwich both were ","useful":0,"cool":0},"oRybFkBV2gwHMjpA5WTdEA":{"text":"This place was good. The fried chicken lacked some \"herbs and spices\" but was cooked perfe","useful":0,"cool":2},"SV9suL93FSHh-TvDbaR15Q":{"text":"This place was AWESOME and it's open late!! The Shrimp Po Boy was absolutely amazing. Larg","useful":0,"cool":0},"MReoo-x3ZJ7VTx4UAR-elw":{"text":"What can be said about this lil gem of a spot in the French qrtr\nThey serve tasty food wel","useful":0,"cool":0},"LW79Gyob7oAGUhrIETgRFA":{"text":"On yet off the beaten path. This place has locally sourced menu items, and an awesome sele","useful":0,"cool":0},"FdmWEiybxKmJd2dC-64JEg":{"text":"Came here for our last meal in NO. The fried chicken was super. Crunchy outside with a sli","useful":0,"cool":0},"MY2Eid5xW0YMAkN9y6qK4A":{"text":"Yummy burgers (ordered bacon-cheddar and Swiss\nMushroom) and delicious cocktails. One star","useful":0,"cool":0},"t4okd_DLEz-M-DBVNg_WZQ":{"text":"Frozen Pimm's Cup-- Yes, please!!\n\nFood-wise, it's ok.","useful":0,"cool":0},"Uyc5CdBV9b520WXFlFpKhg":{"text":"Awesome place right in the middle of everything. The fried chicken was amazing and the art","useful":0,"cool":0},"2FNgo8866rbfuFyiDkpD8g":{"text":"As a bar, this place is great.  Great waitstaff and barstaff.  Enjoyed the liquid part of ","useful":1,"cool":0},"JaR4hPAx_HwSQIJ_ovF2dQ":{"text":"We got the smothered fries the artichoke dip and the black bean burger. Definitely nothing","useful":0,"cool":0},"7f8dFo0Tx3Mx3E5_GjM4GQ":{"text":"Stopped her for lunch and the place was outstanding. Great choices for food. \n\nA great sel","useful":1,"cool":0},"X84xmVrQ7Xdn1-5CFH8UoQ":{"text":"This is place is sooo good! We arrived from Atlanta on the 11:30 flight and didn't get che","useful":0,"cool":2},"8eB714rOKAJfRtaFQuLZxg":{"text":"Looks can deceive. What seems to be a simple bar is actually hiding a very accomplished ki","useful":0,"cool":0},"G6EiFKAUbVj_noeaGj3TWw":{"text":"Pimm's Cup and Blueberry Basil drinks are to die for! Just as refreshing as can be! Can I ","useful":1,"cool":1},"YlVYHErZVvhI58mmCmkV0g":{"text":"Killer beer list.  The guy who seemed to be in charge there was very attentive, and recomm","useful":0,"cool":1},"Lu3EYlGG1bsL_Wk_I87Fmw":{"text":"The cocktails were reasonably priced the atmosphere was upbeat alot of turn around so plen","useful":0,"cool":0},"_WQHMIHFguXOT9-BmB7EHA":{"text":"We couldn't fit our (compact) baby stroller through the front door. Which means they lost ","useful":0,"cool":0},"EMKYKWgbcCOAdDf0dGz4NA":{"text":"We had dinner here last night after a recommendation from a bartender at another place we ","useful":0,"cool":0},"nYBj9dOi7Sa_RlwXVJG5ag":{"text":"The house salad was very good. I loved the added kiwi it work will with the salad greens t","useful":0,"cool":0},"WxG0jPXV8v2kD7qzJ93R9Q":{"text":"Sooooo....in my favorite city in the U.S. and I stumble across St Lawrence trying to escap","useful":3,"cool":0},"KeqIQd3A2vdn44fvn4drmQ":{"text":"Great gumbo!!!  Darker roue than usual but delicious. Had the strawberry lemonade daiquiri","useful":1,"cool":0},"SKf8q4uckyrp2H77nVffhg":{"text":"Solid food and drink downtown. I had them make me an off menu poboy. I asked for oysters i","useful":1,"cool":1},"3lLRsjO-uBzRoB4c1MTz_Q":{"text":"My friends and I had a craving for fried chicken and this place came up on Yelp. The locat","useful":0,"cool":0},"YU9h2Fmu0YhcI-GwiyO_2Q":{"text":"Awesome place - we split a large beet salad, large mac and cheese, and 6 wings. Everything","useful":0,"cool":0},"5XUOrAgc5SP-V5PIY_5D2w":{"text":"Great drinks. Custom to my pallet. Awesome customer service. I think the best cheese dip o","useful":0,"cool":0},"zpvU2xSFILkYXZzpLDifYQ":{"text":"Definitely get the Pimm's cup on the rocks!! (they have frozen version, too which is also ","useful":0,"cool":0},"c6ymRCf2FK3WIT0Rd5laLQ":{"text":"Great food, great staff...HORRIBLE MANAGER/OWNER.  It was a Sunday night, not slammed, not","useful":3,"cool":0},"aHj8oMW3KlBDBNjjH1RiuQ":{"text":"This place is fairly mediocre compared to all the other great new orleans restaurants in t","useful":0,"cool":0},"Qyk1W_RULqrovU4HZplR0g":{"text":"Just a really quickish update to reflect the following: St. Lawrence has become my favorit","useful":9,"cool":7},"q0bUsDf7ViG1dFaeuXlwWg":{"text":"Came here for a late night bite, the space is nice and it was not crowded and there was pl","useful":0,"cool":0},"_KZWlDSSUKU7v30xU75R2Q":{"text":"Awesome wings with an amazing confit crunch and a nice balance of hot and sweet - great be","useful":0,"cool":0},"Qsb3DiS5lz46WrWStYp0JQ":{"text":"While I don't quite love St. Lawrence, I definitely find myself here more than I would lik","useful":1,"cool":0},"iiCpMs6LeT8f-pQn3bu51Q":{"text":"Walked in on a busy Christmas Day without reservations but at 4pm, so early enough to be a","useful":0,"cool":0},"7VRO4HWrOO2jwM_meNPueQ":{"text":"Awesome bar tenders and the food was something to write home about. Great selection of bee","useful":0,"cool":0},"ufJoWCjaAhKj7BR_K6y38g":{"text":"I like this place but theyve got room for improvement. Their craft beer selection is the B","useful":1,"cool":0},"s3To6PzsIt58Gjpz6MVjeQ":{"text":"I loved the relaxed atmosphere. The food was so delicious. Might be ok for kids. I liked t","useful":0,"cool":0},"RlpSk3TH3vqQye_H4NPIKQ":{"text":"We were super excited to try them since their menu looked amazing but we were surprisingly","useful":0,"cool":0},"OSvrUoQWUvSX_C_jT_g1eg":{"text":"This was one of my favorite bars. During our trip we visited 25 bars (a handful were just ","useful":0,"cool":1},"fwJBmEkl13RENZVEHtyYsA":{"text":"Meh. Good ambiance, especially if you're ok with TCM with no sound. However, the beer list","useful":0,"cool":0},"UXIi0dpUFRbuOQy-JlMmwQ":{"text":"I saw a sign outside of this restaurant and couldn't stop daydreaming about the fried gree","useful":5,"cool":1},"0MiEebPqxIv4m2589Cb-kA":{"text":"A very cool pub, located in the south part of the French quarter.\nLot of space, and an ext","useful":0,"cool":0},"SP0k87Fr0CjhKjwIJ57oHA":{"text":"very good vibes. great place to come for good drinks and a great atmosphere. no complaints","useful":0,"cool":0},"pmdbjvSh-9FE5oxJ_M_AQQ":{"text":"SO and I went for drinks and some snacks. He got some sort of blackberry drink that was li","useful":2,"cool":1},"jiMiY4SePHnCd1Y1M1uX6g":{"text":"Great food, amazing service!   Steak was one of the best I've ever had!   Bacon blue chees","useful":0,"cool":0},"l7U2I26qH_YtIyG5lA3vew":{"text":"Stopped into this place randomly, basically the food tastes like reheated cardboard. \n\nWe ","useful":2,"cool":0},"ABSPVtj3gG00x1hQSmpbrg":{"text":"This is one of our regular places to have a bite and a beverage. The staff is friendly and","useful":1,"cool":0},"PCsXtaGrEDfL7AoLu1gy5w":{"text":"Ambitious and largely effective at hitting the mark for a gastropub located in one of the ","useful":0,"cool":0},"2xiScEHyJGkNiqIZRnMMAw":{"text":"I like St. Lawrence for a drink or two and the wings are tasty with the Crystal Hot Sauce ","useful":4,"cool":0},"ITTVA5lEfoFvDO8YVN6UYA":{"text":"Great charred burgers and hot wings. Would love to come back to try more food and drinks.","useful":2,"cool":1},"T9wxmQjcrc_QS6i7IQEN9g":{"text":"I would come here for the sides alone. Mashed potatoes and chicken gravy with chunks of ch","useful":1,"cool":0},"pUJpnK2NDkwoKMROFgHyBg":{"text":"One of the only bars in the French Quarter with locally sourced well executed food, great ","useful":0,"cool":0},"HxZSUoPEon9eAhqyNsJpZw":{"text":"One of the best things about New Orleans is the vast amount of quality restaurant that you","useful":2,"cool":1},"yeY9rpI5G_tGg5LTi52Xog":{"text":"My husband and I eat here all the time. The service is awesome and the food is great. My f","useful":0,"cool":0},"NRII_AhZjCTLkWleDCFhUA":{"text":"This was the best dining experience my boyfriend and I had in our six days in the French Q","useful":0,"cool":0},"qLLL6adQ2ZSItEB6gfyITQ":{"text":"AHHH-MAY-ZING!! I got the couscous primavera and it was delicious! Perfect amount of spice","useful":0,"cool":0},"_8-_wTsmnjFnuon4Tc9qRQ":{"text":"My choice of place for dinner was a good one. The food was tasty. The mac and cheese was r","useful":1,"cool":0},"502ocuby3_z6xjPK36SD7Q":{"text":"Great food, drinks, & service. Did not disappoint. Love the st. Lawrence cocktail & pimms ","useful":0,"cool":0},"pMzKuQYEC89e_keVsonXyg":{"text":"3rd time I've been here in 4 days.... delicious!! Whether you want food, drink, good music","useful":0,"cool":0},"kVIJVVz52_HfWRzXUbNZsA":{"text":"This place was right by my hotel and within easy walking distance of the convention center","useful":0,"cool":0},"xRW_EGg6ShVT3js5yja-Tw":{"text":"Cool little place.  Was in town for the weekend and looking for a more low key place away ","useful":0,"cool":0},"Q1nzlkJiD6oLYYtDmdS0Vg":{"text":"We decided to give this place a try after walking by it a few times and we now have a new ","useful":1,"cool":0},"7Ui80DxK3l0xpXGv_IR6og":{"text":"I am a vegetarian and so most places only have one option for me, but this one had multipl","useful":0,"cool":0},"B-1FF4TJAPp3L6Irdedlgw":{"text":"Best soft shell crab sandwich as comfort food I have ever had at an amazing price, thanks ","useful":0,"cool":0},"Y2NLGs0fdEMXt72Xzjp1hA":{"text":"Cajun philly was terrible, so was my lady's cajun pasta, paid 80 dollars for 1/8 of a meal","useful":0,"cool":0},"0u50DLtj44LpBoLukAxfFw":{"text":"Excellent all around! Great food, super friendly service and relaxed atmosphere. First tri","useful":0,"cool":0},"j1mssurZPpXyPsF9chQ6CQ":{"text":"We stopped in for lunch.  Full disclosure: I have the palate sophistication of a toddler a","useful":2,"cool":2},"U5MLrsvO_I0CrFCWE079lw":{"text":"We tried to go to Killer Poboys, but the chef had literally run out of food and directed u","useful":0,"cool":0},"S_Opbgube5zf3RHzD6T_Mw":{"text":"We went there twice on our vacation- awesome staff, amazing food- lots of cool veggie and ","useful":0,"cool":0},"mhnpYnJmbr5ABciRyNCZdA":{"text":"Awesome fried chicken and mash\n potatoes. The staff was extremely friendly as well. Cool a","useful":0,"cool":0},"dppi_KMFw0riB5ORzYTCvg":{"text":"Went in here on cinco de mayo because Felipe's looked like a block party in East New York ","useful":1,"cool":0},"XvachTVehUsp63Hoae6bHQ":{"text":"Finally eating off our French Qrter. Nice place across from River Walk. I missed the appet","useful":0,"cool":0},"atW_X443kRFiyIYlUjor5A":{"text":"Great experience here, we were excited to find this gem! Awesome atmosphere, amazing food ","useful":0,"cool":0},"EGxgH0SBwEJgUdz46vfa2Q":{"text":"Beer and cocktail list is great. \nThe smothered and covered fried were phenomenal- spiced ","useful":0,"cool":2},"AIqnChjUnZUlVEMG7pWWXA":{"text":"Food was good, however we had 2 separate issues: 1) we asked for the door to be closed sev","useful":1,"cool":1},"-1kC-txsuD7ihbf9L-MpFQ":{"text":"What a great place!  The doors were open with a breeze coming in, the food was amazing, an","useful":0,"cool":0},"xr8AiP2OYN6ypGFH1Lo8xQ":{"text":"Drinks are awesome. Fried chicken was delicious. Loved the mac & cheese. Great option if y","useful":0,"cool":0},"dqzMf3NPuUfI4CUU_0Oymg":{"text":"The service was good, ambience was nice and the food was even better! The Mac and cheese w","useful":1,"cool":0},"icH_evJ2DPybaKQkAmAtiw":{"text":"I wandered in here after receiving a recommendation frm a bartender in another restaurant.","useful":1,"cool":1},"Fl_COY-0TRoOFc0w4ADXxQ":{"text":"Cool space to grab great food and amazing  pimms daiquiris.  So good we decided to come ba","useful":0,"cool":0},"CVUFu1voAKOIagc3s_-kdw":{"text":"No complaints here. The service was good and friendly. The music was rocking. The shrimp a","useful":0,"cool":0},"_IzGq5Ut48zHP0Qjg3nARQ":{"text":"I really hate to give St. Lawrence 3 stars, because the staff was super nice, but I was st","useful":5,"cool":4},"RUEiwNs_kD0HlIUDJUHv9A":{"text":"I was meeting friends for a movie and was in need of substance so I decide to stop by St. ","useful":2,"cool":1},"Cs3_3xAnPrP9PCqVHriWRQ":{"text":"Just landed in New Orleans for the first time with my sister and mom, we were starving! We","useful":1,"cool":0},"Vm7whB-qfhg9CxCQIZNQPg":{"text":"The gulf fish romaine was great! This place is a late night gem. The service great the sta","useful":0,"cool":0},"OzXJLmOdghBzPhMUv1WQaA":{"text":"Friendly service, some hits and misses on the menu. Friends ordered the crab poboy and sai","useful":0,"cool":0},"dyG26eA6xG9IWtaQkS_M7Q":{"text":"Came back to the Saint Lawrence after a hiatus and returned to find that my coveted frozen","useful":2,"cool":2},"BWwNOs4Vl7L38lPqf1iAOg":{"text":"First off this was the first place we went to when we got into NOLA. And my god was it ama","useful":0,"cool":0},"owx2UQ_NGMp9tPSC9fgUjw":{"text":"I'm not exactly sure why this place has such high ratings. Our waiter was very nice and de","useful":1,"cool":1},"za5VrlU8QFjsRgvjGMm0yQ":{"text":"We stumbled in here for some late night munchies after walking around New Orleans for a fe","useful":0,"cool":0},"N6FRBd1As1LZ4AWKkF81Cw":{"text":"Keep trying to find a place that makes Peach Bellini as good as theirs can't and OMG they ","useful":0,"cool":0},"1UxRljUQsH9HomSfaq-GZg":{"text":"The spiked lemonade was really good. The reason this post is getting a 3. I asked for a me","useful":2,"cool":0},"aSnXAyD1W0eBscNee-0UzA":{"text":"Great food, wide beer selection, terrific service. I'd happily go again. Had the fried chi","useful":0,"cool":1},"SWRVdntun0xd8Gqyb9XazQ":{"text":"Fantastic Dinner. We happened to be in town for a convention and we had heard how good the","useful":0,"cool":0},"Q_-BhYRJaLpy4V_pviNOgg":{"text":"This is our 2nd visit to the Saint Lawrence - 1st was Mardi Gras & now Jazz Fest. Please e","useful":0,"cool":0},"qjzv2KDvBk8vmTCOlfiidw":{"text":"Stumbled upon this after a rain storm in NOLA last week.\n\nSelf seating & quick service\n\nFo","useful":0,"cool":0},"zZiXjBp2wMqaOHJw1OAYBg":{"text":"This place is fracking awesome!  Visited  here during my first trip ever to Nawlins. Heard","useful":0,"cool":0},"oTztN-P7sJzAkpsBKZDbCA":{"text":"Love this place! They have awesome bartenders who can make some killer drinks! An awesome ","useful":0,"cool":0},"kz3g68UoomTe-nGNvj0SjA":{"text":"Wow. They were not having a good night when we were there. The kitchen couldn't get our fo","useful":1,"cool":0},"jUga9LTI0imzJte-KByqyA":{"text":"After walking 6 miles in the French Quarter my wife and I was tired, sweaty and feet killi","useful":1,"cool":0},"kBk3jDBaecmM8fxQbIgBLQ":{"text":"We were looking for a place for dinner near our hotel. We saw the great reviews and menu f","useful":1,"cool":0},"CU4NcDZr4mxeTr_mlcfZhg":{"text":"3.5-stars (rounding down). My fiancé and I enjoyed our lunch here with a mutual friend. Pl","useful":0,"cool":0},"JP6UjB5QeV5wo77bPYUUjQ":{"text":"So far I have visited places reviewed by others- and they are correct- the food is very go","useful":0,"cool":1},"uTD8f5JhG1G24x_knUQTBA":{"text":"This place was excellent. The service was great and all of the food was delicious. We orde","useful":0,"cool":0},"BFJj-pEhRkDojIK1SBBlDA":{"text":"The food is not even close to organic , the steak doesn't have any taste. Need to know how","useful":0,"cool":0},"bvP5lHrK6iS-saUR6KQc_g":{"text":"Omg, great drinks, delicious food and excellent service( YOU HAVE TO ASK FOR SHEA aaka SHE","useful":0,"cool":0},"XZ2NFtOZfNew43WWXh-08w":{"text":"If I could give more than 5 stars I would! Service was amazing! Food was TOP NOTCH!! And w","useful":0,"cool":0},"djnRnYV2Bvr567MwEd9dsg":{"text":"Love everything about the place.  Great service, great staff, chicken wings, homemade chip","useful":0,"cool":0},"k3OfNGIySlvh1laHmLtMEQ":{"text":"Pleasantly surprised.  Slow service at first, but then the gumbo came out.  Best I've had.","useful":0,"cool":0},"RfgZOq_mFQ05S_pMDhK_Ww":{"text":"Land late at night in NOLA and this place was recommended by front desk. Great spot! Thurs","useful":0,"cool":0},"62i1Rizj1EGcK6Zpm0aZjw":{"text":"I'm delightfully lubricated!!! Whenever I am in New Orleans this is the place I gravitated","useful":0,"cool":0},"InDkaZIZu3CEubt9RnYNFA":{"text":"Amazing food. A must visit. The bartender Crystal gave excellent service and makes even be","useful":0,"cool":0},"5uyAGRjtqNt1GNWdjCw9Ag":{"text":"I had the pleasure of dining at this restaurant during a weekend away in New Orleans. I wa","useful":1,"cool":2},"6UWXpc-XAlPaXC5YG8wVfw":{"text":"Small menu of typical fried food and Po boys.  If you look at older menus on yelp there wa","useful":0,"cool":0},"9HrlbLpWNyIyFY0DztFYNg":{"text":"Came here yesterday, the food and service was excellent. Fried chicken and gumbo were grea","useful":1,"cool":0},"Jl1Nhyu9RVhfEGR3v9Yavw":{"text":"Fried chicken served hot! Absolutely delicious and crunchy. Gravy on the mashed potatoes w","useful":0,"cool":0},"ugY5nIp2xtiMU-1Fo3kwxg":{"text":"My husband and I had a \"meet and greet\" with our guests the night before our wedding at St","useful":0,"cool":0},"UHcVlfNA7K8qQ86xDDp-zw":{"text":"Had dinner on a Thursday night. What a gem! Cocktails were the best. Love the St. Lawrence","useful":0,"cool":0},"TxSnU7iku-0uCjZMCXGFLg":{"text":"The food was amazing and great portions! We had the buffalo oysters, artichoke dip, and Fr","useful":0,"cool":0},"PK7kWM-3c_WPHVp2_sOx9Q":{"text":"Good food! Great name for a spot! Staff was irritable for no reason. She asked us how we w","useful":0,"cool":0},"FX9na6PJvpdCdBYRwGFXFA":{"text":"Stopped in this spot early on a Friday (11ish) for lunch. We had the shrimp po boy and the","useful":0,"cool":0},"JakerAMK2MwoHqMadyrdFg":{"text":"Really great lunch. Family of 4 all enjoyed our selections. Burger was handmade. Crawfish ","useful":0,"cool":0},"utai2Es4hFgHrjC0csybAA":{"text":"Not very good food especially for the length of the wait.  There were 4-5 people when we g","useful":0,"cool":0},"f1IPNKgbM58nDz0o0IKfbg":{"text":"One of my favorite drink stops while cycling in the quarter with the best frozen Pimms Cup","useful":6,"cool":6},"-7GGuVpImpxOlnl86NstwA":{"text":"This spot was low key and literally the only pub with food open until 2AM in NOLA. We came","useful":0,"cool":0},"kMKZLeDiOBg9RNNoLGPqfw":{"text":"Do not  take the  3 star rating  for a lack of good food or bad service. Please read.\nThis","useful":6,"cool":6},"TJJUvypVtou-_gFZfsMrrw":{"text":"Soooo, a great bartender recommended this place.  I decided to go where the locals frequen","useful":0,"cool":0},"HqBx2OeYKwWvCL-X_fIz6g":{"text":"This was way better than I expected. The cheesesteak was probably the best I've ever head ","useful":0,"cool":0},"iuTbcUtitVkTrdBkhwxKQA":{"text":"Cocktails are fantastic, and the frozen Pimms is just short of Superior Seafood's frozen m","useful":0,"cool":0},"NtturF8C4cI9T5ZG2C6ifg":{"text":"St. Lawrence is a great restaurant! They have a great menu that is vegetarian friendly. Th","useful":0,"cool":0},"zRU1wqiK4uBfkTMaGnZn-Q":{"text":"Customer service is instrumental for an experience and we had a great time with the barten","useful":2,"cool":1},"T55aoM4eQ5jthtFnfovHsw":{"text":"The food was pretty good but the service was slow as heck!!!!  Came at 830 pm got our food","useful":1,"cool":0},"yoN8G98S7xgK4ZwMLByKmg":{"text":"So I've walked down this street many times and never noticed this place. My mistake! The f","useful":0,"cool":0},"IhcdW7h7Lfit4Hm63QOlWQ":{"text":"Ordered Saint Lawrence via Postmates on a Tuesday night and was not disappointed.  3 of us","useful":0,"cool":0},"vHmLz0dYMcbwg-XvP2fJBA":{"text":"Food is excellent. Definitely takes awhile to get so make sure you have plenty of time to ","useful":0,"cool":0},"Vn9a3ctieHZ619hFb_MyDA":{"text":"Solid dining choice. Would have rated 4 1/2 stars.\n\nDeviled eggs- 5 star with bacon and ca","useful":1,"cool":1},"SwQYOQwQueYUXt9Qd_sdKA":{"text":"Omg, I revisited this place after not having a good experience on my first visit to NOLA. ","useful":0,"cool":0},"Ip3bw7wjHKZNiGFnHZkZNA":{"text":"There are a lot of bars that are open late in the French Quarter, but if you are looking f","useful":0,"cool":0},"3AODwDDLc3hNFoi43XPZ-w":{"text":"Love that this place is open late, they serve food til 2am! Food and drinks were amazing. ","useful":0,"cool":0},"hRCCst_Swqkd-aWKAmgvSg":{"text":"This place came highly recommended by our concierge at the Bourbon Orleans hotel and said ","useful":0,"cool":0},"19uaUIsOW8NIHTIbIybEIQ":{"text":"LAME! \nThis place has so much potential but I would never return, they need to switch up t","useful":1,"cool":2},"TguaBmqSoBTkBFq4Zwlybg":{"text":"This place was ok.  The service was GREAT.  The food was more so your typical bar food.  T","useful":0,"cool":0},"u155D4PUPnoHwAUhKuXhyg":{"text":"We tried the \"big name\" fried chicken places and this place was BETTER! Collard greens and","useful":0,"cool":0},"7ottakTZ-C3qcsS-YR5i0g":{"text":"Obviously, being new in town, I am up for any suggestions from the locals & this one hit t","useful":0,"cool":0},"l_UbWyHOodWpsCMzGKvIIA":{"text":"The soft shell crab BLT and loaded fries are awesome!! Service is great too.  You gotta tr","useful":0,"cool":0},"uY4cRNkFtUUJD5FPOAmYQA":{"text":"I tried moving in here because it was perfect for me but they wouldn't let me. But know th","useful":2,"cool":3},"3L9iZKDiwtbnwNQY5mtSCQ":{"text":"4 stars on Yelp means \"Yay! I'm a fan.\"\n\nIndeed, I'm a fan. We stumbled on this place rand","useful":0,"cool":0},"IJWesTM1lhnU0jPLDqdUKg":{"text":"When you start calling a bar \"Our Bar\" before a 4-day trip to New Orleans is over, you kno","useful":0,"cool":0},"bW5eIngZEs4C6qYl4yt-qA":{"text":"Very good food. Surprised at the greens. The time it took for the food to cook was long. I","useful":0,"cool":0},"9SaCy8NLN6wQtaoa5x6ojw":{"text":"It has always been a dream to come to NOLA and get me some cajun food. After landing earli","useful":1,"cool":0},"Chc_dIgDYoMmLC1jbDeBNg":{"text":"I've been hearing rave reviews so I had to try it out... and now I can't wait to go back!\n","useful":1,"cool":1},"bbFZyHUhOhAbxM1BH0Z1kg":{"text":"In the Quarter. Stop here for a bite and cocktail. It's NOT touristy like many places in t","useful":1,"cool":1},"YCqqORt9u1JEKzyR_krbEA":{"text":"Love the beer selection, specifically the stiegl grapefruit radler...I don't care you if y","useful":1,"cool":0},"N-Zm3LhENnoGN1DkVxUQNA":{"text":"A great place to go for low key brunch with friends. Loved it. Our server was awesome, ver","useful":0,"cool":0},"GUO_9YP7hUGBP82DGUifHQ":{"text":"This was my 2nd trip to the st. Lawrence.  Last year we came here to watch a saints game a","useful":0,"cool":0},"v_NRYu1pR-6knZ5Ib5jj9w":{"text":"So again I went to New Orleans and our hotel was right around the corner from here and alt","useful":0,"cool":0},"AfgTGyL2011u2qTIgkc_yQ":{"text":"If you are Gluten Free and hungry in New Orleans...come here! They have my fav gluten-free","useful":0,"cool":1},"aeJ1lJAInOpVLs08T71j3Q":{"text":"The chicken wings are the bomb- got to try the.  Service was friendly and fast. Pimento ch","useful":0,"cool":0},"Ra8cT5AYckWADwuxbXkV0g":{"text":"Hands down delicious food. Fish plate, Mac n cheese, spicy chicken sandwich, and Alfredo s","useful":0,"cool":0},"1PUMo1sCZcUiLBlR7aF5sw":{"text":"Great Hurricane!  Fries were awesome! Shrimp po-boy was good but needs a little spice!","useful":0,"cool":0},"L1MoTFTuY2QLQYgTQGeO4g":{"text":"We stopped here after the casino. The soup and red beans and rice was good. The bread pudd","useful":0,"cool":0},"zZUhnnAvgBuHpfJZBn9qGQ":{"text":"Great place to unwind after a day of meetings! Great beer selection (Santo was my pick), r","useful":0,"cool":0},"xCPhPiel3Y5iVVzZHk0jlA":{"text":"This place was pretty good when we came for lunch. Three of us enjoyed our huge burgers an","useful":2,"cool":2},"dSybzZUYGa3asNBoele1FA":{"text":"Great beer selection by the bottle, and nice to have full menu options until 2am. Convenie","useful":0,"cool":0},"qTv66XPbhLxYkI3wnEkFMw":{"text":"Poor service, burnt food and lacking atmosphere.... I won't be going back any time soon.\n\n","useful":3,"cool":2},"4YE5QW2vY95zNqKv8oWaJQ":{"text":"We spent our first night in New Orleans looking for an upscale meal and wound up at Comman","useful":0,"cool":0},"Vx_a7swIe8fiibggN97RMg":{"text":"I have to say, as far as daiquiris go, this is the best one in town, hands down.  When the","useful":3,"cool":2},"S5yPrgPNqPhNlKRw__5Y0Q":{"text":"The food was amazing. My boyfriend got the special, a soft shell crab blt. And I had the f","useful":0,"cool":0},"Ywh9W6seOpsY7L0fHz-hag":{"text":"It's a bit on the expensive side and can be a bit inconsistent which bumps this down to 4 ","useful":1,"cool":1},"szOCbybrOeWAB3cqoRrwCA":{"text":"Deviled eggs. First of all, they brought be 5 halves on a plate. This means there's anothe","useful":0,"cool":0},"Gosw8-JjCjp8DrskwQpLNg":{"text":"Nice gastropub on Decatur St that has a really great variety of local Southern beer and cr","useful":1,"cool":1},"W6yUAAOhOxFMF7tnaasPww":{"text":"Great food and good service with a pretty cool vibe other than the bartender is an absolut","useful":0,"cool":0},"I-72v0MxjIQBrSN5sHioxg":{"text":"Chicken special is way to expensive cost $16 for 3 pieces, very small portion of collards ","useful":1,"cool":0},"xtHnNRVmqFYxQ5M-Qd23Qw":{"text":"Best cheesesteak I have had by far. What I great place to dine. The waitress was very frie","useful":0,"cool":0},"mE0az7UC5TFwEpk0payueA":{"text":"Wanted a bite/snack while walking around. Plenty of seats. Only ordered the chicken wings ","useful":0,"cool":0},"BqmCeBOVUrvYM5Md7tQjOQ":{"text":"Located a short walk from the Marriot - great vibe to the place, had the friend chicken pl","useful":0,"cool":0},"pbPziGzsNNRfQTJ8SDn-Ig":{"text":"Was there in July. The summer vegetables were great. Their summer drink specials were wond","useful":0,"cool":0},"-jq-PDfDvD4exSlXis_O2A":{"text":"First of all I am a huge fan of NOLA.  I have been twice and would love to go again someti","useful":1,"cool":0},"n7vDX6zF6N-ovJ6aXEq44g":{"text":"First time in New Orleans and looked at going to Willie Maes but it was much to far and th","useful":0,"cool":0},"e4J3RBtrhVJKbGsIAQyLBA":{"text":"The food is terrible. The person who waited on us was great! No flavor, no seasoning... Tr","useful":0,"cool":0},"5gkOQzCNpuQC_KpI8xJONA":{"text":"This place is in the heart of the French Quarter and the food is great drinks are amazing.","useful":0,"cool":0},"xuPp6KHKmWPcojSwmgZ9Tg":{"text":"Well geez, I walked into here thinking it was just a bar with maybe some pub grub.  But it","useful":1,"cool":1},"4OTJtoz8dCBMlRPMmucWeQ":{"text":"We were searching for a place with red beans and rice for my husband and enough non-seafoo","useful":1,"cool":0},"UtbgT0HXpPj6ujnZPPpFWQ":{"text":"This was our first place to eat in NOLA. I had to find something for picky kids and someth","useful":0,"cool":0},"StfSLFM0f4Yx1QvW_YN0UQ":{"text":"The pimms cup daiquiri is the most delicious, refreshing drink I have ever had. Go get one","useful":0,"cool":0},"z8n-YrwbBIUA4ARL9NlfoA":{"text":"Wow, how times have changed. We were excited to return to our holy gem after 3 years. We w","useful":0,"cool":0},"B3zH2pGVwFD6-jaIsm5ydA":{"text":"This is place I find myself at pretty often. Love the ability to pop and sit and enjoy the","useful":2,"cool":1},"Szn91TVQ25Yol1M_0W5ahw":{"text":"Came in around 130 just as they closed and the kitchen manager is so sweet. He decided to ","useful":0,"cool":0},"KP8xZfZaIEhrWZ65nf1TpA":{"text":"Love the authenticity of this place. Completely grounded in what it is... a dive bar. But ","useful":0,"cool":0},"mLFY36zJ6_txW1RqOPr_Ng":{"text":"Great spot.  The staff is very friendly and helpful.  Great daiquiris and the gastro-pub f","useful":0,"cool":0},"jQLZwIYda5DL6W6deAKY9Q":{"text":"Walking around town with the boys and we worked up a sweat. What better way to cool off wi","useful":10,"cool":9},"KMzvwbEaRgJ266kVrpoVqw":{"text":"I always stop here (at some ridiculous late hour) to eat during my trips to New Orleans. I","useful":0,"cool":0},"x2BZWbSw8lKFCIbbpJH_Dw":{"text":"\"French Quarter gem with icy cool daiquiris and sophisticated bar fare\".  Loved my Pimm's ","useful":7,"cool":5},"jHcsLLpo6nJsk0kA3liqkA":{"text":"The chef Caleb really cares about his food and the restaurant. I've been here a handful of","useful":5,"cool":3},"yGMBHHwYO7gkCr98o-PoMw":{"text":"Bland bland bland bland bland !! I ordered what is supposed to be their signature dish, al","useful":0,"cool":0},"5ffeprX_W43VsA92CsLx1Q":{"text":"The food was great. Creole pasta and fried chicken to die for. Their gumbo was better than","useful":0,"cool":0},"WhU5cIYEll01xhMo2m2E8w":{"text":"Went to this place during the day on a weekend to meet a friend for drinks. The staff was ","useful":0,"cool":0},"6-wiek1fOgHjfC5zlr45XQ":{"text":"Cute place on S Peters in the French Quarter.  They have a decent beer selection with a co","useful":0,"cool":0},"IcAo3MGeDAD7j3nJ5pDGzg":{"text":"I have never received such terrible service in my life! The moment my fiance and I walked ","useful":0,"cool":0},"XhLklOqBnY_FfXO5K6NN_g":{"text":"Meredith was a fantastic bartender who recommended a delish drink for me w/ Oryza Gin, crè","useful":8,"cool":6},"FKax2kBjPCeQweB7JZKPHw":{"text":"For late night eating, this place is awesome. The group I was with went around 12:30AM and","useful":1,"cool":0},"vkJWocHg-hnKYpFRqeCqOg":{"text":"My roomate and I stumbled upon this place one night when we were about to walk into coyote","useful":0,"cool":0},"0T82aKolT-PY-ThbLrzSrw":{"text":"The food is pretty delicious... the macaroni which people seem to rave over was not my fav","useful":0,"cool":0},"_glxi5jsdWIN7lgjJEpdnQ":{"text":"Sent for the Pimm's Cup by another visitor we met at a restaurant and it did not disappoin","useful":1,"cool":2},"1w-yxJARX2T_JVNZNeMB0g":{"text":"The fried chicken is amazing; great!! sorry to say in my opinion better than paula dean \ns","useful":0,"cool":0},"4pVpwK8BdWkrcxxSireoeg":{"text":"My friends and I discovered the restaurant just walking down the street. We were so amazed","useful":0,"cool":0},"MnmdHf-445rHEJI-H4MVmg":{"text":"Good food very nicely done rabbit and their cheese dip and fresh chips were delicious! Man","useful":0,"cool":0},"3swvlK0r3cnKFGruRUP2wA":{"text":"A totally unsuspecting amazing meal in New Orleans. Probably my favorite meal the entire t","useful":8,"cool":5},"hpJcEC8Djg4JO8jd1P1cyQ":{"text":"Staff was very friendly.. the food however was well below average. My fish was not seasone","useful":0,"cool":0},"HML7m-i9hclKCQSV22LAlA":{"text":"Sadly I pen this review. The place itself is fine, super casual and the service served wit","useful":7,"cool":2},"HEbx-G3MWoimSvOM6_0JPg":{"text":"I found this place to be open late and really close to the Westin Hotel. Walked there at m","useful":0,"cool":0},"Cst7GYRZNfTPuezVNUg41Q":{"text":"The Mac n cheese and the bayou cheesesteak were amaze-balls! 2 days later and I'm still fo","useful":1,"cool":0},"Ut3BNluCNxZc3_kOSFng0Q":{"text":"The food was delicious and the employees were very friendly and helpful.","useful":0,"cool":0},"tnZaNaRV9_POR_-UB6-mZw":{"text":"This place was a breath of fresh air from the hustle and bustle of the rest of the city. I","useful":0,"cool":0},"palEhgE1wuksuQFqQSgoLQ":{"text":"A local recommended this place as it was open late. Edward our server was super cool. Gave","useful":0,"cool":0},"TClU6zMAxSgK_i70JP5zuQ":{"text":"Currently sitting in St Lawrence enjoying a chai latte daiquiri -- the seasonal option rig","useful":3,"cool":1},"kqzv9WeBLQWMZAS8Sj864A":{"text":"I went here when I was in town for the Essence Festival. I was with a party of 7 and we we","useful":0,"cool":0},"eqfLrdytBP_VYlTnK_v7QA":{"text":"Giving this restaurant one star is being exceptionally generous. This was the worst experi","useful":0,"cool":0},"cADjo0y7vw8cCwHlU2pHEg":{"text":"This place is easy to miss, which is actually one of my favorite things about it. A local ","useful":1,"cool":1},"mQgEHo_OwqTuAr7i9b77mA":{"text":"I'll have to come back to try the chicken, but my first visit here has convinced me to ret","useful":0,"cool":0},"n_xv1Ohfk460nr56w5MxmA":{"text":"This place is awesome!  I usually get the pimms cup daiquiri but the chai tea daiquiri was","useful":0,"cool":0},"d5bqkUEoV4P4ta14b8s9aA":{"text":"Thought we were in trouble when I saw the bartender grab a book as the wife ordered a Last","useful":6,"cool":4},"5XkRzRcpAgk2PUJh27ksxw":{"text":"Stopped in late night. The bartender was very nice; however couldn't accommodate a skinny ","useful":0,"cool":0},"wZiB6JMPyqWcDwNWOe7c4g":{"text":"Service was a little slow, but the food more than made up for it. The fried chicken plate ","useful":0,"cool":0},"wkMUp6Ffx6i0W5kP6CVu5w":{"text":"Really good food! The fried chicken was crispy and juicy. Loved the location and stumbled ","useful":0,"cool":0},"h6-vBjrkwNyOA0UDiIRtpg":{"text":"The service was still really sweet and the Pimm's cup still amazing, but I want to give a ","useful":9,"cool":3},"ggWuim1zha7sOHudg3jceQ":{"text":"We went to St Lawrence on the referral of our tour guide. St Laurence did not disappoint! ","useful":0,"cool":0},"lmt9vPeVXyVjab4vKW_CQQ":{"text":"Gruyere and shitake burger: perfect sear, cook, seasoning, combination of flavors, and bun","useful":1,"cool":0},"kHC2X33u7c2Vm3y6qIUoqw":{"text":"What a hidden gem!! We've been in New Orleans for 3 days and this was hands down the best ","useful":1,"cool":0},"fEhTEdPJBijJTKfVSXViJQ":{"text":"Food took a little long to come out, but it was worth the wait. The Mac and cheese is unde","useful":0,"cool":0},"LCXqcsy6t5LmFLx5mhVFZg":{"text":"This place is great. After stuffing my face with muffuletta and beignets I wanted somethin","useful":1,"cool":1},"ziXxNIUKpNNaVXNxTIUbCA":{"text":"For late night food? It's a solid option. During daylight? You can probably do better.\n\nAf","useful":1,"cool":1},"vAs5zqj9OV_WOZgJDaBp0w":{"text":"Loved this place..\nGreat music\nYou must order the frozen Pimms or Strawberry Lemonade..\nAn","useful":0,"cool":0},"Q4CRn0lRyS3BFcI6Uk9ZvA":{"text":"The BEST *fancy* frozen daiquiris ever in the most convenient and unexpected location ever","useful":1,"cool":1},"z8Rq9sTAvEE03yUdKJL41g":{"text":"This was a neat place that a friend and I slipped into one rainy night because the Mexican","useful":4,"cool":2},"alMm0J7HXa2kSrQbQgGgIQ":{"text":"So the hubby and I were in NOLA last week for our fall vacation. We were going to go to an","useful":0,"cool":0},"DLMn1RDks5ThLc7OwZOIUQ":{"text":"3.5\n\nI left here thinking I would have rather had drinks. This isn't a slight. I came duri","useful":6,"cool":4},"_0BEWJh4DWTnkVKqg5mhqA":{"text":"I love the 5 in the Cozy atmosphere here. \n\nThe wait staff was outstanding in very friendl","useful":1,"cool":0},"0tDydqmawmSdyAoHrzj8xw":{"text":"This place is a hole in the wall...and I love it! Reminds me of some of the wonderful hidd","useful":0,"cool":0},"jnhgAnCuAQ5IbBuhrNHSuA":{"text":"This place is legit!!! Service was great! We had the pimms cup...which is literally the be","useful":0,"cool":0},"Tce_EWA_PNAfY7o3uFYP7w":{"text":"Ever since I'd heard the buzz about the Pimm's Cup Daiquiris I've been dying to try this s","useful":11,"cool":7},"BSr_2HjO9lA_vu3n78kOvA":{"text":"i seriously adore this place. my husband and i found stumbled on this place when were dati","useful":2,"cool":2},"gki1CUFWYMFSSkuurDw_IA":{"text":"Ordered two burgers and the waitress never asked how we want them cooked. They were charre","useful":0,"cool":0},"q9RvpB7VhXcRP7vLAe1LNg":{"text":"I almost always visit Saint Lawrence when I am visiting Nola. I stumbled across it when I ","useful":0,"cool":0},"vyX5kn-mX2VMy1IctpLqqA":{"text":"For a busy day the service was good. My only critique was the taste of the food. The fries","useful":0,"cool":0},"FIPEodM65RLUXfUbbGlzmQ":{"text":"Best gumbo we've ever had. Liked the scoop of cold potato salad in it.  The greens were aw","useful":0,"cool":0},"43yJL--oMlXc3_uty3y1lw":{"text":"I looked around a long time for where to eat tonight, but I kept coming back to Saint Lawr","useful":12,"cool":8},"e02IPIar06N95Y9WccTgvQ":{"text":"Bless their hearts... 1.75hrs wait for food.... just a damn shame. Disgusting. So sad... h","useful":0,"cool":0},"JOcQUKNJAOhuALIiMAWnig":{"text":"I saw this cool little gastropub while walking around in front of my hotel. Great food and","useful":0,"cool":0},"AmcY11DZ8dT3rTjBz8wcwQ":{"text":"I wanted to like this place but, I really didn't. My husband and I were limited with resta","useful":0,"cool":0},"yAsTcM0tFvsWsiKWl-lJYw":{"text":"Loved this spot! They are open late so we were able to get some dinner after a long travel","useful":0,"cool":0},"6M_LN2wbAU2KwCJqUoz3sw":{"text":"No lines or crowds, easy atmosphere, and reasonable prices. \nFantastic fried chicken and t","useful":0,"cool":0},"kkJP-mrE2YnqRmS6mvmRgw":{"text":"Saint Lawrence is cute with a friendly staff but I was underwhelmed with the food. We ende","useful":6,"cool":6},"NaRDqfuJa0xKYFLnunM1-w":{"text":"My friends and I are here from Atlanta for the Essence Fest and came across this restauran","useful":1,"cool":0},"a0L_tZMT38oj7Y7b7Mb8Zw":{"text":"There are so many places to eat in the quarter and it's kind of a crapshoot especially wit","useful":0,"cool":0},"IlfcKU4yg77DBLmzM75sOA":{"text":"Saint Lawrence is a really chill spot to dine at if you're in the French Quarter. If you w","useful":0,"cool":0},"ZZIRrXi7j9eOCYDqlRPDzQ":{"text":"When vacationing in New Orleans sometimes you need a break from the raucous crowds, loud n","useful":20,"cool":17},"D-lM5Qb3SSxaUjY58yEXHQ":{"text":"I was starving and looking for somewhere to eat at 1am on a Thursday night. Yelp led me to","useful":1,"cool":1},"_qMPJomaw-GPjIBwcoHzQQ":{"text":"Absolutely loved it here!!! You walk in the door and someone is yelling or in your face wi","useful":0,"cool":0},"e9zgiWyIcrfYoy1aHYVhmg":{"text":"This might be my new favorite restaurant in New Orleans. Everything about Saint Lawrence s","useful":0,"cool":0},"PH7V98dpa5tnmduu5ZlzIw":{"text":"Simply put: they give a shit. Drinks on point. Food delicious. Service impeccable. I walke","useful":0,"cool":0},"gVdKoeFNoqyhSCTbcRwbtw":{"text":"If you're looking for a late-night after bar meal, then this is the place for you. The pla","useful":1,"cool":0},"2Ca1uHZVwU1p5radbeq2jw":{"text":"We had the Artisan Daquiris and the Confit wings so delish! So tasty and served was very a","useful":0,"cool":0},"m5gqOedxe79FZg5O3Ia3Yw":{"text":"Good late night eats. \nThere is a small bar offering daiquiris also.\nWith music videos pla","useful":3,"cool":0},"nNs-m-XxvPH2u_sZhfGlEA":{"text":"Went back again on my last trip and I have to say...what the actual heck?? I bragged to my","useful":7,"cool":3},"tGM1H-IWlQhc9ZCbaw9Taw":{"text":"I had the red beans! They were 100% delicious! I think they're the BEST in the city! The s","useful":0,"cool":0},"D5LQviytDI1P6d5C6bbdIg":{"text":"In a city full of scary sounding gasoline filled slushies that promise  to be the most alc","useful":2,"cool":1},"vEsZJplBwuRf0vKPs7x5Og":{"text":"Passed this place a few times before the icon of St Lawrence finally drew me in. Dam it, i","useful":0,"cool":0},"C1GyFsLMmetygTULRQbc1Q":{"text":"Seven of us ate dinner here on a weeknight. I made a reservation and they gave us a long t","useful":1,"cool":1},"YnjrEt4xy_cTFKJWd5GWOA":{"text":"Wanted a quick bite with no hassle... *BOOM* Found it! The chicken was seasoned well and c","useful":0,"cool":0},"uddeyzXpBoUHg2tZPJtywA":{"text":"Stumbled upon this gem after a conference. My colleagues and I decided to have lunch here.","useful":2,"cool":1},"3YGKCb1W9rOnOJdBsoWbLA":{"text":"I had the Bayou cheesesteak, I can't come up with any complaints whatsoever, the fries wer","useful":0,"cool":0},"3_ITWNexo95rZZQvzx47XA":{"text":"Awesome bar, with fun decor and a laid back vibe. The bartender was great and you haven't ","useful":0,"cool":0},"n0ZAC2DcPiMxsydoTj-cOQ":{"text":"Went back to St Lawrence again while here on vacation.  It was so good the first time we w","useful":1,"cool":1},"fR083xxpR86CxQYO2XCtpw":{"text":"Was recommended by the locals, it was the best decision we made on our vacation. Must eat!","useful":0,"cool":0},"8KBi9cM8sK_DpGq28hpLsA":{"text":"As a service industry worker in the Quarter, I get very tired of the same late night food ","useful":3,"cool":1},"HA7qAhng0g8XfN1PsfLV2A":{"text":"Really good burger.  Got suggestion to go here.  Not much on menu.  Only 1 burger choice. ","useful":0,"cool":0},"FyPn2fhl21FtnbDAK750FA":{"text":"Love the food love the drinks love the service when the dark haired bartender isn't there ","useful":0,"cool":0},"7pTWFxg_pSMkzDxLT4cL0A":{"text":"Okay,  we wanted something different before we cruise out tomorrow. I found this place and","useful":5,"cool":1},"VUDoOM6HfBeWu6ObMy-PYw":{"text":"I enjoyed the Mac & Cheese soooo much!!!!! Fried chicken was also amazing & the service wa","useful":0,"cool":1},"jq1U9qsKfci5iSxhxPqpUg":{"text":"This is a pub but you can bring kids in for a meal.  The food is great!  I loved the fish ","useful":1,"cool":1},"6TClv_58qYMqINPK_V87XQ":{"text":"Had a great lunch here while staying in New Orleans.   I tried the Oyster Tommye which con","useful":2,"cool":0},"LX_6mXyTQPO-XsTy9zdxBQ":{"text":"This place is great!! Our server Kieran was very knowledgeable and and nice. I had the fri","useful":1,"cool":0},"MDEoReFHXrh5BWdszhGPCQ":{"text":"It's open till 2 am in the quarter with great food. Their version of a cheesesteak, though","useful":0,"cool":0},"W8PCOvfvp3ywAUG6IyqEuA":{"text":"We were very impressed all the way around with the St. Lawrence Restaurant.  We spent a we","useful":0,"cool":0},"DiV1-3erPDDHpBa0aCv4ag":{"text":"Saint Lawrence is one of my favourite places to eat in New Orleans because of the great lo","useful":0,"cool":0},"dMi-by1ZhLWNg9DlxtYsZQ":{"text":"Saint Lawrence was what came up when I was searching for Mac and Cheese on Yelp. My friend","useful":2,"cool":1},"CGs4DTMbcVkUfgzeZY2cBQ":{"text":"We came in at 1:30am right before closing and we're seated by a friendly waitress who quic","useful":1,"cool":1},"OcoUKYi8TAs3Z1Qz8dzlwg":{"text":"Walking in on a Thursday evening around 8pm, we found St. Lawrence to be dimly lit, yet in","useful":2,"cool":1},"9WLmTG0rT3Cpeu_o5P5MRA":{"text":"I am a local who lives in the FQ.  Naturally I know the good places to eat and the ones to","useful":0,"cool":0},"Bppm5wvhLkppQ7cRu83dwg":{"text":"Not what it used to be.  Mediocre food at quality food prices.  The heavenly hash is not b","useful":3,"cool":2},"A1n0qZnYi8rWFKJEFeuuTw":{"text":"AMAZING. Definitely a must try when you are visiting NOLA. I ordered the chicken and waffl","useful":1,"cool":1},"g5cNIfpiOpXHY-Ovrogdbw":{"text":"Pre Covid review!\n\nWe came here on vacation and I forgot to write a review about this wond","useful":1,"cool":0},"JbZ_GaY2Oka32FkK4cEZhQ":{"text":"Ok, I actually just named Superior Seafood as the most disappointing place we visited in N","useful":1,"cool":0},"-wmt8vLIgkleJ2andUT7YA":{"text":"I don't love doing two star reviews, but on occasion it's warranted. So it's rare for me, ","useful":4,"cool":2},"ODekCGiubB3krR570NRdRw":{"text":"We really enjoyed Saint Lawrence last night. The food was excellent, especially the fried ","useful":0,"cool":0}}