{"zAOOCycbzdbA4ooZYWCyxw":{"text":"Lovely bar off the main track. Good beer and wine selection. We didnt eat there but everon","useful":1,"cool":1},"9k1pT9YDq2a593Qou9EjCA":{"text":"The crawfish shrimp and grits were out of this world amazing! The sweet potato fries were ","useful":0,"cool":0},"6j694VZ3CXQEOlYfFrLVPA":{"text":"very accommodating for our large group, awesome food and gave our bachelor party free slot","useful":1,"cool":0},"aMfklqA0RfMQFtVf4WU-tA":{"text":"Looked great, but not so great. Loved the outdoor patio, but Disappointed in the food. Mig","useful":0,"cool":0},"tHksMrNw0Iqx0yfcJCWXbg":{"text":"Came for dinner I had Evangeline's Pasta, let me say I've never been big on pasta however ","useful":0,"cool":0},"UqQkG2rvGYg5Zai1Ddq0hw":{"text":"Where to begin? The staff goes out of their way to be friendly and accommodating. The atmo","useful":0,"cool":0},"ezdLfGrJMMBUVp-gSJWNZA":{"text":"Great walk in dinner at the bar! Sean (sp) is fantastic & makes a great old fashioned! The","useful":1,"cool":0},"659EyqssuTxTkF0OoSsrvg":{"text":"Late lunch prior to wedding later in the evening. Very good ambience.  Lot of LSU fans.  P","useful":0,"cool":0},"P18PWMc2TdyIFPUq9p7Fdg":{"text":"Food was deeply mediocre. Service was terrible. Drinks tasted like limeade. Don't order so","useful":1,"cool":0},"Z14C8-mA603NJJaS-AZn2A":{"text":"Nice atmosphere. Probably the best shrimp Po-Boy I've had!! Location is easy to find at th","useful":0,"cool":0},"KhbX24Ztb4Jq8_lISe8QjQ":{"text":"My teenage daughter and I walked across the street to Evangeline's from our hotel on our f","useful":0,"cool":0},"AAR9M9qahSqiDkzYbDs_3Q":{"text":"Fantastic place with a unique menu and friendly staff. Outdoor courtyard in original style","useful":0,"cool":0},"Z9sUesR_Ns1BIWxTd-m58w":{"text":"OMGod... whoever has not had the Belgian Waffle with Crawfish .. has not experienced LIFE!","useful":0,"cool":0},"B2_PwoRvQraTzsq49lO2Qg":{"text":"Stopped in here for drinks before a show at the House of Blues. Adam the bartender was ver","useful":0,"cool":0},"WPSuNpyN2IfFpyNiXDF7fQ":{"text":"A highlight of our New Orleans trip.  BEST crawfish and grits we could have imagined.  The","useful":0,"cool":0},"HOOCwFsPFe_ic49vDRzsbg":{"text":"I hate doing this, but some places deserve one star. Would I ever go back?  No. Would I re","useful":1,"cool":0},"18HRNoSE5DVZgy4hx3zKCA":{"text":"Wow, this may just be my new favourite place in New Orleans. I came here on a somewhat bus","useful":0,"cool":0},"nBRK2AGPFkJzJv2EOxlFYw":{"text":"I came here with a party of 8. We made reservations for 8:00pm and were seated right away.","useful":0,"cool":0},"jXgjhQAEYnLk8M657ghFSg":{"text":"The gator bites are amazing! My first time trying gator and it was so good. The bar tender","useful":0,"cool":0},"sROwRE181ooktWYLpbxdUQ":{"text":"They get 5 stars for putting up with our crying baby, a great local beer list, solid red b","useful":1,"cool":0},"Bypkot6C0NCC3Y3Q77F26w":{"text":"Delicious!! We went here for my sisters bachelorette party and were 11 people.  I tried al","useful":0,"cool":0},"sP06ntZrPOuQmxpbihYkgw":{"text":"We happened to stumble upon this little gem on our way to the French Quarter and I am so g","useful":0,"cool":0},"lyB9rcDkZrB9dCtOPqWqHQ":{"text":"Stopped for brunch, sign was out for bottomless cocktails, but resturant wouldn't honor.  ","useful":1,"cool":0},"Un16olsRPGdg46KsZRGiLw":{"text":"Great brunch spot! Try the Pimm's cup. Waiter (Gary) was very friendly and knowledgeable! ","useful":0,"cool":0},"cABINI5TKAMMvEnZLB4E7A":{"text":"We had my husband's surprise birthday party there and everything was perfect. There were 1","useful":0,"cool":0},"KR3wNEfw8YorpBecDb8nrw":{"text":"Went here there other day on a whim. The Pimm's with Gingerale & Cucumber was an incredibl","useful":1,"cool":0},"UZvrCRc7sej2SA2cpteVYQ":{"text":"The crawfish and grits are one of the best things I've ever eaten.  Perfect!\n\nCrab cakes w","useful":0,"cool":0},"9juC1YGfLrxMp9pobW9L2g":{"text":"We weren't here long as it was a stop on our NOLA Beer Tour, but we lingered as long as we","useful":1,"cool":1},"SuuU2_YdtFzIUfCrGAG-cg":{"text":"Red beans & rice were perfect, not very spicy but flavorful and the cornbread was perfect,","useful":0,"cool":0},"7xUvgzNOPWwmBgqrvRXkgw":{"text":"The crawfish and Grits is AMAZINg!! Highly recommend. The pasta Evangeline is ok, good if ","useful":0,"cool":0},"1Bbmx_W_ta-J71tDVgriwA":{"text":"My wife and I had dinner here during our honeymoon and had an incredible experience, every","useful":0,"cool":0},"yaMv32P945U0qIHXn6dUZg":{"text":"We thoroughly enjoyed this restaurant! There were actually two groups of people in our gan","useful":1,"cool":0},"RSdgQYyNwv_uw5NXXDpDfw":{"text":"Grab a strawberry beer and the crawfish and grits!  Jack the bartender is amazing, makes a","useful":0,"cool":0},"9zB2acff3CcOnBDPjcYnZg":{"text":"So good! I had the crawfish and grits and my husband had the Jambalaya with Catfish. Both ","useful":0,"cool":0},"SUuwytKzo9mxP5X_pkrqPg":{"text":"We walked past this place many times and were intrigued by the menu and atmosphere.  Final","useful":1,"cool":1},"wiQx126jtge-S-voClHUSg":{"text":"Love this place. Try the crawfish étouffée, best I've had so far. The staff are a delight.","useful":0,"cool":0},"N_xtmflUHsvl4qjs4JU-uQ":{"text":"We had our rehearsal dinner for about 110 here and I cannot recommend this place enough as","useful":1,"cool":0},"RYEms7sOLZso8K_HRUrrjg":{"text":"Was in town for my birthday, and this was one of our stops on Mr. gumpo drinking tours.\n\nW","useful":0,"cool":0},"XZ5gOMUTPAyq9g4hvD0qXQ":{"text":"I love this Restaurant, for a while I was coming in every weekend to eat. Amazing food, he","useful":0,"cool":0},"Mla8jw_O8RMgGBfrY5wmVg":{"text":"Wondering around the French Quarter found this gem. Sat on the patio and had jambalaya and","useful":0,"cool":0},"_Zm86LujQl2wH30OWVbTPA":{"text":"After leaving the Naploeon House because of the awful atmosphere, we came across this plac","useful":4,"cool":2},"sO8IyadaZjZ9MMddubH3lg":{"text":"Very nice. We have had our first Cajun catfish tacos!! The best :)\nAnd syrup cake just out","useful":0,"cool":0},"f_bNCiiU-qkTqykVhAOlIw":{"text":"This place was amazing.  Clean and beautifully decorated.  Dominic my server/bartender was","useful":0,"cool":0},"_Ld44FvUvcVTkfvheoul6w":{"text":"A couple of NOLA virgins walk into Evangeline. They have the best meal of their lives. Sor","useful":0,"cool":0},"WKfAaNi4QYoiLyr5fmY05g":{"text":"Beautiful courtyard--ask to sit there. Absolutely fantastic food. Great crab cake appetize","useful":0,"cool":0},"6FqfM3UQu_-rZjeCKzNJWA":{"text":"Loved the food and the drink special they had. Nice atmosphere but casual dress is ok. I h","useful":0,"cool":0},"TU3lvlCdlU4an51lMmRktA":{"text":"Ate dinner here 4/22/16, while on vacation in NOLA. Probably one of our BEST meals! Delici","useful":0,"cool":0},"E9DFlUWgCK5QLB8C2V7wXA":{"text":"Couldn't have asked for more.  The place was packed but my husband and I were lucky to get","useful":0,"cool":0},"9vRCZ26WJ1obM51_xNtu3w":{"text":"5 stars for a fun experience with a fantastic staff. When we first sat down, the owner tol","useful":10,"cool":8},"WAlrRJCaj2t-sCMX0_h_dw":{"text":"Great atmosphere. Beautiful courtyard. Try the Jambalaya! And the Cajun Nachos. Possibly t","useful":0,"cool":0},"7yRNBfXABXrLsQZ6_sQRDw":{"text":"great place in the heart of new orleans that makes you feel like you're not in the center ","useful":0,"cool":0},"L0C4C998K2XZWHBNm-6Q-A":{"text":"The best crawfish and grits I've ever had. There is a reason Michael Simon thought the sam","useful":0,"cool":0},"RBJgDGXA5bb16WVCsWhBPQ":{"text":"We're here early for dinner and in time for happy hour. The food are amazing. We ordered t","useful":0,"cool":0},"x4LFTouuw1aKkcInyO4fTA":{"text":"Great ambiance!! Good food but even better drinks. Don't forget to go way inthe back for t","useful":3,"cool":1},"zujrP52ZkWamMwcv2Uj8gg":{"text":"Had a very enjoyable experience at Evangeline. Called ahead and made reservations and they","useful":0,"cool":0},"ZBpoeodCTkDtkIvBWX_F3A":{"text":"I tried several recommended restaurants in the the French Quarter...Evangeline was my favo","useful":0,"cool":0},"DKeSNSXCjtIbh6mUYyfMqA":{"text":"Good food but lousy ambiance.\n\nPositive is good NO food. Not high end but good quality.\n\nN","useful":1,"cool":0},"MKU1pJC529hT4uS4VO7VMg":{"text":"I found this place on Yelp and picked it mainly due to the fact that it was only 0.2 miles","useful":4,"cool":2},"-dgkrIDDrO3PMJtd8sJSnA":{"text":"After spending quite some time looking for a place to eat (and being sat and never served ","useful":0,"cool":0},"dyFQo7Tx_fY1ucO9Qbt2pg":{"text":"As a NOLA visitor, I can't attest to the consistency of this great little find, but in my ","useful":0,"cool":1},"aeZ_q8iC8FMNNe7O39Mawg":{"text":"We stumbled upon this place walking toward Canal St from Jackson Square.  Definitely looks","useful":0,"cool":0},"RY_EHpN964OjM4FXB7zyow":{"text":"Ate here because we kept passing it walking to & from our hotel and it looked  interesting","useful":0,"cool":0},"cyPP7534AWpyLrO0HW51Gg":{"text":"We wanted to check this place out because our daughter's middle name is Evangeline and aft","useful":13,"cool":13},"gJbhv6R32byHXHG16X4GLw":{"text":"We loved Evangeline, my co worker is related to the owner so we have gone every time we co","useful":1,"cool":1},"sRVCQlE68nMqW36agvUA4g":{"text":"Excellenr food. I  had the catfish with shrimp and grits. Very good!","useful":3,"cool":1},"DWi1NbZ05NZv5KbslF9CCg":{"text":"More of a bar than a restaurant. Food was OK. Service was meh. Crab cake appetizer is pict","useful":0,"cool":0},"_Nrqdi5y3HsZ0Te-K6YUwg":{"text":"Evangeline's was the perfect spot for dinner! I made a reservation for a bachelorette part","useful":0,"cool":0},"J2bGftmu1hvb1nAzqjd65Q":{"text":"What a fantastic evening! The food was amazing and the staff was even better! We came for ","useful":0,"cool":0},"pvABYNq2it02HbAUK1J4tA":{"text":"Ate here a few nights ago after checking the reviews.  Service was great and the food very","useful":0,"cool":0},"FHVmzYRwtIL5NBX2FhjCpA":{"text":"Stopped here the first night for dinner. Ordered gator bites and crawling etouffee. Gator ","useful":0,"cool":0},"oRHUxyKipIy-z9J9gVfcSA":{"text":"My wife and I stopped in on whim while walking around by the river.  I was looking for som","useful":0,"cool":0},"xP3ZcArEdgpIi6NuteBhhA":{"text":"Mostly good.  You can tell this is a pretty tight ship, except that the map yanks your cha","useful":0,"cool":0},"j6dYrSJlmUg6VTSMwzD7Jg":{"text":"The food was well prepared and very taste. Everyone in my group found the apps and entries","useful":0,"cool":0},"SLPAho_29H-c2Pzkyz8Bgg":{"text":"Such a beautiful patio and such courteous wait staff! Truly a hidden gem. I loved the saus","useful":1,"cool":1},"Hn14dUAkrCUs79HHI9pCLg":{"text":"Came in at 830pm for a reservation for my friends bachelore party. The server was not the ","useful":0,"cool":0},"Xa3uTUzqu6qFaVKw1OW8eQ":{"text":"Great Cajun food at reasonable prices! The service was quick and they were packed! Good pl","useful":2,"cool":0},"JYkSegbUcsp-QY_LI-ZWcw":{"text":"We came in for an early dinner and the server was good but it felt like every time she cam","useful":0,"cool":0},"zGypxScUHHYRveEJbmnIfw":{"text":"The patio is wonderful.  It's set back off the street; a very peaceful place to have a mea","useful":0,"cool":0},"ruFjR7ADoPlFoX9ZrZDDRA":{"text":"Unlimited Bloody Mary's or Mimosas before 1pm on Sunday! I had the Bloody Mary. YUM! The c","useful":1,"cool":0},"52t2Jbsi50h0tpKO2rtVJQ":{"text":"I love the fried oysters and the fried okra appetizers. That combo is my favorite meal to ","useful":0,"cool":0},"t70SeziP0Ju1lU8gddiQuw":{"text":"This was the best decision we made in New Orleans. They accommodated our large party, were","useful":0,"cool":0},"xH_fCtgCMPvt2p5RX8rxIQ":{"text":"Good mom and pop restaurant with amazing ambiance in the courtyard where it is away from t","useful":0,"cool":0},"X7MvXpApGxcgva7OgmVLLQ":{"text":"We stopped by after Haarah's on Saturday. We were greeted promptly and got a seat on the p","useful":0,"cool":0},"PHgfj1yhUug--eQSh5pUDg":{"text":"Awesome bacon wrapped BBQ shrimp!!!  Courtyard cute, but sat along street and people watch","useful":0,"cool":0},"rQgPSLn_km5zGDIsOyIm8g":{"text":"Evangeline, what happened to you? I was so excited to come back here, and was quite disapp","useful":0,"cool":0},"anXaPhym1R0wjqUJy2vSxA":{"text":"We were craving a po' boy and Yelp led us here. I'm giving it 5 stars just for the shrimp ","useful":0,"cool":0},"X2KKUS0BwzzFKlvnU94U1g":{"text":"Crawfish grits was an amazing dish. Great amosphere. Very authentic cuisine. Can't wait to","useful":0,"cool":0},"vJNd7M5gjG81IgYy-6A53w":{"text":"We really enjoyed our visit to Evangeline.  Sat outside in the expansive lighted courtyard","useful":1,"cool":1},"ChOemyb1l_xmywphX5C1sQ":{"text":"Delicious food, such a lovely atmosphere. Great patio area. Manager was so welcoming and a","useful":0,"cool":0},"CTCWbgZWmkprrO9O3Qy56g":{"text":"My group was in town for a convention and looked to me (as the NOLA veteran) to pick the s","useful":1,"cool":2},"79pNfoWyes5U2QIOUz2bgA":{"text":"Authentic, delicious Cajun/creole food. Stopped here while wandering the French Quarter fo","useful":0,"cool":0},"eEsyPgKyA1J7DlgtIsy5zw":{"text":"The atmosphere is very New Orleans!! Red brick walls inside almost give it a courtyard fee","useful":0,"cool":0},"YCwa3ORLdjH8ZcLzBLWRyg":{"text":"Fabulous service!  Everyone was welcoming and friendly.  An added bonus was the fun outdoo","useful":0,"cool":0},"R7MUXSAHcHxsYKgGIH2f8w":{"text":"Stopped in for late lunch while wandering around on my own. Great staff, atmosphere and me","useful":0,"cool":0},"XFFNaMkNDJw0i7dxTNeAKQ":{"text":"What an amazing restuarant and excellent service. They go above and beyond for bachelorett","useful":0,"cool":0},"aAWgVoXkSFHg6Ct12X53rQ":{"text":"The food and drinks were fantastic, the service was lacking!  Loved the French toast and o","useful":0,"cool":0},"7HqssCgaaEUMFU8k79uu4A":{"text":"My group of 15 had a fabulous time.   Wasn't sure what to expect because not many reviews ","useful":0,"cool":0},"3kW7vgtilMzlz59P8ycJ9Q":{"text":"Food was great. We tried the gator bites and had the jambalaya and the chicken special. Gr","useful":0,"cool":0},"vH5p_LWipP2DQWtBISXryQ":{"text":"Very cute small classy place. We didn't have reservation but us 7 ladies were seated promp","useful":3,"cool":1},"SI1BSbcxzqhrf8drMt_J6w":{"text":"I wandered in from a windy cloudy evening and was greeted with friendliness and warmth. Th","useful":0,"cool":0},"ACUzOMvEnqtDtrHwZVFjCQ":{"text":"Evangeline was the first restaurant I tried in New Orleans. I found it completely by chanc","useful":0,"cool":0},"dTxZtK5m-U9H2jfipOaB0A":{"text":"Went there for dinner - crab cakes were ok, crawfish etoufee was not good- tomato based no","useful":0,"cool":0},"gE-CMdOR6wW2vGFYChLTkA":{"text":"We got into New Orleans 4 hours late after a flight delay and were anxious for a drink and","useful":0,"cool":0},"cRVjPDPKMPHMOhUbXR0i9A":{"text":"This was the best food I had all weekend in New Orleans! I ordered the grits and crawfish ","useful":0,"cool":0},"k6G817AESLiDNoYOYo5Mew":{"text":"This review is really mixed.  The biggest thing I would say to the chef is to TASTE what y","useful":0,"cool":0},"hjdCctGNgENBIud15IQBWA":{"text":"Enjoyed my first blackened Bologna sandwich. It had red onion, Creole mustard, Krystal may","useful":0,"cool":0},"2vnO0KZVFAIS2dZd3bBcuw":{"text":"Had the adult grilled cheese, Evangeline pasta (with shrimp), and strawberry shortcake des","useful":2,"cool":1},"6l5I1j1x3ZftzRHfDQderg":{"text":"Dominique and Paul were awesome.  Great atmosphere and drinks. Thanks for the great time i","useful":0,"cool":0},"WC0KnsuBnB9oO1kFHkfrMQ":{"text":"My bridal party made a reservation at Evangeline's for dinner while in New Orleans for my ","useful":0,"cool":0},"q6EWKUbK1f-xnkrHOrF8Hg":{"text":"top notch food along with great service! the atmosphere was lovely as well! we loved the p","useful":0,"cool":0},"rl04ZBqyrxmENSN9yYBsvA":{"text":"My wife and I had a delicious late afternoon lunch here yesterday; the food was delicious;","useful":0,"cool":0},"5Yk7NXrxcXF86egoa_8_Hw":{"text":"Po-boys are anything but! No \"poor\" here. Loaded with perfectly cooked, crunchy on the out","useful":2,"cool":1},"rsjvB3gC07bznK8li9DVOw":{"text":"Great food and drinks. Ordered frozen drinks and sandwiches. Stopped in after a long day o","useful":0,"cool":0},"VtswTJVbUYT4Ug5rjlLFCw":{"text":"I came for a drink and a quick bite. The bartender and manager were fantastic, both chatty","useful":0,"cool":0},"cWouwulmyjlw7I-7xQhjVA":{"text":"Fantastic food and service with Southern hospitality. So glad we stopped here after a rowd","useful":1,"cool":0},"OClm0CdJPYo0SYDSdSQ4Ng":{"text":"This place was suggested to me for big groups by a friend who had recently gone. I was abl","useful":0,"cool":0},"oFBzW_XQzGfXRH1ajBpMLg":{"text":"Came in for a dinner on the first night in NOLA. The reviews were pretty great so thought.","useful":1,"cool":1},"o6FFDlR8NNUKmVibbjHNHA":{"text":"Sat at the bar; I ordered a Sazerac & the niece ordered a tequila mojito. Both cocktails w","useful":1,"cool":1},"1uArY76Nqy-W1hfR1KeJeA":{"text":"This food was so good! Do yourself a favor and stop here and eat the crawfish and grits!! ","useful":0,"cool":0},"24JRg6H3B_9hX5nsL0EVwQ":{"text":"Visited two days in a row. Owners are delightful. Atmosphere is great and prices are good.","useful":0,"cool":0},"iIkbG79_kdkKKTP8BtDs8w":{"text":"We stopped in to this little gem as part of the NOLA Beer Tour (which was a lot of fun). T","useful":0,"cool":0},"Hqi86MaOfc647Z5rmj2V3Q":{"text":"So yummy!!! The courtyard is a lovely spot to eat and the sausage trio appetizer was amazi","useful":0,"cool":0},"5gYryOO8wUpZfzLxilRiIA":{"text":"Fantastic food and service.   The crab-cakes are better than anything I've had in either B","useful":0,"cool":0},"VINXUO-dVbOlJQodqCYAgw":{"text":"We brought our company out from California to experience New Orleans and an hour after lan","useful":1,"cool":0},"xVmTL5_yDeUVTe9w7CXAWg":{"text":"My wife and I were in town over the weekend and stopped here for a late night snack/dinner","useful":0,"cool":0},"FzjoVPZ6TIVN6bI9E2WNhA":{"text":"Love the crab cakes Benedict with potatoes. Super yummy and worth the wait. The icing on t","useful":0,"cool":0},"RWQ69wcvS9hPSs-KzrxSRw":{"text":"I give this a \"meh\". Service and ambiance were nice, but I was disappointed in my food. I ","useful":0,"cool":0},"fCzEYCjOiiFb5CKCONaICA":{"text":"We went here on Sunday May 22.\nGo here for a drink but not the food, basic at best! Servic","useful":0,"cool":0},"rwysZ9L2AidTPhF1uoZOSA":{"text":"I was blown away with the service, food, and atmosphere at Evangeline. I made a special re","useful":0,"cool":0},"AjVa4S_GfL2oB8fXukC9wA":{"text":"Maybe I ordered wrong but I wasn't wowed by the food, although the bartender that served m","useful":1,"cool":1},"NWv3e5FU6qmQRQKVv4WHcA":{"text":"The service was attentive and friendly and I almost left four stars but my food was just n","useful":0,"cool":0},"dfftjLaK-92fqtPf9c6cuw":{"text":"The food was amazing! Really inexpensive and delicious. Something for everyone in the grou","useful":0,"cool":0},"zb7GtWzKFng2yWGJ-uvXkw":{"text":"Happy hour.  Quiet evening.  \nSeated at the bar which turned out to be a bad decision.  Al","useful":0,"cool":0},"nuu_qJxE4REHxE7LRB4DxQ":{"text":"Gotta love this place! Great food, great service, and always a great experience. Evangilin","useful":0,"cool":0},"cIGfaVPY_IY4sfhOuuF56Q":{"text":"This is a nice little restaurant. They have a back patio, perfect for a quiet dinner. They","useful":1,"cool":1},"dTY3OOpVlvCyy1HjzkgkRQ":{"text":"Came for a late lunch on a Saturday and had the patio nearly to ourselves. Had the fried o","useful":0,"cool":0},"xA_I9cm3EqsAqI0frB-IhA":{"text":"Food is excellent. Service was iffy. Had to flag down a different server to refill after g","useful":0,"cool":1},"Tg0NDSpGuLZ2WDExSoyiig":{"text":"There were 3 other people in the place for brunch. We sat at the bar. The server was nice,","useful":4,"cool":1},"x_EGQ_KdUJHtrsDOpoEanw":{"text":"We experienced Evangeline for Happy Hour (till 6pm) just before getting on the Steamboat. ","useful":0,"cool":0},"5fm1mfx4zj8KQiU7vlrvIA":{"text":"Worst service I have ever had in my life. We had a large group that they could have made a","useful":1,"cool":1},"oRF2MRt2qV6xAL-Y6t6FTg":{"text":"We got a friend's recommendation to hit up Evangeline before arriving so we made a point t","useful":0,"cool":0},"d1a_AhR4k88waptN_A2dcw":{"text":"It was awesome. Really good beer selection. Fresh food an huge portion. Nice service and v","useful":1,"cool":1},"0pIE2LhwiHYpL31CW6I3nA":{"text":"I found this restaurant after looking for new places on Yelp. The reviews were pretty good","useful":1,"cool":0},"lKBWTApwTIvIvwmi5LKZqA":{"text":"Food was amazing!!! I am huge fan of the Spicy chicken Jambalaya it was amazing.   our wai","useful":0,"cool":0},"2nckJfaDWVyVjJL82TAGtw":{"text":"Great, quite place. The girlfriend and I found this place not far from our hotel and wante","useful":0,"cool":0},"XWBtVsxvc9IpnwwipITl1g":{"text":"This is one of the few places we looked up on Yelp that doesn't have 100+ reviews but is s","useful":6,"cool":4},"lABo0jmYp-ENsqUtx8ahtg":{"text":"Did a large group dinner here- 25+ people. one server for the whole table- she was great a","useful":1,"cool":0},"k1Mhut17X_SFWpQ8VuYMng":{"text":"Facebook Memories popped up today and reminded me that we were at Evangelines this time la","useful":0,"cool":0},"Zs1A9KMl4WG0XB0Ko4e0-g":{"text":"You have to have the crawfish grits and the alligator biscuits in gravy for brunch!! My hu","useful":0,"cool":0},"-bik7W-aChH9OPcIP5lLFg":{"text":"Quiet refuge in French Quarter!  We enjoyed the quiet, warm setting here, and the food was","useful":0,"cool":0},"pCPDGHbIs8jxsV3tdcRLSg":{"text":"We visited on a quiet Saturday night, and were immediately seated. Our server was new, so ","useful":0,"cool":0},"Yv2ChNlag-cE_0VZTMvMlA":{"text":"Can't say enough about how wonderful owner Rhonda was with booking/answering questions/ do","useful":0,"cool":0},"s6yTcMRL6IfuOBUNv5jEvA":{"text":"Service was super slow, food was terrible. Came here for our last night in New Orleans and","useful":0,"cool":0},"_NVSUqusJtUwxEV_xwDc8g":{"text":"We visited Evangeline for my friend's bachelorette party. They were more than accommodatin","useful":0,"cool":0},"FrGZKanx_crTQYb6HRS2RQ":{"text":"Great food and fabulous service!  Cozette was the best server she was friendly and extreme","useful":0,"cool":0},"4ifSsSrNffU4cKHV4X0bjA":{"text":"Good causal vibe in the patio! Great for romance or a small group. \n\nPatio-5 stars\nFood-3.","useful":1,"cool":0},"p2Ybtk80o39qCJRse3MawA":{"text":"First visit to NOLA, and this was our first stop for dinner. Definitely made a reservation","useful":1,"cool":2},"VLZ9Aa8I9ow1lIIRaePdyQ":{"text":"Excellent place! I had the red beans and rice. It was delicious and I'll definitely be bac","useful":0,"cool":0},"cMyLzZ7DV54mbsVfYWyuAA":{"text":"What a great little place. Wasn't very lacked when we went so we didn't wait for anything.","useful":0,"cool":0},"tGDlzGPlwOuGgod5i0EeaQ":{"text":"What a lovely evening! We had exceptional food, ambiance, and service. We sat out on the p","useful":0,"cool":0},"UTn9ZoeqaUhBbx27rvxH8Q":{"text":"This restaurant is one of my favorites in NOLA! We stopped in on a random December night a","useful":0,"cool":0},"Ea9t1QOc6F93-nX86bsbWQ":{"text":"The food was pretty good, maybe an 8/10 (I should have ordered the crawfish etoufee), but ","useful":1,"cool":0},"vU_B7krPNcytu5zNH16nKg":{"text":"Great food and even better service. We had the gator bites and the gator gumbo and they al","useful":0,"cool":0},"oo3SmAJuWvYvyJPvEA6law":{"text":"Great atmosphere and friendly staff.   Food was not anything to write home about. Shrimp p","useful":0,"cool":0},"ZOwIItvUjYSLTRosDz6U3A":{"text":"Went last night for dinner and it was great! The building itself is really neat with the e","useful":1,"cool":1},"DF59mbuuDe7hMRHB3K8-MQ":{"text":"Prices are a bit high, but the food and service was very good. Great atmosphere, very rela","useful":0,"cool":0},"I6eSo7h5wOCk1uHCKB09OA":{"text":"Im apprehensive to give this place a great review, because I kind of want to keep it my aw","useful":0,"cool":0},"8KApGKFCDyIW6HEhY49Ehw":{"text":"Grabbed a quick bite and brew before a show at House of Blues. Sat at the bar so as not to","useful":0,"cool":0},"4yO-EOPCfyCD6wDa2rDcnA":{"text":"Stopped by there for a quick drink but ended up staying for several hours. Staff is most p","useful":0,"cool":0},"1tse1-ElkbZuGNffqt1CxQ":{"text":"I hate leaving bad reviews so I'll start with the positives - good service and a cute rest","useful":0,"cool":0},"n-8g8Y9fCc4pK11u38texw":{"text":"This is an authentic and charming gem!! Krissi was very personable, genuine, attentive, in","useful":0,"cool":0},"zn2MWD2rW-hyDwE6qnGejQ":{"text":"Great place for good food and drinks!! My friends and I came for happy hour. Wonderful app","useful":0,"cool":0},"lXCHnfpwQTnY-TBtbiurPw":{"text":"I'm not sure if my expectations were too high, but they were really just alright. The loca","useful":0,"cool":0},"2bS-0YmZv3-JmyXbwtct3g":{"text":"Beautiful courtyard! Ask for the bartender special, not on the  menu: Summer Sensation. Re","useful":1,"cool":0},"_UnZPe7jultGhNp7dlfgWQ":{"text":"Review for the bar only. \n\nNice selection of drinks at a range of prices. Love the pomegra","useful":0,"cool":0},"kt9pYRHb4ps0MlGO_7q_Rw":{"text":"Nothing terribly special except for decent comfort food served in an atmosphere that permi","useful":0,"cool":0},"EsxDRTTVawqnd3yF1B6dQA":{"text":"Made reservations the day of for 8 of us for our friends 40th. When we got there we were t","useful":1,"cool":0},"Qi74RCZUaGjX4HJoy1iaDA":{"text":"First time in the French quarter and this restaurant is a must! Great food and great servi","useful":0,"cool":0},"kMK1Qeq9bih2Pd4Cn20DbA":{"text":"I really wanted to like this place. Cute outdoor patio in the back, interesting bar ambian","useful":2,"cool":0},"viEFNsoSLNhRq9jQH5godw":{"text":"All I can say is Evangeline is excellent! !  Very unique and unassuming.   The sausage sam","useful":0,"cool":0},"2tXBZ4yhgeGnmU3CTnXVyg":{"text":"We stopped in here on a Sunday afternoon just after arriving in town. The vibe and decor a","useful":0,"cool":1},"oPbYElh0sojcnBReXif3RQ":{"text":"This is some of the freshest seafood you're going to taste in a true New Orleans flair. Th","useful":0,"cool":0},"U_HokOqu6YNZHC0gPkFqHA":{"text":"This place was so freaking delicious. I will definitely eat here again the next time I vis","useful":0,"cool":0},"3z3gHeExDVT3GeeOqL49Qw":{"text":"When we saw this place had been on the Food Network, we decided to make reservations. We s","useful":0,"cool":0},"Ll9dUYk9vmma05XCAwaqaA":{"text":"The staff was unorganized, the biscuits had no flavor and did not taste homemade. The requ","useful":1,"cool":0},"nJayQTtuJLfIq1MmrJKsuA":{"text":"We were standing next to this bistro looking  at Yelp and read the brunch menu and bottoml","useful":0,"cool":0},"12oEodXDhkrqwHQyhjNv1Q":{"text":"What an incredible find.  It only looks like a coozy corner bar until you walk through the","useful":0,"cool":0},"VWLwRU6hc-3JjNMdZuZAvA":{"text":"The food here is delicious and very reasonable. Get there early for dinner because it gets","useful":1,"cool":0},"7WkYKNv_d24moMVPEGTttA":{"text":"TRY THE CRAWFISH AND GRITS! We walked in and were seated immediately at the bar. The servi","useful":0,"cool":1},"W_fGJBilgT74Y23-B0zPBA":{"text":"We went here for lunch during our trip to New Orleans. It was simply delicious! They had a","useful":0,"cool":0},"oL70idI5bdjVQV_BRwMNXg":{"text":"Checked out this place while in town for a conference. We decided to sit outside. While th","useful":0,"cool":0},"ruij78ncIFM8rxUok7rFDw":{"text":"Atmosphere was excellent, both inside and in the courtyard.  Food was excellent, with a go","useful":2,"cool":0},"gL0bVfVFvRN35dTcuAHHjw":{"text":"Excellent food but simply the worst service I've ever had in 25 years of coming to Nola. M","useful":0,"cool":0},"-sEfd-R6lWvyKx8AFcsx_A":{"text":"After watching a coking show with this restaurant as one of the selected places we decided","useful":0,"cool":0},"aOe4YYyYE2l137o_RuzTWw":{"text":"This restaurant never disappoints! Great trout special, amazing cheesecake situation and a","useful":1,"cool":1},"Zxpxs990e1WKTXqTL3f_IQ":{"text":"Pretty mediocre experience overall. Service was slow. Had to ask for things multiple times","useful":1,"cool":0},"Gy-A1xehnepAbyMF84F4Rw":{"text":"Used YELP to find out about this place and really glad we did.  We were in the mood for a ","useful":4,"cool":2},"eLzE8BYOjF0D9orlcuatbQ":{"text":"We went here for dinner after a day of walking and exploring. Saw the reviews and thought ","useful":0,"cool":0},"WhkkKX3RXMGiLHIOVF5ODw":{"text":"3 of us went, ordered 3 different meals, and all 3 are some of the greatest things we've e","useful":0,"cool":0},"68k5zttQaxoQ_8tNNOLQ0A":{"text":"The food was on par with many of the restaurants in the French quarter, came in for lunch ","useful":0,"cool":0},"8AV_1xozagI9uv2japRtlA":{"text":"I love yelp for guiding me to this restaurant. The food is beyond amazing and the service ","useful":0,"cool":0},"2N_NuKMtC3Pi0AnvW8nNPQ":{"text":"Very cool FQ joint.  A bit high priced but the location and food are perfect.  My wife and","useful":0,"cool":0},"Y1CWd9MkKV3NzPSKdETETg":{"text":"This place has an excellent back patio good for groups to chillout in and the drinks are a","useful":0,"cool":0},"QdFXoOfIqtkddcVx_V5A4A":{"text":"Stopped in at Evangeline's for a late lunch and ate the best food I had in New Orleans. I ","useful":1,"cool":0},"EG_dmhMxSRszcIxiLXasqQ":{"text":"The food was very good, but the service left much to be desired. We stopped in to have a q","useful":2,"cool":0},"fOu1fNUUVT87Phx52vF7VQ":{"text":"I stumbled across Evangeline yesterday afternoon during my search for boiled crawfish. The","useful":0,"cool":0},"QZ7isiKfORtur47GkUbDuA":{"text":"Stopped in on a Friday for lunch.\nPlace was super nice, ate in the courtyard which was chi","useful":2,"cool":0},"OHnx-nyRuVqM0A7svycDGg":{"text":"We have been visiting New Orleans for several years and have ate at many wonderful restaur","useful":1,"cool":0},"41N3_EzU6mSf0F2RuaiG0w":{"text":"While we were roaming the streets of NOLA, we saw the happy hour sign at Evangeline and de","useful":1,"cool":1},"1PYRQyE8NHx5yEMsDxfa8A":{"text":"Great spot we stumbled upon. Very good foot and drinks. The service was lovely,  thanks to","useful":0,"cool":0},"V64dVYSUQogvUs8gSDo9QQ":{"text":"Pretty good overall. I had the crawfish and grits dish which was featured on the food netw","useful":0,"cool":0},"aQilCFrvDRcQzXhTFh3oNw":{"text":"OMG, the BBQ shrimp and chedder grits was amazing! It was tons of food, and I devoured tha","useful":4,"cool":3},"yUhK0jbtTqVbgja0K2u2hQ":{"text":"Intimate, rustic, candlelit restaurant. I had an amazing dinner with my husband. I thoroug","useful":1,"cool":0},"Nz-yo8sIPitJBt1jMJRoNg":{"text":"Came here for breakfast a couple of times while visiting. Get the crawfish and grits, you ","useful":1,"cool":0},"yY0-Ek6S46Fl5ZdJBIBVlQ":{"text":"The Crab Cake appetizer was wonderful, paired with the outstanding draft beer selection m,","useful":0,"cool":0},"5qoPjFErQcM_YAkGaaM-Cg":{"text":"My favorite restaurant in the French Quarter, if not all of New Orleans!\nI have the good f","useful":2,"cool":1},"_MprFZs2Jtu3o8nv-i8cIA":{"text":"WTF!  Just NO!  Horrible service. Waited over an hour for our food and then the presentati","useful":0,"cool":0},"x2IfeL55SOBWH_k0NGLztg":{"text":"Great food. Great waiter. Ordered the soft-shell crab pasta special. It was amazing. The p","useful":0,"cool":0},"rDrK4s2h5yf11xeBuqObwQ":{"text":"This is a great hangout. Jenny, who we later change to Vivian, was an awesome bartender wh","useful":4,"cool":3},"UeJeWuB4zDNJkoP_AyBV8Q":{"text":"We did fishing today and brought our catches in. The chef cooked our trouts and red fish i","useful":1,"cool":0},"NVe5kCKuXEmAZAAELZd-PA":{"text":"We enjoyed the food so much that we ate here twice during our 4 day stay. The first night,","useful":0,"cool":0},"QNaBVVTCaP2HlTNTDKKdcg":{"text":"Went for dinner and it was wonderful. Went with a friend who can't eat gluten & they were ","useful":0,"cool":0},"jwQO2HObUidUp243iIP0yA":{"text":"It was our first night in New Orleans and we wanted some traditional local food. They have","useful":0,"cool":0},"QHxQXp3w-dl9PaZZvRCOGQ":{"text":"Don't go here... (editing this post to help management understand) management should never","useful":0,"cool":0},"EA77iGlPPENI9fLRsyKkLQ":{"text":"Left a bad taste in my mouth- literally. Was very excited to try this restaurant based on ","useful":0,"cool":0},"rtZIMybzQxVWpvtbffSK2A":{"text":"This place is amazing, you will meet great people while sitting in the court yard.  Love t","useful":0,"cool":0},"DYVyQygGZuEdpBAtuEWK9Q":{"text":"We happened upon this glorious find. As we were strollimg through NOLA on a super hot sund","useful":0,"cool":0},"7ahwa2XblwG-_4_4FKdGtw":{"text":"Bacon wrapped shrimp and crawfish and grits were yum. Servers were a little chaotic but fr","useful":0,"cool":0},"9RIQKI7oDnqlRDfsG3cJxQ":{"text":"Stopped in here after a walk down Bourbon Street at about 4:00 on a Saturday. It wasn't ve","useful":0,"cool":0},"TcK2PeXFuzETylpANAPD8g":{"text":"Yet another fantastic  meal.  If these folks ever open a place in Baton Rouge, I'm doomed,","useful":0,"cool":0},"ONgje798oZLO71F3nlDOag":{"text":"A nice restaurant in the French Quarter away from all of the noise. Evangeline made for a ","useful":0,"cool":0},"RBWor8uqS2RK7Cv-blAfDg":{"text":"Stopped in here late one eve for desert. Biegnets on crack were out of this world. Pecan p","useful":0,"cool":0},"k9YK1u_CVX15z0hHrhPz7g":{"text":"BEST PLACE FOR A PRIVATE PARTY!!  \n\nWe had our rehearsal dinner here on May 22nd and it ex","useful":1,"cool":0},"0KeuhgUCXRWMBdiw5mcLpg":{"text":"Fantastic food. My wife needs to eat eat GF and we had the sausage apps , etouffee and cra","useful":0,"cool":0},"FlCOZz1RUfwTkc1DnmPxPg":{"text":"This is a great little find while walking from our hotel. It has great food/drinks and imp","useful":0,"cool":1},"dFIX0sJ60DhhCtAs-qOzzw":{"text":"Great food, great atmosphere, great service. Jambalaya was outstanding. Carrot cake to die","useful":0,"cool":0},"Ip86-Q9eCtDGRXzOdyETGw":{"text":"In new orleans for a conference and happened to stroll down the street looking for a place","useful":0,"cool":0},"b9zxYbUs2lNQp3QAs_LJvA":{"text":"Great and personable service, delicious and authentic food, and reasonable prices. Not too","useful":0,"cool":0},"TmP3cG0ncNjqtEwKxNNLLA":{"text":"Used Yelp as a reference before I picked this place. I quickly regretted it. The food was ","useful":0,"cool":0},"gZcOIL_uchD-p7H123-wdw":{"text":"Great food and great staff. I loved the jazz combo and the etouffee was better than K Paul","useful":0,"cool":0},"8Iib4INigYAQVHApqVz74w":{"text":"Evangelize is a cozy and seemingly lightly ventured spot off the corner of Conti and Deaca","useful":0,"cool":0},"yrqlE_GpsKIs3HMDJow7uA":{"text":"Can't tell u about the food cause our sever never came to the table. Was t busy, so very s","useful":0,"cool":0},"UjGFQLGoOxTaOY6D7EHLFA":{"text":"Came during happy hour! waitress was energetic and on top of things, very good service! I ","useful":0,"cool":0},"srtPq7Zm_8vtwqmdZXz2sw":{"text":"Stopped in here for a quick drink and no food. We sat at the bar. My son ordered a cocktai","useful":2,"cool":1},"PKpFE1FIz5NM_QhQqb7aKQ":{"text":"We came here on a Sunday evening as a party of six for a quick dinner.  We ordered the jam","useful":0,"cool":0},"gktTG6tzClmFi23XF8Df1g":{"text":"After Bourbon Street overload I wanted to find a smaller subdued place.  Just what I neede","useful":0,"cool":0},"KA_1yX5434-YwhGK_Un_3g":{"text":"Went here for a bachelorette dinner. The food was AMAZING. \n\nFor starters, they have live ","useful":0,"cool":0},"8Kgu4AtZI_Qr1QEF4fW2sQ":{"text":"The crawfish and corn bisque is a winner the staff is friendly and knowledgeable try to ea","useful":1,"cool":1},"jPohTZwumihl6GYommo6pQ":{"text":"We were staying at the Sheraton on Canal & went to eat dinner on our last night in New Orl","useful":0,"cool":0},"vVuHJ8UiZKwYkSYaJnVh3w":{"text":"I insisted on stopping for happy hour (3-6) bc it's named after my sister. Ordered okra, c","useful":0,"cool":0},"IavR8B_bo8SaaOevY8ZE0Q":{"text":"Fantastic! If you happen to be in this city and are looking for great Creole - you MUST ea","useful":0,"cool":0},"rSrh7_4RRLWloCg0bPeemg":{"text":"Awesome establishment. Weird service but definitely in a good way and entertaining. Food g","useful":0,"cool":0},"_uDE2p7G6N2zN6A1EbJ6Lw":{"text":"This is a lovely place. Friendly staff that welcome you as you enter the semi dark venue. ","useful":2,"cool":0},"0ndrZcXrmab_sfNi7d-Z4Q":{"text":"My favorite shrimp po'boy ever. It's a hidden gem with a great courtyard and even better f","useful":0,"cool":0},"-bLHUw7bxgcGQC22osdqWw":{"text":"Great little find in the heart of the French quarter!  Had the Acadia crawfish and grits- ","useful":0,"cool":0},"jVI2J2NzmjS801qJFaRKCw":{"text":"After a long day touring the WWII museum, we were strolling back into town and happened up","useful":0,"cool":1},"YSxu-VNO07C3licafMTYDg":{"text":"We had a lovely meal here tonight. Took our 2 children around 7pm and had no wait for a gr","useful":1,"cool":1},"svMFjzQ-v2BSxpD0VBIINg":{"text":"The fried okra was the best I've ever tasted! The gator sausage, which was part of the sau","useful":0,"cool":0},"qSBjH9xorscSBAd4GXT02A":{"text":"Stopped here on a Wednesday night because it looked so appealing from the outside and my p","useful":0,"cool":0},"SYCLCj0zWO0A0X26gwuhAw":{"text":"This www my favorite place I've ate at while in NOLA. I went for dinner and for brunch. Fo","useful":1,"cool":1},"Grl-fCDhPR2_O5nS-rmuSg":{"text":"We had the crab cakes, Pasta Evangeline, alligator etouffee, and their 12oz ribeye.  It wa","useful":1,"cool":0},"6kGYkaAIk9OyCo_0FmOEPg":{"text":"A buddy and I went here on a whim, and it was a wonderful decision. This place has the bes","useful":0,"cool":0},"8zGfcjKIvHV_d6HSK76UoA":{"text":"Formal local. Visited with a group who had no been to NOLA before Great food, atmosphere, ","useful":0,"cool":0},"aT2mpMs-zK2LuhKtVdRVAw":{"text":"I came here for dinner one night and had a sampler of 3 separate meals: gumbo, red beans &","useful":1,"cool":0},"4c5hp5KjTK3joLN5k1mrFA":{"text":"My family and I had dinner here last night and the 30 minute wait was well worth it! The h","useful":0,"cool":0},"HW2qYFoWjOIbu_j8K3x8mg":{"text":"The service here was extremely poor. They forgot my wife's side salad, never gave us any r","useful":0,"cool":0},"htCDh99tZHje7Llsi5GMQg":{"text":"Evangeline is super cute, and a nice low-key spot in what is a sometimes too-crazy French ","useful":0,"cool":0},"nte9ohZmvlQQvI197uylqw":{"text":"Rude and pretentious servers.  Food was ok but it made me sick later that night.  I really","useful":2,"cool":0},"pGVN2NwlnHxDRf6ikevByg":{"text":"The interior is as pretty as the Longfellow Poem that serves as this establishments name s","useful":2,"cool":1},"UIhi4XEG8sMJ-YWPePsVrw":{"text":"We went to Evangelines on a Sat for Brunch, there were six of us and the place only had tw","useful":0,"cool":0},"6qoXEkbvPmtpOXB-wXELwA":{"text":"Evangeline was nearly one of the hand full of restaurants that my Darling and I exited in ","useful":0,"cool":0},"3LDEjIRCoxmMA07H4hWDpA":{"text":"We stumbled upon this amazing restaurant on Tuesday night - it was so good that we encoura","useful":4,"cool":1},"IXZnV0PNR9sI91o7yT34sA":{"text":"The bartender was our server- McKenzie (sorry if  I spelled your name wrong:)) and he rock","useful":2,"cool":1},"YvgmYkdStoKIlezvUmyilA":{"text":"Had a wonderful dinner here. Great space, nice decor, food and drinks were fantastic. Had ","useful":0,"cool":0},"lK2whLBqMz-f995ftc3RGg":{"text":"We had the Decatur burger and the Blackened Chicken Salad and the fried okra for an appeti","useful":1,"cool":0},"0al-3gZJZRjfYVQUw4-UtA":{"text":"We visited during French Quarter Fest and this was a welcome retreat!  We sat on the patio","useful":0,"cool":0},"ugFNbvMSlLHTr2npwJMYEA":{"text":"Checked into hotel and headed out to see the town here on a lazy Sunday afternoon. My sist","useful":0,"cool":0},"w_-WelynbfwL-tsqbXhfDw":{"text":"Five stars for the food! Friggin' d-lish! We found this place on Yelp cuz I was craving sh","useful":5,"cool":3},"MpFEZbW4nrosrwwroVM7nQ":{"text":"Great food, impeccable service. Happy hour has some great appetizers but the happy hour po","useful":0,"cool":0},"DH-Dpc_zQYCSBUNMd7dDXw":{"text":"Stopped here due to the good reviews and the location to things in the French Quarter and ","useful":0,"cool":0},"T3A2qzW4cXgGIaXKmw_bWg":{"text":"Ordered the crawfish etouffé.  It was spicy and we'll flavored, but.... It was sure as hec","useful":0,"cool":0},"Tbv4ULK4s6Rb6QxgbaX9xA":{"text":"5 stars for the music! Live Jazz Duo! Perfect dinner music, absolutely adorable friendly c","useful":2,"cool":0},"lS4Lsm332buxzq6warwCXw":{"text":"My friends and I were the only table inside and there were 2 tables out on their patio.  I","useful":3,"cool":2},"KTCex4oUMbRgOOyazPogpw":{"text":"Wonderful food & a great atmosphere, there are tons of places in NOLA but you should defin","useful":0,"cool":0},"PwGcI2ScUrp5O0F-cLsWFA":{"text":"Judging by the fact everyone's food was eaten in record time,  the food is delicious.  I'l","useful":1,"cool":0},"4jqJ8tNe9vJwQIKQD_hFLw":{"text":"Great choice for a leisurely al fresco meal in the French Quarter.  Our party of 12 scored","useful":1,"cool":0},"zOh_4k1D9y9hamBHeObe0g":{"text":"Great courtyard and drinks to go! Awesome food - great place for parade watching! Close to","useful":0,"cool":0},"fiDueq_nKp1d8QWCo6F_cg":{"text":"Randomly the best Po' Boy I had while I was in New Orleans! That includes Felix's! Also, t","useful":1,"cool":0},"43HzXCwylz4RLMzHwjA0Jw":{"text":"We stumbled past this place when we were looking for somewhere nice and cheap to eat. Ther","useful":0,"cool":1},"4h8dgXx_tvU887_T4qF87g":{"text":"We stopped in for the third time at this cozy restaurant and bar located just off the main","useful":1,"cool":0},"mHhTjg0XKSJKJ2Fn8NrC7g":{"text":"The appetizers were fantastic! I was excited about the entree but thoroughly disappointed ","useful":1,"cool":0},"tdUdjhhTyX60Oc0id74N3Q":{"text":"Found this place on yelp on the way into town from Houston Dallas. With a car full of tire","useful":1,"cool":0},"46r725RRa_fkr08f3xAnjg":{"text":"Saw this restaurant on Diners, Drive ins & Dives, and while it isn't any of those it was a","useful":1,"cool":1},"BYezvLPBVQBjQn_UeyaH6A":{"text":"This was the first restaurant we went in new Orleans and it was great. Nice relaxed enviro","useful":1,"cool":0},"fXhSkLQDylIOdM7_Q-B5gw":{"text":"On a recent trip to NOLA, we happened upon this little gem.  Stopped in just to get one be","useful":2,"cool":1},"YvBbc8-mnm2cEp8tiB8RAw":{"text":"Really enjoyed this resraurant. Very friendly and attentive staff. Dominique was exception","useful":0,"cool":0},"4tm8AjIB8W9stxKx64DfgA":{"text":"This was a decent restaurant in the tourest part of town,. My wife had the etoufee and I h","useful":1,"cool":1},"Wm__PE98O1bCRhduBwixaQ":{"text":"In the more gentrified part of the French Quarters near the Urban Outfitters, beer brewery","useful":0,"cool":0},"DPcc3iygHczrpFdro-qWeA":{"text":"Meh...we should have know this wasn't the best place for dinner since we were the only pat","useful":2,"cool":0},"m1uKR3Fj2WYqWrzegpdRnA":{"text":"I can't say enough good things about Evangeline's. \n\nThis place is an absolute gem! We spe","useful":0,"cool":0},"zNxKbb1UMd2ycqSmJ4VOew":{"text":"Pork Cheeks were so tender and the mashed sweet potatoes underneath was a stroke of genius","useful":0,"cool":0},"epQlQVDg00tN7zveI_XHPQ":{"text":"Wanted to like this place but was not pleased with the manager. Our omelets were supposed ","useful":0,"cool":0},"sBVDp4KjnK_7fm-DwBeNJA":{"text":"Don't do it guys! At 2 pm on a beautiful Saturday, and the service is nuts! Imagine having","useful":2,"cool":0},"cGMtlMTIOBKJaQJI1gh7JA":{"text":"Eight of us were in town for a 4-day weekend and on Saturday night we were on our way to H","useful":2,"cool":1},"C1PRh4ftNtWzsgMczKgG3A":{"text":"The food was excellent. My table shared alligator bites and a sausage sampler. We also had","useful":0,"cool":0},"t12k1Vqbu_JnKyGBU08C5Q":{"text":"The food was absolutely fantastic.  Catfish jumbalia was prefect.   Tony at the front door","useful":0,"cool":0},"auQoPj2IdlEbsEg1YadRYA":{"text":"I wanted to like this place but it was not great.  Average, but nothing special.  Drinks w","useful":0,"cool":0},"_IvxvpzePhkCHludkoa_uw":{"text":"Amazing food and friendly service. They had a friend green tomato appetizer special topped","useful":0,"cool":0},"PBf_7MiigrDQ8HWZhUc68g":{"text":"I loved this place. It was definitely on the pricey side but worth it. The service and amb","useful":0,"cool":0},"LjvvYiW2sD_wqn-LqL3FsA":{"text":"Great ambiance, great food and amazing service! Kyle was the best waiter, highly recommend","useful":0,"cool":0},"rfOKLMm4ejUPGJavemtoEg":{"text":"Amazing food. The best meal I had during my visit to New Orleans. We were a bachelorette p","useful":0,"cool":0},"sq9LyzAsKr_3xDmlvex6Xw":{"text":"We had an excellent meal and experience at Evangeline.  Two of us ordered the pasta based ","useful":0,"cool":0},"HLJFMB4Wd89bsx6lvJgDxQ":{"text":"This is a gem amidst the tourist fare of Decatur Street. My son and I stopped in for a lat","useful":0,"cool":0},"lOPVgeO3_-MrBmeYypxpXQ":{"text":"We came here Saturday night for a special event and before hand we decided to get dinner h","useful":3,"cool":1},"K5gHEI8lsqxYtDGxPa-geg":{"text":"Thank you Ed and Evangeline!  I hosted my family reunion dinner here with 40 guests from T","useful":0,"cool":0},"kzQes_LGQFG0e3sTzLuXzQ":{"text":"We weren't sure where to eat beings there are so many places, but we decided on this one. ","useful":0,"cool":0},"AIO8HF-SZwkYTgThbMQQCA":{"text":"Went here for dinner this past Sunday and had some excellent food. Although they were out ","useful":1,"cool":0},"pdA2u753Y4R4kpaFYUoLvw":{"text":"Visited this restaurant on Dec 30 with a big party (13). We had no expectations and had on","useful":0,"cool":0},"E3lGP7Nt_fMpmkjWjVQKbQ":{"text":"Great atmosphere! This is a great little restaurant with a bar and courtyard. Then menu wa","useful":0,"cool":0},"P9EUoe-JpkPzH-4ekEJyRw":{"text":"Limited menu for the French Quarter Fest, but we all thoroughly enjoyed our food!  Great l","useful":1,"cool":0},"TXX0sV5nw72m8bcoKP9oOg":{"text":"Disappointed that yelpers led us astray....meal was not very good. Servers were friendly, ","useful":1,"cool":0},"NNBSe363pMTYXuo-zumakw":{"text":"Let me start by saying my experience here was amazing! The manager and servers were very a","useful":0,"cool":0},"AtCBFVqBDEVHJEceKtDR1g":{"text":"When I first entered this restaurant I was impressed by the courtyard dining area. The ser","useful":0,"cool":0},"laOqqFgeyhRoQ1LMJEe_iQ":{"text":"Evangeline was very disappointing for dinner, but does have redeeming qualities.\n\nA friend","useful":4,"cool":2},"4EM6pFsu1Wr9HqXS0ywf-A":{"text":"It was \"ok\" my family ate there and we were the only one getting food and it took 40 minut","useful":0,"cool":0},"kyvnZke3EM4IKMEoKnYYbQ":{"text":"Loved this place! Didn't need a reservation at 7 on a Saturday. Sat in the courtyard.","useful":0,"cool":0},"Nq8Odtse9Ry6JNIXS0ehhw":{"text":"Just stumbled across this great little place. Off the beaten path and away from the drunks","useful":0,"cool":0},"CNPl7rkofAubRHIdte_loA":{"text":"Great crab-cake Benedict and Bloody Mary! Super friendly  service and nice atmosphere","useful":0,"cool":0},"guQ3wITCrCLf4Q1udEWwNw":{"text":"My friends and I had a very nice dinner at Evangeline's.  The food was very good, although","useful":0,"cool":0},"DOhcVWpZRKN-Co3aHgR-pg":{"text":"Really good food with no pretentiousness.\n\nDefinitely the best food I had in the French qu","useful":0,"cool":0},"hQwYTMThwU7p8FWx-L7E-w":{"text":"While in town for work, my co-worker and I stopped in for a drink, saying this is not our ","useful":0,"cool":0},"yXt8GlVD-OmZypylVjC2Ww":{"text":"Friendly from the minute you step across the threshold.  Our waitress recommended the frie","useful":0,"cool":0},"ByaeQrSIz5Rhk7JWdYeUGQ":{"text":"We took a chance on this place after losing a reservation at Luke's.. We had a large party","useful":1,"cool":0},"RanR4A0Q69DgL9yF4ZpBfw":{"text":"I found this, what was soon to be a gem, on Yelp. Erin Marie was hospitable and down right","useful":0,"cool":0},"Apt_Phwhq2Hd713ILr-63A":{"text":"We had high hopes this was going to be better. The fried alligator app was about the best ","useful":1,"cool":0},"Z_K2gt12gVVS8wGBT3kpcA":{"text":"Oh. Maw. Gawd. \nHappy Hour SWEET POTATO FRIES PUHLEASE! \nI love coming in here not only fo","useful":0,"cool":0},"G35GxOd3b4lcgYiJpnOVdg":{"text":"Walked in looking for a spot to quench my alcohol-driven thirst; low and behold I got here","useful":1,"cool":0},"tU2R6XKYmqvckYbsMJnbsw":{"text":"I was really excited to eat at this restaurant. The reviews were great and the ambiance wa","useful":1,"cool":0},"tSlhxFBqbesSHHT1mwVwTQ":{"text":"This became one of my faves in my favorite vacation spot.  I love the outdoor courtyard wi","useful":1,"cool":1},"ClwCmUtcxxVJd0DGXzaJvw":{"text":"Decent spot but great for a big group without a res. It was my first dinner in New Orleans","useful":0,"cool":0},"bf7SNJZ8ypOeNNhmQG-RhA":{"text":"Evangeline is a terrific space with a really cute bartender who looks like Orson Welles, a","useful":0,"cool":0},"Afxp7Qe3UBJhIFYcM-X1XA":{"text":"My coworkers and I often eat here (and grab drinks off the clock!). I've never been disapp","useful":0,"cool":0},"mxTsMKLgz9pfn0M79XtM9A":{"text":"My husband and I went to New Orleans for our honeymoon. I tried to be a good girl and rese","useful":2,"cool":1},"3Z87MhEA0aniOtB1x_pGwA":{"text":"Excellent! Very unexpected since their was no one outside trying to lure you in.  Excellen","useful":1,"cool":0},"QkS0nWOzQq_aaab8Slsl6Q":{"text":"This is an amazing place for brunch. Wonderful wait staff especially Charlotte, nice relax","useful":0,"cool":0},"mo3BRRseDln1SPbMYnKnaw":{"text":"They were so welcoming and helpful when I made the reservation for a Bachelorette party fo","useful":0,"cool":0},"QOkBIez2x1y_h5pBZhmTlQ":{"text":"I can't speak to the food, as we only came for happy hour drinks, but the strawberry blond","useful":0,"cool":0},"b7Lm79HtNCVLANTYq39AjQ":{"text":"Jessie was such a blast and so accommodating to our large party tonight! She was fun, know","useful":0,"cool":0},"A3LpiIif1JWJw2s5mdedng":{"text":"DO NOT TRY THE PASTA EVANGELINE. This was the worst meal we've ever paid for. \nWe started ","useful":1,"cool":1},"comY_7wC2HPBC861NIsq1Q":{"text":"I stopped by Evangeline on a Sunday afternoon for a late lunch/early dinner.  \n\nHoowee!  E","useful":0,"cool":0},"NEZzUYJHpRTMI9Y7fxLdwQ":{"text":"Amazing food and excellent service.  Great drinks too.  The owners are there and one of th","useful":0,"cool":0},"-okqPUUBvWkJoPZRwvqJaQ":{"text":"Evangeline was recommended to my visiting group by a tour guide and we decided to make a v","useful":1,"cool":0},"BttCGUu1v7mDuhAFbbI6KQ":{"text":"I've never eaten here and as someone who eats 95% of their meals out, I won't be doing so ","useful":1,"cool":0},"9Jq06VD8LT5XdgsUJRlPOw":{"text":"A nice, chill spot to get a drink. The relaxed atmosphere might have been due to the time ","useful":0,"cool":0},"910hVJTkdkxOXidRr6rYIA":{"text":"Had the crawfish & grits which was suggested by my waiter. Glad I listed to him. Best Caju","useful":0,"cool":0},"aCB_D-AwLKQMRDwF0WaEbw":{"text":"Ordered the crab cakes appetizer and rum punch. The rum punch was is very sweet and the cr","useful":1,"cool":1},"mxWsgh1u7cUA_tVKQ7ILyw":{"text":"I am a fan... \nOn my latest trip to NOLA, a colleague and I went to Evangeline and had a w","useful":1,"cool":1},"nQIXjYZE7gNXxmJjQbjWrg":{"text":"Everything here was top notch.  Chicken appetizer was amazing, my jowl cheek pasta was unp","useful":0,"cool":1},"EJd0RuJjlelL6gU0XRGxDQ":{"text":"Passing by and took a chance for lunch. Pleasantly surprised. Great sausage trio appetizer","useful":0,"cool":0},"HOZX_52q-WGXarUMAMgb0A":{"text":"Unlimited mimosas $15 were delicious, but the service was a little slow with the refills. ","useful":0,"cool":0},"BYH_Kb3wpWVlzVkq4QUyyA":{"text":"Quaint, casual quintessential NOLA vibe! Enjoyed the cocktails especially the ginger peach","useful":1,"cool":1},"2k5tet4A6gQ0P0zsKWYTvg":{"text":"Came to New Orleans for the Carnival cruise and stayed an extra day downtown. Found Evange","useful":0,"cool":0},"YS_3myusSU1a6_wfcicEMA":{"text":"COCKROACHES! The food okay and the service average. We would have been okay with our exper","useful":1,"cool":0},"Os4Rshd5W_kxB6EdtbQ2Nw":{"text":"Good food. Good service. Husband had the jambalaya I had a po'boy. Can't complain. I'd eat","useful":1,"cool":1},"hh4OJR1klybgAjRvUieAHg":{"text":"This place is an amazing jewel on Decatur! Fresh and amazing food  with awesome staff! If ","useful":0,"cool":0},"GW-j3EPV0rnBYjsRkZa3kA":{"text":"My favorite dining experience I had during our stay in New Orleans. Beautiful decor, frien","useful":0,"cool":0},"seE5x93oT6wYVJCL3FHYhw":{"text":"Great NOLA eatery.  This is a very busy NOLA restaurant so be sure to make reservations.  ","useful":0,"cool":0},"D7ADxjM-v4BXSZqn7KuCSg":{"text":"Nice and Quiet.  Salad and soup were excellent.  I had the filet, girlfriend had the shrim","useful":2,"cool":1},"2wQSTMjGuN6EMfhGM7h7sg":{"text":"I visited your beautiful establishment last April with my boyfriend Orlando Castillo and w","useful":0,"cool":0},"uLm_fo6ATH2234LZKnnOGg":{"text":"Spent two nights in NO, Friday and Saturday. This was first place we went to on Friday nig","useful":0,"cool":0},"HGJRn0rw_TNajb3v6D2YWw":{"text":"Such a cool spot! The interior is great with exposed brick and great lighting. The food is","useful":0,"cool":0},"G-LesBSjYJE6u9V75oReKg":{"text":"We had the red beans and rice with sausage and corn bread,  the thai chili shrimp, the all","useful":0,"cool":0},"tEd2feBpbim0ReolzdQsOg":{"text":"Seriously had the best time here!!!! In town for the weekend from Cali. \nMake sure Megan m","useful":1,"cool":0},"CaJtSY9fZkWjhp9sjB0h_A":{"text":"I honestly don't understand how all these  reviews  say this is great food it's the worse ","useful":0,"cool":0},"PYG5fP0QD69Ix1UYbXQIVQ":{"text":"When I tell you that this restaurant had me wanting to cry at the table because the food w","useful":0,"cool":0},"OEqcqGTior0ekm_g41JWOg":{"text":"If you want authentic cajun food in New Orleans just come here and get the crawfish and gr","useful":0,"cool":0},"8--_jR11t6EvlieltePZkg":{"text":"Really enjoyed the food here; the sweet potato fries have some sort of amazing cinnamon co","useful":1,"cool":1},"cyCDuvMJXP-3bFspkuTusw":{"text":"Ok. Got the alligator Creole style meal. Nothing special.  The courtyard looked cool thoug","useful":0,"cool":0},"UaXwlqLH97YdkGwZcYANGw":{"text":"Evangeline NOLA, what a cool place! It has a very comfortable New Orleans pub style atmosp","useful":0,"cool":0},"adJa6ukg9Y9Sf3iQssDrUg":{"text":"Food was ok at most, you can get a much better seafood experience somewhere else. Waiters ","useful":0,"cool":0},"mOgKS4YkeVi_DpUv85Aecw":{"text":"What awesome sandwiches we had for lunch. I will definitely eat there again. I had the pul","useful":0,"cool":0},"Wdt6c-OZQA9Sij8pkxLpfw":{"text":"We were walking around the quarter and decided to grab some dinner.  Of course, checked Ye","useful":1,"cool":0},"Od1Ehkr4xGliHp5zYDPvUw":{"text":"The crawfish and grits are awesome!!!!!  Also the nachos are pretty good for an app!! Very","useful":0,"cool":0},"K1Yq8SlfhobMwC3l96phRA":{"text":"Jessie was a fantastic server.  Food was excellent being with the fried alligator and endi","useful":0,"cool":0},"3v3_bu4icCkob3kdQI6M_w":{"text":"We had been checking out this place online and decided to stop in for lunch when we walked","useful":0,"cool":0},"8_YVhl1MMvheQsyylM_nQQ":{"text":"We were looking for some jambalaya/red beans when a waitress (Sammi) recommended this rest","useful":1,"cool":1},"V9qNqg8epYRAiJGaN1-wMQ":{"text":"I'm going to say that the bar was nice and they had a huge liquor selection. However, we w","useful":0,"cool":0},"X0TGvcV9lAC5XuqlJYgG-Q":{"text":"I'm surprised about how mediocre our experience was based on the reviews. Note: We were a ","useful":0,"cool":0},"LudplWd3TjH87K0T8JL0wA":{"text":"Came to New Orleans for a conference and walked over from the hotel. It was OK. So that's ","useful":4,"cool":5},"jaut9DSrjlB_8SMkNWizoQ":{"text":"This place was so good!! We had the gator bites...delish, they were very tasty!!! Then I h","useful":0,"cool":0},"RIs-WiWSql7vwAVV4Hx3xA":{"text":"Delicious food, incredible desserts and good drinks. The courtyard out back was lovely!","useful":0,"cool":0},"YClLC1l8ZYlNHeN1bccD4g":{"text":"It was raining so we took cover ordered a beer and shot special and had to wait for a keg ","useful":0,"cool":0},"5gRBNgOYKjdjAx4DXuelqw":{"text":"I stumbled upon Evangeline with my boyfriend while we were looking for a place to get some","useful":0,"cool":0},"yv7qsmnMFhtcLsXgxx7kOQ":{"text":"Best meal in NOLA.  The crayfish and grits were so good, we went back the next night for a","useful":0,"cool":0},"bh8qqiiNXTa7W6uwUQqZ2Q":{"text":"We came to eat here yesterday but they were closed.  Neal encouraged us to come back and s","useful":0,"cool":0},"Yl8lco3OfBnZxe57lzt1Eg":{"text":"Came for dinner - very good. We had the blackened fish, the seafood risotto and also the j","useful":0,"cool":0},"Efikz0UZeGi5aLXFW7lF_w":{"text":"I love this spot! It's got it all. \n\nEvangeline has a very unique feel to it. Its atmosphe","useful":0,"cool":0},"2q74TcHPL8ZYnJjJu3FniQ":{"text":"Food was just okay, but I was left feeling a bit disappointed. We had paid for our meal an","useful":0,"cool":0},"WT-xsPwvYo3X78o7peeTfA":{"text":"Their blackened chicken salad with jalapeño honey dressing is one of the best salads I've ","useful":0,"cool":0},"1G65NesqKLKhPgFy6Sjz5w":{"text":"I was looking for a place that would take reservations for 14 girls for my sisters bachelo","useful":1,"cool":0},"TOtBmrF449KfI7xIoTKQEQ":{"text":"Great food and drinks, casual environment. Server was very attentive. Overall we had a gre","useful":0,"cool":0},"OXMqHeAnxAzdttkfGuvJyQ":{"text":"We spent a beautiful Sunday afternoon in their back patio. We had the crawfish tails appet","useful":0,"cool":0},"lYzkvt5ZJGX9NF2c7lR8-w":{"text":"I had the best meal I've ever had in New Orleans at Evangeline. It was the catch of the da","useful":0,"cool":0},"R3xCUCDZ-qZ0LCR73dE_pA":{"text":"Great if you have lots and lots and lots of time....\n\nHad a reservation and sat down right","useful":1,"cool":2},"pP-2QmzVJbNAKvMCId8iUQ":{"text":"I went with a group of my friends for a birthday and I have to say the food and atmosphere","useful":0,"cool":0},"QFCFmAAZRGJIgIe7KOvitA":{"text":"This is a very welcoming bar and eatery. We had the Oyster Poor boy and the pasta. Both we","useful":1,"cool":1},"uS3xgkD-enPICPmGpOlNUw":{"text":"Awesome food!!!! Must visit! They were featured on Food Network \n\nBottomless mimosas!","useful":0,"cool":0},"RAa3wtX3vXkHkZpkgn7p1w":{"text":"A wonderful surprise, Evangeline's food and staff were top notch! This restaurant was feat","useful":0,"cool":0},"2o87SQURnTdRdxbYv4BTZQ":{"text":"I loved this place!  Laura waited on me and couldn't have been nicer. I had the okra, pig ","useful":1,"cool":1},"yjzwrYDfCq60LtgeK3jfcg":{"text":"After looking at long breakfast lines we decided to go here and have brunch instead. Botto","useful":0,"cool":0},"VEE0XKDbwdb_fyytitTS4w":{"text":"We were able to find this place during the holidays. Quiet, great food. I mean outstanding","useful":1,"cool":0},"3ygHdQzSTN49DFad9H11cQ":{"text":"We're visiting the city and stumbled upon this place. The staff was more than welcoming, s","useful":0,"cool":0},"Qi79rJ_oS1ZX0yUYPlWMaw":{"text":"This restaurant was not recommended to us by our friends. We were just walking down the st","useful":1,"cool":1},"WOOIKG6WAy6RsfR5yzqMMg":{"text":"They had several tables open when we walked in but he told us that food was an hour behind","useful":0,"cool":0},"iiE1Ozq3tsEk0x9Zd32iyQ":{"text":"Stopped by for some beers togo. It was pretty great. Bartender super nice. I'll be going b","useful":0,"cool":0},"cCEUbHuWMrxu7dzs558FrA":{"text":"Excellent service and great food. Had the bacon wrapped shrimp over spicy rice and then th","useful":0,"cool":0},"2e8T3G_5pCP7cZCm0rwUeg":{"text":"Absolutely fantastic! Must try while in NOLA. Ace our waiter was exceptionally attentive. ","useful":0,"cool":0},"zpoXBGwQ_KAqS7itZjsbpQ":{"text":"We found this spot while walking in the quarters. The atmosphere is nice and it has a nice","useful":0,"cool":0},"vShDkKOxZPKuNOtOqlYHRA":{"text":"The food was good but the sides were not. The atmosphere was fantastic, but the service wa","useful":0,"cool":0},"hgwUt2LaYn9r4gFYq4Wzcg":{"text":"I would be careful of the servers at this place. I asked for a vodka and tonic and was ask","useful":2,"cool":0},"oSSWaltkhf3TdaW3CQCbWA":{"text":"The filet is delicious! It's a great cut and with medium temperature, it will cut easy and","useful":0,"cool":0},"_s7XaF2n-Jjw0dcIV2VRow":{"text":"We got a recommendation from a local and the experience loved up to the hype. Delicious cr","useful":0,"cool":0},"4dJxilb0RifyEyQLtRxBJQ":{"text":"I have walked past this place a dozen times and boy am I glad I stopped in. It's strange t","useful":1,"cool":0},"-sXe2COBou-26BXAT6GfpA":{"text":"We came into NOLA for the weekend and had dinner reservations for a Sunday evening. Place ","useful":0,"cool":0},"rgh2ExS1GhP4-CTO8MYYJg":{"text":"Absolutely fantastic brunch! Wait staff superb, friendly and efficient. Food was out of th","useful":0,"cool":0},"ZQ8nNt00OGVCiwxw9iMJXA":{"text":"Very disappointing.  Beautiful looking bar/restaurant with courtyard in back.  Ate at the ","useful":0,"cool":0},"mlfh8VXBIR7_xcpQvKdlmA":{"text":"The best place to come with a bachelorette party. When we arrived, the table was set up wi","useful":1,"cool":0},"T48Mn8bFA5IuzCcbpXcGxQ":{"text":"My husband and I are in new Orleans for a conference and vacation. We were looking for a s","useful":3,"cool":2},"f8CAdAstsBucbXnbuGM7iQ":{"text":"Authentic New Orleans cooking. Simple dishes done well. Reasonable prices and hospitable s","useful":0,"cool":0},"bLnwfFUT_5fVs_nj3caIvg":{"text":"The food here is good, but the service can be lacking. I went this past Sunday @ 5pm and I","useful":3,"cool":0},"ZT6ajhq5jeCXttSGVJIE0A":{"text":"Great happy hour. The gator tacos were so delicious! The staff were very friendly. We woul","useful":0,"cool":0},"nOzRswXcmnWq1K41brX4Eg":{"text":"As of today my boyfriend and I have been in New Orleans for 3 days and have eaten at many ","useful":0,"cool":0},"7kL1hKW3PKM2eRHVPwj45w":{"text":"Loved Evangeline, not on Crazy Bourbon St, to give yourself a break. Stephen was so welcom","useful":0,"cool":0},"aSRQP98wZfSUSGOXm_u8ag":{"text":"Can't thank Tony and Rhonda enough for their generosity! They are so genuine and it shows ","useful":0,"cool":0},"PslCZEXeaWkw5a-cgZpf2Q":{"text":"Food and drink was amazing; French 76, off menu was the bomb.  Neal made awesome recommend","useful":1,"cool":1},"eEBFZ1b97Uzcg9FxWzW-2w":{"text":"The cocktails were strong, the gumbo was tasty, and the crawfish and grits was SUBLIME! It","useful":0,"cool":0},"6PJwvM_i7coi6ll1PpmuVQ":{"text":"Visiting from San Diego. Decor is classic Big Easy style. Bathrooms clean. Staff friendly ","useful":0,"cool":0},"m4jkCnRoh1ErxwyrkhMO8A":{"text":"You know when the NOLA Yelp CM says \"go to this place, it's one of my favourites\", that it","useful":5,"cool":7},"UCFEg0sIgHNCs8aEUbDUHw":{"text":"I love duck now! It was delicious wasn't big on the sweet potatoes hash but it was still g","useful":0,"cool":0},"nuiCC5_8myGZAgT36sNTzw":{"text":"Worst service in town. The staff was not happy. None of the staff wanted to be there. Our ","useful":1,"cool":0},"V2JVkwSJSZM-iJuJijSLCQ":{"text":"Came here for lunch and some pre flight cocktails. The Arnold Palmer and the spicy Nettie ","useful":0,"cool":0},"oVxsSJX1XorYtQ7qewBOUQ":{"text":"Their Pan Pardue topped with Bananas Foster for brunch is outstanding! We also tried the D","useful":0,"cool":0},"Eq7DTR6Dz9c0wpDI7GGrrQ":{"text":"Oh boy did I hate this place. Dirty, dank, and dark. I would not recommend coming here for","useful":0,"cool":0},"qYCoEZBQriXRPEhtGgvJoA":{"text":"We had really high hopes for this place because we heard it was a great place to take a ba","useful":1,"cool":0},"x-14Zrl4AmnORVCONZyraQ":{"text":"I believe that three things make a restaurant: good food, good service, at a good price. I","useful":0,"cool":0},"riKY38HnF0wMNEWYiU1zOQ":{"text":"Came here with a large group and sat In Their patio garden area, this was beautiful and th","useful":1,"cool":1},"qIvq0OE5jcUWikiY8ArhyA":{"text":"The food, waiteress were outstanding but manager was not. Very rude and poor custumer serv","useful":0,"cool":0},"u2EjN8SB8fDeMNrR5YKb_g":{"text":"Small restaurant/bar.  Nice ambiance.  Food was good, but nothing to write home about.  Po","useful":0,"cool":0},"aOWopfYD4eZr3lzDBfmTGw":{"text":"Jambalaya, Etouffe, Gumbo; all delicious. Gator n waffles also great. Service was just fin","useful":0,"cool":0},"kWcOuzTWkPDYgSMRbbYS3g":{"text":"The good news, great decor and atmosphere. The downside is the food serviced are the class","useful":0,"cool":0},"eOEJZriLORiFwT2_ekwgHA":{"text":"It was great. Our server for the night Nani was super sweet and really helpful to us touri","useful":0,"cool":0},"GRSV3F5WQ1ufEamjSoFpWA":{"text":"Popped by this location while venturing around New Orleans and got some gator tail. It was","useful":0,"cool":0},"rGW3AOoLimVjcEGi60zuKA":{"text":"We went to this restaurant for my friend's bachelorette party, and it was an amazing exper","useful":0,"cool":0},"tnc0OlFg09uKe8MAfr97hg":{"text":"Decided to try this place for its happy hour specials, well, because it's happy hour and w","useful":1,"cool":0},"w3PTTHonwF0-RPcPSXoyUA":{"text":"We had dinner last night with a group of more than 30 people. Service was impeccable, the ","useful":0,"cool":0},"GeH2e_pDyKtFMPJ3IUroqQ":{"text":"Came here for a bachelorette party over the weekend. We were really excited to try Evangel","useful":0,"cool":0},"_ROzj3yL_pto72ZrE7j4zA":{"text":"First restaurant my family and I visited while in New Orleans for the first time and we we","useful":0,"cool":0},"2vr9CI1OsFTyNIogiMASkg":{"text":"Most amazing food, service, and atmosphere. 100% recommend. Right across the street from B","useful":0,"cool":0},"3vgjuxeRzrvevN44Vc83DA":{"text":"Cannot say enough good things about this place. We were panicked at the prospect of weedin","useful":0,"cool":0},"_r9UvB9t4itY7P_TrHsxAQ":{"text":"Decent food but terrible terrible service. Fried okra was good but red beans and rice lack","useful":0,"cool":0},"zBzmlEKpwqiNCOngplW6bQ":{"text":"Service was on point. I was worried at first bringing kids in but they did have kid menus.","useful":0,"cool":0},"heetBARQyQ1PjjClcqAAvw":{"text":"I was searching this morning for a different kind of breakfast and since I'm GF/Celiac, br","useful":0,"cool":0},"I4KfCeDfwGtK8-sXh44e7g":{"text":"Nice place, I dined in the court yard which was very nice and quite! For a started I order","useful":1,"cool":0},"eChz8aKfnSIU8YscshoSJQ":{"text":"First time in NOLA and this place was recommended. Stopped here for dinner one night and e","useful":0,"cool":0},"nCMKf9sn-vEiJkCdVdElxg":{"text":"Let me start with this is a hidden gem. It's slightly tucked away and wasn't a place that ","useful":0,"cool":0},"yRq8z0vfB_-PnO6bHlIr-Q":{"text":"We loved this place!! We sat outside in the courtyard for dinner & had a great waitress wh","useful":2,"cool":1},"ylgJvA_FN-5jcvgtKV9DVg":{"text":"Great atmosphere both inside and outside.  Great philosophy of local products - from beer ","useful":2,"cool":2},"J1oQzybJODu-3-n6dmlNJA":{"text":"Delicious food, decent prices, great service. The happy hour menu is wonderful and our wai","useful":0,"cool":0},"U6skgUR4ilyHuX8c0RxmZQ":{"text":"Service and food were on point. The ambiance was romantic but not stuffy. Would definitely","useful":0,"cool":0},"MZ4N1VVuJGkI6Iob-PkTiA":{"text":"Delicious food, great service, and the happy hour is pretty good too. The crawfish and gri","useful":0,"cool":0},"9IfNfaXrQQjW_mRIyrzcSg":{"text":"Excellent food, good variety, wait staff attentive and knowledgeable. Food was very fresh ","useful":1,"cool":0},"IWXCfqclmIYJ1HL3ykEhBg":{"text":"Came here with my wife for a quick snack on her fun bday weekend. There is nothing like ba","useful":6,"cool":5},"dcAnKNteM5G2XWDKxghXog":{"text":"With so many fantastic options within 1 mile of Evangeline, it just rate above average (3 ","useful":0,"cool":0},"pGOHfxo0rXlw3HV0akdPjw":{"text":"Arrived 10 minutes early for reservation and told they would seat me but warned there woul","useful":0,"cool":0},"IstXEs8IEHTb7CiYa1DXGw":{"text":"The waiter was a delight. Made my morning started off right. I had the Gator Benedict, gre","useful":1,"cool":0},"rEOYgAsL3Jld0Rt2VA10xQ":{"text":"I really wanted to like Evangeline. Ascetically, it's a really nice restaurant and the ser","useful":1,"cool":0},"XveGlgw9cxL9rCMBvs7N4w":{"text":"The food was awesome. The Chef was cooler than a fan. Ran into him outside and he told me ","useful":0,"cool":0},"tHqDIqE29x6NWyVthTmhzg":{"text":"Very flavorful but a little too salty for my liking. I had the Pasta Evangeline. My boyfri","useful":0,"cool":0},"jAMqWkwNTyfqJw0nELzZuw":{"text":"Fried green tomato with lump crap was a good appetizer and the blackened flounder with jas","useful":1,"cool":1},"OKgcgM_kPyvppjPwS0ZtqQ":{"text":"Super yummy the French toast  is amazing alligator  bites are amazing also great atmospher","useful":1,"cool":2},"uecobnHiTBWspDRtngbTnA":{"text":"Absolutely amazing food! We came in from out of town and wanted some proper Creole food. W","useful":0,"cool":0},"clO66iFxyJrenuHm8pISrQ":{"text":"I really wanted to go to this place for the okra, but I was too full when we got there so ","useful":0,"cool":0},"kE5BrYY-WzymiikZVaqxMg":{"text":"Ended up being a great experience.  The ambiance changed when the sun went down and the li","useful":0,"cool":0},"9pkZq5G8_nGJTUQcKkvIHg":{"text":"Red beans and rice was amazing, service nice, great happy hour specials. The blackened chi","useful":0,"cool":0},"j_piXfRWyHoFI9yXudJWUw":{"text":"Cute outdoor space and attentive service but the food was one note.. we tried the fried ok","useful":0,"cool":0},"L5ow4Uj6i5eUiem3Toptog":{"text":"I was really disappointed with this place. I ordered the grilled cheese from here, waited ","useful":0,"cool":0},"mmylb_UuljGl-IJcPMkdmw":{"text":"Stopped in on a whim and met Rhonda, the owner. She and her staff were very accommodating.","useful":0,"cool":0},"MlwHrtJ2q3YMyG67TrEnTw":{"text":"I really enjoyed our dinner at Evangeline. My mom, sis & I, along with my 3 kiddos decided","useful":3,"cool":1},"oEPe0JhhWgwItldLCLEquw":{"text":"Terrible service. No one in the restaurant and it took 15 minutes to receive drinks and an","useful":2,"cool":0},"2dUgtDawVLVcWo86eW1_nQ":{"text":"Absolutely amazing! Service was outstanding and food was incredible. Our waiter was very h","useful":1,"cool":1},"_wHgBoeuJt3_8xludSv0UQ":{"text":"I went with my Mom and Son. We all agreed the best meal we have ever had! You must try the","useful":0,"cool":0},"aesYExyPyLXaQ8RxOqSubQ":{"text":"I'm giving it a 5 star only because our waitress was phenomenal! I believe her name was Je","useful":1,"cool":0},"40JrCYG6dbfwSf07K0jN6w":{"text":"Best restaurant we ate at during our trip to new Ireland hands down. Amazing jalapeño marg","useful":0,"cool":0},"x1xE8_uGcFs9dEWXZAu_Ww":{"text":"While the food was delicious, and the atmosphere was that of a good, fun little side stree","useful":0,"cool":0},"biFJX6-lFQ-OqIamGmIJMw":{"text":"Alligator creole style was insanely good-- spicy, salty, bursting with flavor and the alli","useful":0,"cool":1},"_-JXhoD1XR2O7P1Ow7yg_Q":{"text":"After walking around and inspecting the menus of about 100 restaurants we decided to dine ","useful":0,"cool":0},"4IQbVBlfhZiZBACi9oaOFQ":{"text":"Was in New Orleans on business, and stumbled on this little gem. It looks like a perfect c","useful":0,"cool":0},"uFHZ-n432eoohUi9ZuEDgQ":{"text":"Ate here in my last day in NOLA since they had a \"as seen on food network \" handwritten si","useful":0,"cool":0},"RYywT_BCqy9Icnu9W1hnoQ":{"text":"We were here for dinner and sat outside. The ambiance was great as well as the service. Th","useful":1,"cool":0},"0WPORSMJ5oxKCvaD-mq1IQ":{"text":"The food?  Wonderful!!  The staff?  Wonderful!!  My time spent there?  Wonderful!!  Have I","useful":0,"cool":0},"r2oBDjt4Qz2L3UaJlicY7Q":{"text":"Lovely patio away from the tourist action (at least on this particular Saturday). Service ","useful":0,"cool":0},"dnTvJ_ugl_D1HoTSrxoPPw":{"text":"We finished up our week long trip to NOLA with a fine dinner at Evangeline's. After enjoyi","useful":0,"cool":0},"gg_pCEPeuMOCRIWsavWp6A":{"text":"We just stopped in for appetizers and ordered Crab tator tots, Cajun nachos, bacon wrapped","useful":2,"cool":2},"z-iAH1J3sV0cQhBWlhZ2ug":{"text":"Crawfish and grits were fantastic and the strawberry cheesecake was even better. Beautiful","useful":0,"cool":0},"zjNVcA_zE9RSRDUeOCANfQ":{"text":"Celebrated a birthday here on a recent evening. Dined in the courtyard in the back. It was","useful":0,"cool":0},"2YW1BH5T1kiKbwVnJa9rag":{"text":"The restaurant was easy to find, directly next to the fire department. The inside is very ","useful":0,"cool":0},"InWCpiNyolpm0R5mRG8TMQ":{"text":"Found this little gem trying to escape the craziness of the French quarter. This place doe","useful":0,"cool":0},"PKnTV6xc_P3_KmNdvHqHhg":{"text":"Evangeline is a quaint out of the way, but not really out of the way place.  Beautiful bui","useful":1,"cool":0},"r7-2w1pBlltwBn2S-9Kurg":{"text":"Stopped in on a busy Friday night and was able to get a table. Really enjoyed dinner here!","useful":0,"cool":0},"E_S5ghP_6hW5gkuh2XCFtQ":{"text":"Yelp lead me here! Such a wonderful find. Friendly bartender recommended the crayfish and ","useful":0,"cool":0},"QX9oJZ3Yx5e2HDr0VU-oxA":{"text":"This was my first trip to NOLA, and from what I've heard the main enticement is the food. ","useful":0,"cool":0},"Q6keFSXJEGC4uOVPuqvoNw":{"text":"Stopped in here for a quick beer and ended up staying almost an hour talking to a super fr","useful":2,"cool":0},"LUq9v-OsDYxbDiW60QYiHQ":{"text":"Stopped by about a week ago for burger and beers... The service was a joke.. The girl behi","useful":0,"cool":0},"JKSEl1no9tYRur0uS8RUiA":{"text":"Found this place on yelp and decided to try it after our initial pick didn't open until 4 ","useful":0,"cool":0},"cHG3jn47TwcRe7msNJ4L7Q":{"text":"Good restaurant but nothing phenomenal. New Orleans has a lot of delicious food so this is","useful":0,"cool":0},"TxN47uJxkg12r5wBDzFz_w":{"text":"We stumbled upon this place and loved it. The gator bites were fantastic! Mark recommended","useful":0,"cool":0},"iepS0DdHXAmXMfaTuzh5gg":{"text":"Found this little jewel while waiting for Krewe de Vieux parade and House of Blues concert","useful":0,"cool":0},"PLZxbnOEkNGQuX4RXC6GUA":{"text":"What a nice place! I really like the setup, it's not too big or too small. I loved the dec","useful":1,"cool":0},"wXKWgJYLKWjwCBf1wf65PQ":{"text":"The food is delicious!!! The chicken biscuits is a must, sweet and savory ! The sangria ha","useful":0,"cool":0},"BD1B0zqf0oa5xfVviloC_A":{"text":"Amazing bread pudding beignets!!! Happy hour from 3-6 pm daily! $5.00 cocktails, $3.00 loc","useful":1,"cool":0},"O1p_7oB_56phAuMX5F6R2w":{"text":"Stopped in here twice on a business trip to New Orleans.  Both times were wonderful.  The ","useful":0,"cool":0},"SGoTttyOmr064gVv042lOw":{"text":"We were looking for something quick but not quite fast food before our night out and we st","useful":0,"cool":0},"BJE3prE5xawd121EB2qNmg":{"text":"Evangeline on Decatur is taking over the Cajun/Creole scene as far as food is concerned in","useful":0,"cool":0},"FFUeO5fHTiYNDz8OE1_8tQ":{"text":"Since it was festival time they had a limited menu however the choices were great and my C","useful":1,"cool":0},"Srp0q2AbPJM_0huHVddeLQ":{"text":"Fantastic brunch! BFF and I went there extremely hungover and left revitalized! I had: bla","useful":0,"cool":0},"VFLIXG0Db9pBikUFZ4khMg":{"text":"They have great service and the fried alligator bites are amazing . Can't go wrong with th","useful":0,"cool":0},"PYSYfhy5MF7T5LiwWKVdGA":{"text":"We snuck into Evangeline's happy hour and just had an amazing meal, alongside some excelle","useful":3,"cool":1},"QLzM4VMcnaJnFYbQkD5oJw":{"text":"This is a very cute restaurant with great service. We arrived close to closing time. We or","useful":0,"cool":0},"TBOBCj6eE7pm0JjuHO3wbQ":{"text":"Amazing food, and an amazing service. Our waiter was fantastic, great recommendations,not ","useful":0,"cool":0},"Q5em9tHQ2bfNGuBotqwNhw":{"text":"Ask for Dave! Excellent place and service! Drinks are great and food is terrific! Seafood ","useful":0,"cool":0},"_QveRk5HDUqBF3VruR0wfw":{"text":"Fun vibe, good food, lots of local options to enjoy Cajun/Creole cuisine. We came across t","useful":0,"cool":0},"HjZvrO7yQC7PVwVuWVPp-Q":{"text":"Fabulous ambience, food, drinks and service! \nWhile I have found nearly all service in NOL","useful":0,"cool":0},"2CKvlNsl6AG2gwfs-t6K6g":{"text":"The crawfish and grits were amazing!!! The Rum Punch was great too. My friend had the shri","useful":0,"cool":0},"XyXkhmikC8NUtvkJOShyYw":{"text":"My husband and I were trying to find some good New Orleans food. We tried out this restaur","useful":0,"cool":0},"2gFi1BS_X3XRwgCn-qj3Bw":{"text":"What a pleasurable experience with such southern hospitality! Our service was unmatched fr","useful":0,"cool":0},"xZyEliGgNqBkrb3S6l1S4A":{"text":"Beautiful place on Decatur, where you wouldn't really expect a lovely place with craft coc","useful":0,"cool":0},"_Us8LYXR3IXcVEJTMRUAgw":{"text":"This was such an amazing experience.  Recommended by Heather at the local tourism office..","useful":0,"cool":0},"1-bU_x5yVt-n83KU3P_2Xg":{"text":"I'm a major foodie who travels the country... eating at some of the best restaurants in Am","useful":1,"cool":0},"aIqDmPVTqFqjE0OvmpIvTw":{"text":"Really good food. Great service. Terrific experience. Appetizers were good. We had crawfis","useful":0,"cool":0},"Ev0TypWiEX1RdYuQ4SKvyw":{"text":"Amazing food if looking for a \"local-feel\" New Orleans restaurant, including a local craft","useful":0,"cool":0},"eLxVZYGE5UZzybuhGg7VAg":{"text":"This was one of my oddest restaurant experiences to date. We arrived later than our friend","useful":0,"cool":0},"ZtFizkvOeGb3SMVVrP_CFA":{"text":"So good, we had to stop by twice.\n\nIn a city known for its hospitality (among other things","useful":3,"cool":3},"jGdUGAlwCoizx2hvN_U9vA":{"text":"We When here when we were in New Orleans on the recommendation of a friend. The place is s","useful":0,"cool":0},"GFQgXZW9VMOwW8v5eL9pmg":{"text":"I really wanted to like this place. I think details of a place always paint an honest pict","useful":2,"cool":2},"zrF_KTSTEgW_Gyf-Im0IYw":{"text":"This is a great gem of the city. The ambiance, service, and food was top notch. We happen ","useful":0,"cool":0},"CT9O74MpEpKvoCpNOzk-3Q":{"text":"Stopped in randomly on our first night in New Orleans. The food was good, but our server w","useful":0,"cool":0},"Vp_nwihTMkiQC4cwknYyoA":{"text":"My friends and I came here for a bachelorette party dinner, and the food and service were ","useful":0,"cool":0},"IZpdn4DxGYb7R4QYDGYotQ":{"text":"We had the pleasure of being in town this past week. We ate here 3 different times and the","useful":0,"cool":0},"r6f9kYgIKt0yWN-jwb03ug":{"text":"This place was amazing, cozy spot, friendly staff and a great cocktail menu.  I got the E'","useful":0,"cool":0},"iWAgs3PEdveXKa643wGH1g":{"text":"This was one of the worst meals I've ever had. Myself and a few friends were seeking a cas","useful":0,"cool":0},"ZoHwOfwAgURXZZZ-wRxAeg":{"text":"Went here with a group after the  Joan of Arc parade on January 6 in the French Quarter.  ","useful":1,"cool":0},"Cj5hUCJLm_XNIiZBGsSjFQ":{"text":"The food was divine, especially the crawfish etouffee. The service was excellent and frien","useful":0,"cool":0},"8Q-v2O-TT3t1wCRGIe1sAQ":{"text":"I loved this place!!  My friend & I were looking for a good restaurant in the French Quart","useful":0,"cool":0},"zlT2BDIUMTVJRs2K7N1t3Q":{"text":"Was looking for authentic Cajun not on Bourbon. A couple walking out raved about the food ","useful":0,"cool":0},"mlxu5GLW8OK99xOXRl0VbA":{"text":"Neal is awesome!!!! I felt like we had dinner and a show bc he is so funny. Gorgeous ambia","useful":0,"cool":1},"UeFqlc8Nc6eoyVO5JeTewA":{"text":"Delicious dinner in New Orleans.  Fried Okra was a delicious appetizer and Crawfish Étouff","useful":0,"cool":0},"ry6qqbvjrsiEQh0Z7S-kdQ":{"text":"Highly recommend. \n\nStopped in randomly as I walked through the French Quarter looking for","useful":0,"cool":0},"ESh4lCz1oK2fNlwQyKPT2A":{"text":"You cant spell epic without evangeline, well maybe you can, but you shouldnt. This venue w","useful":0,"cool":0},"sM0msLHhiNqRDFug95Vg1A":{"text":"Best bar in NO with best bartender (Raymond, you the man). Great cocktails, awesome food a","useful":0,"cool":0},"mMzoRpGDDOwA_frDnPf1wg":{"text":"Hit the spot for me. Gumbo, red beans & rice, and a few really good local IPA's on tap.","useful":0,"cool":0},"4TWDJsF0l9bIpkbmyVhgPg":{"text":"Great food, service, and atmosphere. Cajun dishes were excellent and well priced. Cute int","useful":0,"cool":0},"BEAeI9zuPJBjRVJw1iMy2g":{"text":"The brunch here is amazing! Everything is reasonably priced with good portion sizes. Drink","useful":0,"cool":0},"WvxrO1POlIx8SaJSu1mM0w":{"text":"Not sure why there isn't a line out the door! Been here twice throughout our stay in New O","useful":0,"cool":0},"zuxfh8UWhVQtCzM_n-AeLw":{"text":"I am actually really disappointed about this restaurant choice. I read reviews and the sel","useful":0,"cool":0},"FGD6hEmNeJ764c998x_s0w":{"text":"Loved the redfish special. Collards and yams were excellent and the redfish was cooked jus","useful":0,"cool":0},"FEn9hMgByb0vjrUJCoj51Q":{"text":"We crossed the sidewalk board advertising bottomless drinks.. so of course we entered. We ","useful":0,"cool":0},"rbBx3ZFEdDU01VPeXoQsAw":{"text":"Where do we start. First time here and decided to check it out with the wife. We started w","useful":0,"cool":0},"tX6__5FxVfvZyIUHN03ZoQ":{"text":"This was the cutest restaurant to start our girls night. Their drinks are delicious and th","useful":2,"cool":1},"7JG4uFfhph4jGqv7EG4t4w":{"text":"Holy smokes, this was good!\n\n(This isn't a short review because I really loved this food a","useful":0,"cool":0},"iXlGl8FY-kcviKLOgfzbZQ":{"text":"Came because of a hotel recommendation. When we walked in we waited for a few minutes for ","useful":0,"cool":0},"Ags5jmrQ3Z49FjB3OtM-UQ":{"text":"This is a cute little place that I would definitely stop by again- but not if I was in any","useful":1,"cool":0},"VBGRYTxeSbujkOocYkdnwQ":{"text":"Only came here for a drink in the courtyard but really liked the atmosphere. It has a nice","useful":1,"cool":4},"hZZUqUUvyE40iYjPHGVRAg":{"text":"We looked for a good breakfast place but many of the noted ones had crazy lines. We stumbl","useful":0,"cool":0},"7NOkil9ItMugkU8FhustSw":{"text":"One of the best meals I've ever had. Service was phenomenal, I cannot wait to go back. I h","useful":0,"cool":0},"hijFCIW5FOhKtKDlqRviIw":{"text":"My boyfriend and I came to New Orleans to celebrate his birthday. While walking to the pla","useful":0,"cool":0},"1HI6pHAWnsavbyoPOMBuTg":{"text":"We just had our Christmas Eve dinner at Evangeline and we couldn't be more satisfied. We h","useful":0,"cool":0},"diRwVwKfOkoO-KSCN8dsnw":{"text":"Came on a Thursday night. No wait. Very quiet and tranquil. The service was a little slow,","useful":1,"cool":0},"MIoaujBmp2g0PkQeW8vGHQ":{"text":"This was my first time here and  fell in love with this place . It's very cozy and warm at","useful":0,"cool":0},"MtKOcSewvFEIVZeB657wgQ":{"text":"We saw this restaurant featured on the show,\"Burgers, Brew and Que\" and it looked very goo","useful":0,"cool":0},"gByxYBC9hCRZdyIyaFOTUA":{"text":"By far, this is the BEST Cajun creole I have had--hands down. I had one of their specialty","useful":1,"cool":0},"3GLJt4d4V6U01cjycxKY8Q":{"text":"Our very first stop for new Orleans food was this. Delicious! I can't even tell you how ha","useful":1,"cool":1},"NF5cG9PtWpxG2qjOfOVjJQ":{"text":"I won't be able to tell you about the food guys! I sat in early Friday afternoon, and it l","useful":0,"cool":0},"rGmrFNg2ZHGQgnaNvyyd9g":{"text":"I'd been wanting to try this place for a while and finally got the chance tonight :) It di","useful":1,"cool":1},"0EBzjDSeGDXEYfkhbyLhPA":{"text":"It's a good find outside of the French Quarter. It's a walking distance from hotel Montele","useful":2,"cool":2},"GVpMt-XfTbhLj5eQVEMV_A":{"text":"Ummmm Stuffed!!  This place was great!  The staff were very friendly and made us feel welc","useful":0,"cool":0},"Os6aA0LaVfuwFdgUCzuj9A":{"text":"My husband and I ordered the fried okra and crawfish étouffée. The okra was mediocre and n","useful":1,"cool":0},"i7GVHI64x9C2lXYbR-EjRg":{"text":"I actually went to Evangeline twice during our time in New Orleans. The first was for dinn","useful":1,"cool":0},"MH-PP6L-gsNuFhu_xM0aGQ":{"text":"We first discovered Evangeline 3 years ago while attending a conference at a hotel in Cana","useful":0,"cool":0},"zFT-lPTpzzTJmqoGSZgdSQ":{"text":"It's taken me so long To write this review because I'm not sure what angle I should take. ","useful":0,"cool":0},"8gYicUl1EDIC1gFwR3w3QA":{"text":"One of the best red beans and rice I have tasted. I still think about it. That's how memor","useful":1,"cool":0},"CAW4E5IULPMDzFKzCOOrfA":{"text":"The food was outstanding, we had the crab cakes and crawfish and grits. The crawfish and g","useful":0,"cool":0},"K5TA_AhuWJNWk5jg3ucjFw":{"text":"After a flight in from NY, most places were either closed or not accepting reservations as","useful":0,"cool":0},"peUVRMFPXMLMqkzjf4Y2XQ":{"text":"Evangeline is a lovely little restaurant that I hope I have a chance to revisit again some","useful":1,"cool":0},"TuW-tV684K6cJNfCJC-Xxw":{"text":"Staff is amazing and the food was great. Went with a party of 9 for a birthday lunch. We o","useful":0,"cool":0},"nXLgpaj4e9LnpvshnI8wyQ":{"text":"Very good! \nFood is quality and reasonably priced. Nice beer selection. Well thought out. ","useful":0,"cool":0},"asedZlwVu2K7P_4LZKLe-g":{"text":"I must say that I would be lying to you if this place didn't knock the socks off of my fee","useful":0,"cool":0},"0_J72IJawFPmhBF5y9VVRw":{"text":"We really wanted to enjoy this restaurant so badly however we were very disappointed. The ","useful":0,"cool":0},"rb4l4HAOkcye44CKML8xdA":{"text":"The food was unbelievable. \n\nOur server was fantastic.\n\nMy biscuit was obviously homemade ","useful":0,"cool":0},"fTdKYpaElo77qP8sYec4Dg":{"text":"My first FTR in New Orleans (I'm gonna geek out for a bit!) and I'm happy it's for such a ","useful":27,"cool":17},"sV9Pafp5a1YsLGOEPy6q8g":{"text":"What a great place, my wife and I had Dinner reservations for 7 PM. We were met by the own","useful":2,"cool":0},"Q8883FY6nAg0J_P1Nni5Hw":{"text":"This place is a gem The staff is so sweet and fun the owner Tony is so kind and simply ama","useful":0,"cool":0},"sVHPxGgQv4qJ7abn37L2QA":{"text":"Great staff! Very welcoming and super with our little girls. Quiet ambience. Great food. W","useful":0,"cool":0},"yBY9P3yDCRLFJ90AhOOWxA":{"text":"Best food and service. I will definitely be back next time I am in New Orleans. The food a","useful":0,"cool":0},"rKOEnHNhL_NOOhvqCgw8NA":{"text":"We made reservations for 4, for Sunday dinner while in New Orleans. We were visiting for m","useful":0,"cool":0},"fPGy-Ec6LLCNDFyh2y-efw":{"text":"Best service in town! Beth was a fantastic server and made us feel right at home. Will def","useful":0,"cool":0},"Y4mVtu50M-AeRCm3uh0NxA":{"text":"I called like 7 places trying to find jambalaya that didn't contain dairy, nuts, of eggs (","useful":0,"cool":0},"9ktFFPYKEFmg4GYYoa9KGA":{"text":"Walking in the place was kinda small but they did have patio seating out back. I expected ","useful":0,"cool":1},"WKkcOFYm7-vIClOq5uNujA":{"text":"The food was awesome! The service was just as awesome and the atmosphere was fantastic! We","useful":0,"cool":0},"7qsx4CZeyvzZALx1_aG2JA":{"text":"Friendly service! Had the sausage sample it was delicious!!! And washes it down with pomeg","useful":3,"cool":2},"KFJYmUirnvKNo8yTSxptnQ":{"text":"Hidden gem off the beating path. Evangeline was a perfect find. We didn't have reservation","useful":2,"cool":2},"ZRWF7M-xwQ0p5VZ3ApNXGA":{"text":"I enjoyed the drinks and the foods for happy hour. It is right next to the quarter. It can","useful":2,"cool":1},"709EJ_gZIKIkPLkxk1ax3g":{"text":"We had walked by this place many times headed to the French quarter from canal and finally","useful":0,"cool":1},"pv66YcV-txUu0VIiDDJhwg":{"text":"Chose to go here spur of the moment and loved every second of it! Brent was THE BEST serve","useful":0,"cool":0},"_vwNh66aPK9xhMolblcA_A":{"text":"First time having Crawfish Etoufee. OMG! Incredibly delicious! Come for happy hour.  Crab ","useful":0,"cool":0},"9he1er6hnb6-2OD2z0E4_A":{"text":"We came in on a hot Friday afternoon for happy hour and luckily got a table inside. It was","useful":4,"cool":1},"PwGhBqHe8RKHWyAJAAPtfA":{"text":"Found Evangeline while wondering the streets of NOLA and boy were we pleasantly surprised!","useful":0,"cool":0},"88swgwB29ydoeM-TaB1cEQ":{"text":"Enjoyed the happy hour as a part of a Yelp Elite Perk. Very nice spot to unwind after a lo","useful":4,"cool":1},"nkhmgFvDer6mCa9LE8TbvA":{"text":"Evangeline is such a cute little restaurant in the French Quarter! It would be perfect for","useful":3,"cool":3},"ln80pvfT4XuUZ_Lb9UHlRA":{"text":"Coming back to Evangeline for our third time and the experience as just as fabulous as the","useful":0,"cool":0},"SnOOJxxrzSvKgOAxsIfl6Q":{"text":"Stopped in for Happy Hour and a snack. What a gem! \n\nWe sat in the courtyard, which was a ","useful":3,"cool":2},"Xyp8vcwpzoLzqkFmEx54SQ":{"text":"Fantastic food, service and bottomless mimosas!! Would highly recommend to anyone vacation","useful":0,"cool":0},"wv1f0_vM-XKlKdVziMIVKw":{"text":"Great food and great service! We sat on the patio where it was nice and not too loud consi","useful":2,"cool":1},"0e0rtUWx48bM0nyCBkLcMw":{"text":"Evangeline is a new discovery for me that will get a repeat visit from me on my next retur","useful":0,"cool":0},"RLRN_JGAYMN1nns8VYGnXw":{"text":"Brunch or dinner this place is your spot to go to! I was totally blown away by everything ","useful":2,"cool":0},"cEHdW9HpE9t_a_YN-0MS5w":{"text":"No Happy Hour as advertised. Waitress said they haven't done it since 2020/Covid. Disappoi","useful":0,"cool":0},"BH4GllL3KPoElLPKB6gmjA":{"text":"It's no wonder this place was featured on Food Network! What a find!\nIn chatting with my t","useful":2,"cool":2},"bhRndmbsNv-PnUo8g6gHrg":{"text":"I was sooo looking forward to this place. Great reviews, good spot, nice courtyard. Howeve","useful":2,"cool":0},"Xu-DiOuwgm_RUilKDifxSQ":{"text":"What's not to love about a weekend happy hour??\nEverybody say, \" Yaaaaay!!\"\nThis is a swee","useful":3,"cool":2},"22So1NTT9mT7myLTQ5Fddg":{"text":"My husband and I booked Evangeline to celebrate our anniversary while we were on vacation ","useful":1,"cool":1},"c2TWOnlfx5M5L_mtDPHwuA":{"text":"Evangeline has become one of my NOLA favorites! I loved the casual atmosphere. Plus the fo","useful":5,"cool":1},"O1ijvIwjdODvBi_oCpUt5g":{"text":"Made a Yelp account just because my boyfriend and I had such a wonderful experience last n","useful":0,"cool":0},"eQttEnooP91BNLMCr0tSxQ":{"text":"Nice place , cool Halloween decor. The atmosphere was wonderful , quiet , outdoor seating ","useful":1,"cool":1},"q3AlEGRDq8AIrcBYZV17LA":{"text":"It was a rainy day and everywhere else was full so we came here on a whim. So glad we did!","useful":0,"cool":0},"Dgv-SUHA4I-E5XsX3FlR0w":{"text":"I stopped in here for a quick brunch and was pleasantly surprised.  The food was delicious","useful":1,"cool":1},"j1BM9yrLAMws3o1cnbvJfg":{"text":"Great weekend brunch! My husband and I stopped in for brunch on NYE for their creative men","useful":6,"cool":4},"ymnKg2mTBJi_1OVQ5Sc3iA":{"text":"First time at Evangeline's and let me tell you, they certainly WOWED the hell out of me! \n","useful":1,"cool":1},"glpW9MQoj2uf0sXCgLPskg":{"text":"HAS EVANGELINE GONE BELLY UP?  Their website states that they're open for lunch TH to SU. ","useful":7,"cool":0},"aUOp9_xmKYNKwJdpc8DFSQ":{"text":"Evangeline was a really fun stop! Our waitress was really knowledgeable about New Orleans ","useful":0,"cool":0},"DLakfywT97r_gFm0qRPnJQ":{"text":"This was absolutely wonderful!!! We had the Evangeline pasta, crawfish and grits, crab cak","useful":0,"cool":0},"bVKXIQZiDSpo6SLalQKlDA":{"text":"Wonderful service! Fun environment and good food. Would recommend to anyone in the French ","useful":0,"cool":0},"1tCK2xDKHb8UXKvcgHho6Q":{"text":"After reading the various reviews of restaurants in the area, my gf and I decided to try E","useful":2,"cool":1},"v1yR32NRsyVrvIm5qfgcFw":{"text":"I had such a lovely time here! My waitress was very attentive and nice. I had the duck, wh","useful":0,"cool":0},"qZLCXzAVQe33TbWO-cSeig":{"text":"Found this gem of a place 15 minutes before closing time but they welcomed us in and gave ","useful":0,"cool":0},"wBcuXlWxw4bNi0vh3QdXjg":{"text":"The place is nice and laid back,  but elegant enough to take someone out for a nice meal. ","useful":0,"cool":0},"lxU0XPd5kypzzeuzN32KoA":{"text":"Don't be intimidated by the bar area up front, there is seating outside in the back which ","useful":1,"cool":1},"lpjjmavK7K7hr8BYCGYWfw":{"text":"We came here for breakfast because everywhere we had stopped into so far had a HUGE wait. ","useful":1,"cool":1},"rKEAWNXGJFmWmBun7VEclw":{"text":"I was promptly  greeted by David as I walked into the restaurant.  He was so energetic and","useful":0,"cool":0},"VpyojrVHF9vITrAJ7Gfm2Q":{"text":"Amazing food! Shrimp and grits was delicious and potentially heart stopping, fried green t","useful":0,"cool":0},"9skgUJdCsGALYBCRTzFMRg":{"text":"Great brunch. We enjoyed bottomless mimosas and bloody Mary's for $20. Wife liked the mimo","useful":0,"cool":0},"_ln5RqiP1bZrFAQS6tjoOQ":{"text":"Food was delicious! Recommend the jambalaya or crawfish & grits. Our daughter is a local a","useful":0,"cool":0},"EsLwg4h_dQR-pr5SgGLMxw":{"text":"The first place we went to was the most touristy - close to the hotel, in the French Quart","useful":1,"cool":1},"29W4w0FJY3xZqpWWjQZlrQ":{"text":"We absolutely loved this place!! The atmosphere is so refreshing for those of us that like","useful":0,"cool":0},"br27mof6YX9lZ2hyLOuLqA":{"text":"Great food, and great customer service! Oysters were awesome! This is a true hidden gem!","useful":0,"cool":0},"l0392KCM0VzrUP2qBdvong":{"text":"I have never read such utter tosh as what Brittany L wrote.I frequent this establishment s","useful":0,"cool":0},"6__vbklwBrPScG_WPNLSrg":{"text":"Evangeline is a four and half star experience.  The food is five star, service four, ambia","useful":2,"cool":0},"FqzNOzVXgxX1NYepFjewSw":{"text":"This was hands down my favorite meal I had during my visit to New Orleans. My husband and ","useful":4,"cool":4},"dNoGFButGpO6Y34oNXfKGg":{"text":"Disclaimer- we did not have a chance to try the food... but loved the bar atmosphere and t","useful":0,"cool":0},"6ll8q_7Er0VtL2SF8WfaxA":{"text":"What a great French Quarter restaurant! This restaurant truly had my tastebuds leaping for","useful":2,"cool":1},"1ZSlVL0oIx0g8OlLPsMEQQ":{"text":"Was really excited to eat here as they had great reviews. We were met with \"wait by the do","useful":0,"cool":0},"qLd6iWt87zIBwt6tHVg2_Q":{"text":"On a typical, sweltering French Quarter afternoon, I wandered in here for a Yelp Elite eve","useful":1,"cool":0},"21tK8TBYacTfgGIIBcPFrg":{"text":"Had a nice time out in their very cute back patio area; tables have umbrellas for shade. W","useful":1,"cool":1},"7NxNw0QWYkqtX8xYZXyVnA":{"text":"4.5--4.725\nBottomless mimosas (only orange) and bloody Mary's \nYummy breakfast menu, brunc","useful":2,"cool":1},"YfKhC8g9R3tZknBfAQY-eg":{"text":"Great restaurant!!  Really enjoyed our meal.  Our server was new but did an excellent job.","useful":0,"cool":0},"t-8cHY60iHcuyynpwdqweA":{"text":"A couple of my friends and I ended up coming here because we thought the sausage menu item","useful":0,"cool":3},"g9bo_sTP71RzD9Bf1ufzkg":{"text":"This restaurant caught our eye while walking by. The menu included gluten free options whi","useful":0,"cool":1},"MWwqRXV9ueNSGingNthkiQ":{"text":"After weighing recommendations from friends, my boyfriend and I decided to go rogue and tu","useful":1,"cool":0},"RIDtBDjbKBfgY2Er6spZDw":{"text":"The wife and I stumbled on this gem after the restaurant we were initially going to turned","useful":0,"cool":0},"SIKQ4j14pHXLAeI10UWklg":{"text":"This place is amazing. We had made a reservation for outdoor dining over the phone and men","useful":0,"cool":0},"fE_Edqp5lf3cw3pTi_aXPQ":{"text":"I was promptly  greeted by David as I walked into the restaurant.  He was so energetic and","useful":0,"cool":0},"zvMrFYV3v_WnkpZJRKHK-Q":{"text":"3 stars = a-ok\n\nWandered in on a Friday night.  Was seated out back on the patio.  It was ","useful":3,"cool":1},"3CgxJSdOybjdfWPbYU_h0Q":{"text":"This is my second time in New Orleans and had to come back to Evangeline.  The food is del","useful":0,"cool":0},"UgHAcerGGHpZRgwDTLJTvA":{"text":"This is my absolute favorite place in New Orleans. The drinks and food are amazing, the ba","useful":0,"cool":0},"wA6NM7FdtP7gWyph4VV6GA":{"text":"One of the best restaurants in New Orleans. All verities off foods. We had fried tomatoes,","useful":0,"cool":0},"yFfDK09zBXlex3UkxrprkA":{"text":"The crawfish étouffée was actually really good here! I was impressed with it, and I know é","useful":2,"cool":2},"MethleLP7fGZKrUmpXKj_A":{"text":"We had a party of 24 and went through a tough time trying to find a place in the French Qu","useful":0,"cool":2},"OVlRLh2u6i20pRH8Y-0Jkw":{"text":"Evangeline has an amazing brunch! You can do bottomless mimosas or bloody marys. The menu ","useful":1,"cool":0},"kswc6UZ2y_24KNj-7yfPrw":{"text":"We read the reviews and decided to try Evangeline tonight. It was a big \"NO!\"  The staff w","useful":0,"cool":0},"6uMvIXxd26C37p1bK732wg":{"text":"The restaurant was excellent. It's not much too look at from the outside but who cares, th","useful":0,"cool":0},"WkAmPRKbvGi9-O5t-0i8KA":{"text":"Definitely five stars! This spot had good mixed drinks, my bartender was super knowledgeab","useful":2,"cool":0},"PDkqEOUy3PS9ka31M9pPSA":{"text":"The service here was amazing! Everyone was super friendly and exceptional. They made a big","useful":1,"cool":2},"IkCWucaeg0pAVZZCO310dw":{"text":"I'm so happy we found Evangeline's for Brunch! From the moment we walked in the staff set ","useful":1,"cool":0},"DmS6Ajf6sDh0zzyOJOnbFg":{"text":"I'm sad to say that this place was a huge disappointment. Some of our food was spectacular","useful":0,"cool":0},"zSRRem41HCJqSX7Oj1DT7w":{"text":"My husband and I went here for Sunday Brunch on New Years day. When planning our vacation ","useful":0,"cool":0},"2li9uYOvteUs3RulRSZQ5Q":{"text":"A nice out of the way place to have a nice dinner on the patio. Service was good and the f","useful":2,"cool":2},"jq0UfxQnh-bmmBmvwcTH6A":{"text":"The absolute best food I've had in New Orleans!! The service, food, and atmosphere were A+","useful":0,"cool":0},"7VT_0IOVIydl_yvnQeE6pw":{"text":"Alex our sever was amazing.  We waited 1 hour for our food.  Beth the server next to us wa","useful":0,"cool":0},"EZ5VnHwxJcBrrgW4drqqJw":{"text":"Fun fact: this building used to be a part of the fire house next door and served as the ho","useful":2,"cool":0},"1jDydUNJGx9i5pAZx2FBXQ":{"text":"Great service, great Bloody Mary (scratch mix) and great gumbo.. worth a stop if you in De","useful":0,"cool":0},"_UDIcTjeVR0cJpkLv7thtg":{"text":"A big group and I went here for Fourth of July on a whim and we were very much surprised. ","useful":0,"cool":0},"JfrQh5piJ7Mwmkdt2AiwuA":{"text":"We were recommended to go to another restaurant and had reservations set up. We showed up ","useful":0,"cool":0},"qm4roFeX1eukwDKAOJ79mQ":{"text":"Visiting from Houston, TX. Food was absolutely amazing. I had the crawfish etoufee, cajun ","useful":0,"cool":0},"_qC_QfWeQUj1oScbEJ4vyQ":{"text":"Great bar; didn't eat here. The food looked good and folks were enjoying themselves. Barte","useful":2,"cool":1},"cQyafHAhJPP9FpIYBmfqCg":{"text":"Absolutely wonderful service, I went for brunch for my 21st birthday. They gave me a super","useful":0,"cool":0},"nr0hnyNuKvVb62g-xLti6w":{"text":"Yet another impeccable dining experience here.My husband had the blacken redfish over craw","useful":0,"cool":0},"7nbzYCR_vDPu2XjK0J0n6w":{"text":"The ambience is kind of quiet for a Thursday night, but the food was good. I definitely re","useful":1,"cool":0},"YwNKBBw6qEy3zkoq9wmExA":{"text":"Excellent food, excellent service! Pecan pie got us through an afternoon walking around NO","useful":0,"cool":0},"i9sAIYVD7CxtferlOsx8QQ":{"text":"This spot is really a cool area. I enjoyed the Rum Punch I ordered it 2x due to a small ha","useful":3,"cool":0},"TQ_EkLtRktrddt7wrZ1LOg":{"text":"Delicious!!!! Won't disappoint. Staff is awesome and food is absolutely the best!! Be sure","useful":0,"cool":0},"EvvBHaaUgds2WBGZI7FTow":{"text":"Nicest server: Asa, he was very friendly and funny. The place was crowded but we were seat","useful":0,"cool":0},"FVTUrWN-fQNEExS-fHkL3w":{"text":"Had a great brunch sitting at the bar with the attentive staff.  Shrimp and grits were gre","useful":0,"cool":0},"aEFPGXVoaz3fZbyGsxYzTg":{"text":"My favourite place to hang out in the entire city.Excellent happy hour.Fun,friendly welomi","useful":0,"cool":0},"IQ6rkcNdpbNl381cIesTlw":{"text":"We ate here for the first time the other day and it was amazing, I had the crawfish and gr","useful":1,"cool":1},"O2MYqZHCJnUyl7wcRZ1sFg":{"text":"Loved the food, loved the atmosphere, loved the service. Great place for dinner, from the ","useful":0,"cool":1},"JaXVgMFsuLmgy9wB3aPDPw":{"text":"We were a walk in and luckily grabbed a table because of a last minute cancellation. I'm s","useful":0,"cool":0},"T0qrJAtq6unhxufyS6F7PQ":{"text":"I picked this restaurant for lunch because it has a good location in the French Quarter. I","useful":3,"cool":1},"4dP7NLSr2oqrTfe08mL-SA":{"text":"I only gave an ok because of the bartender. We loved the menu; the place is beautiful; goo","useful":0,"cool":0},"ystTVYSwHUfdIWD-2CMuag":{"text":"Jessie was our server and she provided a great service.  It was my bachelorette's weekend ","useful":3,"cool":1},"U9koLo8p2SrrLdCGyu7-Xw":{"text":"This place had a great vibe. It is small on the inside but they have a gorgeous courtyard ","useful":0,"cool":1},"a5mltte9AO17LFw20g1m0w":{"text":"OUTSTANDING! The food was excellent, the vibe was perfect and the service was spectacular.","useful":1,"cool":0},"6CHZWwMECBiYZs-rACH6Qg":{"text":"5/5 hands down. This restaurant was my favorite place I've eaten at during my NOLA visit. ","useful":0,"cool":0},"Y-LHY6hYaYOvsOIE4Mr1DQ":{"text":"Unbelievable food!!! If you're looking for authentic NoLa cuisine, this place is a must!! ","useful":1,"cool":0},"-sdwV_q3L1BmhyQiFxRwdg":{"text":"My favorite restaurant in New Orleans. We were in town for a week and this is the only pla","useful":2,"cool":1},"UMaDYnQUc3pISI8lNwqAfQ":{"text":"Let me just start by saying the ambiance is very nice and romantic if this is what you are","useful":4,"cool":3},"mhj2Qe4QSRAykRDbzMD9-g":{"text":"I have NOT had dinner here, but I have had drinks and apps several times.  I cannot figure","useful":0,"cool":0},"GdGdb63Gnzh7n4RgDo0J9w":{"text":"As a New Orleans resident I'm ashamed that I didn't know about this place until now. I wal","useful":10,"cool":9},"iMvR0svqqWYXYru9fh_ChA":{"text":"The most unsettling part about my visit was the horrid, elevator, meditation music playing","useful":1,"cool":1},"HOcYGRaaXHHjsAAKLT2UHg":{"text":"Quaint bar and restaurant. Good size burger and fries that tasted good. Jambalaya was good","useful":0,"cool":0},"WSbfE3kcIs45UHWQfLbuqg":{"text":"Incredible service and delicious food! The crawfish grits was amazing and my Bloody Mary w","useful":1,"cool":0},"aoXsmVofzdRTxqxlcc9Uaw":{"text":"Stopped in for the Yelp Elite happy hour event on a very rainy Friday evening.  The courty","useful":21,"cool":22},"DfWBIed_Z2E9edhhoJ4oug":{"text":"Beautiful porch Sunday brunch place, Bloody Mary bottomless only $12! That's a great deal.","useful":3,"cool":1},"WZqg3ey-cHYP6YHjZZ76Gg":{"text":"I recently visited New Orleans for a work meeting - yay to the organizers for hosting it n","useful":1,"cool":1},"S0SWlkdi8nqTLhF3eY_FAw":{"text":"Just a great location with an amazing menu! The happy hour menu has some great selections ","useful":2,"cool":1},"7gkgdD5AhYya9df4rDcf5Q":{"text":"We went to Evangeline downtown today during happy hour.  Everything was PHENOMENAL!!\n\nLuck","useful":5,"cool":2},"F_1tSc7NRjIUcielL9IIbQ":{"text":"I chose to celebrate my birthday here with my parents and it was an unexpectedly horrible ","useful":1,"cool":0},"vsH22LTKIDiyxAj0Q-AZFg":{"text":"Holy cow I loved this place! My sister and I ran into this place by accident-- Ok maybe no","useful":4,"cool":0}}