{"5JBQHQ9-IS8Ek6uvwmXBuA":{"text":"3rd floor 2 star. 7 th floor nurses great day and night 4 star.","useful":0,"cool":0},"33IHD0rGXsf_8WeLlcF_rA":{"text":"Neurology and Radiology should not even be in business. Absolutely incompetent and unprofe","useful":3,"cool":0},"5Kr-GyW0nLq40uWxP9H5uA":{"text":"Really excellent service.  In for a deep cut from a broken bottle someone kicked down Bour","useful":1,"cool":0},"EhzI7oEN80eAXIElVWtxRg":{"text":"I was in NOLA for a short visit while my husband was there for a conference. On my first m","useful":0,"cool":0},"hOXzrp3haEgR28rOoTJpvw":{"text":"Was in New Orleans 2/7/2012 for a vacation and got severe food poisoning. Sicker than I ha","useful":2,"cool":0},"Uz4AKf7Pelrxs5ZM7wsCTg":{"text":"Dr.Emad Kandil is an excellent surgeon. He performed my thyroidectomy and I cannot stress ","useful":4,"cool":1},"liacZrRXmSHaXK_dEpfr9A":{"text":"When I arrived in New Orleans to visit my son, I was having sharp pain below my left breas","useful":9,"cool":0},"7VVXXWscLOF1RE14V_1U7g":{"text":"Had an unfortunate trip to this ER due to food  poisoning from Blue Bamboo in DFW (See rev","useful":4,"cool":1},"V6jzh2TTkpCw6LeV2dIHiA":{"text":"I was in a auto accident and i dislocated my ankle, due to my size they brought me to Tula","useful":7,"cool":1},"yL05y11APm5cxp1NqUMIWg":{"text":"Just left tulane ED. Took spouse in for acute back pain. He has a history of chronic back ","useful":4,"cool":0},"X6Iy1DcjOHokXEmJvOAynA":{"text":"If I'm breathing my last breath of life I'll NEVER go to Tulane E.R. Ever again they are t","useful":7,"cool":0},"64u9MupDyL52BSh0Cc91fQ":{"text":"NEVER AGAIN. Dirty hospital, RUDE staff. Brought my boyfriend here due to pain in his arm ","useful":9,"cool":0},"mAV14JKtUnwYjQT2-Pbk7w":{"text":"Had routine blood tests . No results for 2 weeks .  Emailed dr and she said the lab ' forg","useful":0,"cool":0},"21INpaa3yZ7pmRF5ptYK5Q":{"text":"Had a bad cut on my hand so I proceeded to the the ER. Did street parking on Cleveland and","useful":0,"cool":0},"MOpW4lYVJPvNgR2PH-F53A":{"text":"I pray you never need treatment at this pit of a hospital. I don't have the time to go int","useful":4,"cool":0},"K2-65tRqvNJCkNbM2-SU_g":{"text":"Horrible experience.  Wait times are always \"6 minutes\" but is easily 5-6 hours. They will","useful":6,"cool":1},"pt8Oa18qn8D2rkYFYKkCGA":{"text":"This review is for the ER and Pediatrics Unit only.\n\nWe rushed our toddler son to the ER w","useful":9,"cool":2},"lwJCCCvp9xTKnHUy-WIlSw":{"text":"If you want \"the best\" quality care in New Orleans, I would strongly recommend this place ","useful":1,"cool":1},"-A_jbq69FXWpKZmdO6bYIw":{"text":"I was in and out in less than 3 hours! Staff was very attentive and always stopping in to ","useful":0,"cool":0},"l9IGNwKiG98VXG4QgoTlvg":{"text":"emergency room review: \n \ni was sent in from an urgent care facility for possible appendic","useful":3,"cool":1},"j1ii7ZSi_mtG5yKbsXvT4w":{"text":"Yes, it's not the cleanest hospital, but the nurses and doctors make up for that fact. Hav","useful":2,"cool":0},"p1-ztacPzCuFrVpOxBZQWw":{"text":"With out doubt, the worst hospital I've ever been to. I arrived to the Tulane hospital via","useful":9,"cool":1},"VIjiaXnYOxIxpC1qzL9NIQ":{"text":"Had routine blood tests . No results for 2 weeks .  Emailed dr and she said the lab ' forg","useful":0,"cool":0},"2nYpvUs5Bzd0e54-mVZNNg":{"text":"My experience at Tulane medical Center was fast and thorough. The doctors there were very ","useful":0,"cool":0},"IBHE6g_mjk7Ff2INBbu70g":{"text":"Disgusting ! Both the medical center and the  multi speciality clinic is very dirty .  Hor","useful":2,"cool":0},"bQiBT6Xzb_OCZf6FTNfN0Q":{"text":"Awful, awful service. Nurses do not care about the patients and receptionists are rude. In","useful":9,"cool":1},"jQn2thbsTCplPShc8Fdqjw":{"text":"Only come to this hospital if your on death's door.  Bad' I mean bad medical care.  I had ","useful":1,"cool":0},"CRbftwxYjJ4YdlzHJUSzoA":{"text":"This is the third try and final strike. This hospital and its physicians maintain low prio","useful":2,"cool":0},"eHALiCHwTYdfTph1dn2OzA":{"text":"This place is horrible. Nobody cares about you the minute you walk in, except the security","useful":9,"cool":0},"fzZ54uhMUPup1TN6nRQZ6A":{"text":"Love my doc here and the nurses and administrative staff are always lovely too.  However, ","useful":0,"cool":0},"vU_nrceTodjrMkn8wBlzvw":{"text":"I was mugged and knocked unconscious. I unfortunately cannot tell you what happened, I wok","useful":0,"cool":0},"WT08y62p1t_kajiJ_dVI4Q":{"text":"I had a splinter in my finger late in the day and had to business trip at 6am the next mor","useful":0,"cool":0},"pm1mQaraOhi0fMtZATkEoA":{"text":"DO NOT USE THIS AS AN ER!!! it is extremely overcrowded to the point where there are 5 peo","useful":0,"cool":0},"iFSiehWW8QnGWTx3k2BqRA":{"text":"As a former employee at this horrific facility, I can firmly say I do not recommend workin","useful":0,"cool":0},"cC9ZFPPuXXd1tgnKlLFc4A":{"text":"they saved my life wonderful set of employees and doctors thank you tulane thank you","useful":0,"cool":0},"eDfq5Gxg5wU45kmN2056LQ":{"text":"An unfortunate medical situation on holidays can be devastating.  Being able to be seen qu","useful":3,"cool":3},"79CAdq799hS9YBXR4zwswQ":{"text":"Would give 0 stars if I had to! This is about one experience I had here, this is not a rev","useful":1,"cool":0},"kKVrdMe01Ujaqn9c8uylkQ":{"text":"If you really believed in helping, you wouldn't have sent me an outlandish bill during thi","useful":1,"cool":0},"5Ed-aCcZcfBnHxKY_rNLYA":{"text":"What the heck!!! I just want to say that the docotr did a great job and the service was go","useful":6,"cool":0},"tztSiUtdq0X-tn_8VOgHfw":{"text":"I will never go here again. The staff was neglectful, arrogant, and quite frankly a bunch ","useful":13,"cool":1},"88ZU1q2gX79rCahJozhj8A":{"text":"This hospital has one of the most handsome male nurses I've ever seen! He says his R's lik","useful":0,"cool":0},"v8XbSHoTVxOYxKV7dToJ5A":{"text":"Stay away from this place if you want to not be barked at by a pompous azz man doctor afte","useful":0,"cool":0},"DbnZItrOsyJzEqn6PMxCaA":{"text":"Had a small accident at work last night, strained neck, not too bad will heal on its own i","useful":6,"cool":1},"UDFQMubFI7H6ni_llZUYgg":{"text":"I recently donated my kidney to a friend of mine, and the entire process and staff and tea","useful":0,"cool":0},"4wEjyQBVks5JwYqI7HyzkQ":{"text":"Had routine blood tests . No results for 2 weeks .  Emailed dr and she said the lab ' forg","useful":1,"cool":0},"OfeIeaopBlh-NSjyS4Mq8g":{"text":"Worst ER experience ever. The place was filthy, there was no soap in the bathroom and no f","useful":5,"cool":0},"JR6JLJuHiSgH2XlPvqt3zg":{"text":"My boyfriend went to the ER here Sunday afternoon. Received an IM injection and 2 IV push.","useful":1,"cool":0},"H13OooLI-ArKHxCMZRJsHw":{"text":"Disclaimer: This review is only for the SICU because that is where my family friend was lo","useful":5,"cool":1}}