{"82EEtzJAxUVGYQpe0Ho3sA":{"text":"Okay this place was...okay.  A tiny space with a few iron chairs and tables strewn about d","useful":0,"cool":0},"lGPtg8vNDmUzdfSlqTerug":{"text":"Came to Mr. Gregory's before heading to a voodoo tour. All in all, it was a great experien","useful":0,"cool":0},"_kB8fQvL86nUvCSZ8op9eA":{"text":"Best tomato bisque and French dip! Oh French press coffee is bomb too! So happy we came he","useful":1,"cool":1},"Sz01gzbr5f3vuFrDrrf0zA":{"text":"Loved loved loved this place. Just had the most amazing breakfast sandwiches and iced coff","useful":1,"cool":1},"DBz96UeOpOL6g4IM0CHerw":{"text":"Was visiting New Orleans, and by the second day there, I needed something that wasn't frie","useful":1,"cool":0},"xiKGXe6oKC6DmvjgeMYaYQ":{"text":"walked a few blocks from my hotel to pick up breakfast here right when they opened. I was ","useful":0,"cool":0},"Bmmi_BPqzcFeNf9inVq86g":{"text":"Really only slightly pretentious, the awesome raspberry pain perdu more than makes up for ","useful":0,"cool":0},"nY4RvIxqhvOEdSaQAY5DCw":{"text":"We did the shrimp boil and it was a lot of fun. You get to eat some amazing shrimp and eat","useful":0,"cool":0},"aOxCPQabTvFK3JewAQ2LrQ":{"text":"Cute, cute, cute! This adoreable cafe faces Armstrong Park and is a good deal for dining i","useful":7,"cool":5},"IQTlaXH9NK49LqX63-e3bw":{"text":"I work in the quarter just 5 blocks from the restaurant. I placed an order for delivery an","useful":3,"cool":1},"FlWpScQsJ2XYC4UyeU63mQ":{"text":"My second time eating here.  The shrimp are huge and the rest of the food is great too. Th","useful":0,"cool":0},"46c55V76pgbw4u0_IilIFg":{"text":"Savory heaven. Perfect portions.  Good suggestions by the person who took our order.\nNothi","useful":1,"cool":1},"fpNCPMH-n9LvPehwAfZo2A":{"text":"- Clean, cool inside \n- Friendly and prompt service\n- reasonable prices\n- sandwiches to di","useful":0,"cool":0},"YvX2vKA2qfr4uaWkT89asQ":{"text":"I cannot overstate how amazing my experience here was. The cold brew was fantastic and the","useful":1,"cool":1},"51flEFUZaC2vEBBHUTOjUQ":{"text":"Food is delicious and atmosphere quaint, but don't come here if you're in a rush. The food","useful":1,"cool":0},"JU1HW3sMaQi9HQ5CZX4ZaQ":{"text":"I'm really excited to have a place like this opening in the French Quarter. Overall nothin","useful":2,"cool":2},"QzgBrBVOShHwOhL08-y9Ng":{"text":"BEST BREAKFAST IN NEW ORLEANS! My mom and I came here for a weekend and stayed nearby; whe","useful":1,"cool":1},"SmdGgv8IAFS3zXMJhE4L9w":{"text":"Walked by to do some laundry service next door so decided to wait it out in this cafe. \n\nI","useful":0,"cool":0},"5fbqY3Hn7X8mj4r-HG3cNQ":{"text":"Simple, fresh, great price, and shockingly fast delivery. Since I work full-time in the Fr","useful":0,"cool":0},"nc-IXbZopcd9-w0-72w3aA":{"text":"Best iced coffee in New Orleans! I loved the homemade croissants with butter and jam as we","useful":1,"cool":1},"BX79QXaMMhQWWL188YdXQQ":{"text":"Very welcoming at Mister Gregory's and the majority of the locals go here. The cold brew w","useful":0,"cool":0},"GYUYtIQTFe8UP_aXL7q32A":{"text":"This is a tourist trap. It was an interesting experience, but the food wasn't good and it ","useful":0,"cool":0},"Rg2umztRqPuZ4UZzd4VLXg":{"text":"This is a walk-up-to-the-counter and order small place. The food was good but not to memor","useful":1,"cool":0},"aA5tcEPyrWP4YzlsgumXHA":{"text":"Only had a coffee and pastry but it was good. They were nice and the place is cute and cle","useful":1,"cool":1},"PFrOEFuYD8GcwgbWdKTdvQ":{"text":"Gem of a place in Treme. Limited breakfast /brunch menu. Loved the kitschy decor. Waffles ","useful":1,"cool":0},"kadAtAhRW_EQ60SDb9yefQ":{"text":"Very disappointed. Breakfast sandwich of eggs and sausage on a croissant, got what I would","useful":0,"cool":0},"TP5QtGYkTMv0YG7cv-j-qw":{"text":"We love Mister Gregory's! They serve simple and fresh food in an inviting and quaint envir","useful":2,"cool":2},"P7ykHe6PAh5RyCsEQLmUWw":{"text":"Asked for an egg and cheese on a croissant sandwhich, and got a work of art! Frittata with","useful":1,"cool":1},"kmECVXSMJMq4OlqYsPPsHQ":{"text":"We didn't see what all the fuss is about. It's in a bad part of town, which we were warned","useful":0,"cool":0},"4F_MARzCrz7jXt35IcHE_w":{"text":"We had breakfast here a couple mornings ago and it was divine. Not just the coffee, which ","useful":0,"cool":0},"oEVoQrspQ_I-lu6gwwa2cA":{"text":"Very enjoyable lunch today. Our server was polite, informative and professional. The resta","useful":0,"cool":0},"nJUiwKTygjqNT-v65Irl0A":{"text":"Really fresh bread and Great coffee as well! Friendly customer service and great vibes too","useful":0,"cool":0},"lJ8i0PUq4Kf9MK5sKWAhCw":{"text":"Stopped her for breakfast.  This is a small cafe. Food was very good made fresh.  The pric","useful":1,"cool":0},"ZUUQhSLviOGTpBHPZhzczg":{"text":"You think to yourself \"who is the cute clown?\"  and \"why is everyone who works here so che","useful":0,"cool":1},"TMp4elAohO6-45gjCDKviQ":{"text":"This is a great place and seems to be locally run. The had some hot and cold food options.","useful":4,"cool":3},"YBEftsb2LhY2xGxoTDTsWg":{"text":"Salti was the one who made our food! He is awesome!! My husband had their special tonight,","useful":0,"cool":0},"R308rV6w19hJS0JVoQAj3Q":{"text":"Something was very off this morning at Mister Gregory's. There was one gentlemen taking or","useful":0,"cool":0},"nBjYsV50yS2mocgf9ZxbIA":{"text":"A girlfriend and I tried to go to Lucky Rooster for lunch and it was MADNESS.....so we ret","useful":2,"cool":2},"yzgmOz5FxTU9wy5dNu_uuQ":{"text":"Great sandwich  great guys great prices ...This guy is a true chef...try the bree mac and ","useful":0,"cool":0},"ZO-T6wDQ4Im7zZmCWedDVg":{"text":"This tiny eatery packs a big punch!  I can't afford to eat at Café Degas, Lilette, and Mar","useful":3,"cool":2},"6ikgxbtnN--5mDsES9L9aQ":{"text":"Potions are very small. Sandwich was extremely dry.  I got the bacon breakfast sandwich.  ","useful":0,"cool":0},"1F0ew4LedEB0s818xTPnqQ":{"text":"Really chill escape from the hustle of the touristy french qtr---- amazing smoked salmon h","useful":2,"cool":2},"CqKxq_9jwcnc5z_IDkejgw":{"text":"Fantastic!! The space is bright and airy, the service is fantastic, and the food is absolu","useful":2,"cool":0},"f5Yd5cSvA-T7w7O_ccTiXA":{"text":"Came here for iced coffee to go. There was no one in line but they looked very stressed wi","useful":1,"cool":0},"OHH1A9eXnWxp3lhWSZ5cUg":{"text":"Cute little french themed boutique restaurant. I had the breakfast sandwich with bacon. It","useful":4,"cool":2},"frnuuMjBKymXYeUU0ZL69A":{"text":"Very good. We had the 4 cheese tomato sandwich and a breakfast sandwich.  So good. We adde","useful":2,"cool":1},"M5Quid67XxrkW-h0TW6KnQ":{"text":"Was surprised by what occurred to take us to MG's shrimp broil. Was a last minute decision","useful":1,"cool":0},"H1ve7_p0IepB7VBtGDHYZA":{"text":"On a recent trip to New Orleans on day one after arriving late I walk to Gregory's for bre","useful":0,"cool":0},"HM3WVBUE6dCiKWq-wcjoXg":{"text":"Excellent breakfast sandwich (salmon) and Ice coffee! Atmosphere very bright and inviting!","useful":0,"cool":0},"urhP_Etd8ggSrmHdVWI8xA":{"text":"More expensive for a plain coffee than for a speciality drink at Starbucks. Additionally, ","useful":1,"cool":1},"XvELlo_bTZHifxCWaW12HA":{"text":"Coffee was great but $$$$$ and unfriendly staff walking around like zombies that wish they","useful":0,"cool":0},"_8Pd7DQcd7UEpXV0NyYzjw":{"text":"My boyfriend and I encountered this little gem while on a walk one afternoon. We stopped o","useful":4,"cool":2},"Op5Jbbudv98hKAh1u87KPQ":{"text":"Please update your hours on google to reflect when you close the kitchen, specially if you","useful":0,"cool":0},"VOOwM6M0reWfGzcDxVmkrg":{"text":"I can't believe I didn't go upstairs the three other times I've been to Mr. Gregory's. The","useful":2,"cool":1},"8lvrhFpYvu306mPrV6nsDw":{"text":"My gf and I ordered the breakfast sandwich and the baguette and butter and two cafe au lai","useful":1,"cool":1},"iTT5xQLf1zutNW6pd7DgEw":{"text":"Love these guys! Come for the food, stay for the conversation and playlist. Glad I stopped","useful":0,"cool":0},"n3UphY_Erwe1423MNf_pzg":{"text":"We went here for breakfast and were very disappointed by the food. They were out of waffle","useful":0,"cool":0},"ko1wQQCB_IrTOvGeRK_2XQ":{"text":"Great, amazing, friendly staff. Decent prices. Food looked amazing (was too full to have a","useful":2,"cool":1},"fxVuwXEQgRjDvLHacabHCg":{"text":"Pricey at $26 inc 15% tip for 2 sandwiches and 2 diet cokes... but I'm willing to pay to k","useful":1,"cool":0},"huoYeZcKynz4pipMN9jy3Q":{"text":"Awesome! Tiny quaint deli with amazing soups and sandwiches very clean and fresh flavor. T","useful":0,"cool":0},"6pDJaGDwvE2Z6K-qcL8_-A":{"text":"Server was rude. There was mold in some of the condiments. Ran out of ice.  Waffles came o","useful":0,"cool":0},"JwGkvVdOzuwFlga17kMnTA":{"text":"Hello, France? You can quit now. We have your bread and we don't need anything else.\n\nI'd ","useful":1,"cool":1},"y-qciy2YE8JY84Eg317jag":{"text":"Great place for breakfastor brunch! The pain perdu was authentic and really good. Same for","useful":0,"cool":0},"IYiOGEhJqtAIty8UsDPWRw":{"text":"My friend and I were looking for a breakfast place close to our hotel. This place was abou","useful":2,"cool":1},"IO6xOc9qWSKCrt-R1-ewmA":{"text":"A friend and I were visiting from STL,  walking around the quarter, STARVING and we came a","useful":2,"cool":1},"cUDLKgCmkBzr_zjYoK-7Dg":{"text":"Mmmmm! Best cold brew coffee in town! Staff was super friendly, helpful, and fun! We had a","useful":1,"cool":1},"JP8GI0Tifi8nZlcP_hf7HA":{"text":"This inexpensive, but healthy restaurant is on the border of the French Quarter on Rampart","useful":1,"cool":0},"HZfzRM0nMo_BDX-SGaM-HA":{"text":"Loved loved loved! Found this little place before I headed to the Treme Tour. It's just on","useful":4,"cool":3},"tSUT65mkk9_DrJUaO6BpEQ":{"text":"Unfriendly staff. Asked if they offered wifi to customers and the guy seemed annoyed I ask","useful":0,"cool":0},"EdAETy9vU7x4T_q3hEsv4g":{"text":"I don't really know what to say, my wife and I ordered cafe au lait and they put cold coff","useful":0,"cool":1},"op93M6sq_IoS5dg2jUNizA":{"text":"Kinda really disappointed. Was really looking forward to a Croque Monsiouer and had talked","useful":0,"cool":0},"EqyJFLjEAioqWNAmLUr8Jg":{"text":"Great cute little cafe. The chocolate bacon pastry was delicious. Only complaint was that ","useful":1,"cool":1},"85OAy8s1l-9X2JD9PcLnbQ":{"text":"Amazing - I just had a coffee and pastry on my way in to work and was blown away.  Soooo a","useful":1,"cool":0},"IhbvvCREi7I-ZtOWLE820A":{"text":"Locals place.\n\nStrong good coffee served in paper cups (even for those drinking in restaur","useful":0,"cool":0},"OEq2VEREGSfwk709EFcDkA":{"text":"Crazy yummy bizness in your Tummy people!\n\nI brought my little girl in for baguette with f","useful":1,"cool":1},"AmgiYZ_PC9MrXPKVoOxzYg":{"text":"So glad we found this little locally owned gem before a really long day running around New","useful":6,"cool":1},"zTOGQp2y_7JDFDu99GQ8qA":{"text":"Great sandwiches!  My wife had the Rampart and I had the Boeuf.  The melted cheese on top ","useful":3,"cool":2},"fw8clHK_VJjg1huzp57YXg":{"text":"Loved this place! Super chill environment and the food was delicious. We got the breakfast","useful":0,"cool":0},"bLESaRzmmDB3VmMYhBUEEg":{"text":"Stopped in here as we had a little time to kill prior to our Cemetery Tour down the street","useful":0,"cool":1},"lUW3OwzBxVWsqu2TLplbSg":{"text":"So cute and European on the inside and the food is delicious. The staff are so nice and he","useful":1,"cool":1},"URH52kSo-4zOXJ7nn4vEew":{"text":"My girlfriends and I were in NOLA for a girls weekend getaway and really enjoyed getting l","useful":1,"cool":0},"G8k6B43YNtaKySH1xbgDYw":{"text":"Damn good breakfast from a quaint little hole in the wall cafe....highly recommended for a","useful":1,"cool":1},"KiFp7IXAuVDs0M80osqqVw":{"text":"Excellent food! I had the brie mac and chesse, with bacon and garlic bread ($9) for lunch.","useful":1,"cool":1},"ThrvsLsvj3e6P1TCp1-QtQ":{"text":"Uhhhhhhhhh. Screw this place. The decor is cute. Right when I went to the counter, I didn'","useful":1,"cool":0},"B92ZQR2GV4-K8o3DoIxw9w":{"text":"Fantastic place for breakfast!  A little off the beaten path but it is across the street f","useful":2,"cool":1},"WvngpCmgrEZxnpGnmKsCHA":{"text":"Breakfast sandwich was just ok. I guess everyone's definition of sausage is different. The","useful":0,"cool":0},"uZsLo2jfNul_JwInPwUW1g":{"text":"Quite possibly the best breakfast we've ever had! Great coffee, amazing waffles with chant","useful":1,"cool":2},"IMoz5PnHFe6ue3ptqN-EOQ":{"text":"This place has amazing cold brewed coffee, it didn't even need sweetener. We also tried th","useful":1,"cool":1},"gio9W38BqjseGfxsk1rLFw":{"text":"HUGE portions, delicious food, friendly staff, and a great price point. Well worth the wal","useful":1,"cool":1},"BhhQu0JxdZ35nsCXLe-mKg":{"text":"Really delightful place, great atmosphere, great coffee and breakfast sandwiches. I'm look","useful":3,"cool":2},"221nUIP7RyTWDeUVA5uorQ":{"text":"Ordered breakfast. Confused expression followed by a delayed response of yes when i asked ","useful":0,"cool":0},"Z6xxgHX8uLYSTmA754oa0A":{"text":"One lonely star for this place: no ambience, unfriendly staff, overpriced food. My crepes ","useful":0,"cool":0},"bvuYiRygLuEmFadrr95tWw":{"text":"Stopped in for breakfast here as this was right in front of Armstrong park. The service wa","useful":0,"cool":0},"OBys8b9RvXeYhzOQjQgyHA":{"text":"Love the guys that work here. They are always extremely nice, friendly and make a great ic","useful":1,"cool":0},"tXConfE8IDfe_NDTNR2lVQ":{"text":"Not over the top. The approach to this shop is sketchy. The trip down Rampart St. seemed n","useful":0,"cool":0},"JWHp6QqkOxSw1gWAd-Mb8w":{"text":"another great breakfast surprize here.\nAdam went out of his way to make sure we had a grea","useful":2,"cool":0},"sDqCSmJNUCSUdm8uhNkswQ":{"text":"Had a waffle, cream puff, and cold brew coffee and...Oh my God! Were they good! Waffles ha","useful":0,"cool":0},"TtBEr8lDzP0bKfnuvceLiA":{"text":"This is a cute, adorable, awesome place. Te sandwiches are excellent and the service is fr","useful":2,"cool":2},"aX0mKNT4OVtiQCak6Pb4fw":{"text":"The only place we went more than once on our week long vacation. Friendly staff, very tast","useful":3,"cool":3},"hmFO4DQ3KZu2zngrvCqvbQ":{"text":"What a great find!  We wanted a quiet, delicious lunch in a low key kind of place and this","useful":3,"cool":2},"2hlMt-l-Y3HiQSWJ09vpPA":{"text":"This little gem of a place is right up my alley...literally! Great tasting menu and nice v","useful":3,"cool":1},"aT9kqvn7tBl79f9MStYd8A":{"text":"I got there right when they were pulling the croissants out of the oven and they were abso","useful":3,"cool":1},"M_s0lV8zo53iQ0eTzTOAeA":{"text":"Delightful eatery with a variety of drinks , pastry treats and my favorite , breakfast . \n","useful":0,"cool":0},"q8WC6z3g9U0s_wg-qvUVwQ":{"text":"a great place to duck into for breakfast or lunch. nothing on the menu is over $9 and port","useful":1,"cool":0},"kKQf0_iGhLHOFMAGSmwIig":{"text":"Came for breakfast. I enjoyed the menu overall but I would suggest anything with an egg on","useful":2,"cool":2},"9vhtiNffRbLAfB4ljNXTzw":{"text":"Such a lil gem. Service was sweet, and my ceasar and tomato bisque was delicious. I will b","useful":1,"cool":1},"44GTa5EUENvdHpQ_VQMx2Q":{"text":"Looked forward to fresh baguettes and good-quality ingredients. Indeed, the quality was gr","useful":0,"cool":0},"nL_vOvMNrZovXtHfwf9QXg":{"text":"The waffles must have been made with 2 lbs of sugar....you could feel the texture of the s","useful":0,"cool":0},"ji1ZAIWXvrLwcPrv1vI1Fw":{"text":"Came here for the start of our voodoo tour but stopped for breakfast. Avocado toast was su","useful":0,"cool":0},"O5fr3ceTQQId-yilU-Hbhg":{"text":"Cute atmosphere, friendly service. Yummy bread. Decent value for money. Croque Monsieur wi","useful":1,"cool":1},"cYdDQx5MWmV0KKcoPp_DKg":{"text":"We had breakfast here while on vacation prior to a walking voodoo tour with Free tours on ","useful":0,"cool":0},"WrUOmGGh3tIB6GDkmlVodA":{"text":"Excellent waffles, sausage, fresh squeezed orange juice, and super friendly/fast service! ","useful":0,"cool":0},"PsgKBVx7C0WSxEXmQbPkcA":{"text":"Those idyllic Parisian mornings when you'd grab a baguette with butter and a delicious lat","useful":13,"cool":9},"G7sddHJ1t-XCMpmgLtASDg":{"text":"The closest thing to a Paris eatery New Orleans has. Great  food and a Good ice coffee. Da","useful":0,"cool":0},"Aie35y_8Up1urcGdUIPESA":{"text":"I love the avocado smash and a coffee here. Plus I'm always up for the almond croissant (m","useful":0,"cool":0},"P3j391NM_oInGII41T9ETQ":{"text":"Service was quick and pleasant. Avocado toast and cajun breakfast sandwich were great. Wou","useful":0,"cool":0},"Ozj6qoxyhCoirqE-UPgM-Q":{"text":"Wonderful Find!! We were looking for somewhere close to where we had to meet up with our t","useful":1,"cool":0},"74VwywzcnphQBD5rWvNOiA":{"text":"Mocha was good. Reasonable price. Enjoyable atmosphere. Don't forget to add sugar to the m","useful":1,"cool":1},"AhqugpzirOPAS2DpESujuA":{"text":"LOVE THIS PLACE AND WILL COME EVERY TIME IM IN NOLA! Food is fantastic and very true to th","useful":1,"cool":1},"iNsODfbnhPshraJPYh-Lyg":{"text":"Espresso is expensive but delicious. The pain perdu is worth trying. Delicious. But a heav","useful":1,"cool":0},"EGwfl_RDvcedDEnkPqQOeQ":{"text":"Mister Gregory's is a little sandwich shop on Rampart. Looking to get away from touristy a","useful":2,"cool":1},"ZOOci3qJ2GSlEfoS1CFmaA":{"text":"This is not a review of the cafe itself. It is something else that the cafe does, other th","useful":0,"cool":0},"5FQNwSu3L93eFZLf94vcuw":{"text":"Charming, quaint, relaxing, and eclectic. The waffles were superb. The individual French P","useful":1,"cool":0},"dNnTEjA9i9yuOPXzX4WJvA":{"text":"This place is great.  I'm definitely adding it to my go-to list of restaurants when visiti","useful":1,"cool":1},"GZOgBMAhNGe8UxG3oaY6EQ":{"text":"Quality does not require extended description. Eat here for brunch. Ask for the roast beef","useful":1,"cool":1},"yj1yaf1DMll09irj0d0v_w":{"text":"The ham...  THE HAM!!!  Get ANYTHING that has the ham. The iced cafe au lait with Chicory ","useful":2,"cool":1},"292PvP-rZkSozG2cOmhmzA":{"text":"Mister Gregory's came up when a searched \"Brunch\" but this was only a pastry & coffee shop","useful":0,"cool":0},"1OP_6f_2fP1-7BnRQu76_g":{"text":"I just paid $8.78 for a cup of coffee and a muffin on Rampart St! How much more do you nee","useful":0,"cool":0},"3jUwLGxkXU-yhg7BjzZMlQ":{"text":"Another downtown lunch spot is Mister Gregory's on Rampart, across from Louis Armstrong Pa","useful":1,"cool":1},"J3UyH9s5m825I1pv-mL52g":{"text":"My husband and I shared the veggie breakfast sandwich and a pain perdu.  We also both had ","useful":0,"cool":0},"ufkYUlBLuCTOtBCt3K80_Q":{"text":"Stopped in for a french press coffee and a pain perdu on a cold New Orleans day and couldn","useful":0,"cool":0},"7frVP9-hgZhIhCmvBhIVYA":{"text":"FAN-freakin-TASTIC!!!  This breakfast experience was among the best ever. Our favorite was","useful":1,"cool":1},"E4DHh-2-jUybztTh4R8LZg":{"text":"Small but very funky and cute cafe with friendly staff across from the park. The avocado t","useful":0,"cool":0},"-zl-8c6-FbzowX7MdDt1kw":{"text":"Lowkey salty about here because of my experience but here goes.\n\n1) the food here is GREAT","useful":1,"cool":0},"oXb4Cf0MdAC0p0eECf85VA":{"text":"I really enjoyed this cute place. It's basic, like you're visiting a friend and they're ma","useful":1,"cool":0},"OXP-L4N_lk2GQrAKbzgBQQ":{"text":"I had the Congo square and it was delicious! Andouille sausage with baked eggs tomatoes an","useful":1,"cool":1},"cZ32sXirHmTmJevf-7oe8w":{"text":"Lemonade and coffee was great. Chocolate croissant and croissant sandwiches were delicious","useful":0,"cool":0},"MSUzxto1D0infNGRB4YH3A":{"text":"We went to this shrimp boil and it was a lot of fun, keep in mind it is communal seating s","useful":0,"cool":0},"nue9brfJEYZ6yUBg3VJ5uA":{"text":"Mister Gregory's is pretty adorable, and great place to stop in for a delicious light sand","useful":6,"cool":2},"R0Kz_8EFn9mndixn7h1Pyw":{"text":"I had the sausage breakfast sandwich. It was awesome! The egg was cooked perfectly and the","useful":0,"cool":0},"wKCEXpkx5rSIDXM4siTjzg":{"text":"Super good food with reasonable price. We went in for the first time as we were waiting fo","useful":0,"cool":0},"v7p_nmHTD0GA68_JkIzf4Q":{"text":"What a great little place! Up on Rampart Street facing Louis Armstrong Park, Yelp guided m","useful":4,"cool":3},"227ST8QtN4RsO2SuUNHpBQ":{"text":"Mister Gregory, I was very disappointed in you today. I ordered my usual fromage and got s","useful":0,"cool":2},"DOHMFsWfhOcqIWGLex76qQ":{"text":"I was really disappointed in this place. Given the descriptions on the menu, I really thou","useful":0,"cool":0},"3DIgDzL9Mz1qvanmweMhZg":{"text":"Good atmosphere, good food, good coffee. I went for breakfast and had a cup of coffee, a s","useful":2,"cool":2},"BxoUkARDAdxKg5yWe2LtIg":{"text":"Came here for a late breakfast and started with s tomato bisque (soup,  got it for free by","useful":3,"cool":3},"Xo2ZmEDJ2QcKVph61NPpmQ":{"text":"Excellent lunch delicious light fare would highly recommend if you want to eat healthy in ","useful":4,"cool":2},"EOf1A08lGOFUvibg_-IktA":{"text":"Mmmmmmm, that veggie breakfast sandwich tho.","useful":0,"cool":0},"GT8Mk6m8PvUU8BWu3e7JTA":{"text":"I enjoyed this! It was very affordable and tasty. We managed to find a parking spot right ","useful":1,"cool":0},"ZYU1OE5S2vW0KHMZOCES4Q":{"text":"This place was the most cute and swanky location in all of Nola. It is Nola..but with that","useful":1,"cool":2},"YUKIIYAEl0RFMu18-yrtAA":{"text":"Mister Gregory's is a really charming spot. So happy we found it in the middle of a swelte","useful":0,"cool":1},"z1yzkdy2XAzf1ayBZnTuSg":{"text":"Got here before it closed advance 38 min. Turns out they are closed already. I'm driving a","useful":0,"cool":0},"BWRfeuURhzTxL1Ucb9q3Zw":{"text":"This place makes me pretty happy. I LOVE a good baguette and these are perfectly crispy on","useful":3,"cool":2},"w45oB_53jkJz5ApGNlkP-w":{"text":"Today was a great day of tasting around New Orleans but the favorite spot of the day was M","useful":1,"cool":1},"Pci9Q4050cmMsihpsvpEZA":{"text":"Although it's listed as a coffee shop, upstairs you can attend an AMAZING shrimp boil. \n\nI","useful":2,"cool":2},"RVhSitwtc0xN-CFlXLboUg":{"text":"Closed permanently it looks like. Came during what should have been their brunch hours/ope","useful":0,"cool":0},"pnGLW_frr40_ugE3Mxf_UQ":{"text":"Don't be decieved! At first glance this looks like just a small coffee shop but thier brea","useful":0,"cool":0},"SJ8eRGSvoB4M91uGcE8tRw":{"text":"Great food. there was more than the 6 at our table could.eat. Gregory was a great guy host","useful":0,"cool":0},"S2VdjALBRdDI-ORJcLcOOA":{"text":"Was good, but probably not worth the $10 for the sandwich. Workers were very nice and char","useful":0,"cool":0},"w2PuqxhTN_ccHb6vuv7aVw":{"text":"Okay....so, the 1-star reviews are from people of a distant world without taste buds. This","useful":1,"cool":0},"JBpIAl-yXW3mDtDzL1uGUw":{"text":"Just ordered here for the first time to my bar.  Omg how have I not known about this place","useful":2,"cool":1},"F7GrZkrV9Ts44-jnDRQx7Q":{"text":"What a croissant! Is there a nice person running a cafe?  If there is, they should be rich","useful":0,"cool":0},"hHNcQdMx6txCztFXgy78wQ":{"text":"Gregory is really warm and friendly and knowledgeable. His staff are all great and the shr","useful":0,"cool":0},"_fnnnbuPwzSQI5GkgJrqQw":{"text":"went for late lunch ,we had spicy tuna salad sandwich and local pork sausage croque monsie","useful":1,"cool":1},"kFZZi5xfoJdnfuR2nkanUg":{"text":"Friendly service and tasty sandwiches. My \"classic\" with ham was so good I almost bought a","useful":2,"cool":1},"92KDDlb0wgQa8gYWYIxmGQ":{"text":"Why does no one mention anything about the location?  It's not that it's unsafe, but it is","useful":4,"cool":2},"tHuiHVApB0CjIhJ3qWJjyA":{"text":"We signed up for the special shrimp boil on a Friday night. It was fun that the doors didn","useful":0,"cool":0},"_WBkdJQsQ_NhBeEVSjUS2Q":{"text":"The experience was one of a kind, and the highlight of our trip. Mister Gregory and his st","useful":0,"cool":0},"-yk4cX0w3TTSpmaVXf0VTg":{"text":"Amazing seafood boil and great hospitality! I loved the atmosphere and the live music, def","useful":0,"cool":0},"G0SC-ml2t0X_s-I2iMN4ig":{"text":"My sisters and I had breakfast here. Amazing eggs! Also a fresh piece of king cake made wi","useful":0,"cool":0},"nFMsGCHD1b3mMueW7IFs5A":{"text":"Awesome brwakfast. Sunny side eggs, but bread too thick. Sliced tomatoes were just wonderf","useful":0,"cool":0},"GP2jZTTHBjRBJ9YWWHTfAQ":{"text":"I love this place. I come to town about 4 times a year visiting family and mister Gregory ","useful":2,"cool":1},"nkCHnZA57w_KOBmz3U5vXA":{"text":"No frills kind of place. A great stop before hanging out at Louis Armstrong Park. Got the ","useful":1,"cool":1},"bVIezziILy5DoGmDpZ2R-w":{"text":"What is wrong with this picture, kids?\n\nYou must be present to win!\n\nYes it was rainy. Yes","useful":0,"cool":0},"455QoLv8I1dPNf9Baido7Q":{"text":"Why and how did I miss this place for 5 days? Mister Gregory's is on the outer edge of the","useful":3,"cool":3},"bImmS1zGvSzP_G64FliofA":{"text":"Although it's listed as a coffee shop, upstairs you can attend an AMAZING shrimp boil. \n\nI","useful":1,"cool":1},"7ORIX9scdYU_IjD6UFmO8Q":{"text":"Absolutely divine. Perfect hangover cure. Great personalized service. Hot breakfast sandwi","useful":2,"cool":2},"ZpcUVbtFrWdRrBYIvsNxoA":{"text":"What a great time!! Mister Gregory's shrimp boil was both tasty and entertaining. We ate c","useful":2,"cool":1},"-Sno9KQCiferSxRLFMsUNA":{"text":"BEST NEW CAFE OUT OF 150 RESTAURANTS THAT I TRIED IN 2013!\nCROQUE CLASSIC: large sliced ha","useful":9,"cool":4},"uBJ7owpQCUJlDtxLNrdMew":{"text":"This place is dope as hell selected menu but good food. Highly recommend their sandwiches ","useful":0,"cool":0},"xRUsdUAuabXnGAmsCD7B2w":{"text":"Mister Gregory's is a great little café with French inspired New Orleans grub.  We were sp","useful":11,"cool":9},"zH8SXoTXSAHNhErCwRgwHA":{"text":"Great food and friendly service! And a great place to wait out the rain!!! Got the egg, ch","useful":0,"cool":0},"7ZI8i8sEuzfGpQWZz9dP2g":{"text":"So a little different than expected. Seen the advertisement on an app.  You have to walk u","useful":0,"cool":0},"eQOdgExlUcwq78a8npIlwA":{"text":"A small coffee shop on North Rampart deserves a unique selection of coffee and pastries\nVe","useful":1,"cool":1},"sKgpxsf5e2EMkSdSMzXWyw":{"text":"I came to Mister Gregory's with a group to dine and try their Shrimp Boil experience. All ","useful":0,"cool":0},"gwpIRqmFnub8GTHpItT-7w":{"text":"Very tasty French style breakfast. Off the beaten path and not swarming with tourists. So ","useful":0,"cool":0},"gvwJIBqegfAAIvIo20mVcA":{"text":"We really only meant to stay here for a second before our Voodoo tour started, but we coul","useful":0,"cool":2},"3P39e7EyiJKf_Q9y_m4kuA":{"text":"Very good. Nice service, fresh food. French Onion soup was on point. Breakfast Sandwich wa","useful":2,"cool":2},"QvfS68gJ785FdyhLxrO-Yw":{"text":"went to the shrimp boil Not for me it a buffet and we not big eaters and can not take home","useful":0,"cool":0},"FtrDofb6R7ZL3_Tjx5EY_Q":{"text":"This is a little coffee place located in a corner of the French quarter just in fort of th","useful":1,"cool":1},"KRuE_esmLo4UvASb-TApPA":{"text":"Short and sweet...\nGreat little sandwich cafe. Very friendly, charming staff. Nice selecti","useful":1,"cool":1},"jw949JrwRoNlzaJrlftBjg":{"text":"Cute little space. Fresh ingredients. Good music. Janet got the breakfast sandwich with an","useful":1,"cool":0},"P4ApG4rLvethdvlZoNW0gw":{"text":"The owner was wonderful the food was amazing! Very clean environment, very intimate and op","useful":2,"cool":2}}