{"Rzxws4o77wDp3dGw7Y1V0A":{"text":"We came here for an early mothers day celebration as we were on the quest to find a nail s","useful":5,"cool":2},"TunQqLbhPJDpncASCgkxmA":{"text":"I first found out about this adorable little salon here on yelp while looking for a place ","useful":1,"cool":0},"zFKj_L8_ST127UFBEjgDgQ":{"text":"So I went back to Buff for a complimentary mani (gel) and pedi.  I must say this time was ","useful":0,"cool":0},"k_KdK_sP2CwxsY_pSzJD1Q":{"text":"Excellent service and friendly people. I was so impressed by the nail tech's knowledge abo","useful":0,"cool":0},"V8Rv0CiVraJDEubtwVRdAQ":{"text":"I came to Buff Beauty Bar for the first time today - Jordan was very welcoming in person a","useful":0,"cool":0},"M8QkQ9Z4Apaounjxuak1eg":{"text":"This place was a God send, two glasses of Rose' and a fabulous pedicure later, this has be","useful":1,"cool":0},"uu2xKVxPdqqQo2akdlc_ZQ":{"text":"I pop in here for a manicure whenever I get a chance. They look good and last longer than ","useful":0,"cool":0},"ggeBy8uOANOkMVak2IDZdA":{"text":"Great experience. Very helpful and wonderful quality work. The champagne was also yummy! W","useful":1,"cool":1},"wLeES54_kHQ8carkJTYrHg":{"text":"Got individual lashes pplication for 35 dls, quick, painless, a dramatic style of lashes, ","useful":4,"cool":0},"stEkgb9XqrcotAbWPaH6aw":{"text":"This is my first review on yelp but I feel I should share my experience. I just moved to N","useful":0,"cool":0},"nvUVWjshqQAIXLpC-iigUw":{"text":"I am SO MAD that I did not discover this place earlier in my trip! After a disastrous job ","useful":0,"cool":0},"RRkXR5q0B4uuS76GX_-b6g":{"text":"I've been meaning to write this review for a very long time. I was in New Orleans for a we","useful":17,"cool":1},"9JWQJ-AGmII9uRoFkyQUSQ":{"text":"This is a modern beauty bar with old beauty parlor style. Very clean and elegant. Oh, and ","useful":3,"cool":0},"EvlblD6sJ87x7Lfisr_0YA":{"text":"Buff makes me wish I lived in New Orleans (among other reasons). I went to school here and","useful":2,"cool":1},"4BV92a566YZLsu91YbgTNA":{"text":"I booked an appointment this afternoon for both a manicure and pedicure.  Vontrell was won","useful":1,"cool":1},"SiwMmihe98M22jS4DERamw":{"text":"Friendly, excellent service. I got one of those half off deals to try out the place and di","useful":1,"cool":0},"BBkQAWqrJ2m8t7oDru7r2g":{"text":"I came here for a mani-pedi and waxing while on vacation. The employees were so nice! Phon","useful":2,"cool":0},"qmw-2yBkOgpz-GEH90Ujkw":{"text":"I'm not saying I'm hirsute, but I need to get my eyebrows waxed pretty regularly to look d","useful":5,"cool":1},"Pkk5RKPC6dVqCi114eOWJg":{"text":"got my first brazilian wax here from natalie and she was fabulous. they use hard wax and w","useful":1,"cool":0},"y6CszhDikgkjy4c2hiUiDw":{"text":"I usually get my brazilian at a chain called European Wax Center - but those do not exist ","useful":8,"cool":0},"4bAZW484b9KOzBodqkkfTg":{"text":"When I moved to New Orleans finding a new nail salon was one of my top priorities. I had b","useful":5,"cool":1},"_m1VEzYH_RGjn4OIP_HSGg":{"text":"This place is by far the BEST nail salon in New Orleans!! Hands down.  I had a gel manicur","useful":0,"cool":0},"CrV1fUFTLAg5iNbl7Vfcxg":{"text":"Love Buff Beauty Bar! Cydney for my waxing & Whitney  & Jordan have both done my nails! I ","useful":1,"cool":0},"SIqS03Bog-A8e7B8EkUzIw":{"text":"I went and had a gel manicure here today with Emily Vo and she was awesome! She did an exc","useful":2,"cool":0},"aAEN6N7um9wtXDWibN8YfA":{"text":"Awesome chic salon! Mani and pedi after work. Vontrell was super - - - very attentive to d","useful":0,"cool":0},"393UnxY1-SMNoaopCge5YA":{"text":"Aww what great management! I received a phone call asking me to come back and have my pedi","useful":2,"cool":0},"WFbWl07mpgTmEJ6BpXZIEA":{"text":"Woohoo... finally a nail salon in the CBD!!!!\n\nAfter reading all of the reviews on Yelp, I","useful":3,"cool":0},"ehZ1XsyWT2GaAjtgs2JHDg":{"text":"Upon my arrival to NOLA from LA, I have been on a search for 3 things: pet friendly spots ","useful":0,"cool":0},"hZbzeo1e2iS3-jXBBaHBew":{"text":"I've come here for waxing several times and really like their regular waxers. I had a bad ","useful":0,"cool":0},"EMPZy7DxispVORZWJRHRmA":{"text":"The facility is pretty and the staff is nice but I am very disappointed in my eyebrow wax.","useful":5,"cool":0},"FZD4OJTQZ_LxbLLeB5FC1w":{"text":"Pros: Clean and bright. Nail tech did a good job.\n\nCons: Waaaayyyy too expensive for what ","useful":3,"cool":3},"x9CFkcif0ol4D-SQnkPlAA":{"text":"Had a great bikini wax from Danielle last week. She was professional and very thorough.\n\nT","useful":3,"cool":0},"15zsb5pu8XUgITL5nP5Gig":{"text":"My bridesmaids and I all had our nails done here before my wedding. There were enough peop","useful":0,"cool":0},"92bYPmKdRfooMl5G7YGuLg":{"text":"I go here mainly for bikini waxes and it is quick not entirely painless but more painless ","useful":1,"cool":0},"FaXyrl9u3rkwEQI2DDFInQ":{"text":"What is your name again,\nWhitley \nWhitley, your service was excellent and I will recommend","useful":8,"cool":2},"c6BHvUsjDXrNenpDYNENAQ":{"text":"I needed a wax, but it was Sunday and seemingly everywhere was closed. Everywhere but Buff","useful":3,"cool":0},"XSwRsersFXrAz1owN6uP4g":{"text":"Came here for a bachelorette party and everyone was so nice to the group. Our mani-pedis w","useful":0,"cool":0},"NxEhLKVQIyvgNbaODLfxrQ":{"text":"I love Buff Beauty Bar.  They have great hours to come in and get waxings.  Their prices a","useful":1,"cool":0},"3KF9osYtKXBZfJ1axJHhOg":{"text":"I've only gone here for eyebrow waxing. \n\nI've been going here for ~6 months to see Raine ","useful":1,"cool":1},"hiEiO9tFcJ5SqmTaovueig":{"text":"Love this place!  Since I moved here from Oregon I have been looking for the perfect nail ","useful":0,"cool":0},"XyZ0DWPYOJDpjq7bWmJCjw":{"text":"I've been coming here to get Dr. Grossman facials and eyelash tints for years! My skin and","useful":1,"cool":0},"oRDrzcaFl2KygIqNX-qx6Q":{"text":"I've been to quite a few places in Nola for a Brazilian wax and Buff stands out above them","useful":1,"cool":0},"_27KHiohGDFcQ1UkXM-IiQ":{"text":"Our entire experience here was awesome!  Firstly, we walked in on Thursday around 12 pm wi","useful":1,"cool":0},"61ak5r-RXPyPtfVSfM5ADQ":{"text":"I'm not entirely sure why this place has such great reviews? \n\nMy disclaimer is that I am ","useful":2,"cool":0},"nIGcMborrlLZOflg1e5l0w":{"text":"The manicurist was very pleasant but not methodical.  Putting hand cream on one hand but n","useful":0,"cool":0},"DNVFmyeTYXlWFi6vKTY7fg":{"text":"Loved it! I was excited that they were open on Sundays and the ladies here we're very nice","useful":2,"cool":0},"kkDTgQR3hFJfMIe2ZD92JQ":{"text":"First off, let's start with free champagne. If that doesn't get you pumped up to be pamper","useful":3,"cool":0},"szpRqmr-DT4EWPaIpGUrXw":{"text":"Loved Buff Beauty Bar and was the perfect spot to get a blow out before attending a weddin","useful":0,"cool":0},"inATpGpsMPqzrTb-IGv3rA":{"text":"Came here for a bachelorette party, and was woefully underwhelmed. The check in process wa","useful":0,"cool":0},"OsrR8IZr9-XrUga7dm0EIA":{"text":"Quickest and friendliest manicure i've ever had! Looks great, too - just what i needed!","useful":0,"cool":0},"66LsVy2R9xcbP5Mv-ELn5Q":{"text":"I love this place - I go often to get my hair done for events or a big day/eve. They alway","useful":0,"cool":0},"gXdgFHO0Fg_9PLy4fsLlCQ":{"text":"Super easy to make an appointment online. Clean place, fast service, pretty colors, and su","useful":1,"cool":0},"p6Oh-ZjBGPPhVBErXTSw9A":{"text":"Walked into a very friendly and clean environment.  Whitney did my gel manicure and she wa","useful":0,"cool":0},"-hgnMZCr4to4HvF7O2Vmmw":{"text":"I went to Buff Beauty Bar yesterday for a bridal makeover with hair and makeup. I was fort","useful":0,"cool":0},"Nf05hTrevaMEMxAkn_Ajlg":{"text":"Beautiful, clean, and quiet salon located just a few blocks from my friend's house where I","useful":3,"cool":0},"E34QppSWKcm2SH6X-b6p_Q":{"text":"Treated myself to a pedicure and it was luxurious! Very comfortable and welcoming setting ","useful":0,"cool":1},"bGJzn4EBSQiJrhbYBIzR_w":{"text":"Visited this great salon while in town on business. I booked my appts on-line for same day","useful":0,"cool":0},"G3IR51lIzCz-6XzvrLwQ9A":{"text":"Hard Wax! Best ever. Cute place, staff very nice. Raine did my waxing and it was quick and","useful":2,"cool":0},"AnpVyzMkcXPiNawKMMYRXA":{"text":"Buff Beauty salon was an absolute dream! With great lighting, cute decor, and customer ori","useful":0,"cool":0},"isNNnMJAJnOCLXs672RjLw":{"text":"What a fantastic way to start my first time to New Orleans/trip for my sisters bachelorett","useful":0,"cool":0},"silJJFew1DOVobvOCpxrqw":{"text":"Awesome little place to get your nails and waxing done regularly. They use great products ","useful":2,"cool":0},"Ac8m3un5-C0EP55nDfslLQ":{"text":"Finally found a place in New Orleans where they know how to do a proper bikini wax and the","useful":0,"cool":0},"NXa4tbV075ZG42_nQaB0_A":{"text":"I went in for a wax today, and Courtney was terrific. It's a hard thing to balance being p","useful":0,"cool":0},"C_q86X7n4lcXuupfKf2s5Q":{"text":"I'm a fan of this place for a number of services: bikini waxing, manicures and pedicures. ","useful":3,"cool":1},"3gmxP5CuKUKc14GFsnjx2w":{"text":"Friendly staff. Reasonable prices. Nails have a chip insurance policy. Great job on blowou","useful":0,"cool":0},"VtNQJAkEomiHEoM7YoUkWQ":{"text":"I really want to give this place more than just three stars. I've been twice and the staff","useful":1,"cool":0},"iK9JRA37D2gGWgu3OW8mJw":{"text":"Great find while visiting from out of town! Easy to schedule online or over the phone. Pop","useful":0,"cool":0},"k4vXIOysRdALDWghhkumIw":{"text":"I was able to get into Buff last minute to fix some botched lash extensions. The lady who ","useful":3,"cool":1},"_bYWdGeanGT0b5mwOWUzFw":{"text":"I like getting a blowout on the first day of a business trip to save me time and stress as","useful":0,"cool":0},"eve3jaOTF8heEQIxL1Xg2w":{"text":"Carolyn is a gem! I was visiting for a salon convention a couple weeks ago and needed to h","useful":0,"cool":0},"nVz6KXFM5TFepM0gc3CORg":{"text":"Dropped in for a quick wax when I was traveling from out of town. Found this place on yelp","useful":1,"cool":0},"MoSlA-xKqM4DSgIgwABDXQ":{"text":"It was a pleasant experience definitely better than what I'm use to in nyc. The compliment","useful":1,"cool":0},"TjoToRq5kehrG_TurAbJog":{"text":"Luxury treatment and talented aestheticians. Definitely not a chop shop, go here to treat ","useful":0,"cool":0},"vhUBVZq8ODWWtD1tzl1fvw":{"text":"I booked manis/pedis for myself and 5 friends/family members the day before my wedding (09","useful":1,"cool":0},"AAu3Msi_707drCMiYePzfw":{"text":"I came in from out of town for a wedding and was looking for a place to go to for a blowou","useful":0,"cool":0},"BduL-qKSNtoHeXlpom1Xgg":{"text":"Came here for a blow dry and manicure while in town and was very pleased. Manicure was a b","useful":0,"cool":0},"ZsW1FS4tzlGBOwksUtF53w":{"text":"It's no surprise that this place has consistent 5-star reviews. The entire staff that we e","useful":1,"cool":0},"zSfka3y2JznAOrotgw_DcQ":{"text":"Yelp let me down!!! Really not worth $80 for a no-chip mani and pedi. Should've looked muc","useful":3,"cool":0},"7sau6z-f_ROgUfnNO2Gujw":{"text":"Had waxing done by Raine during a visit to New Orleans. She was professional, made me feel","useful":2,"cool":0},"_dq0tJ5yCnQRphgy7vb_qw":{"text":"Love Buff! I am a beauty buff! \n\nThe atmosphere is amazing. As opposed to a hush-hush spa,","useful":1,"cool":1},"obzrXQjUrqxZNUp2_PMbOg":{"text":"I had the best blowout of my life with Kim last week. It was the day before my wedding dow","useful":0,"cool":0},"jzzXNskg4X2OSn6cckGp2g":{"text":"We were wandering around the neighborhood and decided to stop in for manicures. I live in ","useful":4,"cool":0},"lIB1OsD-knDguAv1A06Pbg":{"text":"Top Notch!  On a weekend visit from Atlanta, my husband and I went to Buff for relaxing pe","useful":1,"cool":0},"5_d3zA2S4rITSTqZkBqKqw":{"text":"Absolutely loved Buff Bar. We went here aa a wedding party and it was the perfect salon to","useful":0,"cool":0},"QmDUX0AQdlW1y__ktTk3Hg":{"text":"The best manicure I've ever had!  A week for natural nails is exceptional and I'm a week a","useful":0,"cool":0},"ZQXPwjQT7864UU1Yp1Bb7g":{"text":"Did the quick pedicure in this cute, stylish salon space. Swan was so nice and the owner w","useful":0,"cool":0},"HBU0pAfGDLeyhXqvKw2W1w":{"text":"Very nice place for pedis. I have been on the hunt for a nail place for a while and I thin","useful":0,"cool":0},"vBI3jJ1OjLtGGHObBJwzXg":{"text":"Called ahead and got a fast appointment.  Since we were visiting from out of town the staf","useful":0,"cool":0},"W0-E0lFdhTsrkgEvzY3M7A":{"text":"Went to Amanda for waxing. Basically painless, quick and thorough. Highly recommend!!","useful":1,"cool":0},"rFXKQnNffL7nv8dxkjg6JQ":{"text":"Went to Buff with 8 other ladies on a Bachelorette weekend. It was amazing! They were so a","useful":0,"cool":0},"YeX_hTaUVPcVoFgM_zRjDw":{"text":"I had such great appts at Buff Beauty Bar! I'm so glad that I found it. Cydney is fantasti","useful":0,"cool":0},"h_OAazo3dUhQjF5oEJi9dA":{"text":"It's not difficult to find a nail salon in NOLA. It is difficult to find a great nail salo","useful":2,"cool":0},"7bq1Ut5mwX__lQ7OHuXp7Q":{"text":"I'm visiting from out of town and found this salon via Yelp. Stacey did a excellent, detai","useful":0,"cool":0},"7C2P_yaewSdG6Dx5ViaTlw":{"text":"My time in the facility was great. I was greeted and serviced by friendly staff in a timel","useful":0,"cool":0},"rJO1z5ZM8K_GmziCVNwqHQ":{"text":"Had a simple blowout at Buff. Well...simple compared to up-dos and other things they're ca","useful":6,"cool":0},"xJ6s8PBkG3d7ThSMVU0G_Q":{"text":"Nice clean place. We didn't have an appointment and people working there sighed and \"worke","useful":1,"cool":0},"seIXKCuPpavcIqfiO_4gRw":{"text":"Totally fantastic experience. On a Sunday. With very little notice. Also: inexpensive. Com","useful":0,"cool":0},"5j_ns8AH32qTZLQWmN8BNw":{"text":"I had a great visit and gel manicure at Buff. The salon is well kept and clean. The staff ","useful":0,"cool":0},"d8DLfc1q_z_ZlUMe4qx-vA":{"text":"Ashley did an awesome job with my hair and Courtney did an amazing wax. The place is gorge","useful":1,"cool":0},"2TW7WY_vy-fyHwx84GfL6g":{"text":"Free champagne and wonderful service! Pedi made it through muddy jazz fest !","useful":2,"cool":0},"0Asvm1DFvqTFw3JP71HuYg":{"text":"The manicure I got at Buff Beauty Bar was so good, I had to leave this review. \n\nThe place","useful":1,"cool":0},"F0XmM01auZ_ZCvybdPFnEA":{"text":"Open on Sundays, I was able to get a wax appointment 15 minutes after I called, and receiv","useful":1,"cool":1},"Ne0K9SrQ_Xhk9qE-n1XHMA":{"text":"Found this place through the great reviews it has on Yelp, and I have to say they are spot","useful":0,"cool":1},"s260dyWSM6l5-Ws7X5aFKA":{"text":"I definitely don't give 5 stars out all willy nilly but this place definitely deserves it!","useful":1,"cool":0},"j86QcVh_OpK_5Gyo2UI3kw":{"text":"Service was awesome. Upon entering receptionist was very friendly and I was offered a mimo","useful":0,"cool":0},"HLiKYUkcZyQ9cfq8SJHX6Q":{"text":"I came here for my wedding. My experience with booking was Fantastic! Initially they did n","useful":1,"cool":1},"WQEcAASVAEM6CzLIEk-MTA":{"text":"I missed my regular pedicure spot before going on vacation and this was a great recommenda","useful":0,"cool":0},"mH1LcOkXN9aVpSdOk__NFw":{"text":"Great customer service from everyone... greeting, to actual service (I use Raine for waxin","useful":0,"cool":0},"7cAPVT9blXHJOxyAa1oXcA":{"text":"Had an awesome experience here! They have early Sunday appointments :) they were slow and ","useful":0,"cool":0},"IlMdwdljVYW0kAFsRny4Lg":{"text":"Cute place TERRIBLE blow out. I wish I'd just don't it myself!???\n\nGo for nails, not for h","useful":0,"cool":0},"3PukbnWPhwpQrWRlEDJwUg":{"text":"Made an appointment online and came in, hoping to get a gel manicure. \n\nWhen I arrived, I ","useful":4,"cool":1},"ixJDdxA1s6I-Y-vDfbBmLw":{"text":"Excellent place!! My friend and I were looking for a professional yet fun place to get ped","useful":0,"cool":0},"ejxVl97Zy6QWFecLkRjJRA":{"text":"THIS PLACE IS AMAZING!!! A MUST FOR BACHELORETTE PARTIES\nWe were in New Orleans for my sis","useful":0,"cool":0},"gW8uQZIoQbxXTIP4aEaZyA":{"text":"I travel a lot and I need a place that will treat me and my nails right. I found Buff Beau","useful":4,"cool":1},"C6Dl6y5plfkni3hsYruSXw":{"text":"I'm in town on business and was too busy to see my local ladies before I left for my trip.","useful":1,"cool":0},"pRxcbyuvm7YBeNyYnAP5mA":{"text":"I made a group reservation last weekend for myself and several friends. We all had a varie","useful":0,"cool":0},"Yw7C0i26xiYNJB3LLjbGZA":{"text":"5-star reviews well deserved! Did an impromptu girls day with my niece on my last day in N","useful":1,"cool":0},"3VYpz4S3t2sezW3ftuD9Qw":{"text":"I walked in without an appointment hoping to get a gel color manicure. The receptionist wa","useful":0,"cool":0},"bgzcm5xxtIptdfpV7O5J6w":{"text":"Great service! I told Whitney exactly what I wanted and she didn't disappoint. Cute boutiq","useful":0,"cool":0},"aqAI4u-9IhPEhSxqAra8rQ":{"text":"Awesome place! So glad I came in for a mani/pedi while I was visiting town. Kristin was gr","useful":0,"cool":0},"JJGjXp2J7P3vrGmlNcQhvQ":{"text":"I feel that this review might cause Buff Beauty Bar's review page to implode from a critic","useful":11,"cool":3},"EEMCWIsqSXS-DuE0o6sWOA":{"text":"This place caught my attention as my companion and I made our way to Herbsaint when we wer","useful":3,"cool":0},"Vuk9avn4ca8YFiQdavkh3A":{"text":"Lovely little spot right next to the Ace Hotel. Great service, great products. They have b","useful":1,"cool":0},"2fPMVy-GprZ6sqDWnwF_Yg":{"text":"Was visiting New Orleans for work and was in desperate need of a manicure. Chose Buff Beau","useful":1,"cool":0},"k7ojllGtEQhJz3tcCSlE7g":{"text":"I had a great experience here! I got glammed two days in a row and was happy with everythi","useful":0,"cool":0},"8ylp_yBSxFC2EaEI1pEGxQ":{"text":"I visit every 2 weeks for a mani.  I love the staff especially Michie.  Complimentary mimo","useful":0,"cool":0},"IpnUXih38XIpYtINdcHxcw":{"text":"Decided to try this place because it's so close to my place.  I wasn't offered any mimosa ","useful":0,"cool":0},"nXrnR4OMODOAaaClxuP7pw":{"text":"I usually only have good things to say about Buff Beauty Bar but today was different. I wa","useful":1,"cool":0},"V5d7LrlMNW6zEdGQ4f9mjw":{"text":"WAX = ASK FOR AMANDA!!!!!!\n\nSo I have never had anything waxed besides my face. I wasn't p","useful":1,"cool":0},"kVjlU0Qo1Y5Fw57MWZVgMQ":{"text":"Very chic setting, great music, lots of services that a regular blow dry bar doesn't offer","useful":0,"cool":0},"kid2qATO2jK-XkCLp8IW5g":{"text":"One of the best mani-pedis I've ever had! Call ahead just to be sure they have availabilit","useful":1,"cool":0},"56PF_pWfm3oa-6be6nDItw":{"text":"If you need your nails done, come here! Lovely atmosphere, nice people and quality work.","useful":0,"cool":0},"e_POKxrNaLODBv4vw4DgYQ":{"text":"Got a blow out and full face makeup for engagement pictures. Was a bit sad since I got a c","useful":0,"cool":0},"JST8y141S7WUJMD2u9mWZw":{"text":"It's a bit expensive  but I still love this place. Great staff.  Clean, comfortable space.","useful":0,"cool":0},"6UWL5arHylw5mKo5kiFx3Q":{"text":"I needed a gel manicure for my upcoming trip and boy was I disappointed. I've been to buff","useful":3,"cool":0},"ImG9vWJPKAsqVnNWcmdKRA":{"text":"Stopped in on a whim about two months ago, and have been back almost every other week sinc","useful":1,"cool":0},"A3CyBjqW5ehMUcnunLr1KQ":{"text":"This was a great place for a quality manicure. The salon was not only super cute but also ","useful":0,"cool":0},"lKko_JnbxbVawFVDQQCk9A":{"text":"Pure desperation and sad little toes brought me to Buff Beauty Bar the other day for a ped","useful":7,"cool":0},"08oMOWzhICSQP4ew3BVnFA":{"text":"First time there today. They have such amazing customer service it makes you feel like you","useful":1,"cool":0},"TydLv9MA0wuxkbEow0eBIg":{"text":"Great service & very personable staff. And who cant appreciate complimentary mimosas and r","useful":1,"cool":1},"EcpxCr5ri9I8a62r4ztAlw":{"text":"I had such a pleasant experience here with Taylor more my manicure ! It's so pretty and do","useful":0,"cool":0},"eIOAhCaavOcHPGi_hwfcNA":{"text":"I recently hosted my bridal party for manicures here. Sarah is so awesome and the entire n","useful":0,"cool":0},"bhP5yp6qMu5qVtWb3y8tvw":{"text":"Came in from out of town for a wedding. Perfect place for the bride and flower girls. Grea","useful":1,"cool":0},"9RWXF6bOA-BZozQSnUSSJA":{"text":"I have been getting Brazillian waxes for years now. It's hard to find someone who makes th","useful":1,"cool":0},"CvbXxHixTnyRuH9m0nQp9g":{"text":"So I shaved off 1/2 of my eyebrows when I was 12 and a spot and on each side there's a spo","useful":6,"cool":5},"ZQHKn73Z5d09xUDjh9OA7w":{"text":"Had a great basic pedicure with Emily. I booked online, which was easy and problem free. W","useful":0,"cool":0},"f2oFgdQg6J0uXTzDRFHKpw":{"text":"Amazing brow wax during my stay in NOLA for work. Was able to book an appointment online a","useful":0,"cool":0},"Jlk45SYJRpCENgxllxyVjA":{"text":"I came to New Orleans with my boyfriend for a short vacay but I was in serious need for a ","useful":2,"cool":0},"3uNVjWNwKJUH44MR9-ImPw":{"text":"I was in New Orleans for a long weekend getaway and managed to destroy my fresh pedicure o","useful":1,"cool":0},"hh0G2IgGnAijAt45A2gWRg":{"text":"I had the most relaxing blow out ever!   I was in town for a conference and I was trying t","useful":0,"cool":0},"w-G80L2OeG_Uqt6TmJeE3w":{"text":"Kelly was very kind and professional, and whatever wax they use was the the least painful ","useful":0,"cool":0},"rpcYdyX63wDtIg4r7AaIOg":{"text":"I don't get my nails done often but I was so impressed with the attention to detail Whitne","useful":0,"cool":0},"-MJi_ZmhVT4d_KbP_TPyyg":{"text":"Just had a pedicure here, and after reading the reviews, I am actually pretty disappointed","useful":11,"cool":1},"yq8a1czfjmcRIlxLBFYUsg":{"text":"Love this place! Visiting from Los Angeles and I felt right at home. I came in with a Brid","useful":0,"cool":1},"Bxuj4bBixYcZ_UzPzvcGzg":{"text":"I had been really excited to try this place for a gel manicure, even though some of the re","useful":3,"cool":0},"Fet64Pe55BK4s7Qd9iY8Rw":{"text":"Natalie is AMAZING!! I had never had any kind of wax before and I was very nervous, but a ","useful":1,"cool":0},"ASKMr82OFCFhjnB3WhdHzQ":{"text":"Came from California needed my hair done. \nThis place was amazing.   I had a blow out my f","useful":0,"cool":0},"04Okau1I4pE8-fMCswQFlQ":{"text":"Cute little studio, friendly staff. Able to get me in last minute for a blow out. Note: cu","useful":0,"cool":0},"Lk48PIkPNPzeogmj3Z3_HQ":{"text":"Whitney gave me an absolutely pristine gel manicure. Not a stray cuticle or drop of paint ","useful":0,"cool":0},"ZuUT5m1eo7nt_SxtNZ1oIQ":{"text":"I love this place. I've been going here since they opened and I honestly haven't had any c","useful":0,"cool":0},"V2WfQfnBAhbLYI0e-6uhJQ":{"text":"Angie is simply fabulous!  My hands and nails definitely needed work and she did a terrifi","useful":0,"cool":0},"0XltE57DjbSNv8cNHMiV3g":{"text":"Can Kim come with me everywhere?! I absolutely adored her, her energy, and her style. She ","useful":0,"cool":1},"TmAfukgObcB91LMQBpzgQg":{"text":"I came here two times right before my wedding. \n\nI made an appointment for 3 manicures and","useful":1,"cool":2},"m_6BYYl6KvsA0I_kW4brvw":{"text":"I have been here a few times and Ive always had a great experience. The staff is super fri","useful":0,"cool":0},"gNVbVAv4ZMn5hTp3upSdtw":{"text":"Just like Jenn C, I literally walked into my hotel room on day one and ruined my pedicure.","useful":1,"cool":0},"Tu8vw2Ju0PJHy7cKkxmsfQ":{"text":"Brazilian bikini waxes are painful..yes...except when they're done by the ladies at this c","useful":9,"cool":1},"gkJ2UN1f1oYjMpoFsrqg3g":{"text":"Stop the presses: it's finally happened: I've found my nail salon in New Orleans, friends!","useful":21,"cool":9},"K99EgwYAQ-2ssgmvPtwYgQ":{"text":"What a wonderful place this is! And something this area desperately needed.The inside of t","useful":0,"cool":0},"UWo0PcZL_GpCJrkKoJDSnQ":{"text":"Found out about Buff Beauty Bar online and after reading all the stellar reviews, I had to","useful":0,"cool":0},"BwI6KdYDqNkGiy8rpdTYlA":{"text":"Buff Beauty Bar is amazing. Michellina makes you feel amazing afterwards. She is the best!","useful":0,"cool":0},"UVs9GA6b9EUHJeVo4UQKGQ":{"text":"Love this place! I've been coming here for years for waxing. Natalie is the best! Great se","useful":1,"cool":0},"e_Oun80RD_2judsLhxdWwQ":{"text":"I was able to get an appointment online Wednesday night for the following afternoon. I enj","useful":1,"cool":0},"GiV9yd_k2TTvV62DyRDF0w":{"text":"Decided to have a manicure here and really enjoyed it. The place was clean and the service","useful":1,"cool":0},"psyBsmGzEnlFd2fTOMqrdw":{"text":"I visit every 2 weeks for a mani.  I love the staff especially Michie.  Complimentary mimo","useful":2,"cool":0},"ksETdZB0_sN1HHJEqKa1UA":{"text":"5 Stars for \n- online scheduling \n- hands free check out \n- drink with service (water, cha","useful":2,"cool":2},"vWZw5QKZEHisDg4639PI8w":{"text":"Buff charges a $10 fee to remove a gel manicure that was done at any salon other than thei","useful":9,"cool":0},"x9KrOOl2QJxYUsnR_hbQPA":{"text":"Absolutely LOVE this fun spot. The people are so kind and helpful. I needed something very","useful":0,"cool":0},"W68z_pEFL9u-mejrnVATxg":{"text":"I visited Buff 3 weeks ago to get gel nails done as part of a bridal party and am very hap","useful":0,"cool":0},"_OcQy2augQpdGgFfoOXdIQ":{"text":"Great experience each time I've visited. Professional staff. Vegan friendly products. Prof","useful":1,"cool":0},"nU1wBVDAnXNG1cIuDT0_vg":{"text":"This place is chic and classy. I love their decor. The lady I saw did a wonderful and effi","useful":1,"cool":1},"2ncB1dMkaBiBlxKMLsydgw":{"text":"5 stars-- visiting from out of town it's scary to try some place new and only go off of re","useful":0,"cool":0},"HY8BiJi_0kfML2hZO9aIbA":{"text":"I've been to Buff a few times now and have gone back and forth on my review. The first tim","useful":3,"cool":1},"EctIEVOYuo3HNtyr9DaB-w":{"text":"I've been to Buff Beauty several times now, and I am torn on how many stars to give, so I'","useful":4,"cool":1},"C1XSSmCAF22ExclztEVK4g":{"text":"Assata is the best!  She listened to my requests carefully and went above and beyond to ma","useful":0,"cool":0},"0SmZVtxXo615cdNL85rxqQ":{"text":"I took a few other reviewers advice and made an eyebrow wax appointment with Raine. First ","useful":2,"cool":0},"8d891weCFe0AkMTD8izZTw":{"text":"My friends and I are here to celebrate our culture and women in general. Unfortunately, we","useful":4,"cool":0},"kRA0sgxL8QXnSyj2zEwPYw":{"text":"I found this spot on yelp.  I had polished my toes before I left home to cone to NOLA, but","useful":0,"cool":0},"PyXVza6CmEijJJ7eo_pBUQ":{"text":"Ladies- I was a body waxing virgin when coming here. I've had my brows done countless time","useful":2,"cool":1},"9RVP97FTEj-0xAxVAkp4MA":{"text":"I loved this adorable place! I went in for a pedicure and truly enjoyed the entire experie","useful":14,"cool":9},"mG18mLO-suzmn7htSVWo7Q":{"text":"Really neat place! Apparently the building used to be an old car dealership so it's got to","useful":0,"cool":0},"1en85pEFQ4ZkrGJmT6yeWw":{"text":"I just wanted to thank the great staff at Buff Beauty Bar who got me ready for my surprise","useful":0,"cool":0},"0t09ai0ZvxyY3catw6qoKw":{"text":"This place is awesome! I wanted to make an appointment for a mani-pedi but was only able t","useful":0,"cool":0},"Qll2n9MRSEhUWjL5wSjVgA":{"text":"Loved my stylist, loved my glass of wine, and LOVED my manicure. Crawfish for a Compliment","useful":0,"cool":0},"BT2RnDn_dN8cFq8ZiapRCA":{"text":"Went there for three gel mani and standard pedis, eyebrow wax, bikini wax, eyelash tint wh","useful":0,"cool":0},"f1tB57Scm_y22Z-qXntk8g":{"text":"The ladies at Buff Beauty Bar were my saviors on my wedding day! Last Saturday, I was gett","useful":0,"cool":0},"SYgDE6nS2IPYjC6Y6Gy45A":{"text":"PEDICURES BEWARE: For $45, you would expect a solid pedi with a massage chair, jet foot ba","useful":10,"cool":0},"Ks9Y6s03lHMK1SxZ_eCZIw":{"text":"Great service. Had an updo for a wedding I was attending. Very accommodating with a Sunday","useful":0,"cool":0},"rRhcObPTwjPvbp0v542X0w":{"text":"Since this is an upscale salon, you pay a premium for the services. I absolutely do not mi","useful":4,"cool":0},"lK9ckzOc7LslNYKCV8m1jQ":{"text":"Walked into a very friendly and clean environment.  Whitney did my gel manicure and she wa","useful":0,"cool":0},"GiWEM_Qq1DkOtbSbCl70MA":{"text":"It's a cute experience but overpriced for the finished product. They have a nice variety o","useful":2,"cool":0},"7Bd8jQVj0VVHbwdfObGjYg":{"text":"I was not impressed one bit.   Not thorough, not very friendly and manicures/pedicures loo","useful":0,"cool":0},"TNEH72UpnRVEBmAYsxi_8Q":{"text":"Great place to get your nails done! The nail stylists are talented and quick. Plus the pri","useful":0,"cool":0},"vGccrxuEndZ1Kos8EfDt-w":{"text":"I was in New Orleans just for a day and needed to get my nails done. The staff went out of","useful":0,"cool":0},"y5Et5DiBV_EOr5-eKdl7pg":{"text":"My best friend treated us to manicures the day before my wedding.  I so rarely get my nail","useful":0,"cool":0},"BvjAuCyQLR33Mk5Z-Ed_3A":{"text":"If you are visiting and want a n extremely relaxing manicure and pedicure, this is the pla","useful":0,"cool":0},"04lj5eaOcm21q9e0_rfz5A":{"text":"The staff was great--super friendly and thorough! My friend and I walked in and was lucky ","useful":0,"cool":0},"wuvSj5omJtnUZiEkF3R8og":{"text":"The service is fast. One of my nails cracked but they fit me in & fixed it right up. Defin","useful":0,"cool":0},"E4FpH147uRDG2QQZuH2v3g":{"text":"I discovered this place on an accident a couple of years ago just walking in Downtown. The","useful":2,"cool":0},"y0Mn2eNJouM1UkS3P3l-Sw":{"text":"I've passed Buff many times, but today was the first time I went in for a service. Decided","useful":2,"cool":1},"D0dlFRA4gwNOWkdBS90VLA":{"text":"I walked in without an appointment, but I was able to be seen within 30 minutes. I got a g","useful":0,"cool":0},"haB2GAq49NGeshq-fjLxpw":{"text":"First time here today. Comfortable waiting area but i had a very short wait. Excellent ser","useful":0,"cool":0},"dT_LFKwNrR3samsXDrywzg":{"text":"You can totally walk right past this gem.  If it wasn't for the previous reviews, I would ","useful":3,"cool":1},"Z5HiGF0vzolmmd6fI_uz3A":{"text":"Raine did a wonderful job, I was really happy with my brazilian wax here! I booked it the ","useful":1,"cool":1},"GG1SLytkf-8nbCXWiZ4CaQ":{"text":"Cute place, I like that they offer drinks and have online scheduling. My tech did a great/","useful":1,"cool":0}}