{"ZNZMWPfPdbbM7dhZlIpoFA":{"text":"Took a while to get actual service but once we did I was happy. The gumbo was awesome and ","useful":0,"cool":0},"fJCGrvho52mu9wT_yd4jnA":{"text":"I would give it 5 stars but I when I look at my rating dispersion I realize I might be a l","useful":0,"cool":0},"gH_gNlIpe3cRUEMcB62Xew":{"text":"Let me point out that I do not eat oysters! I have been to this place a couple of times bu","useful":5,"cool":3},"nwnEmtEgm81ein9sJsWE7A":{"text":"Cool touristy place right in the heart of it all.  I loved the fact that people were throw","useful":0,"cool":0},"iDjVXEy7tdSE8Lcnm2-H2A":{"text":"The food here is amazing and our server Geri is one of the best servers I have ever had. T","useful":0,"cool":0},"jdjoHxy7_I0D5BRIV9RPyA":{"text":"Great service, great oysters.\n\nAll the doors/windows open air to Bourbon St. Nice place fo","useful":0,"cool":0},"nSVr7WHZGmFNNc0FB1MqTw":{"text":"Catfish, poboys, raw oysters, red beans & rice. Oh my! The food at Desire was too good! My","useful":2,"cool":1},"t_1-C9m2OwA2rqseyzpfqA":{"text":"I went to Desire Oyster Bar back in 2/2009 and really liked it.\n\nI had three types of oyst","useful":0,"cool":0},"JzZdse6xQZICij9JZoV7hg":{"text":"Try the Green Bloody Mary!  Creative twist on a classic. Got a delayed kick, but it's a go","useful":0,"cool":0},"apkCmwCLAYay7qLw4uz8zw":{"text":"Ate at Desire two times, once 2 years ago and 2 weeks ago. Both experiences were picture p","useful":0,"cool":0},"KOZCTOKk7W6s3z2M6p9V3A":{"text":"Wife and I got the eggs Benedict. I am an eggs Benedict lover (I'll Admit it) whoever firs","useful":0,"cool":0},"p5RF6pGqEjUnnI1uWXvVOQ":{"text":"Highly recommended!! Excellent food, great service!! Came to the quarter looking for somet","useful":0,"cool":0},"vrXzTe-2qa0AFTtO3Erm0Q":{"text":"Stopped in for a late lunch upon arrival. We were famished. Our server was on the case and","useful":1,"cool":1},"thj1mLmhmKZusub_JIT73Q":{"text":"The raw oysters were good, although I noticed the shells were dirty.  I'm all for freshnes","useful":0,"cool":0},"vfWxlPuR4sA9iJyyv93SUQ":{"text":"Had a blast at the raw bar savoring their terrific bivalves and the local beers. Rodney th","useful":0,"cool":0},"z2d5EGK8nlOZDta8j_lUdg":{"text":"Wonderful experience both times. It can get really busy for dinner but the wait isn't that","useful":0,"cool":0},"0FwWi4GdxgtfTkQrM9NFnA":{"text":"As someone from out of town, all I could look forward to was the food. And let me tell you","useful":0,"cool":0},"wphbA_OQlOtP4AaT8oTeOw":{"text":"Food was a 3.5 or so, but our server Kiki pushed our rating up to 4.\n\nOysters on half shel","useful":0,"cool":0},"-SpL1Jfx6WuPcgb-zFcJnQ":{"text":"Huge oysters when I was there.  Great service!  Had a muffuletta  (half).  It was all very","useful":0,"cool":0},"M9986itjRz9fclHdTmUczg":{"text":"Service is not their strong point.  The hostess actually walked away from me when she saw ","useful":2,"cool":2},"a4vaYdwHGmr4eYq4ONzKPg":{"text":"This place was pretty good. We came here on a Friday evening right before 6. Happy hour wa","useful":1,"cool":1},"N3wSJpaHPil-eJLvBFPK6g":{"text":"Decided to come by here based on yelp reviews...it was decent, not a place that wowed me. ","useful":0,"cool":0},"aR18hH61hRiuMc9DJnOQoQ":{"text":"Tried the char grilled oysters and they were excellent.  The bartender recommended them an","useful":0,"cool":0},"p_Lha9jRwAa-A7k36uw0vA":{"text":"I had the fresh red fish and it was amazing.  The atmosphere was great and our server was ","useful":0,"cool":0},"jHGgxPCzTOWlEmurNJIE8Q":{"text":"This is the only place I will order shrimp and grits in NOLA!\nGreat atmosphere, friendly s","useful":0,"cool":0},"24wRCl4rswWprHQNozTzyA":{"text":"Do Not Eat On Bourbon St....advice from the locals I wish we had before we stopped here.\n\n","useful":4,"cool":0},"5vmJtjKgb3hcLWjf3d8YXA":{"text":"The food is good, but the service sucks!    It took them 15 minutes before anybody check o","useful":1,"cool":0},"RJI5Nne6DZdgSbKH6vDLGw":{"text":"One star for location, another for our great waiter, Milton.  No stars for the food.\n\nOur ","useful":0,"cool":0},"JIiT6v0mEf81CiOgEX4sFw":{"text":"Service and food were great.  I had the catfish nuggets for an appetizer and BBQ shrimp fo","useful":0,"cool":0},"Z9Rk24mGcIv0TfgjTvKtPg":{"text":"Came here for a late night dinner with friends. We shared a half dozen raw oysters and a h","useful":0,"cool":0},"OwpdvSIHJbiQBFH8mLdWGw":{"text":"I stopped by before a parade and met with my family who were visiting from out of town. Jo","useful":0,"cool":0},"sNfQSkr2KNvwU7H9QV0Awg":{"text":"Wonderful!!! The portobello po' boy was one of the best I've ever had. A great lunch stop.","useful":0,"cool":0},"cH3NoTiSPj4orZFNYSrKvQ":{"text":"Went here and was immediately welcomed In and offered coffee. Very nice service from the s","useful":0,"cool":0},"OP2QXb5P4BZVgoB70IEF3w":{"text":"First place I stop for lunch in New Orleans, at least a dozen Oysters, usually the seafood","useful":0,"cool":0},"Cq85DTm8Fw5b9LtpfFHdEw":{"text":"Oysters on the half shell are giant and delish! Also tried the chargrilled oysters and tho","useful":0,"cool":0},"Ic1MomXlCVXuWTlvpL9drQ":{"text":"My first creole experience in louisiana . I ordered dozen raw oysters and my Bf ordered th","useful":0,"cool":0},"wMgqWzcGyWdwIEaJbakf3A":{"text":"Everything about this place was wonderful. The waitress was lovely and I loved the archite","useful":0,"cool":0},"GCxBpPid8-gfdP3JIT78ZQ":{"text":"I don't eat raw oysters by my husband does and this was an experience.  Kntrell and Franki","useful":0,"cool":0},"bVdzsli4iT3KA5wH97Fajw":{"text":"Went to NOLA over the weekend and stayed at the Royal Sonesta. Desire Oyster Bar is one of","useful":0,"cool":0},"HBXS8vZq8vjfV2i7iGl5Pg":{"text":"They have some of the best oyster dishes that you can find on Bourbon St.  The boiled oyst","useful":0,"cool":0},"DloAZc8IbCI1CMxLLqVrvw":{"text":"we had the crab Mac and cheese-a must!!-shrimp roumalade, firecracker oysters, crawfish et","useful":0,"cool":0},"YaYQWwU2qIk3UJtKhEKkBA":{"text":"Great Authentic Creole food at a fair price on Bourbon. Tony was our waiter delivering car","useful":0,"cool":0},"YF61-fmDmpT96HIAKfZQkQ":{"text":"Its a spacious, clean cafe on Bourbon Street so ideal spot for lunch. 5 stars because the ","useful":0,"cool":0},"Id00L7xANle3mIn4h_W4VQ":{"text":"Went on a Sunday night when bourbon st was dead...BBQ shrimp was the best I've had. Cajun ","useful":0,"cool":0},"Wn47JCSrBKP2ZZXWE7ZkrQ":{"text":"I walked down to the Royal Sonesta and went to Desire Oyster Bar.  The place was packed!  ","useful":1,"cool":1},"bO5Iu0DRGqlrSW5g9PPONg":{"text":"Came here for the Char Grilled Oysters and they are absolutely amazing!!!!! 10 times bette","useful":0,"cool":0},"MI-z8D_O0eicPXZ4FdoxFQ":{"text":"Yum yum yum!\n\nDelicious food, great service and a very nice place in the midst of bourbon ","useful":0,"cool":0},"tIywDPoYINsVShY3oRcKoQ":{"text":"Didn't try their oysters, darn. \n\nI had the shrimp creole and it was tasty, needed some mo","useful":0,"cool":0},"zBSN1OTBCSMovX07vLkZZQ":{"text":"Food was excellent, but service lacked...several choices and everything tasted great.  Hig","useful":0,"cool":0},"DqiyHaFcmr6eosvQJV2qMA":{"text":"Suppose you've been drinking on Bourbon Street most of the evening. Suppose 11:30 pm rolls","useful":1,"cool":2},"W8knTXnX952lZmlip7llpw":{"text":"Great food great service. My family and I had a great experience. Best oysters in NOLA!!","useful":0,"cool":0},"20xH1GGgcnblJpRlYhQNCw":{"text":"Last time I was here I had the turtle soup (amazing!) and gator burger (not too amazing).\n","useful":0,"cool":0},"3gusm9krATFrvSRSdB1Adg":{"text":"My first taste of oysters did not disappoint. The wait wasn't too long - the staff kept th","useful":0,"cool":0},"51jl3fLa9SZUjY1ZkY10HA":{"text":"Food ok but expensive , nice atmosphere \nVery clean. Great server \nGiving it three stars a","useful":0,"cool":0},"g-OsLVguksk7bv-9CbXLEQ":{"text":"What a fantastic place to step in and watch people. Staff is soooo friendly the Chef Cory ","useful":0,"cool":0},"tfXEpffFBSUjFmDn5a6B3w":{"text":"My husband and I were passing through the city from a long road trip, and I have always wa","useful":0,"cool":0},"gI2_6yXm1k_wukbUGXdwpw":{"text":"In town for a convention and stopped in for dinner on a Saturday night. Line was not as lo","useful":0,"cool":0},"dT8h2P6ADP8cMIjZs-gA1w":{"text":"Ehh, just so-so.  Not a rave review, by any stretch.  But to be fair all I had was a salad","useful":0,"cool":0},"Gr4PRwj8lH9wL6KrRsyZuA":{"text":"For our last dinner in NOLA we randomly picked a 4 star place that had crawfish étouffée. ","useful":1,"cool":1},"wvq1BMfyEUhQ3mhYZpokRw":{"text":"Jambalaya, bbq shrimp appetizer, oysters!! All delicious!! Bread is freshly heated and sup","useful":0,"cool":0},"5J8E6Q9edWp0xNeg4GJO-Q":{"text":"We wanted some oysters while visiting the city.  Went by Acme and the line was ridiculous ","useful":0,"cool":0},"k219khZxdk8rQMw_DLthuw":{"text":"Desire was around the corner from our hotel, and open until 11 PM, which made it very conv","useful":0,"cool":0},"FhaTh5UhZtlpsC41m1dkGw":{"text":"My wife said the crabcakes were the best ever!  I had a chicken caesar salad which was ver","useful":0,"cool":0},"Z9HbJxoirfuWf0yQ8Wl50g":{"text":"I went on a Friday around 7pm. I was impressed by the cleanliness and friendly staff. The ","useful":0,"cool":0},"9wNXqv_QjSQYEACEWIa_7Q":{"text":"Fried oysters with BBQ and blue cheese was the highlight of the meal. I wish we just order","useful":0,"cool":0},"GzLI8Uxwjv99vthw9SZr4Q":{"text":"We went in for lunch and the food was tasty but our waitress ignored us the whole time we ","useful":0,"cool":0},"Av4Ycw8PqS0UhzUW7Ara0w":{"text":"Gotta try the Oysters Desire, Shrimp and Grits, and Shrimp Po Boy. We eat here every time ","useful":0,"cool":0},"EbNRn3IfIYcGsnWdIyq0FQ":{"text":"The Hurricanes were better than any other place I had visited in New Orleans. The food was","useful":0,"cool":0},"2-BLdJM1qJ7_Tc3brSL7qw":{"text":"Went on NYE 2013/14 and got some oysters and jambalaya. The oysters were actually some of ","useful":0,"cool":0},"WMKhU_Bn2jRk80_FYQ5x3w":{"text":"The best breakfast in New Orleans hands down. Go see Ruthie. She is the sweetest lady ever","useful":0,"cool":0},"pabFd7nucRFtwwH_DoZIEA":{"text":"Ask for Gerri. Gerri is awesome. Desire has a great happy hour. $6 for 6 oysters and $3 dr","useful":0,"cool":0},"X-6bjW-Dd7xz0kSwl7r1FA":{"text":"Had the Alligator Meatballs with marinara over pasta and it was delicious. Everyone I was ","useful":0,"cool":0},"UXujKp7gE3bJBG27dKi7BA":{"text":"Our waiter, Tony, was awesome. Very attentive and friendly. The jambalaya was delicious. A","useful":0,"cool":0},"m1oDA3UzeHtzhwaLCYSTww":{"text":"To be honest we were hoping to eat at Acme Oyster house but there was a line around the co","useful":2,"cool":1},"DtWugPLSe7AICvq7AQPQJw":{"text":"Good location, oysters both raw and charred were very good. Service was highly disappointi","useful":0,"cool":1},"Sq_XBTyX_ujPXHHG68cFAw":{"text":"After our steamboat jazz cruise, we dropped by Desire for a late lunch. We had charbroiled","useful":0,"cool":0},"D7XhjgHBgGUcUbiT6VV0UA":{"text":"Part of our Living Social deal included a voucher for Desire Oyster bar.  OH where do I be","useful":1,"cool":2},"ZEItx_EdmoIkRkFn1vJ-JA":{"text":"We arrived on a Monday morning at 10.50am so only just in time for breakfast that finishes","useful":0,"cool":0},"jpX2I8O2ZUx0KoJ8NVeZpw":{"text":"Best meal I have ever had....  jambalaya I think was the best I have ever eaten.  Ate at t","useful":0,"cool":0},"cW9GnvwQvaQUyz8gS8zhUw":{"text":"Delicious!!!!! Started out with a French 75-light and bubbly but the perfect amount of alc","useful":0,"cool":0},"q3u1VWYqnHv9t9NXDs1EjA":{"text":"We found Desire four years ago and enjoyed it. We have returned every year on our visits. ","useful":0,"cool":0},"TBGhM3tbgxRYPOZl9jOu7w":{"text":"Went to this place almost every day recently when I went for jazz fest. The oysters are re","useful":0,"cool":0},"t0DRMuHv1-U52a_OSSDrJQ":{"text":"Came here for breakfast as I was staying at the Royal Sonesta.   Went with the basics.  2 ","useful":0,"cool":0},"VfSW5AmdBDp7IMVJH74yeA":{"text":"Visiting New Orleans for the first time... my sister had a taste for oysters and we found ","useful":0,"cool":0},"jbh5gVOy8blqgAudMR1xOg":{"text":"I have dined at Desires twice. Excellent oysters. Warning some of the hottest cocktail sau","useful":0,"cool":0},"0h4Y2HPghrTF306Is4UAhw":{"text":"We weren't here our first night in town. This place is just ok. The food was just ok. Not ","useful":0,"cool":0},"Yk9TbvUiQ4FHmEX-KAEHrQ":{"text":"I was able to walk in and get a seat at the oyster bar with no wait. This was after walkin","useful":0,"cool":0},"tH32aHNklMh0s9pPELvVPQ":{"text":"Stopped in specifically for the oysters and was not disappointed. Bloody Mary was pretty g","useful":0,"cool":0},"th5tL7pIDxUdgu_sYZmRKQ":{"text":"YUM we came here for appetizers before our ghost tour and it did not disappoint! The wait ","useful":0,"cool":0},"7U-VS1KTpVy9Dv6FOqDY8w":{"text":"I ordered the jumbo shrimp remoulade and really enjoyed it. It came on top of a bed of fri","useful":1,"cool":0},"SxU8VPUjvr0-Li8RvZyG5w":{"text":"We ordered a cup of gumbo, crawfish ettouffee, and chicken primavera pasta.  We actually t","useful":0,"cool":0},"ZcdrT--IaU3Md8W7E3yoVg":{"text":"Decent but nothing special. If you're looking for a place to eat oysters and drink beer, c","useful":0,"cool":0},"J7cueAffuTNcNsD4ap2XlA":{"text":"This is a great place to start your culinary tour of New Orleans.  Good, open atmosphere, ","useful":0,"cool":0},"FLpiFjBGI0jJMRpWDo4irg":{"text":"Desire is always busy yet I've never had to wait more than 15 minutes for a table. The ser","useful":0,"cool":0},"1YFAsWp_sF8uCJiLJbbJPQ":{"text":"This is a cute place. I came for the Charboiled oysters and the alligator. Both were good ","useful":0,"cool":0},"lkShDyh4wtALzmUs-eLgVA":{"text":"Was good, but not great.  I thought the gumbo was too salty for my taste.  Oysters were go","useful":0,"cool":0},"O96Nne_0yyM41fVP4mdIvQ":{"text":"Michelle is the greatest person ever. Ask for her. Michelle make that youtube channel. Tha","useful":0,"cool":0},"ybNVidPOOWybhkTlyDm4qQ":{"text":"Just returned from our first (but not last!) trip to NOLA. We wandered into Desire Oyster ","useful":0,"cool":0},"kda7bPw6pu_sRIPR9mYsnA":{"text":"Located on the 3rd block of Bourbon this is a great place to eat. The eggs benedict are re","useful":0,"cool":0},"O151X-10ULLd67kBsUSm0g":{"text":"The food was good...the service was not.  Wouldn't come back based on this experience.\nFoo","useful":0,"cool":0},"PHBIHJghnr4yAubf7H_8zw":{"text":"The reason that this restaurant is getting 5 stars from me is the fact that I can't stop t","useful":0,"cool":0},"IRYDYb4dWwpbrp4uTP8xWg":{"text":"Stopped here for some fresh oysters and Seafood Gumbo, \"THE BEST\"!!!\nIf you're in town and","useful":0,"cool":0},"HCqTCGKwSoyOXZdwvGPWWg":{"text":"Hmmm... In the end everything was okay.. But nothing more.. So, not bad but not outstandin","useful":0,"cool":1},"UtV-nVBdyjh0RWlCs0oCIg":{"text":"Desire!!!\n\nI had to scream a little because I was not expecting the amount of flavor and a","useful":0,"cool":0},"-lfLH7lqI5g6P4EuakVcHQ":{"text":"The food at Desire is simply incredible. Specifically, this was the best gumbo that I have","useful":0,"cool":0},"diTYvjD6qhbJB14gComAIw":{"text":"The so called crab sea food salad tasted more like a tuna salad instead. I'd stay away fro","useful":0,"cool":0},"lhVkTr0_C23KYINqhuntFw":{"text":"The BBQ shrimp was almost too salty to eat but the food was helped out by the horrible ser","useful":1,"cool":0},"IrcLIpknWY0yUFrXSqb8Pw":{"text":"Came here on a quick decision one night... our afternoon nap lasted WAY too long and it wa","useful":0,"cool":1},"leinSWTYlsva7MknqZO2Dw":{"text":"Best food I've eaten since arriving in the Quarter. Breakfast  eggs, crabmeat, shrimp and ","useful":0,"cool":0},"xj61CZTsZNn5Z_VZR8vNog":{"text":"In all fairness we didn't have a lot to eat here. The raw oysters seemed more fresh than A","useful":0,"cool":0},"nWM_xNCqEO9PHG8qCEXMRA":{"text":"outstandfing!!!  f because of what i cannot say in this post!!!  best shrimp and grits eve","useful":0,"cool":0},"_lpoEzEa1VliWsCQq6eHYQ":{"text":"By far this is the best restaurant I have been to in regards to service and experience ove","useful":0,"cool":0},"oMfpvHnW2BXhyekEUs71zQ":{"text":"This place was great.  oysters were phenomenal... and I stood up and shouted, \"this is the","useful":0,"cool":0},"npzQN_b67mCBuqCBfdeW0Q":{"text":"Waited 10 minutes to be seated.  No one seated us.  Found a seat.  Was rudely thrown out f","useful":0,"cool":0},"Y2x3WRtJXe_8qrINHMtGHw":{"text":"i am a New Orleans native and finally decided to try Desire's oyster happy hour. I AM A Co","useful":0,"cool":0},"6CF0ht6UQmc5edm0FPiQJQ":{"text":"Excellent!! We are from out of town and this was the best dinner we've ever had. The shrim","useful":0,"cool":0},"YKt00_3UvU144RkoyX4Ixw":{"text":"Simply the best oysters in the quarter. They are big and juicy and wonderful. Raw or broil","useful":0,"cool":0},"DyS8jqDU0aJX7I0w-IfZFg":{"text":"Stopped in late night and had delicious char grilled oysters. Wanted to have my fiancée ex","useful":0,"cool":0},"i9Km44SJ1GZKC5nbw-n_dw":{"text":"Best eatery on Bourbon street.  The staff is great!  An Tyrone & Rodney on the oysters are","useful":0,"cool":0},"CWzOyiyeAJUx9GLKNF3qUw":{"text":"So I am here because Acme already had a long line at 430pm and Felix Oysters I've already ","useful":0,"cool":0},"6VqKHOjgf4pp0XGEI5iL3A":{"text":"Outstanding!  BBQ oysters gives Drago's a run for the money. The seafood pasta dish was ex","useful":1,"cool":0},"qmr304jvtYetK5i_Djrx_A":{"text":"I really should have used my better judgement and ruled against eating at a joint on Bourb","useful":0,"cool":0},"VctoJxiG6Boh_Mm3ACQi4A":{"text":"Horrible, \n\nWas advised to sit at the bar to wait for a seat. Then was told to reserve a s","useful":1,"cool":0},"qpNyyolexyyuP_orbN9Uhw":{"text":"The biggest oysters I have ever seen.  The rule that big oysters don't have the best flavo","useful":1,"cool":0},"0k8mPXr5EZtJI5SPSQ8Tkw":{"text":"The hostess/manager was polite and was able to seat us fast.  The place felt a little hosp","useful":0,"cool":0},"PldyfYQn4_1HREkrvYn0Ng":{"text":"Love the peel and eat shrimp.  This is always our first stop upon arriving in New Orleans.","useful":0,"cool":0},"NTB2DNA8IRWrAU3ik2z9Fw":{"text":"I always find it odd when I ask a server at a somewhat nice place what a beer or wine tast","useful":0,"cool":0},"wE-AKTFxZ_Ocyt0dnetNAA":{"text":"It's been almost a year, but New Orleans, to my fuzzy memories, was a whirlwind of awesome","useful":0,"cool":0},"FxsecWx_dbAx5GoA0zKDpg":{"text":"We got a dozen oysters and they were MASSIVE - amazing for the price considering how meaty","useful":0,"cool":0},"FOAdsInmsbbVFZMdPa4Qxg":{"text":"Well, i'll start by saying that this is mainly a seafood restaurant and had I not be STARV","useful":0,"cool":0},"gtkcY3BGzYMyy5l81h0ycw":{"text":"So I was in NO with 7 other friends to celebrate over the weekend prior to the weekend bef","useful":0,"cool":0},"muqLp43K390_zb-dek5s2w":{"text":"Awesome drinks and the best service. The waiters are very attentive and friendly, quick wi","useful":1,"cool":2},"GgLSDXg2jrhpMjlc8rE4Jg":{"text":"My first choose was to eat at the Acme restaurant since all of the reviews. Saw that line ","useful":0,"cool":0},"N97VgqZPKPjztQ0jGnNdLQ":{"text":"Conveniently located on Bourbon Street, this venue offered a delightful safe haven from th","useful":1,"cool":0},"xZBr77sM_X-zHns1pesA1Q":{"text":"OOOOH Desire. Loved it. \n\nMy Tulanian sister recommended Desire to the BF and me and we ha","useful":2,"cool":0},"sQgEIMwggJWOr1W-j02rgQ":{"text":"Must try bread pudding! Tried oyster at 3 different places. Desire is the best! Oyster on ","useful":0,"cool":0},"I8gtNdkKzU0m05FPNy1xcA":{"text":"My shrimp n' grits were on point. Grits were creamy and the sauce was tasty and flavorful.","useful":1,"cool":0},"mjKXmX4NO-SqYz0lyDWZmQ":{"text":"Came across this spot while stumbling down Bourbon at 12pm Sunday morning with a killer ha","useful":0,"cool":0},"fmM_hYT1nwZNCQOUQ8kcdQ":{"text":"The Desire Oyster Bar is located inside of the Royal Sonesta. The actual restaurant is ver","useful":1,"cool":0},"YKcJraT5y2DX589Ztcti0A":{"text":"Rarely have I seen a waitstaff so disinterested. I know things move slower in New Orleans ","useful":0,"cool":0},"hXl0ALBE7wAzxV14_pr_lg":{"text":"Excellent New Orleans gumbo that hit the spot! It wasn't too spicy and perfect for lunch. ","useful":0,"cool":0},"K723aQvFZuXuKl5IcIvaig":{"text":"My date and I had a wonderful breakfast here.  Good quality food.  Service was a little sl","useful":0,"cool":0},"yUdPrZreomEEzxYe6rryNQ":{"text":"TL, DR Brief:\nThe Alligator Meatball didn't taste like Gator, but still delicious, and the","useful":2,"cool":2},"NDTbpSscOsUtMlxnlSOvoQ":{"text":"We stayed here.  The atmosphere was great.\n\nThe wine by the glass was reasonably priced.  ","useful":1,"cool":0},"sbY43VUVtJ0O2wf4qnzukw":{"text":"Excellent food shrimp and Grits great service chat  grilled Oysters were delicious shrimp ","useful":0,"cool":0},"hKrxASNbNeB0qjlxpHNkJA":{"text":"Super Yummy highly recommend the shrimp n grits and the broiled oysters. Our service was t","useful":0,"cool":0},"7G7eaR1h8NuemS8Io_vgXg":{"text":"We had the crawfish cheesecake, I loved it!!!  Husband said it was OK.  Pete was our waite","useful":0,"cool":0},"FmCr7EewySSx0RSNdOm-Aw":{"text":"This place in UNREAL. The oysters are phenomenal and their HH is great! I got both of the ","useful":0,"cool":0},"1N4emTA2jaXQDpuXQCwFbg":{"text":"This was our favorite place to eat during our visit.  We came for lunch twice.  Both times","useful":0,"cool":0},"GjvdqU81DcwqCUzoJYQd_Q":{"text":"For a restaurant located on Bourbon, this place is pretty good. Our waitress Kee Kee was r","useful":0,"cool":0},"9E-4nMjuncwCGEZUODbaYA":{"text":"OMG!!!\nSoft shell crab PO-BOY!\nIt was delicious! Still I remember the taste!\nCrab meat was","useful":0,"cool":0},"sZ_7BmLpfKYas-sZk8lI_A":{"text":"It doesn't happen too often, but once in a great while I taste something so amazing my eye","useful":0,"cool":0},"SI7pCyK7k0mfEkKLc2LIhQ":{"text":"We stayed at Royal Sonesta and ate at Desire several times through the years. Had favorite","useful":0,"cool":0},"j_LpgupGG17hhwuJTFNoGw":{"text":"wow what a disgrace that such an establishment that had the best oysters in town changed t","useful":0,"cool":0},"bSFmSEKl6kM6TDkEUPrF9w":{"text":"We were staying at the Royal Sonesta for last several days, and have been going to our reg","useful":0,"cool":0},"1j9TYX2wPBgAjqIXZs4BLg":{"text":"I had the fried oysters with BBQ sauce. Very good! My boyfriend had the Gumbo, also very, ","useful":0,"cool":0},"ULCJ5r3BOibZY_am1Y0QeQ":{"text":"Sat at the bar during happy hour for the $1 oysters. The restaurant was not busy at all--p","useful":0,"cool":0},"dzj4R_yUQeglUSYWiAeBGA":{"text":"We stopped in on the recommendation from our uber driver and this place was great. The ser","useful":0,"cool":0},"4VyupJ6687RUhBV09geLOg":{"text":"Unfortunately, our visit left us with a desire to have chosen another restaurant. We had a","useful":0,"cool":0},"4fBtdCHH9kQ9vZ9uI4mYLQ":{"text":"Awesome!  Always a treat!   Great food and great service... Its a family tradition... Ask ","useful":0,"cool":0},"74Rx2JEsXELR5QmwvDzThQ":{"text":"Service was prime time.  Thanks kiki. Oysters were awesome. Blackened catfish was perfect.","useful":0,"cool":0},"btK-59jJbbmKLQrNhH60eQ":{"text":"I couldn't say enough great things about this place. The staff is superb and so personable","useful":1,"cool":0},"SFsOEizXoNxGMEOFgcQ4mg":{"text":"Best charbroiled oysters in the French Quarter. The end. Friends loved the catfish poboy (","useful":0,"cool":0},"fipQSJB_XcirXUZi91W04w":{"text":"Brunch. !0:30 any morning. Creole Crab Benedict. Nuf said!","useful":0,"cool":0},"Cis-XzkXRE8QAeV4JP0CLg":{"text":"We came here to eat a \"second dinner\" after the food at Mr. B's was so damn terrible we co","useful":0,"cool":0},"kpf7hXUwlBvhr5S3vxaLWw":{"text":"Amazing that a smog place earns a definite 5 star review! I've used places in the past tha","useful":0,"cool":0},"6btq2YkDAEVVYnStYZyqfw":{"text":"Amazing. The food and service were ridiculously fantastic. The chef at the bar came out an","useful":0,"cool":0},"2KhmM7m6CmX3LGg7z6EDfw":{"text":"I had a pulled pork po-boy which was decent. Not too exciting. A lot of food though. The s","useful":0,"cool":0},"83RqNbGTZfChl_280f0AaA":{"text":"This is my favorite place to eat oysters in French quarters. I have eaten here a dozen tim","useful":0,"cool":0},"zX3x5fBlxeHMmg5fS8bURg":{"text":"A nice spot right on bourbon street. Excellent oysters, both raw and broiled. A fabulous S","useful":0,"cool":0},"qv-fcnZ8galx45VIo1QFEQ":{"text":"We enjoy coming here.  Great food, good service and the view of Bourbon street always ente","useful":0,"cool":0},"aWpNGg1YzDvZ3ghHiuDaiQ":{"text":"Food was great, service horrible. I had to ask another server to get our drinks, which wer","useful":0,"cool":0},"-ypQ6PMRRr513z1OcpZXNg":{"text":"Not impressed with the food quality. I ordered the Jambalaya Skillet, and it was just an o","useful":0,"cool":0},"uQcKtZ4rWuB3xZHAVKxx8g":{"text":"HIGHS AND LOWS-had a great roast beef po-boy on FRI-sat-ate with wife-great gumbo,split co","useful":0,"cool":0},"ux4yy45c0jCTqTqZjCpsTw":{"text":"Crawfish Bisque, Muffalata, Catfish Po-Boy is how we started our NO weekend get-a-way.  Th","useful":0,"cool":0},"tazxrW4BGoErYx4rQ3ilYQ":{"text":"If you are like me, I thought everything on Bourbon St. would be a straight up tourist tra","useful":1,"cool":1},"4UhpWVK69bsd4Ws6gdYs-g":{"text":"Compared to the other places we had eaten in New Orleans, Desire was excellent. It was clo","useful":0,"cool":0},"0cTIgbk1uIkGw73nlEpRsw":{"text":"Came in for breakfast and it was fantastic!! Staff was attentive, fast and friendly even t","useful":0,"cool":0},"eufm_z83Sp_lJMOcSLMyew":{"text":"I was in NOLA for Essence Music Fest, and wanted to try something different.  I generally ","useful":0,"cool":0},"nmjxspWa4lxZ-qXDovZxjg":{"text":"We stumbled upon this restaurant looking for something right off bourbon street. We did go","useful":0,"cool":0},"91PaA-lMq-WpItbzSpkaDQ":{"text":"Amazing!  A dozen oysters for $14 and two oversized martinis for $10 each.  This place roc","useful":1,"cool":0},"zDd5BRiJy6_-zN1XrEwnpQ":{"text":"My friends and I stopped by this place when we were visiting Bourbon Street. We ordered th","useful":0,"cool":0},"CugILSETq0UwJVNPgSnLqQ":{"text":"Found out about this place from our hotel concierge. We got the oyster & shrimp Po' boy, f","useful":0,"cool":0},"SWAkmZLRlrvJCESAIW0fww":{"text":"I'm enjoying the traditional Red Beans & Rice and GREENS/Cornbread. Bon appétit! The atmos","useful":0,"cool":0},"ZtdHUCmarM4oSQbEPh61dg":{"text":"Belgium waffles are fantastic, perfectly scrambled eggs, ample bacon provided! Atmosphere ","useful":0,"cool":0},"n0JTPfO0pO-mZ5vyGxjaKQ":{"text":"Eat at the bar! And make sure Marcus is working it! Great food and even greater hospitalit","useful":0,"cool":0},"bcI02Un-5f9RF0ngIOq1KA":{"text":"Great service!  Great Oysters!  Loved the ambience.\nMarcus was our bartender and took such","useful":0,"cool":0},"WUu0K1dIRgqoMCbsXULVGw":{"text":"I was pleasantly surprised when a place right on Bourbon was able to seat a table for 15 q","useful":0,"cool":0},"k7ZUpRiASa0Om7l4-nPStg":{"text":"We started with the Turtle soup, it was very tasty, but it was my first time with it, so t","useful":0,"cool":0},"YxI1K3JmQ7vI9ryDuz9d-A":{"text":"I went to New Orleans with a couple of friends over the first weekend of November 2013. Th","useful":0,"cool":0},"zff0owQ5PJpg43le8svk4A":{"text":"The crawfish etoufee was just awesome! , the Jambalaya is really good. The J&P dessert is ","useful":0,"cool":0},"J5q5hJTDzJ_VLuo0oTqJbQ":{"text":"My husband and I stayed at the Royal Sonesta for our trip and Desire Oyster Bar is attache","useful":0,"cool":0},"khcg38qKgg1K8lVJoDs0lA":{"text":"The gumbo and jambalaya are excellent.  The oysters are delicious as is the fresh horse ra","useful":0,"cool":0},"Nb1ixPOlKm_CroKnJW-org":{"text":"Great place to drink and eat delicious oysters!\nGreat service and menu has options for all","useful":0,"cool":0},"9kB66iaRuv0N5NuqK0DCOw":{"text":"Simply wanted a place for a meal late-night on a weekday, and got more than I had hoped fo","useful":0,"cool":0},"2FTOWhGJzC_2Prbt6O8CzA":{"text":"I visited Desire during my stay for Jazz fest.  This was our No. 2 dinner option after Acm","useful":0,"cool":0},"VSSSiyI-LuW51jNBB9j51w":{"text":"Awesome place right on Bourbon Street! \n\nMe and a couple friends decided to try it out on ","useful":0,"cool":0},"tItDeverIopWXrot57ouPA":{"text":"Christmas 2017 with my lovely husband and four year old daughter. Our first nontraditional","useful":0,"cool":0},"3hOD-xvZmrXgHnEmbCyqvQ":{"text":"I loved this spot!  My husband and I stopped in here for lunch and ended up coming back th","useful":1,"cool":0},"KUVqIcNBRdP9K6Hvz-hYTg":{"text":"Initially stopped in here for a quick drink before deciding where to wanted to eat dinner ","useful":0,"cool":0},"qsru94EXKbPghj5DY7A3ig":{"text":"OMG i'm so jealous of people who live here and get to eat at this place! there's a lot of ","useful":0,"cool":0},"lplfWrzIS8Z9PZGbASZ8iw":{"text":"Other than being a little pricey...\n\nThe oysters desire and crabcakes were both absolutely","useful":0,"cool":0},"3cip7hmWFxzREMxi2UIWbQ":{"text":"Totally amazing food! My friends and I had the char-grilled oysters, shrimp and grits, cra","useful":0,"cool":0},"lz1vZOApaG6U22-EEw5yFg":{"text":"My favorite place to eat in New Orleans, hands down. Absolutely phenomenal!! \n\nBest biscui","useful":0,"cool":0},"SPHSTCvQgqD5VuS6usjcvw":{"text":"We were looking for a place that had some good service right in the quarter asking with go","useful":0,"cool":0},"bSCCRGP2wmw-97KtLEl2OQ":{"text":"Stopped in for lunch, and it was pretty busy but was also Mardi Gras, so to be expected. H","useful":4,"cool":2},"P0PBA_OsegBibB3CaGZkuA":{"text":"Great for late night dining after a football game...though it is a bit touristy. Can be a ","useful":0,"cool":0},"6NHuHavPj4GixuJHVQ5fZQ":{"text":"Miss Kitty at the bar took good care of us! This is the type of hospitality that makes us ","useful":1,"cool":1},"c5fIHFskdMjq-IufxiNmQQ":{"text":"Do yourself a favor and get the oysters desire. Holy moly. So delicious I wanted to lick t","useful":1,"cool":1},"TPq8FW2fmivRTwOpJ1PCvg":{"text":"Be warned, there is no need to add horseradish to the cocktail sauce, it is hot enough wit","useful":2,"cool":0},"NXS5npXi9AzdraUFrNNthw":{"text":"Firs let me say, I was probably the most hungover I've ever been. That being said, the oys","useful":0,"cool":0},"v9GqylYzD7Xi6PZCJbXxeQ":{"text":"Not exactly the best experience with food while we were there. The service was also very s","useful":0,"cool":0},"HZ7jt5nVsTg0tZ5OuB5YZw":{"text":"Wanted some good lousiana oysters and boy did I get them. Went by myself so I sat at the o","useful":0,"cool":0},"g2nOi3EhW8kww3MOxja6_w":{"text":"The charrbroiled oysters tasted amazing. The staff was nice and offered many places to see","useful":0,"cool":0},"8vZ3rlyHi1aiwfW5oxgiwQ":{"text":"Our first experience was on an evening when we were tired from being out on the water and ","useful":0,"cool":0},"-IIo8ocs1yPmgH24RhEuJw":{"text":"Great, fantastic shrimp and grits. Just finished the remodel with more seats at the bar an","useful":0,"cool":0},"j3HhhPUXi-R3WvnDiZMyfw":{"text":"Loved the fresh and expertly shucked oysters here. We are from Maryland, we know oysters, ","useful":0,"cool":0},"-705XhGx3e0h3B0phv-PJA":{"text":"4 stars for their raw & huge oysters. Loved their bread pudding with whiskey sauce. \nHubby","useful":0,"cool":0},"DmIgVSktM4VU-QRYiEqSgg":{"text":"I always stop in to desire when I'm in N.O. The oysters are always good, shucker quick and","useful":0,"cool":0},"2ldgSpHNBWztp6daliuL6g":{"text":"We stopped in for some oyster because I hadn't had fifty dozen yet in two days. This place","useful":2,"cool":1},"CD5KA1ScpVINb7A2K-WwfQ":{"text":"I stumbled upon this restaurant by accident when I thought I was at Oceana but luckily eve","useful":6,"cool":4},"8t89QKHEjtg6icEw9jKaWA":{"text":"It's delicious! The gumbo is super flavorful! Love the red beans and rice! And tonight I h","useful":0,"cool":0},"y-zGODgwsSnR6dnmEOeDww":{"text":"Our bill was $150 for happy hour for four people. They oysters were shucked improperly. Th","useful":0,"cool":0},"10wv0lSHgBXfO8FJBuKHwA":{"text":"This place was recommended for the oysters by our Uber driver. We happened to be there for","useful":0,"cool":0},"D-SrUsiw9gtxUfLPBbP_UQ":{"text":"So crazy! My husband found more than one pearl ( nice sized) for me in his oysters last ti","useful":0,"cool":0},"UZgv2479dCYW0g0RxxLwZA":{"text":"Yummy food the staffs member are friendly definitely will go back again next time when I'm","useful":0,"cool":0},"lAkNg-LHVFYgNRkAmSCY2Q":{"text":"The bartenders are slow and forgetful. We bickered with a rude woman bartender in the even","useful":0,"cool":0},"UbmPLJC33LL7_otH3cUIMg":{"text":"Every time I go I have a new memorable experience. Try the boiled shrimp and horseradish c","useful":0,"cool":0},"G_BA7iRQAR2buQCYN6fnYQ":{"text":"even though its on burbon, the food and service are great.\n\ndon't believe the haters.","useful":0,"cool":0},"nqYVhpunOf_DymVVO2ukDw":{"text":"Found the best chargrilled oysters in NOLA at Desire!  (Yep, they are better than at Acme.","useful":0,"cool":0},"CNrcCZ7KUEVzIuoJnoVRQQ":{"text":"My first time trying oysters on the half shell and I'm sold. Also got the turtle soup...yu","useful":0,"cool":0},"gWDiFfML87nQlM7g6WVZ1Q":{"text":"First off I want to give a shout out to our waiter Tony who made the experience here so mu","useful":1,"cool":0},"5mpENOswiOXLQt_ZzEWDRQ":{"text":"Loved this place. The food was delicious. Best gumbo I've ever had. We sat at the bar and ","useful":0,"cool":1},"IU7cBwboEtI8fgieNza0ag":{"text":"Last year this place had my favorite turtle soup and this year we made it a point to make ","useful":0,"cool":0},"C_UPZhhePnpdX5b5PAs6DQ":{"text":"It was a busy Saturday night on Bourbon St. and we were hungry so we walked into Desire to","useful":0,"cool":0},"FR3KRJ0v6gUPXTtz9nxrig":{"text":"Great food especially the pecan waffle.  The service from Ruth was great.  Great experienc","useful":0,"cool":0},"sZk7XxT1ejlFMhMDELoW7w":{"text":"This is the best place to get the freshest oysters!  The Oyster Man, Contrell, is the best","useful":0,"cool":0},"3OzX4Nk0Syi_TvSSm_FJ2Q":{"text":"This was the only restaurant that we ate at on Bourbon Street and we must say that it was ","useful":0,"cool":0},"abl0tNvP7EXnnaFz4ftzsg":{"text":"The fried green tomato and shrimp remoulade po boy changed my life. I am 32 years old and ","useful":0,"cool":0},"PYk-cXry5SBjcwgTx-dXmw":{"text":"Great service, location and food. The BBQ Shrimp is lick yur plate delicious!","useful":0,"cool":0},"b8hr9QUD19jU1e1QQywSyg":{"text":"Whether it's breakfast, lunch or dinner they always bring it on. The Atchfalaya for breakf","useful":0,"cool":0},"GX3VMIB_bSK_dQ4RvMGRkw":{"text":"We had breakfast at Desire and it was absolutely fabulous! My husband and I shared the Ban","useful":0,"cool":0},"JWyavKSvk_LJdzP4CsaXgg":{"text":"SO good. Had Calamari for appetizer and it was the best I have ever had. You think, Calama","useful":1,"cool":1},"JKD-TKUMNlq7HQgsO9GMUQ":{"text":"Absolutely adorable! I loved the food and I loved our server Joann! Hugs for everyone!","useful":0,"cool":0},"8NGPtdwDfOUxXBZsKcFFew":{"text":"I was quite disappointed in the food and service. The wait staff was rude and incompetent.","useful":1,"cool":0},"Mc67P8BcLx6v-zmy7Eyu5w":{"text":"I was super excited about trying this place, but it was just ok for me! Fell short\nWe orde","useful":1,"cool":0},"Pkz_NtJo_VHHBuL1BWFz3w":{"text":"Good place.  Made it in before they closed so wasn't crowded.  BBQ oysters were good and t","useful":0,"cool":0},"32nekiqvoBrrDnMFb_98RA":{"text":"Food is incredible, oysters are some of the best I've had in the city. \n\nService could hav","useful":0,"cool":0},"rUTCXpnO0jXZAqUZw11oPg":{"text":"Luckily this place was one of the few open and accepting walk-ins on Christmas Day. The wa","useful":0,"cool":0},"B7yckg3Vb5LiCgc2OQp9vw":{"text":"Food: 3 stars\nService: 2 stars\n\nFood at Deanies (e.g. fresh and fried oysters, catfish, an","useful":0,"cool":0},"K13imF0pseKeboMze27vEA":{"text":"Best oysters in NOLA by far.  I have been to New Orleans many times and have tried differe","useful":0,"cool":1},"47-NAO1C71ljU0_KYvA71g":{"text":"It was ok at best.  Service spotty. Good was alright but there are so many other places in","useful":0,"cool":0},"ZGvdhIv7enmcA_3_CX1Atg":{"text":"Went for Breakfast on our last day in New Orleans. We had so many good meals it is hard to","useful":0,"cool":0},"magnNck6RceZvOroJwGhmQ":{"text":"We had two meals here, a lunch and a breakfast. Very good food and impeccable service at f","useful":0,"cool":0},"tdjCi_NRf8p_hFXroPm-Ww":{"text":"We ordered oysters, calimari, and a pulled pork po-boy, and it was all awesome. It was rig","useful":0,"cool":0},"DuKOHNbPhAU_kIXGcbgFvA":{"text":"Like many, we came here for happy hour. $1 oysters between 3-6 and a few drink specials. I","useful":1,"cool":0},"BEROx1ad6BuYXCgrdtMB_A":{"text":"We had the alligator bites which were good, but I likely wouldn't order them again so I co","useful":0,"cool":0},"4ZrrIb6GZCDDHEde-aJqvg":{"text":"Strong drinks, good food, and a view of Bourbon Street hey this is indeed a New Orleans ex","useful":0,"cool":0},"GSWzAVO0449F5FkM7atd8w":{"text":"Reliable good. We make a point of coming here every time we're in Nola. The half shell oys","useful":0,"cool":0},"SD10RRnf9yDwHWxFJAPT2A":{"text":"We had a cockroach in the dish, and waiter do not give us the extra lemon pieces even when","useful":0,"cool":0},"aiPGk8uWqptmJg7tWCqLEg":{"text":"Nice warm bread and butter is served to you right when you sit down. We sat right by the w","useful":0,"cool":0},"X_pGPTtmSbNqNLH5AD0hYQ":{"text":"Fresh Oysters - 3/5. Echoing a few of the reviews: the oysters here are delicious, but I a","useful":0,"cool":0},"plhVTzfcVwnlX_hatc6UCQ":{"text":"The food is great, no doubt about that.  I had their desire special omelette for breakfast","useful":0,"cool":0},"WYwcuw70uPF9m66vLXaCww":{"text":"We hit this place right after we arrived in NOLA. We weren't expecting much since it was r","useful":0,"cool":0},"tyFx1OdjLm4ATIfMbbLcoA":{"text":"Yelp...ugggh..reviews let me down in the city of NOLA again! My first trip was a food fail","useful":0,"cool":0},"f6SrhuiMubN-4ugaB8N91g":{"text":"First time in New Orleans. This is the perfect place to visit. Great selection of seafood.","useful":0,"cool":0},"TcV1qvOu5nQUFID_FwS5tA":{"text":"Stopped in for a quick lunch and had the turtle soup and gf had a salad.  Never had turtle","useful":0,"cool":0},"0Og4H3MyNtiD7iytfPU0yw":{"text":"well, I had oysters that were good, but like all seafood in the french quarter it is expen","useful":0,"cool":0},"NA7hj964CspeATHdleVTYw":{"text":"Had Saturday dinner here and loved it.  I had a baked shrimp dish that had just the right ","useful":0,"cool":0},"I0Hv7rL9Lq9kT_POdemL_Q":{"text":"Awesome oyster bar on Bourbon St. the only reason I don't give it 5 stars was it was prett","useful":1,"cool":0},"Rht1Nt13dma2nL9NAgvj8g":{"text":"My first impression of this place was of another cook, for another restaurant wheeling liv","useful":3,"cool":2},"qKgk5DezxgQd9AfLM08ABw":{"text":"Good food, but the wait staff sucks. Don't be fooled, there's butter and bread plates, but","useful":1,"cool":0},"HuoW7fbx11XplnS53GlOGA":{"text":"Delicious trio. Perfect amount of gumbo,  jumbalaya, beans and rice.  Good service. Kids l","useful":0,"cool":0},"_iJAkhsAf7P35OCpApzBjA":{"text":"By far the best meal we had in NOLA! Shrimp and grits were to die for...loaded with shrimp","useful":1,"cool":1},"b5E5eVPIYVdHntsAVPzAhg":{"text":"Great place to eat and people watch! Service was quick and atmosphere is fun. Lots of hist","useful":0,"cool":0},"HhulJd_lNXHKAOJjjB6lmA":{"text":"I specifically went here because the coolinary website says they served the options daily.","useful":1,"cool":0},"3mplnkI9HEEG4tnMh19VSQ":{"text":"Amazing food,amazing service.  If you want to try New Orleans Southern type of food, this ","useful":0,"cool":0},"vLsh734fGmNP-Pb3eyjY9g":{"text":"During our NOLA trip we had raw oysters at Acme, Felix's, Desire Oyster Bar and Mr. Ed's S","useful":0,"cool":0},"HfQi1wMimsLrvTiN7E7Uqw":{"text":"Nice clean place inside and the grilled oysters are very good.  They are grilled/broiled w","useful":0,"cool":0},"o751ysjHTTdYIP1-GbLuZw":{"text":"oysters are fantastic a must 5 stars. the dinners are a bit pricey but good. go for the oy","useful":0,"cool":0},"nVvAThcA2m1TN7Rqp00jwQ":{"text":"We were walking down Bourbon St and decided to check out the menu at Desire.   A couple of","useful":0,"cool":0},"6o8ZwQuMfNV3OTHVpVNDyA":{"text":"I visited Desire twice during my week long stay in NOLA because I was staying in a hotel v","useful":0,"cool":0},"04bUXpE5i9wZ-XJx2VYsqQ":{"text":"We ate here the first night that we were in town and wish we had gone back at least once m","useful":0,"cool":0},"cfsez6tvYx58TxA6AZigDg":{"text":"Over rated. Don't waste your time. The hostess was awful, the waitress barely showed up, t","useful":0,"cool":0},"wBOw_wbALIBrMIEvASd-rA":{"text":"If you're starving and on bourbon street this is a nice little place to duck into.  We wer","useful":0,"cool":0},"hlhGiqtAXmwvSZ7NuB5esg":{"text":"Woot woot! I found a groupon for this place! $20 for a dozen oysters and two drinks!   Thi","useful":1,"cool":0},"Q-bAa8HEG3Tbb0dYswb5Nw":{"text":"Came here instead of Acme. They have fresh oyster with reasonable price. Great service to ","useful":0,"cool":0},"7TjzpjyhCS5avxCUv708Kw":{"text":"Shrimp and grits: grits were good, but shrimp was rubbery and didn't taste fresh even thou","useful":0,"cool":0},"jISSDKylHscEHF_W0WZHFA":{"text":"Best part about this meal was the bread. Went downhill from there. After about an hour wai","useful":0,"cool":0},"3eDLAwNCZITdapUNMmjHZg":{"text":"This is based on breakfast as it's one of the few places that were open early. The service","useful":0,"cool":0},"lBkVGdjaXYeTHUPZpu7o7Q":{"text":"For a place off of burbon Street.... not bad!  not bad at all!  Bartender was not present ","useful":1,"cool":0},"2pnBtc5wMqTvVhg7D4ebfg":{"text":"We ordered the TRIO - Red beans and rice, gumbo, and jambalaya.  It was all delicious.  Wi","useful":0,"cool":0},"Um850jm7jpwLaK-eGeFYbw":{"text":"The atmosphere is great, with its lively dining room, friendly staff, coffered ceilings an","useful":0,"cool":0},"91tdUZ2hFJHFcf8M_m5kNw":{"text":"We sat at the oyster bar and had a great time. We shared the Char Grilled Oysters and they","useful":0,"cool":0},"76qgxeCceMscM_j6BnYOSw":{"text":"I went to Desire Oyster Bar yesterday in New Orleans. The reviews is what got me there... ","useful":0,"cool":0},"7SJ0EYppHE-4GRiHL_UCag":{"text":"I love raw oysters.\nThey were fresh and creamy here.\nBut the grilled oysters are what's go","useful":1,"cool":0},"2VZhj7po79uWaylHtaVbsw":{"text":"My family was visiting New Orleans on a trip recently.  We just weren't sure where we shou","useful":0,"cool":0},"hMF7_mIbhkfV2CiyPO7Sjg":{"text":"Great spot! Ended up on Bourbon for one night, and wanted to grab some food before our hau","useful":0,"cool":0},"F_W-0VERPGOFUXaeO9pnCg":{"text":"I just could not stay away from this place. I had the grilled Oyster every day for three d","useful":0,"cool":0},"07Be-nKN27lfRaNm-ngyKw":{"text":"The food was incredibly sub par. We got (1) artichoke dip and chips and the chips were sta","useful":0,"cool":0},"uFL6mMcedeqh5IYu7DfIbQ":{"text":"Service was a bit spotty, meaning we got dessert first and then after we finished the most","useful":0,"cool":0},"4mpSLLoGHEPFp_z1WIsYxg":{"text":"Loved the sariachi fried oysters and crab cakes! Super cute restaurant. They also have a r","useful":0,"cool":0},"46QguX8p-UE_BhlGRQruIw":{"text":"Party of one. I took a seat at the bar. Like probably most people, there was too huge a li","useful":0,"cool":0},"mEz75dm20bjOH__JEh4pZQ":{"text":"This restaurant was amazing! It's a casual spot conveniently located on Bourbon Street. Th","useful":0,"cool":0},"X41JHoxza41SL9jbMtzAoA":{"text":"Went there for fresh oysters and really liked the food.  A dozen on the half shell is $14 ","useful":0,"cool":0},"z0HpoIdZfSGBHlk-sNLuQA":{"text":"fried alligator is amazing here, i just cant get enough of it. the raw oysters are huge, a","useful":3,"cool":1},"4nfOg6xU3Bn3FoJhUBkugQ":{"text":"Chargrilled oysters = amazing!! Had the fried shrimp poboy as well - added a little hot sa","useful":0,"cool":0},"nGYhcVjUTMJVddEadfZ-5Q":{"text":"Best charbroiled oysters! They are generous with the butter/garlic/parm. Sauce they grill ","useful":0,"cool":0},"HeZGqZAV2U1ffybMN8v9Pg":{"text":"This is a really cool place!  My family and I were in the French Quarter and wanted oyster","useful":0,"cool":0},"ApIM2NkQ-0CBcikSIaBADg":{"text":"My husband and I absolutely  adored this place to the point where we ate there 4 times in ","useful":0,"cool":0},"0qtBQQz-dAcFzhW8GqFm2Q":{"text":"A big fan of their happy hour. I stopped by twice during my stay and enjoyed their plump, ","useful":0,"cool":0},"qX_8vXDlEJut9-CBJuNXSw":{"text":"I really really like this place. Sit at the oyster bar, get some good cold beers and house","useful":0,"cool":0},"ytidPEGysYUfNJ-9KLPBpg":{"text":"A great place for some seafood. Our waitress was super nice and friendly, and we never had","useful":0,"cool":0},"nrz0uwDkCxn-CTvkyWGmFA":{"text":"We stopped in for a couple of Bloody Mary's to go walking in the French Quarter. \n\nBar ser","useful":1,"cool":0},"fRolkSL3RCli8Wyq6P7SDw":{"text":"Fantastic grilled  oysters and cocktails,  definitely repeating! ! Place was clean, people","useful":0,"cool":0},"2EZ1WD8XQ0wRrCbitKoKvw":{"text":"Best fresh oysters I've had!  Shrimp and grits was tasty I just wish there was more grits!","useful":1,"cool":0},"XFd0pT-WTRG0_MLy6mY7sQ":{"text":"If you've had better oysters .... you're lying to yourself and the world ! Holy god...the ","useful":0,"cool":0},"7H3eFZqP-pSBGRtVFsJ51Q":{"text":"Plain and simple I love oysters and will try and get them wherever I can. \n\nI tried them h","useful":0,"cool":0},"MVG8R0u0N3Ylw7US-N9pxg":{"text":"It's just okay nothing special about this place, we were wanting to eat oysters and it was","useful":0,"cool":0},"kdl79MckTQG9uoegv3j6Nw":{"text":"Great food!!!! Great staff!!! Great drinks!!!!\n\nThis restaurant is more elegant than your ","useful":1,"cool":0},"2fEDwZw_UjE6GL01CgrqrA":{"text":"Amazing oysters, crab mac and jambalaya. Our table of 6 received excellent service from Qu","useful":0,"cool":0},"wkXbbVs2iIsU4QqbNtccjg":{"text":"We were looking for a place with an oyster bar and the ones we originally wanted to go to ","useful":3,"cool":1},"bbWOvLz6cxzUoBSllm8DZQ":{"text":"We just stopped here for drinks.  The Ramos GIn Fizz was spectacular.  We got that early i","useful":0,"cool":0},"D5xJ0iUSvzUHEOuwjZY5hA":{"text":"The staff was amazing and the food was so good that we came back a second time...would hig","useful":0,"cool":0},"9LX02lBLgEirNxBgP0pfVw":{"text":"Wow!! This place was amazing! My husband and I sat at the oyster bar and got to watch Kent","useful":0,"cool":0},"sYdHBf1KEfQvdRMf01fTCg":{"text":"This was the last place we ate before leaving town to end our vacation, and we don't regre","useful":0,"cool":0},"rpMcIuCfuDiG9FxOaWJfLA":{"text":"Mediocre and overpriced. Wasn't greeted when we walked in. I ordered the shrimp and grits.","useful":0,"cool":0},"RGL_FXAbwAlYgHuzrNGDiQ":{"text":"DIsappointed. We stopped in on a Thursday evening after enjoying the French Quarter. We go","useful":0,"cool":0},"_zsq4DScgKBXGqrYvX0zbg":{"text":"LOVE this place! Wayyyy better than Drago's. \n\nThe charbroiled oysters are fresh and perfe","useful":1,"cool":1},"UOjXbVVW5q-SP0AorCKJag":{"text":"5 stars, hands down, from start to finish.\n\nThe ambiance was awesome, historic and very in","useful":5,"cool":0},"U9uGcH7EGsRy5OTRpBAoGQ":{"text":"Newer decor than Royal House and Chartres House.  BBQ shrimp platter was not as tasty as I","useful":0,"cool":0},"xCopxxOZkP_OruXYv3QiNQ":{"text":"Desire is a great place for a nice meal for a couple. At the same time, it's not as fancy ","useful":0,"cool":0},"xwULh5I84Nb_7ecc5l4X9Q":{"text":"Came on a slow Saturday and sat at the bar. Ordered a dozen raw oysters and it took about ","useful":0,"cool":0},"vCABkClQ6GdgT3bKxNZ-ag":{"text":"Not saying I'm a foodie,  but I have eaten out a few meals in my 50+ years, so trust me wh","useful":0,"cool":0},"muo4ZVyDH1ampP2Neiz5DA":{"text":"Amazing service from Ruthie! Very helpful, kind, and endearing. Food was beautiful as well","useful":0,"cool":0},"CTvXQVpr3nJpgFtuPOBspg":{"text":"One of my favorite places to go for chargrilled oysters. Better to get to before late nigh","useful":0,"cool":0},"KgkvRlYOOjHgaJNSpuvR0w":{"text":"The most underrated Bourbon St restaurant in my humble opinion. Excellent food, very good ","useful":0,"cool":0},"CR_X0RkQHRa0hW91ckPsig":{"text":"Great oysters in a beautiful but packed dining room, and a little more expensive than othe","useful":0,"cool":0},"fyQNl20SL2o-dnbOtFDNDg":{"text":"Turtle soup. BBQ prawns. Stiff Old Fashioned. Perfection.","useful":0,"cool":0},"6AYZHDAyy0WyJs478fxStw":{"text":"This was a nice surprise. My friend and I were wandering around the french quarter, lookin","useful":0,"cool":0},"LF4-acYbyS4MBfmvZj5eMg":{"text":"The oysters were amazing as usual, very mild.  Shrimp Creole was good even though the toma","useful":0,"cool":0},"5L34n9dsHPU8bkr3Hh9ZoA":{"text":"Charbroiled oysters were damn delicious but I really came here for the crispy alligator bi","useful":0,"cool":0},"iBgs5f7OPYjF9UxXY3z4rQ":{"text":"Terrible service and mediocre food. The hostess, our waitress, Laura, and the manager were","useful":0,"cool":0},"A5E-yykan8pwbCVzk7Ktgw":{"text":"Came here on a Tuesday evening. It was probably about a third full. The servers were nice ","useful":1,"cool":0},"5D3Vf39mcxknbt6IXsdRuA":{"text":"A little short on ambiance and a bit loud. Otherwise, this place is great. Oysters on the ","useful":0,"cool":0},"Emj_Ad51AxmTBk3iTGU1Og":{"text":"Food was delicious. Had the fried pickles and the the crab cakes as my entree. The po boys","useful":0,"cool":0},"kMQQkMgv71Dkz-hHfoKMFw":{"text":"So one would not usually go to an oyster bar for breakfast but while walking by I noticed ","useful":0,"cool":0},"K8OD9kD9qQ-SgYncxmBZTA":{"text":"We came here twice on our stay in NOLA. Food was very good and there was a lot to choose f","useful":0,"cool":0},"6g-qkV8yhNO3e2jhI021KQ":{"text":"We ordered the Creole Trio and a 1/2 oyster 1/2 shrimp po boy to split. The trio had red b","useful":0,"cool":0},"CB0mR4mYDC6mdAALwiP_4A":{"text":"Great stuff!  Sat at bar.  Great service and fun atmosphere and delicious oysters!","useful":0,"cool":0},"1Il5JZXDp299tDBarPeLvA":{"text":"Have to give a five for no complaints & memories :)\nThe only drawback is the wait. Hubby h","useful":1,"cool":0},"vsKLbNTPMH9FOGA3WRHkwA":{"text":"Ok, I've got to do my best here to raise the overall rating of Desire.  Why?  Because I lo","useful":1,"cool":0},"Zo7zp3FW7TDBd2BXlX1few":{"text":"Extremely Rude host/manager(heavy set Italian) Compared to other sonesta hotel restaurants","useful":0,"cool":0},"J53z26Dm2BqnTIrRYSwc_w":{"text":"I had oysters and jambalaya it was delicious, but we got are appetizer and entrees at the ","useful":0,"cool":0},"OSlrDCOw8XqC-1ShvtxfWg":{"text":"Desire is part of the Royal Sonesta and serves as their breakfast spot in the mornings. Cl","useful":0,"cool":0},"_-4gsmm4d9RLn75MgrQtjQ":{"text":"Best oysters and service!!!!!! Thank you for a beautiful experience ! Robert was perfect!!","useful":0,"cool":0},"NCWWtU8weGrtV-xuR4arzg":{"text":"Food was edible. Great location. That's where the ok ends and the horrible begins. The wai","useful":0,"cool":0},"IePCGmgjNLbyTEs4B0R9EA":{"text":"$1 oysters and half price draft beer for happy hour? Best treat after a long day. You can ","useful":0,"cool":0},"XBFEX-R7DE3D5zJwjGYoSA":{"text":"This is a charming Southern-style restaurant attached to the Royal Sonesta hotel. Went for","useful":0,"cool":0},"nXHNsvjIenN6h8GJsyOt_A":{"text":"Amazing service, great location and excellent food! I cannot say enough good things about ","useful":0,"cool":0},"VW8xYYU8az0OsjXA69Uvzw":{"text":"Came here specifically for the $1 oyster happy hour. It was packed with people (assuming f","useful":7,"cool":3},"kNJjWI8d4Z2ChIJxxJJ1Xg":{"text":"I highly recommend the crawfish ettufet(sp). We walked in based on the reviews and rating ","useful":0,"cool":0},"X_fHAb4LeHTN4NpUVw229A":{"text":"We vacayed in NOLA for a friend's 40th and stayed at the Royal Sonesta, where this little ","useful":0,"cool":0},"Zqg1Rc9TK7eSe28PTL6WsQ":{"text":"3.5 stars for food, extra .5 for Kiki making it a more fun time than it might have been.\n\n","useful":0,"cool":0},"ukp2swqvMPSWHACvu-Ix7w":{"text":"We're local, and had a lovely day in the quarter with one mission: standing oyster bar.  W","useful":1,"cool":0},"vlL0tvg9yX-7VS5c5_GagA":{"text":"I have been here a few times & love everything about Desire Oyster Bar!  The bartenders & ","useful":0,"cool":0},"guc3KFm2RemjeDCb8pE2hQ":{"text":"Thank you to our bartender Marcus for making our decision to go to Desire Oyster Bar on ou","useful":0,"cool":0},"AWSxH0OIWy8y1FnHPddMHw":{"text":"Keep dreaming about this place! Was told to stop in and try the shrimp and grits. Yeah, I ","useful":0,"cool":0},"5lC6u0ZzXNb4DcymJdpOTg":{"text":"We had a great dinner experience here on a Saturday night. It was really busy but we only ","useful":0,"cool":0},"UzCJ7Z-y24P3oIqIbJr6LA":{"text":"The food was very good and the service was great because most places the service is very s","useful":0,"cool":0},"qJbU7G2jvaXZCZ4nkevrVQ":{"text":"Friendly and fast staff. The food was okay. I tried their seafood gumbo but was disappoint","useful":0,"cool":0},"IWSpU-Qm3mvEcE3Yo275rg":{"text":"After trying Oysters in a few other spots, after having them at Desire, I can say they had","useful":0,"cool":0},"u3xNXtHbOuvX0woEZrdbyw":{"text":"This place was attached to our hotel so it made for a great breakfast option. I can't spea","useful":5,"cool":4},"Y2hx0lnlb5dapUGtvWCicQ":{"text":"These are the best chargrilled oysters we had in NOLA!!  We had them at ACME which were gr","useful":2,"cool":0},"_iiK6PT242D_SgP7Ar_l7A":{"text":"Walk in sit at the bar or back where they are shucking oysters and have yourself a drink r","useful":0,"cool":0},"BSalKuBxhDN0n-YellRbyg":{"text":"If you love oysters, you will love this place.  We visited it for lunch both days we were ","useful":0,"cool":0},"pE482zHMu9ysPiR-tjKv7A":{"text":"We stopped here for lunch.  The jambalaya was some of the best we ate in NO.  The gumbo an","useful":0,"cool":0},"hQH9wgcRsvSTasTHWrmiaw":{"text":"Great food and open late at night! Something besides pizza and decently priced. I had the ","useful":0,"cool":0},"0LNLc9ZWw3IRFLIlK-WBAA":{"text":"I was looking for something on the \"lighter\" side so I decided to order the spinach salad.","useful":0,"cool":0},"OYA15CfGCL6CVHUA5C1LTw":{"text":"Though Desire kept popping up in my Yelp search as a great oyster place, supposedly it is ","useful":2,"cool":1},"98VPx2Ecvp9tOdjdgtX33Q":{"text":"Look this place is on point i would give it 6 out of 5 but service is a bit slow. However ","useful":0,"cool":0},"Nyq89y58R93zoJVEiWgj_g":{"text":"Good spot when we had a hankering for something southern, but didn't feel like traveling t","useful":0,"cool":1},"R3xb4uwofXX4FAkO2Mq9Sg":{"text":"I've eaten here twice in less than 24 hours! Granted it's located in the hotel I'm staying","useful":0,"cool":0},"a3s3u850P64945_huw4rIg":{"text":"I think this is the best place in the quarter for oysters. I have had other things here an","useful":0,"cool":0},"ZwZ6non28bJRt403W2QU0g":{"text":"Desire is OK if your looking for a touristy (i.e. overpriced) place to eat. Had the red be","useful":0,"cool":1},"zXshBukV4MAPlamZypHLQg":{"text":"Had da platter was great and my wife had da trio and it was great as well. We shall return","useful":0,"cool":0},"gPJmBwHLPCso0EdmonYT9Q":{"text":"Way up there!  Though the Po' Boy wasn't anything to write home about.  This place is clas","useful":0,"cool":0},"q8le78TFQNTv92Zd3jeo3w":{"text":"Service was slow to start with - being busy isn't a good excuse.  You are on Bourbon Stree","useful":1,"cool":1},"BZtSfSvjbskDw4ywPHGGug":{"text":"our first meal in New Orleans and it did not disappoint!\n\nwe had just gotten settled at ou","useful":0,"cool":0},"Sc5xqzrEBt2tL8PZaagfsQ":{"text":"Yummy and reasonable price. Breakfast portion Jumbalaya and Shrimps & Grits can be shared!","useful":0,"cool":0},"hAvvzZKnGatCSY-8j2xWkA":{"text":"Sat at the raw bar Frankie and kentrall are awesome. Make the trip so worth it. I'd recomm","useful":0,"cool":0},"sLT_fW9XkKytvsCvBhbV8Q":{"text":"I only ordered the oysters desire, the cajun/creole  sampler and the seafood salad. All we","useful":0,"cool":0},"CUsItosevYEZMSsZ8L-SPg":{"text":"Probably a bit overpriced, since it's part of the royal sonesta hotel, which is pretty fan","useful":0,"cool":0},"ZurWJYFSP9GynXbiWgX6Jw":{"text":"One of my favorite restaurants in NOLA! The chargrilled oysters are out of this world. Vis","useful":0,"cool":0},"JPjovLj4sGN1W6LORyP8BA":{"text":"Decent breakfast.  However it is pretty pricey.  A seafood omelet was $19.  Three people w","useful":1,"cool":0},"s-kvYThXdwqGJmeRpqb-iQ":{"text":"Food is AmAzING! \n\nI will always want to come here when in New Orleans. Food was so mouth ","useful":0,"cool":0},"wLI7GDY3wJoS64eQtawZHw":{"text":"Oysters tasted like tap water, shrimp was definitely defrosted before served and the textu","useful":0,"cool":0},"pFcnwG8R-szDkUqRb9s8HQ":{"text":"Looking for a place to eat, we wondered in here.  I got the turtle soup, which wasn't the ","useful":0,"cool":0},"TO7fG8nQcthcCutGqNxj-Q":{"text":"Great martinis; I would love to stay at the Royal Sonesta Hotel next time I'm in New Orlea","useful":0,"cool":0},"PFJo_nD--oJB3FL2n53TBw":{"text":"Had a quick late night bite.\nWe had the crab Mac & Cheese...good stuff. Also, we had the r","useful":0,"cool":0},"z7u85jIPayLDqyNeDO8V8g":{"text":"We went here because they had a good variety of food (we had some non seafood eaters in ou","useful":0,"cool":0},"_MrsZrrOQV8D_qADyiyXdg":{"text":"Ok so yeah this place is on nasty, dirty, smelly, Bourbon St, but oh well you only live on","useful":0,"cool":0},"N21l7rXR3PflyOe-7nV1ew":{"text":"The service was phenomenal and the food was great.  I had the peacemaker poboy; I was at p","useful":0,"cool":0},"AUK8yAr8tyby3zPBu6uhAw":{"text":"Oysters were AMAZING and for the dollar happy hours its a must come. We also had the fried","useful":0,"cool":0},"iXZWqfWvbwNPINsR-bs5fQ":{"text":"Oyster were much better than at Acme-Darnell was fast, friendly and courteous.  The Happy ","useful":0,"cool":0},"J8rBnyJN2Xmdkfaep0lTMQ":{"text":"WOW!  Nothing against Brandon, but my experience could not have been any more different.  ","useful":2,"cool":1},"xCm3xV42OSzYpJckQusH9A":{"text":"Holy mother of oysters, Desire is divine! My hubby and I were in New Orleans last weekend ","useful":0,"cool":0},"ydWp5sKP_CSG33CB6_73hg":{"text":"I wanted oyster so that's why we came here.  These oysters were not raised in the ocean, a","useful":2,"cool":1},"mupZIX-k71kG5QPsZbSRvA":{"text":"Such a great atmosphere \nThe staff was super attentive\nI had chicken and waffles it was so","useful":0,"cool":0},"QDnRz8rVJzhm0UgxDRSKsg":{"text":"We were searching for a restaurant we could get crawfish and raw oysters, during dinner, a","useful":0,"cool":0},"eBi638vVNxYwALSqf2ql9A":{"text":"The food is really good I do admit but our service was really lacking. It took upwards of ","useful":1,"cool":0},"Q2SbCAEkHcDUi4XX2Bml4Q":{"text":"Chargrilled oysters are delicious for a cold night.  The Oyster and Shrimp Po' Boy was goo","useful":0,"cool":0},"mje5XhrSA_J3ny7GZKyyYA":{"text":"Both outer options were great! Shrimp and grits were also a winner ;)\n\nThe gumbo was just ","useful":3,"cool":2},"gDLlpszvhiUY1361XlJQvw":{"text":"PHENOMENAL SERVICE!!! We even had a wonderful history lesson!!! Who knew we were dining in","useful":0,"cool":0},"7xQ1Txx-vtEkGzmEHbZoiQ":{"text":"Get the Oysters Desire & BBQ Oysters with a mint julep. Friendly staff & quick seating on ","useful":0,"cool":0},"eF0WwKmrIdjOKpFPJQhBlQ":{"text":"My boyfriend and I stopped by and tried the chargrilled oysters and the crab mac & cheese.","useful":0,"cool":0},"Gh_J2fHgQE2mkRcTDYug7w":{"text":"A million years ago (ok, like 10), I had the shrimp and grits here, and it was one of thos","useful":0,"cool":0},"QFjb_dEWh-iG8rR999F0lQ":{"text":"I guess I should have known better. This is not a traditional New Orleans restaurant - it'","useful":0,"cool":1},"0JQqft4JiKZYKwWc_xngtQ":{"text":"Crab cakes are good, jambalaya is meh, fries were cold. But, Kitty was awesome!  Got us fr","useful":0,"cool":0},"mkG5qnROZxuSGbpur6M87Q":{"text":"Soon as we arrived and headed to Bourbon street, I was hungry and looking for red beans & ","useful":0,"cool":0},"52XaDZxz-6GP2Kh-df0AtA":{"text":"Had dinner here last night after a long trip in the car. Picked this place as it was close","useful":0,"cool":0},"AgXTAtzWRgMLLiQaFNNTtg":{"text":"Keep the oysters coming!  Great spot to go. Every time it has been consistently good!  Sup","useful":0,"cool":0},"VKaoe_yuJE0ZWrVe6lt6mQ":{"text":"A favorite affordable restaurant on Bourbon st. You can't have a better location for dinne","useful":0,"cool":0},"K_5y0Qe-Qwg0-wgzjeqfwg":{"text":"I originally came here because there was too long of a wait at acme... but let me tell you","useful":0,"cool":0},"xLdU0UvlcePbQU2ReETjRg":{"text":"This restaurant is located in the heart of the French Quarter.  It is a comfortable, casua","useful":0,"cool":0},"eNQ-Lpl30xf8R_isG8VsSg":{"text":"We actually went to this place because we saw it in the coolinary menu that happens in the","useful":0,"cool":0},"K1vZWT8aYGulhxBUzgoyvA":{"text":"Not too bad... If you're on Bourbon Street and want some oysters, this is a great place to","useful":0,"cool":0},"EzfH6lrpBr-NIziEI-mCtw":{"text":"I would go there just for:\nTurtle Soup (my favorite meal this last trip)\nJoAnn the waitres","useful":0,"cool":0},"h4H-HDHQVuMb8F7AdRGnKA":{"text":"I originally had bookmarked this place because their soft shell crab po boys had caught my","useful":0,"cool":0},"cmXrn74RFD_f8e9flUAELQ":{"text":"The $1 oyster happy hour is fantastic! The oysters were great and the jambalaya was delici","useful":0,"cool":0},"AL47GOFUgPbIgTCHfEZBIQ":{"text":"Go here for the oysters. Grilled or raw, just Amazing! See Tyrone or Kentrell, they will h","useful":0,"cool":0},"Em8-Js03cBhu-aUi_VguLA":{"text":"Went there as part of a culinary tour. Came back the next day with some friends for lunch.","useful":1,"cool":0},"BxcDyfDdUF5KAswCC9Mipg":{"text":"Nice place, good food, GREAT service. We did some appetizers, cocktails, and oysters. Seri","useful":0,"cool":0},"o98uHHWw5jsi9KX43_P3eQ":{"text":"So it's the day of NYE and just about every restaurant in the French Quarter has a line of","useful":8,"cool":8},"Gezc-PhODgcCXm8LpTi3Sw":{"text":"This spot was recommended and we enjoyed it. We ordered oysters on the half, fried alligat","useful":0,"cool":0},"fjvC57_QFydq0B6SCpfXnA":{"text":"We ate here our first night in town...we enjoyed the appetizers, and the waitress KiKi was","useful":0,"cool":0},"QV9TNqyf-3U3WefZgW1u6A":{"text":"Almost 5 stars except for the very slow service. We initially sat at the bar where we were","useful":5,"cool":3},"zizEx3d7D7b9MXMtZE-sgg":{"text":"One of my go to spots in Nola. Never had a bad meal here and pretty sure I never will. The","useful":0,"cool":0},"ZmV9keGDeDCoFaYiy88OaA":{"text":"Went here by myself on a Tuesday night and sat at the drinks bar. \n\nOysters were good and ","useful":0,"cool":0},"bZ_jr6ks8O1-PIlGKHUirA":{"text":"Friendly staff and great food. Cant ask for more. We had 6 guys who ordered way too much f","useful":0,"cool":0},"cZXBTifCWYcwlKsA-28G2w":{"text":"As a bartender I love sitting at the bar. But sitting at this bar made me second guess fut","useful":0,"cool":0},"bPqpBJdqxPOtljnuQWggUA":{"text":"I adore this place. My husband and I stopped in for lunch; it was early afternoon, so not ","useful":0,"cool":0},"KR3mL-T2ciAhUlBRmINBFQ":{"text":"If you love oysters like we do, don't miss this place! Our favourite Ouster/Shrimp bar in ","useful":0,"cool":0},"YhKvPtls6yL4ASNay2GSTA":{"text":"A stupid experience.  Cold fries, cold and mushy fried oysters.  Char grilled oysters tast","useful":0,"cool":0},"429CDvBTFS7dM4TP9m8IRA":{"text":"I have had the chance to be in New Orleans for New Year's the past two years and have ende","useful":1,"cool":0},"QKlzyU5Nl_kzxhPd-jgYSQ":{"text":"Sorry...this was GROSS. The service gets a star, but the food...ugh. You have to be drunk/","useful":0,"cool":0},"Hl2ARV-MJcpinOjkiZUNsg":{"text":"Ate here 3 out of 5 days for lunch! So that has got to be saying something!\nThe shrimp bac","useful":0,"cool":0},"XACSOIDVsSM6HcNYiCoshg":{"text":"Stopped in to get an oyster fix. Sat at the bar and had Marcus as our waiter. He was so fr","useful":0,"cool":0},"hzC0ugyjJjVKrVDN1ZKXCA":{"text":"Stopped in for a late lunch avoiding the festival food at Sachmofest.  My wife and I had t","useful":3,"cool":2},"6UE5x4vAra-s5Nyw3KMR4A":{"text":"Came here on a weekday night and it was pretty busy.  We got the following:\n- Half a dozen","useful":3,"cool":0},"VEQxTgHi-eJvc54Aj99e6A":{"text":"This was our first meal off the plane and we were delighted. Service was stellar as were t","useful":0,"cool":0},"lgyVCQqwGdcwTIwnoPNP0w":{"text":"Came here for breakfast.  Had the creole omelette which had shrimp in it.  The shrimp were","useful":0,"cool":0},"7CI579BY1nHJ89gCT03org":{"text":"Top notch service here and above and beyond what other places would do. They didn't have b","useful":0,"cool":0},"sSo-4mq2YdWO6OeVmtqYuA":{"text":"Was really looking forward to eating at Desire on the night of 12/21/13 around 8pm  it had","useful":1,"cool":0},"kA8OPNI_Tmqqunne4Nv3CA":{"text":"This food was incredible. I ordered a cajun fettuchine with crawfish. The cajun spice and ","useful":0,"cool":0},"ziHYSMMrApnTPetpqxjomA":{"text":"Pretty good food, oysters were nice and juicy and the shrimp po'boy was filled with fried ","useful":1,"cool":1},"TUIWCEQfdU7Pwp6iD7GCmw":{"text":"It had been about nine years since my last visit to New Orleans, pre-Katrina and the oil s","useful":1,"cool":1},"fzkCYPGO40CtjHfnUhEwBA":{"text":"Now I don't eat oysters, but the family does and say's these are awesome! What I do eat is","useful":0,"cool":0},"SmsZuVmNh5qvRHol-Duing":{"text":"My husband and I ate here last night. It was phenomenal! The drinks were good the food was","useful":0,"cool":0},"1bZliHsbXXi_yISn-qihJg":{"text":"The food was great. I really don't have any complaints about that. My husband and I ordere","useful":0,"cool":0},"lcuReH_AWWgkYZGaRIhpCA":{"text":"Chargrilled oysters were absolutely on point! Service was bleh but who cares. Great locati","useful":0,"cool":0},"xz-VtxDGX_s26K53eKTGWA":{"text":"Ohhhh hellll no! Do NOT waste your money on this place. Look, I can eat and love to eat at","useful":2,"cool":0},"3COGaVoC6JUn8MnZUqw8rQ":{"text":"Delicious food! Nothing impressive. I would recommend the oysters and fried alligator ther","useful":0,"cool":0},"bPBPHIOgs1gGgWNgkQmTzg":{"text":"This was the restaurant attached to our hotel, so I ate here twice. The first time I order","useful":0,"cool":0},"h4o_7Kh7J0RexiIvQzfyoA":{"text":"Desire is a restaurant that I desire never to go to again. The po boy shrimp tasted like r","useful":0,"cool":0},"RCRX-g3w6IrXgrZYp7NvdQ":{"text":"Great food and a very cute ambiance- my family has been going here for years every time we","useful":0,"cool":0},"21KtMggeCyysGiZmvDKexQ":{"text":"Wow! This was the only place that stayed open when we had LATE night oysters cravings(2am)","useful":0,"cool":0},"553MH5CpRcn8vRqb1xPrhg":{"text":"Just had 2 dishes from the menu - char grilled oysters and Louisiana crab cakes and we wer","useful":0,"cool":0},"X6oquXwvEpIdMgYvmryfVg":{"text":"Service was slow but they had her bussing tables as well. Didn't help that Kappa Kappa Dou","useful":0,"cool":0},"Bu7OCRmzpzqkeOKBOcjK7A":{"text":"I was in NOLA with friends for a few days of fun. We had to get some fresh oysters and Des","useful":0,"cool":0},"DpfmmAzIr4bTxuMOYaEF2w":{"text":"Great oyster bar! I came here almost everyday during and after happy hour for their raw an","useful":0,"cool":0},"NdK79UB5lvNwQPEPy8RNgQ":{"text":"This place had kind of a weird diner-ish decor, but the food was excellent and the kitchen","useful":0,"cool":0},"evleYsJiDGgUYNwxzX488g":{"text":"Bourbon Street was under construction when we went, so it probably lost some of the charm ","useful":0,"cool":0},"8XkL7PZnuHKb3J4yBjeGzQ":{"text":"DELICIOUS. \n\nWe stepped in just a few minutes before the summer downpour. Our dishes were ","useful":2,"cool":1},"F4z_EoSIOhStnbIQb2SlTQ":{"text":"My wife and I had the red beans and rice and the jambalaya pasta. Both outstanding. I pers","useful":1,"cool":0},"-rPhF5VDunT7cmwdOZdzGA":{"text":"This was our first try with raw oysters and after trying them here we were hooked!  They t","useful":0,"cool":0},"35no1n0hCDYVKmIyyNLRHw":{"text":"Delicious!!!\nGreat atmosphere, good location!!\nEnjoy it!\nThe oysters are soooo big!!!!!yum","useful":1,"cool":2},"YYN9krsCxPJFTY_uo2wSpQ":{"text":"Excellent place...I would highly recommend the turtle soup, it is delicious.  The raw oyst","useful":0,"cool":0},"5xR-5grx4tjyst_45glYGg":{"text":"Can't beat happy hour deal for 1 dollar per grilled oyster. Flavor was on point too. Servi","useful":1,"cool":0},"9INA5O2jmhwsTIRP65Qx6A":{"text":"The crawfish bisque was delicious. And I bought thee bottles of their house brand hot sauc","useful":0,"cool":0},"8NueZ0SmqY-sZs-tj_hnBA":{"text":"2/22/14\nWe were a party of six and I was in charge of picking our lunch destination.  I se","useful":0,"cool":0},"QcyWJGM4xd4HD4KaR3oumA":{"text":"I tried the turtle soup and really enjoyed the rich flavor and sherry finish of this soup.","useful":1,"cool":0},"gurFqrQgspDt_WGXqiFFjQ":{"text":"Ate here during Saints away game.  9 Saints cheerleaders (not sure if they were dance, che","useful":0,"cool":0},"SvuhvSUN8P44ExWKHzGSmw":{"text":"Great location for upscale cajun food. I had the crawfish etuflet and it was just what I w","useful":1,"cool":0},"RRNQS-T2_uVgYnCR8KSosA":{"text":"Great place!  Tried the Oysters Desire-Great !  Jambalaya - Really Good. Spicy Shrimp- not","useful":0,"cool":0},"RM8Let6N9ewQvG2Nj4STbw":{"text":"The food here was good but the people watching was better! This is a great place to post u","useful":0,"cool":0},"4q7dXEi1OrdXNeLdLCP_qw":{"text":"We gave this place a try after walking through the Garden District. This was close to our ","useful":0,"cool":0},"CnkqRPaaWlKu0rESS1jY5Q":{"text":"Amazing food and service! We started with the spinach and artichoke dip with fried bow tie","useful":0,"cool":0},"urCTuLlvo1VXsC4VVxvd4g":{"text":"Ate here 2 days in a row! A must tries are the Crab Mac and Cheese and Shrimp and Grits! A","useful":0,"cool":1},"7QL9r5iE5D0__aM_Xnycfg":{"text":"Got Creole pasta, the Creole trio, and chargrilled oysters. Oysters were too salty. The re","useful":0,"cool":0},"Rbp3b5Mqvw--fvKdZczBQg":{"text":"Great Fried Shrimp, it was crispy and not greasy at all. I really loved the Jambalaya here","useful":0,"cool":0},"sP11jYkEN-yolM2rcgi6yQ":{"text":"First place I went after my plane landed in 'Nola. The gumbo and some oysters were dank. A","useful":0,"cool":1},"BCAPxHc_g0UG1cB13GbyaQ":{"text":"In town for Essence, I had the Jambalaya, its a lot of food, keep digging, so much buried ","useful":0,"cool":0},"xqz4VCyLcFVJxJBReeG3wg":{"text":"Service was lacking. Cold reception compared to every other place we have been in NOLA. Oy","useful":0,"cool":0},"75sHkKQntnLpApainXTWWw":{"text":"If you are in or plan to visit NOLA this should be your first stop for Oysters... THE BEST","useful":0,"cool":0},"fjlQzMxKwaXOAhO_53bmEQ":{"text":"While on business travel in Gulfport, MS I was able to make my way to NOLA for dinner with","useful":0,"cool":0},"itCevE7F5eEHDpa2KP4qsw":{"text":"BOOM...goes the dynamite!! Acme House watch out!! This place is definitely comparable if o","useful":1,"cool":1},"l28OqJ4ypW3MCnF3-_1rZQ":{"text":"Went here 2 nights in a row because it was getting late both nights and our first night wa","useful":0,"cool":0},"VZupl4cz19nAANuk_qIung":{"text":"Charbroiled oysters were amazing! Service was friendly & helpful. Highly recommend this ap","useful":0,"cool":0},"x91VpX2WfFIvPXSV5YGNMQ":{"text":"I came here for breakfast only because I was stuck in a downpour and I needed to eat anywa","useful":0,"cool":0},"IIlhX4Jnxl_nkS7-aDuL7A":{"text":"Visited this restaurant twice on our trip.  First, because we were jet-lagged and just nee","useful":0,"cool":0},"TA5ehL7uYuvohh8BWs-8gg":{"text":"I missed dinner and went here to grab something quick and light. But, I end up ordering ja","useful":1,"cool":0},"DwtNfC2q5AX95GYHvYhUoQ":{"text":"Desire is a crowded restaurant, but I suggest that you wait in the line because there food","useful":1,"cool":0},"7GGWebl30yQhxsX7cS6y6A":{"text":"A classic New Orleans feels from the floor to the ceiling. \n\nLook up and you'll notice the","useful":0,"cool":0},"geXH7W7mPq9C0z-XGgyYBw":{"text":"This is the place for chargrilled oysters, best I have had here - better than Acme and Fel","useful":0,"cool":0},"uPO8KYYJ4ada_KAWHTNF2A":{"text":"They closed, changed everything including the menu, new staff, worse menu..  Just bad.  Th","useful":0,"cool":0},"aDG4nWabTOdM_3yCy-rFfg":{"text":"Oyster Desire is the bomb but they keep inching up the prices. I love the Oysters Desire. ","useful":0,"cool":1},"Y5g_gyMbAMzN76mdhka87g":{"text":"4 of us ventured here as we didn't make reservations on a Saturday night and everything el","useful":0,"cool":0},"XZfCSKhn0IMYIwNRQvmJxQ":{"text":"It is entirely possible that Desire Oyster Bar rates a four star rating.  However, my meal","useful":0,"cool":0},"cpzcyHDQEvAFVfoytYKHEQ":{"text":"Five of us arrived in New Orleans from Seattle.  This was our first vacation meal!  Our wa","useful":0,"cool":0},"k5BZ42CIKs8oZtoKWz3fVg":{"text":"NOM NOM NOM NOM\n\nFood here is sooooooooo fricking good! While visiting New Orleans, I ate ","useful":0,"cool":0},"AuWq2NWkyvnRdnygcxQ2Kw":{"text":"This is my repeat visit in NoLa. They have the BEST Shrimp and Grits. I also purchase thei","useful":0,"cool":0},"pXeDx1-haV37W-Tl7NO96A":{"text":"It was REALLY tasty. I had the Fried Green Tomatoes and I tried the Turtle Soup, but it wa","useful":0,"cool":0},"U-8aBga5eUmzYxcJT-JCMw":{"text":"Absolutely loved this restaurant! We were there for lunch with our teenage kids. The best ","useful":0,"cool":0},"JQlC_e10YqbH4--s1CEdsQ":{"text":"We got the shrimp and grits and there BBQ shrimp. I had to ask for an extra side of grits ","useful":0,"cool":0},"1YquEZ4NUaJ9Zwagw2W8CQ":{"text":"Came in for oysters and this place sure delivered!  Classy, great service and delicious/fr","useful":0,"cool":0},"nqPddLgNzV39V2rD_DzuYA":{"text":"Grilled oysters people!! And crab Mac-n-cheese was delicious too. We stopped in for a drin","useful":0,"cool":0},"NJlKxPY_X0S0-dey4C_DtQ":{"text":"i was on tour and we had one day off the entire tour. luckily, our day off was in new orle","useful":0,"cool":0},"D1M9ev-Ri3dwX5BjSKoRsg":{"text":"Not bad for late night food im not sure if it was the drink or not but i thought it was pr","useful":0,"cool":0},"4bnXGU9bCMaqFOTu5Of_8A":{"text":"Always a must for any trip to NOLA. Love the crawfish etouffee, tasty little loaves of Fre","useful":0,"cool":0},"sxxZhBVExOqcZNpPnedEYQ":{"text":"We went to Desire for lunch because of the convenient location, but unfortunately the food","useful":0,"cool":0},"r8JwFYs4qSoKusWZpA8CvQ":{"text":"My husband and I stopped in on July 4th around 6pm... we REALLY wanted Oysters and this pl","useful":0,"cool":0},"mgnU5gWZ5_7PjWjCiiJjMg":{"text":"I've never had a restaurant tell me I can't bring my outside drink inside. I have had bars","useful":0,"cool":0},"npueM1-zbF45wCU-O9BdYw":{"text":"Pretty nice place in NOLA where you can grab some good eat and some delicious drinks.  The","useful":0,"cool":0},"rrQpIVOoUjFyVlQZF6m64w":{"text":"The oysters are the best thing here, and the price is great. Waiter was friendly and helpf","useful":0,"cool":0},"8lciBoxr0xqikUAFlOYROw":{"text":"Can't believe a legit restaurant is on bourbon st!  After walking around bars it was nice ","useful":0,"cool":0},"l1PeIDCZklEoHAUvm6QrUg":{"text":"This was the last breakfast we had in New Orleans and it was just what we were looking for","useful":0,"cool":0},"YWNmsmWNpdlIhRvaXvx0BQ":{"text":"We knew upon arriving and seeing the lineup that this place was obviously well known. Our ","useful":0,"cool":0},"Y36Dkb7oV4TTOGcSmHmcTQ":{"text":"First night in Nola and Desire did not disappoint! Had the oysters in half shell and they ","useful":0,"cool":0},"hhyz7WBgTNGK-TXaqppB0Q":{"text":"I have never been to New Orleans before, and to be honest it's kind of an intense place to","useful":3,"cool":1},"ljDerphVADPBd3Mp8ff2lg":{"text":"On a recent trip to New Orleans, one of my first stops was at Desire Oyster Bar on Bourbon","useful":0,"cool":0},"Bpt92m2RBHSW0aw7wIMehw":{"text":"The oysters were the biggest I've ever had  but they were pretty expensive at $8 for a hal","useful":0,"cool":0},"YhsIhD15e0ZbHp7wPyFGAg":{"text":"Whether it's breakfast, lunch or dinner Desire Oyster Bar is the place to go! The seafood ","useful":0,"cool":0},"qVghb9DNJu62CLT5jeV7Aw":{"text":"If Gulf oysters are your thing then this is your place.  The baked oysters in sauce were v","useful":0,"cool":0},"_Ld3_iS6PUKHYpcm7pPo-g":{"text":"Definitely a place to stop by while in the French Quarter. They are apart of the Sonesta H","useful":0,"cool":0},"fEpYP1EKB6RY6oWjX6urZQ":{"text":"Food is great and the atmosphere is melo. I enjoy not feeling rushed. I would come here ag","useful":0,"cool":0},"6Cx6qHY0_KHMqwFaqXamPA":{"text":"This place is really good for happy hour oyster 1$ per oyster . You can't find that deal a","useful":0,"cool":0},"4U8z5WaU2EQ41wTJPXp0YQ":{"text":"Great location and ambiance, yes. Food however is just OK. Certainly not 4 stars. Of cours","useful":0,"cool":0},"hwRPJ7c3j917AybtMh8HZg":{"text":"My hubby and I stopped in for a quick lunch and a few beers and were pleasantly surprised.","useful":1,"cool":0},"oPVuQWzNIfzXIPiQGGiP-g":{"text":"Friendly service, excellent food and people-watching that can't be beat! \nI got the shrimp","useful":0,"cool":0},"L4PCr9A5fXUlq1yRAGH6xg":{"text":"*the three stars are for an average of both my visits*\nI came to Desire in 2015 and loved ","useful":0,"cool":0},"ZLwyrpn5edLDoHSL0jnFtA":{"text":"Great service.  Wish they would serve the oysters on ice.","useful":0,"cool":0},"x8Y62MyMPQdu-pPIRXFkrw":{"text":"We ate here because of the four-star Yelp rating and left with our hunger eased but withou","useful":1,"cool":2},"7bbKZYZTQ_LSA_3N0Rs7vg":{"text":"I came for dinner based on a recommendation and wasn't disappointed. The shrimp and grits ","useful":0,"cool":0},"ajJHGhLr9kX6mWowiGR9xQ":{"text":"We came here on our first night in Orleans.  The service and food was really good. I didn'","useful":0,"cool":0},"YMAGiYwE9P9yK1_CY83pcA":{"text":"Great time, great food. Huge oysters. I got the BBQ shrimp. As a non-native it was not wha","useful":0,"cool":0},"Np7hRonPXG4GoCqThZhOHQ":{"text":"Desire is very good. After tasting the seafood gumbo in other restaurants,  my husband fee","useful":0,"cool":0},"6Mxfd_46a6XjQTVIRIpdiw":{"text":"Delicious oysters, drinks, and all others. Service was fast, even though this place was cr","useful":0,"cool":0},"pp0F87yIuOU_QcSKaQriow":{"text":"This place was amazing!  The pasta we ordered was cooked perfectly and seafood was top not","useful":0,"cool":0},"2P-E7OyGGW62Tvt_qxMdnw":{"text":"If I were Gordon Ramsey I would've had this place closed IMMEDIATELY! \n\nOrdered the Chicke","useful":0,"cool":0},"G9kVON2QPuS1fdR3ydVHoA":{"text":"This place will always be a top spot in New Orleans; they consistently serve great food. Y","useful":0,"cool":1},"53NXaUccGawB4KzzHQBMKA":{"text":"We walked in here on a whim after doing a quick Yelp search.  Sat at the bar and watches t","useful":1,"cool":0},"tB7OSWhwW859-Vuo7UUyMA":{"text":"Came here because line for acme wad way too lonh. The seating here was very odd. It was a ","useful":0,"cool":0},"FeQibXAVqBsnErArB2b9sw":{"text":"Walked in here as it looked nice. Sit by the window at the high top if you can. The peel a","useful":0,"cool":0},"_6Cpe2tw7xKxTkCnJoz9kg":{"text":"Great hospitality sitting at the bar. Had the crawfish etouffee and it was amazing. My bud","useful":0,"cool":0},"Q-ZbMWlxl0o2-YfsKRcQiQ":{"text":"Had a fantastic lunch with drinks. I had the Creole Trio and my wife had a Portabello\nPo' ","useful":0,"cool":0},"2O3jfwqzd5Mtg9_4L-FYoQ":{"text":"Only had the char grilled oysters and although good, doesn't have enough char taste as it'","useful":0,"cool":0},"3FzMe3dXPrTTiKmkCFmuow":{"text":"I've now made 11 different trips to NOLA, and despite my vow to add a new restaurant or tw","useful":1,"cool":1},"z0jFrn1_YGapsYe_6GFCig":{"text":"Soft shell crab poorboy for lunch - tasty and huge.  Waffle cut fries not bad, either.  Pa","useful":0,"cool":0},"snuYafIJTFWfQWoT_YCcxQ":{"text":"Great food, huge portions and a really good location.  We aren't local, but we will come a","useful":0,"cool":0},"WdRyvCA3fRspWUaGW6vxgA":{"text":"I hate to do this but we had the very unfortunate experience of being seated by their oyst","useful":2,"cool":0},"dXH6xSwjRlDs5Ka9MNiIbQ":{"text":"Food is trash. Plenty simple. Other things don't matter when this is the case.\nEating is s","useful":0,"cool":0},"6OU5xtLJVEj3XN0QFqwpTg":{"text":"Desire on Bourbon St ... I know what you're thinking, gentlemen's club?  Nope, just a fine","useful":0,"cool":0},"x-zpS5XwgSrzt5ZqukPIhg":{"text":"I was here for dinner with my wife; we were visiting from Boca Raton FL.  We ordered the c","useful":0,"cool":0},"Sq34q6Exgow7mnu5OzS81w":{"text":"Awesome. The oysters were recommended, but went for the jambalaya and étouffée which were ","useful":0,"cool":0},"89X3aGUrYVuYciuaC07tFg":{"text":"We just accidentally found this place and I have never had better catfish than I had over ","useful":0,"cool":0},"66RHuU1M7QDVKEUdfkwDDA":{"text":"This place is one of the \"must\".   The atmosphere is great, the staff is very friendly, an","useful":0,"cool":0},"ZnF3ywU0NZZ92K4uqe0-lA":{"text":"This place is the bee's knees!\n\nSome friends and I strolled in here while walking around t","useful":0,"cool":0},"mpa87nRTGG3aNatoyjaTIA":{"text":"Oysters and crawfish were really fresh...staff was friendly and service was excellent. Wou","useful":0,"cool":0},"ugP1NKq7PTTd7xAtvR11vQ":{"text":"so much left to be desired...\n\nas a restaurant with \"Oyster Bar\" in its name one would exp","useful":0,"cool":0},"uwCNmyXfENneZ7sHrVsq7Q":{"text":"Long wait to get seated (we were a large table of 11!), but the wait was well worth it. Fo","useful":0,"cool":0},"1-PWipjpCf0zaqNAxU8jyQ":{"text":"Delicious crab mac-n-cheese, I suggest you try and grab a table that is at the window so w","useful":1,"cool":1},"b4wXVWgT35KSU4yXeFQvwg":{"text":"We walked around for a while but then ended up going to Desire because we could get seated","useful":0,"cool":0},"6ymLpeodkPd3ZY3o2YAfcQ":{"text":"Good Jambalaya. Good to have a restaurant on Bourbon St with an old-school Nawlins atmosph","useful":0,"cool":0},"NJMg-32sFa78r5a5blobBw":{"text":"The oysters were just as I expected for a well known restaurant. The jambalaya was superb ","useful":0,"cool":0},"8rT0zGhG1FcTDG3zlCJ1tQ":{"text":"Meh.  Went here on the last day of my trip to New Orleans.  My buddy really wanted Jambala","useful":0,"cool":0},"HayM4I2EznlFmLG4zVeTpw":{"text":"We came for breakfast, and stayed for lunch...they close in between but didnt throw us out","useful":0,"cool":0},"wU6whaOw0PUa9fzUM5AlrQ":{"text":"Me & the hubby love their Cajun shrimp Alfredo. Huge, well cleaned shrimp in a perfectly s","useful":0,"cool":0},"uWaT65GCUpE54Sni1wIAxA":{"text":"What we needed on our last morning in NOLA at the Royal Sonesta was a good breakfast to ho","useful":0,"cool":0},"wnaRGaNFi9_voLrNUj50_w":{"text":"This is one of my favorite casual restaurants in New Orleans and certainly my favorite on ","useful":0,"cool":0},"gUp60AwyqvWlsHRFErQADg":{"text":"This was the first place we ate at on our little weekend trip to New Orleans. This place w","useful":0,"cool":1},"etQdSzSLvyXLpsSamaLFzQ":{"text":"Although this oyster bar/restaurant has the name \"desire\" in it, the oysters here left muc","useful":2,"cool":2},"jKjD2-Tfv8KXGL_a18VtYQ":{"text":"Beware your Bill.....\nWe stayed at Royal sonesta for Easter. The hotel was wonderful and D","useful":0,"cool":0},"hhF2dGMmZuy7rQ7VwsLZ2w":{"text":"This was probably one of my favorite meals in New Orleans. There was a tiny wait but worth","useful":3,"cool":3},"vU_pYq3Xm0mmQY0hbmPMxA":{"text":"This place is fantastic. \n\nThe family and I ended up here accidentally while out looking f","useful":0,"cool":0},"Dp-21UPzbMwlGGiQCrXH5Q":{"text":"While visiting New Orleans for the Essence Festival, I had the pleasure of tasting delicio","useful":8,"cool":5},"iGoa5oGPLz4e0bQHqm4eFQ":{"text":"Great food. I really enjoyed the chargrilled oysters. It's a really delicious dish. The cr","useful":0,"cool":0},"o5u3ER1RJv9N2gwG4H2cxw":{"text":"Just stopped in for a small bite. We had the barbecued oysters & cocktails. They were exce","useful":0,"cool":0},"6NKXX0v9Tde7IUzwA9K9Pg":{"text":"The etouffe was amazing! More ambiance than ACME, but still pretty stiff pricing. We didn'","useful":0,"cool":0},"1kUTCQrgaXvefZqiJJHLYQ":{"text":"Not too impressed with the shrimp and grits or the jambalaya pasta. We had high expectatio","useful":0,"cool":0},"LcVny7NsjNB6SF5Ia11EIw":{"text":"Long wait in line but well worth it. The host was very nice and friendly. He sat us quickl","useful":0,"cool":0},"dPjmUxG3QfWXcbQ_3INOSw":{"text":"First time there. It was good but nothing special. We ordered 2 dozen of oysters. First do","useful":0,"cool":0},"decwCy1gESig5z8p46Ffzg":{"text":"We ate here on a Saturday night, right before the St. Joseph's parade started. We were sea","useful":2,"cool":0},"J_-juOwh2HlY6I6OY_wbXw":{"text":"I am reviewing the Red Beans and Rice with Andouille Sausage. This is by far the very very","useful":1,"cool":1},"KHcnm1Ly7KRs0t1Vx6nK_A":{"text":"Good food, great atmosphere and pleasant service makes this s restaurant definitely worth ","useful":0,"cool":0},"-LU_kmyefndfvRHOzwRgCA":{"text":"Premier soir sur Bourbon Street, nous avons joué la facilité en allant au restaurant de l'","useful":0,"cool":0},"qK-h83yH9IOiitTUdGGCNA":{"text":"Dropped in for a late lunch after a walking tour in the Quarter. Started with a half dozen","useful":0,"cool":0},"TujJ_6TBdIruWzhgXJYtvA":{"text":"Pretty awesome place for oysters. I came here and was like why did we spend money at acme?","useful":0,"cool":0},"B2dWWjHrIlYvr3wtfPA80Q":{"text":"Amazing oysters in several different offerings. The service and staff were second to none.","useful":0,"cool":0},"dJWnuLIKZvpS4f9h_WtLFg":{"text":"Usually is one of my go to places when I am in the Big Easy. This experience was not the n","useful":0,"cool":0},"SlHPDAvBB48UTGAb1rYMfg":{"text":"Insanely good service, but as a vegetarian, I have to take away a star for my lack of opti","useful":0,"cool":0},"v_X2jMdPX3eTl_5B2jZ5sw":{"text":"Only because of the bartender! The oyster artichoke soup was good but the oyster poboy was","useful":0,"cool":0},"N_XZqFOPuJNdwBZ3rrlGpg":{"text":"Stumbled on this joint.\nOrdered 6 fresh oysters, 6 charbroiled oysters, shrimp and grits, ","useful":2,"cool":0},"2YjfAFPmWKBKX8oOiRCfcg":{"text":"This restaurant was recommended for us to try.  We were not disappointed. We had the charg","useful":0,"cool":0},"FwzmXKoDaImOYUzR3526EQ":{"text":"My hunny wanted one last oyster run before we continued on past New Orleans. We had seen t","useful":1,"cool":1},"q9HszRNuNi0yNFABxhw8Gw":{"text":"Let me just say, the food is OFF THE HOOK! I was in 'NAWLINS for a week and I must've dine","useful":1,"cool":0},"T_BNweZMBOfeu9sxqI6i_w":{"text":"The charred oysters were totally 5 star but the service was pretty what ever. While we did","useful":1,"cool":1},"Fn2pF4ntSl0nGOKm05RzJg":{"text":"The oysters were out of this world. Tyrone (at the oyster bar) made our visit even more en","useful":0,"cool":0},"4mf9a1PRQqyc5KChuSmLrA":{"text":"Just about everything I ordered was delicious.  The char grilled oysters are delicious, th","useful":0,"cool":0},"nAmkUrEETeTmo1yoYfslrA":{"text":"We will find our way back to  this oyster bar when we are in Nola next time for sure. The ","useful":0,"cool":0},"CoXD6TZNwC5OsL-3ug2GtA":{"text":"Good breakfast.  11/24/18.   Chicken waffles yummy!!!   Fresh juice decent.  Oatmeal grano","useful":0,"cool":0},"PVbiAI2CjQ7FzqrFZQkM2Q":{"text":"I'm a fan of those places on bourbon street that can maintain quality, sanity and a little","useful":0,"cool":0},"EDwW06b9RJEsn9yNlzBn-A":{"text":"A sentimental favorite of ours - there's nothing more heavenly than bellying up to the oys","useful":0,"cool":0},"LzO3zDcIuPd349QSYbXK-w":{"text":"Right next to our hotel...the service was great. Food arrived on time and hot.  Food was v","useful":0,"cool":0},"NYgkKPoaVBviz4Io-G6c4w":{"text":"Yummy food, friendly waiter, didn't wait at all to get our dinner which is a bonus ! Love ","useful":1,"cool":0},"GAYq8Bl1z-Vopvw7o2PJWQ":{"text":"Oysters were not served as cold as they should have been and way too large.  They looked a","useful":0,"cool":0},"jtHAwFsdwd_vCGk8s1CJCw":{"text":"Visited here spontaneously while looking for something good on the ever so busy Bourbon st","useful":1,"cool":0},"NAkqaHcpr2eIKeLnz5HFcw":{"text":"Loved it! The BBQ shrimp were good and the corn Tasso chowder was amazing.  The drinks wer","useful":0,"cool":0},"2wSpf5WkCJmRLorB__YEDA":{"text":"We tried this place out because I wanted another Acme Oyster House. And it was definitely ","useful":0,"cool":0},"gvwOInsYp1a0LES2M__Qhg":{"text":"Got seated then ignored for over 10 minutes except for a glass of water.\n\nDecided we shoul","useful":1,"cool":1},"9GgVRjtJThFeLWvXbJKX9Q":{"text":"So so good. We were there during Mardi Gras on the Sunday of. Party of 11 and they say is ","useful":0,"cool":0},"NNKsY4P3A59LMAAF2RbZSA":{"text":"While staying at the Royal Sonesta me and the BF decided to have breakfast here.\n\nI ordere","useful":4,"cool":1},"5wgw7vPX3skKgtjlXmvgzw":{"text":"This restaurant reminded me of a diner -in a good way- when I walked in.  Bright lighting,","useful":0,"cool":0},"FAXRMfVVYAVf78v1jE-7XA":{"text":"amazing!!!!!! eat at the bar frankie jean and chef williams are fantastic !!!! hands down ","useful":0,"cool":0},"bZmUTDZ0vGNOVYROTzi9Ig":{"text":"Ugh.  Too salty for everything- broiled oysters, calamari, turtle soup.... Sad- wanted mor","useful":0,"cool":0},"C9PE26U-i2B1PwKtrZ6NRg":{"text":"Desires - French Quarter\nOysters are fresh and delicious...for $8 you get 1/2 dozen and th","useful":0,"cool":0},"vG5YoxOPmymcjqDpQu4daA":{"text":"Killer oysters in the French Quarter!  Super plump & flavorful.\nLong time shucker, Rodney,","useful":0,"cool":0},"Y0cOHiwzGITR4oudwr4bEQ":{"text":"The only thing I \" Desired \" after going to The Desire Oyster Bar was, that I \" Desired \" ","useful":1,"cool":1},"qFl9FxaS3-Jj22HtT9Pysg":{"text":"We snacked on bread and got started with Oysters Desire. They had great flavor from the pa","useful":0,"cool":1},"nFRty3TeosFUdHOHIH6wgQ":{"text":"We were in New Orleans for a long weekend and did Bourbon street every night. We decided t","useful":0,"cool":0},"J6xdf4toIM9S7zk_NrVzow":{"text":"My boyfriend and I stopped in at Desire yesterday and decided to have a seat at the bar. W","useful":0,"cool":0},"ByztIElXuakOlRAiqL7LqA":{"text":"The hostess, wait staff, and manager were all awesome.  Super friendly, welcoming, helpful","useful":0,"cool":0},"mtWZ_H0UxMl4LV0J3bmvAQ":{"text":"My goodness the food was terrific!  This was our first eating experience in NOLA. Boy, the","useful":0,"cool":0},"SkXvB3XSmD6OK1CMCWWl_w":{"text":"Our waitress was on in a kind. Geri you are heaven sent! We can't thank you enough for the","useful":1,"cool":0},"21srcQTjAaHJj5N_AJDIOA":{"text":"This was my email to manager\n\nHad the most amazing experience at your hotel and restaurant","useful":1,"cool":0},"29HtV_fiGeHuxxmjuBDjaA":{"text":"We walked in during happy hour and were treated to huge, delicious, $1 oysters. The best o","useful":0,"cool":0},"cMA1Wr7v8G-r8XPYRz2cGw":{"text":"Friendly Place! \nThe Desire Oysters were very good along witht the crabcakes. This was the","useful":0,"cool":0},"D7LhDdtQdP5wg-lyK3lDpw":{"text":"This is one of highly recommended oyster bar in French Quarter. Desire is located in Royal","useful":1,"cool":1},"iiMBiqVf4nACy9AQs0Gs7Q":{"text":"Excellent traditional New Orleans faire. Staff is fun and helpful.  We had a good meal on ","useful":0,"cool":0},"vNP6-8Dv6eq-JZgzeMRUoQ":{"text":"I only had the oysters raw. They were bland and not what I was expecting. I had to use a k","useful":0,"cool":0},"-hDg2PP8waeBXhaCDYk-zg":{"text":"The best thing on the menu is the chargrilled oysters... everything else is so boring... t","useful":0,"cool":0},"iuDDnY6Udy8qP7qwO75pBg":{"text":"This was the last meal I had in NOLA and I'm hitting myself on the head for not trying Des","useful":0,"cool":0},"BcV__yYWP5YcgzccWQ76ug":{"text":"My young son and I came here for a relaxing dinner.  The staff was attentive and the food ","useful":0,"cool":0},"gNXQocsa_AxRabo6kdEu9A":{"text":"This review is long over due! I must say that since I've gone to New Orleans, all I have t","useful":0,"cool":0},"ovW11LU96gSSEaWvgFXxMg":{"text":"Yes, it was my very first meal in New Orleans and what a trip.\n\nThe counter had one more s","useful":2,"cool":1},"KG1DqVcLYvZ7v65I7pcxQA":{"text":"Not sure where the good reviews are coming from. Had a horrible lunch: hair in one oyster ","useful":0,"cool":0},"LAvo9FccDOPoX1nLLtMv8A":{"text":"The location is GREAT, right off of Bourbon St. They get their Oysters from the same 'dist","useful":2,"cool":1},"WfrkbycNsLT863Q-5dw3Cw":{"text":"My favorite Po boy in Nola. Half Oyster and Half Shrimp. The Peacemaker. It's amazing. Don","useful":1,"cool":1},"VNDuXA7HlwHxhpRBTaZLmA":{"text":"We stayed at the Royal Sonesta the week after Christmas (hotel the restaurant is located w","useful":0,"cool":0},"QjrZSmkJp25QHC7bZfzaCQ":{"text":"We stayed at the Royal Sonesta for 5 days and ate at least one meal per day here.  The oys","useful":0,"cool":0},"zRC3mI3SgHyExSHiRfPW9g":{"text":"This restaurant is located inside the Royal Sonesta Hotel in the French Quarter, Bourbon S","useful":1,"cool":1},"YpfpbcC1dY8uRImdFW16LQ":{"text":"Had some of the largest oysters I've ever seen. Some really good BBQ ones too were given t","useful":0,"cool":0},"ja-GsUenvHVk-powlo7xrg":{"text":"My family and I were excited to eat at Desire. We just left with such disappointment. The ","useful":0,"cool":0},"83Ln2TBJv4YYpbaF7pC6zw":{"text":"Ate a pre thanksgiving dinner po boy here. Shrimp and oyster. Good size. Good value. Devou","useful":1,"cool":2},"cv3ats9dW3vYcDnfj581cQ":{"text":"line outside was ridiculous, and crowded inside. however the redeeming quality of this pla","useful":0,"cool":0},"5c4T1itGGMsLMt0Ir1-48g":{"text":"My most memorable meal in NO was at this restaurant.  We ate here twice since this is one ","useful":0,"cool":1},"RSS5sNr-UgF1xsGcCI84pQ":{"text":"The gumbo was excellent.  Service was awesome and will be back to sit and eat at the resta","useful":0,"cool":0},"tzKReXRj95_h8Y58BunEXg":{"text":"Very nice and upscale with great location under the Royal Sonesta Hotel. Desire Oyster Bar","useful":2,"cool":2},"exPkIkSItQk89xM4w3v6yA":{"text":"The food was amazing, first time trying turtle soup, really good. The bread pudding was aw","useful":0,"cool":0},"NnEL8rCFxt9mzmcbq7ANVA":{"text":"Great deal for $1 oysters, only shaved one star off since one of oysters was under broiled","useful":0,"cool":0},"GdCih4u_WpOnuC_gAaAfTg":{"text":"This place was recommended for their happy hour. We had both the chargrilled oysters and t","useful":0,"cool":0},"jLBxzUmWj45AHrwj0zZV7w":{"text":"Best Oysters on the planet earth!!! I recently took my fiancé on a trip to New Orleans for","useful":1,"cool":1},"TyUB90CJP4FNpNQ-kiX4Sg":{"text":"The food was great! I went for breakfast and recommend the jambalaya skillet amd shrimp n ","useful":0,"cool":0},"d_pI32z7eNCYkvqURdAdvg":{"text":"The best cold shrimp. Juicy. Fresh. Big. Oysters gotta have. Oysters deserie are outstandi","useful":0,"cool":0},"I_Bw10y1QPZa_qixvFYoIg":{"text":"We had never been to the French Quarter before and found it noisy, and dirty.  Desire was ","useful":0,"cool":0},"0cEoVxaCYNYEsxPuG3qy_g":{"text":"A great place to go. Line is not too long. Definitely try the fried chicken and waffle. Al","useful":0,"cool":0},"K4S6n1aS2n7kGpS-_kY5pw":{"text":"oysters: good+ - mostly small though, which pissed me off cause i saw lots of big ones at ","useful":0,"cool":0},"OamjsLgJsLXmhQ9EWVdO7g":{"text":"Came here late night during Mardi Gras! Heard about the turtle soup and had to try. It rea","useful":2,"cool":0},"QMlzKkQzjup_rnrjrsq2jQ":{"text":"Get. The. Grilled. Oysters. Get whatever you want on the menu, it's all pretty good. But D","useful":0,"cool":0},"dJD74RnHOsehhL2q9TpNiw":{"text":"We loved the Char grilled oysters so much, that we had to come back for seconds and thinki","useful":0,"cool":0},"ONvN_EWJhgBuZwBj5m3GXw":{"text":"Ruthie was amazing!!! Best waitress with a beautiful smile and a true love for her job.  S","useful":0,"cool":0},"EI6t66XQ6vE-9umaYqknSg":{"text":"Too much of tourist trap.\nWe knew upon arriving and seeing the lineup that this place was ","useful":0,"cool":0},"QMatVklE9KKKnqqM-zWymQ":{"text":"In my last visit, they have happy hour special --- $1 for ONE OYSTER! I went there for thi","useful":0,"cool":0},"qM4HAHrZCEHatFx5NNNGSA":{"text":"Best Bread Pudding in New Orleans! Incredible service by KiKi, and the oysters were delici","useful":0,"cool":0},"aZ4gXTB1oQP89iSpM_70IA":{"text":"This is always a mandatory stop when in NOLA. Sit at the oyster bar with Kentrell while he","useful":1,"cool":0},"on_0eMzCQ0-FPTSCjxih6A":{"text":"Absolutely delicious. Shrimp and grits! So juicy delicious. My first experience eating fri","useful":0,"cool":0},"8Dy_OcDotHPSsKaXlkP7uA":{"text":"There's a cooked oysters dished that totally rawked here.  The staff is fun and upbeat.  C","useful":0,"cool":0},"Sd5g2GrKzAkSBQc8YQehDg":{"text":"Great food , Tricia was great ! The shrimp and grits was amazing and delicious! Don't miss","useful":0,"cool":0},"kFtE_zZFlRwpbth82lYwAA":{"text":"Charbroiled oysters and NOLA beer was the business!!.We enjoyed this on three different oc","useful":0,"cool":0},"jfE_YqYcEpZd7MawFaKdGw":{"text":"The food is delicious. But how good is the best food without any service?! Our waitress Je","useful":0,"cool":0},"_U9pnppewBqJInvPyi4qbg":{"text":"OMG! I can't even remember if I have reviewed this place before. I can not recommend the c","useful":0,"cool":0},"O-zgMdug8veVdCxK4UH3Cw":{"text":"My sister and I like to make Desire our last stop before heading back home, as you can see","useful":3,"cool":2},"PO0pF7M0tBem_rAZaeMKsA":{"text":"Desire Oyster Bar is one of my fave spots on Bourbon Street for shucked oysters and appeti","useful":18,"cool":21},"HXDjgu5om_z0sbkUo8ZmOw":{"text":"Excellent seafood, cajun style, at awesome prices in an old school diner setting right on ","useful":0,"cool":0},"Bl-3JPgsysNp6b4dCyBadg":{"text":"Two words: Crawfish Etouffee \n\nWe stayed at the Royal Sonesta and had a $50 voucher so we ","useful":0,"cool":0},"MAZCnbYAwMgamrDn3pN_lw":{"text":"Chargrilled oysters were the best!!! I can still feel the taste. Very nice hosts, big port","useful":0,"cool":0},"qD1mjsVlBtCgaSPEw-9FMg":{"text":"Came here once 4 years ago and couldn't get the delicious food off of my mind. The followi","useful":3,"cool":1},"PtMeH4egn93Fo4_xi1TwAQ":{"text":"Came in on a Saturday evening and had ordered some food at the bar to take back to our hot","useful":0,"cool":0},"vjFjd5cVNjdvJs8fXlzAiQ":{"text":"Get the SHRIMP AND GRITS and chargrilled oysters!  This was my favorite dish the whole tim","useful":0,"cool":0},"cYtJDk-vScTFlfhuFsW42g":{"text":"Loved the sariachi fried oysters and crab cakes! Super cute restaurant. They also have a r","useful":0,"cool":0},"84p2dWu539JWlUrPu5jnWQ":{"text":"Came here for happy hour and the service was great. Geri, our server, was very friendly an","useful":0,"cool":0},"ZfV-ofnbhRRJbkMrC12oNw":{"text":"Soooooo delicious!! Went here based on yelp reviews and was so glad we did! food was so ta","useful":0,"cool":0},"w8AfSz2BOzoaCmXdvEmmLw":{"text":"Over rated\nThe food was okay, the service was mediocre, the beer was warm, maybe it was ju","useful":0,"cool":0},"6mB6eQg01NwyVq_PFxylLA":{"text":"We came here for dinner with a few friends and the food was good. I ordered half a pound o","useful":1,"cool":1},"2nG6PxGbGomZHUdqkJ3b-w":{"text":"Good etoufee, gumbo above average. Service was sometimes excellent, sometimes not. I liked","useful":0,"cool":0},"lpVsMbG07CEqA5xRTK1Llg":{"text":"Soooo. Let's talk about that oyster happy hour. 1.00 chargrilled or raw. Uh, yeah. It's a ","useful":0,"cool":0},"2sdcgtafCoqADtqya7p-Sw":{"text":"First time in New Orleans. Stumbled across this place. Looked pretty good and prices were ","useful":0,"cool":0},"qU67mKlq-ssxcCN99GiTQw":{"text":"Best shrimp and grits in the French Quarter. I had so enjoyed the shrimp and grits at Emer","useful":1,"cool":1},"-GFB1xh_xpS19VunMIMM6A":{"text":"Love love love! This place was so niche! The service was GREAT! The food was GREAT! The on","useful":0,"cool":0},"G90Mqahw_XC29E8PNgEQOA":{"text":"Went for breakfast and was not disappointed. Great cup of coffee, delicious fresh OJ, and ","useful":0,"cool":0},"jZZh3p5zTmy-I_O9ZdsiCw":{"text":"Back to the scene of my own worst party foul. The place I ate my first meal in NOLA in 200","useful":0,"cool":0},"F8Qm6V1qPIcRsnvG2qMdYA":{"text":"We had a great time and experience here.  Great service.  Drinks were strong and good.  We","useful":0,"cool":0},"xflUAndDBErox3EWNnWk4A":{"text":"Unbelievable! Best bread pudding I've ever had in my life! Amazing catfish and best oyster","useful":0,"cool":0},"cPTvlHMcKrgGJ6HehIjC_g":{"text":"We came in looking for oysters. We got oysters: 12 apiece. They were pure oyster perfectio","useful":0,"cool":0},"UiSkJt6a8pTeFcOrj2VDrQ":{"text":"Shrimp and Grits - grits rich and tasty. shrimp ok but not best I've had. \n\n Chargrilled O","useful":0,"cool":0},"3mYbS-DrQGuYVz9XMZSVhg":{"text":"We came here for dinner before going to listen to some jazz at the Playhouse, located acro","useful":0,"cool":0},"Qqem3WX38Jkbg9eOnYq_2A":{"text":"I was searching for another place to get a good roast beef po boy because Johnny Po-Boys c","useful":2,"cool":2},"_HSh3KVjmOfIPfBVyLoEZA":{"text":"Happy hour oysters are a must. So good and wonderful price. The jambalaya and the fried gr","useful":0,"cool":0},"Vdg1XTuzj-yMggCI6IAIhA":{"text":"We had the BBQ oysters with blue cheese crumbles for starters (yum!), followed by the catf","useful":1,"cool":0},"ptH31RmPofhihKeVwjiBHQ":{"text":"A mix of hits and misses here.  I'll start with this hits:\nPeel and eat shrimp.  This was ","useful":0,"cool":0},"jycuSDaLSNFTxtA-u_twXg":{"text":"Just here for Happy Hour Oyster Time!! Raw and charbroiled oysters were delectable!!  The ","useful":0,"cool":0},"41XyowPyaplAtYB0pEhRXw":{"text":"Char boiled oysters are to die for the shrimp and grits was ok not a lot of shrimp and onl","useful":0,"cool":0},"9e1GINMc6rNPVs8wwWFULg":{"text":"The biggest $1 happy hour oyster I've ever had!!! So fresh & Delicious. The alligator was ","useful":0,"cool":0},"yh-n-YPMkmlTWdr8Td086Q":{"text":"I regret ordering the crawfish etouflee, it was extremely salty. The catfish poboy was a b","useful":0,"cool":0},"ge3-Vm-4C3Pmwu70WVzbDg":{"text":"Acacia was our waitress and she was amazing!!! On point with service and always with a smi","useful":0,"cool":0},"rGGIF2eJiVzXGl6x8F-hSQ":{"text":"In the quarter, you cannot beat their happy hour with $1 oysters, raw or chargrilled! Took","useful":0,"cool":0},"m1XyUqudRk9y88AAQjeNkA":{"text":"The \"desire\" oysters are a must have. A great starter to any meal but are addictive. Jamba","useful":0,"cool":0},"yBvDBaCmV2Z81K8_GLo_Tg":{"text":"I've eaten here 7 or 8 times.  Lunch and dinner are great, but skip breakfast.  Don't be p","useful":0,"cool":0},"7nVtH2xk1G6GmoT9PwZS1Q":{"text":"The food is great, the service is unprofessional and leaves a lot to be desired. \n\n\nWent w","useful":0,"cool":0},"EJUKYPWyYqvgujhgXNaddQ":{"text":"Glad we found this place - we had a fun dinner here. The food was well prepared and the se","useful":0,"cool":0},"7KrWD7Mvo2G7meiKlfzEyA":{"text":"My hubby found this place because of the yelp reviews. He was craving raw oysters and didn","useful":0,"cool":0},"_MxC2xXY3cZ7-ODVHfSVGw":{"text":"Oysters were good, but the jambalaya was gross.  Jambalaya was not fresh, cold, and lacked","useful":0,"cool":0},"YCEUVW9G_xWfliMhNXRpPQ":{"text":"I am excited to write this review because Desire blew away all of my expectations. \n\nFirst","useful":2,"cool":0},"woZgqB7yQUAvv2zAMa8rXw":{"text":"If you really want to wait 20 minutes for tiny oysters on the half shell,  (after you have","useful":1,"cool":1},"V9E9qzFYvYdQE4DumDdN6g":{"text":"This place was pretty good great location smack dab in the middle of things on bourbon str","useful":0,"cool":0},"ealFIVqhsLOmCfpPdlpy4A":{"text":"Ice cold beers, great happy hour oysters done right.  Clean and bright interior and happy ","useful":0,"cool":0},"wSv0U0qatqYY0ZeJJt21aw":{"text":"This place is really good. Everything I ate was super flavorful & honestly just incredible","useful":0,"cool":0},"qpW3z4J0zZ6RcbNqc65gNg":{"text":"After a day of touring the French Quarter, we felt a bit peckish around 8 PM yesterday and","useful":0,"cool":0},"3ErPE2E6vc5IAHRr2Tf6_A":{"text":"Out of all the restaurants I tried in Nola, this was my all-time favorite. Great ambiance,","useful":1,"cool":0},"x0OqBgGIjJY6xQLH-zVK3g":{"text":"I've been to New Orleans three times over the last 27 years and have loved it every time.T","useful":0,"cool":0},"byCMEfaIq6vjdgtRYHkSXg":{"text":"Oysters and shrimp & grits... that's all you need to know.  And you're welcome!  Seriously","useful":0,"cool":0},"qT6fypTR5tc1uZ7XZxAdfQ":{"text":"The alligator just delicious   First time trying it and I was very pleased.  Service. Kiki","useful":0,"cool":0},"FqzdyTrmhd2KaRp9jZMRpw":{"text":"Ask for Ms. Kitty best barmaid EVER!!!! I will come back just see her. The grilled oysters","useful":0,"cool":0},"PC_upmn2RcfDNhtfAHkV_g":{"text":"Great service.  Wonderful ambiance.  Sassy and fun waitress.  Local food was delicious.  W","useful":0,"cool":0},"86nFJpM8-2W9ralVO6lCgw":{"text":"They have authentic char grills here for the charbroiled oysters! The chicken and waffles ","useful":0,"cool":1},"U78lzHbuH5w4hU-PryKt8g":{"text":"YOU MUST TRY the Crawfish Etouffe!!!!! it is heaven sent! By far the best I've ever tasted","useful":0,"cool":0},"sPzG3Xjd0BbAYcaU3qcTDA":{"text":"Oysters were meaty and mild. Would definitely recommend for first time raw oyster tryers. ","useful":2,"cool":1},"oQEDzRYNo83hexC48vZR7g":{"text":"The oysters were SO good that my husband and I came back two days in a row for happy hour!","useful":0,"cool":0},"TipKTw6XMc7rWPJITvey6w":{"text":"We decided to go here since Deanie's line was wrapped around the corner.  The door guy was","useful":1,"cool":0},"pa2Og2bMsUGncTgTOLirWQ":{"text":"Food was okay, BUT I found a piece of metal wire on my dish. I always swallow it into my s","useful":0,"cool":0},"9YEDVRTO_FM12rBY6Zn-WQ":{"text":"The waiter was RUDE. She put the check on our table while we were eating. Kept coming to o","useful":0,"cool":0},"pOT7nxHUnYX_GpipTe8UlA":{"text":"We are crazy about Irvin Mayfield, who is the jazz artist in residence at the Royal Sonest","useful":1,"cool":0},"VZMZ_m6YTEozneSLOkogfQ":{"text":"Holy moly. $1 dollar oysters during happy hour. Cantrell was super funny, attentive, and m","useful":0,"cool":0},"BOH0eu4-jzJ1CremYKvuYA":{"text":"Sit at the oyster bar! Kentrell and Eric are both genuine superstars!! I prefer smaller oy","useful":0,"cool":0},"WjSQkywI9whjeQv673M-RQ":{"text":"Everything was pretty good, service good not excellent. Had better food up the street the ","useful":0,"cool":0},"V6ADkV9X4AWCaHDZDy8gPA":{"text":"There are sooo many positive things i can say about tis restaurant!! The food is absolutel","useful":0,"cool":0},"Ji1OtkuAS2i9xN9tQJlXjA":{"text":"Note this visit was a couple years ago, but it will definitely keep me from going back.\nTh","useful":0,"cool":0},"lWNvO4eoZRpWBpgMMFmsXQ":{"text":"This is a great place to come for food and conversation. We walked in and decided to sit a","useful":0,"cool":0},"5la31fkOSN01kQT9Uk0wFg":{"text":"I feel like there is some serious yelp inflation in NOLA so I'm here to review the oysters","useful":1,"cool":1},"v6_CVkikoHXskuyMJDV71w":{"text":"This was my first time here and I loved it! The waiters were nice and always came by the t","useful":0,"cool":0},"m6tvAeydkKaTH-d4dnCfTg":{"text":"My family stopped in here because we heard the char broiled oysters were delicious. After ","useful":0,"cool":0},"P-a2SjKDBBr8i7QN79B-8w":{"text":"Wonderful as always! Whenever I come home to NOLA, this is always my first night dinner sp","useful":0,"cool":0},"2Y_ndMBlxw_-d2nGjIAkdQ":{"text":"The po'boy was terrible, more bread than meet and the fried seafood was only decent. The d","useful":0,"cool":0},"BRYg69gdjJgLVYgmxfFNJg":{"text":"Fabulous food. Had the crab etouffee. Amazing. Friend had creole trio, spicy and tantilizi","useful":0,"cool":0},"BGcxwX6kPGrL0J9WMCU_Dg":{"text":"We had a large group but service was good. Every dish we tried here was delicious (po-boys","useful":0,"cool":0},"NN3CezRtobiCdrrxILK42Q":{"text":"This place was clean and that's all I can say about it. The food was horrible. The chicken","useful":0,"cool":0},"OdCI4jowEWOBstu86qJkYA":{"text":"I've eaten at a number of great places in NOLA. Desire Oyster Bar is at the top of my list","useful":0,"cool":0},"9kq2itAv2Gu_tMO39D-HNQ":{"text":"To start I was seated immediately, Robert my server greeted me right away. Super nice and ","useful":0,"cool":0},"0Kz7r20BHYJsfzDly8n4-g":{"text":"Stumbled upon this place on accident and wow am I happy we did. Regardless of how packed t","useful":1,"cool":1},"PiZQRjTn1Ajs2Hp0FczioQ":{"text":"We ran into this little place while we were looking for Acme Oyster bar and could not be m","useful":0,"cool":0},"rDhMtGdCZoYHc0Unu508Ug":{"text":"I had heard great things about this place by several people, but my experience here was no","useful":0,"cool":0},"2fOkUBtgrQ0Q6QggOCRjmA":{"text":"Our bartender Kitty is awesome. She is super friendly and knowledgeable. I will come back ","useful":0,"cool":0},"q-dk2VMJmDVKi_wNxZ4s3Q":{"text":"Great oysters, fun to sit at the window on bourbon street! We also had a great service by ","useful":0,"cool":0},"2IrN7ui9C8HW4C8kVOZ_Qg":{"text":"We came here for a quick lunch and were very pleased. There were three of us, and we order","useful":0,"cool":0},"gnhv6_8T6vx_e1LDtu9-hw":{"text":"This place is a must stop everytime I'm in NOLA, the shrimp and grits are the bomb dot com","useful":0,"cool":0},"wzuY5BuefG-HDSz9PoQTqA":{"text":"The BBQ shrimp was terrible and small. The wait staff was really nice but the BBQ shrimp w","useful":0,"cool":0},"ldVNKzyyhTIPU-th0Dh9Dw":{"text":"I came early in the morning looking for a muffaletta and gumbo, but arrived too early. The","useful":0,"cool":0},"YC-jkk0reINHGlti-aCUnw":{"text":"Best raw oysters in town...sit at the oyster bar!!  I can honestly say this review is only","useful":4,"cool":0},"4E1ie338-HM5rr8mYrr3Hw":{"text":"We wanted oysters after wandering around town for a bit, so stopped in.\n\nMy only problem w","useful":1,"cool":0},"hbUZAN4MnZN3qa6kLAa42A":{"text":"Great, friendly service and good food. A bit salty for my liking, but I found myself stuff","useful":0,"cool":0},"5rbVFNPTyS3B5SzqTxrdMw":{"text":"We were a little leery on going into this restaurant since it was right on Bourbon St., we","useful":0,"cool":0},"5mFjlmAR0MQkHQK8-_BrUA":{"text":"I don't rate often - but this place - WOW. \nCrab Mac N Cheese\nShrimp Grits\nGrilled Oysters","useful":1,"cool":0},"HzmOYEEI27X5yXHOm74J8Q":{"text":"I usually stay faaaaaaaar away from Bourbon Street so in all my years of going to NoLa I h","useful":2,"cool":0},"vJdbA5EMtJh5CVv5Gu7zeA":{"text":"So I didn't get enough of my oyster fix in NOLA so we stopped by here as a last minute thi","useful":0,"cool":0},"ogpQoPpYHsskF90AlQzblA":{"text":"Way overpriced. Terrible service. Got the wrong type of oysters that I ordered (ordered ra","useful":0,"cool":0},"ew_e_F4LoBZzWVNlL5q4kQ":{"text":"My husband and I stopped in for a quick drink and some oysters. I liked how open and clean","useful":0,"cool":0},"683k8gP0P1agk2gINYm2Pg":{"text":"Had some amazing oysters. 1/2 dozen regular oysters and 1/2 dozen char grilled (came with ","useful":0,"cool":0},"eyCT3sy7FQx0Ut5zhk_9eA":{"text":"Went on the recommendation of the concierge, which I rarely follow, at the Royal Sonesta n","useful":0,"cool":0},"_OP21nyglcDxRJXastCyCA":{"text":"Helen, our waitress, is absolutely an awesome character.  This facility has been undergoin","useful":0,"cool":0},"OIfT0pNKhrct1_YdKa3Xew":{"text":"Amazing oyster shuckers and grill cooks at desire! I recommend you sit at the oyster bar a","useful":0,"cool":0},"gLmnWcaI6G0m2ZOFUOtN7Q":{"text":"Slow to get the food but servers were nice.\n\nGumbo was quite salty.\n\nPortions were small f","useful":0,"cool":0},"U3PfHPmHj7o5HOp31xgYbA":{"text":"3 Jumbo, succulent shrimp in a beautiful, rich and creamy Remoulade over crispy, hot Fried","useful":0,"cool":0},"X8ZjAf-iRhQqw4WXEiV9Og":{"text":"Very good food reasonably priced for the Quarter.  No music, no signature drink, just a qu","useful":0,"cool":0},"2_eT3hraHfU3YcspFjQ7KQ":{"text":"Always good, never disappoints. Just stick with the oysters, shrimp, jambalaya or etoufee.","useful":0,"cool":0},"0gI0RdE-5OZR9AwwDEfCog":{"text":"Ok, so it's on Bourbon Street but ... The raw oysters at the oyster bar were hands down th","useful":0,"cool":0},"CZnNtojgTOqXE09PVkVAVA":{"text":"Service is really great. And the restroom is VERY impressive... But the food is just ok. I","useful":0,"cool":0},"RaFwYVKdV1J-Tmj4E_gVfA":{"text":"The staff here is awesome! We originally went somewhere else for lunch and it was pretty a","useful":0,"cool":0},"gA1ngqMR3m0AdHtLL8huJg":{"text":"Have eaten here many times and has been dependable.  This rime the shrimp poboy and bimbo ","useful":1,"cool":0},"vHfz6XSSTPia5YrD6TwTCw":{"text":"Good service. Good food and good times. Wow is it packed on busy bourbon st and what a lin","useful":0,"cool":0},"OM3-OyqVIloHN94QYKSA7w":{"text":"If you've had a little too much to drink and need a quick bit to eat this place is perfect","useful":0,"cool":0},"i2EoCqy0yOs_kpIrxHoSVA":{"text":"We got lucky and scored a window seat, and this being our first Bourbon St experience, it ","useful":0,"cool":0},"K8F5GaWdn2f-C-Gl2bROGA":{"text":"Best burger I've ever had!  Fried green tomatoes are perfection!","useful":0,"cool":0},"K3GLoiCAnMiicu0RQ1E8Cg":{"text":"Visiting for business. Walked in and sat at the bar, cortéis and quick service. I had the ","useful":0,"cool":0},"4rbjYfO4L7f1nwYHHlbgxA":{"text":"Visited on new year's day around 6:30pm and half the restaurant was empty. No wait compare","useful":2,"cool":1},"3S3jCrX7sJCL2Fry3_9LHQ":{"text":"The beginning of an extremely drunken night began here with super strong hurricanes.\n\nThe ","useful":0,"cool":0},"DFVfpNfxyf-KE0YBUiKDaw":{"text":"I am staying at the Royal Sonesta Hotel for 8 days where the staff has been incredible.  R","useful":0,"cool":0},"_PgQOJD27uzpintBoDVzdQ":{"text":"First stop every trip. Freaking LOVE this place. Make sure to sit at the oyster bar if you","useful":0,"cool":0},"MnRSrro_Ufr68tqKWCiFlA":{"text":"Service is spotty at best (definitely needs work) but the charred oysters are an absolute ","useful":0,"cool":0},"K3MtUBi02zv3oWqDwwg5vA":{"text":"Ordered crab cakes and Crawfish Etouffee and was particularly impressed with the Etouffee!","useful":0,"cool":0},"0mZ8m_9q-erzKdX4JNzE-g":{"text":"We visited Desire Oyster bar on a couple nights because of how amazing the food was. The c","useful":1,"cool":0},"GC9YgZQ8gqneJS37PD_X6A":{"text":"It's true what everyone says - avoid Bourbon St! It's great to check out for about 20 minu","useful":0,"cool":1},"TpHmywsyF0LCIMf9CMaRuQ":{"text":"I wish I would've gone to a different place rather than going to the original place that I","useful":0,"cool":0},"X7UnAuYFPiFa5YGBrhBpvA":{"text":"Husband had to leave back home so I was left alone to my own devices on Bourbon Street on ","useful":2,"cool":2},"g2DA7RJ3h8Gb3EB0fgygRw":{"text":"Upscale eating establishment on Bourbon Street with beautiful old world charm and reasonab","useful":0,"cool":0},"yOikn003e3pAl7laE5U0xw":{"text":"I ordered the char grilled oysters grilled by kentrell and my host was Frankie who tended ","useful":0,"cool":0},"v-BFQz80fY4SzQBXGoeD7A":{"text":"Desire was one of my favorites restaurant experiences during my New Orleans trip. Desire r","useful":15,"cool":17},"T4DsEHTwYML2AJaKCsFI2w":{"text":"Great location. Chargrilled oysters & crawfish ravioli were good but not great. Service wa","useful":0,"cool":0},"GlVXOdU4ZCUmhe2Pw26Weg":{"text":"The food is really good but the service needs improvement. The chargrilled oysters are ver","useful":0,"cool":0},"1ffrKSPQRbuEh5YsEh0Y9A":{"text":"Stopped here because sadly no bars are open during the afternoon before our dinner at a di","useful":0,"cool":0},"BoPa4m9zoHKLR20-E50Veg":{"text":"This place sucks. The service is bad the waitress is terrible, the food sucks. Im not sati","useful":0,"cool":1},"uWyHmRa6zUf-Z2r3gwV5Ag":{"text":"I'd give them a zero if they had one. We only order 4 things. Bloody Mary, Budweiser, crab","useful":0,"cool":0},"GeRxTkFXoMdPoCHYz7UjEA":{"text":"The jambalaya is some of the best I've had in New Orleans. It made me want to go back to h","useful":0,"cool":0},"kwfo6TWyt24UOqI9A8rahw":{"text":"Ok. I'm pretty sure I saw them using generic baby wipes to clean the tables. That one stat","useful":0,"cool":0},"JUXOPda4ymoSJNIfLjZm5Q":{"text":"Located on the Bienville Street side of the Royal Sonesta Hotel, this restaurant offers ve","useful":0,"cool":0},"bBYic9QDWY34H7JSMX_vTQ":{"text":"Love this place! It was our first time here and we loved the food and the ambiance. The sh","useful":0,"cool":0},"eHQ2BT_-0mlaxm-Bs-TdkA":{"text":"I prefer Desire to Acme. Acme has the name, but Desire has better flavor. \n\nThe oysters we","useful":1,"cool":2},"n0zjKztSTrYC_fQ7ADqQEg":{"text":"Besides the slow service we love this place. Restrooms are clean and the food is great! I ","useful":0,"cool":0},"MZSlz5a3ZaFWNrY8SKzVSQ":{"text":"Hands down THE BEST.. first stop every single visit.  Thank you, as always, to Frankie and","useful":0,"cool":0},"iux2-ZimOt99sZmdeCBvcA":{"text":"This was one of the best meals I have ever had... We started with a half dozen raw oysters","useful":0,"cool":0},"1OuT0p_WlwfGCHfpHmODbA":{"text":"The best Oysters I've ever had (Try Happy Hour)You can't beat the prices .Located on bourb","useful":0,"cool":0},"WDwSBYZGl7vs5N9pikRthw":{"text":"Sat at the bar for snacks and mid-day cocktails. The cocktail program at Desire is amazing","useful":0,"cool":0},"AtR22Q_FV9xAIQbRZAHfAw":{"text":"I've been here before and enjoyed it. But this visit was terrible. The new hostess Brittan","useful":0,"cool":0},"4S0-cMOXFknnXQ8bVZ1vTg":{"text":"I ordered a catfish poboy, not good at all. The bread was stale and the fish wasn't good e","useful":0,"cool":0},"R7qc8Al5lPFLvvb-5AKQ-A":{"text":"Super solid choice for lunchtime with a toddler! Very friendly and accommodating staff, ki","useful":0,"cool":0},"HPWGvxyA7Pkkz4fGOx52iQ":{"text":"3pm to 6pm Happy Hour Oysters, raw & char-grilled. They have Crawfish Bisque/Seafood Soup.","useful":0,"cool":0},"lKFPlaOp9nktGuOcf527wg":{"text":"Kentrell, the main man at the oyster bar, is one of the best people I've ever experienced.","useful":0,"cool":0},"-q07wBj5lA7Xa1ux13V0_Q":{"text":"Just an average oyster spot, too touristy ... You're going to find better spots in new Orl","useful":0,"cool":0},"X-Kny5mXqWDVKL3G50AX8g":{"text":"New Orleans, Louisiana- Bourbon Street. Classic French Quarter style hotel on the corner. ","useful":0,"cool":0},"lz-tNa1q5h0ZF7To_-VpEg":{"text":"Amazing food on bourbon street.there fresh made cocktail sauce is on of the best I have ev","useful":0,"cool":1},"eY8H51lhomloKlLWEiLr3g":{"text":"All the food I've had here has been pretty good, and normally the atmosphere is pretty cla","useful":0,"cool":0},"1FutIfmnicj2am5MyjKQTg":{"text":"Wife and I went there on our recent visit to New Orleans there was about a 30 minute wait ","useful":0,"cool":0},"aUC4bzfu4DxNOeW-7RJg5Q":{"text":"The best by far for the charbroiled oysters and jerk fish. No wait and super friendly staf","useful":0,"cool":0},"rGztHxSpBHlITqC_kG2VqQ":{"text":"Came here super excited for the oysters and was highly disappointed. Maybe overcook which ","useful":0,"cool":0},"XPgfy_LgAt5KPY5yGib6wg":{"text":"We stayed at the Royal Sonesta Hotel. It is located right in the hotel. \nWe had breakfast ","useful":0,"cool":0},"nw5X1b_6_ABufAX6-yoqwQ":{"text":"We decided to eat at Desire's while visiting NOLA.  The restaurant is located in the Royal","useful":0,"cool":0},"s8l4j_Drmk6BqwTOGe43kQ":{"text":"The BEST grilled oysters in NOLA! Frankie G and Kentrell are the best oyster bar hosts and","useful":0,"cool":0},"ladP1wuWA2JEm6-M0DAIwA":{"text":"Great food, great service and a decent price. I loved their crawfish and oysters. Highly r","useful":0,"cool":0},"ol_5G3QFxSPC_Ne-XDMV9Q":{"text":"With so many great places I wouldn't go here unless you want to sit on bourbon st.\n\nServic","useful":1,"cool":1},"7Wy-AEJjFwhypk2RGA40mQ":{"text":"While in New Orleans, for a business trip, I decided I would give this place a try.  It wa","useful":0,"cool":0},"UXVWrwjtgFh1-M3kOsJQIw":{"text":"We ordered the stuffed mushrooms and bbq shrimp as an appetizer. I had the charbroiled oys","useful":0,"cool":0},"CV1C7IUkAemMUWazMp9EkQ":{"text":"I love the chargrilled oysters from this place. Service is always great and oysters are al","useful":0,"cool":0},"rlhXLCpfrp550U83vejlXg":{"text":"I love their grilled oysters with cheeses on top! My memory of visiting New Orleans and th","useful":0,"cool":0},"_ItUsLtiJJ5ttI9EgEgnJw":{"text":"Service was good but difficult to locate our server to cash out. Among the four of us we h","useful":1,"cool":0},"flOCx2aJrlws8FnUBghTLQ":{"text":"We sat at the oyster bar because my friend wanted raw oysters. The cook was honest and let","useful":1,"cool":1},"WaExzFEOIW-hVG66hahTYg":{"text":"Oh how I love a good charbroiled oyster! My husband and I are always on the hunt for the b","useful":0,"cool":0},"gmgYFbuae0uFwPucJGSmjA":{"text":"We were  able to drop in about 10pm on a Friday night during FQF with no wait (although pl","useful":0,"cool":0},"nswuG9CEC3Cs_y5Vke2SAA":{"text":"If I could give them zero stars I would. Went here because I seen the 4 star rating and I ","useful":1,"cool":0},"W68SWoNXac2z5AZQO-9GUg":{"text":"Best oysters in town if you ask me. We've eaten oysters everywhere we've dined and Desire ","useful":0,"cool":0},"4cheeY9yFbiOLCtTeNUIcg":{"text":"Great food! Charred Oysters were amazing! Great ambience and lighting!  They also had on t","useful":0,"cool":0},"eTOJZ0Kn4HJha4VxqBwKFw":{"text":"This place really rocked our world!  The oysters were uneven, though, with some being huge","useful":0,"cool":0},"-hX3eG70-92F5IgvNLXLJA":{"text":"The boiled shrimp were perfectly cooked and the cocktail sauce was fresh with a horse radi","useful":0,"cool":0},"EJW9TUUM1Xvn36w60muDYg":{"text":"I am very impressed.  Sometimes with good food, we are not going to get the best service. ","useful":0,"cool":0},"Z5O9OynJeBF9S9zQgqcwhw":{"text":"I've been to a few restaurants in the French Quarter who serve similar food and this place","useful":1,"cool":1},"dKhWjSC5BGrLDwLyKn3FCw":{"text":"When we first hit Bourbon Street and saw this restaurant we didn't even bother. We figured","useful":0,"cool":0},"PnpX_LftosrfBwqvKmuSvw":{"text":"Boiled crawfish (in season from mid-Feb to end of May, perfect for festival season) in a s","useful":1,"cool":1},"SLKTCBIs4-SgPMm8SWL4AA":{"text":"Had dinner at Desire on a Sunday night.  Got a table by the open windows facing Bourbon st","useful":0,"cool":0},"x6TjXPehR67wyQ7Z7QT0Aw":{"text":"Ok so I've never been here, but looking at these pictures I'm going to go ahead and give t","useful":0,"cool":0},"7BXeNgM0to5k976DLCBOwQ":{"text":"Chris was absolutely amazing we chatted while he cooked for us the food was amazing I had ","useful":0,"cool":0},"lyMI9sjxuV6KB1QaVETyRg":{"text":"Everything about this place was just fine for us--the service, the grilled oysters, the gu","useful":0,"cool":0},"LQlD_OnhnwmplfGXcwQoeA":{"text":"ATMOSPHERE:\nFun and busy, but the chairs are well worn, floors a bit dirty. However the ce","useful":0,"cool":0},"iXZqGvllr336_G2K16RRZQ":{"text":"Had a dozen raw fresh oysters, potato lyonnaise and a couple of drinks. The oysters were v","useful":0,"cool":0},"ZAGrKrncKb-W3Aq9dtQKrg":{"text":"The woman at the front door told us that there was no crawfish in the French quarter. Mean","useful":0,"cool":0},"c-GEhIB_WCSz_ikfz-wZFA":{"text":"Oysters and Happy hour deal was good but the service was atrocious.  Took our waiter forev","useful":0,"cool":0},"a0AS8EQtvAD7NCewsPzZdQ":{"text":"Wow, how I have ever felt judged in my life by the bar tender. No thanks I'll take my busi","useful":0,"cool":0},"tGGEJXShaBsk9faq-yTc2g":{"text":"I can't comment on their food. We attempted to go, but were informed at the door by a rand","useful":0,"cool":0},"j3HyErl-lYUJD2crOTFRow":{"text":"Oyster review: I came just with the intention to try their charbroiled oysters... it hit t","useful":7,"cool":9},"SNVpPikWVYgnVdvroCTuXg":{"text":"I love this place!  Especially the oyster bar!  Kentrelle and Freddie Genes are the best. ","useful":0,"cool":0},"A_jdAqyoqxv3ljLI06crfw":{"text":"If there was a contest for how many shell fragments you can leave in an oyster before serv","useful":2,"cool":2},"jYSuWblNQTVvZgOdtJ91oA":{"text":"So while in NOLA, it was made very clear that I could not leave without trying some oyster","useful":1,"cool":0},"nrRZ0upYGzEg0mH3qJy6kQ":{"text":"We ordered the char-grilled oysters and creole gumbo. The food is amazing and so is the pl","useful":0,"cool":0},"GHezYB2jocHrB_NX7oE9FA":{"text":"The oysters here are excellent excellent excellent! We sat at the oyster bar and spoke wit","useful":0,"cool":0},"kLQkN7ULLj6SJ7AZjJkkzw":{"text":"My brother, brother-in-law and I did an oyster crawl last Sunday in the French Quarter hit","useful":0,"cool":0},"CB0U8V_3-Lqo9qeeCEpBgQ":{"text":"Came in here yesterday for lunch/ dinner everyone was super friendly and food and drinks c","useful":0,"cool":0},"vqowgW6PkKicYj9w1PAimg":{"text":"I love their happy hour! The wine was tasty and i love the oysters here. They serve pretty","useful":0,"cool":0},"DjNRA3jAwr60wRtkMJvBcA":{"text":"This is my favorite place to go for oysters both fresh and grilled.  Be sure to sit at the","useful":0,"cool":0},"rjMWBGXbhA561LEgqWkeWA":{"text":"Delicious. Very good alligator burger. Sounds odd, but trust me, delicious.  Very unique f","useful":0,"cool":0},"EADOyA1nhPEYzb2iNaZaeQ":{"text":"Best oysters with all that we tried in NOLA!  Love the oysters and love the people.  Sit a","useful":0,"cool":0},"P3uKW6_unvmUC4pd0sAKpQ":{"text":"We liked it so much the first time that we came back. We had lunch there the first time we","useful":0,"cool":0},"TMvljx6Fe0s957pqSfyL_Q":{"text":"We dined at Desire on Ash Wednesday for breakfast and the food was delicious.  My husband ","useful":0,"cool":0},"oyRk1gD_X8oWV6Hizn23cw":{"text":"Amazing!! Sat at the bar with franky G, kartrell, and mike and talk about amazing hospital","useful":0,"cool":0},"TeUEgpj7UV8QeFgD9NVWZw":{"text":"Since oysters have already been covered here, let's talk about breakfast. About 10:00am, I","useful":0,"cool":0},"BkBQOwclT8MwDEHtlyGrHw":{"text":"Love the oyster at these place the food when the place was down pack with people so someti","useful":0,"cool":0},"Y0p2GXgou9ljvOVB5MHKbw":{"text":"Came here just before happy hour, which was perfect because this place went from dead to p","useful":0,"cool":0},"13Xu_q_pjDZxnSRSRn3fpA":{"text":"Hmm this spot was ok, not great just ok.  I have had oysters in many different places, but","useful":0,"cool":0},"kMVvX6lC1chU-RfHvllGnQ":{"text":"Sat at the bar multiple nights and the guys really took good care of us. Food was deliciou","useful":0,"cool":0},"sJKQ6yjwDJqnmmTie-2oLg":{"text":"Visiting for business. Walked in and sat at the bar, cortéis and quick service. I had the ","useful":1,"cool":1},"cPM6JHQ-yEZMT1XIvn-0pw":{"text":"If I can give zero stars, I will. \n\nThe happy hour was a good deal like mentioned in the r","useful":1,"cool":1},"V_8NWfY_wD5kma7lU4IBzw":{"text":"We don't frequent as often since they took the table rolls off of the menu. I know it soun","useful":0,"cool":0},"R6Q1mKIMa4B6g2J0ZZkyrQ":{"text":"My husband and I fly into New Orleans every year just to eat here.  Everything we try is g","useful":0,"cool":0},"HvHRzxSrjmGKkdPugZE8OA":{"text":"We never ate a proper meal here. However they have a great Happy Hour menu. Additionally t","useful":1,"cool":1},"pOdGTshXV3qgt4HbGFDptQ":{"text":"Let me start by saying I was never a fan of oysters! You couldn't pay me to even try these","useful":0,"cool":0},"hg9nqdeQpmVTWAOGwdl7wg":{"text":"No line, no wait and the best chargrilled oysters EVER.  They were so good that my friends","useful":0,"cool":0},"owj3TU-gnHEYn_AHPSxA3Q":{"text":"Sit in the back oyster bar in front of Augustus. Notice the awards behind him. Notice his ","useful":0,"cool":3},"GFdM1SdCO0kkBfrjOYnPng":{"text":"Stumbled into this place late at night on bourbon street because my friends were craving o","useful":0,"cool":0},"pi3ENnyJSlPhq5b8KTUP0w":{"text":"Dropped in before heading to the Sugar Bowl game.  We had been a couple of years earlier a","useful":0,"cool":0},"KAJpGrR_DicX7VSTHyxsrw":{"text":"Stopped in at my daughters suggestion. It's right on Bourbon Street in a great location. I","useful":0,"cool":0},"gtwbjDz2SlI06nmQgspW8Q":{"text":"My friends and I wandered in here off of Bourbon Street without and expectations and this ","useful":0,"cool":0},"g3G1DWf8pKNDVLXS2lQdFA":{"text":"The oysters were small and not flavorful. The shrimp tasted as if the was spoiled. Not sur","useful":0,"cool":0},"o7QFgpc8u4a5bT-WYi444A":{"text":"Stopped in here on a total whim because I was starving, they weren't packed like everywher","useful":1,"cool":1},"XsawbLJ51Vqr0J36oXZmWA":{"text":"My boyfriend and I ate at this restaurant a few times as we stayed at the royal sonesta at","useful":2,"cool":2},"H5c1-LiuwzZ5LYmQdEoRIg":{"text":"The absolutely best in New Orleans. Not only are the raw oysters the freshest and HUGE but","useful":0,"cool":0},"WUS9Z1RZ81CHmbiJgHKjFg":{"text":"First true Gumbo from the South and I was DEE-LIGHTED! So good! Lots of flavor and loaded ","useful":0,"cool":0},"nr93a-UZYZE9n1b_kRYDfQ":{"text":"Stopped for lunch on a Thursday.  Wife had the jambalaya and I has the shrimp carbonara po","useful":0,"cool":0},"VXQg1YycQkOFYPwTnJeECA":{"text":"Against better judgment that you shouldn't eat raw oysters in the French Quarter... I coul","useful":1,"cool":1},"LuufY88Ud137rsVnbhIEVw":{"text":"Amazing shrimp and grits.... best meal ever. The sauce was to die for!! Crab cakes and oys","useful":0,"cool":0},"StdYxREp9mD0OQU8gsoFMw":{"text":"I don't know if it was the hurricanes or the sweet old waitress calling me sugar, but I lo","useful":2,"cool":1},"2f2pPPlUKcQbIXCfiX0Mrg":{"text":"I am staying at the Royal Sonesta Hotel for 8 days where the staff has been incredible.  R","useful":0,"cool":0},"49ngXKTjvwhC6yMbRZ6KFA":{"text":"Our best meal while visiting New Orleans.  While we stayed in the French Quarter, we ate a","useful":2,"cool":2},"WMVVIwCxoFbUVfSNeypKSA":{"text":"This was the first restaurant I visited in New Orleans. I was not disappointed. The server","useful":0,"cool":0},"v8Anu0y1yZ9DTHzNj3YfVA":{"text":"Cool spot. The drinks were better than other locations and the food was great. A LOT of fr","useful":0,"cool":0},"mfnk94fdN6gbYqicO0uVFQ":{"text":"This place was great, the bread pudding was by far the best I think I've had anywhere. The","useful":0,"cool":0},"d5HeEMa5Er5QxeP-Hc0ELA":{"text":"This is my absolute favorite restaurant on Bourbon St. for the last 17 years!!! Kentrell i","useful":0,"cool":0},"ctF7egIINuWQXK5QY6zdzQ":{"text":"Located right on bourbon street. The waiter was extremely nice. The inside of the place lo","useful":0,"cool":0},"p0Qe9qqUJ_hKnHqXAEaRtA":{"text":"Came for oysters and was definitely satisfied! Also tried their crawfish fries and they co","useful":0,"cool":0},"XNJRlezsP7cwTlMYTHyRmg":{"text":"DANIEL DANIEL DANIEL.. Great Wait staff- took good care of us and made some great  recs. W","useful":1,"cool":1},"z0fQ14_7t1cWD__qLtz1OQ":{"text":"The fact that you actually have to walk on the sh*thole we all know is Bourbon St is suspi","useful":2,"cool":0},"W4eXqClpwGeaJyKcDhAtXw":{"text":"We were told that you can't get a good steak and good oysters in the same place while in t","useful":0,"cool":0},"cStYCCQrum5zxo3wAX8PsA":{"text":"If you're ever wondering around Bourbon Street and you're looking for some fire oysters ei","useful":1,"cool":2},"fLbcMUvQsdBwHFIV8Zleuw":{"text":"Desire was a must stop on our trip to New Orleans. Located in the heart of bourbon Street.","useful":2,"cool":2},"2YlBydd1CllUJHXDPWkJ3g":{"text":"Connected to our hotel - lucky us.  We ate here twice during our stay.\n\nFirst time, we had","useful":0,"cool":1},"vMCqsrfn94A5MEwV88AMBA":{"text":"What an experience! The chargrilled oysters are a must, and their bloody Mary is pretty go","useful":2,"cool":4},"pUc2erUdHiWd3KzC5W5gvQ":{"text":"I was only in town for a day and I decided to take someones advice about this restaurant a","useful":3,"cool":1},"Gc1hXD1cvyoqVQHasZDp-A":{"text":"Alligator bites are bomb here! I had the red beans and rice. It was delicious and great co","useful":0,"cool":0},"szRgZF4ilj48n8G7Ba5GCA":{"text":"Came here with a group of friends for dinner, during  our last night in NOLA. We weren't s","useful":0,"cool":0},"_OwQM76ACYJBCt9VtPLalA":{"text":"In-freaking-credible! Best oysters I've ever had, hands down. Both the grilled and the BBQ","useful":0,"cool":0},"ZJHxys1VdTDhksjJtp1q2Q":{"text":"The oysters were small and not flavorful. The shrimp tasted as if the was spoiled. Not sur","useful":0,"cool":0},"2V2ybqaPz1i1TCp5wI-X2g":{"text":"My absolute favorite place to go when in New Orleans. The food is great, especially the Ch","useful":0,"cool":0},"VpOZMCzQpwdKvIRmv8pLsg":{"text":"Our first time here. The restaurant is beautiful chic inside. I tried gator meat for the v","useful":0,"cool":0},"PFu8otIv5wgNEBkUpGueRg":{"text":"This is more of a \"diner\" style restaurant. It can be a bit loud sometimes, but it never b","useful":1,"cool":1},"JGckolfNCJbmmhLJPeRMvQ":{"text":"Loved the BBQ OYSTERS. Get the trio perfect for sharing and beautiful flavors. The sounds ","useful":0,"cool":0},"JtrCVcpNDJg031BGCM2xOQ":{"text":"Kiki is an excellent server. Grilled oysters were delicious. Best dinner experience we had","useful":0,"cool":0},"Hb2p-BzBHQD4c9UesMzk-w":{"text":"Outstanding! Outstanding! Outstanding! If your over the lines at Acme & Felix - please sto","useful":0,"cool":0},"_Q2EnyYQloRAWy5eQJ49LA":{"text":"Loved the jumbalaya! The best I had in years. I'm thinking back on my trip and I have to g","useful":0,"cool":0},"Tq5syjZAUWSbToTeE8qD-w":{"text":"TRIED AND TRUE: this Creole/Cajun cum Oyster Bar still delivers an old-school experience i","useful":7,"cool":6},"j_hENI-fCVTk-zThU7epQA":{"text":"I only went here once, sat at the oyster bar in the back, and realized I'm going to come b","useful":0,"cool":0},"dB_zch2sGELqpnkTr_I7cQ":{"text":"Loved the oysters here. Came for happy hour, oysters were $1 each (both raw and chargrille","useful":0,"cool":0},"tXRw3Q0FpluuF2Q0psZoCA":{"text":"It was me and my daughter first time eating out at a restaurant on Bourbon st. There was a","useful":0,"cool":0},"Ko4f2gdxEMHHpuMVgSdfpA":{"text":"Awesome oysters any way you like them. Half shell , Rockefeller, char broiled, fried. Grea","useful":1,"cool":1},"C2OPYeicXR4DyVR60QDrsw":{"text":"It was crazy busy the night I was here.  I believe there were only four waitresses for the","useful":0,"cool":0},"sKbOnURnW6ivupAyCy2Udg":{"text":"Food was average. Oysters were OK, steak wasn't that great and the kid's chicken was under","useful":0,"cool":0},"Zq55w8VtjxntkQGL5Y34pQ":{"text":"The best oysters in town! Walk right in and sit at the oyster bar!! Excellent service at t","useful":0,"cool":0},"XwJtMVguFt0iThN101mQKg":{"text":"Ate here a few times during my week long stay.  Had authentic French toast with eggs for b","useful":0,"cool":0},"_6Iix18WMF2UWCnDWKQneA":{"text":"Meh, honestly, I was not impressed. I was in town for a bachelorette party and we were in ","useful":5,"cool":4},"wqhDwTXAsZiaKJsotdwMFA":{"text":"Based upon reviews - stopped in for lunch .. not too packed and seemed like a winner and p","useful":25,"cool":15},"CrNAaQwG5WhpgQg0-0P2aQ":{"text":"Great Restaurant.  I ordered Jambalaya and was very pleased. My wife ordered CharGrilled O","useful":0,"cool":0},"X_PsO0N4JRtPwkIJFcjSLg":{"text":"Went here for the oysters based on prior reviews and we had mixed feelings about them. The","useful":0,"cool":0},"5Lv4kn-6aYn-RVCZFVyeug":{"text":"I thought it was going to be mediocre because there was a short line at the door and at so","useful":0,"cool":0},"Pl2ydxUkMKLHk4h79AFRDg":{"text":"Saw patrons leave and never served. Food was mediocre. Spent $32 for a Seafood Plate with ","useful":0,"cool":0},"mQP-t6vmxslfohaxRvKHQw":{"text":"This is a good place to eat and people watch when the shutters are open. We ordered the oy","useful":0,"cool":1},"eJTVgLEnOAP3A_5ieZL03Q":{"text":"I have been here many times, the shrimp creole is my least favorite. The po boys and red b","useful":0,"cool":0},"TLOl7EZXO0e25BAccKey6Q":{"text":"Situated directly on Bourbon Street, with the traditional open doors/widows allows you to ","useful":2,"cool":3},"zrdIALBSrcmT1CkyE2M-Gw":{"text":"Please change this to $$$$ , it's way more expensive than anything in the area.  Not worth","useful":0,"cool":0},"uDB6CpiVdgOyWpJnUZpp8Q":{"text":"With all the other oyster bars around, you wouldn't think this to be all that special, but","useful":0,"cool":0},"MZyiVqlq9Liuy6sI5-0Uaw":{"text":"Come chat up my boy Frankie-G over some Chard oysters!!  It'll change your life.\n\nThis dud","useful":1,"cool":0},"BKgc2qjGdYpSm9OPJDgEBQ":{"text":"These Oysters were pretty good. I would give them a 4.. I also had some seafood gumbo and ","useful":2,"cool":4},"Vw5is1kbLwg6jjqcKQRzEg":{"text":"Walking around the French quarters we stumbled on Desires which is connected to a hotel. I","useful":1,"cool":0},"bT2nGJ0eKPNu7aWa_JDlVA":{"text":"The place is a little noisy, but it has very good food. Jambalaya is really good, as is th","useful":0,"cool":0},"ggu0Ej90u4QsrI-fckqaRA":{"text":"Well.... I guess I should have known with it being on Bourbon St.  this is an over priced ","useful":0,"cool":0},"zWKs7h_skaDw9W9QAz9e1w":{"text":"We were seated immediately which was surprisingly giving it was jazz fest week, took a whi","useful":0,"cool":1},"3_oFP7Nxkka85tTanwJK8w":{"text":"we've all seen the Desire sign the restaurant is in the Royal Sonesta and as an Oyster sno","useful":12,"cool":8},"C_wi4tJ5XicrBinu-Go4iQ":{"text":"After engaging in shenanigans on Bourbon Street I needed something to nibble on while I re","useful":4,"cool":1},"-IM4fI3_d7LaSZoW_kE9dA":{"text":"Great hospitality from the moment we walked in. Food was amazing as well. We had a deep fr","useful":0,"cool":0},"y5n_9ZlRC9nu6BeuvahhGA":{"text":"Made a reservation, walked right in and sat at the bar. Food was great. Service was great.","useful":0,"cool":0},"nyWsgFmEZUJ7gZ2Md20C8g":{"text":"Just had an awesome meal at Desire Oyster Bar! Our waitress, Acacia, was an absolute delig","useful":0,"cool":0},"jrhFYXEC9C8krlkGiEBKVA":{"text":"Waited 10 minutes to be seated.  No one seated us.  Found a seat.  Was rudely throw out fo","useful":0,"cool":0},"Fut4pOs2YuPc4881wNZYQA":{"text":"Easy to find on the corner of Bourbon and Bienville streets. It was lunch time and we were","useful":0,"cool":0},"U8RERsTWNaeeLZN7IcHNyw":{"text":"Dropped in here on a whim while walking down bourbon st Definitely impressed with their fr","useful":0,"cool":0},"O1QcghduZHcsP_pTd87nzg":{"text":"Came here as we are staying at the Royal Sonesta it is located at. Had the Firecracker Oys","useful":1,"cool":2},"XZJOSJ0Sl1NpSxHzt9ezUA":{"text":"I had one of the best meals here in my recent stay in NOLA. My boyfriend and I tried charb","useful":4,"cool":4},"vsEGZHo7t3q9Yl9YemkS3A":{"text":"We shared a dozen chargrilled oysters and the Peacemaker po boy. The oysters were the best","useful":0,"cool":0},"NinSaPlGcfEWp7Sy4ONgew":{"text":"Had the Cajun jambalaya and it was Ok. I'd like to go back and try some other dishes that ","useful":0,"cool":0},"-7tx_BlwKdUVFNnRW0hdLw":{"text":"Been waiting for anything for more than 30 min... got water on sit down. Ordered right awa","useful":0,"cool":0},"HRkA2342AhNVwZEPu-uHug":{"text":"Sad visit today.  We have always enjoyed this place.  Lunch was just a wedge salad and a d","useful":0,"cool":0},"XVbA8cRok2CVKSpb_U0L-w":{"text":"The food was great and the service was faster than expected with the large crowds.I would ","useful":0,"cool":0},"2C9mgzHDWnCyk9pXiM2sJQ":{"text":"I have celiac disease. I'm deathly allergic to wheat. I'm also on my honeymoon in New Orle","useful":0,"cool":0},"oy467d_tWUyFmiysG6tqcQ":{"text":"Came for lunch, seated quick. My wife got the lunch special (salad/jambalaya/bread pudding","useful":0,"cool":0},"8XuTPFl4D1E8vvBgcOuL9A":{"text":"This place was across from our hotel, Hotel Mazarin, so very convenient. After a couple of","useful":0,"cool":0},"3Ej0mHI4p8uPyA32GzAp0Q":{"text":"I'm not quite sure why this place has 4 stars... We came in on a Saturday night and there ","useful":0,"cool":0},"HX1duWl6raOKvsWL3Z7yXg":{"text":"Right on the corner of Bourbon and Bienville, it's manages to be cozy while being in the h","useful":0,"cool":0},"3uL5l3kaRCiu8lgYrkliAg":{"text":"Visiting New Orleans for a work event and stopped in for dinner at Desire. I've dined here","useful":0,"cool":2},"XRywbpx3eBjYg0NSjNHVcQ":{"text":"Service was amazing and entertaining at the Oyster Bar. 5 seats and there were 5 of us. We","useful":0,"cool":0},"HHCIp3gkE11wmtwoCqApHg":{"text":"We had a great late lunch here.  The raw oysters were good, and their cocktail sauce was d","useful":0,"cool":0},"iXhbvkVC4_SyxBRMOrN6jQ":{"text":"Desire was soooo good! We found this spot because they're participating in New Orleans' Co","useful":0,"cool":0},"n-haQ7s31CsK7gDVSyPowA":{"text":"Unfortunately, I was not able to taste the food nor get a chance to sip on some fine water","useful":0,"cool":0},"0JR00TzQXf3UeS1RaE4siQ":{"text":"We ate here as our last dinner in New Orleans.  The saving grace was that it wasn't crazy ","useful":1,"cool":0},"0dgKl852pDNqk1e2W4JimA":{"text":"Had the chard oysters, alligator bites and the corn soup and bits of crab, Ooooo to the em","useful":0,"cool":0},"RYIFl94RaV43Nqaf9cH6dA":{"text":"We sat at the bar for 40 mins after we ordered with the staff, but no food was served. The","useful":0,"cool":0},"kH9S9Fn19cYfujCsCW8zjA":{"text":"Upon being seated at the bar for being informed about their dollar oyster happy hour and h","useful":0,"cool":0},"9R44VA73y_JOQgYhifJuLg":{"text":"Acacia was amazing!  The oysters were amazing as well! We will definitely be back! Walked ","useful":0,"cool":0},"tWWL_d78PKtWwm1NpSXf1g":{"text":"Desire was my favorite restaurant on Bourbon St.  the oyster bar is bomb.  The oysters gri","useful":0,"cool":0},"vtCk4Yognh5kXsY8hNacoQ":{"text":"Food was pretty tasty. I ordered the jumbalaya pasta and loved the spice & flavor. Couldn'","useful":0,"cool":0},"B5shbwyS7AFVEojUL7aYhA":{"text":"I was very excited to revisit Desire after a near decades long absence from visiting NOLA.","useful":0,"cool":0},"fWYnLrIBDkfpKYQwNCmynQ":{"text":"Trisch was a great waitress. My first hurricane on Burbon street was wonderful. Trisch sug","useful":0,"cool":0},"C7eGf5M9Hc0FQPnAtQc2fA":{"text":"Peel & eat shrimp was fantastic, good size portion. Ordered 1/2 lb but got more than that.","useful":0,"cool":0},"LePYjjo5MfnfHv0F3BYnBw":{"text":"Everything was good, but not spectacular. Price was a bit high, but figured that was due t","useful":0,"cool":0},"woTtat6acOIq0sqryIn51A":{"text":"I love this place so much - I come here every time I'm in New Orleans.\n\nThe service is gre","useful":2,"cool":0},"I3wIu7gJGIk619fgUXW4fQ":{"text":"Split decision here. For dinner I give them a 4.5. The grilled oysters, gumbo and the shri","useful":0,"cool":0},"zDLBIdIi51Ximhyqmdjy6g":{"text":"The gumbo here was amazing! The crab cakes FULL of meat and not a lot filler. I'm a VA gir","useful":1,"cool":1},"rwD_iv0T1tTi04gvrBjEiQ":{"text":"Everything was WAY. TOO. SALTY. I'm someone who likes my food heavily seasoned and with lo","useful":2,"cool":1},"Z2i-R5rXtrzw-pisHb6EbQ":{"text":"The food was yummy but the best part of it was the experience of having Frankie G as our s","useful":0,"cool":0},"OXlTzr9RPMyXTsjMpG92ag":{"text":"My husband came walking in here to try the char grilled oysters. We heard from so many peo","useful":0,"cool":0},"y7RI2OPJDl0yrzMREruQzg":{"text":"Had the chard oysters, alligator bites and the corn soup and bits of crab, Ooooo to the em","useful":0,"cool":0},"MsMuehSdGzmViH8befHhNQ":{"text":"I had my heart set out on trying Desire for some time now and I finally did on New Years. ","useful":4,"cool":3},"S270uctHNOQJ3yxscD-FYA":{"text":"If you are oyster love her you have to stop in and try this place . The oyster Rockefeller","useful":2,"cool":3},"T_7ZpKGsJN05etJL7zjmNg":{"text":"First time in New Orleans and I couldn't have asked for a better first impression! Went wi","useful":0,"cool":1},"e8NY2RBZszfP5LxhWF-s0Q":{"text":"We love to sit at a table by the windows, which are usually open, and people watch while w","useful":0,"cool":0},"x2Yx0sl4cDb2_SwHvnNdTg":{"text":"Slow with a capital S.  Came I. For breakfast before a seminar held in the Royal Sonestra.","useful":3,"cool":0},"jMsY5HPuUnV5JRwLZVfGTA":{"text":"Pretty good place ! Kinda expensive but overall great food\n\nI got a Bloody Mary and I didn","useful":0,"cool":0},"47nSmu2MZ0cIoRMmD2Vq2Q":{"text":"Stopped in after a friend recommended the place and I'm sure glad we did. The fish and pot","useful":0,"cool":0},"1vGC95Q8NC4qDLQ9V6v38w":{"text":"We have passed by Desire many times on many trips and have always said that we should eat ","useful":3,"cool":1},"IkCytrdxJEIXgQbQFlXsYQ":{"text":"I was in town for the Essence Festival, and we ended up at Desire because the line was too","useful":0,"cool":0},"JRSLDB28UzOCBtN-91CGDA":{"text":"EHHHH It was OKAY!! \n\nI will not complain about the level of tenure of the hostesses!! Yea","useful":3,"cool":0},"zQuCXHNHtoBqoV7D889mqQ":{"text":"Happy hour is the best!!!  The raw oysters are plump and fresh.  The char grilled with the","useful":0,"cool":0},"jb2fpwenPen1D_-tCq7smQ":{"text":"Decided to pop into this shop while walking on bourbon street. The place wasn't to packed,","useful":0,"cool":0},"J2dCZ4aHT2eYP-rowSkZvQ":{"text":"We stayed at the Royal Sonesta and the Desire Oyster Bar was next door if your looking for","useful":0,"cool":0},"0TOpOm2QPMdP0Tf5mKm32g":{"text":"Grilled oyster is def the best in French quarter. We tried several places including the li","useful":0,"cool":0},"rTrFtZHhbaJZaTSSWMmznA":{"text":"I can literally eat here 3 times a day. And that's what I did a few years ago during my fi","useful":0,"cool":0},"G0zmAYwy-S6vpG0fS5qT7Q":{"text":"I was visiting New Orleans for my birthday our uber driver gave us tips on what restaurant","useful":0,"cool":0},"rPuI01Fq8l_8JoEtXJwcCw":{"text":"Delish! Worth the wait! We enjoyed the chicken & waffles, shrimp pasta 3way w/red pepper s","useful":0,"cool":0},"QtV1hcUahPB92j7ZIadtpw":{"text":"We came into Desire's oyster bar and Gus was shucking oysters and was also our server.  Gu","useful":0,"cool":0},"y26vzN6AiXjHDIFlRJew_Q":{"text":"Disappointed. We will see how long my review lasts or if will even ever be posted. 6/2821 ","useful":0,"cool":0},"MbZlLsO_Q42ZrAxkccmgsQ":{"text":"We walked in and were sat within minutes. It took the waiter a few minutes to get our orde","useful":1,"cool":0},"iqQt7OUvzWzpywwIl1n51w":{"text":"Not just an oyster bar.  A delightfully friendly and bright location for breakfast.  When ","useful":2,"cool":1},"qXWT3qpZRruFsHZLlhh5sg":{"text":"The shrimp platter was good. As well as the oysters was good. I would go again. The servic","useful":0,"cool":0},"vUGs2zAICrs6sNb3W7oZ5Q":{"text":"Came in purely for happy hour oysters. Took a little bit to be seated and for a waiter to ","useful":2,"cool":1},"NswIwnNaP702BgttyelV-g":{"text":"I have to say that I was pretty excited for this place but was a little disappointed. The ","useful":0,"cool":0},"JBmlG7dcFb3jhfTF4o2XbQ":{"text":"Friend picked out this place so decided to come try it out. Ordered a half dozed baked oys","useful":7,"cool":7},"TnSsGYZcHNXDyZG0LsP_Eg":{"text":"Delicious! I had the Creole Trio and it was a great choice.  I didn't think I would enjoy ","useful":0,"cool":1},"RO9SaM5LTFBegxw7GJqNzw":{"text":"Nice place, not sure I ordered the best items. Had Gumbo to start, it was ok, not very mem","useful":1,"cool":0},"szUuVqNYm2rdonKGOGIugQ":{"text":"I'm The shrimp and grits were not even enough to stomach. Had a metal taste to them... was","useful":0,"cool":0},"ehMX1j1UM_Z6RwCHYuBmsA":{"text":"Went to New Orleans for Jazzfest and stumbled upon this restaurant while exploring Bourbon","useful":1,"cool":2},"4-Z2A94ihyAruXvDqf0Q1Q":{"text":"Definitely a solid four. Service was outstanding. Restaurant closely here to covid-19 safe","useful":0,"cool":0},"F55HDaE_OodsobRDUHq9Rw":{"text":"So as many stars as this place has it was horrible. Seems the entire New Orleans is unders","useful":0,"cool":0},"e7cdcwgxK6m223PMUowDCw":{"text":"The food was bland, but the server Danny made it bearable, he exceeded expectations.  The ","useful":2,"cool":0},"80H1MlOKPwBb9tTBlZVs_g":{"text":"Food was good. Worst service ever. Once we were seated we sat there for 20+ minutes before","useful":0,"cool":0},"z49cuQBmv3pZfRLMdi8jcw":{"text":"This was our first time in New Orleans and first place we ate. Just choose this because we","useful":0,"cool":0},"fqtixcuwyDP8yTWhVjbMcQ":{"text":"We made reservations for 6:30 PM and waited till 7:15 to be seated.  What are reservations","useful":0,"cool":0},"6JjOQDg_DqECauvhhr-f-g":{"text":"I will not give a bad review for a long wait.  I was very disappointed that our group of 4","useful":0,"cool":0},"gGmh2LkePHjNnroHoiA5Dg":{"text":"Being from Miami moving here is a big difference. I'm always trying to find new things bes","useful":0,"cool":0},"i9INVR6D4qj5RsD-dK2aUQ":{"text":"I was here thrice since it was right outside our hotel but my last meal was the shrimp po-","useful":0,"cool":0},"L1aX_5ahGleYlXO0KieDSg":{"text":"This place is insanely popular, so I didn't expect much.  I arrived on a red eye flight th","useful":1,"cool":1},"r993rBK6I_UbNlzdCDW8Hg":{"text":"I came here around 11PM one night to absorb the Hand Grenade that was coursing through me.","useful":0,"cool":0},"IVqExlo3mG2pEVD7-KJlqg":{"text":"The only complaint I have about this place is that the BBQ sausce they use for their BBQ s","useful":0,"cool":1},"WbVQsjzmJTlsb29Z6vKRxg":{"text":"In the midst of all the Mardi Gras madness, we stumbled upon this place because I was star","useful":0,"cool":0},"UeCRhULgyoc6cy5nCoBH5Q":{"text":"We sat at the bar and Michelle was our bartender. Ok, so at first no one pays you much att","useful":3,"cool":1},"AjlMrIOYuzNZMQivsdYLpQ":{"text":"Devis is amazing!! He is so attentive and friendly. The shrimp and grits were to die for!!","useful":0,"cool":0},"NvZY_qpu3s07-u6ebwmh4w":{"text":"Our evening started off with a disaster at another restaurant so we decided to try Desire ","useful":2,"cool":0},"Vrw4D9pKyDpnF4pXYGqxvg":{"text":"Our first stop for New Orleans cuisine! Ordered the alligator bites to start and they were","useful":0,"cool":0},"0mPh-rTO_65OVzq6Lt0Dsg":{"text":"Good stop on bourbon to get your oyster fix. Our food came out quick, but the staff seemed","useful":1,"cool":1},"dROoOTL5il1KeJsexkJOHQ":{"text":"alright food, pretty basic and nothing new. the seafood gumbo was good, but i've had bette","useful":0,"cool":0},"HdufnkL1RmgA3AUvyS7p3Q":{"text":"This quality of food and service borders on disrespectful. Avoid if you can. Had charbroil","useful":0,"cool":0},"odigouqUi8FGK-P0oKp0UQ":{"text":"This was the very first restaurant we stopped at when we arrived in New Orleans and it was","useful":0,"cool":0},"NM6nAft7W1dfZySLmaBmbg":{"text":"Happy Hour. One dollar oysters. Charbroiled in a garlic butter sauce that'll have you sopp","useful":0,"cool":0},"cRL0NnTKrDQylhk5s5_YAA":{"text":"My husband and I went early on a Friday night, and it was a little loud/crowded. This woul","useful":0,"cool":0},"ji_eZVPOEnzhMv447K1HHg":{"text":"What a pleasant surprise!  I am usually leery of hotel establishments and this is also loc","useful":0,"cool":0},"0snsxEWaJIN3U7jvFyhHfA":{"text":"Oysters are pretty subpar here and price is still high. I'd go to other oyster houses for ","useful":1,"cool":1},"ztevoAM3xz-CwcUwcnK2Ag":{"text":"Food was delicious! We also had catfish yummy! Gotta try this place food was served hot.","useful":0,"cool":0},"grNph-lXlpMoqqQeQHJ3eA":{"text":"I can only give them a three star because half of my meal was terrible. The gumbo, very or","useful":0,"cool":0},"gvisUSi5yQyHCNRJsEr3Vw":{"text":"I have mixed feelings about this place, great location right on bourbon street, beautiful ","useful":18,"cool":6},"TIjUwgk401SQk6RHB21hNQ":{"text":"Tried Desire for the second time despite a similar previous experience and because we love","useful":0,"cool":0},"TGcssBogQSZiheK2BygSvA":{"text":"Desire is a 3-4 star restaurant. The food is good and service is good. For what it is, it'","useful":0,"cool":0},"8Jd8aV1HeyUM8_QXocEpxw":{"text":"Had dinner here with a coworker and it was just that, meh.\nWe had to wait in line a bit, b","useful":3,"cool":2},"wm7YB1-52AP0XxLubqfeZA":{"text":"We stayed at the Royal Sonesta Hotel and Desire is part of that establishment, though it l","useful":2,"cool":1},"eDxJI0bIWXx-ylt9rt1Aqw":{"text":"On my way into the bathroom I slipped in and fell into another diner's vomit.  I just got ","useful":0,"cool":0},"__8tA8KprzZT4AjaDYnX9A":{"text":"The breakfast was amazing! There were only a few of us patrons in here on an early Wednesd","useful":0,"cool":0},"QPpkS0ao5HgElZOyv1GQiw":{"text":"Waited for 30 mins . It was busy inside and waited another 30-40 mins to get my food. I go","useful":0,"cool":0},"DAwCBKd_uHjTczxolKXUUg":{"text":"I stopped by here twice for work lunches since I was actually in the hotel nearby. I had t","useful":1,"cool":1},"Iwjl4n_Hf3BUIOQgKJnlkg":{"text":"This restaurant has mixed reviews. I think it always depends on whose cooking. I enjoyed m","useful":0,"cool":0},"tn21NYUjlhHw2R3VrET2Rg":{"text":"We ate breakfast and it was amazing. The staff is very friendly. This restaurant is also c","useful":0,"cool":0},"CRRa9oz6ALqG6ruJMsFYfg":{"text":"Hands down the best hurricane we had in the entire area. Our server, Kentrell, was the abs","useful":0,"cool":0},"lzSbPcqoj4nCIPADg9hylA":{"text":"Just so happened to stubble by the place after other highly rated restaurants were packed ","useful":0,"cool":0},"AGSJzcqlWLwftn9WSRtp1A":{"text":"In the midst of boisterous Bourbon Street during a free wheelin' Southern Decadence weeken","useful":4,"cool":5},"fTwHtWb-UQfMZ38wQMuA0A":{"text":"The charbroiled oysters were good! It was little grit and lotta juice!!  I will return!","useful":0,"cool":0},"VD5kxHPjm1YSHbyGkg65cA":{"text":"Everything here was delicious. Wanted to get more. This beautiful restaurant is right off ","useful":2,"cool":0},"BtOaJNBkOxYFDhP9EOv7nw":{"text":"Now this place has always been worth a stop on Bourbon Street for me...it's in the Royal S","useful":2,"cool":1},"G4KhWrxvKqaqrk0tU63FUA":{"text":"We had a late lunch here.  The staff is super friendly and accommodating. I had the shrimp","useful":0,"cool":0},"vOCsRL0QqqyoJu_ITqKRjA":{"text":"This is the best restaurant in New Orleans hands down! I love this place. I visited New Or","useful":0,"cool":0},"fNsFWJR33eJqasXV8BfqAw":{"text":"3 stars for service because there were only two servers tonight and they seemed frantic. I","useful":0,"cool":0},"KL1OBIr96HLduiPOiCNiTQ":{"text":"Happy Hour is a must! My table alone, ate 4 dozen oysters! The drinks were outstanding and","useful":0,"cool":0},"Nj3gGYjALdaSM_odMseW-A":{"text":"Biscuits & gravy was awesome.  Jambalaya skillet was so-so. Service was mediocre at best. ","useful":0,"cool":0},"HDVi9PeiutkDa-zovdr5jA":{"text":"I loved it. So much so we went back for a snack later after we had dinner.  \n\nThe food was","useful":1,"cool":0},"yFj_2JVEW59_tLWv-76hwQ":{"text":"Poor service.  Waitress unwilling to ask cook to chase grill or broil oysters with no chee","useful":0,"cool":0},"vFaVf0i_E9GuF3CnttIGCA":{"text":"I was wandering around the Quarter, looking for something satisfying for dinner.  I looked","useful":2,"cool":0},"lG1KVvCctg58eWOQaa18Nw":{"text":"Barbecued oyster are off the hook!\n\nBarbecued shrimp is awesome, get lots of bread to soak","useful":1,"cool":2},"DpMZ8eJ1rQwA7g-BRo34VQ":{"text":"The absolute best dinner in Nola I had. First night, blown away completely. And I even had","useful":2,"cool":0},"J3RpcBOdkxUJK25bjfIxhA":{"text":"Had the chargrilled oysters.  They were a little salty.  The étouffée was good but not as ","useful":0,"cool":0},"C5yTFczexY0zm3jpsoXwMQ":{"text":"Terrible service. I stood at the bar (empty) for more than 15 minutes and didn't get anyon","useful":0,"cool":0},"hFZ8xaexC54v3a3JTlTCow":{"text":"Came for breakfast twice during our visit! Hubby got the bananas foster French toast, said","useful":0,"cool":0},"w8VgpbDoAEhQGFnUzLJ8OQ":{"text":"Oyster review: I came just with the intention to try their charbroiled oysters... it hit t","useful":5,"cool":6},"0JiTAQZfz-F3Dhb0pnrfDA":{"text":"This restaurant was only about a 5 minute wait and the Charbroiled oysters were the bomb!!","useful":0,"cool":0},"cLg9UDtBogQ263EFXxdG-Q":{"text":"I've been here twice in 2 days and Frankie Jean at the oyster bar has been a true delight!","useful":0,"cool":0},"yPtE7XoDf0vP-lhlpmcLgg":{"text":"Although a majority of the food and coffee were simply mediocre, I enjoyed the breakfast p","useful":1,"cool":1},"WunCgLMKA4JC_hLfNOkAxA":{"text":"Omg I loved desire oyster bar and let me tell you why....\n1) best char oysters I had a Nol","useful":0,"cool":0},"pbm1vPvlDM9RAA3edOMoew":{"text":"Just finished chargrilled oysters at Desire happy hour. They were highly encouraged by the","useful":0,"cool":0},"4YNJrwm94z6NCIaEt52ilw":{"text":"Nothing here exceeded expectations. The chicken and waffles were good. As was the jumbylay","useful":0,"cool":0},"bg9S6LSLHLwDcHmO-kLlpQ":{"text":"I just couldn't break through this terrible writer's block until I started staring at a ph","useful":20,"cool":20},"Kh66SG0sr65q1Jh4CXvFBQ":{"text":"Fantastic place for breakfast \nGreat service from Robert and he was very helpful with dire","useful":0,"cool":0},"fC1rTDeSpJ2CG-XYbqq4Jg":{"text":"PERFECT MAHOGANY ROUX: the creole gumbo is delicious and packs some heat.\n\nRAUCOUS VIEUX C","useful":4,"cool":5}}