{"NSOaQKbBNYZtlrCF6yRu_w":{"text":"To be honest, I don't find myself at this Office Depot often but I was in a rush recently ","useful":4,"cool":4},"PNRq7kkegYN0wM8ACpE_HQ":{"text":"I am taking several on line classes and I ran out of ink in my printer, so I took a trip t","useful":1,"cool":0},"8pSs_4SLJTobccYhliF9kA":{"text":"UNBELIEVABLY I got terrible service at one Office Depot by still needed supplies so I went","useful":0,"cool":0},"YdLb4pYMLKHkus1Mv8Hp7Q":{"text":"Like other Yelpers I wish there was a minus star classification. Ordered a moderately pric","useful":6,"cool":1},"rqYVhdlbYL3Zgzxy1RB4Yg":{"text":"Go elsewhere if you need a print job done. The staff are polite, but completely incompeten","useful":0,"cool":0},"PwW9cKkSeBRtnsWoAH6Qxg":{"text":"Wide selection of products  and it is always good to catch a sale for something you need. ","useful":3,"cool":1},"xP5xAUdlmxmqCAwzkdetmA":{"text":"Well, the customer service has greatly improved! Everyone is smiling and eager to assist y","useful":2,"cool":1},"fYXodwBgy88_4RqGAX-BFQ":{"text":"Woo Office Products...OK they're kind of boring but necessary. This store is small but has","useful":4,"cool":2},"1IOaQ8QcfGN5AFUw2z7gxw":{"text":"Shopping in the time of coronavirus: everyone had masks, shields to protect the cashiers, ","useful":0,"cool":0},"HSFIUb2Ay-7j57ZngXtqhQ":{"text":"It sure seems that I have been visiting this Office Depot quite frequently in the past few","useful":2,"cool":1},"wXRKFenHRUyPgHH3EFPMkA":{"text":"Super sweet employees!  The manager went out of his way to help, despite being busy!\nPlent","useful":1,"cool":0},"DT_qsR3FlkU77CBvI4nFSw":{"text":"Okay Office Depot I grudgingly accept you, but I certainly do not love you.  Yes, you have","useful":2,"cool":0},"zqmFEEJ3JIawDzyEWCSuJA":{"text":"The main reason I'm giving 5 stars is because of Ms. Terry. She helped me with a huge prin","useful":0,"cool":0},"ZTeWFabYoq7KDn-BEt8WhQ":{"text":"...on Lundi Gras I forgot my memory card at my hotel in Metarie.\n...already parked I refus","useful":3,"cool":2},"bQRKygfU7j_XQ6Xz_py7LA":{"text":"I've definitely come across better OD's than this one. The technical staff are only somewh","useful":1,"cool":0},"xMUEoMzqbyFxEROl-lCjrQ":{"text":"There's no need for a long diatribe. Suffice it to say Office Depot HQ should come in to o","useful":1,"cool":1},"tPlwxwsI29NJGidPw0NbmQ":{"text":"Spoke with Tiffany over the phone. I needed replacement caster wheels for desk chair she w","useful":0,"cool":0},"loKeGeZHBDaVc12F6EuW4Q":{"text":"Just leaving the store. Was helped by two gentlemen. Went in to get a chair and purchased ","useful":0,"cool":0},"ZxZrphTq33k0_xfNgmuTfw":{"text":"Popped in for flash drive.  Not sure how these places stay in business, but I'm glad they'","useful":14,"cool":9},"v4_PbSVNPVmFGCy097i_vQ":{"text":"I order online and pickup my supplies at this location, less hassle than having to wait in","useful":1,"cool":0}}