{"QgJuZuFEEVnKmtv8AKSBpA":{"text":"Ok spot for An inexpensive breakfast, we had a western omelette with hash browns.  It was ","useful":0,"cool":0},"g96SUTd9QQ6_YXQUIIoArQ":{"text":"This place is great - I've stopped in a few times over the years. It's a cozy diner open 2","useful":0,"cool":0},"6tMCbJ-EcwVd6yM8hZoOSA":{"text":"Great Breakfast Spot. Nice to go to the stemless meant that cares about its patrons. James","useful":0,"cool":0},"79dpi6fVUiSk0ew22BvjsA":{"text":"Good food.  The staff was great.  The pork chop and waffle was great. A must eat place.","useful":0,"cool":0},"wR65hRnM_sR1efSh4l9g6g":{"text":"Had this been a review for my previous visits (4+ yrs ago), it would have been 5 stars off","useful":0,"cool":0},"wsYKdsGci__3iaznTlq-cA":{"text":"Do you know what I want with my grilled cheese sammy?  I want dancing.  Lots of dancing.  ","useful":2,"cool":1},"99a6SL1QYsgou8iU85Tw0A":{"text":"The World's Best Burger. Said so on the outside of it so after partying at La Fritte and h","useful":1,"cool":1},"Y26mexanFq5CZlOnbJGoAg":{"text":"When you're drunk and need eggs (which let's face it, everybody in that area is drunk and ","useful":0,"cool":0},"zCHIC9raFZ58ziCAU4Lz-g":{"text":"In the center of the French quarter you will find this greasy spoon/diner.   There is not ","useful":1,"cool":0},"xLGVMxII0PY1ttubel2G5A":{"text":"best late night eats.  cook poured melted butter on my waffle before serving.  No need for","useful":0,"cool":0},"DZG84ok43a8KApPSeB0S1g":{"text":"Very small with rude and inattentive waiters. Waiter took our orders and finally after abo","useful":0,"cool":0},"Xzng6Bq9IcSiILbqA16Saw":{"text":"Food ok! Service is terrible! Not too sure what the fanfare is all about! Guy in his under","useful":1,"cool":0},"6eWkIo-s_6X1pWalEF9q9w":{"text":"DON'T WASTE YOUR TIME, OR MONEY - I went to Clover Grill a few times (before Katrina), and","useful":0,"cool":0},"Ear2SEeMsJbLpHw0_HWKNg":{"text":"OMG! They are not lying worlds best burger! This thing is a huge ball of perfectly seasone","useful":0,"cool":0},"sEGPoB79emscFvh0qv-8qg":{"text":"Late night eating there is good!  Had a great burger and fries, and took home great biscui","useful":0,"cool":0},"ZBqt698d-pg0kj3KTxg2XA":{"text":"I would give no stars if I could. If you want people to laugh at after a night out then yo","useful":2,"cool":1},"rbBscDKeKZXqvEVpY2RVbA":{"text":"Basic, inexpensive diner food. It's quite good if you keep your expectations at 'reasonabl","useful":1,"cool":0},"S6V0NOxsKTaR07WDPsMsAw":{"text":"I spent most the early 90's eating here at least once a week. The food is typical greasy s","useful":1,"cool":1},"jX52sZoojxyYV2viWNyO7A":{"text":"The best of the 'gay' cuisine. Better than average diner grub and, if Miss Earl is working","useful":1,"cool":1},"02ImKiEhk536CDAocg8rhA":{"text":"Someone said this is a must-see on bourbon street...I don't think so.  Too crowded, nothin","useful":0,"cool":0},"jaT7vdjAPXg1ycOto_SW_Q":{"text":"Clover is the sister (heh) of another French Quarter diner that's not overtly homosexual, ","useful":0,"cool":0},"SiI23BkvDQd4oSMh0yODyw":{"text":"I'd like to tell you something good about this place, so let me tell you it's in the lovel","useful":1,"cool":0},"qMqRI1ilAuarFVI3vZUfQw":{"text":"I have never been to Clover grill in the day but some friends of mine were interested in g","useful":2,"cool":1},"MB3e9hvVdg7QF_vfQF0GQg":{"text":"People that work here are racist and wouldn't let me and my black friend eat here. Do not ","useful":2,"cool":0},"kMubHNuX6boSpv8TvzmZIQ":{"text":"Great location & cheap, below avg service. Highly recommend omelet (sooo fluffy) & waffle ","useful":0,"cool":0},"bnU6hKJbHBoMFsp4u99mUg":{"text":"My wife and I ate here on a trip to New Orleans.  We both had cheeseburgers and they were ","useful":0,"cool":1},"_5Pqq6bvHe9yN6AKA0FrLA":{"text":"Loved this place!  Very family friendly. Super fun and friendly staff!  Recommend for fami","useful":0,"cool":0},"m-t-fz5q-b2k_5r6JJ8EGw":{"text":"Came here on a Friday afternoon It wasn't too crowded. I ordered a waffle. It was so delic","useful":0,"cool":0},"aSd8-hEJYA0HDfpF--bKcw":{"text":"Great food!\nTater tots, waffles, hash browns were wonderful.\nNot healthy, but wonderful.\nT","useful":0,"cool":0},"8B69ZQSd4wvgjaZKzom6lQ":{"text":"Their omelette is fluffy, airy and light, the best I have tried, and I am quite picky when","useful":0,"cool":0},"lzcXFa5aMf-Gjj0cO_t_AA":{"text":"Possibly the best deal in New Orleans! Burgers are no frills but the wait staff is friendl","useful":0,"cool":0},"QwKRMMStMjRCWDfBvUGihg":{"text":"Perfect comfort diner food that really didn't leave me wanting anything else.  It complete","useful":0,"cool":0},"ovuYfKve8alHkw-QKgRlZw":{"text":"Amazing. One of the best burgers I've ever had! Small little diner but service was great a","useful":0,"cool":0},"QtGRaqxB3F9d8c0KUZwddg":{"text":"We had a good time eating here. It's one of the few restaurants in the French Quarter open","useful":0,"cool":0},"ByudRnxg5tPCrjDlduWhnA":{"text":"Good food that's reasonably priced.  The burger was delicious and service was good. Only n","useful":0,"cool":0},"mRuHu4PLfSaAuLatSeHJRg":{"text":"bourbon and dumaine.  you just have to remember that when you're drunk and hungry and all ","useful":1,"cool":2},"R2vovVkldRB-PgUZ03i8Ow":{"text":"Stopped for breakfast. The omelets are huge. Food is delicious. People are friendly and th","useful":0,"cool":0},"9KiOC7sshhxahS0EdI5Abg":{"text":"One of the most dissatisfied experience I have ever had in a burger place, which is americ","useful":6,"cool":2},"mo30pKkUk1e4vj76J3RotA":{"text":"The burgers are SO GOOD. Good in the way only burgers can get when cooked on a well season","useful":0,"cool":0},"-kh2syMx_WRJu3GZRs7Tqw":{"text":"Great grease burgers small spot.......don't be alarmed the food is good... get the burger ","useful":0,"cool":0},"sgXef3b3Ty3buF_OdCZNZw":{"text":"Tried twice, didn't even eat there.  Worst customer service ever!  The first night the wai","useful":2,"cool":0},"anE1jc2dVnHSIw16ry09bg":{"text":"Take a chance if you want. This review will not make a difference because of there locatio","useful":1,"cool":0},"tSsrLpGTBjKlCDf_cnogOA":{"text":"Small place but has a cozy, diner feel. Had a burger that tasted really good. Server forgo","useful":0,"cool":0},"N_a8NoxVdf8c6zTzFX1vBw":{"text":"This is a tiny place with overworked servers. They are on the verge of being rude - like F","useful":0,"cool":0},"EfoZm4ee1mUtANAk-jWjag":{"text":"I wanted to like this place when we stepped in and it was a small little diner. The food w","useful":2,"cool":1},"nt_DkAUBW-kxaZDpUC-0Vg":{"text":"The food? Just ok. I mean, c'mon, it is diner fare. It serves it's purpose, filling you up","useful":0,"cool":0},"Ucw-ue9pKX6R0fKzv7VhGQ":{"text":"Great burger and onion rings ! The meat patty was really thick and tender. The service gre","useful":0,"cool":0},"ZQ8-Z0cRv09kX-nATV5Bmw":{"text":"Late night burgers with entertainment.  The food is really quite good, as you get served u","useful":0,"cool":0},"N_LGJ_VgQ7e-JUTGppV0lw":{"text":"Out of the maybe 15/16 restaurants we ate at during our week in NOLA, this had to have bee","useful":1,"cool":0},"ByrhPCNWC3kU7nV5LP1s7A":{"text":"I have been there drunk...Amazing....\nI have been there sober...not so much.\n\nGot the chic","useful":0,"cool":0},"-c-rRKebrkKbCCjgD-GZ9A":{"text":"The greasy spoon to end all greasy spoons! This place is the BEST. 24-hour breakfast servi","useful":0,"cool":0},"X0YF6TE2TJCMxCPSS9JNbg":{"text":"I am not big on red meat but this is a GREAT place for a burger...affordable, quick, nice ","useful":1,"cool":0},"zcMQFmQXFHjw3pZ6QVfXSw":{"text":"Great atmosphere! Mediocre food. I loved the service (a bitchy queen in a greasy apron who","useful":0,"cool":0},"kqKU0UtIQy6m8WYfNo8rJw":{"text":"what a burger!   nothing special about this place except it cures the burger craving.  fri","useful":0,"cool":0},"ucdWnQeEs-uvRkwYU8wB0A":{"text":"A good late night, food stop. Fresh off the grill, diner food. Open menu all the time. Lov","useful":1,"cool":1},"LTPZBb9-iwRlH693V1Fe_Q":{"text":"Clover Grill has been one of my favorite late night haunts since I was in college and drin","useful":0,"cool":0},"EqYi-oBTkh-xf1kNww1AgA":{"text":"So, yes. My girlfriends and I were led here by a local when searching for late night eats.","useful":0,"cool":0},"MMfcLwte7AIAsReLLrznow":{"text":"Came here for a quick bite. We ate at the counter overlooking the cooking area. Our server","useful":0,"cool":0},"Q8u3b-7BwHqPd5K_aPiIzw":{"text":"It is disappointing to see this NOLA institution continually to decline. What use to be th","useful":0,"cool":0},"eXSC3n9-mqSpEc9_wVkGXA":{"text":"Best late night goth, greaser punk greasy spoon","useful":0,"cool":0},"x2IIZfzWe68CAZr0GeIKyg":{"text":"OMG!! Such a cute little burger house!!! Open, and running 24/7!!!! A good menu, with food","useful":1,"cool":1},"zwWDo-pEgTh4r0Cmn5EsNQ":{"text":"Breakfast was ok, much like Waffle House. However the place was really dirty on a Sunday m","useful":0,"cool":0},"LCTrhBdta3Z08tNgObAAjA":{"text":"Been to this place three times with no issues, but the third time was Wack. I wasn't feeli","useful":0,"cool":0},"A5WTMJCDiDZvu85OqxTv_w":{"text":"There are few places to visit on bourbon street that are actually worth while. I was skept","useful":0,"cool":0},"xFNP-TDUsXH5tZMl-t9qIg":{"text":"You have to love the Clover Grill. It's the law. After way too many drinks, or if you're n","useful":0,"cool":0},"saJh-WUyY9mAhW9vlBKBbQ":{"text":"Stopped in for breakfast and from the second we walked in we loved this place.  Warm welco","useful":0,"cool":0},"N7EoNWz_bjhvSEtMAVr8IA":{"text":"Like many other places in New Orleans, service is the absolute last priority. Guy there is","useful":3,"cool":3},"OSAHYWugmJh_TNLhwKxkaA":{"text":"the place is a dump. the staff is rude.\nwe got accused of leaving without paying when we s","useful":1,"cool":0},"Atv0jqA0VCHI9uyLyXKShQ":{"text":"Small diner, might be a short wait BUT food and service are great. Had breakfast. Waiter w","useful":1,"cool":0},"L6UiqS_s3FzSGE-QxjF0SA":{"text":"I am the kind of person who uncontrollably laughs during situations that are so beyond awf","useful":0,"cool":0},"IwSlSqwZCm-9tBL_wWQFrQ":{"text":"I came here to get fortified on a hot day after a night of drinking (and in preparation of","useful":0,"cool":1},"malQOzZtyOGLhdfB8C_0Xw":{"text":"The service is slow. The cleanliness is questionable. The food is not very good at all. \n\n","useful":5,"cool":0},"PZDPYoSh5jfm3nhLu3OZTw":{"text":"This is the perfect spot to stop on your way home after partying on Bourbon St! We enjoyed","useful":0,"cool":0},"YB4PKXrPc2sJq85ZQG2Llg":{"text":"Let me begin by putting this review into perspective: The Clover Grill is typically not th","useful":0,"cool":0},"jsP9074RMc-9Ts_0DqDuTA":{"text":"Good hamburgers cooked under a hubcap and I love the tater tots BUT hate their idea of ser","useful":3,"cool":2},"AIaI0xDGIEQbL8N-GNl_7g":{"text":"Stupid people serving stupid food...have some class, go anywhere else. This place is filth","useful":0,"cool":0},"onaUGr9sXaLVZgPmEAUbug":{"text":"I came in with my friend. I tried some of this delicious breakfast food and even though I ","useful":1,"cool":1},"Kb2uOquhZ0_RwkmApPCY-g":{"text":"Found Clover Grill when I asked the Breakfast server at my Hotel who had the best Grits. S","useful":0,"cool":0},"GJZP-Y5S5a_EFCNRod9Mwg":{"text":"Cool little corner spot at the end if bourbon street out of the mess.  Diner style with a ","useful":0,"cool":0},"vPdjWE3ANH2AJqQbk33jxg":{"text":"Will NEVER go back again! I have been here several times in the past and had a pleasant ti","useful":0,"cool":0},"lZDn5t1-LKW3eq8RKteNSA":{"text":"I heart the C-Lover Grille.\n\nNothing beats a cheeseburger with a side of grits. In fact, I","useful":0,"cool":0},"_SaLPRkFR34eIVVkvGqiwQ":{"text":"Just had breakfast here. 8:30 on a Friday morning. I must admit I went with some trepidati","useful":2,"cool":1},"jGNY2RXpMuZEafLn2RcHxA":{"text":"I thought this was my kind of greasy spoon, but after giving a 2nd chance I won't be going","useful":0,"cool":0},"YeZhCSDWHbbx5HQlLwyCeg":{"text":"The diner is small and cozy. We had a group of 10 and we took up half of the establishment","useful":0,"cool":0},"8guzluJZeXpJ7DwJTXWumQ":{"text":"I had noticed this place a few times when I was in town for Decadence last year, but never","useful":1,"cool":0},"x9IMf93Ddu_wEX5MKl5ckg":{"text":"Unfortunately, the last dining experience at Clover Grill was very disappointing. I think ","useful":1,"cool":0},"S9nJYNwHdH7CoubpHqtkWw":{"text":"Omelets and hash browns are so good.  Great greasy spoon diner.  If you are straight,  be ","useful":0,"cool":0},"K0p10ASZO9NzDiBEeCdJUw":{"text":"Oh Clover Grill, how I love you. You big, greasy, gay, delicious hunk of awesome. Their ch","useful":0,"cool":0},"NwmKbLiSnUROrmuTr0S9Mw":{"text":"Clover Grill is one of those places that your friend who makes Bourbon Street a habit duri","useful":4,"cool":2},"xhwYcN9KWJkxF3hNEoxMDg":{"text":"That's one delicious omelette.                \n\nBut lordy is it buttery.                \n\n","useful":0,"cool":0},"bkbfXKHcStN16SbwSa8zHQ":{"text":"Small whole in the wall cafe with fantastic tasty food! Great wait staff. Just smith was w","useful":0,"cool":0},"Sg69CTS_BU67i6tdRgFXFw":{"text":"Tiny, greasy spoon on Bourbon Street with a simple, solid menu and friendly service at dec","useful":1,"cool":0},"6lgLwiL2Mk908_pPSVi_2Q":{"text":"I have not eaten here in 3 years, and it was one of a few places I had to eat at during my","useful":0,"cool":0},"Qb6HxoiA25YR-ux43ubaXw":{"text":"I am a cheeseburger LOVER and this was the greatest disappointment of my entire vacation t","useful":0,"cool":0},"8ZVSHMZaIwuV7Q6iY9rtTA":{"text":"Excellent greasy spoon diner with a very friendly personable staff. They cover breakfast t","useful":1,"cool":1},"sx3MZekgOvBBRDCGWCrh1A":{"text":"Hole in the wall place. Food was decent, I had a club sandwich. The server was nice and at","useful":0,"cool":0},"75HdAP0XaZjJaDnzaL9kYA":{"text":"love this place used to be one of my favorite late night haunts before i got sober in aa","useful":0,"cool":0},"NpdM_DKy9Udac846aifTSA":{"text":"Love this little joint. Anytime I can have a cheeseburger that was cooked under a 1971 For","useful":0,"cool":0},"tYSW-APatt2P__q45MXDKA":{"text":"Small corner grill with just a couple tables.  Excellent biscuits and gravy.  The grits we","useful":0,"cool":0},"amyww3xKbwk4DZvejCrqow":{"text":"Food was great. Eggs were cooked perfectly. Chicken fried steak was delicious. The hash br","useful":1,"cool":0},"ZYOAMOibzAwB2nkvsEjO1A":{"text":"Clover Grill breakfast and burgers are the best. The food is always consistent and the coo","useful":1,"cool":0},"xAUEZ17qD2-1HlpkLdiZJw":{"text":"Look, I love old diners as much as the next guy.  And I enjoy a bit of hyperbole as well, ","useful":0,"cool":0},"Tsh9ka72ksQI30YrT0VZrg":{"text":"Happened upon Clover Grill one night exploring Burbon Street. Very small space with limite","useful":0,"cool":0},"xUtnyyYujcn_boUfy4ASmg":{"text":"When it comes to diner food it does not get better than this.  They have all the tradition","useful":0,"cool":0},"W9Xp0M9PZMxEhnq3O3Oe_g":{"text":"Clover grill serves up greasy late night plates of disappointment. \n\nI have sympathy for s","useful":0,"cool":0},"P_EKlY_Xkm8btTRC03rQ2w":{"text":"The breakfast was awesome! They know how to cook over medium eggs!! Crispy bacon, great wa","useful":0,"cool":0},"YuPneHIGMZmstkt6bIWeWA":{"text":"In times past, The Clover was never about the quality of the food necessarily but rather i","useful":1,"cool":0},"bPpZFYEeq_tw5t75xbgxSg":{"text":"Get drunk on Frenchman St. then head here. Perfect place to eat at the end of a long night","useful":1,"cool":0},"ULdPjlJmdjjnJv3i-vYgMA":{"text":"We took FOREVER to decide on dinner and saw this place. I remember the recommendation from","useful":1,"cool":0},"V71mGK5FwnlTIP-LcjYILQ":{"text":"Don't come if you're looking for fancy dining but if you want the best breakfast in New Or","useful":0,"cool":0},"UdXUDVJ9nfgiU6SPU_On0w":{"text":"Great little cafe, just down far enough on Bourbon street to not have all the tourists. Gr","useful":0,"cool":0},"dhWccaqqBErm-AtYBH2q2Q":{"text":"While I'm sure working here isn't the easiest thing in the world, the service usually rang","useful":1,"cool":0},"Cjujij7-5iMJfHrElwtNXQ":{"text":"got here early for breakfast 8 am on monday. place was empty. had eggs- swimming in grease","useful":0,"cool":0},"xWF0bc4Nm01LOgUNufWE5A":{"text":"No frills 24 hour diner on Bourbon St. Perfect afterhours food stop to avoid a hangover th","useful":0,"cool":0},"wgtFqw-rh7C7osIW_3yfUw":{"text":"Great local diner, fun, classic diner food.","useful":0,"cool":0},"HkEsmkeJfGFCyr-My50u1g":{"text":"While walking around the French Quarter on my first day in the Big Easy I started to get h","useful":1,"cool":0},"0H8nmXDLTSnDJQ7o-d-mUA":{"text":"It's not bad food, but it's not great. Kind of like the waffle house for burgers. But it's","useful":0,"cool":0},"oiCKpMBMyL8nkS6Fr-XQpQ":{"text":"This place is awesome! The staff is a little slow to serve you but it was worth the wait, ","useful":0,"cool":0},"sRiCZfBvZBdVAs5C7X3WqQ":{"text":"Always open is the main draw. Also the old school appearance of the place. The employees w","useful":1,"cool":0},"VdwOxLKC6UGh-otXWU63NA":{"text":"Typical greasy spoon diner. Small but good atmosphere. The food is a tad expensive for wha","useful":0,"cool":0},"qL5DiJez4PLWd4eZ20l08A":{"text":"Never been disappointed in the food here. I absolutely love the entire menu and they add a","useful":0,"cool":0},"9vkxJNKt3QXxgIzPqCIiMw":{"text":"I'm a burger guy and this burger is hands down the perfect meal. First of all it's a huge ","useful":0,"cool":0},"oQA1YdM5OnpwzFfOJy9TVw":{"text":"Clover grill is a staple for late night breakfast. This time there I only got to go there ","useful":0,"cool":0},"_RTf6JundcmKJ-MqANdOEg":{"text":"Service here isn't great but hey its the Quarter.  The burgers on the other hand kick ass.","useful":0,"cool":0},"b4kG9wU7ACQI_9UNHfFX6Q":{"text":"They need to get over themselves. Is good  late night I'm drunk food, but not great, even ","useful":0,"cool":0},"ggrnV1Ui7yOdKoAfLIyrhQ":{"text":"I feel like if you're gonna talk shit about your patrons you should probably work in an es","useful":0,"cool":0},"xKARomqAoI2BoPgWs9zdCw":{"text":"Crispy grilled cheese. BLT w/ tons of mayo dripping out the sides. Banana cream pie -- YUM","useful":0,"cool":0},"0mXQA8Q3g11tKdWEIg2aLA":{"text":"This is THE place to go after a long night of drinking on Bourban or Frenchmen. When it's ","useful":1,"cool":0},"JFtd45KZNHRLkxX1DJMCCA":{"text":"Cheap, good, enthusiastic and friendly service. I went here for both post boozing burgers ","useful":0,"cool":0},"wfntJsel102TC5k3kzPKng":{"text":"Breakfast =Death by butter and grease.  \n\nMy wife and I only have 2.5 days to enjoy New Or","useful":0,"cool":0},"l76sulMajnzWHAxyUgKicw":{"text":"My original review was 4 star but I recently had a bad experience.  Actually, most of my e","useful":0,"cool":0},"UNoxmEiAOpkRXCIvxCEEtw":{"text":"One of the  worst places in the French Quarter. I have given them my late night business a","useful":1,"cool":0},"N0UjIwa1gql1HRKkmcn76A":{"text":"The absolutely most delicious LATE NIGHT burger, chili and grits I've ever had.  Say hi to","useful":0,"cool":0},"vIRL6LXATZteIOROajkQRg":{"text":"This place is perfect for those who just want a good ass meal at a great price. I came her","useful":0,"cool":0},"kCt--VIeZ-6RYFsG35VRjQ":{"text":"Stopped in for Breakfast one Friday mid-morning and had the biscuits and gravy with coffee","useful":0,"cool":0},"yVHjwfjhmz6wMIVlmC3wOw":{"text":"Do not eat here EVER. Worst meal in NOLA. Cheap tasting completely unseasoned burger patty","useful":0,"cool":0},"yheB4P0tIpZeizOHDA6klQ":{"text":"3 stars because the food was good, but there was only 1 waiter working and was a bit lost ","useful":0,"cool":0},"YuJTByfoTgTITnY1TuczWQ":{"text":"Great dinner food! Waitress was super nice, but the guy cooking was mean. He yelled at som","useful":0,"cool":0},"YMuRuiQoIH3CwyuZXfuPww":{"text":"Greasy spoon hangover heaven. This place puts Waffle House to shame. Old school diner comp","useful":2,"cool":0},"wtxu65C4j31Bgzyh0VcFjQ":{"text":"I feel I must lead with one overriding fact: this was the greasiest food I have ever tried","useful":2,"cool":2},"zMjhpdFDyTvZHLRpuAXZAw":{"text":"Service was quick since we were the only people in the restaurant. We went around 10:30 pm","useful":0,"cool":0},"OzivkxivrVLj0cNTlnSojw":{"text":"above average diner food. the omelet I consumed was good, but it wasn't worth calling home","useful":1,"cool":1},"Wddf_3vw7KUqB0TqW_O_4A":{"text":"This was a great place! A little hole in the wall, a ways down Bourbon, close to Lafitte's","useful":0,"cool":1},"5HVxS4EpOOEwOwphdhOKmQ":{"text":"Excellent place to stop by in the wee hours of the night for a drunk snack. Delicious food","useful":0,"cool":0},"Cdevx1Pv2bxhZx99Af_DuQ":{"text":"Delicious biscuits and gravy for 10am breakfast. The staff seemed a little slow and disgru","useful":1,"cool":1},"CGDpM3jSz-CWtr-zAjUYQQ":{"text":"Best handmade burger in town and the prices are reasonable!! They offer lots of diner item","useful":0,"cool":0},"GSNAsuwij5G5ulM84OOvOA":{"text":"Amazing food! Get an order of onion rings!!!\nThe burger and waffles are good too! \nNice an","useful":0,"cool":0},"GsCP2xtHaLE-y49JWP5lLg":{"text":"Best Cluster of raunchy Queen's ready to cook for you on the griddle. Get it like you want","useful":0,"cool":0},"Mof1pG_pXs9Ie3fgqproTQ":{"text":"Good greasy spoon diner, opened 24hrs. Small diner atmosphere with 3 man operation...1 coo","useful":0,"cool":0},"RmEeMhUnbv_kQIpWTkfLAA":{"text":"Honestly, very rude. I left so couldn't tell you much more then I walked in and asked for ","useful":1,"cool":0},"xztnsMA6h3WV0wCM9oI69A":{"text":"Stumbled upon this place after a tour guide recommended it. Food was pretty good, I ordere","useful":1,"cool":1},"nEaWQ0qMizamonXkjZIC4Q":{"text":"Great burgers, fast service and the staff is great. Made my friend and I laugh a lot. Cute","useful":0,"cool":0},"Ky3T_NXfiK4iW8X58L1X3A":{"text":"One of my must stops when NOLA...It's a true landmark and in my opinion once of the best g","useful":0,"cool":1},"In15xmJvF3KA7epwVZ67sA":{"text":"My gf is throwing up right now after eating here.  Food was turrrble.  Everything undercoo","useful":2,"cool":0},"w3nZqXBhcpS4RO__364GzQ":{"text":"Great breakfast, the cook that day was excellent. I can't say t much about the waiter he w","useful":0,"cool":0},"Q1XOr6BJT9HNMGtM29BwSg":{"text":"I hate to write a bad review but I've got too say this wasn't that good. I consumed more b","useful":0,"cool":0},"SETOX76sEXJlpfwZyDsKdA":{"text":"Great diner food!  Anything I've ever had there has made me head back for more.  If you li","useful":0,"cool":0},"nV8rnHmWyGNZnobrj0_aqg":{"text":"Loved the atmosphere! Great music, accompanied by a hilarious staff! By far my favorite di","useful":0,"cool":0},"NIopFhsDNO0_KDCvnGOScQ":{"text":"The Clover Grill is a must visit place in New Orleans. I just hate it that we didn't go un","useful":0,"cool":0},"QGT5VRtUcGGr42DpL_n5Hw":{"text":"Greasy burgers cooked under a hubcap, awesome fries, thick milkshakes, all served by some ","useful":0,"cool":0},"KintqXYpdhsmQ6ygnLw1yQ":{"text":"I'm going to start off with I DO NOT recommend this place to anybody. I left with warning ","useful":0,"cool":0},"IFCJoccbjMNK5dJ0O78cqA":{"text":"Hands down the best burger I've ever had!!!  \n\nBacon blue chess burger w/ mushrooms (YUM!)","useful":0,"cool":0},"QpP4gJZOQnbyryLwCU6Xwg":{"text":"Good food at good prices. I had a very good make-your-own omelette, I just wish the hash b","useful":0,"cool":0},"pNbZQsL0-uhyfcXp3rAz7g":{"text":"We went here because of the reviews about the pork chop. Thin and dry with bland grits swi","useful":0,"cool":0},"BYnwF4TaHFLevGiELj6aag":{"text":"This place is great.  We go here every time we're in New Orleans.   Hamburgers fried under","useful":0,"cool":0},"dagtVoADhE5yF-aoVBkIoA":{"text":"Nola is one of our favorite cities in the US and I just love love love the Clover Diner...","useful":0,"cool":0},"3La2vhy9s-8dzW-BG30rNg":{"text":"Greasy. Don't eat here unless you are drunk. Customer service? Mood driven at best. They d","useful":0,"cool":0},"Lo2Xj_ft--om61eZyaAN7w":{"text":"Greasy old diner style breakfast spot, appropriately open 24 hours on Bourbon Street. It's","useful":0,"cool":0},"GiR3dZwIqdSJK3ZMNvN1Xw":{"text":"There is something to be said for the inner workings of a small community place with a cou","useful":0,"cool":0},"6DGvKVQHw8XU2NWerEZ17Q":{"text":"Went to Clover Grill around 11am before catching a flight back home. Wasn't busy, we were ","useful":1,"cool":1},"CWSGzTW4xhK2_72nb3ZhtQ":{"text":"Whats not to love. The queens cooking the food. The cute little set up or the delicious fo","useful":1,"cool":0},"UYKMuM-XhHK67naFlUOgwQ":{"text":"Love it.   Never had bad food.  You know it's fresh off the grill... For hells sake you wa","useful":0,"cool":0},"zPnaPLk-6WK9w1ghEBvWnw":{"text":"Best Burger ever,I stumbled across the clover grill by and accident. My friend and i both ","useful":0,"cool":0},"NcyauImmZXnpzO3haetAlw":{"text":"The cooks here have turned greasy diner food into an art form. Perfect for late night eats","useful":0,"cool":0},"CJE81FGxt_10rKG3KY7fjQ":{"text":"Delicious burgers! Cooked under a hubcap! Hand dipped onion rings served extra crunchy and","useful":0,"cool":0},"u9qgpl3SoMA6oUG8X_fAdA":{"text":"We walked in, finding it hard to get breakfast on Memorial Day at 0900, and not expecting ","useful":1,"cool":0},"TJsJJ5V00A8ZsA3zPTJtUQ":{"text":"ridiculous-my first impression of New orleans was the three employees avoiding us and igno","useful":1,"cool":0},"mXgrG9ReGa230BpFi5bd2g":{"text":"If you're stumbling around the French Quarter late at night with a growling stomach, Clove","useful":1,"cool":1},"sffpJdM62u9yksU9FeePBA":{"text":"Pure awesomeness at clover grill. Burger was huge and very good, just the way I like it..","useful":0,"cool":0},"Le7_iO0J10V5LB6RankQFQ":{"text":"Amazing spot for some French fries or 3 am burger or hangover meal. Everyone seems to be f","useful":0,"cool":0},"MsQaDTSx7aj-PnXLS_W2_g":{"text":"Good Drunk food luv the staff. Quick and efficient but the place is small","useful":0,"cool":0},"iBMNuWAsV5tfNqeDosYQnQ":{"text":"A good place for cheap late night food or breakfast but the service and food quality were ","useful":0,"cool":0},"wAQprC3eMBtEV7LJhAoaAg":{"text":"This place was our last meal in New Orleans. We stay about 20 STEPS from this place and so","useful":2,"cool":0},"0bNlvgnt2Z3NX9CzZoDiDA":{"text":"If you stroll onto this side of Bourbon (the quieter, nicer, gayer side), then you may stu","useful":1,"cool":0},"LNm3tL6vt8jmCvEBDxUFMg":{"text":"I was in need of comfort food today so headed to the \"World Famous\" Clover Grill at the co","useful":1,"cool":0},"mVpebH-fArn-iBczZoGDqg":{"text":"We went to this place and sat there for 20 mins. Noone even acknowledge we where there. Th","useful":0,"cool":0},"FUGG-yz7OnYHQ8B8bZTqxQ":{"text":"It shouldn't be as good as it is.  That was my thought most of the time I was eating break","useful":0,"cool":1},"tK2WXtfDZ6jlMulHowEgmg":{"text":"This 24/7 diner is perfect for quick meals at any time of the day.  It's an old school din","useful":0,"cool":0},"y7NSaBKu5SwyCOPT0nZ6Eg":{"text":"When you come here you aren't looking for a 5 star meal. You aren't looking for anything t","useful":1,"cool":0},"E0FateBylNu6-fU8525cYw":{"text":"Always open - always dependable - hubcap burgers -- and the atmosphere can't be beat - rem","useful":0,"cool":0},"qRuT-WC3Y9gDQOIOc3kTcQ":{"text":"Great great place. Staff was awesome. Food yummy. Small and you may have to wait, but I fe","useful":0,"cool":1},"DI0-TjWGU_5Tj1yvTWXDOg":{"text":"A bit on the ghetto side. The cook is a total diva w a good helping of attitude but the fo","useful":0,"cool":0},"RtBMhBKPeSj0dvKYfe5vnQ":{"text":"Really fun place on burbon, open 24 hrs a day which is kind of a must for around there. Go","useful":0,"cool":0},"hhZihOx7uO4T1H6PHXOQvA":{"text":"So it's 8 o'clock in the morning, I get a phone call from a friend who needs to be picked ","useful":1,"cool":2},"xsEbJF0EqHwvDj9DArAcfQ":{"text":"Best place to get late night diner food in Nola. Service can be very slow when they're bus","useful":0,"cool":0},"J29EYclnkBdWMd7EKN7Nhg":{"text":"This place was a great find for breakfast, the waffles and eggs were amazing! Ramone was s","useful":0,"cool":0},"8cvxP675O6DwfD91u_kJtA":{"text":"This is an awesome place  (Post Benjamin Button ) .....always come here for breakfast. ! A","useful":0,"cool":0},"_lyV9tWA6paksAR35hDQEg":{"text":"Grossed me out and I won't go back. It looked more like a soup kitchen or drug addict den ","useful":0,"cool":0},"GMrpwLGfOrtEpURkEkLGGQ":{"text":"Inexpensive grub. Biscuits were denser and not as tasty as I remember but the gravy was be","useful":0,"cool":0},"1yOv8e6SQWhHSd1PsPlhiw":{"text":"Best onion rings ever. They are actually homemade, not that frozen crap. The burgers were ","useful":0,"cool":0},"6rT_I9npjymrLXOUlxQh4Q":{"text":"Holy divas.  The servers acted like they hated their job and you.  My bf and I were lookin","useful":1,"cool":0},"STGrFNm_B23wG_UmGdMSBA":{"text":"Basic diner IUnunprespitouspresumptuous comfort food, strong coffee good service . Sheep a","useful":0,"cool":0},"47VWPOnRTdDeGtRy6qbpQQ":{"text":"Best.omelettes.ever.  Fluffy and huge, and the only thing that cured a good French Quarter","useful":1,"cool":0},"Be4zArhzkz1YDL8J3Lo2jw":{"text":"Ummm YUMMY! Burgers and fries are delicious. Service is always on point! It's on my list f","useful":0,"cool":0},"-gcSfyx8U0nltyknQf65Xg":{"text":"Food is consistent, but the pretentious rude server working this morning needs to learn ab","useful":0,"cool":0},"eNJJujVJezf2Z3XZQEwAaw":{"text":"I ate lunch here and lived through the most horrific food poisoning I've ever experienced.","useful":2,"cool":0},"lMuumuq7zbK_jYjqg4ppnQ":{"text":"I love the Clover Grill! I usually go there for lunch during the week. I usually order a c","useful":0,"cool":0},"9QMN462B14tioMCUE_FT_w":{"text":"Not the best breakfast ever but still really good. Had the waffle with bacon and grits. I ","useful":2,"cool":0},"lauYDVs0PUoS-JTvSPEOUg":{"text":"You're going to want to. I know you will, because we got sucked in too. It's late, you've ","useful":5,"cool":0},"3qI0LxwhMAaR38Rh9h3pkw":{"text":"Aguante Clover Grill, un genial local para ir a comer a cualquier hora que se encuentra en","useful":3,"cool":2},"MVbqVlS-9sYUDMj5xpJv1w":{"text":"The entertainment is the chef/waiter combo, who are totally out of synch. Took 1hr to get ","useful":0,"cool":0},"oghDIIHLfP9GcgnZVKSEmA":{"text":"Terrible service and the food was not cooked. Bacon was the size of my pinky. \nToo many gr","useful":2,"cool":0},"Ym7o3U3Zdi6-5mjHOd5zLA":{"text":"I looooove their cheeseburger and tator tots.  It be because I've been on my own personal ","useful":0,"cool":0},"Ju87702b4PbaikpIhDa8Uw":{"text":"Yo!  This place straight sucks!  Either that or I was way to godamm sober to roll up here ","useful":2,"cool":1},"ihq5chYbax19Y_ANeqMegg":{"text":"This is a great greasy spoon and diner style joint perfect for a very late night meal loca","useful":0,"cool":0},"q9Hu7x4lcsV2ROX-shpsJQ":{"text":"My husband and I stopped in after seeing the awesome reviews on yelp. It was packed and sm","useful":2,"cool":1},"7_JRVSHcktDlE5HMuiQ70w":{"text":"The best tater tots in the universe.  Good burgers to boot.  We had good service","useful":0,"cool":0},"x9D_cfPonf09fNkXwCSZWQ":{"text":"Had a pretty good breakfast and burger. Contrary to some reviews we received good service ","useful":1,"cool":0},"JQFKns92DjZGF3LMywDn3Q":{"text":"We stopped by for a late breakfast/early lunch and it was our last meal in New Orleans bef","useful":0,"cool":0},"S0uYZBPlCLzExbFJxxv0aw":{"text":"Love this place! Food is great...especially the omelet. The wait staff is fun and it is in","useful":0,"cool":0},"65ko5nqxkPovehH0N_ZxMQ":{"text":"Disclaimer: this is a 24/7 greasy spoon diner on Bourbon Street. Don't expect fine dining ","useful":2,"cool":0},"5gNLoCXlt4SZ8TKpoaiWiA":{"text":"Staple. Lovely. What you see is whatyou get. \nFab burgers, good breakfast, a little gay, a","useful":0,"cool":0},"vpM0Npk6lLHykPoKIZhBSw":{"text":"I don't ask for much...I just wanted some biscuits with a decent portion of hot gravy, and","useful":0,"cool":0},"bufRAOyfjrEIx5F-1Qqc3Q":{"text":"We came in from a downpour, frozen down into our bones.  Their coffee, hot chocolate helpe","useful":2,"cool":1},"kQ_XOs9JzkdEcnHqWiP4rA":{"text":"STOPPED in late on a Sunday evening.   Small crowd inside..it's got the vibe of an old-sch","useful":0,"cool":0},"sZf0QP5rf2w2c9Cn-WeOEw":{"text":"Food is really good and cheap. After an event though, either get there early or be ready t","useful":0,"cool":0},"ui2_E6KZyyy2osIdko6xPA":{"text":"I give 5 stars because I compared it  to a chicago burger. Not necessarily fair but the bu","useful":0,"cool":0},"QmNIoCJ6mlqSSU1PzsONyw":{"text":"Our service was REALLY REALLY bad. All the tables were sticky. The 4 of us ordered:\n\n1 che","useful":1,"cool":0},"IH95NPdWetnYNt-j82QN-w":{"text":"Love the food and I'm sober Lol. Definitely will hit the spot if your hungry. Try the chil","useful":0,"cool":0},"qh1Ylx_F1xOhDEjI3-Y90w":{"text":"A real open-kitchen diner!  Fabulous breakfast! Great staff! Just the right size for great","useful":0,"cool":0},"DcrLsxRNjNnIBuvkgcCWGw":{"text":"Rudest.Staff.Ever.\n\nIts a good thing its NOLA. Would never make it anywhere else..","useful":2,"cool":0},"9D65sLVfSSGoft7W7rZ1Fw":{"text":"So while in New Orleans many moons ago  happened upon this spot, now there is no fan fare ","useful":1,"cool":0},"qdW_U-FHPT5WQbiQQDT_-g":{"text":"Walked in for a late lunch on 9/9 and nobody there would acknowledge my wife and I.  Two w","useful":0,"cool":0},"5omEAlXRq_Z50UjbqARASg":{"text":"There are a lot of greasy spoons one can go to. This is one of the better ones. The servic","useful":0,"cool":0},"uLLGRFzdiAZvLomSNo2qBQ":{"text":"24/7 diner with good food at good prices and occasionally get a show from the constant ban","useful":0,"cool":0},"7YTGgh5Y1ohEYCdJunVR-w":{"text":"Want to experience a place where they have attitude!?!  Come on in and enjoy the fun... Re","useful":1,"cool":0},"HOiQCGPBvZBvIQ4RhbwbSw":{"text":"Awesome hole in the wall with great burgers! Too bad they didn't have milkshakes at the ti","useful":0,"cool":0},"vJZ4kEbQSg4ylc4Cv111mg":{"text":"I get it, it's has the diner appeal and it's in New Orleans...but there is nothing I would","useful":2,"cool":1},"ZqACBCC0YuIR_hJZG-cSkw":{"text":"9 out of 10 times, this place will have awesome service given that they are a very small 2","useful":1,"cool":0},"Ggb7yXOSFbDXf6MgLxn6oA":{"text":"i love them!! every time i walk in the door, the smell of waffles wins me over, and i must","useful":0,"cool":0},"k6lxo9T6hqhHvgsCGLKQzw":{"text":"The food was as good as the service , the two gentlemen behind the counter make this place","useful":0,"cool":0},"hLCD9EKkxQDSlk6F0VSffw":{"text":"We went here late at night because the Camellia Grill closed early. I wish I'd just gone o","useful":0,"cool":0},"w00q7ioeQLmGpnmSwly5BA":{"text":"Stumbled into this place after strolling the entirety of Bourbon Street looking for French","useful":0,"cool":0},"Z31W7D4BEmITf8xGhwEbUA":{"text":"Really slow service and everything is frozen. The workers are also rude. Skip it and do so","useful":0,"cool":0},"PDaVK2NeTzcIDI7FdnT-hg":{"text":"Great late night spot! Steaming hot double patty burger with cheese, bacon, mushrooms and ","useful":0,"cool":0},"KCR5An-kCyxpwqEDVzLh7g":{"text":"Was in town for three nights, and our apt was right by clover so we ended up going twice. ","useful":0,"cool":0},"KjE_7t9BlVxxqq4cbFPHDQ":{"text":"It's a 40's/50's style diner that's open 24/7 where you can get an inexpensive meal, inclu","useful":0,"cool":0},"rPo2HUMbE6gejtF4B0yJRg":{"text":"I'm still sad about the leftovers that I didn't eat from Clover grill. Because it was just","useful":0,"cool":0},"MeRNOPpww9ADWWudlDbV1g":{"text":"Anytime I'm in New Orleans I make it a point to stop by! It reminds me of a small old scho","useful":0,"cool":0},"kHTD9hIKV0HHoZxNxINkaA":{"text":"I'm so in love with this place, the cook is so amazing, food is perfect, you couldn't ask ","useful":0,"cool":0},"yC52HlBrqUDeZN_h2bbKBw":{"text":"We came here because we had enjoyed the food during previous trips here. The food was good","useful":2,"cool":0},"EUlHSn-nycumNCi_ETu2FA":{"text":"Clover Grill is an institution in the Quarter. It's a dive, but that's what you go to expe","useful":1,"cool":0},"J3Rsic5OAZfFUIyG_PLlWQ":{"text":"Non the less It is a greasy spoon. It hides nothing it's all done right there they cook ri","useful":1,"cool":1},"0ojuKj2LT9MeyMWgiZqDrw":{"text":"My travel buddy and I ate our last meal in NO here before getting on the plane for home. W","useful":0,"cool":0},"1w-KBEJbITBwY68JLnHTXw":{"text":"come on now, anything less than five stars is kind of unfair.  this place is fantastic.  i","useful":0,"cool":1},"GnMnreYGf4nsuA47kGAlXg":{"text":"Breakfast and a show!!!! Be prepared for waiters who would rather not be bothered with you","useful":0,"cool":0},"wdwQXiJKFd4GXbi78JubYQ":{"text":"Always great after a late night out. Open 24 hours and the staff is always friendly and ef","useful":0,"cool":0},"SprTaxijTwofZ-p-1BBv_A":{"text":"I've never written a review on yelp but I made this account just to write about my awful e","useful":13,"cool":3},"uMwxMA9XXL-AC0cDeq9O6w":{"text":"This diner is great because it's a 24 hour spot on Bourbon! It doesn't have the diner char","useful":0,"cool":0},"-9HBMJ-XMqZhr44Og55Dxg":{"text":"It's rare that I get a chance to come here. But when I do, I'm never dissappointed. Locate","useful":0,"cool":0},"iGtt8lniI0HJJ5yuOcEAUQ":{"text":"Quirky, fun, and a total dive.  It's open 24 hours and is a good place to cure your hangov","useful":0,"cool":0},"fWmJeGd6VvZJ9FF8YueqVQ":{"text":"Great greasy dive place for late night breakfast, with a little extra salt from the cook's","useful":0,"cool":0},"tpLLXFMMjd5zBhvK2L1MKg":{"text":"We ate there Saturday morning about 4:30 a. Service was a little low. They were obviously ","useful":0,"cool":0},"AF1RyWF69t8QzbmvU_RU_w":{"text":"The food, excellent.  It possibly seats 20 or 25. It's full of sass with a smile from the ","useful":0,"cool":0},"bIq5u6VTybu-GOsiZockYA":{"text":"Cheap and awesome! It's was the best burger i ate un New Orleans (that's why i went twice)","useful":0,"cool":0},"N8BPnNcKVkTdZCt22S0xIQ":{"text":"We love stopping here. Always get great food and enjoy the staff.- and the customers.  It'","useful":0,"cool":0},"QzU-HYUavNQcwCcuYk-vxw":{"text":"Nothing extraordinary. I ordered a burger- it was big but tasteless. Unless it's the middl","useful":0,"cool":0},"lXPLXno6kUewZ3HSdgI43Q":{"text":"Great food and awesome servers! I would recommend biscuits and gravy and the country fried","useful":0,"cool":0},"g0TbZfpqD3ol7OgzdpnAbQ":{"text":"The food's not the best, but it's CHEAP and somewhat tasty and perfect for that late night","useful":0,"cool":0},"8oW3hsjRrOFh7KupDuEC_A":{"text":"On a recent trip to New Orleans we ask the lift driver take us somewhere that was one open","useful":0,"cool":0},"oz3fPFk5qv2xfwQgRrt1mA":{"text":"My friends and a non friend plus Myself had burgers and shakes here. Pretty tasty food, ve","useful":1,"cool":0},"c4Oaj0EWJ2RNhCyUJvFiKg":{"text":"Good food, but the service from a waiter sucked!  He treated our entire party like crap!  ","useful":2,"cool":0},"GmZRm63xHGGFceyXb3__WQ":{"text":"Stopped by after picking up my friend from the airport at 1:00 am.  Had never been before,","useful":1,"cool":1},"Qj7Q0fIYDMcMXLTbNcIViw":{"text":"Great for a late night bite to eat. Authentic lunch counter experience, fairly standard fa","useful":0,"cool":0},"W8MA518hjSZMj6zX5RYW0Q":{"text":"Cheap, open all night. Food is greasy and a little gross but I wouldn't have it any other ","useful":0,"cool":0},"MaeoRo0fg6UFtzDRfd6Zyw":{"text":"Was in town for a conference, had a Bloody Mary down the street and stumbled into this pla","useful":1,"cool":0},"YxVSJW2k6bKS6gzWxVNOog":{"text":"So I understand early morning tired attitude, but the cashier at 1:30 am should be fired. ","useful":0,"cool":0},"ElLhewp4fHLkoHmgbmKp7g":{"text":"So first off the food was great. But when I tried to leave a tip with the waitress, she sa","useful":0,"cool":0},"TyTgzTBN17vqknMFT7xOdg":{"text":"This is a small place, maybe 5 tables and the bar facing the grill.  Typical diner food.  ","useful":0,"cool":0},"be2PA4pAf2I9V39ThGLz5Q":{"text":"Diner lovers paradise (*tried to insert a heart emoticon here and failed*)\n\nShout outs to ","useful":0,"cool":0},"WB40IbErUNC0hEi9FDURQQ":{"text":"On our last four trips to the French Quarter, my husband and I have stopped in here for br","useful":0,"cool":0},"XqPxhVgWmH6irY9_4NOtdA":{"text":"It's not gourmet, far from.. but that's why you need to pay homage to this gem of a restau","useful":0,"cool":0},"Eg5h0Nmefgn6duDuQe8YlQ":{"text":"One of the absolute best burgers on the planet. Whether you're looking for a meal or some ","useful":0,"cool":0},"4gtll9lCgggUQ8L6AJ4JCQ":{"text":"3 a.m. where else are you going to find decent food? This place was much better than expec","useful":0,"cool":0},"0sw3IFwnBI_nkDdW34Gj-w":{"text":"We recently stopped in for burgers, fries & shakes around 4pm on a Friday. I had seen Clov","useful":0,"cool":0},"ncGBmsGcAucAQ0sU5JSmUQ":{"text":"Dateline: 3:30 pm, the French Quarter, a lazy Saturday afternoon and hungry...\n\nJust as we","useful":4,"cool":4},"fiiFZK8rU9tvjwfKi71miQ":{"text":"Horrible! As soon as we sat down, racist waiter Tony intentionally ignored me and my wife ","useful":1,"cool":0},"auqGdB9Ka7HOmJVxlzzz1A":{"text":"I was borderline about to give this place 3 stars but I feel like convenience does not out","useful":1,"cool":1},"kYwtMBofbpw97TVQjz7FGg":{"text":"Ran into this diner on My trip to NOLA Early December 2011 with my BF.\nGREAT PLACE, GREAT ","useful":0,"cool":0},"X2h5M07s6TZqUA_7ZvLdjQ":{"text":"Low prices compared to the tourist traps.  Great food and friendly staff.  \nWe went there ","useful":0,"cool":0},"3XCKeULUkdpyyw75rnzy7Q":{"text":"The best 24 hour diner I have ever been to. Especially when you're on Bourbon Street anywa","useful":0,"cool":0},"v5tCrzyx9FM4ROEjfq7opA":{"text":"The definition of greasy spoon.. It's wonderful that places like this survive in the Quart","useful":0,"cool":0},"LFUkjRuL05BGEzrldiVmQQ":{"text":"The worst dining experience I have ever had. No exaggeration. There is so much wrong with ","useful":8,"cool":1},"pS-wTXPaVp-objGEbIlJkA":{"text":"How can two stops at the Clover Grill both within 34 hours of each other and both ordering","useful":0,"cool":0},"u3ewlyZ85u30ncFWEnnscw":{"text":"My husband and I went there during pride at like 0-butt-30 (late) and surprisingly it was ","useful":0,"cool":0},"mWTuSmG8merxNY7N09Dq4Q":{"text":"You cannot get any better than a 24hr diner. My food was quick and very yummy (and afforda","useful":0,"cool":0},"PN7LBDV7gxGf2Ikk4oiVXw":{"text":"One of those classic diners thats small and just cute - giving it so many stars was a must","useful":0,"cool":0},"6gLLepCEL2icbD0CLYZrgA":{"text":"I came in with my boyfriend who loves burgers. I was skeptical when I walked in, consideri","useful":0,"cool":0},"UGc1mQmCcc0AedPal9NXhg":{"text":"Pleasantly surprised to find a 24 hours local diner in the midst of Bourbon street. The fo","useful":0,"cool":0},"b8poawtwQPfaqExLGvyBTQ":{"text":"this is the number one spot for breakfast. i wouldn't go nowhere else. the staff is super ","useful":0,"cool":0},"12NhsUAs7b_c67QDuIf2zQ":{"text":"Atrocious service. If there are more than two people in the restaurant, don't go in. Or el","useful":3,"cool":0},"-3iTf_1CPWik20BKmCDwDw":{"text":"If you are looking for a good burger and fries make the stop.  A real whole in the wall wi","useful":1,"cool":1},"MLKRYBPNHy0BKFqFW6NZlQ":{"text":"Maybe it was because it was 11:30 at night and we had started at Pat O's at 7 and ended up","useful":0,"cool":0},"5WET5AkRBPdPU-IcI3qU7Q":{"text":"The best place ever!!!You will never be disappointed here and Joseph...OMG....the best ser","useful":0,"cool":0},"_Xo-GzEuYQ2G8ZbcNKJtNA":{"text":"Let me start off by saying that at first glance this place looks like another dive diner. ","useful":0,"cool":0},"xY6KtPYnsxSWiKB3ae6JFQ":{"text":"The staff here is so real. They aren't trying too hard, which makes me uncomfortable. But ","useful":0,"cool":0},"VsgRgtiLl6CUTTMLiAesKw":{"text":"The Clover Grill is a real hole in the wall, but I mean that in a good way. You don't go t","useful":2,"cool":1},"Ppgc4BLsmVejgg3vJMVTAg":{"text":"Hamburger sandwich was tasty with tater tots and the chicken fried steak with eggs and has","useful":0,"cool":0},"ix3GcFrQ4vYxxAQF4lbU5Q":{"text":"Enjoyed the vibe here but the food is pretty basic. If you're hung over and broke, it's gr","useful":1,"cool":0},"draqFnMQl_EwYZgTXKNZEA":{"text":"Best place in Nola, cheap good food, friendly, sassy staff. And just a old dinner place to","useful":0,"cool":0},"IAWDOOes6I3UgXSc4Hn_0A":{"text":"In a sea of fried seafood, you provided a much needed eggy respite from it all.  Unfortuna","useful":0,"cool":0},"1GJ-a-vLMTIeqneYur-kNA":{"text":"This place was recommended by a friend, walked in wasn't busy. Cleared some stuff off the ","useful":1,"cool":0},"5bKrj96GH_00ZwVWVT4dtA":{"text":"The service was abysmal. We waited 30 minutes for our order to be taken. And then another ","useful":1,"cool":0},"wew6kFpsVP05hKZA3sXlcw":{"text":"Went here when we were in New Orleans for vacation. Wanted to try \"a local's breakfast pla","useful":4,"cool":1},"gCoz-T3GT32x3vRli4QXDQ":{"text":"As Samuel L. Jackson said in Pulp Fiction, \"I do love the taste of a good burger.\" \n\nThis ","useful":2,"cool":0},"sr6Ag4U5t04JECG8AjyYLQ":{"text":"The perfect drunk food on Bourbon Street, open 24 hours a day and serving up great burgers","useful":0,"cool":0},"S30aUsV1NWI2bFg_vAltYA":{"text":"Diner food with an attitude!\n\nFine for a late-night breakfast or burger.\n\nI have my doubts","useful":2,"cool":0},"zQeGluv0BaTxyQFTodt5ug":{"text":"This is always my first stop in NOLA, I get in early and go straight here by 11:00am. \nIs ","useful":1,"cool":1},"9vqfwrOdqFJDmUUPbh63Tg":{"text":"The best cheese burger on Bourbon Street. Came back 2 nights in a row. Old time diner and ","useful":0,"cool":0},"ek3on_-htLdbPLT8Y1qcTw":{"text":"Don't do it!!!! \n\nWorst restaurant/ grill during my visit to NOLA. If you want to watch th","useful":0,"cool":0},"GYhpidTxG-quA47YcYNQkw":{"text":"Good diner food. Staff is hilarious. They make inappropriate jokes so you probably need a ","useful":1,"cool":0},"N62XysTaKLL95Fq5g66KaQ":{"text":"Someone told me to go here because of the biscuits and gravy. So I did with a couple other","useful":2,"cool":1},"NE-J3bMDjRGf8fLxV4Gcyg":{"text":"Boo on this place.  They were only semi busy, we wait 15 minutes to have the snotty waitre","useful":0,"cool":0},"bQGShX6Y5GSdwLe5aCMn7w":{"text":"Def a must for a delish burger and fries. We took it to go,  but I hear it's fun to eat in","useful":0,"cool":0},"q7vi9DuRXy_EJcOKKHFFpg":{"text":"Best to get here when it isn't slampacked!  Omelettes are good, and usually pretty quick t","useful":0,"cool":0},"Rn1bkkdLeKQ5zuPCBWEsVw":{"text":"Any negative reviews about poor service or poor food must be competitors trying to give th","useful":1,"cool":1},"QZHX5iulSBKO6nQJIdpNUA":{"text":"Love Clover. Always busy.  Best biscuits burgers fries tater tots and onion rings. Had bee","useful":1,"cool":1},"NTLEdWO6dfr0VnOptvLbNw":{"text":"Exactly as I hoped it would be. Just as greasy and eclectic - truly the perfect hangover f","useful":0,"cool":0},"okYHtdcOISgPDGcuEzfyYQ":{"text":"Joe was our waiter great guy and a lot of fun!!! the food was great we had good time sitti","useful":0,"cool":0},"XOqDkHahNxAN18si5J1EHg":{"text":"This place is great! In town by myself on business, I came in and sat at the counter for s","useful":0,"cool":0},"IAzkQUcvxfgLekzW_vCq4w":{"text":"The only reason this isn't 5 stars is because there is a better burger in New Orleans... w","useful":0,"cool":0},"7Gk-TmbI71DmtTzcLnhprw":{"text":"Good food.  The staff was great.  The pork chop and waffle was great. A must eat place.","useful":0,"cool":0},"IkcXbSn5JrPwD4dy2NJS7Q":{"text":"Baaaaad! Had breakfast there on Saturday morning December 10th. Two of the most miserable ","useful":1,"cool":0},"ne60YMFl1r5KeSf4rxDUYQ":{"text":"This is the epitome of a greasy spoon with a great attitude. The owners have a sense of hu","useful":0,"cool":0},"jGlM95tpT8srC6Cqh3HM9g":{"text":"Total failure for me!  I honestly didn't expect much from this place as it is mostly post ","useful":1,"cool":0},"pNAeTk8kCgz1Kg_fKDgOjA":{"text":"Its just \"That Place\" in town. I have been here on several occasions and I will return the","useful":0,"cool":0},"US4QLONFBCD0xtIz6S31Vw":{"text":"Expect a packed house especially if you're coming here after 2am. Hell, expect a packed ho","useful":0,"cool":1},"H9dPNB5o5292vhvlZgYHPA":{"text":"Prompt service and the most juiciest mushroom burger anyone could handle at 4am. I will re","useful":0,"cool":0},"Aomw5Nw4ew0QoNak3rT8YQ":{"text":"The sign in the window claims the \"Best Hamburgers in the world\"...and I gotta say, they a","useful":0,"cool":0},"CjJMbF6f9tE4h7s2nsGWtg":{"text":"Terrible experience....not so welcoming staff.  I ordered a burger because that's supposed","useful":3,"cool":0},"A9dw5qUGDf0lA1bOeoIYFQ":{"text":"Dirty, catty, and gay.  If you're from west beattlebutt Idaho and there aren't any gay din","useful":2,"cool":0},"lkzGCNTjgdG8H0vlGffBpg":{"text":"Nothing will bring you back to life quite like their burgers, which, according to their me","useful":0,"cool":0},"hJKQe6YLYKckyLgyP1g2Bg":{"text":"Stayed at a friend's place a few blocks away and wanted a quick bite before I got on my wa","useful":0,"cool":0},"dV0_MQAD6lZxBDRxbFLxaQ":{"text":"This is one of our favorite places to get breakfast while in NOLA. They are open 24 hours ","useful":0,"cool":0},"tufSZDJ6XgCkV30NOhWmPw":{"text":"Love the dive scene, club sandwich, bacon and waffle (had a clover imprint in the waffle) ","useful":0,"cool":0},"NsegBkuL8Vfb0tANO73xUA":{"text":"After eating at Clover Grill many, many times over the years and enjoying it and recommend","useful":0,"cool":0},"9ZsIHWjXNu4HhAeLRtD5pw":{"text":"Nice dive that's open all night and serves breakfast anytime. Burgers and sandwiches from ","useful":0,"cool":0},"3PfCTuuDbkSXApNgzRKTUg":{"text":"Went here for the burgers, which are supposedly some of the best in the city.  The burgers","useful":0,"cool":0},"qgFXSBDf3kgOxH_Uj-xrTA":{"text":"It's a great diner-type breakfast. Had a huge omelet and hash browns and couldn't even fin","useful":0,"cool":0},"V44fofglyunUb5Xql5190g":{"text":"It is a fun joint. The jukebox is nostalgic for the almost 40 crowd. The scene between the","useful":0,"cool":0},"tVWyTt7tvf6tkY66b9Q42A":{"text":"chicken friend steak and eggs....OMG. no seriously i came back TWICE for this dish. i don'","useful":0,"cool":0},"a4Wv-HjvMV_Y1UOwsoySDg":{"text":"I don't hang out on Bourbon a lot, but if you're looking for a good late night spot to get","useful":0,"cool":0},"2ikV1crUKQD-x2oS9vuNOg":{"text":"I went to this restaurant with my family and the service was completely bizarre.  I am tot","useful":0,"cool":0},"8B7_NpYi17R42hKM_FpsOw":{"text":"I am giving Clover Grill 5 stars because I never want to go to NOLA and it not be there. Y","useful":0,"cool":0},"c__K7-yP0vTzXFYwtbaxCg":{"text":"This is an awesome place to go eat when you are drunk. You might regret it later, but you ","useful":0,"cool":0},"JOKoCPZe7JQgmAE004c5vA":{"text":"- burgers and fries were good\n- service was southern friendly mixed with the over the top ","useful":1,"cool":0},"up6-eJPU1jgbJsEX7ZHSOA":{"text":"I'm visiting New Orleans for a conference and everyone in my hotel said I had to try these","useful":0,"cool":0},"ja9oUgp03fr17Af6I9cNog":{"text":"The BEST breakfast and Burgers.  The place is very clean, dinner look, food quality is ver","useful":1,"cool":0},"cBZ1zHLR2ypXY-_se_9gGA":{"text":"Terrible service. We were at a table and literally we're told they had people waiting when","useful":2,"cool":1},"deciTxpeIUAE6G-N3QBBpw":{"text":"This place has to be for tourist. Just okay. Nothing special. Like eating at a smaller Waf","useful":0,"cool":0},"2G3UnWFH2RdOBJ-oKFpPQw":{"text":"I love clover grill because it's always open. They have huge portions and you watch the co","useful":0,"cool":0},"sGFIpPoYv_UYXj38AKo05g":{"text":"This is a great go-to spot whenever I stay in the Quarter. The omelettes are fluffy, and m","useful":0,"cool":0},"5HTMFLaYmoh2OjhsQsPHYA":{"text":"Loved it!  Had breakfast here.  Fast, good music, nice staff, strong coffee, and a decent ","useful":0,"cool":0},"LLQDojMpG0HDsuAPxTgZFA":{"text":"Best value in the French Quarter. Hot juicy burgers made to order under a Ford hubcap. Fre","useful":0,"cool":0},"A7StwxEBmEwWZ4a9MBgYHQ":{"text":"This place is about the experience and not the food.  It's just breakfast people, and yes,","useful":3,"cool":4},"z12HLslEgDLtzsfSo_wR6Q":{"text":"Dirty as ever but the best hamburger in town. We've also had the BLT's and grilled cheese ","useful":0,"cool":0},"A__MTdM1_x2AYb6vY0gFWQ":{"text":"A godsend greasy spoon, and a tiny 24/7 diner, that never exceeds or disappoints, but is a","useful":0,"cool":0},"kyJwsF24s8Cn0j-xPCFy0A":{"text":"This is a bit of a grimy diner: no frills, nothing fancy. But the food is cheap and tasty:","useful":3,"cool":3},"3mo7TpPWUe2c7Fcsg-rwyA":{"text":"Not only great food, but highly entertaining staff. Wouldn't recommend going during mardi ","useful":1,"cool":0},"_IN4iHClM_vvSIvgHawLxg":{"text":"Love the staff!  Wonderful for burgers and fries!  They are soooo friendly and sooooooo VE","useful":0,"cool":0},"oDM9cOyGsbtKImaOzkj4xw":{"text":"In proper Bourbon Street style, It's 3AM and you're uncontrollably drunk. All the ragin' c","useful":4,"cool":2},"3KkDimvxnD6qMByP91aT7w":{"text":"Great place for a quick burger and a malt. Welcoming atmosphere, and a friendly staff!","useful":0,"cool":0},"fVZjrrFAfoFiiXvVxlgeGQ":{"text":"Old style greasy diner that was just... perfect! It's literally like going back in time. T","useful":0,"cool":0},"61C6S7XijNTjpC6rzPiVow":{"text":"The food is typical for a greasy spoon diner. But the only reason I stoped to have breakfa","useful":0,"cool":0},"5muH5G7f3ttXOaqkg_fERQ":{"text":"This small hamburger joint is perfect for a quick bite to eat on Bourbon St. I came from o","useful":0,"cool":0},"ghhhkjSPaqr41rx91QiCEw":{"text":"Really great prices!  Good service and really good eggs!  Lots of butter in the food but i","useful":0,"cool":0},"tWgZWZ4yTKk-FfM1sHEYiw":{"text":"It's exactly what you'd expect from a 24 hour diner. Greasy and filling. The place is smal","useful":0,"cool":0},"S7Xkp0WLdyE2gVNzrRhG3Q":{"text":"Clover Grill: It's a diner. Either you like diners or you don't. As far as diners go, it's","useful":1,"cool":1},"4Hm_So8vw57b4zZ-DU3sFQ":{"text":"I went there on christmas eve, the place is small and cute. I liked how local it is. i ord","useful":0,"cool":0},"JnVhtWuT_ZmxC35ySxdGdQ":{"text":"Very pour!!! Waiting for 15 minutes asked when I'm gonna get service and the waiter called","useful":0,"cool":0},"soI-HAVNmyKQwOsy-aAy6g":{"text":"This is my go to breakfast and late night food spot in NOLA. When I am in town, I eat brea","useful":0,"cool":0},"2n7uW67ysQao_wimIevZyA":{"text":"Went to the Clover tonight for a quick bite.  The place wasn't busy around 10 pm, so we ha","useful":0,"cool":0},"2d4bl3DHu5JTEqHrB3TxCw":{"text":"Absolutely horrible. Our waiter was very rude and kind of a prick and vulgar. Next the coo","useful":0,"cool":0},"IrCTLhkECuIwlT1F7Zy1iA":{"text":"Had the cheese burger and fries - good.  Funny and helpful waiter - even better.  You can ","useful":0,"cool":0},"yCr2mtLlAFELi9YsvWB4CA":{"text":"I ate here, and didn't die. Cheese fries and a burger. It rocked. The bathroom was gross, ","useful":0,"cool":0},"oXGqYS6BVTzYCwkPyiqxvw":{"text":"This is an amazing little diner with some great home cooking breakfast food. The music was","useful":0,"cool":0},"OdPS6JgamNI3NM0xzW-XQA":{"text":"Who doesn't love this place? Come on, it's good diner food. No frills. The servers are who","useful":0,"cool":0},"yHYjYtBzJauivcnGp4QzEA":{"text":"I was very skeptical of this place but my travel buddy really wanted to try it out.  Order","useful":0,"cool":0},"-p20aoROmZbdgkw32bivDA":{"text":"I love a solid old school diner. And that's what this is. \n\nMaybe you'll get a cranky wait","useful":8,"cool":7},"A9a-DqvbtmmYwtpMHv-e9A":{"text":"Great place to grab a bite after drinking and people watching on halloween night. Recommen","useful":0,"cool":0},"2rwtwrAd9GY6Pn7VT9E62w":{"text":"What can I say one of a kind classic joint great people working there, to feed all of us w","useful":0,"cool":0},"Rwl53BcXj7NH8xRm-9avwg":{"text":"The food was pretty great. Wonderful late night eats! The service, however, was horrible.","useful":0,"cool":0},"QqAYB0sB3RSLhw8SjKSbbQ":{"text":"Want a a good ol' southern-style breakfast, just like Grandma used to make?  This is THE p","useful":0,"cool":0},"07qI7H-xYqmCxmbmcC3yMQ":{"text":"The burger and tator tots were really, really good. This is definitely a place worth stopp","useful":0,"cool":0},"KyFsPIB5Lex0zvKIBquFDw":{"text":"I loved this place! The egg salad made the perfect lunch. Any of the fried food is divine ","useful":0,"cool":0},"4sF04D6ZGnXwQm4CA59uCw":{"text":"Please fire your server!!!! This guy is bad for business! Waited 20 minutes for service. H","useful":1,"cool":0},"zg0rnu3Tx3Vo_khLbkaQ2Q":{"text":"Food is shit. Comfort is great. Exactly what I want after drinking.","useful":0,"cool":0},"Sd8bEDSisJReWpPyAf8EVQ":{"text":"It's a 24/7 spot which is always a plus, it's honestly not very easy to find a place servi","useful":0,"cool":1},"7Es3vfyhfEZdUg0BXApFVg":{"text":"God, I hate this place. I'd give it 1 star, but I at least got mediocre service and a medi","useful":3,"cool":1},"7MeAjlbPINLme3JskBqiBw":{"text":"Wow. Old school diner. Cheap as heck. Friendly service and the best chicken fried steak sa","useful":0,"cool":0},"a_C0HgtvwmwOoWPKTuVYOg":{"text":"You have got to try this place. The best club sandwich I have ever eaten. The late night b","useful":0,"cool":0},"PTKOO1nwJU4-VOSB-V4ksA":{"text":"The burgers are amazing! The staff are great and entertaining. J.C really made us feel lik","useful":0,"cool":0},"7q3zjzqK_a2F8UQafemmpQ":{"text":"Quite expensive but very good burger. Cripsy bacon and melted cheese over a generous patty","useful":0,"cool":0},"WstXaZeAk9Xwp_FTK0EdCw":{"text":"Several people told me to go here and grab a burger! Am I ever glad I did. They cook them ","useful":0,"cool":0},"5LQDEr8mXcw9nlrRojBflA":{"text":"Any place that local cops hang out at has to be good!  Havent had a bad meal yet!","useful":0,"cool":0},"PXBfJk5wBj1ZjrIolWBEfQ":{"text":"Fantastic food, in my opinion, whether you've been drinking or not. It's teeny tiny but it","useful":1,"cool":0},"ZmkPkPG0iohDAqW1Lk61Aw":{"text":"I found this place after walking around the French Quarter on foot all day. I was fortunat","useful":1,"cool":0},"ndp08KSAl_VWikacJUBa1w":{"text":"Was my first time here on a bachelor party! Absolutely an awesome place. 24 hour service! ","useful":0,"cool":0},"Mp9V8Q6-H3uzFZ55H8Fnlg":{"text":"I have three words for you...then a few more:  BEST OMELETTES EVER!  They're so light and ","useful":0,"cool":0},"AeDGNH8UaS1IFd-Wqtmmag":{"text":"The best burger that I have ever had, and great fries. Perfect for\nlunch or a late-nite di","useful":0,"cool":0},"f9WPCHI6aNZPH1XRpomwew":{"text":"Love the breakfast food!! It's always a must stop after hitting up Bourbon st! It gets bus","useful":0,"cool":0},"vS9cOxFrC5DDCD8hYF65eA":{"text":"Greasy spoon. Great cheeseburger. Veggies omelette is pretty good too. \n\nThe service is ju","useful":4,"cool":1},"DEyZBGB3MDUsnSEBxIet8Q":{"text":"Stopped for a bite at a place called The Clover Grill. They cook all their burgers under a","useful":0,"cool":0},"50RcrC9PV7pvFX7ZmVPo7A":{"text":"The special sauce on the burgers was amazing!! The tots & the fries are the perfect amount","useful":2,"cool":0},"b-LfGu3DKmrR1CSBYbzpjA":{"text":"Don't bother going there, the Queens who gave this place some flavor are long gone. The pe","useful":4,"cool":0},"Vr0ov53FoteKSFzJq5l72A":{"text":"What?!?!?! You are skairt of the clover grill? Dumba$$ !! Its the best late nite hangover ","useful":0,"cool":0},"6MN8kTcn7FA80ALSokaIhg":{"text":"I came to Clover Grill because there was a short line and the sign on the window said it w","useful":0,"cool":0},"Ohv-DrVFFhvDOVqodmP3dw":{"text":"My friends and I stumbled upon the Clover Grill while walking on Bourbon from the Blacksmi","useful":0,"cool":0},"ZfrCF_DZAgNj47lalPBD4g":{"text":"Stumbled in here first time we were in New Orleans 5 years ago while exploring the quarter","useful":0,"cool":0},"cCCNYMeEC7iCBknuX-weQA":{"text":"I'm not completely sold on this spot. It was perfect for picking up a bite to eat for the ","useful":0,"cool":0},"oEVsDcVoXykwPKcnhSqfnQ":{"text":"This is what you would call a hole in the wall but good for a fast grease spoon restaurant","useful":0,"cool":0},"-9UIymQa46trvtas3Pncaw":{"text":"Solid breakfast in the quarter.\nReasonable prices.\nDon't go if you are offended by gay peo","useful":0,"cool":1},"U6eXtCwMfxCEKHDc2L90iw":{"text":"Understaffed for Sunday brunch, so expect to wait a long while. Also, you'll drown in the ","useful":0,"cool":0},"7pafZ9sRsmCquutCuyksMQ":{"text":"Not great. Although, I didn't even get my order. They just forgot to cook it and never not","useful":1,"cool":0},"4yoOhxy_htKSKYo6w8BSsQ":{"text":"The food is usually good. However I noticed on my last trip they started using frozen patt","useful":0,"cool":0},"ZTHZO3GmCzXghhCyM-e2UQ":{"text":"This place has always been a oasis in a sea of drunkenness that is Bourbon St. If you're i","useful":1,"cool":1},"RejcP3ngcfBELInFQaJO2A":{"text":"Great 24 hour diner on Bourbon. \nStop in for cheap eats - omelets, hash browns, burgers, p","useful":1,"cool":0},"LcVM8ZfLkoY9lG_7yDvFSg":{"text":"Gotta love a hole in the wall, small diner with the grill right behind the counter...my co","useful":0,"cool":0},"1hsAGpIWKTJ-5mop8Yyq7Q":{"text":"How hard is it to make an omelet? It's only three eggs and some filling, yet apparently it","useful":1,"cool":0},"7G3eQDeKnclSW4Iqe7ZgRQ":{"text":"This place was a terrible experience my mom and I got up and left. The server was rude and","useful":0,"cool":0},"Vga7yMAfGfEBjW1XWnuVDQ":{"text":"Get a Blue Cheese Burger with a sunny side egg and bacon.\n\nHang over solved.","useful":0,"cool":1},"Y-Vdmc169PagfWjSUWh1WQ":{"text":"Waiter was easily distracted and took a while for our order to be taken\nFood was great whe","useful":0,"cool":0},"ZN6FDgI2Pv90j9ZTxA6GaA":{"text":"The food was incredibly greasy, tasted awful and my friend and I both got so sick after ea","useful":1,"cool":0},"9y94GgHw2wX_-8-bWPqwnw":{"text":"I was deeply in love with Clover Grill once. It was fun and exciting. So much so that I to","useful":7,"cool":5},"159lrr5xRUs4DikK1TPnAw":{"text":"An excellent greasy spoon located right on Bourbon street - perfect for an early-morning f","useful":1,"cool":1},"fdSRJGWlFn__Oue0nPCKqg":{"text":"Small restaurant with a nice small menu for breakfast. We enjoyed the breakfast special --","useful":0,"cool":0},"N9AJMvlFvf8ACmSnjq-QYg":{"text":"Good burger interesting cast of characters.  Oh and don't sit by the door on the Burbon St","useful":0,"cool":0},"rXuTb4Qz3YJQZX6aXS_TEA":{"text":"Clover Grill, a little hole in the wall in the French Quarter., with a funky pink interior","useful":0,"cool":0},"1SXMeewPR8W0putQ5dFUKA":{"text":"First off, the John Waters descriptions are very apt. The staff  brings out the best in th","useful":0,"cool":0},"FILvif6Sx84jillZr2PdNg":{"text":"Look this place is great, great little spot with good tasting food and service! I recommen","useful":0,"cool":0},"t2HlF4JyQ3iH4JU1_NNx5Q":{"text":"Grub is good.. solid local joint to grab some grub for breakfast. Order the chicken fried ","useful":0,"cool":0},"QM8faUZw3Makg5L6EAB1QA":{"text":"GREASY....everything from the floor to my eyeballs felt greasy by the time I walked out of","useful":0,"cool":0},"OINv2EOV6tS42VL5Y-St_Q":{"text":"This post is LONG overdue. Forget being drunk - Forget being hungry - Forget that this pla","useful":1,"cool":0},"vdij4L_3S746j7sf5tu4JQ":{"text":"I can't recall any time in my life, sober or not sober, where I have been so revolted watc","useful":15,"cool":6},"pZn6eiLVP_cS60i8if0Ztw":{"text":"We love to stop here at anytime of day because they will always make you breakfast!\n\nA cla","useful":0,"cool":0},"z9lCBzMah8x7DjGMMJyNpw":{"text":"Clover Grill is a great late night spot. When it's busy they pretend that high maintenance","useful":1,"cool":1},"42TigkisbqrNex7qY_Tn5w":{"text":"Great service! Must visit late night when in New Orleans. Open 24 hours! Friendly service,","useful":0,"cool":0},"2-QrH3umONmRJ1D9dPmZEg":{"text":"Ah, the Clover Grill...  There's nothing quite like \"greasy spoon\" fare sometimes and havi","useful":0,"cool":0},"kqQgANKsZmDeLMcCDRdG8Q":{"text":"Great breakfast and best burgers in town with a little sassiness!  Coffee was on point!  T","useful":0,"cool":0},"aOJqUnCre0UmcUMF-jiF7A":{"text":"This use to be a fav in NOLA.    Now we are guarded about eating here.  We went in to meet","useful":1,"cool":0},"UgmvpZpefCS6tYQ0L3-xog":{"text":"Last night in town & got a local tip that this was the place to be...turns out they were r","useful":0,"cool":0},"u65l6-DeIp6qGdyzE__uQA":{"text":"Late night or early morning this place hits the spot. They tell ya straight out if you wai","useful":0,"cool":0},"E0H_NOAh5q32zk4Dz7fi2w":{"text":"Love, love, love and miss this place.  We went there TWICE during our trip.  Great to eat ","useful":0,"cool":0},"5gGqrGWFeBFCeH0uIHpoSA":{"text":"The best advice , about this gritty little 24h diner is to go there  drunk! However,  do N","useful":0,"cool":0},"jeap556ro_RhmcYwGeviJw":{"text":"Meh. Frozen patties. Frozen fries. Obviously you come here when one is drunk but even then","useful":0,"cool":0},"qdaicaSAVE2IFASQdMPEYw":{"text":"The food at this little cafe/diner was incredible!  They were very friendly and even let u","useful":2,"cool":0},"JeVpaG5yeDzV5yjoOPVOeA":{"text":"Greasy spoon right on Burbon Street!  Tiny place but great late night diner! Open 24/7 wha","useful":0,"cool":0},"hoOk6fLuTW-OTIK8mIzt2g":{"text":"First thing I need to say is that I never write reviews on yelp even though I think it is ","useful":0,"cool":0},"RXYvr6a09LjzX_CG2iVo9g":{"text":"Very good burgers, cheap and quick!  Extremely nice staff and really attentive to every ne","useful":0,"cool":0},"t7fTcsSN-ykIVAWDBNEr_Q":{"text":"Food was great staff was better I will visit this cafe every time I go to new orleans. I w","useful":1,"cool":0},"xxnr6Pbt17PfN-hy9z-yYg":{"text":"For breakfast on Saturday we decided to try the Clover Grill - I was actually surprised wi","useful":3,"cool":2},"QjpEkyNIUD0To8ZOta_Bpg":{"text":"Went for breakfast and got a show. A teeny-tiny, itty-bitty gem on the less raucous end of","useful":0,"cool":0},"1qmN48dyoGH3vO9xVRExcA":{"text":"Straight up all American breakfast served in a classic hole in the wall greasy spoon. Food","useful":0,"cool":0},"HH1mpqxA21bYcY_tdcxzUA":{"text":"They are alright, considering limited places open 24 hrs, after a night of drinking, comes","useful":0,"cool":0},"W9J7daE0y_R3qAsH3HFFAg":{"text":"This place fucking sucks. Rudest staff EVER. I would rather pull out my teeth than go near","useful":2,"cool":0},"Lv9IJDaRQwRtu2G54RRFqg":{"text":"Came here before the decadence crowd got to town.  Service was quick and the burger and ta","useful":0,"cool":0},"ews-Y2HQW9ToGQly6htSDw":{"text":"They have the worst customer service and not good with groups! We had five ppl and they wa","useful":1,"cool":0},"NQUltm6uyHu-RUs6sdinvQ":{"text":"Had a great short order breakfast at three in the morning consisting of sausage, eggs over","useful":0,"cool":0},"6rzRqMynf2N1V6Lxr3RYiQ":{"text":"The only bad experience we had in New Orleans was at the place. \n\nWe walked in at 2am comi","useful":1,"cool":0},"c7s5kfrTJmjwztSoSxg2LA":{"text":"BOO BOO BOO!  How can a restaurant refuse to make adjustment on the menu.  I like my hash ","useful":1,"cool":1},"jecC6rEht3XVdXjRAKHH1Q":{"text":"Yep, came to Clover because of all the good reviews, and because I didn't really know of a","useful":0,"cool":0},"g7wvr9vW06MZOXaLkKdoOA":{"text":"I had to give Clover Grill 4 stars simply for it being such an easy and enjoyable meal aft","useful":2,"cool":1},"GhAIZUCcZ82UTNw4nFyU_A":{"text":"God bless Clover. This is literally the best, most honest, quick and cheerful diner in New","useful":0,"cool":0},"3Ad41Sw10afirjcznCB7UA":{"text":"Excellent place for breakfast - no frills but perfect.\n\nThey are open 24 hours, so go when","useful":1,"cool":0},"Om-8OsJFCUkr_VPk_wZfVg":{"text":"I loved this place! Custom made breakfast burgers at 5am two nights in a row...yes! Joe C.","useful":1,"cool":0},"JkQC2kRV3NBLr-IhxT_ueg":{"text":"This place embodies all that is bourbon st. Drunks? Check. Sketchy? Check. Packed?Check. S","useful":1,"cool":0},"oB8ndidB64OGDPEzAJi4tQ":{"text":"Omg.. This place, It's like heaven and hell combined lol.\n\nI DO NOT RECOMMEND COMING HERE ","useful":1,"cool":0},"39lR9xWl_EVBUQZ2WBzI2Q":{"text":"This is a cozy, diner food eatery. A go to for movie buffs and Brad Pitt fans ( this is th","useful":1,"cool":0},"YqGxCcueCk2XI2qShhP8Dw":{"text":"Don't waste your money. The staff was absolutely creepy. I mean bad vibes all over. We ask","useful":6,"cool":1},"UqZzbMEfW3Pu0iA_mi-hgA":{"text":"The stars go to the service, which was quirky and fun. The food gets no stars from me or f","useful":0,"cool":0},"_sGUWjcc8MLFmsbov8R6Uw":{"text":"Stopped in for a quick bite before going to set this morning. Was famished and a bit hung ","useful":1,"cool":0},"_z3oFx7nwf5-q8zaDhlGnQ":{"text":"The only reason this gets 2 stars instead of 1 is because they are open 24/7 which counts ","useful":1,"cool":2},"H6rma64D9I87AXc7FBBhTw":{"text":"Went in after Sunday tea. Had a hamburger with cheese, chili and onions. They charge for e","useful":1,"cool":2},"JdVsc3lkkqofx6KlZtdlsg":{"text":"A damn fine burger and all the greasy ass fixins at the Clover.   But even better was the ","useful":0,"cool":0},"aqYuSj2yNjdhOmZeOhu9vQ":{"text":"We knew when we stopped here that it would not be gourmet, but we had expected it to at le","useful":1,"cool":0},"6JO3GdASzsAjhv5L781w6w":{"text":"A good buzz and serious munchies are the only reason to eat here. It's the only restaurant","useful":0,"cool":0},"ZxywBeLI1eIn86glPn2sIg":{"text":"Clover Grill is Exactly what a diner should be. Simple and sassy.  \n\nI stumbled into this ","useful":2,"cool":0},"bCZ-E8sKrKA_gJtk03agYw":{"text":"Best late-night, greasy spoon diner. It's small, so don't be shy. You may find someone dan","useful":1,"cool":1},"zVDaYUF87JL0xM0O2brXqA":{"text":"Probably best for breakfast, which wasn't when we went.  My butter came with a side of gri","useful":0,"cool":0},"YCEFmwYeUV1A2Fq4q-_5-Q":{"text":"It is what it is people.  :)  We knew by reputation that the service is...unique.  We wait","useful":0,"cool":0},"SQgoIXBXvsZJ47SCmlSPcA":{"text":"Worst service ever.  We went in for breakfast (9am on a Wednesday) and the place was not b","useful":2,"cool":0},"RM_DwWBTqH4yXZFYGwEz0g":{"text":"We found this place after an epic fail trying to get a bite at port of call. It was around","useful":0,"cool":0},"aITSwNC0ESVi_QGQCNOpLA":{"text":"open 24 hours and provides food.\n\n24 hour food.  \n\nif you've been drinking all night in th","useful":0,"cool":0},"TaDPSvCybg6uGVEG9XqXSQ":{"text":"Diner food at its best.  And best of all????  They serve tator tots!  I love a good, crisp","useful":0,"cool":0},"C2vUn45GKi5x1yVYmvMRKg":{"text":"Greasy, late night food.  Good for a late night, early morning sustenance rejuvenation, bu","useful":0,"cool":0},"DTUkVuQ2XjRum9Z1V5GGYQ":{"text":"we walked in and the guy was telling us to wait outside and no one is even out waiting. no","useful":2,"cool":0},"5VKaKvLAZ5cWm4SK3Yk0ZQ":{"text":"I had lunch at Clover Grill today, and I must say, it was an enjoyable experience. I had a","useful":0,"cool":0},"8bQG32_pyacrnANRLfYNjQ":{"text":"With the closing of the Grill.  Clover grill now the best place to get a great breakfast.","useful":0,"cool":0},"hena6lYflw1Mt06QUFF_qg":{"text":"This place is everything I'd expect of a classic greasy spoon diner, done NOLA-style.\n\nThe","useful":0,"cool":0},"GwhsJvZROZeNo9Gtw22K_w":{"text":"My partner and I have been so sick the last 3 days.Intense cramps and diarrhea.The staff w","useful":2,"cool":0},"_dEXxbX3CspNd0wQl0nEqg":{"text":"If I could give Clover Grill on Bourbon St. in New Orleans 0 stars I would.\n If the health","useful":0,"cool":1},"iIBZWo8sKTUCE9u1iCgreA":{"text":"Perhaps the best burger I have ever had, and they give you the options to have \"tater tots","useful":2,"cool":0},"0xTEaCLbikOX4ZLuUjXfeA":{"text":"Perfect greasy spoon. This is not the place for people wanting white table clothes and pla","useful":0,"cool":0},"KLoWzLfhGpCI0OERdO51Iw":{"text":"It was late and I am starving on Bourbon. A couple suggested I check this place out becaus","useful":0,"cool":0},"hDuDlUHaBmSfGT9gwzJqSg":{"text":"Disclaimer: Clover Grill was experienced while 100% sober.  This review was written while ","useful":0,"cool":1},"L8zfODO-kgC-WexVOCYQwg":{"text":"Super dive, great breakfast, service with a smile if you are nice.  Well the service with ","useful":0,"cool":0},"oEmvEtxaoKF8tPdM6mJSzQ":{"text":"The \"worlds best burger\" sign intrigued us to enter.  The diner was cozy and it was pretty","useful":0,"cool":0},"aPLHqLbPDbzSb8NpiZD3Dg":{"text":"After a long day and night out in New Orleans during Mardi Gras, we were ready to get some","useful":0,"cool":0},"WerAYx06Bq4wJaoltpYj_A":{"text":"Terrible. They use too much butter. It was totally inedible! The whole meal was swimming i","useful":3,"cool":0},"Q4K69WLW3vOL9qqyDJprcw":{"text":"My friend recommended this and I was absolutely thrilled with it! I'm glad I tried it. The","useful":0,"cool":0},"KDLJymc5bDP34MCWbYwXJg":{"text":"LOVED the Clover! It's teeny tiny but big on great friendly service and awesome greasy spo","useful":0,"cool":0},"Pnx2697bBR_MCf96qq6EIw":{"text":"Loved the experience here! Finally made my way to Bourbon St at night. Got right in, sat d","useful":0,"cool":0},"bXVOwHx4ZpMQFYAvWam3Dg":{"text":"Worst place in New Orleans. Rude waiter. Slow service. There are other places much better ","useful":3,"cool":1},"yqBehlRYHyI2fKQmHAIVdA":{"text":"Went here for a late night meal after sightseeing. The wait staff was very friendly. The f","useful":0,"cool":0},"HyoJXyBfWt4w2h6Dwf2Ewg":{"text":"I live half a block from the Clover Grill and after several poor experiences, I will never","useful":0,"cool":0},"khH-nlrPgGrgatwEWYMyag":{"text":"Great old school diner environment, takes you back in time. The flamboyant cook and waiter","useful":1,"cool":1},"WuOkqpcHkje6Ym0j0i6aaw":{"text":"Let's call a spade a spade ... and be honest here.  \n\nIf anyone is come to this place -- c","useful":2,"cool":1},"yZhmefRcr_THMidkSAOVFA":{"text":"Staff were friendly, the onion rings were GREAT, and the quarter pound wiener dog was hot ","useful":0,"cool":0},"xIxKXLnDQ3Q-Os8O0868ig":{"text":"You have just walked into the stereotypical diner. Right down to the tile floor, tight spa","useful":2,"cool":1},"KOf4FAej_G06mX5eWTDfqw":{"text":"Best place for food while drunk or recovering. Open 24/7 this is the place for breakfast, ","useful":0,"cool":0},"LqEw9kc05dBSMjhCqn7sNA":{"text":"we wanted a nice good cheap place for breakfast, plus we were hungover. this was it. I sti","useful":1,"cool":0},"mBaqMUrlwijCn-O2OA9NuA":{"text":"This place used to have great burgers! What the heck happened? I remember sinking my teeth","useful":9,"cool":5},"bd4QmKPqJGRcD_LU615ahA":{"text":"do not go here!  Ripped off.  Dishonest.  Rude.  Dirty.  Gross.  Owe me for the chili from","useful":0,"cool":0},"5a9oIUvUSGZoREaJUZObxg":{"text":"Ok, so it's a bit cluttered. It's Smokey from the grill being directly across the counter.","useful":0,"cool":0},"_NE4GXvj_QeC-5n6PWuc3w":{"text":"On our last day in NOLA, my friend and I came across this tiny little greasy spoon and wan","useful":1,"cool":0},"Jd2W94kuY5DBBr_JTMcv6A":{"text":"Absolutely awful!!! If I could leave a negative star, I would. \nSaturday ( Sunday morning)","useful":5,"cool":0},"G9D47T-2_ZibthpQ_DIsCA":{"text":"We had our first breakfast in NOLA at this \"movie set perfect\" greasy spoon.  When we firs","useful":0,"cool":0},"7eEQJAmlWqUppEjg0ma9DA":{"text":"Firstly this is NOT a cheap option: The chicken sandwich + fries cost $10.83 excl tip. Sec","useful":1,"cool":0},"ZnD5m5W3LtjgczghfD2SeA":{"text":"Hay our waitress, and our grill chef Taiwán rocked our breakfast this morning. I ordered t","useful":0,"cool":0},"6T-Q3safxVI8Rg70sWB6OQ":{"text":"The craziest place for breakfast in the Big Easy. A major classic.\n\nYou watch your food be","useful":0,"cool":0},"H8k3LCUuRY9dfIpN1kZ8lQ":{"text":"Absolutely not. Let's talk about civil rights. Picture your inebriated, cold, female self ","useful":0,"cool":0},"cN5oORImgJnMtvmozWp4Sw":{"text":"Great diner food! I go here for breakfast and a show. Sit at the counter and pay attention","useful":0,"cool":1},"12qf_jjFChvJV7r5tDSeoQ":{"text":"What can you say to possibly top the fact that they will cook your burger (to perfection) ","useful":1,"cool":1},"mUGgJjkAKdWNvwAB5LbWKA":{"text":"I used to love this place I'm a local so we've been here before. The burgers are cooked un","useful":2,"cool":0},"MpxWdHhnObdJM0O6mJeWew":{"text":"Quirky grill in gay area of Bourbon, perfect for a bite before the ghost tours or after yo","useful":0,"cool":0},"-eip0yEJJfJtGh_iabMsWQ":{"text":"Excellent. My group of 9 squeezed in and were promptly served. The waitress killed it - ma","useful":0,"cool":0},"SX_1Q2rCNdwcl5QAYr9DWg":{"text":"If I wasn't told about this place, I would have never walked in. Grungy from the outside, ","useful":1,"cool":0},"dv5uKJfE3J1t77_HyMwVuQ":{"text":"Definitely one of the best burgers I've EVER had. EVER.\n\nBreakfast was quite good as well.","useful":0,"cool":0},"hssJBUVRkDKil3mXOyz-DQ":{"text":"Guy has the best customer service. He has made me the best golden, crispy fries in the wor","useful":0,"cool":0},"d5T_8-TuzuIbq8xoMsjW4A":{"text":"This is a little diner, if you want a good sandwich (I had the club and its huge), burger ","useful":0,"cool":0},"KTMFS_YXuLg8HDnllJwkFg":{"text":"Just wasted 1 hour waiting for breakfast. We left. 1/2 outside and 1/2 hour waiting to hav","useful":0,"cool":0},"rAtYYIh4oDedeU5vWZCvnw":{"text":"Classic greasy spoon place with super friendly service in the heart of the Quarter. All or","useful":2,"cool":1},"H4NNAlWnyRM7pHoOLZHM8A":{"text":"This place is amazing, we don't have diners where I'm from, so I was eager to sit at the c","useful":2,"cool":3},"D7QE-5PSd5Z2_c1_2xJJ2A":{"text":"This was by far my favorite divey diner experience. Unfortunately I wasn't drunk- I'm thin","useful":3,"cool":1},"fuedtTch__c9ZguH4RR5iQ":{"text":"Customer service is great here. Small place but worth the wait. Hubcap burgers! YUMMMMMM! ","useful":1,"cool":0},"nL-Osq06aTj2wUXu445Iug":{"text":"As many have said before me, the Clover Grill is a greasy spoon, and oh, what a greasy spo","useful":1,"cool":0},"y2XexxzWmX4wkFrjsurLjw":{"text":"Great place 24 hours a day to eat.  The food is better than the crowd.","useful":2,"cool":2},"5tlutlLWNNxk1TElUfMZhA":{"text":"Maybe I didn't have enough to drink before going in.  It looked promising.  A little greas","useful":0,"cool":0},"7GWAsmJRfIXOJaw7ix9-fQ":{"text":"Delicious!  Great music!  Nice place for a casual burger in a throwback diner!  Love it!\n\n","useful":0,"cool":0},"l0hqSR_IJIdxqpMosLztjQ":{"text":"I absolutely adore this cute little place and what a lifesaver after waddling around Bourb","useful":2,"cool":0},"_L2wtz4BpXdKcKu2SPmXcQ":{"text":"The service is random...i was there one night and the waiter was on top of things and havi","useful":0,"cool":0},"JowyNT_p2KuhJJ1pYtH8NQ":{"text":"Do yourself a favor right now and read the 64 other reviews NOT Recommended!!!!! Don't sup","useful":5,"cool":1},"HFFayk8Q_PU03BcxPDRxbQ":{"text":"What can I say that hasn't been said?  Great food and great prices.  I don't think the pri","useful":2,"cool":2},"IziEwc0ZlcBJDEJkWK6h1Q":{"text":"Great place to get a bite to eat anytime of the day or night in the French quarter, of New","useful":0,"cool":0},"TF3su94YUB_9WS8ZCvV1RQ":{"text":"We stopped in for breakfast, ordered 2 bacon and cheese omelets, and left feeling sick.  T","useful":0,"cool":0},"G5w3o6WN2MyEMNkizc8wvA":{"text":"It's been a few years since I've eaten here, but after seeing all these polarizing reviews","useful":1,"cool":0},"RWI5RtwEKpx-Aevwem-dwg":{"text":"I agree with most other reviewers.  The food is okay, but the staff really make a bad plac","useful":0,"cool":0},"UncZS4PnftD_PTWKqnV8Ig":{"text":"We've always loved a good diner, and this is one of the best. Friendly people working ther","useful":0,"cool":0},"2OIJQ0X6vX6sW0fyeWq6lw":{"text":"Been here many times, i've just been too intoxicated in the past to leave review.  Not say","useful":0,"cool":0},"4xaw9gSADKBYUJBzxfi8kw":{"text":"A great late-night greasy spoon.\n\nMy fella and I stopped here after a night on Bourbon str","useful":0,"cool":0},"X5VcncilU-DE1tHVhCIh6w":{"text":"Wonderful huge ass burger. Nice people, and diner vibe. We came here late night and had an","useful":0,"cool":0},"q2ZWRwOjeEaukmjpieRBRg":{"text":"24 hr diner with a simple menu that includes breakfast, sandwiches, burgers, and limited d","useful":0,"cool":0},"YDihObwhxRhgtG0o_japxw":{"text":"Great place to warm up and get all the calories you need for the day. On Thanksgiving we w","useful":0,"cool":0},"liu5EaVS8nO_42UjskXPiA":{"text":"This place has gone downhill in a very bad way.  The food is just bad. This place is notor","useful":1,"cool":0},"paF1RwnShaHwyu9dmQstXw":{"text":"Easily the best menu in New Orleans. That has nothing to do with the food, if you've read ","useful":0,"cool":0},"L0nxaXJPm84O4hLV3cLldg":{"text":"Hamburger, hamburger. If that's what you want then this is your place. I've had burgers al","useful":0,"cool":3},"JpKqZvJsK_bjG89zWQUf0A":{"text":"Hands down the worst customer service from a waitress. Ever. She was so damn rude. I was r","useful":0,"cool":0},"geVkKsY_XWNLfOEYU9lVFQ":{"text":"food was kinda pricey for what i ordered. a small grilled cheese totaling to $5 was crazy ","useful":0,"cool":0},"OqLhDRUrkX70JHspABwFCA":{"text":"3 stars is considering what's open between 2 and 8 am. The grill renders great interpretat","useful":0,"cool":0},"OEimzwmyBr2Vca4SStguCw":{"text":"This is one place we always hit while visiting NOLA. The cook is Hilarious! Can come off l","useful":0,"cool":2},"CYZXkFhRtiZfBlRK26phCw":{"text":"Haven't been back to No-LA in years but this is a very fond memory. Reminded of clover gri","useful":0,"cool":0},"hknhsxG4yl_imsUH-BM7VQ":{"text":"The Clover is a great place to come after the bars let out. The interior is charming with ","useful":0,"cool":0},"spsMqeev0069rIKSWYIEbA":{"text":"Who doesn't love the Clover Grill?  The burgers here are a late night staple along with th","useful":2,"cool":1},"aUH2MNlJotfnxRAAoVZLEg":{"text":"This is one crazy dive! Don't remember what night we were here (New Orleans right?) Got Mo","useful":0,"cool":0},"mjkCY2dshRiTM3n0b1h0bg":{"text":"Good food, fun environment, great staff = Excellent dining experience.  Whenever someone t","useful":0,"cool":0},"ftjdVjh0KSAkg36Q54YTkQ":{"text":"This is the BEST Bourbon street option for food.  The onion rings were next level and the ","useful":0,"cool":0},"NZYJwh1DnDdY56RhuK4V2Q":{"text":"Cheap, very tasty, very friendly service.  I love diners and this is one of my favorite an","useful":0,"cool":0},"INri5nU9VhrG_Eb0Qvdfdw":{"text":"Never again!!! This was a horrible experience! I went to this placed based on a recommenda","useful":1,"cool":1},"3-9m2Wozx8dbtyRyeRhsLg":{"text":"Wow, we a group of 6 stopped by after serval drinks and they made all of our food perfectl","useful":0,"cool":0},"1kaLudBGhdEDrzdIaYVkeA":{"text":"This is a place to come when you are very drunk, it's 4 am, and you want an omelet.  Thank","useful":0,"cool":0},"PU5LjPvR9na5MB4cdtckJQ":{"text":"This place advertised \"the best hamburger in the world\" & I don't think it's much of an ex","useful":1,"cool":1},"Sgr09cBUtwh3d8dhINctew":{"text":"Contrary to most of the negative reviews of the Grill, my wife and I thoroughly enjoyed to","useful":1,"cool":1},"mVYM0Kbz_7cR-qOyZDh8Cw":{"text":"Clover grill is a dump!!! The food is garbage. Might as well eat leftovers or food off the","useful":3,"cool":0},"YaBk9Ajd9YWsvHBpImYnvQ":{"text":"Clover Grill offers a great breakfast special at a good price. The grits were exceptional.","useful":0,"cool":0},"i1hOROPiHQ8cGYer8_CKzg":{"text":"Loved this place, perfect little diner for late night cravings (or any time, actually!)","useful":0,"cool":0},"ADTDBT-__XFkgd53Xx_H8w":{"text":"This place is a effing dumpster fire.. out of 1 onion rings 2 mushrooms 3 tots.. no manage","useful":0,"cool":0},"Wcl1ygYtTt5kP6NQm98GWw":{"text":"Clover Grill serves up some of the best 2am drunk food known to man. They are open 24 hour","useful":9,"cool":8},"bcstzVd3-9pQ5aDnssn1KQ":{"text":"Omg Liz was fabulous. She rocked our. Worlds while we waited for some damn good eggs and b","useful":0,"cool":0},"yeqJHx9SSdGwsk0evs4Zog":{"text":"This is the perfect place to go to suck up your alcohol after boozing in either the Quarte","useful":2,"cool":2},"Svm_OcRZjg5IeEaGGu1szw":{"text":"The Clover Grill is a must in the French Quarter if you need a break from Cajun cuisine an","useful":0,"cool":0},"OR6TjiwxiY38VDcZaUsM5g":{"text":"The worst service I have ever had! Do not bother, the food is not worth putting up with ru","useful":0,"cool":0},"pa9Ug71TGx7pdCpXOCfSfg":{"text":"Great, genuine service with rapid delivery of my order. Also able to take home a little me","useful":0,"cool":0},"Gg9ELa0hs99t4wGX2Jsh5Q":{"text":"Never would I ever go here sober. I made the mistake of using the restroom and then going ","useful":0,"cool":0},"IlfTiJsPGIbsJBGBTAQLmg":{"text":"Late night eatery. A most on Bourbon Street. Burgers, tater tots with chili and cheese are","useful":0,"cool":0},"vQ0nLxAE-fsjNPbt0WNVcw":{"text":"The burger is amazing but the staff cooking are consistently pissed off to the point it's ","useful":0,"cool":0},"5kAXORz89tHt06FqL9-G3w":{"text":"A wonderfully unique and small diner with a great staff and music playing in the backgroun","useful":0,"cool":0},"bywH46m5cYJkElNmgGeoeQ":{"text":"Classic 50s style diner. Don't go here expecting a fine dining experience but if you like ","useful":0,"cool":1},"tkD09XRfuTv1byx04wj5FA":{"text":"When it comes to diners... this is an okay place to go when your drunk and hungry. It's on","useful":0,"cool":0},"uJxHl8_xALqTfj9w1IEmGg":{"text":"Our small pension in the French Quarter recommended the little Clover Grill. We came for b","useful":0,"cool":0},"Dini762TDO4DFuIp0auLjA":{"text":"I loved a quote from one of the Yelp reviewers, \"an oasis in a sea of drunkenness that is ","useful":0,"cool":0},"ih5j6NSD6B_ZFnq7n40ZJA":{"text":"The Clover Grill is your typical greasy spoon place to eat for those looking to cure their","useful":2,"cool":5},"gP51Fd2HziZR1EMU1mQgNw":{"text":"This was a great hole in the wall place and the price was amazing! They give you lots of f","useful":0,"cool":0},"yljdN7tsY_aMe3f3InyaIA":{"text":"The grumpy rude staff mades this average diner food horrible.  Might be good at 3am when n","useful":0,"cool":0},"DB_LJv4EKLvQnGf-wLPyYA":{"text":"I think every place in the U.S. should have a set of the clock collection at the clover.  ","useful":0,"cool":0},"EZMYiqawIVoGwNVgvWD1uA":{"text":"Walked in, no one greeted us, all empty tables were dirty. No effort made, whatsoever, to ","useful":2,"cool":0},"5CNrVop6YDgTb_k2O9p3WQ":{"text":"Came from out of town and was recommended this place walking home drunkenly and it is hand","useful":0,"cool":0},"NTocJ7lce18Bp5JpjvuFLw":{"text":"This place is awesome!!   Great burgers. Great country fried steaks and most of all WONDER","useful":1,"cool":0},"2_UBkjn9Z_aHZiPx78o9pg":{"text":"Great late night eats in NOLA. It smelled so good that I had to eat there. The burger was ","useful":0,"cool":0},"Pxj587q1X5fYZ1hQ_FKtyg":{"text":"Sssslllloooowwww. And unnecessarily so. Johnny Mathis waiter wasn't just slow. He was also","useful":0,"cool":0},"4BZya5br2ArYOc3X_4LxmQ":{"text":"Perfect hole-in-the-wall  no frills diner. Midnight order of waffles, burger, chicken frie","useful":0,"cool":0},"Gp59hGjoGvLJ0amA9EZe5A":{"text":"Late night, greasy yum! If you're looking for posh dining, this ain't it! This is where yo","useful":0,"cool":0},"3M89EsFW1VIDDJw0P61vwg":{"text":"I fed four people for $30. I'm from Seattle, so that in itself warrants a star from me. \n\n","useful":1,"cool":1},"De3V7PvBgY0Gv382X4K_jQ":{"text":"Awesome greasy spoon.  Sure, it's dingy and greasy, but it has tons of character, and you ","useful":1,"cool":1},"pkM34swkkU4bVW0pMfCA_A":{"text":"Good restaurants know that if the menu is short and they do those things well, they'll be ","useful":0,"cool":0},"6_hlHvzReRYmFiaobZu87g":{"text":"Well sitting at the counter is definitely interesting as you get to see everything. Be war","useful":1,"cool":0},"oEfvBX_C2WkX-H1U3G8Qtg":{"text":"Clover Grill is an unassuming little diner on Bourbon Street. Both days we were in town we","useful":0,"cool":0},"j3uABCQ5KI4ICffeKZrovw":{"text":"Great  FOOD, Prices & Staff. As good as it gets in the French Quarter!  Be a Clever Girl &","useful":0,"cool":0},"Tmp4squ4ZaJ59imNlfPaYg":{"text":"My husband picked this spot for breakfast as he was craving a burger. The inside is small ","useful":0,"cool":0},"1_GAimD-Ol7omoiTZk4z2Q":{"text":"The diner is very small and very limited in space but the food was good. I had eggs overea","useful":0,"cool":0},"7nITK7jLyJQw_EEId3dGjQ":{"text":"We went here to wait for entry into the New Orleans Historic Voodoo Museum and it was amaz","useful":0,"cool":0},"7hhUd89PBvgkT3Q5dckJKw":{"text":"Clover grill is exactly what one might expect from a 24-hour diner on Bourbon street. The ","useful":2,"cool":0},"b_2iN0gwCVBHMBhMmKT-ZA":{"text":"If I could give 0 stars I would. Service was horrible!! We sat 20 minutes patiently waitin","useful":2,"cool":0},"ZVv4tG1cYbGWVLAjfHH8Cg":{"text":"It would ACTUALLY be 0 stars. The food is definitely not worth the price. F.Y.I. if you ha","useful":0,"cool":0},"32Z82KXs5IYB7Lnkl--Z9A":{"text":"After New Years Eve on the historic Bourbon Street, we needed some grub the morning after ","useful":1,"cool":1},"xKmXNEhKagRjrNELEs73ZA":{"text":"This is my favorite burger place so far! They serve authentic American food at the busy co","useful":0,"cool":0},"f5eTM5LGnDMEwtzqNycKfQ":{"text":"Looking for place to eat lunch away from the busier areas of the french quarter my wife an","useful":0,"cool":0},"HFB-egdyt42VLZZfBGE77Q":{"text":"This is an awesome little hole in the wall at corner of Domaine and Bourbon! Food was grea","useful":0,"cool":0},"jQkBnQ3hgmkdFMiQ1qRATg":{"text":"I hope this review serves as a cautionary tale for anyone who might even briefly consider ","useful":12,"cool":1},"jO-d_Y7t6Xzcqxem5TDQiw":{"text":"Best place about this dive diner is that it is 24 hours, next best thing is that it is che","useful":5,"cool":3},"gpPAxp7yhTJuB4A5xEVZgA":{"text":"My go to spot when I'm in New Orleans and looking for classic diner food after a long nigh","useful":1,"cool":0},"nW39qyGb5aAYea70Cv1kQA":{"text":"I was very unimpressed with this place. A few people recommended it while we were in NOLA,","useful":0,"cool":0},"O8CVwV0HVU_PGRhU1fWbTQ":{"text":"The worlds best burger??  Not even close. Not even the worlds best affordable burger. Go t","useful":0,"cool":0},"0uUZXggXfTgTCCgpDEto6A":{"text":"I first went to this place in the mid 90's and they are still alive and a great place for ","useful":0,"cool":0},"T4NyGLN_nzWY5u0C4M4_2A":{"text":"I don't know how the food is because after we ordered and were waiting the grime in the pl","useful":0,"cool":0},"SW7K7y2cmtVkiD9t90ILew":{"text":"During my days of going out and staying out until 4AM, Clover Grill was the place to get y","useful":1,"cool":0},"CGbuxEW-_JeKyFcU3DX-7w":{"text":"I was strolling down Bourbon street when my noise picked up the scent of burgers cooking. ","useful":1,"cool":1},"X0h86bqJB4KP5DxuWmILTA":{"text":"Read the comical menu and enjoy the fun with the staff.  Good burgers, hand battered onion","useful":0,"cool":0},"gOJzpprUv7rd4Sy7Vlo2_Q":{"text":"I've eaten lots of food. This is among the worst. The kitchen was visibly repulsive. I do ","useful":0,"cool":0},"YNZly4ZTc5f8ifGoQWH9Ig":{"text":"Good burger... it's  huge and perfect for post debauchery meals. The service was ok... one","useful":0,"cool":0},"w_iIpD5GVj47MyFI2OMZhg":{"text":"A friend and I were trying to figure out what to eat (always an issue in terms of food opt","useful":2,"cool":2},"GTNHVYE-CrAvFZAW3AYEhw":{"text":"Such an amazing spot! Go. Eat there! They didn't have onion rings but the fries and the ta","useful":0,"cool":0},"utAVsiMyQBgU-d6KtAkq1A":{"text":"Okay, it's a NOLA institution. The food is just okay - find when you're drunk or hungover.","useful":0,"cool":0},"1NbVYDmEOyo_9FwE0K4BRQ":{"text":"First New Orleans diner experience perfect for late night \"heavy\" munchies. They are proud","useful":0,"cool":0},"MQ_fu1WdXH-XIlDOr58eGA":{"text":"Not sure if we came at a bad time (7am on a Sunday), but our final meal in New Orleans was","useful":3,"cool":1},"tRKR4hIVBJ53CNDGKH3NSA":{"text":"Order the pork-chop steak，but has the hair on it, talked to the servers, no response at al","useful":0,"cool":0},"1pE9zjF99BLN-ew88kt4Qg":{"text":"24 hours and accessible is the reason we gave two instead of one star. We enjoy divey, gre","useful":0,"cool":0},"aLdLArjaUJZBK7YA7e_twg":{"text":"Yum.  Love to go here after a night in the quarter.   \nGreat Burgers & open all the time.","useful":0,"cool":0},"ZH-Qv2F6DupA5INTfdxoLQ":{"text":"Stopped by for breakfast on a Friday morning.  Ordered the Chicken Fried Steak and Eggs an","useful":0,"cool":0},"hO_3iy9iBEk5KbgkYqryPA":{"text":"Pink, and Faaabulous!\n\nClover Grill was a hit-and-miss situation, with 3 visits to this li","useful":2,"cool":1},"1pO30TY0wJUMQVid5XAthg":{"text":"If you're visiting the Big Easy and want a break from creole food (almost never happens) b","useful":0,"cool":0},"cHiGVWuKYuDMEmHNPpMjHQ":{"text":"It is a diner for gahd's sake....  some of these reviews just make me shake my head.  What","useful":1,"cool":1},"za0UQoX0aANjZo_IlS_32Q":{"text":"I dont understand how the food is so freakin good! Food is great & service is personable. ","useful":0,"cool":0},"ffpmizEo7i6iGFwPtXrEFg":{"text":"The burgers are really good. The entire place was run by three guys and the wait for food ","useful":0,"cool":0},"tesON8E7VV9GdXma7Y88Pw":{"text":"A small greasy diner in the French quarter. A nice get a way, a nice rendezvous after a dr","useful":0,"cool":0},"7ygXBr-6o8aK4BjSdoWukg":{"text":"Wow! This place was sooooooo good. The food is awesome and the customer service is great. ","useful":0,"cool":0},"wrV3L2fxCUcBRSt9ekhDVg":{"text":"24 hour eats. If you like a little sass with your omelet, this is your place! Disco dancin","useful":0,"cool":0},"ScMXCD5swFEOJdMqH_JDcQ":{"text":"I usually end up at this cozy diner when I'm wandering around at night between Bourbon str","useful":6,"cool":4},"AkQbnnqwWGWV_JiEKEqWyA":{"text":"I recently returned to NOLA....this great place NEVER changes.  Same great food, same ecle","useful":0,"cool":0},"lARoLDcX5Yf2xhDsvolYjg":{"text":"It always seems to be an event when I get to Clover Grill, and I hate that special abbrevi","useful":2,"cool":0},"PF6mgVQUsJ75-Hq0Y0697g":{"text":"Stopped in today for a quick, no-frills lunch while wandering the Vieux Carre. Real old-st","useful":0,"cool":0},"_nQ2UNG1cMTcSOVECM63dQ":{"text":"I cannot believe anyone would give this less than five stars. Obviously these people are n","useful":0,"cool":0},"Vifu_MFJ7rcT2KZOjuZ1ag":{"text":"Staff is rude they  do as little as possible.\nBad attitude\nBroken front door and they do n","useful":0,"cool":0},"FbZSl8QJdPq-ETL4aWYS6A":{"text":"Phenomenal burger.  My wife loved their fries.   Reasonably priced and close to everything","useful":0,"cool":0},"CAMJhAgYmYvoPgChGRzm2g":{"text":"Love this place!  Crowded and a bit of a greasy spoon, but worth every second spent savori","useful":0,"cool":0},"gJlwc7WlwFcLFbeu7l41sQ":{"text":"Great diner in the heart of the French Quarter. This is a small diner that fills up quickl","useful":6,"cool":3},"Jiv_AvD2j65tG7Vhf_PNiA":{"text":"This place is a hidden treasure. A classic American diner frozen in time. No frills just g","useful":0,"cool":0},"3a7m3Qwa83GcIezwC07BJA":{"text":"We came to this establishment, tired and hungry after a New Orleans tour and the service w","useful":0,"cool":0},"dBoXtSDQy2oGyDT8wksLVA":{"text":"Everything I was hoping it would be. And more. A quick trot down the French Quarter from o","useful":2,"cool":2},"ngqZhlAYHqDfS2v_c04j9A":{"text":"No-fuss, no muss\nDo you want good old fashioned diner-style food? Then you have come to th","useful":1,"cool":1},"OAznxhHRWo15tLxcPADSIw":{"text":"Dirty and discusting.  Floors needed washed. Food under the grill. Food was good but if I ","useful":0,"cool":0},"ILDa6AVyvegbR7X3XXtXPg":{"text":"So we're in the French Quarter, juiced up in 151 and 190 proof slushies. I'm not in the mo","useful":1,"cool":0},"DesgXOhcGMqiMd5M9VlPGA":{"text":"Little dive diner in the middle of the French Quarter on Bourbon St... what more could you","useful":14,"cool":10},"MideEmBKzSu7sHXDI8Txzg":{"text":"COVID REVIEW:\n\nif youre not looking for simple and delicious food, keep it movin!\n\nClover ","useful":5,"cool":5},"JYWDd5qvdAGJnoH3qmeVtQ":{"text":"This is a good place to go especially late when you just want some comfort food.  When we ","useful":10,"cool":8},"Qm_ONecrxxbtn5THAVyyGQ":{"text":"This place intrigues me.\n\nIt's in a prime location in the French quarter, it's teeny tiny,","useful":5,"cool":2},"IlGJO14s0jxhrXuLnb4dBg":{"text":"Greasy spoon hole in the wall that is cheap and open 24/7 to help soak up all the booze on","useful":23,"cool":19},"kLqXipzzOqAKzMeHSASrvQ":{"text":"If you can find a better place for lunch in NOLA, let me know. Our server was a doll, and ","useful":0,"cool":0},"trktV9b2hMPneAnagWFrNw":{"text":"Had burgers here on 8/20, the week before Hurricane Ida hit with my wife.  They were delic","useful":0,"cool":0},"nEwL8Qfvf1Ox1maNWUB6bg":{"text":"How does one describe, The Colver? I think that's kinda the point, you can't.... late nigh","useful":1,"cool":0},"LLBLOI-duI-t4OuutpDFNg":{"text":"This place is a total old school greasy spoon diner. Sits on a corner in the French Qtr an","useful":0,"cool":0},"E9c7jBTeaeyKob3F7fXLVQ":{"text":"Are you drunk?\nAre you hungry?\nBoth?\n\nClover Grill got you covered! Serving breakfast, lun","useful":2,"cool":0},"E-sbSZabzuGEUnKtlbHm9A":{"text":"Wow..I have heard about this place for years and I have been to New Orleans a few times an","useful":7,"cool":6},"kMOg0QbdF5_jh8p_dNQeCQ":{"text":"So there you are, drunk in Bourbon St. (again) and your stomach starts demanding something","useful":2,"cool":2},"RU4N6hz3GYGOPrhjVWnRcw":{"text":"Hadn't ventured into Clover Grill in quite some time, but was presently surprised on a rec","useful":1,"cool":0},"AL5g7qgXMKgjILmHlvQxlA":{"text":"Great old school diner. I have a high grease tolerance. Smashed burger looked great. 3 egg","useful":0,"cool":0},"t4ylo_C5YciNtO-bI995oA":{"text":"delicious greasy hangover food. super old-school diner with large portions and classic men","useful":1,"cool":1},"gSbe_aNBE3AYn1nt9rm8_A":{"text":"Everything is pretty much shut down and we started looking for dinner kinda late. We stumb","useful":1,"cool":1},"tTww1DDcLyDMbKdJxHzTVg":{"text":"I came here 02/19/2020 came with my family . I was sitting down and one of the cook killed","useful":0,"cool":0},"pqtqsxxskQBQDQs5-2QmUA":{"text":"I absolutely love this place. The food was great and the whole staff was awesome. Special ","useful":0,"cool":1},"93k_7mx4GxpAAqv3dqs_rA":{"text":"It doesn't look like much but if we come to New Orleans it is a must! It's a tight fit but","useful":0,"cool":0},"cZPLtLmnraxRow8HHHJqzA":{"text":"Stopped here for our last meal before heading back to Utah. \nOrdered two egg breakfast wit","useful":0,"cool":0},"7lkbd12qvSOk_dC-cnsY2w":{"text":"We sat down at the table outside just to have a seat while we look for something to eat an","useful":0,"cool":0},"g5qIlCh3DcEcovcVjQwtjg":{"text":"Talk about local.  It doesn't get anymore local than this.  They serve up what they have a","useful":1,"cool":0},"-q6PQPt4a-Cws-ePsLRBIQ":{"text":"My wife and I stopped in here after a long night of partying. The next morning when I was ","useful":1,"cool":2},"yIu4WuI8_cCHgNhpDSBvHg":{"text":"This place on reviews indicated it was delicious & world famous.....not sure what for thou","useful":0,"cool":0},"qrJKl3j_nGY5zi3Vvp__Gw":{"text":"Excellent diner stopped here for breakfast. It hasn't changed over the years, the service ","useful":0,"cool":0},"Xx-Aou1LdyqdHXrwwKLM9A":{"text":"I came in so ready for some hash browns and eggs. Too bad the waiter was so freaking rude ","useful":1,"cool":0},"arB99XeGVZSYl-FenrzD2w":{"text":"Loved the food, but it was kind of small. I actually liked everyone else's food more than ","useful":1,"cool":1},"AREXSN_DKyNpltW9yYfNOg":{"text":"Went there to try the hamburger, they claim it is the best.  I asked them to cook it mediu","useful":0,"cool":0},"-z6YvXRIYc_hMJh-19iNbA":{"text":"This place has always intrigued me especially after having walked by it hundreds of times ","useful":0,"cool":0},"5uyR8SlJ4B3ptirTFRMXlw":{"text":"Great burgers and they had no trouble with us wearing kilts... unlike Antoine's who would ","useful":1,"cool":0},"v5uJQeUNTfX83N5ZONJfow":{"text":"Was looking for something yummy and inexpensive. Found it here. Great food. Great service.","useful":0,"cool":0},"Q7K5thlabs0kX01gUfXbIA":{"text":"I think restaurant reviews over use labels like, \"hole-in-the-wall,\" or \"greasy spoon\" for","useful":0,"cool":0},"5L4LlIfjnxuZDEgumQE1iw":{"text":"Love this hole in the wall. Really appreciated this place after a night on Bourbon St. The","useful":1,"cool":0},"-MmF6JBxW-ddxjRrdhxqIg":{"text":"I LOVE the hole in the wall places, but this place... not so much. \n\nThe waitress was rude","useful":0,"cool":0},"FwCyDuX2lRSD9kkSLeuv9g":{"text":"This was more an experience than a good meal. My boyfriend talked this place up because he","useful":3,"cool":1},"fRbMh1gALI3kOv5tfK2kIw":{"text":"This is by far my favorite greasy spoon. It's a small place on the corner of Bourbon and D","useful":0,"cool":0},"cHvRnpv-pdTSJDNkekExvQ":{"text":"If you're not drunk, avoid it! Don't ignore all the negative reviews while hoping for the ","useful":1,"cool":0},"m3f8Rq8NOppz8dacfrPcIA":{"text":"The little corner spot is known for having the best burgers! I tried one and it was great!","useful":1,"cool":1},"Ff4H4K1HL9d5sfpUxFBt4Q":{"text":"Small, old school \"Did I just walk onto a movie set?\" type of vibe.\n\nOur tour guide pointe","useful":1,"cool":0},"ZNRB6jSuYrTDmxlTol7QLw":{"text":"Me and my friends are at this sandwich place late at night. Was exceptional except for how","useful":1,"cool":0},"fQUHqHKHDTAXTgj5UVst5A":{"text":"I was lucky to visit NOLA during Mardi Gras season pre-pandemic. We enjoyed our first brea","useful":1,"cool":1},"L5fx_vo_66wVe9C6JHlf1g":{"text":"Crap. I used to come here more than 5 years ago. Annually. Now= assholes. Left us outside ","useful":1,"cool":0},"Y0HsCJYshuxKHqdAVRzqrw":{"text":"The portly line cook who has a desperate beard to try and compensate for his receding hair","useful":2,"cool":0},"sXmhU4HBuAvBIPHbgiQXdQ":{"text":"I was refused service after a lady told me to sit at the counter and then a group of four ","useful":1,"cool":0},"iDIVW9ZSns9cY8SMnllK0Q":{"text":"First things first; this place could just make waffles and burgers and stay open. The waff","useful":1,"cool":0},"ps-yyBQDU6NUkM07tm2e9Q":{"text":"Come try this cute small eatery out.  The guy that's the server is awesome and the food is","useful":1,"cool":1},"czUlOxkUyhEoCDaDKiWGvA":{"text":"5 stars. The omelette is very impressive. It is smelled really good and warms you up after","useful":0,"cool":0},"Rgh1y_u1fCrzs-shf4P-pw":{"text":"What a fantastic place for an all American Hamburger  with French Fries or Tater Tots! The","useful":0,"cool":0},"SoO2n9Z8zG9uR0s88pzkuQ":{"text":"Clover Grill is AMAZINGGG. We walked in late night and sat at the counter, and ordered the","useful":3,"cool":1},"zxNRY2raZfS4PkM3Utc76Q":{"text":"the. best. burger. in. my. life. \n\nokay so a former prison inmate made it at 3 am! child t","useful":1,"cool":1},"1QoZ4A8Vfr93Ant3ZkvwEg":{"text":"Definitely my favorite spot to eat in NOLA. Went their twice and was not disappointed. Fir","useful":0,"cool":0},"XVuL0-BGDZB6yAQ72nJLQg":{"text":"I needed fries to soak up my booze & don't forget to leave a tip...\n\nDay drinking on bourb","useful":1,"cool":1},"GQGEqhhFXcA29LWh90OSFA":{"text":"I dont know about their \"worlds best burger\" claim.  We stopped here for dinner our first ","useful":0,"cool":0},"pFwx6Gns9A8Ha1fjg_gQiA":{"text":"CATTY: wait staff, that quickly size-up each patron and serve them accordingly;\nUNIMPRESSI","useful":5,"cool":5},"zg1Jeyy6qtUMk-IemU6G8g":{"text":"Small hole in the wall Diner with great food and great customer service.  I had a breakfas","useful":0,"cool":0},"bzymjG-NqmyUSeztLgWENg":{"text":"5 stars for what it is and what it is supposed to be - and many of the 1-2 star reviewers ","useful":2,"cool":4},"Euyi4LmQUsoKWwwKB20-cg":{"text":"When it's busy, expect to wait at least an hour for your food - it's a tiny joint but they","useful":2,"cool":0},"TF5qNp0Yn6nmXFM3L1Zxkw":{"text":"Burger was delicious. Thick and juicy. I loved it. As well as the onion rings. As for the ","useful":1,"cool":1},"hYgJ2UmdYhBOb6-CsgHQmQ":{"text":"Best cheeseburger I have ever eaten in my whole dang life.","useful":0,"cool":1},"e5OaaSuuA1Cg6ChJLCMjIQ":{"text":"This is a nice little hole in the wall 24/7 breakfast diner by bourbon street - they have ","useful":0,"cool":0},"JxiKa9ug4Cr4Rv_Z_TBlYg":{"text":"For the average person who isn't intoxicated, this diner is incredibly rude and degrading.","useful":1,"cool":0},"Nb_2REjWBF769W5rwX8yCQ":{"text":"Can I give a no star? Seriously, sat down at a dirty table. A friend HIGHLY recommended th","useful":5,"cool":2},"Kf3JYS8sP7-LRS-JK3D6Uw":{"text":"Breakfast was horrible.  Bacon was cold.  Toast was nothing more than warm bread.  One fre","useful":1,"cool":0},"mvhddpIDIvjq2cFor1zGxA":{"text":"I used to come here all the time and would get classic diner food and was never disappoint","useful":0,"cool":0},"N5ZOODqo_22a-6L5adLNVg":{"text":"Ramon was the hit of the night on this impressive little hole in the wall. Every staff mem","useful":2,"cool":0},"ViCc1sPdXpzf0rc13F_W-w":{"text":"The place was half full, I sat at the counter, right next to the grill man and waited 12 m","useful":2,"cool":1},"alJlOOUVxVE_YBjLXprhIA":{"text":"Excellent service & the best omelette and the best chicken fried steak we've ever eaten!","useful":0,"cool":0},"ZX-7DJ4lUlRHSVe1bSQ5qQ":{"text":"It was Christmas Eve and I stopped in to get a snack, grill cheese sandwich with bacon to ","useful":1,"cool":0},"jENJzuaK9oBc-eoIVJeZFg":{"text":"Looks like a regular breakfast joint from outside but don't let the appearance deceive you","useful":0,"cool":0},"klDORRybGzQlbxlUuAUt8g":{"text":"I just HAD to find this place to give it 5 stars. It was such a fun and memorable experien","useful":2,"cool":2},"Z20O5Qs0bXytFBrw6RDcQA":{"text":"So I'm a bit torn on this. The food was typical diner fare - limited menu of a few breakfa","useful":1,"cool":0},"GeRQtFAQxeqrqlqymeR-IA":{"text":"Omg  the best drunk food ever!!!! Ok it's still really good when not drunk. It's a must st","useful":0,"cool":0},"ClwLZLQLSXTRzsJObSzuRw":{"text":"In New Orleans angekommen waren wir Abends im French Quarter und etwas überfordert mit all","useful":1,"cool":2},"1oQ-ysY_MbiG88RKrHJCAA":{"text":"Sometimes the most unassuming of places are the most pleasant surprise. That was certainly","useful":0,"cool":0},"mfmIV01dtC7wHx6Mi6NpQA":{"text":"4.5.  Not sure not a 5.  Let me think on it.\n\nEasiest way to describe this place is a Gay ","useful":3,"cool":4},"uNz_C3r4qkQQ0oJYq-ndXw":{"text":"Perfectly cooked burgers. Friendly staff. Amazing everything. Looking for a cheap burger a","useful":0,"cool":0},"Sn6JIIv-lQRWSPL_RCvZxg":{"text":"If you come to NoLa for experience and you don't come to the Clover Grill and you DON'T ha","useful":0,"cool":0},"Jq1W6zVQcPARE8k3-kNNEw":{"text":"OMG!  Some of, if not, THE best coffee shop food I have ever had.  If you diet, if you're ","useful":1,"cool":1},"9UywgrW7mjgSQo4kDzsnKQ":{"text":"I guess this might be the only place in all of LA where you get a healthy serving of racis","useful":2,"cool":0},"VLkQS7HddzDGsVlDxnuVzw":{"text":"Four stars if you're drunk, three if you aren't. And chances are if you're in NOLA, most l","useful":26,"cool":25},"gk2B0ed0zh72-etgv83FuA":{"text":"Wow. Horrible experience here last night. We have eaten here before on a past trip. The re","useful":1,"cool":0},"NrMmMvxST-y4_7wZyoc16Q":{"text":"Clover Grill brought me back to life after my first night in Nawlins. I didn't catch the g","useful":7,"cool":9},"m7kgsyiJ94tNRNbyC8hr6g":{"text":"This is the best diner around.....the chef is excellent, and made every order to perfectio","useful":0,"cool":0},"p61mdsWBe8kzJOUOON6qiA":{"text":"Omg great burgers, the little atmosphere was great. The staff amazing. The waiter was like","useful":0,"cool":0},"-Tjj4D3Np-sW-7rJ5wQzuQ":{"text":"We found this place purely by accident, we had been checking out bars and having drinks wh","useful":0,"cool":0},"QY134GDl2CzrDH7MQC5o3g":{"text":"Great \"recovery\" food ... Basically a step above Waffle House.\nThe food is your typical br","useful":0,"cool":0},"1SRIohyUhyJZpthL4X5KLg":{"text":"Holy Wow. If you travel to New Orleans and don't eat here, you have missed out. It's small","useful":1,"cool":1},"2rqUUOxyubgROJxjvxTIFw":{"text":"Great hamburgers and club sandwiches..  the burgers were large . Very filling., and the cl","useful":0,"cool":0},"YNYO3U78fXRhZKC5MW1kmQ":{"text":"The best food we have had on bourbon street!! And sooooo affordable! Highly recommend a bu","useful":0,"cool":0},"Jygrbk1Bcc0C32hjlfxXsA":{"text":"This diner was a nice surprise especially considering it's proximity to the craziness of b","useful":1,"cool":1},"ZDaVGWmWIpirEXH4fwTW9Q":{"text":"The best late night cheese fries after drinking at the bar! Burger or breakfast you can't ","useful":0,"cool":0},"_g4_aYQJr9mHybkK9ZEltQ":{"text":"Another old favorite haunt! Yummy burgers (I split one with mushroom, cheese dressed) and ","useful":5,"cool":4},"woQDxz7OuBJMdSEr-m_FnQ":{"text":"Went here with a friend to grab an early dinner on a holiday Monday. The place was pretty ","useful":1,"cool":0},"To66OwyLeTTidshhc0JDfA":{"text":"One of the beat classic burgers I've had in a long time. Delicious, fresh and with a sesam","useful":0,"cool":0},"nYG8_U_0C2CehWG5nDiVsg":{"text":"Fantastic Burger Dive!\nThis is not one to be missed after a night of revelry in the Quarte","useful":1,"cool":0},"uYez4rJzHPE6JKcTk1CnpA":{"text":"This place claimed to have to the worlds best burger so I had to try it. This little gem i","useful":0,"cool":2},"CE9jMOzG0IZweDW4hZMSpg":{"text":"The worst customer service in all of New Orleans. Period. Not polite, not friendly. A wast","useful":1,"cool":0},"SeJke1yPfDW9b4yI1CloTA":{"text":"Adorable and affordable! This diner style restaurant is very small but their food packs a ","useful":1,"cool":1},"Orv9w5vaSde57AT2LIGMyg":{"text":"We stayed in a room that was on Dumaine Street about half a block up from the grill. With ","useful":1,"cool":1},"Bii27m7c_sTRB1kuETM0VA":{"text":"Would have gave it no stars if could. Worst service ever ever. \nWaited forever, 2 hours wa","useful":1,"cool":0},"acR-H7h0sVZ3EMf5Npt2Vw":{"text":"Oh a good burger to top off the evening is never a bad choice.  We literally chose this di","useful":1,"cool":0},"5SEdM1ryB8FtPIivKUXF9Q":{"text":"I love going to Clover Grill.  Great burgers & fries. They always have great music and sas","useful":2,"cool":3},"3XnkL5nX4CCgrG7zcIRfog":{"text":"Dirty little whole in the wall of a restaurant...a dive, if you will. This place is card o","useful":1,"cool":0},"AszbnbuFmPraLgQ-HHfGtw":{"text":"Our group came here for brunch as it was one of the first places we saw and we were starvi","useful":2,"cool":0},"4YGmouq83VqPhU2UPIMPKA":{"text":"I saw the sign that said \"Best Hamburgers\" and I was all in. I get seated and comfortable.","useful":0,"cool":0},"L6q8xSlP5S2swa3nGqY20A":{"text":"Cheap, good food. Service was good. Exactly what we expected from the looks.","useful":0,"cool":0}}