{"4wqbi-OWqiyaZP_1xdo6jQ":{"text":"Huge shout out to Caleb at this location for quickly referring this tourist to an appropri","useful":0,"cool":0},"h2_BCL8zROerYfohbYw8kQ":{"text":"Brittany Lutz gets 10/10!!!!!!!!!!!!!!!!! She was an amazing sales person!!! I moved to Ne","useful":0,"cool":0},"PRnFBvDBPhnHZFLX3vaP4Q":{"text":"The staff at this Verizon store are not only AWESOME and extremely kind, but helpful and c","useful":0,"cool":1},"hk_qU_nbEK9iZ5aqXhxoQQ":{"text":"This is not a real Verizon store!!! Do not go here!!! They will not honor any national war","useful":2,"cool":0},"SDEGL0kZdeKKUzih3P2lmQ":{"text":"Amazing customer service! The gentleman who helped me out today made everything so simple.","useful":0,"cool":0},"36eqgw5OxLfUeHa7zixqhg":{"text":"Friendly staff, Great customer service, and the hours of operation are always convenient! ","useful":1,"cool":0},"vPyjERjhLZJ3PC4XSoBisg":{"text":"I very rarely go on Yelp to write reviews, but in this case I felt it would be a disservic","useful":0,"cool":0},"T1zbAICJp8fQwWjtzQNKYg":{"text":"Completely unhelpful!\nI was just inside this location trying to replace my damaged Iphone ","useful":1,"cool":0},"sWkY7CkgS4VWIRqOAgLo4g":{"text":"Super unhelpful these folks were. I ventured in there just before my Eurotrip looking for ","useful":1,"cool":0},"Efo5e-ZvFLpCopXEn59viA":{"text":"This is the worst company, the people who work there are not transparent, nor are they hon","useful":0,"cool":0},"7_Vea56REuai9NdQDQ8A1g":{"text":"Dont shop at this store (or any other Russell Wireless) they seem to be looking for ways n","useful":0,"cool":0},"_EEovHOw2B4x3P-4kyH1mA":{"text":"Beware.  this is not a verizon store!! I got my new iphone at this location, and I found t","useful":1,"cool":0},"zowdcYacMEa1yvtLKUYpeQ":{"text":"I was in desperate need of a wireless charger last Sunday and walked downtown to the neare","useful":1,"cool":1},"St3zAvQuoGSosyTVY9DYlQ":{"text":"I went to Russell Cellular  on Napoleon and South Caliborne and got the best service from ","useful":0,"cool":0},"jkrPfIlMlaCpspfWMgVDNQ":{"text":"Jarred was so patient and helpful. Thank you so much for your time and energy with us toda","useful":0,"cool":0},"p9bJQ5a_zEqVZ9qvQ37Csg":{"text":"Sign and paper clock in window said open at 10.  Four of us waited and waited. Nothing. I ","useful":0,"cool":0},"pNx05Wn5nC9yzHl7KPHusg":{"text":"DO NOT USE THIS STORE!!! If you buy anything only purchase accessories here. Do not purcha","useful":0,"cool":0},"OG3dOUon3X-kPbjdYD7Z1w":{"text":"Two managers did for me in 10 minutes what Online Support couldn't do all day. I really ap","useful":0,"cool":0},"Jc5-PpwxJUj9vF-ohneq8A":{"text":"Sly (unsure if that's how you spell her name) was a literal ANGEL to me when my brand new ","useful":1,"cool":0}}