{"W2Y6uQQWe8WgB95wFaKrxw":{"text":"This is one of my absolute favorite restaurants in New Orleans.  I'd never had African foo","useful":0,"cool":0},"v9y_uLcYWJMd-6rQCRvOkA":{"text":"The black eye pea fritters are delicious. Tesrtaurant is in a nice part of town..  very ni","useful":0,"cool":0},"otFtzjTVYMHzuckxn-jtGQ":{"text":"Sweet little African restaurant in the Quarter. \nWe went for dinner and were met by friend","useful":1,"cool":2},"rWF_LoAdESqXailHfqN2UQ":{"text":"Best Lentil soup I've ever had in my life!!! You must like spicy because it has a little k","useful":0,"cool":0},"EzVuVkfySJh1236H0py8ZA":{"text":"This is one of my new favorite restaurants. I stopped by because I am a vegan which can be","useful":1,"cool":0},"0c8UHi6fpFMzCKEDihPJaQ":{"text":"As far as I know, this is still the only african cuisine available in New Orleans.  The go","useful":0,"cool":0},"1rhcJw_x_kjdURJM13_msA":{"text":"I like this place! It's simple :) Good tea and yummy soup. And plantains. I think that's a","useful":0,"cool":0},"Cf0c3HrGoELdUIzsiEhQPg":{"text":"I ate lunch here not quite knowing what to expect and ended up thoroughly enjoying everyth","useful":0,"cool":0},"VZ2YuEU4a8sSP-7QdPUfWA":{"text":"Sorry but I forgot to take pictures. Was too eager to start eating and didn't stop long en","useful":0,"cool":0},"IH24cLH8_1plW-JxFF4vkA":{"text":"First dinner spot on our trip to NOLA. It was good. Not a busy place at the time we went a","useful":0,"cool":1},"Lriqlvq2j51XRTE4Frufdw":{"text":"I went here for lunch when I was on vacation in New Orleans.  It was not too crowded and o","useful":0,"cool":0},"yQYLfsoN_t59eAWcDW6J_Q":{"text":"I walked all the way from hotel modern to get here because of its tantalizing & promising ","useful":0,"cool":0},"8It6PS8bch-fzz3xcCHxQw":{"text":"I stopped in for a quick lunch and I was not disappointed. The service is pleasant and rel","useful":0,"cool":0},"cPyvSe0rO026Or_kat8ioA":{"text":"Great service and a relaxed atmosphere. Vegetarians are in for a treat. The plantains and ","useful":0,"cool":0},"t3FhHwVqAjhc0VaKvxv50Q":{"text":"Really love the food here. Been almost every time I'm in New Orleans and its consistently ","useful":0,"cool":0},"wIWCQjav-JofRYVOsAckCA":{"text":"While visiting from out of state,my husband and I had been introduced to Bennachin 2 years","useful":0,"cool":0},"ZrutJnq9VLSZaFVCHpY1sg":{"text":"Im sorry but Bennachin just is not good African food.  The people who say it is.  Obviousl","useful":0,"cool":1},"vDPLa8z1rh1CG69B7XxCpw":{"text":"Hands down most mediocre meal of my life. Only took an hour to come out of the kitchen!  D","useful":2,"cool":0},"FPn5fBvtnyr8c0CDU5KA1Q":{"text":"Nice place! The food was very good, i loved the coconut rice and FRIED PLANTAINS! This was","useful":0,"cool":0},"_gtFKlsoV9SfxickCEfnCw":{"text":"Best food in the quarter. It's an intimate, small place serving traditional African cuisin","useful":0,"cool":0},"gvP2HioeJBSn9OFAh_lm1w":{"text":"Got in immediately on a Friday night at 9. Service nice and quick. Food quick but not very","useful":1,"cool":1},"4om6vHzbQcKaeI0_App7SQ":{"text":"Atmosphere was perfect a lot of beautiful art surrounded us.\n\n my server was very polite a","useful":0,"cool":0},"ME949oNF8h-yWmF7zR_EyQ":{"text":"I've always enjoyed Bennachin but hadn't been in a few years even tho I live nearby, in pa","useful":1,"cool":0},"aNiDunHY46mssFy9oUc_Rw":{"text":"Decided that I needed to give them three strikes. And I did. And they are out.\nSeriously, ","useful":6,"cool":0},"zAxg0x21u1e6Gq2l4iQUXA":{"text":"This is not African food that I've ever eaten, then again, it's not like we even got what ","useful":1,"cool":0},"zvVtS9h3ArqJonPqvJMzZQ":{"text":"I LOVE the spicy chicken yasa. It has been of my favorite dishes in the city for about 10 ","useful":0,"cool":0},"mX1z3yDdJiin9AlWrPHdnA":{"text":"First to time to NOLA.  Came here with my fiance. \n\nThe food is absolutely AMAZING.  The B","useful":1,"cool":1},"FkzKTfyzlFEPzJThACW4VQ":{"text":"Great find in the heart of the quarter. New Orleans' cuisine can be a bit heavy on the mea","useful":0,"cool":0},"yQsI5vba1EvebxJbcM1rBg":{"text":"I came to use their restroom and stayed for their delicious food lol. I couldn't help myse","useful":0,"cool":0},"6EG7IPaUNh_sd1hfQP-8Zw":{"text":"Highlights: BYOB. Flavorful spices. Genuinely nice waitstaff.\n\nFirst time trying African f","useful":4,"cool":0},"b5iKE1wkpMWK9LG0Pk4Liw":{"text":"5-stars for appetizers and decor\n2 for service\n3 for entrees.\n\nThey are very short on staf","useful":1,"cool":0},"uSoKgwK_0c61_iXIrK5xNA":{"text":"Absolutely my favorite restaurant.\n\nI've never had a better piece of chicken.\n\nAlways get ","useful":0,"cool":0},"UDxTpgY3iuo2BR4oo-XjNg":{"text":"I am embarrassed to write this but here goes. Was on Nola an entire week and ate out every","useful":1,"cool":0},"v2sRmwlaCPWDlijyrV2IPw":{"text":"Almost every time we come back to New Orleans, we try to visit this place at least once.  ","useful":2,"cool":0},"6wvwkVJxD9jT-EG2Nr7aJg":{"text":"Haven't actually been to the location, but I had their food at the annual Jazz Fest at the","useful":0,"cool":0},"plowGRfyH_X7dfdhzVLySQ":{"text":"Perfect for vegetarians. We ordered the black eyed pea appetizer (it was good not great), ","useful":0,"cool":1},"1uATI-sdbGce9ysN0ZfLVQ":{"text":"Good place with very fresh dishes. I tried the black eye peas and Spinach dishes. I like t","useful":0,"cool":0},"m1JjpNn9GMOID9JWrlQUPw":{"text":"A must try restaurant in NoLa! Beautifully small and awesome food. A treat for vegetarians","useful":0,"cool":0},"D4o16HgpHa9FWm24YemfTQ":{"text":"The day after Thanksgiving we were headed to a BYOB restaurant for lunch only to discover ","useful":0,"cool":0},"nGxdG0P1ClbSpROhqoKL7A":{"text":"This place has a lot of fun and different options. Big portions. Flavorful. Plenty of vege","useful":0,"cool":0},"55EP1qtCCFsVFg-5v1r4_w":{"text":"Excellent black eyed peas and sautéed spinach, so many great vegetarian and vegan options.","useful":0,"cool":0},"e0WA8Jr3gyZBcHLsHEUF-g":{"text":"I was in a food coma after. First time trying African food and it was awesome. I would rec","useful":0,"cool":0},"cCHnn639w9YcLwJ7h2nemg":{"text":"Wonderful African cuisine. Located as a hole in the wall place in the French quarter. This","useful":1,"cool":0},"nRjLRvkvFiBmlPMHvG185A":{"text":"Been here twice and have loved it each time.  As vegetarians this really is a great option","useful":0,"cool":0},"9cYFAoolm0HGSld7gi-xLg":{"text":"Great African food in the French Quarter. Came here for lunch. I had the chicken lunch wit","useful":0,"cool":0},"Po1LlJjLBrV1h3pSB4lQ5w":{"text":"Reading Bennachin was 1 of the few veggie-friendly restaurants in The Big Easy, we made a ","useful":9,"cool":8},"P9aB4H3nRQ6dezsS-4nO_Q":{"text":"Small and cozy, warm atmosphere with friendly service and good food. Great for vegans, veg","useful":0,"cool":0},"uhg5hP0CQzPAdvnGG8oqYw":{"text":"Bennachin is a nice little restaurant where I've been a few times. I am a total sucker for","useful":2,"cool":0},"fpI-Glg5UpO7kwvLTRSLAw":{"text":"Best meal in New Orleans, African cuisine influenced by New Orleans, not the other way aro","useful":0,"cool":0},"Vbc5bKpJwLDMaPGUO2viBg":{"text":"Wavering between 3 and 4 stars for me, but the mister raved so highly that I thought I'd r","useful":0,"cool":0},"fJNHQwDJTAtQIVJ1uwQMxA":{"text":"So yummy!!!! Kidney bean soup (never had before) omg!!!! Coconut rice - must learn how to ","useful":0,"cool":0},"B97kwDvKEWGurc4C5y6N4g":{"text":"We had a great vegan meal. Fried plantains, kidney bean soup & a vegetable dish. Sooo good","useful":1,"cool":0},"DUCX1k84-8HvXeIThmTrdg":{"text":"Not a tourist trap. Absolutely delicious African Cuisine. If you like soul food you'll be ","useful":0,"cool":0},"08Ehqp17PaV_tZ44Wxe9LA":{"text":"Boyfriend and I came by a few days ago while we were visiting New Orleans for the week. I ","useful":2,"cool":2},"8b0gDfbkTTclbfeIcVHpqw":{"text":"Fabulous. Good food. Great atmosphere. Fantastic service. Excellent people watching -- eve","useful":0,"cool":0},"GkO-n57BtCnsAR75tBD0lg":{"text":"I was in New Orleans recently and was treated to lunch at this quaint little restaurant sp","useful":0,"cool":0},"DwYpSLnyQD0ooBkCZZMnQQ":{"text":"Eating here as I type. You can catch a free wifi signal at this restaurant. Everyone told ","useful":0,"cool":0},"A4imwJOiOrTYGvTZ3siW-A":{"text":"What more needs to be said? There's a reason why Bennachin is one of the most popular vend","useful":0,"cool":0},"lZQBLE-DXupKf0fF2dqkVw":{"text":"Ordered the plantains app,  the Domoda, and the ginger lamb straps. Highly recommend all 3","useful":0,"cool":0},"hBClSuNTHYwZeKUuuf0PNg":{"text":"What a diamond in the rough!  Casual, unique sampling of African fare. Great restaurant wh","useful":1,"cool":2},"MDHbfrXziShJ8xDvEnNt-Q":{"text":"Delicious food, pleasant atmosphere, friendly waitress in a perfect setting-the French Qua","useful":0,"cool":0},"WZ2Zx0Bi9K2JLQPyDFkoPA":{"text":"Today we decided to try something different. I ordered Sauci Majanja (Potato & Shrimp Stew","useful":0,"cool":0},"gwIErZYzlv_aCIF3jtUgIA":{"text":"This place serves excellent food with very interesting flavors. Our party had beef, veg an","useful":0,"cool":0},"3JBbrYUO0R1jEQEuWLq3Fw":{"text":"We had one day left to eat at one last restaurant before leaving New Orleans. I had seen t","useful":0,"cool":0},"i0WweXq4pW4RdzykWporxw":{"text":"Love the food but the service is usually terrible.\nIt was especially bad today. We walked ","useful":2,"cool":0},"vOC-HVteHkrWCqoMNxdrPA":{"text":"Yes, dear reader, I am at last returning to the wonderful world of YELP! after a far-too-l","useful":0,"cool":0},"IPt2i43sSmHjE-YeMWin9g":{"text":"I'm vegetarian and I ordered the #43. The 40 was out of order. The vegetables were certain","useful":1,"cool":0},"pNuUx7_HDBCVaInwn5aIjw":{"text":"Hearty, delicious soul food. I had the Kone ni Makondo - stew of black-eyed peas, tomatoes","useful":0,"cool":0},"195hZdgacj60UsREx1pnWA":{"text":"I came here with my partner on a recent date. We actually came here on our first date more","useful":0,"cool":0},"W_yPTHF4SlVbTC-C1BD3yg":{"text":"My first time for African. What a pleasant surprise. I will definitely be back. I had cash","useful":5,"cool":2},"PV2Sbry-5cRPhtjwihgMzw":{"text":"Picked up takeout today,  i tried the veggie curry plate and it was delicious, a little sp","useful":0,"cool":0},"zVncJVkOVfqnyYuVdMS1RQ":{"text":"I've eaten here twice, and I enjoyed the food (and the BYOB policy) a lot. Great plantains","useful":1,"cool":1},"Mar85oRzASyltb58vwKWcQ":{"text":"I see my last review was from over 3 years ago. I think I've been back since then and just","useful":0,"cool":0},"e6-AKgScvLfPjFi8029S6A":{"text":"This was one of the best meals we had in NOLA.  The food is screams homemade and the servi","useful":1,"cool":0},"9PwnFjKhcodXKK-ga7zhQg":{"text":"So, today was the first trip to this establishment and while I have no previous experience","useful":0,"cool":0},"ZwMgT6eP-c5-APO-C9mWFQ":{"text":"I've only been to this restaurant twice, but I can say that I'm quite pleased that they of","useful":1,"cool":0},"Rnl6DyiZh8HkLdm3KP69Eg":{"text":"This restaurant is a gem! Not typical NO, but fantastic! I don't know how they get that mu","useful":0,"cool":0},"vdXxqzwkrj7jm66u54hXAA":{"text":"Service and food delivery was incredibly long. An hour and 15 to get food. Food is good, s","useful":0,"cool":0},"QGqLvc9auuQlw47L_5XHzQ":{"text":"One of the best hole-in-the-wall restaurants in the city.  They have big portions, good pr","useful":0,"cool":0},"piCFgLH2Z2SGSFvSMv11Tg":{"text":"I used to eat at Bennachin all the time when it was in Mid-City on Carrollton. Then about ","useful":1,"cool":0},"2gDMZdoJVis9P36KyFIogQ":{"text":"Hotel concierge referred us to this place. She said it was African/caribbean food. Nothing","useful":0,"cool":0},"uC-JEZ-hX-VTU97dcGw9lQ":{"text":"Small menu with strong flavors. Great low key restaurant that has authentic food. Modest i","useful":0,"cool":0},"p1mmXmL_SIQb5tqVFIl9sQ":{"text":"Fritters are a no miss on the menu.....lot of veggie options for people who skip the meat.","useful":0,"cool":0},"XxUqqaqaZ7C2xtQ7HOK-lw":{"text":"Be careful with the spices. Mild is very hot. The chicken soup is basically noddles with K","useful":0,"cool":0},"NXCeVcyTIK1I6YJ61ESabg":{"text":"I've never had African food before, but this seemed really authentic. Everything is made f","useful":0,"cool":0},"isfMHz4VFnaCWw3IYcDDLg":{"text":"I ordered the vegan plate to go. It was fast, hot, big, and DELICIOUS. The spinach was so ","useful":0,"cool":0},"5yA4D1apvnDm6pLMtQ1XJg":{"text":"My veggie jambalaya turned out to be a disappointment - low on flavour with an insipid sid","useful":0,"cool":0},"hmeXTRY-4KFUqKW22ILUsQ":{"text":"As good as it gets.\n\nFood comes out steaming hot, straight from skillet to plate. Warm, sp","useful":2,"cool":1},"-9-6e6qDTMTujpnXuUtRYQ":{"text":"A hole-in-the-wall restaurant outside of the busy parts of the French Quarter. Unique food","useful":0,"cool":0},"GzT8hfgB6_xV4gFIv5ui8w":{"text":"I do not usually write yelp reviews but this restaurant deserves more than five stars so a","useful":1,"cool":0},"YFCJPF-lvf0-OCqGx4t1Mw":{"text":"Been there twice in six days, now.  Both times, the food was fantastic and the service was","useful":0,"cool":0},"iE-1K96Zn7aDnyMxFZeBbg":{"text":"Ndole and Janga were delicious and very filling.  The ginger drink is a treat for the adve","useful":0,"cool":0},"BwWqK4J6LLx021AIIH8P2w":{"text":"It was a disappointment. My chicken was tough, dry, not really edible. Ordered the fritter","useful":0,"cool":0},"Rtjt5oU1soUTusMOYWJi6w":{"text":"Fabulous food in a cute, but tiny space.  The service was really very good, especially con","useful":0,"cool":0},"YLp2qoXkyv1VJPe3p0iitg":{"text":"The food is amazing. I never try such great Africa food before. And the price is very good","useful":0,"cool":0},"Btndz3d5RFxpBRsji-fanA":{"text":"If I could pick only one restaurant in New Orleans to eat at for the rest of my life, Benn","useful":2,"cool":2},"V3LVR5xbkoYnyv4DyM23Gw":{"text":"The place is nicely laid out inside - not a big place.\n\nI had the doh-doh and apricot lamb","useful":1,"cool":2},"uDfnt50AuRnNv4k5hJdRLw":{"text":"Vegan in New Orleans can be tricky, but Bennachin has a great answer. Particularly recomme","useful":4,"cool":2},"_FGvqy5Emg4fUxFuKs1o2g":{"text":"I go to Here each time I visit New Orleans. The food never disappoints me. The best thing ","useful":2,"cool":0},"AWU_6pQl6THS9CcvuV4jcQ":{"text":"Yes, vegetarians can eat well in New Orleans too! I had the Yasa (cabbage and carrots in s","useful":1,"cool":0},"ABWcyjHsnlNv_JB6penrQg":{"text":"I chose this place because it had great reviews on Yelp, and, as a vegetarian visiting New","useful":1,"cool":0},"lrFAhvD4edpkVvE77-PTcw":{"text":"Nice little place for a quick lunch - southern with an African touch to the food. Quite go","useful":0,"cool":0},"GLWIvDSJ4O8ELMJmazoOsg":{"text":"Discovered this place during Mardi Gras.  Proportions were huge but they didn't disappoint","useful":1,"cool":0},"tNBQrlPTxJrNoEX30llY1A":{"text":"no good dudes, no good.\n\nFood took forever to come (but hey no big deal there was a huge p","useful":2,"cool":1},"tQ8OmeodYf4kXRmZofsahA":{"text":"My first experience with African food. We liked the black eyed pea fritters and fried plan","useful":2,"cool":0},"d8xl8oh_L9-24vVRVZ6BzA":{"text":"Full disclosure.  I went here with a vegetarian friend who needed veggie options and for t","useful":0,"cool":0},"1RxJP1tP3wByPUa5D2H3dg":{"text":"Love this place great food,great place and very friendly owners. Don't let the name \"scare","useful":0,"cool":0},"CdTGXuaCfWkgt_9_7-f7gw":{"text":"So good! My sister had been here before and recommended it. We had wonderful service, we w","useful":0,"cool":0},"gZdF6adufci2SoiSLIDgQQ":{"text":"Seemingly authentic, tasty African food in a really cozy, cute atmosphere. At the recommen","useful":0,"cool":0},"HCoFUE8rJTvjy-WwYBZRPw":{"text":"Food is fantastic. Great flavors in all the dishes served in a quaint restaurant on the qu","useful":0,"cool":0},"HXBjGqjP5Abt6JbbVB-vxg":{"text":"My husband and I ate here yesterday and what a treat it was. The food was amazing, and the","useful":1,"cool":0},"0ppil0WWwUdUFJWt-it1fw":{"text":"I am dying to give this place 5 stars and based on the food I tasted and the service i exp","useful":3,"cool":0},"d9j1hlknKpDFL2TpcXm6iQ":{"text":"Wow! The seafood jambalaya and black eyed pea fritters were so delicious! Would definitely","useful":0,"cool":0},"jHeBLn8nJK3Ucz__X12iPg":{"text":"Large portions for the entree. The black eyed peas, egg plant, smoked fish appetizer was m","useful":1,"cool":1},"GQLjkuT11tMk6DaiDebk7g":{"text":"Establishment:\nIt's hardly a flashy store-front, but they do have a sign hanging out front","useful":4,"cool":0},"l37OA1dxdsQ57Zh32yFfBQ":{"text":"Food is so bland, it's a shame. Service was poor but mostly because our waitress was the o","useful":0,"cool":0},"kKbifjB5fbkw7xRyuLeKAQ":{"text":"Favorite locals place in the Quarter. Don't waste your time at a cheesy tourist place and ","useful":0,"cool":0},"Cr5pWqd4ByWRePfz5FtBKg":{"text":"Enjoyed the black-eyed-peas in tomato stew on top of delicious coconut rice. And underneat","useful":1,"cool":0},"GIBLKeu0OlLQkCfDcM8-uA":{"text":"Mmm ...  Perhaps my favorite place to eat in New Orleans. \n\nI love the Jama Jama Ni Makond","useful":4,"cool":2},"QoH0IWUecTrWK9bM8fEroA":{"text":"Went for an early dinner and the place was quiet. We ordered the black eyed pea fritters a","useful":0,"cool":0},"uVTP0DdAPfbUZvuiCPw7ng":{"text":"Cameroonian and Gambian food? Yes please! Bennachin is fantastic. They offer tons of veggi","useful":0,"cool":0},"z_0cqwRrMvFEG8Hq3dGqfg":{"text":"Wow! My husband and I were hipped to this place by a local who gave us a walking tour. My ","useful":1,"cool":0},"Zdd37Hfjmpg5jONDfTBZoA":{"text":"Atmosphere was not all that, but this little spot was among the best we had during our vis","useful":0,"cool":0},"ZeSZOTCxO5A306IgSLYKwA":{"text":"So, here's the thing.... \n\nThe night I went it was already 8:30 (they close at 9) and the ","useful":4,"cool":3},"9wvaB6oC0mOPxLt3gFLOaw":{"text":"Plantains were good. Black eyed peas were good too.   Main dish (eggplant and mushrooms) w","useful":0,"cool":0},"jPtJqU89g4opovrcOcQLVA":{"text":"I live right around the corner from this place and walk by here nearly every day. It shoul","useful":4,"cool":1},"5y1dO41f-9XePSUWbGCcTQ":{"text":"Cruising through NO for a couple days, I only had a few chances to get some good food, and","useful":2,"cool":1},"Q5wxMC9AB9rjaAu1tROpOA":{"text":"A good place for vegans and vegetarians! Just make sure about the spice level as I found i","useful":0,"cool":0},"9QyF_tfMXpQofMEmCkGQaQ":{"text":"Fresh, fragrant and in the French Quarter! Seriously,  the food is delicious and a wonderf","useful":1,"cool":0},"bQ5UGEMoKez03pSd1Q6mVg":{"text":"Excellent West African food in a real restaurant on Real St. Their version of spinach is n","useful":0,"cool":0},"irk6To_SFCAyhaMvhdM1Jw":{"text":"Interesting. A very casual (read divey) spot for African food. Seems traditional. Get the ","useful":0,"cool":0},"tPYNMUynoHVqobZidcnn5Q":{"text":"Come for lunch and leave stuffed. Good vegetarian options and giant portions. Best deal I'","useful":0,"cool":0},"TOMgHfPJUxhc8Mtdpq5Q_g":{"text":"This was our first stop on the Culinary Bike Tour in New Orleans.  Tried the Spinach & the","useful":0,"cool":0},"7xM_-sdNabRO3WmU3WQUZg":{"text":"Fairly unremarkable. The black eyed pea fritters are good but theyre the equivalent of som","useful":0,"cool":0},"lhs4BMpUH_tDZJEPBIgUPw":{"text":"Yummy food and great service. I had the black eyes peas with coconut rice lunch special. I","useful":0,"cool":0},"RgtGxLnjzRRnpOfU0v2YiA":{"text":"A rare veggie-friendly eatery in New Orleans. I loved my dining experience at Bennachin on","useful":2,"cool":1},"LSI4ETRymQkJoTvwUtmsDA":{"text":"I am Nigerian.  I have had Nigerian food.  I have had West African food.  This place was o","useful":1,"cool":1},"g_GigPCwG74cBcHR3gOJyg":{"text":"I was debating whether I should give two or three stars, but I've decided on two just beca","useful":2,"cool":1},"1P-xamRYIYAszbVu6DbriQ":{"text":"No joke, this place is what I will miss about New Orleans. (We're moving, not the restaura","useful":2,"cool":1},"kKJRphHNNHuPWtW6dTJXag":{"text":"We had a brunch there. So first of all location wise this is a very good place. It's relax","useful":0,"cool":0},"4RHSVq-BOGJ1YlkMnp8pbA":{"text":"I ate here with my brothers once. If you are looking for great food and don't care about t","useful":0,"cool":0},"lhk4WnmtXjLmDaPiYsy8Ew":{"text":"The food and the service are fantastic!  This is the best place in the city to get plantai","useful":0,"cool":0},"kJXXToAhxXS59VbjLF-8OQ":{"text":"Eating African food in NO is special. Bennachin offers African atmosphere in their restaur","useful":2,"cool":2},"a9VjZVP9rxw_lyQdMozLNg":{"text":"Decor is clearly African inspired.\n\nBlack eyed peas fritters for our appetizer were quite ","useful":0,"cool":0},"qTUVt04zsncoKiiEHRuGog":{"text":"A few things to take note of, this place is cash only and BYOB (a first for this Utahn). M","useful":1,"cool":0},"o1dPfS80QmXulTdKNzBWIA":{"text":"Amazing food! We had the sauteed spinach and black eyed peas, both with rice and plantains","useful":0,"cool":0},"F-0zi0pASZVk8qRPAE2IhQ":{"text":"Went here while on vacation in NOLA. The food was okay, but nothing great. We had the cous","useful":3,"cool":1},"idDVtotzTN-xD8GDmHyKRg":{"text":"I was HIGHLY unimpressed with the service here! I ordered a to-go plate and my 15 minute w","useful":0,"cool":0},"nY0qcvQRo9VQez_VvNZC4w":{"text":"Like a lot of people on here, I discovered this place looking for a good vegetarian option","useful":0,"cool":0},"H2I6qsOZ1cHZM4HioLsHwA":{"text":"came in around closing time and staff was very inviting. They moved me to a table with a b","useful":1,"cool":0},"TVYFUhx5B3OZG1vH9UfYfQ":{"text":"OK where do i start i was looking for something a little healthy that evening to eat so i ","useful":0,"cool":0},"7LknfVGkhPZN6PtgTFNWsQ":{"text":"I've eaten here several times over the past couple of years. It isn't fancy and the servic","useful":0,"cool":0},"kRsxLpJJJ0f05PCFuqDG2Q":{"text":"The two vegetarian main dishes I tried were bland and not worth the price. We had the one ","useful":0,"cool":0},"oTz7ZFF9JjNlVJxL-WsSgg":{"text":"I needed something different on my last afternoon in NOLA and found myself craving vegetab","useful":0,"cool":0},"bwr4ZYk9565qfqc-P8LPsw":{"text":"Where to start great food , good music and nice atmosphere the black eye pea fritters are ","useful":0,"cool":0},"13UNCBGsToB4oC_-zOn_cA":{"text":"SUPER GOOD! I'm not one to venture too much with new cuisines but I had heard about this p","useful":1,"cool":0},"RlhTo5VFizT-AWJfiZ1FMw":{"text":"Love love love this place.  This is my go-to restaurant when I want a meal that feels like","useful":0,"cool":0},"_75bkB9f78ml2R4Dvqr87w":{"text":"I went here with the bunch of my friends during the mardi gras festival. The food was dece","useful":0,"cool":1},"FPjG6J_VehUP-AfbCbn_9A":{"text":"Been quite some time since I have enjoyed some authentic African soul food and I was pleas","useful":4,"cool":2},"QkuWJieGDChAi0LPbvZiKw":{"text":"went very well. I had Lieo sisay had coconut rice and black eye pea fritters. Also drank g","useful":1,"cool":0},"IKVqbZM1hijulx_c8qNk4g":{"text":"What a disappointment.  My boyfriend and I ordered 2 servings of a sort of rice, beans and","useful":3,"cool":0},"BsADU2uhF-JCR0vhC0goDg":{"text":"The food is ALWAYS great!!!! I've had so many items on the menu... repeatedly! Check them ","useful":3,"cool":1},"GK8L-FAz0nU_Oc3urKeUEQ":{"text":"I hope I came on a bad night.\n\nI love African food. I love the freshness and the simplicit","useful":1,"cool":0},"pw5yCO5ETBSiPzcU2lQ5zA":{"text":"For my cross-country road trip, I searched for vegan-friendly restaurants. This is my favo","useful":0,"cool":0},"H7EHHr4luCPFKUcBfObc4w":{"text":"Having lived in West Africa (Mali) and North Africa (Algeria), I feel I can exercise a lit","useful":0,"cool":0},"N_Wln_JAu773hc47FX_Drg":{"text":"I would like to give this place more stars, but the dining experience was so uncomfortable","useful":0,"cool":0},"F9a6khSR-veByxDkr3ee8w":{"text":"Leave it to me to find the one West African restaurant in the French Quarter. Well, there ","useful":5,"cool":3},"dxyUVYeOvVHKBaTRQQA50A":{"text":"Blown away by this place. Lovely little location on a quiet street, we were the only ones ","useful":1,"cool":0},"dNSNz5eCTqr9AcfOM6qm7w":{"text":"This is a great spot for vegetarians visiting New Orleans. The food is amazing, reasonably","useful":3,"cool":0},"LWrVDeGvNHknKopoiiIAgA":{"text":"Really west delicious African food that was recommended to me by a local. It's BYOB with n","useful":1,"cool":0},"ylsOTTnZhUwEXUSxdZpFnw":{"text":"Probably my favorite restaurant that I visited during my one week in New Orleans.  They ha","useful":0,"cool":1},"BeBh-kzoIJfWFXpqPp8ElQ":{"text":"I feel embarrassed for the French Quarter and New Orleans that this restaurant is being la","useful":3,"cool":0},"HpD-lKemtZ8CmriyPbly0Q":{"text":"Bennachin reminds me of the good times I had in West Africa. So I already loved it for nos","useful":3,"cool":2},"JNwACQOQKRDKIjmiBMs85g":{"text":"We had dinner here on our last night of our trip. It was a delightful break from all the f","useful":0,"cool":0},"0nS9n_VhGhZyIQka5bc-xg":{"text":"Great place off the beaten path! Especially recommended if you're looking for a break from","useful":0,"cool":0},"oGtofFCnz9wQczJrUb97Ug":{"text":"Excellent Food, Great Service an overall good experience :)","useful":0,"cool":0},"fdDlAgJqfQ2n_mLkN9Rd8w":{"text":"I love the food.  I had the red beans and rice and put some hot sauce on it.\n\nDamn it was ","useful":0,"cool":0},"DvMFvHMjavvlN_BHjh7r2w":{"text":"Let me start off by saying I'm from a part of south asia where they know how to cook their","useful":0,"cool":0},"q5EEULbDORNA6GbdmFrdjA":{"text":"I've been eating here for nearly five years now, and I haven't had a bad meal yet. The ser","useful":0,"cool":0},"vpn3ZImE4N7LkDtc6GdWXA":{"text":"Don't trust the good reviews or the number of stars. Unless you enjoy low-quality, cafeter","useful":2,"cool":2},"dS249uuu7JfG6c4XHHkbvA":{"text":"Every time I tell someone I am from the Ivory Coast they tell me \"you have to go to Bennac","useful":5,"cool":1},"saR3ovsuy8iVxmfWK9njIw":{"text":"We got the fritters for an appetizer which was delicious with the sauce, but they were pla","useful":0,"cool":0},"safPzT6hreBKnhGzji0aSw":{"text":"Was in new orleans visiting and roaming around the french quarters when we decided to cont","useful":5,"cool":0},"DoedSbs_5GDNlIDtCdgbvA":{"text":"Such a disappointment.  There were 4 of us and nobody enjoyed their meal.  From the food b","useful":0,"cool":0},"MHpQ9e6aEqi8HUsLtWL0wA":{"text":"Solid African joint. Not great ambiance, and the food isn't amazing, but it's certainly go","useful":0,"cool":0},"yGaUt0A5feRzBEbAErgCng":{"text":"The food here is on point! The pictures do not do it justice; the flavors are out of this ","useful":2,"cool":2},"JJJ6b4mOOpNzR_5Zbb5DOQ":{"text":"I'm a fan for sure, it's just not always consistent.  I always order the peanut beef stew ","useful":1,"cool":0},"Uxv8xvekdmFYklNI9QY0lQ":{"text":"Went there on a bike culinary tour and had the Doh Doh and Jama Jama. It was excellent.  D","useful":0,"cool":0},"xdqe4jYknVsbO2-AJvOzjw":{"text":"Service is a little off but not a problem. And the food makes it all acceptable. Been here","useful":0,"cool":0},"ZGzxBQRMNBHSEIDHM9L4KQ":{"text":"Excellent food. Spicy well flavored dishes. Looking forward to when I can come back and tr","useful":0,"cool":0},"KLCQH_EQOl9eqW9pqYu3sA":{"text":"hadn't been to this little place in a couple of years. brought our own bottle of wine and ","useful":0,"cool":0},"5FtoDLH3W2A0B0WwRL4vkQ":{"text":"Cozy place, worth the short walk away from Bourbon Street. Each of us ordered something di","useful":0,"cool":0},"hBccTPMF9vOec7h7eduWcg":{"text":"My husband and I travel to many different countries and cities and live to eat & drink our","useful":0,"cool":0},"tBOeSHNO6IzRcVNqWM-QDw":{"text":"So glad we stumbled upon this cute little hole in the wall restaurant during our stay in N","useful":0,"cool":0},"j2wzpDr2VE22Vhv0ypYrsw":{"text":"This place has a good array of vegetarian options which I liked. The portions sizes are al","useful":0,"cool":0},"YsGWgtcKL39uYRcHLPwu8g":{"text":"A lovely little dive on Royal St. in the FQ. My friend is vegan and was having a hard time","useful":1,"cool":1},"qeVjCqitzRZ5EebED9Ksvw":{"text":"I would like to highly recommend this great restaurant in New Orleans! The food was stella","useful":0,"cool":0},"NNfxaVXx5-UV3Rj7Ad9Z7g":{"text":"I really enjoyed the experience of a new type of restaurant and the menu was good looking.","useful":0,"cool":0},"5pTtOrKYGLoWQdgvZdf76w":{"text":"I loved this place once upon a time. However, my last visit was very disappointing both on","useful":2,"cool":1},"VJc8IqSWfS8PKvQVS35J7w":{"text":"You must try the spinach (comes as a side to several entrees or  as an entree itself): not","useful":0,"cool":0},"uq4PicMFy4qzJChxjLSQ7Q":{"text":"Delicious Akara appetizers and the tastiest spinach. Yum!! The bathrooms are in the courty","useful":0,"cool":0},"QupitUrz0Tf6OZBVj6mtIA":{"text":"Damn, I'm surprised to see so many rave veggie reviews for this place. On the plus side, B","useful":4,"cool":1},"bJnQrX_ychsH0SjRDqFy7A":{"text":"In regards to what an earlier reviewer said, they definitely took cards when I went there,","useful":5,"cool":2},"nNAszgTDNzOwvBH7kpoS5A":{"text":"The worst place I have ever eaten - this place is totally overpriced and the food tastes l","useful":0,"cool":0},"u520w2jaHrO2EK2C_jHSsg":{"text":"Saturday night, in the French Quarter. Where does one eat? The choices are almost limitles","useful":2,"cool":0},"URKbWXr_4E1GwvslseqPWA":{"text":"Great simple food in a very casual environment. The plantains are super; spinach comes wit","useful":0,"cool":0},"DZgnTopXNw1JrN_YzyAOBA":{"text":"I liked!! Used a mobile phone app to find it for a late lunch after the marathon last year","useful":0,"cool":0},"JW11W04MrtSN8z64-DcDVw":{"text":"This place is awesome! After having had the delicious but heavy New Orleans classic dishes","useful":0,"cool":0},"Yzd5Fotrtv_V7BEVE3H-XA":{"text":"This review is years overdue but now that I'm recalling my NOLA experience, it has to be w","useful":0,"cool":1},"zo7ugSux-IkwLYnen8mu2Q":{"text":"Can I give this place zero stars? Going to try. Nope, wouldn't let me save. I guess the st","useful":2,"cool":0},"eaOoevYJhvFUzdGwlYPAFw":{"text":"Came in at 2:45 and they still gave us the lunch deal which ends at 3. Delicious food and ","useful":0,"cool":0},"yVaUlPDBDzHMX5TvC8ePxQ":{"text":"Trust me. This food is awesome. Was feeling somewhat adventurous. Delicious cuisine!!","useful":0,"cool":0},"jdFeGWTRL0D0bQ5m7rPxSA":{"text":"I was taken here by a friend who really enjoys this place. I came back before leaving town","useful":0,"cool":0},"5UPeEMrsBK3yncsC9zXj_g":{"text":"This place is really good! Definitely would recommend the Jamaican chicken. A nice break f","useful":0,"cool":0},"9Yr2_3QK4X2OLwr8FgvL_w":{"text":"When I first moved to New Orleans I thought that people were a bit touched for even daring","useful":0,"cool":0},"lGUEs8aOhFlriTy5duAYeA":{"text":"Visiting New Orleans and Being vegetarian, I knew that our chances of finding really good ","useful":0,"cool":0},"b6Rr8gHy7zlettHG2ZP_VA":{"text":"If you're a fan of the 90s, 3 snaps in Z formation on this one. The food is good -- very g","useful":2,"cool":0},"Mqt-bRZCPaPTE00IVYrKTw":{"text":"For my first time eating at this restaurant, I am not particularly disappointed...but not ","useful":1,"cool":1},"8cPPad1RCEKbqIDV8wQ1gQ":{"text":"This was one of the the only places open on Mardi Gras day that served up food.\n\nI guess e","useful":0,"cool":0},"AWGSQNghuNDIB1SkI56ESQ":{"text":"Happy to find some vegan-ish food in the French Quarter. I was recommended this place by a","useful":0,"cool":0},"yJFy0d1Ci7YTKvqsumXHUA":{"text":"Love the domoda and plantains!! Also try the red zinger tea. If you leave this place still","useful":1,"cool":0},"aRfvh_FPECAkrrxgyaRiiw":{"text":"Tucked away in a quiet corner of the Vieux Carre, Bennachin has it all: friendly, informat","useful":0,"cool":1},"uAV-qN5o0nW9wXTmpu2JhQ":{"text":"The food was delicious and the service, although a little slow, was good. I'd definitely c","useful":0,"cool":0},"NMlW6Eb0bVPDJ_8pT0gimQ":{"text":"We went here one night when mona lisa's next door was closed.  How could we go from classi","useful":1,"cool":2},"R8gObcfZjx0vd03sa2yxQQ":{"text":"Aw... as a vegetarian I really wanted to love Bennachin! We enjoyed the whimsical decor an","useful":4,"cool":4},"boFIUpXEDiZR622n8pwljw":{"text":"I stumbled onto Bennachin on a visit almost 8 years ago and never miss a chance to eat the","useful":1,"cool":1},"Tl8DXuMc__-7nMsTykiSrw":{"text":"honestly this is my favorite place to eat. i love when i get the front table by the window","useful":0,"cool":0},"desDNW9hm2rwj5xcHBAAYw":{"text":"Great spot for lunch in the Quarter.  Definitely cheaper than most other options, and far ","useful":0,"cool":0},"7dfO0V91MQNR7Un_OhJtVw":{"text":"Thank you friend for sharing this restaurant experience. It was my last day in town. What ","useful":0,"cool":0},"3L4rm4qxxwpOpxXb-iqFdA":{"text":"Great great food. Good for vegans! They have a whole vegetable section of the menu. I love","useful":2,"cool":0},"loADUMaS1_ET2-Ye93DBIA":{"text":"Delicious, I got the black eyed pea vegetarian dish with coconut rice.The portions are hug","useful":2,"cool":1},"0Lq87O2Z3fLFpHa6XIqk_g":{"text":"Stopped by for lunch with my family and was not disappointed.  The portions are large, del","useful":0,"cool":0},"hrpYTnMXm1-F8VDHkmKCww":{"text":"My crazy sister decided she had to go here. I was pretty worried, considering that I had n","useful":0,"cool":0},"VjvSxmU48QGweXXJzJD9pw":{"text":"Too expensive, very small portions. Food wasn't that great and the restaurant was kinda di","useful":0,"cool":0},"kCpzNkT8Vf3CzVgWh8CnZQ":{"text":"We were excited to come to Bennachin because it is one of the few spots in the city that o","useful":0,"cool":0},"DR2O31cgXJWjsQrTsh1lsQ":{"text":"tasty and hot and fresh. The Fish Stew is yummy with carrot, cabbage, and a tomato sauce w","useful":0,"cool":0},"-uwpZD_0hd_1CRhlL1lyVA":{"text":"The food was delicious.  I can't wait to go back and try more items on the menu.  However,","useful":1,"cool":0},"0sHHSrORf1i7d6Y4nCqh6w":{"text":"This was recommended to us from a friend that Lived in New Orleans for a while! Thank you ","useful":0,"cool":1},"oCkPUDsCw8K6Ez8mEG1Puw":{"text":"Great place! Delicious food!! Lentil soup was delicious it is a liiiittle spicy, fried pla","useful":0,"cool":0},"LhkF18INr41wtuCgus1v8w":{"text":"This is the best hiding gem in NOLA! I seriously could eat here Everyday!! \nThe food is so","useful":0,"cool":0},"VPFuK5PMlv4xi5HG7AAxNg":{"text":"I went with the Louisiana Peace Corps Association.  We rented the place out and ate buffet","useful":1,"cool":1},"hGMT6x_eFRZfeDLGkSryPQ":{"text":"After awhile, most  menu in New Orleans  were similar so we Yelped and found this place. T","useful":0,"cool":0},"lYmaYQzrlqurdSTkBYxoIQ":{"text":"I came here when I found small Mart unexpectedly closed but found a hole in the wall gem. ","useful":1,"cool":0},"t2NF3GcZOnPWxb7-JRw62A":{"text":"I really wanted to like this restaurant; I truly did.  I was referred here and the rating ","useful":0,"cool":0},"7FbqyoOxUsaUa7dKU97y_g":{"text":"This was a great find. Not easy to find lunch in the Quarter for $11 let alone a good one.","useful":0,"cool":0},"UI7R2Lbk05fcEnvQUcoATQ":{"text":"OMG this place is GOOD.  Offers food inspired by Gambian and Cameroonian cuisines that is ","useful":1,"cool":0},"IEf1vj09eRtlrpZFgBC4iw":{"text":"Yum\nI had lenteles, there was lots of soup in it and it was a little spicy and really good","useful":1,"cool":1},"BW1YSCf4g-qUSWsm4Zf1sQ":{"text":"Languid but sweet-natured server.  Bit of a wait for the food and the place was only 1/4 f","useful":0,"cool":0},"lfEumbdPi7nfz326q4G0sQ":{"text":"We ate here twice on our last trip. I'm vegan so there were a ton of options. OMG. Sooo de","useful":0,"cool":0},"AyuxRlFJYG1wXSXWFTjcnw":{"text":"No more than just okay. All the elements to create a outstanding meal are there: fresh ing","useful":1,"cool":0},"4_ZT4mBt9C1tVKRuPah_8A":{"text":"Delicious and unique. Fish and chicken are both  flavorful and tender.  There is some sort","useful":0,"cool":0},"bpZ7xvw26NBI5tNbKlSZ_Q":{"text":"Really impressed with the menu! There aren't a lot of African cuisine options practically ","useful":0,"cool":0},"3Ib4kYO8OH_yWfH0aFKBFw":{"text":"Overpriced canned peas and boxed rice, with a sprinkle of seasoned salt. Slow service and ","useful":2,"cool":1},"awWIUlC_bwUL8xXnRlUPKw":{"text":"This was my first African food experience. Had the vegetarian Domoda (peanut curry) and Be","useful":0,"cool":0},"DyH8AOAspmBq3Djd7sh6zw":{"text":"We just came here to try a different cuisine . Started off with the ginger drink which btw","useful":0,"cool":0},"Exbhtx8Uyt937Qb0X_hOAQ":{"text":"I love this restaurant but am disappointed that the website and yelp says they are open bu","useful":0,"cool":0},"YLpTaTrzW6D1N2RYuH-UFw":{"text":"Hard to believe that one of these type places actually exist in NOLA.  I have walked down ","useful":0,"cool":0},"AoXrwMQcAq4-IS0E1C6m9g":{"text":"First time here, went Saturday night of Mardi Gras & luckily wasn't too busy (parades were","useful":0,"cool":0},"Q6t43YmnqQhzLOzyKq2a_Q":{"text":"The food here was so good! We ordered the Naouki Ngond vegetarian with fufu and it was so ","useful":0,"cool":0},"jnurgASmYST0iAqWhqnwfg":{"text":"Their actual website & menu - http://www.bennachinrestaurant.com/\n\nFirst tasted Bennachin ","useful":0,"cool":0},"pukzsdpSzPQE7pe30vKBSw":{"text":"Perfect place to kickstart a night out with my couchsurfers and broke-ish friends. The foo","useful":1,"cool":0},"dPdS23G4fpVG77vH20r1zQ":{"text":"I love Bennachin for lunch. It's really cheap for the amount of food that you get. \n\nThe c","useful":0,"cool":1},"R2C5JU4QqBTi7_KQT0EW1A":{"text":"I had never sampled West African food before, but on the suggestion of a food tour, I brou","useful":1,"cool":0},"yTZiJHMgWs-mEMR4WFZppg":{"text":"This place was great!  It was very cute and we had no trouble getting a table around 8-8:3","useful":1,"cool":0},"E41kHLhoMAcGBGckyXtBhg":{"text":"Plantains, soul food seasoned- Bennachins tastes like a home cooked meal, which is a nice ","useful":0,"cool":0},"XJaoB3btokw2JhOtBnl_4g":{"text":"The food is SO good here, and different from what you usually see. VERY recommended. Many ","useful":0,"cool":0},"Fij0-tQHRDTBcA_Abqd08g":{"text":"This was the worst meal I've had in a long time. I ate as much as I could stomach so I wou","useful":6,"cool":2},"bteQAOVgleprq8PKBIA69w":{"text":"You can't come to NOLA without getting 1000 recommendations on where to eat. \nThis place w","useful":1,"cool":0},"1t3FEHkZ99PJ4lx_alor3Q":{"text":"In business since 1992, Bennachin is a diamond in the rough.  The place is small and very ","useful":2,"cool":0},"p2nirMcB5uNdFrDCzoRd7Q":{"text":"I'm giving this restaurant 5 stars for service cleanliness and BYOB. For the lunch I had I","useful":0,"cool":0},"vV95_sN5kAaHOnk3N7zBuw":{"text":"This restaurant is so good I have dreamed about it coming to New York, there is not one we","useful":0,"cool":1},"REa0ZEc1k0LrOSYbKfAwXw":{"text":"Given the previous posts on this restaurant, I really wanted to like it.  If it were based","useful":2,"cool":0},"RmMaagCPA0unkCxjNTdHsA":{"text":"The service was great, the waitress was really friendly and made the night. The food was r","useful":0,"cool":0},"91CiavvZa5QVTm75GyPCVg":{"text":"I ordered the black eyed peas, and jasmine rice. It was delish!!! It also came with planta","useful":1,"cool":1},"LhWdkWhXP18Hw5VaxCZEVw":{"text":"Best African Food in Louisiana!!! I've been coming here for years. If its your 1st time ge","useful":3,"cool":0},"ZId7DIXEb2vG2khWEH83WA":{"text":"This was going to be my first time at this restaurant.  It didn't work out and I will not ","useful":0,"cool":0},"FaG6kQYpiENMixoHA3lTGg":{"text":"Went in today, place has nice decor and vibe, but no one here other then two guy eating, a","useful":0,"cool":0},"aNws5jqR8JAGUYeDUAC4gw":{"text":"Love this place! Art is beautiful. Food is great make sure you are not in a rush! They are","useful":2,"cool":2},"4jEiakzQJkxwBUhCOkVWAg":{"text":"I enjoyed this place and they have good menu, the recipes are simple but have good flavor.","useful":1,"cool":0},"xoWKNxtpGuT1003HWMLoLw":{"text":"STILL DELICIOUS. came back 2 years later and still completely satisfied. food portions are","useful":0,"cool":0},"IR058vTux9wi8WQnKMxU6A":{"text":"I'm a vegetarian, so what I say may not apply to others.\n\nI went to Bennachin because it w","useful":3,"cool":0},"yn606G_VKMleV969Ym72pA":{"text":"Food was dynamite! The food is the epitome of soul food because it truly touches your soul","useful":0,"cool":0},"A_QO6EwF9DQmtFxQQkP-qw":{"text":"My order - Jama jama ni makondo\n\nTaste - Good. Came with rice, spinach, fried plantains an","useful":1,"cool":0},"I_LkKBJ_b1Dk_CKvLg6L0w":{"text":"Simply amazing. Very fresh food, comfortable and intimate setting, excellent service. My w","useful":0,"cool":0},"tvs-kF-LEabaKshpMqDRaQ":{"text":"I dined at Bennachin in October 2013. I was out on a date with a man who brought me here b","useful":0,"cool":0},"54pGuCnkps3UcqJNYbFqMQ":{"text":"The food and service here was absolutely amazing. The black eyed pea fritters came with a ","useful":0,"cool":0},"J4Dkt4-Ri-2wlSypJLgdhg":{"text":"Just simply amazing, authentic reasonable hi am quality and freshness... The food makes yo","useful":3,"cool":2},"u2Wa0w5dHYJ2nxkw0g_gag":{"text":"Incredible dining experience after a few days of heavy foods in NOLA.  Fantastic vegetaria","useful":0,"cool":0},"D_3F23kB2iIa1zgmGNIo_A":{"text":"A great find just beyond the quarter. A number of vegetarian and vegan options, with delic","useful":0,"cool":0},"Le6JtDZsrwuFrAhDKRvtXQ":{"text":"This is one of my all time favorite spots in the French Quarter. Walk down Royal past the ","useful":0,"cool":0},"F1NKQKPSrI3VQS8l-wK9Eg":{"text":"Came here on a double date. My friend recommended it. The service was good and quick. You ","useful":0,"cool":0},"XsRwG8cggpX38yKaWRPRWg":{"text":"The rice tasted burned, the sauteed spinach was just okay, the fish totally not fresh - th","useful":0,"cool":0},"PkQGTeiR6EPmcjpSo1uDSw":{"text":"While I found the food to be good, it was also a tad too salty for my preference. The staf","useful":0,"cool":0},"Bv8shUNKGUjkxUjadxYPpQ":{"text":"This is supposed to be traditional Cameroonian food, but it was not very good. I was born ","useful":0,"cool":0},"_PX_NHwRS8c2JxrAB9a8kQ":{"text":"I am still daydreaming about this food. It is not fancy or incredibly surprising, it is ju","useful":1,"cool":0},"9g8jy8XNieDVGCkAImSfFw":{"text":"As an African woman, I was really looking forward to it.  I was not disappointed.  The pla","useful":0,"cool":0},"wEmIyn3Q-5Sddaezwztv8w":{"text":"Probably some of the best chicken and coconut rice I have ever had, plus a rare find they ","useful":0,"cool":0},"s4BDohldgkkbv7erqVhvxQ":{"text":"This place sucks , let me start by saying I love African food the complex favors and textu","useful":0,"cool":0},"g0E7YeKvErYzR_l9YBhZ8Q":{"text":"Visitor from Chicago looking for good vegetarian food. Not only did I find great vegetaria","useful":0,"cool":0},"pcsofu48CQu8LQRemSqWlA":{"text":"Okay, aside from the slow service (there's one waiter and it's Louisiana, c'mon) - this pl","useful":2,"cool":0},"Jf3GsIxu5kLulsNkhvma4w":{"text":"Delicious food.  Lunch is cheap and seems to be africanized versions of new orleans food (","useful":0,"cool":0},"88qlKqfMSF4Pp9bRvqexfA":{"text":"The ginger drink alone is reason enough to come back to Bennachin. The black eyed pea frit","useful":1,"cool":0},"glKKhMaCW696XJ-wonq2xA":{"text":"My husband and I loved the perfectly fried black-eyed pea appetizer, and the ndole with sp","useful":0,"cool":0},"4cHp0u-Vs9B6cjr0v6qsVw":{"text":"Amazing place with amazing authentic African food. The chicken I had was moist and the mea","useful":0,"cool":0},"d99ObQBJiM8NnH0RinHaVg":{"text":"This is my 2nd visit to N.O. And I couldn't wait to return here! Lots of vegan options. He","useful":0,"cool":0},"ldWJdpNYyKVWbbMKHaaGTg":{"text":"One of the few places for a good vegetarian meal in the Quarter. The Jama Jama with planta","useful":0,"cool":0},"ucBvr4ZhktTSzLwtFy0IVA":{"text":"It's a neat experience, I've been a few times, hit or miss on the dishes. Definitely come ","useful":0,"cool":0},"kYPk5L9SrBQ_ddHHhHRa8A":{"text":"A terrible restaurant with fantastic food.  The service is so awful it's fascinating to wa","useful":0,"cool":1},"i6hT3p-nKtyJtmwX8doxCQ":{"text":"Loved the pea fritters.The seafood dishes are awesome.  Reasonably good for vegetarians as","useful":0,"cool":0},"SRgcNYy7Tg-f39pkDb0g9A":{"text":"I love the set up of Bennachin! They have a table set up near the window that's facing Roy","useful":9,"cool":6},"zorXcVwXQQFBYG6bxyOc1A":{"text":"The food was ok, but there could have been different elements to bring out the flavor more","useful":0,"cool":0},"ScC9OOp-ZZJoxofaDrEcMQ":{"text":"The food is great.  It's not easy to find a restaurant with more than one vegetarian optio","useful":0,"cool":0},"mPsQL2fJDq_5UhaNGRNuHg":{"text":"So we stopped by as our last food venture in NOLA and I'm glad we did!\n\nThe food was as wo","useful":5,"cool":2},"gzg0EoMOao6xWdKa78VJ4w":{"text":"This place has been one of my favorite spots to visit over there years.  I stopped in yest","useful":0,"cool":0},"yvpVMdw-GM2jzwab9OPVEQ":{"text":"Healthy, delicious, satisfying! After a few days of stuffing ourselves with heavy foods, o","useful":0,"cool":0},"Iza0QanwV37yNwk_PjyiRw":{"text":"Nice place. Good service, good selection of food choices. No alcohol, which is good and ba","useful":0,"cool":0},"SWfWkEnD30uJi3SUxSMYvQ":{"text":"LOVE IT!!! Everything is amazing and the waitress was the sweetest woman ever. Very good v","useful":0,"cool":0},"F_3Ixiijs1ZfoZT63obJBw":{"text":"The food and service was spot on. We were not sure of what to order so the waitress was ve","useful":1,"cool":1},"kxpLNJhX4RaEjfTtryRd9Q":{"text":"My go-to every time I'm in New Orleans! The staff are helpful and not overly formal in the","useful":0,"cool":0},"ybi-M7h-flv7UBO-AJv-5Q":{"text":"This place was voted Best African restaurant for the Big Easy but it's easy to be the best","useful":4,"cool":0},"1v9GFKJR8jIk12Mr1ivp5A":{"text":"Lots of options for vegetarians, was like home cooked food. Dishes were simple but flavorf","useful":0,"cool":0},"LgFK77fuKZt9pSneVBlq1w":{"text":"**Vegetarian Review** I just finished a delicious meal.  The food was super tasty and the ","useful":2,"cool":0},"sS1JHBcq8LQtL7Kh9hsMDw":{"text":"This is place a hidden gem, what a great experience we just had, food was amazing! Kudos t","useful":1,"cool":0},"VvnlgBqnm8G7Oc0b8F75KQ":{"text":"Great food, but service was horrendous. The young woman serving couldn't be bothered to ac","useful":0,"cool":0},"J-TAfRtu0Ga3uEf9GfzLCA":{"text":"I get their spinach/plantains/chicken combo plate every year at jazz fest.   It's consiste","useful":0,"cool":0},"XMHhBWS5DaJ3kc6h0dWkVA":{"text":"Wandered in to this awesome, little restaurant, very hungry and excited for something diff","useful":0,"cool":0},"8VYavBft_MzWD5talYetcg":{"text":"This little hole in the wall next to an Italian place on the quiet part of Royal St. is ve","useful":0,"cool":0},"dM1P8OSVGZOmEdLfV5nyOg":{"text":"We stopped into this tiny African restaurant while touring the streets of the french quart","useful":0,"cool":1},"45QGeY1Asg90VeTpS4dJbw":{"text":"Called to ask how the plantains are cooked and the lady was very rude and hung up on me tw","useful":1,"cool":1},"JcLJkLBXZsKxjU1vWjflwA":{"text":"Ordered on Postmates on a Thursday night. We're vegan so it's hard to find a place that se","useful":0,"cool":0},"g8TOvCGvKEKJhKcmYiCRzw":{"text":"The food is phenomenal and one of the only places that will make it as spicy as you can be","useful":1,"cool":0},"D3vbMIz0xKnMFdZpcipxtA":{"text":"Although the food wasn't bad, the 1.5 hour wait was excruciating since I had 2 small child","useful":1,"cool":0},"P2WKabgl5PY3eLgEEbJ7ew":{"text":"Apricot lamb dish with couscous. Nothing I'd ever pay for again. It was edible, seemed foo","useful":0,"cool":0},"ojIPDz_d9y6QZva9UVKo6w":{"text":"All right finally dined AT the restaurant again a few weeks ago, so here is my first updat","useful":2,"cool":1},"QRReFW2G0PXZwsj5sezLwQ":{"text":"Wow! After a week of classroom training with rice and various meats and gravy for lunch, w","useful":0,"cool":0},"KPgg9Xv5rcwtsFNWPNpQGQ":{"text":"Amazing food, even more amazing service! Cool atmosphere and vegan options. Loved it! If I","useful":0,"cool":0},"m1levrbSbXmEp4Y1SaT6ZA":{"text":"Extremely disappointed. I ordered the Nsouki Jakatu, stir fried eggplant with veggies serv","useful":1,"cool":0},"SqMIqN24-Y9Lax2USYvTTQ":{"text":"Went in yesterday with my niece, friendly and welcoming. A real cozy feeling and the ginge","useful":0,"cool":0},"RM-Be_RBmNHjVMJZzuZTZw":{"text":"Every time I return to Bennachin, which isn't often enough, I remember just how good it is","useful":0,"cool":0},"yMTr-tEXCUofkORPzf9_uw":{"text":"So while in NOLA for 4 days, we tried out all of our friends recommendations but the last ","useful":0,"cool":0},"t--6GJOAJr9Nny4Ta708hg":{"text":"Really really good food, very friendly people, and a sweet atmosphere. It was my favorite ","useful":0,"cool":0},"EWRFCzhHAUqLfk84srSdSw":{"text":"I hesitated to even write this, because if everyone discovers this gem it may be hard for ","useful":0,"cool":0},"dkNcypHDplztESp1GDaFcA":{"text":"Portions are huge ! Pretty small and rustic place  but authentic African  food ... will de","useful":0,"cool":0},"f3PWLWYLHH8-tLF4Ni9iew":{"text":"This place was everything. The restaurant is right in the heart of a lot of action but as ","useful":0,"cool":0},"TaA0ouEirTsNxHFVQ8Vf1g":{"text":"This is the first time I am trying the African cuisine and was pleasantly surprised to fin","useful":3,"cool":1},"jF0LLFVt5PSsN89f1FnSLg":{"text":"We found this gem after days of trying to find restaurants with vegetarian options in the ","useful":0,"cool":0},"Qyff-7CWt1j5pJqZ4SaXJg":{"text":"Great food, great decorations, home cooking. Be prepared to wait for your food ...it's wor","useful":0,"cool":0},"kPvzd68HTnD4yNDTf2uQwA":{"text":"So....I love African food!! As a northerner in Nola I miss access to good African food. Bu","useful":2,"cool":1},"rGNfjJkySTv0Tn8MV2dMUg":{"text":"Well, the three hour wait from sitting down to getting our food was ridonculous. The food ","useful":1,"cool":0},"EmB1k9SZSQc_T8In7YU6Xw":{"text":"Was with some friends that wanted vegetarian food so we were near Bennachin and ordered to","useful":5,"cool":4},"vWmpEHHFNMG5kITOHyIbSg":{"text":"I love this place. I will always support black owned businesses but I have to say they giv","useful":0,"cool":0},"UPEJ-1_Ng9_9BCzXU2TsiQ":{"text":"Put In an order on postmates at 730pm because I had a taste for African food. The ETA said","useful":0,"cool":1},"SbvU1kc15fUGzoeGNlZSCQ":{"text":"I was touring NOLA for a couple days and was wandering the French Quarter. I'm usually hes","useful":0,"cool":0},"YK_O2tmiG0Xk8QhYWEI2fw":{"text":"So why would I back to Bennachin Restaurant?  It's easy.  I got a warm greeting as I walke","useful":21,"cool":12},"jWmgeSX__Tf7yzzzhtWP8Q":{"text":"The black eyed pea fritters were fresh and amazing. The lentil soup was light and savory a","useful":0,"cool":0},"P-Obb2sxd0v74JtMJ2zeLQ":{"text":"You will never have spinach or plantains like they prepare there! The black eye peas OMG. ","useful":0,"cool":0},"HUnlQqyJ5rDydL7eFNKffg":{"text":"The bf and I were really surprised to find a restaurant mostly serving West African food i","useful":2,"cool":1},"5ilX0xvkNf8llj_LWlpYDA":{"text":"Absolutely amazing!! Food was authentic and delicious. I felt like I was back home immedia","useful":0,"cool":0},"8nOoJd-06ffIKuvVWYGzAw":{"text":"Yup!\nPerfect. \nI don't usually eat anybody else's greens lil baby but Tuh-Dah I got time l","useful":0,"cool":0},"28QXqJ50hnaS79zYEGFahA":{"text":"Away from the hustle and bustle of the touristy side of Bourbon street lies Bennachin Rest","useful":10,"cool":8},"hs227Lr7LZLV5ETfV27eyA":{"text":"DELICIOUS AFRICAN FOOD Me and my dad look forward to coming here every time we visit Nee O","useful":1,"cool":1},"VQvOZBPZyFdvs8fOTca52Q":{"text":"Visited for the second time yesterday. We were a group of 6, and walked in about a half an","useful":0,"cool":0},"Ae6AfWfj5E1IQaAKV7JEdQ":{"text":"I loved this food. It was so satisfying. The food portions were huge, the food fresh, tast","useful":0,"cool":0},"jqKAlsSwBMqNdwUrP4MyqQ":{"text":"Fantastic!   This is home cooking at its best - robust, simple, flavorful, honest. The mea","useful":0,"cool":0},"vNlAFRXzP8x1C5RzhqHMQA":{"text":"V good. My boyfriend and i came here and being vegans we came here because we heard it was","useful":2,"cool":1},"zKqoO3WhDAX1UlgPw8CkPA":{"text":"I was in town visiting family. We stopped in for lunch on their recommendation while strol","useful":1,"cool":1},"SLqYHgjVW-FCaKdDlzUfFA":{"text":"We ate at this place last night and I have to admit I was a little Leary. My daughter want","useful":0,"cool":0},"_3qMSlNgwhDU_gWCCSryyg":{"text":"I tried this place for the first time today and was so impressed I decided I had to write ","useful":0,"cool":0},"1kCeYEbCvOyjhw7VG8GAzw":{"text":"Great place for vegetarians with meat eating family and friends.  There are many vegetaria","useful":0,"cool":0},"QjfvDODe-zE3a1tC9xLVnA":{"text":"Using Where Y'at, I decided to take hubby here for some African food. The restaurant has s","useful":0,"cool":0},"JUxnDGtWfM_L2VeNvM_SjQ":{"text":"2nd time in 3 days. Both times my fiancée got the shrimp \"stew\" (shrimp and sliced potatoe","useful":0,"cool":0},"xZS-ox6wyKfAZUEfIPdcgQ":{"text":"Food was amazing ! Great service and magical vegan options! The owner even came out to gre","useful":0,"cool":0},"mb4isL7RfMARyYlddWExsA":{"text":"This place is a bit away from the craziness of Bourbon Street, yet a really easy walk. The","useful":1,"cool":0},"k5IFdCB8RatbcF7Oh8YqRA":{"text":"Bennachin is awesome!\n\nIt's a no-frills place for sure....think plastic tablecloths, bad 9","useful":3,"cool":1},"parBRe5cmhqRi_c8RXXlwA":{"text":"Sara our waitress was so nice. We had honey wings, akara and plantains for apps. The egusi","useful":0,"cool":0},"W1FWwOA-9860OlcToiGiFw":{"text":"I had two ordered two dishes from the vegetarian menu. The food was amazing and the staff ","useful":0,"cool":0},"F2zODvLzBPyld2tvdncdJQ":{"text":"I have pleasant memories of a visit to this restaurant back in 2008. Good food at a great ","useful":0,"cool":0},"HJPFxL3Oxt320bdaCp6YhA":{"text":"Can't believe this place exists in the French quarter. Authentic west African cooking and ","useful":0,"cool":0},"H9mGAHpO175tQa6Sj0_5HQ":{"text":"A tiny spot with some interesting food.\n\nAny time I spot a cuisine I have never had (or ha","useful":2,"cool":2},"Pvk1-zPhe2dr9fkn_MpSpg":{"text":"This restaurant is hands down my favorite when I visit New Orleans. I love that vegan opti","useful":0,"cool":0},"2Rylq5yckV48IWektEhHng":{"text":"There is a wonderful African Restaurant in NOLA called Bennachin. I stumbled across it one","useful":0,"cool":1},"3wD8UTw3kw9DfwE6hfhMkw":{"text":"At a first glimpse, my meal seemed quite simple. Actually, it was. But the flavors are mag","useful":0,"cool":0},"j-aroV5gjLc2hGyPerwtKQ":{"text":"The food was good. But they never answer the phone ever and my food took a very very long ","useful":0,"cool":0},"EZABfTlUTuXu4OxFOA5qLQ":{"text":"This is not a touristy place - just fresh excellent cuisine with generous portions.  Gabri","useful":0,"cool":0},"2Lp47RT_Puq1oGalZynSMg":{"text":"This restaurant is really great! The service amazing. We were the only ones in the restaur","useful":0,"cool":0},"wXwUC-ETYhvc63EB79a0ew":{"text":"Soo good with great vegetarian options.  I will be back!  Very cute and cozy restaurant.  ","useful":0,"cool":0},"nmkAyWweFbSlsKEQJrmZjQ":{"text":"I came here after stumbling around 10+ restaraunts in the French Quarter that would cater ","useful":3,"cool":0},"aWAepJP1y0F-1LwLWUjWBg":{"text":"folx are super sweet here...i have been here many times, brought my frinds and will contin","useful":0,"cool":0},"xfXcP80DI9GrkL45q6oknw":{"text":"A tiny restaurant located in one of the streets in French quarter. We ordered vegetarian a","useful":1,"cool":1},"Ss-W_Be7GT_4hYDwTiWx7A":{"text":"Ordered the Naouki Ngond (Egusi soup). Choose the fufu instead of the rice and it was good","useful":0,"cool":0},"so8GoJ-QVAV34vRo71wZqA":{"text":"Rarely have I ever waited longer to try a restaurant, as I identified it as one of the few","useful":7,"cool":3},"EjFEXCpCNUm2O1rAW-HkcQ":{"text":"I'm here to speak about the Spinach(Jama Jama) and the Spinach only... Now, I love Spinach","useful":5,"cool":3},"P6h_lW4_KV8Z4JXQLt4EEQ":{"text":"This place is so delicious! It's a blink-n-you'll-miss-it spot in the quarter, but worth k","useful":2,"cool":1},"ox9veHeL5zxWzydALQu9eA":{"text":"An awesome find on a whim! The veggie soup, coconut rice and Jamaican chicken were amazing","useful":0,"cool":0},"u5oEvcx7bUf9z57vC99Zlg":{"text":"After several days of Louisiana cooking of various kinds and quality, we stumbled upon thi","useful":0,"cool":0},"ezZ3q7TcgCV5gpm07bv7pw":{"text":"I ate here two times. On both occasions the food was pretty tasty. Disclaimer, the place i","useful":1,"cool":0},"ogenAtGBvICiWVd3FH5mKA":{"text":"Got takeout from restaurant during covid. The fritters were decent, reminded me of hush pu","useful":1,"cool":2},"-V_rLBOgsIoTngnH9Tu4yA":{"text":"Let's just say it was a waste of time. \n\nWhere do I start? I'm still here at the table wai","useful":1,"cool":0},"3lBSgiV3QtcH4punz9T4kw":{"text":"We were really excited for this location based on reviews, but unfortunately we were under","useful":2,"cool":0},"nt6Eo5bmCaeu1f_Wax4dAg":{"text":"They make everything fresh so as expected you will wait a little while to get your food. T","useful":0,"cool":0},"1ta6gcEPc1Dkbp3xZEwU7Q":{"text":"BYOB! Fresh and unique food. Vegetarian selections. Service is slow because everything is ","useful":0,"cool":0},"MS6_LYfPYnohYJ3gkg0Hvw":{"text":"This place was a nice switch from the gluttony I'd had going on all during Mardi Gras.  It","useful":1,"cool":1},"MZmauzMwcOaq03hIHFCqwQ":{"text":"So good! I started with the fish pie, super tasty. It's similar to a meat pie, but with yo","useful":2,"cool":3},"iOf9Punds9i6mlOyYxBJAQ":{"text":"Cute little BYOB restaurant in the quarter with lots of vegetarian choices! The service wa","useful":1,"cool":0},"LDdt4ks3JzU1fUTZ0G9jLA":{"text":"Some friends and I decided to check out this place on a whim last night and we were pleasa","useful":9,"cool":3},"eAZS1ckjOjXRLNHKDSG_6A":{"text":"I had been hearing about Bennachin for some time, but finally had the chance to visit. It ","useful":3,"cool":3},"oHdcVNDqHqxgp2nGb_DaCw":{"text":"I discovered Bennachin at Jazzfest many years ago when I tried their JAMA JAMA spinach and","useful":0,"cool":0},"Mj3chX5ijLcyNKRJVIJnDg":{"text":"I'd never tried Cameroonian or Gambian cuisine so I was excited when I heard about Bennach","useful":6,"cool":4},"qkDBkYJXcGIPliCgkycOAA":{"text":"I've become a bit convinced that New Orleans reviews need to be taken with a grain of salt","useful":4,"cool":1},"n5pZaqo5X_lRIW2xOLG5Kw":{"text":"Went here because of the high rating and an online article touting it as one of the best f","useful":0,"cool":0},"Ns6EUk_ajNhDFOkOqtvSmQ":{"text":"Been waiting for ages to try African food and researched this spot while visiting New Orle","useful":1,"cool":0},"wB-z2j2axO7nK7ZsdbjZ5A":{"text":"I usually avoid eating in restaurants within the quarter because they're usually tourist t","useful":0,"cool":0},"L-qgtZizVBddfRwrGEIPTg":{"text":"Been going back now for 10 years food has got better and better.  It's not a trip to New O","useful":1,"cool":0},"RzFgo0-6mzd25lROyEam4Q":{"text":"Complex and well seasoned food.  I had to restrain myself from eating all of my stuffed ta","useful":0,"cool":0},"jfTzcbMvW1aaD97MrkGZKg":{"text":"Amazing West African food. We got the Akara black eyed pea fritters to start, and also got","useful":1,"cool":0},"sOJekCIOpFcObD7m9MUa_Q":{"text":"Tried Fufu & Eguse soup and it was bomb. The rice was bomb lol the customer service was gr","useful":0,"cool":0},"rFlMFtiVkQyaCPN4dBsSZg":{"text":"Dinner, A Taste of Africa; Gambia and Cameroon,  in NOLA....  Cozy place with flavorful et","useful":0,"cool":1},"DwTSjL26d6q7UGkpTwBE9Q":{"text":"Called to ask how the plantains are cooked and the lady was very rude and hung up on me tw","useful":0,"cool":1},"EfVz4XddtMZqt1wAU1Eg7Q":{"text":"Never had African cuisine...but I was feeling adventurous and thank god for trying new thi","useful":2,"cool":1},"h0e-d91-S72Txz0gXKiPgA":{"text":"Make sure you have time on your hands when you come to this place. It took a while to orde","useful":0,"cool":0},"yD9bPCuNRtuQPHR5LOnQfQ":{"text":"My daughter and I like to try different places to eat where you can find vegan options whe","useful":0,"cool":0},"LHXwEBm35jpIqPUxvY7m8g":{"text":"Love this place! Art is beautiful. Food is great make sure you are not in a rush! They are","useful":2,"cool":1},"YBNNaU_0xF-mHwMtgjrTjQ":{"text":"I came here 7 years ago and it left such an impression I came back this time around. Spicy","useful":1,"cool":0},"kGJFTlI-cJ_v3CoVlKRyFA":{"text":"This was an amazing pickup! The picture doesn't even capture the flavor of the chicken, sa","useful":1,"cool":1},"_UquSfutPjUwJ3OjdQTSSg":{"text":"Big portions of good African food.  Also a GREAT find for vegetarians languishing in New O","useful":1,"cool":0},"6VHzJUxY5MbL_pdFKYe4zQ":{"text":"Bennachin was a really nice find in the French Quarter! This was my very first experience ","useful":0,"cool":0},"e4ag6Z3jpkB6QT0K5FJ5nQ":{"text":"It's great to have an African restaurant in the Quarter - I just wish it were a little bet","useful":0,"cool":0},"4ufhcVKZhoRf5WeXLuUzvg":{"text":"The atmosphere was wonderful and staff really accommodating and helpful with their menu kn","useful":0,"cool":0},"xqzY6gPHqAmZ9-eEchxAvQ":{"text":"Delish! I stayed in the French Quarter for a month and this became my go-to favorite! Just","useful":0,"cool":0},"QhXiRqaNrYjbClzEGgNXYg":{"text":"A small cosy little place, pretty consistent over the years.The black eyed pea fritters ar","useful":0,"cool":0},"btAHbcr0BOE8BWeL5qyETg":{"text":"If you're looking for something different while you're in NOLA, check out Bennachin. The r","useful":1,"cool":1},"hw_yUifxCe5GesycFtriJw":{"text":"We had the Akara (black-eyed pea fritters) to start with and they were awesome.  They were","useful":4,"cool":0},"hQJNsqNPp44X6yshas0Oqg":{"text":"I was skeptic after reading all of the negative reviews but decided to tried it anyway! Th","useful":0,"cool":0},"aSZwmqa4qnuQEBezZSd-gw":{"text":"What a supreme spot in the sense that it is small, but very welcoming, chill, cheap and de","useful":1,"cool":1},"NhQYauElFWqO5K4De6Zvug":{"text":"These folks know their way around pots full of greens, beans, and lentils without invoking","useful":3,"cool":1},"he9f-M79lotPlSK3WE0Vgw":{"text":"We were looking for a vegetarian Po-boy sandwich, but no dice, so we found this place alon","useful":1,"cool":0},"VjZxWK3DXOLHYsvVR_3xBw":{"text":"Very nice restaurant. Home cooking style serving, plates of food like sautéed lamb over ri","useful":1,"cool":0},"2ak1fzVr22XJLiqot6EUvw":{"text":"Got the shipa shipa. Usually it's really good, but this time I felt as though it was missi","useful":1,"cool":0}}