{"TiNSZSvFIuj1vprYrGG0CQ":{"text":"Scott is amazing. His salon is in a fabulous modern loft and he makes you feel right at ho","useful":1,"cool":0},"azGuo-vKbRkVVV1y8XXg7w":{"text":"This is the best salon in New Orleans!  Scott is fantastic.  The prices may be high but it","useful":6,"cool":0},"vqFcXf7uNXMcKRCH2K4Hmg":{"text":"Scott is very professional and I look forward to getting my hair cut and colored everytime","useful":2,"cool":0},"vPnw3tKHGQZuzGOKY1UNcg":{"text":"I love Jupiter Salon. The stylists really are experts and will make you look and feel like","useful":0,"cool":0},"_y9ZT5kocjILMcsvRZo0TA":{"text":"Scott is amazing, he did cut and color and I couldn't be happier.  He is talented and mast","useful":3,"cool":0},"F3-GZuIt2j8_2cVYHF67wQ":{"text":"Scott was amazing to say the least. My hair looked fantastic when I left I loved my color ","useful":1,"cool":0},"Y_VRy40_9v2rN2gEUhWcdg":{"text":"Detailed and Professional.  If you want a perfect cut that will last longer than the norm ","useful":3,"cool":0},"-8WYZjiEm1TvKyQfPN0bRA":{"text":"Is it weird that I'd rather fly across the Pacific Ocean over to New Orleans to get my hai","useful":5,"cool":2},"h6XWtUsDKVCH1IMAPgAVaA":{"text":"Love the salon, Scott, and the experience. I came in with a hot mess of a hairstyle, and S","useful":2,"cool":0},"M0pKNAAlOJWBrf2WCqQ3XQ":{"text":"I was in New Orleans for business and needed a haircut badly.  I decided to bite the bulle","useful":2,"cool":0},"BYDK3Fl5P2JV_7V7OTTDTA":{"text":"Scott Reynaud is a genius, and the $150 haircut ($75 for men) is worth every penny.  A rel","useful":9,"cool":1},"NseKLEfCEeAf3TTrDwGx-w":{"text":"To me it's not that helpful to read a review from somebody who just got their cut - you ha","useful":5,"cool":1},"FvRHVBiHKGSWPSnJ8s1eMg":{"text":"Works miracles! What's one to do after a botched haircut? Look to fellow yelpers and cross","useful":3,"cool":0},"M1ZrGLLrzw6m38ytUQdiYA":{"text":"First I want to start off by saying that the best way to get a 5 star rating from me is to","useful":7,"cool":2},"A4vqDWKPXH8vOSnlGtDSbQ":{"text":"The salon owner, Scott, is a visionary and an artist literally. He customizes your hair to","useful":2,"cool":1},"9wsV-sebvjJsD8mbmGloNg":{"text":"Scott is amazing. I live in Australia and have spent my whole life looking for a colorist/","useful":2,"cool":1},"cSaNpbHAPNGYKItVElQ7hg":{"text":"Love my hair!   Friends have commented it's the best my hair has looked in years and I agr","useful":3,"cool":2},"KQF45kSk9AdJsxt7X6r2Dg":{"text":"Changing hairstylists is nerve wracking, and when I moved here from New York, boy did I hi","useful":0,"cool":0},"8JBXSwxUD_ExbxZ3NabkDQ":{"text":"What a treat!  From the moment I walked in I had Scott's undivided attention in his relaxi","useful":0,"cool":0},"kZ8MaYoFSF6BqLqgReDU-A":{"text":"One of the great things about Jupiter Salon is that, when you are in Scott's chair, you ar","useful":1,"cool":0}}