{"9B-ePK_xsXOyQC-kZfFa2Q":{"text":"Yessss! When looking for fab food in a new city this is the place I can only hope to find!","useful":0,"cool":0},"1o14TKf_IVvjj4bXZ0FRGw":{"text":"Yum. Cold cherry soup. Fresh salad. Chicken. Yum yum yum.","useful":0,"cool":0},"U0fW0J0wC036N8g4DJbWNQ":{"text":"I was so surprised to find a German restaurant in the French Quarter (thank you Yelp)! Wha","useful":2,"cool":1},"BnvVmepVP54oRQfQkTwsXg":{"text":"I bought a gift certificate to Jagerhaus from Living Social because I wanted to try new fo","useful":0,"cool":0},"zI-izYCQgobnWm4-1gkITQ":{"text":"We just spent a week in New Orleans for Jazz Fest 2014 and found Jaegerhaus just wandering","useful":0,"cool":0},"w7SzTAPCOc6bXNmzT1Ev2A":{"text":"This place is way over priced considering it's quality. Soggy flammkuchen made for a sad b","useful":2,"cool":0},"rUi4bUXjDQyoDmO5d7dD4w":{"text":"In all honesty, this is more like a 3.5 review but since we can't do 1/2 stars, it's a 3. ","useful":0,"cool":0},"ENZu_nTgUkkp2gpqVgVdrQ":{"text":"Definitely worth a visit if you are in the French Quarter and like German food. Mulled win","useful":0,"cool":0},"naehlkLHLWJstCbwMq-6VQ":{"text":"Jagerhaus is a very small restaurant just off the main drag.  Service was exceptional.  My","useful":1,"cool":0},"DySPSI4C-Fc3WssZVRuhfQ":{"text":"The women at the bar was warm and lovely but trying to get a table, the waiter was nasty a","useful":0,"cool":0},"FefYiqA3xPyX4-78xOJ1QQ":{"text":"My go to breakfast/brunch spot when i didn't want the traditional cajun/creole fare. Alway","useful":1,"cool":1},"QAJZpy4Rf2PO81ss8Gfenw":{"text":"Funny little place, I was dubious at first.\n\nOur concierge mentioned to us that they have ","useful":4,"cool":0},"0wDXEvlCJgsCfXc6m0gllg":{"text":"If I could give this place a negative rating I would. The service was slow and terrible. T","useful":0,"cool":0},"mxvR-8O69I_1Uc_3KwsBQw":{"text":"This is clearly spot on with authentic German style.  The Spaetzle was the one dish I was ","useful":2,"cool":1},"_9GQXErDXJGtnkz2YIewjw":{"text":"Dont be worried when you walk into what appears to be a cafe. It is indeed a delicious Ger","useful":4,"cool":3},"Chnxj54-ctnseLlwUyv2fg":{"text":"Way to go Jagerhaus!  I have to admit I was not expecting much from this hole in the wall ","useful":1,"cool":1},"NvLKyx5aiFkwqClYcSdLzQ":{"text":"The best German food in town. My friend and I had the tour of Munich plate that served eve","useful":2,"cool":1},"J5vPRRWu4TR1fM5tc2jBGg":{"text":"Sitting at the window, I saw more than one potential patron scan the menu, peek inside ...","useful":2,"cool":1},"ibNEa7vUlAP9-xGF01uleg":{"text":"Great food, great beers, and good service. This is a small restaurant with good German foo","useful":0,"cool":0},"p45oCFHL3VKEgp88_uWdUQ":{"text":"This place is so effing good I had to add it to Yelp.\n\nSpent a week in NOLA and ate out ev","useful":5,"cool":5},"P8VZOBq3yUHTTuAtie_qUg":{"text":"Stopped in for a light supper. Had soup and spaetzle. Server was very polite, beer was del","useful":0,"cool":0},"siNNHb54jBSACZhdv0kiqA":{"text":"We loved our brunch at this place.  The traditional flammkuchen-like a filo dough pizza cr","useful":0,"cool":0},"6NDVH11I4bm5dCOR-8TpVA":{"text":"It's next door to a bigger, fancier place that advertised Oktoberfest; checked them out bu","useful":0,"cool":0},"8_R60PnlU4TQa-dRAsW7xg":{"text":"Was in New Orleans for New Year's Eve. We hit up Jagerhouse our last night in the city and","useful":1,"cool":0},"K1DA0JK5o8Tm_XcvBPN-Dw":{"text":"Still great after all these years! \n\nOnce again, so good I had to eat here twice in one tr","useful":2,"cool":1},"KVf79AnDH6Vmovg8uHmx1Q":{"text":"I'm a big fan of German food and I did enjoy my meal, but it was not as great as I had hop","useful":2,"cool":0},"DMQOIEC6RgiXrSSWk8tJ9w":{"text":"I am kind of grumpy. Love the food, but Yelp and their website says they delivery, but the","useful":0,"cool":0},"EYQvZd9f6W-y05xhNzJUaQ":{"text":"I came here with a co-worker because I wanted to try their flammenkuche. It's my absolute ","useful":2,"cool":0},"zlhuigyNETrHHOuUr93y5Q":{"text":"The Bavarian Crepes at Jagerhaus have caused me to question my atheism.\n\nA shot of the spi","useful":0,"cool":0},"za-wXxjn3foZK3xjP1QBGA":{"text":"Service was verrrry slow.  Food was just okay.","useful":0,"cool":0},"UcA4-6ZYmkwQzWyA9pyWZA":{"text":"In my experience it is rare to go to a restaurant that has good food but have the whole ex","useful":4,"cool":0},"PhEWGn5SoOFG3g_X70jkRQ":{"text":"A hidden German gem right off Bourbon. Ordered the jaegerschnitzel and schnitzel. Deliciou","useful":0,"cool":0},"rmdmIK7jY1hD1eVtNYAhLA":{"text":"Is this place still open? Tried to go last night couldn't get through by phone. Walked the","useful":0,"cool":0},"GHYTX_moyDhjv1pvMdTdpQ":{"text":"We were here for dinner on a Sunday and it was very quite, with a steady stream of people ","useful":0,"cool":1},"n1_hYPFDJA_qjeAA82chFw":{"text":"Food is delicious!! I love German food and their meatloaf is devine. It melts the second i","useful":0,"cool":0},"0uASUCvZNZqBQW86W7LBUg":{"text":"Husband and I stopped in here on our first day visiting New Orleans. Restaurant was nearly","useful":0,"cool":0},"6ErReouY-JO3uPbVwUo-nw":{"text":"Three of us ate at the Jägerhaus  tonight. We all had the Chicken Paprikash. Absolutely gr","useful":0,"cool":0},"N_M3s8Vo1sFRc0iitsBqog":{"text":"We had breakfast here twice during our stay in the FQ.\nBoth times the food was excellent. ","useful":1,"cool":0},"D8Jc6iq3vAlvp52Cb0RNng":{"text":"Our server claimed that this is where to find the best coffee drinks in the French Quarter","useful":0,"cool":0},"oJtMH_fwJ-bZxUiXjlsg1g":{"text":"Great place! We split the Munich plate between me and the hubby it was superb...not to use","useful":0,"cool":0},"YXtLO0MeH9r24JyY7A4CPA":{"text":"Attempted to try this place with my sister during Mardi Gras 2016. My sister asked for an ","useful":0,"cool":0},"Il347pQNo47__nkDqaDhDg":{"text":"The food was fantastic... It brought me back to Oma's cooking. Very authentic and a great ","useful":1,"cool":0},"1E2X_66UbtEQqVhLD6y36w":{"text":"I'd read reviews and decided to try this place.  Went at 1pm and they were observing the m","useful":0,"cool":0},"vSJMXLn71n-0J6K9LbXaCQ":{"text":"Amazing. We couldn't decide what to order so we settled on the sampler. Wow. ALL of it was","useful":1,"cool":1},"A4BtqodiFs-gq8Cu0CsTEw":{"text":"They serve an excellent breakfast. \n\nWe had a place in mind and it was closed so we went w","useful":0,"cool":0},"DtPm2k3JVe9M1k1DwkNNRw":{"text":"I don't typically love German food but this place is great. We were here on Sunday night. ","useful":0,"cool":0},"L9E6j0EsjaYhYcvQ21RHzA":{"text":"This place is a hot mess. We came for dinner and drinks and sat at the bar. The bartender ","useful":0,"cool":0},"nO5hxHezkUuAfQReV0ChzA":{"text":"Felt a taaad guilty on our first trip to New Orleans, in the French Quarter, visiting a Ge","useful":0,"cool":1},"vcDGMIuikG6U2YbdUcur7g":{"text":"Food 8/10\nService 6/10 - one waitress \nMojitos 59/10 - seriously the best my wife has ever","useful":0,"cool":0},"mszvE_8mIw_dLDSIB9KyuA":{"text":"Aventinus and an Oktoberfest plate. Breakfast of champs.\n\nGreat food and great beer list!","useful":0,"cool":0},"dkQpcdSU4MUXJqZClHReXA":{"text":"Excellent beer menu! Knowledgeable wait staff. If you enjoy quality beer, this is the plac","useful":0,"cool":0},"sBNrbnVzWO8uxzZ8hFTOrg":{"text":"I read about this place in a couple of those touristy brochures/magazines but you know the","useful":9,"cool":9},"hzFVeMjfJ-CP-UGVGMIoig":{"text":"Very good food and beer selection is great. They make the best coffee too! I would give it","useful":1,"cool":0},"TAWlgjovvdX8XYIHRHIvBQ":{"text":"What an awesome surprise! I don't think I've ever experienced authentic German cuisine bef","useful":0,"cool":0},"DgmgdgKIy11k_KzVOcqt5A":{"text":"Everyone should go here, except I sort of hope they don't because it's hard enough to get ","useful":0,"cool":0},"c_OxtZJm3-McbujFyknJiA":{"text":"Probably a bit biased writing this as the owner of this establishment was also my host for","useful":0,"cool":0},"FExHhM6Vq-_v4bVmqOwhQQ":{"text":"You can only have crawfish boil and po boys and beignets for, maybe 5 or 6 meals back to b","useful":1,"cool":1},"S_PNLp_-8LDRPHMcIwo0Bw":{"text":"So, I didn't eat here the first time I came here because the bartender was really rude(thi","useful":1,"cool":0},"WVJHhlLVD5lfDPkR0p799w":{"text":"A friend of mine was going on and on about this place. So, I figured it must be good I hav","useful":2,"cool":0},"VpcCoJCnLkQLAkckjj7_eQ":{"text":"This is a review that is strictly concerning breakfast.\n\nMy wife and I went here twice whi","useful":0,"cool":0},"88y-lc9N8ti0mQfVXUrH7A":{"text":"Delicious x 3!!! I had the bratwurst po boy and a warsteiner beer, and it was to die for! ","useful":0,"cool":0},"YqUkT5Z4miAFojk-W-kLTA":{"text":"This was such a great change because me and my husband were sick and tired of cajun/seafoo","useful":1,"cool":0},"-s9MI60IKnqDEZnmg_hN5Q":{"text":"The Jägerhaus reviews did not disappoint! This is a wonderful food option if you want some","useful":0,"cool":0},"4ICrzKOBajRCUmgvjoOe-Q":{"text":"During a trip to New Orleans, I found Jagerhaus on Yelp because it was next to my Hotel an","useful":1,"cool":1},"7uopLSYtPrswezIcMRus6Q":{"text":"We ate here for lunch one day and breakfast another day.  We all loved this place.  Yarda ","useful":0,"cool":0},"lcNCCTiPV8hshfFr52x1nA":{"text":"I have eaten here a couple of times and I really enjoy this place.  The chef is right ther","useful":1,"cool":0},"v8eQqo3KjbrnKz2pLWm_3Q":{"text":"So I guess you can't expect too much for a German restaurant in the French Quarter, the fo","useful":2,"cool":0},"NC_DROGZNlHmoR7lC7CCVg":{"text":"Stopped in for breakfast and it was good. I just had a basic breakfast of scrambled eggs a","useful":0,"cool":0},"RDFLAE6Dcz_67u4sLUIvFQ":{"text":"First of all let me say I met Yarda the owner of Jagerhaus. He is a dedicated individual t","useful":1,"cool":1},"-pJSY7iUAfBxx6tZdE6s9Q":{"text":"Excellent meal and German food! I got the Jaegerschnitzel, which had the best creamy, mush","useful":0,"cool":0},"wF5sH6haQR7llmeFpUG9ug":{"text":"German food in NOLA?  YES!!  This is the place to be if you want to try something differen","useful":0,"cool":0},"KTFv_-UCGRQwE0jXs9_pRA":{"text":"Beers were great & the food was delish!  I had a raspberry beer & the munich salad, my Mom","useful":0,"cool":0},"TnWz89VECzKHeul5La331A":{"text":"this place was awesome except their choice of music . their food was amazing, brought back","useful":0,"cool":0},"yxmWbKPBrw_YqsUlzNqsyg":{"text":"I really didn't like this place. The food wasn't very tasty. I've been to Germany many tim","useful":0,"cool":0},"eXvAki4aFJgkzWxvF46OoQ":{"text":"I have dined here with friends and family on several occasions and it has been a wonderful","useful":0,"cool":0},"5OHAmTVkxOHAJRW0RK_9Zw":{"text":"We wanted something different than the regular French quarter fare and decided to try this","useful":1,"cool":0},"UPOZLrR6ppbgBhHccDsH9Q":{"text":"Food took a bit, but wasn't disappointed when we finally got it.  Started off with a pretz","useful":0,"cool":0},"p3KYIs3dYB0BNnH_k2FREQ":{"text":"I can't really give a solid review of the food here, as we weren't really eating dinner, b","useful":2,"cool":0},"dg8kE54Q-mCKj5GDA9qwvQ":{"text":"This was such a great change from Cajun and seafood here in Nola. I grew up with a German ","useful":0,"cool":0},"h9SQT99BVE_Nd-g5bDdx5A":{"text":"The food was great! We stayed across the street at the Prince Conti hotel, so we ate here ","useful":1,"cool":0},"V9ZChpETGozDVXOOLoVYkg":{"text":"I was in NOLA on business and walked past this place. I was surprised to see a German rest","useful":0,"cool":0},"lWoOFJz6MaC4PB_UIjvC9g":{"text":"German food was not what I was planning to dine on during my visit to New Orleans this pas","useful":0,"cool":3},"1KvogOhsnX19pHqg1CcIJA":{"text":"The schnitzel was wonderful, both on a sandwich and on its own.  The spaetzle was extremel","useful":0,"cool":0},"qrpuJ0TVAEPaLuzNfzvgzA":{"text":"Decided to try something different for breakfast while in town and it was awesome.  We wer","useful":1,"cool":1},"Ag5i7eCyf8wMpjhfCGGSYA":{"text":"Not much to eat if you're with a vegetarian, but a very cute place.  The wait staff seemed","useful":3,"cool":1},"V3gHK7HJ8wTeEFOUZ2-RXA":{"text":"What an amazing place! I spent most of my New Orleans vacation seeking out good food and t","useful":0,"cool":0},"q4wr-Jsq-h_6PBw5pi8fIA":{"text":"Ausgezeichnet!  German food that is authentic and fast. The very BEST Spaetzle we ever had","useful":0,"cool":0},"YZ3FFvOEbMztTjUWcJjPTQ":{"text":"Killer mushroom and swiss hamburger!!  Yes, I ordered a burger at this German restaurant. ","useful":0,"cool":2},"JuXOQeuvD0INoigg5qhF9Q":{"text":"My Louisiana Food Hounds are truly blessed... not only are they in one of the most incredi","useful":2,"cool":0},"LH0ak12xsrb05gxuOp2yDQ":{"text":"My partner and I went here often when we lived in the CBD and loved it as a special treat.","useful":2,"cool":1},"2sI5q2i9wsfaEn6vMQzjmg":{"text":"Went for breakfast and enjoyed everything even though the waiter was a trainee and was a b","useful":0,"cool":0},"jaYzRcEe_M5LtMkkPus8Pg":{"text":"Had the  Kuchen thingie dingie & it was amazing. They took a little while, but it was wort","useful":0,"cool":0},"H6aRRXcI3Omoe1_GqVtuiQ":{"text":"If you are looking for authentic German/Austrian, this is not it. But that doesn't mean yo","useful":0,"cool":1},"nqpj4JndStZQdrLGtGEQQw":{"text":"Meh.  I would give this place a pass noting that we are in NOLA and yeah... Cajun is king.","useful":4,"cool":1},"ceflcMg5YDjovD2yEujoIg":{"text":"Bartender is awesome. Mojitos made with real fruit. Mimosas $5","useful":0,"cool":0},"miBihIlutGPtJd17VJJLyA":{"text":"The veinerschnitzel was very good everything was cooked well the wait was about 12 min.  O","useful":0,"cool":0},"wPWiIVautKMROI1LuAta9A":{"text":"We stopped in for a quick breakfast and the service was awful, the waitress/hostess was ru","useful":0,"cool":0},"DuSYNzEuRxYSvwgDrrYnyw":{"text":"We ordered the Munich plate and found it to be abundant and lots of variety of good food. ","useful":0,"cool":0},"gklEhjQTRklaNngI4Pgq4g":{"text":"This place is AMAZING. Now, I'm not a huge burger person or anything, but the German Burge","useful":2,"cool":0},"MrHuXNThPRX1oUqIM4FY6w":{"text":"Excellent, authentic Bavarian fare. Great selection of German beer. Freshly made goulash. ","useful":0,"cool":0},"oq5Y0afTaB0jsQcSOUlv6g":{"text":"Very delicious German entrees. Attentive waiter and wonderful coffee! Good change up from ","useful":0,"cool":0},"Qphgu--6omriqSmnd2CpsQ":{"text":"The German Burger was amazing - hard to describe how good it was.  Only downside is my mou","useful":1,"cool":0},"nSug4pP0qlFgjvIZhFQpnA":{"text":"Great reviews by Yelpers led us to this German restaurant.  The yelp page told us they wer","useful":2,"cool":2},"4I9B7rQgxZPjxoSmSYJ8ew":{"text":"Excellent place for breakfast in NOLA. I loved it. This was an unorthodox choice or breakf","useful":3,"cool":0},"PZOgB874csZXdQR6s5aKlA":{"text":"A group of stopped in for lunch on a Fri. afternoon and we all left stuffed and happy!! Th","useful":1,"cool":2},"K3mkBiTDH2W_nDOYj_3PmQ":{"text":"Food was ok. Mustard had to much horseradish in it. Overpriced, especially for dinner. Add","useful":0,"cool":0},"77AUdKB8MUkkzIrVlxZb7A":{"text":"My husband and I thought this restaurant was excellent. I had wiener schnitzel with red ca","useful":0,"cool":0},"riEWE8mRpuGI_-d-3mZ4vA":{"text":"The food is good. The prices are right. The beer comes in liter mugs. What's not to like? ","useful":0,"cool":0},"3hTIvjZeQAcUEi0df6VbKA":{"text":"Our experience at Jagerhaus was terrific.  We enjoyed breakfast there twice during our sho","useful":0,"cool":0},"1pwVbybe-hSyZ4HnFBdfOg":{"text":"Great food, just off Bourbon, at decent price.  Service not the best, and air was broke or","useful":0,"cool":0},"w3YQjO2m9G4-JlHToKycGQ":{"text":"The food and the beer aren't the only things that are great about this place, the service ","useful":0,"cool":0},"prIvjroyfIfYb0covM2xFA":{"text":"Descent coffee, but the Belgian waffles are great. My wife rates the coffee higher, but th","useful":0,"cool":0},"2cbkjDtNyp0RB4Fu1I7fmA":{"text":"My boyfriend and I have been here twice for breakfast. The first time was amazing and they","useful":2,"cool":0},"9dy4p64x2NPqOU7v4tVnbg":{"text":"Excellent German food!!!  I had the zucchini fritte and it was excellent.  I also tried th","useful":0,"cool":0},"KTcUh1SmB0jYOkAGJWBJnQ":{"text":"One of the few places open Christmas morning, we were welcomed by their nice waitress and ","useful":0,"cool":1},"iRtDBNAMDB8g8-PgokJ2tw":{"text":"On two separate trips to NOLA we stop ped in here. Once for dinner which was fantastic. I ","useful":2,"cool":0},"v0BLZD_NJ_OltLknG90u-w":{"text":"Love this place! The atmosphere was small and peaceful. The decor was nice. When I was the","useful":0,"cool":0},"5QNHK9kdUDM-XzgkcwmITw":{"text":"We love to travel. We love to travel for food. And we always make room for a German restau","useful":3,"cool":2},"EzNVZddQ3mdvVB1V7KuFig":{"text":"How this restaurant ONLY has 223 reviews is beyond me!  We stumbled upon this hidden gem b","useful":0,"cool":0},"TC1BnVU9U_NSYS6NIMvc5A":{"text":"Not impressed with the Wiener schnitzel\n\nMy wife and I visited this establishment on a Gro","useful":0,"cool":0},"ixlejkRlnuxtqCXdz7yZyg":{"text":"I love being surprised by the hidden gems in our fair city. Jagerhaus treated me to one of","useful":5,"cool":4},"sdqom_Fg11E5yLJdtMFErg":{"text":"Really enjoy this place- great burgers and great entrees.  I've had a few meals there, but","useful":2,"cool":0},"sGMZBvwaVbqCNP38wfzOXg":{"text":"Food was great and service was amazing. Very cool place off of bourbon. The lattes were gr","useful":1,"cool":0},"33R571_a4SqPd3XnuS3chg":{"text":"Went for lunch and the food was absolutely outstanding! I had the German Meatloaf  with si","useful":0,"cool":0},"4kI_CUcfZJgLmAL-u9P53w":{"text":"I visited Jagerhaus a few times during my week long visit to New Orleans. It was located a","useful":0,"cool":0},"MIjoKpsZrubEu_c2Fs7rMg":{"text":"Yes it's German food in New Orleans but the food has been so bad there the last few times ","useful":0,"cool":0},"cfDCkxZ2bjBaOp_PxBEY4g":{"text":"The food was great. The only thing better than the food was the service. It's great too se","useful":0,"cool":1},"751HsbTj2zMc1pRWazRFCw":{"text":"Absolutely amazing! Beer, food, dessert, service all 5 star! It's nice to feed my German c","useful":0,"cool":0},"J4JahQlReDxnQBNLlkGJqg":{"text":"Best place for breakfast in the French Quarters! Sweat Potatoes waffles are wonderful and ","useful":1,"cool":0},"dL9MwxLnXPpeobtbpMhlbA":{"text":"My mother, her friend and I went here on Saturday night July 18, 2014. We ordered the germ","useful":1,"cool":0},"Lz6r42WyA4QEvaiooBiueA":{"text":"Authentic deutsches restaurant in the quarter! Extensive European beer list. Potato pancak","useful":1,"cool":1},"YbHiEo85yHcChBvpG3GqJA":{"text":"Went to this place for dinner. Fairly good selection of German beer, and the veggie burger","useful":0,"cool":0},"Ymu5RHt7HOSqECpgn-lujA":{"text":"Really good food! I can't give it five stars because they ran out of a couple of things wh","useful":0,"cool":0},"vF0UP4D25gNr8VEBRdluyg":{"text":"Great spot for lunch in the Quarter.  I do miss the lunch special, though.  The goulash is","useful":0,"cool":0},"zRBicDo5bi9n8f8qp_AHDg":{"text":"I eat at Jagerghaus at least weekly. Their coffee is surprisingly incredible, and the food","useful":2,"cool":0},"9j0wsWh6ciwbcUXSqUDDxg":{"text":"My husband and I both took German as our foreign language in high school, so we were reall","useful":0,"cool":0},"0j8I68t0Q4XSXPwll67CiQ":{"text":"Had a great breakfast here while in New Orleans for the weekend. I got one of the breakfas","useful":0,"cool":0},"XB65OrszAS4iW6pt_g1PIw":{"text":"OSU and German food fans rejoice!!! You have found a fantastic place for German/Hungarian ","useful":0,"cool":0},"uRmEekzJAaI_FnqhV5JvMA":{"text":"cold and cloudy hefeweizen, and the food yummy was in town for 5 days and ate her two of t","useful":0,"cool":0},"zGqsaMJpjwu9zqHzbr7UMQ":{"text":"Great German food.  We had a platter with lots of great meats and sides.  We were stuffed,","useful":1,"cool":0},"bpnmJrbzCrw_-T9f_zvdRw":{"text":"I do not post yelp reviews very often and have recently become very skeptical of yelp revi","useful":1,"cool":0},"UVFXwNHW1hSqBgiCurCTTw":{"text":"This is a really consistent and quality cafe that serves a nice little assortment of draug","useful":0,"cool":0},"rYnZCWpDcjbLHH3uzKgtaw":{"text":"Another rainy day in NOLA. I've been anticipating JagerHaus for a few days now, since the ","useful":0,"cool":0},"Nv8LGDYclMNMKVYqGfZN9Q":{"text":"Interesting, a German restaurant in the French Quarter.  After overdosing on cajun/creole,","useful":3,"cool":5},"C6vKlL7JJowR2jFbNpihpA":{"text":"Great food and really fun staff. A nice break from the French Quarter bar scene!","useful":0,"cool":0},"NatyHABJHti6TSu_o7Q09A":{"text":"I'm not sure why this place has so many 5 star ratings; the service, alone, was mediocre a","useful":0,"cool":0},"ij88a6X0V0eF3efoHAZYLw":{"text":"I've eaten here 3 times with 3 trips to New Orleans.  The first 2 were outstanding and the","useful":0,"cool":0},"zRffhn5rV-ERw2SQFmzEhQ":{"text":"First and foremost, I should say that I would give this restaurant 4 stars, but the beer i","useful":0,"cool":0},"H7N0hTdCgRlFdpUobBIqxg":{"text":"Though I love their atmosphere and authentic German food, I was disappointed they no longe","useful":0,"cool":0},"a6Yin6zymxMCpDqYGaYSHw":{"text":"If you're looking for an authentic Czechoslovakian, Austrian,  German dining experience in","useful":1,"cool":0},"RNrdE5c1TNpPyHlatkf9bQ":{"text":"The bratwurst and the other sausages were excellent. The pork chop was overdone. It didn't","useful":0,"cool":0},"WXUTFLmhSNrB0hIRyvGXNQ":{"text":"German music playing from speakers and bottles of German beer available to drink does not ","useful":2,"cool":0},"SiHQp39tY_-pSqWkXrrAgg":{"text":"Yum yum yum! I got there at around 10 and they made me the most amazing bratwurst, red cab","useful":0,"cool":0},"n-eq3ammcUnCQB524Wb1xw":{"text":"Very good veal - beer was excellent - bathroom wouldn't flush but they were working on it","useful":0,"cool":0},"S1k8m3TI--n0P1jddfud1w":{"text":"Visited several nights ago w/ friends hoping for a pretty decent meal based on the yelp re","useful":1,"cool":0},"35Dw3X8K0tXUsvGaEQHY-Q":{"text":"ACHTUNG!  *TASTEGASM ALERT!*\n\nSITREP\n\nIf there was restaurant-establishment I could hide i","useful":14,"cool":10},"JnpE0aWpbRWX-7-1TFLrNg":{"text":"Stumbled into this place while staying at the Dauphine Orleans.  They had a specials sign ","useful":0,"cool":0},"p0FWPw58574lRxj12p70ww":{"text":"Fantastic food! I come from a German family and have never tasted better wienerschnitzel. ","useful":0,"cool":0},"30sFHl83bfhSMYeKHpf83Q":{"text":"I used to adore this restaurant, but the steadily declining service has finally served to ","useful":3,"cool":0},"1Fvt1wqJAVDWe4dmB8W8pw":{"text":"Great food, interesting atmosphere and great draft beers.  Definitely worth stopping in - ","useful":0,"cool":0},"YHmqYDWX0oJxAJsDuG7N2w":{"text":"I live in New Orleans and I love German food- and Jagerhaus is the only German restaurant ","useful":0,"cool":0},"zoJOs03qpuRYyaBvlRhwww":{"text":"The Jagerhaus is a wonderful find for anyone that wants something other than Cajun or Creo","useful":1,"cool":0},"88RQCWN1tWqWCmkSses00w":{"text":"LOVED this place! Thank goodness Groupon had a deal for it so I knew of it! My husband and","useful":0,"cool":0},"PVLqbIBCDKtNRd30rBd6Wg":{"text":"Wirklich gute Speise! \n\nI was wandering around the Quarter, not sure what I was hungry for","useful":0,"cool":0},"pMdL848UE8bC4trxd9VJ_Q":{"text":"I should preface this by saying that I actually lived in Germany for about 8 years and hav","useful":4,"cool":1},"VAn3ZX1wPo9wV-5-6bwkew":{"text":"This place has the most rude waitress I have ever had the displeasure of experiencing. If ","useful":0,"cool":0},"xdRReZ4fLbEIu5Ifit_oeg":{"text":"I'd give it 4 for the food, and zero for the service. The bartender was alright, but the w","useful":0,"cool":0},"xGyt0BGbwxHFrbAxfEooVg":{"text":"Service - Slooooow... It took us almost an hour to get our food. And this place is more li","useful":2,"cool":0},"c58krcaEixfRljiQ4ebiKA":{"text":"While stuck on Conti Street in the infamous \"I can't get across Bourbon Street traffic\", w","useful":1,"cool":0},"Kc0-r6k1_8PVOGwgpq8gZw":{"text":"Great coffee for that early morning pickup. They have all the specialty coffee drinks hot ","useful":0,"cool":0},"8doSg7AOmrEZT7ABg6FrFQ":{"text":"My first night in town I was tired and hungry! I had not planned on eating German food in ","useful":0,"cool":0},"9JbN-A_4kWnilEDtuXXztQ":{"text":"Stopped in this place when my boyfriend, his younger brother (15 y/o), and myself were loo","useful":1,"cool":0},"EDH85Q0NCTfbFCywPSCc3A":{"text":"This place has the worst service I've ever experienced. The food is just alright. We were ","useful":2,"cool":0},"EtWJ9p4QW244D6PelzRQtQ":{"text":"Delicious. This place is hidden right off bourbon street. Many tourists wouldn't even know","useful":0,"cool":0},"hOxIiKPRUx38rj7TRqrSfQ":{"text":"I don't like writing bad reviews. I'm writing this one because I don't want someone else g","useful":11,"cool":6},"3pMDGQyH1vqghwsVecqJPw":{"text":"Everything here is phenomenal! We love this place! We come to NOLA every year and always s","useful":0,"cool":0},"ITmKGEKYRRVcp0F-RAzKrw":{"text":"Allow me to caveat that while I thoroughly enjoy German food, and have dined on it from TX","useful":3,"cool":0},"R9rW2clbT7CL7rEQDAi6Ew":{"text":"I came here with two friends. The place was ridiculously packed, but we were able to get s","useful":1,"cool":1},"fx-RA9fkaoyphi86E0fgtQ":{"text":"First time- paulaner hefeweisen on draft, Mmm tasty!","useful":0,"cool":0},"Tur1CdtL7y833tblZsB_Mg":{"text":"Charming, clean, good food at a great price.   Great find off the beaten path.","useful":0,"cool":0},"MY-YuqwrHrkW1nfQ0IdCSw":{"text":"We arrived at 3:00 am, I had the German burger and it was awesome!  The flavor was great a","useful":0,"cool":0},"4NO6SfEn400G7qLbiPlDxw":{"text":"This was our 1st meal where the entire family was pleased. It was so nice to have such dif","useful":0,"cool":0},"8pnGgPBLV-cKa93VgveNrQ":{"text":"This place was very busy and only had 1 waitress for the only restaurant. \n\nBut.... I orde","useful":0,"cool":0},"bXpdUmHv7XXuBFYPzXQV1Q":{"text":"As a local, I tend to stay away from eating out in the quarter. Jagerhaus is the exception","useful":0,"cool":0},"dbF-NOdk_RYIGNqkrJRYnQ":{"text":"Stopped in for breakfast and was surprised to find they had Flamkuchen (sp).  The pesto Fl","useful":2,"cool":0},"_EjzX2K4cLpMpJ0Hh_3qig":{"text":"JaegerHaus - Fresh, authentic German food in the French Quarter. I think they must have a ","useful":0,"cool":0},"NKsIwBwlhPM_TD37xqqidg":{"text":"We couldn't check into our room yet, being Jazzfest weekend and 10am... so we wandered aro","useful":0,"cool":0},"aFrD6vXIyPv_1f2i-2fszg":{"text":"So I didn't expect to be eating German food when I was down in NOLA, but after seeing the ","useful":0,"cool":0},"UT2eJKlEp9e84bJ6zC9NWA":{"text":"Some of the worst service I have ever had. The waitress was incredibly rude to us and seem","useful":0,"cool":0},"dtX0gy5Kuc25y4HW0OaAhw":{"text":"My last trip in on 10/25/16 was great!  I had the Jaegerschnitzel and all was in order.  T","useful":3,"cool":1},"x7-nmECMRNLysqYw9aOdBw":{"text":"Best food in French quarter for us. Went out for lunch. Loved it. Came back for diner.","useful":0,"cool":0},"bDJKVRTwqx4b3zpkthi2Cw":{"text":"Jagerhaus has everything I need. I found this place when I started working just up on the ","useful":1,"cool":2},"HMDQ1JXBdUoG4yWPhhbAig":{"text":"Why visit a German restaurant while in the French quarter?  Well, because the food is fant","useful":0,"cool":0},"f5zFN9n30vWdATCjmdn7eQ":{"text":"The food was amazing. Very authentic. However, the service lacked. We waited 15 minutes ju","useful":0,"cool":0},"6ioAjlaS8DOg6QJJS4o3pg":{"text":"Best Jager Schnitzel in town. I crave this place!! mmmmhmmmm gonna git my German ON!","useful":2,"cool":0},"MtAVOcGcIAnD56OWVDVWFA":{"text":"Jason was our server this morning for breakfast. Friendly and helpful, he directed us to e","useful":0,"cool":0},"QDOXMxiiM-4AsrmMrnXGEQ":{"text":"Great atmosphere for lunch. Pleasant staff and great music on the radio. Food was great. \n","useful":0,"cool":0},"_dw8mYyvCsHLlqjha6wAVw":{"text":"Has Jäger Haus closed??? I have been trying to make reservations all week and their phone ","useful":1,"cool":1},"urxJ9wppqbE-21PNVRYbWw":{"text":"Big Joe on the Swamp Adventures tour told us to check this spot out for some great food. W","useful":1,"cool":1},"VWdScuScXNE_zq8uHgM3og":{"text":"Had the Oktoberfest plate with spatzel and a side of German potato salad all of which were","useful":0,"cool":0},"MDSIdsHm4_3zZFJ31WUu_g":{"text":"Um, I give this place 5 stars for their amazing pretzels alone. BEST PRETZEL I've ever had","useful":3,"cool":0},"nIGe2jNgcBBjJNbLgn6kNQ":{"text":"This is good but not great German food (but probably the best I've had in New Orleans).  I","useful":4,"cool":4},"oxD3vcZ6HyZiu0RduShaqQ":{"text":"Service: 5 stars! :)\nFood: 3 stars\nI wish I could somehow express food and service separat","useful":2,"cool":0},"e6aoMQrBLIjZKCFibY_oxg":{"text":"BLUF:  Awesome Germany food in the qrtr; good prices; good German beers.  Something differ","useful":4,"cool":0},"LNgvNuf3KiVcmaVJpw7yLw":{"text":"I've traveled and dinned in Germany a dozen times.  Jagerhaus is a bit of a disappointment","useful":1,"cool":1},"QZFFeBjrFtca2a2K7SI7Rw":{"text":"Not. A. Fan. Blah!!! \nWas so looking forward to some good German food. This was not it. Wh","useful":3,"cool":0},"VnG1K89U_noGnXvC9of8Ng":{"text":"Meh.  The food was just OK.  I'm not a German food expert, but I didn't expect my sauerkra","useful":0,"cool":0},"YZuC8xnn1dMJFEg9DoIgGg":{"text":"My wife and I had the Octoberfest plate and jägerschnitzel with the gluawein  and the  ave","useful":2,"cool":1},"wgErKY5Gbx0MdLwPzPdHDg":{"text":"Best German food I've ever had. We had the pretzel and brat appetizer and it came with the","useful":0,"cool":0},"UOZ6wbNIsHoTKKg2L63iCw":{"text":"Best grits I've ever had in New Orleans... I think.  There was that time at Mother's but I","useful":0,"cool":1},"a3Tipsyg8yZwxn95ryllWg":{"text":"Breakfast was great.  Atmosphere as good. They serve Lavazza Italian coffee which is very ","useful":0,"cool":0},"cz0C4IhfAxelzCFAhiLnOg":{"text":"The beer cheese pretzel bites are slammin. Great German food with a good selection of Germ","useful":0,"cool":0},"R0qlF1pNL9OFbdRrTPnqtg":{"text":"I feel like I was just served a delicious meal by a German grandmother.   Was not expectin","useful":0,"cool":1},"zzDxntMtmQeL3Clv8egO8g":{"text":"A fabulous place!!! Truth be told, the place doesn't look like much from the outside. It's","useful":0,"cool":0},"YSGw41CKP8h17_rE3Gaw4w":{"text":"great place. i get breakfast every Saturday here. Delicious. Everything is top notch. Qual","useful":0,"cool":0},"YsnMXAtf2kFEJW33sZ7B_w":{"text":"DELICIOUS......What a treat.....after so much fried food....a real treat.   Jeremy is a gr","useful":1,"cool":0},"keEYF3DjnfIzOnsnVc47mA":{"text":"Excellent value. Great change from all the jambalaya. Delicious coffee and only .25 for so","useful":0,"cool":0},"ZlbkKU2h_eypRag2tAHhCg":{"text":"While visiting NOLA for a military reunion, we decided to stop and see what Jagerhaus had ","useful":0,"cool":0},"pfMOFAG64tkAAzvi-JElqw":{"text":"Within 10 minutes of being served, I scarfed the 1/2 pound ground angus beef topped with h","useful":2,"cool":0},"OpEkUXERswG-V4Pe7f4StA":{"text":"Great place for breakfast/brunch!  Try the Barbarian Crepe.","useful":0,"cool":0},"bOZrQp11XJ_t7sxCfnj6Mw":{"text":"Went there last night.  It's fun to sit in front and watch the hi-jinks of the colorful ri","useful":2,"cool":0},"5wwU2PlzLxIR5tXDz27ILg":{"text":"We stopped here for a nice, sit down breakfast.  The coffee was excellent. The service was","useful":0,"cool":0},"MIWthE-j2vxbE5xOzX224A":{"text":"This is my first five star. The Reuben made with potato pancakes is amazing. I was only ab","useful":0,"cool":0},"3C4zDGS4Qg1yYGEpzB4TLw":{"text":"This place was awesome. We were in NOLA for NYE and hadn't made reservations, and everythi","useful":2,"cool":0},"U3jHyHmTcZDoVzt-kT8abA":{"text":"We enjoyed everything we had for breakfast from the food to the coffee. The place is small","useful":0,"cool":0},"VsLGGGax2SzSDRQH5RQaPQ":{"text":"I stayed in the Hotel across the street and had Breakfast here every day. Excellent ! The ","useful":0,"cool":0},"wEKW5daFekcgLuMzfBwQqg":{"text":"Never thought about eating anything other than Cajun food in NOLA but after reading the re","useful":1,"cool":1},"6i_PDu1hz45Cz9qLxOezvw":{"text":"German food, is a hard commodity to get right.\nIt is a little filling, by some standards, ","useful":1,"cool":2},"ptfJVZTPye8v8S_jMy_NYw":{"text":"VIENNESE CAFÉ atmosphere, northerm European inspired menu;\nDELICIOUS: pierogies, breakfast","useful":3,"cool":1},"3wkuk2bOM0I2rl0tmbWnug":{"text":"While the service was quite fine, I found the food to be much less than expected. I had th","useful":0,"cool":0},"FpEnn3JlUS6IafeD8AaZxQ":{"text":"One of the best meals I have ever had!\n\nI had coupon from restaurant.com for this place. S","useful":1,"cool":2},"T64YRO8oX4jIihFe0CfDdg":{"text":"Finally took the wife with me to NOLA and just had to stop at Jagerhaus.  I had bragged ab","useful":3,"cool":3},"YYcA-cu_Gubc_c4pOaFnqw":{"text":"I know what you thinking - German in NOLA.  I was in New Orleans for 6 days and really nee","useful":3,"cool":1},"OVRadzPl99OwhTAbIvjL6w":{"text":"If I was to talk to the manager of Jager Haus and tell him what was great about their rest","useful":1,"cool":1},"EQEN8JDoi8GgdYZ0beJjsA":{"text":"I must have got the same slow waitress everyone else talks about.\n\nRestaurant was essentia","useful":1,"cool":1}}