{"Q8R95Nszh355ZZmPcMdPkA":{"text":"Best cracklings I have ever had!!!! And the rest was also absolutely delicious. Highly rec","useful":0,"cool":0},"1id12p75BPFV-K1KFhVaFA":{"text":"So maybe it was the food, the football game, the ambience, the company, or a combination t","useful":6,"cool":5},"akKlNaKWvbsLcF_vLAfXNQ":{"text":"Flavor update:\nHad the buttermilk fried chicken sandwich today for lunch. The pictures tha","useful":1,"cool":1},"N-BvymV5Vmi75r8_HPx76g":{"text":"5 stars for my first time attending. Boudain balls, head hog cheese, double chop pork chop","useful":0,"cool":0},"ZeccnhUbugh6hDMXKoe5ig":{"text":"Don't think about it and order the meatery board. Also had the boudin balls. I docked a st","useful":2,"cool":2},"rEw4c90LrW_JtVwfov25Gg":{"text":"I am loving Toups!! Big fan! This is my first time dining here with my girls and were we i","useful":0,"cool":1},"LbL7MsUm-oKb0zPra5yTKg":{"text":"I flew down from New York to New Orleans for New Year's Eve and waited far too long to mak","useful":0,"cool":0},"o-9lZHRCl4R2K5XfrGSDfQ":{"text":"Had the Chef lunch (boudin balls, Toups burger, beer). Boudin balls were quite possibly th","useful":1,"cool":0},"cngrNP-QP2iPnZAbtW95uQ":{"text":"First time here and had to eat at Toups! Shared dishes and it was awesome! Thank you Toups","useful":1,"cool":1},"9MjO8f4GfWiPq3LMNgLDmg":{"text":"My son and I were giving my new Samsung Galaxy Tablet a work out. More specifically we wer","useful":1,"cool":0},"OX1dV0uXVFu52F-DKJHYMg":{"text":"Toups has never failed to wow me. From lunch to dinner everytime I go I leave with a happy","useful":0,"cool":1},"AiVuaNs0MA_WPaX4FiQ0qQ":{"text":"This place was life changing! I'm a huge foodie and this place is on my #1 spot! Everythin","useful":0,"cool":0},"yLOIWCHschOIkZhUIXfwPQ":{"text":"Love this place. Just had an amazing dinner with my family! The cheese and the meat boards","useful":0,"cool":0},"QwRrBH-ztANSGke7mYrlQQ":{"text":"really good food - different - extraordinarily tasty meat dishes like you have never sampl","useful":0,"cool":0},"kwKVW3DmKsAWsFRkamHYuA":{"text":"We had an unfulfilled experience last night.  The \"host\" was extremely rude regarding our ","useful":0,"cool":0},"aTqHE_Sbv4yZs6uISUX9Pg":{"text":"Just enjoyed the meatery platter, deviled eggs, and bibb salad--fantastic! I ate my first ","useful":0,"cool":0},"OrWrGVdJirKr9ChOX1tr2g":{"text":"Had a delicious and unique dinner here on Tuesday night. \n\nSet the scene: the place is mor","useful":0,"cool":0},"PjK95duUDFaMQOV6aC9YFQ":{"text":"The peacock serves an excellent dinner under the live oaks.  Anyone who disparages a serve","useful":0,"cool":0},"BtYlODA6QX-5OPaWosYTCg":{"text":"Wonderful food! Had the Lamb Neck which was tender and flavorful. Pork Chop was also a sur","useful":0,"cool":0},"9F0r31lkkyxgt-xV6w9HTA":{"text":"My friend changed my life last night and took me to Toups' Meatery for the first time, I t","useful":1,"cool":0},"C0pxbyD_Lq_0TYSA-ivrzA":{"text":"After seeing Chef Isaac on Top Chef my wife and I were determined to visit his restaurant.","useful":3,"cool":0},"NqnC3r4tpQqTzKwHoVeH1A":{"text":"What a great restaurant. The food is INCREDIBLE! Can't wait to go back. \n\nService was so a","useful":0,"cool":0},"ceBhhV6GBggrAeseMpZ3vA":{"text":"Came here on the recommendation of a family member.  Lots of good meat choices and lots of","useful":0,"cool":0},"GthPr9OobWVQQGjCECnCVQ":{"text":"Amazing amazing amazing! Our friends took us here while we were visiting and we had the ta","useful":0,"cool":0},"UbeQ2ntTIHYucHff9azezA":{"text":"I had been wanting to try this place for a while. We got the pickle plate to start. Figure","useful":0,"cool":0},"8VZ819KL2OvclCXisYN1qg":{"text":"Two out of our party of four didn't feel well after lunch. Service was spotty. Pickles wer","useful":0,"cool":0},"lS-dU6D0uYLIJXrQZzTf1w":{"text":"My 3 star review is an average based on several factors:\n\nFood - 4 1/2 stars\nOur server - ","useful":4,"cool":1},"NddPiXMs7GWa53HPrQU7Lg":{"text":"All my bags were packed and I was ready to go, from New Orleans. I wanted one last good me","useful":0,"cool":0},"VEQNeRp24MmsdOEjZJOqGw":{"text":"If you are visiting NOLA and want to try something out of the quarter that won't let you d","useful":1,"cool":1},"OVI9ZPkjIAN84_NMe_C8Iw":{"text":"This place was such a joke. My fiance and I went here for my birthday, and it was just awf","useful":2,"cool":0},"RzQbSaUzBLw-BXF_1NcHBw":{"text":"After watching Chef Isaac on Top Chef, it was a treat to be able to dine at his restaurant","useful":0,"cool":0},"L3R8HNNh8dG6BIBzyUB1Fg":{"text":"The ambience gives for a note modern feel, with a very friendly staff. We ordered the meat","useful":0,"cool":0},"ERn9OGekFJuyTA6XdMCLgw":{"text":"Coming from out of town, we made sure to make a reservation far in advance. We were seated","useful":0,"cool":0},"6eCZ4x2oWpZJAreu9KUi1Q":{"text":"Brought friends and family here a few times and it always wins over our guests. The meat b","useful":0,"cool":0},"mBUh7Ye473iD89JrxU1vwQ":{"text":"We were visiting NOLA and our friends took us to Toups our first night. Wow! Really good f","useful":1,"cool":0},"R7-y2boUSXZhMKwxLLyUuw":{"text":"The experience could be described as \"there wasn't a bite that wasn't amazing.\" From the s","useful":0,"cool":0},"R01R4lnXNbRU6KngMnOj8Q":{"text":"Isaac Toups is a culinary God!  You must try the bone marrow with your complimentary whisk","useful":0,"cool":0},"LlWqolDAAlM6JCu0oDckUA":{"text":"The double cut pork chop is delicious. The dirty rice it's served on is scrumptious, espec","useful":0,"cool":0},"Sss-VWlfEYfq86m2CQdCJg":{"text":"We made this the first stop on our New Orleans trip because we saw the chef on Top Chef. A","useful":0,"cool":0},"NDt8Z4215-lRVolqKExKtA":{"text":"This place is always a treat.  The food is incredible, new, yet familiar.  Love coming her","useful":0,"cool":0},"Roaf9WOSljarWMZEgVJDOQ":{"text":"My husband and I decided to dine with you tonight after a very long hiatus.  I ordered the","useful":1,"cool":0},"-WmMq9auxkK_iFezbLUt0w":{"text":"this was excellente cept the chicken wasn't.  everything else was above and beyond.   char","useful":0,"cool":0},"unsCr9KojaFASwoeYEbxJw":{"text":"Veal Sweetbread Poutine 18$ // fried potato and sweetbreads smothered with gravy and chedd","useful":5,"cool":2},"-y228B_bzRRpM5clPwfRgg":{"text":"Followed this place on social media a while before I got to try it out. Telling you now.\n\n","useful":3,"cool":1},"avEmDOTO6l-S_SnC-exs7g":{"text":"Generous portions and fantastic meat. The meat board was amazing, especially all the pork ","useful":0,"cool":0},"mRllR6Iq-jY4HyDcbewrvQ":{"text":"Had the Special Steak for the Day  / 40oz Rib Eye, Delicious....\n\nSides-Cumber Salad, Corn","useful":1,"cool":1},"AJgzAP9QnfxxFLkDQBPfcg":{"text":"We went once a month ago.  We go back today not only do they remember us but they remember","useful":1,"cool":1},"jI3A4K74z6etQZjtE1w1aA":{"text":"Chef Issac, your food was wonderful as always but whoever you hired to run the front of th","useful":1,"cool":0},"tNnEVuCkLxDORjcrDgXm5Q":{"text":"Talk about a meat feast!!!\n\nA friend was in town and he suggested we eat here, he heard go","useful":4,"cool":3},"k-T3LXMn7AoXt_2SyIboMA":{"text":"Great food. Kind of hipsterish. If you like cured meats and lots of flavor then you'll lik","useful":0,"cool":0},"JslKSStyuWSquYr2DOr1wA":{"text":"So, to preface, I made a reservation on their website for 1.30PM. Came in early and it was","useful":1,"cool":1},"gYxV0RYqqKxMa7P4qVkiXw":{"text":"I hadn't been here a while. One of the guests at the the table had trouble finding any \"no","useful":0,"cool":0},"kEsy37rWAPhx2GM0rO0h5Q":{"text":"First time here. Place is ok. First off the floors are extremely slippery Donne careful of","useful":0,"cool":0},"GLxEiLRktw4_Z-Bx-K8iyA":{"text":"OK so dessert first! You must try the Debbie Does Doberge cake in the blueberry cheesecake","useful":0,"cool":0},"_bmSz5XfWSyd6kzpbIPhng":{"text":"My husband and I watched Top Chef this season and rooted for Isaac the whole way!  We knew","useful":0,"cool":0},"UrUr5Vt7rnuNJwgBwCmkhg":{"text":"Wow, what a horrible experience we had (full disclosure: we didn't try the food!) my boyfr","useful":0,"cool":0},"62sVyrVY451n_5uJMCWVEg":{"text":"Went by yesterday night, overall everything was good. We got a meat board, salad, pork cho","useful":0,"cool":1},"dC8S3aOzbFP8rh1FwSfXBA":{"text":"Amazing find! Extensive whiskey bar, gourmet entre's! we had the bbq goat, roasted quail, ","useful":1,"cool":1},"NdOay27mRGJfcjALqOU_zQ":{"text":"Ordered the Shrimp Boullettes and Fish and Chips from the Coolinary menu. The two boullett","useful":0,"cool":0},"F1I-19LQd2YCwMbpnD5I0g":{"text":"Holy good lord jesus mary of God. This place is ridiculous. the atmosphere, the food, the ","useful":0,"cool":0},"d2PS8Ch_v4qSN_Ph4uoReQ":{"text":"This place was a complete let-down. My drinks were under-poured (and the main ingredient w","useful":1,"cool":0},"cD-WmXOXaQ1ajmHmw4DsZg":{"text":"Came here based on previous reviews and we were not disappointed.    Boudin balls were gre","useful":1,"cool":0},"Yo0pU7OQMmLG0uPxcanPTw":{"text":"I had the wagyu beef, and it was a transcendent experience. Cooked to perfection, the wagy","useful":1,"cool":0},"l8NFhIMWwQFhGQe4pV-_sA":{"text":"Our new favorite restaurant in 'Nawlins...amazing how Uber opens up the city beyond the Fr","useful":0,"cool":0},"aLn0z0hv2NB6v-92gkOb1w":{"text":"I went here for my graduation lunch after reading so many rave reviews. I had a party of 1","useful":0,"cool":0},"qMA2WfpvhrGprsIeVZgzJA":{"text":"Awesome.\n\nThe meatery board is spot on.  All meats smoked and cured in house, house made s","useful":1,"cool":0},"qPOq6kccbgm9CQdAWFgJWQ":{"text":"Well it would have been nice to review it but my husband and I went Saturday at around 7:3","useful":0,"cool":0},"_GB7A3Y20TmEiKeqIu2dqg":{"text":"We sat at the bar with Pai. She knew the specials like she had studied hard. They had vega","useful":1,"cool":1},"-75428TG8pAjXcv9VQJ0mA":{"text":"Best burger I've ever eaten! Decently priced and service at lunch was great. Boudin balls ","useful":0,"cool":0},"dLgOKeJq5GNHbwQIGAe-SA":{"text":"I've been here at least half a dozen times. Always delicious! Friendly staff, accommodatin","useful":0,"cool":0},"Tgzva-1X7HSUqKStTdVXoQ":{"text":"It's very high priced fancy food and if you have the time to sit and have the time to make","useful":0,"cool":0},"Ioop8I48vOMSwz8oOyZWbQ":{"text":"Warning this review is not intended for children, vegans, vegetarians, or PETA people as a","useful":10,"cool":4},"dYvhYrrbKCWRbUMB5Y3kyQ":{"text":"Meat!  Every kind!  Service spectacular!  Great restaurant. \n\nFull plates were really big ","useful":2,"cool":1},"jysq0atUhhqwPjTGpRXp6g":{"text":"Went there for the first time recently and I was very upset. Upset that I didn't go sooner","useful":0,"cool":0},"L7ObnprWQYpe0obIS1Imeg":{"text":"Watched Chef Isaac on Top Chef and cheered him on - he and his staff (especially the barte","useful":0,"cool":0},"6dM1ioon0o8BEPZk6_aVJQ":{"text":"I recently dined here midweek with my husband. We had reservations (I'm not sure they were","useful":0,"cool":0},"91FiJSJARLZZ4ARADyRZqg":{"text":"Menu looked good and high end. Just not what we wanted. Only had a salad and cocktails. Me","useful":0,"cool":0},"KxsUyZaeVgBZLIrFLkKcRQ":{"text":"Unique, neighborhood eatery.  If we lived in NOLA, it would definitely be a regular stop f","useful":0,"cool":0},"LZ15H6Rpbj92cUYKZg8EKA":{"text":"Forget Arby's, Toups has the meats! I could have died happy with just the cracklin's, but ","useful":0,"cool":0},"NtQQfcBdbFEogk3a3eWnlA":{"text":"I hate being the jerk who writes the first non-five star review but I am sure this will bu","useful":8,"cool":2},"83N8HQ-m9Bije81O147igg":{"text":"My sister & brother-in-law have been telling me to go dine at Toups for the past 2 years, ","useful":2,"cool":2},"Sei6_5bWkuYnDvmiXXP70Q":{"text":"Fantastic, waiter was extremely friendly and knowledgeable of both wine list and menu. Foo","useful":1,"cool":0},"StIijWxIhNHHF4n2smOxpA":{"text":"We live in Baton Rouge, so we like to try new places in New Orleans when we can, and we've","useful":1,"cool":0},"c-Gxzi1g9X0l5Diw6zvYBQ":{"text":"Excellent dinner last night.  The charcuterie is amazing!  Great service, was wonderful to","useful":0,"cool":0},"IUvGmbb2T9CoT3EE2E1eeQ":{"text":"All my life, I've been told how important first impressions are. Unfortunately the host of","useful":2,"cool":1},"cdFIY-OgK8mgMOu4oj03Fg":{"text":"A Must Try! We dinned at Toups on a Thursday night. We sat on the patio and enjoyed the wa","useful":0,"cool":0},"O_Q2G7WOS452F1qO5mtblA":{"text":"The view is nice, the seating is romantic yet inviting, the bar is beautiful, and the burg","useful":2,"cool":1},"LLjQtEuh-Kf4R0sgCx1F3Q":{"text":"Toups is delicious. I haven't tried too much from the entree menu, but have gotten the mea","useful":0,"cool":0},"y1yxkZnLsjZ7ha8CrWIa6g":{"text":"Four star meal, One star atmosphere.\n\nI'm in Toup's neighborhood, and have tried to be a r","useful":3,"cool":0},"8faQxEu6eFIkWVO8nvyisQ":{"text":"4 star food - 2 star service.\n\nMeatery board was very good. The cocktails were meh. And th","useful":0,"cool":0},"oDLm8u_YV-HTd3mgLvP7qQ":{"text":"Poor service for us. Inedible burger that sat waiting to be picked up so long the waitress","useful":1,"cool":0},"HgzN-WglgsVT9mikhITYyw":{"text":"I just had a drink and an appetizer here with a friend but both were excellent. I had the ","useful":2,"cool":1},"aIv5dpkZrPMZgCWSlYNe_A":{"text":"We loved this place. The cocktails were good. The beer selection was good, the wine select","useful":0,"cool":0},"RHmSUynQJ11IxXU_y1mF1A":{"text":"Great food! I loved this restaurant so much I would recommend it to anyone. It was my firs","useful":0,"cool":0},"TN1IXkCA4q5TrwGERJooQA":{"text":"Seriously delicious! Four of us had dinner while in New Orleans and loved everything we ha","useful":0,"cool":0},"NEGoLKYdaCFlOyBU2Kqqow":{"text":"Food was amazing.  However,  when we were seated our waitress told us that since it was Ja","useful":0,"cool":0},"xELECdJhtR7XCgwhA0Q-iA":{"text":"Toups was tremendous! We went on a Saturday night and had a fantastic meal. The Toups Manh","useful":0,"cool":0},"6sGJBGNMyx6XXrnlL89-3A":{"text":"Excellent food and service. I recommend the crackling appetizer, bone marrow appetizer, BB","useful":1,"cool":0},"OeBKW6KRJIIuEdWEyyPsag":{"text":"The flavors were amazing. All of the dishes were packed full of flavor. Only critique woul","useful":0,"cool":0},"A2pJwiK61pdkrdbF2GL0Cg":{"text":"I am mixed about this place. I have had amazing Cracklings here and underwhelming Cheese T","useful":1,"cool":0},"X6wzG_wdACZiAm1EyJd_IQ":{"text":"Come hungry--leave happy. This is seriously one of the best meals I've had.  The pork chop","useful":0,"cool":0},"Jdz9C54TKa8O4bzxxWzzIw":{"text":"Okay, this review is not about food. I didn't eat here. It's about rude staff. We knew lit","useful":0,"cool":0},"9S6X-3lN2O-Pt3HYsOD2VA":{"text":"Meat forward menu that won't disappoint. Personally, I love ordering a glass of wine and w","useful":0,"cool":0},"978LtoJOzmgbSuBvKUo4BA":{"text":"Incredible.  I went for lunch and had the burger while my friends split the meat board.  A","useful":2,"cool":1},"Ur_d1kNwuxkSGi_HSTXruQ":{"text":"We enjoyed the plethora of meats. While the meats were certainly the highlight, I'm not su","useful":1,"cool":0},"Un0YG_oExw18xeHRGZVUlg":{"text":"Visited here with my husband post flight from California. We had no wait as we reserved a ","useful":0,"cool":0},"OLmQe24nWpQ0G8JlZbhh1w":{"text":"The meatery board is always my favorite here.  I find it's a great place for small plates ","useful":1,"cool":2},"ndDl_9yJ9dvy-tW71R9dgg":{"text":"Arrived on a Saturday night without a reservation. The place was busy but they managed to ","useful":0,"cool":0},"VOgZutpSTurxlqZSJnGyuw":{"text":"Went for Restaurant week, for the coolinary menu. The corn fritters were delicious and the","useful":0,"cool":0},"9F8C4hvULwMsYxLgoA-MfQ":{"text":"We visited once shortly after opening.\n\nBackground:  \"Toups\" (\"Dubs\" in German) is a bona-","useful":1,"cool":0},"Uf1PAAw-Fa3b3_lq12B6-Q":{"text":"Walking into the door of Toups Meatery you might not know what to expect. I certainly didn","useful":0,"cool":0},"4oS-1cI_azWfWeDvDfOwOg":{"text":"Toups has one of the best meat boards I've ever had! It is a delicious appetizer, or a gre","useful":0,"cool":0},"kDZSmBoUPqOXEPu7xk_zkA":{"text":"Went for lunch and got seats for my table outside. It was such a beautiful day. Why stay i","useful":1,"cool":0},"0ogaXL18_rEacEDg0pv05Q":{"text":"Went in for lunch and waited 45 minutes for my food! Once my food arrived the burger was c","useful":0,"cool":0},"Gu7cGpihrysp2O8t1w55KA":{"text":"Blown away by the amazing food! Of course that doesn't go without saying the service was e","useful":0,"cool":0},"3ER9mEpnfumxFQKHpvm79A":{"text":"Really great find in mid city with not that many high quality restraraunts in the area. Go","useful":0,"cool":0},"u5bbwR8N3Dn6mcKaDwfORg":{"text":"I had been wanting to try Toups for some time and was very excited to pay them a visit.\n\nK","useful":3,"cool":0},"WwzxslMRBLFfmTBm8E4teQ":{"text":"Really not our restaurant in any way, shape, or form.  We tried it a couple times two year","useful":0,"cool":0},"ex1A1XOecaYUZuVBtRr1NQ":{"text":"This place is the bee's knees. The cat's pajamas. But seriously, toups should be in the di","useful":1,"cool":0},"A9ckQ6IXWtHuAfa5pB2rDA":{"text":"we 'live' down the street from toups whenever we stay at our friend's place during the jaz","useful":0,"cool":0},"hVN9sJ0h4Do-Y9HB84yUxQ":{"text":"Great find. We were a group of five. They have a nice patio upfront with gas heaters for t","useful":0,"cool":0},"FSMsOklaFjvxRhwf6Fqm8Q":{"text":"We were in NOLA for two days to celebrate the hubbo's birthday and he chose Toup's for his","useful":1,"cool":1},"cej3FB0Gbw00DLtGd-zvlQ":{"text":"We stumbled into a table at Toups after yelping nearby restaurants from the mini-putt cour","useful":0,"cool":0},"fphDj8BIAdod3_KHQEGHkA":{"text":"Great food, cool atmosphere, fun staff. I totally recommend everyone go.\n\nHad my birthday ","useful":0,"cool":0},"zyV5XBKwxP_qLxWdsALLDQ":{"text":"Wow eeee wow wow... As the great Christopher Walken would say. Absolutely incredible from ","useful":0,"cool":0},"zI4SKDYq60BvSemIWYnxqg":{"text":"Casual place serving truly elevated food. Not a weak moment-- every dish from start to des","useful":1,"cool":0},"a3yVQSPoxtH7XJB2J5rQMw":{"text":"My friend and I decided we needed a yummy cheese board and nice glass of wine, so Toup's w","useful":1,"cool":0},"V9BQEoJgt3Bux7XcOb8_rw":{"text":"Great place for lunch. Start with a Dr Rouge to drink which was very smooth.  Had the meat","useful":1,"cool":0},"rB-g91PTj6d2RnUF_9H1yA":{"text":"I would have given this place 5 stars had it not been for my server. She appeared to have ","useful":1,"cool":0},"X2wGOByerGS8h6YIPQDtmw":{"text":"We had dinner during peak dinner hour of a Saturday night and it was nothing short of exce","useful":0,"cool":0},"aaGJ1LQIxukVwHsZhAdnOQ":{"text":"Disappointing! So sad...haven't been here in 2 years. Our table was one of the first in th","useful":0,"cool":0},"Qlnv-swtGRTrdlYbxfkaSw":{"text":"I went on the recommendation of a friend - and won't take that friend's recommendation any","useful":0,"cool":0},"BYNyHLgJlYx0vkOaUctT0A":{"text":"Got the meat board... Yummy. The house made sausage was flavorful and juicy. The cracklin ","useful":1,"cool":0},"2Xd0cXK0sCmStRkPGSaWuw":{"text":"Great dinner. Best cracklings ever. This place gives you the meat sweats in the best way. ","useful":0,"cool":0},"zFn1tW721JausxZ134GqUw":{"text":"Had a smorgasbord of meat from all parts of the animal...all some of the best cuts I've ea","useful":0,"cool":0},"kiyjHaIJILL5Sdajx70j4w":{"text":"Much better than the garbage served at the French Quarter. Expensive? Yes, a bit expensive","useful":1,"cool":1},"Bryc6m4Ltu1Wbb5byxynBw":{"text":"Wow, what a meal! We visited NOLA during December and this was one of the first restaurant","useful":1,"cool":0},"ZQO9gmMG5epiaPKpnR_pKA":{"text":"I wrote a mediocre review a few months after they first opened, but now my tune has change","useful":0,"cool":0},"tpxskqEB0Ns-hfIAUuxGMA":{"text":"Food was unbelievable.  One of the best meals I have ever had.  However, we (8 of us) foun","useful":0,"cool":0},"Bum55hxAzKqXsnE8gtNjvg":{"text":"I'm still unsure about the culture that we've built around celebrity chefs.  I'm still a l","useful":3,"cool":4},"PtykgHoKn7mhEAV69KebDQ":{"text":"After seeing Chef Isaac on Top Chef my wife and I were determined to visit his restaurant.","useful":5,"cool":3},"klvTvoxGQMaw6HuMsCrmhg":{"text":"Amazing food amazing atmosphere and amazing service. Food always tasty and delicious.","useful":2,"cool":1},"xOQK_no-QPGpuUiTXTCwPQ":{"text":"We went for dinner the other night because we love meat, and we wanted to see what all of ","useful":0,"cool":0},"7tPMEi5XIfGK9BP3DvsKKQ":{"text":"I feel bad leaving negative comments, but I was not impressed at all, and it sucks because","useful":1,"cool":0},"CBEqrOsycOuUFfzXW0S_BA":{"text":"MEAT!\nNo, seriously, they have it in every form. From lamb cheek, to ox tail no part of th","useful":2,"cool":1},"b10wkPPGYt0kBKIacgGEwQ":{"text":"Came here for lunch on the recommendation of a friend. The food was really good, but I cou","useful":1,"cool":0},"ooAeZcdAngHngOX46iBiUQ":{"text":"I had such high hopes for this place after rooting for Toups in top chef and reading the r","useful":0,"cool":0},"BfS39lTaUB0xYODFhZu_6A":{"text":"This was the place we were most excited about trying on our trip back home to New Orleans.","useful":0,"cool":0},"boWSpmRS8cpov7jvfvTEYA":{"text":"One of the best restaurants in New Orleans. I'd recommend this place to anyone. I was conc","useful":0,"cool":0},"vPXJbDhIXpT9V0S7n-yH_Q":{"text":"Our hotel was in the CBD, so Toups was an under $10 Uber ride which was excellent. Our dri","useful":0,"cool":0},"_O0m-Edk_vJV_NWNfoJv9g":{"text":"WORST SERVICE EVER!!!! We came on Wednesday prior to Jazz Fest and waited 90 minutes for o","useful":0,"cool":0},"8ut38WW7i3uPN98mfpf8ZA":{"text":"Nice intimate atmosphere! Pimm's  cup was delicious and I tried the Pork Chop. Highly reco","useful":0,"cool":0},"ig3Gej_FDI8DeLfph5rjPg":{"text":"One of our favorites when I want something a little nicer but still fairly casual. The dec","useful":0,"cool":0},"ihpYJTFB5RIbcAqudTKeHw":{"text":"Awesome place!!! Food is outstanding. Servers are very knowledgeable about the food they b","useful":1,"cool":0},"hAs1H-wiQBqZ8jPb2arOaQ":{"text":"The food was amazing! We had the meatery plate and deviled eggs to start. We couldn't get ","useful":2,"cool":1},"JgXk2xM1LHQwUfle402XxA":{"text":"Holy crap, this meal was delightful. Everything was delicious, from the cocktails, to the ","useful":1,"cool":1},"qjrV5X8CCbh0QhyWZ-a73w":{"text":"So I had very high hopes for this place but I was so let down. \n\nI ordered a to-go lunch o","useful":0,"cool":0},"E7jLC1G52xzSu4H2-n16CQ":{"text":"Been meaning to write this for some time,since May actually.  Went on a Tuesday evening.  ","useful":0,"cool":2},"TnpPX5MLcBNp4pgXk6pp7g":{"text":"This place exceeded my expectations, went with a group of 8 people, and had one of the bes","useful":0,"cool":0},"394GlQbLBCABtXPqWcXwJg":{"text":"I'm late in posting but we went to Toups over Jazz Fest and again the night before Father'","useful":1,"cool":0},"xD-nOXqDlVZ9dDvWvffn_A":{"text":"Whoa. This place. Saw the Chef on that tv show and couldn't wait to try. Next to Commander","useful":1,"cool":0},"FsJPt7VUG2bT81VqCF2uQA":{"text":"We stumbled upon this restaurant after going to the lights at the Park and LOVED IT. I got","useful":0,"cool":0},"vhrcwrd9VunXYAdH-1uvaA":{"text":"So many meats, all so awesome. Started off with cracklins, can't go wrong there. Enjoyed t","useful":0,"cool":0},"v0S_0JnoiRtCPwvTVXCMFA":{"text":"My excitement for this place may have made my expectations unattainable- however, I think ","useful":0,"cool":0},"Hbr1qGj0qfO46mFezCLoKg":{"text":"Awful!  Food service slow and food was terribly salty.  From New York City came because ch","useful":0,"cool":0},"qKDXNkEi8UVTX8JKZxz5AA":{"text":"Before I start, I came here specifically for the Double Cut pork chop. A friend raved abou","useful":1,"cool":1},"VfLw3J3ikOYIPrIKVmD9jw":{"text":"A real stunner. I may have found my new home. Conveniently located, moderately priced, amb","useful":4,"cool":0},"glOMQuQx83iylkckWyAXMg":{"text":"We arrived at Toups as soon as they opened for dinner service. The cheery host informed us","useful":1,"cool":1},"R2YX8jD7xHMoMNmON4Ptdg":{"text":"Have been waiting to try toups for awhile now, and my dad is a big fan of Top Chef, so whe","useful":2,"cool":0},"EEqIPlbwbXlf0IHJtEcDBQ":{"text":"Holy fuck this place is amazing. Nuff said","useful":2,"cool":0},"3IGUX5WRe4MBnaaWK1DD8A":{"text":"Friends and I got the meat and cheese plates and a decent bottle of wine. We also had the ","useful":2,"cool":1},"kLYPZCVNC9ycXDYAa5szIw":{"text":"Positives first. Excellent Meatery Board and good diversity of charcuterie offerings.\n\nNeg","useful":1,"cool":1},"RvApxNqFvVxk1ZCzNjknXA":{"text":"Extraordinary food and service. The meat platter is the best if it's kind, anywhere. The c","useful":0,"cool":0},"2auor3aAqrO5EDQzDh5eIw":{"text":"I don't know if it's Chef Toups' skill or just that New Orleans has a much higher expectat","useful":0,"cool":3},"FqQuUJeJx_a1DU98apR4mg":{"text":"Would never go back. Waitress was stoned/drunk or both. We took some out of town guests fo","useful":1,"cool":0},"C7frN1HPCT7TbHEwXwk2fw":{"text":"Overall the food was decent but, the drunken shrimp was horrid: I was drunken and couldn't","useful":2,"cool":0},"Wo3cQ0JS4csD1ZbR9mkCNg":{"text":"What a great eating experience--stuffing face with the most amazing meats-- smoked, cured ","useful":0,"cool":1},"M_tA06NV39uAbUSirxTqxQ":{"text":"The food was subpar. Our mussels were on the verge of bad, which we notified our waitress ","useful":0,"cool":0},"Mvev10JvpCSpUkJcjFYJeg":{"text":"We had a wonderful dinner at Toup's last night!  We had the meat board and I was really ex","useful":0,"cool":0},"WsWXss-vCNRVXyn4eChtPQ":{"text":"I dined here with my best friend. We waited at the bar for a few minutes before our 8pm re","useful":0,"cool":0},"Wr1XX9kCR3DY8H1UtLMbZg":{"text":"Great food. Slow and not so great service. \nMeats were very good. I had the pork belly let","useful":0,"cool":0},"y1_ALsnMVBQ8buIbWtgYmw":{"text":"Everything to eat at this place is pretty amazing! The meat board is a must. You get to tr","useful":0,"cool":0},"onQs1lcWQD-XhR_sCe7cog":{"text":"Loved it!!\n We were in town for a family wedding but knew we wanted to seek in a visit to ","useful":0,"cool":0},"8UB48e-JeU2zypH3JcmymA":{"text":"I couldn't wait to write this review so here I am, sitting in the restaurant.  If you thin","useful":2,"cool":2},"J4aA33DvI_z8G_uEObEaqA":{"text":"A terrible experience both in the restaurant and online. Went to lunch with a friend and o","useful":0,"cool":0},"98GPppWVgziyI_kbnIa8ng":{"text":"Solid food, and the meatery plate was excellent.  Mains were hit or miss and several inclu","useful":0,"cool":0},"cV9ifRwmObkdmfz_9uCbAA":{"text":"We ate here back in October. I husband ordered the double pork chop. I ordered the meat pl","useful":0,"cool":0},"2b7lg7OoX54ghXFfuXzsmA":{"text":"1. Pickled plate\n2. Fried chicken sandwich- very thin piece of chicken; flavor was good bu","useful":2,"cool":0},"CYCl9H1R6z-GKyp_YOgx4Q":{"text":"Hmm...the girl who doesn't eat meat is going to all the meaty places.  There were choices ","useful":8,"cool":3},"tRXiWcV2qia_8n2ZAJ3XZw":{"text":"I wish I could give this place 10 stars.  Great cocktails, service and the food was incred","useful":0,"cool":0},"wgAfdMsYzuAk-L5SXBvTXA":{"text":"Toups NO Meat Eatery. Arrived at 6:15pm for a 6:30 reservation from Open Table. Immediatel","useful":2,"cool":0},"sk-fjWUsTUmDOzvvIOagaQ":{"text":"Very impressive service. You could tell wait staff worked as a team. They helped each othe","useful":0,"cool":0},"O55xtv9i2GODic_5awL61g":{"text":"Had the most delicious dinner here our last night in New Orleans. My boyfriend and I love ","useful":0,"cool":0},"eoAr1p8OPwY4B_Ni7OZn7A":{"text":"Great food. Awesome service. I would definitely return when I come back to New Orleans. I ","useful":0,"cool":0},"9iWHMSBrbumHGRXy6p2Fog":{"text":"The service is terrible. The food was phenomenal for this being the first time I've been h","useful":0,"cool":0},"OgN-QgsuAcyRyoL3zXMtvQ":{"text":"I used to go to Toups at least once a week about a year ago. My two favorite sandwiches we","useful":0,"cool":0},"v_y701WUde4XsVmrAjPU7Q":{"text":"Unbelievable dining experience. To start the cocktails were executed flawlessly. They even","useful":1,"cool":0},"ONWLresiRYisvpigFfzGvw":{"text":"Had a relaxing evening at Toups. Craft cocktails were at hit, as was the meat board and ve","useful":2,"cool":0},"6n_59RzS1-n0zVHO-K1tkg":{"text":"Please don't mistake my Four star for dislike - just something seemed off about service.  ","useful":0,"cool":0},"9EdeJp1zKXr2a8rgoCzAow":{"text":"Great food, even better service. We asked a bunch of questions of our waiter and he couldn","useful":0,"cool":0},"y-nRd7VhWTSZzQ77xmXXZw":{"text":"This restaurant has been on my \"must go\" list for quite awhile now, so when we travelled t","useful":0,"cool":0},"8WMAyfBQuqI2yNBCzRH_AQ":{"text":"Great experience, enjoyed outside dining on the avenue, talented and helpful staff. Smoked","useful":1,"cool":1},"lYphF1QfAkpQhpr36o56_w":{"text":"Lovely little spot.  Nice unusual deviled eggs (horseradish within, cracklins & mild pickl","useful":0,"cool":0},"OilTedBO7Mojjm6-cFhDNw":{"text":"Ambiance was cool. Chef Issac even came around to all the tables to say hello and snap a p","useful":2,"cool":0},"cdNmw9J0K8YMvl9W6hNWFQ":{"text":"Alrighty back again for the 3rd time '12, ''13 & now '16! This is always on our bucket lis","useful":0,"cool":0},"Jt7oJnbOPp8jEfG5-RR8sw":{"text":"I'm happy Toups has many good reviews. Wish I could give one too.  We have tried this plac","useful":1,"cool":0},"-Rb_KjFwRL0nTbsEAPXCjg":{"text":"The food was amazing . We shared boudin balls, some of the best I've ever had, then we sha","useful":0,"cool":0},"QcBdlaPpQ4yrQ92mGUVrQA":{"text":"Amazing service & delicious food (probably the BEST service in New Orleans)! Got to see Is","useful":2,"cool":1},"h7XW-4HQ1PASNBD_utsR6g":{"text":"Nice atmosphere. Bartender seemed as if he didn't want to work today. Food was overall goo","useful":0,"cool":0},"kw53nQYEl5dc18KwQXPI7A":{"text":"So one of the BEST meals of my life honestly. The bone marrow is to DIE for! And it comes ","useful":0,"cool":0},"eUoCtHmsmd8xhG0vgZ4WDA":{"text":"Let me say first and foremost nothing about this place was memorable except that it was un","useful":4,"cool":0},"-0vR8ZUOSVgpVYtDKFvV_w":{"text":"I had a great time at Toups. I got the braised lamb neck. It is served on blackeyed peas a","useful":0,"cool":0},"nwbIS_eH_Zt8Nf76fo26gw":{"text":"The lamb neck changed my life, the black eyed peas almost made me want to call off my marr","useful":1,"cool":1},"YNxB7Id9-q7bw672c3ufwg":{"text":"We had a lovely meal here and were happy to be a group of four so that we could share so m","useful":2,"cool":1},"VGPGQTfTfR5d9Ry3f5CW4Q":{"text":"I wish there was a way to give 0 stars. Our server was not inviting with our party but yet","useful":0,"cool":0},"snWERh0KOhk9dWcjhrv_-A":{"text":"I had the Gulf Fish and my husband had the confit chicken. We also had deviled eggs and cr","useful":1,"cool":0},"2iNL45kdVaqbj15VqM5VLg":{"text":"The much-anticipated Toups was not nearly what I was hoping for. \n\nOn my second trip to To","useful":3,"cool":0},"UgdtU8s5UGjLQVng5m2ZzQ":{"text":"Went here for lunch on a Saturday afternoon after seeing Chef Toups on Top Chef.  All of t","useful":5,"cool":4},"BMVk68PQCLDcNefPiUaLEw":{"text":"What unbelievable food. We had the cheese plate the meat plate the deviled eggs and the sp","useful":0,"cool":0},"_H1Vkh5L95aGo2e0Cxs8BA":{"text":"I've been to Toups a few times and liked it each time. I like the small plate versus big p","useful":0,"cool":0},"wuN2PLlaZMBXLkNDOrdpLQ":{"text":"I don't particularly care for meat and would never suggest a steakhouse for dinner.  That ","useful":1,"cool":1},"UxhC6_zweLKJoZNoBCBe6g":{"text":"This place is off the chart! Some of the best food I've ever had. They really know what th","useful":0,"cool":0},"NkQsCJtUYGb7832tDy1Qxw":{"text":"My coworker and I went here for lunch and ordered a small plate, an a la carte item, and t","useful":4,"cool":0},"En97l1DvE1q_j8rN_Tef_g":{"text":"I really enjoyed Toup's on my recent visit to the my favorite home away from home. Had lot","useful":2,"cool":1},"6IBlyGtnufR2LXZ9iKosrA":{"text":"One star one star one star . Is this place has a cheff , if so Isn't he check the  food qu","useful":0,"cool":0},"Y3x9Z4kPv7laxnA4er6ZnA":{"text":"Have come here twice with work on a Thursday night. Food was very good, but both times we ","useful":1,"cool":1},"6ktcZNRffgjgT4P29Zs-IA":{"text":"Visited last night after hearing excellent things. I'm a big meat eater and so is my roomm","useful":0,"cool":1},"mpA_3CYR_OQkolHoYEirOw":{"text":"Came here for lunch with my wife and we really enjoyed ourselves!! This is a very laid bac","useful":3,"cool":0},"DCbfCLFt_GIFKJ4s-oSTsw":{"text":"Not really a typical Cajun/Creole Restaurant that I was hoping it would be. Came here on a","useful":1,"cool":0},"LCIKKRnh3m_5YborXxoZDg":{"text":"Without going into too much detail about the fact that I pretty much don't eat any form of","useful":5,"cool":4},"ffDx7Iziil0-o-gQTrJFaA":{"text":"Wow. All I can say is this neighborhood spot is a gem. Obviously the place is only for tho","useful":3,"cool":2},"dlV4t3cy7X9d8hVHgy2-Qg":{"text":"Great food, service and ambiance.  This is a great local restaurant outside the touristy N","useful":0,"cool":0},"iqRhLAmHR50VvkuhK1DiyA":{"text":"Every restaurant in New Orleans serving a charcuterie board should stop and take notes fro","useful":0,"cool":1},"9vqBzefvcoVvxr1hqdQPMA":{"text":"I have just finished my first and, most likely, last meal at Toup's.  The service was adeq","useful":0,"cool":0},"TgoGyDjhpLWbTmRi1Gcs5w":{"text":"It had it good moments like the drinks...service poor...I DONT LIKE TO WAIT FOR MY DAMN FO","useful":0,"cool":0},"EO3DJI8gPhJ25fPn-16d5Q":{"text":"With friends in NOLA for a conference, and made a reservation here.  I want to qualify tha","useful":2,"cool":1},"ULYWsIx_TlDMU2nd7OHOyA":{"text":"The pork crackling were amazing!the seasoning on them were to die for. The special was the","useful":0,"cool":0},"0LOHShJwp7poisHO6gcNig":{"text":"Everyone working here is super nice. I stopped for an early dinner on a Saturday and even ","useful":0,"cool":0},"wzZ4UL9USVP-s-lkM33xqA":{"text":"Our experience with this place was not great. The food was average at best, and was very o","useful":0,"cool":0},"xjq0KrlbZneG-5i1n8yW6w":{"text":"Love love love this place there charcuterie board is the best in New Orleans!! I used to t","useful":0,"cool":0},"Ldyd4J1ZxdcXwo8yxzDhOA":{"text":"Run don't walk to this unique NOLA off the beaten path restaurant that's part pickled deli","useful":0,"cool":0},"tcJ7tIkgphqGGLEvMRtopw":{"text":"Such a fun place to go for a date night or a celebratory dinner! l had some relatives in t","useful":0,"cool":0},"Nfp6MmSWFJ4-cyL22SE8dg":{"text":"Great place, been there for both lunch and dinner and both were great.  A good, varied men","useful":0,"cool":0},"TBL0vzskHC9oigF1J3HHsw":{"text":"Had a great lunch here, got boudin and a burger that was very good. Beside my meal they of","useful":1,"cool":1},"4JNtA9bqjP4rbfqusojCXQ":{"text":"A unique dining experience at Toups. When asked about why this place stands out, our very ","useful":1,"cool":1},"6q4ATb-B7WwUVH07uVuRww":{"text":"Fantastic meal. We had the cracklins, bbq goat and bone marrow. The bone marrow whiskey sh","useful":0,"cool":0},"UkWzI_zTdXCHHF_bAOgEXw":{"text":"What can I say. Amazing. Delicious. Savory. Mouth watering. Mind blowing. Not a place for ","useful":0,"cool":0},"kr1X4nljRz6Pa1GUc2yPTg":{"text":"I am hooked!!  The meat board is hands down my fave. The drinks are well done, staff is fr","useful":1,"cool":0},"hZyocGbBCVmdxMyOzOUyAw":{"text":"Yes, do yourself a favor and visit this joint.  You may not have a clue what you ordered, ","useful":0,"cool":0},"UeFPV0qZNX36AmLg7L3E5Q":{"text":"After watching the head chef on Top Chef, my friends and I HAD to try Toups Meatery. \n\nThe","useful":0,"cool":0},"RZRzPa3lEjytpg4e3yRJHg":{"text":"where do you start - how about Lambs Neck, so tender suculent and wonderful, the roast duc","useful":0,"cool":0},"6f6YgwsvfhY0pOcW000Mqw":{"text":"Husband loved the meat plate!! And Christene was incredible!  We'll be back to Toup's Meat","useful":0,"cool":0},"nmhBiOlRyl3zg9hnXUzkvw":{"text":"Amazing. The cracklins are like crack pork candy and a hangover cure. I came back two days","useful":1,"cool":2},"gOSaMpbJ_VjdzSxfJOqgwQ":{"text":"I would say this place is a 4/4.5. Definitely a MUST try!!! The food is incredible. I thin","useful":1,"cool":0},"A_4s9kRhjPLuFQi0iJ2M0Q":{"text":"Visited Toups on Thursday for lunch. The server was friendly, helpful and cheery. Such an ","useful":0,"cool":0},"x7HCTDYyxIn78Z4e4_asyA":{"text":"I do not understand how they can charge so much. The service was not good (our snobby wait","useful":0,"cool":0},"Wv_aS0WHX-eZTmPlLBNXSg":{"text":"An absolutely amazing experience!  Don't deprive yourself the chance to check this restaur","useful":1,"cool":0},"Uz_IhH_rpjzZQzCK2IKNRg":{"text":"Phenomenal food. The lamb neck was amazing. The park chop feed 3. The bacon cayenne foberg","useful":0,"cool":0},"ReJAh0i31M0Jg0Aboa7qSw":{"text":"I celebrated my tax refund here and it was a food celebration. I ordered a chicken sandwic","useful":0,"cool":0},"3AxQPdmoiL-9mpeg_iLCaA":{"text":"All I have to say is Chicken liver mousse.    This place is amazing and not overly priced.","useful":1,"cool":0},"VyrJY6NU1Sc42H2RVgwWgA":{"text":"This place was great!!! The food was amazing, my tastebuds will be longing for the next no","useful":0,"cool":0},"A8_7ZM9H35W_ENk7O1aROQ":{"text":"I had dinner this evening at Toups, and we really enjoyed the experience! The meatery boar","useful":0,"cool":0},"e3UuQlRQhEbRjGl0Qrx4vg":{"text":"Very excited by the fresh new dishes offered by this incredible chef. Enjoyed a beautiful ","useful":1,"cool":0},"ypt9LFEjd7GwROUw1U0czg":{"text":"One of my favorite restaurants in New Orleans. Very good food, love the cracklins and rill","useful":0,"cool":0},"fi3ejiWM6SUy6IcMuHMxMw":{"text":"Came in for lunch at the bar top. I ordered the chicken sandwich and it tasted like it was","useful":2,"cool":1},"Q4J2Gq6FR3neee3q-8JvOA":{"text":"When we stumbled upon this place, we though that it had \"Cochon\" written all-over it.  We ","useful":0,"cool":0},"WQturibmH1vwnL9kz_CndQ":{"text":"finally got over to Toups... and im glad they are in the hood. \n\n4 of us walked in a littl","useful":0,"cool":0},"FFi22VPEuPc5aaABY45zew":{"text":"Had a New Years Day late lunch here with my sweetie. And I can't wait to come back. Excell","useful":0,"cool":0},"zQdaSpohH-V-MdWOZCRF1w":{"text":"When in town...Toup's again. Man we love this place.  I was gladly greated by the manager ","useful":0,"cool":0},"Jw54c5UdflnsMOqJPUDjkA":{"text":"One word to describe this dining experience... AWESOME!  From the wait staff, so the barte","useful":1,"cool":0},"5be5kllzxixtaJJlqhnXRA":{"text":"Was taken here for lunch by a friend that works at the New Orleans Museum of Art as a good","useful":0,"cool":0},"_nyXOJrYiUdmKoZM76lNqQ":{"text":"What can you say about Toups Meatery? Well let's start at the top! Chef has created a menu","useful":0,"cool":0},"bdBt0i2HLRrT2-2iRBmZmw":{"text":"We just went to for their dessert and cocktails so can't comment on their food menu but it","useful":1,"cool":0},"QQyz3t4r3lp7PAf6rVIcWg":{"text":"The service made the meal. My wife has gluten and dairy allergies, and the staff was incre","useful":0,"cool":0},"EeGcC1RLkHMuu9slWlwXIA":{"text":"So, this is not a fast food place, but having forgotten that a double pork chop takes a bi","useful":3,"cool":1},"zvO35LU4KczXbRPTfO8NaA":{"text":"I went to this restaurant last night for the first time. It was absolutely phenomenal from","useful":1,"cool":0},"0epzpdT2l8rJF1OaBd1hrw":{"text":"Toups was another restaurant that was on my list and we finally made it this weekend. It w","useful":0,"cool":0},"cHvoAYcOnIO3_AEC_7VBkA":{"text":"Fantastic food! Fine dining without the hoop-la of white tablecloths and a thousand waiter","useful":4,"cool":2},"6J5vHH1ZtGVCU7-CGRQQUQ":{"text":"This is my \"go to\" place. Great atmosphere and energy and of course, it's in Mid City. Ext","useful":0,"cool":0},"MALX6Uat6bY_CaOYBxJp6Q":{"text":"Had a lovely meal.  Food was delicious & thoughtful, very friendly service.  Would've give","useful":0,"cool":0},"wHrh9tI67zRfET0GgMASlQ":{"text":"I've heard of this place for years and have always wanted to try it since I've heard great","useful":1,"cool":0},"49TO-Du09HDqm3sFvwkVbw":{"text":"Heed the warnings of others. You may get sick after eating here. For the same reason that ","useful":1,"cool":1},"200XadRmcWD03mO-J7uxYA":{"text":"First off: I'm not an alternative meat cut lover.  What I mean by that is, I like the conv","useful":0,"cool":0},"wN8l11fT6I6E8XE6hf40xw":{"text":"Absolutely delicious. I've been waiting for this place to open, and it was a delight to be","useful":4,"cool":0},"hRBgMJY2eOIO40jHLRqCtQ":{"text":"Very good place, no frills just damn good food. The meat board was great and enough food f","useful":0,"cool":0},"RJbdPcAtwxIUlKltZma15Q":{"text":"Outstanding food in a casual, unique space.  Okay, it could have been designed better but ","useful":1,"cool":0},"kWc4EinASDtKEaojSlUnqg":{"text":"Great time tonight. Loved the laid back atmosphere and the food was amazing. Actually ran ","useful":0,"cool":0},"mH0IGdoNjJJv2SV71QHvYQ":{"text":"I ordered the Double Cut Pork Chop, pork was cooked perfectly. Flavor was excellent, meat ","useful":0,"cool":0},"wxt4g-UqBTVmh-2362GYwg":{"text":"Delightful food here, thoughtfully prepared and presented.  The cocktails were also creati","useful":0,"cool":0},"fqDYtlNBoPb4R4kwfuSheA":{"text":"Worst service at any restaurant visited in New Orleans. Will never go back and will never ","useful":1,"cool":0},"gY55IfJo5Mwu9FQ25_CriA":{"text":"Very cool spot with great/ interesting food choices. Everything on menu is tasty but the c","useful":0,"cool":1},"Q4aTPPLj7nOQpxN89MsfFA":{"text":"LIFE CHANGING LUNCH ALERT! \n\nThis was one of the best meals of all time. The meat board wa","useful":0,"cool":1},"ohRxVlwwN0XbAAXNXr44cQ":{"text":"$200 dollars (including tip) for a 2-course meal with 1 bottle of mid-priced wine and medi","useful":0,"cool":0},"5FTj2qNr0ftVI821iRTC1A":{"text":"What's that you say?  Lamb neck for dinner?  Rabbit liver appetizer?  ... and why not.\n\nIs","useful":3,"cool":1},"FU_8fLV9PYlaTwmIBWkwHA":{"text":"Reasonably priced good food with good service. The meatery board was amazing. Tri-tip was ","useful":0,"cool":0},"7lDbeBby_fxbt5_YlPJVGw":{"text":"Great food! We had the charcuterie boards and enjoyed them very much. Good atmosphere, alt","useful":0,"cool":0},"YbckMHFkJdMkwfNF9Mtf0Q":{"text":"I went to Toups because I've heard exceptional things around town and, admittedly, I'm a T","useful":3,"cool":1},"IaUA3RyvkSUl_uYNEdYpfQ":{"text":"When hubby & I decided to travel to New Orleans for Jazz Fest & our anniversary, this was ","useful":0,"cool":0},"y7wpm6IkqUOeAou9jO9HYw":{"text":"Went there for the first time yesterday.  Sat outside.  Service was quick and pleasant.  I","useful":2,"cool":2},"_XowzPnLyrqrn41q-7vL9Q":{"text":"We so wanted to love this place because we enjoyed seeing the chef/owner on Top Chef and h","useful":1,"cool":0},"iLlJCk4rEd8W7gx9ym7hZg":{"text":"Great hand crafted food with a local beer selection.  I highly recommend the buttermilk ch","useful":0,"cool":0},"mSjNkH5YQ_HN7-az1OAoIg":{"text":"Waited over an hour for entrees and didn't get checked on by our waitress once. We had to ","useful":0,"cool":0},"fafN0ZNak-dVHtOWFweNig":{"text":"This place is hands down one of my favorite spots in New Orleans. I'm keeping this simple ","useful":2,"cool":0},"7ThmMjay0YIEuD5OnNFlkg":{"text":"This is one of my favorite spots in the city! It is a small restaurant so I definitely rec","useful":0,"cool":0},"fM4B9PwFZAXQyzuS3txzew":{"text":"This is a review of the bar. Go to the bar at Toups if you are looking to be ignored and s","useful":0,"cool":0},"VJdd46GpawOfKQOl4bL0Gw":{"text":"Great place. Loved pretty much everything we had. The shrimp were excellent. Loved the dev","useful":0,"cool":0},"WcjrhbaSNd12yCJgDfmZ-w":{"text":"We stopped in on a Saturday night for dinner. We had the pickle sampler for our  hors d'oe","useful":1,"cool":1},"wdIRkfuOsNbWKUw8XhtrMg":{"text":"This was the only place we decided to return on the same trip.  Every place we went to was","useful":1,"cool":1},"FL6P48tC8Y6bAczKhxUTwA":{"text":"I highly recommend the grilled artichokes!! They were amazing and the cheese sticks in the","useful":0,"cool":0},"SbIH6ofo_3ZODYXYM6LsrA":{"text":"What a great restaurant, food is different but yummy, service was awesome, I recommend it ","useful":1,"cool":0},"99qxjon6h5cW7-pofhv3mQ":{"text":"After reading all the hype we ate at Toups in early April, I was not impressed.  The maitr","useful":0,"cool":0},"ZH5AQMBgIfNND9bkV15_lw":{"text":"Our experience here was just ok. Given all the options in the area, I don't know that I wo","useful":0,"cool":0},"oXy7FWqe3XoOzHInN-J9Rw":{"text":"The charcuterie board was for me the star of the night and a great deal. I've always been ","useful":0,"cool":0},"7z8ZiD1amtRrizOR1pFZhQ":{"text":"We went to Toups as a family for a late lunch on Saturday.  We were all in a great mood an","useful":0,"cool":0},"SChi77c7DEyEVcOhD5q_OQ":{"text":"The chicken sand-which was so good, but the timing of the service was not. Took about 40 m","useful":1,"cool":1},"xZPv_-HDrQchSwWKB3Ehhw":{"text":"Love this restaurant. The food is really good and the staff is friendly. We used to eat at","useful":0,"cool":0},"scAa_PVF9gx57YO37akYfA":{"text":"Best meal we had on our New Orleans trip! Try anything that's on special, it's really all ","useful":0,"cool":0},"Uk-GtjjvOoED3AIfgNb9AA":{"text":"I'm not one to leave bad reviews without speaking to the manager, but I emailed the GM and","useful":2,"cool":0},"qgFkl9J4SnG4XKXFufNXjQ":{"text":"Chef Isaac and his team continue to knock it out of the park. Had dinner with two out of t","useful":1,"cool":1},"7h7GqlwAGQ1domkWVDzkdA":{"text":"Imaginative, but delicious cocktail selection; excellent food. Highly recommend  - tried a","useful":0,"cool":0},"ivCTBYPHzE8jW7hvkYKeog":{"text":"My husband and I wanted to try Toups after watching Isaac on Top Chef. Am I glad we did. W","useful":0,"cool":0},"mP7JmhDegFXZjZ2zAry6Jw":{"text":"The serving standards are shit. Our waitress seemed totally annoyed that we came in to din","useful":0,"cool":0},"SKJ_NEBNRYHGfhCfzd6SJg":{"text":"This was our first meal on a very food-packed trip to NOLA. Toups' was a great start to th","useful":0,"cool":0},"gQSSdQ9fx60BhL-2HgZBNA":{"text":"Great food - lettuce wraps, burgers, chocolate doberge cake are all really delicious.  My ","useful":0,"cool":0},"Bonh27rZ4sjfDDzVRfZj_A":{"text":"Way too much meat. I guess it sounds silly since it is a \"meatery\" but the portion was way","useful":1,"cool":0},"NodmlMZPBMFmzRCfKVfC3A":{"text":"Excellent food and awesome service. I highly recommend the crackling and their double cut ","useful":0,"cool":0},"BfvI2u3o6uQ_eRlXZWfroA":{"text":"I've been here a good four times. I was first introduced to Toup's by friends who frequent","useful":1,"cool":0},"R6kf-kCJo2ycsvj7ji1PtQ":{"text":"Very cozy place , the food is amazing we were 3 couples and each tried something different","useful":0,"cool":0},"-vdYSbLBraLGJqdAiBcnHQ":{"text":"Fall 2020 Brunch is a must have! My husband and I went today and snatched a patio table. W","useful":0,"cool":0},"IT6105NkbgEGojHJACVswQ":{"text":"Great staff, great food, great drinks and great location. The meat board is the best in th","useful":0,"cool":0},"2EjliFOogdgIzq7Y2CoM5Q":{"text":"I was looking forward to lunch at Toup's on July 14 with my husband, my daughter and her n","useful":0,"cool":0},"UETs2XQEt90fTtWkSxg0EA":{"text":"Host person was very rude... Called and made a reservation....showed up and there was no r","useful":0,"cool":0},"x7ZqZE91vVQgIiA6ZNwlgA":{"text":"You're god damn right. Lambs neck is fire money. Meatboard is a must have. Gulf shrimp aii","useful":2,"cool":1},"nfOzIJbfvCflnjyZEdVV2A":{"text":"Crab claws (spicy), boudin balls, and daily sausage were all delicious. Boyfriend got the ","useful":0,"cool":0},"EGT9JNsAq4NNKWjeYhihuQ":{"text":"Went last night for the first time the restraunt was full and the atmosphere was fun but n","useful":1,"cool":0},"FbL1iVmUJ9R_Y1Dh62Dg-Q":{"text":"Where to start?\n\nThe great cocktails?\nThe amazing meatery board?\nThe pork chop the size of","useful":4,"cool":4},"pI84-anCokWz_EbUpE-e2w":{"text":"Never written a review before but this place deserves every star, At least based on what I","useful":0,"cool":0},"NL9q67zqBY57MEW3r7A3UA":{"text":"This restaurant does not hide behind pomp and circumstance, just good food! They served my","useful":1,"cool":1},"7eUgxjDd9402VLO3Xc_nkw":{"text":"Had a fantastic lunch there last Saturday.  Our party feasted on ribs, Cuban sandwiches, b","useful":2,"cool":0},"idgrdAnicDfqvLVtPLA9xQ":{"text":"\"Just happen to be in the neighborhood to do laundry. Went across to have a beer or two th","useful":1,"cool":1},"OgvDDef5uYm4VEiYRbdMiQ":{"text":"my maiden voyage to Toups was phenomenal. the meatery board is a must-order, with my favor","useful":4,"cool":1},"ymBvL_Rb81sYLe5vHRPD0A":{"text":"Toups Meatery was amazing. We heard about the restaurant and asked a few locals and they r","useful":0,"cool":0},"CL3PvHd5zoaTkfp-QFstPQ":{"text":"Well done, unique and flavorful menu all perfectly executed by the ladies in the kitchen. ","useful":0,"cool":0},"B_SQMf4kV-Vx2dcGQ8cePQ":{"text":"Just moved down to NOLA from CT and found this place while searching yelp for a place to h","useful":1,"cool":0},"LiFa3ae9-ymlgHNsbE11Zw":{"text":"This review is late-we were here in October. We LOVED the food here. Delicious. I had a th","useful":0,"cool":0},"bz3AR_ZC5xoKnWDHEvaTNQ":{"text":"My wife and I were big fans of Chef Isaac Toups on Top Chef. So when we planned a trip to ","useful":0,"cool":0},"_vWOWqE255J1nRiwmzv77w":{"text":"LOVE the fried green beans, the deviled eggs with crackles, and their charcuterie plate wh","useful":3,"cool":1},"EI3DUAMbeJzFBJe5zri_Eg":{"text":"This place is absolutely phenomenal!!!!!! Everything I ate tasted like New Orleans!!!!! As","useful":0,"cool":0},"t_3zbSbe2ZW2iKMlB-NTYA":{"text":"Although it was nice to sit outside on a spring evening and sip a bottle of wine, I cannot","useful":6,"cool":1},"0XAfhsJ0_Q0z6gWWcuVpjA":{"text":"Went for Saturday lunch. Ordered the deviled eggs, meatery board, and a burger. Eggs were ","useful":1,"cool":0},"HgKNgjTlxjJAghIf35f0EQ":{"text":"Had lunch at Toups on January 2 and it was very good.  There were three of us for lunch an","useful":0,"cool":0},"58CORNtdDRcBmN6bnEW0KA":{"text":"Toups Meatery is a nice restaurant in Mid City with a meat-heavy menu, as the name implies","useful":0,"cool":0},"fTv38Hz6nXn1QL3FcHOSew":{"text":"The food was savory and very rich.  The chicken leg dish was generous in size.  The shrimp","useful":1,"cool":1},"7hD1WdYqQBLxN6NeZaaBsg":{"text":"Good place with easy street parking, full bar, and good sandwiches.  We split the \na) Shri","useful":0,"cool":0},"KLovqWrz9GFDo5hvxGxHBQ":{"text":"Amazing food and environment!! Chef Toupe is so cool and his food is top of the line!! Try","useful":0,"cool":0},"W-G3GUOJjvjrzJf8b1Ep8A":{"text":"Food is great, service SUCKS. Server couldn't explain what any dish was, turned off the li","useful":1,"cool":0},"vU_8LbtZVpVt_6qBVt19tQ":{"text":"The food was good and creative! However, the service left a bad taste in my mouth. When yo","useful":0,"cool":0},"vLTI5AKhyBDhX7rA47ZlSA":{"text":"Great spot. Made it here after multiple trips to nola which I think is the right move. Its","useful":0,"cool":0},"b0st7wAIRMdl2sX_3AmqQQ":{"text":"Just ate here for lunch for the first time and I wasn't super impressed. I live a couple o","useful":2,"cool":0},"zslKvy1iwoQPKMAq-irJMw":{"text":"After seeing Action Bronson (look him up, he's hilarious!; Emcee, Chef, Hoodrattery-extrod","useful":2,"cool":2},"bNc3kYyu4R2W7WSdqG9v0Q":{"text":"Just left there.i had the \"wagyu skirt steak\" what a tough,salty disaster! Service was slo","useful":0,"cool":0},"0xSGEqSag7lEX-KbWxUWww":{"text":"I've been here before for dinner and enjoyed it, but I heard amazing things about their sp","useful":1,"cool":0},"z3Y7rCDroa_qeG-HK_o6-g":{"text":"Been here twice, love the cracklings  absolutely recommend the meat and cheese selections.","useful":0,"cool":0},"sUcrsiHANfj0I73zwticNg":{"text":"Lamb neck. Venison. Duck breast. Head cheese. Grilled artichokes. All must haves. So in lo","useful":0,"cool":1},"gpb6YuhF4H1DVabaYgqYSg":{"text":"Blew into town and stopped at this place after a quick search (mainly because I'm a Wayne ","useful":0,"cool":0},"DxrhfiLh4mJ_KRTksiuCLw":{"text":"Thank god for Toups and their bourbon selection to keep me warm on this cold, cold night!","useful":1,"cool":1},"cobIsexRV-Efd8sA3Z2oZQ":{"text":"The food here is amazing. We split two meat boards between 8 people, and honestly, that co","useful":0,"cool":0},"TQHnphiY9nLjZZS7Yi9gJA":{"text":"Amazing! We had the bone marrow special for an appetizer. It was out of this world. I had ","useful":0,"cool":0},"yPEFviZLP5oYgJz4Z9ReoA":{"text":"I'm still dreaming about the Louisiana Shrimp Fried Rice. Amazing!!!!  Will definitely ret","useful":0,"cool":0},"PriuoApRFBqNN24F_iuCrQ":{"text":"The best meal we've had in New Orleans thus far. In a town renowned for its food, this sho","useful":1,"cool":1},"xtCrKVFcq59yfOVuM6g25A":{"text":"Food was delicious as were the drinks. The meat board was so good, and I really enjoyed th","useful":1,"cool":0},"cK1yqCCZp6FsunQ0dg28dQ":{"text":"Ate here tonight, very disappointed. This place is definitely not worth the price. The reg","useful":0,"cool":0},"KlUtpk4jhGho_9Rr_dMGyA":{"text":"Damn! What is up with NOLA and it's underwhelming customer service!\n\nThe difference from T","useful":1,"cool":1},"3wJQ4Ry1Hm4artYPc0MfYw":{"text":"you will not be disappointed by anything you order. the wine list has great offerings, the","useful":0,"cool":0},"DfO6swi7NqN0y7kb-2O0VQ":{"text":"5 stars for the food. 0 stars for the customer service. THE WORST ever customer service we","useful":0,"cool":0},"Aqe1qnn9_0-8_BvBj4rSuA":{"text":"My coworkers and I went for Restaurant week lunch. It was my first time there. Our server ","useful":3,"cool":0},"kk07D86xaPMjkNjoGiIdyQ":{"text":"Worst food ever had for this expensive price don't go it's a touristy trap \n The shrimp we","useful":1,"cool":0},"LNSLzC1YsMWv-vLZwySb-A":{"text":"I want to tell y'all, I'd been a vegetarian for YEARS when a birthday party landed me at T","useful":12,"cool":9},"5cI0MMxqPIPrCpB3hT66BA":{"text":"This place is adorable, and the food is decadent and flavorful. The meatery board is a mus","useful":2,"cool":1},"i6AgbdxfSwyuI5CbKKoqLA":{"text":"Cute and trendy spot to eat. Service is absolutely amazing here, our server cracked jokes,","useful":2,"cool":2},"stCRQ7BUvWcy-ANhxmYC9g":{"text":"My group of four was very happy.  Very friendly service.  We started off with the charcute","useful":0,"cool":0},"5xFcW877vhV0waedCr7H_A":{"text":"Wow this place is the bomb. It was quite a ride from the warehouse district but so worth i","useful":1,"cool":0},"O7ETdkta_yjn3O8qNIKl1Q":{"text":"Was looking at their menu for two days on the website, didn't see where they said they wer","useful":1,"cool":0},"NDoXjaFAiSQsHhiCiuv-9Q":{"text":"This place is the BOMB.com, they serve anything from finger food to knife and fork. The me","useful":0,"cool":0},"X0bAhRFtIW_03xZKAtp09Q":{"text":"Here is the letter that I wrote to that manager upon getting home:\nDear Larry,\nI'm writing","useful":3,"cool":0},"LrlPERBQKeQgiVYveLRQNw":{"text":"Super disappointing on every front. Saw a cockroach on the table. Food was cooked so uneve","useful":0,"cool":0},"qN-NUJeQUiX0yo84S6xXxQ":{"text":"We came to this place because I'm obsessed with meeting celebrity chefs, and Isaac Toups i","useful":1,"cool":1},"SBhFaCtv1afdQYfMdaWOlA":{"text":"Our favorite restaurant in NOLA! Everything was amazing! Wonderful Waygu steak. The veniso","useful":0,"cool":0},"eqsNEVstlgFtAsEgZGofFA":{"text":"I usually love Toups but Sunday I vowed not to go back. We went in and was asked if we had","useful":0,"cool":0},"STWwOOrL7QUzqXh9s8QYEQ":{"text":"The food was way too salty and frankly inedible. We sent our dish back and the waitress ca","useful":0,"cool":0},"GgeJnsTV_0SdBVzIO4d7ww":{"text":"Not sure why this place doesn't have 5 stars because it deserves all stars possible.\n\n- Am","useful":1,"cool":0},"0RU4izU-GfRFxxmGUvDUZA":{"text":"Been dying to try this place since watching top chef. On a recent visit we finally got the","useful":1,"cool":1},"gR3pQc-KG0aee0on9oMltA":{"text":"This place knows flavors. We were very impressed with the combinations. Try the roasted sh","useful":0,"cool":0},"dl-ICd29usKWIeTPlwLbaQ":{"text":"I've been here before and the experience was much better then, but I cannot be apologetic ","useful":0,"cool":0},"ay1Dh29Fg65-Z4-XCk3QKw":{"text":"Being a big Top Chef fan and having a deep, deep love of Southern cooking I had to visit T","useful":1,"cool":1},"Up9b7VEahbtWtXNilrIelw":{"text":"The food was good, the drinks were meh, the service was strange, and for how far out of th","useful":2,"cool":0},"sl2kQTJq5zBTyCTOz9HkHA":{"text":"Highly recommend for the specials! Their double cut pork hop is super filling and deliciou","useful":0,"cool":0},"Ds_nVEOWL3Dgs4ILw3iWng":{"text":"This place delivered food to my hospital unit for COVID. The food is freaking delicious an","useful":0,"cool":0},"yGLV8nmPodFBBZB_sAztiQ":{"text":"We were looking for a local place for brunch and this place made a \"Best Jazz Brunch\" list","useful":0,"cool":0},"JA9uTxZ56uRNukL5YRtV8w":{"text":"I visited Toups' Meatery with a group from a recent conference and despite the fact that o","useful":1,"cool":1},"1KgEDmqR8gNE8wi4wGO2tQ":{"text":"When a place appears on every Google result for \"Best Goat in New Orleans\", and has a menu","useful":1,"cool":0},"wo8OWyLAWxMC3Erf83E6eg":{"text":"Amazing food! Amazing chef! I'm a pescatarian and I still had so many options, it was so g","useful":0,"cool":0},"t6P8bdWJfip7e4cazDLIug":{"text":"Dined here with a friend last night. Promptly seated. Server was excellent! Food is fantas","useful":0,"cool":0},"1FFe7kfjhMgQQOYG8NVQGw":{"text":"Been a fan of Isaac since his days on TC. Toups was on the top of my list during a recent ","useful":4,"cool":2},"6UIS67HsYOWK5X1ZiwjbZw":{"text":"Fried quail was very good and tender.\nRare roast beef was interesting but good\nFoie gras w","useful":1,"cool":1},"2Skr6_8IusKojxtyHsvWWQ":{"text":"Chef Isaac Toup from Rayne LA and his joyous wife Amanda has capitalized on his talents wi","useful":0,"cool":0},"u1mPAP1OzRf2QTITJZV-QQ":{"text":"Second time at Toups and was as great as the first!  I'm a carnivore at heart and can't ge","useful":0,"cool":0},"LnWgo0ZPj9qtovRnmkh6uw":{"text":"Not very impressed. My husband and I shared a charcuterie board in which the pickled onion","useful":1,"cool":1},"O0Kk5Q57W40esZAI5mb7RA":{"text":"This restaurant is an Uber away from the French Quarter. The food was excellent and the se","useful":1,"cool":0},"r3aZ3nCQfGo2FS6dKgaQVg":{"text":"In town on business and just driving around killing time before the meeting.  Took a chanc","useful":0,"cool":0},"HnlLyaggEOt2k9ie1t3Kxg":{"text":"I had forgotten how much I like this place until a recent visit during Restaurant Week. No","useful":0,"cool":0},"IR2Vjih8lZ3EAv1aam3L4A":{"text":"Was very much looking forward to a dine-in experience after 60 days of lockdown and this i","useful":0,"cool":0},"25RZ5bxj_C1585rNCLCprQ":{"text":"I'm in love. There are certain words I use when searching for food.  Confit. Pork belly.  ","useful":3,"cool":1},"o6ve-4sS6HKMq8KyPn1GhA":{"text":"Our reservations were for 8:30. Our table wasn't ready until 8:45. We ordered 4 small plat","useful":1,"cool":0},"tW_lg_4ucagTZanzb91bxg":{"text":"The first time I went to NOLA, I still had regrets of not visiting Toups. I corrected for ","useful":2,"cool":1},"SFGWQ3l27P9ULv0FtigMog":{"text":"What a great spot for brunch! The bottomless mimosas were awesome for the price. If you we","useful":0,"cool":0},"0jspyZxXXsTpdKUG1muS-A":{"text":"This place is incredibly unique. Everything you order has some kind of wild tweak to it. T","useful":0,"cool":0},"VW5TBiPKEhKdZruShtyTIA":{"text":"The pickle plate was a delight to try, and the venison was so good. Cocktails were impecca","useful":1,"cool":0},"VmhOkiOeM9miBkos05oLfA":{"text":"A highlight of my trip to N.O. The wife and I had the butcher board which consists of just","useful":2,"cool":0},"sVRnBGkzO4o7fOf5re9_Dg":{"text":"Good happy hour.  Friendly service.\n\nRecommend the boudin balls and cracklins. \n\nWe had th","useful":0,"cool":0},"ePR8pjvyTVNxL9gYxolz3g":{"text":"We had high expectations and Toups definitely delivered. This place is meat lovers heaven,","useful":0,"cool":0},"WDcgR0j26kf-iFhgBzaOkQ":{"text":"We came to Toups with expecting something amazing given their notoriety. The restaurants a","useful":0,"cool":0},"lssOXx50oeX4a9NiiNzGHw":{"text":"Food was good! But there is a lot of good food in New Orleans. This feels like you're in a","useful":1,"cool":1},"JGTzrz4RhJ-vk4Qh4Y8G0A":{"text":"Great lunch spot!  Ordered the Meatery Board, I thought it wouldn't be enough food, so I a","useful":1,"cool":0},"PmTai_QQP1pin9bip7MpEA":{"text":"My wife and I dined here in September.  The service and food were excellent.  We had their","useful":0,"cool":0},"7bNmodQaMefffXQiWcrXGg":{"text":"Two words \n\nLamb Neck\n\nOverall one of the best meals I've ever had. Started off with the c","useful":0,"cool":0},"0FcPX4G_iHyyk_OmkNpJlA":{"text":"The food was ok, the boudin balls were great but everything else was just ok. They have a ","useful":0,"cool":0},"hNIdu8OcscHBYb_DrotLdA":{"text":"I've been wanting to try this place for the longest and finally decided to check it out on","useful":0,"cool":0},"fhQMLlFWqQ6PTgCzhSafhQ":{"text":"You should know that their menu does change seasonally. In late July there was no bone mar","useful":2,"cool":1},"77xya0Z_PMoOO4yTAPQKkw":{"text":"Walter Clark\nCharcuterie and cheese boars,double cut pork chop with dirty rice,root beer g","useful":0,"cool":1},"j2jNiZ38ow5ZotA57VMyjQ":{"text":"To sum it up this place has great food and terrible service. On a slow Thursday night thre","useful":0,"cool":1},"g4BXa5P4quv53UH_l8trGQ":{"text":"I finally decided to try this place after passing by it for a while. I have mixed feelings","useful":1,"cool":0},"xRdGaTEFRnluLsRrQewx8w":{"text":"We love this place! Every time we visit New Orleans it is a must visit place! Food is impe","useful":0,"cool":0},"KUylSQhDsjKdk3bb1xWy1w":{"text":"What a great experience, Adam was simply amazing and our visit memorable.\n\nWe started with","useful":0,"cool":0},"tTJDxoTjoGBzWdm1petfAw":{"text":"So far my best meal this weekend while in this gift from the Gods Foodie City. I've heard ","useful":0,"cool":0},"CvH_8VLV0za7diciGMaHCw":{"text":"This place is great. Excellent bar program with well designed craft cocktails without skip","useful":0,"cool":0},"4YkGYpTdXNK0Sh-FXuTdkg":{"text":"Went with the family to enjoy brunch during restaurant week. VERY disappointed with the fo","useful":1,"cool":0},"XzPMoF3Vj1gi1KJV7tVUBA":{"text":"Isaac Toups is the best. We come here pretty regularly. He always makes sure his guests ge","useful":0,"cool":0},"olXsWs0ZkiX8EZHm2FvytA":{"text":"Hamburger overcooked. Quail (what I went there for) so over-breaded, over-salted, and over","useful":0,"cool":0},"s1mUpJzo3KkM77G0rKEa9g":{"text":"Bang for your buck: 8/10\nQuality: 10/10\nService: 9/10\nAmbiance/Location: 10/10\nOverall: 9/","useful":2,"cool":0},"nz3kfe_szDLkP0ZVK-dubw":{"text":"The initial reason I chose this restaurant for an NYE dinner was because I was a huge fan ","useful":3,"cool":2},"HpPYxVVtLnYjlG3hYo5fbg":{"text":"Disappointing compared to our last (5 star) visit a year ago. Server was unfriendly, the m","useful":2,"cool":0},"kxi1SzROs5q2baWu5JIEAQ":{"text":"Amazing location. Amazing food. The restaurant seems to have really given a lot to the com","useful":1,"cool":0},"fz66ALjWaGb1x4ExybjENw":{"text":"The. worst. experience. literally confirmed my account just to leave this review. hereee w","useful":0,"cool":0},"SqjO4MI1ganHbfOMXP-Nnw":{"text":"This 2 stars is pretty much only related to the food. I liked the atmosphere and service w","useful":5,"cool":3},"2McyTzYOqdid2HV3Ne-vMg":{"text":"Great food , Great ambience, and Excellent service. Make you get the lamb neck it's indesc","useful":0,"cool":0},"0rN9SVZDfenbEF41bH8yCQ":{"text":"Had good and bad meals here. Not sure what the problem is and why so inconsistent. Expensi","useful":0,"cool":0},"g8PxJwZA3-iX8o4g3Da-sA":{"text":"I had a reservation for 11.15 am this Friday afternoon. I was lunching alone, so I followe","useful":0,"cool":1},"E3Pe12mdo1sFTt-HVNF4Lw":{"text":"Why isn't 10 stars  a thing ⁉ Toups was fantastic. Everyone was so nice and felt like they","useful":0,"cool":0},"g7MM2SyXo7bhcwzM8Dv5Cg":{"text":"This is an awful experience. Waitress got the appetizer wrong, waited on butter for the br","useful":0,"cool":0},"szeBJFjat_nOaovB0ryiTg":{"text":"Stopped by on Sunday night.  The couvillon was the best!  Really enjoyed it, and will defi","useful":0,"cool":0},"GwCk89KdB13DOxDvphBwCg":{"text":"I'm a fan, yes. However, I think there is room for improvement. I've been dying to try thi","useful":1,"cool":0},"kEmyZDMSOw0DPpKvYmE6Cg":{"text":"Safe socially distant setting for indoor dining. Server was great. Nice wine list and the ","useful":0,"cool":0},"vgzuMSToa6yr9DtFmCKvyA":{"text":"Some next level meatery here! We got the meat board and it was a feast in my mouth. I feel","useful":0,"cool":0},"knG1vvW-6WahSjod9ObKbQ":{"text":"We stopped in here Saturday to wait for our Endymion crew to roll for Mardi Gras. Group of","useful":0,"cool":0},"0wpaYxiMZ7RtZWElKUn7TQ":{"text":"Brisket, pulled pork, Brussels sprouts. Garlic Mac& cheese and the sesame ginger slaw were","useful":1,"cool":0},"jy6G-9gN7bQijxaSdeRDeQ":{"text":"The food has always been so good here. For several years we have made it a point to eat at","useful":2,"cool":0},"Qffzpbx0fRuhMAr2SxvoZQ":{"text":"Outstanding food and friendly service with solid recommendations.  Their butcher board (th","useful":0,"cool":0},"zL91C0CIHv1oUMXvzyRwZA":{"text":"Fantastic burger. \nThese guys have been boss since this whole pandemic nonsense. Talk abou","useful":0,"cool":0},"OjrPYhOWeVxPHM1n-Qzshg":{"text":"Found the chef on YouTube and immediately made a reservation. From start to finish - every","useful":1,"cool":0},"JNGpYGWsFWlKatrRhJbb9Q":{"text":"Freaking fantastic and unique meal!  We went here during our vacation because it was just ","useful":0,"cool":0},"sutkfAO85R6t8eQ5IbABzw":{"text":"This was a return trip after a year and it was as wonderful as the first. The Meatery Boar","useful":0,"cool":0},"MdaxdsYea-CqMsbhhXBrJQ":{"text":"Ate here last night. We had a reservation for 8.45, but upon arrival the server seemed lik","useful":0,"cool":0},"BhIKo9UrVx_FADW1f5xwGQ":{"text":"If it was possible to give no stars...i would. Air condition died. Our table waited two ho","useful":4,"cool":0},"xdW1rYA6KD3EZxiIo0RrqA":{"text":"One of the best meals we've ever had, served up by one of the best servers we've ever enco","useful":0,"cool":0},"BGr7As1ATbVBl_N7DnshIw":{"text":"Great food. Got the steak and it was excellent. They also do a lot for the community so I ","useful":0,"cool":0},"ajZHz_HM5pJDImLk8bpekw":{"text":"If your looking up the word AWESOME...Toups Meatery  has a picture under the dictionary! A","useful":0,"cool":0},"rLrguLaveNdLsbISPq1FoQ":{"text":"This place did not disappoint! Highly recommend the pork chop it was so amazing! I just ca","useful":1,"cool":0},"dmSCuUKJzQSd3KsymMxfrg":{"text":"We were very excited to eat at this restaurant because we LOVED Issac Toups on Top Chef. E","useful":0,"cool":0},"QqChCQSUaIhaHSH7b9_6RA":{"text":"Sweet baby Jesus tonight was good. I had the seafood covillion and had to ask for more bre","useful":0,"cool":0},"pDFigNY-JdxKrq8vzo5agA":{"text":"Didn't live up to the hype. 3 people: we ordered the Boudin balls, wagyu burger, roast bee","useful":1,"cool":0},"ToAsNs_gxstX5uPlt5bbcQ":{"text":"Wow, incredible pastrami rubbed duck breast. Just for that dish I can give Toups Meatery 5","useful":4,"cool":2},"no0NwlJ9dMDj0D83CS4SUQ":{"text":"Came in for brunch this Saturday morning. Only \"brunch food\" options they had were eggs an","useful":1,"cool":0},"xSahMCFf5_5W5InOfNu09g":{"text":"I dined here today for lunch while in town. I loved the chef from Top Chef and knew his re","useful":2,"cool":3},"cJiDFN7xLKIHkhXu_AQxpw":{"text":"We sampled a bit of everything. Delicious meat platter, cheese platter, pork chops, spare ","useful":0,"cool":0},"2rS8tvIV9i5I-2zrlrdXFw":{"text":"Meat Heaven. This was one of the best meals I've ever had. We ordered the Meatery platter ","useful":0,"cool":0},"WrLEflDd55HLSQs3CfDS2Q":{"text":"Toups Meatery..\nMan, I do love this place, it was love at first bite.\nWe went there for a ","useful":2,"cool":2},"4SZb5z8fS9tpJz0HezJavA":{"text":"We stopped in because all the good reviews\nMy friend loves to try all different meat varie","useful":0,"cool":0},"UwpKnjJxoKTrnjMNLRRPmA":{"text":"Everything about the evening I spent here with the lady was superb! From the attentive sta","useful":0,"cool":0},"SKJ2JQGiufG6peyj_KoI6A":{"text":"The cracklins were the best I have ever had, the pork chop was the size of my head and the","useful":1,"cool":0},"gEMl7jR9VZet0a6XuvPpBQ":{"text":"The food makes this restaurant four stars. The rest a solid 2.5/3. We walked in not realiz","useful":1,"cool":0},"rUlIX0tjyHvwzqYjMnLZHA":{"text":"The culinary highlight of our trip- plus, delicious cocktails! My crew brought me here for","useful":0,"cool":0},"WmST9_T09ng-YAKN6JT97A":{"text":"All I can say is WOW. This place is a do not miss when you go to New Orleans! It is a bit ","useful":1,"cool":1},"YyYbsnXGo2pXZxUGtAfeeg":{"text":"We went to this lovely restaurant for the first time last night, for a birthday dinner. I ","useful":0,"cool":0},"Q5iusz5_uFwE5dbF-U9nuw":{"text":"Bust out that leash because our next happy hour spot with NOLA on a Budget ((FB) is perfec","useful":0,"cool":0},"5XNH795EjrC5yE1Fsnj-GQ":{"text":"My husband and I have been looking forward to having dinner here for a few months and it m","useful":1,"cool":0},"z3h2dftfP_Uwg2vB2kQ0lw":{"text":"We live right down the road in Mid-City, but have never made it here. Changed that today w","useful":1,"cool":1},"yrvEvXXyCC44COE3n2zYdA":{"text":"If you look at my other reviews you'll see that all the restaurants to whom I've given a n","useful":1,"cool":0},"CZpsJAWED3X4pNdbwOLUhw":{"text":"Really really disappointing. Our waitress really didn't want to be here, and eventually, n","useful":0,"cool":0},"wqvzcCcL8YqEPDzP4TY1qg":{"text":"Stopped in on our way to Jazzfest. The meat sampler platter was awesome. Main courses were","useful":1,"cool":1},"BVXqwgODi_mBB4v7q2N_Xg":{"text":"This was a fun place for a late supper. Would definitely go back again. Sat at the bar and","useful":1,"cool":2},"1_iU3I-2NtQbmk8cc1oflw":{"text":"The service was nice and attentive, I had the House Made Boudin Spring Rolls and the BBQ S","useful":2,"cool":0},"Kktovil85vK5k6ikMl7jHg":{"text":"I was in the area and figured I'd give this place a try. We found street parking in the im","useful":1,"cool":0},"RJPsg933keFgjBNCBHasnA":{"text":"Went here with a party of 10 two days after Christmas with a reservation through Open Tabl","useful":4,"cool":0},"Zhj2gIsAWgDssPz93y0o1w":{"text":"I was in meat heaven! I found Toups just searching on my phone for a place to grab lunch a","useful":0,"cool":1},"ZkvrH3i-m77KgOj0trF--A":{"text":"I have passed by Toups many times and finally decided to come out of curiosity. After a qu","useful":0,"cool":0},"vGSB-L4XfJ7dYPchC_7xHg":{"text":"WOW. OMG.  Meeeeeeaaaaaaatttt!!!\n\nI had dinner here Friday night with friends and left wit","useful":6,"cool":5},"X4sNUZoTOVYpStI2QZRXWw":{"text":"My friends and I went for brunch and I must say off the bat, the service was amazing. We s","useful":0,"cool":0},"h3l1ff4rnvKtkjDOBXshEA":{"text":"Always, always, always FIVE STARS! \n\nI was here three days ago (first time since COVID), a","useful":1,"cool":1},"ctFG8-hTwziO9LwLMJ4q2w":{"text":"So this is some of the best food I have had a in quite a while.  \n\nWe are those people who","useful":0,"cool":0},"WRpob14QAGUqQHq_YsvTNA":{"text":"We came on a visit from Seattle and hoooooo boy are we glad we did. \nThis was the most epi","useful":0,"cool":0},"Xek864wRhQp3lh8psGRJ-A":{"text":"Good food, strange service.  The 'cold' do you have a reservation?' was weird, then, I'll ","useful":0,"cool":0},"Rt3PTRU_AQWokSHG_EcS6w":{"text":"If you're looking for a place with unique and amazing flavours this is your spot. The meat","useful":0,"cool":0},"AAf4OoFoM0JJZ-gN-WtG2w":{"text":"This place never disappoints. I went there with my daughter for the Lenten fish fry specia","useful":3,"cool":1},"bKHNiMgHRCNTwcO3JxQB5Q":{"text":"You simply can't go wrong with the center cut pork chop and it probably should be on every","useful":0,"cool":0},"tc1IO9sYCQ34OMAcUQN9lQ":{"text":"as a top chef fan, when i visited nola in late june i knew i had to book a table here. ama","useful":0,"cool":0},"k4l_gi0MYUQA5lOpKw815w":{"text":"I used to go to Toups at least once a week about a year ago. My two favorite sandwiches we","useful":0,"cool":0},"UgCXxv27tDvvGbkfDcJahQ":{"text":"My husband and I tried this place out while visiting the area. We ended up going back the ","useful":0,"cool":0},"k8qZQFPsDpAjxm0bTB4yjg":{"text":"We made a special trip to eat here because I heard they were doing great things for the co","useful":0,"cool":3},"Mp23Qqx-bmcD-0JtinTfxg":{"text":"They take reservations and I\nHighly recommend making them. It was busy even at brunch and ","useful":0,"cool":1},"oWhvFDx3qBzzvM0YQRC_4w":{"text":"Rarely does a place I try for the first time get a 5 but this one comes close. Strong 4.3-","useful":6,"cool":4},"xmlF4Ha3861_i5CrfU2e9Q":{"text":"Nice outdoor seating.\nWaiter and Waitress kept fighting all lunch.. Waiter was clearly hig","useful":3,"cool":0},"ZXD_58yq1VJsLHpfGyarTQ":{"text":"I stopped in for lunch today and tried their new rare roast beef sandwich with aioli. It a","useful":2,"cool":0},"BRJ6zAGz-y3yuiYa6DcUiQ":{"text":"Been coming here for many years !!  Shouldn't be a hidden gem,  I know it's not in the Fre","useful":0,"cool":0},"MGmWRWvdX6wSmMTV5P-EcA":{"text":"I really wanted to like this place but I had a pretty terrible experience. I ordered take ","useful":0,"cool":0},"2u091HjX8DwOA5wzEZmpcQ":{"text":"Meat. MEEEEEEEEEEEEAT. Seriously they call this place a meatery for a reason and good Lord","useful":16,"cool":8},"mvrGRQjfYYUrq7xJCYf8wg":{"text":"Everything I didnt know I needed. We had the meat platter, crab claws, arugula salad, pick","useful":0,"cool":0},"vveReUrkHxnBZ3TvJqSECQ":{"text":"Serve was amazing. We were seated quickly and our waiter was very attentive. I ordered cor","useful":2,"cool":2},"30y9syrQA9iADJaoWxmUMQ":{"text":"If We could give 0 stars we would. Worst experience ever. Staff extremely rude, we waited ","useful":2,"cool":0},"1NW_LzfBGdnKkQ4jegbI-Q":{"text":"Chef Isaac Toups was one of our favorite contestant for Top Chef so we love to come to Tou","useful":10,"cool":9},"488qa3q5t81QppoIJZFGqw":{"text":"Ok... really great place for dinner/drinks. Staff was great and executive chef Isaac TOUPS","useful":0,"cool":0},"KtArCYuCwPAm6xVLb7AU7Q":{"text":"I have been incredibly impressed with Isaac and Amanda Toups for all they are doing for th","useful":5,"cool":6},"1fZz5BL8EoQYbSWRTorIHg":{"text":"We were visiting New Orleans on the way back from visiting my family in Florida. I wanted ","useful":0,"cool":0},"ym8juuE9NKI3Ro3UskXD5w":{"text":"Talk about a whole vibe! Our waiter was A1. Great charismatic personality and helped us or","useful":0,"cool":0},"XfAx9EFQRxTaS3C9JJBxbQ":{"text":"Extremely dissappointed in what I expected to be a great place. Everyone praises the food ","useful":3,"cool":0},"a1KkQH0kxYC0AMWNB0jfBg":{"text":"Just left the place. I ordered duck breast, tasted and looked like beef. Ive eaten duck ma","useful":4,"cool":0},"4drDsH6gFl3TWsxMYftbxA":{"text":"I always seem to make last minute reservations when I go here but they've honored it every","useful":0,"cool":0},"B-sDyk3WDT0UDAl9FNj07Q":{"text":"Had probably one of the most disrespectful, unpleasant experiences today. Tried to dine at","useful":0,"cool":0},"sjRjlWpBl3lncxwmp91WUw":{"text":"Can't recommend until they've improved service. Definitely not for a holiday or special oc","useful":0,"cool":0},"zgu-uS6MJVgtmpsrBS6s9A":{"text":"Amazing food. Terrible waitress.  Somebody needs to remind them that they are competing fo","useful":1,"cool":0},"vrRHc2khyHdYSI0xQz9p5w":{"text":"I would be lying if I didn't say I wasn't disappointed in this restaurant.  My wife and I ","useful":0,"cool":0},"7W_6nNE5QM-D-izjsjU5Aw":{"text":"Every year my friend chooses a very meat-centric restaurant to have his birthday dinner. A","useful":1,"cool":0},"7VlqdLCx1tfNugjQhFYBDg":{"text":"Oh Lord the best of the best was found! We had the meat board and house salad to start. Th","useful":3,"cool":4},"HOb6JTWamCFLY-MJ3PLtpg":{"text":"I had the chicken confit, and the first two bites were delicious. However, it soon occurre","useful":0,"cool":0},"uA1tpu1RXE7TMrisL84f2g":{"text":"Fantastic meal, great service. Price was as expected for the quality of food. We went for ","useful":0,"cool":0},"k-gd2acnZloiTCb8391fBA":{"text":"I went here for a celebratory lunch and the near empty dining room at noon should have set","useful":3,"cool":1},"uHG3J3FjMkAEs3zrIJc7XQ":{"text":"Went to TRY TO EAT. Let's say try very faintly. Walk in. Plenty tables available. Great yo","useful":0,"cool":0},"cN8PlGoUQ4qB9f8egrqvqg":{"text":"Well where do I start the hostess was anything but Hospitable kind of on the snarky side. ","useful":1,"cool":0},"PhBLvkulnTzzBkLpL4zZCA":{"text":"One of the best I've tried in New Orleans so far and there have been many. The atmosphere ","useful":1,"cool":0},"YhieFnfpCdzVo5O4EACTEA":{"text":"Toups Meatery has flashes of culinary brilliance. The salads here (don't let the name fool","useful":4,"cool":2},"ven8TAihJzQlkpDOPOPCsA":{"text":"If you're reading this, stop reading and grab a bite to eat at toups meatery. You will not","useful":1,"cool":0},"yVNGyM3pSAUcdlxOhOGHIw":{"text":"I went to Toups for restaurant week. I was very excited to try Toups as I had never been t","useful":3,"cool":0},"bRlgoQDTxnVqs_5cDoX05w":{"text":"Alas! Arrived on a Saturday at 7:45 PM with No reservation and the inside dining room was ","useful":3,"cool":2},"J5-l4wVrE7I6w9yHJ9dLyg":{"text":"We were treated like gods and the food was beyond delicious from appetizers to entrees/des","useful":0,"cool":0},"rrxtaeOhdBOXCV-cB7KEMQ":{"text":"Stopped into Toups for appetizers and it was a great choice. I had the boudin which was go","useful":4,"cool":2},"LCJESh20xBWRCpBGHdWI9w":{"text":"Amazing experience. Planned a trip to New Orleans for my birthday and I was excited to fin","useful":0,"cool":0},"KL0ZZL5qMeCLEeNpZSOhqQ":{"text":"lunch today.  burger and fried chicken sandwich.  both were excellent.  big flavors, very ","useful":0,"cool":0},"5niUsZcpbFA2Tq9sRQNljw":{"text":"So we tried their Coolinary dinner.  I forgot to snap a menu picture but someone else post","useful":0,"cool":0},"yh2j608qw82C6peGEW9Bjg":{"text":"Toups Meatery brunch! Took some friends for brunch on a Sunday morning. Right away we were","useful":4,"cool":3},"s37YGSqXIkN35wxqvPdnuQ":{"text":"So I've been here just about every Friday for the last 2 years and have come for the occas","useful":0,"cool":0},"SbUDIJmkmjJA-iX1IrEUPw":{"text":"The people at this restaurant were so friendly. Both the chef and the waiter were very kno","useful":0,"cool":0},"YeHVniQNrKm0jDBR8a3yHg":{"text":"All in all. It was bad food and bad service\nI hesitate to even write this review because T","useful":0,"cool":0},"FeICgPfv98DIwXypH7aQDA":{"text":"I eat at Toup's a lot because it is delicious, different, consistent, and the service and ","useful":0,"cool":0},"ONrlcJkYJMTTd8EaHN19TA":{"text":"My boyfriend and I came for the steaks but we stayed for the cracklin!\n\nWe started with Th","useful":1,"cool":1},"y8U1HcNLiU-bCINuhgPC1A":{"text":"Drinks are good, (when they give you the right drink) the food was ok. Very overly priced.","useful":0,"cool":0},"gxK0nnqk0D7AGNbhpWCrGA":{"text":"ABSOLUTELY FREAKING AMAZING! Best food Ive had in NOLA (and i've been here several times).","useful":1,"cool":0},"fGbpBS3AGb9zYhCfWReotA":{"text":"My husband and I went to check this place out for lunch and it did NOT disappoint.  We ord","useful":0,"cool":0},"b6fSLACp2BCf3cz0twDtUA":{"text":"This place..... is a supreme foodie experience. The savory flavors that caress your tongue","useful":4,"cool":2},"zOW3eMPCHKRO9aRS-fUo-g":{"text":"We chose this place for our last meal here in NOLA. Reservations definitely recommended he","useful":0,"cool":0},"mbqzEqr8_Dl79774e5Fs6A":{"text":"The service was very nice and ambiance was good but the food was far below subpar. I had t","useful":0,"cool":0},"F_RziGwVmQJYot41RW5AdA":{"text":"Holy meat! I mean that in the most complimentary way. After finishing up, we realized that","useful":4,"cool":1},"EXSL5nkemHKC8IUIgstmTg":{"text":"We wanted to support the Toups' to show love for everything they have done for the city.  ","useful":0,"cool":0},"aafj3SGySeDu29QI2nvY0w":{"text":"The original Toups - at home in Mid-City!  This spot has always been a fantastic burger pl","useful":1,"cool":2},"DhOxFCTMczb7ZBSehBUNRw":{"text":"Hipster vibes abound at this life-changing carnivore's paradise. Waiters varied in their a","useful":2,"cool":0},"vYpFDD3skBU43aQuq6DxrQ":{"text":"Come here if you want to spend 3 hours & $500 getting food poisoning  Our server forgot ab","useful":1,"cool":0},"6yyZ41DK5tAs7Idqwxr_bQ":{"text":"If you come to New Orleans this is a must you should eat at. It's pricey but well worth ev","useful":1,"cool":1},"bNeCcwXr-p5PW0a7aPlmMA":{"text":"If it were just a review on the food itself I would give Toups 5 stars. The hog head chees","useful":0,"cool":0},"yA6FTEhn2d8ploQ743YefA":{"text":"Ahhhh Toups.  The start of my New Orleans food journey.  Hubby and I went south for vacati","useful":1,"cool":1},"4KS5D58UFinRH5Rn8QPFmw":{"text":"We saw this chef on YouTube on a few channels. It didn't prepare us for the amazing food a","useful":0,"cool":0},"czLskdTOy0744GYt5qliYQ":{"text":"The Meatery Board was fantastic. We split this entree and it was delish. The fried boudin ","useful":2,"cool":1},"iNSNku77PUtw_ZTvN5mqGw":{"text":"I feel like Toups has gone down hill ever since Toups South closed. The portions and quali","useful":4,"cool":0},"MLs9eh2zahjjFotzcj4J_Q":{"text":"Went there for lunch today for restaurant week in NOLA which of course strayed WAY off men","useful":0,"cool":0},"9AQWiFEEIhat7pt1S7glPw":{"text":"Summary:\nLiterally, some of the best food I've ever had.  Go eat there immediately.\n\nLocat","useful":1,"cool":0},"EPsj1pVulnvvKf125Kt1Xw":{"text":"I read about this place online in a \"Best Of\" article and it did not disappoint. We ordere","useful":0,"cool":0},"SQDy4ORzYnATfScXqdBqiQ":{"text":"The bartender Jess is the BEST ... I had Blood & Sands which were amazing! Cracklings and ","useful":0,"cool":0},"UyM8PkyX9LiWA5ZRFtPG5w":{"text":"Came here for Coolinary brunch last weekend for my first venture back at in-person dining ","useful":1,"cool":0},"I7wiVMpwHKNtrn-Ws_4dvQ":{"text":"On the eve of Tropical Storm Barry, we walked down to Toups for happy hour.  They do keep ","useful":2,"cool":1},"HQuNJHkMParDHOesqXa1Hg":{"text":"Whatever chef puts on a plate hands down GREAT, ASTRONOMICAL, SENSATIONAL, FINGER LICKING,","useful":0,"cool":0},"TujiLKGqiNoqDAbAKX0drQ":{"text":"My dining experience here left a lot to be desired. My friend chose to eat here for his bi","useful":1,"cool":0},"ZmeQ8Pg8BWeR7bJffpLu7Q":{"text":"Like others, I was disappointed by my experience at Toups. The only reason why I'm rating ","useful":0,"cool":0},"u10-B3jl4YM3zTR5Cp3nWA":{"text":"In my NOLA top 5. I've eaten here many times and have never been disappointed. The Meatery","useful":0,"cool":0},"P3nc8HtjV-93rxS1eMLdbQ":{"text":"I moved to Mid-City a few months ago and had been curious about Toups for a while. It's lo","useful":0,"cool":0},"RpAJWriiRhRoaiNgnomnXg":{"text":"\"You gotta be real gentle with garlic...\" Isaac Toup before absolutely destroying a garlic","useful":1,"cool":2},"V89k7lCsH0NjYtPwdQntyg":{"text":"We really wanted to love this restaurant. It came highly recommended. We even canceled our","useful":3,"cool":2},"3PACqhPngfWdkbrS8kMKYw":{"text":"What a great brunch experience this was for me! I pass by this restaurant often and today ","useful":2,"cool":2},"1xAj-32fqiXnNKSwuiXZEg":{"text":"I never write a bad review unless its worth the time. So I have to point out the rude and ","useful":1,"cool":0},"Y_0EHWJT8v4vN4EtGlq-mQ":{"text":"The food was great. I had dinner with a few friends after work and we enjoyed dining outsi","useful":1,"cool":0},"2Q-R5nFrx_gkB7lnTjmGIQ":{"text":"Yikes! One of the worst dining experiences of our collective lives!\n\nSpent 3 hours here wa","useful":2,"cool":1},"msAADFkNxnatuVV3tTje2Q":{"text":"Wow wow wow. What a Sunday brunch.  We had the best waiter in New Orleans.  Gabe was amazi","useful":2,"cool":2},"T-F6xZ8zY-gkEZV3n0tEIQ":{"text":"I wanted to like this restaurant. Top Chef alum and meat!  Sounded like a solid place. \n\nA","useful":2,"cool":0},"vU00alzRs3bXeidzjsC-UA":{"text":"I must disclose that we came to Toup's with huge expectations. My wife is an enormous Top ","useful":2,"cool":0},"7LwSlRf8v6wfCtVhfSS2hQ":{"text":"Such a great experience. Recommend getting a reservation as I think right now walk ins are","useful":0,"cool":0},"ogHgL9FM64jFrKRwFHi5bA":{"text":"One of the first to arrive for lunch at 11:45 and it's 12:30 and we just finally were serv","useful":1,"cool":0},"RwksGSYvSqDzow5sNPJmJw":{"text":"This place was ok, but didn't live up to the hype. We started off ordering the mandatory m","useful":4,"cool":1},"VBw_JPGhJMmj6PfwzYixwQ":{"text":"Celebrated a Birthday with Supper Saturday night at Toups Meatery.  Got Cracklins, Boudin ","useful":0,"cool":0},"Cq3Lqby10hGYOC70nfPnIw":{"text":"Service problems made us feel that our experience did not matter to the restaurant personn","useful":0,"cool":0},"Bp9xRuLE1tjBwzyAqd0yFA":{"text":"I've got to be honest. Toups was pretty lackluster. We came here on a beautiful Sunday and","useful":0,"cool":0},"XdvfeXOAVJxiFx4LmMQ8fA":{"text":"Had a reservation for 1 PM and still had to wait 10 minutes for our table.  Two out of the","useful":1,"cool":0},"b4Knh6pAEvy-DAidfWY3AA":{"text":"Wow, what an amazing meal and experience. Legit everything they brought to the table was a","useful":0,"cool":0},"p11ltoPw4ARPYS_fcWiJZw":{"text":"Sadly, I've given Toups as many chances as I possibly can.  I will not be going back.  The","useful":0,"cool":0},"QHWJDBCSWs_LGl5Xyo6SVQ":{"text":"Stopped in for lunch for a Reuben sandwich. This was one of the worst Reuben's I ever had.","useful":4,"cool":1},"B2XnSLfMQ-5EVqQqfCBUGg":{"text":"So.... now that I have had one good experience and one that had determined we won't come b","useful":4,"cool":3},"hiygPR7gdcOIuky2ofjuuQ":{"text":"Don't leave reviews often, unless I have a great experience, and Toups was that. Inventive","useful":0,"cool":0},"HBjr7o1wJjHC01hPSsRQ6w":{"text":"This quickly became one of my favorite restaurants I have ever had. My father was from New","useful":0,"cool":0},"PEgdxDJt44HVeQuxS--BSw":{"text":"We have visited this restaurant the first time because we saw Chef Isaac on Top Chef. We h","useful":0,"cool":0},"lg6sT-XaobtrmVBkPZSm5A":{"text":"We finally got to try out Touos. The food is carefully curated, presented and plated. Ther","useful":3,"cool":2},"DgC4Px7mYJaiJ8ODHauQqw":{"text":"Amazing food, amazing atmosphere, amazing service, and isaac and amanda are super friendly","useful":0,"cool":0},"Cbok_lbTdMSGQ27SxIZ-1g":{"text":"Pariche was absolutely beautiful jewel, no the gem of Toups Meatery. I felt so at home, th","useful":0,"cool":0},"tMcbpBonboHCLMu2vZVjFA":{"text":"I just got the worst service ever here. I was left waiting on a cheese board of all things","useful":2,"cool":0},"Y6440zAwsyy7NJoX--C19Q":{"text":"This restaurant has amazing food. I had the roasted shrimp and Wagyu steak, along with two","useful":0,"cool":0},"nmqdesDgeSfo2LjgabKi8Q":{"text":"How fun is this place?\n(pretty fun)\nMeat! And delicious fried things.\nWe had lunch there r","useful":3,"cool":1}}