{"Sk9NiJdhVi-eyilrXOiqrg":{"text":"This got the job done without waiting in line for hours at Cafe Du Monde, but after going ","useful":0,"cool":0},"eQCRLZmKEXErCgSRkZuGDw":{"text":"The bartender thought my friend's and my NYS licenses were fake...and she claimed she acce","useful":0,"cool":0},"9U44KWpGZTN8XFuDoFDkAg":{"text":"No wait!!! Quick service!!! Better beignets!!! Same atmosphere without the crowds or rush.","useful":0,"cool":0},"LpSw5YmPOU1Ie1O-YLBfGw":{"text":"We picked Cafe Beignet over the usual Cafe du Monde as we were short on time on our way ou","useful":0,"cool":0},"9yjLRSctOj3STDmovXtnKw":{"text":"After trying the beignets at Cafe Du Monde, I had to compare. The place is big with lots o","useful":0,"cool":0},"s1tML7ms03TUbJNJPzq8Yw":{"text":"I have never had beignets before but I knew New Orleans was famous for them so I decided t","useful":0,"cool":0},"UPEZlcahA8OVYGUwjH1SFg":{"text":"We had the beignets(of course), french toast, an iced coffee, and a cafe au lait. Everythi","useful":0,"cool":0},"NqGDIKyrLsHXwP-LroxLaA":{"text":"Love love love this place! The beignet is so crispy and soft & paired perfect with my latt","useful":0,"cool":0},"uFZ_ydAvVYto-3L01nyCow":{"text":"This was a disappointing experience, food was poor, server brought food after it sat on th","useful":0,"cool":0},"gZx0K3vRmirJDqlejeIL_g":{"text":"Good beignets, but I preferred Cafe du Monde. After ordering, it was clear that people com","useful":1,"cool":1},"bKg8pHJSu6vwKjBg4pGdAA":{"text":"I thought this was pretty good. I knew I couldnt come to NOLA without trying beignets but ","useful":0,"cool":0},"p-oroK13k5biIE1nFi5bEw":{"text":"This is a beautiful restaurant that we stumbled upon almost accidentally. We were a party ","useful":3,"cool":3},"8ekMnhqGKq81uy1GYo7rcg":{"text":"Disappointing. Fried donut with powder sugar. Reminded me of carnival food.  The omelets a","useful":0,"cool":0},"0HwH25YhGQx5nEcM-E8f_w":{"text":"I was told that this place has some of the best beignets in NOLA, so I stopped by to check","useful":0,"cool":0},"yHltea_sO8baDGQ761e8Ig":{"text":"I went here because I heard they have Really delicious fresh beignets and the line at Cafe","useful":1,"cool":2},"JdbQI_foKl3Vq-sx7_5T9A":{"text":"Very good placed in New Orleans. \nBut the Café Latte is the worst I have ever had since lo","useful":0,"cool":0},"rjq76OmM6EO6L03I9XOaSQ":{"text":"Pretty tasty and short-lined alternative to Cafe du Monde. Breezy atmosphere, and outstand","useful":0,"cool":0},"8Rw0TV0dN4NKNG88p4tLfw":{"text":"Love this place.  Live music, bar and the freshest beignets.  Great open air seating not f","useful":0,"cool":0},"Ph-uNdUPu_lQ6lM7BSk3Jw":{"text":"I have to say as busy as they were the beignet  were so fluffy, they weren't oily like som","useful":0,"cool":0},"jSZG8z7NHOre3aq23IJXew":{"text":"Huge, delicious Beignets and delicious coffee. Easier to get in and out of then Cafe du Mo","useful":0,"cool":0},"U9pyAgRjvkjCPXMa64aSbQ":{"text":"The live music is a nice touch but the cafe au lait is horrible watered down swill compare","useful":0,"cool":0},"OEzVTy1SxbPY1UnN4-WtRQ":{"text":"We decided to get out for a walk since it was a beautiful start to MDW. The weather was pe","useful":0,"cool":0},"2jyJZ249J8PdgvAl5shttg":{"text":"After not wanting to deal with the Café du Monde line on a weekend, my husband and I wande","useful":0,"cool":0},"_86WWCkDBDNYxSdx5n3MzQ":{"text":"Yummy beignets. Great price at $3.99 for 3 pieces. Love them!  Live jazz music atmosphere.","useful":0,"cool":0},"rHTU4G85AXDTAzLWXBY-ZQ":{"text":"I the land of tourists Cafe Beignet has the best beignets in New Orleans. Yes to some this","useful":1,"cool":1},"eQQ56A_mBf9O1-jWg8Q2UQ":{"text":"I prefer Cafe Beignet over Cafe Du Monde. Why?\n\n- softer, fluffier beignets\n- coffee was l","useful":2,"cool":1},"KARxvNh45gtQMkCQ15mkcA":{"text":"During our cross country trip we stayed about 30 miles from NO and decided to go have brea","useful":0,"cool":0},"nlAkeewU3EtKEqUYhkgfTw":{"text":"beineyaa! first time with a beignet! this place is great. live music, breakfast..  cant be","useful":0,"cool":0},"xF7IzMuL99EVcogtlqQ5tw":{"text":"The beignets at this place absolutely rock. Forget Cafe Du Monde , do yourself a favor and","useful":0,"cool":0},"nqcirYOJBfgEvHtlEqZYEg":{"text":"Meh! That's about all we have to say about Cafe Beignet... meh! It seemed we left with a b","useful":0,"cool":0},"79lx9Ud4Ppf3YwdXbq24mg":{"text":"Ordered the Cajun Hashbrown, but it was SOOOOOOO disappointing.  First the portion was lik","useful":0,"cool":0},"pRRuFW2SUBwNSTzYX78qrg":{"text":"Stopped in for a quick breakfast with my husband. The decor grabs you.. very beautiful.\nWe","useful":3,"cool":2},"g0uy-K7AWOI3m4TRT4lNfw":{"text":"What the hell is up with this place?  \"Best thing to eat\" per Alton Brown? Must have had a","useful":0,"cool":0},"kPmM8ke5pth0CQz_R_qCXw":{"text":"Wasn't crowded, clean, awesome atmosphere. Oh yea and the Beignets were delicious! Wasn't ","useful":0,"cool":0},"nT6wNGReNNcMVpRRuCNrvg":{"text":"The beignets are Hot and fresh yum, great pecan tort as well, fast service with a smile","useful":0,"cool":0},"NomyW_tCmEIHn87UJMM-GA":{"text":"Why did I not bring any extras on the plane ride home?! Well.. to spare myself from lookin","useful":0,"cool":0},"NqVLkGQgUitaUyBDKg_JAw":{"text":"I prefer Cafe Beignet to any other. Their beignets are light and delicious.  Additionally ","useful":0,"cool":0},"fhB3PyQrOiAQHav1X0Wdqg":{"text":"Revisiting one of my childhood memories, we went to Cafe Du Monde. I remember beignets bei","useful":0,"cool":0},"jevJQ4l_iX-Eo5d0Xkae7g":{"text":"I'm sorry. This place was absolutely beautiful...honestly I thought everything was so cute","useful":0,"cool":0},"y2LvnuvxwkMG74sCAp3Hgg":{"text":"For whatever reason we liked the beignet's at this branch location best. They tasted like ","useful":1,"cool":1},"xczimKeS2i6IGlggCPctPg":{"text":"A friend said this Beignet shop was the go to when in NOLA. She said she likes it way more","useful":0,"cool":0},"vTaKQBPR4NPdejPRa0mpRA":{"text":"One of the go to places in NOLA and it doesn't disappoint. Quaint outdoor cafe and very pr","useful":0,"cool":0},"UF0SGq7oPDtrGtJnArX7uQ":{"text":"Great spot in New Orleans.  The cafe was super cute and the beignets were cheap. It was $3","useful":0,"cool":0},"muHRZSWVuWU44bARPn96Kg":{"text":"Can I say 3 1/2 stars ?  Good omelette and hash browns. Great beignets. But hey, you're in","useful":0,"cool":0},"CczojtVO8ktE-EQ-K66ujg":{"text":"Really cool spot in New Orleans. It says Alton Brown claimed this to be the best beignet i","useful":1,"cool":1},"4XoBSo9o0RATKtDT_0WsBA":{"text":"Fast moving lines. Lots of happiness here for all the senses. Especially delicious hot and","useful":0,"cool":0},"LvY8K3bnvNopILOj9ICz0w":{"text":"By far, the best beignet spot in New Orleans. Period.\n\nThe beignets are larger than Cafe d","useful":6,"cool":5},"wrMagCeXBja2seWkZUNjxA":{"text":"Slow service but the place is very nice. The beniegts are delicious and their Irish coffee","useful":0,"cool":0},"YFXQK3hV-zrIefFZ35bERg":{"text":"Hmm. I'm not sold on this place. I just wanted to give it a try to see if Cafe du Monde is","useful":0,"cool":0},"NA7yWtnG2SgbB3qjJb0gdg":{"text":"Crispy and thin beignets. No wait. Good in a pinch if you don't want to wait on line at Ca","useful":0,"cool":0},"Xx-WvwflvEH4tXvXmndFAg":{"text":"What a cute spot! There's plenty of seating (some indoors, and lots outside), a nice littl","useful":0,"cool":0},"e-ojCDOABLh8ZPFh7XTJUA":{"text":"Quite possibly the worst service I've ever had at a restaurant. Disorganized is the best w","useful":1,"cool":1},"HIiS0RXx1zAb0RR2MUvUVw":{"text":"Best beignets better than the Dumonde hype.  They arrived so warm and fluffy and had some ","useful":0,"cool":0},"opE0-uwJ0_jh9RDcGfh52A":{"text":"I have been to cafe du monde before and its good but because it is such a huge attraction ","useful":0,"cool":0},"eR-5y3wyNRA0eezveSz-TA":{"text":"Very good Beignets here and you don't have the long miserable line that Cafe Du Monde has.","useful":0,"cool":0},"TBjhi-oVuPamWUjTAjFQvw":{"text":"MEH! That's how I feel about this place - there's absolutely nothing special or memorably ","useful":0,"cool":0},"dNu8cTE5Dfwyey_2f-M--g":{"text":"There coffee is delicious here but food not very good. The food isn't seasoned or well sea","useful":0,"cool":0},"v7TxcpOfhN1KQL83d4bTEg":{"text":"Came here with nate and had a bengeey and it was fluffy must have just come out of the mic","useful":0,"cool":0},"2hGq6cBxMe3V8wayxgfcuw":{"text":"It was very good. I can't compare their beignets to Cafe Du Monde because the line was too","useful":0,"cool":0},"CLiw5u1FL5_St2dE7LA_Fw":{"text":"We had our first Beignets at the Bourbon Street location.  They had a great live Jazz band","useful":0,"cool":0},"t4tsbJzg4Ve7Rga-BjfZdw":{"text":"Great atmosphere with a live jazz band playing. Ordered a shrimp Po Boy, jambalaya, mufful","useful":0,"cool":0},"k8RexpKKrmpiQRk73NJgjA":{"text":"This location was slammed, but seemed to be moving us along quickly. The cafe au lait was ","useful":0,"cool":0},"DFimdOMizEcbviddwpVcJg":{"text":"One of my first stops when visiting NOLA for the first time was to taste the legendary bei","useful":1,"cool":1},"Ca0R86Ycq8uXTeeBMgH9jw":{"text":"Not really much competition for Cafe Du Monde. We stopped in for breakfast on a Sunday.  P","useful":0,"cool":0},"CiCNuGNdoduZ0bnqDuMA_Q":{"text":"Recommend by one of the city tour guides and then saw Alton Brown had it as one of his fav","useful":0,"cool":0},"4OqhqUxEeQv174YYvxpJIQ":{"text":"Cafe beignet is good but its not Cafe Du Monde. I can't really elaborate on why other than","useful":0,"cool":0},"jGWBkjR23RuwWN5AKm2zsg":{"text":"Wasn't that impressed. Quality of the food was okay. \nI had a better beignet at another sp","useful":0,"cool":0},"FZHu0TPYjBu7fBlpa1XCHQ":{"text":"Came to compare the beignets to my favorite, Cafe Du Monde. \n\nPrice: $3.99 vs $2.75 at Caf","useful":0,"cool":0},"zxDnHJj7GKjXiIX207DZXg":{"text":"Beignets AND atmosphere were better here than at Cafe du Monde. Beignets here were much li","useful":0,"cool":0},"nnePDogdJEgc5iI6Eo6a_Q":{"text":"Amazing breakfast sandwich on a croissant. Very filling & easily shareable. Stuffed with e","useful":0,"cool":0},"2llT5HSl6ZtV6gMNf-3Wrg":{"text":"This line is much shorter than their very famous competitor, but it also moves a lot slowe","useful":0,"cool":0},"wdWhwvG3SOee0LSX10548g":{"text":"The beignets were hot and sugary just like I like them. The line was not long like cafe du","useful":0,"cool":0},"hXd9wH9GGAbQkFz1A-IVRg":{"text":"The place is cute we enjoyed our beignets and coffee! But the staff was horrible, they act","useful":0,"cool":0},"bSqE22JKBuWHT3dDyCk6ng":{"text":"Seriously, better and bigger beingets than at cafe du monde. Same price, but fluffier and ","useful":0,"cool":0},"xXFxKw-cglJ6Bg2cCyK1tA":{"text":"First beignet's for me and my hubby and they were delicious. The were fresh, warm and soft","useful":0,"cool":0},"oZYCLN8vwNSacrhA0cWJbg":{"text":"They serve breakfast here all day & til closing. They have delicious French toast sprinkle","useful":0,"cool":0},"CwBHRNiCZ_mYPzab2b8LNg":{"text":"After seeing the Cafe Dumond line we decided to keep going.. this place was recommended an","useful":0,"cool":0},"lcmGFOoxDUdFecvJdiUQCw":{"text":"Really enjoyed the Crawfish Omelette and of course the Beignets! Cool live jazz as well!","useful":0,"cool":0},"XuQNKaB_LsCAPoHp6qi3mQ":{"text":"Lots of hype before this visit, and I have to say, the beignets are great! I also got the ","useful":0,"cool":0},"HYhryTU565Xh1Qfr8Q9W2Q":{"text":"The beignets are everything Alton Brown said they were!  Fantastic for sure.  Eats like a ","useful":1,"cool":0},"djF2--xrYgyqMyvRwFjsQA":{"text":"Excellent. Better than that famous beignet place that is filthy. This cafe is clean and th","useful":0,"cool":0},"_8Rktw1qD66RtLm7gycqXw":{"text":"LOVED THEIR BEIGNETS. \n\nYes, everybody goes to Cafe du Monde, but here...they're really go","useful":2,"cool":2},"kbXBZnOErSPbUsVN7bvI-A":{"text":"These are the best Beignets! Grab coffee at the French truck then a couple orders of these","useful":0,"cool":0},"f2DO81nvtDxGw8yuDV257g":{"text":"Dropped in here to have a beignet and some coffee. Coffee is not their forte and the beign","useful":0,"cool":0},"A46omgtMOdamBUIFxmShSQ":{"text":"The live jazz performers & the crispy warm beignets coupled with the lovely decor is a dre","useful":0,"cool":0},"RQ7TzyIDtTUGT96WGzNrng":{"text":"Cafe Beignet's beignets were quite tasty.  The line to order was long and it took a while ","useful":0,"cool":0},"vz4fhzJvaflrH8XCFNb52A":{"text":"The staff sucks. Can't speak to the food, since I never received mine and was met with com","useful":0,"cool":0},"hlBFS7fcRmg0gg_p_iucjw":{"text":"Beignets were good! Service was fast and excellent. The western omelette seemed greasy. Th","useful":0,"cool":0},"gKk5N6vdWCG3VIgU95TzLQ":{"text":"Good alternative to cafe du monde when you don't want to wait in line. I was drawn here af","useful":0,"cool":0},"r-fstMd6FQVVViWJEQtLTg":{"text":"Hands down the best beignet in NOLA!\n\nBeignets are one of those things you simply cannot m","useful":0,"cool":0},"FMEVeJzBdIzB9ehNZFq9mA":{"text":"Beignets were good but any other food was terrible . Eggs and grits were tasteless ! I wou","useful":0,"cool":0},"ZYQwhzGcU7-sMgge7aWIuQ":{"text":"We loved the Beignets, they are crispy and have just that perfect amount of powder sugar! ","useful":0,"cool":0},"X2usOOY4d8sVObWyUmX_9g":{"text":"The beignets were pretty delicious but there was more dough inside so it made it a bit mor","useful":1,"cool":1},"oMrl4eq0xfRFLnsPSJu3eQ":{"text":"Very pricey. Beignets are tasty but some of the other shops are much better. Service is sl","useful":0,"cool":0},"QJCjQGMtNpOdAMPp7LkQZg":{"text":"there are exactly 2 things that i ate while in nola a week ago that are on my mind daily. ","useful":0,"cool":1},"tOFukAef-am4CSx6QEMWvQ":{"text":"A place to go if you are hungry for an evening snack or a quick breakfast. Liked their liv","useful":0,"cool":0},"LREWLnTnc66ypbTAQ-Q5Ug":{"text":"Oh yeah! We choose this over the others, because the Uber driver who is originally from NO","useful":0,"cool":0},"SfAqvKKb2f8eyEhiDUEjVw":{"text":"I've been here for breakfast two days in a row now, and while it's been pretty good, I'm a","useful":1,"cool":1},"Q_yJZxtn4ddHVsfBoTPyQg":{"text":"I thought this cafe was super cute. There was live music, an open bar and some cute little","useful":0,"cool":0},"YAlAHQAkS_SCrVN-v9WlOw":{"text":"Ok. So we came to NOLA for a few days for our anniversary. The beignet controversy is stro","useful":0,"cool":0},"2xFMgvJAQ9-0pj7yNZ-nBA":{"text":"Between Cafe Du Mond and Cafe Beignet, I like Cafe Beignet better! Great sized beignet and","useful":0,"cool":0},"WnSLoyxSfGhA3lk9SSsOww":{"text":"Over price beignet and coffee.  The beignet was a k at best and don't get me start with th","useful":0,"cool":0},"xZbvhpJ0mw2xkis9GslJ7Q":{"text":"Great coffee, excellent pecan pie, full bar and live music.  Very lovely dining area, frie","useful":0,"cool":0},"DVyF2jeCfmbU2IMOMMMh7A":{"text":"We each had a breakfast sandwich on a bagel after arriving back from our cruise . This pla","useful":0,"cool":0},"tyNwzlGOMSN4dJnDYcpR1w":{"text":"I love this place. Great music. Open air. Simple food at great prices. Good drinks. Go her","useful":0,"cool":0},"aXUy1QCinOM1del63h6J-w":{"text":"It's hard for me to ever get that excited about a touristy place in the heart of a tourist","useful":0,"cool":0},"L_8mLwN_JskrB7S8XTWjGQ":{"text":"I thought these beignets were much better than the more \"famous \" ones just sown the road ","useful":2,"cool":1},"fRz049z-HJB9U2Ru_X4AFg":{"text":"Beignets were good, giant and fluffy.  Also ordered Jambalaya that was not good.  Took one","useful":0,"cool":1},"l1s24sT7Is-vHPYihxc7Rw":{"text":"Awesome place to chill along with tasty Au Lait, beignet and relaxing jazz. Also a place n","useful":0,"cool":0},"HHxy1mpMBW7fLasl1SlWhA":{"text":"We dropped in for a late bite sandwich.  The food was great, cute little shop, friendly st","useful":0,"cool":0},"QDhKt9Dr-kTSdy0o8i_LKA":{"text":"They always have a band playing!! Really nice touch. This is the second location I've been","useful":0,"cool":0},"UG_U2XhAq69Jpr2iSK7Mhg":{"text":"Yummy, warm, fresh beignets, iced coffee, and live music. Great alternative to Cafe de Mon","useful":0,"cool":0},"4uI2Ul-DCpg_dHLQPxqcHA":{"text":"I appreciated the full bar, I enjoyed a nice mimosa, Cafe du monte has a livelier scene an","useful":0,"cool":0},"kCZnBSluE4l1Qt7Tsheu8A":{"text":"Would recommend coffee & beignets here over Cafe DuMonde. Indoor but open-air. Kind of exp","useful":0,"cool":0},"L11AFXzBwpcT9ih5V1YA_Q":{"text":"On my short visit to New Orleans and the French Quarter, this was my first stop for local ","useful":6,"cool":4},"feVwAZDxrFo_FecGWq7CnA":{"text":"Dirty. Beignets were good. Place was so dirty we could not believe it. One restroom and it","useful":0,"cool":0},"iMKKyAnEO8rf5WBv4ciI7w":{"text":"The help are disinterested and rude. I asked for a specific coffee. Paid $6 and got a blac","useful":0,"cool":0},"cRNuk-lcuyfSqGmxDzt5SQ":{"text":"This is the location to go for beignets in NOLA. The coffee And beignets were much better ","useful":0,"cool":0},"IvQgFRTlWzwsgodWd7yqBw":{"text":"I had the breakfast croissant...it was decent, nothing special but filling. My gf had the ","useful":0,"cool":0},"Rlq_cwuMFGDw8-xS_AyFXQ":{"text":"Ok.  So I did succumb. \nThought I would have a few bites and let it go.  But no.  I ate al","useful":0,"cool":0},"8yVysBpPlW4lIz-bjOQpPA":{"text":"Had the beignets here and they were fairly good and just as good as Cafe Du Monde. My daug","useful":0,"cool":0},"PDPRuxQcO0dTfMN8_CbSfg":{"text":"Disappointing is the only word for the beignets here. Over cooked and doughy on the inside","useful":0,"cool":0},"Y92B195060H7G3iUTILykQ":{"text":"Decent food but a little overpriced for what you get...Just average.  Being in a tourist l","useful":0,"cool":0},"-5FmSlSB8NJIfvPpw1J77A":{"text":"i've had this place a couple times and was happy with their beignets. the coffee is medioc","useful":0,"cool":0},"tXcMwnbvsjRou1tP5wtnUg":{"text":"Wanted a decent breakfast on our last morning vs the continental at the hotel. Ordered gri","useful":0,"cool":0},"DCDh3yEMrdeDVwNmGDaWmg":{"text":"Waited 30 mins to get our beignets while several customers that came in after us received ","useful":0,"cool":0},"5tDSHhVtr-6s85tDLxoUqw":{"text":"Sorry, but not even close to Cafe Du Monde.  You have to add your cream and sugar to your ","useful":1,"cool":1},"zHMjV61AI7JX3I51YDhehQ":{"text":"I want more beignets! But I don't want to wait on line at Cafe DuMonde again. Walked in an","useful":4,"cool":2},"329ssirvFA2wnV4EE_eU4w":{"text":"I stopped here after a walk around the French Quarter for some dinner and beignets. The be","useful":0,"cool":0},"Sl_aE4IA2zJBKT91WUzxvQ":{"text":"Not going to hate on this place but it was meh. It's cash only. You are only able to buy c","useful":0,"cool":0},"HUkusrynGKGz2UnFPjZPQg":{"text":"This was possibly the best beignet I've ever had . They are hands down better than cafe du","useful":1,"cool":0},"thAhnGwYod8oapF8owfh9Q":{"text":"I want to just put this out there; Alton Brown (Food Network) has tried both, and prefers ","useful":0,"cool":0},"e_Rjxay6XsGoZSOnsC5YIQ":{"text":"It is worth a stop in the morning for a coffee and a beignets. On holiday weekends there w","useful":0,"cool":0},"f9WH_IJT6AcAZWpQPf9LTg":{"text":"We sat in the patio on Bourbon, grabbed a muffin on Royal and actually tried the beignets ","useful":1,"cool":0},"bwoOwnEV9CHXJGwHW1pq5A":{"text":"Doesn't beat cafe du monde.\n\nThey weren't bad, but not as great as the first batch I had a","useful":0,"cool":0},"wL1W4I1jL4GeP3HyfFFgXw":{"text":"Turkey sandwich on a croissant was so delicious. A simple beyond basic sandwich was pure g","useful":0,"cool":0},"36-zxFQpqkjM_QPzwEpd7A":{"text":"In the battle of best beignet (between Cafe du Monde and Cafe Beignet), I have to give it ","useful":0,"cool":0},"xt3UyRdDSygGi-DxC9xjLA":{"text":"best beignets every! way better than cafe du monde.  this place is so pretty, open, friend","useful":2,"cool":2},"J4jCz9QgQRldOnt372KGag":{"text":"The food was amazing. But the customer service sucks. Don't know if I want to pay $50 for ","useful":0,"cool":0},"56_lq1yl1Mh7cenj1bS3mA":{"text":"4 stars for the beignets. We only got the beignets just for comparison to Cafe Du Monde's.","useful":0,"cool":0},"KSrQMPgfTdzBFNa1gPpnzw":{"text":"I would trade my soul for these w a cup of cafe ole. Maybe my first born or my dog. Both a","useful":0,"cool":0},"kf6yCkB4DlHWugWiJD76pw":{"text":"Player piano like damn water torture- program it to TURN OFF every few minutes for 10 minu","useful":0,"cool":0},"w75RWvbBozY9zF3rMAxk2A":{"text":"Overpriced, underserved very noisy and uncomfortable. You can find what they at much bette","useful":0,"cool":0},"HGw-best0bNK304i1fWXOA":{"text":"The beignets and gumbo really hit the spot. It's just down the street from Cafe du Monde a","useful":0,"cool":0},"FZVQcUMX77o4WOP2BbBmXQ":{"text":"Yummm! Seriously New Orleans style food! People know the food is good so line gets long...","useful":1,"cool":1},"0cx4Twb_DNFA7s9R_kJzFA":{"text":"Horrible experience. I would not recommend anyone go and try this place out. pathetic serv","useful":0,"cool":0},"Qf2FUjSTOawo9MQo8aRTuA":{"text":"Beignets and NOLO just go together - and while most consider Cafe Du Monde the go to, we d","useful":0,"cool":0},"TH8SrUtawRcdc6lEaDWWIQ":{"text":"My fiancé liked their beignets better than Cafe Du Monde because they were softer. I loved","useful":0,"cool":0},"kHFLTYOmOfqFgl2i6VyWbA":{"text":"Clean and cute cafe with what some say are the best beignets in the French Quarter, withou","useful":0,"cool":0},"_fuFRUuDUTOhPqEi3MKwhA":{"text":"Come here instead of waiting in the crazy line at Cafe Du Monde. Delicious beignets and li","useful":0,"cool":0},"ON0NK9zdyJEA70D1MnQ5ww":{"text":"Only went for beignets, to compare to cafe du monde. These are more doughy and more like a","useful":0,"cool":0},"FIrDVBjH5wfVt4XN27AcjA":{"text":"I loved the Beignets here! I honestly didn't feel like waiting in line for Cafe Du Monde (","useful":0,"cool":0},"KWB4YKWN4gI3UR255PNW1A":{"text":"The beignets were delightful. Better than C du M and less crowded, plus air conditioning! ","useful":0,"cool":0},"dawvp1av17bW42pnj8eJMA":{"text":"Went here for brunch. I had the breakfast sandwich and Carmel aulait. Delicious,,, my frie","useful":0,"cool":0},"GP6TuQ8M8fa0yU4WDqp4dQ":{"text":"Love Cafe Beignet.  We had Beignet from there 3 times.  Once in Cafe  DuMonde.  The Beigne","useful":0,"cool":0},"Zd_xUIPTR28euZXEvrk_3Q":{"text":"Don't go here for a meal unless you want to be really underwhelmed. Great atmosphere medio","useful":0,"cool":0},"GvgjVrE5uyalBPVDsjUd2A":{"text":"Line moved quickly.  Young lady behind counter VERY pleasant and helpful! Young man cleani","useful":0,"cool":0},"dglA_p6EZRZ0dEVfjpwvvg":{"text":"This place is NOT WORTH IT save your money for something better. We stopped In for a quick","useful":0,"cool":0},"X6yg775mUC743UxksBgQiw":{"text":"This cafe was a great find during my recent trip to New Orleans! Instead of waiting in the","useful":0,"cool":0},"oal-g46iqlOm2zw17R6IKQ":{"text":"We had eaten at cafe du monde on previous trips to New Orleans and the lines there were ho","useful":0,"cool":0},"_y7HaOVo58TiGEuZc1wFWA":{"text":"Good beignets if you don't have to wait but dirty tables and floors as well as outdoors. W","useful":0,"cool":0},"cwU-cyS5EwnC0w4pta0kfw":{"text":"We wanted to compare this place with cafe du monde ! And this one beat it !!!! The beignet","useful":1,"cool":0},"mzimns3TLxwTxDSMYHGIqg":{"text":"Great location for people watching. Beignets were similar to CDM, maybe a little lighter i","useful":0,"cool":0},"Fkl_pjJptlylrOOLjNutnQ":{"text":"Stood in line for 40min on a Saturday morning. We wanted to have breakfast but also have s","useful":0,"cool":0},"20oCRW3eZXiU0ylgQ38aaA":{"text":"No point in waiting in the ridiculous line at that really popular beignet place. These bei","useful":0,"cool":0},"YHnErxJgXQg29ZSEADYOYA":{"text":"The food was wonderful I recommend the southern plate or the the cajun hash browns. They o","useful":0,"cool":0},"qLMFH5zNLKpoVAqcVXRj_g":{"text":"Th four stars is just for the beignets. It was our very first Beignet ever in New Orleans ","useful":0,"cool":0},"WgdpWP4f2y_iaV3YToKXrw":{"text":"AMAZING BEIGNETS!! Period. You got 3 for $3 and it's such a cute spot to listen to live mu","useful":1,"cool":1},"kakLDnHculwrHNs4AWT7KA":{"text":"Since we were in NOLA we decided we had to try a classic beignet. Of course the obvious ch","useful":2,"cool":2},"g9eAjJTRCd0XpFbWR67Cqg":{"text":"BETTER than the beignet at Cafe Du Monde. There, I said it. \n\nAlthough I'm not crazy about","useful":3,"cool":0},"vb3SRnFVMeIFMFKwWJgnCw":{"text":"Better beignet and more fresh than cafe du monde. Has breakfast menu all day. Nice italian","useful":0,"cool":0},"QCUHYz5ghZQlX1xv_W5Jng":{"text":"I'm not sure why Cafe du monde is the \"go-to\" place for beignets in New Orleans! We stoppe","useful":1,"cool":0},"BdsXoXcH8XIVMGMh34ffSg":{"text":"Came on a Saturday for brunch. Had the Chicken Conti on a Croissant, bacon egg and cheese ","useful":0,"cool":0},"FHcKkJrhbZ7SlHPXbUKhcA":{"text":"I love the layout of the cafe, very open and you get a great view of the street.  Love the","useful":0,"cool":0},"T_C7UXco7nsIl1mgoHGvQA":{"text":"Cafe Beignet has the best coffee and Beignets in all of New Orleans. The Hazelnut Cafe Au ","useful":0,"cool":0},"lHvne9VuN1D2nKCtzEKQ-g":{"text":"Easy acc ed ss to the strip, and a really good place to grab a bite when in a hurry...plus","useful":0,"cool":0},"vfd4KnMNgw0kwVpJp-AhXg":{"text":"Open air cafe style while eating inside. Service is very slow. Birds flying among the tabl","useful":1,"cool":0},"lDk30OpTeaNAT1CmPamTLQ":{"text":"I ordered hot chocolate and beignets. The beignets were fluffier than Cafe Du Monde. The b","useful":0,"cool":0},"JdjeONHmkVXS9FedJKNHqg":{"text":"This place was closest to our hotel and we came in for a frozen coffee and some beignets.\n","useful":0,"cool":0},"z4nh8qS3d9LjromwF1e73g":{"text":"We absolutely loved cafe beignet! Such a cute, cozy atmosphere and great food for breakfas","useful":0,"cool":0},"1r54ytq0hHwoy86TKTiSMQ":{"text":"Food was very bad. I ordered the creole hash browns and my husband had the red beans and r","useful":0,"cool":0},"_OE00S4fQVQHuFcsGZudiQ":{"text":"On the way back from Woldenberg Park, my son wanted to try the beignets here. We waited in","useful":0,"cool":0},"UfmkPiV21MHXYa_1Z2QdeA":{"text":"We came here couple of times. I liked their beignets alot. I preferred them over Cafe du M","useful":0,"cool":0},"wgIs1utCoTsStngAUK0xOw":{"text":"Only good thing I had here was the coffee! The beignets were greasy and hard. Definitely n","useful":0,"cool":0},"2NT-ZShJ7L94PFJ2dhE2Ig":{"text":"It was great. Wasn't a big fan of the beignets. They're service was okay. They kind of act","useful":0,"cool":0},"kOK37V5e3rynp_oBlaj7jA":{"text":"The beignets were out of this world amazing! They came out HOT! The live music was amazing","useful":0,"cool":0},"I8Yczld3syDG_fc42hU9iQ":{"text":"First things first .... THE BEIGNETS HERE ARE DELICIOUS.... SERIOUSLY !!! If you are looki","useful":0,"cool":0},"o7oZxWc1pTsvIqb4dx-tDg":{"text":"Great Hot with a little crisp Beinets! Super cheap too... 3 huge pieces for only $3.99... ","useful":0,"cool":0},"EECJwTQcNZFqpS08r6Ab4Q":{"text":"I visited the Cafe Beignet on Royal Street and loved the beignets there. I thought about t","useful":0,"cool":0},"38zbQZC1imqWsUisTO8v1g":{"text":"As much as we love Cafe Du Monde (the super popular beignet place), we wanted to give othe","useful":1,"cool":1},"CzBDDgebz78j5sC4Hpaw2w":{"text":"Excellent cafe that serves great beignets with a lot of sugar. I came into the restraunt t","useful":1,"cool":1},"kkQ2MlmjVeOiNGvRQ_uepA":{"text":"Delicious beignets, good chickory coffee (if you're into that), nice atmosphere, live musi","useful":0,"cool":0},"FYmm-H-yMvoIUxX-FfMXYA":{"text":"Love the beignets here! Prefer them ten times the beignets at Cafe Du Monde. They absolute","useful":0,"cool":0},"Df7HRu-HWxmJGsphNgGi1g":{"text":"We've walked past Cafe Beignet at least once a day for the last five days and decided to g","useful":0,"cool":0},"wFzVyZWHEt66QkAAH0jm4A":{"text":"Our hotel concierge recommended this place and we are so delighted we took his advice. Our","useful":0,"cool":0},"07jahVSVdif9o6ZI82JvbQ":{"text":"Bad customer service. Didn't great or smile. Ordered a banana nut muffin; it was incredibl","useful":0,"cool":0},"QA1YoX_Jl8kAI-KBgLN4Sg":{"text":"Go to central grocery if you want a Muffelletta, \n2 coffes, 2 muffeletas, and a key lime p","useful":0,"cool":0},"r8vTcKb5GqabGgkROA-OXQ":{"text":"Inadvertently arriving a mere two minutes prior to their closing, they prepared fresh beig","useful":0,"cool":0},"3ZVK41fgtmF0mZNw_WusuQ":{"text":"I really wanted to give it five stars but the service here was horrible and I really don't","useful":0,"cool":0},"Jr5XflEhVNVCXSH26FldKA":{"text":"I prefer this place over Cafe Du Monde. The beignets are softer on the inside and just tas","useful":0,"cool":0},"Luij40lBf4QoD8_KfdWrBA":{"text":"Enjoyed the patio seating with a nice iced coffee and the beignets. Careful on a windy day","useful":0,"cool":0},"PQ_ZsXRjfknNDUdN1PeP8w":{"text":"Beignets were delicious, food was not.\nCajun hash browns were very salty and stale, garlic","useful":0,"cool":0},"M86nOmt2lmL_tsvpDh_6Mw":{"text":"Came here to try the beignets since there were reviewers that prefer this to cafe do monde","useful":1,"cool":1},"MG-_9cOBJK2WFBFcgYfxvg":{"text":"So my friend and I were visiting from CT & heard we must try beignets when I'm NOLA. At ar","useful":1,"cool":0},"iE7JxKVJfqWSg2VIquJy8A":{"text":"I visited this location around four to five times during my visit to New Orleans. I had a ","useful":0,"cool":0},"T2h6bIkXAd2GC_KCdhaocA":{"text":"I'm sorry, but I left disappointed after going to Cafe du Monde so many times! We got the ","useful":2,"cool":1},"cqOYaxut8xsllTfM81l3dA":{"text":"I've heard mixed reviews from friends about the beignets here, from being meh to being pro","useful":6,"cool":6},"zPV4cbniYgBtR7xO-g0tJA":{"text":"This review is based on their beignets and coffee. The famous Cafe du Monde's beignets had","useful":0,"cool":0},"qqq4WwfaCpER4uy0EbMpWg":{"text":"Super clean. Felt beignets were much better than the competition. Much more friendly staff","useful":0,"cool":0},"WRjX8mQRf-7sr9ZzluUspA":{"text":"Until now, I've been very loyal to Café du Monde.  On our initial visit to Nawlins a few y","useful":0,"cool":0},"M0mg82jlwsrvgTm8bY-LOQ":{"text":"I felt the beignets here gave Cafe Du Monde a run for its money! While not nearly as popul","useful":0,"cool":0},"tHrkl3p6dhfVsqtWj_U4Sw":{"text":"The atmosphere is beautiful, very open and they open the windows and doors on a lot of day","useful":0,"cool":0},"aJvpgHbdYb-AWTgB_ICcbA":{"text":"Very slow and inefficient.  Waited over 35 minutes for 2 orders of beignets. Also, signifi","useful":0,"cool":0},"kpUBZEKwGTY0DEZrXvI4kA":{"text":"So, so many people ask \"which beignet is better, Cafe Beignet or Cafe du Monde?\"  My answe","useful":0,"cool":0},"dn1WsBLcCFj3lzfh4GdFCw":{"text":"Beignets were fresh made not sitting and waiting like the popular place we all hear about.","useful":0,"cool":0},"2XBcmCiiTYBrZIphW-jysg":{"text":"Food is good, the cashier was nice, but talked to a customer in front of me about how she ","useful":0,"cool":0},"7jJncX9h2XTJ2G9UMTwrxg":{"text":"Excellent taste. Decent service.  Perfect atmosphere.\n\nI went to this location instead of ","useful":1,"cool":0},"fcLmtUmmFQ-FhEHe6-pFsQ":{"text":"Soft, warm, fluffy, amazing g.  The beignets melt in your mouth.  Service was great, and I","useful":0,"cool":0},"8nPT99aQWdq72llHtPwAqA":{"text":"Randomly visited this place yesterday and I have not one regret! Initially I was headed to","useful":0,"cool":0},"mKxze4KBhUgpQ3hK2KH4IA":{"text":"Visited Cafe Beignet to try the beignets as we were strapped for time and did not want to ","useful":0,"cool":0},"ogZVbqvv4eJIeWzOfoQ-1g":{"text":"Really good vibe and ambiance. Within walking distance of Jackson Square and the riverfron","useful":0,"cool":0},"QNPTjkQcfiT7SiWBAIYi8g":{"text":"The waiters and waitresses are very friendly. Love their auto-playing piano and love jazz ","useful":0,"cool":0},"MKdVApogfji0FuvnDRuSkg":{"text":"Great atmosphere! Had delicious beignets while listening to jazz. There was a line but it ","useful":0,"cool":0},"BpBfT70MxC32hJgYAt5LxQ":{"text":"Great music.  Worst employees I've ever run into.  The girl behind the counter was super a","useful":0,"cool":0},"iH6vj4yEQ3-ZPfttXqelaw":{"text":"I seriously would have moved into this location if that had been possible! The beignets ta","useful":0,"cool":0},"xqAUTCg3tqWLsXIyer-gOA":{"text":"Beignets were delicious and exactly what you think they would taste like. Light and fluffy","useful":0,"cool":0},"iTi1i_6bvI24jFgLTyNzQQ":{"text":"BEST BEIGNETS I'VE EVER HAD! The beignets are light, crunchy, sweet (but not overwhelmingl","useful":1,"cool":1},"0XAMGxJ2QQ9z5qnzM0cVaA":{"text":"AMAZING!!\nThe line was soooooo long at Cafe Du Monde so we tried \nCafe Beignet and we were","useful":0,"cool":0},"RqRNlJMttwbfoC4ZUIaWpA":{"text":"This is a nice cafe with a trio playing crooner classics when we were there. The service w","useful":0,"cool":0},"eLxQjr3AMlyxfZ97Wb30DQ":{"text":"The beignets were good and that was about it. I went for breakfast and there was hardly an","useful":0,"cool":0},"tq8lA0BTuoO6uPvVtV7xLQ":{"text":"We loved the beignets - warm and fresh and delicious. Also had some sandwiches which were ","useful":0,"cool":0},"PdR8F_OeE45YizWMyvbJWA":{"text":"This is a cute little cafe located on the Mississippi River front, inside the Jax Brewery.","useful":0,"cool":0},"_i5AA9eREpqE1ttuwgK0kg":{"text":"It's in a nice part of town, service is a little slow but definitely a far better alternat","useful":0,"cool":0},"sRtT0yNyRNwwOqDRxLUZBQ":{"text":"Excellent beignets!  Compared to the Cafe du Monde in the mall, these are much better and ","useful":0,"cool":0},"TSFjxRGzAjz0H11Q9F4d8g":{"text":"Great beignet. Coffee was unbearable. \nDefinitely not part of my standard. \nI will definit","useful":0,"cool":2},"A_2rqhSYkRQe7ILxX4XsdA":{"text":"This place was my fave! Huge great tasting where \"the other place\" was smaller and a littl","useful":1,"cool":1},"oKtlQN0z5AK4n60kcRUspQ":{"text":"The beignets are pretty standard. My friends & I ended up here because we didn't want to w","useful":0,"cool":0},"JTae4RILRjR-zahm22E_qw":{"text":"Full disclosure, this was my first beignet. And it seems like there is a little bit of wha","useful":1,"cool":1},"XIA55LmYnjILeQeSztbGWw":{"text":"Came here after  grayline tour. I wanted to try this place wince cafe du monde was a let d","useful":1,"cool":0},"PiVMyXqYUOQo7Gv8QD8TJw":{"text":"After a horrid experience of waiting, rude staff, filthy table and never getting served at","useful":0,"cool":0},"JtyNLwsNJoafgr3snQJauQ":{"text":"While in New Orleans everyone talks about how you need to eat beignets.\n\nWell our trip was","useful":4,"cool":3},"Z3bdzYDvLKoSZvrk2v-9nA":{"text":"Before I left NYC, my boss said I HAVE to try the Beignet's, as it was staple of NOLA and ","useful":0,"cool":0},"gce50hWUiE7eD7LNPhE9bQ":{"text":"I can see how Cafe Beignet is a sure bet for those looking for beignets. It's right up the","useful":3,"cool":3},"w8RygyfEQ7MWvHaKtdh8CQ":{"text":"Had to try cafe beignet and compare it to cafe du monde when you're on a mission to try be","useful":0,"cool":0},"BUP52jn2T89yPBk79j8XgA":{"text":"Well it's not cafe du mined but it's close enough :).  The beignets were fresh and good an","useful":0,"cool":0},"-SkS6n0HRNeGd_gyNPLUcA":{"text":"Beignets were fresh made not sitting and waiting like the popular place we all hear about.","useful":0,"cool":0},"sjKSfidUN4z7GNf2-AMbQQ":{"text":"Cute cafe but doesn't warrant the hoopla. The beignets are not as good as cafe du monde.  ","useful":1,"cool":0},"fb0Ocd4GPaEkrwU86kDilw":{"text":"Well we ordered to go\nGot back to our room & thought the orders were wrong & missing fruit","useful":1,"cool":0},"3cck0BZgYT8tqG0CisRkvA":{"text":"Delicious piping-hot pockets of goodness.\n\nWhile the line at Cafe du Monde was ridiculousl","useful":0,"cool":0},"2tv43eN0OERN2GfX_w6tDg":{"text":"Well it is not as good as the other beignet place in NOLA. We were waiting on the Easter P","useful":1,"cool":0},"LkdKMp_cjk6eAxyz85YGfg":{"text":"This was our first time at this new location on Decatur St.  The open air seating and the ","useful":0,"cool":0},"0qweXWnrKd-gSvh8YUyudA":{"text":"I'm between a 3 and 4 star rating here. Enjoyed my beignets and drinks, but the service co","useful":1,"cool":0},"OrFQgA0D5CcwZiikPYt6AQ":{"text":"This restaurant has the worst customer service. We waited for two orders of beignets for n","useful":0,"cool":0},"CNLlg7A3-YVvavibTAh18g":{"text":"I have to give this place 5 stars because their beignets are much better than Cafe DuMonds","useful":0,"cool":0},"YTg70_1YkyXK-f86UoDN8w":{"text":"I love the beignet here. Breakfast was good. The room feels like I was eating here 100 yea","useful":0,"cool":0},"l3jJ9y0Hb0q-xwqbxPLmXQ":{"text":"The family and I went here after driving all night from Florida just for Cafe Du Monde. We","useful":0,"cool":0},"SME4e5NIYWx4wXQzvwFvgw":{"text":"Definitely liked these beignets more than I expected! I haven't been to Cafe du Monde so c","useful":0,"cool":0},"kgQVA55IhMynA6QVOzEEdQ":{"text":"I think they have the best beignet in town. I really love their beignet and their latte. I","useful":0,"cool":0},"LV3yBVqUazVsynxyW0OcxA":{"text":"Nice spot, but with the proximity of Cafe du Monde, they only stand a chance if it is extr","useful":0,"cool":0},"GE7OP5GTW1HpqTV-7o7viw":{"text":"Food was delicious... great beignets! Guy who brought our food out was fantastic and court","useful":0,"cool":0},"a7GoloD8wSRnn0-OEvXUSQ":{"text":"Definitely preferred these beignets than cafe Du monde.  These beignets were pillowy soft ","useful":0,"cool":0},"MaMi7e03n-C8bQ1-WGtwZQ":{"text":"Ordered 3 beignets for $5. The price isn't bad and the beignets came out hot and fresh. Bu","useful":0,"cool":2},"1lKhD6QeZ5ClvvFhH-ACmw":{"text":"Remembering the Cafe Beignet at another location, we knew this had to be part of our beign","useful":8,"cool":7},"kjNCSOrNeT0TU-OMeU3mpw":{"text":"Cafe Beignet offered quick breakfast and service of Breakfast sandwich and 3 beignets with","useful":0,"cool":0},"AuBnS6AkVpJwgOSQQ9gOTw":{"text":"The music was perfect. The coffee was yummy. The beignets Are so good.  They have a full b","useful":0,"cool":0},"Cffo_LGoeaJfEbzzu_IFoA":{"text":"This place was so cute and the beignets were fantastic. Right by the Mississippi river. So","useful":0,"cool":0},"3AD0RWW9fdOIgv1aAmPPkQ":{"text":"Loved that they have decaf iced coffee. I am very sensitive to caffeine and trying to find","useful":0,"cool":0},"Aj5vVgQ3qH2MSskREo-B6w":{"text":"I'm thinking this place is better than cafe du Monde  Beignets are bigger and fresher...Th","useful":0,"cool":0},"mpa8MJzQ6shY2QfMts1omA":{"text":"The girl at the counter has a pretty serious attitude.. not what I would have representimg","useful":0,"cool":0},"P-u59wK2wWOU_q1w8bJgMQ":{"text":"This place is nice.  The seating is annoying, as they have 50 tables that are tiny and bar","useful":0,"cool":0},"xYSq5nSHuoivdVMnAXxcmw":{"text":"Lovely French styled cafe.  I adore the open air dining al fresco. I could really apprecia","useful":0,"cool":1},"XOWAzLiZtCgyLs52jIebrw":{"text":"I personally thought this was more crispy and less dense that du Monde plus way nicer serv","useful":0,"cool":0},"WJHwm8Dv0tVP8v15sUgFyg":{"text":"Coffee was crappy and super overpriced  beignet was ok but nothing special. Ambience isn't","useful":0,"cool":0},"4nrdUZXBonOWOIs02obd8w":{"text":"Cafe Beignet is such a cute cafe. I love the ambiance here. There wasn't a line and plenty","useful":2,"cool":0},"DcO7m0WUBiNa0w-DU9qijQ":{"text":"There beignets were better than Cafe du Monde in my opinion. Very tightly packed, drinks o","useful":0,"cool":0},"jRfafwqC-jEqKoOUvtIDLA":{"text":"Overall a really fun and wonderful experience! The food is a bit expensive, which honestly","useful":0,"cool":0},"HxB2R6cYAF4CY8LC3uClmQ":{"text":"Came for the beignets, but stayed for the music! Everyone knows when they come to New Orle","useful":2,"cool":2},"IltTqKaA7BYydRcTjLQ_nQ":{"text":"Starting from bad attitude just to ask for changing the type of coffee -while ordering the","useful":0,"cool":0},"GGuaraPgH9IH-iKBGB7AAw":{"text":"3.5 stars\n\nJust landed in nola and experienced the beignets at other place as lunch. Decid","useful":0,"cool":0},"GnP7Tq81gkuTAJtNp4ncWA":{"text":"Didn't even think of reading reviews prior to selecting where to purchase beignets. Southe","useful":0,"cool":0},"yJlxltq26NgO70aRv8v-Ew":{"text":"Here for Essences Fest, However this morning my SO, her best friend and myself took a swam","useful":0,"cool":0},"C08jeS85s3yq9ejHtiZy1A":{"text":"Very average breakfast.  I know it's known for its beignets but went for typical breakfast","useful":0,"cool":0},"Kiltlbe9c160ao4CcDULuQ":{"text":"We love that they are on Decatur now.. we don't have to walk for miles now.. we love these","useful":0,"cool":0},"Vp28RzU1Ue_3xoHs5m1bLQ":{"text":"Great beignets made fresh to order! 3 for about $4. Yelp told my Vegan friend that they ha","useful":1,"cool":0},"lWWnN7U6amOauC9-VxKULw":{"text":"Omg sooooooo delicious! Had to stop here one more time before catching my flight. Beignets","useful":0,"cool":0},"_rr-dsTZHCvx9kV2fzv58w":{"text":"This place was super busy. I recommend if you get beignets to do one order unless you are ","useful":1,"cool":1},"kqLIfVv-3OIcFluC27-50A":{"text":"Didn't even think of ready reviews prior to selecting where to purchase beignets. Southern","useful":0,"cool":0},"14MUdCMCkHwxxFmfYzcTmw":{"text":"Never thought I'd say this, but I like the beignets here better than Du Monde's. They're l","useful":1,"cool":0},"qfCzW4BjvIlvO3dFKuLJqQ":{"text":"Visited Cafe Beignet while in New Orleans and I hate to say this but the beignets were not","useful":0,"cool":0},"4ccGMdMRdjD1l-isIbSgDg":{"text":"Good beignets (but not as good as cafe du monde). Really took stars away for terrible serv","useful":0,"cool":0},"POnfL-Jm_wutPhsV580I-g":{"text":"It was a lovely experience. They served hot and fresh beignets while I sat at a white tabl","useful":0,"cool":0},"XxcDPfTdwvlqEQGI8VN9Tg":{"text":"Coffee is ok. Beignets are ok. Breakfast is your typical eggs and bacon and grits that do ","useful":1,"cool":0},"3_rAK-A1C5wd8YIpmz-wGA":{"text":"If you're not wanting to line up during the day for Cafe Du Monde, Cafe Beignet is a great","useful":0,"cool":0},"-tNcIlQdYQM1R59I7xofog":{"text":"This little cafe was packed, but the line moves fast. By the time we finished ordering, a ","useful":0,"cool":0},"Kd3pvA6NasunRLSvc7UaBA":{"text":"The beignet was delicious, but the bartender was absolutely the star of this place. She ma","useful":0,"cool":0},"b8shChnVrLc5OQtNAb_Peg":{"text":"We decided to come to this restaurant while waiting for the busses to go to a nearby swamp","useful":0,"cool":0},"QpVgtby2h5fRpPBv0hDGYA":{"text":"FIVE TIMES. We were here for 4 days and we came here 5 times! The other cafe beignets in t","useful":3,"cool":2},"vgkNTBtdL3F6qe8UP2xqGQ":{"text":"Always busy. Get here early or super late.. otherwise go to a different location. Beignets","useful":0,"cool":0},"VnD9goZWXlJM6dEuoKC36Q":{"text":"In the debate between Café Beignet and Café du Monde, the jury is not out yet. The Beignet","useful":0,"cool":0},"7gDxBGjsa1_N1aYPIshc-A":{"text":"Great location, good coffee, lousy service.  Ordered 2 sandwiches and an order of beignets","useful":0,"cool":0},"qxIcvZNJpp15ayWqyhjAlw":{"text":"Drink are good, very basic to New Orleans. The bartender was friendly. We waited in line a","useful":1,"cool":0},"52Eot4tcCDCymvWxdLQTOg":{"text":"Stopped off for alittle snack before bed.\n\nHad pecan pie, beignet and coffee.  \n\nLine was ","useful":0,"cool":1},"CZRusfYfjgZe8m3_m4LvDw":{"text":"Got my order wrong and encountered a very rude/unprofessional staff. Ordered a Cajun hash ","useful":0,"cool":0},"7NcV-grOtJjSj_ksQlfVtQ":{"text":"No air conditioner, no one clean the table, chairs are full of sugar. The worst part is Th","useful":0,"cool":0},"9Cx9MpcSDEkVUrWrEgG6IQ":{"text":"So I thought I would have beignets from that \"other\" beignet place, you know, the one with","useful":1,"cool":0},"hTfTAwWQm35n61d2rCpyRQ":{"text":"Nice music.  Rude service staff. Nothing to get too excited about re beignets. 2 visits ye","useful":1,"cool":0},"gDGi9wTgqLtEa9-ET1hZdg":{"text":"Best. Beignets. Ever.\nIf you are visiting New Orleans this cafe is a must! Between the fre","useful":0,"cool":0},"2ki67UuKm6D5uTpvsobiSw":{"text":"Fresh hot beignets with a sweet tea that was super sweet! Super messy but worth every bite","useful":0,"cool":0},"4vvk1u7ForR-M0VXwhEnqA":{"text":"Way better than cafe du Monde. Shorter line. Better selections. Far better tasting beignet","useful":0,"cool":0},"oaj4sAEDc6PTx11LPZcgJg":{"text":"Everyone who visits New Orleans knows where Cafe Du Monde is. What they don't tell you is ","useful":1,"cool":1},"kRn1cdl3U3c5brxIINz-SA":{"text":"After taking the first bite I sighed. It was a contented sigh. A 'I've been searching my w","useful":8,"cool":7},"lfeLQDGcJoODNPs95whXeA":{"text":"First of all, Cafe Beignet is so much fun to say, right? Cafe Beignet! I love it!\n\nI wante","useful":13,"cool":10},"t80ffFd87FGKzk5bNeeB4w":{"text":"Cafe at with coffee and Beignets. The Beignets come with enough powered sugar to OD on. Th","useful":1,"cool":0},"O4JMLg9W4HsnWXnYDKbZkA":{"text":"This line is much shorter than Cafe Du Monde, but it also moves a heck of a lot slower! We","useful":3,"cool":0},"KnBjc9Q60VK_T4O_XyIMlQ":{"text":"The wait was absolutely absurd. Seriously, at 2 pm on a Monday, it's 30+ minutes to get an","useful":0,"cool":0},"qd5VntpHCsc0xMXlA3bjvg":{"text":"Absolutely delicious and completely worth the little line that was there. It has its momen","useful":0,"cool":0},"p8Ihc4JJkN6ghGCrGNcNiw":{"text":"Tried beignets for the first time and am sad I don't live closer to have them more often. ","useful":0,"cool":0},"Zd9oAXsbLsBym7uz_QJV8w":{"text":"Beignets are good but be ready to invest over an hour of your time between standing in the","useful":0,"cool":0},"SY3QxYD-G2iHjJEFR9cVYg":{"text":"Had a take out order that the manager personally brought out. Beingets were very good.  Ex","useful":0,"cool":0},"hgSfN53IKYHQ_cWg9sn2jQ":{"text":"Came here for a late breakfast and my husband asked the cashier \"Hi! How are you\nToday?\" A","useful":0,"cool":0},"vjqH_VVdDet3nBTOPcEplA":{"text":"Meh to the experience. The wait is ridiculous. I know that is to be expected but still dis","useful":1,"cool":0},"q2XIjxGWPhnQ2J89bCZOIQ":{"text":"Came here after a disappointing experience at Cafe Du Monde and I'm glad I did. I apprecia","useful":0,"cool":0},"PIZnGBsyiuwdxLaUhEXS2Q":{"text":"4 stars for food, 0 stars for service.  Waited an hour for one order of beignet which were","useful":0,"cool":0},"uuVvSdQYqe_WSW6PmcRiKQ":{"text":"Yum yum!! First of all they have beer on tap so we stopped here for an afternoon pick-me-u","useful":0,"cool":0},"bZuYVnnM4AlzKkWkrBjnEA":{"text":"Probably wouldn't come here again. Counter help was rude.  Seating was bad (we visited aft","useful":0,"cool":0},"c_-bzEXN-iSpz2y_Ddel2A":{"text":"Too much hype. GO TO LORETTAS PRALINES . For the best beignets !!! I'm from Cali and was d","useful":0,"cool":0},"GsgFc1MuABk05_bgWNui4A":{"text":"Decent looking place and decent beignets\nThe place is so commercialized that it feels like","useful":0,"cool":0},"00yFzv3jl0v1pyjhoNUU8A":{"text":"Cute tourist place. It has that Main Street disneyland feel with a piano playing magically","useful":1,"cool":1},"ouDeBUQeSiY9JOpf0zGPZQ":{"text":"Why does this place have fewer stars then Du Monde? I don't understand. The BEST part of m","useful":0,"cool":0},"ebV78bBCRKoH2ikFdrMdwg":{"text":"The battle of beignets has raged on in this city for quite some time and I am not new to t","useful":4,"cool":4},"cdXex-VjZ0zf1IH-OFTJ4g":{"text":"Be prepared to set aside some time for a long wait. The slow service is due to understaffi","useful":0,"cool":0},"-cbWDrVd0aJN7pQrQNrysA":{"text":"Great place for beignets. Probably my favorite in the area as they are made after you orde","useful":0,"cool":0},"uDjHSB0p5TtOxn4RDVhHVA":{"text":"How can these be the best beignets anywhere?! They were overly fried (probably refried) an","useful":0,"cool":0},"DUEqQGfnNdw31XH3TxXJhA":{"text":"This place may have shorter lines than cafe du monde... but it is not worth your time. We ","useful":0,"cool":0},"diOYdq7qe3003VpBgl3oxQ":{"text":"We stopped by here the other night but too full to eat anything. There was live music and ","useful":1,"cool":0},"KnYJkrXQzvrdaME4f_XQCg":{"text":"The service here is horrendous.The manager looked pissed at the world and the bartender ha","useful":1,"cool":0},"vmfyR0HBUq3yCeF4Ro-dSA":{"text":"The service here is not the best. Granted the employees are nice and politics, however exp","useful":0,"cool":0},"6Lopdu6jeRGUViuKzmmWUQ":{"text":"Always a must visit when visiting  New Orleans, piping hot powdered sugar covered beignets","useful":0,"cool":0},"vQ7Or2f8XD9BPlHK1Rjrtw":{"text":"This place is cleaner, newer, and has a better vibe than cafe du monde. But cafe du monde ","useful":0,"cool":0},"2NNbcmlsDsjDRLD3G-zoMA":{"text":"This place looked promising.  My friend asked for an iced coffee and after waiting 15 minu","useful":1,"cool":0},"hbKgAkUOgbPgX0kTY_O8Xg":{"text":"This place was right across the street from the hotel that we were staying in so needless ","useful":0,"cool":0},"GWf4vaoWGxIW8WuDvACp6A":{"text":"SO MUCH BETTER THAN CAFE DUMONDE! WE TRIED BOTH!\n\nSooo nice. I saw some people say that th","useful":0,"cool":0},"8TsRvN7itZgWAyZYOIb2EA":{"text":"My 1st try of a beignet. It was definitely a savory experience. No lines or crowds to deal","useful":0,"cool":0},"j7gXuQJJ4f8HlW3MdFPSfg":{"text":"I visited this cafe during my stay in New Orleans earlier this month. My review is based o","useful":1,"cool":0},"e6udFBreVZouEnAGuxd25w":{"text":"Great experience. So much better the cafe du monde without the crowds. Got an eclair and s","useful":1,"cool":1},"TqAjOFK3HrdFDZ8BS4uBpA":{"text":"So, trying beignets is every tourist responsibility! Feeling such pressure our first stop ","useful":0,"cool":0},"CN8goJy1VDpEliNU5dlqSg":{"text":"Worst drinks ever - loaded with sugar - and when we wasted 30$ they don't even have the co","useful":0,"cool":0},"xq2U2enmB73Ssai2DOH58Q":{"text":"I might get attacked for saying this--and I apologize in advance!--but the beignets here j","useful":4,"cool":3},"hbM_un4dVeFR24cEdB1bmw":{"text":"Looking for a place the serves BEIGNETS & then some... Well you've found it!!!!  On the co","useful":15,"cool":14},"zd9Hs7-Yxw0uv6zeN4zQew":{"text":"Fun! Definitely a New Orleans thing to do; however don't mistake this place for a breakfas","useful":0,"cool":0},"sFAg5hkmYlo426840TBsiA":{"text":"As a first time visitor to New Orleans, everyone says stay away from Cafe du Monde, so fin","useful":0,"cool":0},"-hFINN2gz8V_SALDc_rBJQ":{"text":"The beignets were much better here than at Cafe Du Monde and it was much less crowded. The","useful":2,"cool":1},"623q8HavitrJRkUep-3yjg":{"text":"There's another famous cafe down the road from Cafe Beignet that is a little more known by","useful":2,"cool":2},"xVgeVwffjAYkyF8rnz08JQ":{"text":"This was one of my favorite places we went in New Orleans. The coffee was phenomenal. We o","useful":0,"cool":0},"6XlRljnRFw2Qhb-K_pyy7Q":{"text":"The servings were kinda small. I was not filled up. The grits were kind of bland but the c","useful":0,"cool":0},"GFputav6kCV0s51QTaO3hw":{"text":"I'm sure the wait staff here are fine individuals. The rank and file workers of this estab","useful":0,"cool":0},"zH7rjckqN2-39DVyvgtWmg":{"text":"Cafe Beignet on Decatur is where I had my first beignets. Being from Southern California, ","useful":0,"cool":0},"ir43ZkoiZlaeTnge95_LvA":{"text":"Worst service ever! Sat down at the bar and wasn't greeted or service for over 20 min. I h","useful":2,"cool":0},"ETwidlOrDV0Amg-OC6k0aQ":{"text":"Was good very busy small omelette eggs cooked perfectly grits very watery no coffee refill","useful":0,"cool":0},"t0q4SDQ5Sy6eLLgk2m4fMg":{"text":"Cafe Beignet is very popular in the French Quarter with lines out the door and every table","useful":2,"cool":1},"_DlXCKsE5yp1tRmj0ROb0A":{"text":"Tried my first ever Beignet here and they were lovely. The place itself is basic. One time","useful":0,"cool":0},"-V03tI6xjEuJRX-IENwAPg":{"text":"I don't understand the good reviews, but taste is subjective. The line did not move quickl","useful":0,"cool":0},"s-nEn996S3E68jSrXXabnA":{"text":"Beignets and music are great. Place is clean and people are friendly. Much better vibe and","useful":0,"cool":0},"bI5aNqZF8pZQWd5r0aETLA":{"text":"I've tried Café Du Monde and I must say that this cafés beignets aren't as excellent as th","useful":6,"cool":5},"WhDBbHSLy_P5aAZzFfX7WQ":{"text":"If you can't get into the more famous beignet place down the road, this place sells them t","useful":10,"cool":11},"oBPTH49Bh9iVK9Divy9p7w":{"text":"Absolutely delicious beignets and very strong drinks lol. There was live music while we sa","useful":0,"cool":0},"HFYx804eM7CVazmCqOiiQg":{"text":"Worst breakfast I've ever had. It came out wrong, cold and in a to-go container. It was th","useful":0,"cool":0},"KjfeaOViLk1bthQnwk1RyQ":{"text":"If I had to choose between Cafe Beignet and Cafe Du Monde, Cafe Beignet takes the win!\n\nCa","useful":2,"cool":0},"mGoPgzMOwNkT0RWALnUD_Q":{"text":"Dare we say that we actually enjoyed the beignets here more than Cafe Du Monde?  The beign","useful":8,"cool":6},"ITsaArdIKqtKPfaUl-BAEA":{"text":"Not bad but not great. We only ordered 1 order of the beignets and it took forever to come","useful":0,"cool":0},"6EVhaVS7zV-Wgq31BKUb4w":{"text":"Clean and authentic. We ate traditional breakfast here. Cajun hash browns were good. Omele","useful":0,"cool":0},"e3n9_6ItmYHp1_SCXm3WWQ":{"text":"I don't know if we hit this place at the perfect time on a Thursday evening, or if we got ","useful":0,"cool":0},"GbYg188ePfr6A0i5CP36pg":{"text":"What a welcome to NO ..The beignets are hot and tasty here...I love the location right by ","useful":0,"cool":0},"H95YFqLKP-04qOkz_IuHyg":{"text":"Beignets are soooo much better here! The texture of the dough is soft and fluffy and hot a","useful":0,"cool":0},"pcqfCQDDU44vnfhUGAAKQA":{"text":"Visited Cafe Beignet on September 28 during the busy morning hours. The line was out the d","useful":0,"cool":0},"4kafSeKwbPlr5qy9tBcwcw":{"text":"The music. The beignets. Mark. What a lovely gent you all have behind the bar. I'll come b","useful":0,"cool":0},"k0kFKLGIa0Wb7Suy9CNHTQ":{"text":"My date insisted that we try beignets while in New Orleans, so we stopped at Cafe Beignet ","useful":0,"cool":0},"rAqGUkq6KKSq58j3ChBlTQ":{"text":"Cute and busy café with yummy beignets. Nice for a quick sweet treat. They have a pretty o","useful":0,"cool":0},"bSkyvcg3jUB3kOfiH1Vv9g":{"text":"A lot of people is getting coffee and \"beignets\" in this place. Beignets, which is pretty ","useful":0,"cool":0},"P_B9o-e7eZeS4ChpmL7LmA":{"text":"Waited 45 minutes for a cheap plate of buffet quality eggs and potatoes. The beignets are ","useful":0,"cool":0},"QlWPFmWrWY2t6UUbrSiATg":{"text":"So glad we left Cafe Dumond\n\nWe left that other place when the rude service became too muc","useful":0,"cool":0},"cX9FYyIbt4FVJOZ327iGQQ":{"text":"Waited an hour for 2 orders of beignets. Asked a server to check on our order. He told us ","useful":0,"cool":0},"LOCmZcykFeJJmrp9i4x8Qw":{"text":"Decent music, lady at counter was a bit unhelpful but server/cook was super nice.  Breakfa","useful":0,"cool":0},"pkUBvE4a8hi7-54SmOCjuw":{"text":"Cafe du Monde is a bit overrated. You can get amazing beignets at Cafe Beignet! Café au la","useful":1,"cool":2},"pl5qRkYKVvHuI_XfyszkFw":{"text":"There were two lines of around fifty people trying to get into Cafe du Mond.  So, we went ","useful":0,"cool":0},"VNiZAE3xo73_Mqaa5ER3ww":{"text":"Too much time waiting, the food is not bad if you don't have a problem eating your plate c","useful":0,"cool":0},"CxRX8vew05YOolyoAJhI6A":{"text":"Consistently good beignets and coffee.  Great crowd watching while you eat and usually ent","useful":0,"cool":0},"evUKxdhytQkzV_lPacPpnA":{"text":"I promise this place is just as good as Cafe Du Monde and we didn't have to look for a tab","useful":1,"cool":0},"yz-Mj7QRcRRLgi_B9cednw":{"text":"This was not good. We paid $21 for a subpar greasy bagel sandwich and moldy fruit. The lad","useful":0,"cool":0},"dn8ZIiaVc3tGA50fQJPjPQ":{"text":"Best beignets in town. Not that I want to start a feud, but I preferred theirs to Café du ","useful":0,"cool":0},"XSm3RhxbWlNTWoR9GlE-YA":{"text":"Food was good and the price wasn't bad. Service was quick and live music is always a plus.","useful":0,"cool":0},"v4QwJ_z7SwC3JVnjPk_pwA":{"text":"Well if you are wanting an amazing Beignet then this is definitely a place to stop by. I h","useful":5,"cool":4},"07nJaaNMMlJ3ePiEFHGd4A":{"text":"Philly has Pat's vs. Geno's, but the fabled match-up of New Orleans is Cafe du Monde vs. C","useful":1,"cool":3},"lLcNXk_8fb0cw055oLo61g":{"text":"AMAZING beignets. So warm and delicious. Fun atmosphere. Amazing live jazz music. THIS is ","useful":1,"cool":1},"yuVtrVeGxfxRk2dhskxr9g":{"text":"What can I say that hasn't already been said??? Awesome coffee, perfect beignets, and wond","useful":0,"cool":2},"VC6x6VPueXV4Wtwu4YBmvg":{"text":"Probably the worst veggie burger I've ever had! Not only was it mushy, tasteless and serve","useful":0,"cool":0},"6ljpBChn0BoTM8Y6X5yOaQ":{"text":"Easily the best beignets in New Orleans, no matter what Cafe Du Monde will tell you. The l","useful":0,"cool":1},"MnHGvGijKtfyJ80ODcW8FA":{"text":"Live music from various artists, and provides sandwiches, waffles, omelettes, coffee, some","useful":0,"cool":0},"ot6BVxXHNRPnJbW3P1wXIg":{"text":"We came here after having cafe dumond  Beignets. We wanted a comparison. \n\nStraight up it'","useful":2,"cool":0},"Vm5bhxKbKSbr2A-mSdAugw":{"text":"Rude staff ruins any dining experience. Everyone acted annoyed at being asked any question","useful":0,"cool":0},"bKdc_g0HoqUphs7CbrOCLA":{"text":"I, Bianca Beasley, with a sadden heart as a local, I experienced a bad racial experience a","useful":1,"cool":0},"hwGm80A3oG9Ail7tcoHZnA":{"text":"delightful! Line was out the door (~40 min wait) but was worth it for that powerful goodne","useful":0,"cool":0},"fl1sRhlcUHDZvKGW4FclfQ":{"text":"This was an awesome place to go to get coffee and some beignets!! You order at the counter","useful":0,"cool":0},"7ZuFm0Bi-nEs-aW2CdhwEQ":{"text":"I went here on my last day and had a great little breakfast. 3 huge beignets for $3.99 I c","useful":1,"cool":0},"VTYzC32NG9aIZvn0xqGoww":{"text":"This place does not know how to make its namesake specialty. Beignets are supposed to be f","useful":0,"cool":0},"InrzQgroF0STRCNbCJ-F8w":{"text":"We ate here 2 times. \n\nFirst time the beignets were not very good 3stars and then next tim","useful":1,"cool":1},"PMXN1HvEB69udPxnAOtGVQ":{"text":"Beautiful cafe. Awesome place for pictures. The service was meh.  But the beignets were de","useful":0,"cool":3},"LnQ3x2_2RZp3yuwI6GtS8Q":{"text":"Cafe Beignet is a great place to go if you want a good breakfast. Their beignets are a bit","useful":5,"cool":3},"oO9oRIRuQKKFO1QdnkrGMA":{"text":"I loved the atmosphere of this place! They had someone playing jazz music in the corner.  ","useful":3,"cool":4},"bglQcYyDpzQitXzZZ1wTMA":{"text":"A cool little cafe. The interior is lovely. The staff are friendly. A decent menu with a g","useful":1,"cool":1},"VQ-S5P1M9-lsmuvj-c0iyQ":{"text":"Great location for beignets and other food options to choose from. The lines is not so lon","useful":0,"cool":0},"N8AC12NIt4GJKCyE3yN8WQ":{"text":"Stopped in for some coffee and beignets and was not disappointed by our selections. The fr","useful":0,"cool":0},"76dm4qBha5ROUqUJOCvvMg":{"text":"Want a beignet? Yeah, you know where to go (*cough* Du Monde *cough*), but wait! There is ","useful":12,"cool":11},"4me1VbL2OXm6s1zGZniSyw":{"text":"Cafe Beignet is busy and in a prime spot and that is where much good to say about it ends.","useful":1,"cool":0},"EGxrPw7EO2sSDPD92CADuQ":{"text":"Busy, busy, busy! That's what you get in a tourist district though, so no complaints. The ","useful":0,"cool":0},"tA2lT4PEW8Dg24ul8R4TRA":{"text":"I have to say this place is way better than the one in the Riverwalk Outlet Mall. The food","useful":0,"cool":0},"BK064OSEhWXh8gVjUjxQ1Q":{"text":"Every morning I walked about 1/2 mile to this quaint cafe. Coffee and a Beignet ! Fast and","useful":0,"cool":0},"u879Q51RIWPPyr2HhqJRSg":{"text":"Very poor management. Told us to leave while in line before closing. Literally standing in","useful":0,"cool":0},"r2eGhVPmMSMc41u8Hsjr3g":{"text":"Listen up - Cafe Du Monde is waaay overrated. THESE ARE THE BEIGNETS TO GET. Trust in Alto","useful":0,"cool":0},"vi6WxEeRavtLl2fsA73I4g":{"text":"This place is not worth the stop. The so called manager was very unprofessional, and the f","useful":1,"cool":0},"sUAahtKdEMFvZHFD_wgnww":{"text":"1/4/20\nCame here due to several people's recommendations and so glad I was able to do so. ","useful":2,"cool":0},"chYkK3n8lXlVVk9jad_HcA":{"text":"I will preface this review by saying, I only had coffee(s) and beignets at Cafe Beignet. W","useful":1,"cool":0},"m_lDjxw2rJubrkwdgTWxfQ":{"text":"We came a second time and the beignets were fluffier and in my opinion, better than cafe d","useful":2,"cool":0},"GGKij3miK1Eq4btMJKlq0A":{"text":"Ok so I discovered that I don't actually like beignets LOL...but that isn't this charming ","useful":0,"cool":0},"cMAdNmNUH8pvvZBUOkVyaA":{"text":"Convenient location, had to get our Beignet and Chickory coffee fix. Service was a little ","useful":0,"cool":0},"dnvzih8Yg0_P7YqxFWQ7Cw":{"text":"Well-lit and with beautiful decor, this cafe had spacious seating that was COVID-friendly.","useful":0,"cool":0},"naYGgiOki0Kg3AGOQeBHjA":{"text":"The beignets here as of yet are my favorite. They sort of remind me of a funnel cake witho","useful":2,"cool":3},"THY1qX2RLAWHcdo-iBSPRw":{"text":"I'll start with the negative to get it out of the way. The chicks behind the counter were ","useful":0,"cool":0},"eDRYd_I-cgqtPyC1ttazpQ":{"text":"As many others are saying the workers are rude and not welcoming at all. You have to hunt ","useful":0,"cool":0},"uhsYM2ROVu2OwAIvRvdLPg":{"text":"The best beignets in NO!! Don't even waste your time on the other places! We tried them an","useful":0,"cool":0},"oEM4jCewucttlgk5NP8xow":{"text":"Beautiful presentation, and wonderful service. My mom was the one who recommended this pla","useful":2,"cool":1},"1ult_BuewdV4E6LJ6muoVQ":{"text":"The beignet's here are way better than Cafe Du Monde. They're crispy, not too oily, and li","useful":0,"cool":0},"qNHYp6YxI4BWLrM6wuoheQ":{"text":"I wanted some beignets and the other place had a line way too long. This establishment had","useful":0,"cool":0},"EhxOLHqORxX0m8UajsF0RA":{"text":"On a recent trip to New Orleans, my sister and I stumbled upon this charming cafe. We walk","useful":0,"cool":0},"CpRTh-hmrZ6r_c17TZAEdA":{"text":"Never actually tried the beignets here, but we loved the Cajun Bloody Mary. Perfectly spic","useful":1,"cool":0},"strhTRZBg_9gmIxEOUJt_w":{"text":"Surprisingly pretty good beignets.....\n\nBut the gumbo not good nothing special I would sug","useful":2,"cool":0},"IuMj3fO-TrVm9G5Pu2Ycwg":{"text":"If you can't wait in line at Cafe Du Monde check out Cafe Beignet. It's about a dollar mor","useful":0,"cool":0},"4dcqhfc7p5G6aNi72b4KtA":{"text":"Súper bueno, no tenías pensando comer aquí pero fue tremenda elección toda la comida estuv","useful":0,"cool":0},"sYA0RWyIMbVvIe369H-7uw":{"text":"Great Beignets!! The other sandwiches and fare are good, but not outstanding. But the beig","useful":0,"cool":0},"x9BJJrnqfEmWf8RbQUqgHg":{"text":"Just stopped for a cup of coffee and a pastry.  By far the worst coffee I have ever had.  ","useful":0,"cool":0},"jFDCAKPkwl07bFi2TIBdFA":{"text":"Beignet...done that. If you haven't had a beignet in New Orleans, do yourself a favor and ","useful":2,"cool":2},"2zWGF8kvi2c2Gz7U9B9NAQ":{"text":"$9 for cold french toast and 3 chunks of melon.  Only gave 2 stars because it was clean an","useful":0,"cool":0},"FLIwh3_J2BvGtPdDqC9MRw":{"text":"This place is at a perfect location and is a beautiful restaurant. Now, when it comes to t","useful":3,"cool":0},"GqZ9qqf4jBYdHAwjYFq5nw":{"text":"Perfect break between walking the quarter and drinking several beverages. Crispy, light, s","useful":0,"cool":1},"r-WKn0x6PqykAAcDukrlag":{"text":"If you like hot beignets loaded with powdered sugar this is the place to go. They were  ho","useful":0,"cool":0},"b3l8JKBNd1wiLGtvhkWAaQ":{"text":"Stephanie is the absolute BEST!! She's patient, friendly, and has gone above and beyond bo","useful":0,"cool":1},"-4gqKEGvqZiHxAO2cbLCug":{"text":"DO NOT eat here. Holy shit this food was terrible. Probably the worst food I've ever had, ","useful":0,"cool":0},"jEJtKciO2AYtWplxG1v7cw":{"text":"This was the place for breakfast in our first morning at NOLA. We were walking down French","useful":0,"cool":0},"xNt6xcj6Z0O10qeTigDv0Q":{"text":"This was the first place we stopped. We've never had Beignets before and just wanted to tr","useful":0,"cool":0},"e90YThnf9SsO3gHMfLjZjA":{"text":"Don't waste your time and money here. \n1. Rude cashier- asked what was in a particular dis","useful":0,"cool":0},"Dx3eJ1Gqmxo4JfPxoic94A":{"text":"Beignet were sooooo good! Tbh, I like them better here than  Cafe Du Monde. Although both ","useful":0,"cool":0},"s50x00MJwQMp8XlgOB-9KA":{"text":"I ordered a small order of beignets after visiting du monde for comparison. These beignets","useful":1,"cool":0},"jJ1_q0Q60Sg0uOEF8IFIPQ":{"text":"As the name states Beignet. So rather than stand in the mile long line down the street we ","useful":1,"cool":0},"qT97P9IldEf-MiACxoofVQ":{"text":"Terrible service!  The woman making drinks was handling ingredients with her bare hands an","useful":4,"cool":1},"hrs3zwxp4KozdorbojM3sg":{"text":"Came here to compare the beignets and cafe au lait to the Cafe Du Monde nearby. This resta","useful":1,"cool":0},"-Nqy0AogMnZJtSZYJzHrDg":{"text":"Beautiful location spacious big windows very nice views , everything delicious, outstandin","useful":1,"cool":0},"xQYulBVuicV3dS1Invyc5g":{"text":"The worst staff and food with no flavor. Coffee was worst then airline coffee. French toas","useful":1,"cool":0},"JdhrUIP-wWMgZo8-KQ6BYA":{"text":"The gumbo and the mango frozen drink was delicious and refreshing!! The ladies working the","useful":0,"cool":0},"XfgEPSX-hr86TawJ-hIkdA":{"text":"Save your money. \nMy husband and I went to this place and a toddler could have made better","useful":0,"cool":0},"_JMs99ou5_-jhWlbLGxhLQ":{"text":"Cute spot next to preservation hall; grab a snack when you're in line. We came here becaus","useful":0,"cool":0},"kpQVWEZ8ZPQ70FsO7H42wg":{"text":"The omelettes were fantastic but the beignets were just okay.  The process to order and be","useful":0,"cool":0},"BuQpCQIFq1srJQQe5wvoLg":{"text":"I might get tarred and feathered for saying this, but I think that Cafe Beignet was better","useful":0,"cool":0},"j0QT0HxrDUirZBXePuLaRA":{"text":"Beig-YAYS or whatever they said  to end a great Mardi Gras weekend I had to stop and get t","useful":0,"cool":0},"3wr14M4i_fCqBnVUn4Q7Lg":{"text":"Really enjoyed breakfast here this morning.  We had the breakfast croissant sandwich and a","useful":0,"cool":0},"bnB5wTqvrZ2KD23nXte8fA":{"text":"If you order anything other than Beignets, you've been warned.\n We've been here an hour no","useful":0,"cool":0},"oCrKhYViCks87awvUrCEEw":{"text":"Definitely worth wait so expect that unless you get there early...once inside if you choos","useful":1,"cool":1},"4Eb4LCRgwLI0KmHyKFwRVg":{"text":"When visiting New Orleans you MUST eat Beignets.\n And Cafe Beignet DID NOT DISAPPOINT. My ","useful":2,"cool":0},"ci3iXuf8PMxhEdXqSAwicA":{"text":"Went there in the afternoon and the line was long due to understaffing. One cashier and sh","useful":0,"cool":0},"NASLi_umRfC-JDfYuuiclQ":{"text":"Anthony Bourdain was right! Hands down their Beignets are the best in New Orleans! Makes C","useful":1,"cool":1},"chd68bOz6ei41lOv9lBtPA":{"text":"What a great spot to have breakfast! It did take a while to get through the line to order ","useful":0,"cool":0},"sUkbliV2BTVj3FsDCgkLfw":{"text":"Dropped in here to eat something before our steam boat tour. It is within walking distance","useful":5,"cool":2},"EAvqenAkYMIfcijxcGFClQ":{"text":"Exceptionally average. Which shoooould warrant a 3/5 but due to the fact that this place i","useful":1,"cool":1},"TbhdCM7Gx-9bRoWY-gFa0A":{"text":"Food was good and reasonably priced for what you get. Only complaint is the mimosa is almo","useful":0,"cool":0},"UVanNSy0mCEBGuXGsD5Tmw":{"text":"Coffee was dark and not sweet. Jambalaya here tastes like beef jerky & was dry as the Saha","useful":0,"cool":0},"6zyn1QQkBHlXCzGFCS1Www":{"text":"This Cafe Beignet location is in tourist central of New Orleans. With that said, it can be","useful":1,"cool":0},"UKO-pmoVmvYvY53Dv1JW6A":{"text":"we love it here. Their beignets are delicious!! Love their coffee drinks & drinks at the b","useful":0,"cool":0},"GOLxgCqsD9bM5zwRPxoO-A":{"text":"A local tour guide told us Cafe Beignet had the best beignets in town.... she was right!  ","useful":0,"cool":0},"RLSaxWCAMNzUxbuvy8xhfA":{"text":"The beignet is good, but the line waiting for order is too long, after ordered, you need t","useful":0,"cool":0},"VWSeW55UXWQm2wly4rM0EA":{"text":"I ordered the andouille sausage omelette and it was soooo delicious! I don't ever eat omel","useful":0,"cool":0},"beK4YGTGpW1B4UtBOWHSeg":{"text":"The beignets are absurdly good, crispy on the outside and fluffy on the inside. Not overpo","useful":0,"cool":0},"ndxZh0iWd-Dka-EqH96Zjg":{"text":"Quick stop for iced hazelnut coffee. Made the drink super quick & it's amazing! Love that ","useful":0,"cool":0},"qff8yYInhTqSWXxBRZep6A":{"text":"Got up early and excited to try this place out. Got there early enough that there were bar","useful":0,"cool":0},"OVXsUdIdlwUR14__zVQR6g":{"text":"WAY better than Cafe du Monde way fresher beignets. also their live music is fantasic","useful":0,"cool":0},"ZLwujPyKLzv3zH6AmZa0lQ":{"text":"The line wasn't too long, moved quickly. Loved the atmosphere and the quaint wrought iron ","useful":0,"cool":0},"PjTKIdJHqctcSPDuqFn8Iw":{"text":"I really love this place mostly for daily live music from 2pm to 10pm - what a treat. They","useful":1,"cool":0},"M5LK-fW4yIL7P0WSoFoFrg":{"text":"So after seeing the hellacious line at Cafe Du Monde, we decided to go for a short walk an","useful":0,"cool":0},"NyzAEJlhrcoJpuAAVhsUEA":{"text":"I was told this place was better than cafe du monde and less crowded as well. I will agree","useful":1,"cool":1},"Uri__-Mfnj35UqutqI7Fbw":{"text":"We have a new home in New Orleans for beignets- specifically the one on Decatur across fro","useful":0,"cool":0},"ucpxy93_7aHZRV3CDes_Mg":{"text":"Unfortunately...terrible experience.  First, I was accused of trying to \"steal\" when attem","useful":0,"cool":0},"aTudXyKCFXIk0ej0m9-LQQ":{"text":"The food was delicious! Very thankful they took cards and I was able to eat some beignets ","useful":0,"cool":0},"GP1162lHOlE58UGkXmJ04w":{"text":"I prefer Cafe Beignet over Cafe Du Monde. Personal preference. I love the cafe AU-lait and","useful":0,"cool":0},"I-Z4A3bxqSHoB2356udJPg":{"text":"Today's adventure in NOLA was to try the top three beignet locations as per my daughter's ","useful":0,"cool":0},"4U4g9tfflvS6ZgLWCPVb5w":{"text":"We came here to compare the beignet's between Cafe Beignet and Cafe du Monde. First off, t","useful":0,"cool":0},"ToD3ou-iq3oTVKaodJ4_YQ":{"text":"Nice place. Good service.\nI really liked the hashbrowns.\nIt felt like a had a huge breakfa","useful":1,"cool":0},"W9GSgQ2wmdIx-YAEDWhpGw":{"text":"Best beignet experience with zero of the line hassle.","useful":0,"cool":0},"XFHqCak7CQ-Yi-cAK5ox2g":{"text":"On our first trip to New Orleans we had to try the famous beignets. When we first walked i","useful":1,"cool":0},"BrhGPvEQ7Tu4EW1Lv1WPvw":{"text":"So on September 23rd, I had the worst experience I've had in New Orleans. So far I've met ","useful":0,"cool":0},"3-YGus9DXKkbG-ASi8U65w":{"text":"Great food! The bacon egg and cheese breakfast sandwich was really an omelette on the bage","useful":0,"cool":0},"P2AgGX54mFE5j1oqXS1Vmw":{"text":"Small portions & small tables. The place itself takes proper Covid precautions. It's all o","useful":1,"cool":0},"VmsiS9MdK4GoCzrS5_92jg":{"text":"Decent music, but sat over 20 minutes waiting on food while everyone else was getting seve","useful":1,"cool":0},"n9krkMQr1pRDdMfAb9ISYw":{"text":"The beignets are amazing! Dare I say better than cafe du monde. They are huge, hot as hell","useful":0,"cool":0},"V4vW3sDIF6UzAr6yY_lbYg":{"text":"We decided to stop here instead of the place everyone else goes to and were very happy we ","useful":1,"cool":1},"mpb0iIdUQCj8Z6qZ4qAUDQ":{"text":"I wanted beignets, and the \"other \" place had a huge line. I'm SO glad we went. I ended up","useful":1,"cool":0},"iDgVWUMo1AxxZenNPxgV_A":{"text":"Okay, so I've been on a mission to find the best beignets in the French Quarter while I've","useful":3,"cool":1},"MGHax2A1fu_Xu_rXnFLCdA":{"text":"Had a muffaleta and it was delicious.  My wife enjoyed her ham and cheese as well. The bei","useful":1,"cool":0},"DDFBOch6ozUEUgy_GtX1Aw":{"text":"My first choice was Cafe Du Monde but the line had a 2 hour wait so I opted to go to Cafe ","useful":0,"cool":0},"66X6sjHfZct_lSx5uckBvg":{"text":"Friends and I went to this cafe for their beignets while we were visiting Mew Orleans and ","useful":0,"cool":0},"U_G5DWp9SiEDN1efdKlfog":{"text":"Worth the trip. Welcoming staff and atmosphere even with the sidewalk drilling outside. Wi","useful":0,"cool":0},"2xCCAMlBpdjk7R8q7yIpxQ":{"text":"We had a bad experience with an employee but I'm updating my review because the manager co","useful":2,"cool":2},"xxcQRwNznt6AeyIiIkbiqg":{"text":"Great beignets! I love The other place too! But these are different. Just as good! We had ","useful":0,"cool":0},"lECa2m2iwApt12rCXjD2_w":{"text":"We got off our morning flight to MSY and made our way to the riverwalk location on Decatur","useful":0,"cool":0},"Yxw3oZltF-vyhSFsJmmKxw":{"text":"This review is only for the beignets. This past week was my first time in New Orleans, so ","useful":1,"cool":0},"zYFr2xMUEjtVSTm3mUvLMw":{"text":"I can't believe I forgot to review I stop every time I'm in NO it's a southern staple. I c","useful":43,"cool":39},"KcOVjVa_a0ndO-29DsDnbQ":{"text":"I don't have enough words to describe this place. I love beignets they have. I love the at","useful":0,"cool":0},"tNz7hTVT6-xj3ZPSKN3hjQ":{"text":"As regulars at Cafe Du Monde, we wanted to try something different this time. Soon realize","useful":0,"cool":0},"K5L2ip6NTknujD0Uz5AXKA":{"text":"Super cute cafe, very picturesque. They loved our dogs! And we could bring them inside. Th","useful":1,"cool":0},"aGzcGZ8BpRfc5jXySMggiQ":{"text":"One of my favorite restaurants in the Quarter. The staff is so friendly - even when touris","useful":2,"cool":1},"h2WztZCB86NaXxEYVFXqEg":{"text":"I tried cafe du monde first, then came here the next day for the beignets to compare. I ac","useful":0,"cool":0},"jiG8AwYyCLL5cFU9anxQHg":{"text":"The doors were wide open at 755 so we walked in and attempted to start an order. The cashi","useful":0,"cool":0},"jmu5WoVg07jOJ41gcnzVFA":{"text":"Beignets are gold. I found theirs to be fluffier (and yeast-ier) that Cafe du Monde, and p","useful":0,"cool":0},"gP-u2YvLl_hiXsOp3Av2SA":{"text":"Worst customer service ever! Employees were all miserable as if they hated their job. The ","useful":1,"cool":0},"YP9fti0ExalmS8_9wf0-Eg":{"text":"Went to the bourbon street location.  No lines,  life music and great beignets. Also good ","useful":1,"cool":0},"JVGm49R_EXjDelMxJ03g4Q":{"text":"The building, inside and out is super cute, the architecture and location is spot on for N","useful":0,"cool":0},"d50AAlRRSEmdbDh4YAvVaA":{"text":"This is the place to try since Cafe du Monde usually has a line wrapped around the buildin","useful":0,"cool":0},"olTyMClHcS6sulQo6x2eNw":{"text":"The absolute worst excuse for a roast beef poboy I have ever seen.  4 bites and I was fini","useful":0,"cool":0},"u3HmcyK0bLyUGZsWzffbTA":{"text":"The live music the quick and friendly service the atmosphere all flowed together. The Beig","useful":0,"cool":0},"Gv33C6JpdM235ZHMRJXAlQ":{"text":"Best beignets and cafe au lait around! Beignets were hot and fresh. Cafe au lait was very ","useful":0,"cool":0},"-vJpWRt1m8tzkiNS9e2Khw":{"text":"I ordered the breakfast croissant to-go. The bread was chewy/hard and the eggs, cheese, an","useful":0,"cool":0},"Q9hGILLgVb0Mp18Msxv3fw":{"text":"Of course everyone recommends Cafe du Monde but that's always busy.  The only issue I have","useful":2,"cool":2},"FKNy6RKh1SD6Vm-_hTk8kA":{"text":"Visiting from California. Beignets were on my bucket list of things to eat here. This plac","useful":1,"cool":1},"4-NtwHecnriGAocu1upKUA":{"text":"Takes for-e-ver to order and seemed like longer to get our food! There were two of us. I o","useful":1,"cool":0},"ztZnBIVo1ErwFB1AGBWTJg":{"text":"Lovely atmosphere. Adhering to Covid-19 guidelines which was GREAT! Ordered beignets and h","useful":1,"cool":0},"SDqqZN02JLqUM3tPbNO2cw":{"text":"Much better than Cafe DuMonde!!! Donuts seem more fresh and carefully made. The cafe is at","useful":0,"cool":0},"-hJDvfxUDszRRnw1_MIuwQ":{"text":"To settle the debate between Beignet and du Monde, I honestly didn't feel an immediate pre","useful":2,"cool":2},"gBiR06MpToim5vBfhzGwzg":{"text":"Having been to the Cafe Beignets near Bourbon Street earlier this week, we were looking fo","useful":2,"cool":1},"iXaybiz80xdvGz5O2BIYwg":{"text":"Our least favorit beignet experience NOLA.  The staff could have cared less about our expe","useful":2,"cool":0},"FtYKbw1ACf003S8C8vA4ew":{"text":"The customer service is horrible. They are slow and \"unbothered\" by it. They are not skill","useful":0,"cool":0},"wvlh2t0Sla5baeu2odKYoA":{"text":"I'm not a beignet expert but we tried out 3 different beignet places and Cafe Beignet won ","useful":0,"cool":0},"vnKtKSnmNfigq2VrUGyKFg":{"text":"It was a nice location. The beignets were bigger and fluffier than Cafe Du Monde, but I li","useful":2,"cool":2},"pgORCLVLZYlw3eJGBPmsdA":{"text":"My daughter wanted to go here after seeing reviews about the yummy iced coffee. Unfortunat","useful":0,"cool":0},"5IKy9RPjsS-fA1qiZTLFAA":{"text":"Walked into this place expecting to just have some local beignets with a good spirit.  Bei","useful":0,"cool":0},"TigKHSBKNRZe569o_YnUXg":{"text":"Homemade is definitely better at Cafe Beignet. The beignets are bigger and fluffier than C","useful":0,"cool":0},"FNB-T0-DwjfVpZLbwV1yzw":{"text":"One thing I like about here - they take credit cards!!!\n\nWe all got coffee and an order of","useful":1,"cool":0},"F3xV1XfbEuftu48niE83Yw":{"text":"Beignets and margaritas, what more do you need. This location was doing a great job with p","useful":2,"cool":2},"u8yNOQPQXL324cJCJ6DVMg":{"text":"Over all atmosphere was lacking; cafeteria like setting. My beignet was doughy on the insi","useful":0,"cool":0},"sqQXn-qaEXgpqPsXOeuZgA":{"text":"Great Beignets! I had a white choc mocha to drink and even a cookie because I'm a growing ","useful":0,"cool":0},"x3HsD_3hqhkJFRRRdLmqFA":{"text":"This is cafe has great potential with the cute French theme. I was so in love walking thro","useful":1,"cool":0},"oxIZqbQuWIXX70YdfJ7lDA":{"text":"Ah the lesser known beignet place. \nBut these beignets are so fresh and fluffy! The beigne","useful":2,"cool":4},"UA7MHg174KNAWjuSbjDAUQ":{"text":"Delicious Coffee and Beignet's!!! Steps in the front but they had wheelchair access around","useful":0,"cool":0},"x8q3L72nluN2TzE8WfeUNw":{"text":"I am not a connoisseur of beignets, but they were tasty. The cafe is fun and food is serve","useful":0,"cool":0},"3vio1JsEMlm63kGsxBnN6w":{"text":"Stopped by here as a last stop before braving my 6 hour drive back to Houston. I was origi","useful":1,"cool":0},"vqt7NBmpDcMfgZkDzY1Vsw":{"text":"Much cleaner than cafe du monde & had live jazz. Absolutely no difference in the taste. If","useful":0,"cool":0},"1wX8H2Gn3KETCqOhkKrMRA":{"text":"This place is so cute. They have a full menu with breakfast, sandwiches, etc so you can ha","useful":0,"cool":0},"lw7vQhCbQlhbVHyLX0OdgQ":{"text":"Really cute place. The beignets come 3 for $4. I'd suggest sharing with someone. They come","useful":0,"cool":0},"-G5dj81uQbDlA3NsUvnO1g":{"text":"I've been to New Orleans a dozen times and I've always only gone to Cafe Du Monde for beig","useful":11,"cool":12},"xQCByCPaGvkcYgjZDuLzCQ":{"text":"Love this place! You betta get there early, so you can wait in a SHORT line!  It's worth t","useful":0,"cool":1},"lDDaQPC8qzIXgMDK7aqMIQ":{"text":"Food was ok, reasonably priced, but very underwhelming. I ordered the western omelette, my","useful":1,"cool":0},"c3pulE00qMU-dPu7hC9yNQ":{"text":"Ok, so my first beignet, which as uneducated Kentucky swine, I pronounced bennett, repeate","useful":1,"cool":0},"B_WZ4dymEzAZnJplsF0XGA":{"text":"I'm happy I stumbled upon this place, the inside is cool, I like the atmosphere it has. It","useful":2,"cool":0},"wQVt_JR8Hakg6jXXQU3VAA":{"text":"My favorite beignet place....well, I've only been to 2 places LOL! But in comparison to th","useful":1,"cool":0},"RdlQlfnYCvNdQH7nx7aN8A":{"text":"It's a NOLA must do. I've gone here for 10 years, it's good and consistent for the most pa","useful":1,"cool":0},"Dq3jFeHDtD7NpT4JNEhfxg":{"text":"we were mainly there for beignets and coffee but thought we would order more food to last ","useful":0,"cool":0},"IwcRS3oNQgPC5BaXdZNI0g":{"text":"The line went quickly. Beignets were made to order. So good!\nRestrooms were clean and I en","useful":0,"cool":0},"sRLIeZVLaHpJAYC2Nd9gqA":{"text":"The beignet's were great. Not an enormous amount of powdered sugar and the beignets came o","useful":0,"cool":1},"yovkuRp3jLoWVTQgA_KzgQ":{"text":"Love this place. Like how this place has a patio like restaurant and you can people watch.","useful":0,"cool":0},"S8TY9gQYw2xvBGvWYCpRWA":{"text":"What a precious gem right down the road from the original Cafe du Monde in the French Quar","useful":6,"cool":4},"HFLppRAae8VvVmCp5lRqZQ":{"text":"Best Beignet in the French Quarter! Super cute ambiance with an open cafe floor plan. Live","useful":0,"cool":2},"64WcUyDeW1yo2PVWwErMew":{"text":"Rude staff obviously do not care about customer service.  Greeting a customer properly sho","useful":1,"cool":0},"cxKgTHIvWhYb894HihmYgg":{"text":"We fully expected a wait, and were not surprised by the long line. It actually moved fairl","useful":0,"cool":0},"JNl85LgIBx59gTyKvXkt1A":{"text":"When it comes to eating I'm more of a savory Latina, my sunny disposition is sweet enough.","useful":9,"cool":5},"Owp1W9POOzlpWW44x2X7Rg":{"text":"Review is for the Beignet. The other breakfast items are so so\n\nThis is the best Beignet i","useful":2,"cool":2},"LahlCOtKJHuKhxCR67kwKg":{"text":"Stopped in during jazz fest and all I can remember me saying is yesss!\n\nThere are lots of ","useful":4,"cool":3},"nHuXzNBqU30IJPXi7bmo9g":{"text":"Cute little place worthy of a visit. Their beignets we're good...just not our favorite.\n\nE","useful":4,"cool":6},"ralq8qY1IEtkGCeNX064bg":{"text":"This place is a total tourist trap. We live in the mid west and there is a place there tha","useful":1,"cool":1},"P2Nqkih0yW1gvZXqtRRn1A":{"text":"I am disappointed in Cafe Beignets service.    Being in NO you have a wide variety of food","useful":5,"cool":1},"YBp5bPErj8bBQn8KpqU7dA":{"text":"This is my favorite place to get beignets in NOLA, hands down! I've visited NOLA several t","useful":3,"cool":2},"x6O7whd5h88ecjdipBiAHg":{"text":"SO MUCH BETTER THAN CAFE DU MOND! There may be a short line depending on when you go but i","useful":1,"cool":1},"X9mCw8dCbFlW1YEU20OcSA":{"text":"I think I went to every Cafe Beignet in NOLA during my 5 day trip! The Cafe Beignet are so","useful":1,"cool":1},"7ToDnDKq8bUBuIKdNTNDnA":{"text":"great beignets- my brother and I loved this place over cafe du monde since the beignets he","useful":1,"cool":1},"Nx-H4T9RFLKMZG87N03kyA":{"text":"Central location. Stopped in for Beignets before our Nachez Steamboat ride. The line was o","useful":1,"cool":1},"-YI2ze0UhK_IWNlH90VhCw":{"text":"Such a cute cafe and delicious beignets! I came here on weekend trip and wanted to try caf","useful":1,"cool":2},"bsjWxcvo_737452vprBZCQ":{"text":"I absolutely loved the environment of this cafe. The entire restaurant is open to the outd","useful":0,"cool":0},"tsNSxtEVsJYZ7fclAX42Aw":{"text":"This is probably one of the more popular spots in New Orleans, located in Jackson Square i","useful":5,"cool":4},"Sv3GzPFiPVegeI_ms5LnNA":{"text":"Cafe Beignet is pretty darn good! I was very highly recommended to go here for the beignet","useful":23,"cool":19},"nR6N5YkuayR65jrcykmFvw":{"text":"For as long as I can remember I have heard about the beignets in NOLA and how amazing they","useful":2,"cool":3},"786Rvm6oZH-VlNjhj5L1Vg":{"text":"These were the best beignets we had while in New Orleans! We went to three different beign","useful":1,"cool":0}}