{"79Av-Dk38ixd12iFwqYYDQ":{"text":"Amazing experience. I scheduled an appointment with Jane for dip powder on natural nails a","useful":0,"cool":0},"us50KYAL_aKGEl2zClPuXg":{"text":"An amazing experience! My sister and I came here during a sister weekend. The spa manicure","useful":1,"cool":1},"Iloi7LNH_FOYzn9yazw5qA":{"text":"I could not recommend this place enough. I had a horrible experience at another nail salon","useful":0,"cool":0},"I5HjCou71atrvD28h0zrXQ":{"text":"This is my second time visiting. The first time Han did my nails and the experience was ni","useful":3,"cool":0},"lBemHoU-QSwe9xbWJ-QqrA":{"text":"Golden File Spa deserves more than just 5 stars. From the atmosphere, service, quality of ","useful":1,"cool":0},"RWBWhf6YL8R6uAfWHotrvQ":{"text":"The ladies here were very pleasant! I was in town working and needed to get my nails done ","useful":0,"cool":0},"QZsrg2SI8JGoI0amCv5Olw":{"text":"I don't even know where to Start!!!! This is hands down the best salon in New Orleans & th","useful":8,"cool":4},"Typ7ay2kyj1VdpyGNQugnw":{"text":"I always see this nail shop on my way home and I decided to stop by and check them out. Wh","useful":9,"cool":1},"2G_oS7XsEwJdJ636Jsak4g":{"text":"Amazing experience. I scheduled an appointment with Jane for dip powder on natural nails a","useful":0,"cool":0},"WMr2aTYmj4w6UWZDC3aNcg":{"text":"Hands down the best nail salon in town.\n\nSince December I've been seeing Tina for my nails","useful":3,"cool":1},"FuBnrr173bRhR5zo3BBZ7w":{"text":"If I could rate them a ZERO I would. When somewhere tries to be so fancy they don't make s","useful":0,"cool":0},"vk4hHIghRnuI0oudck3VBg":{"text":"It could be that they were closing, but I had a girl doing my nails while the other did my","useful":1,"cool":0},"t06If-xFGcLTFwhhvPE9Zw":{"text":"I absolutely love this place. I cannot see myself going to another nail salon...ever. I co","useful":3,"cool":1},"ylKbK_2uW4Z2kH6KCbgqcQ":{"text":"Golden File is without a doubt the absolute best nail salon in nola. Don't even bother goi","useful":1,"cool":0},"dvLyZjwjcvpC9UywUQ9GwQ":{"text":"Best manicure I've ever received--highly recommend. They take really good care of you.","useful":2,"cool":0},"oxi4ZdBPkpTCXjcE7zBvTg":{"text":"I always see this nail shop on my way home and I decided to stop by and check them out. Wh","useful":0,"cool":0},"0VV7kx1rJA761mB1HGVeuw":{"text":"JANE IS SIMPLY THE BEST. She cares about her customers and their experience so much that i","useful":0,"cool":0},"oa6j0bSvr7u9hYYDcuFG0g":{"text":"This shop no doubt has the best nail work in the City, and they know it. This was my shop,","useful":1,"cool":0},"iMar2uHqGIx9qRNlQpLuZQ":{"text":"I visited this place a few weeks ago for a pedicure. Terrible customer service and terribl","useful":4,"cool":2},"_MBLryiyNqaEUiJYo27HkA":{"text":"Where do I begin??? This place wants a down payment and like 3 forms filled out just to ma","useful":0,"cool":0},"Uwq4UggKrKDJTNrJXu8Nlg":{"text":"Han is truly the best in town -- period! The salon overall is clean and inviting and has a","useful":0,"cool":0},"QGyk51tQr7R1vsnpXHemtw":{"text":"First time I visited Golden File, they had just opened on St. Charles and it was just Jane","useful":0,"cool":0},"L4y_r1t7J-KjBQvcXbVCfw":{"text":"Golden File Nails & Spa is every single thing I want in my regular nail place:\n\n1. EXCELLE","useful":5,"cool":3},"pEnBDRqTetOLKJ3Dx1A2tQ":{"text":"If y'all have been following and paying attention, for the past year I've been struggling ","useful":9,"cool":2},"xVPXAY2GMBKR4NvDATEv3A":{"text":"Was in New Orleans just for the weekend and a friend and I wanted to do something while ou","useful":9,"cool":5},"UzqWJRfcgjojdUM0hc_jsQ":{"text":"This place is the bee's knees! \nLOVE, LOVE, LOVE. SO chic and so cute! We were looking for","useful":3,"cool":2},"QkTfaqV_O9j8LY5rLmaZjg":{"text":"I made the mistake of going here while visiting NOLA. They did not enforce mask mandate or","useful":0,"cool":0},"0IOKTvPhgiaYPJRi2np_3A":{"text":"First off, Golden File is the truth and yes, I've been to several nail salons in the city.","useful":3,"cool":0},"UHKd-V1I7dNruQ9osyOh9Q":{"text":"Jane and Han can do literally anything you want with your nails. I also know 8 other women","useful":0,"cool":0},"MGGethm9V9J_-tE_NqvMNQ":{"text":"Pre-Covid this was my go to nail salon. Tina, who is no longer there was my nail tech. I h","useful":0,"cool":0},"QRmSUsIKciSBHKmIlJLpdw":{"text":"I am so lucky to have found Jane and her salon! I regularly get gel or dip powder manicure","useful":4,"cool":1},"pLcRWpYk6Q48KqzoU2TPbA":{"text":"Definitely enjoyed the nail spa and I will be back. My pedicure was amazing. The service w","useful":5,"cool":1}}