{"ZrVrIaZ2YFsPw91o2oBPmQ":{"text":"Just like Yelp says, Alex's Bikes are as good as it gets.  We rented 6 bikes from Alex for","useful":1,"cool":0},"yzffZfIzBvhjWPRyDYQs8g":{"text":"Great community bike shop. Alex and his staff are always friendly and ready to go the extr","useful":0,"cool":0},"k8Jja0K0SMRhR0hYrY88Rg":{"text":"Great neighborhood bike shop for rentals, bicycle repairs and accessories. Fixed my bike o","useful":2,"cool":0},"-FDVav0DJOHBMf1pgEq_pw":{"text":"We rented bikes here for the week we stayed in New Orleans. Alex couldn't be more friendly","useful":0,"cool":0},"rPrB8b8mquLGlsP5I57Dlg":{"text":"We were visiting Nola for the first time and are so glad we rented bikes from Alex. The sh","useful":1,"cool":0},"XBDgXQuOFvAfCrhXtK5hmw":{"text":"Came to Alex's after my poor feet had enough pavement. The shop was close to were I was st","useful":1,"cool":0},"J7icbt9Svg4gj_DhtE-AOw":{"text":"My boyfriend and I had a short trip to New Orleans planned. A bike ride through the city e","useful":0,"cool":0},"RAAOQ0U-cnQMmpNAnm5Atw":{"text":"Best bike shop in town! My girlfriend and I were in New Orleans on vacation and stumbled o","useful":1,"cool":0},"cU8yOL7y-KEAUXv0Z1qlBg":{"text":"Alex recently sold me an awesome Harrier at a great price! Even though I was looking at a ","useful":1,"cool":0},"OCyh3xJErvx90a9s8vtwHw":{"text":"Best bike rental place ever!! So nice and flexible. They also have the best prices.  We 10","useful":1,"cool":1},"XSiQSxHuNwmLwYPkveTVFQ":{"text":"Alex was so friendly and laid back, not to mention more affordable than other nearby bike ","useful":1,"cool":0},"PHb4cE7WQi-dA8gN8RR-Cw":{"text":"Alex is awesome!  This is the first bike shop I have heard of where if you get a flat or s","useful":1,"cool":0},"Hwnz6ZzVvdTvuBYhkHaw9w":{"text":"Really great shop & Alex is a cool guy. Rates are decent and it's a great way to do a tour","useful":0,"cool":0},"tvzX7VNok_PWbfmX5ha6sA":{"text":"Bikes and equipment were all in great shape. No issues. Rates were great. Shop was extreme","useful":1,"cool":0},"RZ6JHYmMriPc9YE86pjjrw":{"text":"Great little shop on Marigny street and Alex is a very nice guy. Rented a bike for a week ","useful":0,"cool":0},"1H5HZa83n0wNC-vUuB-qsQ":{"text":"Wow. Amazing! So friendly, fun, easy, and spacious. And way better than Bicycle Michael's ","useful":1,"cool":0},"V4uKzEQ7EkrcZTWclJjeqA":{"text":"The best, quickest and by far the most affordable tune up I've ever gotten. I expected a b","useful":1,"cool":0},"vzw0sgJOaygniMZqQbeqig":{"text":"Alex is super helpful and friendly while providing great customer service with excellent r","useful":0,"cool":0},"yFa9sZCodHMu7thhOpBrBw":{"text":"This place is a great option if you want to tour the city in your own way. It's economical","useful":0,"cool":0},"GOQttwkyZrVx_U7H7g4x1A":{"text":"Great little shop. Very nice people who take their work seriously. Had them do a little tu","useful":0,"cool":0},"PO42BYMwEVsTW_qvxrciCw":{"text":"Great little shop. Very nice people who take their work seriously. Had them due a little t","useful":1,"cool":0},"fq_BkCpyy4rztkqK0cRq_g":{"text":"To be beguiled by a bike shop leaves one in awe of the enormity of the contributions local","useful":0,"cool":0},"jTw6gCUwXFxiDOLhU-FHEg":{"text":"I'm a local that always goes to Alex's! If my tires are worn down by the grumpy streets of","useful":0,"cool":0},"HzftQKP0IqQzsr6EU-PXIw":{"text":"We went here today to rent bikes in the bywater. Alex, the owner, is such a nice guy and t","useful":0,"cool":0},"qqgYpiyTu3j-7pC1_F4DvQ":{"text":"One of the best bike shops in new orleans by far. Quick and friendly service. Very profess","useful":0,"cool":0},"Lgh2Qi-2U1Y80RIG32ztHQ":{"text":"Sold my bike before moving here and don't have a good place to store one, so I've been loo","useful":3,"cool":1},"5mcWy6KYe_MfCkvHla_kYg":{"text":"12/10, highly recommend. Alex's Bikes made our weekend in NOLA so wonderful :) The nicest ","useful":0,"cool":0},"SQAmcaxgny6hh6FeIKOJFA":{"text":"Quick review : What an outstanding experience! If you want to rent a bike in New Orleans f","useful":7,"cool":4},"BTInWbPjVpjbZXth6JQ9Aw":{"text":"Best bike shop experience ever. It's so refreshing to meet somebody that knows how to trea","useful":0,"cool":1},"XxUZqtEVUhrGRjU1OULaVQ":{"text":"Just bought My second bike in a row from Alex's bikes. Both of them Ace quality, the only ","useful":0,"cool":0},"vakehDyOacwv8JYEYF_xsA":{"text":"Fast, friendly, knowledgeable service. They helped transform my Colorado bike into a New O","useful":0,"cool":0},"_lbWjbtdOfVcaZMfHvmNMw":{"text":"Nice little place in bywater... alex was friendly and welcoming. It's centrally locates.","useful":0,"cool":0},"FWNfiaquEUn-q012KWV4nQ":{"text":"Great new addition to the neighborhood. Knowledgeable, friendly, service-oriented business","useful":1,"cool":0},"Gw6Zh7UA6pU2NvZ1wVdsAg":{"text":"Alex is the man, period. We lucked out finding this spot the last day of our vacation to N","useful":1,"cool":0},"jDJRuI6yZNMofj8HxccWYg":{"text":"By far the best bike shop I've ever taken my bike to. Alex and his staff are extremely fri","useful":1,"cool":0},"mEHYd4uOPX6vLD4_PP2U-Q":{"text":"Had a great, easy experience here. Sitting just off the corner of Marigny and Chartres, di","useful":5,"cool":1},"QQbaIPTyRpFeveJ9-b6UyQ":{"text":"Had the best experience with these guys. I had lost the keys for my bike lock and they wer","useful":2,"cool":0},"1Z9N-FLdsE4VtU-QU793WQ":{"text":"Very good value in the way of a rental cruiser.  25-30$ for 24 hrs and the bikes are in gr","useful":0,"cool":0},"e_4z3IqTOAHwnXm9t2IXug":{"text":"By far the best bike repair experience I've had in New Orleans. I've been here for a decad","useful":0,"cool":0},"HG9a8vFEs4KZNe1hfbLunw":{"text":"Tourist beware, he will rip you off!!  Trying to take advantage of the situation and is ov","useful":0,"cool":0},"S5ptFYIleNvPmLBPZW2jiA":{"text":"I love Alex's bikes. \n\nThey tuned my bike up very quickly, and was very affordable. They f","useful":4,"cool":1},"fZ5OBwNORgQkXPZ3EacEOg":{"text":"very friendly and helpful staff. my lock was stucked after the typical work hours and they","useful":0,"cool":0},"K-6uKEnllN7Jb2Vcx8D3TA":{"text":"Genuine.\nFriendly. \nRight price.\nQuick service.\nQuality parts which he stands behind.\nNeig","useful":2,"cool":1},"tcNTbOxOs1F-xbTxgV11hQ":{"text":"This is the third and best bike shop I have rented from while in Nola   Without question t","useful":2,"cool":0},"D1AWwEsGoX2JJxupNWeqFw":{"text":"Renting bikes from Alex was one of the best decisions we made on our recent trip to Nola. ","useful":4,"cool":3},"RiUNsr9f5iJshxuYVT18aA":{"text":"A dear friend of mine bought me a snazzy mint green Reid bike from this wonderful bike sho","useful":0,"cool":0},"k35sd49KR_QCrkniD2eeQQ":{"text":"Great place to rent a bike from! Reasonable prices, great bikes and friendly staff. They m","useful":1,"cool":0},"bOoJGcH9WwWEDG7U45Uy1w":{"text":"I went to Alex's to have my Vilano road bike assembled. They did an excellent job. When I ","useful":1,"cool":1}}