{"qAibJCsavKUs5Df-lxYLvQ":{"text":"Delivery was slow because it was close to the college, food was ok but not worth the price","useful":1,"cool":0},"v1x1XZccB3QEuo5WE7r6iw":{"text":"Love this place! Cool little spot with some creative food and drink. Gin/cucumber daiquiri","useful":1,"cool":1},"375vhb0edLu9RU5aRXUfRw":{"text":"Visiting from out of town and we ended up here because the other two restaurants we wanted","useful":2,"cool":0},"-ndrucCF_9qNSUUeyMKvlA":{"text":"The first place I ate at in New Orleans mainly because it was a 10 min walk from my place.","useful":0,"cool":1},"a7d4S6VaX3y3OY2Db1GrbA":{"text":"Great wings!  I just went with seasoned and smoked (no sauce)... nonetheless they were tas","useful":1,"cool":1},"kFPaeKWJbJB0z0uKcbfMaw":{"text":"I live just two blocks away and frequent Bourree! My favorite wings in town and the daiqui","useful":1,"cool":0},"RZmzrYOMaStZRoQ09vZMCw":{"text":"I could go on and on about how much I like this place. These are some of the best wings I'","useful":0,"cool":0},"9p7My3x194UPl6LfJ2KUcA":{"text":"I walked in and the music was jamming.  Great environment. Welcoming staff and kick back v","useful":1,"cool":0},"om5y7eiCDGL21M2_0qjkWQ":{"text":"Amongst the wide array of BBQ options in NOLA, this one falls pretty low on the list. Whil","useful":0,"cool":0},"QACh1l2VUEJPkLkVAtISSg":{"text":"Solid BBQ with a few twists.  very few tables, but picnic benches under the shade of the t","useful":0,"cool":0},"TPMWzAF9Vqz7rnAntpvbMg":{"text":"The outdoor area is great. Especially when they have live music and are cooking crawfish o","useful":1,"cool":1},"yKh7cJRmdWPcZqS2Dq5W_g":{"text":"I am a huge fan of chicken wings! This place has some really good ones. I got the Mango bb","useful":0,"cool":0},"PsXIPmKoqWyP3arcf_FhcQ":{"text":"This place is most def a hidden gem. The quality of the food was unique. I went with a gro","useful":1,"cool":0},"aoOMbfiwxw1qqyQsnyoEHA":{"text":"Best wings in the city! I like the buffalo and the jerk the best and comes with delicious ","useful":0,"cool":0},"JvJZxUTxXxEONJOUN--kgg":{"text":"Daiquiri are soo good and also the meat pie and the home made ranch dressing is soooo gd.","useful":1,"cool":1},"ZRMyoNaLpi5AfmpPqG8TAg":{"text":"We tried a sampling of the jerk wings, beef fat fries, meat pie, and boudin. Everything wa","useful":1,"cool":1},"jg8cZ7ZQDdrAPFGxs2Ze3w":{"text":"Craft Daiquiris, amazing boudin, and spectacular wings. All full of flavor but well balanc","useful":0,"cool":0},"aLALrYHoPlTluq6TZ4rG7Q":{"text":"This place is straight hot fire. The daq's and wing combo is top notch. Best wings I've ha","useful":0,"cool":0},"6L7QZrrF5BX6HkuQu-iCvQ":{"text":"Great place for an afternoon lunch. Loved the shrimp po boy I had! Cute outdoor seating ar","useful":0,"cool":0},"86QnBBYcnH4x5hiRdqmY-w":{"text":"OMG.... I've never had Boudin so I can't compare it to others but I'm now hooked on the sp","useful":0,"cool":0},"EeXHsTf3TC0mEDq-R4l4eA":{"text":"Amaaaaazing! Absolutely the best wings in NOLA, the food is amazing, the daqs are bomb, an","useful":1,"cool":1},"H2BC5JG1v0KxVZEFGqCMQA":{"text":"Great food and friendly staff.  Brisket & Pimento Cheese Poyboy is delicious. They also ha","useful":1,"cool":0},"xh3g7lqyAqpxNORuUQlZdQ":{"text":"Charming little spot! We wanted to try a little bit of everything so we got the duck confi","useful":0,"cool":1},"sGVH6jJj8ay-RUdd7xSqNQ":{"text":"I love bbq and I was looking for the place next door but they were closed.   I asked a few","useful":0,"cool":0},"Jcibuv-mxmO5LwPfqy8cZw":{"text":"We were walking through the neighborhood and as we walked past this place we smelled all t","useful":0,"cool":0},"fASjvJtVcgte1Ilf-WBqyg":{"text":"AMAZING. I'm a regular here and love the wings. employees are super nice and the daqs are ","useful":0,"cool":0},"DQhwrSlBXz--MF2hZpy37w":{"text":"This is a cool little wing shack. Down here in New Orleans there aren't too many must try ","useful":4,"cool":1},"U9IvqMtXDV8A1-cge-eomA":{"text":"We had the meatpie and the brisket & pimento cheese po boy. Both were delicious!!! Friendl","useful":0,"cool":0},"JaGPgsHbTc-bo6gsWROuSg":{"text":"Overall I give it a B. Service was very friendly and the atmosphere was awesome. We dined ","useful":0,"cool":0},"JDb7koc4oKMJvXKvWrD2BQ":{"text":"unique wing flavors like kimchi & lemongrass, jerk chicken, mango bbq, buffalo. I had the ","useful":2,"cool":1},"6KJdXTeT50HcdTf5f6JmtA":{"text":"Can't believe I haven't dropped a review here! A favorite neighborhood go to bbq bar. Alwa","useful":0,"cool":0},"6fUsVjNifJt3yKJe2yKckg":{"text":"We have lived less than a mile away for 14 years, but have never been here. Today, however","useful":6,"cool":5},"6TZwiIyvEu2lerpaxo_FPw":{"text":"It's late. You're sitting there watching TV. Okay, it's a Food show. You're munching on le","useful":1,"cool":2},"SfVxahw7d-rMYXgfTXHKkQ":{"text":"The duck nachos are a must for anyone visiting Bourrèe. The outdoor area is a nice place i","useful":0,"cool":0},"6sl2OXp0oJMEBoeqalhyjQ":{"text":"Went on a Sunday for the whole hog. 1/2 lb serving was too much for me to finish when you ","useful":0,"cool":0},"5sZ0yK_HEwcVrgH2ZAh7Qw":{"text":"I'm sorry , I wanted to like this place but they made it too difficult.  \n  Myself and my ","useful":1,"cool":0},"ihA_qVI2-kabYmlGjKnYKw":{"text":"A charcuterie. Yup. A real one. No not chicken wings and daiquiris - they have those too. ","useful":1,"cool":1},"D-Up2YZV0FkKUUuZKtWHxw":{"text":"Normally a great experience.  Arrived at 1200 noon and had been bragging about the Shrimp ","useful":1,"cool":0},"XavIWSnXdGp1FKlesW6Pvw":{"text":"Sausage had very little flavor. Wings over cooked and dry the sauce did not help. Diners d","useful":2,"cool":1},"4vWZbIeuCtfrefuRiYGNMw":{"text":"Homophobic, transphobic and mentally abusive to workers. Their food isn't even that good f","useful":2,"cool":1},"6uslkTrtJvg9PBtfv-Vu6w":{"text":"Had the boudin - not authentic boudin - not even close. And by the way... just coz it's sp","useful":2,"cool":1},"xYjqidvG00VFvosNjd2tFg":{"text":"I loved the restaurant next door and the drinks.  I figured that if diners, drive in, and ","useful":2,"cool":1},"47KjsmXexx4HU0vLMqTTFw":{"text":"Love your food and Nathaniel is great but you really need to update your website and list ","useful":1,"cool":0},"sR8nziPh4CeXTQFGK9BQjQ":{"text":"Love the meat pies & the duck nachos! It is a nice, casual restaurant..... almost unassumi","useful":1,"cool":1},"wROKCu3772xwKH6edNJQ_w":{"text":"Ya'll. OMG this place was delicious! The meat pie was HUGE. The chicharron was HUGE and VE","useful":3,"cool":0},"eAjtgmg51nFexQsbhth-aQ":{"text":"It's really difficult to have a bad meal in New Orleans, but I sure did here. \nThis place ","useful":4,"cool":1},"Koo06O6TeRuI4H2fyA_vZg":{"text":"This place is great! They also deliver! The wings are smoked & covered in delicious sauce.","useful":0,"cool":0},"jyB9u2xiVeBtdBVyxz1U6Q":{"text":"Food tastes decent even though it takes upwards of 30 minutes to get it, and portions are ","useful":2,"cool":1},"4-RoY9g-PlZOwN8KZV0-Wg":{"text":"5 Stars babay, but that was a pull! How do you not have proper blue cheese with your Buffa","useful":0,"cool":0},"wMLDdqva_zemkGZPIIzh1w":{"text":"Very disappointed, been wanting to try this place since they opened. The buffalo wings wer","useful":1,"cool":0},"ukKx0Tsw5SfV0usGPJ0ZXg":{"text":"Best wings and fries in the city. The house made meat pies, ranch, and daiquiris are also ","useful":0,"cool":0},"hG7JTiOXQi0nKnNU2Y98NQ":{"text":"So so good. We got the beef fat fries, meat pie, wings, and the brisket po boy. Definitely","useful":0,"cool":0},"WqntpBlWNY5NYLzt8Z99OA":{"text":"Delicious gin and tonic homemade daiquiris! They are known for their wings but I havent tr","useful":11,"cool":9},"XK1bol_Qr9l3r2DZsw4new":{"text":"So so so disappointed ! We are at New Orleans for 6 days and while getting ready in our ho","useful":1,"cool":0},"pC9qWIxYA4v3ewgBJMH_6g":{"text":"I love this place. Great wings, great service, great drinks. Super good vibes and the peop","useful":0,"cool":0},"Oh8iH4CPT_J7lIAIxv4XbA":{"text":"Stumbled across this place after checking out a nearby art festival. The chicken sandwich ","useful":3,"cool":0},"a1EWZKZHG0XJfskqVT-rbA":{"text":"Wings so good you'll wanna save your toilet tissue after eating these wings...drinks are g","useful":0,"cool":0},"AioWtZFKJfSRswShoGT1zg":{"text":"I spent a week in NOLA for a work trip. I was super excited about the food, but nothing re","useful":2,"cool":3},"7g2aYYxrYPz7D_MsheGjkw":{"text":"So I was drunk both times I came here...so grain of salt.\n\nBoth visits they were out of sh","useful":0,"cool":0},"_fYmV7rC4HNx1pA9zLaNJg":{"text":"I brought the bf here for his birthday dinner because he loves wings. LOVES THEM. So I tho","useful":12,"cool":5},"2Q3ZKZ9EgKjLUIM7iG5r0g":{"text":"A little disappointed in the al dente potato salad and the lack of salt and the chicken wi","useful":0,"cool":0},"yyhPk-tOlalbJBJtA78-Ww":{"text":"Food was AMAZING! Very flavorful! I mean the pickled celery and carrots were so good! The ","useful":0,"cool":0},"YiJEqpMXx6fs49P2XY9S-w":{"text":"We were walking past and my husband and son who both love meat very much pulled me in to e","useful":2,"cool":1},"w1tbLCs8nWr6jCY4Fv0IwA":{"text":"Nice little spot! Good wings and got the burnt end chili cheese fries. Cheese was cold....","useful":1,"cool":0},"Rme33JrtV2LdGK7esQMdsg":{"text":"Awesome food, better daiquiris.  In fact, this is the only place in the city where I'm wil","useful":0,"cool":0},"MfZNtCZq81d4J2ZF_PwBEQ":{"text":"We had intended to eat at the parent restaurant next door, but arrived before they opened ","useful":2,"cool":1},"Zto1h8W1dWaLk5MAbUpqKw":{"text":"So Effn good! Everything! You have to try the Spicy Chicken Sandwich for 6 bucks. Yeah I k","useful":0,"cool":0},"P0nS0TzZF-dpOVZ2Eg2Mzw":{"text":"Good food, cheap, big portions. The meat pie and fried chicken sandwich are really good. F","useful":0,"cool":0},"IQ5Wi61GnkhcnImfhUTRaQ":{"text":"Sausage had very little flavor. Wings over cooked and dry the sauce did not help. Diners d","useful":0,"cool":0},"zU-cUBncj977OOfjxUdK-Q":{"text":"I've had easily had over 16,000 wings in my measly 23 years of life. These 4 wings easily ","useful":7,"cool":2},"TobrxMNUDSmSyAHYi0QOWg":{"text":"Bourrée is one of my go-tos here on Carrollton. I'm a big fan of the spicy chicken sandwic","useful":1,"cool":0},"Ix1m3LYWxuiD2tCR63NvhQ":{"text":"This review is specifically for the fresh fruit daiquiris.  They are the best I've ever ha","useful":1,"cool":1},"_ICCtJiJ8CE8yQ6bxwC_Xg":{"text":"Tried a few things from the menu,  the spicy chicken sandwich was a real winner,.. much be","useful":0,"cool":0},"X0KExWBUZlJmFTpgIZBFZg":{"text":"Stopped in for lunch today. There was one other person inside when I ordered the brisket a","useful":2,"cool":0},"LN62f2aGvnTjsRWnwMAwmg":{"text":"Such a disappointment after finally getting a chance to try it.  It was a windy day so sat","useful":3,"cool":1},"7S5mcL4DKNyNqpHeH0Ib-w":{"text":"We decided to try this place out since it is nearly next door to our airbnb and was open o","useful":1,"cool":1},"vS6toAIN4NVOgECfbDuQMA":{"text":"I had been driving by this place for a year and finally decided to stop by to try it. The ","useful":2,"cool":1},"ejxP6eio2gpuXM-J2bYQzw":{"text":"The atmosphere was inspiring and has lots of potential. There is outdoor seating to enjoy ","useful":1,"cool":0},"qowmCbKqJhLvecdl39WjwQ":{"text":"We stopped in on a Sunday at 12:45 to a grumpy kitchen crew-minus our cashier, she was pre","useful":2,"cool":1},"ypo7hQhiBzjEWzCAtygKQA":{"text":"Wings! Nachos! and Beer! We just got back from touring the US for 80 days and this is one ","useful":2,"cool":1},"zJKb-oJLzUGs7quUgYkpzg":{"text":"Maybe it's because of the summer dulldrums for restaurants but went there yesterday and th","useful":3,"cool":1},"4amt1K4t3G3flO5kHuNPFw":{"text":"Ugh. Just had a really terrible lunch here. The fried chicken salad was super dry, the bre","useful":2,"cool":1},"YwiahBfNUp1AbWUTDrCMbw":{"text":"The flies, the flies, the flies! Unfortunately  the flies were so many, I was distracted f","useful":1,"cool":0},"zGomfX6nbdLPi_O-IyN3SA":{"text":"Bourree was solid. We had a very decent meal but all in all, not much special with regards","useful":5,"cool":2},"uZjevGFPmOskI0IRCAbnOg":{"text":"The butcher shop for the former Boucharie restaurant next door, Bourree outside of its raw","useful":3,"cool":3},"t8mZJca-_ymdpNP9CJSYKw":{"text":"I had ribs and chicken carry out and instantly wanted to return them for my money back. Fo","useful":2,"cool":1},"dPY5ePsyELqA1rNXpiCgSQ":{"text":"Amongst the wide array of BBQ options in NOLA, this one falls pretty low on the list. Whil","useful":2,"cool":0},"l1ltgvhq64pq3CL55b92Gg":{"text":"Let me start by saying all Jerk Chicken is not created equal. Even those that claim authen","useful":9,"cool":8},"3i4Aqf0FZkT1VASMIp_bvg":{"text":"If there was a bounty placed on the head of \"The Perfect Chili Cheese Fries,\" my leather v","useful":0,"cool":1},"Uy0RdeJGO5JHktMMqQ2WHg":{"text":"So I'm from Chicago and my family and I wanted some good food while on a road trip through","useful":1,"cool":0},"T7aOgDOhInrZxsyumXpJyg":{"text":"Mom and I went for our first (and probably only) visit after a day at the doctors. We were","useful":3,"cool":1},"f92LDAB25IKNtHUE4AJlYw":{"text":"Today was the first and last time I ordered from Bourree. My Sweet Mango BBQ wings were pa","useful":0,"cool":0},"24PC5sNmb47fESVqg7dVhw":{"text":"The daiquiris are good, as are the fries... I am not nor will ever be a wings person. So d","useful":8,"cool":4},"W6BCKSu-lF3FUlFXEytGog":{"text":"On a quick glance, this place appears to be very highly rated... However this score is bas","useful":6,"cool":2},"SzEm_BjE192QTosBGpMxtw":{"text":"Give their fried chicken sandwiches a try! I'm a big fan of their crawfish boils during cr","useful":0,"cool":0},"WWdmHjhlXti0PQ5Tfjap-w":{"text":"Amazing!!!! I saw some not so great reviews, and was a little apprehensive. It's close to ","useful":0,"cool":0},"h0QMBig9BY_W7xELOs_CcQ":{"text":"I was a huge huge early fan of Bourree, since I live just a few blocks away. I took every ","useful":4,"cool":1},"7JaMdZStmt5pqtfn8TMCOA":{"text":"I eat here all the time, and the food is great. The service, on the other hand, is severel","useful":1,"cool":0},"oEnxwC3MVIqF1faEPwgk7w":{"text":"I'd heard great things about this place for a while and finally gave it a try last week. H","useful":2,"cool":1},"74iFl-uEDmO0jVzqNYSjkw":{"text":"This was pitifully D R Y..( I added that BBQ sauce when I got home). Could be I got a 2go ","useful":0,"cool":0},"ydIJvu1ioXvh5Ln_3Won0w":{"text":"My first time at this place. Food was really bad. I ordered pork ( the sauce tasted really","useful":1,"cool":0},"acLnGyYCieeyRjiQVzbBew":{"text":"This is cafeteria style where you order at the bar and take it back to your seat. The staf","useful":2,"cool":0},"kcvnQlHd97flQjieoNR-Eg":{"text":"I was so stoked to try this place after seeing it on diners, drive ins and dives. I was pr","useful":1,"cool":0},"gIO84iEGHggQsGeE0hXaAQ":{"text":"With our little dog in tow and wanting to go somewhere for dinner we looked for a place th","useful":2,"cool":0},"PARU85X0HpNV-BOUtsSDWA":{"text":"I think I've finally found New Orleans' best chicken sandwich, here at Bourree. I always c","useful":13,"cool":8},"RjFeUFJJQipzuA3g-JZ8_w":{"text":"Went there a few weeks ago and had wings and daquiris. The wings were pretty good, but not","useful":2,"cool":1},"Ov3I-VtVbRCfaJWg-wWsoQ":{"text":"Bourree has been on my list for a long time and this was a perfect time to visit since I'm","useful":3,"cool":2},"8U8l-IPwrd2zsxgYComtQQ":{"text":"The food is excellent and worthy of 5 stars. But they've hung up on me on more than one oc","useful":0,"cool":0},"SsSi0s3Okv_vGXPZAokjUA":{"text":"I had some boudin and some burnt end chili cheese fries... I loved the fries!! But man tho","useful":0,"cool":0},"E3SkRcJ4BAZ9Lkn0HUtVBA":{"text":"Ok, after last night and again today I'm willing to admit this is my favorite wing spot in","useful":9,"cool":9},"jQNKfWW_H4BVKHdCwaRHFg":{"text":"I'm not really a huge wing person, but I heard very good things about Bouree and figured I","useful":7,"cool":4},"psZ3d1LyIPaj0IuKTRp7zg":{"text":"I used to work in this area and always passed this place up without wondering what it was.","useful":5,"cool":5},"rZstG7GgmybFMGghJFn3xg":{"text":"Ok I was all ready to give this a 3 star that was secretly a one star because the food too","useful":1,"cool":0},"Ns4N5VB7r3q-eyXLbMINlQ":{"text":"We're huge fans of Boucherie and decided to check out Bourée since we happened to be in th","useful":0,"cool":0},"XK2sOU-f9F212eDCgkC0KQ":{"text":"Don't bother. We went tonight, the meat was dry for both the brisket and pimento PO boy an","useful":0,"cool":0},"N0VwlMBzRcHgJMMHz0MG6Q":{"text":"I've ordered delivery twice in the past 2 weeks. Each time the food - particularly the  fr","useful":0,"cool":0},"mI1QSF_SU1A4OCrp8pHmEA":{"text":"Some of the best wings and daqs you'll ever have and everything else is dope. Deserves mor","useful":0,"cool":1},"VlzQjybxr_GyFYkRkcE2jg":{"text":"In general the food was very good but the service was horrible on our visit. The chicken s","useful":0,"cool":0},"MvnyWf0VBoLF83yzJgOezw":{"text":"Damn, Bourrée used to be good and mean something to me but has been on the decline since t","useful":0,"cool":0},"UcQwbtuEWToyvo3jGUB8aQ":{"text":"Whenever my family has visited this place, it had been great times.  Good food, fun drinks","useful":1,"cool":0},"2xRvbLbItYTN2d_BeyI_CQ":{"text":"I have never written a review in my whole life, but I felt that this needed to happen.... ","useful":1,"cool":0},"JXKhJHsI4SXTQ6WvH7udfg":{"text":"4.5!!! This food is SO GOOD!!! I enjoyed every bite of the following: Jerk Chicken Wings, ","useful":5,"cool":2},"jDjnx_1wxhOQ3OG1oYSvUw":{"text":"The food was served cold and not good. After hearing great reviews, I expected way more ou","useful":1,"cool":0},"53777-s6UqDRk8Aysk_3Gg":{"text":"Y'all. I got take out from here a few days ago and tbh I'm grinning just thinking about it","useful":1,"cool":1},"cxCRul0TC8c1gBzCxeqfMQ":{"text":"Bourree is such a cute Uptown spot. Only outdoor seating is available right now but for ra","useful":2,"cool":2},"BV2ouxX9EXQqVTrXhonZeQ":{"text":"Really great meat pies and fries! Small selection of items to pick from but always good! C","useful":0,"cool":0},"4rXH_tX9-TUhRZlwRmxUig":{"text":"The wife and I went here Sunday for a quick bite, big mistake.  I ordered the pulled pork ","useful":0,"cool":0},"63diQQZuXbKXCE6Mkb1nog":{"text":"I've been here three times in the first week of living in the city. The first two times we","useful":0,"cool":0},"lkZh5r9RfBNpew87j0Wo4g":{"text":"Hip place! Great food and fun atmosphere. Don't come here looking for fancy come here to h","useful":1,"cool":1},"zL0qNUuuhzKwyUMgNyETww":{"text":"BOUCHERIE'S BUTCHER\nI think Bourrée's adjacent parent restaurant is totally misreading its","useful":8,"cool":3},"im3zjaDv-RdvrcAJY11xlw":{"text":"One word: DRY \nThe lemongrass po boy sandwich was so dry and bland . The fries are like wo","useful":0,"cool":0},"z_Xg2OZCaTPJtb6cZEQGOw":{"text":"Well the best prey of our meal was the ranch dressing....that's not how it should be. We s","useful":2,"cool":1},"wsDxe5M8WjPMvV150gA18A":{"text":"This is a very divey eat and go type place. There is some seating outside which was nice u","useful":4,"cool":2},"P2JkUy5zRWCBkeiuhw7R2w":{"text":"Yelp has them open til midnight but they actually close at 10pm. Okay wings and sandwiches","useful":2,"cool":1},"SohgjCni3D60Mly8wTQDlw":{"text":"This is definitely not just a wing and daiquiri shop! Yes the wings and daqs are amazing b","useful":10,"cool":6},"SIf926wWqO3yhmRU2nGHvg":{"text":"Loved Bourree so much! Went for dinner and they had live music and a fire pit / heaters! I","useful":0,"cool":0},"DRGSaZN9mB91xUKfIyRzkw":{"text":"Only outdoor seating which unfortunately make it very weather dependent. Fries and brussel","useful":2,"cool":1},"nf3zS4qhQNXw2k0KkILFPA":{"text":"Forgot to share about the daiquiris. They change the selection frequently but the one pict","useful":1,"cool":0},"zUHayHXj1U_owCFPgqTMIA":{"text":"Let's start with the bright side, big patio, good for groups during COVID times. Food bad,","useful":1,"cool":0},"9cpmIlR0fSsOFcrWdv4TaA":{"text":"I loved checking out Bourrée for dinner! They have outdoor seating with heaters/fire pits ","useful":9,"cool":6},"GG_eX_1JQ43qlDO_uNw8tg":{"text":"Came today and our food was forgotten for 45 minutes. Once we got the food the wings weren","useful":1,"cool":0},"Q4c3DwEXiuylhhqsFN9q-Q":{"text":"I find that anytime I leave a less than stellar review it's usually about some aspect of t","useful":6,"cool":1},"K2_v23ayKAncNAvrQOGelQ":{"text":"Great spot if you're in the neighborhood. They do a wide variety of american classics with","useful":2,"cool":1},"pf_Qag251obRjeZZA1RP0Q":{"text":"This so a nice spot. The outdoor area looks super cute but once the sun goes down it's kin","useful":3,"cool":0},"TGrxqAKHQdb9ctQvg6VAjA":{"text":"My stop here was for the pit BBQ out front on a Saturday afternoon.\n\nThe ribs were a decen","useful":3,"cool":1},"1icMfnIUnu9-puYWRUKB8w":{"text":"My wife and I  tried this place for the first time today.  We ordered two different types ","useful":1,"cool":1},"G6VqUYjCh0Ls9XIIi-3riQ":{"text":"As smokehouses go, this one was kind of a nothingburger. The brisket was chopped up becaus","useful":11,"cool":3},"FhlpsgEc7htkd5UA8AACZg":{"text":"This was my first visit to Bourree and I had heard nothing but good things. I really wante","useful":2,"cool":0},"YZ3cAEKs1FJnXT5uvrBWPg":{"text":"The only reason you get 1 star is I can't  leave a review otherwise.  This is the 3rd time","useful":0,"cool":0},"Vym6w6Fts4DCkLWagiAHsQ":{"text":"Leave your diet and dressy clothes at home! This place is da real deal!! Don't plan to cou","useful":1,"cool":2},"o67Bxd1X0sf3EJOaMo2NgA":{"text":"Forgot to take a photo, but the boudin was amazing. Had the pork and a shrimp. Both are sp","useful":2,"cool":0},"6z894p_Ypt34iVaivn8kXw":{"text":"The service here always isn't great but this beer I was served is pretty special. I got on","useful":0,"cool":0},"sjQJtB7fc25pfTyImxrtdA":{"text":"Be careful going here. Poor service and poor attitude. I was really surprised by how they ","useful":0,"cool":0}}