{"VowDwFNUXRnjixRf8RGwIQ":{"text":"My husband and I are driving to Florida and stopped here for lunch. We got the special: gu","useful":0,"cool":0},"nUEY-yIWyan1WPyazglV6w":{"text":"Yup... great place to grab a sandwich!!!  While I was waiting for my fried oyster Po'boy, ","useful":1,"cool":0},"nL4gPTKWCw0KRbIBnWaQ2g":{"text":"Great local place with plate lunches and sandwiches. Lunch special daily. Great for quick ","useful":0,"cool":0},"IBoirtQWk8pD-vxIHXzbzQ":{"text":"Huge portions, everything is big enough for a meal and half for mere mortals. The po boys ","useful":0,"cool":0},"iWVhHOsy4jsfAQh0Y8R3KA":{"text":"35 years as a restaurant in NO. That speaks for itself. This is where locals go to eat or ","useful":8,"cool":3},"QhCMbA7D33zd1uLlv4I7lg":{"text":"Absolutely love this place. Family ran and the man up front (probably the owner) is great!","useful":1,"cool":1},"YtmopmC2mytakX7WyoY2sA":{"text":"This Resturant is the best place for poboys and daily special plates! I wouldn't go anywhe","useful":1,"cool":1},"ig7d6_RZoSitkiYOimneig":{"text":"Okay, I definitely love this play. I knew it would be a prize when the guy behind the regi","useful":10,"cool":5},"LMDKYR_gUqq3kyjDYh_q2g":{"text":"There is a reason this lunch only spot is slam packed every day of the work week:  the foo","useful":1,"cool":1},"2O0-kCEdKvX4tCjwtZKAqQ":{"text":"Loved it!  Real down-home place and great food.  Love the guy who rang us up and the bante","useful":0,"cool":0},"n-3ThaQa-G_A1-rZlnXuIQ":{"text":"I am in town for business and decided to grab lunch at this place since it was close by. I","useful":0,"cool":0},"UPlGkobaE-NxOW7arY2rbA":{"text":"Being from a Cajun family I felt right at home. Great atmosphere and delicious authentic f","useful":1,"cool":0},"XaOCfIDvLwRiy0fDvGLfew":{"text":"The daily specials are big enough for two people to share.\n\nWednesday lunchtime special of","useful":3,"cool":1},"PnwXFRM5kPNHWTDDOmmVHg":{"text":"I ordered a veggie sandwich.  At first they shocked because they had never made one, as it","useful":2,"cool":1},"Pd80Cut1DFluGohPs9hnTg":{"text":"This is a pretty good place for lunch. I had a roast beef po-boy and an order of fries. Th","useful":5,"cool":2},"2brP55S5FxmUrxFHVdP-Vg":{"text":"I had a ham poboy, the poboys are big enough for two people or one really hungry person.  ","useful":1,"cool":0},"NrlSPcGx05rU6Rvgi_cFKw":{"text":"Way out off the beaten path in New Orleans East lies a fairly small restaurant with a rock","useful":5,"cool":4},"Mmal78-7DUc3je-BbYBIFA":{"text":"So much good food on one platter. I had a platter full of fried shrimp and fish that was s","useful":1,"cool":0},"H7MdlsGauGg3D9Z9rB0cRg":{"text":"Ya' know... mostly I just check in. Even though I have reviewed this place before- I must ","useful":0,"cool":0},"Z95Brm0nnh2GoFh-_rVdiA":{"text":"Real Cajun food!","useful":3,"cool":1},"Lmkq2GUbyRQfqK4cF0hvcA":{"text":"I've lived in N O East for years. Unfortunately this restaurant has been forgotten about, ","useful":2,"cool":0},"l5g7y5Fzz-KUX7wGIPoPYA":{"text":"This is a terrific family diner that will make you feel like you've stepped into a bygone ","useful":1,"cool":0},"yjfznFiN0QTsbPmuGiYb0w":{"text":"This is a classic old school New Orleans restaurant, from the poboys to the lunch specials","useful":0,"cool":0},"E7nJG7i8aNf8RYyn-7ygdg":{"text":"This off the beaten path place is pretty great. I loved the service and the owner (you'll ","useful":17,"cool":12},"G3D2VsSX_YE5kJ2peW8vQQ":{"text":"Disaster, and contrary to other yelp reviews.\n\nYou ever see the movie \"Vacation\", and the ","useful":0,"cool":0},"wf2HZL9Wa-re9YevVUEumQ":{"text":"I decided to grab lunch from here because of the great reviews. Upon entering, my first im","useful":1,"cool":0},"18GAEpt0qnOlQAZ01s6BFQ":{"text":"Excellent food! Well seasoned everything! My friend had the meatball po boy-so good! I had","useful":0,"cool":0},"I-hk1ghA_FHvmwDhyIWk4w":{"text":"I tried this place today since I forgot my lunch at home. Co-workers recommended it. I ord","useful":0,"cool":0},"uMtSsTioULdMn1mCjwGcgQ":{"text":"Decent if you want a sloppy po boy or a mountain of fried food for a pretty decent price. ","useful":0,"cool":0},"XzAm_S1AfqmI2SuYbJ88vg":{"text":"The man at the counter offends and annoys me EVERY time I eat at Vucinovich's. Either he w","useful":2,"cool":1},"-Gm7cwu4LxEMyC3QwkrfYQ":{"text":", I'm at a lost for words! I really use to like this place! I went there on 3/2/2020 thoug","useful":0,"cool":0},"e75nLqk8CL5mRZE0RESAFQ":{"text":"Vucinovich's is a real diamond in the rough, and out here in no man's land, its very rough","useful":12,"cool":4},"rNku9behPMTQWoT0YExJKg":{"text":"I live in New Orleans East and always pass this place without thinking much of it. It just","useful":3,"cool":2},"hhHgBJXA8g-zhwO7lVYocg":{"text":"The daily specials are out of this world. You defiantly get your money's worth. The panned","useful":1,"cool":0},"skC4fMHdCpAhGB1cPtnYow":{"text":"I ordered two oyster and Fish plates from them today and I'm dissatisfied with the size of","useful":0,"cool":0},"T8B8gPPbKqP97RBS8yBdrQ":{"text":"CAJUN LUNCH FOR THEM BIG FOLKS\n\nIf you're not into authentic Vietnamese foods, Vucinovich ","useful":13,"cool":12},"ufOIXHqzICVgf4wqBU-nPw":{"text":"We ate lunch here the first day of Firefighting school. The amount of food you get is frea","useful":1,"cool":1},"gXr2GwUJD0EMMyd-60JqfQ":{"text":"Amazing, family-run, genuine New Orleans food!! Po Boys were some of the best i've had.","useful":0,"cool":0},"31dlOY66X2cZX_UaMFmHJw":{"text":"I love this place. They have daily specials that always have more than enough food. My fav","useful":1,"cool":1},"Gxts8_vvzHNkxPLjNCWiAw":{"text":"Hubby and I stopped for lunch and loved it. This is one of those places locals know about.","useful":2,"cool":2},"pG8XruLI4i8RkBadxBEwsQ":{"text":"Vucinovich is a hole-in-the-wall restaurant for truckers and New Orleans East residents. T","useful":1,"cool":0},"39Kn4pkDq0vKMRl2GuwGDg":{"text":"Nice secluded spot. The food is great and the service is wonderful. It gets packed during ","useful":0,"cool":0}}