{"UeXFQBh_IAdBWHGC3PKHtw":{"text":"THE BEST PLACE TO EAT IN NOLA!! There were 5 of us & we all ordered something different . ","useful":0,"cool":0},"x6zNRrIweGAlJ6MXPNx5mA":{"text":"Go see Sam \"The Man at the Bar\" A True Entertainer for the New Orleans Night Life and grea","useful":0,"cool":0},"m5TQ1bZEc5qNVWlKQ2_oDQ":{"text":"Food was great customer service was even better. Colleen was an amazing server! Most defin","useful":0,"cool":0},"vLwYqkJdFSYUKQqgGNTDDA":{"text":"Located on Bourbon st. Ordered the...\nBoiled crawfish - 1 pound for $14 (Market Price)\nJam","useful":2,"cool":2},"0ksCPfv7GXLfHKqKgShrEQ":{"text":"Only had grilled oysters at the bar but the service and the food was so good we went back ","useful":0,"cool":0},"T3VumenBsyA3d-Y9yO3SCw":{"text":"Awesome!  Terry came and introduced me to the restaurant and took my order. Teddy (yes dif","useful":0,"cool":0},"oDEbDGXyPbqiXLaPFToGXQ":{"text":"The menu had some interesting things on it that drew us in. We tried the alligator appetiz","useful":0,"cool":0},"7ugy-mWnTlvhdaJYTne36w":{"text":"Trash! Garbage!. Food quality is mediocre. Waited about 20/25 minutes for lukewarm blacken","useful":0,"cool":0},"V2lGYYS2yZoIZhYaSYOgkg":{"text":"Omgoodness! The food was sooo good! We had a party of nine and didn't have a long wait at ","useful":0,"cool":0},"bNRAipKvXuTbCaQwg0Ftqg":{"text":"After an late afternoon/early evening of walking around the French Quarter we decided to s","useful":1,"cool":2},"SHchhk3Wyp9BuDVIKfYntA":{"text":"Sat at the bar so we could see the ppl dancing in the street. The bartenders were very fri","useful":0,"cool":0},"5rpe3hYJr7o1wo2q-LeaNg":{"text":"First I was impressed by the GREAT service. The red beans & rice was delicious. It's a fun","useful":0,"cool":0},"uPDV8SqpN1HQneOohSbFAw":{"text":"Fried mushrooms where juicy and hot.\nAhi tuna is not worth mentioning.\nOyster with Tasso a","useful":0,"cool":0},"1pwoAIvVKOeFur_gdA2v6w":{"text":"We went here on our last night in NOLA, and it didn't disappoint. We tried the oysters, ch","useful":0,"cool":0},"pVjUzZ-qIwJzHEXqtnCsqg":{"text":"George had gumbo and shrimp and grits.  I had corn and crab soup and pecan crusted catfish","useful":0,"cool":0},"12b111No0Y7bQgPNxGTqyw":{"text":"Pier 424 has become our go-to place whenever we visit NOLA! The service is friendly and we","useful":0,"cool":0},"FW5EF8cLRIS11ce06m0-Dw":{"text":"Decent but not outstanding seafood place.  It benefits from a nice interior.  The fish and","useful":0,"cool":0},"nYw2lBY7pudDqEq3dk2kFA":{"text":"This restaurant is GREAT!!! All of the food was absolutely delicious!! Right on Bourbon st","useful":0,"cool":0},"HSGgicXp039toW987TVdqQ":{"text":"Ive been here a few times (over the years) but i never sat at the bar, this time i did. Th","useful":0,"cool":0},"mAUZW6gO3DNwFKyNfyV1HA":{"text":"Food was really good. I got the gumbo and charbroiled oysters. The service was even better","useful":0,"cool":1},"Jedb07waysmgTHV9KjX0Uw":{"text":"Decent food, the worst service I have had in years. The waiter disappeared for 10-15 minut","useful":0,"cool":0},"0SJQUJQBJ0NXVmFXYw4nsg":{"text":"My friends and I normally don't go to places twice in a year but we came back again the ne","useful":0,"cool":0},"OzYHYSTKoa5q4Mi9OqLfwA":{"text":"DO NOT EAT HERE! Total tourist trap! My husband and I were looking for somewhere convenien","useful":0,"cool":0},"EAPsEH1I-413r5pzIfO33Q":{"text":"First the good: Their chargrilled oysters were absolutely delicious. If you are looking fo","useful":0,"cool":0},"xITiTefOxTkOZtqiT0RNrw":{"text":"We decided to pop in while on Bourbon Street for dinner before partying. The initial servi","useful":0,"cool":0},"CRoCBFFAGq426SWJKzDufA":{"text":"This place is amazing! First time I came here was a year ago, had the best oysters in New ","useful":0,"cool":0},"aOSCvI_xfyWPndPIHtOthw":{"text":"The N.O. Trio of crawfish, chicken, and red beans was like rice soup with flavoring. Hardl","useful":1,"cool":0},"62qjZj3shjXmXPv4i-2v6g":{"text":"Awesome staff, Sam and his daughter really make the bar with with great customer service a","useful":0,"cool":0},"ecoTr-x4m2HdXGL9nQlAAQ":{"text":"Cool place right down on bourbon. Their food was good but not the best I have had in New O","useful":0,"cool":0},"Aqt6n-5qX-_axeV-9naNPg":{"text":"awesome food and service while im visiting NOLA..shrimp platter crab cake complimentary fr","useful":0,"cool":0},"zHazEmgkpuojGrtMsNMjZA":{"text":"Had a great meal here. First meal after arriving in city. Ordered a burger which was super","useful":0,"cool":0},"4EvWZ0Auuuwba2TsbeobCQ":{"text":"Husband and I walked by this restaurant on our first night in NOLA and made it a point to ","useful":0,"cool":0},"WYxUeC9skXOB2tJgLDRzKg":{"text":"Pier 424 had the feel of a corporate restaurant that was trying to pull off a local vibe. ","useful":2,"cool":0},"FZeg7tDgE0OizfLZtHV2kA":{"text":"The food was good.  The staff was amazing! It wasn't the best we've had since we got here,","useful":0,"cool":0},"RRPH2AnN0NCUgRCgOGjbwg":{"text":"Ordered the dozen grilled oysters. Followed up with\nCrawfish claws in a white sauce I can'","useful":0,"cool":0},"F-DF42v5wblm9xBYJTYw7w":{"text":"Horrible service. Great food. They took FOREVER on food and drinks and getting our check b","useful":0,"cool":0},"raikL8TG9wcZiHHX6iHwkQ":{"text":"The atmosphere is really cool and unlike any restaurant I've been to. The marinated crab c","useful":0,"cool":0},"D55rvx6sb6GtEbiSt8ogdg":{"text":"Got the seafood and oyster platters for takeout. Flavor was good, but I was saddened by th","useful":0,"cool":0},"gWMwz3JlXsBKRAHBtXsQ4Q":{"text":"This restaurant is not dark like most of the restaurants on Bourbon Street it's very clean","useful":0,"cool":0},"3l2li93go2rGP88McGFquw":{"text":"My only bad food experience in Nola.  The shrimp creole tasted like shrimp in a slightly s","useful":4,"cool":1},"-evsJtmm33mBWMdR93Tsxw":{"text":"My family and I took a recent trip to New Orleans and we ate at Pier 424.  The food was re","useful":0,"cool":0},"CTyGF27w2NM21JBKKUdcVA":{"text":"Cleo is the greatest waitress ever. She is fantastic She made our experience here the best","useful":0,"cool":0},"GQEc3Y3C2rvArQvi3l83NA":{"text":"Best restaurant in our New Orleans trip!  Every dish we tried here was execellent and once","useful":0,"cool":0},"VMlhQTMrYcGvvvjAX2y3-A":{"text":"We visited  New Orleans Louisiana. We had dinner at Pier 424 and want to say thanks to Sam","useful":2,"cool":0},"gBXdBTwF9Ye5zViNF1RRhw":{"text":"The shrimp and grits were disappointing. I expected big NOLA flavors and it was not there.","useful":0,"cool":0},"XGkJlyDGzGvlgyYMiZ3THw":{"text":"Oh my goodness. I had the shrimp and grits. I could have made a meal out of the corn hash ","useful":0,"cool":0},"kw8AMSvnI5vTEjog-njJRQ":{"text":"This place was an amazing surprise! We had walked by before and talked about going in, the","useful":0,"cool":0},"mb1c4-TUly8YIWGB98oDIQ":{"text":"There was 5 of us on a Sunday night we were staring away.... I should have thought twice. ","useful":0,"cool":0},"0sT73NNZB_9FU0EWyBWWiw":{"text":"My husband and I were sick all night the first night of our honeymoon after eating here. W","useful":0,"cool":0},"rT1eY2ux5YlYIkacantl4w":{"text":"Now first of, I've never had Oysters and that's why I had to try them. I had the Oysters M","useful":0,"cool":0},"p4T2YW1cEGx9lP5ZvNc_Lg":{"text":"Came in on a Thursday night.  Had a very confusing and long wait.  They do not have a good","useful":2,"cool":1},"Ctkhb7rZY-HJhQngdsCejw":{"text":"Made reservations at 8:45 and got shafted in the seating arrangements.\n\nThe door man and o","useful":0,"cool":0},"3TGchfRE9UQAJNMbRiduJQ":{"text":"Outstanding.  I was there on a Monday night at 6pm.  Place was not busy yet, but plenty of","useful":0,"cool":0},"NMgxUFFmfDWEPo8pbU2ZuQ":{"text":"Food was tasty. We had the crab claw appetizer my husband absolutely loved it. Pricing is ","useful":0,"cool":0},"czuTJZAIgDxuJ1Yu5ZvdFQ":{"text":"Got to try! Seafood heaven, everything is fresh, great customer service! Cleo was our serv","useful":0,"cool":0},"7fFpU3w3ynHSEutP5fgA1g":{"text":"The food was absolutely amazing... my waiter Sam was amazing... he took our orders and eve","useful":0,"cool":0},"pgGlKz2QpomL3Yud4GBr2A":{"text":"Everything that i ordered was very good here. We started off with a dozen oysters with som","useful":0,"cool":0},"hLCXv8JRMtbFgljPpxpT9w":{"text":"Stopped by for oysters and crab & corn chowder.  A great meal!  I would recommend a stop h","useful":0,"cool":0},"oTjB0cDL1ZU2av92JlqVxw":{"text":"Yum. right on Bourbon Street, Shrimp platter amazing and huge portions, crab cake snob app","useful":2,"cool":0},"-_Oqw0WsOx7XqhZFYNSl1w":{"text":"I had a bowl of boiled shrimps. It was good but a little bit salty. $24 for 1 pound of shr","useful":0,"cool":0},"QmhDHpgRYBeEenwsXsWmAQ":{"text":"Service was very friendly. I was boring and got the boiled shrimp, and when it came out I ","useful":0,"cool":0},"HkEwHMPqODRQkeQjsBE1BA":{"text":"COME HERE FOR THE WORST BOIL IN TOWN, TOPPED BY THE MANAGER'S  PERSONAL INCLINCATION TO UN","useful":2,"cool":0},"87ajb-vLcpclzrLo-WCdag":{"text":"Below are the reason this place gets four stars:\n\n1. Everything we ordered tasted great\n\n2","useful":1,"cool":0},"bwriGBrxsyhG4Lz8i5lzFQ":{"text":"I'm totally not understanding all the good reviews. Maybe my palate is off, or they were h","useful":0,"cool":0},"6AkB3wZqaOkZSw5N3cgMjg":{"text":"Had a great time on the balcony for the parade food was good I had the wings and they are ","useful":1,"cool":1},"n5vNH0OtBhHGeABuGCeyhQ":{"text":"Two things stuck out about my first experience at this restaurant...\n\n1) The staff was ama","useful":3,"cool":0},"b0_dKxcRFkjw8V-M1RCOpg":{"text":"Slow start but ended great. \nSeafood Lover's Steal!\n\n\nHad a great time at Pier 24. When my","useful":1,"cool":0},"_dJBb6Vhopr4H5fN2dpHgg":{"text":"We went here on a hunch before we did the bourbon street tour during the week. We went on ","useful":1,"cool":0},"OguiP7axGzaqqA2UzMFRJw":{"text":"Fresh food and friendly staff, only problem was the strip club owner across the street sol","useful":0,"cool":0},"v1ow10QweeMmSm0T77luwQ":{"text":"In the French Quarter you always have a choice for a seafood house; we came to Pier 424 to","useful":0,"cool":0},"S5KnE1xmDeH8H2IYtQhbxQ":{"text":"I stopped in after the Charger/Saints game for a bite and got some oysters and a beer.  Th","useful":1,"cool":0},"eUHEkwgk1PzTK9kz8g6PiA":{"text":"I had a great experience. Sat at the bar and ordered crab claws.  They were perfection wit","useful":0,"cool":0},"wj1Pvzq-nn67NaBBcG_QGA":{"text":"I stopped here with a few friends for lunch and we weren't disappointed. The corn & crab b","useful":0,"cool":0},"DIiMnglHV9HMmX3oaG3QBg":{"text":"This is one of the best restaurants I've eaten at on bourbon st. The service was on point ","useful":1,"cool":0},"UzKdRL6nZqmXsGEp_u5djQ":{"text":"Good place to eat, I wouldn't call it amazing, but the food was pretty good, the service w","useful":0,"cool":0},"fqTY1E_4c6EJIqeUkmEFMw":{"text":"Went here for our first nights dinner in NOLA. Sat right near the street so it was fun to ","useful":0,"cool":0},"DDzd49nfEi2rtwD1gIy8kw":{"text":"VERY slow service, food just ok, ordered raw oysters they never were served. Gave up paid ","useful":0,"cool":0},"ru-yrsQC-ZID5AV1I5jPbw":{"text":"Great oysters and great meal! Raymond working behind the bar equals a good experience. He ","useful":0,"cool":0},"lQM4DRa6-pYrJPUNp8YW2A":{"text":"Date Night!\nDecided to stop for drinks and a couple of appetizers-Raw oysters and fried cr","useful":1,"cool":0},"WKfV8rGeWAAvzFyV9IA7bw":{"text":"Great food and they take good care of Military. Our server Alyssa was super attentive and ","useful":2,"cool":0},"gQIPTEdJZHMwKx0pM-jx8g":{"text":"It's pretty simple.  If you're on Bourbon street during Mardi Gras and you're hungry for d","useful":0,"cool":0},"OyKTAWFVnC5E85oq6m8Cjg":{"text":"The food was mediocre at best and the service was so slow. There are a ton of better resta","useful":0,"cool":0},"j-zXmum_ZsYE-pYsm0sRXg":{"text":"Everyone complaining about service must not have had Tre' as their server. Tre' was GREAT.","useful":0,"cool":0},"gTgfkGzn-OV5EMTS61Pd4A":{"text":"Negative stars!!! TERRIBLE TERRIBLE TERRIBLE \n\nI own one of the local Walking tour compani","useful":0,"cool":0},"px-RKPhkfQDZSCwt6Uw-bw":{"text":"Great food, hostess was great and always kept my glass full, tried the frog legs and allig","useful":0,"cool":0},"Hd2O8cDoqwM8kdK35Erypg":{"text":"It was just \"OK.\"  Went in for a poor boy sandwich.  The bartender said \"you can get one o","useful":0,"cool":0},"-qT8gfrEpL_N8YHulDVRlw":{"text":"I ordered the shrimp pizza boy and a cup of gumbo. The food was excellent but the service ","useful":0,"cool":0},"I3eH8nAHBLNcnPOuDHf1gw":{"text":"Omg ontop of the food being sooooo good. Shrimp and grits and the crab claws. Sam our serv","useful":0,"cool":0},"mO2mqLfKemY5aRk5UHygxw":{"text":"Went 9/28/14, just walking around and saw Pier 424. Prices are extremely high for what you","useful":0,"cool":0},"n0Y9qwrXZD1U4r-O4yK0xw":{"text":"Fantastic!  Service at the bar by the bad muthashucka, Raymond, was on point.  The Food wa","useful":0,"cool":0},"0tUPzCx2mlwaxYxETqj12w":{"text":"Food is fine but comes slowly. The waitress had the worst attitude that I have ever seen a","useful":0,"cool":0},"qDvjTa2vdS6S3Wnqq_1a2Q":{"text":"Not a big fan of this place, everything came out like it was from TGIF... enough said?  Th","useful":0,"cool":0},"oFA88dXKlO_IG6qg86prdg":{"text":"Food is delicious. Wish I'd eaten here there entire length of my visit. Drinks are delicio","useful":1,"cool":0},"QXailOG2Lmy-RLn4BSh_gw":{"text":"Oysters are the best here! We have had them at a lot of places around and these were the f","useful":1,"cool":0},"qxJjvPcYf2rqD-lIn6FegQ":{"text":"Raw oysters are to die for and our server Frank ROCKS!  He made our dinner extra special b","useful":0,"cool":0},"n59Wg39DacawBQ0S51LLlw":{"text":"We ate here 2 nights in a row and both nights were outstanding tonight we have the shrimp ","useful":0,"cool":0},"mynLZumR_33J7HRdnA7vIA":{"text":"Robert from NYC was so helpful. Gave a great recommendation and was an outstanding waiter.","useful":0,"cool":0},"2Gx_UEE_nWvNaZ4gYCKucg":{"text":"Salty. If your on a low sodium diet ovoid like the plague. Disclaimer: it was 2/18 at like","useful":1,"cool":0},"tdCMGxkAUgrzWa_Qt12D-Q":{"text":"For such a central location on Bourbon street they were under staffed. Our waitress was sp","useful":0,"cool":0},"Jk49WHs1w7V11ileQjzkhw":{"text":"Wife and I chanced upon this to get off the stench that was Bourbon Street, and were delig","useful":0,"cool":0},"qFujq4VZCdIWkmyUFjBB8A":{"text":"We live in the neighborhood and was pleasantly surprised by the food here. Had the gumbo, ","useful":0,"cool":0},"jylHFByad0Br4tELZzOf-g":{"text":"This was hands down the best seafood when i came to New Orleans. No crowded for some reaso","useful":0,"cool":0},"p8MzIcpZiBTqyVg_spqOkA":{"text":"I am not new to New Orleans and usually only come for the amazing food. I mean you can fin","useful":0,"cool":0},"WJfQGMRFv_-p5EWGRra-xw":{"text":"Great food! We were walking around bourbon street and stumbled upon this restaurant. I ord","useful":0,"cool":0},"psOayJL4LcSk51Ty2tF_4Q":{"text":"We have been here before and had a good meal but not tonight. I had the crab cake/ shrimp ","useful":0,"cool":0},"zln9mJVBSnxENNWf7id4gA":{"text":"Stumbled into this place yesterday March 6th after walking around looking at million menus","useful":0,"cool":0},"atrYzDaY9ZXYT9Ibhhg3tQ":{"text":"Flat awful the worst disgusting food I have ever eaten shrimp are not supposed to taste li","useful":0,"cool":0},"hfyExUjwC9PP0DU58W0aGA":{"text":"Wanted to say Thank You to our server Ashan T.\n\nAfter having a bad experience and wasn't a","useful":2,"cool":0},"CWk-QnC_vjPWPGVesSOXKw":{"text":"I went to Pier 424 and had an amazing time. My friend and I were going out for our last ni","useful":1,"cool":0},"ct36A2wHBulOVKBmsDk6sQ":{"text":"From the moment we walked in the service was fabulous!!!!! We were greeted by the hostess,","useful":0,"cool":0},"ROKiMhlaFelar1JSSg3zig":{"text":"This place is amazing. I love to try new and local foods. My meal was one of the top 5 foo","useful":0,"cool":0},"F0Ejmy1wrX9W60mFCGAmqA":{"text":"The three is for the food, the waiter was loud and rude. Got our order wrong three times.","useful":0,"cool":0},"Og9O10iJkDS4XLyey9R-4A":{"text":"I was on the hunt for the best oysters in the French Quarter.  This was my first stop and ","useful":0,"cool":0},"bEuOEQ02JikY-wfQX_30hQ":{"text":"Came here for their boiled crawfish, they were over cooked. Order came with corn, sausage ","useful":0,"cool":0},"WtcBUIsjK8G8PEH9TnoWvQ":{"text":"Oysters were dirty and not so fresh :(\n\nThe shrimp remoulade was good but nothing special ","useful":0,"cool":0},"pVhoD0tbgG3gRhH3OckMOg":{"text":"We had the appetizer crawfish lettuce wraps and they were SOOO GOOD!! You must get these. ","useful":0,"cool":0},"KfeurJELqEu4IBvvTK-NVw":{"text":"Hands down the best oysters in town! \nSam was an incredible bartender and an even greater ","useful":0,"cool":0},"AWi6cW7VRIMNM6QjeGHgeA":{"text":"Love this place!!  Had alligator and oyster on the half.  Met Sam who was shucking fresh o","useful":0,"cool":0},"oGDKEWDusDm86bSudEmSAg":{"text":"Had to walk out. Seated and no service. 7 filled tables. Wait staff sitting in the back ta","useful":1,"cool":0},"vgc6aW2YjK1k712aHponnA":{"text":"Visited this place on vacation with my parents and boyfriend. We had a very friendly waitr","useful":2,"cool":1},"LD2cQaHIkyOUnsTO4nwrew":{"text":"The food (I ordered crabcakes) was delicious. The service however was not great...our wait","useful":0,"cool":0},"bLgS7pCvmVCxQo0yWpRDJQ":{"text":"Food was outstanding! I got the shrimp and grits and my husband got the seafood Alfredo. B","useful":0,"cool":0},"b7miXUYfRcF91MbdK5yr8w":{"text":"It's not the absolute best I've ever had however I really did enjoy the environment in our","useful":0,"cool":0},"hihLpYGuaUbrwn0UgZfckw":{"text":"Great flavors  had turtle soup, chargrilled oysters and shrimp and grits but the only issu","useful":0,"cool":0},"Udmpw9QUOa6402PLUrYipw":{"text":"Missing hospitality everybody was in a \" I'm getting there mode\" .  My po boy was drier  t","useful":0,"cool":0},"ZOJVkHhGMeg4RB4-CARdDA":{"text":"The crawfish are fantastic. Squeeze the heads over the potatoes for a savory snack. Would ","useful":1,"cool":0},"Y1Yl4ICc0MmMW8Xt8rKYxw":{"text":"Raymond is the man!\nHe took care of us at the bar last night, and really impressed us!\nHe ","useful":1,"cool":0},"Arqm0KcYQWTzELZawdAYnA":{"text":"The food here was impeccable ! We were welcomed by the hosting staff and enjoying the most","useful":0,"cool":0},"rcBoeGyVjQZ-FgqCzdGmiw":{"text":"After walking the street we decided on this dinner spot based on the looks. The menu looke","useful":0,"cool":0},"hsn5PhZ86zunzDIxieu8iA":{"text":"Service was awful... and it wasn't busy at all, it was almost empty..took us so long to ge","useful":0,"cool":0},"lr3OMjsLJtO2AlGFh4sRkw":{"text":"The shrimp and grits were excellent!!!!  The crab cakes were also very good.  Sam behind t","useful":0,"cool":0},"SHgi3Vu9WkokLzxQjKQ-0g":{"text":"We just happened to stop here for a drink, sat at the oyster bar and had such a fun time w","useful":0,"cool":0},"b6ow0Dv4qmmlwb_wkpGLOQ":{"text":"Came with a group of about 25 -- had \"reserved\" the front room with the open-air windows. ","useful":0,"cool":0},"HzbM2hgijVlxlSiUBNFyvA":{"text":"This restaurant is one of the few places on Bourbon Street to escape the silliness and get","useful":0,"cool":0},"k1ws3dTwQ5vQ65t1QbGfPw":{"text":"My mom and I were visiting this weekend and I was craving some boiled seafood.. locals dir","useful":0,"cool":0},"jZQc9GIFGMiIeiTW_wOtNQ":{"text":"The food and atmosphere was awesome! My waitress was very nice and the mAnager seen to be ","useful":0,"cool":0},"65VzZIsSva8NzpitcxF31g":{"text":"Was walking down Burbon and a hostess by the door encouraging my party to come in. Such a ","useful":0,"cool":0},"-1mgRMWOE-n6NfTWUkxCTg":{"text":"Great wait staff!\nEunice made helpful suggestions for myself a first timer at the restaura","useful":0,"cool":0},"CKOWk8ocAuDMTBVAncsjVg":{"text":"Service? For 15min sitting in the restaurant I learnt the whole menu... And left... Nobody","useful":0,"cool":0},"tYHojwb5qveWtcr4RwEQ9g":{"text":"Omg! They serve the BEST oysters ever! No lie! Me and my girl ate here twice just for the ","useful":0,"cool":0},"2bFJSMPSq2OiOpB-nhkg1A":{"text":"We came here on a Saturday night around 9pm and were seated quickly, but then waited 40 mi","useful":1,"cool":1},"wwA61xTIa8-DChk3aVdjjw":{"text":"Had the Fried Mushrooms, Fried Alligator Poboy and The Trio which included Red Beans & Ric","useful":0,"cool":0},"28pPEwaTGe2xHPYK6d6UWA":{"text":"Even though the food was decent out service was very very poor. Our server was very slow w","useful":0,"cool":0},"0ZYt92G3EoIatLA-tabjuQ":{"text":"Crawfish was good...everything else sucked.  Alligator sausage sandwich was inedible Servi","useful":0,"cool":1},"LXpZ65knYapYyHZ4E8-tAw":{"text":"I ordered the Pecan Crusted Gulf Fish. It tasted fine, didn't knock my socks off or anythi","useful":0,"cool":0},"erQMEwsireP6dmJSRl44oA":{"text":"My husband and I stepped up to the hostess and for several seconds she ignored us but I wa","useful":0,"cool":0},"oAOvmI5BCfI9-UfP8TS9RQ":{"text":"We ate at this restaurant, it was right in the French Quarter. It was hot & humid, so the ","useful":0,"cool":0},"qXNrhl2eyCN30CMFY70BJQ":{"text":"Outdoor dining on a beautiful Friday afternoon in the French Quarter! Sunshine and iced te","useful":0,"cool":0},"76dRVesy0BTX68jYAKNSLg":{"text":"Food was average.  Shrimp, oysters, and crab cakes were much smaller than the offerings at","useful":0,"cool":0},"4oRarddxH0Y9QDwbDunhDg":{"text":"Came here on Christmas night and there was a long line to get in, but it was worth the wai","useful":0,"cool":0},"ctWc1Wpia00wgFhOZS-R0w":{"text":"Great service! Nice atmosphere. Fries are nice and crunchy, stuffed shrimp were good, stuf","useful":0,"cool":0},"G9MIlOooVv2TQkwPahTbSw":{"text":"We only went here because of a free appetizer coupon we got from Yelp. That turned out to ","useful":0,"cool":0},"-3g_-7165s5SCqUwMECDMw":{"text":"Expensive drinks which were very watered down and made incorrectly, although when we went ","useful":0,"cool":0},"y68CwYNueG6DATy2TF9auQ":{"text":"Horrific service. Weekly visitor to NOLA for business came in solo. Waited ten minutes for","useful":0,"cool":0},"REqlGsMop80RGQML1hoDSg":{"text":"We enter the bar area glad to have found 2 seats at the end and close to the door so we co","useful":0,"cool":0},"59QbEHKeYIInf0QH41n4Iw":{"text":"Our server changed twice because the first forgot about us. We waited over an hour, when o","useful":0,"cool":0},"TheUdbdgvTAdS-XOUC4o6g":{"text":"Try the sautéed crab claws!!  We just stopped in for a to-go order of boiled shrimp. Had t","useful":0,"cool":0},"jXmjHyrJz32LENdgRvGTqA":{"text":"Great food, cool atmosphere and quick, attentive service. Great place to have quality food","useful":0,"cool":0},"Ai8WQd57nUCbwLW1fU-rXw":{"text":"This place has great food and a great atmosphere.  I got the ribs, which were tender and t","useful":0,"cool":0},"zOuJTSN-2n9BJlX2bijGsw":{"text":"The oysters were pretty good. They aren't the best to be found in the Quarters, but the pr","useful":0,"cool":0},"-FfrDkOK0QJPR4vBXBESTA":{"text":"We ate here for dinner the other night.  The location is really good being on Bourbon Stre","useful":2,"cool":2},"NH2fKLgZS13gsy_nfv-DrA":{"text":"This place is kind of a hidden gem, it sits on Bourbon Street. From the looks of it you wo","useful":0,"cool":0},"wfiSzk9oXTMdcSdTIWWLbA":{"text":"Can't review to food but service was terrible.  Walked into this place at noonish on a \nTh","useful":1,"cool":0},"Vws513mBUm1Z_uKM9Hsz7g":{"text":"Never again. Tried this place twice to give it another chance. The only thing I enjoyed wa","useful":1,"cool":0},"zdorslYEOms_hSDa8Sr1WA":{"text":"Food was below average and overpriced, but I guess that's what you get for going to dinner","useful":0,"cool":0},"6jqG8vUtvkq0NrQoHPEU_A":{"text":"The appetizers and drinks were my favorite. Really good. The entrees were okay but there a","useful":0,"cool":0},"h-Y2quDQTRKwXfrTbkIDIg":{"text":"Had a dozen charbroiled oysters today that were amazing! The cheese was even golden on the","useful":0,"cool":0},"Ips5YTJVCJcFI8I9qHx0PA":{"text":"I was in the mood for oysters and stopped in for a snack.  The restaurant wasn't too busy ","useful":2,"cool":2},"uI6G8ViV2gol63x2HSZBmw":{"text":"Delicious! Sat at the bar & server was awesome! Bloody Mary's were great & made with Tito'","useful":0,"cool":0},"stPrOn-QWB35uDuAsOpfEQ":{"text":"I really have not had many bad experiences while visiting NO and this wasn't an exception.","useful":0,"cool":0},"-nWpwdx7-1_qv0HxQBJzag":{"text":"Good service and all, but the food was mediocre. Red beans and rice....I found out after I","useful":0,"cool":0},"h92uXh6058NFYHln9Z57kw":{"text":"I stumbled across Pier 424 when looking for a bite to eat on our first night in NOLA. The ","useful":1,"cool":0},"8oVihbc5n8mjHOXb6R-bbg":{"text":"Great food bad service waiter left for 1hour  and waiter wasn't very knowledgeable of prod","useful":0,"cool":0},"6h-MSytkgyzzsnHdOYzz7w":{"text":"Our first meal in New Orleans. Fried alligator po' boy and seasoned fries. Service was gre","useful":0,"cool":0},"e_JsL6o_13bduXRdXuwQMg":{"text":"First time to New Orleans and French Quarters. Pier 424 was the first restaurant we had di","useful":0,"cool":0},"ElYrPr_iSlpMj4OJW7YGXA":{"text":"Had the creole pasta and Cobb salad. Food was average. However, the ambience was nice. Not","useful":0,"cool":0},"qkByd1IS4VLxaL58wUZqSA":{"text":"We had the shrimp platter and split it between 2. Let's just say we took 75% if it to go a","useful":0,"cool":0},"YTMTp-KjsQE3ZX-V0HEj6g":{"text":"The staff at this place made me score them low. The host took my name down and then left f","useful":0,"cool":0},"pLr84c8FI3sqgplmvgIZhA":{"text":"We were visiting Nee Orleans for a long weekend. We stopped here Sunday night before headi","useful":0,"cool":0},"ulJ017tY4GhAjdjusBCTlQ":{"text":"The ocean crusted catfish and shrimp and grits were both savory and excellent. Our waitres","useful":0,"cool":0},"RKAF6IGw5uLQXP73ppnKCg":{"text":"Not one of the best restaurants we visited.  In my opinion, the foods need more spices.  \n","useful":0,"cool":0},"mV0x10YoQ_wllK6FWgigMw":{"text":"Great service \n\nSlow to get food although it's probably the New Orleans normal slow pace c","useful":0,"cool":0},"OFN1cKAeBrzd5taPUPkniA":{"text":"The food I had was terrible.  I ordered crawfish it was over done so much I had to send it","useful":0,"cool":0},"YehDTsZXKXRnffN0ECb8aA":{"text":"We were looking for dinner on Bourbon St. and ended up here. I loved the free appetizer of","useful":0,"cool":0},"4yYtY90Rh98o9AFFsyxDzQ":{"text":"Food was great. Right on bourbon street and an agreeable contrast to the madness outside. ","useful":0,"cool":0},"1qrCWCHWqvDhKv5Su7sleQ":{"text":"Sam is a staple in this restaurant! We sat at the oyster bar for our very first time havin","useful":0,"cool":0},"NNmzrIAg9KtcIdvVKRi_Hw":{"text":"Was looking for some authentic Cajun cooking. Found this place online while walking the Fr","useful":1,"cool":1},"XE1Z5YNqgDzKHq_A8bzAVg":{"text":"Service was decent. We were seated immediately and our waitress was very polite and prompt","useful":0,"cool":0},"Fe6gLxzpiMhS0UnyyHdE9g":{"text":"We were able to sit on the balcony and eat. It was the perfect spot to eat and people watc","useful":1,"cool":1},"p1zt0AVV-vNEFzMNpF3Vfg":{"text":"Love this place, the service was great and all the workers were very nice. We came in a la","useful":1,"cool":1},"jyJlDN3AAuWvgS_H8pEsSw":{"text":"The most uninspired food I've ever been served. Salads all with iceberg lettuce. Need I sa","useful":0,"cool":0},"fDESiggIv1HOdPERO8OMWg":{"text":"Food was ok. My friend ordered the Shrimp Creole and didn't really like it. I ordered the ","useful":0,"cool":0},"K0uPfKwk8YLplEblVrVVsA":{"text":"We were looking for some oysters, came across this place because we wanted to be able to s","useful":0,"cool":0},"5jjKC8fujIyAMsRhuiwz4A":{"text":"Pass on this place. It's really only a 2 star because it was like 2am and it was entertain","useful":0,"cool":0},"am6dJX0cPWqk3iZC3h8zUw":{"text":"The Best!!! Love the fish PoBoy and Gumbo!! Waitress was amazing!! Will go back... Amazing","useful":0,"cool":0},"BOV1X1kkB3s2Yp8eS4hg-g":{"text":"Turtle soup, frog legs, crawfish étouffée, gumbo,red beans and rice...we got our swamp on ","useful":0,"cool":0},"4TWKC1P95c7V8pPzYajK7g":{"text":"My husband and I found this place by pure luck! Crab Cakes...delicious! Shrimp...were the ","useful":0,"cool":0},"9GKrn238C-6XyUico2_CvA":{"text":"We had just eaten prior so we weren't really that hungry.  It was really busy and the serv","useful":3,"cool":0},"ZnPHJkQIcxhEfUvG9s2MEg":{"text":"Loved it!!! Took a chance on new place! Shrimp and grits ... Love!!! Almost a corn chowder","useful":0,"cool":0},"DW-uDmf-9gmZXfjQpJSNhQ":{"text":"Yummy food! Strong drinks! But a very odd silly waiter, only okay because we're in Nola! ;","useful":0,"cool":0},"odBGVBlPjWw2O9Fe4pG48w":{"text":"This restaurant has a cool vibe and good seating area right on Burbon St. There are tons o","useful":0,"cool":0},"Ia4OykdCOIY8N_2aClvr2A":{"text":"This place was amazing. Great food great price and very friendly staff. \n\nMy dad had the f","useful":0,"cool":0},"0fsTlHDmtqknM59XGlV3IA":{"text":"Stopped in here for a quick dinner and to watch a football game.  This place was pretty pe","useful":0,"cool":0},"hqekl-stwZm17Vw0Vl4diA":{"text":"Ordered the fish poor boy.. fries were cold the sandwich had no dressing and the bread was","useful":0,"cool":0},"9LN5OBT96wfGMY4PNEhwlg":{"text":"The staff were super friendly and took care of us from the moment we hit the door. Our wai","useful":0,"cool":0},"xEATG0TTNngLGjTV6Ybcgg":{"text":"Food was HORRIBLE!! Food was cold and dry. Service was mediocre at best. Would never eat h","useful":1,"cool":1},"hiuh1h2DOCcmc8s5xNWDpw":{"text":"My 1st time in New Orleans. Outstanding oysters and chicken alfredo!  Servers name was Fra","useful":0,"cool":0},"RAOETa89wvTh7Ox7CuYLPQ":{"text":"We had a reservation for 30 that was made over a month earlier as it is a tradition for th","useful":0,"cool":0},"xU0_18yyfaOpFenPRgiVyg":{"text":"Nice place to eat as the Corn & Crab Bisque was warm...the Seafood Platter is filled with ","useful":0,"cool":0},"2WcOdxSeFSUtmIZ-4GKTUA":{"text":"A bit pricey, food is okay. Can't go wrong with raw oysters though! \n\nShrimp po boy was ok","useful":0,"cool":0},"DU9mBHZVsjPxVvpxp8LU0Q":{"text":"We were looking for a great place for dinner on our last night in NOLA, and Yelpers said T","useful":0,"cool":0},"P4ecPC0rULKjum4_eWqVxA":{"text":"Loved this place! Randomly found while looking for crawfish for lunch. Stopped here and gl","useful":0,"cool":0},"cUV5AVEkCKmQTKn1Y26mmA":{"text":"Worst restaurant ever! Today is Christmas Day, the waitress keep us waiting for 50 minutes","useful":0,"cool":0},"JUNUuiAr7PlAbV6djxh40Q":{"text":"Bomb Crawfish.  Nice and spicy, great flavor.  Semi pricey but it's on Bourbon St in the F","useful":0,"cool":0},"TLQQbLrizz8pCNAspiam2g":{"text":"When you are in the quarter, there are good char-grilled oysters and there are impostors -","useful":0,"cool":1},"hCmnLJlTk8ye5pepL-6ccA":{"text":"Had the charbroiled oysters. Delicious... Service was a bit slow, and apps and entree came","useful":0,"cool":0},"CJd_l27mWYxAt-nHP1lJqw":{"text":"Excellent Jambalaya! Blackened snapper was amazing too. Calamari was a little chewy. Overa","useful":0,"cool":0},"v8HAHVbEq_B0odbcx682cQ":{"text":"First off our server D was amazing. Super friendly and professional. Kudos to her. Seafood","useful":0,"cool":0},"IUkOQUupm7-iZodkn2RIYw":{"text":"My favorite oysters were very good but a bit pricy~ It's a Bourbon street so what would yo","useful":0,"cool":0},"SlGj_NCr8nWsZtToG0ZZsQ":{"text":"Food and service was very good. A must try. Ask for Dee. Very good waitress. We will defin","useful":0,"cool":0},"QeA-PTlIdtB4h2G85TfV9w":{"text":"First night in NOLA...where to eat?  There's tons of places to choose from but nothing sto","useful":0,"cool":0},"b5rrFxhGS0A22l8A6Jj_bg":{"text":"The food was amazing. But for the price that you pay for portion its gets a little pricey.","useful":0,"cool":0},"0BPGNq3wQ7Z7ZZzC31q0SA":{"text":"Waitress cursed at us and waited for us outside the restaurant after talking to the manage","useful":0,"cool":0},"n7k_APT5nvf2HjDNTC6aFg":{"text":"Sam is AMAZING!!!!!  He mad me try raw oysters for the first time and it was delightful!!!","useful":0,"cool":0},"26l5EV81B2DMQC1WddZsXw":{"text":"We come to this place first, every trip to NOLA! We sit at the bar and get a Bloody Mary a","useful":0,"cool":0},"iSrcL_n1C7Px2Uq3EZFXUA":{"text":"Just arrived in Nawlins and we went direckalee to down der by da bourbon st. First restaur","useful":0,"cool":0},"abAIORBZuIv3-WmVLzevSQ":{"text":"The raw oysters was great but the service was real slow to say they didn't have anyone in ","useful":0,"cool":0},"4-F_WkPybS48fmP7tiuMog":{"text":"Absolutely the best fresh oysters in town!!! A dozen for only $13! Yummy!!!","useful":0,"cool":0},"FaqpYXEZlkxPshLRtiJsaw":{"text":"We stumbled upon this place as we were desperately looking for a place that allowed people","useful":1,"cool":0},"090nrT9hkFaRMi3PHdCzJg":{"text":"We stopped here for dinner solely because they were open late.  I got the crawfish pasta p","useful":0,"cool":0},"z0hOxH5hEV8g27p2-RcnxA":{"text":"Great place to eat on Bourbon Street...my husband and we're here in NOLA for his family re","useful":0,"cool":0},"u2pgK5eVUEpw1jy3zLAU0Q":{"text":"Ate lunch at this place on a Saturday. Ordered the crawfish queso for an appetizer and the","useful":0,"cool":0},"pzhnBP3kYr49WjLGQQYBAQ":{"text":"So I've been waiting on my good for 45 minutes and still have gotten it.  The bartender co","useful":0,"cool":0},"oImW7nojcoFXs4UI8knEqg":{"text":"The service wasn't great here. Our waitress forgot our drinks and rarely checked on us thr","useful":0,"cool":0},"vghEnvJBVctu_8YDjYRjWw":{"text":"Garbage. Mediocre bland small seafood. Good service though. \n\n25/lb for tiny shrimp. 30/lb","useful":0,"cool":0},"joS8ADRAU3i2LO7XcHu-Xw":{"text":"Located on bourbon st, this place has some really great Cajun/creole dishes. I had the cra","useful":0,"cool":0},"8HA8cUyrp05tf7gbcQ8ixA":{"text":"Worst experience on Bourbon Street for my wife and I.  While I don't expect a lot from mos","useful":0,"cool":0},"OCODGf_q8llKqwUPwkdPwQ":{"text":"After the hostess asked us four times how many people were in our party... we were the onl","useful":0,"cool":0},"o9OOI4x8MkQPNUYU5m-Cmw":{"text":"1st time here a little nervous cause I checked the reviews but said what the hell. It was ","useful":0,"cool":0},"eQ01t9qi4uECYTEmiqghBA":{"text":"The service was very good and they have some nice tables right on Bourbon which provides p","useful":0,"cool":0},"J6PgMTdf-FA8AbmO4OzLZw":{"text":"We had a party of 15 and were totally disappointed with this restaurant. Cold food, poor s","useful":2,"cool":0},"zl5HknK8qairlnWr0UV0ZA":{"text":"Oyster and shrimp platter was good. Decent place since other restaurant had long lines. Se","useful":0,"cool":0},"whU1lHHmgYSlremfeaOr2Q":{"text":"While visiting New Orleans for the essence music festival, I noticed a place on Bourbon St","useful":0,"cool":0},"p3V8HTEJmn0eLnou4Q9XMQ":{"text":"Service, atmosphere and food great... Good place to cool off, eat and watch the game..","useful":0,"cool":0},"j54KG9-kXjxbkaDPue_QMw":{"text":"Food was decent. Service was not very good. I ordered crab legs but got crab cakes, ordere","useful":0,"cool":0},"FZWVsZa1_GfmUrT0uI4Mww":{"text":"Great fresh oysters.  Amazing atmosphere.  Awesome staff.  The Cypress Room is an excellen","useful":0,"cool":0},"txGekjZKxyv_sHq5pjbi1g":{"text":"Had the fried shrimp with hush puppies. Sat at the bar in the afternoon. Place was pretty ","useful":0,"cool":0},"tJ2_-cxNLngcbb1Dugoyjg":{"text":"Overall.   Happy with the food, service and atmosphere.  Had 6 raw oysters. Thought they w","useful":1,"cool":0},"8WVBEetUxHdB8tEpS7Barg":{"text":"Horrible service is all I can say......too many places to eat in the quarter to have wait ","useful":0,"cool":0},"miWDYBOU2qAZh5-taUc2NQ":{"text":"Oyster is so so. Cajun shrimp is terrible. Just boiled shrimp and corn, no taste except sa","useful":0,"cool":0},"p_7PmpbUlzcU5Y9J2RE_VQ":{"text":"Impressive Thanksgiving dinner with all the fixings!\nThe gator bites were yum too.    \nLow","useful":0,"cool":0},"l4XYh2Es9eOQg80wJtL7OA":{"text":"This is a great location on Bourbon with balcony seating and reasonable prices.  We had th","useful":0,"cool":1},"uI5DHWERF1SWt7WLjHFv9w":{"text":"Stayed in NOLA for it days and ate here 3 times. GREAT food and GREAT atmosphere and amazi","useful":0,"cool":0},"z2Fu2ivv1mmc7klMXB6ILQ":{"text":"Wow  Class all around!! What awesome food and staff. Casual, relaxed & a soothing relief o","useful":0,"cool":0},"Za9CyZH30Tf0Lo9BimvRMw":{"text":"The food was so so. Loved the fact the shrimp was so big but it was lacking in flavor. How","useful":0,"cool":0},"Ke7_dtgwykPRugLJ-eOsXw":{"text":"The food here was hands down, amazing! Visiting from Florida, I've been on the hunt for a ","useful":0,"cool":0},"8BsTSRz2lG04w8caSP0LXg":{"text":"Everything tastes good in New Orleans. The staffs were great and we were not dissappointed","useful":0,"cool":0},"dlwnCKFmm0fIIvLSFk7TMg":{"text":"The food was great! I ordered the Alligator Po'Boy and was pleasantly surprised by the qua","useful":0,"cool":0},"Z0cEZwAGKHfumJalgNsNFg":{"text":"I wish I could give you a review on the food but the service was so bad that I wasn't able","useful":0,"cool":0},"R47U3ftWs1cI-wB8bYse3w":{"text":"I am so glad we came in Pier 424 Seafood Market. The food was fantastic. Our server, Nadia","useful":0,"cool":0},"FRlkxpMzqCoU02aaJhtPFA":{"text":"Big portions, delicious food, great atmosphere, and reasonable prices for being on Bourbon","useful":1,"cool":0},"RJbB-vSBt_GIi00iW7dy9w":{"text":"I came here with my girlfriend mostly because she loves snow crab legs and they're relativ","useful":0,"cool":0},"xZjRHCbkPobopIIsoT-Xig":{"text":"Ate here two nights in a row. Trio the first night. Crawfish etouffee the second.  Both we","useful":0,"cool":0},"X1eEACONEjYq0672AaNN3w":{"text":"Decided to try the alligator appetizer - hubby and I both really enjoyed it!  Also, the po","useful":0,"cool":0},"7wb00H4Bj8rx0d2J-orkbg":{"text":"This was my 2nd time here and it wasn't the same. I didn't see turtle soup on the menu and","useful":0,"cool":0},"pV-WYXC70MU28-AcFL3-rg":{"text":"I'm in New Orleans. I ask the server what local beers they had and he says \"We have Budwei","useful":0,"cool":0},"5UdPx_Xit90EDh8_hUdRDA":{"text":"Great bartender Raymond shucking oysters and talking us up. Having a blast! Jazz fest!!!!!","useful":0,"cool":0},"YZTjMdPEt7Qu5oTotU_W-A":{"text":"25 minute wait for a beer and glass of wine in a 1/3 full restaurant. Wrong order. Cold fo","useful":0,"cool":0},"pp6-FHUDjPed74gv-RJ1Wg":{"text":"Went in and had 3 drinks. I received my ticket that stated I had 4 drinks. Immediately pri","useful":0,"cool":0},"R8THEUcngYSAlCy6FkfpbQ":{"text":"Wonderful experience. Food was great and so was the service. Oysters amazing. Reasonably p","useful":0,"cool":0},"9CZDVMz83NNiuM3tQc9EGg":{"text":"Grab a plate of a dozen charbroiled oysters at the bar here, paired with a spicy Bloody Ma","useful":0,"cool":0},"wPT5naaIMY3FKCT65DdLwg":{"text":"So, I don't expect much from a restaurant on Bourbon st.... Pier 424 is a reasonable place","useful":1,"cool":1},"3YlC0Goo7vvheN043uF_gQ":{"text":"Sooooo it's family night in my house and we venture out to New Orleans to get us a nice se","useful":0,"cool":0},"GsmjpJmfdxYN2Lo4GjzYLA":{"text":"Crawfish Queso Blanco is yellow w/ no crawfish. Salt is the main ingredient w/ any of the ","useful":0,"cool":0},"XVe0YF5xZnUaxKifF0l9Tw":{"text":"BEYOND INCREDIBLE. Every dish we tried was way better then we could have imagined. Try the","useful":0,"cool":0},"pVr1TLTZSSaqQE7FPlhP3g":{"text":"I had gumbo and charbroiled oysters. The gumbo is really rich in flavor and it makes me wa","useful":0,"cool":0},"DZ9VHLl__bct70Ad0-Frtg":{"text":"Located right on Bourbon. Not my first go to for oysters however they were pretty good... ","useful":0,"cool":0},"Fhdx0mVZPzCrT65qOCJeAA":{"text":"I got the seafood jambalaya and it was amazing. It is a common joke my friends and myself ","useful":0,"cool":0},"YVXoGH3T9Dcj0ZN-iMu_NQ":{"text":"In New Orleans for the third time, so we are branching out and trying some new places. Pie","useful":0,"cool":0},"VufPi13Lr3BeavqyECVLlg":{"text":"Shrimp and grits was one of the best meals I have ever had! Alligator was too chewy, but h","useful":0,"cool":0},"HVzu9h1tRKPtywZRpAIPNA":{"text":"They get four stars for the perfectly cleaned oysters unlike Desire and Bourbon House wher","useful":1,"cool":1},"_apaQ4KGYqsqZRlwsOQwjA":{"text":"Stopped in on a night out in bourbon and as a local I expected this place to be a yucky to","useful":0,"cool":0},"Sdf_N-B0r_dDo_2se8EVEA":{"text":"The worst! Fried alligator appetizer was just crumbs ($10). Seafood platter ($25) had unco","useful":0,"cool":0},"iViAiYJANu6dmzLI_N0e9g":{"text":"Avoid going there!  Customer service is zero! They were asking 3 times what food we ordere","useful":0,"cool":0},"0vGWParZtmRunlOkTqJq4g":{"text":"Wonderful service on bourbon street in the heart of all the chaos it was clean and the foo","useful":0,"cool":0},"DsniRw5TW4wxghzItyhsyg":{"text":"I would say the food was great - but again, my experience with the staff has the potential","useful":1,"cool":0},"5SfxNB95MqLFtqrVqW68PA":{"text":"The staff was friendly and the food was good.  Ahi tuna, crab cake, and oysters was good b","useful":0,"cool":0},"eCstr-tWECfBmHE79hMRDA":{"text":"My mom and I visited here yesterday (May 28, 2015), just for a light snack, and the food w","useful":0,"cool":0},"qyV1Cq-CgFrQtO1Ph6gVMA":{"text":"Wow! Very excited to find its open on Christmas evening! We arrived around 6pm, didn't wai","useful":0,"cool":0},"ya226jeTTmGq252sxKPC2w":{"text":"Had a private party upstairs with Wanda, she was super attentive and she vibed great with ","useful":0,"cool":0},"_Bk9my9ccchxYhfbhrJAHw":{"text":"Matt the manager took terrific care if us. Shrimp and grits were excellent. Terry our serv","useful":0,"cool":0},"DHvNg8wUJ2RjYDutlqFI-Q":{"text":"Pretty simple and straight forward review.  Fries and hush puppies on warm to cold side. O","useful":0,"cool":0},"hpiaJAkyLABEnluWbz8hkw":{"text":"Great food! Service was wonderful!  The long line was intimidating but went quickly.  We h","useful":0,"cool":1},"LrpJvWbycZe0oIx4GYUn_A":{"text":"So Niki and I are big on raw oysters. We've had them just about everywhere. Since I have b","useful":0,"cool":0},"T55TM3kPyIJbAhlZii3xFw":{"text":"It was hard to find parking lot we were spending 20 min to park the car \nWe found this res","useful":0,"cool":0},"RnV_bWvNYKYBM2w_eiVyJA":{"text":"The food was hit or miss...I had the smoked chicken Alfredo and it was sooooo bland and fl","useful":0,"cool":0},"KYtmPF6TBZ3f0nAUbV2Zsw":{"text":"Was waiting for a table down Bourbon Street at another restaurant, when we noticed the men","useful":0,"cool":0},"ykk8b2tQYlIcsOGa1K6_Ow":{"text":"Came in here for oysters. They took forever to get to our table for our order and when we ","useful":0,"cool":0},"xNkz4mqI9mon8pAiVEXXBQ":{"text":"Stopped in at lunch for a shrimp po' boy and a Hurricane.  Both were very good. The server","useful":0,"cool":0},"4pmtyJM344PcbDu_rhLKNw":{"text":"Just plain bad! bad old grumpy server man (he looked like was doing us such a favor,servin","useful":1,"cool":0},"BsZ0n_uqRl2Rk5wydWBKQA":{"text":"This is a huge, and very classy, well decorated, upscale seafood restaurant on Bourbon Str","useful":3,"cool":1},"QjIfJiJEcadJ-k73K8GoTA":{"text":"Excellent place! Sitting at the bar having oysters prepared in a variety of ways, wonderfu","useful":0,"cool":0},"_mEst34N1NNvZAWWy58FlQ":{"text":"Shrimp and Grits was so good I could have ate another plate of it.  Didn't.care much for t","useful":0,"cool":0},"gBqTBut1aH5CPYw-seCiTg":{"text":"After walking around for almost an hour, we finally found a place to have dinner at. We we","useful":0,"cool":0},"BEFHRdgJOm7CcvhViTmzNA":{"text":"I was greeted by a two beautiful women one was short and had ginger hair the other was ver","useful":0,"cool":0},"d2pPaHqviyaA_K-jT74ZOQ":{"text":"Worst crawfish ever. Large party of 10 on a Saturday night so the waiter was probably off-","useful":0,"cool":0},"K_GSRsBx3q4Hyixa2SN4hA":{"text":"Myself and two buddies stopped in for lunch on New Year's Day, what's fucking nightmare! t","useful":1,"cool":0},"NpWHjXJ64CCO7HOvVNsPvQ":{"text":"Wanting a small portion for a meal, I ordered the crab cakes. They were perfect in portion","useful":0,"cool":0},"49VnadFyVSjJ2pbc-B1dmg":{"text":"Stopped in here 2 days in a row this past weekend. Great oysters, drinks and beer on tap. ","useful":0,"cool":0},"GX1eMNRIB4Xlca-taPkOBA":{"text":"They went out of their way to make sure we enjoyed yor dinner. The food was real good.  I ","useful":0,"cool":0},"GroTG8lAwnnJ9UqbQNdLug":{"text":"Ordered the sautéed crab claws, crawfish etouffee a dirty dirty martini and a mojito. \n\nTh","useful":0,"cool":0},"WQ2G5_XVGHhUp5Hcm8fAVw":{"text":"After trying to go to 2 other restaurants that yelp recommended and seeing block long line","useful":0,"cool":0},"4YauJHYho7lk7dnw_Kpzng":{"text":"The food and atmosphere was awesome! Really good food and great atmosphere and the service","useful":0,"cool":0},"2mFjvUv0aKA4KELCn3FITQ":{"text":"If you want terrible service and discrimination, this is your spot. The waiter (grumpy, ol","useful":1,"cool":1},"v8CyUYXLB1WZPomTf_c1aw":{"text":"I like the look of this restaurant when I first walked in but it was deceiving. We had to ","useful":0,"cool":0},"Zu5TdHCvxnwhXEZwsNVbzQ":{"text":"Wish we could have sat closer to the street to listen to music but the hostess sat us towa","useful":0,"cool":0},"eFKR-vo4RgH-gcpbCnQ9lQ":{"text":"Loved the place- food was amazing!! Definitely a spot we would return.    The SHRIMP AMD M","useful":0,"cool":0},"0gv5wL_6whUuwfmu4CrogQ":{"text":"So-so.  Not really bad just not as good as 99% of the other places in New Orleans.  Red Be","useful":1,"cool":0},"Rs1Q54k-FXvIz2p5-1h5AA":{"text":"Very good! Glad we came across this place, as some on Bourbon St are a little sketchy. Ver","useful":0,"cool":1},"Bh8YjpRFoU7KSMsgrPYRsg":{"text":"We were here for a long weekend for jazzfest so we were able to hit several oyster bars.  ","useful":0,"cool":0},"AwLd76J7SZotu1Fglmgnow":{"text":"Like to go here for the raw oysters. Had and oyster poboy which was very good. Meagan our ","useful":0,"cool":0},"iW4-OWi0XOutA5uImbLEwA":{"text":"We were seated fairly quickly. The restaurant was pretty full, with a few open tables here","useful":0,"cool":0},"Ai-h3NehDFMtgB8fEiS_hA":{"text":"Stopped by Pier 424 on a recommendation. It being a Monday night, I was craving red beans ","useful":0,"cool":0},"k69M7wbT-4ECZCKnhZIvAg":{"text":"Went to Pier 424 on Fat Tuesday this year. The experience started off terrible because the","useful":0,"cool":0},"r5DAUbR2Gk61fSpPUl-VZw":{"text":"The service and food was good. Ordered stuff shrimp with crabmeat, very tasty. The hostess","useful":0,"cool":0},"yNR0q9W0KjCePaXHmDOqNg":{"text":"Wait staff- poor- only 3 tables with guests and took at least 15 min for 2 cocktails. \nFoo","useful":0,"cool":0},"58u8yltfuxPXV0CxCb353Q":{"text":"Rave.  That's what I want to do about this place.  For starters, they honored the Yelp fre","useful":0,"cool":0},"GzstfjgNJJoORlXGcesFUQ":{"text":"The food was great and the service was pretty decent. I enjoyed the atmosphere and the loc","useful":0,"cool":0},"T9NM6r2S8R2r4E5BkkTsuQ":{"text":"The host was busy hitting on a girl passing by so we had to wait as he continue to engage ","useful":0,"cool":0},"QXzpmxjP6nZJY2co38_iFg":{"text":"Service was terrible. We waited forever for seating and then our waiter disappeared. We we","useful":0,"cool":0},"ZkiZzPUlQvLBaWg5lyAFww":{"text":"Not impressed by this place.  We didn't have high expectations since it's right on Bourbon","useful":0,"cool":0},"UIBBxKadYgeWtqJurhW7FA":{"text":"The combination gumbo barely had any chicken and crawfish in it.  Went in with high expect","useful":0,"cool":0},"V8xthECC4XOaRawI3AkCSA":{"text":"We had six people for lunch and not a single morsel was leftover! I had Redfish and macaro","useful":0,"cool":0},"-gtMrNTI1Xf0zea855KIkQ":{"text":"Oysters are good. I would not recommend the gumbo. good service overall.","useful":0,"cool":0},"7_7gwgdAomNaDDP6aR08CQ":{"text":"Server was a bit slow to take and serve drinks,especially second one. Their bloody Mary's ","useful":0,"cool":0},"Y90yyQAvPYWcTRYtWI0_jQ":{"text":"I'll cut to the chase... Was the food life changing?  Absolutely not.  Was it exactly the ","useful":0,"cool":0},"ysS_G5NUWD-J2arD1zUx9Q":{"text":"Went here for a late lunch/early dinner. The food and drinks were delicious and reasonably","useful":0,"cool":0},"JegPHXj9xfiD2BJOry2j0Q":{"text":"Pier 424 is great. While it might seem like a generic Creole restaurant on bourbon street,","useful":0,"cool":0},"zuL_zX99iIhgch2sGS0NIA":{"text":"My husband and I stepped up to the hostess and for several seconds she ignored us but I wa","useful":1,"cool":0},"H5pPtkJMoq2PrV12n4dgBQ":{"text":"Slow service, chips arrived cold, very poor quality food.we had to keep our jackets on sin","useful":0,"cool":0},"zuakk4BjcdcFD5bP_Z_a1Q":{"text":"Not crowded, comfortable, casual atmosphere with prices that were reasonable for an averag","useful":0,"cool":0},"vqsc3xEou7ETAySswdQT0A":{"text":"Just writing for the service. Sat at the bar and the service there was horrible. The barte","useful":0,"cool":0},"aVmog97Hyy3Un6dC6zZiJQ":{"text":"Great crab claws, just wish they wouldn't let them completely soak in the sauce.  Makes yo","useful":0,"cool":0},"EmLFJAiwmKF556LZDZrF2A":{"text":"DONT GET NOTHING THAT SAYS CRAB CAKE!! Went here for Mardi Gras. Great customer services a","useful":1,"cool":0},"P10CVOWR0ZqgstzhPe6PoA":{"text":"The frog legs are soooo good!!!! We also ordered the Bread Pudding and it didn't disappoin","useful":0,"cool":0},"qHX9kfs1MFs1pUZv7O8YRw":{"text":"I got the Frog legs and calamari . The food was good but arrived to our table cold . My co","useful":0,"cool":0},"LG607-FWNnnQOx8RgV2BTg":{"text":"Wait for one hour on the line and wait for one hour for food. The waiter may give you tick","useful":0,"cool":0},"IZ-1K6NNFs1dGnGu0SkV4A":{"text":"Food is always good!! Ever time I visit New Orleans it is a must I stop to eat at Pier 424","useful":0,"cool":0},"8bKz-ztkQ-wRrVXmY_T7Sg":{"text":"The food was okay. I had the blackened shrimp. The shrimp was over seasoned. The jambalaya","useful":0,"cool":0},"Ow2mBpngfj_BOTPSVODDdA":{"text":"Overall- great atmosphere, clean, wonderful food, great service, good price points. I woul","useful":0,"cool":0},"2Ff7pwFbR3JmFyARieaWLw":{"text":"Came in on a Sunday evening and got seated right away. Unfortunately, we didn't get any se","useful":0,"cool":0},"YZVS8Rv-bbc2wpJeTtF90g":{"text":"Great food!! Walked in and got a table for 6 about 6pm on a Sunday with no wait.  They are","useful":0,"cool":0},"BFurx22MwGhMLb2sAdCwpw":{"text":"My husband and I were on a road trip through NOLA looking for a good place to try crawfish","useful":0,"cool":0},"4d-lEiTMXwS2_d-VGjQm-w":{"text":"My wife and I ate here on our trip to New Orleans. I learned a valuable lesson in market p","useful":0,"cool":0},"NzaHpd6JqUijlGWbBLS0pw":{"text":"Stopped in for a quick lunch on Bourbon Street.  We saw the add in one of the visitors boo","useful":0,"cool":0},"Lf4xu_4ierU15yx5XQFLww":{"text":"Decent food. The deck overlooking Bourbon Street is really what makes the place.  The peop","useful":0,"cool":0},"35WTGoFfdHk0IsugwONjNg":{"text":"Pretty good food, and the service is really accommodating, definitely try the gator bites ","useful":0,"cool":0},"pvbShTejXInrAY1g91Bskw":{"text":"I had the creole pasta and my son had the Ribeyes steak. Both were very good and our serve","useful":0,"cool":0},"lG0ptd0xc213-nnxZqNWDg":{"text":"What a great place!  The inside is beautiful- my hubby is an architect and loved the arche","useful":0,"cool":0},"-iZqTzmyyvK5djIkt2OTzA":{"text":"This place was the perfect spot for our large group who were meeting 'around 6' for dinner","useful":0,"cool":0},"2zEcvlShHi08t4qSDo-Cag":{"text":"Was concerned it would be a tourist trap on Burbon street,  but the staff was friendly and","useful":0,"cool":0},"1rjBFI8-ymn9tH9TPGbJqw":{"text":"Definitely 5 Stars! I came in here for lunch and was immediately greeted with a smile. I a","useful":0,"cool":0},"4HRc2JkA_nF_FELn_loQ-A":{"text":"This place is great. Very clean and pretty. Raymond at the oyster bar is amazing and so fr","useful":0,"cool":0},"W9LCg6k0zPlEYJuha7-q1A":{"text":"Maybe it was an off day. I ordered the sampler and it came out ice cold. Yes they took it ","useful":0,"cool":0},"eyhl-7PCaqvXVpjBIBa01g":{"text":"This is is disgrace to New Orleans. Being that I am a seafood lover from Atlanta I thought","useful":0,"cool":0},"HOmeTas6DbQsS83qLMdDbA":{"text":"I've eaten here about five times, and except for the last one, I've been very happy. I lov","useful":0,"cool":0},"L74K_tEbxs8BamzOtz_MXw":{"text":"Service sucked and so did the over priced food. I didn't get any drinks but I saw the face","useful":1,"cool":0},"d93eC3RH7ng9aUjJ0Kdyeg":{"text":"Best service in town! Met an amazing couple from Oklahoma too and the rest is history...cu","useful":0,"cool":0},"uAz78Qo-EgUDpaE3nrojIw":{"text":"Worst po boy ever... dry, her and like 5 small dried up shrimp. I was shocked. Sent it bac","useful":0,"cool":0},"GbrcR8UDuW64S6Bh-f1Ihg":{"text":"service was fine. Gumbo came out colder than room temperature. sent it back and it came ba","useful":0,"cool":0},"vZwWkMi_40-2M3s91slOxg":{"text":"I'd love to give this establishment more stars. Because the food alone warrants these 3 st","useful":0,"cool":0},"Ef5i9Dxbq5A5-QLn7B4EWg":{"text":"Definitely not going back to this place. Ordered NEw Orleans sampler , étouffée was too ch","useful":2,"cool":0},"hUzOWXQkTn3UBPVMCaaLRA":{"text":"The food is good BUT our order took too long and it was wrong for more than one item.  Bat","useful":0,"cool":0},"OZI_OcafhXq1c8ASieJY8A":{"text":"The boiled seafood dishes and fried seafood basket were both oversalted, to the point wher","useful":0,"cool":0},"bdR5TAo-84QKSo4gTSUoOQ":{"text":"Our waitress Colleen was amazing, she was attentive, upbeat and showed us how to properly ","useful":0,"cool":0},"Je3EA7mgs-IUPHFZc0alVA":{"text":"i hadn't had oysters since the oil spill, and i was really looking for a nice oyster bar a","useful":0,"cool":0},"iWCRr_OL9zd6v98SUaG8OQ":{"text":"The food was great both times I came here. I sat at the bar both times and had the best ba","useful":0,"cool":0},"jMmm2M93o8xTL7yaoPLcWQ":{"text":"Good crab cakes & Stout beer! Good place to stumble upon on Bourbon St. Make sure to ask t","useful":0,"cool":0},"EefwTP_-ezkcojKKvP8nOg":{"text":"Went here for lunch - just exploring and it looked like a good place.  Had a decent drink ","useful":0,"cool":0},"uqC93aXZClVYGYqb6Vb8HA":{"text":"Unlike my usual carefully planned stops, I just stopped in here for an evening snack since","useful":2,"cool":1},"APpRTEp9tfC9jlmyVmc-ow":{"text":"The crab dip and the crawfish cake sliders were amazing.  And they make their hurricanes w","useful":1,"cool":0},"mTAJ7njg-qi_xfkKpvR3LA":{"text":"We stopped in New Orleans for lunch and wanted sea food. I wanted gator which they were ou","useful":2,"cool":0},"iibvhF1LceP95w2yQ6GhNw":{"text":"Food was good just wish there was more shrimp and fish on the po boy. The waitress was ver","useful":0,"cool":0},"ZuKba9omWwSITXa3BK9G5A":{"text":"If I could give them no stars I would. We sat for 30 min and no service. Served some young","useful":0,"cool":0},"md13Pt2sSNzid8V2Wev2Hw":{"text":"We tried this one night while trolling down Bourbon Street. Had the fried Alligator, Fried","useful":0,"cool":0},"RvL42S1c8vQPwgl6aeNcjw":{"text":"Excellent place sit and slurp the best oysters, drink beer and enjoy the sites.  The food ","useful":0,"cool":0},"_7di_aYDEavWB5yMhrYxAw":{"text":"Raymond could feed me oysters all day!!","useful":1,"cool":1},"uxaHnHDSgwAK95N0Y4-s6g":{"text":"We went here on our second day in New Orleans because there was a staff person out in the ","useful":0,"cool":0},"tXCwccJi0Mgw9Wfow0zhNA":{"text":"The waiting time is too longgggggggg! Around an hour waiting in line when a couple of tabl","useful":0,"cool":0},"auycVQNuNiQHU5zwMV7T4w":{"text":"This is a good place to sit down and eat a late night meal.  Nothing spectacular, but defi","useful":0,"cool":0},"-3GqCYnTe1AhUnQcFV13HA":{"text":"The fish of the day red snapper grilled just a bit to much. The trio entree I had was exce","useful":0,"cool":0},"rlO58HnxcNtn5xD50lLNUg":{"text":"Good food and great service at the bar. We ordered the crab cakes and charbroiled muscles ","useful":0,"cool":0},"00IXamj3cd-WdSw5TwG42w":{"text":"Our first meal in New Orleans and it was outstanding. Lighting was a little dark but the s","useful":0,"cool":0},"Xm9XjwBk_yQB-rTkc8kLlg":{"text":"Ordered 2 kids meals, an order of oysters Rockefeller, calamari, and turtle soup. The food","useful":0,"cool":0},"HF2yMDI9WqfDNoMfjrbx9A":{"text":"Great food... Ask for Frank, the tank! Food was incredible and so was the \"entertainment.\"","useful":0,"cool":0},"WmQv-4_owVvN8nDDiMRwvw":{"text":"Went there last November in 2013, \nthey had Super Fresh Raw Oysters! \n\nBest of the best oy","useful":0,"cool":0},"CGVOk_pdj3SJVtGMsn5i-A":{"text":"Very good drinks and appetizers! Me and my friends had a very good time and we loved the b","useful":1,"cool":1},"oINqUrcnkHDbzXawPMX2rA":{"text":"I Ate here during Essence Fest weekend. The drinks were a little watered down, but the foo","useful":0,"cool":0},"B8kYR7GZR7TbeJzC_tijzg":{"text":"Great late night place to eat! Huge portions and friendly service.  My oyster po boy was t","useful":0,"cool":0},"6spXzT5SwdpkfdQSof361A":{"text":"During my 3 day stay for Mardi Gras I ate at Pier 424 three times and loved their Cajun se","useful":0,"cool":0},"n-N_PzFld8YWGEkzzU4ZxQ":{"text":"It pains me to have to give a place in New Orleans only 2 stars. I LOVE this city and woul","useful":2,"cool":0},"Q9wxuw8-SMmsgP3sD9j8rg":{"text":"REALLY Fishy Crawfish, couldn't eat them. Charbroiled Oysters OK. Service is average. Hush","useful":0,"cool":0},"NgeiVL8ijeCbxvndGo-qYg":{"text":"Look, maybe I'm a food snob, but this place does not live up to the standards of New Orlea","useful":0,"cool":0},"JR1jsetxfdmV_UbLE947gw":{"text":"Ordered the sautéed crab claws, crawfish etouffee a dirty dirty martini and a mojito. \n\nTh","useful":0,"cool":0},"JrQ5fRA1E1IfPPFYPHtZIw":{"text":"Let me start off by saying the service was amazing, both the hostess and waitress were sup","useful":0,"cool":0},"LJefs2EqsdJpYrR39HM-Ig":{"text":"Amazingly bad service the weekend after Mardi Gras. Waited 30 min outside even though our ","useful":0,"cool":0},"yGTzpobqxThEpWEaiP40dw":{"text":"Not blown away by the service or the entrees although the appetizers were amazing. We were","useful":0,"cool":0},"yirTETXPBjCdCzwm-ICUpg":{"text":"Went for raw oysters. Ordered alligator po boy, Creole pasta, for drink ordered local Ambe","useful":0,"cool":0},"nYmcw7_HeWh5KIxLxyg2eA":{"text":"Came in here looking for dinner last night. Ordered the New Orleans platter, the bf went w","useful":0,"cool":0},"z2CCuZAXJPG3uQ6htvAhLg":{"text":"Frank is incredible! He was a wealth of information and gave us great guidance on what to ","useful":0,"cool":0},"IM8-DqMkWFWLW5c3Me431Q":{"text":"Fantastic! Stopped in for a drink and some raw oysters with a friend, and they were great.","useful":0,"cool":0},"vdrmVCofy6t-LrGWb3VY_w":{"text":"My boyfriend and I went on New Years Day before the Ole Miss/OSU game. Although it was cro","useful":1,"cool":0},"kP7jFD6fc9ZEd3Ma0B_OMg":{"text":"Never had a worse meal in my life. Bread was stone cold, the shrimp on the po boy were so ","useful":0,"cool":0},"P79k_6xckdObnnmY6-Fn6w":{"text":"Awesome!  We ate at the oyster bar.  Oysters on the half shell were fresh and delish.  Len","useful":0,"cool":0},"6nVpaZ5HobjZX_Nb0n7gqw":{"text":"Food was awesome! Ordered the shrimp and oyster poboy sandwich. Super authentic and tastes","useful":0,"cool":0},"l5MR6BqHPONdhUBY0YqMHA":{"text":"The food was average. I I honestly don't ever see my self coming backing here. Shared a cr","useful":0,"cool":0},"NQIMw1o9-qyJH4xmMnUL9A":{"text":"First time eating here and the drinks and food wedge great. I ordered the blackened chicke","useful":0,"cool":0},"Q77eP3uqjHtUhUhaNn427A":{"text":"A group of us stopped in to the bar early in the evening during the French Quarter Festiva","useful":1,"cool":0},"m1-R94FmTpAjRKmu_cvtfA":{"text":"Service was great! The waitress recommended the Smores bread pudding and crab cakes which,","useful":0,"cool":0},"rAJQRxSwPUJGixr8FGGCxg":{"text":"Stopped by on a cold night when I wanted something \"New Orleans\". Food was very good, reas","useful":0,"cool":0},"xYA9MG4oXa0-H4m1ovaS3w":{"text":"****This review is only based on our waiter***  I should of got your name but we will call","useful":0,"cool":0},"1ux7_FuJ7nW5kLQJ09ndeQ":{"text":"This was a great place to get some excellent cajun food.  Their gumbo was perfect and the ","useful":0,"cool":0},"39FxN8Dib0CeVyuv-k08Dg":{"text":"Chef Chris was AMAZING! I ordered a Lobster Broil (something I've always wanted to try) no","useful":0,"cool":0},"0TGfE6UoWV95Y-WtcV8FpA":{"text":"Food was wonderful!! Our waiter was Frank ... if you can sit in his section DO IT !!! Such","useful":0,"cool":0},"9DrpnshxZ2LKgtJOGAHuBQ":{"text":"I've visited New Orleans multiple times and didn't know of this place. Luckily I stumbled ","useful":3,"cool":1},"1-n3IQ4P1F3kA5psXpDTYA":{"text":"The place had a good menu. I ordered the shrimp basket to find my shrimps haven't been cle","useful":1,"cool":0},"wmKLUHIT2v576MI6o1O3sQ":{"text":"Maybe I was just caught up in the splendor of Bourbon Street, but this place was absolutel","useful":0,"cool":0},"KKdhC0oR3fSPyQFISsQMQQ":{"text":"Went there today at 1:15 pm on Saturday, not a busy time of the day on Bourbon St., the re","useful":0,"cool":0},"xsOQLLchIDL5kEI5EnkRpw":{"text":"me and my friends tried the crab dip it was pure perfection. we went back the following da","useful":0,"cool":0},"ARdE1lAutKjZIS1OvzznCA":{"text":"We had an amazing time here!!! Sam was awesome and Erica is the best mixologist around!!!!","useful":0,"cool":0},"wedTH3WqRGzGJpY9ur6QzA":{"text":"Awesome food! And Julie our waitress was very friendly and helpful! The atmosphere is perf","useful":0,"cool":0},"da_C30ZdmG_0RTMZFzXPbg":{"text":"Great seafood, the beat one we had in NOLA. Frank our server was friendly and the service ","useful":0,"cool":0},"wgBTtXcnpApeEO1bxtQ1iQ":{"text":"Our server Frank was excellent.  He had a great personality and was very helpful with anyt","useful":0,"cool":0},"EcG7lQX8_M9kXVlKi2-5DA":{"text":"Great food and atmosphere for a \"Bourbon Street\" restaurant. The service was impeccable. O","useful":0,"cool":0},"TZtNX7nLsNG6FZ8BTMQr4Q":{"text":"We stopped here for our last meal in NOLA - the menu looked tasty so we decided to have lu","useful":0,"cool":1},"ch-hSiES0pPxCzitQ5P89A":{"text":"Came here by the recommendation of a coworker.  I came to New Orleans for a conference and","useful":0,"cool":0},"eguIxvCjSlna1vgEpzWsjQ":{"text":"We stopped in for a quick bite. Our waitress Shiquita was very nice and helpful with the m","useful":0,"cool":0},"1Szg1Nl4LB7eGgX5ha_Vsg":{"text":"Looked like a good menu , and it is located right on Bourbon street.  Unfortunately we nev","useful":1,"cool":0},"opES7xE6LUui6PbkGFiXwA":{"text":"Excellent shrimp n grits!!! We also had the fried alligator, texture was a bit chewy and d","useful":0,"cool":0},"wMfaRJpqwgRwAdnI1MsU-Q":{"text":"Great food, service, manager attention and location. Definitely would recommend. Had gumbo","useful":1,"cool":0},"vIwK7Lgjz2LYFva5qaKMcw":{"text":"Overall, it was average. \n\nI ordered two dozen oysters, crableg and sausage pot, and fried","useful":0,"cool":0},"GUEQnWIAQe8EIsty5aAKgA":{"text":"Of all the food we ate in New Orleans, this place was the worst. I got the New Orleans sam","useful":0,"cool":0},"VqWUo9sxe7P5aqMR2fxudQ":{"text":"After dealing with crappy customer service last night from another restaurant, Ace saved t","useful":0,"cool":0},"L3vOx8R75Ovs4yyvcVMFXQ":{"text":"The place is mediocre at best. Ordered chargrilled oysters and they were gritty. The servi","useful":0,"cool":0},"5t_g4r24zcBL_LtQJWKxSw":{"text":"Fred our server was amazing! He even danced with me at our table. The gator tail was aweso","useful":0,"cool":0},"crbz0uTCVKFZWuMzF0GHOg":{"text":"Sitting at the bar just finishing a light dinner:\n\nOysters 424 - \"Tasso ham & green onion\"","useful":0,"cool":0},"bZZzrFVTC9SLzso0czjWbA":{"text":"One of the only balconies on bourbon street to eat on ! Great salads and great service. Fr","useful":0,"cool":0},"TvyMmjWJEtMCv-9p5wwsLw":{"text":"The first place we walked into on Bourbon St. Outstanding, friendly service from the momen","useful":0,"cool":0},"YkBi99QzoreBHXpr39sy1A":{"text":"Horrible service. Drinks came after we'd eaten the appetizer, food came out cold. Manager ","useful":0,"cool":0},"li2WxLjMzSKRj_Zr3qBpyw":{"text":"Best raw oysters I had in NOLA so far! So good we ordered another dozen and they were even","useful":0,"cool":0},"q8veacEwMlxKOS72jja8LQ":{"text":"Ok. We shared thw Red Beans and Chrispy Chicken thighs.  Very smokey and excellent red bea","useful":0,"cool":0},"ZA72uBqx-pV-5upBDYmCkA":{"text":"Had the Creole Pasta, was amazing! Wasn't on my list of amazing restaurants in French Quar","useful":0,"cool":0},"c_0rGQElf2QXuy4DFarLKw":{"text":"Got the fried combo basket and the shrimp was hard and nasty. The tartar sauce smelled lik","useful":0,"cool":0},"tqdVotoeeoy-EGOZrFFruQ":{"text":"Hostess was super rude to our party of five which docs them a star.  We ordered fried alli","useful":0,"cool":0},"KuKbuTJhK3vsVSeNtcGGJg":{"text":"I'm giving 424 seafood 2 stars but my wife may give them 3 so I had to write this review w","useful":0,"cool":0},"DZ9azVDqhoHgxzf0rETlXg":{"text":"Really impressive shrimp and grits.   Loved it.  Also had the trio of gumbo,  red beans an","useful":0,"cool":0},"yM0we1GvbH1dMVVQF2YipA":{"text":"LOVE this place! I randomly found it during a previous trip to New Orleans and made a poin","useful":0,"cool":0},"CcriIkD3TVhtLqxW8EokZw":{"text":"12/25/16  Me and my daughters ate here yesterday-yes they were open in Christmas (yay!). B","useful":0,"cool":0},"rV2z_oVsY-3u-G2-GXClmQ":{"text":"Came here at 8 at night with a party of 8 and they sat is right away which was really nice","useful":0,"cool":0},"knf3nqq3LQbp9JuE7Vs9ug":{"text":"We have spent the past several days eating at restaurants all through the region. Pier 424","useful":0,"cool":0},"yAnU7i_5-7PeV5HAsSsXYg":{"text":"I ordered the moscato wine, it tasted old and vaguely like dirty tap water. We ordered the","useful":0,"cool":0},"heeSFmzKHmilVEk6joc76A":{"text":"Service was awful.  We actually had to get up to get our waitress so we could pay.  \n\nFood","useful":0,"cool":0},"Pnh60VMqyZ4mkrMiUoZKdQ":{"text":"Pier 24 is a great place to have a taste of everything that is New Orleans!  When we arriv","useful":1,"cool":0},"87XPNA6vQ7sjqQmchQn7Jw":{"text":"I think the people that did not have a good experience are just very unhappy people in lif","useful":0,"cool":0},"jqNB79gQivuUU4oFswpMwg":{"text":"Service was awful... and it wasn't busy at all, it was almost empty...took us so long to g","useful":0,"cool":0},"zlvlSyq4MvUDUwIkeCY2qw":{"text":"I visited today from Mississippi. The food was delicious and the prices were reasonable. T","useful":0,"cool":0},"4Ve6mU3p-ahY_euu8OWBug":{"text":"Outstanding food, service and drinks. Thank you, K and Anthony for such GREAT recommendati","useful":0,"cool":0},"dzMqu4DYMhuPT5LMXg2Vcg":{"text":"So in March I came to NOLA for the 1st time and walked pass this walk and clearly turned a","useful":0,"cool":0},"FHKiibLshGKChK2LrHNC5A":{"text":"This place is disgusting. Worst Po boy I have ever had. Service is extremely slow also.","useful":0,"cool":0},"kwQaDN8LzW-qKBiqO6ccMA":{"text":"Had the Creole Pasta, was amazing! Wasn't on my list of amazing restaurants in French Quar","useful":0,"cool":0},"Dnb7UM7qy2LI5xtwTeULaQ":{"text":"Oysters were plump, juicy, fresh and delicious.  The price was very reasonable.  Best we'v","useful":0,"cool":0},"6x4vKvNhKwlDFxJ1HbW7hA":{"text":"The food and service here was fantastic! Jambalaya was amazing. First time having alligato","useful":0,"cool":0},"OynYBGJYgJs3KDAblVNEfA":{"text":"Enjoyed the atmosphere on the balcony overlooking Bourbon Street. Our table of four had th","useful":0,"cool":0},"YUx1WomNyRhnBbR7s8K_xw":{"text":"Great food.  Kevin was a great server.  Balcony was the best place to eat.  Had the shrimp","useful":0,"cool":0},"22zw413vM2HK7YnREc4FSQ":{"text":"Awesome food, great drinks, and even better waiter. Marquis had us laughing the entire tim","useful":0,"cool":0},"mtq_Npae75kkC7Z8Sfw1Ag":{"text":"Raymond was AMAZING! Not only is a bad mothashucka I'm a big fan of bounce and he told me ","useful":1,"cool":1},"3--kXj7IuXEz9Szy9g9a3g":{"text":"Shrimp & grits were amazing!  My friend had the fried alligator which she said was great. ","useful":0,"cool":0},"RZElhcclxxbh3BAncbBq-g":{"text":"AMAZING SERVICE and scrumptious food! Above and beyond doesn't even come close to describe","useful":0,"cool":0},"ItngMcmG1hvlCfkxousW3Q":{"text":"Great location w/ below average service. Asked for water 5 times, nothing. Soup warm not h","useful":0,"cool":0},"uEZ9D6ITmGet9ulwRASrCQ":{"text":"Oysters are excellent. Staff is so friendly. Sit at bar with Raymond and Sam. You won't le","useful":0,"cool":0},"BshfDbfClsGai4awidKmRw":{"text":"Award winning Po'Boys for a reason!!  Hurricanes that are wonderful!!  Alligator app. Is t","useful":1,"cool":0},"-YTUlSvKUiprUUep7oxAVA":{"text":"Our server Ashley was great, bubbly, and friendly. The food, whole 'nother story. We had t","useful":0,"cool":0},"5syzvaiS5toRi7R9HNnD2Q":{"text":"Outstanding service and the food was incredibly delicious!  The bartenders were extremely ","useful":0,"cool":0},"6RRh9dw6rqQ9-V9ZUUHoQA":{"text":"I didn't realize till we sat down, but we were here in the exact spot 4 years ago. We coul","useful":1,"cool":1},"YjK9dGSSgglH-SBdFgrePw":{"text":"Slowest service in the world, and there was only a few tables. A few got up and left the r","useful":0,"cool":0},"SQR-Qnzi6DzOzMQPSHhyYw":{"text":"This was our first restaurant when we got to New Orleans. This was easily the best food we","useful":0,"cool":0},"ls1G6LLXnAd5opHUYSiH5A":{"text":"We will be back! Great stop right on Bourbon with open windows to watch the crowd AND air ","useful":0,"cool":0},"10dManhzktT0Qq6-7vbXMA":{"text":"Great Food Fast Service and good portions  and its on Burbon Street we been going To New O","useful":0,"cool":0},"72asTPQBNB9759sUyz7tjw":{"text":"This one of my favorite restaurants in New Orleans. Love the red beans so much that I orde","useful":0,"cool":0},"CIZHQ2Q2iq8dWOkRWfY4Qw":{"text":"Great menu.\nFood is very good and prices are reasonable but just a little short on quantit","useful":0,"cool":0},"yFT0zC4goWnybppgqHkySw":{"text":"Another find in New Orleans.\nThe service was very slow, but they made up for in their food","useful":0,"cool":0},"YVNU60vYCAGl7kAifS0Mxw":{"text":"Server was clueless. Didn't know what a mimosa or balsamic dressing was. Poboys were bland","useful":0,"cool":0},"ZAgTssn1nV9GR39yAEWj5g":{"text":"Food and service were impeccable. I recommend the corn and crab bisque and the crab cakes.","useful":0,"cool":0},"ZfS7Wjvl5X55dfFyCbC0_w":{"text":"We stopped in here on a Monday night for dinner. It was Monday so it was not crowded at al","useful":0,"cool":0},"wbFM92qOeThT-JWn4TmPGg":{"text":"WTF!?!?  Really?\n\nThe BF and I came here for a late lunch on Christmas day and of course I","useful":4,"cool":1},"KoSkEZ_DFqyMxiOwNJuSzg":{"text":"I came to this place on a rainy, cool evening. There wasn't much going on but the staff we","useful":0,"cool":0},"y1bBa-GI5DAaIodkxtR0TQ":{"text":"Such a disappointment! We were there 2 years ago and had 2 great meals.  Took our friends ","useful":0,"cool":0},"LG48ILUd9VTk6T-3qFDuDg":{"text":"They were very nice and gave good service even though we weren't drinking. They had plain ","useful":1,"cool":1},"bO5ZFce0EUlfTlQUoP5UUQ":{"text":"Pretty good food, but a long wait. Our waiter was good though. Don't remember her name, bu","useful":0,"cool":0},"iweDRwo1UDiiMgMqBk5hrA":{"text":"Love the decor. You can tell they spent alot of time designing the place- taking note of t","useful":2,"cool":1},"JQIAZm4zD5jPLqFedOxQqg":{"text":"Excellent food, service is a tad bit slow but the food came out hot and very good!  Our pa","useful":1,"cool":0},"MEKYOw7dxUSo5dAGzrN3KA":{"text":"My husband  and I stopped in here around 10 Monday 3/9 for an oyster break before hitting ","useful":0,"cool":0},"cPTN6zBnojujcEjwijd4zQ":{"text":"Just experienced the worst dining experience.  I travel for work and typically use yelp fo","useful":0,"cool":0},"LD_lHn6Hlbbuq6zwSpOPxQ":{"text":"Ok so this place is amazing. The woman at the door reminded me of somebody's loving auntie","useful":0,"cool":0},"pQOTvahRcv6VgT8o5tVvSA":{"text":"Ate here two times while on vacay....had the blackened shrimp meal....9 shrimp w/veggies a","useful":0,"cool":0},"o5CHG1OohKryCvsxjXXCuA":{"text":"This was the most bizarre dining experience I ever had. We went in two nights ago with a p","useful":0,"cool":0},"iG7AZevHUvbfljH0HkwlYA":{"text":"Had a 20 minute wait even though there was plenty of empty space to seat my party. Food wa","useful":0,"cool":0},"rkCTKw6EqWDgYZt7GpGnpw":{"text":"We had a wonderful service all day I'm Bourbon. However, the service here at Pier 24 was t","useful":0,"cool":0},"JDprmQm-stQ-Q4OUYssfTA":{"text":"Don't understand low 3-star rating. Our party of 7 had an almost perfect seafood dinner, e","useful":0,"cool":1},"6xu7Sg-6bQ9873yUad0htw":{"text":"I don't normally just don't say anything at all when I have a negative experience. But I c","useful":2,"cool":0},"G-AUiJ62GkI5Lmg90L0iYw":{"text":"Went here with some family and everything was so good! The crab cakes were by far my favor","useful":0,"cool":0},"k2ZUEyvkK9BurTaGUF5prA":{"text":"My wife and I have eaten in many seafood restaurants in Louisiana, but Pier 424 Seafood Ma","useful":0,"cool":0},"kxxB_HxlbKfpAGONTBbYWQ":{"text":"Sad that this place has such poor reviews. I sat at the counter, at the oyster bar and had","useful":0,"cool":0},"CCWcqtvcJhurp5kQrdSxyg":{"text":"Excellent food and service!! Shrimp and grits were the best I've ever had.. I can't even c","useful":0,"cool":0},"mRtyX108GHrsWWc8hy6YsA":{"text":"Pier 424 the service and food were amazing!!  The oysters were huge!  Red beans and rice a","useful":0,"cool":0},"0853JlXetV_70tw6WG72rQ":{"text":"Staff was friendly, food was great. Definitely try the jambalaya or the etouffee. Definite","useful":0,"cool":0},"8xpTK1Bz-HrKV6ZAXivRDw":{"text":"Desperate to find somewhere to eat past 11:00p on a Thursday, we were guided here by one o","useful":1,"cool":1},"y_ZWVzm1wBSlC57Jfl3bHw":{"text":"Chargrilled oysters were good but small, pecan pie was to die for with an apple cinnamon b","useful":2,"cool":1},"jR_HSPRYJj6KBlBjBmRAdA":{"text":"My son and I came in and were going to order Po' Boys. The waiter, Fred, told us, No, we a","useful":0,"cool":0},"XZ7_v0HfASZ7VsemYNTCtQ":{"text":"The worst customer service I've ever had. The bartender was drunk and took 20 minutes to g","useful":0,"cool":0},"rhh4csKA1t4zKh3EWnOCHg":{"text":"We stumbled in here as we had been in NOLA for over 10 hours and my boyfriend had not had ","useful":0,"cool":1},"POjFrtu_3yF2IKWb6qm2dQ":{"text":"Loved the food.   It was all wonderful.  We ordered the chargrilled The trio, the corn cra","useful":0,"cool":0},"llERdPtzYAikzeX47X115w":{"text":"Food was good service not so good. Order was wrong and the al a mode came after the desser","useful":0,"cool":0},"i7ZLlwuQiquCbkUREwGI-g":{"text":"We walked in on a typical busy Friday night. Our server, Frank, got our drink orders in no","useful":0,"cool":0},"-9AWhl3jIIf7HkLtKEynyQ":{"text":"Awesome and delicious!  Shrimp and grit cake was phenomenal.  I had never tried it before,","useful":0,"cool":0},"wdKLIcF0-qe2jjd0Vki21g":{"text":"Had the alligator po boy. Peru Damn good but a lot of bread. It is a little pricy even for","useful":0,"cool":0},"gmbpEL9zhpKxdKwKIrP22w":{"text":"I give this 2 stars due to the service being great. Sadly the shrimp boil was just bland w","useful":0,"cool":0},"xuC3eI_9ERF9QoxXfFK0IQ":{"text":"Great spot for an oyster shot. Clean feel, lively atmosphere. A little pricy but not too b","useful":0,"cool":0},"wTy0jBxHwGR8MYC8Cw3kfw":{"text":"Make sure to sit at the oyster bar with Sam!!! Great friendly service true New Orleans sty","useful":0,"cool":0},"PTUu8J8AXYw55OtT06Pvjg":{"text":"Environment is nice. Service very polite but food questionable. We were in 2 and we both g","useful":0,"cool":0},"kt-6GG-gnJm34J9MTn6O1w":{"text":"My husband and I were walking down Bourbon Street, and we thought the plates they had out ","useful":0,"cool":0},"aqagLk2osZS2Lcy-94T_mQ":{"text":"Sat at the bar and had to deal with a miserable oyster shucker who complained and cursed a","useful":0,"cool":0},"PDeRIXOCMKw9OGfYaIW6nA":{"text":"So I decided to checkout Pier 424, because a lot of the seafood house were not serving Cra","useful":6,"cool":2},"NrdkcF_PrYsBqPk7kdaVEQ":{"text":"The service was really slow it was a Wednesday night not even that busy,our order took so ","useful":0,"cool":0},"ci-MbwYk4Q59ytyYox-Waw":{"text":"Visiting for Mardi Gra from Atlanta . Service was TERRIBLE, our waitress was rude !!!! He ","useful":0,"cool":0},"_ot_kE-lNQAZbMQm2abaVg":{"text":"Attempted to patronize this business in August 2018, but they had run out of po'boys (a si","useful":0,"cool":0},"5eBiTXTqFtCzDfAjH2uYPw":{"text":"Terrible good! The worst! Service terrible. Food was served cold., avoid avoid avoid .","useful":2,"cool":0},"IFcT_cfoV6q24W0OzG617A":{"text":"The service and staff was amazing. I loved how the managers took care of their servers and","useful":0,"cool":0},"MInRjzsr-xJSXaAITk2BNA":{"text":"Love. Love live this restaurant and everytime I am in NOLA this is a stop.  Go see Uncle S","useful":1,"cool":1},"ar5xqLeSuZoEKb5MPtqUeg":{"text":"IF YOU ARE BLACK DO NOT GO HERE!! Apparently  \"Mr. Sam\" the bartender feels that every bla","useful":0,"cool":0},"yEn_EknMqpnhKR5z3m8i6Q":{"text":"This place s awesome. A must whenever in NOLA. Barbara made our visit even better, awesome","useful":0,"cool":0},"BOByDEabT0k7nN0VdnUjIw":{"text":"Orand did amazing! Talented nice and quick!!!! Great appreciate how fast i got my good and","useful":0,"cool":0},"n3zWic9P-QJ0dhG3LyL-sQ":{"text":"The crab claws and charbroiled were soooo good. We also got stuffed shrimp and alligator p","useful":0,"cool":0},"1oD3hAG2vouvUdAvl-ldgg":{"text":"We (party of 3) visited for lunch. The service was efficient and the food was delicious. T","useful":0,"cool":0},"BRpkRv_QDWAlkLCcCxoQCQ":{"text":"This place was really good. Nice portion sizes too. I'm not sure why we had to eat with di","useful":0,"cool":0},"UTTmJBtzPruHHBDvkiFLKQ":{"text":"Came in on Saturday evening over MLK weekend. There was also a NFL playoff game on TV so t","useful":0,"cool":0},"KnpJ0uZNIgNY2zbiNR9trA":{"text":"Had lunch here after we kept passing by during our New Year's vacay. It was always packed ","useful":0,"cool":0},"JNyTn2UPaWRrRVvmmbWYoQ":{"text":"Shrimp and grits are a must let me just say they were amazing nothing like Nola food here ","useful":1,"cool":1},"Sh34Q8v89lGcMD7ePbli5w":{"text":"I can't in good conscience rate this higher. \nThe good: the BBQ chicken sandwich is very g","useful":0,"cool":0},"Gd-kw_lEf_dtlapEflW08w":{"text":"This food was delicious! But the best part about our experience was Tina! Her customer ser","useful":0,"cool":1},"EX4ZYcBLalLMw4eL7E7eIQ":{"text":"This place is on Bourbon Street. We had walked by it several times and one evening my husb","useful":0,"cool":0},"6V4ghyMxFtywEMWlIzdCfg":{"text":"Pros: cool bartenders, good boiled crawfish, decent pricing for bourbon street\nCons: a rat","useful":1,"cool":1},"Jbd1IVUS6-EsVwDwYosE_Q":{"text":"We had a Great Meal. Food was very tasty. Had the Blacked \"Fish of the Day\" whichnis same ","useful":0,"cool":0},"oPfGeDDUTVtl0WEgIFditQ":{"text":"The closing time on week day is midnight but the hostess started closing the window/door, ","useful":0,"cool":0},"zF4wF46HCj0rNjSM-YrRtA":{"text":"Great food but even more important awesome staff.  Kudos to Ashley J who is a fantastic se","useful":0,"cool":0},"C6fiTxPWE7W7oLdwSS6COA":{"text":"We saw a billboard and decided to give this place a try.\nIm a foodie and visiting this pla","useful":1,"cool":1},"iHkqMXgUGb-CogOBM7JJPA":{"text":"I wish I could give this place less than one star. My friends & I made the mistake of wait","useful":1,"cool":0},"XvTMrS1N7TfYEkPQkkj-BA":{"text":"OooSpending the day in the Big Easy with family. Decided to hit up 424 for a taste of caju","useful":3,"cool":2},"L1Sq1DW5HkOM_maKj_n1kw":{"text":"We had a 'few' drinks and were in need of food. Neither of us had oysters so we ventured t","useful":0,"cool":0},"WJH1PANOADVcy526tR2GtA":{"text":"The dinner was ok. We went as a big group of 12 women. The apps were good and they were ve","useful":0,"cool":0},"FZgBSdRx92rsshOYTfrXCg":{"text":"This is my all time favorite place to eat with I come to New Orleans Bourbon Street! Our w","useful":0,"cool":0},"LGT6Fp1dprcHR_8yCl4xkQ":{"text":"Typical touristy spot. Charbroiled oysters are good and other dishes are lame, pricy and s","useful":0,"cool":0},"OoknXrukPf8W_5-5G0xQIA":{"text":"Great service but food is terrible. Waited 40 minutes for a shrimp poboy that had 4 TINY s","useful":0,"cool":0},"HeDrOh0Jxed6Gch1aOWqLQ":{"text":"My boyfriend and I stopped in to have some good ole' fashioned New Orleans food and were N","useful":0,"cool":0},"Yz9m5ZNVPldGFfZvJ19cxg":{"text":"We had an early lunch. Ambience was good. Doors were open onto the street. Crawfish queso ","useful":0,"cool":0},"9c_OMobI3NggtR9BwOXs_w":{"text":"We were so thoroughly disappointed with the food !! We walked in to have dinner ..thought ","useful":0,"cool":0},"z4HtoYishy0h7Wjps3pslQ":{"text":"Food was Excellent,SEVICE was great, people watching was even better  haha. All in all goo","useful":0,"cool":0},"uZeVV1MAKGW9-kQUEJXdUw":{"text":"Only thing worse than the smell is the service and the quality of the food. Absolutely hor","useful":0,"cool":0},"oO5jWo_ADPrlIDmv9IVuEg":{"text":"Have the charbroiled oysters and the extra strong Abita beer. Awesome combination!","useful":0,"cool":0},"4UmVe8t_oAuu999VO-svQQ":{"text":"So folks you are in New Orleans.  Don't waste your money or time here.  Too many places to","useful":0,"cool":0},"WrHV5hJbW_m4Kp6Wct9HFQ":{"text":"Crawfish were tasteless and very small compared to other places in the area. Spice level o","useful":0,"cool":0},"akj9qdGXNruzgzqeh3Ekmw":{"text":"Oh man.\n\nWe sat down at our table and after 15 minutes of no service got our drinks from t","useful":1,"cool":0},"MChI4RN7Rz5UtwKEW-48yg":{"text":"Food is okay. It isnt terrible but nothing note worthy. Drinks are good though!! But what ","useful":0,"cool":0},"iDFsJ_o5Zf6REaLwAn70Cg":{"text":"normal mid-range creole restaurant on bourbon st. my friend and i just stopped in to split","useful":0,"cool":0},"yqOMs3ibvZK4X1tYwuqa8g":{"text":"What a gem!  We sat at the bar and Sam kept us full with the largest, most delicious oyste","useful":0,"cool":0},"05g7Uz4lHgA_2abrSg7eGQ":{"text":"Great alligator! \nStrong drinks, bordered too strong. \nMenu is just ok. Lots of fried food","useful":0,"cool":0},"gp1DWfqqrd5EqfyOSZZBEA":{"text":"Was on my way to desire oyster bar for breakfast but arrived to late and they were not ser","useful":0,"cool":0},"0orZQ5cvuBbLvFMCjqAHKw":{"text":"The wait to seat was much shorter than other spots in the area.  Our service was excellent","useful":0,"cool":0},"Gi61nu1uqRA5boDXJ_gmVg":{"text":"First night in New Orleans had dinner here and it was absolutely amazing! We had a nice vi","useful":0,"cool":0},"QBBYtRC0sJFbq9q2T-TsFQ":{"text":"The food is 4 stars. Our server \"Q\" was dreadful. We ordered appetizers to share, and had ","useful":0,"cool":0},"6PNDthNsgWkTqKA85Xadbw":{"text":"Good food with overly salted sauces. Our service was reasonable. Our first night in town w","useful":0,"cool":1},"A9aU66ab24-WET3nddWp-w":{"text":"I'm not a tourist but My family and I love coming down to this place to have my crawfish e","useful":0,"cool":0},"zHCXun3K_pB-lFyyNwEiYg":{"text":"First visit to New Orleans! This was one of the restaurants that was recommended.  It was ","useful":0,"cool":0},"wxwgw4dxFtVPAjw9jAQ7kA":{"text":"Service was excellent. Price was on par. The food...and we tried alot of it was great! Red","useful":0,"cool":0},"7380MbU23e7MVK_Jh2pdsw":{"text":"Stopped by for lunch, and had oysters and gator. \n\nThe food was good, and the service was ","useful":0,"cool":0},"9q4SdDzHieww-lWOirVmZA":{"text":"We've been visiting New Orleans regularly for about 10 years now and have had a lot of goo","useful":0,"cool":0},"ETDGl3Cmjk-Y0FPZHPwT9Q":{"text":"Great food, nicely decorated and good atmosphere right on Bourbon St.  Absolutely horrible","useful":0,"cool":1},"2GOBu9gCIXhWZ4TH6dKBTg":{"text":"The first time we came, I fell in love with their jamabalaya and my husband loved the crab","useful":0,"cool":0},"YLLpzFbGm7gc7_ifNHsmLQ":{"text":"Wasn't excited about this place at first, because it wasn't very \"inviting\" or historical ","useful":0,"cool":0},"bl_vnF5PRfstfGfWb3lzgg":{"text":"Did not enjoy the place. I was on vacation with some friends thought we would try this pla","useful":0,"cool":0},"308cLImfNBp_9B1SQGOFuA":{"text":"Our waitress, Jaemayra, and our chef, Donovan were fantastic! Service was A+ and the food ","useful":0,"cool":0},"9ADlaOO0SmZGAxfc_1AWUQ":{"text":"Lousy food.  Shrimp and crab pasta was terrible.  The cat fish In the Poboy was ok.  Not t","useful":0,"cool":0},"7Zj8WZkWwICMSBk_h9gcmg":{"text":"Second visit to NOLA and second time visiting Pier. We love the consistency and the food i","useful":0,"cool":0},"0GacT1BSrNNZ9tT8x4u3Tg":{"text":"Upon a late arrival to New Orleans, we were looking for a quick, nice, tasty restaurant fo","useful":0,"cool":0},"aXZolYKfY3jJbTJ6UAxhxg":{"text":"Fairly priced and good sized portions. The crawfish lettuce wraps were ok, nothing special","useful":0,"cool":0},"vCgCiAqHWw4pnT_nCb7h5Q":{"text":"Surprisingly good good, given the location in the heart of Bourbon Street. It wasn't too e","useful":1,"cool":0},"ZRmUwn2V-JoDW1kPQNf4Hw":{"text":"Terrible service and bad food. Waited and waited for a spoon which I had to fetch myself b","useful":0,"cool":0},"AEUMRMTe8a39HDSlIn4O2w":{"text":"First time traveler of NOLA. The food and service was fantastic. Will definitely be return","useful":0,"cool":0},"8ulNr7pwpGYo4GkAkgjxZQ":{"text":"Great location and delicious food! The shrimp and fried grits were so yummy- will be back ","useful":0,"cool":0},"Z_p7an7cfI7IOzIzNf35ag":{"text":"Simply put.... find somewhere else to eat. There are literally 100s or other places nearby","useful":0,"cool":0},"CH_KkeVLGamDcErCTj_GNw":{"text":"Seriously disappointed with our experience here. Stopped in for lunch before the Saints ga","useful":0,"cool":1},"gaTcNLqTf7ZoQd9QrdcjKQ":{"text":"This is the place to eat if you like charbroiled oysters!  We come here every time we are ","useful":0,"cool":0},"M8W4SIaWmoBwtyixAVS6pg":{"text":"They have amazing fried chicken and red beans qnd rice. Our waiter, Danny, was excellent a","useful":0,"cool":0},"LqtLVhnIO_d017JEpnirHw":{"text":"This was a fun place to eat for a tourist. Good views onto Bourbon Street for people watch","useful":0,"cool":0},"cpgG5DuD80pm4PN76v-X3A":{"text":"Amazing food!! We have been here a couple of times this trip and everything we had was so ","useful":0,"cool":0},"Nu0J1NDoRIOZomZxUU2eAA":{"text":"Terrible service. Asked for a few alterations to our order and none of them were met. Wait","useful":0,"cool":0},"Ah96n_3dQAlZ9S63ReAB4A":{"text":"Great food and service. Ask for Frank the Tank. The Alfredo crab cake was amazing along wi","useful":0,"cool":0},"JtCZf7e6eMz_wt6Rt_EL-Q":{"text":"Terrible service, mediocre food. Whoever is in charge of marketing for this place deserves","useful":1,"cool":1},"xCiPrppW-eS3CO22b4eR_w":{"text":"Food was very tasty. I had the Crab Cakes, Corn and Carb Bisque, and sampled the Blackened","useful":0,"cool":0},"1p4gQ4S3rMImrNqcjDy7wA":{"text":"First visit there and loved it. I will definitely visit again when I'm in town. Anthony th","useful":0,"cool":0},"xzpZsUUr03Y0f66YtJSdvQ":{"text":"Jamie is the best server ever! And I spent my taxi money to the airport just to eat here a","useful":0,"cool":0},"6e38oSzqCSUo11I33SKFxA":{"text":"Terrible experience. We were down in New Orleans for the Sugar Bowl and decided to try a r","useful":0,"cool":0},"-g5DILkaM8hnxTOYNay67w":{"text":"Made our usual stop into 424 while we were in town.  Delicious as usual.  Service was awes","useful":0,"cool":0},"2h6L-FwNfV-PG9li39celw":{"text":"Made our usual stop into 424 while we were in town.  Delicious as usual.  Service was awes","useful":0,"cool":0},"_l-T813Lfg6m0DbfpbhE3g":{"text":"Customer service: It may be time to hire more servers, ours was in attentive throughout ou","useful":0,"cool":0},"dErTDJKqcZky0hPWsGjL8Q":{"text":"I had a shrimp po-boy and the bread was pretty tough. I also got crab and corn bisque and ","useful":0,"cool":0},"gbr2dCHdohnRLvTyB-yejw":{"text":"I've never liked oysters... Until I came here. Holy moly they were delicious. Entire exper","useful":0,"cool":0},"32faZQ_8emCpbVk1MEkY8w":{"text":"The person at the front told us they had boiled shrimp, crawfish and crab legs . We go in ","useful":0,"cool":0},"dW8L9JTRqVvhzemGSGYRKQ":{"text":"Ordered the alligator. Pretty good \nOrdered the crab... Too spicy. Seriously, I just licke","useful":0,"cool":0},"6QrHhC3BDHqqqnErQfsQIQ":{"text":"As you walk up you are greeted politely by hosts and will either be directed to the bar or","useful":1,"cool":1},"C6EYkceEW6r3OOHX5sPoVg":{"text":"We had reservations with a a bridal party of about 16. This is a large group so I do under","useful":0,"cool":0},"9sMzefI_g9I6lYpXm_EyWQ":{"text":"After a 2 week road trip we stopped here on our last night. By far the best food we had, e","useful":0,"cool":0},"LKLqARGQsnWZ3uRA8ZXM0w":{"text":"During our trip to NOLA for Mardi Gras, we decided to check out 424 Seafood Market. The li","useful":0,"cool":0},"nOGoV-66x98Tw6NduLvPIg":{"text":"Pretty good place. Atmosphere was very nice. The boiled shrimp dish was pretty good, but I","useful":0,"cool":1},"MdQhvLSJoGJEJlUMjSZ53g":{"text":"We came in on a recent business trip and got some dinner here before wandering the street ","useful":1,"cool":0},"uK3vq_7YRV3fjsYakVYPIQ":{"text":"Loved this place! Great food (Chicken w/Red Beans & Rice) and great service at the bar :) ","useful":0,"cool":0},"8YT21dyRhMroLpmWCGxdbQ":{"text":"Randomly stumbled upon this gem while drunkenly roaming the streets of Bourbon...Not a rar","useful":1,"cool":0},"ftlhEc-KBSGb7lljftwEGQ":{"text":"I personal feel they can do better appetizer of shrimp was only enough for one person. cra","useful":0,"cool":0},"iSgWXM6tWD9ZV206fEL2dQ":{"text":"Loved this place and the food was wonderful.  Have the gumbo!  A must in New Orleans.  Fri","useful":0,"cool":0},"crMzzZBz341ZQ_xxhAbOwg":{"text":"Can't beat $13.00 for a dozen raw oysters! Sat at the bar and had raw oysters, delicious f","useful":1,"cool":0},"coRHfirEsQ8oDZdcSkaSrg":{"text":"This restaurant can be found off Bourbon St. The menu has a large variety I just wished th","useful":2,"cool":0},"5wdAel_alEafxgPqPncsog":{"text":"Friend and I went in and sat at the bar to eat lunch. The bartender finally took some orde","useful":1,"cool":0},"HyMVnM6WD3pqSxc5aBHlvQ":{"text":"Service was extraordinary from the get-go, and then the food arrived!  Crab cakes were exc","useful":0,"cool":0},"b-EW3mykUiWY9NDtYnZpxA":{"text":"Tearanie was amazing and food is out of this world. It's a definite must when you come dow","useful":0,"cool":0},"AT8no-z4es6HAZpWT2fW9w":{"text":"I was completely underwhelmed here. From the moment we walked in until we left. I honestly","useful":2,"cool":1},"iTPgqB3v8tuiiW_srArSGw":{"text":"Only gave it 2 stars cause the waiter was nice. Wasn't a fan of nothing that we order. Cra","useful":0,"cool":0},"Yv5ErQtvbh9yijHQyb5DjQ":{"text":"This place is phenomenal! The service is is second to none. We walked into the restaurant ","useful":0,"cool":0},"MWT9XYHqrtlkh3_xfmG6iw":{"text":"We just ate lunch here.  Garrett was our server and he took very good care of us!  Nice at","useful":0,"cool":0},"RzPL9uoqLvMPw84Lhpq_qQ":{"text":"Service was Amazing we were there 18 of us \nJae our waiter went above to help us she is de","useful":0,"cool":0},"WLVCsA9M8gTqSYngjia9dg":{"text":"Tried the grilled oysters, calamari, fried alligator as appetizers; the calamari and allig","useful":0,"cool":1},"g3KoGPnfl7UIVzpF5obE2A":{"text":"The candied pecan fried fish was great! I had to give three star because I let the waiter ","useful":0,"cool":0},"ytepUj8fVsAXRMOOV7B7xA":{"text":"Gumbo, blackened chicken & veggies could use more seasoning. However, the baked Rockefelle","useful":1,"cool":0},"AaofNrNEvC2mrpVZXaLY6A":{"text":"Service was extremely slow even though the restaurant was pretty much empty Maybe 5-7 tabl","useful":0,"cool":0},"hNK5jURpQlWjFpCY4Cv9OQ":{"text":"The bar is set high for seafood when you're on Bourbon St. (or New Orleans in general) and","useful":0,"cool":0},"73WITN5dXt2Xjmi5NdKoMw":{"text":"Wow. The crawfish lettuce wraps and sauteed crab claws were to die for!   My husband is a ","useful":0,"cool":0},"S4WQXj-f80Ae329W-wodAA":{"text":"Delicious as always! Love the crab cake and shrimp pasta! Excellent service and convenient","useful":0,"cool":0},"Ga6PFDjRE8qvc3S8Nm4zaw":{"text":"I have worked in food service and so has everyone at my table and we are unbelievably disa","useful":2,"cool":0},"1cpcxIXxRWAoMdyQSU3Snw":{"text":"My friends and I were walking down Bourbon and wanted seafood for dinner, so we looked at ","useful":0,"cool":1},"ehaJSJuh_Np_86e5D23BWA":{"text":"Came here when I was visiting New Orleans for some research. I really wanted some craw fis","useful":0,"cool":1},"fFmREtMqFp6OPXKYHeLDXg":{"text":"This is a great place to stop and eat late at night if you're still wanting to have a good","useful":0,"cool":0},"K2GY7V8o6iIXo45H7m-RXg":{"text":"Crap food, crap service, waited over 45 minutes for food that ended up being cold... solid","useful":0,"cool":0},"MqGTvBMmhslzXaE5HZBYUA":{"text":"Excellent staff and delicious drinks - I recommend ordering the sautéed crab legs, you won","useful":0,"cool":0},"pwSpMI51Vjb8Lm0Q3kNnnA":{"text":"Got  crawfish here and they were the worst ever. Seated right away but waited 30' for our ","useful":1,"cool":0},"Hw5rkrj-7O2puCEvx1tHEQ":{"text":"I really love this place. The food is always fresh and the staff is awesome. Frank is the ","useful":0,"cool":0},"knzXVbtRSFcWq_fChvakNg":{"text":"Where do I begin. Well my sisters and I drove 19 hours from Buffalo, NY to get that authen","useful":1,"cool":1},"686URJYkFhruXPQoVXkPiQ":{"text":"Servers were really attentive and nice. Kitchen must have been behind on the night we visi","useful":1,"cool":1},"Vr4tvltmAfArF5Qh6Ek6cQ":{"text":"Best hush puppies EVER! My hubby loves his oysters and said these are the best he's ever h","useful":1,"cool":1},"cyb9vn4eEfmkgs-c6JhYTA":{"text":"Eating here was the biggest mistake ever. Upon arrival, we told we would be seated shortly","useful":0,"cool":0},"kUafNYkuSxfOXav5LVYLEQ":{"text":"This place came highly rated and was absolutely delicious! The crawfish queso (which i was","useful":1,"cool":0},"2f_kbIuJ6RI7VZ1gM7E7lA":{"text":"Find Sam the bartender! He's the best. Makes great drinks and great conversation. Thanks, ","useful":0,"cool":0},"t__3W0w3MyMOP2Il7Y9TuQ":{"text":"We always come to Pier 425 when we are in New Orleans, but this time, it wasn't the same. ","useful":0,"cool":0},"skFep6xOOh6DrMqRcPECFA":{"text":"Worst experience ever. We drove 11 hours to New Orleans for our birthday celebration and m","useful":0,"cool":0},"asA2FOpeq8rm1vwLxMaT2w":{"text":"The food was very bland... service was great, but the food let us down. If you get a chanc","useful":0,"cool":0},"IhnowErC88rg4JaOaAPr3g":{"text":"This wasn't my first choice this night, but since I slacked on reservations and everywhere","useful":0,"cool":0},"vQ3JTOQ0gq9yP2tbU6orBA":{"text":"This was a bad experience all around. First we had to wait in a line as if we were waiting","useful":0,"cool":1},"T7QtTsNGcyl_h9yRGt68HQ":{"text":"My husband got the chargrilled  oysters and he said they were great. I got a crispy chicke","useful":0,"cool":0},"bpG5fzTylLew02Ol_fFEyw":{"text":"1st and last time here. Ordered 1/2 dozen raw oysters and 1 drink and it took almost 20 mi","useful":0,"cool":0},"23smdi0FvEc0X30vx4mKvg":{"text":"Not real creole food. Mediocre service . Good bartender though ( she looks like Ellen lol ","useful":0,"cool":0},"lcMNHxC8cNbC8QiCHCj-_Q":{"text":"Hurricane, voodoo juice.  Smoked salmon, fried oysters, gumbo...all of it was really good!","useful":0,"cool":1},"eOsPO70kgh5V792skkpotQ":{"text":"This was an excellent seafood find in a great part if town. A music filled atmosphere with","useful":0,"cool":0},"F7tMCRUqj692txbmAZiDPw":{"text":"The food was really, really good. Like, \"lick the bowl good.\" We had the stuffed shrimp an","useful":0,"cool":0},"ayrHBJrKqQ52FIk8xnBpiw":{"text":"Great staff. Great view from the balcony. Incredible alligator. Ask for Britney!","useful":0,"cool":0},"gYlDWc4vepU42SIdgfZCHw":{"text":"We will never eat at this place again. We made the mistake of looking for a place to eat l","useful":0,"cool":0},"q0zMx_V8r2FWQnr9uhEpug":{"text":"Delicious seafood! Crab cake appetizer was out of this world! I had the seafood trip with ","useful":0,"cool":0},"Q-nTidelbThlK8Iv28NQmw":{"text":"My first impression of Pier 424 was of upscale dining from the appearance but my wife and ","useful":0,"cool":0},"FSDcJkBfhif6ujbO_Rexsw":{"text":"The charbroiled oysters are so good but the crawfish lettuce wraps were too heavy on the m","useful":0,"cool":0},"ifxrBGw1DEvhXU8gUu3njg":{"text":"Slow (though friendly) service and cold, mediocre food. I ordered the alligator poboy. Com","useful":1,"cool":0},"S43LWIrtA5WP74mwnnXRCA":{"text":"So Pier 424 was not a must go to on my list, but it was late and everyone was hunger on Bo","useful":2,"cool":1},"O3iWZM7GqSn9co6M5OZRCA":{"text":"On a recent trip to New Orleans we had dinner at Pier 424. I had the spicy crawfish lettuc","useful":0,"cool":0},"m0YqWNwJzkWqD3ozPxPJ1A":{"text":"Shrimp Poor boy was nothing to write home about. Dry and no pickles or sauce Ordered a doz","useful":0,"cool":0},"srbTQQJ-A_1qsgaMNDE1sA":{"text":"We strolled down Bourbon Street with an empty stomach when we discovered this place. Since","useful":0,"cool":1},"MRwJUFfiUjaEykoWTrzOmg":{"text":"Lisa our server was amazing. You must try the Shrimp and Maque Choux Grits. The atmosphere","useful":2,"cool":2},"ZRS2jxR5vJ0323a37zWbzg":{"text":"This is a fun little place that I tried on my own during a little unexpected free/alone ti","useful":3,"cool":1},"X3c07pzzh1N2-1IDr4K_pQ":{"text":"Rare is the day that I wake up in time for breakfast on a non-school day. But, here I was:","useful":8,"cool":5},"RynxHdsEUyC1RaqjpJ8_8Q":{"text":"We definitely came on a bad day. Apparently they were updating the pipes and was unable to","useful":0,"cool":0},"WZq-r8u4J9W_npJUXcGyLA":{"text":"Visiting from California excellent food and friendly staff there oysters are exquisite hig","useful":0,"cool":0},"qYa6kIk3UIWJX6RuURggkw":{"text":"Enjoyed the service and the crawfish. Strolled through during Mardi Gras when it was crazy","useful":0,"cool":0},"LD2zgEcjGY-pk4wBegBzJw":{"text":"This food was excellent! The drink was a bit watered down but the seasoning, temperature a","useful":0,"cool":0},"7Fv-1EDU0sOFBdBoBsfJrQ":{"text":"The staff were great, they welcomed us in, and they were very accommodating during their p","useful":1,"cool":0},"9ykSeRI7lKaVwv01AQsd7g":{"text":"We were all hyped up for some great seafood for dinner after passing up our original resta","useful":1,"cool":0},"QHErpqjjkYNVgP3HuxZHuA":{"text":"I'm kind of shocked at the low rating. My only experience here has been nothing but excell","useful":1,"cool":0},"pCp3mo6nVJDWgkQVX5F13A":{"text":"This was not a  good  place to eat I ordered seafood boil with the shrimp potatoes and cor","useful":0,"cool":0},"RV8eazmPDj2aK6Rh2lRBMg":{"text":"Great seafood and drinks! I highly reccomend the crab legs creole cream sauce appetizer. C","useful":0,"cool":0},"0xUPiVJ-eo-UcsWXDxeEWQ":{"text":"First, our waiter Erin gave us an awesome review of the menu. On top of the awesome servic","useful":0,"cool":1},"woIojpBrjxFbmIfFHuYgXQ":{"text":"Not as good as I expected.  Had a long line outside the establishment and figured that the","useful":0,"cool":0},"6totux8gmbEXAYZJc_Z34A":{"text":"The restaurant had horrible and slow service. We were seated promoters then the wait staff","useful":2,"cool":0},"zgD1q6CKrZxvSBD3ReRODg":{"text":"The grilled oysters are definitely a 5 star menu item. Enjoy them at the bar if you can. T","useful":0,"cool":0},"QsQJF6Q7ec8I5BLbyPFaMg":{"text":"The best hurricanes. Not too sweet, just right! My vegetarian options were very limited. T","useful":0,"cool":0},"p0mry9_LS9vcqlFUsBz5Rg":{"text":"In the heart of the French Quarter is Pier 424. The food is fantastic. I had the alligator","useful":0,"cool":0},"LuXorbhjDYw7OjS8JuIMwA":{"text":"We stopped by here based on a recommendation from a friend.  Initially we just had cocktai","useful":0,"cool":0},"WrMjNNa9F1DBE7WeUCfX6A":{"text":"Jamyra, our server, recommended the crab bisque and omg!!! It is amazing. I'd skip the hou","useful":0,"cool":0},"RuBnuL5Jd1j5gRfG_p2Hrw":{"text":"The oysters are a little small!","useful":0,"cool":0},"ALa_cwTUo_XisI9ziLqjsA":{"text":"This was my first trip to New Orleans and I'm having an amazing time!!! The food here is A","useful":0,"cool":1},"1zp7Yhc6RtZmDvMucxRetg":{"text":"First, Bourbon St is just gross, but if you find yourself on Bourbon and you're hungry, th","useful":0,"cool":0},"F4Qhw5hHfO5tmqWSRzc2qQ":{"text":"Only reason this place gets 2 stars is because it has air conditioning and tvs. Crawfish a","useful":1,"cool":0},"sHDB-ySAPoJAnPd6Fd9C1w":{"text":"I was super disappointed with this restaurant.  For appetizers we had the froglegs and win","useful":0,"cool":0},"jh8KWLocvOO1qndimSLmXA":{"text":"Alright, I don't normally single out a person on these... but shame on whoever hired the i","useful":0,"cool":0},"4AgLlwwdQHh1uf6jhTl4YA":{"text":"Great restaurant! Food was wonderful service was excellent or server was knowledgeable and","useful":0,"cool":0},"eYELxB-ayL6y1boV3vamYQ":{"text":"I ordered 1lb of crawfish and the food came out overcooked and not fresh at all. This is d","useful":0,"cool":0},"GplSxN_l8TyJzIYepsiboA":{"text":"This place was absolutely disgusting from the service to the food. I'd give it 0 stars if ","useful":0,"cool":0},"q1GafXrXS6SHDKyoL0h07Q":{"text":"trio = a eviter/ to avoid une espece de sauce infame x3   . egalement a eviter quand on es","useful":0,"cool":0},"mn9cO5NmOCodqSz21XdyaA":{"text":"Hostess named \"Reality\" worse attitude ever.\nLost a party of 4 before us then lost our par","useful":0,"cool":0},"CFGHsk7J3eN4N0CaAe2m3Q":{"text":"We were strolling down the street and a smiling greeter snagged us in with her charm and g","useful":0,"cool":0},"5PalfRtsggNZjO_bSbE3FA":{"text":"Second Restaurant we have dined at since being here and the food was good.\nPros:\nWe had th","useful":1,"cool":1},"cP8kXCseHcs5f_hh_143eQ":{"text":"Not for me. I asked for the shrimp boil. This is what I got. I only got one little sausage","useful":1,"cool":1},"-073t_tjuaLakG6HJZxwKQ":{"text":"We came to New Orleans for a few days and couldn't leave without having seafood! We starte","useful":1,"cool":1},"yndviX45YSnef6TxZAKmXQ":{"text":"Food is delicious.  They ran out of crawfish queso at 1pm which was disappointing but food","useful":0,"cool":0},"PyL9j7QU2Ui3b7Bg0YWIIA":{"text":"This place is kind of a hidden gem, it sits on Bourbon Street. From the looks of it you wo","useful":0,"cool":0},"AFSjNTEet0z_CKp5r-Zobg":{"text":"Our experience here was a nightmare. We waited at the door for over an hour to even get a ","useful":1,"cool":0},"Z_h4JAEPQBXtqqZQGx2JtQ":{"text":"Great Oysters, great service from our server Frank. Best Oysters o have ever had, hand dow","useful":0,"cool":0},"CgmAJ4HUaIc4T4vENt2JVQ":{"text":"Shakita was our waitress and she was super!! We ordered the crab claws appetizer and it wa","useful":0,"cool":0},"zh0OqHgOrcW2LjUPqtL8yA":{"text":"The food was great but it just took way too long for the food to come out. We had a big pa","useful":0,"cool":0},"Tk7XS0sqSxW-xGASF0ECRQ":{"text":"First time eating here and it was absolutely amazing. By using and checking into yelp ther","useful":0,"cool":0},"lzUFW6IjGxgaGqOV9e8Jng":{"text":"Hostess was super rude to our party of five which docs them a star.  We ordered fried alli","useful":0,"cool":0},"TZoejkOvbWL_VTAjh4w0Qg":{"text":"Come on!!! This place is great - the food is over the top good- presentation is profession","useful":0,"cool":0},"KwxDPHjRs2Ka4qo8zVNBdQ":{"text":"I'll start off by saying that the only reason the review is a 3 instead of a 5 is because ","useful":0,"cool":0},"GMYFp28WR33qH8GOepmHtw":{"text":"Came here late at night after drinking heavily and needed something to soak up the alcohol","useful":0,"cool":0},"njfekBY6dqvjKtHkzoIaXg":{"text":"Good food. TERRIBLE service. Had dinner with 10 other family members for my niece's birthd","useful":1,"cool":0},"Kq5K7E0zYG9n0Ua9zBoL2Q":{"text":"Fresh delicious oysters. Very clean place (especially for the middle of bourbon street) Go","useful":0,"cool":0},"SAOpoQQCZTI28qlrDtuMJw":{"text":"The food was absolutely delicious and our server was very nice, albeit a little inattentiv","useful":0,"cool":0},"q4gGDtidr3nQ7DKubbNQAA":{"text":"There was a group of about 10 of us and we got seated fairly quickly. We had a new server ","useful":2,"cool":1},"Gb1FmcOb963LyhdxOYQz-Q":{"text":"I was visiting the French Quarter for a couple of hours on my way back to California from ","useful":0,"cool":0},"uGRvCEiYMJkMqhZRtxcfCQ":{"text":"Location is good but the food is very mediocre. \n\nThey keep a long line outside but when w","useful":1,"cool":0},"9EyPfS7CuSCrS7vik3yPUA":{"text":"This was my first time having crawfish and it was seasoned well, and the corn and potatoes","useful":0,"cool":0},"4EfdrWK-UrLpv4qVhlxIgA":{"text":"This place was a great introduction to Nola. We stopped by here to have lunch as were hang","useful":0,"cool":0},"fexaBrq80-rQ0WV_3s-T7A":{"text":"Ok we just got in from an epic bike trip from Memphis! Told my buddy about the hush puppie","useful":0,"cool":1},"uz5q1owb36Q1hcIUxShVmQ":{"text":"Pier 424....what seafood in The Big Easy is all about!!  Deep fried, fresh as hell, and ju","useful":13,"cool":13},"BR6PNN9rodTHFJDBdxAZsw":{"text":"Horrible service!! \nJambalaya was salty \nShrimp po boy was decent but the bread was really","useful":0,"cool":0},"WKCBBtRK1a37igpwjDtCzw":{"text":"Visited on a Friday evening and had to wait about 30 minutes before being seated. Well wor","useful":0,"cool":0},"9aXpOpW9_TuirKbNgSZjUg":{"text":"Service was awesome. Dawanna was so wonderful. Even brought me extra olives. Very pleased ","useful":1,"cool":1},"PkR271eVWJC5rp10AuLLSA":{"text":"Not sure why there are high reviews. Must be from drunk people.\n\nService was terrible. Ser","useful":2,"cool":0},"0yGsAmtx0yqrh4NtQ6bQZw":{"text":"food sucks. Bad service. Server tipped a glass of water on my lap. No apologies just a nap","useful":1,"cool":0},"tPoImpb1Lk1lTKqkmNvAjQ":{"text":"How does this place only have 6 reviews?!?! I've been here three times on three separate t","useful":1,"cool":0},"vpNrrAnQWYo6PPGQnVUTyA":{"text":"Ate here a few weeks ago during a night out on Bourbon. We were seated rather quickly and ","useful":0,"cool":0},"kjaPfRXYE-F2oFsANBNThQ":{"text":"This place is awesome food was great. Sam and Alvin were at the end of the bar where I sat","useful":0,"cool":0},"FTI1snGBfXTLOKnxJC_55g":{"text":"Nice surface delicious food reasonable price and portion what really I like is when you se","useful":0,"cool":0},"OfQcUwC24S9jKab3b3MRHg":{"text":"Wandered into this gem while walking Bourbon St. So glad I did!! Our server Nadia was grea","useful":0,"cool":0},"a916YbqnDO5HpdPozPgjDQ":{"text":"We had friends in from Boston and brought them for lunch and I have to say the food was gr","useful":0,"cool":0},"9WEkcOYB--ZmQ91_d3yNkw":{"text":"Pier 424 is amazing. We ate here last night when we arrived in New Orleans and we are back","useful":0,"cool":0},"F0OWQjQb6bsnjUFcSCNEdA":{"text":"Food is awesome. Be sure to sit up on the terrace for great people watching on Bourbon str","useful":0,"cool":0},"ganm9kwm2mx3pRpsA7HM1A":{"text":"So good!!! The service from the waitresses we've had (we came back because they were so gr","useful":0,"cool":0},"jON3vgngrxyEr3143J1KIQ":{"text":"Lucky me for stopping here with my two daughters and wife... And it is smack dab in the mi","useful":0,"cool":0},"gPCDV7-NYsBGrQ82mFgfRQ":{"text":"Visited for the first time with my fiance where we received great food, well priced menu, ","useful":0,"cool":0},"IDjkjxfaCuAyrJvOMcR6qA":{"text":"We stopped here Saturday night because there was a wait at a few other places. The alligat","useful":0,"cool":0},"JVPOgQuOG2O1nqhrXJiKjw":{"text":"When I was experiencing the legendary ambience of Bourbon Street, I decided to try out thi","useful":1,"cool":1},"_TJdf9X2WLzhXTm8GtENrg":{"text":"Terrible service, food was only warm when we got it. Not very tasty compared to other near","useful":0,"cool":0},"rFGtjwuxClpYvIL_D0vR7w":{"text":"I wouldn't go here . The customer service is horrible . We waited almost 2 hours for apps ","useful":0,"cool":0},"YV3bqO7-yLMFYPY-1HRDGw":{"text":"What a wonderful place. Jasmine C. my server suggested the oysters and I said that I'm not","useful":0,"cool":0},"7AgI62E_0jVndOM0Lsi8nA":{"text":"Good place to grub on Bourbon. Get Jamie to help you with all you seafood needs. Be sure a","useful":0,"cool":0},"C39ikE8lldN54GKOl6DJvQ":{"text":"Grilled oysters we wonderful & voodoo juice was great!  Thanks Steve!","useful":0,"cool":0},"ZvxzLaT8UrUrDHB5pBovXg":{"text":"HORRIBLE food, HORRIBLE service!!!! I ordered the peel and eat shrimp boil. Food took abou","useful":0,"cool":0},"UzyVavG34AWXLUM2uss5BQ":{"text":"Enjoyed our meal, service was good.  Blackened drum was tasty.  The restaurant was recomme","useful":0,"cool":0},"YT8oCVMwkwCOWEEzPeGnNg":{"text":"This place was fantastic!  Prices were great an our server sarah was fantastic!  I can't r","useful":0,"cool":0},"rCXzTri9TXC4-pYF2AHEEA":{"text":"Only place to have great food on Bourbon! One of the top restaurants in New Orleans. Great","useful":1,"cool":0},"CZoxsZtjB8CzCIvaVVDpVA":{"text":"The service was great our waitress was really good. Now I don't eat seafood but was with a","useful":0,"cool":0},"MQpovW1Eye6aK6qvrzx3uw":{"text":"Went for lunch on a Saturday. The service was painfully slow. We were there almost an hour","useful":0,"cool":0},"U6VD69oDEWGJmMvg0853sA":{"text":"I visited New Orleans for the first time in August 2013. My husband and I ate at the Pier ","useful":0,"cool":0},"PQ2v4nmjYlYFg3gNt7vT8Q":{"text":"I found this restaurant on google and yelp so I decided to check it out. On their website ","useful":0,"cool":0},"Xhnr2eETRd7ykVso0q0O3A":{"text":"We stopped in for dinner and drinks during our trip to NOLA... not only were we greeted at","useful":0,"cool":0},"S2axW2-7gGCJyybrN4uN0A":{"text":"AMAZING SERVICE and scrumptious food! Above and beyond doesn't even come close to describe","useful":0,"cool":0},"J2sm8FmUmT41c2yXJOIMnw":{"text":"This will be my first review in yelp ever. I'm usually not a picky person and always under","useful":0,"cool":0},"YQcKsTVMhsg2moSwRU_ifQ":{"text":"Tourist alert!!\n\nFirst of all, service was amazing!!~\nNo wait, clean, and a fun environmen","useful":0,"cool":0},"TpZJokcad_caL9ebU8kPIw":{"text":"My wife and I have eaten here for the second time in as many days and the food here is ama","useful":0,"cool":0},"xmklbjfSEVx1Y1KkBIEL1Q":{"text":"Lucky was a great and friendly bartender. This the one restaurants that we went into that ","useful":0,"cool":0},"sckNPP99fyq_xcY4amfSjA":{"text":"Ask for upstairs seating! If seated near the door in the evening, expect to have a louder ","useful":0,"cool":0},"s-sapLxghhyqdJQQgP6xnQ":{"text":"My family of four stopped here for lunch yesterday and Chelsea L was our server.  She gave","useful":0,"cool":0},"lXlopt6rXDXTxT5bArBKrg":{"text":"We were seated promptly without a wait during rush. We were lucky to have received a balco","useful":0,"cool":0},"RgrZWha3HPGO_2IGm3q9nQ":{"text":"My 1st time in New Orleans I could not find one place that had good food. My 2nd time Me &","useful":0,"cool":0},"-s98xw6g5eBBl5I6A_pDFQ":{"text":"mud bugs were fantastic. great spice. just the right amount of sides. reds. garlic. boudan","useful":0,"cool":0},"FXONEq0gaVj0MSOIDashKg":{"text":"This place was great! Everything was delicious and their portions are huge!  I was curious","useful":1,"cool":2},"93B71oaU5Gg2_0a1CslI_Q":{"text":"We ate on the Balcony.  Great photo ops. Food was perfect. I went for the Crayfish boil an","useful":0,"cool":0},"uDaRtCpzbCyL12j56oHipQ":{"text":"The oysters were so fresh. We tried them raw, grilled and the best were 424. Amazing! Orla","useful":0,"cool":0},"TaQknCc3Nm-TZeM3t8gqwQ":{"text":"Jae was so amazing!!\nChef Donovan cooked up delicious meals!!\nWould definitely recommend","useful":0,"cool":0},"TVgKw9FDBKEGxzqkPCzR_w":{"text":"Within 3 hours of getting into NOLA, found our new favorite place.  Frank, the server was ","useful":1,"cool":0},"xqjkNgSusyNvGQhDgRU0mw":{"text":"This restaurant is right on Bourbon Street. The whole wings were huge for about $10 grille","useful":0,"cool":1},"Ro71S4YU6zue90UUNGtaxQ":{"text":"Food was delicious and full of flavor! I had the chicken and sausage gumbo (it wasn't hot,","useful":0,"cool":0},"pq0NHoK6YpnBmGaCXdJdNA":{"text":"Not that great at all! The food was horrible, even the couple at the next table didn't eat","useful":1,"cool":0},"o6eh_pQEbhvxMrHyHvVIeg":{"text":"I'll give it 4 stars because my wife and I were able to get in to eat and food was good.  ","useful":0,"cool":0},"eVea9e2bU8PSfHU04SX2Qw":{"text":"Good food, good atmosphere, friendly staff. We ordered wings, crab cake and shrimp afredo ","useful":0,"cool":0},"GUttxfQhFYbov-jrteWxYw":{"text":"Raquel was absolutely amazing!! Try the Nola Bites. WOW!!! Service is excellent. Manager w","useful":0,"cool":0},"DNmH4sh4qmkiKs8DATv1JQ":{"text":"Bad service. Waited over an hour for our food. And I did t order anything special. Just a ","useful":0,"cool":0},"ziTXVAAoPFuX8nBbu-Pmrw":{"text":"Best service! The food was amazing! The crawfish , crab cakes, crab fingers OMG every thin","useful":0,"cool":0},"VNHlChLisncK77niMHdVAA":{"text":"Drink a Voodoo Doll to get the party started on Bourbon Street! Consistently good over the","useful":0,"cool":0},"TuFdSJ1pTkS9_ifviaBdLg":{"text":"These employees are great. My clutch fell out of my backpack, and I thought lost. When I d","useful":0,"cool":0},"F1aB5uMgTnzciWxwNu9AVQ":{"text":"We haven't eaten here but we were doing a progressive dinner and stopped in here for deser","useful":0,"cool":0},"6pvcC_gQhkMYGseHrgI0UA":{"text":"This spot was homey, very friendly and a wonderful atmosphere.  We met some great new frie","useful":0,"cool":0},"YeqU7XbSDC9iZlw3k3tI2g":{"text":"Came here because we had no idea where to go to eat...we were exhausted and sick of lookin","useful":0,"cool":0},"zDIR0nw4BaFN74QmosWGtw":{"text":"This was a great place to place to eat! The staff was also great . We got to sit on the ba","useful":0,"cool":0},"DcbMxvgoW9KvXTzFRQtuIA":{"text":"Would not recommend. Not the greatest. Food was mediocre at best. Whole place was pretty d","useful":0,"cool":0},"bp8D0ZpLzNaSsgF9jMYmJg":{"text":"Fair at best.  Was told shrimp Creole was spicy.  I asked to make sure it was very spicy. ","useful":0,"cool":0},"FCPDanK5KX-1xojaJ37dww":{"text":"Wait wasn't too bad on a Saturday night at least I thought. Hostess had no clue how to sit","useful":0,"cool":0},"Q9pf--UifnlLQwf40AZ3Cg":{"text":"The prices for this place aren't worth it. Our food came out cold/lukewarm and the service","useful":0,"cool":0},"lOCmOFM5O_K7bSF2p3VsxA":{"text":"The food was great and the service (Julie) was perfect!  She was attentive and helpful wit","useful":0,"cool":0},"KqLgbc8H-wUzaKJR6QUSGQ":{"text":"Just had dinner here tonight and it was amazing. We came upon this place as we were lookin","useful":0,"cool":0},"BkQeoftr8f9Ur-nyllvYFw":{"text":"Poor service! Most of the employees are sitting down & talking. Been here for over 30min. ","useful":0,"cool":0},"yww0sUeDRheXegpZ_cjx3A":{"text":"I had the red beans & rice with andouille sausage and wow - it was AMAZING.  I've only had","useful":1,"cool":0},"ZckvNxbZe1nrN4fJxsImeg":{"text":"We were greeted outside and told that the hostess was happy to answer any questions we mig","useful":0,"cool":0},"TCIm8eTL8m3WHQ3h0_8_5g":{"text":"Absolutely delicious!! We were seated from the Bourbon street noise. Surprisingly you can ","useful":0,"cool":0},"Ij3GjX19Obtlj44ALbH1sg":{"text":"Guy at entrance was rude, wait time was forever, food was expensive and undercooked. If it","useful":0,"cool":0},"HDp9PX_q9NV1FPOB2cWI1w":{"text":"It took FOREVER to get service here.  Crab cakes looked good but lacked flavor.  Luckily w","useful":1,"cool":0},"tANoHUAs5G7Vy20JY9MC_Q":{"text":"To be honest I wanted to like this place because it's one of the few places we've found in","useful":0,"cool":0},"WyexUnbbBQOnvdJdy516RQ":{"text":"WORST SERVICE EVER!!!!!!  Waited 15 mins and then finally flagged a server to ask where ou","useful":2,"cool":0},"2s19_wH1J04RO-IGiSYcAg":{"text":"Not bad not good. It was fine. Nothing special. The staff was great and the place was clea","useful":0,"cool":0},"lOJ39D-4UyiE5Co76wGJCw":{"text":"Service was great, the food was even better. We arrived and were greeted sweetly by our se","useful":0,"cool":0},"Y5Ss1SOP9d7T--kGngMOJA":{"text":"To be honest I wanted to like this place because it's one of the few places we've found in","useful":0,"cool":0},"pr47PeqM4dueay9tjLrVlw":{"text":"Food ok, service horrible. Ordered and appetizer and two entrees. Asked about where our ap","useful":1,"cool":0},"4RT9P9NtYQRTxpbCurGVlQ":{"text":"The food is excellent! \nCrawfish, friedalligator and sautéed crab is delicious. I highly r","useful":0,"cool":0},"Vk6Cl1oV2Aw6wXWUIzgM9g":{"text":"Had some great fried alligator.  The raw oysters were really fresh.  Lively atmosphere","useful":0,"cool":0},"zStLGTcmS1rhtNpH-tgCPg":{"text":"Was there for a bit during Mardi Gras... was looking for a place to have good seafood. The","useful":1,"cool":0},"4jsyHC2iF8ri0W3ITQuuCQ":{"text":"The food was great had the 1 lb. of grilled shrimp and my boyfriend had the angus poorboy.","useful":0,"cool":0},"4oVlCNTtHasvP61J03N5LQ":{"text":"My girlfriends and I were in from California for a bachelorette weekend. We asked a local ","useful":0,"cool":0},"IkuDmF-pE_Sg_7jlSEUyLA":{"text":"Great food and great service. Daniel was amazing and very helpful. Husband got the trio an","useful":0,"cool":0},"dyC_OAr6nU9d9Hi8jfRZOA":{"text":"DELICIOUS food and wonderful atmosphere. Our server, Cassandra, couldn't have been nicer. ","useful":0,"cool":0},"UPERPPxigBh5sMCI8pjxpw":{"text":"Hidden gem on Bourbon st. Great sea food and drinks. Service was awesome, Brandus, Her per","useful":0,"cool":1},"FNbvOE1Oi_dVTnqa3q4MVw":{"text":"Food was yummy and service from Jamyra was excellent. Crab cakes were thick and full of go","useful":0,"cool":0},"ehV0zbMPITEa_Daz38LLsw":{"text":"First lunch we had while in New Orleans. The Hostess was very pleasant and gave us that go","useful":1,"cool":0},"L1xlGH5Mm_IaRimFp5-jNw":{"text":"Our experience at Pier 424 was amazing! Our waitress was Claudia and she was both hilariou","useful":0,"cool":0},"avSnkFwknxiTOoC1blSC6A":{"text":"Just ok.  We went there specifically for the crawfish boil only to find out after we had o","useful":0,"cool":0},"0tYmT3lPf0BTmcCgZEoAUQ":{"text":"Good food and great service, however not my favorite sea food spot in new orleans. Their c","useful":0,"cool":0},"uu9SwMiECLUhYpQ3ovIX-A":{"text":"For a 1st time in NOLA and in need of a little bit of a taste of everything, then the trio","useful":1,"cool":0},"msa4tAer1WIpio_h6fFZiw":{"text":"Had a great Time at the bar. Taylor was an amazing bartender and was some of the best serv","useful":0,"cool":0},"1__6IUoL2FiQCeQ1HOJ-gg":{"text":"This place is awesome. Very friendly managers. I met Lynn, Dusty and Donald. Made our visi","useful":0,"cool":0},"9QCLO03pX1qRi8lf_LbIag":{"text":"We stopped in here for a late lunch early dinner. The place has a great location right in ","useful":0,"cool":0},"i62cRC6VP98VwIzS-IlH3Q":{"text":"We went here while on vacation. The shrimp/crab boils were bland and somewhat flavorless. ","useful":0,"cool":0},"KeZUVD4GxsWxhefNbdOAMw":{"text":"This place came through. \nIndia, the hostess was a phenomenal host and accommodator. \nShe ","useful":1,"cool":1},"MY5xCKTIH5xz4DD9oclaXA":{"text":"It's vacation, and you've done your homework. You have plans to hit up that hidden gem wit","useful":1,"cool":1},"sUSaoOeNjcXPbojoK1ORSQ":{"text":"Stumbling upon this place while walking down Bourbon St was such a delight!  The restauran","useful":0,"cool":0},"EKNrpy3YNvUz9w3ChYP1vQ":{"text":"Came in here for lunch on a cold, windy Friday in March 2021.  The services was remarkable","useful":0,"cool":0},"_0vf_m3720kWwss8fEmc6Q":{"text":"Let's see where do I start, extremely slow service, small skimpy portions, literally had t","useful":0,"cool":0},"_x-ebHJJnpN8jnvxNNR7lA":{"text":"Outstanding service. Ask for Dannyl for great drinks. For mix drinks ask for double shot. ","useful":0,"cool":0},"z-5bQcSffb6TKENC1T5rMQ":{"text":"Joshua was the BEST!!!! Loved him & the food so much!!!! Had the taste of New Orleans and ","useful":0,"cool":0},"R66VOPD8ctfVXyvkDPUnlA":{"text":"Came here late, just to get oysters.  Raw oysters in a half shell were superb and tasty, i","useful":1,"cool":1},"2rqoDj16aBrLPYmF0ET3fA":{"text":"1. Our waiter took forever to come to our table of 9 to greet us. We had to ask another se","useful":0,"cool":0},"FWk8nHFF17jXg-Vks2VtXw":{"text":"Get the Shrimp and Maque Choux Grits and a dozen or two of the charbroiled oysters. It's b","useful":0,"cool":0},"YKdvQ41kkpyASQaXumA0XA":{"text":"Came here by myself Monday ngt b/c I was in the area and needed a place to watch the game ","useful":8,"cool":3},"ZIEvARsRYPUrCpzHrKealg":{"text":"This place is great! Cory the bar tender was friendly and fun to talk with. Bloody Mary's ","useful":0,"cool":0},"QYetxcekcEjq_2PX9jeA-A":{"text":"Trash. The worst food i had on my visit.  Crab legs over cooked, charbroiled oysters were ","useful":0,"cool":0},"-Wc1P0agNY0r-Ko6zfQxww":{"text":"We randomly stopped in here to put food on our stomachs before we began bar-hopping on Bou","useful":0,"cool":0},"qBY5z7hp0WtUS6oMwdu_lg":{"text":"On a quiet (relative for Bourbon Street) Thursday afternoon we sat on the balcony for a sn","useful":0,"cool":0},"WrQ0Q2yx2Ax4N8Mux6fvtw":{"text":"Firstly, the line was soooo long, when I got the front I noticed that most of the tables w","useful":0,"cool":0},"QYK7H_NkD7hkWReTLP3PUg":{"text":"Wow! Service and food were both amazing! Our waiter, Danny was fantastic as well. Can't wa","useful":0,"cool":0},"8bNcrW3r2QEhiLE8zu1pZA":{"text":"This is the second time I have eaten here. The first was 5 years ago. I thought to give it","useful":0,"cool":0},"pXIT4GKQMr_K2m_CKWDfzA":{"text":"Absolutely disgusting. Literal mud n the oysters: 3-4 crawfish tails in the soupy, bland é","useful":0,"cool":0},"DzyKerv2Q11z638Oh_bsbg":{"text":"Hands down the best meal I es eaten here. Battered chicken w/ red beans and rice was out o","useful":0,"cool":0},"wKF0t6UwityKOqjbs6mL4A":{"text":"Corbin was the best server we've ever had! He was very enthusiastic, and was super helpful","useful":1,"cool":1},"mXbvvJ9JtX91Tvb-am_yYQ":{"text":"I CANNOT believe I tried alligator!! I am the most picky eater there is and I TRIED ALLIGA","useful":1,"cool":0},"bU7X_1Edqo4mZEI8D5dwEg":{"text":"This place is amazing. The food was delicious and the staff was GREAT!!! We had Cassandra ","useful":0,"cool":0},"eSVWdx8MDNYfbycN9Dm-hg":{"text":"It's alright. Had to wait for a pretty long time to get served. They seemed understaffed b","useful":0,"cool":0},"FsJK_JXMLrWuEQwpXSCTPA":{"text":"If you happen to be in the area, this place is a stop on ever trip of mine.  We have taken","useful":1,"cool":0},"d2AdRxUHh1P7CYe92QIMqw":{"text":"I am currently at Pier 424 and was so angered by the service that I felt the need to write","useful":0,"cool":0},"Y1XQvXwTDU16gpwvvPpbQA":{"text":"FOOD=BOMB \nSERVICE=AMAZING \nVIBE=KILLA \nThank you chef Donald for giving me the best first","useful":0,"cool":0},"ABOGgs5-IQ8MspNs8yjJwA":{"text":"This restaurant is extremely expensive for small servings. They do not serve frog legs.  D","useful":0,"cool":0},"so5roNWLzOEWgLdvz4IFwA":{"text":"I really good food and great service. Frank was our waiter and was worth 6 stars. He gave ","useful":0,"cool":0},"e8LQxq7B_87th4sKSLMteQ":{"text":"The staff is super friendly and made our experience awesome! Ask for Chef Donald or Dusti ","useful":0,"cool":0},"cBHevLTy3beZxlj0duJQ8w":{"text":"TL; DR: ORDER THE CRAB CLAWS!!! The sauce is heavenly and my BF and I were joking with the","useful":2,"cool":1},"nW4g5LcIC6UbPqqk-G1Crw":{"text":"Sat at the bar with Danny C on March 14, 2021. He killed it with the drinks, recommendatio","useful":0,"cool":0},"4zKeucUh_WgxOfIqeKFicA":{"text":"Danny was absolutely incredible. We traveled from Los Angeles and it was our first time in","useful":0,"cool":0},"np-K7tII8DInSz22HA_fxA":{"text":"service was fabulous once we were at our table...bartender was not communicative and hoste","useful":0,"cool":0},"uFo96qZKbneatXkVFuLHkw":{"text":"One of the best spot we ate while being in Nola. My husband and I found this place a day b","useful":0,"cool":0},"VeR6D4Qy7LcllhPbZFAVzg":{"text":"Food was great! The boil potatoes and corn were spicy !!!!!! They even made crab legs spec","useful":0,"cool":0},"Vq8kd8UQWOLol3LcEwWEPw":{"text":"The food was good but maybe not worth the amount of time you needed to wait to get it. Fri","useful":0,"cool":0},"xTVwmQSr58Acu7KdMt_R4w":{"text":"We are locals doing a stay-cation to celebrate our wedding anniversary. We chose Pier  424","useful":1,"cool":0},"35oFRvIX-jUtBnxrL7Fntg":{"text":"Found a hair in my bread.,\nNo flavor in food ... the only thing that was good... beans and","useful":0,"cool":0},"CnQH0YjRrinzOv75QFE1qQ":{"text":"We have been to New Orleans many times and we generally eat our way through our vacation. ","useful":0,"cool":0},"V9nBcxfGeCGggomrkgGj-g":{"text":"Food was very good! Boiled seafood wasn't as spicy as was hoped for. Our server (Charles) ","useful":0,"cool":0},"MsGckfPt9l9EYVqVOOD20w":{"text":"Gross. Food was EW. Service TERRIBLE! And I walked into the kitchen.... STAY AWAY!!! So ma","useful":0,"cool":0},"uYvDdxEt9kfKAW6T-0r6aQ":{"text":"Unfortunately, our first time in NOLA and we decided to get our first food experience in t","useful":0,"cool":0},"Qorn6HWVdvxpuof14clVqA":{"text":"The food wasn't that good. Customer service bad. It toke them one hour to cook my food!!! ","useful":0,"cool":0},"kFPxKh96mi2jFBsgaawuXw":{"text":"I'm so glad my daughter selected this place for us to have a beautiful Sunday Funday. We s","useful":0,"cool":0},"z9XmYZ7R49rVGPZJsGR2vw":{"text":"Best food we've had so far but even better service. DANNY C was our bartender/waiter and h","useful":0,"cool":0},"m8CKjuyzcEyhcGSxeW0D9w":{"text":"Danny C! \nThank you babe! You made me feel like I was back home in Portland. Thank you for","useful":0,"cool":0},"0kFRmK3oIxGN7h8EVt8O_w":{"text":"I love shrimp, especially when they're breaded and piled high on a big piece of fresh Fren","useful":24,"cool":13},"IqzXGLYDDyeLTrx2fCKSkA":{"text":"Laissez les bon temps rouler!\n\nIn the mist of Mardi Gras madness on Bourbon Street my fami","useful":4,"cool":4},"DVphPJ_fhaZfahUsd9wkag":{"text":"Was told by a friend (who I no longer trust) that this was the best gumbo in New Orleans. ","useful":2,"cool":0},"GsQMYddpWyRquU_dJntKgA":{"text":"This is the best restaurant in New Orleans Louisiana. Upon landing in New Orleans from Atl","useful":0,"cool":0},"UigS6vDrhO-kuQc-rlSlDA":{"text":"Great location...(duh, it's on Boubon Street). The staff were pleasant.  I sat at the bar;","useful":2,"cool":0},"rkBW-lV-49BTLchlLhkUgg":{"text":"This was a pretty meh experience. It started off with sitting at the bar waiting for a tab","useful":1,"cool":0},"oLNtmYsPknYZizWz5x5WbQ":{"text":"Eat at your own risk! Before I even ordered drinks we encountered a big rat running throug","useful":13,"cool":6},"mh8EaGaofyBMpD_3WbohJQ":{"text":"I came here 1 night Feb during Mardi Gras with my wife and had a pretty good meal and serv","useful":0,"cool":1},"lyoF6nF4OqQheug41wM1_Q":{"text":"I had high hopes for pier 424 based on their menu. Unfortunately we made a terrible choice","useful":0,"cool":0},"ivh1KZPk6xGQhD69eXpMPg":{"text":"Went here on 9/10/21. While eating our appetizers I witnessed a HUGE rat run through the r","useful":0,"cool":0},"hcPGwGqMrKgbMUpd9rbCPQ":{"text":"We just happened upon this place and we are glad we did! The hostess was so sweet and acco","useful":0,"cool":0},"K5SkJAafFylWnbW5rZSYGg":{"text":"Great lunch today.  Tried the taste of New Orleans.  Enjoyed each dish.  Finished with the","useful":0,"cool":0},"Vk3zskp3noeVe1Up6jfVzw":{"text":"We were looking for a place with boiled shrimp and decided to try Pier 424. We sat at the ","useful":0,"cool":0},"M4TKwFW1bxGfbh3B60dSQA":{"text":"Fantastic food here. They were open during the pandemic and short handed but still managed","useful":0,"cool":0},"0Fhu49CCqGuJJ1QiX8XHYw":{"text":"This place is a massive joke.\n\nYou have so many choices of restaurants in NOLA DO NOT COME","useful":0,"cool":0},"-DH-3R8ZGBbEXX8h-lXu9Q":{"text":"Katrel was the bomb! Best server. He made the entire trip to pier 424 more than dining. It","useful":1,"cool":0},"-Bh3vloTAQRuGR9_Fzp7DQ":{"text":"The staff was friendly and did what they could. Like everywhere, they were very short staf","useful":0,"cool":0},"O2W9J9Iy9g5jv7eCyLFNDw":{"text":"I will go back for the shrimp every time. Drinks were a little disappointing as well as th","useful":1,"cool":1},"vNPPlFw7HAe8ghywsVbZ4A":{"text":"The food was sooo great! The blackened red fish is out of this world. Noelle was very swee","useful":0,"cool":0},"4dsUZCA5Sbwby3osgWQcWQ":{"text":"Haven't even set foot in the door yet, but I'm already upset at this place. I called earli","useful":2,"cool":1},"flqLjwCe5WBs89fRqv8UQQ":{"text":"This is basically what you would expect. Classic food, not too pretentious.\nThe \"Taste of ","useful":0,"cool":0},"r379wtm2n7nVGctDFI3szQ":{"text":"The service was great with Danny. The order was all correct and brought out exactly how I ","useful":0,"cool":0},"CvX57QWp3efIfyajOqMJzw":{"text":"The food here is pretty mediocre. Not bad, but absolutely not memorable in any way. I had ","useful":0,"cool":0},"IeYdlyw841750Sef481xUg":{"text":"Ok so I came here Monday night 1/25/21 after drinking and partying across the street at th","useful":0,"cool":1},"8a40tb4CuIeWneQnOv7jgg":{"text":"Super great service and food! Waiter was so friendly and helpful. The food was way better ","useful":0,"cool":0},"Se79jz2wxWOymCoGUsOuhg":{"text":"My wife and I visited this establishment this evening and was surprisingly disappointed. \n","useful":1,"cool":0},"SmH4o6PVodKxOir6LIJ9Kw":{"text":"Great po' boys! Service was very nice and the atmosphere is beautiful!","useful":0,"cool":0},"B9YD-hCMTRFfXLLyIdEADA":{"text":"This was our first stop for food in New Orleans. I think it warranted 3.5 stars, but I'll ","useful":1,"cool":2},"f-_pAG0FzCVuXKWg24dxmw":{"text":"Food was decent but service here is terrible. Hostess tell you there's a 20 min wait but w","useful":0,"cool":0},"iyKFV8VuPiCqvlVIKnLAwg":{"text":"I was craving a burger and didn't want to walk far they enticed us in and me being hungry,","useful":0,"cool":0},"VcrEmE5rv6JaA8Q-E8k0Bg":{"text":"We stopped in, after selecting the restaurant off the street. We were greater by the chef ","useful":0,"cool":0},"pssxQ4ttkCp669KoeIaPrw":{"text":"Enjoyed the oysters on bourbon. The shuckers were very entertaining.  A go to place whenev","useful":2,"cool":1},"axLAIWJ2uQ6i6cExzhVG3g":{"text":"My husband and I popped into this restaurant after checking out the menu at the door. We o","useful":1,"cool":0},"JaxdBUhUKcdkwzdj-qLUpA":{"text":"Second time here (remembered from our previous trip). The waitress was great and we had ou","useful":0,"cool":0},"OhrDj4qPtwG-nvENQTnQPg":{"text":"The food was okay but nothing spectacular. The waitress kept running back and forth to the","useful":0,"cool":0},"zg3wqaldYPYrxSR94zRwqg":{"text":"Got FOOD POISONING from here last Tuesday. First and only place I ate upon arriving in New","useful":0,"cool":0},"GsbUBylY5TmFD_atEe8u7A":{"text":"Right on Bourbon street this place wasnt too busy and we were hungry so we took a chance. ","useful":0,"cool":0},"A-pixg4vZX11R-8tCY22Nw":{"text":"First time I've been to NOLA and I was looking to get some authentic New Orleans food. Our","useful":1,"cool":0},"4YR8STWARi0-TzeI9nJzmQ":{"text":"This was my first time to New Orleans and Bourbon st.  We walked a bit to see what we want","useful":1,"cool":2},"uORALNfY00GXbk6Bs6-UUQ":{"text":"The food was tasteless. Well what I got was. I ordered the Creole Pasta. It was pretty to ","useful":0,"cool":0},"dR66ylnMkIQCkKqYRkIWGg":{"text":"My son got married this weekend and after the ceremony, we stopped in at Pier 424.  Great ","useful":0,"cool":0},"u5nt9QzLU-nQwwY98VZBag":{"text":"Stopped in for my birthday dinner & absolutely loved it! Had the Red Beans & Rice, the Gum","useful":0,"cool":0},"-ncyP3TXuIkpvJb-0Cz3Aw":{"text":"First meal at new orleans and it was disappointing. I kinda knew what to expect based off ","useful":0,"cool":0},"jMiyIZn-gONOPddmU70Ilw":{"text":"Stopped by in the early afternoon for a quick snack. We got one order of boiled crawfish. ","useful":0,"cool":0},"XOcJKAqkWt6KoVUlPAi0bQ":{"text":"The wait took a while but you have to understand that the restaurant is doing its best to ","useful":0,"cool":0},"RA9DtiAZpBsxe650L2JppA":{"text":"Like many others, it was our first time in NOLA and we stumbled upon Pier 424.  We didn't ","useful":0,"cool":0},"7pZEDhKJNbMUvqnlcL_dUw":{"text":"Finally one of the better meals we've had in New Orleans! A busy place as it's located in ","useful":0,"cool":0},"SWFRBKOsD5U7ZYnVbcqM0w":{"text":"Great service, the alligator appetizer was extremely tasty. The server was friendly and of","useful":0,"cool":0},"5Sdk3duQ79FFl9FYbwY5BQ":{"text":"12/22/17 Just wanted to say that I thought the business' comment below was very well worde","useful":54,"cool":40},"huHFAQASni-CRPWizMc-iw":{"text":"The service was good, everyone was super friendly. We sat at the oyster bar and were serve","useful":0,"cool":1},"RFd78WhLPNH6GBVLMshOvw":{"text":"Stopped by for some take away and left disappointed. My po boy took over 30 minutes to be ","useful":0,"cool":0},"o2NABKneRYc75PmY7r63NQ":{"text":"Ordered 2 dozen char broiled oysters through DoorDash and they did arrive hot but the oyst","useful":0,"cool":0},"lXtFEd9DDq-Ie0Y_lAnoqw":{"text":"Great food, great drinks, awesome service.  Make sure to ask for Jamie cause she freking a","useful":0,"cool":0},"x553VLR10k7KOTL7nIMUbA":{"text":"Over amazing restaurant friendly staff and great manager !! I would stay away from the cre","useful":0,"cool":1},"K2YU-FNnO3i9nGV8uP8DPQ":{"text":"The food was ok the crab cakes taste pre prepared days in advanced my 23 dollar stuffed sh","useful":0,"cool":0},"fuNyMp9Uy8Cmbh8X29UdZw":{"text":"Handled our party of 12 cheerfully. Accommodated our vegan. Accommodated our little ones. ","useful":1,"cool":1},"t4fQlR_rg_Q8V3M1CCIb5g":{"text":"This is my favorite spot to eat! We went twice in one weekend. I really enjoyed the oyster","useful":0,"cool":0},"YC-Cw869p9-0aE5V0k5YMw":{"text":"In the seven days I spent in New Orleans I had my best meal at Pier 424. It was the Shrimp","useful":0,"cool":0},"O5EKIm3UbyT-r7d9z54p7g":{"text":"We have been in NOLA for for the past couple days and this restaurant had THE BEST food & ","useful":1,"cool":1},"1F9C52Rhjina7gvRxpoaQw":{"text":"Came to pier 425 for crawfish, frog legs, and oysters. Our server Danny was awesome and br","useful":0,"cool":0},"0Vsc1uFFX8FpQQt-Nx9cGA":{"text":"I got the trio and well the food itself was good the price is way too high for the quantit","useful":0,"cool":0},"6aqpEoQymBrgwmPMACqMAw":{"text":"Located right on Bourbon street and closes at midnight. Decent option when you're looking ","useful":2,"cool":0},"OnvCQ0m0KiANZbspmDUOag":{"text":"We walked around the Quarter for a long while trying to decide where to eat. This place lo","useful":0,"cool":0},"X08J-6vrxi1ZQ4Ivv1mXnw":{"text":"This place looked nice but it was terrible. Our server was friendly but she forgot my husb","useful":3,"cool":1},"Fo9OV7YxgjwhEpVnflSfMA":{"text":"We ordered charbroiled oysters , fried alligator and creole pasta. The fried alligator was","useful":0,"cool":0},"zzlbQ9ZztP4cZy0iiBYS_Q":{"text":"I have to say... my first time here in the big easy... and first eats here was not impress","useful":1,"cool":1},"1kEZo3M2NZgwZFPulmIsmQ":{"text":"I will fly from California any day for great food and service Thanks Danny for all the hel","useful":0,"cool":0},"QoVmsc94DhWtDLH_EZL4Pg":{"text":"Wow just wow.  Food was tremendous, staff great and my vision of a restaurant in the Frenc","useful":0,"cool":0},"QXIxFiAmuY5ZFcmnweqoVw":{"text":"20 nickel sized shrimp 4 lousy hush puppies and a bunch of fries and onion rings for $22. ","useful":0,"cool":0},"z7ZGbr6EaBDTAdZZju8usg":{"text":"If I could leave Zero stars I would. My boyfriend and I wanted to try a new place to eat a","useful":0,"cool":0},"UD5ykjlLEi5lY1Zu_a7DFw":{"text":"This one star rating is low because our one and only experience here was beyond awful. As ","useful":0,"cool":0},"5jEMeGjQ737L6jgnwl6HfA":{"text":"Danny C!!! He was our attendant and he was on point with everything. We were a party of 8 ","useful":0,"cool":0},"Hmhs_zsqb8BtP0bOIRAI7g":{"text":"My friends and I stopped in here when we need a quick bite for lunch when we were wanderin","useful":4,"cool":3},"BiV2SF2fr88wBocHfznpfg":{"text":"Didn't wait long at all. Ambience is nice as we sat by the window. I had the Alfredo with ","useful":0,"cool":0},"gzPoYp2lST-LFUek-_Ad9Q":{"text":"Tried this place for the first time last night on a trip to New Orleans - they have very g","useful":0,"cool":0},"yOAPStbZWEyKau29e1jbgQ":{"text":"All the food was excellent. Our server was bad ass! But she was definitely working a huge ","useful":0,"cool":0},"i4HGAaagSBfeErG0VGMwLw":{"text":"Came here for some seafood after walking on bourbon street. I was inebriated and extremely","useful":0,"cool":0},"xDi-uMsEB56tg8BJFP51Eg":{"text":"Margaret was our waitress and she was so lovely! This meal was seasoned to perfection! Hig","useful":0,"cool":0},"VoDJJXOXu_Ib97AR2ibniQ":{"text":"When we arrived they said it would be a 30 min wait to be seated not sure why but a lot of","useful":0,"cool":0},"OZoQeBNAkpo_qPJsieBV1A":{"text":"I got the crab cakes and basically just ate breading because that's all that it was. Very ","useful":0,"cool":0},"ozsAtwI0aq-EXAX6hgS1fA":{"text":"Just stand in line for 45 mins. Simce e the restaurant have no enough employee. The food w","useful":0,"cool":0},"A6hx6MExcEW3bT-giBW-MA":{"text":"Ordered the Crawfish and oysters. Our server Ashley is amazing. Definitely ask her for rec","useful":0,"cool":0},"xSkRlDCLS8r6UOZdeC1bqA":{"text":"Came here with my friend so that she could purchase Crawfish before our flight. They weren","useful":0,"cool":0},"6nIgzDF2RA0enBGQXDVorw":{"text":"Unfortunately the food here is always gr8. OMG alligator bites are on point, just what I n","useful":0,"cool":0},"T1nUrN_9SNwahD_2lFifAQ":{"text":"The best Keylime pie I've had in the city literally because I haven't had any other ones. ","useful":0,"cool":0},"0KLOcpDjsBIrsYeaqBkC6Q":{"text":"Above and Beyond!! This was my first time to NOLA and I was looking forward to sampling th","useful":0,"cool":0},"4s-GbnqI-5xjOUYgtDYXNw":{"text":"The food and staff was amazing would recommend this restaurant to everyone. The oysters ar","useful":1,"cool":1},"9w3vYaMO3mDpyx1JXhJL2w":{"text":"Dont even know where to start with this horrible experience. We didn't mind waiting for mo","useful":0,"cool":0},"41YYwv_p75rDPWgz15PMZQ":{"text":"The Taste of New Orleans dinner platter is a great way to experience a little bit of every","useful":0,"cool":0},"H5uQ7Mtq2UJonmPEXELTuA":{"text":"This place is wonderful great food great drinks definitely try the crab cakes And the oyst","useful":0,"cool":0},"K8N42D0edXS0V-4ruPoNbQ":{"text":"Everything was sooo good. Whenever I come back to the Big Easy ill eat here again....custo","useful":0,"cool":0},"3yA9bLstrsMUd95Weeru8w":{"text":"Waiter could have been more helpful at the end of dinner but FOOD WAS DELICIOUS! Thank you","useful":0,"cool":0},"iv274F3Sxg0jgE9BR6tt8A":{"text":"Well let my first say it was our first meal in the city and I'm not impressed at all the k","useful":0,"cool":0},"_ItXlG15Arq2c195z76e1w":{"text":"Had dinner here our 1st night in town...Delish!  We ordered the Fried Shrimp Po Boy and Re","useful":0,"cool":0},"AhB6ihZ7QEi255_qQy73pA":{"text":"Excellent service and fresh food, see Danny if you're looking for great, professional serv","useful":0,"cool":0},"36m5W7TyMx9Byi0YXYQ1tQ":{"text":"The food was mediocre. I had the pasta & the chicken was pretty bad.\nThe service was nice ","useful":1,"cool":0},"iRxdMzO_4SiEp0KR5RZhKg":{"text":"Sorry I have to give a bad review.  Waiter made us feel rushed and just another table, oh ","useful":0,"cool":0},"W2yJaW5emV-i6zuhzVCX9w":{"text":"My food was sooooooooooo good and they make sure you are protected during the pandemic. It","useful":0,"cool":0},"okq8Y1voz8pi3j2qOmG1Og":{"text":"So not my favorite meal of new Orleans, but still a good spot for a last minute dinner cho","useful":0,"cool":0},"af_bJOOLQxR8qwX1JWvZKQ":{"text":"The best charbroiled oysters in NOLA! The red beans & rice with crispy chicken was also wo","useful":0,"cool":0},"zcYATMCsfFx9s4CX-qGqag":{"text":"This review is limited by the fact that (a) it was almost 2:00am and I was tired and hungr","useful":0,"cool":0},"3BlguHP_VflMNJ1cHxwh8g":{"text":"I visited this restaurant on July 4th. We had crab cakes for an appetizer and they were fu","useful":0,"cool":0},"tfWwRWfzIpBp8afMF6Wgvg":{"text":"Food was subpar to be honest, and that's being nice. The pasta sauce was thick and tastele","useful":0,"cool":0},"YshhnXQEQYkkNQnHIcw_GQ":{"text":"This spot was a late night decision . We were both starving and tipsy and this was one of ","useful":0,"cool":0},"fsbRTze0TJPx9MN61mcaOA":{"text":"Looking for a place to eat dinner late on a Wednesday night. The menu looked good. There w","useful":0,"cool":0},"RjSzkV9tmQcsnEXNntEN1w":{"text":"I literally love no food in the world better than the Snow Crab legs at Pier 424. I'm pret","useful":0,"cool":0},"FpkIrU4R2vLz4Gg09aqxGA":{"text":"DANNY was AMAZING!!! The sauce for the crab claws...BEYOND AMAZING!! WE ORDERED the calama","useful":0,"cool":0},"2Bf5p6GdqPAaLYFzMCVhQg":{"text":"It was amazing food and a great enviroment. And our waiter Danny went above and beyond to ","useful":0,"cool":0},"hbhoC87eL_acsXdM82iEeA":{"text":"Our fav seafood spot closed its FQ location. In an attempt to find a new place, we tried P","useful":0,"cool":0},"OlmRM3e_JCa7Q4MFJEYuAg":{"text":"Always enjoy going to Pier 424 when I'm in town.  The food is delicious! My favorites are ","useful":0,"cool":0},"y6iurf6qj6v4USr4CZ1H-A":{"text":"Nice location staff is friendly. My hurricane was A+ was able to get seated quickly. I was","useful":0,"cool":0},"zoB5TvjKFlng2LNnSmI_nA":{"text":"HORRIBLE!!! Do NOT eat here. You will get food poisoning! I went to this restaurant before","useful":0,"cool":0},"_ChsuHtVd_3jdNZIcBiBLQ":{"text":"It was about a hour wait for us. Plenty of open tables and the line wasn't too long. Mint ","useful":0,"cool":0},"8E5I9x6Ae_Csu3_6aVD0Dw":{"text":"Guess who's bizack?! Bae and I have (finally) returned to NOLA for a much-anticipated visi","useful":2,"cool":1},"a39LoM2qlBeK5OK8udADHQ":{"text":"I am a local and this restaurant is the only thing that brings me on Bourbon St. It's my f","useful":0,"cool":0},"ZmeL4vH00KSm_FohtP5ZqQ":{"text":"I was walking up and down Bourbon St. with my fiancé when we stumbled upon this lovely res","useful":0,"cool":0},"F1VdH7-15gKeVlgtOBGHlw":{"text":"After walking around bourbon street looking for a restaurant to have dinner in the didn't ","useful":0,"cool":0},"O2vsdxRPBxFztPQfJ-zQXg":{"text":"Grilled oysters, creole pasta and red beans and rice were winners!! I don't think you coul","useful":0,"cool":0},"sxoAJRdf2LyED59xsfkWKQ":{"text":"Our favorite was the crawfish lettuce wrap tonight. everything else we good here. If you a","useful":0,"cool":0},"KQJJ7g4HDBK9i0WgeX3TOg":{"text":"The family and I were in New Orleans for New Years and let me tell you, this place is awes","useful":0,"cool":0},"bXCEPgWLAbXpXUHhbetx_Q":{"text":"Cannot say enough great things about this place!!!! It's a great break from the craziness ","useful":0,"cool":0},"7MxwipgaXYZMnjHVGd6rvA":{"text":"Food was great, service was even greater (especially Julie) and the crab cakes were to die","useful":0,"cool":0},"xedA5IrGZVUZ8dYmYh2A7w":{"text":"Hi, \n\nI just want to say how wonderful the food tasted and the atmosphere was great!!  My ","useful":0,"cool":0},"u2NHTKwjcM88Fffqb2fHhQ":{"text":"Went there last night and had our first bad experience of our trip. The food and service w","useful":0,"cool":0},"hfidBtccVYPmpeyTdYTpNg":{"text":"I found Pier 424 on Yelp as I was cruising through the quarter looking for a place to dine","useful":2,"cool":2},"BZYftQWj806C08OiHXDgtw":{"text":"Found this place walking down the street. Doesn't look like much but the food was excellen","useful":0,"cool":0},"zAvpVlMBibJCq2qMc1ij6g":{"text":"We ducked into this quaint restaurant on a whim and it turned into the best food, drinks, ","useful":0,"cool":0},"DGmLysDFwjYkN1KtISLTOw":{"text":"The host is the worst I've ever had in my life will make you wait outside when the place h","useful":0,"cool":0},"CU8O5kNYpXMwXF2gkn41tg":{"text":"This restaurant is extremely expensive for small servings. They do not serve frog legs.  D","useful":0,"cool":0},"Z-v8eLF2F4IPhI7XS6fepA":{"text":"We wandered in. Used to live in NOLA, so usually I avoid restaurants in the Quarter but...","useful":0,"cool":0},"4By2ZqesURtjHQg-1HFgBw":{"text":"Pier 424, you rock! My wife and myself traveled all the way from MS to enjoy your oysters ","useful":0,"cool":0},"TS2PwN0QaTBBvMeoBc1IKw":{"text":"First of all, if you're coming for dinner be prepared to wait as this place is BUSY! The r","useful":0,"cool":0},"vi5jRafNWdnDY06kSmBotw":{"text":"Visited this spot while on Bourbon this weekend...the crab cakes were not good at all. How","useful":0,"cool":0},"FBI1LHr2A31eA8YpQDVkpA":{"text":"Even though New Orleans was dead due to COVID19, this restaurant had friendly staff and gr","useful":0,"cool":0},"tpr_3xsYVK0zrBgLBZjn-Q":{"text":"There really isn't much to say. On a positive note the service is really good. Hostess and","useful":1,"cool":1},"0XtMzMbYbI24UvUwcXrU9w":{"text":"We had high hopes looking at the menu out front and decided to try them out. We sat for ab","useful":1,"cool":0},"I8PVHa4mo1eQalaHLGrTaQ":{"text":"We waited for almost an hour to be seated in. The waiting line moves really slowly. Servic","useful":0,"cool":0},"3C2JUxadPGyDUvc92Sma2Q":{"text":"Do NOT get the margarita (\"strawberita\"). It is super sugary and not tasty. The food was o","useful":0,"cool":1},"2w6ZSLBZ4jgZucHVV1qylw":{"text":"Enjoyed ourselves here.  We sat near the street so it was fun just watching activity and p","useful":0,"cool":0},"hcKyFyfQb6lktXSaXzp93A":{"text":"Delicious food at a reasonable price! Very convenient as it is right on Bourbon st. Sam th","useful":0,"cool":0},"OZNfd8LAJAA5ZrqczniYbQ":{"text":"We were really disappointed in this restaurant. I understand that with everything happenin","useful":0,"cool":0},"G28UPfxezM2d8YBcT785rA":{"text":"The food is NOT good. Please don't eat here- it's a tourist trap. The shrimp was cooked te","useful":1,"cool":0},"2CEoBsB2JYe044_fSGfrRA":{"text":"This is a must visit location in New Orleans. There was a bit of a wait time but it was we","useful":0,"cool":0},"nG1-GajzqJ3PLJAMRSetvQ":{"text":"This was our first sit down meal in NOLA and it did not disappoint. We went on thanksgivin","useful":0,"cool":0},"zvE7djUXIBhu8nE0ZIU0oQ":{"text":"Please by pass this place  Its LOUSY they ran out of a whole lot of shiT the  waiters are ","useful":1,"cool":1},"xYQqRESNGzwUP_ciN5Rq-Q":{"text":"Food not very good and not worth the price. Oysters had lots of pieces of shell in them. S","useful":0,"cool":0},"7PWXxoKSEdrT7QKBQ2syBA":{"text":"One of the best spots on Bourbon!\n\nThis is our second time coming here. The charbroiled oy","useful":0,"cool":0},"Ba2uCBywq0129xT-u8unvQ":{"text":"Tourist  in nola\nI wait 20 minutes to be seated \nThen 15 minutes more to my food arrive\nI ","useful":0,"cool":0},"qGzgQOqJJv1PkBitW8JDmw":{"text":"I was not very impressed with this restaurant. The bathrooms were not clean at all. I orde","useful":1,"cool":0},"H6RHDNzvahX1-IoyGq_fiQ":{"text":"The food was Great, but I won't be back. We were seated within 5 minutes of walking up. Re","useful":1,"cool":1},"8Tgxd4VmsiEp0WsZ3f5bHg":{"text":"Only 2 servers working, which is understandable in the current market. Ordered the crawfis","useful":0,"cool":0},"K66ETnCmnWtfV_tbMxFHSw":{"text":"Middle of the road evacuate we have had better crawfish in north Texas. They were overcook","useful":0,"cool":0},"1nbg1Nof_IMXRfjxwOcnhQ":{"text":"Our first time in New Orleans! Great food & great service. We will definitely be coming ba","useful":0,"cool":0},"ZnjM9BKS0nl-0LV6UFlCTg":{"text":"I was hesitant to visit here because of the reviews, but I always believe in making decisi","useful":0,"cool":0},"9cp0n2ipO4X2Qp2NukHK9w":{"text":"This place was pretty cool. We came here in Christmas Day and even though there was a wait","useful":1,"cool":1},"plx499TMrgXNMvAVnha4_A":{"text":"Came here late last week Saturday during my friends and I's NOLA trip. I came here for dri","useful":2,"cool":0},"Ize0AN6gxIhPpfUGDaInwA":{"text":"Good food. Great atmosphere!  The service was just ok. The wait staff was too busy talking","useful":0,"cool":0},"PseixoB3C9aZXY1fvRXkbg":{"text":"Updating my review since I've been here about six times since my first review.\n\nThe servic","useful":7,"cool":4},"mX-OUMORzkjt17kiwvpXuw":{"text":"It is rare to go to Bourbon St in Nawlins and find good food and good service. That is wha","useful":0,"cool":0},"URvCgRIrmAS8VcTitIc3tA":{"text":"Service was over the top awesome starting with our hostess. Our server \"Danny\" was great .","useful":0,"cool":0},"5SNetHMFE9RYj2LosJ7xDQ":{"text":"I went to Pier 424 for lunch and was pretty disappointed with everything I got. When we we","useful":0,"cool":0},"OyOA3VMGNvOpeU_LTZdyUA":{"text":"My main complaint is if you advertise and are know to  have a menu item but are out of tha","useful":0,"cool":0},"55dvYqMNirAivD7DtA7HRw":{"text":"My wife and I recently ate at Pier 424 Seafood Market, it is without doubt some of the ver","useful":0,"cool":0},"Ew-v2OHAYGpJJeCSIh8QpA":{"text":"This places was amazing! Loved everything, good, service, atmosphere, service and did I sa","useful":0,"cool":0},"w3C3Ou13RA2C7pk3PQX_2Q":{"text":"Amazing food! Great staff!! We lucked out,  had no wait and got a great table with sidewal","useful":2,"cool":2},"37uR42K4vgVm2kJ54O9Ezw":{"text":"Me and my fiance ate here last night. The pricing was good for bourbon st and the food was","useful":0,"cool":0},"OF9ixwBz-oo2_wnXg5BjWg":{"text":"Last night when we arrived we were seated at the bar to eat as there was no tables. The ba","useful":0,"cool":0},"sQJGZbCdA-unzqSIZPbS7g":{"text":"Fabulous meal. My server Jae was fantastic taking care of such a party. There were 20 of u","useful":0,"cool":0},"9ln76l2BxELBq5X4SmMz-A":{"text":"Food was delicious! Service was slow, but understandable since it was a crowded Friday nig","useful":1,"cool":1},"Zq6OpKirj_uRfwoBHfZgnQ":{"text":"Meh...definitely far from the best New Orleans has to offer, but it was a convenient stop ","useful":1,"cool":1},"fIKetIr-0ErPL9r_EHp1Ag":{"text":"The location is absolutely perfect if you just want to hang out and eat on Bourbon. The se","useful":4,"cool":2},"OuH8YLt46S36gRLOYfyaqA":{"text":"This is one of the best places to eat on bourbon and they always make sure you're well tak","useful":1,"cool":1},"lDlRXotMrw89aCb3dvTOvQ":{"text":"Well, the charbroiled oysters were a huge hit, until..... we saw a HUGE RAT scurry across ","useful":0,"cool":0},"GKvTRXYmJDEfWcH5xmF28w":{"text":"My boyfriend and I were walking on Bourbon st. when we decided we wanted to go in for some","useful":5,"cool":1},"2jW6brSphloynrycfNe9zw":{"text":"These guys are busting butt and doing a great job.  If you want some delicious apps and gr","useful":0,"cool":0},"X8FXQrxq1-YYy_uKQWxJNQ":{"text":"I took a trip to NOLA during Mardi Gras season (even if it wasn't as close to Mardi Gras a","useful":1,"cool":1},"-ifR8jd3QZFy25EtRAYf0g":{"text":"I have eaten here more than a handful of times. Still my favorite places on Bourbon St to ","useful":1,"cool":0},"QsMunSvrtR31KjzcU7bbWA":{"text":"Professional staff and management. The food was by far some of the best local cuisine that","useful":0,"cool":0},"ZYTNwpkf0KRVMReRH-lrwA":{"text":"First let me say, the food was INCREDIBLE. If there is a line, wait. You won't be disappoi","useful":0,"cool":0},"e173YCRfTDmCsM86zBibnA":{"text":"Friends and I ate our first New Orleans dinner here and it was decent. We had a nice view ","useful":1,"cool":1},"j0xHWGnGYk7l6uJYJNOjfg":{"text":"Pier 424\nBaked (?) Oysters with a garlic sauce was delicious, came with bread, had to ask ","useful":2,"cool":1},"irjql4U7xYe3auCj_hWTtA":{"text":"If you are looking for a real True authentic seafood crab or shrimp boil ! This is your pl","useful":0,"cool":0},"3vFeDuCzsFNhEn1BAwbSMQ":{"text":"The location is absolutely perfect if you just want to hang out and eat on Bourbon. The se","useful":1,"cool":0},"pbaq87AQqaHie_xHOF18cQ":{"text":"While visiting New Orleans we found this restaurant by walking by... it was the best decis","useful":0,"cool":0},"DFnGGU6M7OkiwSEUJ5obAQ":{"text":"We visited here during our anniversary weekend. The food was decent and our server a ginge","useful":1,"cool":1},"3eS-VujEU3OxssbrHkJXsA":{"text":"This was my first meal in NOLA after a 9 hour drive. We made it just in time for dinner an","useful":1,"cool":0},"A5-XdawjlSA9q0qSDAmtJw":{"text":"Service was great and the food was delicious.  \nThe place was clean and the music was very","useful":2,"cool":2},"8w55lm7QWWLv_0hBozQ07w":{"text":"It was late on a Friday night. I wasn't expecting perfect. I was expecting my gumbo to be ","useful":3,"cool":0}}