{"dRy2nvCZChZ2jo2otdfbcA":{"text":"They lost me at the entire lamb roasting on a spit, but I can forgive because I think it's","useful":11,"cool":8},"48qvxRjPSZMjTB_ml_nnpg":{"text":"The fact that I was encouraged to wear a toga with the promise of free admission is enough","useful":2,"cool":2},"ih5LFzInHakRkptfZk-4lQ":{"text":"Now this is the festival that I look forward to most.  Even before their banners adorn the","useful":2,"cool":1},"j7lzyJD5cdOXwm4XEHb4nA":{"text":"This is one of those festivals that I've wanted to go to for years, but for whatever reaso","useful":11,"cool":3},"9cEx_T0J7t2tzDqMtyIEGw":{"text":"We had a blast!  My two daughters (11 and 19mth) sauntered in around 6pm Saturday afternoo","useful":3,"cool":2},"4I3nuKkd_sLJz0GTp7W1nA":{"text":"I love Greek Fest. My only regret is dealing with the summer heat.\n\nFor just a nominal fee","useful":2,"cool":1},"mqD1D4IRnAcR8xSFlFnJTg":{"text":"I always look forward to Greek Fest!  I highly recommend hitting it on Friday night becaus","useful":3,"cool":1},"KQwUjiAXa9PR-iWgC0LInw":{"text":"Another year of Greek Fest, time for an update!\n\nSo, here's the best tip I can give you fo","useful":2,"cool":1},"MGGgkeITcb-627DvZ_gGfw":{"text":"Greek Fest is one of my favorite things about Memorial Day Weekend. My ancestors may have ","useful":2,"cool":1},"31tbQsy9QcavnxY43N0MJg":{"text":"I love Greek Festival. Ouzo jello shots, pomegranite daiquiris, baklava sundae.... mmm. Of","useful":4,"cool":2},"N6jPo7m05qFi7hOT1x63_A":{"text":"I have run the 5k on Friday night for a few years, and it is by far my favorite local race","useful":6,"cool":3},"i_qsfov095yjWV-naqQmNg":{"text":"For about three years, I lived a block from this festival. The festival is usually the las","useful":16,"cool":15},"wVhHt7YZUbOUy_bsOG0ltQ":{"text":"I LOVE Greek Fest and I go every year.  I do the race on Friday night and you get free bee","useful":1,"cool":1},"f31wck5mbt89eMSdYIdo2Q":{"text":"What a great experience! This place is full of life! Everywhere you turn you see people da","useful":0,"cool":0},"JUhMC3KXUUG5BhjDz9QTOQ":{"text":"Worth braving the weather and enjoying the day. \n\nEnjoyed the calamari with the feta chees","useful":1,"cool":0},"xyg1nDZHGgf5Vlr0fATLJg":{"text":"OPPPPPAAA\nPerfect company, perfect weather, and amazing food as always","useful":1,"cool":1},"2s19uqfbXtKGYHe6SbkCWg":{"text":"3.5 stars I'd say. This was our first experience with Greek Festival. I think that the $7 ","useful":3,"cool":1},"w8PI3soIeGEuu4wZ-1AsxA":{"text":"I love this Festival \nI come here every year \nThe food is amazing \nThe music is happy \nThe","useful":2,"cool":2},"DMPM3reyepi8XBTUVhMUPg":{"text":"One of my favorite local festivals. Not too large, but draws a crowd. Any chance to drink ","useful":3,"cool":2},"INnuK-03QxhlJ6HSTWdryg":{"text":"Great food, Greek cultural performances, and live music make this one of my favorite festi","useful":0,"cool":0},"oKn2Bcmzn5ND5rcqVI62Bw":{"text":"We enjoyed ourself so much.   Entertainment was great, the food even better.  My biggest r","useful":0,"cool":0},"8qMa7P8p8xHOxIdVZpL9VA":{"text":"I love this local festival. I usually ride my\nbike there to avoid parking hassles.  I real","useful":1,"cool":0},"CEbuVDz6xMLZ8tTEFHgqwQ":{"text":"I enjoyed the day at Greek Fest. The church was beautiful. The food was wonderful. I had t","useful":1,"cool":0},"l-BsEypThr5v2lnWQLmLSw":{"text":"What is there do do at Greek Fest ?\nPaid 16 bucks to enter for a couple.\n\nWell:\n\n\nOpportun","useful":1,"cool":1},"jkpbivh_s9VLWZmGZijFqg":{"text":"It is wonderful and cool this afternoon. The Greek salad is great and the lamb is to die f","useful":1,"cool":0},"q3dkiS_CoOU3e_WOiKOx-Q":{"text":"I do not believe in paying to enter a festival. However, I get that this was in a building","useful":1,"cool":0},"SjuekXlMdBIMDydsV2b_hg":{"text":"Definitely one of my favorite festivals.  I don't think I skipped it in last 6-7 years. \n\n","useful":1,"cool":0},"b-ZhJym3DHQpgdxB7l4tUA":{"text":"We make the Greek festival on a fairly regular basis.  Nearby parking can be a pain, but f","useful":7,"cool":5}}