{"ujCTJbsqZXj_pciddEx4og":{"text":"I just bought some products from Lush maybe a few days ago and they were surprisingly awes","useful":2,"cool":1},"GhkVjTM8XgEMNWk8Bnt3ZA":{"text":"Sigh. Made a purchase here today and enjoyed looking at and smelling everything. Now, I di","useful":0,"cool":0},"pPohyAqJF5jFTpxAEuOmmg":{"text":"Thank you, Lush! Offering vegan products is so important to me. The people working at this","useful":0,"cool":0},"QqXEl-mKbZb78MQAHLg6PA":{"text":"Everyone that was working was SUPER helpful! They wanted to make sure we knew about what w","useful":2,"cool":1},"4qiq1kHeebY9GwU14lYTjQ":{"text":"Walked in to look for their lip sugar scrub and my daughter was looking for a bath bomb. T","useful":1,"cool":1},"bckQyWdbosswy3vuAHPY7w":{"text":"Very friendly and attentive staff! Wonderful products! We were encouraged to sample anythi","useful":0,"cool":0},"B4XQ9eAAmqi_8BC69PoleQ":{"text":"This location is tiny, and tries to maintain a wide open door policy to usher in tourists ","useful":3,"cool":1},"wNRtfuELrwQRknVslU0yiA":{"text":"This Lush location is one of the best ones I've ever been to - I live in DC, travel freque","useful":0,"cool":0},"mr439ElFqxFivHgNUcXkBg":{"text":"I was introduced to the Lush line of products via a Christmas present a few years ago from","useful":16,"cool":12},"pu9oGhg12pKqwQaIc62rjA":{"text":"Great location! Great staff! \n\nThis location is incredibly busy (and sometimes hard to fin","useful":1,"cool":0},"bscIPdSBmuYy_ffRKlvHvA":{"text":"Like most lush stores, the staff was super helpful and nice. The store is clean and right ","useful":2,"cool":0},"6tNI9cNLsKFcLftIV5lwmQ":{"text":"Whenever I'm in NOLA for business, I stop by here and get a face mask. So good for my skin","useful":0,"cool":0},"zyFjpjlIf1EppD3zMMgTvQ":{"text":"The girls who work here are so friendly and personable! We had some questions about the ba","useful":1,"cool":0},"Roqcn1M26s8pf1Fo-augKw":{"text":"Having tried a few Lush products and loving them .I wanted to become more knowledgeable ab","useful":0,"cool":0},"CoEG30wGjFkA05N39Z94QQ":{"text":"I usually go to the uptown location because it's easier to drive and park there, but the s","useful":0,"cool":0},"5WD_1r3mC6jUp4hfQx5hrQ":{"text":"Angels come in the form of Christina's! On vacay and came with the most awful spray tan. T","useful":0,"cool":0},"gfKeBN0Z97m-3Nkf-fRJXw":{"text":"If you see bright colors and can smell awesome fragrances, you're in Lush! \n\nIf there are ","useful":36,"cool":29},"cCSSVpFG1Rr8fwj-ORcEGw":{"text":"This shop is super adorable. It smells phenomenal and is set up nicely. Immediately as I w","useful":0,"cool":0},"LnKVy2ingTtsXTEs68GyQQ":{"text":"The staff here are incredible. I've never had bad service or even just mediocre service at","useful":0,"cool":0},"OPOkZfT4FesPyAFYaXK1Vw":{"text":"Very friendly staff. Great demos and samples. I don't use these products myself, but I was","useful":0,"cool":0},"HTTRCkUSWmGAtv-6fPFAIw":{"text":"My review of the previous location on Decatur St. was:\n\"I wish there was a LUSH on EVERY c","useful":6,"cool":3},"mgwC8aGGIKUAvadPpv-5ug":{"text":"The only complaint I have about this establishment is the watching and recommending from t","useful":0,"cool":0},"s_1rkeuFhkOvTPVv_mw1jA":{"text":"After a disappointing experience at a local perfume joint, the girls at Lush made our brid","useful":0,"cool":0},"lwt5qIeohQgDZupizNPN4Q":{"text":"It's one of the best smelling places in the quarter.  The smells waft down the street cove","useful":3,"cool":0},"RIkgxoEUrl11J6AqgAL4qQ":{"text":"My favorite Lush location. We stopped in on a whim and I do not regret it. The service is ","useful":1,"cool":1},"YVvdmtb7th-Tpc7dWDHhBw":{"text":"I was so sad the Decater location closed, and then so happy to find this store. I rushed i","useful":8,"cool":7}}