{"UApi6t-sxESKKARUXYTxPg":{"text":"Visited for lunch. Good was ok. A little pricey than I expected. Wait staff was friendly\n ","useful":0,"cool":0},"s7oqYXQXmEJgx5Deb13avw":{"text":"This is a must when traveling to NOLA. Everything here was great! We ordered the sweetbrea","useful":0,"cool":0},"9NWtNyP5CC9QBNkjiq_2KA":{"text":"WORST EXPERIENCE. I downloaded Yelp JUST to write this review. I am on a family trip with ","useful":0,"cool":0},"BgGIZC9PLm0qn_NZ-8ryZA":{"text":"Words almost can't describe how wonderful my breakfast was here. Husband and I went withou","useful":0,"cool":0},"r5NU9PGL3OahWrhTzfq8yA":{"text":"What a disappointment. For the amount of money that you spend eating here you would think ","useful":0,"cool":0},"UuVN0CNJ6GsoCHiRtZkRAw":{"text":"My husband and I frequent New Orleans all the time. We decided to come and spend a week do","useful":0,"cool":0},"2evxOc7H9VBsGaq7DMpIRw":{"text":"Sit on the patio enjoy the beauty that surrounds. Savor the champagne. Watch the Saboring ","useful":0,"cool":0},"4UgX-zpBUR5mfrZYUdZsCw":{"text":"Truly a trip back in time to authentic southern hospitality. Gracious timeless decor, amaz","useful":2,"cool":1},"vUgH0vGAACLmvURqXGVTKQ":{"text":"Oh, Brennan's...I see a love - hate relationship developing. After an AMAZING dinner in De","useful":0,"cool":0},"alH5RcvgIMaAc8YClzP36g":{"text":"The best steak I've ever had. Excellent service, tasty cocktails and elegant food.","useful":0,"cool":0},"Xm-Pp-atu9h3GFvD6aE7-g":{"text":"Brennan's was simply Spectacular! \n\nWe got the only open reservations to Brennans on drive","useful":1,"cool":0},"jiYemJdQ1kO2wYKhkbDlxg":{"text":"My first visit back after the much awaited reopening and it was very good and worth the wa","useful":0,"cool":0},"HaAHnKZtjo5hbjF-NnIrmA":{"text":"Hands down, 5+ stars. The best breakfast experience from the food, service, decor, reserva","useful":0,"cool":0},"ZFXnpiLx7HacvJsp2VzX1A":{"text":"I had the Rabbit Rushing which I gather is a specialty dish named after the head chef. It ","useful":2,"cool":0},"NYjpiCQkXWBMGyaLrvrUcg":{"text":"Welcome back, Brennan's!\nI was there re-opening day. We certainly expected snags, but had ","useful":6,"cool":2},"0Kof64d4O98FGQyKmCdPew":{"text":"We went for brunch.  Great decor. Great service! They regaled us with stories, history AND","useful":0,"cool":0},"IwCl6rtMrrwoKgpG9GM5rA":{"text":"Breakfast at Brennan's is a must each time we come to New Orleans.  Love the atmosphere fo","useful":1,"cool":0},"F1ym4InWGfHnzIKBHWm3Sg":{"text":"First of all, excellent service! Our servers were very friendly and knowledgeable and they","useful":3,"cool":2},"rabOor_TTXlv_lHrDE1Mtg":{"text":"We decided to have dinner here shortly after we arrived in New Orleans.  I say that becaus","useful":1,"cool":0},"I1CqwNcy5cgwxASkONeokg":{"text":"Our group of 15 was in town for a bachelor party and Brennan's was a perfect spot for us t","useful":0,"cool":0},"Y62OStX3hhl1spglbZFLfw":{"text":"We mainly go here for breakfast when in town, but the turtle soup is fantastic for lunch. ","useful":0,"cool":0},"vv-VwLW4fMxy37yzDQodVg":{"text":"1 of my all time favorite restaurants in the French Quarter. Was closed for 1.5 years to u","useful":0,"cool":0},"Dx9s3GtDkywqABxViZ3Y1g":{"text":"While in New Orleans recently, we had to have Sunday Brunch at Brennan's. We joined friend","useful":0,"cool":0},"WGLY7c9s0AolpbsknzUkIQ":{"text":"Our Server was awful. He seemed irritated that he had to do his job. He never came back to","useful":0,"cool":0},"0UQODq3TBhynmtEY3tgmQA":{"text":"I made a reservation for four people for 1:30 in the afternoon. My family and I were excit","useful":4,"cool":2},"3cBYoYB-jLhvvEhmRGa9vw":{"text":"We ate for two hours! Everything we ordered was amazing! We started with the Caribbean mil","useful":0,"cool":0},"KtCps4JOqgo5oCDP1_N99g":{"text":"I just had the worst dining experience of my life. Service was horrible, food was not good","useful":2,"cool":0},"T205g5AkTtiH2RPYoK4AFw":{"text":"The decor was amazing.  The rooms each had a name and theme. We dined I. The havana room. ","useful":0,"cool":0},"ELjadHB28EUama7J5VdHsw":{"text":"Service was good! Food was average. Good show for dessert banana foster. Place was nicely ","useful":0,"cool":0},"zVsVEONXlbwpvfG9VHKmwg":{"text":"The man at the front desk was not polite about the dress code, very unpleasant experience.","useful":0,"cool":0},"DA2ZbsOZTQeFVTnUg1hXVQ":{"text":"A classic.....been coming to Brennan's for three decades now.  Excellent food and excellen","useful":0,"cool":0},"2Etez_EuwblwEqCJ50shSA":{"text":"If I could rate lower than 1 I would. The service was deplorable. The food was in so small","useful":0,"cool":0},"ln6WPbKiqU06YACWFXQxsw":{"text":"Portions very small. Chicken is about the size of a normal chicken wing.    Risotto is abo","useful":0,"cool":0},"AOK8s85UWARTXWOkv4Ma4A":{"text":"Stopped here for a late lunch before our flight home and we were so glad we did! We were w","useful":0,"cool":0},"ebEpxtzvy7x_0U6MJvsdLw":{"text":"Anyone that loves food, NEEDS to come here. 100% without a doubt the highlight of my eatin","useful":0,"cool":0},"VVILZ4jMTa3h5LaoZj_9rw":{"text":"This new Orleans classic lived up to its reputation. I want sure when i made the reservati","useful":1,"cool":1},"0fbt6o7PQSro6v6kbvUusw":{"text":"The best meal I've had in a very very long time. The lobster appetizer was phenomenal, but","useful":0,"cool":0},"DzGH_hMD5I7tKvUzRc5bcA":{"text":"Brennan's is a must in Nola it really is incredible. You of course have to get the bananas","useful":1,"cool":0},"ZIzc5plyRNiONp0e2U6uRg":{"text":"Fabulous breakfast. After our first day we returned three more times. They consistently pr","useful":0,"cool":0},"2epMBeEOKXUyrfHVAkubBw":{"text":"Had a wonderful breakfast. Things on the menu you just can't get anywhere else. Wonderful ","useful":0,"cool":0},"Wd8eZmfBYPhkg0Z6ySI0wA":{"text":"Stopped in for the famous Bananas Foster. Worth every penny $20/2 people. Enjoyed the dess","useful":1,"cool":1},"3rEovqgSKK1hTBco65H8hg":{"text":"What an insulting experience. \nOpenTable showed Brennan's with lots of space for lunch but","useful":3,"cool":1},"aadEO1mLXMPYQvy2IGcFtg":{"text":"This place is amazing - the place is historic, well maintained and beautiful from the insi","useful":0,"cool":0},"YnP5rECgY3xCKvBi1IUH9A":{"text":"Oh my gosh!  I've been to NOLA several times but never had the pleasure of dining at Brenn","useful":0,"cool":0},"1T8zeFF5jElxjSLRfAnNrQ":{"text":"Great place....we had a walk in party of 8 and they were happy to accommodate. We ordered ","useful":0,"cool":0},"txpupjTTPlBPwWdJpH_gPw":{"text":"Delicious Creole food and old southern cocktails. The chargrilled oysters are perfectly se","useful":0,"cool":0},"-Wg8JSoLFbMymkQ0XliJlQ":{"text":"Hands down, this was my favorite place in New Orleans. Delightful and superb. My hubby and","useful":0,"cool":0},"vPhhDM1gIWoUVRk4ulDFcg":{"text":"I don't spend $90 per person for dinner all that often, but when I do, I expect a 5* exper","useful":1,"cool":0},"nLi2Etz79JxGYP2IH1E_Rg":{"text":"New Year's Day brunch\nWe arrived for our reservation early and enjoyed a few cocktails at ","useful":0,"cool":0},"mr9SqUeNJ22OFljf8vuuUw":{"text":"Best known as the pioneer of the bananas foster, Brennan's turned out to be so much more! ","useful":3,"cool":1},"9L53YeKZHhx0bNtZsMhfwg":{"text":"Brennan's Is a gem.  The decor is lovely, exudes tradition and charm and sets the stage fo","useful":0,"cool":0},"08lCDJU6fDORrL8grvivjA":{"text":"This review is only for the bananas foster and pineapple financier. Since we weren't eatin","useful":0,"cool":0},"4GV8YYkLgMXzSHzfP_8QqA":{"text":"Fantastic Food!  A bit pricey, but if you're in NOLA for a good time and good food, you ha","useful":0,"cool":0},"nSE_ekFVfrJmL-X9bq6AsA":{"text":"Stopped in for a late evening dessert....bananas foster of course! My wife had been here a","useful":0,"cool":0},"ZbdCbf2rX2m7kokr5ZjFUA":{"text":"A little pricey but the history, quality and service are worth it. The turtle soup is the ","useful":0,"cool":0},"7dMc5GKnT4aA_cHmocuxSQ":{"text":"Excellent is the Word. Amazing food !!! Service impeccable and ambiance to die for it  thi","useful":0,"cool":0},"WTd8uC2E_aFAkEgSlVg8ww":{"text":"What's there to say about this place that hasn't been said already? Just go eat there alre","useful":0,"cool":0},"-ggBTTwOTZnR3VXptuHj1g":{"text":"SENSATIONAL Sardou!!!! Special shoutout to bartender Holli Brehm who suggested this incred","useful":1,"cool":0},"ANduqpsdzr9Zc_15mlcUtw":{"text":"Stopped by for cocktails one lazy afternoon.  The Brandy Milk Punch is their speciality an","useful":0,"cool":0},"CBvU7jbcptb-NEf-Unmk4g":{"text":"Good meal. Highly priced. Nothing as special as we expected but good nonetheless. We had b","useful":0,"cool":0},"rQ4wloO87A3BPkRFPwo1MA":{"text":"Was last at Brennan's in 1997, and went again on my recent trip to New Orleans in late-Feb","useful":0,"cool":0},"_O0ExHZolB1W-EaDE4mnzQ":{"text":"Oh. My. Goodness.\n\nThis place was FABULOUS. We visited this place in mid July for my boyfr","useful":0,"cool":0},"3WvD1sPr3zJLRdtvbfzKRg":{"text":"The food here was great, the service was hit or miss. It made for a mixed experience.\n\nWe ","useful":0,"cool":0},"q4oRt4DhA7cXH-YjOMH8eg":{"text":"\"Have breakfast at Brennan's.\"  That was the mantra I heard before coming to NOLA. On this","useful":1,"cool":0},"Wm5rrMFmB31qU1O-KptdZA":{"text":"Since I live in San Diego, I couldn't wait to taste the fine Cuisine of Brennan's restrain","useful":1,"cool":0},"zFH27AnGtok56vb7gN_M7g":{"text":"Everything was amazing. We had a reservation but still waited about 10 minutes. We were se","useful":0,"cool":0},"rpM5D2snSN2NyF6fQKXUXA":{"text":"Amazing food!! Had the turtle soup and it was delicious  also the poached eggs were done t","useful":0,"cool":0},"LWQyQto4y1iAzodqJO-iVA":{"text":"Brennan's is iconic - it's a real NOLA/southern dining experience. They formally address e","useful":4,"cool":1},"IwL52Ep_gfISDgMY9x_syA":{"text":"Best place I ate at in NOLA. A baked apple got my fiancé and I real primed for our entrees","useful":1,"cool":0},"uwuIUV1sXygAL8Zt-b3Z2Q":{"text":"Food was fine, however service was super slow. We asked for a drink three times and it lit","useful":0,"cool":0},"oV1Iwe4LjOws4k2wmjWkgg":{"text":"Took my wife here for her birthday. Food was great, restaurant was busy. Had a great time,","useful":0,"cool":0},"E7z05gRxUy7XYVKdLCP8Rw":{"text":"So much to say! The food was fantastic. I went a little out of my comfort zone and got the","useful":3,"cool":0},"dcUbXkJwYZVKym0t5hrhdQ":{"text":"newly renovated and absolutely gorgeous inside. We had one of the best meals we have had s","useful":2,"cool":0},"QB311xYXOAIxWpF3W1hA9w":{"text":"I never write yelp reviews but this was so amazing I had to! Amazing food and service, esp","useful":0,"cool":0},"74uSBOJLzGm4Z6nyEPNRQg":{"text":"I came here for breakfast before my flight back home to California. It's my meal at Brenna","useful":0,"cool":0},"IgMlRSQ3rUXXpNw2lVxSkw":{"text":"This may be the worst experience I've ever had. Went in for a \"world famous\" bananas foste","useful":0,"cool":0},"5fzvV1jtu0C-_xi_DhW9KQ":{"text":"First visit to NOLA and the food was all around excellent...but this brunch was superior. ","useful":0,"cool":0},"PSxSI158u3H_dDWx86YPtQ":{"text":"Beautiful restaurant with lovely courtyard away from bustle of French Quarter. Gumbo is 7/","useful":2,"cool":0},"laat0q2M6rjeE6fFD1nfQA":{"text":"Let me begin saying that this is my first review ever!  I have a yelp account for a couple","useful":0,"cool":0},"N3_o611E82jTJT4I_hZ8tw":{"text":"Spent Memorial Day weekend in NOLA. This is always one of our brunch spots to visit. This ","useful":0,"cool":0},"z-i-UgafYv8wb7RCIpggog":{"text":"If you go to NOLA make sure you go to the brunch at Brennan's. We started with the French ","useful":0,"cool":0},"djVoi58gMV6p-Q7kCxqPdA":{"text":"We came here for dinner on a bachelorette party with 11 girls and it was one of the highli","useful":1,"cool":0},"fIEX0iHY6xnF2GdwJtcjMg":{"text":"I'm not usually a fan of Cajun food, but Brennan's changed my mind. \n\nI came in without a ","useful":2,"cool":0},"TP_Qu-Xj5uNBRTpWp9iMZw":{"text":"Plan to spend a pretty penny, but food and experience is definitely superb. Had the 3 cour","useful":0,"cool":0},"Hc9q-zrzwGCfSrOqnIMJLA":{"text":"Another place that time forgot and where pride in the past prevents continued reinvention.","useful":0,"cool":0},"gV14BfMvmIo-TWOaf-dv6A":{"text":"One star for the Bananas Foster and one star for the waiter. \nI had really high expectatio","useful":2,"cool":1},"CPUwBd90VseI_sHKBVYEfQ":{"text":"Absolutely delicious! Came here for brunch on a weekend. Not only was the food tasty, but ","useful":0,"cool":0},"seRNbz-cfSs4BoJDxPXS6A":{"text":"We got lucky the second time trying to get a reservation here. Didn't get it on the 3 days","useful":1,"cool":1},"IXk8j6rzFzNwZyJR6Akdlg":{"text":"My boyfriend is a foodie and chose this place for brunch. We are from out of town, so didn","useful":0,"cool":0},"INbUsJVg0Yg2dx4w7mD99A":{"text":"First night in NOLA, we wandered in famished after a daiquiri. Unfortunately our party was","useful":0,"cool":0},"TkbvVf3K_6U4RIc2ygnl7w":{"text":"PRRRRRRRRRIIIIIIIICEY Don't expect to pay anything less than 30.00\n\nTry the Bbq shrimp pot","useful":1,"cool":0},"BYwRcdHR9mogxQN6kFQj3Q":{"text":"One of the best breakfast dishes ever, eggs bene with lobster, shrimp boys in and oysters.","useful":0,"cool":0},"yDVUnrAVjY7IFMbNRZoRhw":{"text":"A classic and thankfully has kept its original quality!  The food was fantastic, our wait ","useful":0,"cool":0},"YHrsI8n-kymu3-PTTmP99A":{"text":"I was told it was the best brunch spot in New Orleans. They were right, so good. I highly ","useful":0,"cool":0},"lXE7WsDCS7VuPqoNNCmCAg":{"text":"What a cultural experience. No restaurant typifies the New Orleans experience quite like B","useful":0,"cool":0},"xbBCjbNyZZ2-AztGlgh7wQ":{"text":"Novelty / nostalgic restaurant with terrible cuisine. Pure presentation ; great for the In","useful":0,"cool":0},"Ckm1x0Pq33xUB1EUDKNgvA":{"text":"Byron, Bryon, Byron! I can't say it enough. The most INCREDIBLE server. They did not serve","useful":2,"cool":0},"4RFI5KOELe5ICZuMhunlDg":{"text":"We ate here for our ten year wedding anniversary and they helped make it so special! I rea","useful":0,"cool":0},"ifSJtF7_bJNx9Ol_ICgKQw":{"text":"Brennans is back.  Truly enjoyed our experience.   Started with the egg yolk carpaccio.  R","useful":0,"cool":0},"7uvtRGjLMuGGeZNHlq1KXg":{"text":"What a treat! Wonderful, attentive, informative service. Great food - impeccable sauces, e","useful":1,"cool":1},"mRAqNvK12kvVhFsFwhS4iA":{"text":"Classic in style, this landmark is worth a visit if you are interested in taking in the hi","useful":0,"cool":0},"pyc4jT1NyJAvcYSVnS9_yQ":{"text":"I went here for dinner. The food was very good and the service was excellent. Everyone the","useful":0,"cool":0},"3Vu4DkUR0LoAF4zLrIikSw":{"text":"Awesome dinner in the bar. If you don't have reservations, make your way to the back and i","useful":0,"cool":0},"fOlmjjsrrJrMpz-czMK8Gw":{"text":"We went for happy hour on a Friday, good service, good food and beautiful patio! We had th","useful":0,"cool":0},"FijseuYgtsUyDza0zIkfVw":{"text":"Food was excellent and the waiter brought us free champagne when he found out we were ther","useful":0,"cool":0},"hfOiqcTd8rsBPZXCmvMyhQ":{"text":"Excellent breakfast and desert experience.  \nCorned Duck Hash $19 (the best hash I've had ","useful":0,"cool":0},"muyCrqpd0AwveWYzmRFKvA":{"text":"One of our favorite restaurants in the city! The food is always amazing and the service is","useful":0,"cool":0},"BvPZS3oLkGQZRvgvwThRAQ":{"text":"I first went here in 2001 and had the Bananas Foster for the first time.  Every other time","useful":0,"cool":0},"Yhty8Ghd_J0M4U2_ziA4xw":{"text":"Came here just for dessert and the experience. This is Where banana foster was invented. d","useful":0,"cool":0},"bJtvR0OO_d66A1G16Ae7Lw":{"text":"We went here for brunch it was a amazing! The service was great! On a nice day you should ","useful":0,"cool":0},"5ioFSum1aksLtOodcFj34Q":{"text":"I have never in my life paid over $100 for breakfast, and I never would have thought it wo","useful":1,"cool":0},"Tu8kLLEj63MHvW7s7aspBw":{"text":"Probably a 3-star dining experience but I was expecting 4 or 5 so I deducted an extra one ","useful":0,"cool":0},"Ky1ADvMptUIJBiSslVTcTQ":{"text":"Outstanding brunch and service. Exactly what I hoped for. We were at Arnaud's two days ear","useful":0,"cool":1},"JZYKE2vt5w53_HPxTdoIcQ":{"text":"Dinner for four on a Sunday night.  Terrific food, I had the duck which was exquisite. So ","useful":1,"cool":0},"zIErHWEMY5UA5LeMQm10Rw":{"text":"This should be a 5 star review but unfortunately it felt like we got lost somehow by the s","useful":0,"cool":0},"zPevxHptnXSAxLMYAsDMdg":{"text":"The food was outstanding but service was poor. Our food took twice as long to reach our ta","useful":0,"cool":0},"kEhoDbs48VjCUC4AQF7bzw":{"text":"Extraordinary.  Food, service and ambience all far above average.  The vanilla scented Fre","useful":1,"cool":0},"ZaQGiPYhBgb4jcRxwqaySg":{"text":"My friends and I were were at the Roost Bar here and we were blown away by their service a","useful":0,"cool":0},"HFnotcyJl8hojGS2diggGg":{"text":"Excellent food. We went there for brunch. Ordered some baked oysters to start they came wi","useful":0,"cool":0},"VinCLYwGJMKChwDu213uzQ":{"text":"This place is AMAZING!!! The food is out of the world and the service is top notch. Highly","useful":0,"cool":0},"w5MvwAPgiN4t-fUC3FI8cA":{"text":"Stopped in after brunch and place was closed but they did allow us to go to the bar and or","useful":0,"cool":0},"Gdyv7n17t9b0bOOEYXGXKw":{"text":"After some persistent phone calling, I was able to reach a live person and make a dinner r","useful":0,"cool":0},"zA1Cfd60DNsHmm2FJ0Ugsg":{"text":"Closer to 3.5 stars but can only comment on the champagne happy hour.   Got a bottle of ro","useful":0,"cool":0},"GVvMZt0eMfqcFwOT0GVRvQ":{"text":"An amazing meal from start to finish\nImpeccable service in an old world setting. \nThe turt","useful":0,"cool":0},"ei13wzQVy53jkorsOo-ThQ":{"text":"Brennan's is truly a New Orleans establishment and it met our expectations for a lovely br","useful":2,"cool":1},"FXjWShXOT0s-3nX3lAqIzg":{"text":"I called two days ago to try to make a reservation for a few weeks away. Left a message, s","useful":2,"cool":0},"1krZZw4M_Sk5csiH1n_LsQ":{"text":"Once was enough, no need to go back\nBrennan's is synonymous with New Orleans restaurants, ","useful":0,"cool":0},"M03Wi62fPdub8SFxVT0_Hw":{"text":"Had breakfast at Brennan's. Was a little hesitant booking here given it appears so tourist","useful":5,"cool":5},"8Nuq6OwtET5J8jyIP5T-pQ":{"text":"This is by far our worst dining experience in New Orleans thus far. From the very beginnin","useful":0,"cool":1},"uJDTkTIkEWpq3VetysiVww":{"text":"This place is exquisite. The building is gorgeous. They're known for their bananas foster ","useful":2,"cool":1},"-CXMhrTpXxhQwSZ6gqQEWw":{"text":"Great meal. The deserts were impressive. Of course bananas foster! My kids enjoyed the gol","useful":0,"cool":0},"Xbqkjy-sv_w69isWLZulvA":{"text":"Order the Steak Diane, cooked tableside. Delish! Our server Sean was great! And lead serve","useful":2,"cool":0},"DcN5qHvXlAL7updnNQd1Eg":{"text":"What we had: Huckleberry blintzes, buttermilk biscuit, homemade sausage, French toast, and","useful":0,"cool":0},"2AZ4IvzzoG2hzU9edpIU4Q":{"text":"The first night my family and I tried to eat there it was booked. The matradee was nice an","useful":1,"cool":0},"w8jzPINGYKERyB4vHnUkpA":{"text":"We went all pork.  The bacon wrapped pork loin was tasty.  There was also a chop and pork ","useful":0,"cool":0},"qioXKa2fGGV1B1wP33GWDw":{"text":"An anniversary breakfast took us to Brennan's.  I would give six stars if that was a possi","useful":0,"cool":0},"9Z_1KA1WeGAr1A6HLmzjSA":{"text":"Lucked out with table with no wait for breakfast one morning.  Beautiful outfdoor patio (r","useful":1,"cool":1},"yBDGO5w1VvMPZf6EJnCfGw":{"text":"Came here on the night of my engagement to my now fiancé. Right away the service was great","useful":0,"cool":0},"RxQx45nfo-0z6GVuXnYuKQ":{"text":"The food was actually pretty good but the service was subpar for such an upscale restauran","useful":1,"cool":0},"ZBFXlPVpgAU34UaG8Ea5gg":{"text":"My wife and I did brunch at Brennan's during our late August 2017 visit to NOLA.  We went ","useful":2,"cool":1},"Oza495Q5XyzRdzTcaSQlzw":{"text":"I will start by saying the food we had was phenomenal! The \"shrimp and grits\" which was mo","useful":1,"cool":0},"a3VhXB9tFm_Cmh8Z6J0eBw":{"text":"The POISSON BLANGE was incredible. The banana foster made me pleased beyond measure. Prepa","useful":0,"cool":1},"fCA_vfFoVlZGUaRnuVIozA":{"text":"First stop in NOLA and we are off to a great start!!! This is fine dining for any meal. Th","useful":0,"cool":0},"4jQvi8V5HZKheQpPPeSn_g":{"text":"We recently took some out of town friends for brunch. Ordered the turtle soup and French t","useful":2,"cool":0},"a9hXTZrp0OR6sse6UUMuag":{"text":"Had a wedding brunch here. Servers were good.  Food just ok. I had a baked apple that was ","useful":0,"cool":0},"LpULzxnk-ntD9a16g34rMg":{"text":"THE BEST meal we had in NOLA. We came in around 6:30pm without a reservation, and were sea","useful":0,"cool":0},"nZQaoLgUUOnG80f_bO5KWg":{"text":"My God, this breakfast...There were moans, there might have been a little weeping with joy","useful":2,"cool":2},"FtSUCG6rH69wirWOjQ64uQ":{"text":"Where to begin?  This place was recommended by several friends and had overall excellent o","useful":0,"cool":0},"CVIfb7TsezyzmYIQIBQ8og":{"text":"Great location in the French Quarter, helpful waitstaff and really excellent food.  Cajun ","useful":0,"cool":0},"aekJwwW_JCHwOZqKFpdZCw":{"text":"No wait for a table for breakfast. My husband and I had the lobster appetizer which was am","useful":0,"cool":0},"Wmg-VeYvZ9nDhudPAjcHHA":{"text":"I had a friend in town so we decided to eat here bc of the reviews and atmosphere. The foo","useful":0,"cool":0},"xk02_bQeHk2A98bCQFgCJQ":{"text":"I had thought about the crab omeletts I had eaten at Breakfast here many times before for ","useful":0,"cool":0},"wBtaTsh54YkzrgboUedRwA":{"text":"We made this our special stop on our Silver Anniversary. The wait staff took great care of","useful":0,"cool":0},"tKIal0tDJp2IoFi4FUczUw":{"text":"Beautifully presented, perfectly cooked food. Hubby had the fried chicken. He said it is p","useful":0,"cool":0},"8TdX_MOOkrJqeRSZVPAVzw":{"text":"We visited Brennan's in the French Quarter and our experience was incredible.  We made res","useful":1,"cool":1},"yV9nalXUamBRQPzOFjPFcA":{"text":"Thank heavens, Brennan's is back on their game. When in NOLA, you must brunch there. Both ","useful":0,"cool":0},"88Dsv4DsN5NypVDZa2oXvQ":{"text":"The staff was so rude they ruined our experience.  We had a group of 8 and all of us were ","useful":0,"cool":0},"lvEz2yrxjHb52RSjbNM4GA":{"text":"This was a neat stop that we were glad we decided to make!  Highly recommend making a rese","useful":1,"cool":1},"wpcqJxmaKIFLQHx3QnNfsw":{"text":"The best part about fine dining and exceptional service is getting that chance to live lik","useful":1,"cool":0},"DbolW-TkF4n2pA_cQlLjeg":{"text":"The food and service were out of this world. Servers were very knowledgable about every co","useful":0,"cool":0},"BdUYY70IadWSqu2RKR-_UA":{"text":"We had the pleasure of enjoying Thanksgiving dinner in the outdoor patio area with our wai","useful":0,"cool":0},"zzXZfJcZd6BH6CrcIl4R3A":{"text":"Brennan's just reopened last fall - the waitstaff were great. The food expensive but delic","useful":0,"cool":0},"5rU8uYKO_BWjaK4Rw_ydZg":{"text":"Brennan's is a must for fine dining when visiting NOLA. I was here for 4 days and had to g","useful":0,"cool":0},"OCsdaih3DN5cdoAmH4D2bA":{"text":"We came here for cocktails and dessert. The banana foster is truly amazing and the cold sh","useful":0,"cool":0},"noO8GC0Pxj-m_nfV3NX2RQ":{"text":"Let me start off by saying that this place completely topped my expectations! \n\nWe had a 1","useful":1,"cool":0},"ib3pB0vh0lGBjA-5ravjGQ":{"text":"(The Roost Bar review only)\nWe were in town and remembered seeing the promotion for their ","useful":1,"cool":0},"Px8Ge70F_UK95uEVZVfMTw":{"text":"The best food in New Orleans!  I have been to this restaurant many times and never been di","useful":0,"cool":0},"Vq-MY3vI43Lhe8hrNqwi5g":{"text":"Hands down best brunch of my life. Interesting flavors and textures, fabulous service. Bea","useful":0,"cool":0},"GxdJfHLtw5lHHuzX8p0Kbg":{"text":"Food was amazing. Reservations recommended, we didn't have one and got lucky that they cou","useful":0,"cool":0},"VljcCMHaQvPON1Aka3fM3w":{"text":"Incredible NOLA experience. Menu is fantastic, staff is knowledgeable and friendly. Highly","useful":0,"cool":0},"5H_gJ6pb7IgRoJEgLy1akw":{"text":"I really like this place. Staff is super friendly, happy hour nice and the out door courty","useful":1,"cool":2},"lFqwystDS1ve12END4pKZA":{"text":"This place was amazing.  A local suggested Brennan's for dinner so I came here on Nov 22nd","useful":0,"cool":0},"BryK2tGX6Tw-pR-WCE9lrw":{"text":"Wow!!! This place is incredible! Go here and check out the bar menu. The full menu is grea","useful":1,"cool":0},"h0M81xkZDxUCO3ZZq9GF0Q":{"text":"We went here for brunch on a Wednesday morning and even in the middle of the week, it was ","useful":0,"cool":0},"c7uA4PeqbABjAYohFLpZpw":{"text":"This place is not good. We went for dinner it is overrated ! Save your money it is pricey ","useful":0,"cool":0},"nh5VqzIyHjo7ohvSO7wSeQ":{"text":"Had brunch at Brennan's, I ordered the eggs cardinal w/ fried oyster... It was so good I f","useful":0,"cool":0},"VzKOXu1JA8UAypi5CEFRTQ":{"text":"Brennan's lived up to all the aspects of what all restaurants should strive to be. Excelle","useful":3,"cool":3},"k1YJXG6ge9A0bEKPJ8YbyQ":{"text":"Seafood Gumbo Filè, Braised Pork Grillades, and Bananas Foster. So Good! Really enjoyed th","useful":0,"cool":0},"Y5vU7pEW9lfl4ZqMw38zzA":{"text":"Food was great, service was excellent and the place itself drips of old New Orleans/Hollyw","useful":0,"cool":0},"bn6xOB7PnCndXm0-BzTwaQ":{"text":"Horrible experience here tonight.  My husband mentioned it to to the front desk but no res","useful":0,"cool":0},"Rd-YgVtYr3AAp34AffIMJQ":{"text":"We had a marvelous time at Brennan's. The service was impeccable, the food was unique and ","useful":1,"cool":0},"muLqqTuvrxbI9h3tSpBnvQ":{"text":"We came here for breakfast, after making reservations several weeks before coming to New O","useful":3,"cool":2},"mAoojOc0659YY-5Gy0p51g":{"text":"Holy moley....the brunch! Gotta try their Milk Punch .all of the drinks we have had there ","useful":1,"cool":0},"FpYDZ2cIIaHvWFTbJWYCXw":{"text":"This was probably my favorite meal I had in NOLA (or at least the top two) and I obviously","useful":0,"cool":0},"CqACqcFRyPDHD7sPtcrjQg":{"text":"Food tasted good but service was horrible...soup served without a spoon, and took us 15 mi","useful":1,"cool":0},"RN_Ud7MtcXk04yg0SSrtMQ":{"text":"Very slow (took 1.5 hours to get the food). Over half of our tables food came out cold. My","useful":1,"cool":0},"nBdu7OpHO2z0bqUhUhud4A":{"text":"The food was good and the restaurant was beautiful, but it was the human element that I wa","useful":0,"cool":0},"G5uvPPCr4ySHvvOZqPPmSA":{"text":"Amazing brunch!! All of the food was to die for and the servers were nice, fast, and quite","useful":0,"cool":0},"CTND0UtmsgzzhMPIf88J3Q":{"text":"While planning a girls weekend with my friends, we made Sunday morning brunch reservations","useful":0,"cool":0},"OtXTeN6E8Q9h4PCxcHhxBA":{"text":"Five stars isn't enough to rate how great this place is! I was completely blown away by th","useful":0,"cool":0},"x7csZzZ1pn5rbMv9P1n-4Q":{"text":"Exceptional food and service. Wonderful cocktails and ambiance. The Brennan's tradition co","useful":0,"cool":0},"cso3a2AYswsym4MT9UrjSg":{"text":"If you have food sensitivities, please make these implicitly ,ultra clear as the wait staf","useful":0,"cool":0},"mo9zZo0cBqYKRNfUNoekgA":{"text":"I have been looking forward to checking Brennan's off my bucket list! It did not disappoin","useful":0,"cool":0},"hJrajh_QlmqOhQtjrvizdQ":{"text":"I recently went here while on a trip, and it was wonderful. He went for happy hour and had","useful":0,"cool":0},"hox7RHaqu_hTK9iV0iYmvQ":{"text":"Although living nearby and frequenting the neighborhood, we hadn't dined at Brennan's in q","useful":1,"cool":1},"_x66XPeRKefTEdDqo6AvMg":{"text":"Out of everywhere we wanted to eat in New Orleans, this was the only MUST. They did not di","useful":1,"cool":0},"lHYgRa_kWa5YjQCMJI6urw":{"text":"Home of the banana foster, so naturally you have to get it as an entree. And boy it did no","useful":1,"cool":2},"61FSG5gWUz43FRDFl5KjDQ":{"text":"We went here for brunch. The food as well as the service was above and beyond what was exp","useful":0,"cool":0},"UOQjeSv3iZfOHCf2VFTlZQ":{"text":"Brennan's was truly exemplary in New Orleans. You are bound to have satisfying dishes at a","useful":7,"cool":7},"fYmkI9tGWP3bRoxWw3Qn5A":{"text":"The service was excellent, coupled with delicious food and a great ambience. Don't forget ","useful":0,"cool":0},"foXsNhql_Z7RTLWWUF0I7w":{"text":"Cute place with good food and service. I had the eggs sardou and it was yummy. Highly reco","useful":0,"cool":0},"ncJkcHSS0J13Rw0DL3N8uA":{"text":"So. Last meal of the week. Brunch at Brennan's was tasty. Service and food were excellent.","useful":0,"cool":0},"VyB7IVIRTBMaswphHEIT-A":{"text":"The food and service were excellent. Someone was there to check on us at all times. The wa","useful":0,"cool":0},"mzOb7ejUXGbDVxP5RZ_pqQ":{"text":"An awesome OG French Quarter institution. To me, it is almost a New Orleans equivalent of ","useful":0,"cool":0},"4GcqJwN9RzSRGH1mXso2OA":{"text":"The fried rabbit is the real MVP. This was also my first time having turtle soup and I mos","useful":1,"cool":0},"i6dnFgbrmhCipqe5MrkTqw":{"text":"This place was amazing!!!! The staff was friendly and fun! And they have an amazing champa","useful":0,"cool":0},"B5My5aWRFAc2LmcRRyR6VA":{"text":"I have never had such good sauces and services.  The Service was European Style and Amazin","useful":0,"cool":0},"Vftck3hI7KJ92SNtYgPUfQ":{"text":"We had a blast tonight. The service was impeccable and Thomas treated us like family. He g","useful":0,"cool":0},"tY7IEHylikKYDPSI3gbTew":{"text":"Best breakfast ever!! And they have turtles!!! Corned beef hash with eggs...yummmmm ! Serv","useful":0,"cool":0},"RY9x_Y9VBHaQCXP5dWZHrg":{"text":"The location, food, and ambiance is terrific. Great wine list. Unfortunately, service was ","useful":0,"cool":0},"b_PpLSTvCBPnpTUqWpp5YA":{"text":"The absolute best breakfast I have ever had in my entire life. A crab omelet w arugula- so","useful":2,"cool":0},"QQwdWVRjvOuso0ZUwqLBVg":{"text":"Wish we would have had to time to enjoy brunch or dinner here! We stopped in during happy ","useful":0,"cool":0},"wVSulwjk9A6vF5WItPhi2Q":{"text":"I recently had brunch here during Mardi Gras with several members of my family. We started","useful":4,"cool":1},"B1c72jtmCryn4J6Mo5jQBg":{"text":"Can't come to NOLA without going to Brennan's of course.\n\nThere is a dress code and from w","useful":2,"cool":1},"Fe1jMHB2293l-M6uvH2HyA":{"text":"Worth the hype - the kind place where you leave comfortable but not over stuffed . Plenty ","useful":1,"cool":0},"lG0cG2RBIonDW0fZf8w5UA":{"text":"I sat at the bar during the busy lunch hour. The atmosphere was lively and fun. My gumbo a","useful":0,"cool":0},"4AGSNCu30MFexcV_j8Ko2g":{"text":"From the moment we arrived....just a last minute idea for drinks and dessert..... we were ","useful":0,"cool":0},"-bJsz9dQsCeabKe2BWcVdw":{"text":"Great service. The food was good. Was on vacation in New Orleans. Wanted to check this pla","useful":1,"cool":1},"Q-SuA5eZZv10mZye1H9vvg":{"text":"Brennan's is a must while in NOLA. The dinner service was stellar. The kids and I really e","useful":0,"cool":0},"gbAb4bfF3j4dmcad0y77ZA":{"text":"Dinner was fantastic.  Service and ambiance were second to none.  This place is a must if ","useful":0,"cool":0},"JLiuho1-fmmVUHa7Hr0n-Q":{"text":"The food was delicious! The waiter was annoying. Cheddar grits were the surprising winner.","useful":0,"cool":0},"cegAj2AwvK-PDJ7qHseiMQ":{"text":"I would of gave it a 5, but the greeters at the door when I told them I was here to try th","useful":3,"cool":0},"9xjZ1VEqEc81nD8_3yaI0Q":{"text":"Why does this place insist on disappointing so much.  Should be a 5-star deal.  This place","useful":1,"cool":0},"49VxFoIb6ehkYe_DQgdW3Q":{"text":"I have dealt with a lot of places in restaurants in  different cities but I wouldn't eat h","useful":0,"cool":0},"U975tnqDoKGFMb6kOxEynQ":{"text":"I was in NOLA for a few days and wanted to make sure to stop at Brennan's for some Bananas","useful":0,"cool":0},"GJf_KhUSSJ8i24SEGoJjAA":{"text":"Others in my party said theirs was good, my was absolutely horrible. The corn beef hash wa","useful":0,"cool":0},"ke_W3OmtonHamlxPjCXQdQ":{"text":"Let start that it was fantastic service. That is why I gave the three stars...otherwise it","useful":0,"cool":0},"ijMnq7jdjQMAVTXTQdKIcA":{"text":"Great food!  Must try if going to New Orleans! The atmosphere makes it a 4 out of 5, I fel","useful":0,"cool":0},"FgxapyrCanKKnXeeHThTmg":{"text":"Good for a one time visit, but did not meet its reputation or warrant its price point.  We","useful":0,"cool":0},"83TlkJZ-VYnUxE-hRL4-gg":{"text":"Horrible experience!! According to our waiter, everything on the menu was AMAZING!  In a g","useful":0,"cool":0},"snGd0Vs7hzSl87PeElZc2g":{"text":"I recently visited Brennan's with a large group and had a great experience. Upon first arr","useful":2,"cool":0},"E5SGV3Orx51M9FXsRloqCw":{"text":"Save your money.  Small portions and the food is average.  Good drinks though and good ser","useful":0,"cool":0},"Kw-eHFX37ogx3zFaM_jL_w":{"text":"When we booked this trip a month ago, my father-in-law said we had to go here.  I made res","useful":2,"cool":0},"1BpHi_L3CETjyz5jn8LRCQ":{"text":"Treated my parents to a meal here for Father's Day June 2016, and it was incredible. We st","useful":0,"cool":0},"ezaSQy2msnbPjyySy-_svA":{"text":"Love this place! I urge you on your trip to make all efforts to come for breakfast or at l","useful":1,"cool":0},"80tChppM_6nWkmcN7jSPrw":{"text":"Beautiful restaurant. Wonderful staff. Great food, even had a kids menu. Only drawback is ","useful":0,"cool":0},"x5LqSKleDN2VJs1nEvnXdg":{"text":"I would highly recommend this place. I had the Egg Cardinal and we both shared the sides o","useful":0,"cool":0},"GC3S0iIY6OJSQD2fulZCrg":{"text":"Everything was great! Our waiter was awesome (sounded like Chef Emeril a bit too). We left","useful":0,"cool":0},"WTX2SBZQkIz7nH1wx4--WQ":{"text":"Everything was fantastic from my first cocktail to my wonderful bananas foster. Being a si","useful":0,"cool":0},"suDI8KtgDU6Jn7AFPa6USQ":{"text":"Came to Brennan's years ago and when I returned this trip, I was not let down. The service","useful":0,"cool":0},"Xfh264K3jY8z6LpBS2C1xA":{"text":"Coming to brennans was a dream come true for us as I am a FOH manager and my boyfriend is ","useful":0,"cool":0},"bzAP00BlEBhvOuG93EvrTg":{"text":"Very nice old school vibe with excellent service by Milton. We came in at the end of the e","useful":1,"cool":0},"u3kFEhTibOQlXm7IGvKm6w":{"text":"I walked in and didn't make reservation. Thank goodness they helped me because the entry w","useful":1,"cool":0},"MvQ4JzsxloFwYSBe3m-qAg":{"text":"Updated review: much different experience going here with a group of friends vs just me an","useful":0,"cool":0},"mCh3ls4FtC4HJ9aU3G_wMg":{"text":"Went here for a brunch bday celebration. Between the group of 11 we hit across the menu an","useful":1,"cool":0},"-QM09UxM9U1VnGZr9fvNAA":{"text":"This restaurant is iconic. The service is as good as a five star restaurant. I had the Egg","useful":0,"cool":0},"o6-7zCAp7mJuaUFTEXPCzw":{"text":"Let me start this off by saying that their Steak Diane has been  one of the three best ste","useful":0,"cool":0},"R6G38eO7bilr07o5SjtNng":{"text":"Ordered the rib eye and perfectly aged and made to my refined instructions. Ordered side o","useful":0,"cool":0},"iFEK4dQHbT2ix3Nrgr3vEg":{"text":"Be sure to make reservations! Choosing a dish is a real challenge; the brunch menu has a w","useful":0,"cool":0},"1U-fevCHCqBJ2HIqP8EZFg":{"text":"I been here several times however our bartender Hung made this visit very special. PERFECT","useful":1,"cool":0},"GCLTiEeZ2GWsAeJuIOk1dA":{"text":"Brennan's was a wonderful experience for our last meal in New Orleans! The service is impe","useful":0,"cool":0},"O3kSfSxstjutH8_madlMWw":{"text":"The service was excellent. The food full of flavor and the menu offered variety. The turtl","useful":0,"cool":0},"q2Uw3QuGYSoVKJ1-bQ8VtQ":{"text":"Each time I eat at Brennan's it is even better than I remember. If you're eating brunch, y","useful":0,"cool":0},"aaYieHdLhgdpqdBk145Ybw":{"text":"Delicious!  We have yet to try any meal other than breakfast, but breakfast is such an ama","useful":0,"cool":0},"bh-O0zDNh53uoQJkjHyRVA":{"text":"We came here Friday night for a family dinner with our group of 5 while visiting NOLA for ","useful":0,"cool":0},"ukS0lAs85NCotOSsAvq9Ig":{"text":"Brennan's is truly a gem. Some girlfriends and I went there for brunch and it was a wonder","useful":0,"cool":0},"x5i8Eg_iX7dh6aLcbcHAyQ":{"text":"Our food was awesome.  I had the blackened redfish and my wife had goat cheese raviolo.  T","useful":0,"cool":0},"RZV4Fim0FM36RbnrxLdftQ":{"text":"I brought a group of 6 here for brunch while we were visiting at the suggestion of some fr","useful":0,"cool":0},"dUvY9982__WHGhxpOWGwkQ":{"text":"Quite possibly the BEST breakfast/brunch experience I have had in my entire life (& that's","useful":1,"cool":0},"E6JPmM1tbA8GgUwlrKM9Sw":{"text":"Visited for brunch. Excellent in every way. Visited here twenty three years ago. So impres","useful":0,"cool":0},"7LO5PluSpaQBL9sMxHHNNw":{"text":"I went to the old Brennan's, long ago, but returned to the updated-and-renovated spot for ","useful":1,"cool":0},"AVHDiRpvsJP000gHj4pZuw":{"text":"I hate writing negative reviews (I tend to only focus on the positive) but given the legac","useful":3,"cool":0},"8ULgSO8t5bjh3h_ZQPfgEg":{"text":"My wife and I recently had our rehearsal dinner for our wedding on June 18, 2016 at Brenna","useful":1,"cool":1},"w_IIgWGkblBYlAC43KMvGQ":{"text":"One word- amazing! The food was top notch and the staff was attentive and friendly. I woul","useful":0,"cool":0},"T7XNWl97duAjEtOCzJc3Cg":{"text":"Great atmosphere, delicious food and an awesome waiter.  Went there as a group of 5 and ev","useful":0,"cool":0},"pNPbZNLjCArwk0fMoyRYFw":{"text":"Dear Brennan's....I love you. For your classic existence, for your epic wine list, for you","useful":0,"cool":0},"OO2Wgicd7MGUKeaY9ru7sQ":{"text":"This restaurant did not disappoint. The ambiance is warm yet elegant. I have been dreaming","useful":0,"cool":0},"LsCm9uKdXhylzeD5hiGfBQ":{"text":"We made a mistake by dining at this restaurant as soon as we touch down in New Orleans.  N","useful":3,"cool":1},"RU0N_7dDRrefClJOtyno_Q":{"text":"My friend brought me here for my birthday on past Thursday.  It also was my first time to ","useful":0,"cool":0},"JDGoINGHUbT7Nn5vdcgxJw":{"text":"I came for the bananas foster! I did order the \"shrimp & grits\", their version of it. It w","useful":2,"cool":1},"HSVtYgoce6ykTYcMwP51NQ":{"text":"Breakfast with a twist. The Brandy Milk Punch is the perfect breakfast/lunch cocktail. The","useful":0,"cool":0},"XtCz7_zE-E5DBOqZ7lc3NA":{"text":"I've had a few days in New Orleans, and have been able to enjoy the local cuisine and fine","useful":0,"cool":0},"xqwSRucViS2wAE_Hlvf7_A":{"text":"Don't buy into the hype. Really horrible service and the food was not good. Definitely go ","useful":0,"cool":0},"JxElNvgKEmJfSmm7A9IsVA":{"text":"We went here for lunch and to celebrate my wife's birthday! \n\nI had booked on open table a","useful":1,"cool":0},"inh0uRTjuISxUq5Gwoy1QA":{"text":"Brennan's is exceptionally fine southern dining. The servers are very attentive and polite","useful":0,"cool":0},"q6gq95XyJAMVspP0O-XbDQ":{"text":"Food was tasty.... huge size meat cuts. Ambiance is good for dates. Pricey though so not a","useful":1,"cool":0},"hWdnCNVnxMJ9XC2bV3ZeWw":{"text":"Five stars!! Need I say more, we shared the turtle soup, the roux was great!! Never would ","useful":2,"cool":0},"XEwUFv9A7-xPPi9YWu6JCw":{"text":"Great service, strong coffee (chicory), and amazing food. We had the baked apple and crepe","useful":0,"cool":0},"Qb6QbzpJYUSsKH1bihlI6g":{"text":"Brennan's was on my list of restaurants to try. We came in for a late breakfast and upon a","useful":0,"cool":0},"oR-DV41BNRSYy8dg0IxqAg":{"text":"I'd go beyond calling this dinner \"great\". It was memorable. We ordered the Steak Diane, w","useful":1,"cool":0},"WiOd8RblxShrauqyXISlFw":{"text":"The food and service were what I've come to expect from top notch New Orleans restaurants.","useful":0,"cool":0},"0pfWIqICA1wRSNM7ww0MiQ":{"text":"It was 19 of us so they seated us upstairs in the garden room. It was amazing that they al","useful":0,"cool":0},"Ui3qxiuLIXN0zCGjedLmLw":{"text":"The best place for a night cap/ original! banana foster. The mixologist Sarah was the best","useful":1,"cool":0},"jvQnI588BVZZRPp25uDTMw":{"text":"A New Orleans classic. This place does not disappoint. Impeccable service and brilliant br","useful":0,"cool":0},"XPXKi-iKBHbFNDuYe0Nl9g":{"text":"yeah, I know.    why did I wait so long...\nthis is a dining experience that is over the to","useful":0,"cool":0},"lSHNQcIPqgLs5l93kCyoRA":{"text":"Starting brunch with lobster appitizer and Bloody Mary's makes the the day great! Restaura","useful":0,"cool":0},"ZAXrNItZU_i-LfcajJbhHA":{"text":"Beautiful siding for brunch! Must get bananas foster! Services and food on point! Now want","useful":1,"cool":1},"qltgcza4ZM_LVroSqYAHVg":{"text":"What an amazing breakfast! Our best meal during our bachelorette trip to New Orleans!\n\nWe ","useful":0,"cool":0},"IVPJd4avYusU3uZWl8_9Ow":{"text":"Breakfast at Brennan's is a famous saying but I think Thanksgiving at Brennan's is just as","useful":0,"cool":0},"XbtLFpdeN0sF91EK1uFkwg":{"text":"Absolutely loved this place. The atmosphere and building is beautiful and the food was so ","useful":0,"cool":0},"_a2M4LSkmwJzyDD7nJRnfw":{"text":"You cant come to NOLA and not try Brennan's.\n\nMy first brunch here was just a wonderful ex","useful":0,"cool":0},"x-B45J56pJFZ0mg0b9fCjg":{"text":"We stopped by for drinks before dinner and Lu, the female bartender with story red hair, m","useful":0,"cool":0},"FRStMyv68TdsxsUtddKbfw":{"text":"Everyone recommended Brennan's for brunch, so we tried it. I must say, I'm glad we did. I ","useful":1,"cool":0},"clSpp_I1SRe6D7nXCseCEQ":{"text":"Had a reservation for dinner. Looked at the menu outside and was not impressed. A little t","useful":1,"cool":0},"UdqEcIVrsv3SHx5iIw0klw":{"text":"I heard about the famous banana fosters here so without a reservation, my friend and I got","useful":0,"cool":1},"4qkBlFfkQ2A11yxGNPAnvw":{"text":"Brennan's is one of those places that is simply impossible to quantify. I've been here fou","useful":0,"cool":0},"SAvIQCnkxHS1Vj8YfbcMKQ":{"text":"First of all, we made the mistake of thinking this Brennan's is associated with the Brenna","useful":1,"cool":0},"RqfB6u_q8u3tZDUzGageDg":{"text":"Totally awesome experience! We bought the grandkids and celebrated their birthdays. Staff ","useful":0,"cool":0},"QIiRlQKzy8IfBk50IJXuTA":{"text":"It's a cute place in a historic location. The decor is very elegant with lots or elaborate","useful":0,"cool":0},"-WIwgNaP7iDi0jEGmq0ShA":{"text":"First off, DON'T TRY TO PARK HERE. You could at the Omni hotel, though you'd have to pay a","useful":0,"cool":0},"jPR-DN5U8BGL7hwW6Zhs5Q":{"text":"Had some delicious bananas foster and bread pudding at Brennan's tonight, unfortunately th","useful":0,"cool":0},"duM8YeX_cgBOSbZRYlh0Pw":{"text":"Had Sunday brunch here on Fourth of July weekend. We didn't have a reservation, so they se","useful":0,"cool":0},"Cgj17MVXpFYJ52ybyOx7Ng":{"text":"This place has a kind of Cuba in the 50s look to it, cool garden in the middle. The food w","useful":0,"cool":0},"E2_uYX6v-vLGZw1ZK8XhmA":{"text":"Sunday brunch... expected the same old world ambiance as the previously experienced histor","useful":0,"cool":0},"pFWAMo7aGCAAH_WxKFjQxw":{"text":"The lobster remoulade is served with thin delicious discs of fried green tomatoes. \n\nTry t","useful":0,"cool":0},"H0FOZ9ykNtvq5qXzBky4BQ":{"text":"Had a great experience a month back and tried them again this weekend sitting at the bar. ","useful":0,"cool":0},"HIfLZvWXvEN0_oV367vZYQ":{"text":"Amazing atmosphere only beaten by the delicious food. The staff is thorough and attentive.","useful":0,"cool":0},"RkjVnFJLUtCp0FPHz8o_Bg":{"text":"Shawn provided the best customer experience. Thank you Shawn! I will be back! Please go ju","useful":0,"cool":0},"RYj4-GYrg47odeRQrVU_qw":{"text":"I honestly wish I could give Brennans a 10 star rating. My family went to dinner for my mo","useful":0,"cool":0},"i4qdgEhuBQaAFQz5pYi9Eg":{"text":"Went to dinner with out of town guests. We were seated right away and ordered cocktails. T","useful":0,"cool":0},"9dfOz0kfUOx8YFCK9FkPlw":{"text":"We hit Brennen's for both a breakfast and a dinner.\n\nBreakfast was amazing, Started off wi","useful":3,"cool":0},"wxTII4lnPVX2jIxP5sH4PA":{"text":"Impeccable service and overall great food. We started off with a drink, The Paloma. It was","useful":0,"cool":0},"IGYkJFsuE3VqwX8tscVQig":{"text":"Meal was awesome. Service was excellent. Cocktails were delicious and wine suggestions wer","useful":2,"cool":1},"KE0Q9NToLRvtLV-BCkrfLw":{"text":"Absolutely the WORST dining experience!\nWe had reservations for 7:30 PM Thursday evening.\n","useful":0,"cool":0},"d7UvQ1j1mwwmRtcyHH825A":{"text":"We arrived at Brennan's minutes before seating in hopes of getting a table to celebrate ou","useful":0,"cool":0},"_QJS55L9GO0LC_glGs0Z_w":{"text":"Service was excellent and the food was on point. Only gripe was the lamb was the most expe","useful":1,"cool":0},"ZzOsXdXqI2PIgzJ3LQGNQQ":{"text":"Great atmosphere. Wonderful servers. Don't get the French toast. Definitely get the banana","useful":0,"cool":0},"ry7wjeeorlZajV2-H6WADg":{"text":"Good food - I had the crawfish canoli which was rather small - oysters were delicious - go","useful":0,"cool":0},"rfK3HNmyNWsS6pc3N20Gbw":{"text":"This was the worst experience we have had on this current trip to New Orleans. We had rese","useful":0,"cool":0},"osRKCBf6EDmhWyMxf0Z9Cg":{"text":"Wow! What a wonderful experience to finally dine at this iconic restaurant. A very attenti","useful":0,"cool":0},"nYfEMaPhKGMMqFZpf7lvhA":{"text":"Brennan's was a must on this trip to New Orleans. My parents had always raved about their ","useful":0,"cool":0},"rjxBr2TThFwrdnLOli1kXw":{"text":"I told my husband when I booked him a trip to NOLA for his birthday that we were eating he","useful":13,"cool":13},"YIK_cyC5u1HABLx6on_N1g":{"text":"Beautiful place.  Great ambiance. Amazing food and drinks.  You must start with the Sazera","useful":0,"cool":0},"-KH8BLXINSvZdSQnSwvk3A":{"text":"This is a beautiful place for a celebration, service impeccable, ambiance wonderful, food ","useful":0,"cool":0},"tqAkPzyo6UriZslIyBudbQ":{"text":"My family and I LOVE this place. We had dinner here at our last night in New Orleans. The ","useful":0,"cool":0},"P9yB6vwLl168pdecZzNCXw":{"text":"Absolutely amazing food. Bring plenty of money, because every selection is delicious.  Wai","useful":0,"cool":0},"PDjjOFJYzJu9C1R3JtcNPg":{"text":"Slow and terrible service.  Overpriced dinner options and small portions. I wont be back a","useful":1,"cool":1},"NoQumraOTBh7odtKFkRYcw":{"text":"I wanted to love this place and give it 5 Stars but I am disappointed to say I couldn't.\n\n","useful":0,"cool":0},"32rDMQBeEFjOjyZI2W3WVw":{"text":"We had a great time here. The food is just fabulous. Patrick was so awesome. Do get banana","useful":0,"cool":0},"kYku5r8gFvlA0yqq8SzN-A":{"text":"This is my all-time favorite brunch place. Hands down. I love everything about Brennan's a","useful":1,"cool":0},"HpmkARvkoPzaSupmwENoQQ":{"text":"A fantastic conversion of the building from the past to the present. Beautiful. \nHowever a","useful":0,"cool":0},"MKH2CD2DSU7kk9bRKHN_nA":{"text":"Unfortunately the new renovated Brennan's is nothing like the old Brennan's. The service l","useful":1,"cool":0},"1LwoPG9SuSt1Qel7kle4Zw":{"text":"Brennan's blew me away! I came with a group of friends for brunch and was stunned by every","useful":2,"cool":0},"ySFgl6V3yS02hiuYAtN4pw":{"text":"We went to Brennan's for brunch the day we got into New Orleans. We sat at the bar. I'm as","useful":1,"cool":0},"gjC_x46UHmyRBURqOPBBdg":{"text":"We came here on a friend's recommendation, and it was AMAZING!! The decor of the place is ","useful":0,"cool":0},"TwF7BksF-IcLtWC2Ae_JaQ":{"text":"Best dining experience we've had in the South period!! Staff was beyond friendly and excel","useful":1,"cool":1},"dDyd4PGIL8sloCWSAnNRQA":{"text":"Came for lunch at Brennan's on a Thursday immediately after checking into my hotel. I want","useful":0,"cool":0},"cNSlYwxdaX6cGq2ybon3qw":{"text":"I don't understand what all the hub-bub is about. This place is beautiful but that is abou","useful":0,"cool":0},"AMu0WGq1ecXBf4yyaGGBCQ":{"text":"WOW! Ambiance is fantastic! Professional staff with a lot of buzz. The place is hopping wi","useful":0,"cool":0},"s2gn5rvH7Vz-aVWeiK5KTw":{"text":"I cannot speak highly enough about this restaurant.  The atmosphere was absolutely beautif","useful":1,"cool":0},"2WOCUmQMXxyzMtB8nAp67g":{"text":"Brennan's is another restaurant in the French Quarter that I have always wanted to try sin","useful":0,"cool":0},"hJQmFmO2iS17dzP-D-6mQg":{"text":"Awesome. But, they only have small bar appetisers and (obviously) drinks from 2-6pm. Aweso","useful":0,"cool":0},"JPsuOYsyHaMdWqh_mGA4Kg":{"text":"This place is dining as an old-school experience, kinda like New Orleans itself. Went here","useful":0,"cool":0},"0Dgf-NcBZFrwFCm2t1JLPQ":{"text":"Lovely classic restaurant in the heart of the French quarter. Beautiful atmosphere. Had a ","useful":0,"cool":0},"0pSD9bsa_gIYjtl60NNRkg":{"text":"Brennan's is an absolutely wonderful experience, from start to finish.\n\nI've been lucky en","useful":0,"cool":0},"Njo9mKRhFQRGX9U4nh5haQ":{"text":"A bit disappointed if we are being honest. I had very high hopes and ordered what was reco","useful":0,"cool":0},"eHpD865aQjnqkkW178d6jQ":{"text":"Came back after about 2 years and Eric at the bar remembered me and gave me great recommen","useful":0,"cool":0},"ajQkIxIAmN8E2uYhrfa6pg":{"text":"This is my first review on yelp, and sadly it is a negative review. I had high hopes for B","useful":1,"cool":1},"soyDj0VridJ1LHHwHWBF9w":{"text":"Came here for a birthday dinner with a group of 8. I made a reservation through OpenTable ","useful":0,"cool":0},"T-lUO4fuIPJuCjAcTZ2irQ":{"text":"Phenomenal brunch Nola food in a classy restaurant with wonderful service! I was a guest o","useful":0,"cool":0},"B-gjCSwOwWWPvVHytzmxtQ":{"text":"Love the fire - the steak Diane was delicious, the bananas foster phenomenal. Everything w","useful":1,"cool":0},"Cxl2EbLaLnzH8CgenPg-xw":{"text":"Came for dessert and had the Banana foster and strawberry crepes. They were both very good","useful":0,"cool":0},"9gu1_zIGz6Sm98FIrSN7pQ":{"text":"My husband and I dined at Brennan's on Saturday evening to celebrate his birthday.  We lov","useful":1,"cool":0},"PfZxmIz5dDYaP5NcjmRXQA":{"text":"We went here on thanksgiving night.\nThe reatuant was very cozy and the atmosphere was nice","useful":0,"cool":0},"9XwIglZMMvp6iTSPxfiGJA":{"text":"Food was good, server not very attentive. First time visiting New Orleans and ate here our","useful":0,"cool":0},"mEwZADpig3YFCfG2MsyApw":{"text":"Great breakfast. A tad over priced, but still good. Turtle soup was interesting, but I did","useful":2,"cool":0},"00tTQjNJ5nITxNFJRiwGeQ":{"text":"This place is top notch. The building is stunning with an interior atrium. The staff are i","useful":0,"cool":1},"i7WasJmich3GxoN1evtENQ":{"text":"Seriously impeccable service. We had reservations for our anniversary, and our travel plan","useful":0,"cool":0},"7iCpOlptGLLK2bCXEZY4_A":{"text":"I had the their Filet, and it was really good. The restaurant was so cold we were in a hur","useful":1,"cool":0},"30hKUOUz9Wmz2hyT-Moo7A":{"text":"If you care about Bananas Foster at all you need to go here! This was the most delicious t","useful":1,"cool":0},"pU8uUpLLCAGfME60JIf_UQ":{"text":"Brennan's is a food venturer's must!\nWe were recommended to visit Brennan's for the Banana","useful":1,"cool":0},"DhIPyEykNA0ZW03My3VFVQ":{"text":"I had the shrimp and grits, I guess I didn't read the menu or website well bc I think it i","useful":1,"cool":0},"et9wnvZrDqIOZmhmDXmISw":{"text":"If u want bananas foster here DO NOT BE TRAVELING ALONE!!! You need a minimum of 2 people ","useful":0,"cool":0},"XI6fYrRlIgGVGgSgeUSpMQ":{"text":"I only had time for coffee and dessert, but the bread pudding and cappuccino I had were bo","useful":0,"cool":0},"c_YXcT3emkz4v_7V6L1YTw":{"text":"Came here for Bananas Foster like 95% of other people. It was pricey ($8 a person for a ti","useful":5,"cool":0},"AfLE_NgwCuP7JQe9rcFj7w":{"text":"So this was an absolutely exceptional meal. As I am currently in town for a conference, I ","useful":0,"cool":0},"8ctfo-fZHB8ndwPWbP00iw":{"text":"Is there a rating for negative stars meaning less than one star?\nYes we had reservations f","useful":0,"cool":0},"C1S3ySvvp-G-HfsFHdVgWQ":{"text":"We came specifically for bananas foster and even though we were caught in a rainstorm and ","useful":0,"cool":0},"gFByJNt0vwfDCy3cJwbIkg":{"text":"My mom and i had the best time here for brunch! The restaurant and courtyard are absolutel","useful":0,"cool":0},"MKKKxcjtXFTSQlhEgRGyAQ":{"text":"Great food and service. We got New Orleans breakfast, eggs Benedict mimosa and coffee... T","useful":0,"cool":0},"zb2K_XAVdGAcl4XwaEK9Sg":{"text":"This place is gorgeous. The experience was awesome from walking in to the end. The host wa","useful":0,"cool":0},"eoQX8WUocwr2DqIbsIRGFw":{"text":"Definitely a place to dine when in NoLa. Great experience...;-) Food and service were fant","useful":0,"cool":0},"sSolymSPtLos1mq8CR21nQ":{"text":"After a hot day, this was the perfect location for brunch. Our party of four was seated im","useful":0,"cool":0},"Fp3caRdWnuBGxL6sFnTybg":{"text":"Ate here on Easter Sunday. \n\n2 Stars for atrocious service. Our server was non existent. I","useful":1,"cool":0},"Wt94LbN5DHk50jGz21x2ng":{"text":"The food was amazing, my issue was the service.  Everything started out fine, but once we ","useful":1,"cool":0},"3EshPr-yI04Pq0CKzJPUTA":{"text":"Oh so disappointed. After speaking with the maitre d' my husband was able to get our famil","useful":0,"cool":0},"lveeLO85Q2Ay2hy1ovv5zg":{"text":"Brunch this morning was great. The chicory coffee is the coffee everyone was raving about ","useful":0,"cool":0},"opPFq3TbPMWpReJv-I-OsA":{"text":"Made reservations for brunch on the recommendation of a few people.  I was immediately imp","useful":0,"cool":0},"2dBG_2IGqUbwVz-F6UHD8g":{"text":"I was very disappointed with the service. I was in a booth, so hard to reach, but if you c","useful":1,"cool":0},"3BbBaP1BZLMVJfke_VNryg":{"text":"The menu is authentic New Orleans.  Very old restaurant with a very nice atmosphere and at","useful":0,"cool":0},"nM9JfxTLwvF29VimEZo0LQ":{"text":"My family had been coming here for years when I was a child, but I hadn't been in years.  ","useful":3,"cool":2},"jU2gDPEA1IMjv1KQ51X88w":{"text":"When you think of NOLA and the \"South\" you think great food and hospitality. Unfortunately","useful":2,"cool":0},"LgfB3G95lScBX-Zlb0DsdA":{"text":"Contrary to many of the other well established French quarter restaurants, they have outdo","useful":0,"cool":0},"X9MwoP7uL9OMQVo8yiNUvg":{"text":"Great place, food is to die for. It has great location, great customer service, unbelievab","useful":1,"cool":0},"rJ72UUN8zlrZ2DivnmOxrA":{"text":"Very disappointed with our visit here this morning. We walked in and were seated outside. ","useful":0,"cool":0},"KZmwf1rlFgAoZIEIm1jYWw":{"text":"Beautiful interior decor! I love the atmosphere that the restaurant gives, very good for a","useful":0,"cool":0},"WIeVmvtXNjoNAU62Y169fA":{"text":"Very classy breakfast. My 12yr old loved the impeccable service and delicious biscuits so ","useful":0,"cool":0},"eCbTJ5pIAdLiyjdXLdVRWg":{"text":"A fabulous breakfast!  Service is impeccable - prompt, friendly and efficient but not hove","useful":0,"cool":0},"M3H83odbdplJSeeOyUmo0Q":{"text":"I anticipated an excellent meal and service based upon word of mouth and reviews. The food","useful":0,"cool":0},"jusE6NMBfTHS50EgiNaIlg":{"text":"They have the absolute best bread ever. I can eat these bad boys nonstop! They serve Cajun","useful":0,"cool":0},"yTWRxfMZg2QkONCTKzKr3A":{"text":"My father fell into a coma the week before Thanksgiving after fighting a long battle with ","useful":0,"cool":0},"K8DBfgqwRGTBxXoUPRu9Jw":{"text":"A must visit place!! Been for dinner, brunch the next day, and Happy Hour before our fligh","useful":0,"cool":0},"7uPUX9AuWKMjFvasgpZRHw":{"text":"Quite the experience. Sat upstairs in the pineapple room, overlooking the courtyard. The k","useful":0,"cool":0},"8mmPLY2ZBmFWESppMMfpMw":{"text":"So the bad first. There is not any. Now the good. This is the quintessential spot you must","useful":0,"cool":0},"sep3m-4d-_KEhPbTdX2fZg":{"text":"Absolutely hands down the BEST breakfast I have ever had. We were at Two Sisters waiting a","useful":0,"cool":0},"rIQfoKAeXBK0dz6KYsFcTQ":{"text":"I loved Brennan's! The service was wonderful and the food was amazing. The restaurant was ","useful":1,"cool":0},"NLiKojDoF8h4LdtmfPZlFA":{"text":"Outstanding service, cocktails and dinner.  \n\nTurtle Soup - very nice\nDrum - Amazing\nCarib","useful":0,"cool":0},"N7-RW7lU3wdp12k3ZC85aA":{"text":"Service Review: I walked 20 minutes in 90 degree heat to try their breakfast and partake i","useful":0,"cool":0},"rnHSpmkUIhdwdNqOavmHBg":{"text":"I am in love! True fine dining, freshest ingredients- rabbit rushing, flesh fried crab and","useful":0,"cool":0},"oVcqhOv8qFs7BsjXN_UENQ":{"text":"Excellent bananas foster, which makes sense since it was invented there. However, the host","useful":0,"cool":0},"zQYrh6j-4OsNh-yLiz953Q":{"text":"Amazing!!! The food was phenomenal and the staff were so friendly and helpful! I went ther","useful":0,"cool":0},"z-NBRwmoV4GTXfY71Phd2g":{"text":"Great happy hour in a classy and sophisticated environment! The crab fries with egg yolk d","useful":0,"cool":0},"HzWMM8HwJbYrbc5jvrUSmQ":{"text":"From the decor, to the staff, to the food, Brennan's is a must-do when in New Orleans. Bea","useful":0,"cool":0},"EmFQiS2fYwdaJenti22KEw":{"text":"NPS = 10!\n\nBest dining experience in New Orleans!\n\nI fell so in love with my dining experi","useful":2,"cool":1},"hRy8po71ERSZwCkFNrjLOg":{"text":"A New Orleans institution...sort of a high tea for breakfast. It's high end with exception","useful":0,"cool":0},"ZFVYqG8KIIpjun8_4wUnPA":{"text":"Went here for brunch in December. I got the breakfast risotto and my husband got the eggs ","useful":0,"cool":0},"0WfER-Or28aX4cg5aCuXBA":{"text":"My friend reserved a table for us for breakfast in the morning. Mind you, we went super ha","useful":0,"cool":0},"wiHq8hKSxagSkzQPwVwabw":{"text":"We visited for brunch with our reservation at 9AM as it opened on a Sunday.  We were seate","useful":0,"cool":0},"tqJ2HZmyXbTCeARJcgT2-w":{"text":"Best breakfast I've had in New Orleans. Had the Baked Apple and Eggs Cardinal. Fantastic!","useful":0,"cool":0},"rKlSrjTqx3DfGAL_cmlJdg":{"text":"Love this place. Great service and beautiful decor. The food is fabulous. The\nRisotto wasn","useful":0,"cool":0},"q5daw72omxKs8p9QyHULkg":{"text":"This is my place of calm. Upscale, beautifully decorated, customer service and staff is on","useful":0,"cool":0},"X7iNYMGfEQRTdkUiK7M25Q":{"text":"Had brunch there.  The food and service was terrific and the decor was beautiful.  Highly ","useful":0,"cool":0},"RpiygBXdkHeNM8FjLBmerA":{"text":"Came here a couple weeks ago. The wine list was one of the largest most impressive lists I","useful":0,"cool":0},"OVDyBNsq2NJ1UMrI8E9muA":{"text":"The food was actually pretty good. The filet Stanley was impressive. But the service for o","useful":1,"cool":0},"xNFINc1BaPOozKDLiOW_tg":{"text":"The food was , yes, so so good.\nThe cold smoked duck was mmmmmmm\nThey get minus one star b","useful":2,"cool":0},"qOmSrwF1Hu3TshcgycjvXQ":{"text":"My grandmother (now deceased) used to like Brennan's, so we had to check it out.  It was a","useful":0,"cool":0},"nSp9FhuDa6XGxy9x9KH-mQ":{"text":"We got the following:\n\n1. Bloody Mary- do it \n2. Gumbo- best gumbo in town (save the turtl","useful":3,"cool":0},"OEaD65AK21s2233XtCVckA":{"text":"Great bar service and happy hour specials!  Check out the Bubbles at Brennan's menu.  Perf","useful":0,"cool":0},"H6wJecggulS8y-Q_Q5zuvQ":{"text":"Birth place of bananna foster.  The dessert was too sweet for me, but the experience of pr","useful":0,"cool":0},"3lJlK1maDoENGLcRx3beDA":{"text":"Our first visit since they reopened. The number of egg dishes has been reduced. I went wit","useful":1,"cool":0},"-cFxQ6LNO8Vs_cmHzm1R1A":{"text":"We went there for dessert after having Charbroiled oyster's and gumbo at Drago's.\nBrennan'","useful":3,"cool":0},"4_FIGw-ZCEZVNws84kvYKA":{"text":"Patrick was lovely!   Very attentive and knowledgeable of the menu. Gave my friend and I a","useful":0,"cool":0},"DJwF5yyypPk2EEx9TUZasw":{"text":"I was really hoping this place was really all it has hyped up to be...and it was! The Eggs","useful":0,"cool":0},"UKunXs2cAgdu2rKYEQhOdg":{"text":"I'm not sure about the price (I attended a private event), but the food was awesome. The b","useful":1,"cool":1},"NWdjzEReDFDuudFy7ScADQ":{"text":"Disappointed.  I recommended this place for weeks knowing that I would be coming to town. ","useful":0,"cool":0},"rkfhMWLpWhphUYd6e0kIgA":{"text":"Important: This review is only for Brennan's banana fosters dessert. The dessert ($10) was","useful":0,"cool":0},"OXWdV_NbO3hl6JlauJ4upA":{"text":"Champagne happy hour on a Friday ask for Randy get the shoulder rub and splurge for the ri","useful":0,"cool":1},"C6h4b0oJw-35-ZDZNCvRNQ":{"text":"We saved brunch at Brennan's for our last day in Nola. Our server was excellent, reviewing","useful":0,"cool":0},"OrGVaKs0J9cAqd4Ns3t5pw":{"text":"We came here for brunch on Tuesday and it was simply awesome. We had made reservations pri","useful":0,"cool":0},"N0sllRKtePUK_DKLkKSJQw":{"text":"We had our pre-wedding lunch here yesterday and it was everything we could have wanted - a","useful":0,"cool":0},"JzG3lvodDBESIN-PcT2GQQ":{"text":"I recently had a wedding brunch event at Brennans in the French Quarter in NOLA. We had it","useful":1,"cool":1},"tiXFUk4yWNTMku2cS6ulQQ":{"text":"As you know from my previous post, I am writing from value perspective.  I love McDonalds,","useful":0,"cool":0},"OfCNiaFqVKzSJFm4M6qQPw":{"text":"We arrived thinking that a party of two could get right in on a Saturday, but we were wron","useful":0,"cool":0},"NKrNV1-QwKtdGXoFnMQJmA":{"text":"So, when I was planning my trip to New Orleans one thing that seemed to be clear to me was","useful":0,"cool":0},"Q0dTlC5R8vYj3MU3P4feXw":{"text":"This was way beyond our expectations.  Service was outstanding but good was best ever!   W","useful":0,"cool":0},"YhBGt4SXqrYpkybDAYCe_g":{"text":"Amazing place. Fantastic experience. The good is incredible and the staff is so friendly. ","useful":0,"cool":0},"XdyAD7z1zbwJjSzX1zeMZg":{"text":"Food is excellent!  Beautiful decor.  Service is very good.  Right in the middle of the Fr","useful":0,"cool":0},"BLqUqr9zCBmVLg2BuxGCFw":{"text":"We had an incredible anniversary brunch here with sharp yet warm service. The famous Brenn","useful":0,"cool":0},"ebylPiic1DcBpQNEeH2g9A":{"text":"Had to try it as we had heard about this icon. I had the French toast. Very good and delic","useful":0,"cool":0},"cAc2JG1Aaol6EELD1nYkeA":{"text":"We met some friends that were visiting from Australia, and I booked a brunch reservation, ","useful":1,"cool":0},"91lQMwOV8fs1O04zL-7NNg":{"text":"We had brunch reservations on a Monday morning at Brennan's, a historical landmark in New ","useful":2,"cool":0},"37slJldNBvX4huFEyW8Wrw":{"text":"Cajun bloody Mary's to start, followed by turtle soup. Eggs sardou with fried oysters and ","useful":0,"cool":0},"1qvx472Mw7IOZEKBsnag6Q":{"text":"Almost that I would gave a place my first 5 stars - but I still have to wait. Definitely I","useful":1,"cool":1},"kE_Jszkeu1uhfOieQ71kRA":{"text":"Sadly, the new ownership and management have brought this New Orleans classic downhill. Wh","useful":0,"cool":0},"069RE6B_W2t9VKg0oD3QyA":{"text":"A trip to New Orleans is truly not complete without Brennan's. The whole experience is a d","useful":0,"cool":0},"IMWOaz2KpPRV8egJSbRa-Q":{"text":"The building is beautiful! Came for dinner on a business trip. The menu is very divine, pr","useful":0,"cool":0},"QMl1snVGWbunuHa2VrNRQg":{"text":"This was an amazing dinner.  Incredible\nCustomer service from the first step into the buil","useful":0,"cool":0},"chYTpSf22CF3U0uJvpnkMA":{"text":"Wow. The service here is impeccable.  Our bartenders, Rudy and Jeanette took the time to l","useful":0,"cool":0},"rcVkekQy5WxY4DXMYg1KzA":{"text":"superbly prepared and artfully presented.  I half expected a security guard to warn \"step ","useful":0,"cool":0},"D5Wyv5KR2gP49w-_9IJA4A":{"text":"Me and wife where celebrating our 25th Anniversary. We ate in different places in the Fren","useful":0,"cool":0},"eKHn8ivV7tuxAfIaBUP6Kg":{"text":"Brennan's is known for their service and for the creative Chef Slade and team. I sat at th","useful":0,"cool":0},"cdoBsgr7OfbZFdtUVN9nuQ":{"text":"We stopped in for dessert and drinks and... it was world-class. They have a bar and lounge","useful":1,"cool":0},"zh_lgnh2PuhPrhIX3oqXTg":{"text":"Long overdue review from late September. The renovated interior looks amazing. Bubbly cock","useful":0,"cool":0},"FSLtB19NSGkERgAeU4QbTQ":{"text":"This place blew us away! We booked to come here to celebrate our anniversary; little did I","useful":0,"cool":0},"29mm27FRwHKjlLrkmhKOlw":{"text":"We have been to this location every time we visit New Orleans.  The food is always good th","useful":1,"cool":0},"xbsfLnmJ2i7c8iOznraV6Q":{"text":"What a great dining experience. Great wine list, exceptional service, food amazing. From b","useful":0,"cool":0},"aqNjUNWaBOQbg0f7HodTeA":{"text":"Absolutely incredible. Staff was wonderful and the most friendly we've had in all of New O","useful":0,"cool":0},"oA6TwKkdn-b_KLaIdSHHwQ":{"text":"Called Brennans ahead to ask about where to park.   Lady rep said \"535 Chartres\".    Went ","useful":0,"cool":0},"QqVGJXQkWNqrbgJbGkkutQ":{"text":"One of the worst experiences I've ever had. I was really looking forward to trying Brennan","useful":0,"cool":0},"g2v2gYaC3Cs_uIhT8PXaOQ":{"text":"Hands down the best dining experience I've ever had! Our meals were all amazing, including","useful":0,"cool":0},"L0qXNotpF3bWMo0P9W_J4Q":{"text":"While visiting New Orleans we went in to Brennan's for the legendary breakfast and it did ","useful":0,"cool":0},"xrT62BHEx588UymmGpa6YQ":{"text":"We went for dinner and tried the banana foster, among other delicious items and sat upstai","useful":3,"cool":1},"d0-ixSKpS5h2u_sLARGNwQ":{"text":"We are so glad we visited Brennan's for brunch. We were welcomed warmly and seated right a","useful":0,"cool":0},"0bbwVDAr8q8neQpVFFA2tg":{"text":"Food was good but not memorable...to put it differently, I expected some mind blowing dish","useful":0,"cool":0},"FrVybrNTkukpykWDrglHmw":{"text":"absolute dissapointment. I get that this is a must try, the restaurant itself has nice amb","useful":0,"cool":0},"1XM3O260St-FF5zzZ5XrAA":{"text":"Excellent atmosphere and great service! Not to mention, delicious food and amazing dessert","useful":0,"cool":0},"I8TwiOa6Xt5WpKOoWygckQ":{"text":"Went for brunch, great service and best of all we could have Bananas Foster in the morning","useful":0,"cool":0},"LptMuSaAn-nEoJ3H8M3dug":{"text":"THEY'RE BACK!!!!  I was in NO last year and so disappointed that I couldn't visit Brennan'","useful":2,"cool":0},"dgZi-2fX574uskg3AxWhEA":{"text":"Service was top notch and the food was fantastic. Steak Diane table side was memorable and","useful":0,"cool":0},"6oi5jFDZgYnkW-edLMqEQQ":{"text":"Expected a little more.  Left the restaurant and was hit up by a homeless man and was gree","useful":0,"cool":0},"wV_DYqKHc7GCrwVBmiOn9Q":{"text":"Went here for birthday. Got the oyster soup and rack of lamb. The oyster soup was very run","useful":1,"cool":0},"TEqJey86gMlPEF1WTrofuQ":{"text":"This literally is the worst restaurant experience I have ever had. I have managed restaura","useful":0,"cool":0},"AZ_xpzKYvIRP4cDtno5N2Q":{"text":"I really, really wanted to love this iconic restaurant but just couldn't.  We arrived for ","useful":0,"cool":0},"ZZkQccrKN7JbSDIsCOCpIQ":{"text":"We had dinner here during Mardi Gras weekend. We were happy to get a reservation, yet disa","useful":1,"cool":1},"xXABiwJDOulWboXmqNALew":{"text":"Very pricey, but the food was delicious. Great atmosphere and service. Definitely a nice s","useful":0,"cool":0},"_5cZlyAN5H-ffLcVMQ4cFA":{"text":"As I approached the restaurant for my 7pm reservation, I didn't see a soul in the dining r","useful":0,"cool":0},"HruZ5GCEBfUbml3hqgfQmQ":{"text":"When planning our trip to NOLA I had made brunch reservations at Brennan's. As we made mor","useful":0,"cool":0},"2YNaJ4n3I6ijuW-jmwWAxg":{"text":"I love coming here for Bloody Mary's when I'm in town. The customers at the door always si","useful":0,"cool":0},"sdSLlsykbCzwx0OnueIcqw":{"text":"The banan foster here might be the best thing I've ever tasted for a dessert. After a very","useful":0,"cool":0},"eT2ySEI24ob9TM7mA1rk0g":{"text":"The most delicious expensive breakfast I ever had and it was damn worth every penny!! Eggs","useful":0,"cool":0},"gMoscsvl7e88LateEd2iZg":{"text":"We recently visited Brennan's with a small group while on a business trip to New Orleans. ","useful":1,"cool":0},"VYRyftURHqzS8PjkyyuQ4g":{"text":"Upscale and lovely.  The brunch consists of many sumptuous versions of egg Benedict with a","useful":0,"cool":0},"XtuXFYQNRakJUiN5O2zJTA":{"text":"Very good. I truly wish with the change in ownership, staffing, etc would have provoked an","useful":1,"cool":0},"C6XoOFKAxaWBEa_SyKdl3A":{"text":"Came here after watching Ella Brennan's documentary and wasn't sure about how the food was","useful":0,"cool":0},"XdtRIAyrubrHYDudyZ-w2A":{"text":"We had breakfast at Brennan's this morning. What a fantastic experience! From start to fin","useful":0,"cool":0},"DFLuGj6_zOAN8L8575VLCg":{"text":"Brennan's is a solid choice for one of your dinner selections during your stay in New Orle","useful":0,"cool":0},"bCuS7OdsWJ6u-uNl_2VcdA":{"text":"Had a lovely breakfast on a hot humid weekday.   Beautiful cool room but service seemed be","useful":0,"cool":0},"EvmFWM-4Z_g4YJbWK_MHBA":{"text":"I came to Brennan's for a bridal luncheon. I was immediately escorted upstairs. The privat","useful":1,"cool":1},"dWWP4KPSL2ORPYjii5CTXw":{"text":"We had thanksgiving dinner here.  Fixed price for a 3-course meal.  I had the salad with f","useful":0,"cool":0},"Ci0DVRMXqambBwaB4ijYUg":{"text":"Worst meal that both my husband and I has our whole week in the city on vacation! Our wait","useful":0,"cool":0},"-x3pSTedAX4pIkjYUhln3Q":{"text":"We visited Brennan's on Royal St. on Sun. evening to celebrate our anniversary. Turtle sou","useful":0,"cool":0},"wn1jGN1iizIIlfUBD_9SaA":{"text":"This place is special. I entered on a cold evening and was warmly greeted at the entrance ","useful":0,"cool":0},"-ovfTJnFkH32Wk01jrzlNQ":{"text":"We went for breakfast on Saturday during French Quarter Fest. The front room was lovely bu","useful":0,"cool":0},"mdw4gYPGod8O2cMa1KSJxw":{"text":"Everything was awesome.  Almosylt too full for dessert. BUT.. Brennans invented Bananas Fo","useful":1,"cool":1},"BPEezHGuEW2Qi8wN8VTOTQ":{"text":"Delicious brunch food and the home of the banana foster. Our server John was a joy to be a","useful":0,"cool":0},"6xIDLlvxDElKuypiY7FbvQ":{"text":"As a local from NO I have to say that this was the worst meal that I've had in a very long","useful":1,"cool":0},"3sNXETgdRwcWvq14iNEJvw":{"text":"The banana foster was made at the table and not too sweet.  The egg sardou was super good.","useful":0,"cool":0},"8IbCLAOU6YNerNflbRYSQA":{"text":"The birthplace of bananas Foster and still incredible. We hosted 49 people for a special d","useful":1,"cool":0},"EnNnDvHlrRGvAaWiJeY84g":{"text":"I'm a newbie to NOLA food scene.  As a consequence, I wanted to sample the Old Guard. The ","useful":1,"cool":0},"xLLM1A3vjIjPKh8kGS_1Tw":{"text":"My husband and I had brunch here and loved it! Would like to try it out for dinner also. T","useful":0,"cool":0},"E5lQAebbLY8GMLeAVvvy0w":{"text":"This was the highlight of my food experience in New Orleans. Came here for dinner without ","useful":0,"cool":0},"xWbqWmBUAjLbN7oPxSenNA":{"text":"Just finished my meal at Brennan's.  If anyone wants to experience fine dining and extreme","useful":0,"cool":0},"RontuzseOEvtkH6pxXIzAg":{"text":"The service at Brennans was good as was the atmosphere, but this place is not worth the mo","useful":0,"cool":0},"XThbIPjsizpKzibP67iVag":{"text":"My husband and I were here for an early valentines dinner and Eric started our night on it","useful":1,"cool":0},"kZuudB1bg851NIIEXY08IA":{"text":"Got to be honest...didnt love it here at all. The gumbo was eh and the oysters were greasy","useful":1,"cool":0},"6yT5JzvRq2FXzhsdPIqBlg":{"text":"Had the rabbit, turtle soup, and other stuff that I can't spell.  They treat you well and ","useful":0,"cool":0},"EwvM4wdaivnJtlrxyvUX7Q":{"text":"Let's start with Eric, Jeannette and Brittawnee. Oh yes, we do love them. Then, there's th","useful":0,"cool":0},"jEUh9FkKh3utdlXLD08PEg":{"text":"Had the most wonderful time at Brennan's last night.  Tending to 13 of us was no small tas","useful":0,"cool":0},"kotl2cmJgp0hf0SJPH7n1w":{"text":"Patrick and Eva made us feel like royalty! We are celebrating our anniversary and Brennans","useful":0,"cool":0},"rftAjRohz2BWKqNYZ-VD3g":{"text":"My grandmother took me here for brunch and I absolutely loved it. She actually had her wed","useful":1,"cool":1},"Z7ADbhTg5xWGibOazvuJEw":{"text":"Had Thanksgiving dinner there. Good was great and service was even better. Very pricey but","useful":0,"cool":0},"qw2-hFoJgkMC4_rMIBzDEQ":{"text":"Very disappointing, had a hard time finding anything on menu that was interesting and my v","useful":0,"cool":0},"Z2HW3-bhv_JY1ZtfeGR6yA":{"text":"Possibly one of the best meals of my life. Every single thing we put in our mouths here wa","useful":0,"cool":0},"WTZfJRze7RsxypgQxsW2Gg":{"text":"Big mistake to host an event at this establishment. We hosted an event for a reunion and w","useful":0,"cool":0},"emg-tHuRxtjmH7DfH8rxxg":{"text":"We loved this place! Our group came here for Brunch on a Sunday to cap off our NOLA vacati","useful":2,"cool":0},"oRX7438alXHbZw2Y-xONpA":{"text":"Excellence from start to finish! \n\nWe enjoy the perfect service all the way through here a","useful":0,"cool":0},"hlXplFouK5oY4IDQffJUbQ":{"text":"We stopped in here to have a wonderful meal but decided against it and just have a cocktai","useful":0,"cool":0},"fOt4NZgRCvMYCUOiZfTMZw":{"text":"There's a lot of really good restaurants in New Orleans. I think Brennan's has gone down f","useful":0,"cool":0},"38TflEe00ymhOk1ycvxZLQ":{"text":"Meh- \n\nOur appetizers were delicious- octopus and lobster dishes both good. Then came the ","useful":0,"cool":0},"6YzMR1v1lErgZpoWTsy0fA":{"text":"The Champagne Happy Hour is baller! I've worked across the street fromBrennan's for two ye","useful":0,"cool":0},"3k4aMXlskJZ0GlbPtRuNMQ":{"text":"I was told I \"HAD TO\" come to Brennan's for breakfast while in NOLA.\n\nI didn't have a rese","useful":0,"cool":0},"whZxeMiCRM9dXGc16jf5Hw":{"text":"If you want to feel like Julia Roberts in Pretty Woman when she goes shopping on Rodeo Dri","useful":0,"cool":0},"DkkqsBNIguaNQpuUoVTRJg":{"text":"We went to Brennan's for brunch on our last day in New Orleans and it was the best decisio","useful":0,"cool":0},"3NwwJGaIwzCOkiDulEvNTA":{"text":"It's okayyyy. Here's the deal - I think this place is having an identity crisis. They are ","useful":1,"cool":0},"gWeW6Fz0yRQcVQnjVCN5Jg":{"text":"Came here just for some cocktails. The atmosphere is really nice, good for date night. The","useful":0,"cool":0},"5TkdsDxt9PjERWRQ3MgUbA":{"text":"Amazing food! We had the filet mignon cooked table side with fingerling carrots, carameliz","useful":0,"cool":0},"7eXbuKlM2T5npRMBzWoHpw":{"text":"We went for Dinner, June 11, 2015. Since it is fine dining, we were hesitant to bring chil","useful":0,"cool":0},"TNOf1koB2EkSm4OHRD3Tvw":{"text":"I'm originally from Louisiana and have spent a lot of time in New Orleans, but I'd never h","useful":0,"cool":0},"kXXXbrWgMaeB_xQm35gNxg":{"text":"Upscale with relaxed, friendly atmosphere. Delicious cocktails and bar snacks.  Returned s","useful":0,"cool":0},"EVRTeBcgmiE5kvEUT78sAA":{"text":"Here in New Orleans for the week and decided to stop by Brennan's for breakfast. The resta","useful":0,"cool":0},"VE1UcF4Bl2rmtrzWIWyeeA":{"text":"Wow, this place is excellent. Food was delicious and atmosphere was terrific. We had Brunc","useful":0,"cool":0},"HYsWeqLMfguXbrEHY2qXOg":{"text":"Food was a solid 4/5\nService was a 1/5\nI am going to round up, since I am feeling more gen","useful":0,"cool":0},"OIf0K9qsaKpKQtA7-dCXSQ":{"text":"Came here for the bananas foster and we are so glad we did!! It was delish and a true show","useful":0,"cool":0},"XcUP0yvMRpH0nKoTU7IjXg":{"text":"I feel awful for writing this negative review, because the host stand and the bartender we","useful":1,"cool":0},"fLbiE-80TxExBGCGQdcp4w":{"text":"Very neat ambiance and amazing food.  Bananas Foster were delicious and the presentation w","useful":0,"cool":0},"ce6ZR2ILuIJ1fhNu5kqbfQ":{"text":"Still absolutely epic meal. I had the RABBIT RUSHING fried Mississippi rabbit, creamed col","useful":1,"cool":0},"4av7yMKq9JZ00X0H2ArgJw":{"text":"Sorry, went there on 3/28. Everything that should have been hot was barely warm. The coffe","useful":1,"cool":0},"o4gCHkTb6zkYvfICs9Lo9w":{"text":"Was in town on a work event & this was the first dinner of the trip that I was attending. ","useful":3,"cool":0},"U1HtwnBAl0siQkFzrSk0xQ":{"text":"Where do I begin?! If there were more than 5 starts available Brennan's would definitely g","useful":0,"cool":1},"9mr5S2z9P5LGsfe1nTAUew":{"text":"Wonderful!\n\nThe atmosphere is amazing, the rooms lovely, and the service impeccable.\n\nThe ","useful":1,"cool":0},"hEH9SM0IK-2qLTy964cuzQ":{"text":"Brennan's is so yummy.  I can't wait to go back here!\n\nMy five friends and I booked a rese","useful":0,"cool":0},"EC1qn26leDmX_B3cUw_5VA":{"text":"The atmosphere was fantastic, the servers were kind and knowledgeable and the food was ama","useful":0,"cool":0},"2_ejptKTg4u10lUhJeqsnw":{"text":"I was visiting Nola for spring break and came here three out of the four days I was in tow","useful":0,"cool":0},"DsGMMU3o8hWqioIPojOSIQ":{"text":"Drinks here are fabulous and well balanced. We came back a few nights later and had dinner","useful":0,"cool":0},"o2TfDQx_N3nPosWHwAC0Vg":{"text":"This place has the best costumer service ever! I never once had to ask for a refill on my ","useful":0,"cool":0},"BDHgUySQOIK8zvS2SX_ZvA":{"text":"We had a great brunch. 3 course kids menu and chef inspired vegan entree made it memorable","useful":1,"cool":0},"6Olo6gtSoovCQDSRgqcYhQ":{"text":"On my recent trip to New Orleans we ate at Brennan's twice. Once for breakfast and the oth","useful":0,"cool":0},"2HPGQcj624QFPXpcoq_Yrg":{"text":"We stopped here right before we headed to the airport. We shared the rabbit rushing which ","useful":1,"cool":0},"k30-dSG8CMtQs4NcZyPyjA":{"text":"Came 2/7 for breakfast. They brought Stevia (their only artificial sweetener) with our cof","useful":0,"cool":0},"z8Vqf_eEfXnKQOOjQeNAXw":{"text":"We stopped in Wednesday morning for brunch before leaving town. Adair and Todd were our se","useful":0,"cool":0},"j8e-RPF0aBn-vxslKxGU5g":{"text":"My sister and I were craving a turtle soup moment so we made our way over to Brennan's bec","useful":0,"cool":0},"kaEpb52pNngjFGj_95jvJA":{"text":"Sensational dining experience. Staff were extremely knowledgeable about the menu. A server","useful":1,"cool":1},"mQ62-Awx3bgQemqAbDqFeQ":{"text":"We loved the ambiance and the food was excellent.  Our server was very sweet and answered ","useful":0,"cool":0},"YxWocZmvydGQaDI8tbGQgg":{"text":"I was SO excited to brunch at Brennan's when I had a trip planned to NOLA and just before ","useful":4,"cool":1},"_7Ti9cuRay-3dayJ21HXPw":{"text":"We came in for the Banana Foster dessert and a drink, ended up having a little food as wel","useful":1,"cool":0},"FIG5jSKxKy5H8ebMQeogNA":{"text":"I wanted to rate this restaurant higher but there was a lapse in replenishing water at the","useful":0,"cool":0},"SDSihWrdkkDEjMoNRW01AQ":{"text":"This place is my new favorite restaurant in New Orleans. The food is absolutely amazing. W","useful":0,"cool":0},"mVmT0G_FfmBwDYxNiUO6kw":{"text":"Wasn't impressed. Food was ok and nothing special. Maybe I'm getting tired of the \"New Orl","useful":0,"cool":0},"qe3zfSz5Q8mlxNmnzO3uig":{"text":"We visited Brennan's in the French Quarter and our experience was incredible.  We made res","useful":0,"cool":0},"k3OCb_lforg6dgGdMv4uaA":{"text":"The service was discouraging, after reading several good reviews, we mean really good revi","useful":1,"cool":0},"f2m1FUWtcgCIHCyM9PNFnA":{"text":"Horrible service. Made a reservation for 9, came at 8:55 and didn't get seated until 9:15.","useful":0,"cool":0},"GDf67yA7om9WZb5oN8Otqw":{"text":"FABULOUS! !!!! SUCH AN EXPERIENCE! !!!! Must eat here when visiting the Big Easy,  Such a ","useful":0,"cool":0},"7fXNSazlq50MkWfiC8S0GA":{"text":"5 stars ONLY because it's not possible to give them more! !\nWe made a reservation to celeb","useful":1,"cool":0},"P_oZhrnqX0424fPioho3Sw":{"text":"This place was recommended by our guide on our pub tour. I really wanted to try it for din","useful":0,"cool":0},"rntlIQp5MiJBKQOCWLPAXg":{"text":"I can get a little hyperbolic, I admit it--but Brennan's Restaurant is one of the best pla","useful":0,"cool":0},"d9WMzbthhh6vnrMOxQWB2w":{"text":"Wow! It is been a long time since I have been this Wow-ed by food and service...  I  enjoy","useful":0,"cool":0},"k4CXg83LTvWU70l-1CXiIA":{"text":"We went to Brennan's to get the tableside bananas foster after having dinner at August.  I","useful":10,"cool":9},"2WglxTG_v-z6f87yTqQHtw":{"text":"Brennans is a New Orleans tradition.  The service is incredible.  Great southern cocktails","useful":0,"cool":0},"q03YFnIu53MNWs_F-4HWdg":{"text":"This place was FABULOUS. We visited this place in last September for our 2nd anniversary. ","useful":0,"cool":0},"HumUlRejTDam83724d4pVg":{"text":"Went for Brunch on Saturday.  Good thing I booked a reservation, as the place was packed a","useful":0,"cool":0},"lfwzq5nE11-uKStjmsY8BA":{"text":"TOURIST TRAP: We had the Special Easter Brunch that offered a short version of the regular","useful":0,"cool":0},"61giUKrWjVg8_IOBys2l5A":{"text":"We dined at Brennan's for brunch to celebrate our engagement. It was simply outstanding fr","useful":0,"cool":0},"DbM_CgrERH7RAX0vPjjy8Q":{"text":"Delicious food and excellent service. A little too \"old school\" for my particular tastes (","useful":0,"cool":0},"0EHpvaZ3_HzAI2YsQ2LihA":{"text":"Food was ok, but their banana dessert was just perfect (and a fun show!)","useful":0,"cool":0},"mCfgX03hGj4CF4xB0k8T0w":{"text":"We took a chance without a reservation for Sunday brunch. In order to skip the wait, we sa","useful":0,"cool":0},"fJpzr0oBrrHuPf49FQ1DyA":{"text":"Bananas Foster is a dessert made from bananas and vanilla ice cream, with a sauce made fro","useful":3,"cool":1},"6EpwdDWQnlhdcd8eHgx4_Q":{"text":"I came here because someone told me they make good banana foster, I thought I'd give it a ","useful":0,"cool":0},"fvs_67G5oZLpa--6UNk6DQ":{"text":"Not impressed, boo!  I had very high expectations reading reviews and hearing about their ","useful":0,"cool":0},"-bZbBGohqmPHxjnbOyaX7Q":{"text":"I probably had the most enjoyable meal of my life here and will make it a point to come ba","useful":1,"cool":0},"A8RbEJn4H3jShtKUXZmNcQ":{"text":"Huge tourist trap!!! Overpriced (talk $22 for an omelette!) and disappointing food. Our ex","useful":0,"cool":0},"YUbRjKeESamTz8Hy7WqPKg":{"text":"Brunch was fantastic, make reservations. Outstanding service by the entire staff and the f","useful":0,"cool":0},"PB7y6gkVrf8e5Oi6PfXVZQ":{"text":"Had dinner in the bar last night.  Randy was our server and was great!  The drinks delicio","useful":0,"cool":0},"AduKoNagLLuWdZFrwxTaNw":{"text":"Beautiful place, amazing experience. Great breakfast. Perfect location in French quarter. ","useful":0,"cool":0},"aoTtVKGVyFF5COdDryDPKg":{"text":"Excellent service!! Amazing 5 star classy dinner!! Highly recommended for a classy date or","useful":0,"cool":0},"J4ed2ogP5BFI0bVza6eNUw":{"text":"Very classy place. Great service. I had the octopus app and the Veal. Both were excellent.","useful":0,"cool":0},"LIZh1Bu3psF2XKbBNNuOXg":{"text":"Totally worth the hype on food.   Amazing table side prep of  steak Diane.   This dish alo","useful":1,"cool":1},"f8rsAcdyOnJA3sTB5FSi-A":{"text":"Brenna's lived up to the hype was one of the best breakfasts you will have, while deliveri","useful":0,"cool":0},"8n9SpMWU1xPt3UNAOEEM-g":{"text":"We were excited to grab an after dinner dessert and saw on the website that Brennan's is o","useful":0,"cool":0},"AbwCN9wZAi16p45P0x_0wA":{"text":"What an amazing brunch, awesome decor and excellent service. From the mimosas to the Frenc","useful":5,"cool":3},"5wsVTrctA59ayvofr5I4Vg":{"text":"Made a later reservation for dinner. We were on time but still had to wait for a bit. I wa","useful":0,"cool":0},"BPbf8woSiU_E0iuD1MzXWg":{"text":"Was disappointed, heard great things but didn't live up to the hype, not too much variety ","useful":0,"cool":0},"mPY6G2ndIXe3LPOf-x7g3g":{"text":"My husband and I came here for the rehearsal dinner for my cousin's wedding. Everything he","useful":0,"cool":0},"LDWUQ7xSMkcgjxBpJNp_9A":{"text":"I had built this restaurant up in my head pretty big. That being said the food delivered b","useful":0,"cool":0},"xt5INGOLuXRSmIcnDTFCQw":{"text":"Wonderful food and fabulous service. Thomas and Sean entertained my husband and me and als","useful":1,"cool":0},"9V9PNFLJ701kxYg2yD-xIQ":{"text":"I didn't have any trouble getting seated here by myself without a reservation, though I di","useful":0,"cool":0},"wu7gwggS3tMLdYXiQpWYOg":{"text":"The service here is excellent and very quick- our waiters were super nice. The cheese blin","useful":0,"cool":0},"bIvFeH-N_ICvtx5JICYcJg":{"text":"My husband and I came here for oysters, steak Diane, and bananas foster.  Wonderful cockta","useful":0,"cool":0},"65hsOpz-4QAw9QZeiaUDzg":{"text":"Brunch:\nComplimentary bread and butter. The bread: French and messy. We were told they use","useful":1,"cool":0},"MZuqs3QZ0aqdDTqJEz6PYw":{"text":"Amazing!!!!  Our captain was John and Reggie was his team and they were amazing servers an","useful":0,"cool":0},"oWLVgtBSGojsebuQm8OPLw":{"text":"Delicious food, horrible service. It took us 3+ hours for 4 adults ad 4 teens to eat. It t","useful":0,"cool":0},"pVJvTLT_eHf-WrF4rtsmzA":{"text":"We went in for Brandy Milk Punch the day before we left town and was talking with the bart","useful":0,"cool":0},"O_KXGE5Bu7V02OiOTanqnQ":{"text":"Beautiful location, gorgeous patio area, in the French quarter, great happy hour with Cham","useful":0,"cool":0},"1Sttb-he09IR8Mkq_FX7EA":{"text":"This is overhype and overrated restaurant in every way.  Given the cost one would expect f","useful":1,"cool":0},"uMPjgGF8HWWdwrlT2RQ8mA":{"text":"We ate here twice on our four day trip and it was our absolute favorite. The first day we ","useful":0,"cool":0},"95fuM9x4MjnPDVYH3ZJfXw":{"text":"Love the atmosphere and old school classic new orleans style. Unfortunately the rest of or","useful":1,"cool":1},"E20QLSQnsgyRo9Wh92-9rw":{"text":"The 5 star rating is for the dessert, service and atmosphere - we did not eat dinner here.","useful":0,"cool":0},"Y3iErsTlpdoKzoZSe7yZ9Q":{"text":"We went there for brunch on a Sunday. The service was beyond amazing!  The food there was ","useful":0,"cool":0},"8aISPoG-QTGj_DfFRP3DjA":{"text":"Awesome breakfast, I had their \"Soft Shell Crab and  eggs. Just in time for International ","useful":0,"cool":0},"U89BiJBuNCMgZ1uJr-0HPg":{"text":"The food and service was great.  My only concern is that I thought it was a little over pr","useful":0,"cool":0},"2_hGmfYkMifAKOWCXRrckg":{"text":"This was a totally incredible experience.  We stopped for breakfast on a Sunday morning wi","useful":0,"cool":0},"ySQQMyJWnPRJncsRwo4CIQ":{"text":"Have heard so much about this place, decided it give it a shot on my first trip to New Orl","useful":2,"cool":0},"ZzcsFL_P7qZ6AaYlTDBw6Q":{"text":"Bananas Foster at Brennan's could be the best Sunday morning breakfast in New Orleans. Try","useful":0,"cool":0},"ZTI5Y2w3GYROrYvemUddOA":{"text":"The prime rib special was excellent. Highly recommend if it's available. Grapefruit app wa","useful":0,"cool":1},"ZeBM-fVJmPI0XvU9gAUoCg":{"text":"Brennan's is back!  Recently re-opened after a year-long renovation.  For the holidays the","useful":1,"cool":0},"fhItWsqyh4tvSCAX3FdLqQ":{"text":"Food was very good, and the atmosphere on the outdoor patio was perfect. The service was a","useful":0,"cool":0},"anNL1SUNclYW7W3V4WUF7Q":{"text":"Are you a champagne fan?! If so this place is for you! Bubbles at Brennan's is M-F 2-7. Al","useful":0,"cool":0},"iFrZnBpKlsnqp_5xPOJaFw":{"text":"I started with the seafood gumbo, the grits are mouthwatering and the bananas foster is de","useful":1,"cool":0},"UiPE0CleHwV6Qn5A4kwQmw":{"text":"Wow! What a great NOLA experience!\n\nOur first time in town and I'm so glad we came to Bren","useful":1,"cool":0},"VljZZnCNT5OALBNY_Kcfnw":{"text":"When I first entered Brennan's, I was afraid I wasn't dressed up enough. It feels very pos","useful":2,"cool":1},"52UsBIJd_7S-wrANpFzLVQ":{"text":"Absolutely amazing brunch. Great service and the food was incredible. Highly recommend thi","useful":0,"cool":0},"vGO2oWuGu2fNV_U2htbGVA":{"text":"Woke up bright and early to rush in for Sunday Brunch.  Why?  Because we went straight to ","useful":0,"cool":0},"pER94gNQqam0_alOwQYdLQ":{"text":"Ducked in here to get out of the rain, and surprise surprise it's the same place my wife g","useful":1,"cool":0},"3ie0uzai8eaPjtUIod54yA":{"text":"First of all, I'm writing this review as a fourth generation New Orleanian and 30+ years o","useful":0,"cool":0},"-RFV_2pTR_EWRyzGZygQlw":{"text":"Came here on the recommendation of two locals we ran into at the Sazerac Bar. We saved thi","useful":0,"cool":0},"EW29WbObkHKPM-5R38JRnA":{"text":"The service at Brennan's is excellent. The ambiance and decor is wonderful. The staff and ","useful":1,"cool":1},"HihNeoStSyKZ2rQTVYOJIg":{"text":"We went for brunch while in New Orleans and we were not disappointed. The service is amazi","useful":0,"cool":0},"YPjhSQHB8uO93lrGByLlOw":{"text":"Impeccable service, top notch food, and romantic ambience. The red rooster royale cocktail","useful":0,"cool":0},"DcFJSRSLIXSRmSlXAWjbvw":{"text":"Getting a reservation was hard enough but to have lackluster food is another reason I won'","useful":0,"cool":0},"4GhhKr5ihdfLlxFjScI_Dg":{"text":"Absolutely amazing! Brennan's lives up to its reputation of its world renowned notoriety f","useful":0,"cool":0},"WinQE_rc-PKDCFo_m3R73w":{"text":"This place is bursting with New Orleans charm. Great service, good for big groups and grou","useful":0,"cool":0},"VBLmLppF49RwdRPRf8kteQ":{"text":"I came here for an event so we had a set menu but they were dishes from the menu. I though","useful":1,"cool":0},"k1LHleca4eWQK3XjyFXLoQ":{"text":"Went to dinner with friends after having been here many years ago.  It did not disappoint.","useful":0,"cool":0},"0dzjrU6fwtcYmLaZZ014TQ":{"text":"One of the worst before dinner experiences I have ever had. A local recommended this place","useful":0,"cool":0},"9-jlmco8h9_sGypgiVassA":{"text":"I had reservations for three weeks building up to my trip. My guest and I were rudely decl","useful":0,"cool":0},"eUmN6vSnUL8I5po6QHYEyw":{"text":"Great restaurant and super tasty food, quite unique and very romantic. We had a great time","useful":0,"cool":0},"tnphnW5z0IARZnF9Fc-9RQ":{"text":"We were so looking forward to having a truly pleasurable dining experience our first night","useful":0,"cool":0},"jjqcu8fpIzAYcvrWhSC5KQ":{"text":"Gorgeous restaurant with very tasty food. I tried some local dishes (Gumbo, Jambalaya!).  ","useful":0,"cool":0},"5GR0Eh02Zc5GpME67NEpqg":{"text":"This is one of the most famous restaurants in New Orleans and with good reason: the food i","useful":0,"cool":0},"D94PqypmlLjxsOOO1OREMQ":{"text":"Highly overrated for breakfast. Not crowded at all - we arrived at 8:30 a.m.. Allowing for","useful":0,"cool":0},"qggIvSfvLlgCQx7eIyt2ww":{"text":"Still my favorite place since I was 20. Excellent food. Wonderful service. Excellent drink","useful":2,"cool":0},"_EWi6le6y_oit4Pl6U37oA":{"text":"My mom and I had Christmas Eve dinner here.  I will say the food and service were good but","useful":0,"cool":2},"YlX-rNB22N6y_ej6GCGkYw":{"text":"Wow...!!!!!!! Joe, Caleb, and Ty are class acts. They contributed to my making New Orleans","useful":0,"cool":0},"nVuOnUhbMirTx1UaDhxV1A":{"text":"Every time I'm in New Orleans, I make sure to stop by Brennan's. Was in a big hurry last t","useful":0,"cool":0},"QjYqSiYfmZeRBxlLv88UCg":{"text":"Just went for Bubbles at Brennan's, their Rooster Bar champagne Happy Hour. Great prices o","useful":0,"cool":0},"rIcLlX9cKKaFMh1gcNwpLg":{"text":"Food was flawless, service was great and ambiance was uniquely NOLA. We ordered turtle sou","useful":0,"cool":0},"c2mbMfGttUi0snD131xSrg":{"text":"Great food! Great service! Very knowledgable staff. I don't drink alcohol, but they brough","useful":0,"cool":0},"l8ZmxbeyNNQdXhaEKRba9A":{"text":"Amazing food and service...honestly worth every cent. If you're in the mood for a great di","useful":0,"cool":0},"xHfUyJ2oqusm-XH8cdo6bw":{"text":"So delicious! Best meal we've had in NOLA so far. The BBQ Lobster was incredible!! Not to ","useful":0,"cool":2},"S-QdZ_Fx67-GOAMArSZhcA":{"text":"Great service! Perfect for a date... quite costly though and not for the budget minded. Yo","useful":2,"cool":0},"kuud7Ps3gnWUMFBdOAmhwg":{"text":"If you are looking for a classy dining opportunity with great food, service, and wine, thi","useful":0,"cool":0},"hQTNg605gpiwxFQYtiFkbw":{"text":"My husband, 3 kids (4.5yo, 2yo, 7mo) and I had breakfast at Brennan's on a Monday morning ","useful":0,"cool":0},"XA0fZ8bJiRWSaKjBBoDcDw":{"text":"What can be said that hasn't already been said...AMAZING AND FABULOUS, that's why we keep ","useful":2,"cool":1},"KvQkt5678ZVskC1FCTJe4A":{"text":"One of the best meals I had on my vacation to NOLA. Even though we showed up to brunch wit","useful":0,"cool":0},"Xjfz-JGv0SkHsYI052u33A":{"text":"Let me start by saying that I've been a vegetarian for well over 7 years. I don't eat meat","useful":0,"cool":0},"ukP3RgA6cpmxLa8bu8qXig":{"text":"If you have never had breakfast at Brennan's,... your missing out. Expensive as all get ou","useful":0,"cool":0},"aPJBs6KIfQ9JvqhULba-vQ":{"text":"I was so disappointed when I dined at Brennan's. I went the evening of Valentine's Day 201","useful":4,"cool":0},"kFtluG5TzO2QjDNuKBWb_w":{"text":"It's been a while since I've been THIS impressed with a restaurant (one of the reasons why","useful":0,"cool":0},"i0QMfDpXkkrZCnTrDxVQIA":{"text":"We had a larger group private party here and the food, service and pricing were all quite ","useful":1,"cool":0},"b8X9f6LQRloVOSxPRRGXHw":{"text":"The food here is 5 stars! The reason I am giving 4 stars is because of the slow service. F","useful":0,"cool":0},"21tj_Rvxipi6UZYsuHtWAw":{"text":"Great staff, great good, great drinks, wonderful experience. \n\nI had the steak florentine ","useful":1,"cool":1},"vIIQwOwEeHY_WGrgEGMQIA":{"text":"I don't even know where to start with this review... this food was ABSOLUTELY AMAZING. I t","useful":0,"cool":0},"5-rhqsajk1BKVG82ciw21Q":{"text":"One of the best restaurants I've tried.  Everything we ordered was delicious !  Service wa","useful":1,"cool":1},"ri289Yhq2KSzJiLg9drk8A":{"text":"I'm glad Brennan's is back because there's seriously nothing like fresh, table side banana","useful":1,"cool":0},"CLiru_oH7Ajr2IxF4tWNgA":{"text":"We were visiting New Orleans and ate at this restaurant for our anniversary. We loved it! ","useful":0,"cool":0},"DxyF-VCsSnGgvDbpRYMnYw":{"text":"One word: BISCUIT.  Their biscuit is amazing, perfect, flaky, soft and oh-so-buttery.  Oh,","useful":2,"cool":0},"CzMBYIal9a_Hd9m3mF196w":{"text":"I would actually give 4.5 stars because we had a snag with our reservation, but everything","useful":2,"cool":1},"IQpTGOl0S6dH7se2z_l32A":{"text":"EAT HERE. Seriously, don't miss this restaurant. One of the best brunches I've ever had, a","useful":0,"cool":0},"VsN0H1HrrwLqtbqIDJAgxQ":{"text":"Perfect dining experience!  The service was impeccable  with every need being anticipated.","useful":0,"cool":0},"wMqQ4BySM1OGI_cxUUGyKg":{"text":"I regale the kids with a BS story about scrapings from the tomb of Creole Lady Marmalade, ","useful":4,"cool":3},"dAfHXt_yELntwk5xbtP9Jw":{"text":"This was some of the best brunch I've had ever!!! My Eggs Sardis was fantastic with the fr","useful":0,"cool":0},"Xyub4igeq-kEpJsbGP_gZg":{"text":"Brennan's for breakfast, amazing.  We had the egg yolk carpaccio and a few others all were","useful":0,"cool":0},"kv4cOb_G5_UsDxDCf4bFCg":{"text":"One of the best modern NOLA restaurants. Incredible service, innovative menu and a beautif","useful":0,"cool":0},"XBT1x6rj4g2lRGpGN3YoNA":{"text":"If you want a sample of some of the best cooking in New Orleans famous chef lineage, look ","useful":1,"cool":0},"TvV-qj82lCjxlkPRuT21Pw":{"text":"This probably one of the best restaurants I have visited. The food is amazing. Some of the","useful":0,"cool":0},"vtKbiMlqclO952QqiqRRrw":{"text":"We actually looked forward all year to returning to NOLA because of last years dinner at B","useful":0,"cool":0},"CCNwgKyOa5AulBnQiumaqg":{"text":"Sean was an amazing server. He was able to explain the dishes to us and let us have our ti","useful":0,"cool":0},"S-Qo6SZu4jo2jggjnYsd1g":{"text":"This place is iconic. We visited first for the bananas foster and happy hour. The bartende","useful":0,"cool":0},"_aQfECy9mWCROSCVKwcBlw":{"text":"We just came for dessert and the waitress seemed miffed but we had made a 9 pm reservation","useful":0,"cool":0},"DLIHXfI7PwTadA3tQFEPaA":{"text":"New Orleans at its finest.\nFirst class service, excellent food; and of course, the Bananas","useful":0,"cool":0},"njmrkTWBub3WAdB7k63mYA":{"text":"A fantastic conversion of the building from the past to the present. Beautiful. \nHowever a","useful":1,"cool":0},"BUir6tUd38NKVvI_IwEVaw":{"text":"Even though we weren't really dressed for the restaurant and only wanted to try the banana","useful":0,"cool":0},"cc2k8lsGamwtIzUupTynFQ":{"text":"Had a fabulous dinner here last night!  Service was so great - we were in Stephen and Mati","useful":1,"cool":1},"gQvs0fJjjpMf9vAtUrMOSw":{"text":"Best meal I have ever had hands down. Thank you chef rushing for providing me with this. T","useful":1,"cool":0},"SUQmkLUNmFZyDZlRvVCIeA":{"text":"I do not like bananas.  Asked manager as a joke if he could do a pineapple foster.  He tho","useful":0,"cool":0},"t0gsRv3tTnIIXdkgU_APkw":{"text":"Came here for lunch and dinner. They make great Bloody Marys and Sazeracs. I ordered turtl","useful":0,"cool":0},"xdDzz_V8aEesejB_M5gwLw":{"text":"Only giving 4 stars because I have only been here once and need a few more visits to make ","useful":1,"cool":1},"JthVZ0ayj1-9MdjKV9Dn0Q":{"text":"This place was so awesome! We came here as our \"fancy\" night during the bachelorette weeke","useful":2,"cool":2},"5HXw3JZe3IftfDQWVv5icg":{"text":"Having lunch at Brennan's now. I only had a German chocolate torte because I'm still full ","useful":0,"cool":0},"xBZwpzZMBDwTv_F4BL3_fA":{"text":"Was in town for work & took some clients to a lunch on a Thursday. One of the cleints had ","useful":0,"cool":0},"poRfXp5Yg_aMJttRXJRCBg":{"text":"Back at Brennan's after quite a few years, and the food was just as good as I remembered. ","useful":0,"cool":0},"mzza5WGiiJkAMGQWlcI6eg":{"text":"We ate here recently for my daughter's birthday, so a relatively large group. It was one o","useful":1,"cool":0},"4kR8fFwSJhEamqnnxag2Ig":{"text":"Lovely brunch. The food is very rich, and filling. The kids menu could be much stronger, t","useful":0,"cool":0},"J-EhzwCjR5e9Fd_gaTzFag":{"text":"yum!!! brunch time #DIVA style in #NOLA2015 crab chanterelle mushroom omelet, georgia ched","useful":0,"cool":0},"eeYAT63yGIEUzjuMsuI0vg":{"text":"One word for food, wine list, atmosphere, and service...fabulous!","useful":0,"cool":0},"OWg_MN3MetHaAZsnYXGeVQ":{"text":"Food was solid and tasty. Had their broiled oysters with yummy cheesy crust. Strangely eno","useful":1,"cool":2},"QYaCZSD5CWSEU_oucLMSvg":{"text":"BEST BREAKFAST I HAVE EVER HAD!! Why are you still reading this?! GO THERE NOW! \n\nThe serv","useful":0,"cool":0},"LHM78wmvqrrsJX6AUkG0wQ":{"text":"The restaurant is beautiful. I tried the turtle soup and the rabbit because I wanted to ea","useful":0,"cool":0},"DgXen2gOKKv5zXrYAazglg":{"text":"An extremely incredible experience! Service was phenomenal and each person who came to our","useful":1,"cool":0},"0ygat7GL7Dww0MhtNnZlEQ":{"text":"Amazing food and stellar service. Our server was Andrew and he was super knowledgeable and","useful":0,"cool":0},"ujFs_yKyOolQc1JU2yTdYw":{"text":"This is the place that created the Bananas Foster.  Such a fun experience.  Food was great","useful":0,"cool":0},"PwiCXc9JEHX3OeSV8UuwwQ":{"text":"One of the iconic restaurants in New Orleans, I thought I'd try it for dinner. Last time I","useful":0,"cool":0},"LuTQrD0caVhQGt-RSzjjRQ":{"text":"Wonderful dinner. Great wine list. Steaks were well prepared. Chicken outstanding. From th","useful":1,"cool":0},"D-zDtqocX08skZ6x-ZOBYQ":{"text":"FINE DINING, TRADITIONAL NEW ORLEANS\nSuch a lovely fine dining experience. Everything I ho","useful":0,"cool":0},"bEJtYakJ3QdJ03kfFT_6Tg":{"text":"Wow!\n\nAs good/great as it gets.  \n\nAn epic finish for a week in the Crescent City.   \n\nBre","useful":0,"cool":0},"YY5fnjvxYpLrUDh6pZBYGQ":{"text":"Overall just Meh.  The service here is impeccable.  Truly wonderful attention to customer ","useful":0,"cool":0},"OeBRA06OBuh5fZwoNgSi0g":{"text":"Pretentious. Rude. Uppity. Do not go here. We were removed from a table at the bar because","useful":0,"cool":1},"Tj2IqKzewEDygoRFHWgqGw":{"text":"Wow. Just perfection and a wonderful way to end our trip in New Orleans.  Many years ago, ","useful":0,"cool":0},"GnHIX7ga0RP_vNVZPo4X5w":{"text":"Very disappointed with this restaurant. We took friends out for what we hoped would be a g","useful":0,"cool":0},"L-gk-1EgZY3MtvpRkI6sfw":{"text":"The home of the Banana Foster!! My family and I enjoyed the dinner here very much. This pl","useful":6,"cool":5},"gzX4htxGwCOprXg3SIPL8A":{"text":"Outstanding dinner, beautiful restaurant, rich colors and decor, exceptional service.","useful":1,"cool":0},"jdPxfFdn149IdanwF-0W9w":{"text":"Breakfast in their courtyard was the most wonderful experience. The waitstaff was so accom","useful":0,"cool":0},"uWsh_j3HQ1iRGXZ-dBiRPw":{"text":"I'd like to give 3 1/2 stars as the food was good and the service staff was very friendly ","useful":0,"cool":0},"IFcBGKOnyRzdPGuXIixtwg":{"text":"Simply one of the most exquisite dining experiences I have ever had. The food was deliciou","useful":0,"cool":0},"g3hvzfAxvshiUZffby_UDw":{"text":"This was an excellent place for brunch and can dress down. Dinner I think is dressier and ","useful":0,"cool":0},"fdQiPQAXS5xUvdvsCSGjsA":{"text":"Fantastic!  Exemplary service. The maitre de even came to our table and explained the sauc","useful":0,"cool":0},"D4PncMpJSop6lSoIhnR8Cg":{"text":"My mom recommended this place after seeing it on a Best Restaurants in NOLA list. Before m","useful":7,"cool":2},"Q4HpYb95O0lesg6YVawWEA":{"text":"Perfect New Orleans experience. Flawless. Beautiful decor, we we in the pink room, service","useful":0,"cool":0},"8kjoQEoO0xCwl-GzOAPX5Q":{"text":"I have no idea how anyone could give them less than a 5.   \n\nCaribbean milk punch is a ref","useful":0,"cool":0},"F_ZnKUk43O4c4FoHs3dQAw":{"text":"After all these years of coming to New Orleans, I finally decided to give Brennan's a try ","useful":0,"cool":0},"U8Jr7PbJ4kk5j6-pfyjA7A":{"text":"Everything about this restaurant was five-star, from the pleasant dining room, to the supe","useful":0,"cool":0},"Qjv6uJFKMehjdsKYAgcFWw":{"text":"Classic old school\nDining. The ambiance was straight out of Mad Men Era. We had Sunday bru","useful":1,"cool":0},"GK013FE8QbaH3LkLayMEtA":{"text":"What a great place with amazing service.  I had the venison strudel, which was unbelievabl","useful":0,"cool":0},"zoSLx6wUV0Zt6dPWOoqyaA":{"text":"The great originator if Bananas Foster, in fact the other food on the menu is also outstan","useful":0,"cool":0},"MGwQDwytpTab8fSrbkCOfw":{"text":"Atmosphere was beautiful. I was truly disappointed with the service. We ordered appetizers","useful":0,"cool":0},"4sH718Eib6ZsCa15LSiFsg":{"text":"I would go back here over and over for two things: the eggs carpaccio and the sparkling pe","useful":4,"cool":3},"gNOR8JnvClcrZB30UzYbLQ":{"text":"Jamie and Larry our servers were excellent!  Ok she listened when I mentioned to my dining","useful":0,"cool":0},"jSVFOeSsDlbK-DOCagar4Q":{"text":"The first time we came in was with our cocktail tour by Free Tours By Foot with our host S","useful":1,"cool":0},"jMli1byYcW2fuDLYgbwPuw":{"text":"First time back since the remodel. It is still beautiful and has all the charm it has alwa","useful":3,"cool":1},"-33KDsaNfsOdv6t2jmMXyA":{"text":"From the moment I walked in and met the two lovely young women at the front door to the mo","useful":2,"cool":0},"KGRZFc15dcX2QnWxZLLRUg":{"text":"Brennan's was phenomenal. Went here with an executive of a restaurant software start up co","useful":1,"cool":0},"cNgeprjn6rH-MxqZQRJiYw":{"text":"This place was ok but I am not sure it all that wowish.  Yes it is pretty and the court ya","useful":0,"cool":0},"Wo2hnTmRYjzXtAflEQmcoQ":{"text":"It's probably worth it to go here ONCE. The food is good, but you are paying for the exper","useful":0,"cool":0},"y9Z8bbMNonAcnFwR3374Gw":{"text":"I *gasp* took my 2-year-old here for breakfast while visiting the city. We had to try thei","useful":0,"cool":0},"QAGjrpfzMJ3qbk0pIGVzUw":{"text":"Not a good experience. \n\nTo start They make you wait at the bar for your table even though","useful":1,"cool":0},"jfeqv2sQL00FS_qpRpy6Yw":{"text":"Our\"Eatcation\" votes this Brunch the.best.food.ever! \nWe all ordered different items and n","useful":1,"cool":1},"sjNRPsvbBPr__QDXJCRV0A":{"text":"Such a gorgeous location and a New Orleans staple.  My friends and I went here for brunch ","useful":0,"cool":0},"Sm7wnR2wa5zDu8TePbix8Q":{"text":"Seen the reviews so we thought we would give it a try first off this is my 1st review on y","useful":0,"cool":0},"HFqdEZo-9liLpsZj7vxs9Q":{"text":"Great atmosphere with an amazing menu that created a fantastic New Orleans experience.  Vi","useful":0,"cool":0},"diYWe2DdsM-txYgjpP5leg":{"text":"This was my first stop in new orleans for brunch, and it was an amazing experience. Why? I","useful":0,"cool":0},"SgdjEIzrf6KavVaYkJTmTQ":{"text":"It was truly a luxurious, delectable, and oh so entertaining brunch at the magnificent Roo","useful":0,"cool":0},"g3zjvfLJfp4IWAOaycLFbA":{"text":"We had a cocktail at the Rooster Bar. Fun fact each table is actually made of egg shells, ","useful":2,"cool":2},"wOG4tUiMkM5hO9vu1R7j0Q":{"text":"Brennan's is back with a bang!  The renovations are beautiful- very tastefully and elegant","useful":1,"cool":0},"0h3pY8myFnDBFoTVRwuAMA":{"text":"I walked into Brennan's on a whim (I didn't even check Yelp) and figured I wouldn't get a ","useful":0,"cool":0},"923TS-9z6bT9ku8pO3fpRg":{"text":"My most memorable meal of my NOLA trip was brunch at Brennan's and that was after trying M","useful":0,"cool":0},"PgKmYsfQBZgN0w33sLllRA":{"text":"Love the leisurely pace of this brunch. We had the egg carpaccio and it's my favorite bite","useful":0,"cool":0},"8kxVWW6yM8Tv5-x3LJVtqQ":{"text":"Very mixed review of my dinner this week but I felt that I could not give more than one st","useful":0,"cool":0},"NI38awbYnU4XXzSBfcfSWg":{"text":"Amazing service from start to finish, beautiful setting and unbelieveable food. WIll defin","useful":0,"cool":0},"G-jUf2MpXC8xHXz2c0JQiQ":{"text":"A superb restaurant in every way. The service was phenomenal and every bite of food taken,","useful":0,"cool":0},"YFAnQWnK_E50-Gmqqj_OXg":{"text":"We could not leave New Orleans without a visit to Brennan's.  My grandparents ate there in","useful":0,"cool":0},"HBUE0yw2U0mI6iLIIgQEzg":{"text":"This was the best restaurant I have been to in NOLA. Even better than some big fours. I ha","useful":0,"cool":0},"UvP4VfAlYQ1tkxDoOSaHnQ":{"text":"We had dinner on the patio for my husbands birthday.  The service was extremely slow and i","useful":0,"cool":0},"lxf4HM65Y4QGO78eqrBk6g":{"text":"Who doesn't love bananas, brown sugar, and ice cream?\n\nYup, that's all we came for! \nThis ","useful":11,"cool":9},"dxt4ymwVD265qHRx2mwX1Q":{"text":"We enjoyed the cheese plate in the courtyard and then moved to the dining room for Banana'","useful":0,"cool":0},"7_X43kslkvGETK4liPd5lQ":{"text":"Smokey flavoured gumbo... honestly the gumbo in the lobby of the Ritz tasted better\nLobste","useful":1,"cool":0},"lgCwsSwogrCVrmJupIIclw":{"text":"Outstanding dinner at Brennan's. Ordered several appetizers rather than an entree. The tur","useful":0,"cool":0},"2X2MM73t4L4q_KjJsIKZ-g":{"text":"Snooty but delicious. Also expect to feel out of place unless you are +50 years old. The f","useful":0,"cool":0},"xA_DTFMILKtOHolyCgViig":{"text":"One word: Disappointing. Another word: Waste\n\nThe only good things there are the bananas f","useful":0,"cool":0},"mjhpVgYBNdtT6CLas2qMJQ":{"text":"Brennan's came as a recommendation and was pretty great. Kinda upscale as far as $ & wardr","useful":0,"cool":0},"ftN79_LD-paoXhbTfBvScw":{"text":"This place was spectacular. We went for my 30th birthday and the service and the atmospher","useful":1,"cool":2},"rMcVPNXeTFvehExMRzzAAQ":{"text":"This place was not great. The majority of the food was not great. The foie gras was on poi","useful":0,"cool":0},"UVGSqQzskrOia9IKMHTZDg":{"text":"A very unique experience for brunch!  Beautiful atmosphere and a great opportunity to sit ","useful":1,"cool":1},"cNL1S8ZE_GGzz-_MKB1A-g":{"text":"Food:  EXCELLENT!   Everything down to the sides was \"lick your plate\" good.\n\nAtmosphere: ","useful":0,"cool":0},"3aQwPvjieg0YPVpg38tFEQ":{"text":"We came here for brunch and it was truly a special experience. The dining rooms are huge a","useful":0,"cool":0},"ax6_ED-K20EH0oJNBRdm2g":{"text":"The food can't make up for the poor service. Every minute from the time we sat down until ","useful":0,"cool":0},"cANqnheW7j34UEdGheCYjg":{"text":"Came here with my bachelorette party for our last dinner in NOLA and the food was phenomen","useful":0,"cool":0},"bg1bVOn8X0gPx0cGns9fVg":{"text":"Self important and expensive. My party of 8  and I were disappointed with the service whic","useful":0,"cool":0},"RYb07_prvur6oze2UrDTaA":{"text":"We went to Brennan's last night which was our first night in New Orleans!  It was a terrib","useful":1,"cool":0},"nGA66xmqpTMctD3KAu64_Q":{"text":"We had the eggs Benedict, eggs sardou and the french toast. They were all good but not as ","useful":0,"cool":0},"gQULX16xfJO5HDZK4Qql-A":{"text":"We are on or last night here in NOLA, and came in at 6:10pm for the happy hour we have hea","useful":0,"cool":0},"6Ff9FD2hr5SD_Scc5JsAZA":{"text":"From reading all the reviews, it may appear that our experience may have been on outlier. ","useful":1,"cool":1},"f4XirU3no5syTNOOjzKmww":{"text":"Wish I could give it 6 stars. We came here for Sunday brunch. No reservation but no proble","useful":0,"cool":0},"9YFGuZdKJ2XATFid3uYUXg":{"text":"Must try brunch place in a historical landmark. Brennan's really held up its reputation fo","useful":1,"cool":1},"ht-aZPfoim2vySIihKWTew":{"text":"We wanted to have Bananas Foster from where they originated. SSUPERB.We didn't have reserv","useful":0,"cool":0},"zU95XwPju-vdTTOMRF4soQ":{"text":"Brunch here is A-Mazing!!! Came here on a gloomy Saturday morning while visiting the Big E","useful":2,"cool":5},"VakoXZ_8aHXb38iw2_40uQ":{"text":"The evening at Brennan's exceeded expectations.   The three course meal was superb.  We st","useful":0,"cool":0},"lwTwDJOjRWQonAp-TBhVdw":{"text":"Long story short, you gotta hit up Brennan's if you're in the French Quarter. By far one o","useful":4,"cool":2},"7F_YWTU9CVMwy76RdlaMzQ":{"text":"The food took an hour and 45 minutes to come. When the food finally arrived, my fish was b","useful":0,"cool":0},"5-9uU9m9PzoRtfpW-43XEA":{"text":"Pricey but well worth it! Great food and service! I highly recommend experiencing this pla","useful":1,"cool":0},"gHR16kSZ1FP-x1uT-QBD8Q":{"text":"This is the famous birthplace of the Banana Fosters dessert but it is way more than a one ","useful":1,"cool":0},"PwBG-jz0RLYwstTRrUP71Q":{"text":"One of my favorite meals. So charming and elegant. I can't remember what I thought of the ","useful":0,"cool":0},"6EdOJp77bRtdfLbQjMGQRQ":{"text":"Food was awesome, and the place was beautiful \nWe had a reservation at 12:00 and when we g","useful":0,"cool":0},"22z9QqS2imgQPtOM94CKYw":{"text":"Brennan's far exceeded our expectations (and they were high to begin with). The atmosphere","useful":0,"cool":0},"ykYFa0IFcN3IL_PYB7ykSQ":{"text":"I loved this place. It was honestly magical. Great energy, beautiful spaces, amazing food.","useful":0,"cool":0},"UydxFqi0vCbcKwvdGvg9jw":{"text":"I'll start off by saying I never really bother leaving reviews since I expect most stuff t","useful":0,"cool":0},"efCc-KrSRsmr5BvEt_5CCw":{"text":"25 min to get our reserved table.  10 min to get service.  20 min to get coffee.  Lost or ","useful":0,"cool":0},"wwhnL2bsia5HiPjJB9zEdw":{"text":"Brennan's restaurant turned out to be all I could ask for and more for my wife's birthday ","useful":0,"cool":0},"qDt1i1CRjX6rQYukNgKxlg":{"text":"Glad to see the old New Orleans institutional classics still got it. \n\nHad a very nice mea","useful":0,"cool":0},"r0OjFvIqppMxqR3TA3IJ9w":{"text":"For our last night in New Orleans, we wanted to go out with a bang. For a \"fancy\" restaura","useful":0,"cool":0},"O66ozA48B34r_bbpc-e6FA":{"text":"We came here primarily because they are known for their banana fosters (dessert). Brennans","useful":1,"cool":0},"qY_H3y2XcEJ_ycQ5IjvGDg":{"text":"I've tried this place on at least 3 occasions and every time I leave just a little bit dis","useful":0,"cool":1},"caSawQ8XlOHk_hzhhZHEjA":{"text":"This was our splurge meal for our honeymoon. And it was a very luxurious meal! The wait st","useful":0,"cool":0},"KghIVeG3mH6IkazfVTgErg":{"text":"Randy was the absolute BEST SERVER!!!! His kindness and attentiveness really made our expe","useful":1,"cool":0},"r3scIULglUevqFgueDDE-A":{"text":"Everyone says breakfast at Brennans.   There is a reason for that.  Even though I just had","useful":0,"cool":0},"-LRAcs2eS6mvslM00vBiOA":{"text":"One of the very finest restaurants in America. Fine dining, fabulous wait staff, old, clas","useful":0,"cool":0},"vd42nzQXu0rNC-0YGhd59g":{"text":"Brennan's was a sublime experience. I went for Breakfast. I left a happier man. Eric my ba","useful":0,"cool":0},"ghbchJn60FAX4DAbpYsKrw":{"text":"Best breakfast in New Orleans! Start with the egg yolk carpaccio. You won't be disappointe","useful":1,"cool":1},"AqI7f_T7sxWHdgcmsKgN2g":{"text":"awesome place ! all the waiters are great , you would have 4 at once . They will serve you","useful":0,"cool":0},"p9CylAuL0oZK-9Iqzv0eKg":{"text":"El lugar es bonito y el servicio espectacular pero la comida nada que ver. Los nombres que","useful":0,"cool":0},"8FAJjSBIIgLDrBKhNQwWTA":{"text":"If I could give a sixth star, I would. This place didn't just live up to the hype, it beat","useful":0,"cool":0},"doB5-51N6RlPfXjWDcsthw":{"text":"My favorite restaurant so far in NOLA.. beautiful setting..servers were awesome..loved the","useful":0,"cool":0},"ioLzKJcE_dGJ2T1QUG2rPg":{"text":"My good friend and I went here solely for the Banana Foster and it was definitely worth th","useful":0,"cool":0},"NdzJMWBgdFmv5kjmP3CGgg":{"text":"We had an excellent evening. This is a great place to celebrate special events. We shared ","useful":0,"cool":1},"AFeIBKF2OubbxsVv4tBWDg":{"text":"I called to make Christmas brunch reservations months in advance and was told that they on","useful":0,"cool":0},"DSQTrfifLdKOmw5R2kq65Q":{"text":"Such a nice place - especially when most of New Orleans looks like a dumpster (even the re","useful":0,"cool":0},"rrePYUEuR4_qoLGE0bLdWA":{"text":"Terrible service right off the bat. \nI think because we were young and they were more of a","useful":0,"cool":0},"NYrGKGhF9z-CgYo06-zDoA":{"text":"ive had brennan's on my radar for awhile, and i am so happy i finally made it.\n\nmake reser","useful":7,"cool":7},"gmhyU-ZVTaRvSZ2wTQW6Jw":{"text":"We tried to make reservations on open table and there were no openings. It was the day of ","useful":0,"cool":0},"ZfhFMN2skw3dBJwkTvZ8ug":{"text":"Well...  This left a lot to be desired.  We made our reservation for ten people several mo","useful":1,"cool":0},"Yys0X8ldMBfnp4sQij-I1w":{"text":"As a local, Brennan's was a restaurant that was never on my radar because I was afraid of ","useful":0,"cool":0},"_RjR6u-jZziG_3dczXP6lg":{"text":"First time for me to be in New Orleans.  Attended a very special birthday party at Brennan","useful":0,"cool":0},"i1-4EvMLDv7EFn7eBXDT2w":{"text":"This is a solid restraint that has superior quality and customer service.. The workers her","useful":0,"cool":0},"ScExKvzbbKa5bFufHctbMA":{"text":"How very disappointing!!!!!  The service was not good at all. Our waiter seemed to be very","useful":0,"cool":0},"bnvkyTjzk7dUfU0Q4Strnw":{"text":"Very classy and elegant. The food is excellent and has every hint of New Orleans style. Gr","useful":0,"cool":0},"-mO5Kl8YaeWccxKp6dGYcA":{"text":"Y'all. The cocktails are on point . The food is melt-your-face-off good.  We had a part of","useful":1,"cool":1},"z3tfRQNsq9cxvlEZ4aiwEw":{"text":"Food is good service is terrible. the waiter berated the hostess for sitting us in his sec","useful":0,"cool":0},"fY6tYl6O59hOGOZmqSRztA":{"text":"You'll be hard pressed to find a better brunch anywhere in the U.S. but the cocktails are ","useful":1,"cool":1},"Pq-oiXzzGqlJLw4_fRlwhQ":{"text":"My friends and I had a pleasant meal at Brennan's. The only reason I gave it as an average","useful":0,"cool":0},"TlHFG0vNloI2uVgjuAivNg":{"text":"Stopped here for a quick drink - very well made and reasonably price (at least during happ","useful":1,"cool":0},"KBLYYcGJcmKHxElKaMxYzA":{"text":"Brennan's was a nice experience for lunch. We had the quiche which is not served quite as ","useful":0,"cool":0},"MzR3hKo7ibr6aXqKf99FhQ":{"text":"Had breakfast at Brennan's. We go there every year for ONE reason. My companion loved the ","useful":0,"cool":0},"ie8ui0pu8duQXxqnhTWMGA":{"text":"We held my sister's 30th surprise birthday dinner here, and it lived up to its reputation.","useful":2,"cool":1},"eD6EdPhnhZFXXIF2C3ghqg":{"text":"This is probably one of the worst brunch locations I'm very disappointed after eating the ","useful":0,"cool":0},"5gYEWkLXlkj9JaQjhU5Ihw":{"text":"Overall nice ambience - excellent food.  We came with an eight tear old - inquired about a","useful":0,"cool":0},"qrQOjSGJ0IFPz5QyLj6qNg":{"text":"The place suddenly caught my eyes with the pink design. Very cute and elegant. I heard the","useful":1,"cool":0},"K1bzdKFs0x4be-Ayha_ckw":{"text":"What Balthazar's Brunch is to New York City, Brennan's is to New Orleans. One of the fines","useful":4,"cool":3},"ojC3z0-UPq11IHSgZjMx7w":{"text":"My friend said this was a \"to do\" place on his list.\n\nI felt slightly underdressed as it i","useful":2,"cool":1},"6qGp5Lg4TombibgPSiDiUQ":{"text":"banana foster: innovative idea, interesting prep process, good at the first bite. but then","useful":0,"cool":0},"GCjzEtXICbVVYk35gnb0Tw":{"text":"This place is great! Everything we drank (watermelon & champagne, mimosa, pimms cup) were ","useful":0,"cool":0},"F5e6151OgeSidxjmZJoRPQ":{"text":"Ridiculously good steaks in a town known for seafood. Charming, cultured service and smart","useful":0,"cool":0},"5uoi13mo8pQUG8PeYfH_eQ":{"text":"First impression of the restaurant was lovely. The staff is very friendly and attentive to","useful":0,"cool":0},"6qx4UP-f5ychY550YoXLDw":{"text":"It just starts to feel like home after a while. We love the tradition, as well as the food","useful":0,"cool":1},"uNfq_NCnvFAH4DEvoFFWuQ":{"text":"We ate here the Saturday night of Easter weekend. Even as packed as the French Quartervwas","useful":0,"cool":0},"oDSCs0cfUxCjk7ZU_8qXSg":{"text":"My friends and I came here for breakfast and everything was ok. \n\nNothing we ate really st","useful":5,"cool":5},"F5sQgYlNAKSHHhp0XpQnKA":{"text":"The 2 stars is for the service on the patio. This is the third time that this has happened","useful":1,"cool":1},"kXn9qSzbfQXm4pNGQrrXzQ":{"text":"We had a different reservation in the neighborhood for my mom's 70th birthday, but the men","useful":0,"cool":0},"xOyHPac4WLd40myjsB0Bgg":{"text":"Enjoyed a beautiful breakfast on our last day in NOLA. I stopped by the day before to ask ","useful":0,"cool":0},"g7quUliyWeZq6Gir2_BBtg":{"text":"I was very excited to try this iconic restaurant. I order the streak Diane cooked table si","useful":0,"cool":0},"LNuAdY5Em3nWXmwzbliZTA":{"text":"Fantastic service and awesome victuals!! Fantastic New Year celebration - Max and the othe","useful":0,"cool":0},"ADuEa0Wn9y81d8osBuPccg":{"text":"We went to Brennan's for our final dinner of our New Orleans vacation. The meal was delici","useful":0,"cool":0},"sDn1r1cZgajTE6n4fxGpig":{"text":"Amazing!!! We loved everything about Brennan's! The service, atmosphere and food are top n","useful":0,"cool":0},"K0W_AMcbWZJ6k5-NHojQrQ":{"text":"Many people claim that Brennan's is a tourist trap, but I disagree. I've eaten here severa","useful":1,"cool":1},"PKrgqkPbgAmH5JPn9TnhNQ":{"text":"If you're visiting New Orleans, it's fun to go to the place that invented the banana foste","useful":0,"cool":0},"CCg50mrpfxY5EetXiFwj7g":{"text":"Service and ambiance was awesome but food was not awesome. Just good. I expected better fr","useful":0,"cool":0},"EV1bbLETeI49QD89jky8EA":{"text":"Many reviews say to get the grilled oysters. They are very good, but, not their fault, I e","useful":0,"cool":1},"Bp8kechXhrV3P_m5rPmItQ":{"text":"Excellent brunch - eggs Benedict with fried oysters.  Attentive service and delicious food","useful":0,"cool":0},"o7mf4Nx2dgNCTwFB-_XQCA":{"text":"The food was outstanding and it's a great atmosphere. I ordered the Veal and it was cooked","useful":0,"cool":0},"Bs_OyDezVfXbM-yS2qKmzA":{"text":"My now girlfriend suggested Brennan's for our 3rd date since she previously went here for ","useful":0,"cool":0},"ZNK_IGvt3EldPEBM-6JviA":{"text":"Took my daughter to New Orleans for her 30th birthday. I asked our Uber driver what he rec","useful":0,"cool":0},"hopaYyxqc055FMauNWViaA":{"text":"I couldn't wait to bring my family back to this historic establishment in New Orleans. Eve","useful":0,"cool":0},"8FsffXDJWwJWUyLr9KGA9g":{"text":"Ate here for breakfast on our last day and it was by far my favorite place. Amazing food a","useful":0,"cool":0},"HajO3-c88B66lD8O3LsUKg":{"text":"8 girls came for breakfast and we conquered. Adult beverages,  lobster,  oysters, Benedict","useful":0,"cool":0},"2atLzzMFMiVn5_Q9gZrf9A":{"text":"Did a weeknight dinner. This is \"American classic dining\" executed very very well. The ser","useful":1,"cool":0},"0fa8Jhu30mOH7r5sQh3Ydg":{"text":"Amazing food and great atmosphere with the outdoor courtyard. They even have a cart they b","useful":0,"cool":0},"pAkfhI6wBjf04kjdGeNpKQ":{"text":"When the food at a restaurant is average to below-average, but the service is abysmal, tha","useful":2,"cool":0},"RwM_6uKRJXn7f5LQU2x8Rw":{"text":"Stopping at Brennan's for breakfast was last minute and not on our list of things to do bu","useful":0,"cool":0},"oCSzN73W6P5vvm8kERE07A":{"text":"Recently renovated, the inside of the restaurant has arbors on the walls and ceiling and l","useful":0,"cool":0},"AlQCEOTLhYmQFgtPS4cACQ":{"text":"Had to be the worse meal, service and overall dining experience ever had in the French Qua","useful":6,"cool":0},"Hc6Aovf15AG3G4q8UeYxzQ":{"text":"Loved Brennan's! Everything we had was amazing! It's where bananas foster originated so ma","useful":1,"cool":0},"by6OjQ1ePHgTTzaXc-BKBg":{"text":"Absolutely the best brunch in all of New Orleans.  If you eat at only one place for lunch ","useful":1,"cool":1},"CL-rXuDJ45hTMSCO8J4deQ":{"text":"Amazing restaurant! The service is impeccable. My family consisted of 7 and each one of ou","useful":0,"cool":0},"0HkS1zUuu7AMVQTXbE4P9g":{"text":"We went to Brennan's twice during our visit to NOLA. The first time was during a cocktail ","useful":0,"cool":0},"r3Yw6-QSqKciP4V77zcc3Q":{"text":"The breakfast is really good. I had the French Toast and it was amazing . It is sweet but ","useful":0,"cool":0},"G45IqLh6-VfbRPe1csxR4w":{"text":"This place is way over rated. Expensive. Bad service. Glorified chain restaurant pretendin","useful":1,"cool":0},"tygp_N69mg-xhM6zWdyrGw":{"text":"I literally have dreams about the food, atmosphere and service at this legendary Grande Da","useful":0,"cool":0},"miwuS02KpKFJa2eDvFaW3Q":{"text":"Sorry, went there on 3/28. Everything that should have been hot was barely warm. The coffe","useful":0,"cool":0},"vpWSQ1yI5L84r-02lYCcCw":{"text":"Jambalaya. Bananas foster. Brennan's is always a good choice. The service is incredible. T","useful":0,"cool":0},"BMi31Bod9VrO-D_d3dSr6A":{"text":"One of the best dining experiences I've ever had. Our server was from New England like us ","useful":0,"cool":0},"-IsJXiNyNclH3B1F88dWdA":{"text":"Before we even get into the nitty gritty, let's just get one thing out of the way.... \n\nI'","useful":3,"cool":3},"1FnLdLDv4dkdr1-BeASa-Q":{"text":"So it's an institution and thus you come with some expectations. Not sure what was going o","useful":0,"cool":0},"RyW2TijT7aXM-_IPl0k7Uw":{"text":"Very nice place lots of servers however there were many issues with the food temperature. ","useful":0,"cool":0},"30IA9tdJh7KrtLbbbb18dg":{"text":"Delicious! Great service, beautiful dining room,  wonderful menu, and Bananas Foster. Must","useful":0,"cool":0},"erKRnn7Y4DohO2S20gmkPA":{"text":"We had breakfast here. If you like overpiced, marginal food served with a tude then Brenna","useful":0,"cool":0},"juTs7be1kj97aidz2D1t8A":{"text":"Absolutely amazing dinner experience, from cocktails, the Gumbo and BBQ Lobster appetizers","useful":0,"cool":0},"G0ZIMbWRLBfDIo7dO3D9DQ":{"text":"We made reservations as a large group & were quickly seated. The food was AMAZING & was su","useful":0,"cool":0},"F740bLHDOVYpDtf93Hw9OA":{"text":"Prejudice...Ignorant....Awful- So I'm super excited to go to Brennan's for brunch because ","useful":1,"cool":0},"2vg4TvR0cecoEdA0qth3Gg":{"text":"Well, so much for the renewed Brennan's. Just had brunch there and the food was ok and the","useful":0,"cool":0},"doQfW-OWc0gxF8MFCYBBJw":{"text":"The Caribbean Milk Punch and the Brandy Milk Punch were both delicious. We ordered the Tur","useful":0,"cool":0},"kcjmmv7FpCYhKZ_AVagYQw":{"text":"This was my brother and I's last stop before we flew out of NOLA. We sat at the bar and ha","useful":0,"cool":0},"7D8bDw2HegLqJ5WJeFW6aA":{"text":"Definitely a must when in New Orleans. We booked through Open Table and we indicated that ","useful":0,"cool":0},"VayzsMgqmUZjoLmNyzTFew":{"text":"Food took a while to come out and service was a bit slow. Food overall is solid, our highl","useful":0,"cool":0},"BkIn4X03YasczeubIhxyQQ":{"text":"We are here for brunch and had a fantastic experience. The service was great and the food ","useful":1,"cool":1},"OY3moCSUnL_tOUG8FuzYnw":{"text":"Omg this is a must try! It is delish we were so hesitant about going after trying Antoine'","useful":0,"cool":0},"UrXr7N3GB9O6wxLO8NxUKA":{"text":"Food: Amazing, very flavorful and good selection of creole classics.  Great cocktails! \n\nA","useful":0,"cool":0},"DDA9mvRcyCrJegXxNk0eZw":{"text":"Brennan's did not disappoint. We went for brunch, and were seated in a beautiful room over","useful":0,"cool":0},"8oXpwFcyScTbQZGE2Uea_Q":{"text":"Went for champagne Happy Hour! Service was extremely slow to start. I felt invisible. It t","useful":0,"cool":0},"dpDZE6Eiz_uMuvXQZWZbhg":{"text":"Such an amazing restaurant. Service is awesome and the food is delicious. You can't go wro","useful":0,"cool":0},"_4u8baNmaSnGPTmPbh_MPA":{"text":"Best Birthday dinner ever! I wish I could give them 10 stars! \nThis place is truly an amaz","useful":1,"cool":1},"NuFWGPXe8Q_j6GSE8R3MuA":{"text":"Great service. A formal feel but you can go casual. So much good food! A must go to if vis","useful":1,"cool":1},"3lvSkVUe_vd2tFCn0jSVMQ":{"text":"Fantastic brunch, one of the better banana fosters I've had in my eating career. the servi","useful":0,"cool":0},"6uBEvekzNtkKE21sepX7Qg":{"text":"Excellent service! Food is amazing. It's really rare to find a classic established institu","useful":3,"cool":2},"1W-pcCjcgk-r9cDBqJjtOg":{"text":"It has been almost 25 years since my last visit to Brennan's and that was not a particular","useful":0,"cool":0},"ueUmbXsXRmQRZlfVkV5d_g":{"text":"This is horrible. From the poorest service provided by Richard, down to each and every dis","useful":2,"cool":0},"Tl_tDsuGn_S8hyWB8uXmgA":{"text":"Stephan was an incredible spirit guide helping us through the menu during our special anni","useful":0,"cool":0},"fn5Kzd0JQ8saMHLMOk9lZw":{"text":"What better place to review for my grand finale of 2015 than the legendary Brennan's! Even","useful":11,"cool":4},"QdTtxJ5cSD6RiuCZgVmqaw":{"text":"Amazing food and staff. It's a fine dining restaurant so expect to pay top dollar. Honestl","useful":0,"cool":0},"nKRhabhJz6mVZ0Q9cuiKdw":{"text":"we are locals and went to Brennan's expecting a great meal for our friend's birthday. What","useful":1,"cool":0},"jni00Xl-UNNpFKONisSG_Q":{"text":"We came here last Friday to celebrate and kick off my Bachelorette Weekend in NOLA and thi","useful":0,"cool":0},"nf6oLd1-mq8AQdXzUxVW4A":{"text":"Such a fancy experience. Everyone should treat themselves to Brennan's at least once in th","useful":0,"cool":0},"EQ9VQj0tKsr88lDMyP65Xw":{"text":"Amazing lamb chops !!!  Great drinks.  The banana foster and cherry jubilee ; both  flatbe","useful":0,"cool":0},"NEXKFzhBGsrMm99kyPsdrA":{"text":"Came here for dessert on the last night in New Orleans and only wish I had found this plac","useful":0,"cool":0},"CY6Qkt618XQopw7UNVMzvQ":{"text":"Honestly, Brennan's was a disappointment. I've been wanting to go to Brennan's for years, ","useful":0,"cool":0},"u3wRJp8Vidpx4sGYEu-2Ew":{"text":"I have eaten many times at several different Brennan-owned restaurants over the past 20+ y","useful":1,"cool":0},"Jy66bn_j3eNrdEyLvxdADA":{"text":"Wonderful restaurant in the heart of New Orleans! Everything we had here was delicious and","useful":0,"cool":0},"eHpqqbGXVnmXRxxhb4i0Xw":{"text":"We heard that Brennan's was where banana's foster was invented, so we came here solely to ","useful":0,"cool":0},"5IWCQdMdS1YsVIjHIGW3iQ":{"text":"Breakfast was good and the service was great.\nI ordered the juice of the day, which was a ","useful":2,"cool":1},"MYqib8a4rEh3PydrewxJcw":{"text":"One of the best dining experiences I've ever had. Top notch service and food. Made my 40th","useful":0,"cool":0},"AP1ibZ4clU9bTmUINxXVOg":{"text":"Came for Memorial Day weekend and it was impossible to get a reservation all weekend. Howe","useful":0,"cool":0},"LvBUuNtzjwQr3ff0uQ9XUQ":{"text":"If you are ever visiting New Orleans this place is a must. The food here is to die for! I ","useful":0,"cool":0},"s5VSwzvFAsP8NiUDsIQxvA":{"text":"This place is terrible. The host was so rude. He wouldn't seat my partner and I. Told us t","useful":2,"cool":0},"Ic7_VCsdrreX_jOaK2I81A":{"text":"A few years ago I watched a segment on the Food Network that featured this restaurant and ","useful":2,"cool":0},"5WkbhFGhPY_VIum7tVevtw":{"text":"This was our last stop of a progressive dinner through the French Quarter. We had the Bana","useful":0,"cool":0},"uh5rJegKyYI1kE0opJU3ew":{"text":"Breakfast or brunch at Brennan's is a standard of New Orleans cuisine (I was taught that t","useful":0,"cool":0},"amVK_Twr9bBOQGIHbXtThw":{"text":"This was the best way to start our weekend in New Orleans. We came for Friday brunch witho","useful":0,"cool":0},"Fbl2thC3VWS2Gap8eEfvxA":{"text":"We were there for lunch and the service was exceptional. The food was outstanding and deli","useful":0,"cool":0},"BVxkK9ABByBaR2PXFHA5aA":{"text":"Service- Okay; our waitress and waiter were working in pairs and neither one seemed too in","useful":0,"cool":0},"zJGkE6drnU9AZxWs0cAh0g":{"text":"If you are looking for a great place for breakfast this is it. Our server, Andrew, was one","useful":0,"cool":0},"VdeH4meRpnzB2XnAzH-82A":{"text":"Nice breakfast spot in the French quarter - even through the average age of the guests see","useful":0,"cool":0},"u6TPzu7IOxKblLbmqRQYqg":{"text":"A New Orleans tradition. Go on a Sunday morning and get the brandy milk drink with your br","useful":0,"cool":0},"EqC2ABdFXLDMsSkdmQXysg":{"text":"This is a two-fold review, one of the parties' that was supposed to be joining us for brun","useful":0,"cool":0},"rTX_BXEEXtKkIwvFjdsPmA":{"text":"The service and atmosphere were great. I didn't give it five stars because the selection f","useful":0,"cool":0},"3Ze05w3hNV-4ySKy-6lr5g":{"text":"Amazing!! The food, service, experience was outstanding! We had The roasted oysters, the e","useful":0,"cool":0},"bgMnioaicqCjS6fTYhtwgQ":{"text":"This place was amazing, I would highly recommend reservations. The server was extremely kn","useful":1,"cool":0},"qFNFMyhIrOqs1BgNA6GCNg":{"text":"Amazing food and great setting. Really lovely way to start the day in NOLA. Relaxed settin","useful":0,"cool":0},"VOWdLyw33xGh7f6mEUDR8A":{"text":"Solid 3.5 stars.\n\nDecent breakfast in the quarter.   We arrived on a Tuesday at 10am witho","useful":0,"cool":0},"G7BtH_CEHhzWVrgyfLMnQg":{"text":"Très joli restaurant et la viande y est excellente. Style un peu guindé mais en fait abord","useful":0,"cool":0},"5jeoIU9y69FImVMwpsFD3w":{"text":"A friend suggested this place for Banana's Foster, so we stopped in after we were already ","useful":0,"cool":0},"xAWETi2dcFabWc46LjOaIg":{"text":"Of course you have to visit this place! It's home to the famous bananas foster. We had res","useful":0,"cool":1},"mlC6FOBBtPUGCu4uQcfRzw":{"text":"Breakfast at Brennan's is a New Orleans tradition so we scheduled a breakfast two days aft","useful":0,"cool":0},"-9ATsQqfnn4NgN-jJ1CGRw":{"text":"WOW! I came here because my first dinner choice didn't serve the full menu at the bar, and","useful":0,"cool":0},"Wb3jOJNgOT8PZdR2GgyKtg":{"text":"Best quality meal we had on our trip! Do not make the same mistake as us, make reservation","useful":0,"cool":0},"gZ20jL1BwfjvpQKDeQYRxg":{"text":"Everything I ate was delicious! My group originally wanted to dine in (host honestly wasn'","useful":0,"cool":0},"Vk9wsdc4_sKx7JD3bH0-Cg":{"text":"Wow!  What has happened to the great New Orleans' restaurants?  Breakfast at the Ruby Slip","useful":0,"cool":0},"rnZBcDxoVwi_yottE1gZMw":{"text":"Where do I start?  This place has been awesome for decades.  I remember eating here in the","useful":0,"cool":0},"GEzNNCRw0HJ8hkstV1BOyw":{"text":"While it is a little pricey, it is so worth the money. The service and the food were top c","useful":1,"cool":0},"9UDFNN_QCC--FP5ahdEm6Q":{"text":"How could you give this place any less than 5 stars?? The food is incredible, the service ","useful":0,"cool":0},"bVdDcC9zLiXLXwaGo769Bw":{"text":"This place was everything my fried hyped it up to be. \n\nIt is an experience. You need rese","useful":0,"cool":0},"zcmY6s0Sbnc0C_0lTRH6HA":{"text":"Stopped by for an early weekday brunch with six without a reservation. Initially turned aw","useful":0,"cool":0},"4DOJcusnaITKE4df3ynLCg":{"text":"Decided to give Brennan's a try with my wife after all the reviews and recommendations. It","useful":0,"cool":0},"M50eCGriuHnQrq3Zs4Fmxw":{"text":"Amazing evening with special service, delicious wine pairings and hands-down fabulous food","useful":0,"cool":0},"qaEa1nzf6R9XIzamuy5eSQ":{"text":"Went in to have dessert & a couple nice  scotches.  Bartender pours us each a drink & afte","useful":0,"cool":0},"VAnOPj0v9Zmv35u1USIY2w":{"text":"We decided on Brennan's for our 15th Anniversary dinner. When I booked, I noted that it wa","useful":0,"cool":0},"8vOa4JOTYidY1J14Pwt77g":{"text":"Good food, terrible customer service.\n\nCame here because we read they were Celiac friendly","useful":1,"cool":0},"8D1j1rUhBspUKUt_hDP8iw":{"text":"A must visit while in the Crescent City! From the famous pink building to the excellent se","useful":0,"cool":0},"b7nuJWAYn2vMY1WDmxZBpA":{"text":"Fabulous really special place for Special Occasion and Must Go. Service could be much bett","useful":0,"cool":0},"_fh1vTnQWGdNCWhVBKwuqA":{"text":"We had a great walk-in brunch here when the skies opened up and we needed a refuge as much","useful":0,"cool":0},"gY2Vl2pJ-4xkktPY-kcjAQ":{"text":"Murphy provided excellent service. What a great Breakfast spot. French Toast and Crepes we","useful":0,"cool":0},"kP7b1r95oyNJxlSrO5RZ_g":{"text":"Brennan's, New Orleans, Louisiana, is under the helm of new owner, Ralph Brennan. The lege","useful":5,"cool":4},"y9-I5GX6LPt4Rqr2H-AsyA":{"text":"Brennan's fine dinning is the one of the worst restaurants I have dined at in recent years","useful":0,"cool":0},"CzmFC5dmiawD9AzPUUehXQ":{"text":"Came for brunch here and we were not disappointed. We ordered the blintzes, he got the fre","useful":0,"cool":0},"GaGKxHJX425o6vFy6G0blQ":{"text":"My friend recommended I check out Brennan's while on a work trip in NOLA and I'm glad I tr","useful":7,"cool":8},"VtR0BQMfoj1lc5JtXa0qvg":{"text":"This is as classic New Orleans as it gets. Check this one off the bucket list. The place i","useful":0,"cool":2},"2JFmy9FV-gvne8O6sZZcXg":{"text":"So a friend recommended that I stop in to Brennan's to grab the Bananas Foster. I was like","useful":3,"cool":2},"a_7IxKqX4dMpW0LmUOfhPg":{"text":"Everything we had was delicious, best banana foster in town! Service is courteous, and we ","useful":0,"cool":0},"3_DR7YT9Y4b9I72zQGK8JA":{"text":"Unlike Cafe du Monde, Brennan's lives up to the hype. My younger son (20) said that he wan","useful":1,"cool":0},"artWkgubvtXlKBLtr96KcA":{"text":"This place gets one star for ambiance/decor and one star for quality of the food. I subtra","useful":0,"cool":0},"HbHvUSOq6j-m_4O4CKKMaQ":{"text":"Unlike Cafe du Monde, Brennan's lives up to the hype. My younger son (20) said that he wan","useful":1,"cool":1},"tbz-wlzGfC5JqGo3UG9ZmQ":{"text":"Had a family reunion Sunday Brunch. Wait service was spectacular and the Bananas Foster wa","useful":0,"cool":0},"8XZdd5-PlGh9JTaMaicu7g":{"text":"One word; Wow! If you want to splurge on a meal other than dinner come here for breakfast.","useful":0,"cool":0},"OX304wXjcrAXy6w3iiOgwA":{"text":"The home of the banana foster they put on a great show by your table in preparing it. Beau","useful":0,"cool":0},"0-woeQ8UcoEG1xg6pQzwjg":{"text":"I have been to Brennan's on a number of occasions and have always loved the food. On this ","useful":0,"cool":0},"0Wk_VG-rlwTE6lV7YscVKQ":{"text":"This was the absolute greatest part of my New Orleans experience OMG. From the second we s","useful":1,"cool":1},"c2q1t6SNqUhsKwOdWnbXvw":{"text":"The two stars for this review is for the Bananas Foster which was really good and worth a ","useful":0,"cool":0},"su8mGWGOMxI3KVMf037HeA":{"text":"Came for dessert and coffee which were both great. Got the banana foster which had a nice ","useful":0,"cool":0},"6x8L0zTM1ofc5fM8g0P0CQ":{"text":"We've eaten here at least 10 times and it's always a great experience. 9 a.m. reservation ","useful":0,"cool":0},"-dnTnIIUc1YTGU9q6djhdg":{"text":"Was looking for a Happy hour before the Maroon 5 concert and after a 2 hour nap.  We were ","useful":0,"cool":0},"k-lLJayvjMKUAAc6uuvbLg":{"text":"Five stars for the delicious Bananas Foster and service! You have to check this place out ","useful":0,"cool":0},"ebthXDQ0CNofiiq8f38MDA":{"text":"This place was AMAZING!  We visited NOLA for New Year's. I highly suggest if you come duri","useful":0,"cool":0},"RyRI8xzHh6zEyjQmhd3lcg":{"text":"Must Order: Turtle Soup, Roast Duck and Blacked Fish. \n\nThis was my first dinner in New Or","useful":1,"cool":1},"nfMVEbwbEY72gcuwP6r4Kg":{"text":"This was an amazing experience from start to finish. Our appetizers and cocktails were del","useful":0,"cool":0},"p2AuDTR4_lDpvmpS811uwg":{"text":"Some of the best breakfast food I've ever had along with THE bananas foster to top it off.","useful":0,"cool":0},"Vr94tvN0wvxV5C-JMgxx5A":{"text":"Wow what a brunch! This restaurant and ambience was amazing. They were accommodating for a","useful":2,"cool":1},"wRGSARTz3roM5vTSTy2z-g":{"text":"One of the top places for brunch in town. \n\nMake sure you get reservations! \n\nThe service ","useful":0,"cool":0},"YqC_4Zb0YA40WxfdBfoYKw":{"text":"Had brunch on our 2nd day in NOLA. Nothing short of fabulous! The restaurant is gorgeous. ","useful":1,"cool":1},"lNBHvASaen4I95xgRGIlyg":{"text":"Stopped in for food and drinks and it was mid day happy hour.  The Fries and cheese plate ","useful":0,"cool":0},"VL2A953qMf4b-I6ySJqlrA":{"text":"Excellent! Very much enjoyed! Will be back! Eggs Benedict, was excellent! Enjoyed brandy m","useful":0,"cool":1},"oMxxAyJMXtVgYMKngcxfWA":{"text":"It has been 30 years since I last had \"Breakfast at Brennan's.\" There have been many chang","useful":2,"cool":0},"TcaX5o9SSUqcDtkSpg5oYA":{"text":"When you want to go to heaven on a brunch plate, head to Brennan's.  First, order the bake","useful":0,"cool":0},"QI1qdQS9TxgmAufW17dYhQ":{"text":"This place is famous for its breakfasts and Bananas Foster, which it invented.  The atmosp","useful":0,"cool":0},"MrvZ3ct8iL0-KQuEk0Qgmw":{"text":"Brennan's continues to outdo itself. The waitstaff went above and beyond to make our 8 yea","useful":2,"cool":1},"nABCQnA6Ci7-Wp9ZmsPCvQ":{"text":"Stopped in here after an afternoon of walking through the French Quarter.  No reservations","useful":0,"cool":0},"GxP0G9sHzJ9ehhv0fpxhPg":{"text":"What a lovely meal in New Orleans. Housed in a beautiful building, Brennan's was a fantast","useful":1,"cool":0},"PQeh_nUNbw5H6sDV4j4RSw":{"text":"In NOLA, you're never at a loss for places to have drinks and food. It's just a matter of ","useful":0,"cool":0},"1l_sVOXwnCTxTPSuzsKjgw":{"text":"Best happy hour ever.\n\nWe are on a relatively tight budget and chose to try happy hour rat","useful":0,"cool":0},"nDi1YUdHLAK3BISzNP--MQ":{"text":"The seafood gumbo was delicious. I had a shrimp salad, the shrimp was cooked to perfection","useful":0,"cool":0},"BUtR5MRsnw9zynA3Y4qSOA":{"text":"The bananas foster is divine. It's the best for a reason. We ate in silence as we ate it. ","useful":2,"cool":0},"XIAqVFS74nRgWmnAE3KQrA":{"text":"My husband and I are visiting from Fort Lauderdale for Southern decadence stopped in this ","useful":0,"cool":0},"T_eqR-K2gDWfT8IVsSUbtw":{"text":"In my opinion this is perhaps the best brunch place in New Orleans with a long history of ","useful":1,"cool":1},"UiPzVhG-cCUfFax0PakVig":{"text":"Don't bother.  The food was boring and uninspired.  So many better options in NOLA.  But t","useful":0,"cool":0},"D5qhQFfoo1PNVQGMqjgiPg":{"text":"Top notch services! Amazing food! Very fancy and clean. If I return to Nola, this is on to","useful":0,"cool":0},"y_EEYrAE98vRvvvrqytCBw":{"text":"The NOLA Breakfast combo was pretty good. I was pleasantly surprised by the baked apple. I","useful":0,"cool":0},"ZHJvhI465Os0p4DRAgRrMw":{"text":"A great place to have brunch or dinner. Under new management after a very public family ba","useful":8,"cool":6},"F1HVDJ8cvJzSr2S7C28KoA":{"text":"Two of my top favorite things in life ... the Sazerac and Bananas Foster, were invented he","useful":0,"cool":0},"eSh_LrjR4Nk4TgHZzuAh4w":{"text":"Visiting New Orleans over Easter weekend & we chose this establishment as we heard so much","useful":0,"cool":0},"MgcJrgIQFVypECU8GKPjsA":{"text":"This was my favorite restaurant during our first NOLA weekend trip! First off, the place i","useful":7,"cool":2},"MQHdPbwkmtv_Bbd68fj6WA":{"text":"Love this place! Food, service and fun are all they serve here. We thoroughly enjoyed our ","useful":0,"cool":0},"ZR2fDI_11aeJGlealCXxdA":{"text":".,Excellent service and great food.,we had a great time,servers are really nice and the ho","useful":0,"cool":0},"a0xu__Ip1-mIQU7bKKmDoQ":{"text":"Brennan's for Sunday is a treat. I haven't eaten here for 30 years, but with my local frie","useful":0,"cool":0},"pkO21Q40rPv3BaBWzhYV3Q":{"text":"I just finished the most AMAZING brunch at Brennan's! Original dishes in a magical atmosph","useful":0,"cool":0},"WhG_dhxyPFWiu13MbAn4oA":{"text":"Just stopped by Brennan's to try the famous Banana Foster before they opened the restauran","useful":0,"cool":0},"ji3vgqV91HnXgBCfYXJJIw":{"text":"Wanted to love this place and may give it another shot. I ordered the Duo of Porcelet (por","useful":0,"cool":0},"WDEHppEcwsrjLwtRRAxiAg":{"text":"A MUST when visiting, we went for the Banana Foster and ended up wanting another one. It w","useful":0,"cool":0},"a8iIHAEHAG8rcTEAmv3IaQ":{"text":"I will never visit this place again! We were there for an entire HOUR before getting the o","useful":0,"cool":0},"p6uKIkutqFkVSebdbykqSg":{"text":"Since this restaurant has changed ownership, it is not the same as it was in the past. Bre","useful":2,"cool":2},"tQS7StTzCHLRcAnpHjgVbQ":{"text":"Went in with my best friend whose only goal was to enjoy the Bananas Foster. No greeting, ","useful":1,"cool":0},"02THZTtcRawAjweQfdV1Hg":{"text":"Wonderful, amazing, spectacular, sensational! There is absolutely nothing wrong with this ","useful":0,"cool":0},"Y7j4eGwtP8jcS66-4xqCiQ":{"text":"Yesterday, we had an amazing experience at Brennan's.  The food was delicious and the the ","useful":0,"cool":0},"QU0lD9pHqBzuZT4pxWXcfQ":{"text":"My second visit to Brennan's and it was as lovely as the first time 10 years ago. From the","useful":0,"cool":0},"6FQ8L3wl7Npf-SKZz6Hz4A":{"text":"All I can say is 5 Stars!  Today I was introduced to a dish called Eggs Cardinal and life ","useful":0,"cool":0},"U_VxK3ocZxAG7qWwmm4gRA":{"text":"I am extremely upset with Brennan's. I have been there once before and loved the food and ","useful":0,"cool":0},"L8uztbDt__jlWry6tQqp9A":{"text":"We had a small group, we made reservations thankfully. The service here is five star; we w","useful":0,"cool":0},"9nTv4H6AsUvioa019jBfWA":{"text":"Never again would I try this place. It's way too over the top and the food wasn't even all","useful":0,"cool":0},"U3Ohwz2pq9fDannJ6oVZrg":{"text":"I came here for brunch before leaving New Orleans because I saw all the great reviews. It ","useful":0,"cool":0},"SO7M8kQ4anp_KoN_xMgVEQ":{"text":"What a delight. This is a one-for-a-kind place for sure. Their breakfast menu is outstandi","useful":4,"cool":2},"EQ9CxpkKKoMgjQTo5vWNqQ":{"text":"Great food! Try the Bourbon punch and the oysters. All amazing! Add an extra shot of bourb","useful":0,"cool":0},"KucZwZdx05bf6LqJgEWpbw":{"text":"On my first trip to Nola I was enchanted. Brunch at Brennans was famous and a \"must do.\" W","useful":9,"cool":6},"ur1lYS59mCypyWnkdeL7vg":{"text":"Celebrated my sisters 24th birthday and it was amazing!! \n\nWe wet our palettes with a glas","useful":1,"cool":0},"triCtDgLjDmxG1ua3lx8MA":{"text":"We were so excited and looked forward tp dinner at Brennan's. How utterly disappointing...","useful":1,"cool":0},"LpWrJrvE2l3HL7qPvoHK1g":{"text":"The food was great. Waiter excellent \n...but I wasn't pleased with The comment that the ma","useful":0,"cool":0},"w1ZKhHnrKbEviMX1QyxMzg":{"text":"Good food and good service! Second time there and it was just as good. I would have given ","useful":0,"cool":0},"I7tX3Xg_KqfvK0hyGSh0Hw":{"text":"We were excited to dine a Brennan's on our third trip to NOLA (there's too many good resta","useful":0,"cool":0},"MxrUYOr_yPSW4LuNJtkr_Q":{"text":"Do not get married here. They ruined my wedding. I have been trying to forget it about but","useful":0,"cool":0},"Vay-61bOl1fUd9Yqf_jzwQ":{"text":"I had a great experience at brunch so had to come back for dinner when arriving in New Orl","useful":0,"cool":0},"Mt_KE4JL9GVNT0PxjRCJgA":{"text":"Great brunch spot! Their French toast is probably the best one I've ever had. The Eggs Hus","useful":0,"cool":0},"VCocpP3wL17GsQfMb5PVlA":{"text":"After much anticipation, Brennan's was an extreme disappointment. \n\nMy girlfriend and I ca","useful":1,"cool":0},"ZcQUvEJK1IpU0KNt3mfQIw":{"text":"Great food and cocktails but disappointingly average service. Not bad service, just rookie","useful":1,"cool":1},"yuHaF8bhtIJ4GReyT4ANCg":{"text":"Food was amazing. Presentation was beautiful. Old school New Orleans charm all throughout ","useful":0,"cool":0},"6Vdze6XbsxWJJSqlg4G4kw":{"text":"A true representation of a New Orleans dining experience. We had turtle soup and gumbo - b","useful":0,"cool":0},"SIwCEJ3WvLvWa7McFMitow":{"text":"Great food! And - if no body has told you yet - get the Banana Foster! It's a must! Gettin","useful":0,"cool":0},"Gz1Y8Z8nJCvTWvA68ZHZ0Q":{"text":"Came here for a bachelorette party brunch and it was fantastic! If you are wanting some in","useful":1,"cool":0},"f0pXG0Ky6l6Yt9JzUZp5Eg":{"text":"The ambiance and service was impeccable. I went with a party of 4 and we all ordered the g","useful":0,"cool":0},"xmiGOmOOmVtafGzzwAqKsg":{"text":"Yes! Yes! Yes! Omg, so good! Came here for brunch and loved it. Cute restaurant with serve","useful":0,"cool":0},"HJPkZz96VRrbbA0L3nmVXQ":{"text":"Easily one of the best (and most expensive) meals I had during my stay in New Orleans. I w","useful":3,"cool":2},"jYu1VbEml8mMbk0i6JV--w":{"text":"I came here for my 22nd Birthday Brunch and it exceeded my expectations. Firstly, I didn't","useful":0,"cool":0},"7W7Kj8xaJGp5wbi2RFYOfA":{"text":"I have to say that I was really impressed with Brennan's. I was here as part of a group of","useful":3,"cool":3},"g1RY8DLIqNwduEnVZAPTzA":{"text":"Went for happy hour, I was nicely dressed as was my husband.  We sat on the patio for 15 m","useful":0,"cool":0},"jWKkN32O6JMVqF1SKhE8sw":{"text":"Historic place, very classic southern feel. Food was pretty good, a little slow, but can't","useful":0,"cool":0},"3iPIeLexDKLyczCFvKjBaA":{"text":"Had breakfast at Brennan's when my mom was in town. She had the lobster Hollandaise and wa","useful":2,"cool":1},"9ULGiuQqli9c4FdZu9-5Uw":{"text":"Wow!!!  We (party of 4) truly enjoyed every aspect of the brunch experience!!  The service","useful":0,"cool":0},"33qKkEVqrxPyLj_qdNLUEA":{"text":"Best food we had in New Orleans hands down. The poached egg options are plenty and the swe","useful":0,"cool":0},"enxOticRUmN9EJuXAdOhew":{"text":"Delicious food with an interesting array of sweet and savory brunch. I had fried avocado w","useful":1,"cool":0},"lpc6IET_YTLcuop8v_tjsA":{"text":"This is such a lovely lunch spot. I love the decor of the restaurant. You feel transported","useful":2,"cool":3},"-49Cl26PmJzMfUN5rX1lnA":{"text":"We've been coming here for 20+ years.  It a wonderful spot with great food and service.  T","useful":0,"cool":0},"--4UUvyQ-Lv0TC6VYBYd1w":{"text":"Hands down the best eggs Benedict i have ever had. Amazing!!!! Service was great. I wanted","useful":0,"cool":0},"0-b-CgiLsOANOZ-alZIdEw":{"text":"The atmosphere is stunning in this upscale dining restaurant. However, the food left me st","useful":0,"cool":0},"6QsX1edBGEQFPobYJ9l--w":{"text":"Brennan's fine dining reputation is undermined by their dress code lack of enforcement as ","useful":1,"cool":1},"7vnFb8xZ1AOZEZAAMv3vig":{"text":"Top notch services! Amazing food! Very fancy and clean. If I return to Nola, this is on to","useful":0,"cool":0},"HALDVfQW797WyjcCxC8D2Q":{"text":"This place. Where do I start? My dad used to frequent this restaurant decades ago and I ha","useful":0,"cool":0},"ac5_dob7YFXnfc6XPxA03g":{"text":"The best Eggs Benedict!  Also, try the bananas foster.  The best!  Delicious food, but wor","useful":0,"cool":0},"nkhv5r2ZUZBPYGvdyo_hlA":{"text":"I was really disappointed - my Blackened Redfish portion was small and so salty.  Came wit","useful":0,"cool":0},"KYOGlnO_whxtvUYB9qsiRA":{"text":"Randy is the best waiter I have ever had! This was overall an amazing experience. The food","useful":0,"cool":0},"bVJB4yi4CXQJMbn0meLEnA":{"text":"The service was amazing and dessert was incredibly! The drinks were amazing, must try the ","useful":0,"cool":0},"BMr5VOff3iuFscUhSkBuNQ":{"text":"I celebrated my birthday with brunch at Brennan's. The atmosphere was beautiful and everyo","useful":1,"cool":2},"n2kTwnc93Lt4JiGE839-LQ":{"text":"I absolutely loved this restaurant and next time I'm in NOLA will surely be back. I came f","useful":0,"cool":0},"QGGMxoC07IBdrkmrmqJA6A":{"text":"Sadly. Booked the King's Room for a private birthday party for 30 guests. Food was spectac","useful":0,"cool":0},"noAs5ko2xRj1qFqEBLnjNQ":{"text":"Came for brunch: everything was excellent. It was a very rainy day, but it was calming to ","useful":0,"cool":0},"qouvlDcxW_5NX9JRp0_mUw":{"text":"We went for our fourth wedding anniversary. Our server was missing the majority of the nig","useful":3,"cool":0},"BINBGxLuwAcy3-UDJ1xGlg":{"text":"Ok I had just landed in NOLA got to the quarter found my hotel and headed out to eat. Walk","useful":0,"cool":0},"jaHIuf8AotBA0okWQjWbww":{"text":"Brennan's was my favorite meal in New Orleans. Beautiful and classic food and decor, but w","useful":0,"cool":0},"w_lVkqT-wp4wK6EBm7TuEA":{"text":"Although I was only here for the bananas foster and a drink only, it was exceptional! The ","useful":1,"cool":1},"wJ5QbYEy3x9k0lHsuZqijg":{"text":"Had the pleasure of dining recently for a friends bachelor party. Impressive place because","useful":0,"cool":0},"SIISXSaJrBcn0xO99vxJdw":{"text":"We tried a couple things which included the Bananas Foster, do not leave without trying th","useful":0,"cool":0},"7MxcHJn-WvVazhCHefdmEQ":{"text":"Such a special treat to get to enjoy a fabulous meal at one of New Orleans longest standin","useful":0,"cool":0},"XFwdBQVY2bHBNzYZdqZ8qA":{"text":"Dining area is gorgeous, dishes are so fresh and tasty. We would like to eat at open court","useful":0,"cool":0},"Jb7GNCkBiLl9R3Es1U46IA":{"text":"Great place to visit between 2-7 for happy hour. Take your drinks outside to the beautiful","useful":0,"cool":0},"ovFdPzN-u0-c1oSJ7l5ZAg":{"text":"Amazing for breakfast! Service and food was the best! Definitely our favorite restaurant o","useful":0,"cool":0},"wXQ09vKuqx8fyjDYzv49vg":{"text":"Such amazing food, and atmosphere. Our experience was topped off by having amazing service","useful":0,"cool":0},"_Fl-nNj0cNQann7-y9fJrQ":{"text":"From piano keys that play without a pianist to a bomb bananas foster, this place is awesom","useful":0,"cool":0},"aZEH8VEQ445tGCWXxTXFzw":{"text":"Wow, great hollandaise sauce on the Eggs Benedict. As good or maybe even better than Spenc","useful":0,"cool":0},"7P3pgf_xNETvQTRl-8vROg":{"text":"I went for brunch with a large party - the decor and vibes are so cute. You can tell there","useful":0,"cool":0},"hFEOmgQ61tOxqbB3cHPpaw":{"text":"Our last night in New Orleans my friends and I had dinner here.  The ambiance was so fun w","useful":0,"cool":0},"q7dwMZjJleoz-yr3SfiFAA":{"text":"It must have been my Brennan's day because I had lunch earlier at Ralph's on the Park with","useful":0,"cool":0},"VMfOIPhmLdQng7D1qwqRdw":{"text":"This place is amazing! We went for breakfast and lunch and loved it! The bartender, Holly,","useful":0,"cool":0},"h9CJODHLhsDWGqkhvDbrsg":{"text":"Like stepping back in time where the worries of the day can never reach you. (If only...) ","useful":0,"cool":0},"Q1rQdRPbiYGyfpBDza0J-w":{"text":"Always one of my favorite spots for breakfast while I'm in town.  I always make it a point","useful":0,"cool":0},"p86m6Sb6OjzNmncqAHKAgQ":{"text":"This was recommended by a friend who had been here close to 50 years ago. It was so elegan","useful":0,"cool":0},"XYBhR1OSbuzyK7yKMqU85A":{"text":"Upscale brunch spot!! The service from the host/hostess, server, server asst, and manageme","useful":1,"cool":1},"jf6uIV9uBjtoCZmYohWocQ":{"text":"This was our favorite higher end restaurant. Elegant setting, but this is not a stuffy pla","useful":0,"cool":0},"Ztpklflz2Trz7K4sEU3h6A":{"text":"The food delicious but the service could have been better. \n\nTo start I had the oysters an","useful":0,"cool":0},"ScUloP8l2Q6cF0sl27_U2A":{"text":"The absolute best meal in years! Gumbo that had to have a bone broth base it was soooo ric","useful":0,"cool":0},"pkHEK0wZ8I_3P_q6umELRQ":{"text":"This lovely restaurant was beyond our expectations. The food and the service were amazing.","useful":1,"cool":0},"5IixGau6fzE48Wg-_SCI7g":{"text":"This location was amazing. We walked in to sit at the Rooster bar inside of the restaurant","useful":0,"cool":0},"gMdyACk7gMUWSz_RA70UTA":{"text":"Is there a way to give this place an extra star? I came here for my 30th birthday with a l","useful":0,"cool":2},"2jae_1XD0Ch4rBnqt8Kang":{"text":"How anyone can give this place less than 5 stars is beyond me. Everything about our experi","useful":2,"cool":2},"pLLLxuBRxBT02yR61Ua7tA":{"text":"I got here an hour early for a reservation and they sat me within 10 minutes of me getting","useful":0,"cool":0},"ujOdpDpcbYvixOtw8BmQ1w":{"text":"I can't believe it took me so long to review this meal.\n\nThis meal was truly amazing.  Eve","useful":1,"cool":1},"7BV4PdHMKVssU3cJf3pgJg":{"text":"The server(Asia) was exceptional and the food was beyond what words could escrowed the tur","useful":0,"cool":0},"XcBZgi15mzFV1Q4KhjuQJg":{"text":"Fantastic. Went here for brunch this morning. Outstanding food and drink. Wait staff was o","useful":0,"cool":1},"mYntww4uJjCUSMnEROSpzA":{"text":"I came here for happy hour -- ordered a seasonal sparkler and the oysters.\n\nThe seasonal s","useful":0,"cool":0},"bw8PEmEX2o2f1y2n4zbWcg":{"text":"We came here after the football game and we had the worst service we had at any restaurant","useful":0,"cool":0},"8fThLCMmx04-tWAkjjcB1Q":{"text":"Amazing. The restaurant is beautiful ...the service was amazing...and the food was beyond ","useful":0,"cool":0},"CNOk6sKp6Eqlb1wi9sK30Q":{"text":"I don't know what happened tonight but we had a terrible experience.  We arrived at 8:30 f","useful":0,"cool":0},"Tzmo86Lwb0ziaRh-rF_9RQ":{"text":"A friend and I came to Brennen's only for the Banana's Foster.  We sat in the bar area - w","useful":2,"cool":0},"Ahu3KUilXWtIQL9L__12Ww":{"text":"Wow!  Exceptional service, food, and drinks always. Michael was our server and did a fanta","useful":0,"cool":0},"C1pszs4cUEhWE9w5VMFY1A":{"text":"First time visiting and we were in a private room for a wedding reception! The staff was f","useful":0,"cool":0},"JcgEldUGPGb7MRu1chpCUQ":{"text":"I cannot for the life of me figure out how this place has the good reviews that it does! I","useful":0,"cool":0},"nSmsAKLV6BvAU_lUqlfBZQ":{"text":"Best restaurant in NOLA hands down!!! Go for brunch!!! Also you can not leave without gett","useful":0,"cool":0},"BPbQFufbPV7hRkNIBPdhuQ":{"text":"They are the best for desserts!\nEvery plate looks delicate and nicely glazed with a layer ","useful":1,"cool":0},"Eo_TkK5S9KBTEala1V6VQA":{"text":"Mediocre, overpriced food.  Terrible service.  My husband finished his first course before","useful":0,"cool":0},"XLB-QUUxpaJLYFyWdVZdeg":{"text":"What a bummer. For context: my sisters-in-law made a reservation for the wrong day. Our fa","useful":0,"cool":0},"mxVRyLjLOAQkIZLXvhJVWg":{"text":"Have always heard I must try bananas foster while in NOLA , so I did some research and fou","useful":2,"cool":1},"pLmuJnRa9RaqRyMO22ofXA":{"text":"We took a family vacation to New Orleans (I know, usually it's adults only) and I saw more","useful":0,"cool":0},"acuWLiPcpkQQ021J6XzTdQ":{"text":"Meh! Super disappointed with this restaurant. Over prized and under delivered. If you're l","useful":0,"cool":0},"8M8CGAMPWuuV8g3-ScX3Qw":{"text":"Get the bananas fosters! It's where it started! They do it table side and tell the story a","useful":0,"cool":0},"vVRxhtxkMRBTJB8Z8p4Elw":{"text":"I came to Brennans during my birthday weekend in New Olreans for a great fine dining exper","useful":1,"cool":0},"A8v4lSEmFlMFesgBlmSbtw":{"text":"Had a great dinner here on Saturday night. Got in with no reservation which was very fortu","useful":0,"cool":0},"DpOcPk5dN2Rf0-Q7FvXQWQ":{"text":"This restaurant is perfect for an old school feel. The service was great as well as the fo","useful":0,"cool":0},"VFL6-KKJiydRcU0O0E4ntA":{"text":"Brennan's might be old school New Orleans, but it was totally worth it. The service and ex","useful":0,"cool":1},"gUD9yTAnu8hlaazI6EsQKA":{"text":"An experience not to be missed. Great food and service, kid friendly and a great way to ge","useful":0,"cool":0},"3XwWsPyTtJmwzB8z0yVyfg":{"text":"What a wonderful experience! We made reservations for breakfast the afternoon before, and ","useful":0,"cool":0},"1D3kJXDtBYKt6Xdq8838dA":{"text":"I recently travelled home to spend a couple days over my birthday. With only two days (and","useful":3,"cool":1},"PqvHsHARF_rDiwxW0Dd7wQ":{"text":"Great food and ambiance! Well worth the cost! Special shout out to Shay, the best back wai","useful":0,"cool":0},"PXIbYFuVDOMtDFsvpSZJtw":{"text":"Went in today with my dad who lives out of town specifically for BBQ lobster. Very disappo","useful":0,"cool":0},"guvHhhzP4qFb8fJPNqFvrQ":{"text":"Had a very strong dinner at Brennan's on a Saturday night that lived up to my lofty expect","useful":3,"cool":1},"rjeKFddv2ZLQFLERWH05Rg":{"text":"Great food, great staff, great ambiance, but awful hospitality at the front door when you ","useful":0,"cool":0},"E2lJKf1G6VnKnLEef1V1bA":{"text":"An amazing experience from start to finish! The cocktails, appetizers, entrees and of cour","useful":0,"cool":0},"_R3OVouCW7mZiA6tSjZA6g":{"text":"Honestly just came here for the bananas foster and was very happy!! \n\nBrennan's is probabl","useful":4,"cool":0},"kzD8JFegv3Fe1wHNXqI3ow":{"text":"A wonderful culinary experience! Brennan's boasts a very courteous. They create the first ","useful":0,"cool":0},"Pdvfw83ZEpIQ713YghNWHQ":{"text":"When in New Orleans you must stop at Brennan's for brunch! The atmosphere, staff, food and","useful":1,"cool":1},"2mdSTz9vdGgN-joyrH86Kw":{"text":"So I stopped in for dessert only. Why not this is  the place where Banana's Foster was inv","useful":2,"cool":0},"5yaLJBLmXYFwgBSdqalW3Q":{"text":"So this review is for their dinner, not brunch, which may have earned a higher review who ","useful":1,"cool":0},"noRiwoFgvxVp4EN-NcvK5Q":{"text":"Loved old Brennan's and was happy and pleased it reopened.  We went Easter Sunday.  If our","useful":0,"cool":0},"Id85DQ7zz_8Pkod3F8ZOrw":{"text":"We came here for dinner last night for the first time in decades and my daighter's first t","useful":0,"cool":0},"4nwQdv8nm7uLSt_CRAmFoA":{"text":"I came in at late lunch on a weekday, when the place wasn't that busy. I waited a long tim","useful":0,"cool":0},"s0wZWJdvd76WmSrG7dOX2Q":{"text":"They made my birthday so memorable (a pink ribbon across your table signals to everyone th","useful":0,"cool":0},"mJEg6pUSfp4KuJn8zOwbLw":{"text":"We went here for lunch for dear friends' birthdays. The service was exemplary, the atmosph","useful":0,"cool":0},"ngwDCZ1Qnj6ycCXon9HliA":{"text":"This restaurant was good, my meal was fine but not amazing enough to go back. I had an asp","useful":0,"cool":0},"2x-TfW3_LOZqAP-2gaOkXQ":{"text":"The view from the windows is lovely for people-watching. One of my goals in New Orleans to","useful":0,"cool":0},"tJCd0afK_ftNUMTAGSGPBA":{"text":"On our tour of classic New Orleans restaurants, my wife and I ate at Brennan's and we're e","useful":0,"cool":0},"tjQu5x7R08oxrWf1jcOTtw":{"text":"I really love his place! It's such a cute restaurant to go to! I had a very pleasant exper","useful":0,"cool":0},"urHeRZhMIApA8_Lrs1AJVw":{"text":"I've come to New Orleans dozens of times and always heard Brennan's was amazing. I always ","useful":0,"cool":0},"GYgah_obYdwUVP41adsgkw":{"text":"There is no other way to explain this restaurant other than amazing. The food and the atmo","useful":0,"cool":0},"7d4PamblCqa3yjOEn0kmNw":{"text":"Went to Brennan's just for cocktails and Bananas Foster, since they created the dessert. V","useful":1,"cool":1},"HwSwBg_lhIZMvkcdZWiGQQ":{"text":"Roost bar in the courtyard was a fun experience. Great deals on bubbles and good stacks. T","useful":0,"cool":0},"JQNxy7HHGrzR6yEaeYSZFQ":{"text":"Made late dinner reservations at Brennan's on the first night of our girls trip and it was","useful":0,"cool":0},"qaoNRXZ-BJjii5OSjkBtrw":{"text":"All I can say is wow!! Went there with my husband for our anniversary. Almost didn't make ","useful":0,"cool":0},"jvkpE5BA3yXFCYAPavCj5g":{"text":"We came here solely for dessert. It's a pretty nice restaurant so I'd suggest getting a li","useful":0,"cool":0},"nsxWzyh4qs1GfU6PHnjJZw":{"text":"Great brunch experience! The ambience was amazing. Food was amazing. Banana foster was ama","useful":2,"cool":0},"pCHjYjrXIqpGgvyS9JgBlA":{"text":"We looked for reservations and couldn't get in until 8:15. When we arrived it looked like ","useful":0,"cool":0},"eZSnWgwlzWW0YiWuAYLBNg":{"text":"Quite disappointing, all 5 of us in my party agreed.  For a place with a rep such as Brenn","useful":1,"cool":0},"21EgfA_o7cLbwPgUnD--lw":{"text":"Absolutely Love their brunch! We spent 2 1/4 hours and no one was rushing us. We ordered 3","useful":0,"cool":0},"7fmwEML7s1Q5-DOkbvwxBw":{"text":"We went to Brennan's a couple years ago, enjoyed it and wanted to go again.  We had openta","useful":0,"cool":0},"aJDwsjCyUh8CEr-s3neViw":{"text":"We went for Brunch, the crab avocado toast was absolutely  the best thing I had so far dow","useful":0,"cool":0},"9x43eCK2M6OPbt2JJvkvFA":{"text":"My favorite place to eat in New Orleans hands down. The staff is so helpful and knowledgea","useful":0,"cool":0},"eYK-3bX6-KXVxSc9uAyEuA":{"text":"This place came highly recommended from friends and family for brunch, and it did not disa","useful":0,"cool":0},"nnW7tIn_WDLm9d9jvnhwBw":{"text":"I'm giving three stars for decent food.   I came here for a romantic dinner and had reserv","useful":1,"cool":0},"0GDJTTa07W5bnfBh45QNjA":{"text":"This was her first experience at Brennans and I have to say it was the best experience we ","useful":2,"cool":1},"h5WYRGugYrVmLG3gc1jkyA":{"text":"My Birthday Brunch Here was Amazing! The atmosphere is classy, the staff was attentive and","useful":0,"cool":0},"PlB0jCnUlLeeXzyguNkoOw":{"text":"I really wanted to like this restaurant.  It was probably the worst meal I had in NOLA.\n\nS","useful":0,"cool":1},"TDr6hMnRTPVUGeO77wpvqw":{"text":"We were looking forward to our French Quarter Fest annual family gathering and wanted to c","useful":0,"cool":0},"hCVZ9GJMwhwLIJDDHVF8fg":{"text":"A must do in NOLA! I had my bachelorette brunch here. Food, drinks and service all great! ","useful":0,"cool":0},"MnkR1bC2ZtAQ3IEVSbEZ_w":{"text":"Would love to give it a five for the wonderful service, outstanding atmosphere and ambienc","useful":0,"cool":0},"VWw2C2nrGDuhB07cFHUBGQ":{"text":"Needed to waste a half hour, so we stopped in for a drink about 5:00PM on September 13th. ","useful":1,"cool":0},"yrhDwjo8YJ4pkBmcEUJetA":{"text":"I wish I can give zero star if I can. I have the most stupid and unpleasant experience at ","useful":2,"cool":0},"Pgw3n5ajrNhzBa6KSxfKog":{"text":"Definitely one of my favorite restaurants in NOLA! Nice ambience (good for instagram if yo","useful":0,"cool":0},"DmfWEKX9Hr_AJe_08RnphA":{"text":"Excellent service, beautiful atmosphere.  Food was very good try the pompano and amazing w","useful":0,"cool":0},"Zj3qkI4_MkzNAVOU9fk28w":{"text":"Started out well with a picture by the door. Appetizers when we finally got them were good","useful":0,"cool":0},"FaqXYwBg8x_L5lJgJ7un2Q":{"text":"Had Banana foster.. Loved it.. They made it in front of us.. The bloody mary was very good","useful":0,"cool":0},"B7ImkBhzaeYH-XmWjO1yJA":{"text":"Just back from Thanksgiving fun in New Orleans, for the third year in a row.  Brennan's is","useful":0,"cool":0},"RSTz254um8i5_o_31Jvzgg":{"text":"This place is absolutely beautiful. It looks like a scene from an old classic movie. We ca","useful":0,"cool":0},"DlE-i2_eeF5QVaC-6fyHLg":{"text":"Any restaurant that places a fine wine and Bev book, a loaf of bread along with whipped bu","useful":15,"cool":12},"ig0R6i47At9A0WPFiyaMKg":{"text":"so i came here because i saw it as a \"must do\" on someone's food tour list , but i came al","useful":1,"cool":1},"lINCr7582zJz0f0F8ELvhA":{"text":"The food was delicious and the service was great! I don't understand how some of this menu","useful":0,"cool":0},"wTajD1rXaAuE8BvyHRKXUQ":{"text":"We came here for brunch but it was really just an excuse to try the bananas foster. Though","useful":3,"cool":1},"svUd7kPrEOqhlYF2ULucrA":{"text":"Fantastic staff and ambiance!! Loved our breakfast avacado toast bacon, scrambled eggs bac","useful":0,"cool":0},"hy0Y89gxXoKOquDQISKdTQ":{"text":"excellent and friendly service.  went there for 'bubbly' special friday afternoon.","useful":0,"cool":0},"Q1B5ha-0Vu1KPC0GllWSHg":{"text":"Came for brunch multiple times. Had the french press coffee, milk punch, eggs cardinal, cr","useful":0,"cool":0},"5hT5EyCzvOeNXetVUHtjHw":{"text":"I was at Brennan's NOLA on Thursday for a networking mixer while attending a conference an","useful":0,"cool":0},"J78XUSyA8Q1qHo0Xj3R2fg":{"text":"Very rude!!!! Went to the bar just to try their specialty dessert and they gave me a hard ","useful":3,"cool":0},"9YQFuXh6UJvaS5lO4bxYEw":{"text":"This breakfast is hands down the best breakfast I've had in NOLA. The Brennan group is kno","useful":11,"cool":4},"EX0I__r16vj0U0_EjfB0_g":{"text":"Brennan's has great food, great drinks and a great atmosphere but this review is mainly ab","useful":3,"cool":0},"kazV5Pfo1y2s4igc73Ferg":{"text":"I love this place when i came to visit last year. This is a go to place for breakfast. I'v","useful":1,"cool":0},"YwT-3FiNaOguq0O7KPSClw":{"text":"Wow-what can I say?  Honestly, this was the best meal I've had all summer! (and I haven't ","useful":0,"cool":3},"nzpPIlbMRP-q91ymt4N2vw":{"text":"I came here not just for the original banana foster dessert, but the best.  I was not disa","useful":3,"cool":4},"F2c805Oyrk1PpDIPC5QKkg":{"text":"Whenever I'm in New Orleans Bananas Foster at Brennan's is a must. It was created here by ","useful":6,"cool":7},"-wbetkvqDcSppWUht33DLg":{"text":"FABULOUS! My dad who is now 46 went for his 18th birthday and now I got to go for my 18th ","useful":0,"cool":0},"CdV7NTGhJywOL1-X33OwEQ":{"text":"What an amazing meal!!! This is a must for breakfast if you are visiting NOLA!\nWe had the ","useful":0,"cool":0},"M_yjyFShAEzCl1bHgPYaIw":{"text":"Brennan's is always fabulous for a fancy brunch in the heart of the French quarter. \n\nI st","useful":2,"cool":1},"VY6AdwdPnfwhZ8BwMokH1w":{"text":"Five stars for the lovely Brittney who made our Bananas Foster this weekend. Yeah, we arri","useful":18,"cool":16},"STUHUHPASuc1Y0G0MwX4Xw":{"text":"Everything was top notch except for the two girls at the front, they weren't very friendly","useful":0,"cool":0},"sT36SJ_7499A_n5osh2LNg":{"text":"Came here exclusively for the banana fosters. The brunch items were good, nothing extraord","useful":0,"cool":0},"dyodw-kAOzVil6sPrfmL9A":{"text":"Came here for a birthday dinner, was highly recommended by a friend. We made reservations ","useful":2,"cool":2},"vpChoa3NDBwOIDj-_J-tLA":{"text":"Brennan's was our favorite restaurant for years ... every trip to New Orleans always inclu","useful":0,"cool":0},"KZD2QYhDVrrh7tiExAqMWg":{"text":"Got lucky! Walked up and seated at bar for breakfast =)\nExcellent dining, great service & ","useful":0,"cool":0},"tYG85YvKoGRA3JtYt3bD5A":{"text":"I was super disappointed about Brennen's. Was so excited about this and talked it up all w","useful":1,"cool":0},"kHkY171xc7R5Q0yjIYa0xA":{"text":"very good food and polite waiters. i ordered the blackened red fish which was delicious, a","useful":0,"cool":0},"KyPyX5z-xNextRFac_tu_w":{"text":"Decided to have brunch here this morning, and it was delicious. Ordered the Carribean Milk","useful":0,"cool":0},"meZg6QEm7HdVXq5Nggn6hg":{"text":"My husband and I came here in March BC (before COVID) LOL \nWe didn't make reservations we ","useful":2,"cool":3},"80IucAcALBssrjhfFyG82Q":{"text":"My mom and I came to Brennan's the moment we touched down in NOLA and it did not disappoin","useful":1,"cool":0},"6YzaJtQE6nJ66lqADlPFxQ":{"text":"Christopher, Our waiter treated us as if we were let's say \"Our money was just as good as ","useful":2,"cool":1},"NvnrOPM-VstQBPfDw5Suhw":{"text":"My first (and last meal) at Brennan's has made me determine that it's probably one of the ","useful":0,"cool":1},"O7cOWITQSpZ_3zLns5j6xA":{"text":"We went this weekend.  It is very unique.  We all enjoyed our meals.  The wine list is ext","useful":0,"cool":0},"WlFk0mw01u5ewUCUThPjTA":{"text":"The food was great, but the service was not. \n\nWe were there 2.5 hours for brunch that sho","useful":3,"cool":0},"nNGFt0NB9fo-rltZtGhh8Q":{"text":"I loved this place! Why? For a few reasons. The first that comes to mind is the single wom","useful":3,"cool":1},"PLr2__AJGlVNCCDSSJXK9Q":{"text":"This place is a classic for a reason. We had a delightful. Brunch that lasted over 3 hours","useful":0,"cool":0},"uE3PRlBSxo20bRgbT7NLRg":{"text":"We had a great waiter, prompt service and excellent food!  I highly recommend the brunch","useful":0,"cool":0},"mndckMapO_Mfn3mNw6t0rg":{"text":"After dinner, we came by for their famous banana foster dessert! This place has a pretty s","useful":1,"cool":2},"oVjwz2j85eEDMXG6wzmLow":{"text":"Food was great and the bananas foster made table side was amazing! Loved the ambience and ","useful":0,"cool":0},"Eql-KYeBXyzYBqJd3za1TQ":{"text":"Dinner at Brennans on the patio. \n\nWe got...\nSteak 4/5 \nTrout 5/5 best fish I have ever ea","useful":1,"cool":0},"VbymWF37WKjs0TSGGGk1Dg":{"text":"What a perfect place for breakfast - on your birthday no less. \n\nI'm so glad Sofia picked ","useful":3,"cool":2},"D6a3ZstNCWOS93umL7vHLQ":{"text":"My boyfriend and I came to Brennan's for brunch. We made a reservation in advance and were","useful":1,"cool":0},"odhJ12GWH9t4x_w4_-VXxg":{"text":"It was our anniversary, we traveled 8 hours for Brennans. Wouldn't go back.\n\n Was expectin","useful":2,"cool":0},"95ZE0Ji3aIvSUaP3bv_84g":{"text":"This is not the review I was hoping to write.  I live one state over and get to NOLA about","useful":1,"cool":0},"JaZ9Smcu_jZugE5CdQhajw":{"text":"One of the best brunches we had in New Orleans!! The service is impeccable, the atmosphere","useful":1,"cool":0},"Ek3mwK4bZUK2kSqzOX7MpA":{"text":"Easter brunch - good foods and drinks.  Service started good but went downhill and became ","useful":2,"cool":0},"NjuqYqsbNX1RIsc3L0ITFA":{"text":"There are so many wonderful places to eat in New Orleans. Do not skip Brennan's. We ate br","useful":0,"cool":1},"CKZL_PV69hkpx2fGbDsSUA":{"text":"Breakfast was the absolutely best. The French flash was a small portion, but was delicious","useful":1,"cool":0},"xoyd7zJ9BP0hB8dwdjoiSA":{"text":"A champagne lover's happy place in the heart of the French quarters.  Come for happy hour ","useful":2,"cool":0},"E_KtclGiCPAtoNIG1NKCQg":{"text":"Delicious brunch! Eggs Benedict and Bananas Foster is a perfect breakfast combo. Creamy an","useful":0,"cool":1},"RPLM5ffMAVpb0JXKSfRZAQ":{"text":"A severe disappointment. I would have given a 1 star but at least the staff was nice. \nVer","useful":0,"cool":0},"NBh2J9Q_Zq-Z0GH1fNCxdQ":{"text":"Brennan's is the New Orleans restaurant experience I wanted to have on my voyage to the bi","useful":7,"cool":3},"GahN5K_WvB8eETU-ySv1Ow":{"text":"Old traditional dining charm, right across from the court house.  Waiter was very knowledg","useful":0,"cool":0},"aHOFMx7LFQ5UBFfDdhoVQg":{"text":"I was in town for a girls trip and made a reservation at Brennan's for dinner.  We ate out","useful":0,"cool":0},"_Urc6O-jp4j1LDusp84daQ":{"text":"I came here twice during my trip to NOLA. The first only for drinks, the second for the ba","useful":2,"cool":2},"djcrxVO9Tdc6-hoMWiNJrw":{"text":"We stopped just for Banana s Foster here. Wow best dessert in New Orleans. It's started he","useful":0,"cool":0},"hzsyz9cD2qEUh4R6GktlZg":{"text":"I can't say enough about Brennan's. Thanks to our server who also told us about an amazing","useful":1,"cool":1},"UKDM_EjCqXrphZgcLnyNRA":{"text":"Made a reservation for two for brunch a few weeks in advance since I've heard such great t","useful":0,"cool":1},"ePol3EOzCHVFrtLNX67IUg":{"text":"This is the experience that has created a legend. \nBreakfast at Brennan's is one of the gr","useful":0,"cool":0},"5q9jAvYlgYi617zw8QIRxw":{"text":"Very good brunch! I wish the menu was a bit bigger but everything we tried was quality and","useful":1,"cool":0},"nY62QKalHe6Juv6qIlc20A":{"text":"Rolled in to town in a storm, but these folks took great care of my stranded person! Food ","useful":0,"cool":0},"4PI-b7SbpGKZDVWsvxShQg":{"text":"We came here for happy hour! The Roost Bar is just around the corner from the host. It's a","useful":1,"cool":0},"2-cqu4zRFKAakoDWZZ8yXA":{"text":"Chocolate king cake only!!! I did not eat at the restaurant. The king cake was ok but dry ","useful":1,"cool":0},"w4XkV5pgscdW-0Y2BQT1Fg":{"text":"Stopped in for happy hour and had a great time‐ the staff definitely makes this place! Our","useful":0,"cool":0},"x7ENzlGjg3WozjGJuy8XJw":{"text":"This was a first stop for us when we came to NO. We came for brunch and they did not dissa","useful":0,"cool":0},"U08kAh3e1L5KiTgdInw_CA":{"text":"Basically Wonderful..... and remains one of my top spots for breakfast.  Maybe it's just t","useful":0,"cool":0},"Sz393tOnor6rQilPZ-P2Ng":{"text":"Another place we had to hit up being tourists. We ran out of time so breakfast there. Amaz","useful":1,"cool":1},"Lhb2lk43eOo9BZY3JjsXeg":{"text":"While my family never actually dined here. I am reviewing the drama king at the front desk","useful":4,"cool":0},"-84xmkqZHxHPD-qv1nteOA":{"text":"TRADITION LOST\n\nVery disappointed in Brennan's. I've been eating here for decades and this","useful":0,"cool":0},"BFDkRtouTgedwBkPvDGIAg":{"text":"My wife and I stopped here and tried to walk in without a reservation. Unfortunately, they","useful":0,"cool":0},"-6jS3D329gDLrPWR27MolQ":{"text":"Amazing breakfast and special way to celebrate a birthday!  We always heard that this was ","useful":1,"cool":0},"zypvLv8MwgOZgsb5XB6X4g":{"text":"Had a wonderful experience here! Celebrated our first anniversary. They offered free champ","useful":1,"cool":1},"UQ0wGlfLC0krnmoKSKKqzg":{"text":"Went here last night for my birthday dinner and it was an incredible experience. Their att","useful":1,"cool":0},"T17CuePT93ZBzziyhUPwCw":{"text":"It has been almost years of anticipation wanting to go to Brennan's in NOLA. I've heard so","useful":0,"cool":0},"TwPsIFBIPIFt_F739pfbHQ":{"text":"This was one of the best meals of my life, and our server had a lot to do with that. He wa","useful":0,"cool":0},"BF5wPPp_2hxhs9RIIu38mg":{"text":"Can't speak for breakfast, but this isn't the spot for dinner.  The ambiance is great, but","useful":1,"cool":0},"uHz0r8txtihEqrA7OgBT8A":{"text":"This shhhh is bananas.. Foster!\nI ordered the milk punch which was delicious and reminded ","useful":2,"cool":5},"LZH_C3BTpfv-_4UVrHtCWg":{"text":"There is a house, in New Orleans, that is the culinary sun. The place where the city's pow","useful":6,"cool":4},"Zqhm36belpzG9lNT_QQyYw":{"text":"I am partial to Brennan's as I'm sure many are. I never had an experience less than except","useful":1,"cool":1},"K0w23lOdxaFHCUAW0e641g":{"text":"Food was exquisite---it is pretty pricey but great atmosphere. This was pre covid. Great N","useful":0,"cool":0},"DCQjQ14f_g2TBB-avscrbQ":{"text":"Turtle soup is what caught my eyes while looking for a place to eat lunch.\n\nThis is a nice","useful":15,"cool":16},"UFIugBgfNIWpwUjdj2Tjuw":{"text":"It pains me to give Brennan's 3 stars, it really does. I was so looking forward to this my","useful":3,"cool":1},"Ic8R9dBQItOCjLaQLfVFfQ":{"text":"This was an Amazing meal, yes it is pricey but I think there were some plates that make it","useful":4,"cool":4},"zb_fxLRdImC8F4cZDSUdGQ":{"text":"Breakfast hits the spot with this old school New Orleans staple. We were promptly seated f","useful":8,"cool":8},"oGztgzzKJzZBh97c5Ga8jQ":{"text":"Amazing food, service, and a special place for dinner even amidst the pandemic. They all w","useful":2,"cool":2},"sOTaLffj3joVEwZN3czrmA":{"text":"Celebrated my best friend's birthday here and it was fantastic. Our servers were professio","useful":0,"cool":0},"trbFJENoDFb8GFN3ghPZGA":{"text":"For the bar only, but would imagine that a dinner here would garner the same number of sta","useful":2,"cool":0},"poDNV1kovYn3KBiluhOgxg":{"text":"Very disappointed. Overly priced. Extremely small portions. Food was mediocre. Their famou","useful":0,"cool":0},"E3v4xFSpdVN2kOf3i_BJyg":{"text":"Private room experience was awesome!!  We had a party of 12 girls for a Bach party and the","useful":0,"cool":0},"1dvvH9Nsi7JVYpT_vU6ONg":{"text":"Before eating at Brennan's we ate at Willie Mae's Scotch house and Antoine's. This place i","useful":0,"cool":0},"Nrxe2GyknGOx8Edevr7mPQ":{"text":"Nice and classy.  The staff is very friendly.\nFrustrated I couldn't get a martini in a pro","useful":0,"cool":0},"NY3O7obGBwE7VA2k9WQbAg":{"text":"Service is amazing! Very Disneyesque. Food is mediocre at best for the price. Great touris","useful":0,"cool":0},"nFj6OUwk2mftMnPOIDnNGg":{"text":"We were very disappointed in our experience last night at Brennan's.  The service was almo","useful":1,"cool":1},"MosWQi3Q1RuEcPOfsERm-g":{"text":"When in NOLA, Brennan's is a MUST! They have the best brunch! The restaurant is chic x lux","useful":0,"cool":1},"Mj8b9Sq6k-aayykQePkJWQ":{"text":"My brunch at Brennan's was just a wonderful experience. \n\nI ended up wearing shorts becaus","useful":1,"cool":1},"6dHu-csFLPP1y1Y47gJ8SQ":{"text":"Came here for my birthday and it was everything I dreamed it would be. We had the Roasted ","useful":0,"cool":0},"3rI99kjsk-d6DkmUHKpMdQ":{"text":"We showed up with a party of 7, first they told the men in our party that there were no ta","useful":0,"cool":0},"GXyb-iyuFbMXmiSuqPfVnA":{"text":"Been here twice for brunch in ten years and each time was a smash hit.\n\nThe food is awesom","useful":1,"cool":1},"NN-Sa4HxDiTb58U8e-UbQg":{"text":"Make sure you're dressed nicely, because the host at the front door took a quick glance at","useful":0,"cool":0},"BjVk4qK0-fxR2gxexdCUmw":{"text":"Front start to finish we had Excellent service.\nThe Beautiful space makes me feel like I'm","useful":0,"cool":0},"Q0eBvHET2x4HNknIFVgrYw":{"text":"Brennan's - Jewel of the Brennan Family dynasty - home and creator of the table side Banan","useful":3,"cool":2},"AtV-S9iwU-GIZzSV_isV-g":{"text":"A staple in New Orleans. Stopped in with friends for brunch. The decor and feel is very ol","useful":1,"cool":1},"r-8D06b7EaZAFEQoZMLlcg":{"text":"I went a couple months ago and the experience was lovely. I ordered the French toast and I","useful":0,"cool":0},"ww1hKzXB-UBCzX_SMRQLhw":{"text":"Amazing food and amazing service. \nThis place is absolutely perfect for brunch. The interi","useful":0,"cool":1},"npFgGy6garXav66SEmzHpA":{"text":"We came to Brennan's for the original banana's foster. \n\nI absolutely loved the decor. It ","useful":1,"cool":1},"vuzfQ9cBjmT0B3Zfu5MhXA":{"text":"Stopped in for a light bite and champagne bubbly. We had the cheese plate and the fried pi","useful":0,"cool":0},"1Og2zo1PxoRDg5HvFU2Zbw":{"text":"We went to Brennan's for a birthday dinner and the service alone was spectacular! We recei","useful":2,"cool":0},"dO--B4qpeCVdDAWZaDOdzw":{"text":"This place has a special significance as it was here I learned Creole Cuisine during culin","useful":1,"cool":1},"VA-0uzY7Eor_MBNxomOylg":{"text":"Home of the original eggs sardou! Delicious! I've also had the shrimp and grits and the gr","useful":2,"cool":2},"0k1M80Pb-b9qOZNky7J-cA":{"text":"Man this place was amazing! We went here for brunch and I dont have a thing to complain ab","useful":1,"cool":0},"Mu8kweFYPDIheE-0OTVddg":{"text":"We have experienced Brennan's so many times (including big events-wine room dinners, post ","useful":0,"cool":0},"tyIApAoj9NQxmVzJEuPfmg":{"text":"We really wanted to try the banana foster and for a party of 8 we walked right up to the b","useful":0,"cool":0},"gP5uD_7m9Kn8L6QasrpGGg":{"text":"My fellow yelpers have come through again.  We stopped in on Sunday 9:40 am, no reservatio","useful":1,"cool":1},"o0SXQVhDUb1ORNIIrAi3xw":{"text":"Bang for your buck: 10/10\nQuality: 10/10\nService: 10/10\nAmbiance/Location: 10/10\nOverall: ","useful":1,"cool":0},"CF3VxgOVrbRHyzxGfb-hKw":{"text":"Came here for the turtle soup and of course the bananas foster. The turtle soup wasn't bad","useful":0,"cool":0},"PYBwKnvZ48QtfqXmqXt9QQ":{"text":"This is the home of the banana foster - the original creators of this dish. \nYou wont be d","useful":1,"cool":1},"8iSUgdRRYoADAmL8CRv24w":{"text":"We went for brunch to celebrate my birthday & it was as beautiful inside as it is outside.","useful":1,"cool":0},"ABD2FF9xBOOlXkKXNKvM1A":{"text":"Eggs hussard is one of the best things I've ever eaten. Brunch at Brennan's is a must.","useful":0,"cool":0},"sFI7zHmMjQx5pmzDBJozVw":{"text":"HORRIBLE. Worst restaurant ever. Most expensive meal my partner and I had in New Orleans (","useful":0,"cool":0},"JZEV2iTrQUTwCur3g0FvGw":{"text":"This rating is for their King Cake I had during the Mardi Gras Season. Oh man, when I saw ","useful":1,"cool":0},"1tCi_2Bb_ru-qFrCYEls5Q":{"text":"On my first trip to New Orleans I booked a reservation to celebrate my anniversary at Bren","useful":0,"cool":0},"oSR1Z2P8e04tsYZZxEmlgg":{"text":"We made a reservation for brunch on a Saturday to celebrate my sister's birthday. Although","useful":0,"cool":1},"mEzT2AlM4fz3ObF9FmN9Ig":{"text":"100% Gem!! You must eat at Brennan's when visiting NOLA. Some of the most creative brunch ","useful":1,"cool":1},"a6PKUMZ5G6YsYITVcZpWZw":{"text":"Fantastic time from the moment we were greeted at the door by the hosts to the last drop o","useful":3,"cool":2},"vRfmRELguGNWsf_KuTTApw":{"text":"This is what great service should look like, everything was fast, fresh and the service wa","useful":2,"cool":1},"OMdQ_0NUYUkGEPwbPYFPRA":{"text":"N \natty locals, Commander's style, attentive service, sumptuous renovation. That's how I'd","useful":10,"cool":3},"v314kHQFRu-OGO43qxem1A":{"text":"If you want an upscale experience in NOLA, I highly recommend this place! My food, drinks,","useful":0,"cool":0},"iEs61hFS9syxgfLex0dYDQ":{"text":"Last dinner in NOLA and it ended on...somewhere in between a bang and a whimper.\n\nWe had d","useful":1,"cool":0},"J0f_e9rLesGr8gJWVuh-dQ":{"text":"I cannot say enough about how great this place is. On the ride over, our Uber driver went ","useful":0,"cool":0},"KAPIB83mYGvMAMc2XoC8ig":{"text":"We had a such a great meal from one of the grand old Dams in Nola!! Cannot wait until we w","useful":0,"cool":0},"kYjYDTm7hYcqQDLx3Aajnw":{"text":"Beautiful place and our waiter Max was awesome. We had the rock shrimp and the sweetbreads","useful":1,"cool":0},"C8NGLejJJLJlWWixpohzGA":{"text":"Easily the best meal we had in NOLA. The dining room is beautiful, and the staff goes out ","useful":0,"cool":0},"_WwycVo2j0-AXbXtpzmeGg":{"text":"So this place is a staple of New Orleans.  I think its a one and done kinda of place.  The","useful":2,"cool":2},"WR3NzgqQw88M2ngmRRMFAQ":{"text":"I can only speak on the bananas foster! It was scrumptious! Made right in front of you! Ba","useful":1,"cool":1},"4NV-qV_2zQIt0Z6BmRXuiw":{"text":"Recently visited Brennan's for the first time for dinner and I had the steak option, best ","useful":0,"cool":0},"oO22HwDCrd35eXbYJe_-3Q":{"text":"Brennan's was my favorite meal in New Orleans! I saw a documentary on Netflix that talked ","useful":0,"cool":1},"JCC9DV2Nq4sqHqP4UEMD4w":{"text":"Had to come here as the original place for banana foster. It did not disappoint. They sat ","useful":0,"cool":0},"p4VvTwZ4Lu6Szm69deSgbA":{"text":"We came here to celebrate my husband's birthday while visiting the city. We started with t","useful":0,"cool":0},"nDy9xvTizmD6vHuoS-N0DA":{"text":"This place is magical. It's beautifully put together. The prices are reasonable. The food ","useful":1,"cool":1},"qRFy1KGFO9O2n0daWKteMg":{"text":"Review for dessert. \n\nWe were not appropriately dressed for Brennan's, but they have a roo","useful":0,"cool":0},"IrrAsWpEF4hm2L11xhdV1A":{"text":"We came for Brunch, but not on Sunday. There was availability on a Wednesday. \n\nThis is a ","useful":6,"cool":6},"wjvyTf3Ejs3caJij7bhe8Q":{"text":"This is my second visit since the reopening. My first review was not positive but I though","useful":0,"cool":0},"0D0RomvU8VwCyHbxwle5vw":{"text":"Such an experience!! The BEST eggs benedict I've ever had (I've had a thousand, they're th","useful":0,"cool":0},"DQC83iCHEFkq9BtIlGfTZw":{"text":"This review is written with mixed feelings because we do love Brennan's and we have had gr","useful":1,"cool":0},"_KXa3jvdKBb9r7EQhBYjGQ":{"text":"great and fun- nice outdoor area for drinks!","useful":0,"cool":0},"QUC2qi0tsua0-PdDo-jCaA":{"text":"I hate giving restaurants one star but this is all hype and if you ask for a cappuccino yo","useful":0,"cool":0},"tqDYJXqdN3adacxVFnnt-Q":{"text":"Stuffy and the service is real snooty. Bar food is okay but was expecting more for all the","useful":0,"cool":0},"1yPuZfYYZaMA0xqjPrtMcA":{"text":"Gluten free options are a whee bit slim - call ahead to make sure you're excited about you","useful":1,"cool":0},"o81D5P7lUCZwyYjFhKC0mg":{"text":"What happened? You became a cut above a diner. Change it back please.","useful":0,"cool":0},"5-vnfa9YI-koMUyCYA7jbQ":{"text":"In a city known for it's seafood...Brennan's stands out.\n\nIt started when we walked in; th","useful":2,"cool":1},"706sjSVyUOIAB-Dmp09uTg":{"text":"Brennan's is a classic New Orleans spot that was highly recommended. I went for brunch wit","useful":6,"cool":2},"ubxUfEp0TtH7_PPzBmI1kg":{"text":"We just for the banana foster but stayed for the sazeracs! This is a must do if you're in ","useful":1,"cool":0},"KGPrrDiRJTI8ZcdL0zeWvQ":{"text":"Always amazing food. Creative, perfectly cooked, delicious.  Beautiful decor and amazing s","useful":0,"cool":0},"tLzDsixhuYd69x4T_2Hfmw":{"text":"When in Nawlins, this is a must. \n\nBrennan's is origin of the creations of bananas foster.","useful":59,"cool":60},"_ln6jlX-sDVtW0-hE5t3DA":{"text":"one word: AMAZING! I went to celebrate my 21st and it was above and beyond I could have wi","useful":0,"cool":0},"UWvDR0utjZLtBMPXO_ptow":{"text":"We went here for our holiday lunch yesterday and  we won't be doing that again.  They serv","useful":0,"cool":0},"ya-jXsyZ-i-EzCV3YOMPIA":{"text":"Enjoyed breakfast at Brennan's yesterday - I ordered the New Orleans Breakfast with gumbo ","useful":0,"cool":1},"p0swy5Du3XnC7aHF13R68g":{"text":"There is no better New Orleans dining experience than a meal at Brennan's. \n\nNot only is t","useful":2,"cool":2},"9xvS4nIhdrA2Te053pQpTw":{"text":"Dinner was great!\n....Bananas Foster (and the tableside preparation to go with it!!!)...WO","useful":0,"cool":0},"FZpTMSFaE2tFhzsfeZHddg":{"text":"There may be hipper, trendier places in NoLa. And in those places you might eat some stran","useful":4,"cool":3},"Q5TsWVP0cHLBbxujepElbQ":{"text":"Fabulous experience!  The bbq lobster, shrimp raviolo, and crepes were the individual winn","useful":0,"cool":0},"IaiFJUSEvNIuAKOsJBElZg":{"text":"Stay away from this nasty tourist trap!!!\nMy wife asked for her $22 omelette well done and","useful":0,"cool":0},"keurm9356tPUNQrJLi4JYQ":{"text":"Had a great meal here. The baked apple and bananas foster we're excellent. Their two signa","useful":0,"cool":0},"HIx6zn35tMSSXaO_TuPEAw":{"text":"Looking for some bomb and OG bananas foster? Brennan's is the place to go! While a bit pri","useful":1,"cool":0},"bBOBT76j91KFmdCn0AQwDQ":{"text":"I enjoyed dinner Brennan's - mostly.  The restaurant is stunningly beautiful and we loved ","useful":2,"cool":1},"Ob1SjrZN3LrhdXFz7qyN6g":{"text":"This was the final stop on my food tour weekend of New Orleans.  They never disappoint and","useful":1,"cool":1},"Vb9YuNVvECqXFI2eXoNLfw":{"text":"We went with a large group just to eat bananas foster (I hear this is pretty common) and m","useful":1,"cool":0},"XV8fX19Rp8k7_EKnZia8dA":{"text":"I have zero complaints here all our drinks were delicious the appetizers and our main cour","useful":0,"cool":0},"MrlvYiPVbd50uCP1CMwy3Q":{"text":"Stay away from this nasty tourist trap!!!\nMy wife asked for her $22 omelette well done and","useful":0,"cool":0},"Q0yHMzaPZm0P0YJhD8soGw":{"text":"Came in for drinks, small eats and dessert. Overall, the food was excellent.\n\nThe bloody m","useful":2,"cool":1},"71MMG2TqwVVcfNhG7pnGJA":{"text":"The place is cute and lovely. You can tell everything here is delicate, well designed and ","useful":4,"cool":0},"8R-f4rd2wWtbSPZgaCXk_A":{"text":"Dining at Brennan's was the highlight of our New Orleans trip, and was absolute five star ","useful":0,"cool":0},"V8mFzAO8AuHc-jzj7ukYZg":{"text":"Brennan's quickly became our home away from home in New Orleans.  Lou at the bar is a cons","useful":0,"cool":0},"WV-mZsZZPZUsWMNrk9e-SA":{"text":"Great food. Went there for lunch. Underdressed and stood out like a tourist. The juice of ","useful":0,"cool":0},"yqk6jyh-shJVp86_n61Diw":{"text":"Great food. We were a walk in with a large party and they worked us in in under 10 minutes","useful":0,"cool":0},"fjKdcgCAJvWTIWOzQ7BkIA":{"text":"Banana's foster... All I had was that dessert, and it is easily one of the best deserts I'","useful":0,"cool":0},"O9roWI9DrkQbtvl_sj9QhQ":{"text":"With all the raving and recommendations on Yelp and from friends, Brennan's was the bigges","useful":1,"cool":1},"XhH9CsmIi4GhfcAJ5CGOuA":{"text":"Very rude host. We came in and waited to register and a set of woman came in and went in f","useful":1,"cool":0},"rxBclvRe0FI0tHnAF2XuwA":{"text":"Came as a tourist for the famous banana foster. It was amazing and it exceeded our expecta","useful":0,"cool":0},"dFZeLmn3KS_02grWOMhawQ":{"text":"Worst. Service. Ever... how do you review a place that you like so much... but the service","useful":0,"cool":0},"TkVQfwPlcw6WZutVWN7T3A":{"text":"Not sure I would give Brennan's a 5 star rating in another city but for NOLA, it was the b","useful":1,"cool":1},"xCvYE6e9BKUMMiZFrhidJw":{"text":"Dissapionted. After reading great reviews about the incredible customer service we were di","useful":0,"cool":0},"wa024_y1xqiRGCVyAFYSDA":{"text":"Great ambience and food, but the real standout is the service. From the time we walked thr","useful":0,"cool":0},"v8oQVeyuUFMt6uErdTlc3w":{"text":"Brennan's blew me away. I loved the atmosphere from the moment I saw its pink facade until","useful":2,"cool":2},"eC5XC_hcsDGvDWrIhWiQiA":{"text":"Not sure how anyone gives a Brennan's less than five stars. The food and bar locations hav","useful":2,"cool":1},"tvunYzhT0stRbnnlLTMGvw":{"text":"Amazing food and service. The atmosphere is true to New Orleans. The food and drinks are a","useful":0,"cool":0},"G6kif2tvVuNSNUYt41MjGw":{"text":"Love this place! Drinks are good and so is the food. Never had to wait for a table. Presen","useful":0,"cool":0},"cD8Lof7ejp9u5QWQjajsjQ":{"text":"We were recommended to come here for brunch from our concierge at the hotel. What a wonder","useful":0,"cool":0},"i8ArWeeiZ7ZGsCTzE_42zA":{"text":"I am a Texas boy but my mom was born and raised in Louisiana. Lived in New Orleans most he","useful":0,"cool":0},"kGQplIL7KjzURElcDw4_xQ":{"text":"Service is impecable. Food was delicious. Location is beautiful. Tried the steak Diane, eg","useful":1,"cool":0},"vagLunnivbv4HpXlyr6Zvg":{"text":"Egg Cusard breakfast - brennas original. So delish! Everything is clean, beautiful, elegan","useful":0,"cool":0},"kF9zW-Dxs4dfsmDMyokwuw":{"text":"The food and service were both exceptional.  The New Orleans Style Coffee was bold and str","useful":0,"cool":0},"NaYgTlw8q7SlgklBvJ0ZjQ":{"text":"Banana fosters is a must. Bartender was great, cool story, good service and got a little b","useful":0,"cool":0},"qeWujVbYoBXcKeXnccKwJg":{"text":"My first dinner in Nola this visit and it set the bar high for the rest. Comfortably elega","useful":2,"cool":0},"GCDmkOfPF4WIdM_fcU7z9A":{"text":"Had their brunch and it was delicious! This is a definite must have when in NOLA's French ","useful":0,"cool":0},"h0FAwlVPXJs3iucZXGZbtw":{"text":"My wife, who grew up in Louisiana, wanted my daughter and myself to experience old school ","useful":0,"cool":0},"ZkuKrSs-T2BcK8Y5BTS-6g":{"text":"Came here to celebrate a birthday and very happy this is where we chose. Quinn, our server","useful":0,"cool":0},"RaBdb8eWYQs27qfNpOThyQ":{"text":"We always make Brennan's a stop when we're in the French Quarter. Breakfast at Brennan's i","useful":0,"cool":0},"uUnkZjGGziRB6BHDOxvjQw":{"text":"Breakfast at Brennan's is a MUST when visiting NOLA! The wait staff is classy, the ambienc","useful":11,"cool":6},"FPMa7g6tULCvgQdlw_M8Gg":{"text":"We came here for dinner. A big tip would be to dress up to come to this restaurant. It is ","useful":1,"cool":2},"OkBZ2f2FansRcog_9Wx0pA":{"text":"What a fantastic dinner! Started with the turtle soup. Very flavorful. Then I had the swee","useful":1,"cool":1},"-c6SINDqvInFuktVWkzwcw":{"text":"I wanted a \"fancy\" elegant brunch while on our New Orleans trip and our concierge recommen","useful":1,"cool":0},"vbrdp-dQrt_ogS9Fb4BZfQ":{"text":"Ok so on our day of being fattys we came to the OG and inventor of the Bananas Foster. \n\nW","useful":0,"cool":0},"4SUT1aVyZgy2agmdQ338qA":{"text":"We made reservations just to try the bananas foster, but after seeing other people's food ","useful":1,"cool":0},"bK3srUKbS-_dh1-0yP-jCg":{"text":"My experience here was great, it really felt like such a transporting experience, I would ","useful":10,"cool":8},"vXW3lsoiA7Sn5gu1-SJU-g":{"text":"Gumbo was not very good but the eggs Benedict were fantastic. Service was really bad.","useful":1,"cool":0},"GzPISPuJHZtrJlwletkHVg":{"text":"I don't understand why this place gets such high rating. The sitting staff is snobby and t","useful":0,"cool":0},"8gJjKOQscjqtW_FBK7niJA":{"text":"UPPER-CRUST FINE- DINING ASPIRATIONS,  CRUMBS REALLY\n\nDon't get me wrong,  I liked it,  it","useful":1,"cool":0},"WBbU4M6bfyO3JAcwReSb8Q":{"text":"This is quite a fancy place however I don't think you need to dress up that nice.. but def","useful":0,"cool":1},"KS4fwIIbKoh2nRRboG0tRA":{"text":"The most excellent service I've ever experienced. I never had so many people wait on me. I","useful":1,"cool":0},"GtVuixByWsqxmxxKgnccUw":{"text":"I have been to Brennan's twice in the last four months (which is a big deal considering I'","useful":2,"cool":1},"uehnusDd_R6SHQCiiG1wkg":{"text":"First brunch in New Orleans after arriving the night before to celebrate my friend's bache","useful":1,"cool":0},"vPcWr537UTZCvJMkIPmHhQ":{"text":"This was one of our favorite experiences in New Orleans. Jeanette was amazing and the food","useful":0,"cool":0},"Iabig6k571v44CRuIxridw":{"text":"I just had my wedding at brennans on 10/06/18 and there were many great things about it\n\nP","useful":3,"cool":1},"1sokTgXJSEt1jiwfL8_0BA":{"text":"Brennan's restaurant is been open for almost or more than seven decades serving delicious ","useful":1,"cool":2},"2-IN2UVO9q5UWcSD1r2S-g":{"text":"I wanted so much to LOVE Brennan's.  I had reservations for weeks and had read all of the ","useful":0,"cool":0},"siUUUgEc-u0RYwOL2xTNCQ":{"text":"Brennan's \n\nOh man where do I start with Brennan's? Bananas Fosters. This is the best bana","useful":12,"cool":11},"80WI4Cml8V1JtgGpjkFu6Q":{"text":"We celebrated my birthday there. Services was excellent and food was super delicious! High","useful":0,"cool":0},"pzFfWSE8HAHWRcoy2hSliw":{"text":"Yelp doesn't advertise it, but they do have a cocktail hour from 2-5:30pm. I called in to ","useful":0,"cool":0},"V8D81yWG82Ya8HwpCvlfDg":{"text":"WOW! What a pleasant dining experience. This review is long overdue from our trip in early","useful":8,"cool":7},"c0FGrvHrSkoLNTMY5hNPng":{"text":"We were in New Orleans for honeymoon. We are from and live in Louisiana. We stopped at thi","useful":0,"cool":0},"veawR4Ona6HwoUzk30AX2g":{"text":"We came here for the tableside banana fosters. It was pretty good. Our service was a bit s","useful":0,"cool":0},"cnjw1-ivvVoWxFYN6CZ4eA":{"text":"Classy establishment with beautiful decor and friendly staff. They are known for inventing","useful":0,"cool":0},"wWNhCB6QZEPIlFLmH29uqw":{"text":"The meal itself was fantastic, along with the majority of the service. We were seated quic","useful":0,"cool":0},"ZLWEH6YX8V-yEu0knaSIrQ":{"text":"Made a reservation weeks advance and planned to celebrate the end of our trip at Brennan's","useful":0,"cool":0},"PSLY-29CVUfc_KczPD_hxw":{"text":"Brennan's doesn't disappoint! We visited for the first time in years and brought our two t","useful":2,"cool":1},"UPsQ0qmH5y2V9YaFuihhQw":{"text":"There is no better New Orleans dining experience than a meal at Brennan's. \n\nNot only is t","useful":1,"cool":1},"NL8U6zKZmI9PB71eDDhQPg":{"text":"We made reservations for brunch (def recommend you make one) and were seated in their outd","useful":2,"cool":0},"XFtHTGQ5g8gAJC3zVqgKFg":{"text":"I can't say enough about how kind and accommodating the staff at Brennan's were for my fam","useful":0,"cool":0},"OcP6_z6MmvoQ9zVKI_fj1w":{"text":"Best banana foster.  Drinks were expensive and lacked the kick.  Great show and story with","useful":0,"cool":0},"h3WnXJygEyVH13bdAROinQ":{"text":"Great service and high-end local cuisine! We ordered shrimp gumbo (amazing), oysters, gazp","useful":0,"cool":0},"loSadShjkOQ3V3159w71wg":{"text":"It was my last night in town.   It would be one thing if I had just looked up Brennan's in","useful":0,"cool":0},"tBd2bAGDzKzXq8SQLVlVMQ":{"text":"We visited Brennans over the weekend and loved it. We stumbled upon this on Friday afterno","useful":2,"cool":2},"iBWxSxImA88PVi9HAJXFrQ":{"text":"My husband swears that Brennans has the best food. I don't know if I agree but I do think ","useful":6,"cool":2},"RbiZIlRBlQWi9QHKgAhtBQ":{"text":"Food not fuel. Wonderful experience. Birthplace of banana's foster. Be sure to have the Eg","useful":0,"cool":0},"O_oNtBnNctNyRjawDhS0rQ":{"text":"This was the meal of a lifetime! We visited New Orleans and knew eating at Brennan's would","useful":0,"cool":0},"AXEtEghQAlNI_D8Hk3T7xw":{"text":"Upscale restaurant and birthplace of the bananas foster dessert. Came here strictly for de","useful":0,"cool":0},"O-iUWnl6o2ipX0TK2ngsLg":{"text":"We got here late Sunday night about 20 minutes before closing just to get the banana foste","useful":0,"cool":0},"SKa9gy00QRNecXhuI-3C0A":{"text":"Went here for Brunch on a weekday. From the get go, I got treated like a real person. My s","useful":0,"cool":0},"lXhMy_5E_mZnC8iq-o4qBA":{"text":"If I could recommend one place to eat in New Orleans, I'd recommend Brennan's for sure. In","useful":1,"cool":1},"_Gxbnfwca1JhyMRVWC7sPg":{"text":"What an amazing place! Fantastic staff, over the top food, and a super cute setting. Would","useful":0,"cool":0},"jv7t9i88yGO7by69DjXO3g":{"text":"Very overrated and overpriced and we wish we would have listened to the locals recommendat","useful":0,"cool":0},"BUTSJM8WZJncq5_Y_0e4Nw":{"text":"This place is over priced and just terrible. It took us over an hour and a half to get our","useful":2,"cool":0},"ABz_8OtndK15OkXs1kPA6Q":{"text":"the food was wonderful here! service was great, our waitress was kate and she was so cheer","useful":0,"cool":1},"uUnZ77kFGeqoU6xrOT5wZQ":{"text":"I have never been more appalled by the poor attitude of our waiter - and the lack of reply","useful":0,"cool":0},"qSYMC6W5maNrhtyv6wC4xQ":{"text":"Went for a cocktail, loved it! Beautiful atmosphere. Great service.","useful":0,"cool":0},"-LXFtLkD-kGqGFOz6nbTVQ":{"text":"This place has a special significance as it was here I learned Creole Cuisine during culin","useful":0,"cool":1},"m8JfWYJJv3DCs5Yy24wJyw":{"text":"So the food was great here! I would give the food 5-stars but I am giving 2-stars because ","useful":1,"cool":0},"pVC-LEHZeNrIrgfziCVl1g":{"text":"not sure which adjectives are even appropriate to describe how amazing our brunch at brenn","useful":0,"cool":0},"Nx4k1IK3x2eP1lpT2cvHEg":{"text":"I was so excited to bring my parents here for their first visit to New Orleans. However I ","useful":1,"cool":0},"AI1FPN3ah84CHTNl1WNcCw":{"text":"\"How many Banana Fosters do you serve a day?\"\nHost: \"About 5 million.\" Being the home of t","useful":3,"cool":1},"nbMxZ8foOT31guYeL5OfDg":{"text":"Service was awesome  foood its soooo good \nIt's just the most lovely place ..  I felt like","useful":0,"cool":0},"EPSSk_Dbv2j3bF2n2FAVyg":{"text":"The interior is very glamorous, I love it ! Went for the 2 course brunch menu, expect to l","useful":0,"cool":0},"OESsFu-QX8thUmoqSlI-CQ":{"text":"We came for the happy hour and could not have had a better time. The cocktails and bar sna","useful":1,"cool":0},"U7paTTxHQw0I7hpYZF7SbQ":{"text":"I initially wanted to come here for nerdy reasons I will describe later, but also heard th","useful":0,"cool":0},"kEzawoqsI3p5_zqRNTgD-A":{"text":"Absolutely amazing experience here! The food and wait staff were top notch, Covid protocol","useful":11,"cool":11},"MuFz3OjljoK2G9nmERsI1A":{"text":"This came up a lot when we were looking into places to eat on our stay and I will say I wa","useful":0,"cool":0},"nwzQOKx-cHnqt7Zpf7O2xw":{"text":"We always love eating at Brennan's.  The brunches are especially delightful.  We have alwa","useful":0,"cool":0},"mSyZzSiEsj_HMhKHrSh1qg":{"text":"Feeling fancy? Get your church pants on and make a reservation for the family! Come hungry","useful":0,"cool":1},"Nwzu81O3jYOxhYClwvtzcA":{"text":"I have to say the ambience of this place was lovely and the waitstaff was excellent EXCEPT","useful":1,"cool":1},"6luqr2g9AXFj3kK-DG_yvw":{"text":"Brennan's such a nice restaurant in New Orleans. We made reservations a few months in adva","useful":0,"cool":0},"jhwlv8d2Wbb_wfooG_FFCg":{"text":"Brennan's is wonderful! I've been there for a small wedding, brunch and happy hour and alw","useful":4,"cool":5},"u9AlJ_qeaH129o8sGG0u7Q":{"text":"Ww were there for a company dinner so a little disappointed we didn't have access to a ful","useful":0,"cool":0},"iQ-6Xzn73aRBiBsdAj38cQ":{"text":"This is such a special place to come and enjoy. The ambiance is amazing and really gives o","useful":1,"cool":1},"E5ER1EHzprYIeIiTRx3kXg":{"text":"If you are seeking a white cloth experience look no further, you've settled on the right p","useful":1,"cool":0},"gUP6XM8uTLhWnmuLm0XOew":{"text":"Their pear champagne is amazing! Server was very helpful and friendly. My friend ordered s","useful":0,"cool":0},"tPjmfXQ5TGqZca-xaLpMHw":{"text":"Came for dinner while at a conference.  Decorated in a garden motif in the room I ate in. ","useful":0,"cool":0},"KonAGPcuomWXnw_Zx80_lg":{"text":"I just returned from my annual girl's trip which was in NOLA this year.  It was my first v","useful":0,"cool":0},"REC_bYmiRktquffKMOHLSw":{"text":"Lived in Louisiana most of my life, been to many many fine restaurants and - for whatever ","useful":1,"cool":1},"5SGyBujfhoeQJlhjf-Br4g":{"text":"What can I say, the originators of Bananas Foster and still the best I have every had.  Th","useful":0,"cool":0},"GaL1N_tZuBvDqwAR7TSAmQ":{"text":"Stopped in for brunch after a tour at the Sazerac House. We sat in the bar area and was gr","useful":9,"cool":11},"rB7AM5h2vy9AYBzWkw7Kww":{"text":"We arrived for bananas Foster only and it was amazing, terrific, delicious! This is where ","useful":4,"cool":3},"kjqJU4E8dv2ZsStm3vuUEw":{"text":"My family and I stopped by for some bananas foster. It was AMAZING! We only got the desert","useful":0,"cool":0},"9ww2Mqwmp6vsyo1GV3ApMg":{"text":"I've got to say, I'm not much for Yelp reviews but I was so amazed by the service at Brenn","useful":0,"cool":0},"GJt8B2YluZNcZDEzI26BJw":{"text":"Had heard great things about this place and was so happy to have been able to make a stop ","useful":0,"cool":1},"6EXUf9R5Z2AWOmjfxH77vA":{"text":"Classic NOLA, can't leave with out a visit here.  I have been here twice now, both times w","useful":0,"cool":0},"EMqPE465vynU16-FrDtl-Q":{"text":"This was my first stop for breakfast while in Nola. If you judge a city based on first imp","useful":2,"cool":0},"zoVzZLfgqXQudPutyxOtgg":{"text":"Blacken catfish is delicious!..  Chocolate kahlua was okay, I thought I was going to be ab","useful":0,"cool":0},"5WGLci073KZyjB4DGEh7jw":{"text":"Very disappointing. I've been using Yelp to help me find good businesses and food for year","useful":0,"cool":0},"SkQk-LHfLsgRx-fZamxEnQ":{"text":"We made a reservation for our family during Tulane graduation weekend a few months back, a","useful":4,"cool":0},"UB65LV7Awqlv5IVW1vQZVg":{"text":"We booked Brennan's for my birthday dinner while on a vacation in NOLA since I wanted some","useful":1,"cool":0},"2HxdUg0Sryed0YF5g6hdDg":{"text":"Brennen's\n\nHome of the Original World Famous Banana's Foster. A show in itself, have to or","useful":2,"cool":1},"pQLz5pssrUfXk6rctUn2tQ":{"text":"My husband treated me to breakfast here. Very nice place. Calm atmosphere. I had the Eggs ","useful":0,"cool":0},"rA9SpQMu7OQWKp7JHsmU-w":{"text":"I know this place has a long history and it was nice inside but i thought the food was jus","useful":1,"cool":0},"-GBcerHAei3z_BNB0Ifmig":{"text":"Terrible experience.   Over 2 hours for an average meal.   Eggs Benedict and steak Diane. ","useful":1,"cool":0},"Xa3MfbZgeqUur628emqAoA":{"text":"Looked through the window at chefs/ cooks. We saw three of them tasting food and returning","useful":0,"cool":0},"n5j3ci0aF-vTUy4hW2Y4Mw":{"text":"What a wonderful dining experience and the food, drinks and staff were great.","useful":0,"cool":0},"_3Pzp-Xg_mG_blmDcwJNKg":{"text":"The short review: I've loved Breakfast at Brennan's for 25 years, the new owners have kept","useful":1,"cool":0},"A1AgFoilvCqMGvD4jDq6pw":{"text":"Eric at the Roost Bar was amazing! Friendly, knowledgeable and just a pleasure! The Caribb","useful":0,"cool":0},"Ypu2D-ttDJIz3j-n_zmYGA":{"text":"We came here as our fancy dinner of the trip on the last night. We did not have a reservat","useful":1,"cool":1},"-Jqe4B4SVL3U1bOcCvmtFQ":{"text":"This was by far the best breakfast/brunch in New Orleans for us! Not to mention our server","useful":0,"cool":0},"wcgfz8Z0q0z23Br2AxCuxg":{"text":"They got a new chef and the new menu sucks. The end. Brennan's has unfortunately dropped o","useful":4,"cool":2},"uQHL0jV4QgIj55D2NDa_kQ":{"text":"Great food with upscale atmosphere, fancy restaurant prices, and modest portion sizes. The","useful":1,"cool":1},"rGnrvs4_QodX6dK65s15UA":{"text":"We sat at the bar and had turtle soup and bananas foster and an old fashioned and a glass ","useful":0,"cool":0},"XnBb4gPIEDLZPlAvqU9Ssg":{"text":"Came here for the Banana Foster only and it was delicious. I ordered Banana Foster at othe","useful":0,"cool":0},"XaxPiwQ11bqPLjLHJT791A":{"text":"Came here with my family for dinner based on a lot of recommendations.  I had made reserva","useful":1,"cool":1},"TShaBKfKy7Ql8_LTEWGl3w":{"text":"I've heard great things about this restaurant but the food was just under par for me. The ","useful":3,"cool":0},"IBT_bChCMxPX3XFJyQxMMQ":{"text":"The world famous Brennans, newly opened and as southern as ever (I presume). Not an everyd","useful":0,"cool":1},"6l7pnyk7ao0RfnZXaYQIbw":{"text":"Wonderful brunch. Eggs houssard and bananas foster. Kate H was a wonderful server. Definit","useful":0,"cool":0},"KzwIwueYlAAfdaXtPNkYXg":{"text":"What can I say about this amazing establishment that exceeded every expectation I had comi","useful":0,"cool":0},"qRwwIvwrXbV7pu1FYpW7fg":{"text":"Brennan's is back!  \n\nAfter a family squabble and what is sure to have been a multi-millio","useful":5,"cool":4},"YDML9EnBGohnji1f5DYnhA":{"text":"A must when in New Orleans!! 4 of us had breakfast on 02/07/2020\nand the food was outstand","useful":0,"cool":0},"SGn1Wp6N7CNX188RPJKY6A":{"text":"I had higher expectations from a restaurant with such positive reviews. This review is for","useful":2,"cool":0},"BpytAw9cgPfKfkfP2Knyig":{"text":"I brought my kids to Brennan's, where my family brought me as a kid. It was fantastic. The","useful":0,"cool":0},"_eM_Ti7s6ygCvKWH6SmeQA":{"text":"If you're like me, I love great steaks and food in general. This place is an awesome! It's","useful":0,"cool":0},"M7vLMXmIOtrObLxgDUOHIg":{"text":"I went here last night and really enjoyed it. This is a higher end restaurant and if you'r","useful":0,"cool":0},"Y7ZWyShXyqyv7ounz5-WGw":{"text":"Brennan's has always been my choice of birthday brunch for many years.... however, after t","useful":2,"cool":0},"xSXZf9shd6m9pXYObYowuA":{"text":"The food and service were both excellent! First time having bananas foster and it was so m","useful":0,"cool":0},"xJXVgZh1k_FviahVUEmjWA":{"text":"We stopped by the bar at Brennan's in search of coffee and because this place was highly r","useful":3,"cool":3},"4aPPiYkXaB7usQ56EDrphA":{"text":"Walked in for Sunday brunch was sat at a high top next to the bar 10 minutes went by befor","useful":1,"cool":0},"ww5cK8r0e56wgLExfk-KsQ":{"text":"The best thing about Brennans is the banana foster! It originates here at this restaurant ","useful":3,"cool":2},"wJaPndnABUQHJ55yxDMz6w":{"text":"Got catering for a corporate event, the meal looks like it came from Taco Bell.  The salad","useful":0,"cool":0},"1jtu-Z8tdzOLgWpR2e9Mvg":{"text":"Hands down the best breakfast I have ever had. Went to breakfast on my birthday at Brennan","useful":1,"cool":1},"a-rNQ4gxg984mNu-Wq-CGQ":{"text":"Great meal and fantastic service for our bachelor party trip to New Orleans.  Make a reser","useful":0,"cool":0},"xQmlpS5lrOwTViSeXNIuJA":{"text":"I love the environment here! I always go for the banana foster!! It taste amazing and the ","useful":0,"cool":0},"aOqMMhSB2nHQluUb7d-t4A":{"text":"Just finished up brunch at Brennan's. Really great atmosphere, service, and food. I starte","useful":2,"cool":0},"Ah1iDTP2jqxhHFPt6yF9cQ":{"text":"Nothing beats brunch at Brennan's in the courtyard. This was a wonderful morning shared wi","useful":3,"cool":2},"HPN_d1rK3Akz9GDww3hZ5w":{"text":"Top shelf here \n\nExcellent staff and food\n\nLobster hourderves was superb\n\nWaldorf salad su","useful":0,"cool":0},"Jrh9MamOK5eqf3ZwS-jpOA":{"text":"If you're visiting NOLA, add this restaurant to the list! We did not make reservations ahe","useful":1,"cool":1},"EWGAQtF6GKaiaLUgSz22cQ":{"text":"This spot is serving up some AHmazing king cakes for the first time ever. If you're lookin","useful":5,"cool":4},"hUM-INg8AQ03KgTgfK7uaw":{"text":"If you have a culinary bone in your body you must treat yourself to the one and only origi","useful":0,"cool":0},"zHR7jBfgUJzupppTrG1rmg":{"text":"Stopped by for happy hour and ate in the bar. Great atmosphere! Try the oysters J'aime... ","useful":1,"cool":0},"dzzvsOHhU6O942b4r9-9wQ":{"text":"Wonderful experience! From the food to the service, everything was top notch! Get a reserv","useful":6,"cool":4},"pWAkXsYix9qlY3wy3etDTw":{"text":"My family and I went in for dessert 45min ago tonight. The host was very rude. Said they d","useful":1,"cool":0},"lG8L3XWQys3J8RGsCwycRg":{"text":"Perfect dining experience.  Service was amazing and the food was beyond delicious: the ava","useful":0,"cool":0},"TCmQ_JJloNCjvRHVLjjI4w":{"text":"Great food here. This is the only restaurant in the French Quarter I visited twice. I saw ","useful":2,"cool":1},"crZnn3SWeo5kZk6G1sP2jw":{"text":"Surprisingly average. The corn location are unique and Charming. The scallops were well co","useful":0,"cool":0},"Lsx4-rEbSAgDN9OnpPLljw":{"text":"Lunch today in horrible rain but the food was so good you forgot the weather. Soft shell c","useful":1,"cool":1},"BDDKrrzF2Yh60Jdqg02VIQ":{"text":"Breakfast @ Brennan's is just a classic tradition in New Orleans! \n\nTURTLE SOUP - A New Or","useful":2,"cool":1},"2Z5MIbPD_Zw3dmeDLTijzg":{"text":"Great renovation of an iconic New Orleans' restaurant. Amazing for dinner or brunch.","useful":0,"cool":0},"rQm75pXOJbHmiWxT500nZA":{"text":"Classic NOLA fare. The Banana's foster is outstanding. Excellent for date night or just a ","useful":1,"cool":0},"qmj8GgMlM0pAeJuqTsuFCw":{"text":"Had to stop at the Naughty or Nice Happy Hour on 12/21.  It's a good thing we arrived at 1","useful":2,"cool":0},"LqO4W5XD3oodmtHXgXvf3A":{"text":"This place is amazing. We sat outside under the tent. Beautiful building, beautiful seatin","useful":0,"cool":0},"rRaRTyX4yFBUZgwGpTPGFg":{"text":"Such a disappointing brunch from a spot with historically such a great reputation. It lite","useful":2,"cool":0},"k1WieM20RE_PiUjv1n1weg":{"text":"I went here for brunch with my four friends. We were all in a good mood which helped us en","useful":1,"cool":0},"eBtgeQqJf_UlO7_rzYBYIA":{"text":"I heard a lot of hype about this place... only to be utterly disappointed. The aesthetic a","useful":1,"cool":0},"idBEoy5GL2dHmkww5re45g":{"text":"Well, this is it,  been waiting a long time for Bananas Foster from the folks who invented","useful":3,"cool":1},"BBqMneW7kOi982d3aEuM2g":{"text":"I have to say I had higher expectations for Brennan's as it was recommended by many. I had","useful":1,"cool":0},"QyrRrVHiiDioxqqrbP3PIA":{"text":"This place is magical. We started the celebration for my hubby's 40th birthday with breakf","useful":3,"cool":3},"HiFIwKDEKi1-B1L8r7412Q":{"text":"Service\nIt was excellent. I enjoyed it from the moment we walked in to the very end. \n\nTab","useful":0,"cool":0},"6Kp-5feX0dnXNGlFXYAv5Q":{"text":"Came here for an anniversary brunch and the server was so welcoming and friendly. Prices a","useful":1,"cool":2},"h_zoX0-M7v89IqYRQZL6BQ":{"text":"Stopped by for brunch on Saturday.  Brennan's did not disappoint.  The cocktails were ligh","useful":1,"cool":1},"EgHme8gI_-_4AzHQPzbFCw":{"text":"Brunch at Brennan's is something everyone should experience once. \n\nThe crawfish omelette ","useful":4,"cool":3},"Bm2TIpZ-R7ffPXXn1Hu75A":{"text":"I planned this week in New Orleans to share one of my favorite cities with my partner and ","useful":3,"cool":1},"WP_y0g1GuS9n2fx7KT9Qzg":{"text":"One of the best dining experiences I've ever had. My wife and I went for brunch. Crab omel","useful":0,"cool":0},"jYK8w3YMThN0DBoqEVThWw":{"text":"Ok, let me preface my review by saying this: before you, who are fans and have rated Brenn","useful":5,"cool":1},"8NRfhAs5F1hLIGzNAidSyw":{"text":"Brennan's has been open since 1946 and breakfast at Brennan's has been a staple ever since","useful":3,"cool":2},"WSqbNMno_5arJbDa__Rsyg":{"text":"The line outside was 20 deep as they opened their doors, but everyone had a reservation an","useful":1,"cool":1},"oD-4Ah1tZxLOQAQnCsEMYQ":{"text":"Actually 4.5.  Came by for breakfast/brunch for the woman's birthday week.  Ordered the se","useful":0,"cool":0},"Ia4o0VFuDIAHhZXFlN8UcA":{"text":"I see why this is such a New Orleans legend.  The dining room is so unique, I'm not sure I","useful":2,"cool":2},"Eez2Pe-98duZszd-Zt3-Hw":{"text":"We had an amazing brunch service this morning here! We were greeted happily and promptly s","useful":0,"cool":0},"5UXWM_s_7yodTLpxmbNhBA":{"text":"Didn't quite live up to thee famous name. \nLemon drop martinis were ok. \nAppetizers were g","useful":1,"cool":0},"Rj5m9nmxNteUIUTYEbmPNA":{"text":"Sometimes I just like to go on in and order some dessert and eat it at the bar! Do not mis","useful":3,"cool":2},"3tLtOdiRYm_maFALNpWccQ":{"text":"My friend and I came here for brunch because our Lyft driver recommended this place to us.","useful":0,"cool":0},"QEu6p4pPlf_1rG8p0-2R8Q":{"text":"I would give it no stars if I could. Because apparently black women cant work here with br","useful":1,"cool":0},"k7lyNG9Dm6WIUmdrS1q9LA":{"text":"If not for the chills I am experiencing and hours of vomiting from last night (food poison","useful":0,"cool":0},"1lhrxQlGCKTZrAPCFfhYHw":{"text":"Every bit of charm is poured out when you enter this restaurant! The service complimented ","useful":3,"cool":0},"Mh7id-MI8IwOyHZVxaS1iQ":{"text":"The service was exceptional. Our friends were coming, weren't coming, then coming again. T","useful":0,"cool":0},"2MCpxpou8Ub0jE3U9mZKtA":{"text":"Brennan's is a fond memory as one of my earliest experiences with \"fine dining\". My first ","useful":14,"cool":12},"tRA0l2VsG2IVsv9iTItg2g":{"text":"So much for southern hospitality. The host looked us up and down before telling us that th","useful":0,"cool":0},"TaMAZ9Jsz1FmcVcCdfJmwg":{"text":"This was my first time in NOLA! I must say this spot is amazing. We were a party of 4, the","useful":0,"cool":0},"2jAO0i4oykQsREh9yej7Ag":{"text":"I came here twice for two different types of outings. First time was with an organization ","useful":2,"cool":2},"gDY-japbvvsYcEOqCnDF1Q":{"text":"While visiting New Orleans we decided to stop by this place and try the world famous banan","useful":3,"cool":1},"n7ps7tvopGEQ-nusSFGwdQ":{"text":"We were Facebook messaged by 3 of our friends that we must come come.  Definitely they wer","useful":0,"cool":0},"9KUXZXVT3OF6dRzLUqFqsQ":{"text":"Had to stop by at the home of the original banana fosters! \n\nWalked in and felt a little u","useful":7,"cool":6},"0rKH_SI4H-sVSeSccDf39g":{"text":"Awesome Brunch. Felt safely spaced out for indoor COVID dining. Attentive professional ser","useful":0,"cool":0},"UUuNwfge-laeoNkhz3gCog":{"text":"The food was so delicious! Everyone was amazingly nice! Wonderful place to celebrate a bir","useful":1,"cool":0},"r2T8P45UCN6-l43q5wolNw":{"text":"I've been to New Orleans maybe 9 or 10 times, but this was my first trip to Brennan's. Too","useful":2,"cool":1},"kPevjejehP2NXUyVG9BqyA":{"text":"This was our first time eating here and was not impressed. \nWe had several issues that sho","useful":0,"cool":0},"w6G82q8o1lBQOZKHS7pPfw":{"text":"What a great place to have our first meal in New Orleans! We came here for brunch and love","useful":2,"cool":0},"MWtb62368gzDVRU9-b3YmQ":{"text":"We went for my boyfriend's 30ths birthday and WOW. All the food here was amazing. But what","useful":1,"cool":0},"DAxV0eloWQdYUulHZvgCbQ":{"text":"Came for a work dinner last week and had such a wonderful evening-we got to dine in the cr","useful":3,"cool":0},"DP-ImNBRZs3Pai5NGtjChA":{"text":"Wanted to come here only for the banana foster, supposedly this is where it was invented, ","useful":5,"cool":4},"xfvXH1kh9gpqzcCC74hIDg":{"text":"Let me preface that this review is solely based on our dessert experience! My fiancé and I","useful":1,"cool":1},"6jxqpSo3Y4sU6yvFTKMDnQ":{"text":"We really enjoyed our breakfast/brunch here. Everyone in our party enjoyed the food and se","useful":1,"cool":1},"npdZkrJfESbEh_kH8l_RwQ":{"text":"Okay, so I really wanted to eat at Brennan's when visiting new Orleans because it is an in","useful":1,"cool":0},"41r676oQntaXmErWyfHZdQ":{"text":"Staff is great, food is great. Overall a fantastic experience. Will definitely come next t","useful":1,"cool":0},"eT9osrgyPcNlTljT4FZHYg":{"text":"The inside is beautiful and an iconic place. We haven't been since it reopened but we have","useful":1,"cool":0},"lh5CzOdRgulFeJjbXZ5AIA":{"text":"Simply amazing.  We decided to do Thanksgiving in the least stressful way possible -- no c","useful":4,"cool":4},"2i8jFKh47gKdVfGMYrIMpw":{"text":"So Brennan's is of course a legendary restaurant in Nola, and we had never been able to co","useful":2,"cool":0},"bZSW1Y_rwgtqARw4nCD7eg":{"text":"Visited this place for breakfast on a Wednesday at 9am right when they opened up. There wa","useful":1,"cool":0},"Tni7RYSjeExYwnYMKH5wuA":{"text":"When visiting NOLA you MUST go to Brennan's! Absolutely stunning, European style courtyard","useful":1,"cool":2},"x5tOlDEwNNcjlmqrJQSovQ":{"text":"Excellent Brunch - had the best server John Williams's - if you can ask for him !! Very kn","useful":2,"cool":0},"ifbuZkC8rSK-r9N6DCZkpg":{"text":"Brennan's updates their happy hour food and drink frequently. So if you find a great bottl","useful":2,"cool":2},"iAbl073kALNCPo3kyUBQkA":{"text":"We came here during our NOLA trip to try two things they're known for: turtle soup, and es","useful":5,"cool":4},"-emP-5wO_4MgUJbIUEUKRA":{"text":"Talk about making someone feel special on their birthday! This was more than 5 stars! Than","useful":0,"cool":0},"72zpaImGEnnJsywbuObXjA":{"text":"First service was great. We stopped in for breakfast on our anniversary and couldn't have ","useful":0,"cool":0},"nlhY7cW11ItV1UC-3b5zLg":{"text":"The original banana's Foster!\n\nThe presentation and tableside preparation was handled artf","useful":0,"cool":1},"6IC_Rmx-3gNT7EP9M4UHYQ":{"text":"Delightful brunch at a New Orleans institution - Brennan's is worth the hype!  Make sure y","useful":1,"cool":1},"wdHcsS465HqING7FT5VBRg":{"text":"What am I missing about this place?  The evening went from bad to tres bad quickly and by ","useful":1,"cool":0},"4Xdo3BvZb0jwZ5qradMqHw":{"text":"Let me start off with how wonderful the host was in getting us a seat, the atmosphere is s","useful":1,"cool":0},"X5ELFya1mHYIaUeOcGYDYw":{"text":"If you're a person of color, you should think twice about going to this restaurant. We req","useful":2,"cool":1},"d0ZTYqtf2gb1bQlKhRYnNA":{"text":"Top ten places I've eaten.   Turtle soup was slightly spicy like a chili.  But the short r","useful":1,"cool":0},"coPfDP9kGQSwjeeDJSELMw":{"text":"A very pleasant brunch on the patio.  Started with some Bloody Marys and Ramos Gin Fizzes ","useful":2,"cool":0},"TauSnaA8bbMSfJ9_r741Pg":{"text":"Terrific meal. I had the pork tenderloin, which was wrapped in a Benton smoked bacon. Deli","useful":0,"cool":0},"PuzcXsoTaPenWX_mKXhnUw":{"text":"Disappointed in the fact that we lined up 40 minutes in advance of their opening.  We were","useful":0,"cool":1},"3O5YmjTxMB-YBMYVjEm6iA":{"text":"I was here for my first New Orleans trip - following the recommendation from a friend. Thi","useful":0,"cool":0},"KgxUqDZLuXTbmenYGxkhQg":{"text":"I really wanted to like this place!  We were celebrating a birthday and had an 8:15 pm res","useful":1,"cool":0},"Ioij0JG07OE675m3zMHYMg":{"text":"Though our trip to New Orleans was short but despite our limited time, we unexpectedly hap","useful":2,"cool":1},"9ym5MglQmdK-tBKAN12yFQ":{"text":"We recently dined here for our \"fancy\" dinner night out while in NOLA. We made reservation","useful":39,"cool":34},"-jDHsT4g5HjJktJNxVW1YQ":{"text":"Fantastic all the way around! Amazing service and food! There's not much more to say excep","useful":1,"cool":0},"dCHnAl8sNyYy3N1msR-rcA":{"text":"Certainly overrun by tourists but nonetheless popular with locals. The setting is romantic","useful":0,"cool":1},"W6QjxhL8feDFAQgZhlc_vA":{"text":"Brennan's has stepped up their happy hour snacks in a big way! So much so that we almost r","useful":3,"cool":2},"CnXDQZlN8ZUZCSQkh8mIXQ":{"text":"The problem being from an area that not only is an hour ahead, but also just a place that ","useful":3,"cool":0},"5btCLYWw1r9qqdT60POAew":{"text":"Had Thanksgiving dinner 2017 here.  Simply great.\n\nEverything about this place was great -","useful":1,"cool":1},"E0DZ5iLKScNTtu_N-zymfw":{"text":"We lucked out! Such a hard place to get reservations for but they had a cancellation so we","useful":3,"cool":0},"lf2LnkGQ3tz6ZS7zwtBZEg":{"text":"Brennan's was THE brunch spot to visit if you're visiting New Orleans! My bf and I were on","useful":0,"cool":0},"8Mu3IrZJl7knKsgfeTN1lg":{"text":"My wife and I went here as one of 25th Anniversary treats. Honestly, I could the say the s","useful":1,"cool":1},"XbJJ8wI0efSJwVlhfc5QSg":{"text":"Nice little quaint restaurant in the French Quarter. Definitely had the impression of a lo","useful":3,"cool":4},"nrR-wxyMUaV9FYGkHhFkjw":{"text":"I don't think they're racist, I think the staff here is over worked and jaded. The lack of","useful":1,"cool":0},"xyYjP_ZhhaZrZMO871MBpg":{"text":"We sat in the back outdoor patio which had an awesome ambiance. Lots of greenery and a wat","useful":1,"cool":0},"F39ftg6VTtGbnRyWTp27YA":{"text":"Came here for breakfast/brunch, and reservations are recommended because they fill up quic","useful":2,"cool":0},"i16WwMWVHDgpIwMfBnyBeQ":{"text":"This restaurant was great! Amazing food, drinks, service, bathrooms, etc. I had a Brennan'","useful":1,"cool":1},"V_i8L9Ms9KcknA_B9T-mtw":{"text":"I would eat here again.\n\nI start off that way because it was an odd mix of good and not-so","useful":1,"cool":0},"LjmkYK0Ly1yYOVEmXK4p7w":{"text":"NEW ORLEANS BBQ LOBSTER - $19\n*This was the best thing I had while I was in Nola for 5 day","useful":8,"cool":7},"2Ydlaz8D2VPhOvpE_GZ16A":{"text":"The layout and decor of this restaurant is absolultely incredibke. It's an extremely large","useful":1,"cool":0},"JmT7SV_b4EPe7sHG8qTmbA":{"text":"The Original Banana Foster baby!  We came here for dinner, didn't have reservations and we","useful":0,"cool":2},"LdieVvJyWTvDrU1ahShhNQ":{"text":"Superb in every way! Both service and food excellent.  Blackened Red Fish and Gumbo were t","useful":0,"cool":0},"B4XDRxVPUMH9TslVF25adA":{"text":"My first trip to this iconic restaurant. It's not fit into the schedule before. We had to ","useful":2,"cool":1},"cVQqSOsxWPZmY9RtJ02g8g":{"text":"My brother had firm recommendations to visit Brennan's for their Bananas Foster. Honestly,","useful":3,"cool":5},"DDKLB4VQ6GcBu6gBV3c6CQ":{"text":"What can I say about this place that probably hasn't already been said. My first experienc","useful":1,"cool":0},"jO9PZaSSFnk1qmGvJrDw3Q":{"text":"Truly had a marvelous time here!\n\nService was spectacular, food was well worth it. I came ","useful":1,"cool":0},"3Np1lZcM1A0_-v36SrZWjA":{"text":"Our son has been living in New Orleans for over five years now so we have visited a lot an","useful":1,"cool":0},"BHfGNhiC7pEsPH1fv4HumQ":{"text":"Going B.A.N.A.N.A.S. for this kingcake! \n\nWhat a great first kingcake of the season. The B","useful":0,"cool":0},"94-P2DCVQDLzctI6kUTlJg":{"text":"Very excited about this romantic dinner with my lady.  After making a reservation a month ","useful":0,"cool":0},"giddlTuDsPhLeOPPrd-sRA":{"text":"Such a unique experience!\nThe most friendly and knowledgeable staff. Our server Jamie shar","useful":0,"cool":0},"cL8NRNgQFatWSfkC0_KH8g":{"text":"We were very lucky to walk in on Friday and score a reservation for noon Saturday.  This l","useful":3,"cool":2},"NJvCZzBviFoJe6rjietIsw":{"text":"Really good!!! Turtle soup was like a fancy chili. Gumbo was really yummy with a spicy kic","useful":2,"cool":0},"UOQ_paCiaj6ihEGz0iT4AA":{"text":"Food (3/5): I thought the food was pretty tasty. You are definitely not here for quantity ","useful":2,"cool":2},"hLs2TrUWcba-6dJQMxPGeg":{"text":"Brennan's, oh Brennan's. A staple of NOLA but sadly not as amazing as I anticipated. The d","useful":1,"cool":1},"1Krg_44rO_TCMZJTkUPkYg":{"text":"We are from out of town and wanted to get out of the cold and have some Bananas Foster (in","useful":2,"cool":0},"_ZGn_YJgMvRYd5vhfg5_LQ":{"text":"This is one of the more popular establishments in New Orleans and is easy to find as the b","useful":1,"cool":1},"geRdHppTzAVk3pxltfV65g":{"text":"Brennan's is this amazing restaurant and you know what?!  It's worth the hype JUST FOR THE","useful":2,"cool":2},"WcHv_1AqUHH_PYVtPenNDg":{"text":"With so many places to eat in New Orleans, we still made it a point to come here for desse","useful":1,"cool":1},"ZTVK4Vz1wHzat2-dVAA2lg":{"text":"Service was great, food was fantastic. Gumbo was off the chart amazing. Such an elegant at","useful":1,"cool":0},"r0fRK12xpYmTsGhQQbamQQ":{"text":"Stuffy, over rated expensive restaurant. The man at the reservation desk couldn't even smi","useful":0,"cool":0},"LIsNF-NI-YFgDjYxD9AByg":{"text":"Service here is top notch. The banana fosters is as good as it gets. Coming here for a bir","useful":1,"cool":0},"at6MaUWDxLLEbOj8cH1PAQ":{"text":"We have been to Brennan's a few times.  We seem to choose it for special occasions.  This ","useful":0,"cool":0},"JzsZNzA_ZB8xWI9YVymlwQ":{"text":"Delightful! Adorable atmosphere. The turtle soup was great. And oddly enough, the creamed ","useful":0,"cool":0},"Glw-d2aJayMN237N4RfE4Q":{"text":"One of the best dining experiences I've had. We were wined and dined by the fabulous and f","useful":2,"cool":1},"69apuIVfolqNveDjsMR_-Q":{"text":"I decided that Brennan's would be a great first meal in New Orleans to kick off our trip. ","useful":6,"cool":5},"71b7HM3G2XKVre1VHMGkGA":{"text":"I came for a baby shower, so we had private room upstairs. It was my first restaurant held","useful":4,"cool":0},"dIzryGIYuW4qgRLXTjxoLA":{"text":"Brennan's is a restaurant which you should visit for special occasions and to have an expe","useful":2,"cool":0},"nknB1YxULtpeR5YOen8F4Q":{"text":"This is a must go in New Orleans. I always make sure I get to Brennans. Some of the dishes","useful":1,"cool":0},"YkFfT2R14-MUJFztvlhVVA":{"text":"Outstanding experience!  Heard about the Banana's Foster and told to try them so my son an","useful":0,"cool":0},"odY59dFGTZY1kpvQ1_BtMQ":{"text":"Entrance/Ambiance: Similar to a few places that I visited while in NO, a bigger than avera","useful":1,"cool":1},"frERz8KMEL_wSGTGOSYVtQ":{"text":"Wow lovely place pleasant staff tasty & beautiful food. A treat but worth it  I had eggs B","useful":0,"cool":0},"y9G1w3FUUVtjM5W90nXTHw":{"text":"We made our reservation solely for the bananas foster and it did not disappoint!\nWhat real","useful":2,"cool":0},"IMeNlh093CIVg0txN2L2AQ":{"text":"Post-Covid, Brennan's is hit or miss.  I love Brennan's as an institution. I work nearby a","useful":4,"cool":1},"aDPG2pUh6_nYskAZGyhoNA":{"text":"This is the most heartbreaking review that I've written here. Let me get right to the poin","useful":17,"cool":3},"qpH4mWl8_enUuMhYm3pWtg":{"text":"A quaint place that Disney must have copied for it's French Quarter.  Totally loved the ra","useful":2,"cool":1},"S-NC-gvdHDeEAMXz7xJ0hg":{"text":"This was a 5 star meal all the way around! We drank the milk punch and a house specialty d","useful":0,"cool":1},"gOStv3uqXA1wqt3stidZsQ":{"text":"Loved this brunch gem! All I knew about Brennan's was that it was the home to the Banana F","useful":2,"cool":0},"a3qmebItPi9XNDj6S86iOA":{"text":"Breakfast Brunch - Edition (Actually 25th Anniversary Day)\n\nEGGS HUSSARDE - Brennan's Orig","useful":1,"cool":1},"pjP8-Ny4gocBKCdo7__hIg":{"text":"We went to dinner here on our first night in New Orleans as everyone recommends it. The st","useful":1,"cool":0},"a4Kq4ORu9ryxqY_J5VgOww":{"text":"First time visiting, secured a reservation via open table. Noticed it was a modified menu ","useful":3,"cool":1},"7rsmv7e4FvsMNgp0p7v5_Q":{"text":"The most amazing meal my husband and I have ever had. From the servers to the managers tha","useful":1,"cool":0},"Nv7KDJOqB1BdXI6FRGbbaw":{"text":"The service was impeccable. The food was amazingly delicious. Had the gumbo, I thought it ","useful":1,"cool":0},"jhaKu1gKuMog0aYLbDB2Hw":{"text":"Brennan's was amazing, of course. Food, service, presentation, the room. I have to make a ","useful":0,"cool":0},"QT53lnacHwSOFUbQ7Wai_A":{"text":"Classic dishes with a historical NOLA feel. \n\nI loved the decor and music of Brennan's! I ","useful":1,"cool":1},"HARMoCFV_zcNo0kih0qSFA":{"text":"A must-do on the New Orleans bucket list! True Southern hospitality and ambiance. Make a r","useful":2,"cool":1},"gXAqhxUKQ9Jug3AfPgBLbA":{"text":"I've been here for a fancy pants brunch and a fancy pants happy hour. The brunch was great","useful":3,"cool":2},"JKyK71QdwVZBvg7Twpcpwg":{"text":"We came here based on the recommendations of 3 friends that saw our postings in New Orlean","useful":1,"cool":0},"L_D2F5AZgJK3o1l3NcjLqg":{"text":"One of my favorite places in NOLA! We came for the banana fosters of course. I've never ha","useful":2,"cool":1}}