{"YWDhXfo0Z5J8mgi68F16aA":{"text":"Good food, excellent service!  Not having Thai food in a while my husband and I were excit","useful":0,"cool":0},"VrzfaHN7ZiwdWi6OYGcyNQ":{"text":"This was a last minute post St Paddy's Day Parade dinner. My dining companion and I were c","useful":2,"cool":0},"9VhRTs7BLc1yKij-zclmtA":{"text":"Fantastic. Great hole in the wall type of place, with a neighborhood vibe. Fresh summer ro","useful":0,"cool":0},"epo-SHMWxboRTbDbC8s1fg":{"text":"Worst red chicken curry I have ever had. And shrimp after taste on my salad.","useful":0,"cool":0},"rASfCQptxjyHRFjUaH4OHg":{"text":"Loved this place. The portions were massive, food was delicious, and they delivered 30 min","useful":1,"cool":1},"3eHo7ZcBe5LbXB4T4K7UXg":{"text":"Eh, sorry guys.  No points on this place.  I had the pad thai and red curry.  First, payin","useful":1,"cool":0},"BtsCMEWpoLRzAUFeVbl8xA":{"text":"The Young Coconut is an awesome dish. The prices are pretty high for the type of food and ","useful":0,"cool":0},"q6tJAmznxjs9v_K6yGVgXw":{"text":"I have been to Basil Leaf a total of 4 times. It's hard to decide what I think about it, b","useful":3,"cool":0},"_6xlSshuT0WH1u0LAv9lyA":{"text":"This little Vietnamese lady  (nice lady) is their Thai cook. Not spicy nor flavorful. I be","useful":1,"cool":0},"WCLD3o_EqsisCZ9JZu1BBA":{"text":"Another 'meh'. Damn. I hate writing mediocre reviews... \n\nI started with a veggie roll, an","useful":4,"cool":0},"M1zUgsiwCpliNHsyXmAwMQ":{"text":"This is based on one experience with my dining companion.  We both had the pad thai (phat ","useful":1,"cool":0},"GoPj2fwqmZXyIZVCT3gFAg":{"text":"Perfectly nice place for lunch. Short menu is less than inspiring, but my companion and I ","useful":0,"cool":0},"xEoCcmVJ5yjqmyCZz__LdQ":{"text":"Their hot & sour chicken soup is 5 stars but everything else is around a 3 and sometimes a","useful":1,"cool":0},"uNHNXr03aMi63h1cmbyFLA":{"text":"It is an ok Thai food restaurant. Thai tea was good but the entree was more like a \"Americ","useful":2,"cool":0},"g2jYLukjCKyTl0zHNI568A":{"text":"What happened ?!?  This place slid waaaay downhill. I have consistently eaten here for 10 ","useful":1,"cool":0},"7Sn9ZRtK7nxgjQLJiZLf_A":{"text":"We went to Basil Leaf for lunch and their lunch menu is very reasonably priced, contrary t","useful":1,"cool":0},"egzDnQ1eoLlf7XCXBfiwxA":{"text":"My brother had the green curry with shrimp and I had the Bird's nest with scallops and shr","useful":2,"cool":0},"MSx_uZeGgfJf8kNv1bD9qw":{"text":"Overall: Hm... I eat a lot of Thai and this place was actually very good.  It seems like p","useful":2,"cool":1},"-w76mOCF2cHFmaluJJkeKg":{"text":"Yeah overall my experience wasn't that bad, but all the pieces made it so I would never go","useful":2,"cool":1},"PBjaf4BET9vDZrkZdn1XMQ":{"text":"I would really give this place 2.5 stars instead of three. The menu is very limited and di","useful":1,"cool":0},"fb2kbXJLHErszzw-PWJpwA":{"text":"I have to start out saying that i've had more than my fair share of Thai food having lived","useful":3,"cool":1},"532D0Yyaa8wMpZ3yjd-09Q":{"text":"I can't for the life of me understand why this place has such terrible reviews. Sure it wo","useful":0,"cool":0},"-EvtPp9Y7r6iK9rFCgunYQ":{"text":"Incredibly overpriced.  I tend to judge Thai restaurants by their pad thai first, then mov","useful":2,"cool":0},"bXD_-ETdhOHQbpm_Dd80Dw":{"text":"I have eaten here once in the 4 months I have lived in the local area.  It was OK.  The wa","useful":0,"cool":0},"K8Ofa5hjikwn9ltsCtvsdw":{"text":"If I could give this place 2.5 stars, I would. \n\nI had a very formal family dinner here on","useful":1,"cool":0},"EaSVVKR1yJ9HCV6x2H02Ng":{"text":"In the nearly ten years I've lived in New Orleans, I've only been to this place twice, and","useful":5,"cool":1},"UyKmgcJNQLk4_wgiYNqI4A":{"text":"Went there last night. Ordered the Spring roll by mistake, wanted the Summer roll. It was ","useful":1,"cool":0},"Vzwxsa6O4FBm1DGeii6iEg":{"text":"How has this place not gone out of business?  Is New Orleans that hard up for Thai Food?\nI","useful":0,"cool":0},"EZnTRFN7UMc5c4px43OZfw":{"text":"Some innovative dishes which blend NOLA & Thai cuisines.  But overpriced for what it is.","useful":1,"cool":0},"ldGEFNceo0LZdJw8AJUOYw":{"text":"The food was not good as expected...I asked for extra spicy but it turns out not spicy at ","useful":0,"cool":0},"5DmzqqSpggdANuHhHwu9kQ":{"text":"I am a regular consumer of their Thai Teas, however today was the first day I've tried the","useful":1,"cool":0},"NqG_kexr1IyaYbWNAecU-A":{"text":"OVERPRICED.\nI was really craving Thai food but because I'm completely spoiled by Little Ba","useful":3,"cool":1},"OcKQbl3XZ2u-qgVtSlfxRg":{"text":"Basil leaf is one of the only places in New Orleans where you can find Thai food...and als","useful":0,"cool":0},"gu9AeF4FUsKygjDqYYQu4w":{"text":"This place has been a favorite for a long while. There are too many great dishes to name..","useful":1,"cool":0},"D19cTx4-rpzjABAHdDZQvQ":{"text":"Ok... maybe it's loyalty for the old hood, but basil leaf was staple for me in the years I","useful":1,"cool":0},"1AIj9D7k45sF9_38vvG5jw":{"text":"The food here is spicy, but the staff is very accommodating. You can ask for as much or as","useful":0,"cool":0},"xRbOL_11xC4wAdUTCTaMCg":{"text":"Basil Leaf is one of those restaurants that you only want to come to for lunch because the","useful":2,"cool":0},"BTuXkrw7-fU0ktbNdQt3nQ":{"text":"Aside from sounding like a broken record with the whole \"mediocre food/high prices\", I hav","useful":1,"cool":0},"XD-cF2yRlqezvlcS6x3K_A":{"text":"Bah - ok so I was going to wait to write my 100th review of some place awesome... I should","useful":1,"cool":0}}