{"e7VD-vhj6Gy54fm4jcvDJw":{"text":"Beautiful church.  A must see as a tourist even if you aren't Catholic or religious.  Grea","useful":0,"cool":0},"3escS0eWT5XZ1KZFX68prQ":{"text":"Wedding Photographers: \nMy bride and groom took a session here and the images came out bea","useful":0,"cool":0},"QqDlta3qjgXYPjogH9iUUA":{"text":"Beautiful place! Over crowded. You can  attend the daily mass. There is a small gift shop ","useful":0,"cool":0},"THX5am6vfdmvvWDCUPeTNA":{"text":"The church is awesome to see, but all the happenings that take place in front of the churc","useful":0,"cool":0},"9fxZuJLh4-TYjHzcxtCgyA":{"text":"I was in awe of this historic cathedral! It had an almost gothic-style architecture & was ","useful":1,"cool":2},"LXHKjkVVER-aFZHpILBy4Q":{"text":"Bonita catedral ubicada en el corazón del Barrio Francés y alegre ambiente fuera de esta p","useful":1,"cool":0},"xNu_5C7NX-HGhpvRRCZB-g":{"text":"I downloaded the Tours at Your Feet app, and I learned so much about this beautiful church","useful":0,"cool":0},"2pj5JrM6NrNm6z8sQzMbAw":{"text":"Reverence please! The church is open for quiet touring and prayer, with daily masses about","useful":1,"cool":0},"pFWneyVEeudwEeNQu_5gZg":{"text":"The Cathedral often goes unnoticed with all the artists, street performed, and tourists ar","useful":0,"cool":0},"zeRcFST7Otp7EMCs3SSEVQ":{"text":"What a beautiful church! I enjoy visiting old churches when I travel. This church is locat","useful":0,"cool":0},"6FpR83w59N7bXdm3OO2LcQ":{"text":"A must see on your visit to NOLA.  Hopefully you will be treated to the organist playing! ","useful":1,"cool":0},"CuRD_ef9zPZRLLDR1IJwxw":{"text":"A Very beautiful cathedral. Love the architecture and the design. The murals inside were v","useful":0,"cool":0},"otuN6FCV3W--XDrK54ebmg":{"text":"I loved this church and the peaceful environment.  Beautiful architecture and decor. Make ","useful":0,"cool":0},"92kHppDLnIsqZLSlZ8pkyg":{"text":"Came here to attend mass following my conference and on my last day in New Orleans. As a n","useful":2,"cool":2},"LZm89_zglnySciWw9Yintw":{"text":"Absolutely beautiful. Chock full history. Very large and worth the $5 entry fee. \n\nJust ch","useful":2,"cool":1},"Wpa5cfn_JQy2CCNAfr5dDQ":{"text":"This was such a beautiful cathedral. My family and I went to New Orleans for a vacation an","useful":0,"cool":0},"j52DUxpE69IJUIC9G7xItA":{"text":"This is our country's oldest cathedral and it's beautifully restored and in perfect condit","useful":0,"cool":0},"_Uz-hsMyACyo7mjQAYprtw":{"text":"Absolutely stunning inside and out. Don't go to New Orleans and miss out on this beautiful","useful":1,"cool":0},"A7WgzBOlO8Q1fqVy1EVlDQ":{"text":"Gorgeous historical church in Jackson square.  I loved the architecture and history. The a","useful":0,"cool":0},"UA_HSSJI9chMuv05w2XK7A":{"text":"Breathtakingly lovely. Nothing to do. Stop in to gaze in amazement for a few minutes on yo","useful":0,"cool":0},"gQK_P8GaLeAlP0QmpIpYdw":{"text":"I love coming here every time I'm in New Orleans. It's right across form cafe du monde in ","useful":1,"cool":1},"_ruaa0eG71fZi_DWgaRCaA":{"text":"The cathedral is a must-see on your tour of New Orleans. Beautiful, quiet place in the mid","useful":0,"cool":0},"zYMdUvPQiv04CYOQw8yFmA":{"text":"I think I will flip out if I see one more person thinking the kneeler is a foot rest. But ","useful":1,"cool":0},"bazvEsCDqZlNolwPJXxPQw":{"text":"Good for a 10-15 minute free stop.  Nice but not overly unique church.  If you have not tr","useful":1,"cool":0},"4gD0OPq64vIz012buje-yA":{"text":"Beautiful Catholic church located in front of the famous Jackson Square statue. \n\nMy husba","useful":3,"cool":1},"sw5r3_5nCNypi4z9P1Dbtw":{"text":"We stepped inside the cathedral for a quick look.  It is worth stopping by to see the inte","useful":0,"cool":0},"Uaf8ctVJ6lUaLcCN3R56BA":{"text":"We came to the cathedral and a staff member greeted us. He had lots of knowledge about the","useful":2,"cool":1},"RauKHp3PykANa87Qo_uhQA":{"text":"We visited the Cathedral because of its history of the church. It is absolutely beautiful.","useful":0,"cool":0},"-Aql-XeuPQbuqRAZ_8e38w":{"text":"Attended mass on Saturday. Absolutely beautiful. A must see even if your not going to chur","useful":0,"cool":1},"CwMsGzBz8VZZg9S-bi--ew":{"text":"Located in the French Quarter, just off Jackson Square, it's really hard to miss this beau","useful":3,"cool":1},"HjlLrr5cA2jz_kdMqkoGNw":{"text":"Beautiful church full of amazing history and murals. A must see if you are visiting New Or","useful":0,"cool":0},"-YeAFwctApt6fmdDAl0uiw":{"text":"It was located behind Jackson Square. I went to the inside.I looked like very old church. ","useful":0,"cool":0},"VKpurwcUu0uLrrwT9lO6uw":{"text":"So beautiful and serene. Lovely place that is genuinely nice to go to. Definitely recommen","useful":0,"cool":0},"RVGwE3IjPgxBYhF_8WBxPQ":{"text":"Great Catholic church to take a gander regardless of your religious affiliation. It is a v","useful":1,"cool":0},"gKiWfU6zgRxyYS0Ver3vXw":{"text":"Beautiful church that is an iconic venue for the Crescent City. It is a must do activity t","useful":1,"cool":1},"Vwhhsh-SdMTntp49SpbRbQ":{"text":"Gorgeous and well maintained, this is a must see Cathedral.  During CoVid the mass was 'vi","useful":0,"cool":0},"h6HId3piLp6QnWnlcLESWA":{"text":"What a cool place to visit when touring the city of New Orleans! Catholic or not, you must","useful":0,"cool":1},"PuyyhuFSWhfacyEaYWvP9g":{"text":"Wasn't able to go in at the time but this is a very nice cathedral. The architecture is gr","useful":0,"cool":0},"hGnrJK9vyfn7UrdAPOY3tQ":{"text":"Visit to the cathedral is a must if you are in New Orleans. The cathedral is beautiful and","useful":2,"cool":1},"grLJfyGo5ijjDxCTmpBiXA":{"text":"When you get to New Orleans the St. Louis Cathedral is the focal point of that area. You c","useful":2,"cool":2},"v_xaSvm-j0_r7RysomjExg":{"text":"The Cathedral-Basilica of Saint Louis, King of France, also called St. Louis Cathedral is ","useful":14,"cool":14}}