{"ARRVMWt3zEHaFoM7QUuNWQ":{"text":"Hmph. I'm almost certain that I've reviewed this spot before...but maybe that was undera a","useful":5,"cool":5},"d51WHaQZM_ZUN28dDevvcA":{"text":"One of my fav shops on magazine! Super eclectic and all of the girls that work here are ni","useful":1,"cool":0},"EWWY-bcSI9-inNeLbB9-sw":{"text":"The most unique store in the city! Stepping into Miette is like stepping into Wonderland. ","useful":1,"cool":0},"vEkvLVRwZWwzBj-xzSkJPA":{"text":"Best store for anything .. Ever. Really AMAZING owner. Creative and crafty products you wi","useful":2,"cool":0},"8ESBnX5aH2-4oEFAQ2PhUA":{"text":"As an Etsy enthused person, you know a good funky handmade find when you spot it, and I fo","useful":5,"cool":3},"N4t4D3GtB0HxRKAVvrqHVQ":{"text":"Great inventory of super cool stuff !  Very unique and hip shop.  Local artists and design","useful":0,"cool":0},"D-a5IuedizGjabwwEeoEWA":{"text":"What a fun little shop *and* a phenomenal place to get gifts that verge on the spectacular","useful":12,"cool":8},"EmtW0uZKIrA19wXv5YL7xA":{"text":"This store is literally etsy come to life. A majority of the products (bookmarks, painting","useful":1,"cool":1},"BygIST565hjAv-CX3G7qNA":{"text":"This is an adorable shop, if you are or someone you know tends to gravitate towards gifts ","useful":11,"cool":8},"akum0A_7HvuydkUr-NRytQ":{"text":"Amazing shop chock full of wonderful pieces from local artists! They have these beautiful ","useful":0,"cool":0},"1BxpxNgQFAIEeqlm4cTfbg":{"text":"Cuuuute shop. Wandered into here to find my friends some things and I definitely did! Nice","useful":0,"cool":0},"fuZtge_OpDa6lzBOVhAaIw":{"text":"This place is a pop culture geeks heaven. They offer so many unique handmade items from pa","useful":1,"cool":0},"7VErWp_5OZVLz-SAzWkiww":{"text":"Fun and professional employees, and a treasure trove of items to browse through. You'll fi","useful":0,"cool":0},"MK2gwCkQtoVHuNaW4hSn9A":{"text":"This store is just lovely! I was looking around at various local jewelry stores to try and","useful":0,"cool":0},"OmEL9mgydWXghKPUKMMsLQ":{"text":"Super cute shop. I scored a shark print dress and a purse in the shape of a chihuahua. \n\n(","useful":0,"cool":0},"V1MhvwbLlR_SMB5hBtyjqw":{"text":"There are many cute items in this shop.  I will certainly be stopping by with my Christmas","useful":2,"cool":1},"ztKhfdDQJmVjX_mVsPtFZw":{"text":"Unique and cute little store on Magazine Street. Picked up some soaps that smelled amazing","useful":0,"cool":0},"jLhpwMgoX8W1kgtWSUBBPA":{"text":"Awesome store full of some very original items. I highly suggest stopping in next time you","useful":0,"cool":0},"QUK8lH8xX_XRKcoCbKPA-Q":{"text":"In addition to a great selection of artisan jewelry, there's also tons of cool things made","useful":2,"cool":1},"OtvlSV8mRhfB_FZr1rcJHg":{"text":"Cute. Girly. Fun. Those three words describe Miette so perfectly. If you like any of those","useful":1,"cool":0},"QXvAkAuozs81YUsufDw-Ag":{"text":"I loved this little store! I love supporting local artists and have an eye for weird and u","useful":1,"cool":0},"rNPmHllQufmQFPmkTc4hpQ":{"text":"Quirky little shop of things on Magazine street. I enjoyed looking at their selection of g","useful":2,"cool":1},"Ah4WWWa-6epPNirTTe9cFA":{"text":"I did not know what to expect of Magazine Street when Stef and I embarked on our unplanned","useful":2,"cool":1},"yfjEtIz2m00X7_oq-wJZQw":{"text":"This shop is like a wonderland of goodies. It's the perfect place for gift shopping, I can","useful":1,"cool":0},"DZ2l7LrW4O1lxmBSZlGe8Q":{"text":"This is a cute little store on Magazine with a hipster vibe. \n\nI have gotten some really c","useful":0,"cool":0},"u1v9Abl2MdOljt6JWwtn_Q":{"text":"very cool shop on a trendy little block on magazine street in new orleans. i bought a love","useful":3,"cool":1},"v9HfYvQD0OZgTpk5SzluSQ":{"text":"First things first: the decor at Miette is exceptional. The enormous flowers adorning the ","useful":0,"cool":0},"SCvjTg3PBaCFm4eB7rE9zg":{"text":"I just had a very pleasurable experience at this store.  Jess was my sales clerk. She is a","useful":2,"cool":0},"YJyGJwKB0OtU0ZoMYgBh-w":{"text":"Miette is a really cool shop located on Magazine Street in the same block as Juan's and Ai","useful":8,"cool":4},"c2Ei19-67raEr-9fcZI20w":{"text":"This is the coolest store on magazine street. As soon as I have some extra cash to spend o","useful":0,"cool":0},"yKrb7mO8eM6BtYJ2Jc-p7w":{"text":"Its a great browsing store. Lots of out of the ordinary things to check out. Prices are to","useful":5,"cool":0},"ywR_Ym_2BnGEbHbkS9pcCw":{"text":"SUPER CUTE STORE! The lady at the counter was basically the nicest person in the whole wor","useful":0,"cool":0},"W7V05OzEpYVr69_i9BlgXw":{"text":"Miette on Magazine St. is a cute little shop that has a lot of funky, yet creatively inspi","useful":8,"cool":4},"2Wj9U56wPvT_Gr-JInbT6A":{"text":"I seem incapable of setting foot in here without spending money. Several moneys. \n\nThere's","useful":11,"cool":7},"2KenUYhbNJOlqupodzO4LQ":{"text":"Hahahaha. *takes breath* hahahahah.\n\nFor some reason this place gives me a similar vibe to","useful":3,"cool":2},"OGVNZ2XtUrw_ZJIpzPaBjA":{"text":"So many cute and out there pieces of jewelry, clothing and magnets, some that even make yo","useful":5,"cool":2},"Oz7pm-hn-l77dpWZcX0iHQ":{"text":"Cute little shop with some kitschy and interesting finds.\n\nGo upstairs for an adults only ","useful":0,"cool":0},"Dumq8Vwa3GKaIX9NEiiQuA":{"text":"Someone described this as Etsy in real life and that perfectly sums it up. The shop has je","useful":2,"cool":1},"6ySdqTQCZqmxixUZZ1PDtg":{"text":"Great little unique boutique! Lots of different locally made items for everyone! I came fo","useful":1,"cool":0},"NaEnMvsy2uMI-I4Ixwsodw":{"text":"Cutest place ever! I always stop by when I visit New Orleans. The staff is super friendly ","useful":1,"cool":1},"aRvQLxVEbHUpEXqMFHyrIA":{"text":"I love this store and try to visit each time I am in New Orleans.  They have the most ecle","useful":1,"cool":0},"HlFHxGzslN9dlZ0wncbHTA":{"text":"If you've ever read any of my reviews, you've probably picked up on the fact that I adore ","useful":0,"cool":1},"yKHZLm85eM3Uk3b0o0DBJQ":{"text":"This is one of the stores I think I would love at any age. I'm currently just looking for ","useful":8,"cool":8},"l-tjyMkNg8sPgm9Pjalz4Q":{"text":"Super cute novelty gift shop in the Garden district. There's a little something for everyo","useful":8,"cool":5},"icOagJN8RDgkPwH5ianDOQ":{"text":"This is my favorite shop on Magazine st. There's something for everyone. Gorgeous unique t","useful":1,"cool":1},"VoO-lT9VGCuKIcdNIDlfPg":{"text":"I noticed Miette strolling down Magazine street and decided to stop by my second time pass","useful":0,"cool":1}}