{"2bD6MLO1_P5hKholIwo0Og":{"text":"Great place in New Orleans East \nFood and drinks are on point \nFriendly staff..Great addit","useful":1,"cool":0},"YS4Mxuf1PL1RJ1pBV6IBpA":{"text":"We had a nice time at Mermaids. The food was absolutely delicious, from the appetizer on t","useful":1,"cool":0},"AEKJk_oVbO8rA1jItX84RQ":{"text":"I had the shrimp basket when I went, and it was great! The women behind the bar were very ","useful":0,"cool":0},"_17OSGSk5_gIst2-QF9iwA":{"text":"Ordered this via a delivery service because it was just one of those lazy days. I was skep","useful":1,"cool":0},"4_C-lon_-9Y6O9R1Kk7UcQ":{"text":"Great atmosphere and excellent customer service. The Bayou pasta was the best shrimp Alfre","useful":1,"cool":0},"uOI-hl73eKDDTGTj2GYUNg":{"text":"BEWARE OF MERMAIDS....\nI tried  this place after seeing it on restaurant.com. I placed a t","useful":0,"cool":0},"WUaIBznOgy3CZrOIqm8yuw":{"text":"Decided to check this place out after buying a Groupon. Ordered Shrimp and Oyster platter.","useful":0,"cool":0},"cFnYHo_Q79kmyeYCN6ZMMw":{"text":"Missy the bartender had outstanding service! She engaged with us the entire time. When we ","useful":3,"cool":1},"0ayGAdvG5muZ-DmJ9BU7Lg":{"text":"Mermaids is a new restaurant in New Orleans East. It's a welcome new addition they have 10","useful":8,"cool":1},"Ho8eX8X77mG_nc1VCQ4_JA":{"text":"My husband and I tried to support a local black owned business. Let's start with the wait.","useful":0,"cool":0},"eJI1t29xO553X2CARYaUBA":{"text":"I recently went here to pick up some food to go. As a resident of New Orleans East I love ","useful":2,"cool":3},"q1jce5HWbnUQX7p2G2scgw":{"text":"I recently discovered Mermaids on a food delivery app and I was extremely impressed! We or","useful":1,"cool":1},"2RtYg26NXVVtF58H56gR1Q":{"text":"Waited over an hour for my food to be told they were out of both things I ordered. My frie","useful":0,"cool":0},"J0FDLlQM0JVFPz61TDMzOw":{"text":"Really wanted to support a business in the east. However, the service is ridiculously slow","useful":1,"cool":0},"HMFrfnmfSGl3CZafMwrvGg":{"text":"Looking for great service? Good food ordered to your specifications? And satisfaction? The","useful":0,"cool":0},"Z_oAXZ8JSTDxJDM6FfEn8g":{"text":"Horrible would be an understatement. Spent $70 for much of nothing. Fried seafood was soft","useful":0,"cool":0},"MM2HT39Q9XtsaS6uwT-UFg":{"text":"Ordered via a delivery service and I got my food super fresh. Tasty! Would definitely retu","useful":1,"cool":0}}