{"rj4gASFpFXelRKWjdr6sMg":{"text":"Lauren was communicative, fun and did a great job! I'm so lucky to have chosen wisely! We ","useful":0,"cool":0},"JYVu89dnc9YeyOglLZaSFQ":{"text":"I have gone to Kelly for the last 3 1/2 years and I must say she is absolutely amazing. Wh","useful":1,"cool":0},"DQeOJRR0ycGZwys_1GCQmg":{"text":"Went to Albert Brown Salon and had a great experience.  I visit New Orleans all the time a","useful":0,"cool":0},"pmePkehyyQgLCuyJ1Un5Zg":{"text":"Love love LOVE my balayage by Reneé. I gave her a bunch of vague descriptions of warm, car","useful":0,"cool":0},"ymoybFrydBMnux-GExhtuQ":{"text":"I'm so bitter about my experience here I don't know where to start. I guess I'll start by ","useful":9,"cool":0},"69YxMJLeJv7Tl29fcODCSA":{"text":"I recently had a \"20's\" inspired photo shoot with Make Me Up, and they sent me here (right","useful":3,"cool":2},"VYgevZi5yETL2nQQ8eeInQ":{"text":"I met Albert on a film set where he was doing hair for the principals (stars) and about a ","useful":0,"cool":0},"qrl2pq2PVDNvkfwQc7SAgA":{"text":"Highly recommend!  Great salon for event-worthy looks. Several artists are wonderful but I","useful":0,"cool":0},"NbU8slGzwyMN-xSsf02uTw":{"text":"I was encouraged to come to this salon based on some great work Kelly the stylist had done","useful":0,"cool":0},"TLcuujdVPsCTpDo8N_rkDg":{"text":"I followed my hair guru Madeline Brown here from her previous salon, and have never looked","useful":1,"cool":1},"vtBAxr3lFwxCgYbh4sRjCg":{"text":"There's a lady who works here. Her name is Madeline. If she was cutting hair in a back all","useful":4,"cool":1},"C1Lomn4IQzT7envqR93CCw":{"text":"My hair is extremely thick, dry, and course. Ive lived a lifetime of struggle with accepti","useful":0,"cool":0},"GfuojCCsvogUwEjk9JMO_g":{"text":"The worst blowout I have EVER received in my life. For something so basic I had no idea th","useful":0,"cool":0},"I_EV8isw2XySzsDl4ONodA":{"text":"Quite possibly the worst haircut I've ever received. I have a simple and very routine hair","useful":1,"cool":1},"aojsUd0G6zxuUlezC9KbgQ":{"text":"I had a Brazilian blowout with Arthur last week. In my 6 years of blowouts, Arthur's has b","useful":1,"cool":0},"CZF4jTDqigyYLdAoLArVQg":{"text":"Not a great experience. I'm sure most people would have better experiences than me. I arri","useful":0,"cool":0},"iwEmb0Ddq8wELeicJZcPnw":{"text":"I just had my hair \"sculpted\" by Arthur and it is the best thing that's ever happened to m","useful":3,"cool":1},"EmWIK87Ff35KqTXWWddr1Q":{"text":"Great service, courteous and knowledgable staff.  Have been going there for over two years","useful":0,"cool":0},"Xd7DSux-Pd05uAkutp8vCQ":{"text":"The best salon/beauty staff ever! If you need a change, they do the most awesome makeovers","useful":0,"cool":0},"IYbF9ri3ZYVD5ZV3WaJPBw":{"text":"Albert Brown Salon is the best in NOLA!   Great service, attentive staff, cool salon and c","useful":0,"cool":0},"qllNI9vcEe3JAqMM_hiibQ":{"text":"I called this Sunday to make an appointment and there was only one person working.  He ans","useful":1,"cool":0},"jGO97h35egRjZaReWrgGtQ":{"text":"THIS IS MY FAVORITE HAIR SALON IN THE PROFESSIONAL INDUSTRY OF HAIR ; Color, Cut,Style all","useful":0,"cool":0},"4pk3W5oACAAhMiAZgKG3Zg":{"text":"I had the best experience yesterday at Albert Brown Salon in Uptown New Orleans.  The pedi","useful":0,"cool":0},"sMiv1IIJ61YG2_Rk3X5GhA":{"text":"Albert Brown is Master of all things style and hair.  Beaucoup years of experience, a long","useful":0,"cool":0},"mJOxiXkIB6bf3X9gTslMkw":{"text":"He has actually moved onto Magazine Street at Louisiana Ave!  Albert Brown does my hair fo","useful":4,"cool":1},"VjxYEa8gK_c8x6qdYkuMuQ":{"text":"Ok this place is permanently closed so why is it still so revenant in the web??  You ask f","useful":0,"cool":0}}