{"k_xeVEuSctjNTudTsZx7GA":{"text":"By far my favorite restaurant in the French quarter! I even got my boyfriend whose not muc","useful":0,"cool":0},"WD7Ke8uHN7p7wBkbQ9Nyzg":{"text":"Kendra was amazing and the food was the best we have had.  Get the sausage po-boy With Bac","useful":0,"cool":0},"ZUxEJe4UgJ-NtxyaC9TSJQ":{"text":"The crab & corn chowder & hush puppies were delicious, all the rest I could take it or lea","useful":0,"cool":0},"LI_vaVF9CqpSoyGJjrFBUA":{"text":"Excellent food I had the blackened chicken Alfredo and it was outstanding!!! Our waitress ","useful":0,"cool":0},"FmlyKoOpz9a1DpyN7HxQVQ":{"text":"We should've gone somewhere else. New Orleans has too much good food to eat here!  I order","useful":0,"cool":0},"RRSzm0dhQro-5S4Tc3CuPw":{"text":"Chartres House is A-OK. I wish you could give half stars on Yelp, they'd totally get 3.5. ","useful":1,"cool":0},"qsen-5gk_l8KtlHPFqrG1A":{"text":"Visited this spot last night and it did not disappoint! We had a group of six and was nerv","useful":0,"cool":0},"96uXFr7rhebACH98PEt7AA":{"text":"We came here after that awful Gumbo Shop establishment a few blocks away wouldn't seat us ","useful":0,"cool":0},"Dnp3IheLQfE8atBM3W7QZA":{"text":"We found this place by accident during our stay in NOLA, and a happy accident it was. Our ","useful":0,"cool":0},"AIxFYYs3Ld9nzaVRqjIfmg":{"text":"This was our first night in NO and the 4 of us used a restaurant.com certificate. \n\nWe sat","useful":0,"cool":0},"Lj7pBZ7Jh738sZT07dydHA":{"text":"Had the crawfish po'boy, fried alligator app, and some prosecco. Nothing special, undersea","useful":0,"cool":0},"4XMz7C5oHsjATlInXkFF1w":{"text":"Quick Summary: Decent food, slightly higher prices, good beer menu, slow service. They als","useful":0,"cool":0},"YGGt_1wjzBa-5WHWLJK-fA":{"text":"Wonderful dinner great appetizers. Alicia was amazing with our changing needs:). What a do","useful":0,"cool":0},"csfa0eTSh2QfZMiqskNnhA":{"text":"The food was ok.  I have had better seafood in New Orleans and their prices are pretty hig","useful":0,"cool":0},"GHM1asXEInFn3CZ02D-LdQ":{"text":"Disappointing, overpriced food. Portions were small. Fish was so over cooked, it was almos","useful":1,"cool":1},"NSJO66y-Z3SgsAYMRIgrKg":{"text":"Womp womp... I ordered the jambalaya with fried chicken. Sounded good right? It came out w","useful":1,"cool":0},"BsYBFVmhguYDP8G4ojXJPA":{"text":"My mom and I came here after a recommendation from our hotel staff. We were seated right a","useful":1,"cool":1},"rNbcUeCgJHWnBWsK816fvw":{"text":"Relaxed New Orleans atmosphere, very centrally located. Excellent roast beef Po boy! Good ","useful":0,"cool":0},"iWrtRBw-3wbSXbs12tu8BA":{"text":"Stumbled upon this place for lunch. I had the blackened chicken pasta and really enjoyed i","useful":0,"cool":0},"3mVwDZD9d3Y7kWgQ6nXMVw":{"text":"I would not recommend this restaurant. It leaves a whole lot to be desired. The stars are ","useful":1,"cool":0},"-MRNDZthk3kewuCDV_ndYg":{"text":"Four of us had dinner and drinks here tonight. The food was fine, the drinks were good but","useful":0,"cool":0},"7WEinURTjlklSnbKVU8ksQ":{"text":"Really disappointed with this place. The staff was completely rude. The waitress that sat ","useful":0,"cool":0},"kJ8UA-V0v4nBHhUF8ZHJSw":{"text":"Slowest service I've had! We seriously waited an hour just for our DRINKS, despite there b","useful":0,"cool":0},"vmsZOKTKrUQYdF_YUHcVKA":{"text":"Overall this was a pretty good place to eat. I sat at the bar out front but in walking aro","useful":0,"cool":0},"z3zOTTZF2lg3eouCAYmH4g":{"text":"The crawfish toast was excellent.  We tried the Muffaletta (shared it as portions are HUGE","useful":1,"cool":1},"M_AjLtV0udmEUZ6Xbxamwg":{"text":"We needed an afternoon drink and snack after our tour and were thrilled to find this gem. ","useful":0,"cool":0},"FjgxEUvnu1pAkTUvfU0B4A":{"text":"HORRIBLE service, clearly because of poor management and not entirely the fault of the clu","useful":0,"cool":0},"pFNA1Y2XK15hVaviSdAuQg":{"text":"I am waiting for my food. The rat running around the dining room is highly amusing. I hope","useful":0,"cool":0},"ajCS2J8JdPl7cdtEMviX-g":{"text":"We first ate here in 2014 when we came on vacation, and here we are again. I absolutely lo","useful":0,"cool":0},"yPFVyF1js4luS2dzkd3sCw":{"text":"Tevin is a very nice server. Drinks are tasty. Food was good and they didn't skimp on rice","useful":0,"cool":0},"ieWbQFF4m1N_23EvS_CBWQ":{"text":"It's an ok place. I have had much better po' boys in New Orleans but the rice and beans wa","useful":0,"cool":0},"P42OdjwZOItT_bsLsnmu3A":{"text":"You can do much better than this place. It's really a last resort when you're hungry, hot ","useful":0,"cool":0},"ToSNg6JkNK476Fd5MamLTQ":{"text":"One of the worst meals I have had.\nOnly redeeming feature was our waiter who was very nice","useful":0,"cool":0},"qLaxDWJupRKfdv7SxWNBsw":{"text":"Nice open air atmosphere, but if you're looking for good Creole food, keep walking. The cr","useful":1,"cool":0},"oxl4lg_RcNXHN_CGmG-zkw":{"text":"Michelle was our waitress and was very friendly. The atmosphere is nice and opens onto cha","useful":0,"cool":0},"phiJQfxs0GpXp6DDOy-C_A":{"text":"Sooo, we had a bad experience here. They sat us in a back room, off the street, all by our","useful":0,"cool":0},"Z4A0EhJ-JbeXQpupxaSGlA":{"text":"Good food and good atmosphere. \nThe waiter was kind and helpful. \nWe had the spinach artic","useful":0,"cool":0},"w8LC6wPPQKsVXLuPVwA3-A":{"text":"Seriously a really bad restaurant.  From food, to service, to the cleanliness of the bathr","useful":0,"cool":0},"AncnlMA9cdEtiMUmQ4EELQ":{"text":"Great service and they have a vegetarian entree!! Thanks for thinking of us veggies!!\n\nThe","useful":0,"cool":0},"x0w8LrNnDtp1kAuDF1tkFw":{"text":"Just checked this place out this past weekend, and if you are a vegetarian they offer 3 gr","useful":0,"cool":0},"FV-dFjLm-0oM7wqIFNua9A":{"text":"Incredible atmosphere, both inside and in the back dining area. Great portion sizes for yo","useful":0,"cool":0},"GEjhCXJ8Xm6cJUqhE5bwiQ":{"text":"Best BBQ Shrimp recipe ever.  Get the BBQ Shrimp appetizer.  Get two.  It's delicious.  We","useful":0,"cool":0},"-Uk2JcJOBUDa3KO7mfthRA":{"text":"Our server was great and very attentive.  My husband ordered the cashew crusted red fish. ","useful":0,"cool":0},"-BNUtah0JXqMcV7LR1ZnrA":{"text":"I love wandering around New Orleans and finding new places to eat. One of those journeys l","useful":0,"cool":0},"zPfosDL_Ou-oLc4oD_Gexg":{"text":"Searching for a restaurant and stopped by.  The food was surprisingly good.  Had fish with","useful":0,"cool":0},"lwG0MiNjR5O5v5F8BfIoIg":{"text":"Ask bartender Kurt to make you his drink-contest invention, the \"Hot & Dirty Peppertini,\" ","useful":0,"cool":0},"XH5UhePnysQWAST7M7ai_Q":{"text":"Great atmosphere, great food and excellent service. I really enjoyed my fried alligator an","useful":0,"cool":0},"_5kMrb5ELrAXZ9lzueHkOQ":{"text":"If you have a lot if time on your hands to suffer through our service, the food is good.  ","useful":0,"cool":0},"vRonjCDXHvInsd05N-kNBw":{"text":"Felt like I was on an episode of Kitchen Nightmares. We ended up here because everywhere e","useful":0,"cool":0},"yVM-ZIFx5ZdODXblKgU8XA":{"text":"Everything was good here except for the one thing that really, really matters to me: clean","useful":0,"cool":0},"xzmvLo1wntcdkJYrT5_D4A":{"text":"stopped in to whet the whistle on a daytime walk around the area. found some decent drinks","useful":0,"cool":0},"6LULGQPo6JuAYjZBZvvaDQ":{"text":"Stopped in here for some po boys with my mom. I got the shrimp and she got the fried fish.","useful":0,"cool":0},"EoWXlw-OMvk5jb7mq5pR_g":{"text":"Good food open atmosphere we had a bloody Mary and a mimosa at the bar the shared a blacke","useful":0,"cool":0},"Cz9PlF6CRFtp5go2cqiIjg":{"text":"Came here about 45 minutes before this place closed and sat at the bar.\nThe bartender was ","useful":0,"cool":0},"TSINFGVGRuWPa-03robCCA":{"text":"Good (and lots of local) beer selection and interesting drink menu. Great service.","useful":0,"cool":0},"WaPQaz4Fb_smR5qXIWp5hQ":{"text":"One of our favorite places in the quarter. Great service and good food. As visitors we vis","useful":0,"cool":0},"M-sCcZpR3HHyCwK1MdTjAg":{"text":"This my second time here.  And it's just like the first time.  Excellent service . Chrissy","useful":0,"cool":0},"70hgeJrMbZb-fdiCikelPw":{"text":"I would give Chartres House Cafe 3.5 stars. I ordered a salad and it was pretty good, but ","useful":0,"cool":0},"gCvNrcsycAP6rV-eaoQpdw":{"text":"The husband and I ate here the other night and loved it!\nMy husband had the fish stuffed w","useful":0,"cool":0},"-LKisCZKS6TW2En6a_dEpw":{"text":"2.5 stars - Well, I think I give it 3 stars and my hubby gives 2 stars.  I liked our fried","useful":0,"cool":0},"wOBkZAcruHMFEo6aJx7iZA":{"text":"We stopped in here for a late night supper. We were seated on the sidewalk so we could peo","useful":0,"cool":0},"63_pyX9ES707BwDXjx-0yw":{"text":"Got seated right away on a Friday night. The host and server were both great. My reasoning","useful":0,"cool":0},"We3o2VUTsXyxxuDJl38uVw":{"text":"Best service & atmosphere UPSTAIRS on the balcony. Tables on the balcony only seat 2 peopl","useful":1,"cool":1},"yA3yJ920vNLn_xe7LStQPA":{"text":"During the craziness of Mardi Gras we came across this place. \nThe food here is good we ha","useful":0,"cool":0},"d0CahfJuW7DA_OEPoSYg7A":{"text":"A great restaurant with a variety of food in the French Quarter. I had the blackened chick","useful":0,"cool":0},"V9yYh2VQSot1f1iU8yroLg":{"text":"Really good food at reasonable prices. Great beer selection as well. We had crawfish stuff","useful":0,"cool":0},"DX0OVphNkNQz8GGtgmS3Rg":{"text":"The food was amazing, easily on par with much higher priced fare in the quarter. Pierce wa","useful":0,"cool":0},"Hdbzf1hvgei55SaEN_fvdw":{"text":"Atmosphere was nice.  I ordered a Roast Beef PoBoy and the roll seemed to be microwaved be","useful":0,"cool":0},"4GG38tRDKTeXLh_chm6WvA":{"text":"Sitting on the corner of Toulouse st and Chartes st, this cozy restaurant was nice spot fo","useful":0,"cool":0},"fG6bI_pErgNzOHG1_gYuJw":{"text":"Great location in the French Quarter. We stopped there for late night drinks and desert. T","useful":2,"cool":4},"EvQpmiXljJxpHRswqv-_nw":{"text":"Nice atmosphere, meh food. After having an amazing  fried chicken and jambalaya at (eat at","useful":1,"cool":0},"bFfPvmFS8P8IYkJsw07-dQ":{"text":"Petar our server was helpful with his entree recommendations right on. Our Fried Green Tom","useful":0,"cool":0},"LQ7nvrqAb5MqtUj9nLtqFg":{"text":"I wish I could give them a better review, but I just can't; I had a terrible experience. T","useful":1,"cool":1},"SyZV8jzZJy5KsjAZimSNEA":{"text":"Excellent service! The staff were all very friendly and accommodating. Great food and atmo","useful":0,"cool":0},"GyqlohasMUoUYFD7XADHJg":{"text":"Overpriced for the amount of food you get. I got the Taste of New Orleans with 3 of the 4 ","useful":0,"cool":0},"Fg9Nu0LSOZo2qzr0MxDIPQ":{"text":"Food was good. It was a bit odd upon arrival because the hostess (who also turned out to b","useful":0,"cool":0},"HVSmV3FlQRShssGI_iY3Gg":{"text":"What can I say the fried gator was to die for. On a one week vacation we went here twice!!","useful":1,"cool":0},"Q4DNJ-I4GGvt5vaI-M4mvA":{"text":"We loved this restaurant! After 3 days in Nola this was our most favorite restaurant! We h","useful":1,"cool":0},"s5q6XR7t3AIhEiS216aVhg":{"text":"Stopped in for lunch on our first day of vacation. The restaurant and staff exceeded all e","useful":0,"cool":0},"bRFdVwzkJqvPNpTPiX0dZQ":{"text":"Atmosphere: Service was ok. We sat in the central courtyard and watched RATS run around th","useful":0,"cool":0},"83B3MM48RrYmxv4ENIZKTg":{"text":"Pierce was our server and he was very professional.  Provided us with guidance related to ","useful":0,"cool":0},"ioF5-GcFqO6SsjU_ZkD7Sg":{"text":"Sparely topped Greek salad, but with awesome dressings.  \n\nNasty entrees. She had the shri","useful":0,"cool":0},"YZfFV-1cTu2sLgIZyfkKBQ":{"text":"Saturday night, during FQF, my friend and I stopped into Chartres House for a few drinks. ","useful":0,"cool":0},"yhjsl30aUoWB2RyIrP6PGg":{"text":"Delicious Creole Combo gives you a taste of 3 or 4 traditional dishes.","useful":0,"cool":0},"FvI2UXEB_3Sw_RHcL73Kxg":{"text":"The food was okay!  My wife enjoyed her crawfish platter with remoulade dipping sauce.  Sh","useful":0,"cool":0},"4o7Qyr1SHe0TGJp59lSpQQ":{"text":"The service was somewhat slow, to start... and got worse from there. Was starting to think","useful":0,"cool":0},"z-MvtwdPktk-_mQ6sAFlGQ":{"text":"Love this restaurant! Really yummy drinks and a great menu! If you come here, make sure to","useful":0,"cool":0},"SzhPWeVzrtMlgH69hXwgmg":{"text":"Literally beyond annoyed. Still sitting here writing this review, that's how annoyed I am.","useful":0,"cool":0},"KBraO2g3hdIiQ8fqqE05Lw":{"text":"Great place for casual dining and for a quick bite to eat.  The eggplant po boy was superb","useful":1,"cool":0},"attezrhDMl5IXehWRG9UVQ":{"text":"Balcony seating and good service! I had the portabella burger and it was delicious! Great ","useful":0,"cool":0},"zSRGMAfs6chvaScbimOw3Q":{"text":"We sat out on the balcony on a sunny day in December and had a lovely lunch with very atte","useful":1,"cool":1},"Xz2LfafnWlMKlx1aE1Jabw":{"text":"It says fresh seafood proudly on their front door HOWEVER, I know SYSCO shrimp when I see ","useful":0,"cool":0},"PxtC5evGgoz9UWSp8ziiuQ":{"text":"We sat on the balcony upstairs not only was it incredibly cramped it seemed incredibly uns","useful":0,"cool":0},"ziLKq_qtEYF9xiiKQUKcpg":{"text":"This place can do no wrong.  I've eaten here twice and completely loved both experiences. ","useful":2,"cool":0},"zdr-imp6tnrVJhNzB43DLg":{"text":"Great food! Great vibes! Nice view if you sit in the patio! Schuyler was our server and he","useful":0,"cool":0},"Kh1CJOpJQHFgK5C6QGk6hA":{"text":"The FGT were spot on, crispy, thick cut, and not greasy. The crawfish stuffed fillet was c","useful":0,"cool":0},"dm9Xz-RqAzjv5C27PnJSBA":{"text":"The Crawfish and jambalaya was really good. This place has an open view of the streets whi","useful":0,"cool":0},"dU-ZFJIPv4zRppNQwky1yA":{"text":"We ate on the balcony. Thomas was the waiter. We had shrimp. Po boy. And chicken alfredo. ","useful":1,"cool":1},"cJX1tmljI0mPH1-hBR7AIg":{"text":"Regardless of the late hour this place still produces.  Eat the bbq shrimp appetizer. You ","useful":1,"cool":0},"XzCvq_x7oHw4PDekaATkVQ":{"text":"I wanna sit here for the next 3 hours because the food is so good it just defeated my legs","useful":0,"cool":0},"zDLoPMaTEJAq2Z55I_NBMw":{"text":"Food Descent.  Had Ultimate Fried Seafood platter (not on menu) for $25.  Good to split or","useful":0,"cool":0},"kkVhxXwJstZNxeH0hX_Blg":{"text":"OMG! The best BBQ shrimp! I need the recipe. Nice environment ! The service was fabulous. ","useful":0,"cool":0},"Rq68V2D9oDm7rXBwcT6GUw":{"text":"Get the spinach & artichoke dip! The \"chips\" are fried bow tie pasta-very unique. I got th","useful":0,"cool":0},"P-0pQbUIRM_MtEfZf3MMyw":{"text":"This is an amazing bar and grill. It could also be considered a \"pub\" by some. There is se","useful":1,"cool":0},"tpYtsYLA8Gmy-2PEm-sgxQ":{"text":"Basically a tourist joint. Decent food with decent prices and a decent selection of sugary","useful":1,"cool":0},"JoifF9C_pIqfveJuXvR1Hg":{"text":"Excellent service from Mr.Pierce! We always have a great time dining here-- with delicious","useful":0,"cool":0},"4ZL2ZNQtcoJgC8libuLe3g":{"text":"As much as I wanted to give this a five-star experience because of the wonderful attention","useful":1,"cool":0},"BRSHozfJQILqDbiFYj8bxQ":{"text":"This was some great food. I had the crawfish bread and crawfish pasta. I would  recommend ","useful":0,"cool":0},"6JhKoPO_pEFzT4hK-83Jzg":{"text":"Quite interesting.  The table behind us had been waiting over an hour and had I not gone t","useful":0,"cool":0},"eOS_z1s3-okOT6a1Khfm6Q":{"text":"I so wanted to like this place that I gave it two chances! \n\nThe first time, I ordered the","useful":1,"cool":0},"4dmh2eRtR8slH-wvFdp9dw":{"text":"They were able to accommodate a group of 10 of us in the back room (with reservations on F","useful":0,"cool":0},"_pvYQ77Prn3QSO2aLI4J4g":{"text":"Service is very good    Bartender was willing to create a special margarita drink and then","useful":0,"cool":0},"ZJNlCXLtsFOO_aBzJJ9Sfw":{"text":"Love the hostesses - always so friendly! The service is usually good and the food is alway","useful":0,"cool":0},"9KuJWK-e1bchS5uATPYB6w":{"text":"We sat and ate in the courtyard which was small, quiet, with a fountain in the center. The","useful":1,"cool":0},"6LY_OphrIjj0BqDeu-8dVA":{"text":"Triple threat! Great staff, great food, great prices! Downstairs is a bar seating area, in","useful":0,"cool":0},"UZbgiEXtSq3VdRMYJ_PQBw":{"text":"The food was subpar....and asked to speak to the manager about an inquiry on our check. Th","useful":0,"cool":0},"a_mqy-Wf9qsrgaMqcayFjw":{"text":"Had a reservation at K-Paul's but didn't feel the menu was grabbing us for the price tag. ","useful":0,"cool":0},"0kjrkQRzmeozBDnuEVr1ow":{"text":"Ask to sit upstairs on the balcony, there's a lovely view to sip on your Hurricane and wat","useful":0,"cool":0},"XKkaNWrpzoJNXiNtZSwE2A":{"text":"Great NOLA cuisine . It's a must if you're in the French quarter !! I ordered shrimp over ","useful":0,"cool":0},"C_migmF3_e1ALtILDV85Mg":{"text":"Louisiana Lemonade (whiskey)......legit!  Also get the sampler...the Red Beans and Rice we","useful":0,"cool":0},"Q0d6PiGnw9zi2FFLkpXEYQ":{"text":"We were greeted by a very friendly hostess and our waiter was also very welcoming and prom","useful":0,"cool":0},"m32EzJCByPWYd3rUSBbZCA":{"text":"Second night eating here while on travel. Enjoyed both times. Had the blackened redfish an","useful":0,"cool":0},"PwyCieVExXQvRNdk_B4VKA":{"text":"If this rating was for the food only I would have gave it a much higher rating. The only r","useful":2,"cool":1},"9kE64q2d0O7TdOGldhkoNA":{"text":"This is a decent spot for lunch if you're in the Quarter, and I've never had a bad meal he","useful":0,"cool":0},"DGIU-KZc5Ew5BmLu_5sRDA":{"text":"I stopped in for lunch and just happened to mention I was on my lunch break.... hello 15% ","useful":0,"cool":0},"EyAWrYactzgd2o59cw8DEg":{"text":"Lucky to wander into this spot! Alicia was our server on the upstairs balcony. She definit","useful":1,"cool":0},"436ZxuwDzYyRZKwkYsKROg":{"text":"We really liked this place. The back patio was nice and we had Alphonse as our waiter who ","useful":0,"cool":0},"518RJQcgFZU8pDeF-MlVCQ":{"text":"Went here randomly during our first night in New Orleans during our first time visiting.  ","useful":0,"cool":0},"N91Iv-tqRx6DqkPuOJCWlQ":{"text":"Decided to give this place a shot today and I must say that I was very disappointed. I saw","useful":0,"cool":0},"leIQxE0WeMisOV7STCKyRg":{"text":"We come here every trip. The Praline cashews redfish is the star of the menu. Excellent.","useful":0,"cool":0},"Rlf8IZfc4t1fL8t_GrlYfg":{"text":"Just ok!  The food was just average. We sat quickly. Waiter was nice and accommodating.  T","useful":0,"cool":0},"XawZBYG82x4mC80zM9u1VA":{"text":"Great service, great food! I had the crawfish bread on the appetizer menu and couldn't eve","useful":0,"cool":0},"Vu3U8xLNRfBy-JctpYn01Q":{"text":"Fish platter was amazing!  Ate here twice because it was so good!","useful":0,"cool":0},"_hvQttCjwfjMlMjL9CFg8w":{"text":"Yum !!!\nFood was great!! Nice variety in the menu. Even had veggie options ( portobello mu","useful":0,"cool":0},"paF-yyBEADXzBbSqrHhm8w":{"text":"We stopped here our last night in New Orleans. Courtney our waitress was great! Food was g","useful":0,"cool":0},"IKUbH0r7gdLH4ojwrp7ung":{"text":"Excellent! Server was Bill, with help from Chrissy  on the floor. They were a great team, ","useful":0,"cool":0},"1GZN8KS2BMkswfwUAahlKg":{"text":"The service was great here! The food was pretty good as well. I had fried green tomatoes (","useful":1,"cool":1},"-cmhaRvXcxfJxWOTSVRdDg":{"text":"Best place I have eaten at in New Orleans so far. Our waiter was attentive and kind. Took ","useful":0,"cool":0},"VGCgB6B85uDqNusEhp4bIQ":{"text":"One of the first places we go when we hit town. The BBQ Shrimp is out of this world. The b","useful":0,"cool":0},"yQkJ1mVBJf5J5SwVxrgZ6A":{"text":"Overall dining  was good.  Sat out in the balcony and people watched.  Our server was cool","useful":0,"cool":0},"pdhsnIk6hGUvSsblBsTU7Q":{"text":"A little over a week ago we visited Chartres House.  Kelly, our waitress, went above and b","useful":1,"cool":1},"RoH3ZrscVcFSPwfw0T3UYw":{"text":"If you like authentic food, don't eat here.  This was the worst meal of a 15 meal trip.  T","useful":0,"cool":0},"XBBD9ByHeLynfJEZFr38LQ":{"text":"We absolutely loved our server Marissa!! She was so sweet & on top of it! Make sure you as","useful":0,"cool":0},"fTxu6uEvITMKo5wPxtk-9g":{"text":"We liked it.  The bartender was nice and the hostess made room for us at the bar which was","useful":0,"cool":0},"EasLi98MK-MhXtPK2dwpWA":{"text":"Very so-so. Kept landing at this intersection so the fiancé and I decided it was fate to g","useful":0,"cool":0},"PfXt2kUdO99IViBBNXUF0g":{"text":"Do yourself a favor and get the cashew encrusted redfish with praline sauce. Best fish I'v","useful":0,"cool":0},"1PKqzo8u23STIOZHuJjNOw":{"text":"I never leave a review so this will be my very first one. I have been to New Orleans to ma","useful":1,"cool":0},"2wFt8tzK5HDHpK4R8enkCA":{"text":"Just OK. There was no wait on a Saturday night, which is why we went, we were starving and","useful":0,"cool":0},"twVZ--GnK41D-6ZScnTvDQ":{"text":"This is what you expect NOLA to be! Awesome food, blues music and excellent service. The T","useful":0,"cool":0},"Ow9Cv896s3DfymSsoZkkcg":{"text":"First time to Nola for Tales of the Cocktail and was happy to stumble upon this place. Our","useful":0,"cool":0},"-H26R65gnAekyMbFhEEvbg":{"text":"Really great food! The stuffed fish was yummy but the wait to get our food was really long","useful":0,"cool":0},"upNyISngcLKsKJVnjMaHBA":{"text":"So yummy! Best alligator bites I've ever had. The shrimp remoulade was mouthwatering. The ","useful":0,"cool":0},"-Wz_tVrkba7xuScjtwgvug":{"text":"Nice but tired waitress. Medicore food. My jambalaya came to me as two meager lumps of jam","useful":1,"cool":0},"6I2pGn_rLtVoL5Z8E1ph4g":{"text":"I had quite high expectations for this, but it turned out to be a tourist trap. I arrived ","useful":1,"cool":0},"E6LtvROAWNBpLiuOOXnE8Q":{"text":"This place is good. They have an eggplant po'boy and they carry Abita light, I'm a happy c","useful":0,"cool":1},"CvTNIxtztjPoMweIxQIAoQ":{"text":"Came here with my wife and another couple. Awesome food awesome service. Crawfish bread wa","useful":0,"cool":0},"uWji_BxbyESYbGwKAKvSeQ":{"text":"Terrific gumbo, just the right amount of spices so it is rich and flavorful, nice amount o","useful":0,"cool":0},"rZTYqk5H9xRWCe5abLjdkw":{"text":"Alligator Appetizer,  Shrimp Po-boy, Crawfish Stuffed Fish, and Red-Beans and  Rice was mo","useful":0,"cool":0},"WFgD7O1mnzqSU6Yjb4nybA":{"text":"Food is outstanding. Get the alligator bites, and the barbecue shrimp for delicious appeti","useful":0,"cool":0},"U6DhlNCOQRsRxpG8VWoK1Q":{"text":"Bbq shrimp was absolutely delicious! Also had the Chartres Burger - very tasteful and appe","useful":0,"cool":0},"Fqxb0Khf49I6woHcSwfdmg":{"text":"So, so good!!! First time here. Cajun Martini's are the best in the city. Bloody Mary's ar","useful":1,"cool":0},"Ay74kn_e2fvkZNmcKOxgfQ":{"text":"This place was wonderful.  we ended going back 3 different times during our trip.  Food wa","useful":0,"cool":1},"eTr42mXMqXwVeSf5tjSqDA":{"text":"First time in New Orleans and first restaurant. The Taste of New Orleans did not disappoin","useful":0,"cool":0},"Wq6xIPrNUV_4HmCWc7Cvxw":{"text":"Of all of the Cafe's, in all of the towns, it had to be you.\n\nChristmas dinner is supposed","useful":0,"cool":0},"Ijpv8HWWd1Z9iB04L0b2eA":{"text":"Came over here after a terrible wait at Camellia Grill. So glad we walked across the stree","useful":0,"cool":0},"ue8pEw751U3KIq9mrJildw":{"text":"Ok here's the skinny..  the place can't be missed walking up Chartres Street..   folks for","useful":1,"cool":0},"-SdjnK-lTbMtV-Kw35IcRg":{"text":"I had a really great meal at Chartres House. It was a very cool space with an interesting ","useful":0,"cool":0},"jE5t70ejYNreqcwjLXHW1g":{"text":"I've experienced MUCH better! To start, our waitress was rude (so much for southern hospit","useful":0,"cool":0},"wVhcXgx8dWwK365aN-d5_g":{"text":"We seriously believed that the food is microwaved. Our food came out room temperature. The","useful":0,"cool":0},"73YkbargSueqkj4kdhSYcA":{"text":"We were staying in the French Quarter and we're looking for a place with fried alligator (","useful":0,"cool":0},"3dMhKVVWS8wcVtRXOUTq4Q":{"text":"Chartres House is a creole/cajun themed restaurant in the heart of New Orleans' French Qua","useful":0,"cool":0},"SuWTVCvUPx-CdydOCDePXA":{"text":"My husband and I have found our new favorite place to eat in New Orleans. Love the crawfis","useful":0,"cool":0},"Un5Az-ZSdmOZ1MIEi6bJug":{"text":"I'm usually wary of restaurants whose waitstaff lurk about the sidewalk ready to entice pa","useful":0,"cool":0},"rB5eC9ox_QBn7okbdVLzFQ":{"text":"If you want a nice view of of the city dine in the second floor.   If you want great tips ","useful":0,"cool":0},"VPCzy5IMSxSe7H5XZtw6iA":{"text":"You must stop in this establishment. Everyone is really nice and friendly. Our waiter went","useful":0,"cool":0},"qctgwzDVqO5vTR9omzTBJA":{"text":"It's not just because this is the first place I ever dined when I came to NOLA, but year a","useful":1,"cool":1},"oH-Xny0GGTcrfQL_fLe2Fg":{"text":"Staff was super friendly, we had some time to talk due to we arrived just after Fat Tuesda","useful":0,"cool":0},"N4imqyC87VOeIwk9FW6deA":{"text":"Great location...but expensive drink prices! The Spinach dip was very good and comes with ","useful":0,"cool":0},"gNJ_e2cZS79K-4uis9psqQ":{"text":"Food was good but it took 45 minutes to get our appetizer even though it was super slow an","useful":1,"cool":0},"j3r5AVZK8IxkPqq85hFJ0w":{"text":"My husband was really excited to try this place after walking past it one afternoon. We we","useful":0,"cool":0},"uispDCKum8UhoCYNoK57lA":{"text":"Stumbled upon this little hole in the wall about 6 years ago. Wanted to go back but could ","useful":0,"cool":0},"xIsyV5keRDX_1ou7DpaCGQ":{"text":"The server (Brandy) was friendly and knowledgable. The fried green tomatoes were excellent","useful":0,"cool":0},"1wgk7RCLswM1qT5TFGhkPA":{"text":"I was so happy to find this place on my recent trip to NOLA,  my husband and I ate here se","useful":0,"cool":0},"hX1fexuccma7ggUqRfnq-Q":{"text":"Best Cajun food I've ever had. Our server was great and the food was amazing. \n\nHighly rec","useful":0,"cool":0},"JOekx1J_XIZoF9SaK01zpA":{"text":"We went to Chartres House on a Friday night, 01/18/14. The host told us it would be 15-20 ","useful":1,"cool":0},"3oy-T1Xyc5C-T8B0WELZyA":{"text":"My first dinner in NOLA was here. We couldn't decide where we wanted to go and ended up pa","useful":0,"cool":0},"eY32QPX5aNkZdN1qwE6OqA":{"text":"My mom had the red fish with cashews...she like her meal. My sister got the hot sausage Po","useful":0,"cool":0},"VwUK0P29iMlczYyMpq8Yug":{"text":"The food was good, service great, atmosphere very NOLA. We sat in the balcony and we're en","useful":0,"cool":0},"sMSNmOPKUzMePBRID7bQXg":{"text":"Great new Orleans restaurant. The food is very similar to most restaurants in the area and","useful":0,"cool":0},"40zf3RQem7KivEhBA9XKGA":{"text":"The best food for the price. You do not leave this place hungry. I had the red beans and r","useful":0,"cool":0},"BL73XLJcYpHBkRS_7PFqtg":{"text":"Atmosphere: 3/5\nService: 4/5\nFood: 2.5/5\nLocation: 3/5\n\nHey - it was a nice time, a nice m","useful":3,"cool":1},"UJR5ymE5y_VM_NfyaFZ21g":{"text":"What I ordered:\n- Red Beans & Rice (A-)\n- Fried green tomato slices (B+)\n\n[Checked in with","useful":0,"cool":1},"AaxX_B8k8eKi7udyAWGQ4Q":{"text":"Excellent! Alphonse, our waiter, was great! He made wonderful recommendations. (Crawfish b","useful":0,"cool":0},"CijL5iNGbqrOElglfIh31Q":{"text":"Visited New Orleans in the summer of 2015, stopped to eat here. After having a hand grenad","useful":1,"cool":1},"_xf_8NU0SE2yb8-f-9z6Fg":{"text":"Awful experience. The waitress forgot everything we ordered. It was my husbands birthday a","useful":0,"cool":0},"hElml5jAe5Zt5cczP5_igw":{"text":"Avoid! We were seating in a back dining room. There were dead roaches on the floor all aro","useful":0,"cool":0},"_-S8A2A8ApVv3QdpfuvagA":{"text":"Greek salad was a joke. Super expensive. Caesar salad had way too much dressing. Bathrooms","useful":1,"cool":0},"TPlrmIME64ohO7NHr9IydQ":{"text":"I can't believe the high ratings this place got!! Really the only reason we came was becau","useful":0,"cool":0},"FOQRDtPOdIGwWAxk3MKUKQ":{"text":"Great location, good beers on tap, nice people watching, and delicious seafood. I went wit","useful":0,"cool":0},"Nd15ciQMa78d2wfZkOzOqw":{"text":"Had a wonderful lunch with my husband at the Chartres House this past weekend. We'd spent ","useful":0,"cool":0},"6TOqZNJbwYIa3Gt_Mj30Pw":{"text":"Good food, great ambience.  I had the crawfish etouffée and the crab bisque.  Not the best","useful":2,"cool":0},"0QmvcmSpqeedG1J_RzfKdg":{"text":"Nothing fancy, but definitely a solid choice. I got a catfish po boy that was really good,","useful":0,"cool":0},"njzZ8j_nNvmMzB_9x0SGzw":{"text":"This is by far the worst place.  We tried to go for dinner the hostess told us there was a","useful":0,"cool":0},"FU876PfpdthCa69iWxs-aQ":{"text":"Was not my favorite. I got the crawfish bread and it had a vinegar taste. The crawfish spr","useful":0,"cool":0},"5vZgdOQmRWtuhv3r5DTGTA":{"text":"We arrived on dirty linen night after we had a few. The service was amazing. We had a wait","useful":0,"cool":0},"oYlWnM-tEjXUqFhnJpfJCQ":{"text":"Our concierge recommended this to us.  Carl was a fantastic server and too great care of u","useful":0,"cool":0},"SXJj6mNlXUyfFntmD6mswQ":{"text":"Just removed this place from our list of places to eat with out of towners.  It's too bad ","useful":1,"cool":0},"MqfDLlmYJaoZuvaOGaSwDw":{"text":"The food was pretty average here, but my waitress Claire was awesome!!!\n\n1.  She recommend","useful":1,"cool":1},"VIQT_w11Ht0PicLVQ-nitg":{"text":"Disappointing! I had the stuffed fish and my mom had the fried crawfish. Both entrees were","useful":0,"cool":0},"QgQYnJBMFAmLO6p6IETOBA":{"text":"Ate here after a long day of festing in the FQ.  My fried oyster po-boy was quite good--in","useful":0,"cool":0},"5-z3yY551cJ-QwXrIFMKAg":{"text":"We've been here before on our last trip.  This place has so-so food.  The courtyard is nic","useful":0,"cool":0},"n7hgqb5GXdYG_G2Rvno2-g":{"text":"Husband and I shared the New Orleans Sampler - red beans and rice, jambalaya, crawfish eto","useful":0,"cool":0},"4XXp1Lq-LBsqtsy9ANfuNg":{"text":"Well it was a HOTT sweltering day about 103° at least felt like 110° Arizona heat.  We wan","useful":1,"cool":0},"Fj4ZtJMwTwgrL2d8FKEKZA":{"text":"I freaking love this place. i dont care if its a tourist trap, or if the food ive never tr","useful":0,"cool":0},"hOP12EaxE8qfMyjFOYxf7A":{"text":"We stumbled onto the Chartres House purely by accident. We were heading to another restaur","useful":0,"cool":0},"NXTds0HmI1-Q7JsbG8PBWw":{"text":"We came in just to grab a drink at the bar, it was crowded with people eating and the food","useful":1,"cool":1},"T3qEkRnwtd9s7WXktmUAPg":{"text":"I am not really sure why, but Chartres House would probably be considered my go to place i","useful":2,"cool":1},"z6IE7FgVzZ8-aEczlGs7gg":{"text":"Disappointing experience with their Shrimp and Grits yesterday....DELETED\n\nMy sincere apol","useful":0,"cool":0},"RfPE2Vf0tMrMidcRHBRy0g":{"text":"Stopped in for a late supper and glad we did. Wasn't very hungry but I knew a long night w","useful":0,"cool":0},"iBwUZizqsCDWVedSuYITsg":{"text":"Holy crap have never had such terrible service in my life, took 1.5 hr to get a table, 30 ","useful":0,"cool":0},"tHRUtNuMU_SKi_-iB5hoiw":{"text":"Waiter was super nice although he mixed up Johnny football and UT! Food was good and he di","useful":1,"cool":0},"v5DiGrprcN5-fkJu1wGcRw":{"text":"Hung over from indulging in my very expensive liquor habit the night before on Bourbon St.","useful":2,"cool":0},"xBxOG7uMMlZ9s39H2Vdpeg":{"text":"Super tasty! Stopped in for some apps and cold beverages. Had the mudslide that was nice t","useful":0,"cool":0},"UARxNhKiosb-tzOXnRDnbA":{"text":"I continue to love this restaurant! After two years, I still think they have the best food","useful":0,"cool":0},"6oJuk2Rb_GPlO5QaUo3gdw":{"text":"Great drinks, great food, and outstanding service! It's a place I always stop at when I'm ","useful":0,"cool":0},"gSwxBzpi2VrF6U7C_wUeTQ":{"text":"Second floor need remodeling.  Balcony seating was nice.  Other diner said crawfish etouff","useful":0,"cool":0},"itlKuqeJcfKdmXV8iPd0GA":{"text":"Perfect place to take a load off, (and get a load on).\nWe had a nice table by the open pat","useful":0,"cool":0},"6SVz48fAI7QODgdly1twRA":{"text":"Chrissy and bill were our waitress and waiter. They both provided excellent service.  Neve","useful":0,"cool":0},"tb7SYRDfy_7oqFBNrPXpoQ":{"text":"Chartres House is a nice place to grab a bite. Prices are reasonable and service was good ","useful":0,"cool":0},"U55l8XHmr_GlGO_dPCxjZw":{"text":"The second time we've dined here this weekend. The BBQ shrimp appetizer pretty much made o","useful":1,"cool":0},"n_oEd6_evuvMWYFK2aRS7w":{"text":"The cashew crusted red fish was stupifying. Definitely one of the best meals I've had in N","useful":0,"cool":0},"2CfN7cXzU9j-4MwE--NzYA":{"text":"This review is for DINNER only.\n\nLooking in from outside you'd probably pass this place up","useful":0,"cool":0},"UkeB9KjobdcB96chT6LCVA":{"text":"Stumble along this place, since the Grill (the restaurant across the street) had a long li","useful":1,"cool":0},"VyRLv-xtiwbi7_C5BDjdng":{"text":"UMMMMM The best Oyster Poor Boy of my life!!!  I took it back home on the plane with me.  ","useful":2,"cool":0},"aAzxUS1SscdSs6JumGDQuA":{"text":"***Disclaimer: Everything you are about to read is 100% true***\n\nThis is an establishment ","useful":2,"cool":2},"RGcBGHWrfKWa93OTGzNMwA":{"text":"Great spinach and artichoke dip. Awesome fried bow tie pasta as the chips for the dip.","useful":0,"cool":0},"0C1HQqCzKPeh7dOv5SUtCA":{"text":"Stopped here for lunch because we had our pups with us.  It was raining so the balcony sea","useful":0,"cool":0},"nvunIU9Kw7QdP_HE9k14sw":{"text":"We read all the great reviews for this place and decided to go the Monday night we arrived","useful":0,"cool":0},"Ng6MR9FcHd7nejkDNR84PA":{"text":"It was a very delicious resturaunt. Crawfish bread was amazing! I enjoyed the shrimp poboy","useful":0,"cool":0},"t3DFBNZesS_d9mXgvgdwKA":{"text":"Stopped in for dinner on our first night. Received a complimentary appetizer with our Yelp","useful":0,"cool":0},"10DcTeu3B6g8H4-rVWISSw":{"text":"The service was terrible and the food mediocre at best despite the prices they charge. My ","useful":0,"cool":0},"U7Gl_iQIMQhpkOBHXNNdMA":{"text":"My wife and I recently visited my family in Louisianan and we thought it would be fun to t","useful":1,"cool":1},"kheEMYLD1HNXM3CRY9yoog":{"text":"Probably the best jambalaya I had all of New Orleans. Craved it the rest of the trip.","useful":0,"cool":0},"8FHOjvhU-S8YBxXAguGlOw":{"text":"We NEEDED to eat DURING the parade so we were stuck. This place was a few blocks away so w","useful":2,"cool":2},"Mas8hTSj4vX-e91eeMLAzw":{"text":"Wife had eggplant po boy...I had roast beef po boy.   The sandwiches were a 5 star.  Overa","useful":0,"cool":0},"14IZcnwt2qglrQrskbMe5A":{"text":"Came here for brunch at 11 am on a Sunday.  Initially the restaurant wasn't too busy, but ","useful":0,"cool":0},"0JdCQppUNV3YDWFkAqUCQw":{"text":"The service was excellent. Jerry, the waiter, was really nice and the food was tasty. The ","useful":0,"cool":0},"v8TUJg7OWgvtFOzapsYHXw":{"text":"Tonight's dining experience was just about perfect.\n\nWe noted a couple of friends checked ","useful":2,"cool":0},"f9mNQUv8mgQ0VrS0SabErQ":{"text":"- Nice balcony seating, perfect to watch New Orleans. Really romantic atmosphere.\n- Ordere","useful":0,"cool":0},"BQ2ryWtb1l1KZetUthBOcg":{"text":"I am not well versed in New Orleans cuisine but it was all very good. The muffaletta was f","useful":0,"cool":0},"1KNvWQ0kez2SgXvfJBo8Cw":{"text":"This place is great. Right in French Quarter and reasonably priced. Staff was cool and foo","useful":0,"cool":1},"tOcnSDL06kp6KP4EfJ-knQ":{"text":"We almost did not stop here but after a couple of other places did not work out we just de","useful":1,"cool":0},"jRosAKKwy4YJrE29KPAJNA":{"text":"The environment was nice and even better was a nice, large clean ladies room. \nOn to the f","useful":0,"cool":0},"6aL7xXhLtMzQ_3l_U-t1EQ":{"text":"The muffaletta was awesome!  Substituted a caesar salad for the fries and it made a very f","useful":1,"cool":1},"9fWyY1Qlx92YrWzIe35pzA":{"text":"Very nice place with a patient and friendly wait staff. We enjoyed the ambience of the bal","useful":0,"cool":0},"JpzUIssgXqi1eUdgTiGEzg":{"text":"A nice place to sit and eat New Orleans favorite dishes and not so bad with prices, either","useful":0,"cool":0},"zjtzL-YqCorX10DD2548eQ":{"text":"There were plenty of nice things about Chartres House: the service was quick and our waitr","useful":0,"cool":0},"OQPE7xKq8nJkNQJq2qd0nQ":{"text":"Pretty little Chartes House Cafe! Great food, great service! It was a quietish night in th","useful":0,"cool":1},"0u-gNaLSmb0IiWdgF3CU5A":{"text":"Good ole Chartres House. In my multiple trips to New Orleans, I somehow always end up here","useful":1,"cool":1},"lDoOtbRyFsqNVFG9Q6gcoA":{"text":"As we walked in, I thought that it was going to be great. The ambiance is great, bar is ve","useful":0,"cool":0},"mdUCiSIyAup0PHDd1NdxzA":{"text":"Absolutely fantastic service and food with Leon our waiter leading the charge. His recomme","useful":1,"cool":0},"6cdwjhHv6y3qoCkG3PYEjw":{"text":"My girlfriend and I stopped here for dinner on our second night in NOLA. We were promptly ","useful":0,"cool":0},"fN52lBTnnpf9-wFEl8Jxfw":{"text":"Great place to eat and have a drink. The Hurricanes here are awesome. I had the crawfish p","useful":0,"cool":0},"QR6V3t3-HeXKy-Zrpx3ykA":{"text":"It's OK for what it is - the food is just alright, not authentic creole.  However, the ser","useful":0,"cool":0},"OhYBEyWat5iOM0w7y-VlaA":{"text":"Everybody who works here is super nice!  That's it, food was shit besides the po-boys.  If","useful":0,"cool":0},"2bVEw4hV2sMpM8d2TqBqhA":{"text":"Awesome!  Ordered the jambalaya and it was really good but my husband's cashew crusted red","useful":0,"cool":0},"q122IyN1VBkKIwTWxqrHvA":{"text":"I've been here many times, and I love this place. The food is great, and the service goes ","useful":0,"cool":0},"32NrHRC3ajYKYtWA9LcJkQ":{"text":"Went here for lunch, we ate upstairs on the patio which was a little terrifying but had gr","useful":0,"cool":0},"JrytW8eQD58Rf0szI2Oilg":{"text":"The Good: Friendly service, selection of local beers on draft ice cold, boudin appetizer\n\n","useful":0,"cool":0},"uBhhbGP9G7CFu0Ij2dVN0g":{"text":"The food was a bit too salty as other reviewers mentioned but its a great spot and the ser","useful":0,"cool":0},"xToAw0eErHHXPeRYmgXzZw":{"text":"Y'all. This food was so great! Chrissy gave us fabulous customer service and all of her re","useful":0,"cool":0},"xhYUMsNEz8i_VjmZ6ewPOw":{"text":"This is the quintessential Bloody Mary. Look no further. \n\nThey do an infused vodka (and h","useful":0,"cool":0},"seyDdTxuK1GHVH838aPDsw":{"text":"It's hard to say if this place should get 2 or 3 stars. The cool thing about this restaura","useful":1,"cool":0},"Kb_vIFJQDEz74MR2ocUAdQ":{"text":"We loved the taste of New Orleans trio, especially the crawfish etouffe. The duck empanada","useful":0,"cool":0},"MXpo5VUGqslyK_rwbsnFPQ":{"text":"This place was a little slow for a Friday evening in the Quarter, with slow service as wel","useful":0,"cool":0},"YTwwcUwIqfAKVyn_CE1sUA":{"text":"Omg... So good! We got the Taste of New Orleans was amazing. We will definitely come again","useful":1,"cool":0},"UfFwhAzYhFOqVEMihnLw9w":{"text":"I had the stuffed fish it was a little salty for me the vegetable didn't have much flavor.","useful":0,"cool":0},"2C7OHGWsdMwZCKC_nVoBOg":{"text":"This place is a oasis in the busy French quarter. The food is delicious and the service is","useful":0,"cool":0},"hrz9np_-79a7mhv1QfVBig":{"text":"I love this place! The food is amazing, reasonably priced and the staff is incredible. I r","useful":0,"cool":0},"GWPEYdGdjerwxp0UndiArg":{"text":"the food was really good but really salty--I am sure that caters to the drinking crowd. Bu","useful":1,"cool":0},"BNOEOsoh57Vl_bZcAybGHg":{"text":"Crawfish stuffed fish...omg! This was one of the best dishes I've ever had. It was so fres","useful":0,"cool":0},"mT6p8aoqPfQdGfy6K_wJHA":{"text":"Just stopped in for a nice quiet drink. The bartender was not very friendly to say the lea","useful":0,"cool":0},"80r643v66viWI_dk9luCJg":{"text":"Walked in on a weekend evening and were able to get seating for a party of 2 and 6 within ","useful":0,"cool":0},"xxFkcE4qWK8Xvn3cLm7P0Q":{"text":"This is a regular stop for my friends and I when we visit NO.  The open-architecture of th","useful":0,"cool":0},"qoeeYOfRWSR7Pl7BbiOadw":{"text":"Lively place.  I ate at the bar, while the guy next to me gesticulated wildly over the Fin","useful":0,"cool":0},"LPVbgp1fcTu92gppJlk9lA":{"text":"Ordered the fried green tomatoes & tour of New Orleans... Everything was delicious. Server","useful":0,"cool":0},"0uh0C18GMmgcko0xwisoFg":{"text":"Best food I had in NOLA!! If you haven't been you must go, the crawfish cakes are to die f","useful":0,"cool":0},"ruYiLGX_DrTa0k292DRy-Q":{"text":"We came here hoping to sit on the balcony, but the balcony is only wide enough to sit tabl","useful":2,"cool":0},"9zovJOQA7HH9M2C2BOjiwA":{"text":"Great atmosphere!  Friendly, welcoming and attentive waitstaff.  Talked me into the Crawfi","useful":0,"cool":0},"BBmnkFvS4a7S57Cz5CPmew":{"text":"extremely mediocre food at expensive prices.  The food is edible, but it is nothing specia","useful":0,"cool":0},"W-ar-YEK9wROOB5UlEHR1g":{"text":"There are so many dining options in New Orleans, many of which are world renowned, so it c","useful":0,"cool":0},"Jsr2zyYU5B3cHoCnpBHsRw":{"text":"Thanks to my Chicago Yelp buddy, Nick M., for this solid recommendation for good food and ","useful":4,"cool":4},"IaR9RAhFoBFA9npVQrYGlQ":{"text":"We used the free appetizer through yelp and ordered the crawfish bread. It was ok, very sa","useful":2,"cool":0},"QGIN_LurZwZQ12WAgh0mng":{"text":"My mom and I came here after a recommendation from our hotel staff. We were seated right a","useful":0,"cool":0},"C-ON5suxnD-Ce2DVqXTB-w":{"text":"This place was just ok, it will satisfy your hungry but thats about it, nothing to write h","useful":0,"cool":0},"aGZgi2KFeK5QB2lAibiwMw":{"text":"Reginik was an amazing server, so kind. Great bloody Mary's and the shrimp po-boy was deli","useful":1,"cool":1},"G3cnuvyqU2JBTvTDX0Gwtw":{"text":"I've only been here once, but I had one of the best burgers ever here. Service is great an","useful":0,"cool":0},"NDvJEhSttVUV5a6kXgkotw":{"text":"We stopped in here for lunch when down on vaca in New Orleans with no research done prior ","useful":2,"cool":0},"yYJD6HbSCP5C_5IwisdPGw":{"text":"Had lunch here with my wife on Saturday. The food was absolutely fantastic. Like most plac","useful":0,"cool":0},"NUbYEbW7tA0lJUBk8e0QSg":{"text":"Our last night in New Orleans and we wanted to try this place out.  It was a festive atmos","useful":2,"cool":0},"N5rj43T_RD8FSk5-6cmZfA":{"text":"Great food, nice location, friendly service, good music! A little disappointed that the po","useful":1,"cool":1},"UPRSh260VFUhhjnt7fNX4Q":{"text":"We were seated and never given menus or knives and forks.  We grabbed our own menus after ","useful":0,"cool":0},"P5LnFecpl3FErwwMXsrcgw":{"text":"I had an hour to kill before having to return my motorcycle and take off to the airport, s","useful":1,"cool":0},"5GB4BB-whxMP0Fb7w7jh2w":{"text":"Oh man, I dislike giving places a negative review but please hear me out. \n\nTo begin with ","useful":0,"cool":2},"Vej3meEQXQlWq0L3bGd5kQ":{"text":"We recently visited this restaurant and being from New York, we were looking for authentic","useful":0,"cool":0},"NCgrPP23XKtnjFWAvFBYBg":{"text":"A strong contender for worst restaurant in America.  I have been to most major cities and ","useful":0,"cool":0},"veNWfL9i3rGPd3JwYjeZNw":{"text":"Staff was very friendly.  Food was really good.  Loved the balcony seating and the people ","useful":0,"cool":0},"HWu8Xd0NRoQaxLP99FKONA":{"text":"The jambalaya was terrific. The service very good and friendly. The bread pudding was out ","useful":0,"cool":0},"GulXaXoEbuI1sf84Sd4VLQ":{"text":"Stopped in for dinner and was thoroughly impressed. Friendly staff and great ambience.  We","useful":0,"cool":0},"onT4Nt1TPfQM9ETxPrZZ1w":{"text":"Red Beans and Rice and a Sazerac...... Perfect Lunch! Especially Sundays when you're just ","useful":1,"cool":0},"_qEquf05N7yDNQHxl2pCtw":{"text":"While my sister and brother in-law have been here before it was the first time me and my w","useful":0,"cool":0},"rgkxaGJ3TwjL3iwNG2skHw":{"text":"Hostess was on phone and unfriendly. Drinks took a while. Food was served lukewarm and qua","useful":0,"cool":0},"_Ybmc2irTeCpKhbpQeRz6Q":{"text":"My friend and I just happened to stumble upon this place. To this day, I remember how good","useful":1,"cool":0},"F8XmdBR5fZ5rYXBASC0mug":{"text":"The food is amazing and the service is fantastic! Chrissy was incredible and her recommend","useful":0,"cool":0},"_Wlr8cSaO6Q5cE_CWcW9vg":{"text":"Attentive wait staff and good, simple food at reasonable prices.","useful":0,"cool":0},"on7DIvxjV6l5TLtmInmQDw":{"text":"Server was very friendly and attentive, the beer selection is great as I'm a fan of local ","useful":0,"cool":0},"BMU0M5mR95Rslyc8srsZBQ":{"text":"We stumbled upon this restaurant after running through a torrential downpour to find some ","useful":0,"cool":0},"M2w5RTAH37vmf9KpWN2w5Q":{"text":"We only had drinks here. The bar area is cool and in one of those old New Orleans building","useful":0,"cool":0},"3nqeUfQsvJC861BUKg4bQw":{"text":"Best food I ate in New Orleans!\n\nI loved everything about Chartres House--its location in ","useful":0,"cool":0},"miIJyLDHh_x-fTifsy4phg":{"text":"We had a party of 6 and at first they weren't so accommodating, but they did after saying ","useful":0,"cool":0},"xCStvVtKZf4jjyJrkQFLrw":{"text":"We were starving and stopped in for lunch and were thoroughly disappointed by the food. Ou","useful":0,"cool":0},"FhBumk4yRsxs8T2YOpt04w":{"text":"The food and drinks were amazing. Service was great.Taryn was very helpful in choosing our","useful":0,"cool":0},"_5mwOuWf94dNAV8sGGa3SQ":{"text":"Really good food. We split the boudin. I had the crawfish stuffed fish and my wife had the","useful":1,"cool":0},"qVeEqgCe5kRDV1g_iIbkPw":{"text":"The atmosphere was wonderful. I loved the dimly lit, subdued feel. All of the drinks were ","useful":0,"cool":0},"vsAnLfujCxjO9d9sTX8T6Q":{"text":"Wow, have times changed. Stopped by for solo low key LA seafood dinner, always been good h","useful":0,"cool":0},"6WSOsLU74sj1tVSmIESmUA":{"text":"Went looking for a place that could accommodate a large party of eleven last minute and en","useful":0,"cool":0},"7NcPka6dwViRt88wRtoEzA":{"text":"The food here is absolutely delicious !!!   And the staff here is the friendliest that I h","useful":0,"cool":0},"plLpwvEUc7rqAU-XMTsLHw":{"text":"Un lugar informal, agradable, con comida típica creolé (aunque no soy tan fan), quien nos ","useful":0,"cool":1},"s6QoN7ppgf0EKl6H-aq6RA":{"text":"Best food since we have been in NO. Kelly was a great server and the food was reasonably p","useful":0,"cool":0},"_3_ZHbCIOJ2UzKgYz5_xgQ":{"text":"Excellent food, atmosphere and service. If you are anywhere near this location and need a ","useful":0,"cool":0},"MHac36j7JkB7nQFpjwhVdg":{"text":"We visit Chartres House every year when we come down... This year for our wedding, Nani, o","useful":0,"cool":0},"u4NLQqF5gSJM3saRFb6mkw":{"text":"Great spot for a drink and quick bite! The Cajun margarita was nice! I didn't really find ","useful":0,"cool":0},"noEILS2wFlm4JFLFa0_I_Q":{"text":"French fries were good, so are the ones from Every Fast Food chain, Roast beef po boy was ","useful":0,"cool":0},"NmLlkEIrsCSx25l3BTePJw":{"text":"The food was good and plentiful.  We had an appetizer of shrimp remoulade w/fried green to","useful":0,"cool":0},"_ZU0sFXNBZrOlBTuY4ATsA":{"text":"For authentic New Orleans/creole cuisine, this old French Quarter joint can satisfy. I'm a","useful":0,"cool":0},"d89pIbVn6VNDE4S1WcB5WQ":{"text":"Excellent restaurant. Very fair prices and friendly staff. Highly recommended! The outside","useful":0,"cool":0},"UhUAgW2gKiPuhqUN2MR5Ow":{"text":"I had the french fries and a bloody mary. It was divine. Nothing else like it. I'm finally","useful":0,"cool":0},"XmLreiQfhFpa9TP64vCXhA":{"text":"Had such an amazing night tonight. The alligator and crawfish stuffed fish was absolutely ","useful":0,"cool":0},"NL6OpdMJMGh6f3P6FXqZOg":{"text":"Went with spouse who wanted crawfish and they enjoyed their meal. Alligator appetizer was ","useful":0,"cool":0},"bu-LzgwnOQh7RkHVVMwFhQ":{"text":"Ok the food here was surprisingly good. Great portions and the waiters where really nice. ","useful":0,"cool":0},"ECH05Y_Ob1ywJOKqWn2EQg":{"text":"Can't remember our serves name but she was very down to earth and gave us great recommenda","useful":0,"cool":0},"FDQ2IurSgiNAb2SfWegiAw":{"text":"Had dinner here on our 1st night after arrival. Family of 4 all enjoyed our selections. Bl","useful":0,"cool":0},"dNaDtgxwsbYNNJv-W31BuA":{"text":"Decent place for local flavor in the quarter when you're in a pinch for a place for a quic","useful":0,"cool":0},"upJRv0e0IGsulAHaB8Dgcw":{"text":"So so food. Red beans & rice were delish, but they didn't have any oyster  (who doesn't ha","useful":0,"cool":0},"tyE6Nqwf6IuNRoDEQOE-Vg":{"text":"We ducked in here because we were driven off Bourbon Street because of how packed it got.\n","useful":0,"cool":0},"Y8LlSows-lfW3KFsulgAHA":{"text":"Great experience, I got the taste of New Orleans and the jambalaya was fantastic!  Our ser","useful":0,"cool":0},"5vGZcWLekgg07Y2y_6bcNg":{"text":"This is one of our favorite restaurant in the French Quarters in New Orleans.  The wait st","useful":0,"cool":0},"zi9dXtgPlrX9onLqQlrVQA":{"text":"Took a while to get seated but the hostess apologized. The waiter didn't know if I could p","useful":1,"cool":0},"0xbK4tiRwO0PHX6w-WtejQ":{"text":"Went back and we're so glad we did. Service was excellent and the food was amazing! Very p","useful":1,"cool":1},"wv6bOh3IXd_09NLQjxTO1Q":{"text":"If you like cajun and Creole food,  you would love this place.  We had the boudin, and it ","useful":0,"cool":0},"IHOdCuYGNAaVXdo3c4Q8MA":{"text":"Good, solid, classic New Orleans fare. The cocktails are great, too. We were seated by the","useful":0,"cool":1},"eoikR78frmTNmACT3HXLiQ":{"text":"Wanted something that tasted southern and felt like \"New Orleans\". This is exactly what we","useful":2,"cool":0},"EG7Wc0FbFI_aDKtCcUfVow":{"text":"Good portion sizes and the open-air ambiance is nice. The restaurant was a little bit dirt","useful":0,"cool":0},"1ppR_DsM4vyD10ny2y6sQg":{"text":"SO bad...... service was really horrible, food was terrible. Sorry but this place barely d","useful":0,"cool":0},"aU5nBPNYz51823yTrVxsRQ":{"text":"I wouldn't recommend this restaurant for anything other than the beer. The food was medioc","useful":0,"cool":0},"4bdXztrLVxwKxWLgxfYRxA":{"text":"This place was acceptable, but not great. We used the Yelp offer to get a free appetizer b","useful":1,"cool":0},"aHi93t-LGAo7-vcwOd4l7g":{"text":"The service was excellent and enthusiastic.  The staff feels like they like to be there, a","useful":0,"cool":0},"2UfbB0NMLL-slKb2HfP9eg":{"text":"Needed to catch a quick bite to eat before my partner headed back to work.  Decided to sto","useful":0,"cool":0},"BrReJygmND4sqlFRECpU_w":{"text":"Two Saturday's ago just as the Mardi Gras festivities were starting I was in New Orleans f","useful":0,"cool":0},"otN9XtGlLk98wEA4s1pLsw":{"text":"This place is conveniently located, and our bartender was friendly.  I'd just stick with d","useful":0,"cool":0},"IaQfIqirxF1x3wm1EEzadg":{"text":"Pretty good food and great service, just as the others have said. I had the \"Redfish batte","useful":1,"cool":0},"OWLylIxVyTuspjZ9p_-vyg":{"text":"Went there for dinner Sunday evening. Had the trio gumbo, red beans rice, étouffée. They t","useful":0,"cool":0},"Rfi-0AyL1hOzGEcx9h60xg":{"text":"This place specializes in Cajun food, and we ordered a large sampler plate. We had anticip","useful":2,"cool":2},"kNOKXOLKm7eTFUbEVqwEaA":{"text":"Stay away. Food not hot & not good with watery mojito. We went because they are open until","useful":0,"cool":0},"gEd-JLfIOt-CDtgD_crx7w":{"text":"Disappointing we went for a quick bite 3 Po-Boys and a redfish dinner very common poor ser","useful":0,"cool":0},"PaKpfEFFfHwBjt8vR7-oCw":{"text":"We walked by this place and spotted some diners on the balcony.  Seemed perfect!  As we wa","useful":0,"cool":0},"YELvLsMG7rDqC37LZpBrZw":{"text":"Very generic. The mixed drinks are pretty good, but expensive, and the food's not great. O","useful":0,"cool":0},"NaFuJIM3fCVYGpvZqq3qqg":{"text":"So I pass by this spot all of the time and never stop. My husband suggested we stop since ","useful":0,"cool":0},"ENIdZDU4hwbLz0Z9pQHf7A":{"text":"The food is absolutely delicious, but the portions are too small for the price. We had the","useful":0,"cool":0},"hPR-LSA0Qj4qbDugVFqAGA":{"text":"A+. Everything was great. The food. The service. I hadn't had any creole style food before","useful":0,"cool":0},"7V3j2f82S4dUrkQlHVMpoQ":{"text":"We wandered all over the French Quarter trying to find a place for dinner one night that w","useful":0,"cool":0},"gvl6kCr8qrYE4rJ0eJCPiA":{"text":"Very tasty fries. It was my favorite part of the meal. The shrimp poboy was okay. I said n","useful":0,"cool":0},"KX842RUUmc0oLw6_IUzBSw":{"text":"The wait was way too long, but I heard they were short staffed. There was literally 5 open","useful":0,"cool":0},"5vzwSj0nTLq2qWuuzAwD-Q":{"text":"I've been here before... not sure which trip. (I remember the loo being in a courtyard out","useful":19,"cool":14},"Ei0bDUznJhGGbKk3gogIiA":{"text":"Food so over seasoned hard to eat. Very slow wait staff. Most friendly and helpful hostess","useful":0,"cool":0},"TbAFSG711y4o4cCb4WbTAw":{"text":"After walking all the way to One Eyed Jacks, and finding it CLOSED, we stopped in here for","useful":3,"cool":4},"rX5khlcSF7AOL7xIF6cZcQ":{"text":"What a great Cajun dinner spot! We had the tomato chips and crab cakes with the trio for m","useful":1,"cool":1},"5aCOLgZioSDBKCYjQLW_Zw":{"text":"I like this place. Its not fancy by any means, but the food is solidly good. \nI had the ro","useful":2,"cool":2},"X8QIQl4A1DO9hvVn2qLldg":{"text":"Step through the bar on the way to the restrooms in the courtyard and you will quickly see","useful":0,"cool":0},"GtXswUNrVu9XgTDDdKbjOg":{"text":"My girlfriends and I were visiting NOLA for Jazz Fest when we decided to venture to this r","useful":0,"cool":0},"qaD2I3xfk-BEFZYP6uxOnQ":{"text":"Good decent po boys   Central location off of Bourbon Street. Great service.","useful":0,"cool":0},"7-xHKq5PZnq0N8IgcO4xLQ":{"text":"Rooftop seating is awesome, food was great as well, and all at pretty good prices. We had ","useful":0,"cool":0},"GMYuCgDZ9mitKKgflSZvzA":{"text":"After walking through the French Quarter we stopped at Chartres House since it was on a qu","useful":0,"cool":0},"Q2nxD9mG-IkwMk4em42QRA":{"text":"Can be hard to make a decision as to where to dine in French quarter. Would recommend Char","useful":0,"cool":0},"hNKJQdN2FrFDFak_-093aQ":{"text":"My best recommendation would be to walk right past, if you are considering dining here. Fo","useful":0,"cool":0},"PlzxlXCM43zaXhZfN9tYpw":{"text":"Excellent service from Mr.Pierce! We always have a great time dining here-- with delicious","useful":2,"cool":0},"SA__9ueoEon6D7pYUfrtpQ":{"text":"Oh. My. God. This was SO DELICIOUS! The crawfish bread was delicious, the gator bites were","useful":1,"cool":0},"59Lr-HkD9hKU-HYwHZJtjg":{"text":"A complete disaster. We made reservations since we were 6 people. We were seated promptly ","useful":1,"cool":0},"judRCZGZRDLPEDvf9bGBYg":{"text":"The upstairs dining is a great addition to this restaurant. The food is good, and the remo","useful":0,"cool":0},"gZ1SqPDcI1qJ0UilY8B3Iw":{"text":"Did not disappoint! We ordered the fried green tomatoes which were cooked to perfection an","useful":0,"cool":0},"qJPMfMWnPumyWvbWCElVOA":{"text":"Chartres House was our \"fancy\" dining option during a trip to New Orleans. My vegetarian t","useful":1,"cool":1},"oFXz4hzxcNfDQlaz7Fql3g":{"text":"Would have enjoyed the bar side more so. There with family and little kids so I guess the ","useful":0,"cool":0},"7t__pQdlQDRcAFjAPAkGZw":{"text":"Best crawfish ettouffee in the French quarter!! And don't  forget the Cajun margaritas and","useful":0,"cool":0},"_E8TDw5jJJ0CumpTBN1vUg":{"text":"I have been here three times in the last week and I was blessed to have Courtney 2 of thos","useful":0,"cool":0},"_j8YdCl7EbKd4Tx466c_7w":{"text":"Well, they do have one thing- LOCATION.  \n\nOther than that, I was not very impressed.  The","useful":1,"cool":1},"RjihbyTUrHMWwLcFOPqzPQ":{"text":"Was torn on how to rate this place as I have definitely had better creole/cajun food throu","useful":0,"cool":1},"ibiPjCQ4ZfPl9Q8yZtCsJw":{"text":"The food was so good! I had spinach dip and chicken pasta. Very tasty! I would definitely ","useful":0,"cool":0},"rjKhBUR7utr-c0o-SHlhdg":{"text":"Excellent food and service! I got the taste of New Orleans since this was my first time he","useful":0,"cool":0},"J6SVtZx4niOJtZE8GHwfTg":{"text":"This was a second choice for my friends and me late on a Monday evening. We enjoyed it tre","useful":0,"cool":0},"NetRm5RSXp1X5Ms3CdJvqw":{"text":"I had a mean craving for crawfish and it was everything I wanted and more!!! The crawfish ","useful":0,"cool":0},"6YCYhbyXXt2DpB90jUpfXA":{"text":"The fried alligator is really good, doesn't taste like alligator. The BBQ shrimp\nWas also ","useful":0,"cool":0},"udfJZ6AfUCnuooh9abTQAg":{"text":"Overpriced. Tourist trap. Least authentic. Worst meal I've ever had in New Orleans. Shat f","useful":0,"cool":0},"Zg8NuX7-5ZAyd6cVsb9GBw":{"text":"If the waiter tells you the food is good, he is lying! This could possibly be the best mea","useful":0,"cool":0},"rE2BKF-hhR82cIfil_ClHA":{"text":"My family was hungry and stumbled into this gem after the 2 previous restaurants were clos","useful":0,"cool":0},"moJ-iNr3hSiS_SuUzITqgQ":{"text":"Harkens back to New Orleans in the best way. Located in the historic French Quarter, you a","useful":0,"cool":0},"mjuOoRIMXPgixZAgY0AQBw":{"text":"I'm remembering this place as a watering hole, sports bar, and a not altogether inconvenie","useful":0,"cool":0},"mtoN4MTyA1_6adX0OC-NsA":{"text":"Can only speak for the customer service. Bad.\n\nThey had multiple tables open in many secti","useful":0,"cool":0},"WXdhcN44w2ZuelEhLJih7Q":{"text":"Excellent red beans & rice and étouffée, both were just amazing, we enjoyed the great blue","useful":0,"cool":0},"JPAH1o1xTXgXYgmeWeCH4w":{"text":"I was not impressed by Chartres House's performance. The service was frustrating (our serv","useful":0,"cool":0},"xfSGAYQ55KVv0wxqSFwnjw":{"text":"Visiting NOLA for a few days and wanted to try as much authentic NOLA cuisine as possible.","useful":0,"cool":0},"hqxcr-oyvVpuVRc2qpOcYw":{"text":"This is not a place worth visiting! Service was horrible (I mean horrible) and food was me","useful":0,"cool":0},"WzCKPrBL_p-5fW_AdpYraA":{"text":"This place was pretty good. Everyone was able to find something they wanted to eat. Servic","useful":0,"cool":0},"H3BLqe9bjWYKT9QVymlZ3w":{"text":"I wanted to take my musically savvy friend to One Eyed Jacks, but they weren't open yet. W","useful":0,"cool":0},"mpuSnWbqYt_cIIbg2-sCPg":{"text":"I'm not really sure how to rate this place. The host for one seated the couple in front of","useful":0,"cool":0},"2FjP97lGLer_ozbCN-35XQ":{"text":"The food was really great and the portions are very generous. The wait staff was very frie","useful":0,"cool":0},"p4A6WxGhcE9t-pFQNbto_w":{"text":"Stopped in here on our unplanned tour of NOLA bloody marys. Other than their house infused","useful":0,"cool":0},"ZqaywPuq2GxGV65il5p2Mg":{"text":"The corner of Chartres and Toulouse is one filled with fond memories for me. When Quaffer'","useful":0,"cool":0},"JRuEyasyFgPb2JzdiZPOvQ":{"text":"This restaurant has some of the best food I've ever ate. And I have had some good food but","useful":0,"cool":1},"a9YkYRJ9Zbd3W5R-4ICSdQ":{"text":"Stumbled onto this place and left very pleased. Our food, drinks, and service was great. T","useful":0,"cool":0},"gad6nrGBZN7JGKXFD6eoaw":{"text":"What do you need after a long travel day and little sleep the night before? Good food, tha","useful":5,"cool":7},"nzxg_7QYPiYHFWZB2xERoQ":{"text":"Very good and tasty. We are getting hot and tired and just walk by and turned in and said ","useful":1,"cool":0},"TrwxdG7WnyS3fO1GoJm2iQ":{"text":"The food was bad. It had been sitting around too long. Hard crunchy rice. Stale bread. I h","useful":0,"cool":0},"WgTJNZa9q51RiGNU7DYRBw":{"text":"Stopped by a couple of weeks ago solely because we walked out of another place after we pl","useful":0,"cool":0},"ja9DGlWENNnPWsKatgfmPQ":{"text":"Ate here twice, had the chicken parmesean, which was excellent! We sat once on the street ","useful":0,"cool":0},"wfXiOYFvzLegeYXABLtBCQ":{"text":"I wanted to like this place - it was a great location but the waiter was below average.  T","useful":0,"cool":0},"734hrtNpnqPAAqYpQns2RA":{"text":"I love this place is fried shrimp Po boy. They also have something on the menu which is gr","useful":0,"cool":1},"vPjA4I8GeZ9O1WcMEboJrw":{"text":"Super close to our hotel, our server was amazing! She couldn't describe the beer too well,","useful":0,"cool":0},"hj75eNhV1DwKpJyVuMWKSA":{"text":"Loved this place until our most recent visit. Bartender was extremely rude. We probably wo","useful":0,"cool":0},"G-RA1i0w4knAyP0c3EJB9A":{"text":"Tourist trap. Expensive. Worst po-boy we had in NOLA, we ordered crawfish, but you couldn'","useful":0,"cool":0},"OZjhERW3y0D5f_usBQLYuQ":{"text":"The food here was so delicious. The oysters were fresh. The crawfish Mac n cheese was so r","useful":0,"cool":0},"hGLyvBRVDBhLXyIVTPPnpQ":{"text":"The crawfish cakes, BBQ shrimp, Cajun margarita, and redfish were absolutely amazing.  The","useful":0,"cool":0},"O83eno46HQ8g8iElMYDkqw":{"text":"This quaint, old place at the corner of Chartres (pronounced \"Charters\" by the locals) and","useful":0,"cool":0},"vjeRr4j0y6b1vZUGex0iXg":{"text":"The service was great and a good atmosphere.  The food was awful. The blackened redfish wa","useful":0,"cool":0},"6GVCk9DZNmr10Unv-3Yy8A":{"text":"Stopped in last minute and was anticipating a great meal.  Just ok.  I had the fried tomat","useful":0,"cool":0},"G7kWbB8SQZ6a5ngjdxVbfQ":{"text":"My girlfriend and I went here for dinner. We ordered a Bloody Mary, two types of chicken w","useful":0,"cool":0},"kS-VnT68QVZndook4JDbEw":{"text":"Great drinks and good food.  Best for late night service industry crowd.","useful":0,"cool":0},"jfh3__bB1EK7yffuVs11eA":{"text":"Amazing.. Have been here two times now and both were fabulous. Came w/ and w/out the child","useful":0,"cool":0},"hhXZfdE4Sxa93HiH00csjw":{"text":"The service, environment and food was amazing we can't wait to come back the alligator app","useful":0,"cool":0},"h-_MGTncigmbzTRHqbxuCg":{"text":"This place was ok. Atmosphere was pleasant, though the AC was frigid. My friends and I wer","useful":0,"cool":0},"ullsYLjkXNOFnCv2a2dkGA":{"text":"Wow... our waitress made us laugh, the food was off the charts, and the prices are right! ","useful":0,"cool":0},"oXvg307LxsBCJ9AgLgVSgg":{"text":"This was our second visit to the Chartres House and lucky for us, it was our second visit ","useful":0,"cool":0},"HJbnartHJBL72Ye8ZrKrxg":{"text":"Despite some mediocre reviews, my fish was the best I ever tasted.  Moist , hot, and perfe","useful":0,"cool":0},"Pc-O7as4A7lSj4Dkx47YKw":{"text":"While looking for somewhere to cool off we came across this restaurant, and I couldn't be ","useful":0,"cool":0},"dX3SrdZHS4jzhGI7ZkDm_A":{"text":"Pierce was our server, very friendly and attentive. The food was great, large portions. Th","useful":0,"cool":1},"3XB8wYUqHNbp0mIpGXA0xg":{"text":"Awesome first stop in Nola! I had a shrimp appetizer, red beans and rice, and a stiff vodk","useful":1,"cool":0},"2AuYUakZ0DxJFAcJWSw27A":{"text":"Good service. Nice balcony. Awful gumbo and bad jambalaya. I would not even consider it gu","useful":0,"cool":0},"YuEj6xs6lgD5uq2c24Mvtw":{"text":"My favorite place to eat in NOLA!\n\nThis is the real deal- and by that I mean you can relax","useful":5,"cool":1},"WIl1kakH3lEnBKjPdcT6LA":{"text":"3rd time in NOLA and 3rd time here! You can't go wrong with the Taste of New Orleans and t","useful":0,"cool":0},"HoQl7c7hBJ6CC5TT4D9VIg":{"text":"Good food\nNice atmosphere \nReasonable prices\nGreat service \nConvenient location \nWill refe","useful":0,"cool":0},"7_hUwzGVMnObI3ykUNwYdg":{"text":"Great little place with tables right at the door. I love eating out side and this was clos","useful":1,"cool":1},"5j6CPseuMmFhFb-8wfJCtA":{"text":"We were originally going to The Grill, but there was a 3 miles long waiting line. So we lo","useful":1,"cool":1},"mX2L7KG3ttIQ5beoBDw29g":{"text":"Extremely impressed. Jambalaya was definitely more flavorful than some of the places I hav","useful":0,"cool":0},"-Awt6nNF9eAdzcYbpYASHA":{"text":"Yummy! Ate there yesterday with some friends for the first time. Have to say the Fried Gre","useful":0,"cool":0},"jbGnH7hEC-l94I47GP3oQA":{"text":"Chartres House Cafe is no 4-star joint, so don't misread my rating. Nonetheless, I have no","useful":1,"cool":1},"t7tz0RiR1QCW9jAimXJI_w":{"text":"Terrible service waitress we only saw twice , food average, very dirty restaurant \n18$ for","useful":0,"cool":0},"Y77Vmf4wqOVzdqpYIANvHw":{"text":"Ok spot.  Quaint and old style setting.  Decent drinks and food.  Nothing here is better t","useful":0,"cool":0},"VzO5Yc3j1FqGorChLN2o9g":{"text":"Terrible service literally sat there for 30 minutes after being seated no waiter came to u","useful":1,"cool":0},"NRDjDFUUqIT3CpkM7seJyQ":{"text":"The food was amazing! Rene was super attentive and helpful, gave an amazing recommendation","useful":0,"cool":0},"1UmrCSLVJz3Em6GdD_qmvQ":{"text":"I went to Chartres House Cafe in the begining of my vacation in February, their gumbo was ","useful":1,"cool":0},"S9Twpd9YZoLNsJycUdOOHQ":{"text":"Get the spinach & artichoke dip! The \"chips\" are fried bow tie pasta-very unique. I got th","useful":3,"cool":1},"hwPfR2Vw1MY6wNzZDnwYeA":{"text":"A friend and I were looking for a restaurant to avoid a long wait and stumbled on this one","useful":0,"cool":0},"jP04UiQhtdWQomaGWbK5dA":{"text":"Had the boudin and the muffaletta. My wife had the hot sausage po boy. Everything was deli","useful":0,"cool":0},"T4qUWumY7Q5n8QYFK94V-w":{"text":"Chartes House, oh Chartes House. I have been frequenting this establishment since I was ju","useful":1,"cool":1},"Gh_8zY-BUBCrj4pCm4yWUg":{"text":"I wish I would have had a Bloody.  They have one of those fancy vodka steepers.  Alas, it ","useful":0,"cool":0},"i4pF-_sG5ZP3k4PfQUkdYQ":{"text":"Honestly... not great. Food dry and tasteless... really basic food and obvioisly just a qu","useful":0,"cool":0},"mQ1rIZxH-d7wKoNAhafcKw":{"text":"This is a great spot for lunch!    My wife and I stopped here upon arriving in NOLA, and w","useful":2,"cool":0},"Axeeud_Nbz8EI75k0l6aPw":{"text":"Just popped in for drinks, cool space but the bartender was pretty blah. We had to move on","useful":0,"cool":0},"kB6PCt9nP_d9jrttkDxFXw":{"text":"Open bar / restaurant , our table say in the doorway near the sidewalk. However this meant","useful":0,"cool":0},"XBHVCISjDNp1cufVGpWdYw":{"text":"The po boys are amazing. My girlfriend thought the gumbo was good, but thought it needed m","useful":0,"cool":0},"SI2i4GOcEtXQkJ5JxIFpvw":{"text":"Came in on a whim...we had the traditional char grilled oysters and supreme oysters...on t","useful":0,"cool":0},"IQipnVnZJyUnyNUc9vnDdQ":{"text":"This was my first time in New Orleans. As everyone knows this is a town with no shortage o","useful":0,"cool":0},"XYc-wpIWyGqLtswz4JqapA":{"text":"I loved this place. The oyster Po Boy was perfect. My husband loved his house special Angu","useful":0,"cool":0},"IhtQHGSY-k_RkzypocBHiA":{"text":"My girlfriend, Me and my 80 lbs. Shepard can here and really enjoyed the food and he reall","useful":0,"cool":0},"cxRqywqH9W7CCFzMJrcXJA":{"text":"Surprisingly I really liked this place. We stumbled upon it last minute. We all ordered th","useful":0,"cool":0},"TMm2HSAycJsdgT9hD9gB3A":{"text":"A solid 3 stars, mainly for the \"ok\" food. The service here was sad, though.\n\nDavid was ou","useful":4,"cool":1},"OkwS5rgUf_U7a_3u1ShW1w":{"text":"We used to love this place, and told all our friends to go.  But tonight the service was p","useful":0,"cool":0},"m5LcCqMhTR6rLMWFlZ6wRg":{"text":"This place was a last resort and out of hunger. \nTrying to get into a popular restaurant i","useful":1,"cool":1},"8s5jmy5mkndRA1jiz4FPkw":{"text":"Food is ok, service is absolutely terrible. I had to go find a waiter to come give us wate","useful":1,"cool":1},"OHSR8mbV-LaqiXenQ1UPfQ":{"text":"My favorite place in all of NOLA, funny enough turns out to be one of the oldest places sp","useful":4,"cool":4},"gVmFAvihLKrkJa5DWBek0A":{"text":"Terrible service. We had finished our meals before the sixth person in our group got her m","useful":0,"cool":0},"fv4NzylJs7UhIzQCwp3YeA":{"text":"Winnah winnah, bloody mary dinnah!!!! The BEST bloody Mary anywhere (and Ive been everywhe","useful":0,"cool":0},"V0_97o1cFohINyi87rbUyQ":{"text":"I love and miss this place so much! I've been there when it's hot and I've been there when","useful":0,"cool":0},"57EzW0nM0o7EuijA6rVWqQ":{"text":"I had light brunch fare here this past Saturday since it was walking distance from my hote","useful":2,"cool":3},"vyJrkaeni045TbOpYQOCTg":{"text":"The crawfish stuffed fish is probably the best entree  I've had at any restaurant ever! I ","useful":2,"cool":0},"zZ0Qv22D6z1sALt0drX8ZA":{"text":"I come to this restaurant whenever I am in New Orleans. Never fails. Always make a stop he","useful":0,"cool":0},"5u2CxTPXnyQ9Bop54tD6rA":{"text":"Just wow. This place is phenomenal from the minute you walk in the door. Our hostess was e","useful":0,"cool":0},"wKiJYg-aswd0A0Bnp4uprg":{"text":"YUM... Seriously great food at reasonable prices.  I ordered the stuffed fish (stuffed wit","useful":0,"cool":0},"m0ZSNTDb-TYr9Wh1QjR7GA":{"text":"We stopped in for dinner on a Saturday night and the place was pretty empty. We all ordere","useful":0,"cool":0},"QOzjZsSq440Yzgfe2ltNwg":{"text":"Hey... don't pull out the zagatt guide for Chartres quite yet..  \n\nBut the price is right,","useful":1,"cool":1},"SAYvmF9QVSvMQlnkZfuuxg":{"text":"A pedicab driver we spoke to told us to come here for good, hearty, grub. This was bar far","useful":0,"cool":0},"Old4OWDgoXMTC4OlkmJv9A":{"text":"Raul is the man  sat out on the roof top and watched two wedding parties with marching ban","useful":0,"cool":0},"ATerg2IDXpmxaQF9FWUKzg":{"text":"We live locally and chartres house is one of our absolute favorites! The blackened chicken","useful":1,"cool":0},"voJE16_1585jUdMPO-Cjkw":{"text":"We never ate here but the bloody Mary's are some of the best that we had in the French qua","useful":0,"cool":0},"ioeLQRIk6VEAPrxa8N9JWA":{"text":"My husband and I came down to New Orleans for our honeymoon and I was looking for some del","useful":0,"cool":0},"2DGNy33uIykKH41vxT-KPw":{"text":"We went to the place because it is pet friendly but the food ended up beig excellent. We t","useful":0,"cool":0},"TgHFAZcHmhBDlzppg1Csbw":{"text":"I know this place has mixed reviews but I guess you gotta know what to get. The spinach di","useful":0,"cool":0},"zKrKUh-rnMa44tamnLelqw":{"text":"Courtney was a fantastic host, I highly recommend the chicken gumbo. Excellent location fo","useful":0,"cool":0},"zSypxW3gv7KLRgvNIjyDhQ":{"text":"My wife found this restaurant online and we then went and ate there.  When we arrived at t","useful":2,"cool":0},"bPU5UuH2hLAf9vEpZOynvA":{"text":"The balcony seating location is great for people watching.  The staff are engaging, attent","useful":0,"cool":0},"QhXmyT1XeWHgLlRZbDsMXw":{"text":"Tastiest cocktails in the French Quarter. Specialty cocktails were incredibly well mixed a","useful":2,"cool":1},"zB5AWz5GQDsJsTjiHATmSA":{"text":"We stopped in for dinner on a Sunday evening and were seated immediately. Drinks are a  li","useful":0,"cool":0},"1bixF-sr7Cou1OY_3sEa9g":{"text":"Just walked in Christmas Eve our waitress Marissa was a breath of fresh air. Very knowledg","useful":0,"cool":0},"TG90yUnySsYchIaw-Q12Ow":{"text":"Chartres Oyster house \n Checked out this little bar  in the french quarter as we were bar ","useful":0,"cool":0},"_9E8hhfpSqgLU15IjBzEdw":{"text":"We are so pleased with our experience at Chartres. The staff was accommodating, helpful, a","useful":0,"cool":0},"Dl6KvMYWdCSGYEo1mMKk_g":{"text":"This place gets a major thumbs down. Popped in for a solo meal alone on Saturday. Being th","useful":2,"cool":2},"RTWAmQF96qrplwOlkQRL1w":{"text":"Never again.  When we walked in there were plenty of two-top tables available (and there o","useful":0,"cool":0},"bxcHRz7GQn8yJIeCIzJRnQ":{"text":"Good service and excellent seafood. We got a table by the street and enjoyed the food (bbq","useful":0,"cool":0},"S7LipyG1LsXe8xlS-_FQGQ":{"text":"I dinned here several times while during my stay in New Orleans. I loved to sit on the bal","useful":0,"cool":0},"ZiPWOskPkDTMigw8ww2uOQ":{"text":"Stopped by with some ladies looking for a good Bloody Mary and some good food. The Bloody ","useful":0,"cool":0},"ghI8XG5uOxRZ_rSenzaIgQ":{"text":"This place looked promising i got cold fries cold burgers the manager was no where to be f","useful":0,"cool":0},"dC8dwvzI8uR-NRr6WNI9ww":{"text":"EXCELLENT PLACE!! Food and service is fantastic! Highly recommend the duck empanadas, even","useful":0,"cool":0},"oGApjw6mngmzQuWBF-O3hQ":{"text":"Great service and friendly wait staff. We went to quite a few places in town and this plac","useful":0,"cool":0},"8vJdT1QO1Yt0aOM1PpQWqQ":{"text":"Dinner on a weeknight, solo dining.\n\nNot busy Wed 6pm, seat at the bar.  Pleasant and atte","useful":0,"cool":0},"_ZLyucqSXTfinmt_yVUIOg":{"text":"This was a return visit for us, previous trip we had a great lunch here.  This time, we st","useful":0,"cool":0},"s_Gk6fuzd7juWM1KmOeeVw":{"text":"Always great service! Always great food! We come here every time we visit Nawlins. We ate ","useful":0,"cool":0},"MyXB6RHaGvyENvs-GbDSQw":{"text":"We arrived on New Orleans this evening for the French Quarter Festival. After checking out","useful":0,"cool":0},"KWm92w12Xm5lCA-Sy1NsAw":{"text":"Look at the pictures.  Only a block from Jackson Square and just perfect for lunch.  MUFFA","useful":0,"cool":0},"OBxKOi82-I78Mn9WcSIoeg":{"text":"Worst service I've ever had... took over an hour to get the appetizer... took almost 2 hou","useful":0,"cool":0},"dSLupkdxV9EXiX15QDgSNA":{"text":"Five stars for the Shrimp Po'Boy with two sides of housemade remoulade sauce!\n\nI ordered t","useful":0,"cool":0},"d6_iIbySMOr_j2oKiZqFJA":{"text":"First, it should not take 40 minutes for our food to arrive. Other than that, the food was","useful":0,"cool":0},"7XpzQoQOfEH5ipCsccHpNA":{"text":"This place, after horrors we experienced earlier, was like heaven on Earth. We were welcom","useful":0,"cool":0},"KCCn3VNo3z9EAL_JHtl-QA":{"text":"They moved into a nice new location in April, caddie-corner from the old place.  Clean, op","useful":1,"cool":1},"X4P0p-WvuZ3FrvAOGOs26A":{"text":"Crawfish Estrellita? Ooh, hell yeah. This was great! Our party of four had bloody Mary's, ","useful":2,"cool":1},"7Z0_n339wU14hweKZSKZ7A":{"text":"I am very sad to say the quality of the food has changed. We order crawfish bread and the ","useful":0,"cool":0},"E6EbVLRGOuCd2UYf6ZITSQ":{"text":"Just walked in Christmas Eve our waitress Marissa was a breath of fresh air. Very knowledg","useful":0,"cool":0},"8rSO_OzEi3e28zUZkb-HdQ":{"text":"The food was good here and it's a fun little spot to dine. We ordered the meat pies, a shr","useful":0,"cool":0},"q_DaWI_lQKPkcCwOQQ3BjA":{"text":"We were exploring in the French Quarter when we came upon this place. It was one of the fe","useful":0,"cool":1},"ZxFMj3LyR8Jju7KY6BDiKA":{"text":"I was just there in New Year's Eve. It was a fantastic atmosphere and incredibly quick ser","useful":0,"cool":0},"SI7pcT2gRNgD29kDhwCyHQ":{"text":"This was absolutely unacceptable in so many ways. To start, the service is terrible. Our w","useful":0,"cool":0},"MXYrL_uYfJPevkZP68Pq6w":{"text":"Have been in New Orleans all week and by far they have the best fried Alligator in town.  ","useful":0,"cool":0},"SkaSnCJaNRJNrqN6b_zsPw":{"text":"Food was delicious.  Service was fast and efficient.  Drinks were cold and full of the goo","useful":0,"cool":0},"e5VuokYf1NSg3FbIwsAS8A":{"text":"Service was excellent food even better. We had a large group on a Saturday night and they ","useful":0,"cool":0},"pNRceqUNAvtv95lHXp77XA":{"text":"The fried green tomatoes were very good.\nThe roast beef po' boy was excellent- very tender","useful":0,"cool":0},"foK2bXKjiz_4WVylpybEFw":{"text":"We went here during Mardi Gras week and it was packed downstairs but quiet upstairs. I got","useful":0,"cool":0},"3qjzgP08IdK9ahMqcPuLdQ":{"text":"Always great service! Always great food! We come here every time we visit Nawlins. We ate ","useful":0,"cool":0},"MOBB2bXMd3ZeJOLd98yQFg":{"text":"This was the only place that didn't have wait time. However, this is the worst restaurant ","useful":1,"cool":0},"sMRpZkk5murISOk8TNFpbA":{"text":"All we got were Bloody Marys to go but the bartender was very friendly and the BMs were de","useful":0,"cool":0},"Z-c2PSWGOchVHnFOQNeGjw":{"text":"The food was amazing and the customer service was awesome . I don't know the gentleman nam","useful":0,"cool":0},"gomy557_1UWkaBIBo_kwGQ":{"text":"This was our first dinner for our visit to NOLA.  We sat outside on the balcony at 7:30p a","useful":0,"cool":0},"QFNmDqSUDKf9rZeFljOc-Q":{"text":"Good service, pretty good food, good atmosphere.\nFried green tomatoes were average\nTaste o","useful":2,"cool":1},"idXCkIzgW9prvlGlZni_ag":{"text":"Service woman is passive aggressive and refused to redeem my Yelp coupon. In addition to t","useful":1,"cool":1},"0eEAlIPJ88bLmtcP98xRyg":{"text":"The hamburgers are made with flat bread and the flavors is disgusting and i waited 25 minu","useful":0,"cool":0},"Ra9mIouOaQpUuT4QB2y-xw":{"text":"I was looking to try a new place last night, and Chartres House looked promising.  The foo","useful":0,"cool":0},"6qFg_EMHqhXPR7UIruux3g":{"text":"Oysters were delicious- the blackened fish with shrimp was very good. Others in party all ","useful":0,"cool":0},"K_gM1UvugNUD_LqvCffKtQ":{"text":"Doing some work in the French Quarter this morning and decided to make it a day and set up","useful":1,"cool":2},"R5Ikwv_MJ_5EY8YE9YHi6Q":{"text":"The crawfish crabcakes are excellent!!! Would've gave them 5 stars for that alone but the ","useful":0,"cool":0},"T6Rrk61ChjOeSA8_SyPdDQ":{"text":"We found it just by walking down the street. I had the jumbo wings and it was the best fri","useful":1,"cool":1},"scYJIw4_6gzuX5jvsQnTZA":{"text":"Excellent dinner at very reasonable prices. Redfish charter was delicious at a considerabl","useful":0,"cool":0},"fb9lziMGV-lISSQ6jSxpDQ":{"text":"Last of our stops in NOLA for this trip.  Good place with some history.  Food was good.  I","useful":0,"cool":0},"6eFrb8Qh_enITU7JFJB_uA":{"text":"Shame on us for not leaving right away.. When hostess seated us at the table at 8:15p on a","useful":0,"cool":0},"GJZaAMF0w2cbuUXO3WTmag":{"text":"Raul is the best- great service and very friendly. We've come here 3 times on our trip and","useful":0,"cool":0},"o2Gb_VSy_itJJ2hho6xFpg":{"text":"Hectic evening in New Orleans...  more than the \"usual\".  Our party of three had a seat at","useful":0,"cool":0},"FeCgBITBmAiHmOizKKpwdg":{"text":"Did someone mention fried alligator? This surely is the place to try and enjoy a little ga","useful":0,"cool":0},"M5s0wXNMfAfnm1cOnIH5QQ":{"text":"Wait? They serve food here?  \n\nAll i know is late night $1.50 highlifes on draft.  Cheapes","useful":1,"cool":2},"5lUAFUaTRFvxHnsdxaFHhQ":{"text":"Very hospitable people. Excellent waitress. Her name was Britney. Food was pretty good. We","useful":0,"cool":0},"pbh6re5SBrzJMiPEI6i9ow":{"text":"We ate there on Sunday evening,  (2/6/19).  The manager had just opened the balcony for di","useful":0,"cool":0},"pT4f2kYn9-1rjEBJOr3zxA":{"text":"Held a party in the upstairs private room for 25 guest\nI had not seen the venu, tasted the","useful":0,"cool":0},"0KhHsAfIDwSz5uwVdlJA7Q":{"text":"Great atmosphere! Only had a few appetizers and they were very good and well portioned esp","useful":0,"cool":0},"DSPyOvbPY6Yfr7WcCMW4Bg":{"text":"Great service! Loved the margaritas and the shrimp Po'boys we had. I'd recommend this plac","useful":0,"cool":0},"-P5CIcRGbhicFpSWaU5EUw":{"text":"Amazing country style fried chicken!\nThis is what real country style fried chicken and foo","useful":1,"cool":0},"DreJLQT1DUcTDbFBJMNRYg":{"text":"Ate there on a Friday night, kind of cool and rainy..they seated us in warm room and the f","useful":0,"cool":0},"p_NrspMCl6InKLLdzLuI_g":{"text":"Ate here a few times while on vacation for Christmas.  It is a cozy spot in the quarter.  ","useful":0,"cool":0},"lHRj0Pn7sNnANvLc8Lh-dw":{"text":"The food at this place is pretty good but a little pricey for what you get, and I would pr","useful":0,"cool":0},"P65KxfdfAoqna5afKW-z7Q":{"text":"Bartender was less then friendly. Ordered the fried green tomatoes and a fried shrimp Po' ","useful":0,"cool":0},"THcHMyEmvp5ezgHLhMujxA":{"text":"We came across Chartres House while walking around the French quarter and came in. We were","useful":1,"cool":1},"eIJz4C43TcBfsouhEogI6w":{"text":"First time eating in the Big Easy from NY. Tasty food and great service! Ask for Alphonse.","useful":0,"cool":0},"d6H4P923U5V4eZ_cnwD_Yw":{"text":"Stopped in for a late meal on Saturday night. Firstly, couldn't find any staff when we fir","useful":0,"cool":0},"Sfx0jlhi0UQU-PMRytmq-g":{"text":"Great service, friendly staff, and dog friendly. We were seated down stair with our furry ","useful":0,"cool":0},"TSmBU0gyHq99gU9eLiRUrg":{"text":"good location as it's in the quarter, but it is nothing to write home about. i feel it is ","useful":0,"cool":0},"_4RAEv189IM284XgllFD5A":{"text":"everything was fantastic. i got the New Orleans sampler, 3 classic dishes. it was bomb. bo","useful":0,"cool":0},"GQhXO2IvlgicuSdXVHc4CQ":{"text":"Amazing! One of my favorites in NOLA. Raul was the best server; he took such good care of ","useful":0,"cool":0},"S67vg0rbJvQy8H85rAwFJA":{"text":"We were just walking around the quarter looking for a quaint place to eat, and came upon t","useful":0,"cool":0},"_Ie01xypHE8kkIgV9O2ZEQ":{"text":"Food not really that good. Watery gumbo. Bready sandwich with not much meat. If you like a","useful":0,"cool":0},"dFZbn-F_W6t09sw4kofzvQ":{"text":"This restaurant was just what my friends and I needed on a day out in New Orleans! The hos","useful":0,"cool":1},"Fc7v0MpavfViJetkRQDd8Q":{"text":"The food here was very good. Both the po boys and red beans and rice were tasty. The servi","useful":0,"cool":0},"YsbCht9zer9s_3fKPfgPxg":{"text":"The staff was very friend and the food was good!  My daughter really liked the alligator a","useful":1,"cool":1},"K3mGSJS4mlvgav4hrAPxOg":{"text":"Great spot! Stopped for drinks and apps! Super nice waitress. Tried fried alligator! Mmmmm","useful":0,"cool":0},"bZ3e_DT1UOQruUG0XIRcdA":{"text":"Absolutely wonderful food. Courtney was our waitress and she was a sweetheart. We'll defin","useful":0,"cool":0},"TLhxL8m2uTL0k22HXCxXcA":{"text":"This place was amazing. We sat at the bar and ordered oysters. Our awesome server, Kavin, ","useful":0,"cool":1},"yw9JZ16GGVgTJQ8VzA-VXA":{"text":"Great atmosphere! Sit in the courtyard in the back. The food is amazing all around. The hu","useful":0,"cool":0},"Go7dWvXDuKkYOqzlRsO9PQ":{"text":"Good food!  We did get longer than anticipated wait, but the manager proactively jumped in","useful":1,"cool":0},"p4csAAvLUq685C0kkOH8VQ":{"text":"I am pained to have to even award one star, where are the negative star options? This was ","useful":0,"cool":0},"Bjas35jC1H5VXDvPLrW1Lg":{"text":"Delicious !  The bread pudding was amazing. The grilled oysters and gumbo were very good.","useful":0,"cool":0},"MhKpCo2-O1LyJAwJm_9RFw":{"text":"One of my favorite meals! Just a down to earth, lunch at the bar and we enjoyed every bite","useful":1,"cool":1},"_uYBz-yS0ki175zNZpmBoA":{"text":"Badly organized, took forever to get a bowl of soup, we finally just paid for the drink an","useful":0,"cool":0},"Atpqx8jLA3cJTte4MVRzkw":{"text":"Not worth it. Food was okay. Mediocre for the price. Nothing you can't get at any other Ca","useful":0,"cool":0},"xIoPEGPs2Fx8OnV8W9Z64g":{"text":"First and foremost, the staff is friendly and excellent. \n\nAs a truck driver, it is hard t","useful":1,"cool":1},"N9qEIPt-gwrmW5bRGN7zrg":{"text":"Great spot! Stopped for drinks and apps! Super nice waitress. Tried fried alligator! Mmmmm","useful":0,"cool":0},"m1EiLraj2SdRxany7lk_Zw":{"text":"Ate here for the first time. Food was great (esp the Gumbo and Pecan Pie). Service was awe","useful":0,"cool":0},"drUNNqG7gYU1gLvD4G0xzg":{"text":"Wow! What a difference movjng across the street has made! Beautiful build out. Food was am","useful":0,"cool":0},"R7iamYfjADwBNHRFxPElAw":{"text":"Most disappointed I've been with a restaurant in New Orleans. We stopped by here while wal","useful":0,"cool":0},"K7cinzRTE86Cb0HEAglFOw":{"text":"GREAT SPACE to watch Quarter life; but it gets crowded so go off-peak!\nGREAT STAFF among t","useful":3,"cool":3},"2s3POKEfPW9kkHOE1HynIQ":{"text":"Oh, my goodness! My first time here and it's now my favorite place. My appetizer of fried ","useful":0,"cool":0},"QT_Dj6wzP21on8rI-jobfQ":{"text":"We were so happy to come across this great dog-friendly restaurant! I had the Shrimp Po' B","useful":1,"cool":1},"XX7VGPFr1VrmbpmBN5xb6Q":{"text":"Almost all our meals in New Orleans were excellent and 4-star level, but a couple of exper","useful":2,"cool":0},"ZWWSBlgCEmywwioqJSqumg":{"text":"Raul was a great server! He helped us with suggestions for dinner. Restaurant is in a wond","useful":0,"cool":0},"1Y80ch2XCzt-KPPr8o5tHQ":{"text":"We just came upon this place no recommendations..and let me say it was nasty! Ok maybe the","useful":0,"cool":0},"Qet6FhXBpHTFFXRqjjXThw":{"text":"I used to go here a lot years ago when I went to New Orleans more often and finally return","useful":1,"cool":1},"6TrCJE5n9OLW4uHtR6UMcw":{"text":"Redfish with pecan glaze a wonderful combination tigon of flavours. Vegetables cooked to p","useful":0,"cool":0},"r-SpAXqdluJNnO7RU_baHg":{"text":"Got off of work from a busy day stopped in charterhouse got the grilled fish jambalaya and","useful":0,"cool":0},"ry2LAaJXiX0PsFePWSx9Wg":{"text":"We were not impressed. We expected something over the top. Shrimp Po-boy was mostly bread ","useful":1,"cool":1},"27sty0l8IY9t0vJog5YTSQ":{"text":"Stumbled upon this place to warm our hands on their heater and stepped inside to eat and e","useful":1,"cool":0},"trQOT_t2kW0EicjY-AqVKw":{"text":"I've never been so dissatisfied with a restaurant before in my life. My mood was even ruin","useful":0,"cool":0},"3kPTkVpUUtQw6qjuJOffuw":{"text":"I am a grandchild of New Orleans. My grandfather's family is from here and my roots and ev","useful":0,"cool":1},"m02jU5Y9gAVb0ukX-Y3Zqw":{"text":"The service here was excellent. Raul gave great suggestions to our group, was helpful and ","useful":0,"cool":0},"9tRvbnLRxZeAby6LR1SJPw":{"text":"Chicken muffuletta was very good! Chicken was very juicy and tender. Buffalo wings are HUG","useful":0,"cool":0},"6-uNXrnYM_snpNhraeQbIA":{"text":"I was a with a group visiting from out of town and we picked this place randomly. The serv","useful":0,"cool":0},"qvUnUZaaBedVTecdtQ1Y5A":{"text":"Chartres House has a nice old school vibe. We only stopped in for drinks but they were gre","useful":1,"cool":1},"-gHGKkMseXUz7-0LN8xD7w":{"text":"When the French Quarter was crowded on a major holiday, this restaurant was able to seat a","useful":1,"cool":0},"zdkg_iMF1ME2pDnI-6WZAw":{"text":"Chartres House is a great place to eat. The fried seafood platter is plentiful and good. T","useful":4,"cool":3},"Y1JJ_eT7EkwZ--OrvCgf7Q":{"text":"Go see Nani at the bar great company!!! Good cold beer, fair prices!! Food was good (we wh","useful":0,"cool":0},"DDQv-Q-7aPN4CS_muhoLHw":{"text":"TOURIST TRAP!!! The boyfriend and I are locals but we thought we'd wander around the quart","useful":3,"cool":0},"P8uCnF_2aRZycmlG_U4Iew":{"text":"Wandered the French Quarter last night looking for a restaurant that wasn't too expensive ","useful":0,"cool":0},"XStadAq1AD1WlGvDun97tA":{"text":"The food is excellent!  My favorite is the jambalaya & the roast beef poboy!  I would also","useful":0,"cool":0},"uFm0F6fowp15hC5IvsnWzQ":{"text":"This place was amazing. Totally found this restaurant coincidentally but glad we did. Food","useful":0,"cool":0},"JrAmsFjzPbzvQ2RQ_VOehw":{"text":"Based on information found online, we called this restaurant to place a delivery order. Th","useful":0,"cool":0},"P-1ZIty4wxx7wvSWg_IDnQ":{"text":"We came to this place because it's dog friendly, and we repeated because of the food. Try ","useful":0,"cool":0},"ZTyImO7WaLbbfa1DpWRHYg":{"text":"The drinks are amazing here! Courtney our waitress was super sweet and recommended some am","useful":0,"cool":0},"hZm5IZq7inDjKcd04r9x3w":{"text":"Sit up on the balcony for some great people watching. Food is 3 stars but location bumps i","useful":0,"cool":0},"CskwEXsQlIfyTi2d-7GGEQ":{"text":"So much better than the old location.\nI've eaten here twice recently and loved everything ","useful":0,"cool":0},"JHq975cZ9cdM8zc3FUHx8Q":{"text":"Recommended by our hotel staff, but was disappointed you the food. Service was nice but th","useful":0,"cool":0},"Af09CUeuv0enyQB_wZy5hw":{"text":"With so many wonderful choices in New Orleans, we made a special point of going to Chartre","useful":0,"cool":0},"ZGGZBxAwslugEuCtuaIiaA":{"text":"Everyone in our group liked the entrees they ordered. I would come back to order the stuff","useful":2,"cool":2},"nZbM-1GEDjO9VlNakqcdFQ":{"text":"This place is awesome. Our server and hostess were super friendly and informative. My husb","useful":1,"cool":0},"sXYZC_T69nH-aZleOcuLqw":{"text":"We came here with a group of 15 for a bachelorette party. Like, need I say more? Craziness","useful":2,"cool":1},"xI_-ktSZS1-4YQYpJijP0A":{"text":"We really loved the Fried Green Tomatoes and man oh man they were good!  The hotel we are ","useful":0,"cool":0},"UIaPsYTTjy_TbhljhPVAAg":{"text":"I love this place! We sat outside even though it was freezing out, and they had heaters ev","useful":0,"cool":0},"J4XtIygvbXjb7_NS0XHGMA":{"text":"Just stopped in for lunch. I had the gumbo and my gf had the corn crab bisque which was su","useful":2,"cool":1},"yq8awyzzOo59_k2kMNjrOg":{"text":"Having walked all day, sustaining ourselves primarily on beignets and beer, it was time to","useful":2,"cool":1},"oBR65UQYs5gS7uagZZ1MQw":{"text":"Good food, big plates, casual atmosphere, great service!\nOur server Tevin was amazing! Thi","useful":0,"cool":0},"fHvUGXj7RLBNBv1BdY_39Q":{"text":"Ok first...our hotel staff recommended this place...only two blocks from hotel #convenient","useful":1,"cool":1},"2Il6ky_sJjWvdxM2eHC6_Q":{"text":"To be completely honest, this was the WORST experience of my entire life. We put our name ","useful":1,"cool":0},"BxLk7MjubsuYFsBCR_AyFw":{"text":"My friends and I enjoyed a pretty good dinner here while we were in New Orleans. We went i","useful":1,"cool":1},"oOJxq5DTgk-PDC5p52TEJw":{"text":"Great service and the food was delicious. Definitely a restaurant to visit when in the Fre","useful":0,"cool":0},"-qm7RS5RFmO8tdeCqcUvIQ":{"text":"Great service and phenomenal food! I ordered the crawfish bread twice! My husband ordered ","useful":1,"cool":0},"ZQouvf3r4XFc9uXp2_OiYA":{"text":"A lot of places within the French Quarter feel touristy and Chartres House is certainly no","useful":10,"cool":7},"niQ87qixzfT7xxpYdFsiXg":{"text":"I took a large group to Chartres House and my service was excellent.  We loved the crawfis","useful":0,"cool":0},"SYu7ejLT23Ens-jBqUuRiQ":{"text":"Piss poor service at the bar. I'm a nice, polite person to all servers. I tip good. Not to","useful":0,"cool":0},"IND-RnFOZdIvWcpzEJR6ww":{"text":"This was perfect! Walked by, saw the menu and decided to take the chance. We were not disa","useful":0,"cool":0},"cmh-x1qrARt-oMpbSFq9AA":{"text":"Best wings and Gumbo! Good local vibe with friendly staff! Perfect for a casual bar experi","useful":0,"cool":0},"4UYPkQsMoZAhEvTH6LZNWA":{"text":"This was by far my favorite restaurant experience in the New Orleans French Quarter.  Ther","useful":0,"cool":0},"ScKJU-NUaHZl9ONJP6669Q":{"text":"I wasn't impressed with the food. It was very bland. One star is given to the waiter for b","useful":2,"cool":0},"H5_OvpiR1WtNn6xyhuLzTg":{"text":"Go for the fried green tomatoes!!!  Awesome service here! Also the Taste of New Orleans is","useful":0,"cool":0},"zbHNZ324isNMYDQw0EYk6g":{"text":"Great off the path restaurant and bar. Casual atmosphere to hays few drinks and relax. Ver","useful":1,"cool":2},"2cJvx6mFmmqOJTeHn0gkHw":{"text":"Great environment and always busy! I came in for lunch after walking the city and immediat","useful":2,"cool":2},"ZU1T8iW373Lc7_wO3AUPnQ":{"text":"We walked in because we read they had balcony seating, however, when walking in apparently","useful":1,"cool":0},"FcAR5y7dy8Lpch8lyTUfaA":{"text":"So I started 2017 in the great city of New Orleans! Of course, my first stop was at Chartr","useful":0,"cool":1},"twdT1kJSRlRR8A-JL36iwg":{"text":"Delicious food, and excellent service. From the greeter outside to the wait staff, and bar","useful":0,"cool":0},"wwglYRN2Y_13P4EVe6UWJw":{"text":"The ambiance of this restaurant is perfect New Orleans with brick walls candlelight, patio","useful":0,"cool":0},"ial6p3OFWTL6SjCJbChePA":{"text":"This place is amazing. Great ambiance and incredible food. Our server, Courtney, was aweso","useful":0,"cool":0},"gCcd_xOzXjqdc0DoHHXAEw":{"text":"Amazing!! Our waiter made our first night there even more enjoyable. A small place in the ","useful":0,"cool":1},"NirKYL2KqCWypbAiepjn-Q":{"text":"This was a surprise find for us. We walked around for an hour trying to find somewhere goo","useful":1,"cool":1},"0lWN7XUgVVGZoSaC6VmOGw":{"text":"This is just your average restaurant inside a bar. I went here with friends as they both r","useful":3,"cool":2},"5TwBLv_xV0LawqkbIllEVg":{"text":"The drinks are great! \nWe sat on the balcony.  Enjoyed the breeze and street traffic. \nOur","useful":1,"cool":1},"HINqvXTqkRIqomYAnyp81A":{"text":"Fortunately it was a perfectly warm afternoon and their doors were wide open, so I chose a","useful":20,"cool":16},"SCVUmVtyDA88cvqwmmdBLg":{"text":"I thoroughly enjoyed my experience at Chartres House but I still took off a star because t","useful":4,"cool":2},"hTmc0Rn93MbBvO9SPnTUBw":{"text":"Stopped in last week with my wife and could not have been more pleased with everything. \nW","useful":1,"cool":1},"50VGe2-oGu7r-OnYcWhBtA":{"text":"Why does it feel that every bathroom in New Orleans is in a contest to be the dirtiest and","useful":0,"cool":0},"9LwnOACdfV_X-olkUQVx7A":{"text":"We wanted a drink and a meal and this place satisfied. \n\nI started off with the duck empan","useful":2,"cool":0},"SdxhKGUnj9X_aa2fSEY8vQ":{"text":"Great southern food and excellent service! Very friendly for kids and adults. If you happe","useful":0,"cool":0},"MEOajFN1f-ywGhMhTHstDA":{"text":"Location: Not on the madness of Bourbon but still awesome for people watching. \n\nAtmospher","useful":6,"cool":3},"fyZt3gL_GcWkQF06grNqUA":{"text":"Our waiter Raul did a fabulous job he came and checked on our table several times very per","useful":0,"cool":0},"aROYAuYuoqX8aIOhIISTuA":{"text":"Don't order the gator! Terrible sent it back.  The taste of New Orleans was very good.  Th","useful":1,"cool":0},"JlGDjuEZHTckRtqN-H61jw":{"text":"I thought I had a \"Meh. I've experienced better \" dinner until I saw this guy (or girl) tr","useful":2,"cool":1}}