{"tcNKgBXpzOVhKStPnSyikg":{"text":"I stayed here for one night recently after having stayed at a hostel for a week. Getting t","useful":0,"cool":2},"_Gl27ixFE3wIZPdPVouRHA":{"text":"This is where we stayed for Jazzfest.  My mother-in-law gave our accommodations for Jazzfe","useful":1,"cool":1},"VhOs34M1CgqXxYXNsieyfw":{"text":"Having found this hotel on a travel website and seen mostly positive reviews (save for one","useful":4,"cool":0},"BnoQ3t3ner6An-0XoKMatw":{"text":"Stayed here back in August for a 4 night/5 day vacation with my girlfriend. Our flight was","useful":0,"cool":0},"yg370RAbMhAQ6Jf3fX0M4Q":{"text":"THIS PLACE IS A SCAM! Deserves less than one star.\n\nSo it was my turn to introduce my boyf","useful":1,"cool":0},"Kdfq8EeCPf0Nub8qGZfSYA":{"text":"I wanted to stay somewhere outside the French Quarter but still walking distance. This pla","useful":1,"cool":0},"5iJ7txLaBM04ZJEx9fV2cg":{"text":"My friends and I rented the Cowboy Suite for our visit to New Orleans. We got a great deal","useful":0,"cool":0},"HXID36gRotJAE4H-QaZC6g":{"text":"I loved staying here!  The innkeeper was so friendly + sweet when I arrived.  I loved my l","useful":0,"cool":0},"ElyC5_mSUG9fCe_qXRl2Rw":{"text":"This place isn't what they portray on the website.  Our room was dark, outdated and musty ","useful":0,"cool":0},"63dT6DhSqb1WYJCG6idX0Q":{"text":"This is my Home away from Home! My partner and I have stayed here 4 times. Every time just","useful":1,"cool":0},"D7_vdFzw7CSSNOf8OvMprQ":{"text":"Kim and Charley were great hosts! The room was gorgeous and more than expected for the pri","useful":1,"cool":0},"QgxEdVWM1zC-6THxMKv04w":{"text":"So I work in the event planning business, spending nearly 200-250 days a year in hotels an","useful":4,"cool":0},"0w-fQDmS7MpAqsGDWdFXGA":{"text":"My boyfriend and I stayed at the Creole Inn the wknd after southern decadence. We had a fa","useful":0,"cool":0},"xnwF78Vn4ziQmafgRYi4Vg":{"text":"I've stayed at the Creole Inn three times now. This third time (June 2011) was the first t","useful":4,"cool":0},"AZO_LV_GYImUoodYuv0Bkg":{"text":"I love Kim and charley!!  without them it would not have been a great place.  unfortunatel","useful":0,"cool":0},"94QJTRJYkxtg2_tUp78ZYQ":{"text":"This is more like an Airbnb than a hotel so there's no front desk so you can't get helped ","useful":0,"cool":0}}