{"rDuoj6GRvSKl7YatBcNQ5g":{"text":"If I could give a 1/2 star... This Waffle House is NEW! Almost 1 year old. Always has 10 e","useful":2,"cool":1},"Fq9KUHLP6xbgP6H39bVrJg":{"text":"Good food. Friendly service. Inexpensive. Not the best neighborhood, be careful of your su","useful":0,"cool":0},"ka6AsxsbJlELfebrN3bDAw":{"text":"Service was so bad, when my foid finally arrived, half my food, i got up left! I won't bot","useful":0,"cool":0},"93l1xbH2L4oP7SHYXAB8Wg":{"text":"The absolute worst experience ever. Save your time and money, do not eat here. Our order w","useful":0,"cool":0},"mTKog1uHJTGII_4GA4XGgA":{"text":"Dropping into a greasy spoon after midnight is always a treat, but stopping into this WH l","useful":0,"cool":0},"w7iU6C-N45tKt42VoVLLlg":{"text":"Arrived for a to-go order and every employee was in a bad mood claiming that they wanted t","useful":1,"cool":0},"fdOKwSq32XdGQMWt88xzoA":{"text":"wow.    the worst service ever.\nhad our friends not been there before us, we prolly would'","useful":0,"cool":0},"EFRciHhnxJkTe9uLEFiuog":{"text":"Every time I come here they are out of something. Once it was all bread.  Once it was all ","useful":0,"cool":0},"T3i9TebL_yvBhAxncYtOxg":{"text":"So we got a cab and went to WH. The food was the same as I remember, really bad and that m","useful":0,"cool":2},"Z5Yg9FR88VhXGAUTTn3u9Q":{"text":"Easily the worst customer service in the city. I've been here maybe about 5 times, and eve","useful":0,"cool":0},"f7ypWF1WcCMbSw7fFUtRdQ":{"text":"This place is Excellent.  Not sure why all the hate. We sat right down, nice waitress, fas","useful":0,"cool":0},"AvFLiqTO4GVbUK0iNFVUWg":{"text":"ZERO STAR!!! My friends and I tried to eat here and I will say don't even try. We sat down","useful":0,"cool":0},"FcgSYm5HF6T7IbaSXF7oFQ":{"text":"Awful service. Cook coughing all over the kitchen. Didn't wash hands. Cashier couldn't ope","useful":1,"cool":1},"W1VIBV8L_96CYSdedpRYBQ":{"text":"Worst waffle house in America. Seriously, someone should make a documentary about the dysf","useful":2,"cool":1},"CFgz_MYTvobkhNgwonxMCQ":{"text":"A friend and I went in for an All Star breakfast. We were served by Rae.  The food was pro","useful":1,"cool":0},"1H4gKNR-cerVG2e-MCDLBg":{"text":"Waffle houses like Cracker Barrels are better on the road than they are in the city. The k","useful":4,"cool":0},"Pv8Bu_8THiHcj9U7lRGS8A":{"text":"This is the worst service at Waffle House I have ever experienced. We've been sitting here","useful":0,"cool":0},"Eklb4XRvh8G_m6q__5IPYw":{"text":"It's Waffle House ladies and gentlemen. You don't go there expecting amazing food, clean r","useful":8,"cool":7},"flzmUHQfMrvlS1A-FrGdtw":{"text":"Ok ok.  I read about 10 reviews and im gonna have to say some of these reviews were probab","useful":0,"cool":0},"XdfZ_wboVk6WKfN3xL_RJg":{"text":"I would rather take a rusty spoon and gouge out my own eyes and eat them than try to eat a","useful":3,"cool":1},"hPrdjZ-qwYtb9k-7lUj5cg":{"text":"Tried this place again,  it had been a while.  Waited just over 11 minutes for a waitress ","useful":1,"cool":0},"-1Rn9KY57gg2y1Mqy6YjQg":{"text":"Service was very slow and less than friendly. Mustard was old. Out of chili and gravy. Goo","useful":0,"cool":0},"oYKf4gQuwrllmcdk1PM62A":{"text":"Food was good. Service was good but interesting. Staff gave that southern hospitality. I g","useful":0,"cool":0},"zzy9WPB5EyOgxGiFJHrRPw":{"text":"Just horrible . They were arguing the whole time we sat there. It took about 10 min before","useful":0,"cool":0},"0az3wxuKcdi3dMQVLcL6mQ":{"text":"This is your typical greasy spoon chain restaurant that is best served just after massive ","useful":17,"cool":12},"fWWfqmTvyYqx6b-BGYrEIw":{"text":"The wait time in here after the club was HORRENDOUS!!! I'm sure we waited an hour for 2 sa","useful":6,"cool":4},"PxVgYNJEyiSZfGhTpocOHw":{"text":"I've been to this restaurant twice and both times I've had a horrible experience. On one o","useful":1,"cool":0},"v6Rdl_OLTw_ha8FrvOg0XA":{"text":"Don't go to this place ever. It's dirty, tables aren't cleaned and staff doesn't care abou","useful":0,"cool":0},"AiLpWy__9lSBiV0H1TezMg":{"text":"Worst waffle I've ever been to. We sat there for 20 minutes and no one even took our order","useful":0,"cool":0},"GoU4SwdwSvFqaH7o7H-avw":{"text":"Just went and again they are out of several food choices, again.  I guess at some point I ","useful":1,"cool":1},"DmaZTIuh_-X3J5ASIw9xkQ":{"text":"Waffle Houses are usually bad. This one is the worst. Staff sucks.\n\nJust sat in here for 3","useful":2,"cool":1},"w4XZCUqcvOX3P40D5nxpAw":{"text":"AVOID. Avoid this location. They employees here do not care. We waited at least 8 min for ","useful":0,"cool":0},"ga_4Sb9KLLUr2T5Oap3Y2A":{"text":"This place is filthy, with terrible service. They don't answer the phone for takeout, don'","useful":0,"cool":0},"BcX4CX8kQ_vpD5qVVQqNAw":{"text":"Just left there everything was delicious my only pet peeve was that i made an order to go ","useful":2,"cool":0},"Hpooa4cqjQ5u83DNdcJZZw":{"text":"Absolutely awful, never had high expectations but I have never walked out of any eatery be","useful":0,"cool":0},"qals08SjrYXhNTyuGtlbpw":{"text":"they said they were taking a 30 minute break at 7:30 just to clean up... i have never hear","useful":0,"cool":0},"AZyrUcF39f5x-ndAzPxYBQ":{"text":"We waited about 30 mins for our ham & sausage we ordered. About time we finally got our me","useful":0,"cool":0},"E0-YQhlke5RcAW_aju6gaA":{"text":"This is literally the worst Waffle House ever.\n\nAs an avid Waffle House fan, I get that th","useful":1,"cool":0},"6r2P_t60Ne1g91d-DcOJYw":{"text":"Typical Waffle House as far as the menu goes . Cups were dirty.. table was dirty .. but fo","useful":2,"cool":0},"oJNng9nAnWFlWMZDVwsywg":{"text":"Ill give it 3 stars partly bc I was petty buzzed up after a fun Mardi Gras parade, and eve","useful":1,"cool":0},"coif_deIlr64aq0xS3hqhg":{"text":"Listen, I didn't have very high expectations when I walked in the door. It doesn't exactly","useful":3,"cool":0},"RxPYLmk6sI7Q4GqVGaWKrA":{"text":"Everything is sticky, the food is all greasy and the employees act like they don't want to","useful":0,"cool":0},"Ql_HTTpLzhbt0XjfW4L5Cw":{"text":"Wow. It's been a long, long time since I gave a one star rating. In addition, I lovelovelo","useful":5,"cool":3},"TDmPc712RRZgZ6QKLk9SvQ":{"text":"Worst place I've ever been. Horrible service (more like no service at all). Asked for our ","useful":0,"cool":0},"evfbMOF-AJPdLeMZ6Jiyiw":{"text":"The worst experience ever.  The manager, Charlie, was very unprofessional yelling at the s","useful":1,"cool":0},"vXzwjNwQ0iZVQbQ9PIuruQ":{"text":"This location is the closest WH to the Quarter so I'm sure they get lots of rowdy customer","useful":4,"cool":5},"fvLx3pRkq5QaCSRwHb9PHg":{"text":"Before turning in for drill training tomorrow, I decided to stop in for a quick bite to ea","useful":0,"cool":1},"9DnDGHwXHl9Bo2GG5QCFtg":{"text":"My friends and I visited on last weekend from out of town. It took over 20 minutes to get ","useful":0,"cool":0},"IZdZTIjq6vLfU_l-R6Sk0Q":{"text":"Another WH for me to review and honestly I thought it was great but I'm a good ol boy from","useful":7,"cool":7},"wK1JLO1Dho1GO9TW5hqxjQ":{"text":"Can I give this place a ZERO!? OMG! Came there and with only 2 customers inside excluding ","useful":0,"cool":0},"7jL7Og9Z5RBeGksZOPty2g":{"text":"Never knew Waffle House could taste bad but his one was horrible. I didn't even get a wate","useful":0,"cool":0},"Ewz6tJW9F_IAeSYgZQSOvA":{"text":"We like to bring our kids here to eat. It's affordable and fast. The staff are always and ","useful":1,"cool":0}}