{"H9ePXzTaaglUQqwIhznbIg":{"text":"We needed a place to stay in New Orleans, and that's indeed what this was. The hotel is ol","useful":0,"cool":0},"T21oQiJnGXh-wrAd4_Y1Dw":{"text":"An excellent hotel both close enough and far enough from the French Quarter. The staff was","useful":2,"cool":0},"YKeCfynH8WTRtqmgqc7jMQ":{"text":"I'm going to write this as a public service announcement.  If you are in a situation where","useful":3,"cool":1},"hvL1_6sXEf7asSjfwrnb7w":{"text":"Yes I am a fan of the Parc St. Charles.  This is my go-to place to stay whenever in NOLA. ","useful":3,"cool":0},"2BUahWlYSj11JyRtkMf-xw":{"text":"Great for the price. The location is clutch as it's a few blocks from the French Quarter a","useful":0,"cool":0},"IQXa_qwIRJAhgr55FppLJg":{"text":"I don't understand why there are so many negative reviews of the hotel online.\n\nPros:\n-It'","useful":0,"cool":0},"qWnl-WeO9YMYYGwYoS_0hg":{"text":"I actually enjoyed the room and amenities of the hotel and its location, close enough to w","useful":0,"cool":0},"-dCAzVHKmORKFUuDLXlI2Q":{"text":"No Frills here. But hey! You're in NOLA baby!! Location, Location, Location!! This place h","useful":0,"cool":0},"eMcJTP-qD_wqXCC4vtJ4hQ":{"text":"Stayed here for a night and had a perfectly meh experience.  The hotel was under renovatio","useful":0,"cool":0},"H_-ZHeErXIwHeOsdO6P-Ww":{"text":"There are holes in the walls above our beds, wallpaper is falling away and the ceiling loo","useful":0,"cool":0},"5-68SJ4iqiLKLUVUmp6QBA":{"text":"If you are in New Orleans, you need to be out and about & not hanging out in your hotel ro","useful":1,"cool":1},"pRCKySUpJihepdpECKCKiA":{"text":"I am staying at Parc St. Charles. I was told by three different people that this hotel is ","useful":1,"cool":0},"U0SK-1sd5i6KRZoRZ9wK1w":{"text":"I flew into New Orleans, back after way too many years. I had earlier booked a room at the","useful":0,"cool":0},"IKvvN9pkA7C6mC_D52uZ2g":{"text":"This place is awesome.  The location is perfect and so is the price.  I was able to grab t","useful":0,"cool":0},"9hJeHzje0vyq8iTyqktTBg":{"text":"I was a little hesitant about this hotel because of the negative reviews on Trip Advisor a","useful":1,"cool":0},"AbydduhPTjzTfWSaKJOL9w":{"text":"What a great hotel! It's a little bit older, and smaller but that only works to this hotel","useful":0,"cool":0},"p7V9Qf9QujsnKSsgk4mttA":{"text":"The price was great cause of Hotels.com and I must say, aside from the parking sucking, li","useful":0,"cool":0},"mDHsXGcv9DeM5bXZZqnHww":{"text":"The Parc St. Charles is a nice, quiet, inexpensive hotel a few blocks from both the French","useful":0,"cool":0},"7BdJ2sHXGkW_MwOcvUmt9g":{"text":"Considering some of the dumps that I stayed at on our cross country road trip, Parc St. Ch","useful":1,"cool":2},"xrsS_WdALEqYi9MPYjaLYQ":{"text":"I have never been to a nicer hotel for the price I paid.  On time service, clean, quiet, v","useful":1,"cool":0},"d3738A158QXRFuvZniK4TA":{"text":"The room was nice and the view was great.  Plus it was a great location to be just outside","useful":0,"cool":0},"oGvpjIm5xCSkWe8bdHyTCw":{"text":"Booked a room here on our phone on the way to the city. Price was certainly right for a ro","useful":1,"cool":0},"7HaAC0CMezOm6JKz-qQkoQ":{"text":"I would definitely stay at this hotel again if I were to hypothetically stay in New Orlean","useful":0,"cool":0},"AFPczKNMp1dcglViPb1HuA":{"text":"I booked a one-night stay here so that I could spend some down time in the Big Easy before","useful":0,"cool":0}}