{"ErlfF35OxvH_MUNMfu7bRQ":{"text":"In love with this hole in the wall. Def must get some of the biscuits. They're huge!!!","useful":0,"cool":0},"rhIVwk44m-huCGXi3r0woQ":{"text":"Apple Goat Cheese King Cake. Oh my gosh. Seriously. Absolutely fantastic. \n\nI came in with","useful":1,"cool":0},"EsPjoH-7r4DJT7O5h8lgNA":{"text":"We came on a Saturday brunch/lunch and there was a small line that reached out the door. B","useful":12,"cool":11},"Ott1reEc_RwE2sz7a6EttA":{"text":"Amazing staff and attention to customer service.  The food is equal in measure.  Highly re","useful":0,"cool":0},"QiMoyc6JkCUalVHJo2mgcA":{"text":"Stumbled on this place looking for the sax player we could hear from down the street. The ","useful":1,"cool":0},"rt7mQ-2WdbCgDPYP_LGZZQ":{"text":"This is as good as it gets for a corner eatery. We love eating here and enjoying the fresh","useful":0,"cool":0},"zXIVkMxehrctj4yt_65mcQ":{"text":"Had Boudin, grits and eggs. My Cajun friend introduced me to Boudin although I do not want","useful":2,"cool":0},"ROA419-ck4nBWKQHtlGnyg":{"text":"I don't think I've been this excited by a sandwich since the one I had at Stein's back in ","useful":12,"cool":10},"wUw6OTC8H-_yaoN1poyDkQ":{"text":"This little Hole in the wall is an excellent brunch place! You get a cupcake for $1 with e","useful":0,"cool":0},"PmjAB4STkBHoBrSP35sw4g":{"text":"Great food and I love how it's located in Marigny neighborhood far from the tourist crowd!","useful":1,"cool":0},"yiQ_gMD--ZhQceapzLEZGw":{"text":"Highly recommend this place for flavor and quality of food! Go... get any meal. And the  $","useful":0,"cool":0},"seURLNpyKEPoK5HfKE2KWg":{"text":"We try to go here for breakfast when we are in NOLA.  Awesome!  Their bakery goods are won","useful":0,"cool":0},"sFS2EoEEFN-MCRD9Y7zXuA":{"text":"This place was great. I had a local crab and spinach omelette which was delicious and half","useful":1,"cool":0},"MmdVfsiuri7kRCpFDxs43g":{"text":"Stayed in the Marigny for Jazzfest and tried a different breakfast place almost every day ","useful":0,"cool":0},"qQ6JrzFS_cuHzpx5o51PVA":{"text":"Saw the good reviews and decided to take a walk from the French Quarter for some breakfast","useful":0,"cool":1},"7crmtzTckeH9XnNpvze1Aw":{"text":"Pretty good spot. Ultra-casual and locally hip.  Service was excellent.  Those folks bust ","useful":1,"cool":1},"vGYhUvu3I3VfSbKlYlW4Qw":{"text":"While I love just about everything from Cake Cafe, this review is about their cakes. The p","useful":2,"cool":1},"EzhqDr7RSnd56FgswFkyjQ":{"text":"this is my go to place in the mornings \nand they are now serving french truck coffee come ","useful":1,"cool":1},"FAMPvsWTAqFRXigvjaQs8g":{"text":"Found this place very Yelp during a visit to New Orleans.  It was a few minutes walk from ","useful":0,"cool":0},"yJfNhqha52luKg9Pai2s-Q":{"text":"The menu always sounds so delicious but it's never executed well. Everything just always n","useful":0,"cool":0},"tTrRsCGxh9jCLduNM67ujg":{"text":"Nice and super friendly! The pastries are excellent and the food is good. Don't miss this ","useful":0,"cool":0},"u2_XoWBkJ3L-_0mGkMdEsw":{"text":"Kitchen closes at 245. I got there at 215. Ordered. Received my cold food. Did not enjoy s","useful":2,"cool":1},"SD2NUodAkptUf89nbIis1A":{"text":"Nice place with amazing coffee and good food. Was our morning fuel when we were spending o","useful":1,"cool":0},"QfMHWujiJehOJ-pLsTvczw":{"text":"I'm obsessed with this place. and that's putting it mildly. I have a thing for breakfast s","useful":4,"cool":2},"-zbD8Rf9UOciaU0ln-vVgg":{"text":"Damn!  I picked this place because of the fabulous reviews on Yelp, but I guess it depends","useful":3,"cool":0},"Irxl1md4Uix_Bwl75iJYJg":{"text":"This is a must stop.  I had the corn beef hash.  Nice big chunks of meat and not too salty","useful":0,"cool":0},"1DhugqqxGa7d4gTdfmUZeA":{"text":"What a gem, this is where all the locals go.  \n\nWe enjoyed an order of shrimp and grits wi","useful":0,"cool":1},"_rF7vITg6i18gudDmEfN1g":{"text":"Such good food and love the artwork in here! \nWe had the shrimp and grits and the corn bee","useful":1,"cool":1},"xTJFONt1omhyNkn6WH_zrQ":{"text":"We had breakfast here twice in our short trip to New Orleans! On the first day I had a fla","useful":0,"cool":0},"yFaETMtq5KwazBpdEybQhQ":{"text":"After reading the reviews about this place, I was ready to love every bite of the pastries","useful":0,"cool":0},"L78CQp6MDRdib748gFqKxw":{"text":"Sure, the cupcakes are crazy good, and the king cake is just perfect, but don't miss the c","useful":2,"cool":2},"oR8V7elm1dSlVJKyvjPZPA":{"text":"Some locals told us about this place close to Frenchmen St. It happened to be right across","useful":0,"cool":0},"P2p00YrdPATqA0IsBwVg4w":{"text":"My friends brought over a cake from this place and it was amazing!  Highly recommended!!","useful":0,"cool":0},"8X9oTYSt9QaUyofrvQAmxw":{"text":"Cake Cafe cupcakes are in their own category. This place will make any cupcake hater conve","useful":0,"cool":0},"-3FPGLqcqKbrAQx4Un4qLQ":{"text":"There's much more to New Orleans food than the French Quarter, and New Orleans Cake Café p","useful":7,"cool":7},"tlGaZpeNZh0z0P2CoXP88Q":{"text":"I tried this place for lunch with my boyfriend. This is probably the best local brunch caf","useful":4,"cool":3},"kokbrKG1MV9mRZWix4N12g":{"text":"Wow.  We found a photo of this woman pouring icing over these fabulous looking cinnamon ro","useful":1,"cool":0},"tpc3j3x7IuGhnW2LfXTR0Q":{"text":"Yum!!! We are here two of our three breakfasts!! Rented mopeds to get back over there the ","useful":0,"cool":0},"KtXMcyu9H3Ggqb3ogVilkw":{"text":"Best food I had on my New Orleans vacation. Most delicious French toast I've ever had and ","useful":0,"cool":0},"iIM4yckjEdYjizq_jWgO8w":{"text":"our  favorite breakfast spot. We are regulars and go almost every weekend. Super sweet sta","useful":1,"cool":0},"twbxgmMDNvHv9mofMoe0Ng":{"text":"This spot is the truth! We had a group of 6 for breakfast and they accommodated us with no","useful":0,"cool":0},"d8sR7aD21u6OuYUkxnnFPg":{"text":"Cake Cafe is the best! From the pasteries, to the breakfast and lunch options to the servi","useful":2,"cool":0},"EEq4T1dcemgbP5ySM8Iq0w":{"text":"Cafe Cake & Bakery is a cute little corner cafe in a quiet neighborhood not far from Bourb","useful":0,"cool":0},"2zXQ3YY97nSLzEpdeu1oVw":{"text":"De-lish should be the name of this place. \n\nFor me, I LOOOOOOOOOOOVE the Marigny, so maybe","useful":5,"cool":4},"Me5cmv_rb7bz_hronJKdkw":{"text":"I am a boudin snob and search high and low for boudin in this city as good as boudin in ca","useful":2,"cool":0},"fz_vC48uyrwhpZXc_BBMZw":{"text":"We decided to go out for breakfast, since everybody told us how great the brunch scene is ","useful":0,"cool":0},"IU1-Hk9xja94b3UsX69TDw":{"text":"Awesome. My boyfriend and I were from out of town and we were having an interesting time t","useful":0,"cool":0},"n36hJ4PoEpkEEc660fhRFA":{"text":"Shockingly delicious tofu scramble. (Not actually a scramble, but cubed firm tofu.) Outdoo","useful":0,"cool":0},"01ieX4fyMQ4PNUZdrM36fA":{"text":"Yes yes yes! \nLovely little spot tucked in a sweet little hood! \nThe staff were lovely and","useful":0,"cool":1},"XWsTy-ciwcZsKsnYnZE-WA":{"text":"The Crab Omelette was not great, too fishy for my taste buds. I chose not to eat it and le","useful":1,"cool":1},"sViO12BJ3mtTqS6wkzupog":{"text":"I rode my bike down to the bywater on Sunday morning with a couple of friends and my husba","useful":0,"cool":0},"A_cztw4bAoSL4P2f81V3Mw":{"text":"Always a bit of a wait.  But usually the line goes quickly.  And the food is great.  Fresh","useful":2,"cool":0},"3but7IwSX7QVG7qv-TH6vQ":{"text":"Absolutely love the place and love the staff that works here. The food is great, the baked","useful":2,"cool":1},"8pRt6zBsySZvjcsUSgq8vw":{"text":"The Cake Café was phenomenal. We went here for 2 of our breakfasts the weekend we visited.","useful":1,"cool":0},"33et1On9nwS-dSRZRS5xbA":{"text":"So good that we came here twice on our trip. Pulled pork to die for. Outstanding cupcakes.","useful":0,"cool":0},"ZBHDj-6_TaGbhRSM2tqXwQ":{"text":"Delicious fresh breakfast! The place isn't very large so it can get crowded fast. I can't ","useful":0,"cool":0},"L1zi8z5QcYlURT4v78T7KA":{"text":"First of all: major shout out to the cashier/front-of-house employee. I can't remember his","useful":1,"cool":1},"XMHz6U-yT6elUit-leQWRQ":{"text":"mmmmmm Perfectly fried cornmeal crusted catfish and delicious grits with who knows how man","useful":1,"cool":0},"mP5w5P9wkbY7mflx1YDusA":{"text":"We stopped in this morning for a quick bite to eat.  Ordered a few biscuits with a side of","useful":0,"cool":0},"MgtyYj3iVwc7uM0PysM2lg":{"text":"Eats: strawberry deliciousness pastry, ham and cheese stuffed croissant\n\nDrinks: cucumber ","useful":1,"cool":0},"7eRJwcw0emf4EabSK4pDKQ":{"text":"Friendly and welcoming staff.  Love their locks & bagel and their red velvet cupcakes are ","useful":0,"cool":0},"m69hGqYXyn2RZM_Sl7-ciQ":{"text":"Nice little breakfast spot in Marigny! I stayed at an AirBnB right around the corner and w","useful":0,"cool":0},"YEOKL9FMrtWRBIIt2lp2Ug":{"text":"Cake Cafe never falls short of excellent.\n\nGreat coffee, friendly staff, and bakery goods ","useful":2,"cool":1},"F8QJPz7WEqt4J37BP2WoQQ":{"text":"Amazing pastries. We enjoyed the artwork and the low-key atmosphere. We all had breakfast ","useful":0,"cool":0},"oLZTKf3Ao7srulwc-89ogg":{"text":"So far this season we are 9 king cakes in and the apple goat cheese has been the hands dow","useful":0,"cool":0},"HOswuI08q9-t1NJeK-H57w":{"text":"Great service. I have has the most delicious donut in the city of New Orleans from this ba","useful":0,"cool":2},"vcZ7nebZOoWaldSxW3VFvg":{"text":"$1 for a cupcake added to your meal?\nYES PLEASE!! \n\nMy mouth is seriously salivating befor","useful":1,"cool":0},"DBzNodN1OQLK20uktkfHXA":{"text":"Came here on a Friday morning because it was close by and I was pleasantly surprised.  My ","useful":2,"cool":1},"UxHn04cZgJYXs8qc5KZrbg":{"text":"They have excellent bagels. I have been on the hunt for a decent one since leaving New Yor","useful":2,"cool":1},"kp6RjNO7lIy9V3Y5W41DKg":{"text":"Awesome little place with great food and great service. Breakfast was delicious with fresh","useful":0,"cool":0},"MusBPBkFX3BBcwF94KtFDg":{"text":"Holy cow - this is a really good breakfast spot!  It's busy, so if you want a waiter/ess w","useful":1,"cool":0},"QRg2pdsEJCZvrNx2L0Df-Q":{"text":"Love this place. ESP the shrimp and grits! The goodies are delicious too.","useful":0,"cool":0},"LK1-nIosKKabu2YlsnsW0Q":{"text":"OMG, visiting from Tampa, stayed with a friend down the street from this \"GEM\" we absolute","useful":0,"cool":0},"DP5caon-MA_4Wg1BS4Iu_A":{"text":"It seems a pleasant neighborhood spot. Maybe best for coffee and pastries. Our hot breakfa","useful":0,"cool":0},"Ivg6ZVxvu9F4yecaOzFVWg":{"text":"Wonderful shrimp and grits, juicy fried oysters,  tasty sausage gravy, and huge biscuits. ","useful":0,"cool":0},"R5utXuVrlegZ8lqHIsYY7A":{"text":"Your local diner that is just around the corner. You can't get a more local, authentic NOL","useful":0,"cool":0},"nW14wPUjK959qNSYd6WDyw":{"text":"I love this place! We try to eat breakfast here at least once every time we come in town. ","useful":1,"cool":0},"3BcCOdF8na8uW9SfRmFlBQ":{"text":"grabbed brunch here with friends this a.m.  tables inside were full so we sat outside.  pr","useful":1,"cool":1},"SLivGPkgVbdNWOaEOVjlKg":{"text":"I like to think of this place as more bakery than restaurant. Come here to satisfy all you","useful":2,"cool":1},"Rzzid-RIuOFyI0C6AoEMQA":{"text":"This my go to place when i feel like having breakfast! Awesome food. Friendly people. My f","useful":0,"cool":0},"SAb1_GBribUaVxKuGuJxLg":{"text":"I don't get the raving reviews for this place. The food was solid, but the most impressive","useful":0,"cool":0},"PO_M12xdvVakmVqGWPGxAg":{"text":"New Orleans Café and Bakery is truly a neighborhood gem in Marigny district, a few minutes","useful":4,"cool":3},"oTx0iUNW0XjGEErZu7UnCw":{"text":"We used to live in New Orleans and when going back for a week, we didn't want to feel like","useful":1,"cool":0},"IrFRLd_EL5D895g2kyxbwQ":{"text":"Come here if you appreciate  quality.  Absolutely delicious food,  incredible hospitality.","useful":2,"cool":0},"hARqOM5P9x256nktZg5oFw":{"text":"Oh happy day! Cake Cafe is now OPEN ON MONDAYS! Please disregard my earlier warnings about","useful":4,"cool":0},"TEzTjZgOzLSptGpry8Yo4w":{"text":"We had a great breakfast there. Very local and down to earth, baked goods and full breakfa","useful":0,"cool":0},"294HYI3t-FI_CvnqzmdYpQ":{"text":"Um, yum.\n\nDelish King cake and brekkie items in this Marigny hot spot.","useful":0,"cool":0},"xxA3u4X8PX9rJO-7jgU5LQ":{"text":"Great place in an adorable neighborhood, I love Cake Cafe!  Food is fabulous, made with fr","useful":0,"cool":0},"LbPYRPi3dW-xGGG-r9sdrg":{"text":"Love this place so much!! Great service, amazing food, good iced coffee, and a home-like a","useful":0,"cool":0},"S_Fb56YB1jw1ShIwoWWptg":{"text":"Hands down my favorite Marigny breakfast joint. \n\nIf you can hold off on the scrumptious c","useful":2,"cool":2},"KU49KQOrJpjF22HvJa0gaw":{"text":"Coffee is good and the pastries look fabulous. \n\nFood is mediocre. Got the bagel with lox.","useful":0,"cool":0},"EBdAvJ-m1yFh_01WpGpgbA":{"text":"You order at the counter then they bring it out to you. People are very nice. The food was","useful":1,"cool":0},"s5aWJpFq5rnQfcv8s8FOVw":{"text":"Recommended by a former local and so glad we came! Shrimp and grits were out of this world","useful":0,"cool":0},"lKNi4rWhbMkRdFwlqlyG-w":{"text":"Plenty of crab in the crab sandwich. Also got to see a large German Shepard in a sidecar o","useful":0,"cool":0},"u1TWiUyQFdpOh0P79iVKQA":{"text":"Hot damn my girlfriend loved her birthday cake -- a 9\" White Wedding Cake with Almond Butt","useful":0,"cool":0},"hbHYybdFj5d-czb9jIetpQ":{"text":"I absolutely adored this place! Got the recommendation from a friend before visiting for t","useful":1,"cool":1},"0RSSaFh_imBYiRcJ6cn2Kg":{"text":"Yummmm!!  I used to frequent the Cake Cafe when I was living in a van down by the river. N","useful":2,"cool":0},"aORS3mtTJfyk_ZRqOGz0Bw":{"text":"Tasty and refreshing teas, amazing muffin, nice environment, unpretentious! Super cozy!","useful":0,"cool":0},"SIhQROvoae61mdWy_h9iOA":{"text":"I loved the biscuits!!! I ate an omelette with ham and it was made perfect. This restauran","useful":0,"cool":0},"s2O9s24XTq6qOTvMVQZJig":{"text":"Meh.\n\nI know this is blasphemy, but I just wasn't that impressed.  \n\nMaybe it's because I ","useful":4,"cool":1},"lY0lgWAetznIchXbm4-uGQ":{"text":"I love that it's out of the super-touristy area and clearly loved by the locals--one of wh","useful":0,"cool":0},"jq9nopRviWPT226cAMjlTQ":{"text":"I absolutely adore this place! Delicious? Check. Great service?? Check. We don't eat there","useful":0,"cool":0},"OJezHLzbzVlj2aMUjH44Ug":{"text":"Visited the NOLA area and saw this rating.  Went on  Saturday morning, and it was everythi","useful":1,"cool":0},"Coi6eQZ7i_19cSJ4xRPZ4w":{"text":"I love everything about this cafe, its unassuming location, the pleasant, helpful staff, a","useful":5,"cool":5},"g_VCMFs-5Us5bnkUQGK0-Q":{"text":"This was the best breakfast i've had in New Orleans. The grits and eggs were perfect and I","useful":0,"cool":0},"zlLv56GZFYVlHEgye5giYw":{"text":"The cupcakes are awesome!!! The waiters and waitresses were very helpful. The eggs and bou","useful":0,"cool":0},"A4dassAzzP5CqfgfhWQC5A":{"text":"Hands-down amazing vibe and eats. Do not miss the fried potato salad or the mushroom gravy","useful":0,"cool":0},"Qwghv1qBlFHxaSC1gzOmJg":{"text":"Their boudin is to die for!!! Eggs and grits were on point too. Loved the Chickory coffee.","useful":3,"cool":1},"G0xat6YFZZdnbHrvC6UlxA":{"text":"I am a shrimp and grits newbie -- I'm from Canada -- but that was sooooooooo good. Friendl","useful":0,"cool":0},"FBExhqzWqgk-XCjd_2fndQ":{"text":"This is one of my favorite breakfast spots in Nola and I make sure to come here whenever I","useful":1,"cool":1},"obvJeUmNrJ19FxjC6m_Piw":{"text":"This place is consistently quality. Amazing, fresh bagels, extreme croissants, delicious s","useful":2,"cool":1},"MQ5dN80Jhu4SnpVqaZiJIA":{"text":"We came here on a daily basis during our most recent stay in NOLA. It was right up the str","useful":1,"cool":1},"9fPTyHNQRMA4EQlboQYlvA":{"text":"We had a great breakfast. The biscuits were light and fluffy. The grits creamy. The boudin","useful":1,"cool":0},"eI8mahqvIIF8tvtLlcLfOA":{"text":"Amazing breakfast, but make sure to get here early unless you want to wait.   We went arou","useful":0,"cool":0},"ezV-71WCYoCHMY1TMYshqA":{"text":"I never know whether to eat cupcakes or breakfast when I'm here, but I guess that's a grea","useful":2,"cool":0},"8ZtBK8R3Usvl8haut8oX0Q":{"text":"It's a bakery! It's a cafe!  If you're lucky enough to get a table, it's game on. Cozy, ca","useful":1,"cool":0},"Doqj4nhC-1gFqqTrIDCG5Q":{"text":"Wonderful breakfast.  I had the everything bagel with egg, cheese and bacon. My aunt order","useful":1,"cool":0},"Pie1ZNz5rXMIM7mrlqCJPg":{"text":"Seriously the best breakfast sandwich I've ever had....I bet I could've eaten two more. In","useful":0,"cool":0},"9oiWIUgIDIhpWpGHandsjg":{"text":"Thanks again, yelpers! The food here is awesome. It's a tiny little place located in the M","useful":2,"cool":0},"BcbDRoGPwhwGNTCjDNknSw":{"text":"So we have been all over New Orleans for food, had great meals... but this was over the to","useful":0,"cool":0},"GlacIt2arkgzVhh6Q2Z50g":{"text":"Food is excellent. Sit outside and enjoy the beautiful neighborhood. Friendly but counter ","useful":0,"cool":0},"OzvnwCPEBctUCa00KP006Q":{"text":"This place is good!  It was PACKED when we went for lunch so others apparently enjoy it a ","useful":2,"cool":0},"GRdVs6_HlwQlWhGIhMVtHQ":{"text":"Really good local place with a easy to understand menu and awesome choices. I got the corn","useful":1,"cool":0},"v0k1dJQ7wSED8qzN3oQEhg":{"text":"When a place is packed even on a stormy day that means you have something special waiting ","useful":3,"cool":1},"G4-vWWddUGfmZhg8zZ2rqw":{"text":"04 July 2016\n\nCame here around 9am for breakfast. Girlfriend and I were pretty hungry (had","useful":0,"cool":0},"K-6pLCVhDZWfgaEVIvb-7w":{"text":"My favorite Bywater/Marigny restaurant! No complaints at all. Maybe I'm just lucky but for","useful":1,"cool":0},"0fqUWtlhYCXySZRoDjczkQ":{"text":"Great shrimp and grits.  Some of the shrimp I've had in NOLA taste like they still have so","useful":0,"cool":0},"CLJ0OC9GwWzFCwiUjL2yvA":{"text":"The friendlies service, delicious breakfast, and super king personnel (even gave me some b","useful":1,"cool":0},"OmG1W7JL5fUjAXfiLTPnGw":{"text":"We came on a Sunday and it was packed. Great service (though they did overly charged or ti","useful":0,"cool":0},"eRnfVJ6jW_AdCQcDb4dEPQ":{"text":"Very cozy place away from the huzzle of the French Quarter. I had the Costa Rican Breakfas","useful":0,"cool":0},"uzVQ69zdHpiXCo_e_BIL6Q":{"text":"We've visited NOLA twice in the last six months. And breakfast has become my quest. Three ","useful":1,"cool":0},"P1OSSzNic42lgh0LPXvCGQ":{"text":"If I were restricted to a one-word review the word would be \"delightful\".  There really is","useful":0,"cool":0},"xBbu_bC35j0U1S-y8DQbLw":{"text":"Okay, this place is amazing. We went here for breakfast every morning we possibly could. T","useful":0,"cool":0},"egTT1dLYdxEu5Wc4ccJM-g":{"text":"It was a bit of a rough morning after the first night of a bachelor party I was down here ","useful":0,"cool":0},"0E2CzEQ6hz6hTdiBC-RFPQ":{"text":"I found this little gem the last time I went to New Orleans and if it is possible it was b","useful":0,"cool":0},"ICqkyMows57Hf8igSFJ-IA":{"text":"I'm a huge breakfast person and this was my favorite meal while in New Orleans! This was d","useful":0,"cool":0},"x0aoMTcfLwE9Qw9m0Y8mxg":{"text":"Really great little spot. Line is often out the door but it moves along. Someone will get ","useful":1,"cool":0},"W4cRx5llH8GLHIiVMfIoQw":{"text":"Always great, Great Food, Great People, Great service. A real pleasure always. Best Shrimp","useful":1,"cool":0},"4FundlpLE1Q_TK39w79FeA":{"text":"My new favorite spot. Super casual and everyone is chill. I could live on thier  breakfast","useful":1,"cool":0},"MI5F4z9rU28TtZwfkBfrZA":{"text":"Try the Corner Beef Hash special. Not done the traditional way. Big chunks of lean Corned ","useful":0,"cool":0},"uvdAAbh4nPfeFRyR32LX4A":{"text":"This restaurant is a must try when in New Orleans. Home made biscuits & cupcakes are fanta","useful":0,"cool":0},"TcmStnfB8rdYmNfcOmHruQ":{"text":"Delicious cozy spot with super friendly staff. The crab sandwich is life changing! Lots of","useful":1,"cool":1},"uGTTqGz9xB54yxqtm1cz8A":{"text":"LOVE THIS PLACE. Except during peak hours... I hate waiting in line with asshats from out ","useful":2,"cool":1},"FG7uyBqBHdAzbOp8UQBYHw":{"text":"I visited this awesome Brunch Spot for the first time on yesterday 6/10/2018. Let's just s","useful":1,"cool":0},"T3dftoX9rt0wqoSfYUU5Pg":{"text":"I called this place to order a cake 48 hours before I needed it. Was told the baker was ou","useful":0,"cool":1},"Zk5eU50568_JCAeWFPaSmg":{"text":"Extremely good baked goods from here. I had a Boston creme one morning and it was outstand","useful":1,"cool":0},"503zWZLS0CWNLaGcQfVJpA":{"text":"WOW!  It's so nice to get out of the French Quarter and find such great places like New Or","useful":2,"cool":0},"xTnQsxknZhcXLZRNL3lzvw":{"text":"Best breakfast ever. I don't even remember having breakfast before, that's how good it was","useful":0,"cool":1},"keP7cT4wBbANuFEf3mzeKA":{"text":"Ordered my king cake from Cake Cafe. I got the apple and goat cheese cake...obviously. It ","useful":1,"cool":0},"EhuX5m8L-ozh2RD4KcaGBw":{"text":"Cute little breakfast spot. $6.50 for a sizable breakfast sando + coffee. Preferred the sa","useful":2,"cool":3},"SsO9HnJDE1dMzYQtj7EpRg":{"text":"Stopped here while visiting New Orleans and instantly became one of my all time favorite b","useful":0,"cool":0},"CU-4EorDFm8-NVOWxDMjQA":{"text":"After trying their apple and goat cheese king cake I will definitely be back to try more t","useful":0,"cool":0},"FgSCPn9oRHmUaqe0tpxOZQ":{"text":"I stopped here on a lurch.  And way so blown away, I came back the second day. The fried p","useful":3,"cool":2},"g2UaItE8UCQIOcZsx6Pn0w":{"text":"Yum! A friend told me to come here on my trip to New Orleans. It's a little out of the way","useful":0,"cool":0},"4ARcKNO4aJyvhwYUH3gZCw":{"text":"Okay place, very weak coffee, mediocre bagels.  Friendly service.","useful":0,"cool":0},"eudyH78uusNZYJ9pkXqULQ":{"text":"The person behind the counter was rude and wasn't very helpful and the deserts weren't any","useful":0,"cool":0},"CZ4sZRTf0PTMTFHmQFIqSQ":{"text":"For a neighborhood brunch place, this place is AMAZING!\n\nEverything we had there was delic","useful":2,"cool":1},"nEzornQ07XLWa8LrLb895w":{"text":"Love this place for breakfast. We go every couple of weeks. Friendly service and delicious","useful":0,"cool":1},"1M1NaQevM3-O9LyJYlSHrw":{"text":"Fabulous little corner cafe away from all the hustle of the tourism. The staff are super f","useful":0,"cool":0},"gx2Pwk_Ju91yiziKqENDnQ":{"text":"This is one my favorites. This restaurant is vegan/vegetarian friendly. A lot of options.\n","useful":0,"cool":0},"fQl9Hd6JnV_5KDwlMFKrAw":{"text":"Love this place for brunch! Shared food with 2 other people and everything was excellent. ","useful":3,"cool":0},"LcioQqKWsFkQkOPM1MMdnQ":{"text":"Went here the last time we were in Nola and loved it. We went this trip and were a little ","useful":1,"cool":1},"rpuw9zjgODCR4LXr3eoVcQ":{"text":"A-amazing food. A-amazing service. Prices are little high but it's totally worth it. They ","useful":0,"cool":0},"1KsncoFKD_i9KOgUu8g6xQ":{"text":"So we are back again this year and decided to come by again. This time hubby and I took ad","useful":1,"cool":0},"sFqmtbmuxrLUoF8JhYtOtg":{"text":"This was our last stop during a 24 hour stay in New Orleans. Our hotel was in the French Q","useful":3,"cool":1},"toYGkumiLPaoorHUSzFdXg":{"text":"This is a very hidden place but it is definitely worth going to. It has a very special amb","useful":0,"cool":0},"HuUVywDAOu-bjiE_1lplBw":{"text":"Heard about this place on yelp of course. We wanted to try places in Nola that were off th","useful":0,"cool":0},"rvL8sMvhCdN_pocl7pf3jA":{"text":"This place is fantastic. Being in the service industry, I tend to be hypercritical of brea","useful":0,"cool":0},"S-UcnGzp_FIWyXopyLFN-w":{"text":"Made it to this place around 7:15 on a Friday morning. There were a few people and no wait","useful":0,"cool":0},"ariQu59FCUfYnno0lTNz7A":{"text":"At one point it seemed like there was nowhere to go for an inexpensive, quick breakfast in","useful":0,"cool":1},"t2xqAbJdEbfVhIQr_JjO1w":{"text":"We absolutely love coming here for breakfast. The stuffed bagels are just great.  Full of ","useful":0,"cool":0},"ufw318mwrjSk3hXo2hGYrw":{"text":"We are in town for a few months and popped into this place this morning for breakfast and ","useful":0,"cool":0},"c8gVxxVFAiw0VHAiqasSww":{"text":"Probably my favorite breakfast/brunch spot in Nola! I also really like the location, in a ","useful":13,"cool":10},"0KLuYTSY9skUbPkOJBq0Uw":{"text":"Always delightful, the food is amazing and the staff is friendly. It's crowded, but you sh","useful":0,"cool":0},"hJqiUPl6IMpazzDokxQp0g":{"text":"This place is amazing. It's one of the best coffee and pastry shops I've been to ever. I g","useful":1,"cool":0},"Up29pdhwdyzt1oZIfpq2RA":{"text":"This is a great neighborhood spot. The food is good. Great eggs and omelettes. Good coffee","useful":0,"cool":0},"bY2t9ZN9ohOq8kNMfyjXzQ":{"text":"Great place for breakfast. The quality of food is outstanding. Try the cucumber lemonade d","useful":1,"cool":0},"92RN_cBDVm-rCEsyu_c5sg":{"text":"Loves me some Cake Cafe! Particularly breakfast. I've had a couple of lovely lunch items, ","useful":2,"cool":0},"9pLXA65y9x7IMTuz2kgB-g":{"text":"Wow!!! My 1st stop in and I decided on the cinnamon Bun. Let me start by saying OMG. Lol n","useful":1,"cool":0},"rDSi0r9NVMOIZYenjQ58Cw":{"text":"Food here is hella good, plainly put.\n\nI know this part of town is flooded with amazing pl","useful":3,"cool":0},"Yyec2RDyg0kkaPVjOQMiLA":{"text":"Great food and it was a lovely neighborhood. The biscuits were the best for their egg sand","useful":0,"cool":0},"LmZlVkSNTgLvhqLTUpdg6Q":{"text":"Nestled in a small neighborhood just outside of the Quarter is the best kept secret of New","useful":0,"cool":0},"zY9d5Us5wMOyVvcPXZYQ0w":{"text":"AMAZING!!!! It's a little awkward at first because you order at the register and you have ","useful":3,"cool":0},"Fob_V2rHzPQoBepOxFdlTw":{"text":"Best breakfast/lunch place in the Marigny! Very good good, great outdoor seating. I ate th","useful":0,"cool":0},"oKLpFP-56HgYSAfuV30ILQ":{"text":"Great find in NoLa- small, affordable, fantastic food and good service. Try out the crab o","useful":0,"cool":0},"GHbJiRYhPfbuxIExPdKbDQ":{"text":"Very very cute place. Friend and I walked in right as the place was opening. A display of ","useful":1,"cool":0},"APh7wkj60BxonUfWS9cGvg":{"text":"This is a breakfast, brunch, lunch cafe; the name of the cafe is misleading.  Order at the","useful":0,"cool":0},"-oba5ZQ04Ja2wTpdXP-Kng":{"text":"This place had hands down the best breakfast I had during our five-day trip to N.O. and ma","useful":2,"cool":0},"9-soct_WHiDjRJgMAEdpLw":{"text":"In town for Essence Festival and everywhere was a long wait...but I found this gem tucked ","useful":0,"cool":0},"X7NBZCeQzHLk1D5JmRfvMg":{"text":"Best breakfast we had this trip. My veg omelet was amazing and there are no words to descr","useful":1,"cool":0},"t05Ln6tRoMugxya0lo0xdg":{"text":"I ate here about 4 years ago. I don't remember much besides having one of the best tasting","useful":1,"cool":4},"4V4qoZ0mogGqvzaXAKBzcA":{"text":"Very pleased, first place we stopped to grab a bite to eat arriving from San Antonio. Had ","useful":0,"cool":0},"2RKkNqlmFPuQxBiKPUwkUQ":{"text":"I took my family of five looking for a great local taste of New Orleans for breakfast. I c","useful":1,"cool":0},"vJGWf5AI6Q6YJ7AK0u-HQQ":{"text":"Looking for a breakfast place on a Saturday morning?? This is definitely the place to be. ","useful":1,"cool":1},"5sR9JkHOcvWIGpyrD4KLag":{"text":"I really like Cake Cafe. I would actually give it 4 1/2 stars if it were a option. I reall","useful":1,"cool":1},"GHSqsJ5WZTItE9hl1sGptA":{"text":"The BF found New Orleans Cake Cafe & Bakery through yelp during our time in nola last week","useful":1,"cool":1},"E66H4tUlrjWHu7t1RoMsmg":{"text":"Amazing little cafe! The biscuits and gravy were to die for!! The service was amazing and ","useful":0,"cool":0},"CBXhqFiNtByN8QSJJqBKrg":{"text":"One of my favourite breakfast spots in NOLA, and I've been around the block and back for b","useful":1,"cool":1},"jblYF104tvNPIZiY-NwRmg":{"text":"I just went to this place today and it was great! The staff was amazingly friendly and the","useful":3,"cool":2},"ENhkhAWq8KYMeHA3G7dO6A":{"text":"We gathered brunch recommendations from our friends for our Mardi Gras trip, and New Orlea","useful":1,"cool":0},"HhrIr0J8gcofFLH0kIKnoQ":{"text":"Loved coming here, I had the roasted veggies over grits, they are to die for. My husband h","useful":0,"cool":0},"ax1i6Eqx0Ri1Q7hUsGOM0g":{"text":"This was the first of three places we tried for breakfast while visiting. Great menu, cool","useful":2,"cool":0},"EUtW98CpyP0xibHfNzmz3Q":{"text":"Finally made it to Cake Cafe for brunch today after months of meaning to go. Apparently I ","useful":3,"cool":2},"MwXhsqdfEPmhMgLMYF98ig":{"text":"We ordered two cakes for a birthday party and they were the best cakes we have had ever--a","useful":0,"cool":0},"LopWK1zDUlagNN1F4_yIwA":{"text":"Yes it's crowded and yes you have to stand in line to order at the register, and then, hop","useful":2,"cool":0},"SOjUesTRN6QhU6HN4bdYJQ":{"text":"Amazing everything. I had their chai latte with soy and they sprinkled it with love! J/k i","useful":2,"cool":0},"16sw9Kn-FXTHlnAqH5F9fw":{"text":"On our latest trip to New Orleans my brother and sister in law found this place online and","useful":0,"cool":0},"pWlKLuW-5ehYpMDnziXKrw":{"text":"The breakfast is really amazing. They are well organized and the system works. All the foo","useful":1,"cool":1},"pKBg3uL_79GEsZWSiThf6A":{"text":"This is my favorite restaurant.  The food is amazing. The people are friendly.  I live a f","useful":1,"cool":0},"bl-iP4O0F93ce7EvmbcyzQ":{"text":"I took my cousin here to try something in an area of town she hadn't spent much time on he","useful":1,"cool":0},"V8T43RDChOaW6d7gXkdFEA":{"text":"\"We hate y'all\" ...From the mouth of the employee who first engaged me as I entered the re","useful":1,"cool":0},"LzCz5bJMizCDjLuljSO-cw":{"text":"Legit NOLA breakfast. Local vibe. Quick wait. Excellent food. Superb service. \n\nDo not mis","useful":1,"cool":0},"yVc6AEdmrsMeWa7PN-iKsA":{"text":"Great breakfast joint.  Loved the hash and eggs.  Service friendly and helpful.  Definitel","useful":0,"cool":0},"5gE1HC2RB-QkryPrmNEhww":{"text":"Try the wedding cupcake and French toast!\nFantastic service and food! \nReally friend peopl","useful":0,"cool":0},"MZxJBJVa82gQ7lZWXFelDQ":{"text":"The boudin and eggs breakfast was phenomenal.    A perfect way to start your morning in Ne","useful":0,"cool":1},"55v_QIqn_7ZMoSY0kv2ZFw":{"text":"Free cupcake with my lunch? Yes please!\n\nWhen I came to New Orleans all I wanted was Red V","useful":1,"cool":2},"L9j4zmwDTYbzDF0hU2XfVg":{"text":"Great brunch option in NOLA. We got here at 10 in the morning on a Saturday and there was ","useful":0,"cool":0},"kYoqAroiWnwatOvczcar-Q":{"text":"They have the best everything bagels in New Orleans, hands down.","useful":0,"cool":0},"oWpUsOKKibx0xN6G82rc5w":{"text":"THE BEST MEAL OF MY LIFE! If you're looking for the non touristy, where the locals go, ecl","useful":4,"cool":1},"SUCR4mtLvGqS63qrHKorMw":{"text":"On my vacation in New Orleans in September, this little bakery was right around the corner","useful":0,"cool":0},"Sz6XBUg7-x-qmhnMVvzsqQ":{"text":"Memorial day takeout from here worked well, with some solid food but nothing 5-star-worthy","useful":0,"cool":0},"RyKowAbftsjVNEhcBxbkiw":{"text":"Great neighborhood place with good food and a great, low key, atmosphere.  Known in the ne","useful":0,"cool":0},"IOY160FYS92GGwqqW9HfdA":{"text":"I have wanted to eat here since I left 5 months, 7 days, 8 hours, and 32 mins ago. Go ther","useful":0,"cool":0},"NZv5O5-WGg_0kI0YH-OGzw":{"text":"My fiance and i love New Orleans because of its vibrant mix of great food, culture and peo","useful":2,"cool":0},"uLtxaLAsuFVD8K_FI7G5iA":{"text":"Small cafe in Marigny - has a very relaxed vibe. The ladies are super friendly and efficie","useful":1,"cool":0},"JIAramwhqp93mWz9GBFGvw":{"text":"I have had the crabmeat breakfast sandwich a couple of times, and it was really good.  And","useful":2,"cool":1},"JRuyWmI0UbnYoXEbsWJ54w":{"text":"We stayed a few blocks away and were here for 2 of those days for Brunch. There can be a w","useful":2,"cool":0},"SqrhZ3oJJZdmC0peYR-YPw":{"text":"Excellent food and service. It was very very busy but totally worth it. We had roasted veg","useful":0,"cool":0},"Vwbvv4cj_BxmhmyYWZy2Aw":{"text":"Crab Omelette awesome and don't forget to take your dishes to the tub!","useful":0,"cool":0},"NC0FP6OfEkNgsL3LE9utyQ":{"text":"My first experience here was wayyy negative but I gave it a few more tries anyway upon my ","useful":1,"cool":0},"ZH2t1krZbHA_hIpdNgIWOg":{"text":"Wow! It's really fun to stumble upon a quaint little place like this. Nice outdoor seating","useful":2,"cool":0},"3tQRJQirIPziJm4N0LmbHA":{"text":"Had breakfast here 2 days in a row and considering a third...everything is simply fantasti","useful":0,"cool":0},"uJCQrKX2rW5mx2Api6lOLw":{"text":"In our 5 day visit to New Orleans we came here three times!  We even made a point of waiti","useful":1,"cool":1},"EZiaXZ4MRQulgnKFofsmPA":{"text":"I love this place! I've gone twice so far, and love it. Pear and goat cheese pastry? Yes p","useful":0,"cool":0},"hCa2gBuYZcwNKTmFWHc8Qg":{"text":"A really relaxed yet unsurprisingly busy cafe (because it is clearly awesome), that dishes","useful":1,"cool":0},"kGV6j5aZhYhtA4tZwVeizA":{"text":"This place use to be my go to bakery for my birthday cakes until 2012 when I ordered their","useful":2,"cool":0},"F8jrqC6Zp5knOishOyon3A":{"text":"I love this place for the $1 cupcakes when you order a meal. I had the shrimp and grits. T","useful":0,"cool":0},"8ZgORmCJ55svPADeFO6mgw":{"text":"i LOVED this place. a breakfast sandwich with coffee for  under $5. the red v cupcake was ","useful":0,"cool":0},"ZU3ejypfEo-OOXCSFcCs1g":{"text":"We were visiting the city for a week and staying nearby. We ate breakfast here several tim","useful":0,"cool":0},"W7d_c0siCkPgqJ0A9IpVuw":{"text":"This place is absolutely delicious! The food is fresh, delicious, and made to order. Hands","useful":0,"cool":0},"QDC46U0B3Kf7SN3Qad0nkA":{"text":"So many vegetarian options.  I had the mushroom biscuits and gravy and licked my plate cle","useful":1,"cool":0},"4Uw2sUCCIZrBiWOwrzx9Zg":{"text":"Awesome little spot for breakfast. The Shrimp and Grits were tasty. Hubby had the Salmon a","useful":0,"cool":0},"7ODdv0T4UxsigRGSVF9FPA":{"text":"The iced tea with Ice-T says it all - a quaint cafe with dank food and character. The crab","useful":0,"cool":0},"B-j_gZHkwgZm2i55ciLP_w":{"text":"Really cute cafe in Marigny. They have excellent breakfast - love the grits. I had the bou","useful":1,"cool":0},"DF3z9ZDI4HBQqb3S8-Tfsg":{"text":"Great place for a cup of coffee and a pastry, and an even better place to get your hangove","useful":0,"cool":0},"RZJEombZqd7FK6RNsZsmBA":{"text":"Very good breakfast/brunch location.  Server was very friendly and food came out fast.  I ","useful":1,"cool":0},"HsFPRGuQ0FjLut1U9mwZLg":{"text":"I have dreams about their Shrimp and Grits. This place made me fall in love with the dish.","useful":2,"cool":0},"ZSWrVYucZ9wgh7_Q1s_V5g":{"text":"We drove 9.1 mi from our hotel before making our long venture home and I do not regret the","useful":0,"cool":0},"KbLJX3V7uS55qYakYjf1hQ":{"text":"Enjoyed our breakfast & the place is really cool. Coffee was delicious. Eggs a little unde","useful":1,"cool":0},"8xO0nQCmPCfn9r1CrIHwqA":{"text":"I first just want to go on record to say, any place where one of the workers sports cool h","useful":5,"cool":2},"WNS0TPY6UPq1-BqkQZyQ_Q":{"text":"The pesto pear pastry and cheese Danish were both good.  Get the chicory coffee to experie","useful":0,"cool":0},"yBz25Re-fHRh2yFvt4U4_Q":{"text":"Comfy little place down from where we stayed. As good as the shrimp and grits were I could","useful":1,"cool":0},"7MZ4yPNCUPudhopMxiBH0g":{"text":"This is an unassuming joint that is worthy of the rave reviews it's getting. I went here f","useful":3,"cool":0},"os28OnBKHF_22RQPxD6XNg":{"text":"Great little cafe for a hearty breakfast.  Order at the counter, indoor/outdoor seating.  ","useful":0,"cool":0},"KfzYgmDu5K30BKeP7qHFfA":{"text":"Shrimp and grits were banging!!!! Corn beefed hash was the best is ever had - typically it","useful":0,"cool":0},"PkPA2XRpjeu9--zgkvrnbw":{"text":"This bakery offers the best bagels in the city.  In a bagel shop devoid city, this is my t","useful":3,"cool":0},"Ysn37_bzqDhE2FvKVZ-JjQ":{"text":"I love the Cake Café!  If my diet allowed, I'd eat there every single day - and since I'm ","useful":2,"cool":0},"gWhYTJYcK1ApJRXgtqcneA":{"text":"Best cupcakes ever!  Great club sandwich too, try it on Challah bread.","useful":1,"cool":0},"6sS8RtJEy4mNhpE4uD9cTw":{"text":"We were staying in Marigny and looking for a local place for breakfast. This place had gre","useful":0,"cool":0},"uTnXiUsoaFc5cfHxrdadRA":{"text":"Costa Rican Breakfast is great. coffee is solid. cute little place with art and such.","useful":1,"cool":0},"WjXONb9NGyMhT9mkGUrW1A":{"text":"I haven't been here in forever, and decided it was time to return.  I ordered the boudin a","useful":3,"cool":1},"RCYLkFnmGmSYTlhfdlwMDQ":{"text":"I love everything about this place. It is in a quiet area, away from hustle & bustle. 95% ","useful":2,"cool":1},"wPBl3-AfN9179IaqnBeOBQ":{"text":"This little gem was found by accident. We didn't want to wait in a long line at another br","useful":0,"cool":0},"DPVrupz8U1GZ2lTFuRIBvA":{"text":"The French toast with orange pecan syrup is divine!  Also their BLT sandwich is huge and s","useful":0,"cool":0},"xKUkzIbteeiif7obMndcfA":{"text":"To me this is the reigning champion of breakfast in the Marigny/Bywater! \n\nThey serve fres","useful":4,"cool":0},"JiIiF0aflRdFxZSePI5L_g":{"text":"This is the one place above all I like to hang out in for breakfast when I am in New Orlea","useful":0,"cool":0},"cyl1pYRQAZQ2tFH-vFohPA":{"text":"I was hoping to get my hands on boudin and man, did I. This is definitely a Marigny \nhango","useful":0,"cool":0},"UZYtn9rD-12HD71zdOQLLQ":{"text":"Always the best king cake in New Orleans! Great cakes too.Got a carrot cake for my mom's b","useful":2,"cool":0},"msVOJm9oeFtX2ER5Xoi-8Q":{"text":"Just piling on with the raves and praise for this small, out of the way cafe. We were in N","useful":3,"cool":1},"obLNC5wVcrLdOrpqIuFtcg":{"text":"Just shared a huge portobello, roasted vegetable, cheese and aoili garlic omelet with bisc","useful":0,"cool":0},"efpM45LqI6zEvEIWJvS0dg":{"text":"My group definitely enjoyed our breakfast here and recommend stopping in if only for a pas","useful":0,"cool":0},"KPWVA1DnWOk0hX9GiTSODQ":{"text":"Boudin and eggs on a bed of yellow grits. Yes please. Great spot, nice split between indoo","useful":0,"cool":0},"joa0ORFqIDXUSbihvNs94w":{"text":"My friend recommended this place along with reading some awesome reviews on Yelp and I was","useful":0,"cool":0},"ggquPNyg4p5xAPLTYPYefg":{"text":"The crab omelette with spinach was tasty. The andouille sausage was really good. Nice vibe","useful":0,"cool":0},"6Odxr1dtQoDJN-mWWm7tRQ":{"text":"Once you get past the line, the food is delicious. It's tucked into a nice neighborhood wi","useful":0,"cool":0},"UFk1aacuC6lJhWHdaU-KrA":{"text":"Awesome! Great customer service and the food was delicious. Do not be intimidated if there","useful":0,"cool":0},"i4zIEjDQddmW6SYS37wikQ":{"text":"I love this place. Solid breakfast with lots of choices, great organic grits, local Boudin","useful":0,"cool":0},"_2K7AToLimqNzIMNahpEbw":{"text":"parking sucks but its totally worth it. thanks fellow yelpers.\n\nit really is a spot for lo","useful":0,"cool":0},"pBV8YQ5hkBK5xvAiOJ-Zcg":{"text":"I went in prepared to order a relatively healthful omelet and instead was totally derailed","useful":2,"cool":0},"oFVrnP1_s7GshQbFp9kBMw":{"text":"AMAZING!!! The best Cafe ever.  What could be better than a great prepared breakfast with ","useful":0,"cool":0},"YXcFTwRsDmvyaHMeHSoZcg":{"text":"This was recommended to me by a friend, and after perusing the menu I saw fried potato sal","useful":0,"cool":0},"WhLzksBADhGaonleOo8V5w":{"text":"Went here this past Sunday for brunch with 3 other friends. Was not as impressed as other ","useful":1,"cool":1},"8VwvhLQVXAMDHeVKnuVvqA":{"text":"I live here in Nola and i eat here often.. most definitely the best shrimp and grits.. the","useful":2,"cool":1},"ZsPxS-wMfdH-lzkyvXK1Wg":{"text":"Delicious fried catfish!  I love that they have healthy grits, too!  Pastries are homemade","useful":0,"cool":0},"nvFe8UL4s5Dxy6rfViiqUQ":{"text":"Based on the stellar Yelp reviews, I decided to venture to New Orleans Cake Café while in ","useful":1,"cool":0},"GfBgH7a8qHQ4406U-ysYGQ":{"text":"This place was amazing because it's outside of the touristy area and the food is affordabl","useful":0,"cool":0},"Pv6F7CyysZK4CxAkUL0z-g":{"text":"The bagels were good, we had the lox spread and the pesto spread. Both were pretty good. T","useful":0,"cool":0},"2ii5UjBWp5wiTj6_S8xhTw":{"text":"It's weird looking at first, but it's very busy for a reason. The food is great. That is o","useful":2,"cool":0},"JPTSO98Cl8I1vTgEY9dA5A":{"text":"This space is packed so tight I recommend not bringing the baby stroller. If you do, it's ","useful":4,"cool":3},"eR7aUiUnu2jra__yAVr0LA":{"text":"Went here for lunch during the work week and it was a breeze to order and get a table outs","useful":2,"cool":0},"gE-_kTPxwery7V0AmFzYFw":{"text":"I'm a long time fan of the chocolate almond croissant and their new jelly donut. Hands dow","useful":0,"cool":0},"iEqEPJPlfZLSFyRBQFNVDQ":{"text":"AMAZING breakfast place in Marigny, and away from the crowds in NOLA's French Quarter. The","useful":1,"cool":0},"YTaXzGaTOeCbYRxlTR6_-w":{"text":"Mushroom biscuits & gravy!!!!! They were so good. They could have more mushroom chunks but","useful":0,"cool":1},"2EErlOFHtDFxDz-ijKMASA":{"text":"Had the breakfast sandwich with bacon.  The biscuit was terrific, and it comes with a cup ","useful":1,"cool":0},"19KZ8KeE7Uew5OukQWMjGQ":{"text":"Pretty over rated don't understand the great reviews...\nFish and grits mediocre at best. F","useful":0,"cool":0},"Iau8zeOA_dhHcqI7gqb3Zw":{"text":"I really look forward to breakfast on the weekend. Not brunch, because that takes too much","useful":1,"cool":0},"EvQrpXET2dfGJT6eEYW3lw":{"text":"Is no wow. But the items were somewhat unique and on the healthier side...  I think the pr","useful":1,"cool":0},"4uAwEVQ_33rq5DIzjdn8lw":{"text":"A must for those looking for an amazing (but NOT Cafe Dumond crowded) breakfast experience","useful":0,"cool":1},"cDZkKRmtL61CUv5ObTkxpg":{"text":"A tad of a walk from the French Quarter but worth it.  When I saw bakery I was thinking a ","useful":0,"cool":0},"i7Yp6p3oJzLZni022PVDOA":{"text":"The real deal.\nfood is great\nservice is great\ncool little neighborhood joint.\n\nPacked at a","useful":2,"cool":0},"V5uZnnAOeuH8EaDOVGUZkA":{"text":"This Marigny brunch cafe held promise in its street corner vibe and appealing and vegetari","useful":3,"cool":2},"baqMzp3BBq6zwjH9l6fS2g":{"text":"This was the best meal that I had in New Orleans.  It was one of those meals where you wis","useful":1,"cool":0},"LNf_A7Ngk_GLL6xfJoO9jg":{"text":"Simply quaint, cozy, and charming breakfast/lunch casual dining at the corner of a lovely ","useful":0,"cool":0},"FKQzhEGIGc1mGBF8RSwOFw":{"text":"The neighborhood is lovely. I love the Marigny and Bywater areas. The cafe itself is cute ","useful":0,"cool":0},"hL1NcW56CZxhm6JPAqn-MQ":{"text":"Anyone who didn't like this place is type who can't be pleased. The biscuits are the best ","useful":0,"cool":0},"ppYkrhpJX7zv99oFwCBfYQ":{"text":"The raspberry and creme king cake changed my life.","useful":0,"cool":0},"GxNLUm0dQbL-HkC-z4MRAQ":{"text":"If you like something a little different, the apple and goat cheese king cake cannot be be","useful":0,"cool":0},"2iUbm_SveNOoPoGefRxrsA":{"text":"Little did I know when booking my airBNB in New Orleans, the best part would be that it wa","useful":2,"cool":0},"BSXotFmggD1ASEwexrVB_w":{"text":"Is worth taking a longer walk out of the quarter to have breakfast. The setting is simple ","useful":0,"cool":0},"MS-0eN64Lca6w3GCEgwMbg":{"text":"Since I had heard nothing but rave reviews of this spot from a variety of locals, it seeme","useful":4,"cool":1},"VdjR8pPv5bCgZFTE8qs5Qg":{"text":"Stopped here twice during a five day trip: once for coffee and treats, another time for br","useful":2,"cool":0},"iI75uvPdU4-BZOXPUhdCdA":{"text":"roasted red pepper artichoke filled croissant with goat cheese?  i think so!  plus sooper ","useful":0,"cool":0},"_cRSZTDGa6hjcekPfg73tA":{"text":"We visited twice in a row for breakfast and were very satisfied both times. Their pastries","useful":0,"cool":0},"s4sQ3EemTgA5C8HEuH7A3w":{"text":"This review is based on their shrimp and grits for breakfast.\n\nIt's definitely a local pla","useful":0,"cool":0},"3WNFSxGebAroDwqIhKlQdg":{"text":"Champagne & Sazerac Cupcakes? Yes, please!\n\nCake Cafe is my favorite breakfast spot in New","useful":4,"cool":3},"auiwdFjRkmn7AU1ArTzVBg":{"text":"Husband and I walked quite a ways to reach this bakery for their legendary red velvet cupc","useful":2,"cool":0},"sAYJXTGzg2xe0Iwnais0eA":{"text":"Some of the best shrimp & grits I have ever had. I visited recently from Chicago and have ","useful":0,"cool":0},"wc3qffW1NYK7XzV5AuMApg":{"text":"Insanely delicious breakfast. Counter guy a little too cool for school. Incredible eggs Be","useful":0,"cool":0},"egpkKZ_if_hZMIRYyciG1Q":{"text":"Was bummed to get to the counter and find out you have to order king cakes a day in advanc","useful":5,"cool":1},"X79RaB-DLhiKqt8zuxQ8GQ":{"text":"pretty good. Saw a cat walking around inside which wasn't too appetizing. I'll be back if ","useful":0,"cool":0},"eNyAjAbcsrvs8pufa-Vo6w":{"text":"This was my favorite breakfast spot during our visit. They had a great brunch menu options","useful":1,"cool":0},"ecqpYdb6yjWLaKLRgNQndA":{"text":"you best believe this is my go-to breakfast spot! \n\nparents in town? cake cafe. treatin' a","useful":0,"cool":0},"tGap8UnzeezBpop8zxYEww":{"text":"We stumbled into the Cake Cafe on our last day of our visit to New Orleans. We arrived jus","useful":1,"cool":0},"_8CxZ0vqnxVUJN5UANF14w":{"text":"Beyond pleased with this place. We went here every morning for breakfast and always tried ","useful":0,"cool":0},"Yc5wpAH99A--3cI84tTM6Q":{"text":"Hands down the best shrimp and grits I have had in my life. As close to an out-of-body exp","useful":0,"cool":0},"LP_76Cm_yvT5w-UcEp1Dqw":{"text":"Stopped by for their Sunday brunch. I ordered the boudin special (grits, boudin, 2 eggs, b","useful":0,"cool":0},"Y2SARM9ID7g5naLZmBP_XQ":{"text":"DROP EVERYTHING YOU ARE DOING AND GO HERE NOW!!!! The breakfast was phenomenal and the cup","useful":1,"cool":2},"Ob5WgbW9T2frasw6XWSprA":{"text":"I should warn that I've only been here for breakfast...\n\nBut, I like this place! It's got ","useful":4,"cool":3},"1VRt0Q9Hv_zDFk5awFMKag":{"text":"Really cheap and really good. Plus a cupcake for a buck added to your meal is an awesome p","useful":0,"cool":0},"dtOGlt_BNld8HVHdghtLcg":{"text":"Awesome ambiance, great, friendly service and good food !\n\nFrom the moment you enter, you ","useful":0,"cool":0},"lzzFP3Ic6XZ9RhPB7cdt8Q":{"text":"Everything was DELISH! I went here for breakfast with my husband and son while visiting NO","useful":0,"cool":0},"GP-5ovlIALiXYXfkFk8Cmw":{"text":"Boudin was great. I don't have anything to compare it to but thoroughly enjoyed it. The gr","useful":0,"cool":0},"ObgV6yzSKJl2x1Ojy_xeZg":{"text":"One word: Yum!\n\nI've been here many times but I want to discuss the last time I went here ","useful":1,"cool":0},"1ijFf6qFMThGBTz-kXMlLw":{"text":"Great breakfast! Highly recommend the chocolate croissant. We both enjoyed a great breakfa","useful":2,"cool":0},"BuxhRV-2hdAfg5co3QOnZw":{"text":"I read a lot about Cake Café and I have to say it was not what I was expecting. It is in a","useful":0,"cool":0},"DdR9p7ppo7oOuyASG77XCA":{"text":"I've been wanting to try this place for a while but sadly, I think I ordered wrong!  I dec","useful":0,"cool":0},"az3bTyovKMYb3QupcCb_6w":{"text":"i think this place is in competition for \"Where I'd eat my last meal\"...especially if I ha","useful":0,"cool":0},"RZtW7J3TjkSPa-BpV2yycg":{"text":"This is the first place I went to breakfast when I visited... and it has ruined breakfast ","useful":0,"cool":0},"Rz6tuUoL4xsyj450K_1-Cw":{"text":"Excellent little brunch place in the Bywater. They combined the meat and roast vegetable o","useful":0,"cool":0},"e7FJJEebdyfZ0ueuTEa8eg":{"text":"Awesome! The staff were so friendly and made suggestions of their favorite dishes. I had t","useful":0,"cool":0},"t3fhm0mCimjZo8dyfHYTWQ":{"text":"Favorite breakfast spot in New Orleans. The roasted veggie omelet is amazing, and ALL of t","useful":1,"cool":0},"U7aqwzHeYEVUrSOs9J2lKg":{"text":"Delicious cupcakes (get them!), good biscuits, and tasty eggs. We were able to snag an out","useful":0,"cool":0},"Bpy3buhREoGtLrZY47s6vQ":{"text":"I have dreams about the breakfast sandwich on a bagel. Also if the cucumber lemonade is on","useful":0,"cool":0},"hhzGrjS5F7QHXQ7VmvhX5w":{"text":"Our first breakfast in new orleans and what a treat it was! Great little place, wonderful ","useful":2,"cool":0},"AY9flGZIPhYxIC9yvCgK_g":{"text":"My absolute favorite breakfast spot in New Orleans. We visited almost every day we were in","useful":0,"cool":0},"ImmRMs5JuFT88uWtmF5jnQ":{"text":"First of all, this place should have two $ and not just one. The crab sandwich was $11 and","useful":1,"cool":1},"wtkAEcXGEb0xmjyqidmNQg":{"text":"The cupcakes here are delightfully moist, especially the wedding cake flavored one with th","useful":2,"cool":0},"9P3NqLFF9eRwOhWSMpCFNg":{"text":"This has been our go to place for pastries in New Orleans for 3 years. They never disappoi","useful":0,"cool":0},"OQ1ahFzMv4Fdg6asyhcaEQ":{"text":"my go-to brunch spot. why? tilapia and eggs with a big ole biscuit and creamy grits. hefty","useful":0,"cool":0},"2IqtYCYBOz_4FxAsgzntqw":{"text":"Very good German chocolate cupcakes. Very friendly and laid back place! I can't wait to tr","useful":0,"cool":0},"r5KZuDI-_koPpNjN_fwIGQ":{"text":"Great sandwich options found here! Tried several menu items after different visits to this","useful":0,"cool":0},"SuBurFLUwzFQHx_523UmnQ":{"text":"The\nBreakfast?\nFantastic.\nThe baked goods? Great.\nWaits may await. Choose the biscuit with","useful":1,"cool":0},"9RrNL83LnGUBSaySQ4t3Ug":{"text":"One word to describe this place....WOW! These are what I had. I do not know what they are ","useful":0,"cool":0},"vlRpC7pD-zZ2gMxgcEQk3w":{"text":"delicious for brunch! get there early and have someone grab a table while the rest of you ","useful":0,"cool":0},"kS7Popg4zEhXCS-0Y0m5ZA":{"text":"Veggie omelet is awesome. Breakfast croissant with bacon, egg & cheese is even better and ","useful":1,"cool":0},"0PukbGasIqPnn04ZzGCn7w":{"text":"The breakfast here is divine with baked goods that are incredible. I am known for my cupca","useful":2,"cool":0},"0u0kwA8K9Z4M_cukI3VNwA":{"text":"Small but great in taste. It was a great experience and the service was good as well. Reme","useful":0,"cool":0},"kN16E6tQkzhehqXnX26rsw":{"text":"Food poorly prepared and served cold. Shrimp and grits had shrimp of questionable age in t","useful":0,"cool":0},"50I6YJic44JxBniu5EKlTA":{"text":"Tried the smoked salmon and cream cheese bagel with scrambled egg. The salmon was too darn","useful":0,"cool":0},"I_cLbUDKlg38TUu0Q-vTvw":{"text":"We were coming from out of town and contacted them to make a cake for my sister's 40th bir","useful":0,"cool":0},"luzOBhMCNvc0e3MQSpyWjA":{"text":"Nice energy here! We had a great breakfast, good coffee, and excellent service!","useful":0,"cool":0},"WV9QfzPMXaPi_VsZ7RE8Hg":{"text":"I'm only giving this place a 3 because we didn't actually get to eat here. However, when w","useful":0,"cool":0},"cYXQQAIZ0pXrQRvHh7qC9w":{"text":"Loved this restaurant. It was recommended by the owner of the nearby B&B where we were sta","useful":0,"cool":0},"Remn9kBrPin-SVCs1D8aEQ":{"text":"Friendly staff, delicious food, and good coffee are the reasons we keep coming back. Oh, a","useful":0,"cool":0},"iok6qDZUVisAYb6mwEParg":{"text":"Cool atmosphere and good food.  Try the local dishes, I had the crawfish sandwich and it w","useful":1,"cool":0},"Ji991_w_G94lEj3p1LwDFQ":{"text":"Nice walk from French Quarters. In a quiet neighborhood, cute restaurant. Good and friendl","useful":1,"cool":0},"k7jx5AixpmMHNQnVl665xw":{"text":"4.25/5 eat it all.\n\nthis is breakfast done right. i love stuffing myself with these cheesy","useful":4,"cool":1},"Fxy1ohmrHUaH0xRbpJoeqw":{"text":"Solid breakfast in a friendly environment. The crab sandwich was especially tasty. \n\nThe t","useful":1,"cool":0},"YmMJoP68F30abWmBbDBCEQ":{"text":"Cake cafe is probably my single overall best breakfast experience in MY world. \nI am not s","useful":0,"cool":0},"n_FDqpVjuEFW1xqQwrrigA":{"text":"Still 5 stars! Stopped in to have a breakfast and it didn't  disappoint! I order the corne","useful":2,"cool":1},"yYlEyzYmtwwTSyJbipf9UA":{"text":"Discovered this place just around the corner from where we're staying. I'm in love with th","useful":0,"cool":0},"c6y5GHeh2jwkuHI6pYODNQ":{"text":"I went a few weeks ago and had the Tilapia and eggs special. It was by far the best brunch","useful":0,"cool":0},"-1VmRpTZuZWH1sXwCsbo1Q":{"text":"Roasted veggie omelette....ah foodie heaven!!!\nFor those of you have ever tried chicory co","useful":0,"cool":0},"SuHXJs_IeCi_oC3kDhsLIQ":{"text":"Very good baked goods. Most of regular entrees very tasty. However, the female staff is we","useful":1,"cool":0},"-zMHd8nsfQyf5mzMLB6f1g":{"text":"I found this place because I was desperate for chocolate cake, and for whatever reason, it","useful":1,"cool":0},"1MViTbpPFbXxAfrhDYDE9A":{"text":"I love this place.  I ordered a biscuits and gravy and then grits with goat cheese and Oh ","useful":0,"cool":0},"vaivj5OKONkixubZGd1ssg":{"text":"Although I am not sure what standards would be used to find that the \"healthy grits\" I had","useful":1,"cool":1},"gmBwdvK9LNUfzA40TQIZEQ":{"text":"Great breakfast & lunch place plus a really good bakery.  Portions are large but the food ","useful":2,"cool":1},"dRxzsp2kovakOrnx7TQ_bg":{"text":"The food here is excellent, I've had both the veggie omelette and the corned beef hash. Th","useful":0,"cool":0},"OQdPPJ5SUzoCcz-aqp76Fg":{"text":"I wish I could give more stars to this gem of a breakfast/lunch place!\nwe came here 2 days","useful":0,"cool":1},"Kp2GS2BDkmc5sHt4f0uYmQ":{"text":"It is rather good.\n\nEnormous sandwiches, a pleasant atmosphere and a location rather isola","useful":0,"cool":0},"3iWu3Dct6YN5FJnifp7J3Q":{"text":"Really good food.  Came for lunch.  The tofu scramble was amazing!  Super friendly staff. ","useful":0,"cool":0},"QKFBIWLhYvml4ufsVWJA6Q":{"text":"A-Ok, I guess Yelp. Nah, this is more of a \"Meh. I've experienced better.\" I'll give them ","useful":0,"cool":1},"qt1W5hu2XC26Vdr2MU1xEA":{"text":"Great breakfast accompanied by walls filled with great art!! Perfect brunch or breakfast s","useful":0,"cool":0},"VMQJHdMfkrsWBe8T7qXseQ":{"text":"We tried this place because it's location and it quickly became our favorite breakfast pla","useful":0,"cool":0},"-DovvwSU3YRwpAcbIpqaaA":{"text":"I had the roasted veggie omelette. I appreciate meat of all kinds. Trust me, this omelette","useful":1,"cool":1},"arlW1TZJjpOeCOvs5dDUPg":{"text":"Hmm. Cake Cafe..... love the location, and the cupcakes.. though I do think they could int","useful":0,"cool":0},"TGfTr97waVeI5sWCQZG4Aw":{"text":"Loved it. Generous portions perfectly flavored.  \nWe will\nDefinitely be back\nWe shrimp and","useful":0,"cool":0},"Vz43GAl71BnrriQ5tWbE8Q":{"text":"I didnt even have a chance to eat- I tried to have lunch there last wkend- I had my tiny, ","useful":0,"cool":0},"cok4wzPSk_jDf6c03vq0pw":{"text":"Awesome bagels. Had the tofu and roasted vegetables. It was great.","useful":0,"cool":0},"MsQSquwXcMoR5EuaDQLtNQ":{"text":"A nice locals loved spot. \n\nWe dropped in and after about a 15 minute wait in line (which ","useful":4,"cool":3},"63AmFywIZeH53FxlSaOnZw":{"text":"Oh my gosh! Such great food! My friends and I would get their fairly early so the wait was","useful":1,"cool":0},"puIT2Y-rZCQhLPKLjxUiUg":{"text":"Amazing food, amazing Coffee, great atmosphere. Cool people, best place we've been to in N","useful":0,"cool":0},"jU01UjecV8ph9ObFpb31pQ":{"text":"i LOVE this place. I love bringing visitors here too. It's a tasty slice of the marigny/ b","useful":2,"cool":2},"soD_WUbqDDZZqBO-Sb82zg":{"text":"Cute little neighborhood place, has a little Soho bohaminan feel to it. Good food, just wi","useful":0,"cool":0},"XqYvY4uNCsek2re_PvJWDQ":{"text":"in the Bywater neighborhood. Not only great baked goods, but a terrific breakfast, omelets","useful":0,"cool":0},"qLBUYcQgf8sKbQAfQzV1Dg":{"text":"The absolute best spot for brunch in the Marigny! My family has diverse desires, and this ","useful":2,"cool":1},"V-0TEat5XvE-1ZJhPPgyRg":{"text":"There was a wait but the line moved quickly. Staff was helpful. I loved their vegetarian/v","useful":0,"cool":0},"mr-eEVPnkIZGN-NVzcVUGw":{"text":"Located in a residential area.  Nice place to duck and hide from the normal tourist AND en","useful":1,"cool":0},"uHauFkWqZbdgqy_hL1Wqmw":{"text":"We ate here 4/5 days of our stay. Location, service, food-including the 99 cent add on a c","useful":0,"cool":0},"srUEJpUDQ6-hOayDEkjEwA":{"text":"Quick, easy, and soooo damn delicious!!! We got there at 9:30 am on Memorial Day and it wa","useful":0,"cool":0},"G9oXKUMvbbD8OwoKjb0qbA":{"text":"Casual and eclectic breakfast place. Large portions, outdoor seating, and good service. Th","useful":0,"cool":0},"9PWCPq3g8XgDl2GmPD3ShQ":{"text":"The best, most delicious, moist, scrumptious frosted cupcakes I have ever tasted. I ate th","useful":0,"cool":0},"DlIO7l_LSolBd6g6Y8FhhA":{"text":"Disclaimer: I am a happily married woman. My husband is a ridiculously attractive/classica","useful":0,"cool":0},"bNYUgBiGosRoyt89A4Dssw":{"text":"We got here at 1pm on a Sunday and expected to wait but were seated within 10 minutes and ","useful":0,"cool":0},"emdhktFJRY8mAoSUTAufKw":{"text":"Cake is fantastic. \n\nWalking in at first can be a little confusing, do I just sit down? ar","useful":2,"cool":0},"NPQABH5qsu2Ae5MC5aURKw":{"text":"Items Selected:\nChicory Coffee\nButter Pecan Cupcake, Red Velvet Cupcake\nCinnamon Roll\nChoc","useful":6,"cool":6},"nkpNIINve6jtdNRDwfl1SA":{"text":"This is my favorite place to buy King Cake! The apple and goat cheese King Cake is sweet a","useful":0,"cool":0},"YRuz85tC8Vo6hsEzuuBvOA":{"text":"My friend and I are steadily checking into every place within walking distance that offers","useful":1,"cool":0},"zVuexPQQoU9l4x1F6IQM6w":{"text":"This was my first time here.  We were looking for a new breakfast/brunch spot to go to bef","useful":1,"cool":0},"Q2GzTsq9zxc6nZxZsefniA":{"text":"Yum, yum! Cake Café was one super cute Southern Breakfast joint! At first 'Shrimp and Grit","useful":1,"cool":0},"et6UBvBIklRzlFQ3xrA2xg":{"text":"We were looking for beignets, but were told that this cafe \"ain't THAT kinda cafe.\" Oops, ","useful":2,"cool":1},"9lr62Qsiz0FnHwcmm34nHg":{"text":"This place has always been my favorite spot for breakfast and brunch. Their biscuit is ama","useful":1,"cool":0},"eJtzQkEaMsWeZbXz301tPA":{"text":"The Cake Cafe is 2 blocks away from my apartment, which makes me only 2 blocks away from t","useful":2,"cool":1},"Aa1UCIpkHVQbhct0FyPLLQ":{"text":"Delicious great local spot with a friendly staff.  It's not in the most regular restaurant","useful":0,"cool":0},"kWsU6bNqL1mtZwb0TYAfVQ":{"text":"Costa Rican breakfast was perfect!  Black beans, brown rice, pico and guac (didn't even ne","useful":0,"cool":0},"9jVCRmHq6dY7p3LsFYu5FA":{"text":"Small place with great customer service and food. This little gem was amazing. Loved this ","useful":0,"cool":0},"5ZPoNB8DVFucAsjlQbcCaQ":{"text":"Good cupcakes horrible that there is no wifi service at a coffee shop WTF","useful":3,"cool":3},"UguXCSYi3N6gOKwuvEJwag":{"text":"Five stars\nSix stars\nONE MILLION GOLD STARS!\n\nI loved this cafe and bakery to pieces! It w","useful":5,"cool":1},"l_8KG9YZJrOacgmAiDN-yw":{"text":"Cupcakes are diVINE, especially the key lime flavor.  Additionally, they are killin' it wi","useful":0,"cool":0},"4uT_4d6-YW8ZvFuSsSc6Mg":{"text":"The oyster and eggs were amazing!! The staff supper friendly and the good arrives before y","useful":0,"cool":0},"jYuvjPXzHyycQsg4MiHvgg":{"text":"Loved the local ambiance.  I had the breakfast sandwich- ham and cheese croissant.  Very g","useful":1,"cool":0},"uCTCiCjnBUwsd-Yurjv-1Q":{"text":"Awful customer service. We waited in line ordered and paid for the food. It was 10:15 afte","useful":0,"cool":0},"Dgx1gA09R_DsEQoLCPoLuw":{"text":"When in season, their king cake is to die for. Definitely one of the best in the immediate","useful":2,"cool":1},"9bTIoi-G82URMNRKpqTrAQ":{"text":"Cake Café is a great spot to grab breakfast or lunch any day. This bakery/café has amazing","useful":3,"cool":5},"s0kIRik_atqpm3HHBZgiOw":{"text":"Quaint little corner spot in the Marigny. Friendly laid back atmosphere.\nI've been wanting","useful":2,"cool":2},"OSUJ4VhsjimqkZ056PldQg":{"text":"HAD to try this place, just for the cupcakes. :)\n\nAnd the cupcakes were YUMO - much better","useful":0,"cool":0},"RKZSCwasWTHPb8obJsVX1A":{"text":"OMG not enough stars in the world to review this place. Last day in New Orleans and a frie","useful":4,"cool":1},"20_Q5GpHwL5YX5kt6JTSVw":{"text":"This place was small yet amazing. It was packed yet everything seemed streamlined. You ord","useful":0,"cool":0},"nSt6BWHyJTotIK7tmv0b9A":{"text":"Delicious coffee, excellent fresh pastries and food. The croissant was flakey and buttery.","useful":0,"cool":0},"t8Bm_GmdHaNL2_3Z1wR07A":{"text":"Great breakfast - I got the boudin, eggs, and grits and it was fantastic. Most breakfasts ","useful":1,"cool":0},"7YZmVZpZ4b0OFZvd3JrIVw":{"text":"Shrimp n' Grits, Crab Omelet, Homemade Biscuits with House made fruit jam, French Toast, C","useful":4,"cool":1},"tE_BTITEO5kXtyEaQPz-Cg":{"text":"The Marigny is an adorable neighborhood. So it makes sense that this place, the people who","useful":3,"cool":3},"mXzXWdi4cGjAP8P0sOvNbw":{"text":"Tried out this joint with friends for Brunch on a Saturday morning. We must've arrived at ","useful":2,"cool":2},"LnX9gShl22jTnX69_WEzbA":{"text":"Great inexpensive breakfast. And a wide selection of all kinds of sweets and savory treats","useful":0,"cool":0},"Ryy16b0NjHdTxTI9sfq-Rg":{"text":"This place has friendly service and great breakfast food. My group got everything from the","useful":0,"cool":0},"ryCS__jLXRXCGlXqbem9UA":{"text":"My favorite restaurant in New Orleans....great food, fun neighborhood, strong coffee, fres","useful":0,"cool":0},"zZfXKNFtXYLEfhvI-2lvDg":{"text":"Wonderful place! I am lucky enough to live across the street from Cake Cafe and go there a","useful":0,"cool":1},"6lh_8ZQxwuuM4V0HSUqp7w":{"text":"From the ambience to the service to the food, NOLA Cake Café deserves 5 stars on all front","useful":2,"cool":1},"faUxWDngh4GgjqqDmGST2A":{"text":"Cake is one of the best secrets in New Orleans. Most people only eat in the French quarter","useful":1,"cool":0},"zOwoL0XWJKJnvH3wkm6_qg":{"text":"Came in with my family and friends for a Sunday brunch. We where greeted by lovely women w","useful":0,"cool":0},"SQ11rGNScgaKdiMSfGzWOg":{"text":"mmm... \"Healthy\" grits special was yum- sauted veggies and goat cheese over grits with a b","useful":1,"cool":0},"Oh6YuAeeA5-MqSVoTyl_Dw":{"text":"Holy freak, you've got to get a King Cake!! Apple & Goat Cheese. Ahhhh!!!","useful":0,"cool":0},"5se4hXap6arUL9XzMbPwPQ":{"text":"This is the best breakfast in New Orleans. The crossaints are divine, the coffee is strong","useful":0,"cool":2},"DAQfRQFp29tWD9hRUNpGFA":{"text":"I love their breakfasts this is the second time I've eaten thwre.  Both times I got fried ","useful":1,"cool":0},"LtMxAfSb6Cu4Jt6EZljTLA":{"text":"Our first food destination in New Orleans this week was the famous Cake Cafe on Chartres S","useful":0,"cool":0},"5c-HC1DlCAvT13Ww9WZ-nw":{"text":"This place was definitely off the beaten path which is probably why I loved it. I came on ","useful":0,"cool":0},"GSn3Ak2AOfvB09peXjImxw":{"text":"It's pretty much a tie between this place and Elizabeth's for the best brunch in New Orlea","useful":1,"cool":0},"-2aFeAQJC01x8dj8kC_FCg":{"text":"Five  weeks ago I called and ordered a wedding cake for my sister's small gathering.  Noth","useful":1,"cool":0},"6B4Wqip_PYpqBa0FCauvTg":{"text":"I am so happy we stopped here before leaving New Orleans. It was one of my favorites that ","useful":0,"cool":0},"NrMpejgcasEVoPD31zevbA":{"text":"I ate here for the first time today, and it was very good. The service was super friendly ","useful":3,"cool":0},"b3LeejIeObLCIRXMMWJA5A":{"text":"Great breakfast experience! Crab omelettes were full of crab and the catfish was well made","useful":0,"cool":0},"TSsZ4bnKus-lSzgC4UiOGA":{"text":"We had a great breakfast in this adorable little no-frills restaurant located in Marigny. ","useful":0,"cool":1},"UFt4mKNqDnIA4pGYai_AXg":{"text":"My boyfriend helped build all of the new tables in there and the bus station and what not.","useful":3,"cool":0},"OPM34br9ekpJj3T0GuRIxg":{"text":"Best Red Velvet cupcakes ever!!  And the ciabatta bread is delectable.\n\nDownside: Small sp","useful":1,"cool":0},"LPqTCFO6lJaQ0Iu2fB0dow":{"text":"Their ordering/seating system is interesting, but it seems to be working pretty well. Ther","useful":0,"cool":0},"cKfdoop7q-HnOAOx6iyOag":{"text":"This not the best breakfast place in NO but, above the average without a doubt","useful":0,"cool":0},"gvN2kIfnkd6T7ulmVtFukQ":{"text":"Heaven on earth!  Oh, the breakfast is amazing, and so are the cupcakes, and you're encour","useful":3,"cool":0},"OXjBgK8t_EdYx-ALfDlTdQ":{"text":"Mmm, Cake Cafe.  I have so many wonderful things to say about this place.  For starters, t","useful":1,"cool":2},"o_Nb6U4nAeg9PJ2nN26WnA":{"text":"First time here and we were not disappointed. I had the corned beef hash. The house made c","useful":0,"cool":0},"PyZ6FvA5DtRazYP8wSiLYw":{"text":"So yummy and fresh. Had the beet salad and will definitely go back for a breakfast!","useful":0,"cool":0},"yjMpb_1LqTnkfnOhfqRcwA":{"text":"Comforting. Delicious. Amazing service. Great prices. And lots of vegetarian options.","useful":0,"cool":1},"TSpgj4ZXZrBfUj5Z8xjLtw":{"text":"Delicious crab sandwich and pastries. It was packed but worth the wait. Service was not th","useful":0,"cool":0},"9JnXdRb1XiMHgAqFvDeDuQ":{"text":"I was visiting NOLA from SF. As An ardent fan of Southern Food, I wanted to have Biscuits ","useful":0,"cool":0},"QT__jrU6dVDzROCu6v5fkg":{"text":"This place is quaint, and the food is delish. I had the veggies over grits with added eggs","useful":0,"cool":0},"x6n59sozil0sdQs6Tk1P-Q":{"text":"I love this place,.\nThe food is rich, the portions are filling and the pastries are really","useful":1,"cool":1},"VTvlQOfE-2JBgO82eY8R-A":{"text":"This is a nice little spot on Chartres Street in close proximity to the French Quarter. We","useful":0,"cool":0},"vylOQu4Ndz9MkJ_ZIFGNcw":{"text":"I walked to Cake today enjoying a half hour stroll looking forward to breakfast at 2:30pm ","useful":2,"cool":0},"5Va9CWYp2IgBrtF4wGG3dA":{"text":"I don't think there is a breakfast place in town that can compete with the $5.50 breakfast","useful":0,"cool":0},"_jZoSiQRM9czqv_tav520A":{"text":"My Krewe du Vieux, Jewish sub-krewe comes in here every Sunday before we go build our floa","useful":3,"cool":2},"sNFBQR9MNyKdrD6LMYkn3A":{"text":"Best breakfast place to visit while in NOLA! Catfish and eggs were a first along with home","useful":0,"cool":0},"EsuWfXmrv-l2xwwiiaMk7g":{"text":"This place use to be my go to bakery for my birthday cakes until 2012 when I ordered their","useful":3,"cool":2},"hmieoLmkzHYVkIMs-q1obw":{"text":"My mother and I were in town for Jazz fest, we stayed at a place just a couple blocks away","useful":0,"cool":0},"-c5nVhMwAKTrkxrppQIHVA":{"text":"Lovely funky neighborhood place not to be missed.  Loved everything except the coffee has ","useful":0,"cool":0},"MkWkkjrTgZUXitS0IE7Q_A":{"text":"Had their special, which was pulled pork, grits and eggs. Everything was delicious includi","useful":0,"cool":0},"OFlAfopSZSgKFRN9jCi3Vg":{"text":"After two years of outstanding service, food, and atmosphere, I'm shocked I never got arou","useful":0,"cool":0},"LnOotcPoSiekaow22dch2Q":{"text":"Currently my most reliably favorite place for cupcakes in New Orleans - especially the cho","useful":0,"cool":0},"hJb_yt1KJ96a34_ft0Y29A":{"text":"Went back to Cake Cafe several times in the last few weeks.  The miserable manager is gone","useful":2,"cool":0},"pRBb77iIAI6PDFPpr3sf0w":{"text":"My husband and I visited this restaurant while in New Orleans last week and that was some ","useful":0,"cool":0},"ZQ-HhGVXkdJjKkrSYGXEeA":{"text":"Busy and adorable, this little cafe packs a punch. Their food and attention to detail are ","useful":0,"cool":0},"vIbodT7CLkw65B2tMXScUg":{"text":"Dumb luck can still be good luck.  It was dumb luck that my NOLA home for the week was in ","useful":11,"cool":10},"LyLrJFGVRR6IV3jqzOifHQ":{"text":"Coming to Yelp to rate this restaurant, makes me want to book an impromptu flight and leav","useful":0,"cool":0},"JGqPIP2ElMacB1xvUdmezQ":{"text":"This is absolutely one of my favorite places for breakfast in the entire city.  (Now that ","useful":3,"cool":3},"VUQmZQpS0F-tTcevNbBang":{"text":"Great breakfast spot with big buttery biscuits. Stopped here a couple months ago with some","useful":5,"cool":2},"9mDbNpKHTUoc-fBitUvzMQ":{"text":"I ordered a cake for a family vacation in New Orleans from out of state. The baker was so ","useful":0,"cool":0},"RrLq-BfNHsMilVIwioynGg":{"text":"I have the weirdest luck when it comes to my time in New Orleans, and it's largely just ha","useful":6,"cool":8},"46CvUkIa9pt1q9Xx7ANqLg":{"text":"Adding a one-dollar cupcake to your order is so appropriately charming for this place. The","useful":2,"cool":0},"6MnlVLE9ElQwy5wMHRJbMA":{"text":"I am so full of wonderful French toast. You also get a cupcake for $1 with your meal. So w","useful":0,"cool":0},"UZHf53gT4W6mlZ6KCvGdjQ":{"text":"I've only ever had my favorite healthy grits and king cake but everything on their menu lo","useful":0,"cool":0},"YktuLtkRNAqL9KfSLPutPw":{"text":"Great breakfast and laid back environment!\n\nThis great breakfast restaurant came highly re","useful":0,"cool":0},"YI9cGEpy9Tq8Zxwb7FwEFw":{"text":"i've been to cake cafe many times and near as i can figure, they don't like children there","useful":2,"cool":0},"trOX4r9aYqd6Ps8Ak-QwYQ":{"text":"I've heard rave reviews about Cake Cafe for YEARS, but I end up in the Marigny/Bywater so ","useful":0,"cool":1},"Mngbc-hNcnwb99pLnUeowA":{"text":"Cake Cafe is the best!\n\nThe staff is cheerful and helpful (not to mention adorable!) and t","useful":2,"cool":0},"uWNoA2zJiCKzZ6AXikyzfA":{"text":"This place has a lot in common with St. James Cheese Company uptown -- they both have misl","useful":0,"cool":0},"SwGeTXoto0Gu2pcHF6eqnQ":{"text":"Man this place is the best. Sweets.....breakfast......great service.","useful":0,"cool":0},"jf5ZggEcA2gv55Hyx0azrA":{"text":"I came here after being turned away at a nearby hot spot due to the wait.  \n\nIt was actual","useful":0,"cool":0},"3kYwSL7c38JfTBJjBA_Y-w":{"text":"So...I'm not a Yelper, but this place deserves some love. NOLA Cake Café is definitely one","useful":0,"cool":0},"AqiMieXbaQdfgH9OutHEtQ":{"text":"This is a cool cafe right outside of the French Quarter in a quiet neighborhood.\nWe came f","useful":1,"cool":0},"Tl7dItYAUnZwF9w9QOoKsQ":{"text":"I finally went to Cake Cafe with a friend after hearing so much about it.  We went on a we","useful":0,"cool":0},"Wc22fQdT-kLhGMtgEeAoPw":{"text":"Today was a repeat of yesterday, I had the Catfish w/eggs, biscuit & a side of fruit..  YU","useful":0,"cool":0},"-l0jObGYm6LXVSDtnwwNig":{"text":"Brunch was okay - not a home run but the two teenagers with me were happy with their eggs.","useful":0,"cool":0},"RP-UdteemlpWqblMIIHL9Q":{"text":"I love this place....the blue crab street corn is delightful....it's corn on a cob with a ","useful":0,"cool":0},"mvVAp_oMWnfRavErc3g37g":{"text":"I was looking for good brunch places in New Orleans to try and this came up on several lis","useful":0,"cool":0},"zJEzpM8MNjqvaNqTN-CApQ":{"text":"Go there if you want a steaming cup of attitude along w/ a side of \"I don't care\" from the","useful":0,"cool":0},"keeA34X3GKLDMPd8T5v4sg":{"text":"just ate here before we left to head back home. IT IS DELICIOUS. fast service, but busy li","useful":0,"cool":0},"mPnf3lTIUkC6PMmt75BeuA":{"text":"TOURISTS TOTING BEIGNET MIX & CDM\nhave somehow penetrated into the MarignWater depths. At ","useful":9,"cool":5},"fioG7fI7SmFqm5m-YkWJxQ":{"text":"Awesome place!! On vacay in NOLA & met up with friends for breakfast here. The food was de","useful":1,"cool":1},"NZBeyaqFxTOUysGGprbq4Q":{"text":"Back in 2008 when I worked around the corner, I would order from Cake Cafe for lunch all t","useful":18,"cool":9},"CfsFDC2nQNPc3aVwRtAW8w":{"text":"First of all, let me say that my only problem with this place is the attitutde of the mana","useful":1,"cool":0},"db03mPwpDTW_JHfnLp30qg":{"text":"So tasty.  Loved this place. Great veggie and grits breakfast!  Good coffee. Great staff.","useful":0,"cool":0},"thQY4c4WwND_EHYG6SLbLg":{"text":"This place is located in a corner nook on kind of a ghetto street, but don't let that shy ","useful":3,"cool":1},"X6P8RxteYZrHpCmCEWY9Bg":{"text":"New Orleans Cake Cafe and Bakery is fantastic. I doubt I would have ever found this place ","useful":0,"cool":0},"L5d9kpYOdTyDUkdDl10jzw":{"text":"Great brunch spot with amazing cupcakes that are only a dollar extra with the purchase of ","useful":0,"cool":0},"5v2loOrfSRXlL79lMwisgQ":{"text":"Zagat rated and written up by the New York Times. Sounds like a must try, unfortunately I ","useful":0,"cool":0},"AkDhZRG-hhtvvWiyXd5pwg":{"text":"Great atmosphere and people. Food is amazing! Biscuits and gravy was really good and the v","useful":0,"cool":0},"iFaLNgGXIzgFpE3K3Z-w-g":{"text":"Holy Mother  Everything was excellent! On a crowded Saturday morning they had everyone mov","useful":1,"cool":0},"sIGtjqj3Hl4gzkngkx5a-g":{"text":"Nice ambiance and very friendly wait staff. I had the french toast and shrimp and grits. T","useful":0,"cool":0},"MB0eZGmRAPWcCaXqQZKKuA":{"text":"Recommended by a local on a trip with my guy, we decided to give this spot in the Marigny ","useful":2,"cool":2},"CdtRRL7iOl79KYtxbYby5w":{"text":"Great coffee in the Marigny, even for a Seattleite.","useful":0,"cool":0},"W1wow25O8hJ15ihRHIrf9w":{"text":"I was looking for a new place to eat brunch for my birthday weekend and I stumbled upon Ne","useful":0,"cool":0},"GzcVEayV7RWd2KKmxy5nug":{"text":"Best place for coffee and breakfast! Corned beef and hash is delicious. Vibe is great. Mus","useful":0,"cool":0},"7crUdaWXtsO8HlXVJNH0nw":{"text":"Extremely surprised and disappointed with my experience after having read these reviews pr","useful":1,"cool":0},"Pre997dJccFTakovJ-AIEA":{"text":"Awesome brunch! I had shrimp and grits with an excellent biscuit and my husband had corn b","useful":2,"cool":2},"FssYV7EBlC4goPQAscPmgA":{"text":"Came here for breakfast and enjoyed the ambiance and fresh good they served.  Place has a ","useful":0,"cool":0},"TfIvX5QMmOWqe0MBvBpC1A":{"text":"This place was amazing! I was worried when we walked in due to the line out the door and l","useful":0,"cool":0},"HcxIQtdWNVM-FI7FD3hc6Q":{"text":"We had breakfast here and the overall rating was tinge food was delicious. I had over medi","useful":0,"cool":0},"6WUcfdSb-FBZQIja_Q4kSg":{"text":"You have to taste the biscuits and mushroom gravy!!!!!!!!!  Amazing. The 30 minute walk fr","useful":0,"cool":0},"GCtc4R54hkrghCsfG9zw8w":{"text":"We went twice for breakfast during our time in NOLA. We absolutely loved the catfish and g","useful":1,"cool":0},"1e-DSJroxsUDfPm6f2f3AA":{"text":"My only problem with this place is that I didn't discover it earlier!  Also I wish it was ","useful":0,"cool":0},"Tiv24ubExp9K7Aa5VG-r8Q":{"text":"Ok, I found out that they DO in fact have iced-coffee ... but it's bad. It's just really b","useful":1,"cool":1},"zE5zLkww58tHGpBUv4G-ww":{"text":"Recommended by locals. I was excited but it failed miserably. The service leaves a lot to ","useful":0,"cool":0},"jR6z9MD2r3YS-DinkqkXNQ":{"text":"If you are looking to give your money to respectable people go somewhere else. Despite bei","useful":1,"cool":1},"Cg4xroz2pfvu-VBFPH7-Mg":{"text":"Good, small place on a residential street. Little cramped on the inside when there's a lin","useful":0,"cool":0},"d0tk6RnXXOtM1LzyPhG4Ug":{"text":"Good, fresh salads and sandwiches for lunch.  Looks like it is mainly a breakfast place fr","useful":4,"cool":0},"LXguuGhBlgsdem2gMtoXBQ":{"text":"Small place that offers good selection of breakfast, bagels, cupcakes and coffee. I have o","useful":0,"cool":0},"LI_m_9gUX0OanMbCBRCMkQ":{"text":"This has become our go to for breakfast when we visit!    Only \"problem\" is it ruins us un","useful":1,"cool":0},"78QA5UWGjv_MfKz4SOJK4g":{"text":"Food was super yummy. Ask for their in house made jam. It is a little small garb a table a","useful":0,"cool":0},"Sb4Sb1cU5XqjoWGYwHOPQw":{"text":"Came here alone one morning on my last full day in New Orleans. This was my birthday vacat","useful":6,"cool":6},"l0uUfAXClA6wczHP2tEHJw":{"text":"Oh my goodness, the Catfish & Grits plate here is ah-mazing! Like AH-MAZING.\n\nI'm a grits ","useful":4,"cool":3},"fQIZYSdHlJMgDm7aTAeZHQ":{"text":"Wow. This place has a serious breakfast for vegan/veggie folks. Their tofu scramble is bas","useful":1,"cool":1},"Q3Dmlp3IxY-FmvZu4zxbPQ":{"text":"Genuine authentic New Orleans breakfast. We had the biscuits and gravy, a slice of king ca","useful":0,"cool":1},"cXGzPWAdSCSf-ESxKLhGDg":{"text":"Great little cafe. \n\nGot the boudin and eggs. My friend got a vegetarian costa rican break","useful":0,"cool":0},"a_CP-dvpb-7qeAlyJEwNVg":{"text":"I came back to this place almost every morning for the whole week I was in New Orleans. I ","useful":1,"cool":1},"rkiAPYxDXQAY-l6JnqqB9g":{"text":"I was extremely happy to find this spot on yelp. I took my family during our last cruise a","useful":0,"cool":0},"crojLN_1EmPw2YuWFu7RKA":{"text":"So yummy!\nThis was our first breakfast on a trip to New Orleans and it was the right choic","useful":0,"cool":0},"QkHa27IFLgnxvUSIS-e3Dg":{"text":"I've been dying to try this place and it was well worth the wait. vegan heaven but scrumpt","useful":2,"cool":2},"cYWPvHAv8dSRxiU6xu89YQ":{"text":"Kick-&$$ Shrimp & Grits! Best I've had by a long way. Get the biscuit with it. Red velvet ","useful":0,"cool":0},"Ln1GPyspm0wSZC0m4oIHYw":{"text":"We stopped in for our last breakfast in New Orleans with a touch of sadness. However, the ","useful":0,"cool":0},"r39vBN4OxUSxPTs1WZOUjw":{"text":"Coffee was strong. Food was delivered fast and was delicious! Plus the cupcakes for $1 wer","useful":0,"cool":0},"g4Yg0UOOoeV2XU_JcWqkmw":{"text":"You guys must of been born with different taste buds than me. I had the shrimp omelette an","useful":0,"cool":0},"wLNEU2Qcjt5LxgvlAPetHA":{"text":"RUDE AND INCOMPETENT STAFF. They took our orders and our money, and completely lost our or","useful":1,"cool":0},"EsZX9_xa8Fq0n6RbS5J4ew":{"text":"Best brunch I've ever had! Their chicken tacos are phenomenal! The best part was their cup","useful":0,"cool":0},"EezC_zgJxqqYJ0tnchPmOg":{"text":"Came here from NY with my wife and two friends. Had the best breakfast we had in New Orlea","useful":1,"cool":1},"HKb5xHDpc5CHNGlOfDyu2A":{"text":"There is so much goodness in this place. The baked goods, the staff, the location. We love","useful":1,"cool":1},"qtpLaxIgqTn_Yx1sPK1b6A":{"text":"This place makes a good bagel. It's soft, but not in the bullshit way that white bread is.","useful":4,"cool":2},"hZjPUrPAQh631_dmCDVbVQ":{"text":"Great food, great atmosphere and great staff! The ham and cheese croissant is my favorite ","useful":0,"cool":0},"gjh5O_XUDU-3W5Rdnc-knQ":{"text":"We were on our way out of the city and stopped here due to the reviews.  Definitely not a ","useful":0,"cool":0},"_AaAsTm6Ls8AhvSq9LE5RQ":{"text":"All the food at this place is made with love.  Order at the counter and sit and enjoy.  Fr","useful":0,"cool":0},"FtX0zolD3HGB8FL2I3OyxA":{"text":"The New Orleans Cake Café & Bakery's apple and goat cheese king cake is my favorite in tow","useful":0,"cool":0},"RCq6RxD4cyxn7d1MDm9nPQ":{"text":"Very worthy of its rating.\n\nNice selection of baked goods. The breakfast menu is nice too.","useful":0,"cool":1},"tSlqqNRQuN_UslWnObd-5A":{"text":"For some inscrutable reason, Yelp deleted my lunch picture so I removed that section of th","useful":0,"cool":0},"ceKsCgOvZlRwWUEUA_mULw":{"text":"Great pastries! It was busy and a little tough to get settled in regarding if we order or ","useful":0,"cool":0},"xs8R1IcopAh8ZWCtbuVUXQ":{"text":"This is one of the all time favorite breakfast spots in New Orleans. When I went, I shared","useful":0,"cool":1},"gVe8NHuCiqquAYF3iKBtjw":{"text":"The Cake Cafe is 2 blocks away from my apartment, which makes me only 2 blocks away from t","useful":0,"cool":0},"lIDPlRy6IixrUTdlXoRUEg":{"text":"Cake Cafe is great for classic breakfast dishes, their mushroom gravy and biscuits are ban","useful":1,"cool":0},"KhFy7p194KGy5gswySF6qA":{"text":"I stumbled upon this quaint little cafe on my morning stroll throughout the sweet neighbor","useful":0,"cool":0},"rgtWfeNcDMnYRe6o3SLGQw":{"text":"Fantastic food! (We got the crab omelette, which was FULL of crab.) Super nice service! Fr","useful":0,"cool":0},"pChjCnGMpWR2w53uX037ew":{"text":"Don't miss this spot before it closes!  We had a great crab, brie and spinach omlette, alo","useful":0,"cool":0},"uUbQCsHxiBvzg9tMILp-Kw":{"text":"The late breakfast of corn beef and catfish didn't disappoint. Ah yes and the fresh slice ","useful":1,"cool":0},"SqfuIArUaqWQ7wzIM5O6sA":{"text":"A family friend recommended this place for breakfast.  It is in the middle of a residentia","useful":1,"cool":0},"4v36gdxVqcllABNjWA8u_w":{"text":"Best breakfast in town.  We ate here twice in four days and we loved every bite! Staff is ","useful":0,"cool":0},"zx2j_p0DR6C1p59LnI1rnQ":{"text":"Every time we visit New Orleans we try to stop by here. Why? Because everything is phenome","useful":1,"cool":0},"S4PC-EY7VXAhDRIv5LDn4Q":{"text":"There's not really a dessert gallery directly in the French Quarter, but quick Yelponomics","useful":1,"cool":0},"iB1tPGjt3niSzGjK5gIGyQ":{"text":"Had a great breakfast here. Flaky, huge biscuits.  Meaty gravy. Rich cheddar grits. Fantas","useful":1,"cool":1},"xAmeTVz3LPFA6BcfGX-vsA":{"text":"This restaurant is the single handedly the reason I would return to NOLA! The crab omelett","useful":0,"cool":0},"ZVGTeMAX8W-bYxmLiUq8ZQ":{"text":"OmG I am in love with this place!!! I just went last week!! The line was out the door but ","useful":0,"cool":0},"ZFB1ppx6NPw5sKmZ5G4eFw":{"text":"By the time I got there they were sold out of the individual and scrumptious sounding king","useful":0,"cool":0},"doaEvX2T2bNa4wwE97RGqQ":{"text":"This place was a great find!  We came back a second time for the portobello omelet...the g","useful":0,"cool":0},"owuKyp7y7MQZFiynfCdzjA":{"text":"I went here for lunch a year ago and enjoyed a creative, fresh delicious sandwich along wi","useful":2,"cool":2},"ILONRuu7CWnQDcRR3KluUA":{"text":"I have been her twice in the last month, they are best deal in New Orleans! Great price in","useful":0,"cool":0},"A76XUduxEnNP_9yG3T3OqQ":{"text":"Amazing place. Skillfully cooked, original breakfasts for $10-15. They have a few tables o","useful":0,"cool":0},"44lNZmPPP6dIIvoJpo18PA":{"text":"Best damn shrimp and grits i had in NOLA. The biscuits i can live without tho.  oh and the","useful":5,"cool":1},"_7r7ph06YfUW1Gy1oqTsNA":{"text":"Breakfast or lunch, either is wonderful and goat cheese and apple King cake!  Their baked ","useful":0,"cool":0},"xXf-ocwM8RU2DWR0aUpLSA":{"text":"This is my favorite little neighborhood cafe! It's tucked away on a street just a few bloc","useful":0,"cool":0},"R4D3ql1E1p2UpI_hA7L-iA":{"text":"Food perfection. The Apple and goat cheese king cake is hands down the best king cake ever","useful":0,"cool":0},"n9ggBR9b8iLN-Ylf5PH8qA":{"text":"Fresh king cake! It was soft and buttery, unlike the hard as a rock crap from Cochon Butch","useful":1,"cool":1},"1RNDC3YTEGaSLGhS3PxF_Q":{"text":"Even though it is preferred on Yelp and has a long waiting list, you don't expect this pla","useful":3,"cool":0},"_sTJKLdSI391aWTxGDOMdw":{"text":"Ate breakfast here today. Food is great, staff is super friendly! Their iced coffee and bi","useful":0,"cool":0},"5bCO1jxrepCrPcZOd1jqxQ":{"text":"Greatest breakfast ever.  Sausage and grits amazing!  Catfish and grits- WOW!!","useful":0,"cool":0},"oY7CSi5BHN_i28jmqw7vWA":{"text":"This place is amazing. Amazing ppl. Amazing service. Amazing food!! Food came out fast and","useful":0,"cool":0},"02CHH-gnL7O-ZeZJh7HrqA":{"text":"Bakery we had was very good. Service and breakfast was just okay. We'll go back though and","useful":0,"cool":0},"nWyFstcTB3u5NL20T03WWQ":{"text":"Uh yum!!!! We had to wait a but to order but the line went fast and i SO appreciate that t","useful":0,"cool":0},"mS-MWtgfW-l90xlw4AzNBQ":{"text":"Great neighborhood locale and amazing, healthy food. The baked goods are ridiculously good","useful":0,"cool":0},"6GujtEl8woJw5wg7ZA7UNA":{"text":"Good food. The cake pastry is amazing!! Highly recommend. The mushroom biscuits and gravy ","useful":0,"cool":0},"Kxd-mPfPd4cuqMprqEocWQ":{"text":"What a wonderful place!  Great food and fantastic vibe.  The boudin and eggs were amazing ","useful":2,"cool":1},"6Aj6NSZTtI4Cy6IH3lqovg":{"text":"Excellent food and atmosphere.  Great way to start your day!  They have lots of great choi","useful":0,"cool":0},"IqBW4m5VriRYYJ3NqRkFNg":{"text":"I love to go here for lunch.  I have the chicken salad and it's so delicious.  The cupcake","useful":0,"cool":0},"bPgMcBtj2L6DFNkPjaC12w":{"text":"Surusly, peeps?!\n\nHad the turkey sandwich while ma boo had biscuits and gravy. Probably th","useful":0,"cool":0},"ungNb06qkRC_pJtUOVUbfA":{"text":"Ohhhh it's hard for me to review Cake because it's already been discovered by everyone. I ","useful":1,"cool":0},"MImacSMHCFhp6fkd5Wdl0w":{"text":"This is still my favorite breakfast in New Orleans but we only ate here once this trip. I ","useful":1,"cool":0},"VxX4vFWhXQvtt6emnYNSGw":{"text":"The service was great. Coffee was caffeinated. Shrimp and grits, otherworldly. Worthy enou","useful":1,"cool":0},"5cqaHwb7j5hbm0ochHIhsw":{"text":"Food was great. I love the location. Great for a quick meet up with friends! I ordered the","useful":1,"cool":0},"pkXO0Z0-jrsFeP1QA7SB2Q":{"text":"We wanted to try somewhere outside the French Quarter so we ended up here.  The food was f","useful":1,"cool":1},"fjAc3mOJg0E-ZVY24gDLKQ":{"text":"An easy walk from Quarter hotels, this place is a hotspot for locals, as evidenced by the ","useful":2,"cool":1},"qWMRUkft6K80Dp1UNm-pfQ":{"text":"When I travel, I depend on Yelp to guide me in the right direction when it comes to restau","useful":0,"cool":0},"SiIPj8XVW_8CuzWNSN353g":{"text":"My fiancé absolutely loved the vegan tofu pesto sandwich. My Costa Rican breakfast was ver","useful":8,"cool":2},"RGo1gtRlkWuw7Oh7ehVeHw":{"text":"After an early morning flight to NOLA, I was ready for a delicious lunch that would get me","useful":4,"cool":3},"csrW35a6GeecUeX6YWibqQ":{"text":"This place is fabulous!  Every time we come down here, we stay as close to it as possible.","useful":0,"cool":0},"h5q9t26pEtJFHesZzz3XaQ":{"text":"Best wings on the island, if not I've ever had.  Jambalaya and gumbo are amazing! Definite","useful":0,"cool":0},"qjFNkLtmpqXha9KT1wpgRg":{"text":"If they have the carrot cake cupcake with the cream cheese filling sandwiched between the ","useful":3,"cool":1},"-gVR4EvyL3-buXsbyeogjg":{"text":"I was referred to New Orleans Cake Café & Bakery as THE place I should order a cake for my","useful":0,"cool":0},"W0M75uvvtN5_bUL7YXVTqg":{"text":"I have never had a bad thing there... They even took a special order for a cake for my wif","useful":0,"cool":0},"W4TvnjFnp4mM5oC5-Qt7Lw":{"text":"BEST BAGELS EVER!!!  The cream cheese is also really nice!  I had the pesto flavor.  YUM Y","useful":0,"cool":0},"md4xQXhD8gJGVdsNhI8VKg":{"text":"It was a weird day. I wasn't feeling well, wanted to take a drive, get some food someplace","useful":2,"cool":1},"Z7S2DtNWwGqkQuq5hCCt9A":{"text":"Excellent breakfast and brunch in Marigny. Short walk from quarter for unique excellent fo","useful":0,"cool":0},"YAdDqbpLNdUOvXFJOyzx5A":{"text":"This is it. You found it. Look no further. Stopped in here on a Saturday morning before th","useful":1,"cool":0},"xP90MlCRs1D137cD8dBMXg":{"text":"BEST. BREAKFAST. IN. NOLA. HANDS. DOWN. Vibe - check. Portion size - check. Something for ","useful":0,"cool":0},"zC5L0ev5CZHIGUK0TUUkQw":{"text":"I can't think of a more roundly enjoyable neighborhood spot. The pastries are seasonal, de","useful":0,"cool":1},"D3R7d-rCVi1SWKaZU4R5_A":{"text":"I was really disappointed today with this place because the croissants I purchased this mo","useful":2,"cool":0},"cHXFZHBSkiLobmjxXFm5yg":{"text":"We took an Uber up to Marigny from our hotel to try this place. Everyone talked about it t","useful":0,"cool":0},"e1lDPcJ7LoiCQGj11yRVhg":{"text":"My absolute favorite place to get breakfast.  Everything is baked in house.  It's a very c","useful":1,"cool":2},"6wj4zQwWVdKwczq5mhQohw":{"text":"Wow Wow wow I have so enjoyed the goat cheese apple King Cake. I shared a portion but must","useful":0,"cool":0},"Lw6TmOaEH8_h8tlVY13caQ":{"text":"This place serves up breakfast the way it's meant to be eaten: with a cupcake. But no, ser","useful":3,"cool":1},"l7AdV-EuI9jpXVX3ccxjsw":{"text":"I visited this place 5-6 times over last 1.5 yrs. Never been disappointed. I would rate th","useful":2,"cool":0},"UoYI0B7nqfipCqcL0ENDlg":{"text":"The best cinnamon roll in the city. Seriously, I'm going to defend that statement.\n\nCinnam","useful":3,"cool":2},"crRAEq4o290JkBYyISQJ0g":{"text":"One of my favorite breakfast venues in all of New Orleans. An interesting combination of t","useful":2,"cool":1},"po6wVwNieRgq3cbAsZLOwQ":{"text":"The restaurant/diner is very unassuming and familiar. When you walk in you stand in line t","useful":4,"cool":1},"Ep4NJtYf4qyCOEYNp9leRw":{"text":"I stayed just down the street from this restaurant and I'm so glad that I did. The food wa","useful":0,"cool":0},"OsQI7-WlFdoBf6q5rbqmuQ":{"text":"this place has amazing cupcakes but HORRIBLE service. After leaving 2 messages without a r","useful":0,"cool":0},"b9jnmt0yx1yFzqE956cIRQ":{"text":"I've only had one dish here, but I can already tell this place is really at the top of the","useful":1,"cool":0},"ZFU3LX-TIWit4neNfVxAHA":{"text":"This place is just ridiculously good, maybe my favorite breakfast spot in the entire city.","useful":1,"cool":1},"CDdtSN5xyES-xlQzSz-5JQ":{"text":"I always eat the best food in NOLA! My sister and toddler nephew went after a youth run no","useful":0,"cool":0},"4bqGuYFsUqHaWnwmhFLZdg":{"text":"Having so many regrets after thinking of all the brunches I missed out on at Cake Cafe whe","useful":1,"cool":2},"Kw-I2BTbJC2cEj42U9NiUg":{"text":"Perfect little neighborhood joint.  I eat here regularly and haven't had a mediocre meal y","useful":1,"cool":1},"j0FKB4b4x-ojkVE8DHoMaA":{"text":"Very cute place to go for lunch! The place was pretty busy for a Monday afternoon. \nI got ","useful":2,"cool":0},"MK5qLw7mDjc3-XDGk5BwOQ":{"text":"This is a great local restaurant. My fiance & I went here for breakfast a few weeks ago & ","useful":1,"cool":0},"5-OhVlnuX2nAUbDOlwm7Dg":{"text":"I am obsessed with this low key place. Great veg biscuits and gravy... my favorite! Whenev","useful":0,"cool":0},"2A0ggNim2qmfxzkR_Ii3Jw":{"text":"my first experience with this spot was king cake at the avenue pub, delivered by chef ally","useful":0,"cool":0},"cCWYCbPy53x7BJ1PfDlzpw":{"text":"GREAT spot for breakfast!! The cupcakes are so so so good in addition to all of the wonder","useful":1,"cool":2},"Ev-DCwhbpbKqn1_42TlvEw":{"text":"Omg! So good I want to marry it! Their biscuits WITH jam were incredible and their corned ","useful":0,"cool":0},"FwzvVbKCvx2YyAXYpuNfgQ":{"text":"Food was absolutely delicious and staff were very friendly. Best breakfast in the city and","useful":0,"cool":0},"qduw3R3We83OGhD8HQxLkQ":{"text":"Is it a bakery, is it a restaurant, it's not a place to hang out and have coffee.  I have ","useful":1,"cool":1},"R5uJudF08iIZCb45cmshAQ":{"text":"Such a quaint cafe/bakery in a nice neighborhood. The staff was pleasant and even offered ","useful":0,"cool":0},"rCh8EvXvvasY1TVgI2BAog":{"text":"Great place to grab lunch and great energy. There cappuccino was frothy and honestly exact","useful":0,"cool":0},"Yxr862w5hFhWiqoj5BYGOw":{"text":"After seeing that the French Quarter Kupcake Factory had closed, my friend and I were desp","useful":2,"cool":0},"pE9LJtLKsxJSHyWT5vHxFw":{"text":"A great breakfast spot in Treme to start your day. This place was just a few blocks from t","useful":1,"cool":0},"CP8kxdEa5NofOeRipbJIJQ":{"text":"One of the best bargains you'll find in Nawlins. It's a small scenic, hipster, and intimat","useful":1,"cool":0},"k5NOiipVi8tbZMx5UTHvmQ":{"text":"This is our new favorite place for breakfast in New Orleans. It is quintessentially Bywate","useful":0,"cool":1},"WPzMc3xAxGqDchsXhhQOlg":{"text":"This was by far the best breakfast I've had in quite sometime. The place is nestled in the","useful":0,"cool":0},"_o71GCBgku39koIOB2IiVA":{"text":"Yo. Shout out to whoever makes the food here. Yes, the chef. Bangin'. Delicious. Slammin'.","useful":0,"cool":1},"SsoTrjCGQ4L7KVWoBQK5aQ":{"text":"I found this place searching on yelp for the nearest spot for breakfast for my friends and","useful":1,"cool":1},"cJzW0yMxconyr6V9crn6zQ":{"text":"This is a gem hidden from the French Quarter (just next door in Marigny) excellent breakfa","useful":0,"cool":0},"dAunngI5djdnPSzfC47sIQ":{"text":"One of the best meals I've had in New Orleans hands down! This cute little corner café tru","useful":1,"cool":1},"p5_IVX9tiMC715LBsjQtAQ":{"text":"The New Orleans Cake Cafe and Bakery was a mixed bag. On the one hand, the food was about ","useful":0,"cool":0},"CL2p271w6qyQvN2wAxvbhQ":{"text":"Have you been to Surrey's, Coulis, how about  Dick and Jenny's? If so, next time you decid","useful":1,"cool":1},"9_K5tsZvTbIUzcmqpz0yiQ":{"text":"Back for another super brunch and Cake!\nToday I had the the andouille and crawfish omelet ","useful":1,"cool":0},"7GCY1QzheGW8AZy2YsO3kQ":{"text":"I confess; I don't get out to the Marigny/Bywater as much as I should.  Other than the occ","useful":2,"cool":0},"B3H_auIN3ybVeuUKEEwjHQ":{"text":"Perhaps the best biscuit that I've ever had. Good coffee, grits were very good. The servic","useful":0,"cool":0},"eoVEhVD6uma0LkX2Z3aW0Q":{"text":"I had the veggie omelette and it was delicious! The staff was very helpful for us non-nati","useful":0,"cool":0},"tDI-K1s7HK84jrqWU9FBGw":{"text":"I only came here for a water and a baked good. The selection was sparse, I just saw cupcak","useful":0,"cool":0},"n9hv-07zMoNJzWttN1KKDg":{"text":"I wish King cake existed in the north! It was so delicious and such good brunch as well!","useful":1,"cool":0},"_Dsn_PWkSaOX_hd2Isah8A":{"text":"Rode my bike here with my sister and dog. We sat outside and each ate an ENORMOUS cupcake.","useful":1,"cool":0},"myaFI4uEEOv8-LkBIPU_Hw":{"text":"This place was straight up adorable. The decor was quaint and the service was full of smil","useful":3,"cool":1},"kVpnBnp0c19pVHYNEPC5BQ":{"text":"The avocado toast was delicious! Nice staff. Good service.","useful":0,"cool":0},"v21LkDwBM12ehyfbzNB8rQ":{"text":"This was a really nice breakfast spot. Service was fast, food was great, and prices were v","useful":0,"cool":0},"0Ab9JKhvsOdfubD9thTu5A":{"text":"Checked this place out because of the Yelp reviews and found it to be just okay. The menu ","useful":1,"cool":1},"g_3u-6tRsqKG0K1tQWxQaw":{"text":"Great vibe here, and even better food! Came here for the vegetarian/vegan options and they","useful":0,"cool":0},"_Rt-9Udn93AZiMtkj9ZeCg":{"text":"We had high hopes after reading reviews but left feeling a little blah... First, it was qu","useful":0,"cool":0},"chLDkBPWVO1ZcnzpgWlf8w":{"text":"Let me say I am a huge fan of corned beef hash, and having a fresh made corned beef hash o","useful":2,"cool":0},"rtBwkNB_NzUCGPW1iVZsGg":{"text":"AMAZING.....mad I never saw this place before, come prepared people! #NoGames Bythat I mea","useful":1,"cool":0},"Q3p7BlnWHFFDAZ30geH4_A":{"text":"Stopped for baked goods, ended up having lunch.  Crab sandwich with spinach, bacon and Gou","useful":1,"cool":0},"JrITdQRnTaEQ_mES2vQr8w":{"text":"I've heard a lot of great things about Cake Cafe, but nothing relating to vegan food, so w","useful":3,"cool":0},"MyTkhhOqsW3FpyRLfD6iqg":{"text":"Loved it!  Family had breakfast. I had lunch.  Great art on the walls. Decent prices. Can'","useful":0,"cool":0},"d3sFUsPpGsRKwBVrOOCt3Q":{"text":"My husband and I stopped in for breakfast our first morning in town and was completely ama","useful":0,"cool":0},"pLUpYy4cc8LF_fMhz9EP0g":{"text":"My friends got me a shirt from Cake Cafe before I had been there and on the back it says '","useful":2,"cool":1},"gvyu8zqarzHSJh7W-F0WQw":{"text":"This update is solely to tell you about their amazing King Cakes!\n\nYes, they still serve b","useful":3,"cool":3},"_rSFUL8YzbMwDYHfBPyd0g":{"text":"Nice ambiance and very friendly wait staff. I had the french toast and shrimp and grits. T","useful":0,"cool":0},"uDue0Qzn4MM8YKT1eTUJ2w":{"text":"Worst service in all of New Orleans. Dictator running the place was demanding that your or","useful":0,"cool":0},"AbdWknHJ1EzVYRRo3onAEQ":{"text":"Creative menu, friendly service, and great neighborhood location.  Highly recommend boudin","useful":1,"cool":1},"ATFtQCDXs9r0VBffAjIdcA":{"text":"New Orleans Cake Café & Bakery feels like home.⁣⁣\n⁣⁣\nThey have all your southern breakfast","useful":2,"cool":2},"Y0iHP5fbSIjkbxhoHfVDgw":{"text":"My group of four went to this restaurant for brunch on a busy Sunday morning. We were in a","useful":0,"cool":0},"uaU-jAeUdQ4XNJM70YDhLg":{"text":"Really enjoyed the experience here Becky the host was amazing and I enjoyed having my name","useful":0,"cool":0},"G5lFYgeevxM70VzatZ3gFA":{"text":"This cafe should be at the top of your list for carnival season. Their king cakes are amaz","useful":3,"cool":1},"8aSItelyn4XackTo4T9G2w":{"text":"This place was within walking distance to my Airbnb. First of all, the cupcakes were adora","useful":2,"cool":1},"x_d04Cepz7f3Ah7balpTXw":{"text":"Another cute cafe in Bywater.\n\nWe came in and got seated instantly.\n\nI had the biscuits an","useful":2,"cool":1},"sCQ1LTcNR0O2J72b7XRffA":{"text":"Best shrimp and grits ever.  Bonus - you can add a cupcake to your meal for a buck.  Worth","useful":0,"cool":0},"aEY0y0iob5xVIoG9mTtHjg":{"text":"Missing the best omelets in town. Please get to work on opening a new spot!! Sad sad sad w","useful":0,"cool":1},"wq_y6KU6tUL2JlTdot8r6A":{"text":"DO NOT WASTE YOUR $. I have spent hundreds of dollars here (while visiting my family) and ","useful":0,"cool":0},"qqMyitV3uhyVACkLnTc0LQ":{"text":"Well that's it, I like coffee now. I made it this far without caring for it, craving it, z","useful":5,"cool":4},"ZCNsbjomh-vQxxt7DKmRww":{"text":"Unpretentious, welcoming, delicious. The veggie omelet was one of the best omelettes I've ","useful":1,"cool":1},"9BU12NcC8lPKAfugtCreKA":{"text":"So far, this is my favorite breakfast spot in the city, and as a friend once told me, \"You","useful":3,"cool":3},"IgezpvZCXub4hrcHXgbaJQ":{"text":"Great place! Everyone was so happy. The service was great and the food was delicious. It w","useful":0,"cool":0},"gd60zdwNbPj_GDyEEGDZwg":{"text":"This was my first visit to New Orleans Cake Cafe & Bakery as I'd never heard of it and it ","useful":2,"cool":2},"XP4vT6p8M2mlZAWO34p9Yg":{"text":"A brunch wonderland - there are so many different options here. From omelettes/ eggs and b","useful":1,"cool":2},"qgny2Qaklc7C_-CMnQY6uw":{"text":"I love Cake Cafe for an out of the way brunch spot in the marigny! I've been here twice an","useful":1,"cool":0},"KcQLmHAeckvkeJx3334BUA":{"text":"Just goes to show you that one bad experience in the past shouldn't preclude you from tryi","useful":1,"cool":0},"G51y5kpwMOdciRk6kUer6w":{"text":"This was the least exciting brunch I had during my last visit to New Orleans. Because of i","useful":0,"cool":0},"jKgV0FfhbDgBXR5XFLVS3g":{"text":"Definitely a new breakfast spot for me! Parking is pretty convenient knowing that you're p","useful":32,"cool":33},"TcrLMur1RJvflALZNT5Y5g":{"text":"It is a bit Pricey, but the food is great. I like the dessert options. The crew was nice. ","useful":1,"cool":1},"qwWDE2JKK3fGi1b0Nzp15Q":{"text":"My go to breakfast spot in the Marigny. It's a casual corner neighborhood diner with count","useful":2,"cool":3},"m4Q3RLBWhqhr7xcWf07XVA":{"text":"Cupcakes are great! Biscuits are great too. The omelet I had wasn't the best.","useful":1,"cool":0},"sAP0YQqTj3Tp8ZLiBRRusw":{"text":"Mardi Gras tip:\nYou can buy king cake slices here. The goat cheese is pasteurized if you'r","useful":0,"cool":0},"P9nLiOW_4gZdRcB-G7bw5Q":{"text":"Love this place. Always end up getting the healthy grits, but everything else I've tasted ","useful":0,"cool":0},"_Jt37d9r-HhzQrXbVLiCpA":{"text":"The best breakfast I've ever had in NOLA!!!! Went here the wkend before Thanksgiving and h","useful":5,"cool":1},"_8wInXbnT0n_7u3vu9xIKg":{"text":"I passed this place the first time I was looking for it, because it seems very hidden. It ","useful":0,"cool":0},"Z9xCTS1iw-_tQP-ygGdyeg":{"text":"I was impressed by the reviews on here about this place so I decided to give it a try. In ","useful":3,"cool":2},"FfzLiff9rY1CGZaMR_OvTg":{"text":"Came for the boudin and eggs....left with a craving for more STEVE'S JELLY! The stuff is j","useful":0,"cool":0},"WnfLgWIHtb7u3z7BwJCWVQ":{"text":"The food is here really fresh and they have a small twist on everything they serve. The se","useful":1,"cool":0},"vYox2dhiUX2x7Qq6_kMzNg":{"text":"I really, really want to LOVE this place enough to give them five stars, which they richly","useful":2,"cool":3},"GmW02KxbuiMm8zO68detew":{"text":"It defies logic that I haven't written a review for this fabulous Marigny gem.\n\nI'm not su","useful":3,"cool":2},"Sb3sRp4uMQAOUpFeoSPQPQ":{"text":"The place is pretty and the menu is large. The french toast are so delicious but you have ","useful":1,"cool":0},"OExEZU75pOK65eRgcvEv8Q":{"text":"1. Bagel and lox - 4 small slices of lox just enough for one bagel not two.  Cucumbers and","useful":2,"cool":2},"1D8NalWCe_2q87vlCzCq4w":{"text":"Some places simply lend themselves to ease.\nThey beacon for you to pull up a chair, relax ","useful":4,"cool":3},"ff4EQLJNnSXybNYj9ckVOQ":{"text":"I wish I could pick up Cake Cafe and transport it back to my hometown. Yes, it's that good","useful":1,"cool":1},"r5Bz-cLVQz3QjCpDnQAZtg":{"text":"What's in a name? \n\nThat which we call a Café twice by another name would smell as savory.","useful":8,"cool":4}}