{"FvauifofPQOVozu8hT5mVQ":{"text":"Fantastic option for Indian. Generous portions, great naan, loved the curry. Can't wait to","useful":0,"cool":0},"i8bZr6aeFKm4TKXdhpdnmA":{"text":"Definitely Some Great And Authentic Indian Food In A New Convenient Spot In Downtown NOLA!","useful":0,"cool":0},"m4fLw1ABszSW9qK4jMk4CQ":{"text":"Wow usually don't eat too much Indian food but this place blew me away!! We got takeout an","useful":3,"cool":1},"jVZIqN-Vdu5hg5xzMNRMpA":{"text":"Haven't had Indian food this good in years! The lamb Chettinad was phenomenal. Spicy and h","useful":0,"cool":0},"Xfihjl1Ir2wKe6V87E-G9Q":{"text":"We look forward to dining at Aroma again in a few months. For now, they're really just rea","useful":2,"cool":1},"p-EphhlOkHjPXQiGvYRpOA":{"text":"Totally solid Indian. Veggie Pakora remind me of the ones Usha Sellers used to make (which","useful":0,"cool":0},"WxPL7IGk8K-z77Zfj9rvXg":{"text":"When we walked in, the smell of seasoning hit us. Like the name, the aroma was just amazin","useful":1,"cool":0},"LjN74Gh__bfgdhQcj_LqZg":{"text":"This place is relatively new and now sits where Subway used to be. What an upgrade! It was","useful":1,"cool":0},"kqE8sHYtmr4gCkp3bYAIMg":{"text":"I ordered lamb korma and garlic naan. Service was fast and friendly. It was AMAZING!!! It ","useful":0,"cool":0},"WGj9bSaBjAAg5WAtEeg_6g":{"text":"Highly disappointed in quality and tast.  Very small portion for the price you pay.  I don","useful":0,"cool":0},"SZSitVbw_KqWpas2BM82nQ":{"text":"This was a delivery order.  The tikka masala was great.  The garlic naan was great.  The s","useful":0,"cool":0},"K-hp3CxvLxNb4L8B6TmjPw":{"text":"I'm a big fan. I like my chicken tikka masala without pulp if you know what I mean. I'm no","useful":0,"cool":0},"RjiLHcKz2MbsL6iFUjaM-Q":{"text":"This place is amazing. The service is excellent, they are a bit slow, its to be expected j","useful":0,"cool":0},"2B8tmwXUVhT3ZCNpq2E0Gw":{"text":"I have generally been unimpressed with Indian food in New Orleans, but Aroma is different!","useful":3,"cool":2},"cWutecYVMr3MAZO-6zgSsQ":{"text":"The food here is soooo good! I've been looking for good Indian food here in the city for a","useful":1,"cool":0},"FoqR7DuEVF4sbjZCCn7N7g":{"text":"Food was AMAZING!!! Best Indian food in NOLA. Service was great as well. Will definitely b","useful":1,"cool":0},"Ogm1EWZj6ryPeeCnXhbG8g":{"text":"I am leaving this review because I would really like to see this restaurant succeed! If I ","useful":0,"cool":0},"3kLDB85PzYsMqWdQPCQxOA":{"text":"Omg! You can literally taste their love for food and all the detail that goes into their p","useful":2,"cool":0},"Sbj1xAEl7BTM6W30-1c0NA":{"text":"This might be the best Indian food in Nola. Won't recommend for sit down dinner but the fo","useful":0,"cool":0},"pQx3iKDlpFvZXPxpxBAFow":{"text":"Really hyped about this new spot!! I haven't found anywhere I really love for Indian food ","useful":1,"cool":1},"PkwkSoZgPEwThxWsANa38A":{"text":"They forgot to make our order. When I arrived, the worker at the counter had no idea about","useful":0,"cool":0},"DQB-phTuv5zrajvxYZOCyQ":{"text":"This new restaurant is a little hard to find on Claiborne, but it's a hidden gem! I've eat","useful":1,"cool":0},"IO2TcUml_Vx99f17_18JTg":{"text":"We've enjoyed Aroma in the past, but when I ordered on Waitr yesterday, they had the drive","useful":0,"cool":0},"pD6Awx_Gt5kLsHxDR8jtYw":{"text":"I'm an Indian food snob after a month-long trip eating my way across Northern India. Aroma","useful":5,"cool":1},"sGrOkpV-q_7HGKn0sZztew":{"text":"This spot near my work opened last week and my coworker let me snitch a couple of appetize","useful":5,"cool":3},"2ouJPHEirjo4qwznOhBkQQ":{"text":"I was in Nola for work recently and was craving Indian food. This place is the real thing ","useful":0,"cool":0},"D6ZBtpAfttdJKwYwCsilXQ":{"text":"Holy shemoly my lamb chettinad and cheese naan were amazing. The lamb was tender and cooke","useful":1,"cool":0},"R1f6XZ1HlXNPZSrQm9prqw":{"text":"My fiancée is from Tamil Nadu (state in Southern India) and was delighted to find that the","useful":0,"cool":2},"vE_vT1aBNzzcjsyLiFpQtA":{"text":"I have ordered twice from Aroma and both times were great. I have had the garlic naan, tik","useful":0,"cool":0},"MIbIhf2IwmTVgZiJFUX8WQ":{"text":"We had the garlic naan, samosas, chicken tikka masala, and dal makhani. Overall the food w","useful":1,"cool":0},"1TTCeDpX8-6OuBdf8An8eQ":{"text":"While the restaurant is located in an unlikely place, it is aptly named as the aromas are ","useful":0,"cool":0},"Grjh5kHP_xd56alAmZHSMA":{"text":"I've always been highly disappointed with the Indian food here in New Orleans, all the tra","useful":1,"cool":0},"oxUUoti6I7aDjG1fStX1uA":{"text":"Delicious! We were really happy that this place opened up. More good Indian near us...we h","useful":1,"cool":0},"ju3LRmG3AV09DjY50kpMSg":{"text":"This food is fantastic. Been desperate for good Indian food. I'll change to five stars if ","useful":1,"cool":0},"fd0t67j9UHxYMtU8YoA3ZA":{"text":"This is the best Indian food in New Orleans. Food is delicious. For now it's carry out onl","useful":0,"cool":0},"Wvgo0PfhQpE1kuGHxBIwXg":{"text":"This is some really good AUTHENTIC (No, Saffron doesn't count) Indian food in New Orleans.","useful":2,"cool":0},"jFyCsxHduhyoN4E8Qnrolw":{"text":"Well whaddya know - Nola's got OPTIONS for Indian food now! Imagine my surprise when I see","useful":14,"cool":6},"bQ7XQJF7gUIUAMaX_p2HBA":{"text":"The burst of flavors this meal was absolutely divine! Me and my friend ordered the shrimp ","useful":1,"cool":1},"M6OLUxEOlhV3yLkrM4qgsA":{"text":"Having lived in Chicago for years and being used to some great Indian food - Aroma has mad","useful":1,"cool":1},"fZ-W9OU67CL0htLhl8wHIw":{"text":"For the record, I am here on a Tuesday night. The window is open for takeout. However, the","useful":0,"cool":0},"78n1RXuGcB25giMhP9jxgA":{"text":"Nearby, affordable, and such a great taste. Though there are few Indian restaurants around","useful":1,"cool":0},"IH3HYM0Fa-w6Tth42WYDdQ":{"text":"Great Indian food. Prices are excellent, too. First order we had butter chicken, chicken g","useful":1,"cool":1},"slXKz9cCSMYQ1ZHUX15PrA":{"text":"Was traveling uptown to do some shopping and stopped in for the first time. The food was g","useful":0,"cool":0},"hqUrhp-l2XXQxhOMEc_r9Q":{"text":"I feel like I have gone here several times in this month... this food is so good.. I am as","useful":1,"cool":0},"wmZQP9WVoSJwaszUTYAo6w":{"text":"I've been missing good Indian food, and jumped at the opportunity when I saw the menu left","useful":6,"cool":1},"eEcVN7lwP4JgcnChqSI5_A":{"text":"This is my 4th time to order from here and they do not disappoint!! Easily my favorite res","useful":0,"cool":0},"Loef6zBjEiq9v4KKtKTdeA":{"text":"Awesome little spot in near Benz Stadium. When you get out of the car you can already smel","useful":3,"cool":1},"PSTcVKbVDF_b9jQNH4CGBw":{"text":"The most legit Indian food I have eaten in New Orleans. I ordered a couple of lamb dishes,","useful":1,"cool":2},"PaOYpT7kiBVOObLkF6vTJA":{"text":"Excellent food. Tried the spicy cauliflower, garlic naan, samosa, butter chicken, chicken ","useful":0,"cool":0},"HlOhuNN3yDQEEjfArc_O9w":{"text":"discovered Aroma through Uber eats. Ordered the Chicken Tikka Masala & garlic naan. Holy m","useful":6,"cool":5},"SN1BUZFnLMwuUiU1df5lrQ":{"text":"Aroma is an apt name for this fine little establishment. As soon as we walked in, it smell","useful":3,"cool":2},"H0-hk3ViVIrlMe4-SGyeyQ":{"text":"Food is delicious but the portion sizes are too small to continue paying $20 per meal. 5 p","useful":0,"cool":0},"J-jlY4AeOVvzpHs7tAZJMA":{"text":"We dined in at Aroma tonight and very much enjoyed the food. We started out with a brothy ","useful":2,"cool":3},"et4wKCJKAyqvc5lBfo4bOw":{"text":"Incredible! the finest Indian food in the City. Poor location is worth going out of your w","useful":2,"cool":1},"4N6clsLVKdfZ7dNpML33dg":{"text":"Best indian food in Nola. Super expensive though and do not offer dine-in. The butter chic","useful":0,"cool":0},"F6-lnIZs-maz7uFOpbXVJw":{"text":"I was scrolling through UberEATS when I saw Aroma listed as a new restaurant and clicked t","useful":4,"cool":1},"0aJZJH-X7qb0mxGbKlxtVw":{"text":"Been eyeing Aroma for awhile. Finally got the chance to try it out. Ordered online for pic","useful":0,"cool":0}}