{"pUU0hpnrGAnq3PM5Hyy0Tg":{"text":"I visit this McDonald's every weekend for breakfast. The crew members know my order by me ","useful":1,"cool":1},"CrftsNz3kLE1YFjJ5Mt28Q":{"text":"Avoid this place like the plague !! Cold food, nasty drinks and rude service 24/7. It need","useful":0,"cool":0},"4yEDVfREA9fxh6Qy-QXvUg":{"text":"Worst McDonald's ever!!!! I wait forever in line and when I finally get up to the window w","useful":0,"cool":0},"TfvQGSSR5t5c5JJ_tKGCqw":{"text":"Only been there one time . I had cold fries during a busy mid afternoon .  I will not retu","useful":0,"cool":0},"lNmHzQkJmJDafn4FXq40ig":{"text":"Worse mc Donald's in the nation. They have to do better. I been waiting in line for 30 min","useful":2,"cool":1},"ZFH74JqB1YRleCp8-iuTaA":{"text":"This review is not for this location but my love for a food item, the Filet O Fish. When d","useful":2,"cool":0},"5cUthy9wwBFZeU1V4y4iFw":{"text":"Some of the rudest people I've ever met. Went just morning through the drive thru & the la","useful":0,"cool":0},"hjIutvbpSzlwJLogiPW2MQ":{"text":"Just tried the new buttermilk chicken sandwich and it is excellent. The chicken was perfec","useful":3,"cool":1},"MiyrB9Ze_P9SF_G_5zrF9g":{"text":"Worst McDonald's ever.\n\nI've lived near this McDonald's for all of my life and can look ba","useful":3,"cool":0},"U-ZpGbgHox7-CL0TcJwSOg":{"text":"Slowest service I have experienced. 45 mins in the drive-thru. They have ratchet music pla","useful":1,"cool":0},"Fe52baiR90j1HlmQvXaCJA":{"text":"The worst McDonald's on planet and Middle Earth. But I have myself to blame. It's been lik","useful":1,"cool":0},"KijAJOIRDjpbNdXhuoAuSA":{"text":"This is the worst McDonald's on Earth. I've literally tried it three times and not once re","useful":2,"cool":0},"jz5OLRlBlbafyGFsrjamZQ":{"text":"I go to this McDonald's on Saturdays and Sundays. This visit I had to go inside and place ","useful":3,"cool":1},"IVQN_mk7yxNGsbRPc-Oe5Q":{"text":"Here right now I've been waiting 10 minutes and counting. Need I say more? This isn't just","useful":2,"cool":0},"gTxCdbM54gkVS1uaE3nDVw":{"text":"Everyone knows McDonald's food. The food is typical McDonald's, the service at this locati","useful":1,"cool":0},"KSceVj1xQ2QXU4EkEMuxsA":{"text":"The visit to McDonald's was bittersweet. I'm not a regular McDonalds eater. The promo for ","useful":0,"cool":0},"AFipT0EY8o5JudiYblrNig":{"text":"Smells like a homeless encampment. I turned around when I opened the door. Drive to Canal ","useful":2,"cool":0},"0L4iDF_Ic1HlPh0IhXzSfQ":{"text":"Didn't get my 1 crispy jalapeños! I paid 35 cents for this! Ridiculous! I don't understand","useful":0,"cool":1},"yVDUgsKjOzjQOLZJdctv9Q":{"text":"One of the worst McDonald's in the city. Service is slow and orders are always wrong, espe","useful":1,"cool":0},"Mq0KXAGUhrdXfX4HzQMHVg":{"text":"Seriously waited in drive through for 45 minutes then AND the food was cold. Lol. The lady","useful":1,"cool":0},"1ZTTKNOcm00L7MtEHuw1_A":{"text":"This place always says the registers are down at about 2 o'clock to who knows how long. It","useful":1,"cool":0},"l-_gkr4fJ9FvKXECOc9f8Q":{"text":"Can't make money if your 24 hour drive thru is never open. Fourth time I've tried to come ","useful":0,"cool":0},"IcPp_lbwNmzm3mIQWnBNxw":{"text":"I started this post about a month ago!This place is extremely horrible The drive-through e","useful":0,"cool":0},"9cnkfzZfXINoibrfCD4-Dg":{"text":"System down for 30 mins. Lol the manager said can't accept payments. Lol funny everyone el","useful":0,"cool":0},"XkpeH3phDB767_pcBdllTw":{"text":"Ordered through Uber eats, the order took a while to be ready. As it finally arrives we're","useful":0,"cool":0},"M4Q7PErTHojh4Vgcx5ACqg":{"text":"Literally the worst McDonald's ever. Ordered cookies and fries and got cookies.. they take","useful":1,"cool":0},"lyFCPWdrJSTe7_nc-EjIng":{"text":"Ok, this will be brief, hands down the worse Mc Donald's and McDonald'd experience I have ","useful":7,"cool":2},"KvGP8qZLohrQRc0XXaZykQ":{"text":"This McDonald's is possibly the slowest, least efficient, most depressing fast food restau","useful":0,"cool":3},"FBuZcXxU5kqRbqOqWsUhPw":{"text":"Let me start by saying I don't ever usually go to McDonald's because they always mess some","useful":0,"cool":0},"WgivIsLtcfGylIaS1qWVPA":{"text":"This review is for the drive thru, as we didn't venture in on this visit.\n\nWe arrived for ","useful":10,"cool":7},"KOuBdhsagB57W3awFoaFUw":{"text":"This is now my favourite McDonald's. It is a corporate location. Food was hot and fresh an","useful":0,"cool":0},"MOWX2RHjlEyJqBmtAThzrA":{"text":"this place sooo horrible from the backdrive thru worker whom has no understanding or brain","useful":0,"cool":0}}