{"U7hwhDfuixAhlt-73mgZaQ":{"text":"The best pizza in NOLA!!  Nice place to go if you are in the NOLA area and you love pizza.","useful":0,"cool":0},"1ylRBS6NMuizVicDR5G4vQ":{"text":"LOVE the staff and LOVE the food. every time I have my monthly dinner there with my boyfri","useful":0,"cool":0},"3XJEtSrV6EYUTxw2pxpKdw":{"text":"crust and variety of pizza options are decent. the caesar salad dressing is vinaigrette-ba","useful":1,"cool":0},"RZmdPXszZZlBL71UmXLnnw":{"text":"Omg! This place is amazing! You have to try their four cheese pizza! It's the best pizza I","useful":0,"cool":0},"ElICCtLkFvdHPF0AqMtBxQ":{"text":"Wheat Crusted Pizza cooked in a wood fired oven on the edge of the French Quarter. It does","useful":1,"cool":1},"K-4-RJnhVWL5WUk13BGo4w":{"text":"This is one of my favorite places to visit when I come to NOLA. But,  today,  the service ","useful":0,"cool":0},"ogHoHui0hKMRRo9u_BI0uw":{"text":"Everything is amazing yummy!!! Fantastic service! Great decor! Love it! (Bathroom is a lit","useful":0,"cool":0},"G9vOGeWvJquyyJNweephaw":{"text":"Definitely will be returning on our next trip to New Orleans! Had a caesar salad to start ","useful":0,"cool":0},"IA23_yEm9vMb4r50E-v7cQ":{"text":"Awesome spot across from  market street for great pizza. Crawdad pizza, check, eggplant pi","useful":2,"cool":2},"IsEtCHtRIr2VUl8bGkADwA":{"text":"This was unexpectedly wonderful pizza. The appetizer bread was cooked to perfection and se","useful":0,"cool":0},"5q0AnVjTlz-LVdGnv32EIw":{"text":"Good pizza, service and wine lost. Highly reccomend the garlic bread, suggest leaving out ","useful":0,"cool":0},"wYZUx-4KgSXQJtNoij_WnA":{"text":"UPDATE: I just ate here today and ordered the Wild Mushroom Linguine Pasta... FIVE STARS!!","useful":0,"cool":0},"WsdyAIoM0f1ncMJ3pvG5Cg":{"text":"Went last night with family and friends, had a great time. We havn't been in three years a","useful":0,"cool":1},"WqOduWVcEPdvYQUBBQE50A":{"text":"I enjoy going here often for lunch.  They have thin crust pizza baked in a wood burning ov","useful":1,"cool":0},"b54SvGs4eaUGLJWdaN4k6Q":{"text":"Had their fried oyster pizza, pepperoni pizza, mushroom stuffed ravioli, ceased salad, and","useful":0,"cool":0},"WTi1ZAOlutwseS0G12DFBA":{"text":"Surprisingly good pizza! Nice find!\nI half expected this to be a tourist trap given is clo","useful":4,"cool":5},"DVhzM2KcjAGCPsaQSWpVUw":{"text":"Had grilled artichokes for an appetizer and then a few pizzas.   Lots of garlic on the Roa","useful":0,"cool":0},"9SO1eH5gWyUm27zh81LR_A":{"text":"My whole family thoroughly enjoyed our lunch.\nI had the grilled artichoke hearts and spina","useful":0,"cool":0},"pzdxti65V_NZhKRfo4ajIQ":{"text":"Great food, nice clean and cozy atmosphere. Has both vegan and carnivore options which is ","useful":0,"cool":0},"7hDIVysz37XZOgpbwLjdPA":{"text":"Over priced italian. The pizzas are thin and only satisfactory. My draft beer was served i","useful":0,"cool":0},"f81o2UgHjX6_nBbsAkLeFQ":{"text":"My waiter Dustin was wonderful and my pizza was the best j have had in years. As a local I","useful":0,"cool":0},"Rp4W3X5bsYgWemEzdKWIkQ":{"text":"What an under-appreciated gem! Their pizzas are unique and always delicious; the entree sa","useful":1,"cool":0},"iX8ggqqeFcnnqG8VyOfCQA":{"text":"Amazingly good lasagna - some of the best I've ever tried. Excellent prices and great serv","useful":0,"cool":0},"IiousSFDWZnmoe3ArtOihw":{"text":"The only thing I do not like about the LPK is that it is so far from my home.  I live in D","useful":0,"cool":0},"jFlIrqa44xXOMkUEBXUFBg":{"text":"Sometimes there's a wait but it's worth it. The waiter offered our dog a water bowl and is","useful":0,"cool":0},"wU3qZ_VJypYd-oZ2i_aJWQ":{"text":"$12 for a personal pepperoni pizza?? Seriously? $10 salad? This place is worthless. WAY TO","useful":1,"cool":0},"VDaFkw4iJp1i6t2Hh2Qlwg":{"text":"It's a quaint place.  The service was friendly and courteous.  We split a Caesar salad and","useful":0,"cool":0},"819x4Rdvp6PIRhI1iBjQFg":{"text":"Loved this place! The pizza was fantastic. Must try!!!!\nThe Margherita Pizza and Pineapple","useful":1,"cool":0},"DLYSXA89UGOW7ZAwO-eW8w":{"text":"Good pizza, just OK service. The ingredients are fresh and the pizzas are much better than","useful":0,"cool":0},"F4P6BZJTYxoquQefL2DssA":{"text":"Food is very tasty with an eclectic menu that also includes basic entrees for simpler pall","useful":0,"cool":0},"8ntlxGFD4U8avWluYzUDOA":{"text":"Great place..... I had a pizza, open oven cooked   It was really cook to perfection large ","useful":0,"cool":0},"7mg48_ocb0tUdEeuumCdZg":{"text":"The pizza is very good but the size was way too small for two people.  We wished the menu ","useful":0,"cool":0},"YvN4x-xDazRDcFhPjkI-qg":{"text":"GF babes!! This is your place when visiting Nola. Come for lunch on a weekend or order tak","useful":0,"cool":0},"YsZJxBr8LMsKSBWrlNjYEA":{"text":"This is a perfect spot for a restaurant. It's right in the French market in the french qua","useful":0,"cool":0},"sSc_GEAXOv-nHr1VEojW-Q":{"text":"Solid pizza joint down near Frenchman. Had the prosciutto and egg pizza which was very goo","useful":0,"cool":0},"z7F37zop6ws18pl8BE7Yyw":{"text":"Authentic pizza with a gourmet flair.  Had to come and leave a review because I have a ten","useful":2,"cool":1},"zZI8RC259_Cz3GbKHfa84A":{"text":"It's often difficult to find a decent gluten free pizza.  The eggplant and pesto gluten fr","useful":1,"cool":0},"t9z53HBXBcszKrv6d49Ivg":{"text":"$12 for a personal pepperoni pizza?? Seriously? $10 salad? This place is worthless. WAY TO","useful":0,"cool":0},"1OPp9gbUIZ0wIYZ62uBNTw":{"text":"Close to the French Market and parking lot. We sat at the patio, literally on the street. ","useful":0,"cool":0},"ugVtPDIlJqArIT0_UVUhJA":{"text":"Great place for a vegan in new Orleans to eat at! They have daiya cheese for pizza and a n","useful":0,"cool":0},"lMs41HcZV60pc71PvK_OhQ":{"text":"Hands down my favorite Vieux Carre place to eat!  I have been coming here for years, and I","useful":2,"cool":1},"D6xh_ikFdmdxbygdRwvcrg":{"text":"Headed over to Louisiana Pizza Kitchen for their brunch a couple days ago. The Camilia Gri","useful":0,"cool":0},"VnU6thu2T8-TZM64X4WzSQ":{"text":"I will never come back here, based on the intolerable rudeness of the waitress.\n\nAfter wal","useful":1,"cool":0},"VNrJW4_GxJYWxQ0eudqITA":{"text":"Pretty impressed with the pizza here considering we just entered the restaurant because it","useful":0,"cool":0},"09AeTKkdr3k9noL4yj8ZyQ":{"text":"Just are and what a great meal it was a long walk but so worth it. I had the fettuccine wi","useful":1,"cool":0},"JjLQlTkOxvyOgg30oqAVqA":{"text":"Vegan and gluten free for those of you in need. Airy market side location.\nFood excellent!","useful":0,"cool":0},"D3lj__nsj9eGYfKaeWmvjw":{"text":"My wife and I stumbled upon this place when walking around the FQ. It was so good that we ","useful":0,"cool":0},"liIlq9pCOQG9Kr_JqxU6Cw":{"text":"Finally ... an exact copy of the best thin crust pizza in the world previously only availa","useful":0,"cool":0},"Geqh_6ngk7-09TbnhsXHlg":{"text":"We loved our dinner here. First off they have an amazing wine list. We started with the sh","useful":1,"cool":0},"LrtCde9ovhLQRfJHr15wew":{"text":"AMAZING black bean wrap!  Several dishes they can make vegan.  Willing to accommodate big ","useful":0,"cool":0},"LPkT-FAdhaP4Wxj1fXx8nQ":{"text":"Visited twice during this vacation.  Superb pizza, great wines by the glass, draft beer an","useful":0,"cool":0},"i_OUOHm6uPyGWrW_E6NOqg":{"text":"I've walked by here a million times- so sad!! It was delicious and our server was amazing!","useful":0,"cool":0},"PY1JQ7Huwwvw-vafE52rGA":{"text":"Fourth night in NOLA and the wife and I were in the mood for pizza.  We go out for pizza o","useful":0,"cool":0},"2PAB9cZ09JYJZ_-lrLIcVA":{"text":"Great pizza, service, and atmosphere! Definitely a place to check out. Casual yet classy!","useful":0,"cool":0},"ESKNIsKAYCHz03rLn138uQ":{"text":"On the way there now. One of our regular stops when in NOLA.  The A/C is awesome and the s","useful":0,"cool":0},"KQbCjnDkUjc4_SkKln7ZCA":{"text":"The service was fast and great. The food was even better! The pizza was unique and the can","useful":0,"cool":0},"mqok_nbj_errU9W8IeT09A":{"text":"A solid menu of options with good mix of pasta and pizza combinations. Wine list is extens","useful":0,"cool":0},"_Z8jmxwacr-gvJJ9mLOGuQ":{"text":"This was such a pleasant surprise!! We had a visitor with us who wasn't in the mood for\nSe","useful":0,"cool":0},"hyW28swqzEaULY9p4Ru_iQ":{"text":"This place has a large number of vegetarian options.  We ate the Greek salad and the Margh","useful":0,"cool":0},"yZIaBZucDyXKGo38YQk09Q":{"text":"During a visit to New Orleans, we decided to dine at Louisiana Pizza Kitchen.  Although th","useful":0,"cool":0},"OH0S2B27R6dywe-ZV7k-TQ":{"text":"This is a lively and festively decorated Place the food was fresh and full of flavor . The","useful":0,"cool":0},"aCkASQQq5yWJ00rGR5YiUg":{"text":"We were looking for a change of pace from all the wonderful Cajun food New Orleans has to ","useful":0,"cool":0},"s84hlk0B8EGS81rJB5UHwQ":{"text":"The eggplant pizza was delicious! Great place for vegetarians and vegans as well (they hav","useful":0,"cool":0},"-LEr_LLbOg49WI2WyVoMlQ":{"text":"My dad step mom and a couple friends were gonna have spaghetti last night at our friends h","useful":0,"cool":0},"PkJvbF9Lmrks2GFweCfeLw":{"text":"We grabbed a pizza from here for a late night snack after we took the steamboat Natchez to","useful":0,"cool":0},"FB6nZ_dxTziYT28dIEUR_A":{"text":"Just go and try it. This place has great pizzas and deserts. The price is more than fair. ","useful":0,"cool":0},"L41H85CjZZ00Hp3GZMrT_Q":{"text":"So many vegan choices that I ate way too much, wanted to sample them all. Started with the","useful":1,"cool":1},"8XOR-kSjvfronNgq1a6P0w":{"text":"This is a great little restaurant on the edge of the French Quarter! Service and food were","useful":0,"cool":0},"greUk6FZlzPg8x5OIbEmSw":{"text":"Oh my god, the gumbo pizza. I still have DREAMS about that pizza. Flavorful and not too gr","useful":0,"cool":0},"Xzp3fPM9rI5gS2tNFzAqiw":{"text":"Amazing Greek salad, so happy to see a list of healthy food options. Service is awesome :)","useful":0,"cool":0},"bUMvqZGaTJ2E7LqcEGpY5g":{"text":"Really nice staff and a good beer selection.\n\nPretty good, but not amazing, wood-fired piz","useful":0,"cool":0},"HCHMPW_gjp2FPDUhb_Y6zQ":{"text":"We ate lunch here and had wraps.  My wrap was a grilled eggplant wrap with spinach, roaste","useful":0,"cool":0},"sttkisb9aGaFtbu9MP4R1w":{"text":"Had the pizza bacon and the regular pepperoni pizza. I liked them both. The pizza bacon wa","useful":0,"cool":0},"cvSV6xcdr-HvGTu1LJly-Q":{"text":"Great pizza in a cool location.\nI had the procutto with with fig jam and balsamic, it was ","useful":1,"cool":1},"qK10DqxKNLdVM_hBy2OawA":{"text":"Where's the negative star button?...\n\n- The waitress (who's name shall stay anonymous) was","useful":0,"cool":0},"1YsIbi2exMORxSU9F7Y4bg":{"text":"Had to stay an extra day (due to weather delays) in NOLA so we decided to try Louisiana Pi","useful":0,"cool":0},"b4OnmDGyUOv5Lh5KGcK82w":{"text":"Amazing food that is both healthier and delicious. Using organic pastas and flour, this pl","useful":0,"cool":0},"nCaDkFzR4_ruBk02cEdSpQ":{"text":"Great pizzas, great wine list with interesting wines by the glass and bottle, great servic","useful":0,"cool":0},"jO3RvUWNTojp9AOzZ4fO-w":{"text":"After a walk through the French Market, we stopped here for dinner. We did have reservatio","useful":0,"cool":0},"Gnm0P_XMr5eyvVTVUBBJjw":{"text":"A satisfying outting.  We had the chicken manicotti - delish - and the mushroom fettuccini","useful":0,"cool":0},"SBzKtW9FOQWI0KaPFYxqsg":{"text":"Fancy little pizzas on crisp oven baked flatbread crusts. The wild mushroom ravioli are qu","useful":1,"cool":1},"vko8T4zGmvT3-lDX9Pvzmg":{"text":"Based on our one visit. \nNothing to negate so I had to give a five. \nAfter a busy day of t","useful":1,"cool":1},"uLUcMk8oU07t5yqY0ZrOMA":{"text":"This is what Mike H recently wrote to me... \"You obviously don't understand the concept of","useful":1,"cool":0},"qc_XR6dtJF8K3QkLfSc69A":{"text":"Really friendly service. Food out quickly and while hot.\n\nOrdered macaroni cheese with and","useful":2,"cool":1},"Fn8dEIYq9MhnoUpTHNWMUg":{"text":"Enjoyed the eggplant and goat cheese sandwich with pasta salad. Good service. They were fi","useful":0,"cool":0},"AWVDh4Jv_2O1nhp-WKDlnA":{"text":"I was not overly impressed, but I did not get pizza. I got a southwest wrap, and it was ju","useful":0,"cool":0},"1Na_yARlLdfF4tyddGxcjg":{"text":"Nothing much to say except I've gone here once and can't wait to go again. Service was pre","useful":1,"cool":1},"EGksT2BzwxrJ1lFrHpbi2A":{"text":"Our waitress was attentive, even though we were outside. The weather was great the night w","useful":0,"cool":0},"fi0m02CRFqlwjJv96lfyjQ":{"text":"We ordered the margarita pizza, 4 cheese , calamari and the Genoa! Delish! Best brick oven","useful":0,"cool":0},"9l0N3pboeopvIeNmsAijLQ":{"text":"There are three locations of Louisiana Pizza Kitchen (two in New Orleans and one in Baton ","useful":0,"cool":0},"c580wIf1hK7ZzBshXOqNwA":{"text":"Great ambience, awesome food....recommended for vegetarians.","useful":0,"cool":0},"5XlhuMaB4o9t0CbVvw8eRw":{"text":"Really liked it. Great server and delicious food. Thin crust, which is my absolute favorit","useful":0,"cool":0},"bUBB_b3OEYx-tVOtem0iCw":{"text":"The service here was great! Everybody was very knowledgable about the menu and helped us p","useful":0,"cool":0},"gb_Q5WYjNtMGpBd1gJ57-A":{"text":"It was OK. Staff was very friendly, but the pizza was very average. Our appetizers were on","useful":0,"cool":0},"Oso_GMq4Co0Z9KsIL7zhug":{"text":"Stopped in last night for dinner with some friends. We ordered three different pizzas and ","useful":0,"cool":0},"yi6u94_Zxv0MwYP6LneKoQ":{"text":"Amazing!! We had the jambalaya pizza!! And loved it. Perfect amount of spice and good serv","useful":0,"cool":0},"6qS8EgtsSE24LOjhWCpy8Q":{"text":"It's easy to forget how good a pizza can truly be when fresh ingredients and a little arti","useful":2,"cool":0},"b6ArK3r72au_jFx1NYKoIw":{"text":"UPDATE: I just ate here today and ordered the Wild Mushroom Linguine Pasta... FIVE STARS!!","useful":1,"cool":1},"hFAHAp-SCncFK951aMlepg":{"text":"Totally mediocre - Caesar salad and pizza.  Garlic shrimp pasta was under salted and room ","useful":0,"cool":0},"h7whyPa3XePakZTP6GlMUw":{"text":"Really great pizza!! I had the pepperoni bacon pizza & super delicious!!! I got my food qu","useful":0,"cool":0},"QW1o2bDG8tXlzRonfntXbA":{"text":"Stopped by here for a quick lunch.  We were seated quickly. Service was attentive.  Restau","useful":0,"cool":0},"Y7ZLcmYQrpRYxlNc93Qp2g":{"text":"The best Pizza in the French Quarter. \nVery Clean restaurant.\nNice relaxing ambience \nGrea","useful":2,"cool":1},"QG9pqtGEUGE9u0OflE36GQ":{"text":"Great atmosphere. Food had some minor issues. Gumbo was a bit salty. The chiabaatta garlic","useful":0,"cool":0},"uOWwah8S78ndJpkwW9xN6A":{"text":"I ordered this pizza through Uber eats. I didn't even think I was hungry until it arrived ","useful":0,"cool":0},"7XAT41eI1LsznDrZ9_9pjg":{"text":"Fettuccine Alfredo with their grilled free range chicken was amazing! I also got it with g","useful":0,"cool":0},"0LWzvqYYGGdstAuoqm9cIg":{"text":"BEST JAMBALAYA PIZZA YOU WILL EVER HAVE. So delicious and with way more flavor than the ja","useful":1,"cool":0},"L5XISd5FgZR0gne6mp9jAQ":{"text":"I'm like Sally in When Harry Met Sally.  That scene.  You know. Wink, wink, nudge, nudge.\n","useful":0,"cool":0},"Rd9ocNopCxTfzfr9yRIi7g":{"text":"Definitely gourmet and delicious. They even have whole wheat crust at no extra cost.","useful":0,"cool":0},"ImC-TzP6B5uyGlKnUg2iQg":{"text":"Small little Italian restaurant but was glad we found it.  Had to wait outside because was","useful":0,"cool":0},"cR6CFLxyKGMI8DciikXdcg":{"text":"Ordered from Waitr and it was DELICIOUS!  Got spinach salad with beets and it was fresh an","useful":0,"cool":0},"N43iwkg72ALL5sjA3-lA6Q":{"text":"Really good, fresh pizza and salad. Our server Joe was awesome! Also, they have AC which h","useful":1,"cool":1},"YxpT-LHNHF4y7uZ-aKr33Q":{"text":"Food is great! Had a caprese pizza. Very yummy and a brownie sundae. Really good! Waiter w","useful":0,"cool":0},"CTC32JvXlbohRIksy30U6Q":{"text":"Personally I prefer the uptown location but this one is excellent as well. Fresh ingredien","useful":0,"cool":0},"uONCXE88q3sUvl4uOaSy-w":{"text":"Pizza never disappoints. Crust is thin and everything has a nice oaky taste to it. The Haw","useful":0,"cool":0},"OT8yNfR8wBBsxK67-ORbWg":{"text":"We really didn't have a single thing here that we really liked, and we were a party of 14.","useful":0,"cool":0},"AV_CkEiE-DoHOBxflahoBA":{"text":"How lame am I for going to Louisiana Pizza Kitchen and getting pasta? \n\nI came here for lu","useful":0,"cool":0},"jNEHqir8yOIRGCeTPvAJCA":{"text":"Excellent meal! We had the blue cheese and pecan salad followed by the Italian pizza. We s","useful":0,"cool":0},"Un3u3ARlDlsuVbDEx2slrA":{"text":"Nice thin crust crunchy pizza.  Walking the French Quarter needing something to eat and dr","useful":0,"cool":0},"_f2AHeXNTFmVXTNe8hwRsA":{"text":"The pizza was absolutely wonderful! Ordered a smoked salmon pizza and was not disappointed","useful":0,"cool":0},"F3Y-VVN93RNQ21Y0YV_AtA":{"text":"Another visit. Had the greek pizza veganized.  Just delicious! The best pizza I've had in ","useful":0,"cool":1},"ZTQMokxgLfw8v_TXsuYTLQ":{"text":"Louisiana Pizza Kitchen was just alright. My friend and I were seated quickly and given th","useful":2,"cool":0},"LAcjzfWS5WyTXwmyWCCP1w":{"text":"My family and I found this restaurant while looking for a place to eat on Christmas day.  ","useful":1,"cool":0},"xHP5vYfmFymWAR9ch3INaQ":{"text":"Grace was the absolute  best waitress we experienced during our visit in New Orleans. The ","useful":0,"cool":0},"vnpetHE1mVJzJzLj_Oh3rw":{"text":"We enjoyed a pepperoni pizza and a sausage pizza. Both hit the spot and came out fast.  Th","useful":0,"cool":0},"qwWZ30W3rA5WfQQ8QXehtQ":{"text":"it was good pizza.  it was close to my hotel so I gave it a try.  Good service, slow kitch","useful":0,"cool":0},"L8ediFgXHax1s-a5vMRoIw":{"text":"Wow!  This was an awesome experience.  We really wanted good pizza and pasta while in New ","useful":0,"cool":0},"gM0ofbKqJSWNdsXwJj9C9w":{"text":"Jambalaya pizza was some of the best pizza I've had in a while. Great flavor and balance w","useful":0,"cool":0},"453acDhU9ZsQjcy85UtSAg":{"text":"We were pretty unimpressed with the pizza we tried. The prices seemed pretty high for the ","useful":0,"cool":0},"P1zx9YHos_pvmq6YhGa8dQ":{"text":"This place is GREAT if you are looking for cheap, delicious food with friendly service.  T","useful":0,"cool":0},"pMB4XGxL87Ldr2FRn-qoAQ":{"text":"One of my favs since I was a little girl. People say you don't go home to NOLA for pizza. ","useful":0,"cool":0},"lzx7AL03LdD_xSW8uWCjsQ":{"text":"It's tough to make a call on this one considering I was pregnant and when you're knocked u","useful":0,"cool":0},"MqEOSYfis_2Ixz0KlCeHRg":{"text":"All pizzas are individual sizes which makes it a little more expensive than you may antici","useful":0,"cool":0},"80ch4cC25sRC-fld4PIn-w":{"text":"So my husband and I go to New Orleans pretty often.  We stay in the Quarter and have our u","useful":1,"cool":0},"o2QBfpgBBbvxTKDpO8Zvng":{"text":"great pizza, and salad, and desert, and just what you need when you can't eat anymore nawl","useful":1,"cool":0},"2ZK6ZA_8a3arm5pUmGaj3g":{"text":"Got to eat the Jumbalaya Pizza it was sooo good.  The Cesar salad was good also.  The sala","useful":0,"cool":0},"y89xWwpe0GYJnt9o--Jjgw":{"text":"Stopped by here on a whim. By far the best decision we have made! Fantastic pizza! If you ","useful":0,"cool":0},"Chkz-u3eXPC3y_wMHbmYZw":{"text":"This is definately a unique pizza experience.  They try to do a very hard thing by couplin","useful":1,"cool":0},"TSVSUpP1d7Yi7aznS4ZvEA":{"text":"Did not attend me and my wife etc all. The waitress was snobby. My wife and I went to NOLA","useful":2,"cool":0},"S9uzN_4-7I_aBu7xlQhdUA":{"text":"Great place for super pizza!  Sit inside or out on the sidewalk for a great departure from","useful":0,"cool":0},"Pqq-5y0WXSbK3AxHhzAnSQ":{"text":"Cute little place on the very outskirts of the French Quarter across from the French Marke","useful":0,"cool":0},"upToDFSD3ejQsldEV0V1Jg":{"text":"I'll admit that I'm getting tired to Southern fare so I compromised by having pizza at Lou","useful":0,"cool":0},"C1Wf6nSmNUAheIUzP6C2Nw":{"text":"My husband had the jambalaya pizza and loved it, I had the four seasons pizza and it was j","useful":0,"cool":0},"gOCojo1hqc72EAMYdvdCVg":{"text":"Love this place. Wish I could give it 1000 stars. Ate here 5 nights in a row. Pizza is inc","useful":0,"cool":1},"ErJSwYSEqAOEm1pxeGkhNA":{"text":"New Orleans pizza lets me down again. \n\nThere are very, very few places in this city that ","useful":0,"cool":0},"L-VlsZ8Vi8eBDUmfihrHSg":{"text":"Fun. Prompt, polite service. Pleasant surroundings. Very clean. Fair prices. Hard working ","useful":1,"cool":0},"O4e9AWgQYmp3uXX_o7o0kQ":{"text":"The night we came on was slow and a little chaotic (3 large parties to tend to ... so glad","useful":0,"cool":1},"D-UtNNyHgSP2tBMVNmNcYA":{"text":"Small wait. Great meat, vegan and gluten free options. Waitress was knowledgeable and frie","useful":0,"cool":0},"iWhecRX4c5tvuHe8rEAl9w":{"text":"Drink menu really slim. The sweet tea.. YUCK, not sweet at all!! \nI ordered the Cajun shri","useful":0,"cool":0},"pgo5Jx-__PtqSjtwW1Z91g":{"text":"If you want a pizza,why not.it's baked fresh...can't go wrong here.","useful":0,"cool":0},"0cbSUJ6vVqyToH0fIJWPVA":{"text":"YUM!!! We ordered a few different wood fired pizzas to share. We stopped in because we hea","useful":0,"cool":0},"ShfAHjddCTfGdugTUP1acg":{"text":"Cute spot, close to the market! Pizza was delicious with fresh ingredients, they use real ","useful":0,"cool":0},"sWPFohcFdAR5xvgwsRvXuw":{"text":"This had to have been the worse service I've ever had. It started by them crossing our nam","useful":1,"cool":0},"O_AddT8H685Fsu4IExAuZA":{"text":"This is the second time I've been to the Pizza Kitchen. The first time was 1 1/2 years ago","useful":0,"cool":0},"3EpkJVizIZeLd0uU-06fgQ":{"text":"Been here a few times and the flavor has always been there. Anything I've ordered has been","useful":0,"cool":0},"WHzydqEWl6f1skmzMq-2MA":{"text":"Delicious! After eating a ton of authentic NOLA food, this was the ticket. Awesome service","useful":0,"cool":0},"LAcK5MKaO5-N4yeJR94zxg":{"text":"I had a better pizza at 13 on Frenchmen street, but my Margharita with fresh tomatoes and ","useful":1,"cool":0},"gFygXe34ESkPZ0xh3UcEGA":{"text":"I usually love this place. The pepperoni pizza is awesome, the greek salad with cherry tom","useful":0,"cool":0},"mKEJgTjhqbRm5HBzP94VIQ":{"text":"Let me start by saying i gave it 3 stars only because everything was ok at best. Service, ","useful":0,"cool":0},"BDjW-t_L4SdqgVHEs1QieA":{"text":"I'm glad we took a chance and stop by to check out this little pizza restaurant. We asked ","useful":0,"cool":0},"BaY9O78QZtejlJ1rytehmg":{"text":"The food here is outstanding! It took a while to get out food but it was Christmas so it i","useful":0,"cool":0},"cuCDqdv4ppcoO1Mzjcu3-w":{"text":"On my visit to New Orleans, I had dinner at the Louisiana Pizza Kitchen.  I tried the pizz","useful":0,"cool":0},"IHxJNCj88ryL03Knc2t65g":{"text":"The pizza is served in a personal size. I ordered the Hawaiian and it was so good; however","useful":1,"cool":0},"W_Hp8GutNVkwP1K1wPBazg":{"text":"My husband and I just wrapped up our second trip to New Orleans and we made sure that this","useful":1,"cool":0},"_ew6RC0EeCjOtidcf7nZNA":{"text":"Wow.  I had completely forgotten about this place and I haven't been in about a year!\n\nFir","useful":4,"cool":1},"B356kxLnCbz_cKD3HuuzoQ":{"text":"I was in town for a conference and had a taste for pizza. Louisiana Pizza Kitchen hit the ","useful":0,"cool":0},"sVgNw-Shs1oyHvL-dSbp-Q":{"text":"This was great little pizza place. After all the wonderful, but heavy, sauced dishes, it w","useful":1,"cool":0},"yRxdv90F77VN1CW9_-OAGQ":{"text":"My husband and I stopped in for a light dinner before heading to the jazz clubs on Frenchm","useful":1,"cool":0},"KfxKB93ojB8vWTtil0Endw":{"text":"Amazing food, super chill and our waiter was great! I loved the Italian spin on a muffulet","useful":0,"cool":0},"I-AP__zOIAoFCwqR8pwvwQ":{"text":"Great pizza!! Really impressed at the quality and freshness of ingredients used here. And ","useful":1,"cool":1},"xhnL435LnO_essPtVL8t7Q":{"text":"More than pizza! Red beans and rice, corn and crab chowder,\n\nI have to say that any place ","useful":1,"cool":0},"BYEA7fN0EigPGNqd5IiCWQ":{"text":"Why come to New Orleans to eat PIZZA?  Well this isn't just any old pizza that you buy by ","useful":2,"cool":2},"sBo8qe7EaOWGn7TBzZLAEw":{"text":"This seems like a local place.   I came as a tourist and was rather annoyed by the staff t","useful":0,"cool":0},"P0pY8eLX0Q2EN2ECWsdCkA":{"text":"A-MA-Zing jambalaya pizza. I would have never thought of that combination but it was out o","useful":0,"cool":0},"kfo_l_mQlog189oPpvEVDQ":{"text":"I really like this place. The pizza is awesome and the pasta + the calamari is to died for","useful":0,"cool":0},"yHju2Lihk9D9VlsKg5qSdQ":{"text":"Five stars!  Great atmosphere!  Fresh ingredients!  Wonderful pizza!  You can't miss this ","useful":0,"cool":0},"Sobb7VYIlwHmDedVMHhHgg":{"text":"Very nice friendly staff and good food. We enjoyed the Fettuccine Alfredo with chicken. Th","useful":0,"cool":0},"la1W9FOYSzpQghBmWb3eUQ":{"text":"We enjoyed a spontaneous supper here. The Caesar salad with prawns was huge, and delicious","useful":0,"cool":0},"nONgTsUvAVesdBQ2jTAMVw":{"text":"After a day on Decatur Street & the French Market, I found this place & had the Hawaiian P","useful":0,"cool":0},"lXT5XYPtG0WWGmeUOnZ_zg":{"text":"Goddamn, this place is great.\n\ni know this is hard to believe, but we weren't impressed wi","useful":0,"cool":0},"0CzdM6aywE9MZz9QP4wm4A":{"text":"This place has some of the best pizza I've ever had. We shared a pepperoni and mushroom pi","useful":0,"cool":0},"Q1ubadyFXlqCH1DWYxlMeA":{"text":"I RARELY - if EVER - give 5 stars. This place deserves it in all categories!\nService -!out","useful":0,"cool":0},"bGOsgUzpPN2gg79N2ALlQw":{"text":"The garlic bread is freaking amazing -- lots of cheese and garlic on perfectly crusty, fla","useful":0,"cool":0},"87ZiMhTSX4J2iBNkDejD2A":{"text":"So, Day Two of our business trip to New Orleans and we found ourselves down in the French ","useful":2,"cool":1},"CjPkcbn2O5g8uwbpzMz23g":{"text":"Had dinner here last Saturday.  Waitress dropped a plate and red sauce splattered all over","useful":1,"cool":0},"rQvuJxDUhWm5bshi_EoeYQ":{"text":"C'mon, I'm not eating pizza because its low cal. Give me a thick, chewy crust and somethin","useful":0,"cool":0},"cIfuL7sNWX7mA7kts24v7A":{"text":"This is a very narrow review but I don't care. If you want someone to dissect every part o","useful":0,"cool":0},"25_kkcWg1CO5SzNfIImWSQ":{"text":"Okay, We have been coming here for 20 years! Food is delicious, service great. We almost a","useful":0,"cool":0},"GKCeirfS-LeEo--uNP4ZwQ":{"text":"I generally only write reviews when I have an experience so terrible that I have to take t","useful":0,"cool":0},"YJdr-r5syNmKH1Aete0l8A":{"text":"Just what we were looking for; simple and good quality ingredients. Highly recommend.","useful":0,"cool":0},"YES72hOLN8WB09-ptHemyQ":{"text":"Playing off the famous California Pizza Kitchen's fame, the Louisiana Pizza Kitchen is a N","useful":1,"cool":0},"w2sfdVenj4ZQSEpNnjNI4w":{"text":"A friend and I sat at a window table here Saturday night and we both enjoyed the relaxed, ","useful":1,"cool":1},"zLoSAprTrzn0ucVSSmrw1A":{"text":"4.5 stars. I can't give it a 5 because a pizza place in France will always have my heart. ","useful":0,"cool":0},"TdgOPmLhR6g3ZizLjYlmSA":{"text":"We came here based on a recommendation from a bartender.  We tried two pizzas.  The crust ","useful":0,"cool":0},"AwvIlvueOw4YEVshvFn-dw":{"text":"pizzas were quite good but the crust seemed a little under baked.","useful":0,"cool":0},"cjanuWDcPqSfe1TVzAcglQ":{"text":"Went here for lunch yesterday. Food was really good, but the service wasn't optimal (they ","useful":0,"cool":0},"OA1G3FBBaYcn1NvLRWkZBQ":{"text":"Amazing vegan food,  all you vegans come here!!!\nService was great, fast and pleasant. \nDi","useful":0,"cool":0},"42YVxazLlPPZV1yZDol79A":{"text":"We ordered a spaghetti and meatballs and a pizza. The spaghetti and meatballs tasted and l","useful":0,"cool":0},"4TkiMrHq5R14GS2ZjFQvxA":{"text":"Nice place. No line, but we went on a Monday evening after the market had closed up for th","useful":0,"cool":0},"jinCw1R4lpx5YSaF6vPAmw":{"text":"Don't mess up and skip this place. Best meal we had in NOLA, and we went many places. Pizz","useful":0,"cool":0},"naSGyhc64G1HJk0DCJ-C_Q":{"text":"The food is tremendous and an ideal location at the French Market in the Quarter.  The sta","useful":0,"cool":0},"c42MjXDNz7huwJ2LIZB83g":{"text":"Soooo good.  I have had a dozen great meals in NOLA, but this was the best so far.  Get th","useful":0,"cool":0},"zrm_RuAxhoq6b7zYQQyIDA":{"text":"The first time we ate here about 3 years ago, the food was excellent, it was our best meal","useful":0,"cool":0},"jjaShREc6wC-PWFb9yrA-w":{"text":"Our hop-on, hop-off tour stopped right in front of this place, and the Tour guide (Chad) t","useful":1,"cool":0},"cKepeYQ-xWcHOwZJ-muMow":{"text":"Choosing a place that will make everyone in my family happy is nearly impossible. Luckily,","useful":0,"cool":0},"W2gS_mMFRBWKDKq2XhmL6Q":{"text":"This place is off the beaten path, but a good find. The pizza id's excellent thin crust.\n\n","useful":0,"cool":0},"FGUor21fQ9yoRflwUoPIcQ":{"text":"As someone that has grown up in a pizza restaurant, I would not give out this rating light","useful":0,"cool":0},"83lKQXachW-30OWrUkuUjQ":{"text":"Staff was friendly and seemed to be genuinely happy to have a conversation with us.\n\nWe or","useful":0,"cool":0},"GaE5vJfX8V_TDLEYS0Kn9Q":{"text":"After reading the many reviews, I decided to try the Louisiana pizza kitchen.   I was visi","useful":0,"cool":0},"p9wzXX3z5Ta1-2spFHK0oQ":{"text":"After 5 days of EVERY New Orleans traditional, signature dish, I needed to treat myself to","useful":0,"cool":0},"JIjfmYrJAwKFNVTvEtsGfA":{"text":"sooooo good! IMHO, best pizza in new orleans. on one day (wednesdays maybe) they make fres","useful":1,"cool":0},"01SfTe73nmrZitHe4727Bw":{"text":"If you looking for some authentic Italian style pizza, this is the spot to come to! Order ","useful":1,"cool":1},"1jOokRWR89Q8BsxTffgWrw":{"text":"Second trip to New Orleans and second time we ate here. The food and service are great.  H","useful":0,"cool":0},"mlV6Cc-9J8ko6ApOfZOfOA":{"text":"Lekker, maar ze kunnen duidelijk hun 'succes' niet aan. Langzame tot zelfs slechte service","useful":0,"cool":0},"3Zm6JgN3YRjBFU8J3tEtUQ":{"text":"Pizza was so delicious! Service though sucked. Waitress was rude not friendly at all! Awar","useful":0,"cool":0},"npoHaPz368uafv5POc0stg":{"text":"Well, I'm really picky at food, but Omg, this place is amazing, I tried the Crab and shrim","useful":0,"cool":0},"oTDoxgq4dYnvW91IFJN25Q":{"text":"If you want something a little more healthy in the quarter, try this place.  Plus you won'","useful":2,"cool":0},"0CipQNDEi4da68kxUndAdA":{"text":"I've bookmarked this place and meant to return for the regular menu for ages because I kne","useful":15,"cool":17},"t0wNZCArqRyLXMpjfi5esw":{"text":"Our first meal when we got into town wasn't as good as we had hoped. Our party of 11 came ","useful":1,"cool":0},"874CE1dKjF4ZPX3vaPvCYQ":{"text":"Ok this has been my go to place when I arrive in New Orleans. Good food, nice atmosphere, ","useful":0,"cool":0},"PPA781oXTT0yaXnpN-jlEA":{"text":"Walked by and it smelt amazing. We thought we would give it a try.\n\nWe each ordered a pizz","useful":0,"cool":0},"2OEI4wlsPtlUJq5ugK0WtQ":{"text":"Amazing.  Great food great staff.  Had the shrimp BBQ, the crawfish pizza and the shrimp w","useful":0,"cool":0},"R0cHzOp8szarAhNtqN_Gug":{"text":"Great pizza for a decent price, on top of friendly service. . Easily accessible on the str","useful":1,"cool":0},"r6xr5uRla_4B5dgtWIn9jA":{"text":"Great little casual lunch spot. Food is not fussy but always tasty. Wait staff is generall","useful":0,"cool":0},"93cmYFULLmbU4lygUTbX2A":{"text":"My boyfriend and I just ran into this place by chance. SO happy we did! first of all Emma ","useful":0,"cool":0},"PZG3XQpy4ADrmBEKW0rRYA":{"text":"Excellent, excellent pizza! Could not have asked for any better. Something like this is no","useful":0,"cool":0},"iQQMvkM4ZJpH0nJw8uj2aA":{"text":"Delicious pizza!!! Got a Hawaiian and loved the thin crust, grilled pineapple and the spic","useful":0,"cool":0},"bUWlx_4IfcjF1dKxAaQxPw":{"text":"Stopped in for lunch and had the sausage wrap. Soooo Good. Would definitely want to come b","useful":0,"cool":0},"EXYHmu7iwFaE86rXtJT2WA":{"text":"If your in New Orleans and willing to wonder away from Bourbon...try this place.  It is no","useful":0,"cool":0},"QqiOvC2OnohM3QtgntHgwA":{"text":"Best pizza since Italy. Thin crust and taster. Draft beer. Old New Orleans atmosphere.","useful":0,"cool":0},"TkDCH8ojCVWlMl5Aq3t2qA":{"text":"Great place for pizza and pasta. Definitely one of the best pizzas in the city. It's popul","useful":0,"cool":0},"28fLMK0ULpkeVs3KBHB2tg":{"text":"The only reason I'm leaving such a poor review is because of a cook behind the counter. I ","useful":0,"cool":0},"cWDSZq11w9DMW2lbzC-X-Q":{"text":"I don't eat seafood so I was thrilled to find a pizza place in the French quarters. We wal","useful":0,"cool":0},"bYwgJUpjItpf8yAawWBO9w":{"text":"No marinara? No tomato sauce? At a pizzaria???? WTF????","useful":0,"cool":0},"sRQifQ8iUWzcAqkik4hKUA":{"text":"We used UberEATS to order some grub from LPK and were really pleased with the speedy deliv","useful":0,"cool":0},"x6G4hs80PGdeoWrydE6Hqg":{"text":"Ordered take out. Pizza is 5 stars! Perfect wood fired crust. We had a roasted garlic pizz","useful":1,"cool":0},"OoCe1m8WNykdhhHxaijp7w":{"text":"Walk to the end of the French Market and this place is facing you across the street. I lov","useful":0,"cool":0},"JhaBYhLmCrrbmqtrEgBWPg":{"text":"My boyfriend and I ate there Sunday afternoon for St. Patrick's day, the food was not disa","useful":0,"cool":0},"rtC7t4HQEd_Jd2-qWKtNtg":{"text":"Good place. Reasonable prices thogh dishes arw a bit small. Pizza is good and I had the ar","useful":0,"cool":0},"KQx4g0KpCGjMKKHgaRus9g":{"text":"my .favoritist' place in New Orleans.  The toasted ravioli appetizer and the sun-dried tom","useful":0,"cool":0},"5aLRfHEBuYDM1EICN1kyKA":{"text":"Okay, why is a self-professed foodie eating pizza in NEW ORLEANS, home of some of the most","useful":0,"cool":0},"L2lNajbzidbtVqzjhmR0WA":{"text":"Well ... what d difference a year makes. Had the crab and artichoke pizza and the crab fri","useful":0,"cool":0},"G6y9_mji5J9-JMlms7EmJw":{"text":"Great price, quick service, great flavors. Pizza is thin crust, which had a surprisingly g","useful":0,"cool":0},"q8ViNihlCQCaHM3RFo9yFg":{"text":"Went there with a friend of mine and we were seated outside. Great atmosphere, good select","useful":1,"cool":0},"TEayxjFye14tioUKQyndSw":{"text":"Pizza was good, spinach and artichoke melt appetizer was amazing!","useful":0,"cool":0},"dxoIRIeo1PwW2HEvxuBU5g":{"text":"Maybe it's because I just like afternoon snacks, but I love the pizza here. Great beer, gr","useful":0,"cool":0},"uOJ_IRXmQ3CJv5GV7ZhHAg":{"text":"I can't believe I haven't reviewed them yet, especially since I've been frequenting this L","useful":2,"cool":2},"ERm7ZngRjij_moEzkvrHbQ":{"text":"The\nThin crust\nWood fired\nPizza is quite good.\nFive dollar glasses of wine on Tuesdays.","useful":2,"cool":2},"SnknDUwgnwpSiPL_i9Qy1Q":{"text":"Came in for dinner. We were sat down pretty quickly. Tight quarters inside but we were sat","useful":0,"cool":0},"Ojdw3ugsDVExS_0uFZUKjg":{"text":"This was the first time going here and as HIGE pizza lovers, we'll probably go back EVERY ","useful":2,"cool":2},"YH6J2QwQZp2jbNLiZdrcvQ":{"text":"The best pizza I've had. Aside from organic gluten free the taste is amazing. Great Italia","useful":1,"cool":0},"W9BlwXPz7hrF1vA_uElqpg":{"text":"Pizza and service was fantastic. Such a wide variety of pizza to choose from and all delic","useful":0,"cool":0},"gVv-eLcv9ncVd6Jb5mpaGA":{"text":"One of the few places in the quarter with vegan options AND huge bonus that those options ","useful":1,"cool":1},"IvVj3wJYMdTRC5905TKWqQ":{"text":"This place is a joke. Ordered food and they gave everyone their food but the one person wh","useful":0,"cool":0},"-ARpjLp0aS30hoOBpEQicQ":{"text":"Fantastic pizza! Also great red beans n rice and Greek salad. Mmmmm!","useful":0,"cool":0},"caogZR6hwnHTkH-AwFAZ-A":{"text":"After a very stormy and rainy morning, we were desperately trying to find a place to eat s","useful":0,"cool":0},"fQG4IUSvpZlwES0NAXGCoQ":{"text":"Great quirky place, top notch authentic pizza, love the hand tossed thin crust, service is","useful":0,"cool":1},"ff-D8bWwqfOcWw3KMUOm0A":{"text":"I had garlic shrimp pasta which was fabulous and the hubby got plain cheese pizza. His piz","useful":0,"cool":0},"ht-dXEcAsOsjPF4z8PSqHg":{"text":"Amazing specialty pizzas.  We had the Roasted Chicken Pizza and the Jambalaya Pizza.  Amaz","useful":1,"cool":0},"3x9Ciqxm4oXO1ffO4p0JAw":{"text":"This was the place of my bf and I's first date, so I will always have a soft spot for LPK ","useful":0,"cool":0},"zG3aEy58mtZ9veleVgx7LA":{"text":"Came here for lunch on a busy Saturday afternoon. It's a very small restaurant doing wood ","useful":1,"cool":0},"NTc2PeSb6XKyqqZ95Ly5ng":{"text":"Had the muffaletta which was okay although a bit salty. The pizzas were very good, the fou","useful":0,"cool":0},"HzVBJuCUao7C7XU1o45eRw":{"text":"Oh. Em. Gee. I wish that my stomach was large enough to have 2 dinners.  My group and I we","useful":1,"cool":0},"vy_kVjvye2XtXQZuO0WX6A":{"text":"Chanced upon this place on a warm afternoon, hungry from the miles of walking we'd done. W","useful":0,"cool":0},"LR0Tx9fgPBcFvDpen8kICA":{"text":"Would give a 6 out of 5 if I could! Best pizza we have ever had - the Little Italy was out","useful":0,"cool":0},"CcnK5F-es3ZwdkiklLWlhA":{"text":"Best Alfredo and prosciutto Mac n cheese I've had in a while. Make sure to try the sangria","useful":1,"cool":0},"x0X0UqE-MXh6bpaAUlvBFg":{"text":"Ended up here more by accident then on purpose...we had a planned tour at 8:00 on a Sunday","useful":0,"cool":0},"JZzd1Tj-yvxGeFoMfJ3MTg":{"text":"This place is awesome. With all of the good food in NOLA, I Always hit this place twice a ","useful":0,"cool":0},"64OoqAHm-rSRwwwUsV18Yg":{"text":"Overpriced pizza with hardly any toppings or cheese present.  Service was fine, no complai","useful":1,"cool":0},"Bt0xAA3DSXpgAnoPhMJ9XQ":{"text":"We didn't want seafood again so we opted for pizza. The pizza is really good. We took the ","useful":0,"cool":0},"hyYAqY3ejgnYCNBpCs70oA":{"text":"Great experience here.\n\nI had a pizza and salad. Actually the highlight of the pizza for m","useful":1,"cool":0},"XLs3Fwk3HprIehDrZEAznw":{"text":"We were in town for four days and wanted something different to eat on our last night that","useful":0,"cool":0},"8c47fUTiLf_oMcdAJfRwZQ":{"text":"Four seasons pizza from the Louisiana Pizza Kitchen.\nIt was nice but quite dry. The infuse","useful":2,"cool":0},"WHSPQPBGY9jpHZVAEvYLCA":{"text":"Great little spot out of the fuss of the Quarter. \nThin, crispy, delicious pizzas with hea","useful":0,"cool":0},"YPPwgS8mziym3k7hL-2gyA":{"text":"warm, friendly staff. Food was exceptional.  Homemade eggplant soup, calzone, fresh salad,","useful":0,"cool":0},"sCJIAbbLt6idB-bc88GRdA":{"text":"Found this place while wandering the lower French Quarter.  Have to say it was the best me","useful":0,"cool":0},"ZCuqcWDFxJjnEO0t7k22mQ":{"text":"I was in town with my family and we wanted to eat somewhere that served gluten-free pasta ","useful":0,"cool":1},"v_m-sbgO7hWNB4mHpgUbfA":{"text":"The wait was 25 minutes. Slow service and about 9:02 they decide to crank up the music so ","useful":0,"cool":0},"QMIiL_nWwL_-zcPSOLIfEw":{"text":"Pizza good. Beans great- thank you to the guy who gave me the tip as he left the restauran","useful":0,"cool":0},"ZvgBx3PeB0gmGgv8Ncreiw":{"text":"After seeing this place appear on a number of my lists of places to eat while in the Big E","useful":0,"cool":0},"q9AVhmfXfFgIhL6nZgr9ZQ":{"text":"Standard. Average. Decent.  Two of our four diners today ordered entrees that included shr","useful":0,"cool":0},"pmRc5i4BcYypdN9EnzTvNg":{"text":"Excellent food and great service even on Halloween weekend, the staff is friendly and make","useful":1,"cool":1},"kjYRV1pHDr7Vcb592Ni8-g":{"text":"Yummy! Great pizza and beer place, but my shrimp alfredo was the bomb. It even had a littl","useful":0,"cool":0},"jrA6Itp0YroVWvrXLkQkjg":{"text":"Just went to this place yesterday before returning to Los Angeles.   Don was our server an","useful":0,"cool":0},"zzQyrhr00SVbnpMpsWhopw":{"text":"We were starving after a little shopping at The French Market. And cold. So we stopped at ","useful":1,"cool":2},"SkMP49g0fcCMZOrP8u3kZQ":{"text":"Stopped in for a late lunch while at the French Quarter Market.  Loved the Pepperoni Bacon","useful":1,"cool":0},"JzGUOxFTuQ_xSAxZKW7bEg":{"text":"We have been here many times.  Stopped going because we felt rushed.  We don't want the sa","useful":0,"cool":0},"K8mVSnoMYUvIyYqCKv_V3A":{"text":"Had not eaten here since before Katrina. As good as remembered. Salmon pizza-lived up to m","useful":0,"cool":0},"6sTDQ0lF0pMYIo_cOhKk1g":{"text":"Gd food, service was great","useful":0,"cool":0},"IPfh97HmxIL81vobcgJtmQ":{"text":"It was so good we went back for lunch the next day!  Great, simple atmosphere.  Excellent ","useful":0,"cool":0},"_rNTx9nqSOK8X9Pkn0FH2Q":{"text":"Visiting New Orleans and was really craving pizza. I stumbled upon this place and gave it ","useful":0,"cool":0},"rgNOFfLXBv3g_qelro-M0w":{"text":"I have been here twice and each time I've been impressed with the vegetarian options on th","useful":1,"cool":1},"y046lqYYsnVkV0Z7esBMhQ":{"text":"I'm gonna go to NOLA and eat some. . . pizza? Ya know, that is NOT what I first picture wh","useful":0,"cool":0},"h8N8WYz2yEnRCuQIyGKWlQ":{"text":"This place was awful. The service was ok, our waiter seemed totally bored and was not very","useful":0,"cool":1},"4RA6qVna-HwKOveQ8eaXzA":{"text":"I was so excited to place a uber eats order for a special friend who lives in New Orleans ","useful":1,"cool":0},"7rL6gqsrz2-akDUD1KC8wA":{"text":"Crying Bc this was the best pizza I've ever had in my life and I live in California ;/\nGoi","useful":0,"cool":0},"sBySbz1Reng8kgQQiuruow":{"text":"Pepperoni Classic Pizza was delicious! Spinach & Artichoke Melt was good also! Good custom","useful":1,"cool":1},"WmIIr2cpWkb8witMRJNPUQ":{"text":"Decided to meet some friends down at the French Market for some italian food.  Really what","useful":0,"cool":0},"c5gXNkV_9SUDhkLHOISyYA":{"text":"Traveling with my two vegetarian daughters and this was a great find.   Excellent salads -","useful":0,"cool":0},"KttFS9XKH32xaSZa-gn64A":{"text":"After eating \"traditional\" food during most of my visit, I decided to get back to somethin","useful":0,"cool":0},"CzJl3nG13RfycOcXglT24g":{"text":"This is one of the places I feel is a must when we visit New Orleans. I have dined there d","useful":0,"cool":0},"YJd9xRlU8gKSRxSCPl_lPg":{"text":"Very nice pizza. lots of option , not a turist only place. Best choice for a nice not expe","useful":0,"cool":0},"uSZ8JzxNDgJXHdSyCP181w":{"text":"3 1/2 stars in my book. \n\nIf you're staying for awhile in New Orleans on vacation and want","useful":0,"cool":0},"Eom7v7tA_a-HRbVxq_T5MQ":{"text":"Stopped here for dinner one night looking for some vegetarian options in NOLA. Well, there","useful":0,"cool":0},"mMoqT9ECsnY6joRxSls3gA":{"text":"I was in New Orleans for training for a new job, I know, great place to have job training.","useful":1,"cool":0},"QFVn9DgFXmFwOi3H7vuM9A":{"text":"I had the roasted garlic pizza. Possibly the best pizza I have ever had. Wonderful atmosph","useful":0,"cool":0},"7c3pQiG4JpkHnq3QSzrNYg":{"text":"Place had some good reviews and hotel staff agreed the pizza there was pretty good, so 4 o","useful":1,"cool":0},"SUDIgIomoLr2f7-IouC-eA":{"text":"Great pizza but nothing I would return for.\nUncharming place.","useful":0,"cool":0},"Jn2_Cn8Qr00cNq4Ac57xUg":{"text":"OK, So I'm from Chicago.  We've got this connection with New Orleans, starting with corrup","useful":0,"cool":0},"nVvs_Sd2NqoKpt3UT-g2vA":{"text":"Just had one of the top meals of our honeymoon here in NOLA. Order the pasta bolognese and","useful":1,"cool":0},"hn2-qSjUJZg_LvdMsIEGUg":{"text":"I am so excited abou this place. My boyfriend took me here on a date and we ended up going","useful":0,"cool":0},"98m8HjKxs8Ca6lmQl6JJ_Q":{"text":"This is the sort of place I'll stop into if I'm in the neighborhood, but wouldn't likely g","useful":0,"cool":0},"yDsQMIv82eYgd1xLy2REDw":{"text":"Our favorite pizza during vacation.  We had the Greek salad, big and loaded with different","useful":0,"cool":0},"LZC9Fs2onEszFKTxkmFX-Q":{"text":"Food was great and a good selection of beers and wine. Be prepared to be served by buzzed ","useful":0,"cool":0},"GwjCUeW4Uym0iQWfiAlrvA":{"text":"Louisiana Pizza Kitchen is always delicious fresh and fun. They have daily specials as wel","useful":1,"cool":0},"fvGPAydhdRY5G1LjNXW5ig":{"text":"This is The Best Pizza in New Orleans. \nThe salads are fresh, calamari is yummy....we've l","useful":0,"cool":0},"AJvtgBrfX1EyU6JpFODX0A":{"text":"Swung in here randomly and it was the best pizza I've ever had. The breadsticks were amazi","useful":0,"cool":0},"MtU4zP-5BpwMIzl7_D_2mw":{"text":"Best food, been coming here for years.  One of the only places they have pizzas cooked lik","useful":0,"cool":0},"4WUC5HgkRTwScbhLXVx9JA":{"text":"I was visiting New Orleans last month and on our last night, after a long hot weekend of w","useful":0,"cool":0},"RHp0itwubYt-IEtaUq5uqA":{"text":"This is the original LPK and has been one of my favorite NOLA eateries of all time. I have","useful":1,"cool":1},"2ZBfKKxTLO6RG0pIcS0ysw":{"text":"We had an awesome experience!  The waiter, Edward was very knowledgeable, professional whi","useful":0,"cool":0},"faDMCfEKC6cu90JUcjEr7w":{"text":"Not quite as atrocious as Mona Lisa Pizza but bad enough not to go back. I tried the margh","useful":0,"cool":1},"lvNxMyhLsIUzD3VCnubiVg":{"text":"One of my favorite dinner places: food is always great, and the people working here are su","useful":1,"cool":1},"ymwk-4Zzgc4ALWNIPqxZ2g":{"text":"Ordered an eggplant pizza to go during late hours and it was done quick and tasted delicio","useful":2,"cool":2},"mADPpAze_NryyBM3VOXF1Q":{"text":"Baffled that this establishment has 4 stars. Order the garlic ciabatta garlic bread, chees","useful":0,"cool":0},"dI2IXF-8B988rGqcfjNW1A":{"text":"We are vegan and ...can you believe it? They ACTUALLY have VEGAN CHEESE! Of course we were","useful":1,"cool":1},"VY0fmZ0I6KbjO2NMLkmKeg":{"text":"Overall a good experience.  Had both the Classic Italian pizza as well as the lasagna.  I ","useful":0,"cool":0},"8uo1itNj6AmDFg-eWbp7sw":{"text":"I'll admit I was somewhat hesitant to dine here given my undying love and loyalty to NYC p","useful":2,"cool":0},"ZW5YScntEJF7qYmHSWWmuA":{"text":"The Jambalaya pizza was probably one of the best pizzas I've ever had! My husband and I wa","useful":0,"cool":0},"RtD1S1U9gwyuUomYRuQ3VA":{"text":"Pizza baked on a tortilla dough. Good ingredients, alittle pricey, more room to sit outsid","useful":0,"cool":0},"BppKUQV0t-mRpeQFFKvYnA":{"text":"Best pizza in the French quarter. Don't get the gluten free crust came out burnt and horri","useful":0,"cool":0},"GQwp2bJDK-KO-Tm2J_pJEA":{"text":"Great little pizza place, thin crust and veggies, delicious!","useful":1,"cool":0},"4KE-RrNSwzxP8wTIPFaKSg":{"text":"We come here every time we visit New Orleans, they never disappoint. We can always expect ","useful":2,"cool":1},"YSMJnKHnDTQYj1xePeA72A":{"text":"Great restaurant with good vegan options. Will def recommend and be back for more. At the ","useful":0,"cool":0},"lANCePpSB8zge0gRq2NbUg":{"text":"An amazing, creatively crafted, incredibly flavorful pizza joint. A great location right a","useful":1,"cool":0},"jN4XCZCMJsLq5J0i-_pTNA":{"text":"For years we've enjoyed this place for lunch, but about a month ago, something went wrong.","useful":0,"cool":0},"4cz2J2BwEt7n7gSUxZB40g":{"text":"Yay, this place has gluten free rotini pasta. The service...well our server was a little r","useful":1,"cool":0},"CYQt3psbt9ik_EOVj8HlLg":{"text":"This place was awesome! The atmosphere is very eclectic with a lot of cool art.  Casual an","useful":3,"cool":1},"5tWy8FaDRW8RlcT-a8lc8w":{"text":"Very sad introduction to new orleans. I was tired and ordered uber eats. The gumbo was ver","useful":1,"cool":0},"9pS_U4NinovoVrnPEyPOQw":{"text":"Jambalaya Pizza was great! Brick oven pizza with huge shrimp and sausage! That and a small","useful":0,"cool":0},"4O7iYkQKbE2HDAGm2W9ojA":{"text":"So, what's a trip to New Orleans without (drumroll, please...) PIZZA?! \nMaybe it's just me","useful":2,"cool":1},"liPUNRZNqKr5EU48VsoeCg":{"text":"I love reginelli's but i love this place just as much. If you want gourmet thin crust pizz","useful":1,"cool":0},"C5STxaMBKd9MBCIYWSoTSw":{"text":"Perfect...the service was fast food was delicious. We ate here last year and was very plea","useful":0,"cool":0},"Uqs9efYVX-p5o0sTuLDKoQ":{"text":"We happened upon this great spot years ago on my 1st trip to NOLA and it stood out as amaz","useful":0,"cool":0},"MIM_FokSirdhe_fM7V5J7A":{"text":"WOW WOW WOW. I consider myself a pizza connoisseur (who doesn't!) and this place lived up ","useful":0,"cool":0},"isLEVoq_LAJ0gs-OX65PcQ":{"text":"Excellent pizza. I visit this place often whenever I am in town. The service is always fri","useful":0,"cool":1},"nAxwY-wNr4i73YOUOTsVZw":{"text":"After many more visits some updated thoughts.  Service has been consistently good (with on","useful":0,"cool":0},"Wkjf0OJKNbw105jyW4WSbw":{"text":"Got the Jambalaya pizza. Really good! Perfect to split. Spinach and artichoke was pretty g","useful":0,"cool":0},"rauMLB_126gF8xtulAmdzQ":{"text":"If you want authentic bread pudding in New Orleans this place has to be number one on your","useful":0,"cool":0},"A5Mob8Wz2TmiBQbOhb7iXQ":{"text":"Pizza was mediocre at best. Crust was crunchy but center was soft and kind of soggy. Had t","useful":0,"cool":0},"AFz6QFGcU3e9-zrgIHIOBQ":{"text":"Love this place since its opening! Pepperoni Bacon pizza with Ceaser salad add shrimp! Too","useful":1,"cool":0},"0YXxI4wEbbjBb33R1nDszA":{"text":"This is a great unpretentious little spot with great wood-fired pizza, excellent salad and","useful":0,"cool":0},"se-vJ9p888E_CIgLkia_BA":{"text":"Tonight was my first time ever eating here but it want be my last i truly recommend this p","useful":0,"cool":0},"MLVinbF5Acb7_qX6e0ZwvQ":{"text":"The food is incredible!  We had BBQ Chicken Pizza and Four Cheese pizza and both were amaz","useful":0,"cool":0},"L-yeHm3rRglA8gz9SfwVJg":{"text":"Great pizza but small. My friend ordered a gluten free pizza and they burned it. They offe","useful":0,"cool":0},"uTNVHAmsmRHOq2J5GMAqFg":{"text":"Love pizza? Also love southern/creole food? You've come to the right place. My friends and","useful":1,"cool":0},"DdTl3DKU4BvLn8IpCvOZig":{"text":"Very good pizza! I love the thin crispy crust. It tasted very fresh. Will go back to try a","useful":0,"cool":0},"j_OwgL8xYECXTcTG7_AjcQ":{"text":"An Italian restaurant that has cool vibes and tasty food, nice team with positive attitude","useful":1,"cool":0},"HD0ZaGwtqkOZbYTycvNtVQ":{"text":"Went to the LA Pizza Kitchen for the first time since it opened years ago.  Is an excellen","useful":1,"cool":0},"ZjlcUz_4ouykAkhxRKcjww":{"text":"After many visits some updated thoughts.  Service is hit or miss at times. Expect a long w","useful":0,"cool":0},"kXnwOA_KVu35x3SLMDgu2Q":{"text":"Aaliyah was our waitress. She was excellent. I had thr crawfish calzone & it to have it sp","useful":0,"cool":0},"RYZB-Za_OmakHIHZzR_m2w":{"text":"This is a return trip pizza was delicious as usual this time I just had 10 in personal Piz","useful":0,"cool":0},"RnEL-bcPm8X72psloZqD_w":{"text":"Yum! This pizza was clearly wood or oven fired, delicious smokey flavor- delicious fresh i","useful":0,"cool":0},"LNo9H3g-4dAEu4OP0IyNUw":{"text":"I just ate here and the service was terrible! Our food was sitting on the counter for 15-2","useful":0,"cool":0},"DFiA6jv-E_FkQB8lONI_DA":{"text":"We ordered the calamari for an appetizer. I didn't care for the presentation. It was the w","useful":4,"cool":3},"lwus1vo9e9VmH-lpgAT-AA":{"text":"Delicious! Awesome casual French Quarter restaurant. I have dined here many times and  alw","useful":1,"cool":0},"P2YIdag-48MuRH-8_Mr_og":{"text":"Service was excellent, Lester made us feel quite welcome. We had a chicken pizza with arti","useful":0,"cool":0},"tuNONPwo45yr3FHNYcX7Bw":{"text":"This place by far is the best pizza I have ever had! Next time I am in New Orleans this wi","useful":1,"cool":0},"8xN6NURq2Nfnd2gm1DeX4w":{"text":"Returned today for lunch on a beautiful day.  The food, as usual, was very good.  Still th","useful":0,"cool":0},"tP9ow4T6yLPzW6vadhz3xQ":{"text":"Your waiter .. bald with beard .. very rude.  Rushed us and we had some questions so he fa","useful":0,"cool":0},"JLXdduvQHivyvaeJ_ZyAcw":{"text":"The BF picked this spot one night for dinner. He noticed it earlier in the day when we wer","useful":3,"cool":2},"bx_FnpJmLQiwIsgJW_iKoA":{"text":"This was my first visit to Louisiana Pizza Kitchen. I have to say, I wasn't disappointed! ","useful":1,"cool":0},"txZe7b8-czHIu9KdiHj7Yg":{"text":"Stopped in for lunch. Absolutely delicious food and great service. The pizza and meatballs","useful":0,"cool":0},"1srTnP5mCWE_QgOSgUG7kw":{"text":"Great Stop before the Krewe du Vieux last weekend! \nThe food here is really great! I had t","useful":0,"cool":0},"cNkhuSy8I1wC03h4aSqyug":{"text":"Best pizza I have ever eaten! My husband and our friends ordered 4 different kinds and the","useful":0,"cool":0},"5b_Qa5aLFqdjySu7UVdGjw":{"text":"Was impressed by the pizza and wine selection, but the real winner was the service! Nina w","useful":0,"cool":0},"tDaAUFqLlLBVc1kTE_LHIw":{"text":"Best gluten free pizza I've ever had! I loved the red sauce as well! I could eat here ever","useful":0,"cool":0},"uCtjBlT4Cd5rAQDhH20OpQ":{"text":"If you're ever in the quest for great pizza and you happen to be in the New Orleans area, ","useful":1,"cool":0},"YRU2GMkyo1G-vvmoyFPnWg":{"text":"Really unique pizzas! They put some thought into the combination of flavors. We ordered th","useful":0,"cool":0},"V8oDCqGahMQF5Nwj-F-aSw":{"text":"Great for vegans!\n\nWe shared a vegan chicken pizza -- southwest style with beans, avocado,","useful":1,"cool":0},"e25kAAZv7D5enDcZJZ1sXw":{"text":"Two was the best I could do, food was good. Service good.\nPolicy and customer service are ","useful":0,"cool":0},"p6kkNU--gN1fatVOfa6ADg":{"text":"Great Food fresh and the service is very good.., they keep up with you and keep the tables","useful":0,"cool":0},"LlAoGwzgpeoBGf5Z7QcsTw":{"text":"Without a doubt, NOLA has excellent restaurants ! But sometimes PoBoy sandwiches and fried","useful":0,"cool":0},"WnWtxRz86zflfhDAtPzCjg":{"text":"Great place, we had the grilled artichokes, Caesar salads d a pepperoni pizza. Everything ","useful":0,"cool":0},"ZY5jyn6NJAYyqQfEnZYLxQ":{"text":"So much potential. Maybe it was the time, around 4pm, but the service was sub par and the ","useful":1,"cool":0},"xbC5yEI86iq9pkDjuvwE9g":{"text":"Jambalaya Pizza was just ok, service was rushed and seemed annoyed after I didn't order al","useful":1,"cool":1},"LcV0m9sLt7kCZU5oC9_HZw":{"text":"Perfect...the service was fast food was delicious. We ate here last year and was very plea","useful":0,"cool":0},"ypmThwYaYpRRKT0w2_ctQg":{"text":"Louisiana Pizza Kitchen is our main foodie destination when we come to New Orleans!! \nThis","useful":0,"cool":0},"sWEwvwy2JeML_NYeOebyEg":{"text":"The service was horrific- he repeatedly forgot our order, had to ask for the same thing ov","useful":0,"cool":0},"IKETONkzW5X3jzYDyyOFPw":{"text":"Decent, every day Italian food. Unfortunately it was over shadowed by rude customer servic","useful":0,"cool":0},"cFr7jEHi-c2mjk7K5QRwOA":{"text":"Was getting a little tired of Cajun and seafood lol so we decided to hunt for pizza our la","useful":0,"cool":0},"le7YvSqWPj9cd0tVklTorQ":{"text":"Excellent pizza and service. Great place to sit and relax from a busy day of shopping.","useful":0,"cool":0},"7y8hJ0snuIX-caLWXr8OhA":{"text":"I think this was the best Caesar salad I've ever had. Pizza is right there too! Will defin","useful":0,"cool":0},"UIcnlDh7bNmN3SOeW1Dm4g":{"text":"This place was fantastic and the food was seriously out of this world. Everyone comes to N","useful":0,"cool":0},"JSnAL1fi3WbD83Zz5jNmRg":{"text":"1st time in NO..Creole gal from Los Angeles visiting.. Love Creole food.. Gumbo.. Boudin..","useful":0,"cool":0},"kMDfoHr4rZ5Ax01OgJtl_g":{"text":"Great service and they have gluten free pizza that doesn't taste like you licked a tree.","useful":1,"cool":0},"N1v3Chj1avpVmJD3JXXK9g":{"text":"Just love this place! Great location. We come to this place every time in NOLA and it neve","useful":0,"cool":0},"X2QZ1xD1pkbwrrbM5KJu1A":{"text":"i love wood fire pizza and this place didnt disappoint. friendly staff, they were quick to","useful":0,"cool":0},"ZXLMv0oCVRKp6P_E2jEgbQ":{"text":"Stopped in here for a late lunch because it looked like rain and also because we were hung","useful":0,"cool":0},"LLsaCYJbGR8-9urfrcYWnA":{"text":"Nice restaurant but the Louisiana pizza kitchen in uptown is way better - and cheaper","useful":0,"cool":0},"dTmn0TlhIaMt29JLmFWZWw":{"text":"Drink menu really slim. I order the Cajun shrimp pasta.. I Love spicy Cajun food. However,","useful":0,"cool":0},"ldz8vW58qmY6Wjs3jPm19g":{"text":"I hadn't been here in about 10 years. I used to love this place. We went back today, and i","useful":2,"cool":0},"LLDgAZ3Y3Kf9WkxJ64JjQw":{"text":"This is the second time I've been to this place. They have amazing brick oven pizzas. Lots","useful":1,"cool":1},"8w54CF9LmRSt2Wy48I-E5Q":{"text":"Located at the end of the market, so it's away from all the crowds & tourists.  Excellent ","useful":0,"cool":0},"HgF5AyZ1aFMPLT9K3e7WFA":{"text":"Went here for a quick bite to eat before a ghost tour---most other places had a ridiculous","useful":0,"cool":0},"VpZnzNgfNKXDysF5nLq88Q":{"text":"I was feeling extremely lazy and decided to place an order for pick up. It's about a 5 min","useful":3,"cool":2},"rDB1qmJtlN_0T_CDgn0NQA":{"text":"I decided to have dinner here, I really enjoyed the smell coming from the kitchen.  I orde","useful":0,"cool":0},"DoXn6_YrecvtE_Yto1ohFw":{"text":"I have been coming here since I was a kid. I moved away a few yrs ago. Went home last week","useful":1,"cool":0},"HDEt684jAKs3j7AIs9o3XQ":{"text":"Very clean, which is a plus in N'ola. The food is very tasty. We had the spinach salad, mo","useful":0,"cool":0},"yBv9xckCZxQmvFKCm31giA":{"text":"Delicious gourmet pizzas and the sausage sampler appetizer is divine.  Service is good and","useful":0,"cool":0},"Ek2y-p1Zxdh0r4T4vtIrVg":{"text":"While I was visiting New Orleans I was able to stop and eat at Louisiana Pizza Kitchen.  \n","useful":7,"cool":7},"yUuVO056wsRJuKwB68Z5tQ":{"text":"Had a late night pizza craving and Louisiana Pizza Kitchen didn't disappoint me. I ended u","useful":0,"cool":0},"X1pyJahu11ylQD0UkqhJHA":{"text":"Omg. What a surprise. VEGAN food and so dam yummy. Vegan chicken, cheese and even gluten f","useful":0,"cool":0},"WdT8lYSqdNsB0MB1su1yxw":{"text":"Dirty silverware.  Friendly staff.  Good food.  Two out of three, not bad.","useful":0,"cool":0},"vi522AivYnGuXuJ4L7sYeA":{"text":"Terrible service. I have been to this restaurant a few times and the only reason I have ev","useful":0,"cool":0},"DZidyD7jOq41eYlTLO_2LQ":{"text":"This place was great. We had the jambalaya pizza and crawfish pasta. Both were delicious a","useful":0,"cool":0},"6zwMw3dHw9CEiJZldmXy8w":{"text":"Great service, but pizza was not what we expected (coming from new york)\n\nGot a spicy Marg","useful":0,"cool":0},"7sCyEwCI3LWBy38R9nU2KA":{"text":"I have been avoiding this place because there is so much great food in New Orleans that I ","useful":0,"cool":0},"oWi_cDw6JsJ3rhIP-dWpoA":{"text":"Poor service. The kitchen can't keep up with moderate backup. The manager is an affected m","useful":0,"cool":0},"YM9AAfT43mqtkNoFEJ07cQ":{"text":"A good selection of toppings, including local fare like seafood and alligator sausage, a c","useful":0,"cool":0},"lR_GwUQe1-RlMNH6GSLUdg":{"text":"we sat outside, and were served immediatly.  my friend had the three sausage pizza, with a","useful":0,"cool":1},"cXV4ktG0hYpNgjgBrNnLPQ":{"text":"Excellent restaurant! I wish I would've taken more pics of our food because it was delicio","useful":0,"cool":0},"sr1CNWHOOhK4PEd-UNsOtg":{"text":"START WITH THE CRAB FRITTERS! You won't be sorry. It is honestly just a big ball of crab f","useful":0,"cool":0},"stAN-txKfpdqZNSWSWvwNQ":{"text":"Very good pizza, crust was perfect coming out of the brick oven. Inside was a bit small an","useful":0,"cool":0},"PADbWrC3UjmmIAoV12lbXw":{"text":"Vegan options and draft beer pitchers.  Across from French Market.  Good service.  Thin cr","useful":1,"cool":1},"lhBpf8q9fkdA1f__G5Nnhw":{"text":"Fantastic marinara sauce! This is more American pizza than Italian style pizza. I got the ","useful":0,"cool":0},"Wymrq-MYX1GObQg2rZmDFw":{"text":"Ahhh Louisiana Murder Kitchen.  Love the pizza here, but you won't catch me wandering into","useful":1,"cool":1},"a7z4KFzavSegBid7F9LHMQ":{"text":"Got a delivery on UberEats by just picking from the \"popular's menu\". Pepperoni pizza was ","useful":1,"cool":0},"-zT-Bc9tJr16jzyhuf0Z4Q":{"text":"Went a few years ago on Halloween,\n\nHands down... the best shrimp and corn grits app i've ","useful":1,"cool":0},"QysUd6CcgWkkhPYpj4XYRQ":{"text":"Great little find after wandering the French Quarter!! The pizza was fresh and I love the ","useful":0,"cool":0},"HEm8ko8AlM7lgV4odjoNgw":{"text":"After our 3 hour city tour our tour guide recommended this place. We needed a little break","useful":1,"cool":0},"rTK8NHmXBMme_PfL73lt_A":{"text":"After many visits some updated thoughts.  Service is hit or miss at times. Expect a long w","useful":0,"cool":0},"R8EyyQQM7C8eYxkFKw3axg":{"text":"Awesome pizza !!! Omg !! The olive oil and parmesan  on top was perfect ! Excellent servic","useful":0,"cool":0},"ztjMTNO3yAqW8W2wve7XAQ":{"text":"This pizza gives me LIFE. Ive traveled all over and I can promise you this is the best piz","useful":1,"cool":0},"3fS88v8b7qQMa3Bkw8oZ6g":{"text":"Yummy pizza!! We ordered the Margherita Pizza with Pepperoni and the pepperoni pizza. Both","useful":0,"cool":0},"xAPbmC3PsDEAXWbc82XDkw":{"text":"With all the other great food in New Orleans I would definitely pick somewhere else.  The ","useful":0,"cool":0},"kokLHdj-Jg3e_KT8-w-mQQ":{"text":"It was Thanksgiving weekend, 1994.  My three brothers were off camping with our grandparen","useful":1,"cool":0},"g3_VJc85Bn9QZiGAHKrQ0A":{"text":"The pizza was awesome! We ordered the Artichoke appetizer, really good but tiny portion. S","useful":0,"cool":0},"A09YjQpASqckP5MppMjGYg":{"text":"The Wild Mushroom Ravioli are something not to be missed. We tried the Four Seasons Pizza ","useful":1,"cool":0},"VCirS2R2uWRVDbffLnnuEQ":{"text":"On October 4, 2013 My husband and I were in town for our annual visit and could not wait t","useful":0,"cool":0},"0gm3LiRV3Cf-jgbvWyCGxQ":{"text":"Great pizza, friendly service. Quick, too. Delicious. They have pasta dishes, appetizers, ","useful":0,"cool":0},"5KdQtFM532rmD7QXTv65aA":{"text":"Great thin crust pizza! And the waitress was so nice! We came on a Monday night and were t","useful":2,"cool":0},"OKJQzzbnAo1-aYuK-R47Fg":{"text":"Walking by late one evening and saw this place off the Main Street. We're about to close b","useful":0,"cool":0},"OoA4Qd1X4b596OhrtDHniw":{"text":"I've had 5,000 different versions of fettuccine Alfredo in my life, this was the best I've","useful":0,"cool":0},"1t2k_Y7hDGpFQD04_K8rLA":{"text":"\"Pizza pizza\"\n \nThis is always a stop on my trip the NOLA. Usually lunch is a great time t","useful":0,"cool":0},"_0Lvf8A8OQMA_I1eJcoEbA":{"text":"Order this one afternoon for lunch through DoorDash and omg was I disappointed and disgust","useful":0,"cool":0},"WwIsfuZjufzh69U0VOMp0Q":{"text":"I've been eating here for fifteen years at least. The service is impeccable. The dining ro","useful":0,"cool":0},"c9SUo9qNsDKK9SUR9SwNaw":{"text":"This is so much more than pizza.  We didn't even have pizza.  This is a little slice of de","useful":0,"cool":0},"hLHTQm7X-VSmEVnAyYwbAw":{"text":"After a gluttonous weekend of eating in the French Quarter, Louisiana Pizza Kitchen was a ","useful":1,"cool":1},"K2Wa3gQAWwk6FjUUs3dVcw":{"text":"Best crust I've had in a while. Delicious sauce. Pepperoni tastes fresh, scrumptiously her","useful":0,"cool":0},"RvFQEDVQRNj1aeK4iEB1nA":{"text":"4/2021- ordered a GF Margarita pizza w chicken.  Pie came no chicken.  Waiter returned w c","useful":1,"cool":0},"aSy0WFyta-nr5LF2pvM4Gg":{"text":"This was my first time trying this place and It was a great experience. I plan to try it a","useful":0,"cool":0},"0B2_LV8e79D8B5HNzjsfkw":{"text":"It's honestly hard to find good pasta in New Orleans. Don't get me wrong, the Cajun food i","useful":0,"cool":0},"Y-SQjc6wF5WXd43iqkmWGQ":{"text":"Served an impressive size delicious veggie calzone along with fried calamari that would br","useful":0,"cool":0},"TU8TJfuv1AEMvXko5OOcOg":{"text":"The Hawaiian Pizza here was the best pizza I've ever had In my life! Everyone was eating m","useful":0,"cool":0},"DVWrD6y3urXiLZTPBiV-9A":{"text":"I had discovered this little French Quarter gem while make my foodie bucket list for my NO","useful":0,"cool":0},"rNskjMVuAvNUkWzd9UqH6Q":{"text":"We came here while on vacation hoping for amazing food like we had everywhere else in NOLA","useful":0,"cool":0},"TnHswgml3v3lvaF48bUkSQ":{"text":"Pizza was amazing and I didn't have to add any seasoning to it. The waitress Aaliyah was a","useful":0,"cool":0},"v8R6q9cuRPDAPhqwuThHqQ":{"text":"We stopped in late on a Sunday night and we were pleased that they were open. They were no","useful":0,"cool":0},"3pF0xUZOjdej5Qy_EiAahg":{"text":"We ordered the crab meat and shrimp pizza which was cold when we got it. Otherwise it was ","useful":0,"cool":0},"m8S9WtUgJ59RaX1k_qslwg":{"text":"Beautiful place that we sought out because one child wanted pizza amid the varied Lousiana","useful":0,"cool":0},"20CgbXMoO4uqoyBgxWRDGw":{"text":"Y'all-do better please. I am a regular and rave about the chicke Caesar wrap and tell peop","useful":0,"cool":0},"ahaSP3q5ubNlcomYJXqQFg":{"text":"Im all about finding hidden gems but this was not it..  Horrible service located in a not ","useful":1,"cool":0},"Y_QX7vxPcw2JMbssO0oTUw":{"text":"I've only ordered here to go, and on several occasions the meatball appetizer.  The first ","useful":1,"cool":0},"5ZjFan93OgLqnkh7YX2yXw":{"text":"Terrible food and service on New Year's Day. \nI don't know what's happened to this place s","useful":0,"cool":1},"Ou4kBtFBY4gkqeORKJxhvg":{"text":"Excellent pizza joint with plenty of options on the menu for those not wanting Pizza. Very","useful":0,"cool":0},"4EPmJM5_-Oo2PyQEu_qjYA":{"text":"This place has amazing pizza and food. Ordered on UberEats while dead from weekend festivi","useful":0,"cool":0},"bIaqWBiz64VjFB8a0ww-bw":{"text":"Let me start by saying we've been eating here for many years & always leave feeling glad w","useful":0,"cool":0},"b1Z25L3N_O05XJINHT7fIw":{"text":"Three stars is because the food gets an A and the service gets an F--that averages to a C ","useful":1,"cool":0},"Aytv9D3frIO17CT8_zRb4g":{"text":"Yes gumbo at a pizza kitchen.. was amazing with plenty of flavor.  Don't forget the margar","useful":0,"cool":0},"QypdBwAlbvWPgPdmPqwyUQ":{"text":"I love having outdoor seating that welcomes my dog. I go to get my 1,000-point, OpenTable ","useful":0,"cool":1},"9rJB-LwMDmY2VGEx0sM-pQ":{"text":"Perfection. \nI almost forgot about this one! This might have been my favorite stop on the ","useful":0,"cool":0},"gR5yvPm5Vsgj0oO3qu4m2A":{"text":"This has got to be my all time favorite places to eat pizza in the French quarter. They do","useful":16,"cool":8},"GiB6xn3_FazMh_Iy3abJRw":{"text":"I gave the server a very good tip (20+%) via cash and paid the bill by credit card.  My st","useful":0,"cool":0},"l_jgXUhgBS9y0z0Gj6gy2Q":{"text":"We stopped here on Friday and we disappointed that they were closing (in 30 mins). They wo","useful":2,"cool":0},"TRzr0T2Vdp9R9MMMWAcPpg":{"text":"This is why I like this place and why I go back:\n*wood fired pizza \n*fresh quality ingredi","useful":12,"cool":9},"4m-FCRl_kAi-Xz-Kt5BP7w":{"text":"Great service...''' But the food.. Ugh.  The chicken piccata did not taste like chicken.  ","useful":0,"cool":0},"HOC6DabUixLruRSBVQqiGg":{"text":"Maybe they were just having an off, a very off, day. After all, Hurricane Isaac came throu","useful":4,"cool":2},"ShwnIO9oBktK3cTvAQqgzA":{"text":"I ordered through Uber Eats and was extremely disappointed with what I received.  I ordere","useful":1,"cool":0},"U9ijb6QGzSsxNT7O01Mukw":{"text":"Absolutely delicious!! I had called to ask about gluten free options for my friend and the","useful":1,"cool":1},"QweI04eYVFz94h_t4gizHQ":{"text":"We shared the pepperoni pizza, shrimp crab & artichoke pizza, baby spinach salad, crab fri","useful":0,"cool":1},"LLsX6uEcjrU-CJr4pV4EAA":{"text":"I found LPK on Open Table while looking for a casual dining spot we could make reservation","useful":0,"cool":0},"go3lrxhh2tgLzUp6GP0d3w":{"text":"Wish I gave this place a try but sadly service was terribly slow here. Not only did we get","useful":0,"cool":0},"VZK5pxBbkczI7Eo1rGp6tw":{"text":"It's OK. Not great by any means, but ok. Just like everything else in NOLA during this pan","useful":0,"cool":0},"apZwqvWx9_2ZU39T3wxU8w":{"text":"Okay so this is a my 3rd and final night and the N.O. has saved the best for my last. I ha","useful":1,"cool":0},"L4CZ2VIIoB5ntkkxF3Pr6w":{"text":"My favorite thing about this place is that it's usually quiet, even when the Quarter is bu","useful":2,"cool":0},"elkfu1O0khhxQ-5CcrS7qw":{"text":"Recent trip to New Orleans we had heard great things about Louisiana Pizza Kitchen and dec","useful":0,"cool":0},"83og6uQQkJPVt1TD2-HVDw":{"text":"This place is to die for! It's right on the corner of the Jazz Museum and the French Marke","useful":0,"cool":0},"LZm0tIqk_St8CnpT-zFPtg":{"text":"I went to LPK because they have vegetarian options and my co-worker and his wife LOVE it. ","useful":0,"cool":0},"UJjxvZrmKWLyFek9Lf_a4A":{"text":"Who goes to New Orleans and eats pizza? We did and it was absolutely delicious! Thin crust","useful":0,"cool":0},"rtvwnGJhXeoIi-lPi4b04A":{"text":"Colleagues and I ended up at Louisiana Pizza Kitchen after searching for a casual but good","useful":1,"cool":0},"IKU8iBXofQvTp1Jj-956Fw":{"text":"The only reason they get any stars is that their pizza was quite good. And really, that's ","useful":0,"cool":0},"NYEu0tM5xNSZQicoI6Gi3Q":{"text":"The pizza and food was great but the waitress was a bitch. There was 4 of us and we wanted","useful":1,"cool":0},"eLWEdy9MCKhNNlPAzXyDuA":{"text":"I live in the quarter and got a delivery order of Pasta Jambalaya and Eggplant Parmesan. \n","useful":0,"cool":0},"nrTdwIkC0G-lML9RRP2FCQ":{"text":"Tourist seeking late night comfort food. The margarita pizza was delicious, the crab beign","useful":0,"cool":0},"5dn6ieNFsxqBHPQLF8mpKw":{"text":"Yummy gourmet pizza & salad.  We picked up but the place was adorable! We got the muffalet","useful":0,"cool":0},"lG8Y9K6lsSq4aARHBR67OA":{"text":"Pizza was delicious! Will definitely be back again? Service was wonderful. I've order Ital","useful":0,"cool":0},"YiGqjEbu7SFUYoqumitgCQ":{"text":"I'm one of those people who always check the reviews, but I rarely leave one (yes, I feel ","useful":0,"cool":0},"c9VX3P1X9xQ4eUODYPPspg":{"text":"Always love LPK! Food and service is always solid. The menu is extensive and easy to vegan","useful":0,"cool":1},"AUkpsLQbvWee275chvrkkg":{"text":"STOP YOUR LOOKING  RIGHT NOW!!!!!!!!\n\nEat here. Seriously. \n\nThe food is perfection. The p","useful":0,"cool":0},"PmNCKvJvLRG3FNS8mGY7Ng":{"text":"This review speaks of the Sunday brunch dish courtesy of O! Vegasm, though I look forward ","useful":26,"cool":12},"5TcOirsrKj7BgPkshTxb5g":{"text":"Very sad to give a crappy review but we didn't have a good experience. Atmosphere was grea","useful":0,"cool":0},"mDgbx3t0bCDnq8pS7TINgg":{"text":"Flavorful, well prepared food!  Great menu. A wonderful option for my vegan family given t","useful":0,"cool":0},"SaLoiKgDV5Ilv0uWTY02Tg":{"text":"Appalling service.  We never even sat down as no one ever helped us.  When we asked multip","useful":1,"cool":0},"xXj_W7hs0whLvTxn58n4Cg":{"text":"I really dislike giving a bad review but here goes. This is the original Louisiana Pizza K","useful":2,"cool":1},"fBBAE56PlfFZ4NV731CQrg":{"text":"Great place, food and service.\nWe were hungry and before popping to this place we checked ","useful":1,"cool":0},"KcSVofJtqxzBTn0Q-28fNQ":{"text":"The only complaint I have about Louisiana Pizza Kitchen is how hard it was to decide what ","useful":0,"cool":1},"gM2Yi5n_81GzwQ5oHkT0lA":{"text":"Great food, ambience and service!  The pizza is amazing.  The perfect thin crust and just ","useful":0,"cool":0},"v2mVUmZQbxSgJGCWdF_jEQ":{"text":"Just so so, everything came out under cooked and covered in uncooked flour or blackened bu","useful":0,"cool":0},"orThDgtbATSaVqdqef76mQ":{"text":"WOW! I mean the service and food lived up to its reputation! \nFirst our server was hot...w","useful":0,"cool":0},"yZxjdI7YplANU9PqqDIZ2w":{"text":"Friendly atmosphere, fantastic food, great service, lots of wine options, and awesome loca","useful":0,"cool":0},"Pbo6AnJMrPXIvaFSdmlNjQ":{"text":"LPK is located right across the street from the french market. I didn't expect much becaus","useful":51,"cool":49},"6S0dleSq-jXvl6_hHwYSUQ":{"text":"Little bit of a wait for anyone to even take our drink order. The pizzas are small definit","useful":1,"cool":0},"Rl3U4sFhq9k1eHAmpCHuyw":{"text":"These people are thieves.  Left a cash tip and they wrote in a tip onto my bill and charge","useful":1,"cool":0},"n3WlOPgMdWropGDB9PRMHQ":{"text":"The location is great. The pizza is good, but try the mac and cheese!! Amazing.","useful":0,"cool":0},"dIvAiAXmSPR0xw6CeHuScQ":{"text":"Yes! Come here for some really amazing pizzas and appetizers. We over-orded a bunch of the","useful":1,"cool":0},"uIGLmkBDj-KuaXkArRmO1Q":{"text":"Hadn't been to LPK in da Quarter for a while; seemed a good place to go for a bite on this","useful":0,"cool":0},"qMBPSwiH4JTMsYCoEiJAQQ":{"text":"Some of the most interesting and delicious pizzas around. The Caesar salads are far the be","useful":0,"cool":0},"wmq5EIu5IEm7Xdke9o1LDw":{"text":"I am on a trip in New Orleans and a local told me that place was good, it is more than goo","useful":1,"cool":0},"M0wvz_G7q3eOETKPVbepTg":{"text":"The lasagna was good. Tasted fresh and was a nice size portion. The margarita pizza is goo","useful":1,"cool":0},"Zo8ov3O2NjzC7dbQpOkkaQ":{"text":"Wonderful there is a dish for everyone. There pizza is to die for a golden flaky fresh bak","useful":0,"cool":0},"5cyX-_m7De5rIMwdtPMQTg":{"text":"I never knew crawfish calzone existed until now. It is a unique way to understand crawfish","useful":8,"cool":5},"_lpPZH7_UAUsWsyadVjJlA":{"text":"This is the best pizza I've ever had outside of Italy.  Wonderful space, wonderful pizza. ","useful":0,"cool":0},"_558KLbc0RCt6OAnM3nQ-Q":{"text":"We came because of the great location across the street from the Jazz museum concert, firs","useful":2,"cool":2},"n5mzKLHDasHCTpum-Xi6Ew":{"text":"(4.5 rounded up to 5!)\n\nI'm kinda shocked as a lover of all things pizza, it has taken me ","useful":15,"cool":15},"36PY47pc52EjW6cx1XLxUA":{"text":"Good pizza, not great. The pizza crust is thin, almost like a tostada. Ordered jambalaya p","useful":1,"cool":0},"m1qcxwo0xYTIqGRTmO41PA":{"text":"We are visiting New Orleans for the holidays and needed a reservation for Christmas Day. W","useful":0,"cool":0},"15rczIeMTuI7qSRQj1PYUg":{"text":"OMG can I say this place pasta was AMAZING I don't recall the name, but it had chicken. Th","useful":1,"cool":0},"qwOwtOj5sfu21jZCL485Jg":{"text":"I'm glad we came to this place. I originally wanted to go elsewhere, and this was my dads ","useful":4,"cool":2},"urRox_zmxP-kTMQh5Wqr_g":{"text":"Horrible customer service. Everyone I spoke to was incredibly rude. Wouldn't give me the t","useful":0,"cool":0},"CBb1X9Z5hRKJbIIofumfKw":{"text":"Such a wonderful place. We had the Pepperoni Classic pizza, GF cheese pizza, artichoke rav","useful":0,"cool":0},"WmCuJ7uSPK1jr7FVgMIdbA":{"text":"I can't even count how many times I've eaten here! I've been going for over 15 years now, ","useful":3,"cool":2},"pYTSPyT-YNL5XLjJKQlAGg":{"text":"Service was outstanding. The waiter was prompt, made a great recommendation that I enjoyed","useful":1,"cool":0}}