{"v3FpLUTQLX2EjQggUBMJ0Q":{"text":"After driving past this place so many times, we decided to stop in, and I'm glad that we d","useful":6,"cool":2},"07PReFVKmK2yRFZKpHAhZQ":{"text":"Went there and was ignored. The lady working behind the counter did not speak English and ","useful":0,"cool":0},"6S7dI4pdQx6l9JUy_ZTEYg":{"text":"We just moved in down the street and decided to check this place out. We got lunch and a s","useful":1,"cool":0},"blD2liK0Ne0kI0_cRLvOpg":{"text":"This place is great. The kitchen in the back of the store has different meals and specials","useful":1,"cool":0},"x0w8ZbLU2Y-ZRDJLK9V3tA":{"text":"One of my new fave place in the city! Cold Topi Chico, hot homemade tortillas and súper sw","useful":0,"cool":0},"DTcrMuNyYgOEonN3iKNXKQ":{"text":"Came in looking for breakfast (eggs, beans, plantains) and also found some sweet breads an","useful":0,"cool":0},"J-eshI1XK7yoEdPqizW1HA":{"text":"There is a kitchen in the back of this latin grocery/bakery/deli that serves up some tasty","useful":0,"cool":0},"C-W49ghnr8mxNyLu8xEEiw":{"text":"Latin food as legit as it gets.  I lived in Honduras for 2 years with the Peace Corps.  I ","useful":4,"cool":2},"rhXAQ_jhJ08wXflWi2FNGA":{"text":"The Groupon email prompted me to check out this place. (I didn't buy the Groupon though.) ","useful":2,"cool":0},"JweJ3lG70SdzlrJW_rzXsA":{"text":"I will only eat empanadas from Norma's from now on. Delicious and great prices. I wasn't i","useful":2,"cool":3},"zwlIOQkXeXm1NuGxYS2z0Q":{"text":"What a fantastic find.  After one visit, I know Norma's will be put into my regular rotati","useful":3,"cool":2},"RmocU031KdBtJ7ORg07xOA":{"text":"After hearing very good reviews of this place on the radio, I decided to give it a try.\nI ","useful":2,"cool":1},"D9KmaPwUuzgzIAdjNtq32Q":{"text":"In the need for some good food, this is the place to try it. Loved the empanadas!!!!  The ","useful":0,"cool":0},"4-ZLzE13t-ADIiAEhmvJbg":{"text":"i had a cuban, and it was as underwhelming as they come. i'd come back to try their empana","useful":0,"cool":0},"Xpj7IT0LSzKfmqSvy-Kmzg":{"text":"Really good food!  The Cuban Sandwhich was basically perfect. And the queso Pupusa was del","useful":0,"cool":0},"fRznhaL6CObfQh_u6r6Wfg":{"text":"The best cuban sandwiches in the city, period.  This is the Orleans parish outpost for the","useful":1,"cool":0},"hdxmDtICu3OebaQAeTxtjA":{"text":"Haven't even had any of the sweets yet because everytime I come in I go straight for the p","useful":13,"cool":9},"Y1RVw_ZEO01mGivOCsxrQw":{"text":"I wanted to give them a four star, but I just experienced a Hispanic bakery in the Heights","useful":1,"cool":1},"OQKjqJWKL3HTi9S9bGeBEg":{"text":"I'm only giving a three star rating (for now) because I have yet to experience this \"Cuban","useful":0,"cool":0},"uaBIblt9SoXPVuON0LPLgQ":{"text":"Stopped into this great little bakery and found a nice lunch counter in the back serving a","useful":4,"cool":4},"RAkpwgyv3QeFhVyRJSFKiA":{"text":"My little hidden gem. I had been wanting to come here since I heard that their sweet bread","useful":1,"cool":1},"mkyKEV-V4NMtTYfG8DSchQ":{"text":"I'd been nursing a seven-year long craving for Cuban sandwiches (since Union supermarket d","useful":1,"cool":0},"FAZkCn-2MUPeCWDMz2wnzg":{"text":"Best deal in town--the pollo (chicken) or meat (carne) pastelitas (sp.?), savory puff past","useful":1,"cool":0},"3dPsBmZ94V5rrffrdkl4ig":{"text":"Culture, Comida (food), and Cleanliness!\n\nThis little neighborhood bakery/grocery store ca","useful":0,"cool":1},"PaOZ2Yk-_Qkv-5LZbE_5Yg":{"text":"I have been coming to this  Norma's since it opened. It is so convenient to have a small L","useful":1,"cool":0},"jraWCiKxhdyptQTAHeTRkA":{"text":"This little Latin grocery is wonderful. So many delicious pastries and hot pre cooked meal","useful":2,"cool":0},"t7w1PAqs9rHdd8nJ4h44tA":{"text":"Just had an excellent lunch here. \nCuban sandwich is a good size & tasty as well. $8\nAlso ","useful":0,"cool":0},"b9bWOIAuk6l2YywknAhc_Q":{"text":"This place is twice as nice.  Grocery store (not convenience store) and restaurant in one!","useful":4,"cool":2},"3ylkLFaAGn7yklf9DXcpBQ":{"text":"It was great to hear a Honduran bakery exists here in New Orleans, feels like a little pie","useful":3,"cool":0},"DqkHWSZtEhxcREQPK3cIZw":{"text":"I'm Cuban and I love this place for Cuban pastries and grocery items!! They have delicious","useful":1,"cool":0},"got0GImkrnawK9-IayzXwg":{"text":"Thumbs up for Norma's Cuban sandwich. It's a little skimpy, but I'm from NY and used to St","useful":2,"cool":1},"OfyRwm1PTFqKeV_x9ZiAfg":{"text":"This is an interesting place. They call themselves a \"bakery\", but it's more a small groce","useful":6,"cool":1},"V6dkRAA07Wciu21cFvWmaA":{"text":"With only one stomach, and a limited time in New Orleans, I decided to jump off the Canal ","useful":0,"cool":0},"QSuoX4iQRlHHPMb4w7L7hQ":{"text":"EXCELLENT PANDERIA \nlocated right behind the Canal Street bus barn.  To me it's a pleasure","useful":6,"cool":3},"RztAhO74ceCjH-Vq8Vp9TA":{"text":"Not sure what in the world they put into that yellow rice, but good god, it was fantastic.","useful":2,"cool":0},"zPfH_vKefmLNnas_gaA7ag":{"text":"I love Norma's! Great food and pastries. Just had the tres leches cake and it was a big hi","useful":1,"cool":0},"kBposwzyJnWPU9F9KN3NNg":{"text":"I have driven by here many times, and finally stopped in on a rainy Saturday afternoon. To","useful":0,"cool":0},"0qU9mEFmxeQe1NmzpY0G2w":{"text":"Last year, every Friday, an angel  student would bring me the MOST amazing Papusas for $5 ","useful":1,"cool":0}}