{"-uQt6BYTPu_JkMUslmOidQ":{"text":"I was just there getting a couples massage and it is one of the best massages I have ever ","useful":0,"cool":0},"JzzBtiCHaI0N3JY_id30ng":{"text":"This was the worst massage I've ever gotten.\n\nPros: \n- The massage therapist was friendly.","useful":0,"cool":0},"MkQwl9Uf-Apa5RRMBVzcNQ":{"text":"First to review! Came for a massage this morning; this review is strictly for the massage.","useful":2,"cool":0},"oZwO4eA_sQsMvPr1aODVwg":{"text":"Great experience! This has to be one of the best pedicures I've ever had. Go for the splur","useful":0,"cool":0},"fHdLTSfxiA1HBtehNwhS9Q":{"text":"Greatest services in New Orleans. Great prices for the high end level of service you recei","useful":1,"cool":0},"MTOPEy_Ro7PqyQ2wc0hoqg":{"text":"Great relaxing place to get your nails done, except for this one male who works there, who","useful":1,"cool":0},"ie6XSHjIDdLYCeozXhtKiA":{"text":"I decided to try someplace new and walked over for a fancy pedicure. I had checked them ou","useful":7,"cool":2},"LYcD-ZE-y65xuqDhJp7Fog":{"text":"This is a wonderful place to go and relax. Very reasonably priced with several different p","useful":0,"cool":0},"WdLwNWrZVGOrDNIwrzMFrA":{"text":"This is the best spa treatment for an affordable price I have found in three years living ","useful":2,"cool":0},"gShhJcxkTq8yDxjk4y_ijA":{"text":"I will definitely be back! This place is phenomenal. The service is great, the people are ","useful":1,"cool":0},"1t3OgTjUCRR2brfdso8Ytg":{"text":"Best massage and pedicure I've ever gotten! I highly highly recommend this place! Free com","useful":0,"cool":0},"VpEu4NZBWcKGWWTHb1vZJQ":{"text":"As you can see this is my first Yelp review. I am generally VERY easily satisfied by peopl","useful":0,"cool":1},"aATDKpCh1UHZkSNJh2KfUg":{"text":"Really wish this place would be better-have given them several chances but after the third","useful":0,"cool":0},"2cOvUKJxbJ06L5OBY67x3w":{"text":"The people are nice but I got a gel manicure five days ago and the paint is already peelin","useful":0,"cool":0},"lKN6ZdKbOTsTNY4cJLHbSw":{"text":"I love love this place! It's modern and super clean. Parking is available on the street bu","useful":0,"cool":0},"L16fI0UyhTzdo1FqsGE6Og":{"text":"Best nails I've had done at the best price, I was asking for something unconventional and ","useful":1,"cool":1},"ldHe8p5feMRjQXtKNm5kbQ":{"text":"Went here after searching yelp reviews. Called and the receptionist said to come any time.","useful":1,"cool":0},"jLT8XevLa0ewNUBv2vzOBg":{"text":"Convenient location right on St. Charles \n\nIt's brand new - they've only been open for 3 m","useful":0,"cool":0},"JgLg4yFUkshmRS6Yz83LYg":{"text":"This nail salon is, first of all, gigantic and second, really clean with friendly staff. I","useful":2,"cool":0},"nFwHYeJUo-xnDF1qfjsC_A":{"text":"I am so particular when it comes to nail salons as most places lack proper sanitary and hy","useful":6,"cool":6}}