{"ey4DVJfERt6Azmeqsj-svA":{"text":"Excellent. Menu is limited which I think helps order faster. The dosa was delish...althoug","useful":0,"cool":0},"ewwCrfdtUn_fWO1XLdpZFA":{"text":"The Auction House Market setting means this place is way nice - and way expensive.\n\nIts no","useful":1,"cool":2},"4boprY4uuPqjF9iJNLcaWg":{"text":"Have been disappointed with Indian food countless times in Nola until coming across Tava. ","useful":1,"cool":0},"ZFltcATihoVYgg1CikpKZQ":{"text":"Great Indian Food in New Orleans! Very good flavor and interesting mix of options. It is l","useful":0,"cool":0},"xD9lQe4z7RF715wiG_JMQA":{"text":"Very authentic Indian food. We had a dabeli sliders, dosa and kathi roll...eveything was r","useful":0,"cool":0},"27Y-6aChF9VfMIrd_TaYRg":{"text":"Really amazing food right next to the convention center ! The Gunpowder Dosa was amazing !","useful":0,"cool":0},"-Giy3UQ4TWMNoBEUmpu1bQ":{"text":"Very good dosa \nWas amazing to see the ability of a non Indian making dosa \nJasmin was awe","useful":0,"cool":0},"-z5EjKcfa_-wPKT-lHZ5ng":{"text":"Very limited menu.  More kind of lunch place. Not for dinner. Good food. Nice environment.","useful":0,"cool":0},"9rb1O8w8p5UBtk-0Wptthg":{"text":"Diasspointed in the Katti Roll I had two weeks ago! The stuffing felt a little stale.","useful":0,"cool":0},"3OVZQ956yzx4DcUpW7oipQ":{"text":"Great tasting masala \ndosa available on Sunday!","useful":1,"cool":0},"inQq3p9GdCq64x2B1F7jFA":{"text":"The dosa was crisp, the chutney on the spot, but the fillings were what made all the diffe","useful":0,"cool":0},"N_2ZR4nN5KVqNblM4CgkYQ":{"text":"Couldn't believe it was right next to our hotel all that time and we came here only on our","useful":0,"cool":0},"mS41gtpvabI3QW8_WqUmpQ":{"text":"Great authentic, new Indian food!\n\nAmbiance: Located in the Auction House, this Indian str","useful":1,"cool":0},"h63BtuQxL9L5I0UK2DUB6Q":{"text":"Tava had a food tent at the Baton Rouge Holi Festival and I am so happy they did.  We got ","useful":0,"cool":0},"v4gd4h3rE2TipxZLEZOhsA":{"text":"When I landed in New Orleans I had a craving for Indian food and this place did not disapp","useful":0,"cool":0},"cbDX8QH0hgQ7LzF311PcuQ":{"text":"Pleasantly surprised with the Indian food at Tava at the Auction House Market! Didn't know","useful":1,"cool":1},"_CL-x1VYeE4S3MaQRpAvIw":{"text":"This place is amazing! My Indian husband was craving Indian food during our vacation in Ne","useful":0,"cool":0},"UdJKNygMrvwUnImKHEU_1Q":{"text":"Best dosa in united states, period. Their coconut chutney was really fresh, sambhar was be","useful":0,"cool":0},"mwZjV3-A20MOxeerY72Sfg":{"text":"The food at the Auction House Market foodhall is delicious with lots of great vendors but ","useful":0,"cool":1},"v2a3uv5NUOLGUzcqZgDuoQ":{"text":"We had Tava at the auction house. The food was very good but the server was a little rude.","useful":0,"cool":0},"kWqfxjsmQZpTumqm5JFu3Q":{"text":"Not once have I been disappointed when coming here. Manish Patel not only puts out some am","useful":2,"cool":2},"P6ZZx5oqsdwxVc2n9gYrIQ":{"text":"YESSSS! These dosas were amazing!!! Fresh batter, sambhar was fantastic. It's in a cute li","useful":1,"cool":1},"Aq6pW8hJyg-QN7dL5_i0JQ":{"text":"My friend works in the Auction House, and she ordered me her favorite from Tabs one day. I","useful":0,"cool":0},"Qpv_J-ckYxGXju0aURCKQA":{"text":"Amazing Indian food!! You can choose to have the food mild spicy which I thought was great","useful":0,"cool":0},"nM0nLpVsgq1-5BxwVNR2Tg":{"text":"I normally go for the chicken tikka masala rice bowl but decided to go for something new t","useful":1,"cool":0},"JwOHjKbJgxfs_LVbLY6qLA":{"text":"I wasn't impressed at all. As mentioned in several reviews there are several menu items cr","useful":0,"cool":0},"J9kKlIPrJ6K9tr-kYOMS_w":{"text":"This is one of the hidden gem. Dosas and kathi rolls were great. Kudos to the lady making ","useful":0,"cool":0},"8UnOR0NcWIzla42iw-r2iA":{"text":"Came to New Orleans for vacation. Felt like having Indian food. Choose tava based on the r","useful":0,"cool":0},"ojUGQgiQLboXtZgESTnNUg":{"text":"Excellent restaurant located in the heart of New Orleans. Authentic Indian dosas with the ","useful":0,"cool":0},"aCWA5t5XZsI949KpQ5gyAQ":{"text":"Got delicious food from their vendor stall in Auction House Market.  Tried the Chole Chaat","useful":0,"cool":0},"98t5kqIQHI26xj6OgDm2rw":{"text":"This place is delicious! I'm South Indian, and grew up eating dosas and sambar at home. Do","useful":1,"cool":1},"j3CXg09LcAAL1d5ubckEIQ":{"text":"We were craving some indian food and found this place in the awesome Food Market. We order","useful":0,"cool":0},"-1-M-efkOP2kuAd6NEU5Ng":{"text":"This is really not a restaurant but a takeout/ food court stall. Having said that my frien","useful":0,"cool":0},"3R7IMnXttpRI21TZwaBdQQ":{"text":"We loved watching our dolsa be made to order!  The food was delicious and fresh.  The tikk","useful":0,"cool":0},"D7KrsM1mbPFor9RPVGazkg":{"text":"I've eaten food from Tava several times, but this chicken tikka masala rice bowl was the b","useful":0,"cool":0},"XjJISDFBmqh3nChTbUGLew":{"text":"I eat a \"gunpowder\" dosa about once a week. It's so delicious and gluten free, too. The sa","useful":1,"cool":0},"2e9D5W2Rq3JnayMwBbaz6A":{"text":"Very flavorful and I like the different options and unique combinations. You can get them ","useful":0,"cool":0},"KCiWdYyvl8jAQYrQRRiKfw":{"text":"Amazing Indian eatery in NOLA! \nLocated inside Auction House Market. Auction House Market ","useful":0,"cool":0},"vFr-f0ztk_3Iqr9Ip_TOsg":{"text":"Hosted the Yelp Elite Event tonight at Auction House Market. The food was quite noteworthy","useful":0,"cool":2},"AyzTOeNHx-ph-W8WBQL2MQ":{"text":"I love Indian food in general but had never tried Indian \"street food\". The workers were v","useful":0,"cool":1},"a9jEWgvF_BTSAlPcYRcxbw":{"text":"I went here because I thought they had Uttapam, but they have a different menu.. I ended u","useful":0,"cool":0},"GP-U2ypQcnfd2FAucb25Vg":{"text":"We wanted to try this place today. Ordered 2 dishes. Both the chef & the other young lady ","useful":0,"cool":0},"zbSVrFmYfIiiY5T1c8anLw":{"text":"Food was okay, service was terrible. The two girls working were very rude, weren't able to","useful":0,"cool":0},"IbkjlM-7auK31jmynMP2fw":{"text":"This place never ceases to amaze me. Their regular dishes are all really good. This time I","useful":0,"cool":0},"EvqLUqmirFgVATd_P3BT7w":{"text":"Best Indian food in New Orleans by a mile.  Best Indian food I've eaten outside of India.","useful":1,"cool":0},"OxnwKQP44kv05gaCPpSgVw":{"text":"Really excellent dosa and filling in an unexpected place. Only two issues. First, for the ","useful":0,"cool":0},"4tqZo0KYmh_kFraihrU7jw":{"text":"Wow, this place is so yummy! I moved away from home and have been missing Indian cooking. ","useful":0,"cool":0},"T0t24zzrRO4UsYcCjb2KOg":{"text":"This is hands down my favorite restaurant in New Orleans. If you want authentic Indian foo","useful":0,"cool":0},"edmkzHkclwiKF6x26ww2YA":{"text":"Loved the food, it had an amazing taste. My fiancé's family is from Sri Lanka so he is use","useful":0,"cool":0},"V0b9IFwatLaroRe0IVShAw":{"text":"$5 cheese dosa was a nice snack, it feels like they are a little understaffed so it took a","useful":0,"cool":1},"Obq39iO5bHZy3lNccaGzOQ":{"text":"The Auction House Market is beautiful and a great vibe for happy hour, but if you're looki","useful":0,"cool":0},"vSpwa5RupxIIU8qpDVmJeA":{"text":"Here for a conference at the Convention Center and was craving Indian food. This place is ","useful":0,"cool":0},"51nenCPooDnNZx-uKCzZtw":{"text":"Highly disappointed with this place. They literally had just about everything crossed off ","useful":0,"cool":0},"4xbuR6oXp2VcUGXwQURPQA":{"text":"If you look in google maps, you may not find this. It's part of 8 or 9 food stalls that ar","useful":0,"cool":0},"ttZVwP-nSp3qvb6mUNLmTQ":{"text":"The only good thing about this place is the ambiance. I ordered Plain Dhee dosa and bhelpu","useful":0,"cool":0},"z5_K_9ocseSKjQGJi72cHA":{"text":"Delicious South Indian food. We got the dosas- generous portion size and sambar was good t","useful":0,"cool":0},"wYEYMj4mpOhp7pqwWRhPAw":{"text":"I've had the Dosas here a number of times, and it does not disappoint. I like adding some ","useful":0,"cool":0},"ZxzJcvU7a3ihkXLk7tRlFQ":{"text":"We are from India & NJ , so know something about India food :) Menu is  simple street food","useful":0,"cool":0},"nV2aEabEAHUDZtZ6DK4BXQ":{"text":"Finding this place was like finding water in a desert!! We were hungry looking for some ve","useful":0,"cool":0},"cw03hXwpCJNT-4rOlAD7ww":{"text":"Good quality food and service, Sambhar has authentic taste.. nice clean place with couple ","useful":0,"cool":0},"HCr6ymu2LVE3u5fvPq0PVw":{"text":"This is one of the few casual Indian spots that I've found in city. It's a great option fo","useful":0,"cool":0},"6ZgD7GKDKqez7UtGI75NxQ":{"text":"I love this spot! It fooled me when I walked up and saw a little spot where they cook and ","useful":0,"cool":0},"1s1x4fYy_1YGFQYsSwfVYQ":{"text":"Amazing food!! Extremely authentic Indian. The Dabelis are to die for. The Dosa is as good","useful":0,"cool":0},"Pz2SUf2ILSnvMr3Mpw4yyg":{"text":"I cannot say get the Kati roll and Panini any louder. We did both with Chicken Tikka Masal","useful":1,"cool":1},"JGrB1pKu7X4LXx09Odm2IQ":{"text":"This place is inside the Auction House Market. The server was not very interested in servi","useful":1,"cool":0},"A4S9geHyuEN0P7jZDGkCDg":{"text":"If you're in the CBD this is a must stop. It's inside Auction house market, which is a sup","useful":1,"cool":0},"jbqIkr6CBNaisPG8GqPeyQ":{"text":"Love at first bite! Tava was highly recommended to me by a friend who holds southern India","useful":10,"cool":9}}