{"-A9Q8vGTkkNJ2Sf69Dx7oQ":{"text":"Showed up earlyish on a Wednesday, the Almond Croissant was outstanding...indulged in some","useful":0,"cool":1},"LpISSx9HBQLhIWRi3PsfBA":{"text":"My new favorite breakfast/pastry spot in New Orleans!  I love everything about this place.","useful":0,"cool":0},"1XtlTMCwc4h2Xwz0wzRFkA":{"text":"I was really disappointed by the counter help and my tea and my bechamel turkey croissant.","useful":6,"cool":1},"Orz2PqTb4pGwd4l5YpZelg":{"text":"Si sa che noi italiani abbiamo qualche difficoltà a fare una colazione decente all'estero,","useful":0,"cool":0},"rlBJLEhE6qzbEgos5SC3LQ":{"text":"Not as good as it once was...I would like to write a more positive review of one of my fav","useful":0,"cool":0},"2wT8xzo3Eu3LqTfBEAYgkg":{"text":"This place has the best French pastries I've ever tasted. It's expensive but worth it. Mad","useful":0,"cool":0},"waVT_Be9KLBn8uroO5mBSA":{"text":"Cleaniness: 1\nFood: 4\nAtmosphere: 5\n\nOverall, I give the place a 3. I found a hair in my c","useful":1,"cool":0},"-HJCWeEtJomQbRPXUOZnCA":{"text":"Found it to be a very quaint place to grab some baked goods and coffee. Turns out, the bak","useful":0,"cool":0},"ox5pzlFZS_WSC0S3VNy6_Q":{"text":"Quaint spot to chill w/espresso and a beautiful pastry. However, to warm up croissants the","useful":1,"cool":0},"Dn-4k1WAWpLn39A39iNUDw":{"text":"Doesn't not test good and the coffee is bad jgdhffhgfg hffbn lgxlgxotzogzkgzozotxotxogxtxt","useful":0,"cool":0},"0l3OydSwANYtB6TiY8WqMg":{"text":"Definitely one of the worst eateries in the French Quarter. All the pastries taste like so","useful":4,"cool":0},"Zo59ZzgNQbIadYXCKZYWDg":{"text":"Chicken salad croissant was excellent.  Very pleasant counter help.  Super fast service.  ","useful":0,"cool":0},"jZgiqL1XqH3I_59OxHuIiQ":{"text":"Best croissant I have ever had, period. It's seriously as good as it get.","useful":0,"cool":0},"_dFca7-9Rw-qHGSNqEsIAQ":{"text":"The best croissants this side of Straussbourg. Everything baked on the premesis. Try the C","useful":0,"cool":1},"mjNSEALrRoxNCcBR_ADDtw":{"text":"Almond croissant was tasty, cheese Danish not so hot, and the cafe au lait was just plain ","useful":1,"cool":0},"TPacIwhsn43db7kGs0AhtQ":{"text":"It's SO SO fresh and delicious croissant. You must come here if you are in New Orleans :$","useful":3,"cool":1},"frjyvuMRexwjS6EXCRDDRQ":{"text":"Not sure what happened to this place over the last 2 years. It used to be an amazing local","useful":3,"cool":0},"evXDic0_t3j8udqKl9oetg":{"text":"This is probably the best bakery in Nola\nGreat cakes and basically everything we ordered w","useful":0,"cool":0},"vMoMp_kXXNc_pMJ20xx3Hg":{"text":"This may easily be the best place we went to on our trip to New Orleans. The service was p","useful":3,"cool":1},"T-tutQXhkNpdXVhUnfVH-A":{"text":"Pastries were not fresh or flavorful. If you're looking for french pastries try somewhere ","useful":1,"cool":0},"pCCGg6nLQSoFobQqcl2xyw":{"text":"Had a chocolate croissant here. This was terrible. I was surprised how bad it was given th","useful":3,"cool":0},"aDtlV7JNEJkQZEt9-SF5VA":{"text":"Enjoyed a delicious slice of the frangipane with a great cup of coffee. The place is fanta","useful":0,"cool":0},"9yp4u4Hew1APPiYPZsiiTg":{"text":"A gem hiding out in the French Quarter! Croissant D'or is a must try for anyone craving a ","useful":2,"cool":0},"JFYJw7e9EFN8dSXw5ZUXdw":{"text":"I've been coming to this place for about 5 years and always recommend it to people looking","useful":4,"cool":0},"0xH0M5nHXcCSTARUYGEFNA":{"text":"Delicious almond croissant. Amazing atmosphere great service. Clean and elegant get away f","useful":0,"cool":0},"T97TvcVMo27OuVdV-HmmGg":{"text":"We visited here this month, Dec 2016, and it was as good as ever. Delicious pastries and b","useful":1,"cool":0},"QgDmwz3xw-tNqvqfvasMWg":{"text":"Sublime!\n\nOne of the best meals I had in Nola, though it was only lunch.\n\nI got the Pralin","useful":0,"cool":0},"lFav5ZcEXN6o5HDfwPocIw":{"text":"Birthday week in the household always brought a Tarte Maison from Croissant D'Or. When Mau","useful":2,"cool":0},"ey8Lzo23eo05G1jez6otVg":{"text":"Enjoyed a fantastic brunch here. Got the chicken salad sandwich on a croissant, and the fl","useful":3,"cool":1},"1Ursjn-WhpKiPwMCDegXqQ":{"text":"Simply amazing!  The beautiful building, first of all, is a sight to see.  The decorative ","useful":0,"cool":0},"kQrKsmk39YapEWzJVsTz3w":{"text":"The food is overpriced and $4.00 orange juice in a tiny cup is ridiculous! The service was","useful":0,"cool":0},"PYgd8stJomfGeXt4M4lVyQ":{"text":"Loved the food and pastries here. Get the quiches, the are awesome. Especially the broccol","useful":0,"cool":0},"-i2WKd00yyxWvu__dDQb5A":{"text":"They have delicious cakes and pastries. The reason for the 3 stars is that while we were e","useful":0,"cool":0},"VAqLwc0sFLGT7pTR2jRpSA":{"text":"Their almond croissants were to die for. Decently priced and a great, quaint find in the F","useful":0,"cool":0},"DICEMzAyWjRwZibElBLM-Q":{"text":"Good place for croissants and coffee in the Quarter especially if you need an alternative ","useful":0,"cool":0},"4X7e2X-T1_eA9Uuz4JYUfQ":{"text":"I hate to break the news on this one; however, this is NOT a four star rating by any stret","useful":3,"cool":0},"7Fc5-xGbo0uwPbknsUmrhw":{"text":"Exellent French Bakery Cafe,  will not go wrong.  The pastries are fresh and the lattes ar","useful":0,"cool":0},"9edVLfigLmFYI8oSzTt1Ig":{"text":"Pretty cool place! Built in the 1920s and the architecture is still authentic. A nice sele","useful":1,"cool":0},"Hccstgp_FOg9P0SCNasC5w":{"text":"So .......... Yeah yelp has dissapointed me this time. 6 hour drive from Houston to New Or","useful":3,"cool":0},"5ChHOoTZuCCkJ2sSi9F0ng":{"text":"This is a nice little french bistro in the French Quarter, right near the Old Ursuline Con","useful":0,"cool":0},"LHoYI-btdPoehI9cGRM27A":{"text":"Based on prior reviews, things have changed since good reviews! \n\nPretty bad all around. C","useful":3,"cool":1},"q6KnDaoXmeNBzFOGi84GMw":{"text":"Very very good; they had a wide selection of fresh delicious pastries, and the prices were","useful":0,"cool":0},"kN5olWb577wMAcKWH96iag":{"text":"Skip the long lines for Café du Monde and head down a few more blocks to Croissant D'or. T","useful":0,"cool":2},"Vz_P3PTKm3ftiM1u4WDXNA":{"text":"I had a chicken salad croissant and immediately bookmarked the location so I know where to","useful":0,"cool":0},"j-fg3wlYuF3o0nmGRGHdpQ":{"text":"Convenient spot to get a coffee and a light breakfast. Its not the best or particularly im","useful":0,"cool":0},"LuWRir_Gi9y1_mfPz7JXnQ":{"text":"My husband and I are wrapping up our New Orleans honeymoon today. We have eaten so much go","useful":0,"cool":0},"vmzMXdBzu5LiNcmsP3Mg3w":{"text":"I'm so glad the awesome sales woman who knows her pastries and loves sharing the joy of th","useful":0,"cool":0},"Z7lXk4REoqE5uSaimZEtZQ":{"text":"Almond Croissants are always the best! Consistent. Not France but I also like the baguette","useful":3,"cool":2},"6siv5iyV9m8pVJ-KGbSEYA":{"text":"I was searching for red velvet cake, when we walked into this lovely french bakery, 15 min","useful":2,"cool":0},"b6CxGXG9dmoMmqLXCf1pVQ":{"text":"I have a crush on their cakes... while visiting french quarter i visit there everyday for ","useful":0,"cool":0},"j72rmzvzJyRNSKCjcVv8QQ":{"text":"If you are visiting or even newly transplanted this place is a must. Delicious food and th","useful":0,"cool":0},"JkFgqJEb6DNgEzgZHNqJbA":{"text":"The croissants are absolutely delicious.  My husband wasn't a fan of the cheese that they ","useful":0,"cool":0},"DIvxKjwgczKTh63ERe6YSA":{"text":"Overhyped! This place is out of the way and not worth it. \n\nThe service here was terrible,","useful":2,"cool":0},"9rXUOcCJgtXvTy3JaMovRg":{"text":"I stopped here on a Saturday mid morning and they didn't have any croissants left! They ha","useful":1,"cool":2},"eKe4m2uIKlxobzV4ISkz-g":{"text":"The bottom line: With a reputation like they have, I would have expected more from the pas","useful":0,"cool":0},"REac6bbuW2wWJSMpum89Pw":{"text":"The croissants were good, although not the best I've had. A little bit on the heavy side, ","useful":0,"cool":0},"-c9V0WryRjaGulvXej5dPQ":{"text":"Stop here today before heading out of New Orleans. \nThe lady that worked the front was ver","useful":0,"cool":0},"rIbOU9L8sdzJB6cHtjVZ2Q":{"text":"after battling palmetto bugs all evening in my sepia-toned sublet (complete with ostrich f","useful":1,"cool":2},"Rc0wVC_MG9ViVWyE6l6SgQ":{"text":"This is the cutest place, I went twice in four days! I loved the French tiles and decor. C","useful":5,"cool":4},"K0cOWbb5lv7HfG2dIEQP5w":{"text":"I am a local and work in the area so I USED to stop in often. I had to stop going in thoug","useful":1,"cool":0},"fdPpoqjkR43cR8kHan1neQ":{"text":"A quaint French bakery with a patio and window seating. I was a big fan of the cheese and ","useful":4,"cool":1},"EeMyvmTeR9jO90xM-w1Eyg":{"text":"I ordered a raspberry croissant, my wife had petit fours. My croissant was really good, fl","useful":0,"cool":0},"j6mEzUlVTUVXwJHxNlbeBA":{"text":"In my last review I gave this place 4 stars, but that was based on my previous love for th","useful":0,"cool":0},"8zqYQWPtFY-hluqjydCVCA":{"text":"We had breakfast here early (8:00 am) a couple of days after Christmas. Get here early on ","useful":0,"cool":1},"Gdbmxs6Xrk5aTzox3WJfBg":{"text":"In the interest of full disclosure, I must say that I really had built this place up in my","useful":3,"cool":0},"tVQV5dPHC5mTQSekDe3qug":{"text":"I thought it was pretty good. I had a ham and swiss croissant and the Italian cream cake. ","useful":4,"cool":2},"Mw3QLHoOXGcKvyylfslweQ":{"text":"When \"Plan A\" for my girlfriend's birthday lunch didn't pan out due to my inability to rea","useful":2,"cool":2},"D_G0T-qAwAS3apG9wJzsfQ":{"text":"Perhaps worth 4.5 stars in this neighborhood, but not as good as the places in Paris.\n\nNot","useful":0,"cool":0},"uQzb-c8LG5k9PumShZJ9Hg":{"text":"The croissant's are fantastic. The French owner comes in each morning to make them. They h","useful":0,"cool":0},"RYIfNDL_LX0nuFmJdFYsQQ":{"text":"The almond croissant was one of the best I have had! Great place for a relaxing breakfast!","useful":3,"cool":2},"NM6pRsqGWPHZBQo2uBusWA":{"text":"This past Saturday morning my parents, who were visiting, wanted to go have coffee and bei","useful":1,"cool":1},"72uZrneE-Dc6NbTCcZ4Wlw":{"text":"This was an incredible find.  I was in New Orleans for a long weekend in February 2007 and","useful":2,"cool":1},"4KrY-edfih9NBLG_eEf5jQ":{"text":"A cute little cafe with a fantastic selection of fresh fruit, pastries, breads and treats.","useful":1,"cool":0},"LaO1zm4T9EqDX7XKOOfQhw":{"text":"Reliable and unpretentious, a croissant here on Saturday morning will probably save your l","useful":9,"cool":3},"afe3TOniSyWSrng-r1Ed_w":{"text":"I came here two days in a row on a recent visit to New Orleans.  The cafe is in my favorit","useful":3,"cool":1},"wa4qbTIeN7_3DH_WDtRHNQ":{"text":"I walked to this spot for our hotel in search of my caffeine fix. I had an almond croissan","useful":0,"cool":0},"q9dqF9fNegp5Qfx6BZnP0w":{"text":"This place is great - the apple croissant was to die for and the spinach quiche was yummy ","useful":0,"cool":0},"45ALm4872mcynZGcjAfHuQ":{"text":"I was on a short vacation to NOLA and was on a mission to find a tasty almond croissant. I","useful":3,"cool":3},"0A4jD19kgdeDRyN6x4Ddfg":{"text":"Not impressed at all, they don't know how to do a ham and cheese croissant. It's not hard.","useful":2,"cool":0},"SM8W-a5vbC6A7ruweExCXQ":{"text":"The people giving bad reviews are super picky!  I always come here every year when I'm in ","useful":1,"cool":1},"yI5lWY6of9oxLiTmLKC7dw":{"text":"Almond Croissant and Chickory Coffee, nuff said!  This is nice little place in the French ","useful":6,"cool":2},"deUeEyiqEamMmEmVNqaCEw":{"text":"Very over priced , a pain au chocolat that does not even taste close to one, the young lad","useful":2,"cool":1},"XLR5IJPRBBrH1imIYqJ6aw":{"text":"Pastries here are great! The coffee drinks aren't quite as good, but they're way cheaper t","useful":0,"cool":1},"mO-OiMFoXid_jGi1s0LWqw":{"text":"Delicious pastries and fresh squired orange juice. The only issues I had was the young blo","useful":1,"cool":0},"tqvEBp1hgyFfJUeANSg8SQ":{"text":"Best chocolate croissant outside of France.  Very good cafe au lait and reasonably priced ","useful":3,"cool":0},"LcnvVyjucom-cNoZdBIt8A":{"text":"So elegant, moan-worthy croissants.  Somehow makes you feel as though you've stumbled upon","useful":0,"cool":0},"0PbOS0TQOr5bwLngW8jR1g":{"text":"They did a nice Napoleon, and a hot soy latte. Exactly what I needed on this morning.","useful":0,"cool":0},"OBHxpCl4b4RwmPjH3GWi7g":{"text":"Not sure why it has such high reviews but it was not worth my walk there. Nothing close to","useful":0,"cool":0},"79NwBBm_shUHRWvfQVcuqg":{"text":"During the last day of my previous visit to New Orleans, I rather serendipitously stumbled","useful":1,"cool":0},"QaVvzUckW-sDKEgLz6Mmkg":{"text":"The quiche and croissants here are fantastic. Nice air conditioned restaurant in in the Fr","useful":0,"cool":0},"6K9VFErMd8C0TrbtVZzGwQ":{"text":"Recent change in ownership has ruined a great place! This used to be a must stop every tim","useful":5,"cool":1},"zRxYUsTIDKeGp1BvBG3BKA":{"text":"This place is great for the ambiance. You truly feel like you are in 19th century New Orle","useful":0,"cool":0},"IKMVga5YQ4xYR3cnJAjawg":{"text":"Stumbled upon Croissant D'Or Patisserie while wandering around the French Quarter and coul","useful":2,"cool":1},"SSAqjvVE7t-MoJqGArxnLw":{"text":"Great variety of baked goods in the case. I ordered a few things to-go and was dismayed to","useful":0,"cool":0},"6OjnnmjcyDEvBzeAfwS_Mw":{"text":"Stumbled upon this gem on an early Saturday morning in the Quarter.  Yummy croissants, goo","useful":0,"cool":0},"qhtAYs0mk6ARkT-Oqtoavg":{"text":"Croissant sandwich was great, tart was sweet and tasty, and the meringue was melt in your ","useful":3,"cool":0},"uVlKZTUYqvLJ8Hqo9L4T7Q":{"text":"I love this place!  I had the almond Croissant with coffee and it was the perfect breakfas","useful":3,"cool":1},"eELBwfZv4B7IIH4XhvKvqA":{"text":"Great bakery, super tasty sandwiches, good techniques in pastry and cakes. Great service, ","useful":0,"cool":0},"VEmgAK9CMG7QrQJ_3chk1A":{"text":"Slow but the croissants are beyond good. Get a variety to take back to your hotel. Top fav","useful":0,"cool":0},"bcsIgQMM_0m-Ss6BLRihPA":{"text":"Ah man, such a disappointment on many levels.... First the positive, the shop is very cute","useful":0,"cool":0},"591Z2LvUWAtcPLshWdrzvg":{"text":"I stumbled upon this place quite by accident one morning while visiting the French Quarter","useful":1,"cool":1},"lIh_ks0km8NFrfPNtuhULQ":{"text":"Great place for pastries and baked goods. Just don't get the vegetable soup.  Watery with ","useful":0,"cool":0},"wU_qqEoFp986ufTQ-AQEIg":{"text":"We stayed across the street so this place was convenient. We had two breakfast meals there","useful":0,"cool":0},"WEVbIqzTMESIjc2O9AdjnQ":{"text":"After reading all the reviews in tourist books, I actually had high expectations for this ","useful":2,"cool":0},"_I4k3l8ICyAUJV5dReNhlQ":{"text":"The service here was not good. They were extremely rude and when we came in at 1020 am, we","useful":0,"cool":0},"qvzWW3AmOo7SGNRRPiDL9g":{"text":"Nice atmosphere and delich pecan pie but the croissants are closer in their textures to a ","useful":2,"cool":0},"VGwn5XOi_d8jEJzG9g-Ccg":{"text":"Stopped in here for an iced cappuccino and an eclair on a jaunt around the quarter with my","useful":1,"cool":0},"WlkbGOPLVZgs46lchCtZKA":{"text":"We asked for Kouigan Amman on Saturday when we stopped by and chef made it for us on Sunda","useful":0,"cool":0},"JNi_gbKHhQuxLa57CAXSjQ":{"text":"The concierge told me about this wonderful gem. Amazing selection for breakfast or lunch w","useful":0,"cool":0},"FtrMUGSy92TBgZqFy9nZTw":{"text":"I ate here 2 years ago for both breakfast and lunch on different days. More than happy bot","useful":0,"cool":0},"STPshI8kHITjEQKbefd8UQ":{"text":"Delicious croissants, nice atmosphere. They also have a terrace as well as indoor space.","useful":4,"cool":1},"B5wtzoas3bDWtFqMFtuXEQ":{"text":"An old New Orleans pastry/ coffee shop. My ham & cheese croissant was pretty good. I'm no ","useful":1,"cool":0},"sn5M6zV4STxBYa2K5jTM9g":{"text":"The best breakfast place in the quarter. I like my breakfasts on the lighter side - a croi","useful":1,"cool":1},"d8aCXpDvrFoS6AXn7QseUQ":{"text":"Wow...this place is amazing. The pastries are perfect...the sandwiches are delicious...the","useful":0,"cool":0},"GxgZPw_D4T7URjTmn2nJEg":{"text":"This place is an absolutely lovely cafe for a light lunch when you are craving something o","useful":0,"cool":0},"_dzmzMA6A6ZecYWpLiZzAA":{"text":"i was soo happy to stumble upon this adorable little bakery. it was so art deco France cir","useful":0,"cool":0},"oO5A0hvx8iF8QpzjxSLZWQ":{"text":"Buttery flaky goodness, oh my! Buttery flaky love, oh yes!\n\nI was very impressed w/ the ho","useful":0,"cool":0},"zXq-fN5ZltjODNmajyqQdw":{"text":"Hands down and always has been the best breakfast place.The building is adorbs with vintag","useful":0,"cool":0},"NwMUJgSgna7uEzdi1dmFTA":{"text":"Excellent sandwich - banquette and the service wow is perfect","useful":0,"cool":0},"XN8CXaRURoQQOx3HInKpqA":{"text":"Wow, what a find! We tried the chocolate croissant and almond croissant. Very nice cafe, g","useful":0,"cool":0},"mcuaf6t7AU7Q4mzOL8crsQ":{"text":"I love this patisserie. The best croissants ever! I love the almond and the ham and cheese","useful":0,"cool":0},"l3Me21sGBROKNkxF4Wpkww":{"text":"For the ones that love real croissant or eclair, that is not good period.\nCroissant: Flavo","useful":1,"cool":0},"kN-wvX7XARLvXY7xkq-qiQ":{"text":"Sticky croissants. Poor espresso. Not a big fan, but it's pretty cheap and has a decent en","useful":0,"cool":0},"qKxswaPAT8Vvn6Yp6VXcZg":{"text":"Excellent, fresh pastries. We tried the spinach quiche and the almond croissant. They were","useful":0,"cool":0},"BHm62-AL7V32sf-GTm2z6Q":{"text":"A wonderful, quiet, small patisserie that's popular among locals while  somehow remaining ","useful":1,"cool":0},"QanMvFD58UEfBQTsJVFr_w":{"text":"The almond croissants are the best I ever had.  The other items are good.   Nothing over t","useful":0,"cool":0},"GIM3QsRhugDuinH4h7HHbQ":{"text":"The perfect way to start a day in the French Quarter.\n\nThe interior is beautiful - very Pa","useful":2,"cool":0},"K5TV1FzCw7k_O9PRsF5QXw":{"text":"Loved this place.  great little environment to sit, drink coffee, and enjoy a nice little ","useful":0,"cool":0},"lFlaeCBuxWryx9HmJrN39g":{"text":"Totally stumbled into this place while wandering down Ursulines! I loved their almond croi","useful":2,"cool":1},"wf-2yx-efYuTG0gJtsqxNA":{"text":"Super friendly staff. Great outdoor seating area in a courtyard w a fountain and peaceful ","useful":1,"cool":0},"ypu5JDV22szh8yPDDAiS8Q":{"text":"We stopped in here for a pastry. The best part was the decor. The food was only okay. Not ","useful":0,"cool":0},"bRBcON6x2NVXNaDgETw5IQ":{"text":"Perhaps the best croissant I've ever had. Overall wonderful pastries. I really reccomend a","useful":0,"cool":0},"pB02_m24Cg9CHp2Wl7vfng":{"text":"Very friendly, gracious staff. Ample indoor seating- covered courtyard is beautiful.  Dece","useful":4,"cool":2},"J1W6liX2XMbIRQd5DzVwLw":{"text":"This place is beautiful lot of character. Very Frenchy. The quality of the product is amaz","useful":0,"cool":0},"gq1hAI4JI37jddYVGY64Nw":{"text":"I got the blueberry croissant and the spinach quiche. They both were tasty but I would've ","useful":0,"cool":0},"2HA-TsysAFkxUjzkEsXGWw":{"text":"Watery coffee and grocery store croissants. Beautiful location, I just wish the food was b","useful":0,"cool":0},"vSVQQ33S0n3pLg4M5xaavA":{"text":"This used to be a staple of mine for years. A French guy owned it at one point, and I miss","useful":0,"cool":0},"t9p7ouVtktiTi8tBgnfaaA":{"text":"A magnificent place to get coffee, baguettes, assorted filled croissants, as well as other","useful":2,"cool":2},"3xDUgkrTgdfKXGdRjnJLYQ":{"text":"The croissants are superbly buttery and flaky.mmmmmmmmmm.\n\nThis quaint bakery resides in t","useful":0,"cool":0},"EIMvlUk2mz9aT9G-m1FnBg":{"text":"This place used to make amazing croissants - they changed ownership some time last year an","useful":6,"cool":0},"VXxQUyhYSS4uKzpOIlZ5UQ":{"text":"Cappuccino was great a little stronger than usually but great. Ham cheese croissant was to","useful":0,"cool":0},"LaCqjmy2Gs7npLcHsjnKsA":{"text":"Casual French-like cafe; quiche, pastries and some elegant desserts of swan meringues and ","useful":0,"cool":0},"U8RB0MExLJQHQvuUiB7XlQ":{"text":"I really loved the atmosphere, & especially the wide array of pastries when you first walk","useful":1,"cool":0},"4lSTNnjWlynffwPhDUR6PA":{"text":"Great croissants and baguettes. It is a wonderful place to go for a quick breakfast or to ","useful":0,"cool":0},"Zm45Yt9GYhF8JyaoygMnww":{"text":"This is a really good patisserie. The prices are fair, and the atmosphere doesn't get any ","useful":0,"cool":0},"j07U0M7BE_4zrWSvWfafJA":{"text":"This is my go to place after a fun night on Bourbon St. The croissants are always fresh an","useful":0,"cool":0},"AK6LHo-IFt2IRSqDrAUtjg":{"text":"Very  popular, no thanks  to employees  or owners. A little attitude  attatude adjustment ","useful":0,"cool":0},"hQPdkmV6B_RuhGtlleOanA":{"text":"I'm a new resident to New Orleans, so I've been eager to go to the hidden gems and lucked ","useful":0,"cool":0},"loIBE5n6s736_VsAYGNlKQ":{"text":"the best almond croissants ever!\n\nthere was also this almond pastry pie looking thing and ","useful":0,"cool":0},"BbFDBpxBDl23d5Bql2v5fg":{"text":"I popped into the Croissant D'Or a couple of times during our stay at the Hotel Provincial","useful":1,"cool":1},"ayQMvmZic5eQgB9lY458ew":{"text":"The best croissant I have ever eaten....the chocolate cakes will melt in your mouth.....it","useful":0,"cool":0},"Ql8NWI7wXP48IVqj3RNM6Q":{"text":"As I am writing this, I can only think about the best chicken salad sandwich on the best c","useful":1,"cool":0},"uZeCbV43M6ZVaYE63IR64A":{"text":"Getting a delicious, buttery croissant and coffee, sitting in the window and reading the l","useful":1,"cool":0},"kOcyj1OgUWeksqkuuDG2fQ":{"text":"The place is very clean once you walk in through the doors!  My friend and I came across t","useful":0,"cool":0},"-0H-Vfq04t2nDZLs4o1OUA":{"text":"Popped into this place while on our way to Cafe du Monde, this was honestly better. \nWe ha","useful":0,"cool":0},"smo71BCeDPKcIBCmdSc1Bw":{"text":"I loved the Croissants and the atmosphere.  However, just like Paris, the staff could have","useful":0,"cool":0},"o4CZP7TlvpprRivFxvYaSQ":{"text":"Great place for a light breakfast. Old spot with lots of character. Good food and coffee.","useful":1,"cool":0},"yh0JZv4hc3g6Dih8XzsrLg":{"text":"Amazing food and coffee. Truly authentic, and is the closest thing I have found in the Fre","useful":0,"cool":0},"b1mepEK8YW0UuXIJlNSW-g":{"text":"Croissant d'Or was recommended to me by a friend who loves good food and New Orleans, in t","useful":0,"cool":1},"4Mdx1_uJ8SUgeaun9GhkhQ":{"text":"Quint European influence cafe with comfortable atmosphere. Home made breads, pastries, fre","useful":0,"cool":0},"b0lD-Mf-MQpvD_CSy50e7A":{"text":"Almond croissant, raspberry croissant, chocolate croissant, hot chocolate. I would eat her","useful":1,"cool":1},"lfM_514RBNM4UVi4CNN3vQ":{"text":"Staying in the French Quarter? \r\nYou need a fast breakfast, but you can't handle any more ","useful":0,"cool":0},"0jYTxxqI5ZhzthU8SxanSw":{"text":"Wow, this place seems to get the extremes of love & hate in the reviews. Came here with 3 ","useful":1,"cool":2},"JiloAymr9vXX2i-j1hTkZw":{"text":"The almond croissant was heaven! I have to go back during my trip as I want to try more. T","useful":0,"cool":0},"WHKIkosjr6ooLovuOPY3pA":{"text":"I felt lucky to find this little gem of a cafe in the midst of the messy French Quarter. I","useful":0,"cool":0},"cUg051miTxZJOlXZnBBvLQ":{"text":"the shop itself is cute and pretty french-ish. the pastries are not something that I would","useful":0,"cool":0},"OCpD4Y3dI1w3P0Wz5At5gg":{"text":"I heard of this place before I got to New Orleans. I was like I have to go here before I l","useful":0,"cool":0},"XDtHNQh_jkXqHx6gWLJG2g":{"text":"What a cool place for a cup of coffee and desserts. Beautiful building and great service.","useful":0,"cool":0},"SRooSuS92Lc0obTmdTlqYw":{"text":"This place is complete bullshit. I can tell from the reviews that out of town people think","useful":2,"cool":0},"i_2Hf4qbYxZQm3SGMWiiUw":{"text":"Fantastic pastries! Husband and I stopped in on our last morning in NO, and couldn't have ","useful":0,"cool":0},"zPJB9oqscwcf0N2Do1HdEw":{"text":"Croissant D'or Patisserie is absolutely my favorite bakery in New Orleans. I had the luxur","useful":0,"cool":0},"ocFzvGBoXezQPRRj9MfDgg":{"text":"We love this little French patisserie at the residential end of the quarter. Fresh delicio","useful":0,"cool":0},"ik8MuvCNIuG8wqpTjP3rPg":{"text":"This place rocked under Maurice who is long gone. It's still decent and a good cheapish ea","useful":1,"cool":0},"8Ez-rwHKJ1j5MOI1F-blbQ":{"text":"We found out this was a bit of a secret and came here for breakfast one morning. They make","useful":0,"cool":0},"rd_bQKJZPBJKNwyqD3R9xA":{"text":"3.5 really, but I rounded up. Came here on a recommendation for the croissants. I had the ","useful":0,"cool":0},"cYgqEcgv-cQFWp6OFYXZnA":{"text":"Une bonne pause pour bien manger.\nBeaucoup de pâtisserie Française \"Américanisée\" de bonne","useful":0,"cool":0},"zIgRCnxK_2MRjWfEsRmkPw":{"text":"Awesome place if you're looking for some delicious pastries, good coffee, and good ambianc","useful":0,"cool":0},"hns5OvS9EvMZrgP9UeUAAg":{"text":"Cute bakery with lots of delicious baked treats.\nWe tried the blueberry croissant, almond ","useful":3,"cool":1},"as82CMiIC4kKoZKoFvNqxQ":{"text":"Excellent croissants of all kinds, delicious spinach quiche and others. Excellent and atte","useful":1,"cool":1},"7lBf6VzGhxhAhPrau_RTyg":{"text":"We walked here on a quiet Sunday morning in the Quarter and had the most amazing quiche an","useful":0,"cool":0},"0braM-Ou5FlJAGzpaN1gLQ":{"text":"Croissant D'or is my pastry place in the Quarter. I have found that they meet several need","useful":4,"cool":1},"QyFQn7S0lXDEZSb83Lz7Ew":{"text":"Came here cause of all the positive Yelp reviews and overall 4 star rating...\n\nCoffee:\ncaf","useful":3,"cool":2},"eiX5vfh3g2tRMtT4Qvo-qA":{"text":"I'm such a sucker for pastries and this little shop does it right. Before heading back hom","useful":0,"cool":0},"awONoOugRUZ4kYnvQTyC9Q":{"text":"But like really...BEST pastries ever! \n\nWent for breakfast and my indecisiveness kicked in","useful":5,"cool":3},"fskDEndiEcsZDgh09rbfLw":{"text":"Fantastic pastries and very inexpensive. I highly recommend the Picasso, so super tasty! T","useful":0,"cool":0},"uyoDwiuhNedPzB2964qcaQ":{"text":"I don't remember the name of it, but had a pastry shaped like a pig (ladyfingers with some","useful":0,"cool":1},"6PH50i8hmFAfAtbTz3kIiQ":{"text":"Our late morning regular stop while in NOLA...everything is fresh and amazing including th","useful":3,"cool":1},"Dw7MGGINyuk8YzfL6x6RMg":{"text":"So not even close to a real French patisserie.  There is one in the Garden District called","useful":3,"cool":0},"RQAb7Mm0TvkjzZCI_wKIiw":{"text":"People who eat here have never been to France or a city that makes real croissants. I have","useful":2,"cool":1},"4HCc_8HTuVFe64s7e8zbAA":{"text":"Have been coming here for ten years. The beauty of the building itself is one reason, but ","useful":0,"cool":0},"EigXDP4aO8TZ4xvBi6ZP0w":{"text":"Weren't there around 10:30 am on Saturday.  After waiting in a long line was found they we","useful":0,"cool":0},"ntFDBpDpo3C1Uh_vwxzNcA":{"text":"I have been coming here since I was a child on our trips to New Orleans and therefore my n","useful":0,"cool":0},"bmlxR6y-EHSpYj7K1n1qCw":{"text":"Whenever I visit New Orleans, I make sure I wake my butt up early enough to get here. I fo","useful":1,"cool":0},"ae4RdOJwMz4dC3n832K4NQ":{"text":"I really love this place! The atmosphere is so romantic. My husband and I always stay at t","useful":3,"cool":1},"_h9o-qZf9YX7iBqyGKYgSg":{"text":"I love this place. It was a perfect sit down. The counter ordering was pleasant too. I can","useful":0,"cool":0},"kP_PZwWSETc-JRBGKfk7Lw":{"text":"What says romance to you? Flowers? Long walks on the beach? When you husband cleans the to","useful":3,"cool":4},"KXjOTtNmLVSUKSboOwJMsw":{"text":"This place was recommended to me by a Creole tour guide who said forget Cafe du Monde and ","useful":3,"cool":0},"6e2nSsyeq9dRs6qnXxs3MQ":{"text":"Real espresso in the correct volumes, delicious pastries, the look of a French patisserie.","useful":0,"cool":0},"fquCVegMCvlXeiFk-HDGaw":{"text":"Mercy me, those almond croissants!  Just thinking about them has made me start to drool.  ","useful":3,"cool":1},"0vUZN3R5XaKQvytoZJzqhw":{"text":"Place is one of few cafes in French Quarter, hidden little gem with inside patio surrounde","useful":0,"cool":0},"fLpLz7xk0nzRQuHkRn2M6w":{"text":"Great place for breakfast!!  The blueberry croissant's were amazing!!  Also ordered sandwi","useful":0,"cool":0},"1XElJ91DVUqqD_aM5MWZlw":{"text":"DUDE, DUDE, worse than being disappointed with the croissants I came to try upon a stellar","useful":8,"cool":3},"yYSqThFsTeVscQIuPBAswQ":{"text":"First time here I came with my hubby and we ate in the enclosed courtyard in the back. Thi","useful":1,"cool":1},"C1tQ0Hwj8GsncOW8QuDvUg":{"text":"We picked up breakfast here for my mother in law.  This is definitely not a best kept secr","useful":1,"cool":1},"knguj9mfP0O_lkNRGDXDTA":{"text":"Lunch and dessert were both wonderful.  This cute little place is on a quiet street and a ","useful":0,"cool":0},"HkKHDjVantJs5GmPWYPoFQ":{"text":"Simply put, I love this place. Happened on this little gem while staying around the corner","useful":1,"cool":1},"nvwTk7ui6w8Y1UjvAMA9uw":{"text":"This place had a charming atmosphere. Unfortunately, they reheat the pastries in a microwa","useful":1,"cool":0},"hihtUO-Z-waKLP3H2keTXw":{"text":"A true gem! Terrific hot chocolate, great selection of pastries - and all at a great price","useful":2,"cool":1},"QqaMouIQhbZvMQtY3D0_3w":{"text":"I went in due to a recommendation from a tour guide and seeing that the website says that ","useful":8,"cool":2},"c-qpX6apbBpT4UoBRZEAZw":{"text":"Ok, I work in the French Quarter and frequent restaurants in the area. C D'O is hit and mi","useful":5,"cool":0},"sqG2y3zFkZ9ELTtgWwQz3A":{"text":"Dear fans of Croissant D'or,\nYou are seriously deluded if you think this is a five star pa","useful":4,"cool":0},"f849ukKvo1jgrvFPun-3GA":{"text":"I visited this place on a chocolate tour. We had the chocolate croissant and it was amazin","useful":0,"cool":0},"lkiTKXihNcsj-XkLyO1etg":{"text":"Was taken here on a food tour of NOLA. I had seen good reviews of this place and our tour ","useful":2,"cool":1},"MNU0s13AwqgYs8pBPjmbRg":{"text":"Croissant D'or Patisserie (CDP) gets a solid 3.5 yelps from me. I was told that it is a po","useful":0,"cool":0},"M6nJl3KzJ-YbGh_nuCV75A":{"text":"The eggs were fresh and cooked just right, the orange juice was fresh and delicious, but t","useful":0,"cool":0},"JXAjz2FaU58oL7_B6eW9gg":{"text":"The stained glass mural expresses the \"Holy moly\" that will escape your lips after experie","useful":0,"cool":0},"qBaPpIb03IGztg7qhbRRIA":{"text":"I really love the almond and apple croissants here. This is a great place to go on an week","useful":1,"cool":0},"fPIpbE8MTpUpluqf7VE63w":{"text":"Fantastic prices and great food. I recommend a chocolate croissant and an iced hazelnut co","useful":1,"cool":0},"vHf20KiVVCNLUwm7y8EKqQ":{"text":"A friend recommended this lil joint so I made it my first stop once I got to New Orleans f","useful":1,"cool":0},"BOqPnDlijAWZp9S8PV76Ng":{"text":"Wonderful!  If I lived in New Orleans, I'd go here often.  The chocolate croissant is the ","useful":0,"cool":0},"WyjcGUkkCuHHswRxxZNNNA":{"text":"Found this place on a recommendation of two locals I encountered.  Looking in the case I w","useful":0,"cool":0},"eiIFlw74XphoDDqMjGX-YA":{"text":"Charged me twice for my food.  It cost me $13 for four scrambled eggs!  YIKES!!  When I ch","useful":0,"cool":0},"pUUl22tbfk5oTnwgDP52pQ":{"text":"Breakfast From Paris!! Is all I have to say.  Almond crossiant was like no croissant that ","useful":1,"cool":1},"l3ZMxsBckH3hWKMgbxPn8Q":{"text":"A bit disappointed after all the favorable reviews. It hardly qualifies as a French Patiss","useful":1,"cool":0},"Yx39oOivGsmn1PLfbQCg9A":{"text":"My boyfriend and I went their to have breakfast on Christmas Eve and it was really lovely.","useful":0,"cool":0},"H-UrsLXbNnAy-FY0LunROA":{"text":"Always love this place.  The best French bakery outside of France! I stop everytime I'm in","useful":1,"cool":0},"3nfpPKBAPW2_7ZMP9MA_qw":{"text":"Looking for a small local cafe while on our way to the French Market. We went down Royal w","useful":0,"cool":0},"iw12jAaBcdD16ffM0cut2A":{"text":"My wife and I are spending our 10th anniversary in the Quarter and were looking for somepl","useful":1,"cool":0},"I_ZEO4nieAopZvc0s052Sw":{"text":"I stopped here on my last day in NO on my way to the airport to pick up some French pastry","useful":0,"cool":0},"trZKzP7te1bXi1RGpDDGtQ":{"text":"We visited this delightful bakery last Friday after a high recommendation by our hotel con","useful":0,"cool":0},"vc1BmFGJ-OIAG24dq1VAAQ":{"text":"The line was out the door, there was nowhere to sit inside and I was hungry. So what did I","useful":1,"cool":2},"ZWrurC8zckZKJKC7Y6XNjA":{"text":"Mm, ended up here for breakfast in our last full day in NOLA. What a cute, quaint little F","useful":0,"cool":0},"C65EPzGgcksDjiL8w0ON3A":{"text":"This place had really good coffee and was a nice place to come sit, take a break from walk","useful":1,"cool":0},"upGZEwYudb161bl7E0Oyqg":{"text":"Priced very reasonably. My lemon tart was very yummy. Definitely wished I tried the croiss","useful":1,"cool":0},"D3ax4oLybOmQKX5e2wbRcQ":{"text":"I love the retro vibe of this place, and the proximity to my hotel (The Provincial). It is","useful":0,"cool":0},"5miSFd1X0s7AAy4Gebs0MQ":{"text":"Was very pleased with the chocolate croissant I ordered. As I ate the croissant, you could","useful":0,"cool":0},"zTZE7wWBJvqoV34YFy56FA":{"text":"Tried the chocolate croissant which was very tasty. Orange juice and coffee we got with it","useful":0,"cool":0},"h4FScpSG1fXIOvChCauf1g":{"text":"Stumbled into this superb gem hidden in the quarter a couple of years ago (2008 I think)\n\n","useful":7,"cool":4},"B_4sv2O7FXzLXgGpAjtI2g":{"text":"I have been visiting NOLA for decades, and this used to be my go-to breakfast spot. My fav","useful":0,"cool":0},"9TNL6Bh6Vii6D4YU4VK1XA":{"text":"A New Orleans must-see, Croissant D'or has an unbelievable selection of baked goods.  The ","useful":0,"cool":0},"6NgV1Ql0jjI6U5m2CuI-ew":{"text":"Cute little old place but almond croissant barely had any almond and was very salty. Taste","useful":0,"cool":0},"Q-bnrRHg4UlFwXdKw7IXdQ":{"text":"I agree with fellow Yelpers that this establishment isn't the model of efficiency and it t","useful":0,"cool":0},"AOy9WmfwHj4rx4SpaMukSQ":{"text":"I randomly stumbled upon this cafe when I was wondering the streets of the quarter and fel","useful":0,"cool":0},"HpxHn4_NZnZNR0vuefqxZw":{"text":"Nice little place off the beaten path.  Looked like it's known only to the locals (at leas","useful":0,"cool":2},"qSjd7jIfSdQi3gIn5cq3TA":{"text":"I'm from Louisiana and have been eating king cake since I was a child, these are the absol","useful":2,"cool":1},"SHhVyNZZ1wfLobv5kuxGxg":{"text":"Used to be Paris quality.  Flavor is still good, but croissants are no longer as flaky.  I","useful":0,"cool":0},"cUgU-Oloz7ykiexL5fjyAw":{"text":"Croissant d'Or has been dishing up deliciousness for almost thirty years. It's a neighborh","useful":0,"cool":0},"IiMb4XEBMVnmlFAU5wBHXg":{"text":"Yum yum gimme some! \nThe raspberry croissant was totally delicious! And so was the ham and","useful":1,"cool":0},"YHsI7JE7KVDkbJyfxLc5dw":{"text":"I LOVE this place!! First of all, the cashier was so nice and sweet. We ordered lattes wit","useful":2,"cool":1},"r6s75TF6iVb3MYAT3xNVlg":{"text":"It's located on a small one way street and it's so lovely and sweet. Totally Parisian all ","useful":1,"cool":1},"EJWBu81KZ66Xw0CwtCs_pg":{"text":"WORST CAKE EVER!!!!I Locals know better than to eat here.  Ordered a red velvet cake from ","useful":2,"cool":0},"It-8rCgXp2jCun9iC9BWpg":{"text":"Amazing pastries, and amazing coffee. Just wish my cafe au lait was a little hotter. Good ","useful":0,"cool":0},"UNsexY-C0J2obDwIriij3w":{"text":"Was dying to try an almond croissant in New Orleans and headed here, based on reviews.  To","useful":0,"cool":0},"yWJ_nU5iMdrxUt2swqlzSA":{"text":"This is the only bakery I've been to in New Orleans, so I can't attest to how it stacks up","useful":3,"cool":1},"dIZBFetvDy7XG7L-xoMyhA":{"text":"The goodies they sell here are tasty; the problem is that the prices are outrageous. I can","useful":0,"cool":0},"Fh16nfQFEiZb1C_CxZ79NQ":{"text":"I've been going to New Orleans for years but didn't walk in Croissant D'Or until last year","useful":0,"cool":1},"v-02aFtdmWOCEA3KVNQPSw":{"text":"Amazing raisins Brioche, nice selection of coffee and cakes, very reasonable prices and gr","useful":0,"cool":0},"qG3eDX_03k5adREAyr6bpg":{"text":"I'm not sure what everyone else is eating, but my croissants were horrible. They were wors","useful":5,"cool":1},"EJFAY--PC8v27pyUp2AdmQ":{"text":"The almond croissant was amazing! Went with a friend, ordered a few different things and s","useful":1,"cool":0},"8PeLuKAlkHVsfN_2eF666Q":{"text":"I must've had the bad batch of croissants. Had a chocolate croissant which was very greasy","useful":2,"cool":0},"jJ1HMZ4J1NZ0H0PtUD_dmw":{"text":"I ate here 2 years ago for both breakfast and lunch on different days. More than happy bot","useful":4,"cool":3},"IGwW5FP3m2CTtP9-bmTnOA":{"text":"Very charming ambiance. We go here often for the croissants. Blueberry are delicious. We'l","useful":1,"cool":0},"DPFG_Zd_Cw_tmnXLsrOP7w":{"text":"My mouth waters as I sit dreaming about how good the king cake was last year, and feeling ","useful":4,"cool":2},"4D9z3xIgwojqRY-8C4Q0eg":{"text":"Okay chocolate croissant, madeleine and cafe au lait. I had better madeleine, coffee and c","useful":1,"cool":0},"lMPCYZij2JqtrDteNRB0zQ":{"text":"That'll teach me not to review places right away. A 20-minute walk through steamy and wet ","useful":3,"cool":0},"LrdWFgJZAskQmwpX_Z_n_Q":{"text":"Un salon de thé au calme, loin de l'agitation, on y sert de délicieuses pâtisseries, franç","useful":1,"cool":0},"7aerFGGQldDT0N_x_dFehw":{"text":"Decent, but they MICROWAVED my croissant to heat it up. It was not the mind-blowing experi","useful":0,"cool":0},"AAAopVl-Nc4sk3pYIGsEiA":{"text":"Beautiful cafe with a courtyard seating. Very peaceful place to have brunch or breakfast.","useful":0,"cool":0},"ptjsjJISn5zPw14OhrW-qQ":{"text":"It was convenient that this place was across the street from our hotel. But more than conv","useful":0,"cool":0},"jeBp0H8pbi0I8FoPmninYA":{"text":"We decided to try croissant d'or because of the recommendations we had. The positive point","useful":0,"cool":0},"2rRui-66_47hIFe6eIl9Qw":{"text":"If I hadn't been wearing sandals, my socks would have been thoroughly knocked off.  I live","useful":2,"cool":1},"45AouCK3F_mwp-3WFckzWg":{"text":"Spinach croissant with béchamel   sauce delicious,yet diminished by warming in microwave. ","useful":0,"cool":0},"sEUQcCKAt_H57YYrjHk4CA":{"text":"This is  (was) my go to place for the best croissants  in the city until today.  NEVER an ","useful":1,"cool":0},"JJhyXuphUVHwXmZ-B7F5hw":{"text":"On their last trip from New Orleans my parents gifted me some macarons from this place--so","useful":2,"cool":0},"DokszWg_Hdqgwxtt-dmN1g":{"text":"Pretty good cheese croissants. They warm them up in the microwave which seems cheezy, but ","useful":1,"cool":0},"-SN6H469Ag1AdvdAHLXBew":{"text":"Great place! Lots of delicious pastries and good coffee too. I visit here every time I com","useful":0,"cool":0},"LvriZg0KuXM3E_vFEQTfqQ":{"text":"This is probably the only building where I can tolerate the much overused \"Edison\" bulb. T","useful":0,"cool":0},"Kb58SPUkV_w-LiSXD62KrQ":{"text":"I'm a long-time fan of Croissant d'Or, to the point that I select hotels based on if the e","useful":0,"cool":0},"7s0XXgX8CRwovnOv-CpqsA":{"text":"Buttery, flaky, mouthwatering croissants are the draw at this French style pastry shop on ","useful":0,"cool":0},"v000VL4yoo_J3yYzfEk_NA":{"text":"We were in New Orleans a couple of weekends ago and had to make the stops at our regular h","useful":0,"cool":0},"XrSCNjaEYhjsVLGvFgbJTg":{"text":"I was excited to come and try this place out after having passed it one day when they were","useful":1,"cool":0},"XmQb5_T7c5UP5ggzwO4_uA":{"text":"Beautiful selection of colorful goodies that'll be making the devil on your shoulder slap ","useful":0,"cool":0},"gD7FKc0DWMEyrCbRzPEy9w":{"text":"Awesome pastries.   Had brioche Royale yummy with great coffee.    Genuine homemade goodie","useful":3,"cool":1},"zBVYzTBkyoxwEq1Xox1CBg":{"text":"Best pastries in the city.  It has a nice little  courtyard.   All in all one of my favori","useful":1,"cool":0},"daKZ-BpM_ZP_sP9X9a06mw":{"text":"Deliciousness ensues in this beautiful location in the Quarter. A lovely way to wake up af","useful":0,"cool":0},"9V9GzLULMYz767sWEUl3NQ":{"text":"Traveling to NOLA with only yourself and the wifey may seem awesome to celebrate a birthda","useful":0,"cool":0},"3vMImoqtNVJms0G9sQHB5Q":{"text":"Oh WHY didn't I go here more often when I lived in New Orleans???\n\nJust far enough into th","useful":2,"cool":1},"apupwkxuPXuOejxZHozeKQ":{"text":"people are not exaggerating when they say these may be the best croissants they've ever ha","useful":0,"cool":0},"wUa7Tsa5Ha66wDiOCWgR0A":{"text":"Best croissants. Everything from the plain croissant, raspberry croissant, chocolate crois","useful":1,"cool":0},"d7fM4uYjAJPnKkG1JGjBYA":{"text":"617 Ursulines Ave. (in the French Quarter), an excellent bakery, with just dreamy croissan","useful":4,"cool":0},"R6nkXgUYyuPZBQcksxlGlA":{"text":"Cute neighborhood shop. Buttery pastery. Good coffee. Cute shop and quick staff. We spent ","useful":0,"cool":0},"cHgOvu7cS8LrY-6IIPKp2A":{"text":"This is my favorite place for breakfast in New Orleans.  I've probably eaten here over 100","useful":2,"cool":0},"TGAXAUc7lcnuYgmvRoLFow":{"text":"The charm of the place is great. The staff is very friendly and service was great. The lat","useful":0,"cool":0},"HhsNvgBh5rJjomL0A11iJg":{"text":"The croissants were not \"the best I've ever had\" as several reviews said.  Maybe they've n","useful":0,"cool":0},"V8m6uODAdCjS6cuEZEsfow":{"text":"Ok naughty but hey it's a must if your in New Orleans ! Chock croissant and cappuccino .  ","useful":0,"cool":0},"PmVC4GFyBt1J-VnFkA9Q0A":{"text":"I've been a regular here for a few years and used to love it.  But lately I have noticed t","useful":0,"cool":0},"9QMQXaZlQvSsk1f4JOEYBg":{"text":"Service - Easy to get in and out. Off the beaten path on a quiet street and not overly cro","useful":0,"cool":0},"u5KtOMP79o_SxHzNeKEttw":{"text":"A little slice of France in New Orleans. Antique decor and outdoor backyard seating away f","useful":0,"cool":0},"DRIfwwao6vLqqwOQZHE68g":{"text":"I was told to go here, for quality pastries, etc. Reading the Yelp reviews beforehand, I w","useful":0,"cool":0},"_jgXd_8uet82bzkMJ-4foA":{"text":"It's okay place for breakfast. Fast service. Appears fancy and clean but nothing really st","useful":0,"cool":0},"BtAnvSCKVfybKv90TQrBFg":{"text":"Best inexpensive breakfast in the French Quarter. Yummy, traditional pasteries.","useful":1,"cool":0},"Z_Gvhcehkt4V2cv2CiJqlw":{"text":"Wonderful croissants and atmosphere! Each of the croissants, sweet and savory, were delici","useful":0,"cool":0},"XaG6oOOT7-nzHbba0OIWxA":{"text":"My ham and cheese croissant was just OK, and a little too greasy. It's a pretty, old-world","useful":0,"cool":0},"aoJ-htUyOzKnU5BM3fPdzw":{"text":"My whole family loves this place. We go here for breakfast every time we visit our condo. ","useful":0,"cool":0},"GaJKQUwcdG9tLQjXPNwmQQ":{"text":"A quiet clean non-descript coffee shop where you can get some delicious pastries at a reas","useful":0,"cool":0},"XBa-r-ifs-YATQsD1JgWLA":{"text":"The best croissant I've ever had!  Don't really need to say anything else but I will.  The","useful":1,"cool":0},"BoqYflbe5o0O3Fj5d1zX9g":{"text":"Croissants were better than average, but not amazing. \nThe wait in line was way longer tha","useful":1,"cool":0},"jdgb_K0ITanMOxv253ZN6w":{"text":"So that infamous tourist book my mother picked up drew us here.  This is my favorite spot ","useful":2,"cool":1},"hLIvT5J2b9rshQzeYYXrKQ":{"text":"Perfect little chocolate dog-turds tucked away in a flakey blanket of none too sweet dough","useful":0,"cool":0},"VR7y2AhUGb3odC3VaP6GpQ":{"text":"Best almond croissants I've had, really cute place with friendly staff. The other pastries","useful":0,"cool":0},"-GK5H02EM1hw9f3FTrtmOg":{"text":"This place is a ridiculously cute little french cafe. I just had a croissant but my boyfri","useful":0,"cool":0},"GJYHNf0JzyWxcti1u7uGhg":{"text":"So... This place definitely isn't cheap. But, the croissants are to die for! Buttery, flak","useful":0,"cool":0},"bAnFZp09-rTME28Nz8ftUw":{"text":"The food is good-- definitely worth the wait if there's a line.  You may have to bus your ","useful":0,"cool":0},"sJ9yzRG04JAV3UBknpgFIA":{"text":"A pastry/coffee shop that has a $10 minimum on credit card purchases??\n\nAnd then you give ","useful":0,"cool":0},"0NZDwnZg0pjdL9S2Zk2hqQ":{"text":"Can I get a round of applause for this lovely French bakery tucked away in the French Quar","useful":0,"cool":1},"aYKaPTyKNffEjUAfQSadHQ":{"text":"Delicious croissants, especially the almond croissants. We took the advice of other Yelp p","useful":0,"cool":0},"MwIncuycBsDO2XC4dY_CVg":{"text":"Perfect place for breakfast, options range from healthy fruit salads to almond croissants ","useful":0,"cool":0},"qPeeCqaQPbQTualCNx-5RA":{"text":"Delicious! Great food in an awesome spot a little off the beaten path in the French quarte","useful":4,"cool":3},"QcVVQ9222uIaOGQALO3Rwg":{"text":"Let me start off by saying most of the people giving this place good reviews must be used ","useful":5,"cool":1},"KGEQHLydhQrgzHAoV4CaPQ":{"text":"Terrible service. The girl at the counter waited on one person continuing to have a conver","useful":2,"cool":0},"Ix8X4XeYz4kwwCNO8RnotQ":{"text":"Yelpers totally let me down on this one.  With 4+ stars on yelp, I walked out of my way to","useful":6,"cool":0},"L93eJ0AcUfohaaTerG150w":{"text":"I wish I had found this place sooner. The croissants here are far more amazing than any I ","useful":0,"cool":0},"M0YCLuQ_VxCaNWcWTFIv2g":{"text":"I discovered Croissant D'Or on my first trip to New Orleans in 1990 and have visited it on","useful":0,"cool":0},"tM7z1Fb3GxTCM_OYMwYT6A":{"text":"I have to agree with other customers that there's nothing to rave about this spot. I was s","useful":0,"cool":0},"3gOSc4RDuZBtqvKSRD-Yaw":{"text":"This place is mind boggling. First of all, the croissants are totally worth the risk of fo","useful":2,"cool":1},"Wp8dyM8fiL5_YtjreOJqsA":{"text":"Decent and cheap breakfast, but what really stands out are the pastries. It's an excellent","useful":0,"cool":0},"kAy6Y20bu2MwWKgX7Q7ang":{"text":"This is the best place to go for a light Breakfast or coffee. The croissants are the best ","useful":0,"cool":0},"ZGQLvvsO2vtm1Yma4risyA":{"text":"So we walked around which seemed like forever and got lost during the voyage there. Finall","useful":0,"cool":0},"bQQJ8SEaAvBlaO8M1q2JbA":{"text":"Great place, the pastries or unbelievable, especially the Napoleon's and Croissants.\n\nThey","useful":0,"cool":0},"LujSPSRhAkRPmJhFqMChhg":{"text":"Horrible - was looking forward to a fresh croissant the entire trip - old greasy dense - e","useful":0,"cool":0},"3DdeuYJOubYwa_klIaUovA":{"text":"Was in search for a place with a decent croissant and this popped up in my search. Althoug","useful":0,"cool":0},"w3UlI36rgvv8PBgxnDFiJQ":{"text":"I enjoyed my croissant, but my wife is the connoisseur.  She was disappointed.  They were ","useful":0,"cool":0},"-s2UiX35BxrNe5VzJWIqgA":{"text":"Cute little pastry spot near my hotel with a stay in the French quarters. Main reason we s","useful":0,"cool":0},"yi6SEEul8WELBG1CHH42sw":{"text":"Fantastic! Simple but elegant place with selection of breakfast and dessert/treat croissan","useful":0,"cool":0},"1QNUIwxAACqmF63BPu3HNQ":{"text":"What a magical spot to breakfast. I loved the beautiful little courtyard out back. The pri","useful":4,"cool":3},"HFdlPG8bw9z6e63WpA-Pzg":{"text":"I really looked forward to going back to Croissant D'or Patisserir this second time in NOL","useful":0,"cool":0},"lzL_P9TKcIxJqQZWaJ4LQg":{"text":"I had a chicken salad croissant sandwich. The croissant was buttery deliciousness, moist a","useful":0,"cool":0},"jLi_3akWmwlFThkkcLBySg":{"text":"My sis and I walked just over a mile to try Croissant D'or Patisserie and it was sooooo wo","useful":7,"cool":7},"O-SpmXUkEvnXJGOfdZgfZg":{"text":"Simply LOVE this patisserie! The best almond croissants ever! Waiting today to finish my o","useful":1,"cool":0},"YOMQ2rl6wxj_J9uW2_ZTpw":{"text":"Consistently delicious spot, a bit off the beaten path. Counter service of French pastries","useful":0,"cool":0},"jtjuECBxtQ_3ytO2YDQrSw":{"text":"Went in for lunch and besides our two sandwiches, I bought $25 worth of baked goods (to go","useful":7,"cool":0},"PE0SWXm_4lp38yJ-PXV3Fw":{"text":"Was so excited to try out this place but it was closed on a Tuesday. Went in the next afte","useful":0,"cool":0},"rCViW-bY_sH2ldTXd-N5UA":{"text":"Loved this place! Looked for a bakery and found this amazing gem about 2 blocks from our h","useful":0,"cool":0},"AMEnIYHgxlv5fHi94bRYag":{"text":"Perfectly enjoyable latte. Delicious and robust, yet smooth. On the other hand, my wife an","useful":1,"cool":0},"4qyQECD1sD8zWwmH2u-UDA":{"text":"Absolutely wonderful to eat tons of sweets and pastries. Croissants, cakes - it's incredib","useful":1,"cool":0},"-dw6EbKgjNVqLIgot1Novg":{"text":"Love this place, just love it.  Great quality at reasonable prices makes me want to come b","useful":0,"cool":0},"FJo_I0M3dBN-OJBkZe6uMQ":{"text":"Bought a variety of pastries, and the coconut macaroon and the almond croissant are HEAVEN","useful":1,"cool":0},"qBN-0pxSFyQaMQgZjD8ALg":{"text":"I honestly love this place more than I love Cafe Du Monde.  This is where you really get t","useful":5,"cool":3},"fMJrLLw8iIMzbq8PLo7Gqg":{"text":"side of hash? no\ngrits? no\ndeep fried everything under the sun? no\nbut  if you want authen","useful":0,"cool":0},"F70lch8tfwcb4wM7H9Z31w":{"text":"Another miss in NOLA. I was so excited about stopping here for pastries after lunch. The p","useful":6,"cool":0},"vcBF3_xALByRJ-ITns0OKA":{"text":"As a Quarterite I've been going here for 20 years.  Atmosphere is wonderful even when it's","useful":0,"cool":0},"c8mEx7lMpXNvC4smh3TBOw":{"text":"We ordered the Christmas Yule log for Christmas Eve. It was wonderful. We ate it for three","useful":0,"cool":0},"kIKUDyHKQRP4c8H5zxLk1g":{"text":"This cafe was noted as having the best Croissant in New Orleans so I made a bee line for t","useful":1,"cool":0},"2-oRXmTshs8pgyuE70dNPA":{"text":"Yelp needs to re-evaluate the reviews based on all the recent low ratings. Wish I would ha","useful":0,"cool":0},"GR2rBAMF7SU0TthIZSClXw":{"text":"Their croissants are heaven on earth and the place makes you feel like you've been transpo","useful":0,"cool":0},"8gRKYV5svcYqrAW1Ao8FQg":{"text":"This place is amazing! I love the ham and gouda croissant. We sat next to French tourists ","useful":1,"cool":1},"DcKJijzn5GfpQLis9wWcew":{"text":"They have the best cheese danish I've ever had.  We eat here every single morning in Nola ","useful":1,"cool":1},"MYYsqxBynk9Zg5hYdr3QoA":{"text":"This is a weak cup of coffee. Didn't get a pastry, but not a very big selection. At least ","useful":0,"cool":0},"cQ7avgn2VkxjGaQiMJfO-A":{"text":"This is a real gem in the Quarter. Great coffee and espresso drinks and pastries that are ","useful":0,"cool":0},"hRgrbkShH1QjaBqo8SSkTQ":{"text":"I had the best tuna salad croissant of MY LIFE at this little cafe and the coffee was also","useful":1,"cool":0},"Ln7BSlJKPmekHdeMxCqclA":{"text":"As a Quarterite I've been going here for 20 years.  Atmosphere is wonderful even when it's","useful":0,"cool":0},"vibY3zIo62cBcZasF0CHSA":{"text":"I am so glad I found this place- it is wonderful! Whoever I travel, I look for local baker","useful":4,"cool":1},"IZ6NS6blczz64djmWhT_eQ":{"text":"I am a lifelong French Quarter resident, and a long time patron of this establishment. I h","useful":0,"cool":0},"S6zuODXjnwifyp-RW4NWYQ":{"text":"This place and the owner/staff ROCKS.  I've been to this place many times while visiting N","useful":1,"cool":0},"p36zGD2ushieucm_PPQgUw":{"text":"Used to be good, years ago.  The first time I came here was in July 2005.  Now it just mak","useful":0,"cool":0},"pqoqcN07ZlPBXELOrvxPyg":{"text":"The coffee house aka cafe d'or has the best croissant in the city. It has also the clean w","useful":5,"cool":3},"n9xbqtw3qt2ZXoyspSw3yA":{"text":"Made a special trip on our walk through the French Quarter to try out the pastries here.  ","useful":2,"cool":0},"zKKW3DyuA1wed-SP41R8oA":{"text":"Although Philippe was surprised that there seemed to be a privateer party so early in the ","useful":0,"cool":0},"eoWPYvU8_K9YIUwhOuo42A":{"text":"granted, it has been a while since I ate here, but I have eaten here may be a dozen times ","useful":0,"cool":0},"aKrCWKESZPZxjb3TfW6sVQ":{"text":"I was a little disappointed.  I was hoping for so much when reading the reviews.  The croi","useful":0,"cool":0},"MwUyP8N5FXGVtN8D2aL43Q":{"text":"Very slow service but the food was pretty good. The \" outside courtyard \" was a stretch. I","useful":0,"cool":0},"seKiCNTJbOnv6L7KsxRE0g":{"text":"Yup, i'd go there again for something different than your typical seafood Nola breakfast o","useful":3,"cool":0},"IXWG079laqtcoen0CNPc6A":{"text":"We been in a few times for breakfast. Croissants are seriously good. I've been to Paris an","useful":0,"cool":0},"m8gwZhcE8IMdy1TON50nxQ":{"text":"This is the best croissant in town.  I like to bike through the french quarter on a saturd","useful":1,"cool":0},"-0p6rqHfV-yUfoWAr9HeQQ":{"text":"This is a cute bakery. It was a bit cold when I was there, but I know I would enjoy it if ","useful":0,"cool":0},"hmHNbpCkSi4YZTbfaGddKA":{"text":"Best croissant ever! Authentic beautiful little French café. It is very charming here. Don","useful":0,"cool":0},"W_JmLkaj_C4hZFos4O2JKA":{"text":"I have been going to this place since it opened. It was sold and the new owners have have ","useful":0,"cool":0},"xmh5hMxUM-PiUwyaqKk6hA":{"text":"This place is a gem! The pastry are so delicious, wonderful breakfast sandwiches. You step","useful":0,"cool":0},"FeVjK0DyOzYZpnmQKHMs-w":{"text":"Not sure how much more disappointed I could be with a French place in the French Quarter.\n","useful":33,"cool":29},"pHASG4US-9Kt-027iL6akA":{"text":"This place is a total hidden jewel.  The food is fantastic (pastries, quiches, etc.), as i","useful":0,"cool":0},"21u1upjgQLbzb1jbNTbe_g":{"text":"I really, really liked this place. There's a small line to get in and order, but a 10 minu","useful":0,"cool":0},"0dQbD6090uFhdVqpofQkMw":{"text":"Excellent little jewel deep in the FQ between Royal and Charters with excellent pastries a","useful":2,"cool":1},"PBRDNxEjBv1DAaliT6oiKw":{"text":"I came here over 15 year ago and back then, it felt that I found a hidden gem (at least hi","useful":1,"cool":0},"zn-X1MaT5lS74I15EeuQpQ":{"text":"One of our favorite spots.  The pastries are divine and they have wonderful (but simple) b","useful":0,"cool":0},"LKXI6XSw7ocjeKIDlL0rcg":{"text":"Beautiful cafe with courtyard setting. Pictures on web do not do this justice.  Wonderful ","useful":0,"cool":0},"8qzVoK7rmqit4aDbyJMynw":{"text":"The place is overrated.   The croissants are not very good and quite small.   Coffee was j","useful":0,"cool":0},"hGQ1YKX2jWLcsj6RYE6zLQ":{"text":"One of my favorite bakeries. It's in the French Quarter, operates by the owner with attent","useful":0,"cool":0},"Yp7P9RmLB2Pi1eObv-X3CQ":{"text":"My almond croissant was OK. Not as flaky and/or buttery as I've come to expect of great cr","useful":1,"cool":0},"j4gHCpJ-3nlh2EdjxC2Ycw":{"text":"Walking pass on Halloween night and I tell myself that I'll have to come here!\nAnd wow wow","useful":0,"cool":0},"7TRETXhhY3GvkFiamaD_gw":{"text":"Cute Café in the French quarter, it was quiet and simple. The croissant with egg and ham w","useful":0,"cool":0},"2NmC0xtnL2pmuphm2PeBkA":{"text":"I dragged my husband out to this bakery because I thought hey, good yelp reviews and the n","useful":2,"cool":1},"gcfTwp0T_HsoeZJH8u1cQw":{"text":"Tried the butter, chocolate, and almond croissants and they were all three amazing; but, t","useful":0,"cool":0},"xfsAOk3lrS9dakMiRyhdAA":{"text":"Best locals breakfast. The desserts are awesome. Always fresh and nice and cold A/C inside","useful":0,"cool":0},"2Q8ZIOg6F5GrbuKJPeRrJA":{"text":"Solid pastry shop in NOLA - picked up an almond croissant, hot earl gray tea and brioche r","useful":0,"cool":0},"sQ-nfbvjohMV4-YAvS5Few":{"text":"The shop was literally right across the street from our hotel so I was excited to eat ther","useful":0,"cool":0},"pb8tG2K-QSVve3KxxAgmug":{"text":"Awesome staff, happy to help.    almond croissants that are as good as it gets.  Excellent","useful":0,"cool":0},"VJ7bsp36x_ajcqRilG1i0w":{"text":"Maaaaaybe there is a better croissant, but I haven't found one any where but here. That wa","useful":4,"cool":1},"dvof8rD8yR78SfNQJ1Cw0g":{"text":"I wish I'd found this place earlier in my trip to New Orleans! The atmosphere was charming","useful":0,"cool":0},"KGcG8vzAqFi-dsUTU2o5DA":{"text":"Beautiful place, loved the back open patio, we had birds make us company as we enjoyed bre","useful":0,"cool":0},"Usj1xDAZZprhlJ3R8qjyqw":{"text":"Ducked in during a sudden down pour and decided to grab some café Au Lait and some pastrie","useful":0,"cool":0},"AWMcwK9tuju45siprABETw":{"text":"Was kind of disappointed because apparently the gallete de rose is only available certain ","useful":0,"cool":0},"l4VAdf_GGPG2Kfs_rNMhjQ":{"text":"I love this place... I love the cute little courtyard, the strong coffee, the funky vibe..","useful":0,"cool":0},"fuG7Ku4CLwpnrJshqdOZ4g":{"text":"I never liked croissants before I came to Croissant D'or!\n\nTried the ham and cheese, almon","useful":1,"cool":0},"EWmftnY7XMm3MKltKu3GOQ":{"text":"Nice, roomy, airy and cute place with lots of seating. It was nice to step in right before","useful":0,"cool":0},"3Q9g30Fq_gbnaLeHFuz8xw":{"text":"Delicious and terrific quality food.  But I feel we were a burden to the server who actual","useful":0,"cool":0},"o6sK4e5eS9-ReuKkLCVhOA":{"text":"We loved this place! \n\nWe did a walking tour of the French Quarter, and our tour guide rec","useful":0,"cool":0},"A3jUTs9KxxEWeIATzIRAyA":{"text":"31 years ago, my foster parents brought me here every weekend. It is with tears of joy, th","useful":0,"cool":0},"ot7wtF8UlYuzkJCD9k2J1Q":{"text":"i used to go here a lot and recomend it to every one. unfortunately there are new owners w","useful":0,"cool":0},"HQbLheG3NdHjbzpyBXEyiQ":{"text":"We discovered this treasure our last morning in New Orleans. What a fabulous find!!! As we","useful":0,"cool":0},"YKb2m-t1kGRpsBieNwzTig":{"text":"The bakery items were amazing.  The croissants were so flaky and buttery! The fruit tart w","useful":0,"cool":0},"lPblmnhFri9PPLWpdHleWg":{"text":"I just came from this place and I LOVE it. It is an adorable little french cafe right in t","useful":1,"cool":1},"rsBaVwKxk31fYT9UTZ1jaQ":{"text":"Ratatouille omelette, you complete me.  Very cute neighborhood spot.  This omelette is ser","useful":0,"cool":2},"rRnd7x2F2bXfc-8SoF1R5g":{"text":"One of the most beautiful and peaceful spaces I've been to in New Orleans. The staff was s","useful":0,"cool":0},"F35VcIH86mln5gr3J8VOgQ":{"text":"This is my favorite bakery in NOLA!  Chocolate croissants are #1 butter, flaky and super d","useful":0,"cool":0},"r5j4ubjLF-53phcN7rJDNQ":{"text":"Stop here for an afternoon sweet treat. Had their famous almond croissant and mint tea.Yum","useful":1,"cool":0},"heDEQjhFbjwi6dCfFNUODQ":{"text":"This adorable little French patisserie in the Quarter served me up just what I needed for ","useful":8,"cool":5},"KssQT9Ly0Kb2HKBTOs2GjA":{"text":"This place is wonderful for a cool down after walking all morning! The pastries are so del","useful":0,"cool":0},"FcCc3G2_6GUZKLfy9euHWw":{"text":"Forget cafe du Monde. This place has it beat.  Not too too crowded and the pastries are ma","useful":0,"cool":0},"HMExCZ8WIKwFSFsK8woFUA":{"text":"A super cute French inspired bakery and cafe. Nice and cool inside with a charming courtya","useful":0,"cool":0},"PjbGCeQMcsrcsKp9d8MFXA":{"text":"This was a very cute place that we found on Yelp and we went for breakfast. The line was j","useful":3,"cool":0},"NweeSF8ebnVUAjDIBvo17A":{"text":"Cold croissant that tasted like white bread. Surly service that made us feel like 50 cents","useful":1,"cool":0},"NFAx95VaA6s2XQ5mQOz0ew":{"text":"Parisienne cafe like no other. Formerly the famous Braccato's Italian bakery that's now in","useful":1,"cool":0},"k6rtrYCgQx0iyjRO5URSyA":{"text":"You're in NOLA but stepping in little shop is like taking a step over into Paris.   Beauti","useful":0,"cool":0},"9hIWfxTHXI-ZIvCcf1x4ZQ":{"text":"2 Words: Beignets and Chocolate Croissants\n(okay, so that works out to 4 words, but you ge","useful":3,"cool":2},"Pb6Y7yLj_-lW15JrDs9Y7A":{"text":"Beautiful coffee shop, amazing croissants, cat fingers and meringues.  Do try it out.  Thi","useful":0,"cool":0},"iw6D8X8pPup-tojLhomvZg":{"text":"I was very excited when I read the rave reviews. After waiting in line for about 20 minute","useful":0,"cool":0},"DfDJY7NMyteHFIxZxo7wsQ":{"text":"cappuccino was perfect, but the baklava and chocolate eclair were old, tasteless, and dry.","useful":0,"cool":0},"guQmIQU8-jPJLn5JUfrLTg":{"text":"Came in and the place was packed. Large groups of people were saving tables while the rest","useful":1,"cool":0},"1dOInhW2Y03aNC-5PBOiXA":{"text":"My absolute favorite croissants!  AND the croissant turkey sandwich is fantastic too.\n\nI'm","useful":1,"cool":0},"gNLOjC1BE1krdHPndkaV3g":{"text":"Everything about this place felt like a street in Paris. It was away from the crowds, had ","useful":0,"cool":0},"0-2gnjExB5eFq_jCrFUZOA":{"text":"Love this old school space in the back of the quarter (location of the original Angelo Bro","useful":8,"cool":4},"YYDFj1DNtPQ04vERUa4q2g":{"text":"I came in here for a little something to hold me over until my brunch later in the afterno","useful":0,"cool":0},"0vlIJpPfqORx_qGfEyAkPA":{"text":"My favorite bakery in New Orleans has an old fashioned interior and a lovely interior cour","useful":3,"cool":3},"a4bwjbXMLK5ZNgptmpkbiw":{"text":"This is a lovely place for breakfast. They offer a beautiful array of home made pastries a","useful":1,"cool":1},"sXRMxDyWBW7A2hHnF6NXtw":{"text":"The \"Golden Croissant\" is a welcome reprieve from the bustling and oft-pungent French Quar","useful":2,"cool":0},"ZCw_SF2vJq3BVj2lDtaEkw":{"text":"Lovely french cafe off the beat and grind of the Quarter! Fresh croissants! We had a ham a","useful":2,"cool":1},"Mu9LBtB6PI6bSNhjqYDrsA":{"text":"Give me bread or give me death. Croissant D'Or Patisserie is THE mecca of yummy croissants","useful":11,"cool":4},"UWUH4v-ug26C6szlt2_HLg":{"text":"The best bakery in New Orleans. We have eaten here many times while vacationing in New Orl","useful":0,"cool":0},"gKf-5SIl3fh7n_0ov-4diA":{"text":"I rarely review and wish I could say better things about a cute little non commercial plac","useful":0,"cool":0},"kDOBWwAHM3SnfFRnoJaXSA":{"text":"I visited this place every single morning of my 4-day stay at the nearby Hotel Provincial,","useful":2,"cool":0},"jb2ITMQZSwZAVyQlZoVvPA":{"text":"Hands down the best bakery or patisserie we've ever been to.  The croissant and other good","useful":1,"cool":1},"Qcvhb8FtH7htb49n6fgz3Q":{"text":"Located in old Angelo Brocato on Ursuline it still has the old world charm of tile floors ","useful":1,"cool":1},"0JViz7-APOt0H3QOh3MC0w":{"text":"There is something magical about this place. We have enjoyed their pastries every time we ","useful":0,"cool":0},"r28iycu_DLlJazfIITdzuw":{"text":"Delicious pastries and sandwiches, awesome space, and the employees were SO kind to our ki","useful":0,"cool":0},"ZOlLzr3XyfKPqx6iF2vvIw":{"text":"I love this place!   Using Yelp for a place for breakfast, the search listed Croissant D'O","useful":1,"cool":0},"0vi2GIy3vRUAqUI6U0Nhmg":{"text":"Bieten sehr gutes Frühstück und diverse Torten an. Croissants sind sehr gut. Angenehme Atm","useful":0,"cool":0},"fObMFV-IHG6n_jqU3h8fhw":{"text":"GREAT Breakfast sandwiches . Crossaints and pastries are great. Gets only 4 stars due to h","useful":0,"cool":0},"Giani5WSAPJHSL8VBses9g":{"text":"I was told this was the best croissant in NOLA. It's not at all , the croissants are avera","useful":0,"cool":0},"K-6WfL0zjlEuDaePkF5J3w":{"text":"With 100 or so good reviews you should know you need to try this place!!! It has great atm","useful":2,"cool":0},"nYIZOeMCJq9ULuA7D9zbbQ":{"text":"Best croissants and danish outside of Paris. Off the major roads, nice quaint atmosphere, ","useful":1,"cool":0},"1iD82daGx1YMnCQTY7IBUQ":{"text":"Best croissants& pasteries in NOLA . Almond and chocolate croissants were amazing !!!","useful":0,"cool":1},"_VYxPEoB6rtMOTeG_qJAOA":{"text":"I had been researching the pastry shoppes of New Orleans for months before I finally took ","useful":4,"cool":3},"WvGDVI7L7I2ndlTMY9kL_g":{"text":"Excellent croissants and coffee. Adorable courtyard. The croissants are almost glazed like","useful":0,"cool":0},"4h3q-8aRjEXb2Us4QL7i6A":{"text":"Like others have said, this place is the place to go for coffee and pastries. The great th","useful":0,"cool":0},"oFRq58IQTar9xgJBFkBh6A":{"text":"Cute place and nice service, but that was about it. The chocolate croissant was ok, at bes","useful":6,"cool":6},"-V-yqnn7_98u3eFd5pOwgg":{"text":"A true favorite place of mine in NOLA. \n\nCroissants aren't a usual craving of mine. But ev","useful":5,"cool":4},"MESzCH7dGgS2Fgd8PSclAA":{"text":"Croissant d'or has a delicious light flaky spinach quiche without cheese and an almond cro","useful":5,"cool":2},"To8q6eaRCAm0v3GAo2iH1Q":{"text":"I really wanted to like this place after hearing so many great things but my croissant was","useful":1,"cool":0},"_b3b6FnfRWCAQFs3Lx2K6Q":{"text":"I was there recently on a Sunday and had the Cafe au Lait and a Chicken Salad croissant--b","useful":4,"cool":1},"QmrnH_INOd7GFUripRj2DQ":{"text":"Really excellent food and service. Super cute decor. Great spot for grabbing a bite while ","useful":0,"cool":0},"JJqJQp0b42bhyp2HDCR43Q":{"text":"This place is really as good as it gets!   Situated in the French Quarter, when you walk i","useful":3,"cool":2},"IAGAD8L1mTqWDjIAryRsWA":{"text":"This is a excellent place to eat desert in New Orleans.  I highly recommend anyone eating ","useful":0,"cool":1},"G6lTDiZ-yynx3qFf5U3w6w":{"text":"Friendly service, great quiche and delicious coffee. Cool location inside the French quart","useful":0,"cool":0},"hvm9k5cCzpZrKUjeYBeCtg":{"text":"Absolutely LOVE this place!!! The owner is so nice and welcoming. Everything is freshly ba","useful":0,"cool":0},"rGs27DPai5G3gh5JUJejgQ":{"text":"It's a lovely restaurant.  There's an indoor setting as well as a little outdoor garden ar","useful":1,"cool":1},"d39kO7zA3J9vi01nLdNf5A":{"text":"I love the ambiance of this place - it's an excellent hole-in-the-wall hideaway to duck in","useful":2,"cool":0},"dSc4Wr0EX9tEbYxk1t_QcQ":{"text":"Far From the Madding Crowd.\n\nWhile most tourists, and even addicted sparrows, can follow t","useful":9,"cool":8},"o1SIaaCumx3hp08yyXg0rw":{"text":"This a cute and fast little stop that's perfect if your breakfasting on a budget or lookin","useful":1,"cool":0},"r4XVdcbWCwBfn3O3s2oVRA":{"text":"We ordered the fresh squeezed OJ and the Frangipane at this retro feel cafe. Both items we","useful":1,"cool":1},"TG6QHAQAF5Z29hBYFuHWxg":{"text":"What a gem! The service here is wonderful and their pastries are the best I've found in th","useful":0,"cool":0},"vqrSXA33aEFneqgBXxPupg":{"text":"This Patisserie stands on its own. No beignets to draw the tourists. The waiting line is m","useful":2,"cool":1},"0VqqTu8EAtV7tyJO2awhLg":{"text":"We were on our food tour, and our tour guide suggested to go here . The next morning , we ","useful":0,"cool":0},"IOLNReDValFswrtvb2SsXw":{"text":"A+ service. They have signs showing what they have that day as well as cases of beautiful ","useful":2,"cool":3},"0g-A3hNE1yW2BBlROgC2RA":{"text":"This was exactly what I've been looking for! A French style patisserie with delicious croi","useful":1,"cool":0},"Z8kE737QWp7TZGoycghnlA":{"text":"This place never fails. The most delicious bakery in NOLA. The coffee is delicious. \n\nMust","useful":1,"cool":1},"mw0QhNYe5CizoJi-LCL6CA":{"text":"For 13 dollars I was expecting the best breakfast sandwich of my life.   Or at least one m","useful":0,"cool":0},"vvdONGxLJ1If5GER1UNfhg":{"text":"When I say that the almond croissant here was the best thing I put in mah mouth all weeken","useful":10,"cool":9},"DVeT68gSNUV2J1-4JnJY8g":{"text":"Love the experience of eating a croissant with coffee out in the courtyard. Croissants are","useful":1,"cool":0},"ncWwREi7QNWuHD1TU-ITuQ":{"text":"The food was good but really disappointed they microwave the croissant.  It made it a bit ","useful":1,"cool":0},"T07Dg4J7a9NUHTa7Kfi-5g":{"text":"This was a great spot for a light breakfast. Almond and sausage croissants were both great","useful":1,"cool":0},"O2R2SuGDw6HLdoGnnnETrw":{"text":"Perfect coffee! I had the regular coffee black and it had wonderful flavor. I also tried t","useful":0,"cool":0},"Vk7Zwy8a0sYZK0gz2M84AA":{"text":"MARZIPAN-HUED display of dozens of beautiful sweet and savory pastries:\nVIENNESE: café amb","useful":7,"cool":2},"zsqDIlRhBixHlLRZJKLBLA":{"text":"Croissant D'Or Patisserie was recommended by Jonathan Weiss during a tour and I was excite","useful":8,"cool":7},"_2B8n_kz7jYp3OR7fgXWlA":{"text":"White walls, ornate molding, octagon tile floors. While New Orleans has something of a rep","useful":1,"cool":3},"8KD0FFbL29jouqGazolOlA":{"text":"The croissants here are almost better than France. I ordered the full breakfast with some ","useful":2,"cool":2},"u-4IxyJMSkOD6cWH7PU2lw":{"text":"This was my last coffee before heading out of town and also...my first crawfish cheesecake","useful":3,"cool":5},"5o2LvJ01gXztcb2_EnypoA":{"text":"I feel like I was in a cute little french cafe. It smells amazing when you walk in. I orde","useful":1,"cool":1},"uTpCjr-neeEPM2xqr5E51g":{"text":"AFTER 35 YEARS IT LOOKS THE SAME YUMMMM!\n\nMy first breakfast in New Orleans the weekend be","useful":7,"cool":5},"18vIc0zGGtcekqNU9uajEA":{"text":"Oh my word. I got the chicken, which is a chicken shaped confection with Grand Marnier but","useful":13,"cool":11},"52l6-Vrd1h4r3xTvdLCZrg":{"text":"This has been my n'hood coffee shop and bakery for over 2 decades as a resident of the Qua","useful":0,"cool":0},"Cs8FSdNBw7a-6MDveVVHsg":{"text":"Our last day on our first trip to New Orleans and we finally made to Croissant D'or. We ca","useful":3,"cool":1},"-tzIZEvxEhyMUa4YjDEdDA":{"text":"I went here to grab a quick bite before leaving town. The ham and cheese croissant was del","useful":0,"cool":0},"Wf9iUG1fCiMvyAW7yMLo-g":{"text":"It was a bit late in the morning when we finally made it out of the hotel and onto the str","useful":2,"cool":1},"dmoZVr-_DKA5xFdaJKDwyQ":{"text":"HORRIBLE!!!! I had the worst almond croissant of my life here two days ago. Two bites and ","useful":2,"cool":0},"esJTv_2X_cLNLYR_yamKDw":{"text":"This was recommended to us by a tour guide during our Dark History tour. I have to admit t","useful":2,"cool":1},"2J6rAnh6hYf3i_-kMqzMRA":{"text":"The fountain was peeing...no joke.  My daughter giggled like a 3 year-old and blushed.  No","useful":3,"cool":2},"GDUz5eZTWhbS8yw4_HuUAA":{"text":"Outside of France, this is hands down the best breakfast / pastry spot in the US. Forget a","useful":0,"cool":0},"P3LMCcxzCWupiwCr1zYbww":{"text":"Avacodo Toast with Bacon sitting in the garden with a cup of coffee as a cheese danish; wh","useful":0,"cool":0},"Wi-LxFrta1BTpmAaVnR-xg":{"text":"Not a destination place, but good.\n\nWe had croissants that were tasty and moist, but far f","useful":7,"cool":4},"mpNR8We4YDW60gfVhPvOdA":{"text":"I regrettably not do not frequent as much as I would like to because of my sugar addiction","useful":1,"cool":0},"PTSPqcWClJxJe2B81FjsOQ":{"text":"Far from the madding crowds of the French Quarter, this bakery is a haven for those seekin","useful":8,"cool":7},"HDY0ZBfbflMkirOdbYS5pg":{"text":"Love their croissants! The almond is my favorite. Tastes just like the ones we had in Pari","useful":0,"cool":0},"CXhBG78yr6hqGnFnYBUo1g":{"text":"Fast Facts:\n- Casual breakfast spot for early risers, other than Cafe du Monde. \n- Cafe Au","useful":7,"cool":4},"K7jluEy66iLwIbtLj5sEhQ":{"text":"Vietnamese owned bakery with great pastries in the original Angelo Brocato's location with","useful":2,"cool":2},"0OAdG-aQ5XG8yD9sOS6cug":{"text":"Initially, we passed by on a Tuesday, the only day of the week it's closed; we went back t","useful":0,"cool":0},"YEPNGB_o4kDEfM4mcnwCxw":{"text":"Simply extraordinary! The avocado toast is perfection, and the cappuccino is magnificent.","useful":0,"cool":1},"qnRBYiGKq4Xw1M_mV8tsiw":{"text":"Delicious pastry.  Best Croissants anywhere! but when we went there on Saturday at 10:30, ","useful":0,"cool":0},"C0QQT_vy95nrn6HHwWygFw":{"text":"I had read a great review of their almond croissant (which are my favorite). $6 gets you a","useful":0,"cool":0},"tqp2DE8iWQCNAxL2jkGdLw":{"text":"Very high quality pastries, and reasonable prices for the combination of great taste/beaut","useful":0,"cool":1},"iL7DI1io6EyYXey-SNnNww":{"text":"Definitely NOT what it used to be. \nThe traditional Croissant is not as flaky and elegant ","useful":0,"cool":0},"5J3yxGheMnfNU4mzvxQ0QA":{"text":"Cute little spot, used to be an Angelo Brocato location 100 years ago! ( see the tile door","useful":0,"cool":0},"v4egP5YzTCcoB7uYTPlGvQ":{"text":"I absolutely love this place. I am hesitant to write this review because I find it peacefu","useful":2,"cool":2},"t2q_kJpX4hjveBYlWAGoUg":{"text":"Had late Sunday morning breakfast.\n1. Almond milk latte was strong\n2. Salmon avocado toast","useful":1,"cool":1},"0-h2w6s243EMdKVE2iiX6w":{"text":"We stayed on the same block and stopped here every morning for coffee and pastry/sandwich.","useful":0,"cool":0},"BQJTppnhd8IlKee-L7HctQ":{"text":"Smells great as you walk in. Large selection of filled croissants. The apple was my person","useful":4,"cool":2},"pTuXTffGXWiODnp_K5O5gA":{"text":"We went here for breakfast and the croissants are so delicious and buttery! I got a chocol","useful":0,"cool":0},"ovKs2xJZL6ns-ixu006xiA":{"text":"Omg....delicious!!!!   We had the pate baguette, salami croissant, and tarelette au citron","useful":1,"cool":1},"Yxq0eBwe-ezFceUhO61nfA":{"text":"The food was okay.  Our party had a breakfast croissant, grilled chicken on a croissant, a","useful":1,"cool":0},"5Ji8mXOadcgbACXem3HTZA":{"text":"This place is so cute. Stopped here to grab some breakfast across from our hotel. I ordere","useful":0,"cool":0},"cmvCgenKzumSidoU9k3oLw":{"text":"The pastries were so delicious, the breakfast sandwich was filling, and it may have been t","useful":1,"cool":0},"w-uaBbznLuxAVmtxWT846Q":{"text":"Excellent croissants and not crowded. Friendly staff with a nice cafe and courtyard to eat","useful":0,"cool":0},"ML0fc0DnUURXRkXXLr4P7Q":{"text":"My first visit back for years.  (We live in Houston.) I still like both the ambiance and t","useful":1,"cool":0},"bmVwe3qNUNMNulqIOVwChA":{"text":"The perfect French bakery in the heart of the French Quarter.  When you're ready for a bre","useful":15,"cool":11},"lYieL94X9awTLzyFsnFpFQ":{"text":"I discovered this wonderful place while staying in the French Quarter. I asked a local whe","useful":6,"cool":3},"eDXyA-p-GsvUa2EJ2Yb7Iw":{"text":"I might have given this place a 3 if it hadn't been so over-priced.  Lonely planet had mar","useful":0,"cool":0},"FdkPMPESZJCmYsQmt0YX2g":{"text":"Never disappoints.  Excellent omelets, pastries, coffee drinks of all kinds.  Quick servic","useful":0,"cool":0},"zlmlJEiXmcziytlP84OFJg":{"text":"Adorable patisserie with cute courtyard and excellent croissants, breakfast, and pastries.","useful":1,"cool":0},"xOVd_lcaD2p1zYBdGb47YA":{"text":"Croissants are good , more sweet than I'm use to but fresh and flaky and tasty!! Just got ","useful":1,"cool":0},"VIzicyX0b96aoYbNJ3i0Rw":{"text":"I'll be back if for no other reason than the building it's self!\n\nI don't know what the bu","useful":0,"cool":0},"RXsVZUvmPf0NGxKpyRcHnw":{"text":"Cute little hidden cafe with a gorgeous courtyard..... And the best eclair I've ever had","useful":0,"cool":0},"B-OeKMfYEiosoauDZ-N2kQ":{"text":"Stumbled upon Croissant D'Or Patisserie while exploring New Orleans and ended up returning","useful":0,"cool":0},"c143GhVjOs1_TqWSQe4OGg":{"text":"Was wandering and saw this place hidden behind some street construction...went back and fo","useful":2,"cool":2},"vwzAmDMGmrF2reQH48ruXg":{"text":"Walked right in and had a nice almond croissant and cafe au lait for Sunday morning breakf","useful":1,"cool":0},"91Uou0G9ar_sBCsh5qLV1Q":{"text":"The best croissants I've ever had. Seemed like traditional French pastry. What a delightfu","useful":0,"cool":0},"2U2ZvKWoYvdvTqozCwtcCw":{"text":"I've been coming to Croissant d'Or for the past 15 years and I can say that I am never dis","useful":2,"cool":0},"Ddc39dufSuxKqPHuWSzomA":{"text":"Walking away from Café Du Monde after tossing the rest of my coffee and about a cup of pow","useful":7,"cool":4},"cP0Y6RsYEd2o_GmF6IH67Q":{"text":"What happened to our favorite breakfast spot!??? We have been coming here for 20 years and","useful":0,"cool":0},"sizJC2UDPZGvBvjNj2SgPA":{"text":"Have a café au lait and a slice of history. \n\nGreat French café with an open courtyard to ","useful":24,"cool":24},"TMT9mBfsk7YeNgv09mVslA":{"text":"Our go to patisserie when going to New Orleans. Their meringue is delicious, coffee is goo","useful":0,"cool":0},"2ZB4PPJ-tUvta8BBsRCf5A":{"text":"Great croissants.  Very soft and BUTTERY, to the point of a greasy paper bag if you take o","useful":5,"cool":3},"LGmZ3oWfBEzm07tfIIfVrw":{"text":"Stayed across the street.  Historical place. Nice ambiance. Got a fruit tart, ham n cheese","useful":0,"cool":0},"4TjhFO_orMRr8-EEbcIQFg":{"text":"A little slice of fabulous hidden in plain sight.  Croissants are the star attraction alth","useful":5,"cool":3},"NxqSZ6fOwsbiXvaT3xaH9Q":{"text":"Amazing food - croissants are incredible - been consistent for over 10+ years despite chan","useful":2,"cool":1},"-7xqTSh7qO0lCHaoW21r2Q":{"text":"Wonderful breakfast place off the tourist area of the French Quarter.   Literally everythi","useful":0,"cool":0},"exPC0F2w0cqRUm3KY53xfg":{"text":"I got a mango mousse and palmier. The mango mousse was a bit dense and hard like it had be","useful":0,"cool":0},"saE9pL11g6PFh8moI_sVaw":{"text":"Tasty croissants, low key and charming atmosphere! Downgrading a star because they messed ","useful":4,"cool":0},"-O5l5Ldce1lBjTIvrPC6ow":{"text":"Had a pastry and coffee, was a nice place to walk to and grab a quick breakfast. Nice atmo","useful":0,"cool":0},"-TlBAXVPkTfBz8OP01b3OQ":{"text":"Talk about the cutest place around! \n\nFrom the adorable Roman/Greek atmosphere to the towe","useful":0,"cool":1},"GjyNljIl3ah62GiurWg-ig":{"text":"Was super close to my hotel and came here for breakfast almost everyday.\nthe pastries and ","useful":2,"cool":0},"SciYGOiwcV2FtzOcdfJxog":{"text":"Great little coffee and pastry shop. \n\nCoffee is decent and nice little pastry assortment.","useful":1,"cool":1},"xGyCuIxUooh0ygQncFTK5g":{"text":"Solid croissants, good coffee! Lovely spot to dip into to get out of the heat, enjoy a cal","useful":0,"cool":0},"0j9iaaCRUY5aVAxzIRvvMw":{"text":"Still great after all these years.  Go for the almond croissant.","useful":0,"cool":0},"zMDTz-4dkqe70NDk2v_IqQ":{"text":"Quick stop for breakfast with some homemade pastries and good coffee. Will definitely keep","useful":0,"cool":0},"Qxe1FzeyChxe8LdG-hPrWA":{"text":"We are out of town visiting for just one night and we stopped here this morning for breakf","useful":2,"cool":1},"KA7u7Hnl0eta_CbJP3hrig":{"text":"Architecture/atmosphere: 5\nPastries: 4\nService: 3\nOverall 3.5\n\nHere is a tidbit on some lo","useful":0,"cool":0},"LR1FKJKZKBM0UQ92syfSTA":{"text":"Went there for breakfast twice with my wife during our wedding anniversary trip to new orl","useful":1,"cool":0},"Ugusrmo9EaVXAsejG8ZFyg":{"text":"This is NOT the authentic French food cafe you're looking for. The food is fine but not at","useful":0,"cool":0},"IeYZ6weTFecp1KWIVyCeUw":{"text":"Amazing food,  nice space with indoor and outdoor seating.  The croissants are a bit heavi","useful":0,"cool":0},"hoIrCDK97QQmC5ncdJMrUA":{"text":"No frills Old coffee shop tucked away on the side streets of the quarter.  Historic tiles ","useful":2,"cool":0},"-q0HYFExdZz6GeknkyD_1Q":{"text":"Love this place. The coffee was great and the pastries are truly authentic. They had my fa","useful":0,"cool":0},"BLqzWtJ6G1_CbJKJzVlJGQ":{"text":"Service was great.  Line was quick and efficient to get through.  Best crossiant and chees","useful":0,"cool":0},"-aDNA3u8wfWtTZRLDBVTBA":{"text":"Totally cute. Pretty good pasteries.  Definitely a quiet place to chill the day after a ha","useful":0,"cool":0},"Qa89CKGn6tu3pGf0-c8yYw":{"text":"This place has a very nice ambiance and good iced coffee, but the breakfast was a bit lack","useful":0,"cool":0},"zeHrpR_o3cGzoyhl46LxVg":{"text":"If I want a better patisserie breakfast, I'm going to have to renew my passport. The Crois","useful":2,"cool":2},"dYUYVSUnXHQu2XKm7F3ozw":{"text":"This place was just aight. Not sure if tourists are claiming the best croissants, but not ","useful":1,"cool":1},"uGsoEG4pNcWNGOQfIZEvwQ":{"text":"First of all, thank you for being open during a pandemic hurricane. This place is like an ","useful":1,"cool":1},"qBohdjMMDSH6iNB4Braqkg":{"text":"We have been coming here for 20 years and the pastries and quiche are quite good and the p","useful":0,"cool":0},"8CV7bJ28BJACYjSC-DBfnQ":{"text":"Excellent pastries. We had breakfast here several mornings and enjoyed everything we order","useful":0,"cool":0},"5wHi09OzSIqOI4C3I9dtcw":{"text":"Pandemic update\nI was in the FQ recently and realized I was starving and after verifying t","useful":8,"cool":3},"Q-YXhDk639qAJBMYOy4Djw":{"text":"I stopped by Croissant d'or on my Fodor's recommendation. They offer a cute French cafe se","useful":1,"cool":0},"aQMv8xSDyIhrPN1l_R5U2w":{"text":"When strolling through NOLA & you realize that there's a small part of your stomach you've","useful":1,"cool":0},"ht_1KYtZ5263NFHkneJ9kQ":{"text":"One of the more beautiful places one can have a cup of coffee.  The courtyard is really be","useful":3,"cool":1},"fTiJ08PDR1UDU0gpQ3evXw":{"text":"We were visiting and this became our go to place for a light breakfast and coffee! We real","useful":0,"cool":0},"gHez6ZQlEVXIc4EVfJnBew":{"text":"Definitely off the beaten path but in NOLA, it's a good thing!  We had a couple of cappucc","useful":1,"cool":0},"ytxQTVqMm23ncr7QpaXgWA":{"text":"Always a great stop when in NOLA!  They offer a great selection of beautifully crafted pas","useful":5,"cool":3},"grj4WkY1ShM5mWgGb1a4lg":{"text":"Looking for a spot off the beaten path. Definitely come by here. Good sandwiches, had a ta","useful":2,"cool":0},"5BSbMCmg1inJT8rF0SKc0w":{"text":"Based on the tile at the entrance, this place appears to have a long history. Construction","useful":1,"cool":0},"FsZHqSrpYM98fXcY1bg-Iw":{"text":"Fun assortment of traditional French pastries and twists for sandwiches and other breakfas","useful":0,"cool":0},"Nw9TqRsLimPcCRh8RG7lIg":{"text":"I felt like I was walking into a cafe in France. The ambience was adorable and cozy. The q","useful":0,"cool":0},"2I__nu9y9b-Mh6PEGzlEng":{"text":"Great little spot for breakfast right across the street from the hotel we were staying at.","useful":2,"cool":0},"ydxyJ-0_gcAbdPajhtnSKg":{"text":"Croissant D'Or Patisserie creates edible art.  Each item is fresh and delicious.  You may ","useful":0,"cool":0},"KNWIKDpUjr4zPD4ZTFXOgg":{"text":"Great pastries! I had a chocolate croissant and raspberry croissant. They were excellent a","useful":0,"cool":0},"UmrxoCspzNfdRtDrRkwy7A":{"text":"After having oysters after oysters, crawfish after crawfish, and gumbo after gumbo, I felt","useful":3,"cool":3},"DayGatj3mqqGMRUneBTtDA":{"text":"Charming atmosphere and delectable pastries. My senses all wake up when I walk in here, it","useful":0,"cool":0},"QPUCgmaxBzoel69q3K5KcQ":{"text":"Saw reviews this was a great place for breakfast. \nStayed at the Hotel Villa Convento acro","useful":0,"cool":0},"jggxWgWlAi4e-Whb66qGTA":{"text":"Croissant D'Or Patisserie is a cute pastry shop that my friend and I just happened to stum","useful":23,"cool":25},"BxUhVikHG_DEsNLFka3Cbg":{"text":"This was one of my favorite bakeries but I was disappointed with the nonexistent cream che","useful":1,"cool":0},"e2kl7S7bYGGm0d4Ds3OeEA":{"text":"One of my favorite croissant shops anywhere. Stopped in for an almond croissant and cafe a","useful":4,"cool":2}}