{"JM0ZB89YE-tAV8LR9ZpwSA":{"text":"I wish I could have liked this place. I found the staff to be sullen and uninterested in t","useful":1,"cool":0},"nuuRXzblq2FADTJAH0T_ig":{"text":"Anytime someone is flying in this is ALWAYS my first stop. Away from the tourist traps and","useful":0,"cool":0},"IIWxiN1ynvpg__jv5_gNVw":{"text":"Got the 5 cheese board it was amazing. Service was great. You order at the counter first t","useful":0,"cool":0},"7NIqQdHnkjmKHkaHzhff8Q":{"text":"Given that I'm a bit of a wuss when it comes to fancypants cheese, I find that this place ","useful":9,"cool":5},"pJ3qjGxoXpuIwYex0Ug5rA":{"text":"The wine is average to poor. The food was ok. The cheese plate was disappointing. The reas","useful":0,"cool":0},"9Qz3J9_aVkH_NCTaN8RXyw":{"text":"Exotic cheeses and meats with good wine.  How can you go wrong?  We come here on a regular","useful":2,"cool":1},"6zQDw9BPPaMzcgSeXNfc2w":{"text":"I love this place! Casual but a bit small. Good thing is crowds move through quickly. I ha","useful":0,"cool":0},"ntjXd8HuyAYoRk5O8WMSHA":{"text":"The arrival of St James Cheese Company has given that stretch of Prytania a legitimate cla","useful":2,"cool":2},"Qj9G1feq-bRyGZY8NJ7qVQ":{"text":"One of my favorite spots for lunch in NOLA.  The smoky blue sandwich is the best array of ","useful":0,"cool":1},"XlfT3YRDk-KOUrjHkztUSg":{"text":"This place has amazing cheeses and food! I love their Hook's Cheddar! Lovely local place w","useful":0,"cool":0},"3GfS2MMUizlLI4OR6__Gbw":{"text":"This is a great brunch place! They have an overwhelming selection of cheeses along with so","useful":0,"cool":0},"oB-5-ye55hdExikEKBuDOw":{"text":"Nice little upscale dive in the heart of uptown. I love taking a walk down Prytania to gra","useful":0,"cool":0},"X-aYKem9DEgsBEJ43oWyTw":{"text":"This place is just heavenly.  All you need is the cheese board and wine, really.  There co","useful":0,"cool":0},"ecYrGKpUCHfnzlGfxqTtsw":{"text":"You can never go wrong with any sandwich or salad from St. James. All of the cheeses are s","useful":2,"cool":2},"cMQqkUaRVzyq-mLYLqUMIA":{"text":"I like. \n\nI'm still salivating about my bleu cheese sandwich. You go in, order your food i","useful":0,"cool":0},"KJTJzo16y9OwNpijSEpfDw":{"text":"Cheese platter, cheesecake, and the blue cheese sandwich are my favorite options on the me","useful":0,"cool":0},"nc7to5HZ-ZTOuIhOqnQXLQ":{"text":"Great spot! I try to try something new each time and my favorites are the gruyere sandwich","useful":1,"cool":1},"Z8WKd3uhV4-xDRVQxMkoIQ":{"text":"I literally could have selected anything off the menu and been satisfied. I had cheese and","useful":0,"cool":0},"h11JARa81hfbDPcIYqW7dw":{"text":"The cIvilized happy hours on Fridays should be tried.  $15 gets you generous samples of th","useful":1,"cool":1},"syqZjdm4n3_s-w52R7iZEA":{"text":"Liked it, but didn't love it. I had the mozzarella sandwich, and the bread tasted very bur","useful":0,"cool":0},"HLpJIOY1ScYxaMLCJMEaHQ":{"text":"It only took one freaking visit for me to fall in love with this place ! \n\nI was craving M","useful":10,"cool":7},"Ld5i6HIdI-qNF9fv4oTcBQ":{"text":"Came in here for lunch one day with my wife and we shared a Mozzarella sandwich w/ Salami ","useful":0,"cool":0},"wUPOUp_8QhLuaGl9_RXRaA":{"text":"I love, love, love this place. The inside is very nice and well-lit, but there is also a s","useful":0,"cool":0},"n5-TOIBFUMfsTKPEVnG8IA":{"text":"Another boxed checked off my South Shore wishlist.  We were out house hunting a few weeks ","useful":0,"cool":0},"x5BHRnT0G6yYk1BYzFJ_rA":{"text":"Very over due, I was here in NOLA during the heat wave of summer. My god it was hot, 100, ","useful":0,"cool":0},"B_FUbRTdQhsaJGxDvCza4A":{"text":"I loved my sandwich but I do have a few gripes. \n\nThe online menu may differ from the actu","useful":1,"cool":1},"_91r7DXFsTtoVDyaOC3ieg":{"text":"I used to love that place but the service is getting worse and worse. I always buy locally","useful":0,"cool":0},"X6yNuwmXVjl1OYjaujA5rQ":{"text":"Whenever I go here I always get the mozzarella sandwich and it is so good! Their service d","useful":1,"cool":0},"Te1ZHp73FU1OeDowWsjFOw":{"text":"Hello my name is Martin and I am a cheese-aholic! However to quote Ms. Winehouse \"I don't ","useful":0,"cool":0},"AktciGp0AKamdTZCgGP6zQ":{"text":"One of the beauties of sandwiches that have all the fixings is that you can make any one o","useful":3,"cool":1},"9mNquS_yPGSX6H9l6eHD9Q":{"text":"Cheese, pate, sandwiches to die for and great wines by the glass in the Garden District.  ","useful":0,"cool":0},"_xZ6nHS3Q1tVqbcvlhAFZw":{"text":"If you haven't eaten here, then I feel bad for you.  Great spot for friends or a date.  Wi","useful":0,"cool":0},"5TYJaWN_-Kw-wuJBQ-do_g":{"text":"Cute place in uptown NOLA. I enjoyed the sandwich I got but it didn't blow my mind. I have","useful":0,"cool":0},"x78G3JPV6zDSZBZJGl0bQg":{"text":"A coworker and I decided to adopt a Cheese Friday and this was the third spot on our month","useful":4,"cool":1},"MIaUtap6YmeIOoYVMFLw9w":{"text":"god bless you, st. james cheese company.\n\ni love this place like i love the city of new or","useful":2,"cool":0},"sY-muk6jgEaRUaLq0y5cjg":{"text":"Zagat rated (26 or higher?) with great sandwiches and salads","useful":0,"cool":0},"IPa8hYlnTWYSAqsuFhHWAA":{"text":"I'm sure my one little review will barely scratch the surface, but I still want to go on t","useful":0,"cool":0},"Ozr8iXqfhrWmAnYApLV9jA":{"text":"Great sandwiches. Salads were lackluster and you would think the Mac n cheese would be ama","useful":0,"cool":0},"3A8RL6QPp37gmyUNPvZYSQ":{"text":"Just thinking about this place makes me salivate. This place is absolutely sublime in ever","useful":3,"cool":2},"YmkY3HXll8bgzVKDoFLmUQ":{"text":"Best grilled cheese I've probably ever had in my life. Ate at the Magazine location and sa","useful":1,"cool":0},"OgYIJbA_1Fq4duK35nxHJw":{"text":"Best deli style place ever. Hands down, if you are a cheese lover you will enjoy this plac","useful":0,"cool":0},"4xqxvQmSwiqvDASu9-4Y0A":{"text":"This is a spot our crew used to go to all the time on a movie I was working on last year b","useful":1,"cool":0},"0rgIPWinZrrQQAgMqQNlkg":{"text":"All of life's problems can be fixed with one thing: cheese. \n\nStumbled upon this place whi","useful":0,"cool":0},"-uANqrelTpcv3g8-S72hww":{"text":"My Mecca! Cheesy B can get down with St. J's.\n\nThis might be my favorite sandwich spot in ","useful":0,"cool":0},"5ZFhxUQ5u5GWwC5naXEZKw":{"text":"A first-rate cheese shop.  Bohemian, knowledgeable staff with a wide selection of exotic c","useful":0,"cool":0},"N-qDMcoegKzD0gBQRpd9pQ":{"text":"Whoa.\n\nThe gruyere sandwich is literally cheese and onions, but I don't know what kind of ","useful":1,"cool":0},"Dv-4t4CF1Y393wm1u8v2mA":{"text":"Amazing cheese board with amazing presentation for a good price. Lovely atmosphere, which ","useful":0,"cool":0},"NZiAuhPkqGmtK3rvU-xSAQ":{"text":"We only got cheese to take out but everything in this place looked enticing and delctable.","useful":0,"cool":0},"k72WevLAFdzKePQk4BPdPA":{"text":"Great sand which and cheese lunch spot. Hooks cheddar and gruyere are two of my favorite s","useful":0,"cool":0},"2WKBSSilaom-WaHnOojqrQ":{"text":"Superb specialty restaurant serving all things cheese.  Whether you're looking for a full ","useful":0,"cool":1},"z0Ctu_qy4ku5A294oOhn7w":{"text":"This was our first stop in NOLA. Late lunch on a Wednesday, around 1:30pm. Easy on street ","useful":0,"cool":0},"FSqla1dM8NQnBTqA-rDSSQ":{"text":"This was my last meal in NOLA...and it will be one of my most memorable.  I like to use th","useful":0,"cool":0},"BAcu-N_0w9Yr8CM7olnNuQ":{"text":"My first love is cheese and it has yet to break my heart. St. James is the Mecca for chees","useful":1,"cool":1},"kaaOa7fhdOLOJrrytM5vZg":{"text":"Great place for a glass of wine and an amazing sandwich!","useful":1,"cool":1},"crm2KdcUyqiMJHukGn_5sg":{"text":"Lovely little cheese shop and deli with a variety of plates and sandwiches. They have a va","useful":0,"cool":0},"BRpGEv4o6cbEChNaCLpxdg":{"text":"I have been wanting to come here for years and I was finally in the neighborhood...on Chri","useful":1,"cool":0},"2Fz3UKRP5PP78no4cj2yPQ":{"text":"This place is delicious, and so fresh-ingredients are high quality. The Cantal salad is ph","useful":0,"cool":0},"S7EUnOopSuJrJoGOiHH3Zg":{"text":"This place is great for a lunch date with mom or friends. Go for their delicious salads an","useful":0,"cool":0},"D11mhXFDlpL6ZA_sOO-zyw":{"text":"I don't know how long this place has been here, but I am SADDENED by the fact that last we","useful":1,"cool":0},"koBliSyrEa1zQPOT6pGfFw":{"text":"Amazing! Magnificent! Artisan cheeses. Specialty meats. The staff is passionate about what","useful":0,"cool":0},"lL0oQYXIPq8D4URL1CtVtA":{"text":"Yum, yum, & yum. I love this little place! Stopped in today for lunch with my husband and ","useful":0,"cool":0},"ZMb4-Yt4faQfEGagR6TOIQ":{"text":"I love this place. And when I say that, I mean I freaking love this place!\n\nWe attended a ","useful":1,"cool":2},"LGT7fdhUo7-D9z2d_qckQg":{"text":"I like St. James... and it doesn't have much to do with me loving cheese. \n\nFirst, the peo","useful":0,"cool":0},"7jxbAijHBqEjakOfZSGWEw":{"text":"Best way to spend a lazy afternoon in New Orleans: nice shaded patio, with a couple glasse","useful":0,"cool":0},"WQpZ52YjL-5ZZ0qxESp15g":{"text":"Great place, nice people, and we here last year when they were not slammed with people lik","useful":0,"cool":0},"xroZN6o_e06Np_lEgapVkg":{"text":"This (sort of hidden) shop/cafe is going to become a new favorite.  Their selection of che","useful":1,"cool":0},"8xkDN-EUzztdWAXl8rtW1Q":{"text":"I love the cheese tray. It features a few cheese selections, honey, jam, bread, roasted nu","useful":1,"cool":1},"0TTLWllXtJKNZ1OdDHjmWA":{"text":"If you're in the mood for fancy cheese this is one of the main places to go and most of th","useful":1,"cool":1},"o60Nc2kEbT0pgAj-fpDprg":{"text":"What an amazing little wine and cheese shop, I am obsessed! (Granted I am obsessed with ch","useful":1,"cool":1},"c7-Mwey13wVLY1ptvKIFbQ":{"text":"We love cheese- and this place does not disappoint.  Great selection for purchase. Lots of","useful":0,"cool":0},"4N1NddbxHfEWUxk3bqYYMg":{"text":"I recently was maddingly ravenous and needed to go to a place that was a sure-fire good me","useful":1,"cool":1},"EEk3kbCKyiew5nKiaVX6Iw":{"text":"Yeah, I still go here for lunch way more than I should, given the huge list of restaurants","useful":3,"cool":2},"7TlVcwcfwaSCpu9_Be9eKQ":{"text":"As a trip to New Orleans often includes more fried food than I normally eat in a year and ","useful":0,"cool":0},"YNCI98xg8FfwJS7Eboc5IA":{"text":"I absolutely adore this place. Service is wonderful and helpful. The Moses sleeper cheese ","useful":0,"cool":0},"KEGJb5oCQ81HsVMIoViTQg":{"text":"If you love cheese, and I do, this is where you need to be. I can honestly say that I coul","useful":0,"cool":0},"v2Cp9Az-Xb10CvwA5xIf9g":{"text":"I have been wanting to try this place for well over a year. So last Saturday I happend to ","useful":3,"cool":1},"KibsCBwb8wCh9IjxBKblBQ":{"text":"A must-hit for culinary souvenirs. Every imaginable type of cheese with expert cheesemonge","useful":2,"cool":1},"T7P0PsdW3Cb4GdWpCUr8HQ":{"text":"Exquisite. I'm not a master of fancy cheeses and meats, but I am something of a fan. With ","useful":1,"cool":1},"sAhxSctJ743kgYUv9lCAmg":{"text":"Roomie and I tried St. James Cheese Company tonight and we already are planning what we wi","useful":0,"cool":0},"e8P2lokZ3Kkf6LPRVq7aeA":{"text":"Went to a \"South of France\" cheese and wine class here after work and really enjoyed it.  ","useful":0,"cool":0},"kIrsbaoSOJsQLVBC5sf7wg":{"text":"We had a cheese platter and left the choices up to the cheesemonger himself. The little fr","useful":1,"cool":0},"LPqttYJayXWtXnzDT2rzCA":{"text":"The gruyere sandwich is to die for! So happy we stopped in here. Excellent choices and cut","useful":0,"cool":0},"2-KAXquHhhmiKCcW_qP90w":{"text":"One of my local favorites. I go here at least once or twice a month. My favorite is the ca","useful":0,"cool":0},"bab14iz86Ek7JOAirBq6LA":{"text":"My favorite place for lunch.\nyou can tell that the people working there are true cheese bu","useful":0,"cool":0},"kHjgIJq1fbI0f66OnmoasA":{"text":"We have died and gone to cheese heaven!! The cheeses and meats are to die for! The oowy go","useful":0,"cool":0},"VGk78iOo6CCjeEF6jiEsYA":{"text":"Great sandwiches! I prefer the smokey blue which has roast beef and blue cheese. Wished th","useful":1,"cool":0},"u5AUfsI7ezzI9_PVNmVoqQ":{"text":"One of the best charcuterie's I've ever been to. In love with this place. Their selection ","useful":0,"cool":0},"HxNypR70UUTlWXBI3TGikg":{"text":"These people are great. I came with my son after he got out of school and we ordered a sma","useful":0,"cool":0},"ll5BHFgbo5SlQRPrXNGmww":{"text":"Love this place. The cheese and charcuterie board is always fantastic. I also love the pic","useful":0,"cool":0},"iw5_PA_Gv_qUqJT6uXyeqg":{"text":"We came here for the first time today & we're glad we did! Started with a glass of rosé an","useful":0,"cool":0},"rpRpTi8TIkwyme6fphjiqA":{"text":"Came here and got a cheese platter during happy hour. My friend and I got some gouda, ched","useful":0,"cool":0},"-EauwLd8ljwleAnb3hrg9g":{"text":"DELICIOUS!\nThe Greek salad, 6 cheese plate and Beechers Cheddar sandwich is our regular or","useful":2,"cool":1},"h2EyZ9PQZ0xpp7HfbWH8ww":{"text":"The best restaurant to get away and indulge in wine, cheese, and cured meats. I've never h","useful":0,"cool":0},"NEEzSyUrlveteJTOX716aA":{"text":"We had a mixture of sandwiches, charcuterie boards and the mac n cheese. All were good and","useful":0,"cool":0},"GfowmOXwzfGx_FxgQa9Czg":{"text":"SJCC was the perfect antidote to my homesickness-it is a little slice of the Bay Area in t","useful":0,"cool":0},"OrCBfWCJD8wea9UaKRdpvw":{"text":"I didn't think I was hungry, until they brought me the gruyere melted with caramelized oni","useful":0,"cool":0},"DWtvk1AATgKU-viJeITlYA":{"text":"Great food, nice decoration. .. nothing fancy... but we loved it. We didn't know they have","useful":0,"cool":0},"TYmKiU9rUl5Akr-enH6r_g":{"text":"I'm reviewing St James way after actually eating here because I can't stop thinking about ","useful":1,"cool":1},"iy7bpbsSeKvFyhscXj0_zg":{"text":"The's easiest 5 star review in New Orleans. Cheerful customer service, delicious salads, s","useful":2,"cool":0},"rQetRoNyXeMQl6-x_RZA8Q":{"text":"Listen. Everything I eat here is amazing. Hook's Cheddar Sandwich. Mac and Cheese. Chantal","useful":0,"cool":0},"MjMt8owXDM78zS_b5VVQdg":{"text":"Great sandwiches and cheese plates, and lots of yummy accoutrements available for sale to ","useful":1,"cool":0},"dPQlzy_QgqOc6kaTELAAAg":{"text":"By far my favorite sandwich shop on this side of town.  They offer high quality fresh ingr","useful":2,"cool":1},"oEhAxQ2J3erdplvFQSsBOQ":{"text":"This place is a favorite whenever I'm back in town. You can't go wrong with anything in th","useful":2,"cool":0},"No_f0d_4iWCe-Vmr5ljxnA":{"text":"Excellent selection of cheeses. Friendly, helpful staff. Great menu. We had a charcuterie ","useful":0,"cool":0},"4fTU8869PTxkvr2DKtoJBw":{"text":"I wasn't paying close attention and based on the name always thought this was exclusively ","useful":0,"cool":0},"V3zwGb8ML0ilgMGiSeChvA":{"text":"When a community as divided as cheese lovers agrees on a fromagerie, and does so with the ","useful":1,"cool":1},"fVf287rm6Y8UEXBwcwtzkw":{"text":"Love it. Awesome selection of cheese and very tasty menu. It was nice to ask for a cheese ","useful":0,"cool":0},"C0dCetEuCEVvT_af-YhuHA":{"text":"Food was delicious! We had the cheese plate. It was standard. Their homemade pickle plate ","useful":0,"cool":0},"Y06b-kmiKGok81GIPX6YDg":{"text":"HOLY COW! I plan on coming back here as many times as I can manage! This food was SO good!","useful":2,"cool":2},"VoxMqlj5dVWcZooWg_qFoQ":{"text":"oh pullleeezzeee - can you go wrong w/ cheese?? I think NOT!!! such a nice little shop/din","useful":0,"cool":0},"SDxEN_AvNWGxdC1n3xcaNg":{"text":"God, I love you St. James cheese.  How I love the rank smell of all the cheeses together w","useful":1,"cool":1},"lq57DRsmZZPMQdpkreX1Rw":{"text":"This is my new favorite place! Exceptional food and wine all while being very quick, casua","useful":0,"cool":0},"v3fDp_nPrWx8q6NbA6Rruw":{"text":"Gruyere-melted cheese with caramelized onion pressed like a panini. Simple but yet sooo go","useful":0,"cool":0},"URM99aM74ixpdlE7eT_Row":{"text":"How can a place has so much food expertise do such a bad job of running a restaurant? I ha","useful":0,"cool":0},"D0pbl9zxAJqulrvoZl5qnA":{"text":"The large cheese board + a bottle of wine = 3 hours of one hell of a nice time.\n\nTheir sel","useful":1,"cool":0},"1jCitKkX9RyPCnjWKnql_Q":{"text":"This was one of the best experiences ever.  This is a quaint little place that smells amaz","useful":1,"cool":0},"_lRzCTcchkVaDUWQtYjKEA":{"text":"I can't say anything bad about this place.  I consider myself to be an amateur cheeseologi","useful":3,"cool":1},"gqoG3tHacjjIwSGFuNwoXg":{"text":"Very nice place! It is a small but great place to get some cheese, wine and sandwiches. St","useful":1,"cool":0},"bfwDlX5T3YVQ8_8y_4pzUw":{"text":"Visiting from California and have come to this place a few times already! The mozzarella i","useful":0,"cool":0},"_5UqIVVjKlerxdkkz-Mqnw":{"text":"Great place! Fresh local ingredients. The sandwiches are written on a chalkboard, artsy fa","useful":0,"cool":0},"fLVRY70bjp8Ct9HoykE_HA":{"text":"Clean, fresh, healthy, plenty of options, friendly, quick...this place was excellent. Had ","useful":0,"cool":0},"AjFl43MZKP2B_BBH-hjQSg":{"text":"I had never heard of this until some friends took me the other day and I'm so glad they di","useful":1,"cool":0},"E1OUnb8b-R7_N_24RqqirQ":{"text":"i love this place - great selection of cheeses and excellent sandwiches that are freshly m","useful":0,"cool":0},"uqvd4CnhjqyZXCIF003ORg":{"text":"Everything is yummy!  I love to hit this spot for lunch!\n\nThe ingredients are super-fresh ","useful":3,"cool":0},"YioE8aRqdgUBm7Om9Gk4hw":{"text":"Relaxing and clean atmosphere. Got the Happy Hour cheese plate special. Had the option of ","useful":0,"cool":0},"jUKrlo7S74GlFLdm-lwJgw":{"text":"St. James rules.  My life is all about cheese.  St. James is a place that makes me proud t","useful":0,"cool":0},"BB67bhSDxUk27g6JcdAn7w":{"text":"Of all the problems that can torment a retailer or restaurant owner, \"not enough room for ","useful":1,"cool":0},"4xhgNcNTY0PS008MIEJTgw":{"text":"Very good restaurant with terrific sandwiches. Very accommodating staff with fair prices","useful":0,"cool":0},"KQw8j1TmMD-XbWpSZzoUAw":{"text":"Must eat here.  Ive eaten here and even had the catering from here multiple times.  This p","useful":0,"cool":0},"u92CWxyr0KUyMo5ESaoXRQ":{"text":"Wow- this may have been the biggest surprise for me on my trip to NOLA.  What a cool, soph","useful":0,"cool":0},"kCbr0h0aEDOVfpVIgUQlBg":{"text":"A really cool hip shop! \n\nSandwiches are really great - the \"Lamb-Wich\" I had the other da","useful":1,"cool":1},"ocA18nh1ZePVYO6-hqvbtA":{"text":"I LOVE cheese and I LOVE St. James Cheese Company!  It's such a cute little place with the","useful":0,"cool":0},"5CynRsbjPNnDHWZ_-XK8Vw":{"text":"Stopped by for a quick bite on a rainy day, but was still crazy busy & not a lot of empty ","useful":0,"cool":0},"YhMa8yA2bFTqVjqGpeb5oQ":{"text":"The Gruyere gilled cheese sandwich with  caramelized onions was perfect. Food does not get","useful":0,"cool":0},"dF1mKuIodOW9mBqkGSclpQ":{"text":"This was one of my spots in the city and the concept was revolutionary for this town. They","useful":0,"cool":0},"kSYjXUJ-b8Xrvw0kIj2B6w":{"text":"I love this place! Sometimes I go to hangout with friends, order a board of cheese and a b","useful":0,"cool":0},"FXrwY6dKY004OUGKYXiE7g":{"text":"We were missing cheese and veggies with crunch. It took leaving the quarter, hopping on th","useful":1,"cool":0},"q6KCobPKbdoX-blYNFp-Wg":{"text":"Best grilled cheese. Is it even fair to call it grilled cheese??? The aged cheddar with ba","useful":1,"cool":0},"suI3hxcnmgk70GOQbBxpcw":{"text":"Stopped for supper after visiting the zoo. Excellent food, excellent service! The Smokey B","useful":0,"cool":0},"vXw02XDV5TdS7cU7rrmLeA":{"text":"Simply incredible sandwiches. And incredible service. St James made it very special for my","useful":0,"cool":0},"BM4NwXnixsKHjRJSkvkjCw":{"text":"Whether you are looking for a great sandwich or a delicious cheese board, this is your pla","useful":0,"cool":0},"cdZ6i0NogYeS6Gx--OpfNw":{"text":"I had their special which was a lamb sandwich with feta. Absolutely spectacular. Great ser","useful":0,"cool":0},"rqk0ePffqiXWLbrnR9IEBg":{"text":"A devout fan of Murray's Cheese in NYC, I'd been out of the country for some time and was ","useful":3,"cool":1},"49qBtvA5EML1De1_mzMn5g":{"text":"Right down the street from my apartment, St. James is a staple in my little black book of ","useful":1,"cool":0},"lyqw_oxEjAeFeU2-eC_Liw":{"text":"I'm actually not much of a cheese eater but I would take their ham and brie sandwich any d","useful":0,"cool":0},"GhKLiHEMRCPE_VOxTLptcA":{"text":"Love. This. Place. It's right by my house so I can walk to it. People that work there are ","useful":0,"cool":0},"LWHTfEUaBQWO2hJ79ANmFw":{"text":"I had a great sandwich and brussel sprout salad here. Every ingredient tasted fresh and wa","useful":1,"cool":0},"uhgbsY64xDszpXTWuxSdkg":{"text":"Went to this gem as a recommendation from a local. Awesome sandwiches and the cheese plate","useful":0,"cool":0},"cJ3lYqIBXdhVTRW6ULOiaQ":{"text":"I ordered take out but I really loved everything I saw in the shop.  I had planned to go b","useful":0,"cool":1},"Lyp7p6TD-AMzxEvmVA5T7A":{"text":"Love the sandwiches but wish the menu was bigger","useful":0,"cool":0},"4QNOcMgHuqa5tnE6rkrhfw":{"text":"If you love good eats, a great place to stop in NOLA. Went there upon reading yelp reviews","useful":0,"cool":0},"x29CIv5vDeQ29_H1NiFOQQ":{"text":"This place will always hold a special place in my heart as its one of the first places my ","useful":0,"cool":0},"XRn8hCWnNP1oirN6b_Behg":{"text":"This is one of my favorite places to eat. I literally could eat the hook's cheddar turkey ","useful":1,"cool":1},"wSN6xk2B-x5CDjqEC3H-ZA":{"text":"I came here for a friend's birthday. It's laid back and perfect for sitting outside on a n","useful":0,"cool":0},"tJp5XGBmYPOVYNSDREfEOA":{"text":"A staple at our house as it is around the corner.  Their prosciutto is excellent and not T","useful":0,"cool":0},"q0DXcqqspPUxl65YFsbdjg":{"text":"There were 3 of us and one of the salads was pretty good, and the other two were lacking, ","useful":0,"cool":0},"9pWYrQ6eA3L0PTlnGsrDFQ":{"text":"This is my go-to lunch plate. The portions are generous and selection is vast. If you love","useful":1,"cool":1},"0h0qNFOGym-EsG66JhTuPw":{"text":"so amazing!  the gruyere sammy is beyond words, i wish i ordered two!  the salad that acco","useful":0,"cool":0},"9vR235FLMNpwz1HpP65q8A":{"text":"This place is delicious and adorable! My husband and I stopped in with my sister in law wh","useful":0,"cool":0},"RDqIhytsbhomlUfstXSt5g":{"text":"I am a great fan of the sandwiches.  The cheese is so good -- perhaps as good as it gets h","useful":2,"cool":1},"QqJFU0wkpNf3J_l8olzflQ":{"text":"Visited the St. James Cheese Co. with my daughter and ordered the Hooks Cheddar and she th","useful":0,"cool":0},"OjkTHXcj2qSRVPOs30Wicw":{"text":"I love cheese! If you are looking for a good sandwich, or a nice place to share a bottle o","useful":0,"cool":0},"xYQTXm5jfrQB6FZmorSuVA":{"text":"My husband and I went for lunch today. We ordered their special sandwich- the Hot Pilgrim ","useful":0,"cool":0},"PiE0BJBOdaIQI65NERBKtg":{"text":"Really nice cheese shop in the Garden District!  We stopped in before our dinner reservati","useful":0,"cool":0},"9JmFSJVN_0AQPDUOw_py0g":{"text":"I can't believe that I lived in New Orleans as long as I did and only made it here twice. ","useful":0,"cool":0},"WuJHeA8XXPGuEWtH2tpHSg":{"text":"Great cheese, great sandwiches and great salads. Nice outdoor seating on the balcony or in","useful":1,"cool":1},"Ik1sjJm44c_lG4_BnagEjA":{"text":"The food here is incredible, not once have I been disappointed. Great place to dine alfres","useful":0,"cool":0},"1P00fPwvRT-4uS_OzQURpA":{"text":"Great food! My wife had a massive, beautiful salad while I had a huge sandwich with a side","useful":0,"cool":0},"vRGxHNIGTKIgAKJRxaQ1qA":{"text":"So many cheeses to choose from - and a great selection of them! Delicious salads and sandw","useful":0,"cool":0},"oOaKo7PvLCW4irPYamzqyQ":{"text":"Good cheese and sandwich shop. Mac and cheese was great. Definitely something worth trying","useful":0,"cool":0},"3HmrbMyqhhQ0-voYsUyfdg":{"text":"I live close by, and am so grateful. I've tried three things there and they were all so go","useful":1,"cool":0},"yRRBJLq0q90G3RyfcejcUw":{"text":"I absolutely LOVE having lunch here on a sunny day. I think the portion size and price are","useful":1,"cool":0},"lX6tJsE5n1DHvyrc2nlGHA":{"text":"This place is great!!! Try the roast beef- so yummy! Charcuterie is also amazing! Service ","useful":0,"cool":0},"HHfkf0QaIAQTxh6KQYutaw":{"text":"The salad that I got was amazing. It was pretty large and covered in cheese and nuts and f","useful":0,"cool":0},"NxGMYuX1R3vyNhGsNIIPRw":{"text":"OMG I am in love with this place! We happen to stumble upon this place for a quick lunch a","useful":0,"cool":0},"vCsdpl-d4JVZOegyfZ4O7w":{"text":"Had lunch at two different locations in NOLA.  Very high quality cheese and meats on my sa","useful":0,"cool":0},"mIaqG6KWC_HCGWvJpbr_bw":{"text":"My favorite cheese shop in New Orleans. \n\nAlthough the selection is limited and the pricin","useful":1,"cool":1},"t-v6Ouxujd_k67tPjb1qKA":{"text":"Normally great food, with high-quality ingredients already, is elevated through the litera","useful":0,"cool":0},"HF2bqmGpYu6Psj3dt-xBJA":{"text":"Yum! Love the assorted cheese plates, the sandwiches, and the outside patio!","useful":0,"cool":0},"IoM-rvDGiyeyQi6kDFKMEg":{"text":"Cheese fans rejoice! They have a large selection of cheeses and their cheese boards are am","useful":0,"cool":0},"Y0zZFHafaN2e4taw20a0LQ":{"text":"Wonderful menu and cheese options!  The only place to get soft Portuguese cheeses!  I had ","useful":0,"cool":0},"FOzXnnkLZCn-BdHqSTDh2w":{"text":"I love cheese, even if it doesn't love me back. I did my typical scan of the yelp reviews ","useful":0,"cool":0},"45DlOiM-ZB6yYQzADkK7aw":{"text":"This is a first class cheese shop -- with a knowledgable owner and staff (well, most of th","useful":0,"cool":0},"y3ui9V5rF5WNK1JKtDWUKA":{"text":"St James has to be one of my favorite sandwich lunch spots. St James is able to do what is","useful":0,"cool":0},"8MsFbCM2GJ0VNvRhMlptdw":{"text":"Review is for lunch. I don't know if I know my cheese well enough to count me as an offici","useful":1,"cool":0},"cZf6kXjCnJkcF7NYUlv5cA":{"text":"My friend and I tried this restaurant on a Friday for lunch. It was wonderful. It's a smal","useful":0,"cool":0},"7DOfqSaMzwnfY4Ge3eHB3w":{"text":"The sandwiches are simply delightful.  This is a must-try for cheese lovers.","useful":0,"cool":0},"yxcdSJlmSDEEONHW_BQzsA":{"text":"Amazing delicious sandwiches. Mezmorizing Cheese. Fresh ingredients. Need I say more?","useful":0,"cool":0},"dvmiG5WygLt-wShup6WD5w":{"text":"This is a good place for a ladies lunch. Everyone can order a delicious salad and pick up ","useful":2,"cool":1},"VTHhM3JOAjtWRCrZZMcqtg":{"text":"If you love cheese then come on down.  They have cheeses from around the world and wide se","useful":0,"cool":0},"sul3oYVP_iEm0mti64huMw":{"text":"They have great sandwiches, a fantastic selection of cheese, and a very pleasant, friendly","useful":0,"cool":0},"dT73VgzND0AI3ih3aK576A":{"text":"Finally got the opportunity to visit St. James and wow was it good! Friendly staff, wide a","useful":1,"cool":0},"UXDSjUk0bjXC-ljTQE7Nqg":{"text":"St James Cheese Company is a wonderful cheese shop Uptown. It also serves delicious food r","useful":4,"cool":1},"i1OawEMW4L4hBImjJcJx2A":{"text":"Oh my! I'm in cheese heaven!  I got the Hook Cheddar with smoked turkey, avocado, mayo, ba","useful":0,"cool":0},"yum4Wb0paAMS8P0eCHc9rQ":{"text":"Came here to mark a new place off the check list, was beyond impressed. Have made several ","useful":0,"cool":0},"oU-g7ftR6XJIG4iA9QufGQ":{"text":"An amazing selection of artisan & farmstead cheeses!\nIn addition, a fine array of imported","useful":0,"cool":0},"Mhc7C2Wc-_4e2Zsq6-XEgw":{"text":"The meal was fine. The service however leaves little to be desired.\nMy boyfriend brought o","useful":1,"cool":0},"HJhqocCEr2Hd-dX8wE1rWA":{"text":"When in the Big Easy, don't miss the Big Cheesy. Hands down the best place in New Orleans ","useful":1,"cool":1},"SqMkj02kU333groBwywYsA":{"text":"This Reuben sandwich was completely inundated with some heavenly Swiss cheese.  The corned","useful":1,"cool":2},"RpL2gTe3calJhpT3A8Kohw":{"text":"This place was amazing. Great shop, and although small, had a good selection. I would prob","useful":1,"cool":0},"6ZmbJ8AsPUDo2LrSgKaViA":{"text":"Not only can you buy cheese here, but also deli sandwiches and salads.  You order from the","useful":0,"cool":0},"Qf-vrreFGPyErEhlIdIJSw":{"text":"Nice and cozy place with very knowledgeable and friendly staff. The food is consistently d","useful":0,"cool":0},"wyubdI-B76rcj0jwfHnqEQ":{"text":"Just went here for my second time and once again, St. James Cheese Company completely blew","useful":1,"cool":1},"JyaeNEy3IE4HZA4hkF3JsQ":{"text":"The Pork Belly and the Bre de Breaux AWESOME! I told everybody I can think of about this p","useful":0,"cool":0},"JDoRd2X1cwVGqeI0LJ6wNQ":{"text":"My absolute favorite lunch in New Orleans.  I have tried almost everything on the menu.  B","useful":4,"cool":2},"jwO1v9qaHMGm5LizCH6KrA":{"text":"Man oh man.  I had been wanting to try this place for so long.  I mean, I love cheese and ","useful":6,"cool":3},"SYvXEftG4I8M7ARm9P7ySg":{"text":"On the recommendation from a newly found local friend, we stopped by St. James Cheese Co. ","useful":0,"cool":0},"xy6z8hMjjemNfD41M3PxvQ":{"text":"Fantastic food and great cheese available for purchase. I had the special which was an ope","useful":0,"cool":0},"BzjpAd5Qw_zFDWZtBxRKAw":{"text":"Cheese. Cheese. Cheese.\n\nIf you like cheese as much as I do, you will absolutely love this","useful":4,"cool":0},"g1f7t5nPLUQhtyK9QE5TWg":{"text":"This is a cute place to get a light salad or sandwich. The cheese, obviously, is the best ","useful":0,"cool":0},"ZhudYo65jmtVtdlVAjmjMg":{"text":"Amazing selection and sandwiches. Prices are great for portion size. A lot of variety and ","useful":0,"cool":0},"vEZgYsMaXnuOzJGWak9t_g":{"text":"I love this place.  The cheese plates are wonderful, they always make a great selection.  ","useful":0,"cool":0},"0uRtVs9GFeihuFN7TYWCRg":{"text":"I don't even have words...but I'll try. Someone I met recommended this place to me, and wh","useful":0,"cool":0},"lMzmAHg2s83zKwt1IBXz2Q":{"text":"We came in here just as they were closing, but I think my eyes were opened so wide as I lo","useful":2,"cool":3},"mc4lXzL5pTMsx-XFZcZvbg":{"text":"Delicious sandwiches, cheese and a variety of drinks are available here. I got the vegetar","useful":0,"cool":0},"UO5dJO8y2Ly2kRo69TWwUw":{"text":"Amazing place. My first visit yesterday was right after a rain storm. A lot of the seating","useful":1,"cool":0},"bbzAtqwT21XHLrueYpO6kA":{"text":"So many different cheeses here make my head spin! Ladies are extremely knowledgeable on th","useful":7,"cool":5},"NQyqYsaaSH9PlHrOvxKhuA":{"text":"Nice outdoor courtyard. Had the gruyere with caramelized onions and it was delicious. What","useful":0,"cool":0},"99_AkLbI0RXLY4OYHYQ2rQ":{"text":"This place is like heaven on Earth to me. I love the selection, the knowledgeable and frie","useful":4,"cool":0},"M1ZcTwpQbTUbMV-OTFCUKg":{"text":"I said it all in my check-in: it is a fantastic gourmet oasis in a deep-fried country. The","useful":0,"cool":0},"Q5gquZZQFDe-4d-_b9jRkA":{"text":"Salumi + fresh mozzarella + pesto + crusty ciabatta = one of the top five best sandwiches ","useful":0,"cool":0},"kayrgshECvuuU9RvjyK_nQ":{"text":"This is one of my favorite lunch places in the city. I find the staff extremely friendly a","useful":0,"cool":0},"0Z1gqf8Bbyxe360wEKCYfQ":{"text":"What a great shop to find any kind of cheese your looking for. My friend and I ordered the","useful":1,"cool":1},"b2E-2DqnlqEu_soTS1u-BQ":{"text":"I love the sandwiches here I just wish they were consistent ... I love the smokey blue jus","useful":0,"cool":0},"zKl4ZDXUyrIszGXZ6DPV2A":{"text":"Pretty good salads, not huge, and ok priced. About $8-$10 a salad. would like a little mor","useful":0,"cool":0},"sIeDbnN848OKqI309HjqPA":{"text":"The first time i went a few years ago I got the roast beef with blue cheese sandwich and i","useful":0,"cool":0},"DOlMzcZ1VTQ5QaCnCvallQ":{"text":"As far as I'm concerned this place is good, not great. And like the rest of nola it's $$$.","useful":0,"cool":0},"soxWjWs5xCMeVvcPQZ6mpA":{"text":"Great place to eat or just browse.  Tremendous variety of cheeses and deli meats.  Food is","useful":0,"cool":0},"y-UGvR6092yeH8FSp6ZvhQ":{"text":"The St. James Cheese Company offers the best lunch under $10 in New Orleans. The cheese se","useful":0,"cool":0},"7v2bCRxjmx2mGftHTVDdig":{"text":"Delicious cheese sampling and wine. Would recommend more seating as the venue was over cro","useful":0,"cool":0},"G_taZkcQPZAxqvUi2n4lqg":{"text":"My friend and I decided to randomly check this place out due to the reviews on yelp. Thank","useful":0,"cool":0},"g1Z98KHan0roIk-ZZBvGOg":{"text":"Limited seating on a busy Sunday morning...especially when it's cold outside, but the food","useful":0,"cool":0},"Cti4EToLFTgGDuUBsYukWA":{"text":"I could go on and on about St. James, but I want to make it short.\n\nGet the Smokey Blue Sa","useful":0,"cool":0},"369OzfI8nziwI7c9TXrKgA":{"text":"FIVE stars for the food, but THREE stars for the service when trying to buy cheese from a ","useful":1,"cool":0},"9jNjxm6X6GwGetBKHDcqeA":{"text":"Superb place to enjoy lunch. Bewildering selection of top notch cheeses and cured meats. H","useful":0,"cool":0},"Od90Fx2-XTNZoawYapIzdg":{"text":"I've been here many times, and even though I've ordered a different sandwiches- 'Hook Ched","useful":0,"cool":0},"K2adtB6cCRWiKgTK6S0g8g":{"text":"Dear St James Cheese Company,\n\nI am so glad we still make time to see each other once a we","useful":6,"cool":6},"UzloZBtZ6s-AdCw5Mj29Wg":{"text":"I'll give it a 4 1/4. Wonderful little shop known  for their great selection of cheeses. T","useful":0,"cool":0},"bIfiXHZfmeUQaUI7eX1ZBw":{"text":"I read about this place in Garden and Gun magazine and couldn't wait to try it on my recen","useful":0,"cool":0},"MQ0M7tq2W0LVoyOgXLhUZA":{"text":"Great little cheese and sandwich shop in the Prytania St retail cooridor, they also partne","useful":1,"cool":0},"UMzqh-BvI8MPl_N7frxYpw":{"text":"Excellent artsan cheeses which they expertly turn into SUPER-delicious artisan sandwiches ","useful":0,"cool":0},"aqBKGSODn7yCAPDbCGe_5Q":{"text":"For years I avoided this place thinking it was a place that manufactured cheese.  Visions ","useful":1,"cool":2},"dy6_XpSRz6t6hk1YYlPHlg":{"text":"We stopped here for a small lunch and cool beverage after getting off the streetcar.  Read","useful":1,"cool":0},"Bpb8WEHtmFOa7-8WfZ7uuQ":{"text":"Great sandwich and chill atmosphere. I got the popular Hooks Cheddar. Subbed wheat bread a","useful":0,"cool":0},"hHPnmbu-mLlyPF14QthD-g":{"text":"I have only been here once, but my experience that one time is enough for me to go back to","useful":0,"cool":0},"9jWxFBwWnnK59_FmY3FNXA":{"text":"So often I stumble into the best little places on rainy New Orleans days. Just before a sh","useful":0,"cool":0},"R4B5uyz2HURP4-JlnWBz6A":{"text":"5 stars! I can't get enough of this place- it's small and can get quite busy, so sometimes","useful":0,"cool":1},"r60EPgVyVnqyrHynDqiIXw":{"text":"Love!!! Such a cute place. I've been twice already, tried multiple items and it was ALL DE","useful":0,"cool":0},"lzj4Vn9Hbim0JJxLo_-UfQ":{"text":"This place is sooo good. First off they have an AMAZING cheese selection for the city of N","useful":2,"cool":1},"iMSki3gPAF9ILbhrdpgpSw":{"text":"This place smells terrible and the food wasn't so great.  Also hella yuppified.  The atmos","useful":0,"cool":0},"E7pKKX0KYLRuMwoPcKIGNA":{"text":"Awesome cheese selection and a great place to have a sandwich or salad for lunch. The only","useful":0,"cool":0},"KpxzdpKx4F01qhAa28UNzw":{"text":"One of my favorite spots for lunch in New Orleans. Great cheese plates, sandwiches and sal","useful":4,"cool":0},"FkDRAX19gG76tuSskNNs0A":{"text":"Been looking forward to going to this place for a while now. A friend came into town who L","useful":1,"cool":1},"qQFt_WpeO_7TYH0VKzVP4Q":{"text":"As a red-blooded American, I have always loved cheese in all its many forms. It's only in ","useful":0,"cool":0},"FNsxfdmStV7JGmZEdcvVyA":{"text":"Finally!  Why it took me so long to visit a place that has \"Cheese\" in it's name, I'll nev","useful":2,"cool":1},"1Ua_i5y38roMJrI_MDvdJg":{"text":"One of my favorite uptown spots. Food is top notch and the atmosphere makes any meal feel ","useful":1,"cool":1},"h0tz5PygMnWMxhzq2-6LFw":{"text":"Serendipity that we found it in the pouring rain. Only thing better than the food and wine","useful":0,"cool":0},"ujWiZ5NSFvGPOKUU_W309A":{"text":"Good but different...definitely have to be a lover of cheese. Salad was good...just enough","useful":0,"cool":0},"cCOP8QDSvtsOGKZ_nnuEwA":{"text":"A few months ago, our fab stylist Nicole, from Twisted Salon right up the street, suggeste","useful":2,"cool":2},"OAQA-eayZSZ0AXKtNq4P1Q":{"text":"St. James makes a mean sandwich. The (formerly) Beecher's Cheddar (was) is my favorite. It","useful":0,"cool":0},"NXV0RMkhlViLl0R7ot-Bgw":{"text":"This place is so amazing.  I could experiment here for months and months just tasting a li","useful":2,"cool":1},"jNZHWmTpeSs9OabFywIVxw":{"text":"This way lies cheesy adventure, my lovelies! I do love a good cheese shop, and it's hard t","useful":3,"cool":1},"dgIvj8Z9nyi5iiQ3KOgOSQ":{"text":"Sandwhiches overflowing/dripping/covered with amazing cheese on excellent bread. This girl","useful":1,"cool":0},"3YaRBZaSTt6gW2iHt1eogQ":{"text":"I really can't say anything that hasn't been said already about this place, but I'm at the","useful":0,"cool":0},"1qGPv6AQqwZxqmBDn4qG8Q":{"text":"Really laid-back cheese and sandwich shop. They have some good sparkling lemonade!","useful":0,"cool":0},"Z8wkLgMzarrond-UwFmBfA":{"text":"Sandwiches are great but very rich. I love the side salad. I want to go back and just get ","useful":0,"cool":0},"qQGI-A9HitydzQt-hybkLQ":{"text":"Truly fantastic French and Italian gourmet Sandwiches.  The side salad that comes with the","useful":0,"cool":0},"1ycP0e0U1MHoPk2ra718iA":{"text":"I have a confession to make: I do not like grilled cheese, even the grown-up, non processe","useful":18,"cool":15},"G3a60UclXDFysygK21TquA":{"text":"St. James is my favorite place to go whenever I want a good, fresh creative sandwich.  \n\nT","useful":0,"cool":0},"l7DGaNrhvarQOnFyMi0O5w":{"text":"SO AMAZING! They will let you sample everything and the staff is very knowledgeable on the","useful":0,"cool":0},"vE_IALdMUlDu6ukTIA9FUw":{"text":"The sandwiches were very good. Overflowing cheese in sandwich, good quality meat, interest","useful":3,"cool":0},"JzwVUduzS066bQODX6MAJQ":{"text":"how can you not like a restaurant based around CHEESE!  awesome sammiches that change fair","useful":0,"cool":0},"LWoEDIfhQurzZHWeFKsu5g":{"text":"The cheese selection here looks great and it's always nice to see some Zingerman's outside","useful":0,"cool":0},"Z_6L36OpUtTvIKZ0L_RaAg":{"text":"My last meal in New Orleans, and by god, it was a good one. \n\nSpectacular little cheese an","useful":0,"cool":3},"mZLrSjG_RmAKYwgEcYy6sA":{"text":"I really wish I hadn't had breakfast when I first stepped in here, because the smell of th","useful":0,"cool":1},"CD0eWKnSpQY21GjoP4EbYQ":{"text":"Excellent little cafe. Food and quaint atmosphere both top notch.","useful":0,"cool":0},"KK6EQhsEOp9Y05Blq0VmZQ":{"text":"The St. James is simply a good paradise for adults. The cheese variety, the meat variety, ","useful":1,"cool":1},"RGLpBC13A1KozcfGXXmLUA":{"text":"After several day eating Nolan food, a nice change of food. Sandwich, Italian was great wi","useful":0,"cool":0},"BV9SawWII16ZnOXdThqfqw":{"text":"One of my favorite sandwiches is the grilled cheese! In fact, I just love cheese!! This pl","useful":0,"cool":0},"PrVs5HTvRWXZY_ch88_z2A":{"text":"Introduced my girlfriend to St. James, and now she won't stop talking about it. I think sh","useful":3,"cool":2},"aLgsAC8IVepjj5HAPQ8G3g":{"text":"I love this place! I've been there for lunch a few times, and it was great. I really like ","useful":0,"cool":0},"mrzy-hxmlptZ6ml996Ut1w":{"text":"Great place for all cheese lovers!! Hooks cheddar sandwich is my favorite, as well as Mac ","useful":0,"cool":0},"0M8HAcQ2moEOiRGt6s0x8w":{"text":"I've been here a couple of times for drinks and a cheese plate and its always been a delig","useful":0,"cool":0},"pTAsZrA6tWXYuPqoOD3Okg":{"text":"This is without a doubt the best place for cheese in New Orleans!  St James has it all!  I","useful":2,"cool":1},"tPsryL4wWgPI5WioD00fUg":{"text":"When I travel I try my best to stay away from the typical food finds and in a city known f","useful":0,"cool":0},"c7EOA6fR0luC-m9z_CtO8Q":{"text":"Met a friend here for lunch. They had a cute front outdoor patio and back patio to sit at ","useful":2,"cool":1},"lGPxJ0VAo_MojbCSJhNlMg":{"text":"Great sandwiches and cheese boards! I absolutely loved the Brussels Sprouts - you HAVE to ","useful":0,"cool":0},"LZK_aZgwsfjphzCEnHf3oQ":{"text":"Superb place to stop for lunch. Got Mac and cheese for the kids which the adults couldn't ","useful":0,"cool":0},"csxz3pVaa_Vn_l63Sb2mjA":{"text":"Wine, cheese and everything in between! This uptown spot is delicious, casual and convenie","useful":1,"cool":0},"8DZxKeJ3dPFdD5_XOBvCWA":{"text":"Make your own charcutterie board! You can pick your own combo of meat and cheeses and it c","useful":2,"cool":0},"48KS4O3gQYCwwUc-nbqmqA":{"text":"Delicious wine and cheese restaurant/ shop in uptown New Orleans! Small interior and patio","useful":0,"cool":0},"-vEhtUkbrp1t3Ik4p0yA8A":{"text":"As others have said........\n\n The staff are aloof, and not what I would call inviting. Thi","useful":0,"cool":0},"sx6EbPSDlEWZaTEdeipL7w":{"text":"Very average. I ordered the Hooks--it had about a half inch of deli meat and a thin layer ","useful":0,"cool":0},"gGnx0PiReuPrAw92Pzkq7A":{"text":"Aw shit this place is phenomenal. It's a bright space with tons of seating options (inside","useful":2,"cool":1},"YAj1Xw-m1nCpCMdjWlKwlw":{"text":"This place is so California. Delicious. \n\nEvery time i come I get a cheese tray and the Be","useful":1,"cool":0},"nAhyvuy19xMWxA98w_F1sA":{"text":"Can't go wrong at this cute neighborhood restaurant. If you favor cheese, this is your pla","useful":0,"cool":0},"S4359q4ObOGPe0-VNCdW-Q":{"text":"DROOLING over these cheeses as I write this.\n \nPerfect casual spot for my girlfriends & I ","useful":2,"cool":1},"mxqvkXCOl9_4_H0CB0RTTg":{"text":"It is an ok sandwich/salad shop which specializes in various kinds of cheese. Nothing to r","useful":0,"cool":0},"nn_pWbwvfLJOKrxGhhEqpg":{"text":"Great fresh food. The salad was amazing and my son got the sandwich which was on point. I ","useful":0,"cool":0},"NNM1g3KNwS5Ng-y9eNh1Kw":{"text":"What an amazing cheese store!  I wish we had something like St James Cheese Company in Sea","useful":0,"cool":1},"5ucthfFIdpV9lk4jCQj21A":{"text":"You're missing out if you dont check this place out. Read and heed the other reviews, I'm ","useful":0,"cool":0},"KyTZPIaTlNI3l5M4FYi_2w":{"text":"A cheese lovers heaven but your wallet's doomed as, of course, those fabulous cheeses come","useful":2,"cool":0},"SQCcHkdziV5srO4Co23qvg":{"text":"Do you like cheese? Do you like carbs? Do you like alcohol? Then I don't know what you're ","useful":2,"cool":1},"DvRxCZdmkFmOIgIaLheFTw":{"text":"Such a classy place, inspires me to learn a lot more about all the smelly, delicious chees","useful":1,"cool":0},"v07zC7ZCNk45njxPxTs8lA":{"text":"Stopped here as I had a meeting across the street. Not being from New Orleans I love visit","useful":0,"cool":0},"WxX4lu-Pk2BFdecb6wh1HA":{"text":"I have always wanted to try this place, but I had never been in the neighborhood when it w","useful":0,"cool":0},"f27dqlo-zor417FERM7hxg":{"text":"Been here a handful of times, most recent for Sunday lunch takeout. Called ahead to place ","useful":0,"cool":0},"vpkwsrG7Qxa5nSqz3EJaNA":{"text":"The food was outstanding here. The selection of breads, meats, cheeses, and accompaniments","useful":0,"cool":0},"Dyr8xHlXY1tnq7PuxSUQ5A":{"text":"The ONLY reason I didn't give them 5 stars is because they don't carry Reblochon (since it","useful":0,"cool":0},"0elMPMP5h4ufLzzewx-Njg":{"text":"Always a fantastic lunch or dinner. Ham and Brie sandwich is out of this world. Service is","useful":0,"cool":0},"Hz2UFTY3jijQtf1Tp3bFpw":{"text":"Have you ever seen Gossip Girl (don't judge I have a girlfriend)?? \n\nWell, this place has ","useful":1,"cool":0},"aZIVp5BWWAv314yyS7OqOw":{"text":"I love cheese, so I'm probably going to love any shop dedicated to cheese. But they have a","useful":1,"cool":0},"pSUE41VrPkwGEBnG1pFQiw":{"text":"I LOVE St. James Cheese Company. When you're craving a light, fresh sandwich or salad with","useful":0,"cool":0},"y2WDSrJpoWPXk328n_hEjg":{"text":"The uptown location is always on point. I've never been to the CBD location. The food is g","useful":1,"cool":1},"wGrJDd8I2-lJEHnV5fOh_w":{"text":"I loved the charcuterie board. It was excellent. I also got the Hook Ladder sandwich, whic","useful":0,"cool":0},"0UatsWuqMOZRO9zTTzWw2Q":{"text":"Cheese is one of my all time favorite foods, and I am so glad I went to St. James to check","useful":0,"cool":0},"SkawMzwmwIc0rL0HubvvKA":{"text":"It's been quite some time that I've had the pleasure of eating here, but this place is so ","useful":0,"cool":0},"kMp2FAgwX_1L040ElW7kXw":{"text":"The cheese here is so good that my words don't do it any justice.\n\nJust get up from your c","useful":0,"cool":0},"cAKSkHuzqdBP2XnRrUcixA":{"text":"A great little gem in Uptown. We got the three cheese plate (cheese monger's choice) and l","useful":2,"cool":1},"pTdiXF2L3Xj2S2jX7osA3A":{"text":"This is for lunch, not necessarily the cheeses. I got a avocado, cheddar and turkey sandwi","useful":1,"cool":1},"vC38aqk6o9KzNMYaosA7Zg":{"text":"St. James Cheese Company is one of my all time favorite restaurants to go to in uptown new","useful":0,"cool":0},"TA9AVmh6eLryS7PHGhSX_A":{"text":"My daughter and I were out running errands on a Thursday night and popped into St James fo","useful":3,"cool":1},"E4D0UwN134Reha19Z-hVuA":{"text":"St. James Cheese Company is a charming cheese shop/ café. The Hooks Cheddar sandwich is lo","useful":3,"cool":1},"OPb4evzhKgOkQGXkILaTPw":{"text":"Great place. Sandwiches are amazing only outmatches by the fresh cheese. It's a great plac","useful":0,"cool":0},"oVjTZ0xx5v2PUOIfAar5WA":{"text":"If you love cheese, you would love St. James Cheese Company! Grabbed a late lunch on a bea","useful":2,"cool":2},"ARRx186gSmgRHXkm--phOQ":{"text":"The best selection of meats and cheeses - hands down. \n\nFood: Some of my favorites: Mac & ","useful":0,"cool":0},"AOMmZ7NVP3XWBa_pfmXCNA":{"text":"CHEESE MONGER FOR LUNCH!!!!!! Yaaaaaas omg it is the perfect macaroni and cheese for when ","useful":1,"cool":0},"IUSYvdB8g2uevuB5lBS8tQ":{"text":"Wine and cheese were clearly meant to be together... But pairing that with artisan bread, ","useful":9,"cool":6},"7RiIMIG8CGSfoVzDpuFwOQ":{"text":"I stopped at SJCC to pick up pre-steak dinner cheese.  You know, just a little something t","useful":1,"cool":0},"i3gfKq1q0g24XWEPkAacRQ":{"text":"Top 5 best places I've eaten in the 10 times I've been to New Orleans. I come here every s","useful":0,"cool":0},"owRMv9A-dKO48C0jeB0y7g":{"text":"This place is like cheese heaven. If one mouse in New Orleans found out about this place, ","useful":1,"cool":0},"zUSRJ9bLVjyEmu9p0fb5Uw":{"text":"Great shop to stop in to try some cheeses are have a simple lunch.  I don't eat meat so I'","useful":0,"cool":0},"RBY8ZIIVUOVDb54uG6K9QQ":{"text":"One of my favorite places! Really can't go wrong with anything. Great sandwiches - my pers","useful":2,"cool":0},"g6F5CHDrOvyrC5TNKuvDNA":{"text":"You shouldn't come here.  I have a hard time getting a table.  Go to another place or orde","useful":3,"cool":4},"g02B9XnURHbn1W8jFnPPXA":{"text":"It was about $10 for a sandwich. I got the Beecher's Cheddar sandwich and it was delicious","useful":0,"cool":0},"uvg9xI31-Fe85o4FdshTbg":{"text":"The sandwiches are massive; full of delicious, quality ingredients. Come when the weather ","useful":0,"cool":0},"TaowBJIVhty7cPBi-v40kg":{"text":"Like everywhere in NOLA, I wish St. James Cheese Co. was open later.  This way I would be ","useful":2,"cool":0},"IOhczkTh2bJjW4VXNWolBA":{"text":"We were out riding the trolley and asked a local about a nice sandwich shop and she recomm","useful":0,"cool":0},"YRdRgNMdQPfl3wODg63fYQ":{"text":"St. James is definitely a great lunch spot in NOLA. The building is nice, there is a patio","useful":1,"cool":0},"LcBi0V_KKTMob14P_koOxw":{"text":"On a recent vacation to Spain, the better half and I discovered a love for charcuterie and","useful":0,"cool":0},"iF1_pI6vbzafstXIPgC7NQ":{"text":"We love St. James Cheese Company. I have been going to the uptown location since I was in ","useful":17,"cool":8},"mpB2jV8fh6CAA5Th4xy9ig":{"text":"I've only been here for a beer/cheese class and a wine/cheese class so my review might be ","useful":1,"cool":0},"YklS8p7Jm0RubQTHd24bJw":{"text":"Since the pandemic, I've ordered a few times for delivery and pickup. Delivery has been hi","useful":0,"cool":0},"bv6ZnX7yCdOF9sktrr0Siw":{"text":"Cheese Cheese Cheese. Its great. And St. James is the best at providing it.  I have been a","useful":0,"cool":0},"DwcNd0lEJ82aU0oiO0HQUw":{"text":"This is my kind of place! Plenty of excellent cheeses to choose from and some little bits ","useful":1,"cool":1},"NdvbW33gUVsFd9st3q6Elg":{"text":"The Gouda is Bitchin' \nService was great! Thank you Saint James Cheese Company! We love yo","useful":0,"cool":0},"65h2EvNB4DCBDLmT6tr4GQ":{"text":"This place is one of my fav.. I awkward trick my wife to come here..i highly recommend thi","useful":0,"cool":0},"EPbR8IC94PgMPHXxJ6SGVg":{"text":"House sitting around the corner. Have been here twice so far. The Mac and cheese is like c","useful":0,"cool":0},"kNNjFGrqf2YMzGS8fgu0og":{"text":"I was in cheese heaven! A friend who lived in NOLA for many years recommended this place. ","useful":0,"cool":0},"RPggdv8d0RoeQ0gUkB_X4Q":{"text":"small, probably family run, and passionate.  If you don't know anything about cheese, this","useful":1,"cool":0},"Da7cev8l0mDMCPH135pHPQ":{"text":"I LOVE the food and people at St. James. My husband and I have been here a handful of time","useful":4,"cool":1},"L5Kzj8F_mLi9GOOoAEGtqQ":{"text":"ohmygaaaaaaaaaaaawwwwwwwwwwwwdddddddddddddd. so good.\n\nwent with my family (2 kids + 2 adu","useful":0,"cool":0},"ex655LR3H2PgGlHtSpVIoQ":{"text":"I eat here more than I have ever eaten at any other establishment in this city.\n\nIf you do","useful":2,"cool":1},"4d_Aodt1t8IQzqS0Vb-iKA":{"text":"Finally I talked a friend into going to St. James with me and we were not disappointed. We","useful":1,"cool":1},"jDu7kBBSZ8upuaiXjvsUVg":{"text":"We stopped by for a snack, but the food looked so interesting, we ended up eating lunch an","useful":0,"cool":0},"JmG2Ad8YgNfuWxXcPvsEcg":{"text":"I absolutely LOVE St. James. In fact, I love it SO much that I wish I could just move to t","useful":18,"cool":11},"GJzG1uUtY-Lf86FBMBfqfg":{"text":"If I had to live out the rest of my days only eating St. James, I would cheer for joy.\n\nAl","useful":0,"cool":1},"WvObo8uxYEpnQ7FqSnbLSQ":{"text":"Very authentically sound sandwiches-made with fresh meats, fresh breads, and of course AMA","useful":0,"cool":0},"D9lGRoxlwqA7SK0UTXucIw":{"text":"If you love cheese enough to marry it, then this is the place to choose your partner(s). (","useful":0,"cool":0},"pcyA-yLqi3jfq5CZB5P7BA":{"text":"After months of wanting to dine here I finally had the pleasure to dine at this FAB lunch ","useful":2,"cool":1},"f2jZEGuxE1dDBBiVd71erA":{"text":"Best meal of our New Orleans trip!! We went around 1220 on a Thursday, and the line was co","useful":0,"cool":0},"YITsHnElIjnIRSyr5BFygA":{"text":"I have died and gone to cheese heaven. There were so many cheeses to choose from. and many","useful":3,"cool":1},"4V_GCI08Jym0EMKCrqoUfg":{"text":"my favorite new orleans cheese shop!\na very good selection of cheeses and cured meats and ","useful":1,"cool":0},"NRzQDHBuFA3T0qko9R8m8g":{"text":"L * O * V * E\n\nSt. James Cheese...Why are you so GOOD to me?! You make me want to visit yo","useful":4,"cool":1},"ZqmGvToDzX8-kPY7m4xQdQ":{"text":"The girl that helped me was so sweet! I went in looking for parmasean. They didn't have it","useful":2,"cool":0},"8fnefXJ6rOg9J9DtNugrIQ":{"text":"Love this place, but I love love love cheese and cheesy things almost as much as I love ca","useful":1,"cool":0},"u-DWgsOND_aFp4UpOReXVQ":{"text":"I absolutely love this place. My favorite thing to get is the cheese board because it's di","useful":0,"cool":0},"bMl6Y8rTtz20bLFKXtZfkw":{"text":"If you love cheese, come here obviously. It's the cutest place where you can get a nice ch","useful":0,"cool":1},"a3SqatPRrdmL0hZ-p8VhlA":{"text":"My favorite restaurant on prytania! Outdoor and indoor seating. There's so many selections","useful":2,"cool":1},"dX-Q--fowYqTsvmDw2dGig":{"text":"Great lunch spot! Delicious deli sandwiches and great charcuterie plates. I had a wonderfu","useful":0,"cool":0},"cNvWqyuOSxvcvjsVUXpEzQ":{"text":"This was a lovely mid afternoon stop after walking Magazine St. I think the star here is t","useful":1,"cool":0},"rTwjlaAEezCtVr5ZhXkv4w":{"text":"I came here for their Thursday night movies on the patio. Not only was it a lovely evening","useful":2,"cool":1},"3hOrBmmjwj5BEAbuwPv8Ow":{"text":"Wow wow wow! Talk about a gem of a place and perfect meal. I recently stopped in St. James","useful":0,"cool":0},"k3QM5oBXJH3AvUVMVNCVSQ":{"text":"Such a great location. When I first tried this place, I was unsure of what to order and wa","useful":1,"cool":0},"jXrzW_fJXCFLZy_o3tfuBg":{"text":"If you want the best sandwich on delicious, fluffy, freshly made bread with lots of turkey","useful":0,"cool":0},"9jWyYg97ThNrZ8CW-q23vw":{"text":"Loved the Mozzarella sandwich! If you're in a rush, call ahead because they get busy insid","useful":0,"cool":0},"QSXh7yrGPV5d7TQkrMa5ww":{"text":"Loved the mozzarella! It was warm and ooey and gooey! We also bought the hooks which wasn'","useful":2,"cool":2},"tjfXBlN4biigbrnHFjhBRQ":{"text":"We've been regulars here for years and just love it every time. It's such a treat to walk ","useful":0,"cool":0},"rD9Ob0fFVFSvGSWWh_OJQg":{"text":"So good! The cheese plates are great as well as their sandwiches. The lent specials are a ","useful":0,"cool":0},"hVYTDYpQuecCaIQmyRW34A":{"text":"I have never had an experience at St James that was less than stellar. The prepared food i","useful":0,"cool":0},"M_CJGtv1UpIq8v2j0AKBpQ":{"text":"I really like it here! I went in before Thanksgiving to put together a cheese board. I tol","useful":2,"cool":0},"w7qq4-un7JnefH0bo3RUKw":{"text":"St James has the best cheeses, meats, sandwiches, soups, drinks to go with, etc. Whether y","useful":0,"cool":0},"xZfsZq85yT5X3MDZNM_g0w":{"text":"The stinkiest cheese store in town.  Super knowledgeable staff and great selection.\n\nPlus ","useful":3,"cool":0},"6lg4AKqbyx0DcuF1Hc3J7w":{"text":"In my opinion, better than their warehouse district location!\n\nI love how the restaurant i","useful":0,"cool":0},"vtjEA0Mxfg_jpOCapvrbOg":{"text":"St. James, you had me at Ticklemore. \n\nYou not only knew what it was, but why it's so diff","useful":4,"cool":2},"1JoPiYWcub-pBlTZNgb4eg":{"text":"I really liked the food the first time I went. Great place, however with my second Togo or","useful":0,"cool":1},"k5NvQYby-Ixe34ko6p99Og":{"text":"I just attempted to provide in-person feedback but was completely shut down by the employe","useful":1,"cool":0},"Sl0Mjx1-2BHdcAJUKQHSSg":{"text":"Quite shocked by the rudeness of the staff in this place. Walked out. Will never set foot ","useful":2,"cool":0},"rYcRI6uQ8iFgEOWuCbWUtw":{"text":"Wine, artisan cheese, pickles, goliath sandwich and great service? For around $25/person?!","useful":15,"cool":5},"PkjKCpPxBTz1QI4b9dqMOw":{"text":"Delicious and loads of options! Our friends got one of the sandwiches, we split the 5 item","useful":3,"cool":3},"TgmHHoddhtxxIsqn30X3Fg":{"text":"YA HEARD? There's a super cool bearded guy that works here who's a \"Bourgeois\". He's a 7th","useful":7,"cool":1},"2-8KDVR37F1Y-maFD75L-A":{"text":"This place was really good! We came here during a lunch rush and I think no one really kne","useful":0,"cool":0},"RIZZXESHqefjldFKX52DMQ":{"text":"I've never dined in, but I've ordered out from this place at least 20 times. Delicious foo","useful":0,"cool":1},"azRbRGXpUgcsxFYxLsV4EA":{"text":"Usually love the hookes cheddar sandwich but this time the turkey was slimy and gross. Loo","useful":1,"cool":0},"GWgkFg3z7TJrXLAlf2jHEQ":{"text":"My favorite place in New Orleans. I have been to both locations and enjoyed both the peace","useful":0,"cool":0},"svIAFydArKyEOW_vJwIeYA":{"text":"This place is a staple in Uptown New Orleans. I will say they definitely know their cheese","useful":0,"cool":0},"h4630HbVlFsd6nMIECZ6gw":{"text":"I enjoy the sandwiches here. I also like the outdoor seating area that is tucked in betwee","useful":2,"cool":1},"zV39CEFTEIIJIfiJDqThUw":{"text":"WOW. I am speechless!!!!! I've tried many restaurants in New Orleans over the past two mon","useful":0,"cool":0},"AepuHz-XKWVw05oYQRez2g":{"text":"Got to visit St. James Cheese Company's uptown location this weekend for their 15th annive","useful":0,"cool":0},"mdli3NUsUVVyaY2_tDXSJQ":{"text":"Over 3 years later, this is still a favorite. The perfect spot to order a cheese plate for","useful":15,"cool":12},"z46C8v9SCUIgQ-h5P1gWtg":{"text":"I have to say on all the initial visits I'd vote 3 stars, but throughout the course of my ","useful":7,"cool":0},"vrISHsiz--54PtkA_dJ27Q":{"text":"Probably the rudest service staff I've ever met. I hope this company considers bringing on","useful":1,"cool":0},"Ejk3x-Bv0OtqXxrjuOo94w":{"text":"I've have lived in New Orleans almost 5 years, but I had never visited this wonderful plac","useful":1,"cool":1},"xpcbPyidsaxZFQuOZGaLDg":{"text":"I'm having a love affair with St. James Cheese Company!!!\n\nDoes it get any better than a b","useful":2,"cool":2},"COYb4sNCvYox0458pnFUnw":{"text":"After moving to New Orleans, we happened upon this place and it has become a home. This is","useful":1,"cool":0},"nTZ8S9h6jCu7TDRjCJoM7Q":{"text":"The owners know cheese. Excellent and varied selections whether it is a cheese from the US","useful":0,"cool":0},"ubxbbNRqkkEFBtwQDaVFPw":{"text":"Yuuuum. This was the first time I ever ordered takeout from this St. James restaurant loca","useful":1,"cool":2},"uNd1bMumYoSGBIIFxDNDzA":{"text":"Don't be fooled by the restaurant setup that makes a naive passerby assume St. James is si","useful":4,"cool":1},"9N4ZP7l_gr_cJk7bidmD0A":{"text":"The restaurant and store are both a little pricey for me, but everything is tasty and high","useful":1,"cool":1},"haJXHXGn5f8wXf-bDfzNMA":{"text":"Five stars for their sandwiches. Absolutely amazing. Prosciutto-wrapped cheese sandwich wa","useful":3,"cool":3},"Ei__mGbv_gWUKfOGgRU1HA":{"text":"Small inside and lots of flies outside.   \n\nLarge portions and food is tasty.   \n\nRecommen","useful":3,"cool":1},"A9xM24v4IVm6JQPVgeXCuQ":{"text":"After many recommendations to the famous St. James Cheese Company, I made my way there one","useful":0,"cool":1},"OyC27Uo7c7qbyyYNBWcd8w":{"text":"Ordered 7 blue cheeses as Christmas gift for my sister. Beautifully packaged and delicious","useful":0,"cool":0},"HwPfdOpdYyuxAQVuNxyXjw":{"text":"Great local spot for all your fancy provisions. If you're planning a date night (or having","useful":0,"cool":0},"HiI7f03tPqSPrAwOxfyv5g":{"text":"I had heard such great things about this location and was hoping the employees would help ","useful":1,"cool":0},"x1xlgZYVl8bWKKacTqr_cA":{"text":"I love their food! My favorite is the mozzarella sandwich. When I got their it was empty a","useful":1,"cool":1},"AG4WmIUXP6x8cDJBmixNgw":{"text":"I'm sorry, I'm having a hard time typing my review because my mouth keeps watering while I","useful":1,"cool":0},"Hpg6ie8YsTWGgfXLdT8dKQ":{"text":"Hooks cheddar is the ultimate. Quality ingredients,  the freshest cheddar. Service is impe","useful":0,"cool":0},"QMBxlOM7RcXX7LAvJji0_w":{"text":"We ordered a cheese plate and enjoyed it while deciding what to order.  Great cheese plate","useful":1,"cool":0},"Re96vFuw9bLp_2lRDmWDtw":{"text":"Ploughmans platter was excellent! I wish the cheeses on it varied a bit more (heavy on the","useful":1,"cool":0},"WBU9OF9s8f20FlTiWTwhsw":{"text":"It seems that everyone I know loves this place. While I am sure they will shun me now, I t","useful":8,"cool":0},"Yn-WI9_yt01vYDOxf5Wsbg":{"text":"Beautiful store with great cheese selections and a way-better-than-the-usual-fare lunch me","useful":0,"cool":0},"LZiHYCiBx3Fyz93YLQ-NEA":{"text":"There's no better place for lunch than one where you feel comforted by the food and also n","useful":0,"cool":0},"wEcOJwKWvHs1VrXLU3l0Ug":{"text":"Waited 40 minutes to get some cheese. Left after waiting for so long. Who knows how long i","useful":1,"cool":0},"8RGKIInGQyGk3p2Jzx02oA":{"text":"This place is really good.  Try the smoked salmon with that cheese that they pair it with ","useful":1,"cool":0},"D0J9QXySKCDLbV7frVzvSA":{"text":"Besides the salads and sandwiches always being great, their made to go cheese and charcute","useful":0,"cool":0},"AWQ1LZWnHBjF3zlIyUoNzg":{"text":"I hereby promise myself that the next promotion/publication/big deal thing that happens fo","useful":3,"cool":0},"9FcIUA2WtmEANbx0qWbGJw":{"text":"Didn't live up to the hype of their yelp reviews.. they didn't offer a lunch special like ","useful":1,"cool":0},"_CSEFjFaTeVNJsqZsEVGig":{"text":"I just had the special called \"Seared Tuna Sammy\" and it was absolutely delicious. The tan","useful":0,"cool":0},"ifUbb5MkzXYWVFhw4n_odQ":{"text":"Today me and my boyfriend went to eat here.  This place has gotten worse over time. First ","useful":0,"cool":0},"3BrF5DW-9Xvn1wy6_b_vOg":{"text":"Food's good. Workers are rude though. They are not helpful. Would not go back solely becau","useful":0,"cool":0},"5Dw6BUxvzPN6YEOzTzB7HA":{"text":"Your good uptown, but my heart belongs to downtown....this original location is a fave amo","useful":5,"cool":4},"0cUNR225BMv06-UeHYv8Yw":{"text":"Having a cheese shop within walking distance is basically a requirement wherever I live so","useful":0,"cool":0},"yq5ZWevdOBBOdZ9_FsDJyw":{"text":"So yummy! The outdoor seating is adorable and they are pretty quick at getting you your fo","useful":0,"cool":0},"93i3IQgOUkZZhn3YVsTJxQ":{"text":"Had a really great time here working with one of the employees to find the perfect cheese ","useful":0,"cool":0},"eP0i-vzMNAAvPHGwxczJyw":{"text":"Had the chance St. James for the first time and I am an absolute fan! Even during the time","useful":11,"cool":8},"ZjBix4F7zm4dfLI2nK2qiw":{"text":"***DISCLAIMER*** Get ready for a long read...it'll be worth it!\n\nNestled into the pleasant","useful":5,"cool":5},"-LrH_88XtFy3hwUjQqA1ww":{"text":"The Swamp Lobster Roll (crawfish tails, not lobster) was delicious! The roll was toasted p","useful":0,"cool":0},"hLorNZ0qrSjs8i6hGw_bLw":{"text":"The pictures look great I know but the taste was not as good. Not as good as the hype surr","useful":1,"cool":0},"Mu3YYwYl8GNGJ7-LRR0p0Q":{"text":"Love this place!!! Great options, love to be able to get hot food and cheese boards and sa","useful":1,"cool":0},"6GncIDE_CQN8TnssGlNT0g":{"text":"Pandemic update:\nLast night I took a chocolate and cheese class online from St James. The ","useful":4,"cool":3},"g36T1CuXJVHPj8G_rTZcEg":{"text":"St. James now holds a special place in our hearts. For our wedding reception, we chose to ","useful":3,"cool":2},"FbNmrnsajN_0lbT7p0Z80A":{"text":"I love St James and have been frequenting there for a while now. Normally I am always sati","useful":2,"cool":0},"JrRwR-SKm_m9b3WwmAZVlQ":{"text":"Disclaimer: this is only for the sandwich I had. The cheese selection seemed impressive bu","useful":2,"cool":1},"vu6vZ0gHTiDMZLMOdg-GfQ":{"text":"This company is amazing!! Great service and fantastic food! The gift boxes for holiday gif","useful":0,"cool":0},"FUGN_hagtYDPtuzijTIsCA":{"text":"I used to go to St. James pretty regularly during undergrad and for a year or two after. M","useful":0,"cool":0},"ILANnvu50LMrACh0wKU6BA":{"text":"Hooks cheddar sandwich! I've been here twice now. First time, for a good sandwich and the ","useful":0,"cool":0},"YXuD__PKvESSQeFfUGp8tQ":{"text":"Normally this place gets 5 stars from me. I know we are in a new reality, with everything ","useful":1,"cool":0},"E4LEqW_bNrmPwDmaCr6JRw":{"text":"Had lunch here today with friends and this place is pretty good, really like the atmospher","useful":5,"cool":4},"Q3LaiInjbdKHLGUH-QH-tA":{"text":"\"I went down to St. James infirmary, I saw my cheeses there\nThey was stretched out on a lo","useful":0,"cool":0},"Z2tjqipo9NKFnbnWL2ab2g":{"text":"Excellent cafe and cheese/charcuterie shop. The menu isn't too large, allowing them to rea","useful":2,"cool":0},"zIbWGCMbqDdrxX8zk0Y-sQ":{"text":"A cheese lovers dream come true. Counter service with a great variety of cheese, charcuter","useful":1,"cool":2},"opY1Z9dk_EsCQTNsvUNs_Q":{"text":"Excellent sandwiches, salads and small plates, all featuring one or more of their deliciou","useful":2,"cool":1},"wi15ZIXbMgS5eK33g702HA":{"text":"Got the Brie and ham, mostro cold, and the smoke blue. Also got the parmigiano salad. Sala","useful":0,"cool":1},"sTX7mEk7Um00YKe7-hYT7g":{"text":"I love St.James Cheese Company! \n\nI've been going here since they've opened and it only ge","useful":2,"cool":2},"w3hv4xE7YTGWshRnioBjsQ":{"text":"\"\"I went down to the St. James Infirmary\nI saw my baby there,\nShe's laid out on a cold whi","useful":5,"cool":4}}