{"S3G3_5NXTW46mvhoUsE5KQ":{"text":"This restaurant is absolutely incredible!  My boyfriend and I came here on our recent visi","useful":0,"cool":0},"A64YWPeZ_cGGUOrPg43wJw":{"text":"Came for Happy Hour...drinks half off and small plates $5....drinks and food were deliciou","useful":0,"cool":0},"BJ-E4Csq1nMkriQvoL2B6A":{"text":"You need to hit this place up for happy hour. 99 cent chargrilled oysters were amazing!!! ","useful":1,"cool":0},"qvR-q8Dhb9bqMqJbqZTKAg":{"text":"We came here during Mardi Gras 2015.  Too bad it's right in the pathway of the major parad","useful":2,"cool":0},"fPDoEFhY5t2W1IpjURJIfA":{"text":"Went there to celebrate my friend's 30th bday with a party of 4. Excellent service. Omg th","useful":0,"cool":0},"HyriNZpiVQx2f0WVyfmHvw":{"text":"Simply delicious. Have always wanted to eat at one of Emeril's restaurants and it did not ","useful":0,"cool":0},"wgm01irZPmkXFzDtOA060w":{"text":"I don't know where to begin with one of the best meals I've ever had in my life.  I guess ","useful":1,"cool":0},"mWfnR3-8IcfworTbE72S8g":{"text":"Amazing!!!!! Everything from the food to the service.  I liked that they brought every at ","useful":0,"cool":0},"1BdZakd3Wg3ufGfZwjC2sQ":{"text":"Good drinks, great starters, and desert,  however, the rib eye was not (tough, gristly & n","useful":0,"cool":0},"7JBOSsmKZfD2Fxl3Ss3YwQ":{"text":"Great food I had fish delicious suggestions get the pork chop my husband got it is  exquis","useful":0,"cool":0},"BnkM3HIwez5FBbxBiKGD_w":{"text":"They gave me a bad experience for one night of the three that I was staying in New Orleans","useful":0,"cool":0},"LgNHnltaevIM3BhVwWZFeg":{"text":"This place is definitely a treat. The food was flawless, the presentation was top notch, a","useful":0,"cool":0},"L2fju8Al_U6Uj0zWATMbMw":{"text":"Great service and awesome food!  All you would expect from an Emeril restaurant! Top it of","useful":0,"cool":0},"N737y7d4r0u-XGqkmbHsOw":{"text":"The only mistake was making this our first stop once we arrived. Everything after was comp","useful":0,"cool":0},"zCiGB6vrcv5eYEdEXxutMw":{"text":"My meal was very salty and the bed containing beans were not completely cooked. My brother","useful":0,"cool":0},"rH6xYgTRUaLtGGGvUdsLQw":{"text":"I am surprised that others did not give this restaurant 5 stars. I travel a lot so often e","useful":0,"cool":0},"iNSBhaOvuSAWcBvWIwhqVw":{"text":"The food was very good, but the service was ATROCIOUS. We asked for wine recommendation as","useful":0,"cool":0},"Cnf9EqUqslyM0X8Y-lMeRQ":{"text":"Service was absolutely excellent - Francisco took amazing care of our party on a special n","useful":0,"cool":2},"QDt-mvcHDvE4D1Gafp-9UQ":{"text":"My husband and I came here for our wedding anniversary and the service was impeccable! Fra","useful":0,"cool":0},"CIkA4cVIDn0PhrgNzZO9Lw":{"text":"I had the red snap fish and it was well seasoned and prepared well.  I had a good tasting ","useful":0,"cool":0},"K0pqbOLv5WB83C-BqtjG0g":{"text":"We went to Delmonico's with high hopes after hearing about the amazing steak and reading o","useful":1,"cool":0},"Ge5WqDCrDRhvQyME0PElwg":{"text":"We went here with a group of 12 and were really happy with our food and service that we re","useful":0,"cool":0},"-4s5tM8-bA835TpUMWz0aQ":{"text":"Had a 50 person dinner party during a big conference.  Food: A+\nService: A++  David was ou","useful":0,"cool":0},"xnEXK2ag7NWpI_fwD6litA":{"text":"The food was absolutely delicious and the service was even better than the food. Every emp","useful":0,"cool":0},"HFOO0P8nyfYK6hnrmp8JwA":{"text":"We looked up the website before making reservations for this restaurant.  It tells you the","useful":0,"cool":0},"SsS2uVopJKBM2b6jDYo0dQ":{"text":"Outstanding I loved this place - the food is terrific - I had a fried oyster appetizer - i","useful":0,"cool":0},"9vMYrHjHN7AMrKh1OcpoNQ":{"text":"The food lived up to the hype but we were supremely disappointed in the service offered by","useful":0,"cool":0},"Jk41yzEZ9_p2h9zElR-Zkw":{"text":"What else can you say about this joint that hasnt already been written?  Get the Ribeye.  ","useful":0,"cool":0},"kFwserNuj3-I3gh-FCPhgw":{"text":"Loved the attention to the table that the wait staf provided.  Great meal!  Loved the char","useful":0,"cool":0},"rQwjOR0BoYUZ34IVaMUaYw":{"text":"We went here on a Saturday night.  The atmosphere is beautiful.  We had the crab and bacon","useful":0,"cool":0},"wZbSt7uKD028ZAmj_-_3Pw":{"text":"Be far the most expensive and most delicious steak I have ever had. It was well worth the ","useful":0,"cool":1},"5kWjhVNVTYFiLd6A_4ZnPw":{"text":"Had a wonderful meal on a quiet Tuesday night! The service was impeccable, and Kevin our w","useful":0,"cool":0},"RFFG2qMcJoNYVDmuvYnFFg":{"text":"I have been to both Emeril's restaurants in Orlando and thoroughly enjoyed them.  I had ve","useful":0,"cool":0},"-TJWeHD_JQKnT3_YTpGRFg":{"text":"Update- my now Wife & I finally made our way back to Delmonico in New Orleans after a long","useful":0,"cool":0},"a_QFChqUNkkQNzkYUTvR-Q":{"text":"Great place to take a date. Food is excellent. Atmosphere is quiet and very nice.  The sev","useful":0,"cool":0},"jjUSBTj4WntbKVlfq_PJ6Q":{"text":"My wife and I are traveling for our 25th anniversary ended up in New Orleans and ran acros","useful":0,"cool":0},"ewfcVGC0VrzrniHqV0l4bQ":{"text":"My husband and I celebrated our first anniversary here three years ago and had a wonderful","useful":0,"cool":0},"yk3yR6wWvfH5CWGliPAg_A":{"text":"This is  easily the BEST (and most expensive) of Emeril's 504 resaurants, and twice has gi","useful":0,"cool":0},"GB_VwuNcIIVtiUBbk_CSRg":{"text":"First off, i am a huge emerils fan.  We have dined at the bar overlooking the kitchen at E","useful":0,"cool":0},"Sd1-_WUfi2-ULV8F2p4etw":{"text":"I should have sent my steak back, it was overcooked. Great service, padded walls, high cei","useful":0,"cool":0},"keyD_Nv8R6O-7u4evDA69g":{"text":"By far one of the best dinners we had while in town. I highly recommend this location, not","useful":1,"cool":0},"2O1JfqON3Y9O2z1hJlwBrQ":{"text":"I liked it better than wife did, but she is a tough cookie. Cold soup sampler was very nic","useful":1,"cool":0},"xr6y0UlAlNV22KYV5dsDaw":{"text":"The bone in rib eye was excellent as well as the garlic mashed potatoes. My wife's red sna","useful":0,"cool":0},"xY403dQoQM_lmYop-ki_bg":{"text":"The four-course tasting menu is a smoking' deal and a great way to try multiple menu items","useful":0,"cool":0},"tJtaNxUKqMw8Wl-Sw8ye7A":{"text":"Food was good, but staff weren't as knowledgeable about the wine as other high end restaur","useful":0,"cool":0},"6vEFaWMj3jx2W5wx4sIAcw":{"text":"The food was very good. I had the jumbo shrimp. I also had a drink and it was exceptional.","useful":1,"cool":0},"xEt0Z-wObQ84fiFzfvVLUg":{"text":"It was fantastic. The food was great, the wait staff was constantly available. (Not in a b","useful":0,"cool":1},"xozgvXteoV5XIphoDD6xew":{"text":"Great service and ambience ! Don't forget to try the satsuma rum punch - light and refresh","useful":0,"cool":0},"OsiteCQPSCZeACx9OwAFWg":{"text":"The food here is amazing. So rich and flavorful. We ordered the crispy pork cheek and duck","useful":0,"cool":0},"pCmcrw0hPJRVZQjGb-j8KA":{"text":"Good food - although I will say I tried a few things and didnt have anything that I LOVED.","useful":0,"cool":0},"lNgje0UDCqODCaSGKUo9Ow":{"text":"Wow wow wow! The grilled oysters were to die for!! I followed it up with the shrimp and li","useful":0,"cool":0},"Wu_JQ0VfWThMHDz43LZ9PA":{"text":"I was in town on business, and as usual, my wife had scoped out the places for me to go.  ","useful":1,"cool":0},"yl9yUclZN8ligVTQGFB56w":{"text":"This place was simply beyond heaven. Had an amazing dinner with friends here last night.  ","useful":0,"cool":0},"BM6KgSU95ldhiJ4ZdstIzw":{"text":"Great service and always AMAZING food.  This is probably my favorite restaurant in NOLA","useful":0,"cool":0},"uELpfCAuL9clceuOXL7Hng":{"text":"The food here was ok, it was tough for us because we keep kosher. But the server did his b","useful":0,"cool":0},"ipQTUtOW6MiqoIiBDPXb7w":{"text":"Service was terrible. Food was nondescript.  Waste of time and money. DO NOT COME HERE.","useful":1,"cool":0},"4bP2yQifspR_8uXHKW-aHg":{"text":"Wow. The food was spectacular and the service was unbelievable. We felt like queens. Franc","useful":0,"cool":1},"pdBlWrUwLfvh3ClegliO-w":{"text":"Have been to NOLA many, many times, but never eaten at Emeril's until today!  With a live ","useful":0,"cool":0},"YAr6TwxkKyIoF_s9It0IXA":{"text":"A great experience with great friends. Everything was wonderful, from walking in and havin","useful":0,"cool":0},"NPwgPkjHZ_cZvYDXS_szPw":{"text":"Literally had the best steak of my life...the rib eye.  Wow, just heavenly...!  Also durin","useful":0,"cool":0},"wCfx0DyfYT7Q6HWkAgt9rw":{"text":"Simply outstanding. I've never had service like this before - simultaneously attentive and","useful":0,"cool":0},"0WAt2Ni8CeZT9BDe1n-Z8w":{"text":"A great meal in a unique and high class setting. \n\nWe had an awesome dinner at Delmonico i","useful":0,"cool":0},"GCNErScBZncehvmEEa8MAg":{"text":"This restaurant was good, but not great.  Usually I'd expect to have fantastic service fro","useful":0,"cool":0},"L1nmfltmQXjOMwe0KTlX0g":{"text":"I will start by saying if I could give this place ten stars, I would. My husband an I chos","useful":1,"cool":0},"TWjgmsyza8JezVpB45C3qw":{"text":"If you can ask for Fransisco as a server. He is absolutely amazing! Joshua was part of his","useful":1,"cool":1},"UfLgXv9NsJqGMuI7BX6FFw":{"text":"Great cozy place. Good food. Chef even made a special vegetarian dish for me since there w","useful":0,"cool":0},"txbEdib4AW27z92vWIhqAg":{"text":"We had the best dinner experiences we have ever had tonight. The food was amazing and it w","useful":0,"cool":0},"sliSs_VR153giyOV86rnDA":{"text":"Overrated and overpriced.  The first table they gave us was literally in the middle of the","useful":1,"cool":0},"n-Uj_4_vSKaB7Mxlre0SZQ":{"text":"Best service ever. Food was overall wonderful, but some dishes were more wonderful than ot","useful":0,"cool":0},"dzvviF-KnNrFrOaLw2AslA":{"text":"This restaurant really checked all the boxes off for being a great experience: accommodate","useful":0,"cool":0},"x3rrrB7SAWcTE_v-WYKIKA":{"text":"Came for early Valentine's day and it was simply wonderful. Emeril's Delmonico is quite si","useful":0,"cool":1},"GxGrZffU3Xz_xULFqe2oxg":{"text":"I came to Delmonico's in 2004, before the hurricane wiped everything out. This IS THE BEST","useful":0,"cool":0},"k-rcig_9hU-tRHts-P_Vtw":{"text":"I had an excellent meal here and the service was amazing. Highly recommend the boudin ball","useful":0,"cool":0},"xxzNv0E6QVkuUjGoRrZrTQ":{"text":"Really, really good.  We split three dishes and each was excellent, especially the spectac","useful":0,"cool":0},"HLl9p1UOCV9AngQqtyBo4Q":{"text":"Still knocking out excellent service and outstanding food.  Started off with a cheese and ","useful":1,"cool":0},"sMeFbYf13mVkZAyZahYvRw":{"text":"It was so amazing. I ordered the lamb shank and it was so tender I just used my fork. I'd ","useful":0,"cool":0},"bah8pF0xgK_VWrWcb16GRg":{"text":"My husband took me here for Valentine's day, and we had a blast.  The food was delicious a","useful":2,"cool":0},"dRWn_kp-dh0UqFUPQOwq_A":{"text":"We went here for Valentine's day this year and WHAT a treat!\n\nEven though our waiter was a","useful":1,"cool":0},"ynn3AX7gHydnY1UJwbtz2Q":{"text":"Fantastic!  Best Ribeye ever...phenomenal service, everything was outstanding.\nMy new favo","useful":0,"cool":0},"I5kA8WFudy3H2efjsSL3_w":{"text":"Five stars for service and the experience they created for my friend's bachelorette dinner","useful":2,"cool":1},"jdaS8Haiu3NnIfvFxKmHeg":{"text":"I was so excited for this place and really all I wanted was the banana foster. I had the p","useful":0,"cool":0},"dV6k5QEeQKfm-CZiJ807uA":{"text":"Used to be one of the best in the city. Recently, it's fallen off tremendously. Poor servi","useful":0,"cool":0},"IWRnIG3Vkp5UEx_3-x67Ag":{"text":"I only had drinks and appetizers off the bar menu - but I wish I had planned to stay for d","useful":0,"cool":0},"VKECliDOTkSJR1H1Yk24jA":{"text":"I love this place. New Orleans has tons of very nice service staff, but this place sets th","useful":0,"cool":0},"5crTkt3eWbX0GsukTw3SDg":{"text":"Excellent southern classic cuisine and some great steaks too.\nHad to try the shrimp and gr","useful":1,"cool":0},"WkegehpJkpn_l9w68jmMMA":{"text":"Whenever my company participates at a major tradeshow or convention we always make a point","useful":5,"cool":3},"1o4ioiO8dvSY45yf8Sx65g":{"text":"I love Emeril's Delmonico.  This place has a great happy hour from 5-7pm Monday thru Frida","useful":0,"cool":0},"dEkso8ynWVr9hYQrB39cVQ":{"text":"My wife and I were here last in 2001 and just had to make a return visit in 2013; this tim","useful":2,"cool":0},"rPUSuRy3DCT4tZn0tlWgog":{"text":"We had the most amazing dinner - complemented by the outstanding service of Francisco Dusa","useful":1,"cool":1},"4KtlBc_DIBH9dnNOtAj6aA":{"text":"Service is very good but the food is below average for new Orleans and at that price. I wa","useful":0,"cool":0},"2JbsJ8QilYFnWs21hO7PWg":{"text":"This was my first visit to an Emeril restaurant.  I expected to enjoy it, and also expecte","useful":0,"cool":0},"qZc-WVPAtqkDPBS1OmCw9w":{"text":"Amazing place to eat. Absolutely delicious food. Ask for Francisco - he made the entire ex","useful":0,"cool":0},"XWgTuc_TyTPxgVzUrVZBoQ":{"text":"Great place!  Nice cozy atmosphere for a fancy restaurant.  Our service was great - but on","useful":1,"cool":0},"noDdy5fX_YI_wSVq8q362Q":{"text":"Over salted underwhelmed!\nThe appetizers were only ok. The entrees were incredibly over sa","useful":1,"cool":0},"0iPf1sYkeOpMzpQE4L_P-Q":{"text":"Delmonico was the first place we tried in a long weekend visit to NOLA, and must say it se","useful":0,"cool":0},"cm6Cj-_Gy0sBdG11g5b1Yw":{"text":"This is the best lace I've been to for a gourmet, lighter version of traditional New Orlea","useful":0,"cool":0},"v7oWdNaNcxazyBWOG2fyCQ":{"text":"I have had several meals here and this was no exception. Always incredible service and our","useful":0,"cool":0},"dKQ2vKtE_52U6Q18sz_b1Q":{"text":"We were satisfied and thrilled with our dining experience at Emeril's Delmonico. We starte","useful":0,"cool":0},"bMUFZ4B2CyvjEIonPcU6Yw":{"text":"Loved it!  The food was awesome, but it should be used as a special occasion because it wa","useful":1,"cool":0},"5pQp68BPAbQzcOeXVKaD-Q":{"text":"This was one of the best dinners I have had. The setting is beautiful, service was wonderf","useful":1,"cool":0},"jNIatvaRN67z7OQlGyayOA":{"text":"Delicious food, service was great. Our waiter made sure we were happy and took great care ","useful":2,"cool":2},"GalylbVnPx2Ywd1RPYcw1w":{"text":"I went there for a private party, so I didn't get to experience the traditional service. B","useful":0,"cool":0},"Es_pYWGETtrTisaPhdNzyw":{"text":"Maybe we are biased because my husband loves Emeril, but we had a wonderful dinner and exp","useful":0,"cool":0},"E_3j6qxppvlE2UmloYv0ww":{"text":"Ok..this is a great place if ur looking for a nicer, fancy meal in New Orleans. It's in a ","useful":0,"cool":0},"KsnftvFMWLJ_tff-pnhipA":{"text":"Food--fantastic.  Wouldn't expect anything less from an Emeril restaurant and they deliver","useful":0,"cool":0},"XBH8mXMgiDjYti5pRvU3mw":{"text":"Better places for the money. Like the regular Emeril's.","useful":1,"cool":0},"cOZ7ePwjedjwemk1EgqUcQ":{"text":"We had great service and our meal was fantastic. The entire experience was wonderful. Huge","useful":0,"cool":0},"cWwJPeyKh-5qDtXEwy-rDw":{"text":"Here, we had the opportunity to fulfill a long-standing dream to enjoy the culinary stylin","useful":1,"cool":0},"1i3FuZEr8m4UIM1n4LlYoQ":{"text":"I was in town on business and a vendor held a dinner here. Prior to joint the group my fri","useful":0,"cool":0},"IwX7a_FA3EXc3rvTI6H6Lw":{"text":"Maybe it was a bad night. Maybe the wait staff at our table was new. Maybe this is a resta","useful":0,"cool":0},"vab32KabR1P_MUh5eXOq6g":{"text":"The best part of the meal had to be the bananas foster made at your table. Our waiter Bret","useful":0,"cool":0},"WQAJNM8UBOMrrKDk0Tbe_w":{"text":"AMAZING!!  Went to this restaurant on our last night in NO, and was well worth it.  If pos","useful":1,"cool":0},"xG3C4NQCBrs2dOHq6_0YCw":{"text":"OMG!! Best food in NOLA! The food was excellent! However my filet mignon wasnt the best. I","useful":0,"cool":1},"HbFRSzCxHmhODpB_YWNZIw":{"text":"This is a great restaurant in a great location with pretty good service -- much better tha","useful":1,"cool":1},"oGd_KRYtTE4ETZUAUnpdlg":{"text":"Location: Old cosy house in the CBD heart of NO.\n\nService: very good. Some misunderstnding","useful":0,"cool":0},"a6QMFYKbSUZz5L_jtc4j_Q":{"text":"The food was consistently good but did not blow me away. I ate at Delmonico in Las Vegas a","useful":1,"cool":0},"g0aB8YW2w1XTcYhAWbv3MA":{"text":"Let me first start by saying that visiting Delmonico in New Orleans has been a dream of mi","useful":2,"cool":1},"Inf_m_Z26hl2E0qpRXva_Q":{"text":"excellent food but was very pricey.  we had a private room and had to walk through the kit","useful":0,"cool":0},"7pAUJ1AiKdmJmj9-JTm2Lw":{"text":"I'm not sure what was better, the food or the service! Everything was impeccable. Everybod","useful":0,"cool":0},"LiHjFHAa6W-wzKlapRxKSQ":{"text":"I am a frequent visitor to New Orleans and dine at its best restaurants when I can. My fam","useful":0,"cool":0},"1fRioD3LlI7gp0UZQoVVeg":{"text":"Fantastic dinner for our 23rd anniversary. We were seated at a table on the first floor at","useful":0,"cool":0},"e5c_hZWgEYeUdiCpEQomMQ":{"text":"I was so ready to be impressed by one of Emeril's restaurants, but not so much.  I mean, y","useful":0,"cool":0},"SHuUhs8p0vEiZX9dpg-piw":{"text":"Came here for New Year's eve dinner with my family.  Food was excellent!  Service and staf","useful":0,"cool":0},"HuMO8h1lnSDsSBMfjYYe3g":{"text":"Went there Monday night for dinner to review them for my blog.  When we arrived, we went t","useful":0,"cool":0},"xwBHuWf-Ygq3jmWIBJyNKg":{"text":"Outstanding service...some of the best I've ever had.  I wanted to order the surf and turf","useful":0,"cool":0},"yEoBNjrWGuSIW3ghcQjcyw":{"text":"Thought I was booking at the original Emeril's when I booked our reservation for dinner. T","useful":0,"cool":0},"BB7_UzU0J3a5BfeerVPJQw":{"text":"This is a fantastic restaurant. The staff is outstanding. Service is friendly and very att","useful":0,"cool":0},"KFB6Y05r-5dXAlaHmAVwzg":{"text":"I've been twice and can't wait to go back for more. The service is amazing, the food is un","useful":0,"cool":0},"X_hZyb23JVf2m-eyVQZUGA":{"text":"\"A cook is a cook, but a man is a man.\"\n\nI have no idea what that means but one of the peo","useful":3,"cool":2},"zFkgJK6Kdes9QSWVNpRrdA":{"text":"What's not to love?  From the moment we walked in and experienced the decor, walked throug","useful":0,"cool":0},"C-3RSXl51ei4gv1Qz_HNnA":{"text":"Ah! Everything from the drinks during happy hour to the bananas foster dessert was amazing","useful":2,"cool":0},"C1jx19CYUizbP3VLte9ECg":{"text":"12 guys on a search for a great NOLA experience ends up here and yes, it was as good as it","useful":2,"cool":1},"oYKccNT_pR8k3rRT7PDM_w":{"text":"This was the best food that I have ever paid for. It was not only a great meal, but a grea","useful":0,"cool":0},"_VxicEXK6o9emsjzbJy2BQ":{"text":"A four course meal with reasonably priced wine menu. A great introduction to Cajun meals i","useful":1,"cool":0},"EO5MslXkn8yYNzFXw1FpVQ":{"text":"This is one of the best restaurants I have ever been to. I am surprised at the number of p","useful":0,"cool":0},"CCmgF3S46ZXqu6miOmRPHQ":{"text":"I went to Emeril's Delmonico with my girlfriend for her birthday, and the experience was f","useful":2,"cool":1},"cy_zB_cec_G8rM7FpTQjDA":{"text":"Service was perfect. The atmosphere was energetic and classy. The food was delicious. I hi","useful":0,"cool":0},"InlXQZOXfQ5mM8GweIX_0w":{"text":"Summer happy hours are among us, and Delminico's is among the best.  Can't beat that his e","useful":0,"cool":0},"bKpUUeZAPNhIcw-xpNnZdA":{"text":"With complimentary valet parking on St. Charles, I should come here all the time!  I came ","useful":1,"cool":0},"KH9tHY9rKAB3MfUnjtjx7Q":{"text":"5 stars! 5 stars! Place was great. Very old school feel to the place. \n\nCame here with a p","useful":0,"cool":0},"0WNvQDOG2ftMmlKn2sBs7Q":{"text":"I went to this restaurant weeks ago, and this review is so overdue, because I wanted it to","useful":17,"cool":13},"-TkpoV8-PAscK1LhJHZNpw":{"text":"Wow - did I enjoy this restaurant!  Basically they have captured everything modern day din","useful":0,"cool":0},"N1Ay2ylTRh7HFH2A9cOeVw":{"text":"The good - the Filet was perfectly prepared. The brussel sprouts and the collards were ama","useful":2,"cool":0},"6Xm4EfylfcQL_tMEZOaXsw":{"text":"Dry chicken.... dry airline mac and cheese.  Its not the same place it was years ago when ","useful":0,"cool":0},"d2uF-lOpBPJx7MdnofZglw":{"text":"I'm not sure if I'm qualified to write a review yet, but I came here not too long ago and ","useful":2,"cool":1},"XboucJwsO9d_lTlyNBEP3A":{"text":"Not that I was looking for something to criticize, but honestly, there was nothing to crit","useful":6,"cool":4},"HtAD8TmMNHDS8nYPj9jTUg":{"text":"Was taken here by a vendor to one of the private rooms for dinner. Menu choices were slim,","useful":0,"cool":0},"2pJsC_9HBUvJh2T4qTZFWg":{"text":"Great service very flavorful food. Gumbo, lyonnaise potatoes, calamari, gulf fish all grea","useful":0,"cool":0},"b0MD9dSoxCxmICgg-CnM6Q":{"text":"This was our second experience at an Emeril restaurant - the first was Emeril's many many ","useful":0,"cool":0},"EyLWvSI1iHePeVgXlgCeig":{"text":"The only restaurant of Emeril's that I like.","useful":0,"cool":0},"lS3aycdivM6ae9ME6krxYQ":{"text":"We had a family dinner here Sunday evening, before a concert. The food was excellent and t","useful":0,"cool":0},"A1bFlszDhxFvnQHbMJftRQ":{"text":"The five course special was amazing. Barbecue Shrimp, Gumbo, Salad, Steak....all amazing. ","useful":0,"cool":1},"ezk6OofDikNeJCRIsh8deA":{"text":"Oh boy what can I say about this restaurant.  Prepare to spend time at this restaurant.  Y","useful":0,"cool":0},"T1I7NO0rDOYfeEuv5tLmFQ":{"text":"We were quite impressed by the service and the food were great!  We were in NOLA for a wee","useful":0,"cool":0},"YT4_jXvELkGt6_ZmpGNAWw":{"text":"First the Waite staff and food a excellent.  This is the best prime rib I have ever had, a","useful":0,"cool":0},"ZvIBFARwu0t1cvhj8LZhkA":{"text":"Anniversary dinner with my husband was awesome.  Our service team was attentive and made s","useful":0,"cool":0},"LeWfR0sKOXvvSAXSsqOi4Q":{"text":"A very cute corner restaurant and intimate seating.\nGreat food and service all around . Lo","useful":0,"cool":0},"5ipYJvrZUz93JBYcXVdmkQ":{"text":"The food is flawless as is the service. We had the best waiter. He gave us a little tour w","useful":0,"cool":0},"MrxovtRjWw1D-pI7YudR0w":{"text":"I really REALLY like this place. Not only for the food, but the service. My friend and i d","useful":0,"cool":0},"w3irM0L5NCYSwTtEIt_mMw":{"text":"My boyfriend and I wanted to try one of Emeril's restaurants while we were visiting New Or","useful":2,"cool":0},"9zUD55fdEeqLCVNIlMcAyA":{"text":"Let me start by saying that I don't typically leave reviews unless a place really stands o","useful":1,"cool":0},"D8h-bC1FVkmK4Cv3Q8OIhQ":{"text":"Had a marvelous meal here and great, attentive knowledgeable service. \n\ngot the filet encr","useful":2,"cool":0},"Xww0-fENtyxiGzhHfnG3fA":{"text":"It can be a little cliché to dine at an Emeril Lagasse restaurant while in the great city ","useful":1,"cool":0},"g7z9dwM38pDjai1K79jqSg":{"text":"I'm in love. Yes. I love Emeril, and I love Delmonico. It was so phenomenal there. \n\nWhile","useful":5,"cool":3},"v0HCb6ZmhUZqwi4bKIcnRw":{"text":"I'll start with the service, it was absolutely incredible! Everyone was friendly and I eve","useful":0,"cool":0},"7kNxMVU0TO-iJx4atO3dXw":{"text":"The most amazing food I've ever had! The steak was out of this world. The mac and cheese a","useful":0,"cool":0},"MtQHcHxqmRzxatjQmyQpsA":{"text":"Everything here was superb! I came here with my family for my 24th birthday while we were ","useful":0,"cool":0},"f5534cPIv7iu3WiKNaiENg":{"text":"I was pleasantly surprised. Normally, I'm skeptical of celebrity chef outposts. But our di","useful":2,"cool":1},"4ow9AT5ghGMVdDWAYEYIJA":{"text":"Great happy hour! Everyday 5-7. I enjoyed the chargrilled oysters (99 cents each during ha","useful":0,"cool":0},"4VE8pMsdvKd8pHpzWMaZdQ":{"text":"Although I came just for dessert and didn't have the full dining experience, it was absolu","useful":0,"cool":0},"6Hc4Vne7AraG_ReHUrjt9A":{"text":"Good food.  Too much service.  Our conversation was constantly interrupted by, \"How's your","useful":0,"cool":0},"RR9NRJnjYtY4q0u0hUhumw":{"text":"Their aged rib eye was literally to die for. My husband got a $20 glass of bordeaux to go ","useful":0,"cool":0},"DnE3GTkf_rGu9JMm5T_d6Q":{"text":"I can honestly say that I've had the best steak of my life at Emeril's, and I've had a lot","useful":3,"cool":0},"AXzjF5rlMbt61c8xZhW9Tw":{"text":"I visited Emeril's Delmonico for a business dinner with approximately 100+ people that too","useful":0,"cool":0},"jOwckyn76zj8GNWLSc6NfA":{"text":"I have to admit I came here by default because I wanted to go to the other location becaus","useful":0,"cool":0},"csgnHL0PCfEkJvgZYgl2lA":{"text":"Yo Yo Yo:  Grade A with family and Sullivan's and wow what can I say. Awesome! Fish entree","useful":0,"cool":0},"YTyC5HlN6fgcz3fEa9lEug":{"text":"Of course part of the thrill for us tourists was to be able to say \"We ate at Emeril's\"!\nS","useful":0,"cool":0},"EzpTHEzArXQqKdlcAGwEQA":{"text":"Me and my friends agreed that we arguably had the greatest meal of our lives.","useful":0,"cool":0},"ZrGNAsk-xNTD-RG9M1eOyw":{"text":"Wanted to eat dinner somewhere besides the French Quarter.. Lucky for us,  Emirill's Delmo","useful":0,"cool":0},"z1nwGMPJn3XvZxHJFjHKmg":{"text":"We went here for my boyfriend's birthday dinner before we left town. We were asked what we","useful":0,"cool":0},"HypdQVK-DHm-YT0v7Mdcfg":{"text":"We had the absolute best experience here. The food, the ambiance, and most of all, our wai","useful":1,"cool":1},"rd4mvQ4OQ78kYma3TMMJXQ":{"text":"Wow.  \n\nSo now I have to go here every time i'm within reach of New Orleans, and that's ju","useful":0,"cool":0},"t2wsTpiuVfiOj_CIafosNQ":{"text":"The quality of the food is good and the menu is very well thought out and planned. \nThe se","useful":1,"cool":0},"BBxtZsZhk8r1G2zHG-cHXw":{"text":"Definitely a more expensive choice, but I have to say it was worth it and I don't often sa","useful":0,"cool":0},"7oQiDTDUtPooK1kQkaGY4g":{"text":"I was in New Orleans for my bachelor party on August 25th, and being the responsible party","useful":0,"cool":0},"DLQffb5ZHZ1l05-Ovz4u9A":{"text":"The service here is amazing.   Staff is so helpful and attentive.   Right on a parade rout","useful":0,"cool":0},"UrZ8LApClckD-rrgbES9EQ":{"text":"Amazing food! Lives up to the hype! The table side prep of bananas foster was a fun way to","useful":0,"cool":0},"oIsNlYgWZJx-NFH6AhrbXA":{"text":"With so many amazing restaurants in New Orleans, there is no need to bother with Delmonico","useful":0,"cool":0},"NrD-iuY33WS5NnMQYaUEzw":{"text":"Not sure if the food or service was better. The boudin balls appetizer was the best thing ","useful":0,"cool":0},"O7OpXpN4STme617yzRdIjw":{"text":"Always love Delmonico's for perfectly cooked steak, stunning appetizers and desserts, and ","useful":0,"cool":0},"XgbdFrU8sTR-BxBYddIeVg":{"text":"Hands down one of my favorite dining experiences in the city! I only get to eat here about","useful":5,"cool":1},"L3-m0wPzG4REEPaErmeIhg":{"text":"Delicious and classy.  Warm and friendly service from Kevin who really went beyond our exp","useful":0,"cool":0},"XCHpHMyBsbpPN1unFeo5iA":{"text":"This is the best place  I've been to for a gourmet, lighter version of traditional New Orl","useful":0,"cool":0},"XaEbZrPXrFGIuPV2Q-JLOg":{"text":"I came here recently for dinner while on a business trip. I was a bit wary about eating at","useful":4,"cool":0},"IbUnPKeuP9CbjqyAzulZvQ":{"text":"The experience began as soon as we arrived. The valet parking is a huge plus, considering ","useful":0,"cool":0},"OF7WgbD_xWwkxQBAj6P45Q":{"text":"Went to Delmonicos to celebrate our last night in NOLO and made reservations...of course. ","useful":1,"cool":0},"FQpSusJU1UyuLvyn9uT9ww":{"text":"Everything was amazing. The decor and space is incredible. You feel like you're eating in ","useful":0,"cool":0},"zwzY2Ej6RhfdUH7DRJ9isQ":{"text":"Holy crap this place is great! \n\nMy fiancé and I booked ourselves a date her last Friday f","useful":1,"cool":0},"JTDIkIWak-r20bJ9v9aUCg":{"text":"Decent place. I had the Drum. Which was absolutely delicious. The staff were all very nice","useful":0,"cool":0},"St9Ek59P2q6fF8rsWDVhKg":{"text":"Went here on a corporate event. Had amazing serving. Kevin and Zoey were extremely courteo","useful":0,"cool":0},"_cV_yfM1BWzpEWLkx4o-lg":{"text":"Best gumbo ever!  Lovely meal with attentive service. It was a nice break from the hustle ","useful":0,"cool":0},"G80jdgZa-MUlp-z8f5q8qw":{"text":"Delmonico is my favorite Emeril's restaurant in New Orleans, and among my favorite restaur","useful":0,"cool":0},"oT35sU3XO-dOTVCFgMzukQ":{"text":"Absolute Delish! Very delightful service, beautiful food presentations, and worth every pe","useful":0,"cool":0},"VwYsnHRSIW3GM7CxwLiTXQ":{"text":"My wife and I had held off on going out for our 30th anniversary because we knew we would ","useful":1,"cool":0},"J24mO0gt8NYN9YPIAvjtGg":{"text":"Enjoyed a wonderful meal with my wife and 15 yr old son.  All three of our meals were terr","useful":0,"cool":0},"KCTR6xjYbHF55PQq3Ywhbg":{"text":"This place is really interesting-- traditional southern food with an upscale twist. The gu","useful":0,"cool":0},"_TgAafk1JpUj1EFSUeegdA":{"text":"BAM!!!!!!  \n\nWOW WOW WOW!!!!!!\n\nEmeril's did not dissapoint!!!\n\nFirst, why did I pick this","useful":0,"cool":0},"DVSFT9hJhdW8wgnfjQRNUQ":{"text":"My \"gastonomic\" adventures started here in Delmonico 6 years ago, and now that Im in New O","useful":0,"cool":0},"El4kws4B-itQRiZeb5XaHQ":{"text":"I would not rec this restaurant to a friend  it was overpriced for what it was. We had to ","useful":1,"cool":0},"Tr6vv2YSDeqgWWePa0nbAA":{"text":"We went here because a friend recommended it. It was the most underwhelming experience fro","useful":0,"cool":0},"Cj4cSqv_MHR6D-STkAbhIw":{"text":"This was a fabulous dining experience, and because I was with my best friend, it was even ","useful":0,"cool":1},"qJr4HTf8Q07jCf2DrRqiiQ":{"text":"One thing everyone has to acknowledge about this place is the service is simply beyond rep","useful":2,"cool":1},"DpIQ5aQ5PvDToGzJdmRVnQ":{"text":"Great Food. Great Service A must go if you want to have a wonderful Southern experience","useful":0,"cool":0},"jzR0ZHRnOeaJTZLfUknjTA":{"text":"We came from Chicago to celebrate our 31st anniversary and were very disappointed:\n1. They","useful":0,"cool":1},"XMkAd1mDKU9HIfUdjfm-WA":{"text":"Amazing food and service was top notch. Great atmosphere and interesting menu with a varie","useful":0,"cool":0},"KTQNXHQ9LwmhYHjAOJCQmw":{"text":"Ask for Kevin he is a great waiter. Hang in the piano bar. Great food. I've eaten most eve","useful":0,"cool":0},"UufNGcrD0k1FVc7j9XrJmg":{"text":"AMAZING! From the moment we arrived until we left not a detail was missed. The decor is be","useful":0,"cool":0},"6VKn5Dj_0p6DT0MX2VSbIA":{"text":"Ridiculous wine list!\nExcellent service!  Thanks Lloyd!\n\nThis place brings the \"A\" game.  ","useful":0,"cool":0},"HV_84-Ghf2zjQRVmMN7jRQ":{"text":"I'm surprised this place isn't ranked 5 stars.   Unbelievable dinner.   Great wine list, e","useful":0,"cool":0},"c9yMepf1ljoO-cOviP6FTg":{"text":"Excellent food. I started with the gumbo. Delicious! My friends had the BBQ shrimp which w","useful":0,"cool":0},"bYrhv7CHe7wTxTTXKrmmYw":{"text":"I've debated about posting a review and have procratinated for 6 months but since we are p","useful":1,"cool":0},"JidGlzGPkClNM9_9sBy1ag":{"text":"I so wanted this to be a 5-star review.  Wanted everything to be spot on, at a restaurant ","useful":2,"cool":0},"nawNf3MUSXhGBNFG6-xWQQ":{"text":"This is the quintessential modern New Orleans dining experience. If you want to have one p","useful":0,"cool":0},"wH9GAUMNyi_WuNa_smW6Kg":{"text":"Perfect as usual","useful":0,"cool":0},"0txDU4KfXIDrdyEEEbAflg":{"text":"Great experience for our first time visiting New Orleans. The service was absolutely amazi","useful":0,"cool":0},"UGcASfJaLkUrl3HkiGloxw":{"text":"I don't like to review places that I have only been once, but my experience at Delmonico's","useful":5,"cool":1},"Dtx4hkUbJ1t72vnv_oPGpA":{"text":"Exceptional service!  Coat check was very much appreciated.\n\nThe food is stellar, our tabl","useful":0,"cool":0},"olojSS7wXiGVFu8wTgLeGw":{"text":"I've dined at a Delmonico in Las Vegas previously and boy did this one not disappoint. The","useful":0,"cool":0},"pGHqBGh2lWq7fI9Psp0PHg":{"text":"Enjoyed dinner here last night. I was weary that it's a celebrity chef's restaurant. It di","useful":0,"cool":0},"4ZvbjNbXtlEON5oRtpz9gA":{"text":"I'm a fan. If you read my reviews, I'm hard to please and Emerils Delmonico hit it out of ","useful":0,"cool":0},"tFHpKj31YDXA4tVjidi-nA":{"text":"What a treat!  We ate early.  (in fact, we arrived slightly befor opening hours.)  The dec","useful":0,"cool":0},"nALl_7KlKkeQYLSqpYzEUQ":{"text":"I had the opportunity to visit all four of Emeril's restaurants during my stay in NOLA. Th","useful":0,"cool":0},"fv6KvziL98K5QLPhfjMVpA":{"text":"Excellent service and fantastic offerings for every step in the meal. Cheese plate offerin","useful":0,"cool":0},"FQ7vYt_JRqj11khvto71Xg":{"text":"Me and my sisters decided to go to Delmonico because it was right across the street from o","useful":1,"cool":0},"LXSRmGW7Kuw6S9IyL--Daw":{"text":"Great food. The Crispy Pork Cheeks were the best! The oyster stew is also a good choice. M","useful":0,"cool":0},"IgAWraJ1QnB1twHU6pHjlg":{"text":"OK so one of my ex-GF's comes into town and I decided to take her to the restaurant owned ","useful":2,"cool":1},"Bx3wQArYJd9_-iJM34MGEg":{"text":"The best meal I've had in NOLA and a memorable experience. The food was tasty, fresh, and ","useful":0,"cool":0},"9_DyNP1Mgk3_szngYeRunQ":{"text":"The Skinny on Emeril's Delmonico...\n\nIt's a classy joint, with a southern vibe and hospita","useful":3,"cool":1},"tXYuTf4hQj2ROQ0RR0imTA":{"text":"5 stars across the board. Service!  Ambiance! Food !!  Going again when next in NOLA.","useful":0,"cool":0},"MqLNMMrR0iwtsyHQSzxM3g":{"text":"I finally got to eat at Delmonico's and it was for a corporate event so this review contai","useful":1,"cool":0},"bUdNK8B3x6HL48uFgg2b-Q":{"text":"My daughter took us to Mother's Day Brunch, service was 5 Star, food was even better.  The","useful":0,"cool":0},"aUqSebo6F0dwB-aNNldgVg":{"text":"Had an amazing meal. Ordered the glazed pork chop with beans & rice. The glaze was so flav","useful":0,"cool":0},"8bDc2iVRp-E4sDa6tbIHZw":{"text":"This is the best meal I have had in New Orleans. The waitress made recommendations which w","useful":0,"cool":0},"Bn6cWg7NTl4JGo98gyTwEg":{"text":"Like your favorite old baseball coach, pretty sure Emeril would shake his head in disappoi","useful":0,"cool":0},"vud2kYgHzcaXS-n-Tr3drw":{"text":"I had a wonderful dinner here last Saturday night. I attempted to make reservations online","useful":4,"cool":3},"O5OrgTrBxspIB5Sg2WFQog":{"text":"Everything was good.  Service is amazing.  The appetizer platter with all the cure meats i","useful":0,"cool":0},"7TEiodfQyPOp0AFrrZK5Eg":{"text":"This place was simply amazing! From excellent service to amazing food combinations, by far","useful":0,"cool":0},"eL4TJYBBAhytEO3BpQO51Q":{"text":"This restaurant has only name.   The whole experience was very dissapointing.  We went wit","useful":0,"cool":0},"noRXYWALu0RtL5uL8ZWy7A":{"text":"I would've given Emeril's Delmonacio a five star rating but to the nearly hour or more wai","useful":1,"cool":0},"1aiujQXTISr3kNF6LbSHVQ":{"text":"Had dinner there last night with my wife.  We got a few items from the charcuterie (duck p","useful":0,"cool":0},"S-8fyIBBNYMuDpjuEgEKqA":{"text":"This place gets 5 stars because of the service we got! We came on a Friday night and it wa","useful":1,"cool":1},"fnsE_XYuQuEs17f7TTJ1NA":{"text":"Amazing food and even greater customer service!!! We are from out of town and flew in from","useful":0,"cool":0},"nSwQk6C0s2inx4IwnOVA3A":{"text":"They dry age their own meats, not many can compete with that!  Wonderful food, service.  I","useful":0,"cool":0},"OXjnVb_OYUUAsQH29zWrZA":{"text":"Incredible.  I'll definitely go back.  Waiter was great, the place is great, quietly set o","useful":0,"cool":0},"ozKP4XGnRnRtLkkF8O091Q":{"text":"Emeril's Delmonico has the perfect blend of creole and Cajun flare with the finest ingredi","useful":0,"cool":0},"5C8JAMTL3F8lBb2nvpgKPg":{"text":"The Delmonico Rib Eye steak was the best in town. So many great restaurants in town - not ","useful":0,"cool":0},"GecIBwhOI6NPpEhajANZnA":{"text":"The drinks were amazing, esp the lychee martini. The shrimp dish was tad over salted. The ","useful":0,"cool":0},"TLF-c1nZ9tYkhddVIaFy-w":{"text":"The food was spectacular here, but the amazing service even exceeded the ratings of the fo","useful":0,"cool":0},"8ypc2aaSvxNZTQK_AIKnlw":{"text":"My grandmother, mother and sister came to visit and we decided to go to New Orleans for a ","useful":0,"cool":0},"Syj-NjXzFfhnXOw53K6uRw":{"text":"Last minute choice a few days before the Super Bowl. Meal was excellent. Crispy pork cheek","useful":0,"cool":0},"nkAjETrtYQP-Svai2rwnuA":{"text":"The food was wonderful and the service was even better!  We had no less than three servers","useful":0,"cool":0},"dliKSYMA1S_zmhPUatOyDw":{"text":"This restaurant was disappointing and overrated as a tourist must eat. I did not enjoy the","useful":0,"cool":0},"Y_4UO_57b6eOYzuFyWZsKw":{"text":"This place is amazing!  We were all impressed with the food, the service, everything.  The","useful":0,"cool":0},"Np8xcoeohOReFzKSr8rChQ":{"text":"Ate here with my colleagues when I was in town for business. The waitstaff was unbelievabl","useful":0,"cool":1},"Y5rbAjD-_rqUlmf3opwzVA":{"text":"Oh, what a meal!\n\nA long-time friend and I caught up over an amazing four hour dining expe","useful":0,"cool":0},"L0yhIGUMGSJ_IIHzMlTTXA":{"text":"We had a really good dinner at Emeril's Delmonico a couple of years ago.  The food was con","useful":0,"cool":0},"yeTqOhcpZfRskVYW8BBpjg":{"text":"I've only had one meal here. It was for my birthday last week. Get the duck if it is on th","useful":0,"cool":0},"s0_6HIraaUXr5FYCc-vyoQ":{"text":"Excellent all the way around. Spent Valentine's Day dining there and service was the best.","useful":0,"cool":0},"1Vvkwk3ly0InPHsA0Bsybg":{"text":"Emeril's Delmonico is so comfortable and inviting. I sunk into my chair and felt so cozy i","useful":1,"cool":1},"2B9OqbFGzPO6LlcdkyYluQ":{"text":"Everything was perfect! Great food and yummy drinks. The staff was so professional and att","useful":0,"cool":0},"lIWvM0IUTJ6fvXotxersxQ":{"text":"I love this restaurant I ALWAYS go when I'm in New Orleans and it's my favorite restaurant","useful":0,"cool":0},"3kxzq_15lKkRmEqz543UDA":{"text":"I took my teenage daughter, who is a burgeoning foodie, on a Friday night at 8:30. I figur","useful":2,"cool":0},"GkfBoleT6Eu_rDAE1ibzQQ":{"text":"Not crazy about service or food. Place was DEAD for a weekend nite. Sat us in the doorway ","useful":0,"cool":0},"uS8ij6KHNGH6tUfYbHKYPQ":{"text":"This place is fabulous ,great staff,amazing food  the stuff million was to die for taste l","useful":0,"cool":0},"tsyCM5UHufQkMAT25PpjGA":{"text":"First and foremost, the service and hospitality at ED was top notch!  Even if the food was","useful":0,"cool":0},"85o9N_uVDqXVlPfhkDIQ6w":{"text":"First time here & we loved the beautiful decor & food!  David our server was the best!  We","useful":0,"cool":0},"PP2sTh6hXOf2v7FLd9E14Q":{"text":"Started with the oyster Bienville and gnocchi. I would not order the gnocchi again -it lac","useful":0,"cool":0},"xqtYczvevAw2mxzghDHKsg":{"text":"It was truly a pleasure to eat at Delmonico. The best kitchen in New Orleans.","useful":0,"cool":0},"lxmwGdR23PWlCbah8oND7A":{"text":"wanted to love this experience and traveled to NOLA from Chicago partially for it.  for wh","useful":0,"cool":0},"5HxWbXXhjYDju5USg4dIGw":{"text":"This was one of the best dining experiences I've ever had.  I haven't yet found a place to","useful":3,"cool":3},"QOuFh-g_mdL0ofX4qtuHnQ":{"text":"We brought my grandmother to Delmonico while she was visiting. While I do not eat any meat","useful":6,"cool":2},"OpXhbXzpfBPh09ZFL54EQg":{"text":"Emeril's Delmonico restaurant is truly a dining experience.  The food would be the obvious","useful":0,"cool":0},"P8LfO0vvuq_EoSLFeUfXzw":{"text":"After reading about their summertime happy hour, we had to go!  Specialty cocktails as wel","useful":1,"cool":1},"0m-hTcFscLvO-1YIGPzj2g":{"text":"A very nice dinner.\nExcellent service.  I was happy with both recommendations from my wait","useful":0,"cool":0},"CbDlSzjVMpmcINrHG5bnxA":{"text":"PROS: Food (baked oysters, delmonico lomo, rib eye, swordfish, corn bread, potatoes, and k","useful":2,"cool":1},"N8RM1NczLDra6wl-eFmmPw":{"text":"Where most restaurants fail on holiday service they got it right! Went with a group of 8 f","useful":0,"cool":0},"qNcuFV2f_fo0BOJuAptruQ":{"text":"I have had many steaks in my life. I didn't know a steak could taste this good. Ribeye is ","useful":0,"cool":0},"_wIqEgwKKj1MwzxCjm4hzA":{"text":"Visited on a Sunday night with a large group. Excellent friendly and pleasant service. Gre","useful":0,"cool":0},"iJH7hMtowFgeNIeO9o04wA":{"text":"Delmonico's offers the flavorful satisfaction that I have come to expect from Emeril. Each","useful":0,"cool":0},"HgnvHnDCqjDXx9lEGjO5fg":{"text":"Disappointing. We had such a good experience at Emeril's that we spent our last night for ","useful":0,"cool":0},"X9f7UXKA8l_sHCHmRL9uOw":{"text":"I'll start off by saying the food is amazing. However I'll also say you can find similarly","useful":0,"cool":0},"Tlf2FFDRtPQruPufK7QI0Q":{"text":"It's a very nice restaurant. A lot of servers with attention to details wait for one table","useful":0,"cool":0},"CE_HgiEzWCi0tyyIhSF--g":{"text":"Legit. \nPrice may reflect $$$ but the service, decor, and attitude is 5 star. \nVery attent","useful":0,"cool":0},"1ENcPS_y_RTiBf6FnzAMsQ":{"text":"I had to plan a private dinner for my boss and we were all from LA. The staff and managers","useful":2,"cool":2},"T7_LVUyTNk5Vwy_1T7i9Tg":{"text":"Such a great experience. The service was spot on and the food was delicious. We went for M","useful":0,"cool":0},"gpGmuXmU3pXzwL9ZijOQeQ":{"text":"Exceptional service, classy atmosphere away from the tourist hustle and really good food. ","useful":0,"cool":0},"8vJq-VCbqHMjQsfHcsID6A":{"text":"This was the worst experience I've ever had at a restaurant. After ordering two nice bottl","useful":0,"cool":0},"XnQZxvkmS6D8hnD3TRBGAQ":{"text":"So good!  The service was outstanding. I had the chicken gumbo, the flavors were perfect. ","useful":0,"cool":0},"Ua1dowotqA4jUY91Z2EIHQ":{"text":"Classy classy classy. Great service. Great food all around. Loved the cheese board. Get th","useful":0,"cool":0},"jyiFRP7xB9_Qmp7aMSuc4A":{"text":"Wow, one of the best steak places in New Orleans. All food taste delicious and very tasty.","useful":0,"cool":0},"eqT1pEy8N9kcRH3tWXI_vg":{"text":"To be commended for their amazing servers! Hubby and I came under-dressed and still receiv","useful":0,"cool":0},"6i13yPtLQQyCW3v0WbraLg":{"text":"Go during happy hour 5-7pm on the weekdays.  Complimentary valet parking.  \nI went around ","useful":3,"cool":1},"I2akcUqRNW6VkM1NWvndgQ":{"text":"I had dinner as part of a business event. We sat in the private dining room past the kitch","useful":0,"cool":0},"wXlXTNvUwHV2d0eg58iTRQ":{"text":"You would think that I would give this place 5 stars, but I can't.\n\nThe service is astound","useful":0,"cool":0},"AVDV8WLC1k6PIheMlz6PLA":{"text":"Great service. Multiple wait staff making sure we had all we needed. Francisco was amazing","useful":2,"cool":1},"8RXJeINPoT5sC1hHASsuIw":{"text":"We came to NOLA for our wedding anniversary and this place is the best pick that my hubby ","useful":0,"cool":0},"HUNozrqQm9vkkGEp7Z6qYA":{"text":"I got engaged here October .. Yes a little pricey but well worth it the food was fantastic","useful":0,"cool":0},"NArvmTtN_6pZ2REwf27fyA":{"text":"Great cocktails and small plate offerings at Happy Hour.  Reasonable prices and valet park","useful":0,"cool":0},"yDL_xwVPAlrUY_zlPF_WXQ":{"text":"Dined tonight with a group of about 16 coworkers. Service and food were both fantastic! I ","useful":0,"cool":0},"27fVjFlV-zyDdekmd-O08w":{"text":"I have eaten here a few times. The vegetarian options consist of pasta and some steamed ve","useful":0,"cool":0},"tuA9iUpIO54d6IJ3KxvN2Q":{"text":"Oh how lovely! My husband's friend came to town and wanted to treat us to a special dinner","useful":2,"cool":1},"Cxjw0oJdYlPphmH68lNhMw":{"text":"Love the atmosphere & lay out of this place very classy yet fun. The drinks were good my f","useful":0,"cool":0},"EPadXUhk74inZF62SZnjtA":{"text":"Emeril's Delmonico steakhouse has a great decor and ambiance to it. Wine list is extensive","useful":0,"cool":0},"Gw0I4-GMWAehNoXZjf9oGg":{"text":"One of the best meals I've ever eaten.  The restaurant was beautiful.   The staff was extr","useful":0,"cool":0},"LC9XbnFsIUNVg39uUZRWRw":{"text":"In a sexy open booth (fit for the fabulous), I devoured the best salmon dish I have ever e","useful":1,"cool":0},"V7-25_H7apSzhAhd8roI0A":{"text":"Happy Hour Changes for 2016: doubled the price of the oysters-now $1 each. No more complim","useful":0,"cool":0},"BRhn2GbZJFZppz4aP2aAYA":{"text":"I never understood an \"excellent dining experience\" until dining at Emeril's Delmonico. Da","useful":0,"cool":0},"TL4MdkzF8TSaZ9POZ5M7aQ":{"text":"What an experience! I was very fu-fuish..and quite pricey. I've never seen dishes come out","useful":0,"cool":0},"cl5dXuHNIZ1P87dXbK9gGw":{"text":"Excellent night, excellent food! Ask for Vern and Marcus- the Dream Team- were awesome. We","useful":0,"cool":0},"sBMFWxVKN0YlvJgpmxVE2w":{"text":"Excellent food, great wait staff but very weak, yet tasty drinks (cocktails). Will definit","useful":0,"cool":0},"BIkWAfk9I5cKB-986_vHEQ":{"text":"O-M-G! This was a 10 dining experience from beginning to end! Our waiter was fabulous and ","useful":0,"cool":0},"9XlpbGPQHYCOUlU_eQuUHg":{"text":"Delmonico had everything you would hope to get at a restaurant in the high-end category: G","useful":0,"cool":0},"7cWeKQs-OWMZSHGgJOn4zw":{"text":"This was undoubtedly the single biggest disappointment that I've experienced with New Orle","useful":0,"cool":1},"5BiDKXrdI1zKyn1BpwXFrA":{"text":"Over all I enjoyed our dining experience. However, for the prices, I expect that the torch","useful":0,"cool":0},"PcKOxYEuXqN7-GaM5_OcFg":{"text":"Got the barbecue shrimp app, some dip app, cornbread, petite filet, and chocolate mint mou","useful":0,"cool":0},"8wAZeCIg_CtXOHO3vDDV5Q":{"text":"So for those reading this I can only hope it helps save you a lot of disappointment.  The ","useful":2,"cool":0},"NF6hG50SUOnt8LIxt6mn_Q":{"text":"One of our friends wanted to dine at one of Emeril's restaurants - we ended up with this o","useful":2,"cool":1},"zisukqaKxlAGQTQRt_WP3A":{"text":"At a restaurant like Delmonico's, with Emeril Lagasse's imprimatur, you expect the food to","useful":0,"cool":0},"oW1EObbNtydjZAO4AAm2kw":{"text":"We had a very nice dinner here. First of all we went to our table via the kitchen which wa","useful":0,"cool":0},"8YTqyXKMP2WJ8AOR_Uf_DQ":{"text":"Beautiful place! They have free valet parking ( make sure to tip them well) We were welcom","useful":0,"cool":0},"STagXHfi6OyFIq2R6VLXqQ":{"text":"I was underwhelmed by the food. \n\nThe Caesar salads we started with were tiny and tasteles","useful":0,"cool":0},"JOkbU6LwqOygJlTmFHRjPA":{"text":"The service was exquisite. They made a wonderful wine recommendation that will stay with m","useful":0,"cool":0},"tkvVsaJ3COmG0-UCA4E-qg":{"text":"Today there is a summer taste activity which is 45$=four course meal, which is really a gr","useful":0,"cool":0},"vqefpY-96Rg9urKPwLX7LA":{"text":"This place is expensive and not worth the prices! If you read any of my other reviews I do","useful":0,"cool":0},"cUi9A49Q9LSLIYJac1nnnw":{"text":"We were with a huge party (15 people) and they were so accommodating with our time constra","useful":1,"cool":0},"XM0cuKpkcgXNkNgpVCVZKA":{"text":"Wonderful experience. We ate here for a special birthday dinner, and from start to finish ","useful":0,"cool":0},"ROn9X4KHaviNuW3Z7Ia14g":{"text":"We dined on a Friday evening. The atmosphere was very pleasant with a pianist playing at j","useful":1,"cool":0},"demvWRIJxKyCdY2r6IVaqQ":{"text":"I really enjoyed the whole experience.  Dining room through the kitchen was neat.  Staff w","useful":0,"cool":0},"t3RpIVIA-x0KW7V74x5vUg":{"text":"I'm struggling to give this place any more than one star but I had been before and it was ","useful":0,"cool":0},"iLAolkvCa4qmUzgMGo0uUw":{"text":"We have been twice. Both times were amazing. This is a staff that is well trained and take","useful":1,"cool":0},"TLCRBsLdTXOqRltOOy0TYw":{"text":"Went for happy hour - 99 cent charbroiled oysters and small plates. Plus drinks half price","useful":0,"cool":0},"s1086IzAlOtn8mrWZ5s2nw":{"text":"Great ambience, food didn't quite live up to our expectations. We were a group of six ladi","useful":0,"cool":0},"90RC-VkwTvm_KF-l3wcFpA":{"text":"Very nice setting.  Cajun dishes were a big hit with our party of 14.  Steaks tended to be","useful":0,"cool":0},"9Jxv6b2-SLor1aKmLKV2kw":{"text":"My absolute favorite restaurant is Delmonicos in Las Vegas.  So of course when I visited N","useful":0,"cool":0},"Q3IH9Wsk5yN7uV0yldyE_Q":{"text":"This place was great. I had the new york strip and a side of baked mac and cheese.  Both o","useful":0,"cool":0},"KYrWO6z4AaVlQKQa6iYgaQ":{"text":"My boyfriend's family took us to celebrate my boyfriend's birthday when I was visiting New","useful":0,"cool":0},"T_cSA9HGYbJvNM9-8SgWDA":{"text":"We had a group of 20 and got seated at two tables of ten - we had reservations.  We had se","useful":1,"cool":0},"cW6XcQ5a09s5gq-J6ZolRQ":{"text":"This restaurant was 100% disappointing. I went with 6 other adults on our second trip to N","useful":1,"cool":0},"yumB_qHxTZgM-EXrYibEGQ":{"text":"Lovely atmosphere \nTasty food -although I strongly feel that salmon dish I ordered could h","useful":0,"cool":0},"wNxyteG_Q25ugdI8iCBZjg":{"text":"All in all, okay.  The space, decor and feel were great.  The service, Mary et al, were ex","useful":0,"cool":0},"E6M7YLmVJu1SyJMrhPQ2DQ":{"text":"Delmonico was about on-par with what I expected. The food was good...but not spectacular g","useful":0,"cool":1},"z2iNmSAJ9QL0Yva3LYcPEA":{"text":"AMAZING. Service is out of this world. Food was fantastic. Boudin Balls, Pork Cheek, and L","useful":0,"cool":0},"7jPNhbvwuqFojQJ38tW7dw":{"text":"Always wanted to try one of Emeril's restaurants. Delmonico is not located in the nicest a","useful":0,"cool":0},"4dQI8Rg1m8wBCJI6Z_C4OA":{"text":"AMAZING FOOD and the service was outstanding! I recommend requesting Malcolm's table - he ","useful":0,"cool":0},"9RazVBHFQDkxL7DSDwiddA":{"text":"Just ok.. I had the beet salad which was good. The the snapper dis of day which was under ","useful":0,"cool":0},"12bU9BHL_gL2VXqak3dE8A":{"text":"Me and my fiancé had dinner here one week ago. I specifically went here just for the BBQ s","useful":1,"cool":0},"_z4-Dfh9QR_RpLe3Lbfuvg":{"text":"I would just like to start with as a solo traveler it is always great to be treat well, bu","useful":1,"cool":0},"S4m3Rf3aGX4CYZW4bwn9Pg":{"text":"Went here on a Wednesday night last week and it was magical. I came with three friends and","useful":3,"cool":1},"63_73CNx_BfxWvT9XuMCoA":{"text":"Outstanding. Exactly what I envisioned in and expected from an upscale New Orleans steakho","useful":1,"cool":0},"q0AnVWhKeJAQya4YI7UqyQ":{"text":"Loved everything about Emeril's Delmonico. Our waiter Francisco was so great!! We had one ","useful":0,"cool":0},"zD31ybfBUdgcALgt96MrWg":{"text":"My favorite Emerils restaurant by far, Amazing food, but the service was outstanding have ","useful":0,"cool":0},"6BrH8VT6eh-9fpAGLXK6kg":{"text":"Great food, wonderful atmosphere and exceptional service. Staff was extremely attentive an","useful":0,"cool":0},"kTO21OB9II4LaRfLRd7-AA":{"text":"Food was great, but service was NOT good. My friend and I went out for dinner and have nev","useful":0,"cool":0},"kAei73g8M8vKE1JcnZGPqA":{"text":"Didn't get to eat the food because management was awful.  Was at delmonicos to celebrate w","useful":0,"cool":0},"C16AzG56mDdzhVCsB7cY6g":{"text":"BAM!\n\nThey say if a restaurant seats you at the window, it means they think you're attract","useful":1,"cool":2},"0HYnQqxlV5LIEI13WYY8Hg":{"text":"Everything was fantastic. service was terrific. I would recommend this place to anyone who","useful":0,"cool":0},"wOfQdajLZLgIxFJW_aPbCQ":{"text":"Been to Delmonico's a few times, albeit several years apart...and it was perfection - as u","useful":0,"cool":0},"akha1ObPfGlESU-rjD91OQ":{"text":"Good food and overall good dining experience. I had 7:15 reservations and they wanted to s","useful":0,"cool":0},"DJNEO4bhHJf02EBgPYMZFw":{"text":"We had a great experience here on NYE for dinner.  Small party of 7 people, so we had a bi","useful":0,"cool":0},"xFP6S4ZK8CgijAIjmmmKWw":{"text":"My first visit to one of Emeril's restaurants while in New Orleans and was not disappointe","useful":0,"cool":0},"p9gxG2y7sVM8Al1CaTSL9w":{"text":"One of the best dining experiences I've had in a really, really long time! The food was ab","useful":0,"cool":0},"dgzUatc4A8wBnoEfr5kTjg":{"text":"1st off great service!!!!!  emeril transform a old victorian house into one of the best st","useful":0,"cool":0},"-_UJfLCNQluLnZP3sE5D9w":{"text":"My wife and I spent a week in New Orleans, and this was the first stop as we ate our way t","useful":0,"cool":0},"HOae1pGbAGfqMMycz3nhwg":{"text":"My Husband and I wanted to try something new, so we decided to try this place. \nI had the ","useful":0,"cool":0},"NRMkKh5XSncmnwpdsAsl-w":{"text":"What a disappointment. Food was less than good ~ cold and very small portions. Can order s","useful":1,"cool":0},"YMacbjknaUXewtx94Eyn_w":{"text":"We enjoyed the entire dining experience. The atmosphere, food and service were superb.  Wo","useful":0,"cool":0},"hG-bJCzUQRixVxTdnLK0xg":{"text":"Hands-down the BEST food, service, and experience I have ever had in my life.  I've dined ","useful":1,"cool":1},"1KeOzgFwhoe54uajRFFFCw":{"text":"The food was excellent but the service was immature.  Their attempt at being personable ca","useful":0,"cool":0},"NGz4V175u-2Jo3Mbcda64Q":{"text":"What a beautiful restaurant. We were seated on the 2nd floor near the wine celler. Service","useful":0,"cool":0},"BHul9hCQZgXg8j0iA4V_qA":{"text":"I had one of the best steaks of my life here and I enjoy going to the best steakhouses in ","useful":1,"cool":1},"zKcOEBg6cvTLKxhwPiQiIg":{"text":"Emeril's Demonico is a revelation.  From the service to decor, from the food to the wine l","useful":5,"cool":1},"Z3yLJ6z50OYp_GRzx2XWnA":{"text":"The meal was good but nothing great.  I would write more but nothing stood out other than ","useful":0,"cool":0},"WXD1M2EKjLE9XaL7glzqoA":{"text":"Worst experience. Food was ok but service was horrible. Manage was rude and unapologetic a","useful":0,"cool":0},"D8cZbbpeiyG63cbRqoyETQ":{"text":"As part of our Christmas trip to NOLA, my mom and I had reservations for some \"BAM\" in our","useful":1,"cool":1},"GYHBjVjbweIKLw3VN-Vx8Q":{"text":"Every time I'm in New Orleans or in Baton Rouge I must make a stop into Emeril Delmonico. ","useful":0,"cool":0},"p7sq396i1gOB8vUx3S5GIw":{"text":"-Amuse-bouche; Vietnamese Inspired Drum w/ cucumber chip & cilantro\n-Amuse-bouche; Eggplan","useful":3,"cool":2},"ovF6W5oojK-q8Hr-mLCv0g":{"text":"Maybe I should have just gone for the happy hour, but I wanted a really good dinner near m","useful":0,"cool":0},"Kphb_lSSi3rRO0F_ihmwzQ":{"text":"We dined here on the Saturday night of Mardi Gras weekend.  After standing out in the cold","useful":0,"cool":0},"eaX91y0qM51qjcDujGBeqQ":{"text":"Stellar service, friendly and knowledgeable staff, off the beaten path location and food t","useful":0,"cool":0},"n5PHb04NNg7IFQAVHqBRww":{"text":"After having our fill of fried food, we tried Emeril's Delmonico for a nice dinner out. Af","useful":1,"cool":0},"OUZBhHaqBcZy7-HJ2awRcw":{"text":"Came to New Orleans 6 years ago.  Was treated out to Emeril's Delmonico..........and to th","useful":1,"cool":1},"nRgoO4BE_3L0_D6clz0asg":{"text":"A very memorable disappointment. Although the menu was enticing with emphasis on iconic Lo","useful":1,"cool":0},"mOd6gSvt0KD0U7kQHsAYzA":{"text":"Did not eat in the restaurant, but had a bite at the FQF. Tried the pork cheek and dirty r","useful":0,"cool":0},"J7CImO4H5BeOPy07wjBBrQ":{"text":"I just hosted a private dinner here and the service was fantastic. The food is to die for ","useful":2,"cool":0},"_emQtX71kOpjnm9TqHTLMA":{"text":"I ate here 17 years ago; it was amazing then, and it was amazing now. The fish was fresh, ","useful":1,"cool":1},"YzV-_YXGqSRw1OTVxwuFhg":{"text":"When I didn't think Cajun cuisine could get any better, I dined at Emeril's and had a grea","useful":0,"cool":0},"2EzP8xnZBD0lGOGHUy6Fag":{"text":"Amazingly great. The food was as good as I expected it to be. The service is what set it a","useful":0,"cool":1},"ueR1gPMHhfuw2Do3BnlM8Q":{"text":"The worst experience I have ever had at a restaurant.  We were asked to leave for having a","useful":0,"cool":0},"EZ3xe5ecInmqw7pnMf70sQ":{"text":"We we went to Delmonico a few days ago for my Bf's birthday.  The hostesses told him happy","useful":0,"cool":0},"jN8_lcEnW5_wlKbJ5OYJDQ":{"text":"Wow. Yum. We went for the summer tasting which is a 4 course meal with the wine pairing. E","useful":0,"cool":0},"00qERAxr0YkOuXmtKl0VzQ":{"text":"Wow! Yumm! I wanted to try an Emiril restaurant while in New Orleans. So glad we did. I go","useful":0,"cool":0},"uOdZgy8rmskgTPSahf0v-w":{"text":"My wife and I return to Emeril's Delmonico each year for our anniversary, since this is th","useful":0,"cool":1},"6hGozy84tsnLD-TpQ6Kghw":{"text":"Good and service was excellent !!! Enjoy your dinner and definitely will be back next visi","useful":0,"cool":0},"mZ_IE9kyY--exaUiPKhiig":{"text":"This restaurant was fantastic. The food was phenomenal, service exceptional. It is pricey ","useful":0,"cool":0},"6ATxmVZlDU8TlSYesybFSg":{"text":"After long anticipation, we finally arrived at Delmonico. Have been looking forward to thi","useful":0,"cool":0},"Kz-5mHqnuxwK-4jzWwzYsQ":{"text":"We like to think of ourselves as experienced, yet patient dining patrons.  The experience ","useful":0,"cool":0},"3Bzq24UHTd7pR9YcngoXEg":{"text":"This was one of the most awesome dining experiences I've had.    \n\nThe team waiter setup i","useful":2,"cool":0},"So70NJ7YjeDtp8N69qRMLw":{"text":"Eh....stopped in here for dinner while in town for business. (Yes I was by myself - gasp!!","useful":0,"cool":0},"3oa2LfQM_wQkzGJCga1iyQ":{"text":"Stopped in for dinner while in town on business. 6 of us and no one was disappointed. Outs","useful":0,"cool":0},"8ZDSbR7ZIlvn8wQ1oaxagQ":{"text":"I went to wat here a great many times, and every single occasion and every single thing we","useful":4,"cool":2},"e05HkLpPuEu8_WE5pJ9fHA":{"text":"I have a large amount  of respect for Emeril Lagasse based on his successful television sh","useful":5,"cool":0},"iI5undncsMc0JbylPfQn7Q":{"text":"I watched Emeril on The Food Network for years as a kid and so to finally go to his restau","useful":1,"cool":0},"yfHwolHSVlcPs-PN8ZlobQ":{"text":"For the price and the name, I'd expect far better.\n\nThe menu was disappointingly limited a","useful":0,"cool":0},"uxfQBrQR9OijBuc8fQM-IQ":{"text":"Went there with a group just for late night deserts. 3 couples each ordered the banana fos","useful":2,"cool":0},"hF2dux2Zy6SiUmzKDTSTRg":{"text":"There is a lot to like about the place, but the food is not one of them.  They have no ide","useful":0,"cool":0},"YlHbitT18EqlAsuvFGn1-A":{"text":"Emeril's Delmonico is housed in lovely old home .\nThe bar is very small but the wait staff","useful":0,"cool":0},"2cbQBmIX5M8vfhMdll0fCg":{"text":"The service and the food was great. The service was actually amazing and the restaurant is","useful":0,"cool":0},"FTslcmrlUvOtoQDXNLe8HA":{"text":"My aunt treated us here a few years back and it was really good.  Everyone thought their m","useful":0,"cool":0},"paF6bFObWapLnxZ-4Q1B2A":{"text":"Bam! This place is out of this world. I have never had a better dinning experience in my l","useful":3,"cool":1},"PfANYIMNGf64OuuuVSqPXg":{"text":"wasn't that impressed.   the cocktail of the day was made wrong and had to be remade.  the","useful":0,"cool":0},"bPJuTBWLYmh5ugYLMad3iQ":{"text":"If you are ever in New Orleans eating here is a must. I had one of the best Steaks I have ","useful":0,"cool":0},"3DZfRfin19RkxwBt4r3h4A":{"text":"We were hesitant thinking this may be very commercial since it is Emerils. We were very pl","useful":0,"cool":0},"kH7G0ePGgo5pYLmReannEQ":{"text":"This restaurant came highly recommended to us as this is our first time in New Orleans. It","useful":0,"cool":0},"GSKJErOubdxEMBuoUYNBgQ":{"text":"We knew we wanted somewhere special for our first night in New Orleans which was also our ","useful":1,"cool":0},"qAtwZg3ykULg4I-MQp-2sA":{"text":"Where's the Bam??  \n\nMy family and I braved the traffic on St. Charles during the Bacchus ","useful":2,"cool":1},"2biBrcwmc-22YgwmQQnUzA":{"text":"Had a great time at our Corporate End of Year Christmas Party and this place for the bill.","useful":12,"cool":10},"fWKUbQff-RkoVnAOR5UKhg":{"text":"I've been to some of the best restaurants New Orleans has to offer. Emeril's Delmonico is ","useful":0,"cool":0},"ei4O-lj-xY1Wegnzb853LA":{"text":"First I will say that the service was EXCELLENT. Our headwaiter, Keith, was friendly and a","useful":0,"cool":0},"OV6c0ex03fNUwzBtyMoZgw":{"text":"Limoncello to die for.... house made. Starting with that even though I ended my meal with ","useful":0,"cool":0},"CJJrMD-v0uIEnhc5Q7pYxg":{"text":"My boyfriend and I were completely satisfied with our dinner at Emeril's Delmonico. I orde","useful":0,"cool":0},"FNJPZKXgYIFWM5T-85d99g":{"text":"One of the best dining experiences I've had in a long time.  The pork cheek appetizer and ","useful":0,"cool":0},"nyiynhEIXpADsffb4d9mhA":{"text":"This restaurant surpassed all of our expectations!.  There were 8 of us and we are from NY","useful":0,"cool":0},"tpKzt2PqezEmIG9TEXexJg":{"text":"Was very happy at first drinks were good but expensive, the appitzers were ok oysters were","useful":0,"cool":0},"lG7rJ77fLgvdW7K-HUhS5g":{"text":"This restaurant certainly doesn't need another review touting its excellence. The food, se","useful":0,"cool":0},"FT2Epi0kO9HpZFyO3mVKxg":{"text":"Complete dining experience. Free valet parking. Very nice background live piano. Attentive","useful":0,"cool":0},"D51sdmFO_xsvt60Mm9RNBw":{"text":"Excellent service and food. We were seated in a back room near the exit door - not ideal.","useful":0,"cool":0},"GHYm4B891KQLH_XgfGv47Q":{"text":"Just thinking about this place makes me wish I had Gumbo and Caymus by the glass.","useful":0,"cool":0},"VUkBHvc4rCH1pF9nt87itg":{"text":"A perfect birthday dinner. \nFrancesco, Shannon and Katie were very attentive and expertly ","useful":0,"cool":0},"iBi5QXcXDPBUwOl5tTxbFA":{"text":"One of the best dining experiences of my life! Our server was outstanding - I think his na","useful":1,"cool":1},"DXtfVWklE34V6YUhS4v4Jw":{"text":"I wish I could give 6 stars!  We've had some pretty great meals in NOLA, but this meal was","useful":0,"cool":0},"D3uI71D-E01lDK6ujjIAkA":{"text":"I wish I could leave a negative star.  This is a review strictly on service since we never","useful":0,"cool":0},"DGemnaAzS_TVbWLWLEQZRA":{"text":"Ok, so there are 139 reviews before me. What can I tell you that someone else hasn't alrea","useful":5,"cool":2},"5929gngnOwBPvjCQ0EKkbw":{"text":"This Is one of my favorite Restaurants on the planet! Where should I start the food is the","useful":0,"cool":0},"rGNNl5lRWUzSTwl6R5DtUg":{"text":"This was a great steak house. We started our night in the bar with happy hour drinks and s","useful":0,"cool":0},"X0EcUbEFwq64YahWgJ_BPw":{"text":"Our second visit to Delmonicos was not as great as our first.\n\nOur server, Lloyd, didn't s","useful":1,"cool":1},"Cm20HhyPQeb3CCXcXJpYWA":{"text":"Far from a chain and treated right. I was initially apprehensive about going here, thinkin","useful":0,"cool":0},"vic7TmO2JZa84qPyU7IMtw":{"text":"I was here recently for a company Christmas dinner.  First off, the food was delicious!  N","useful":5,"cool":3},"-8rdMsnuAkDZZT330o9QpA":{"text":"Located in the Garden district the place transformed from a big home to a fine dining esta","useful":0,"cool":1},"wWQoYipo3TNFy1n6ZZLOIg":{"text":"Odd location across from a Popeye's but you forget about all of that when you walk in here","useful":0,"cool":0},"Xjt2p8lvTeGwFNojxy4K_w":{"text":"I couldn't wait to go to Emeril's Delmonico and was fortunate to visit this establishment ","useful":1,"cool":1},"ho9yK2Gu-ZZT-gwAi4JIAg":{"text":"6/18/2011- Very warm and comfortable decor. Love the piano bar and bartender Dave. Nice ro","useful":1,"cool":0},"4DQKFKgLpXPgEVcq6kbSLA":{"text":"Wonderful food, outstanding service and they were very nice when my 6 year old knocked her","useful":0,"cool":0},"BF_J1y0GGS5N2tg7-oPfag":{"text":"Delicious! Awesome service as well! Didn't have to worry about anything and the staff trie","useful":0,"cool":0},"XYKvbwRcrd8uJtoh528jiQ":{"text":"Hubby ordered the Gumbo and I had the Turtle soup.  He was very pleased with the Gumbo.  I","useful":0,"cool":0},"i1h68bc4KZaBTyfwhnJZfg":{"text":"You would expect that the food at one of Emeril's restaurants to be the best of the best. ","useful":0,"cool":0},"5kGoBJEyroUkuK5I3bFyXg":{"text":"The food and atmosphere was great! The pianist by the bar was also very pleasant. We were ","useful":0,"cool":0},"ZIvUDLTWw70uSXCWLQGg5Q":{"text":"Hopped in for a happy hour cocktail - missed happy hour as we got into town late.  We were","useful":0,"cool":0},"c6oF19_waLMyh3Ws17QkzQ":{"text":"We came here on a recommendation from a friend. Our waiter, Malcolm, gave us some fabulous","useful":0,"cool":0},"u8BYTb9c7QgrfHs3MNAh1A":{"text":"We were able to get a reservation within couple hours notice.  When we arrived, we were se","useful":0,"cool":0},"2gEHn3XyAnDVxnGlpZee5A":{"text":"I wanted to love this place but cannot justify giving a great review because they cannot s","useful":0,"cool":0},"GRNpndcsT1PQ7O7Lem29-g":{"text":"3.5 stars, Yelp needs a more accurate system. So back to delmonico.\n\nThe service was maybe","useful":0,"cool":0},"vOfreqMsrI5oL0_WTXmKzQ":{"text":"We were all very disappointed, the worst meal I have had in my five visits here to see my ","useful":2,"cool":0},"uX2Mp03emic57Z5ABoHYUA":{"text":"There isn't much I can say that wasn't in the 400 other reviews, however important observa","useful":4,"cool":1},"YSoxOy3A-qsMa6mX9Rtinw":{"text":"First trip to NOLA and heard about Emeril's and decided on Delmonico's.  Was not disappoin","useful":0,"cool":0},"kYqb7wIVnkgv7EQnJrcBLA":{"text":"This place definitely deserves 5 stars.  The food, drinks, service, and level of comfort c","useful":0,"cool":0},"2czvyP1jkO6AABuNmQTCNA":{"text":"Was in town for a conference and decided to have dinner here and couldn't be more pleased ","useful":1,"cool":0},"327DTorOndd-zRCnRmWfnw":{"text":"My girlfriend and I came here on a Saturday night, and left very impressed. The restaurant","useful":1,"cool":0},"dgIWF7Ga4n0NfY1YbDfReg":{"text":"This restaurant is the place you want to go to for special occasion in Nola. It's definite","useful":1,"cool":0},"wm498THpCDtdwuuIwWJG4g":{"text":"Best happy hour in town..hands down. They even have happy hour on the weekends! They have ","useful":0,"cool":0},"J1yfYSf8x8wHGBxrscqMwA":{"text":"Bad experience on seating and management of dissatisfaction in customer made my time meant","useful":0,"cool":0},"2cXGCAoBb7z9aD3Ur8FCXQ":{"text":"Had impeccable service at the bar and upstairs during our meal! Food was delicious. Best D","useful":1,"cool":0},"3-vvcrnYh1pOvqznA7TYpQ":{"text":"Excellent service and food. Off the beaten path if you're staying downtown. Impressive dec","useful":0,"cool":0},"8yM-Ni6dXhxK5vmdnurc8w":{"text":"This is my favorite steak in the city, with really creative specials, appetizers and desse","useful":0,"cool":0},"OEbLdzHaC26Qxt_C9JR3UQ":{"text":"I ordered the pork chop with bacon sauce; father ordered the special lamb chops (some kind","useful":0,"cool":0},"eYWvFrTKMqnMo5nfyTmWJg":{"text":"I entertained  clients here on Friday evening. A really great experience and lived up to t","useful":1,"cool":1},"gJXS0JWRjOKescvre_7eTQ":{"text":"I was only in this place for an hour and I can't say enough good things about it! \n\nWe sto","useful":2,"cool":0},"DrbKwzDOFWTNTtzGS8D72g":{"text":"In town for a convention and stopped in on spur of the moment for a nice meal.  Wife and I","useful":0,"cool":0},"cS_VC1fHnK2zSKVnQMOlzw":{"text":"Alright, I was skeptical because the bartender was so wholly awful we almost left the rest","useful":1,"cool":0},"rBItqKDBKE_Ixwtp3zIdZQ":{"text":"We had an amazing time with amazing service and amazing food.  My favorite part was that t","useful":0,"cool":0},"LuUbCwpV9E0bktmk_UmOFA":{"text":"We had a terrible experience at Delmonico. The 2nd star is only for the warm and lovely di","useful":0,"cool":0},"2HT0I82tSyUTRZZhCtyplw":{"text":"Great food! My meal was 5 stars, the moroccan rubbed lamb tenderloin. Service was fantasti","useful":0,"cool":0},"zm3XKvBq1zuA4vtbgTHrpQ":{"text":"Very disappointed. For the big name, fancy restaurant and prices I expected a lot better. ","useful":2,"cool":1},"bTEk207Uka6VkHrDeUhS9A":{"text":"The sort of conservative, old southern money, bowing-waiters restaurant that reminds you w","useful":0,"cool":0},"dHmwFpZCjkP38jMULtPbhQ":{"text":"Gorgeous restaurant with attentive service. The food is nothing to complain about, on the ","useful":0,"cool":0},"tR4l95YRNMX9u9n93IfHJw":{"text":"We were seated on time, but the waiter could've been better. He just left the menus at the","useful":1,"cool":0},"06BoZxK6GvLqxAArvEt78g":{"text":"For Valentine's Day, we usually forgo the perils of exchanging gifts and instead opt for a","useful":4,"cool":2},"0HIN_9ZRJYWMavMkn0BETg":{"text":"Wow, hugely disappointed. Epic fail Emeril! The service was outstanding, the food of so mu","useful":0,"cool":0},"jBaP-UyFSFf6LN9s9UXIiw":{"text":"Today's one of those rare time I's like a 1/2 star option....It wasn't quite 4, but three ","useful":4,"cool":0},"woWwpT-YvEl5NLpJJ8lREg":{"text":"This is one of my favorite restaurants in New Orleans!\n\nMy favorite dishes here:\n* Crabmea","useful":1,"cool":0},"MbJOT3zvbPdUEq58H3SS4w":{"text":"Super rich food.\nWe had the meatballs & sweet potato gnocchi for starters. \nThen we had sh","useful":0,"cool":0},"V4bXwv9-CcCURHg8YN-GTA":{"text":"The place seems like a house that was turned into a restaurant and has a great atmosphere.","useful":11,"cool":9},"fqZ9d6X4-7wbIrRIRCkp_w":{"text":"Our expectations were not that great based on the mixed reviews,  but we figured we should","useful":0,"cool":0},"MQh_zG9DzyFXu31cLgc-uw":{"text":"Gosh, I really wanted to like this place more!  Don't get me wrong, the service is nothing","useful":1,"cool":0},"ae2pwBTjFySdBHsU-cUUzw":{"text":"This place is amazing! We had three very attentive waiters. They were sensitive of my diet","useful":0,"cool":0},"c9ktEC5Ahl-5owh79IpvLQ":{"text":"I love this place. I went here for my birthday and I was treated like a regular. My waiter","useful":1,"cool":1},"YBltDgturecMVEZ7zWjmng":{"text":"I had a wonderful dining experience at this dining establishment.  The wait staff (Kenneth","useful":1,"cool":0},"6jvgd9IBRuwcAoAOVdBQgQ":{"text":"Went here our first night during my best friend's bachelorette wkend. We \"accidentally\" ca","useful":1,"cool":0},"2rEefzY3ZleE3sfLutmsKQ":{"text":"Meh service. I ordered the med-rare filet and it came out way over cooked. Sent it back an","useful":1,"cool":0},"fl-OBhpsAADDnZH5KRmV6Q":{"text":"Went to this restaurant on a Friday night on our first visit to New Orleans.  I had salmon","useful":0,"cool":0},"7YDWmNRsnmSfhQjQueCzQQ":{"text":"Superb food and service. Creative small, medium and large plates. Eclectic combinations. S","useful":0,"cool":0},"vTeTvb8Hz8v9YlnQEAQOVA":{"text":"This was a very special treat for my birthday, and I went in after reading several Yelp! r","useful":5,"cool":3},"HsGA4zgcCJiKrjO3yJG5Wg":{"text":"Treated extremely poorly from the hostess to the waiter! No class!\n\nArrived a few minutes ","useful":0,"cool":0},"8xvQYeBMctNGGJufx0Iwwg":{"text":"Stopped by before closing, enjoyed a quiet drink at the bar and some live piano.  Gorgeous","useful":0,"cool":0},"SYehfm0Jg_xv3D8frKKgZA":{"text":"I came here with my Co workers last year for the Dental Convention 2013. We all went to di","useful":4,"cool":1},"0VLsRpOH8_eW-i4Fx6gvig":{"text":"Visited recently for reveillion dinner. The food was delicious, but I was most impressed w","useful":0,"cool":0},"BOZvJqPZj--ASvg_JaMRww":{"text":"A 5-star experience and meal. This place is FANCY, we showed up in jeans and they didn't s","useful":0,"cool":0},"NymIzyo060sPI-mCN-Prdw":{"text":"First time eating here, and the service was excellent !! Food was great! Waiters and waitr","useful":0,"cool":0},"pCzUDSk8YkOApknseN305Q":{"text":"Order the seafood, pork entrees; avoid the steaks. Really disappointed in getting a bunch ","useful":0,"cool":0},"CB5IugdqfQkJbAYcsb_o2g":{"text":"I came here with a group of about 10, which certainly effected the experience. Luckily one","useful":0,"cool":0},"47JB6RO62YlkLvPlSbxQnw":{"text":"We had originally planned to go to Emeril's (his original restaurant), but could not get a","useful":0,"cool":0},"IWqCs-W1Ak9ZCXjSAH5z5A":{"text":"I was so disappointed by Emeril's Delmonico.  I had gone to Emeril's in Atlanta and was wo","useful":1,"cool":0},"84JDCaTWiKfJ3zx-3iA6DA":{"text":"It's good but overpriced. The servers were very attentive and full of energy. The piano ma","useful":0,"cool":0},"-E5IQqnN6lzI0UmVQ_RkgQ":{"text":"I am so in awe of this restaurant. Cindy and Marco at the bar were awesome. Chef William c","useful":0,"cool":0},"zL300bd_KTBViK8RupwAgg":{"text":"Dining in New Orleans we knew we had to make a pit stop at one of Emeril's establishments ","useful":0,"cool":0},"Tw-jRD-32Xdf3kDQm8vQHg":{"text":"I was hesitant to come here because i was concerned about it being a tourist trap. I could","useful":0,"cool":0},"uyoXhz8OrkZQWU2XNRWTJA":{"text":"Gave Delmonico's another try tonight and had a completely different experience. Both bar a","useful":0,"cool":0},"-M922xIUGSCFbPe3IY2Lnw":{"text":"Am I the only one left that thinks a $400 bill for two people should be accompanied by an ","useful":3,"cool":0},"RJGeDqszUQ7E4pxOCaPORw":{"text":"Emeril's Delmonico is a great restaurant featuring steaks but complemented with traditiona","useful":1,"cool":0},"Ew4FoXrS0QkxIlaK1qyw5w":{"text":"I will start with the good. Service was exceptional. The ambiance was perfect. And the pre","useful":0,"cool":0},"ng9983iP1qNLrofk71R9iw":{"text":"Folks, seriously, if you haven't been to the restaurant in over 2 years, should you be pos","useful":1,"cool":1},"q_-dm_GpJ-ASM0w9NxXh2A":{"text":"I had dinner there the other night! It was excellent! I had THE best waitress ever-Stevie!","useful":0,"cool":0},"VbjQK1b98Oppf68J74yChA":{"text":"An elegant and understated vibe is not the first thing that comes to mind when one thinks ","useful":0,"cool":0},"UbKhfD_vLSw_xVOKGxZ30g":{"text":"Great food and *very* attentive service. The salumi plate was just heavenly. One caveat - ","useful":0,"cool":0},"IHMT8-hvR5C4MF8XkZJITg":{"text":"Best meal of the trip. The wait staff was incredible. They really made sure we had a 5 sta","useful":0,"cool":0},"kYhNNJpasN1QC3c4TFL-fg":{"text":"I feel the same way about this place as I felt about Esca in NYC...the service was top-not","useful":1,"cool":0},"Mk5jcAL1fqUCSLKT6zkG_w":{"text":"I really enjoyed this place. My wife and I were on a little vacation and the hotel we stay","useful":0,"cool":0},"UTaMLDYMnoG57mBjig8zcQ":{"text":"Emeril is the person who turned me into a foodie 20 years ago when I visited his first pla","useful":0,"cool":0},"4DJZ5FMAppmVCkZru7yIIQ":{"text":"One of the best, if not the best steaks i've ever had. I had the dry aged ribeye which com","useful":0,"cool":0},"Y8RbyfpTkVy2zzwStS3qdQ":{"text":"Horrible \nThere for a Hornet's dinner with Coach Bauer and the food was so unimpressive\n\nT","useful":1,"cool":1},"-vP3_j9Cnd8VPh87pMMTvw":{"text":"New Orleans' very own Emeril has always been a master in front of the TV, but in terms of ","useful":0,"cool":0},"T8TelnOjenIc8E1txwpziw":{"text":"As we walked in, my boyfriend and I first noticed the gorgeous decor and intimate atmosphe","useful":1,"cool":0},"Hg9SZMg3s87ERmTgg8nPjg":{"text":"Way overpriced and snooty. I walked in the door at 4:32 pm on Saturday and was told to lea","useful":3,"cool":0},"M4N9SZaJY3wjG3pKDbKPdg":{"text":"This is our favorite place to eat at in New Orleans. We travel to New Orleans 2-3 times a ","useful":0,"cool":0},"Y0kVE3YZc9swlRIlcEORxg":{"text":"Great service, great ambiance, food extremely mediocre. They are supposedly known for stea","useful":1,"cool":0},"Zq5dH3R_DPK7JHj5tPmSPQ":{"text":"Definitely one of the best restaurants in the city. The dry aged bone in ribeye is beyond ","useful":0,"cool":0},"bmyS6CoSIMlZRWyiqF6GlQ":{"text":"Without a doubt, the single worst experience of my trip to New Orleans. We had a large par","useful":0,"cool":0},"wRxce3f-3Na3woghDxtCfA":{"text":"I would have given Delmonico's a 5 star rating if it wasn't for the service.  The food is ","useful":0,"cool":0},"w-0dnqH-u9tUCn_UGySzVQ":{"text":"You'll always get a great meal at Delmonico and the atmosphere is cozy and upscale. Steaks","useful":0,"cool":1},"S-cExOSu8JLjvb2OpkWuag":{"text":"What a disappointment. Poorly executed attempt at fine dining. My sisters and I dined here","useful":0,"cool":0},"mrwl4cq2anFyD8M9rQuUGQ":{"text":"Loved this place , waiter knew exactly what to recommend since we were so undecided.  The ","useful":0,"cool":0},"ZWu_NpyWZCIJSAQ6KbOqHQ":{"text":"We went here for lunch last week. \nWe ate our way through 4 days in NOLA.\nThis place was b","useful":0,"cool":0},"H8NiXxvtI0Q5BzYo1abigA":{"text":"You have an idea when you're about eat at an Emeril location; expectation that the quality","useful":1,"cool":0},"mPpY26wtsYk5ueA71P7RlA":{"text":"After posting a negative review of a dinner I hosted for 12 last month at this restaurant,","useful":1,"cool":0},"GRrbyjp-ppKh6kaRAYUEUQ":{"text":"Emeril always does it right.  This place was no different. Not my favorite of his but cert","useful":0,"cool":0},"lHOeI31NhGYl4So-dGpPsg":{"text":"Where to start..... First we were able to get a table with only an hour's notice.  The ser","useful":0,"cool":0},"vkP8DdL41pvAy7nz-NX3nw":{"text":"I DON'T CARE.  Stop telling me that Emeril's restaurants are lousy because he is a celebri","useful":2,"cool":0},"t5-VDULmzR7G5EkmLS4PWw":{"text":"Awesome!  Don't walk, RUN there!  So delicious!  Oh and the service is just ad phenomenal!","useful":0,"cool":0},"C2w9sj5lUHE2AiRMyuvE7g":{"text":"All I can say is, this place literally treats you like kings and queens.  I only ate here ","useful":0,"cool":0},"osu_7tlrO3gOQywCw3Nx_g":{"text":"Bad.  We had a our second anniversary there.  Had our first, as well.  Charged us for our ","useful":1,"cool":0},"T6GWPzaqq9IM1YDmGNDDdg":{"text":"Just great. From the warm hospitable welcome, to the proper table service, to food flavor ","useful":0,"cool":0},"_wLTsGx7ebjSYJXtJ1XABQ":{"text":"Came with a group of four and sat at the bar so we could watch the hockey. Went Tapas styl","useful":0,"cool":0},"IIlxhLHsFDnKEijW2NTGSA":{"text":"A THOUSAND TIMES YUM! I can't believe this restaurant did not pop up on our radar sooner. ","useful":0,"cool":0},"xLrEPhTcF7T6L97e78jupg":{"text":"Such a disappointing experience.  We had high hopes for this restaurant as big fans of Eme","useful":1,"cool":0},"CvRHdJyR15ky79erTmZF4Q":{"text":"So disappointing. Two hours to get our food. 30 minutes before we were acknowledged after ","useful":0,"cool":0},"q98n_jBGrW46c2KWJ0YP1g":{"text":"The pescatarian brisket (salmon) was just ok. Kind of dry and burnt crust. I only like bur","useful":1,"cool":0},"If1jphfktQJJO3aH759hpQ":{"text":"Awesome restaurant and excellent customer service. Also, management was extra attentive ma","useful":0,"cool":0},"q_GE1q67dq-2RIA2cXN70g":{"text":"What an amazing dinner from start to finish......Francisco and his team offered impeccable","useful":2,"cool":0},"L7rn9vZsIsq87q-r0l-u6A":{"text":"Arguably the worst dining experience I've had in 5 years. We were seated 45 minutes after ","useful":0,"cool":0},"KMdxkEOfm4vKcz1FP6sfyA":{"text":"Too bad I didn't get to review this place when I actually went, but I don't think that Yel","useful":0,"cool":0},"W5WzYjz3Lqc1jPKi1KxWsA":{"text":"One of my top 5 restaurants.  Service is outstanding.  The dishes always beautifully prese","useful":0,"cool":0},"4dfgit5SmyrfVzDfw7qhlw":{"text":"After four courses, each person-two, we were well pleased with the experience.  If you dri","useful":0,"cool":0},"pcF41TYe0WtBV8ZzxZ8UFw":{"text":"My name is mike...me and some very prestigious business partners of mine came to New Orlea","useful":0,"cool":0},"h3NOblPUSAbO-8j8Fqrx-A":{"text":"We eat here every time we're in town. It's off the beaten \"touristy\" path but easily acces","useful":0,"cool":0},"pc7X6VvnX8Oai02QLDWS3Q":{"text":"The service was fantastic.  I had the best filet mignon of my life, cooked perfectly.  The","useful":0,"cool":0},"8UDmrGRToS0OzIaS_vC31g":{"text":"Everything was excellent. 5 stars to the waiters Zach, Chris, and Carlos (formally known a","useful":0,"cool":0},"2zTAGzGjcPdyjz1S0lR_Bw":{"text":"Last dinner in NOLA. It is a high end restaurant. Food was excellent. Steak was great and ","useful":0,"cool":0},"Y0srvPUI2iPWNBo_JbCXyA":{"text":"From Los Angeles.  Have been to the finest restaurants around.  My BF raved about this pla","useful":1,"cool":0},"ma5DOHZCW-hd0CLbfUY0ng":{"text":"Brought a party of 5 to this highly recommended Emeril restaurant. Made reservations a hal","useful":0,"cool":0},"lNanDenwx1a_C3dti8S9gw":{"text":"Wow!!  Classic New Orleans. Flat out fantastic meal and reasonably priced. \n\nStarted with ","useful":0,"cool":0},"HjGuuwh7rlRK6LIsvIYJIg":{"text":"My dinner started out a little weird when I was walked through the kitchen to the back din","useful":0,"cool":0},"ikZB7fnDzGJ07CesRvoWhA":{"text":"We went here last night at 6. If you're looking for happy hour, they do specials on the dr","useful":0,"cool":0},"yTCy1WOUgbenCm1DEqs_eg":{"text":"Delmonico did not have its best night on us. I have been to other Emeril's restaurants bef","useful":0,"cool":0},"cSTsFDDLzwgJrX4W6Czo0Q":{"text":"The whole experience was excellent. When you are first seated they bring out a glass of sp","useful":0,"cool":0},"4mQ7Q1kqFDWmRD_pbdXq7Q":{"text":"Mediocre at best, but I'm not sure if it's because of the large group/banquet menu.\n\nThe c","useful":0,"cool":0},"WH2OoYgcBHaCQjXZHDyXgg":{"text":"Valentine's Day in Nee Orleans at Emeril's was delightful. The service was impeccable. Eve","useful":0,"cool":0},"2Q5Hztvg31WSuqUj-nDGrw":{"text":"Perfect elegant dining experience in Nola! It was a great change of pace from the restaura","useful":0,"cool":0},"Y6ip3wPd1Ky6ujsA4MXBhA":{"text":"This is our first trip to New Orleans. We were celebrating our 30th wedding anniversary an","useful":0,"cool":0},"zLs-v0bb9emCl2_zibsfBg":{"text":"Unfortunately found an unpleasant piece of nothing edible in one of our side dishes. Somet","useful":0,"cool":0},"j2UaA4bWKgxCXZKnVr2Ljw":{"text":"I've only been here for summer happy hour but damn if it isn't the best happy hour in upto","useful":1,"cool":1},"PancS9ODH_QCPWUK3sBQ7w":{"text":"So disappointed.   We brought my foodie son to New Orleans for the first time and he could","useful":0,"cool":0},"vmLLxkK2q6LITLVBiisLgQ":{"text":"Absolutely NO BAM. We were a party of eleven foodies who had high expectations. Alas, were","useful":0,"cool":0},"BG4XY7wvAKNip07wKi3zyQ":{"text":"Amazing dinner tonight! From start to finish everything was next level. Service and the fo","useful":0,"cool":0},"jX4sZPRwuhYPdUtEwVaQ4A":{"text":"Simply Delicious!\n\nI had the pleasure of enjoying the Louisiana Wagyu steak. Prepared perf","useful":2,"cool":1},"GbTaYBsfg0_Q0Wog3CrHsw":{"text":"I wish I could give 0 stars. I've never been so  disrespected by a \"manager\". I literally ","useful":0,"cool":0},"JxwKDlFpJdkGc_GJoE-InQ":{"text":"This reservation was the anchor point of our weekend trip to New Orleans.  The last time w","useful":0,"cool":0},"Jehldyus60TO2SJoGj9P5Q":{"text":"The food was good but I expected to be blown away. Not much of the food really stood out. ","useful":0,"cool":0},"z_PnLGK2yYXXOrpx6d2rpA":{"text":"We are here in the French Quarter for a family vacation.  I wanted to go to a nice steakho","useful":0,"cool":0},"sEohuAwAX02awvg0g0k2tA":{"text":"Food was simply amazing. I had the Boudin balls to start with cornbread on the side then f","useful":0,"cool":0},"83_tIhDlVSLIdPWq87t-hQ":{"text":"The best duck I have ever had at a great restaurant.  I have been to two of Emeril's resta","useful":0,"cool":0},"dXMoC06_S1QGoh4XbyUu0A":{"text":"This is my favorite offering by Emeril.  I have to confess two things that add big bonus p","useful":1,"cool":1},"VW8JyhQi86y5AxCBJvCilQ":{"text":"Visited this location on Easter Sunday service and food were superb. We had the wild boar ","useful":0,"cool":1},"Wv2gAlBxZ3ZwRx7QN4Cx-w":{"text":"First time to NOLA and made reservations for Delmonico's.  Service was amazing.  Kevin and","useful":0,"cool":0},"1_dCpvn5H67vPxx6sO1MoQ":{"text":"Absolutely one of the best dining experiences I have ever had. The food was delicious. The","useful":0,"cool":0},"nI2gYhOU2oq91-2LzPwH-Q":{"text":"Took my wife to Delmonico for her birthday.  We are local and had not been in a while. We ","useful":2,"cool":0},"lGeLiCc1JF6E4oKp-S1cwQ":{"text":"Will be back! I enjoyed Delmonico in Vegas, so I decided to check it out the original one ","useful":8,"cool":5},"ke8r581Z1ZTOoGZASzivjg":{"text":"Fantastic dining experience!  Food, drinks, and service were simply amazing.  The staff we","useful":0,"cool":0},"IkonUx0QWc_2HFwWaEz0WA":{"text":"I had dinner at Delmonico last night and it was fantastic. The food and drinks were great,","useful":4,"cool":3},"1hUkYvTppUV0BpZfZE010A":{"text":"One of famous chef Emeril Legasse's restaurants in Uptown New Orleans.\n\nFood: If I recall,","useful":2,"cool":1},"uSNdt3op4mYG3Z8IoSVByA":{"text":"AMAZING!! we had reservations, got there a bit early so sat in the bar area. We really lik","useful":0,"cool":0},"i8Orvc9WCnmYNzmcorJUMg":{"text":"On a recent visit to New Orleans, we dined at Emeril's Delmonico Restaurant. We were a par","useful":0,"cool":0},"hF_aj9HxnfUZTmB7p4KZSg":{"text":"We had reservations this evening expecting to hear the piano player.  The hostess apologiz","useful":0,"cool":0},"lBkq2vAAR0B8osFNa6ZxLw":{"text":"Wonderful night for my daughter's 35th birthday. The Pork Chop is not to be missed. The Ne","useful":0,"cool":0},"yCSraFE4N5lGZVnDuPfHvw":{"text":"Want to know the definition of buyers remorse? Then drop a couple of hundred bucks for din","useful":3,"cool":0},"Yz79pkoFBTSmzM2wc0K65Q":{"text":"I wish I could give this restaurant experience ten stars because five doesn't cover it. Ev","useful":1,"cool":1},"fTMziILJLFmI86xG17dAwg":{"text":"My husband and I love to travel and love fine dinning. We have been to the Delmonicos in V","useful":0,"cool":0},"aQz3HbwU-qbDmyhqsLZ2_A":{"text":"I always wanted to visit one of Emeril's restaurants. I was blown away at the outstanding ","useful":0,"cool":0},"dggSdtyYiUdKMqeJOp67nA":{"text":"Absolutely spectacular very very attentive service. (Almost hovering - which calms down as","useful":0,"cool":0},"viDQmMA4Z2qrhl7QbK_g6Q":{"text":"The service was EXCELLENT, but I wasn't thrilled with the food. First I tried the Gumbo, b","useful":1,"cool":1},"PpFZ--R5S1ggQYj1Vj_a0g":{"text":"First time in New Orleans and picked tonight for a special dinner. The food was fine but a","useful":3,"cool":0},"wm1VvHVPscut8Sbpgx3ZYw":{"text":"My brother and I ate here on Feb 16, 2017, ordered the Gumbo, what a mistake really just a","useful":0,"cool":0},"DgFmLbpac9Ka3xEMdUSxNg":{"text":"The magic is gone. The restaurant has no life & no heart. Emeril's Delmonico feels like th","useful":2,"cool":0},"U9YqXUrW14XNAhL3wmqyGA":{"text":"We dined here on Oct. 27, 2014.  For the second year in a row, we traveled to New Orleans,","useful":0,"cool":0},"JyyZA3X3J8akYzySpLuYrw":{"text":"This place was a train wreck. We were sat at small table against the wall. It was like an ","useful":0,"cool":0},"y80ZlZ9R3Osnrk5BxlYz-g":{"text":"Beat (dry aged) ribeye, collard greens Ive ever had!!!!! And homemade ice cream. Words can","useful":0,"cool":0},"qsEP5BierWR-7t6khD0ctA":{"text":"It's very simple ,the best steak you can get. We started with the crab remick and bbq shri","useful":0,"cool":0},"mhB8fbKEywF4c6rSnjF4zA":{"text":"Love the drinks but wish the bar was bigger to enjoy happy hour. The bartenders we had wer","useful":0,"cool":0},"xKQXxEGBvbvE6_5ybxT6Dw":{"text":"We looked forward to eating here on our trip after following Emiril on the food shows for ","useful":1,"cool":0},"mQXeqWNygML3LsIBsMNaOA":{"text":"I wanted to do something really special for my boyfriend on our last night in NOLA. We wer","useful":3,"cool":2},"yGH5n_1g2WDaubmbxSRVmg":{"text":"I have eaten at Emeril's other New Orleans restaurant NOLA and that was a disappointment. ","useful":3,"cool":1},"_h9e_4p7TbOc7T7ibvdjyQ":{"text":"We came here last October for my husband's birthday. Was able to get a reservation through","useful":0,"cool":0},"6xo9Szz-KvCls4Um6aQH8w":{"text":"Came here for our anniversary dinner and were blown away by the fantastic food, drinks and","useful":0,"cool":0},"Ox0SEz8Qbu1mIcfrVEaOzw":{"text":"New Orleans' very own Emeril has always been a master in front of the TV, but in terms of ","useful":0,"cool":0},"1FdCIBpSJZkyAEFFxygdEQ":{"text":"This was our first time here. The service was great. The food was beyond our expectations.","useful":1,"cool":0},"ZvOpr9v6eDCCQtrixj8KSg":{"text":"Had the Creole Lamb Shank ...no need for the big steak knife fell right off the bone. Comf","useful":0,"cool":0},"VNV2TXyF6EuHXyFeLAoZvQ":{"text":"My first time in NOLA and I had to see what all the hype was about. The food, the ambiance","useful":0,"cool":0},"fDBtR1C8JJAzWUVK-PqZug":{"text":"Service was excellent at moments and lacking at the same time with forgotten things and kn","useful":1,"cool":1},"S1HKbUD06VDM4w-bxroASA":{"text":"You know when you've been waiting on your food too long when you start writing a yelp revi","useful":0,"cool":0},"BzrqEJu_1v6__ZsOZMoRUg":{"text":"When we arrived everything was perfect!!! And the food was to die for! I had the best salm","useful":0,"cool":0},"EeBJmRsMDAfmUHAp0rS-ow":{"text":"Wow, was this place ever good. I had duck as my entree. Had a dinner party here for my rec","useful":1,"cool":0},"pfDdHx_wo89f5FGL8W6B2A":{"text":"Amazing... the food and service are simply amazing!  From beginning to end.. wine, salad, ","useful":7,"cool":4},"kPGtBEBxcam5wX_rn8dHwA":{"text":"This is my favorite Emeril restaurant in New Orleans.  A more traditional dining experienc","useful":0,"cool":0},"Tg26rbqBVG94UA39e29yDw":{"text":"I will begin by saying I have eaten at quite a few \"Upscale Fine Dining\" restaurants, ofte","useful":2,"cool":3},"AnA3758vuzPmH6piQbfvQQ":{"text":"So this is basically high end tourist food. They rush you in and out and apparently don't ","useful":2,"cool":0},"th-zh96uBmyzxwJYXrA0XA":{"text":"Everything is DELICIOUS!! The service was !!! The restaurant is beautiful inside. When I w","useful":0,"cool":0},"YNpaqunDDU2JGvjsvEJ7Jw":{"text":"We visited on Thanksgiving. Had the 5 course Thanksgiving special and everything was very ","useful":0,"cool":0},"YLyB3bQy4ZLX-lqkltfj-g":{"text":"Spur of the moment decision to come to Emeril's Delmonico. Had higher expectations then wh","useful":1,"cool":0},"-o6WXIx_C9sqX0oAXxSXNw":{"text":"The food was wonderful!  I would have given this restaurant more stars except for one key ","useful":1,"cool":0},"D4fiAYPAl9D7RTzXQ_KTSw":{"text":"I took a business client and his SO here for dinner with my husband while we were in town ","useful":0,"cool":1},"yjeWppRmzDTphHSOhabMEw":{"text":"An amazing dining experience from start to finish. The service was amazing.  The wait staf","useful":1,"cool":2},"Ab23nqP7bg8rUE1NS48vuA":{"text":"So let me say this...this restaurant has the best service ever!!! I would come back based ","useful":0,"cool":0},"Y8HZx0bf3F9G_M4Dg3vMhw":{"text":"We visited on Thanksgiving. Had the 5 course Thanksgiving special and everything was very ","useful":0,"cool":0},"vPFnGSdfbOZcP-H_J_S9aA":{"text":"My friends and I enjoyed an amazing evening at Delmonico. It was such a warm and friendly ","useful":0,"cool":0},"WlUFbO7vktm6XLSZTM-4lQ":{"text":"I have eaten at Delmonico 3 times now.  It's my favorite place to grab a steak when consid","useful":3,"cool":2},"aCdNBKrv6JzDM5Iyq_fwlg":{"text":"We arrived on time for our reservation...and walked through the kitchen to an upstairs din","useful":0,"cool":0},"ScLV8gUyInAXZ5jEMevg-g":{"text":"The food and service was impeccable!!  The cornbread is delicious.  Desserts are a tough d","useful":0,"cool":0},"byiajXtkpCM7dHtB0S1P2w":{"text":"My boyfriend took me here the first night we were in town and it was absolutely delightful","useful":0,"cool":0},"njIe24CQJwCgjD8_DPw61A":{"text":"Not impressed.\n\nFor what I'm paying. I would expect something bigger and badder. \n\nI wante","useful":2,"cool":1},"L0PZNKVpbSdEXYX7WuTxnQ":{"text":"Delmonico's is a serene, lovely place in the lower Garden District. The decor is very trad","useful":0,"cool":0},"hgZ9bDcxZWi9AzMOtAQIvg":{"text":"The greats must be judged harder. I love Emeril restaurants and their creations but to mat","useful":0,"cool":0},"eCRh9vVkCbx8RgqjywB-ig":{"text":"The meal here was exquisite.  The filet could be cut with a fork,  and the Lamb melted in ","useful":0,"cool":0},"M8M6SV0RC1yrgxgdtYdUuA":{"text":"If this place wasn't so expensive I would go again and again. I loved it! I'm not use to f","useful":0,"cool":0},"vR1q2tGG5Q1ZYsB_khEiow":{"text":"Five star service, five star food, five star restaurant. \n\nNever have I felt so carefully ","useful":1,"cool":0},"o7o_8YNAjnks6yFmfSEoIA":{"text":"Has a great ambiance with beautiful wallpaper. The service was great initially but kind of","useful":1,"cool":1},"-i-X242K7j_x-Qpa2boX6w":{"text":"I was beyond impressed with the service and the food. I have been to all 3 Emeril Restaura","useful":0,"cool":1},"PygWG351ZoLH_GPjzMnp6w":{"text":"Came here for happy hour and was pleased with the drinks but not thrilled with the food. T","useful":0,"cool":0},"V1f9CZMJEp96Zxjw_OjuIA":{"text":"Booked a 30+ person group event here, we were seated in an upstairs dining room which was ","useful":0,"cool":0},"CfePttX1FUUjk1FomUnC4A":{"text":"Ignored. We made reservations sever weeks earlier. It was not crowded when we got there. W","useful":1,"cool":0},"_LYR533pJaW61tPk2I8STg":{"text":"This is truly one of my favorite steaks in the world.  The steak was amazing.  Why only 4 ","useful":2,"cool":1},"SqZ79x0DUxe8YwRUW0C8rQ":{"text":"I have to preface this review by stating that the food was awesome, the service top notch ","useful":4,"cool":0},"-EjzBjL32lZC_H5uGbi0nA":{"text":"Fantaastic service. Food was excellent. I had the Louisiana Drum Meuniere that was the bes","useful":0,"cool":1},"hfRTAEVAGTnc3E8RHT8H0A":{"text":"Emeril's Delmonico is one of the finest, and oldest, restaurants in New Orleans. Originall","useful":2,"cool":1},"kdZ9AisAqJdz36a5tbEKmw":{"text":"So disappointed, my wife and I ate here for New Years Eve dinner. We had a 7:30 reservatio","useful":0,"cool":0},"QOXU44gdUIuHdEL__sX_BA":{"text":"There are a lot of \"celebrity\" chef-run restaurants that are pretty lousy. This is NOT one","useful":6,"cool":8},"W43bOlioNaDBqjRkNavY3A":{"text":"New Years Eve celebration  and did not disappoint. Seated about 15 minutes after time but ","useful":4,"cool":5},"nlu-6S_v724b0hwuqTV7qg":{"text":"Had a large dinner party here on a Sunday night.  Service was good, but the quality of foo","useful":2,"cool":0},"I7sLS6XqlyJNEXQPvyAzUw":{"text":"I wanted to go to a \"fancy\" place for one dinner while in NOLA.  I think I picked a good u","useful":4,"cool":4},"ko5nPz4wqfOFo5l7A5dzIA":{"text":"My wife and I had dinner here on a Saturday night on a short trip to New Orleans, and it d","useful":0,"cool":0},"x0fewfwFOh6NWel-OpD9bA":{"text":"The food here was ok, but not what I was expecting.  We have eaten at the Delmonico in Veg","useful":1,"cool":0},"6e8zMTCYRtltgr49BoECKg":{"text":"I feel like Delmonico's was better the last time we ate here, about a year ago. Though it ","useful":0,"cool":0},"TWWQohXPPog0UPdEy41EHg":{"text":"I made reservations at Delmonicos almost 3 weeks ago but when I got there they didn't have","useful":1,"cool":2},"MZCgFPo14PygP9vPyE4nKg":{"text":"I've been a fan of Emeril's shows on tv for a long time so I was really excited to finally","useful":0,"cool":0},"V-Uie368NBHQTanwPDWFNQ":{"text":"I was so excited to come to a restaurant under the Emeril franchise. First let me say how ","useful":3,"cool":1},"F3KnoufJZgvSJPam4Mv0nA":{"text":"WOULD MOT DO THIS AGAIN! From the moment we arrived the server was in upsell mode. Did not","useful":1,"cool":0},"JtxtrhAB_kTZBayOIihADw":{"text":"It does not make me happy to write a negative review -- especially when it was a special e","useful":4,"cool":1},"DeUC7lq9LEQ1svYJqEAkhA":{"text":"Attended a birthday dinner in the private room located on the second floor of the restaura","useful":0,"cool":0},"4V5TumRx83HEpmK9D9MMCg":{"text":"Probably the best meal and dining experience of my life! The staff was very attentive and ","useful":0,"cool":0},"Uo3gOqh1KlkgF4iZ2k-igg":{"text":"Happy hour was fun.  Music playing, bar tender was entertaining, guests were fun and cordi","useful":0,"cool":0},"SwMukSgHVkWFLdea4oz62w":{"text":"Had a nice Christmas Eve Seven Fishes meal, here. Food was well prepared and presented. Fi","useful":1,"cool":0},"G3wxZOUUBkFSgwh29Nd3pA":{"text":"I wish I could say it was fantastic. I had the stuffed flounder, one of the daily specials","useful":0,"cool":0},"_MaWbFbjsmmSCUQlP014gQ":{"text":"Excellent. Stupid good.  The aged steak was the best steak I've ever had. The duck was exc","useful":0,"cool":0},"6TJ_C9CW7VW5JC6vZ4eujQ":{"text":"We ate dinner at Delmonicos tonight and it was awesome. Started with the charcuterie board","useful":1,"cool":1},"VERW8IYNhRQN1TUZuaYw8g":{"text":"This review is based on my experience during NYE 2019. \n\nTLDR; This place was a bit of a d","useful":0,"cool":0},"4xhLQ2epD67UlrLC7FLrwA":{"text":"Great happy hour prices. Not too busy around happy hour. Bar staff friendly, host staff no","useful":0,"cool":0},"97E8TbD0qvBoE3Y7ypRUXg":{"text":"We dined here with a native New Orleans friend who recommended this place, and it was fabu","useful":4,"cool":2},"JUc4Yoy9pMqtKC8aK57cVg":{"text":"Amazing food! I came with a bridal party after leaving Cafe Amelie's because of a horrible","useful":0,"cool":0},"I1FhaTmX6_ZbHp1vcJVU0Q":{"text":"Had organized a large group dinner for my team while in town and selected this purely out ","useful":0,"cool":0},"ZL1qzGCZH46klBAg9aIKIA":{"text":"This was my least favorite stop in New Orleans. The food was overpriced and underwhelming ","useful":0,"cool":0},"vJEcj0iNk85KChgY-oixyA":{"text":"Lets begin with I had the best steak of my life here. Wasn't sure what to get and the wait","useful":1,"cool":2},"xpjEYCP6Pp27OwNrJP7L5g":{"text":"Food was five star. Unfortunately, service brought the experience down to a 3.\n\nAppetizers","useful":1,"cool":0},"xWsjt0RzvMQWGKZguwKYTg":{"text":"This place is amazing... every aspect of the experience was above par. Very friendly and t","useful":1,"cool":0},"rUL3sDQNTUgDmCBEzq6_Kw":{"text":"Yum! Yum! Yum!  I was craving a steak and was in The Lower Garden District, so I went onto","useful":2,"cool":1},"D33rP47c5zFsWRKVv6tEzw":{"text":"Wow! Just wow, first ever experience here  and won't be the last. We made reservations so ","useful":1,"cool":0},"zVuN7HNJz6vkz6DW2kdWdQ":{"text":"The food is good, but the staff is AMAZING! Steak was a little fatty, but the pork chop sp","useful":0,"cool":0},"RWG-oX9djioKIZ0Qr5b8cA":{"text":"While in New Orleans we *had* to visit one of Emeril's restaurants and this one seemed the","useful":9,"cool":10},"GPePaMvAFZVBBYQ95yOS2w":{"text":"I can't say enough about this place !! It's simply AMAZING !!\n\nThe service was top notch -","useful":1,"cool":1},"SKWDKMX0fgRAYXuyHzLGTA":{"text":"We went here with our 7 and 9 year old boys (steak fans) 9/13/19.   I had a royal sazarac,","useful":0,"cool":0},"TwQykwh2IPXCIMpf4uRK5w":{"text":"Francisco Dusan was our waiter and he was absolutely amazing! So charming and well-mannere","useful":1,"cool":1},"dRalTRTRZxV2OHIugY9jSA":{"text":"Very slow service. Food was undercooked. Took 30 minutes to get our drinks. Overall, terri","useful":0,"cool":0},"Dx-bcBjRkpa9fOMbXS717w":{"text":"Had a wonderful happy hour here! What a great way to sample some of their small plates at ","useful":2,"cool":2},"KVM2AUS_irXWbJ5wVzta6A":{"text":"I am a big fan of Emeril's restaurants!  His restaurant in the Warehouse District is my fa","useful":1,"cool":0},"J8BvCpDq0keB-dAN6HlRcw":{"text":"The food was impeccable and delicious. My pork chop looked like a tomahawk chop. The dirty","useful":0,"cool":0},"Nfvo_wWbF3Sd45jFLYNLZw":{"text":"This is one of our favorite places in NOLA!  From the time that you arrive until the time ","useful":0,"cool":0},"G3JMhFExGuTdBUd13YsqTg":{"text":"For an amazing fine dining experience check this place out! The staff was incredibly frien","useful":1,"cool":1},"RsJidC_ykbe7Mg6IXdvIGA":{"text":"This Place is a complete and utter dump.  The only redeeming thing was the awesome piano p","useful":0,"cool":0},"l6hzyhSbFgKRUf6CHwZ8rg":{"text":"Celebrity chef restaurants can be more miss than hit sometimes. This place doesn't disappo","useful":0,"cool":0},"15NuH-bzRig2QVivPJzvpA":{"text":"New Orleans, famed for its cuisine, is where Emerils rises above that expectation without ","useful":0,"cool":0},"il6NxcFal__CH91OYDbpUA":{"text":"BF and I made a year and he surprised me with a reservation here. I've been wanting to try","useful":2,"cool":1},"HBzWBBxLzlpLZVrgOi5S1A":{"text":"Fantastic food! Fantastic service! Attention to detail was impeccable. I had the gumbo, lo","useful":1,"cool":1},"U1Q9WvVGAyLhuLLDu76ovw":{"text":"Duck Prosciutto, Soppressata Calabrese, Bleu Mont Cheddar for starters AMAZING. My husband","useful":1,"cool":1},"p8VdI01hhUVYzCGpQOXbVA":{"text":"Ok, so never having been to NOLA I wasn't sure what to expect with Emeril's. Living in Flo","useful":2,"cool":2},"uHfXCpUf3BCwC5Pdzzdh4Q":{"text":"Emeril Lagasse's Delmonico N'Awlins steakhouse is truly one of the great restaurants in Ne","useful":1,"cool":1},"fPIA0ajFToEIjKZlomrtgg":{"text":"This was a Horrible experience. First they put us next to a false wall with a party next t","useful":0,"cool":0},"jl-KXnSV3SZnR4z4IFuLEw":{"text":"This was hands down the absolute best food we had during our week long trip to New Orleans","useful":0,"cool":0},"7i5Pa6OSe5_Zk90V7a0ieQ":{"text":"Not impressed. First asked by the hostess to climb a \"stairway to heaven\" to be seated. Re","useful":0,"cool":0},"g63AwuZn0r72EKtYItAKPQ":{"text":"This was our first meal in New Orleans, and it set a standard that was only matched by the","useful":2,"cool":3},"-BtYmo8Kt4jVbrJZQyOFsA":{"text":"Joshua, Jason, and Robert are THE best bartenders/servers at the bar. Very genuine and fri","useful":0,"cool":1},"KaT1eV4NKIZ0Sq360_TB9g":{"text":"Emerils Demonico ... Oh my god, what a time to be alive. Everything was SPECTACULAR! The s","useful":1,"cool":2},"uu3kmC7MJpHR-DL4nY4nPg":{"text":"Extremely disappointed.  I am normally a fan of Emeril restaurants, so that's what really ","useful":1,"cool":0},"K-blC_KUSld7GRubKHCN0Q":{"text":"I called earlier in the day for a reservation for six and was pleasantly surprised and ple","useful":3,"cool":1},"FYXn34Wi8r0Miv51Mkl_tg":{"text":"The service was excellent!!! Soon as we walk in we got greeted . But the food wasn't . The","useful":0,"cool":0},"tcmnGF7_lOuTm09q8nHnKQ":{"text":"Had a nice dinner here. They started us off with a free glass of cava, very nice touch.  E","useful":0,"cool":0},"opPs97Lu-I4OtM708gVc7Q":{"text":"Best Cajun/Creole food in upscale setting I've ever had. This restaurant feels like a home","useful":2,"cool":1},"8ggyfXco4W2A31l-gbBNbQ":{"text":"Very upsetting.    Booked online for 7 pm for eight people. We called and verbally changed","useful":0,"cool":0},"n0QSOVv1rE3l-j3NMhDQyg":{"text":"As the pickiest foodie on earth, I can't begin to express how impressed I am with this res","useful":1,"cool":1},"MpNouxgK2f6WLGQGJ3W5mw":{"text":"Service and food ... phenomenal!  Little extras like a mini appetizer (cucumber slice with","useful":0,"cool":0},"yMOC4rYb9_OSMFCOic5JUQ":{"text":"To echo other reviewers, the decor is absolutely gorgeous. Our complimentary appetizer and","useful":0,"cool":0},"pua93O9Nz6GnCrDCCxncRA":{"text":"This was the worst experience for such a high end restaurant. My friends and I are here la","useful":0,"cool":0},"ygUWs_k_yBffNS2HrxWDzA":{"text":"Solid 4 stars.  This restaurant was actually very good.  I didn't feel the inside was too ","useful":1,"cool":1},"dOqdn0OFpCcwEveE2Og5TA":{"text":"I was SO excited to go to this place.  4 stars for ambience and staff!  Everything was gor","useful":2,"cool":0},"iftHbUmqzkWs8mYh9V-vRw":{"text":"I loved my scallops - perfectly prepared - the jalapeño grits and corn. Best I've ever had","useful":1,"cool":0},"urOBytRYxaiin9yXQciAPQ":{"text":"Went to Emiril's New Orleans before Katrina (over 20 years ago) and found it a wonderful e","useful":0,"cool":0},"l_OEoRYupnBwN7iXv6TXfQ":{"text":"It was an expensive restaurant however you get what you pay for and it was worth every pen","useful":0,"cool":0},"JbWfo0g0TljXwuwUhiFeEw":{"text":"We attended a cocktail function here, and were overwhelmed by both the food and the servic","useful":5,"cool":4},"2HiFb4eZDee2ABdFEIvHYQ":{"text":"This was, hands down, the worst fine dining experience we have ever had.  Compared to the ","useful":1,"cool":0},"G_1JOseUcTkqe-0zgqYsvQ":{"text":"Amazing food-I'd go there just for the spinach in brown butter.  Steaks are fantastic.  St","useful":1,"cool":0},"IWPFcGqqLHjILLrYCk_Cmw":{"text":"I had one of the best dinning experiences ever at this restaurant.  I came with a co-worke","useful":0,"cool":0},"0MSndSjYkveMvZL4Wwnumw":{"text":"Do Not Eat Here. For what kind of restaurant this is and for the money it cost to eat here","useful":1,"cool":0},"DPsagzVqRV7DynYMVhwYig":{"text":"We flew into New Orleans from out of state for Valentine's Day, and no banana's foster.  W","useful":2,"cool":0},"n245ldPPvy4KF4kFmsgLEQ":{"text":"We went for happy hour recently and were so happy we did! Chargrilled oysters.99 (massive!","useful":1,"cool":1},"T4fDuALLvSFNuhT1R3Z17g":{"text":"My wife and I had an event we wanted to celebrate, so after a discussion, we picked Delmon","useful":8,"cool":4},"1RnKWrHCKBmpXF71ufmsqw":{"text":"The food is terrible for what you pay. Staff is snooty and rude. Doesn't treat you like an","useful":1,"cool":0},"ov8zeOJu0GpPoTrN7pWL7g":{"text":"Man, this was an interesting experience. Bad service combined with mistakes, lack of care,","useful":0,"cool":0},"Qb4SCzaqpbrV_w_4g8WzgQ":{"text":"One of THE strangest dining experiences in my life. And by far one of the biggest regrets.","useful":3,"cool":0},"bMPkGnf7-9BE_Cn6qy1enQ":{"text":"One of the BEST restaurants in NOLA!  The service, ambiance and service here were excellen","useful":1,"cool":0},"vc0dPSnRiYNWIhmSJxH50A":{"text":"I can only speak of the Happy Hour from 5-7pm which was absolutely phenomenal! I came with","useful":19,"cool":14},"qVHIWISNrlDHTZlg4DlNhQ":{"text":"Everything we had was mediocre, except one dish. The brussel sprouts were bitter and dry. ","useful":1,"cool":0},"uMpQMUxL5Uqtlzm1iJefxw":{"text":"We sat at the bar. Everything was amazing! The service, the food, the drinks...if I could ","useful":2,"cool":1},"fVRe8ytvcNrcbkX0ZrOqDA":{"text":"Ate here for Valentine's day 2014...\n\nBEST STEAK EVER. \nI got the 45-day-aged bone-in ribe","useful":5,"cool":4},"37Geq5JJWAwysX0lhuEM1Q":{"text":"This was our big dinner out while we were in NOLA and though we had a good time with frien","useful":1,"cool":1},"pqNkCahlTNxB4f9hqF5qFA":{"text":"I agree with another reviewer... high end tourist food. I was not impressed at all and we ","useful":5,"cool":3},"2zzilF35IiwojPyavG6hpA":{"text":"We came here for our one year wedding anniversary meal last Sunday the 3rd and it was spec","useful":0,"cool":0},"rfXhsXOJ50eHfvGYEI1irg":{"text":"Absolutely worth every penny you spend! I don't say that often, so make note of that.  Fro","useful":2,"cool":2},"H-wnbEZg14ijHR0Qcz_zmQ":{"text":"Arrived a bit early at Emerils place in the Garden District. The 4 of us sat at the 6 seat","useful":0,"cool":0},"UoF2bE2O3D_a5ucUKz-T6g":{"text":"I would give this place more stars but the service was less than acceptable.  \n\nThe ambian","useful":3,"cool":1},"7tICBcT4BxkUE8KADOqv6w":{"text":"This is my restaurant of Emeril's and one of my favorite restaurants overall in New Orlean","useful":1,"cool":0},"_zQVSUWBc2p0f7u-RFCAcw":{"text":"I did the Happy Hour 5 to 7 pm, sitting at the bar enjoying some small bites for a fiver e","useful":1,"cool":1},"sDdzcXNr7NL601S0nP0EXQ":{"text":"Happy ANNIVERSARY dinner for me and my bestie.  17 years of martial bliss. \n\nI think we de","useful":4,"cool":4},"l30TMizCsFEBFWOPrr6qEA":{"text":"After nearly two years in New Orleans, I finally made it to Emeril's Delmonico. EVERYTHING","useful":2,"cool":1},"hD27rvd84O3b-9d-SxO5UA":{"text":"Came here for dinner with my work colleague and I was not disappointed!! From the moment w","useful":2,"cool":0},"97obQ7hiPLEuft0uPVIqdA":{"text":"We had a large group that kept on getting larger at Delmonico. The restaurant accommodated","useful":1,"cool":0},"OOPYr95-TYrzjPtDBmVoqg":{"text":"Seriously folks, you MUST splurge and dine here. We came as a group and every single detai","useful":1,"cool":0},"IEiE80MfuBhxuRdw1-RTGw":{"text":"Another one of Emeril's establishments here in New Orleans that lives up to the quality bi","useful":1,"cool":0}}