{"5K2QKSFsKSA6Gva4ibH_1w":{"text":"The system was very easy to set-up and use. We have traveled the country and set-up with n","useful":4,"cool":0},"QiWDkrQXhrqWWViaLYeuuA":{"text":"I am giving it 4 stars because it is easy to use and convenient for the attractions in the","useful":0,"cool":1},"yf2HHVyE6M07iZa-34omOg":{"text":"Scam.  I parked, paid $18.50 for 1 hour, got back in 55 minutes and my car was booted (sti","useful":0,"cool":1},"8SmS1_DcIb5eGoJudmClgw":{"text":"Total ripoff. Paid for parking. They booted us and initially tried getting $90 out of us. ","useful":0,"cool":0},"MolPqB-CfyyanoN1wGVccQ":{"text":"Horrible customer service!!!!! They booted my car which was paid for and I had a receipt t","useful":1,"cool":0},"Hw4dLQrDO3XmQC8UxVyyZA":{"text":"DO NOT PARK HERE!\nthey are too quick to boot you!\n$144 to remove a boot.\nIf you lose track","useful":1,"cool":0},"ZGlqdqzS9bYY0GqCaO28Bg":{"text":"Easy lot to get into and out of. I could not find parking rates listed on the signs or the","useful":1,"cool":0},"IrbsdaR9Ohfq4jvICv4RiQ":{"text":"In the past, whenever I visited New Orleans & went to the French Quarter, I parked in this","useful":1,"cool":2},"9cYOVLNHrqP98Ez5Q67_vg":{"text":"I have parked here in the past. It is easy to get in and out. Parking spots are ample in s","useful":9,"cool":8},"tkUT7PLNi-46bofuri6_9w":{"text":"Not busy there were a lot of spots open around 5 pm. Paid for mobile app. Good location if","useful":1,"cool":0},"8XaHls3mczUF2XY4sZVQMg":{"text":"My husband and I are staying at an Airbnb property that is about 4 miles from the French Q","useful":5,"cool":4},"o11DA2puiNPbrOGFgaMqzw":{"text":"This parking lot is in a great location in the French Quarter. I've parked here many times","useful":14,"cool":7},"KWnwG-Fe5TexAeOrjjmW9Q":{"text":"We visited New Orleans for the first time in more than I can remember and parked in the sa","useful":2,"cool":0},"jVUCh_jnoAycdXpKbaLxDA":{"text":"There are probably some \"pros\" to parking in this lot, but I'm at a loss.\n\nSo, they got ri","useful":5,"cool":2},"EwWmZWLWFtl9woknT_VEQw":{"text":"I paid for 3 hours of parking which was $22- higher than most lots nearby. My ticket was e","useful":0,"cool":0}}