{"QS7CuOtFLuS3dnwKHRtSYQ":{"text":"Had to wait until my third trip to NOLA to actually get in the door.  First two times I tr","useful":0,"cool":0},"iua3yb1BmWdIYOFXMMmwQg":{"text":"This place is awesome. A real throwback. Music is great, 4 stars (not 5) as they don't rea","useful":0,"cool":0},"Oa_JFcuZke-UmjDW5uBaaQ":{"text":"Amazing live Jazz music. No alcohol. No food. Just JAZZ. This place really shows NOLA city","useful":0,"cool":0},"nu2VMKAdzhIPTbqBUQamgw":{"text":"You will have to stand in line, you will have to squeeze onto a wooden bench with a lot of","useful":1,"cool":0},"bEOQA1eK75QcLI7QAVIiyg":{"text":"This place is worth a visit! We got in line about 30 min before the 5pm show and were in t","useful":0,"cool":0},"IdtRSs4jhwXG_FWADaTw8w":{"text":"the music and the ambience brings you in a different time....best traditional New Orleans ","useful":0,"cool":0},"03WjeBJ-qRBql83bdvZVqw":{"text":"Walk around inside and soak up the history. Talk to the guy selling shirts outside, he has","useful":0,"cool":0},"C6_WxrXzrnp7mCARbysUXg":{"text":"The tickets are $15. There is usually a line to get in and only the first 20-30 people wil","useful":2,"cool":1},"GBiRhUePudnypw0Y-GC2PQ":{"text":"If you go to New Orleans this place is a must enjoy great music really cool atmosphere and","useful":0,"cool":0},"4FB-bNVtYeTJZcXfkAgb0g":{"text":"First of all this is a music lover's mecca.  I cannot say enough good things about Preserv","useful":0,"cool":0},"cHRsZCE__WU2hctDe5ZPUA":{"text":"Great place to hear some live jazz old and new. Reasonable drink prices considering the en","useful":0,"cool":0},"md4Rd-tm1WAlFg2yQhvwog":{"text":"You won't find anyone who loves The Preservation Hall All Stars more than me. I've seen th","useful":3,"cool":1},"7DzJBu_1TacbXZPhfXBhkA":{"text":"This is phenomenal jazz club in the French Quarter.  The music is amazing, the setting is ","useful":2,"cool":1},"oC7dWSdhksoE-9pmgE-Grw":{"text":"Great Jazz spot - No photos/videos allowed during the show!\n\nThey offer presale tickets fo","useful":3,"cool":0},"H7AheyzcBrBt2Wv-b0GWcw":{"text":"WOW! I've never seen an authentic Jazz concert until I came here! All Stars band was aweso","useful":1,"cool":0},"2y4DUYaHyun4QUZjT7eDNg":{"text":"Would give zero stars if possible. Let me start with the caveat that the band is fantastic","useful":2,"cool":1},"Pb6BqtQdNyFQKimqIPInww":{"text":"You just can't pass this up! Very neat, all ages, incredible musicians. Definitely make it","useful":0,"cool":0},"x7hUgcz8I-yCawcpXKWQ3A":{"text":"Authentic jazz music. Worth the wait. Worth booking in advance if you get in line soon eno","useful":0,"cool":0},"qpeR6GAj4MnzoI5sZIQ_ZQ":{"text":"Let's get the obvious out of the way: the jazz is raised here at a whole new level. Musica","useful":1,"cool":0},"OFokXGC8-PeypsP8TqSPvg":{"text":"Sort of a must visit place, you know?  It is a beautiful historic thing that re-creates a ","useful":0,"cool":1},"SuJx9iY1tv4hEVPEPNk1Xg":{"text":"Just okay. We waited in line for almost an hour for the 9PM jazz show and we listened to t","useful":1,"cool":0},"KQlBZBAsA86d_u1vYUUTAg":{"text":"Checked out the first show of the evening on a Friday. We got in line at 7pm for the 8pm s","useful":0,"cool":0},"ztTtkEwTEYqoHO5D7gBvkA":{"text":"If you're in the Quarter, you owe it to yourself to plop down the $15 and see one of the s","useful":1,"cool":0},"4sHAb-dmGs4Nks0AHIM96Q":{"text":"The 45 minutes at preservation hall, made my day. Got on the line at 940 for the 10 PM slo","useful":1,"cool":0},"Mx9IWSY__eB9MmKzo91Ynw":{"text":"Amazing music terrible wait.\nSo this is an amazing experience and the music is second to n","useful":0,"cool":0},"GnNtwjAiGJFCC21EGd46Ig":{"text":"We LOVE Preservation Hall and enthusiastically recommend it to everyone! We had the good f","useful":0,"cool":0},"hF3v_cMeMgG9eJ9_g6_IPQ":{"text":"I had a friend tell me to check out this out while on a trip to New Orleans. It did not di","useful":0,"cool":0},"YLr3440E_9Wdxb8egPYhRw":{"text":"I've been a jazz fan for a long time and I have mixed feelings about Preservation Hall.  O","useful":0,"cool":0},"zdKmVYTAg8SMgcjRfcQNdA":{"text":"There is a line down the street as I walk up to the door and chat with the admittance lady","useful":4,"cool":1},"-n-PCI2N9zPc0TRSutTUbw":{"text":"If you are visiting New Orleans and you like Jazz you will love going to Preservation hall","useful":1,"cool":0},"PcAS2BfmCqdqA6hRqI89OQ":{"text":"Amazing amazing amazing. Definitely put preservation hall on your to do list. The band is ","useful":0,"cool":0},"2rxK8hv0oF4tyTHi20J5-A":{"text":"What can I say that hasn't already been said? The music is fantastic, and was 100% worth t","useful":0,"cool":0},"vDltSefucVaDCkdDdU5X7g":{"text":"This was a wonderful way get a taste of New Orleans music.  Definitely book tickets for se","useful":0,"cool":0},"MWpBHB4O52yuh8d6M9jbYg":{"text":"FUN FUN FUN.  Make sure to reserve seats ahead of time (the more expensive ones)  You will","useful":0,"cool":0},"g7WkxFb94OFCjpbhk4Yndw":{"text":"My friends and I purchased VIP tickets for a performance at 9 pm.  With these tickets we d","useful":4,"cool":2},"cQqFNExWT5HrLANTzTxODg":{"text":"It was amazing!! It was so hot but once the music started I didn't care how hot it was any","useful":0,"cool":0},"dimJjHm8aWOd9F-98Z1cZQ":{"text":"Wow. Had to get that out there. This place is literally a time machine. Just off Bourbon, ","useful":0,"cool":0},"OFshrwo8Z9ocpcmbO_IlHA":{"text":"LOVE LOVE LOVE the Preservation Hall! My family and I went on a thursday night...we were w","useful":6,"cool":5},"vfvv31lQ-4t0ptKRuwsyNg":{"text":"Just a great music venue. We hung out in the back with a beer and had a blast. Music all o","useful":0,"cool":0},"TQdL9v9iIRpUK0ktW0pl3w":{"text":"Definitely one of the highlights of our trip! We went at a less popular time (9PM on a Tue","useful":4,"cool":0},"-UzBJPrep2p41TIigRWHjA":{"text":"Preservation hall started in 1961 and clock stopped ticking there ever since. The tables, ","useful":1,"cool":0},"o6b_pH22sykljHCp--AGNA":{"text":"Amazing live jazz!  But here's the inside scoop:\n\nDo not purchase the \"Big Shot\" tickets (","useful":2,"cool":1},"EsAxAboT38FYkxqFuPrrPA":{"text":"After we couldn't get in the first night, we came even earlier to wait in line and get in.","useful":0,"cool":1},"sOXzer6YPEQJv2YIphEBKA":{"text":"Favorite music venue in New Orleans. Old time jazz the way it was meant to be heard. For s","useful":2,"cool":1},"553oWWWNxTfm_C3XJzUrzg":{"text":"If I could I will give zero star for this place. The hostess was so rude. When we arrived ","useful":3,"cool":0},"JWXEwdA_qAapy5qn9w3qgQ":{"text":"Awesome show in a small intimate setting! The jazz band was spectacular, musicians ranged ","useful":1,"cool":0},"2KplaSjRW0EVukW2-WN3_g":{"text":"this is a must for everyone.\ntwo ways to do it.\nbuy reserved seating in advance cause that","useful":2,"cool":0},"ttv7MWeROnJyGvZB6dUqdA":{"text":"This was amazing. Super intimate show with some fabulous jazz musicians, just jamming for ","useful":0,"cool":0},"X9KRUdzf5Br2uGEDHnPLSQ":{"text":"Of course, when reviewing music clubs, jazz halls and the like, a lot of it is based on th","useful":1,"cool":0},"KfOy7gOUu5rfFpGJ0XZ2JA":{"text":"Thursday Night jazz was my first experience in New Orleans. And it was splendid.\n\nThe atmo","useful":0,"cool":0},"g8-82VQyD2wmw1Hq7lrc8g":{"text":"it's not just Jazz, it's NEW ORLEANS Jazz.  Go.  Now.. breath in the ghosts of the past an","useful":5,"cool":2},"wJI9Cmc4iYqSwb3LNgGv4A":{"text":"Jazz was the best we heard in the french quarter (also went to Fritzels and Maison Bourbon","useful":2,"cool":1},"EZ419SBX7D_jhrhhhz8gKQ":{"text":"I wanted to come to NOLA to listen to some good live jazz. This was the place for it.  It ","useful":0,"cool":0},"wNP3RzSFyjQLNNAWjQ08Kw":{"text":"What a great experience but you really want to either book your tickets in advance to get ","useful":0,"cool":0},"XrWSnCrDJAJNNusBhzbQ7w":{"text":"Preservation Hall is a New Orleans staple. I have heard about it for years and finally was","useful":0,"cool":0},"UxLazwOwM_p4KL9XtCpTDQ":{"text":"If you don't already love Jazz, the magic of this place will turn you into a believer. The","useful":1,"cool":0},"3h2ra3Uz-LzCbwjlub_XTw":{"text":"Take it from a life-long New Orleans Native,\nthis is the real deal.","useful":2,"cool":2},"uM0r3VUJQTKOTFU8R3I2sQ":{"text":"the staff was arrogant entitled and rude.  we love NOLA but never been treated this poorly","useful":0,"cool":0},"JmJqJRDK2POHaMKQPg3Z0g":{"text":"This was one of the highlights of our trip to New Orleans. It is definitely worth the wait","useful":0,"cool":1},"vb0KkHw65VULmM04N-4qvg":{"text":"Tremendously enjoyed the music there.  We went around 9:30pm, waited for not too long, got","useful":0,"cool":0},"Aw06HAgn14265imM8X6cWA":{"text":"A wonderful jazz experience. Just musicians and instruments, playing their hearts out, and","useful":0,"cool":0},"CQ3UEU7o7I92Zy3pIfKxRA":{"text":"Went here last Friday night and had a chance to listen to some Jazz masters. We were fortu","useful":3,"cool":0},"Pj-hpGO7gDfe2C6u0nuRWQ":{"text":"We had been to New Orleans many times before finally getting to attend a show at the Prese","useful":0,"cool":0},"CQjDYomZuOXz5byvBAnhtg":{"text":"True New Orleans gem! It is a tourist spot and so many postcards with their picture but so","useful":2,"cool":1},"0FfJWmJi-1vmD5onN2n2iw":{"text":"This joint is legendary, and for good reason - the jazz tunes played here are awesome. We ","useful":3,"cool":2},"gc9lw0gRlQ-jnqAAbzXFxQ":{"text":"Came here on my first visit to NOLA and loved it! This is something everyone should do and","useful":0,"cool":0},"6KvVSXw0VoWFfiykqv5twg":{"text":"Very cool dive. Old school jazz hall. I loved seeing this place. It was my first real tast","useful":0,"cool":0},"X-2eUaBTFL7Vb3IH6430jg":{"text":"5 stars just beacause...it's Preservation Hall!  Looks like it will re-open during the New","useful":1,"cool":1},"nElFpxEn_Vlt8K3MwJpW2g":{"text":"A cozy venue where you can see some of the most amazing jazz musicians perform! I only wis","useful":0,"cool":0},"8GEO6Fulz_T6NC8-w6fMqA":{"text":"Good jazz, I don't know if it's the best I've heard but i am glad I tried it while in Nola","useful":0,"cool":0},"xu2ouByHfogRZzqH2Nv6lA":{"text":"It's definitely a bit on the tourist map now, but it's a fabulous old place to listen to j","useful":0,"cool":1},"iRBZqg5TkPpqV7w9teh4FQ":{"text":"This is place people take their parents who are visiting from Utah. It's a Disney-esque ho","useful":1,"cool":0},"NeUNGoiYfpLZSqhF_vdUIg":{"text":"I am really glad that I did the Preservation Hall experience during my short time in NOLA ","useful":0,"cool":0},"LUu-yJVgj558i-IAwGjygA":{"text":"This place is a gem. The music is just simply unbelievable. It was literally stepping back","useful":1,"cool":0},"XhqwSpDM1MlZLiY8cOEq7w":{"text":"Definitely a must see in New Orleans. Venue is a little bit on the sketchy side but the mu","useful":0,"cool":0},"x4DaQEf-sUWdwyU2UezmVg":{"text":"Came here for NYE and it was probably one of the best New Year's Eve parties I have ever b","useful":0,"cool":0},"pxLbmqPEEl5qILcIo2EgZw":{"text":"What an awesome show! The band was phenomenal! I would splurge on the seats if you are abl","useful":0,"cool":0},"Jf_k1oreSH73zckjfl1w6Q":{"text":"So much fun! We saw The Preservation Hall Stars featuring Shannon Powell at the 8:15 set. ","useful":0,"cool":0},"nfAr0Iku9ypZ5-0N-APgkg":{"text":"Yes, it's touristy.\n\nYes, $15 for 45 minutes feels like a lot.\n\nYes, you have to wait in a","useful":1,"cool":0},"D-Padf-_4J6YjAqnRXLA-g":{"text":"I went to New Orleans recently for the first time, and some of the first things on my list","useful":1,"cool":0},"GhvlJun2c99em3IovRK11Q":{"text":"A absolute must to take in while in NOLA. Very small. No beverages or food sold but you ca","useful":0,"cool":0},"FktGiRIl0N-AyPnIrKYTbA":{"text":"This is the real deal. If you have come to New Orleans to hear New Orleans music, eat New ","useful":0,"cool":0},"iad3jm9bUi1TIdw05cU62g":{"text":"Amazing !!!  Magical !!!  One of the coolest things I've ever done in NOLA.","useful":0,"cool":0},"SJ960iGtSFm5OBeaGT2aAQ":{"text":"Preservation Hall is one of the best places I have ever gone to in my life! The tiny littl","useful":1,"cool":0},"laEp8T4ktLvVCYbFuY1gvw":{"text":"We decided to get a taste of jazz and history in one fell swoop! Wow. How amazing to here ","useful":5,"cool":2},"s6kN9ZPdA0JfWwJLTxOXfw":{"text":"Two of my favourite reviewers, Dennis S and Kristine R, both gave Preservation Hall 5 star","useful":3,"cool":3},"RBC2Zx3Mzes-5rl5McEnSg":{"text":"This place was about as cool as it gets when it comes to a famous well known jazz hall, $1","useful":0,"cool":0},"v4HnK9R8HAZi-IKlMEnrrQ":{"text":"The music is great and the hall was a little \"run down\" than I expected.  \n\nDo yourself a ","useful":0,"cool":0},"M38x2oZaiXglr6LlbpSrLw":{"text":"I know this is heresy, but I was slightly disappointed with the much-touted Preservation H","useful":1,"cool":0},"_ZNGd8SX5zIwgc3iGWcM0Q":{"text":"Ugh TOURIST TRAP! I would like my money back! It's no fun to stand in line for general adm","useful":0,"cool":0},"npzyCOi6BPWfSw1Nbdq2uQ":{"text":"This is a great place to listen to traditional new orleans jazz music. \n\nI had to go to th","useful":0,"cool":0},"MGVdEMObhfoA4hIaVFrRwA":{"text":"Bought my tickets in advance so I would be sure to have seats.  Gregg Stafford performed o","useful":0,"cool":0},"D64P8wvfxBvvD1uE4ujqqA":{"text":"Great place. They have 8, 9, and 10pm shows. We got there at 8:05 and were the 20th or so ","useful":0,"cool":1},"xS-tNST7vksoMXlDwDP9ng":{"text":"This place does jazz, and that's it. No food, no drinks, no bathrooms. Just jazz. But boy,","useful":1,"cool":0},"o7QZn4zJHRQoAfMlW3SQVQ":{"text":"I was lucky enough to have the chance to work on a project that rented this space out for ","useful":0,"cool":0},"ZdptoD_imz-Lb2urmUFl3A":{"text":"I just got an email from the vendor:  their next annual conference is in New Orleans.  Wha","useful":7,"cool":5},"oBWskCJ1-giCgvHQOPcGvA":{"text":"Great music venue, feels like you are stepping back in time. Definitely one of a kind plac","useful":0,"cool":1},"Mc_GlYrAkEzKcUxw0ZAzQA":{"text":"The musicians are incredibly talented and the music certainly is authentic NOLA jazz. It's","useful":3,"cool":1},"8QkAgUjEBSscbm8xZYiATA":{"text":"This place is more about the jazz players than the jazz itself. They take advantage of tou","useful":6,"cool":1},"7MdOE7i6GpiSgQehpfJlrQ":{"text":"Paid $15 after standing in line for over an hour only to have to stand for the show OUTSID","useful":0,"cool":0},"OQCtGLzstaoG5CAlDRzPTA":{"text":"I'm a New Orleans local who frequents Preservation Hall.  It isn't just for tourists!  And","useful":0,"cool":0},"Owa1q5Y8vUU6JFBgbZ3HJw":{"text":"Damn good jazz at a great price if you show up and wait for the line do what we did and hu","useful":0,"cool":0},"qhXqZCcX3MUbi3c3iRNXsA":{"text":"Not sure if I've ever given 5* to anything, but this is a pretty remarkable experience \nSt","useful":0,"cool":0},"lHkAhm-lG9N0LwmeHX_WMw":{"text":"The music was good but the musicians are so burnt out. I have seen more talent and enthusi","useful":2,"cool":0},"hCzyilkFwdikeaY35YnHeA":{"text":"If you ever have the chance to go here it's a must. Preservation Hall is a very small venu","useful":0,"cool":0},"ThMyLJNKvGX9zlxegELCog":{"text":"Had to check this place out, it's such a New Orleans fixture. We splurged for the front ro","useful":1,"cool":0},"_CLmWhk96Crc1a7MWdBxeg":{"text":"Like a po'boy or a beignet, a night at Preservation Hall is kind of a must-do for a trip t","useful":2,"cool":0},"IbuRsi4i4idnV-9tuZdwow":{"text":"What can you say, when in Rome :-). \nIf you're looking for the classic New Orleans experie","useful":1,"cool":0},"bRtTdLV8V5zQ_qLwjJzACQ":{"text":"Really disappointed with this place. We paid $20/person to stand in the back of a tiny pac","useful":0,"cool":0},"ofXCpLdYNRrkNjwEgN_Ebw":{"text":"Great music and performance. Reservation is recommended if you don't want to stand for an ","useful":0,"cool":0},"voPYNHhAtzFYMximbhgYsQ":{"text":"Great way to end our first day in New Orleans! I would recommend getting the \"Big Shot\" se","useful":0,"cool":0},"kYRy3Cfojnv37570cu4uVA":{"text":"LOVE the feel and vibe of Preservation Hall..oh, and of course the MUSIC! The jazz just fl","useful":0,"cool":0},"FvXbuKpjohZ-bWwCy2on1A":{"text":"Meh. The music is not bad and the old school ambiance is intimate.\n\nBut the yelper's revie","useful":4,"cool":0},"0R5O0TKjnx2NHCmh6P5pfA":{"text":"It was like traveling back in time to the speakeasy era of the prohibition. Like it was in","useful":0,"cool":0},"badqageI39j7emCSD2120g":{"text":"This place is not quite a hidden gem but a gem nonetheless.  For me, no trip to NOLA is co","useful":1,"cool":2},"WcA-7pGDGWHkRfrgP1nRKw":{"text":"This place is a music to check out for music lovers. I came with a friend who found this p","useful":0,"cool":0},"mxoctzYnYNl2FXJ_2KzHGQ":{"text":"I think Preservation hall gives a very classic feel to New Orleans - at least I would like","useful":0,"cool":0},"VDk2gizP7W3AdLYbaOS8gQ":{"text":"This is the best cultural, spiritual, musical and fun experience your going to get in all ","useful":0,"cool":0},"RrgQPgwb_ORLbHTKOR1Gvg":{"text":"Wow. This place is AMAZING. My husband had this on our to-do list during our stay in New O","useful":3,"cool":1},"xF-aYShLq64ej67-vsR0Gw":{"text":"Live band was amazing! Made me wanna dance and I'm not even a dancer usually!","useful":1,"cool":1},"ZzMKPu5Bgw8aDOfo2mCh7w":{"text":"no nonsense, just great music in a crowded room.  really a unique experience, and i think ","useful":0,"cool":0},"LhG3aIYJGkuKs-bo9xBV3Q":{"text":"While every restaurant in NOLA has a jazz band, the experience at preservation hall is com","useful":0,"cool":0},"KmqjCfFYJh4zbCcr4yA8AQ":{"text":"This was the coolest thing we got to do in New Orleans. I would go again, and would buy Bi","useful":0,"cool":0},"UYKtF7DgCcJdVj8hYae-UA":{"text":"It was a really great small concert hall.  I requested Louise Armstrong's What a wonderful","useful":0,"cool":0},"bgbBo473A3BOs_OUqTBAHA":{"text":"So glad that my daughter and I were able to enjoy this iconic entertainment.  We knew from","useful":2,"cool":0},"C23wLdqimND_BYUL2U2A7A":{"text":"$15 cover. Support local live jazz!\n\nLine up an hour before the show to secure seating in ","useful":5,"cool":0},"12p4KlIiRBf4nYwwsdXpug":{"text":"This place is the standard for jazz in the French Quarter area. I've heard that Frenchman ","useful":0,"cool":0},"VqZiCzqwIQXWDy4_U15_3Q":{"text":"This is famous and there's a ton of history. If you get a change to catch a jazz performan","useful":0,"cool":0},"GeEC6scb74Lrvm_n6ZDbuA":{"text":"A great New Orleans experience. I enjoyed the show, which was put on by the Preservation H","useful":1,"cool":0},"NU018OMnQYOFPZMjdOwPFQ":{"text":"This was my favorite place in New Orleans during my stay.  Make sure to get in line at lea","useful":0,"cool":0},"jr0Egr8t05wt8AABkYke0w":{"text":"Truly moving music is played here every night of the week by some of the most talented mus","useful":0,"cool":0},"VHX9A3eT2Kl8qiZz8I_s5w":{"text":"I feel bad for only giving 4 stars, music was good...but the street bands and frenchman st","useful":0,"cool":0},"trW4dMfp0xT-EZagz1ZLTw":{"text":"An unforgettable experience! Arrived here at 7pm for the 8pm show and I got the last cushi","useful":0,"cool":1},"lW8AbuysmXgMkiVn0aVkAg":{"text":"Most amazing musical experience of my life. The lines tend to be long so I definitely reco","useful":0,"cool":0},"CB2e_I1Wt72EI2wmuzw2CQ":{"text":"I'm very sad to say that I didn't really enjoy my experience at the preservation hall. We ","useful":3,"cool":0},"GTDbobdm4whuXeKAX5QiRw":{"text":"This place is amazing if you are looking for a little feel of the speakeasy underground mu","useful":0,"cool":0},"oo95Pc7yIfq9kN5MacAiTA":{"text":"An amazing place, with the most beautiful atmosphere.  The interior is decorated with old ","useful":3,"cool":3},"7HkGpM3xD_sZvTJBwENlTA":{"text":"Truly outstanding. This experience left us (two extremely chatty Kathys) speechless. It's ","useful":0,"cool":0},"iFI0I_RhaGuvGb3SXQCgJA":{"text":"Music is terrific, but on the whole this entire show is a rip-off.  First you have to wait","useful":1,"cool":0},"g6qlr61Iiw8iCH4JMzogAg":{"text":"Preservation Hall is a New Orleans institution that should be visited and appreciated by b","useful":2,"cool":2},"8Nh4Y7cGWhoIsIW31APurw":{"text":"What a fun spot!  Not the biggest jazz fan, so wasn't sure if I would enjoy 45 minutes of ","useful":0,"cool":0},"YjLFvv-mXTPZ5QH9plZYdw":{"text":"Don't miss this place! I went three nights in a row.\n\nThe sets are the perfect length, and","useful":0,"cool":0},"-vzreNR7ws7yIupEeJhLzQ":{"text":"Finally got here on the most recent visit to NOLA. Really do yourself a favor and make thi","useful":0,"cool":0},"VG-GLolqBXGKVzEb5R6iwg":{"text":"I don't even like jazz that much, but every time I go to New Orleans, I ALWAYS go to Prese","useful":0,"cool":0},"tslTAMsi3Uk1cknUekpGFQ":{"text":"This is the real shit man. That s why we all come to NOLA. Bring your own booze, awesome m","useful":0,"cool":0},"6D21-suz_-rIQVYaHs23Xw":{"text":"This is one of the only places to hear real NOLA jazz in the French Quarters.  A must go, ","useful":0,"cool":0},"2bkZPA3MmeF2ANwPrs65Bw":{"text":"When in NOLA you've got to make a point of coming.  This is the heart of jazz origins. Whe","useful":2,"cool":1},"4Cmq76SQoGLvFraS3YegsA":{"text":"Legendary. The venue adds to the experience. You can do a reserved seating online which is","useful":0,"cool":0},"Dm9bsWyd8CxXlLhlaBPfTw":{"text":"This is the real deal. Opted for the $30 reserved tix so that we were guaranteed seating w","useful":1,"cool":0},"9B2KcxIh5XqUujt6du-b6w":{"text":"This place is a definite place to visit when visiting NOLA. This place shows history and t","useful":0,"cool":0},"MwiJaeUorZOsg91BDVOvEQ":{"text":"This historic music hall offers a fantastic first hand experience at real NOLA style jazz.","useful":0,"cool":0},"K4uHF6ljRwvpRKO5XM4C3Q":{"text":"This is a must do. This place has been around since the 1960s and has been a host to thous","useful":0,"cool":0},"ggjT_5U-jus6xTV6EqKZuA":{"text":"Jazz was excellent but short.  Sets are one hour.  Best to buy reserved seating tickets as","useful":0,"cool":0},"4GCvCl_0AS0fZ1DmWmk5og":{"text":"What ever you do don't pay first. The show didn't start on time. We paid $45 each for tick","useful":0,"cool":0},"IdtmJG4VvkF12_8IymFDMQ":{"text":"The longest line that we were willing to stand in. There are several performances per nigh","useful":1,"cool":2},"NW7jhR-CfS-fTs6pDD3x9w":{"text":"Can't say enough great things .... tickets are super affordable ($20 for an 8 pm show on a","useful":0,"cool":0},"IAhyzn_2eFoZzAD265oHAA":{"text":"You pay a high premium to listen to a very short set at this historic venue. $15 for a fou","useful":0,"cool":0},"AWO-gMmja1YbJg5vJ7Ywpg":{"text":"Best experience ever!!  Evening was lovely, not the heat or odor others have mentioned.  D","useful":0,"cool":0},"FRJ6vTmTjWYKMGOcChe-CA":{"text":"There are no comfortable seats, bathrooms or air conditioning. The concert is only in a sm","useful":4,"cool":1},"pnjwDwXyOa-0gfgXSeHXUQ":{"text":"Very intimate.  I felt like it was a privilege to be there and watch those talented musici","useful":0,"cool":0},"WiHYNMCspokWv58LsWdaxA":{"text":"Waited in line for 45 min for the 10pm show because we heard it was a must see. The venue ","useful":2,"cool":0},"MDDotPSwwAj0D54L44laCA":{"text":"My bf and I were in town for Mardi Gras, but we actually didn't spend a whole lot of time ","useful":6,"cool":5},"4S-HildZ79idYXd9bPry0w":{"text":"It's preservation hall!! arrive early, have CASH. No cell phones. \nI recommend getting a h","useful":0,"cool":0},"oMQXTlYAtZHqGvfrmVSqDg":{"text":"Honestly one of the best musical experiences of my life. The Preservation Hall Jazz Band i","useful":0,"cool":0},"XykLUFJzl7V9n9M_zs9xyg":{"text":"Definitely a MUST-GO place in NOLA. There're so many jazz clubs in French Quarter, even a ","useful":0,"cool":1},"Oad9xvc_8ZXAGjUu6u1bMA":{"text":"What an amazing hole in the wall, literally! This place has not been modernized or renovat","useful":2,"cool":0},"JCJiLCTVYsjnSh5XYbVR_A":{"text":"If someone were to ask me what ONE THING should they do while in New Orleans I would answe","useful":2,"cool":2},"Xt6qGl_FtSmsJxyb363lRQ":{"text":"It was everything I'd hoped. We had standing-room only tix, so the short performance was a","useful":0,"cool":0},"wjcjh5CQT5QAjralP15cxQ":{"text":"By far, the best part of our trip to New Orleans. It was magical. Here's how it works. You","useful":0,"cool":0},"Ee35FUYFw9nmTba4edc54g":{"text":"I was never big on jazz until my visit to New Orleans. You just can't be in the city and n","useful":2,"cool":2},"axG650pPB0Zx5pm1EfrqQA":{"text":"You need to come here at least once. Around 8:45pm, we stood in the back of a long line fo","useful":0,"cool":0},"zAOMutcqoarLkaL6sQIxLw":{"text":"Do yourself a favor a buy $40 Big Shot tickets- you'll skip the line and be escorted to so","useful":1,"cool":0},"1-PA0grUIHbcrYi0ezi1rg":{"text":"Sweet. Historical. Quaint. Popular with a well attended to wait. Fold up chairs would be n","useful":0,"cool":0},"9vonjND0Psba0XXgDXQGAw":{"text":"This place was the highlight of our trip! Highly recommend reserving seats in advance. You","useful":0,"cool":0},"HTmm1Mixxu9msmZjPwh9Ng":{"text":"This is an old, beautiful building that just whispers old New Orleans Jazz.  This is THE B","useful":0,"cool":0},"5p2AeweVKi5eoaxgaKVjYQ":{"text":"I wanted to buy the $40 tickets so that we could sit down but they didn't have any availab","useful":0,"cool":0},"j2VyZv7cOWJDZNHfrVF9kw":{"text":"An absolute must if you're visiting the Crescent City.  The jazz you hear here is the best","useful":2,"cool":1},"UKvcPXwWHI2rFKrbVnQL2w":{"text":"Talented musicians, commercialized \"jazz\" music, but a good time overall.  \n\n$15/person fo","useful":0,"cool":0},"R82FzA7-z-VwtOsWCC62EA":{"text":"Worth every minute in line. And you will wait in line, but you will not regret it. You are","useful":0,"cool":0},"No6Mf34nMO1_9byY1z5iGA":{"text":"This venue is intimate* to say the least. \n\n$15 cover will get you up close and personal w","useful":6,"cool":2},"naVxeNt8Wsnuzg-NCwCvKw":{"text":"One of the coolest and unique experiences of my life! There are no words for how spectacul","useful":0,"cool":0},"Sicqs-7MfgzXGmyz-qrWyg":{"text":"I enjoyed the music at Preservation Hall. If you can stomach the long wait in line and pri","useful":0,"cool":0},"WaB4QmtSPqFRC_U7I9_3hg":{"text":"The word \"special\" is often overused-- but at Preservation Hall, it applies.\n\nWhatever you","useful":3,"cool":0},"yRFQU3p4wUebgZ-iPEWseg":{"text":"The Jazz is amazing! The seating is not. Do not pay in advance! Get on the general admissi","useful":0,"cool":0},"dxAwZpHEx2lY3lbimsHifw":{"text":"Why the heck is this place popular?  My only guess is that some people who are new to New ","useful":3,"cool":1},"izAOQVzi5oQAwophEM8yyw":{"text":"A must stop on any visit to New Orleans..I mean seriously this is where it all started.  I","useful":4,"cool":5},"s40tKbJO4KZ8jrClSP3fSg":{"text":"*Please note I am not a fan of Jazz music nor do I appreciate it\n\nThis is definitely somet","useful":6,"cool":1},"6lSYWtgO43loNvDrXimbUQ":{"text":"The most amazing experience ever !!! Worth the wait and it was only 15 dollars cash!  Ther","useful":3,"cool":2},"oNXEEY1isFv4jIX4HYmVjQ":{"text":"Let me start by saying I love music... I bought the most expensive tickets because my 84 y","useful":1,"cool":0},"uVyatLNq9a3lHm7PoICtIg":{"text":"Not enough good can be conveyed through written word here to fully describe how amazing th","useful":0,"cool":0},"LYb9jbuG58s00lEeCBsc0Q":{"text":"If you live in NOLA or are just visiting, Preservation Hall is a must!! It's well worth th","useful":3,"cool":3},"8X7LstVshXBZtLM3r1Z0rg":{"text":"Whatever history this place has been sold to the devil and become a tourist trap.  My wife","useful":0,"cool":0},"pAHsruDvqt0a5DoFbQpAsA":{"text":"Excellent bands, wonderful 'historic' place for live music! They had a fun stage at Voodoo","useful":0,"cool":0},"cLKvOMdOjxMmMI2F39g55w":{"text":"A must see in New Orleans. The musicians are incredibly talented and put on a great show. ","useful":1,"cool":0},"1sQCzrCQFX7DdW2-RpYgXA":{"text":"When in New Orleans I think it's imperative you go honour the birthplace of Jazz.  This pr","useful":0,"cool":0},"XrLBlbRIWnVvgxYjxXuATg":{"text":"I am glad we stood on the line because it was an awesome experience. The place is tiny and","useful":0,"cool":0},"4kJ7dvoegBI5afy0r180Cw":{"text":"Showed up at 8:15 and were told it was 45 minutes to next set and that there's no drinks, ","useful":0,"cool":0},"mJBcKwFY1KyijBqHYvBJXQ":{"text":"Amazing little 30 min jazz show. We waited in line for about 20 mins with the previous gro","useful":0,"cool":0},"3StBaSgLSI23RTIA30IA2g":{"text":"An absolutely classic and wonderful experience. Cramped, hot, small room...filled with som","useful":1,"cool":1},"jHqum90dHjh3nX1h-srBSA":{"text":"I didn't hate the show -- just didn't get the big deal about this place.  Okay okay, it's ","useful":4,"cool":1},"vM-SSVtIgXgOCMsDNrbq3w":{"text":"My wife and I were in New Orleans and they have a $15 show on Sundays at 6, so we got in l","useful":3,"cool":2},"9nwXHP9rk8C7lcDMTtAVIw":{"text":"It's an incredible deal that you can see a show at this famous venue for only $15 - althou","useful":2,"cool":1},"iOcnq_9nZ5Iv5SOCH7WGYw":{"text":"This place is legit!!  I'm talking about better than the freaking Catalina Wine Mixer legi","useful":1,"cool":1},"pQweO_j_BdMZ7jZnvROCGA":{"text":"I had a great time at the Preservation Hall. The woman standing in front of the gate deleg","useful":1,"cool":0},"IOMId0acEAlgvuxqkKoyHQ":{"text":"This is a famous spot in the world of jazz and I stood in line and waited to see the 6pm s","useful":5,"cool":3},"aK5Kxhx3_zYI0uuaL361Gg":{"text":"This is clearly my preferred jazz venue in New Orleans! Outstanding - and often funny - co","useful":0,"cool":0},"N96mKckWlve9Co844A-O7w":{"text":"Love the acoustics in this place...the band always does a great job livening up the crowd ","useful":2,"cool":1},"nJc7Dna6RRTlWg_S1rTTdg":{"text":"What an amazing treasure for NOLA and those who are fortunate enough to venture in from th","useful":0,"cool":0},"-OIZhqSKHwE4OWNw4MUtEg":{"text":"Preservation Hall lives up to the hype, the name and the legacy. This venue is very intima","useful":6,"cool":0},"jWeKNF67sLKI9TpvflkoOQ":{"text":"Free Jazz bands throughout the French Quarter are MUCH better. Don't waste your money here","useful":1,"cool":0},"HEbV2CKo6sverlfkoF_CYA":{"text":"If you are a jazz fan. You must visit while in town. Get in line early. Don't drink too mu","useful":0,"cool":0},"FFlbrJVFDgkhyLPU7hnTPQ":{"text":"On one hand, the place's interior and exterior ooze history and character.  On the other h","useful":1,"cool":0},"lSdLTJwkIv5e4VyulUvbOQ":{"text":"Awesome.  If you're in New Orleans and like jazz, you must go.  We went on the Friday afte","useful":4,"cool":1},"jEQQSW-7X9oSUzVsoPjqBg":{"text":"Long wait on line outside to get inside to the dumpiest venue I have ever seen.  I am way ","useful":0,"cool":0},"g95sDJh15zF3-Gz5-G3m2A":{"text":"This place should not be as famous as it is...It could be so much better than it is. We wa","useful":5,"cool":1},"wD8j7of3nlQZqjpClqqF3Q":{"text":"This is not to be missed.  What an amazing experience to witness those so skilled in their","useful":0,"cool":0},"oVWuo3inZPZfUWszymDr4g":{"text":"a MUST do!  Saved it for the last night before we left as a bang before the end of the tri","useful":0,"cool":0},"ecf_UxqEFchKKJ5aeBUSBw":{"text":"By far my favorite experience of the entire trip! Very small but cozy and full of history.","useful":0,"cool":0},"sMMeTfiX4JaKib-ApHz1uA":{"text":"This was, hands down, the best money spent in New Orleans. It's a must see and I will make","useful":0,"cool":0},"c8yi0hOQUfpib8t2V6cRQw":{"text":"I have always wanted to go to Preservation Hall and I finally did. \n\nIf you never go to he","useful":4,"cool":0},"lICc9OgO6otWFBr7uG2CsA":{"text":"I went to listen classic jazz in New Orleans and was utterly disappointed. leroy Jones and","useful":1,"cool":0},"6noNLtTQ2De6KoiEOwcgFg":{"text":"I am so happy I made the decision to see a live show here. I went to the 8pm show. I got i","useful":0,"cool":0},"4oLK3G4bfPxC4Jj_nbS13A":{"text":"My girlfriend and I came here on a trip to New Orleans. I am a music lover since birth and","useful":4,"cool":1},"VKP2b8_c-WLCIwWCqVAlBQ":{"text":"So here's how it works (I think).  They are open from 8:00pm until 11:00pm and do 3, 45 mi","useful":0,"cool":0},"9JYsGCGOYkgFB4LzExBsRw":{"text":"Preservation Hall plays music from 8:15pm-11pm, Thursday-Sunday; tickets are $8 and go on ","useful":0,"cool":0},"_r7Z8qlpcwEYqbqvBogV2Q":{"text":"Love this place !! Compare to a Jazz Bar, this place has no food no drinks ( sometime even","useful":0,"cool":0},"rePWBlkIUKhlR9FE-yHIew":{"text":"Great show. The show at 8 is the busiest. Get in line with a drink from a nearby bar at le","useful":0,"cool":0},"7gPI3fioegxF34v6jU9RFw":{"text":"You cannot leave NOLA unless you visit the Preservation hall. True jazz, the way it was me","useful":11,"cool":10},"M5CQSWbBFHW29h3G4YR4Zw":{"text":"Absolutely worth the wait! And frankly, you want to be in the beginning of the group or th","useful":2,"cool":0},"q6odLNaqiob5tJHtKCWBuA":{"text":"This place feels much older than it is (art gallery from 1961). It's as plain jane as it g","useful":0,"cool":0},"HiAAHrkZtPzJHcGZoJoebg":{"text":"What can I say? This place is incredible. If you want a true NOLA music experience, this i","useful":1,"cool":1},"Qo3mCQs9NA4b2HDrP_Yu5g":{"text":"This place is just art, from the moment you see the trombone case sign on top of the entra","useful":3,"cool":0},"vltDPA9AeY3WTjsmZiOLEA":{"text":"My friend and I were really lucky- we didn't have to wait in line as most yelpers wrote in","useful":0,"cool":0},"eq8s6esurbxLvV8SlraJDw":{"text":"As a music buff this is my jam. The history of this hall is astounding as are the musician","useful":0,"cool":0},"WSmHP-fRs0Q7mpIGyMDPHA":{"text":"Great. Great. Great. Hey, did I mention that it's great? Went to this place about a year a","useful":1,"cool":0},"oHr1DvxLFpPA5TZ5EUBQzQ":{"text":"A highlight of our trip to NOLA!  We were practically sitting in with the fabulously talen","useful":0,"cool":0},"PsOD9FeXz0bHzFeJ-yYV1w":{"text":"A true New Orleans gem! I'm so glad I checked this place out. The line was quick and we go","useful":0,"cool":0},"7X2rmq-r7TD57nUxTNHAfA":{"text":"We brought our 2 month old and they were very friendly about us bringing a baby even showe","useful":0,"cool":0},"bZhAtZxXPcUaDzCythuRdw":{"text":"This place is nothing short of an institution.  If you have any love for live music, then ","useful":5,"cool":3},"IKKGqxxgOlSiT5Sp_F4yQQ":{"text":"Preservation Hall is a HIDDEN GEM! The outside looks like nothing when you walk by but whe","useful":1,"cool":0},"Xkymz6vpC0JcXKCB3OO8pQ":{"text":"If you want an authentic New Orleans jazz club experience, THIS IS THE PLACE.\n\nHard wood b","useful":2,"cool":1},"Wjr_j4Re7fbV7bglKxB4EA":{"text":"I recommend going to a show at Preservation Hall at least once if you are visiting New Orl","useful":4,"cool":2},"ABWLlMR7Ukn51aNjFEdU1A":{"text":"Amazing!  Another must do thing when visiting New Orleans.  We arrived about 30 minutes be","useful":0,"cool":0},"N8cbjeQK-q3HkWG90ia4kg":{"text":"Very authentic experience. Musicians were absolutely amazing. Arrive 45 min before start o","useful":0,"cool":0},"VQtWt4u8Y3WbzfJ8q9NJUw":{"text":"We were so excited to be in new Orleans & I was told this was a 'must go' place.  We waite","useful":10,"cool":3},"tzr5RhJXVqQMSNLsW3rpvw":{"text":"Definite must-do in NOLA!  Reserved tickets (1st 2 rows) bought in advance definitely wort","useful":1,"cool":0},"bG_UHjSqY0Q1ozZeTxoAdA":{"text":"Watched the masters at work at last night's 8:15 pm show! Amazing that I could close my ey","useful":5,"cool":2},"InFImISbULH1pdFIdFsc3w":{"text":"Came here 2 nights in a row.  First night, we gave up waiting in line about 30 minutes in ","useful":0,"cool":0},"YHdrxbTa4yFKoMjo5J4YtA":{"text":"Incredible experience for $20.  A must-do when in NOLA.  Have one of your party get in lin","useful":0,"cool":0},"gSxe9g49Kv-c3m2JOlVxFQ":{"text":"This show is definitely worth seeing!\nWe were unable to make our request during the set th","useful":0,"cool":0},"c_7tgVOYLRF1QlVhst_AEQ":{"text":"I didn't really know what to expect when my  friend recommended that we check this place o","useful":0,"cool":0},"z-9eE_FHDCikfOO4yYQ69Q":{"text":"Give me that ol' time jazz! \n\nI came here during the French Quarter Festival, and enjoyed ","useful":0,"cool":0},"3TWog9V0Cd9TobEqu9seAA":{"text":"Hands down, a must do in New Orleans! Be a \"Big Shot\" and buy your tix online. Not only do","useful":0,"cool":0},"FX09nbesccwmFFkXEhZimQ":{"text":"We went on a Friday night for an 8 pm show. Got there around 730, and got in line. We ende","useful":0,"cool":0},"ESfj6hIv5gchSr9bLiMpXg":{"text":"This place was awesome! The Jazz musicians that come to play here are definitely some of t","useful":1,"cool":0},"1SkxCS6k1wRwGlNKAMNpWQ":{"text":"An absolute must-do on any trip to New Orleans and worth every penny. If you arrive 1-2 ho","useful":2,"cool":1},"d0AjNg79POehefnuIhOcdg":{"text":"This was a great New Orleans experience. Where the original Jazz era of New Orleans begun ","useful":0,"cool":0},"zhqy8Hon-UkRIdcoi4ujjQ":{"text":"First visit to New Orleans, first visit to the hall...\n\nIf the jazz on the streets of the ","useful":0,"cool":0},"IdCfICDGvXGUXnGgsymRxQ":{"text":"Catching a show at historic Preservation Hall is a singular experience. If you love jazz, ","useful":2,"cool":1},"mra9BnJZOdgonWTV7ZJ6gA":{"text":"Cool stage and setting but the long line and wait really killed it for me. Waited in line ","useful":0,"cool":0},"i9LMpzzjGapytRkK-ujNPg":{"text":"Get in line early, we didn't and I ended up in the very back (standing room only). I'm sho","useful":0,"cool":0},"UymomMUp8zmX75iX0gAlUw":{"text":"This felt like I stepped back in time :) the gentlemen were dressed in ties and sporting g","useful":0,"cool":0},"0ys0Abc8w2AfXMKlK4c0Rw":{"text":"Excellent atmosphere in this little simple place. The band plays great music and make the ","useful":0,"cool":0},"yWvwAeyWPIZQtUF4I0jhvQ":{"text":"Simply put, my most memorable night in NOLA. The bad was amazing. It gets extremely hot, I","useful":0,"cool":0},"q1mZMHJTZIetV2Wjx-Cekw":{"text":"What an AMAZING treat! Didn't know what to expect and I am so glad that I went. The music ","useful":0,"cool":0},"pGhmdBy4nTjYBA9pECeT1g":{"text":"Went here with my buddy Jennie whose brother is best friends with Ben, the owner. Each Chr","useful":1,"cool":1},"azv0T6GOZhA025Edm2MSag":{"text":"We purchased reserved seats. The -ve's far outweigh the +ve's\n\n+ve's: The musicians are ve","useful":0,"cool":0},"PO4XdLMmPaYEgkf_-tY2PQ":{"text":"This place is all about the music. You can bring outside drinks in but remember there is n","useful":0,"cool":0},"2D39GLlF1XY3jijlAgDd0A":{"text":"This was the moment that I fell in love with New Orleans.  The hall opens at 8 and we stoo","useful":5,"cool":3},"TAwVuNyam5qlG3Bd6euKhA":{"text":"We went to this show our first night in New Orleans and I've had the music in my head the ","useful":0,"cool":0},"okxwjv085vBAh1Oacyaf5Q":{"text":"I get some of this. The music was very good, and the history of the building does bring am","useful":4,"cool":0},"tEARoHzDO6S7VTq801rYKQ":{"text":"Amazing show!  Very small hall (non air conditioned, dress comfortably!) so you are up clo","useful":1,"cool":0},"b_F7fHijvTVbdDRyLf5ktQ":{"text":"If you're claustrophobic this is probably not the place for you. If you don't mind being p","useful":1,"cool":0},"xz265GUdtqMeO2CONiXTuw":{"text":"This place is amazing. We did get in line about an hour and 15 minutes prior to the showin","useful":0,"cool":0},"wSniwbglY0ex0l4QzBNFjA":{"text":"Ah Preservation Hall...the one place where I will always tell people they must go to when ","useful":5,"cool":6},"EtDc61sFYLVccoHBsp8d8A":{"text":"How could I visit NOLA without paying Preservation Hall a visit?\n\nMy sister and I ordered ","useful":2,"cool":1},"SfuZXGBgxnCOrGkElRZB1g":{"text":"Great jazz - a true original experience. We opted to pre-purchase a second row seat - well","useful":0,"cool":0},"0sb7jS-cvXuo_SZH5fgYKQ":{"text":"Real music, real history, real cheap.\n\nTo be honest, I paid $5 my first time (somehow I go","useful":0,"cool":0},"KJlvWAjTmTTHeYpjgOaLIw":{"text":"Underbar legendarisk jazzlokal. Första showen börjar kl 20 och andra kl 22 men man kan dro","useful":0,"cool":0},"UlCG1hdRApaiyIEEA_dIiw":{"text":"I was disappointed.  I have been multiple times and this last Saturday night we had a five","useful":0,"cool":0},"D7FKwlMaaWO1KM4v7kNSMg":{"text":"This is a classic destination for the jazz lover. MUST do. Authentic in an almost grungy w","useful":0,"cool":0},"IjkqxXAJWAtswByK_YYOGg":{"text":"This place will have you stomping your feet to the good time tunes, snapping your fingers ","useful":1,"cool":1},"ocelmtbI8W5A5GmeB7f1Iw":{"text":"must go if you're in New Orleans.  don't think about how  \"authentic\" it really is, or any","useful":0,"cool":0},"OYFBYm5n5q0NLpqP7qoFkg":{"text":"Music lovers unite! Here lies the epitome of jazz. Each night with different players, rang","useful":5,"cool":0},"mXbd0YxyJymZBw4X0bKZmg":{"text":"Corinne Bailey Rae with one of the oldest and greatest jazz bands in room for 40... Sigh..","useful":0,"cool":0},"3irY7cp16RprPHt561eeUg":{"text":"Wow. Anyone that tells you this is just a tourist trap is lying or confused. This is some ","useful":1,"cool":0},"sHYla6p4DAVUQ_CNSd9S8Q":{"text":"When in New Orleans this is one of the things you really should do. It only takes an hour ","useful":0,"cool":0},"7njmSkiiXrOlEt9mv00IOg":{"text":"Dont be a cheapo and get the $15 tickets for standing outside for an hour, drop about $45 ","useful":2,"cool":2},"qbf3M25gaYOw8Qvv13JsXw":{"text":"Holy cow! I am not even a jazz fan, and this place is totally awesome! The southern syncop","useful":0,"cool":0},"diua9kh7t90PeGZpKZdLFg":{"text":"Absolutely fantastic!  This is a place where you'll make awesome memories that last foreve","useful":0,"cool":0},"2u0be3N-BledlpcY6Iqjhg":{"text":"I came here not knowing what to expect, and found myself in a room the size of my studio a","useful":1,"cool":0},"rAcRCL60BKfDHWO6xb_oVg":{"text":"You absolutely have to check this place out if you are in New Orleans. Intimate, authentic","useful":0,"cool":0},"0ougQXemqFB43UOreVr4mQ":{"text":"If you like pure New Orleans jazz, then don't miss Preservation Hall.  Arrive early (easy ","useful":0,"cool":1},"skWIuW4VFORbcEK3yj8ejA":{"text":"Greedy all about money not enough room for pay customers had to stand and couldn't see per","useful":0,"cool":0},"2MUyYPDLsPOOFaQEz-HV9Q":{"text":"Here's what I liked about Preservation Hall:\n\n- It's famous! You pretty much have to come ","useful":1,"cool":1},"TUS14k49qFkC6OSbz1LNzA":{"text":"Preservation Hall is amazing. Took the good advice of their website and pre-paid for ticke","useful":0,"cool":0},"6zw6cplNW7pwnwvExn-BWQ":{"text":"We had an awesome time at Preservation Hall. We lined up a little after 7P for the 8P entr","useful":6,"cool":3},"ykrsLHqeaGqYXHfTkdRwgg":{"text":"The music is great but they push so hard for tips its actually annoying.  In addition they","useful":3,"cool":0},"MOizySnIOzHt-Cj0CFT5FQ":{"text":"Preservation Hall will change your life, along with any reservations you have about classi","useful":1,"cool":0},"X2qHs1kT5EjbGIGGaOPaMA":{"text":"Preservation Hall goes on the list of sacred places such as Castro Theater in San Francisc","useful":3,"cool":2},"hNX0m11NaxwK6QgrQ08rlA":{"text":"Excellent night of jazz in a hole in the wall! Stood in line on a Friday for 15 minutes, a","useful":0,"cool":1},"pT4WOKtM2aJ2p1g-t1r9hg":{"text":"Preservation Hall is something everyone should do when you visit New Orleans.  It's part o","useful":0,"cool":0},"-0d1sU2lZoQrIXgRDSm38Q":{"text":"This place is incredible and one of my favorite places in NOLA...As some people said, I fe","useful":10,"cool":3},"DIKQNt6pJse3UAPL9wj6cw":{"text":"Simple - an evening of live jazz music in the middle of French Quarters, New Orleans. How ","useful":1,"cool":0},"tDOrr1dIC8uzCFg_l_3qHg":{"text":"What a cool spot. We sat on floor cushions right in the danger zone of the trombone and it","useful":0,"cool":0},"E73ErcBOZ0cC4DIWRVAI9A":{"text":"What can I say about this place that other's already haven't. Music feeds my sole and I de","useful":1,"cool":0},"wzZEs2qXiA_tQwW5mvSDiQ":{"text":"If I don't have to pay 135 including tax for 3 it be a five star.  Performance was great o","useful":0,"cool":0},"8PLhDdxpNzQRkSh8La7huw":{"text":"No lover of music or history should miss this place.\n\nYes; the line can be ridiculous.\nYes","useful":1,"cool":0},"woTvIgBGMDBpSYNa48VlpQ":{"text":"If you are a serious jazz lover you will have an absolutely amazing time. I'm sure there a","useful":0,"cool":0},"lA9WgMFO3rEPZCvnTFQBew":{"text":"i went here with my dad.  he loves jazz.  he had been in 1965 and wanted to check it out a","useful":3,"cool":3},"QikhiGpDc0SCy9LceKGVWw":{"text":"I love love love this place! \n4 stars because of the smoking. \n\nI feel like I walk back in","useful":1,"cool":1},"hIhbTL0steXoArQWSOq1bw":{"text":"Probably not worth the money or the effort, but there are worse causes to give your money ","useful":1,"cool":0},"YaQ92nBJpm8i-ecMhFe8EQ":{"text":"Listen to the other reviews - show up 30-45 minutes early and you'll be guaranteed one of ","useful":3,"cool":3},"Z2wdtzG69gOVIDCFMFu-gQ":{"text":"This was the first jazz club I've ever checked out.  The rustic setting was great, very sm","useful":2,"cool":1},"_f78sNm5KHPgyw_mkzEjMQ":{"text":"You feel the jazz experience.  Hot in there..so you will sweat.  It's musty, standing (if ","useful":0,"cool":0},"UaDXcwsToyTUGYbqMt4LRA":{"text":"This was my second time around and I got tickets prior to the show. It's totally worth it.","useful":0,"cool":0},"9FFNMdJgqTmUYxlrrphcmQ":{"text":"Amazing! Must do while in NOLA. We waited a little under and hour for the 10pm showing and","useful":0,"cool":0},"D26qH0T0z1jeJG9MDmMIxQ":{"text":"Pretty sweet Jazz played here as this was my first NOLA jazz spot we hit up. We walked in ","useful":5,"cool":4},"PvVUdEKR3c5c2pBqmGYO1g":{"text":"Great music, great atmosphere. They made our best night in NOLA. If you decide to buy the ","useful":0,"cool":0},"clxN21KRRvf6eZuF5HbOhg":{"text":"Recommend to visit by friends we thought we would check it out. Shows at 8,9 and 10pm $15 ","useful":1,"cool":0},"44WBhf2DUtQQRmen2J3oQQ":{"text":"Maybe Preservation Hall is important and historical, but it's probably not worth your time","useful":7,"cool":0},"J3ZmWRY6VggO-fLoLJQXOQ":{"text":"I had such a great time here! The night when I went, the Preservation Hall Jazz Band was p","useful":1,"cool":0},"z1HZy0cD8iwW5VPWVnabNQ":{"text":"The music is good but the lack of drinks is terrible.  It can get very hot in here during ","useful":3,"cool":1},"IAJqyOj7e9qJ2KwSCaIbyQ":{"text":"Other than Irvin Mayfield's Jazz Playhouse it's true that Preservation Hall is probably th","useful":1,"cool":1},"7pY1TvNm0XaLOKFq4lMMIQ":{"text":"We had a great time at this wonderful institution. They had a guest trumpet player who loo","useful":3,"cool":2},"X4yK_lFQgPva_Th1IgOp9A":{"text":"Very historical - great old Jazz band for a 40 minute set.  Few seats and mainly standing ","useful":0,"cool":0},"DaYLD6VZxCkog0R-aTMZ_g":{"text":"Tiny and rustic spot. No real way to explain the brilliance of this place. If you want to ","useful":1,"cool":0},"3Gdb7jVxVS5oizfLZtl15A":{"text":"This is a neat old building with great musicians but I'm not sure if it's worth $15/person","useful":1,"cool":0},"8P6BVxYMsAxVuz20WESM1w":{"text":"Going to Preservation Hall for the Creole Jazz Christmas show was one of the best decision","useful":1,"cool":0},"Sj4k6QaVe3JQqGMlrp3HFA":{"text":"I suppose I'm a little biased, since I spent my first 46 years living in south Louisiana. ","useful":0,"cool":0},"pz5wab0R9wSJNi9N9ftz_A":{"text":"if you like jazz, this place will give a 45-minutes bliss :)  there are many bars featurin","useful":0,"cool":0},"nMNb3Me4yqascBpEzSl6bQ":{"text":"Stake out the door starting around 7pm if you're hoping to see the 8pm show, or just purch","useful":0,"cool":0},"PrMT42zhs1T2lyw2Irjd5A":{"text":"Pay for reserved seats!! We arrived at 7:15 on a Tuesday evening and the line was already ","useful":2,"cool":0},"Tg9AYEZpHc_PEtDMR699XA":{"text":"Cozy little jazz hall... tourist or not, one must come here to experience what real jazz i","useful":0,"cool":0},"dSnEd9MtBuwoCA-PmNeong":{"text":"Not really the place itself is five stars (it's pretty run down) but what makes it 5 stars","useful":1,"cool":0},"a85p9jUiMRcfHdkgw3WRLA":{"text":"Awesome experience!  The band was fantastic! I wish I could go back every night! $15 at tg","useful":0,"cool":0},"5_rDjoEcFJ7rRpFOngEAtA":{"text":"Over Priced Venue\n\nAs others have said, be prepared to be packed in this small venue. If y","useful":3,"cool":0},"MgpBewaEOzZFalTf5BNv6w":{"text":"Because of its history and its reputation, I really wanted to give it more stars. I wish I","useful":0,"cool":0},"0zACVp60t7Ekc6h_wiT5SA":{"text":"Everything you hear is true. This place will transport you back to a time when jazz ruled ","useful":0,"cool":0},"lcdR_aYFs-yoEofOjOvoUA":{"text":"Definitely a high-point in my short trip to NOLA. I was never a Jazz fan so you don't have","useful":1,"cool":0},"Fn1JRHt-YCoqtk-Mi9NIGA":{"text":"Buy the VIP tickets.  They are worth it. No need to stand in line.  You get up close and p","useful":1,"cool":0},"sZrdYAFx8tOrpZWduet8EQ":{"text":"Super small, hot and crowded room with no restrooms, serving and air-conditioning. But thi","useful":1,"cool":0},"8kw-f3DkoGeLMMcaXsxf9A":{"text":"Must must must must mustttttttt.\n1st visit to nola, the one thing I regretted not doing wa","useful":6,"cool":0},"muqlnJ-Ug-WIXItKbuH-hA":{"text":"A MUST when visiting New Orleans, especially for the first time.  You can't come to NOLA a","useful":0,"cool":0},"VrtyAFKhARcdiftrJFFSQA":{"text":"This place makes believe that music has serious souls, again. For a long time I didn't und","useful":0,"cool":0},"fUhyetxBn6jsm6dgjFp2lw":{"text":"This might be the toughest review for me to write because EVERYONE knows this is the place","useful":0,"cool":0},"ZMIbM8LUwLvAoN0TJfJHcA":{"text":"I read reviews from all over the net and decided to give a try...\nomg.. I had an excellent","useful":0,"cool":0},"ChTh3UBSqbY87b64gu8gIQ":{"text":"Go to Preservation Hall!  I think I am going to make t-shirts that say that to wear around","useful":3,"cool":0},"lWmec-6cEc209telCpGj3A":{"text":"Hard to get advance tickets. The place inside was very small and most people had to stand ","useful":0,"cool":0},"q5UoCyR7CrLk4ezdXfxaGQ":{"text":"It is a land mark.  We made time to go.  We bought our tickets a few days in advance and h","useful":0,"cool":0},"mcZ7WtchWE9D12qoWSbHeQ":{"text":"Preservation Hall is perhaps the highlight of my entire NOLA trip. Although standing in li","useful":0,"cool":0},"xs-tA8Mwr1FjCSvvBJ0pwg":{"text":"My SO and I visited twice while in New Orleans, and while both occasions were great, the f","useful":3,"cool":1},"7OfKJVK6xxjAulyn7qo1_w":{"text":"Real authentic experience, i enjoyed my time here, very intimate setting, good music..a tr","useful":0,"cool":0},"8hiV-MjdVjuo3Z4nQmnayQ":{"text":"Definitely a great experience to do at least once in NOLA! The line is long, so get there ","useful":0,"cool":0},"XJs4HC4MLD3p5LUdi4FlEA":{"text":"Definitely experience that cannot be missed when in New Orleans. Worth the price and the w","useful":0,"cool":0},"QQsY0BmL0ycaQkpEOdgHrQ":{"text":"This place is a must for true jazz music if you end up in the French Quarter.\nAs others ha","useful":0,"cool":1},"f2VG_waE9wgPLQ2nYLdpwA":{"text":"I had a fun and engaging time at Preservation Hall last night. I went for the 8pm show and","useful":1,"cool":0},"O4hdA74a4UXdC7QTHkeK_A":{"text":"My visit to Preservation Hall was one of my favorite things about my vacation!  We went wh","useful":4,"cool":0},"nvlXAWy1Qyw9WUB1g7grcQ":{"text":"come 40 min to an hour early especially before the show 815 show as that is the busiest ti","useful":1,"cool":0},"jtfGix84cYtdnOQ_n_8Hug":{"text":"Preservation Hall is a MUST for anyone visiting New Orleans! It is a hole in the wall venu","useful":0,"cool":0},"bcggrRDVvxCUIxHaOSL8kg":{"text":"Preservation Hall was the highlight of my NOLA visit.  This place is a time capsule of NOL","useful":0,"cool":0},"1DdP-00VyAN4aiRQZxKBGQ":{"text":"Amazing place, great music, totally worth paying extra for the better seats. If you love j","useful":0,"cool":0},"9HlDk6FcYWjeL3YLil4pLA":{"text":"I came here with my father 30 years ago and thought about it often over the years. In a wo","useful":1,"cool":0},"c4j8DaAaCtK6EtSC4FzQFw":{"text":"What a great experience, everyone should be able to enjoy.  Some real authentic Jazz in a ","useful":0,"cool":0},"xK9Qcr87AdQ8Wwm2tEMLig":{"text":"I'm glad we went to this, I'm a big music fan and love seeing live shows and especially vi","useful":0,"cool":1},"kmNVZhOuRmd8_ASfqIpKCg":{"text":"Preservation Hall is dedicated to supporting Live jazz and keeping people interested in th","useful":0,"cool":0},"KROd3gzkj36p6FqgPnJtpA":{"text":"Great experience. Get the skip the line package and get better seats. This isn't about dec","useful":0,"cool":0},"yjqAbERNwQ0XSpbC7Nyu1A":{"text":"Must do in NoLa! Yes the reviews are right that it's hot, it's small, and it's a short 45 ","useful":0,"cool":1},"nj4y638bPRRV4sgQxTsiIA":{"text":"You've got to go, just to experience it!  The place is a tiny hole-in-the-wall, and its re","useful":2,"cool":3},"LPV34UmsA2WAgn6RSESAJw":{"text":"I can understand and appreciate the history behind Preservation Hall, but I don't need to ","useful":3,"cool":0},"1-1H9WdcVeCwVDJiDXgdQg":{"text":"Came here twice during the stay in NOLA. Door opens at 8 pm but be sure to arrive 1 hr ear","useful":0,"cool":0},"FAG1VYolZSt32sg2hnW4ug":{"text":"Great site to listen to classic, other, and Saint jazz. They do take and enjoy requests. B","useful":0,"cool":0},"idYW70JA-EETSQrWZsmJ0w":{"text":"One of the best musical experiences we've had! Lines start forming outside the place one h","useful":1,"cool":0},"kXoQ2uPm2M9wPp98bt4VTw":{"text":"If you miss this you may as well not have bothered visiting NOLA.  Just an unbelievable tr","useful":1,"cool":0},"iONXQj9VDJyV7WV-KPzyPw":{"text":"Be smart... go on line and pay for front row tickets... You don't have to wait in line for","useful":1,"cool":1},"4Qy0c2BzsTHud4rTEfwCAQ":{"text":"Mind blowing live jazz  Try to get there at least 1 hour ealier than the show time. Otherw","useful":0,"cool":0},"mAkGK5YH1HJwxbsNt59dKA":{"text":"Step back in time. No bar. No bathroom. Just fantastic music for the fastest 45 minutes of","useful":3,"cool":0},"SSYN50XQtCYdBwse1D_rog":{"text":"Was recommended as one of the top jazz spots in the French Quarter. Tried going several ti","useful":6,"cool":1},"oakRgxLjgyNKr5NEQxqCNQ":{"text":"Late September 2015\n10 p.m. show\n\nPH is a must-do for a reason: a throwback to acoustic ja","useful":5,"cool":1},"QXTBYZnLuvWmsPSwOa3QCg":{"text":"I was fortunate to come to the historic Preservation Hall. You will never get an experienc","useful":0,"cool":0},"MjUI7UcJD_ikBNMmm0izjA":{"text":"What a fantastic gem located right next to Pat O's! Ever since my husband and I have been ","useful":3,"cool":1},"rK8pPSw_jrSvPhiTQm1YnA":{"text":"Just a few steps away from Bourbon St, you feel like you're being transported somewhere lo","useful":1,"cool":1},"qB1Fy9ZIP-Lj2gd7p2EkPA":{"text":"I love live jazz!  Like the other reviews they play 3 sets of music starting at 8PM.  We g","useful":0,"cool":0},"T9G6ClvDFE_rzruY6CVB6g":{"text":"My favorite stop in NOLA! Tickets are $15 [CASH ONLY] at the door, line starts forming abo","useful":5,"cool":0},"Dj8E9kbdbxwv3mxawhT3jQ":{"text":"Mixed feelings..... \n\nPros: \nGreat Music!\nGreat Music!\nGreat Music!\n\nCons:\n$15 per person\n","useful":0,"cool":0},"GiusNgGweUTXfqMywk6aUA":{"text":"Such a one-of-a-kind jazz hall that anyone and everyone should experience when they're in ","useful":2,"cool":1},"pb4c4MVuTvnpJL4IFlEtEQ":{"text":"Southern jazz at it's best. Two shows play nightly at 8pm and at 11pm. Start lining up up ","useful":1,"cool":1},"dnbFxxukyS5Ug-S2i0vqiw":{"text":"Excellent place to experience true jazz music!  This isn't a bar, no food, no drinks, just","useful":1,"cool":1},"22v22DOdotMVGWTSoEbcPg":{"text":"This is a very special New Orleans Jazz experience. My friend and I were so lucky on timin","useful":2,"cool":2},"flCf917S3de4-HuvTZnxqQ":{"text":"I'm sure you've heard no bathrooms, no frills. You can bring a drink in and then, hold on ","useful":0,"cool":0},"cuKinxTmHIzCBgrKPUNCrg":{"text":"I bought front row seats which was awesome because there was no wait and I was guaranteed ","useful":5,"cool":0},"p4_Gdu8PfJAzImdox8U9VA":{"text":"$15 cover charge. Worth it. I came to NOLA and was hoping to hear some live jazz music and","useful":4,"cool":4},"DsmjCC9L2MNo4QuUhO34sQ":{"text":"The line is crazily long.... They offer 2 shows everyday at 9pm and 10pm. $20 ppl and cash","useful":5,"cool":1},"fnlVtkVEIf1lUjEVbQriww":{"text":"LOVE this place!  Was in New Orleans just for the day during Jazz Fest so we were happy th","useful":1,"cool":0},"wY8jPgVEoh-LWSHBaVcB-Q":{"text":"My husband and I went to preservation hall during our visit to New Orleans. It took us abo","useful":0,"cool":0},"kZ8a28xMgWZLzhyAWYWCnw":{"text":"We were told that we had to wait about 15 minutes - that 15 turned into about 50 mins. The","useful":1,"cool":0},"uiERhb5a6YiSMk6bbf6irw":{"text":"As others have said, this place was too Disneyland/sanitized. Some of the musicians seemed","useful":0,"cool":0},"yYlOC1L3zEMGBbIUuBw3yA":{"text":"Do you fancy yourself as a person who enjoys live music...? Like hanging out in buildings ","useful":4,"cool":0},"S7w1A20wGDz12exI-cFJQA":{"text":"Thanks to Yelpers I found this place and bought my \"big shot\" tickets to see the \"Preserva","useful":0,"cool":0},"EwxXoimEurO1IcUEjv30wg":{"text":"An absolute must do when in New Orleans is to hear jazz at preservation hall. First Get yo","useful":8,"cool":4},"JGo7a3b1_OwG8DQdGbMhgw":{"text":"I will never be able to explain how amazing Preservation Hall is. If you like music (any g","useful":0,"cool":0},"ATnyBS9LS0fiB10Wa0nssw":{"text":"You have to see Preservation Hall!! Only it's BYOB and be prepared to sweat! The room has ","useful":1,"cool":0},"l_6uuHDPZYENoIi8qBacLA":{"text":"In short, I felt like it was the Disney World version of what great jazz should be/used to","useful":8,"cool":4},"hySHVpruej6e6YZ59sa0Kg":{"text":"Preservation Hall is New Orleans.  We thoroughly enjoyed the performance Friday night @ 6:","useful":1,"cool":0},"2laROCtYY1F8PVYFaadpCQ":{"text":"The place is a small gem located in the French Quarter surrounded by tourist-trap club´s t","useful":2,"cool":0},"GUqpJH3YwEAvEwgZCZk0Hg":{"text":"Six stars if I could. A truly unique musical experience. Definitely a highlight of any tri","useful":0,"cool":0},"vONMHstrwubrJ_ZYG2WZNA":{"text":"Awesome. Not a huge jazz fan but the band was very moving. The guest saxphone was inspirin","useful":0,"cool":0},"4ZOfI3bYNE0tULWtjsjK7g":{"text":"Classic New Orleans Jazz. Go and be transported to another time. Band was tight, admission","useful":0,"cool":0},"xozPz3reFc0kRXRsVSS1iA":{"text":"You guys....HOLY SH*T! Get in line early and sit right in front of jazz legends for the mo","useful":0,"cool":0},"YiiS_BpnuwmyUeTKrWX2Tw":{"text":"Fantastic NOLA local jazz～it has a long history, the  interior setting and the way the art","useful":0,"cool":0},"aO1lvMSUU_egeqgMX8OkNw":{"text":"Ehhh, I had a so-so experience at Preservation Hall.\n\nNeutral/Notes:\n-You wait about an ho","useful":12,"cool":1},"L9_WrDznjMl5DpqA6nOIaw":{"text":"I'm a fan of the PH and I hate to give it anything less than five stars BUT on the particu","useful":0,"cool":0},"wr9ZxfPltPz2HBpk-IF6bg":{"text":"We waited 4 hours for this 45 minute show. I totally respect the musicians, they do know t","useful":0,"cool":0},"BrunU2FwVTX0P6_oDEISDQ":{"text":"We were referred to see the bands here by one of our friends.. they said it was a MUST see","useful":1,"cool":1},"c36ecUI-QspMqtYTKhm93A":{"text":"If you are looking for an old school New Orleans jazz experience, this is your place! Greg","useful":0,"cool":0},"Ats0gpEy7qpYA6XncPM4UQ":{"text":"Cool experience. Very small venue. Bought 2nd row seating ahead of time. It was great to w","useful":1,"cool":0},"XXR2sWPIp4TS07IFaTIuHg":{"text":"Wasn't into jazz before but this place made me fall in love with jazz. We waited outside f","useful":0,"cool":0},"vCMB6pYk6503SeZdbqFpsw":{"text":"A must attend while in New Orleans! A must do at least once in your life! Like stepping ba","useful":0,"cool":0},"DAEZJlz-0qvxbGyJP7KAfQ":{"text":"Feels very authentic and intimate. The room isn't that big so you are pretty close to the ","useful":0,"cool":1},"Yaslur5mo6mLGirC3oKUCQ":{"text":"I don't get to New Orleans very often but I wanted to take my new wife to see a piece of h","useful":5,"cool":0},"DgviVq2f2g7qNPNyJ8FQ0g":{"text":"Excellent music, it is beyond my imagination. I want be there for ever. Time go so fast, I","useful":0,"cool":0},"xomQi6WzFhiYv3VPX_XTaA":{"text":"Love, love, love this bar!\n\nGreat jazz music!\n\nGreat service and wonderful drinks!!!\n\nGrea","useful":2,"cool":2},"NIuHkU1ooXCzB0GodNCZSQ":{"text":"You must got here. Stop questioning it, this will be the highlight of your trip to New Orl","useful":0,"cool":0},"kznEWimY9CFmdlHgdp8a7Q":{"text":"Wonderful!! Leroy Jones was present for the set we saw and he wasn't even the best part ab","useful":0,"cool":0},"nLTlRyqZqa0y0iL0MzvlYA":{"text":"Not my favorite place to hear jazz.  There are better bands on the streets in the French Q","useful":2,"cool":0},"bdnWI3MWjktbA3-isrep3A":{"text":"Definitely a must on your NOLA bucket list . Get in line at least a half hour to 20 minute","useful":0,"cool":0},"sdSHBqodA3CP1cRGdSBPxQ":{"text":"Preservation hall Jazz Band were phenomenal!! If you like music, go here and enjoy. Wait w","useful":0,"cool":0},"DJqIAxlGD8GmMlqasy982g":{"text":"Preservation Hall is the most authentic New Orleans experience on Bourbon Street.  A rear ","useful":0,"cool":0},"EwnMTJ-N6sFhJ6uzZBL2vQ":{"text":"Very disappointed. Paid extra for 2nd row seats but couldn't see over the folks in first r","useful":0,"cool":0},"7PpmUyrwCeifSrX4xOvigw":{"text":"You can guarantee yourself entrance and a seat if you buy a ticket in advance ($50 that ni","useful":0,"cool":0},"npCNHovz69o_F9hGH2QG_A":{"text":"nice place to hear good music.  12 bones to get in.  show only lasts an hour, or at least ","useful":1,"cool":0},"FfhM7CqWeyDaZ6mkSLOECw":{"text":"One of my favorites venues in the world. No place like it to catch a quick 45 min set of D","useful":0,"cool":0},"PmwS8fw9LLv3qalBBMD8Pg":{"text":"Lugar mágico si es que lo hay y una experiencia de la que no se va a a olvidar nunca en su","useful":1,"cool":1},"-czvFtSR7TbUYlGiSQJ5Ng":{"text":"Had an awesome time!!! I don't even love jazz all that much (went with my hubbie). We paid","useful":1,"cool":0},"xNWHVAGef8bqelcelhOqIQ":{"text":"Worth the line, amazing experience. I don't think an online reservation is necessary. Just","useful":1,"cool":0},"u8qgx4BdNcXBEV5pjx-I2g":{"text":"Unless you really like standing for a long time, pay in advance for reserved seats. I paid","useful":3,"cool":0},"jz41KbKbh0zg_shjBgPwlw":{"text":"This place oozes history and weird, eery vibes. If you are coming to New Orleans and are l","useful":3,"cool":0},"knKeW2A5x36cYfk7LEkKjA":{"text":"$15 a person for a 45 minute set which is pretty average\nThe music is the old school jazz,","useful":2,"cool":0},"IfWLhoE-wO-aVY8Uf3m7bw":{"text":"One of the highlights of our trip to New Orleans and the place to be for great music in to","useful":0,"cool":0},"gIUD1Nm4SMRUMGEGWCveiQ":{"text":"While the Crescent City has no shortage of outstanding jazz clubs, a visit to Preservation","useful":6,"cool":2},"qaeLU0JXF-_PWq_XzDQXGQ":{"text":"Preservation Hall was the highlight of my trip to New Orleans.  It still has that old time","useful":0,"cool":0},"4bCV1NnkkuWgbHHNlc7bJQ":{"text":"Good music here.now can make a reservations online.very convenient!I bought a CD and stick","useful":0,"cool":0},"xtkk7lYEgjC3NtX-Cxi77Q":{"text":"Amazeballs. We got there at least a half hour early and still couldn't get in to the first","useful":2,"cool":2},"Y7ZsonCBetv8pPUOporopg":{"text":"Had a great time on Tuesday night listening to probably the best jazz band! It was awesome","useful":0,"cool":0},"75Sa3FCPWG8cIjMNHE8I8Q":{"text":"Let me tell you a little story (speaking in an old raspy deep voice, imagine Mr. Louie Arm","useful":5,"cool":5},"S0EFDCbBsU40ucUCDUL92A":{"text":"20 dollar coverage for a 45-60 minute set. The place is bit small with floor seating in th","useful":1,"cool":2},"5KCso3wMT2qkTdnHVtyaMQ":{"text":"Yes, this is a little touristy but you'll hear mind blowing jazz in an intimate, historic ","useful":0,"cool":0},"NQZBNf_KKuGBiZuNrIVnng":{"text":"This is a place that everyone should experience! PH is truly about the history of New Orle","useful":9,"cool":9},"QnDURizhPDpvC1KGt9348w":{"text":"Show up 30 - 60 mins before the show. Expect to wait in line. But be prepared for an amazi","useful":3,"cool":0},"qJ-cSDNoWoXiF3Uv80pKUA":{"text":"No New Orleans trip is complete without visiting a New Orleans Jazz show.\n\nWith 3 shows a ","useful":4,"cool":3},"rqrsaQA3Lmyp24UEaXfp1Q":{"text":"An awesome experience. Get there 30 minutes before showtime with cash in hand. If there's ","useful":0,"cool":0},"c2c0qfRCPCswRNJHB6IpzA":{"text":"This show presents jazz very poorly!!!!  First you pay to get in and then the musicians DE","useful":2,"cool":1},"pQP0dyikhTzcng7J4Kna0g":{"text":"Loved the show. Don't be intimidated by the line -- I showed up at 8:00, was the last in l","useful":0,"cool":0},"XnMdy0LKsFrWD_zGyO_JEQ":{"text":"I'm sure it is a great experience if you can get in which is why my wife and I attempted e","useful":0,"cool":0},"r4OSO6Trlqq9UkvoZ1qocQ":{"text":"Wonderful music. Tucked in an unassuming location right off Bourbon street. If you want so","useful":0,"cool":0},"LhmaoWIJKiZI_m5Tz-oOsg":{"text":"This is a must do item in the French Quarter. Buy tickets online to reserve your seats or ","useful":0,"cool":0},"0EuV8T6Wnjotgx9Cgxpgww":{"text":"Gimmicky...yup without a doubt.  Fortunately the musicians grab a bar of soap and wash tha","useful":0,"cool":0},"0FFreErfKWhoXDu9bkd1uQ":{"text":"The highlight of my entire trip to NOLA!!!! This place is an institution! I was lucky enou","useful":1,"cool":1},"6wYrGu_cnHurxOjSZzuhWw":{"text":"Love this place, worth the wait! Bring your own drinks and make sure to go to the bathroom","useful":0,"cool":0},"xs39d4SAafAlXFn_w0NQjw":{"text":"I grew up in New Orleans and remember when the strip clubs on Bourbon all had jazz bands (","useful":0,"cool":0},"NgNnsFZMQYg9VoacWWPCJg":{"text":"Tourist trap. But you gotta do it if you've never been.\n\n$15 a person for a 45 minute set,","useful":8,"cool":0},"CYnGhY3ofWNapyQOHzoSDQ":{"text":"Absolutely outstanding jazz performance. We highly recommend coming here if you're in NOLA","useful":2,"cool":1},"aCh9PslFu4vNlgE5aeUOlg":{"text":"We did the first show of the day and half the musicians arrived late 10-15 minutes. It sti","useful":0,"cool":0},"L5nkrqYRnnrbBBa-vvzyaw":{"text":"I discovered Preservation Hall around  1969 and visited often in the 70s & 80s but had not","useful":0,"cool":1},"KGAJRSWm8hR5NgTNpLndfw":{"text":"Not good! Try avoiding this show! No matter how much you are tempted to see the show by lo","useful":2,"cool":0},"6q5bZkuglWiFm5NTE2k8yg":{"text":"Preservation Hall was the highlight of our entire trip to New Orleans. I knew very little ","useful":2,"cool":1},"IyaQRTXG6jI_wo4i8knahw":{"text":"Get there early, we arrived at 7:30pm for an 8pm show on a Sunday, and barely got in. It's","useful":0,"cool":0},"qCAw_lx_Sl5Fj04ZKiEdkg":{"text":"An establishment, historically significant, and great experience - but if you have limited","useful":1,"cool":0},"Cd7E3z975Gpi16FttyX4OQ":{"text":"This is a do not miss. But tickets though or you'll stand in line for 45 minutes and then ","useful":0,"cool":0},"xJob0wDrWxdz9eq30Nljlg":{"text":"Great, classical jazz experience. Feels like you are transported back in time.\n\nWe showed ","useful":2,"cool":0},"7RTu68oL5C80oZCpY5z4qw":{"text":"Very long line but so many crazy things happening on the street that it wasn't so bad.\n\n$2","useful":1,"cool":0},"eLO7meWwAlAWxdXvlMD2wA":{"text":"Don't get me wrong with such a below average review here, the live Jazz music itself is aw","useful":17,"cool":12},"mmFgmEoURlNCwQNUy0vpHg":{"text":"The legacy band was fantastic!\nDefinitely worth the wait to get in.\nEvery single musicians","useful":0,"cool":0},"ziVBqjOPBOodihpYmnMvfg":{"text":"I don't know why everyone thinks this is such a cool place. I understand history and every","useful":1,"cool":1},"ulq0M_0_UnrPFmcsS3JXxg":{"text":"This was a lot of fun. We didn't buy the reserved seats but sat up in the first row on the","useful":0,"cool":0},"NJgqhqhpnEKhnWexHE7OBg":{"text":"I completely enjoyed our time here. We went here the day after our wedding and were blown ","useful":2,"cool":0},"sHCh3obb4V1yVseQZJurmQ":{"text":"Highlight of our trip! Love the music. Spend the money and buy the VIP tickets. No waiting","useful":1,"cool":0},"XpYJlw1nHKkOxTyJSFEDXQ":{"text":"It's funny how the reviews from other tourists complain that it's filled with tourists.  W","useful":1,"cool":0},"F2WBLDBYy9YWz2Huc3pXEQ":{"text":"How do you not enjoy the Mecca of jazz culture in New Orleans without this place? My frien","useful":0,"cool":1},"aiX87nRnWjxCY2CbCPHyug":{"text":"We opted to buy tickets for the 5pm show. We knew that after a full day of sightseeing sta","useful":0,"cool":0},"UjQJUuHC7oi1L5Lz2-yIqw":{"text":"Incredible old school jazz, no alcohol, no bathrooms, limited seating, but all worth the w","useful":0,"cool":0},"1dtIJ7YYLBEVcIDC_hQ0zQ":{"text":"Small live jazz place. If you want a seat recommend calling early in the morning or the da","useful":0,"cool":0},"78P6XKfXxHsOw1dYW7GMlA":{"text":"I was determined to find that this place was a total tourist trap (because let's be seriou","useful":1,"cool":0},"-GW9Xgea5yaKYkk4IJ1j3w":{"text":"Worth the 45 minutes in line to get inside.  There are some tickets available to each show","useful":0,"cool":0},"tFUxTI1ZE-NkZpG-NrvtLw":{"text":"I booked the \"big shot\" tickets for 5pm show.  Well, the trumpet didn't arrive until 5:45 ","useful":0,"cool":0},"3bqPi17DQNsh4dEWq4Vv3g":{"text":"WOW! What a great place! We came over thirty minutes before the doors opened and stood in ","useful":1,"cool":0},"y8eEFsYj0vphrbhAywo6kQ":{"text":"Wife and I saved Preservation Hall for the end of an uh-mazing jazz-n-food week in NOLA (I","useful":4,"cool":0},"6UeTTNvucIvonV3BqBKs9Q":{"text":"If you're visiting or just love jazz, be sure to add this to your list. Every night is a d","useful":0,"cool":0},"W1ZUk7KpEFzZ6IZPSQM9-g":{"text":"The line for the 6pm show was thankfully not long and we only waited 15 minutes. $20 cash,","useful":2,"cool":1},"eyllH7sWPtr-Cilgzpjc3Q":{"text":"This place is overrated. The old  band leader tonight with gray hair on both sides of his ","useful":1,"cool":0},"j3rjjJMuxjmRT_aIFfdCpA":{"text":"An AMAZING New Orleans experience. Being a local, I do not frequent Bourbon Street on any ","useful":7,"cool":0},"R1SoUgcQx3M7iEjXeVPJLw":{"text":"This place is amazing. We got in on a Sunday evening with no wait, sat by the front row on","useful":0,"cool":0},"1FdUvrKblOIrLzlGNfpIew":{"text":"I've had the pleasure of visiting Preservation Hall. Once in the VIP ( spoiler its a bench","useful":1,"cool":1},"iG2inffp6sGhRqHyPbpUIQ":{"text":"Funky and tiny.  We opted for the \"Big Shot\" seats complete with a souvenir Big Shot lanya","useful":2,"cool":0},"6SNxbhKmz7U2ziUdr0V-jg":{"text":"I have heard about Preservation Hall for a number of years. even though it always sounded ","useful":3,"cool":0},"K3yjo4S0aRZOUZu3TDHLTQ":{"text":"Had a great night listening to Will Smith and the Preservation Hall Legacy members! I ende","useful":0,"cool":0},"p5d8dXPofdL1sGVSAHJKgQ":{"text":"08/09/2011 - 07:25 pm \n\nAfter a much needed intermission break from the midday heat, it's ","useful":5,"cool":3},"Yt2GHo9F8jAvk1A2ADwH-w":{"text":"This was the highlight of our trip. Such a great place & everyone was pleasant to deal wit","useful":0,"cool":0},"197dp7paKSGv3OplHR4ppw":{"text":"This was by far my favorite stop in the French quarter last month. It's 20 bucks cash at t","useful":0,"cool":0},"0HwNqJdZFKcDeyhx8OnXog":{"text":"The greatest experience I had in New Orleans.. it's worth the wait. If you can get the \"bi","useful":0,"cool":0},"hZY3W0_L9EeabP3QZcSFeg":{"text":"This was my second time going to Preservation Hall.  What an experience - not to be missed","useful":0,"cool":0},"S16JPiqBsEzKodqUt7HIAw":{"text":"Really small, small, small and authentic place. \nBe ready to be on top of each other.\nOnly","useful":2,"cool":0},"jnFFqWW1kZg8XwRZaoDWWA":{"text":"Local review!\nThis was my first time here and it won't be my last! It was my fiancé's bday","useful":2,"cool":2},"10GS5kdCNAl53uWUXtFxZg":{"text":"I see a lot of reviews mentioning long waits and paying for a seat, I've come here on almo","useful":0,"cool":0},"MQWOth3ALkxuHPjD5J02jg":{"text":"I loved this place. Must see when visiting New Orleans. \n$20 per person for 1 hour show. \n","useful":4,"cool":0},"RhoGr28S8nQtnjpGi36eQA":{"text":"This was exactly what I was looking for.  5 guys who love jazz, sharing their talent.  It ","useful":0,"cool":0},"iq0BuouOD4ijgVVFD6D8qA":{"text":"This is a must!!!! There is nothin better than hearing these musicians play live in such a","useful":0,"cool":0},"Cew0Zd6p7MPDYACh3rD13A":{"text":"If you are trying to experience the music and culture of Nawlins, this is a must.  What li","useful":1,"cool":1},"3Kw1gKX-D76l4UnVvATV7Q":{"text":"Had a fabulous time.  Paid for big shot seats in the front row so we didn't have to wait i","useful":0,"cool":0},"5qnNHFIrQWW6M0RSKQowBA":{"text":"Loved this place.  Great music, cozy venue (reserved seats were nice) - only about 30 rese","useful":0,"cool":0},"R-DCBBRhJ4qhS7fXuIoEXQ":{"text":"I love this place, it is one of my girlfriend's places to go period. Our experiences have ","useful":3,"cool":0},"eHkTTG8NsCjoXuspo-oUWQ":{"text":"I absolutely LOVED Preservation Hall! I can't believe I missed out on this iconic music ex","useful":6,"cool":3},"irdhecQoPM1-mk_5NAL8Dw":{"text":"NOTE: CASH ONLY\n\nWhen I was googling Jazz Clubs in New Orleans this was pretty much the #1","useful":24,"cool":18},"mndUFI3728CqH-YQmZ2G5A":{"text":"Preservation Hall is definitely not your upscale, trendy night club!  It's not supposed to","useful":0,"cool":0},"Fk4BlsWg4GYks3u-DTHZsw":{"text":"JAZZ! Our first stop after our hotel and eating a muffuletta was Preservation Hall. After ","useful":0,"cool":0},"mcoAMBKPlrgIpPZdtiMFhA":{"text":"Be prepared to stand in a very long line. They have 5 shows a night starting at 5pm. We ar","useful":3,"cool":0},"wUkwdq1kNolVw59fRlYmhg":{"text":"This place is a music venue like no other. It only fits about a hundred people. there are ","useful":1,"cool":0},"n7CRH4FT1PhiLis5oL0IkA":{"text":"Amazing. This place is just...beautiful. The music is amazing. If you didn't reserve your ","useful":1,"cool":1},"uStZv1rQlbl8njPh-Y8Gsg":{"text":"Moved to tears. The talent there is astounding. Truly life changing to hear experience the","useful":0,"cool":0},"T6Ypzr8KsR7KDE4JgEY4Ag":{"text":"It happened by accident. I was planning on meeting up with a friend in the Quarter before ","useful":7,"cool":7},"uUpCa4xb8iPWVTV45iilZg":{"text":"We highly enjoyed our visit. Don't quibble about the cost - reserve your tickets in advanc","useful":0,"cool":0},"Fy_WZkC0SOsNV2hzYOe6Qw":{"text":"UNBELIEVABLY INCREDIBLE.  I can't say enough good things about this place.  It makes you f","useful":2,"cool":0},"xjhbqxTmW_HHyBdZqN7llg":{"text":"it's great, as other reviews say.\n\na couple of things,\n1) it's an old, small building, and","useful":0,"cool":0},"AauV2juRyTxbKBTnBXoD8g":{"text":"Listening to live jazz at Preservation Hall, I felt as if I should have an old-fashioned i","useful":0,"cool":0},"0GwDuio300O3ClQMaToUrg":{"text":"From what I remember, you don't need to call and make reservations, just get there probabl","useful":9,"cool":5},"mGEZ7k0z7TG6KbpomPKHaw":{"text":"I do like Preservation Hall and have visited many times over the past few decades. Just th","useful":0,"cool":0},"ajIMrCGhbfUnzV8fm0PQ0A":{"text":"I want to dilute the folks who stood in line forever and didn't get a seat. I am sure that","useful":0,"cool":0},"h4PZxYh_5pKN92IVBmmcBQ":{"text":"So, glad I made it here.  I was in New Orleans for one night, and this was the top thing o","useful":1,"cool":1},"mnrIH80KIbWuYjJjj-0WfA":{"text":"I've been here for a couple of shows and it's all the same thing, IT'S TOO SMALL!!! The pe","useful":2,"cool":0},"XtfyLkslDm3xtlCUQB-vog":{"text":"no drinks, frills or cozy tables. just pure, unadulterated jazz.","useful":0,"cool":2},"rJI7-bKHNLm5fOmIMJDyog":{"text":"Great live music for a tourist! Which I am. We waited in line for about 30 minutes before ","useful":4,"cool":0},"lGbE7EdEzxp0yit8hYNe-Q":{"text":"If you go to New Orleans, you must go to Preservation Hall.  This is an opportunity to see","useful":1,"cool":0},"Y4-h6Hy32d7m3ZxwXpclaw":{"text":"I do not know too much about Jazz or the Blues but I am open when it comes to music. For t","useful":5,"cool":1},"p-Qe_GmEyBHdxsuHIVjgmQ":{"text":"Definitely worth stopping by this tiny room, packed with jazz enthusiasts and a whole lott","useful":0,"cool":0},"IhFSyQjX5-YJHhmfHVk41A":{"text":"One of the hottest music venues in French quarter. We went there on a Sunday night and sto","useful":1,"cool":0},"ZKtE4kZET4YKCVMcTYgEcA":{"text":"Okay, was a little taken back by the no food, no drinks, and no bathroom. But you can use ","useful":0,"cool":0},"AwUmzX19VMqHARBC2e2PCA":{"text":"I was in New Orleans and the tour guide recommended Pres Hall as one of the must-visit mus","useful":1,"cool":0},"kBLz4ISN58R1Mlk4a7GlwQ":{"text":"This time we are taking advantage of the matinee to hear not only the music but stories in","useful":0,"cool":0},"Dus3DHkGI3_8xYGNWWlSGw":{"text":"AMAZING! This is a must see and do. Get reservations well ahead of time.  I mean weeks ahe","useful":0,"cool":0},"R3aFn97HM8-NqGDdeyww2A":{"text":"Highlight of my NOLA trip. I ended up going 2 days in a row. I followed the recommendation","useful":0,"cool":0},"DJobXkl15HHf_hnXGXAKpg":{"text":"It was my first experience in Jazz world. Friends said that this place is one of the most ","useful":2,"cool":2},"GvkaHl3K-cQoKO40TrfRgg":{"text":"Wonderful! The musicians we saw were world class and the band leader literally brought me ","useful":0,"cool":0},"Pqvgy_ljaHyyLID-rHj0iQ":{"text":"Just..... No. No. No. This is what music would be like if musicians were kept in zoos. Lif","useful":1,"cool":0},"5gSue5AfgWotJ4E4wU7AUw":{"text":"This was the worst jazz show I have ever been to.  If you want the real deal go to elsewhe","useful":2,"cool":0},"kYLgjS_qq0gESzmRpuW8wA":{"text":"Good show, overall experience ruined by Juan the security guy. \n\nVisited Preservation Hall","useful":1,"cool":0},"aN4l5Hk-2c0pVx6iGZ7Hog":{"text":"You are going to wait and wait and wait and probably wait some more BUT please understand ","useful":0,"cool":0},"3ok5x04itAeWAU2nFUuILw":{"text":"I had high hopes for Preservation- a historic NOLA staple, the birthplace of NOLA jazz, i ","useful":7,"cool":3},"7RpkhnmrbK3I38UHoegaTQ":{"text":"I've been to 5-7 shows here and have not been anywhere near disappointed ever. \n\nThe first","useful":2,"cool":2},"MdZfBA34E7xrmBOwfQ8_Mg":{"text":"Wow such a wonderful experience! I love live music and what better way to enjoy while in t","useful":7,"cool":7},"k8FN81Bmfo9z1jbglWQqrw":{"text":"If you want a real taste of New Orleans history, this is it. It's crazy that amidst all th","useful":1,"cool":0},"euNpoJG8_4m95hn5-xxDtQ":{"text":"Great performance and fantastic experience. Must go if in NOLA. But it wasn't a full hour.","useful":0,"cool":0},"SaiAxO1sFMwZHXliLSEh4A":{"text":"Including the night before where we gave up after 40 minutes of waiting, we had probably w","useful":0,"cool":0},"U_LHvBqAkVg-7VYZqAPLnA":{"text":"Pros: awesome music for $15. The musicians are super talented and are very adamant that ph","useful":3,"cool":0},"GAQPpX6Dm5A4Q8uS67eIlw":{"text":"Wow!! How can I put this is words? I cannot believe I had to come to New Orleans before I ","useful":0,"cool":0},"_JHV-AOVLDBJV_KhCduyNA":{"text":"Preservation Hall is small, so be ready to wait unless you buy your tickets online.  But i","useful":3,"cool":1},"oCAahTvN3XXUcrWwzmV0Yg":{"text":"Very small old venue which gives it a lot of character. Music was good. Stand in line for ","useful":0,"cool":0},"jPQqc4NNFYumoYAIQfApXA":{"text":"To be straight up and honest, you can find the same if not better on the streets of Louisi","useful":0,"cool":0},"aDpOQKlr5O8tEYrCIKY7jQ":{"text":"It's my first time here in NOLA and so far this is The best traditional jazz music I've se","useful":0,"cool":0},"5QeIEpJMLOzCMinXjdfiuA":{"text":"My husband and I were looking for live music while in town and know this place is historic","useful":2,"cool":2},"9MRNRs5K9Nlsdcjc6bIy1g":{"text":"Despite the high reviews, I worried that it might be a kitschy, overpriced tourist trap, e","useful":0,"cool":0},"-pxm6-Wu-nhdxSxaUTvPdQ":{"text":"A friend told me about this place on the flight over, and we decided to catch a show that ","useful":5,"cool":1},"yMA1Y8ElsURlc7AZbeqFsg":{"text":"We were lucky enough to stumble upon this place and we're reluctant because the line was a","useful":0,"cool":0},"pUnj5qhZa9e4Dqtgmv2e-g":{"text":"Visting New Orleans? GO TO PRESERVATION HALL!!!!\n\nAside of being restored to look like it ","useful":0,"cool":0},"nBHW2G-jD1jMagBYg5gnyQ":{"text":"I'm surprised this place gets such good reviews.  Its history might be worth something, bu","useful":8,"cool":1},"rlAxN8O_Mxo8WyzcUsyraQ":{"text":"I don't think I've ever heard more beautiful music live. The acoustics of this place are P","useful":0,"cool":0},"Vna7ecNJgea9z6WxXDS6oA":{"text":"So after a great dinner we drove out to the quarter and paid the ten dollar cover charge t","useful":2,"cool":1},"mm5jC3LlFMnORV4eWeDDQQ":{"text":"This was the best night of my life.\nI always thought that crying during a performance was ","useful":2,"cool":0},"BoY2kv5VHQaithgKSe3kug":{"text":"Wonderful music! We did wait in line but the wait wasn't bad at all and with a drink (if y","useful":0,"cool":0},"HRHuJPninOYE00i0AfXTmw":{"text":"We were late for the 8 PM show so we were in line for the next one at 9 PM. We waited in l","useful":1,"cool":1},"5dazDvrjSXOgz5LHUnAlxw":{"text":"This was a good place to visit.  It's an hour show, but it was hot in there.  They do not ","useful":0,"cool":0},"hZbqiqURG3K4bd9pJg0OMA":{"text":"We found Preservation Hall in need of preservation -- or at least a little paint. It affec","useful":2,"cool":0},"MHu5doYJJa8_f7X0PLFv7w":{"text":"The performance was beyond what I expected from New Orleans!  This was jazz at its finest!","useful":0,"cool":0},"rcuvIM1Ezss9B4D1XQMVXg":{"text":"We attended the 8pm show on Thursday evening the day we arrived.  It was perfect activity ","useful":0,"cool":0},"W-X-0W9l31X-b6E6cU0ebQ":{"text":"This won't be the most comfortable venue you've ever been to, but it will likely be one of","useful":2,"cool":0},"x_PYIx_HiLCjPO2oFpGNsQ":{"text":"You have to be here to experience it. Paid for first row seating online. Saw this as a las","useful":6,"cool":8},"RUG7UMRr6ZoHcyQ1SUnRmw":{"text":"This place was so cool!  Even if you are not a big jazz person you just have to go.  The b","useful":1,"cool":0},"QaJSnFbcpGjvPY6TzaVtNQ":{"text":"I was looking for some good jazz music and this place had a lot hits on Yelp.  There was a","useful":1,"cool":1},"RnrsIFxekwrXvyqrjhA-ZQ":{"text":"Kid Koala, at a recent show in San Francisco, introduced a song by telling the audience th","useful":14,"cool":9},"wZB53qEmo_Tt-V1z4LtnIg":{"text":"Truly speechless to have been part of such an experience. You don't hear live music like t","useful":0,"cool":0},"_hDbNEFwxg09PWNN5vBsjw":{"text":"The best $20 spent in NOLA! My mom, friend and I got in line for the 8:00pm show around 7:","useful":0,"cool":1},"yAgn3mYlzXtLu0D6jDggDA":{"text":"I know very little about Jazz but I really enjoyed my time at Preservation Hall. We bought","useful":0,"cool":0},"b3WVu1-j4naq_C5Y_xDasQ":{"text":"If things like comfortable seating, air conditioning, food and water matter to you, you ma","useful":2,"cool":0},"84XHRzTQ2fnas3XLv_kHnA":{"text":"Everyone who comes to New Orleans should come to a Preservation Hall show at least once; i","useful":0,"cool":0},"Uuq_9u15ojqMo22S8IvRGQ":{"text":"Oh wow what a treat when in New Orleans.  We had the pleasure of visiting this special pla","useful":0,"cool":1},"bgb4zLp2wNWTaiYGw6IXKA":{"text":"15 dolla tickets, line up early if you would like to sit on the benches :) or floor cushio","useful":1,"cool":1},"QV32-Y57XSrhqfIPLXw65w":{"text":"This has every characteristic trait of a TOURIST TRAP. First off, you have to pay $20 to g","useful":5,"cool":1},"T2oWVeojmEUfqbbhkQ6Flw":{"text":"Got there at 8:15 to see a very long line.  Reserved seats had been sold out the day befor","useful":0,"cool":0},"Gpcetbn_j2Ia0bTJdTBKZw":{"text":"My first time going to the hall and it won't be my last. It was amazing, it takes you back","useful":0,"cool":0},"aq8KSE5CsTxkxQBTWpcXaA":{"text":"Such an odd juxtiposition-- traditional jazz played to an audience sitting on what amount ","useful":2,"cool":2},"S7g3SpN7AyYy6h2rbfT7DA":{"text":"Clearly this is an experience worth checking out. It is a lot of fun to sit/stand in a cra","useful":6,"cool":2},"ikuIPuSejkVbPoYziYGNDg":{"text":"All I can say is that even after standing outside in line for over two hours, the show was","useful":3,"cool":4},"RJ7RXTYuVW8280NmPLZHcA":{"text":"So good. Seats were sold out so we got GATickets and sat on cushions on the floor. The pre","useful":0,"cool":0},"WY0oo-Mg2mgm5av6pgc21A":{"text":"Go here if you're visiting New Orleans and you want to be totally transported to a differe","useful":4,"cool":1},"0xBNEyCPWikO6AiODsEBgQ":{"text":"Amazing jazz experience!  However, glad we didn't spend the extra $ for reserved seats as ","useful":0,"cool":0},"QAV4It3ZsoKeNjv5nx6L0w":{"text":"When in New Orleans you must do at least one spectacular Jazz evening and we did just that","useful":6,"cool":0},"uNxCEa3ceJS84GmGjiBQlA":{"text":"We came on a Friday afternoon, around 450, and would have gotten in to the 5 o'clock show,","useful":1,"cool":0},"oCF9DPpVpQHg8eM_60wmAw":{"text":"Saw the Tornado Brass Band in this amazingly quaint place. Probably the most intimate show","useful":0,"cool":0},"_wefqjjAvuo5C0ket2fwCQ":{"text":"If you're into live instruments this is the place to go. We made a reservation for Sunday ","useful":0,"cool":0},"XMop9cYQWePoWrWEX1LyfQ":{"text":"Terrible customer service experience.  Very disappointed in the hospitality.  This note is","useful":1,"cool":0},"tGbPsyeOX0cwe6uj8t8yxg":{"text":"This was the absolute favorite part of my day! My sister and I got in line early enough th","useful":0,"cool":0},"1c_GoYe_T9wcRS1aKNOibQ":{"text":"A unique experience in the center of the French quarter. I didn't plan and didn't get tick","useful":0,"cool":0},"I6TRRZAiTiE4IzRymNboFA":{"text":"Simply one of the best entertainment experiences I have ever had. The artists truly made y","useful":0,"cool":0},"K6PQFJ-7ZcbGly8839E9ZQ":{"text":"I'm almost embarrassed to say that after all my trips and time spent in New Orleans, this ","useful":1,"cool":1},"kIpDH3ggrhMfCh7aHRpcxw":{"text":"What a great place to hear music. The musicians are top notch and the venue is beyond inti","useful":4,"cool":2},"kTgzkTHjJJF86sArSKPRKA":{"text":"The hall to preserve, INDEED.\n\nWaiting in line for 90 mins or so to pay $15 for the authen","useful":1,"cool":1},"zKyZdh6q6CBg0GrGkKYUHg":{"text":"The music is great--but so are 20 other places.  We went because it was \"historical\" and \"","useful":1,"cool":0},"LibQoHEIs8h4ZKgWfuVqHA":{"text":"It's been a long-held dream of mine to visit Preservation Hall and I was so pleased to go ","useful":1,"cool":1},"PSjXy7zI6nV4KBSNmqhm2w":{"text":"Loved the show. A good length at 45 min since it's hot in there and most people end up hav","useful":0,"cool":0},"ZjGC_s4T4E6ytvUQhUXHdw":{"text":"LIVE old school New Orleans jazz in the heart of the Quarter.\n\nA MUST DO - at least once.\n","useful":0,"cool":0},"5TUtBsAJCUbrIQzNF324Mg":{"text":"Spent the big buck ($50 a pop) for 2 front row seats on Saturday night. It was SUPER HOT (","useful":0,"cool":0},"SfSHnHq1MF5Db4uDBpZ-hg":{"text":"Preservation Hall is one of those places that has always been described to me as a must-vi","useful":3,"cool":2},"7zEV5Jg6Cx2lKf-pJDMQeg":{"text":"We've finally made it in there after 3 attempts.  Since we have a small kid, we only wante","useful":0,"cool":0},"xNpXjAmA-xRBfLsR9T-mDw":{"text":"This place is nothing like I envisioned.  I somehow thought it would be a big music hall, ","useful":2,"cool":2},"9byNloXx-ZY7OStxgPRW2w":{"text":"It's simple-Preservation Hall is a music venue. No food, no drinks, just music. It's a tin","useful":4,"cool":3},"xJWD_4mTKWNVtTECGc5suw":{"text":"I don't care if you have to stand in line for an hour - you have to go to Preservation Hal","useful":6,"cool":2},"EYxoUyoLhu6xVrXAn5FeQA":{"text":"Super classic. \n\nI waited for around 1 hr outside the venue before the opening of the firs","useful":0,"cool":0},"oHKjbhQIWE8mleEdpMRl1g":{"text":"I would give this a higher rating since band was amazing..the place is all about the music","useful":0,"cool":0},"VPhOSzCdmDvuVQqGmH-5kQ":{"text":"We waited a little over an hour on Tuesday night to get in 9pm show. It was $20 cover char","useful":4,"cool":0},"I76wAcJEgFvJ5jlBzw-H9A":{"text":"Preservation Hall is perfect ! For Jazz lovers this is a must do if you are in New Orleans","useful":0,"cool":0},"U7DyNIaxaQIq8mcOUOOCIQ":{"text":"No more standing in line - reservations taken now for Preservation Hall.\n\nStill the same s","useful":7,"cool":2},"iYKvJTtn99T8qpRj4tefPA":{"text":"We came here for the 6pm show on a Saturday. There is a 5pm show as well and then an 8 and","useful":5,"cool":4},"dnpy4l9sMPvXCsP6RIvS6w":{"text":"The Preservation Hall is a music venue located in the French Quarter. It was founded in 19","useful":5,"cool":4},"-Lj-vUVpR3iaIAmbxJKfFQ":{"text":"the entertainment aspect for the winery and who was as cordial and efficient as can be...a","useful":0,"cool":0},"qrGsBLlk2HBVJIAe70o72A":{"text":"We were in New Orleans last week and unfortunately the hall wasn't open to the public yet.","useful":2,"cool":2},"S1NTsPKoLiM_7W9WePch9g":{"text":"This performance was the icing on the cake for me\nduring my visit to New Orleans. It shoul","useful":0,"cool":0},"aEXSvEyECYPP_fcZrkGOyA":{"text":"Really disappointed. The whole band was half asleep. No energy. Reluctantly getting up to ","useful":1,"cool":0},"nKCN3ETivfAVNncTQ2AJOA":{"text":"A MUST do in Nola. The best jazz music I've ever heard. Go early in the day and get your t","useful":0,"cool":0},"DkPQ3M-RIviMYm5HZtiKag":{"text":"This is one of those \"you must do once\" experiences in New Orleans.  It's only a 45 minute","useful":1,"cool":1},"GorH5r8IodfGA8vCrXFQhg":{"text":"It's a nice treat for 45 minutes of Jazz and you have the option to buy the tickets online","useful":4,"cool":2},"sVK378V_q1Ohunvn3WBoIg":{"text":"Enjoy! Great music and very friendly staff, it is an institution. You will be listening to","useful":0,"cool":0},"JSEM9AJy1mAh_-vlh__-hw":{"text":"Went there on my New Orleans Trip. They have reserved seating for $35-$45 or you could jus","useful":5,"cool":0},"P5qy_4P1spaLKytDxwONPg":{"text":"A must see when you are in NOLA to get a sense of the jazz community.  We popped in during","useful":2,"cool":2},"KaIjvtqiih07DyVVz_NarQ":{"text":"$20 cash only! Shows happen every hour from 5PM-10PM, except at 7PM. No public bathrooms o","useful":3,"cool":1},"95ttVTWA7tqZMqxR58wyTQ":{"text":"If you're in NOLA, this is a must visit to see a true NOLA jazz music. The bands that play","useful":3,"cool":0},"w_xk_21ijKoZBVhIWQKkew":{"text":"Imagine, if you will, an oven, set at 350. Now imagine a rotisserie chicken, with succulen","useful":6,"cool":2},"tng60vMTNweX3AjzaZ1Ktg":{"text":"This was an awesome experience! It truly captures old-school Jazz. We listened to Mark Bra","useful":0,"cool":0},"ZA8kM9hLd9BrVAcYeZ9Ezg":{"text":"Had a very bad experience trying to get accommodations for my GF who was in a wheelchair. ","useful":2,"cool":0},"CS31HR27ZNhXQ6JsxQLQxg":{"text":"This was the highlight of the weekend trip in New Orleans. \n\nThe price changes based what ","useful":2,"cool":0},"FXBFjrerOfYTjnsSBT4QdA":{"text":"I am a rules person and the  more info the better. This is what I learned.\n1) doors open a","useful":7,"cool":2},"I4KpjisNjafgln9uLCA5Xw":{"text":"New Orleans = Music = Preservation Hall. This is a must visit when in NOLA. The place is v","useful":0,"cool":0},"6pWu4GkzUC_P4lu-0g1Nmg":{"text":"Sit on the floor or get out- The staff's treatment of older patrons here was frankly disgu","useful":1,"cool":0},"NFY8xhUbUjAow51r_V8ZDQ":{"text":"\"I was BLOWN AWAY\" Doesn't give Preservation Hall enough credit how incredible experience ","useful":0,"cool":0},"YbxOKZMCpP04TTiGXfr1KQ":{"text":"Create experience! I would definitely recommend getting the bjg shot tickets, i was able t","useful":1,"cool":0},"CSxXiS_csMhYziie-LQxQg":{"text":"If you travel to New Orleans,do yourself a favor and stay away from Bourbon Street for one","useful":1,"cool":2},"DBvfeFLiQJMDiz4yKPfJQA":{"text":"Highlight of visit.  HOT in there.  Worth it.  Great acoustics, just loud enough.  Bought ","useful":4,"cool":0},"0nYGmrmo74JMiY8_XE-bbA":{"text":"Girls trip to NOLA included some VIP tickets to Preservation Hall. The VIP seats were benc","useful":0,"cool":1},"2BciMmr5bjRS_aULpy4MFA":{"text":"Read a lot of reviews about Preservation Hall. It was one of those \"must see\" while in New","useful":0,"cool":0},"uJ7ySOLy51bj9giBQVopPw":{"text":"So I'm waiting to get in for the show.  They give you this whole spiel about Pres Hall...b","useful":1,"cool":0},"7FfBCRl03u_nd5VVxMrdlA":{"text":"Such a cool experience.  The music was excellent....by far the best music we heard during ","useful":3,"cool":0},"Tzdg015PtOv_KAFV3NamgQ":{"text":"We paid $50 a seat to be in the first seated row. You sit on a wooden bench and are packed","useful":1,"cool":0},"XGOvlYzMwUQtXwg0zDPcCg":{"text":"Wow!  What an experience. We waited in line for an hour and a half but it was well worth t","useful":1,"cool":0},"wfNSBJ5zEADVSrxKHeaalA":{"text":"If your into Jazz this is a non miss. Iconic and historical. Bring you own booze so be rea","useful":0,"cool":0},"A3avyNdNDZttW_9rDzHQyw":{"text":"My wife and I went here last night and we had an amazing experience. The music was amazing","useful":2,"cool":2},"Y_UK12Nn8SqoZV_81BPp5A":{"text":"Every Jazz N Blues fan must hang here!  Oh and if you do, show up in line at least 30 minu","useful":1,"cool":1},"suvsxr2a3jgNZMsOTyDdYw":{"text":"ABSOLUTELY INCREDIBLE!\n\nCame here with some of my girls during our NOLA trip and luckily d","useful":7,"cool":5},"-48MfvdtsqtZczyLnzVtfA":{"text":"This was one of the biggest ripoffs of our vacation here in New Orleans, a city that we ar","useful":1,"cool":0},"5P63zgNg3auugMgLWr4F2g":{"text":"This may have been good at one time, but certainly not tonight. The instrumentalists were ","useful":2,"cool":0},"SbKvcegf3XjKiWqh87-58Q":{"text":"Who doesn't want to be entertained when visiting NOLA? Many come to party and sure, almost","useful":32,"cool":31},"qZfZd8pumnr6iuoLYlRjdA":{"text":"A must do! We stood in the back. Got there at 7 for the 8pm show and we're some of the las","useful":0,"cool":0},"NkbhK5295MUFXlcUKb1dtw":{"text":"My wife and I went here last night and we had an amazing experience. The music was amazing","useful":0,"cool":0},"q8CvGRJByt9tFsPPnLptXg":{"text":"As much as i loved the music, there were portions of the 45 minute set during which my 7 &","useful":0,"cool":0},"WQgjAT2qUGGPTk3EUwbRPA":{"text":"True New Orleans, Ladies & Gentlemen! \nThe best traditional jazz in the world. \nTips: No a","useful":3,"cool":2},"5HtdIJ8U1RmDO2U-jFYpYw":{"text":"Seriously, I don't know why you would give Preservation Hall anything less than a 5 star r","useful":1,"cool":0},"i1Wte3dOx8drBGIu5sZnjQ":{"text":"Hot.\nCrowded.\nMagical.\nSkip the other 2-drink minimum tourist \"jazz clubs\" and come here a","useful":1,"cool":1},"67IqpY_XqSI5FQAMraRFYw":{"text":"This was the best thing we did in New Orleans hands down. It is so old, such a part of his","useful":1,"cool":0},"SM3wgPRHBW_6Ten74hgkNA":{"text":"Jazz, if you're in NOLA, it's a must.  So is preservation hall.  This place has been aroun","useful":1,"cool":1},"hy-NIZMthNvak_gja2HexA":{"text":"Music was great.  Problem was, the lady at the gate took our money and didn't bother to te","useful":0,"cool":0},"U6O078Cotu7VDK8z7hnoAg":{"text":"All the reserved seas were sold out, so we had to wait in line for 40 minutes.\nI recommend","useful":0,"cool":0},"6t-A0nWhS5CBySaLq1jELQ":{"text":"Here is what you need to forge a proper Salvador Dali mustache:\n1. mustache wax\n2. Kinko's","useful":9,"cool":10},"DnbCDo_MOKUqaX01_bh0eg":{"text":"If there's anything you do down in NoLa, this has absolutely got to be one of them! The li","useful":2,"cool":2},"aHKkRbXBS9ILikm-vGjydA":{"text":"Loved it!  If you are in New Orleans and didn't come here, why are you in New Orleans?  Su","useful":0,"cool":0},"wV9pJxCNQaTVUD-VCF7WYQ":{"text":"I think a show at Preservation Hall is just something you gotta do as a tourist in NOLA.\n\n","useful":3,"cool":2},"Fef4AWg2zGT7xL1-5VNAzQ":{"text":"The line  as long but it as on our list of things to do while in NOLA. The show was so muc","useful":0,"cool":0},"LADJ3CyzOA6Dcb-drMHyXw":{"text":"I guess ratings for this place depends on who is playing.\n\nI have seen the Blue band play ","useful":0,"cool":0},"2RHvGtweDazP8L2rGE0I9g":{"text":"If you are in New Orleans, then you really have to visit this place. But getting a reserva","useful":3,"cool":3},"L-YnpVqvfxiGJ0ABoBowqA":{"text":"This was second visit, after nearly 10 years. We revere the space. We love jazz.\n\nWill Smi","useful":0,"cool":0},"nlukBAifgDL3NaNjWRt-zA":{"text":"Amazing! Expected a fantastic instrumental but had no idea that the voices would be so gen","useful":0,"cool":0},"cdlN_Lr6B-qvvPEpyn0y3w":{"text":"Preservation Hall is a venue I'd recommend to visit once for the experience, but that's it","useful":5,"cool":0},"oXrsl-Fgp5K0JOlmLlb_yg":{"text":"It doesn't matter who you are and what type of music you normally listen to, just wait the","useful":1,"cool":0},"J6_PQXs-5nCojZ6WabwvzA":{"text":"Loved this place. Had a great time, band was amazing and the perfect jazz experience I was","useful":0,"cool":0},"078amDTrfCArsudJOo7tKQ":{"text":"This was the BEST touristy-thing we did while in NOLA: you've got to go!\n\nKnowing it'd be ","useful":11,"cool":7},"KGdtuUHdVvTpcm5bs9D2Cw":{"text":"Glad I found out about this jazz gem at the beginning of my trip because I will be back! L","useful":1,"cool":0},"4eObLd2v83_NScvKaiul0Q":{"text":"Underwhelming. Wait in line for almost 2 hours, pay $50 for reserved seating which was jus","useful":2,"cool":0},"iNiZz7pJDcjRvg7R_3A9Iw":{"text":"Fantastic! You can't play jazz like that without an amazing bass player. And the bass play","useful":0,"cool":0},"GDyHjyvr0033wHLxmNmnfw":{"text":"they have 3 performances a day. Their last show is at 10pm. It looks like old-school class","useful":0,"cool":0},"7vYVQtOZYhDYfp-0e2-XAQ":{"text":"How I learned to stop worrying and love Jazz.\n\nMy GPS took me to a little unassuming hole ","useful":0,"cool":0},"lLIAkRBwYUH0wyMH8tmquQ":{"text":"$20 cash only if you buy tickets at the door (which also means you have to wait in line fo","useful":3,"cool":0},"5z7lu1ibOQTwB6Yr84Ll7Q":{"text":"Came here for a jam on a Saturday night,\nthe crowd was a bit stiff, but my party was alrig","useful":5,"cool":5},"Je640TA770HypGzSCc50kQ":{"text":"I've attempted to get standing room seats twice here, but the lines were too long. Honestl","useful":15,"cool":4},"Bph4kdWAU5B10YBmGOtrEQ":{"text":"Loved this place so much. We have been going throughout the years whenever we visit NOLA. ","useful":0,"cool":0},"F_ZORDXFrUWVvWiAa8muBw":{"text":"[Pre-Covid] This was such a fun and interesting experience that is unique to New Orleans. ","useful":0,"cool":0},"Djpc_w-4DFygeanHGvKBuA":{"text":"Amazing.  Amazing place, amazing performance, and amazing sound out of this room where you","useful":0,"cool":0},"-eAa2e60fbDVpCfvPf66Ww":{"text":"This is a live music venue. Its really a room with some areas for sitting and the rest is ","useful":6,"cool":2},"F_ra_x65czXjp_CxyFHHxw":{"text":"Ok, so this is a prohibition era entertainment hall, you HAVE to purchase tickets and you ","useful":0,"cool":0},"N_GUR2lKPxGUQ442ycXkkg":{"text":"What an absolute treat! I had the pleasure of seeing the Preservation Hall Jazz Band last ","useful":13,"cool":15},"_oTLSthWRLPx9rz4fX5jBA":{"text":"Preservation Hall is well worth the visit. Why, you ask, when it is so easy to find great ","useful":5,"cool":5},"p6CR6goOmoJGsKpXC6eYiQ":{"text":"The space is small and crowded and waiting in line can suck, especially if it's hot, but t","useful":2,"cool":1},"AeFY-wZcHm9pM8KyYXU2NQ":{"text":"This is a life changing musical experience. If you even *think* that you might like jazz, ","useful":0,"cool":0},"e7unRB0BLf9UlWMd6kXOnA":{"text":"IMHO this is a must see in NOLA.  The experience encompasses what the history of this area","useful":4,"cool":3},"KQ2AN3juSZWUrBTaK0xkdw":{"text":"Preservation Hall is just one of those places you HAVE to go to in NOLA. You really get a ","useful":2,"cool":2},"0A7RRmdhphh6xy-vOGP5wQ":{"text":"If you want to experience true jazz in NOLA, you have to go to Preservation Hall! \n\nThey h","useful":7,"cool":9},"cqDeJaxrIoD00LjXwwFqGA":{"text":"This was awesome, a great way to spend not very much to see super talented musicians who l","useful":1,"cool":0},"SHUnV1D-20vBlm-y1GwJbA":{"text":"Chose to sit on the floor!! They have two rows of floor pillows and the first row right up","useful":5,"cool":1},"u9GpnG2dLzKLnSq_RP4gNQ":{"text":"Great music! Enjoyable my only complaint was we paid $40/ticket and 4 songs were played! $","useful":0,"cool":0},"5bcYjuIcHYaiZNKbEn5DTA":{"text":"So having heard about this place and wanting to see some iconic New Orleans spots and musi","useful":3,"cool":2},"iVwHZMWNB8b654LZAaVkJw":{"text":"Very cool must experience kind of place. You can avoid the classically long line just off ","useful":1,"cool":0},"16vkkDj2emNvAcewCedy9w":{"text":"Tisk Tisk Tisk! \nIf you visit NOLA and don't make it a priority to come see a show at Pres","useful":12,"cool":12},"5ee48ogu1eXWZVG5rJhPhw":{"text":"We didn't want to wait in line and risk the possibility of not getting tickets so we bough","useful":3,"cool":1},"QfzCIhqd5ip7MjIOit8lDA":{"text":"This is it, the epicenter of all that is eternally fabulous about the New Orleans jazz sce","useful":5,"cool":2},"sPPjBK9Rk7xztNUPcb9SMw":{"text":"There is a small, old, very quaint, intimate no-frills venue.  Definitely has that feel li","useful":2,"cool":0},"A9Xh78rUXHHpVcV5YqPFlg":{"text":"Preservation Hall was probably the most disappointing night that I had in New Orleans. We ","useful":6,"cool":2},"AqW4vWmLSiJ0ai6BzkRtew":{"text":"Preserving a Bit of Music History\n\nWe waited in the long queue forming outside the nondesc","useful":0,"cool":0},"rnsSJ_UEoYCOIWxFV2vzwg":{"text":"I am so glad I came across the website for Preservation Hall when I was planning our visit","useful":0,"cool":0},"2_rmdTytBgg3pZ_KHPVXbQ":{"text":"The show was way too short but the talent was undeniable...music seeping from their souls ","useful":0,"cool":0},"wM6vEVK0WboqjsOsXFfVvg":{"text":"Worst show experience ever!\n\nFirst of all, I (still) believe that there are probably good ","useful":3,"cool":1},"R-RPzuXdG8olU2rPPLY-vg":{"text":"This is a must stop on your trip to NO. It is a real treasure and it was great to hear aut","useful":1,"cool":0},"kOgdJxSTaek-bmwD2z6Akg":{"text":"An absolute must when in NOLA. Cover charge of $15, small intimate venue. Show is relative","useful":0,"cool":1},"XBN2vZVk7Hj6-UW4xi1ytw":{"text":"So...the music is awesome. There is no doubt. And the room itself is very cool. Problem is","useful":1,"cool":0},"vMytwAAzjrv6h3ZsPX0JrA":{"text":"I typically reserve my Yelp reviews for restaurants and bars, but I had such a wonderful e","useful":0,"cool":0},"DQy0hdFLs8zNVWsefUHuxw":{"text":"It was a dream come true sitting in the second row and watching these magnificent and happ","useful":0,"cool":0},"D4cd9O70oT81Tzd0o2pTtA":{"text":"This is simply a New Orleans \"must-do.\"  Traditional jazz served up by musicians who can r","useful":4,"cool":0},"GazqiWy42keadSVgUE_xmQ":{"text":"While the event planning committee (me and my girlfriend) were researching what to do in N","useful":0,"cool":0},"FrqNgKyNeocbwN2Y1IlgBg":{"text":"One of my favorite jazz experiences. Real musicians, intimate, so worth it! Reserve ahead ","useful":0,"cool":0},"LPYCrDhsfN-oQWYmW_lWZw":{"text":"Worth the wait!! We waited over two hours (Christmas Day, got there at 3:45 for the 5 pm s","useful":4,"cool":0},"p4CNiiGkv1OY-ol6J_em4Q":{"text":"Incredible Jazz music played by finely dressed men in a hot, sweaty New Orleans venue, far","useful":5,"cool":4},"0WOE7iB3KxHxMEM6Pqq2kg":{"text":"There is a house, \nin New Orleans, \nThey call Preservation Hall,\nA museum of music,\nPlayin","useful":8,"cool":10},"L4vmDh6hSRf3uXUoDglpbg":{"text":"700+ reviews, and all 4+ stars? I don't think I can really add much that has not already b","useful":9,"cool":13},"JXnp0yF5cWVS8l0dXqzS9g":{"text":"This is a review written pre covid in February.\n\nLovely place to see jazz music in action.","useful":0,"cool":0},"T-zDzQ2JO8G7-tKgp1PXLg":{"text":"The music was really good. We made reservations which cost a little extra but got us seats","useful":1,"cool":0},"Lh-U9-n7oRvust1CxYI54Q":{"text":"The band was wonderful! The room is tiny, maybe five or six rows and there is no A/C or so","useful":0,"cool":0},"yuXJyZ3r5yqIr1UH9Eosnw":{"text":"Head hear for authentic jazz. That's really all you need to worry about. The place itself ","useful":2,"cool":2},"4fMQIxUw9St49uhSXdLBiQ":{"text":"Quirky little tourist spot, $15 cash only for admit, and despite the signage encouraging o","useful":0,"cool":0},"_IZTZ2sppHE4d4TNsgZoWA":{"text":"New Orleans to me is not Bourbon Street like it is for some....\n\nSomething completely awe-","useful":6,"cool":5},"qvjelFFm_wshS0EThK_--w":{"text":"What was interesting was, most locals I asked about this place didn't even mention preserv","useful":0,"cool":0},"_LpRgwnEVyqli7Xet6cvug":{"text":"A NOLA must see! Great jazz at its finest. Worth the wait. You can go to a the site and bu","useful":0,"cool":0},"-vYu4Wb8kk76BdIYbrgtZA":{"text":"This is a must for Jazz-lovers and first-time visitors to NOLA!  It is a wonderful experie","useful":0,"cool":0},"SpCKjOPTyp2Yb3My2mJb0Q":{"text":"Incredible! If you don't enjoy this, YOU are the problem! Such a private venue to watch an","useful":0,"cool":0},"SBij28qmAUKB60EBicP38w":{"text":"Preservation Hall is a magical musical place.  I felt like I was transported back in time ","useful":4,"cool":2},"5QQHDzWFdj7wVNj3jvWoKQ":{"text":"I highly recommend this place for anyone looking to see live jazz in the French Quarter. I","useful":0,"cool":0},"PCMh_FO-XHaarXwdm6llTw":{"text":"My husband & I tapped our toes & enjoyed tonight's 5pm concert at Preservation Hall.  Wait","useful":0,"cool":0},"jnEG3gcM3Rgnr_Q90FljDA":{"text":"Those time coming here, and it never disappoints!  Come early before each show time you ar","useful":2,"cool":1},"bw6GcmJWqG99eu1YjEX-JQ":{"text":"Hands down my best experience in New Orleans. I don't know much (not nothing) about jazz a","useful":0,"cool":1},"mdslXiEz4jdaz3O4m4GaTg":{"text":"Definitely a gem for traditional jazz. As a student I took advantage of the $10 student di","useful":2,"cool":1},"ehE3Aino-Qfw8dMKyo9xSA":{"text":"When in NOLA, watching a jazz show was a must do. I weighed all my options and read many p","useful":3,"cool":2},"H50klbuJl6TApjG0GdUjnw":{"text":"We went on a Wednesday night (7:30pm) and the general admission for seated & standing were","useful":0,"cool":0},"4iXwy_HH42PUF-Uv2SC4sA":{"text":"If going to NOLA, Preservation Hall is a must. This was one of my favorite things I did wh","useful":25,"cool":26},"tLZ7Z7-VqSG93WSu8uI0Sw":{"text":"Recommended to me as a taste of New Orleans - and I couldn't agree more! \n\nThere is no nee","useful":3,"cool":2}}