{"tMYKgNhzDEtFbqz9P6YDDQ":{"text":"This is a homey, junk-filled joint not unlike a garage you might see on television.  The o","useful":2,"cool":0},"YlX2GRH7r08BC-yYxUP3Eg":{"text":"I'd ONLY come here if there is a good band playing, otherwise heeeelllllll no!  The barsta","useful":1,"cool":1},"fLlThQOoirIrVv8PvX9Rbg":{"text":"Even on a quiet night this place is fun. We talked to the bartender for about an hour befo","useful":2,"cool":1},"oMtU0ejNRrn0qeI1Fbbdjw":{"text":"Went on a Saturday after a friend told me there was Mod Night there once a month apparentl","useful":0,"cool":0},"xe53_kripij1Il7_8UdmtA":{"text":"The bar is your typical dive bar in a gentrifying, but not yet gentrified (as in you bette","useful":2,"cool":0},"6AMJN8PM6kt3jc081tYSvA":{"text":"I was so glad to hear of Saturn Bar's return. This place is truly legendary. Remember that","useful":1,"cool":0},"pDVoJqBMeDwaR1taLs8bkw":{"text":"Saturn Bar is a serious dive.\n\nLocated in what appeared to be a fairly sketchy neighborhoo","useful":5,"cool":6},"NoM1w_Ttdz44qR3Mk67TYg":{"text":"Saturday night we stopped in and were the only people there.  We couldn't have happier her","useful":4,"cool":4},"bHcb42NqNJDWDJLbllpSLQ":{"text":"This place redefines \"Dive Bar.\" I had a blast here, but mainly because there was a giant ","useful":1,"cool":1},"uxfz16EdoWwjdssB0w1kmA":{"text":"As much as enjoy this place I wish the powers that be would do some minor maintenance on s","useful":0,"cool":0},"7iLXjTNViZhrcf-5thfDdQ":{"text":"I loved the original bar. I remember going in there eons ago when they had the screen prin","useful":1,"cool":1},"9OJTZoXThScA6ZC4w2K8Pg":{"text":"Fun dive. Saw Happy Talk Band there. Very nice.","useful":0,"cool":0},"9TKkURRB4hfKJOE6H_yfew":{"text":"Thankfully, a friend told me about Saturn Bar during my visit. It's about a 5 - 10 minute ","useful":1,"cool":0},"q6Tw8m3l9ZOBfNn-HVtK1A":{"text":"Cooly Unique New Orleans Dive-Bar .. Like it? Yeah !","useful":1,"cool":0},"hrACtOnppQeDE1iP2xM17w":{"text":"Last weekend, I made the arduous few block journey to Saturn Bar to enjoy the originally t","useful":0,"cool":0},"ty4Amg-O-ju0GEJFcYBOVQ":{"text":"oh jeez!  i really loved going to the saturn bar.  I wanted to go more often when i could,","useful":3,"cool":3},"Wb7ZqDmX8bUs89NKijs9Jg":{"text":"The other reviews have made it clear that this is a dive with a lot of sweat and loud musi","useful":2,"cool":0},"S0gOsa2q-bE30hWesO3vFw":{"text":"Well, it looks like I'm on a dive-a-day tear here, fellow Yelpers.  \n\nLast night I returne","useful":3,"cool":3},"ZJv8QFe39y2a18jL3VZDHg":{"text":"The acoustics in this place are amazing. It's like being inside someone's house listening ","useful":12,"cool":4},"-oq9kQaRgLwnYk4QFf0JPQ":{"text":"I hit this place up after our Airbnb host suggested it as a good dance spot for a Monday n","useful":1,"cool":0},"8qAP1ec-OtOvTbk010AHPQ":{"text":"This is one of the shadiest dive bars I have ever been to... and I ALWAYS have a good time","useful":3,"cool":1},"YJxK4Z7Z8Pv1RQmEr6xeZQ":{"text":"Saturn Bar is a great little divey bar away from the Bourbon Street area of New Orleans.  ","useful":0,"cool":0},"NlPbYANXMzqr2yENbKxizA":{"text":"(This is a review for the Saturn bar under O'Neil, just a nice memory...no opinion of the ","useful":4,"cool":6},"TRWW12DfBUFybUpld_WLAw":{"text":"Good vibes, good booze, good tunes. Amazing music Monday night. And keep your eye out for ","useful":0,"cool":0},"HeZGh8s3v5BTmZ81h0f2XA":{"text":"I liked the old Saturn Bar a lot more because the \"new\" Saturn is full of hipsters and I d","useful":1,"cool":1},"d30xvlSEkGQPDK8wFuAVDg":{"text":"A special thanks goes out to my disco jockey talent of a friend who made this night redeem","useful":0,"cool":0},"3MTovUEN83B2FNMA6z1xZQ":{"text":"They got sunchips. Ain't nothin sunny about em. \nShe opens when she wants, no two ways aro","useful":4,"cool":2},"zm3b4LfzP7N2NBL7yIBKOQ":{"text":"Sorry I don't fit in 20+ category so I may not be hip enough by today's standard. But for ","useful":0,"cool":0},"vhjyFvv4pu2NyWWMBi7mtw":{"text":"Just another pointless review by me for the long gone Saturn Bar of ONeil before he passed","useful":4,"cool":9},"rToDUN7K7EmR50Mi6Pgbhw":{"text":"This is God's dive bar (or the Devil's). Well worth it for hipster types and music fans. T","useful":0,"cool":0},"ah_GFcTlvCy_SnQcjoocag":{"text":"I don't even know what a \"hipster haven\" is, so when someone mentioned that this is what S","useful":6,"cool":4},"JBU1bQoB4r7mEjdzH6ZxPQ":{"text":"Sometimes it smells so gutter punk in here it's hard to stand. But most of the time the da","useful":7,"cool":4},"fAp4usvAEXcouhsGz_pDMA":{"text":"Came here during their Mod dance party... so fun! This is an awesome little dive bar with ","useful":1,"cool":1},"rm5-kDzVuQTHr5Eh_4Opug":{"text":"This may have been my favorite bar that I visited while in NOLA, and I think that was main","useful":1,"cool":0},"stKkFY5j3rmklSNBbwUHUg":{"text":"I liked the confision it causedf Mwe to have as to why all the junk was in the bas, like o","useful":1,"cool":0},"vybWSDmSWaNmw16Wvi1bCg":{"text":"Awesome art good basic drinks. No Negronis. Tops. Must go. Good story tellers there on the","useful":0,"cool":0},"Nww14D2Q_G8q7s799zyVGQ":{"text":"This is a bar for kids and punkers. I enjoyed it for nostalgia's sake but give me Jimmy's ","useful":1,"cool":0},"ljo4pN0zG07fa3jluM_gwg":{"text":"While I'm not a typical cool dude that hangs at divey places, a buddy of mine made me hip ","useful":2,"cool":2},"MXXuEE58OyWNfgTkWwKJxw":{"text":"It's a dive bar....we ventured because a person in our group has close ties to High Dive i","useful":0,"cool":1},"BS_uAm-DDOPO372Jbcf3tQ":{"text":"Perfect little dive bar w live music. When you miss your local dive and your in NOLA the S","useful":0,"cool":0},"Qzl9lm7hivqaRzSb-m66aA":{"text":"Tucked away in the Bywater neighborhood with an unassuming exterior, Saturn Bar was a char","useful":3,"cool":3},"l98TIl8OjlEeECuCsCUMGA":{"text":"Let me preface this by saying I actually love this bar. I also realize my review is a litt","useful":8,"cool":8},"pm0TuPyWMQCx-h17SjmQtw":{"text":"Whoa. Wildest dance party ever. Lots of hot people packed the dance floor and 45's were sp","useful":0,"cool":0},"l0bf69NLfSppjGQn5ZC1QA":{"text":"An old classic bar..,it has been there over 62 years and maybe much longer ....Now days it","useful":0,"cool":0},"seMboIKFuJElCaoMozWZ5A":{"text":"I wish I had a dance place this amazing at home. \nTwo levels of pure dance and great music","useful":0,"cool":1},"bqHIHOHGJQ-WMMJtTHFJww":{"text":"Greetings class. I am Professor Pabstsmear and welcome to SATURN 101. Please check your cl","useful":11,"cool":11},"9hc9kQuHK-iGxx8jtUGnUw":{"text":"Hipster ambiance, really?! So normally that's a no-go for me. Luckily Saturn Bar had the e","useful":13,"cool":7},"KR-CPyCdoQQPDZzgHYyfbw":{"text":"Diviest of the dive bars, in a good way!! Bad art, cheap drinks, crazy locals who wanna bu","useful":8,"cool":3},"kvAHvNo7Ir-2VCbFfc3R0Q":{"text":"It smells like cat piss, the cat's mean and I'm 99 percent sure it's haunted. Pass on this","useful":1,"cool":0},"CQ1zQLqh4DtmL3VnH4dQqw":{"text":"Bar owners and staff are extremely rude and not supportive of the people and of the neighb","useful":5,"cool":0},"Fzhx3teubx8_tX7Dn7YB2w":{"text":"I guess I can file this place under the \"places I don't get\" file. Reviews are decent. Tha","useful":4,"cool":0},"iJhzAOdD9rdsXVrmLT44FA":{"text":"Well East of the Quarter. One of the Weirdest places I've ever been in, but one of our fav","useful":0,"cool":0},"rBOCaJLC4kj9SmafCfCbRw":{"text":"The Saturn is closed and up for sale as of my last visit here in Spring 2021.","useful":2,"cool":1},"790pSMYJ-CEgaidHnKummA":{"text":"Agree with other reviews that this place is not friendly to locals, seems to cater to a tr","useful":1,"cool":0},"fL6wS3KTOSdtlNpke1xUVQ":{"text":"We were barhopping on horseback when we stopped here.  We tied the horses outside so we co","useful":3,"cool":2},"FbHpXszVu82Me8Zcuyp9wA":{"text":"They are open! New owners?  No lit signage, boarded up windows, bags of garbage on the str","useful":1,"cool":0},"ervSAqmarmy7jU0XvO5pUQ":{"text":"Tried to come here with my family during Mardi Gras. Unfortunately, I had lost my ID the n","useful":1,"cool":0},"hoe1ttGJKr5WkOz1qRL81A":{"text":"I don't know when dives became synonymous with hipsters. But it's happened. At least that ","useful":0,"cool":0}}