{"AxvgnGxtVdxEz6gJg1gf4A":{"text":"Hickham Dermatology is the only place I trust to handle all of my skin care needs! I have ","useful":0,"cool":0},"-KQHq_vtMJ4XV-S3kwdKog":{"text":"Great new  location! Dr. Hickham and her staff are always professional, as well as kind an","useful":0,"cool":0},"DL7ZjOIEJw5TUjUUBlKczg":{"text":"Dr Hickam has been my dermatologist for over a year now and she is very professional, extr","useful":0,"cool":0},"2Nsi8Md_G26JN1VIK1a1Cg":{"text":"I was extremely nervous about getting any type of facial injections bc I am extremely fear","useful":0,"cool":0},"uCr4tEw36Eqb1n18LRRJVA":{"text":"Everyone in this office is so awesome. Amazing Doctor. Both my husband and I really love t","useful":0,"cool":0},"XM_BweamXc12-kdc2XUkKA":{"text":"I've seen several dermatologists over the years for my very problematic skin but have not ","useful":0,"cool":0},"VLwUcqpw25-ct8MP6OGc2Q":{"text":"I hadn't been to the dermatologist in years. And it was definitely time for a quick mole c","useful":6,"cool":3},"OVn3QTVlGdwrQcQ21G_wYQ":{"text":"Love this practice. Covid compliant. Quick patient turnaround with little waiting room wai","useful":1,"cool":0},"1mjiD80wSYWLZUUVaatjyg":{"text":"This was my first time at my dermatologist's fancy new digs on Bienville. The space is gor","useful":2,"cool":2},"zr5ALeamjqSS6Ff-YQRyRQ":{"text":"They get you in and out very quickly which is nice. They have listened to my concerns and ","useful":0,"cool":0},"csRBo4_qEMSjczmssOWDAg":{"text":"I've only been to one appointment but that one appointment was great. My old dermatologist","useful":2,"cool":2},"rMhB8tws3rth9kD30fm98A":{"text":"This is my first, and only, ever review. Ive never felt strongly enough about an establish","useful":0,"cool":0},"UBzMgfGj0VmIuczUP8_Ocg":{"text":"Recently received the \" Halo \" procedure at HIckham Dermatology . I was VERY Satisfied wit","useful":0,"cool":0},"QlCUybJfuPY0PFuCbkATeQ":{"text":"Hi I'm Todd I just left DOCTOR HICKHAM'S office . Wow where do I start phone etiquette was","useful":0,"cool":0}}