{"-ck-HA4NIRM4aerzXMzdXw":{"text":"First and last time eating here....\n\nI held my self for a week before i wrote this review/","useful":0,"cool":1},"3R8wPEyB5_CUVAd2Rn5WNQ":{"text":"For my first taste of raw oysters this was the right place. The gulf oysters were so fresh","useful":0,"cool":0},"Hzy7wwEl5E34ZYU_LpwhYw":{"text":"I dunno about this place...girl at the front first completely ignored us while sticking he","useful":3,"cool":0},"4TkfmjJHBx4ZBfdDdMjxYg":{"text":"I'll tell you one great thing about this place is the food is excellent. You can't beat th","useful":0,"cool":0},"gBXJtgm6KSsK3LH2VQGWdw":{"text":"I've lived in New Orleans for my entire life, and my latest visit to the Blind Pelican ran","useful":0,"cool":0},"jWZBssP1vF5uulHcUFz0JA":{"text":"Bruna was amazing!! She helped coach me on my first time trying oysters even though it did","useful":0,"cool":0},"0mDDnjaVsM9LsStf53skqw":{"text":"Can't say enough bad things about our experience with this place.  We showed up at lunch w","useful":0,"cool":0},"s7L52oZx1gY6SVQkXCsR-w":{"text":"This was the first stop on the 24 hour food tour in New Orleans when visiting a friend. I'","useful":0,"cool":0},"cTApHXn-REFL3HJJysWelg":{"text":"Wait staff and food are top notch. \nExcellent food and service, best service we received a","useful":0,"cool":0},"dmgLpwS2MPFVyyu2Y8hgfg":{"text":"Drinks were great. Good prices for happy hour. Oysters were awesome. Waiter was lacking a ","useful":1,"cool":0},"va8sA7mSXMxxYJyLTzj9xw":{"text":"If you're an oyster fan, this will probably be a 4, as their ouster specials are really go","useful":10,"cool":7},"hSr3cNsvBI-5EUWmm8BbqQ":{"text":"WOW. Bear yourself because this was absolutely insane. My friend and I came here for dinne","useful":0,"cool":0},"qIOw7twpNbzVyHaxGN8GTw":{"text":"Went here for hh oysters yesterday. The hostess is as unprofessional as they come - totall","useful":2,"cool":1},"-_Wlpcpq7o96cgtnSRn5fw":{"text":"Great sandwiches and awesome happy hour! Jimmy the bartender is the bees knees.","useful":0,"cool":0},"RhwoRyHYW_oCXNjgnx7Hig":{"text":"I've been waiting to try this spot with their 25 cent oyster happy hour; however, it was a","useful":3,"cool":0},"xESAQJ8dnGqJSiXIocuUkA":{"text":"The grilled oysters are so good! Happy hour gets you a dozen for $7.99 with the purchase o","useful":0,"cool":0},"rHMi9bO1aLiMSn619xFVtQ":{"text":"**Note to self...\n\nSelf, don't bring your ass here for happy hour ever again if it takes 4","useful":7,"cool":2},"bbWbmFGnkoUeUk49ffSEww":{"text":"Cheapest happy hour oysters! .25 cents a piece. Gett'um grilled for a little more if you l","useful":1,"cool":1},"Uwpbfty7g_xm-fP8Xb2pCQ":{"text":"Amazing food. Great beer selection. Outdoor seating was fantastic. Highly recommend the ra","useful":1,"cool":0},"F4oU6KX8be9OSSNbmjAKsg":{"text":"How can you beat 25 cent oyster happy hour.  I pay $3 an oyster back in Chicago so we were","useful":1,"cool":1},"xsZftynof74UqNYRqmreAw":{"text":"Group enjoyed oysters and crawdads. Other was basic bar food exception pizza was fresh but","useful":0,"cool":0},"xtBDZLyrw6X0ArU3qdAd9w":{"text":"We missed the oyster happy hours. No problem. My first dozen of oysters came out slowly. I","useful":1,"cool":0},"L4h_Vbf1GnJmYyGDlhvpvw":{"text":"Just wow... never even got a chance to make an order and the prissy waiter can go to hell,","useful":0,"cool":0},"gP-7qI02yo7PTP5xXEuOOw":{"text":"This place seriously blows. The decor is super touristy, which you might've guessed. The t","useful":1,"cool":0},"z4dSykTSlJVueLYQ93PA9g":{"text":"3 words you will never hear or see in the midwest: Happy Hour Oysters. Awesome! My friend ","useful":1,"cool":1},"77GvR8FzWyeX3eyIvksLew":{"text":"Went to the Blind Pelican to partake of the nightly oyster specials with a group of 12 bik","useful":3,"cool":2},"dj2tGgZyMWei3O53I0KoMg":{"text":"My family ate here after a long hot day at Jazz Fest. The choice was a compromise between ","useful":0,"cool":0},"S9hX5ywjyqa6SaCu3IKncg":{"text":"Went for the happy hour charbroiled oysters deal.  I do not even like oysters.  But the ch","useful":0,"cool":0},"M0f2BW7MerCmXHQCIi1o3A":{"text":"Cold beer and crawfish what more can you ask for?  Now I guess, and from what I've heard, ","useful":0,"cool":0},"89E6xvp21XjqCtYkRh665w":{"text":"Love this place. Found if in on our way home. The half off oyster special was great, the o","useful":0,"cool":0},"elJr1O-01IszgNnz0VHcDw":{"text":"I wish so much to give them better as I'm a pretty fair person however we walked about a m","useful":0,"cool":0},"_UcsaCZvlDCgBWADcYLO4A":{"text":"Oysters on the half shell good. Shrimp po-boy and oyster boy also tasty. I can forgive the","useful":0,"cool":1},"HxuYQyYvXDj-Fe2DT0YLmw":{"text":"Best char grilled oysters I've ever had!! Jimmy is the best server ever! I'm from NJ and w","useful":0,"cool":0},"PxSPCxeZeTB11N9vU5LR8w":{"text":"Loved this place! We checked in our hotel and asked where would be a cool place to grab so","useful":1,"cool":0},"8z8mieLdbN49lO3CzmTK0g":{"text":"The charbroiled oysters are excellent. The staff make you feel welcome and at home. I come","useful":0,"cool":0},"irCD1itgMnfIpwaAGQXnTQ":{"text":"The oysters are fresh year round even though you're only supposed to eat them in the month","useful":0,"cool":0},"PCgZXeETFS7VEDZ_msyeEw":{"text":"Samuel's Blind Pelican is a restaurant located right on St. Charles, minutes away from dow","useful":0,"cool":0},"RbKjjBpB8jJdxjB40IQhNA":{"text":"$3 a dozen oysters for happy hour. They oysters were quite good, both the raw and charbroi","useful":1,"cool":0},"IPY7ymD9G2pXGayxuksQwQ":{"text":"Came here on the recommendation of someone who lives in NOLA. Happy hour from 4-8 is the b","useful":0,"cool":0},"M2BG_mdSIGx9tNFViMaOcQ":{"text":"Great prices during happy hour but the oysters had bits of shell where other places that w","useful":0,"cool":0},"yFWzcMVRXXUM-yc9g4tSDA":{"text":"Extremely disappointed. I was here for my last night in Louisiana and waited over an hour ","useful":0,"cool":0},"MsN0DCM52BoJ52bKKF8O6g":{"text":"I'd give this 3.5 stars really...a great spot to watch the game or have a drink before sta","useful":3,"cool":1},"4GWjDnjkcO98q_wCLS6elw":{"text":"Idk if the heat got to us or something, but our time here was almost miserable. there was ","useful":2,"cool":0},"VXooKyiOLb5cheXMFCl86w":{"text":"For what it is, cannot be beat.\n\nPatio seating on a warm day watching the streetcars go by","useful":0,"cool":0},"KjWOeGtgAr6vvoZsERj3QA":{"text":"Happy hour 4-8 was great and the oyster prices were fantastic, but that's were it ended. M","useful":0,"cool":0},"MrmE1a4puZFsGYew08ynwg":{"text":"Weirdest Place ever! Went here during oyster happy hour ordered some oysters and drinks, w","useful":1,"cool":0},"up8X5gfCZPBWOwaqZc3ULQ":{"text":"Friend and I went here yesterday.  \n\nAtmosphere- Great atmosphere.  Doors were open and wo","useful":2,"cool":2},"BFoINWnmkMZq1MRrA4aF9w":{"text":"Best oysters on the half shell EVER! Very friendly staff! Great cocktail choices...the Rum","useful":0,"cool":0},"QoeqZ6aSHCEHbzK7LEc83A":{"text":"I came to this place for the first time in 2016 and I loved it! They were serving their $0","useful":0,"cool":0},"s5z4SfRVVlLRBWlYoRJT8w":{"text":"A bit of a mixed review. Came here New Year's Day with some friends for dinner. While wait","useful":0,"cool":0},"EYBXu7kXexKZPkpLfOpl0g":{"text":"RIPOFF!!! DO NOT USE CREDIT CARD HERE!!!!\n\nI was there on May 29th.  I used my debit card ","useful":0,"cool":0},"9Zz9mALq6KfsuhAtezwwnw":{"text":"BLUF:  Amazing oyster happy hour.  Good atmosphere and staff.\n\n$0.25 oysters for happy hou","useful":2,"cool":0},"w1O0L1EsmAngvloPkKq1iA":{"text":"I am here for the happy hour and am satisfied. The deal is 0.25 cent raw oyster with each ","useful":0,"cool":0},"mlpllWVBWzObOf3GRV9viA":{"text":"Came here Friday night with gf, roommate, and roommate's gf for Michigan basketball watch ","useful":0,"cool":0},"yDbpIzn9HgOTqoH-T7sqFA":{"text":"Fish tacos were good though not as described on the menu. It had other stuff on it. Burger","useful":0,"cool":0},"ms_LdAzteJ4LmaqmP6axww":{"text":"Decent food for a sports bar, fish tacos had great flavor. Very much a sports bar with dec","useful":0,"cool":0},"IpZIWrN6N8p4J2hjK-St9A":{"text":"You can't get a better deal than the happy hour oysters at the Blind Pelican. Raw oysters ","useful":4,"cool":2},"h86tEqWK34bum15P3kLtFw":{"text":"I came to this place for the first time in 2016 and I loved it! They were serving their $0","useful":1,"cool":0},"jh0iFV7DfEFYk9I72iiUYw":{"text":"I'm not quite sure how much I can say about this place, as I've only been here for happy h","useful":0,"cool":0},"zN83C686WnnYfUPuIEFvfA":{"text":"Great spot to watch Mardi Gras parades while seated and no bs cover like other spots on st","useful":0,"cool":0},"T6vTwLl5OmtVq0MqEbCzlw":{"text":"The good: Lot's of tv's\nThe bad: Cockroaches, angry management, and dirty oysters.\n\nWe hav","useful":6,"cool":1},"j-ZK-R4PocGc-5tmpZ8CoQ":{"text":"I stumbled upon this restaurant on yelp while looking for something near our hotel. The re","useful":0,"cool":0},"af-AVlMQ2j01WKtJ2G7Biw":{"text":"oysters r good, service is attentive, drink pours r very very weak. get a beer and ur prob","useful":0,"cool":0},"J-U-A_oufFEHGmaMO5MNPA":{"text":"Honestly, the oysters were absolutely out of this world. And the food wasn't even the best","useful":0,"cool":0},"aWmbKmnoS4_HKP_CORvolg":{"text":"Highly recommend by the concierge lady where I stayed a couple of blocks away. Happy hour ","useful":0,"cool":0},"hWAKoOCZDVPOxmVXi6u_0w":{"text":"Went in for lunch on a Saturday and had the worst restaurant experience in my life. Orders","useful":0,"cool":0},"cUCaBVmupifpK0_uGEU56A":{"text":"I was recently here on 11/1 and the customer service was sub par. It was about 4:00 so not","useful":1,"cool":0},"43uLGUymNDNcl_k0O7q6TQ":{"text":"Excellent sandwich, great environment that relax. Fried green tomatoes were mouth watering","useful":0,"cool":0},"dF70e1U00jH_3RfHIu-j9g":{"text":"We wasted our last night in NOLA here. It looked so cool but we should've turned around wh","useful":0,"cool":0},"CfacYT76N1EArzF445Z4aQ":{"text":"Absolutely TERRIBLE service... after being told that there would be a 20 minute wait we we","useful":0,"cool":0},"ls6QJInr2maNM0boW71IcQ":{"text":"The waiter who helped us was super nice. The food was decent...this was all until I went t","useful":0,"cool":0},"Mld6rADcyR7Keuo41zZ7tQ":{"text":"This is a review of the bar only.\n\nAfter a long night out, I ended up here. I was in the m","useful":4,"cool":3},"jn5BZBN8f76ZLx8OU87xug":{"text":"Took 2 hours to get all of our food. Group of 10 people - two plates came out at a time ov","useful":1,"cool":0},"VZOIraCED4zEtAfNRfkJPQ":{"text":"Truffle fries and a hot toddy on this wet and cold day hit the spot!\nOysters were plentifu","useful":2,"cool":0},"xMY7qrOAmqsC5tZybvkq6A":{"text":"DO NOT GO. DO NOT GO TO THIS PLACE.  If I can give this restaurant ZERO stars, I would... ","useful":2,"cool":0},"N-_I9IpiBnLDluO32eMc9A":{"text":"I went for happy hour for the oysters Friday evening. 25 cents each. I eat allot of oyster","useful":0,"cool":0},"o9k3j8ADjsu0p24vzJH-6g":{"text":"We went for drinks and dinner.  It was a busy night and the wait staff were honest about t","useful":0,"cool":0},"fDlN_W9nQ8tvFTYxDhyzzw":{"text":"SO GOOD! Great oysters, great drink selection. You cannot beat this place. Especially thei","useful":0,"cool":0},"4w2pq2n_4v50xO2q7wPo0A":{"text":"We walked about 7 miles to come eat oysters only to be informed the kitchen was backed up ","useful":0,"cool":0},"mT93BT7d__U7Z5cxj9ltIg":{"text":"Never expected to find anything this good in New Orleans!  We've had big oysters from the ","useful":0,"cool":0},"Rr6en7hwTxnl-lg_PoaEqA":{"text":"I should have known better since I live in New Orleans. Went there on a Monday, and typica","useful":0,"cool":0},"pD80EVX-q2REFxk9MPBPLw":{"text":"Service was bad.  I think our waiter was a recovering Meth head.  Sat outside and seemed l","useful":0,"cool":0},"uDMVc3W-ke3B9NGEpVTeBw":{"text":"Cool place and setting.  Service was definitely lacking.  Food was so-so.  Mufeletta was g","useful":0,"cool":0},"gbjT4GggtxXsCh6W-BQiYg":{"text":"Such an amazing place, its crowded becasue its anzing. Dont be upset if you show up at the","useful":0,"cool":0},"_h0bPyV6FR-fbYzp6TYe3A":{"text":"If you are looking for friendly staff, seating inside or out, plenty of TVs for sports, a ","useful":0,"cool":0},"-1qicSVt7xh_I2A-nc69ww":{"text":"OMG! BEST. OYSTERS. EVER! And at happy hour - they are priced right for getting your fill!","useful":1,"cool":1},"Qk1ajolxMCIsL54ye_pP2A":{"text":"Blind Pelican has one of the best oyster happy hours in the city. Everyday from 4-8PM you ","useful":4,"cool":1},"n9c59ZFXGIk6FCWymQb7hQ":{"text":"The food is bland. No flavor what so ever. I had the blackened chicken sandwich and there ","useful":0,"cool":0},"UvtfPRWM80wMISu_k0o4-w":{"text":"My meal (a dozen char-grilled oysters and a side of alligator hash) was five-star, but my ","useful":2,"cool":0},"3fPTqANUMGhqCi2vyNzhTg":{"text":"Omg! Charbroiled oysters!!!! What??? Awesome...is all I can say....not to mention half pri","useful":0,"cool":0},"PGHIbELUvhFwxBGhqy39zQ":{"text":"Average food, horrible service.  This place looks great from the outside but don't get suc","useful":1,"cool":0},"ErSVmoRr5tXu_6VSt3MOPw":{"text":"So sad -5 stars isn't an option... I understand it is Mardi Gras, however, this is not the","useful":0,"cool":0},"XMglFwmo7kx_nKI-llyG2A":{"text":"Good raw 25c oysters and the charbroiled oysters are just as good.  The people were nice a","useful":1,"cool":0},"iR-92T-2Mck0jrGYgbejLw":{"text":"It was a decent experience. The oysters were amazing!  But everything else was nothing spe","useful":1,"cool":0},"L30WEz5kdTcBQa0KwomVOg":{"text":"Great oysters and great prices. They have a sweet happy hour! Lots of outside seating over","useful":0,"cool":0},"aK07zYxD1shnK5z7dW6upw":{"text":"Four stars for their happy hour oyster deal. Three stars for their drink menu. We came her","useful":3,"cool":1},"HvyEG9I_ntHATUaevAjFRA":{"text":"After staying on St. Charles for a week, this place caught our eye everytime we passed it.","useful":0,"cool":0},"ihghxL-EyyFiEkGotkExmw":{"text":"If possible, I would have given less than 1 star if I could.  I came here to eat due to it","useful":5,"cool":0},"S3b8LTx5Tw9-sTZd42MfJg":{"text":"GREAT neighborhood bar with really good food.  We stop in every time we are in town (3-4 t","useful":0,"cool":0},"_r5pz_oCetgpPS5vOlG_kA":{"text":"This is a great hole in the wall place that was recommended to us by a local. They have a ","useful":1,"cool":0},"z6mwg22v1cbn1WrjangpAw":{"text":"Omg...we've been here an hour and no food. The waiter can't even bring our table water. Wi","useful":0,"cool":0},"mbDX40FRH5Z331igG5arIw":{"text":"Lots of great draft beers and 25c raw oysters!\n\nWhat's more ... Friendly bartenders and wa","useful":0,"cool":0},"IFhbY7dvEQaJl3K0mW00og":{"text":"Came here for a drink outside. Nice atmosphere, good service. I had low expectations of th","useful":1,"cool":1},"KftuYhg3aPgfXwidyJh2KQ":{"text":"i dream about their happy hour cheap grilled oysters.  I'm not sure what I like more, the ","useful":1,"cool":0},"YXLZu-ZzhoDkuTrP-fl_Yw":{"text":"Recommended to us by the desk clerk during a recent stay at the Pontchatrain Hotel, my mot","useful":0,"cool":0},"LC8WLyRl4cOIPjd5fmJY5Q":{"text":"I will not be going back...ever. Party of 4 - were told they'd be a 1/2 hour wait...ok no ","useful":0,"cool":0},"VJg7opEzvxVEjThFlchtbw":{"text":"I only come for the happy hour deal. $0.25/raw oysters(minimum dozen) or $0.75/chargrilled","useful":0,"cool":0},"rDDi7AtwIs0ygB_O_yEOeQ":{"text":"Great customer service- always friendly welcoming and attentive. (Shoutout to my favorite ","useful":1,"cool":1},"VIs3VxmHt2Vzrzv082y-1Q":{"text":"I am a local New Orleanian and I had friends in town for Mardi Gras this weekend. We had 1","useful":0,"cool":0},"1qPuj1wOsRez0-0U7vm4cw":{"text":"The cheapest oysters we had in town. So cheap... I mean we got a few dozen and when we did","useful":0,"cool":1},"cvpZo0-DJ1FrVKqgunMOuA":{"text":"Love this place because of the 25 cent oysters. Of course you have to get 2 drinks per doz","useful":0,"cool":0},"vaJ2yRV7Dc8M7Cm9f9uaIQ":{"text":"We got there and the hostess said it will be 10-15 minutes  for a table.  So we decided to","useful":0,"cool":0},"YP4gA9VTpZjzpH_c5BzkVw":{"text":"The only reason why I gave  it two stars was because the service was good and owner made i","useful":0,"cool":0},"Kb-c6mb4iwJbxwQwjyQlNA":{"text":"Truthfully we only go during the oyster happy hour (Everyday 4-8pm). Their chargrilled oys","useful":2,"cool":0},"bZR3ki3qIspFKbN2_1EvWA":{"text":"Okay well I love food so I might be partially biast. Been craving oysters all the time due","useful":0,"cool":0},"9G0mO9oKYBvn4sGtXXF-mA":{"text":"This place had excellent service, excellent food, and $0.25 oysters from 4-8pm every day. ","useful":0,"cool":0},"2rAAW8aBqQF9lmuODDOVcA":{"text":"We were lucky to get seated relatively quickly for this spot and got two dozen orders of g","useful":0,"cool":0},"nekxWbs4bbwuN6XsW8nlvg":{"text":"Can't beat the oyster happy hour, but the staff is incompetent and rude, even for New Orle","useful":0,"cool":0},"SR7gw5MHE2-gljcTcQ9fEQ":{"text":"Fantastic ambiance for a chill night. Our server and bartender were really sociable and do","useful":0,"cool":0},"jVJ5zh7xMqHXN3JhudEf1A":{"text":"Have you ever been invited to a club with your homies only to realize that you're actually","useful":2,"cool":0},"PpZ9JWlnCZe9E6WOKOzsNA":{"text":"Great place with a very good selection of beer. Atmosphere felt tropical with outside seat","useful":0,"cool":0},"_SK4SLkCCfUurbfvHyQ4-A":{"text":"Oyster happy hour daily! Pay for a drink and get half priced raw and chargrilled oysters. ","useful":0,"cool":0},"3ltVoj7vyRjLWVvkHFNErQ":{"text":"Went here to watch the Pelicans game, so I didn't try any of the food. However, the drink ","useful":0,"cool":0},"b2b8LWdujzvHmkB9zrE-6Q":{"text":"The charbroiled oysters here are absolutely amazing. We got the oyster specials during hap","useful":0,"cool":0},"5KS7o1RtCt6a_PjUhnrd-Q":{"text":"Not the greatest experience. It wasn't terribly crowded but we waited an hour for the nach","useful":1,"cool":0},"YgOg0H0ORCuMKz16y0JkPA":{"text":"The oysters (both raw and chargrilled) were amazing. Needless to say, come during the happ","useful":0,"cool":0},"0cFbYZhhrSsXZ1PqN3820w":{"text":"Been in town for a week and came here nearly everyday and i must say Channing is the best ","useful":0,"cool":0},"rFY8jX7N_Slg5oxwJv7rsQ":{"text":"Chargrilled oyster and alligator hash were great! It was a weird vibe when we walked In bu","useful":0,"cool":0},"M6S9agr9xyVHOSaLCGqk3A":{"text":"Good beer selection, although it can be pricey.  Go for the 25 cent oysters and char-grill","useful":0,"cool":0},"3mA-jOD-Dh_mYvyOx4AT2w":{"text":"Great food and atmosphere, subpar but friendly service. Amazing happy hour oyster special","useful":0,"cool":0},"7UsEo8utwZPTX2_OE_58CA":{"text":"I wish I didn't have to even give this a star. \n\nOn July 5, my sister and I came to Blind ","useful":7,"cool":0},"erDV5g3pmUoZJ4bSnmF68A":{"text":"Service is trash. Food is okay. Oysters on the cheap are great, but not that great when yo","useful":0,"cool":0},"YW3LH_jCH2ppqIJ6lijEzw":{"text":"This is a usual stop for us. We're from Pittsburgh and the owner is a Steeler fan so we we","useful":0,"cool":0},"pC_j1FnMdOf5D25ceFculA":{"text":"We were nearby so we thought we would stop in to grab a bite to eat. They let us sit anywh","useful":2,"cool":1},"ZbMCKeKOG9_vl_Da6bylkQ":{"text":"Three and a half stars.  Enjoy this place for what it is. I thank The Blind Pelican for lo","useful":0,"cool":0},"DzTjsKOYTphmwlzVvJHgkg":{"text":"Holy crap probably some of the worst customer service in all of Nola. Good po boys and str","useful":0,"cool":0},"VBGWU7i2IurF6C-fPqAnUA":{"text":"We were (still are) staying at The Avenue Plaza and after a long day of being out and abou","useful":0,"cool":0},"GXk29lDCH66TRZym-lrqoA":{"text":"When they first opened they had a much better/creative kitchen staff.  Lately they've reso","useful":3,"cool":1},"9HatAazS4XY9GjRAY6ghrQ":{"text":"The grilled oysters are the delicious!  @ about  $8.50 for.a dozen . The boiled shrimp wer","useful":0,"cool":1},"7DesC2_YF962MY2nem6WcQ":{"text":"Along the St. Charles street car route, this homey paradise has an amazing happy hour wher","useful":0,"cool":0},"Iq1NlzQjxkV3flRxfeTKnQ":{"text":"Excellent place, food and vibe! Great choice of beers and nice happy hours for oysters! Wi","useful":0,"cool":0},"N7nH2D32i80UBg2C7KYFQQ":{"text":"Bartenders were great..... kitchen could not pull it together :-( 30 minutes to get a Caes","useful":0,"cool":0},"in4pf-aTccDHqhJwVNgx4A":{"text":"What a great place to spend a Sunday afternoon!\n\nThere are so many TVs for football, but I","useful":1,"cool":0},"b3_0wIkBVFvtBV5TzFLWUg":{"text":"Wholly underwhelmed by the charbroiled oysters.  We were excited to try them for the first","useful":0,"cool":0},"cJVRkBdbhacLIqTgKQ7TyQ":{"text":"The crawfish here are brilliant. Arrive around 3 and you can watch the whole process in ac","useful":0,"cool":0},"xkHSBW-7VGbZ69raWTZAFw":{"text":"Terrible service. It has taken up to 30 minutes for them to acknowledge us before... Somet","useful":1,"cool":0},"seyI-QrQaQEKViJCvtG-Zg":{"text":"If you like the Rolling Stones and the Doors, you'll like the vibe here. Stay away if you ","useful":0,"cool":0},"hgdXJh-obEkbaj1q_J2cog":{"text":"The oysters here were awesome I had the raw and the chargrilled.   But most likely because","useful":3,"cool":0},"VlVYDRG-NVrF8ew5-tiyKQ":{"text":"Can the service get any worse?\n\nThis is the last time I bring anyone to the Blind Pelican.","useful":2,"cool":0},"QDL35Ss6KQP3SwS7E6eG5w":{"text":"Really cool place. The oysters are awesome (I prefer on the half shell). I got the bbq bur","useful":0,"cool":0},"WkU68hS58LRVpMw2yEYBpw":{"text":"Disappointed...I went with my boyfriend to check out the restaurant for the first time spe","useful":0,"cool":0},"_5XRFiICJDK72SpjmHHGEw":{"text":"This place was ok. Slow during lunch and nothing crazy on the menu that I had to have. The","useful":1,"cool":1},"eHRbbLOarn3anrhbe0apPQ":{"text":"We were out exploring the Garden District and spotted this place which looked so cute. The","useful":0,"cool":0},"l0kPwredaSimzMa68hB8PA":{"text":"We went for the happy hour specials, $3.00 for raw oysters and $7.50 for chargrilled oyste","useful":0,"cool":0},"KPn2-QVeLemveEsi03Z7tg":{"text":"My opinion on this restaurant is decidedly mixed.\n\nThe food was quite good.  I had a oyste","useful":2,"cool":0},"scWQvA7K4GmcpcZiTFQVsg":{"text":"Oysters were not fresh I literally threw up they were not fresh and they were too big nice","useful":0,"cool":0},"6Eh0W38v9UhYKPaDGYBl2Q":{"text":"Late Night... Late Bites... \n\nFoods ordered: chargrilled oysters, grilled cheese, cheese f","useful":14,"cool":9},"VCI16JG6UvGSaNxrQwhpDQ":{"text":"Happy hour is very happy here. It makes us very happy.  Our server , Sean, is attentive & ","useful":0,"cool":0},"Kn5M9hEuDGr8HMF1DcSuYA":{"text":"Do not give this business your money. My husband and I went there for a late night bite an","useful":2,"cool":0},"Y60dCiNto3MG-_V1f_Mlqg":{"text":"The scowl on the hostess's face is pretty ridiculous. We probably should have turned away ","useful":3,"cool":0},"V_FqK4wFS6P8m_GUIqLRuA":{"text":"We arrive around 8pm and are given a 30 minutes wait, that's acceptable after happy hour j","useful":5,"cool":0},"VLkmmoIsFquluAGFe3eqjg":{"text":"Ate there last night with wife and the oysters were great as usual and had the the Duck sa","useful":0,"cool":0},"qKlcXZ4HhHHM-nOR7nBTDA":{"text":"I love this place. You cannot beat the 25 cent oyster deal during happy hour- (although WA","useful":5,"cool":2},"GKtwLHmXC9DkZswzWm2vFw":{"text":"Wow! The atmosphere was great. The wait was quite a bit during happy hour (4pm-8pm) but it","useful":1,"cool":0},"SpJawKmlTSwAr3nPEtxBgw":{"text":"From the second I walked into this place from the second I walked out was a complete night","useful":2,"cool":0},"K9ImAtU8aqSKsnuzuRUe6g":{"text":"This was my favorite restaurant in New Orleans. Really cheap oysters during happy hour. Tr","useful":1,"cool":0},"9RqKmVOSbZB7C740lSuzPg":{"text":"Great joint for oysters either boiled or shucked and great boiled crawfish.  Fun sports ba","useful":0,"cool":0},"X1Gja5mBK6ewuntk9aU5yA":{"text":"We waited 45 minutes for a table watching the hostess take frequent smoke breaks. The mana","useful":0,"cool":0},"earHibRvlUs5jpvsbOIBhg":{"text":"Rude bar staff. The Australian bartender did nothing but speak poorly of all of his co wor","useful":0,"cool":0},"ukSLQJ5QeXcw4ZVSmEFWxQ":{"text":"PET FRIENDLY!!!! We went during happy hour on a Sunday and sat on the patio with our 2 yea","useful":1,"cool":0},"7ZMASVYEf0GGcAR_T57B5w":{"text":"This place looked like a great place to grab a beer and some food and it was!!!  Waitress ","useful":0,"cool":0},"5Y7lJaI_O-5jH0ZAyplnDQ":{"text":"Best oysters in New Orleans.  Happy hour is incredible.  Oysters for $3 a dozen during hap","useful":0,"cool":0},"1T9zQR9J7ZViH2TyrbJd1Q":{"text":"Great place , great view , ice cold pbr draft . friendly staff. excellent oysters.","useful":1,"cool":0},"yYhr0xHcoCfoN-r2eXJr7A":{"text":"The muffaletta is on point and the alligator hash is also very good. Cool spot for a ball ","useful":0,"cool":0},"NfkNDPS1kmT6gu59o4G5XQ":{"text":"Food never came , waited 40 mins, we only ate the oysters, they where small, I've tasted b","useful":0,"cool":0},"5JnRBNZ53e3pgKUNOI5kig":{"text":"Drinks are great. Atmosphere is perfect. Outside dining is superb. The inside is decent be","useful":0,"cool":0},"0XX2XbH-MjwaNjqeMlpq6g":{"text":"It was so hot in here!!  \n\nWe came by one afternoon after our walking tour and was famishe","useful":1,"cool":0},"v9h_-5BMzuNt4yhpSQf4SA":{"text":"I need to find out if Jimmy, the bartender, has a fan club. He's so lovely and attentive. ","useful":1,"cool":1},"o-EzVQ3rmh7QC7LHhkF_ig":{"text":"Great food, awesome 4-8 happy hour with the most reasonable oyster prices in NOLA. Great b","useful":1,"cool":1},"RP030LG0gAd_dQgtJUX2bA":{"text":"Ordered the Cochon de Lait.  If you like pulled pork sandwitches you will love this versio","useful":1,"cool":0},"HUkHOh_dLfaFQRHKU6Hhyg":{"text":"I am so sad that Atlanta doesn't have a place like this. Happy Hour specials from 4-8. Get","useful":0,"cool":0},"tmgV21FRpyYHtJiniJblnw":{"text":"Great atmosphere was electric, the food came fast and the price was right. I will make thi","useful":0,"cool":0},"wHhhUhDiPX6g2A1X2qnQ7Q":{"text":"ordered the duck sandwich and fries (12 is a little pricey, but sandwich was GREAT!). Frie","useful":1,"cool":0},"lJSF49Pz2prfuefiGMEp2w":{"text":"I was lured in by their awesome happy hour special from 4-7 daily. 25 cent oysters! How ca","useful":2,"cool":1},"UipthZDMpIk34xIuJiIrAg":{"text":"So sad to see this service in NOLA. If the staff spent a fraction of the time they spend t","useful":1,"cool":0},"9zsPDtTDftUbdzIUhrXt1w":{"text":"Some local friends brought us here for their oyster happy hour... I could've eaten for day","useful":0,"cool":0},"Yk_dg0BPerruET5SsmLZ3A":{"text":"Went there last night.  Terrible service. It's Friday in Lent and you run out of oysters b","useful":4,"cool":0},"Jte2BUumsWSE2lKYKlnsCA":{"text":"There's a reason this place has low ratings.....the customer service. The bartender was ni","useful":0,"cool":0},"aoZP9Rqt5uwCu1Gy7QoBNA":{"text":"Went here for the oyster happy hour. WOW, couldn't believe how fresh and good the oysters ","useful":1,"cool":0},"RHAUR9NpgJ4J5MlQ6g9LmA":{"text":"I wish I could give this place 0 stars.  They are thieves, literally.  My bill was $55 wit","useful":0,"cool":0},"PmCKLkmz4rrziaeWRXKZtA":{"text":"Fantastic !!!  Tourists, please stay away. This is a quaint, neighborhood joint where ever","useful":0,"cool":0},"bnpOj587g6WIpUJSjPqiEw":{"text":"Great oyster happy hour! So glad I waited to experience this NOLA gem! Can't wait to retur","useful":0,"cool":0},"HaoGJcdJbpEuwoE1Mj8Fig":{"text":"Balcony deck on a bright, cool day is blissful. Bloody Mary was excellent. Pickled okra, g","useful":0,"cool":0},"N4VSvMcvTNj4jkQ1lDCYVg":{"text":"I need to justify my 4 star rating before I go on. The service was good the food was good ","useful":0,"cool":0},"doISMXHFQaX1Ma4SqorehA":{"text":"This is the best Oyster Happy Hour in New Orleans, hands down. These are their regular oys","useful":0,"cool":0},"-hOH2-EvG-29cp57Lqbewg":{"text":"Not organized, small, bad customer service! Waited a hour and a half for oysters and they ","useful":3,"cool":1},"Ex-AeLNvEdUsC9p4zF771g":{"text":"Fun place, good food, typical New Orleans servers/ service which some people find off-putt","useful":0,"cool":0},"lEht_ZmoeRsbbWICm2j8kA":{"text":"We walked to Blind Pelican on a Tuesday night, but they were closed for remodeling g.  The","useful":0,"cool":0},"oVved6RJhmMN5yCkwb3h8g":{"text":"Ok so I'm reading all of these bad reviews. The Blind Pelican is literally \"standing room ","useful":0,"cool":0},"YPMcGPvC059--1HeZa4LYQ":{"text":"It was very busy but we got seated much quicker than expected. We were told by hostess cha","useful":0,"cool":0},"1QWKtFd0Zzq-n31_-4vyOQ":{"text":"We absolutely love this place, we come to New Orleans every year and eat here as often as ","useful":1,"cool":0},"D2Pb6CQS4ZrZJypK5_YQyw":{"text":"Service is lame...... waited for 45 minutes to then get seated with no one getting our ord","useful":0,"cool":0},"ViOyRKbQ7t6-Ixn2uADZ6w":{"text":"We were at Samuel's Blind Pelican last Wednesday. Really enjoyed it. The chargrilled oyste","useful":0,"cool":0},"I4eHH7aVjDnf1S1grhA4Zg":{"text":"Came here from Boston and were told this place was a must to go to. It was really small an","useful":0,"cool":0},"CQ4wKulMiPlUzPDeVxNHMw":{"text":"This is another must try in NOLA. Particularly during happy hour with $0.25 oysters, who c","useful":2,"cool":0},"QWHgGoA1vm0BD7TEfX7l5Q":{"text":"Surprisingly the service was fast in and out even when they were super busy. Char oysters ","useful":0,"cool":0},"rv-dDzGOdjEWt-5g-W9rbQ":{"text":"Very disappointed in this place.  Food mediocre, service poor, beer expensive.  Although, ","useful":3,"cool":0},"Xui-VCvEYNOLlC4FivkzJQ":{"text":"The best fried oysters I've ever had ever! Although the service wasn't the best, the drink","useful":0,"cool":0},"JVs-ZSBDYhueYeir3VbBdg":{"text":"This place should be shut down. The service was HORRIBLE. My server (Anabel) got to the ta","useful":2,"cool":0},"Gua9PYPNj9VZBmj9XEP7CA":{"text":"Sunday Date Night, 4-7 happy hour was good. $3 raw doz or $7 charbroiled doz. You must ord","useful":1,"cool":0},"n1D9rJNABI3WLl9R8cAYrQ":{"text":"Our server wasn't very attentive but the food was amazing! The cheap oysters were to die f","useful":0,"cool":0},"QTRaO7UceqzhAqGGdBnTwg":{"text":"My wife and I stopped here for a late lunch after walking around the Garden District and w","useful":0,"cool":0},"PbQodKkKh2dgsFEtfG3meA":{"text":"Blind pelican:\nI'll make this one brief. Go for the food, which is delicious. Do not expec","useful":0,"cool":0},"sRkvL2taqelebMijRRbntA":{"text":"Terrible terrible food &service. Waited 40 mins for the raw oyster. They did not look fres","useful":0,"cool":0},"6B_WcB_Vw_JTQqDH__ckqw":{"text":"Happy hour daily from 4 to 8pm. Only applies with purchase of adult beverage though. \n\nOys","useful":1,"cool":0},"ljYAqbO3FoZzkuHMVIqHsg":{"text":"Best Deal on oysters anywhere in America.  And they serve big, juicy, succulent ones.  On ","useful":0,"cool":0},"nITDyvd-VRQ-V2ZgMiNZIg":{"text":"Food OK.\nPatio atmosphere good.\nService TERRIBLE!!!\n\nSeriously, this place could not figur","useful":2,"cool":0},"5jpPFDYXXIbU5fDYkr-bOA":{"text":"Omg my Chiro said to come here on happy hr! Wow fantastic local place. Happy hr $3 raw oys","useful":2,"cool":0},"gh4dRUxNGiBEWpft-UcX0g":{"text":"Came on a Sunday afternoon when it was not busy and waited almost 2 hours for some mediocr","useful":0,"cool":0},"-OJB7we-cayK-Xbf3buD9w":{"text":"I've had mixed service here in the past but I've come to this conclusion: you don't go to ","useful":0,"cool":0},"nq7WWixnlmpBR3amH78mOg":{"text":"How can you go wrong with 25 cent oysters?\n\nMy wife loved her crab cakes and I had 2 order","useful":1,"cool":0},"DjQdZtsdNqeIIS0tzk29Kg":{"text":"Great atmosphere, but not impressed with the food or service. The menu is nice, but not im","useful":0,"cool":0},"r4zxutHh4_uKwQA1uUYpsA":{"text":"Honestly, I was pretty disappointed. We just missed the oyster happy hour, which I think i","useful":0,"cool":0},"_G4JFmdcCetoZy8oGQyVCg":{"text":"I have been here a few times, but had a terrible experience this weekend when my family ca","useful":1,"cool":0},"1jTUVNjif5j8Phsnyrryvw":{"text":"This place BLOWS. We came here with 7 people, and all tried the happy hour oyster special.","useful":1,"cool":1},"NCG4Xm8ghQdY82JDJC1aKw":{"text":"Don't waste your time......seriously.....took an hour and 10 minutes to bring our sandwich","useful":1,"cool":0},"jNcUQjBCZGX0Z03vRnM7lw":{"text":"Where else are you going to find 25¢ oysters?! The happy hour deal here just doesn't get a","useful":2,"cool":3},"hvScfi_j_j069ey1tA79ng":{"text":"The food was excellent !  Happy hour deals can't be beat.  We had 6 orders of oysters in c","useful":0,"cool":0},"g-yf1xyzJ175pttDe_Ywlw":{"text":"The worst. Rude. The weasels that work in the place spoke to us, told is yo sit anywhere, ","useful":0,"cool":0},"ZnIeoLHC9Ov--dtxDeLMVw":{"text":"Excellent! Well worth the wait!!! We stumped  upon this place waking back to Camp Street. ","useful":0,"cool":0},"2iG4DRwr8kKYmNIajBOCUQ":{"text":"The food is a 4 but the manager screwed us. A huge party came in when we did which is fine","useful":0,"cool":0},"xCsGZMukg546GgXBio-KSg":{"text":"The oysters were good. Small, but good. The grilled cheese sandwich was AWESOME! Our waitr","useful":0,"cool":0},"J24eE3LKzoS2DoEdV9PBrg":{"text":"We went on Wednesday night looking for a good place to eat, but when we arrived there was ","useful":0,"cool":0},"afnzKAyLgmXGFU96pWZgjA":{"text":"I cannot tell you how amazing this place was! To all the jerks who complained about the st","useful":0,"cool":0},"idgIes3zCySzq1RAEg1cpQ":{"text":"This restaurant was recommended when we talked to local people and turned out pretty good.","useful":2,"cool":0},"wii1wkqtOA_LM8CkScXnvg":{"text":"during our visit, on a Friday afternoon around 2 p.m.  my husband and I decided on The Bli","useful":0,"cool":0},"43gfIcaZqWudP4_7DBLQ4Q":{"text":"Excellent sports bar! Food was great for bar food standards. Happy hour specials are excel","useful":0,"cool":0},"8Dx77S80mI9nj7mLEH26xg":{"text":"I recently went here to watch a Sunday afternoon football game and I had the best experien","useful":1,"cool":0},"2NNSASGF0eI80dXiPf9pgg":{"text":"Some of the reviews of this place mention the service. We witnessed that from an older cou","useful":3,"cool":5},"w87Chloc4Z0UinOpujlCYA":{"text":"Visited today for happy hour. I'm a local and eat raw oysters frequently. The raw oysters ","useful":0,"cool":0},"9IUbGUjpxcx7RdT5lnGq4Q":{"text":"I visited this restaurant during my visit to New Orleans twice because it was right down t","useful":2,"cool":2},"twfXDVN0YKJA7s59fK5oXA":{"text":"Great oysters! The ambience is rich and beautiful and their happy hour deals cannot be bea","useful":0,"cool":0},"HEOiPy8gVdLek0CNSvvtwg":{"text":"Stay away!!!  Best 25 cent oysters. Great service. Well, that was the first night. Polar o","useful":0,"cool":0},"OPOxntGKzDkRfn7Z-I2q7w":{"text":"Go for the food, stay for the outdoor porch on St. Charles and the beer selection.\n\nNow th","useful":1,"cool":0},"tDJCNUngEmq9WTqfFtIf4w":{"text":"The oysters here are delicious!! I usually go to Superior Seafood but decided to change it","useful":0,"cool":0},"LTuJTVMxCn_YspkgOZzpYg":{"text":"After fully enjoying the 50 cent oysters at Luke my sister and I decided to give the 25 ce","useful":0,"cool":0},"ku6RVvIAmk94aLVNMVdFJg":{"text":"Dinner started off great, but after our appetizer it went down hill. They were out of half","useful":0,"cool":0},"6LlJLgSQGpKhIeW7IZm7ag":{"text":"Only reason why I give this place a 3 is because the service was great. Our server was ver","useful":0,"cool":0},"W0efdNf9P4Kzdh_b_hUqAQ":{"text":"I really like this bar and the owner/manager whatever he is, Steve is a nice guy for the m","useful":0,"cool":1},"Wi3ifS0v7BYNYdpS2rvYrg":{"text":"The famous 25 cent oysters are hard to beat. Even though some are on the small side, it is","useful":0,"cool":0},"fILuLZN-ydeDA0jZh-c8cA":{"text":"I really hate leaving bad reviews, but yeah, wasn't too happy about this place. We placed ","useful":1,"cool":0},"E3PcwZ8UaK6w_UrQWo72gg":{"text":"Draft Beer is what sets this place apart.  Great selection of Beers. Eclectic Menu with so","useful":2,"cool":0},"MKTY94VzRfzQRFFe-PyCCw":{"text":"Not very impressed with the duck sandwich I ordered, but the oysters were great.  I had so","useful":0,"cool":0},"lt2tw6AhFU-o6UV3j69IKg":{"text":"Stacey and Mikey Are The Bomb.Com..... They Are Lit ASF!!! If Your Looking For Fun Food An","useful":0,"cool":0},"C7OFGKjA3WfQY1c8lRCrww":{"text":"Chargrilled oysters for $7 and we had 7 dozen of those delicious little bivalve mollusks. ","useful":0,"cool":0},"tpPhySput6IhVaH0VE09Yg":{"text":"Fabulous night with some incredible fresh seafood. Started with the 25cent oysters! Follow","useful":1,"cool":0},"Hcb4JfwDPsMCBMvnqUBKkw":{"text":"Cold beer and good flavored Grilled Oysters.  Everything as promised.  Friendly staff as w","useful":0,"cool":0},"XNUUMNCBFSyLpSToQvWWng":{"text":"The only thing this joint has going for it is its food. Otherwise, the service is absolute","useful":0,"cool":0},"vzPGNlmreU03R0PMQdDT3A":{"text":"The service during the eating time was okay but at the end it was horrible. I would never ","useful":0,"cool":0},"_R2eq-ajM8ixLJs1Zofh_A":{"text":"Visiting NOLA and made a stop here because it was convenient to our hotel.  \nHugely disapp","useful":0,"cool":0},"ZvOx_kw5LP0B3Q-S_y4ZYA":{"text":"One star because the only good part of my dining experience was the server. Let's start wi","useful":0,"cool":0},"_0q4X7Kapdc-8RX19aVZqA":{"text":"Food- ordered the half shell and charbroiled oysters for the price it was ok but if it was","useful":1,"cool":0},"AQIG9YMMPf15Rj5rRYVT1Q":{"text":"Staff was amazing friendly and attentive. Oysters where the best I've ever had. 25 cent af","useful":0,"cool":0},"x2rryS-DZk6ez5_vR5HPlg":{"text":"I will start out w/ the preface that based off my review history I do NOT take time out of","useful":1,"cool":0},"qxswaJhnwPWMx0i95tSWeA":{"text":"Was easy to get into on a Sunday evening. Appetizers were great! Only disappointment was t","useful":0,"cool":0},"kvRAT9MtRl_iQMIOpJJuUg":{"text":"grilled oysters were great. oyster po-boy was good too. the service is good and quick.","useful":0,"cool":0},"9Pkx0ABpN0z2H62QNH9-Dw":{"text":"I love the food here, but I have yet to receive good service.  I am not sure if they need ","useful":2,"cool":0},"BWD1S8HjbHT4kgjDFTR8Ug":{"text":"Best place I've been to in New Orleans for Oysters and seafood . Crazy but great fun. If y","useful":0,"cool":0},"PRjhQ3uq1cnxxxPHGqeIJg":{"text":"Food was really good but the service was awful! We sat outside and one waitress had most o","useful":0,"cool":0},"p8QlsWAeZHwEbRQ_G9MaVA":{"text":"Well to start I can not believe the Blind Pelican was not invited to participate in the Bl","useful":1,"cool":0},"ujPGTn1PQN3IiAeDS3RzvA":{"text":"Don't know who actually would return to this place. Owner is incompetent and has a whoa is","useful":1,"cool":0},"Es5ijhqlXn2nCrygmVxn_A":{"text":"This place is absolutely amazing! We had the crawfish, oysters, the chuckster sandwich and","useful":0,"cool":0},"ERdkwCyr2sohDw4RQZrGzA":{"text":"Ok... this is our first time in New Orleans. Luckily, The Blind Pelican was less than a bl","useful":2,"cool":1},"DAKxbnHtAxpgrlvrbr9PaA":{"text":"Came here specifically for oyster happy hour and was not disappointed. Oysters were very f","useful":1,"cool":1},"P3i96f29SAa3oly8-5lobg":{"text":"I've given this place several tries, but every time it's just disgusting and dirty. The mo","useful":2,"cool":0},"6lCIEGlwyL3MXEb2b7oUFg":{"text":"The oysters were ok, though they would have been great at happy hour prices. The pizza, ho","useful":2,"cool":1},"QC706ryIhmeFh0LPAwf-hw":{"text":"I waited for 30 minutes to get seats, then after I called in to ask how much longer I have","useful":1,"cool":0},"7JORav_ZzSScPHed7Vv0zg":{"text":"FYI - new kitchen chefs started on Friday Apr 6 --- so any food reviews prior to that date","useful":0,"cool":0},"63H5TQVl3xjzCacx9yx7-A":{"text":"We loved this place! The ambiance is exactly what we were looking for on our last evening ","useful":0,"cool":0},"PpiR_tEekuGzI6GZuxXuZw":{"text":"This review is for THE OWNER of this establishment. NO amount of 25 cent oysters can compe","useful":0,"cool":0},"Vh4IIZy1mnnJPHziTxWKqg":{"text":"Great food.  Great bar.  Came in twice during our stay in NOLA.  Oysters, po boys and burg","useful":0,"cool":0},"JBwu2Va_XGFSZQ9yd1La5A":{"text":"Showed up at 715 sat nite  place was busy , tables are small , but they had fresh crawfish","useful":0,"cool":0},"BU7Qu6UntWqSKDge48W87A":{"text":"Great Happy Hour oysters specials! Be mindful it is pretty hot inside, but nothing that ni","useful":0,"cool":0},"EZDh-V4hjdcIBQ7vNL_FGw":{"text":"The food, the staff, and atmosphere all great.  We will come back again.  the dozen oyster","useful":0,"cool":0},"W9WCj680lQnIF_EfukR6qA":{"text":"This is our third visit the Blind Pelican in past six months, and we are in LOVE with this","useful":0,"cool":0},"dV4Oot8MxworLQcSpnAMJg":{"text":"One of my go to spots.  I live right around the corner so I come here often.  Great beer s","useful":1,"cool":0},"ksQUckq5MbUPQDmeXssvuw":{"text":"Highly recommend this restaurant! We stumbled upon this place when looking for a spot for ","useful":0,"cool":0},"ajWd22Xl0rEMb_b4wubTRw":{"text":"The food was okay overall. The charbroiled oysters were AMAZING though, which must also be","useful":0,"cool":0},"cR7ND8KtWA6-vPqIKy0tQQ":{"text":"Visited this restaurant last night for happy hour.  This will my first and last visit.  I ","useful":0,"cool":0},"nugGy5ugSPCkLF0_YxdZ4w":{"text":"The food was good, but the building was scary. Our server was very nice, but it took a lon","useful":0,"cool":0},"u1j7LpDqrWN9NplaqOH1QA":{"text":"Good happy hour, cannot beat the price of the oysters. And the oysters are always great. T","useful":0,"cool":0},"lwpZtCzFiIHPXzscTosJYw":{"text":"I've been to the Blind Pelican at least 5 times now, and it's about the same every time. E","useful":1,"cool":1},"SI0FKYLnAUlPnBe7hU0UDA":{"text":"If I could give this place negative reviews I sure would. I was here in New Orleans to cel","useful":0,"cool":0},"NaYeKlCnukE7cRPgynEtvg":{"text":"Very fun, engaging bar that makes you feel like a local.  Stacy is probably the liveliest,","useful":0,"cool":0},"vhkuae7K0EInEXi7RaJyMQ":{"text":"The Blind Pelican was recommended by a couple of foodies from Washington state, and I'm gl","useful":1,"cool":1},"K5olEyWGMovA_RxERayUfg":{"text":"Stumbled upon this local bar and restaurant tucked away in a neighborhood on st Charles. C","useful":0,"cool":0},"gu984zQ_7EsRek_ABbhpAQ":{"text":"Food okay. Owner is the worst. Extremely rude and cares more about $10 than his customers.","useful":0,"cool":0},"_MN2UlLlwGvmPa2lMSWq5Q":{"text":"After being told that this was the best happy hour in New Orleans, we took the half-hour t","useful":0,"cool":0},"JIIJPu_B7m47wtpG1uDsXw":{"text":"We ordered the Fish Tacos and they were great. We also had the Bayou Egret pizza and it wa","useful":0,"cool":1},"bZnDFEVFtOGCentd2VTbuA":{"text":"Our first meal in Nola. Definitely worth the drive, we usually go to ACME for chargrilled ","useful":0,"cool":0},"JSbtIJB7xkmcKw7QWGdy9Q":{"text":"I love the Blind Pelican! The food is crazy good, the ambiance is chill, the prices are re","useful":1,"cool":1},"solNY6olYTPqIuGT42ThdA":{"text":"So we first came here back in June for our honeymoon, and we were so impressed.  The atmos","useful":0,"cool":0},"qtghKudPeB5pKxZxlC_1tQ":{"text":"For a quick bite or drink with good friends, this is an excellent place to go!\n\nI guess th","useful":0,"cool":0},"IwVpjHxel07wpKyhD0Yiaw":{"text":"25 cents oysters from 4-8!!\n\nHad the wings, sauce on the side, pretty good!\n\nThe St. Charl","useful":0,"cool":0},"KVOWK3-6wxAYuZX2tgljMg":{"text":"This is the worse place ever. They can never keep employees because of the owner. We spent","useful":2,"cool":1},"VrOEaMJvZolF0_ZjV-hPfA":{"text":"long wait.. claimed to have run out of raw oysters could only buy chargrilled yet when I w","useful":0,"cool":0},"aLIzr0XKSgI92fRFaQFqyA":{"text":"Super fun place and a great selection of alcohol as well. My friends and I ordered 4 dozen","useful":0,"cool":0},"Ha1Ws0VpFjrFooaMlERJjw":{"text":"As a tourist, I'm probably not qualified to judge, but this was my favorite spot in new or","useful":0,"cool":0},"z2X3AqfyEfLULJIkK9A56Q":{"text":"This place was great for lunch and early dinner. Amazing oyster po boys and hard to beat p","useful":0,"cool":0},"RHpvwLuFGkbxpIauPbzh8Q":{"text":"Bloody Marys are fantastic. Happy hour oysters were $3 per dozen. Were they the best ever?","useful":2,"cool":0},"9Rx60eVQvpzqTimqkvVifg":{"text":"Great happy hour, fresh oysters , Jimmy is the best bartender/server, great atmosphere, wo","useful":0,"cool":0},"HVFx1uoxKb-DKyp7sC6wLg":{"text":"I love their crawfish quesadillas but the food is way over priced. The drinks are 3.50 wit","useful":0,"cool":0},"zZU69p-e6w2_AZqmWtXG2w":{"text":"Awesome place for Happy Hour oysters between 4-8 pm! A dozen chargrilled oysters for $8.50","useful":0,"cool":0},"1n1YVZs7oeivuOia9DtRPw":{"text":"25 cent oysters for happy hour?!?! um, cannot be beat.\n\nIn NYC, there are $1 oysters a ple","useful":1,"cool":1},"AqTVYIp3ORSiWyU7UMnzQQ":{"text":"Food was pretty dang decent but the place was not the cleanest. Bartenders bullshitted mor","useful":0,"cool":0},"z853AtCG16_yu85plPyb8g":{"text":"One of the perks of this restaurant is that they have a later happy hour than most restaur","useful":0,"cool":0},"91dsOvugnZs0ROJ3SyujAQ":{"text":"On our way to get dropped off at our hotel from the airport, our taxi driver suggested tha","useful":0,"cool":0},"T3kcfCUzONehSBOoPimo6w":{"text":"Monday night - got here around 6:30 and were told to wait half an hour. Came back around 6","useful":0,"cool":0},"EuKXisLXhcXeAj0pWZAf-g":{"text":"Great atmosphere! That's the only positive I have for this place. Upon arriving I saw no s","useful":1,"cool":0},"q8Jjb6m6YmrHKbG-QdXaeA":{"text":"This is a good place to hang and drink wells (great happy hour deals) and talk, enjoy the ","useful":1,"cool":0},"nTu7XVXCHc1jLn5cC9GZRg":{"text":"Service is sloooww.  Roast beef poboy had very little meat, most was just bread.  Waitress","useful":0,"cool":0},"0GCDYkgD5p6E-FdOHU3ayg":{"text":"Just left and was VERY disappointed.  Maybe this place is OK for a few beers but do NOT go","useful":7,"cool":0},"iblk0O594y9gCUc7xWsqKQ":{"text":"Love the oysters especially when they are cheap during the happy hour!","useful":0,"cool":0},"l9GPHTTbFDNfDIKAwFLJ5A":{"text":"This place is famous for $3 oysters but even at those prices, it's not worth it. Their hea","useful":1,"cool":1},"Iz3_NzU_CYe1ywWKA6h4NQ":{"text":"Been here 5 times. Other visits would be 4 or 5, this last time, sadly, was a one star for","useful":0,"cool":0},"7Y_WSqohFCO50SxnoXWNPA":{"text":"Better and CHEAPER than ACME and Felix's, plus no lines.  Worth the trip if you want oyste","useful":0,"cool":0},"A1lDH9nQ5z9g1Unxgzl-Yg":{"text":"After reading reviews of bad service and lengthy wait times for happy hour, I did not have","useful":5,"cool":2},"_C2F-0pfMZeQvTw6lkbvNg":{"text":"Service: Very slow. Staff were either inexperienced or just didn't care too much to be how","useful":0,"cool":0},"O3lRrKh0CdVQ9Oq0efAUOA":{"text":"This place is amazing! Love the staff, especially Dexter and Mike. Dexter's crawfish is am","useful":0,"cool":0},"BdIeI-DJCHkIwHCo-rEnPA":{"text":"Great oyster happy hour special. The rest of the food is subpar and not worth your time. S","useful":0,"cool":0},"gnF9fEUgcJZs-zT2WVL12g":{"text":"Great crawfish and the staff seems really friendly.  Amazing happy hour specials but it's ","useful":0,"cool":0},"2eXvBsISo-cWAHruaLJ9xA":{"text":"THE BEST OYSTERS I'VE EVER HAD, PERIOD.  I miss this place on a daily basis.  Everything e","useful":0,"cool":0},"KQCHNjDXm1Pw1i9BD2nB2Q":{"text":"We came here not expecting anything. Ate 4 dozen 25¢ oysters. Yes, that's 48 oysters for $","useful":1,"cool":1},"KeN4f-9pOYoyhdJUg7AIJA":{"text":"This place is awful. They say 25 cent oysters, but then have a huge wait and force you to ","useful":0,"cool":0},"paZrzz3ebod6sjHFXBYOPw":{"text":"This isn't a sophisticated Michelin star restaurant, but if your looking for a solid plate","useful":0,"cool":1},"MGNbCEJss3j14_Z3L0jBIw":{"text":"I love raw oysters and during happy hour (4-8pm daily) you can get a dozen for $3- only st","useful":0,"cool":0},"cYBWwvwq2hi-XH8vI109VA":{"text":"We are back our favorite place in New Orleans!!!  Delicious oysters, shrimp Po'boy, fried ","useful":0,"cool":0},"AFJ5C8EObhBDDmhGGyU85A":{"text":"The food was good but the service was crap. It took forever to take/ bring order. And it t","useful":1,"cool":0},"uKBvQEe5OEbJjI0_cfwlOQ":{"text":"This place is pretty epic. Great drink specials and a dozen raw oysters for three bucks. Y","useful":0,"cool":0},"GyuN95LqNazRUyUhxyEu9w":{"text":"Great little place for an afternoon beer. The staff are super friendly. There are so many ","useful":0,"cool":0},"RiEEOyjEsh7GT4brIksFhw":{"text":"DONT DO IT!!! Save your time and money and just go down to the Popeyes! Our service and fo","useful":1,"cool":0},"MoA6tpIspoUsNSy6jjO7GQ":{"text":"Came here for oyster happy hour on a Thursday. We arrived right at 4pm and were seated rig","useful":0,"cool":0},"NkCHACNE7CUOOM0LzQlpcg":{"text":"While we did eat here, we had such a bad experience and I really think it was just a bad n","useful":3,"cool":0},"x2qE55wJtFPozb_FxtAc6w":{"text":"It's a decent place. A little touristy since it's on St. Charles Avenue. \nI've never been ","useful":0,"cool":0},"8ngKz260szA8eaUJiZ8r5A":{"text":"The happy hour oysters are fantastic, our party of 7 arrived at 7:45 and our waiter, Taylo","useful":0,"cool":0},"U8AHWS2BH5yT2PIFjARg2g":{"text":"Walking by and decided we'd stop in for a bite.  The duck sandwich with the alligator hash","useful":0,"cool":0},"zr9UO9PJa4Z6mnClHJ9_5A":{"text":"Two words: onion rings. You can try the other stuff on the menu, it's pretty decent too. L","useful":0,"cool":0},"XqBLKu1Xi1b-QLd2prNvUA":{"text":"I am not happy with the service I was given. I called to ask about happy hour and the girl","useful":0,"cool":0},"-DD4Wsi7c8Yo_9kIWHTcjg":{"text":"This place is amazing! I can't believe I have lived here 30 years and have never been ther","useful":1,"cool":0},"dAakYTJwmzllaZMdN_zo2Q":{"text":"My group & I had a lunch here today. We visited the restaurant during happy hour it was we","useful":0,"cool":0},"o-3zub4wm7AoIoJ4KG07eg":{"text":"Here goes! I come here for the oysters @ happy hour & for the lively vibe. Great wings too","useful":0,"cool":0},"0HvkRyi8xQE87BVOz7dung":{"text":"Grilled oysters & 25 cent raw oysters at happy hour.  But must do thw Aligator hash...!","useful":1,"cool":0},"mLrmJx_sQdF01YEkjqvE8A":{"text":"Amazing chicken wings and delicious pizza. A bit on the pricey side but I can't argue with","useful":0,"cool":0},"EWRRvZFG5j0LRj2rY9dIWw":{"text":"3 words...LOVE. THIS. PLACE! Randomly stopped in the other night...the smell of the crawfi","useful":1,"cool":0},"sMbuYjzdRtF1g7z2gB1REw":{"text":"As a traveler in a group of 10, I enjoyed the jungle-like outdoor atmosphere with torch he","useful":0,"cool":0},"AoFFHGcLOOnqyyl0I6DS_w":{"text":"My family liked this better than I did. The fried green tomatoes and the BBQ oysters were ","useful":0,"cool":0},"iWITNYYfCfqKkqLqkDellg":{"text":"Great place, great atmosphere and great service! Happy Hour from 4-8 and with each bar dri","useful":1,"cool":0},"T-Jhvu0HeK9zoyXdHUKFfA":{"text":"Service= terrible\nManagement= terrible\nFood= not worth it\nIt took 30 mins for a waiter to ","useful":0,"cool":0},"wVYTylieyUDC6vowBB3f3g":{"text":"We got a few different appetizers and everything was pretty good. The roast beef/fried chi","useful":1,"cool":1},"M05DRZaXTMU5z3bCTZ0Gqg":{"text":"I cant really rate anything because we left before we had a chance to eat.  The place was ","useful":0,"cool":0},"NZ6HwWFOqHmJbp-EeZ9F5A":{"text":"I love the patio on St Charles.  The happy hour has good specials like 25 cent raw oysters","useful":0,"cool":0},"D41PvIfx_38GRTICOJy9pg":{"text":"Let me start with I'm a big foodie and love to try new places. I hardly ever take the time","useful":2,"cool":0},"Cn6wBPJ_geP7qyp-PFaG8w":{"text":"Decent \"Po boy's,\" they the fried oysters were way less crop than what I had come to expec","useful":0,"cool":0},"AO8Vy2bBkfQaBU2TPWU8og":{"text":"A great place to get cheap oysters IF there's any left. First off, love the location. It's","useful":2,"cool":0},"85QsuHtPhGcpf-b3Q8BQjw":{"text":"i want to start by saying i've had some nice oyster happy hours here. but...\n\n.... after a","useful":0,"cool":0},"cCT8YJrezgrBijVN7uGjaQ":{"text":"Oh my gawd!! Charbroiled oysters and seafood pizza!! This place rules.. Food takes awhile ","useful":0,"cool":0},"XNylA4MagAbNIeMHFAatPg":{"text":"The service was slow. Our waiter was great but his trainees were not.  They forgot one of ","useful":0,"cool":0},"TN73wzYm2i0_bHXgHQIDNA":{"text":"Let me start with stark honesty, the service blew. I've been once before and it was busy, ","useful":0,"cool":0},"xhxEkd1JcfS8LukLtkcAxQ":{"text":"Avoid this place  place!! be aware that the oysters happy  hour  is a scam. 3 dollar$ for ","useful":1,"cool":0},"BPmejL-gRaw_yIIrbMvFkw":{"text":"Ok if you just want some 25 cent oysters.  I don't recommend eating a full meal here, wasn","useful":0,"cool":0},"EwgPZtjwI8lbVKJyHIh1hQ":{"text":"This place was recommended by a local, and upon arrival we were excited by the atmosphere ","useful":0,"cool":0},"J6cNkMxj6f9ty-aZVX5VzQ":{"text":"OK....this is kinda long, but if I give a place 1 star I feel like I need to go into detai","useful":0,"cool":0},"JDq9ft1VPzUda-b6VzWwnQ":{"text":"Did not have  2 of the items  we ordered. No pork and no alligator  Bland , one positive  ","useful":1,"cool":0},"Am1TXX3XV1sO9m12a7Ugow":{"text":"5 stars alone just for the .25 oysters! Fresh and delicious and you must try the fried gre","useful":1,"cool":0},"jlLUZ8R-ZE208_Mvo0JXHA":{"text":"I'm super sad this place doesn't exist in my town. But I'm also a little happy this place ","useful":2,"cool":0},"GpEPxUkeTYfUT-s96H4PXA":{"text":"Had to give this place one star to review but its underserved.\n\nMy wife and I stopped by d","useful":3,"cool":0},"7am5umX6stEpFDL4QfMusg":{"text":"This is a hard review to write because I've been here several times since it first opened.","useful":0,"cool":0},"Gt2LbvsFSNE_IsuxnQAf9w":{"text":"Well yes they have ¢25 oysters but the catch is you have to order alcoholic drink with eac","useful":0,"cool":0},"BcaoDUpfnR-oKSMnz08UnA":{"text":"Great fast service, Katie was our server and she was very special, organised, and made the","useful":0,"cool":1},"hDa9_nNQEw12QNZ20wsd6A":{"text":"Went there for happy hour because I heard that it was a great deal for oysters and drinks.","useful":2,"cool":0},"BCulZ_XbacNJ2MZgyTyGGg":{"text":"Terrible service. Appetizer came out last. I got the fried green tomatoes with crab and sh","useful":1,"cool":0},"ImfDAFkNPjZks0AtyvE69w":{"text":"This is a cute little spot , that sits on the corner, always packed every-time I drive by,","useful":0,"cool":0},"lYqiMEBixUNqXVstWEDTlA":{"text":"For $3 you can get 12 raw oysters!! They are big and small and they are great!! Such a gre","useful":0,"cool":0},"KItzE9g3-HKKjn10Rbv_Vw":{"text":"Love Happy Hour!\n\n25 cent raw oysters that are terrific and the grilled ones are so friggi","useful":0,"cool":0},"bt5JUFO2Qgg2MuKexGfzOw":{"text":"They were recommended to me by a local. Most of my time in New Orleans has always been spe","useful":0,"cool":0},"Dd1EedD1pl8TSGACh5yibg":{"text":"I have attempted to eat here multiple times; and was disappointed each and every one of th","useful":0,"cool":0},"j0fJ7cW1Lra6fAx6bQRSTQ":{"text":"Was skeptical after reading some reviews -- SO glad we ignored them and went for Happy Hou","useful":2,"cool":0},"XFoOzsJvLoyuNfotdP2aSQ":{"text":"Just discovered their happy hour oysters, and they are divine! Good burgers too. Loud but ","useful":0,"cool":0},"_e0uf6--eEHqXTBFRkmHug":{"text":"After having read some negative reviews about this place I was apprehensive, but all in al","useful":0,"cool":0},"Cmjoe-E5TkcWuWZZWcVKyQ":{"text":"Our first trip to NO.  While walking around St. Charles street we came across this place. ","useful":0,"cool":0},"pUUlQY1tAtOzrS_zQB12-w":{"text":"This review is based only on the bar because we had already eaten dinner prior to arriving","useful":0,"cool":0},"j_5QzzkWd912cvCO6gjUqQ":{"text":"$0.25 oysters every day from 4-8pm. We went twice during our 4 day stay in New Orleans. Sh","useful":0,"cool":0},"QwwyUHf9zCmUVnCiinktUg":{"text":"The oysters were dirty and full of shells and weren't hot enough.  The 2 shots for one pri","useful":0,"cool":0},"sWzoIbooUt4ElMY_LfaX9A":{"text":"Visiting from Los Angeles, coming here during happy hour and having a dozen raw oysters fo","useful":0,"cool":0},"lcwwuFAEvsFT5MDIJjB6kw":{"text":"Our server didn't know what happy hour consisted of. She literally just shrugged her shoul","useful":0,"cool":0},"In2HjHvg4-9OUxjqzSq2nA":{"text":"Oh Blind Pelican, what a love/hate relationship I have with you. The \"love\" is the atmosph","useful":0,"cool":0},"2ppYjNhpYW7KfPMk6Lucnw":{"text":"I'm repeating what many reviews already stated.\n\nYes, it's $0.25 raw oyster during HH betw","useful":3,"cool":1},"JEUISAcL8WvltU2-jSoyqA":{"text":"Like my fellow yelpers, we came for the happy hour oysters. Unfortunately, we were not tha","useful":3,"cool":0},"GgRI3Wtb8SfeKhdRW0uyOQ":{"text":"The crawfish were great. You have to get here at the right time. They will start their cra","useful":0,"cool":0},"WeGaM6unbOIZQ3SSRHuePg":{"text":"OMG, Jimmy n Jen the bartenders are AWESOME!!!! The owner Samuel was SO damn nice to us, d","useful":0,"cool":0},"ZGfBq43JhYl-Dy0viPq6xQ":{"text":"I went there and I saw a rat inside the dinning area. When I told the people about it they","useful":1,"cool":0},"qAnoGwf8Xv2IyW_oWJ6wUA":{"text":"This place is gross. My beer was flat, my food was cold and the manager was rude to me whe","useful":1,"cool":0},"UL_qmHKG5qALbOsFpn_0Jg":{"text":"I was there a few weeks ago with my husband who loves the 25 cent oysters. He ordered them","useful":0,"cool":0},"yhj4GFxQ7nkSZE_GTk-wkQ":{"text":"Nice outdoor patio and very cheap oysters! Raw or chargrilled. They have a TV set up outsi","useful":0,"cool":0},"fu2ytmrR7e5o3H8Mzg1e7w":{"text":"Good spot,\nGood food,\nDecent service, nothing to rant and rave about.\nThe waiter was very ","useful":0,"cool":0},"p-i5xg6tuszzJx77ZVOaNQ":{"text":"I've always found service here to be weak and, after today's meal, I don't think I'll be g","useful":1,"cool":0},"520P6nDbuoUc8VisJu-jYg":{"text":"We went for the happy hour .25 oysters but when you add in the mandatory drink it comes ou","useful":1,"cool":0},"zMQ4CqndUO3q3swP_8BOig":{"text":"DO NOT PATRONIZE THIS PLACE!!! I am not giving it any stars.. I visited here this weekend ","useful":5,"cool":0},"5yrJ-HiXVh75L2BVB7KaCA":{"text":"I liked the blind pelican because we were craving some oysters. We sat outside and service","useful":0,"cool":1},"cZstBE8xvnfQ7zWxDnrIPQ":{"text":"Favorite NOLA happy hour. Friendly service. Excellent chargrilled oysters. Better than the","useful":1,"cool":1},"MSlyq_PIBeFs9iqGoYZ9Kg":{"text":"The food here was horrible. The wait staff was not horrible but they weren't exactly frien","useful":0,"cool":0},"zrJ924p-c9U9gTSVUqnSeg":{"text":"Two words: Crawfish Quesadilla. Our group came here for the 25 cent oyster happy hour. The","useful":0,"cool":0},"fw50qPPCIX43AxGd5sxtNw":{"text":"I found myself here after watching the Seahawks lose to the Falcons while in NOLA for work","useful":0,"cool":0},"1lmfp33PW4lt5JkWa0wjGQ":{"text":"Good place to come watch a game with plenty of crowd. Some great local brews on the tap me","useful":0,"cool":0},"K0-5_oJoMyok1Nive_SEnw":{"text":"My SO and I came here for oyster happy hour.  It was a pretty streetcar ride away from the","useful":0,"cool":0},"PMrkWt5zkHUWRQMb6t-OYg":{"text":"We stopped by in the afternoon following the parade with 6 people. We had beers and some f","useful":0,"cool":0},"C34sdxya_-H1t0S_aAXskw":{"text":"We always come for oysters happy hour. Oysters are .25cents but you do have to order an ad","useful":0,"cool":0},"JX56fBdZdLqu5QK4v8TuuQ":{"text":"Food is good with a lot of fried tasty stuff, and some real flavor finds mixed into a soli","useful":0,"cool":0},"zGjriOwYRK_GTPvJFMfetA":{"text":"I fell in love with this place 3 years ago. The happy hour oysters had us coming back ever","useful":0,"cool":0},"Ku8_prLH9vB3rnr2jFODxA":{"text":"Food is really great - you can't beat 25cent oysters from 4-8. \n\nAnd then there's  the sta","useful":0,"cool":0},"JMcqfMIxV6TIx21YRAE_cw":{"text":"I'll cut right to the chase. If you're coming here for happy hour from 4-8pm, this is what","useful":2,"cool":0},"CgAsVbOXlCavmWbEyVVwZg":{"text":"Great oysters, great beer, excellent service. Did I mention 25 cent oysters?  We also had ","useful":0,"cool":0},"xQoSvPxDm18ZVEghJ_KRrQ":{"text":"Good bartenders ran out of oysters for happy hour though. I had a burger with alligator ha","useful":0,"cool":0},"Mm8sX8oxVDcVWJA3cncZOQ":{"text":"We stopped in here when we were in N.O. for a friend's wedding. We had a blast sitting out","useful":0,"cool":0},"Wnc1NnMna8EfJZj-i9UNzw":{"text":"There is all of 1 table for 6. So they sit a party of 4 at that table. There's plenty of t","useful":0,"cool":0},"AYx3l4qTYyRxy2E8o5WV-w":{"text":"When I heard of their $0.25 oyster happy hour, I had to try it for myself! The raw and cha","useful":2,"cool":0},"AmP2b7X601LCaLkLtCckiw":{"text":"Awesome little place to just relax and have something to eat. Very friendly staff and they","useful":0,"cool":0},"uRmxRmI49FycKM1YkpORMQ":{"text":"I used to always go to Luke for the 50 cent oysters during their happy hour, but then I fo","useful":3,"cool":1},"NMU7oT9HWYax91nnk3aQPw":{"text":"While visiting New Orleans I only enjoyed the most delicious food. This place was recommen","useful":0,"cool":0},"af1pIAczIADbwNcj7-Jw_g":{"text":"I have mixed feelings about The Blind Pelican. The happy hour is awesome but the service s","useful":0,"cool":0},"ieDbTu1w1_EDl7c-tTTtBw":{"text":"We were there for Happy Hour and had the hurricane with charbroiled oysters, Amazing!!!! I","useful":0,"cool":0},"6b2TWLOGJB_CIQPflPo-tA":{"text":"Awesome little bar! This was the highlight of my trip! Minus the few shells I found in my ","useful":1,"cool":1},"caJ1L1FN-GpQav6kFKAyGQ":{"text":"Every time I am in NOLA I make it a point to stop here. You can't beat the happy hour spec","useful":0,"cool":0},"dU_o9Rm3f3qGO_BZR1I5Aw":{"text":"The charbroiled oysters here were very delicious. We read about their oyster happy hour an","useful":1,"cool":0},"fPgThAqr8C9YV_J44i5wHQ":{"text":"I was pleasantly surprised that the place seemed smoke-free.  The male bartender was very ","useful":0,"cool":0},"tPvKHqaQU_9OKTb_0xAvCw":{"text":"The patio and the food were amazing and the owner is great! The staff however was honore a","useful":0,"cool":0},"fOug3bqUgBZ5Kss5GSOhIw":{"text":"Only eat oysters and drink here! \nThe food is decent at best. The drinks are great and the","useful":1,"cool":0},"1T7r8OLSlimaOPHa3p9eyA":{"text":"Found this place just driving by.  It was delicious.  And the hurricane drink was a nice a","useful":0,"cool":0},"ryYrMeDrP8tDHGj85K8sSg":{"text":"I enjoyed the raw and charbroiled oysters.  The prices were pretty good during happy hour ","useful":0,"cool":0},"W2OFeMOiBKZ5FIsjV9AHaA":{"text":"The best Oyster and drink deal in New Orleans. I had a great time. The .25cent oysters wer","useful":0,"cool":0},"ZWanjqWM3omtZVnuxTvO7Q":{"text":"We checked this place out for an early dinner one night. We passed it on the trolley and i","useful":0,"cool":0},"WpRayHdlePFJmH_HaBWucw":{"text":"Outside seating is nice, oysters were decent and cheap for happy hour, and service was alr","useful":0,"cool":0},"mO904QAByGbRbqvs3WAR2A":{"text":"Amazing duck sandwich with grilled green apple and Gorgonzola cheese on sourdough.  Once I","useful":2,"cool":0},"0wNeaF5ceoaH7d7dCvDsPw":{"text":"Beth was the most amazing server! She made us feel super welcome and taught us how to prop","useful":0,"cool":0},"EgMziDHYHU-OXVRsRseYYA":{"text":"Great happy hour!  My wife and took some out of town friends there and it was a fantastic ","useful":1,"cool":0},"T82WU4ZiidQ17CIBazmewA":{"text":"couldn't have been better! Muffaletta with duck fries, Cajun seasoned fish tacos, and even","useful":0,"cool":0},"h2QKlPnXFj_0w6RN0AnXNA":{"text":"Used to be great but it seems they fired a bunch of their staff. Total mess at this point.","useful":0,"cool":0},"vBzpPBikwkf3QqrSk1g0Qg":{"text":"The bartenders on the night I visited weren't really that attentive; pretty sure they were","useful":0,"cool":0},"b0KKGY5vwa03Eq88NGLF0A":{"text":"This place was horrible! If we can give a half star, we would have done that. First, we we","useful":2,"cool":0},"-AihpNTCMn-ahehumnXtBg":{"text":"Service was very slow and boiled shrimp were like mashed potatoes. The muffuletta, cheese ","useful":0,"cool":0},"IVqfxf7ZAGaKSs37QvAM7w":{"text":"Great place to grab a burger/wings and a beer, sit outside, watch a game and enjoy life","useful":0,"cool":0},"Xl744IBPm5NjNUB89z8EEQ":{"text":"I loved this place....despite the food, the drink selection, and the service. I loved it b","useful":0,"cool":0},"AgtY6R7is8mkh3znPqnCcA":{"text":"I love this place! The bartenders are so friendly and kind. The food is delish and the ser","useful":0,"cool":1},"OUXGVwQY2Hn_mbkIrus6QA":{"text":"Have a special on oysters but not prepared for the crowd.. Waited over 45 minutes for them","useful":0,"cool":0},"waihLfqRTdg-hK7UX96kJw":{"text":"The food was average here, not bad at all... however when me and my family payed for our 2","useful":3,"cool":0},"gVfUTsCJB_t9kYNOyPtQqg":{"text":"This place is amazing. Was our first trip  to NOLA and was dying to try the seafood. Came ","useful":0,"cool":0},"uSyZ4foo680NdEJRbVcDQA":{"text":"Raw and char broiled oysters were amazing! Great prices during happy hour 3$ raw and 6$ ch","useful":0,"cool":0},"9ZOnKx6CkGL6WxSsHSMnqA":{"text":"BEST chargrilled oysters!!!! Sat at the bar and the bartender was very friendly! Definitel","useful":0,"cool":0},"VLw-js_vQ6gsvFB3o-x8Gw":{"text":"4 stars bumped up to 5 because of one word: hospitality.\n\nDecided to stop here on date nig","useful":4,"cool":1},"aDme5i0vvuYzMbbR78Cu9A":{"text":"This place seems to be hit or miss, and if I had written this review maybe 6-8 months ago ","useful":0,"cool":0},"F1b_cpXO2Rv32tRUtHb_EQ":{"text":"Our server Rachel was awesome!  She was very attentive and personable.  We were just strol","useful":0,"cool":0},"aG_Cb5fRmFCM-gyrI6Y3iQ":{"text":"Not impressed...at all!  Waited to be seated, finally got a table but it was in a horrible","useful":0,"cool":0},"H_tmc-8B_TEYZTFXPI6RvQ":{"text":"This restaurant had good food. But we came here with 7 people,and only 4 of us got food. T","useful":0,"cool":0},"Y9rhwV2xhkyyCmYj9blVng":{"text":"Great vibe with an outdoor patio, big screen televisions, and an eclectic group of people.","useful":0,"cool":0},"RXEZxMxJjfIvaCqs1vTPPg":{"text":"Heres a proper description of a sunday night:\n\"table of 6? Itll be about\"\n at this moment ","useful":0,"cool":0},"9qgm1sUuZTGP7TZiA8yOjg":{"text":"Great oysters. Great oyster prices. Way to slow to get oysters served. Make sure you have ","useful":0,"cool":0},"PEul4VZ6bpLvPpLnlLS5xQ":{"text":"My go-to spot for oysters in NOLA - you really cannot go wrong with any of the choices, wh","useful":0,"cool":0},"tOWPU-bctYy0Mwn08NYGXQ":{"text":"Literally the worst service. Waitress completely forgot our order. Only out in a third of ","useful":0,"cool":0},"AU6P4-NYOZ6TOPh7UF_g6w":{"text":"While I had heard good things about The Blind Pelicans' happy hour, this was not the case ","useful":2,"cool":1},"Mpf-QuYuUlLvn2QLKw8xpA":{"text":"If you're looking for a place to chill after work or on the weekend... look no furhter.\n\nT","useful":0,"cool":0},"xtTpSSkstg913j3UbiZHeQ":{"text":"Great happy hour!  Really great selection of draft beers!  Sat outside under the fans to e","useful":0,"cool":0},"QMz3FOxJAmVny3Ftbi8Y0w":{"text":"I'm not a fan but the .25 cent oysters seemed to be the craze.  My friend ordered the oyst","useful":0,"cool":0},"57sao73c_4d1cvbL_uxtjg":{"text":"A group of friends and I (8 total) happened to be passing by around lunch time and stopped","useful":0,"cool":1},"wfdJ9eoxlXfnxRqgrmpoSA":{"text":"Our favorite place for Chargrilled oysters in NOLA. We happened to stop in for a drink aft","useful":0,"cool":0},"9Cdt23ughirSpcFBelcB8Q":{"text":"If you want some fresh raw oysters this is the place to be. My friend and I decided to vis","useful":0,"cool":0},"LnXa8DFJek9uUEybNf5YPQ":{"text":"We ate here on a pretty non-crowded Saturday afternoon, and I thought it was great!  I had","useful":0,"cool":0},"AWNV_eQxLCOG_3q-vD0zJg":{"text":"Just moved into the neighborhood and nearly fainted upon seeing their happy hour special: ","useful":2,"cool":1},"bd6EexvpkV3dTqML9Fn50A":{"text":"Let me start off by saying I made a yelp account just to write this review. If I could giv","useful":1,"cool":0},"Dv8Z_26kqZj_hSSwQfxo3w":{"text":"AWFUL SERVICE. Waitress Emily was very rude and not friendly at all. Slammed drinks on the","useful":1,"cool":0},"YinvgrkihEMxcz7Eif9Rug":{"text":"So, so disappointing. Shrimp boil was said to be room temp, it was COLD. my husband still ","useful":0,"cool":0},"trVF07kNszrha8Annu4W3g":{"text":"Perfect Saturday college football hangout. Service was slow but they did their best. They ","useful":0,"cool":0},"H7BbygCjNkdsy9sAXA1FBA":{"text":"A dive kind of place.  Famous for their 25 cent oysters but they are only during certain h","useful":0,"cool":0},"4wRIL1OeViizu_ImllMp4A":{"text":"Yummmmmo! Happy hour oysters! \nSome are pretty small but what can you expect for the price","useful":0,"cool":0},"rzFLwc_5xgzm1mqnzIYGXg":{"text":"One could assume that when something is too cheap it's likely too good to be true or make ","useful":1,"cool":1},"cRW7XAjECs8yQEsS75NtPw":{"text":"The oyster special is legendary. It's hard to get table for the happy hour and you do have","useful":0,"cool":0},"GDFWXWpBRjdvdPnGoTwE0A":{"text":"Good food. Good beer. Gave it four stars because of the creepy waiter (Jerry) trying to ro","useful":0,"cool":0},"v1i4iDfv4AFgMQNxCQ0Lag":{"text":"I had the worst meal at this restaurant that I've ever had in New Orleans. The oyster Po B","useful":0,"cool":0},"MiXgr0mP_K2rxEa58M9t8Q":{"text":"Fantastic joint with cool atmosphere and funky NOLA eats. Stumbled on it during happy hour","useful":0,"cool":0},"4lhBrE2_ud46qXW3M1wkVw":{"text":"Oysters and drinks were pretty good, it took an hour to get them though and the waitress w","useful":0,"cool":0},"cqSWh-lCWI8G1ZpQfl7--w":{"text":"Came in for lunch. Had the raw and chargrilled oysters, fried green tomatoes, and blackene","useful":0,"cool":0},"3fXk_moVqTDh2g1U04cG9Q":{"text":"The Blind Pelican had some of the BEST seasoned seafood I found during my trip. I personal","useful":0,"cool":0},"sVlhcetBmIRVBQ798qOrEA":{"text":"OMG, Jimmy n Jen the bartenders are AWESOME!!!! The owner Samuel was SO damn nice to us, d","useful":0,"cool":0},"htIL34fBfP5_omv3bzaTWw":{"text":"So much promise with location and atmosphere, however it is appropriately named as custome","useful":1,"cool":1},"UUWe7hBlVuwow18QA5oMaQ":{"text":"We drove by this placein May 2017 and it looked really cool from the outside, so we stoppe","useful":4,"cool":0},"EVTBO1jnJ__B7cdJx20yAQ":{"text":"Don't be fooled by the relaxed ambiance and good beer list, this place is mediocre at best","useful":0,"cool":0},"8_zVJuU8zvvTegXD-OwBCw":{"text":"Food was excellent.  Oyster were fresh and huge.  Nice mix of locals and tourists.  Would ","useful":0,"cool":0},"hN6ZFxC-HEqOujlVDNRxtg":{"text":"Broiled and raw Oysters excellent fit for consumption. Food outstanding. Happy hours every","useful":0,"cool":0},"FlsRj4QMwxlbzh0w8IE4qA":{"text":"One of our favorite places we've tried while spending the week in NOLA! Shout out to Shay ","useful":0,"cool":0},"HWk1P9BWhct_lVAfCDxTVw":{"text":"Service was great and you can't beat the oyster happy hour! The oysters were incredibly fr","useful":0,"cool":0},"mAM7K--6RtJryhNLAP0Vzg":{"text":"First visit was to meet an old friend for oysters @ happy hour.  Good time, slow service e","useful":0,"cool":0},"dWXuWv-SNaanNaUBu6f5Gg":{"text":"The owner is stumbling drunk at 3:30 pm and just groped a female employee.\n\nAll of the emp","useful":3,"cool":1},"VRirNpqJ4t5RC-YSFMXLFQ":{"text":"VERY racist place and rude. The waitress shouted to me and my family \"us white people don'","useful":0,"cool":1},"ZERcMxMKWt7ktbp10AJNOA":{"text":"They were out of oysters and crawfish. Service was so so. The host was very friendly. The ","useful":0,"cool":0},"cVMvxzQmyVTSHSlng0s4WA":{"text":"I came here with a group of 6, and we waited quite a long time for a table that would seat","useful":0,"cool":1},"7ht0e-59zVxzZeIS-NPj1w":{"text":"Everytime I bring friends/ family from out of town here,  I regret it.  It's such a great ","useful":0,"cool":0},"r7tFNbv0eWDKz0_bZME67g":{"text":"3 dollar raw oysters 7 dollar grilled! Great beer selection cool setting away from bourbon","useful":1,"cool":0},"7fSP8KEjxMqjlSr3jbNbzw":{"text":"Always a great place to hang out, good food and dog friendly. Went with my dog Jasmine had","useful":0,"cool":0},"0fBOkpcYLey7_SjoRyYW8g":{"text":"Fruit flies were abundant which indicates they're in the bottles of alcohol. Cleanliness i","useful":1,"cool":1},"Acaqqmb2FJ7ACaBnBiJWJA":{"text":"I've been listening to Gerry V during my morning commute for quite some time. He's been re","useful":0,"cool":0},"yIRF8-D_8QBI7A1Ci6HMgA":{"text":"When that crave hits... You'll never beat Happy Hour Oyster deals. Sip up and get those ch","useful":0,"cool":0},"lHYWGliB9plMSmnRPQzKVA":{"text":"Taylor and the awesome oysters are the only reason they get 5 stars. First, we walked in a","useful":0,"cool":0},"cw6hV-6gVJJgQrGUNXq6hA":{"text":"I hope our visit was a fluke, the service was terrible. Being a waiter is hard work and I ","useful":0,"cool":0},"BtbQu1k8xpADTO6j66LcGQ":{"text":"Unfortunate. Awesome atmosphere, good food, but piss-poor management. Came in on a Sunday ","useful":0,"cool":0},"5A5EHgimyACW9SkOtHCedg":{"text":"My hotel was down the street, so the first time I ate here it was for convenience,  was a ","useful":1,"cool":0},"UETEkv1dRUjqpZ5rovQzGA":{"text":"Food was great. You have to get the crawfish! Service was prompt and and waitress was quic","useful":0,"cool":0},"_tT7Co7FsE-H3z5px5_YVA":{"text":"This has been the best restaurant we've been to during our whole trip!\nShannon, our waiter","useful":0,"cool":0},"WOrrw4cgCSjCaT-gfF4c4Q":{"text":"Awful experience. Warm raw oysters and terrible service. Automatic gratuity included on sm","useful":1,"cool":0},"KcxP4yCUNPGhM9VhT64MYA":{"text":"Terrible service. Two tables next to us got up and left because it took so long. The truff","useful":0,"cool":1},"6M50gjo567RtZUStk0nWZg":{"text":"We are staying at the Avenue Plaza so the Pelican was convenient for us. What a great surp","useful":0,"cool":0},"uRtgwr95Hl-YKCuEIgCEqQ":{"text":"My first visit after hearing positive things.  First I waited 15 minutes and decided to ge","useful":0,"cool":0},"fRL4aHFnuIIIhOvBMNpVEw":{"text":"The only reason I ever go to the Blind Pelican is for happy hour oysters. They tend to be ","useful":0,"cool":0},"kGAQBE1k6IWCDHgZ2Uov0Q":{"text":"So... Service can be good. You can't beat the price on Happy Hour oysters! Visit if you ca","useful":0,"cool":0},"-XvObhmyx5GPjFA0PJG6LA":{"text":"Amazing time here! We are in New Orleans for the weekend and swung by for the $.25 oysters","useful":0,"cool":0},"csGnyIYXOop0smV-jsZIMA":{"text":"One of the joys of my recent trip to New Orleans was discovering his place. 'Tis a bar wit","useful":2,"cool":1},"-LmI-ui3yvn726HE5uJOTA":{"text":"A major disappointment!! This place has the potential to be so cool. The decor was the bes","useful":0,"cool":0},"fjsoLGwgy5K0WL8BJpIT1A":{"text":"You get exactly what you would expect from a tavern on St. Charles Ave. this place is, liv","useful":0,"cool":0},"AOf8iz9B0DZLWznvUL86gA":{"text":"Not bad for bar food. Their signs and menu hype up their oysters, so naturally, we had to ","useful":1,"cool":0},"VXAT2AYpN4gOcsFViCwzgg":{"text":"The best. Forget the French Quarter, this little gem in the Garden District, offers .25 ce","useful":0,"cool":0},"o1JEKf33cAE4abBG6XQZuA":{"text":"The food is good IF, you are willing to work for it! Make sure to pack up your pliers if y","useful":0,"cool":0},"gfzusboRvDtBmPRp8uEPKg":{"text":"We enjoyed this place very much, loved the oysters, the charbroiled oysters were awesome a","useful":0,"cool":0},"2a6che8okTzfMl0D8RT_vA":{"text":"Very accommodating, casual, lively place!   We visited twice this week while on vacation. ","useful":0,"cool":0},"l-9AwcMeRIU9fT_e3lLsSA":{"text":"Good food, not the best, but very satisfying. I come here for the atmosphere. The owner St","useful":1,"cool":0},"KSg5mHE4VB6SiexSuCRneg":{"text":"The place had great feel to it. Nice patio area. But after we waited a while for our waitr","useful":0,"cool":0},"ANs3WqPD9XCIBRnlJl-LQw":{"text":"We waited over an hour for our oysters, only to have the arrive covered in grit. Completel","useful":0,"cool":0},"nMEce_LT_FGxsqAJ20JpxA":{"text":"Cant beat 25 cent oysters. Charbroiled oysters were fair in taste but small and a bit pric","useful":0,"cool":0},"wkn-ENnqt1au2LJJh2cb4g":{"text":"We stopped in quickly prior to an appointment in the area. The waiter was really nice. The","useful":0,"cool":0},"0KGyoMD7b9s-qMN4iHXlfQ":{"text":"I'm currently at the restaurant writing this review. They sat us next to the trash outside","useful":0,"cool":0},"pdNdSiuYe-7plvuwkB9sZg":{"text":"The service and the food on a Friday night was below acceptable. We had drinks and char oy","useful":1,"cool":0},"OUQTkhuy9p20cVSf_hmGJQ":{"text":"I got food poisoning from my dinner. As if thats not bad enough, the service wasn't great.","useful":0,"cool":0},"w6uT9tCwb_7NJddjGT4OWw":{"text":"Tourist trap!!! This was one of the worst places that I've been in New Orleans!  Service i","useful":1,"cool":1},"zi3CYfmzvvY8FPM3YzM1NA":{"text":"This place is absolutely filthy. Floor, tables, windows, bathrooms. Ground in, smeared on ","useful":0,"cool":0},"TDbI2JXxFw07DCnM0jqC-Q":{"text":"A hidden gem! Stopped in with a few lady friends for Sunday bloody Mary's and we fell in l","useful":0,"cool":0},"HMDsRSNcqk_MbVTwEWP7ww":{"text":"Sat at bar. Service wad terrible. Only the lady, who was obviously the owner/ manager both","useful":0,"cool":0},"03C3SkG5Vs_3RzIT9_GjBg":{"text":"We wasted our last night in NOLA here. It looked so cool but we should've turned around wh","useful":0,"cool":0},"brnxDwkvP4pqhCCXZqLZJg":{"text":"This was the only restaurant that I tried in New Orleans, but it was a pretty satisfying e","useful":1,"cool":0},"Ga7Jx5ChHLOWnVd3rQ3BDw":{"text":"Excellent place for excellent raw oysters and sports but be aware you only get the .25cent","useful":0,"cool":0},"cyQflMK_55wpAz_wzqW00Q":{"text":"If anyone ever ran out of reasons to love New Orleans (I mean, that's totally impossible),","useful":6,"cool":3},"Qbf0x4ZE108SfoH8_wO36w":{"text":"Let me first say that I have never written a bad restaurant review - but after my experien","useful":1,"cool":0},"IZ5Fqs3TXSpFuguLQbl6vA":{"text":"Just don't. Roaches everywhere. Terrible service. Servers do not care about their customer","useful":0,"cool":0},"Pwk9RB_NG1mehuKdGouNGw":{"text":"Been in NOLA 8 years. Been here before - great. Now - it's apparent new management. Terrib","useful":0,"cool":0},"JaSLwRU8hant6p7jtUHRNQ":{"text":"Omg the grilled oysters where so fuggging good!!!!!\nThey have indoor and outdoor seating a","useful":0,"cool":0},"OktygZupR1ymCFYMccbPnA":{"text":"We went here on Happy Hour. It was great!! Got the $3 raw oysters and $7 char-grilled ones","useful":2,"cool":1},"Rh7MHkZjo5WjZaOnA_9lfw":{"text":"Heard good things, so we decided to stop in for happy hour. I ordered a dozen oysters, and","useful":0,"cool":0},"Bm5Vgl1fMBJREMvp0qhWnQ":{"text":"$3 for a dozen oysters during their daily happy hour 4-8pm.  I thought it was neat watchin","useful":1,"cool":0},"WCv0P8al_rDAppvoMBumQw":{"text":"Worst service ever. Server was drunk. Po boy wasn't good at all - Bread was stale and chic","useful":0,"cool":0},"vgJIzF3HS_fb7j1ezMIx5A":{"text":"I really have to say it!!!! IS THE WORST PLACE in New Orleans, is a horrible service. The ","useful":0,"cool":0},"GZZjGKg6-XjXAMqHqk8r-w":{"text":"I live right around the corner 4 years now. Each year it declines. Service is so terrible,","useful":0,"cool":0},"ZQ2DNq-QFrXmrJgS6FQnTA":{"text":"Hmmm.  Not sure about the lines to get in.  Liked the $3 a dozen oysters.  Wait staff was ","useful":0,"cool":0},"BaiyL98oudk77Jfvt9H2mw":{"text":"Hate this restaurant. We ordered the food from the bar and sat on the table. The waiter di","useful":0,"cool":0},"rUg1A_NrB0wU53YMui_Egw":{"text":"Our absolute favorite place for Chargrilled Oysters In NOLA!\n\nWe come here for the happy h","useful":1,"cool":1},"D2MOFwaLD-_4GE6cgHA48Q":{"text":"The oysters are AWESOME!   The service even during happy hour (which is crazy busy with $0","useful":0,"cool":0},"eqrRv_iXeg2m6ytK-haAjA":{"text":"I'm not sure how many stars to give this place. Food is great. Oyster special is nice. Dri","useful":0,"cool":0},"iUGtzTjL5XStABZLHzOqJw":{"text":"Wait staff is nice but entirely overwhelmed. Although oysters are enticing and cheap, they","useful":0,"cool":0},"_Bns2scetKzzw1hIIvfvjQ":{"text":"The main attraction for me here is beer selection, after that I really don't have too many","useful":0,"cool":0},"jNS7ptwmCp3evEKUTOHi_g":{"text":"Excellent TV setup.... Food not that good. Service real slow, understaffed this Sunday. Ha","useful":0,"cool":0},"sGWufF18m_CBd9DNvrrZfQ":{"text":"They advertise they have 25cent oysters from 4pm - 8pm. We arrived at 6:45pm on a MONDAY t","useful":1,"cool":0},"89LQunAJ9T7ebQkJFpH8Ng":{"text":"Service was great and atmosphere was wonderful and lively. You must order alcohols to eat ","useful":0,"cool":0},"bQp4Al4EW81p-0vWANAIdg":{"text":"This place rocks year round, hidden gold mine of Nola. Oysters to die for come in and see ","useful":0,"cool":1},"_HOWihX8zcFoWBCbsMZ0_A":{"text":"This place can be miserable when it's crowded. Especially when everyone is trying to get i","useful":1,"cool":0},"tsgETpQcdulCEOOfS8TVJQ":{"text":"Happy Hour. Oysters. Beer. I thought I died and went to heaven. It was $3 for 12 raw and $","useful":0,"cool":0},"gVxN24o2fcRsyTBy8AOlNQ":{"text":"I can't comment on the quality or taste of the food because we never got ours. Even if the","useful":6,"cool":2},"PKAJCB60YhLTArwH0o54Cg":{"text":"Well, I came here for lunch with a co worker today.  It's down the street from my work and","useful":7,"cool":1},"4glSKzowpS7any8hHXVK5Q":{"text":"My daughter and I were looking forward to eating here a few nights ago. When we arrived, t","useful":0,"cool":0},"OKSObX6G_zv5wpr-knG0fg":{"text":"They told us it would be a 45 minute wait when we got there. At the end of 45 minutes they","useful":0,"cool":0},"q45Rn5YX_U7oT4_J9sC3xA":{"text":"We arrived during oyster happy hour. We ordered a few drinks, a dozen charbroiled oysters ","useful":0,"cool":0},"k04znzrsORYg2DTHSwo-Iw":{"text":"HOLY AWKWARD! \nTonight was possibly one of the worst dining experiences I've ever had. Obv","useful":7,"cool":1},"ey9ONXhYyLaeF5GjxHIFbA":{"text":"Food - amazing! Service... not! We waited 30 min in line to see the hostess because there ","useful":0,"cool":0},"riAk2TXDZG7przKzI8lzjA":{"text":"Very disappointing experience. We live in the  neighborhood and walk past this happening h","useful":1,"cool":0},"rCMqLZO_UpTwVJD21gF8xg":{"text":"Excellent charbroiled oysters and chicken nachos.  Our server Melissa was funny and very a","useful":0,"cool":0},"zhNdBHfcBgSexMoztDAZTg":{"text":"Unhappy hour is more like it. I went with a group of 12 and we sat 4 to a table (not one l","useful":2,"cool":0},"Ok4QJMWghWIq-8FZJBnbfw":{"text":"Summary: The terrible service far outweighs any satisfaction from the food or drinks.  If ","useful":0,"cool":0},"j3KC7KFD3xEqF6LDm9Q8ew":{"text":"Amazing oysters. Go for happy hour! You cannot beat it. I will return every time I am in N","useful":0,"cool":0},"0sm4XS6bnd2ZCXa8Ij4FYw":{"text":"The wait for raw oysters was just SUPER LONG!! \n\nSeated in about 10 mins for HH. Super nic","useful":1,"cool":0},"WNZMdAN3G6S9pcCpd-i_uA":{"text":"The food was great and the prices are hard to beat, but the service was definitely not the","useful":0,"cool":0},"yMQeKpgK5Ovp5fZiLZFk7Q":{"text":"Do not like this spot. Always over priced, and the food quality is majorly lacking. Don't ","useful":2,"cool":1},"5PvkZlqiJPROtdTaOZL1Pg":{"text":"Keep in mind that this is first and foremost a bar, no matter what time you visit.\n\nI duck","useful":1,"cool":1},"-yrs0DTzAsJa3RGMF5hfgg":{"text":"Max 1* per my only visit.  In town and looking for place to eat.  The seating / hostess pr","useful":1,"cool":0},"mVrcXMPq1rlIZUfBdDf7nA":{"text":"We specifically went for happy hour and had raw and charbroiled oyster that were delicious","useful":1,"cool":1},"DDhSdYjDbL1Mo-Ryt6gSdA":{"text":"Lively place with the often-mentioned 25-cent oyster happy hour... it was packed on the Mo","useful":0,"cool":0},"B-AnWdA_j0dIv1lv5HF43w":{"text":"3 stars w/ nearly 500 reviews - no good. That means that Blind Pelican has many low review","useful":0,"cool":0},"BPZp6GeOX5wbQM2Hkh1Rvw":{"text":"I've been here twice now and feel confident in saying that their staff is pretty terrible.","useful":0,"cool":0},"k_HnYHN1zD2qtJGICvWi7g":{"text":"Great place to hangout with friends & relax. Mostly locals and everything I have ever orde","useful":0,"cool":0},"Z7LgSJyhsvs0TMkgTSWIZg":{"text":"Okay, so this may not be fine dining, but oysters happy hour hit the spot and was reasonab","useful":0,"cool":0},"XLDXZl1VOZe2IMur4BVV8Q":{"text":"Fun casual party atmosphere, pretty heavy on the bar side (TVs, flashing beer signs, etc.)","useful":0,"cool":0},"CCSU8uB5OrWQkTEJgprX_A":{"text":"The pelican was close to my hotel and I went there twice as I didn't feel like going into ","useful":1,"cool":0},"GXRLnMp60OAahfPsexLc4w":{"text":"Fun place! Even though you had to order a drink with each dozen, can't beat the 25 cent oy","useful":0,"cool":0},"iQpYSAVgdg6W3e0M9XuNww":{"text":"Thought this was going to be great. Food was good but not worth the shit ass service that ","useful":1,"cool":0},"WOVPxdvh16YqxuqAEneeQw":{"text":"Love the happy hour (4-7pm) 25-cent oysters! Arrived at 6:50 and immediately ordered 3 doz","useful":0,"cool":0},"7cuI5C0FaLwVsN48I7PQbA":{"text":"We visited this establishment on 5/31/13. Our hotel was behind this restaurant, so when we","useful":0,"cool":1},"OEqLyhJO1yQIyJxp5U2Ljw":{"text":"Terrible service, mediocre food... At best. Apps came out after the food - and incorrect. ","useful":0,"cool":0},"mU-R2N2R8XKKbiOxA8PAMA":{"text":"Dont bother! Seems like their M O is to forget the tourists. We went especially for the oy","useful":0,"cool":0},"FbbBCjqsBWzBiBFwumvLuw":{"text":"Horrible service!!!! My parents, my older sister, & me are all black & that had to be the ","useful":0,"cool":0},"80_ScEvyYqpqsVmM4yTkaw":{"text":"I was really excited to try the place between a recommendation from our Uber driver and al","useful":0,"cool":0},"SZUPiUNshdKN-cS6OMDAqg":{"text":"It was an awful experience.  Our waitress was trying,  but she couldn't help it.\nThey were","useful":0,"cool":0},"5Zu-aSawZh3FD-8o1Fzdxg":{"text":"If your an oyster lover raw or baked this is the place to be. Great atmosphere and Holly o","useful":0,"cool":0},"papu2e0951XRrhExH6gdkg":{"text":"Happy hour is 4p-8p every day. I went on a Sunday and was told it would be an hour+ wait. ","useful":0,"cool":0},"TOJXmuA60myoA9BQD_-nQQ":{"text":"3 stars--- After about 15 minutes being unacknowledged, we were finally seated and everyth","useful":0,"cool":0},"t36lxN1BCFy2783ELhjGug":{"text":"Our server, Erick, was phenomenal!!\n\nThe rest to say was by far not. I ordered three diffe","useful":0,"cool":0},"cBqtWiPflkV4EA4smYccZQ":{"text":"This place is amazing! We keep coming for the amazing bartenders specifically (Holly, Mike","useful":1,"cool":0},"nkgua9YmIDIZqWzw9ut4Xw":{"text":"Love this place. Friendly staff and great atmosphere. Try the fish tacos. Soooo good!","useful":0,"cool":0},"P5dsohMWLg5VK7wr9mncOw":{"text":"LOVED this place!  So glad I did my research before going on our trip to NOLO.  Specifical","useful":0,"cool":0},"H2uHKueCbG7mmhSCMwVfKA":{"text":"We stayed right next door to this place while in NOLA this past weekend. We went there a c","useful":1,"cool":0},"n6Q5-06ulj8-9I3FsJoBRQ":{"text":"Really cool place. The oysters are awesome (I prefer on the half shell). I got the bbq bur","useful":0,"cool":0},"IHFqcbbTgVWgZs9OvslYiQ":{"text":"I would not come back here for oysters. They aren't the worst I've ever had, but I'd rathe","useful":0,"cool":0},"zNSa6xKsPSw34MwRDm2axw":{"text":"The ONLY and I mean ONLY thing \"wrong\", is the possibility of a slightly annoying wait....","useful":1,"cool":0},"D0AzCFgV4yHMWz0rzKB1ug":{"text":"We stumbled upon this restaurant while looking for another. The menu was large and had veg","useful":0,"cool":0},"55VcjX0Aaq_cmCUCJk_SEA":{"text":"I'm not usually one to write reviews unless it's really good or really bad. This just happ","useful":0,"cool":0},"rBHUAL2ZMzi1P1vuhTNQXA":{"text":"Best oysters in town. Great beer. Can't beat the price. $3 a dozen with purchase of alcoho","useful":0,"cool":0},"dkHOK_4cpLp5VrqAyt3Wyg":{"text":"There are good meals, and then there are meals when you wonder \"why the heck did I come he","useful":3,"cool":2},"VbW4WobVyojm89VUZzX6Iw":{"text":"we were visiting New Orleans and asked around and people recommended this place. the servi","useful":0,"cool":0},"TUKS0NdsC1kJAfEm8CGLaA":{"text":"Great place to hang out! Had oysters after oysters with amazing cocktails. SErvice was awe","useful":0,"cool":0},"yJfYdEYSz73mqyKpmg5H_A":{"text":"This is a pretty cool bar with some good food and most of their menu was done by the J'Ani","useful":3,"cool":3},"hqBeuTD7sbHjplWK-H1cZQ":{"text":"Came here for happy hour for the oysters. Upon arrival we were excited to sit outside, the","useful":2,"cool":0},"8POQeSsNkTxLni1UiLCuIw":{"text":"I can't say enough good things.  The bartenders are very nice and the wait staff is awesom","useful":0,"cool":0},"QyM9Ne0u7hdXdmYhUI7WiQ":{"text":"Smaal place with a cool vibe. It has a full bar, fresh oysters and good table service. On ","useful":0,"cool":0},"em70CYX2WqO-nnfSTV8FYA":{"text":"WORST SERVICE PERIOD\n\nI don't ever write reviews, but I had to for the sake of future cust","useful":1,"cool":0},"dmjRBEqBnFd05X8IYPn1Wg":{"text":"Tons of activity with people waiting, crawfish boil at entrance with 25 cent oysters and f","useful":0,"cool":0},"FCwootPZ7rrv2taqi-ySZQ":{"text":"We went for oysters and beer.  The draft beer menu is quite extensive and the prices are g","useful":0,"cool":0},"f3bRVt1O3cU1-WOkkiPDZA":{"text":"The hostess was so incredibly rude to my family and to the other two couples waiting for a","useful":0,"cool":0},"Au-ChMrumxo03N8y93jLPA":{"text":"Does this look like it should take almost an hour to prepair?  I think not.  I called in a","useful":2,"cool":0},"O_KI8_OOMpxOZ1RZvDUSjA":{"text":"Save your money and time and go somewhere else to eat! There are plenty of good restaurant","useful":1,"cool":0},"L5_7MWMjz2dXu85rZgF6jQ":{"text":"The service was great Mario was terrific! The fish tacos were horrible!! I got the blacken","useful":0,"cool":0},"jO4XwQSuIR_6gVhcV72DUQ":{"text":"Don't waste your time with this place\n\nI went to SBP for lunch on May 2nd 2013 (Jazz Fest ","useful":0,"cool":0},"2VzoAp60-247pmP8AeaFPQ":{"text":"Well this is my third time here, granted I'm here a bit later then usual and it is preseas","useful":1,"cool":0},"Mgumz5vCNW-NcKYeSSZemw":{"text":"Great food.  Generous helping of oysters!  Day time wait staff very unhelpful and somewhat","useful":0,"cool":0},"QXgsU1bobefS-4hi_ppxwg":{"text":"The only good thing I can say about this place is the happy hour rocks. Cheap oysters. Cam","useful":1,"cool":0},"XpF6-bmb0op5nclNF5AOuw":{"text":"The atmosphere is fun and bustling. We met up with family for a birthday get together. I a","useful":2,"cool":0},"4MyIrdWRne7-IM9lk-DAQA":{"text":"Brought my social ride group with me to the Blind Pelican for the 25 cents oysters but fro","useful":7,"cool":0},"Yhx2aPkcMmghGhG2Aa61sA":{"text":"my friend recommended me this place for their happy hour . Can't go wrong for $3 for a doz","useful":0,"cool":0},"_OO9RVb_-DWkB9PZFav8qQ":{"text":"We came on a Thursday night and were seated by the host. No waiter or waitress came to our","useful":0,"cool":0},"xMWkj5FjO880HiAlFeW_BQ":{"text":"Just returned from Blind Pelican in the midst of Hurricane Isaac... even without power, it","useful":1,"cool":1},"ZC25eYQhWSZC-1seG7ATQg":{"text":"Visiting from out of town, recommended by our Uber driver.  Stopped in for some drinks and","useful":0,"cool":0},"W78kN6BoPfdcAxh7MDN09g":{"text":"My first time coming in and we  were greeted by the hostess Channing she made small talk a","useful":0,"cool":0},"s_F4mHwNoNuR16ATbEDaTQ":{"text":"Great place for inexpensive oysters.  If you want to pay 3 times the cost to eat the same ","useful":0,"cool":0},"kZ1PUX-w5DqZH6B5zCMJHA":{"text":"Unbelievable food. We snacked our way through appetizers and sides, starting with chargril","useful":0,"cool":0},"DNqPD4FzKrc0__09WidH0g":{"text":"A great place for cheap and tasty oysters during happy hour (buy a drink and get reduced r","useful":1,"cool":0},"Jw_grVfopYKqaBy_ZRCA3g":{"text":"I've never been to New Orleans and my friend told me to come here, OMG! The best grilled o","useful":0,"cool":0},"ph3V0CUu87Z1A_4R8OFiow":{"text":"4 stars for their oyster happy hour alone!! I went two days in a row. The first was for di","useful":1,"cool":1},"RCeYNCMGXkeKa_vwY59-gg":{"text":"We had the Alligator Hash, Fried Green Tomato Stack, Chargrilled Oysters and Oysters on th","useful":0,"cool":0},"PmOJ3bdJdONNaC3K0rhFtw":{"text":"This place is great. Fridays is $0.25 oysters and they have $3 beer specials.  We came her","useful":0,"cool":0},"dFc6KsGK76hQH-RfLCWpCQ":{"text":"Boy it was so disappointing to be back after two years. Super bad service. Quality of food","useful":0,"cool":0},"mv7AASIyC9_bXzqzbvlSMQ":{"text":"Good food. Tons of TVs for football. Great tropical vibe. Lots of outdoor seating with out","useful":1,"cool":0},"rxxkoQnRfx84k9mQzPGNKA":{"text":"We waited an hour to be seated on a Monday night. At that point we felt so invested stayed","useful":0,"cool":0},"SswinE1Od71qjxjFHhvEAw":{"text":"We came on a Thursday night and were seated by the host. No waiter or waitress came to our","useful":0,"cool":0},"pD_xSC2lglFVCp1G7lZItA":{"text":"Just had the WORST service experience here. I'm usually someone who will always do the nic","useful":0,"cool":0},"zxKUB8w92CpsZvw9MZ9WuQ":{"text":"HAPPY HOUR!! 4-6 $3 dozen raw oysters and $10 charbroiled oysters with the purchase of a d","useful":0,"cool":0},"4I2UFVQwHGphFEj8Q6Zycg":{"text":"From my fellow yelpers, it appears that our experience was not that unusual.  The place wa","useful":0,"cool":0},"mftcO2f6ptK2WccPnwtSDw":{"text":"As a bar, probably 4 stars - really nice outdoor area right on St. Charles.  As a restaura","useful":0,"cool":0},"4hewNG2lCtUoMSDVIWXFBQ":{"text":"Great outdoor seating, full bar, good food, a nice alternative to some of the more \"bary \"","useful":0,"cool":0},"vh1DiMdBnfG-TE143u5Rcw":{"text":"My wife and I went for the oyster happy hour and were a little disappointed. The oysters w","useful":0,"cool":0},"UeI5yLR_BMeNF4GSL4Lb5g":{"text":"Might be closed. Stopped in on a Monday night and Tuesday night per a friends recommendati","useful":0,"cool":0},"a6IS34CJka9OHo2ShVpHhA":{"text":"Very disappointing to called HONG KONG on our receipt by our bartender Beth. .... Hmmm Smh","useful":10,"cool":0},"DBA6ACMTu_DxO0N7LjMYsw":{"text":"Found a worm in one of our oysters - waitress serving us asks \"So, what do you want me to ","useful":0,"cool":0},"dzB4HmdWCyLd6n_Q9JCUag":{"text":"Oysters are like $5 for a dozen during happy hour with a purchase of a drink. Quite good f","useful":1,"cool":1},"bbl0zxeQ1OHPxsSBUuIRSw":{"text":"$3 oysters you can't bid that and $8 for charbroil ones. Excellent selections of beers and","useful":0,"cool":0},"vjHwFiJbdpgBwZpjpXbF4Q":{"text":"Blind Pelican is THE place for enjoying food and drink with a prime view of beautiful St. ","useful":0,"cool":0},"6oPNScFW-zuMiCWl_7MSew":{"text":"Heard about the oyster specials at this place during happy hour so thought I'd come try it","useful":0,"cool":0},"3-r1PCMnMbC7V_r9jdizng":{"text":"Just moved to the neighborhood a couple weeks ago and have eaten here twice. The food is g","useful":0,"cool":0},"3mVhKLF7U8xbEA2Eg69J1w":{"text":"Charbroiled oysters way better than Drago's! Yet, if you go later in the evening they run ","useful":0,"cool":0},"U85zPjWYlupr0YSPI0JADg":{"text":"I love this place! Amazing oysters-fresh and charbroiled (order both) Other food is yummy,","useful":0,"cool":0},"TVB4vE76XqLFOpUeOoftEw":{"text":"$3.00 dozen raw oysters for happy hour from 4-6pm. BEST DEAL IN TOWN! Great patios, attent","useful":3,"cool":2},"904ev00WItLLZkS9xnhyPQ":{"text":"Their oysters are big and they're pretty good but not great. Went there for happy hour whe","useful":1,"cool":1},"wwuART-En68kAlbFvYjsBA":{"text":"Got a perfect seat outside one night. Good beer and fantastic late night boiled crawfish. ","useful":0,"cool":0},"2U4vhKKByq2_o_fEtYTTvw":{"text":"Great Place, really fun atmosphere. Jimmie was our waiter and made me laugh so hard. Food ","useful":0,"cool":0},"zZhVO-zeesnt-lP-wUNLYg":{"text":"This is a hard one because of the absolutely stark contrast between good food and lousy se","useful":1,"cool":1},"ioI_EVuxXexJ9XmsmKNVzg":{"text":"My friend and I came here on a recommendation from a friend because I really wanted to try","useful":1,"cool":0},"fBGL0W9ej7nbyq2L2VS4dA":{"text":"Great music!\nYummy fried shrimp po' boy!\n\nI didn't like the coleslaw.  I know this isn't t","useful":0,"cool":0},"Tv3bPFbS3F7NV6BLhMIgMg":{"text":"Found my new place to go in New Orleans for a laid-back good time. Was told by a local whe","useful":0,"cool":0},"jNmOkL2sA7EZwY9mgUqfEA":{"text":"Oyster specials are great, had the BBQ oysters, which were delicious.  Definitely order th","useful":0,"cool":0},"g3M4QKY8XwtC0_zCqJ-3GA":{"text":"Great music and atmosphere.... AWFUL service!! 2.5 hours for 6 people.. 25 minutes in betw","useful":0,"cool":0},"W6B7WzmkHUjveoNrt55zaQ":{"text":"Worst dining experience by far in New Orleans. Happy hour was recommended by a local so we","useful":0,"cool":0},"FEHZtm887cScopfBR2DtdQ":{"text":"The oysters (both raw and chargrilled) were amazing. Needless to say, come during the happ","useful":1,"cool":1},"-oxM1C1KttJhhLCN-eYnTQ":{"text":"I used to love this place, these days their service sucks. The hostess is horrible, told u","useful":0,"cool":0},"OFm4zGDkUXnpTmB3vhjADw":{"text":"Came in at 5:00pm hoping to be impressed with inexpensive oysters, but I feel like the emp","useful":3,"cool":0},"7dwf3oPNB9V_vcmvNvQyVQ":{"text":"Good outside space, great place to grab a beer and oysters. Servers were very friendly, bu","useful":0,"cool":0},"kMe8DK8sRiDGH0zL5T5w0w":{"text":".25 cent oysters?? What? Plump, juicy and delicious! Max order of 2 doz. Hrmph! A great pl","useful":0,"cool":0},"9dKpwgQVNc4tT7Jr_oeKSw":{"text":"My wife and I LOVE this place! BEST prices on raw oysters and I'm FROM NOLA, don't know wh","useful":0,"cool":0},"fzmZnodKwZAaqLqOTzkF5Q":{"text":"Dropped in at the Blind Pelican on St. Charles Ave on a Friday afternoon for the much talk","useful":0,"cool":0},"_wrl4my6ksgoeOAGVtfPzA":{"text":"I've always passed this place so decided to stop in.  The person I was with was vegetarian","useful":0,"cool":0},"d5TWZ7Xo8HClufWCvuE0og":{"text":"They are closed down. Don't know what happened but spent 13 dollars on an Uber to find out","useful":0,"cool":0},"G2TZGUj3zFMsHTBS0SKxbg":{"text":"25 cent oysters! Good deal with a drink but prepare for a long wait time. We arrive here a","useful":0,"cool":0},"9ai50IZ-iyj5GxktL510hg":{"text":"They play their music so loud people sitting at surrounding bars can't have conversations ","useful":0,"cool":0},"tmb8f1cNtbFva8SfpQuWzg":{"text":"I originally gave this place 5 stars because I had a really good first experience. When I ","useful":0,"cool":0},"KStpqe8Isw4ps_Kw-NuUwA":{"text":"If I could do zero stars I would. The place instantly attracted my friends and I because o","useful":1,"cool":0},"IKoYJ9JSMu2snN0qGtOWcA":{"text":"A must go for Happy Hour (4pm-7pm)! All five of us got a dozen raw oysters each and enjoye","useful":0,"cool":0},"DZ1LIiwzZTKX1Y36mdnIAw":{"text":"We were looking for a quick seafood place close to our hotel, so we picked this place. I'm","useful":0,"cool":0},"O_VkJTbtZc29uY-rcO3K-Q":{"text":"We happened onto this place by accident and had an excellent experience. We sat at the bar","useful":1,"cool":0},"5dKIs45eSc9viWys2YqceQ":{"text":"After three separate visits, I've determined the food here is sub par, the service is lack","useful":0,"cool":0},"W0Xltpc7rvUEY4wMWXcPdg":{"text":"We happened upon this place when wandering around the Garden District stopped and for beer","useful":0,"cool":0},"S-i8NPzZv1xU29tdvucSyw":{"text":"ABSOLUTELY TERRIBLE SERVICE\n\nWe ordered raw oysters during happy hour at 6:30pm. As of 7:4","useful":0,"cool":0},"A_23SVOs2ssSdvHfyGp9rw":{"text":"My fave place on St. Charles! Close to my house so I can walk home or Uber after a great d","useful":1,"cool":0},"PyHHgrhU-d7qU3p52NUTIQ":{"text":"WINGS WINGS WINGS.  A lot of people come here for the BOIL... But I dont eat fish so these","useful":0,"cool":0},"P3m3FlLUqKL2G1LxP6GAFw":{"text":"Waited 27 minutes, got sat in the middle of the floor. Asked for PBR, nope out. Asked for ","useful":0,"cool":0},"ZYJrMjtse2HCd5cVJJHUhA":{"text":"Brian was our waiter and when I say he was fabulous, he was FAB.U.LOUS. He was attentive, ","useful":0,"cool":0},"tWcES9XPLasxuxDE8m60MQ":{"text":"Stopped by the bar on a Saturday afternoon. Very friendly staff. Great local beer selectio","useful":0,"cool":0},"NZSgDVVLeVCSoBvM3tonHw":{"text":"Let me first start by saying this place is worthy of five stars, all the way! The food and","useful":0,"cool":1},"qzl6xSF6iKr0UIdQjbr6NA":{"text":"this place is a disaster!  first of all, the happy hour prices are great, but these people","useful":1,"cool":0},"PgiL9aweJmPPmQ6w0LoTOg":{"text":"Dexter does the best boiled shrimp I have ever had. Good dipping sauce but was not needed ","useful":0,"cool":0},"30txF-PYHDm1PP6C450B3w":{"text":"We walked in because it looks so fun from the outside. It was kind of late and we wanted t","useful":0,"cool":0},"jtriTxOivV1MffqBsKQz0Q":{"text":"This was our favorite place to eat in the garden district. Crawfish and oysters were fanta","useful":0,"cool":0},"Wh8ezClQe_LRD63YZUzIHg":{"text":"This has been my favorite a establishment since I 1st started coming to New Orleans a coup","useful":0,"cool":0},"E8czN4ovGKgfvTdShTT0ww":{"text":"I like the atmosphere, great outdoor area and lively-filled with music and people. Beer se","useful":0,"cool":0},"4mhxkSPd-ig0R_WTYiod5g":{"text":"The only reason this place got one star is because it doesn't give you a \"no star\" option.","useful":0,"cool":0},"CgkrlcGA3cVQl7fax7MNyw":{"text":"The only reason I am rating this a 2 instead of a 1 is because the servers were really nic","useful":0,"cool":0},"oZQsXafpng69wXZ6vlWrFA":{"text":"I really want to like the Blind Pelican--they have so much potential, but there are a coup","useful":0,"cool":0},"v6JswADL3DmIc0B9vakqnw":{"text":"Oysters both raw and \"baked\" are very good. Fresh, no fishy taste or smell. The staff is f","useful":0,"cool":0},"oWIaekochNG1GmoKLSZezg":{"text":"Huge oysters, cold beer and strong drinks!  YESTERDAY, we arrived at 3:30 (stayed until 5:","useful":0,"cool":0},"RHs0eaETlNJATXEVNQeqgg":{"text":"The food was pretty good and a nice atmosphere on the patio. Service left MUCH to be desir","useful":0,"cool":0},"9VZtHaqQAFtK0ZBnHdEqlg":{"text":"I'm writing this review from only visiting during happy hour- which has 25 cent oysters- e","useful":2,"cool":1},"ROA3459G-Q3jvKtJdUcCDw":{"text":"The oyster happy hour is amazing and Wanda is a stellar waitress. Definitely recommend!","useful":0,"cool":0},"hhxmbPlTyPM0eXyDFImgKQ":{"text":"Happy hour is one of the best in the city.  The servers are always a bit eccentric and giv","useful":0,"cool":0},"xuksy7oScDTaQFwUFGDLQA":{"text":"The owner is a jerk, his staff are incompetent.\nHostess suggested we have a drink at the b","useful":7,"cool":0},"qMKQOKnSMgbu2_FmGPUXiw":{"text":"We came to try the happy hour chargrilled and raw oysters and are happy we did.  We had he","useful":0,"cool":0},"cbDtLJ1qC-GBEAVyraG6KQ":{"text":"Waiting 1:55 minutes and still have not been served our oysters! The sad thing is, we've w","useful":0,"cool":0},"bkNQqpV0Qh57KcWIng4Trg":{"text":"The staff didn't care that the food runner spilled oyster juice and oil all over the jacke","useful":0,"cool":0},"pvuJCo6-EyG6Eqhqqwmn7g":{"text":"This location used to have the most amazing service. Now its by far the WORST experience I","useful":0,"cool":0},"ZD0tfhNKuAs4ktFxncDJKQ":{"text":"Kitchen is ALWAYS closed. Don't waste your time! On three separate nights, during normal b","useful":0,"cool":0},"NOlVmAydn-k2BaIH4zbeeg":{"text":"In town a week ago, left another place to come here because the menu on the web site looke","useful":0,"cool":0},"H3QbHex9oeQN6svixHtKFw":{"text":"The $3/dozen raw and $10/dozen grilled oysters are definatly worth coming here. Just know ","useful":0,"cool":1},"WCTDcGws7KtUDyHpndJPMQ":{"text":"I came here for the happy hour special (Everyday 4-8 PM) . Of all the places in New Orlean","useful":4,"cool":0},"Outo4Ip_8XJdnEtXrF2CrA":{"text":"said it would be a 30 min wait so we went to the bar to get a drink. took 15 mins to get o","useful":0,"cool":0},"OwWAVoXpYOf1UXOBkxEvHA":{"text":"Slow service and mediocre po'boys. Servers finished their shift and started smoking right ","useful":0,"cool":0},"nAdwnuuIiZx2O2oJK5eZkw":{"text":"Had an excellent Bloody Mary here, the food was good and we had friendly service. They als","useful":1,"cool":0},"Xgy7YBKQalzU-ja33GrHtA":{"text":"Came here during happy hour a few days ago. It was absolutely amazing. With a purchase of ","useful":1,"cool":0},"-PEKHIKQH7Y72V9aceUa5A":{"text":"They have cheap oysters during happy hour.  That's honestly about it.  The oysters aren't ","useful":1,"cool":1},"0O0SPGJw1giF7cek9wV8Hw":{"text":"I've been here for happy hour before and enjoyed sitting outside having a drink and a few ","useful":1,"cool":0},"SKgaNUOXHK2wR-G6nCJLmg":{"text":"I can't believe I've never reviewed the Blind Pelican! What a slacker. Here's a breakdown ","useful":4,"cool":0},"pVAtgE2oUZEsvHvGPFF95A":{"text":"I don't know why this place has 3 stars it should have five.I've been here twice on our 5 ","useful":0,"cool":0},"nIfmWPJ__nsCedIq4aGNoA":{"text":"My boyfriend and I visited NOLA for 9 days and couldn't stop coming to this place. We visi","useful":0,"cool":0},"78iaQx1z2uuv6qISdbngCw":{"text":"I didn't want to believe the reviews but they were mostly true. We came on a Sunday evenin","useful":3,"cool":0},"WM4fBfen0wTy99RfWejMMQ":{"text":"After a recent venture for finding the top oyster happy hours in the city, I've concluded ","useful":3,"cool":1},"Gvrqhss3_GDGcELf7qhJVg":{"text":"Can't beat the happy hour prices for oysters. Service can be slow but atmosphere makes up ","useful":0,"cool":0},"VbPG_lcbSBm0dkSzdzOVcw":{"text":"There's just no way you can beat their happy hour oyster special.  The wait staff is frien","useful":0,"cool":0},"Wx4eBMiZGTPm9FoA4nGsmQ":{"text":"Only good thing left is the 3 dollar oysters at happy hour. No kitchen no tap beer and cas","useful":0,"cool":0},"7ATiuCln56q0mv-ZjuStmQ":{"text":"$0.25 delicious oysters with the Blackhawk game on the big screen?! Yeah, this place gets ","useful":2,"cool":1},"Id6Jurf-5Eldf24fjIEmyw":{"text":"The food was HORRIBLE!!!! The service was why I gave it ONE star. Also they allowed this Z","useful":2,"cool":0},"FsFbMCxUeaOcq7FfVZZOYQ":{"text":"I'm in heaven. Great service. Weekday at 4:30. Perfect weather on the patio. Great beer. E","useful":0,"cool":0},"n-gV-EX6PWJ9-9J9pDzEtg":{"text":"I'm not going to lie. I was disappointed when my girlfriend and I stopped in for a late lu","useful":0,"cool":0},"oFOxNJRY6NdkbOTc7gwKqA":{"text":"I have been here already for few times because of my friends and never had good experience","useful":1,"cool":0},"4OryQ8XoUTirPYgc4DatPA":{"text":"If it were possible to give negative stars I would do that. This place is a joke. Need a l","useful":0,"cool":0},"fah37QhvXT19DM7tZraYvQ":{"text":"After seeing endless reviews about this place having bad service/a horrible wait, I was a ","useful":3,"cool":0},"rwnK-RDgw4H1xKSEmr6dKw":{"text":"On Mardi Gras, cold weather but Good fresh oysters but we have to buy alcohol to get the d","useful":0,"cool":0},"Xc1SsXChYfFrBlDpBOR6Qw":{"text":"A tour guide recommended this place when we asked for a local place where we could find a ","useful":0,"cool":0},"xHpIynN_WwhWZ259HHsDRw":{"text":"Best place on st. Charles!! Love oysters, burgers, and drinks!! Great scenery outside.","useful":0,"cool":1},"iIztb1OC-XaNReFf7a8Wyg":{"text":"Needs to take online menu off of website.  It's a six page menu, based our decision going ","useful":0,"cool":0},"0Zg8rHZ6X3V4GKq8_oiwaw":{"text":"We loved this place! Amazing food people and prices! The kitchen can get backed up but ser","useful":2,"cool":1},"-TDnivgmIefeEiJvuuVm0w":{"text":"Pros: .25 oysters \nModestly priced drinks during non happy hours\nDecent happy hour drink d","useful":1,"cool":0},"QJL0avcC3-kGMTLv_sa-Mg":{"text":"My wife and I went for happy hour. With a drink you can get them for $3 a dozen. The drink","useful":0,"cool":0},"xRaCnqoSbVUmC-mPOljvpw":{"text":"New owners.   Cute setting. Patio is great fir relaxing on a weekend evening.  Happy hour ","useful":1,"cool":0},"SOxgzX9WCihptaKTfXuxQA":{"text":"Amazing food, awesome New Orleans atmosphere and great drinks, best variety of beers we've","useful":0,"cool":0},"PGnNb9UDn4UjFohz0LkKoA":{"text":"Excellent oyster bar with a killer happy hour deal. Very casual atmosphere with indoor/out","useful":0,"cool":0},"3qdG4mgxl5H_I9DGLo-ypQ":{"text":"Let me start by saying the oysters were wonderful and such a fabulous deal at HH! However,","useful":0,"cool":0},"Yf3lhNZqzPoUM4f_Mkse-g":{"text":"Can't believe we got a dozen oysters for $3 and they weren't bad! Would definitely come ag","useful":0,"cool":0},"0yNubzHFV4IxkcgAcFgCeA":{"text":"First off, college bar (which is fine but not my style)\nSecond, the staff barely knows wha","useful":3,"cool":0},"Lz7ENLLvIZadP1GyWdyU4A":{"text":"Slow slow service. I attribute to not enough oyster shuckers at happy hours, which are 4 t","useful":1,"cool":0},"_r7S16NuKLnEadUyT3TjyA":{"text":"Horrible. If I could rate The Blind Pelican less than 1 star I would, yet the rating oblig","useful":0,"cool":0},"12u2-5Hodpha8R46cqgnyQ":{"text":"Love Love Love Love Love Love this place! We just happened to stumble upon this glorious b","useful":2,"cool":1},"j1jZXMo-5STUPh5VmxRCDg":{"text":"I love this place. The happy hour is the bomb and my man Dexter on the seafood boil is on ","useful":1,"cool":0},"NxH6gK0ypuH6B71YQ15ZRA":{"text":"This is the type of place you want to find in all major cities....\nA local favorite with c","useful":0,"cool":0},"1oQwV3ib4vdwwS1W2YuMYg":{"text":"Really good food, really poor service. Waited 15 minutes for a waiter to come over and ove","useful":0,"cool":0},"PmlDUMd3noJnLpQzIUxGyA":{"text":"Went to watch the Arizona/Wisconsin game during the NCAA tournament.  It was a beautiful S","useful":7,"cool":2},"a2DAlpguxFMSgUA1Hz5nkA":{"text":"Yes yes yes. This is oyster and local beer heaven. My fiancé and I stopped here about .25 ","useful":2,"cool":1},"pZW-brt6vdY5anSOQU0thw":{"text":"So, 2010 was a great year in NOLA. Voodoo Fest, cemetery tours and everything else that ma","useful":3,"cool":1},"cgWggx1hHmPWWcJqUHwdhg":{"text":"This has been my favorite a establishment since I 1st started coming to New Orleans a coup","useful":0,"cool":0},"z5y5YorjOAECP3QW9ihE1A":{"text":"They have amazing food! The crawfish boil was fantastic and the oysters are to die for but","useful":0,"cool":0},"wkdW-Gun4oKcfqu_g0SRvA":{"text":"My wife and I went for happy hour. With a drink you can get them for $3 a dozen. The drink","useful":0,"cool":0},"FlptVmAqRWZjVr8hb491eA":{"text":"Love, love, love this place.  This was my third time going and again I was a very happy cu","useful":0,"cool":0},"Q9k6oywfddJHVBHw79IR7A":{"text":"Brace yourself for a very long review:\n\nDecided to give this place another chance. Huge mi","useful":3,"cool":0},"IIXCzy-zctEA-3iNLB---g":{"text":"The service was a little slow but it's a very laid back enjoyable place to visit. Outside ","useful":0,"cool":1},"GLbGX5yyfYHD5vje_zuK-A":{"text":"We went here hoping to start our night off with a good dinner, however our server was rude","useful":0,"cool":0},"86ThazkNz3T00TRnSY4MSw":{"text":"Recommended to us by a local. Service was absolutely terrible. Restaurant was undergoing n","useful":0,"cool":0},"RfBkozLqfGwEagrzUuR8WQ":{"text":"Can't miss the Blind Pelican even if you blink whilst whizzing by in a car, screeching pas","useful":1,"cool":1},"OKrguz-WKTMChiWNv9TeLQ":{"text":"Two Words: Chargrilled Oysters. They are delicious! They have a daily happy hour that incl","useful":1,"cool":0},"lMKmlz9MukxM2svEqNhQuA":{"text":"The Happy Hour Oysters are huge and tasty. However the kitchen moves like pond water. Took","useful":0,"cool":0},"Y52276afRQ_pjKupjRsmiQ":{"text":"The single biggest disappointment I've experienced in my lifetime. Oysters are first come ","useful":0,"cool":0},"qMMdNeqh6lyDufL5OCcfbg":{"text":"Melissa made us feel right at home.We came back over and over...We came here from Fairfiel","useful":0,"cool":0},"zkhTXteX-DBBrCcsej2dQg":{"text":"I was a frequent customer of The Blind Pelican, even though the first time I went there on","useful":0,"cool":0},"Xro6NUOxYK7BjRJyn2gidQ":{"text":"after giving TBP 4 stars back in Dec 2017 for its great 25 cent oyster happy hour,  sports","useful":2,"cool":0},"jdtXsskAoaM1eaIEns6KXQ":{"text":"Place used to be awesome. Now it's a total disaster. What happened? Service is absolutely ","useful":0,"cool":0},"dVSQFj8Ja-d4947XlD0-DQ":{"text":"ok, so my dinner reservations/dining experience at a so-called new orleans institution fel","useful":0,"cool":0},"s3VFH6PWTNlFqurEsJl6Ag":{"text":"I used to love this place.  Let's be honest, the service was always horrible, but I'm will","useful":3,"cool":0},"-orsC5w4MJt7IoqgNpOpig":{"text":"I'm surprised at the negative reviews but all I had was beer and oysters. They have a $0.2","useful":1,"cool":0},"caUTsIIVPBvR3SOwBgustA":{"text":"There were many negatives and one delightful positive at this restaurant.... the 5 star ra","useful":0,"cool":0},"qPqBeB6l21rcczkEFhDF2w":{"text":"Great place to hang out with friends enjoy seafood especially the happy hour deal. The oys","useful":0,"cool":0},"1tQYq8OEcvalA-LKKKBr5A":{"text":"No food til who knows when??   Kitchen closed until further notice.   Ugh.  Came here look","useful":0,"cool":0},"5ORxX_sL0wgjP7OmvBS4yw":{"text":"Love the oysters on happy hour and beer selection. I would steer clear of the club sandwic","useful":0,"cool":1},"Wu1dxXFiEjRRNAHYD8Y47g":{"text":"Extremely disappointed by Blind Pelican. There was ONE waitress who also was the bartender","useful":0,"cool":0},"SWv3qMRc5Z7fGz07vsSnAg":{"text":"DIRT CHEAP.... Literally DIRT cheap.... have never seen so much mud in my life. Oysters ne","useful":0,"cool":0},"nVNIWB208Chdo_1Z_02xYA":{"text":"Food is mediocre. At first glance the menu sounds great and has a good selection of items ","useful":2,"cool":0},"RCjbBiQplEGkbuXA78RV_g":{"text":"This is an amazing restaurant that we frequent every time we are in Nawlins!! We make sure","useful":0,"cool":0},"y8vnY5_kX8OcgixuRZAxwg":{"text":"You can tell they are going through some work. Kitchen is closed besides for the $3 raw oy","useful":0,"cool":0},"otfWxz1Yf22HAW1Pz1s1_w":{"text":"Been there twice, ate once. The oysters here are good and the wine is reasonably priced. J","useful":1,"cool":0},"zVUS7omULkTBRU1lgXjHbQ":{"text":"The best oysters I've had my entire stay in New Orleans! Service was great & fast and the ","useful":0,"cool":0},"sULsYi2yJ7_Fn_mH2t-N5w":{"text":"This is one of our favorite spots and a must visit.  It's chill, cold beer served in cold ","useful":1,"cool":2},"FOUZySOHM_w2-9eNx1sq-A":{"text":"One of the best places we visited while in town! Right off St. Charles, it lures you in wi","useful":2,"cool":2},"ETvxyQaQg1IzJR6uCvWT5w":{"text":"We came in here because a few people suggested this place. Come to find out it's cash only","useful":1,"cool":0},"4a_6sQeJg-AJTF66Vt9HQg":{"text":"Honestly the place scared me. They advertised super cheap oysters, and were right around t","useful":1,"cool":1},"ntLerT54lR8nJXgY8oTpew":{"text":"After reading the other reviews I'm very glad I got up and left before ordeing anything.\nW","useful":0,"cool":0},"5eeo8fREc5nhYJtXU_3-zg":{"text":"My family had dinner here tonight. It gives a city known for it's good food a bad name. It","useful":0,"cool":0},"0HY0YrM0xQJW6jsY3Xr0oA":{"text":"I traveled here with my family because I got engaged. It was 11 of us and the lady at the ","useful":1,"cool":0},"ofUpy6qK1DgZXBCLTVnK6A":{"text":"This place is great. Sure it's a dive bar but service is great, delicious oysters, amazing","useful":0,"cool":0},"73mCmojjKTDUf70dYB3rSA":{"text":"Excellent service! The oyster happy hour was delicious with good drinks! Can't beat the pr","useful":0,"cool":0},"dHpVwinzXILjK5If232G3w":{"text":"Amazing! Great local place to eat! I have never had oysters before and there 25 cent oyste","useful":0,"cool":0},"wrNoSx3VN15z5kOYfHrDHg":{"text":"YOU HAVE BEEN WARNED. DO NOT ENTER\n\nI hate this restaurant more than Melissa. \n\nDon't hate","useful":1,"cool":0},"ZBzB-hJZo8yHZbl3VODRLg":{"text":"Happy hour deal is great. $3 for 12 raw oysters. However the oysters are poorly cleaned, t","useful":0,"cool":0},"tIFhs0q4zO7H2Z6XWyA2fA":{"text":"If you are staying in the Garden District then come here! The atmosphere, food, and beer d","useful":0,"cool":0},"z1jCsjy5zlUfegmt2f_ykw":{"text":"I've been to this place several times before and it was spot on.   I have raved about this","useful":0,"cool":0},"wgREPui6cA70USxlZIekKQ":{"text":"If you love oysters, this place has the best happy hour deal for you. What could be better","useful":2,"cool":1},"F5WkewnslXA3X34XlKkASQ":{"text":"Save yourself the trouble. Ran myself down here for some BBQ skrimps and crawfish, but the","useful":0,"cool":0},"ms7MMPxWtSSmVDMNxpKbWg":{"text":"My husband and I went around 8pm on a Sunday night and it did look busy at first glance, w","useful":0,"cool":0},"_kUBh9ARXhoz2L5oaKxxCg":{"text":"I'm giving this place 4 stars because our server was fantastic, it made up for the hour an","useful":3,"cool":0},"4GyRIhGz2X639_QzPYPt6g":{"text":"Was excited to give this place a try. Walked in and we're told they decided to close early","useful":0,"cool":0},"kDRUHNtSLdYpouDUlShIkA":{"text":"Horrible place! Do not go here! They lure you in with the $.25 oysters, but they always ru","useful":2,"cool":0},"1iqd0MqglbqEZyJEsO91Xw":{"text":"Just letting you know, I NEVER EVER am negative about food and service but this place real","useful":4,"cool":1},"VLsEaEdk_6mmncoims2Giw":{"text":"Great bar with big screen. There's an happy hour EVERYDAY from 4pm to 8pm: buy a beer and ","useful":0,"cool":0},"CfCHO5nisaIR9AE1kbP3jw":{"text":"To be honest and fair, I disliked this place when it was owned by Steve. I gave it a secon","useful":0,"cool":0},"RI5k7zhBvF5pd1UPaxR6Ng":{"text":"Longest 3 days of my life. Ok not that long, but close. Happy hour, $3 dozen oysters. Prob","useful":0,"cool":0},"-dWw7vaaAlqXPWM827puPg":{"text":"Something has changed since our last visit. Out of oysters, out of our favorite beer, out ","useful":0,"cool":0},"sspKEApDalquykgQEALPYw":{"text":"6/5/19. We were told by everyone to come eat here. All of our Uber drivers recommended the","useful":0,"cool":0},"DA6GVVL-ZmJyiRuy68Wp4g":{"text":"4-8pm they have $3 dozen raw oysters and $7.50 dozen chargrilled oysters.....can't beat th","useful":1,"cool":0},"o3FNl8Rhd5IUr6YypRBkgw":{"text":"This is a dive bar/restaurant that's easily traveled to by taking the historic St Charles ","useful":4,"cool":2},"4D2KwonPbAAO9x818WXuhw":{"text":"If you think about it, change your mind!! It stinks, it's dirty, and right now there is no","useful":5,"cool":0},"zMJjh3Ex1J_7fT3NXtp3Sg":{"text":"Terrible, awful, worst atmosphere and service Ive ever seen in a restaurant. My husband an","useful":1,"cool":0},"edYVqgh4D3DcIdPMDT971w":{"text":"The raw oysters are always great. I tried the chargrilled oysters for the first time tonig","useful":0,"cool":0},"PZHbf8Bf14EekQhWr3JFvg":{"text":"Really good raw oysters $3/doz at happy hour with each drink order between 4-8pm. Or charb","useful":1,"cool":0},"CCqqglUnQC96MtmI8dm2iA":{"text":"Google said this place was OPEN. Update your shit. Good thing there were other restaurants","useful":1,"cool":0},"oCLpQrHbkcJde0mcyDJEUw":{"text":"From the friendly bartenders and patrons to the delicious food and good beer selection thi","useful":0,"cool":0},"GAJyhuPsqX_oUEFevOqBTg":{"text":"Hmmm, there's no words to say how bad is this place. They only served Raw Oyster at the ti","useful":0,"cool":0},"WHFSWklhI-4kYZUMy6DP7g":{"text":"This restaurant was so delicious we ate there two nights in a row during mardi gras. HH is","useful":9,"cool":8},"miA2ehQMDCp-uLdbUFPpeQ":{"text":"All I really want to say is that I had to ask for water FOUR times before the waiter broug","useful":3,"cool":0},"CPX4vorMXdtZH6AHgoJxZA":{"text":"The bartenders here are the worst.  Nothing but attitude and laziness. Sitting at the bar ","useful":0,"cool":0},"obqP-I4m0gmu-0gYVpi6_w":{"text":"I downloaded this app just to give this restaurant a rating. This was by far the worst din","useful":0,"cool":0},"BhhiJBfBcTD7upNdt27poA":{"text":"We had both the raw and charbroiled oysters and the crawfish boil; everything was deliciou","useful":0,"cool":0},"iOGtVgRJh0NAhTh2mVtvGQ":{"text":"We came here late one night during MG'19. You could tell that the place was going thru som","useful":1,"cool":0},"C8Kb-yxpbezjibvmlN_bWw":{"text":"Stopped by this place for oysters.... worst oysters in the city! Our order came out warm a","useful":0,"cool":0},"NnVjcsf0g9l7rTmcLf3MQg":{"text":"Ugh, I came here once on a NOLA visit, and have craved those 25-cent oysters at least a do","useful":3,"cool":4},"FdhdAOMT6kHI-8k2YuMiEw":{"text":"The service is slow and bad! Seems like everyone has an attitude and doesn't want to be th","useful":0,"cool":0},"dE1ygLehHq5aEHvZ-PuPVg":{"text":"Great oyster happy hour every day of the week. Better than Dragos IMHO. Best pizza I gave ","useful":1,"cool":0},"GnMFZ7s0R2HlgAKkHpbmVw":{"text":"This place had no food, after trying 3 different times on our 5 day stay.\nIt's sad they ne","useful":0,"cool":0},"DRLkyfhmdCY6Qr1Xir19SQ":{"text":"We came here at 7:30 on a Tuesday night. We had been recommended this place by friends, an","useful":0,"cool":0},"7ADNQd7prnkcGuHXLNvYGQ":{"text":"Very impressed with this establishment. I made my way here twice during Mardi Gras parades","useful":0,"cool":0},"17ng64u-aITl-KFFn8-BVw":{"text":"Do you love to hear drunk staff calling women whores and b*tches? Then you are lucky, caus","useful":7,"cool":1},"Mp94qllpQm9paOlj2gZkEw":{"text":"I wanted to try the famous chargrilled oysters that Louisiana had to offer and some friend","useful":3,"cool":0},"Pv_h2PkMmXsHME1H9kQnIA":{"text":"Come here for the 25 cents raw oysters with a drink purchase.  No maximum.  This deal is A","useful":3,"cool":3},"L1FK0M8Ujq34jM570ArdJw":{"text":"Fantastic... !!!!\nwe go 2x a year to New Orleans and the  Samuel's Blind Pelican is the pl","useful":1,"cool":0},"zPtPWn33ytWmNRCSrzQt6w":{"text":"went there for the oyster special. they serve em slow so you drink more - small and gritty","useful":2,"cool":0},"jhV9fO-dIl6dshC2zXg1iw":{"text":"I wanted to like this place. It has so much potential. Right off the street car line, kill","useful":0,"cool":0},"bFQY1SU_Jbl8QWKYF6VjPQ":{"text":"Pros:\nPrice and oysters- Happy hour oysters are $3 for a dozen and $7 or $8 for a dozen ch","useful":1,"cool":0},"Mve1hpsw2KXbIJLRjndkeA":{"text":"If you LOVE oysters, can eat A LOT of them, don't want to pay much for them, have LOTS of ","useful":3,"cool":0},"ZHWuuUl7nEDDzU2Hz-KHaw":{"text":"One of the best places to go in New Orleans for happy hour oysters, hands down. 25 cent pe","useful":1,"cool":1},"0Lc-PZi0gWcAjqvEPb5RPA":{"text":"At first, I thought it was a conspiracy that all my Uber drivers told me that the Blind Pe","useful":10,"cool":8},"k7VPJ2HR0shdjD7EcfS8yA":{"text":"Update: Mardi Gras 2019, SAME experience but even better!\n\nVery impressed with this establ","useful":1,"cool":0},"Q9r6Qi1RqRfb86WW2Itg_w":{"text":"It's unfortunate I can't give them zero stars. The service was awful. To start off, while ","useful":0,"cool":0},"_fYxWkSK_R-xTSKr-bzF8A":{"text":"How do you make a salad salty??? Completely amazed you guys could mess up a salad. Romaine","useful":0,"cool":0},"GU-HL8lg3U2VGB0IBt4X7g":{"text":"For a place that advertises an oyster special for happy hour,  you'd think they would be p","useful":1,"cool":0},"yPDTytWMRPPYmXA423jB7w":{"text":"Wish there was a DESPISE button!. Even though there's great press touting their oyster hap","useful":3,"cool":0},"k_7BKCOrjfcHzvIxyYy8UQ":{"text":"Went Mardi Gras weekend and they had just opened.  My girlfriend ordered a veggie burger a","useful":2,"cool":0},"rf5M6QQQnXth_xlghadkuw":{"text":"This is an updated review:\n\nI've come about five times since my last review, and it only g","useful":4,"cool":0},"BvNMZEZkEWBvW7iE-HSJGQ":{"text":"Awful service. Very disappointed with the way our server was treating us. Do not recommend","useful":0,"cool":0},"kRzt94cusSGu07ygRx0NRA":{"text":"Crazy good happy hour on oysters. $3 dozen raw and $7.50 chargrilled. So good we got an or","useful":0,"cool":0},"irDVVZICrO38ICzLSpvMtw":{"text":"Absolutely the best deal for oysters in NOLA. We spotted their giant sign advertising 25 c","useful":8,"cool":6},"luClHDUOdd3Bh4wxE7H6mA":{"text":"Good food for a great price (1 doz oysters on a half shell for $3) but the wait for menus,","useful":2,"cool":0},"imdd-J9H_3GRQZd1YwZRPQ":{"text":"Sam's pelican may be blind, but it sure can pick out great oysters and crawfish! The happy","useful":8,"cool":5},"fMZasLBab8siT5aa8GBoDw":{"text":"A POST-COLLEGE DIVE IN THE LGD\nIf you hung out at the \"Boot\" in college and were indoctrin","useful":4,"cool":1},"tDvG2tXL_hmy5I5izbCfhQ":{"text":".25 cent oysters from 4-8 for the win! And they're fresh oysters too served with some salt","useful":1,"cool":2},"i4Klan6i_2TqS07rYrXMbg":{"text":"WTF? Only 3 stars? Ya'll must be on something.\n\nThis place was SLAMMIN'.  Well to be hones","useful":5,"cool":2},"NJ3gxxzY0bRmRDhdMIPxrw":{"text":"You can't come to NOLA and not checking this place out for their awesome Happy Hour oyster","useful":17,"cool":15},"H-TBim4f_ybYdFzkq16oNQ":{"text":"Torn on this one, as are the reviews i read before going. \n\nThe first time here we finishe","useful":2,"cool":0},"_2F1A0xXLj1E4H131899Mg":{"text":"Can't go wrong with Blind Pelican's happy hour oysters. My party of four were on a mission","useful":4,"cool":5},"W82kx8KU8fgR03xUvEY5Gw":{"text":"Was taken here after being told I had to experience it at least once. Happy hour oysters $","useful":0,"cool":0},"Gg7cZcxomEGevRmjjSvv3A":{"text":"There once was a group of four vagabonds from New York who ventured by car to NOLA for spr","useful":2,"cool":2},"JZTAXUM1H2ErfQz0dBYcSQ":{"text":"The guacamole is light and creamy and FRESH.  I've craved it since tasting it.  My friend ","useful":1,"cool":1},"sLLD2YCnAEp-TCXg1W6HQg":{"text":"The haiku review is not original, but it will keep this bad review of their absurdly overp","useful":2,"cool":2},"XdWaZxSwwWSJzjLOUu_ZSA":{"text":"This was my favorite restaurant in NOLA. It was the first bar I found one of my favorite b","useful":5,"cool":2},"8ZizVVrVuv2JJseMh0C-Ew":{"text":"One of our go to relaxing spots, The Blind Pelican can be great depending on what you're t","useful":2,"cool":0},"oOdN7Mcd3M0rLnbznDDaqQ":{"text":"$0.25 oysters for happy hour. Sweet and friendly bartenders, cold fresh beer and a great s","useful":0,"cool":0},"8zG2mwrVMD0h8y5Zf8RWrA":{"text":"It was a hot summer day and I was looking forward to treating my cousin from out-of-town t","useful":6,"cool":1},"CM97cDuvnJytmY-XwDZ6VQ":{"text":"Do NOT waste your time. They seemed like a  place for fresh, inexpensive happy hour oyster","useful":3,"cool":0},"8S-betfR0uj3VmzW2xmBTg":{"text":"This place was recommended as one of the best oyster bars in NOLA by one of the tour navig","useful":0,"cool":0},"rArMeoNkjpfhOBu8RpDbPA":{"text":"Found this place completely by accident. We were on the trolley after visiting the WWII mu","useful":1,"cool":0},"GFW_Yjr9QlVlZ5Z13tAauA":{"text":"Run the other way! The patio is lovely, but the food was a disaster. 90+ minutes after the","useful":0,"cool":0},"2PbvZYYK_48AZDlBTqGvUg":{"text":"Let me start off by saying I went here back in September after a Saints game (on my birthd","useful":1,"cool":0},"HmGC5N2jf3S62rQuUBwPOA":{"text":"Please go anywhere else except for here for happy hour. We went here just for the drinks a","useful":5,"cool":0},"nDn0URGLEzadeAVIwKgrvA":{"text":"I'm writing this review after 2 visits within a week,...so I'm averaging the first visit (","useful":2,"cool":1},"nWtQOYbjiv1InX446nlzVQ":{"text":"The main thing that draws me here is the atmosphere. It has a great location on St Charles","useful":1,"cool":1},"HbBcILBbR1TwV0rQx0ipBg":{"text":"Pizza was super soggy, drinks were overpriced and weak. Oysters were overpriced also to me","useful":1,"cool":0},"SW49ZiXslTXpHSb5pigG-g":{"text":"It's taking Forever to get our food, Seriously? No Oysters/No Shrimp, Bathrooms are Hot An","useful":0,"cool":0},"ltxdKOCY85z7MFGXfV19HQ":{"text":"This place really strikes out. We were a larger group 9 so I understand that can be challe","useful":1,"cool":0},"pcXRw2zUtsrO2f4VAIXhug":{"text":"I have designated this place as my go-to bar and proud to call myself a regular. I began c","useful":3,"cool":2},"F9IZiT-tsXvwLTqxOXJG-A":{"text":"There a reason this is only 3 stars, it's only in business because of its location. Food i","useful":0,"cool":1},"b0XMoIXo3ddSSW_OdP_9Ng":{"text":"Review based just on Happy Hour deals!!\n\nFirst, love how their happy hour goes from 4 PM-8","useful":4,"cool":3},"6tGlvwWLMsuceAeA9QH9jw":{"text":"This was easily the worst experience I have ever had at a restaurant. We waited 40 minutes","useful":2,"cool":0},"sTgL2-qjxe0ulFubgxAa9g":{"text":"*Updated visit 2/16/18* \n- Long wait on a Friday night near 7:30 pm (as expected)\n- No hos","useful":2,"cool":1},"zkR7YUUgzQFKGN91dpdatg":{"text":"We only had drinks and apps here while waiting for some of the nearby places we wanted to ","useful":1,"cool":1},"bQtBG3IqyUDYAujuJeY9Zg":{"text":"BAR REVIEW: \nGREAT! Our bartender used to live in Philly and SF and Maryland where literal","useful":1,"cool":1},"c4th2wdxdNc4hkEZMFliqg":{"text":"This PLACE!!! This has recently climbed into my heart and stole the top spot!\nThe Charbroi","useful":4,"cool":2},"-9wvjvBHkiGl4GUDsar6mg":{"text":"It was Noon on the Monday after Christmas. Stopped in to have lunch before doing a tour of","useful":0,"cool":0},"AbzRVdRyWmGWhRo06hRbrQ":{"text":"I took my family to Blind Pelican so we can enjoy some oysters and watch the Eagles vs. Re","useful":1,"cool":1},"TihctyO4WB-mFl6YA86mrg":{"text":"Summary: Great food, terrible service, confusing menu.\n\nCame here to meet a group of my bo","useful":3,"cool":0},"k_U_1GKyzYDITeTw7thOcg":{"text":"I know this place has gotten some mixed reviews, but I went with a friend for their happy ","useful":4,"cool":1},"xJgsCQa-DYyG4Ag5JOG0Jw":{"text":"We were recommended by a local to go to the Blind Pelican for .25 center oysters during ha","useful":1,"cool":0},"TeWOKAPrqBB3hkPGTo-E3w":{"text":"Not a thing on the menu I could order.\nLacked friendliness. Well worn almost grubby. Staff","useful":2,"cool":0},"rbx-Ms4YQ4tVrk-_bRgXSw":{"text":"This is a pretty good spot for lunch, and an excellent place to get oysters. My sense, how","useful":2,"cool":3}}