{"colSEQyIRcKs_X356uzudw":{"text":"Best BBQ spot in the city....no question!They embody \"New Orleans Style\" BBQ (I think they","useful":1,"cool":1},"3J82S13U7wroLkL9i5eZeg":{"text":"Little difficult to find but worth the visit. Their meats are delicious. Prices are a bit ","useful":0,"cool":0},"t4kNe_QiUTwQb4MHys9Itg":{"text":"Great food! Fast service! Love the take out option or eating at the bar while bands play.","useful":0,"cool":0},"IDhTcHK0VKi8i4o0BxYMtw":{"text":"At this point this is the best bbq in the city. Unlike most bbq places that have one good ","useful":5,"cool":2},"ex_0e3gbzK9qHDTeTpqm-A":{"text":"They have decent music,however during our short meal,they also had some technical glitches","useful":0,"cool":0},"T9MlhNPgZ2UkC4Zz6RUzyA":{"text":"Heading out to try some of the local restaurants.  Our uber driver recommended this place.","useful":0,"cool":0},"Egys0wuMa5HUv24ZflXNcA":{"text":"I had a horrible experience with Postmates about this restaurant which the management fixe","useful":0,"cool":0},"gC3xhb0KAASsMjcW_dGNQw":{"text":"Great food. Had a little of everything. The Brisket and sausage were top hits for the meat","useful":1,"cool":0},"QMKCbG6H4ZpHui5H_V4-Ww":{"text":"Whoa. Okay, I just ate here for lunch today and I couldn't wait- I had to review ASAP.\n\nSo","useful":21,"cool":21},"8T5OpATcj_BIsFgL7P-rcA":{"text":"We ordered a two meat plate and some wings. They were out of ribs at 8:20 on a Saturday ni","useful":0,"cool":0},"YJo0jcaM7IJ0lVRvAj1vLw":{"text":"Really good barbecue, really cool vibe.  Owner is down to earth and friendly.  We had the ","useful":0,"cool":0},"RuiciK3hYZXLgFPwQ44pVA":{"text":"Shari V and I hit up Blue Oak BBQ for an early dinner.  We picked up.  Strangely, they don","useful":6,"cool":1},"_czjmHGcxItUvG00AyLsJw":{"text":"Came here for lunch Saturday.  We ordered the nachos for an appetizer.  Not enough meat on","useful":4,"cool":1},"eYQiRo9YumVwSFbyGkgyPg":{"text":"New Orleans is really not known for BBQ but this place can rival the boys in Memphis. I li","useful":0,"cool":0},"mRuCjxA6xj3sI7K7Wd3fHw":{"text":"Oh. My. God. The brisket was amazing! We were visiting New Orleans for a conference and wa","useful":0,"cool":0},"ZFWs4fkFzTNlHWJYsazbgA":{"text":"I have been to The joint, been to the Shed, and been to a couple of other wanna be BBQ pla","useful":2,"cool":1},"M_Ri6mGSiVqc-Xa1RLS1cw":{"text":"As I was leaving New Orleans the last time I was here, my eyes were widened to see, at lea","useful":3,"cool":1},"kxnFTWmAGB9k355e-mQzXA":{"text":"Thankfully they came by our office with fliers  otherwise I would never know about this ge","useful":3,"cool":1},"Ia7NFXBnpQaF-DnZ_bbGlA":{"text":"First night in New Orleans. Decided to get take out from Blue Oak. The food was just wow. ","useful":1,"cool":0},"7r5ZbEI1RYY0-CKe8x6Z2g":{"text":"I like the proliferation of BBQ joints blooming in New Orleans.  Each one with their own n","useful":1,"cool":1},"IjCpMKLA8jPFQiiSZ7OKIA":{"text":"No cons, all delicious.\nLet's talk about a great little place with a family feel and finge","useful":0,"cool":0},"X67ltiwFao0F12PYhwqmqw":{"text":"I ordered the brisket which was priced at $14.  If you like your meat to be 1/3 fat and sw","useful":2,"cool":0},"qRA-EdJGnqMv4c_3cumeIA":{"text":"BUYER BEWARE!!!!! \nIf you order on Postmates or UberEats STAY AWAY. In fact all consumers ","useful":6,"cool":0},"MCjCUIJtbQvPNcKCeTC3eA":{"text":"AMAZING! Definitely order the brisket and Brussels sprouts. The brisket MELTS in your mout","useful":0,"cool":0},"EkhQ1AyltLs7ZptT4pq43w":{"text":"I'm from Texas so was this place the best BBQ I've ever had? No, BUT it's by far the best ","useful":0,"cool":0},"BZCf4Sq7-JYSjHa7cB8IoQ":{"text":"Finally real BBQ in Nola!  Nice to see someone take pride in their juicy meat. Best wings ","useful":0,"cool":0},"dKdDloBhchNOA7HRyS5Tdw":{"text":"The family and I stopped by on a Sunday at about 11:30.\nThe line was short and we managed ","useful":0,"cool":0},"H4W4S7rbGcoMLP9a1DwlwQ":{"text":"Extremely good BBQ!  Brisket is perfect.  Great bark, fat rendered, great smoke.  Sausage ","useful":1,"cool":0},"sTdEYthQRIOLFdo3LTu5fw":{"text":"I don't 5 star many places but this one was absolutely worth it! We were in New Orleans ce","useful":1,"cool":0},"A4HCq2xZSTSTWZxH6P-zLw":{"text":"Really enjoyed the brisket, the mac and cheese, and the cheese grits. The sauces were also","useful":0,"cool":0},"NhnoT7svMgOantecGDASTA":{"text":"Decided to give this place a try. Food is good; particularly at  Happy Hour prices. We had","useful":0,"cool":0},"5BDGRN6KDh__4WLWLKN76w":{"text":"We almost always do take-out. One thing we do not like is that you cannot call your orders","useful":1,"cool":1},"JXsNjaK6MiHymBW8slp7BA":{"text":"This place is incredible! I've tried a few different kinds of their meats and they have al","useful":0,"cool":0},"-fJouVhPF6aWQzDLgEkspQ":{"text":"Not sure how and why the reviews are so high. Brisket was dry and quite bland. Sandwich wa","useful":0,"cool":0},"5zfttFVHSqCZkJjJ0KwSkA":{"text":"Great neighborhood BBQ... the food was very good and prices were decent. The outside famil","useful":0,"cool":0},"H9C1xJ3XY90w-6j8xhO4sA":{"text":"Inside Chickie Wah Wah, BBQ is the perfect touch.  The garlic mac n cheese is to die for a","useful":1,"cool":1},"68SV9pO-6J2ZHMiR04Wr1Q":{"text":"Second time ive trued blue oak. Disappointed again\nI asked the woman when ordering if her ","useful":1,"cool":0},"Nd6XLRnnS3o8UnwbbPBSYg":{"text":"Best BBQ in New Orleans hands down! They had tender and juicy brisket, fall off the bone r","useful":1,"cool":1},"UTUiXekwYkRbwvrM5VkRfA":{"text":"I don't know why BBQ tends to be priced lower than food at other restaurant.  What they ca","useful":0,"cool":0},"vVNJREjm5pNBB5j0hgxyLw":{"text":"Brussel Sprouts and the Jerk Wings are incredible! Hands down best BBQ in New Orleans. Don","useful":0,"cool":0},"BbuphGV-MOY6WFeJl8dQug":{"text":"Extremely delicious food l, love that you can get your bbq and sit down at the bar and get","useful":0,"cool":0},"TQhHu6WL9EdPvkrK-oIK3g":{"text":"Food is very good , wish the portions were larger though. House BBQ sauce goes nice with t","useful":0,"cool":0},"eIUHuk0MhLFkRKP87DiAnQ":{"text":"Revised for visit today down 2 stars. Really, really good barbq. I can't tell you what my ","useful":0,"cool":0},"3LS4q8hD1rWeQt71rglv_A":{"text":"Great food. Warm friendly service. But wear a coat or a parka if inside as they crank up t","useful":0,"cool":0},"YIfHA3EBDo7ZPf4TIM4sYg":{"text":"I've been looking forward to eating here for a while since I moved from baton rouge and ha","useful":2,"cool":1},"MEzXwcD2eegcMPU0bg8pEw":{"text":"Texan here. In case you were wondering...this place knows how to bbq. Get the 2 meat plate","useful":0,"cool":0},"bxsxaGsRSqa-bHsK50PriQ":{"text":"I love the BBQ scene in New Orleans especially how each place puts heifer own Cajun soon o","useful":2,"cool":1},"3obTd-c4UhKafiIBdeDD5g":{"text":"Far and away the top BBQ in New Orleans. I'd say the Brisket shines the most, but holy cra","useful":0,"cool":0},"jVxvKtICypdwi0Ei41G_dA":{"text":"This is a nice addition to the Carrollton Ave/Streetcar line. I'm not a fan of bbq but the","useful":3,"cool":1},"w2gfM2n46bZxiO5T8YLB6A":{"text":"Amazing Brussels!!!! The best I've had. The brisket is tender and juicy. But those Brussel","useful":0,"cool":0},"B4bR0yCvj1MbQLI7KkP4LQ":{"text":"Fantastic experience. Friendly service, incredible food. Good drink selection. Lots of sea","useful":1,"cool":1},"GiDN9P1CweN2NKdVCPNVVA":{"text":"Great smoked flavor. Pulled pork nachos are super delicious and  so big it could be a meal","useful":0,"cool":0},"clPsFYQIJZcGuSXHDWrpnA":{"text":"The music selection is great and the staff is so cute. The sides are plentiful and the pul","useful":0,"cool":0},"zneeK__91e2eWZdeTAWWQA":{"text":"Great food. Fast and friendly service at a reasonable price. I would recommend to anyone.","useful":0,"cool":0},"SuvxxGeFsVm87nUVZMvq-Q":{"text":"I'll make this short n sweet. Great food. Very fast service. Cozy atmosphere and tastefull","useful":1,"cool":1},"0FpYakOcjpbxzV7nSWIM4Q":{"text":"Let me start by saying I'm fat BBQ loving trucker and this place probably has the best I h","useful":2,"cool":0},"YgOY4sl2RaGOWhijXfaCIg":{"text":"I'm so proud of my boys at Blue Oak BBQ! They're all grown up with their own New spiffy pl","useful":0,"cool":0},"b6heeT_s4vsHSzSKOyRS_w":{"text":"I'll do the conclusion first: \nIf your in New Orleans, and want the best BBQ, this is the ","useful":2,"cool":2},"tggXUbjQFuWiko1ktiYWQA":{"text":"We came here while we were visiting New Orleans because of all of the great reviews it had","useful":0,"cool":0},"awMaN9QiFcHGHoT-TNlNeA":{"text":"Yummy! Even my I-don't-do-BBQ husband loves Blue Oak. The ribs and brisket are delicious, ","useful":0,"cool":0},"YCN5yNk9g_de_mDA1XUXjA":{"text":"GF  and I drove in from Baton Rouge to go to Celebration in the Oaks and wanted to eat som","useful":0,"cool":1},"3Ug9QXvrZPpTSh5wgBCkuQ":{"text":"Briiiiiiisket. Chop it slice it, flip it up rub it down oh noooo! So good. Brussels are al","useful":1,"cool":0},"sgPe5zTSvjsbUr4FI3HYrw":{"text":"Blue Oak never disappoints. The nachos are awesome and the wood smoke flavor of the BBQ is","useful":2,"cool":2},"dxxpybLGNMdAC33Y8dv3eg":{"text":"The best BBQ in New Orleans! Consistently delicious and the restaurant has a great vibe an","useful":0,"cool":0},"l--2I1w34lx78UaYzMTbkg":{"text":"Came here after sitting at the Toups Meatery. What can I say except WOW! I am not a barbec","useful":0,"cool":0},"Te6ExIZGPGhsDfqZVPrplA":{"text":"Awesome food. Just come here early so you can enjoy the ribs they run out. The garlic Mac ","useful":0,"cool":0},"qRNbN5NluleMXkmOkXvvaQ":{"text":"Everything was phenomenal! Pescetarians, the shrimp tacos are some of the best I have had.","useful":0,"cool":0},"vIzIdFGe9l_UYYr2x38H9A":{"text":"Well... first of all, the food was expensive. I went out today with 7 dollars expecting to","useful":1,"cool":0},"tHwyDagv3O2zw3HHaJhZpg":{"text":"Waste of money and waste of time.  Food was dry and flavorless and the service was snobby ","useful":2,"cool":1},"dokkuAZFJLkrzW50Q7HgZQ":{"text":"Finally! Thank you BBQ gods! Real thanks to the owners who put obvious love and time behin","useful":0,"cool":0},"vVaizwC4YgMdq_zJ9Z9KVg":{"text":"Their smoked burgers are boss.  Their beans, are also boss - best BBQ beans in New Orleans","useful":0,"cool":0},"Z2R9iXJd3XYvFoK8Bva8mw":{"text":"Visiting NOLA, Blue Oak was recommended by locals. We went this evening and were pleasantl","useful":0,"cool":0},"ZPFoiAGkTJj4rGvMFcLgJQ":{"text":"Great BBQ! I've enjoyed the brisket, pulled pork, wings, and ribs. Be careful having the n","useful":1,"cool":0},"83HaW8oL8Y5oTCWGdphRBA":{"text":"If I had one quibble here, it would be that I found the pulled BBQ pork ever-so-slightly t","useful":0,"cool":0},"UXDaXmKeYXeYMdtzgSR3rg":{"text":"Amazing BBQ! We weren't expecting much when we decided to stop in as we passed by but this","useful":0,"cool":0},"SKTDNsxT1BEL4KVuYDLYGg":{"text":"I'm from the best BBQ state in the union ; ), but Blue Oak definitely gives NC a run for i","useful":2,"cool":2},"6y4LdQwlWFrq_AJtumILTg":{"text":"This was my first visit to blue oak and it was absolutely delicious! I will definitely rev","useful":0,"cool":0},"om5SbIWozVYSh-PEqPHvKw":{"text":"This is the best, best, BEST place in the city to get wings! The wings were seasoned to pe","useful":0,"cool":0},"rrgV5wgDOlqCmiI3bSwZuw":{"text":"We came with a group and got fast and super friendly service.  The food was all amazing.  ","useful":0,"cool":0},"6SEovZ1K0dH4rokOeDhemQ":{"text":"This may sound funny but I'm more of a side item kind of guy when it comes to barbecue pla","useful":0,"cool":0},"ReMDaOHAnZuTkMpinX4F0A":{"text":"The food is incredible and always fresh. It's best to come before or after the 12 o'clock ","useful":0,"cool":0},"lMHoVuUa3XKDXzC2jhCTZg":{"text":"I went there over the weekend with a group of people. I ordered the nachos since I heard t","useful":0,"cool":0},"1eIyQiNPP9pTJApde_OV2A":{"text":"Really awesome brisket tacos that were on special! Everything else that we saw looked real","useful":0,"cool":0},"ALSeh5hsnW_MUayPDxY-Ng":{"text":"Thoroughly good BBQ. Never disappoints. Love the wings, all flavors are delicious, and the","useful":0,"cool":0},"6jOeWRDvLIGrxG1Oq0lfhQ":{"text":"My fiancée and I were in New Orleans this past weekend for the Red Dress Run and had drive","useful":0,"cool":0},"UM_enCG1QfqJSuhWU3Qiyg":{"text":"Brussels sprouts....to die for!  Mac n cheese, to die for!  A gem in the city. Loved it!!!","useful":0,"cool":0},"0aPPl5Geq2sx8xBso3bqSA":{"text":"I eat here once a week the food is incredible. The chicken I'd to die for and the brussell","useful":1,"cool":1},"d9kMM0yu0Ajd2dVPweOaMg":{"text":"Hubby and I are back . Food is always great . However the Service is a hit or miss . At th","useful":0,"cool":0},"K93O92dSsCMQ2W04vfiEeg":{"text":"My boyfriend and I had a great experience here during our recent trip to New Orleans (last","useful":0,"cool":0},"El8KNhZmnuRn1kzMcO9cPA":{"text":"Best chopped beef BBQ sandwich in NOLA! Served on a charred bun with the grease from the b","useful":1,"cool":1},"nzDGXujvfsFFD5vw07j72A":{"text":"6/5.\n\nWithout a doubt the best BBQ in NOLA and one of the best meat-centric eats I've had.","useful":0,"cool":0},"LWRZ6_1E8zi4liu6YhLwfA":{"text":"Honestly the best bbq I've ever had in my mouth. Went after a beautiful day at city park w","useful":0,"cool":0},"pKsx4am0WpZh0PJn5jo9NA":{"text":"Finally ended up at Blue Oak BBQ after trying many of the other BBQ joints around time. Wh","useful":2,"cool":2},"iDSPCVNoByu3sjVMy6gjhQ":{"text":"I love  BBQ but can honestly say, this place didn't overly impress me.  We ordered sausage","useful":0,"cool":0},"VUUmZTxqHyoUj-7t8RPstw":{"text":"Best BBQ I've had in the New Orleans area and best brisket I've ever had in the world. Pro","useful":0,"cool":0},"El6kym6YP5mHQFN5ul6l2w":{"text":"Wanted to try this place since its close than The Joint. I'm a brisket fan so the portion ","useful":0,"cool":0},"zqB7pIjN8wBgJpl5p14IAQ":{"text":"So freakin' good!  Been twice in four days....OMG, this could become a problem!  I HIGHLY ","useful":1,"cool":1},"QE5BZGUiyUgNGVtbVEoeBA":{"text":"Their chopped Brisket is the best I've ever had. So glad that we spotted Blue Oak while dr","useful":1,"cool":0},"CMetAcx6cMa75JkM4Pj9og":{"text":"Blue Oak makes The Joint run for their money in my opinion. Not only is the BBQ brisket, p","useful":5,"cool":3},"El5cH6fJXNx9Pv7gpqvJsg":{"text":"Standard BBQ. Found it to be real salty. Drank a gallon of water after eating there since ","useful":0,"cool":0},"fM8Aa1Twyed9gXaL4yxslQ":{"text":"If you are looking for an amazing BBQ joint, you have to visit Chiki Wah Wah and eat at Bl","useful":1,"cool":1},"PpaikdezEMSmyfgcj5uShQ":{"text":"Best food we had in New Orleans. Really happy to happen upon this place when we were headi","useful":0,"cool":0},"40eIe73jWbLB5x0_yI3Rxg":{"text":"My friend recommended this place and I'm so thankful he did because we had an incredible e","useful":0,"cool":0},"EzebsVOa5xVcI1eut82dUQ":{"text":"I used Blue Oak to cater my wedding rehearsal dinner event and the food was outstanding. W","useful":0,"cool":0},"iM_QZvzMh1-GTCWBTM8f6A":{"text":"I was never a fan of brussels sprouts until I tasted the ones at Blue Oak. OMG! I could ea","useful":0,"cool":0},"H7yok3Qhx7W8z9pAMwKk1w":{"text":"Mmk, I've finally found my go-to NOLA barbeque.\n\nThese guys are from Tennessee and somehow","useful":0,"cool":1},"e9yTW6qdDGOhdPEooFtYlw":{"text":"Loved this place. Cute and clean place and food was amazing. Order at the counter and they","useful":0,"cool":0},"G0Ju08IWv_e6lxQg--CiMg":{"text":"Holy moly! Y'all, if you're in Nola and you're in the mood for some amazing BBQ, this is t","useful":0,"cool":0},"3vg8XAalzqp5WeKyQXoeaA":{"text":"I went with a friend to Blue Oak for the first time this past Saturday.   We really loved ","useful":0,"cool":0},"sRX6xwTQWjfEHQ4Z-owYpQ":{"text":"Let's start with the good. Love the decor and location, great outside seating and deliciou","useful":0,"cool":0},"uNWPxKmCPLPfItl4uUlLlQ":{"text":"I have come here at least 5 times. The place and the staff are very friendly and professio","useful":0,"cool":0},"LdhGFDilPDwQS1g13cm5oQ":{"text":"Ribs fall the bones and and brisket tender.. Mac and cheese was delicious and have a nice ","useful":1,"cool":1},"HZL5tk6otmQro69Uoe06CA":{"text":"The pulled pork is phenomenal and my wife loves the brisket. Meat is delicious and tender,","useful":1,"cool":0},"WNUKHTyyuEx08diDiUedMA":{"text":"I had the 2 meat combo. PRETTY GOOD!!!  I MUST SAY THE SIDES ARE OK.  BUT  MY DRINK WAS RE","useful":2,"cool":1},"9vdpQ8Kr80i8F2ypXft0Rw":{"text":"I hated everything about this place.  The ribs were ok but the flavoring included a strang","useful":0,"cool":0},"MOK21fYUAPHqjFCnub9bAQ":{"text":"Hands down, best bbq in New Orleans. The Brussels sprouts are so delicious, I could stop i","useful":0,"cool":0},"xjVQWAaUgH_AhgTRwm2tgg":{"text":"This place! Location is clean and service is quick. The food. Seriously- the meat is so te","useful":0,"cool":0},"bYYPfPTyTg0t0XWNVzzj8g":{"text":"We came here because our host recommended it to us.  As soon as you walk up, you can tell ","useful":0,"cool":0},"mwjinSeLHKv-WvzDUGIf0w":{"text":"We had lunch here this past weekend.  The brisket was A-MA-ZING!  As was the pulled pork. ","useful":0,"cool":0},"r0VbPvwwyPwfzJMRyN4UIQ":{"text":"I am revising my orginal review.  I went today 6-23-2016. My 3 meat plate was very good an","useful":2,"cool":1},"OwDM4ve1i-M0_eeHE3-W0g":{"text":"Brisket and Chicken were great! They only have ONE person taking orders which I thought wa","useful":0,"cool":0},"5znSnbZ1J8M43wNwWgJmyA":{"text":"Enjoyed the three meat plate with ribs, pulled pork & brisket with two sides of mac & chee","useful":0,"cool":0},"Q56l7UK3iTbqaYUs_yPEdQ":{"text":"First there was the hamburger invasion, then the pizza invasion, and now barbecue is all o","useful":19,"cool":14},"4uugi71EsYeUaUYaW_S9Ig":{"text":"I have lived in Texas and eaten barbecue from here and there and everywhere this place wil","useful":0,"cool":0},"9ixJxu2XHSS_b_VHhF_YFQ":{"text":"This was the most amazing barbecue place around this time last year. I had the brisket and","useful":1,"cool":0},"Hu0WSqNp29uMIvUQ4EzY3A":{"text":"Last week, I entered Blue Oak BBQ with a group of friends. I was instantly struck by the e","useful":0,"cool":0},"DYyVX9Ja6JqRuLOzgBplOA":{"text":"This place is nothin short of amazing. The staff is very nice and friendly and most of all","useful":0,"cool":0},"mN5WP8hQ8OONjarjNPkB2w":{"text":"Incredible pulled pork sandwich. Service was friendly and the place has a cool vibe. Certa","useful":0,"cool":0},"w-JnWU3emFUYOGo9hlMtxw":{"text":"Great bbq, amazing sauces! Visiting from Florida and this was our first stop. Fun atmosphe","useful":0,"cool":0},"F5q_BFqnKNzdwlIJO4yIzg":{"text":"Some of the best BBQ that I have ever had! The ribs are SO freaking good. Went here around","useful":0,"cool":0},"EOjokRIJw9833Upvpu_9NQ":{"text":"6 months ago blue oak was 5 stars by far the best BBQ I had taste..  but lately the food i","useful":1,"cool":0},"RlDZkVfeVTuG9PgIWlDx5Q":{"text":"Heard good things about this place from a few of my close friends/class mates decided to g","useful":1,"cool":1},"N3ldMXQZXyoqorXek2Gvjg":{"text":"This is the best bbq I have had in town.  It's on par with the joint but closer than the b","useful":0,"cool":0},"V54FxZ2UgeegHaJ58SfZXg":{"text":"This was by far the best BBQ I've had in New Orleans!! The Brussel sprouts were the best I","useful":0,"cool":0},"3LYDjRmlcb7FQYJZvAp0XA":{"text":"Totally changed my perspective on barbecue. Tastes just as good coming up as it did going ","useful":0,"cool":0},"qRFs7cxsNt68-cW0bG8GXw":{"text":"To quote Yelp- \"Woohoo! As good as it gets!\" I still go to this place often and have never","useful":0,"cool":0},"dlZUMPkQVjLmLeOLEWzWlA":{"text":"I've dined here twice about 8 months apart.  Just like the review says, meh - I've had bet","useful":1,"cool":0},"o2euFhXIy9Ha94g-dW82xg":{"text":"I've been back twice and tried another new bbq joint down the street. These guys are doing","useful":0,"cool":0},"eedoRBte374Ad8j9SNIS5Q":{"text":"You've got to try this place! I loved the pull pork sand which! They don't have a large se","useful":0,"cool":0},"zshgIJTr7RQHIJhMrSjNcQ":{"text":"This is about the 5th restaurant incarnation in the tiny little front kitchen at Chickie W","useful":2,"cool":3},"6wPy0FD7IOTSvJ8zHMT3ag":{"text":"We went Sunday afternoon. We ordered the nachos with the brisket, a specialty sandwich, la","useful":3,"cool":0},"HmsYCIsTgM1FUIeuQiwp4Q":{"text":"Just left the place, l never trash a place and I really had high hopes. Brisket very fatty","useful":0,"cool":0},"5AIWOmc_qIrFTIoeKjDaNw":{"text":"Tastiest ribs, wings, and brisket \nMouth watering Brussel sprouts \nOMAIGA, the jerk and ho","useful":0,"cool":0},"AvXwOQtlwOt0KWqoXtMI3g":{"text":"If you want real southern BBQ and experience the taste and smells, you need to come to the","useful":0,"cool":0},"-zYa1KZuSGL7yxX0vI5APQ":{"text":"Loved the place in Chickie Wah, so went to this one.  Sat outside where there was one tabl","useful":0,"cool":0},"5bRfSIbe5hOu41YDIxRGFw":{"text":"I wanted to give a higher rating than three stars given how happy I am for another solid B","useful":0,"cool":0},"mTJHpRME7-Hvo0HHknaTCQ":{"text":"There's no balance, no subtlety, no thought to how a combination of choices on a plate wil","useful":6,"cool":4},"LnHXUo73van1P544jBNXmg":{"text":"Awsome Awsome Awsome. That is the only three words I can think of to explain this place. W","useful":0,"cool":0},"fXGhcIS4s3r3JmSP6HzR4A":{"text":"Hands down, these guys make THE best BBQ I've ever tasted... Look, I'm sure many Southerne","useful":0,"cool":0},"G9ApyB8MLXJwOoVlVG-98A":{"text":"When hurricane nate was threatening to hit NOLA, we were worried that our outdoor bbq wedd","useful":0,"cool":0},"3MQxhYq4T7QCpbpU9X-mtw":{"text":"Great, classic mid town venue  - the fantastic Jon Cleary on Tuedays - with fantastic barb","useful":1,"cool":1},"R-1h-Vph65lXMX0T1caFcQ":{"text":"We were looking for a BBQ place in Nola and we found great reviews for blue oak, fortunate","useful":1,"cool":0},"K46HPQtoqukLRPf6dyT_jQ":{"text":"Without a doubt one of the very best barbecue spots in the city. The amount of food you ar","useful":0,"cool":0},"uKQNfCEfhYUgbbTx6hZ90Q":{"text":"Had it for the first time, got it to go. I had the 'plate' rather than the sandwich. \nPork","useful":0,"cool":0},"8wMQG7eKx5glhIr9daZo2w":{"text":"I was excited to try Blue Oak and was not disappointed. The meats were delicious as well a","useful":2,"cool":0},"py5mB3wtl8HlJIp8gzKvNA":{"text":"First visit... Had croissant special... Reminds me why I don't try new things that I am no","useful":0,"cool":0},"zrQNsae_xqMHurJdqicGAg":{"text":"4.2*     Had the brisket, ridiculously tender and so much flavor. My friend had the ribs w","useful":0,"cool":0},"kF7h91PFGIxA54RGzKbYlw":{"text":"DELICIOUS. These guys were super accommodating for us on our last minute request.  We used","useful":0,"cool":0},"7ozQxIUdL4gSWcbH3pPbzg":{"text":"Delicious brisket sandwich and brussels sprouts with excellent service. I tried some of th","useful":0,"cool":0},"S0R0WtFQWSA-RWlIp2D_zQ":{"text":"Very good BBQ. But not a sit down place. We took it to go and they did a really good job g","useful":0,"cool":0},"ccAf8KDpUoh2NONb-8Xv5g":{"text":"Very impressive place. Was skeptical at first because we couldn't pre-order a take out, bu","useful":0,"cool":0},"5q8MeBrsVOgPod7Vmm4EOQ":{"text":"I don't honestly like BBQ--never really had a taste for it, but my boo does and it was his","useful":0,"cool":0},"0wB9FpiPoxCrKutmK-5iqg":{"text":"Y'all - I DON'T EVEN LIKE BBQ. But for some reason I love this place.\n\nIs it because of th","useful":3,"cool":0},"1Fp6Z_1TwodrV5SUK5PioQ":{"text":"I have been several times and have yet to try anything on the menu that is not outstanding","useful":1,"cool":2},"0jafV-SfktjRymkHHgSTtA":{"text":"Best BBQ ive had in a long time! I got the brisket and sausage plate with the brussel spro","useful":1,"cool":0},"DvwgjpCV1dx2vEQrgrZ2Zw":{"text":"Great happy hour. Get the rooster sauce on the wings. Definitely gonna get them to cater f","useful":1,"cool":1},"dbTHLerRbGxlG95PrLSXQQ":{"text":"This place is the ONE and ONLY place to eat BBQ in New Orleans. Don't bother going anywher","useful":0,"cool":0},"vj1jRytgXt3xBurWkHWekw":{"text":"This was the worst BBQ I have ever had(I got the brisket). It completely lacked any flavor","useful":0,"cool":0},"60XvCIam94Dts3xLjLdoWA":{"text":"Love love love the atmosphere here! Love the nice outdoor seatings! Food is decent price! ","useful":0,"cool":0},"JmazHJFjiuOYD-xocetTYA":{"text":"Ok so on a last minute whim we went and ordered BBQ nachos and a brisket-ribs-chicken comb","useful":0,"cool":0},"qFmQQ2Z8m9AYzfpZI2cygw":{"text":"I'm stuck using a terrible touchpad at the moment so this will have to be short and simple","useful":10,"cool":3},"cMQOfLM8KkDuYwPWH127KA":{"text":"YUMMMM. The meat literally melts in your mouth. I got the brisket and was blown away by th","useful":0,"cool":0},"beKaepifXZtGi_GUJzRcYQ":{"text":"This was my 3rd visit to this place. They have happy hour from 3 to 6 during the week. 1/2","useful":1,"cool":0},"HqBTDw8_Im8EvG4a32Ik-w":{"text":"Really enjoyed the food. Had the 3 meat platter. Ribs, brisket and pulled pork. Great smok","useful":0,"cool":0},"ddk78sgVQawzcf0AU1UuAQ":{"text":"Every single thing my friend and I ordered was excellent, fairly simple but delicious. Som","useful":0,"cool":0},"ugFYhZ9GdujIGAPUnHb1ag":{"text":"Most BBQ places do only one style of meat we'll the others are so-so. Blue Oak did great w","useful":1,"cool":1},"viQDg86DCAql1abYNB301Q":{"text":"Awesome... Awesome... Awesome\n2meat combo beef and ribs... Some of the best I've ever had!","useful":2,"cool":0},"GUX2JGGJKf2N1GZAY9wh-A":{"text":"Best mac and cheese ive ever had. Brisket sammy was life changing. Not usually a slaw fan ","useful":0,"cool":0},"zh0qlSCEehkiQszoCuiUYg":{"text":"So I have to preface my review by saying my husband nor I eat beef or pork so it's possibl","useful":1,"cool":0},"0X4cBJ34pHWgPkP2WR8nWA":{"text":"Only had the rooster wings and the coleslaw. LEGIT, BEST WINGS I'VE EVER EATEN. I would li","useful":0,"cool":0},"kM5WKHdNom_onHvUKaJb4w":{"text":"Some of the best BBQ I've ever had. The pulled pork is so tender and mouthwatering. And th","useful":0,"cool":0},"ZHhRE0GNZLnw6-qaDXCzqw":{"text":"I haven't had a lot of BBQ in New Orleans. It's something I kind of ignore, as I have a lo","useful":2,"cool":0},"R6cQGRuzH2F6Up8y9cqVxw":{"text":"Excellent pulled pork, beef brisket and baked beans. I came at 4pm and found parking right","useful":0,"cool":0},"5dqj3bTCDz0Fputd1wZVIw":{"text":"Great brisket, margaritas and service! A definite place to visit if you are in New Orleans","useful":1,"cool":1},"wO5WRztFhAhXA77yfzrYZA":{"text":"This was my second go round at Blue Oak. I had to make sure it wasn't a one hit wonder and","useful":2,"cool":1},"Ih6NuZZWl7T3sG_wIsQpXw":{"text":"BLUF:  I cant wait to go back and see a smoke free show and eat awesome bbq in a smoke fre","useful":0,"cool":0},"QpXelf5sW-AcD570h5EMMw":{"text":"The smoked Wings are the best in the city. Wish they had a better beer selection but they ","useful":0,"cool":0},"PzxNb-zcQZqaiJzpubJ6Sw":{"text":"Great for casual bbq lunch and dinner! Price was very reasonable for the amount and qualit","useful":0,"cool":0},"Uy8HjtZ2zFbHt9SYm9yiog":{"text":"Went to their booth at the Crescent City Blues n BBQ Fest and OMG the BEST!\nEveryone went ","useful":6,"cool":4},"7NpNHwFhfVtERhazYCQz_w":{"text":"Wow. Great hole in the wall BBQ. Nachos are delicious, and the Brussel sprouts are out of ","useful":1,"cool":1},"vxZnG75X0ZbOn6-HuHNndQ":{"text":"This place is phenomenal.. The meat is so tender and just rich with flavor. Mac n cheese i","useful":0,"cool":0},"IDCqdrloOGR0N-8ieo1mVQ":{"text":"Funny thing I just drove 40 minutes to blue oak bbq from the westbank of New Orleans to ge","useful":0,"cool":0},"5ZpAgKXDgZFN4LjHo8EdMA":{"text":"I had the 3 meat combo with sausage, ribs and brisket. Everything was very good but the br","useful":0,"cool":0},"6uy_hrnf8IUSqj8Ee_-uDA":{"text":"Very good bbq. Truly smoked meat. Beans and Mac and cheese were good also. The brisket was","useful":0,"cool":0},"16eVC4XELM9xemvD_Utwkg":{"text":"This place is super rad. Counter ordering is easy, plus you can sit at the bar and order a","useful":0,"cool":0},"xM5ig-00nsUDSrLGDTtc6Q":{"text":"Wow, this place was great! The happy hour nachos were awesome and they serve Barq's Red Cr","useful":0,"cool":0},"I4fUCkB_sPPw5PIwLAPUwg":{"text":"The pit viper was cooked to perfection, so tender and juicy, piled thick and high on a nic","useful":0,"cool":0},"7DcUFygv01dMxY-tAbsmPA":{"text":"You know that feeling you get when you dance you are so happy?  Well talk about the food w","useful":7,"cool":7},"ghSGjDEQaXwCxKf6ju0DeQ":{"text":"This is literally the best BBQ my friends and I have ever had. It was fast, delicious, aut","useful":0,"cool":0},"JqE0Ed6ZcFTeEheIfItYkw":{"text":"My husband and I tried Blue Oak BBQ on a whim today based on Yelp reviews, and it is by fa","useful":0,"cool":0},"qyMXivYufEo7m1y7LU3E4A":{"text":"Delicious BBQ food! I got the pulled pork sandwich and my boyfriend got the chicken wings.","useful":1,"cool":1},"ijhJe9F7Ic6cJUM0qUA8Ew":{"text":"I had the best brisket here!  I'm a BBQ snob and this place met all of my high expectation","useful":0,"cool":0},"Q-K2nLaqQS_IbjGvB2ra4A":{"text":"What can I say about this awesome little spot? Well, they sure know how to do BBQ! I have ","useful":1,"cool":0},"y7ss_wqG6Vd1DbgWHg7Szg":{"text":"Between three of us we tried a little of everything. The brussel sprouts seemed under cook","useful":0,"cool":0},"3U1q66ZbtxLcPG20mNsSmQ":{"text":"It so nice to have good BBQ this close to my house. The spare ribs are perfect. Literally ","useful":0,"cool":0},"xw78BZL-ozul827u51Y-FA":{"text":"It's been a couple of months since I had the luck of finding this place and getting the la","useful":0,"cool":0},"9hn9PAxB8M_Hn_yk0RkmyA":{"text":"Really tasty BBQ, although we didn't get a chance to try the brisket as it had run out. Ho","useful":2,"cool":1},"99DVUvtzlBZihsCOw9yUYw":{"text":"Okay, so Blue Oak must've had an off day when I first went and I apologize for leaving suc","useful":7,"cool":2},"8JTe7K5bGRse5k50memUNA":{"text":"Great ordering/no waitstaff system. The BEST thing about this bbq is that they ask if you ","useful":0,"cool":0},"ZQu7pRfJ49XpoDtcJz2FxA":{"text":"The food was delicious. It was tender, fresh, hot and well seasoned.  All made in a timely","useful":0,"cool":0},"_3FtJC-S_y5CN3Dj0xFW-Q":{"text":"Ate here tonight with my husband. Awesome menu! I had the pulled chicken sandwich with Mac","useful":0,"cool":0},"CQ4_5KTtWlZYG6iSJwF-VQ":{"text":"Best BBQ ever!  Definitely recommend! We had the smoked brisket, pulled pork, and ribs. Al","useful":0,"cool":0},"yKvDFPfsrn_NivEUMrhiSg":{"text":"Went here on Mother's Day with my son. Found this place through my pal Yelp.  I've been cr","useful":0,"cool":0},"gU0DdowfW_HaHIec7H0neg":{"text":"Amazing! If you are looking for a casual venue with great BBQ- this is the place. Great sp","useful":0,"cool":0},"Z2oczqz1EdagzPlyaCi4Gw":{"text":"Maybe the best BBQ I've had in the city.  My boyfriend loves the Doobin Lubin and we alway","useful":0,"cool":0},"7z26leifcXfCIfLKuRntBQ":{"text":"Gonna go ahead and give these guys 5 stars for food. Their BBQ is my favorite in the state","useful":0,"cool":0},"RIHpVlltM6zlqwnGLWmKYw":{"text":"I didn't come to New Orleans expecting to eat BBQ....But here I am...This was some of the ","useful":0,"cool":0},"FvC4PtcPnioiZy-Ur0a8Gg":{"text":"My favorite barbecue spot in the city without a doubt. Don't let the long line discourage ","useful":0,"cool":0},"lu8uHu5MD4sTK3_U3LwXmg":{"text":"The food here is great.  I have eaten here twice had excellent food and service both times","useful":0,"cool":0},"yGDUbZVZLyKEoBnJK8FFIQ":{"text":"Really yummy burger. I ordered the DOOBIN' LOOBIN just because it contains pork, sausage, ","useful":0,"cool":0},"_z1ekLmvdWy-UYdzmYCstw":{"text":"Blue Oak is a nice place with authentic bbq!\n\nThanks for a great meal in New Orleans!","useful":1,"cool":1},"lZJqKIAliRGTqBSzhJAn3A":{"text":"Wonders are worked in this tiny kitchen. Ribs, wings, pulled pork, sprouts and greens were","useful":1,"cool":1},"lN0d5b89efRwx27abgt_yw":{"text":"Great potato salad and beans. Meat is pretty good just not amazing. Pulled pork was bland.","useful":0,"cool":0},"bBiiURhIyUhAyksVmcVHgg":{"text":"The line was long and slow at the Blue Oak window. By the time I got to the order window t","useful":0,"cool":0},"CLZZwuLycucaqyjQLs5roQ":{"text":"I've tried a few of the bbq places the city has to offer and blue oak is still hands down ","useful":0,"cool":0},"OD-_O_izesW4VmSqXph60w":{"text":"The ribs and brisket were fantastic! The mac and cheese had a bit too much garlic for me b","useful":0,"cool":0},"v-zllwYG8cIsEMmQntYYbQ":{"text":"I went here due to the many good comments.  I saw online big plates but when I got mine it","useful":1,"cool":1},"r_PpGFLG5xtbOGHEfrwERA":{"text":"Usually not a BBQ fan but my group of friends wanted to have lunch here. The line was out ","useful":0,"cool":0},"jkFCB9fUo1NweDYIuNnZQg":{"text":"Apparently this place is a hangout for the locals and I can see why.  We arrived on a earl","useful":0,"cool":0},"scs0WRTDUYuThqszJ6-iOw":{"text":"Brisket was fabulous.  Which is what I'm all about so I was happy.  Sausage also insanely ","useful":0,"cool":0},"YsnUT7fNf_Y8O5SIKWBLiQ":{"text":"Still waiting. Tried again tonight. Got there at 8:10,  as we were standing in line as we ","useful":0,"cool":0},"iDJ0D3fu7K6cSaV71VjvCA":{"text":"Quality Brisket at decent prices. The sides portions are plentiful. Will definitely be bac","useful":3,"cool":1},"8MHC7tcO1ChfHATxersPeQ":{"text":"Best sliced Brisket I've had outside of Texas.  Good smoky bark on the edges,  Two thick s","useful":1,"cool":0},"U9R7I1w3xY8sHeBy6eaS2w":{"text":"Being from the middle of the Pacific, good BBQ, sorry, I mean, real BBQ does not come easy","useful":0,"cool":0},"xPwbbuwor_qrIbri5lDthw":{"text":"Mouth watering, melt in your mouth barbecue. The smell of this place is a meat lovers drea","useful":0,"cool":0},"Dy2c6OrDN405CF7vqMmqXQ":{"text":"One of my favorite foods is BBQ so I was excited to try this place! I got the pulled pork ","useful":0,"cool":0},"XB2zLxx05azWjgKM10cx-g":{"text":"Coming from a person who \"doesn't like bbq\", I enjoyed this place!  A friend came once and","useful":0,"cool":0},"Wz9axPSudHPut9zTxUaMSw":{"text":"So delicious. Brisket was perfect (no sauce needed, slow), smoked chicken wings ridiculous","useful":0,"cool":0},"lTLLPCJyKUwUue4TEMNymQ":{"text":"Delicious and reasonable. They have an incredible Happy Hour . The cole slaw is amazing an","useful":0,"cool":0},"U8DmCBR5zMK-AS5piTazRg":{"text":"Great real BBQ   Everything was delicious! Sprouts, wings, pork and beans. Owners real coo","useful":0,"cool":1},"nFpX_fydOIMTo0pP6Pcclw":{"text":"The chopped beef sandwich is tasty!! It comes with slaw on top, which is also very good. T","useful":1,"cool":0},"QZC7P_fsrHYPF_6em9v5Gw":{"text":"Been here for about an hour to pick up a catering order.  Food was good on previous visits","useful":0,"cool":0},"9uRk0fkANUzs7MIs2zIcYQ":{"text":"The best BBQ to be had in Louisiana. I had the pulled pork and it was as tender as a mothe","useful":2,"cool":1},"_nCxJTSNRl2AmTBuHGsgzw":{"text":"The Brussels sprouts are their best side. We also enjoy the mac and cheese. The spicy Caro","useful":0,"cool":0},"ix7MZjl3BxDF0VNOFPHzaQ":{"text":"Took it to go, had the bbq burger special with the garlic Mac and cheese. Everything about","useful":0,"cool":0},"Z_eYOmcJdpgrlHk11CPcOw":{"text":"This place reminds of a place in STL called Fire Grill, very good BBQ. Great for friends t","useful":1,"cool":1},"9nKD7eCnlQ5yegw2BbvjdQ":{"text":"we were in the mood for some bbq and it's sunday which means half the city is closed. luck","useful":0,"cool":0},"C4ZPLQZQDcaePVFF4wL1cQ":{"text":"Amazing. We brought the dog and sat outside. We  shared the 3 meat combo plate. Our sides ","useful":1,"cool":0},"Qq964JUD6UhRuGZ5LlaMGw":{"text":"Divine. Had a two meat platter, fatty brisket and green onion sausage with sesame slaw, bb","useful":1,"cool":1},"nc76jHZ61hIF0VjkKJZQcg":{"text":"Upon entering the parking lot, there is both inside and outside seating. Walk in and grab ","useful":0,"cool":0},"8jjwguG7wfunRkeij9AXEQ":{"text":"I've been to Blue Oak twice now and it was excellent both times. Last night I had the chop","useful":4,"cool":0},"cArTU-z3reFz8YQFhszfOw":{"text":"Whew! We really love Blue Oak. They still run out of food though. :-) -- but we have been ","useful":0,"cool":0},"MOn9IxTXfEgA0vskXA29cA":{"text":"Best BBQ in Louisiana by far.  Would eat here everyday if I could.  Spare ribs and smoked ","useful":1,"cool":2},"_aYyJ3SLbKi9VDwYlBS81w":{"text":"Awesome food and great ambiance. Went after jazz fest and it was packed. Service was on po","useful":1,"cool":0},"6Cu9oPEex7gF50OkQa32cw":{"text":"Their flash fried and smoked wings are AMAZING. Good amount of meat and cooked perfectly w","useful":0,"cool":0},"qGtvmcMhGLk7E_0GSCMEgQ":{"text":"Smoked wings were great! Nice friendly service (walk up ordering). Good bang for the buck.","useful":0,"cool":0},"EIaPgUC4n7IpEMy05M9I3g":{"text":"Honestly, I came here about a month or so ago, and I can't remember EXACTLY what I got, bu","useful":1,"cool":2},"Scqdm_MRJlJ19vUuHFHRjA":{"text":"This was the best bbq we've had! We're from Texas so we know Bbq! Brisket and ribs were ve","useful":0,"cool":0},"UR7b32KxU5f5d9-Nu2oANA":{"text":"It's my first time here and everyone was nice! FOOD WAS GREAT! Loved the pulled pork and M","useful":1,"cool":0},"ffd7GjI2nzqlOKs3XubHAA":{"text":"One of the best bbq spots I've EVER been to. The meats are smoked to perfection, and the s","useful":1,"cool":1},"Ac_0ZGGnqHRrgB3r4hwnaw":{"text":"Omg great bbq. Menu is short and sweet, prices are great, staff is friendly, and I love th","useful":0,"cool":0},"ndpl6YGkSw6jhLj6f4M5RA":{"text":"Holy crap!!!!  This is theeee best brisket and chicken I've had in Nola. Wow. The Brussel ","useful":0,"cool":0},"tH2LbgtnthWo8dZdWqGW1g":{"text":"I'm a Native Texan in a sea of North Carolina BBQ here in NOLA.  For me I pressed that smo","useful":0,"cool":0},"5DnRJ5W51pUQua-szljGtw":{"text":"These dudes sure know how to BBQ. I've lived and loved in Texas and Louisiana and don't us","useful":1,"cool":1},"8bdqtLDWsnkb0tnpq1wSoA":{"text":"Wow... can't believe it some of the best BBQ I have had. Lived in KC for 10+ years and Blu","useful":0,"cool":0},"5uBh7X3gwK9hTdEHE4SVpw":{"text":"This BBQ was out of this world good. We actually just stumbled upon this place and what a ","useful":1,"cool":1},"JZFgOistvsygDATq2FimwQ":{"text":"This place was pretty good. The brussel sprouts were good although a tab bit cold but they","useful":0,"cool":0},"XeqCByz8vn6gkjJXOFg3HA":{"text":"We went Wednesday afternoon and picked up a pound of pulled pork and a large BBQ beans to ","useful":0,"cool":0},"1I1qbNV7ErKh4hpc1yZK_Q":{"text":"Hi, We love this place. The food is always Amazing. Ny only problem was today must of been","useful":0,"cool":0},"B9edoadaBz1pUxInGCmyRA":{"text":"Best BBQ place I've been to in NOLA. Meats come out juicy and tender, melts in your mouth.","useful":1,"cool":1},"t07vDHgzj7nQRJH3izk23Q":{"text":"Fantastic. Went there for the first time tonight and enjoyed every bite. The ribs were ten","useful":1,"cool":1},"dvVmp5ZrPiqqeAKoQnbCQQ":{"text":"Delicious! I'm a neighbor of the place and the only advice I have for the customers is STO","useful":0,"cool":0},"Z79x8ZKT7TScnYGAz6vJkg":{"text":"The best buffalo wings you will ever eat. Smoked wings at that! These guys know barbecue, ","useful":2,"cool":2},"r2Z6XJJVUUf8qXPaAqJaVg":{"text":"Had the lunch today had the chicken leg, beans slaw, a viper sandwich and garlic macaroni.","useful":0,"cool":0},"4--tTAeVIKefP2zj9WXXKA":{"text":"OMgoodness. The food is good and I rarely post anything. I don't know what you put in the ","useful":0,"cool":0},"QDbwVrGHDerU-BjXvb3CVQ":{"text":"We went here Friday night for my moms birthday since she had been wanting to try the hyped","useful":0,"cool":0},"HbdFzhxnn-7EdnRH-KYR7A":{"text":"1st time here and it was just \"okay\". Service was great and the place was packed . The qua","useful":0,"cool":0},"1chNFrax83EknPYpURc5GA":{"text":"Thinking of making BBQ chicken or Brussels sprouts?  Don't. Best on the planet is right he","useful":1,"cool":1},"a78jxS_NXWiNR14WGZzPRQ":{"text":"Without a doubt this is the best BBQ place in Naw'lins!! Heard so much about this place my","useful":2,"cool":0},"NovPmmfbWKgPk2_KJDXzPg":{"text":"This is THE BEST BBQ place I have had in NOLA. Don't be afraid of the line that you will w","useful":3,"cool":2},"Ai-PgwUSyCI9de-M1tYYVA":{"text":"BBQ was delicious. Chatted with the cooks they were both super nice. Great place for good ","useful":0,"cool":0},"mGRgc11v6QGWiEELAvdjyQ":{"text":"We stopped in here for lunch last Saturday with our friends during Voodoo Fest weekend. Pa","useful":6,"cool":6},"nUO6DwAviAmn6Ul8mtA_OA":{"text":"Just returned from a visit to Blue Oak BBQ, which is located inside  the Chickie Wah Wah b","useful":1,"cool":0},"oIOU1hLXIw3WDG2fUmYAFA":{"text":"I really want to try Blue Oak BBQ. I really do. I've heard great things. We want to try it","useful":1,"cool":0},"mry1zazQws4UT066qrknmA":{"text":"Truly amazing. \n\nWe had Ronnie and the team cater a party we hosted after our wedding in N","useful":1,"cool":0},"iWi3f6_bM6b7NYvyK02yeQ":{"text":"Had the brisket platter with Mac n Cheese and red beans sides. Food was awesome! Beef was ","useful":1,"cool":1},"FBznBQ95_VH7pjhSF8xOng":{"text":"Hands Down, the best BBQ in Nola. Those guys are amazing! Great wings & the shrimp tacos a","useful":0,"cool":0},"eBT3OMEQHkqINAjItQCcGg":{"text":"Favorite brisket in Nola! And the Brussels are amazing! Consistently delicious every time ","useful":0,"cool":0},"u5nLayDR7S5TG_3WjnLFaw":{"text":"I've been here multiple times and have literally left satisfied EVERY. SINGLE. TIME. I don","useful":2,"cool":0},"sA-ntdB6zSF1pWSZ0NM7FQ":{"text":"Really good!  The only drawback is the limited selection of sides.  Had the combo platter ","useful":0,"cool":0},"FZ-zu6F7_ahQuy4xW3Morw":{"text":"I went here for lunch yesterday with my friends from work and OMG! This is probably the be","useful":0,"cool":0},"Yw0sv_Ee5t3Qrfq6Ssov6A":{"text":"Wanted BBQ and we YELPED this place and decided to give it a try. I ordered the pulled por","useful":1,"cool":1},"hHP_mnOiR_vhZZ-MXwJ3Cg":{"text":"**This review is 4 stars with an astericks. I would say it's more of a 3.5 star review. \n\n","useful":0,"cool":0},"u09qwmpjKW-x0KLbz7U0qA":{"text":"Cool spot on Carrollton for laid back BBQ and classic walk up bar. Portions weren't bad fo","useful":0,"cool":0},"n_IvhlXa6l-9b0TOgAB3hw":{"text":"Moving to NOLA from Texas, I've been missing good BBQ. Luckily a friend brought me here af","useful":0,"cool":0},"SKHLZKqYxOHHKxLOvFKanQ":{"text":"The place is to small and the prices are steep. They have to figure a better way to distri","useful":0,"cool":0},"BfTnYdeZGNhFQULeU5amVA":{"text":"Omg to die.  Bring your dog and sit out front.  Get the sweet potato bread pudding.  Get t","useful":0,"cool":0},"1H9zbsYbtflAIi-H1VGRSg":{"text":"By all means the food is great... the over all layout of the restaurant need some improvem","useful":0,"cool":0},"eco7sQXyGENkzGPuJl1yvA":{"text":"This place is confusing location wise.   It's inside Chickie Wa Wa. Here is my review I mi","useful":2,"cool":1},"xlOyeKeLe2tFVXKoCtvkhQ":{"text":"This was the first place we stopped to eat at in NOLA! Really, really good BBQ with tons o","useful":4,"cool":0},"9yiRzjNm7p6S0akOvC9uDw":{"text":"We were a little confused when we walked in. The outside says \"Chickie Wah-Wah\" with a sma","useful":5,"cool":0},"28ov7hK6R_-PctGgWz9jeA":{"text":"went to Blue Oak on 4th of July and the line was out the door and down the street. we ente","useful":0,"cool":0},"wH0DW3LnNr1Ugu6mEdwRYg":{"text":"Inferno wings are decently spicy. Anything hotter would be unnecessary. The pork is so sof","useful":0,"cool":0},"x9MP-wWh7fRXsXnXqcBb_g":{"text":"Didn't even get to go. They advertised some chicken biscuits... Well, they don't even have","useful":0,"cool":0},"EP4tjftjZtAmST5N7IrBmQ":{"text":"Thank God! New Orleans finally has legitimate BBQ in all \"3 quadrants\" of town, Blue Oak -","useful":0,"cool":0},"yngKzRP3FLXDWwQ31A8NSA":{"text":"Drool! Most of our party got the brisket sandwich, which was phenomenal. Can't wait to try","useful":1,"cool":0},"fOHsP4IAyd5YQnOzsVXTpw":{"text":"Quality Brisket at decent prices. The sides portions are plentiful. Will definitely be bac","useful":0,"cool":0},"p_JiQkHjnWoCOgPlmgLhqQ":{"text":"I haven't written many updates, but I thought I would for Blue Oak.  I popped in yesterday","useful":1,"cool":1},"BUlcl0utcoWcaP-9Ckhkrw":{"text":"Best BBQ we've had in New Orleans!  Brisket is so tender it melts in your mouth and the Br","useful":0,"cool":0},"XJAgKrietZGyvnCaoShL6Q":{"text":"Food is always fresh and on point. The roasted garlic mac n cheese is . Definitely a repea","useful":1,"cool":0},"a5JvZNdHO_dizUMFDMTZbg":{"text":"The wings here are amazing. Cooked to perfection and all of the sauces are worth trying. I","useful":0,"cool":0},"_5P-akY2yf0qFjitUuy1RQ":{"text":"I haven't had a lot of BBQ in New Orleans. It's something I kind of ignore, as I have a lo","useful":3,"cool":2},"qboTRi4HYo97xvmnPwb2dg":{"text":"I got the burger and the garlic macaroni and cheese.  I can't describe how delicious every","useful":0,"cool":0},"lwItpigJGty-BA9ZdYGlQg":{"text":"I got the combo sliced brisket and sausage plate !!! \nOmg let tell you it was soooo good! ","useful":0,"cool":0},"flt7dpDq88HSeFRDBwjMGQ":{"text":"PBought the all the meats all the sides dish for $58.00. the of us were eating. The sides ","useful":0,"cool":0},"NX-LGw_g8nwsn7E51uRqzg":{"text":"My husband and I agreed this is by far the best BBQ we've had yet. I ordered the ribs and ","useful":0,"cool":0},"nxI0pBk_s5nqW9HnTJAtog":{"text":"Everything is great. The prices are cheap for the amount of food you get, and the bar acro","useful":2,"cool":2},"6nzNKZoaO9iJoVXCXp3Xmw":{"text":"Blue Oak has the best barbecue in the area hands down. Always consistent and a very friend","useful":0,"cool":0},"Tsn63s98Vo_AGPTGbC8AaQ":{"text":"Pretty standard bbq fare so no complaints! The bartender was everything though! I don't re","useful":0,"cool":0},"mU5Fzp5GjVIPaYG6UhFETw":{"text":"My favorite barbecue spot in the city without a doubt. Don't let the long line discourage ","useful":1,"cool":0},"_gHWRt6iRYPQ47_akaQy2g":{"text":"Incredibly tender, juicy, and flavorful brisket sandwich. The portions are absolutely huge","useful":1,"cool":0},"ZGavKPu4oOQWlPMvtMcKpQ":{"text":"These are the best chicken wings I have ever had. If you do not like chicken wings typical","useful":0,"cool":0},"95uXxqf7LO9DMMx2I0erFQ":{"text":"Used to be my favorite bbq in NOLA. However, the last time we went the staff was very rude","useful":0,"cool":0},"T2aLA_GP5SndzFPr55Y7BA":{"text":"LOVE this place. Can't get enough of the smoked chicken (and crispy fried skin) and Brusse","useful":0,"cool":0},"nT0T844w0P57zVce4d8kHg":{"text":"Good vibe & friendly staff Tasty rub used on excellently prepared & smoked meats I had the","useful":2,"cool":2},"rqPB66B4ljoTnoIPhTkEkQ":{"text":"I had the brisket tacos special here the other night and it was like I was back home in Au","useful":0,"cool":0},"VxzIl4UScVTIvhLWYqeCIQ":{"text":"Lifelong Mississippian who lived in Kansas City for a year before (thankfully) moving back","useful":0,"cool":0},"g0epoRjea21-XW4EHe0rbg":{"text":"I loooove the smoked chicken wings here. The buffalo inferno sauce isn't for the weak. Be ","useful":0,"cool":0},"siBGWVnjeXFaACMldMqWmw":{"text":"I was really looking forward to eating here because I had heard so much acclaim.  The food","useful":0,"cool":0},"UFulh9ICkJlqti_VKD4hkg":{"text":"Food is EASILY 5 stars. Succulent, tender, tasty meats and sides. The way the place is org","useful":0,"cool":0},"x1Hn1KpnDtR34EzQpEIqkw":{"text":"Move over McClure's and The Joint, Blue Oak is truly the best BBQ joint in New Orleans! Th","useful":0,"cool":0},"qHrJm1XcIyZN5Q7G2_PVOg":{"text":"Great atmosphere and quaint interior! Has great outdoor seating if it weren't so blasted h","useful":0,"cool":0},"ZVqHOIDTQVA3NKhW6ft9Gg":{"text":"Hubby and I are back . Food is always great . However the Service is a hit or miss . At th","useful":0,"cool":0},"vEIlpVLd3Hfdq4Wd4zpW9A":{"text":"We are on vacation from St. Louis region of Missouri and I LOVED the BBQ and the variety o","useful":0,"cool":0},"oR0CEkNEn9xld1SBxf2TKw":{"text":"Just okay. I got the 2-meat combo (pulled pork and chopped beef) with mac n cheese and pot","useful":0,"cool":0},"1HczR2uN25RuvHZ8Zt99KQ":{"text":"Ordered take out on a rainy day and my lord this bbq just turned the day around. We ordere","useful":0,"cool":0},"iwX17gcAqbYJ4JD2K7OwQQ":{"text":"It seems like everyone is jumping on the BBQ craze that has been taking over New Orleans a","useful":13,"cool":12},"MLXMfIEWbB96gpTWzD_BrA":{"text":"If you want a two year olds portion for a ridiculous price come here this place is trash..","useful":0,"cool":0},"0psLBHffLgb1axUuhUwIng":{"text":"great bbq. i'm originally from memphis and really miss bbq. this is the best i've had in t","useful":0,"cool":0},"VPaSkIazJ4AG5n9Tb8xhcw":{"text":"Went at prime lunch time. I ordered the BBQ chicken (good BBQ) with a side of ginger slaw ","useful":0,"cool":0},"H88h8mk9aprUHG_eQl723w":{"text":"The ribs are probably my favorite thing here. Ooh the nachos aren't bad either! Not really","useful":0,"cool":0},"KZfd_7jzlTiDAk6bIFWSzQ":{"text":"This place is great and tasty. I recommend for those travellers who don't have time to was","useful":1,"cool":1},"4K8z7y2AtVzdjRLuoJK66w":{"text":"Best Brisket I've ever had! We ordered the 2 meat plate, brisket & pulled pork. Pork was d","useful":2,"cool":0},"8gfXw-qYgPFAyv8ho_wZHg":{"text":"This place is delicious. I'm coming back for the Brussels sprouts and pulled pork. Potato ","useful":0,"cool":0},"YlK4O14klxtxWUC2jDh8Uw":{"text":"This is my favorite BBQ joint! Everything from the atmosphere to the staff is very invitin","useful":0,"cool":0},"0MNBQXPaXesWNmMhluAgLQ":{"text":"Barbecue so good it'll make you wanna slap yo momma! But seriously Blue Oak not only has a","useful":0,"cool":0},"VIAbPJEnjlYvUpJwabNXkA":{"text":"Let me just start by saying WOW.  The food is amazing.  Loved everything but our favorites","useful":0,"cool":0},"LkiCN6UBKJEkbbey5thdtw":{"text":"This is a great little BBQ joint! Had the BLT special with some of the best bacon I have h","useful":0,"cool":0},"AmJCkcpQagYi5nk_QjJokg":{"text":"Growing up in Austin, TX I have a pretty specific taste for bbq. Note: grilling is not the","useful":1,"cool":0},"SOFb2r0PF-lA9W__21EU-g":{"text":"Blue Oak BBQ is delicious!!  Service is top notch and the menu selections are excellent.  ","useful":1,"cool":1},"qwObzUINchyKlGucpXGO0A":{"text":"Absolutely terrific and tender brisket and pulled pork.  Brussel sprouts are now on my fav","useful":0,"cool":2},"X7FmbpYWYo9VERRatxOMRg":{"text":"After having an underwhelming BBQ dinner a few days ago, we went a bit further out to try ","useful":0,"cool":0},"pUgkD-w9uuqlJBXruKXbvQ":{"text":"Everything was DELICIOUS!!  Things we had: brisket nachos, wings, man n cheese, potato sal","useful":0,"cool":0},"-RbyOO1xExhDyuHeF7yXHg":{"text":"I'm originally from NC so I grew up with quality BBQ. We had the 3 meat platter so we coul","useful":0,"cool":0},"nKraI6QJ4RzcCSUn9OovRw":{"text":"This place was a hit! The  only improvement  they need is a great BBQ sauce for the table.","useful":0,"cool":0},"_nPujtONos1QDJTexYRb7Q":{"text":"Tender brisket and tasty sausage. This is going to be my go to place for BBQ here in NOLA.","useful":0,"cool":0},"ZSuhbfHsAtI_gvXP_4SS6Q":{"text":"We eat here nearly once a week\nHighly recommend the egg rolls the rooster sauce wings and ","useful":0,"cool":0},"In7q044-6xv8rcF41UQh_g":{"text":"Good Food and Off The Chain Brussels Sprouts\n\nI went here and ordered the combo 3 meat pla","useful":0,"cool":0},"xvSkOe4WMnyJUAvavdAAbw":{"text":"Fantastic bbq here in NOLA. Got the 2 plate combo and pulled chicken. Everything was fanta","useful":2,"cool":2},"ql_p_ka8Lug35Q6OVQJImQ":{"text":"Great BBQ in NOLA.  It was well seasoned, smokey and the right balance of sweet/savory in ","useful":0,"cool":0},"SxOhI9Z2Wo-o5lfqeum5WQ":{"text":"Best bbq in NOLA!  The jerk ribs are so delicious.  Spicy, sweet with just enough heat.  D","useful":0,"cool":0},"bV4RlZpURHCZnEpR5D7IZw":{"text":"Wow, wow, wow!  This place is awesome!  I am a native Texan and have eaten a lot of good b","useful":1,"cool":0},"bJopTJOBkQyygP5MppPQdQ":{"text":"This is some of the best BBQ I've ever eaten. They've taken some simple, tried and true di","useful":0,"cool":0},"ScT1PmDWCWJrO2eKwzHPlA":{"text":"Blue Oak BBQ is on point. Great spot to hang out and amazing food (brisket and brussel spr","useful":0,"cool":0},"9JhbU06BG2Ba8PLNKKDHHg":{"text":"We had lunch and decided to eat after a morning at the museum. We decided to share the pic","useful":0,"cool":0},"_XM6NYFBxsmasG3yHRgZ2A":{"text":"Sadly they were out of brisket upon arrival. However, we made the best of it with the BBQ ","useful":0,"cool":0},"OVn0-3XiYpXhtYqeyGHhzA":{"text":"We live nearby so we stop by occasionally when in the mood for BBQ. We've found the food t","useful":0,"cool":0},"SAWAgzNlnN48IyjwmgYAtw":{"text":"Totally impressed with the interior design, which has come a long way since it's Fellini's","useful":0,"cool":0},"sXAyrWvQH6Y-ACyKwmUE8A":{"text":"We were heading to the Museum of Art but lunch was in order.  So on the way, we got off th","useful":2,"cool":3},"cEeHJTM8YXN7L1ECUK0sUg":{"text":"Busy little place even close to closing time on Friday night. the food was very good. we h","useful":0,"cool":0},"A2-LIz1rfdKrwZirsWh37g":{"text":"The best little hidden gem in Mid City for BBQ!\n\nAwesome pulled pork!  The macaroni and ch","useful":1,"cool":0},"eg3wwRqZ-Uqs0-4AhI9JVA":{"text":"Best barbecue we've ever had. Shown well, high class feel with comfortable atmosphere. Can","useful":0,"cool":0},"446K7nnah0rsEDdTBV1Mkg":{"text":"Delicious bbq, tried all, brisket, ribs, chicken and burger.  Very tender, full of flavor.","useful":0,"cool":0},"bVhFC8FpPi_cGXKiJSPa-Q":{"text":"THE BEST bbq place in Nola! Big ole beef rib, bbq burger, mac and cheese, and brussel spro","useful":0,"cool":0},"-961h7C9BMD2R3xmK6X0Pg":{"text":"The food I ordered wasn't bad so I decided to give three stars for the lack of space and d","useful":0,"cool":0},"fWypVztxIfv6_8qfpeyJ5Q":{"text":"I ate here for the first time today. Ordered chicken wings and my God their wings are GOOD","useful":0,"cool":0},"YX2LY8sGA9LMqD_Y-s3_GQ":{"text":"Went for lunch. Had to look for parking because the lot is tiny and full. Ordered the chic","useful":1,"cool":0},"7lUuw3v7c_jqdRr4cFJdWw":{"text":"We had dinner here one night, and it was pretty decent.\n\nIt's the type of place where you ","useful":0,"cool":0},"g3aoKoqz_ex-dsMqGCDTOw":{"text":"Excellent BBQ. Brisket was moist and flavorful. Staff looks like they really enjoy themsel","useful":0,"cool":0},"fbjbSxzgMTPPb8YsHWPmHw":{"text":"Probably my favorite bbq in town.  My mom is from Texas and I cried the first time I ate h","useful":0,"cool":0},"Gk7snoi9xTs16pVBKcuLiA":{"text":"No wait for dinner on a Wednesday. Sweet! Ribs were great, sausages too! Brisket was quite","useful":0,"cool":0},"8ByHV6h_MPGN0SwZEeQC9g":{"text":"Crackings! That's all I gotta say.\nWe shared the BBQ platter with 2 meats and 2 sides.\nThe","useful":0,"cool":0},"9N6QAXNiEfYoB8wKNJpsdQ":{"text":"Dude. All the things. Brisket, pulled pork, chicken. All on point. Happy hour specials are","useful":1,"cool":0},"-KxeUhKBENXgI2KnHfH7Zw":{"text":"Good Bbq. Chopped brisket sandwich was flavorful and more than filling. The garlic mac and","useful":0,"cool":0},"zgqMQNXBweM9VRZyfVgB-Q":{"text":"My Hubby and I are Regulars . We also have  recommended lots of people to your establishme","useful":0,"cool":0},"9xreLQ2AC5ZJujMLwOdtmQ":{"text":"The food was actually good, but the service was so bad, I could never recommend this place","useful":1,"cool":0},"NGmwGD24hqsUgLREpJ21Jg":{"text":"No hesitation to give 5 stars to this one. I got the posse, it's 1lb of meat, 2 sides and ","useful":1,"cool":1},"n916nR0Caw7QRqT_rK_lzg":{"text":"So I've heard nothing but good things about this place and it's well-deserved. I don't eat","useful":2,"cool":0},"kf4rYNjU5OhEdfYhImay9Q":{"text":"We are here for lunch today and this is one of the best BBQ places I've ever been too. The","useful":0,"cool":0},"imYrW1ukQA06TWPQIynFIw":{"text":"Went for lunch yesterday, had the brisket plate... Oh my gosh the brisket was freaking ama","useful":0,"cool":0},"_msES3s4bE_hx1HOxe3cRQ":{"text":"Top 2 bbq joints I've visited in my life. Went with a group of friends and tried a little ","useful":0,"cool":0},"21ymioEFo_YBMSSMga_PUg":{"text":"I would love to give them more stars because most of the food is great. However, there is ","useful":0,"cool":0},"THp2mDM3WkzmYCXZ5-h9kw":{"text":"This native Texan here can tell you the BBQ here is on point!!! They do everything right h","useful":0,"cool":0},"zQc1qZKL9WcHYfq1mjXLow":{"text":"I have to give this place another try for a 5. However the Brussels sprouts have been on m","useful":0,"cool":0},"aBO1QY6RiJ3eb3Toew1fiA":{"text":"Okay, so it's been a long day... I mean one of those days when work drained you so much, y","useful":4,"cool":3},"sGyI74JyXwMUta5nDpslZQ":{"text":"Went Sunday afternoon of Memorial Day weekend. Were out of almost everything meat so we we","useful":0,"cool":0},"jnIV07MNAmC2AHHOfCiYXg":{"text":"Actually a really good place...when they have food. Saturday I went here and for the third","useful":0,"cool":0},"zQPp-2aqA8yKQBM30Oh-vQ":{"text":"Absolutely amazing! The chicken changed my life. Best chicken I've ever had & i don't usua","useful":0,"cool":0},"3IWYs9fd2awda0ipnGYS6A":{"text":"Great food. Decided to try here while visiting after reading the reviews. It was very good","useful":0,"cool":0},"kujYd9CodwHT7eXZ955HZQ":{"text":"We sat here for an hour eating and the only topic of conversation was how good the food wa","useful":0,"cool":0},"6anzGshleGsyOnvlHJPFzA":{"text":"1st impressions are very important.  Thank you Blue Oak BBQ for a great one. Went there fo","useful":0,"cool":0},"Rzx5OMJMJOrnCO6iVA6mZw":{"text":"Cool spot in mid-city, not a lot of inside seating but plenty outside. Definitely one of t","useful":0,"cool":0},"pey9HVkjkJw0f42rugEgTQ":{"text":"Awesome!  We've eaten here about 10-12 times.  They are always consistent.  Try \"All the M","useful":1,"cool":1},"-i8xREWcfeihnmD7y2qFYw":{"text":"Love the patio area and the staff was very friendly. The menu is simple, so not a lot of o","useful":2,"cool":0},"lnmYwUL0jhzXINh0d_z2jg":{"text":"Friendly staff/owners. I had the chicken wings several times and they always deliver! Thou","useful":3,"cool":1},"razMVlB-MkJrheY08TUebQ":{"text":"This is by far the best BBQ in Nawlins. The food and drinks were amazing. This place is aw","useful":0,"cool":0},"tZ5aFiv2osy4qz7eo7Bp5Q":{"text":"My family and I stopped here on our way back from City Park, and it was the right decision","useful":0,"cool":0},"ZB8qLxTmb2W1xy8z4OyU6Q":{"text":"The wife and I wanted some good BBQ. She is from Dallas and is a pretty tough critic when ","useful":3,"cool":1},"Uo9Ws0-uxPwYwuSo0piQ8w":{"text":"Came here for a football game and heard this place was delicious for bbq style food.\nWell ","useful":0,"cool":0},"QOZtTbkyOoJtoZwEuKifrA":{"text":"Their food is consistently delicious. Love the Lost Boy sandwich, mac and cheese and above","useful":1,"cool":1},"gbK5aXmzIKCju1fBp0teqQ":{"text":"This place is located in a bar called Chickie Wah Wah. Parking is pretty limited, but that","useful":0,"cool":0},"84ZhFC_xjNOhhNq9_PGAUg":{"text":"I have never had Brussel Sprouts that I really like until I ate here. There is a flavorful","useful":0,"cool":0},"IJVvlACR7cSf2P6fDoGcZQ":{"text":"Service was great, you order at the counter, which is to your right when you walk in (bar ","useful":3,"cool":1},"okNVUTvEtJ2KVR2aJWkE5Q":{"text":"This is some of the best BBQ I've ever had. The brisket and the brussel sprouts were my fa","useful":0,"cool":0},"ABGZDA8er0r91Qj2O_GjmQ":{"text":"We came here for some Southern barbecue based on Yelp reviews since The Joint was more out","useful":3,"cool":1},"bOTMAvhjNpsRAtys9sTr1A":{"text":"As New Orleans continues to toss it's hat further into the ring of BBQ destinations, Blue ","useful":2,"cool":1},"gs-ka_vOat5uH07S8v1nJQ":{"text":"Recently had Blue Oak cater a small birthday party. I ordered the sliced brisket and pulle","useful":0,"cool":0},"Jvr1vTPiLKbnB94xnYJz9w":{"text":"Delicious. We got two brisket sandwiches, a side of mac and cheese and potato salad, and w","useful":2,"cool":2},"1NbXztm5GOZajREV3xGF6g":{"text":"OH MY GOODNESS!!!  The pulled pork sandwich was SO delicious! I normally am not a huge fan","useful":0,"cool":0},"Dqgj0YjWEBxx7WRa1lJEcw":{"text":"Food = delicious. Great bbq (specifically the brisket). Beans & Brussels Sprouts great too","useful":0,"cool":0},"I4GQ9bZ6FwYJuW-Ngfndhw":{"text":"No complaints. The ribs were some of the best I've ever had. We also had the cheesy grits,","useful":0,"cool":0},"FPfv_tdB5rtOd0FwfjkrVA":{"text":"From their more humble beginnings inside the Chickie Wah Wah to their new digs in Mid City","useful":0,"cool":0},"0iLAhs0IeFA5nXQByaTJuQ":{"text":"This has probably become my favorite bbq joint in NOLA. Great brisket, I tried the fat whi","useful":0,"cool":0},"SL34tAjlHi4FVXZzKODvqg":{"text":"I am not a big bbq fan but this is my all time favorite bbq place ! The best in the city !","useful":2,"cool":2},"5IpHdZfwphyn2t1S3qAVFw":{"text":"Located only one block from our AirBnB during our stay in NOLA, my boyfriend enjoyed the f","useful":2,"cool":1},"KFwzELnDnV4AqEatKDM9xQ":{"text":"This is hands down our favorite BBQ places in NOLA. The line moves quickly and they have n","useful":0,"cool":0},"De34zFLOagKLYPgVTfkL9A":{"text":"We stopped here on the way back from Storyland and was blown away.  \nI got the pulled chic","useful":0,"cool":0},"OZ6qI-3sOem-j0qrh5Yr1w":{"text":"The smoked wings here are unspeakably delicious. I'm getting hungry just thinking about th","useful":2,"cool":3},"lAXC3jkhKwsaHy1nSzcqAw":{"text":"First meal in New Orleans will be hard to top. Ribs were delicious, get the Mac & Cheese t","useful":0,"cool":0},"W6CVA9gXSWpLglw0nJr9_A":{"text":"This has some good and some not so good things.  The food came out quick (good) but it was","useful":0,"cool":0},"iQED_pf0qHVWnXpHE2uegA":{"text":"Tried this out on what happened to be their busiest day ever....so they sold out of a coup","useful":0,"cool":0},"UZbzCh76e6QVLsSEZMuY0g":{"text":"I went to this barbecue place tonight with my mother I had the ribs the brussels sprouts a","useful":0,"cool":0},"CVeT6sUdwQFS9zghjMs6IQ":{"text":"First time here!  Impressive I must say!  You stand in line, order your food, pay, and the","useful":3,"cool":2},"olVfcoVKlybapx-0WhTC3A":{"text":"Amazing! Happy hour has great deals. $4 drafts, half price wings and $3 slider of the day!","useful":0,"cool":0},"wIgLjesf8vpIePRU63lJcw":{"text":"This establishment only opened a year ago, and it's already such a hub of Midcity. It is s","useful":2,"cool":1},"DuNmDdVDPnqf5s3jiEuGIQ":{"text":"This place is a must when visiting NOLA! Their pulled pork sandwich, garlic Mac and cheese","useful":0,"cool":0},"F88z702Xw1Kse6HMpvCnTQ":{"text":"This place was wonderful!!! The Brussel sprouts were AMAZING!! I cannot wait to go back an","useful":0,"cool":0},"8V6pzVoKYbML3LngRgPmYg":{"text":"Headed here after our original plan lunch spot was closed. Turns out, this place is amazin","useful":0,"cool":0},"D4pqulIAMFNOsy5ztqePRA":{"text":"My husband and I experienced a wide variety of BBQ in our travels . This is hands down the","useful":0,"cool":0},"J0epvDVBf5-eGy8Rl-bIBQ":{"text":"This restaurant has now become one of my TOP recommendations for the city!\n\nIf you're look","useful":1,"cool":0},"IhDD1f9yPY_-4qttcxvaAQ":{"text":"After reading all of the great reviews and having my mouth water over the thought of the b","useful":1,"cool":0},"L73N7Icj-dxlPuPUh74vzQ":{"text":"Awesome brisket and pulled pork! Nice mix of charred pieces in the brisket. All three sauc","useful":0,"cool":0},"moxUQYFTDqkZTkIkEbKRVA":{"text":"We love this place! I always go for the smoked chicken plate with the Brussel sprouts and ","useful":0,"cool":0},"obg41UEPYgYiYEl54WSt0A":{"text":"First and foremost, my man does not eat brussel sprouts. ....except here. Amazing. My new ","useful":1,"cool":0},"wuivdJQ0ajtYdXxiZBgRXA":{"text":"One of the best BBQ places I have ever been too! Love the rustic design and decor of the p","useful":2,"cool":2},"A656zKfPi_4nN_vWoH40WQ":{"text":"This place is FANTASTIC! \n\nWe were staying in the French Quarter and were really craving b","useful":0,"cool":0},"Xqb2QcCHmcPQjEYDjP8aFQ":{"text":"The food is very good here. All of their meats are delicious, and their side items are fan","useful":1,"cool":0},"uop1OLJxIP-7OHt0ub-wqA":{"text":"This place is almost as good as Waffle House, which still merits a five star rating becaus","useful":0,"cool":0},"cIj267by4wDLd9P3_mRahA":{"text":"Blue Oak is our go to bbq spot! Best barbecue options and their sides are most certainly n","useful":0,"cool":0},"ysKYnlly-6hbns3_704PFQ":{"text":"Mac! Fried Brussels! Pulled Pork! Sauce! Bueno. Go eat it.","useful":1,"cool":0},"sa5Megg71Zw35WEjmxQciw":{"text":"Definitely one of the top three BBQ Joints in the city, for me believe it or not my favori","useful":0,"cool":0},"H9eAiX4J6IAmvP04IGX0AQ":{"text":"Everything was amazing! The wing especially! I recommend this place to anyone visiting!","useful":0,"cool":0},"aoyicHX_VJUiAcMG-loGDw":{"text":"Definitely check this place out if you're staying in the French quarter. Just a quick stre","useful":7,"cool":1},"FqhxCVU27kRp6tqoVL-q4Q":{"text":"The best ribs in the city. Great BBQ restaurant with many options and very tasty food.","useful":0,"cool":0},"tFcOSlZkn1mKM4z8dSTzqw":{"text":"Really good bbq.  Try the ribs! They always have specials. The watermelon salad was delici","useful":1,"cool":0},"oGcstgQL3893nXrAVo4M-Q":{"text":"Amazing. Came on Saturday night. Busy but they were efficient and food was soooo good. I h","useful":0,"cool":0},"nex1kJ_pdYF5wFy95K7xWA":{"text":"This has turned into the perfect day date for me and the kid. After we visit city park for","useful":4,"cool":3},"Ryy5-svz2jgyHAkMXge2fA":{"text":"Love this place. If you go try the brussel sprouts they are fantastic. They do close at 9 ","useful":0,"cool":0},"bhBm70HELViFPDmzKuifeg":{"text":"I heard the hype so finally got a chance to check it out for myself. Loved the laid back a","useful":3,"cool":2},"EWkmXu7JNtrZbTBkv-FLdQ":{"text":"After a few tries trying to like it (the place is in my neighborhood), I have concluded th","useful":0,"cool":0},"o6IpENbZLmz0kKzR2p_dpQ":{"text":"This place rocks! The happy hour is the best in Mid City but freakin-A who cares if you mi","useful":0,"cool":0},"qOIXnoBwd8mF3q8wobZvOg":{"text":"One word:  yum!  \nFirst visit:  My husband had the hamburger, which was a huge patty, had ","useful":0,"cool":0},"I-TArO3BKo73ublkW_HcfA":{"text":"Based on my totally unscientific survey, I think I'm safe in saying that New Orleans has m","useful":2,"cool":2},"Fuc4CQUcVk3nRzEaBO_Qqg":{"text":"Can not say enough about this place. From the food to the atmosphere to the staff. Never h","useful":0,"cool":0},"RGzccAHKmduM8NrCeDlcuw":{"text":"Blue Oak is about our most talked about BBQ place in NOLA and it's doable for sure. They h","useful":0,"cool":0},"N2CeoZ0j6ivDTdKNstS6uQ":{"text":"We went there to for lunch, it was our first time \nWe got there around 11:15am and it was ","useful":0,"cool":0},"krUYHjxfeDQ-KVwaI44PnQ":{"text":"Pictures looked great, reviews for the most part were great, so I've been wanting to try i","useful":0,"cool":0},"p73d0GNWvUMlrk-gGdJMhg":{"text":"Super yummy even if BBQ is not a NOLA thing it really hit the spot!","useful":1,"cool":1},"K5F97CV0IHS-d2ymE6vwJw":{"text":"Being super new to mid  city I stumbled upon this place while taking a stroll getting acqu","useful":0,"cool":0},"nWF-Vnt_YjQGHVOpfThnLA":{"text":"Fantastic bbq! Fatty brisket perfect - not too fatty and not dry at all. Chicken wings wer","useful":0,"cool":0},"SdNu6XFjOcZ2nQUBIfCZtA":{"text":"My wife and I grabbed a Friday lunch here today and I have to say I will be coming back, m","useful":0,"cool":0},"m4Ho3tP69ryMHCLyj-bjhg":{"text":"Good BBQ and very filling. A little over priced but worth coming here if you're going to C","useful":0,"cool":0},"xM-hBUjZqzncEQYCzmRlmQ":{"text":"In a word, disappointing.\n\nI guess we expected too much based on Yelp ratings and other so","useful":1,"cool":0},"HIexMz9QcuHojChZrNZcgA":{"text":"I honestly can't say enough great things about this place! We hosted a private event and w","useful":0,"cool":0},"msbOeD8ibSHJ1IiW5jANmw":{"text":"BY FAR THE BEST BBQ JOINT IN NOLA. My friends wanted BBQ again and I reluctantly looked up","useful":0,"cool":0},"Y_tRgPE6dIez_JH4bl2xtw":{"text":"Got my extra sauses yall!!!!!!! Hahahahahahaaa\n\nCheck in for your cozy it's cute. Check ou","useful":0,"cool":0},"oO9cYo1jCEWA93gkYS5XVw":{"text":"Good food and service! Only complaint was portion size was a lil small! Overall good exper","useful":0,"cool":0},"KEFC9QNxj9MNz2fS7gWJIQ":{"text":"I lived my best life on this day! My meats were perfectly juicy and cooked to perfection. ","useful":1,"cool":0},"zWVaHK7evlnOUQoDWEw7Kw":{"text":"We happened by this place on a walk to the art museum. Just wanted a beer but the menu sou","useful":0,"cool":0},"j7LKAMZ-8KfnxJi2NVpbDQ":{"text":"Delicious!! All around great food! Wings, brisket, pulled pork, Mac n cheese and Brussels ","useful":0,"cool":0},"sAxbO-RUYAZJ56esV00cYg":{"text":"Came here the Sunday before Thanksgiving, just after the Saints finished crushing the Atla","useful":0,"cool":0},"HpH-RaKvEXypofUkZYDS7g":{"text":"It's fast casual with slow components. I waited in a long line for a long time, ordered, a","useful":0,"cool":1},"2T25tYQr8Kpz5PodRfGhgw":{"text":"Great ambiance with better food. One of the best burgers  (smoke house)I've had in a very ","useful":0,"cool":0},"pZ3wmrIG4RSSLu8SZ-2cgQ":{"text":"Randomly found this place looking for another restaurant and we were not disappointed. Thi","useful":0,"cool":0},"_m0wAx7U3oAD7FZIWkO9bw":{"text":"Nom Nom! Been here 2x so far and I can't wait to get back again! Mac and cheese is a delic","useful":0,"cool":0},"5rrfHT_7gSWvgjZamrbDHA":{"text":"Went here for the first time after hearing about it for ages, and I gotta say, it lived up","useful":1,"cool":1},"sAXkZZIk_Zb2X0uByEFCbA":{"text":"This is an incredible, casual food stop!  A must if you're in New Orleans!  I had the pull","useful":0,"cool":0},"fBuDvQYP-12DSTpJHCtZFg":{"text":"Fantastic bbq! Fatty brisket perfect - not too fatty and not dry at all. Chicken wings wer","useful":0,"cool":0},"Fv-9daL8U1DRztrQZDMPNQ":{"text":"It was just not good, the meat is very much not my type and even if the mac and cheese sho","useful":0,"cool":0},"P9Ura_U1muDRuYyNnQaslg":{"text":"Good, quality food.  Nice staff.  Clean place. Order at the counter and then take a seat. ","useful":0,"cool":0},"TWO0o9l1pMFtAeoJiYF8Zw":{"text":"Amazing bbq best potato salad ever!!!! Pulled\nPork is a++++, and the brisket is amazing!!!","useful":0,"cool":0},"Fxk_rGV-io49uct0GleBgw":{"text":"The brisket was absolutely exceptional. I got it sliced in their \"plates\" section. They as","useful":0,"cool":0},"J6ZZ3OLUANmSCVdtmsmG5A":{"text":"Love the food! Definitely worth a visit. DH & I tried the \"BBQ buger\" and it was tasty. Pr","useful":0,"cool":0},"TzhDc5jphdY6HPRAcyuSEA":{"text":"Barbecue ribs and brisket were very tasty and good. My brisket burger was juicy but not a ","useful":0,"cool":0},"D_F-MLWyREa7Z1mH_wwUQg":{"text":"Delicious meat, fair price and portions. We had brisket, ribs and pulled pork. All were de","useful":0,"cool":0},"ff7RRFSyytD2iuswkKkTNQ":{"text":"Been to a quite a few barbecue places in New Orleans, and it's sad for me to say but Blue ","useful":2,"cool":0},"n64ERdru3fK97YkmZjMwVA":{"text":"The BEST in the city!  I usually get them to cater so I haven't been in the new location t","useful":0,"cool":0},"SQ8FsbC7He6lLqm0Qn4boQ":{"text":"went on a Sunday afternoon in September. place was dead - a few people were sitting outsid","useful":1,"cool":0},"hMdaQRZpZUQYGxyAPIZJwQ":{"text":"I love this place. Repeat .. I. Love. This. Place. \n\nI've waited until the Blue Oak cravin","useful":2,"cool":1},"kYxaSFU3aP8nM54c6ixAjw":{"text":"If you are near City Park, tired the Jambalaya and gumbo, and in need of good bbq then eat","useful":0,"cool":0},"es9e7Y7qpjeVLwLE_3_6gA":{"text":"The place is so packed, which is fine but there is little bussing going on and idk who cam","useful":1,"cool":0},"9OAQr-CdQOV8yox8HXF9yw":{"text":"Second time here and while I'm not a huge fan of BBQ generally, I'm really digging this pl","useful":3,"cool":1},"_HcTuva4OVmdU2CzXcIuMQ":{"text":"Dined here last night with a friend after browsing through Yelp for some wings. Once you e","useful":0,"cool":0},"CdMFab18mu1ERaisrwrMHw":{"text":"3 of us decided to share all the meats and all the sides and we were so happy we did. Ever","useful":0,"cool":0},"rS-Y3SuoZaXLZcYMVD1QbQ":{"text":"Ladies and gentlemen, behold here with these words the satisfaction of the most satisfied ","useful":1,"cool":1},"VYmwUi8J1RL4AP0O-0NF9w":{"text":"My sister and I came here for lunch today. The food was delicious! We both had the pulled ","useful":0,"cool":0},"D-IlplPAH-GOvxoMSQFIxQ":{"text":"I am always impressed with this place. The friendliness of the staff is always 100%. I fin","useful":2,"cool":0},"y9lsGf6o461T3lQeBlR9Eg":{"text":"BEST BBQ I have ever had! The wings, brussels sprouts, mac and cheese, burger, just everyt","useful":0,"cool":0},"pSYn-44IiHKtYx-JrOQhYw":{"text":"Spectacular BBQ. I ordered the pulled chicken sandwich with no sandwich (gluten allergy ) ","useful":0,"cool":0},"5mE7HdLhWQVl8g0MhK0m_w":{"text":"The smoked wings are definitely a one way ticket to flavor town! Menu is a bit pricey but ","useful":0,"cool":0},"N2x-XLqSthkKJcGyw9NQcg":{"text":"Visited this location on Friday, September 14th at approximately 3:30PM after enjoying a t","useful":1,"cool":0},"6BGQWz2vvpA8E3sNp6aW9w":{"text":"This is one of my favorite BBQ joints. The chopped brisket sandwich with brussel sprouts i","useful":1,"cool":0},"RMNK7anQxz026CqAymK4lQ":{"text":"Stopped today to pick up a couple pounds of brisket and explained our disappointment with ","useful":0,"cool":0},"k5BkSoXeyDVd3WGEMCLa8A":{"text":"Blue Oak is the best BBQ in the city. I've never had any complaints about their food at ei","useful":1,"cool":0},"KBI3z3Bc0Th4kNMDgHu5BQ":{"text":"Some guy I just met and exchanged a few words with and biz cards just bought my lunch and ","useful":0,"cool":0},"YTU-SXjkK2c1tnGKIzUmbg":{"text":"There was a long line when we arrived, but it moved very quickly.  Matter a fact are food ","useful":0,"cool":1},"fwdqBnfan1oA0J4dCUAdUw":{"text":"Great BBQ and fun environment. We kept hearing that's where all the chefs go, so if we wen","useful":1,"cool":2},"dNzKHMTGC5XI_9bWoqf9Zw":{"text":"Been here twice & absolutely loved it both times.  Great smokey flavored chicken & brisket","useful":0,"cool":0},"btS18miPpdS_Gd_wfAQE7w":{"text":"Not bad, not great. Could be better. It's close to my house I eat there occasionally it's ","useful":0,"cool":0},"xO8B5AK3jrnG2B4LkQc1Wg":{"text":"This place was awesome when they were the bar food inside of Chickie Wah Wah and it's just","useful":0,"cool":0},"VSnpmm8Pte-m57fkJy-9sw":{"text":"Some of the best BBQ I've had from a restaurant. Hands down will eat at again and recommen","useful":0,"cool":0},"KAw4-2SNmo1XLpkKa-FrEQ":{"text":"This is the tiny kitchen restaurant inside Chickie Wah Wah's.  That alone makes it a good ","useful":5,"cool":1},"U8YCjmZzRAOl45I4KqJoOA":{"text":"Congrats to the boys for their own restaurant! This is my favorite bbq in New Orleans. The","useful":1,"cool":1},"q-5ut946axRyI4TbvBimGA":{"text":"I've been slowly checking off the bbq restaurants around the city. I heard amazing things ","useful":0,"cool":0},"e8fCigBXST1QkcPtTGp4mw":{"text":"Pit Viper was delicious!  Everyone should in our party had great dishes but You have to tr","useful":0,"cool":0},"6GI4dBNf0kq-fsogOAV_Rw":{"text":"Excellent pulled pork. We had the pit viper\nSandwich it was great. Maybe a little spicy fo","useful":0,"cool":0},"KPC5x3JWJka_8rg1jE7dIw":{"text":"Amazing BBQ, I would pay top dollar to get this shipped to Utah. Everything we ordered mea","useful":0,"cool":0},"XMmSiaPRD4c-27f16Ipyiw":{"text":"Had to give this spot a review.. The food is soo good.. I got the combo with 2 meats inclu","useful":0,"cool":0},"U3rP1fbMQ1nEFWwMjBGKdw":{"text":"Brussels sprouts. Period. Those things were so fangasm-azing that this should be the end o","useful":0,"cool":0},"8XWtPp1bfXmIkxAK73vb8w":{"text":"Why in the world would someone from Texas have to go to New Orleans to have quite possibly","useful":0,"cool":0},"9djUDq_ylLpW7uXVQRRT2A":{"text":"visiting New Orleans and came across this place. Had all meats and all sides. Great food a","useful":0,"cool":0},"71hJzNL0ktwzYpb9qWXD3w":{"text":"I loved it! I spent 5 years as a waitress in a barbecue place so I can appreciate some goo","useful":0,"cool":0},"lMe3JpmlpaoLBkZtohZ-Rg":{"text":"This is a solid BBQ place. I love that the meat is cooked WELL and does not need to be smo","useful":1,"cool":0},"Pca4pkG2TuN53VVdmNjgyg":{"text":"I wish there was an option for ten stars!!! I've ate at restaurant from boarder to boarder","useful":0,"cool":0},"C_dY4C8G_cg5wfTtKEs8Ig":{"text":"We were brought to Blue Oak BBQ by some friends also visiting NOLA..they had been here bef","useful":0,"cool":0},"e8J-OFyzf0neL8UpND9vag":{"text":"In a small building on the corner you can find some of the best BBQ in the city. It is the","useful":0,"cool":0},"IdtFd97lz1rYXi_d4r5URA":{"text":"Blue Oak for me is the in between of the Joint and Frey. Blue Oak has really good food, a ","useful":1,"cool":0},"frWSN7H48c7OVsrmWwi6Yg":{"text":"Everything my fiancé and I ordered was fresh and PIPING HOT!!!  he specifically came on hi","useful":0,"cool":0},"MrqooDgbsqss6SHQLRNwOQ":{"text":"Hailing all the way from Houston, TX, I have to say bbq is one of my favorites! Depressing","useful":0,"cool":0},"bjg3jJBNf_irhYXeNM6w_A":{"text":"We go here so often because my bf loves it but it truly is the best BBQ in the city. The B","useful":0,"cool":0},"ZJGRj1SD69a7aqTJojshCw":{"text":"My go to place for food when in NOLA. I never thought I would pay for BBQ because it is so","useful":2,"cool":1},"Hwpk1CsL8XwBtc9gqQPVIg":{"text":"They are truely showing off in here.\nBest pig in town.  Great food!  Take the trolley, enj","useful":0,"cool":0},"khfMGAhNXxs--wj7NrHg1Q":{"text":"This place definitely hit the spot!  We got the three meat plate with ribs, sausage and pu","useful":3,"cool":3},"ATP20ApK5oEqjo9rYFyENQ":{"text":"Love love love coming here! Tried quite abit from their menu already ie brussell sprouts, ","useful":0,"cool":0},"nGQIeIJHqp3s2aCAjGrIzw":{"text":"My very fussy BBQ family gave this a five star rating. We are from the heart of BBQ countr","useful":0,"cool":0},"cHhQN1HUM5D0xjbb2394ow":{"text":"Love this place. If you go try the brussel sprouts they are fantastic. They do close at 9p","useful":0,"cool":0},"QOQCyLE1VFXVTFRw3dgEew":{"text":"For me, the fried green tomato was the star of the show!  It comes on the chicken salad sa","useful":0,"cool":0},"sUvOMdJ4G1kiJ4xUWYtQJg":{"text":"After Corky's closed, my family and I were looking for a new BBQ place.  We found Blue Oak","useful":1,"cool":1},"_3UT2q5lM2RwMdrza6WoeA":{"text":"This place is pretty good. I love the mac and cheese and I love the brussels sprouts. The ","useful":1,"cool":0},"nIMJzJo1Jrn1OL9D6NSAYw":{"text":"Wanted to try some bbq before I go back home to Michigan. Did some research and blue oak c","useful":2,"cool":1},"4b4wUmc6Ajqqz_yhwlsnvg":{"text":"Wanted to try a different NO bbq spot other then the Joint, which does very good bbq. Firs","useful":2,"cool":0},"RRhpU-agZNR2EpJh75rOPw":{"text":"Awesome spot to chill out side and enjoy your BBQ with some great cocktails or good draft ","useful":0,"cool":0},"Jy0Xh-y5jAhD3HOr63LOQA":{"text":"I'm always being lured into overrated hipster spots. I will never understand how \"poor peo","useful":1,"cool":0},"PYMplDSr6eXPvjuXDtOEQg":{"text":"Awesome bbq with legit brisket! And Brussel Sprouts are to die for. Will be back for sure.","useful":0,"cool":0},"TF7yOiAtCESCHFAzEAcI5A":{"text":"Best wings in Nola by far, they simply have that slap! They smoke them which makes for a w","useful":0,"cool":0},"imzIYEb40PAA1M2Uc2ciUg":{"text":"The brisket and pulled pork combo plate was delicious.  It came with two sides as well as ","useful":1,"cool":1},"IPwcr1pgj8RIw-JMJUhU1Q":{"text":"Update: Within an hour of posting my initial review, I got a message from one of Blue Oak'","useful":0,"cool":0},"eGS7uYQUnBXxl5MUDOs8-Q":{"text":"This is my 1st time here and I was NOT disappointed at all! We had beef brisket, cheese bu","useful":0,"cool":0},"bsFqre00XWTomJVfoZC3QQ":{"text":"The sandwich was good but the sides were cold..... the outside atmosphere was pretty cool.","useful":0,"cool":0},"chFjy-TWrxh6lNMFmuOHIQ":{"text":"Been a few times and it's always been great and the specials are usually worth trying. Had","useful":0,"cool":0},"6RLu0JgxFRYthZ1_8Zj41Q":{"text":"Bomb ass place! Came here on a whim as I saw it from the street car on the way to city par","useful":1,"cool":1},"hkuRFGKkpf9J6hIml-NwPA":{"text":"Stop, drop, kaboom, this place is delicious! Inside the already amazing Chickie wah wah, B","useful":0,"cool":0},"1cAgivUvw0r_2zW7ZyuSUQ":{"text":"Wow this place is good.  The line is out of the door\n\nWorth the wait.  Great cheesy grit a","useful":0,"cool":0},"4Vwf1oLlvOppaXafP9V7mw":{"text":"Worth the Uber ride over to try this place. Very very busy so be prepared to wait a little","useful":0,"cool":1},"C0RYe391_7Q0bqNUjWHlbw":{"text":"I hate to write a bad review. However, I have to write an honest review and Blue Oak was t","useful":9,"cool":2},"_MwIs_DvdlcqgZabyDTEfQ":{"text":"Was definitely not disappointed. The brisket was perfection, and the Mac n cheese was exac","useful":1,"cool":1},"gH8kRCzrisTuil0LMdKP4A":{"text":"Blue Oak BBQ is a trendy, dog-friendly spot to indulge in the age-old tradition of washing","useful":0,"cool":0},"_L9Dcpyw0vntiRBv3nUpSA":{"text":"Blue Oak has amazing reviews not just on Yelp, but on other sites so my fiancé and I were ","useful":4,"cool":1},"tDHmQPgO9gh19cvLigyQgg":{"text":"Their smoked wings from their previous location had me hooked, and excited for the new loc","useful":0,"cool":0},"XSQ0JUx5ED5My_OPb4-fug":{"text":"This place rules. The food is just stupid good and everything and everybody is on point. I","useful":0,"cool":0},"-kYjmyEcifmmB2wAjM-PBQ":{"text":"The fatty brisket is absolutely divine - so tender and smoky and delicious. The ribs were ","useful":0,"cool":0},"O2hO3RQqizRj6kA9GTcGcA":{"text":"My fav bbq spot ! I love the set up of this place , the outdoor seating is so quaint. The ","useful":3,"cool":2},"_zahVWKZeD0zFnrta1sFXQ":{"text":"Two words.  Table service.  They could make more money as people could enjoy a few drinks ","useful":0,"cool":0},"LefabI85GZhqvxkpFTnRbw":{"text":"This is what BBQ should be like. The brisket sandwich with a side of Mac never fails! The ","useful":0,"cool":0},"4a8xYup43s9P5zIEHFjTZQ":{"text":"When I first walked in, this place reminded me of a really delicious bbq place in TX. It i","useful":3,"cool":2},"_uFhDzQPFDwO4mWc6HzuaA":{"text":"You know it's gonna be good when they ask whether you prefer a lean or fatty cut of meat. ","useful":3,"cool":2},"zS32MQb1Q6ua1kng8U2d5w":{"text":"The sides were the best part of the meal, except the potato salad. Don't get that, it was ","useful":0,"cool":0},"-hv6lIuTAKEHo4fmMcvOUg":{"text":"Some of the best smoked meats in South Louisiana from Texas to Mississippi. They have been","useful":0,"cool":0},"24g-tTDZpSDFnhvyblGRTw":{"text":"Best BBQ in the city!!! Ribs are amazing, make u wanna slap ya momma and ya grandma too!! ","useful":0,"cool":0},"6gEUPSZTOihx5ckOGsIIYw":{"text":"Love the smoked jerk chicken wings, but they are chintzy on the celery, only 2 pieces. The","useful":0,"cool":0},"876kxTSoJ9nb6f2tR2W3Fw":{"text":"Food was ok. Line was long but went on a Saturday like a dummy. I don't believe they make ","useful":0,"cool":0},"zFeLUSRFaX9UqDyVSnFfQw":{"text":"Business lunch was great here. Three of us split the All Meat All Sides plate and it is ex","useful":0,"cool":1},"suvcC9ewHEP_yIU1pHoEIg":{"text":"Yummm! I'm so glad we made the trek to this place as a side trip when we went to visit the","useful":2,"cool":3},"TK_hUa8zcKRnrRcyfvjh8Q":{"text":"Pro tip: don't walk from bourbon street to city park. You'll understand in a minute.\n\nFoun","useful":0,"cool":0},"LiWprwcU8W_so5M1lwM6aQ":{"text":"The BEST BBQ IN TOWN! Incredible service and awesome specials. I come almost every Monday ","useful":0,"cool":1},"txONNx-8ESRCy9O42VzRcw":{"text":"Where to start. First time to Blue Oak, we had the $58.00 all meats and sides. The 3 of us","useful":0,"cool":0},"99a-e2yti_I6egjFRufDSQ":{"text":"Okay people this place is AMAZING!! If you're looking for some bbq, go here!! We had their","useful":0,"cool":0},"Z2tzIvPJx5H0uuiuCOvWkw":{"text":"What a fantastic idea to have an amazing BBQ place inside a bar with authentic live music!","useful":1,"cool":1},"rWCY2k0RE2tSFRArPKjjiw":{"text":"Great barbecue and sides, good prices -- friendly and kind service. DH and I were out on S","useful":0,"cool":0},"lKbu6FUoToEECmGXvk3LTQ":{"text":"Ribs delish \nPotato salad was a bit different but delish \nBeans delish + had meat in it so","useful":1,"cool":0},"q_NM9GleC1W3hbL8TefnTA":{"text":"I am a spicy chicken sandwich freak and the Blue Oak spicy chicken sandwich (served only o","useful":0,"cool":0},"aDlTXWbcc3QLm90WRpwqHQ":{"text":"First off, best brussel sprouts EVER! Foodie tip: Do yourself a favor and dip them in all ","useful":0,"cool":0},"f1DYBbkrEkwj7gNiCVD5EA":{"text":"Every time I had a bad day with my ex roommate I would walk here for comfort food. I could","useful":0,"cool":0},"InDqG19Rao7oZBCuXrry1Q":{"text":"Great barbecue in New Orleans!? Had the chicken, ribs, Mac and cheeses, beans, etc. My 11 ","useful":0,"cool":0},"fU9FSSN6f6QiaHpYQ1F_JA":{"text":"Amazing! Loved the brisket and the pulled pork. Cole slaw was a bit dry. Beans were tasty.","useful":0,"cool":0},"J8fxizCTgKJCquztGE_9xA":{"text":"Was only in New Orleans for 2 days & ate here both days! This place is the absolute best! ","useful":1,"cool":1},"G_-kfLc-3By9Fxpr93hWYg":{"text":"We have heard so much about this place and finally after 3 visit we went for lunch! The fo","useful":0,"cool":0},"OxpKXETc9fu4GFdhctbVug":{"text":"The BBQ is awesome.  You must try the cracklins. This was my first time  eating here.  I k","useful":0,"cool":0},"7ExybaHLeVG3Zt_4wsrdEw":{"text":"I grew up in Kansas City, so I'm kind of a BBQ snob. Can a girl just get a burnt end?! BUT","useful":0,"cool":0},"QShfzdXLTyrwJDxy0AZlgg":{"text":"Don't come to NOLA for BBQ, don't do it to yourself. \n\nLocals would admit that New Orleans","useful":8,"cool":6},"tTpiiStFtlEhFCwzOxZqvg":{"text":"I would have given it a 4 of 5 for this second time around. What was very disappointing wa","useful":0,"cool":0},"Osc03-ZdmeEIrBCgjVpGFQ":{"text":"This place was right outside the city park so we walked right over. Got chicken, ribs, and","useful":1,"cool":1},"6gkOe2SBSoE8At6oq8tycg":{"text":"Excellent barbecue! I had the brisket sandwich with the brussels sprouts as a side. The br","useful":0,"cool":0},"mlNZyMgXc0ORL4Qvwrmg0g":{"text":"Amazing!!! Loved everything, brussel sprouts mac n cheese. Food is delicious I ordered thr","useful":0,"cool":0},"3HXwvY4IWcaezlEurVoudQ":{"text":"The days where The Joint was New Orleans' only good BBQ spot are mercifully behind us (not","useful":0,"cool":0},"wdd-lSd85zbwGZxnu8nZ7g":{"text":"This is probably one of my most favorite bbq places yet. I like the atmosphere And love th","useful":0,"cool":0},"hftslRqyusaMzQM_i1DlAQ":{"text":"Great value $4 margaritas (actually good) and $5 wine for happy hour. Solid smoked meats -","useful":1,"cool":1},"NdklexMI6Qj_lu9Md3OQ5w":{"text":"Friendly staff and good smoky flavor.\nParking can be a challenge.\nThe sauces are nothing s","useful":1,"cool":0},"9iwbSWQdhFBmvCgSbDLsQw":{"text":"This place was the MVP of my entire trip! My sister happened to spot it from the trolly as","useful":2,"cool":3},"lMMXoZGdM2EDZFzORCLPDQ":{"text":"Food was brought out pretty fast after the order. Baked beans, ribs and the pulled pork we","useful":0,"cool":1},"RM2UrX-sFxJo8X633V5OSg":{"text":"The smoked Wings are the best in the city. Wish they had a better beer selection but they ","useful":1,"cool":1},"1Hf8AGOBOvSzr3rFHXWclQ":{"text":"Amazing food! Wings cannot be missed! And as someone with a gluten intolerance they check ","useful":1,"cool":0},"Q7xLNZO_2d-MCBtGBbeHYg":{"text":":: Exterior: Easy to spot, lots of outdoor seating! \n\n:: Interior: Lot of Seating, Also Fu","useful":0,"cool":0},"1PV7kHOI5yvYCNEFp32DyQ":{"text":"Walked in 5 minutes before open(the door was unlocked,) and a girl cut me off at the door ","useful":0,"cool":0},"U9TJQ5w1P5ioyC8R6B7haw":{"text":"The food is amazing and the guys that work/own the place are awesome and super friendly! I","useful":0,"cool":0},"1XG0ksytRcfwfA6y3FZpvA":{"text":"Holy cow!! My friends and I stopped here on our way to Jazzfest and loved this place!! Sat","useful":0,"cool":0},"kmK5nyLBa61aLpmWgBCYMg":{"text":"With a down-home vibe, this Southern barbecue joint that serves specialty sandwiches, clas","useful":2,"cool":2},"FB6sAgP91_5TnStiPT1hOA":{"text":"Visited N.O. And saw this place had really good reviews but found it very over rated. Spok","useful":0,"cool":0},"2Y70KD2ud_UI35vJEA7HEA":{"text":"Tuesdays: spicy chicken sandwich. No regrets. Ever. I literally crave it & is the best I'v","useful":0,"cool":0},"FHEoBXPel3tfUYve5qrmkw":{"text":"This place was AMAZING!!!!!! Best Mac and cheese I've ever had and the burger is phenomena","useful":0,"cool":0},"Zv4Nb7T9uWy_rBAoU70KiQ":{"text":"Hands down my favorite place for bbq. My go to dishes are the brisket, cracklings, sausage","useful":1,"cool":0},"OB6wKG2UDkInKB5wfo5gQg":{"text":"Food Poisoning!  I had the smoked chicken salad and a few hours later I was terribly sick ","useful":1,"cool":0},"hD2EcvPyGNzmgzgzOKdkQQ":{"text":"Holy cow! BBQ is just not something that really crosses my mind in New Orleans. But I'm al","useful":0,"cool":0},"o80l3jQWS-aYg_zX-HbmrQ":{"text":"Amazing brisket good crowd great sauses. Best bbq ive had in a long time. Brussels and mac","useful":1,"cool":2},"A3b5aTV8j61bylRPrc8FSQ":{"text":"We are from California and we're tired of fried food.  Husband loves BBQ so I yelped a bbq","useful":0,"cool":0},"BsKSVH5pt7EcpdOpUonRNw":{"text":"Loved the smoked wings and smoked chicken salad sandwich. Yes, this is a BBQ place, but do","useful":0,"cool":0},"Gj-nC-zBXGwouw13bDqoMg":{"text":"Thank you Blue Oak! I've been in a relationship with the same wonderful woman for years no","useful":2,"cool":2},"Dm_0SHI9yC-Md8wesNe8-Q":{"text":"Amazing food. When you get there and order at the counter, get a number and sit down. Ther","useful":0,"cool":0},"8Wj4tSR6GlDEr74ypQTu5w":{"text":"This place was awesome. A bunch of my friends thought I was crazy for eating here instead ","useful":1,"cool":2},"XWWDOwrz8OKDR1nAVsOpZA":{"text":"I've not written many reviews, but this is the best bar b que I've had in New Orleans.  I ","useful":0,"cool":0},"dQ3LCXwr15kDGEGu2PQi4Q":{"text":"Hungry and bored on a random Wednesday, I looked to Yelp for help on where to eat in mid c","useful":0,"cool":1},"xcxhmKr2LMcErrrUVD_BZg":{"text":"I would have given it a 4 for this second time because what I ordered was good. What was v","useful":0,"cool":0},"K8NfYqTDuu0WwFmg8pLaEA":{"text":"I came in because of the great reviews, but now that I've eaten there I'm surprised this p","useful":0,"cool":0},"y3ahIaQtzhAt_nD4Vz2Gfw":{"text":"Blue happy hour is the best. I love their wings and brisket. I'm slowly working my way thr","useful":0,"cool":0},"k--9yDckladeCMWDSCLHIA":{"text":"Came here for lunch on New Year's eve in a party of 5. The place was quite busy and crowde","useful":0,"cool":0},"FRtV2TEAJ0bx38hYPCLdaw":{"text":"Love the hot chicken sandwich on Tuesday. Every other day is good too. Nice happy hour spe","useful":0,"cool":0},"7bpEoy7ogcs6VosuJtfc1w":{"text":"First time to this location  and will not be the last. Hidden place in the neighborhood in","useful":0,"cool":1},"LiZQC5d1rJHCJM5Zhjf02w":{"text":"I was quite reluctant to try Blue Oak but some friends convinced me to try it. I was pleas","useful":1,"cool":0},"kANd1DnXFPwTG-Mu7xbQHg":{"text":"I am never disappointed when I come to Blue Oak BBQ. Food is always excellent and the staf","useful":0,"cool":0},"-prIK6Sgm0tDlqIdys0XDg":{"text":"We were visiting from Albuquerque and looking for a lunch spot, so when one of the locals ","useful":0,"cool":0},"qbPzXMlNlZxZQRrRl-ozGw":{"text":"Really good! Love the happy hour specials - $5 nachos and margaritas. The sauces are reall","useful":0,"cool":0},"srkqSMM5VgnLJ4ARGxFCXw":{"text":"Found this bbq driving around the city look for bbq and it was just as good as it looked! ","useful":1,"cool":1},"Op4qHlRJI7G8NmoXUZR1Lg":{"text":"SOLID. Good portions, good pricing, and good food. Everything on my plate was awesome. The","useful":1,"cool":1},"shkhVOw98hqwLw-LpvLBhQ":{"text":"Visited the blue oak today I had the burger was delicious wife had the chicken and ribs th","useful":0,"cool":0},"DpoW6iaSKfPYMS2koG4aKA":{"text":"We stopped here after church. The place was not opened yet so we waited in the car. \nWe go","useful":1,"cool":1},"_3Ac8sZmYHf3axlwgM6fBg":{"text":"The food is very good, the atmosphere is very NOLA, and the staff is doing a great job wit","useful":0,"cool":0},"eaFohXNi8xMhfMkbQMfvaQ":{"text":"Spicy chicken sandwich w/  Brussels sprouts and gumbo+potato salad\n\nThis is the 2nd time I","useful":0,"cool":0},"X3Q4mDul2mC8t_cpKjKjSw":{"text":"I was visiting New Orleans and found this place on yelp. I love bbq so I have this place a","useful":0,"cool":0},"zKjJmlkCxdWXc7M3dHRpfw":{"text":"I love this place. The food is always amazing and fresh. I especially love their sides whi","useful":0,"cool":0},"IcEELBPZZlFWVFrdwPIEvA":{"text":"The brussel sprouts are AMAZING!! I always get the 3 meat platter because they're all too ","useful":0,"cool":0},"Xyir_i1FXL_WhTVr6LcJPg":{"text":"The portions are a good size two could split. There is a lot of seating inside and outside","useful":1,"cool":1},"_EYjrhR1sZ0Jpvz2pCAqNw":{"text":"As soon as you step out your car your nostrils are greeted by the wonderful smell of smoke","useful":0,"cool":1},"AT3Lh_tR6b9_FDgBcwan6w":{"text":"Ordered sliced brisket. The crust was salty and had too much pepper. Selection of sides wa","useful":1,"cool":0},"Htox8f9j6QeCBB6KY1ncMQ":{"text":"Went on a trip to NOLA and searched everywhere for good BBQ. Awesome atmosphere, great for","useful":0,"cool":0},"SLm3-1cAAB2ekpsNTZWghQ":{"text":"Have been twice , first had the burger, it was good but went back for the chicken sandwich","useful":0,"cool":0},"Yo2UVcCNuL96PtN_AasezQ":{"text":"Tried this place for the first time tonight. I've lived a few miles away for years and jus","useful":0,"cool":1},"lhiAmPjVskDp324-FUzsUg":{"text":"Who doesn't love the meat sweats lol. Friendly staff and fast service. I also really love ","useful":1,"cool":1},"Bewsgutkru4osLh1kFsIzg":{"text":"We were visiting New Orleans for my birthday, and Blue Oak happened to be within walking d","useful":3,"cool":1},"0repHxg0yhd5wT8CfW1kTw":{"text":"As a Memphis BBQ fan, I was skeptical. But I left a believer. The combo plate is certainly","useful":2,"cool":2},"hOuORcQ5M7u2wC6kXtITAw":{"text":"Check this place out for Happy Hour! The jerk wings $6 are killer and so were the nachos $","useful":1,"cool":0},"p-7LmZsyjNT1fXepYDdgsw":{"text":"Love this place! Finally got a brick and mortar versus serving bbq out of a bar! Finally g","useful":7,"cool":3},"I1nJjicpN5WHsiJ_CyyXRw":{"text":"So instead of asking for extra sauce I bought a $10 bottle of spicy carolina sauce. HOWEVE","useful":0,"cool":0},"CcUg6cR9Cs9h4WaVjazEJA":{"text":"My praise goes to Ponder! My catering event, though small was stressful and I appreciated ","useful":0,"cool":0},"KN_Vu0-Coqcc4pf6G2ij3A":{"text":"Brisket was amazing fatty and delicious. Ribs were too dry. I love the brussel sprouts and","useful":0,"cool":0},"bXe16_kG24mOzyL3x9XMyQ":{"text":"In a nutshell....greattttttt bbq spot. Definitely worth trying out. I had their jerk wings","useful":0,"cool":0},"BiyhEb8s89TaKoyYDKhngw":{"text":"The food was good but I have a gluten allergy and the staff did not take it seriously. I w","useful":2,"cool":0},"b2Pyxp_gX9_eGnliAWfd8A":{"text":"Best bbq I've ever had!! The Brussel sprouts and Mac and cheese are amazing and the chicke","useful":0,"cool":0},"TxwZYr-fxnLzUMuIgegsyA":{"text":"My husband and I were surprised to see that they had an option to purchase ALL MEATS and A","useful":0,"cool":0},"WeRDOdUshvcPtEuer6Fxdg":{"text":"Literally one of my favorite food places in Nola. The food is so delicious and every visit","useful":2,"cool":1},"JUD_uhG6QWavugmd7Xcayg":{"text":"Kat is a great bartender!!  She told us to grab a seat instead of standing line.   She kne","useful":1,"cool":1},"iNBDrvSVT304X_s4PSJZsg":{"text":"This place is ridiculous! Soooo good! The flavors, unexpectedly, all work, regardless if y","useful":0,"cool":0},"TBlvhp6syQs3O0GX2CceQw":{"text":"After days of eating beignet and tons of seafood, we were craving to eat some BBQ meat, si","useful":0,"cool":0},"biWH0Qn4ZM8ATUoCouaxkA":{"text":"The service is incredibly fast (sub ten minutes for app and food), good drink selection, f","useful":0,"cool":0},"q4Da1YcV335OzbgCcpE64A":{"text":"My favorite bbq spot in New Orleans. Happy hour is great. My favorite apps nachos and wing","useful":0,"cool":0},"kb1Jv1s3SFubOJ-ezx1HSQ":{"text":"This had to be some of the best BBQ I've ever had, though I'm speaking from a NYC perspect","useful":0,"cool":0},"vPQSgFndD0yWr3_sTw6p4Q":{"text":"Line moves quick. Large portions. Pork and rubs had good flavor. Good sauces except Cajun ","useful":0,"cool":0},"YFh4sFvj_r3a2eLp4ieobA":{"text":"First time trying. Got the 2 meat combo: ribs and brisket with Brussels and max and cheese","useful":1,"cool":0},"cpWlpkglO-9IAZ7CkbrA6w":{"text":"I'm really not sure why it took me this long to get here but I made the executive \"lunch\" ","useful":2,"cool":1},"vqVq1BTo1_fcyr45hS0H3Q":{"text":"Best BBQ in town! Hands down!\nAmazing daily specials but be swift, they run out quick! San","useful":0,"cool":0},"Vf0ISNHMT7_MyGcvq5TbZQ":{"text":"This was my very first visit to Blue Oak. I ordered the All Meats All Sides platter. Let's","useful":2,"cool":1},"rBiUP_cp__gK4LDEMrIdww":{"text":"Some of the best bbq I've ever had! Wish I had photos but it was so good we ate it quick. ","useful":1,"cool":0},"yDw_DXmPMgTNP-UdsM7mGg":{"text":"Def the best BBQ, or really any food, in New Orleans. I have tried most to all of their sp","useful":0,"cool":0},"EyH46DQvrltC5H-jw5h9ow":{"text":"This place is fantastic! The food is pretty incredible. I'm going to have to figure out ho","useful":0,"cool":0},"sy1mRemrhZXVcUUdJ7_Lew":{"text":"I will give these guys credit as it is hard to find BBQ much less good BBQ in Louisiana. I","useful":0,"cool":0},"6ZSNYqswB8UEH5Cr6dzrXw":{"text":"Delicious & Cool Vibe! My husband loves this place! And the specialty daiquiris/fruity dri","useful":0,"cool":0},"P2MzD7ZgxxrjnTQERdXA1Q":{"text":"My favorite part was waiting in line to order and watching the guys handle the meat. I cou","useful":3,"cool":2},"l9hYCpqtbnreRqyL7uRyPA":{"text":"Completely surprised about the food. It was so good. My mom is absolutely the pickiest eat","useful":0,"cool":0},"tYRkDmzcUZVe_HXzdLwrKA":{"text":"This place is a very popular bbq joint to eat at. This isn't your average bbq place. I was","useful":0,"cool":0},"4AADqaRIEXAxp3NwUbVVrA":{"text":"Such a solid place. These guys do it right. Top notch BBQ with all the fixings! Even if yo","useful":2,"cool":0},"cWcm0nIh4VL3dnrC3rRDdg":{"text":"This was on our list of must see restaurants when visiting NOLA and it did not disappoint.","useful":1,"cool":1},"HkvGMWBDtEzwc13jWJQQOg":{"text":"I have eaten here many times. I throughly enjoy the brisket and the sides of the Brussels ","useful":0,"cool":0},"Dlxe6QoC8km9i36j3pQtlA":{"text":"This is a really good restaurant to eat BBQ if you are visiting from out of town.  I am lo","useful":0,"cool":0},"mLtaXek9v4sJpiut5wihqw":{"text":"I recently visited New Orleans and had to stop by Blue Oak BBQ for my second ever visit be","useful":1,"cool":1},"Nygkw5MwnnPAat1kOUZ_Sw":{"text":"Soooooo good. I got the combo plate with brisket and ribs are they were delightful. Make s","useful":2,"cool":2},"1VCLohrdbUuPTYkaW19MbQ":{"text":"We ordered the Doobin Lubin sandwich with pulled pork, sausage, slaw, onion, pickles and b","useful":0,"cool":0},"d87HML77HwayNs0QXveGVQ":{"text":"Some of the best bbq in the city love the brisket my family got all meats and all size and","useful":0,"cool":0},"y_hYWzg5YBf9Qt6baqqclg":{"text":"This is certainly some of the best BBQ NOLA has to offer. \n\nCame here for lunch during the","useful":6,"cool":3},"6dcID3pRA_cxE-h3sMVDXg":{"text":"the smoked wings are to die for oh my goodness. so much crunch and flavor on them! would d","useful":0,"cool":0},"oE_X_RRfSm7Ob5ktDSONHg":{"text":"I'm sure the food may taste good, unfortunately I never got the chance to find out. I will","useful":0,"cool":0},"9xY8alIx0rhHwDacxlcfLg":{"text":"I know what you're all thinking: Sarah, why do you keep trying BBQ joints when you don't e","useful":1,"cool":1},"dzpqsWMg5N60xtIj4JFbAQ":{"text":"Food was delicious and came out quite quickly considering 4 of us ordered BIG plates and t","useful":0,"cool":0},"7KTGNpSfB0sJmLasUaDrgA":{"text":"Stumbled up on this place riding up Carrollton. Good bbq not the best I've had but if your","useful":1,"cool":1},"ezkyqlMMus9qcr-oyyA9jg":{"text":"Best BBQ in New Orleans! With great outdoor seating. My favorite is the brisket with slaw ","useful":0,"cool":0},"1mHJ_yPINOiAWpZlt0llEg":{"text":"Some of the best BBQ in the city. But what truly keeps me coming back are those darn speci","useful":0,"cool":0},"GyCoBdsNUX7-nF0ex4oh5w":{"text":"Coming from ny u don't get food que unless it's mighty Quinn's bbq. Sooooo dang good I wan","useful":0,"cool":1},"VxuBFzKQ9KyKHAZec-tUyw":{"text":"I've never had anything I didn't like here! Amazing food! Their spicy chicken sandwich on ","useful":0,"cool":0},"nP1rMV4XMF2xXgZOfiK3Dw":{"text":"Great barbecue. Everything I had was delicious. It's a little on the expensive side but ev","useful":0,"cool":0},"ahZCI7S98jOmfFxm56Vijg":{"text":"This place does not disappoint! The HYPE is REAL!! Actually been here a number of times an","useful":2,"cool":2},"2vdmk1WfIESf0faIUB4rdg":{"text":"Blue Oak is by far my favorite place to get bbq. The brisket is by far my favorite on the ","useful":1,"cool":1},"aHP-9AtmfQfdoSccz3fF0w":{"text":"We ordered online through the link in their Instagram bio, food was ready 10 minutes later","useful":1,"cool":1},"fXwzr9IuS4zAsZwOVfTkNQ":{"text":"Very nice restaurant but I ordered my meet cooked medium and received almost raw meat. I c","useful":0,"cool":0},"fdu7yfM7RC1iFJkNhd8xXw":{"text":"Best BBQ and smoked meats in New Orleans. Their sides are in a different hemisphere compar","useful":0,"cool":0},"N2DxQPgi0mZbSBqoXsdJqA":{"text":"Wow. Just wow! The wings are awesome, the ribs are so tender and juicy, and the sides are ","useful":1,"cool":0},"G0glcWBiMpFRG_K_r4_YcA":{"text":"Love this place!  Everything I've tried has been delicious.  I especially love the Jerk BB","useful":1,"cool":0},"hs0NxrlmnFC2aAFZHlMD0Q":{"text":"Tuesdays become the best day of the week when it's spicy chicken sandwich day. I could tak","useful":0,"cool":0},"tnAHtqVOjKPURXGUHEDG0A":{"text":"Have eaten here twice before and had better experiences. The staff was very kind and helpf","useful":0,"cool":0},"R9wruRQEgHpFZ2wO2iQhHw":{"text":"My favorite bbq place in New Orleans . The brisket is juicy and crusted perfectly . The si","useful":1,"cool":0},"g5c4qKdgE8zjaPEAifmlkA":{"text":"Blue Oak BBQ is essentially a take-out window inside the music club, Chickie Wah Wah. It's","useful":0,"cool":0},"5737172pzFVqkfrifuRCSA":{"text":"Excellent food and service. Snuck in right before the Saints crowd arrived. Ordered a 3 me","useful":0,"cool":0},"ixkFnkHakCpexRFJVcOpog":{"text":"Visited the blue oak today I had the burger was delicious wife had the chicken and ribs th","useful":0,"cool":0},"KztMFn5wy6UJXRFrCH_bbg":{"text":"Great Food Happy Hour during the week! Can't wait to try their crispy Chicken sandwich tha","useful":1,"cool":0},"mnypNZ1dozy1mhFUFS3lNw":{"text":"Blue Oak always has delicious meats.  Pulled pork, lean brisket and burnt ends are  some o","useful":0,"cool":0},"KGvkJRj3apzhgtvxqSlupw":{"text":"Amazing- everyone should stop here while in NOLA. Good portions, great selection, tasty co","useful":0,"cool":0},"hu-62VtWqjrkf38ZU0uKaw":{"text":"As I have noted in other reviews of barbecue joints in other cities I'm a bit of a critic ","useful":0,"cool":0},"095kjqe1vKvorKtgj9vCTg":{"text":"Great BBQ must have, food came quick great experience, nice outside eating area with fans ","useful":0,"cool":0},"4myP-jP-VpgCQlW1c3dHFA":{"text":"After hearing so much about Blue Oak I finally got to try them by getting a couple of to g","useful":0,"cool":1},"qDE-puTFk0W7KeYdeOvqtA":{"text":"Cannot say enough good things about this place. Everything here is SO GOOD. The brisket is","useful":0,"cool":0},"dYuXPpTx8N4Z-KDvJ3ESrw":{"text":"Wow. Some of the best BBQ I've ever had. It kills me that I can't get this at home. Worth ","useful":0,"cool":0},"Q5VIZrgVhPbHN5P10w8u_g":{"text":"Absolutely amazing. Probably the best if not second best barbecue I've eaten in my life. W","useful":0,"cool":0},"8pcNniY4YfssvJWDWEHVbA":{"text":"haven't been since they moved, but it was killer on canal st.  The food was good, small, a","useful":1,"cool":1},"d5aQ2cU_ZCA84qkH7hextw":{"text":"Cute spot, heavy BBQ. Very sizable helpings. This place is best enjoyed in the summers whe","useful":2,"cool":1},"sUMKLgoFAexL9-otoHZTLA":{"text":"Yelpers! If you check in here, you get a pretty cool Koozie. Yes, I said Koozie, there is ","useful":0,"cool":1},"u7sJMjzgDvqxq_MFlQ3W3A":{"text":"I've been wanting to try Blue Oak BBQ for a couple of years now. I figured I'd give it a t","useful":0,"cool":0},"HyXaRIhUcUKlGiyVlWesRA":{"text":"Blue oak is never a disappointment!!! One of the best BBQ you can get in the city. A few o","useful":2,"cool":2},"KvG_QWJjUqa43itmonpT6g":{"text":"Mark is the skinniest and best bartender in mid-city!  Plus the BBQ rocks!!! This is my go","useful":0,"cool":0},"mSlNPgrAG3lsmPC6Kyv43A":{"text":"During these hard times that we are dealing with. Where we need to social distance ourselv","useful":2,"cool":0},"jR79R9gVGzkHhA5qXt293g":{"text":"The best bbq place I've ever been too. I highly recommend this place if you are ever in NO","useful":0,"cool":0},"thwzagRDyl8GVq74gGl7WQ":{"text":"This place definitely deserves 5 stars. If you are one who feels most comfortable sitting ","useful":0,"cool":0},"dpi6Vn-kJBmVXyPhMT-apg":{"text":"I've been here a handful of times, and of course, they never disappoint! From the brisket,","useful":0,"cool":0},"OFC_5yoTmsKMp2VXL5EZEg":{"text":"This is the worst of the new barbecue restaurants in the city. The brisket I ordered was p","useful":0,"cool":0},"Rtgn-QH2_xe2fPQbRPbIVA":{"text":"Great bbq place in midcity! I got a bbq chicken sandwich with a side of Mac and cheese and","useful":1,"cool":0},"ecdTMpWaKn6fk71X_eJqfA":{"text":"Amazing BBQ - the ribs, cracklings, brisket, wings...wow! We love ordering take out from h","useful":0,"cool":0},"MVGkZ-gc_QMUZP1gm6qRsA":{"text":"If you like Texas style barbecue, this is your spot. Other BBQ places in the city are good","useful":0,"cool":0},"vU5xYd8hnlk70h0_vTUObQ":{"text":"Went to Blue Oak for a birthday celebration. It was easy to find and we got (what looked l","useful":17,"cool":15},"sKm2ABrYDnuXaf6BUoTiyg":{"text":"Probably the best BBQ I've ever had. I had the pulled pork. The smoke flavor is perfect. T","useful":0,"cool":0},"OfZVdQ_spyAivPg26bnSCA":{"text":"Visiting from Cali, decided to see what Nawlins knows about smokers and grills. The briske","useful":0,"cool":0},"ioQTcKN6cv0I8tSIqDgA8Q":{"text":"WOW! After receiving many recommendations about this place I can honestly the hype is wort","useful":0,"cool":0},"Td2ZcQmEq04UIDf210cJRA":{"text":"As a foodie, I don't understand the hype about this place. If people were just looking for","useful":0,"cool":0},"tXWF-JCNlLgvVTZI97ixhw":{"text":"Got the viper sandwich, jalapeño poppers, jerk wings, nachos, and pulled pork sandwich. Ev","useful":0,"cool":0},"v87_bGXlidX0o3zksLzUbg":{"text":"THIS PLACE IS SO GOOD. I'm a good ole southern girl from Texas and I know good bbq. I am a","useful":0,"cool":0},"hlvR0DSxs6oX8mpIXCIrBw":{"text":"Amazing atmosphere, food and service.  The brisket is amazing.  I would definitely recomme","useful":0,"cool":0},"1dNLFJROPLaPkR8dSsKsgQ":{"text":"On a mom and daughter lunch date, on a lovely Sunday, I took my mom here. She loves her bb","useful":2,"cool":1},"F6f7rWgAQAL3HODtQPVC_Q":{"text":"Finally got the chance to try their new location (I'm pretty late). The vibe here is cool ","useful":6,"cool":2},"3Tm1IHrv-uYn2ynw-6meSA":{"text":"I can not speak highly enough of this place, but I'll give it my best. This IS the best da","useful":5,"cool":1},"HVk-TQbKS8OrMBeTj1u8GQ":{"text":"They do it and they do it right.\n\nThe food is great, but I think they could user a bigger/","useful":0,"cool":0},"lDBjpz0GeIkgRhDiSmIpww":{"text":"my favorite happy hour in new orleans. the 5$ nachos are crazy good. and the smoked wings ","useful":1,"cool":0},"KsRy23UWGgbKrLONnGOm4w":{"text":"Their BBQ is out of this world! The brisket was so flavorful and the ribs have a delicious","useful":0,"cool":0},"zexVeob9tR47Ms79B4w8bg":{"text":"Delicious food! Pulled pork and brisket were tender and flavorful. Brussel sprouts are a m","useful":0,"cool":0},"sr2CXsW1-bHihg_jgQXGmA":{"text":"I'm from Los Angeles. Found this littke gem on vacation after I got lost walking. So good!","useful":0,"cool":0},"odpyMQllk2KQbDSA1ot-ow":{"text":"Pretty good BBQ. I'm not a sauce gal so I liked the way my food came out. Ribs were tasty ","useful":0,"cool":1},"abwctCaYERHK0HUinK4eow":{"text":"I came here with my girlfriend about a month or 2 ago.  I had anxiety about writing my rev","useful":17,"cool":14},"5rg16gPiWzG4UbqWs4GCCw":{"text":"Place was okay. The hostess attending to go orders was not very pleasant she seems a bit r","useful":0,"cool":0},"60cSrqvIypGFHPO-ea3R9A":{"text":"I was VERY apprehensive to try this place out as I am such a huge BBQ snob that I am RAREL","useful":0,"cool":0},"38h80VVK2rQPX7_vHEoPjQ":{"text":"Blue Oak is probably New Orleans' best bbq spot. Their brisket is really good but not cent","useful":0,"cool":0},"KF5FSb-fKXBKNwyybOoSWg":{"text":"Food was great. And considering how busy they were and how challenging this time is, I onl","useful":0,"cool":0},"FiK4bbYn-Mc8lWVByYipyg":{"text":"I was really looking forward to this place. The staff was helpful in navigating their menu","useful":0,"cool":0},"lwbFldwebZwmALSKM5TA2w":{"text":"ooh OOOOOH! That's what this joint will make you say as you take your first bite l. I got ","useful":0,"cool":0},"A_PQ3m-zZ5uOEBKmMLlHDQ":{"text":"I'm forewarning you,  food coma incoming.  We got the all meats and all sides. The food ca","useful":0,"cool":0},"EBAcFsVMajH50apXfEgGvQ":{"text":"The brisket and Mac and cheese and Brussels sprouts are my go to! Definitely the best! Hey","useful":0,"cool":0},"dCzwcym0CBEMHaW8MfWHDg":{"text":"I highly recommend Blue Oak BBQ. We had lunch here on a Saturday and the food was AMAZING.","useful":0,"cool":0},"ewO8Us6n2sBsxUxrKmunOw":{"text":"Food is decent. I always go for the beef brisket at any bbq place. You have to ask for the","useful":1,"cool":0},"EO2aR_aO9sal8zAW29qLcQ":{"text":"(Trying new restaurants) my nephew have bragging about this place for a couple of weeks, s","useful":0,"cool":1},"5l-gG_d6R5Wykr4DcerhuA":{"text":"Food is great (if a bit pricey). I usually get a few different meats and ALWAYS the Brusse","useful":1,"cool":0},"VgsmZUegWgFqe2hwyIpFQw":{"text":"Smoked wings, brisket, ribs and pulled pork..... yummm. All specials are top drawer! Keep ","useful":0,"cool":0},"na6HveMtZLBrzG8Cq7FYXQ":{"text":"This is the best BBQ in the city.  The happy hour wing special is great.  Can get crowded ","useful":0,"cool":0},"Ip8O3n5C31_b0qDu-dFHRg":{"text":"Amazing BBQ, wonderful setting, friendly staff and great food. Everything was reasonably p","useful":0,"cool":0},"Ty16BQQeJicJiFXeccX1Aw":{"text":"this meal was absolutely incredible. the egg rolls and dipping sauce were to die for. the ","useful":0,"cool":0},"0XWtUoiriJbOKVxF6Wx41A":{"text":"Best food, best service and reasonable prices! Checkout the happy hour foods and drinks, y","useful":0,"cool":0},"iP5IwjgD6-uEe7ZrHwHF9A":{"text":"Best BBQ I've had in the New Orleans metro. Kansas City style brisket, Memphis pulled pork","useful":1,"cool":1},"d11xp5s-NZ913b7mqEr3FQ":{"text":"Very very good bbq. Only negative thing was the sauces. They were incredibly mediocre for ","useful":0,"cool":1},"kUVmG75PJ65EgvmqNpNKZA":{"text":"I usually don't eat at many BBQ restaurants but I was feeling like so.ething different and","useful":0,"cool":0},"rqQoWtta4E0AdbDa3AKXQw":{"text":"The best BBQ outside of Texas! EVERYTHING is so delicious! We always order one of everythi","useful":0,"cool":0},"rHQVbMwwPxxTvT11mM4B2A":{"text":"Wow. We saw this from the train on the way to the museum and said we have to stop and try ","useful":0,"cool":0},"LU4csTZPD78UVpeM5lsD2Q":{"text":"This was my first time visiting and it was amazing!!! I opted for the two meat plate with ","useful":6,"cool":2},"Db9Tu2ksInoqBn8nElpr_Q":{"text":"It's okay. Not my favorite food bbt it's not too bad either. I love the outside tables and","useful":0,"cool":0},"DqKX5CN2_NMM3Wh-D0dyMg":{"text":"Let's just say I have been here 3 times this month. The chicken is phenomenal. The second ","useful":0,"cool":0},"iWE2wzZbm5xyPXHOwgZxEw":{"text":"This is the best BBQ place in New Orleans by far. I'm from Tennessee and my wife is from T","useful":1,"cool":0},"5P6B7dvpFIzkHza_AvkQtA":{"text":"I'm only offering a review of my husbands order. I'm not a lover of bbq as much as he is. ","useful":0,"cool":0},"mO3yoEs06lGn9uxWBWggAw":{"text":"Crazy fast service and absolutely delicious food!","useful":0,"cool":0},"2YxB0OtZo6W-xU4EEIoe2Q":{"text":"Wow, if you're looking for some GREAT BBQ, look no further! (Just check the pics people ha","useful":1,"cool":2},"d5zbvcRoeOG_pUmqnr2hTw":{"text":"Ribs, chicken, sausage, potato salad, slaw were all tasty. The sausage and chicken were my","useful":0,"cool":0},"lIJsXOWtJheNVhIMQ9Qd5g":{"text":"One word:  yum!  \nMy husband had the hamburger, which was a huge patty, had grilled onions","useful":4,"cool":1},"eJyO--hPGykf1K0R-S_bZA":{"text":"Funny that I write this review now since last time I was here was 4 years ago. I moved to ","useful":0,"cool":0},"4jz_WwH0Qt1ZgJlsa08TQA":{"text":"First time visit. Arrived 10 minutes after opening. There was already a line to order. And","useful":1,"cool":0},"B9K6dQBCVpDlVcDEkuyefw":{"text":"The combination plate with 3 meats and 2 sides was a hefty, American portion. I got briske","useful":7,"cool":5},"ZKFYI-pEF84kMv84kaSfHA":{"text":"I had the opportunity of trying the spicy chicken sandwich and the Fried Chicken Festival.","useful":1,"cool":0},"9cNpRY6QWtwF_0Bi0C9-EQ":{"text":"Can't say enough good things about blue oak. Everything is always good. Love the Brussel s","useful":0,"cool":0},"PIjiE0fV54zcr6uuZdWGCg":{"text":"I'm not even a local , I live in Houston , but you best believe when I'm out here and I'm ","useful":0,"cool":0},"4efTkFDLHRLxV4orfLn50g":{"text":"As a New Yorker visiting NOLA for the first time - this is by far the best BBQ I've ever h","useful":0,"cool":0},"xJuOYuD1xji-7_BDJ_Gv1A":{"text":"blue oak is seriously that good. the bbq sandwiches are amazing. my favorite is the pit vi","useful":1,"cool":1},"Q-rE2IwJ0ha9bQUxs6XzzA":{"text":"first things first, great atmosphere. such a cute place, also not too crowded. great outdo","useful":0,"cool":0},"BfQBmV0MKLiZdOXA2lbV_w":{"text":"Fantastic bbq joint in mid city New Orleans! This spot has got it all. Great meats, great ","useful":0,"cool":0},"HbOmHInr4siSjLYGXVt_xg":{"text":"Pulled pork, Brussels sprouts, Mac and cheese, wings with jerk sauce!  It's all awesome!!","useful":0,"cool":0},"HfJyePGcoCm4P3oQ1hN7hQ":{"text":"Great smoked brisket and pull pork nachos. Wish they had full service table service. Staff","useful":0,"cool":0},"PNXr7s2b24vyvht9-RPSKQ":{"text":"Don't ever order the smoked BBQ burger. The cheese is cheap. The bun is small. The carmeli","useful":0,"cool":0},"yPU-BbEdLne7YbDycnm5mA":{"text":"During Covid they kept really good safety measure, I'm glad they are now open for dine in.","useful":0,"cool":0},"NXUKbPrGGl5qqMClKbuo3w":{"text":"The BBQ was really good & so was the brussel sprouts & garlic mac & cheese. The staff was ","useful":0,"cool":0},"NuX-cPmB_XX8z9_N9UwU_w":{"text":"First of all...IM LOCAL\nsecond of all Blue Oak is my favorite in the area!!!!\nThe prices c","useful":0,"cool":0},"F93GWug9AkmPPJ-rfqo_9g":{"text":"My favorite spot to get bbq from ,good prices great food I usually go with the 3 meat plat","useful":0,"cool":0},"MsDVK9q9YtJKCXpdBmO4FQ":{"text":"Finally made my long anticipated first trip to Blue Oak BBQ because I was in the area and ","useful":2,"cool":0},"mhdWycQX0m7hy_cTMstyZA":{"text":"Usually a Blue Oak (BO) regular but this past experience was atrocious. \n\nCOVID Feedback: ","useful":1,"cool":0},"y2Ci3TT_GD22M50Gkd7GYw":{"text":"This is probably the best BBQ place in New Orleans. The line may be long when you get ther","useful":2,"cool":1},"3vDxLwdQq9OChKhc0lbsvQ":{"text":"Everything is so delicious. Wings, pulled pork and ribs. When I'm New Orleans this is a mu","useful":0,"cool":0},"EiuR98sNchjmJBuRCgLZzw":{"text":"So, I'm vegetarian but my partner is not. He loves the bbq from here. It is pricey but wor","useful":0,"cool":0},"SgxXa3XllsLbrUTT_J0UvA":{"text":"Was in NOLA and wanted to try a new BBQ joint, and a friend had recommended Blue Oak.  We ","useful":4,"cool":1},"V1NEo8Rnc4uECAvHKZo6Ag":{"text":"If you are any fan of baked beans, order them here. They are excellent. The sauces are few","useful":0,"cool":0},"PoDSGpcUkHi_2qPJU8U6Nw":{"text":"The food here is absolutely amazing.  It's located inside the music venue Chickie Wah Wah,","useful":1,"cool":1},"OqsCLplTFIVMe5kEbsfvUg":{"text":"Good atmosphere and good food. Not the best bbq I've had thus far, but definitely one of t","useful":0,"cool":0},"vlbF7BCAgnesDXvf4jACKQ":{"text":"Hands down, the best bbq I have put in my mouth. Portions are good sized, and I highly sug","useful":0,"cool":0},"pomH8BwJmCtWLacpor-Byg":{"text":"Just consistently great food across the board all the time. That's the review. Send it.","useful":0,"cool":0},"-fnTtkXS6mAe_LGQmZZiWw":{"text":"My SO and I came for dinner one night because we wanted to try it out.  I hate to say it, ","useful":1,"cool":1},"nM1JAe-7tSXzPEzOpjQ5gA":{"text":"Covid 19 Update:  Since my last review (2015!) Blue Oak has moved even closer to my house ","useful":6,"cool":3},"1EqF9lnij4t6Pj8xzuxvOw":{"text":"Excellent! House sauce is sweet, but there's also a vinegar based option. They'll slice yo","useful":2,"cool":0},"1vHbVPMSzKHs25nUoAyj0Q":{"text":"Really really really good. Only one complaint, food could have been hotter. Other than tha","useful":0,"cool":0},"hLJVHzNWz2EKOGZRPFDx1w":{"text":"Placed an order for a family get-together 11/3/2018. Ordered \"pulled\" chicken, 2 dozen bun","useful":0,"cool":0},"YlLjYVckiwq42qY4aBcGQg":{"text":"Great service ! However, The food is just okay. The Brussel sprouts are okay. The macaroni","useful":1,"cool":0},"XfeV1ujEGHqfotHDltaZIA":{"text":"Let me start by saying my husband and I own a successful BBQ company. We have also been ce","useful":0,"cool":0},"EEWy2gfuRyuQJsyK2BqN7g":{"text":"We walked over after visiting City Park.  We were excited about the high number of positiv","useful":1,"cool":0},"weWgLQrJCRa_vvzjKRXgMw":{"text":"Portions could have been larger. I got 3 slices of brisket and 2 sides $15. Everything was","useful":0,"cool":0},"m3DZ9Ui6mW5jWS3QzraRyw":{"text":"My boyfriend and I did the pick two, with ribs, brisket, Mac and beans. It was sooo good. ","useful":1,"cool":1},"W8Zjt6c3ZHmgVhXT9o2C2g":{"text":"My family told me since I needed to try Blue Oak. This is good BBQ! I've had their famous ","useful":0,"cool":0},"40XySvTG-gB5sETj8TJ5jA":{"text":"Nothing to write home about. Had to do a spit take with the sweet tea because it was so bi","useful":0,"cool":0},"bK_EnmnDigWBctLoKEMHuw":{"text":"Had the nachos with the meat of the day which was delicious and a nice large portion. Also","useful":0,"cool":0},"thc7dUObbe0vlpOK-RDBZw":{"text":"The place is usually really packed so I tried it. Wasn't really impressed with the wings o","useful":0,"cool":0},"9AO9ujxV551IYZF8hOitRQ":{"text":"Love this place! Delicious food and low key. Everything I've tried is good especially the ","useful":0,"cool":0},"V29e-MfENyzs5jqCB6x96A":{"text":"Such a great spot for happy hour! They have amazing drinks at the bar and great food for h","useful":0,"cool":0},"8lppYFRAGiW-fiw6TE9Lng":{"text":"Can't stop won't stop eating @ BlueOak! Delicious smoked wings paired with delicious brisk","useful":0,"cool":0},"TTpls-M6dTf-IDlzQ_C2Ew":{"text":"Noticed the last couple of time I dined here the ribs taste a little different so I went b","useful":0,"cool":0},"LMosmwLTzrjvgqA4IZ3YUA":{"text":"Consistently great ribs and sides. We got a last minute deal on a full rack of ribs - took","useful":3,"cool":1},"obZXF7RZYdNJ_L-wBgO5sA":{"text":"Brisket - A\nSausage - C-\nBBQ Beans - B+\nMac-N-Cheese - A\nBrisket Egg Roll - C-\nSauses - C\n","useful":0,"cool":0},"i0gbuS6BEANFBNDpqzgaEQ":{"text":"Our family BBQ spot. Absolutely love the smoked wings, brisket and sides. Truly happy with","useful":0,"cool":0},"OoXK7UT3-6w1axVVihI56g":{"text":"Incredible always! Tuesday they do spicy chicken sandwiches and they are the bomb! Other d","useful":0,"cool":0},"aPm0rMb9lmQ710Wku5UJuw":{"text":"I love the location and the food is really good. Solid choice for BBQ and pretty consisten","useful":8,"cool":6},"JCf3W7xWZte2pbG3cAGwzA":{"text":"Solid bbq and well crafted menu. Meats are expertly done. Sandwiches are built with good f","useful":0,"cool":0},"Y1HYMhwsiF750k4CUEaQQA":{"text":"Someone who lives here recommended this place and it was good! We ordered the family feast","useful":1,"cool":2},"dBYF8GcRhmBxPjFo2pezPQ":{"text":"Best BBQ in New Orleans. Hands down!\n\nLove these guys. The owners started in a little kitc","useful":1,"cool":0},"SzGfKMfWqICTNIk81xvMtQ":{"text":"Awesome food and great outdoor area for kids because they had picnic tables.  Indoors was ","useful":0,"cool":0},"r6QFn7NUHzGkNfVZrgxhcA":{"text":"Sometimes I crave BBQ. Blue Oak adequately satisfies my cravings and then some. I'm not go","useful":0,"cool":0},"KguZ0J9Z0ldUJZRBTelgNg":{"text":"Ive been craving bbq during this covid quarantine and came across this place. I was glad t","useful":0,"cool":1},"QmBNPNj8LGTrdnYvq8Ohkw":{"text":"Chicken sandwich Tuesdays are my favorite! I get a side of roasted garlic mac and cheese. ","useful":0,"cool":0},"6s5wXtt5pULJYHluUBEAVQ":{"text":"We dined here with another couple. The food was delicious - BBQ as advertised. The macaron","useful":1,"cool":1},"mX0K9hzSB2HAzpN47pkeVw":{"text":"This place gets a 10/10 for their barbecue but a 6/10 for their service.  We stopped in wh","useful":0,"cool":0},"zzbXANfdLYdX7oJqGOBkvg":{"text":"IT'S ABOUT THE MEATS\nI went to Blue Oak today with a Texan who hails from my family's home","useful":9,"cool":5},"EgdzjyYSJ4_9-PkCpKfV-w":{"text":"It was fantastic. Food was great service also if you leave hungry it was your own fault","useful":0,"cool":0},"2cVJsD5sf4PDMwOskfEIbA":{"text":"Best evah!!! Lucky to have found this spot while on vacation for Easter dinner! We had the","useful":0,"cool":0},"zZre960CjTlSW4Qs8djlWg":{"text":"A feast for your senses from the moment you walk up to their building outside. The smells ","useful":0,"cool":0},"P-r2Bw4KKr84dLRUrZ9wtQ":{"text":"Hubby saw a post on Twitter about this place and we decided to try it. Good call. Nice vib","useful":2,"cool":1},"HB3YpPi_pfwrmDg0PgWfSA":{"text":"Had the 3 meat deal brisket ribs and pulled pork.  Good stuff, sauces are good too.  Bruss","useful":0,"cool":0},"U0yrlQUxuhegMnuS4TeBhw":{"text":"My fiance and I traveled here while on vacation and I liked the bbq it was mediocre; but n","useful":0,"cool":0},"N9Wzbn3qNEXIGHPs-QoKHg":{"text":"Let me tell you something! Do you want brisket so tender you can cut it with a plastic for","useful":1,"cool":0},"TPmUv_VKNBrnXuvIcuZPRA":{"text":"Stopped by on whim and was pleasantly surprised. I am from Texas so I know BBQ. This was e","useful":0,"cool":0},"3GSna5266kTA-fZtcsELcw":{"text":"Writing this review to see something......\nToday 10/10/2020, At 11:00am, myself and three ","useful":0,"cool":0},"ULJJs6pEE3PjKVu8jNEwdQ":{"text":"Best BBQ in the city. Hands down. Their chicken is super tender and falls off the bone. Th","useful":1,"cool":1},"ICrS39kzQdJ8rdClySvpog":{"text":"Call me greedy, I only wanted more. We had the brisket, chicken, pulled pork, andouille sa","useful":0,"cool":0},"LhArXD0KDXyJV9-h6UauDg":{"text":"Still #1 in my book.\nI went back and tried the jerk chicken...and MORE!! I can't echo enou","useful":5,"cool":2},"_00sDvt0AjPQsaVgKp2cDQ":{"text":"So good. Came here on a Tuesday for the chicken sandwich and it did NOT disappoint. The sa","useful":0,"cool":0},"gA35siPrs-eoKH8fO-kbng":{"text":"Totally disappointed!!!! Greasiest pulled pork I've ever had. My tray was FULL of grease. ","useful":0,"cool":0},"mWyD5G9gifLujVQK7l5LAw":{"text":"I must say Blue Oak has been one of my go-to since Covid started. They have one of the bes","useful":12,"cool":8},"vg9PJiRdDijKASB9HaTMUQ":{"text":"Went during lunch hour, despite the line to order, service was very quick - the line food ","useful":0,"cool":0},"gdX0U09uoXfZbtQubXHB8A":{"text":"Watermelon sangria wasn't that great! And very small amount for $9. But of corse the nacho","useful":0,"cool":0},"-llHSeY0SjTRYl5n98GyCw":{"text":"Great happy hour specials. Kind of overpriced outside of happy hour. But very good pulled ","useful":0,"cool":0},"6wIg_AKemobC_qxS8BhUTQ":{"text":"This place always looked packed every time we walked past and had to try it! We took sampl","useful":1,"cool":0},"Pqj_3JvBaxjvN5RYR6gLzw":{"text":"First time at this place and the Brisket was wonderful. The bar was small and very busy ea","useful":0,"cool":0},"23zCcwk1O2L4RNeD46vc7w":{"text":"No lie. Might be the best bbq I've ever had. We ordered 6 different items off the menu and","useful":0,"cool":0},"nrfeORzviI4UJxgE0tRDlg":{"text":"Probably some of the best BBQ I've eaten. The Brussel sprouts were amazing and I could jus","useful":1,"cool":1},"xKDSrqv070rnZQhDet6mlA":{"text":"New Orleans is not known as a barbecue destination.  A few restaurants have come on the sc","useful":0,"cool":0},"96UoyDTVJNPuzSaLwo2z7w":{"text":"A great spot for southern bbq. My group did \"all the meats and all the sides\" which fed 3 ","useful":1,"cool":0},"Md1sfNR-uomD-F7PyjHDcA":{"text":"With my trips, so far I have enjoyed the brisket sandwich, wings, mac & cheese & the Bruss","useful":0,"cool":1},"mu1b45IOr6FYLmwS3yWiaA":{"text":"Visiting and wanted to step away from French Quarters and see what NO really had to offer.","useful":0,"cool":0},"kCb5ZBuyEoVLpaIRtKpVJQ":{"text":"This great place for brisket, ribs, chicken Mac and cheese and the best for last and it is","useful":0,"cool":0},"xbH1RMIwrBS2KL_pp-leCw":{"text":"One of my favorite restaurants in town. Everything I have tried is delicious. The wings, t","useful":1,"cool":0},"OhpWZ7ae25aic-SFB7kjPg":{"text":"I'm not the biggest fan of all the new hipster spots popping up around New Orleans and ass","useful":2,"cool":1},"dPSwg50mpgkIpJLInvKP9Q":{"text":"We always try to hit up BBQ places for my husband who loves it. It's just ok for me and I ","useful":0,"cool":0},"TYxe7Wm8ojinPRBzQctrpw":{"text":"Came here for Tuesday for the spicy chicken special. I was expecting an orgasam in my mout","useful":2,"cool":1},"tK_mpmhPCotAci0WgkMzQw":{"text":"Seriously, what do they with their brussel sprouts that make them so addictive? Brussel sp","useful":8,"cool":1},"JSgInaYVL0ZZaeqQrLDGhg":{"text":"The young guys at this place BBQ like old men. Its great perfect meat taste seasoning and ","useful":1,"cool":0},"YkyzHzaFwmNm2Cjo0pZUBA":{"text":"In the beginning, God made meat, the next day he built a smoker.\n\nIt's funny they say this","useful":1,"cool":1},"b4NzAL2usWzUlsmOVeYM0Q":{"text":"Blue Oak is good barbeque, the meats and sauce are excellent, but pricey at 12.95 - 16.95 ","useful":0,"cool":0},"4qcpg9MKW9n6UJcsGHY3Uw":{"text":"I made two trips this week to blue oak bbq. One was for the baked potato special. Fully lo","useful":0,"cool":1},"U-OlfdKgJx34227rGdnH8g":{"text":"Staff was spectacular, especially the woman at the outdoor bar/togo pickup area. The two m","useful":0,"cool":1},"TOT2wHHfTXU6S-m1T9NyVw":{"text":"The food is still great but I was disappointed to see that my spicy chicken sandwich shrun","useful":0,"cool":0},"RtSjfrrtJBsZZbxiHV4F5A":{"text":"These guys give Texas a run for their money. It's so good I don't want to tell you for the","useful":0,"cool":0},"fcFl3ccxwCP2KJX_FvAuiA":{"text":"If you are looking for something a little different and are craving BBQ this is the place ","useful":3,"cool":2},"MUkpOjc2imtCdaTbAkQkyQ":{"text":"We ordered two meat plates.  The sides were the best part of the meal .  Disappointed in t","useful":0,"cool":0},"Bos7EZuQOGXrwuHgpgsAXw":{"text":"Decided to try this spot after a day at the park. Employees were very friendly and courteo","useful":0,"cool":0},"BDJkrOj1Y4hrIIVTZVeCUw":{"text":"Plenty of outdoor seating. Separate entrances for dining in and take-out. Hand sanitizing ","useful":7,"cool":6},"mFUQLMmulj5kxNHGNoZ1Rw":{"text":"Really good bbq.  Casual atmosphere.\n\nWe arrived for happy hour today and had a variety, s","useful":0,"cool":0},"aJ5UvRBuJPf0QcUhxanCGw":{"text":"The only thing you need to know: GET THE CHICKEN SANDWICH. \n\nSeriously. It's the best I've","useful":0,"cool":0},"CSloQkgCkDwniEaNya-kpw":{"text":"Located at the crossroads of delicious meats (Toups Meatery across the street), this spot ","useful":1,"cool":0},"bOPzL3UvHhOa4c2gT3CthQ":{"text":"So good! \n\nEverything is outside so that was ok, except flies everywhere and not enough fa","useful":0,"cool":0},"QgET9VLDRhw2cWAJ_0J33g":{"text":"Blue Oak is really good if you are a big meat lover! The location is cool as well, but wit","useful":0,"cool":0},"ztMEAFuFXsGomqsui7J2_Q":{"text":"When I first moved to New Orleans I was hesitant to go to Blue Oak BBQ because I don't eat","useful":2,"cool":2},"1mjdoQhi1SR3JL37uEXogQ":{"text":"The customer service was good, everyone was friendly, the place was nice and clean and had","useful":0,"cool":1},"CTgxeAMRj5tyBWQ-0Np0_g":{"text":"Blue Oak is up there with the best BBQ in the city. Never been disappointed from the nacho","useful":0,"cool":0},"M8G8__qYSSrgFtwme1bJUQ":{"text":"I had some really good ribs and Mac and cheese from here but the star of the show was the ","useful":0,"cool":0},"UW2ABlqA0r7sCACHtqpLxQ":{"text":"We order Blue Oak takeout during the pandemic. Online ordering was easy and the pickup sys","useful":0,"cool":0},"klIiLoWAgblRnHURtJjwpA":{"text":"I got the pulled pork sandwich and some Mac and cheese. Pulled pork sandwich had pickles a","useful":0,"cool":0},"sG6mFMlLd19Bej8oGFxS3Q":{"text":"The only think that took longer than me finally going to Blue Oak BBQ was getting around t","useful":10,"cool":7},"ZjWh3D8QMkp1NrPZtxRfFQ":{"text":"If you're looking for excellent BBQ, Blue Oak is the place to be! Exceedingly friendly and","useful":0,"cool":0},"sgxMk8W2qbqpXeHTRjU7SA":{"text":"I never give a place five stars, but damn. I needed some alone time after devouring the ma","useful":2,"cool":1},"3QS5aKUHIo2LI0lru01NRw":{"text":"Venue is nice. However food is NOT IT.\n\nI tried the brisket sandwich it was okay and my fr","useful":0,"cool":0},"Fdy5t8zk5isdcD9SZGx5pw":{"text":"So.... I'm not a meat eater but I'm obsessed with Blue Oak BBQ. I can live off of their br","useful":2,"cool":3},"FiNrGrX9iU-T03DK4ot1Cw":{"text":"Being from KC, I was reluctant when my boyfriend was adamant on trying BBQ in New Orleans!","useful":0,"cool":0},"5C-Pi9JuIhuOs3pDCWz99g":{"text":"AMAZING BBQ! This place is wonderful. They have so many different kinds of BBQ, but also o","useful":0,"cool":0},"KKJcK9A9DWTDJPyvFKyEgQ":{"text":"Great meal! Had the 3 meat dinner with Mac and cheese and baked beans on side. Brisket was","useful":0,"cool":0},"rXillflqzkNwC3gE55nVQQ":{"text":"The happiest of hours \n\nBlue Oak BBQ's happy hour is every Monday- Friday from 3-6pm! \n\n*$","useful":0,"cool":0},"8fk0PdekrbYbCoNvdYj_HQ":{"text":"Why this place wasn't busier on a Thursday night in New Orleans during Mardi Gras season w","useful":1,"cool":0},"3jM2ZepRiecFmduzSvH_2g":{"text":"First time amazing , second time .. ehhhhhhh .. brussel sprouts are my goto but it doesnt ","useful":0,"cool":0},"x3oSXH-kmjv_5HC3nElxpQ":{"text":"So I live very close by and been here on of the first few weeks of it's opening. So I like","useful":0,"cool":0},"2PVKSi31FrbJKoU_urqO8g":{"text":"On Tuesday's, Blue Oak BBQ has their spicy chicken sandwiches. I got one with a side of po","useful":1,"cool":0},"f_G-ktIDla0CWeNT-FVzwA":{"text":"This place succeeds not because the food is good, (because it's really mediocre) but rathe","useful":1,"cool":0},"LZzQXsw9yKUSEGoPWSzKGA":{"text":"Food was good - as it has always been in past.  Alcohol and water are the only drinks bein","useful":0,"cool":0},"lmPdqtq_2nUgG8LgkJO3Lw":{"text":"I love the location of this place and I love the \"fast food\" way you order then pick your ","useful":0,"cool":0},"Zr1hy6vBrpRiXtzWQEbftQ":{"text":"Absolutely the best barbecue that I have ever had in New Orleans! Everything is cooked to ","useful":2,"cool":1},"R0zcD9CaFPDjHExvzo0RhA":{"text":"Visiting from out of town, ate here last night after recommended by some locals who live d","useful":0,"cool":0},"19vqh6wPgzI3HjAKI4MymQ":{"text":"I wish I can eat here everyday and not gain weight, I really do! Everything here is so goo","useful":0,"cool":0},"Pxx6ExEeM46atuZzOyZ8RA":{"text":"So good! Pricey for meat and sides but most great BBQ is! Do not skip the brussel sprouts!","useful":1,"cool":1},"GY-0V8RNcZqglwBZSTKRTw":{"text":"Really not impressed. Waited 45 minutes to get my order to receive dry ribs. No moisture. ","useful":0,"cool":0},"we6teHud94rjAPH7JvKkFw":{"text":"One of my favorite BBQ places in New Orleans.  Everything is good.  Service is pretty fast","useful":1,"cool":0},"-pbs7a5pL_e5iLrDQIa16Q":{"text":"This place was bomb! Ordered the two meat platter, spicy sausage and brisket with Mac and ","useful":1,"cool":0},"ADp7t3BK8JX6hhpLc_Pr7g":{"text":"Today we walked in and the line was to the door, but it moved rather quickly.  I got the t","useful":1,"cool":2},"moHVd_Q1YTqQcRMcvCQjLg":{"text":"Thinking back on the amazing BBQ I had at Blue Oak BBQ. Everything was so delicious. From ","useful":0,"cool":1},"Uy5jpkz-_F109fw4yeI0eA":{"text":"I've loved blue oak for a long time, but I have to stop supporting this place. They use to","useful":1,"cool":0},"utrPRbMcEjyUQfwbH1pkYg":{"text":"First time diner with. Group today. So much outside seating, fast service, and lots of fan","useful":0,"cool":0},"0f-6GMxGG3cK4RvupoMfmw":{"text":"FAMILY STYLE!\nLook at all this goodness. This was perfect for my family dinner and I even ","useful":0,"cool":0},"xWVTED79JEcIdSgBEXdPlA":{"text":"First time here, great atmosphere with nice BBQ, I'm from Texas so a little bias but fresh","useful":0,"cool":0},"NTR-sV4fmtmJ1u9m6eXaPQ":{"text":"So I heard this the spot in NOLA for good BBQ and I'll say it's aight. Apparently the folk","useful":3,"cool":3},"6hVNxtS5wJJ8c5C6ZNVjyA":{"text":"Best BBQ in nola!! The sliced brisket is my personal go to every time the Brussel sprouts,","useful":0,"cool":0},"i20IkIzXtmUVhtf9z7hG5g":{"text":"Wow \nNice for local barbecue \n\nI ordered brisket with potato salad and beans \nDelicious \n\n","useful":2,"cool":2},"xb-68xp1eKwWRFx9biyqPA":{"text":"You know what I've been dying to taste in NO?? GOOD BBQ!!! Guess what??? I finally did! \n\n","useful":2,"cool":3},"x8ENeKZ2fZYCDa3VPqBDkA":{"text":"Best bbq in the city of New Orleans sides are amazing. The best note I. The menu has to be","useful":0,"cool":0},"hB8l-Wji0sNWoszYX_rtCw":{"text":"Omg. I wish I could give this place 6 stars. The food was so delicious. It took like 7 min","useful":0,"cool":0},"L_sMN6tOSU3suTPn9ESeqw":{"text":"I eat here all the time. It is some of the best BBQ I have ever had in my life. The pit vi","useful":0,"cool":0},"cJx7Vww3agTsfEKxtzUTAQ":{"text":"Close quarters for the searing inside. The brisket was the best I have ever had. So tender","useful":0,"cool":0},"1bXEeCs88sVXYWh8uwr_GA":{"text":"Glad to see this place doing well and staying consistent with quality. They've recently ex","useful":1,"cool":1},"9b-omCjh9dJbyK2sF9WvVw":{"text":"Terrific Food. Sides are good and the meat is delicious. Brussel Sprouts, beans, potato sa","useful":0,"cool":0},"oX5rw-H6NFH2OTZt_vNyKg":{"text":"Great Mid city BBQ joint! Yum! 4 stars on food but 5 stars on service and niceness!! Extra","useful":1,"cool":3},"YhkWtryrXfRiUzTGeYfyNg":{"text":"Wanted to send some #yelplove to Blue Oak BBQ for our weekly quarantine takeout! We ordere","useful":2,"cool":2},"eUOBgW5OAQG79nQqJpP_5w":{"text":"My life is a series of mistakes.  But one of the biggest mistakes is not going to Blue Oak","useful":1,"cool":0},"CVPMMN2ao0CSHDnU-DG6vA":{"text":"This is my go to for good bbq. I'm so happy they were able to operate with pick up pretty ","useful":3,"cool":1},"IX8KF0OpAhs7N5tqVh92lw":{"text":"We heard that the food was really good so we decided to try it out. The ribs, brisket, bru","useful":2,"cool":1},"1K5t_qNyOqp7Sf-al2G2_Q":{"text":"Pulling up to the Blue Oak with Texas plates on a car seen at all of the Hill Country's Fi","useful":0,"cool":0},"DsKPkk7Yo6k26dZsictcsg":{"text":"First time at Blue Oak and it was great! Ribs fell off the bone.. also amazing was the sta","useful":0,"cool":0},"YF4Aq5phKcl1AVjwdCOJiA":{"text":"Had a lot of recommendations to try this place but it wasn't that great. The staff is supe","useful":0,"cool":0},"9rs_X6ewLfCDjytcWtnx5Q":{"text":"Usually when I think of BBQ places, I imagine the classic pulled pork, side of unflavored ","useful":1,"cool":2},"mifJlu9YKuTcWbMSbjY3jw":{"text":"Some of the best BBQ in New Orleans! Their food is delicious and always hits the spot when","useful":8,"cool":5},"bhY41HOJVr1mf5rYO_pPPg":{"text":"Ooooooo yum yum yum! I love Blue Oak BBQ. I've been several times and there isn't anything","useful":0,"cool":1},"SpQ9zZXVL76cR7mxfc3Aug":{"text":"Excellent bbq and an overall wonderful experience. New Orleans should be known for its bbq","useful":0,"cool":0},"EtOkCfuyKLBHnJZqd_pDew":{"text":"First time here, won't be my last.  NOLA is known for food but not particularly BBQ. In my","useful":0,"cool":0},"cVCHc229Fh74uiOlYMqzRg":{"text":"This place is absolutely delicious. Plenty of neighborhood parking available. There are tw","useful":1,"cool":1},"MGNFQGi_Ql-dY9Qz6AULCg":{"text":"Had lunch catered at work. Tried the baked beans, Mac & cheese, coleslaw, and Brussels spr","useful":2,"cool":2},"eZKv5qAmhqTrM0cohA6piw":{"text":"Wow! This place is delicious! My 17 year old's favorite food is bbq and the words out of h","useful":0,"cool":0},"8_Y16VhJRFck7Syuf4HF2A":{"text":"Spent 4th of July here with my family for lunch. Sat under the tent in the rain and the st","useful":0,"cool":0},"j3S6-U5JBcWTU7B0Fzv72A":{"text":"This is one of my favorite places in town. The happy hour here is great and the service is","useful":1,"cool":1},"bKrtjy8JTycZRXGelHNbCA":{"text":"This place was extremely good. Indoor and outdoor sitting. When I'm in New Orleans I make ","useful":0,"cool":0},"WV6xx46krMyzn0FwCaHPKA":{"text":"Good food, good bar, nice restaurant, but not BBQ. Brisket was cut way too thick, tiny smo","useful":0,"cool":0},"NPkEXjZ4hEpShWwwn9Kc3Q":{"text":"Mi esposo compró para llevar costillitas y alitas ahumadas, las costillitas venían con dos","useful":0,"cool":0},"XyRdRYU5lz1ZK6He4etM9w":{"text":"Always fabulous. We went on a Saturday afternoon and it was packed!! They had a a lot of o","useful":2,"cool":0},"Tm7k92XUA3qVBw3JqGZ47Q":{"text":"We had heard so many great things about this restaurant for so long and we had been wantin","useful":0,"cool":1},"sRWpiVKBYofXW_rOwJZF5Q":{"text":"This place is amazing, hands down the best chicken sandwich and Brussel sprouts I've ever ","useful":0,"cool":0},"QVxSfKo-f1S9-UnVK95LBA":{"text":"My favorite things about Blue Oak BBQ: Perfectly smoked meats that aren't swimming in sauc","useful":7,"cool":3},"KAW5xGnh9E8R3mqNj-qJhQ":{"text":"This is probably the best BBQ in town. The ribs and brisket are cooked to perfection. Whil","useful":0,"cool":0},"strNEbQZqwAY_tvYdlwhGw":{"text":"This was my first time visiting this BBQ joint. Normally when you think of New Orleans you","useful":0,"cool":0},"2HeZXxQ8XYi3-16zN4Ao4Q":{"text":"Best bbq in New Orleans.  The beef brisket melts in your mouth.  Pulled pork is also very ","useful":4,"cool":3},"9QyXHrIeIqXrv2VO73giZg":{"text":"Came here with my friend one day because we were both craving barbecue. I ordered the pull","useful":1,"cool":1},"M9ixda8QrU22-zzsoxMTag":{"text":"Great BBQ place but.. if you are looking for a quiet place to sit down and be served, this","useful":0,"cool":0},"yOb2wcEDUYf_N4g_kSC6Vg":{"text":"I literally come here once a week at least. Awesome sauce! They do a great job keeping the","useful":0,"cool":0},"NLDwLX0HUBsW8BonU3Jd2A":{"text":"Writing this review, I'm already dreaming of my return to Blue Oak BBQ...\n\nThis space need","useful":24,"cool":14},"OepvVoqqB75EsLMRlcoIlA":{"text":"This has become my favorite BBQ spot in the city!! The chicken is one of the best prepared","useful":1,"cool":1},"tEi0IDUpfSvaUPAuBzZVzA":{"text":"First BBQ since move to NOLA relaxed pleasant staff! Many choices and options to choose fr","useful":0,"cool":0},"mQK2sam3LFwuUKpBGPjt9w":{"text":"It was your good old fashioned BBQ in NOLA but not too far.  My niece just got married and","useful":1,"cool":1},"t8GcLKH4VrG4LJevFYPVsw":{"text":"Get the nachos! They are everything! The cheese, the meat, the jalapeños, the bbq sauce...","useful":1,"cool":1},"7Pm5EEs-Vak-vrPgDu8LKw":{"text":"The food is soooo good but parking is a hassle. They have a very small parking lot so you ","useful":1,"cool":0},"u50kl0OyG4OgALqUvMasxw":{"text":"Thoroughly enjoyed this meal. The brisket fell apart! The sausage was spicy and delicious.","useful":1,"cool":0},"Q1_m51IkiduGPFNROjg9QQ":{"text":"We enjoyed our dinner. They had several sandwiches, brisket, pulled pork and BBQ hamburger","useful":0,"cool":0},"gJxB9695lqjeVALjHA-poQ":{"text":"The most flavorful hamburger I've EVER had. Every bite was delicious. You might want to or","useful":0,"cool":0},"Glp6fO7sYmly-MfBfYK1VQ":{"text":"Absolutely our new favorite BBQ in the city! After trying out everything at their location","useful":4,"cool":1},"IQmQD9XydgEsEJIDSkOOVg":{"text":"The spicy chicken sandwich on the specials menu is amazing!!! Can't go wrong with the side","useful":0,"cool":0},"a6VsyDihlszQl-PQ2bYIXQ":{"text":"Best BBQ! We have also catered from here. Love their food! Their meats and nice and juicy,","useful":0,"cool":0},"gw0BQr3WixQe-hz4YlOELQ":{"text":"I can't believe it's taken me this long to write a review of Blue Oak since we've gone the","useful":3,"cool":1},"KKdJnsjEurB_peZlVfctTg":{"text":"Probably the best BBQ in New Orleans! They had plenty of outdoor seating cause COVID so no","useful":0,"cool":0},"g_Yx3kb32Kqm0X5UnsxsvA":{"text":"In town on vacation was so good came back twice and brought our friends with us the last t","useful":0,"cool":0},"1jrnj_H271Uv4eo_N9IanA":{"text":"A go to favorite!! Happy hour margs and the chicken salad sandwich have stolen my heart!! ","useful":0,"cool":0},"3sLC7zKMZUlJiqHsNvsfRw":{"text":"I wish I could give Blue Oak more than 5 stars. It definitely lives up to its hype and the","useful":1,"cool":1},"xgdCoDPPcI4S001ijebNNQ":{"text":"Tried all the meats and sides, which consisted of:\n\nBrisket (my favorite)\nRibs (his favori","useful":2,"cool":1},"O8gOsoR2uoVoEYp_JTEn8w":{"text":"My mother has a hankering for BBQ. Due to the COVID-19 pandemic we had to place an order t","useful":1,"cool":1},"TJ8-464zlDweq3v7PS4Miw":{"text":"I went tot Blue Oak BBQ on a Thursday evening. There was a bit of a line but it probably d","useful":0,"cool":0},"X8szsgedtN7o8dJG0s9agw":{"text":"We wanted to try out some BBQ in Nola and this place was very good. Ribs were so tender, m","useful":0,"cool":0},"5ZDf4E1ndVgS-ITOl5_S0w":{"text":"Blue Oak BBQ is one of my favorites, and is a perfect place to bring friends and family. T","useful":0,"cool":0},"iLiFBx34Ox6FyLIGmYgSPA":{"text":"This is probably one of the top five barbecue places that I've been (I've been to Texas, T","useful":5,"cool":4},"KftBu6RcV-dS_46kZdfpow":{"text":"Coming here for bbq and the bbq is fantastic!  And would receive more stars but If you ord","useful":0,"cool":0},"rupX3TpLXGqKZ64pcdAN2w":{"text":"From NY - found this spot and thought to try it out. Street car drop off / pick up right n","useful":0,"cool":0},"RynLXiYPPGBaHNv0CZyFvA":{"text":"I could easily say it's probably the best BBQ in Louisiana. I think the smoked wings are w","useful":1,"cool":0},"VLuOEH64_lADHU2bAdVNrA":{"text":"I've been to Blue Oak quite a few times and as Nola BBQ goes, it's one of the better ones.","useful":3,"cool":1},"kzOORPDiohWSvg4SqY2khA":{"text":"I was finally able to come here for their Tuesday's Spicy Chicken Sandwich special. I'm a ","useful":2,"cool":1},"2yOQWAp5SCd3tCrj4h7xQQ":{"text":"Covid-19 update: For some reason I thought I already wrote a review for Blue Oak bbq  . Fo","useful":10,"cool":6},"gPzgfdG6t0eVTB9I7mlJpw":{"text":"The brisket and burnt ends are SO good. The brisket is perfectly juicy and tender and cook","useful":1,"cool":1},"aiZOjXj0wCxBkpljnZvHAA":{"text":"The food here is amazing. Great flavor. Amazing taste. Truly a great place for BBQ. I have","useful":0,"cool":0},"y99r3BBfyhxNHtMQHhdbMQ":{"text":"Best bbq in NOLA!  The jerk ribs are so delicious.  Spicy, sweet with just enough heat.  D","useful":0,"cool":1},"3-x3ywOcbgqJ-WvmwHgE-Q":{"text":"I'm not big on BBQ, but the nachos keep me coming back to this place! My favorite nachos! ","useful":1,"cool":1},"_Gx9c4-3QIjT5H4q6WE6Hw":{"text":"Literally too good for its own good. Like, I wish it was bad because I live 1 block away a","useful":0,"cool":0},"S_T2Nz474GGbEpDxjUVnEw":{"text":"Nice tender brisket, good job.  Cracklin quite salty in sichuan seasoning but hot and fres","useful":0,"cool":2},"ah8vQCy5UCp_VH3XJtapEg":{"text":"On our recent trip to NOLA we had third place recommended to us by our gondola tour guide-","useful":1,"cool":2},"aaZZMAmQtbhoXTRsZK0wfw":{"text":"Stopped here for a quick lunch while on vacation two weeks ago. Atmosphere was really cool","useful":1,"cool":0},"inUjUB-ojmSG7Ci1lhfL6Q":{"text":"This place the bombdiggity!! I mean, its soooooo goood!! My favorites were the brussel spr","useful":1,"cool":0},"tgTW8q7-1nc6anIN4WGWHg":{"text":"Ridiculous line for ridiculously good food. A little more on the greasy side than I prefer","useful":0,"cool":0},"WI8Z60CNVpn4URh-oArQXA":{"text":"I was looking for a dinner place on Sunday and many of regular spots were closed and I've ","useful":0,"cool":0},"QqgGw4uLmXQ1rFTiZCfR2Q":{"text":"Amazing and fast!   Sooo tasty!!  And got a free koozie!  Red cream soda on tap!!!!    Fri","useful":0,"cool":0},"iE1B5IuDjB8CcyYlxe2iLg":{"text":"By far my favorite BBQ restaurant in NOLA. The brisket, bbq beans and Brussel sprouts are ","useful":0,"cool":0},"blxwCS8zW7gw9gGXIBbyAw":{"text":"The quality of the meat is at best average, but given the price tag is far more deserving ","useful":1,"cool":0},"rPB4rk8vxSfY7y2-uOOI2g":{"text":"Blue Oak BBQ is so so good. The food is mouth-watering and every kind of meat is juicy, de","useful":0,"cool":0},"i4SJHFcZZT19q_9ez4PGew":{"text":"We had the brisket & pulled pork with beans and Mac n cheese. It was really good. All 3 of","useful":0,"cool":0},"sNZAkyO9zB-3_8F2_yi4Ug":{"text":"When in NOLA, try something new! All week here I stuck to seafood and Creole food, I mean ","useful":4,"cool":3},"i1bcuoCpnlfDTu6Zszgn6Q":{"text":"Probably one of my favorite BBQ joints in NOLA. Brisket is my favorite, but all there meat","useful":0,"cool":0},"ay00BTwZq5pAn7cdrc3jDA":{"text":"We have eaten here several time and it was always GREAT!! Today we are ordering for take o","useful":0,"cool":0},"Vkj1pdEpgKs5kwdCBj8-bg":{"text":"I haven't had BBQ In a long time and the Blue Oak BBQ was my first time experiencing  the ","useful":2,"cool":3},"65e9bpCO3Pi8AdoySjLSHQ":{"text":"After learning about this place from the 80 Million Dollar Man - Guy Fieri, a friend and I","useful":1,"cool":0},"F6esqvUeiDTIU5JqF1AciQ":{"text":"The barbecue here is delicious!!! I went here one evening with my husband and my son. I ha","useful":1,"cool":0},"SNEMiEqWdzkN-qw7IqMH0g":{"text":"Went there on Wednesday the staff was nice. Menu was good and the food was simply one of t","useful":0,"cool":0},"9D2Sgd7J-VVf1d9VOIFJ1g":{"text":"Good food, good bar, nice restaurant, but not BBQ. Brisket was cut way too thick, tiny smo","useful":0,"cool":0},"dzbe1jwB9uIfiqpfj2U1Wg":{"text":"I would probably give this place 1.5 stars. We ordered 3 meats combo (wings, ribs and bris","useful":0,"cool":0},"Xc5p311iE-ruq_nVmNxAmw":{"text":"I always hear about the famous spicy chicken sandwich that everyone tries to win on Twitte","useful":3,"cool":0},"AJVghP7fQsZ2e8cy-U1RXQ":{"text":"I would give no stars if I could!!!!!\nWent to go eat and got our kids McDonald's knowing t","useful":0,"cool":1},"RofYwpUCUwCr1-z28_TWiA":{"text":"Do you ever want to start a review with a stream of expletives to exclaim your joy or disg","useful":14,"cool":6},"7yC3Swx8jNcWUVoaqMHhhQ":{"text":"Pretty neat place. I'm a little saddened because they do not have any ribs and it is only ","useful":4,"cool":2},"mq9OHe_x2z_Aq9EesfPi2A":{"text":"First time going, because of rave reviews. The beef brisket & pork were good. Mac-N Cheese","useful":1,"cool":0},"W9mTu7_u594FDEebkOP0xg":{"text":"The brisket here is ok and the sides are decent.  The portion size for the plate was too s","useful":4,"cool":2},"yr0_Jni3vTq9By-4v7KZNw":{"text":"This place has one of the BEST fried chicken sandwiches in the city. It used to be a Tuesd","useful":4,"cool":2},"Y3NTPyKHhD7EaaLsHxk5uw":{"text":"Love Blue Oak BBQ! I moved here a year ago from TX where I enjoyed eating a lot of bbq! We","useful":0,"cool":0},"6a3-AVvriIJbjYJwFQZGmw":{"text":"Still five stars!!! Their out-of-this-world good spicy chicken sandwich is so popular, it'","useful":1,"cool":0},"5x13B8cpzvADktOL-XPQ5Q":{"text":"First time here and I decided to go with the Spicy Chicken Sandwich. Did not disappoint! I","useful":0,"cool":0},"PtI8L0BNnRLORF9EYAP1lg":{"text":"I definitely beat the line for lunch. Everything about this plate was so good! If you're n","useful":0,"cool":0},"O5qc0qL_pr2rQqIKEPgLAw":{"text":"The restaurant is great the service was great cost is medium the barbecue was awesome","useful":0,"cool":0},"AECT60KQLOrNOZg38RByFQ":{"text":"Their Pulled Chicken Sandwich is really good. Brussel sprouts are delicious! I think its a","useful":0,"cool":0},"TtQ4lJWYQ7sIKydHMPy38Q":{"text":"Blue oak bbq is one of my all time favorites! The meat platter is amazing. My favorite by ","useful":0,"cool":0},"1aeqkwBH137XK2dGEKWAxQ":{"text":"We love this place! It's a perfect date night place and a great venu to bring kids. Their ","useful":0,"cool":1},"f6ggJa8Yq96IlZ9omJpoxA":{"text":"WOW! I love barbecue, this place was phenomenal. I'm literally sad it's not local for me. ","useful":1,"cool":0},"ZBK-fC-BrkhOHc9O3aiDjw":{"text":"Amazing Amazing BBQ. The food is delicious and the customer service is good. The house BBQ","useful":0,"cool":0},"-XKMDZa3VfvpaAJzFCChGA":{"text":"The food was amazing and so was the service! The wait was not long at all. I would most de","useful":1,"cool":0},"oYxYraysK4CWzngaAi3BXA":{"text":"I had the jerk BBQ smoked wings. It was oh so delicious. The wings were packed with flavor","useful":0,"cool":0},"6pztufbbJ5rBdSHQNUC3UA":{"text":"I am a Texas girl that loves BBQ.  I have visited NOLA several times the past few years an","useful":1,"cool":0},"igL4H5Bdi1fguGkG9C42Pg":{"text":"The happy hour here is the best deal I've seen in a while. The food is delicious and there","useful":0,"cool":0},"rE32h0AlTidcuZ6GMFD2WA":{"text":"Blue Oak posted about having the Cochon de Lait app Boy from Walkers. Came with creole sla","useful":1,"cool":1},"Ggw1oc4EcGrZYvMdoSJu6w":{"text":"Umm... Hello! I made a video review on blue oak bbq and all I gotta say is, YOU MUST TRY I","useful":0,"cool":0},"ued3NKKqzuJb3LNFdJEZHw":{"text":"The line during Covid was intimidating but I'm glad we stayed! I mean every single thing w","useful":1,"cool":1},"iUwJR-ZgZZGUCmqs27TaCg":{"text":"My husband & I finally made it here on our most recent trip to our favorite city. Now we k","useful":0,"cool":0},"deCjuGZ3q4AxNYq9XFxKgw":{"text":"Blue Oak BBQ is a hidden gem that is located a few blocks by the city park. The main entre","useful":0,"cool":0},"bI-pSu_PfLDGwIVbqd_Luw":{"text":"This place has terrible Service Very High Prices\nThe staff are  Rude and Snobby and the Fo","useful":0,"cool":0},"EW7jpfpMBprs6hNOKoImVw":{"text":"Service is great food is amazing price is midpoint barbecue is great I may say please visi","useful":0,"cool":0},"QdzjAIAFAaH6i86I4OOCRg":{"text":"BBQ was pretty good but the clear winner was the fried chicken sandwich. My husband loved ","useful":1,"cool":1},"iFD9KxpbM-mcQ6DzuV_wtA":{"text":"Okay yes I've eaten bbq already this week, but why not another time!? & I'm definitely gla","useful":1,"cool":1},"BdyTsjARJZgXSevRb60LvA":{"text":"Was looking for something other than traditional Cajun food in NOLA. I'm not big on BBQ so","useful":2,"cool":0},"I4wMFk4Q4sT9uHrVL2ZOqA":{"text":"Despite the hype of the great reviews this bbq joint was just OK. It's like a cramped hole","useful":0,"cool":0},"CSJgq5gAp8Ge32dxoB3gsA":{"text":"For starters, this is NOT the best Bar-B-Q in New Orleans.  If that's what you're after, y","useful":0,"cool":0},"iPVrg__7c1mKWVySPPYKBA":{"text":"Despite the hype, I was unfortunately not won over by this place. The food was mediocre at","useful":2,"cool":0},"edjTjYKGvOoHVoaYBpdo3w":{"text":"New Orleans is known for its food but for a long time I lamented that this did not include","useful":0,"cool":1},"G4M2Ql5ecj5umr1w8x8nCQ":{"text":"Love this place. I've eaten there twice now and I'm headed there with some first-timer fri","useful":0,"cool":0},"TJjU37elJ2PlOY6dZydttg":{"text":"Had the opportunity to try these guys for the first time last evening.  We loved it!  I ha","useful":7,"cool":7},"iEAZZOKPBNEtUEVn1Hp7Hw":{"text":"Wanted this one to be GREAT.....been awhile since I had bbq...twas Jazz Fest a month ago a","useful":2,"cool":1},"tEWmu_L6S9AZ3zjW9zXkHg":{"text":"Move over, Texas.  Alabama, Georgia, and both of you Carolinas with your runny vinegar-ey ","useful":12,"cool":5},"T1lEwjqZA4TdWGsP8LXfrg":{"text":"The best bbq and spicy chicken sandwich ever!!!! Spicy chicken can only be purchased on a ","useful":4,"cool":4},"nvYitO5hvXcscj8ARUWhDQ":{"text":"Come to Blue Oak BBQ for some tender and juicy BBQ. There is a great selection of meats to","useful":4,"cool":3},"3iA75XtIOBT8AOkI0LPh-w":{"text":"Fabulous BBQ. The Mac and cheese was incredible, made me want to lick the bowl clean. The ","useful":0,"cool":0},"_o6ehRcsU3UnxmRkJ46UwQ":{"text":"We had high expectations before going to Blue Oak... and they were all met and even exceed","useful":1,"cool":1},"xioaaoyADKAvLcjwbAU67A":{"text":"Really good bbq.  Nachos and wings to die for..you order your food then you get your own d","useful":0,"cool":0},"m_4QyvlzbjY8KM4Ngbpz3A":{"text":"YUM!!! That's all I can say!  Street parking is ok. Restaurant's interior is nice and can ","useful":0,"cool":0},"qM4djWk8dHn5ABtgoN4Szw":{"text":"Best BBQ in town, hands down. I go here with the wife and kids at least once every week or","useful":0,"cool":0},"Hxvq1MhBhHehOVI1-pB39g":{"text":"Three words: Spicy Chicken Sandwich.... y'all it was soooo delicious and crunchy in every ","useful":0,"cool":0},"ZnK1iQi0aPRDW33XEq_kCA":{"text":"So pumped this place opened. Had an awesome lunch on the patio the the other day. Food was","useful":0,"cool":0},"Ub9NHYrq5i0vWoO_K37pXA":{"text":"yallllllll! love blue oak and i just found out about their happy hour. it's amaze! $6 12 o","useful":0,"cool":0},"d6ZoiuRaoZXVMZ1lLecPlw":{"text":"Last meal in Nola after enjoying the city park was delish!! The moist brisket was great, t","useful":0,"cool":0},"2WPu7PtDHaER-Co-F_BXcQ":{"text":"Freezing, expensive, but tasty. Recommend the pulled pork sammies and macky cheeseys *Kiss","useful":0,"cool":0},"ylwu-YUBLvLIQe59mRtrFw":{"text":"10/22/2019: BlueOak just doesn't only offer the chicken sandwich. They are actually known ","useful":0,"cool":0},"BtUb-9oEUI5XEPCKtk5FmQ":{"text":"Pleasantly surprised.  Very good and simple smoked meat.,.great atmosphere and really grea","useful":0,"cool":0},"S_iEnPmnZS6Fl3bxrF5tVA":{"text":"The hamburger was the best thing we had. I'd go back for the burger. It was juicy and well","useful":1,"cool":0},"5AYuGTDW_x3Twn9xFE17Gg":{"text":"Really good BBQ and sides. The brisket and Brussels were some of the best I've had.  This ","useful":0,"cool":0},"SCUq8BG3C3JjbOymCbXPAw":{"text":"Never disappointed at Blue Oak. Casual neighborly vibe. Order at the window inside and fin","useful":0,"cool":0},"pZ1QM6HrX_lFWBag9d-Csw":{"text":"One of those fantastic places that puts their  stamp of something special and interesting ","useful":1,"cool":1},"XijOqDAV0E1bz05o8zL3XA":{"text":"One of the best new BarBQ joints in town. Love the pulled pork and brisket, and variety of","useful":1,"cool":0},"ajQH71Muq4hyZ5Gqj6gYjA":{"text":"The title for the #1 CHICKEN SANDWICH in NOLA!\nSeriously, a trophy title indeed!\n\nA fellow","useful":6,"cool":4},"g-87vNTOgffMgKyEH82hUQ":{"text":"There was no wait which is a plus. We walked in ordered and the food was at the table in l","useful":0,"cool":0},"MoJx5QMxHeB405RTom7B2Q":{"text":"I typically don't do \"brunch\" at Blue Oak, but when they shared a special they were having","useful":3,"cool":1},"ssQvTvX84JHv-8AREf8bag":{"text":"On our first night visiting New Orleans, hubby and I stumbled upon this spot on our way to","useful":1,"cool":1},"2xYeZGUVfSP-5Tfe-39RZQ":{"text":"Blue oak we're giving out free food and free beer during jazz festival week. I really appr","useful":2,"cool":2},"MQRG6oIxzZ8B-CjmeOjMzw":{"text":"Delicious! I don't really find myself to be a barbecue person but I still was interested i","useful":3,"cool":1},"d_esg5WDI5wB_03pMRzJKg":{"text":"Right in Mid City, this barbecue place really hit the spot for a casual sit-down, fill-me-","useful":0,"cool":0},"-7XtFw1OSVjQaM4gM_JW5Q":{"text":"Family was going to spend good money at this restaurant but manager wouldn't let my family","useful":0,"cool":0},"bIKSFmfnnKacGDeDjHynmQ":{"text":"How am I a regular here on Yelp and i have not done a review?? \n\nYou cannot go wrong with ","useful":4,"cool":2},"1bApYupK-5rhN__atQ6nyA":{"text":"Blue Oak is a super popular BBQ place in Midcity. There is not much BBQ in New Orleans, so","useful":1,"cool":1},"9eiV-45MR_QufvLIP9TufA":{"text":"LOVE, LOVE, LOVE!!!! I'm so happy Blue Oak BBQ has their own location now! They have a rel","useful":22,"cool":19},"Abh0a9N-nDmKRvgoU6QcuA":{"text":"I have now been to Blue Oak a few times and I feel I can now discuss the greatness of thei","useful":8,"cool":7},"jvMPPwdIVQt123x-JG9rpw":{"text":"I loved it. You can smell the bbq from two (short)  blocks away . 4:30 pm friday and it wa","useful":1,"cool":2},"fOZPkGHMXUE-wZsP3QOTkQ":{"text":"I went to Blue Oak BBQ on a Sunday, needless to say I wasn't expecting much of a crowded r","useful":4,"cool":5},"Din7zax22WLgFRrjK6hiWg":{"text":"The wife and I came out to New Orleans as a get away she is more into sea food than I am m","useful":0,"cool":0},"W2nJEt3_T74fI8sdmC2AfQ":{"text":"At 4pm they were out of ribs, which was the main reason for my visit.\n\nFatty brisket was s","useful":0,"cool":0},"9xWUuMIhnzRD5Ebx2UKSJg":{"text":"This place has some of the best barbecue in New Orleans. Love the barbecue nachos. The bri","useful":0,"cool":0},"SFsXtKV1msbXV-8lEjbtxg":{"text":"Really great BBQ & good atmosphere.\n& Everytime I've gone ive received awesome customer se","useful":0,"cool":0},"H515MeEcMP8s5pmQi_eeWg":{"text":"I came here with eight people; they offer adequate seating. Outdoor dining was available, ","useful":0,"cool":0},"DLq3MD8swe_0Q6cECD-F3w":{"text":"Last day in our trip, thank goodness I remember we hadn't ate here yet. We pulled up to th","useful":0,"cool":0},"8HRCT1araftALvZTqnyUPQ":{"text":"Pleasantly surprised.  Brisket was juicy with a nice bark, the brussel sprouts were also g","useful":0,"cool":0},"2l2IzY7926uV2KgVKDP5fA":{"text":"This is definitely a go-to BBQ! When I saw the long line I was hoping the supply could ful","useful":16,"cool":11},"c_VFDz325YtHQzd9eFB_tg":{"text":"Came here as a group of 4. We ordered the meats and sides. $70 for 4 people, not a bad dea","useful":1,"cool":2},"-CAR5Qr5YbusZwe5CZmnrA":{"text":"I am in love love love with this place! It's amazing and everything that I try on the menu","useful":3,"cool":3},"AUuSXNjlmEkV5HM-gmYtuQ":{"text":"OMGee, OMGee, OMGee, Blue Oak does not disappoint! Thanks to Hold the Mayo Sports for the ","useful":3,"cool":0},"TYLzxrvg6Oe_Xx5E0u1W9w":{"text":"This place is incredible.  We had a huge crew and a bunch of youngins.  We got a couple of","useful":0,"cool":0},"JCiDpp_doZYJXeHM5Luhvg":{"text":"I have been to blue oak quite a few times and it is a very good BBQ place. However, I don'","useful":1,"cool":0},"Jgl-qNxZ91h-e3rTqT4KjQ":{"text":"This place is one of the reasons I moved to this city.  The first time I had that spicy ch","useful":1,"cool":0},"uA5gUb40ZxkvOlDe9ch8IQ":{"text":"We came here for lunch Saturday and the ambience was great! Lots of outdoor seating and th","useful":1,"cool":0},"kfaN_fQW4003kg7FgI07xg":{"text":"You'll definitely work up an appetite waiting in line to order, but it is well worth it.  ","useful":0,"cool":1},"4Ugvz6CEEjOyVYXhkrHG0A":{"text":"This place is amazing ! Small but cozy, the atmosphere is fun and the staff is very friend","useful":2,"cool":1},"_owETWNyzE5vDvGXIUfrag":{"text":"I've been looking for a go-to BBQ place in New Orleans since moving here, and I may have f","useful":6,"cool":4},"2UQDospQAb7EYQYh7OpXiw":{"text":"Great environment, food cook well and service was ok! I recommend go with a big group. It'","useful":0,"cool":0},"CiMU739mr_Yx_wV8-BbWLg":{"text":"I loved the brisket! Also, the collared greens were fantastic! The atmosphere was perfectl","useful":0,"cool":1},"y-F9STmkETNX08WxQgsSNA":{"text":"It's hard to add to the many positive reviews for Blue Oak... so, I will focus on what I s","useful":0,"cool":1},"aeNMLPf1XGedxQLyTwS8Bg":{"text":"Great happy hour & great food. I had a great time eating their brisket sandwich with a cou","useful":2,"cool":1},"XzZtlwJknVhMTttwaov7KA":{"text":"Okay so listen.... when I tell you my partner or I or together have been to blue oak at LE","useful":6,"cool":2}}