{"Yvp5HP62YmomY6FRZoX60w":{"text":"Food is okay, we had the poboy burger.  The place is a bit small and dingy though.  The po","useful":0,"cool":0},"xiCtlDW8CeT6hIR9cBMYyg":{"text":"Okay to good food. Very nice people. The food is not authentic by any means, but it is oka","useful":0,"cool":0},"wDVLBnAHwnii1gbwMbBn-A":{"text":"I gotta say, I was fairly skeptical, but also STARVING, and inexplicably intoxicated after","useful":9,"cool":4},"-NjtNcaX-sS3OJlBEw1Shw":{"text":"I had read good things here on Yelp about this place and was totally disappointed.  Tied f","useful":1,"cool":0},"kCdEc_m3KjDccAeWbBnTiA":{"text":"This is a Pakistani restaurant with a selection of American food.  They have quite a few g","useful":5,"cool":1},"4cC3B70QjB4iGJajStTyhg":{"text":"High prices but well worth it. Get the goat masala w/ either the rice or the flat bread, b","useful":0,"cool":1},"bhUqqT11fA9lG5yyTRJntQ":{"text":"What a ripoff!! Except for the okra, everything else is terrible. The parathas were basica","useful":1,"cool":0},"C3VMK2F3SvTVMrgKH_KMzg":{"text":"Pretty over-rated.  I got the Palak Paneer and it was very watered down and bland (almost ","useful":1,"cool":0},"4Fe0-f-oIBP2RvlM9BTS2A":{"text":"yeah, it's a bit pricey but what do you expect in the quarter and/or new orleans, in gener","useful":0,"cool":1},"qpFq5QQh7Q03h3E3kjBVUA":{"text":"Worst food with worst service. Should close this shop immediately, no neatness too. When p","useful":1,"cool":0},"oLPfOlUKaMh4ADSPzaVidQ":{"text":"My \"Yelping style\" is to always try and remain objective when writing a review; even revie","useful":9,"cool":3},"8Toha8H8T0NF1T5U_5qnHw":{"text":"Decent food for Xmas day. However, they serve the digiorno of Indian food \"deep\" foods. Sa","useful":1,"cool":0},"Nl_dcggcTIi78N18MblQVA":{"text":"I absolutely would not go to this restaurant. \n\nWe had purchased an offer from Restaurant.","useful":5,"cool":1},"ydD9Lq-6zN04KqYZ3Nvp6g":{"text":"I don't understand the hate for this place on other Yelp reviews. Really, it astounds me. ","useful":7,"cool":1},"HBw_Q__pvWN41YBgF_wrjw":{"text":"If you like goat masala or curry I'd recommend this no frills place.","useful":0,"cool":0},"GvJGvnk2XQ1DY4Lf0JrV7A":{"text":"Very regrettable....arguably the worst Indian I have ever had. I had high expectations, bu","useful":1,"cool":0},"tiBW1PgOBOsgjNlY_Qjbxw":{"text":"Though small the food here is great ....employees are very cordial and the food is very au","useful":1,"cool":1},"qIf11YsBrW88whRMIEwg3g":{"text":"The only Indian restaurant we found in downtown NO. The veggie biriyani is really good. Th","useful":0,"cool":0},"Vpzyk_ZREtziEI9DpRim9Q":{"text":"A great break after a week of remoulades and étouffées. Excellent authentic Indian/Pakista","useful":1,"cool":0},"y9-c4U1jbkm0NxdWmfWtMA":{"text":"Good for what it is - a place for relatively inexpensive, tasty food, especially late at n","useful":0,"cool":0},"Si4_DnpNvqcF3d9O5FtABQ":{"text":"This was an excellent find in NOLA! \nReally low key, not trying to impress anyone, place a","useful":4,"cool":2},"6sAr2JRqfiurZkQNMxNqnA":{"text":"the okra masala is really great. its super low key and reasonable on price.","useful":0,"cool":0},"fxaaXW0gWvKdeLlUi-2SvQ":{"text":"Foods not that great! Server was horrible. No concept of hygiene!! Guys you can do better ","useful":1,"cool":0},"NbhbylTdK8gcywoXv8_tHg":{"text":"Worst Indian food I have ever tried. Although the food looks cheaper but you are getting v","useful":1,"cool":0},"Bapwa_svjG1FxgYqauo7_g":{"text":"Best Parkistani and Indian food. Love most of their dishes. My favorites are goat curry an","useful":5,"cool":1},"R4EOpf7T-ApDOCQcgr5etQ":{"text":"Very nice guys working there but food isn't good at all.\n\nHad the veggie samosas and palaa","useful":1,"cool":0},"1APMGePUmeP9PhQIbPfT0w":{"text":"A bit off the beaten path, and as un-touristy as you can get.  This is a dive-y Indian and","useful":1,"cool":0},"LBah6g3KfKrpE9n1LGyEzw":{"text":"We were really craving Indian food and this place hit the spot! I had some chicken masala ","useful":1,"cool":1},"pHXcOA7y2t5ebSPZKGfv2Q":{"text":"Stopped by with a craving for Samosas.  Ordered 2 and waited for 15 minutes for them to he","useful":1,"cool":1},"7kJGvICyBCvQHypw0JNfeQ":{"text":"Was visiting french quarters for Christmas and found this place at walking distance and op","useful":1,"cool":0},"KPX2f5-GiQ02IWs_1frgdA":{"text":"I had goat Biryani and we split potato samosas for App. My wife had chicken kebab and she ","useful":1,"cool":0},"fPfy2Cfsdk1qfZrekgvnyQ":{"text":"NOTE: This place has closed down. I tried to go on Tuesday (November 2016) and someone the","useful":3,"cool":0},"4phB1Zn5oTARTZXtTPxCXQ":{"text":"Just stopped in one time for a snack, but I thought it was enough to merit a review. Divey","useful":2,"cool":0},"UVk96-PU0wr3NwkXpN6zPA":{"text":"This food was fine-dal has fresh cilantro, spinach paneer standard.  I was pleasantly surp","useful":0,"cool":0},"wEJMGeVzhjjoloD6m0pwig":{"text":"This place was very tasty. I asked for my paneer to be spicy and it was perfect. The servi","useful":2,"cool":1},"E894qTKgbw50ueVgX-rcMw":{"text":"What a find in the middle of the French Quarter.  The vegans and the carnivores in my grou","useful":0,"cool":0},"oDXuPHDMZ4TmiSoq5Yujhw":{"text":"I was trying to go to Nirvana Indian, but they were closed. Ran into Salt and Pepper and o","useful":0,"cool":0},"U9-s8R1KhsrlLAjvM9oCkg":{"text":"Forced to give one star. The guy is rude and that's an understatement. The sign at the doo","useful":1,"cool":0},"Uhn-ItjuA7YldxoQYas8zQ":{"text":"Really friendly service and offer delivery. I ordered the chicken tikka masala, aloo paran","useful":1,"cool":0},"fYgCsEm0OcSQBe_cHQCq6w":{"text":"Best Indian food I've had in my life. Ever. Hands down. The chicken tikka masala was so cr","useful":1,"cool":1},"kfdVDeH47TkXFikPCOBGqQ":{"text":"Salt 'N' Pepper Restaurant offers a delicious variety of items for vegetarians and vegans,","useful":0,"cool":0},"jEfoN6A_e-hfEKKks0-teg":{"text":"I had the chicken byriani, samosas and naan.   Naan was so-so and a little dry.  Samosas w","useful":0,"cool":0},"sjf3eHHER1A1P2fsqlXGIg":{"text":"Hole in the wall Indian food place on the edge of the Quarter.  Best Indian food I've ever","useful":1,"cool":0},"plZAq0OaukGcCgWMPiX3eg":{"text":"Yum. When looking for something different, this was no disappointment. I love Indian food ","useful":0,"cool":1},"PPzHwk_tz17RI9sGi_Q6pA":{"text":"I really really love this place. Don't let its sparse looks fool you it it is hot fresh an","useful":1,"cool":1},"s0EtElmAKmhzI3H2oMHjiw":{"text":"Worst restaurant I have been to!! Poor service and even poor menu options!! Just disgustin","useful":1,"cool":0},"Ujid5-yIa3dPVPXlt3B68w":{"text":"I'm only giving this a 2 star because the customer service was a 3 star and the food was a","useful":2,"cool":0},"UGpdGl89aMVw1JpmljY7cw":{"text":"Its nice to get a break from constant Cajun. Goat masala was really really good. Kind of a","useful":1,"cool":1},"5UCVT2cS_tfgQd5Dd7k3OA":{"text":"This is the worst indian/pakistani restaurant I have ever been to. There is only 1 or 2 pe","useful":2,"cool":0},"GD_MZeDyGr-dMVDldYkf-w":{"text":"Hidden, unappreciated, delicious. Ordered two veggie dishes which were both excellent. Can","useful":0,"cool":0},"DDd11yfcxgjMrkGJxgzqtA":{"text":"There are so many comments about the good samosas, but I haven't eaten such an oily samosa","useful":1,"cool":0},"zmJ7RD7xvck8OKl1M9rmEw":{"text":"It's pretty good - fast delivery - and the prahta(sp?) was soooo delicious with my chicken","useful":2,"cool":0},"PAsxC2GrZ9NA_byb8VUFFQ":{"text":"If you're looking for fancy this is not at all your place. Not very clean inside. Service ","useful":1,"cool":0},"jQx_vE3J8BTD2MeLDvGjgw":{"text":"Quiet little unassuming spot off south peters in the quarter. Never been disappointed.","useful":2,"cool":1},"rxeaZYHVoKVXgn-C_NatcQ":{"text":"Well if there was an option to take back the stars given by any other person. I would have","useful":3,"cool":0},"ALZlDKNrvP8Vp6NqVn_rJA":{"text":"This place is the worst place I have ever tried they are over priced and the food is disgu","useful":1,"cool":0},"E0h4M5UioTbrj2dwoStKGg":{"text":"This place is rough.\n\nI paid $10 for a plate of palak paneer.  It tasted like spinach from","useful":9,"cool":0},"-xtS84E3oVCH4CbEAPeeyA":{"text":"The samosas were decent. The sauce that they serve it with is oddly watered down.  Not rea","useful":1,"cool":0},"u0OFCqX0F94iJ_35vx4rbQ":{"text":"Salt N Pepper never disappoints. I drop in at least once every trip home to New Orleans. \n","useful":2,"cool":0},"ZAGZgO4MOUzdBrLZDJcpOw":{"text":"This place Is my go to when working in the FQ. Its fast, cheap, and the owner/ manager is ","useful":3,"cool":2},"1l81KPXYOqL11H3XY9q9Gg":{"text":"This place is amazing, have been coming here for years. Friendly service, can help you dec","useful":0,"cool":0},"NydJSTnI10sKqcxmnkVMKA":{"text":"Diamond in a rough.  best Indian and middle eastern food ever.  we ate here 4 nights out o","useful":1,"cool":1},"VYULd2It0FHGFcXxljlq3w":{"text":"A lot of people give Salt N Pepper bad reviews. Maybe they're purists and feel like indian","useful":0,"cool":0},"Wli3uA9BYyoIxe0GknSkSQ":{"text":"Oh boy.. where do i start. Firstly, the original Salt n Pepper is CLOSED!!! \nThe name chan","useful":1,"cool":1},"a-qwbl0PJ7gr3uBPQVit5w":{"text":"I have been hungry for Indian food in the French Quarter for more than two decades & was d","useful":1,"cool":0},"9Nn7YsniMcmqKoe09HI0HA":{"text":"We were on a Road trip from Calif. in late May and were craving for Pakistani food in NO. ","useful":0,"cool":0},"TloifaM3ayjqpa5mG27D0g":{"text":"I cannot believe the reviews I read here on Yelp.  Ladies and Gentleman, I am Indian, and ","useful":6,"cool":0},"h9qQbb8lN6AbHYZVLYIc2Q":{"text":"Please avoid dining here if you really want to have Indian cuisine. The experience was pat","useful":0,"cool":0},"tDEqJKO95x6ILqSUcnvutQ":{"text":"Make no mistake, this hilariously named Indian/ Pakistani joint is the real deal. It may n","useful":10,"cool":4},"nytH5AsHKxGxo6Pk20blLg":{"text":"I have lived in Glasgow, Liverpool and Houston -- excellent Indo-Pak food in each.  Salt N","useful":0,"cool":0},"tOK0T_VU8_c5kbM00Iivrw":{"text":"Hidden gem in the Quarter - I eat here all of the time (but never from the American side o","useful":0,"cool":0},"8JN22w5SG4U3ySzY3PEkiw":{"text":"We ended up here the afternoon of Jan 1st coz they were one of the few places open in the ","useful":2,"cool":1},"A1HpGU-Xka0HbChXWnvfAQ":{"text":"I literally just finished a meal of dal and rice with roti, and I'm so satisfied. This is ","useful":0,"cool":0},"TUZ9Qf9jqFJLj90o1O7HhA":{"text":"Honestly, pretty sub-par. Vegetables were completely overcooked and spiced unlike any way ","useful":1,"cool":0},"iZxpVTo2k0e4d1bvFmv0Ww":{"text":"I stopped by for lunch when I was feeling under the weather and enjoyed a delicious bowl o","useful":1,"cool":1},"ic7_ktieuJfuW-Miw78NxA":{"text":"We were visiting New Orleans just for a day and our friends who were desperate to Indian f","useful":4,"cool":0},"sZFIZnQc3vGMjNUvD_-Rng":{"text":"Food is better than Nirvana's and Taj Mahal's, though that isn't saying much.  The food is","useful":0,"cool":0},"vN8y36-Zn7VUSvsbDYUOYg":{"text":"This is one of my favorite fast lunch places, and you can watch Pakistani satelite TV whil","useful":2,"cool":1},"HKLcvwXIV_7jCsKqyhvrwQ":{"text":"Update: I haven't been back, but I literally crave this place ALL THE TIME. When I go back","useful":1,"cool":1},"PfUL8co7br_4NEh4iJS1wQ":{"text":"I would not recommend this place if you are looking specifically for Indian/Pakistani cuis","useful":0,"cool":0},"i80cGqROQCr8XhSKOQ_f0Q":{"text":"The food is amazing, especially the sheesh kebabs. Too good, they are as good as I have tr","useful":1,"cool":0},"_I63diM7GOdP2YVhM9fFvw":{"text":"First off. We walk in and moths and flies EVERYWHERE. So I'm already ready to leave, but m","useful":2,"cool":1},"trm5cuRIp6vVsie8EitXEw":{"text":"Look, I love the heck out of some Indian food and Salt N Pepper doesn't really qualify.  I","useful":3,"cool":1},"x9SyzLP4Zz35kd9-ZeOPEg":{"text":"In New Orleans, this place is the absolute closest you'll get to eating at a small sidewal","useful":6,"cool":3},"e3kAkdiNxuGnqCcyWeb1ww":{"text":"Not authentic Indian or pakistani. Food was bland and not good taste. Would not recommend.","useful":0,"cool":0},"1TnNp7z3OtcJBd30l8gsRA":{"text":"This place is totally hit or miss. I ordered the fish gyro and that was fine.\n\nEverything ","useful":1,"cool":0},"RdrZ4a9yPTDNK0By-m9uTA":{"text":"This little hole in the wall Pakistani place is the first place my hubby and I go when we ","useful":1,"cool":1},"oKAEdcwt4NfaQwhK2SA0Cw":{"text":"Much to be desired in terms of Indian/Pakistani food at SNP.  Their version of goat biryan","useful":0,"cool":0},"uFKofTiNJjw9cEDyosS4pQ":{"text":"Really enjoyed this place. I'd searched for Indian food in New Orleans, and surprisingly t","useful":1,"cool":0},"32ssb7ij-ke_R0_b3iEAmg":{"text":"I eat a lot of Indian food being a vegetarian and the dishes I ordered at Salt and Pepper ","useful":2,"cool":0},"eU_esSzblM7BHGNd0Rzg9g":{"text":"We popped in here for a quick vegetarian bite before diving onto Bourbon street and had a ","useful":2,"cool":0},"BwLnTLINlGQq7uh3wrhaMA":{"text":"Since we have been in New Orleans we have eaten hear twice.  I feel like a local already. ","useful":1,"cool":1},"noSs_7ODQrhl5W5571Lrng":{"text":"Absolutely wonderful Indian dive featuring homestyle Indian dishes for an unbelievable pri","useful":6,"cool":1},"yUUVyNCybGZh17F2WIoDaA":{"text":"Great find near Westin on Canal. I had an excellent dish of goat meat cooked with spinach.","useful":0,"cool":0},"r6_NdqpLJXeJ9K6QA5QtUQ":{"text":"Bumped into this little hole in the wall last saturday after a show at the HOB. Werent rea","useful":3,"cool":1},"H4y3w9kxB4ompnhJC_bj6g":{"text":"Best ethnic (Indian/middle eastern) food I have had in so many years. Clean place with som","useful":1,"cool":1},"hHZrNl5FzaNlxJSrBwEoqw":{"text":"This is not ur regular restaurant type indian food. I am from South Idian and i can say wi","useful":3,"cool":2},"VCdRe3DAmWY8kt1g8Szf8Q":{"text":"Best food in the quarter. Quick and perfect every time. Absolutely anything you order will","useful":1,"cool":1},"i2tOlnXXdYJedP2Yn7vvKw":{"text":"Me: hey, does this have tomatoes in it?  \n\nGuy at the counter: no.\n\nFood arrives with toma","useful":3,"cool":0},"I3Ew6WnWrXpBMI75g3D8yA":{"text":"Wow! This place is a hidden NOLA treasure! Vegetarians will love this place. I don't even ","useful":2,"cool":2},"ZTkc5mrUesNMlxRv37yjZg":{"text":"Unfortunately, there are very few nice things I can say about Salt & Pepper. Indian food a","useful":8,"cool":4},"y0Sbe1q85eGaoLuShlvsSA":{"text":"I was here in 2010, 5 years ago. I still could not forget the authentic Pakistani food. Th","useful":2,"cool":0},"_0prxT_M99huhZQ4-QxbKA":{"text":"This place is a gem! Their food is amazing! \n\nMuch as several previous reviewers have note","useful":1,"cool":1},"BB7YhpCSCzgK2dBpX5vZ6g":{"text":"This place is a gem! Their food is amazing! I love this place.\n\nMuch as several previous r","useful":2,"cool":3},"i_HqHTtok4eO_YrMYRLrwA":{"text":"I'm a bit surprised at the bad reviews. I guess everyone can have an off day, or maybe peo","useful":1,"cool":0}}