{"OmiR__lxksAzvKKr810ngw":{"text":"The owner, True, specializes in medicinal teas! My boyfriend went by today and told her ho","useful":1,"cool":0},"_nPgb7hQ8rPuMbgIy8iUaQ":{"text":"I can't give any stars but I'm forced to give at least one. We went last night after findi","useful":0,"cool":0},"1slFTIpX8CrAll6nryI60A":{"text":"I just happened to cross by it (I was actually headed to a different cafe) but it seemed i","useful":2,"cool":1},"ZOX_O0GUB0kAy1nFXNqesQ":{"text":"First off, wow. If you weren't originally drawn to this cafe all on your own, you definite","useful":0,"cool":0},"iQNheg-sqIDWDLd61ZPDgQ":{"text":"A magical Tea shop! So much love, creativity and tiny detail went into making this place a","useful":1,"cool":0},"CGqi1gtXSvsK6T6bhdLnzw":{"text":"My friend and I stopped in for a pot of tea and ended up talking with the owner.  She was ","useful":0,"cool":0},"7GZ9fo8FbjE7oS_2_4kCIQ":{"text":"Came here with a friend who hates tea. He had the chai, I had the unveiling jade. Both wer","useful":1,"cool":0},"h_-8iJJ50ZUKoAeQo9FUhA":{"text":"Very inviting, warm place to spend time. Amazing selection of teas and the owner is incred","useful":0,"cool":0},"KZmEZp4LI9yDuSptv-qGNg":{"text":"LOVED THIS TEA PLACE! I was in town for work at the convention center and needed a boost o","useful":2,"cool":1},"pkkL4JHPqyTV_AKJAU2Bhg":{"text":"The best tea in New Orleans hands down. It's always DELISH and freshly made. The owner is ","useful":1,"cool":0},"AkwWZdtUDCahWvimoEYfxQ":{"text":"Lovely little tea house. You can linger over your cup of tea with your laptop or apot of t","useful":0,"cool":0},"bE6T184EH_FNh0WFSe8FUw":{"text":"This is a beautiful gothic looking little tea shop with such kind staff. I was stunned by ","useful":1,"cool":0},"PeBFtJBQLOfoLImw4adKRA":{"text":"Nice addition to neighborhood and community. We are a coffe-centric city but it is nice to","useful":1,"cool":0},"2DcW-beQ_MYam5-_XsijJQ":{"text":"Excellent vibe in this cute little witch house. Comfortable setting a quiet little area. T","useful":1,"cool":1},"1WNLaS1Gx9Vb6aQs1BSp2A":{"text":"This is a neighborhood jewel. True provides the finest teas for any occasion - gathering, ","useful":0,"cool":0},"1CdMHCAkRvI1x2oSQqC3Tw":{"text":"Charming eclectic spot serving unique blends in a French press so you get several cups. Th","useful":0,"cool":0},"3at7-keefePQYFb63OhKTw":{"text":"I could sit in this cafe for hours. Beautiful decor that is so relaxing. Got an iced tea f","useful":1,"cool":0},"c_QMZCb2_MueN4VUVmAVOA":{"text":"This is my new favorite local business in New Orleans! I have been several times now and I","useful":0,"cool":0},"AqI_dNaaBWwR45Onx9Ipaw":{"text":"This morning I was suggested a tea for a sinus cold and have been feeling great all day. I","useful":0,"cool":0},"aQpruBeB49DoK4U-nuh5wg":{"text":"Love this place. The woman who I think owns it, was so sweet. I'm not a tea person, but I ","useful":0,"cool":0},"2UUkb42p0dl5q6ccoKY0iw":{"text":"The interior of this place is so unique and comforting. The staff was very friendly and he","useful":0,"cool":0},"7AFf8xnw2lrpjrAsMMBlsw":{"text":"The owner was completely inviting and knowledge. She was able to make your perfect pot bas","useful":0,"cool":0},"FzQ6FEZ3vFpXfyD2lOmu2Q":{"text":"Our first day in NOLA & my friends and I wanted a spot to find some caffeinated beverages!","useful":1,"cool":0},"ZN-bK_xiADb8Rbdtx1hKmA":{"text":"My new favorite tea house in the city.  A really great witchy vibe, on point decor and a l","useful":0,"cool":0},"gpSP-BuxsWH9nlXZHWLErA":{"text":"I love Tea Witch Tea, and I had no idea I would love Tea Witch Cafe even more! The pastrie","useful":1,"cool":0},"KgsvzJ7Xu-T9jiGY7yvjJg":{"text":"Can we please talk about how adorable this place is?? I have been trying to taper my coffe","useful":3,"cool":1},"QRvGurPkp5QmmDC1yLZ9fw":{"text":"Super cozy and charming. Excellent customer service and the two things we tried were great","useful":0,"cool":0},"O3uxvvTwYksFWMsxq9O7YA":{"text":"First time being in New Orleans and my friends and I visited the tea witch cafe. We were s","useful":0,"cool":0},"oNaidS0dk16wvka_8e-q-A":{"text":"For any bruja, witch, warlock, or spiritual medium this is the tea house and coffee for yo","useful":1,"cool":1},"Ow8hf1X0l9Lzp5p139LQwg":{"text":"A magical little tea shop! They manifest nothing but good vibes and quality tea. I got the","useful":0,"cool":0},"cHxZ2r0NTELLarR5Arxg8g":{"text":"Just a pleasant little local spot.  Tea by the cup or the pot & coffee. Eclectic decor and","useful":0,"cool":0},"Pzx-FHqdfSLKgMw2x1qvXw":{"text":"This place, the tea and the atmosphere was amazing, and what more can you ask for from a t","useful":1,"cool":1},"ynK38LPWOjPeKuaemZFvJw":{"text":"This is such an awesome space! Positive space, warm, inviting. If I lived here, I would sp","useful":0,"cool":0},"uCO0ulvHc_rDmIoyRQ_j4g":{"text":"This has been my most favorite place in NOLA. The tea is delicious and purposeful. Made wi","useful":0,"cool":0},"LPCRUimMA4KnJcQtpmSIkA":{"text":"What a cool place! Came here while on a bachelorette party weekend. Staff is so kind.","useful":0,"cool":0},"WbtMKKNI0PJDbYaY_PgXYQ":{"text":"I had a couple of hours on my own in NOLa before my flight. I found this little Haven clos","useful":1,"cool":0},"pCjpa8mxSjWefLivMKEnKg":{"text":"I popped in today with my husband, I'd been reading the reviews and passing by and couldn'","useful":2,"cool":1},"oCRnYcuy-N9CbuUNE5emZA":{"text":"True (the owner) has an unbelievable amount of wisdom. You are missing out if you don't go","useful":2,"cool":0},"TsNiq9ujHMG4lxEQ0mDV2Q":{"text":"Just a wonderful warm cozy little tearoom on Magazine. Eclectic is a simple term to descri","useful":0,"cool":0},"qbdWR4ouO7TaoNJp969fQQ":{"text":"Proprietor is very friendly. The atmosphere is very pagan friendly and well decorated.","useful":0,"cool":0},"SB44kGwVfgfcaNJHDvf0PA":{"text":"I personally would go back. The owner and I had an immediate connection through the cosmos","useful":9,"cool":7},"-3y77digMYPyOXABURdy_g":{"text":"Went here because my girlfriend was feeling sick. The server recommended the \"rattlesnake\"","useful":1,"cool":1},"vydn85X-mPzKLEDr2TbT1g":{"text":"Came here with a bunch of friends and really loved it.  They were great about giving sugge","useful":1,"cool":1},"etFWmQHlDC-prsHq6Lj-sg":{"text":"Love this place! Great, fun atmosphere. Definitely come here for a witchy good time! Tea i","useful":0,"cool":0},"-DVStWkTalfbBhrvlRZ9LQ":{"text":"I loved everything about this place! The decor was very beautiful and the owner was very s","useful":0,"cool":0},"Bv8gCzzR3gdacxeQ8ZrHgw":{"text":"Just WOW!  My friends know how much I'm a tea addict.  I am working in New Orleans on a gi","useful":0,"cool":0},"GlLAWAPzaZSn-G6kAgy2Dw":{"text":"I rarely write bad reviews about businesses on here, I try to be as fair as possible. But ","useful":2,"cool":0},"qeljCUxI8gzDH2W1I4BgJQ":{"text":"Kristen was very kind and helpful. She gave us great tips for the city and was really fun ","useful":0,"cool":0},"n6Jc3gVGS_svLcug1gp50Q":{"text":"The space is very cozy and has a earthy vibe. Perfect for 1-4 friends. I was little sad be","useful":1,"cool":2},"AngsMGqc9tWDEykSpSxwmQ":{"text":"Right after I made a trip to the English Tea Room on the North Shore, I decided to meet a ","useful":4,"cool":3},"G6fbNv3rN19DvrowMbvf4w":{"text":"Such a lovely cafe complete with bone or tarot readings, lovely pastries and wonderful wom","useful":1,"cool":0},"_LNH8INREJe9OORZmrfGoQ":{"text":"This was the perfect place to visit on a cold and rainy day. I would prefer a cafe such as","useful":2,"cool":1}}