{"OFzMFX-9uJ0tCCUa11O3dA":{"text":"I was a happy camper eating this after a long night of Hand grenades LOL. I ordered 2 for ","useful":1,"cool":2},"0to00G8OMS2qmeDz4TYe-A":{"text":"I know, I know when NOLA eat Louisiana food but one night we were just too damn tired to l","useful":0,"cool":0},"uYkysqH4PspIuIrbzNCbzw":{"text":"Goooood pizza. Be sure to stop by. Seating is limited but it's worth grab a piece of the s","useful":0,"cool":0},"oIQYvuok8O7AagtZ4zoGOg":{"text":"AMAZING!!!!!!! Oh my goodness! Second to New York! So good and quick. Pizza slices are abo","useful":0,"cool":0},"Ofs0ozHFwZvg6ZqHqjq2vg":{"text":"There is absolutely NOTHING i can complain about! Besides this hidden gem being located on","useful":1,"cool":0},"mvYQJlMyj5_EPlkojl-lrA":{"text":"Yes, if you're drunk on Bourbon St I'm sure this is a great option. If you're sober and ha","useful":0,"cool":0},"pGJ6zAFJhRAkcMr837dFHg":{"text":"This place can easily be missed because it's a small pizza place off of Bourbon St. Please","useful":1,"cool":0},"i36kaObcU8kgT2ckHbbmoQ":{"text":"Surprisingly great!!! Being born and raised in the NY/NJ area, I KNOW pizza. \nThe speciali","useful":0,"cool":0},"AkhGteMfsf0U7g6XNPCkLA":{"text":"Delicious Pizza! Huge slices, and a steal for $4.50-$5.50 a slice! Several delicious varie","useful":0,"cool":0},"jSyZsnKKoG1ErBuNCsfBZg":{"text":"Pretty reasonable tasty pizzas. Definitely fills a need at 11pm when hunting for food in a","useful":0,"cool":0},"kl9wlzpMObg2OHkqg0CVAA":{"text":"I went to New Orleans 8 months ago, and tasted the BEST pizza of my life! I haven't been a","useful":0,"cool":0},"jmhDk3wdJkX1KdW6vnFmGw":{"text":"If you like doughy, cold, greasy pizza by the slice then this place is for you! Overpriced","useful":0,"cool":0},"HppTVkheWWkwZUfNC20f9w":{"text":"Yaaaaaaaaas!! Spin-A-Shroom til the day I D-I-E! Life-giving after a day or night (or both","useful":0,"cool":0},"SRXVUCPYWNVVVnVjnEWQqA":{"text":"So you know that late night spot you go to when you've had a couple and ain't nobody tryin","useful":0,"cool":0},"d8Fnq1WjMwnoa_utxqNx8Q":{"text":"Stopped in for a late night bite and assumed it would be better than the usual Bourbon Str","useful":2,"cool":1},"_q9x8fYQGKengfEuhfY85g":{"text":"Crescent City Pizza is an oasis in a desert of seemingly never-ending terrible pizza place","useful":0,"cool":0},"MsFZ-p_oFZCbLjws_AMNfw":{"text":"Pizza was OK. Good location, TVs, open air, but not enough seating. NY-style but not real ","useful":0,"cool":0},"DqCUDg_PNBGMs20EZvm4FA":{"text":"Great tasting pizza. I had the cheese burger one. Tastes like a burger. A little salty for","useful":0,"cool":0},"SznHbHXX8kLFZiGs3_r0ng":{"text":"Bomb ass pizza! Had them one night while drunk on bourbon a year ago. This time we stopped","useful":0,"cool":0},"OCGjIPw0CdEzWWEIKTRseg":{"text":"Taste!  Whole family enjoyed it! Big cheesy, chicken bacon krunch, spin n'shroom, Green, p","useful":1,"cool":0},"2gewValtY5xIDpWKnVVSpg":{"text":"The pizza wasn't bad but the women at the counter was rude and hateful.  Her name was Lace","useful":0,"cool":0},"eYlrFwpM70Y8Y8FDxDJ_Uw":{"text":"Continuing our NOLA pizza tour, I'd like to throw Crescent City Pizza Works in the ring. A","useful":3,"cool":0},"luk9wekjk1_AEqcrzzAjJA":{"text":"This is much better than expected and a welcome surprise that rises above the neighboring ","useful":0,"cool":0},"KkyucRa5G1eyU1HpFJQnQA":{"text":"Great NY style pizza in the heart of Bourbon.  Don't waste time on the other places.  Woul","useful":0,"cool":0},"Lc8xSk-WRz-fgo2_fYwiIw":{"text":"Wonderful service, awesome pizza, good music! If you need some food during a long night of","useful":0,"cool":0},"d7N0EwKVHGGya4le2M6AiA":{"text":"Nothing better while walking the streets drinking, jamming to some street music, and takin","useful":0,"cool":0},"_ywONMybVXASuryb1JgXsg":{"text":"This is my all time favorite late night pizza stop in the French Quarter. The slices are l","useful":0,"cool":0},"e5ZErTKSQfP1uMGmJz5AhQ":{"text":"Quick service, great staff, yummy pizza! A great way to start or end the night. The pepper","useful":0,"cool":0},"nn7ww1AJYKjna20CLe-FMw":{"text":"The chicken crunch pizza is amazing, the chips don't get soggy! And it adds a great crunch","useful":0,"cool":0},"0FUvY68U-F6fdp0asGYZPQ":{"text":"I was just a singular unit in a bachelor party in a sea of hundreds, perhaps thousands, of","useful":0,"cool":1},"qCWpWhMN7HFKs80k_ZYuug":{"text":"This may be the best pizza I've ever had... and I'm a hard sell on pizza! Shayne was amazi","useful":0,"cool":0},"Jq1JOiS38hC_CZIkvWMK3A":{"text":"I can only assume the other high reviews are because this establishment caters to people s","useful":0,"cool":0},"7xV-8fRkrAb8QfpSkWCAYQ":{"text":"Are you kidding me. Insane pizza . Why wouldn't you give it 5 stars. Best pizza in Louisia","useful":0,"cool":0},"7ujB9_VVqt2G83-BM0TM7A":{"text":"While on Bourbon Street in NOLA, you realize that daiquiris & pizza is apparently a popula","useful":2,"cool":1},"bn4B-ufoKfAOvXnnh_eoMw":{"text":"After dancing the night away, we were walking and I noticed a crowd of people with huge sl","useful":1,"cool":0},"DdGmJOjK8U9UhgTbOxIkNw":{"text":"Best pizza ever..shout out to Steven working by himself holding the place down good job","useful":0,"cool":0},"gPuav_rk6B7dtuQvTDR6eA":{"text":"This is my favorite pizza. I went from NYC straight to NOLA and this is still my favorite ","useful":0,"cool":0},"AcLPtf52GhYYMTbU9lXNFQ":{"text":"Do you love pizza? Well my fiend you have found the holy f****** pizza grail!!!!!! Enjoy! ","useful":1,"cool":0},"qEOE1pSXl4jKhJXJNYKb5g":{"text":"Decided to give this place another chance....what a mistake. Firstly, clean up your counte","useful":0,"cool":0},"LvOEhytR3T9tLYmSN7rGjQ":{"text":"Slices looked so good. We got two sausage and pepper. I think they call them Piggy Pepper.","useful":0,"cool":0},"bxx7s48eh3SYLpaN3DC3sg":{"text":"Found this place on Yelp so decided to give it a try after a night of drinking.  This plac","useful":0,"cool":0},"9yTh0UMfhbFPRNotWT_PkA":{"text":"I just had a basic slice of cheese as I was passing by but boy was it good!!! Reminded me ","useful":0,"cool":0},"wQNRazxKx-d1cNFtH6x9ow":{"text":"We were here and got pizza at 2 am. It was fresh and awesome definitely worth passing up t","useful":0,"cool":0},"7wpYQsKdhUsLlJ-e9YObng":{"text":"Great for a quick bite in the French Quarter. Tried the veggie slice and my GF had the pep","useful":0,"cool":0},"R_OIBvAqhnHiUP-pTRu40w":{"text":"One bite, everybody knows the rules.  This was my second time to get Crescent City Pizza. ","useful":1,"cool":0},"RU3vq9u24dZNVz5aJV2ZQw":{"text":"THE BEST PIZZA ON BOURBON!!!\n\nMy friends and I came here every night before heading back t","useful":0,"cool":1},"0t5S8gm1sJ74C0W_AqoDPQ":{"text":"Pizza was great! Prices were good!  Service was quick amd the employees were nice.  Great ","useful":0,"cool":0},"zoj6jjf-Z1uoNlWtd4xIQg":{"text":"Pizza was pretty good, bathrooms clean and available, venue was clean, service was good bu","useful":1,"cool":0},"8nlxfZnc5apFq3-bG3UH-A":{"text":"Greasy, enormous, fantastic slice of pizza - definitely hit the spot after three days of n","useful":1,"cool":0},"NuT2aypnFvo-hcgjhtfENQ":{"text":"Pretty good pizza for the tourist district. \n\nI ordered the sausage and peppers pizza. The","useful":0,"cool":0},"oB2-PV4mkft0sj8v-zqsFg":{"text":"This pizza is far different from the typical Bourbon Street fare: it's super high quality.","useful":1,"cool":0},"b00O9vrlF9KvkPHFqKaeIA":{"text":"Great pizza for Nola and reasonable priced. A quick place to grab a bite to eat. Not much ","useful":0,"cool":0},"2CLvr34bmRFbtAA1jccHrQ":{"text":"Stopped in for a couple slices when Bourbon St was hopping. \nWe ordered a Buffalo Blue, an","useful":0,"cool":0},"QE_wpbikvN2TsPTUHcBZZQ":{"text":"The line moves fast! \n\nI got the chicken & bacon (5/5), and sausage pizza (4/5). It was so","useful":0,"cool":1},"5Mm6nxTuaWnvH7GsvQ8QDg":{"text":"Walked by this place a few times and thought...a slice of pizza would hit the spot right a","useful":0,"cool":0},"afxNVz_xjwjLrzBichC-QQ":{"text":"This location is right in the middle of bourbon street hustle. Great pizza by the slice an","useful":0,"cool":0},"6jYdYMR52wm7oj5sYe9jLw":{"text":"Best pizza on bourbon, by far! New York style thin. Just stick with a pepperoni slice.. yo","useful":1,"cool":0},"2zDlvHAXWy6m7KP48JFcPQ":{"text":"Super happy to have found amazing pizza after the drinking bonanza that occurred over the ","useful":0,"cool":0},"M5pL5OLbxB_lR9ptBWen9Q":{"text":"Great pizza after a few or a ton of drinks.... get drunk on bourbon street and then order ","useful":0,"cool":0},"1EMBVVK_yFdwfATTBoMkNg":{"text":"I actually went here twice while I was visiting. The pizza is amazing! One slice will fill","useful":0,"cool":0},"0u7Fa1-PPBfFdEONq-q-RQ":{"text":"Good selection of pizza.  Service is fast, but to say this is like NYC pizza isn't correct","useful":0,"cool":0},"Kaqu88tMVp0o4YceLNs7Xw":{"text":"Closest thing to NYC pizza I've had in a while. $4 a slice for pepperoni, so good to soak ","useful":0,"cool":0},"Fb1R9mfltcEfoD-iaYaovw":{"text":"Very good pizza and cheap prices. All of the pizzas were by the slice and the prices were ","useful":0,"cool":0},"kAqmxP7NKPQnZKOeBFtskA":{"text":"The staff was friendly and I like they heated my slice. Nice selection of draft beers adds","useful":0,"cool":0},"seeQJ0kKdohfO10yunPNBA":{"text":"So good especially when youre drunk . The crust is thin , cheese is fully covered And not ","useful":1,"cool":1},"-cf75adHSXAxtaOxGoGDrQ":{"text":"Fantastic little pizza joint in the heart of Bourbon street. Definitely hit the spot after","useful":0,"cool":0},"pVr2iFVLJ4cZeCLckeQ_oA":{"text":"I also cannot understand the high reviews for this place. Very limited selection and no ab","useful":0,"cool":0},"Ha8EzaZGV_-reMXFJNJvNw":{"text":"Get the pizza with the potato chips on it! THIS IS NOT A JOKE. Came to Nola for the good f","useful":0,"cool":0},"IwL1vUr8z1ZLsd3V8_cm0w":{"text":"All I gotta say is - BOMB ASS PIZZA! \n\nDefinitely good after a night out on bourbon street","useful":1,"cool":1},"SMbTlmY4PLUsXuhcPZ1oTg":{"text":"Giant slices of cheesy goodness at a cheap price...definitely worth it! \n\nI went three tim","useful":2,"cool":2},"7Js1UHFBdLUVdQxDKQKhjA":{"text":"I was very impressed with the quality of service and product at this establishment. Had th","useful":0,"cool":0},"zFdgt8AcJPu02uo8verfWg":{"text":"Pretty legit pizza right on burbbon street! I was hanckering for a slice after I had some ","useful":0,"cool":0},"Tjz0x0JnZrQWogbPd5vxVg":{"text":"Perfect slice. Perfect employees. Can't ask for anything better. Thank you for the laughs.","useful":0,"cool":0},"StrFfGsanKgmlNsou4IPNA":{"text":"This pizza place is one of the best around....like around the country around. So damn good","useful":0,"cool":0},"OXViSRnDoLfiRaP8jrgfVA":{"text":"The pizza was okay and the wait staff was friendly but the restaurant was a little dirtier","useful":0,"cool":0},"oQGjcSdIQIezpSa1Oe94Yw":{"text":"I highly recommend this place.  While there are several good options for easy grab and go ","useful":0,"cool":0},"fHhEXxXoUNR5h97iIHOo-w":{"text":"Sooooooo good!  I had a slice of the buffalo chicken and a slice of pepperoni!  Both were ","useful":0,"cool":0},"57ZzMOpPsdDZzVX9ZChnHg":{"text":"This is the best pizza I have ever had in my life... and the most expensive slice is $5.50","useful":0,"cool":0},"Ix-D9eez0e9okcvg__EmyQ":{"text":"This is by far is an amazing pepperoni slice! Huge, fast, flavorful! Chicken bacon ranch w","useful":0,"cool":0},"wxsyy-XlSu13lPjTJe4CBQ":{"text":"Yummy pizza after you've been walking around all day and having drinks in the Quarter. HUG","useful":1,"cool":0},"Ymj2-g0jSZVra7Na6bfddg":{"text":"I know you may ask the question, Who goes all the way to New Orleans and gets pizza? While","useful":0,"cool":0},"XD2QVly7Ts4pekVAewXpyg":{"text":"Pizza was good but a bit greasy.  Line was long but it moved quickly. The bathrooms were H","useful":0,"cool":0},"BY3K00cK6dsET0lMN0_brg":{"text":"Holy crap, if you're jonesing for pizza by the slice, don't go to one of the corner daiqui","useful":0,"cool":0},"K_QTH4i7Ne6OVhP0XmDnkw":{"text":"Didn't want a big dinner and read about CCPW.  Stopped in last night and staff was friendl","useful":1,"cool":0},"kJ3zvqhtv78JKdveH2D6vw":{"text":"Good pizza. Very convenient location to the hotel that i was staying in (Royal Sonesta) i ","useful":0,"cool":0},"IbPI-N6gETTdEouajrRW1w":{"text":"If you're on Bourbon Street and really hungry, it's fine. But there are better places to g","useful":0,"cool":0},"Yeosn9m-5S9OtLrEavuTxw":{"text":"Great pizza good prices.   Hard to figure out the right place to eat when your with the ki","useful":1,"cool":1},"N8AQpWp6z-fWkylqr6lmYg":{"text":"I was in new orleans on vacation and my friends and i decided to try it out.  Oh my gosh. ","useful":0,"cool":0},"X7UvJ-BZEimazsL851SXnA":{"text":"Got their spinach and cheese pizza for dinner last night. Really really tasty!  Only mista","useful":0,"cool":0},"tSjj9QsOlCk_j4ZnwSxN7g":{"text":"Great little stop after a wild night on Burbon Street!  I haven't lived on the East Coast ","useful":0,"cool":0},"gUqeTTTjTI_z7Dc2ty5-JQ":{"text":"BEST PIZZA IVE EVER HAD! The buffalo chicken pizza... omggggggg. Even the plain pepperoni ","useful":0,"cool":0},"E5bs5x91mtAPTrgHae_xFg":{"text":"If your looking for a quick slice without the fuss check out this place. It reminds me of ","useful":0,"cool":0},"JcaLvvWZqHwKlEPorZLzOA":{"text":"We were in town for Mardi Gras and ate here every night.  It was the perfect place to grab","useful":0,"cool":0},"3_Whcyr6AxLG_snlXNXaSw":{"text":"Hands down, best pizza I've ever had!!! My fiancé and I were only planning on one slice ea","useful":0,"cool":0},"82vZrB4MxM2R1wNU_zkOmg":{"text":"Perfect for an inexpensive meal. There are plenty of places on Bourbon Street that can sap","useful":0,"cool":0},"cdj3ImLE7tRBVgVb4A0fMg":{"text":"This place goes to show you that you can get away with selling floppy and greasy pizza if ","useful":0,"cool":0},"CJKd0RntYfgog9Muz5mp_Q":{"text":"spinach shrooms pizza, yeah!\nThe pizza is delicious. Sorta wish they would cook it a tad l","useful":0,"cool":0},"RZ-r7CvdkigpjFCN5-MsBg":{"text":"After a night in the bars the munchies take place.... what did I spy but a Pizza shop sell","useful":0,"cool":0},"wDZqFh7_SHxQEBGP5qifzg":{"text":"I very much enjoyed this place! My friend and I were staying 10 feet away for a conference","useful":1,"cool":2},"5Pak4y7p4rdRt2EVFcLzYQ":{"text":"Best pizza on bourbon!!!!! Come here every year and get a slice at least 3 days of our 5 d","useful":0,"cool":0},"2QV1hb_-sn-P13YZFb8F0A":{"text":"For a Bourbon St. pizza-by-the-slice hole in the wall, the pizza was pretty tasty and the ","useful":0,"cool":0},"xANBlYYBIEDBvMCrg12fXg":{"text":"Fantastic food great service. Not much room to sit down. Don't ask for a fork when you com","useful":0,"cool":0},"wTwARMHmazAbUpi4J95RBQ":{"text":"Great pizza. Just watch out. They \"missed\" the $50 I paid and tried to short me in my chan","useful":0,"cool":0},"a2k-4msO7AdEqS49Pqhd7Q":{"text":"My family and I wanted to try this place out for a late dinner, and we were happy we did!:","useful":0,"cool":0},"Io1f2oEAO_aq5p-AStipFA":{"text":"Pizza is made with great care, purpose and pride. The selection is great and creative; sev","useful":0,"cool":0},"byLEFykbA4yBzvokcfiRZw":{"text":"Pizza is delicious and affordable. The service is fast and the employees are friendly. I h","useful":0,"cool":0},"H8K5RpogYkyO0l5QdQtrrQ":{"text":"Perfect pizza and pint! The pizza makers are true artists! They can spin the dough into a ","useful":0,"cool":0},"vT-xUvoOUeyHu56B03v9ng":{"text":"This looked a lot cleaner than the other pizza joints on bourbon st. We were hungry and dr","useful":0,"cool":0},"7Ei7XpxSV82z5LnPw0TlTw":{"text":"Amazing just amazing. The perfect slice of pepperoni pizza. We will be going back because ","useful":0,"cool":0},"PLiBxjSZgqs1uuV9IGJFMw":{"text":"While on a business trip to NOLA I was doing a walk of Bourbon St. and came upon this plac","useful":0,"cool":0},"Uh2HkPOMl0o5byYHE7fTIg":{"text":"Based on previous reviews, I was very disappointed. Cheeseburger slice was decent-size but","useful":0,"cool":0},"JD1s6BTE1LTWABLC9t5Fww":{"text":"We came here after a long night of bar hopping, and this place was still bustling with peo","useful":1,"cool":2},"BVoGdn7pFabTB0JYXYGpmQ":{"text":"Not your average pizza on bourbon street. Very fresh not greasy! We had the pepperoni and ","useful":0,"cool":0},"ncn8rihfR7NLevNR4QHGYg":{"text":"The Pizza is Ok! Not the best, but its doable. However, the service was horrible. Lite ski","useful":0,"cool":0},"mcr1JVN6W-ansD6Gp8IYCg":{"text":"Not vegan friendly, but I pulled off the cheese. I got the veggie pizza with spinach and t","useful":0,"cool":0},"Vv8bZfVBJSBCBGOw49EHNA":{"text":"I don't get super complicated pizza, only pepperoni for me and this was incredible! I'm fr","useful":0,"cool":0},"WmGIyv7OBMfo6ZgRNvbgAg":{"text":"Out of all the slices on Bourbon these are the best! They were hot and fresh and clean. Gr","useful":0,"cool":0},"tcloToilgkf9nSX06ghdlg":{"text":"They have the most decent looking pizza in the area although it is the priciest.\nService h","useful":0,"cool":0},"nVTT-i4CoF1OoQJt9U8kQw":{"text":"Definitely in the top 3 for best pizza I've ever had!\n\nMy friends and I literally went her","useful":0,"cool":0},"1VWT0wGyWurQRv858IYp6w":{"text":"Best pizza ever!! Full disclosure, i was drunk at the time! Still good pizza though.\nWant ","useful":0,"cool":0},"CL_15Q1-ig9wKv9Md96_fw":{"text":"Damn good slice. Can't even describe how good the pizza was.\n\nSuper loud music, but consid","useful":1,"cool":0},"fDkhwjQhYnG3b4JUNi0g7A":{"text":"Very good pizza! Had a slice of the cheeseburger pizza...good...and a slice of the meat lo","useful":0,"cool":0},"KmBTOovuAkkpZiVO4hFJpA":{"text":"Absolutely delicious, huge slices! Unlike most pizza spots on Bourbon, it's worth the pric","useful":0,"cool":0},"ZDCTscQN2_yFkfWAGffCrw":{"text":"The pizza was really good and they are open late. Fresh and hot. Big slices. Worth the wal","useful":2,"cool":1},"iieXxpHqF1eYAdHmbGgKNA":{"text":"It was a quick bite before starting our French Quarter walk.  We had cheese pizza and pepp","useful":0,"cool":0},"x2GDIxVUrdAoMD58eQUvIw":{"text":"Perfect pizza business model for the walk by traffic.  Pizza by the slice, big portions an","useful":0,"cool":0},"feZB25Y3KfXuwk30oVfhQQ":{"text":"They got our order wrong, and didn't try to fix it for us... But the pizza was still so go","useful":0,"cool":0},"QEzU8a4ZglG3DlT0F7AMTQ":{"text":"I liked it...A LOT. They reheat the slice which impressed me. I got the greasy pepperoni s","useful":1,"cool":1},"xr2jc9fSyLk0E_IUjmA4jA":{"text":"Definitely some of the best \"drunk pizza\" but very good sober pizza too. The slices are th","useful":1,"cool":0},"j-tz0PdNnXtzu-Le-giGKg":{"text":"Came here after reading great reviews, but the awful customer service is worth staying awa","useful":0,"cool":0},"We0by3r9nLjn777Lsv0m_g":{"text":"I would give this place 10 stars if I could!! This is my new favorite pizza joint (even ov","useful":0,"cool":0},"h2Yp69zLvGbiApIm0roC7g":{"text":"We've lived in Treme for 4 years and my husband and I finally decided to give you a try...","useful":0,"cool":0},"qtCBGjW7nJSPCQyfEe5oaA":{"text":"This pizza was the best and exactly what you need after walking and drinking down Bourbon ","useful":1,"cool":1},"kja2MXvK_CsLg7AQTYM2VQ":{"text":"Came here after a long night bar hopping. The pepperoni pizza is delicious. The pepperonis","useful":1,"cool":1},"hzJqVUWU4CsvqngplXcA4Q":{"text":"Cheeseburger pizza, even when you're not totally wasted, is good.\n\nThey have other great s","useful":0,"cool":0},"BzbWtwt-8A2t_8JJupEfhw":{"text":"I can't even complain. Hold off on all the other \"pizza spots\" and just make your way here","useful":0,"cool":0},"G4Rj9-9dxOJtBojxgHYxJA":{"text":"I don't ever write reviews on yelp but the disappointment and amount of disrespect I recei","useful":0,"cool":0},"lpglyjt7tFUf3ZT3kfR4Lg":{"text":"Stopped in for a couple slices a week ago, grabbed a pepperoni and the other I think was c","useful":0,"cool":0},"4v0v0oGQGgDxbEf0MlrhgA":{"text":"Wow!  Daughter and I were walking around looking for a place to grab a bite after an after","useful":0,"cool":0},"_G8NrLq679up1AY8XBxkrg":{"text":"Totally loved this pizza place. After a long night of partying on bourbon street it was ni","useful":0,"cool":0},"AiXZFNV1FyoNijBVpR1DQA":{"text":"I understand this is a late night place, for the most part. But at the same time, I've nev","useful":0,"cool":0},"WzWksysxYRppc94vjRtYog":{"text":"Loved this pizza place, best pizza in the French quarter to grab a slice. They also had am","useful":0,"cool":0},"zlvxKxqwouM3CPQbcmbFRg":{"text":"I cant believe that I got better pizza at some sketchy drink bar than here. Pizza was expe","useful":0,"cool":0},"ZL6lbEc4YyTM4Tg7xVWmUw":{"text":"Grabbed some slices because we basically had to wait in this 3 hour line for Preservation ","useful":0,"cool":0},"xyK4w-1zjI4vU_h3EhjWeQ":{"text":"Popped in last night as a last ditch effort to grab some grub. Pizza tasted good and was t","useful":0,"cool":0},"jkDyK196GqVkHOHnsqv2Rw":{"text":"That was the best pizza that ive ever had at 3 in the morning. Pizza slices are huge and w","useful":0,"cool":1},"K0JcLUK9tQOcujd5gjQ8ow":{"text":"This place spoke to my soul.  The pizza slices are HUGE. Like twice the size of your face ","useful":0,"cool":0},"o1T_Nl6SINIAfU-EQC8Gew":{"text":"OMG hands down the BEST pizza I have ever tasted!!! I was walking down Bourbon street one ","useful":0,"cool":0},"ed-f4eL4ZCKcXWrKiTCDnQ":{"text":"I'm sorry but if you like extremely thin, greasy pizza than this is the place to go. I fel","useful":0,"cool":0},"4bKOmU4oSvf6lq-QMOtWCQ":{"text":"Really good pizza! Which I have to say was unexpected for NOLA, but if you're in the mood ","useful":1,"cool":0},"Avs4wpV-mu7vMRK3RpBEeQ":{"text":"Who knew New Orleans had excellent pizza?? Quality toppings, crunchy thin crust and very t","useful":0,"cool":0},"3ca64JhCnbB9Ncav5wa9-Q":{"text":"BEST.  PIZZA. IN. THE. WORLD.  Nothing else needs to be said.  You can't leave Bourbon str","useful":0,"cool":0},"BAu9XSIvmMuTMCM5lOy0_g":{"text":"Huge yet reasonable priced slices of pizza , and also very tasty ... if you need a quick b","useful":0,"cool":0},"yZEeXejW3K3gpMXL-bUqCg":{"text":"Good pizza on Bourbon St. Nothing on Bourbon St. warrants a 5  review so it's about as goo","useful":0,"cool":0},"NaV76MKVIdN3BKlF-tK_2A":{"text":"Best pizza!! I tried the Chizzaburger, the Spin n' Shroom, and the BBQ pork. Best pizza of","useful":0,"cool":0},"zeYGQdQVbDejDZHGD7mlUg":{"text":"I highly recommend this place! We stopped here because it was the closet pizza place from ","useful":0,"cool":1},"rMsdg6Z1owoN_rhPglJfrA":{"text":"Bomb.com what can I say this is this best pizza in NOLA I tried other spots and trust me t","useful":1,"cool":0},"I_NwSCAMLjGiYoqYE5hlwg":{"text":"BEST freaking pizza!!! Omg, the bbq pulled pork pizza was amazing. Even the cheese pizza w","useful":0,"cool":0},"vHeDdC6SCSaDRCWpPyWOBQ":{"text":"I love finding amazing pizza outside of New York!  This place made my day.  Monday was Nat","useful":6,"cool":2},"I8QGevevBRnfYiOeoJgUqA":{"text":"Pizza works is the best pizza in New Orleans. The stop has so many different assortments o","useful":0,"cool":0},"5eIjoIOuMwKaHX3vpl_BXw":{"text":"Based on my group, we give this place a food 3.5. There are some really unique flavors for","useful":1,"cool":1},"3c4SEpyID2Xdk5E7o9w0ww":{"text":"Meandering the streets of NOLA we got to the point of starvation and found Crescent on Yel","useful":0,"cool":0},"E0kVPQNjWcmoQGFZfa8_pw":{"text":"I was there on 04/21/19 afternoon. Hated the harsh attitude that was given by the female s","useful":0,"cool":0},"UdlbaSYHH1lZNtiytVdxuw":{"text":"Omgggggggggggggggggg should I even tell you the secret! Lol okay well this was the best pi","useful":0,"cool":0},"sYQHBfbW2sBSTxmATI0-TQ":{"text":"The bbq pork pizza with the cinnamon apples is probably the best piece of pizza I've ever ","useful":0,"cool":0},"cPMR6jeyocvSd5rH3vLjbw":{"text":"We stopped in to grab a few slices to bring back to our hotel after a busy day. The staff ","useful":0,"cool":0},"Xvs7-4qwbxNirdsNCK4loA":{"text":"The pizza tastes fine. Especially at 2 o'clock in the morning. However, please expect the ","useful":0,"cool":0},"DP2N1UAswMvDbNUvNw0XrA":{"text":"I don't know if I was drunk but this was some delicious pizza after a long night on Bourbo","useful":1,"cool":1},"_f3Uiu9ovwZ7VHat2mOAmA":{"text":"My Cheezburger pizza was delicious. Literally just like eating a cheeseburger and the pick","useful":0,"cool":0},"4egWvodQicmLCYMkPaWUNA":{"text":"Huge,cheesy and filling pizza slices. Great for a quick lunch or late night meal. 1 slice ","useful":0,"cool":0},"fKk2T4zK1XGZRbG6PPH7dg":{"text":"This is a clean, well-functioning gem tucked away amid the filth of Bourbon street. Aside ","useful":0,"cool":0},"3yYDENEXumrcDfnJxUS5Fg":{"text":"My husband is a pizza lover & based on reviews, I suggested this on our first evening in N","useful":0,"cool":0},"cbUlhXtpC12HLtFCoMfIUA":{"text":"Amazing late night! what unique pizza options. So good and so nice to have something in yo","useful":0,"cool":0},"CwI4qeoAZBRZlmex9U7ulw":{"text":"Tastes great drunk! Not as good sober.\n\nHuge slices. Super greasy. About $4-$5 each. Class","useful":0,"cool":0},"Kst59tuwJC0yznHM7Q1EaQ":{"text":"Being from the north, I'm a bit of a pizza snob. I will say this was pretty much the only ","useful":0,"cool":0},"c6vNjBCQFds7od8eoVkcOg":{"text":"The pizza here was delicious and fresh! Also, great staff! The line was long but went by f","useful":0,"cool":0},"mKeZhbcCZMBHF5zm_CGwlg":{"text":"Even if it's in French Quarter, $5-6 is still pricey for pizza, especially New York style ","useful":0,"cool":0},"36DWGrrsKME1aV9JONNbwQ":{"text":"Good pizza.  Cold beer. Good people watching.\nGot a large pizza and 2 cold beers and took ","useful":0,"cool":0},"klTyb5RstdtDUmeYCA2WlA":{"text":"Had the pulled pork apple pizza. Sounded weird, but it was delicious. Highly recommended i","useful":0,"cool":0},"ouuKD7AW0oyYJ0wKLkyBSA":{"text":"Best pizza shop on Bourbon Street hade down.  Next time I am in town this is where I am he","useful":0,"cool":0},"fZlOoW0wJKEmSXRpj2K4jQ":{"text":"BEST PIZZA IVE EVER HAD IN MY LIFE. I was in New Orleans for four days and came to this pl","useful":0,"cool":0},"flDCwdomXe3J7H1AyU_qMQ":{"text":"I had the\"chicken bacon krunch\" and my wife had the \"it's being green.\" Both were deliciou","useful":1,"cool":0},"z0CQIMBtFzh4QPA_3qBNSA":{"text":"Omg best pizza when your drunk!!!! I kid you now I had 3 of those big slices and it was so","useful":0,"cool":0},"NCjCBlU-7b6Ax0P8vS4KnA":{"text":"It's even good sober! Amazing service, also! One slice is definitely enough to get you stu","useful":0,"cool":0},"6odFr2DMjON17N8sDcY_5g":{"text":"The best pizza you will find on bourbon. Honestly their ingredients are of a better qualit","useful":0,"cool":0},"0QRolwD14gRkhSg1YLAwkw":{"text":"If you're from NY and you like fold over pizza this is the place. So good. One of the best","useful":4,"cool":4},"yJP1ryLanbntfQXOmI9iGg":{"text":"People are always surprised when I tell them the best thing I remember eating on my vacati","useful":0,"cool":0},"hLda54uaNn1Kl2F1SuGYjg":{"text":"Just FYI this is pizza by the slice (5$ a slice). It was good but for family of 5 we were ","useful":1,"cool":0},"Wh5ZzwyuRaBCmBFtHWTc3Q":{"text":"After giving them a month (and many chances. Owner(s): I'm #50 if you'd like to check) sin","useful":0,"cool":0},"BnOcFu3HSFlEUKdkmD0kzA":{"text":"We wanted pizza today. Overall the pizza was good but the lady taking our order was rude! ","useful":0,"cool":0},"j1Xv3M30h5PjAzm8xRJZGA":{"text":"This pizza is exactly what I crave when I think of pizza. Delicious, chewy crust... genero","useful":0,"cool":0},"KByIYoKx6NuW_iDSdp6z-w":{"text":"What can I say? I came in, spent $5 on a huge slice of pizza, courteously ate it in under ","useful":3,"cool":1},"f9dji9gzOwlOFVC_oPOw_w":{"text":"I absolutely agree with the review that this is the best pizza in New Orleans. Hailing fro","useful":0,"cool":0},"wlVTc4k2wAFW-nRoL3nz8Q":{"text":"Who goes to NOLA and eats pizza? Um.. THIS GIRL! There is no wrong place or time for pizza","useful":0,"cool":0},"sw4MpfmO6o2p4bZxuH7KFQ":{"text":"Best pizza in New Orleans would give them\n10 stars if possible came in at 4:16am got a fre","useful":0,"cool":0},"vYwOmXm83llQLoeDS90P9g":{"text":"Good pizza right in the middle of Bourbon Street. The slices are bigger than your face!","useful":1,"cool":1},"3BnarOd4AYuGM9topLHTUg":{"text":"We stopped by here after a night on Bourbon St. and were very pleasantly surprised. The pi","useful":0,"cool":0},"ArfNDOaslsygZhWzRA_STQ":{"text":"Customer service is nonexistent here. My friend ordered two different type of pizzas and w","useful":0,"cool":0},"33y35BOrmQVwA6Qm3ivZaA":{"text":"While roaming around Bourbon looking for new ways to intoxicate yourself, occasionally you","useful":0,"cool":0},"j9CtH0Df6OH0JO_MOhNtGg":{"text":"Yooo... This place is the best! Also the chick with the green hair was super nice and even","useful":0,"cool":0},"9iu6iVxoGzI9Cg7k01Tm3Q":{"text":"There are a number of places on Bourbon Street to grab a piece of pizza while strolling th","useful":0,"cool":0},"pt4Ht-SqKgFL07YzO7_LPw":{"text":"Hands down the best pizza on Bourbon street and maybe even one of the best pizza I've had.","useful":0,"cool":0},"NAMT_53NIFiK4mrhUHKnmw":{"text":"Hella good. Was worried it was played up by tourist like myself. But being somewhat of a p","useful":0,"cool":0},"CRPdVHXHtQ5uc2E92MT1pw":{"text":"Waaayyyyh better than it needs to be. By far the best drunk food option on Bourbon Street.","useful":0,"cool":0},"5P-6tPoCi0_eZVM_nHKJCQ":{"text":"Picture it: Mardi Gras Day. You have been going hard for seven days straight. It's 2pm and","useful":2,"cool":2},"_2U-qdxJSVd3eerB-RsP5g":{"text":"Being from Chicago, pizza hits close to my heart! Crescent City located on Bourbon is just","useful":1,"cool":0},"SUyHP6awzSYIvuOK7Hvm1w":{"text":"Pretty good on the way home from Bourbon, especially if you're drunk! Slices are big, not ","useful":0,"cool":0},"BKWBKiCB1bI3QNPF9MaGRw":{"text":"No idea how the pizza is, it looks decent.  I'm assigning one star to this place because t","useful":0,"cool":0},"sFzs3lIlAMx4BMxcE6cyew":{"text":"Huge slices perfect for after a night out! People were real nice even after dealing with d","useful":0,"cool":0},"QtWa26WXYp830iGRMAUsuw":{"text":"Just go there is all that needs to be said! We went twice and tried a different slice each","useful":0,"cool":0},"F35tbRdCM60E6Lq0skR93w":{"text":"Hot and fresh and tasted great! Friendly service. They have about 10 seats to sit at. Bour","useful":0,"cool":0},"icRVUoRyZkEqo8xXZVuN_g":{"text":"+\n- Cheeseburger pizza tastes just like a cheeseburger\n\n+/-\n- Long ass line, but it moves ","useful":0,"cool":0},"LfQRywEgjAZfhIkWvmnCwQ":{"text":"For what this place is, basically a hole in the wall on Bourbon St., the pizza was pretty ","useful":0,"cool":0},"FtP66ZKNNg-OsGOkOQHLmQ":{"text":"Listen, this is decent pizza for a drunk person or just something to snack on. I did like ","useful":0,"cool":0},"Dq1nUaMNfd5JS8knmOIYEA":{"text":"Hits the spot late at night.\n\nAnd as a fan of frankenfoods, their cheeseburger pizza is pr","useful":1,"cool":0},"9ThLBdQMBHRXvKuVCFiPOw":{"text":"You need to know if you need a slice of pie at 11 at night this place has a slice of pie l","useful":0,"cool":0},"K3tF6L8_RBcBUuE0-Aj05w":{"text":"This place is overrated not worthy of the money the charge $4.50 per slice. Not bad but no","useful":0,"cool":0},"L8CDu0TmBbkm6lJUoV6dZw":{"text":"Pizza is very good here!! A lil pricy at $5 average slice, but yeah good ol greasy peppero","useful":2,"cool":1},"J4h_x2yvn2JC_xB7E4zvEQ":{"text":"Juicy and tasty pizza. Just like the famous Joe's pizza in NYC. The place is clean and mod","useful":0,"cool":0},"VVC1i4fJyQ_NGIhNt4RsuQ":{"text":"i'm from the DC area but every time i come to NOLA i make more than one trip to crescent c","useful":0,"cool":0},"3icQM4rDffbm_DK_PHR94g":{"text":"The pizza here is great and reasonably priced. I always get the buffalo chicken slice, but","useful":0,"cool":0},"fzJzOR4RVPt-0cFER6ceQA":{"text":"Absolutely delicious jumbo slice pizza. I had the BBQ pork slice and it was the greatest f","useful":0,"cool":0},"7AAPVOnzZ5XXiyM6JN9-ng":{"text":"Still some of the best in NOLA.  Pepperoni is true NY pizza.  Had it again today and it is","useful":0,"cool":0},"2Aq4YozFgTo3C8gMECkLbA":{"text":"This place is my FAVORITE pizza place to come to when I come to Nola! If I could order it ","useful":0,"cool":0},"uDxo2DUebnaezXVNkHVRkg":{"text":"We stumbled upon this pizza shop on bourbon on our first ever visit to New Orleans and com","useful":1,"cool":1},"_Vyj-MHypTSYyxcnTZ8iVw":{"text":"In the heart of Bourbon Street, you have a great pizza place.  The slices are huge and run","useful":8,"cool":11},"crTtsjypyvYPep2bPd4OyA":{"text":"Best New York style pizza in NOLA. Many topping options, great New York style crust. Only ","useful":0,"cool":0},"H_Bf9sSb2a12GVrAyDuWyw":{"text":"A great spot to stop for a slice. New York style foldable pizza and not too fancy so it sa","useful":0,"cool":1},"EqWuuCLlb-iNNvFraBsnnQ":{"text":"I sat down to take a break and couldn't keep my eyes off of the (CHIZZABURGER) cheeseburge","useful":0,"cool":0},"Z1e7NFp1n0wlS66a4QaHMA":{"text":"Was SOBER as it gets and it was AMAZING!! Tried it our last night and so good we went back","useful":0,"cool":0},"ew_MfpjqcQXxAdZP9MhxRA":{"text":"What if I told you that you could actually find edible food on Bourbon Street?  What if I ","useful":2,"cool":0},"LIMlZmn_XsuEkpsdke0ctg":{"text":"Best pizza in town! Different selection, quick friendly service, clean restroom. Loved it!","useful":0,"cool":0},"COUkZysPrM-pmPxCm38-zQ":{"text":"Best pizza in NOLA - hands down. The staff is also extremely friendly, they made sure they","useful":0,"cool":0},"8o7JuOHEho2t4I4g6irCrA":{"text":"It's a hole in the wall pizza place that serves large NYC style slices for $5-6. Each whol","useful":5,"cool":6},"xlTTLQYhVS9HCO3w4dIgiw":{"text":"Ummmmm. I'm from Chicago. This pizza was on point !!!! Im drooling just thinking about it.","useful":1,"cool":1},"uO4qNDFRJgxPhpMGYEbj3g":{"text":"We ate here our 1st night on Bourbon Street... Twice. The Wife loves pizza, happy Wife hap","useful":0,"cool":0},"8lSAW2HKP1RcYsFWnejANw":{"text":"Delicious oh so Delicious. Love the play on words regarding the naming of this restaurant;","useful":14,"cool":7},"8FxWl3yfyQSBStEeLI55kw":{"text":"Came in for pizza after a long night walking and drinking on Bourbon street. This is the g","useful":0,"cool":0},"LZNUzJP133TMa8rlJ9H7LQ":{"text":"Where has this pizza been on all those late nights/mornings I walked home after a night of","useful":5,"cool":3},"dVVzbU_-wVLNPfqcUluYyQ":{"text":"Had a Piggy Pepper and a Spin-And-Shroom. Points for interesting toppings. Crust was kind ","useful":0,"cool":0},"EUS7HYchnMolTf2apFxH5w":{"text":"This place is the bomb. Thin chewy crust... savory sauce.. thin Chrissy pepperoni. Legit","useful":0,"cool":0},"37COzmdLjG5cu0brG30YSg":{"text":"Crunch bacon chicken pizza was filling and delicious. With some red pepper flakes this piz","useful":0,"cool":0},"TErLXIBJNNI_GusU5eDnWw":{"text":"This is a surprisingly good pizza place in an area not known for pizza. It is open late an","useful":0,"cool":0},"T40S9rp1AvJEmoWlZUS7Ag":{"text":"If this was in any other city, I couldn't give it five stars because the atmosphere is so ","useful":1,"cool":0},"yb7eeyg3S56XLiqG43E-UQ":{"text":"We waited in line patiently and ordered calmly. When we asked for a box, it was thrown at ","useful":0,"cool":0},"VgPtw3elbodp0SLqVSLrrg":{"text":"Surprisingly good! Amidst a bunch of seedy bars but the open air concept and fast service ","useful":1,"cool":0},"tON4wwQD-ALN9IKs8ieoSw":{"text":"Stopped in while strolling down Bourbon craving a nice slice of pizza. NOLA Pizza in the q","useful":1,"cool":1},"EkGNsNETmkPZEVio83-hsA":{"text":"Would've loved to have had extra cheese on my pizza but was told no. I was prepared to pay","useful":0,"cool":0},"sfIfYweJ4dwYbjBGx4yq-A":{"text":"I picked up a slice of BBQ Pork Pizza - I gotta say, it was still haunting me  almost a we","useful":2,"cool":1},"5yAOpEYf0UdslgHhMgEkeQ":{"text":"The pizza was good.    The slices are really big.    The names of the pizzas are awesome. ","useful":0,"cool":0},"5b04EQ4sLjbk5qmnwGH5dg":{"text":"Best pizza on bourbon street!!! Definitely must try especially after a night of drinking a","useful":0,"cool":0},"Cy7hICiQBbamSbRLIANocw":{"text":"Loved the pizza here! Had it almost everyday I was in NOLA! The pizza is very tasty and la","useful":1,"cool":0},"NC2AzhhvpqMBwIMJ378kMQ":{"text":"My first visit here was on Thanksgiving Eve, when my friends and I were trying to find ope","useful":6,"cool":3},"LpkbjwEWVVuHc1VICfyERg":{"text":"Restaurant isn't bad huge pizza of slices. Afternoon staff is very friendly and welcoming,","useful":0,"cool":0},"gMuP9yKVHeDHq7bYj0_qNg":{"text":"Great pizza, we are not seafood eaters but this pizza place rocked ... enjoyed every bite!","useful":0,"cool":0},"BBeIkZawC9UpOzRLLSP_Wg":{"text":"This is some of the best pizza I've ever had! It's on Bourbon street, so the ambiance is p","useful":1,"cool":1},"eE1uwCCcqdaXlwuqAajYug":{"text":"Best pizza ever. Ever time I come to NOLA I stop and get pizza multiple Times per trip. Re","useful":0,"cool":0},"V92v3DQJ-N24_n2HLrR3lQ":{"text":"Not a bad drunk food option with large pizza by the slice options for about $5. Had a coup","useful":0,"cool":0},"FZ4FOln4msB-eLBw0Q4XeA":{"text":"Had been seeing ads for this place for months, and finally decided to give it a go a few w","useful":0,"cool":0},"YAgikPSOGNY0sV0EI-91Ug":{"text":"This place is pretty great considering the area and other pizza options on Bourbon street.","useful":0,"cool":0},"2e-CoS-YyxUJ2M3CqdTLnw":{"text":"Usually consumed as drunk pizza, this is actually pretty good pizza when sober. We were th","useful":0,"cool":0},"FZHJQCZFB-U1h34TzA1O2g":{"text":"Ordered in one nite and heard this was good. Ordered a pizza and single handedly ate the w","useful":0,"cool":0},"8CqquMBufl0MoQvNf6_hWQ":{"text":"CCPW in the quarter was a good pit stop to grab a bite to eat while walking around the are","useful":5,"cool":3},"CBz8z8n85VogEeCNOW808Q":{"text":"This is the place to go if you want to get pizza on Bourbon street. Don't bother going any","useful":2,"cool":0},"F-JdmuKxYS_tLht7CfJg_Q":{"text":"Back in NOLA this past weekend and Crescent City Pizza Works was just a good this time aro","useful":1,"cool":0},"F9MTvWypPwlpwuvg9BNHpQ":{"text":"Decided to give this place another chance....what a mistake. Firstly, clean up your counte","useful":1,"cool":0},"N75UOC8jTX-qq7ceRfavhw":{"text":"The pizza could have very well been delicious but I only had one bite. Cockroaches on the ","useful":1,"cool":0},"AYECldJELHNMzVXX2TKucA":{"text":"The pizza was dope. Had a awesome mixture of ingredients. I especially loved the pork, app","useful":1,"cool":1},"LChRHPOr3kMXXl5KaPKW2g":{"text":"Who knew late night drunk pizza could be just as good or better when you're not intoxicate","useful":9,"cool":6},"EPtRzAkM241juS8ZoVlj1A":{"text":"While I'm from Buffalo and was craving pizza while visiting New orleans, this was where ev","useful":0,"cool":0},"q46CxyeavlosW5X0aQZbHA":{"text":"One of my absolute favorite places to order in from when I'm staying in New Orleans. The p","useful":0,"cool":0},"tRFMNXZQvfFM11lOTpA5Bg":{"text":"I was really surprised by the variety of pizza toppings options here. It is a pizza-by-the","useful":0,"cool":0},"hDiLNBTxlt_LRse1ihO7gg":{"text":"I just went to this joint a little bit ago. I wasnt even drunk and the experience was posi","useful":0,"cool":0},"3HH1raNWlft52LurZZHYjQ":{"text":"The girl with the green hair called me fat as I ordered pizza. She had a terrible attitude","useful":0,"cool":0},"NriMv8X8e3UxvLJvFAIo8Q":{"text":"Best pizza around!! Extremely friendly, nice staff and great prices for this area. Large p","useful":0,"cool":0},"G1StHbU9cPXkqJfXzv_S7Q":{"text":"I owe Crescent City Pizza an apology for prejudging it. I'm a repeat visitor to this city ","useful":0,"cool":0},"sAMWar12hYoUz-OQZME9fQ":{"text":"Hands down some of the best pizza I have ever had. With the location and hours of this spo","useful":1,"cool":1},"H94adY_7DdpJNjIJ1L9y1g":{"text":"What is the end to a great night? PIZZA. Crescent City Pizza Works is located right off Bo","useful":3,"cool":0},"3QGFET5GJ_4OMOpGORYprQ":{"text":"This was a fun treat while in New Orleans! Any place that puts chips on a pizza is dynamit","useful":0,"cool":0},"gmhztSi3uj_F-VTY-umdOA":{"text":"This pizza shop comes in handy. Why? Because it's right in the center of a boulevard consi","useful":1,"cool":2},"Qf0IzTpB2zCoXbRoduKmfg":{"text":"Best pizza spot in Nola. They have a variety of different pizzas. A few of my faves are \"i","useful":1,"cool":0},"U4aZA02bGkJdkkIGIXhH5g":{"text":"Pizza by the slice is pretty good, but the owners or manager (dude running the register fr","useful":0,"cool":0},"r2amtwr4n-qrfVzqsvgjwA":{"text":"Probably very good if it's 2 am and you're drunk. The person serving the pizza twerked whi","useful":0,"cool":0},"IFM2s6nISqZw6730UdqgoA":{"text":"Troy is amazing. Very friendly and made me smile. \nCool cat. Will come for the pizza and T","useful":0,"cool":0},"fByBYegbelXqQpOR2Uctlg":{"text":"Ordered 3 pizzas to go for a party of 8 and they were all delicious. We ordered one cheese","useful":0,"cool":0},"HIPx3vrbKc548M5mVx6WeQ":{"text":"Love the pizza... they have beers also... crowdy place..lot of ppl come for this pizza","useful":0,"cool":0},"nVe5J23eei0prauMRBPJWw":{"text":"Average pizza with thin crust. Crust was good but the rest was not super tasty. Not a lot ","useful":0,"cool":0},"djjSYtl-U4HJV6COXw_YwQ":{"text":"Great late night bite near bourbon street. Pizza slices only $5 and awesome size. The pest","useful":0,"cool":0},"oMKEviX3vukkpSF_uD4-Lw":{"text":"do not be fooled. this isn't just any pizza joint on Bourbon st that caters to the drunk m","useful":0,"cool":0},"JykNOoEL8HQSQJHDtIoM5w":{"text":"Hot, cheesy, oversized slices of pizza goodness that reminded me of slices in New York. Ye","useful":3,"cool":0},"RYmTWZPmTZiZfmmHpnjFWw":{"text":"Had the cheeseburger pizza and my daughter had the chicken bacon crunch i was so sad when ","useful":0,"cool":0},"yAuHevqPrR38vpd4A_elIA":{"text":"The pizza here is probably the best I've ever had. I especially loved the \"green pizza\" we","useful":1,"cool":0},"EO-UUnZPljrRjRTDQFuRKQ":{"text":"That slice of pepperoni the size of my head just might be the single most delicious slice ","useful":0,"cool":0},"gzJYWtZuel-MwmT6gDodtA":{"text":"Holy crap this is some awesome pie. Reminiscent of late night NY style pizza. $4 for pract","useful":0,"cool":0},"88UwU8HTrLyK5Ic-niEQog":{"text":"The first experience I had here wasn't bad at all, but the second time..... was horrible! ","useful":0,"cool":0},"q_tpWIjGoDzE4-idIgLHqQ":{"text":"This was a gem with the chaos of Bourbon street.  Fair prices, pizza was pretty good.  Lov","useful":0,"cool":0},"csTbUW8iLD6fqbAzZPHiUg":{"text":"I had some of the best speciality slices of pizza I've ever had at Cresent City Pizza Work","useful":1,"cool":0},"Z0HJTZi23TiXVeS_Krdhcg":{"text":"Try the chizzburger pizza - tastes JUST LIKE a real cheeseburger!! Also pepperoni and the ","useful":0,"cool":0},"S6EhMzwzBlUiRPds-sWScA":{"text":"Pizza slices are 5.00 and they are huge! Folded over and still larger than 2 large slices.","useful":2,"cool":2},"516gRnCJdVnV8IRkwzv48g":{"text":"I had the chicken, bacon, and kettle chips pizza. It was delicious! My husband and I were ","useful":1,"cool":0},"eJu7o8S0VZDcPRFWxnmFfg":{"text":"I looked through a lot of reviews before deciding to spend my money at Crescent city pizza","useful":0,"cool":0},"Mh5z78VCCHlNAJIxg8HgUA":{"text":"Durance made our experience great! He was super friendly all while working hard to accommo","useful":0,"cool":0},"hlzIcN47YSeo9jU5x5ivJQ":{"text":"Great pizza, 2 gynormous pepperoni slices and a 24 oz Yeungling for $18..little steep but ","useful":0,"cool":0},"5slqK0H8xs2DJTHmM3wfkQ":{"text":"Finally the quarter has quality slices...but at a price of you want a pint with it!  16.50","useful":1,"cool":1},"tv7Yj2Gwvo1QSOQm_MkbDA":{"text":"Had their pizza pre-covid and when I was drunk, but from what I remembered, they were pret","useful":1,"cool":3},"AZu6By4pVcpD0_NRwlZ8RA":{"text":"I'm not exaggerating when I say this was the best pizza I've ever eaten (and that's saying","useful":0,"cool":0},"HxkkbG2N41ftMhL5gEzxFg":{"text":"Some of the best pizza in NOLA!  Their pepperoni is a true NY pizza slice and is delicious","useful":1,"cool":0},"6vq5s_L7hP-yetKpnVP6Pw":{"text":"Great pizza on Bourbon! Grab a bit for lunch or late nights when the alcohol has taken ove","useful":0,"cool":0},"2PHftECpaycM3jBfdzdwTg":{"text":"Based on the positive reviews I can only conclude that I've had the misfortune of experien","useful":0,"cool":0},"SNxj-oBCFbP4aLQSTOcBuQ":{"text":"The staff is super friendly and the pizza was my favorite on Bourbon Street. The slices ar","useful":0,"cool":2},"C6QaQoikPwXxEzMUxOHJDw":{"text":"Stopped in for a quick lunch. Delicious pizza. Best I've had in a while. Everything was fr","useful":0,"cool":0},"PfEzo-PF85Z9EY6mlnInww":{"text":"Chicken Ranch Krunch is the BEST. Superb post-alcohol grub. The staff was friendly and thi","useful":0,"cool":0},"o5MmKft6f3VtiIkxXARzEw":{"text":"This was a good late night pizza place. The slices were huge! A cheese pizza is 4.50 & a p","useful":0,"cool":1},"dqYyPjkGohTz1oln49wn-Q":{"text":"SOOOOO GOOD!!!!! Stopped in for a quick bite while stumbling down bourbon. Best pizza I've","useful":0,"cool":0},"1HO2kT-tGWW3LGcvksH7LQ":{"text":"I have to admit the first night I went to this place I wasn't impressed. I guess after a f","useful":5,"cool":4},"o9pZUwhccsF-iqIXngY7EQ":{"text":"Pizza is delish and fresh and people are rocking out to \"Enter Sandman\"\n\nDoes a review nee","useful":4,"cool":2},"7I3iltWT2I0m8Mxxv7nfxA":{"text":"Best pizza I've had in a long time. I loved everything about it - the ingredients were so ","useful":0,"cool":2},"rORYdSL--PDSSmYoeySmBQ":{"text":"Some of the best pizza I've ever had personally. \nHad the BBQ and cinnamon apples. It was ","useful":0,"cool":0},"U8TpySpOaft021XPN76Gew":{"text":"Best pizza by the slice place in Nola! Fresh and delicious choices! The staff are super fr","useful":0,"cool":0},"FjLhQ9xLzRES-HfhxtaeQw":{"text":"Service was amazing. The lady behind the counter was so kind and helpful. Pizza was great.","useful":0,"cool":0},"B3iVA7uYaT1itdLOfvezkg":{"text":"Coming from a city famous for pizza, I really did not want some crappy pie, even if it was","useful":2,"cool":2},"N05V_J1l-2uAbzz2oH6fTA":{"text":"My kids were craving pizza and this place came well reviewed on Yelp.  We checked it out. ","useful":0,"cool":0},"WEwty7sFYiqUskCndzzDXg":{"text":"This review is written with a completely sober mind. Sometimes food can be extra good. Esp","useful":2,"cool":1},"NjOoZ4TMYoCrGLOs-HgwJw":{"text":"This pizza slays. Its a bit greasy but its on bourbon street for that reason i guess. I kn","useful":0,"cool":0},"tEneqY5RRgabHpg52wD8iw":{"text":"As time has passed I have to adjust my review. These guys have taken every criticism to he","useful":0,"cool":0},"8CqfFI-FrTtyTENNhSMvtA":{"text":"The best pizza in the French Quarter hands down! \nIt's rare these days that I'm out late a","useful":6,"cool":2},"VivWZN15_g86J2wbcG4D2g":{"text":"This place is a great spot to get a big slice of pizza when you've got the beer munchies o","useful":0,"cool":0},"A-inF5Y_Nr252tzorel6og":{"text":"Solid pizza by the slice joint. We got the BBQ and Cheeseburger. Both hit the spot. Perfec","useful":0,"cool":0},"IVzjLum0BgtjrrMmnjUVtA":{"text":"The place to be after a long night of drinking on Bourbon street! A group of us stumbled i","useful":1,"cool":1},"hDGfvl8dvj2XtsMDWTZVjA":{"text":"Absolutely LOVE this pizza! Tried it for the 1st time last year while in NOLA for Jazz Fes","useful":1,"cool":0},"d5jnn4XPdFP18KEwb1yIfA":{"text":"Unimpressed with the pizza.\n\nI had a plain cheese slice and a vegetarian slice. Both were ","useful":4,"cool":1},"U_Mwhnuj0EFvfuVwXJvdSw":{"text":"CCPW gets the job done every single time. Whether I've had a few drinks or simply craving ","useful":14,"cool":8},"SeJNtK9hAybYkZBAQ555Ag":{"text":"Chicken bacon pizza is DELICIOUS! Slice sizes are big enough to share so you can try more ","useful":0,"cool":0},"4kkYB8-euKjim5YPxtDLSA":{"text":"Good pizza, fast quick service! Better have pizza than have bad seafood anywhere else with","useful":0,"cool":0},"rEV2lDtb0ONtUbwinOBSxA":{"text":"It's a really below average pizza \nDrunk people might love it because it's easy for them t","useful":0,"cool":0},"hwGIx8UyO1DNjDfVgXp5Ew":{"text":"My wife and I had our first couple of slices the day we arrived in New Orleans prior to bo","useful":0,"cool":0},"WcUASgt3GK2Mkwk0RWiXbQ":{"text":"Wow!  Talk about good pizza.  We were walking Bourbon street and I had a hunger for a pizz","useful":0,"cool":1},"SzEwo6tbJHmylbw3pxLGGQ":{"text":"Dope place to get some good ass slices! they had a variety of pizza- I legit ate 3 slices!","useful":0,"cool":0},"25Ysq9qvWaxgSHMHV0Vlrw":{"text":"Best pizza in NOLA, hot and ready at all time. The crew is super friendly and willing to h","useful":0,"cool":0},"-d0aB-tHhUl4hQThmW_KhA":{"text":"This is like the closest to New York style pizza I've had in a while, plus their flavors a","useful":1,"cool":1},"sJhwL988vLDoBhJiTaJxuA":{"text":"In town from Texas and I've ordered from here twice. The three meat pizza is one of the be","useful":0,"cool":0},"Qe0beqe0z7yMiIQwQ3GEgw":{"text":"this was great pizza after a night of too much alcohol! we came here twice on our visit to","useful":1,"cool":1},"mNwG7bze-iZOPfYiRf_4Aw":{"text":"Ate for lunch and it was AMAZING!! The pieces are huge (like really big, seriously) and fu","useful":1,"cool":0},"z0ipH3unAHsKPJvJL4vbwQ":{"text":"This is the worst pizza  I've ever had in my life. Such a disappointment. Where is the che","useful":1,"cool":0},"lUiC-OwE3L2UN8emNVxPag":{"text":"This place is AMAZING. After a long night on Bourbon Street (first time), we stopped here ","useful":2,"cool":0},"uYk56YE-EWd5cB4j9qYJug":{"text":"We have all found ourselves in need of a quick bite/some sustenance during a late night in","useful":1,"cool":0},"zSMZ2qFqAGgLx0oENRMSzw":{"text":"$8 for a slice now???? Completely taking advantage of drunk people on Bourbon. I'm extreme","useful":6,"cool":2},"1PA9sKnHAvpOTy3qrrAjpw":{"text":"Last week they were amazing. This week they're already becoming \"Bourbon\". Last week when ","useful":0,"cool":0},"vZ9Dt0Zwl7pZ-CG9e_FLRQ":{"text":"Good pizza, good people. Who can you go wrong?\n\nHad an excellent large thin slice of peppe","useful":0,"cool":1},"km8oKJ9-e28z2NAKKb7wGg":{"text":"Pizza was good but crust was real soggy. Kind of expensive for what it is. Bathrooms were ","useful":0,"cool":0},"qVlSZHkKsTyITG9QDCpdWA":{"text":"Pizza was pretty good... had the cheese and my husband had the piggy. My slice of pizza wa","useful":0,"cool":0},"fvnSdGOLEyaqhPkRgTUfrw":{"text":"Let me tell you the Experience that I have had with the entire crew has been on of the mos","useful":0,"cool":1},"Ap1kWW2ZaZxUHyXaeHJVGg":{"text":"Best pizza ever!!! Nice and warm, for only 5 you get a big slice! Would recommend. It's ty","useful":0,"cool":1},"EJj31WGGQKrQPFUIsdQ7mg":{"text":"What you see is what you get. The pizza is fine but not great but when you are hungry and ","useful":0,"cool":0},"qsEZTQ8ugdxFGUkGwIbcXw":{"text":"If you're looking for a late night grab while walking down Bourbon Street, this is the pla","useful":1,"cool":0},"IjRItisaL1TG9kX_HpvwoQ":{"text":"An awesome thin crust, which hits the spot when you're having a night out on Bourbon Stree","useful":3,"cool":2},"otXNoEz5liCjfSJ-O-YMiA":{"text":"I would never write such a review unless it's a serious matter. Thus, hoping to reach mana","useful":32,"cool":9},"WdJb-jkw0tl8QVoZPHesgw":{"text":"We yelped for a pizza joint on Bourbon Street, and this spot won per reviews.\n\nThere was a","useful":1,"cool":0},"EarrQxwkAaLbVwdRDjwMjA":{"text":"Absolutely the most delicious pizza I've ever had. Tonight was my second night in a row. A","useful":1,"cool":0},"1L7Ty2sQw8TZSb2312E15g":{"text":"When you want a slice, you want a slice & Crescent City Pizza Works delivers. Located righ","useful":1,"cool":1},"Li3FYqD5TfrGTlZm8I53PQ":{"text":"Pizza was good and liked their variety. The time we went the line was short so no complain","useful":0,"cool":0},"Ms1x0E0haXvKaulPXgdnkA":{"text":"From what I can remember lol! NO, I love their pizza I use to think about it all the time ","useful":1,"cool":0},"VOZoMs0b9UU4UeqkU6cbdQ":{"text":"This place serves up absolutely delicious pizza, and in massive slices!!  Each slice is ab","useful":2,"cool":1},"x8MpYq1lVobAUCl25rBGgw":{"text":"They had someone working the front alone on a saturday night. The pizza was fine I guess, ","useful":1,"cool":0},"o3_smiwHQuxw5z_KfuIG0g":{"text":"Best pizza on bourbon hands down. It taste freshly made every time. A must stop in New Orl","useful":0,"cool":0},"2mB8em4BKBK16eJcr6zngQ":{"text":"Fantastic huge slices. This place opened my eyes to cheeseburger pizza topped with pickles","useful":1,"cool":0},"5a9Q7WU0iENQoxJLrgHk0Q":{"text":"This place is amazing after a night of drinking. Friendly staff and good food! I recommend","useful":0,"cool":0},"OFY1zUCvJDhJCCS8JMH1Xw":{"text":"I came to this pizza joint on the recommendation of David G. and I am mad that I did becau","useful":3,"cool":0},"DuAkVIa_pr4Rink09FtNcw":{"text":"The Chicken Bacon Krunch pizza is LIFE CHANGING... no joke! \n\nI had picked up a slice of p","useful":0,"cool":0},"HrNcOCJyDEt76lCD5pdy-A":{"text":"I liked this Bourbon Street pizza shop's focus on doing two things, and doing them well - ","useful":10,"cool":9},"Rci4HjrHDp3UF1gFziR_rg":{"text":"First off we walked in to get a pizza but went straight to the restroom to wash my hands a","useful":0,"cool":0},"Wzsc8AyIuDHrPwZvscI0xw":{"text":"Alisha and Travia are amazing!!! Thank you both for making some wonderful pizza and making","useful":0,"cool":0},"3QYOfhAxaiAkYz6vPfAV-A":{"text":"Really good pizza served here. It's about $6+ for a slice depending what you want (startin","useful":47,"cool":43},"xy0PRVpyC9iTdPS7N6rVng":{"text":"The chicken bacon crunch pizza was damn-near the best pizza I've ever had! We are here alm","useful":0,"cool":1},"rnf05qPD8aykZOe9wDD-Ig":{"text":"Too much goodness! It was so cold yet the pizza was so good! It's like a standing line to ","useful":2,"cool":0},"xtcXOam6ITHvuUTuEC0gSw":{"text":"Perfect pizza shop in the middle of the busy bourbon street. I got the classic cheese slic","useful":0,"cool":0},"KbbAG1fkEdcarIaPRaN5gQ":{"text":"I spend way too much time in New Orleans; but when you live right 2 hours away, how can yo","useful":3,"cool":1},"fGGx9YA7Xz0sig_xJ2XsGw":{"text":"A solid NY style pizza. The slices are large and the pizza was pretty flavorful. The crust","useful":3,"cool":1},"pkbveJdSBiu65iV4Z7jZ1g":{"text":"Nothing to say here... except, if your in the area eat this pizza!!! It's amazing!!! They ","useful":0,"cool":0},"GRg4l_H_tGp_S0MQndDxZA":{"text":"To be fair with this review, we did order the food to be delivered. The garlic bread proba","useful":2,"cool":3},"cbV58XXvaHsJy3sfUfVUYg":{"text":"Pizza by the slice . . . B I G slices . . . nice variety . . . always pleasant workers . .","useful":0,"cool":0},"Yn1uPd51HK3e57QTDrjP8Q":{"text":"Best drunk food on bourbon st! I stopped both nights that I was out. I recommend to all th","useful":1,"cool":1},"l19_90Ju4bcobX2F8-biOA":{"text":"Really crappy pizza. Thin and floppy with barely any flavor. Service was quick but that wa","useful":0,"cool":0},"boBkaAl4Q8BFjkG3mX0wNQ":{"text":"Bomb pizza!!!!!!!!! Large pepperoni on some guy who walked up behind me and offered to pay","useful":3,"cool":1},"R_3nPMDPHLkpmbNCjrMhfg":{"text":"this place is so bomb. i cant stop thinking about the chicken bacon krunch pizza...im sad ","useful":0,"cool":0},"NfJoohL33R0rke7a72BSbg":{"text":"Cheeseburger pizza tastes exactly how you want it to, down to the mustard and pickles. Lar","useful":0,"cool":0},"S6cct1NZ5Ydq42iIYut_mA":{"text":"OMG..was this pizza good!..Tried a pesto with a green tomatoes, spinach with mushroom and ","useful":0,"cool":0},"o7IuHt39mGlM7lC4iNtihQ":{"text":"I had the sausage and peppers pizza and it was fairly good. Bottled beer was $7....more th","useful":0,"cool":0},"uZJHy_WypYchMbrFAof-Dw":{"text":"I got the It's Easy Being Green slice with pesto, green tomatoes and mozzarella. One of tw","useful":2,"cool":2},"YrUdP8l9cTSGXCpOBiAp9g":{"text":"Shockingly great pizza. Original NY pizza snob here and this pizza was fire. 5.50 slice...","useful":1,"cool":0},"aENqWT6sEmu78_V-KbQ6bQ":{"text":"If you're here and it's past midnight, you know why. Need I say more. Served its purpose w","useful":0,"cool":0},"9FD5etKV_opCA_e7W391VA":{"text":"Pizzas are huge worth the money, very delicious! Love the atmosphere, they serves are funn","useful":0,"cool":0},"fJjrCiu5Z2SzWz3Hfd91vA":{"text":"Surprisingly very good..my pizza tastes exactly like a double cheese burger. Customer serv","useful":0,"cool":0},"UPLXwIF8wMmbZyIPnSZNxA":{"text":"Omg we ate here twice but we are in New Orleans the first time we were just drunk eating b","useful":0,"cool":0},"H0QDN9wR1Gsmy9a9vCnMcg":{"text":"This place really overestimated my expectations and my mans.  So its on bourbon street. We","useful":14,"cool":11},"i78D4erTblE3OgZboFQJAA":{"text":"Of course what goes good with drinking?! Pizza and booze... Last year we go to this spot a","useful":0,"cool":0},"4Jlsk69sUmEXNmEe1kbf6g":{"text":"Had the cheeseburger pizza after my long flight here. Was really delicious. One the few pl","useful":0,"cool":0},"XfUc5HEQSJg1GtHQQyhvOg":{"text":"Dat 'za da bomb yo.\n\nBut seriously, really freaking good pizza.  Drunk or not you should s","useful":0,"cool":0},"TJqyigbmd0M2d7D4X3w3tg":{"text":"Was craving some good ole pizza, so I thought I would give this place a try. I order a pep","useful":1,"cool":0},"kjRqcrzYK2Py6z4cYIDGVw":{"text":"The BBQ pork pizza was amazing. I only planned on having one slice but I happily devoured ","useful":0,"cool":0},"KaIwsx5l54EArfXacAVdXw":{"text":"There is a lot of by the slice places on Bourbon street, often designed just to get your s","useful":0,"cool":0},"QTkUlpWjHV6CHmyAMGGktQ":{"text":"Way overpriced but a surprisingly good piece of pizza. We wandered in around 10:00 looking","useful":1,"cool":1},"ocNARVG785rSn2zjtzqz3g":{"text":"Crescent City Pizza Works deserves an absolute 5/5 stars. CCPW is nestled right on Bourbon","useful":0,"cool":0},"sk5azuS1rktdUtsn45e8TQ":{"text":"Great location, nice atmosphere, friendly service, pizza..below average... burnt and very ","useful":0,"cool":0},"MbOwdI8LAKVMh83vGi3VrQ":{"text":"Peep this! Pizza heaven at 3am! Wow this place was delicious. We came here after being out","useful":1,"cool":1},"X5B1SUA4veCqt3IVtjrc3w":{"text":"On my last night in NOLA, I wanted a quick bite late and found this spot on Yelp. It's wal","useful":1,"cool":0},"i02NrYD7LsnWI4w3g09VIA":{"text":"I think about this place way more often than one should for living so far away. Best pizza","useful":2,"cool":0},"DitYVjK6hUDusSGmf4fjnQ":{"text":"We absolutely loved this place. Wonderful pizza that was reasonably priced and served quic","useful":0,"cool":0},"5TWrcAsl-wZn5BzVizRJEQ":{"text":"Great pizza, perfect location and cold beers to wash it all down. \n\nThe music pulled us in","useful":1,"cool":0},"_8H5gnG94cNdzBcQjC4JiQ":{"text":"Like most people, I stumbled upon this place after a night out. I was walking by and there","useful":5,"cool":0},"dUCtpGYauYwYlZL0FeQAjg":{"text":"The brutha with the ice blue eyes at the counter is fine as hell. Oh,  and the mushroom pi","useful":1,"cool":1},"OfMHARH2Szfa6bCOA9k7xQ":{"text":"First night in New Orleans, I was exhausted after the long drive into the city and an exci","useful":8,"cool":8},"IHHZ_fYIqurEAi7wPJVSvw":{"text":"Yum yum. Good and quick. We had the cheese burger pizza and a cheese slice. Good and hot, ","useful":0,"cool":0},"pcVahY2C0FPJ6-S7t_wkKQ":{"text":"Thank god I only go to New Orleans ever few months cause I would be kicked out after a wee","useful":0,"cool":0},"2A4DKTfeu8dgHswwcspTNQ":{"text":"For a New Orleans, French Quarter,  Bourbon St.  Pizza joint,  it was a perfect, by my opi","useful":1,"cool":0},"j4JfDn4w1h2Q_bO7d2fUqA":{"text":"While visiting New Orleans I used Yelp to help me find the best pizza place on Bourbon Str","useful":6,"cool":5},"VY9lyEGR8rF9eao8zaZ5mg":{"text":"After our first night partying on Bourbon St, my bachelorette party dolls kept talking abo","useful":0,"cool":1},"fQS7V6Xubv6j7GVINo0IaA":{"text":"Love this pizza! honestly for the price & the size.! so delicious !!! They were very fast ","useful":0,"cool":0},"qFx3xBfhIuCVGX17OMhy2A":{"text":"After finishing my own Christmas meal, we headed out to look for Adrian's \"Christmas Pizza","useful":2,"cool":1},"bZL1xmzPZxeUwzJ_Wc9p5Q":{"text":"The location came highly recommended by a Louisiana native, so we stopped by one night aft","useful":0,"cool":0},"OchHgPKJWY71qCw8fEsPYw":{"text":"Decent pizza for cheap if you want some greasy pizza. Nothing too special. I tried the pep","useful":0,"cool":0},"Wdm67ddJjCA6PmeAkaIQAg":{"text":"It's a great place for by the slice pizza in NOLA but overall in comparison to other pizza","useful":1,"cool":0},"yS9zdzv6XWac9mzrQIAWZg":{"text":"Best pizza I've ever had by far! Wish they had a location outside of the quarter so I coul","useful":1,"cool":0},"TFqOL1BIIJZunw33r7sIYw":{"text":"Holy shit!! This pizza is effing-amazing! I was basically sober when I ordered my pizza an","useful":0,"cool":0},"RoBdFd9hYXGhmiFOUEASuQ":{"text":"I'm from Chicago, first job was making deep dish pizza. I travel to NYC every month and en","useful":3,"cool":5},"rc6iAalba_zge8OQpF1jTQ":{"text":"I was craving pizza right after I arrived in town, and was drawn to Crescent City Pizza Wo","useful":2,"cool":5},"WtGgfVqBeqPtZNFv2wdQVg":{"text":"Fantastic pizza on Bourbon St?  You bet!  Crescent City Pizza Works is the place, right on","useful":13,"cool":10},"5Xa67Z6N7_AmI7Jkf1z1Ww":{"text":"I remembered to take pictures and write this review while being heavily intoxicated so you","useful":0,"cool":0},"n-ub9GW7Mpi7GvtJI3YzVQ":{"text":"Pizza, pizza, pizza!! Pizza by the slice was exactly what I needed after a night of leisur","useful":4,"cool":3},"5zin19MOX37dVa95p8eVUg":{"text":"The best pizza in the quarter!  Thin crust. Excellent meat and other toppings!  Don't both","useful":0,"cool":0},"DMUockfkskZj7ZakgqTtuA":{"text":"Being from NYC...I am SHOCKED at how good this pizza was. I didnt have high expectations b","useful":2,"cool":2},"5yq-pyOAQwrAkHsfkhO5mQ":{"text":"If you have been out partying and you need a refreshment Aka food! Something to put in you","useful":0,"cool":0},"vbGbWo2qCuBKCSN215mJbQ":{"text":"Amazing! I loooove pizza and I'm sad (not really) to say that I had this 3x in NOLA. \n\nGre","useful":2,"cool":1},"lgJQyOvnNVCbLnM6B7y2VQ":{"text":"Ordered a large pepperoni and garlic cheese bread tonight. Nothing special.  Not much bett","useful":0,"cool":0},"1G-NSSu-hQmBTPRMAoRSyw":{"text":"The pizza was great!  Loved the potato chips and the texture it gave it.  We looked at sev","useful":1,"cool":1},"Znlyx_USVfSoFS-uTTobmw":{"text":"Good pizza on Bourbon Street!? Who knew such a thing could exist!? \n\nNestled between bars ","useful":20,"cool":18},"3ddJNoDbtAx7sQxqN0GtxQ":{"text":"So me and a couple of my battle buddies took a trip to New Orleans Saturday night to cap o","useful":2,"cool":0},"z2U8OnOlDKT2Wz9L0hCLnw":{"text":"Now I judge pizza pretty harsh being from NY. I hate when places advertise NY style pizza ","useful":5,"cool":3},"9wZ1N6M2lm7hePgOJOV-dg":{"text":"Good cheese pizza after a night out on bourbon street. Great midnight snack. It was loud a","useful":1,"cool":2},"bwVuRCB-BAsac136_QQrtA":{"text":"#thankyouthursday \n\nI have to say. CCPW is still one of my fave pizza spots throughout the","useful":17,"cool":11},"ry3h4_1vKDwg-mIaHEh3Ww":{"text":"Absolutely the most delicious pizza I've ever had. Tonight was my second night in a row. A","useful":1,"cool":1},"wfTrbLM-IMITNMRKdRxMqQ":{"text":"We stopped in here for two reasons, \n\n1) Get out of the rain\n2) Get to a restroom ASAP\n\nWe","useful":1,"cool":1},"RzBRuTU5HPLM86HUlwXCjg":{"text":"I was here three years ago, and the pizza was very good, but things have changed dramatica","useful":3,"cool":0},"FomPBnqDwgJd6eabv56AzQ":{"text":"Best pizza on Bourbon St.  Please don't waste your time and money on the cardboard pizza f","useful":1,"cool":0},"Cims4Ojyz8TJwXSxhsJD5g":{"text":"So this place was our go to spot for 2 days in a row. We wish there was more than one loca","useful":0,"cool":0},"i1dravCLwUNVoosi68WEQA":{"text":"\"      '   ,      .\"- Nkechi\n\n Stop 1: New Orleans  @pizzaworksnola \n\n:   Angus Beef + Oni","useful":0,"cool":0},"Dc_VxNuYgzEqGDWyTe50MQ":{"text":"Working on Bourbon Street you normally just walk right by all the pizza places because the","useful":1,"cool":1},"bNzmK7NVKHoAgGQWnJQyPA":{"text":"When on Bourbon... CCPW!\n\nI first checked these guys out in 2018! I remembered them this t","useful":14,"cool":19}}