{"yotHb-C5H5szJDZnDAvIDA":{"text":"Beautiful new salon in the CBD! Very modern and upscale with a great atmosphere! The entir","useful":0,"cool":0},"EOAX5dE27gwNPszoVABsRA":{"text":"My favorite hair stylist Caye moved and Spa Isbell was cool enough to tell me where (def g","useful":6,"cool":4},"O68wCFBpe0_ok0ZeaP1lrA":{"text":"The salon is great, very pleasant atmosphere.l, get my hair cut by Nehaya. She is a very s","useful":0,"cool":0},"wK1U-rhDqUMJwU5rt5TtRg":{"text":"Finding a solid spot to get my hair trimmed after I moved back home from Cali was not an e","useful":6,"cool":3},"2qqJx_lAPbXph7bDealETQ":{"text":"I've been meaning to write a review since June and it looks like they just moved from Upto","useful":0,"cool":0},"5_FTmzerkv0qsANZWpCUEg":{"text":"I had another cut and color with Nicole Meredith today. She is simply amazing.  You know w","useful":1,"cool":0},"seFttp4n6sGq0zwdMcs5Ng":{"text":"Maegan hooked me up! \nI made an appointment for my lunch break (2hrs). \nRisky, I know, but","useful":2,"cool":2},"id6U2sQrPwHi9j4A-MlKlw":{"text":"Been here twice and both times had exceptional service. I have a lot of hair, it's fine an","useful":0,"cool":0},"ovIXR3Rw4cW-F265DuZ2FQ":{"text":"Excellent. I've gone twice and both cuts were great. A tiny bit more expensive than a Supe","useful":4,"cool":0},"rLffl1cyJ6hT7aWVRgManA":{"text":"Great experience getting my hair done by Alexis! As someone who has had too many bad hair ","useful":0,"cool":0},"CMneSZQXcts0LadNIjeH0g":{"text":"Nahaya was my hair stylist, beware! The description detailed on the Loft's website is some","useful":0,"cool":0},"mNyvX4Ml4zab2S3pTaVNFg":{"text":"Just got a cut and color this week, Erin is just amazing. Service is outstanding, I am so ","useful":0,"cool":0},"Cf0pQtBsYhCRz2rfEZtKFA":{"text":"First time coming here; I liked the atmosphere and friendly staff.  I was pleased with my ","useful":0,"cool":0},"QNwLihfINaojI1LYHVbo4g":{"text":"Great service. Nice blowout. \n\nQuotes $42 but o was charged $50 , so ask\nBefore the servic","useful":0,"cool":0},"7Ak24U1PoK24o6AUqmEnDg":{"text":"First time going here I went for a trim ended up with a haircut.  Not bad but could be bet","useful":0,"cool":0},"0scFruoAapi1qstTaWo1pA":{"text":"I always go to Andrea.  She is super friendly, offered a free consultation prior to me boo","useful":0,"cool":0},"_-54Q5XsQ8Rh77LreXEh0A":{"text":"I'm super picky about my hair but I have found a stylist in Nicole M. that could not be mo","useful":0,"cool":0},"ljm1HHFklfftPVY-KVGV2g":{"text":"First time going here and I absolutely loved it. Great service and I loved that it was a k","useful":0,"cool":0},"eUhE4UXuLTGJfK4154mSuA":{"text":"I'm a new resident in the building and was very excited to visit this hair studio anticipa","useful":1,"cool":0},"ql_w00cKsXNkjkHWhIeiqA":{"text":"my stylist stopped replying to my messages when I was trying to set up an appointment with","useful":0,"cool":0},"k3HLA2d8FkbXG-GapN7Hqw":{"text":"My first experience here, there was a snafu with my color that turned out way too dark on ","useful":0,"cool":0},"KlwvEYE6qDYzfayvDDsPnQ":{"text":"Average.  The color was great.  It's absolutely gorgeous.  I showed the stylist photos of ","useful":0,"cool":0},"geVsQOlbwUeYrDxGF743-A":{"text":"Where do I even begin? The entire staff is probably the friendliest I've ever seen! Everyo","useful":0,"cool":0},"LfWY0kXyDmNtRQZyQqU-Aw":{"text":"I had my hair cut by Maritza.   I hadn't had a cut in months so my hair was very long.  I ","useful":0,"cool":0},"vZ5VbaZbJoV8_ZwxTeFTVA":{"text":"Nehaya is an awesome stylist! Gives you exactly what you want and will tell you if the hai","useful":1,"cool":0},"xydby2LhZH7E52PMwHFbvw":{"text":"Nicole is absolutely excellent!!! Best cut & color I've ever had. Wanted to go from very b","useful":0,"cool":0},"DBOZ-KU0MsgU1ckcbjt3JA":{"text":"(5/12) Love this place!!! I wanted to pamper myself & get my hair blown out for my niece's","useful":0,"cool":0},"hUzdS8fIxoiwDSS_yyJcQQ":{"text":"I am a former client of Hair Loft when they were Uptown. I was always very pleased with th","useful":1,"cool":0},"bn1LoU8ZsU6g1nJVvn6BXg":{"text":"Salvador cut my hair. Me and my girlfriend loved it. The vibe was good, he served me very ","useful":0,"cool":0},"kinNZhNtzBslxuzUOB1Vjg":{"text":"The people were nice and the salon is very clean.  However, my stylist cut way too much ha","useful":3,"cool":0},"s3igRjtTqF85VQTg9WR0HQ":{"text":"After attempting to cut my own bangs I had a complete hair emergency!   Out of town and in","useful":0,"cool":1},"ngzxGidLVdxqFUE3YS5SZA":{"text":"I had such a wonderful experience at hair loft. I just moved to New Orleans and was worrie","useful":1,"cool":0},"7Ly4wtwa6I0Psuq7_LCeOA":{"text":"My stylist RUSHED the entire time. From the wash, splashing water all over me and my cloth","useful":0,"cool":0},"XT4Xvt0nstqqAO1J6-P3Qg":{"text":"Went in to get my hair dyed. Showed my stylist a picture of how I wanted it. It looked not","useful":1,"cool":0},"qc15hjQI7_m1hI-Gnk0Hew":{"text":"Andrea is THE best! I've been going here for quite a few months and I was SO happy to fina","useful":0,"cool":0},"7vZtrdEnSL9t649VpjSq8Q":{"text":"Great salon. The owner and her staff is so knowledgeable of hair and products. I have my h","useful":0,"cool":0},"s-CdypDuokCRG7zfY1UsyA":{"text":"I had such a nightmarish experience here!! I came in to get my hair dyed for the first tim","useful":2,"cool":0},"c1KKG8kKcK1gv1_e2n3IZA":{"text":"Very nice new salon that offers a variety of services. Has taken over for the higher end s","useful":1,"cool":1},"TRetCI4djygKJ8NOZNys1Q":{"text":"So lucky to find this studio! All artists here do amazing work and their prices are fair. ","useful":0,"cool":0}}