{"JbWaQKhv6REwjUw_53YdLQ":{"text":"Sully Satisfies\n\nWe were on a long road-trip and we weren't making plans too far ahead.  W","useful":0,"cool":0},"8JH_fQSpNYUAmnr_lJ012Q":{"text":"I'm going to have to agree with Robert's review of the Sully Mansion.  I can't speak on th","useful":0,"cool":0},"heS2fco70f9R2NixShjTiw":{"text":"Lots of reviews about this place mentioned the wonderful owners and their amazing food.  U","useful":6,"cool":0},"mJjOByq4tnkrK4onMIwH_g":{"text":"A place for people who don't know better. Owners pretend to be native to the area and poss","useful":5,"cool":0},"pNr1dzYUQhxYPXpGz3aeLA":{"text":"As potential guests asking questions about what to expect during a stay, we found Nancy to","useful":1,"cool":1},"8r4JfFJD76xIlboHtboF2w":{"text":"Our favorite place to stay in New Orleans. Located in the Garden District one block from t","useful":0,"cool":0},"Drpa2AocSt0PaUFJ_bx_rA":{"text":"I guess you could say we enjoy the Sully Mansion Bed and Breakfast as this was one of our ","useful":0,"cool":0},"gGI9m7DMcFs5JztJDMNXLQ":{"text":"We just returned from our trip to NOLA last week.  We had an amazing time, and wonderful a","useful":0,"cool":0},"MdBAVQJuhzJY2WS1LpJznA":{"text":"This was our first stay at Sully Mansion and we loved it! Beautiful old home with a strong","useful":1,"cool":0},"AmVasl86oBdfEZ6bkK2KSQ":{"text":"Home Away from Home!\nThis was my first time staying at a Bed and Breakfast!  And I would d","useful":0,"cool":0},"3yQ4c8Iyz-UK6QT0_1UQ0A":{"text":"I got married in New Orleans last week, and my entire family took over Sully Mansion. It w","useful":2,"cool":1},"21l50H3qVOi5myCmb2vCQg":{"text":"I have been trying different B&B's in the Nolo area for the past two years.   My son goes ","useful":0,"cool":0},"ciskS7B_mhsUsqPwxNy_-g":{"text":"My husband and I were married here in November 2013 (yes it has taken me this long to writ","useful":0,"cool":0},"LmZSpLm7cuyEuirKrCv-Bw":{"text":"Our June stay at Sully Mansion could not have been more pleasant. Our room was very clean,","useful":0,"cool":0},"3QiUX7LiJes9Uw3zU-Lj4w":{"text":"What a charming place to stay in. Melinda, the Innkeeper was very sweet and helpful when i","useful":0,"cool":0},"ekUjqMrGrvw4y8vSfOIzOg":{"text":"The family and I had an amazing experience staying at the Sully Mansion. Nancy, Guy, and G","useful":0,"cool":0},"myOMOGCgBpPFpzkcq6elzQ":{"text":"I'm not much for B&B's as I generally find the American ones a bit too Victorian (i.e., ch","useful":2,"cool":0},"686Xp1x_L1_n3MC8DOVO9A":{"text":"My family and I had a great stay at the Sully House. Melinda is the new owner and she is s","useful":0,"cool":0},"sHMWzcqWeMMnn8uju4VQ1w":{"text":"The only reason I'm giving this place 2 stars is because it's in a good location (easy wal","useful":7,"cool":1},"UzgNk9VQiIkVvrz_RIKrtw":{"text":"The location of Sully is perfect, close to the trolly, French Quarter, nice restaurants, c","useful":3,"cool":1},"g77OLc9xQmGyo392Qq5V_w":{"text":"This place was absolutely adorable. It was comforting to know that when we stayed we had o","useful":1,"cool":0},"JkT_UMnvar1-N62ZeBDxrA":{"text":"My mother (mid 60s) and I (40) stayed here for a long weekend. The location is terrific, a","useful":3,"cool":0},"nxR-R2pkL7G8OdmI9Vbe9g":{"text":"My wife and I thoroughly enjoyed our stay at Sully Mansion. The location was extremely con","useful":0,"cool":0},"HMWEne-saMsSdw3wTPbcJg":{"text":"Having stayed in many lovely venues in NOLA I can say that this is unequivocally the Best.","useful":0,"cool":0},"tVK4-HTBgt0M7GBV0aEAyw":{"text":"I am seriously perplexed why these owners have a B&B - they don't like people!\n\nWe stayed ","useful":23,"cool":4},"LEDhmb3Mu9QOylMTRn4yrA":{"text":"Had the luxury of staying at the Sully Mansion for a friends wedding. Immediately greeted ","useful":1,"cool":0},"ZfthLJCxA1pY350w8zecuQ":{"text":"At breakfast on our first day, nearly all of the guests were repeat visitors. I think this","useful":0,"cool":0},"2RQnvCH7ysDPobjyOCKedw":{"text":"I loved staying at the Sully Mansion. The home is beautiful and wonderfully located in the","useful":0,"cool":0},"IjAtgE3zCyaACRSySKOy3Q":{"text":"I'm writing this review to defend Guy and Nancy a little bit, not that they need it.\n\nI've","useful":2,"cool":0},"S18bhmzqDGPZ0IEDKqF6Vw":{"text":"Stayed in the dauphine which has a private entrance separate from the main house... Phenom","useful":0,"cool":0},"wh40MY_31TQQbEVs39ZqMw":{"text":"Awsome place to stay! Felt like I was at home for the one night we stayed. Great location ","useful":0,"cool":0},"pSggGCVxEijHE3P8i-VKtQ":{"text":"This place is an absolute gem.  The location could not better in terms of atmosphere and p","useful":4,"cool":3},"4sB4-rQYIAVUC4RVvJs-Pg":{"text":"We booked 4 rooms for a family reunion.\nOwners/hosts Nancy and Guy made our family feel li","useful":0,"cool":0},"G4Z2iFP_j1B70mSDIMZe9Q":{"text":"We loved staying at the Sully Mansion! It is well located. The house is lovely. The couple","useful":0,"cool":0},"oRASGqBAKV93kLPpdd5EDg":{"text":"I have nothing negative to say about the Sully Mansion. Melinda (the new owner) was kind, ","useful":2,"cool":0},"XobNDESepJ3jz3kixIiwKQ":{"text":"The owners are horrible.\n\nAnd, you're paying way too much for what you get.  Location is p","useful":19,"cool":3},"TX9ZsZpxOySQOfFNpLnxPw":{"text":"My husband and I stayed at Sully Mansion for our first trip to NOLA and were absolutley sm","useful":0,"cool":0},"MTc3qWC_SqMx42wbQJMeGw":{"text":"What a relief reading these reviews I only wish I had read them before I booked 3 rooms an","useful":7,"cool":1},"z4GgxbhF-E5GEsoTqmw7sA":{"text":"I can't believe some of the poor reviews I've read on Yelp about this place; Guy, Nancy an","useful":3,"cool":3},"KTSNxYe04idorc46YWXN0g":{"text":"The Sully Mansion in New Orleans' Garden District has a lot to offer. It is conveniently l","useful":8,"cool":0},"GoFL0sc9xHK5UvIfkMaemg":{"text":"My husband and I pull into town to move to NOLA and had no electricity in our house. He ha","useful":0,"cool":0},"vwkv9VZP5kIOIe2Y4Wp5yA":{"text":"My boyfriend and I adored every second of our stay at Sully Mansion Bed & Breakfast. The h","useful":1,"cool":0},"dY74ULXO2wXvFp1l_JvuOA":{"text":"We just spent a lovely weekend at Sully Mansion. It's now under new management. Melinda, t","useful":0,"cool":0},"pI86M7_6iqFsAFW3b1RyFw":{"text":"I haven't been back to Sully Mansion - but there is no longer a fiancee in the picture. No","useful":0,"cool":0},"jaxDNItgEsBLBqYMTqwBxg":{"text":"A fabulous location in the enter of the Garden District. Beautiful home. The hosts are fri","useful":0,"cool":0},"-QTAOZ6aLd6-wy6BUVxXKg":{"text":"I've stayed in B&B's throughout the US and Europe, and Sully Mansion was the most wonderfu","useful":1,"cool":0},"CvvWGL0BTIsnOrc9mpJ1xQ":{"text":"I stayed at Sully Mansion for a weekend with my girlfriends for a birthday. Marc and Madel","useful":0,"cool":0},"4XOnYXlBGEEIieNtb3o1bw":{"text":"The mansion is enchanting, just stunning. The bed was so extravagantly comfortable we coul","useful":0,"cool":0},"uDkwqvKQH9GiCnpCpGw1bg":{"text":"What more can be said about the perfectly wonderful and delightful Sully's Mansion B&B in ","useful":0,"cool":0},"IarriH4i1YzmwhpKRs3o4Q":{"text":"Keep looking.  We booked the majority of the \"mansion\" for a wedding and I have the follow","useful":2,"cool":0},"7oj-QLLymAPzfRwSyatCKg":{"text":"Everything was fantastic about this place. Melinda was so sweet, helpful, and made us feel","useful":0,"cool":0},"o8Qs-V1ildN7AyMjIOZZyQ":{"text":"Stopped in to get information on staying. The owner was very rude and not at all accommoda","useful":7,"cool":1},"ExNoBTrU4pepC6g3QzkiYA":{"text":"Awesome place to visit and located in a very convenient and beautiful location. Melinda is","useful":0,"cool":0},"T8McsRLSr1yx6pW4CfF5-g":{"text":"My best friend and I take a girl's vacation every year. This year we decided on New Orlean","useful":0,"cool":0},"NzkZxcVf7jDwzoURXnQGlg":{"text":"I meant to write this when we stayed at Sully Mansion in May, but put it out of my mind un","useful":11,"cool":3},"P5xmzmCuCwN-kEQB9CVntg":{"text":"My fiancee and I had a wonderful weekend at Sully Mansion. \n\nGuy & Nancy were quite accomm","useful":0,"cool":0},"IHef3NQL-9hqepTuLxJo8Q":{"text":"If you have options, don't stay here.\n\nJust got home from my weekend at the Sully. We are ","useful":10,"cool":2},"nJjemDnD5Nbn70B3dAtG7g":{"text":"We had a great time with Nancy ,Guy and Gracie! They were very gracious and informative,Na","useful":2,"cool":1},"JBiQstY45eGiMI9F4VBn_Q":{"text":"From the moment we arrived we were enamored with the look and feel of the house. It has th","useful":0,"cool":1}}