{"xdetLIPmBZkFtVifw74VZw":{"text":"Pretty restaurant.......nice menu.......might have been good food but we'll never know.  T","useful":0,"cool":0},"795IUPHKyV9noYoGbvBpAA":{"text":"Props to Christina D. For the suggestion.  Bearcat is a funky place but in a good way.  Ev","useful":2,"cool":2},"q2NelbDVflR5HvtB2bEyag":{"text":"This place is amazing!! It has something for everyone! Took my vegan niece here and she sa","useful":2,"cool":2},"Ywdb4IbF0MQfUwyc8zROZw":{"text":"Everything was awesome from the food, to the service, to the homemade tea! We tried it for","useful":0,"cool":0},"XV7ciNtSUFoDuXreSa0ePA":{"text":"Food was amazing!!! We ordered vegan and vegetarian items off of the breakfast and lunch m","useful":0,"cool":0},"jhlJGjcYXwLA51bXRPL3rQ":{"text":"Honestly, best breakfast I have had in a long time. I am allergic to milk, and there are s","useful":1,"cool":0},"TEivv5s2T5ir7cxsdjsPAA":{"text":"sooooooo yummy. Best brunch in New Orleans. Perfect for vegans and meat eaters alike. Be p","useful":0,"cool":0},"f7QrFhc22bZ2Ln-om-9YDA":{"text":"Delicious food, good service, nice atmosphere, amazing latte art! We had a great experienc","useful":4,"cool":1},"GUnGZEecclfi7zrKE_lZGA":{"text":"Now one of my husband and I's favorite spots! We walked in on a Sunday at 2:30pm it was pr","useful":3,"cool":1},"35nZwUX-enjiXTs8XIj8nA":{"text":"Very good food! Loved the matcha latte. Really great service tooo...we are suckers for gre","useful":0,"cool":0},"75sktMRt-yUHomK_5Ou9og":{"text":"Great coffee, tasty healthy options which is hard to find in Nola. Outside sitting availab","useful":1,"cool":1},"elDaLMpWB5jc1RIFOWFpCA":{"text":"As someone who eats mostly veggie I have been wanting to visit the Bearcat Cafe for a whil","useful":1,"cool":0},"14bg6YQ-Q62W3PDr_Sv80g":{"text":"I was very impressed (and deserving of a five star review) when Bearcat first opened. My w","useful":1,"cool":0},"LFA4uSShIRTnDuw7cMgeKQ":{"text":"I visited fire breakfast and there were so many options to choose from. I had the Bearcat ","useful":0,"cool":0},"FIr2mpnUQg5yBlvfO0aJVA":{"text":"Went here for breakfast and  ordered the Cat Daddy Biscuit, was really delicious.  I was r","useful":1,"cool":0},"HsCGgL_KToQ5CyU1NeLK5w":{"text":"Great find! Breakfast was amazing, best pancakes and crisp potatoes I've had.  Bison sausa","useful":0,"cool":0},"nA9uQTd0QPz7CZGsDD4D1g":{"text":"We decided to come here last minute with a party of 9! First, the coffee is excellent. How","useful":0,"cool":0},"rz-aTs8aHCfhGh_WYuShUw":{"text":"This bustling cafe is in a rather convenient location just off of Freret Street and next t","useful":3,"cool":2},"OB6yUK_4E_VKFTLtEbU2RQ":{"text":"If you're looking for traditional New Orleans, go somewhere else.  I thought for a minute ","useful":0,"cool":0},"pGOoxIHtjbxgKJkcxC9T6A":{"text":"This is our favorite breakfast spot! I love that they have gotten super popular but it mea","useful":0,"cool":0},"SD6DG3dBJBrl7V-t3b-gog":{"text":"We showed up on a busy morning so it was about 40 minutes before we got a table, but the w","useful":0,"cool":0},"0d2oPV3JCmC8HuMb6XA6XA":{"text":"This place is aaamazing! Cozy neighborhood spot... great coffee & wonderful food! Was in t","useful":0,"cool":0},"xGtAU7i4KADA2N6mIBTmDQ":{"text":"Excellent vegan brunch, food am not a vegan but really enjoyed the Vegan Quesadillas & my ","useful":0,"cool":0},"dBGheN4SpzZ1jfP8ZAtutw":{"text":"Fan. So glad I don't live within walking distance because I would stay here. I had the cra","useful":3,"cool":0},"eevRaoUDPtsScio_RdqNrg":{"text":"By far one of the best brunch places with vegan options. We were greeted immediately with ","useful":1,"cool":0},"pJIeIozf0FHJX_zL0jg30g":{"text":"Delicious food.  They make yummy entrees and appetizers with unique ingredients, like cash","useful":1,"cool":0},"a7c7hd7K4hfH0BsgrS-z3Q":{"text":"So I'd heard so much good stuff about Bearcat cafe. That I decided to give it a try for br","useful":0,"cool":0},"4k9YVguLcysEi6SKoHEFAw":{"text":"Super Hip spot, usually a 15-30 minute wait on the weekend for Brunch, worth every bit. Fu","useful":0,"cool":0},"Zgc7wltmAKHuLH9BkBu9LA":{"text":"Bearcat is a phenomenal brunch place in NOLA. It is one of the few great sit-down places t","useful":0,"cool":0},"b801jYgoNhBjD5KqbBWm0g":{"text":"If you are vegan, this is the ultimate breakfast spot. I so love how they have there own i","useful":0,"cool":0},"AMEo3ARntlUZeSqp0C8_TA":{"text":"So so good! All the food was amazing with great flavors. I had the blueberry pancakes whic","useful":0,"cool":0},"Ldx2LmyF6xBFHT0nAj2lyw":{"text":"This is a small cafe in what used to be a house that serves breakfast and lunch. It does n","useful":0,"cool":0},"gFBLOymhAeO-B2VnFPWxGQ":{"text":"I LOVE this place! They have many options for both vegans and non-vegans (or carnivores as","useful":0,"cool":0},"qowfaYS1SUbrKSgEpAgoVg":{"text":"There's a couple vegan options on the menu that are excellent, very happy with the staff a","useful":2,"cool":0},"yqbXLe3L93UklMHNmvXWyw":{"text":"This place is a delight! New Orleans has a ton of great food options--but this is the only","useful":2,"cool":0},"jywiGMjt8yS2RNDlNhjbag":{"text":"Was not real excited at first with the long wait at over an hour and the menu did not seem","useful":1,"cool":0},"LFrTKF6mLwnUdMG4KQjXHQ":{"text":"Great place for vegans and meat eaters alike. We went for breakfast and had a completely p","useful":1,"cool":1},"tuOieS4L1rz2X_h5lUjlHg":{"text":"actually, no stars.\n\ni went there about a month ago. we walked in and asked for an outdoor","useful":0,"cool":0},"mzIWWR_rJW4ILCwXmk_nIQ":{"text":"First time my wife and I went, we were ok with the food and price. Decided to go back a se","useful":0,"cool":0},"MZyVk6X-gima8CwhhpYbVA":{"text":"I think the food is okay, nothing special or rememberable. I had the shrimp and grits and ","useful":0,"cool":0},"aSAlzWLQowrPE7ogX_hgaA":{"text":"What I want from every restaurant: a balanced menu between vegan and non-vegan options! \n\n","useful":3,"cool":2},"6Sc0I5EdFASRyhRGR2PX6w":{"text":"Sooo this restaurant was the bomb for breakfast.  I ordered eggs, potatoes and black bean ","useful":2,"cool":1},"MmfyD5NUwD474IJcsXpkdA":{"text":"We got in early for Sunday breakfast and didn't have an issue getting a table right away, ","useful":1,"cool":1},"XEXJGNdOyMIadhzuhayVeg":{"text":"My new favorite place for breakfast in NOLA! The first, and most important, thing is their","useful":0,"cool":0},"HHaP9oxxvZ-8ygH_1nSmSg":{"text":"My first visit was a good experience. The wait was supposed to be 20 minutes we were sitti","useful":2,"cool":1},"DRi01FBli9hU1UhAzoUCfQ":{"text":"Amazing every single time. The pancakes are some of he best I have ever had. Love the atmo","useful":0,"cool":0},"MfM8qvH7CzkIfKaJP6nXPA":{"text":"A nice modern space with delicious food. The staff were super nice and courteous. I went t","useful":0,"cool":0},"5_fZX6ZFla6xZspjpyePFg":{"text":"After such stellar reviews I was expecting a lot...and was sorely disappointed. \n\nWait was","useful":0,"cool":0},"0Hm-lVAKjpFdm4CstCUm8Q":{"text":"Love this place. I went there this morning for breakfast with my husband. There were a lot","useful":0,"cool":0},"FgYeJeYU8Q6tWHU6dIrfvw":{"text":"Did I want to be a good cat or a bad cat?  That was the dilemma.\nI resolved it by going ba","useful":1,"cool":1},"U4G6mT9z0b3ALf9Uunhrug":{"text":"Went to brunch here and ordered the Bison Burger. They gave not one, but two patties! It w","useful":2,"cool":3},"GYje_xyocM6adoTy6E6HIQ":{"text":"Don't be fooled by the surrounding area. This was a highlight of my time in New Orleans. T","useful":0,"cool":0},"_JvqyOK8YuWdgHOL_8kOxg":{"text":"I had Brunch at Bearcat with two friends. This was my first time at the restaurant. The wa","useful":0,"cool":0},"FbvINumF3G5xMvb5LNB5cA":{"text":"Large vegetarian menu that takes up the \"good cat\" side of the menu...we took no part of i","useful":0,"cool":0},"8k08-gcIghOCh44cv51daw":{"text":"Having eaten in for breakfast, I can conclude that I am decidedly on the \"good cat\" side o","useful":2,"cool":2},"TY1DTeGmDmYayxvHp6rf_A":{"text":"Place has a great atmosphere with a very cool vibe. It was a busy Sunday morning but our s","useful":3,"cool":2},"hsgQk-YjamBZwODPmmM-Aw":{"text":"Great new little breakfast spot right off Freret! Service was great! The manager made sure","useful":0,"cool":0},"kEH2raR4vKec7pwGO4l-Qw":{"text":"Bearcat was fantastic. We're a chatty trio. Once the food hit the table and we took our fi","useful":2,"cool":1},"Fn3urKT03F7MgpC0udsUSQ":{"text":"This place is the best restaurant in the Freret Corridor (and that says a lot). The breakf","useful":1,"cool":0},"1fisqhGqYFT-4d8Cfsx9Wg":{"text":"Great almond milk cappuccino. I've had it on multiple occasions and it always has great fl","useful":0,"cool":0},"u1ILLslpmRiEKNdbGB9Jvg":{"text":"Bearcat is home to some delicious brunch! \n\nMy friend and I came here on a Friday morning ","useful":0,"cool":0},"-dPamXirDEugd0J0Fg4sMQ":{"text":"My new favorite Brunch place for when I am feeling healthy and down and dirty!\n\nAmbiance: ","useful":1,"cool":0},"3LZ1qjMdCHp70sHfl_vTEA":{"text":"Cute place. My food (vegan quesadilla) was tasty, but my brother's look meh. He had the ra","useful":2,"cool":2},"v64bmWTV4Xwt5-mFXm6gYA":{"text":"I've worked in the service industry for over 10 years and I don't know if I've ever been t","useful":0,"cool":0},"5EFCE1L5hokleMZpQvbXlw":{"text":"Super yummy solid vegan options!!! Wish they offered a vegan pancake dish - but still, sup","useful":0,"cool":0},"IPI1sAaNOG2U2fpQxHzWHg":{"text":"I am a vegan and the food here is phenomenal!! There were plenty of choices and I will be ","useful":2,"cool":1},"VILd2jIXjFiRrw6ctl1Jsg":{"text":"One of the best meals I had in NOLA over a week-long stay, beating out some of the fine di","useful":2,"cool":2},"nTIqI26UV7Z2vhZSA_icXQ":{"text":"The food here is ahhhhhhmazing! \n\nWhen you wanna treat your body right and a little bad at","useful":5,"cool":2},"2X1_xjZGoIYUaUSvbOSeOw":{"text":"This place is amazing. We were greeted outside the door by a sweet lady. Customer service ","useful":1,"cool":0},"BMnCShuixrD5-UBllnyPkQ":{"text":"Being allergic to wheat, I was immediately attracted to the paleo pancakes and clearly lab","useful":1,"cool":0},"abk1TQau_5edUuxWuW5_rA":{"text":"Wonderful! A new place that is veg-friendly!! You know I had to check this place out. \n\nIt","useful":6,"cool":2},"NHYhpm1fqLASTXFjywY6AQ":{"text":"Amazing for me (vegan) and my boyfriend (nonvegan)! We love this place so much!","useful":1,"cool":1},"kO8Hc3SB7iN71jmOIjry-w":{"text":"Maaaaaan! Very few times in my dining experience have I felt so inclined to tip not only m","useful":12,"cool":9},"h9pD6Ao9l_tBqcIgnO80LQ":{"text":"Been there twice during my visit to NOLA.   Definitely one of my favorite spot.   Good cof","useful":0,"cool":0},"s5AgTLRPBdd8n1rww8vfog":{"text":"This place had potential with the cute atmosphere and incorporating two menus (vegan and n","useful":0,"cool":0},"iSuibjeiknYUmJzPbjAQsg":{"text":"Awesome food, with solid, local ingredients. The healthy and less healthy options is a coo","useful":0,"cool":0},"iewnXeWOJ_jO50fzcEucLg":{"text":"I had the Vegan Bearcat and it was very good. Loved the tofu scramble and potatoes. They a","useful":1,"cool":1},"xociM6jeGev_1u4Hm4xj1g":{"text":"This place is amazing. We stopped in for a quick coffee on our way to yoga (ps there's a g","useful":0,"cool":0},"aqlbigT6rfdZTfn0bWomkg":{"text":"Just go. I cried a little it was so good. Split the vegan quesadilla and vegan ranchero wi","useful":1,"cool":0},"M2OBEBfcZvpnUpFCBSyCsA":{"text":"Not that this place needs anymore praise, but I am compelled nonetheless. I was particular","useful":0,"cool":0},"xJacaUFbNxEvNn8jPt2asA":{"text":"Great atmosphere and a decent, walkable distance from Loyola & Tulane. The waitstaff was f","useful":0,"cool":0},"yakgQlwBAuQgbQSEU-nTCQ":{"text":"Love this place! Organic farm to table amazing brunch spot! Come eat here ..love the omele","useful":0,"cool":1},"frIvOD2fVbPDCalHuWk3vg":{"text":"Found this awesome hipster gem! Great paleo options. I ordered the bearcat breakfast (2 eg","useful":0,"cool":0},"3Kr0tIjn0TzvXqPFI18viQ":{"text":"The best brunch I've ever had! Flavor was on point, temperature of the food and presentati","useful":0,"cool":0},"Sgd6VOyPQxg2Wc1Outh4Ew":{"text":"I would not recommned. First the service was terrible. We asked if we could please sit out","useful":1,"cool":1},"HCI6Q2KWj-g81q4ItY068A":{"text":"Great spot for vegan options! Took a $10 Uber from Harrahs each way and it was worth it! W","useful":1,"cool":0},"TZaSx8hzQ8cUnmTUTGttOw":{"text":"Love this place. I went there this morning for breakfast with my husband. There were a lot","useful":1,"cool":1},"pNuv6PbWEXBt28wP9FQGpQ":{"text":"HOLY MOLY if you have a free morning or afternoon and want to consume the yummiest food yo","useful":1,"cool":1},"bcIMpuoXx4oAiTSWg2GivA":{"text":"I always have a good experience here. The first time I had the potatoes I made a sound tha","useful":2,"cool":1},"VnzjuPUW2unRx3dmrIqleA":{"text":"This place just opened and is SO GOOD. Servers are extremely friendly, and the food is aff","useful":1,"cool":0},"IUWewSyb8SB5QvLOoYfpXw":{"text":"A group of 6 of us, including 2 vegans, came to NOLA for a week-long conference and stayed","useful":1,"cool":1},"1TJ9dKBPv2fQ7pftRdTsbA":{"text":"5/5 for the mixture of chai latte and chia pudding.\n5/5 for the price, staff, and atmosphe","useful":0,"cool":0},"aegvdjA7yZLCoJTaKIaswg":{"text":"This hands down was the most catastic place to grab food my girl is a vegan and I'll eat j","useful":1,"cool":0},"zue8TrN2_iFkySZYs_km8Q":{"text":"Loved this clean and casual place.  Something for everyone for breakfast, brunch or lunch.","useful":0,"cool":0},"daQ8HtToz8cd5Njj46Dgpg":{"text":"This is our new favorite breakfast spot. We come at least once a weekend.  Best service an","useful":0,"cool":0},"s0a-N3E7KoRjxY0p2LNCyg":{"text":"In a city full of great restaurants and even fuller of great brunch places Bearcat Cafe st","useful":1,"cool":2},"JQ5_Fjz2dMBnmvQazcPXsQ":{"text":"One of my absolute fav places to go on Freret St. kind staff members, delicious goods on b","useful":2,"cool":2},"d9r8SkK_AcO2GqseMf7Lqw":{"text":"We were in town from Houston for business and looking for a breakfast spot that could get ","useful":0,"cool":0},"JuxeykZKg01nNZFHqYLqjA":{"text":"My friends and I have been hearing about bearcat for a while now and finally had time to s","useful":2,"cool":1},"3IyxbGrieTB2nG4S09sL5Q":{"text":"Look...I did not want to review this place and have it more crowded as it's one of NOLA's ","useful":1,"cool":0},"-zatsYY3XGw2ZaRS-tOw3w":{"text":"Just when you think a crawfish covered breakfast  biscuit doesn't exist, you find one at T","useful":0,"cool":0},"vTfe2_dw-n0L_f2VU9XUfA":{"text":"Such a great spot . My best friend is vegan and I'm not so it's tricky to find good spots ","useful":0,"cool":0},"hDGeuzXbs2pGUkq_1Kd3Rg":{"text":"We were so excited about this place because of all our friends' experience but we ended up","useful":2,"cool":1},"O-mlUZQRvW_VnpJ34jI-tw":{"text":"Disclaimer:  I'm a foodie and I never give 5 star reviews, I mean what if something better","useful":3,"cool":1},"S6ZI1SqZ9XiVWKHpFbK31A":{"text":"Easily best spot I found as a vegan during my trip to Nola. The people here were so friend","useful":0,"cool":0},"jRGhQOAZ3F87ganbNA_YWg":{"text":"Wanted to try somewhere new for breakfast this morning, so I decided to swing through here","useful":0,"cool":0},"ftQqBhQ0aXu4QeUw0bspbg":{"text":"Simply the BEST!  You must come here!  The food was amazing and the service was fantastic.","useful":0,"cool":0},"NjHaz_ZMZrFH0Z8PkSaA9w":{"text":"Bearcat has unique, delicious options with an amazing coffee and tea selection. I was only","useful":2,"cool":1},"BNeeiWlbQ5FhN6FTXQyfoQ":{"text":"Super chic, quick service & vegan/vegetarian options. \nI had sort of a high maintenance se","useful":0,"cool":0},"7WKSLKD_olO6xMEAVZO5Bw":{"text":"Food was outstanding but service was far too slow for a busy Sunday morning. Waited almost","useful":0,"cool":0},"OLh0XR2OK32zFi8b-fBfNQ":{"text":"3.5/5 grab a seat at the bar\n\nif i could have my way, i'd eat breakfast at all meals. so i","useful":3,"cool":2},"jgozySI0A4hLmNIGZIQbdA":{"text":"Bearcat has been an absolute joy every time I've been.\nThe wait staff and food are always ","useful":0,"cool":0},"AxDYW9ZRLc3sLCKYXvnB2g":{"text":"My son and I went here for breakfast and it was fantastic!  He had the shrimp and grits an","useful":6,"cool":2},"wwKNu6C4zjvv6qNPGnc87w":{"text":"Sooo  good ! Ricotta pancakes and hot chicken biscuit and eggplant coquette. One of the be","useful":0,"cool":0},"cxwIRIdKzbEuhecwVkW7Wg":{"text":"Very disappointed. I thought I would give this bougie place a try today for some good brun","useful":0,"cool":0},"FtDmIu4WEsLfpo1yNVzWYg":{"text":"Super packed place!! Loved that they have vegan options although the menu shames the non v","useful":2,"cool":2},"QGlKdtUObzLAhY6iy_eaIA":{"text":"We finally made it to this place and were very excited to try a new breakfast place. The s","useful":1,"cool":0},"CqoLkr0x9FWAUEwEAkdvew":{"text":"Great food! I was in New Orleans for 8 days and we ate here three times while we were visi","useful":0,"cool":0},"fWgZ0ujfmpBOVfrAjapquw":{"text":"This place is so fantastic we had to come in twice during our weekend NOLA adventure. The ","useful":0,"cool":0},"Y4IJInFRYBuRp4f-aC3tNQ":{"text":"I love the concept of this place! They have amazing vegan options for breakfast & lunch \"g","useful":0,"cool":0},"87PtvlZX0CKHj0POjtr9Jg":{"text":"I wish I could do half of a star, but I'll round Bearcat up to four. The service was great","useful":0,"cool":0},"dS-zTA-yO2Dm_3u553OSEQ":{"text":"I've lived in the city for five years and have been looking for a diner in this neck of th","useful":2,"cool":1},"N2ydCv-xQPMJIKtnnClJXA":{"text":"Service was satisfactory. Food was delicious but it took a while to get the food to us. I ","useful":1,"cool":1},"YSJMAiHI3fSlW9PY_tZ9ag":{"text":"Bearcat Cafe is so delicious....but also unbear(cat)ably loud. Please oh please put some p","useful":0,"cool":0},"o5bCGb-_3UwNHHDN-yuIMA":{"text":"Food was excellent. Staff was super nice and accommodating. The only suggestion I have is ","useful":0,"cool":0},"dS2fa3TLNdKisGcsWx-eJw":{"text":"Beautiful, delicious, perfect food. A great combination of worthy indulgences and healthy ","useful":1,"cool":1},"RAwwEZKBKmzOVw6HoaRZUg":{"text":"Delicious breakfast! \n\nAt first I didn't even look on the left side of the menu (good cat)","useful":5,"cool":3},"vHx-4aowB0lt2mQ16aIreg":{"text":"We went one Sunday and were able to just sit down at the bar immediately. I was shocked --","useful":1,"cool":1},"2LG6QXtUkAEnSMpQdhDceA":{"text":"This was my favorite meal while visiting New Orleans! I ordered the Cat Daddy and it was a","useful":0,"cool":0},"FdDZHBX_TIUbxlGLsCI36g":{"text":"Food was excellent! Their grits were delicious and so were their breakfast potatoes. Servi","useful":1,"cool":0},"ljA7pEi6xCwvkV295JS3Zw":{"text":"Everything that came to our table was absolutely fantastic! Bacon wrapped dates with almon","useful":3,"cool":1},"DFCd8wOooqGOvQ8p_xV8YQ":{"text":"Very reliable. Often quite busy. Delicious food. Choose from the \"good cat\" menu or \"bad c","useful":1,"cool":1},"Jh99t7HzpeWDdCJwnfDGtA":{"text":"I'll definitely be back to try more stuff! Service could've been better. My nursing school","useful":0,"cool":0},"62P4FBxQeVMQdQ7b-Dk_Sg":{"text":"Very cozy and beautifully decorated restaurant. The food was delicious. We ordered the veg","useful":1,"cool":1},"RDdAeXVqYomE6puuh-jfPg":{"text":"Very clean modern decor. The food was well cooked presented and tasted delicious. Will def","useful":0,"cool":0},"V3B_U3jKuUveGco2dBVQ3Q":{"text":"All Star/ Five Star meal! If I lived in New Orleans, this place would be on my rotation. W","useful":0,"cool":0},"Yvtoja91I7JHLI5hQrMSMA":{"text":"I absolutely loved this place! Me and my friends went twice in our four day stay. Great me","useful":1,"cool":1},"9zefe__IqoJG_jNc862hBA":{"text":"This place is absolutely phenomenal! The breakfast potatoes might be the greatest thing to","useful":0,"cool":0},"QkpbZX51ECCEp2vTdzmh4Q":{"text":"I went with my family last week and it was one of the best breakfast I've ever had in Nola","useful":0,"cool":0},"42L6Hzrs0CwLeFmn1o6Nnw":{"text":"We went during lunch hour on a Saturday and the wait was about 45 minutes long which I cou","useful":0,"cool":0},"ZR4jiEst80YFqaKjDABUYw":{"text":"Amazing guest service! We came from St Louis Mo and were checking out reviews for this pla","useful":0,"cool":1},"-SuZ_-ZPWC0noLxntLn1Kg":{"text":"Off the chain I'm into keto and paleo. They had me covered. I took some young guys in with","useful":0,"cool":0},"Y1rBQ9qgSJfBa2dq5h70kw":{"text":"Best deep fried crap I've ever had! Love this restaurant! The neighborhood vibe is really ","useful":0,"cool":0},"nnhF_-tIIWG6Xhxyic7WAw":{"text":"Total shit at estimating wait times. Ok if you're not hungry and have 2 hours to chill","useful":0,"cool":0},"uysNr2pEpr58cxfLaOLUGw":{"text":"WOW!! I'm sitting here for the second day in a row and already making plans to come back b","useful":1,"cool":1},"fBgpmFNUfa4qoqAo-Azg3g":{"text":"We love love this little breakfast place!  Who says healthy can't be delicious?  The staff","useful":0,"cool":0},"qrUd-rLjoRfLL-EDCCxmZA":{"text":"Beautiful space, wonderful service and the food was all spot on-crispy breakfast potatoes ","useful":0,"cool":0},"i4qCqJQgQOCZ0k2tY0jivw":{"text":"There was a long wait, but worth it.  Had the traditional breakfast with paleo pancakes an","useful":0,"cool":0},"sL4rjIaHZvdmJ3Mm5_YJDw":{"text":"It's small and has a neighborhood vibe, which was exactly what me and my team (in from Por","useful":1,"cool":1},"CyNykn8FNZUjPzA6T4luWA":{"text":"Really enjoyed the soft shell crab daddy biscuit and the locally brewed kombucha!  The cra","useful":0,"cool":0},"f6ffTGFFxG8o62yur7XGFw":{"text":"Food was very good.  Service, not so much.  Took a very long time to get food, never was a","useful":1,"cool":1},"tFRsVJWYTr3dMsnGpx24rQ":{"text":"Decided to try this place after a good gym workout. Parking is available off street but yo","useful":0,"cool":0},"Pmyk26rSnwaRlneRn5vj0g":{"text":"SUCH a cute little cafe to dine in on! Everything is cat themed and I LOVE it! On top of t","useful":1,"cool":0},"kmjpOKPZqRT-c9B53udMvQ":{"text":"Pleasantly attentive, hard-working, and accommodating staff as I ordered off the restauran","useful":0,"cool":0},"-YB-nk3PEUWJfbwatfJOPQ":{"text":"Bearcat Cafe was recommended to my group of friends by a local while we were in NO celebra","useful":1,"cool":1},"gU1r7nKHiZb8PG4ONdHSdA":{"text":"This place is absolutely delicious!! It gets very packed so you might have to wait 15 minu","useful":2,"cool":1},"epWLTzMN9qpGpW6eTSLqDg":{"text":"Went here for Father's Day.  A nice crowd.  The staff was super nice and attentive, especi","useful":1,"cool":0},"RG24nEXEQOy3EzfSNDP3tQ":{"text":"My meal came out pipping hot. Food was delish. Everything about my breakfast was excellent","useful":0,"cool":0},"4j5d_461mUZoPj_pIFQy8Q":{"text":"A few weeks ago my wife and I were walking our dogs and stumbled upon this place. We have ","useful":7,"cool":2},"qA9pNeZ0HV2IH5vOZrI-Iw":{"text":"Totally excellent breakfast!! 5 star all the way. A hidden gem. I always appreciate homema","useful":2,"cool":1},"icGulEFDD7kDHaLZ3oeM3A":{"text":"Good food, quality ingredients, and great service. Had the Bearcat Breakfast. Chicken brea","useful":1,"cool":1},"rnjRi_9hgxOREXkp_H89KQ":{"text":"Really great food.  Very happy I came here while visiting NOLA. Buffalo sausage biscuit is","useful":0,"cool":0},"vI5WrGd5pWhY9Og-wjRnPg":{"text":"I would really love to give Bearcat Cafe a 5-star review because the food was extremely gr","useful":3,"cool":0},"sfvNIP0-Dpl1lZpQiOsT_Q":{"text":"All around excellent! Very creative and unique menu for New Orleans - breakfast options th","useful":1,"cool":1},"g4R3Q7ZFLIZ1YmHCc66-7A":{"text":"It's pretty hard for me to find spots that meet my healthy, great taste ,moderate portion ","useful":0,"cool":0},"yz6WyjyGzNFWE8b0z-5FOA":{"text":"Definitely another great brunch spot in New Orleans. We had the banana foster pancake and ","useful":0,"cool":0},"9kmSTxmoy_OGtJc4aGs5Nw":{"text":"The best pancakes I've had in a long time!!\nhad breakfast here 3 times.  even when it's bu","useful":4,"cool":1},"o4KPVgAxNfGpjmTwjL9A-A":{"text":"Cool vibes and delicious vegan options! Everyone is so nice and has great insight on the m","useful":0,"cool":1},"GXsOECSLQhYRAETclOgZaQ":{"text":"Delicious! If one word could best describe this place, that would be it. My girlfriend and","useful":2,"cool":1},"5As3Z9kdiI6fNalqvJTTZw":{"text":"We were very please with our breakfast and coffee! The breakfast potatoes were amazing! Th","useful":2,"cool":2},"nzNg9DWZLuhCwJtQVjt2oQ":{"text":"I loved this place! We went here relatively early on a weekday so it wasn't crowded at all","useful":2,"cool":1},"ygY8AZUxAzFp9YjVJmHkSQ":{"text":"The coffee was great. The breakfast club sandwich had the fluffiest eggs,  it was deliciou","useful":0,"cool":0},"lU5Fi0KCCjQwI8Q67Cj-Qw":{"text":"I was recommended to try Bearcat Cate for breakfast by several locals as I was visiting Ne","useful":1,"cool":1},"SmkEX5Kyx0Eh1S54AkrhxQ":{"text":"Pass - extremely noisy inside- we sat outside, with the flies. 3 wait staff came out to te","useful":0,"cool":0},"nQ_b4TR0Vco38qFWVCetCA":{"text":"My go to weekend breakfast spot. It has a bustling atmosphere and great food. The Vegan Ra","useful":0,"cool":0},"Tp6Blp4kyTd8K-mprEZmpA":{"text":"Bearcat Cafe has a really nice aesthetic feel to it, which fits the rustic common theme th","useful":3,"cool":1},"diTZe_pbw9Qd3i48PMAa-A":{"text":"What an unexpected and extremely delicious surprise! First, the venue is so inviting as we","useful":0,"cool":0},"YtF-d26vUMkok2GrziSBmw":{"text":"Had a great brunch here! I ordered the Farro Bowl which was absolutely delicious and tried","useful":1,"cool":1},"dTYfwWige-9P344jbYu2vw":{"text":"The breakfast here is great. Potatoes are the best, nice and crispy but tender. Brisket Ha","useful":0,"cool":0},"TSBAw0xScM4DqmDnHln2qw":{"text":"This is a restaurant that didn't wow me on my first try. Luckily I returned never to be di","useful":1,"cool":0},"Ya6IPtYqMNRT25hnPVvJew":{"text":"This place was quite a bit out of our way, but for some reason the power was off to half t","useful":0,"cool":0},"QhVFMd1otzdpcpV5LrHFjg":{"text":"Great place for vegans and non vegans to eat together and stuff for breakfast and lunch! I","useful":1,"cool":1},"GiyTN5ZBG29Og7yzIreJig":{"text":"The energy in this place is electric! It is apparent that the owner is making/watching his","useful":2,"cool":1},"iHl6ZQ4VSzlPPYvEr37r-w":{"text":"I'm not a big potato eater.  Their crispy potatoes are AMAZING!!!  I could eat a whole pla","useful":1,"cool":0},"JZJB0b56VhoCmVfsIc5-OA":{"text":"I went in today for the first time for some food to go! The staff was very polite, and acc","useful":2,"cool":1},"UutbhJUVhAKEjvMFT21d7A":{"text":"From the interior to the food and service, this place was great. The staff was very friend","useful":2,"cool":2},"FYh-5aeE82x3G9jlDgYD2w":{"text":"I appreciate this place because it gave me and my crew something extremely valuable: a jok","useful":0,"cool":2},"Aw9aWeqx_gQ_oYsO9yI-_A":{"text":"The crawfish croquetta...amazing! This restaurant offers a nice variety of food and it's a","useful":0,"cool":0},"MNofP0eOWlDBELPZpzoQvg":{"text":"Maybe it was my fault for going on a Sunday at noon for brunch but, my word! The wait was ","useful":0,"cool":0},"gvYx3yrWl1528ofX6QclzA":{"text":"I loved this place because they had so many amazing vegan options to choose from for both ","useful":0,"cool":0},"9taMVjp1mzYcnJr1nF4nQg":{"text":"Experience was great (Easter Morning) sat us right-away\n\nFood was great / prices excellent","useful":0,"cool":0},"C6M4QCuKESkCXslC4D5BFg":{"text":"It was an unexpected pleasure to eat such fine food in a very unassuming cafe. I had the c","useful":0,"cool":0},"LiypKRXsovt4ZL5OWMVNsw":{"text":"The cutest little cafe ever! I'm usually wary of cafes in that area because they tend to b","useful":2,"cool":1},"sywD-R6ZXyjjTa5vpleuXw":{"text":"This place is a hidden gem! I went with my parents around 9 am on a Saturday and we were a","useful":2,"cool":0},"itVflw3A4SJ1K3s9i5ifsw":{"text":"AMAZING AMAZING AMAZING! They have a mega tasty vegan menu and non-vegan menu so all peopl","useful":0,"cool":0},"HsV8lZYWm7a6xWCO2aKgaw":{"text":"Incredible breakfast!! Chia seed pudding was delicious, pork chop was perfectly cooked, eg","useful":0,"cool":0},"KQs1y0DftgNWj47ZcY1ASw":{"text":"The Cajun Catdaddy is so rich and delicious. I couldn't even finish it. The chefs here hav","useful":2,"cool":1},"u5ijCCvrlYu7XKhXxON_iw":{"text":"Such a cute place! Perfect for brunch. I ordered a Vegan Ranchero with eggs which was ok, ","useful":2,"cool":1},"IogDA4K26t8r4kj2UJOapw":{"text":"First time to NOLA, this place was closest breakfast spot from hotel.  Delicious!  I had v","useful":0,"cool":0},"nTmDW7dDTOXqeNVqBtmWOg":{"text":"Great food. Horrible hostess manners. Come when it's not busy if you'd like to be treated ","useful":1,"cool":0},"MACw3cNR7T6cluk42COJ9Q":{"text":"We were looking for a spot to have Saturday brunches at ...and I think this is it! We abso","useful":0,"cool":0},"aLvKtKd0ulUvvaKnI9uDBA":{"text":"I appreciate new restaurants, but this one isn't there yet. Maybe new business jitters--ev","useful":0,"cool":0},"Bg6Bov01GpMWct425LpDbA":{"text":"The food was really good and so we're the drinks. The matcha was especially yummy and the ","useful":0,"cool":0},"wuyg-Ojaao7d3r5qqvrRiw":{"text":"You must try this this place! The service was amazing and the food was excellent! I got th","useful":1,"cool":0},"64pWyvX548N9Mlp3YDe8Dg":{"text":"I came in for the first time today and had the biscuit sandwich. Usually the biscuit would","useful":2,"cool":2},"0kxW-1wWewx6CJb4lsltqQ":{"text":"I've been to Bearcat about 3 times already and each time I loved it! The servers were so w","useful":0,"cool":0},"Im_cyhesF2Zqhr_vCsvrJQ":{"text":"Definitely a must try. Best potatoes I have ever had. If they have the crab daddy on speci","useful":2,"cool":1},"577vU53_Z7X0vmZgwTnKtA":{"text":"In town for a wedding and this may be the best breakfast we've ever had! Better than the f","useful":0,"cool":0},"O2pZLBIBlGYs5A8VIJw8Uw":{"text":"Yay! So cute. Staff is cool. Wait was not bad at noon on a Saturday. Potatoes are bomb. No","useful":1,"cool":0},"zxNu7IVvabwxgld9G_AePw":{"text":"Michael is the best! All the servers are great and handle their constant busy moments like","useful":2,"cool":1},"6zIygLfs30CDANrQfLHJfQ":{"text":"I had the Crab Daddy daily special. A huge portion, and everything was great - the soft sh","useful":2,"cool":1},"RsM5a8djfHxt6gfDbcQyTA":{"text":"Amazing!! \nEverything about this place in title! These hipster millenials worked!! \nJust a","useful":1,"cool":1},"u9yR6E3xXhFXk1LFcEWorw":{"text":"Let's start with the guy at the host stand. Tables were open but he asked us to wait. Fine","useful":1,"cool":0},"SS8lNcxYlJ-8UPCJuVc4cw":{"text":"Last week I saw some reviews on this place and I knew it was the next place I had to go.  ","useful":1,"cool":1},"uyl1CiSVErWisgiexELMGA":{"text":"Really Really Really good! Iced almond Chai Latte with the badcat was great. Never had pot","useful":0,"cool":0},"XA6C1h7x51zN_UN1wkpt2g":{"text":"I adore this place. Great vegan, vegetarian, and healthy options and tasty not so healthy ","useful":1,"cool":1},"oPOOr33hU31JcvUNh9bzRg":{"text":"On vacation so we took our Lyft drivers advice about this place. Wow! We ate here twice in","useful":0,"cool":0},"tsyQlONCnSfpPeOjAYjVdg":{"text":"Vegan quesadillas are TO DIE FOR. Please come eat here. Also the potatoes are extremely de","useful":2,"cool":0},"lZ2JTt4ipNAktBjswpeZlg":{"text":"Um- you have to go here to try out their vegan breakfast. The quesadilla and their awesome","useful":0,"cool":0},"DdgG89HsvV9pZJjAIEvOJQ":{"text":"Prior to my trip back home, my sister asked where I wanted to eat. Since this place kept p","useful":2,"cool":4},"32LBph5UlAIv_6GaOgRpTw":{"text":"Shared the crawfish with Cajun gravy on a biscuit. OMG. \nEat here. Super friendly staff an","useful":0,"cool":0},"_pksm2SiWYp-2wYbVFKZ7g":{"text":"I've heard so many rave reviews, so I had to come try! The service was really great and th","useful":5,"cool":3},"uIRc1WND6qActeKXGR6Yvw":{"text":"What a great restaurant. Latte, brisket hash, shrimp and grits and bison burger were out o","useful":0,"cool":0},"c-9bGRMyqi09S4MJEKfGaQ":{"text":"I've been to bearcat a few times and I must say their breakfast is bomb. The chia seed pud","useful":0,"cool":0},"dXKnFkaEfNq9fFJTD5WXWg":{"text":"This is my new breakfast place. My husband did a random Google search and Bear Cat appeare","useful":0,"cool":0},"Mi4y3zRzY9-66Mj0sUhTQQ":{"text":"Best food we had in New Orleans!!! Especially for staying with the theme of New Orleans cu","useful":1,"cool":0},"cWVOru1MJ5QyQZh4pLkRmA":{"text":"Bearcat was a great place to get breakfast. I got the bearcat breakfast and it was worth i","useful":2,"cool":1},"y1_ftLnfM69HdinClFVI3w":{"text":"We tried this because we were staying at the nearby Alder Hotel. SO glad we did. The break","useful":0,"cool":0},"GawiX9hRhaAem1hssVT9kg":{"text":"Last week I saw some reviews on this place and I knew it was the next place I had to go.  ","useful":2,"cool":0},"ePJxy0vqeFQbo-euUlf89g":{"text":"This review is based on just one visit but my lunch date had been multiple times and raved","useful":0,"cool":0},"dR54He9flbQEbMuzCp69PA":{"text":"The food was so good here, I ate until I was stuffed! Not only is this a great brunch spot","useful":1,"cool":1},"dZwcShtPlaFw2P-MSvNSSA":{"text":"There were cherries in my granola & chia seed pudding today..Cherries! Tho we've never met","useful":0,"cool":0},"QfktWESQFXMCmMA-9CG4Bw":{"text":"Soooooooo good. The lattes are wonderful, as are the juices & everything else on the menu.","useful":0,"cool":0},"Uj_9-mvNXYfrYvcu4z6YWA":{"text":"Cute, delicious, unique, and not snooty and expensive!  Yippee! CRUNCHY TASTY BREAKFAST PO","useful":2,"cool":1},"K3avglCFBAPdPo3vH_X8rA":{"text":"The coffee: The cortado was creamy. It was a darker roast, so a bit more bitter, but also ","useful":0,"cool":0},"8SGV5TdsLyqf5FZaZGhuBA":{"text":"This place is sooo goooood! By far, probably one of my favorite brunch places in NOLA. The","useful":1,"cool":1},"gn2FCMLMktjpOix792bEzA":{"text":"Love this place for breakfast. Good food and service, however they loose a star because tw","useful":0,"cool":0},"mdUFEtuASaxN49rJQVciIg":{"text":"Absolutely precious. I love the fluffy cat mascot!!!\nReally yummy. I enjoyed my chia puddi","useful":2,"cool":1},"GlfdiybJljnw7mXPNUInWg":{"text":"Bearcat is a great place to go for vegetarians. The menu features many vegan/vegetarian op","useful":0,"cool":1},"eqJ4eBo4RsMKNzPXbuxzbg":{"text":"Lovely place with great food and matcha. The staff is attentive and friendly. We came here","useful":1,"cool":0},"dgpLfcNzKq0nOi8DQ0Hi5A":{"text":"The food was so good here, I ate until I was stuffed! Not only is this a great brunch spot","useful":0,"cool":0},"J97-0QkMHOG45agFpoxwnQ":{"text":"Everything was amazing!!! Loved the chia pudding! Great service and very nice atmosphere.","useful":0,"cool":0},"yT0vM7SlDvqfo-Zp-E3GRw":{"text":"Food was hot fresh and very good. It was a home like feel to the place.\n Ever one was frie","useful":0,"cool":0},"AJtBpMMgBzLpaRBKroeR9g":{"text":"This spot is amazing for brunch (and it's served all day). They have several gluten free o","useful":0,"cool":0},"s3H0ilYN9WVwcoiwXpXcag":{"text":"This was some of the best food I've eaten lately. My husband and I go where the food is an","useful":0,"cool":0},"wP9Gx_zuLGtxszjR1Ex-aQ":{"text":"While visiting New Orleans, I stumbled upon this little restaurant and was intrigued becau","useful":0,"cool":1},"_0nsuz3Ss76PoHWrTnPgiw":{"text":"Love this place, the food was very good and the service was amazing. The restaurant stays ","useful":0,"cool":0},"UjJTrbkpjH01KlLVK072gQ":{"text":"I love the Bearcat Cafe. This restaurant was recommended to me by a valet worker at my hot","useful":0,"cool":0},"spiJVaQvjufR5CvHaMAkyQ":{"text":"In town from South Florida. They have the best coffee. We had cappuccinos and they were fa","useful":0,"cool":0},"rTnibxGfSqB04pkiRq4XdQ":{"text":"Can't say enough good things about this place.\n\nThe wait can be long as they are busy espe","useful":1,"cool":0},"4pLWXsIbo1ERjzKGFUTO1g":{"text":"I love Bearcat! I guess you can say I'm a regular. I caught myself coming here twice a wee","useful":1,"cool":0},"4FuO793vFMvvzf_2lW1ctw":{"text":"This place is absolutely delicious!!! It is ALWAYS packed and that should tell you somethi","useful":0,"cool":0},"axrO2Han-mXM68k02g0b-Q":{"text":"THE POTATOES. You must try the potatoes. Best. Ever. Love the vegan options and the decora","useful":0,"cool":0},"NQVeH3HLhrxhzkGlTbgM1w":{"text":"One of my favorite places to get breakfast! The staff is super friendly and they usually a","useful":0,"cool":0},"KvedfxF2IBYUt2Uhj8t0kQ":{"text":"The Tasso and crawfish gravy & biscuit was to die for!! I will be dreaming of it until my ","useful":0,"cool":0},"iDIoMd9xFU6SKC2jzy4UDg":{"text":"I am a total breakfast/brunch fanatic and a sucker for good service. Bearcat has both. The","useful":0,"cool":0},"YuvtYCBfWlF_ysWiVQWmPg":{"text":"Great for vegetarians! Love the \"good cat, bad cat\" options. I do wish they served booze b","useful":0,"cool":0},"lnObBtplnJ3yDLYmfb5DzQ":{"text":"We really loved this place, so much that we ate there twice in one week!  I thought my sal","useful":1,"cool":1},"6pQ530uXvVz1t4U8EXTcKQ":{"text":"Whoa. I went with my cousin who was visiting from Atlanta and she wanted a breakfast place","useful":0,"cool":0},"qICD0cXy5ibQbzd5a7RMKg":{"text":"I stopped by after reading the reviews and the food was pretty good. Ambience was good. Se","useful":1,"cool":0},"10FI8H4hI9oNW0OpQ2VSvg":{"text":"This is probably one of my favorite brunch/lunch places in New Orleans! *drools* \n\nUnpopul","useful":0,"cool":0},"pvAfCvXxPJ7PW8PphNjcjQ":{"text":"We made Bear Cat a brunch stop for my vegan friend's birthday weekend. Great place for bot","useful":0,"cool":0},"4Z0TbT8ubtQQx8vuXJUK6A":{"text":"This place is absolutely amazing! The vibes and looks of this place is really chill and I ","useful":0,"cool":0},"Vadudh7kASfXztBs0OtJig":{"text":"I like this place but it gets way too busy!!  We made the mistake of coming here on a Satu","useful":1,"cool":0},"fOVSndkJFMWC1cvUTohf0g":{"text":"The BEST chai latte I've ever had in the US. Mentally transport yourself to Tanzania and s","useful":1,"cool":1},"zRZzXJr5sDosHnni1cSFgg":{"text":"I came here with a friend Saturday for breakfast. I got 2 scrambled eggs, potatoes that we","useful":6,"cool":2},"CgdqDo8N_fobJ08I-TRZ8w":{"text":"I want to commend how great of an atmosphere Bearcat Cafe provides. It is extremely refres","useful":2,"cool":1},"FOAd9ibsDQ1wyf2R1Pcz_A":{"text":"This was such a great concept! I love how my boyfriend a non vegan can enjoy a big hearty ","useful":0,"cool":0},"704fNNNNj_-tgE8ssEzoFQ":{"text":"Such great experience every time I go! The last month I have gotten their soft crab specia","useful":1,"cool":0},"PcHPPGZ66ZdImpYQUZ4J6g":{"text":"It was so good! A short wait, and we sat outside for the sun (but would have been nice ins","useful":0,"cool":0},"FHhjmzwV98QZX88XApZhew":{"text":"The first time I tried Bearcat the wait was an hour +, granted it was weekend brunch, so k","useful":1,"cool":0},"wy76sgvjY6rFS9o638rQAA":{"text":"Stayed at the Hotel Adler and walked over for breakfast. I have two words that I now assoc","useful":1,"cool":0},"S_iQIKgnFYfadicw2dmZ8Q":{"text":"absolutely delicious! We vegans sometimes hit a jackpot, and this place is one of them. De","useful":1,"cool":1},"VGRSpTmS_U2FnhKnBGnTdQ":{"text":"Came to this restaurant on a whim and our party was blown away. The quality of the food wa","useful":0,"cool":0},"1NCBhxpS5nd28z1NBwdp9g":{"text":"So awesome! Had a short wait but it didn't take long. Food was amazing! Please keep the Br","useful":0,"cool":0},"FvEO0i37ElK9ANuKLyJDDQ":{"text":"Visited Bearcat back in February with a Bachelor party group. There were 7 of us going for","useful":0,"cool":0},"dhWorvR6_6mfts84tSOaiQ":{"text":"I decide to get an all vegan breakfast and settled for the tofu scramble. It did not disap","useful":1,"cool":1},"x9MEwGO3p-DdHAZhS3enpw":{"text":"I had time between meetings and decided to grab a late breakfast at Bearcat Cafe. Of all t","useful":1,"cool":2},"Te_14RTWmzpnWTISCaPBaQ":{"text":"Bearcat hadn't disappointed me with the food once, even if sometimes it also failed to mak","useful":0,"cool":0},"FtGD7edHIQhPL33XcaHEJw":{"text":"This location was really neat and clean. They have a modern layout, and it didn't take too","useful":1,"cool":0},"J5UuKtua9XelKNi4EBNXAA":{"text":"BearCat is awesome!! I have been dieting for a month in a half now. I have been finding it","useful":2,"cool":1},"jA5C9CQ5KtRqV5gL7YuC9g":{"text":"Possibly the best pancakes ever. The vegan and regular are both fantastic. The wait is usu","useful":0,"cool":0},"0fESuCA_-JmGqWD9tEOnJw":{"text":"I wanted to give bearcat cafe atleast three stars because I really wanted to enjoy it with","useful":1,"cool":0},"F4gR7u0cSgwNHvxFeRdhPw":{"text":"Best  Chai pudding & fresh juices is my favorite thing on the menu . We had the bearcat br","useful":0,"cool":0},"zl0oQQH9uS8wgIxzp7-wzg":{"text":"Probably the worst restaurant experience in my whole life! I've never been treated so horr","useful":3,"cool":0},"EcniQOxcvWR4eqpczR3vww":{"text":"I found this place when my mother was in town for her birthday. And let me just say the fo","useful":0,"cool":0},"8ZeCOa4RijFjicbTgUQ0fw":{"text":"This might have been the best find of the week. Never mind if you're a vegetarian or not t","useful":0,"cool":0},"mKi19YjTDIUejfb5C09tLA":{"text":"Breakfast was delicious! Fresh squeezed Valencia orange juice and the coffee was perfect. ","useful":0,"cool":0},"CkjWfvSGbABx8G5Y1v7a8w":{"text":"Ordered the hash, peaches and cream pancakes, biscuit, yogurt and matcha latte. Hash was g","useful":0,"cool":0},"YYDuJXGCW63Jgsi4KZZCxg":{"text":"Breakfast was great. Pancakes were amazing!!! The potatoes had a good Cajun seasoning. Mac","useful":0,"cool":0},"haeKwiCxKiG4j4izXLsZsw":{"text":"Fantastic pancakes, and know their way around a pork chop!  Wanted to go back as soon as I","useful":1,"cool":0},"I_SuOvIw7BJTlvxmZRmmaw":{"text":"Ok this was soooo amazing! Breakfast potatoes crispy and seasoned just right. Our party of","useful":0,"cool":1},"01HZvs0CdSlwYv1hPRKYsg":{"text":"Awesome food! I'm a college student so i can rarely go bc the prices are kinda expensive b","useful":0,"cool":0},"dtpgk3rm14RAL-tPI2RVNw":{"text":"Amazing! Love this place! Pancakes melt in your mouth. The wait is pretty long though depe","useful":0,"cool":0},"IPtbod0JomJHzD2dGQW5Lw":{"text":"Their menu is very interesting. I had crab meat for breakfast which is out of my norm. Del","useful":0,"cool":0},"4VW0K8Ez81G8Nb3LLAXEuw":{"text":"ReAlly clean,  cute decor, great breakfast and you get a pretty awesome sized plate of foo","useful":0,"cool":0},"jh-QEQOBG8XYZahbbbAO7w":{"text":"Not what you'd think. I had the cave breakfast. The pork chip was way too salty. The cauli","useful":1,"cool":1},"a6dQktWI3SZAOhVl2LwdMg":{"text":"So happy with this cute, perpetually busy place while in town in NoLa for a long weekend..","useful":0,"cool":0},"gBU7fMCNvISGm7t5x-Pbkw":{"text":"this place was awesome!! super busy when I went but the wait time wasn't bad at all and st","useful":0,"cool":0},"iCanUmBMksEtyhKHzOGSWg":{"text":"AMAZING hot chicken sandwich. Basically comparable to Hattie B's hot chicken (queen of all","useful":1,"cool":0},"6bjBl65tZSMzhhD8nyAUHg":{"text":"Woah!!!!!! This place is AMAZING!!!!!! From the outside it looked like it would have been ","useful":0,"cool":0},"s7zuVCDECMH5O7W_m-3YQg":{"text":"We went to bearcat for brunch while visiting town. I had the salmon. It was the best salmo","useful":0,"cool":0},"8NB3q7VWC4mpBXJPbpIyWg":{"text":"Oh, Bearcat. Where do I even begin? I think I'll just go by dish ordered.\n\n1) Vegan Queso ","useful":0,"cool":0},"aVIK9g078PVsfXsxh9xAEQ":{"text":"It's a very nice modern restaurant with great food.  Coffee is very strong if thats your t","useful":1,"cool":3},"pAek9-yNeRhJ_9DK-ieYHg":{"text":"Visiting NOLA w/ girlfriends and chose this spot for breakfast based on their online menu.","useful":2,"cool":0},"oeQBelER4Tuk6_EA8-vYew":{"text":"This is one of my favorite breakfast places in America (I travel weekly for work), IT'S TH","useful":0,"cool":0},"lVF8oDhBNFEvPoIEZRLsVw":{"text":"Superb customer service, delicious food, tons of gluten-free and vegan options, and adorab","useful":0,"cool":0},"KgMz7YhrGIUeiFH99SL_dA":{"text":"Been here a few times, really love the atmosphere and food. Both vegan and non-vegan optio","useful":2,"cool":0},"_5gHC1n-BbGnmwkqzTLi-Q":{"text":"Very cute brunch spot! Pros and cons to follow.\n\nPros: \n\nexpansive vegan, vegetarian, and ","useful":0,"cool":0},"4GsZHeUmIcgumyxELQ1ZRA":{"text":"By far my most favorite breakfast/ brunch place. Everytime I come I try to order something","useful":0,"cool":0},"jQPstemaQ6saCqBHzRHOeg":{"text":"Amazing New Spot in Nola! This is my favorite brunch place in all of Louisiana. I am a veg","useful":0,"cool":0},"osDhaKCeQnVH-yUd-ZaiOg":{"text":"This restaurant was so good I went two days in a row. It was so amazing. Both the good and","useful":1,"cool":0},"i3kmE1YPY8kJFesmbO70jg":{"text":"Beyond delicious. The hype is real. The crab egg dish was maybe one of the best things I'v","useful":0,"cool":0},"8Pn937-4btC_LWxOqI3Gcw":{"text":"flames mignon....;waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa","useful":0,"cool":0},"2WKF8ejMZ5swn8krni1xGA":{"text":"What can I say... last day in New Orleans. My fiance and I are vegan and we had everything","useful":0,"cool":0},"hitk3qj7VDL2srliNtCmfA":{"text":"We stopped by for some food & the wait almost made us leave..it  was an hour! Man oh man w","useful":4,"cool":3},"UZqr_JPqLqxRWm_yBBxKnA":{"text":"Awesome food in a cool funky neighborhood! Had the vegan queso(and we aren't vegan) but yo","useful":0,"cool":0},"fT-Awd60Sti2Dwrn1zK9_g":{"text":"My favorite spot ever for breakfast. Michelle is the best waitress in the world, tip her a","useful":0,"cool":0},"FwrHGdo-xTT9RjWMUmFZzQ":{"text":"Juice is diverse and tasty; it would be better if more concentrated. Menu is cute. I order","useful":0,"cool":0},"73viUTSCTA3VTw-Nu1zmgw":{"text":"the highlight was definitely the variety of vegan and vegetarian options! There was a 40 m","useful":0,"cool":0},"GQLKBSzpKCfFLIkTUvV8AQ":{"text":"Wonderful, welcoming, warm service -awesome menu spread and remarkably delicious vegan foo","useful":0,"cool":0},"3sL2z-I7LqO9xVZru-69bQ":{"text":"I went down to NOLA not knowing what options I would have to eat since I'm vegan. But I fo","useful":0,"cool":0},"89dM-7B3xmdv7DS_IcxW9A":{"text":"My awful friends forced me to wait an hour for a table at this place. But it was worth it.","useful":1,"cool":1},"WpsU0J4k1YvS1y9BwSs_iA":{"text":"Best breakfast i ever had in New Orleans. Don't get scared away by the wait times. They to","useful":0,"cool":0},"tLPtkrjyLnnMncQtpedsWg":{"text":"Bearcat is amazing, probably my favorite breakfast spot in all of New Orleans right now. T","useful":0,"cool":0},"Ft1lPopKEYSsRTvpmZO0vg":{"text":"Healthy, savory, AMAZING food. I have been several times and everything my boyfriend or I ","useful":1,"cool":0},"A5pn_aDunAVFetaXj6ctwA":{"text":"AMAZING brunch spot! I ordered the breakfast club and the eggs on it were scrambled to per","useful":0,"cool":0},"QS8OrQqNaZsnIqEpZ9FD6w":{"text":"The place looks really nice and chic. Service was great too. I ordered the Portobello Phil","useful":0,"cool":0},"QFaEtiIaJRj1cJJGnTeD8w":{"text":"This place has amazing breakfast and customer service. So modern and fresh everything. Hig","useful":0,"cool":0},"yCL_P6BlAb9qOyO1Ew-rhQ":{"text":"Creative lattes, although the honey and lavender I got just tasted like a regular latte. A","useful":0,"cool":0},"Pmpz33GF4YX4nZ5LBPFRRQ":{"text":"Best potatoes ever... crispy & soooo flavorful!! It was a 1hr wait for table of 2 on A Sun","useful":0,"cool":0},"vH-919EG8ghFIvx22y2WKw":{"text":"Amazing pancakes & coffee . Love the decorations .. soo creative and simple . This is a go","useful":0,"cool":0},"7sOhLrOw0GD-rtldyaA5SA":{"text":"Hey you scrolling !!!! Yeah you!\n\nStop looking for restaurants and make your way here as q","useful":0,"cool":0},"Nt8On0T3EI6BN6JjzEXtqA":{"text":"Amazing chia pudding, the sweet potato noodles are off the chart, and the vegan pancakes t","useful":0,"cool":0},"S1tYvK0ZHVViRAo-Cem6xg":{"text":"10/10 if I could every time I come to Bearcat it never disappoints! Decided to get somethi","useful":0,"cool":0},"WNoh47NSS1teMYCwJ3tQ6Q":{"text":"Awesome food! Awesome service! 2nd time in NOLA and absolutely recommend this spot!!!!","useful":0,"cool":0},"jnoZx-jVoCOliHGFsyurIA":{"text":"This place was Awesome. Honestly the best breakfast I've ever had. Get the cat daddy!!!!!!","useful":0,"cool":0},"QwTrnn4pgy0FOZSjxGfJ4w":{"text":"This place had potential for me but fell flat we were the first in this morning and it too","useful":0,"cool":0},"4EypE3NgX6PSs5KLqJBCNA":{"text":"Everything about this place is great...\nThe coffee was amazing.\nThe food came out quickly ","useful":1,"cool":0},"n97U2k1DOYMErndz2S_dlQ":{"text":"Great food.... Breakfast was the bomb. I had the BearCat breakfast everything was perfect.","useful":0,"cool":0},"--SXWT7ue0q_ox_HZNAS2g":{"text":"Nice place. We had a company Christmas party here! Staff is super friendly.\nFood was deeee","useful":0,"cool":0},"mJb8Kr1Y1L_6cNhL0CeYLA":{"text":"Soooooo good. PANCAKES!!!! Recipe please ! They are amazing. This will be a stop for me ev","useful":0,"cool":0},"_Mbhgn0AsjY_ba4QXHQH_g":{"text":"It used to be one of my Sunday brunch places but lately the quality of food has gone down ","useful":0,"cool":0},"2pj6fhRK_s-qFPt_cndJ3g":{"text":"Myself and two friends went to Bearcat at 11am on a Sunday. We were told the wait was 30 m","useful":0,"cool":0},"osmvbEKgo8tf0rRzTcCNwg":{"text":"Upon walking in,  I could tell that this place was special, but that soon faded.\nWhen it w","useful":2,"cool":0},"j85X-NcnEArplPnlJaXssA":{"text":"Honestly, I have never had such amazing service as I did here. My boyfriend and I decided ","useful":0,"cool":0},"lO_C-g7IB52fbnHEPK-Bhw":{"text":"OMG, the shrimp and grits are divine!!! The pancakes are fluffy like I can never get them ","useful":0,"cool":0},"XHQzxuWlRet_NUKVPheuIg":{"text":"This is gluten free / vegan heaven. If I lived in NOLA I would eat here every day. \n\nAmazi","useful":0,"cool":0},"z12TpPONeJJ5gzf_eBFl4w":{"text":"A cafe with a great atmosphere, friendly staff, vegan options, and a wide selection of fre","useful":0,"cool":0},"J8BH6B5UHD9jNi7lkFOEyw":{"text":"Was looking for a breakfast place with gluten free options near where I was working and fo","useful":0,"cool":0},"fmix_pWVAQKaeqzUiqwhdA":{"text":"Based on the food alone, I'd give five stars. But the overall experience drags it down a b","useful":1,"cool":1},"dFDKfQxJEsMyn0BF3aa5HQ":{"text":"Came here for breakfast due to it being close to where my husband and I were staying in No","useful":0,"cool":0},"wj1U7hIoC71NhNpRzFLc6A":{"text":"My friends and I came here because we wanted a place with vegetarian options! We came a li","useful":4,"cool":2},"Rvf8_x9eOWHU1aexyDgwxw":{"text":"Great brunch spot on the west side of town. The word is definitely out about this place, y","useful":0,"cool":0},"U_E0zT8UYKSI-UO3w9eRog":{"text":"I ate here twice this week. The food was fantastic and we had the same awesome waiter both","useful":0,"cool":0},"dGTKPLh23K1lUbPVUVhPSA":{"text":"My favorite breakfast place while in New Orleans. Ask for a Hot Daddy - basically the cat ","useful":0,"cool":0},"AdnxUhM4P6wLFWyG-tKoKw":{"text":"Seriously my FAVORITE breakfast spot in the city. We take all of our friends here when the","useful":0,"cool":0},"__gz2rZU8Sinw0LQFAyPyg":{"text":"Hard to find healthy options in New Orleans, this place delivers.  Loved the cozy neighbor","useful":1,"cool":0},"-B4SN9SL5GL8mYHwIs-Stw":{"text":"Bearcat Cafe was simply amazing! I ended up here by chance and it impressed me from the st","useful":0,"cool":0},"6PYlLoU-hlqk7m5XYtBBHw":{"text":"Bearcat Cafe! We make a point of eating there every time we visit NOLA! Every bite has bee","useful":0,"cool":0},"FYHl7wuOu2CF6kBmDbodKA":{"text":"This cafe is definitely on my top 5 must-visit spots in New Orleans. It is wonderful quirk","useful":2,"cool":0},"mktS3kiLaLv_2eYtK4rqQg":{"text":"Probably the best and freshest meal (brunch) we've had on our visit.  Had the Bearcat Brea","useful":0,"cool":0},"4LmeIS0wqY8t6dbmHMOGXA":{"text":"This spot is amazing!!!! The pancakes, the chorizo dish (a special) and the potatoes are s","useful":0,"cool":0},"qgYyfblb7w7NwO9ZdKiwww":{"text":"This place is EXCELLENT! The service, the food , the vibe, everything is amazing! I'm on v","useful":0,"cool":0},"HVQ-fqL8smZS9pS9Q2E_yQ":{"text":"First time in the Big Easy. We were looking for a breakfast spot that offered vegan option","useful":1,"cool":0},"7VCjIhasbTtNutdtu0h7kA":{"text":"Bison sausage was amazing. I'm going to warn you about their eggs, as scrambled eggs will ","useful":3,"cool":1},"bhndJ2NxzJji6ZZr5r818w":{"text":"Yummy thick cut bacon and great beverages. I was trying to be healthy and resisted the del","useful":0,"cool":0},"rbnmwoUW1s4H4-kYyQV2NQ":{"text":"Amazing food. The crab scramble is fantastic. The service is excellent. Very very attentiv","useful":0,"cool":0},"mWhdbE633luXhChKTKWsWA":{"text":"Came in on a Tuesday morning for breakfast.  Clean atmosphere and attentive staff. We orde","useful":0,"cool":0},"dR9qq0ooMTt7aDxhNIntZg":{"text":"This place is so cute! We had a short wait for Saturday brunch but it wasn't bad. I got th","useful":0,"cool":1},"aklsjEviFUwLU0noQzAd-g":{"text":"Always a favorite brunch spot! Over the years we've tried a bunch of things here and all h","useful":0,"cool":0},"aEba4D-OZqr_PWeUHDK0Uw":{"text":"This one of my favorite places to eat in New Orleans. It closes at 3 so come early! \nAltho","useful":3,"cool":1},"MoIAxg5_v4qw-ZLQ1rAE4w":{"text":"As someone from out of town, I always hear about how delicious the food is in New Orleans.","useful":0,"cool":0},"5TH_JjIpqSg5adiRulTJcw":{"text":"This place is amazing . I've eaten here more then twenty times and never had a bad experie","useful":0,"cool":0},"_A_BcXwRL_jEFZvfwA4_xg":{"text":"Went two days in a row on our visit to New Orleans That's all I have to say\nFamily of eigh","useful":0,"cool":0},"z7yHisKMg6sfOQyq_FsUqg":{"text":"This is an amazing breakfast spot! The food is sooo delicious and as my husband said \"thes","useful":0,"cool":0},"NgCTHCQlQJLN5RKT93mKTQ":{"text":"Really good breakfast here. Dishes are different but amazing at the same time. The bearcat","useful":0,"cool":0},"75Io62l_Nq1lvsgW4-aR1Q":{"text":"Scottish salmon dish with big fat Israeli couscous. Salmon cooked perfectly, sweet, juicy ","useful":2,"cool":1},"3RrBqVQvV9EZZgTRcRdSJw":{"text":"Pretty good place. I like the mornay sauce and the breakfast potatoes here. The coffee and","useful":0,"cool":0},"n-0YgT80etN5XdOopnY11w":{"text":"Had a wonderful breakfast today at Bearcat. From the moment we entered the door we were gr","useful":0,"cool":0},"gOYqV3MY5GcSRo0NsJmDDA":{"text":"Fantastic food, atmosphere, decor, and overall experience. Hands down one of my favorite b","useful":0,"cool":0},"DD670oNBxC3p3EdoMRkEUA":{"text":"The pancakes and potatoes are really really good!  Great vibe and surroundings! The teas a","useful":2,"cool":0},"gYFOyYRkBvL6PiheGOOvPw":{"text":"You ever been food drunk? Like so blissfully intoxicated from your meal? That describes ye","useful":0,"cool":0},"QWmIKQV7iS4wJs90XeNAsw":{"text":"We (my husband and our two girls) visited the cafe as a result of a recommendation. I was ","useful":0,"cool":0},"zdG7EQ1OoxXSrwoZRzIsMA":{"text":"A friend suggested we meet here for lunch while I was visiting him at Tulane. We hit at a ","useful":1,"cool":0},"lNVzfzu8FCYKODlnPubWPQ":{"text":"I love this place. Fantastic food and as a non coffee drinker, I never knew my chai tea co","useful":0,"cool":0},"ZOj3TceGvxBjyrl_PIBPXg":{"text":"I've had this place bookmarked for so long and was excited to finally give it a try! I was","useful":0,"cool":0},"5dTC3SMObOjfgo3Wys3HZg":{"text":"We loved absolutely everything here. Great food options including gluten free, vegan, and ","useful":0,"cool":0},"9WWXIGzjcM12XawPro9BAw":{"text":"Best breakfast potatoes I've ever eaten. Hands down. \n\nGreat vegan breakfast... I did the ","useful":4,"cool":4},"HCZDueeycVVnivpfwtvqhg":{"text":"This is the most performatively \"gluten-free\"-friendly restaurant I've ever been to. Huge ","useful":0,"cool":0},"96HgFj6BT-eWRTA_iTj1LQ":{"text":"This place is so cute and so sweet. Their selection of teas is amazing! I had the chamomil","useful":0,"cool":0},"Thbg-fMkBEbBISHcZYVdXA":{"text":"LISTENNNNNN!!!!!!!!!!!!!!!!!!!!!!!!!!!! STOP PROCRASTINATING & GO TO BEARCAT!!!!!!!!!!!!!!","useful":0,"cool":1},"5XfijhV0H0FHvdSB5I6pNw":{"text":"Outstanding brunch! We have a \"special diet\" family. We each found something to eat and it","useful":0,"cool":0},"WDzQfKqAiGGjEhHJoQRW1g":{"text":"This place is a-maz-ing! The decor is adorable and inviting, and it's the place to be for ","useful":1,"cool":0},"O1IZ8D7OSsnmHXaIo_-drQ":{"text":"Everything was amazing!! I'm not personally vegan but I have many dietary restrictions so ","useful":0,"cool":0},"zUPhSYJj-rfWlGELGQfaJw":{"text":"Extensive menu, tons of healthy and guilty options. I chose the latter route and ordered t","useful":2,"cool":1},"mX1ds8XiWgOqFYpkPrfYPA":{"text":"All i can say is WOW!!! This hidden gem is located in the Uptown area of New Orleans near ","useful":0,"cool":0},"an1pi-5VnKgEKDz6mYp7dQ":{"text":"This was by far the best brunch spot I have ever been to. Everything was fresh . The water","useful":0,"cool":1},"VWA2jmaF9SvZoQnFaIf0Ig":{"text":"One of my favorite brunch cafes in New Orleans. They have vegetarian, vegan, and gluten fr","useful":0,"cool":0},"66g_Y2so7lO1YZJDzi4HeA":{"text":"The brisket hash was really filling for the price it was (10) and the lavender latte was g","useful":0,"cool":0},"wxzUW2IWHlc6yZ8MJYUmug":{"text":"Trumpet scallops on their lunch menu were delicious! My only complaint is that the portion","useful":0,"cool":0},"1Y8yuaw9p55zxBjN0BAjvQ":{"text":"Our hotel front desk recommended this place to us. We were surprised by how packed it was ","useful":6,"cool":3},"EfEx58lreLIDYaLo3tvKsg":{"text":"Giving 3 starts because the service was SUPER slow. It took them more than 10 minutes to b","useful":0,"cool":0},"S-WhwiyNakBbeW7Ky0G8xw":{"text":"The food here was amazing. The chicken was perfectly crispy and the sauce paired with it w","useful":1,"cool":0},"5IrupaUl4MJE4zVOguITWA":{"text":"Decided to pay Bearcat after yoga with some friends! We had a small wait but that's typica","useful":0,"cool":1},"TK_hVJVPGehEjTfDJRs6Fg":{"text":"Bearcat is one of my top favorite places to go for brunch. The food is consistent and I lo","useful":1,"cool":1},"Pco_bVk2UhegAMWj-ZMMvw":{"text":"Im not vegan or vegetarian, but THAT was the best vegan pancake I ever had in my life, han","useful":0,"cool":0},"tA_kNt6xoSPwTrhljWG-CQ":{"text":"We tried the Cat Daddy, Hot Rob, and Shrimp & Grits.  Kids had the pancakes, chicken tende","useful":0,"cool":0},"Iri7xEgYCvAA4e4ick4IIQ":{"text":"loved the food here. i got the yogurt bowl. it was delicious and not too sweet. very very ","useful":1,"cool":0},"odfPI1WRvdqd_tJLChQkbQ":{"text":"This is the best Café in New Orleans! We were visiting NOLA for the first time and discove","useful":0,"cool":0},"XSEbquOLOSyoCn8CVwewOw":{"text":"Bearcat Cafe is a breakfast and lunch spot with a great menu. They have both healthy food ","useful":1,"cool":1},"zIR_q3TPTjTzFAtdz2ECVg":{"text":"Delicious coffee, juice, and food. Been here multiple times and every time I find somethin","useful":0,"cool":0},"zAUH0gBIZy6ybViP04k4bA":{"text":"Folks all the way back in Atlanta were raving about the vegan finds at Bearcat. So, of cou","useful":1,"cool":1},"CykYQUcbkSpxRAVtKCGMlQ":{"text":"This brunch is PHENOMENAL. I'm not one to return to a place twice in one trip, but I had t","useful":1,"cool":0},"39xSdfLf5q6QcF2R850D-A":{"text":"Great juice options. I wasn't very hungry when we went, so it was good to see there was a ","useful":0,"cool":0},"uUU4HIQPyVcPMHm4_lrEPQ":{"text":"When planning my vacation Bearcat was number one on my list of places I wanted to visit. I","useful":0,"cool":0},"9BoSZ9EyNEo_WqqjnHWfVg":{"text":"Took the wife a daughter to this restaurant for breakfast Friday the food was excellent es","useful":1,"cool":0},"v2omcY814X-vqSPApZqbjQ":{"text":"If I lived closer I'll probably gain 100lbs. Price is cheap for the quality of food they s","useful":0,"cool":0},"pG7YXH58D3Z3z6ui8cgOtw":{"text":"Ummmmm WOWWWW!! Great Spot. Great Vegan Foods. Great Service. \n\nI got the Vegan Ranchero a","useful":0,"cool":0},"agqiUVPfGdfg0G8slnNIKQ":{"text":"I'll just say this...We live in central Mississippi and we have traveled to NOLA several t","useful":0,"cool":0},"p1N05nflo_L46eYPwnPaPw":{"text":"I will join the chorus proclaiming this place amazing. Shrimp and grits, crab cake, pancak","useful":0,"cool":0},"mmMIe23XVQQH45qrGFYiMA":{"text":"Serendipity at its best. The food is amazing and the service is super fast. Added to my fa","useful":0,"cool":1},"ZPgRKJPzGij3G8vXFIgZuQ":{"text":"Literally every time I come here I go to heaven. The waiting staff is so friendly! And the","useful":0,"cool":0},"_AViz86yqj5tc9Ugtugz1A":{"text":"This was the best breakfast spot we found all week in NOLA. They have freshly squeezed jui","useful":0,"cool":0},"BP2Tc6BZoKAmyniKka9JOw":{"text":"Maaannnnn, listen!!! The food was amazing! Like, I wanted to just bring the whole menu bac","useful":1,"cool":0},"kjTXjfue4MtVh8xM2kEfog":{"text":"The apple juice and orange juice are awesome! And the bearcat breakfast was amazing, and t","useful":0,"cool":0},"iyhc0_oho8XEsLdrl6kAXw":{"text":"Bearcat is so good and delicious from start to finish. Forget Achafalaya, this is NOLA top","useful":0,"cool":0},"3saGY5bNigQ3gZXHLuRtig":{"text":"My husband and I went here for a late breakfast, luckily at 11:30 am they are still servin","useful":3,"cool":1},"eb9Ml4YoCkphMyotO4-uEg":{"text":"My favorite place to eat breakfast or brunch in NOLA. Great vegetarian options and a good ","useful":0,"cool":0},"EOIsR3JOqxoKZXxVUHvWAA":{"text":"WOW!\nJust a few minutes walk from our hotel was the tastiest shrimp and grits and hot chic","useful":2,"cool":0},"60DlcBWXz5jch8e1dEAgKA":{"text":"this. place. is. ABSOLUTELY. AMAZING! \nhonestly the best brunch I have ever had. \n\nIf you'","useful":3,"cool":2},"b7gyfIcw2zbjgUpMgKmEUQ":{"text":"Absolutely in love with this place. I always come back and get the brisket dish which was ","useful":1,"cool":1},"0l-XijSFAlV70JtyI86BBw":{"text":"The food here is good! They have some of the best pancakes I've ever had. The service and ","useful":0,"cool":0},"cyw3z1VfApzIsjOLDFzQyg":{"text":"This is the place foodie dreams are made of. \n\nEach dish is visually food-porn worthy and ","useful":1,"cool":1},"Qszz-4cRtGX98f4Aj_ydzg":{"text":"Impeccably amazing. Homemade yogurt delicious \nChia pudding heavenly, bear at breakfast wi","useful":0,"cool":0},"NpZ23Wf0BiGnLRK0fxmVbw":{"text":"Aside from the wait that was way longer than they told us it would be (45 minutes instead ","useful":5,"cool":2},"4CY6p16uPEyU7jWoSa0kYw":{"text":"Out and about and discovered this place while in New Orleans, the food was DELICIOUS and t","useful":0,"cool":0},"NNDy9YUjLjdAwcN5EIBazA":{"text":"The food here does not disappoint! Also, their specialty drink selection is out of this wo","useful":0,"cool":0},"bVh2lMJ0EC8Nc4b-CXbtWg":{"text":"New Orleans needed a place that offers a variety of options with for people with certain d","useful":1,"cool":0},"B1YY9IKCi2Wl3umTb1gUZA":{"text":"Had a really good time here for Brunch. Be prepared to come a little earlier than planned ","useful":1,"cool":0},"4s62hpbJB33jcPl6AxhuOw":{"text":"Best breakfast in town.  We got the soft shell crab topped with an egg and fell in love.  ","useful":1,"cool":0},"FnZaxC7SJAixT3GQPrZ00Q":{"text":"If your looking for a cool brunch spot in New Orleans, you have to visit Bearcat. I came h","useful":1,"cool":2},"lOgm0klIKpI10JL05-WB8w":{"text":"Expect a wait on weekends but the food is absolutely worth it. There is something for ever","useful":0,"cool":1},"uXH6ifGN5TQ6Ju_q3uXNiA":{"text":"I'd been dying to try the Bearcat Cafe since it opened this year. However, I was a tad bit","useful":0,"cool":0},"nfBVmLNyCEskH8rerOgfQA":{"text":"Our Airbnb hosts highly recommended this place, and I'm glad we stuck around, even though ","useful":0,"cool":0},"AGzl4qe_i49z-3yPW5Xjig":{"text":"I had the Breakfast Club sandwich. It was really good. A very messy sandwich but definitel","useful":1,"cool":0},"_F5ZW5Sb5pnaBxF132Xa5Q":{"text":"They food is always fresh and delicious. I usually get the Cat Mama Biscuit with a side of","useful":0,"cool":0},"XrCMdD0tjHX9uk6ztKznMQ":{"text":"The pancakes were great so were the home fries. Rlly long wait they said 20 minutes over t","useful":0,"cool":0},"gJYFE92rn9yjgzljGf5ZIw":{"text":"3rd time is a charm for me grabbing a bite to eat from @bearcatnola without a long wait. T","useful":0,"cool":0},"pvrIlNjkWrYjVBLkZ2Xwow":{"text":"The place was hopp'n at 11:30am when I stopped in for brunch after an appointment next doo","useful":1,"cool":0},"c-AwPQdaF5hWqAHwMcDDNQ":{"text":"Amazing!! Trendy and delicious. A great place for vegetarians, vegans, and meat lovers as ","useful":0,"cool":0},"uiRGzFjk1HuFf9kyB7j5tQ":{"text":"From Cali, flew in yesterday, visiting family and i made it clear i want to eat as much so","useful":0,"cool":0},"AqZTICBfIzBqnxFV6N6_EQ":{"text":"I came here yesterday with a large group and they were extremely accomodating. The service","useful":1,"cool":0},"1se1OKJGu2YGzJXinJczDQ":{"text":"My friend took us here and it was recommended by another friend. I heard the wait get long","useful":2,"cool":0},"8qHHya1owKxYPzvurEI97Q":{"text":"Just an awesome hipster breakfast/brunch spot!\n\nDefinitely recommend eating here because o","useful":1,"cool":0},"lVE-uBkNtzONEwawrzz_sw":{"text":"First time to NOLA, this place was closest breakfast spot from hotel.  Delicious!  I had v","useful":2,"cool":2},"nyK3V7Qd9Z9PWuqd4lMrJw":{"text":"Went here for an impromptu lunch and the food and service was delicious. I had the crab sc","useful":0,"cool":0},"gMyXaCGC4cNx2o2beA4GEA":{"text":"Me and my family loved Bearcat. It was a little bit of a wait but it was worth it. The foo","useful":0,"cool":0},"XD-qb9bZx-FwcvM3GUFAwA":{"text":"Bearcat was my favorite way to treat myself when I lived in New Orleans. Here's why:\n\n- Th","useful":4,"cool":4},"iWuCzgDjZqtAN8Ahg5XPRQ":{"text":"So good and it's nice they offer gluten free and healthy conscious items. Portions were ma","useful":2,"cool":1},"bORJlFmXlqwP-UC8zYfBBA":{"text":"Visiting New Orleans to help my daughter move. This restaurant has vegan (good cat) and no","useful":0,"cool":0},"WLBUUfNcxZwgS3ajR_chgg":{"text":"Agonized over where to eat our own NOLA breakfast. Thrillist. Eater. Yelp.\n\nAnd I crushed ","useful":0,"cool":0},"9Ez5DgHsTxTI2zkaVdouRw":{"text":"The food is great but the host is somewhat unbearable and makes the experience significant","useful":1,"cool":0},"g1WjP2OqzsY-GNxHIlBAVg":{"text":"Bawse shit only cuh shit hit like my mom wit a flip flop. Bawssssseeeeeeee. YUH. On gang","useful":0,"cool":0},"4x_52euLPyHAFgM5NF521g":{"text":"I have had this app for a while now but have never posted a review until now. Our waitress","useful":0,"cool":0},"hCBgxClbA-EPCYfM8v6rpQ":{"text":"Food was delicious, service was quick but attentive. Our server, didn't catch her name but","useful":0,"cool":0},"ZxKKA_KL8wxDa8peo0YyVg":{"text":"Yummm, I love bearcat. I usually come here on a weekday morning because their weekend morn","useful":0,"cool":0},"_mNGwvZ-QSW2p0tfsYColw":{"text":"Omg!!!!!! I'm NOT a fan of breakfast food usually but this was soooo damn good. Like how y","useful":3,"cool":1},"IujxMFRMHuxBrH66NyBJ8w":{"text":"Oh. My. Gosh. This is the best food we have had so far in NOLA!!!! I got the cave man plat","useful":1,"cool":1},"nsoT4Q_BM-jR5f7c_AJnRw":{"text":"One of my favorite brunch places in Nola!! \nAlready been to Bearcat a few times but it get","useful":2,"cool":0},"30nxxe7jsV9cMwoosHC6Jg":{"text":"I find brunch food, in general, as whatever. But at Bearcat, it's different. Maybe because","useful":0,"cool":0},"b7csYqrko9XneRy99-Ng_g":{"text":"Great lattes and breakfast brunch food with gluten free options available. Freret street d","useful":0,"cool":0},"U2FbRxFelTJSFjIA7v47Xw":{"text":"Hear me out. This was the best customer service experience I have EVER had. In my life. An","useful":2,"cool":2},"abMbowwMbcpLT-vQs_wWiA":{"text":"Food and drinks are ALWAYS amazing! The wait for a seat is crazy worth it! Get there early","useful":0,"cool":0},"qnL8OA3GTA4f2AAi2dpK2A":{"text":"Being a student is quite hard. Waking up early in the morning on weekdays in order to make","useful":0,"cool":0},"8ijEHvJu5zCKGMUYV5I9gg":{"text":"Definitely one of my favorite places in New Orleans!! Great range of options. Everything I","useful":0,"cool":0},"80SsmggAc1bRO8WnAjmw-w":{"text":"Great food had to wait an hour but it was worth it.  It if not cheap and this meal cost me","useful":0,"cool":0},"k4OazwibvDw3CPRwNJf-eg":{"text":"Came here on a rainy Saturday afternoon. Once we walked in, we were greeted immediately by","useful":0,"cool":0},"tq86lASRFlBVjU3Z-X0Krg":{"text":"Bad Service, over rated food.Informed our very disinterested server I had a cream allergy ","useful":0,"cool":0},"2IysOF4AEQ6ngB_SCEsZ8w":{"text":"Adorable cafe located in New Orleans. True southern food, with true breakfast foods. When ","useful":1,"cool":1},"jpxZzNwqFbwzyi61_I5Rxg":{"text":"Always love when the reviews are accurate. Place is all of 5 stars on food.  I'm from Nola","useful":2,"cool":1},"8VyoWPs4gBnJf60-D1pDxQ":{"text":"Amazing restaurant- food was excellent, service was excellent, ambiance busy yet comfortab","useful":1,"cool":1},"2tSCM5O35-Hwgi2ivIwnew":{"text":"Bearcat is so delicious. It's one of our recurring brunch spots. I especially love their b","useful":0,"cool":0},"nRMAEdNTZzoecQBbPGpA2Q":{"text":"ABSOLUTE GEM. YOU MUST GO HERE IF YOU ARE IN NOLA!!! Service is amazing, food is impeccabl","useful":0,"cool":0},"3gNpN1B7ZnhWXnvmz6Efdg":{"text":"I really enjoy coming to Brunch here on Saturday mornings, the Vegan Ranchero with Black B","useful":0,"cool":0},"cW7LW4ZYE5WuPasZSWL-hw":{"text":"Bearcat has options for anyone- vegan, vegetarian, & gluten free. If you're feeling health","useful":0,"cool":0},"a-OjtRepgszc6-N_KN4XSw":{"text":"Great food\nThe wait sucked \nHowever, the food was great, service was great\nAn overall grea","useful":0,"cool":0},"j6qRNYmciKmS-mcC2otl4Q":{"text":"Two stars because of the food/service connection. I ordered breakfast hash and inquired ab","useful":0,"cool":0},"CV7_6MNjlZWVHIDqPyJEDw":{"text":"This is my favorite brunch in NOLA. I love their pancakes and the crispy potatoes, but wha","useful":1,"cool":2},"6bQWtuRmOL1xFxOHP6ELHQ":{"text":"This is not an all vegan establishment. I swung by this location on Sunday after craving b","useful":2,"cool":1},"WkyPLMb85X4Z_l2OlV5dzw":{"text":"Driving through New Orleans and wanted to stop for breakfast and a friend recommended Bear","useful":0,"cool":0},"vcN_3vqQouLysg--NizpMg":{"text":"Ummmmmm.....THIS PLACE IS DELICIOUS! Why have I never eaten here before?! Everything we go","useful":1,"cool":3},"F7NhtqxF6GcAeAP5LDOIKg":{"text":"I've never left Bearcat Cafe hungry, let me start with that. I'm a creature of habit and o","useful":0,"cool":0},"5wRn7GesBWFcWJ5L71yd6Q":{"text":"Was so disappointed that the cherry pistachio pancake wasn't on the menu today. Was wonder","useful":0,"cool":0},"LjXF7To7ddDBRfKUg-89SQ":{"text":"My partner and I visited for the weekend and this was about a 24 minute walk from Uptown N","useful":1,"cool":0},"rqJcwENZzUMCRWbYHXJ52Q":{"text":"Bearcat is one of my favorite brunch places in New Orleans. I am satisfied every single ti","useful":0,"cool":0},"3tUn4XCkbKteKWevLpduag":{"text":"I've been dying to try bearcat, and finally got a chance to go. It wasn't that busy as I e","useful":0,"cool":0},"4N8ZWHp7uMNoFV751HQ1FQ":{"text":"Brunch breakfast yum! Biscuits are super flakey and tender. Had those paired with the pepp","useful":1,"cool":0},"dJ5V0ypRUsBSMTnchPE6mg":{"text":"Best breakfast in Nola. Wild mushroom scramble and the mushrooms over grits are off the ch","useful":0,"cool":0},"Ee7tYw5G1kFJOXKsIvonDg":{"text":"If you want hot, fresh food, this is your place. Every bite was rich and flavorful. I clos","useful":0,"cool":0},"zHXSYefZyaSn6RtP9f874g":{"text":"This is by far the freshest most unique breakfast place in NOLA. I love sitting outside an","useful":0,"cool":0},"HRKrt99JgnB2k4EFJiWBqA":{"text":"Bearcat Cafe is my place! Even though I want to be good cat, I'm usually bad cat and order","useful":3,"cool":1},"ykM35N_BJZuHiw8j5mYmkw":{"text":"Best service I've EVER had!! Yes, we had a 30-45 minute wait because it's so popular but i","useful":0,"cool":0},"E2xBj6iTxYwPMg76TSxg_Q":{"text":"Unique experience, fantastic food, and tremendous service. We were served by Edwin, the ma","useful":0,"cool":0},"pPdMcUTRIfIKe6L3zbq4Dw":{"text":"navel oj ... was amazing \nbiscuit was devine \neggs were superb \npotatoes were cool .. i lo","useful":0,"cool":0},"y38FLKHdNt59ZavzjSg_Cg":{"text":"Had pistachio blueberry pancakes with black bean veggie sausage patty. Amazing brunch. Aty","useful":0,"cool":0},"PWCWM0L29OtxU1MlGuD6Zg":{"text":"It was pretty crowded when I got here, I got seated within 5-10 minutes. The food was amaz","useful":0,"cool":0},"DEZUqWZkiTSEOJgL6Cptig":{"text":"This place is so delicious! I'm a huge fan of their bad cat and good cat menu. Many option","useful":4,"cool":3},"LPTLhJTX11F-hGckbRBPdg":{"text":"I got caught up in the hype of hearing everyone talk about this place so I figured I had t","useful":2,"cool":0},"UjB2-H4DigPd3ReCvl69Pw":{"text":"This will definitely become my go-to Eatery when returning to New Orleans! We waited for a","useful":0,"cool":0},"veApZi2DKXUFsRdWc188PA":{"text":"The Bearcat is one of my favorite spots for a weekend brunch. The food is generally good, ","useful":0,"cool":0},"_0SZi-gBwDAdh04hpQp09g":{"text":"I had about a twenty minute wait but it was totally worth it. I started out by ordering co","useful":14,"cool":13},"uHpXQlNsPSs5LLurjpZsrg":{"text":"Oh if I can marry this place, I would. You cannot go wrong with Bearcat, I repeat, you can","useful":0,"cool":0},"9TF2DxzcZ7EARKg5fOW58g":{"text":"Just had a wonderful lunch date here. It's such a great place to go when you have a carniv","useful":1,"cool":2},"acOzi2NgDEMw_Cc6WX7GMQ":{"text":"Best brunch place. Eggs are amazing. Only downside is there's always a wait but it's just ","useful":0,"cool":0},"Nonwd-q8r9EhU0JpJRH5Fw":{"text":"Been to a couple vegan spots in NOLA before here and so far Bearcat is by far the best. Th","useful":0,"cool":0},"vVaDSLnESIUJHPF7k8WCng":{"text":"Delicious food & awesome service. I also loved how they had some healthier options; plus, ","useful":0,"cool":0},"oQ4LP1qE5_XbxwYCr0XUvQ":{"text":"Cute ambiance for brunch. Their was a wait when we arrived at 11am, but you were welcome t","useful":0,"cool":0},"4pX1jiK3UxT5HDhZsOQIuw":{"text":"Phenomenal food.  Nice little place just off the Freret strip... casual and comfortable.  ","useful":1,"cool":0},"JPSZJ8omynR9SNTW4dR-wg":{"text":"This was one of my better breakfast experiences. I enjoyed the atmosphere and the food was","useful":0,"cool":0},"eCt7YL0wyP7i5nZEqiOKsg":{"text":"I had a phenomenal experience at Bearcat. First and foremost, the vegan and gluten free op","useful":2,"cool":2},"MB7UQxFFV_GF3-e_V8aqfA":{"text":"Updated review!\n\nCame back with a friend and ordered the exact same thing as before (vegan","useful":4,"cool":2},"6bpExjtzIbo9dfAg0QvSyw":{"text":"You have a choice between healthy and vegan or regular with meat dishes. Love almost every","useful":0,"cool":0},"EKBZaFPAimFmbYk5li0wtQ":{"text":"This place is a gem. I got the shrimp and grits as a recommendation from my waiter and des","useful":1,"cool":1},"8Mwk7V9oaEtwxBRN_3XY-A":{"text":"The food was sooooo good! Everything was quality and they offered healthier options if you","useful":0,"cool":0},"BPQQpiw8YiqXBEMUgB6n7Q":{"text":"Delicious and great service! Bloody mary will knock your socks off! Wait wasnt long at all","useful":0,"cool":0},"cc2I2BaItzAi2q9rC59-lw":{"text":"I was very surprised how the food was at Bearcat. Me and my friend heard raving reviews in","useful":0,"cool":0},"z4LfSYrcN4PFKqjcwTCX3g":{"text":"Cool place. Usually a long line to get in but the food is worth it. They have some creativ","useful":0,"cool":1},"ZLeaKkdtR7qht0MwLs0TmA":{"text":"This was such a great find in Uptown NOLA. The food was great. Everything came to the tabl","useful":1,"cool":0},"vIx5nhVnUAwlUBNVIAqlGA":{"text":"The Lobster Daddy was AMAZING!! The perfect birthday brunch treat. I highly recommend it. ","useful":0,"cool":0},"dqAk1UPqbyO9nEdLV4T-sQ":{"text":"The attitude for sign up for wait was really bad. We decided to skip. I understand that th","useful":0,"cool":0},"DpphAE0YBFK5kd7pLWrLIA":{"text":"This place was wonderful. And the reviews certainly are right - this place is charming, ho","useful":0,"cool":0},"tcl6vupAbDWyuoYK1v2ZqQ":{"text":"At Bearcat Cafe, most of the produce is organic as well as the bison and pork. You'll also","useful":0,"cool":0},"2wvxBfBEIVZze0G4OHj8_Q":{"text":"Came here with cousins and it's a petite little restaurant with flavorful dishes. I ordere","useful":1,"cool":0},"Y1seOD4eu1K0rPjDAV0r5w":{"text":"First time here.. It was a phone order.. 2 breakfasts the bearcat and cat momma\nwith 2 bis","useful":0,"cool":0},"kRjb2DiaGpw12Uxz5DddzA":{"text":"I visited with my husband yesterday. It was his first time and he loved it! He had the Bea","useful":3,"cool":1},"6nXtGogwtB2f92g5kgQuaA":{"text":"Bearcat is one if my favorite brunch places in New Orleans! I go to school nearby and I st","useful":1,"cool":0},"3RB_BsbdvKEQ9Ezf4mjM9w":{"text":"I've been here a few more times since my initial review and I'm ready to bump it to four s","useful":0,"cool":0},"-XIgUm264cPRRKpHCDTGxQ":{"text":"My absolute favorite breakfast spot now! I went a month ago and have gone back almost ever","useful":2,"cool":2},"1zwUzjIjurDMPirg8wm8bg":{"text":"We came in right as Bearcat was closing and they graciously took us in!\n\nOur waitress, Asi","useful":0,"cool":0},"Mx_Xz9pEFF03c4HZHwLxog":{"text":"Where to begin...we had an hour long wait in the pouring rain, so we huddled under their s","useful":0,"cool":0},"uvQrkSh9jzgrxa-_bdu-sA":{"text":"So my boyfriend and I stumbled across this place on our last day visiting Nola. I really w","useful":1,"cool":0},"SqvT4Zmyin-wCB6xQD6IeQ":{"text":"My favorite brunch place in the city! I haven't had one bad thing on the menu. There's veg","useful":0,"cool":0},"uwbNHTjV6op33ozNZPsEoA":{"text":"Food is always amazing and the drinks are worth the trip in it self! So if you haven't gon","useful":0,"cool":0},"mP7AMGkkPKgsHokvwoSLNQ":{"text":"Great food! One of the best chia seed pudding, not too sweet, flavored with coconut and co","useful":0,"cool":0},"C1-bHMZPOK9RqR7Y-RaFkA":{"text":"Dude, this place is phenomenal. You HAVE to try the Cat Daddy. \n\nThe environment, staff, a","useful":0,"cool":0},"n6zMjqUlj9Eg_BPO9dwMBw":{"text":"Outstanding breakfast food and fresh OJ! All three of the biscuit sandwiches that I've tri","useful":1,"cool":0},"_TklRYCxW83PpA8NFQ0_kA":{"text":"Had the cat daddy and it was so tasty! Very filling. Also ordered the almond milk chai! Ho","useful":0,"cool":1},"VH2yxEuPboi_bZrTq6kOLw":{"text":"Definitely get the starter biscuits with jam. Delicious! Possibly the best biscuits I've e","useful":0,"cool":0},"P70fLtVwI6i6WO2rcrkMxA":{"text":"Incredible menu flawless execution food was amazing, staff was kind and 10/10. Would absol","useful":0,"cool":0},"SmCV7BCGlJTZlew2eK_TbA":{"text":"This place is awesome! I had the Shrimp and grits. So good! The brisket hash was great as ","useful":0,"cool":0},"-RB-kjl704-90eU5f7zcqA":{"text":"yummy food! cute atmosphere, i love the pre-bottled drinks. pancakes are amazing! saw some","useful":0,"cool":0},"f0fCVJhq4gSmejurle4EYQ":{"text":"Wow, just wow. Service and food here are exceptional. I love that the menu is split betwee","useful":3,"cool":0},"Fnv51jEq5UJswEAHf2n1ag":{"text":"Phenomenal food. Atomosphere is open and chill, lots of plants which means lots of flies. ","useful":4,"cool":0},"ttg2IQlglibqUy7ZtqkTIA":{"text":"The food was unique and pretty good too. I would definitely say, try this place and the fo","useful":1,"cool":0},"jNAR0FJxPhZ-i5KbxoGkEg":{"text":"We came on a busy Sunday afternoon and was seated promptly. The place was extremely packed","useful":3,"cool":1},"tTIauu5XUFd2TzK0fYnWkA":{"text":"They answered the phone on the 3rd try.  I asked if they were open and they said they migh","useful":1,"cool":1},"h_NI4Zq4S6PhV30RvJsllQ":{"text":"I had The bearcat breakfast with bison sausage and Pancakes everything was delicious only ","useful":1,"cool":0},"qfKgslKTPV9BzuV-rE_TpA":{"text":"I must start by saying Bearcat did not not disappoint! The service was superb and I am loo","useful":2,"cool":2},"W47H-jYPajVROh4KpaCh3Q":{"text":"I must say I definitely underestimated this place! This wasn't on any must see in NOLA any","useful":0,"cool":0},"ptPeK2wbe49tLyB2Ah9-Xg":{"text":"Good cat, bad cat, which one are you? \n\nYou new restaurants really know how to woo me with","useful":36,"cool":19},"1WmnNa3o6vKHQ5p8Y3QL9Q":{"text":"Love this place! For anyone with gluten allergies or other dietary restrictions/preference","useful":0,"cool":1},"WifEmWaE9OrIAl_nghcs7g":{"text":"Boyfriend and I walked here for breakfast on a Friday morning. It sits quaintly in a cool ","useful":1,"cool":1},"aREPaTObWoRjQXXHq4M9tw":{"text":"Have eaten here twice and everything we had was exceptional. We have tried both vegan and ","useful":0,"cool":0},"HxzH6kzqkrtYoQPnQ7WEAA":{"text":"Bearcat was an amazing introduction to New Orleans. Two friends and I had just arrived the","useful":2,"cool":2},"JyxErvaACwFPfpohvChFTw":{"text":"the food is great. that's undeniable. i had the shrimp and grits and it was divine. it was","useful":2,"cool":2},"fCcScqGvz4b7JeX54aGHTg":{"text":"Best brunch I've ever had The wait was kinda long but it was totally worth it. 10/10 would","useful":0,"cool":0},"xEliUM3G-NsfZzNUGNBZKg":{"text":"This restaurant came highly recommended. We tried this place on a third morning about 10am","useful":1,"cool":0},"gAqnVd39D_mi9N7gkHYYzg":{"text":"Have had this place on my list for a while and I'm happy to report they did not disappoint","useful":1,"cool":0},"hReXBXqQMxmVRCSTqgm24Q":{"text":"De florida estamos de visita en sitio para prestar ayuda x huracan y en este lugar nos han","useful":0,"cool":0},"_UIgDBdF0HfWbO2TvAONPw":{"text":"Lovely menu! Will be coming back here. They have tons of fresh made drinks, the lemonade i","useful":0,"cool":0},"P50RAoMwQ_hDx2tXVVoJTA":{"text":"Somehow, my breakfast here was the most memorable and delicious meal I've had in Nola afte","useful":0,"cool":0},"zp58pCu-LhBl5ay_gUmkmw":{"text":"Great Host!!! Great food!!! Worth the wait!!! We started off with vegan cheese dip, spinac","useful":0,"cool":0},"D1_H-k0byNNHfUxgDwTQOQ":{"text":"Very cute, modern style. Loved the vegan options, with large portions. Definitely worth yo","useful":0,"cool":0},"Dp2qjYXTpH2-Ha_5HWAHLQ":{"text":"Omg! Best breakfast. Love their vegan gravy strong coffee. Can't miss with this place","useful":0,"cool":0},"k_Qb8J0N23DOJNIECr9ndQ":{"text":"Loved this place. Service great, food great! Great for brunch! The location was easy for m","useful":0,"cool":0},"9r5iHdAbHpwh-IHC9RmBXw":{"text":"pretty typically lil hipster brunch joint.  everything is cute there. the decor is an asso","useful":0,"cool":1},"wmPZtXI-sd9YEBzKcKvAcg":{"text":"Holy moly give this place 6-*\nI wish I lived in NOLA so I can visit this cute little bearc","useful":3,"cool":3},"lo33ftrOUHICQfDYCQ0AlA":{"text":"The. Breakfast. Club. Will. Bring you to tears. I love this place. The fruit with the crem","useful":0,"cool":0},"8OXH-mpXqRXueANIIqhhNA":{"text":"Safe , clean , and delicious. I do not regret any part of going out during covid and enjoy","useful":0,"cool":0},"4PLEMpjwuBm7ZffbUu2Tmw":{"text":"WORTH THE WAIT!\n\nCame here on Saturday 4/24  and waited for a good hour! We got quoted tha","useful":1,"cool":0},"rwXId-mQ7_0Tn4KO2XOrLA":{"text":"Food is excellent! Have been there multiple times for brunch and have enjoyed every dish. ","useful":0,"cool":0},"lujtCGANFTjI-XYlmuh3CA":{"text":"The best in town. \nIn my opinion, great blend of southern + New Orleans. Breakfast, brunch","useful":0,"cool":0},"sgy4IKsbPrjkxU8YjlTNuQ":{"text":"Anyone who knows me well knows I love pancakes! Bearcat has some pretty awesome pancakes! ","useful":19,"cool":18},"t2cEZzMaHZFqHvFREsgdUw":{"text":"So good. Went for brunch and everything was great. The Lavender Honey Latte is the best. W","useful":0,"cool":0},"u7DjdGZ85whMHgJRXrfz5g":{"text":"This is such a wonderful kitschy brunch spot. There's always a long queue on Sunday's, but","useful":0,"cool":0},"1RLFAK1DdemWMawgnaOWOQ":{"text":"When Bearcat opened, the vegan angels sang because finally, there's a second (Surrey's wou","useful":15,"cool":13},"x9XRR_bcXa2wVF0lkXCkGA":{"text":"Great atmosphere! Excellent food and service! Expect a short wait and a packed house durin","useful":0,"cool":0},"C8Q8dG1YA9mQMYpKi7J71A":{"text":"Damn this place was delicious. Like wow. Beautiful chilly day to sit on their outside pati","useful":4,"cool":4},"WQZ2Dul6_YUb4gG1ACxnjg":{"text":"Horrible food. Don't fall for the reviews. The quesadilla with egg was ok but not worth it","useful":0,"cool":0},"vt3S9vDQIns92nloALttLQ":{"text":"This place was amazing. I had the Lobster Daddy. Two fried lobster tails on a biscuit, smo","useful":0,"cool":0},"p3Wt_mL9h6_WnkA43iVNWw":{"text":"If you are looking for a phenomenal breakfast with healthy and non healthy eaters... this ","useful":0,"cool":0},"xrQkJZo9oJjR25_EDhiRPA":{"text":"The food and service was great! Visited 2 days in a row. The natural juices were also very","useful":0,"cool":0},"46dgxxSQxnJwjIctntchAw":{"text":"Seriously amazing food.. Had something with fried green tomatoes, a poached egg and crab m","useful":0,"cool":0},"NfTCvUlfcieqzSbtFbJymg":{"text":"Where to start??? Potatoes!! Their potatoes are worth a visit in and of themselves. Their ","useful":3,"cool":0},"8-gwsuJ1naknPhruuXlglQ":{"text":"I wanted to absolutely love Bearcat- I really did. But maybe I went in with too high of ex","useful":0,"cool":0},"-rupoVT_xlEe4kmpMxnaZQ":{"text":"First time here and we'll definitely be back! We sat at the bar and just watching the kitc","useful":0,"cool":0},"pVOWIGItVim9T4TjXjiphg":{"text":"Bear Cat Café is an excellent little place who has given breakfast new meaning for me. The","useful":0,"cool":0},"1Djx1k6hxEeKf4rl8_oCNw":{"text":"Been wanting to go here for quite some time now, we finally made it!  There was a wait, bu","useful":4,"cool":4},"-RGhNQp3208wjIo1Otcj1Q":{"text":"* new favorite for brunch!!! *\n\nI went to bearcat for the first time today with some frien","useful":1,"cool":0},"ij1SPeIn5gOsqa5pQatakg":{"text":"felt super safe with covid precautions in place. masks were required unless eating or drin","useful":0,"cool":0},"IjqwegSWJFJI3aajZd4pFA":{"text":"The potatoes are really good. The egg & cheese biscuit with hot chicken is not something I","useful":0,"cool":0},"IXleuBmOXjCOWMrQ_kVpTA":{"text":"My favorite place to get brunch right now! This place fills up quick! I always have to wai","useful":3,"cool":2},"dz_IJ_2z_CSUiL1MVG4Hkg":{"text":"I wish I could give them 10 stars!! I've brunched here many times and every time the food ","useful":1,"cool":0},"tJe0y6rOybDQ3mp02Nv4vA":{"text":"This food was amazing! For the past few months I have become Pescatarian, but I like to vi","useful":1,"cool":0},"vrTsICUw9Hknf02gKKcaWg":{"text":"Everything I ordered was delicious. The service was prompt and attentive. Ordered the soft","useful":0,"cool":0},"K5VjomzG1Qc_ExorL1kTsw":{"text":"WORTH THE WAIT!\n\nThe Cat Daddy is absolutely phenomenal. I've been thinking about it every","useful":0,"cool":0},"__DnRq8PpmNH-E11Uacnig":{"text":"I really wish this place was not so busy. I would go so much more often it wasn't such a l","useful":0,"cool":0},"44PVAuCfxR09fW8oOFan-A":{"text":"The food was very mediocre. Personally, I thought the food was pretty bland. I heard a lot","useful":0,"cool":0},"YyiFH_CdHg2Em48_FT9TkQ":{"text":"Worth the wait. We heard this was a great place for brunch and waited nearly an hour to be","useful":0,"cool":0},"KAZw4PL1iTWirKFMSAiQsQ":{"text":"This is a very good spot to go to if  you're vegan and you need that vegan option. The foo","useful":0,"cool":0},"Y7zv3wrdhcN8ZgnT-2p2bQ":{"text":"I'm don't want to say anything nice about this place so I don't have to fight y'all for a ","useful":0,"cool":0},"wfgL15-xCDBYf4-W0i61Pg":{"text":"My faves were the Banana Pancakes!  The Bison Sausage had a heavy, rich flavor too!  Highl","useful":0,"cool":0},"u2AB-5XTYonQPpZkJIsoLQ":{"text":"It was a very busy day (our wait was over an hour), but the service and food still managed","useful":1,"cool":1},"IyYXdtCo3U1b8XOQuS967g":{"text":"I never write Yelp reviews (this is my first one) but this place is so awesome I had to le","useful":0,"cool":0},"iGGT8pm8Jz5MW9G7Jwmdfg":{"text":"I have never been disappointed by their food. I have been disappointed by the line, portio","useful":0,"cool":0},"8Alhep0z3gdrcyL7qW5teA":{"text":"Wow\nWow\nWow\nThis place was 10000000 stars, thank you Yelp for bringing me to the neighborh","useful":0,"cool":1},"q3adDW0zBnKqT2-f5h2UVA":{"text":"Visited this Cafe for brunch today. I love the balanced options of vegan and regular on th","useful":0,"cool":1},"NS2K4hUdEjMgZ8ZUNtylYQ":{"text":"Very good service! Don't be afraid to order the pork chop!!! It was so juicy even after ta","useful":0,"cool":0},"r_fcaP2Z6lufAnrKWIagpQ":{"text":"I've been here twice now, and it truly is a wonderful place for a (boozefree) breakfast. B","useful":5,"cool":2},"JWq8IYmZ_QH6c_2jsKjL0g":{"text":"Yummy!!! This place was delightful. The pepper jelly with the biscuits was a culinary expe","useful":0,"cool":1},"jDTFyyLpaf9kkKEGBLTsiQ":{"text":"Location; New Orlean trips and was guided to Bearcat, it's small inside and expect a wait ","useful":2,"cool":2},"C3S2kC6SzNyJQUl69LjNvw":{"text":"This a pretty neat place in New Orleans. It's a hipster type restaurant, that has breakfas","useful":3,"cool":2},"ZtxOq0Yn6C7Pz9F7CD1Ycw":{"text":"06/20/2020: Thanks god Bearcat is open back up. The food never disappoints. Their quesadil","useful":0,"cool":0},"mz3F5oqM26O3U3ehkEsXKQ":{"text":"I'm from Houston Tx, first time here and what can I say the food is DELICIOUS the pancakes","useful":0,"cool":0},"Fks8uNrmnApnoNaXmT2e9A":{"text":"Mandatory to start my day here when I'm in town. Best Breakfast in New Orleans and the Pot","useful":1,"cool":1},"bNbIiKsdi7Mb3srmpR7Ilg":{"text":"I'm not a vegan but they had great food no matter what! They have a great atmosphere, grea","useful":0,"cool":0},"OMtf4rtqju2zmAeS8kHz1w":{"text":"Food is good! Staff is really friendly and forthcoming. They are extremely popular during ","useful":0,"cool":0},"dq9cT15sfEsc5gfblb7lMw":{"text":"The food and experience was so good here that I returned with a friend who hadn't tried it","useful":0,"cool":0},"qhpeV-4vI4FCnPi9HjxRtQ":{"text":"Had pistachio blueberry pancakes with black bean veggie sausage patty. Amazing brunch. Aty","useful":0,"cool":0},"xJoj4W7KseloKkJrIsU9sQ":{"text":"Best breakfast in the neighborhood. The breakfast club is delicious and not too heavy. Lov","useful":0,"cool":0},"8aYqa-bJ_uIehKToseLQyQ":{"text":"Love coming to beer cat it's always great service and great food never a hit or miss! Ever","useful":0,"cool":0},"GHWBefikv1dddzGtGoDJKw":{"text":"Maybe this morning was off, when I arrived to eat the hostess, after expressing concerning","useful":0,"cool":0},"5QR2FbW7dpwW0P8oWFSrHg":{"text":"The staff was great entertaining attentive and knew there menu and products well. The food","useful":0,"cool":0},"60WXzyjD2NNtWGqeerhXzQ":{"text":"Bearcat was amazing! We came on a Saturday around 2 and there wasn't a line. There are a l","useful":1,"cool":0},"qziaDahIvhqHR9sMatcUVQ":{"text":"We stopped by for Saturday brunch and this place is busy so you have to queue up for sitti","useful":0,"cool":1},"Ty_yxb7iS--y044Yle8ukg":{"text":"Bearcat has fabulous food and coffee. An incredible spot for a brunch or lunch. No alcohol","useful":0,"cool":0},"LLDwyhOLwtJ_v2zYredycQ":{"text":"Amazing food!!! Very very friendly staff. So far the best food I've had in New Orleans","useful":0,"cool":1},"4fY0xpHncnf7edtY9vpMzQ":{"text":"One of the best breakfast options in New Orleans. Food is prepared fresh to order. Butterm","useful":0,"cool":0},"SbAdMIzV8zn6m6vztzVjzQ":{"text":"I really love this spot. There's many vegan options. The charcoal lemonade is delicious. I","useful":1,"cool":0},"RlugoGF_ocYJgatBo-5ksw":{"text":"I stopped to eat here with family and friends on a recommendation while in Nola and had on","useful":0,"cool":0},"RnT29KORzkcX4X00-mQYdQ":{"text":"Really interesting choice of both healthy and not so healthy breakfast and lunch options. ","useful":0,"cool":0},"yOZDruyUkPfS1NrHK806tA":{"text":"This restaurant is amazing, from the staff down to the food. Server, cook and owner are al","useful":1,"cool":1},"ifGXgb9zMmSbwpz65VLVAg":{"text":"BEWARE!!! This place is sneaky. They automatically charge gratuity on take out orders PLUS","useful":0,"cool":0},"McsWwbdMyc0ePJMtBFyHfg":{"text":"Love this place. Great location, excellent variety of brunch options. Staff is wonderful a","useful":0,"cool":0},"vqpvbh1HFhKERGytVWTsQg":{"text":"Hands down, my favorite brunch spot in New Orleans! I can't believe I haven't wrote about ","useful":2,"cool":0},"nh6jxXenOQRxQJRx8wfmMw":{"text":"In New Orleans for the weekend and a friend recommended eating here. It was one of the bes","useful":0,"cool":0},"_Fv0Vam6sZ9dZgWkMnnCvg":{"text":"I enjoyed my breakfast at Bearcat, with the exception of one item. My husband got a chai l","useful":3,"cool":3},"EOmlDvB5BX8ENSPrujg66Q":{"text":"WORTH THE HYPE! So,so, sooo good. Been here a few times before I decided to write a review","useful":1,"cool":1},"qRVQ8rnitio9AnCZ0JiubQ":{"text":"Great food and service. Pickup was ready very quickly. Got the Cat Daddy, It was amazing.","useful":0,"cool":0},"MQ-6fV69AF9i4bETPsL5NA":{"text":"Ok so my friends wanted to go and I was very unsure when looking at the menu. I was alread","useful":0,"cool":0},"g8hwPkbjo2i5qi903bM_7g":{"text":"We ordered the chia seed pudding, banana foster pancake and hot chicken. The chia seed pud","useful":2,"cool":1},"J42Gsh7feqSenCsFf91SzA":{"text":"Highly recommend their vegan quesadilla. It's one of the best quesadillas I've ever had. N","useful":0,"cool":0},"ITowv7ACND7fBpSC3WYQnA":{"text":"I went down to NOLA not knowing what options I would have to eat since I'm vegan. But I fo","useful":1,"cool":1},"sYwtAFZ_Y1p5E-U6p4361Q":{"text":"Wait can be long, but it's always worth it! Coffee is excellent and there are plenty of op","useful":0,"cool":0},"CQAwvwa-uIePYkrtZAgogw":{"text":"Pro Bearcat:\n--you can order a coffee while you wait for your table\n--you can watch neighb","useful":6,"cool":3},"BXeEfoMPWoloVMT7brnrUA":{"text":"Exceptionally fresh and creative menu if vegan breakfasts and brunches.  Similarly good te","useful":3,"cool":2},"W3vldAkLycK38ip4G8Sslg":{"text":"After a very long wait and many months wanting to eat here, the wait is worth. Very friend","useful":0,"cool":0},"3K1dFu6lJ64nwbkbtk93MQ":{"text":"Definitely a go to on Saturday mornings. The specials are great. The Hot Rob is my persona","useful":0,"cool":0},"G97JBxmnJGNBK0isFAuW5Q":{"text":"ONE OF THE BETTER NEWBIES\nThe majority of new restaurants I've tried the first half of 201","useful":8,"cool":5},"sdMs9SQXUPWSkkEIOXBVXA":{"text":"Seriously loved this restaurant in New Orleans. \n\nWe were looking for a place to eat break","useful":0,"cool":0},"XOAAyoQJ_I90BGYwXsgNdA":{"text":"The food was great and the service was too, I've eaten here twice and ordered shrimp and g","useful":0,"cool":0},"ljFE4Fg2t1LZPdFPzwLDgg":{"text":"I've been to bearcat a few times and I must say their breakfast is bomb. The chia seed pud","useful":1,"cool":1},"xDeczzLcO1E09BrMQFmISg":{"text":"I'm in love with Bearcat. It's in the heart of the hippy area of Freret street. Home of so","useful":0,"cool":0},"22aYIJq9IWLAsTvB0YGjrw":{"text":"Bearcat is one of the best brunch places in the city. There is certainly a reason why ther","useful":0,"cool":0},"oroyq7ir_dDGIXiZVcJp7Q":{"text":"Had a great brunch experience at Bearcat Cafe! The cafe is really nicely decorated and our","useful":1,"cool":0},"-hNRMt3h7pponCB0j63juA":{"text":"This is one of the best brunch places in town. Highly recommend the biscuits and the Cat D","useful":0,"cool":0},"JHb9B-EPIShUrEtDvQtLHw":{"text":"It was my first time.. I ordered off the good cat side. It was delicious. The cashew queso","useful":3,"cool":1},"NW0BAyoySzFb_KMTrXWsFA":{"text":"Didn't even go in to get put on the waitlist because the receptionist was so rude refusing","useful":0,"cool":0},"3pgDoJ3tBE-nDzj7mH6rWQ":{"text":"I've been hearing raving reviews about this spot, so I finally got around to going. Let me","useful":0,"cool":0},"Y6_Cqy4ouHxFTHonTYAX-Q":{"text":"Went for breakfast at 11 am on a Tuesday and waited an hour to be seated. In fairness, we ","useful":0,"cool":0},"tJCty2puOKHYcdzlQfXz9w":{"text":"Found this place off the beaten path towards the university. Must say, a MASSIVE hit all a","useful":2,"cool":2},"-iU4pTawaY18S1mXznncxw":{"text":"Always great for brunch!!! My must go to spot with my family. Cat daddy, blueberry pancake","useful":1,"cool":3},"KJZRUkZZ1ptwipi0sm4KIA":{"text":"My waiter Trey was VERY nice & also a big help while ordering. The food came out quick and","useful":0,"cool":0},"ECAe9XZTLfjqP7aYepFjlA":{"text":"I've ordered the quesadillas a few times during quarantine and they're so delicious! Love ","useful":0,"cool":0},"RoDrUlVkQjU-xX0hmrmeiA":{"text":"Nice little spot for a good breakfast with a bit of a trendy, hipster vibe. We don't scope","useful":0,"cool":0},"UNKtgbz9P1S_fVzZw3dktw":{"text":"This fricken place is OUT OF THE WORLD! I know it looks like Heinz mustard but lemme tell ","useful":0,"cool":0},"Lo1V9qGslP7SGbC8Bn3RMw":{"text":"Having heard about the hype - I came here on Friday and there was still a wait but it was ","useful":1,"cool":0},"zwI1bKRhkhLzu7d_FxNE2A":{"text":"If you read my first review, you'll see that I wasn't Bearcat's biggest fan the first time","useful":4,"cool":3},"Xbolv9uaSJjaz1J_8mFcqg":{"text":"Bearcat Café is a newer restaurant to New Orleans opening back in 2017 and in 2019 they op","useful":5,"cool":4},"oYc1AQYdAVHws_fY-ugvtw":{"text":"My husband and I have been cutting sugar and carbs from our diet and were super excited to","useful":2,"cool":0},"EZ-egy04f7EoVWFhlVNGow":{"text":"This is a great spot for breakfast or lunch. I love that there are good cat and bad cat op","useful":1,"cool":0},"2XCAlMq6Nag1p0tqN53wnQ":{"text":"Expensive, but great food. You can get comfort food that you don't feel so bad about after","useful":0,"cool":0},"GGjtLfEroVaVMFsRQ2Euuw":{"text":"Came by Bearcat yesterday morning for some breakfast and was not disappointed!! Got eggs o","useful":12,"cool":6},"xve6BsLV0sD0NlXCQBs69A":{"text":"Consistently excellent quality food, friendly staff, and great coffee. As a breakfast conn","useful":1,"cool":0},"HLODjrJzFOvOQl5RcO1FcQ":{"text":"OK this was a really good restaurant in New Orleans. They had lots of options, vegan and v","useful":0,"cool":0},"_QFt9csbsOL-bnj3LmSDgA":{"text":"I dined here twice during my week in New Orleans and honestly, I would have been A-OK to d","useful":2,"cool":3},"t8TgLBFFrS2Cw8ywkrrwbQ":{"text":"PERFECTION! The staff is amazing, always friendly and attentive, and the good is to die fo","useful":0,"cool":0},"VwHdGB-5oEC4B5AjndINog":{"text":"Thought I wrote this long ago.. \n\nAs a local, many places can turn into tourist food traps","useful":2,"cool":0},"D3739ui6ojj4oa2VgmcYEg":{"text":"The limited hours of this place bites but only because the food is SO GOOD. So many great ","useful":0,"cool":0},"mPMOV5i6OWDZ_5kolK8XLg":{"text":"We order breakfast club, bearcat breakfast and Biscuits. The food was very good but the co","useful":0,"cool":0},"LPFFrmbLhc0_9DhJWxJklQ":{"text":"Definitely best new breakfast spot in New Orleans   Don't miss the bison sausage and crisp","useful":1,"cool":1},"2-7sJgxIWnx7aRZ39E4FeQ":{"text":"I've lived within walking distance of Bearcat for years, but I've never eaten here because","useful":0,"cool":0},"_MSfCnvx9UtnRbgkztY6xA":{"text":"Hands down the best breakfast place I've ever known and a frequented spot for sure. We go ","useful":2,"cool":2},"SqI3N-znokiF6giASJwo2w":{"text":"Good food. Exceptional service. Nice outdoor area. Probably not the number one breakfast i","useful":0,"cool":0},"C32EyewK7NkYz4rC6s-iWQ":{"text":"My bf and I went today. Food was great! But never sit at the bar area. It's a turn off whe","useful":0,"cool":0},"jgK0ExrvUpFg-nuXLbPUPg":{"text":"I'm not a vegan but they had great food no matter what! They have a great atmosphere, grea","useful":0,"cool":0},"uWfpeeBvTFsQ-ORywJj22A":{"text":"My favorite place for a casual brunch. The pancakes are legit the best, the biscuits top t","useful":0,"cool":0},"Ek8vSlTb8QOV4s_-8AUgPw":{"text":"This place was amazing. Found on yelp and was unsure but their fried chicken was out of th","useful":0,"cool":0},"Di9M8D3IlFyXpPl_UcSK4Q":{"text":"My absolute FAVORITE brunch spot in nola. It's always busy when I come but it's worth the ","useful":0,"cool":0},"gPRBHC8LT_Y3byF6gY96Rg":{"text":"I come here when I can for brunch on my weekends. A recent transplant in the city, I find ","useful":0,"cool":0},"ApEsvfHIqOc9cUk0UaYTgw":{"text":"The good was so delicious!! The crispy potatoes and grits are a must! I'm rating this plac","useful":1,"cool":0},"fwDDpuXFkdSfvcqFhGtMJg":{"text":"Went for breakfast on a Saturday morning and waited about 30 minutes - so don't expect to ","useful":4,"cool":1},"Xb85bWe4tpkCUqwr2u37ow":{"text":"Quality breakfast - probably nola's best. Great variety. Lots of healthy and veg choices. ","useful":0,"cool":0},"lZ40gmqIVfHN9iTYyEHwVw":{"text":"The food is SOOOO good! Great variety of menu options. My only recommendation is that they","useful":0,"cool":0},"CZw3-aAZZOvn448AyqhI7Q":{"text":"This place is SO DOPE. The ambiance is great, the staff was super friendly, and the chef w","useful":0,"cool":0},"x-bYywGjlhyfycbzE9MhWA":{"text":"So it was a blue moon and my girlfriend decided to finally treat me out for brunch! This a","useful":13,"cool":9},"0Wnzs_RgxkkXYc9cSWyMBQ":{"text":"The service you receive upon walking in is superior! It makes the long wait extremely wort","useful":0,"cool":0},"L1cceX3nN9BovlW96leQzA":{"text":"Bearcat Cafe! This place is just simply awesome! When I first saw my friends post pictures","useful":19,"cool":11},"9E2WYc8Pi6jTNhuf6c0DMw":{"text":"This cafe is so cool-they have options for both vegans/healthier eaters and some heavier f","useful":1,"cool":0},"jSp3FAb4L-Ek8DAEm2gAiQ":{"text":"Very unpleasant experience today! I ordered crab daddy, the crab tasted weird from the fir","useful":1,"cool":0},"VxQuPCLzoaJy1au8bx7TYQ":{"text":"Me and my friends were visiting for the weekend and wanted a brunch place close to where w","useful":2,"cool":1},"XC9OhsUK6MiAlBKLvbvZiw":{"text":"The food here was so delicious. I ordered the shrimp and grits and when I tell you the gri","useful":1,"cool":1},"RjfQHa0ZTyjL0lgIzrsLew":{"text":"The great... the food. There is really something for everyone on the menu, vegans, keto, n","useful":7,"cool":5},"JInxmanikBNsAlcdwKnAng":{"text":"My first meal EVER in New Orleans and it did not disappoint. The staff at the door is very","useful":3,"cool":1},"80x2CLJ3Tcj5LQv311s-bA":{"text":"This place is just fantastic. On our last day of a quick trip to New Orleans, we managed t","useful":0,"cool":0},"Euhxm5a5tdXaMWtfnl9-Jg":{"text":"Trai was awesome and took such good care of us! He was attentive and made sure we were tak","useful":2,"cool":1},"vpNPpma3UHQkpf65OPSrng":{"text":"Trai took care of us and is an awesome server. The 5 things we ordered along with the 'on ","useful":0,"cool":0},"oTaocKn-poOTyxOhhv4olg":{"text":"How in the heck have I not reviewed Bearcat??! This place is thee bomb.com I used them to ","useful":0,"cool":0},"7uEf_bExK-QzNPT9ug_3yg":{"text":"Wasn't impressed with this place, it was my first time eating here the staff was particula","useful":0,"cool":0},"FCVEefJjDx8QfhQcISgNUg":{"text":"The appetizer breakfast potatoes are one of the best things I ate this year! The potatoes ","useful":0,"cool":0},"_QbKVehaqCwS5FMlX-Uf9A":{"text":"Bearcat Cafe is a must for every time I visit NOLA. Their brunch menu is so unique and del","useful":0,"cool":0},"ksh3b7t_eHR2LZpRCQH5Bw":{"text":"Writing this review a few months after our visit, but I still remember that breakfast vivi","useful":1,"cool":1},"lU6SXeT5Z2YokI45w6okzQ":{"text":"Stopped in New Orleans for the night and had to try Bearcat for brunch. We sat outside whi","useful":0,"cool":0},"s01XxE7uzEibfpIcKLxvjA":{"text":"A place that is worth all the hype!! Have never been disappointed after a meal at Bearcat.","useful":1,"cool":1},"YdszLNekgOLGW9aupCY56g":{"text":"Oh, my goodness! Finally got the chance to go here without the long line and was not disap","useful":2,"cool":0},"yDVx60wFok6r7uOr8FPlgw":{"text":"Great breakfast spot! Got here on a Saturday morning around 8:30am, plenty of tables at th","useful":1,"cool":1},"zYRIE9cuzX5ut7MRFvzSjg":{"text":"On our short two day trip to NO, we managed to visit this place twice, it was that good. B","useful":0,"cool":0},"7Svn7pknbizoAdHEdTysfg":{"text":"Definitely try to get on the list early. Due to current times it's hard to get a table but","useful":0,"cool":1},"F38z9FasgZBjnkcLzUBofg":{"text":"I LOVE bearcat!!! Everything I've ever tried from Bearcat has been amazing. As someone wit","useful":0,"cool":1},"Y5_HhFRUfTGdEXNSQ_41_A":{"text":"Wonderful food. The potatoes are absolutely delicious and their juices and teas are so fre","useful":0,"cool":0},"aW9MWTlqjpKFs18jN157Hg":{"text":"When I tell you this brunch spot is delicious!!! Omg make sure you visit while in NOLA! I ","useful":0,"cool":1},"RXm6y50YYhiSni-J6aKlng":{"text":"Food is outstanding and original. With excellent ingredients and flavor choices. Service i","useful":0,"cool":0},"PnRBIBxl242ELEPJn7gz8A":{"text":"Food was amazing ! Trey was our waiter and we're not from town, he gave us plenty of sugge","useful":0,"cool":0},"-RW8qYlCNgQ10nCE4Dp0VQ":{"text":"The food here was okay. The grits while cooked well, had a funny after taste that I couldn","useful":0,"cool":0},"Xd32-wECDh7TdRo5C5Ap3A":{"text":"So on this trip, LRoth had been talking up this place for quite some time. I try to not le","useful":1,"cool":0},"iYi_s6Pvmto6uddBV2mk_Q":{"text":"I came into New Orleans for voodoo vest and was looking for a breakfast place. I am so hap","useful":0,"cool":0},"WM0MpHCU08UHCbzHm3VmQA":{"text":"I rarely give 5 starts.. but everything was great. It started with The hostess, she had a ","useful":1,"cool":1},"Vty-fGXUkPjv1nAuwrueTQ":{"text":"Can't. Put. Into. Words.\n\n\nThis cafe makes freaking delicious food. With both vegan & non ","useful":3,"cool":2},"gEGoyG0ce5sj_skT1DfcGA":{"text":"Will definitely return. Enjoyed heated outdoor seating. Great food. Friendly service. Deli","useful":0,"cool":0},"eM_INNgiKnRZoa77tg1tXg":{"text":"It's a fun and imaginative place to go for breakfast, in particular. My boyfriend is a hug","useful":0,"cool":0},"fhTh_jDXYI1jOpCMVfj-ZQ":{"text":"I'm in love with brunch at Bearcat. The food is SO good, they're great about social distan","useful":0,"cool":0},"0yPGRT6fhQviRHiBp_XNdQ":{"text":"This place is so cute and trendy but delicious. A must try. \n\nOn Jena half a block from Fr","useful":2,"cool":1},"t9mvKXIavkYEjMd6QkQs0A":{"text":"I was impressed by the cat daddy, but was even more wooed by the coffee/drinks. First off,","useful":1,"cool":1},"JsH6m4mjyE8Xw-vTTOAL5g":{"text":"Delicious food with with lots of choices for my picky family (including vegan options). Al","useful":0,"cool":0},"J7IMxri1-CH3CoAgEefnCA":{"text":"Hmmmm, my personal opinion I guess. You can't go wrong when everything is fried and salty,","useful":0,"cool":0},"JEhcLgelHDc66nCGKAIYsw":{"text":"Bearcat is by far my favorite breakfast in the city. The latte's and kombucha are amazing.","useful":0,"cool":0},"pqq9YwYM2O9qsyUEWAOi5w":{"text":"Had the vegan ranchero with tofu (Good Cat) and it was delicious. Great coffee too! Will d","useful":0,"cool":1},"8vJKzlUMOAYGrPNhZQ1gHQ":{"text":"Ate here with my family. My sister loved the coffee so much that she had got one to-go and","useful":0,"cool":0},"MNgIkqkOyc0kDrJ4FNpAvw":{"text":"Yummy yummyy yummy!!!  This place has fantastIc food!  The shrimp and grits were creamy th","useful":0,"cool":0},"EPr84pjvACMuI7OPCRXJeg":{"text":"Hands down my favorite breakfast place in all NOLA. There items are unique. So much so tha","useful":0,"cool":0},"b8LR3smozDQE6LeYC4bKAw":{"text":"One of the best things I've ever eaten hands down. Cute hidden gem in the city with a park","useful":1,"cool":0},"JiU7RRpKH2sJgXyKI16FEg":{"text":"Bearcat is hands down my favorite breakfast and brunch place. It is worth any wait in my m","useful":0,"cool":0},"eq1SlkL_wf19Wqq3fzEpjg":{"text":"It's so good here!  There was a bit of a wait, but they do call you if you're in your car ","useful":0,"cool":0},"uERV-OfmBMrS6AZ_FwDK9A":{"text":"Bearcat is one of the trendiest, most tasty breakfast spots in all of New Orleans. With de","useful":0,"cool":1},"sDgPSydPh8ly6paL0ykLxA":{"text":"The wait to eat here is normally at least 45 minutes so put your name in early! At least y","useful":0,"cool":0},"sA23tjhGlkaDkCtKcWM7qA":{"text":"I honestly can say that there is not one thing on their (vegan) food menu that I don't lik","useful":2,"cool":1},"G20waALPSxwetr6n23HRpg":{"text":"I went by to pickup breakfast to-go one morning. First, I was met with terrible sticker sh","useful":0,"cool":0},"5GmarBGB2n-XwKPKQPV5TA":{"text":"One of my favorite spots in Nola. Best pancakes ever & great coffee. The cat daddy is incr","useful":0,"cool":0},"ObdWBHXybsv3oO-3_VTDVg":{"text":"Tre(y) is probably one of the most rooted and down-to-Earth waiters ever! The food was del","useful":0,"cool":1},"bP1MtnxQwfa9wq-EqnIbWA":{"text":"The food was amazing and there staff very friendly. Worth the money. Def. More fine dining","useful":0,"cool":0},"hlpkn62O8nQlSeHzlIraqA":{"text":"Well worth the wait!!!!!!!! We initially counted this out because of the wait time, but so","useful":0,"cool":0},"8L_rIOOghBbmQMUEwJhjTA":{"text":"I was very surprised how nice the place is, and the food so tasty. It has been one of the ","useful":0,"cool":0},"sNNPIO_yeDJSNwFjAabZzg":{"text":"Listen, I went here not knowing about it being Vegan & GF friendly... the food and service","useful":0,"cool":0},"9mO1Se6nf6rbApeTe3KBGw":{"text":"Run, don't walk here as fast as you can! Amazeballs. \nNot exaggerating, we have heard at l","useful":0,"cool":0},"hwiOjO6wu502_Ya4HNeUBA":{"text":"My Husband and I decided to have an impromptu breakfast date on Tuesday morning since we'r","useful":0,"cool":0},"y-W7pRzLKqEbnWVD_3XYEg":{"text":"We got here for my Birthday treat and everything here made my day. The food is very nice, ","useful":0,"cool":0},"NETSh3xGdk3ak-iuu8j3cA":{"text":"As a longtime vegetarian, Bearcat is one of my absolute favorite places in NOLA. Literally","useful":0,"cool":0},"vuGqodHQJQ-FykOnDL6loA":{"text":"Right off Freret Bearcat Café is a much needed morning addition to those seeking a great b","useful":4,"cool":1},"ETnx8CqpfbcXoiAO92JMpg":{"text":"The best restaurant I ate at, while visiting New Orleans. Everything was fresh, delicious,","useful":0,"cool":0},"mD_TZLZJCIGwKlm7ZdYv3Q":{"text":"The food here was excellent. I ordered the Hot Rod and the corn smalls plate. The Hot Rod ","useful":1,"cool":0},"CEA4VVAx-gb1ueYiml9UYA":{"text":"Bearcat is by far one of my favorite restaurants to go to for breakfast or brunch.  You ab","useful":2,"cool":1},"8MwWShWIXwgy-vi5Vjv2RA":{"text":"Oct2020 update: Bearcat has one of the best online ordering systems I've ever seen. Easy t","useful":0,"cool":0},"SfpOS9taMnwaQRGxqJAP5w":{"text":"bearcat cafe is a place i always wanted to try because they had an interesting concept - t","useful":0,"cool":1},"j-ZZayRCA5dNLHQ0C0wjhg":{"text":"What an amazing restaurant. Everything in their menu was divine. Be prepared to wait! We c","useful":0,"cool":1},"Fg52IDHHNm3jPTOCCMbYIQ":{"text":"I used to think this place was overrated and swarming with Tulane students, but let me tel","useful":1,"cool":2},"4LUkb5h4IFdYzdQcE8dhSQ":{"text":"A little bit of a drive away from the tourist-y spots but well worth it. We'd been indulgi","useful":3,"cool":1},"MB87oNcAcsOJ-5QIhY_gKQ":{"text":"This is my favorite breakfast place in Nola.  That's saying something, because I love brea","useful":1,"cool":1},"cW_L_8tuDUWI5O9vhdey5w":{"text":"I got the roasted almond drip coffee & it was soooo good! It had a hint of roasted almond ","useful":0,"cool":0},"fDkpxfUoXyV73VswcnPIow":{"text":"Food was amazing and the sere ice was great! Had breakfast but will definitely go back fit","useful":1,"cool":0},"B022OEdSHHIaFOR1ahftXw":{"text":"Nice inside out, in the middle of a neighborhood street parking. A nice front porch area s","useful":2,"cool":1},"7M0TehID8yduckxxz472tw":{"text":"I absolutely adore this restaurant! So much that we ate here twice during our visit! The a","useful":1,"cool":1},"Zm0gsA6bSekh8TdHshBw2A":{"text":"Great breakfast with great potatoes and one of the best espresso I've had while visting Ne","useful":0,"cool":0},"st2G3sHmWyv5APLAgQYMkw":{"text":"Excellent. Every morsel was fantastic. Every drop of coffee was perfection. GO HERE!! The ","useful":0,"cool":0},"rbq7C3yFUiQi5A2HUlj3Sg":{"text":"Grits with a mushroom gravy. \nBiscuits and spicy jelly \nBlue crab omelet\n\nEverything was d","useful":0,"cool":0},"5XOdNzEhNUaFQqIQFAtjlg":{"text":"Enjoyed my experience at Bearcat. \n\nOur waiter was great! Customer service was never lacki","useful":0,"cool":0},"PwKpkzP3fablywKb-0a8jw":{"text":"My friend and I stopped at Bearcat last week for brunch on a Saturday around 11 AM. This w","useful":7,"cool":3},"2T7nQtdDspLX88WWwc4iSA":{"text":"Good experience. There was a short wait when we arrived for a party of 2 on the weekend. I","useful":0,"cool":0},"uZuHe8yLenvI8xFGSyCLxw":{"text":"Not all it's hyped to be, perhaps for me. After waiting for an hour outside, our waiter on","useful":0,"cool":0},"nu1TdEysMXKaKcLgCH2BFw":{"text":"Didn't make it inside the business - we waited for the hostesses to take our names for nea","useful":0,"cool":0},"BtU9Azt9V7LWqFZD19eY6A":{"text":"Great food - always consistent, and all around good service! I highly recommend Bearcat to","useful":0,"cool":0},"-gkXSFlk9vzB4jZ8lmh2kg":{"text":"I happen to be at one restaurant and this one came up on Yelp. The next morning we decided","useful":1,"cool":0},"p5ct0JWfbN2QhUJ1ROPhlA":{"text":"Great food and drinks! Had the regular pancakes (wanted to try the chai pancakes but they ","useful":0,"cool":0},"sTPcgDELHnlC8vyqHRcP_Q":{"text":"I've eaten here countless times over the years and honestly, I've had some disappointing e","useful":1,"cool":1},"jnoE1Bvp-b2rSjILCKu3iQ":{"text":"Bearcat is our absolute favorite for breakfast in all of New Orleans. Usually a line on we","useful":1,"cool":0},"pG1Ovg-pfjlxRAUOIFpVVg":{"text":"I just went to Bearcat Cafe for the first time and I will DEFINITELY be going back! They h","useful":4,"cool":2},"q8_a1tLwoN7q78xnxuxOrg":{"text":"Great food and coffee. Love that there are some amazing healthy options along with traditi","useful":0,"cool":0},"j300BJgF1ck7GEgxs9lJpw":{"text":"HOLY BEARCAT!\n\nAre you a good cat or a bad cat? Some days, i'm a bad cat and on other days","useful":1,"cool":2},"iUzn1M7M4uuBQZNcMxw-pQ":{"text":"Oh Yes! I love Bearcat! I have been many many times- hungover and not hungover. Their food","useful":0,"cool":0},"zc-1XF4GpgOH0eKWJ_78mA":{"text":"Bearcat is probably the best breakfast in New Orleans. Almost everyone loves their signatu","useful":0,"cool":0},"dMCIi-oUkeQdSsY8zsuNwQ":{"text":"Great food but waaaaay too long of a wait. Granted we went on New Year's Eve at 12. Howeve","useful":1,"cool":0},"zE_1DOW0wigZCsPMuv3X4A":{"text":"Arrive early and put your name in if you want to eat here on the weekend. That said, I lov","useful":1,"cool":0},"n5XoyXhZBhiwojLne8E3NQ":{"text":"Great spot for brunch! If you get a bottled drink, you can also keep the bottle. The porti","useful":0,"cool":0},"syqkcM2CBFit4PdY2DYGIQ":{"text":"Supa bomb! Awesome crew, nice ambience, & great portion for the price,! \nGet the pork chop","useful":0,"cool":0},"pFVOdarl_SSg_VsjxxoSDQ":{"text":"First I want to thank Daniel for his outstanding customer service. My daughter and I came ","useful":0,"cool":0},"LbiCu0NXOtkvmo0B7UuzpA":{"text":"This was the best breakfast I have ever had in my life! It was Amazing. The atmosphere, th","useful":0,"cool":0},"oV8zWQMC8xyqXFSoP34NqA":{"text":"I usually try to avoid going to breakfast at the same place all the time! But bearcat is a","useful":0,"cool":1},"3Fwy7QBsZ9nqVtk60VnFmw":{"text":"Amazing egg white omelette \nI have been for lunch( bad cat) and breakfast( good cat). The ","useful":1,"cool":0},"gb13Rz7sAJMV0tHyg9qMcg":{"text":"Love this place! It's right by Baptist hospital, a block off Freret. If you go for brunch ","useful":2,"cool":1},"ND-ArxVuNvwwALFrNKiamg":{"text":"Wow!!! They just opened one up on Carondelet and went in, and man this is some SERIOUSLY d","useful":0,"cool":0},"u4EsAiyDUQJ2G3hPY-iPpg":{"text":"Excellent food great service, just be prepared for a long wait!! Also very touristy and un","useful":0,"cool":1},"FiqoGhtju_t_lv5y8OwQSQ":{"text":"I've been eagerly awaiting the opportunity to compose this review on Bearcat Cafe. It was ","useful":1,"cool":1},"HTJDY9-lFgKIzMNUyYJXsw":{"text":"I can't say enough about Bearcat! They have something for everyone. We started with cold b","useful":4,"cool":3},"R55mPvGVa12fNIY0xR1fYg":{"text":"The food was Luke warm and underwhelming. The potatoes had to much salt and the vegan bisc","useful":0,"cool":0},"1FftpvHv50ZbO7EBXxrGWA":{"text":"Unique bottled drinks.. ordered the pear oolong.\nAlso the ordered the bramble cocktail, li","useful":0,"cool":0},"xUlvjKrnRRm2kKpT1_iYaA":{"text":"I have a new favorite cafe and it is Bearcat in NOLA. I loved everything about this place ","useful":0,"cool":0},"ntYQeWfuBH40sajSYp2BVw":{"text":"I have been here twice and it was amazing both times! I have had their granola yogurt bowl","useful":0,"cool":0},"8tZDuFCEkSyUa854GQAnFA":{"text":"JUST ORDER THE SHRIMP AND GRITS OR THE CAT DADDY BISCUIT. Honestly this place is incredibl","useful":0,"cool":0},"1JCAsoI02plcdOlsz_Ydlg":{"text":"I came here because I keep seeing a long line and figured something special must be happen","useful":0,"cool":0},"ErIjEVIIef-zYT6JfqWcsw":{"text":"Had breakfast with my son here and the food and service could not have been any better!  R","useful":0,"cool":0},"ZVG8mVojI0Hxrpcm4wiRhg":{"text":"BEST FOOD EVER. The entire table couldn't believe how amazing everything was. We went for ","useful":0,"cool":0},"QlYd8NqF0VuffXgxlKWU_A":{"text":"Every time I come to NOLA I come to Bearcat Cafe on Jena and every freaking time I leave u","useful":1,"cool":0},"2yqNruncp68mFsL6S-DBiQ":{"text":"So I would think twice before going here. Extremely understaffed and lacks in professional","useful":0,"cool":0},"mja2bbpFP0HbfF7KEX6ywA":{"text":"One of the best breakfast places we have even been to!  Great food, friendly staff and ama","useful":0,"cool":0},"eG9zQKZM42Jy9Q1wihGXmA":{"text":"this best place to eat in New Orleans!! the server Blake walked us through the menu for ou","useful":0,"cool":0},"4VOcXdT25gnZvKzmZlpycg":{"text":"Cute brunch place. We were able to find parking nearby and waited for about 20 minutes (wh","useful":0,"cool":0},"4g1Cb66GZbihtqP6CTy5QA":{"text":"The food is amazing!! I have been for brunch several\ntimes and love the potatoes and panca","useful":3,"cool":0},"HInCWwLbt7DUg9u0yiypYg":{"text":"Though the wait was a bit long, it was a Sunday morning & 100% worth it. It's so refreshin","useful":0,"cool":0},"c2dRtMP70MnUiZhefPfIvQ":{"text":"This is my favorite brunch place EVER.\n\nMy boyfriend and I come here every chance we get a","useful":1,"cool":1},"-QBPzR_tNwgAOWxHmhsyjw":{"text":"Always an amazing experience, the location on Carondelet is my FAV, the outside seating is","useful":0,"cool":0},"kAoUmzMCHx_bQuPwbPa-2g":{"text":"This restaurant is best food and good quality and service in over uptown try it and check ","useful":0,"cool":0},"C53tvGfGK8_2V8Ufqab7jw":{"text":"We ordered from the Bad Cat section but both dishes were so delicious! You can taste it's ","useful":0,"cool":0},"beuxyhMqRGzhp7sT13D_gQ":{"text":"I've been here a few times and let me tell you, it gets better and better. \nLocated uptown","useful":3,"cool":1},"bVXaSfTPY9N6nXba6oQMQA":{"text":"I am an out of towner who has never had cajun food before I came to New Orleans. And HOLY ","useful":1,"cool":1},"vfcA8RH41kzDPQ4Qfm32Gw":{"text":"Service was great! They were super nice and gave us complimentary \"butterfly lemonade\". We","useful":0,"cool":0},"PnJrU4awdpTaCSTHsmen0w":{"text":"Super trendy and cute with amazing food!  Would have loved to have had a mimosa or Bloody ","useful":0,"cool":1},"ljpuywA_yOupBZDIdU00Nw":{"text":"One of my favorite restaurants ever! The coffee is solid, the people are great, and the fo","useful":0,"cool":1},"s9KD_uHyb9E-viurcglIpQ":{"text":"Best brunch spot in the city!! Food is SEASONED, there's healthy options, fresh squeezed j","useful":0,"cool":0},"16dj0MIrk-GTSbQT1vwKzA":{"text":"Amazing place and I can't wait to go back. It's very popular and in a great location right","useful":8,"cool":7},"MYR3WeGdheTmpDSfAfo_Cg":{"text":"I love Everything about Bearcat Cafe. The ambiance, but mostly the food. Always hot, fresh","useful":0,"cool":0},"_VR-glRUTRvs3Gx92tCT8g":{"text":"Sooo so sooo yummy!!! The menu had such a large range of options, I had a hard time pickin","useful":0,"cool":2},"0HL5K5zka6QRqZxLDDpNEA":{"text":"We absolutely love this place. Breakfast & lunch items are amazing. We love sitting T the ","useful":0,"cool":0},"u99R3hRBp25ZvEBR1MRYjw":{"text":"Great vegan options , lovely atmosphere and customer service. Highly recommend this place","useful":0,"cool":0},"OCJ3G-Yo-tesvRq6hs4-Zw":{"text":"Bearcat is my top breakfast / brunch spot in NOLA! Absolutely love the food here. They hav","useful":2,"cool":0},"mNjtMSF1DztZdUjVVHTydQ":{"text":"One of the best breakfast spots in town!!! I have been to Bearcat plenty of times for both","useful":1,"cool":1},"Xwnkenihj1Nm8uH1_Y-NdQ":{"text":"Hands down my favorite brunch place. Yes it even beats surrey's!! We've waited almost an h","useful":1,"cool":0},"DR0B4o9gzy4WdC6n3ipFQg":{"text":"They say this breakfast is poppin, this breakfast is cool\nAll the folks keep coming, they ","useful":1,"cool":2},"kVkiH7Bok4L4SEDXaXFNXg":{"text":"Come early! We came on a Sunday morning and the wait was over an hour. A lot of people wer","useful":1,"cool":1},"yowUUWOdOkm_X2juisEEFw":{"text":"Best place to grab breakfast/brunch in NOLA! I always stop here to get my fix whenever I g","useful":2,"cool":3},"yHltCGYwltz3C_FMwgvCRw":{"text":"I had high expectations going to try Bearcat for the first time and they were completely e","useful":0,"cool":0},"8rAh-iod-p8GDwA_m_LNbg":{"text":"Not much has changed since this is still my FAVORITE brunch spot. If you come during the w","useful":1,"cool":1},"m1VF0Db0GbMs9tN6Lexojg":{"text":"So worth the wait! We got there on a Saturday at about 10:30. Expecting there to be a line","useful":2,"cool":1},"71KWu6n-EBcEJ7iNUCWGkw":{"text":"This place is EPIC! The coolest atmosphere, people and food. \n\nPros: Fresh squeezed juice!","useful":1,"cool":2},"wn_L7rAK1jcH-KepTJOBYQ":{"text":"I've gotta say, when I first walked up the steps to Bearcat Cafe, I didn't think my experi","useful":1,"cool":1},"r3QPOpMFIWPliv6byWzzBg":{"text":"Really good food. I also got the strawberry lemonade which was slightly disappointing. Ver","useful":2,"cool":2},"tJjqmhJHB4a4RDVv3xeGAA":{"text":"Went to New Orleans to get Microlocs installed and the location suggested this breakfast p","useful":1,"cool":0},"O4QMe2qHDIiuTA5jY2pyJQ":{"text":"I love Bearcat! After hearing stellar reviews from numerous people, I bookmarked this plac","useful":2,"cool":2},"veRVl3Hg94G6kf0ktomx4Q":{"text":"Oh yeah! The reviews are true, this is a 5-star restaurant, which explains the wait the tw","useful":3,"cool":3},"yf0_ijM9JdxHRu-tt9peig":{"text":"I may have been looking a tad rough and not on my best food, but I had to swing by when my","useful":16,"cool":17},"SVWT-mvfjhX-nXgqjn2HJA":{"text":"Was it worth a 45 min. wait for brunch on Sun.? You betchaaa! My hubs and I were on vacay,","useful":5,"cool":7},"shXE7DWAaAKSFGyHzAk28g":{"text":"Highly recommended breakfast, lunch, and brunch place! Adding this to the list of places t","useful":1,"cool":1},"-HOCBZh39dxP4hGiPLXnSQ":{"text":"I have been here many times, always on a weekend for brunch. There is always a wait, but c","useful":0,"cool":0},"s_hrcUty5TkLRerkv6qXNg":{"text":"Bearcat is one of my FAVORITE breakfast and lunch spots. They offer the array of fresh, he","useful":1,"cool":0},"a04S3UwhpKoO4H6Gtt0dug":{"text":"I loved this place I was amazed with the chai pancakes and the lavender honey latte and th","useful":0,"cool":0},"Xv82k7NQgKpuePd5iatDRQ":{"text":"Y'all. Run. Don't walk. Run to Bearcat Cafe. \n\nListen I LOVE brunch and I wasn't expecting","useful":3,"cool":0},"ft0o3nGFaEHvnzpzlPy6Iw":{"text":"What can I say that hasn't already been said?  This was my favorite meal in New Orleans.  ","useful":4,"cool":0},"jzBiR4XiDzlT5KIxKSWrFg":{"text":"We came here for brunch and there was a 1.5 hour wait and while I normally hate waiting fo","useful":5,"cool":5},"6TbrlzUnSui6sk1pO1IpoA":{"text":"Love this place! The first thing that intrigued me was the \"good cat\" and \"bad cat\" menus ","useful":2,"cool":0},"UjqZZa0RHj2zVz1sdZ28WA":{"text":"Talk about yum yum yum! \nCame here at 1 pm with a group of 5 and had to wait about 15 minu","useful":4,"cool":1},"lTHCbGnGRHrBmX0plT43TQ":{"text":"So delicious and worth the wait. We had the paleo pancakes (YUM), pork chop and mushroom o","useful":1,"cool":0},"0CAHHH5qznciwHih5Iyugg":{"text":"My favorite brunch spot in New Orleans - highlights is the creative menu and attentive ser","useful":1,"cool":0},"HMpjy7tkoQCM8_DZBYq0rA":{"text":"My first time coming in for brunch since I'm usually pretty busy and they did not disappoi","useful":0,"cool":0},"V494ZrbFUiJqT1weMSwG0A":{"text":"This place is an awesome and welcome addition to the New Orleans breakfast/brunch scene - ","useful":3,"cool":3},"3g8YXip8YFS4yaoB7H-duA":{"text":"Really like this place on Jena, just off Freret.  This place is constantly busy so don't c","useful":5,"cool":4},"VvceWKBihmQLaFgjUPHvSA":{"text":"I was third in line to put my name on the waitlist. This took 30 minutes. I was then told ","useful":0,"cool":0},"YIhJmedR9ohxZ6Mpoe-cZA":{"text":"My new favorite brunch joint! I absolutely love everything about this place. The server an","useful":11,"cool":7},"1DgQMQ7vPq11lLO-ozIv8Q":{"text":"This place has gained so much popularity and for very good reason! My favorite dishes that","useful":10,"cool":7},"xQDPnr4IhU-rymG2ZaxFSA":{"text":"My favorite breakfast/brunch/lunch place ever!!!! I hope this place stays forever. \n\nI lov","useful":1,"cool":3},"lX_E-1EEogGaVKNxnO7g9g":{"text":"Was at the uptown location, don't remember my servers name but he was a little more attent","useful":0,"cool":0},"bj9j0-AC2LTqZ4-s9R-LdQ":{"text":"They advertise healthy menu items but all there food is SALTY and a little too greasy for ","useful":2,"cool":2},"FcCaDu7FjdjYrSyRVV-b9Q":{"text":"Bearcat Cafe is OPEN for takeout.  For Mother's Day I was able to go online and order two ","useful":5,"cool":3},"XxHLdfDh3WcY-DAZNOPstA":{"text":"Due to COVID-19, we elected to order take out verses eating at the restaurant (a little to","useful":1,"cool":1},"pPUwq1YnZ2VCZPvmX9JV1w":{"text":"Absolutely delicious! My sister and I dined here, and the experience was delightful. For d","useful":1,"cool":0},"Zp_rEUyWMudFgoFqKorcTg":{"text":"I've been here twice & always great! The service is extremely kind and helpful. I think ev","useful":7,"cool":8},"NLpWgSXUB9ta4SYZeImmBQ":{"text":"This place has great brunch with something for everyone. Whether you want savory, sweet, v","useful":0,"cool":1},"QSE3Iq4lf7xlFy9u9R57ZA":{"text":"I've been wanting to try this place so I went two days ago and I'm already back. Sunday mo","useful":1,"cool":1},"eFpufpadw844k5L6N8RxfQ":{"text":"I would definitely recommend Bearcat Cafe! The wait was pretty standard, at about 15-20 mi","useful":3,"cool":1},"QZfwUOnFVz0GQEth9JX20A":{"text":"I love this spot. I was walking down Freret and decided to stop in. The menu has so much v","useful":1,"cool":1},"7vTGKWZFmU5QzAGdEXrIjQ":{"text":"Delicious! Heard great things about this place, and we were not disappointed! The Breakfas","useful":0,"cool":0},"4CcziMtZ_fje4GTsbvLdHQ":{"text":"This is my absolute favorite place to get brunch! Everything I had here has been so delici","useful":3,"cool":3},"1ILUroGZrjjVHtOt9AUU7w":{"text":"Go hungry! Their portions are huge! Also be prepared for a wait I suggest going early. Gre","useful":2,"cool":0},"VYrEeNBlc2fr5sJcGXWo2g":{"text":"My Uber driver recommended this restaurant to me (Thank You LOL). After reading the review","useful":3,"cool":2},"tTrGiIgjtbwEf9EgqqOHbQ":{"text":"Do you ever conjure the perfect meal in your mind, just to discover that you can't find it","useful":3,"cool":4},"DQ-foIoQqCw-3kyGespgdA":{"text":"After coming back again and again, and always being impressed with Bearcat, I feel the nee","useful":3,"cool":0},"w_bpB2_ThfnYDereJ_7moA":{"text":"Bearcat never fails to amaze me. I am not vegan but decide to go vegan here because the wa","useful":0,"cool":1},"FAMqWnPucQDtTKL6W8ezow":{"text":"Came with friends on a Sunday for brunch and this place was really busy. We chose it since","useful":4,"cool":4},"lx5OLaDePxDHJMPLj4Qj0w":{"text":"Love Bearcat so much. Still delicious and so worth the wait every single time! I've tried ","useful":0,"cool":0},"8d4hd8xQ4SeZw1PQ_GpijA":{"text":"Usually always a wait but for a good reason.. love this place.\nThe spinach crab dip was my","useful":0,"cool":0},"mMHfRFF7FC1J_NYHKn9dSQ":{"text":"Came here on a recommendation from a coworker. What a gem!!! Fell in love with this place.","useful":3,"cool":0},"l-WRIqGTvRL7kVCE4z6agA":{"text":"Do yourself a favor and come here at least once if you're ever visiting NOLA. Honestly one","useful":2,"cool":2},"rbjDU-V8dtOo1cC6_IVBlQ":{"text":"I've gone here multiple times in the past and they never disappoint! Whenever someone ment","useful":2,"cool":1},"51yeXJ4n72QB3sI0T3PsLA":{"text":"While the wait was long, the food and Bearcat experience was well worth it. Food is authen","useful":1,"cool":2},"niNx1VB7gfuWI3TYadmMnA":{"text":"Bearcat Cafe openly acknowledges a split personality. The menu is split between \"Good\" (lo","useful":1,"cool":0},"tLxYr4LIclQcB4kxd0eQgQ":{"text":"Bearcat Cafe is now my goto power (or recovery) breakfast spot in town! It is a great addi","useful":1,"cool":0},"BV8v4emPVcp6_kBsdJ21JA":{"text":"I haven't had the service issues since my first visit to this cafe. But it still gets ridi","useful":8,"cool":8},"mRa3L73Q9Rl-SnBYnkGveg":{"text":"This was a great restaurant to eat everything we had was so good I had bison sausage and p","useful":0,"cool":0},"PFjn2oticH8i61Or5yls7A":{"text":"I would definitely come back if I ever visit new Orleans again. The staff was really great","useful":2,"cool":1},"chugyTaBDVDE_WGn1gyWmw":{"text":"Really great breakfast/brunch. I had their shrimp & grits 10/10 good flavor & stone grits ","useful":0,"cool":0},"oAp8t1WOXKlk69mUGEk4jg":{"text":"Tried out this new breakfast place in the Freret street neighborhood today. The place is n","useful":1,"cool":1},"dLNxydFUDahx477qddeJGQ":{"text":"Feret St continues to get better and better! While technically just off Feret (on Jena St)","useful":5,"cool":3},"zTJ8t7-ERKFOA_QHMCNPZQ":{"text":"The food was amazing and worth the wait. The Robster was incredible. The service was amazi","useful":0,"cool":0},"BOpMRQm_L15Atm-4gWZfNA":{"text":"I love this place dearly. I am so happy I discovered it; thanks Yelp! Went for brunch and ","useful":1,"cool":1},"8DDfjFbDyHywTr_CYh49sQ":{"text":"So happy this business has remained open during the pandemic to keep providing amazing foo","useful":4,"cool":0}}