{"8dU7r6Dt4LPKcsab0bGdsg":{"text":"simply awesome, my only complaint is that I did not got there much sooner\nwe had the prix ","useful":0,"cool":0},"lrbE_YnRniA-_wUhJ3vczg":{"text":"First of all, I must thank Cheryl and Vicky for putting up with me and my obnoxious friend","useful":0,"cool":0},"l6DCSK07eg8hmGclTNmruQ":{"text":"This place has it all: friendly, competent service, delicious, inventive food, and a terri","useful":0,"cool":0},"2XFz9xzek-3jiDjbfTgDXw":{"text":"Still open, despite being shown as closed.  Had a dinner for 4 on Saturday night and was e","useful":0,"cool":0},"7CajzT3I0iJpW1MBDyx6lA":{"text":"Mixed reviews on this place.  The atmosphere is pretty cool and the food is decent but the","useful":0,"cool":0},"6SmbEKRntMwePETdEN5RLA":{"text":"Atmosphere was great.  Service was poor and the food was ok.","useful":1,"cool":0},"dzdjqhesTG57k3vFGQb5Rw":{"text":"Reopened as a steak house similar to Mr. Johns.  Same phone (504) 523-7600. Haven't been t","useful":0,"cool":0},"ymHVCO6w-fdL7mq8XchOrQ":{"text":"This was my first time here, I guess the chef previously had a popular restaurant in New O","useful":1,"cool":1},"uIy3DFpqbfI_V-GC1q936g":{"text":"I love going places I've never been. I am also on a quest to find the perfect fish taco.\n\n","useful":3,"cool":0},"sMu7UX0LPKIbLYtOLXj8pA":{"text":"Had an eccellent dining experience with a five course meal as part of a discount voucher. ","useful":2,"cool":0},"6Y2b125-WU-1nUNWavf-Yg":{"text":"Had dinner on Tuesday night 12/21, and had the Reveillon menu. It was absolutely fantastic","useful":1,"cool":0},"3nbE-qgTgq7GBlfBDHioWA":{"text":"We have been coming to JazzFest for over a decade, and last year we read that Mike's was r","useful":1,"cool":2},"O1aO-swwFkgRkJLm4egIDw":{"text":"Do NOT PASS THIS PLACE UP.  We were in town for a wedding.  Myself, the bride and brides b","useful":3,"cool":0},"95QRv-RmOnz6QDDHor9nNg":{"text":"I went because of a Travel Zoo coupon, but I'd go back and pay full price. The food was ab","useful":0,"cool":0},"09vGtsMJ6knl17WH2rC6lw":{"text":"We had a great meal here with friends during our recent visit. I had an amberjack special ","useful":0,"cool":0},"0Xs1Oy3V8wSj4qF5VwNWDw":{"text":"I surprised my husband with a birthday dinner at mikes last month. The staff went above an","useful":0,"cool":0},"VfpW1oh6ve_5q12_puBisA":{"text":"Terrible service. Very average food. Not good value for money.\nSKIP.","useful":2,"cool":0},"8alBADTPyAqecsLK3VDBeQ":{"text":"No_photo_small\nApril 20, 2012\nDoesn't like it\nEdit\nGreat food, poor experience.\nby Rigel54","useful":1,"cool":0},"_-OnVowbk4HC7crEqu-EUg":{"text":"I have never experienced such terrible service. From start to finish, the waitstaff basica","useful":0,"cool":0},"TJOzGN1LafJ52R6EPkp8WA":{"text":"I'm so glad I found this place! The food is delectable and I love that the majority of opt","useful":0,"cool":0},"-WKJhJHFYMpXyPWtakUDLw":{"text":"I've been waiting to draft this review... I believe hoping over time my rating would rise.","useful":3,"cool":0},"TQZAiYvfUzwJvDI5hWZ9NQ":{"text":"Yum, yum! I attended a luncheon at Mike's on the Avenue and the service and food was excel","useful":0,"cool":0},"FLqWm7uNk30DA5Vc6yobnQ":{"text":"After reading the reviews and going to Mikes website, I was so excited to check this place","useful":1,"cool":0},"J3YRMenLHiATQ3el_fctNQ":{"text":"Bouillabaisse was out of control! We had to wait 30 minutes for our reserved seats but I h","useful":1,"cool":0},"TWVE6bfxaV8iLLExwSS6gQ":{"text":"Good first impression as we walked in.  Very clean, crisp atmosphere and the hostess was q","useful":0,"cool":1},"Wz6AczKZQ44DvCJqVcOVVw":{"text":"Mike's on the Avenue was our choice for lunch today. We had a party of four and arrived ar","useful":5,"cool":0},"yA_LX0KkCEYtfsXnXYFCCQ":{"text":"This restaurant is located in the Lafayette Hotel. It has great atmosphere  and the food w","useful":0,"cool":0},"B9mDmd9rC2N5CwiQPeAkRg":{"text":"I was a bit skeptical about trying Mike's on the Avenue because of the lukewarm reviews, b","useful":2,"cool":0},"q14sfNam1nXjsAlUx6I9XQ":{"text":"Reopened as Desi Vega's Steakhouse, but much more than a typical steakhouse.  Same phone.","useful":0,"cool":0},"Cc3gOVFWphWOvANDFqABEw":{"text":"My wife and I have been here twice now, and we are counting the days until our next visit.","useful":1,"cool":3},"EWa9mmREhKFAFu0WzMBKNg":{"text":"This classy, little glassed-in gem smack dab right next to Lafayette Square is vastly unde","useful":3,"cool":0},"FQx4o7KhVfDLpjWI-jLTTQ":{"text":"Waiter was not helpful on the meal or wine selection\nFood not good and overpriced.","useful":2,"cool":1},"Ho2U8SaADj6-_hbdtjhfeg":{"text":"I love Mike's!!  The food is absolutely delicious, inventive, and beautifully served. I ha","useful":0,"cool":1},"i6o7jmmNiz6hff2bktHuXg":{"text":"When you first enter, there is no hostess area so I wasn't sure if I should just seat myse","useful":1,"cool":0},"wK0oQ9y4sP5Ihze_9hkFkw":{"text":"I had the Ginger & Citrus martinis. Though the ginger martini was FABULOUS & flavorful! Ho","useful":2,"cool":0},"TA-oZmnz0zLOTrZ_ZXBlGw":{"text":"Awesome food. Great service. Beautiful atmosphere. They seem to be adjusting their menu an","useful":0,"cool":0},"N9L0H0H48YBJA-PQglCaYQ":{"text":"Mike's on the Avenue.  Atmosphere was very nice.  Mike obviously uses it as a springboard ","useful":7,"cool":2}}