{"U1TjN4gvJirqTMCeKc_wOQ":{"text":"Stopped by for some chicken nuggets before a movie last night.  Service was quick and frie","useful":0,"cool":0},"Ol0EBOb19xyM_IajsETVIg":{"text":"I usually love Wendy's because of the food and friendliness that other fast food restauran","useful":0,"cool":0},"cKnZRBPFrTN8mynX5jCn0A":{"text":"I don't know if it's possible for people to move any slower. I was the 2nd person in line ","useful":1,"cool":0},"GrqK7uGLkDFW_Pm27rq3Qg":{"text":"Like most fast food places now, they are more concerned with taking care of the drive thru","useful":0,"cool":0},"hNEy0sn3mWsgYKJY516aaw":{"text":"This location sandwich maker doesn't wear gloves. I went on the morning to get biscuit but","useful":0,"cool":0},"Ay9e16Q22FMQUBbwctkyhw":{"text":"Where do I start? First visit my order was taken by mumbling employee who clearly hadn't w","useful":0,"cool":1},"Mh3Etb7Em2y900HdcGQRjw":{"text":"To the young man that handed us our food in the drive thru - thank you so much for your up","useful":1,"cool":0},"MGr-L4UrTiRhjkahkktglA":{"text":"I was a little annoyed when Wendy's changed their menu and started putting cheese as a sta","useful":2,"cool":1},"8IeqD2qpNFlg-ievEnMnEQ":{"text":"Not very welcoming. Took a few minutes for the cashier to acknowledge me. Cashier greeted ","useful":1,"cool":0},"v25VvH70xK9mnQDPwp28fg":{"text":"No one in line. In a drive thru, waited for nuggets to get cooked. Almost 20 minutes start","useful":3,"cool":2},"DLyWOfy7S9hO6N1b8cQz8Q":{"text":"I'm sitting here at the drive through window as I write this with six cars behind me, wher","useful":1,"cool":0},"JCldHRfzsDgcD15U0hmnbA":{"text":"One of the worst Wendy's took me 45 minuets just to get 2 sandwich's and fries was so anno","useful":1,"cool":0},"kpgsbJrzkBaHX8pCs2ngWQ":{"text":"I quit going to Wendy's due to food quality and temperature but I have been trying it agai","useful":2,"cool":0},"abnSGFtpi53G4wXB6ep1Dw":{"text":"Before we could even Park out front. There was an employee who was dressed in black. Obvio","useful":1,"cool":0},"6Ed9KfFe_5et-oYbC00krQ":{"text":"Ok y'all I never thought I'd be the one to review a fast food place but I need to say this","useful":0,"cool":1},"drfe6h-6zC56P43qQyqnHw":{"text":"Sticky floors. Horrible smell. Embarrassed because I brought a friend here.   Please do so","useful":2,"cool":0},"oHibnF-UVZeX1y-tJ4hjYw":{"text":"Server greeted me. Was pleasant and wished a good day. The gold star goes to her but doesn","useful":0,"cool":0},"c-WMdxgKIZRfCsYCHJ_wew":{"text":"This Wendy's has a reputation for being one of the worst in the area. Long lines, screwed ","useful":2,"cool":0},"aT-WlG_RzzwCMrUKJWBb6Q":{"text":"TERRIBLE! Went to get a chicken sandwich and fries and it was terrible. The chicken sandwi","useful":1,"cool":0},"DB7HU4o4k7Kg_-66sz5ugA":{"text":"No complaints about this Wendy's location. The drive-thru is usually quick and accurate ev","useful":3,"cool":2},"1N8H0TkkAGj6nLAaklYnFA":{"text":"I got yelled at by the manager for being \"too slow\" and the poor employees were running ar","useful":0,"cool":0},"KNrZqAc_et4J27k_UX-Tvw":{"text":"I don't expect much from fast food. I expect courteous staff, lines moving at a quick pace","useful":2,"cool":0},"CbYjGhlILvaubfVeWs8Sfw":{"text":"Food is always cold to say no one is in line. But, surprisingly this time I ordered everyt","useful":1,"cool":0},"nSN5oaKWUogGC2L0ndDPtQ":{"text":"I don't know what's up with this Wendys but they never seem to have food. This is my 2nd t","useful":3,"cool":0},"2rgCMfN4zGQd0WrUEI5qlw":{"text":"Pre covid-very rude female manager. Food=typical Wendy's.  I don't remember what the issue","useful":0,"cool":0},"xYdnVA3SuXudwRaD7Twj3w":{"text":"Had a to-go order and it was all wrong. No spicy nuggets just plain nuggets and missing nu","useful":2,"cool":0},"rHmw5AfhXqjY0D-T3Kt9Ug":{"text":"I stopped here for breakfast one morning before seeing the new star wars movie. I wish I w","useful":7,"cool":1},"b3MWJpzkWIOAngbD1kd7mg":{"text":"8:50pm on 1-30-2021 \nWe waited at the drive through for 4 minutes with no response    No o","useful":0,"cool":0}}