{"QXBlZui_CkRlzDhI1JO7lg":{"text":"Great service. Everybody was really helpful and left not feeling ripped off like usual.","useful":0,"cool":0},"7esKEit-D4XbFd2ZgB08bw":{"text":"I absolutely loved my experience here. I had a lot of car trouble when i was out of town l","useful":0,"cool":0},"ibSVyeCtqUEL466-HTVXLA":{"text":"Miss Gloria was great. My son is away at school in New Orleans and had some car issues and","useful":0,"cool":0},"HxsWurqkjIe8ALXCrJvfXA":{"text":"Seriously the best. Always honest. Used to bring my Jetta in and they told me up front wha","useful":0,"cool":0},"4P-NquV3q9FxorhVA8pFsA":{"text":"My boss has been coming here for years and she suggested R&S to me. She's gotten several v","useful":1,"cool":0},"6M71SDC2O8vozTwLKjr8gg":{"text":"This is a good, family-owned and operated repair shop.  The head mechanic and owner, Ray, ","useful":1,"cool":1},"bRvo9nfuB-x5PDSuGRBw2A":{"text":"R&S is wonderful! They are nice and most importantly HONEST.\nI took my car there because t","useful":0,"cool":0},"HNZ-ptm1LxA-zN37C-ea_g":{"text":"My family has been coming to R & S for three generations - my grandmother, my mother, and ","useful":0,"cool":0},"semehVftnhmOaiaDdyOlrg":{"text":"Beware. I got ripped off by these people. I knew what was wrong with my car before I broug","useful":8,"cool":2},"neSezIdU8Oh1IOv5NVWJ2g":{"text":"Excellent service shop. These guys were able to squeeze me into their busy schedule. They ","useful":1,"cool":0},"E3wcJQeargZkUb-Iw9gVYQ":{"text":"Since moving into the FSJ neighborhood in 1995 my wife & I have used R&S many times. They ","useful":0,"cool":0},"V-a3FBIwzCj0lYJKA2OZrw":{"text":"Had my car towed today by the wonderful Ms. India! Car died along side of the road.. India","useful":0,"cool":0},"nOwM8lsGIDa8RaU5b6E8SQ":{"text":"I've gone to R&S for car repairs many many times based on the recommendations of several m","useful":8,"cool":2},"NC5Ns9F0swHeMMaLOguP1w":{"text":"Took my Saab here for basic repairs before a road trip and they were wonderful.  Ray took ","useful":1,"cool":0},"yHVSI-JrQ5KxNI4kewAjxw":{"text":"Feel like I got ripped off, and a strange scenario. \n\nMy battery would die on and off and ","useful":1,"cool":0},"h8elVkrtv9Wg0bXBtsgM_g":{"text":"This is a wonderful family-owned mechanic shop. They did an incredible job with my decade-","useful":2,"cool":0},"pmNBW15sl8zXmNudy9dGag":{"text":"Long story short - they charged me 120 bucks for \"running the codes and doing a diagnostic","useful":1,"cool":0},"p0Qopat6Aypfmva_OQdpSA":{"text":"Once had repair work done there and they charged me to replace my battery while they were ","useful":4,"cool":0},"oNRuZZqLFmZUkYzdDE4KXw":{"text":"Work done just in time. Price in line w NOLA mkt which is most probably in the upper range","useful":1,"cool":0},"M03N8atcuaMm4FwOCqXr6A":{"text":"I took my classic 1966 Ford Mustang to R&S because it is one of the few shops that works o","useful":1,"cool":0},"Q5j7SeERWHrkUEcxVblU5Q":{"text":"Very fair and honest pricing and service.  Very good people and they get it right.  Highly","useful":0,"cool":0}}