{"FmQGoFJSkpTPtFJJdjmvVA":{"text":"We simply love this hotel. It is our home away from home. It starts with the easy valet pa","useful":0,"cool":0},"fYauCvJT2eVlYiHz5uN80w":{"text":"Great place to stay near Bourbon St. except the bathroom had no fan and no lock on the doo","useful":0,"cool":0},"x2o4uT6-j7c6oR4sHtNtBw":{"text":"Stayed at the Hotel St. Marie with two girlfriends over the weekend.  Here's the skinny:\n\n","useful":3,"cool":2},"YmwRn3Iww740S2VR22Mh9Q":{"text":"Great location, inexpensive, and clean. Just what we were looking for! I personally didn't","useful":0,"cool":0},"2ibaaMP75ewiYvjnG3Dr_w":{"text":"This hotel is so gross! The glasses were filthy. The television could not get a single sta","useful":0,"cool":0},"vbES4gu6bvuQPP6UdZ8ahQ":{"text":"I did the same thing you are doing...right now! Reading my review after reading so many ho","useful":1,"cool":1},"o0Gz0ZtHVRioQpgJV8909w":{"text":"The Hotel St Marie is an absolute New Orleans classic delight - conveniently located on To","useful":0,"cool":0},"UJd6zhFMM1sMXCLpO2sDkw":{"text":"I HATE PAYING FOR PARKING!!!!!!!! But this is the French quarter and it is what it is. Tha","useful":1,"cool":0},"HJUlZsYYcEUYpai0N1OAQQ":{"text":"Stayed here three days, part of an eleven day roadtrip.\n\nThis hotel has ups and downs. The","useful":1,"cool":0},"kdJzzMzlLAX0NvtKEFokTw":{"text":"We picked this location due to taking a family vacation primarily just around the French Q","useful":1,"cool":0},"rVE6Iw_i3pWNOyUon6-cvA":{"text":"First night: Noisy. No bathroom door. Sticky. Bugs. Light switch didn't work, nor did remo","useful":0,"cool":0},"HaG2vEiRxPlJo2p7DWeFIg":{"text":"Booked this hotel for my friends because they wanted a suite. This hotel only had 2 suites","useful":2,"cool":1},"4t_GVmxFbvY6h9P-C798Aw":{"text":"OMG on accident we ended up here again.. Horrible Horrible very bad... The bartender yelld","useful":0,"cool":0},"w39GMD0OdjUPIQqixoXU5g":{"text":"Lost 1 star because the rooms needed updating and ours (218) was quite small, however, the","useful":3,"cool":1},"TT1yZslThTYIvo3asLUbIQ":{"text":"We came to stay in NOLA for 3 days/2 nights during out summer break. The hotel was clean a","useful":0,"cool":1},"PieVfN6nJg3j2RkZmEhWQQ":{"text":"Beautiful rooms, great service.\nClean, nice beds, valet parking.\nRight in the French Quart","useful":0,"cool":0},"zRuVVhLJ_jVtSvnsRluuyQ":{"text":"It isn't the most expensive hotel in the Quarter, but it's not like it's the cheapie alter","useful":0,"cool":0},"x_JBkXyR9BRcU0uRcHI-9Q":{"text":"We traveled to New Orleans for the 2011 Jazzfest. When we arrived the Thursday of, there w","useful":0,"cool":0},"XqTVeQxWk1RRUx3IuRgzOQ":{"text":"I travel the Quarter a great deal. This was the single most amazing Hotel experience, ever","useful":0,"cool":0},"ZtwyN-YKpb4dldSpjuMYfw":{"text":"The front desk staff...awesome! The housekeeping staff...lovely! Maintenance staff...helpf","useful":0,"cool":0},"yiO_AiOEIhmaFj1_2aupEA":{"text":"It is obvious that location is the only thing keeping this hotel in business.  There was m","useful":3,"cool":0},"LD4UsFJPaByqY4_FaTjLZA":{"text":"We stayed here at the end of March of this year and while the location was fantastic and t","useful":1,"cool":0},"QyFX6JD_bHrl3sNiLwBGMA":{"text":"This hotel is in a nice location.  The staff was great and they were very informative on w","useful":0,"cool":0},"o94czyJJDVhSjCcW0bs56w":{"text":"We stayed at St Marie A. one year, & it was an okay stay.  The prices have gotten a little","useful":0,"cool":0},"agqsFB3eKgpKK-vy2bt1UA":{"text":"I absolutely loved our room. My brother and I were on a road trip from Oregon to Florida, ","useful":0,"cool":0},"dLtVOi7MS5u4SI_A6Um84g":{"text":"location is fantastic and the staff is so friendly. i was very displeased w the establishm","useful":0,"cool":0},"phrjVHosdrkLP319E9ZSog":{"text":"Very unreasonable parking fee. 34 dollars a night. They charged you valet parking no matte","useful":0,"cool":0},"uq6Qg65_-EzfPanpAd2H5Q":{"text":"Wow! What a trip!\nI left Hotel St. Marie yesterday and I miss it and New Orleans already. ","useful":4,"cool":0},"XcaMxa8KL6J_ACmJR7naaA":{"text":"Great location in the quarter. Price is very reasonable. Room was adequate but pretty date","useful":0,"cool":0},"Ype4k1_tMCyeBfqPIM0B0w":{"text":"Heart of the French Quarters one block from Bourbon Street.  Valet secure parking is only ","useful":0,"cool":1},"1FRbyUV4AXYA-UPwITC2Sg":{"text":"This weekend was my second visit to this hotel and me and girlfriends had the best time. T","useful":0,"cool":0},"NyRsLdwzadHeZmG6bucWdg":{"text":"Great service. I asked the front desk for an extra ice bucket because I was pumping and st","useful":0,"cool":0},"f5D0itD3H06SH1_nRDhyzw":{"text":"I booked this hotel for a weekend as I was supposed to be in town for a good friend's wedd","useful":1,"cool":0},"8d8OtMshCeLVtgZXRNAY-g":{"text":"Nice enough rooms.Disappointed they put on a floor that stunk of paint fumes and wallpaper","useful":0,"cool":0},"Nf508iXaUXG6QCgfHvaxYg":{"text":"Our room was a pit. There was dried blood stains on the pillow cases, a greasy hand print ","useful":1,"cool":0},"2TqxPuNQjHU3RNglA9d06g":{"text":"We've stayed here twice. 5 years ago it was worth 5 stars, we recommended it to everyone. ","useful":1,"cool":0},"s86EtyOGXVsfzGF72OpimQ":{"text":"Just got back from NOLA my stay at the Hotel was great. I checked in early and overstayed ","useful":0,"cool":0},"667acu0i0Lg8whgBmohyfQ":{"text":"Great location with great rates.. Located in the heart of the French Quarter near Bourbon ","useful":0,"cool":0},"PTGsOWI-YVavR0ESWIJyVg":{"text":"I think I hit the jackpot with this find, I hand been searching for a good location to set","useful":0,"cool":0},"hW32f2Iz-q2Jcvc3k1QYaA":{"text":"I really enjoyed staying here.  They were very nice and the rooms were clean and neat.  Si","useful":0,"cool":0},"N39_PBJOpo0XbzQxoFaoqw":{"text":"We had a great time and a great stay at The Hotel St. Marie! \nAfter many weeks of research","useful":0,"cool":0},"0dVb5RBoemE9kHSXcprSUA":{"text":"Quaint, quiet, historical, great location. \n\nLocated one block from the infamous Bourbon s","useful":2,"cool":0},"E9h3f8nAqCTiEwhwNDu_cQ":{"text":"I absolutely love \"my\" hotel. Housekeeping, however, ignores or can't comprehend \"do not d","useful":0,"cool":0},"z_Pyg2tq3ppH8PeowDRNEg":{"text":"This hotel was a gem! Beautiful rooms with balconies and a lovely colonial courtyard all i","useful":0,"cool":0},"wNhMyGl-_Qv8Q0nFQaqH7g":{"text":"We stayed at Hotel St. Marie for a few days after our wedding, and we totally enjoyed our ","useful":1,"cool":0},"J_kumYeb0JOH-ZLpnso-uQ":{"text":"This hotel is VERY conveniently located just one block from Bourbon St, and three or four ","useful":1,"cool":1},"wRhQJtE2ByHy8HNN9cMkqg":{"text":"We stayed four nights at the Hotel St. Marie. I'll break it down below.\n\nHotel Staff: Can'","useful":0,"cool":0},"sftPC07ONGW-eZ5R_nF9WA":{"text":"Hotel was great. A/c was excellent considering we went the hottest time of year.  Would de","useful":0,"cool":0},"YqZkHY55pGJeJI9trGdmJA":{"text":"This place is extremely convenient to everything in the French Quarter, and not to far fro","useful":0,"cool":0},"zmNMZJPfcemWa32DnRM4-A":{"text":"This hotel is awesome and I highly recommend. The location is perfect - only a half block ","useful":1,"cool":0},"84zxC_s41OjJ5u887s-3Yw":{"text":"Beautiful hotel in a great location but.....the beds must have come from Salvation Army an","useful":1,"cool":0},"pqWJWbrnaBrM9S9P-f4WlA":{"text":"First, let me apologize for the lengthy review but I'm so happy with this place, I have to","useful":10,"cool":3},"JhB_vYq2jCMu00emJWIIrg":{"text":"I am upgrading my review of St. Marie because of the owner and staff. Apparently these peo","useful":3,"cool":0},"Tj5eSTCX08_TPSU5K2EEQA":{"text":"This is a great older hotel one block off of Bourbon Street, yet there was no \"party\" nois","useful":0,"cool":0},"ykV6RQDOnXr_F7hul3ee1A":{"text":"It was the very worst hotel I've ever stayed in. Rude and unprofessional staff. Then charg","useful":4,"cool":0},"-wfWWwhFIKSbw-cof-YlJw":{"text":"Dirty, dirty, dirty! Threadbare dirty carpet, stained sheets, moldy caulk in shower, caked","useful":4,"cool":0},"Nc4shflSwkeD2u4fqxpPJA":{"text":"Outrageous parking fees for hotel guests!  Poor customer service!  \n\ndid not get the room ","useful":3,"cool":0},"3TCV1XRylOlM0zVya7d5YA":{"text":"Hotel St Marie was a great choice! Right in the heart of the French quarter and a block of","useful":0,"cool":1},"AtHtADFirAWfWNMALm-lnw":{"text":"I was so excited to stay in New Orleans for my fiance's 30th birthday. I made a special re","useful":2,"cool":0},"sUijROwtQpK2YnESlQnbVg":{"text":"No frills hotel with great location.  Room = comfortable bed, nasty carpet, toilet had a l","useful":0,"cool":0},"FGisPr10b9RtC4hpzgGudg":{"text":"I went with my girls for my bachelorette weekend and we loved this hotel. The bar downstai","useful":0,"cool":0},"KoQtpzF0LLVILtmD7U4hAw":{"text":"Great location. Clean rooms. \n\nService was so-so. The people at the front desk are hit or ","useful":1,"cool":0},"PYiXxMhjy70A-KGrJTgD_Q":{"text":"Good morning. I have sent a few emails and made a few calls to The Hotel St. Marie. I have","useful":1,"cool":0},"g5iTI5-zeKLNyXWl6gxO0w":{"text":"worst experience i have ever had staying at any hotel. to get straight to the point, the w","useful":1,"cool":0},"UDabMhAnBS5j232ceQqsXQ":{"text":"I absolutely adored this place! Spacious rooms, clean rooms, really nice staff (promptly a","useful":1,"cool":0},"OW9bna51-cb_ChZ0q9P61g":{"text":"Truly loved this hotel!  The rooms were clean and the staff was extremely friendly and hel","useful":1,"cool":0},"ZMI1kICIubFHisQ5yBJNkg":{"text":"This hotel is amazing!!!! The workers are amazing as well.\n\nVery charming hotel located at","useful":0,"cool":0},"mjF9mZZDI5i8rro7PK94Jw":{"text":"Came to New Orleans for my 21st birthday with a couple of my friends and we couldn't have ","useful":0,"cool":0},"KsfYXmiZNeM0LQSSK0lCDQ":{"text":"Our stay at the Hotel St. Marie was wonderful! The location is only a block from Bourbon S","useful":0,"cool":0},"_CnPVTe3MGm9OnE3SVqcvg":{"text":"Plenty of character in the suite we stayed in, but the fact it was ground floor and my win","useful":0,"cool":0},"lkUR5LNUxWWxXuvfPPggsA":{"text":"Hotel was BEAUTIFUL. Staff was extremely helpful and welcoming. Upgraded to balcony street","useful":0,"cool":0},"DQjuzJFWvM1_OYB_CiKRiw":{"text":"Great location! Very close to Bourbon Street, but without the noise or smell. The room was","useful":0,"cool":0},"CcjbTua0tx8WbOLrlkFrPA":{"text":"Horrible place!\nWe are currently staying here and if we hadn't been so tired we would have","useful":1,"cool":0},"ewL6mPzdc8WmJxXkti88ng":{"text":"Update on my prior review of the Hotel St Marie. \n\nAfter my initial review we were contact","useful":1,"cool":0},"gzKjXjOklwoDJ_V9rvZ_Bg":{"text":"I just stayed at the Hotel St. Marie for the second time and if I go to new Orleans again ","useful":1,"cool":0},"YL8vNd-sc7iDcwIpnZN0-Q":{"text":"Hotel St. Marie is a great home base for exploring the French Quarter. Just a few blocks f","useful":0,"cool":0},"3qcyrRCg-W5ZMJv_UrNm4w":{"text":"Absolutely love this quaint hotel. The staff is friendly and super accommodating.  The rat","useful":0,"cool":0},"60EtrmoIrP5KB-u2lmd1XQ":{"text":"Horrible experience all around. There were hairs in the bathroom floor that looked to not ","useful":1,"cool":0},"CqHJ8V5y-Jlnxj-xej56uw":{"text":"My husband and I stayed here for our honeymoon. The staff was so friendly and helpful, the","useful":0,"cool":0},"KpS3c3Oz0cI6D-4R5glnFg":{"text":"Location is best aspect.  After that it was just downhill.  It is in serious need of love ","useful":1,"cool":0},"TUHmCa85-4M0oS_XRfcIHA":{"text":"My wife and I stayed here years ago and it was wonderful. On our recommendation, our daugh","useful":1,"cool":0},"78Wxh2obAkfuJEellODGLw":{"text":"My family and I stayed at this hotel during Sugar Bowl week.  \n\nFIRST: Location is perfect","useful":3,"cool":0},"FDETq4TRDV39s7QzdmJNlQ":{"text":"My family and I stayed at the Hotel St.Marie for Mardi Gras 2014. For the price that we pa","useful":4,"cool":0},"sZeo-cSgsRsgqcZG1PgFMw":{"text":"Accommodations are pretty standard for the Quarter.  Had an interior facing balcony room a","useful":0,"cool":0},"IzGi7Pyb60DrMrhh2bj_RQ":{"text":"It was fine!  Great location in the French quarter, quiet rooms, comfy beds.  A teeny tiny","useful":0,"cool":0},"PU1arpyDxW0xNxzlDyNvMA":{"text":"My wife and I never had the chance to stay at the Hotel St, Marie, so we can't speak for t","useful":1,"cool":0},"e5x9BVcF0rFNRqOUGcwvLQ":{"text":"Stayed there this past weekend, July 7th thru July 9th, in room 203. It is a courtyard roo","useful":0,"cool":0},"xKxo2bf_gudEkVcpUJ4TaA":{"text":"Ok, I can't even write all the stuff that was wrong with this place but besides the dirty ","useful":1,"cool":0},"oXAsAqJnZWB0zgbInv3Ofg":{"text":"I would have given this 4 stars but the front desk clerk tried to charge me for the third ","useful":0,"cool":0},"sTfkiZmG-13IDwCmjANCMw":{"text":"With so many options for hotels in NOLA, I would not stay here again. When we first checke","useful":1,"cool":0},"-A3dyx0fLpamgjJ-ra2HEA":{"text":"We stayed (sadly) only one night at Hotel St. Marie.\n\nDue to street construction it was a ","useful":0,"cool":0},"c8ucRp-_QO25a-0Wud7s1w":{"text":"2 stars is probably saying a lot for a hotel right off bourban street but unfortunately I ","useful":2,"cool":0},"H0BsYlvpFK71uvp3kjUNtA":{"text":"Saw that it was 4.5 stars, booked online which the pictures are deceiving. Thought the del","useful":0,"cool":0},"H_PtgWlYIp7xoPYcKC5oJw":{"text":"Character, Charm, Convenient \n\nReasons to stay: \nPerfect location to get out & walk around","useful":0,"cool":0},"OSuINFaoRzMvuBMufU1D1Q":{"text":"Great party location if your willing to pay the extra $$. It is similarly priced compared ","useful":0,"cool":0},"FZtdEmQ0AVSmwuofXmaeTQ":{"text":"So ... if you get a room on the 6th floor you may end up in an elevator that goes 5 floors","useful":0,"cool":0},"IvuBnDuOf4bhoNBrIlaTqw":{"text":"My sister and I went to NOLA for the first time for her birthday/last trip before her wedd","useful":2,"cool":0},"ZNHdCK5wTo1e7eZWW89P3w":{"text":"This was our first trip to New Orleans. The St. Marie made the stay just great. It is loca","useful":1,"cool":0},"Ys_5xJHVVArm5sERf1NhOA":{"text":"I enjoyed my four night stay here.  The location is great - right off Bourbon, but far eno","useful":2,"cool":1},"0opyGxUflogCh1hQTz6IPQ":{"text":"My husband and I, along with some of our wedding party, stayed here for our destination we","useful":0,"cool":0},"1vLLuHsRX_9Fd9_FH8betw":{"text":"I enjoyed this quiet refuge from the noise and craziness of Bourbon Street.  The building ","useful":0,"cool":0},"fz8-oOA6mYbqLGnps6g17w":{"text":"Great Location and very nice staff. Otherwise basically rundown. Roaches, a broken toilet ","useful":0,"cool":0},"1lLqeKcj_Z7xhFs8wa7zKg":{"text":"Couldn't find a single thing to complain about this hotel. The pool, the downstairs bar, t","useful":0,"cool":0},"MqqMVB5KQrY8Nxh-MHwqgQ":{"text":"Stayed here on a recent getaway to the Big Easy.  The location in the heart of the French ","useful":1,"cool":2},"huxJFf2xVxXiNR5NYVEwXw":{"text":"This hotel was great! It is a great location if you're wanting to be near Bourbon street (","useful":0,"cool":1},"bOKTEXf2PfIiNeQx5YXmgQ":{"text":"Loved our stay. The price was amazing for a large very clean room with a HUGE balcony over","useful":1,"cool":1},"ZYC2pHhpcfax5A6hoXNawQ":{"text":"This is a great hotel for the price and location. If you want to enjoy the heart of the Fr","useful":2,"cool":0},"qRwpHPnmiYjhDaoPjhRCEA":{"text":"Fire alarm kept going off every night and they claim it's a malfunction, but if it keeps g","useful":0,"cool":0},"_lWDq_E5asVgGEtofzk3qA":{"text":"This is our third time staying here! The renovations are awesome! We always request to sta","useful":0,"cool":0},"eWYQ4erphlsj_6j0zA67nA":{"text":"Ok hotel, amazing location. The hotel exterior was clean, as was the lobby and small bar o","useful":0,"cool":0},"e7E1-kthQKLkf7XQO0gnag":{"text":"I booked a King suite in this hotel for our wedding anniversary; we'd never been to New Or","useful":0,"cool":0},"j6sbA_DZiBjWSmvekW29gw":{"text":"We loved our stay at Hotel St. Marie.  It is central to anything in the French Quarter. Th","useful":1,"cool":0},"MEgwzsRAcMBRJdPiIhdwwQ":{"text":"My Family and I come to the wonderful City of New Orleans every year. While I love the Cit","useful":1,"cool":0},"5XZNjs3S_6tMxn-gv1mSHA":{"text":"I stayed here with my sister a few weeks ago for a little vacation.  This place is perfect","useful":0,"cool":1},"HHbKIlVmOwrLoxAOQJ_YcQ":{"text":"My husband and I were in New Orleans for one night and stayed at the Hotel St. Marie.  Our","useful":0,"cool":0},"6l5jSyQSpJZWGAvJGf_yjA":{"text":"Hotel/restaurant/bar had nice employees and good food! Love our balcony view of the courty","useful":0,"cool":0},"oogaro1N4IcvXilS_-DnxQ":{"text":"Stayed two nights here while in New Orleans.  Cheap, clean, comfortable, with nice views. ","useful":0,"cool":0},"1boAcOYRbk-5uN1txeJNpw":{"text":"Location is awesome...quiet enough to sleep when needed however 100 ft from the best inter","useful":0,"cool":0},"XYygtX7F2OCKDtxVqkciKg":{"text":"DO NOT STAY HERE. This hotel is horribly overpriced. I booked 3 nights over Valentines Day","useful":3,"cool":0},"a0VnvRRWxly-P581mx0bjQ":{"text":"The WORST hotel we've EVER been too. Room was horrible, checked in then they walked us acr","useful":1,"cool":0},"qVpev7RbZoRR3FrTaQIRrA":{"text":"This hotel is in a great location and worth the stay.\n\nPros: Great location, fairly quiet ","useful":0,"cool":0},"LHFp3xeoet4qK6LRmCagqA":{"text":"We love this hotel!  Beautiful rooms, great service, easy parking access, beautiful courty","useful":0,"cool":0},"BLHGBAKjhwlw_33qvNDFMw":{"text":"Staying at hotel St. Marie... I was very please to stay here i did a last minute reservati","useful":1,"cool":0},"VHZDkhYCr-kF_JS84F65Ew":{"text":"Had a great stay at Hotel St. Marie! Every single staff member that we interacted with was","useful":0,"cool":0},"WQaQAXhxyFKFO05cHvmrOg":{"text":"My sister and I had a great time! The staff was very friendly and accommodating. Cute litt","useful":0,"cool":0},"eaQXu3UK3UYtsHIFeTM3_Q":{"text":"Well, after our stay here last year I gave this place a 3 star but after this year I have ","useful":0,"cool":0},"4zhuQjk0xnzHwYUCVbE3Gg":{"text":"This hotel deserves a better rating on Yelp! It was my first time in NOLA and i think i'll","useful":0,"cool":0},"aAOwU-5NHcDgK-JxfmC6eg":{"text":"Hotel St. Marie was decent, with the perfect location. The hotel seems to be a very popula","useful":1,"cool":0},"KAaO3_oORUlCYsLXWHttGA":{"text":"Beautiful hotel, and the man at check in on August 19 in the afternoon (sadly, I dont reme","useful":1,"cool":0},"v54zXbIuKr8JpMnPNJewDQ":{"text":"we just returned from our stay here while in New Orleans.  We had never stayed here previo","useful":0,"cool":0},"uy2hBPtwfrGaTI664u-q6Q":{"text":"I stayed this past weekend and won't go back. To begin, the check-in is 4:00pm. It's norma","useful":0,"cool":0},"tbtnOuIQLEvllQVpxAGP3Q":{"text":"I am a fan of this hotel.  We have stayed here two times in two years.  We just returned f","useful":0,"cool":0},"ckYHR1FZhhG6oBEFB-ygqg":{"text":"Fantastic location. Staff nice and helpful. Rooms were furnished with old and not solid  p","useful":1,"cool":0},"uk8PQCnRI0L3efKV2I39vw":{"text":"Reasonable price. Beautiful, old-fashioned decor. Quaint and charming.  The staff is very ","useful":0,"cool":0},"S7-wSwAZ41lpxIm3CGcGQA":{"text":"What a find this hotel is! I usually stay at Marriott or similar but decided to be adventu","useful":0,"cool":0},"cZst-G6mx1KY6ARU7A6c9A":{"text":"Really enjoyed my stay here @ Hotel St Marie as it is a pretty sweet boutique hotel. Its l","useful":6,"cool":2},"CqWok09GadhlhuFyGHJOvQ":{"text":"Looooved this hotel. Last year we stayed at a condo rental but this was so much better. Th","useful":3,"cool":0},"B_R7gH1ywEoTGKxLsnJN3A":{"text":"Average hotel. There is guest parking ($34 night) and a bar and restaurant on site. VERY c","useful":1,"cool":0},"Q50zKVZevL2505Qxzf5t-w":{"text":"This hotel is at the corner of Toulouse and Bourbon. If you know anything about NOLA, you ","useful":2,"cool":1},"xPMD3_uIEUQTiUzishbPUg":{"text":"Our stay here was charming. The valets and bellhops were very attentive and courteous. The","useful":4,"cool":0},"7_GHUKJ-eA3nrtUiWJfdRg":{"text":"HUGE thank you to the staff, mainly Travis at the Hotel St. Marie for making our stay so a","useful":0,"cool":0},"WEE5KNshEkSmikg1gRCgTw":{"text":"This is our third time staying here! The renovations are awesome! We always request to sta","useful":1,"cool":0},"wNUmpIH9G36dbsKTNVSnJQ":{"text":"This was the worst hotel I've ever been in, especially for the price.  The website and rev","useful":1,"cool":0},"0cQxI0fQT0EngpbDXH7HPg":{"text":"For my first visit to New Orleans I was pretty impressed! The staff was very helpful a nic","useful":0,"cool":0},"mUIHHpQ4BtV0JHlfl08wAg":{"text":"The Receptionists are neither welcoming or friendly, the place was being renovated the wee","useful":0,"cool":0},"aLB6H-YDTVYvvh5GbW2zWg":{"text":"The hotel was OK.  Good location, friendly staff, basic room, very basic TV, VERY small wi","useful":0,"cool":0},"6idqR2zWNo_aBvrF8lbwTw":{"text":"location is great but our daughter stayed one block down for 20$ more a night, and get thi","useful":1,"cool":0},"ZrncK4FUfhIMY58FuwXvUw":{"text":"What a wonderful place to stay in the French Quarter! Location is great! Rooms have been r","useful":0,"cool":0},"B5D-ael745qeapQiw-eZ3g":{"text":"Loved the Location - however thought it was expensive for the amenities provided.  Service","useful":0,"cool":0},"wU3lksg6Z_q5Qs1W3Z_xSg":{"text":"At $300/night I expected to be able to sit out on the little balcony ($20 extra!) but the ","useful":0,"cool":0},"ABF6Ce3NHoIwLaqQroojHw":{"text":"Came here to be in the French Quarter, great location. If you are willing to over look the","useful":0,"cool":0},"1co3Jym2em1luSfJn8vPWA":{"text":"Nice hotel a block away from Bourbon street. Very friendly staff offered to help with reco","useful":1,"cool":0},"dUkOBwkUIt7cyLxijcX5YQ":{"text":"Me and my wife have been staying here for years but this may be our last time. While there","useful":2,"cool":0},"fzndK8AHP6okSI97JN35cQ":{"text":"Nice hotel, nice location, nice price.\nMy only issue was that the wifi barely worked.  I e","useful":0,"cool":0},"YA8J6vHIr7ZGpMko_mZlZg":{"text":"Place is a dump.  It needs a new owner who cares.  It's dirty and overpriced.  Stay away..","useful":0,"cool":0},"rcgEOlXw7c1l8ft_FFykHQ":{"text":"After reading the Yelp reviews of the Hotel St. Marie, I half expected this to be some run","useful":5,"cool":0},"YP97rmFq2xvMx1b6whX4Pw":{"text":"Very nice clean hotel located right in the heart of the French quarter. We had a very comf","useful":0,"cool":0},"ruKcgnfNOtBgU9YlSbf9uw":{"text":"The room was the perfect size for us. While the view from our window was mostly rooftops (","useful":1,"cool":0},"LTN1hCFS1nifsKJ9oooPuA":{"text":"Not terrible. Not good. The highlights:\n\n- Waited for 15 minutes at the valet stand before","useful":0,"cool":0},"71sqmD2OAkJDxVAGgFe7Ig":{"text":"It was my first time in New Orleans and the Hotel St. Marie was a great part of the whole ","useful":0,"cool":0},"R8TVEXVwn8WMSHQmnCytcQ":{"text":"price plus location... fantastic! the room was cute and spacious. the service was good as ","useful":0,"cool":0},"-1xzSuE5LYeCUEipCzaWgg":{"text":"I got a sweet deal here for a two night midweek stay in August as my girlfriend showed me ","useful":4,"cool":0},"5IWC0TSOB6obn1M9jcLqsg":{"text":"this is an older hotel that has been very well-maintained and upgraded through the years. ","useful":0,"cool":0},"GX9fAGperH8FdRkWIZktgQ":{"text":"I have been happy with this hotel. It is literally a few steps away from Bourbon Street bu","useful":0,"cool":0},"EmOwDTUnksuHNMytbcjxVw":{"text":"The location is perfect. You're out of the noise of Bourbon St. but the party is right aro","useful":0,"cool":0},"2x8ZRmmRK3FqJDSi3xuSAA":{"text":"After reading other reviews I was prepared for dirty carpets and smelly rooms.  Luckily, I","useful":1,"cool":0},"8ybeQdCJb9WXG39EuTNj1A":{"text":"On a cross-country road trip, NOLA was our splurge. We just had to stay in the French Quar","useful":0,"cool":0},"g-JLlpbjKmT3JbdLOO7ZJQ":{"text":"I wasnt expecting too much for the price, but it wasn't all bad. The room was clean, and t","useful":1,"cool":0},"Z0HBjJ7SdkfSaXbD6ITtJQ":{"text":"I was not very pleased with my experience here to say the least. The only positive thing I","useful":3,"cool":0},"SwIhJJUpCBCEYUroAtVxyQ":{"text":"We had a wonderful time staying at this hotel over thanksgiving week. We stayed in room 52","useful":0,"cool":0},"y5aSokEIDltiRTQrEAWkEw":{"text":"Just returned from a 9-night stay in the Hotel St. Marie, and it was great!  My wife and I","useful":0,"cool":0},"w-crvZH1gdY3XCNHiWONQg":{"text":"I chose this hotel because it looked like what I thought old New Orleans should be- Overal","useful":3,"cool":0},"r5E5nRVqFjGtpVL9hUcCGA":{"text":"We stayed here for 3 nights in June 2012.  It's located just a block from Bourbon but with","useful":0,"cool":0},"AfUxM3HtYG-NTbKzNUeUVw":{"text":"I wasn't fond of the girl at the front desk when we checked in...it seemed as though she d","useful":0,"cool":0},"xNm5vXPcHIDhTFv7lwiSFg":{"text":"Classic French Quarter hotel, with only 5 floors & about 80 rooms. I had a comfortable kin","useful":0,"cool":0},"IKgdNyiNuaFUyC9MQ32tIg":{"text":"Stayed here this past weekend for a bachelorette party. I was in New Orleans for the first","useful":1,"cool":1},"c5mcWtiJSxw40ldvujRjCw":{"text":"I have put off writing this review because I've been trying to resolve this.\n\nLet's start ","useful":1,"cool":0},"q3noaly6YYdfE8ElyBgfYg":{"text":"Stayed here one night and liked the hotel very much.  In the quarter and very close to eve","useful":1,"cool":0},"4Uc2rUCdOvp8jGuRP5JMxg":{"text":"Have stayed at the Hotel St. Marie twice. April 2008 and Dec. 2009\n The rates are about av","useful":0,"cool":0},"SHPWYYkqB8voKgKOMKtVYQ":{"text":"***update***\nI'm upgrading to two stars. I think my room had not been used in a while,  th","useful":3,"cool":0},"s5yODkwBKJdPHeNRYCAwfQ":{"text":"A little backstory: I was coming into town to attend Voodoo for the first time in 4 years.","useful":6,"cool":6},"4pDLs2BYoU_w3puHF8947A":{"text":"As someone who has never been to the city, I was a little nervous about finding a quality ","useful":0,"cool":0},"mI5VhW47_ribaGkFGazlCQ":{"text":"Honestly, I kind of want to keep this place a secret so it does not get booked for my futu","useful":1,"cool":0},"6wCJtcTCmZQd_nZQl7BJZA":{"text":"Nice hotel, friendly staff.  Nice room.  Small bathroom but big shower.  Right near Bourbo","useful":0,"cool":0},"ZajwXWZV53a53EPE2PuJOQ":{"text":"Stayed here because I got an amazing rate as an add-on to my flight to NO. My friends and ","useful":0,"cool":0},"Cxl_4Jgp5BTLnJRcZZ_QwQ":{"text":"Location is great! Half a block to Bourbon Street. You can sit on your street side balcony","useful":1,"cool":0},"TmKOqemgmZPRtWtgzv5mNA":{"text":"Room is a little on the small side.  Courtyard and  restaurant are very nice.  Hotel staff","useful":0,"cool":0},"4D02w0jxW_ukJA3IAdAlmA":{"text":"Hotel St. Marie\nWe arrived at Hotel St. Marie at 10:30am. The lobby is pretty and clean, t","useful":1,"cool":0},"izYJzwqv1GahEXHGzo93Kw":{"text":"We loved this hotel! My boyfriend and I went back and October and plan on booking this hot","useful":0,"cool":0},"Q4yN_2hMrO2iYji5bH4feQ":{"text":"We recently stayed here for Mardi gras, march 2019.  We really enjoyed the hotel.  Its loc","useful":1,"cool":0},"PR4BScrEzkCThUga4NLiMA":{"text":"While visiting my parents in Gulf Shores, my mom and I decided to take an over night to NO","useful":1,"cool":0},"cSu4BfFBxdbF7Qc1TcKIIA":{"text":"Quiet rooms with no outside noise very close to Bourbon Street. Hallway noise very loud un","useful":0,"cool":0},"W0nehLVFuowRsQR8KUFI9A":{"text":"This place is for you if: \n1) You want to be in the heart of it all in New Orleans.  It's ","useful":9,"cool":5},"UmRUrHTE8T_m9_0O7xNMRA":{"text":"We stayed her for about a week. Courtyard balcony king room. The balcony was small and we ","useful":0,"cool":0},"mr0BqaQf2e0kcKFEh7ckOg":{"text":"This is a cool French Quarter Hotel that often has some really great rates.  It has some n","useful":7,"cool":1},"1c2C8UDaH25oURXaWtMkiw":{"text":"I had a great experience here. Staff was all so nice and when we needed extra towels & toi","useful":0,"cool":0},"8skGVN2rULohHG7rnma4YA":{"text":"Best in the quarter for value, location, service, and easy parking!","useful":2,"cool":0},"Kq2JXt6rZ72ycrMqakezlQ":{"text":"Decent place to stay and priced right. Good location,yes. \nBut,the pool hours are not enfo","useful":0,"cool":0},"gQQlFc4woi0C2PEXGvckDA":{"text":"I stay at this hotel August 15-18.\nStaff=excellent\nIt's silly to single out any one staff ","useful":0,"cool":0},"c8AaZzeaUvG-ZPhyD0ODow":{"text":"We had a 9 day stay. Can't say enough about the Vacherie bar and restaurant staff at and t","useful":0,"cool":0},"TLViGiouJEfSTamn2kJ3Ow":{"text":"This hotel was built in the 70's and the dated fixtures show it so if you want to stay in ","useful":1,"cool":0},"ryqMst7S6z6JwW_g88Z-eQ":{"text":"This is a very old hotel, but don't let the reviews confuse you. It is not dirty. We loved","useful":2,"cool":0},"wohPxOEqVwLbKW77UHLKeQ":{"text":"Very friendly staff.  House keeping is amazing.  Love that they check the rooms when the d","useful":0,"cool":0},"eHY2ye8rtlHgp-CCozt29w":{"text":"What a great hotel. Our room was clean and beautiful. The air conditioning worked very wel","useful":1,"cool":0},"qonoVEJIs2ss7QqbKSoO_w":{"text":"My friend and I stayed in rooms at this really terrific hotel last week. Both with courtya","useful":2,"cool":1},"yK9LZSVaeTT33xOi0LqVpQ":{"text":"Absolute RAT HOLE of a hotel. My husband and I flew into New Orleans the day after we got ","useful":1,"cool":0},"EDkh_ziJuVW4BeJeNaN-PA":{"text":"Loved everything about our stay here except for the smokers in the courtyard and poolside.","useful":0,"cool":0},"eqBvF-MKsM3x8jipSer2fg":{"text":"My husband and I stayed the week of May 14 - 20, 2017. We requested and got the handicap s","useful":0,"cool":0},"gxEWJihMI0vwpPG4Qn-zkw":{"text":"I gave this hotel a 5 star rating but not in the context of it being an actual 5 star hote","useful":0,"cool":0},"Q0hgIZPG7nIQczth8bE49g":{"text":"We stayed there for the national championship game and had things stolen from our room. We","useful":0,"cool":0},"3YOubK0LYKmpUiYmkoh5fg":{"text":"The hotel is conveniently located and the double room and beds were comfortable. The food ","useful":0,"cool":0},"JmD155bXsW1xp52QjpkorQ":{"text":"The Hotel St Marie, it has a great location if you want to hit Bourbon Street and not slee","useful":0,"cool":1},"4OAM9WH4PgkCKLQsb62HCw":{"text":"Heads up parking is $34 plus tip. About same price at at least 3 other nearby lots and we ","useful":0,"cool":0},"VW7vU2o_UoiIxnmQwZUwWw":{"text":"The hotel room was cute and although I did notice some wear and tear on the bathroom door ","useful":0,"cool":0},"OTYI7eloglkRo__UoHo_rg":{"text":"My friends and I stayed here during the NBA All-Stars weekend, and for the most part, it w","useful":3,"cool":1},"AOQFIEQeBQpGOxw7voVt3A":{"text":"The room was nice enough. It had a balcony overlooking the courtyard. I wasn't particularl","useful":0,"cool":0},"pdIsDbdGTmGxR89uHaVzMw":{"text":"We're so happy we ignored all the bad reviews on Yelp about this hotel! I will break it do","useful":0,"cool":0},"nsn86KH-Bb1ZiNK1NRPRsg":{"text":"That staff here is quirky, especially as they've recently been through some major staff ch","useful":0,"cool":0},"aXxRmx9Yt4Lg5pEz8ckhGA":{"text":"Stayed there for a few days while visiting NOLA. The hotel is centrally located and one bl","useful":0,"cool":0},"GzoK8XzLFTHicFjxJW-F2g":{"text":"This hotel was exceptional for the price.  Yes, the rooms are a bit older, but everything ","useful":1,"cool":0},"Xu28jQeFt1ASVewCID70gQ":{"text":"This was our first time in New Orleans and Hotel St Marie was a great place to stay. It wa","useful":0,"cool":0},"n5Nr47TSCB3XJ6fefhvevw":{"text":"We stayed here for 3 nights last week.\n\nNice place, Very helpful staff.\n\nBeware of the \"Up","useful":0,"cool":0},"O_UeBYKpfEo-KUDFGKgsQQ":{"text":"Haven't had the pleasure of staying here yet, but ducked in off the street to ask the conc","useful":0,"cool":0},"yzNjSRXkVgEDjNRbSzzXxw":{"text":"If you want to stay near the heart of Bourbon street, this hotel will certainly put you th","useful":1,"cool":0},"E48h5iFpsixQhKzaMd81tA":{"text":"Just finished up a 5 day stay at this sweet hotel. We had the big suite with the large liv","useful":0,"cool":0},"CeVOHXyvlVdKrwwjanBUUg":{"text":"My husband and I came here for our honeymoon for  a week. Great price, even better staff! ","useful":0,"cool":0},"sTjCxCQI3jXhJg3T0whZAg":{"text":"Hotel st Marie is an authentic hotel in the middle of the French quarter, a half a block f","useful":0,"cool":0},"Wx_Ys6sVZFztijla3GVhTA":{"text":"Just stayed 2 nights at the Hotel St. Marie. We booked a room with a court yard balcony & ","useful":0,"cool":0},"0alKtFyodKOmAYFKACJhQw":{"text":"Our third time staying at this hotel. The staff is super friendly and accommodating. If yo","useful":0,"cool":0},"PCU2GZGyK7E3JwT4kQoDmQ":{"text":"Stayed here with my wife and have no complaints at all. On check in they stored our luggag","useful":0,"cool":0},"tjn_zRJ6PZ0-pqKXvUeAWg":{"text":"I was on a hunt to find a hotel within walking distance of Bourbon St. at a discounted rat","useful":1,"cool":0},"ZIU-SfRX08_O8WgEIW8roQ":{"text":"Location Location Locations- near the action but away from the noise.  We were situated pe","useful":1,"cool":1},"AgwusS4mSTzrrSB5rinZGA":{"text":"We booked this hotel online at a steal of a price. The staff were friendly and the hotel w","useful":0,"cool":0},"11fxK8AgL9Y2VX_6r6v6YQ":{"text":"We just had to share our interesting story with everyone.  To begin with, we enjoyed our s","useful":1,"cool":0},"sX31natU61tvUjCE_xQ3wQ":{"text":"I stayed here in 2005 about a week before Katrina hit while on a road trip with friends. I","useful":0,"cool":0},"ixoF2GwG4uSTsoCCkBtTHQ":{"text":"We stayed here last week and had one of the most comfortable stays in the French Quarter. ","useful":0,"cool":0},"N7JX0tXyuqjsKYdHYFvPGg":{"text":"For the money that you will spend on this place, get a room four blocks away in the Busine","useful":0,"cool":0},"lIBVwYbbgmm1cylpksHESQ":{"text":"The location of this hotel is incredible. About 10 steps from Bourbon which makes it close","useful":2,"cool":0},"8XIX-gN6hY5zm2_GDVZrwg":{"text":"We loved our stay here. The room was spectacular and we loved the balcony view. Keep in mi","useful":1,"cool":0},"meuzx2TT3coUzqAUCTsbMw":{"text":"The most unprofessional, non hospitable,  front desk ever encountered, bittered the entire","useful":2,"cool":0},"vfcshpu2eec6hTr1cP9QaA":{"text":"Got a double bed room for only $58 night during the middle of the week. Valet parking was ","useful":2,"cool":1},"mGyZ8C53tRtRIK2p-QwKVQ":{"text":"We're staying in room 101 on the ground floor, obviously a former basement or garage.   No","useful":0,"cool":0},"B76oYXCtBo3RI2CYMKIFrQ":{"text":"I love this place! You can see all the history around you and you're a short walk away fro","useful":0,"cool":0},"TOjFgLyyhDReaonkNH-LSA":{"text":"Looks like an authentic New Orleans hotel but with all the upgrades of USB ports etc. serv","useful":1,"cool":0},"i8IcazD4OiGNb_aod0QoHg":{"text":"very nice hotel although still under construction in places. amazing location and very com","useful":0,"cool":0},"dCHp6nKVKOIeQy0Oov7iww":{"text":"Convenient to Everything French Quarter\nWe had a family/business stay at the Hotel, so it ","useful":0,"cool":0},"qPUygTwSRmYvI44VklHxtg":{"text":"If you want to be able to enjoy the noisy energy on bourbon street and have a quiet, upsca","useful":0,"cool":0},"b_bD3sKpfWJa8Jr0M1uB6g":{"text":"My girlfriend's and I LOVE this hotel. It's very clean and well kept. The staff is wonderf","useful":0,"cool":0},"Z1-EJ8EukY5C_zAz25tgAg":{"text":"The hotel is lovely looking but the customer service is beyond horrible. I asked if I coul","useful":0,"cool":0},"SrWRFRPjriJc-_WoIwlVGw":{"text":"My family and I stayed here and from beginning to end it was the worst experience. The rec","useful":0,"cool":0},"04QAuyu7ZVzc8on2h-ESiw":{"text":"Floors in rooms were sticky. \n\nBut the balcony was awesome. And the price for being 1 bloc","useful":0,"cool":0},"FW9PgELAKVLFg-mlEQP9wA":{"text":"This is the place to stay. My room was super clean and mostly importantly right in the mid","useful":0,"cool":0},"Gh-m6w2CR6TJ4kIno5-2Jw":{"text":"Scam.  Best way to describe our experience. We had 3 rooms  for 3 nights booked for 3 coUp","useful":0,"cool":0},"IRrJRi7Fi0hu0YON2MXniQ":{"text":"Amazing service from start to finish. Totally worth the money. It is right next to Bourbon","useful":0,"cool":0},"VJJq5iiPg8V1sIbRf_oH3g":{"text":"I am giving this hotel a 5 Star because of its location, friendly Staff and cleanliness. F","useful":4,"cool":3},"S5k-PO8Cxfe13GrookIk0A":{"text":"Beautiful hotel. The staff was super nice and helpful. The parking attendants were so nice","useful":0,"cool":0},"3kk2ldsSa4ZkKwZ--5GBRg":{"text":"Last minute weekend getaway to surprise our niece for her 21st bday. The family reserved a","useful":0,"cool":0},"j0IqwszfP6hQBoLrtlXDiQ":{"text":"Have stayed here multiple times and the rooms have always been nice and clean. We were in ","useful":0,"cool":0},"oz1YIctp9bj-fdDoUlzeKg":{"text":"What a complete disappointment go anywhere but here. Old and nasty not in a nostalgic wond","useful":0,"cool":0},"f_v_m4fqVJ26bf_fPt2zdw":{"text":"We stayed here for 5 nights with our two young daughters and everything was wonderful.  Ri","useful":0,"cool":0},"ca0CXCYLm7kg50wu8MOebg":{"text":"LOVED LOVED LOVED staying here.  The rooms were quaint and charming.  Hotel management and","useful":6,"cool":4},"0LrIKEtB6OZaVfIu8jpbFA":{"text":"I would've given less, honestly, had the concierge guy not upgraded us and given us a bott","useful":5,"cool":0},"8DOcYvjw2yNEZEtD5pGsZA":{"text":"My wife and child stayed at this hotel for almost an entire week.  We booked through a tra","useful":8,"cool":10},"tCES43Ldt6X-T-NvVTnPMQ":{"text":"This is our all-time favorite hotel in New Orleans French quarter... The rooms are much la","useful":0,"cool":0},"rOaEoGBDw1fgAvLeFMr9NA":{"text":"Great location, Bobby and the staff made my trip worth it - especially in hard times.","useful":0,"cool":0},"EZ9EmeYsgG-lNyOWee6m6A":{"text":"This place is in a really cool location, and especially nice since we had a balcony room. ","useful":4,"cool":0},"tEb7MNAXJe5n4daGtN2F6g":{"text":"Likes: convenient walking distance to most tourist attractions in the French Quarter, rela","useful":2,"cool":0},"E6xaTe8sa8G1ZFFqEfs04A":{"text":"So I've never actually stayed at this hotel so I can't give an honest rating on the cleanl","useful":0,"cool":0},"8Y1_Ts-jf__SgDmOM4I0kQ":{"text":"We always stay at Hotel St. Marie when in New Orleans.  Easy to get to, smack in the middl","useful":0,"cool":0},"JaKnQy028u_Y3dudWiFBkA":{"text":"After reading some of the reviews I will honestly say most people were incredibly harsh wi","useful":1,"cool":0},"YSSeQU5jpcizkF4opnL0rA":{"text":"Such a cute little hotel one block from Bourbon street. Perfect for walking to cafe dining","useful":1,"cool":3},"5322pjAMfKckXlpdOxnwcw":{"text":"I just found out this hotel charges 1 day of booking to reserve a room. So, in my case tha","useful":2,"cool":0},"IcTik3cBaaYmKGQDV52hcg":{"text":"This boutique hotel is well appointed and perfectly situated in the French Quarter on Toul","useful":3,"cool":1},"wu0chPccJU1Y5DZO_zUwdw":{"text":"Crazy Bernie checked in on 12/29/18 for a 3 night stay ending Jan 1.  Booked pretty far in","useful":2,"cool":0},"aA7hncU-BGiZW6AsrVDWcg":{"text":"Make you wear wrist bands starting the weekend before Mardi Gras (Fat Tuesday) till Wednes","useful":1,"cool":0},"XpO7IrNe_2uw-wGHQ2ZYng":{"text":"The Hotel itself is fine. But, we had booked balcony rooms, and when booking requested str","useful":5,"cool":0},"zAvShD_SFBBv-GzqyVLi7g":{"text":"Great location, great price. \n\nThis place is only a block from Bourbon St and allowed us t","useful":2,"cool":1},"gCJ0V_H0o5aOcjhBAyZC-g":{"text":"I would give it 3 1/2 stars. We did enjoy the location in the heart of the French Quarter.","useful":4,"cool":3},"GZ-YbD2QJFx2ZAcI1YJMxw":{"text":"Opted for a balcony view of the road and we were not disappointed. We had a great stay. Th","useful":1,"cool":0},"e2mD4LRlvQX_zuOigzrUZg":{"text":"Thoroughly enjoyed our stay at this hotel. We had to move to a two-bed room for our last n","useful":0,"cool":0},"U3jAjvLseuZRjTQefr9kLg":{"text":"This is where my mom and I stayed on a recent visit to New Orleans for a four night stay. ","useful":4,"cool":1},"YJf5ihSDGFjgLuRlTJ9ntw":{"text":"Great New Orleans hotel in the French Quarter. Neat views from balconies. Quiet courtyard ","useful":5,"cool":3},"LJQpYR-8OcpNzECmd5MUhA":{"text":"Staying off the main drag was perfect for our large group. We could have had a better hote","useful":0,"cool":1},"XhQGxW7uYYvVOyuZalaVKA":{"text":"Don't often get the opportunity to stay at a French Quarter hotel, but glad I chose the St","useful":5,"cool":2}}