{"IBgy8FT3QBSpIau7Lm9RCg":{"text":"If you are looking for the most tremendous Muffaletta in New Orleans, do yourself a favor ","useful":0,"cool":0},"OguvAwitUxthHhCJKBlzGQ":{"text":"The greatest Muffaletta sandwich ever. It's just that simple. I live in New York and have ","useful":0,"cool":0},"RiEBWgC8wzDogNt-ZfifzQ":{"text":"sooooo worth the wait! if there are two of you, share the half and if there are four of yo","useful":0,"cool":0},"cKZxH-uYmQ74Dp-AavKINw":{"text":"I have visited New Orleans a few times.  My two things that I want every time I go are bei","useful":1,"cool":0},"MpW5PbDr9O3TCFGsMz9Hgw":{"text":"Awesome muffuletta!! Very flavorful and a half was enough for 2! We bought the olive salad","useful":1,"cool":0},"4ZF7KtTySbFvpXMDzneYeQ":{"text":"Best Muffaletta I've EVER had, and I'm an Italian who's had a lot of muffalettas. Yes, its","useful":1,"cool":0},"0ieq4Tu3UR9lsGo8ByTl3w":{"text":"I love Po Boy's but it may be the Central Grocery muffaletta that blows my mind. I've had ","useful":0,"cool":0},"eAIh9zfW6fUk5MX-HhUb1g":{"text":"Delicious muffuletta sandwich worth the 30 min line wait.\nService not friendly.","useful":1,"cool":0},"mMD8_JNopRQ0GzsCKOJs9g":{"text":"A trip to NOLA isn't complete without a Muffaleta, and Central Grocery is the place to hav","useful":0,"cool":0},"Yra2zaQSl5qeQGB8SrmHdQ":{"text":"First time in New Orleans and heard this muffuletta was a MUST.. so true!!! Fast service a","useful":0,"cool":0},"0pHI914wTiymwnRWfojqKQ":{"text":"The original muffulata! It's really awesome, and that's the only thing on the menu at the ","useful":1,"cool":0},"tqvZdil82i4BubqQ0TyQ5g":{"text":"I finally had the famous central grocery muffaletta and I am impressed! It may be cliche t","useful":0,"cool":0},"nSRxX_MO71VVlZ4sBcKXiA":{"text":"My first experience here was about 6 years ago on a trip to NOLA from Orlando.  I grew up ","useful":0,"cool":0},"o00Jf6yuH04bfAeZOeRZOA":{"text":"Sorry to say I didn't eat here because we ate the muffuletta at Napolean House, which serv","useful":0,"cool":0},"QJhLW-s32-GbzbL9xnJH4g":{"text":"A friend of mine recommended that I stop here and get their famous sandwich, so I did. I w","useful":0,"cool":0},"0bCofbMIc8vJu1n8c_eJLg":{"text":"First time in the French Quarter and we decided to get a Muffuletta as we wanted to try al","useful":1,"cool":0},"0594tiNGRd_p9fZaVVhscg":{"text":"For everything I've heard about this place, I gotta be honest, I didn't love it. The olive","useful":1,"cool":0},"ufX9Vh0hUv9fEgEP7-DbVA":{"text":"Omg!!!!THE BEST Muffaletta sandwich in town!\nIt's huge, so for the first time take only ha","useful":0,"cool":2},"rxXhJYgK95Pak78ov4kZhw":{"text":"Best place to get a muff! And fun to browse the groceries also.. if u love olive salad thi","useful":1,"cool":1},"vILYOTmqzT_9qujBTfmKhw":{"text":"I'm giving it 5 stars.  I have to:  They had Spanish (not Mexican) chorizo in the meat cas","useful":1,"cool":0},"pvtSbBJjSotrKKR9Xy007A":{"text":"Amazing! So worth it. A perfect sandwich!!  Be sure to add a bag of Voodoo chips. Staff ar","useful":0,"cool":0},"h9TufK5rU2rmaGR5-Y6WfQ":{"text":"What is a Muffuletta and why should you stand in line for 30 minutes to get one? \nThey are","useful":2,"cool":0},"NGRPwcQ2tNKMdqoI73lW1w":{"text":"My wife and I split half a muffuletta and each had a bag of chips. Perfect size lunch. It'","useful":0,"cool":0},"4ghT0p3Vo0YHP0RsbCgNug":{"text":"I got a whole muffulette to-go for the two of us to eat on the way home to CA and it was t","useful":4,"cool":1},"VJwFDgaAnC1I1ZxhFM3k1A":{"text":"I can not go to NOLA without eating here.  Never disappointed best ever and you won't regr","useful":1,"cool":1},"7_WvTnMHOY5PvxtdXIQROw":{"text":"Went around midday on a friday. There were around 5 people in line. Not too bad. Not too b","useful":0,"cool":0},"tMpUexbNn0jFT7fymo9wLA":{"text":"Not sure if the line of tourists is always as long as we experienced, but aside from the t","useful":0,"cool":0},"lWJZOfY6djm_wk2R9Ith1w":{"text":"Absolutely delicious muffuletta! I was actually able to split the half size with my husban","useful":0,"cool":0},"iDI3yb29yVlva7Ge6LpTYQ":{"text":"Oh, beautiful muffuletta!\nThe line moves fast here, and any wait is well worth it.\nThe ses","useful":2,"cool":1},"_GJXGRZSA74DJKBOWab5kg":{"text":"the only thing you need to know is that central grocery makes the best muffuletta you will","useful":0,"cool":1},"AtgBr17IKM--cO4yan6Nuw":{"text":"Okay, so this is the only place in town to get a really fine muffuletta - a quarter is usu","useful":1,"cool":0},"j4HMyTi1XhduS1ZmeoVrAw":{"text":"This place was recommended to me by a friend who lived in New Orleans for several years an","useful":0,"cool":0},"Y1wE_b8WOQvZwI8U1fHkCQ":{"text":"I have been here before but never tried their muffalettas. Boy did I not know what I was m","useful":2,"cool":0},"cw5XZp9Up48d69R5AXDaVQ":{"text":"Greatest muffuletta ever. The olive salad with the sandwich seals the deal.  If you are in","useful":0,"cool":0},"nryL_OwSULXLgRiWOANJnQ":{"text":"I don't really care for olives....& ended up having the stuff shipped to me!!! Must come h","useful":0,"cool":0},"70iZ4OhMCv1jURPtYLwdDg":{"text":"This was my first time having a muffaletta. I was told it was the best in town. \n\nThere wa","useful":0,"cool":0},"vLuydqGg-AD7cbQ5NW0Y4w":{"text":"The best muffaletta in the Quarter! The olive salad is perfect, the bread is fresh and cru","useful":0,"cool":0},"6JN-aNZYbH2UlR0720DOuw":{"text":"Still hands-down the best muffaletta, anywhere. Worth the wait in line. And, they even tra","useful":1,"cool":1},"ct7er6ryHRW75FFsFF8Chw":{"text":"Quietly doing what they do...and have done well...for nearly 100 years I guess.  A gem on ","useful":0,"cool":0},"YAro42Q-Tca2hFwk-eF4ww":{"text":"I have never tasted the muffuletta before.  This was my first and I am glad we ate it from","useful":0,"cool":0},"tMr-ZiJIG55wCRPZ6bYfnA":{"text":"Since my first review 4 years ago Central Grocery has hit a serious tourist bug and the re","useful":4,"cool":0},"aoSxPVtaCLxPnyDEu595pQ":{"text":"An essential part of the New Orleans experience.  My wife and I have been coming for sever","useful":0,"cool":0},"xoSvr5uBQcx9pfNuKJAzxw":{"text":"Stopped here during my first visit to New Orleans and really enjoyed the muffaletta sandwi","useful":0,"cool":0},"_DxImg6-4mTE3reN7rdW5A":{"text":"Finally got here it fast short and sweet food is exactly what it say wonderful and fast. S","useful":0,"cool":0},"4AiOaYk7cWqk_DbC1UXqhw":{"text":"Oh man! Haven't been here in 4 years and it was just like the first time I had one. The po","useful":0,"cool":0},"7IH-XVX8q51F7fmAtnr4Pg":{"text":"We were told we couldn't leave New Orleans without trying the Muffuletta at Central Grocer","useful":0,"cool":0},"3UjAnSRamaFevjcSUHosiw":{"text":"Must do for a stop in New Orleans. Half is PLENTY for one person, if you're really hungry.","useful":0,"cool":0},"udItAXCY7poHnJukR9q6rw":{"text":"Recently when I went to NOLA to celebrate my birthday, I had 3 places I wanted to go: Cres","useful":3,"cool":0},"bsjlxtdm6UX-SBMpn8iqJQ":{"text":"CAREFUL OF DAY OLD BREAD THEY GIVE YOU AFTER 3PM or so!!!  NO atmosphere, they closed they","useful":0,"cool":0},"iySYqSGpNwe1Yg97cGmKuQ":{"text":"Don't be intimidated by the long line. We waited for 45 minutes, but it was more than wort","useful":0,"cool":0},"4xE3CYsn1obVk_pnSa9i4Q":{"text":"The sandwich was awesome...people dont line up for this sandwich here because it was inven","useful":1,"cool":1},"wOEGUXd8eurahUrRMYrL5A":{"text":"OMG, Muffuletta!!!  I'm not a huge olive fan, but it doesn't matter on this yummy sandwich","useful":0,"cool":0},"bne8as0_WUWD0u7Ptp8QvA":{"text":"Hands down one of the best sandwich's i have had in a long time.  If you're in NOLA make s","useful":1,"cool":0},"ncdDy6-A7Mxsq0Fdpz3ubQ":{"text":"Central Grocery has exactly one item on its menu - a muffaletta. Signs throughout this sma","useful":4,"cool":5},"e3kgTG-JCEQRu2YeCWucJg":{"text":"This place is legit! As a first time visitor to Nola, I wanted to try as many of the legen","useful":0,"cool":0},"CEcg8ni-ODq1rsBPXOcRYA":{"text":"I've always wanted to nickname something \"The Big Nine-Incher,\" but alas, I've never found","useful":4,"cool":6},"6WLCN_6tZ-3AxIwHvLFbMQ":{"text":"If you're in New Orleans you must come here.\n\"Home of the original Muffuletta\" and it's al","useful":2,"cool":0},"waMBHkKPI6nCNiVBt_56Kw":{"text":"Order the muffaletta. That's all you need to know.","useful":1,"cool":2},"u7_C-F5cZvoMjZD06fXEog":{"text":"The smells hit your nose when you walk in.  Olives, cured meat, old wooden floors.  This i","useful":0,"cool":0},"dcxc2KBWUmV2hIPczSWE8w":{"text":"New Orleans, home of the Mufaletta sandwich.   You must have one. It's huge and can feed t","useful":1,"cool":0},"hOf_525jCfXNDQLIhGL9fg":{"text":"Omg must try! You have to go here for the muffuletta. This sandwich is soooo delicious and","useful":0,"cool":0},"8IOPmSgildfqzMfBQSrGbQ":{"text":"Central Grocery may have been the birthplace of the muffuletta it certainly isnt the best ","useful":4,"cool":2},"Dfoawa3_U2N8X9UZhbT19Q":{"text":"I'm having Wet Dreams longing for this sandwich again. OMG. the olives on top, all the mea","useful":1,"cool":0},"S7XvW8tJNf-VKGHhgJpxzg":{"text":"Came here after seeing lots of good reviews and a must-go place in New Orleans. The sandwi","useful":0,"cool":0},"W1wt-U39rwr58cPab0SQLg":{"text":"Short and sweet I'll keep it. If you do nothing else in New Orleans go here and get a muff","useful":0,"cool":1},"fyhvk6a1dm3-C3Pq03aLIQ":{"text":"Best Mufalettas in the quarter. I used to spend my afternoons sitting here enjoying a sand","useful":0,"cool":0},"Ee0Y3axI5O231IBdPFZaRg":{"text":"It is the \"Home of the Original Muffuletta\", which is an incredible sandwich. The Muffulet","useful":0,"cool":0},"EiHwFF6z7GkrgsraBADmRg":{"text":"Great sandwich, copied by many. Whole one is about $20, half $11, and quarters. Bottled be","useful":0,"cool":0},"PfIiTZsXf9SDtZDq5NHlPg":{"text":"I'm not even a muffalata guy but these were great. I liked that you can get a 1/2 and it's","useful":0,"cool":0},"VOrPpRZplWxZ9ymkA_p6hQ":{"text":"Love, love, love this muffuletta. Hate the name, love the sandwich. Central grocery's oliv","useful":1,"cool":0},"VXo3qiCfQH8xLIcFIRFolg":{"text":"The single star rating is NOT for their Muffaletta's. Those are great but rather for their","useful":2,"cool":0},"-A_FNuXCahSUO4A37fBOtw":{"text":"Sure it's the tourist thing to do, but I thought that was a fine muffaletta.  Maybe it's b","useful":0,"cool":0},"m_YS5Rlo32LDmcCGH-iTtw":{"text":"Muffaletta.  A huge delicious $20 circular Italian cold cut sandwich with sort of an olive","useful":1,"cool":2},"HJxiP7x9LMytsHKI2j4c4w":{"text":"The muffuletta was just amazing. Half a sandwich was good for 2 people, but I seriously su","useful":1,"cool":0},"7XJzQSHn5S-olz8VK2D3EQ":{"text":"the ONLY muffalettas in New Orleans.  So good I froze mine and took them home to San Diego","useful":1,"cool":0},"Ym_ppwVNJNntjvJzxm_L-A":{"text":"Muffulette, gotta love them.  Nice staff, modest price in spices and seasonings/hot sauce.","useful":3,"cool":4},"R3XA5nY_9bW4Cn7fKTLI0A":{"text":"I am so lucky to have been brought here by a friend-- and New Orleans native-- for my firs","useful":0,"cool":0},"kGiTRbBFE0Y6CFtxgrrr5A":{"text":"When you visit New Orleans, you have to stop by at least once at Central Grocery and sampl","useful":0,"cool":0},"z5O81JgJAbsnRf0Bp3G5wA":{"text":"almost a year after my visit i am still craving a muffaletta from here on a daily basis! i","useful":2,"cool":0},"2uzNG1Gx20bmf-EjxbED5A":{"text":"Good muffaletta.  I am not a fan of olives, so I was easily able to take them off and eat ","useful":0,"cool":0},"xmJ80SXf8URJkdhvZROUbQ":{"text":"Decent selection of spices, candies and random grocery supplies.  Which of course has noth","useful":0,"cool":0},"SuaZUPv6sk0vbGyGHpxbDA":{"text":"5 stars for the muffulettas, 3 stars for the grocery. The line was a bit long, but moved r","useful":2,"cool":0},"qiRFPGt3bXHuAMiGWh555w":{"text":"Eats: Muffuletta\n\nTHE place for the MUFFULETTA! Don't go anywhere but Central Grocery for ","useful":1,"cool":0},"5fWSF3uxHKe5E8O4i7ERUw":{"text":"I was so disappointed. I grew up with their muffaletta and now they've changed the bread a","useful":1,"cool":0},"SjzEHjtHi4wfHu_fg7MJXA":{"text":"Way better than I expected.  Perfect sandwich in every way.  Half is a lot of food, and a ","useful":1,"cool":1},"KBsqVtOfK3tNuJ4p0VS1EQ":{"text":"The store is loaded with Italian goodies and some local items. A pleasant smell hits you a","useful":0,"cool":0},"SvWX1udyy4bG6m1J1Zqq5Q":{"text":"Muffeletta is one of those you really must try this while your in NOLA items and this is t","useful":0,"cool":0},"M6a3CBIKjGpZNMLeAJadPQ":{"text":"Great atmosphere- we wish there was more room for people to sit. Muffulettas were wonderfu","useful":0,"cool":0},"J0ORrDKaXnXFab-14XmInw":{"text":"The muffuletta at Central Grocery was much tastier than those that I tried at other places","useful":0,"cool":0},"yvJQNO6nFBUWlUL_bCW5oQ":{"text":"Went there for the Muffuletta, like everyone else, based on a recommendation by a coworker","useful":0,"cool":0},"TyLL1NK_1kZ0QnualmwqQw":{"text":"Heard about this place and decided to check it out.   Quant and tranquil Decatur Street ar","useful":0,"cool":0},"Zszm6Bq6qq5uxydRu0TIjA":{"text":"One of the places you must try in NO since it's the birthplace of the muffaletta. You can ","useful":0,"cool":0},"JBejVP1F1Dznm1f68AhXdw":{"text":"Looking for the real thing this is it. Best Muffaletta. First we had a half to split the n","useful":0,"cool":0},"ecmMW8_YH-VXS9OoVeRrkQ":{"text":"One of the places that you see on Travel Channel-type shows that you need to check out if ","useful":0,"cool":0},"NW3MXcB4pIZvUcAGxs7ghQ":{"text":"Made the mistake of ordering a whole muff for just the wifey and I. Ooooh my! Way too much","useful":0,"cool":0},"S9tPuTjpORLl7rLIY1fSLQ":{"text":"It's huge, and tasty, and they know it to be charging $18.  Worth the splurge though since","useful":0,"cool":0},"e8w8Qd1Lp_ocF1DxjQ4BTA":{"text":"I don't have much to add to other Yelp reviews. Get the Muffuletta!","useful":0,"cool":0},"ymGU56DeZ8x3fE74AAFsCQ":{"text":"Winner of the muffaletta taste test. \n\nHusband and I got a half, took it to a bench by the","useful":0,"cool":1},"S42t0KwQpsDDnZ4XtzW_FA":{"text":"Long line but it moves fast and is worth it.  I don't even like olives and I loved the muf","useful":2,"cool":0},"eXUNLhAXCxPZ0D13koixYg":{"text":"Yes, it's full of tourists.  Yes, you'll have to wait in line to order (and yes, fellow pa","useful":1,"cool":0},"4_aujtn37AgMlGPtNhnJmQ":{"text":"Super small space. It's really got that old school vibe going on. I wanted to eat everythi","useful":1,"cool":1},"phDWWQLDEtQTn_TTa441fA":{"text":"Incredibly rude and unprofessional staff. Overpriced, underwhelming, preprepared sandwiche","useful":0,"cool":0},"xJLQaISMNH0aii0VhMdh4A":{"text":"I will keep this short and sweet because what else is there to say about this legendary gr","useful":0,"cool":1},"fmAeOG73HuaiNhZht0_x9Q":{"text":"Went for the muffaletta sandwich and wasn't disappointed. Huge sandwich with big bold flav","useful":1,"cool":0},"8zmoZdHiufWqqR2n7snUSQ":{"text":"The smell of this place lures people from the minute it hits your nose!!! Walking down the","useful":0,"cool":0},"i3C5XdgnL4QJx2GQ2VfeUg":{"text":"Loved the muffaletta, and I didn't think I would, because the individual parts aren't some","useful":2,"cool":0},"E92nLgpk7Ojp__l5Sswbww":{"text":"My husband was dying to try a muffeleta, and after some yelping, we found that Central Gro","useful":2,"cool":2},"gTr-AxbVBdMa-cWgWKPUng":{"text":"The line to get one of these famous muffaletta sandwiches was out the door and around the ","useful":0,"cool":0},"-m1-ES5U0ciKlQguykPdMQ":{"text":"Central Grocery is known for making a great muffaleta sandwich. The Muffaletta Italian bre","useful":1,"cool":0},"mRsNlg4GQswFv8IqoSVnOQ":{"text":"This being my first time in NOLA, I had to try the muffuletta. We got the whole sandwich, ","useful":1,"cool":0},"5CwuHhDQPnG8Mv7EPHvkCA":{"text":"After wanting to try Central Grocery on every past trip to NOLA, I finally made it in this","useful":0,"cool":1},"UeJO_PSjslQeekCCZTQQ2A":{"text":"Delicious sandwiches that travel well! We get a couple whole (HUGE) sandwiches and eat on ","useful":2,"cool":0},"-BNxub86B2D0mSIyuGemAw":{"text":"Just go here now. Grab three friends and an empty stomach. Split a while muffuletta betwee","useful":2,"cool":1},"UHxN_DojYDUk5yeBqY2VHA":{"text":"Absolutely delicious.   Their mufallettas are not to be missed.  You can also buy their ol","useful":0,"cool":0},"dvG3qNpGswMD81YVZmyTSg":{"text":"Everyone talks about the muffalettas here, and for good reason.  This was only my second v","useful":0,"cool":0},"8yRae34SgW4elCbHlTpk7g":{"text":"Came here for the muffulettas. One whole muffuletta was as big as my face! My boyfriend an","useful":0,"cool":0},"4lCpXSR1YsTTDjOJGgMrUw":{"text":"Yay, I'm a fan!\n\nI keep going back to what Yelp says is 4 or 5 stars with these. I liked t","useful":0,"cool":0},"alHo0xHdsdgsnhNsXsaMVg":{"text":"We went there for their renowned muffuletta sandwich. But this nifty store actually had a ","useful":0,"cool":0},"kPHpP8vFP-PJ4iapACQjDg":{"text":"Central's muffuletta is, quite simply, one of the best sandwiches on the surface of the pl","useful":0,"cool":0},"k1QrsikdpCwpomyYL2gGAg":{"text":"Central Grocery Muffuletta gets 5 stars all the way!\nThis review is based on the Muffulett","useful":0,"cool":0},"rdDlHnC5O3vMd0ry2AbLAg":{"text":"Food is yummy for certain.... Wecrave it every time in town. Unfortunately the owner is a ","useful":0,"cool":0},"dmMCiUugr1KwrpEYUTfw8g":{"text":"Going to New Orleans without having a sandwich at the birthplace of the muffelata (pronoun","useful":1,"cool":0},"nAQYapbvLpQ5R5iMGGm19g":{"text":"My fiancé and I came here because I love muffulettas and I heard this place was the best i","useful":1,"cool":0},"JwKt9biocmQ2bO3oLqIbCQ":{"text":"My first stop! Muffaletta was just amazing! Was also our last stop before heading out to a","useful":0,"cool":1},"XSxFiFcdXPgWBiu1fQvaTA":{"text":"The best mufaletta around.  Two people can share a half because they are huge.  We bought ","useful":0,"cool":0},"epFp2VDs9tXfHjQ-F6rHLw":{"text":"Yaaaay!  I waited in the car while my sweet girlfriend ran in to get us a Muffaletta \"for ","useful":1,"cool":0},"_OYlmm2Pk2DGpsi4xZdk-Q":{"text":"Well, poor planning once again.  We decided to go to the Cafe Dumonde for breakfast and th","useful":1,"cool":1},"3o7OQrjMT7S_czlsoIagaw":{"text":"The photos I see posted on yelp and other spots on-line looked nothing like the pre-prepar","useful":0,"cool":0},"JYYIrTiQRH--PHQV7P1RHw":{"text":"I brought a whole muffaletta home with me on the airplane, and gave half to my boyfriend. ","useful":0,"cool":0},"QRQMC3TxQAr_WBmiK_GXFQ":{"text":"One sandwich was enough for the four of us.  Really like this place.  Hope it's here forev","useful":0,"cool":1},"dU2-07xTdbj7JRNh830NHQ":{"text":"What a magical place. Not just for being home to the original muffuletta but for the amazi","useful":2,"cool":0},"StLlHECMKJ3BmEdL1UK5ew":{"text":"For many New Orleans visits after I moved to the Bay Area, Central Grocery was the unattai","useful":1,"cool":1},"Jg1TkF8oOOy-CA2WhbmXlw":{"text":"The muffaletta here is maybe the best sandwich in the world. I savored every bite! Every s","useful":0,"cool":0},"v5KeD0fWsj6ShbaGHOglFQ":{"text":"Best muffaletta I've ever eaten! Totally worth going there just to get one!","useful":0,"cool":0},"crI9nkRVu58R38ffADuK3w":{"text":"Central Grocery is a must stop for a trip to New Orleans. We always stop there on our driv","useful":0,"cool":0},"laO1Cfkk0oWD2lRCj_E8NQ":{"text":"The Muffuletta: Huge. Delicious. Savory. Tangy. A fantastic mix of flavors, especially com","useful":2,"cool":1},"8y8qGvHfADSUVPnyHkaPjA":{"text":"Erething happens for a reason & gettin here right @ 4:59 & being denied entry only reminde","useful":3,"cool":2},"1b01Ieu_UoDg_0qd8T0yQA":{"text":"The BEST muffuletta hands down!  I've been going here since I was a kid, and I will go her","useful":0,"cool":0},"mLhS_ihoJOVSbZnmtiKQNQ":{"text":"I'd always heard from my New Orleans contacts that the Central Grocery was the birthplace ","useful":2,"cool":0},"OJ4dDenowRVEoIoPd7VFMA":{"text":"They claim to have invented the muffuletta and as good as they make one I will believe wha","useful":0,"cool":0},"SRzfSYimwG-4pxUsW-gaSA":{"text":"The muffuletta sandwich was just okay. I feel its a little overpriced. I heard a lot of hy","useful":0,"cool":0},"c9usrcAWqTNmYAUblB4wDA":{"text":"This is the real deal here, folks. Home and creator of the famous muffaletta sandwich. Acc","useful":1,"cool":0},"5Re4biRfxhrNAg23fvXSBA":{"text":"one of my favorite places to eat in Nola. OMG so yummy - only one way to order the muffale","useful":1,"cool":1},"C7CD70BdoLE55p8RGfOSPg":{"text":"Yes. The muffuletta really is that good. I've been craving one since I got back to NYC and","useful":0,"cool":0},"dkXEpytPsiLbs30NQG74bQ":{"text":"I had never tried a muffuletta because I always thought it was a greasy sandwich. I did no","useful":0,"cool":0},"XjuTBNr1ZEtVTK7ewRsb-w":{"text":"The muffuletta here is amazing!! Luckily for us there was no line at all and we were in an","useful":1,"cool":0},"72qnub4g71rKecPr8cBSiA":{"text":"We really liked the atmosphere. Though we waited in line a bit it moved pretty fast and it","useful":0,"cool":0},"KPSpPuWoKCWRA0FfKXBIyw":{"text":"Got here at 9:30 AM, and what seemed like a tiny line of 8 people, ended up being nearly a","useful":1,"cool":0},"lM-PgV2Yhf__0RDLKr8L2w":{"text":"Holy Muffuletta. Go early or go late. Don't go anywhere near lunch or you will be waiting ","useful":1,"cool":0},"0DA_-hvH2g7J-kIr9d8APw":{"text":"Look, you either love CG's muffulettas like my family & I do, or you're not into them for ","useful":2,"cool":1},"L4BtX-T9h1aiZiR7vOS1MQ":{"text":"It is so worthwhile to stand inline for the original Muffuletta. Small grocery store with ","useful":1,"cool":0},"9r2j2Fy36rggmtWEQ2SaIg":{"text":"This is an Italian grocery store, first off, not a fancy restaurant, so when someone recom","useful":0,"cool":0},"wf_bBc5HfIIbgehw2AcsMQ":{"text":"Muffuletta! Totally earns the hype.  Such a simple sandwich but Central Grocery has perfec","useful":0,"cool":0},"g1BZb4RvwA1uSxW8EGytOA":{"text":"One thing to order - a muffaletta.  Awesome sandwich.  Wife and I split a half sandwich an","useful":0,"cool":0},"iTPcOwSMiOVv00Wq7zWBoA":{"text":"They churn out the sandwiches continuously and don't wait for them to be ordered which is ","useful":2,"cool":1},"F7xXusMgQxSerHU2LUYhvg":{"text":"What the heck is a Muffaletta?\n\nI thought it was a new part for a car, but I needed to fin","useful":9,"cool":6},"OGCekDUlfgbsr1y2N-TJ6Q":{"text":"We got a sandwich to take with us to the airport. It was good. Their was a line but it was","useful":0,"cool":0},"DsfJ9aKgSwv5b1YiWbUV8A":{"text":"It might be touristy as f**k but you can't beat the best muffulettas on this side of the M","useful":1,"cool":0},"OgB6-Z4s0wPyYwzmKVTfJw":{"text":"I haven't had one of these since 10 years ago & it is just as I remembered! It is so good.","useful":0,"cool":0},"JrWmje0sUc7UJywTSDJeRQ":{"text":"Ok, so I was told to try the famous MUFFULETTA and I have to admit, it was wonderful.  Mus","useful":0,"cool":0},"gjIKFhpK33Jnz3D3cVP5fw":{"text":"Ok I have been to new orleans so many times I can not count. But always thought of central","useful":3,"cool":2},"p8N7AUUiOAq0IB4md3VtUA":{"text":"If you like muffulettas, try one here. Aside from it being the original, this sandwich is ","useful":1,"cool":0},"H_e6fyktktVVa81oHx4tGA":{"text":"Do you like cured meats, cheeses, and pickled vegetables? Do you love antipasti at Italian","useful":0,"cool":0},"wLRLevEA_Z2bA0L2vAcVlw":{"text":"Stopped in for a muffuletta.  Got 2 wholes for the four of us.  Everything was impressive ","useful":0,"cool":0},"olYBsAUHohaF9VEDeZ4gwQ":{"text":"I visited here based on a recommendation from a professor that used to teach at Tulane.  I","useful":0,"cool":0},"Xq7FUQP82SYH07k12-G9Eg":{"text":"I went in specifically for the muffeleta.  It was delicious but the staff is very mean rud","useful":1,"cool":0},"eYQkH-IrcWZDG2CjZJMv1w":{"text":"I hadn't been to New Orleans in many years, but had fond memories of the muffuletta sandwi","useful":0,"cool":0},"vm9-KXgBLK9Z8fiA_7pk0A":{"text":"It's all about the olive medley. And the provolone. And the size. And the charming grocery","useful":0,"cool":0},"a0MzV_QJlIiGztf0RTZQkw":{"text":"Picked up Muffulettas on our way to a plantation tour. Absolutely delicious. I always look","useful":1,"cool":0},"Crh30brSLeQP0UtREul9Gw":{"text":"I had my very first muffulleta sandwich here with a client who insisted on coming here.  T","useful":0,"cool":1},"K-hv8ZhG7-BcejwlGA58nQ":{"text":"Came here with a few friends from out of town who wanted to see the quarter, left with hal","useful":0,"cool":0},"9D82WVgTsvp6ItX_La4Hzg":{"text":"The muffuletta is great! The olive salad is a great touch to this classic italian sandwich","useful":0,"cool":0},"iML93RBkt-tdVQ_YJJQOyQ":{"text":"I had the muffaletta  at central and I wasn't really impressed. The was barely any meat on","useful":1,"cool":1},"suhCIHyu2DQL_ZEHJjYzgw":{"text":"When visiting New Orleans there are certain places a visitor must absolutely not miss and ","useful":14,"cool":8},"i31AD-9pjG4jvHlTr0CR1Q":{"text":"This little grocery boasts the \"original muffaletta,\" and it's a few storefronts from anot","useful":2,"cool":1},"0gS8fWfXn1wxT0JbqrdhmA":{"text":"No question about it, while other restaurants can make a decent muffuletta, Central Grocer","useful":1,"cool":0},"9GM7nlRm4ccBeGnEFd18dQ":{"text":"Greatest, original, best, most authentic, whatever you wanna call it - it's legitimately o","useful":0,"cool":0},"FR2GdHDJyVRmNllA4KYqjA":{"text":"Yum yum!  These suckers are huge so try to share. I mean a whole sandwich fed three people","useful":0,"cool":0},"wPlVV42fTJhzOEoTE6icZA":{"text":"Well if this is the home of the Mufaletta, then the sandwich has died and gone to hell. Fi","useful":0,"cool":0},"wigWmToZS7Xv3qkz67sI_g":{"text":"This place is absolutely, positively, unequivocally the best place to get a muffuletta. Wh","useful":1,"cool":1},"1r3_g8nvlwfFQ8Ic96sS4Q":{"text":"I wish I went here every single day I was in New Orleans. Sadly, I was only able to try mu","useful":1,"cool":0},"RiF3HJlr2ugJDCYGFHsTrA":{"text":"In a city that is best for casual grazing...this place was perfect.\nNeeded some sustenance","useful":0,"cool":0},"5lZEzovjFQISN4NH9qCxRQ":{"text":"If you are going to be in the French Quarter, please stop by Cafe-Du-Monde, grab some cafe","useful":0,"cool":0},"vhddWNYLJ4WVNSEtVc7aHQ":{"text":"Sandwhich is good. Customer service though...cashier was shouting at other workets and cle","useful":0,"cool":0},"gSKrY7Rro85Is2AcxS6aIA":{"text":"First bite and you'll understand why the line is so long! Half a order is close to $10 and","useful":0,"cool":0},"HgT0L2N6bLzXXjgcL3kObA":{"text":"I LOVE their muffuletta! So beautiful, huge and yummy. My hubby and I split a whole but sh","useful":0,"cool":0},"d8Bhrgg3eTNO5hMg4-C2pA":{"text":"If you are in New Orleans, like good food and somehow miss getting a muffuletta sandwich f","useful":0,"cool":0},"mIsNy301-f8OenMH5kkXSg":{"text":"Lieu d'origine de la Mufuletta je me devais d'y aller lors de ma visite de la Nouvelle Orl","useful":2,"cool":1},"MUNkTdJwagwOmal4mj04wg":{"text":"Went in for the Muffeletta and a half sandwich is plenty for two people.  It was so good t","useful":0,"cool":0},"kjMxoSqc8C5QjaxO7loSCA":{"text":"Another city's iconic sandwich.\n\nPittsburgh has the Primanti's sandwich\n\nNew Orleans has t","useful":0,"cool":0},"okigUa2PO_o0mu6NdPNvcQ":{"text":"as soon as you walk in you think that you were shrank down to the size of an olive pit and","useful":0,"cool":0},"9z-VgT1L5ka2juXYPT9D7A":{"text":"Nothing like a muffaletta sandwich from Central Grocery. One sandwich is literally the siz","useful":0,"cool":1},"MkDjAOYZ7J7n6rEcU27UGA":{"text":"Great muffulettas!  Fun environment. Long lines and limited seating so try not to go at th","useful":0,"cool":0},"CgRDjmbgznlNNYyFdQNDWQ":{"text":"Muffalettas are amazing; this is the conclusion I've come to after eating one from Central","useful":0,"cool":0},"qYlVH4Ew35TdWMxygDnVhA":{"text":"Do NOT buy the packaged muffaletta sauce tgo ship home.  The seal broke but luckily I had ","useful":0,"cool":0},"nked1ZERFH_ea2BNPgUMCQ":{"text":"Grab the original Muffuletta here and nowhere else. But don't expect to find much variety ","useful":0,"cool":0},"X0f9-z51gSDOftiR2ksoUw":{"text":"Decades of consistent top olive salad muffaletta! A flavor craving only Central Grocery ca","useful":0,"cool":0},"NsYpR1Eqb2jegjVS88Mryw":{"text":"This is a must eat in the city. I recommend walking down to the Mississippi River walk to ","useful":0,"cool":0},"X-CyRufFUeBDJ4-pVd-WFA":{"text":"There is a reason why this place is famous.  The best deli sandwich ever, it is the olive ","useful":0,"cool":0},"CytzgSCj1zNm63A6ZReIlw":{"text":"whoever complains about the service of this establishment or the rudeness of the employees","useful":0,"cool":0},"nUWj99LMjLsiMnvW0Ht6oA":{"text":"You know, I don't even like olives but I had to check out the muffuletta!  It was super ta","useful":1,"cool":0},"gcoETNslD7pDScmG6pabqQ":{"text":"The muffaletta was delicious... fresh meats, crusty bread, and tasty olive salad. This is ","useful":0,"cool":0},"S4gZD3_ith0AmWpQxBtnSQ":{"text":"Have never had muffletta so wasn't sure what to expect. I was pleasantly surprised. Shared","useful":0,"cool":0},"MDbxxU7IUmF2IC8uEden6A":{"text":"Stop in for a Muffaletta dive and the extremely rude service. It's worth every bit of rude","useful":0,"cool":0},"dMBF5YIrulm9Kyfpl_T99A":{"text":"Oh NOLA, how I love to visit you and take a bite into the orgasmic muffaletta at central g","useful":0,"cool":0},"Uxdnii3eG_jOTnVoTfX7EA":{"text":"Muffalata!!!! This sandwich is absolutely freaking delicious. Its huge tooo. I bought a ha","useful":0,"cool":0},"ILFXVLbDjECWwAp5B-wWlQ":{"text":"I really had high hopes. Perhaps I should have listened to the locals who recommended othe","useful":1,"cool":0},"KUZNdI7B2nG0waDU1eUz9w":{"text":"A trip to New Orleans is not complete without going for the original muffaleta sandwich wh","useful":1,"cool":0},"xxTlp9qDJCBPiScxL2L8Zg":{"text":"I came in with basic expectations, I live in New Orleans and have eaten many muffulettas a","useful":0,"cool":0},"TZqNciunqjuEe_KjraJzhg":{"text":"Huge, delicious, original muffulettas. Enough said.\nWe went for our first time during Than","useful":1,"cool":1},"0vkoOzhOF8WrTxluD5PPAw":{"text":"Was advised by a tour guide to go here and try a muffuletta. First time having one in almo","useful":1,"cool":1},"JGfCYdl_v42osf7JU8CWIg":{"text":"I can only ditto what everyone is saying about their muffaletta sandwich.  It is the best.","useful":3,"cool":1},"xp0-AB9zdL22KFjKB5we0w":{"text":"The muffy sammich is worth the line that seems to move at a snails pace (why, the sandwich","useful":0,"cool":0},"CTYj2GC5YVHjGI5Uytehdw":{"text":"Damn near a perfect sandwich, the muffaletta is. Italian meats, cheese, and of course, the","useful":1,"cool":1},"lILvCUokQ1HYoDvqPGSwVQ":{"text":"There are only 2 places you should get a muffaletta from. My grandmother and Central Groce","useful":2,"cool":1},"1aQDNSw71LW4gORfTm_GYw":{"text":"Delicious sandwich and well worth the line outside. The counters inside are a great place ","useful":0,"cool":0},"G8niycMJfqqPJohsDKX3lA":{"text":"The muffuletta is insanely good but expensive (20$ for 1), yet it is so huge, It absolutel","useful":2,"cool":1},"bMtaiR6-BDhRHELRnYhsYw":{"text":"Delicious muffuletta with fair pricing, great customer service. This is a must stop in New","useful":0,"cool":0},"QSNFTtSjGfNitLvs2worMA":{"text":"Got the muffeletta.  I wasn't sure what to expect.  It's a good deli sandwich, but I'm not","useful":1,"cool":0},"28uCT8oFNmnPnDAenGLnuA":{"text":"Had the whole muffaletta sandwich. It was a lot of food. My wife and I could only finish h","useful":0,"cool":0},"YTrTg7AMSmyFnC7TtWv3cw":{"text":"Ok, Muffuletta was really good. Great bread, and large portions. Olive salad was really ta","useful":0,"cool":0},"lfp1ipkaeHn8r0fOMuFWeg":{"text":"Had to get the muffuletta. It was very, very good, but the combination of cured meats and ","useful":0,"cool":0},"TYLrDY6nEcymSIPcH2BGlg":{"text":"My absolute fav for stuffed artichokes!! Can't go wrong with a muffuletta sandwich and a b","useful":0,"cool":0},"qsygNZGs_FMyXZPtC2eUFg":{"text":"This is where the infamous original muffuletta was created. A traditional style muffuletta","useful":2,"cool":0},"w8mjEt7Jv0ftfLWm3TrUiw":{"text":"We came for the muffulettas! This place was filled with a variety of shipped groceries. Th","useful":1,"cool":0},"L-aHnu4-LTaKqO9yiEYO_A":{"text":"Sorry not a fan of the muffelata. Why isn't it toasted? Rest of it it basic. Olive salad i","useful":0,"cool":0},"UvgpBicNS_pAq7b9wp5fdQ":{"text":"OMG...so I read on Yelp that this place was good and as my friends and I landed in New Orl","useful":0,"cool":0},"rO2GMpeHYvrpmw3A5iUXVQ":{"text":"The Central Grocery muffuleta is simply the most delicious thing to eat in NOLA, a city th","useful":1,"cool":0},"-307MxWul2LWBCS2HXLo3w":{"text":"muffuletta--yesh! don't fear the long line, it moves quickly (but do watch and go in throu","useful":0,"cool":0},"uOhR-4zM8xSfDFfE50_JqQ":{"text":"Janice Umbenhower said to go here so we went here. You've never heard of her. Oh, that's b","useful":2,"cool":1},"rL4x6ZRM2ake8tVDS2DYow":{"text":"Oh, the muffuletta! The king of sandwiches! It makes a good Reuben look like a bum on the ","useful":4,"cool":1},"le9GoD0Ij7SwcRJ1CHsB_Q":{"text":"I have  visited New Orleans over half a dozen times in recent years.  Central Grocery's mu","useful":0,"cool":0},"w17clO9uC7Po8QjjgnbHtw":{"text":"I don't know what else to give it other than five stars. You want a muffuletta? You go her","useful":0,"cool":0},"h41x_8_QN3WF7DyIEr6nWQ":{"text":"It's been 14yrs since the last time I tasted the Original Mufuletta sandwich and with one ","useful":1,"cool":0},"bTyBYI4KTytgOxuHtxwcgw":{"text":"the muffalettas are worth wait! it's prepared ahead of time so the wait after paying at th","useful":0,"cool":0},"8jH2BjV4tvdX0WzDEJl81A":{"text":"O M G this muffuletta is so delicious!  Here, they are served cold. We split one & it was ","useful":0,"cool":1},"1CkdJ7yRP9HBcIQ5WBWpHw":{"text":"As a Louisiana native, I never attended to the tourist type restaurants. I'm 18 years remo","useful":0,"cool":0},"NDMqwapzHbSsTTIA4W4soQ":{"text":"I love stumbling upon FANTASTIC sandwich shops around lunchtime. \n\nI read Muffaletta and w","useful":1,"cool":0},"tz16B3YqQWSrUlmdiJtI7g":{"text":"Can't say enough about how much I love the muffuletta and of course had to buy some of the","useful":0,"cool":0},"Pgmiw69M5UzHirLHJ2bUUw":{"text":"Worth the wait; worth the money. Man this place is the flipping bomb. Buy the jars of oliv","useful":0,"cool":0},"IV3ZVYlxJqO3g6gzIGhByw":{"text":"The line was out the door but only took about 15 minutes before we ordered and got our hug","useful":2,"cool":0},"eGI2rbNTfiY2iUlHkeijoQ":{"text":"While I wanted to introduce my husband to a real muffalata the line was horrendously long.","useful":1,"cool":0},"QypIyhICoa5PqgKgRAwQtg":{"text":"I still have dreams about their Muffalettas. Fair warning though, their portion size is hu","useful":1,"cool":0},"MZFIqd2hE6NVVobR31B1xA":{"text":"Lunch can be an easy experience but make you feel cheated at the same time.  The Central G","useful":0,"cool":0},"3vP4DQckY1yPEwfw3hIdBw":{"text":"I returned to NOLA this year and the muffuletta was better than I even remembered. Over th","useful":1,"cool":0},"dSC5nOwHfjct0Ut51_jOYg":{"text":"Ok, I waited just over a week to post this because I wanted a little time to absorb my las","useful":1,"cool":0},"MGubiQdTteqEF3kxcG0V2g":{"text":"These sandwiches are HUGE! Think about sharing them with a friend if possible. This place ","useful":0,"cool":0},"h8Rbtn1MuKT6T-YLLnP3Ag":{"text":"The muffuletta is to die for. Must get! Their olive salad is excellent and I grabbed a cou","useful":0,"cool":0},"AGbsYyOSmp_T5YDF4wf7QA":{"text":"This is the original world  famous New Orleans \"muffuletta\".  It's a fantastic Italian spe","useful":1,"cool":0},"W75Brcsl5Q3cKkeHHE0wog":{"text":"The Muffulettas were premade and ready to go. I went on a Monday at noon and there were no","useful":0,"cool":0},"SnbtQZAY5hkKtIgVouz7Bg":{"text":"During my limited 40 hours in New Orleans this week, I tried to stretch my time there as w","useful":3,"cool":2},"7OtmHxOWg2D99n8QqEj7SA":{"text":"I've been meaning to come here for a long time, but every time I'm in the quarter, it just","useful":3,"cool":1},"egPQuNcPeMk3nzmp3wERiQ":{"text":"Came in for half a sandwich without the Italian Olive Salad and was told they were out of ","useful":0,"cool":0},"IKoNpeq-etFE7kY3WbFkyw":{"text":"Loved the muffaletta.  Loved the specialty grocery items.  Loved getting a cold beer with ","useful":2,"cool":3},"mVezsnbLCeqs5Zf-FfDJYw":{"text":"My husband I shared a half. Which was plenty for me, but he loved it so much, that he said","useful":0,"cool":0},"I_3LXjJq1MmDSBMEB22DgQ":{"text":"The home of the mufelletta. Sooooo yummy. \n\nWhole sandwich is huge so we bought a halfie a","useful":2,"cool":1},"jwduRm9IurZrD29XNzH94g":{"text":"Ah the claim to the original, how I loathe the perception so. I don't know why when it com","useful":1,"cool":0},"EgnSkHJFR5ywu33mghrikw":{"text":"Half or whole muffaletta? Those are your options once you come in to Central Grocery. It r","useful":2,"cool":0},"g4UpIoR8uknzEyhcEJFBNg":{"text":"Pretty cool! The line looked ridiculous for a sandwich, but they are all pre-made and it m","useful":0,"cool":0},"oRNexX1Tj9g-FC2ad-otTQ":{"text":"This is a must for your New Orleans visit. Simple, quick, delicious and filling, the Origi","useful":0,"cool":0},"34GG7rMbuE9SumL3vlyVrQ":{"text":"Worth the wait! Home of the original Muffuletta, it was so good I brought one home to Main","useful":2,"cool":2},"zyEcuVkpCGabTG_33LtEig":{"text":"I came to this place because well it is famous..it was a good mufaletta, I did not have re","useful":0,"cool":1},"j-2iI2FMJ_SBf4wn3u5Aig":{"text":"The muffuletta was amazing!  I have tired it some other places sense I came back from new ","useful":0,"cool":1},"RT8Gd4dP2iIYC3YAD3ItKQ":{"text":"I love this place. I came here for the muffaletta, like everyone else does, and I fell in ","useful":0,"cool":0},"O0CdVdGEdQO6oONcOYZxiw":{"text":"They serve one dish and one dish only, the famous muffuletta.  An Italian sandwich with a ","useful":1,"cool":1},"1Tjmwbasfzu5-1OXYQ9EVQ":{"text":"I have been coming here since I was 8.  I picked up 1/2 a muffalatta today and walked arou","useful":1,"cool":0},"VTB26W5PqAgStF1R7d17uA":{"text":"If you are craving a sandwich and your in New Orleans, you definitely need to stop by this","useful":1,"cool":1},"FmXuirfChYFQidXFHj_aMA":{"text":"The muffaletta is what you want to get here.  A New Orleans style hoagie.  It's the almost","useful":0,"cool":0},"dfaImES6lNLZU9hRp1WSDw":{"text":"Worth the wait and the price for a muffaletta.  Thye're pricey, but they're sharable. Love","useful":0,"cool":0},"5BQxxnSLiHk4Ut-5Qrb5hA":{"text":"I have driven 100 miles out of the way to get this sandwich before moving here ...I have h","useful":0,"cool":0},"dM-6ehyrO1oleYzM2kC68w":{"text":"Super good muffalatta and if you go in the afternoon between 2-4, there's no line or it's ","useful":0,"cool":0},"EKH5YJK_fn2nuJID2uhfDg":{"text":"We were in town from South Florida for a few days and my wife said this was on our top pla","useful":0,"cool":0},"8rh0XEFemORZGSn_29DmpQ":{"text":"Wowwww this sandwich. Quit complaining about the $$ and just give them you're money. You'l","useful":1,"cool":0},"7J4_ieF_oYn3nvgU7wYspw":{"text":"Central Grocery is a culinary legend. It is an actual working historic Italian/American gr","useful":4,"cool":4},"V0s1dp36OPdgrdHn_K4mqg":{"text":"A Muffaletta some Zapps chips and Barq's Root beer! We order them and have them shipped to","useful":0,"cool":0},"lud0GsHmu4HQ7vfn2Omsuw":{"text":"Like everyone says - you have got to have a muffaletta.  As a Sicilian-American I have to ","useful":0,"cool":0},"vo-onKzGPv9nukv34PbwHA":{"text":"I'll start this off by saying that I do not like olives. I love olive oil, but I just neve","useful":2,"cool":0},"xObi0w4VR1sxHtqO-berpQ":{"text":"The Muffuletta is the best. Yes, they sell only one type of Muffuletta and a lots of groce","useful":1,"cool":0},"-vA6KB0aoOxel1qfFVSIVw":{"text":"Very unfriendly. Ordered a half muffuletta to eat there.  Didn't realize it would be serve","useful":0,"cool":0},"AGL3u_Yl4x7m7fGmwmnksg":{"text":"Best muffuletta in the city, and probably the world!","useful":1,"cool":0},"TYkjGLdd6HVGe5xd9q5xiA":{"text":"I was slightly disappointed with the muffuletta.  Don't kill me yet, let me explain!\n\nSo I","useful":1,"cool":1},"KV0r8Q_RE_UpJMMyk7R1Tw":{"text":"What can be said of the greatest sandwich in New Orleans if not possibly the entire world!","useful":0,"cool":0},"kbr_Jy4Qf9duIlpEdQjs0g":{"text":"Day 1: I was touring and eating my way around New Orleans so by the time I got to Central ","useful":5,"cool":3},"SMJY_sCm03DssIZ1qVr2og":{"text":"Instructions for a perfect New Orleans lunch:\n1) Come to Central Grocery and get in line.\n","useful":7,"cool":4},"tyefFiaZSbzyhHmH-7odmA":{"text":"A friend suggested I drop by for the Muffaletta, completely worth it, I got the 1/2 and at","useful":0,"cool":0},"-QAlbK0llg6jmww0yZOxbw":{"text":"Mufaletta.  This is why you come here. Solid sandwich with great read and pickled vegetabl","useful":0,"cool":0},"6gtxj7U6fcgNh5gJZeHnbQ":{"text":"Came here for the muffulettas, of course, and they lived up to the expectation! I have a h","useful":1,"cool":0},"ZvahiARE79jlx8ozVboo_A":{"text":"No one else makes an olive salad that can compare. This place, being the original, uses th","useful":2,"cool":2},"v-jzWgv3C0h9CPJ1sdoX7g":{"text":"The Spot: \nNew Orleans boasts a number of food and drink rites of passage for tourists and","useful":3,"cool":2},"ta4lMYWmRD8lKEh8tIL4qA":{"text":"Are you fucking kidding me? What is it with New Orleans tourist traps? Look guys, NOLA has","useful":2,"cool":0},"Jt72Dq2qxdRMzwHzrg_-Qg":{"text":"** 3.5 stars **\n\nThe muffuletta is another NOLA food item, a sandwich with its origins in ","useful":2,"cool":0},"X_EMpe80Qzz0QwFqWY93kQ":{"text":"I don't care much about sandwiches in general, and have never heard of muffalettas before ","useful":0,"cool":0},"ixL9HoVuHRd3q5IKQ1pm8w":{"text":"I waited 6 years to try their muffuletta sandwich... the first time I visited New Orleans ","useful":1,"cool":0},"LY9KG3pMR6Zjpcwk36K--Q":{"text":"Aside from the hours, this is exactly what I miss about New York, bundled up in to one cut","useful":2,"cool":1},"vmBBpS0stdjPsKdQb4bFoA":{"text":"Yes people, believe the hype. Just get in line, make a friend or two and wait patiently fo","useful":0,"cool":0},"Zpy9x0I1CxC7WC1ZkKz3iQ":{"text":"As much as we love a good cigar challenge, we love a good food challenge just as much.  In","useful":0,"cool":0},"DNJBcRrhAmOffzEmWwSLrA":{"text":"We came here because we wanted to try a Muffalletta - so why not come to the place that or","useful":0,"cool":0},"aCDIThFQbNCmw-hCP0Dt_w":{"text":"Get a whole sandwich and split between two people...saves you a few bucks as opposed to tw","useful":0,"cool":1},"l7NP2EfygqMhfodHK49SpA":{"text":"Muffelettas!\n\nI love this stuff so much, I bought some to-go just for the plane ride...so ","useful":4,"cool":4},"kFGOBBBb8WewfdN2Ub0wXw":{"text":"The classic muffuletta sandwich did not disappoint! A quarter of a sandwich was plenty for","useful":0,"cool":0},"kuYy2UogOzc6wjpHClmwyA":{"text":"After all it's just a grocery store.......NOT!  Great atmosphere, even better muffulettas,","useful":0,"cool":0},"g--Knmgxg1Rz0zGkgEVGzw":{"text":"The muffaletta was delicious here, although it was a little too salty for my taste. The pl","useful":1,"cool":0},"hmvyoHNOrKLqCSdFQXG2SA":{"text":"You can't argue the success of the long standing deli/grocery.  I got in the long line, or","useful":1,"cool":0},"so2wcesngCCrEuNPB5yndw":{"text":"On your last day in NOLA, go to Central Market.  Get there early to avoid the insanely len","useful":1,"cool":0},"Yxz2T4I5rhYD8pkWHyZJDw":{"text":"Excellent muffulettas! Have them every time we come to New Orleans!  My husband is picking","useful":0,"cool":1},"x8rTlEPu7MYIL-oLRfRlGg":{"text":"Love the Muffaletta ! But you better love olives if you eat this huge sandwich. Don't forg","useful":0,"cool":0},"nUv8euoZ6yUxbRS-L4g0GQ":{"text":"Eat the granddaddy of a sandwiches here! The muffuletta was invented here... And if you li","useful":0,"cool":0},"BLS2w-BKsSSZ82MNmIi1tQ":{"text":"TL;DR - The muffuletta is not good.  Don't even bother\n\nI can't even attribute this to the","useful":6,"cool":1},"hZI9bto0Us6_wJSWensmWg":{"text":"I love this place and have been going here for years. Best muffuletta anywhere! The smell ","useful":0,"cool":0},"bsqdQF-LIQpUGhDycMmpkw":{"text":"Central Grocery is famously known as the home of the muffuletta. It is located about midwa","useful":2,"cool":2},"pDHhtQ85dW3opTWlUSfO_A":{"text":"Yum!  This is the best muffuletta that I have had in NOLA!  It's salty and meaty and chees","useful":3,"cool":1},"yrCTq4BpTGwvy4Z8JctFkg":{"text":"*************************************************\nRICK'S QUICK RECAP:\nUNDER CONSTRUCTION\n*","useful":0,"cool":0},"qPHakfVI612Jh_3zxxnrYw":{"text":"Muffuletta was good!\nWish there was a way to have it heated.\nYelp says this review is too ","useful":1,"cool":0},"o51Z5JGCRLtGxYCT0NwTBw":{"text":"Best muffuletta ever !!!!   We waited in a short line on a Sat afternoon at around 12:30. ","useful":0,"cool":1},"tQNUpmUsrv9LTtqGQpG-KA":{"text":"After reading about the famed muffaletta sandwich on yelp, I just had to have one. Once we","useful":0,"cool":0},"eX3qi9J-cS6bDaN33YjmZA":{"text":"The muffuletta at Central Grocery is a life changer.  The combination of flavors and textu","useful":2,"cool":1},"dGr3HG1KsP5zcu9mlPpsPQ":{"text":"Went for the legendary muffaletta.  It was pretty good - about what I expected so it didn'","useful":1,"cool":0},"vs-brrGyijQVjyK51EVnXw":{"text":"Central Grocery- the inventors of the muffletta-yet another 'must eat' in the foodie scave","useful":0,"cool":0},"VKmD357kpobUKpXQskDXpQ":{"text":"The muffeletta was day old. Must've been cause that would explain why the bread was so tou","useful":2,"cool":0},"eOHgLdeTJbn7KjsyXjn3eQ":{"text":"Go get Moo Foo Latte...... Moo Choo Papa.....Poo Poo Papa..Moo Yo Mama..... Sorry Muffulet","useful":1,"cool":1},"N-_G62gj-HUec7Khh8QuAA":{"text":"Shared half sandwich with friend and got bottled sodas. under $20 total. Fresh and delicio","useful":0,"cool":0},"ERLxQ-gwMeO7b7LfmZiJxA":{"text":"Comes out of nowhere, but I guess that's the best part.  Very unique tasting sandwich and ","useful":0,"cool":0},"UFzBVCWzYJm16Hd9DR0Cbw":{"text":"HERE IT IS FOLKS! YOU WANTED THE BEST, YOU GOT THE BEST! THE HOTTEST SANDWICH IN THE LAND!","useful":8,"cool":5},"Itk9JhS_uxv-hoNZ9bPb8w":{"text":"The bread was a bit greasy.  The place was pretty busy and crowded when I went and there w","useful":0,"cool":0},"DvITT-FjczGdVRA77WVtVQ":{"text":"I don't even like sandwiches, but the Muffaletta, draped in olive salad is really incredib","useful":0,"cool":0},"v20zjTqdVgR_-e8RFPXHTg":{"text":"Had never heard of a muffuletta but brother wanted to try it. The sandwiches are all pre m","useful":0,"cool":0},"PvBjJWSl5ApxQF41ow020w":{"text":"As a long time fan of Italian heroes, hoagies, and their relatives of all persuasions, I h","useful":4,"cool":3},"bJwy5D2m8lEVsmBs1w8L4g":{"text":"I came here on a Wednesday at 9am and there was already a line for the infamous Muffuletta","useful":1,"cool":0},"6pRq0IjVfu_al69N7b4pkQ":{"text":"There is a difference between disliking a particular food item, and a food item itself bei","useful":0,"cool":0},"s_dfORfkp9d9Tf3_ViHrYQ":{"text":"My discernment on Muffuletta quality is as informed as a kindergartener's art review after","useful":1,"cool":0},"nY6lJoOOOjaV16POCq2dog":{"text":"I don't normally yelp in the literal sense in Yelp reviews, but here is me yelping (litera","useful":3,"cool":2},"fMFDrbV9_FuxqYzIY5831A":{"text":"Best Muffalata sandwich ever! They weren't kidding! Bread was so good and soaked in delici","useful":0,"cool":0},"R_Q_bKbTYBIkMGY-TafZcg":{"text":"Went in for a muffuletta, it was suggested I try one from here not being from New Orleans.","useful":0,"cool":0},"DQbblIsyepZeVwsfvqmsQA":{"text":"This was the one \"tourist spot\" that my friends who grew up in NOLA told me I had to do. T","useful":0,"cool":0},"0iPxrnwpOuKOv1qxfwYhWg":{"text":"I love to eat some muff. Muffaletta that is. Holy hell batman, this may have been easily o","useful":2,"cool":2},"MEjTAx7qu4OKrlp0zkQh4w":{"text":"These guys get straight to business. The line moves quickly as all of the sandwiches are p","useful":1,"cool":0},"rJnmLzJWbTqYEeKfR-RXgw":{"text":"The best muffuletta in New Orleans, hands down. Oooh, my mouth waters just thinking about ","useful":1,"cool":0},"6D2xQbMhDKQNpWJP32EKDQ":{"text":"The service is horrible well from the disgruntled guy with the tattoos on his knuckles.Jus","useful":0,"cool":0},"OSv7AAuKGkiBGrFqEDQkeg":{"text":"Best Muffalettas.  My mom even brings me one when she comes to see me in Cali.","useful":0,"cool":0},"KMsxOF8X0ygl62ovhtGH4g":{"text":"Best muffulettas around!!! Be forewarned, they are BIG... if you are HUNGRY maybe two peop","useful":1,"cool":0},"97KN-juANeNFMoFaIEHjwg":{"text":"HUGE HUGE muffuletta and getting it to go is the best option.  A large was enough for 2 pe","useful":0,"cool":0},"jD1hU2PFUlfG0kidLPO4WA":{"text":"Went on a recommendation from a local as THE place for Muffuletta, and it did not disappoi","useful":0,"cool":0},"kAQf4_PjyyX2IYypmrjavg":{"text":"This muff isn't worth $17. \nThe bread was dry and tasteless and there wasn't very much mea","useful":0,"cool":0},"JZSn-0xtvUEqYCBQC7U07Q":{"text":"I don't like olives, but I really liked the muffuletta here. It wasn't greasy, it was huge","useful":1,"cool":1},"438vWvn91w8y3Bl39ziglw":{"text":"FYI:  The sandwiches are pre-made.  The filling is good but not great.  However, the sesam","useful":0,"cool":0},"R8DTG98PWUAU5hX2CMn7iw":{"text":"Store smells like fresh chese, meat and bread. We tried the special sandwich. The Muffulet","useful":0,"cool":0},"AAt6yPx79KJwBhXDaKdmxA":{"text":"What a joke.  Came here...waited in line for 45 minutes...at least 50 people behind us...g","useful":1,"cool":0},"6RM98dje7oyzAwXP0K6gXQ":{"text":"How can you complain about the original muffuletta? It was of course wonderful. But I have","useful":0,"cool":0},"xJf27B6bE8-jG5BMHhdMkw":{"text":"Line was out the door but it moved very quickly. I only got a 1/2 muffuletta, which was WA","useful":1,"cool":0},"erIwc7bDcALa_3vHTdxvjw":{"text":"Everything I wanted it to be and more. \nWe even brought a muffuletta back to KC! \nHeads up","useful":0,"cool":0},"zvNNbCsF-vFzUXQn-bUt_A":{"text":"Here it is, the mother of the Muffuletta sandwich, at the Central Grocery Co.  I'd like to","useful":0,"cool":1},"6p_iKa-z47iM1da9Z-8aCQ":{"text":"After hearing my friends who are from New Orleans wax poetical about the muffuletta sandwi","useful":0,"cool":0},"S6TksFMV_uk2aLO-N08KWw":{"text":"Get the muffulata, a bag of zapps, and root beer. Then walk across the street, up to the r","useful":0,"cool":1},"zPTfpMl32ka01AqLRgR_Rw":{"text":"For one who is not a big sandwich fan (they all just seem boring), the Muffuletta definite","useful":0,"cool":0},"EEhzujXqzBa1mRg9ZfLUbQ":{"text":"A muffaletta is what you want here.  But, for goodness sakes, make sure you get a half san","useful":1,"cool":1},"KFWlbe0jSpg1D77kDrYyuQ":{"text":"We went here with one goal in mind:  to get the muffuletta sandwich that New Orleans is kn","useful":0,"cool":0},"NmOImM4nm6GT7NoWqc36WQ":{"text":"We tried a muffaloto at a different restaurant & that didn't compare to this one!  Loads o","useful":0,"cool":0},"DFdYfQeEZ6O9QHZ1s2q3ow":{"text":"Great Muffuletta! Owners a jerk. They have way too much unappreciated business! At $17.00 ","useful":0,"cool":0},"oQzgi5ZXHkUwsvQY4-ADrA":{"text":"A very typical looking grocery store with one HUGE plus. \n\nDa Muffuletta!!! I knew we had ","useful":4,"cool":1},"34lj9N03b314OBWBgxhWfw":{"text":"Of course, I had to go here for the muffeletta  sandwich. It was noon on Saturday and ther","useful":2,"cool":0},"mL1vnfY9p8OavfNdYucC9g":{"text":"Looked up places to eat in NOLA and Central Grocery was one of the first on the list. Had ","useful":1,"cool":1},"GzBa1MiWB69CHY1Uqo-GLQ":{"text":"I know I'm going to be in the minority here: but, it wasn't the best sandwich I ever had. ","useful":0,"cool":0},"O5kcI_C3-wJFmMMJ37sX1Q":{"text":"Incredible place, i really love the muffuletta, salami, ham, manchego! Soft bread!...aweso","useful":0,"cool":0},"Q9RTnYOcSc2F6mosTIeD4w":{"text":"If you want to try a muffuletta this is the place to go!","useful":0,"cool":0},"R-pZfBRWQRNrmGlZyM2Afg":{"text":"Sadly, it's been a while since I lived in, or even visited, New Orleans but whenever I'm t","useful":1,"cool":1},"HcDZP-WedadcNiTfE5n_Eg":{"text":"The muffaleta lives up to the hype. It's huge and it's delicious. \n\nI gave this place four","useful":0,"cool":0},"Zf4HGx-UEERlyuqAYJwgYA":{"text":"Delicious Original Muffuletta Sandwich, it's good to just get it and then stop by a neighb","useful":0,"cool":0},"mIyOekSeriEs7kZ9UHGF6Q":{"text":"My husband and I went to NOLA the first time last 7 days and we tried this place as our fi","useful":0,"cool":0},"JsmHeXYzX6vHRyzKOqFyEQ":{"text":"A must see if your in Nola.  Its in the french quarter and the  muffalata is the best. We ","useful":0,"cool":0},"5iWWhvVJ7Qysg2IQ3EopMQ":{"text":"I have only eaten muffalatas a few times. But there's is hands down the best.  They are la","useful":0,"cool":0},"g4tfzXPf_xiHgEQr1AAN0A":{"text":"Don't be misled by the 4. The food, the signature muffuletta, is amazing, and delicious. I","useful":1,"cool":0},"eiMprpHiZEv8jdRacQHNAQ":{"text":"Almost the perfect delicious sandwich... Could go a little lighter on the olive oil but ot","useful":0,"cool":0},"33w8h9NIMFiyITo0cfGLlw":{"text":"the greatest sandwich ever-- the muffaletta.  so good that two years later, we are still t","useful":0,"cool":0},"PgXwql5cX6bBb9_o0ahEJQ":{"text":"Been here several times & we're never disappointed!  The service is bare-bones, but the sa","useful":1,"cool":0},"cm0ww44XApRY3YEZKldP5A":{"text":"Sitting here crunching away on a muffalata as I pen this. Had not been back here in some t","useful":0,"cool":0},"ySomUNF1i_Oepr2VLGV2ug":{"text":"It's on a Wikipedia page...That alone deserves a visit. Half a Muffleletta is more than en","useful":1,"cool":1},"XJHYxZsMpezpD6pUn3D4zw":{"text":"Central Grocery is well known in NOLA for their muffulettas. If you've never had a muffule","useful":0,"cool":0},"v_QgrCfLweoq_IvcKuVPZQ":{"text":"Great muffalettas. Get a half sandwich, walk to Jackson Park and watch the bruskers perfor","useful":0,"cool":0},"WzUhU1N4NjIT2nvXJvKUZA":{"text":"Best sandwich in America as my friend from Nawlins says!  If there's a line it's, worth th","useful":0,"cool":0},"CSppMNQXWXWX-xYDNQR-1g":{"text":"Basically all they sell is this one sandwich, but it's a damn fine sandwich. For sides the","useful":2,"cool":0},"kwfU-hPFKSWwNz2D90XORg":{"text":"Hands down the best mufalatta in America.  But.... Not only that probably one of the top 5","useful":1,"cool":0},"ccZPnXiArnlJTUYvcpkDnQ":{"text":"The home of the Add to dictionary and they make a really good one.   The Mufallata is one ","useful":0,"cool":0},"32A_-tH66-rJ4wxbtEHbgA":{"text":"Had the Mufaletta. As per my culinary touchstone, Guy Fieri, an excellent and satisfying s","useful":0,"cool":0},"YZUdGbDRtnpDFHh77DsbAA":{"text":"Store is really small and almost feels like an old western grocery store.  We came here on","useful":0,"cool":0},"d3qJTzNMPGDJmR789X0hAg":{"text":"Came here for the famous Muffuletta. Order one--it's one huge round sandwich cut in quarte","useful":0,"cool":0},"XPlZQhOL64Dr0CsFQmpWzQ":{"text":"Awesome sand which! Perfectly executed, cheese meat and their special olive dressing is am","useful":0,"cool":0},"7kZqX_qmuiN3E9Xxt0mv_A":{"text":"I love Muffulettas so a visit to Central Grocery was a must! I split a half Muffuletta wit","useful":2,"cool":0},"_Lx6EgYLNDHsZEf3VKNEJg":{"text":"youve seen the pictures , youve read the reviews .. i suggest getting 2 halfs .. leave one","useful":1,"cool":1},"4bsp0Bze_tKfPHUYdZbdwg":{"text":"No joke, the best sandwich in New Orleans! Take your appetite because the sandwiches are m","useful":0,"cool":1},"Oh2G7UAeNZHiaEO0cZDV9w":{"text":"Its worth the line. Muffuletta will change your life...great cure for a hangover","useful":0,"cool":0},"1vHmb1MjHHUK6wz7V3r2NA":{"text":"First muffaletta and it was sooooo good!! Store was cute and had lots of yummy stuff... sa","useful":3,"cool":0},"_OrT6i_doo5D8ukgTwpY-A":{"text":"Eat half now for sustenance, half later as a reward once you stumble successfully back hom","useful":0,"cool":0},"9anB25Sa-AWE-TGvhCBHxw":{"text":"This is a hefty sandwich. I could only eat 1/4 of a whole at a time. I don't even eat cold","useful":2,"cool":0},"kLBr9wSVECQfZB21XtRdIw":{"text":"Another item to cross off on the New Orleans tourist list. Yeah, the muffalettas were all ","useful":0,"cool":0},"GoXAyEC81B8_wYrF_aRfeA":{"text":"Tried a half order of their Famous Muffeletta.  Just over $9.  Not what I expected.  The b","useful":1,"cool":0},"-9DVojcc1OWHmFqnHaV2Bg":{"text":"The muffelatas  are delicious here. They have really gone up in price since we last visite","useful":0,"cool":0},"gLSKRZnR2RQjZKY601YlsA":{"text":"this place doesn't need another 5 star review.\n\n1.  must go\n2.  must eat like a fat pig\n3.","useful":2,"cool":0},"mozIR4CkjektrxQFdTyMEQ":{"text":"New Orleans is better known for po' boy sandwiches, but muffuletta sandwiches have become ","useful":1,"cool":0},"VWChWuZyPquC07SE9WCtYg":{"text":"COME HERE FOR ONE THING\nCentral Grocery is the home of the muffaletta, one of the greatest","useful":0,"cool":0},"topnUXNKPHyvKF6IJ_aR7Q":{"text":"Sometimes, on weekday off-peak hours, there is no wait on line for a muffuletta. At 9:30am","useful":3,"cool":1},"fzabSFPPLzWEDpqQDin0DA":{"text":"Home of the Original Muffuletta. Don't believe it? Google it, it's true. \n\nI wasn't introd","useful":8,"cool":5},"7DOPFMqcfTmaWWT4cVGWyg":{"text":"Excellente Mufuletta. Un sandwich pour deux est largement suffisant. À l'intérieur on peut","useful":0,"cool":0},"VK4kepmuO53gP55WXPZaUw":{"text":"Good muffalettas.  Some of the magic has been lost from my childhood memories.  Instead of","useful":0,"cool":0},"hANnvBVnhWfMa_RwYZzEQQ":{"text":"I am rating the Muffaletta here, not the grocery.  I didn't have time to seriously view th","useful":2,"cool":0},"uLz9BDntgts9CnFsu7xdHw":{"text":"Man that muffaletta was good!!!!!!!","useful":0,"cool":0},"jZojC-eXOm1hAk89R1GtHQ":{"text":"Enormously long queue. And after all, it's just a cold sandwich. Browsing around the produ","useful":0,"cool":0},"HFgo9xhA3LstnmGY67FkVg":{"text":"Could the owner act more bored if he tried? He was rude to lady in front of me and tried s","useful":2,"cool":0},"yd2uqLB48kD_vAtcQWn0_g":{"text":"Unexplainably rude and horrible service. But one heck of an awesome sandwich! Very pricey ","useful":7,"cool":3},"g9rNvFZqvuDaeQJeLKFuOQ":{"text":"Muffulettaaaaaaaa $9 for a half sandwich and $17.50 for a whole. A half sandwich is too mu","useful":1,"cool":1},"JJ5jaf6IYiwfmhDQQjCTQA":{"text":"After walking by and seeing the line, decided to go back and get a muffuletta.\n\nGlad we di","useful":0,"cool":0},"7JG2OsASp-tvk8RgJsJs4w":{"text":"Always wanted to try an authentic muffuletta...during my recent visit I finally tried it a","useful":0,"cool":0},"_oSuQr_QFRhr2nmgFL333w":{"text":"Love the old world feel of this place, the counter space within the grocery store.  As for","useful":0,"cool":0},"aPfkGZ_HuiU051kpc8vamQ":{"text":"good bread. good sandwich. great Olive salad.\nfour stars for the sandwich. three stars for","useful":0,"cool":0},"Zhk58a3XegmGStnL6gxzJQ":{"text":"If you're a local...you're probably spoiled.\n\nIf you're hopping on a flight after a trip t","useful":2,"cool":1},"osuxapBqKmAmPJBXYrZX2w":{"text":"Great sandwich! The muffuletta consist of marinated olive salad, salami, capicola, peppero","useful":1,"cool":0},"-Ue6Iyh16PoUC6RszMYFzQ":{"text":"This may seem like a tourist trap but the muffaletta was excellent. A half is perfect for ","useful":0,"cool":0},"WBLpEoOHJghYa8JkFgWXpQ":{"text":"Delicious! It's my third time in New Orleans and it's my third time having a Muffaletta fr","useful":0,"cool":0},"Q4GPMnPnjNJvQT5ZNd7UGQ":{"text":"Love these  things! This  is  just  my suggestion  when you  go there you might want  to g","useful":0,"cool":0},"11oK1qBaUOeCxolVqBBf1w":{"text":"Came for the Muffuletta on a recommendation and was not let down. Overall it's a pretty si","useful":1,"cool":0},"qMWhCYYpZF6dNT27y2VI3Q":{"text":"What can I say that no one else hasn't already said?   The muffuletta is awesome.   Its de","useful":0,"cool":0},"55TFf4gV7ilRzgAUENd4zA":{"text":"Had to stop here obviously because they were the muffuletta originators. We actually ended","useful":0,"cool":0},"b6FbwlvWHNO5eGQJd7Ha8w":{"text":"If you want muffuletta that is freshly made do not come here as its all premade. I would r","useful":1,"cool":0},"rze8SImL9GA6crfDHqUR2A":{"text":"What a good muffuletta!!! Don't be put off by the line, they have their system down pat an","useful":2,"cool":1},"sIvhdGG8llJCyU8FIu9c0w":{"text":"Muffuletta was REALLY good!!!  Was a little nervous but I REALLY liked it A LOT!!!  Don't ","useful":0,"cool":0},"tJr_o8sAwtLAJ-GgSuBgig":{"text":"Grabbed a sandwich early before the lunch rush and took it to go. The clerk was very polit","useful":2,"cool":0},"_v2Ma4ov8bCkteKYAGSI2A":{"text":"The Best Muffuletta. Ever. Period.\n\nTip: It's huge - you could split a 1/2 to a 1/4 betwee","useful":1,"cool":0},"n_HVp1x7vqBbdQBoe8bywA":{"text":"Got here early and was able to get counter seating which was great! The muffaletta was per","useful":0,"cool":0},"22LVTsJtkypSWo6143a5Kg":{"text":"Three of my friends and I had one piece each and were COMPLETELY full. The wait was worth ","useful":1,"cool":1},"CL2LTlQkHZPKTVQ2cn3a-g":{"text":"The muffulletta is the only sandwich that these guys sell.  You can order a half or a whol","useful":0,"cool":0},"4WbwM9q2KaNE0zp3-uNVqA":{"text":"I really was expecting to hate Muffalettas as I don't like any of the ingredients involved","useful":0,"cool":0},"aV9IQbnKE2oXYlokFirOLQ":{"text":"Great Muffuletta! We got a half and it was plenty enough for us to share!\nThe eating area ","useful":0,"cool":0},"--rFrxeekAojo-l3bvIOAQ":{"text":"We have heard the raving reviews for this place and had to check it out ourselves during o","useful":2,"cool":1},"TS-xaLH5CKkcKUup4DqtIg":{"text":"We bought 2 of their famous Muffalettas take with us to the airport on our way home from o","useful":1,"cool":0},"nDhvrLqcka3kPsEv85JnzA":{"text":"Oh I was so happy we came here for the original sandwich. We ordered the whole( we as in m","useful":1,"cool":0},"cWseXJAux4rA9I9lURxfcg":{"text":"I've been coming here for years and it's consistently great. No frills fresh Italian sandw","useful":1,"cool":1},"6d2rDf6BsAWT_bGgndo71Q":{"text":"I loved it. Cool little original place. We just stopped in and got a muffuletta to go. It ","useful":0,"cool":0},"wD7weCYVumUYqyYKNBsifw":{"text":"So you want seasonings that you can't find at home? So you want a Muffuletta after you fin","useful":2,"cool":0},"Q2w_lCaFQSyehJXlZfO7hw":{"text":"A word of advice: come early to get you muffaletta, don't wait too long after lunch or you","useful":0,"cool":0},"zPbL68MgMF4byyRS7v4bYQ":{"text":"Had a Muff...it was okay...I don't really get the French bread thing...sorry! And I felt t","useful":0,"cool":0},"rMCoYp_cgUL6WF6VjZOUpw":{"text":"Came in as soon as it opened and did not have an issue with waiting. The muffuletta itself","useful":0,"cool":0},"fgezBumt_BBIa_8nP99MGg":{"text":"OMG.... AMAZING!  Best sandwich I have ever had. The ratio of meat to cheese in the bread ","useful":0,"cool":0},"dcGR2q2b-b2dnY-uRZH3xA":{"text":"Muffuletta ($11.77 for half) - 3 stars\nSolid sandwich, on the salty side as you'd expect. ","useful":1,"cool":0},"6bzdS2EuQYhYah92VzSjOg":{"text":"Home of The Muffuletta and The World's Shittiest Service, but still worth a trip. Yes Thee","useful":5,"cool":0},"mMrVTITYN1UdmHTePkG30Q":{"text":"The Muffaletta at Central Grocery is one of the reasons to visit NOLA.  I remember coming ","useful":0,"cool":0},"HDVhhvAuOe_yj8DeA22eRw":{"text":"We bought a full muffuletta which is cut into 4 pieces for $20. The sandwich itself is ok,","useful":0,"cool":0},"M7GqldD7zZ8zi3irmosZig":{"text":"We came here on a recommendation from family.  This place was said to have the best muffal","useful":2,"cool":1},"3XlFhF8fqjMMoyD4kDhROw":{"text":"Even if you don't like sandwiches that much (*cough, my roommate), you will finish this sa","useful":3,"cool":0},"O2W-i4B1GkzapzJGCm0f8A":{"text":"The muffalata was one of the best sandwiches I have ever had. This is a really cool place.","useful":0,"cool":0},"ibfIaroOci8HT1bK0my5_w":{"text":"I thought it would be a great idea to have an order shipped from Central Grocery for my hu","useful":2,"cool":0},"RjqGnPQDbo8tr7Vl1axl3Q":{"text":"The Muffuletta Sandwich is huge! And delicious great for sharing At lunch. I want to stop ","useful":0,"cool":0},"1-wiVmeDfb4q8riAavD7XQ":{"text":"Worth the wait in line for the most amazing muffaletta ever! The olive dressing is the per","useful":2,"cool":0},"PiqgVAnil8f2JL-KeMtp8g":{"text":"It's a good Mufalleta but there is better across the street we found at a place called Roy","useful":0,"cool":0},"RFip3XiaAUrknAFYiHpkpw":{"text":"We make it a point to stop here every time we are in Nola for a jar of olive spread to tak","useful":1,"cool":1},"AuyWkJjSLnkTgPsFPKNjDQ":{"text":"Their muffuletta may be the perfect sandwich.  Had for 2 days in a row.  First day the bre","useful":0,"cool":0},"booOVH4HeoRFF7RrD1Dmpg":{"text":"We stopped in here on a whim when we saw the sign outside claiming they made the original ","useful":3,"cool":1},"QoX4HdLS8IJobVku8wDdew":{"text":"Fantastic sandwich. Split a half, had another one, felt very happy.\n\nGot one to take back ","useful":1,"cool":1},"Mjh-TQqNLd6cRnowiqEgAQ":{"text":"Yes, I know it's a NOLA institution... the building is old and cool... the grocery store a","useful":1,"cool":0},"HqguygTzjiy9f-xF6zHqZw":{"text":"The one and only Central Grocery Company is the home of the best muffuletta! The sandwich ","useful":1,"cool":0},"88NgkRIBCyiIvk0-Jf7Whw":{"text":"***SF Reviewer***\n\nI know it's an institution, and I truly do respect that but I didn't fi","useful":2,"cool":1},"plVIOdQjqWkjm9L51v9z4w":{"text":"There is something to be said for a place that is the home of a certain type of food.  Sin","useful":1,"cool":1},"jrnLco7hZ6s6cecAsru3Jg":{"text":"We've been going here for 20 years and it's hard to get used to the line of people going o","useful":0,"cool":0},"x6DYOudMQ7VuJ48W3d2e0Q":{"text":"Everybody and their mom agrees that this is the place to go for muffulettas if you're in N","useful":0,"cool":0},"JP9bRu3JT90zB2IpdvdoGA":{"text":"The muffulettas are all premade, so the lines moves fairly quickly, but (un)fortunately ar","useful":1,"cool":0},"v_fHV_t9JRU5ES-SfbZSgQ":{"text":"brought one on a plane home to Ca. once! Got a lot of dirty looks as we devoured it somewh","useful":1,"cool":0},"QhaeguFspKt5Z6rzypFhIw":{"text":"[ April, 2014 ]\n\nThis is *the* place to go for a muffaletta. Get one a share it with a fri","useful":0,"cool":0},"W-F3HhgWuuBXd1G43Xrsdw":{"text":"If u are from Mid Atlantic/ philly/ DE/ Jersey/ NY --- u know what a great sub/ hoagie is.","useful":0,"cool":0},"hb5tVRQewHv--Ze7Hkfa8A":{"text":"Ok so the sandwich is expensive as hell and it's not like they give you an abundance of me","useful":1,"cool":0},"zuxcfiaw9d9VOMFaBqgpnQ":{"text":"It is worth the wait.  If you go at 11 or 11:30  you'll beat the crowds.  A muffaletta fro","useful":3,"cool":1},"E9bV6BCsqx62kyvu-HHQNA":{"text":"Yes, the Muffalata is as good as they say.  Outstanding.  1/2 is plenty for 2 people.  The","useful":1,"cool":1},"GeowiVuP2_DGgRX3yJlFIw":{"text":"Was ready to pick up a Muffaletta  and go find a park to eat it (as suggested by some trav","useful":0,"cool":0},"CJl1h88zWc8OC61mhuOUcQ":{"text":"Cool little store. Italian stuff. Need an Italian specialty item? They probably have it he","useful":3,"cool":1},"zWEO2a7btD4YTu3-flLROA":{"text":"This is where I ate my first muffeletta.  This place is so classic.  This place inspired m","useful":0,"cool":0},"179TPw71oggPYsoOPCHIaw":{"text":"Seriously, you have to go here.  I'm not fucking kidding.  The sandwich will make you get ","useful":2,"cool":2},"7e4xTasIR1EHhQRThinF6Q":{"text":"While not as satisfying as the poboy, it's a worthy competitor. The mufuletta is a well ro","useful":0,"cool":0},"0DxpU1MKbPeYv6Vaf8eGoA":{"text":"The infamous Central Grocery muffaletta. It's a pretty good sandwich. A little dry for my ","useful":0,"cool":1},"tF9mYtOXjBun4POmSLyFxA":{"text":"For days all I heard and read about were this muffelletus. \n\n\"You have to try them.\" \n\"The","useful":1,"cool":0},"lTL0-ttI6_8N-jtxX6SdfQ":{"text":"Good eats but tight quarters!  Only a few counter stools in the back of the small grocery ","useful":0,"cool":0},"BceW7syJWK8E6XX8Ahzh2w":{"text":"Ok so I have never had a muffuletta nor did I care to try but my bf really wanted it so we","useful":0,"cool":0},"vmY8L7H7S0XAq7ogGqMzrw":{"text":"Never disappoints the line is deceiving it goes really fast as the menu is simple. Trust t","useful":0,"cool":0},"yiEow3AZX1RNksdFt-PFNw":{"text":"Long line out the door but moves quickly.  Ordered a whole and was able to finish just a q","useful":0,"cool":0},"nWkT6zGjTtLSpUwj_9cXOw":{"text":"The reviews for this place are very good.  But, my experience was unpleasant.  We waited i","useful":1,"cool":0},"aHZnhRMarSqbENhByFxVig":{"text":"Had to stop by to get the move muffuletta. The line was surprisingly short so we didn't ha","useful":0,"cool":0},"hMl3v0kIvbZQigJ0ss758g":{"text":"I'm a big sandwich guy.  Whenever I go to an italian restaurant or deli for lunch, I usual","useful":0,"cool":0},"T6Uw3HdHGKIn1KLnJwjang":{"text":"Came here for some olive salad and a loaf of bread. Still have the same unfriendly staff a","useful":0,"cool":0},"k-A4Ktm6yrL4RhH0_59cQw":{"text":"The muffaletta's are a classic here and legendary.  You can easily split a half sandwich w","useful":0,"cool":0},"UzR36Ys8nUegNCNkKcgteQ":{"text":"How can you not love an authentic, old school grocer: especially one that invented a sandw","useful":0,"cool":0},"s_ykSOn03UvdvqGVtD_MJw":{"text":"Home of the original muffuletta sangwich, or so they say.  As an Italian American from NY,","useful":1,"cool":0},"d4GEVXHK0L6Je2t1xrNEPA":{"text":"Looking for the most amazing Italian sandwich of your life? You've come to the right place","useful":0,"cool":0},"Xq-mHGIYkHw4kXFNs1DTxA":{"text":"This is a no frills place. You get in line, you get your muffaletta, and you get out. But ","useful":0,"cool":0},"NGNOCU-scNR0gCntCsJmJA":{"text":"HUGE HUGE muffuletta and getting it to go is the best option.  A large was enough for 2 pe","useful":0,"cool":0},"OAGGTKX2w_4t-SGNiK_x2g":{"text":"Last trip to New Orleans I required a muffaletta so battle the New Orleans hangover.  Best","useful":1,"cool":0},"s6FUXDbQchX6hPNDZqaZtg":{"text":"The original muffaletta, these are amazing sandwiches. This is the original, which means t","useful":0,"cool":0},"82qJ1iNN2QR-NY6tBUWBUA":{"text":"A MUST! Go get a Muffuletta now! A half is more than enough for one person - I loved it, m","useful":0,"cool":0},"JBaNcvoG4nB3RdFxoEk51A":{"text":"These sandwiches are addictive! I made it my mission to visit twice during my 4 day stay. ","useful":2,"cool":1},"p74cFLSs3wWWobjK5rca3w":{"text":"I am Italian, and have had ALOT of Italian subs and deli meat...but this has been the abso","useful":0,"cool":0},"l94MI5xGXWLCr8lFFvkeUw":{"text":"excellent muff! Grab a half for 2 people and go sit by the river.....no regret.","useful":0,"cool":0},"PGusO2CVNoN8UTSo9LD2eg":{"text":"GET THE MUFFULETTA!!! And make sure to bring a big appetite or a friend or 3 to share it w","useful":2,"cool":1},"dC9Qtov4noMSZQclt5-cww":{"text":"Good muffulettas but pretty crappy service. Men working the counter are not friendly, not ","useful":1,"cool":0},"yVv4AxUGO5rykD5hQqUVHg":{"text":"What is a Muffaletta?\n\nTo some its the best thing in the world, to me its an Italian sandw","useful":2,"cool":0},"kVh8lXCZqIl4bTmv6P564A":{"text":"On my last day in New Orleans I had a major hangover. Despite this, I still wanted to try ","useful":1,"cool":0},"LSAVDZUxSp3LaTUInZA0fg":{"text":"Central Grocery's been on my NOLA bucket list forever, but seems everyone I've travelled w","useful":1,"cool":0},"AX8ZNH_FGHwbaPSe37KbOQ":{"text":"quick,  no frills, amazing sandwich, good grocery selection. if i was a local this would b","useful":0,"cool":0},"UwQENG8GFQ0h9l3RAg6_xw":{"text":"The muffuletta really is a great sandwich, and I don't even like olives. Line moves along ","useful":1,"cool":0},"v96uYIhykKTyGHoIW8WwPg":{"text":"Sorry, I don't get the hype. The muffuletta was just ok. The bread didn't seem as fresh it","useful":0,"cool":0},"iDkXCCh-p9Be_E5zxJodfg":{"text":"whoever complains about the service of this establishment or the rudeness of the employees","useful":2,"cool":0},"ASPH0Htj_vX2TD2MX6IS1A":{"text":"OMG! To say that the people at CG were rude is an understatement! My son and I were there ","useful":0,"cool":0},"G16NiVuIY0EFNl0C0gtn-g":{"text":"Ummm...yea I'm really not seeing the big deal about this place.  Tried the ever-so-popular","useful":0,"cool":0},"p8s1S6D_pUJkmQRyaQpjlA":{"text":"Home of the muffuletta! Great muffuletta. But really the gem is the communal counter! Sit ","useful":0,"cool":0},"ugnco1Ji-vNp217SRmhWfg":{"text":"We were up early and out the door to sightsee around the French Quarter early on our first","useful":0,"cool":0},"LeFk4HRQH4bi4aCKCb7fIQ":{"text":"Best muffuletta I have ever eaten. It's a must stop every trip to NOLA","useful":0,"cool":0},"70ajltP02z80y_3UbH6u_w":{"text":"YES! First time in NOLA and visted Central Grocery for the Muffaletta! You can get a half ","useful":0,"cool":0},"MFroI18oLQfc6lwiWjwLAQ":{"text":"We stumbled across this grocery while walking around the French Market area. This an old f","useful":2,"cool":0},"enfmUXDUMDkrZPaaiJHpCA":{"text":"Great muffalatta, good balance of meats cheese and olive salad, not too oily on a sesame s","useful":0,"cool":0},"L5TULgTB3gqhSwT_STqLRQ":{"text":"It had been 30 years since I last ate a Muffuletta from Central Grocery and I had the OCD ","useful":0,"cool":0},"_qFiE5omhHwhPKxn3qB7RQ":{"text":"MUST HAVE!! The Muffuletta sandwich here is ridiculously AMAZING. So good I had to go two ","useful":0,"cool":0},"Be4irknveIr_YYaORRythw":{"text":"So glad a coworker told me about this place.  The muffaletta was delicious; we even bought","useful":0,"cool":0},"6OIoeCjaQI6Lhg5LXQJ7Rg":{"text":"Muffalleta and a good size at that, fast line, very little customer service. \n\nLove the hi","useful":1,"cool":1},"btEmrqUG4SB8ONyj7gVdhA":{"text":"Mmmmmm muffuletta....\n\nI usually don't like olives, but when it's pressed between deliciou","useful":1,"cool":1},"srhadxzj4Watu-k5pQZU_Q":{"text":"If you love waiting in lines for sub par food then this place is a gem. It's one of the mo","useful":3,"cool":2},"lx1n9xM8r2EHsdZ-WAwYcw":{"text":"This place is charming New Orleans style with a bit of New Orleans traditions! I am lookin","useful":0,"cool":0},"hPFfBCaMAUEd0siXgAR4Gg":{"text":"Not much to say other than ridiculous. No matter how long the line is, wait. It's making m","useful":0,"cool":0},"w9CuniWi9zeWp5x_yH9a0w":{"text":"Ok, so they don't have much selection. You can have a half a muffalatta or a whole muffale","useful":0,"cool":0},"Rm1Qmv0nKv3EcraY3M8yXQ":{"text":"They may be the first to create the muffuletta but not the best. It was overly salty. Or m","useful":2,"cool":0},"4p40mketYCGMyEX_o9wNPg":{"text":"I know.  It's so jejuene to warble about the muffulettas but I really think this is the be","useful":3,"cool":1},"exTY67MweLzKnXc_Eubzxw":{"text":"Geez....this is probably one of the best sandwiches I have ever had!  The mulfaletta is su","useful":0,"cool":0},"PB5oEYbl8WGHw69AnTPq_Q":{"text":"Looking for a quick bite? Central grocery is your perfect stop. Their muffuletta is the be","useful":0,"cool":0},"mvwhvsWh8fnK3D_-IJxW8w":{"text":"Over rated.  A premade sandwich with a small amount of ordinary meat and cheese.  Pluses a","useful":2,"cool":0},"8n18HbmGVmMMSIgY-YuIzA":{"text":"My girlfriend and I came here on an early Friday afternoon during a time of the year when ","useful":0,"cool":0},"TVYayUXu2XJbLH0OadTm1A":{"text":"A Cute old school Italian store, that serves a monster sandwich called the Muffuletta.  Ev","useful":0,"cool":1},"xm1b_M-z5Sfu_cgRQ9CtLA":{"text":"Definitely a 'must try' stop during your trip to NO.   Old bodega style Italian grocery st","useful":0,"cool":0},"ApcmgGoA9QS22OuqJ7oZbg":{"text":"Not the most friendly staff but I love the sandwich after it was sitting for a few hours. ","useful":0,"cool":0},"ON27rXte5QN6Nu0e6p_Rrw":{"text":"Ahhh yes, a trip to NOLA would not be complete without a muffaletta sandwich from Central ","useful":0,"cool":2},"FIwKad-cwgpy8KtOSKVJcg":{"text":"This is one of those things that is worth the long wait...and it really ain't that bad a w","useful":0,"cool":1},"wHEzXxNE7XjluGUCQujLkQ":{"text":"It had been about 5 years since I have had a Muffuletta, so while visiting New Orleans and","useful":0,"cool":0},"721qTAm6yuCE8YeB_aX1fg":{"text":"Overpriced.   Closed on Mondays.  Long ass lines.   Was closed on Easter Sunday, though th","useful":0,"cool":0},"5d7rsZVqkNNBFvGLgDMKVw":{"text":"Nothing bad to say! We grabbed a sandwich and left.. It was really salty, but filling.","useful":0,"cool":0},"VqLysReg-c7wn37K8m6CcQ":{"text":"Just wandered in unexpectedly since we thought it was another popular muffulettta spot. Ev","useful":3,"cool":0},"0pxUN6bsLZNMZ0wPs13kGQ":{"text":"Had to wait on line for a $20 Muffoletta but it was worth it.   The bread was fresh and so","useful":0,"cool":0},"28wwB8MUsgHrG6DIh55g2A":{"text":"Wow wow wow! So good those muffulletas! Les viandes froides sont de première qualité! Et l","useful":0,"cool":0},"HTcv650JEBXZnzCEmtNarA":{"text":"First time trying muffaletta and it's pretty good. Really oily so be aware. Half order is ","useful":0,"cool":0},"KV12LYH4tXsiVwki4Dm0qg":{"text":"Way overrated. Listen to the negative reviews. Anyone that's used to great Italian sandwic","useful":0,"cool":0},"pYulwVkjL729-DUH9cxj5g":{"text":"We unknowingly happened upon Central grocery as we were leaving the French market. I was r","useful":0,"cool":0},"ZAAMrH6_aq6apo4ITnhFbQ":{"text":"These sandwiches are huge and full of flavor! Do not skip coming here, you WILL regret it!","useful":0,"cool":0},"TSsJAmQqV895Wrq_NiHoew":{"text":"My husband loved his muffuletta from this place and thought it was worth the wait to stand","useful":0,"cool":0},"z8Gfin4FToqPAUbMiHRihg":{"text":"Five stars is simply for the muffaletta. This place has an amazing muffaletta! If you're c","useful":0,"cool":0},"Q5-9buNZsLWqnI3auElpPg":{"text":"Muffuletta!!!!  I don't even like olives but I made sure I got every last bite of that oli","useful":0,"cool":0},"VaGaGA6OG_0f1iD6fiaImA":{"text":"Soo delicious!! A coworker recommended I get a Muffuletta Sandwich from this place on my t","useful":0,"cool":0},"HYpzrxntGWMlV0518OdT5Q":{"text":"Stopped in for a muffuletta. It was epic. I really don't know how I've survived all these ","useful":0,"cool":0},"S5wnLszPBRzmk2SalwtcCw":{"text":"The muffuletta was good. Saved my appetite, skipped breakfast and 3 hours later I'm still ","useful":1,"cool":0},"FFmaxbTppGv-WK8w2MgaCQ":{"text":"Best muffulettas anywhere! Only one thing on the menu here, and it's all you need. Perfect","useful":0,"cool":0},"-ASibaYZoSnliyJdxkc-mg":{"text":"Touristing and went for a muffaletta. I got the 1/2 and it was so filling. I had a fourth ","useful":0,"cool":0},"h8-IpQ8-zCdaLq4n9aFMHw":{"text":"I LOVE THE MUFFULETTA!!\n\nTherefore,\n\nI LOVE CENTRAL GROCERY!!\n\nWas there just in time for ","useful":1,"cool":0},"0rq42flyY2m49qxovl2Miw":{"text":"Do people actually come here to buy the \"groceries\" from this place? I had a muffaletta, o","useful":0,"cool":0},"4NlTZGcpLf1-EQv3yUbnuA":{"text":"This place is lucky that they have the best sandwich in God's creation because everyone th","useful":6,"cool":0},"2bK2QWgQZ4zVZ6Pqv1fm4w":{"text":"This is one of those \"must-do's\" in New Orleans, but we were really disappointed in this s","useful":2,"cool":0},"jr8DbNn4y_vTgaB5Khm_tA":{"text":"I simply adore Muffaletta and Central makes one of the best. It's true, as an out of town ","useful":0,"cool":0},"qv1aG1CrSbAO2QMmLePG6w":{"text":"Came here for the famous original mufuletta! These sandwiches are huge - bigger than our h","useful":1,"cool":1},"RGwx7ic9blA6tsakLxsTPw":{"text":"This was the best sandwich in NOLA!  The mufaletta-Loved it all around even though I'm not","useful":1,"cool":0},"7teZ0SAapxqWp__hBUesLg":{"text":"MUFFULETTASSS!! \nI'm craving these so much and I regret not buying more to take home. The ","useful":0,"cool":0},"gXwbSj81ntulOF8LGLnbPg":{"text":"Famous for the muffuletta. Yes, it's the best. Order a half first and if you have room go ","useful":0,"cool":0},"I-fo-4dIvOnCKB9NM38WPw":{"text":"If I've said it once, I've said it a jillion times, good places are hobo proof.  In we wal","useful":0,"cool":0},"pXIggYQLqX5IkGKQohHNyA":{"text":"I don't get there as much as I would like but this place makes my list just because of one","useful":0,"cool":0},"xf__daiDvS3pYoO9MHPPLQ":{"text":"Muffuletta.\n\nThat is what I came here for. Honestly I imagine that is what a lot of people","useful":0,"cool":2},"nlJnYNXHfpAuAavN0BQ1Tw":{"text":"Central Grocery is a must stop in NOLA.\n\nI LOVE, LOVE, LOVE grocery stores. This is a very","useful":0,"cool":0},"7enrokgoGFLCr6psQm9WkQ":{"text":"This place has amazing Muffulettas! We buy a few every time we come to town. We get one to","useful":1,"cool":0},"4KQOflhXrdDPXagjhsfEgg":{"text":"Looks like a hot spot to go to while in New Orleans. I wouldn't say it was worth the hype.","useful":0,"cool":0},"_up1W6NO8wdLA8Fn4rXJwQ":{"text":"I don't like olives a whole lot, but the muffuletas are amazing.  This is THE place to get","useful":0,"cool":0},"KDDXj6x_meKlZW8MdAhmBg":{"text":"I was told by several people that getting a muffuletta sandwich from Central Grocery is a ","useful":0,"cool":0},"5650AeZYxppMh-NGfC2VqA":{"text":"I've always liked muffalatteas from Jason's Deli.  Those are good.  Then I came to NOLA an","useful":0,"cool":0},"RomOjvh_hTv_oAssjlHW_w":{"text":"We were told by our friend to visit the Central Grocery and order the best muffuletta in t","useful":0,"cool":0},"EgOzTJuSIFf-_I4cs6XY-A":{"text":"The muffuletta is honest to God knock your socks off good. Intricate layers of cured meats","useful":1,"cool":0},"Q54DkwgxsDCoUkKNAdyMhA":{"text":"Anytime we find ourselves in the french quarter during business operating hours, we swing ","useful":0,"cool":0},"sAb3_q0Ybv05Cx5ZWEPIqg":{"text":"This review speaks to one thing, and one thing only:\n\nMuffuletta sandwiches.\n\nThis is the ","useful":4,"cool":2},"yh0op5Rw6-H1pydWJM6Ovw":{"text":"a fantabulous slice of New Orleans. \n\nDean and I HAD to grab a muffaletta from this renown","useful":0,"cool":1},"iexw7hy5ozzyaxWEQPVzIg":{"text":"This is the best muffuletta period.  You can taste all of the ingredients and they are ver","useful":0,"cool":0},"P7Csui5ZGqPuoS8GvC3lwA":{"text":"Man does not live by bread alone, but you could certainly could live by Muffulettas alone!","useful":2,"cool":1},"Hl59u11xk-nMRvg3vnwMew":{"text":"The original Muffuletta.  For $15 you get a muffaletta, which is a gigantic sandwich that ","useful":2,"cool":0},"bcn_65QSqHF97dm-O7GJ2Q":{"text":"Is the muffaletta good? Yes. Is it fantastic? It depends on your tastes. If you love olive","useful":1,"cool":0},"0BrZoZo6yLXsGMPZaFh4bg":{"text":"Went to Central Grocery again. Got the muffuletta.  This is my favorite sandwich ever. We ","useful":0,"cool":0},"Od4v7EPheytokUwPiElRYw":{"text":"We've heard about this famous sandwich, and all signs indicated this was the place to get ","useful":2,"cool":0},"2MOqA817BpKknTxVCULgPA":{"text":"If I hadn't checked Yelp I would have passed by this store without even batting an eye at ","useful":1,"cool":1},"hTJFfn6ZNvlY-ffb7UxpGQ":{"text":"Recommended by locals and tourists alike. \n\nI'm not a fan of olives or cured meat, but tog","useful":0,"cool":0},"lg6vcSd6nK6-2ieQldC53g":{"text":"This is the one place in the city for muffalattas.  \n\nhttp://en.wikipedia.org/wiki/Muffala","useful":0,"cool":0},"GD5_YsDLkf5LPg9bJR5-xQ":{"text":"On my last trip to NOLA I didn't have a chance to stop by here, so this time, we made it a","useful":5,"cool":5},"AyujbJ8913zvJ9DuOVEPaA":{"text":"The only place to go for a muffulatta.  Period.  End of discussion.  Pretty darn good litt","useful":0,"cool":0},"oR0fSOwCn5uB_EiI404gyQ":{"text":"Here's a tip:   buy the whole, delicious muffaletta sandwich the day before you fly out of","useful":0,"cool":0},"Nf0zUIqof-39uTskfSOd7Q":{"text":"How do you run out of sandwiches mid afternoon on a Saturday?  You guys have been doing th","useful":1,"cool":0},"q99yopGlHJwIiw4QSbFU_A":{"text":"Muffaletta was on point and there was no wait! Sandwiches came premade and wrapped, furthe","useful":0,"cool":0},"we7ro2BtnUQMnvbDBnQdpw":{"text":"While in NOLA you need to visit the original home of the muffuletta. The sandwich was deli","useful":0,"cool":0},"eXDIpjc9c5Stra6OfKKSeg":{"text":"Finally a real original and it was worth it! I got the full samich thinking I'd eat half a","useful":13,"cool":16},"DuEiF0LtNrpmO-iqBfUzbA":{"text":"The muffuletta is good, absolutely. Salty and porky and briny goodness. I'm giving three s","useful":0,"cool":0},"yOFs6ShXzH5-lq0vmYMEdg":{"text":"Everyone has said what needs to be said. I will say this- their muffuletta is not overrate","useful":1,"cool":1},"okLtptH45DohOV5M_cNYtQ":{"text":"BEST MUFFELETTA! YEP!!!\nI could eat the olive salad straight from a jar!","useful":0,"cool":0},"NVtkzFsGWSpEAJU-xY1TpQ":{"text":"Yes, this venerable landmark carries a variety of groceries -- all sorts of oils, vinegars","useful":2,"cool":2},"jlZ9dczCBlRR9GVjFAT7vA":{"text":"Five big ones for the muffuletta. Still the best anywhere.  (My second favorite is actuall","useful":0,"cool":0},"dkdHlq8glrSaIG0dzb6MjA":{"text":"My wife and I split a half of a muffaletta at Central Grocery. It was pre made, but very g","useful":0,"cool":0},"gpB1KoTUQy8npyuYllXLsQ":{"text":"We stopped here for lunch based on all of the positive yelp recommendations, and the muffu","useful":0,"cool":0},"QKClkGuYgD6dHG50CkuUTQ":{"text":"Ugh. Now this is a sandwich.\n\nWe showed up midday and were worried as the line was about 1","useful":0,"cool":0},"HKy53wZBlr7aWReEsA-Rxw":{"text":"My girlfriend suggested that we try the sandwich here. Although I am not a big fan of pork","useful":0,"cool":0},"E1SUCsDEx_Mtgl94o9pxmQ":{"text":"We walked here in a flooding storm for muffulettas and were not disappointed. They are HUG","useful":0,"cool":0},"gwpdQMIwTo-_6x8cmLHoEQ":{"text":"The line was long but went quick, we of course got the famous muffuletta sandwich which wa","useful":1,"cool":0},"nnOWWTJmzZj3XmrwieV2XA":{"text":"Hands down the best food ever.  Muffuletta is my favorite sandwhich and if you're going to","useful":0,"cool":0},"CTw_g8bvv8_lJMnrLMprfw":{"text":"Great little market!! Unique foods to buy as well as fresh sandwiches made to order! Bough","useful":0,"cool":0},"1RELzHXr80V5hBhtR8ezmg":{"text":"Nasty nasty man behind the front register... Would not let me buy a can of tomatoes on the","useful":0,"cool":0},"FbcaXtmJ3LePCnhhOs4UNg":{"text":"muffuletta  a very good reason to come to New Orleans, and Central Grocery is the gold sta","useful":0,"cool":0},"zy8NRw_ChohqqRsyWW7W4A":{"text":"This place has been on my mind since my last trip and will be on it again until my next tr","useful":3,"cool":3},"E4sFnegrKO9hVnPhZMyYkQ":{"text":"THIS PLACE IS THE REAL DEAL. Muffaletta. Go. Don't leave NOLA without eating one of these.","useful":2,"cool":2},"ipz5nY3Zy4Q91HXp9pdbKg":{"text":"Cute grocery store. Too bad they don't open late. I did find the Zataran's Crawfish boil h","useful":0,"cool":0},"Kf34pMrxvz-ln2acfxW-Jw":{"text":"Delicious muffuletta\n\nORDER:\nMuffuletta - half sandwich\n~$7\nThe half sandwich was cut into","useful":0,"cool":0},"0zkDWRb8HOZyd8I_KEvgLA":{"text":"Haven't had a good muffalata in ages so when we visited New Orleans this was one of the fi","useful":0,"cool":0},"6a4Re-5tFqF88UkgltsI7w":{"text":"When in NOLO, you need to stop here for an original Muffuletta sandwich! We got a half and","useful":0,"cool":0},"PxNphoG7hHsCHjqt47pwPA":{"text":"Simply the best damn sandwich ever!! It was my dream to come here and it did not disappoin","useful":2,"cool":1},"V99_v8sfPYtzklfPWw2-mA":{"text":"This place is like du monde. Pretty much a mandatory stop. And the muffuletta is worth the","useful":1,"cool":0},"VzmK16mySzgB8cavG2XP6w":{"text":"Central Grocery is the home of many Italian foodstuffs but is the originator of the muffel","useful":0,"cool":0},"I4FxrbtIHtrysRPYCb199Q":{"text":"We got there a little after they opened, and while we had to wait for the bread to arrive,","useful":0,"cool":0},"mnyalw-Mx9YKHGLxMfqYfQ":{"text":"What can I say about a sandwich that hasn't already been said a thousand times. This place","useful":1,"cool":1},"xMnN5APJhKnzI_QV9d8FSQ":{"text":"Central Grocery is like a shrine for the Muffuletta. It's a little Italian foods market on","useful":1,"cool":0},"etuI1wkmXmzKSl4Zpd_Kjg":{"text":"I LOVE THEIR MUFFALETTA! I will come back again! For the uninitiated, it really is quite s","useful":1,"cool":0},"Y30IevbcRnxSGGe36NxPeg":{"text":"I should preface this by saying that this review is for the sandwich.  While the people be","useful":3,"cool":2},"wKTYP84OsdUOcqzuPsGYAw":{"text":"Oh mother of mercy it's great for what it is and what it is is a great sandwich.  Don't wo","useful":2,"cool":2},"LwZ5hmgFF-gx8hxgbo2tgw":{"text":"Muffaletta here are really really good. That being said this is pretty much the only thing","useful":3,"cool":0},"bOlI4F4wLcTVBJDfO0pEig":{"text":"My husband & I shared a half. Which was plenty for me, but he loved it so much, that he sa","useful":0,"cool":0},"aK8gKb06YAyGXTtopTl57Q":{"text":"Loved the muffaletta. The store itself was nicely arranged and stocked with some gourmet g","useful":0,"cool":0},"XKglOCHYJBIna2HfQG9tyQ":{"text":"There is no muffaletta after this one. They invented it and it's perfect in every way. I t","useful":0,"cool":0},"8SuL-QsVlOmKMrp1LmA4fw":{"text":"I could not give 4 stars cause it is not a solely a full service deli.  It is a deli withi","useful":0,"cool":0},"RQSU53ayQ_SIpHem7LIHMw":{"text":"These things are ginormous in size!! My friend and I came here for an early lunch one day ","useful":0,"cool":0},"I-X5kNvlU8IFuR5sAhK6JQ":{"text":"This sandwich is EVERYTHING. One quarter of it is plenty for one person, but you'll want m","useful":0,"cool":0},"74PssUm-V1B37jvP8WgyKw":{"text":"A New Orleans tradition that shouldn't be missed!  No trip to the French Quarter is comple","useful":0,"cool":0},"RSQ6-kkoMaig35wPvWDuhQ":{"text":"This is the one and only muffletta! No others compare.  I try to get there whenever I come","useful":1,"cool":0},"9MvWxp1H06PjGeFUAjOxhQ":{"text":"My second muffuletta ever. First was at Zingermans in Ann Arbor and this one was much bett","useful":0,"cool":0},"1MRUHjp5Zcau9cnOAPZnNQ":{"text":"There is a line of tourists, waiting to try one of these famous sandwiches.  There are sta","useful":0,"cool":0},"AQZ2GQ9dAlBvv10Wm106QA":{"text":"I liked this place because it didn't feel so tourist trappy, despite being full of tourist","useful":0,"cool":0},"LcRVORb3Dbg2CDkur7bV-w":{"text":"I'm basing this rating on the Original Muffuletta. Holy nuts. This thing is ridiculous and","useful":2,"cool":3},"R5w_CixXOp-4GnNKqOZ13g":{"text":"There are so much hypes about the Original Muffulettas from Central Grocery and even the N","useful":4,"cool":2},"HpGCIvpRiEdZcn3AQRCcJw":{"text":"Never even heard of muffaletta until my plane ride to New Orleans.  A women who sat next t","useful":0,"cool":0},"Ifsl62gtbNhZAZ6QFZIj6w":{"text":"Muffuletta?  Sure, I will try it.  Was told by our guide to check this place out.  These a","useful":1,"cool":0},"wGD2PB-sTONYdeUJlans_g":{"text":"When in doubt of finding a sandwich place and bang for your buck. Go with the\nMofuletta sa","useful":0,"cool":0},"9LY_TyFAfB43mityoK2CAw":{"text":"you've beigneted? you wanna muffuletta? go here!\ncentral grocery is where to go for your (","useful":1,"cool":1},"3cntmCRGSAPDMcylTGgLdw":{"text":"The only place to have a muffuletta! I drive from Kenner just get one. The best olive sala","useful":0,"cool":0},"G8Ar_4DVVNYgq9cPmfU-LA":{"text":"OMG MUFFULETTA!\n\nSesame roll! Olive salad! Salami! Mortadella! Provolone!\n\nThis is a beaut","useful":4,"cool":2},"POf1uRxK9A8AhPQy0mp5Og":{"text":"Want a fantastic sandwich from a historic spot?  This funky little deli put the muffletta ","useful":0,"cool":1},"roGUlqTsrXMO9tu-ne1G0A":{"text":"I do feel like Central isn't quite as good as it used to be.  The muffs are definitely not","useful":0,"cool":1},"eGjOIFZkAxrqV19Hx5POlw":{"text":"There can't be a better muffuletta in NO than at Central,Grocery. Funky fun store, and tho","useful":0,"cool":0},"YGn47mfbJtxHBpVtquyC1g":{"text":"Did anyone say Muffuletta? This is their original home? These bad boys are huge and impres","useful":0,"cool":0},"PYhtF5IPSrhDjMM4-nhKpQ":{"text":"Famous for the original muffuletta. The olive salad mix that they spread on the muffuletta","useful":0,"cool":0},"o7e2pUR8Q2ruLi4XMcGNgQ":{"text":"I like olives; I like provolone; I like salami; I like ham; I like olives.  Therefore, I l","useful":0,"cool":0},"YR-G2Fjg-tQq8rlY-Xe8Lg":{"text":"Had to stop in while visiting New Orleans - obviously. It was a Friday around 3pm or so. T","useful":1,"cool":0},"2cC7QqEjQ428WOTRlcBdag":{"text":"Another traditional place to go. It is truly a grocery store. The muffuletas are huge and ","useful":0,"cool":0},"1mK93fqy6TEcK91Zl12jJQ":{"text":"Great sandwich! The grocery is great, too - it has a lot of high-end hard to find items.","useful":0,"cool":0},"3Wmn3um9gXLT3xMnLTtyLg":{"text":"I drove 1.5 hours from Baton Rouge Yesterday to pick up this delicious Muffalata sandwich ","useful":0,"cool":0},"UdcFX0sTmMERafcRfvbCWQ":{"text":"Fast service for ready to go muffaletta sandwiches, large portions, good prices. The sandw","useful":0,"cool":0},"UOwcwNqRDkxxbDTU450zoQ":{"text":"We used Yelp to find good places to eat while in New Orleans.  The muffuletta sounded inte","useful":0,"cool":0},"VEgcKKVuKQlh4STujLfaOg":{"text":"What in the world is a muffuletta?  I didn't know, and I still can't really describe it.  ","useful":0,"cool":0},"SGTy9DcagNxrrkGRAWXidw":{"text":"Had to try the Muffaletta.  Three of us shared a large one - they cut it into quarters, it","useful":0,"cool":0},"fOzlNsHkRtjl7scBTwIRaQ":{"text":"Just finished eating my muffuletta, which I'm embarrassed to say, I didn't want to get in ","useful":4,"cool":3},"Q6l4-lvO4coBaPzbGYvdRg":{"text":"Worth the wait in line for the Muffuletta sandwiches!","useful":0,"cool":0},"1z6CdSD4svkLNze93rZrEQ":{"text":"Probably as good as Muffuletta gets, but I am not impressed with this sandwich considering","useful":0,"cool":0},"EBiJAdq9nZMikfGFR29Mwg":{"text":"Central Grocery, originator of the Muffuletta sandwich, is an Italian grocery store founde","useful":1,"cool":0},"szH98CM7gyDGLiBXdC5XIQ":{"text":"10 years or even 5 years ago I would not have dreamed of giving this place--purely for the","useful":4,"cool":1},"dHLP_n3tvuuNTXi_zPLOhA":{"text":"$15 something for a half muffuletta and soda. Kinda pricey but it's cool to try the origin","useful":1,"cool":0},"4N8ZGf1o8_w2rUlCVEpm-w":{"text":"The muffaletta I had the last time in no way resembled the one I recalled loving. \n\nToday'","useful":8,"cool":2},"jgGDjOaFZt3xmEiE6efEPg":{"text":"I was told they have the best muffuletta in the quarter.  Decided to see for myself and I ","useful":1,"cool":0},"hY3hblLsAHjpa18d8I2iGw":{"text":"I found this place on the Food Network of all places. they suggested i get the muffalatta,","useful":0,"cool":0},"o6wt91MlT0NE5QmQyX4Nww":{"text":"Visited this place back in January and the muffuletta was to die for. I am a huge fan of o","useful":0,"cool":0},"2yzmf0-6bLdrW1FpgkNkWw":{"text":"I'm a sucker for perfectly assembled sandwiches and Central Market's muffaletta stole the ","useful":0,"cool":0},"eNzuYWClMIH59HtEv6c39A":{"text":"This is a fantastic sandwich!  A full muffuletta is too big for two people - you will defi","useful":0,"cool":0},"W80jM7qCGGM70PpsybW2tw":{"text":"Best sandwiches ever! Seriously! Grab the sandwich, grab some drinks, and walk across the ","useful":0,"cool":0},"ozPdMYCVqUas1NO879dRMA":{"text":"This muffalletta was extremely delicious and fresh! For me, the olive salad was a bit too ","useful":0,"cool":0},"Jaf05o1gRLrqGfcDV9ihiQ":{"text":"Very good Muffuletta. 3 of us shared a half so we could try other things while walking aro","useful":0,"cool":0},"4a-_dhz-oALCTBEy4Gvwzg":{"text":"Best muffuletta in NOLA. We've been here for two days now and we've gone twice...with plan","useful":0,"cool":0},"C1CQlE4N_BYzxlbu24raqw":{"text":"Believe the hype! But unlike the other tourist trap across Decatur, Cafe Du Monde, this pl","useful":2,"cool":2},"NlZjRe1yGT9d5YOOR0nowQ":{"text":"I've never tried a muffaletta before and this seemed to be the best place to go.  It was a","useful":0,"cool":0},"T6C-NjkANBlKLqkOIRVK4w":{"text":"Went here on a weekday afternoon primarily for the MUFFULETTA  sandwich. Not busy at all. ","useful":0,"cool":0},"wpbBb3dVJSJ5JOxCSsEG7g":{"text":"Walked a mile roundtrip for lunch. Waited 45 minutes in line in the cold to order a mufful","useful":0,"cool":0},"uP2Ew8obJwsH21a8nSqJeQ":{"text":"What to say that hasn't already been said?  The birthplace of the Muffaletta sandwich: a d","useful":2,"cool":0},"f6rZXOnm2-Z9HXTFhkKaag":{"text":"They don't sell quarter sandwiches. Just gotta power through and try to eat half of one. S","useful":0,"cool":0},"ox9CKb5Pky3fRmiSsvaw3Q":{"text":"I loved the muffuletta from here about ten years ago.  The line then was very long and abo","useful":1,"cool":1},"V_Qg6RxdSFD92E1-cx7QLQ":{"text":"Ok so I live in Jacksonville Florida and we have a few spots in  the central Florida area ","useful":0,"cool":0},"-4aJbOjqBUyRlVF1nhsGCA":{"text":"We ordered the full muffaletta for $12.50 and shared it among 5 people. The muffaletta was","useful":0,"cool":0},"0rsJiC58Cl0uq83qQqmI5g":{"text":"Maybe it's that we came in the last hour they were open, but I have to say that I had high","useful":1,"cool":0},"d3ikpduQRzdwL7bGtaDcHQ":{"text":"We stopped by for the muffuletta.  It was about 10 mins before closing.  They had two kids","useful":0,"cool":0},"-QIP5uvgGkFJgTesMsFaNg":{"text":"Had an \"original\" muffuletta.  Pretty tasty.\nNot very different from others I've had aroun","useful":1,"cool":1},"p8CcbxKLs9Z946JPumw0OQ":{"text":"I love their muffaletta sandwich. So much that I didn't balk at standing in line for 20 mi","useful":2,"cool":0},"sL7_OMb3yjYWuAgqoJmX2A":{"text":"Ya know how Italians take both their hands to their lips and blow a kiss? Well, that means","useful":0,"cool":1},"o5TT3-0LpueRrYLJJ4QpZQ":{"text":"Sooo...not much to look at from the outside, S.O. wondered aloud, \"whatcha wanna go in her","useful":1,"cool":1},"6-IvA7DI18QNMTszQIaLKw":{"text":"RUDE CUSTOMER SERVICE!!  I went in there and ordered a 1/2 muffaletta for $9.50 + tax and ","useful":1,"cool":0},"RcuAcMNxfvA3QSGXwq4iUA":{"text":"this place has the best muffaletas. order at the counter and eat at the seating area in th","useful":0,"cool":0},"QRKwTLsr2dHNJWnOPrXT7A":{"text":"We arrived here at about 11:30 am on Good Friday...the line was just out the door and quic","useful":0,"cool":0},"nxxnFAPLP92oEJDJyP30iA":{"text":"All I can say about this place is \"wow.\" Great food, good price.  Believe the sign over th","useful":0,"cool":0},"YUlOH2uHOgsvoe0LM8xZTQ":{"text":"Be sure to have your first muffuletta sandwich at Central Grocery.  It's worth standing in","useful":1,"cool":0},"oLLduxEAo5KlMub8Z4J8Zg":{"text":"Mmmm ,frikin delicious worth every penny.They are good cold actually think i like them bet","useful":0,"cool":0},"ZPzGyNk19tPFWevngfxYBQ":{"text":"In the French Quarter, Decatur Street across from the French Market, on the North side of ","useful":0,"cool":0},"WDHsdgmaIh9mFiVWBjet7g":{"text":"Central Grocery's muffaletta is absolutely the bomb!  A perfect balance of great bread, de","useful":0,"cool":0},"k9cbUMaDjVejUGFjC3t1ZQ":{"text":"THE place to get Muffalettas. They're so good and big it borders on obscene. Bring friends","useful":0,"cool":0},"H0WHR5aiv9g51-2DkN5EpQ":{"text":"An absolute must-do when in New Orleans. Twice we had a muffuletta for lunch and would hav","useful":1,"cool":0},"tbd9aNMYqpycMLVr3ARdww":{"text":"Not a fan of the line, but I am a fan of their muffaletta. Wow, huge! Was perfect for my g","useful":0,"cool":0},"t7fJwef_sgCoTR3xNuqHsA":{"text":"Yum, yum, yum...fantastic muffulettas!  Beware they are very big...good for splitting!  Cu","useful":1,"cool":0},"0jWZh5P1o-4QK-JYU-MG5w":{"text":"Visited the Central Grocery on my visit to New Orleans. The wait was out the door, but the","useful":0,"cool":0},"XiVWlVdKqxh8ZYdsU0DFVg":{"text":"The one and only Original Muffuletta! There are no substitutions for the real thing! This ","useful":0,"cool":0},"610PhwHwhKqoeeNl6ehvvw":{"text":"If you like Muffulettas or sandwiches filled with tons of meat and cheese, then you have t","useful":1,"cool":0},"PlWQKecAv7L-1xqJd2Cq1Q":{"text":"When I was a kid this was the place for muffalattas. I think it went downhill somewhere af","useful":0,"cool":0},"qKNb7jNb1bMtfTvxHI997w":{"text":"I love subs, grinders, hoagies, po' boys, all kinds of sandwiches.  I love Muffulettas.  C","useful":0,"cool":0},"x2IP-CDJKHt_ZTBGm3UHew":{"text":"Stopped by at 11:30 am on a wednesday with plenty of Muffuletta's left over. \n\nI stopped b","useful":0,"cool":0},"o9f5TQ3jRmHJje2JFyTmfg":{"text":"Been waiting YEARS to come back here.  The best 11 I've ever spent for 1/2 a delicious muf","useful":0,"cool":0},"P9A7wyjMU_N5v_brCK4a5w":{"text":"This was the first place we visited on our recent trip to New Orleans.  Both my wife and I","useful":0,"cool":0},"Y1A6FKHnRvxDfr6Y4korcA":{"text":"Best muffaletta ever!  This place was great!  There was a line and seating is limited but ","useful":0,"cool":0},"-B_BiVA1qF35yZaGo9r8Hw":{"text":"I lived in NOLA for 5 years and it was only after I moved away that I went to Central Groc","useful":1,"cool":0},"jaoZ4ETmU9BQfnM9C4mXOg":{"text":"This Muffuletta is a strange sandwich. The flavors are so serene and mild that they flirt ","useful":0,"cool":0},"Crnq0YzWGEbtzba4rMTP9A":{"text":"Every time I'm in NOLA, I go to Central Grocery for a muffuletta. Theirs is SO good!! This","useful":0,"cool":0},"wOnXbYwI2j8ZXrjQ_pyG5w":{"text":"Outstanding muffuletta! Best I have ever eaten. Voodoo  chips were great too. A must stop ","useful":0,"cool":0},"skMXC76_zrLZcyKLY27Uuw":{"text":"Fun! This place is really a grocery store, but you can eat in the back. \n\nWe never ever go","useful":0,"cool":0},"BYqA9bq02g6XaMIBrQ8FVA":{"text":"The muffaletta was good but not worth the wait if you don't have a ton of time. We got the","useful":0,"cool":0},"1dtgQMGL5h2gS1FLOuezFw":{"text":"Coming from New York not worth it. If you want to compete with New York there needs to be ","useful":0,"cool":0},"2rUOrrIgEFt06Zuy7JWalw":{"text":"Good ratio of meat cheese and bread! Pro tip: A whole sandwich is about the size of a larg","useful":1,"cool":0},"tzoY1FGvCXC3iCGcqWa9lA":{"text":"Ranked in GQ as one of the 10 best sandwiches in America. The Muffuletta.\nIf you don't lik","useful":0,"cool":0},"89oUgGJYB1HamYd0nUY6sw":{"text":"Come every time I'm in NOLA. The original muffalatta have to get at least twice and jars o","useful":0,"cool":0},"SJjNmdNhgu69TcPcc1hf8w":{"text":"Visiting from Chicago, as seen on the Food Network, this was a MUST!! Figured the Hubby & ","useful":2,"cool":0},"BiUSX7HSh8kawBdR3HwynQ":{"text":"Sad to say Central Grocery no longer lives up to my prior enthusiasm.  While still a good ","useful":0,"cool":0},"CT8emJj2bHYYc99JVCITbg":{"text":"Central Grocery muffuletta saved my life.\n\nCentral Grocery muffuletta has the power to hea","useful":1,"cool":4},"qlZzMk4yvYtotDLO9C_HMA":{"text":"The muffuletta was huge and delicious and everyone was very friendly. They have tables in ","useful":0,"cool":0},"HrsoEiIXvod99rbI9BvKzQ":{"text":"finally got to try the muffuletta this time!\n\nthere can be a wait, but if it's not too lon","useful":0,"cool":0},"Y0St4AIdzq-J8emuF07X6w":{"text":"I was so, so eager to visit Central Grocery and try my very first muffaletta on a recent t","useful":1,"cool":0},"v03WtOvhEOMozwohKni3TQ":{"text":"Walk in and this place reminds me of Claro's Italian market.  Only difference is that they","useful":1,"cool":1},"CwAeV4BaDeMZ2e96DlA_PA":{"text":"man ive never had a muffuletta or a three way, but after having a muffuletta from this joi","useful":1,"cool":0},"21JHHqMK4o0mxulanLf7EQ":{"text":"Let's start with the cons:\n\n1. Long line\n2. In the tourist district\n3. One sandwich\n\nThe p","useful":1,"cool":0},"uzM5o_WVX_D2wlX3QVXp6A":{"text":"Happened to be walking by and it seemed like a neat place to stop for a quick bite to eat.","useful":1,"cool":1},"c_2xzp238vBmGgOBnqrQTg":{"text":"Ohhhhh YuM!\nWhen I would head back to FL during a semester break, I always picked up a few","useful":1,"cool":1},"QQF-lOstMJsEn8rfi89nkQ":{"text":"I've waited years to get to NOLA and try a muffuletta ever since I saw a throwdown on Food","useful":0,"cool":0},"iK4Coo3IPbHt_2PCq-MRiw":{"text":"We came, we stood in line, got served very rudely (seriously, would it kill you to tell me","useful":0,"cool":0},"5PQs_H_G9P5Mhmu_GKO1gw":{"text":"When you first walk into this old grocer, you will see all kinds of weird canned & pickled","useful":0,"cool":0},"TLnCS1x9AQSXLLyxLLmntg":{"text":"I've heard people say that Central and its signature sandwich are a tourist trap. I've hea","useful":2,"cool":0},"3J8NiaKWQxJIjsNB12okpQ":{"text":"This place was highly recommended by locals to get a muffuletta sandwich, so i had to try.","useful":0,"cool":0},"JUxtJUhx7e5gSyh_MJrOkQ":{"text":"I'm in NOLA and I had to see what the hype around this muffaletta was... we got the quarte","useful":0,"cool":0},"XCQav2x7VYBGC0SYzCzxlg":{"text":"Whoa!  I was here last spring, the muffalettas are divine.  But let me just advise if you ","useful":1,"cool":1},"8oaazOQJmURnauSx1WmSZg":{"text":"Muffaletta - Two slices of cold cuts and dried out bread. Worst sandwich imaginable. Servi","useful":1,"cool":0},"EzExQ57kAc-cy2142C1gaw":{"text":"If you only eat at one restaurant in the French quarter, this would be a great candidate. ","useful":0,"cool":0},"l1LwwjV-ETD6hjFjJmE9fg":{"text":"First time I ever tried a muffuletta , and it was delicious!!! Loved loved loved it! Every","useful":0,"cool":0},"JvWVIHqE_61mUjK59704_Q":{"text":"I hate olives. I love local eats. Despite my usual distaste of olives, I loved the muffela","useful":6,"cool":4},"OEjDkMaiwpjEakwVouaKCQ":{"text":"Had to make sure to send two quarts of olive salad back home to make muffulettas ... just ","useful":0,"cool":0},"8h2PFLvzuTolz6p_0MULkA":{"text":"The Ultimate muffuletta ... it's where it all began.  Salvatore Lupo, a Sicilian immigrant","useful":0,"cool":0},"DhztSVrcSOU_eCEcx0QQUw":{"text":"Delicious muffuletta!!! I am back home now, but wishing I could eat a muffuletta for break","useful":1,"cool":0},"dZvdMR-53Gqm-eRsnrewDQ":{"text":"The sandwich was so delicious. I don't know why you would go anywhere else. We went kind o","useful":0,"cool":0},"_VPn4_PZj-4mda-0zLrxYw":{"text":"Great little gem of a spot.  \n\nFirst - after reading some of the reviews where people were","useful":0,"cool":0},"DQrO5tnbm8LG26gYHLDuQw":{"text":"Justifiably ranked among the best (if not the best) Muffalettas in town.\n\nA whole will com","useful":1,"cool":0},"AYs95yyLDu9C25ISb4qBSA":{"text":"The home of the muffaletta. This is a must-eat local sandwich, we get one every time we're","useful":0,"cool":0},"x38hDl7OaOeaUoSZejctKw":{"text":"The muffuletta was good & as huge as they are supposed to be. Their style is cold, which l","useful":0,"cool":0},"cLrgT1V_Ae8JEubevlQb2Q":{"text":"most delicious muffuletta in the entire world!!!  the muffulettas at central grocery are t","useful":1,"cool":1},"z9wlpzKGAMmaHJ_st36myQ":{"text":"We came for the muffalettas, which are a olive salad sandwiches. The prices look really ex","useful":0,"cool":0},"fkNhjLy7TKvXSLzrbx3diw":{"text":"We went to CDM which was less than a block away and a couple of people in our group walked","useful":2,"cool":0},"D-QY6DLU8a75XvqyRzVH8A":{"text":"The Muffuletta's here are to die for.  I was informed by a friend of my family,  a former ","useful":0,"cool":0},"Jk0ifhx8jzWqPeoCkv-N7g":{"text":"IT stays a five in my eyes its the best muffaletta sandwich anywhere. Took a friend from G","useful":0,"cool":0},"l165X6iiKgpeci3r-w63DQ":{"text":"I saw this place on Food TV and being the fatass I am....landed in New Orleans, had some C","useful":0,"cool":0},"6FjljJ71vSvTM_po1YCgGA":{"text":"Step 1: Arrive in New Orleans and head directly to Central Grocery. \nStep 2: Order a whole","useful":3,"cool":1},"dCFbpFiXRyaUWpGYlw-n5Q":{"text":"If you're a tourist you're going to come here and get the muffaletta - a heavenly sandwich","useful":0,"cool":1},"Dh2jQHcimF-XElnkBJ-phg":{"text":"Seen on tv and locals talked about how good so had to go. Just got half and it was plenty ","useful":0,"cool":0},"KwR_TqDeQEFAohOvY99SEg":{"text":"Ah yes, the obligatory stop at Central Grocery for a muffaletta.  Home of the original, bu","useful":0,"cool":0},"KHAzRunGI3sUzhjFd3XdIw":{"text":"Convinced myself to come here for the muffaletta. Seriously, had to talk myself into it as","useful":2,"cool":0},"mkVbnYHLNxQYDd5xYxgjzg":{"text":"Come for the smell, stay for the delicious muffaletta. I was walking back to the car after","useful":2,"cool":0},"B-ahJjgdnNkHOij9y_ag0g":{"text":"Oh central grocery co.'s muffaletta  how I yearn for thee. It was seven years ago that I t","useful":0,"cool":0},"nsKhmQA46p9VfiUWW6W-Ew":{"text":"Awesome grocery store with world famous muffulettas!  If you're looking for local dishes o","useful":0,"cool":0},"N7Q2-TPYhqBBJiDdTHopYg":{"text":"Muffaletta: the crack cocaine of sandwiches.  You would be stupid not to eat here.  This i","useful":1,"cool":0},"HO5eMcGiGFtDnPWEnCVFMA":{"text":"Delicious muffaletta!!!  They only do them cold here, so for those of you who like them ho","useful":0,"cool":0},"Vg0A5sZmtAftAAcDAZ8nFg":{"text":"Yep  -got the muffaletta.   What am I going to say that 1000 other people here have not al","useful":2,"cool":2},"0Z5RCZV05XxjyHmzp7EdiQ":{"text":"The best muffuletta.  Every time we come to New Orleans we come here. The bread and the ol","useful":0,"cool":0},"Cvx-SLrmOtCBWuZfIpfTKg":{"text":"The line was out the door, though I am not sure how many were tourists and how many were l","useful":0,"cool":1},"_4oanfsd9o0kr94n5ycxlA":{"text":"Muffaletas are large, greasy, and delicious.  I got whole to spit with some people, but co","useful":0,"cool":0},"aEFeFZm22khuF0vDX34jcQ":{"text":"I didn't fall in love with the muffuletta at this New Orleans hot spot like I hoped I woul","useful":1,"cool":0},"pDniLrCkCG4BkIzXLXU9Fg":{"text":"Very interesting place.  Kind of reminded us of the soup nazi.  You can order a half muffe","useful":0,"cool":0},"txbC3XRKG_e520BbWzUBJQ":{"text":"Best Muffaletas in town, hands down.  The only reason we're not giving it five stars is be","useful":0,"cool":0},"EW7T2cz_vb2gDBfQRKMV7g":{"text":"The Muffelettas were OK.  The grocery was fantastic - I bought food stuff as souvenirs for","useful":0,"cool":0},"MoGTPs4HYv35Qy9aq9cQ1A":{"text":"I have to say the store is very unique and I bet it is one of the kind in the city. I woul","useful":0,"cool":0},"1iOXUfrN5yLZ84G95e_aEA":{"text":"Ottima Muffoletta, panino tipico di New Orleans ripieno di salame, formaggio e verdure sot","useful":1,"cool":1},"6fK_sXIeNMywD0j9ehw0ww":{"text":"Absolutely lives up to expectations.  A delicious sandwich for sure.  The store is also st","useful":0,"cool":0},"I9Xh7qDIIA_ZoVUYUhMSdw":{"text":"The best Muffaletta sandwich ever.. If you are in New Orleans, you have got to check them ","useful":1,"cool":0},"IgFcKNyCZpoeqQiszjBB7w":{"text":"For years, I had heard about Central Grocery and its muffuletta sandwiches.  When I visite","useful":0,"cool":0},"SMc9c9ZII1gcsGefE3WQ4Q":{"text":"We walked an extra 20 minutes to Decatur St. pick up one of these famous muffuletta sandwi","useful":2,"cool":1},"WhoXjh-HGwePIDTRw7ugxQ":{"text":"friendly people and great muffulette, my friend Britt usually gets one for the trip home","useful":0,"cool":0},"B1Grm80QCULGzbl_g1rFUQ":{"text":"Man this was a good muffuletta! \n\nIf you have not experienced this sandwich, I highly reco","useful":4,"cool":1},"Ga-iZK_UF-9fZpLmlvNuYg":{"text":"Excited to eat here and walked away a little disappointed.  Staff wasn't friendly. Sandwic","useful":3,"cool":0},"7q72mS4bv6pZ694VGSWCuA":{"text":"Oh man, what a sandwich.  One sandwich is enough for 2 people.  The line looks like it's l","useful":0,"cool":1},"mDwVe9fxPr956GORoDMhEA":{"text":"Do not pass up Central Grocery on your visit to NOLA.  Not every muffaletta is created equ","useful":3,"cool":1},"Z7HgouGAD2dalRRbgs-6CA":{"text":"I didn't love that the ONLY thing on the menu is the muffuletta (and some sides). Pigeon h","useful":1,"cool":0},"aWkGi_nxs5cfce1ock8X8A":{"text":"MUFFULETTA. That's what we went in for. What else?\n\nFortunately for us, there was absolute","useful":2,"cool":1},"5oZsNDgp54ujCpZOmlSN4g":{"text":"Well this is a very popular hole-in-the-wall, mom-and-pop type grocery store.\n\nThere is a ","useful":7,"cool":5},"VZBRv7N-gm3O8vpK-rLhVQ":{"text":"Very disappointed on this last visit. The muffuletta's used to be packed with meats and th","useful":0,"cool":0},"sXxVmd-Vu_kGIgZ-0IxubQ":{"text":"Central grocery was one of the first places I visited in New Orleans. The first time I vis","useful":0,"cool":0},"IiU1Th0soYuTDkbyg7je5g":{"text":"Being that mufflettas are my absolute favorite sandwich I had to give Central Grocery a tr","useful":0,"cool":0},"I9bvEi7T_5avuf8Og6xEUQ":{"text":"I had never heard of a muffaletta sandwich before I went there, but my sister-in-law reall","useful":0,"cool":0},"pM1uywFZw_2uN_PeYw-hrg":{"text":"When I found out that the muffuletta originated at Central Grocery, I had to try it! I jus","useful":1,"cool":1},"0ai94Uc-OwwqwiaBEHL04A":{"text":"It's all about the olive salad and olive oil, enough said!  Owner was a little on the aggr","useful":0,"cool":0},"ZG9Q4rAnqKh1SHK7H247FQ":{"text":"Prepared in advance, the sandwiches are not fresh, the bread is a bit stale and the sandwi","useful":2,"cool":0},"sNToQZxqon-IBipIKkkSjw":{"text":"THE ONLY PLACE TO GET A REAL MUFFLETTA....we go here every time we visit NOLA and they nev","useful":0,"cool":0},"a1lqeXaPCBcViZmNiYwr-A":{"text":"One word - muffaletta. We went here, 35 minutes after checking in, and immediately after s","useful":3,"cool":1},"d9Azo4IuqJoEteJ8t8mfzQ":{"text":"My mom really liked this place but I didn't think it was that great.  I got the spinach wi","useful":0,"cool":0},"gzdG0HmLmDV8h6HE1VSIkA":{"text":"Yes, we stood in the ridiculously long line waiting for the original muffuletta  sandwich.","useful":0,"cool":0},"J7xVV2Dha1LY_vqjP6Z-Ig":{"text":"This is the best place to go for a muffuletta and all of New Orleans. I have been coming t","useful":0,"cool":0},"imz36SqgN54jltoTJciJIA":{"text":"What's there to say, the original muffuletta! I honestly prefer a hot one but there wasn't","useful":1,"cool":1},"lu4OJzeFEJRXkzg1EQVldg":{"text":"I've heard that this was the place to get muffalettas, so I had a try it. At first I came ","useful":0,"cool":0},"Vq_5f5m1Rl3S_CVABt4_Bw":{"text":"It's as good as everyone says!!! One sandwich will feed four, and I had a great time waiti","useful":0,"cool":0},"8ogkSaUc-TZ67ndJHMRdpw":{"text":"An institution in the French Quarter, the flagship product at Central Grocery is certainly","useful":1,"cool":0},"H6mslqmEphdFsrMZ7npH0Q":{"text":"Loved the muffuletta at this place! You can get a whole or half. We decided to share a hal","useful":0,"cool":1},"_UylqREhNjpRjB66guLLDA":{"text":"Everyone on Yelp mentions the muffuletta. Apparently, this place invented the muffuletta a","useful":1,"cool":0},"uUf5-2QJ1u5wm-BwRONJFw":{"text":"Another staple when I visit the Big Easy.  OK, its just a sandwich, but dang, everything i","useful":1,"cool":0},"JaFsR-uLXc6wjvSx-5J2lw":{"text":"It was a good sandwich but I am not sure what the craze for muffulettas was for. \n\nPortion","useful":0,"cool":0},"ItBrcEEjGAlrW-YKda70RA":{"text":"Wow! I have never had a muffuletta before, but now I have and i will never know a deliciou","useful":0,"cool":0},"mAvCpMKK9_1CqW7_TKw6uQ":{"text":"BEST MUFFALETTA EVER Never thought I would like a muffuletta as much as i do now. Lines ge","useful":0,"cool":0},"vP-MbcAn_2fzQYcOyEgG6A":{"text":"I've never had a muffuletta sandwich before this, but it was AMAZING. Stopped by on a Tues","useful":0,"cool":0},"Ao_NYhEubqcN6ORqACSY1w":{"text":"The muffeletta sandwich was A+++++++++++++ absolutely delicious. You must go here if you a","useful":1,"cool":1},"DtjMInvZH5o9pvgJtYrcEg":{"text":"The muffaletta: tried it for the first time. Don't understand what the hype is all about. ","useful":0,"cool":0},"FblGepwSnAY-E-V0UXfPmg":{"text":"One of my all time favorite sandwiches anywhere in the world.  \n\nThis place is down in the","useful":0,"cool":0},"f-ZkZdxCzShzy53MOAiZRg":{"text":"In the same way there's no point in eating pastrami outside of NYC, there is no reason to ","useful":0,"cool":0},"UG6FwkTKvhC3ZRlqOMFEbg":{"text":"Muffalettas are pre-made and prepackaged so the long line goes by very quickly. Even with ","useful":3,"cool":3},"hogeOM5AaNbDhpK3vpTlxA":{"text":"Went here yesterday afternoon--the grocery itself doesn't carry anything that you couldn't","useful":0,"cool":0},"cT-e8EmtQH-mbFlVTFJ-Wg":{"text":"Had to try the iconic muffaletta from the original place while we're in NOLA. Wasn't disap","useful":0,"cool":0},"xlppVX8_ysnPr2d7_maKCA":{"text":"No matter how much we try, we just cannot emulate the Central Grocery's muffuletta at home","useful":0,"cool":0},"IRhSniBDRMsy5Ld3PLg1mg":{"text":"I don't like olives, but the sandwich was absolutely wonderful. It just all worked nicely ","useful":1,"cool":0},"QXcrBEnzuebmaOtkSgnWXg":{"text":"My stars are based solely on the Muffuletta. This is the most tastiest sandwich I've ever ","useful":0,"cool":0},"CnJzlJezQn6fgltaqEHJZQ":{"text":"Best Muffuletta in New Orleans however the cashier frequently has an attitude even when it","useful":1,"cool":0},"HO7ch4x351qa1uNA0eFqZw":{"text":"What does a foodie buy as souvenirs for her friends & loved one?? Food of course!! \n\nCentr","useful":1,"cool":2},"HeWfGopl9yJJPBTlbwvISg":{"text":"Absolutely floored by the sandwich! Heard so much about it but it was the first time going","useful":0,"cool":0},"LpHjY8fNY5MpVelHOCWetQ":{"text":"WORTH THE WAIT\n\nI had a couple of different sandwiches including another muffaletta from t","useful":1,"cool":0},"qpamInpnAQ7uwjmb1fLqLQ":{"text":"Had to come here for the famous muffaletta sandwhich. Did not disappoint. The sandwhich is","useful":0,"cool":0},"9Vs4IeNVCSHrV1x5iX4pMA":{"text":"Famous for the muffulette sandwich. That's what we ordered to take-out for dinner.\nA small","useful":0,"cool":1},"9oSteRXZ0ZqYEsNGn8BwRg":{"text":"My Dad brought me here when I was a little girl, and there was no line, to get a Muffulett","useful":3,"cool":1},"KgZQCswwpDC6EhL9G8N_mw":{"text":"Had the HUGE big as your head muffaletta for $14.50. Split it between 4 of us and it was t","useful":0,"cool":0},"4sMIJNSm4Imza85FH1Pjuw":{"text":"I went strictly to order their famous sandwich and am so happy with my decision!! I dint e","useful":0,"cool":0},"Vbf3bfF9Re1DlVlsJ2WgqQ":{"text":"Yes, the muffulettas and the olive salad are fantastic. Yes, the place is quaint. But I ha","useful":2,"cool":1},"EEKt5jNKCA9qmOKjRwY1PQ":{"text":"The muffuletta was decent. Maybe if it was fresh made the bread wouldn't have been so hard","useful":0,"cool":0},"fXG1XsHQDtMmUv5shO4a8g":{"text":"Visited Central Grocery at around 10:00 am to grab their original mufuletta before a fllgh","useful":1,"cool":0},"pSve4rKPls1_WEZfRMhNvA":{"text":"Birth place of the Muffuletta sandwich while in The Big Easy? You bet yo' sweet gram mamma","useful":1,"cool":1},"KGO7Q6IDE6KFgw0tm-mTHw":{"text":"This is not a restaurant .. it more a grocery store all kinds of good stuff ... I went to ","useful":0,"cool":0},"04x1-xjGMwGTgwzcPLx3Xw":{"text":"The muffulettas are the BOMB.  Get there early to avoid the lines and get these sandwiches","useful":1,"cool":0},"A8it9JE-qX6d8sPyrJAG-Q":{"text":"I've only been once (early 2005) and the line was long in the afternoon.  The store is sma","useful":0,"cool":0},"3obGVrkTTQEYIWuVzDmP4A":{"text":"I went here as a fan of the muffaletta. This place claims to be the founding father of it.","useful":1,"cool":1},"Qly8B2VqzthiZIJ333VV9g":{"text":"Muffulettas! It was good, compared to all the other muffulettas that I had. Super fast, be","useful":0,"cool":0},"S3UzMILNUbm6HUH0Uh9M7w":{"text":"I was really excited to get the muffuletta here based on all the good reviews and \"places ","useful":1,"cool":0},"Md1Jq_J5QMYYMdLVFFSbGw":{"text":"So, I enjoyed the muffuletta and all, but it wasn't all that it was cracked up to be.  Whe","useful":0,"cool":0},"bqRg4IsqH01Zvz3pDt05qg":{"text":"My first experience with a muffuletta.  My mom has told me numerous times when she goes to","useful":1,"cool":0},"OsiyaY0-eCU3ZVPACqUD7w":{"text":"i had the 1/2 muffaletta.  i ate 1/2 of it and wrapped the rest it up and slid it into my ","useful":0,"cool":0},"5bD3UWhajAbPbXy5UxcHyg":{"text":"Very nice Italian grocery with its claim to fame muffulettas but the sandwich was ok.  The","useful":0,"cool":0},"T5Uk9VQWDdOHcRRYeRP81A":{"text":"I really love this place it is just so authentic. I must admit I have never ordered anythi","useful":0,"cool":0},"nBWnSz9tysdvzKeN7FoIKA":{"text":"I haven't had Central Grocery's muffuletta in 7 or 8 years...They are still incredible and","useful":0,"cool":0},"IUbDEDpvGccI1zJ-AGZa1w":{"text":"The last day in NOLA meant we had to start the day with beignets in cafe du monde and go s","useful":2,"cool":1},"T-kScO2jD-hDrW0p5N1gYw":{"text":"5 stars, ALWAYS 5 stars.  Don't be nervous if there is a line.  They have it down to a sci","useful":0,"cool":0},"9vWBUY3fKOb_5uywkolvBQ":{"text":"You wont find a better muffuletta in the world! Good luck trying!","useful":0,"cool":0},"XilE9DOatDxfcuknRcBSTQ":{"text":"This review is solely about the muffelettas, not the grocery itself.  We bought some white","useful":3,"cool":0},"YjAMCRhGLzZK_ZUgN0AVDg":{"text":"If you're visiting this is a must try. The half sandwich is good to split between two peop","useful":2,"cool":1},"QP_Cez1D-iqz7d2JphrEBQ":{"text":"Man was the wait long, but totally worth it! Bought a whole muffuletta before my flight ho","useful":0,"cool":0},"tRCLRDSZA-bbbmy_2CR-1Q":{"text":"This is a MUST VISIT when you are in New Orleans. Accept no imitations, wait in line if yo","useful":0,"cool":0},"0C6GpyvHsv3S7JO-w-LZGQ":{"text":"This place is awesome. Just a little old specialty grocery tucked into an old storefront i","useful":0,"cool":0},"ujj4WWUGWEs7Hj3eNEGdOQ":{"text":"Efficient little market with Italian goodies. Shared a muffelatta and can't wait to try an","useful":0,"cool":0},"eP2Oa5XFwpw9MLaKzEnqeQ":{"text":"I live in Philly and I am not a fan of cheesesteaks as all of our cheesesteak places are t","useful":5,"cool":1},"UEIRO8uARmgADoDxhI6H1w":{"text":"For muffelata's bigger than your head, try Central Grocery Co.  Usually the line extends o","useful":1,"cool":0},"JKMGshdpxtDP6f00IqxSdg":{"text":"World famous (?) Muffuletta.  \n\nIt's everything you love about an Italian club in some kin","useful":1,"cool":0},"gr1Rl5wOvf5A1yrw6jSZaw":{"text":"Drinks are strong and food is good. Located right in the French market. This is the best p","useful":0,"cool":0},"xpoSyriQ8tmVqiMrf38jug":{"text":"Another great muffuletta stop. They are the best i have found in NOLA.","useful":0,"cool":0},"Y0PcvF4wo_5L-LA4OaX1pA":{"text":"Mufaletta was bigger than my face and absolutely delicious. Definitely can be shared betwe","useful":0,"cool":0},"fBp6Vyn18i3RBcrhr4bANA":{"text":"I walked 25 blocks to taste the original and still the best. Gotta have dat.","useful":1,"cool":1},"33b2VorkJDnffJR4vSys2w":{"text":"Central Grocer is just a normal grocery shop, and it doesn't look really impressive when y","useful":0,"cool":0},"q5dP7wmqs4cjnX0UpKzs7Q":{"text":"It's a great little mom & pop shop that gets pretty busy. Seriously though stop in and get","useful":0,"cool":0},"RwmK4iZl7Ec0jhuiNYM71Q":{"text":"Had to have the Muffeletta that everyone says is a must have. Popped in right before the l","useful":0,"cool":0},"1JEw0oGaNiFGgcroYBmX4A":{"text":"I had a Muffaletta the first time I went to NOLA 3 years ago and I can say i have never ha","useful":0,"cool":0},"W2IehFq9AVZyYnp37_VSCg":{"text":"The highlight of our trip!!! We had the muffuletta 2x at the store while we were here visi","useful":0,"cool":0},"6hG2ocPdhkMlcavRp7qRBQ":{"text":"Muffaletta, the King Kong of sandwiches. This is where it resides. \n\nThe staff that sells ","useful":1,"cool":1},"DmSee3cUfo2Ne9obXJDpfw":{"text":"This place has the best muffulettas in town. They are usually busy and a wait is expected.","useful":0,"cool":0},"_AGtaya0tCE5keDZXODPuQ":{"text":"Absolutely LOVE this place. I had my first Muffeletta here and I've never looked back. I c","useful":1,"cool":0},"HeuV3tDq_wBsvmYxa3kkQw":{"text":"It's in the heart of the touristy quarter. It's still doing its thing. The muffelata is st","useful":0,"cool":0},"wq1bphEsEAohuGSYIrKGtQ":{"text":"The store itself is so iconic, don't let the three stars deter you from going. Go! For sur","useful":3,"cool":1},"r21ImZjyAfFAehjXksuR1Q":{"text":"Central Grocery is home of the muffuletta, one of New Orleans' greatest culinary invention","useful":0,"cool":0},"5KIo70wdhsbqdRc1TcRFsw":{"text":"The original muffaletta place! Its a quaint Italian grocery with such an old world vibe th","useful":0,"cool":0},"oJPRknudJ7_OCMVnOtIzLg":{"text":"The muffuletta  changed my life. One of the best sandwiches I have ever had, and I have ha","useful":0,"cool":0},"XdVy6AKI9Ss8ZjC2KeQgyg":{"text":"Excellent muffulettas.  Bread is fresh and tasty, olive salad is just the right amount of ","useful":0,"cool":0},"-mTGC16NtKUl_Ze2knv_iQ":{"text":"The original and the absolute best. Many try to imitate them but the difference is the bre","useful":1,"cool":1},"VQ4px2xsi9spFT867doKcQ":{"text":"A must go to every time I'm in NOLA. Central Grocery Co. invented the Muffaletta sandwich.","useful":0,"cool":0},"E2XqNH4oqMircq96EkFStA":{"text":"Oh my goodness, the muffaletta sandwich here is OUT OF THIS WORLD!!!  The olive salad in t","useful":0,"cool":0},"jEdXpy3cPU9NultZHgObaw":{"text":"After our beignet feast we thought it would be a good idea to take a walk through the fren","useful":5,"cool":3},"Kqiqf02jwnJT_FcaHXwNaw":{"text":"Yum!  The muffaletta here was delish.  I don't understand why the line moves so slowly tho","useful":1,"cool":1},"o5BrXMnWfzn3aBFHUczIxQ":{"text":"Oh Dear Lord, the muffuletta sandwich is pure perfection, and Central Grocery is home to t","useful":1,"cool":0},"UAb5jH-Uc-37vJtuIZZoBQ":{"text":"This place was on our list of places to try when we were visiting New Orleans.  We were ru","useful":1,"cool":1},"Bwx70p5bRsqh4UnJrmGAug":{"text":"When I stepped into the Central Grocery, I was immediately transported to my childhood in ","useful":1,"cool":0},"OL9knMC_wTCEDaY6MPpWYQ":{"text":"Muffuletta! Need I say more?  Make this your first lunch stop when visiting the French Qua","useful":0,"cool":1},"5mc7Je58d7aozxY8jt0gvg":{"text":"I've never spent $20+ for a sandwich before, and I don't expect to again. But I must say, ","useful":0,"cool":0},"ZwDjU79yMCsc4lofk8ZtBw":{"text":"Really, What's the big deal?  Besides looking like a cool NY type deli and having canned a","useful":0,"cool":0},"nCAgAD4U3-IU-5sb4VeJmA":{"text":"The muffuletta sandwich has its origins at the Central Grocery in the French Quarter of Ne","useful":2,"cool":2},"R1uwto-qHrAQkQfx_HTCNw":{"text":"This is a local hot spot. However I wouldn't go back the sandwich was very salty and it wa","useful":0,"cool":0},"8qAuOlLojWD1BjnYwYuDCA":{"text":"Probably the best muffaletta you have every had. Hands down.. I have actually never had to","useful":0,"cool":0},"IhBQgKtd030IMFRqQ1VnOA":{"text":"Forget for a moment that this place is in the heart of touristville in the French Quarter.","useful":1,"cool":0},"YEZrawDjZx39HLP38eqetA":{"text":"Love the muffalettas at Central Grocery!  The line is always long, but it's definitely wor","useful":0,"cool":0},"HRKSIgdrX4RcMeVeEJFtbg":{"text":"The one thing you should keep in mind about Central Grocery is that the muffaletta is the ","useful":0,"cool":0},"WuOW-PUyFtGw5IDM9yKcug":{"text":"People have tried to dupe the muffuletta olive spread from the sandwich counter in this st","useful":0,"cool":0},"kJ0HyG9MFameAOnqW8CXYA":{"text":"I came here for the muffaletta and BOY DID THEY DELIVER.\n\nI got half, and finished it all.","useful":0,"cool":0},"NJVdbTy5PFAF1oqOQ1PEsg":{"text":"This another institution of New Orleans: The Italian muffeletta sandwich. For our last mea","useful":1,"cool":0},"6VQf45zraHI2VcOs_FqjbA":{"text":"A great market/deli adjacent to the French Quarter! The muffuletta here is all the rage as","useful":2,"cool":1},"KtBKcPv8Gkag0AB9upKz5g":{"text":"Absolutely worth the hype! The muffuletta was so good that I went back for a second to tak","useful":0,"cool":0},"yJ5YohMHReru-209bUN-vw":{"text":"This was our first food stop upon arriving in the French Quarter. We walked right upon thi","useful":0,"cool":0},"UDyBpbsczVR-MR8xZ2ksMQ":{"text":"Bought a muffeletta to share with the family. So filling, some was left over for dinner la","useful":0,"cool":0},"1DGrhwIS9Th2T7KYTJqS3g":{"text":"What a gem this place is. Amazing muffuletta. Basically an Italian meat sandwich with deli","useful":0,"cool":0},"XUUY0FO-jGUjBdvM7l85Ew":{"text":"Do not give these jerks your money. I went in after reading the reviews here and paid elev","useful":0,"cool":0},"5MlFzBd5xpxc8P52jHSVRQ":{"text":"If your looking for the worlds best Muffaletta then you should stop in and prepare to be a","useful":0,"cool":0},"sLIpOTSOtKsZZedBOLK4sQ":{"text":"It's touristy but it's just so mouthwatering good. There is probably going to be a line to","useful":6,"cool":1},"fTKxi4MFiY9RF8gP-fph5g":{"text":"Go figure! An Italian sandwich mecca on a tiny street in New Orleans? Yessir, I say. \n\nIn ","useful":1,"cool":2},"BOK52CLgtjQPt1gNa98FDw":{"text":"Muffuletta oh muffuletta, THANKFULLY you are not a staple sandwich of my home city. Being ","useful":0,"cool":0},"dvcWsGRiDLAjQWmEHLCG8g":{"text":"Bread is lite and airy. The meats and cheeses are very fresh. The olive spread is not over","useful":0,"cool":0},"1-LwW1jbKt9NpkR8lCyAlA":{"text":"I'm not a big fan of olives, but I really like them on my Muffulettas! After hearing rave ","useful":1,"cool":0},"Ih4kMwKzF4ewc483fMreXw":{"text":"This is one of the must-visit places in New Orleans. A muffuletta is just what the doctor ","useful":0,"cool":1},"NnNpSuKEHLtfGCMXvHeMww":{"text":"Just scarfed down the half meat muffaleta.  I loved the roasted sesame on the bread,  real","useful":1,"cool":1},"PCYem6Xd06yP0L31LGQI-A":{"text":"Someone said I could not leave new Orleans without having a Muffuletta sandwich so of cour","useful":0,"cool":1},"VSBOzIfrvJh3Fy-qtNwFrw":{"text":"Best muffuletta's ever and easily the best sandwich I've ever had. Sandwiches are huge and","useful":0,"cool":0},"9e40SGh1nRp-MtlxPIe3TQ":{"text":"Tried the so called best muffaletto in New Orleans and was not impressed.  It is pre-prepa","useful":0,"cool":0},"BZeQkhgtJs_wPwypukE7Vg":{"text":"Had a wonderful vacation in New Orleans for my bf bday we had to eat at the central Grocer","useful":0,"cool":0},"TJjoMaFCVlemPZDdgBDoRA":{"text":"C'mon we all know why everyone comes here and writes a review for this place. It's all abo","useful":3,"cool":3},"erjUYwjF1uQ6MlYedUGl8A":{"text":"MmM my mouth is watering just thinking about the muffuletta here.  I was a tad bit intimid","useful":4,"cool":0},"V6iH7OMGA2vUuVL0f2CJ7g":{"text":"Long lines, but still worth the wait.  The sandwich met all expectations, but it didn't kn","useful":0,"cool":0},"KRMLypkyWfWEKdQp7mFO9g":{"text":"We stopped a local and asked what kind of recommendations he had for lunch places and with","useful":1,"cool":0},"WH50plMu60xZPm0Gf4WmNA":{"text":"It is the original muffaletta joint, so it is kind of hard not to like it. If you like muf","useful":0,"cool":0},"ZoSwMXGyG52_CRwHjshRQQ":{"text":"The muffuletta is good but I can't help saying that franks two doors down I liked much bet","useful":1,"cool":0},"7JfzPNPwuWp23mNupB4I-g":{"text":"The service needs improvement.  I stopped by during a lunch time rush and though the line ","useful":0,"cool":0},"lleByPBDfEfc-V317TNV6g":{"text":"OH My God! Writing this while eating the muffuletta. I'm never a fan of Olive but this, th","useful":1,"cool":0},"aIXuDWucBSnKLmFxzqcAJg":{"text":"This is the place to get a muffuletta.  You buy it at the counter, then eat it at the smal","useful":2,"cool":1},"jxanIlmrk35T3VXBhaN7cg":{"text":"I have been going to this place for my muffuletta cravings for years! The cheese is so fla","useful":0,"cool":0},"xFdcSEk8wgO08ghbBD9rYg":{"text":"props to the originator of the muffaletta. y'know it's funny....Safeway has a similar sand","useful":1,"cool":0},"vrzzTyI_MCxYSQgIHWyRcg":{"text":"MUFFULETA!!! FTW!!!\n\nThis was one of the highlights of my trip, got up to the counter and ","useful":5,"cool":3},"yBzYdk4pfD5FxSRPXuC_Ig":{"text":"Worth the long line at least once.  Really delicious muffeletta, although the amount of oi","useful":0,"cool":0},"hYoPtT488gA_CbQiWuPJpQ":{"text":"If your looking for a top notch Sandwhich look no further there Muffaletta is the best. A ","useful":0,"cool":0},"sP6unnb0uDL3X-VqpErVog":{"text":"I think the olive salad here is better than Franks but I think over the years they have go","useful":1,"cool":2},"8ElctSNbLVWbcuHo-3rGUg":{"text":"Muffuletta was good, but disappointed that it was pre-made!! The middle-aged gentleman at ","useful":0,"cool":0},"VqNcVOW8OXC1ybKITfiwWw":{"text":"Warning - this place is a tourist hotspot and VERY crowded, but it's an institution. We go","useful":0,"cool":0},"EL9z1I_yLL7ctTm2E7q0jw":{"text":"This is a sandwich so good, I watched a vegetarian eat a quarter of one who had not eaten ","useful":1,"cool":1},"41sf3N73BgH78XqD8pVvdQ":{"text":"It's a iconic place but they don't go out of there way to make it seem special. Sandwiches","useful":0,"cool":0},"O-uj_i929EKQibDWkIrlSg":{"text":"Heaven in a massive sandwich. Incredible flavor...the sesame bread, olive spread and cold ","useful":0,"cool":0},"focpLIgSO-dUzM5Wp_jS_g":{"text":"Muffulettas are the best here! Home of the original muffuletta! I had picked up two whole ","useful":2,"cool":0},"c7z1wdlzW5_8NrZMCnRqWQ":{"text":"Everyone needs to try the Muffuletta here!!! The wait is short and the muffuletta's are al","useful":0,"cool":0},"_3lbVRLlBLdYflzLBDdjzQ":{"text":"This is THE place for a Muffaletta. I've eaten many, but none as good as Central Grocery. ","useful":0,"cool":0},"3IcqA2ukfH4SCd-N5fXvbg":{"text":"There are many things I will miss about NO and the Muffaletta from Central Grocery is one ","useful":1,"cool":1},"WW1b_IsrhYNtp4ww-Jr0cg":{"text":"One word: muffuletta. Just get it. My words can't do it justice. I'm from the NYC/NJ area ","useful":2,"cool":1},"FcxD_Hfwg_3NQGNfu_F9rA":{"text":"I'd never heard of a muffuletta, let alone had one.  Having eaten too much to fathom, I ha","useful":0,"cool":0},"NWJ-Inp8REdsyzmc5ITnZQ":{"text":"The originator of the Muffuletta sandwich: what can I say? It just doesn't get any better.","useful":0,"cool":0},"1A2ogE6t49b2JidZU3w5ug":{"text":"This place could earn another star just for inventing the Muffuletta, or so they say, but ","useful":0,"cool":0},"1V8AtDmWMVX1d45jKeHyMA":{"text":"Of course, I came here for the muffaletta, but it wasn't very good. The sandwiches were pr","useful":1,"cool":1},"EopLojlhEVeYar7nCJBtPA":{"text":"Ok people this is absolutely hands down the best place to get a muffalata! After all...thi","useful":0,"cool":0},"LcvBMn8b1z_WNNzmJyp-2Q":{"text":"this sandwich is incredible, believe the hype. the bread is perfect, the olive salad is am","useful":0,"cool":0},"nEk6QbT9m9CJumwfiYHn6Q":{"text":"While visiting New Orleans, I knew I had to stop by Central Grocery to get a muffuletta.  ","useful":1,"cool":0},"t_2rdpJWxxkHJotwp9eK6w":{"text":"There is only one place in New Orleans to get a Muffeletta as far as I'm concerned. \n\nTher","useful":0,"cool":0},"t6KWdzWMasw_mCuxSH5zag":{"text":"Decor: 5/5\n-walk in and you immediately smell spices, in a pleasant way\n-bar-type seating ","useful":3,"cool":2},"waEIa0fSZeY5lexTMG20TA":{"text":"First word...MUFFULETTA Second word...Yumminess!\n\nImagain a bar stool size(10 inches to be","useful":4,"cool":1},"zofyB3-WIxSoFK-oLLLn8g":{"text":"Best MUFFALETTAs in the city.","useful":2,"cool":1},"yrYpSGeIYh_gmtqaHqDAjA":{"text":"Nothing like the traditional Muffaletta sandwich at the place that started it all! This sa","useful":0,"cool":1},"it8e0U9NyO2ybKb_0lfTiQ":{"text":"The muffaletta's here are to DIE FOR.  \n\nThis is a grocery store that makes a batch of the","useful":0,"cool":0},"AQkx64LdkwAB3sq-VtGWmQ":{"text":"the muffuletta's are HUGE and packed with delicious tastes.  The wait is a little crazy bu","useful":0,"cool":0},"vkzaSEFkLDf3gSzv3uNZFw":{"text":"This store implies it's the oldest store in the French Quarter and it's the home of the \"o","useful":1,"cool":1},"BYbIQ1as0v83UbCwicVNVA":{"text":"Went midweek at lunch time and had what has to be the worst muffuletta on any trip to the ","useful":1,"cool":1},"m-3B8ceNow32G9EOaQMvlA":{"text":"Muffuletta is \"Da Truth\". Nice, efficient, no nonsense customer service. Wonderful Italian","useful":0,"cool":1},"UHofghO5tCxzTjQP3T26EQ":{"text":"When you open the door and walk in, the smell is amazing!\n\nWe bought half of a muffaletta ","useful":1,"cool":1},"bGLlYY8meGSFZfNWqfTh2g":{"text":"best italian muffeletta ever.  still dreaming of it a week after my vacation!  also found ","useful":0,"cool":0},"_DzA56sNCNZhx0YD8vgI7w":{"text":"Best muffulettas ever. Did not disappoint. We even had to go back a second time they were ","useful":0,"cool":0},"eCicbJKBpHiSdc1mKX-M8w":{"text":"Oh the smell... LOVE IT! The ONLY Muffaletta. The ship too. Voodoo chips are killer.!!! Mu","useful":0,"cool":0},"9V1BgFLvRulHh6m4Qn-D8A":{"text":"Lived up to its hype, worth the trip.  Touristy?  Very much so, yes, but this is actually ","useful":0,"cool":0},"gHYZycOf9EMZ5iWEcwErng":{"text":"The Muffaletta is huge. Plan on splitting it. This is a grocery store so don't expect serv","useful":0,"cool":1},"YMMiepjez8WKEZALJuvHSQ":{"text":"This is where the Muffuletta was invented. Of course, you need to try it (you need to like","useful":0,"cool":0},"fdaxJk6sFgPNCgXfy_dGpA":{"text":"This place is an institution.  Be prepared to wait in a long line on a weekend, but it's w","useful":0,"cool":0},"Y6Ma6DOLqSffLCrldh2odw":{"text":"Just returned from my first visit to New Orleans. Everyone said I had to get a muffuletta ","useful":0,"cool":0},"3S1pRIPB2ebz1jjcZ0YLkQ":{"text":"\"Where the menu at?\" the man behind me asked. I shrugged and pointed at a tiny letterboard","useful":2,"cool":2},"SwUV0_DDRgN7z5EKwU7Ueg":{"text":"this place is HYPED UP. It was good but not a be-all-end-all sandwich. I am glad I checked","useful":0,"cool":0},"Gy-CHllfTySXXLpe0ZruBw":{"text":"Never had a Muffuletta before, but after hearing this place invented it I had to try! The ","useful":0,"cool":0},"diCfFGPALUIyavu-9cbgOg":{"text":"Heard about it in a \"Dummies Guide\" to NO. I wanted to try local things, so we went.\n\nWe s","useful":0,"cool":0},"xyZEgVDvi3F2HTHGsJQkIA":{"text":"#1 muffuletta  in new orleans and you get to walk around the french quarter or get beignet","useful":0,"cool":0},"Jbi-UdYN4JIk05IXWG56RQ":{"text":"We used to go here religiously and I have Celiac's Disease and can't have the bin. For fiv","useful":1,"cool":0},"rpQPrIjc3knmoa2AItrncg":{"text":"When\nBoot shaped\nStates steal a\nSandwich the size\nand shape (?) of your head from boot sha","useful":0,"cool":0},"MnXR4oihBim9LGFv9MOemg":{"text":"I was really looking forward to this and actually hyped it to my 23 year old son prior to ","useful":0,"cool":0},"dphlfF8vdu0qCGYEyWVXpw":{"text":"That sandwich was out-of-this-world. We bought a couple of them back to Lafayette and our ","useful":0,"cool":0},"L7bCUvhYLILrNe3QCkMAlg":{"text":"This is THE place to stop for lunch when you're in the area! \nLike others, I must stress t","useful":0,"cool":0},"jdrav9gyv_HOMVRMIxSoiA":{"text":"The muffaletta at Central Grocery is awesome, tangy, salty, rich. Great bread and the dres","useful":0,"cool":0},"EtJ1_Hsme6jsAM141JzwYQ":{"text":"I have to preface this by saying I don't even like olives. Green, black, yellow, purple, i","useful":2,"cool":2},"K47bmrS9EdVtsHRs1_wKLw":{"text":"Olive spread, cheese and meats on the muffuletta are good but I got slightly stale bread. ","useful":0,"cool":0},"8GD6X7_qc6R1SxKHaM0AmA":{"text":"Love that I can buy a jar of olive salad here! Sandwich has a little too much bread for my","useful":0,"cool":1},"Uhx7LFpBnT4--L-nidwuKQ":{"text":"A must visit while in NOLA, It is by far the best Muffuletta I have ever had, as it should","useful":0,"cool":0},"osy4ZXOuRoQ0pNHLbI2DOQ":{"text":"Everyone raves about the muffulettas but we were not impressed. The line moves quite fast.","useful":3,"cool":1},"2TwHBkico3gIXvM5aa7TeQ":{"text":"You can't get a better Muffuletta. The staff will bend over backwards to assist your needs","useful":0,"cool":1},"3IdWPf81TvVBNUmypvvBwA":{"text":"If you don't like olives you won't like a muffaletta, and if you don't like muffalettas, s","useful":4,"cool":1},"CmMbmyGTIE42vxEIAqfIeg":{"text":"Now I can't speak to the actual shopping at Central Grocery, but that Muffaletta was amazi","useful":0,"cool":0},"8YXVFiozPgVBgjlU7TPhPQ":{"text":"Seriously? what is the big hype with this sandwich?\n\nLunch meat and some olive spread? wha","useful":2,"cool":2},"UwQANMGSX-V6eM8YB34SgQ":{"text":"We went here for the muffuletta & weren't disappointed. It's a great big sandwich for $20,","useful":0,"cool":0},"KP4YTAfwB9E-dXqnuWaLPw":{"text":"The infamous Muffuleta sandwich. It's crispy foccasia type bread is dabbed in  imported It","useful":5,"cool":4},"rAAn6-KkZxSYlITD1lLM6A":{"text":"Perfect Muffaleta (is that how you spell it?). The only one I tried during my visit but I ","useful":0,"cool":0},"E2uU3trQ_6nkqu785uzQ1A":{"text":"The first time we went here, I think in 2004, Central Grocery was hands down the best muff","useful":1,"cool":0},"P0yQcICG7CpN8_iK1OgwzA":{"text":"you just can't go to new orleans without eating a muffaletta at this place. YUM.\ncheck out","useful":2,"cool":1},"Q46dgJK9Y17Fx7BRldYDAA":{"text":"My first time visiting the French Quarter. I heard about this place from a friend, so I ha","useful":0,"cool":0},"-v8nveSjJ3GihrRETN6j0Q":{"text":"Anything involving bread, cheese, olives, and Italian meat is my ideal meal.  Central Groc","useful":0,"cool":0},"z8doB9OcbKjg6hRAVIcVTg":{"text":"I have been to multiple trips to NOLA and never created time to go get a Central Grocery m","useful":0,"cool":0},"-OdKPBkr-DrLlJ0ezDKKZA":{"text":"Sandwich is out of this world! We always come back to this place. However, it's a creepy l","useful":0,"cool":0},"Fgl_1zXzjkX8xnux2kojuA":{"text":"If you like Muffaletta sandwiches, dont even hesitate and go check out Central Grocery. It","useful":1,"cool":0},"O-3viddajy5zc-9yB8iZ1w":{"text":"My wife and I were in NOLA for a few days and wanted to try an authentic Muffeletta . This","useful":1,"cool":1},"fFpJn7U081dfvme4U9r4ZQ":{"text":"Central grocery harkens back to a simpler time. The building itself and the good sold ther","useful":0,"cool":0},"Ybp1vZPwa-wIStlNnyg1vg":{"text":"Bring napkins when you come here so you can wipe the meat juice off your hands after man-h","useful":1,"cool":0},"1a8O5GSoj1y9eUynKzdDmg":{"text":"Pictures can't capture how HUGE this sandwich really is. The muffuletta bread is about 10\"","useful":1,"cool":1},"jSSADg4G_kvTbEpkG1kVvw":{"text":"Okay so before I write this review I have to give a disclaimer and say that I hate olives.","useful":2,"cool":1},"sfEN5EVfmi-k-uStcn00Wg":{"text":"The original muffaletta is no slouch. Covered in olive oil, an olive tapenade, different s","useful":0,"cool":0},"wIsUfyyRsH7HQ6uYITUpfQ":{"text":"Real Italian deli, best Muffuletta in town. They are huge, you want one in your mouth hole","useful":0,"cool":0},"7Xmu3ynXgiiGyGgq8akKPg":{"text":"Great Italian grocery with items I hadn't seen since my childhood.  The Muffuletta was ter","useful":0,"cool":0},"AcY0jrrQGfoZcdqOqJED9A":{"text":"Worth the wait in line. The muffaletta is messy and to die for. It is a huge and filling d","useful":0,"cool":0},"5yrBb9M7CjOM8Pa4lUGJxw":{"text":"Most awesome Sammich in the world...the muff,there it is. Plain and simple, as New Orleani","useful":0,"cool":0},"6qcsddkCgSBoGrTpAN9Tew":{"text":"A must stop in NOLA. Muffulettas are huge - a quarter sandwich is enough for one person or","useful":0,"cool":0},"puY675tpGlH7nxKCYFVV_w":{"text":"Waaaaa...I was so looking forward to trying a muffuletta from Central Grocery only to be a","useful":0,"cool":0},"c-OfIeP_-36cx7lYYMT2EQ":{"text":"Central Grocery is a must when in town. The muffalettas are amazing. We have tried others ","useful":0,"cool":0},"qasADRWx-jRHiIOc2RORyg":{"text":"Stop reading and go get a muffaletta here, seriously.  My fam in NO would send me muffalet","useful":0,"cool":0},"Hydjshk6GVtPVSvOos95Bw":{"text":"The half muffuletta was probably the best lunch I had in New Orleans. They're pre-made to ","useful":1,"cool":0},"8HpLTy_0uj-n3LzWYXcttA":{"text":"Seriously??!!  I do not get it.\n\nWith the way everyone talks about this place and its Muff","useful":2,"cool":0},"_xlDMqiUwd9D9Jyg4bJ_hA":{"text":"A tad overpriced but delicious nonetheless.  This a half muffuletta which is pretty huge.","useful":0,"cool":0},"nJ5wEVk6GjOsRoGZdsT0hQ":{"text":"Are the lines long?  Yes.  Is the food worth it?  Most definitely.  We just grabbed some f","useful":0,"cool":0},"EjwG7ztA7G9xSw8bZnEemQ":{"text":"Home of the ORIGINAL muffaletta sandwich and such a bargain--got a 1/2 sandwich for ~$13, ","useful":0,"cool":0},"IekA904pC0kcC9U9AoGfrA":{"text":"It was the last day in New Orleans. Time was short. Muffuletta was on the list of things t","useful":1,"cool":0},"QaLp3g_5zJgsVK5-vPqHxw":{"text":"This is the only place to get a muffuletta sandwich in New Orleans. It was established in ","useful":2,"cool":0},"1K-pgUFn7zoEGiBo9ZMkFw":{"text":"Out of the many times going to New Orleans I have never had a Muffaletta!! OMG amazing!!! ","useful":0,"cool":0},"1Lf4gfSHOnaWT5TkDSzNMQ":{"text":"Amazingly delicious and efficient.  To be fair, I haven't had any other muffalettas in NOL","useful":0,"cool":0},"fU4kbnoxQEUfvi2RU2m5AQ":{"text":"The muffuletta is a New Orleans creation and this is where it originated. This is the seco","useful":0,"cool":0},"nVMb-JOmiVWs0VFJBZ9Kug":{"text":"The sandwich is huge. Bought half to share with another person.  At first the sandwich did","useful":1,"cool":0},"DjmZKJ-Nq4SXeEtAsGwDjg":{"text":"Is it wrong of me to want to squirrel away with the other half of the worlds best muffulet","useful":0,"cool":0},"UZZA9Mt7cWPyJ8s9V9sT0Q":{"text":"This is really a bizarre little place.  And the fact that you have to wait in a pretty sol","useful":2,"cool":0},"EB0GpJWzoSZ6OOPaiXpF2Q":{"text":"a must for a perfect muffaletta! One half is enough for two to share. Bread was amazing! o","useful":0,"cool":0},"bVjzCSVs5tgaPh5iCgr3EA":{"text":"4.5/5 this is it.\n\ni don't give out stars this high very often. they usually coincide with","useful":7,"cool":4},"pQ_ZC3jWKKMEDyvT1doJ3A":{"text":"Wow, that was a heckuva muffuletta, the best sandwich I have ever had in New Orleans. Get ","useful":0,"cool":0},"AtTJolzzK9_DokBhqQyOKg":{"text":"The sandwich is huge. Get the half and is enough for 2 people. It's open on Sunday while y","useful":1,"cool":0},"1xollQELy1_3i_CYHKTGwQ":{"text":"there's nothing like the tangy smell of a muffuletta and the envious stares of the people ","useful":2,"cool":0},"RYk8u8okpArvD3mtf8rV-Q":{"text":"Man, I am glad we got a muffaleta here. It's a good thing we didn't wait until Monday as t","useful":0,"cool":0},"AT_RwRchFpbry8wgb1pO3A":{"text":"So I was in the quarter for xmas '13. on a recommendation, tried this muffaletta - OMFG it","useful":0,"cool":0},"G2Db6a2QvWiiPOsDOZ9JsA":{"text":"Easily the best Muffuletta I've had in my life. A magical mix of historic flavors. Enough ","useful":0,"cool":0},"DeN1TCmrV9k6t0FjNOQovw":{"text":"Great muffuletta!!! \nyou can order 1/2 or the whole sandwich. 1/4 sandwich is huge enough ","useful":0,"cool":0},"AbjgCVmcZL7TAVtLyMRSKg":{"text":"YUM. We stopped in to try the famed muffuletta. There was no line when we stopped in so we","useful":0,"cool":0},"MFvwQMcMl8KRStm00mBisQ":{"text":"Best muffuletta ever!!! Get your Saturday breakfast and eat while checking out the square.","useful":0,"cool":0},"7aCJmDVwTR_Qr1UfDhvcpA":{"text":"The only thing I'm able to rate here is my experience with their muffuletta, not surprisin","useful":0,"cool":0},"9iRaTYYhOkd6nk-q39EihQ":{"text":"I love Muffalettas.  However, I personally don't like the Muffaletta at central grocery ve","useful":2,"cool":1},"Cx26adBmN6fnIcC9ZytI2g":{"text":"We got really lucky and came across a shorter line. It probably took us about 20 minutes t","useful":1,"cool":1},"V9swvwDQaF4bT6AngleahQ":{"text":"Best muffulettas in town. Great deli and grocery store. Line can be long but goes quickly.","useful":0,"cool":0},"idonRwWytSo48Vg9Yza3Xg":{"text":"Quick service and amazing muffuletta sandwiches.  The shop is very quaint and has a lot of","useful":0,"cool":0},"nIaUCa27HSbeIxuUoxb_UQ":{"text":"The staff isn't friendly and the beverage selection is below average, but the muffalettas ","useful":0,"cool":0},"LYa87Vs9eGNkJfsOdQg6xQ":{"text":"I'm not really sure how to rate this place...It was a dark dingy grocery store which I'm n","useful":2,"cool":1},"NqGRMHeugQ77RdvX5lvHCQ":{"text":"Ahhhhhh ... salami ... mortadella ... provolone ... emmentaler ... capicola ... all combin","useful":1,"cool":1},"sK_HD0_cUcwXM__66PKL6g":{"text":"Home of the original Muffaletta.  The place is a small grocery store in the French Quarter","useful":0,"cool":0},"XO7PiB5d78BP42GP3H4zJQ":{"text":"Home of the original muffuletta so we bought ours there. I am an olive fan, this made my t","useful":1,"cool":0},"71CrBuI2SyOMi8PP09d2LQ":{"text":"shopped for goodies to bring home.  the Muffaletta  was the envy of everyone on the plane.","useful":1,"cool":1},"nXbvZLh9NbWkrKsfvyqDsQ":{"text":"Oh my their famous Muffuletta was AWESOME and this is a person that doesn't like olives.  ","useful":0,"cool":0},"O0EkTMNbLBbI_aBxrA_wQg":{"text":"Got the famous muffaleta, and I'm so happy I did!!! Coming from jersey where we appreciate","useful":0,"cool":0},"7iBjiFsfZWKSpprVxQ47Yg":{"text":"Let's be honest here. It's not the greatest but it's not the worst. It's average the bread","useful":0,"cool":0},"y07XqGX9qTqVcCouigPN0w":{"text":"Look if an original style Muffaletta is what you want, there is no where else to go...PERI","useful":0,"cool":0},"y-MLVj4_z8d3UIedQ0yr0Q":{"text":"This muffaletta was so.damn.good. We got a half and it was still bigger than my face! Such","useful":2,"cool":2},"QQh4XlRHsA_IKty2kMNXMQ":{"text":"Eh.  That really sums up my feelings on Central Grocery.  I am not from New Orleans so may","useful":2,"cool":0},"E-VcvOcbFb35rR45lEcznA":{"text":"Got the half muffuletta and loved it! Short line that moved quickly and good service. Didn","useful":0,"cool":0},"-R0xyZDJt2MpSieSj_G5Rg":{"text":"I was upset the last time I went to NOLA because I was not able to eat here, so this was t","useful":0,"cool":0},"k9tQSficDUThfGhQGj-Jkg":{"text":"How funny.  I just wrote a review about my favorite sandwich ever (Gracie's turkey in San ","useful":0,"cool":0},"hoAiuQ-oNPpzj4EYd7WjcQ":{"text":"What can I say about a classic that hasn't already been said?  I'll keep it to a few short","useful":0,"cool":0},"xeJgMiHTjdNCI9SJpAhQ2w":{"text":"I don't think any place with 88 reviews needs me to add my two cents about it, but I can't","useful":0,"cool":0},"0iCt2h0vgzNgLZ3SpbMU_w":{"text":"Central Grocery and their perfect muffaletta doesn't need another review. But I feel compe","useful":1,"cool":2},"an9Fkgt3-aNCDyNvBJcPMg":{"text":"Another joint that's an institution.  This sees a lot of tourists.  There's character here","useful":0,"cool":0},"q_KmpUjdw44GcjFyDeJ0UQ":{"text":"THE place to get a Muffaletta!  I come to NOLA about once a year these days to visit my br","useful":2,"cool":1},"N1sUcStPOoCOiw2kT-dnxQ":{"text":"Way over-rated! The muffaletta is ok. Decent size but way too much bread for the amount of","useful":2,"cool":0},"Eq7i9FprdpNf0V2d7_yVIw":{"text":"Half muff is plenty big, make sure you GT a drink, you'll need one","useful":0,"cool":0},"_p5Vrcapis8YEqfjVSjwKw":{"text":"I was told be a native NOLA resident that a visit to Central Grocery needed to be on my it","useful":2,"cool":0},"ELdbT0lQ1bI7AC8KCAbzaA":{"text":"This Muffuletta sandwich will ruin you for everything you will ever eat in the future that","useful":6,"cool":6},"SMSikNo-Y5NXqsBtkjxDzg":{"text":"OMG, being a New Yorker and growing up in my grandparents' Manhattan deli it never occurre","useful":2,"cool":1},"QZqC_pfZz5Bkp9ujl1CsTg":{"text":"Muffuletta is awesome, they know what they are doing! Line moves quickly, as they had the ","useful":0,"cool":0},"7JdY6ZWZpekcPdHH5lSZ1A":{"text":"This is the spot for authentic muffulettas! It's well worth the wait. But there's plenty t","useful":1,"cool":0},"l14dLRXxu2fKH1DvAZ03Cg":{"text":"Central Grocery is home of the tasty and gigantic Muffuletta sandwiches.  They are made on","useful":1,"cool":0},"_I3Hm87apng6cERggrvgrA":{"text":"I did a lot of research before coming to New Orleans and one of my MUST DO's was hitting u","useful":1,"cool":0},"dZEFArsKdD9eOT5-etwBqg":{"text":"\"The muffuletta\"...all there is to say. I don't know if it is the product of 110 years or ","useful":0,"cool":0},"zX_2QwKsBThxuCXae0LRvw":{"text":"I waited in line for almost a hour to get a muffuletta and I was definitely not disappoint","useful":1,"cool":0},"My81YXyExmPKyH54olgzeA":{"text":"Waited in line for about 40 minutes.\n\nWorth the wait, indeed.\n\nFunny how so many people wa","useful":1,"cool":0},"XQXLbWEh_GVBbXsqqdXA3g":{"text":"I didn't know what to expect when getting a muffuletta.  The locals raved about this place","useful":0,"cool":0},"rkbCusdcUcvPRHmuhP_INQ":{"text":"I have never tried the muffuletta but I shop here a lot for things like Olive Oil, dried p","useful":0,"cool":1},"GvhbwQMIBtALCBFiRY6YOw":{"text":"Muffuletta!!! Soooo good!!\n\nLoved mama's cookbook too\n\nHad to bring half dozen of them hom","useful":0,"cool":0},"YxSj3fklwlvIe0EnZRC10Q":{"text":"This place is known for Muffuletta ( fresh hearty sesame bread / pepperoni/ ham/ cheese / ","useful":0,"cool":0},"YHk5Eq65ruf-mK7qlpgGag":{"text":"Holy shit, Holy Shit, Holy shit. This is soooo long over due and I am now going through wi","useful":2,"cool":2},"aBZL3SiEHy2BysRYjDJAfg":{"text":"The muffaletta was everything I always imagined it should be and more. I could eat the tap","useful":0,"cool":0},"hsR-npfxphYZcsY63WSBNg":{"text":"Central Grocery does one thing and they do it amazingly well: the muffaletta.  I'm pretty ","useful":1,"cool":2},"c3v_77d_E4wF_ez6muUFxA":{"text":"OMG... these muffuletta's freakin awesome!  Each bite came with a bit of that olive salad.","useful":0,"cool":0},"aQCX3DeZzPULXl77X4hoSg":{"text":"Okay, so I don't particularly like salami or olives. Or both together on a sandwich. Howev","useful":1,"cool":1},"I5Wc8OjSilDstEPXtCoJNQ":{"text":"The benchmark in Muffalettas.\nBeen eating here for years.. always packs some to go so the ","useful":0,"cool":0},"fBTWBH1dZMMW-ebiIDRlzA":{"text":"Hands down, the best Muffaletta I've ever had. Highly recommend! Service was super efficie","useful":2,"cool":0},"8Xj7a2ISwNcxGdCjl3_Jxw":{"text":"I have to admit that I was initially reluctant to try Central Grocery's famed muffuletta, ","useful":11,"cool":4},"9F8kuk1ca2RCYtafZE4_7w":{"text":"The muffuletta is the BEST thing I've ever had in my mouth! I don't care if I have to eat ","useful":0,"cool":0},"ZbTsNxUpDLMiVoDJ32x93A":{"text":"I will say the service was not very friendly (it was like slow time late on a Friday after","useful":0,"cool":0},"U5hp3AK-sQmn0ELgdyNPkQ":{"text":"We were visiting New Orleans and had to check out the infamous sandwich- the muffuletta. T","useful":0,"cool":0},"GXFvemOB9rvvabJZzRgqlg":{"text":"Muffuletta. Maybe the word makes you think of some Italian grandmother or an exotic car pa","useful":8,"cool":7},"xcngEoo4yNiwYEWT7SO_rQ":{"text":"We don't believe in long lines, thus, never made it in the past years until the recent tri","useful":3,"cool":2},"267Iw307TF1z6tffWHEObg":{"text":"The muffuletta is probably bigger than my head. That said it is best to eat the sandwhich ","useful":1,"cool":0},"oazXSbVGMdaXzfjv-Y8u1g":{"text":"The food was amazing!!! The service was terrible , the staff was rude and appeared annoyed","useful":3,"cool":0},"iCyknkaUG94DleX3_chc6g":{"text":"Flying home from New Orleans, muffuleta secreted away in my luggage, the TSA worker in the","useful":0,"cool":0},"i7_eArRYPIB3U4_AHaEdKQ":{"text":"As soon as I got my butt off the plane and into the hotel I was hoping the streetcar to ce","useful":1,"cool":1},"a_famJe-ifmQGud4aBA9qg":{"text":"On any visit to the Crescent City, you've got to get a muffaletta sandwich. \n\nAnd Central ","useful":0,"cool":0},"rwbx1ORUjg3vCletsc862w":{"text":"The best (and biggest) muffaletta I have ever eaten. Stifle the urge to order one sandwich","useful":1,"cool":0},"4O1XHWS87BT8Gq01OWW4aA":{"text":"Hubby and I stopped here for a muffuletta and we absolutely loved it. The cute little groc","useful":0,"cool":0},"fxz1hiw_aKqKim3vCZbTzw":{"text":"This place is a cute little deli and service is quick. There aren't many choices: half or ","useful":0,"cool":0},"odlM9GqkPQF2zGlaLm7SwA":{"text":"Sorry but these are great muffeletas and they have all the meat and cheese and olive tapen","useful":0,"cool":0},"Dj9rKIp4jsv4M8QKE9qPSg":{"text":"Unlike our last muffuletta in New Orleans, this time we decided to go straight to the sour","useful":0,"cool":0},"wIwJU9xpHKZWRjUMNuw04g":{"text":"Heard this was the place to get a muffuletta sandwich and it sure was. We stopped in aroun","useful":2,"cool":0},"sPaktPF8kbasQvSUO5AzRg":{"text":"This place was OK. I had heard so much about this, that  of course had to stop and try the","useful":0,"cool":0},"Hluhd69nExsIO79IopoCcQ":{"text":"The famous Muffaletta! We waited in a long line, in the heat to experience the famous sand","useful":0,"cool":0},"gHmmqppY-peBaU1H9fdA3w":{"text":"Delicious muffalata sandwich and it was huge . Hope to visit this place again this next ti","useful":0,"cool":0},"WiOW8VF6voum2KyPcInkKQ":{"text":"I have to say that it has been a long time since I've been to Central Grocery. That being ","useful":5,"cool":2},"AuQDlvkyaidIrB-l7S5hxg":{"text":"Got there just before closing on a Saturday evening, so it wasn't crowded.  Just as some r","useful":1,"cool":1},"zxl0s4PcHwO4Zs5jVRsF9w":{"text":"I liked the Muffuletta sooo much I went back for a whole Muffuletta for my trip to Memphis","useful":0,"cool":0},"q121HVaoZV-_3NZtSzdmIg":{"text":"The sandwich is perfection. It's good meat to cheese to olive ratio. The portion sizes are","useful":0,"cool":0},"kIkgJwyQ3YORufliLQABZw":{"text":"Central Grocery muffuletta = an almost inappropriate discussion.\nThese are the original (o","useful":0,"cool":0},"Z988jSE-G5d221lwRPX6yQ":{"text":"OMG The best mufalatta using the freshest ingredients. YUMMO. Easily to get to and right a","useful":0,"cool":0},"QweDZLQADc86tmzi_jUAQg":{"text":"Their original muffuletta sandwich was everything I imagined and more. So fresh (probably ","useful":0,"cool":0},"5Bhv6TMO00rGuuXpCJwnnw":{"text":"You know what you're looking for here - muffalettas! And they are delicious. If you are a ","useful":2,"cool":0},"GN9UOrBJJsuAIKHznCukFQ":{"text":"Arriving in the Quarter around 11:45 and finding a great free parking spot on the corner o","useful":6,"cool":1},"UVeBDbWmWoRGNt5uIrlV5w":{"text":"Historic, yes.  But certainly over rated!!   The muffuletta is a joke.  The bread was bord","useful":2,"cool":2},"GcqRgwbairzKyZA1WmaXdA":{"text":"There was a small line when we arrived here. Of course we were here for the original muffa","useful":0,"cool":0},"yg8G0qyW0ZU9KoqHkC6GIA":{"text":"Good muffuletta sandwich. The thing is you have to wait on line for 30 minutes just to get","useful":0,"cool":0},"EzjCXGjMJE8dZ0TiP4cipA":{"text":"I spent 30 minutes waiting for this sandwich in a rather dour atmosphere (staff barely sai","useful":0,"cool":0},"wpwF4ltHqNQ8turT3ilSSg":{"text":"Sometimes being the original doesn't mean that you are the best. Central Grocery is known ","useful":3,"cool":2},"ZeUBhoxcy3YEYSS8AVLJOA":{"text":"I finally made the trek to try these as recommended by the yelp folks.  It is located on D","useful":0,"cool":0},"Fl4qk6mn77fPV1PXoC54Yg":{"text":"How can anyone dislike a muffaletta? If you're a vegetarian, okay, you get a pass. \n\nI lik","useful":2,"cool":2},"pDA71vcD9AqmYJNv3nu3_Q":{"text":"We had to try the popular and famous muffulletta sandwiches at the Central Grocery. It is ","useful":1,"cool":0},"GSkPc2PaeHG1qd6mI5B05w":{"text":"I love this place.  It was my very first visit to New Orleans and I had to have a muffalet","useful":0,"cool":0},"k-wSk30VEIL29DhPFQRfug":{"text":"No one makes a better muffuletta.  I guess because they invented it but still.....no one c","useful":0,"cool":0},"VdVt_TPwvbjfBTMEZP48hg":{"text":"I visited New Orleans solely for a one-of-a-kind foodie experience so naturally Central Gr","useful":7,"cool":6},"16PpDVk_RC4w7_-6d1cxIg":{"text":"Disappointing. The muffalettas here are mass produced ahead of time. The bread in mine was","useful":0,"cool":0},"PWw8uRHwi-uqV7pEEhEnyg":{"text":"Enjoyed one of the best muffulettas that  I've ever had. It was the Bae's first and he lov","useful":1,"cool":0},"UGLPFYFpxB-VRmvr8XHMVg":{"text":"Five star for both service and yumminess!! We only went for the sandwich! Glad we waited i","useful":0,"cool":0},"Obc6mtwdESdgtA1j7yKPTQ":{"text":"Came here with my insanely hot, Mediterranean wife. We came for the muffuletta, which is b","useful":0,"cool":1},"d_LxpShwr1-hEFh2pesMyA":{"text":"Bomb. Took part of the sandwich back home on the airplane.","useful":1,"cool":0},"QIhmK94e2BTgfNOqLOjazQ":{"text":"Ordered the muffaletta.  Obviously.  Be careful careful careful about what size you order!","useful":1,"cool":0},"_Iozdl9WMVGOzSeb6PU5Xw":{"text":"Muffuletta- the original and the great. \n\nWe shared a half and it is a lot. I could eat a ","useful":0,"cool":0},"gM2yJfqyOFfPbvFR0zgnIw":{"text":"the sandwich was great and filling. Seating is limited so expect to tough people you don't","useful":0,"cool":0},"24SQQd-wSJj0qkegBjVEEg":{"text":"Their muffaletta: a beast of a sandwich and a beast of a price: $17ish for one, but one qu","useful":0,"cool":0},"4EgLHspgq25E5FPKyLIjIA":{"text":"Torn between 3 and 3.5 stars.\n\nI never heard of a muffuletta until I came here.  Had to wh","useful":0,"cool":0},"vLPvXrha1Yoit3K7cfz5Lw":{"text":"Oh man, MUFFALETTA. I had one last week and I already miss it - luckily I can order them o","useful":1,"cool":0},"v7Euj_Zd3AOjgocpc3Ko3g":{"text":"A fun place, but I think the reputation, again, has lowered the expectations. These people","useful":1,"cool":0},"4BB0hB0tkZIOyjDA5Rci_Q":{"text":"I have been craving a (vegetarian) muffuletta from Central Grocery for weeks now, and ever","useful":7,"cool":5},"IJtsxnAX5nSJiZwdgFEEsg":{"text":"I stopped by and got the half muffuletta sandwich. (I asked my Sicilian friend what that w","useful":0,"cool":0},"GLLXoipm0e7LAS_HKSjshg":{"text":"I didn't get to try Central Grocery (or any muffuletta) the last time I was in New Orleans","useful":4,"cool":1},"pqf0gbNM7OJHoXHOfYDNrA":{"text":"Highly recommend Central Grocery! The Muffaletta did not disappoint. The line was long but","useful":1,"cool":0},"ymO23CNQkeicaahCGiMlcw":{"text":"Wonderful muffaletta. The wait was kinda crappy but well worth it. They had some great spe","useful":0,"cool":0},"_PJZZfKZYqFKZxm7TMfpew":{"text":"The Muffulettas here:\n\n- overwhelmed with olive spreads, very very salty and very dry sand","useful":0,"cool":1},"1m2LNtIgvcs704D76ntRFg":{"text":"Must have muffaletta!  Don't be a fussy-pants; order the original and try it the way it's ","useful":1,"cool":0},"Br8DzFtoNwgDkBLgmt9JaA":{"text":"If you visit NO, don't miss this. The muffuletta sandwich was so good. They had it ready a","useful":0,"cool":0},"UHX8NpBzTddlsXy3sBQSXw":{"text":"I've been going to this place since I was a little girl.  The sandwich is awesome!  Those ","useful":0,"cool":0},"ur7wnyHt4wEX3Cq3QIOV_A":{"text":"Home of the original Muffaletta sandwich!! This is also a grocery store so it has one of t","useful":0,"cool":0},"oCDbSjbjbdFjOcUBjRRggA":{"text":"Second visit to Central Grocery this year. Muffeletta was equally delicious as on first vi","useful":0,"cool":0},"stDv4LFfVUBnVMqTJnRQrQ":{"text":"The entire time while I was eating the sandwich, I kept thinking to myself, \"I don't under","useful":3,"cool":0},"CnaOfpVt8LzOlWreSVg4Ng":{"text":"Should it ever close due to the absolutely appalling manner in which the staff interacts w","useful":5,"cool":1},"O-fp3mzlMoSoQGV1CQrEWQ":{"text":"When Food Network Lies.\n\nBucking the trend here, but that's what this place should be re-d","useful":1,"cool":1},"nnOKRf6WVS0_IBMDGAkUPQ":{"text":"Well, we had a muffaletta and quite honestly I was not impressed.\n\nWe were in  the French ","useful":5,"cool":0},"yrcB7T3eIWBpQxXmu8NqJQ":{"text":"The Muffuletta is to die for! The 1/2 sandwich is plenty for one person.","useful":0,"cool":0},"t4OD5nmG4VPVj3yFmAhLXg":{"text":"This review is simple and sweet.  The muffulettas are the best.   This was my first visit,","useful":0,"cool":0},"MkTOEXCT92ksQWuNoGlmtw":{"text":"Came here for the famous Mufuletta, and unfortunately the handful of negative reviews turn","useful":1,"cool":0},"LV7EThGJRmA-9uDLa8Zypw":{"text":"The Original Muffuletta... Get one to go or find a seat inside. Definitely a must stop whi","useful":0,"cool":0},"ktvkiR-_O2nOmLJjTOjTcA":{"text":"Great sandwich! Fresh bread not so friendly service!  I have been this place seveal times ","useful":0,"cool":0},"nofyvnw5yQGTTZSTgSruDQ":{"text":"Home of the ORIGINAL muffuleta. Prior to my recent NOLA trip, I admit I had never heard of","useful":1,"cool":0},"OwiRAxlBskM5J3iNQzgslQ":{"text":"after a horrible night...and went to bed hungry....were starving all day long; well went h","useful":1,"cool":0},"BpE6ZWjGNJRCbyQ0cKT1iw":{"text":"Wow! Now this is a sandwich, muffuletta to be exact! We shared a full and it was very tast","useful":3,"cool":2},"St9mUGex_HIpTyWkIn2cKA":{"text":"After drinking hurricanes and petting donkeys, my friend and I walked into Central Grocery","useful":8,"cool":3},"tmdPw2ipEAfjpPoGGdxYjg":{"text":"Get the damn muffuletta and call it a day! This is the best one I've had. A must every tim","useful":0,"cool":0},"FyfZfm8R1fWTu6lvQZ0E-A":{"text":"This is an experience. I've never paid $18 for a sandwich before but I've also never consu","useful":3,"cool":0},"ev2x3H2gwXm0iIlEyszPQg":{"text":"I went on a business trip to New Orleans a couple of months ago. Being the foodie that I a","useful":2,"cool":1},"naJ3cOpuhRsNOioEHNs3cg":{"text":"I am pretty sure this place is 80% marketing.  The sandwich is fine, but nothing special a","useful":0,"cool":0},"6S9od6bjFRyVekvnSoZOLQ":{"text":"Absolutely delicious muffuletta! I was actually able to split the half size with my husban","useful":0,"cool":0},"1Roj5uf1RBO2-aTXenXd9g":{"text":"Yes, get the muffuletta. No, you can't finish even a half Sammie so get it cut down the mi","useful":0,"cool":0},"1s17NFtHirLXGfu10pF24A":{"text":"New Orleans is home to the muffuletta sandwich. I've heard that central grocery and deli i","useful":1,"cool":0},"fWsaiJn3Q7nj68NpotyR9Q":{"text":"I really think a muffaletta is the perfect sandwich, salty, meaty, cheesy. It's portable t","useful":1,"cool":0},"p-eY1qHoOZx3-b-7kiE2GQ":{"text":"What's NOLA without a visit for some muffuletta. Supposedly the originators and the 1st to","useful":2,"cool":0},"YGOLNfWy08M7s04e9iUcNQ":{"text":"Amazing sandwich! I ducked in here to dodge the downpour and to try the original muffulett","useful":1,"cool":0},"qtxzB4hbhEGklqS-2ROK5Q":{"text":"I hadn't even heard of a muffeletta, but my wife wanted to try this place and I'm so glad ","useful":0,"cool":0},"fbwdTYaWuSMX2GZV1aAfWQ":{"text":"One of the best cold cut style sandwiches of all time. And that means a lot because I tend","useful":0,"cool":0},"IIMAWn_b02IVDKi1cf-fZA":{"text":"The original muffuletta sandwich awaits you here. They know that your coming so they have ","useful":1,"cool":0},"haRXZ_XfoVzZzVW-h-c99A":{"text":"Every tourist has to try a muffaletta here- I think it is a law or something. You can spli","useful":0,"cool":0},"zvtRubbVNRUrMe2gn6Pb7g":{"text":"Well I am going off of my in-laws opinions on this one...they LOVE the muffletta that they","useful":2,"cool":1},"sKrj420PyBUVwDKD5qEZWA":{"text":"The line is always out the door but moves pretty quickly.  You're served with that \"rough ","useful":2,"cool":0},"qhyx1EzuCLEesQi1nMjkIw":{"text":"Probably one of the most authentic groceries stores and delis in the country. Family owed ","useful":1,"cool":0},"3LbGr9KGm2c4zljmKE_nQg":{"text":"The muffletta is out of this world. My husband and I went in here for lunch and sat down t","useful":0,"cool":0},"Ha_UNjDEC9V7yScrcx-bUw":{"text":"Went here for the famous muffaletta.  It was good, just as expected.\n\nThe Central Grocery ","useful":0,"cool":0},"DlM7U5pzgNEe7iwBK3tY7A":{"text":"Simply delicious sandwiches were remade and as they were made they were sold! This is a st","useful":0,"cool":0},"0dq_hV5KCu4pE8DT7Unt3A":{"text":"Granted, this is my first and only muffuletta experience, so I don't have a great basis of","useful":2,"cool":1},"tjgnsWbI7XniOFfJInkqcw":{"text":"Had my first muffuletta here last April during the insane torrential downpour during Frenc","useful":0,"cool":0},"HwnQ3w9VvZnuEWEKtrss_g":{"text":"Overrated. We arrived at 2 pm with an appetite for the \"best and original\" muffalatta! Exc","useful":2,"cool":0},"NEkRNMBjBWihZAwcABkSyw":{"text":"Been going her for 35 years now, not that much has changed and that is good!  The Mufalett","useful":2,"cool":0},"hK_ROxZlKixzjsmHCS_TpA":{"text":"Now here is a SANDWICH.\n\nHalf is all you need.......and it is cut into half (which I guess","useful":2,"cool":1},"9zmoYcUfp9o2bPIUWPsuew":{"text":"Sometimes the original isn't the best. I took my mom here since it was home to the origina","useful":0,"cool":0},"t1tqZPyuVMG4KYoU9JQ3YQ":{"text":"This is a place you might miss if you aren't looking for it. You have to come here and try","useful":1,"cool":0},"xlBs5SSEDktIu8Oi3HJRxQ":{"text":"Uhm, muffuletta?! Where have you been all my life?! Haha! Holy smokes that's some good san","useful":0,"cool":0},"xRq2RAPYBSEGC-CUO69Uhg":{"text":"The reviews don't lie. GET A Muffelatta to go. It tastes great hours later in the car ride","useful":11,"cool":7},"TUkmJvjpOdyHKnt5Ljfkpg":{"text":"Five stars, no questions asked.  If you're in New Orleans and haven't tried a muffuleta sa","useful":0,"cool":0},"pyWSrhQ9_XaGgljQRGAfAA":{"text":"My friend and I shared a half and that was filling. We had the cane soda as well. It was g","useful":0,"cool":0},"k7D9vib0YvvAPimMQA_n_w":{"text":"SO GOOD. The muffaletta was SO GOOD. I don't even know what else to say. Just thinking abo","useful":0,"cool":0},"QjfXzXFypSF9mGSxk6i1cQ":{"text":"An excellent and well-constructed sandwich, the muffleta here helps me better understand t","useful":1,"cool":1},"ffDLuIxSzxFuSGwjqXLHfw":{"text":"A must eat when in NOLA! Get a whole sandwich! They are already wrapped to go. Bread is sp","useful":0,"cool":1},"HzCGyOOe6-WRMeFIcE4Ktg":{"text":"Okay, I didn't actually get to step into this store, but I was fortunate to be blessed wit","useful":0,"cool":1},"NDjNb3h_5ZPU-wQSHQ1LOg":{"text":"Muffelatta's - the perfect meal to buy and enjoy later. I'm not sure if this is accurate b","useful":0,"cool":0},"T33Q8qU-Wy-JVZ4I4cf8yQ":{"text":"Quick lunch stop here and ordered a half muffuletta. They had some already up front so was","useful":0,"cool":0},"m8J6aaGFsvTdw7icoVxHSg":{"text":"What You Will Find At Central Grocery:\n\n1)  A fast moving line.\n\n2)  An ecletic assortment","useful":3,"cool":2},"K51TtUVQq9J0-YqG5g_OrQ":{"text":"What do you say about a store that CONSISTENTLY delivers friendly service, consistency and","useful":0,"cool":0},"YKn0yWG-brweukk8mR95KQ":{"text":"This should be on your must go there list. Invented the Muffuletta. The place is very smal","useful":0,"cool":0},"2baHeSJ-LUD2B9ASr4vENA":{"text":"Be forewarned: Their muffuletta sandwich is a MONSTER. Don't be overzealous and order a wh","useful":13,"cool":14},"MYia7Pj29P7RDcU9hGazBw":{"text":"This place is hardly a secret. And you might be a little skeptical at all the hype Central","useful":0,"cool":0},"p_oDnrlLt2RK_Z4ykZ7FIg":{"text":"My wife and i were on vacation in New Orleans and we had to try the famous Muffuleta. We g","useful":1,"cool":1},"SK0VVVWbiBj5IOA2qD_vaQ":{"text":"You go here for the muffaletta. Period. There is a \"store\" with grocery products, but ever","useful":0,"cool":0},"STepQp6gXcjCR7yCnociMA":{"text":"A must for each trip to New Orleans! Best muff ever! Have been going to central grocery si","useful":1,"cool":0},"gM_wUGRp6DUiL10yUUJWSA":{"text":"I love olives and so I am biased but that muffuleta was awesome. The bread was a perfect a","useful":0,"cool":0},"pLraMv0SL1gZZJgq5DDrLw":{"text":"The muffuletta sandwich did not disappoint!!  Probably the best sandwich I have ever eaten","useful":0,"cool":0},"YAHo_rkDlgWc5SYMM5Gszw":{"text":"I was honestly disappointed by Central Grocery.  Their sandwiches are pre-made, which I gu","useful":2,"cool":0},"a5VOnOCcSKgeQfy0LuWhEw":{"text":"There aren't enough places like this. Places that don't have an over crowded menu, or span","useful":3,"cool":0},"ZTKUcHsRwsaEjkmj4AKcgg":{"text":"Outstanding sandwich.  The half was very filling and worth the $9. The meats and cheese ar","useful":0,"cool":0},"JQQYdi3KQcoP0MaD1dalJw":{"text":"A must if you are in NOLA. I'm sure there are several muffuletta sandwiches that you could","useful":0,"cool":0},"rQJsRCbObp8ujHgo9GGP6Q":{"text":"I came here because I heard that this place has the original muffuletta. I don't particula","useful":1,"cool":0},"sTezIkboeQZD4sC2feloOA":{"text":"First off, if you're an olive fan or already love muffuletta, just go here. \n\nNow, detail-","useful":0,"cool":0},"pnLkZOXJtaE5rUeIGuatyQ":{"text":"The large deli sandwich was 20 dollars but it was at least two meals. I heard it was the b","useful":1,"cool":1},"KWnI-SiYfzNS9mwc-Q6zLw":{"text":"Every lent my family fasts meat for the entirety of the Lenten period, 40 days for Orthodo","useful":0,"cool":0},"xK6XK3JS1n6k6HdWfahCLQ":{"text":"I had never heard of a muffuletta until some locals told me about it! All I can say now is","useful":2,"cool":2},"4bQ-QT_odC70CdivUK5xoQ":{"text":"Authentic Italian market makes you feel like Italy. They have the yummiest olive salad and","useful":0,"cool":0},"ZQazApMbhQLeCbgN5dESXQ":{"text":"Mufaletta is worth a special trip to the deli, I only regret no getting a few for the plan","useful":0,"cool":0},"G8qLnv1T312QWnUXfDYbGw":{"text":"Order the muffuletta! It is . Did not expect such a perfect combo of bread, meat, cheese, ","useful":0,"cool":0},"VplJxT6hakr0nX3Nndx9DQ":{"text":"OMG, the only place to get a muffaletta! And, of course, olive salad. Be prepared to wait ","useful":0,"cool":0},"tzp0MPbTFL6GhwM5j3Schg":{"text":"The muffuletta (muff-uh-lot-uh) is a lotta' sandwich. This is where the muffuletta origina","useful":1,"cool":1},"KGyPweOQclpMgtY6ij8kNA":{"text":"Everyone has to come here for the Muffaletta.  Big enough to share between two and delicio","useful":1,"cool":0},"_6gyNWyddfqhY3tyNQB0sw":{"text":"You maybe thinking , really? a grocery store. Ahhh but this is not an ordinary store they ","useful":2,"cool":1},"_1LLlmCzZyvKIAUJ4Yb-6w":{"text":"We came to New Orleans for the food and the atmosphere. We ordered a muffuletta here since","useful":0,"cool":0},"SK-2oTbS7oK5D0kH1cJv7w":{"text":"The home of the original Muffaletta!  As the name states it is a small grocery/deli.  You ","useful":1,"cool":0},"atMYFjT7BdxJWKVeWyb3ow":{"text":"Q. What's big, round, meaty, cheap, and fantastic?\n\nA. Muffaletta\n\nFor lunch #2 on my last","useful":7,"cool":6},"pB_nckDWqOuEOwlR_E7cqg":{"text":"Definitely a place that you should stop while in NOLA! There will probably be a line but i","useful":0,"cool":0},"EEN0aWikczanpK4iL4QGFA":{"text":"Sandwich was good, very crowded and does have some stools to sit on inside. It's what I'd ","useful":0,"cool":0},"U3lEFwaGdXBkzr3HvBPw8w":{"text":"This place is amazeballs!  I dream of their delicious muffuletta sandwich.  It is huge and","useful":0,"cool":0},"_ee8DKUVMA-6kPyTuSC-gQ":{"text":"I guess if you are a muffuletta fan this is your place as this is where it all started. I'","useful":0,"cool":0},"Ttvz8leYQqUe4Ij_8ydprA":{"text":"I had a friend who was down in New Orleans last Spring/Summer.  One of her friends told he","useful":16,"cool":11},"SBEn76gMjv0sw1cO9pwc5Q":{"text":"The muffaletta  is amazing - everything about it - the bread, the olive spread, the meat a","useful":0,"cool":0},"6Jplw9aqFyH_XezkcEvWiA":{"text":"My tastebuds are still remenicing on how good the muffaletta was. Omg. What I would do to ","useful":1,"cool":0},"4qH38qfc9XjTfHyDdbXohw":{"text":"I had my first New Orleans muffaletta here. Me and my mom stood in the winding line about ","useful":4,"cool":3},"2QpEvJtE3qniCGgsYgnvTA":{"text":"Omgeeeeee!  Best. muffuletta. EVER!  Love the olive salad.  Definitely glad I hiked over h","useful":4,"cool":4},"qBLp-CrlDb8AGfit2Tuaqw":{"text":"Best muffaletta you'll ever find. I've never tasted anything better. For about 20$ you get","useful":0,"cool":0},"IHU8pn2XtlisVOGKAh7AVA":{"text":"One of my favorite things about New Orleans is a visit to Central Grocery for their mufful","useful":3,"cool":0},"_Fbr4GcadL1aUxDZWgfpjQ":{"text":"It's great to stand in line in an old fashion grocery store, with 20 people ahead of you. ","useful":0,"cool":0},"Wu8-DYIkj70RmAZoHLEqYw":{"text":"So Central Grocery for a Mufaletta is quintessential New Orleans right?  I'm not a fan of ","useful":0,"cool":0},"khx5TkL3sNALu0E9TAi9nw":{"text":"Reunited and it feels so goood.....reunited cuz I understoooood....\nThere's one perfect fi","useful":6,"cool":6},"9BTz2WpGmRqJVtadSp3wKQ":{"text":"Muffuletta- need I really say more? The bread the cheese the salami the muffuletta oh my g","useful":0,"cool":0},"aXzoMq4AiN5nmy2uvZVTBQ":{"text":"Imagine that your mouth is full of one of the best sandwiches you've ever eaten, and someo","useful":3,"cool":1},"oHKH9CzrYoToBo1pDaEl8A":{"text":"The muffuletta is everything it's hyped up to be! I've been craving it since my last bite.","useful":0,"cool":0},"VowpNUC0_VqKR8U0uovEeg":{"text":"Not eating much bread I was a bit nervous at first. But if there was a love at first bit m","useful":1,"cool":1},"O-0hJg7r5XJgUQz2_uqCUg":{"text":"Several locals suggested Central Grocery for the original  muffuletta. When I arrived mid ","useful":12,"cool":6},"bgkyLg04A0EBGixqt2we8Q":{"text":"Words cannot describe this olive-y taste of heaven.   Take it to go Not enough room to din","useful":0,"cool":0},"il8D2LoryjsTJ1mhnFgwXg":{"text":"Wooooowww I was so surprised by this place. We were on a quest for a memento and stumbled ","useful":0,"cool":0},"hbxtuCOVMjNqQxetmIsODw":{"text":"It's definitely a grocery store. That definitely makes it's bread and butter off of their ","useful":4,"cool":2},"EYCvuCEhz4A_krcNsnN7qw":{"text":"After reading about this in a travel book, and reading the stellar reviews on Yelp, and on","useful":9,"cool":0},"6XOJSttRK6PkkagHjrMcow":{"text":"I have to make a pit stop here every time I visit!! It's a grocery store, not a restaurant","useful":0,"cool":0},"OIXYknVeKH6HzF1YVupLww":{"text":"As tourists, my fiancee and I stopped in here to purchase a Muffaletta.  She and I had nev","useful":0,"cool":0},"ToGbmpHqG-QnEpmjkuygXg":{"text":"The original muffelata. Accept no substitute. They invented the muffelata and others try t","useful":0,"cool":0},"pjOO2jilxzsZ_NT9wCtTTg":{"text":"You can't beat an original. When it comes to muffelattas you gotta have it where it was ma","useful":6,"cool":4},"Jzyab6olfb8qoJ3IFNdlsA":{"text":"I'm a little late on this review but better late than never. I had a lot of recommendation","useful":1,"cool":0},"iIWii7IyOGXjfSP5-AnT_A":{"text":"Muffaletta!!!  Took the advice of the yelpers to take one home on the plane.  So glad we d","useful":0,"cool":0},"v5ur7Ceat3IiRyFzEzLqHw":{"text":"Tried a muffaletta for the first time. It was huge! I could only eat a quarter of one. The","useful":0,"cool":0},"cLDUN6BY4Fyaj0gq2iqrMw":{"text":"I don't like muffalettas. \nI do not like olives or ham.\nI do not like them Sam I am.\nI do ","useful":6,"cool":6},"0INfW0sTbe4O6oq55bc3nw":{"text":"In a word, craziness....  I had orders to bring back olive salad, but not just any olive s","useful":0,"cool":0},"ebINU-J0QrUwLZv8-zrgbA":{"text":"I have been craving a muffuletta!! Finally I got one, but they don't have enough meat on t","useful":0,"cool":0},"eaSZmfOeScOzIy4gGRtQAg":{"text":"Stopped in for the infamous muffuletta sandwich and it did not disappoint!! My husband and","useful":1,"cool":0},"T2adbgbTJnynoWGHKNUqwA":{"text":"The MUFFULETTA is AVERAGE at best. \nBut unfortunately, it is not very good at all. \n\nI giv","useful":2,"cool":0},"WC6VkxKrCihbFMB6HQ3Usw":{"text":"If you want a muffuletta in New Orleans, come to Central Grocery. It's a really cool deli ","useful":0,"cool":0},"zioWgMM3MzepMFHCUsSNOQ":{"text":"Olive spread. Money. Muffuletta is basic but so flavorful. The bread is soft. Meat has gre","useful":1,"cool":0},"G_L2VIvI9qfrsd1lww3A7A":{"text":"This is the perfect place to pick up a sandwich for the plane home to hold on to New Orlea","useful":0,"cool":0},"ogSv3aQlBexAuWrInsaB8A":{"text":"During our NOLA food tour, I had to introduce my wife to the store that created the origin","useful":0,"cool":0},"-kyUIH2w7ptkebI-rGZMKg":{"text":"The hype is real! One of the sandwiches I have eaten in NOLA! We will be back for sure.","useful":0,"cool":0},"HrRBhMJGOEtPqPoHhzLgYQ":{"text":"Step One- Get In Line, it's worth it. Step Two- Order 1 whole Muffaletta, some Zapps chips","useful":1,"cool":0},"uYV60bvZsIiYrPdjtIPvtQ":{"text":"Must stop when in NOLA!! So amazing...and the cheese and olive spread to die for. The muff","useful":1,"cool":0},"NO4a7hfswuKTRwdVjXEPzw":{"text":"Home of the original muffaletta sandwich, you better love or at least not completely hate ","useful":0,"cool":0},"jCMZedpOASH77AyNilNUBQ":{"text":"Central Grocery's muffalettas are perfection. The bread is just right - thick enough not t","useful":3,"cool":0},"02ezKn5vQ3oJUd_CVlg3ow":{"text":"On our recent trip to New Orleans, I knew a trip to Central Grocery was a must. It's a sma","useful":0,"cool":0},"q0-TFqkj8r1APAegMTzbrg":{"text":"Killer muffaletta sammy! A local patrol officer recommended this as the place to go for au","useful":1,"cool":1},"xo5cEX-X2-uzI9anba0pBA":{"text":"Ok, maybe I'm missing something here but I'm not seeing all the hype.  Then again I've nev","useful":2,"cool":0},"D6WnUEC8FRlkes7XsnG78g":{"text":"Worth the hype and the getting the signature Muffaletta. If you order the whole thing, it'","useful":0,"cool":0},"FxS2cucT6exWop4ZRP6DfA":{"text":"What can you say about an icon? It was great! We came in early, so no line and we had the ","useful":0,"cool":0},"T3kZWzW_rAFM2G05zr_vSQ":{"text":"The line is always out the door but worth the wait! I crave a muffuletta all the time now.","useful":0,"cool":0},"g_P3TlgPBtrvOX1aWNGMcg":{"text":"Best muffeletta in nola in my opinion I always get a whole one and take it home with me an","useful":0,"cool":0},"FF6LfzmOse8fNqkTqpxs4Q":{"text":"When I read \"Grocery\" i thought it meant that you can really get groceries here. Not true.","useful":2,"cool":0},"fwfi-qBMkk9coOwT-CRGwA":{"text":"Great service!!!!! Everyone is very nice and helpful.  They pack their muffuletta on the s","useful":0,"cool":0},"URDff8QjTdjLekbNBnoD-g":{"text":"OMG!  The best MUFFULETTA in New Orleans!!!!!!\n\nThere is a reason there is a line to get t","useful":1,"cool":1},"fqZaXH8TDsH6lBkddNEbQw":{"text":"This is one tired old way below average Italian deli. Pre made Muffulettas served very eff","useful":0,"cool":0},"mwhCpnzuvCzQAukkY3DNlQ":{"text":"This review is for the muffuletta only. It's delicious! Highly recommend it. It's a perfec","useful":0,"cool":0},"S1HBLNGwuZtF4gf7A_6--A":{"text":"I have passed this place a hundred times and never knew it was even there. It's where Muff","useful":1,"cool":0},"wxibSJG_5hoqwNtogeBO8w":{"text":"Really solid 4 star sandwich, but still doesn't stack up to delis in Hoboken, NJ.  If you ","useful":0,"cool":0},"SutIMC_UFZxONwx9hqkZKg":{"text":"Ok this is seriously the best place to grab a muffuletta!! For just under $11 you can get ","useful":0,"cool":0},"0IHG4I4EDNsdNo7K2As1cQ":{"text":"The Muffaletta was one of the best sandwiches I've ever eaten!","useful":0,"cool":0},"j5EvnkOfNTmEOy2bQE_ieg":{"text":"Little bit too salty. Overall the muffuletta was better than we expected.  The olive salad","useful":0,"cool":0},"cFBnHVAJOz1lftbmvcM-xQ":{"text":"Here's a cliche. When you look around for the dumb person and can't find him...maybe it's ","useful":2,"cool":1},"kkQOnwkO8HRlEeAYEpTE6Q":{"text":"Muffuletas took the honor of being the first thing I ate in Nawlins. You might be shocked ","useful":8,"cool":3},"xwYDzjjDhR91-i4v9AUgSw":{"text":"The muffulettas are simply fabulous!  A must visit. They have veggie options but boy oh bo","useful":0,"cool":0},"GglBX2Lr5mMvHXE7evWpBg":{"text":"Effing amazing. I'm drunk but this was so good. I forgot to take a picture. Just oily, mea","useful":3,"cool":1},"bdA2xjaM_vSRFU_z8Xjd8g":{"text":"I heard that if you were going to have one muffuletta in NOLA, you have to have it at cent","useful":1,"cool":0},"MIubimydfHuNnSmmIkNB8A":{"text":"Stopped in at a perfect time, there was hardly a line and grabbed half a muffaletta to spl","useful":0,"cool":0},"Gz1y4tN0dGr_w_7LAo4HFQ":{"text":"Famous Italian grocery store famous for it's inventing of the Muffaletta sandwich which is","useful":0,"cool":0},"5U0u2ZaIrU0xzUzW3270fw":{"text":"If you have never had a muffelata you need to put this place on your to-do list! They are ","useful":0,"cool":0},"LiH_92wsnx53B3TdFYV3Pw":{"text":"Muffuletta was great.  Cool little store.  Awesome place to have lunch if you can get a se","useful":0,"cool":0},"ukjNf6eQu2K3j-ZmIT-YSg":{"text":"One of the best sandwiches I've ever had.\n\nWe got one full sandwich to go and walked to so","useful":1,"cool":0},"RYnfXgk1qHv65RUkz4gqkQ":{"text":"Ok I know, a tourist trap. But, that being said they still do make a great muffaletta and ","useful":1,"cool":1},"vjg4le1XWln3-XB-K6VZoA":{"text":"Loved this place. It's not a sit-down restaurant so don't expect that. Grab your muffulett","useful":0,"cool":0},"s0JXQ89kHIMk7gyHCx_biQ":{"text":"Personally don't know how this could be less than a five for the muffuletta!  It's been a ","useful":1,"cool":0},"V_JhPzPQP4VApx8DP00lQA":{"text":"The place itself is a store with many different Italian groceries and snacks available.  I","useful":2,"cool":1},"9VRc7qNhB2f49QSMRgKYkg":{"text":"We came here to get the famed \"Muffeletta\".\n\nIt was just OK .... im sure this place makes ","useful":2,"cool":0},"Yce4_qXtgB0gCNM8WTsqUA":{"text":"I really thought my boyfriend wasn't going to like it. HE LOVED IT, more than me!!! I thou","useful":0,"cool":0},"LVN5nssvFzR9x56vLIfcAg":{"text":"Easiest 5 stars ever! Its a $20 sandwich but whatever. There was no line, she took my mone","useful":0,"cool":0},"oZB8f_mb0pbal6eN3u6Evw":{"text":"The legendary muffalettas are exactly as good as you expect. When my husband's uncle picke","useful":1,"cool":2},"b_7n2lfA3tftN5qhg0FadQ":{"text":"Ok if you only go for the muffuletta you're missing the fun!  Take a look around and enjoy","useful":0,"cool":0},"HgwbjXXY9-yQTs6jEgCVGg":{"text":"I'll make this simple, just go here and get your muffuletta from here and enjoy! They are ","useful":0,"cool":0},"bk6jOF7aWFRy9Ew_pFWIWg":{"text":"Price $\n\nCustomer Service - Friendly and Attentive \n\nThe best Muffuletta I've ever had in ","useful":0,"cool":0},"7WEpJJRHogBD6xFHb7NeRw":{"text":"What a great surprise walking into the Central Grocery Store. The smell is fresh and wonde","useful":0,"cool":1},"AFvKN1j55xZwdyahJp3qWg":{"text":"I ordered a full sandwich and ate half of it myself. I'm a small white girl with a healthy","useful":2,"cool":2},"uRTQaSuIFFaBNVUNT1SqIg":{"text":"My oh my the muffuletta!!!! That's all I came to the CGC for right before my flight back h","useful":2,"cool":3},"EuLSE5a2Vj5TpelwkhBlxw":{"text":"Complete rudeness. I was the only customer in the place and asked for a menu. The guy poin","useful":1,"cool":0},"aEDhw1xF6oubv4g8aTR0VA":{"text":"Meal #2 of my New Orleans belt buster weekend\nSimply. The. Best. Muffulettas. In. The. Wor","useful":0,"cool":2},"uaQDCpua_03uczmy8RY3rA":{"text":"Unless you're a local shopping for groceries, there's only one reason you're stopping by h","useful":1,"cool":1},"t6EF9Mztxtra6mR-Yt4zkQ":{"text":"Well worth the wait. Take a gander at all the cool old Italian grocery items while in line","useful":0,"cool":0},"OoRx4o6Rfyv8ZS6NrLzKBw":{"text":"Awesome Muffuletta!  They had us in and out of line quick, and had plenty of seating in th","useful":1,"cool":0},"nEYRveldDE8_SvoUczo0Cg":{"text":"Ok you go here to get a muffuletta and leave, Do not expect to sit and eat here, its a gro","useful":2,"cool":1},"AFKns7cT3EttLYV3aRylPw":{"text":"A Central Grocery Muffaletta is the best sandwich you will ever have.  Period.  Make sure ","useful":2,"cool":1},"8fod1sMvsJrvZRCn6u0Z4w":{"text":"I had a Muffuletta with an Orangina. It was good. It had too many olives though. I wouldn'","useful":0,"cool":0},"oP-oXFMBR5TH6b6ZmLF7Gg":{"text":"Muffuletta was great. Definitely shareable.  Had one and shared it between 4 people and it","useful":0,"cool":0},"d8eGG4-r5ZIO-ofEySp84A":{"text":"It was just ok....the bread was greasy, the lady behind the counter was not friendly, and ","useful":5,"cool":1},"uJTKXoIKHVAqkzUsmdR3WQ":{"text":"Let me begin by saying my rating is based upon my personal experience with the customer se","useful":2,"cool":0},"wh3J5yF-SAmUKtiYKyTD1w":{"text":"We were here due to the famous Muffuletta. If you come to New Orleans, you got to try thei","useful":5,"cool":3},"H_1bkZSjKolvPFLLsvzNsw":{"text":"This is an interesting place. An Italian market with a lot of imported goods where the onl","useful":2,"cool":1},"MpVqe9aMWjeAao9UejS_-w":{"text":"Amazing muffuletta and great selection of unique Italian grocery items. The people were fr","useful":1,"cool":1},"pEAv2TOTDxy3Bg_CSeMZKg":{"text":"Best thing I had in New Orleans. My girlfriends and I loved it so much that we ate it a fe","useful":4,"cool":0},"SdyOijpqS0sZMhCcANRgeQ":{"text":"That sandwich... Yummy. I can't go back to any normal muffuletta. This one is clearly the ","useful":0,"cool":0},"OX5cYbnXJKIdS86Du5t54A":{"text":"BEST MUFFULETTA EVER. Line short, very organized. Central Grocery is located across from C","useful":0,"cool":0},"y3zV5G45wnjW5H5DkuYzAw":{"text":"The best sandwich in New Orleans.  When you go there the menu is simple.  You have to orde","useful":0,"cool":0},"GBf0zQ9hyvIoVmPRSpq4Og":{"text":"My husband and I visited friends in NOLA for Mardi Gras. On this trip I wanted to try a mu","useful":0,"cool":0},"NdTyJkOSlrG5b3NMEHmK_A":{"text":"THE best muffuletta in the city whether they are the original or not.  (Who cares). The sh","useful":0,"cool":0},"dRQJx2yETgFrb_VP6IpFew":{"text":"Yummy olive tapenade and delicious meat what more can you say? I do prefer the knockoff of","useful":0,"cool":1},"fw5Esi5SCLqiHQTMdyv7tg":{"text":"This was such a disappointment. It use to be full of olive salad. Only a couple of olives ","useful":1,"cool":0},"e1ylxPqxlcJt8tl7gscNqQ":{"text":"For my first experience with a muffuletta it was pretty good! I didn't really care for the","useful":1,"cool":2},"ZMgW_8rNKEGmcVu5eHOLpA":{"text":"Amazing just amazing! I love the muffuletta so much and you can't compare it to any other ","useful":1,"cool":0},"gmMzjmestb-gU0IqhG2tTg":{"text":"If you walk by this place you wouldn't think its home to the original muffuletta because a","useful":0,"cool":0},"Q3CLLacMcjpLjL6_qaZpqQ":{"text":"Had the best muffaletta ever there.Had it about 35 years ago. Went to the jazz fest 5 year","useful":0,"cool":0},"EmsbOFAq9tm2oCJXtWuATA":{"text":"3.5 stars \nWe tried the Muffaletta here as it's the deli where it was first created and se","useful":0,"cool":0},"lCvQc9Fu7vI7cs61kApcsw":{"text":"Central Grocery is a New Orleans institution. Yes, there are many places in The Big Easy t","useful":6,"cool":3},"TAExm3SHIwxuTGrAH5SDqg":{"text":"Central Grocery is a cool little Itailian grocery store down the way from the French Marke","useful":4,"cool":2},"2n1E-xo_u8guNW0oclIbGA":{"text":"Had 1/2 a mufulatta and it was very good and filling. Hearty bread, meats, cheese and oliv","useful":0,"cool":0},"9VYfU6eQoPu5A5eUcJerdw":{"text":"Got to the store within an hour of close. It was busy but found a place to sit  quickly. T","useful":0,"cool":0},"7VnnZoylGiAZWXa20KG-tA":{"text":"You know when you get those cravings?  \n\nYou know...THOSE cravings?!?!!?\n\nThere are few th","useful":1,"cool":0},"WZ67URjtrz_ccHkYDFWkkg":{"text":"I went to Central Grocery twice during my vacation, it would have been three times but my ","useful":0,"cool":0},"ZzpWxztHM5Q93HgMX-hRVg":{"text":"Birthplace of the muffuletta and an actual Italian grocery store. We wanted to pick up som","useful":1,"cool":0},"dKLL-mCQc75gwO-hhZT_qg":{"text":"Yes the line was long. Yes the service was a little slow and grumpy. But the Muffalettas m","useful":0,"cool":0},"JIpn2MYZPDY2KSo2FFudWg":{"text":"We were in New Orleans from late Saturday through Tuesday afternoon so because they are cl","useful":0,"cool":0},"pX2V4JCSsLA_zycfjioUPQ":{"text":"A real New Orleans legend. Fun spot. Casual, unique Italian market. And Oh My, lived the s","useful":0,"cool":0},"8BzQXgQIqeB6wxzVIdlsgQ":{"text":"We stopped in to try the famous muffaletta & waited in quite a long line. It moved fairly ","useful":3,"cool":1},"JQdh66bJNRe7N7gB9p_jOg":{"text":"We all hear about Central Grocery as being a store where you can pick up speciality goods.","useful":6,"cool":4},"EGLYsr287SdfsMUvpAjSSw":{"text":"The muffalettas here are pretty good. I like to olive spread. Very large, half of one will","useful":1,"cool":1},"WX-p1eo_hLZ2XJ4U8HfLcA":{"text":"Nice selection of imported grocery items.  The sandwiches are huge, so we ready to share. ","useful":0,"cool":0},"pWzskYftlR9yuwoD1mKUyA":{"text":"Yup. You have to go here as part of the Nawlins tradition. The muffuletta sandwich was sup","useful":0,"cool":0},"kdtxGJuho6HFjD6MCCI3zQ":{"text":"Was recommended this place by one of our tour guides - said it was the best muffuletta in ","useful":0,"cool":1},"a9V4BM6qwXrLhgck_Xz8Fw":{"text":"A muffuletta from here is a must! We loved it so much we ate it for lunch 3 days in a row,","useful":0,"cool":0},"RP05bvQ8O7yX1RSj_0Fz_w":{"text":"Nothing better than a muffuletta from Central Grocers!  The bread is awesome.  Reminds me ","useful":1,"cool":0},"4cLbx-ZOuowULqieo5RD4A":{"text":"Best muffaletta sandwich ever . \nThe bread is so light and fluffy, hands down best sandwic","useful":0,"cool":0},"C95-inWd_0fmUvom4DSgMw":{"text":"Muffaleta. That's why you come here. I must admit I'm not a fan of cold cuts, unless it's ","useful":4,"cool":4},"nbfUvja36afhPss_dDOgNg":{"text":"Best muffaletta ever!  Do yourself a favor and get food from the central grocery while in ","useful":0,"cool":0},"Q8nVIR0TrD_Npz2jtVJV5w":{"text":"The original muffuletta. \nEither I'm getting old and complaining of hypertension, or this ","useful":11,"cool":13},"WmLFbAK8dcpQo-aOXiLSeg":{"text":"Central is the originator of the muffuletta. That alone gets them four stars.\n\nI realize a","useful":15,"cool":7},"1ytVq4WYkntE-5cwI4imZA":{"text":"Arrived at 12:30 on Friday and there was a three minute wait and just enough stools in the","useful":0,"cool":0},"m4RtR3au7tb3px4znOiB3Q":{"text":"Tried a muffuletta elsewhere and wasn't too impressed\n\nThe one here was very satisfying th","useful":3,"cool":2},"JxKq8cAUrcANWYdhwI_WYg":{"text":"The original mufalata  was born here. These are simply the best. My husband and I love, lo","useful":0,"cool":0},"ZxxyeN_AYOXvDeNb-MfNyA":{"text":"If you want a delicious base to start your day in Nola, get here early!  We made it in aro","useful":2,"cool":0},"PBJwAX54YyEPb22d6Y4l_A":{"text":"Perfect muffaletta.  We would go back just for this sandwich!  It was fresh, tangy, and ma","useful":0,"cool":0},"zpGuPc_KY7MMGxBMrgg0_w":{"text":"Just had one of these Giant Muffuletta Sandwich's which we had sent to California \"Next Da","useful":0,"cool":0},"hzFqpNGMyt6Juo5W5fMPXQ":{"text":"I always have at least one Muffuletta when visiting New Orleans. Figured I'd try the origi","useful":0,"cool":0},"FIavk0Q61OgyFIAIg-JpMQ":{"text":"THE MOST DELICIOUS SANDWICH that Mufaletta!  Really, truly delicious.  Perfectly balanced ","useful":0,"cool":0},"GU4jrqfNEPRwmxv6Ip2uig":{"text":"the only place to grab a Muff sandwich in NOLA .... a must go to ... thumbs up ... !!!!!!!","useful":0,"cool":0},"mj1yYk_LNOCKDrGlZf4vbw":{"text":"In New Orleans, one of the most frequently mentioned and visible foods throughout the Big ","useful":3,"cool":0},"saybwrKTB3BOTsBVzLYenA":{"text":"Great place to visit for muffulettas! Quick service and friendly employees. I will definit","useful":0,"cool":0},"bH5Pt26-WBSJ1OPFOBNM7g":{"text":"Our reason for shopping at Central was to purchase muffuletta sandwiches for our tailgate ","useful":10,"cool":12},"_dDU1HYmKDzHi59JnSppxA":{"text":"Really enjoyed this sandwich. It's a neat little market right in the French Quarter. There","useful":1,"cool":1},"IHMZQKsq9_M0xqc0FUodcQ":{"text":"Cool old grocery store that sells the famous Muffuletta sandwich.  I believe most everythi","useful":0,"cool":0},"Kef1Hd4SQxnxvWA-KIsa8w":{"text":"Interesting to try but the sandwiches were kinda hard and not hot or crispy, maybe it was ","useful":0,"cool":0},"5ulIu45igXAm3ZnP6DMYyg":{"text":"If you are gonna be right about something on your trip to New Orleans...let it be about th","useful":1,"cool":0},"n0Z17HKSKq7cXRJRzhKpFA":{"text":"Yummy muffuletta from the place it was born! It's quite a simple sandwich, but what makes ","useful":1,"cool":1},"nfCr7UZq21JmIYRkapnPcg":{"text":"Very tasty sandwiches and I like the spongy bread. The olive spread is the highlight of th","useful":2,"cool":2},"KF-fuTu0qUwRMZWmjmUwwA":{"text":"Oh how I love this place!  It is always the same, consistent excellence, quality food, gre","useful":0,"cool":0},"VBR-lMQdIQMKAJP27AmqCQ":{"text":"Came here because my friend told me I HAD to get the muffaletta and they did not disappoin","useful":3,"cool":2},"9qydBfkVqV_2ngEwBBWLdA":{"text":"I lives 2 hours away and dream about the muffulettas. When I used to live in Colorado and ","useful":0,"cool":0},"rSCuxqLjvPjWlJGRNmEPaA":{"text":"Mufassa?  \nManchego? \nMuffuletta!  ‍‍\n\n\nHave you ever had one?! Zach joked about mailing t","useful":2,"cool":0},"0cnXsrDOL8XrE3X-I0d1Sw":{"text":"So good! Nothing to say that hasn't already been said. The muffuletta was fantastic, agree","useful":0,"cool":0},"FkpbwSadUvyOW-cemXbQiw":{"text":"Had to come here for the original MUFFULETTA. Very delicious and consistent. Also tried a ","useful":1,"cool":0},"COGCvcPpglFpNpzwyA_tBQ":{"text":"This French quarter spot did not disappoint! The muffuletta sandwich was huge and had a go","useful":0,"cool":0},"eXbjWBzD2pU8w_HUfxhDMw":{"text":"Another food staple to try along with Italian soda! We are vegetarian so the owner made us","useful":2,"cool":1},"H24zZ2pi355d7LBHphRnhQ":{"text":"There are some bucket list, must-dos in New Orleans that most locals only do when their fr","useful":23,"cool":14},"68YKopAyEM3ssocQ7ulNmQ":{"text":"I really don't understand what the hype is about this place. We waited on line in the rain","useful":5,"cool":1},"3a_ySReFLTy09r56LqpRQg":{"text":"A NOLA experience that's a must. The muffuletta sandwich is a giant creature that will eas","useful":0,"cool":0},"5qWX6gfOv1NvMSYVdbjdcw":{"text":"When I heard of this place I thought it was a front for a depraved sex dungeon renown for ","useful":0,"cool":0},"ZxxLdUJjwbJJlh3f1bFRjg":{"text":"Good muffuletta sandwich, very fresh with nice olive spread. Pretty cool store as well wit","useful":0,"cool":0},"MiQEpy3p7KRElElWeUoz1Q":{"text":"The best of the best, the granddaddy of Italian sandwich's. The muffuletta here is amazing","useful":0,"cool":0},"T_3w5OSNVtrnpYxEUlUseA":{"text":"This review is for the muffuletta sandwich only. It's delicious! I highly recommend it. It","useful":1,"cool":1},"I53tvgFBItkJAxd7aL2-Ww":{"text":"An old school spot with interesting grocery finds and a line out the door for the muffulet","useful":0,"cool":0},"IvBs9yioekpMMWU1VRuoyA":{"text":"The half muffuletta sandwich is enough for two people as a light snack. Line was long 30 m","useful":1,"cool":1},"CXtkMBGZPUIgPLW0ubjkSA":{"text":"Muffuletta...Muffuletta...Muffuletta.\n\nThis place has a line out the door almost every tim","useful":0,"cool":0},"H4MerVxnevt5lBpGdjwfyg":{"text":"Had to check this place out after seeing it on tv and having more than one person recommen","useful":1,"cool":0},"6kneLJYawrDv2a-hR2-_Rw":{"text":"Several Years ago I had my first muffuletta sandwich from Central grocery and I thought I ","useful":1,"cool":0},"MAPgNXX0ugwhK5qPOJjhEA":{"text":"Just say yes to the original muffuletta! This delicious sandwich is made with sesame bread","useful":1,"cool":0},"dQoNus1pWREG2rQsLKppzw":{"text":"Best muffelleta in New Orleans! !! By far the best sando for your money.. it's a small pla","useful":4,"cool":2},"KYIZyW3kwZt8O1AeDwhGpQ":{"text":"I love a good muffeleta and this place has the best. It has more meat and is much better t","useful":0,"cool":0},"nIefEPGJ6fhcs6QkP7_xhA":{"text":"**MUFFULETTA MADNESS**\n\nThe line was short and efficient. Pre-made and ready to go with so","useful":6,"cool":4},"xE16cR0U-BCtQurE-ztgAw":{"text":"Yummy muffletta! It's enormous and delicious! A little salty but so good that we just kept","useful":0,"cool":0},"bCIV9jec7sumiyvL9ScNAg":{"text":"The muffuletta sandwich lives up to the hype! One of the best sandwiches I've encountered ","useful":0,"cool":0},"y8mcKnWLpzOirqmP8Anv_g":{"text":"Very friendly staff!!  The store has the great feel of old Italy. Awesome muffulettas!!","useful":0,"cool":0},"zd8PRT6hrakPVqMKpLQ3Gw":{"text":"I ate here a few months ago and have been meaning to leave a review . I was not surprised ","useful":1,"cool":0},"I1Ragvy0TkjeP1ASC6o5-w":{"text":"First time having a mufaletta and it was so good we had it for breakfast and made our Uber","useful":0,"cool":0},"XnHPzh6FYF-dZCXLdqYuPA":{"text":"So I'm not a red meat eater but everyone urged me to try a muffuletta from Central Grocery","useful":1,"cool":0},"_w98WYCzYAuh9kahWFH9lQ":{"text":"Everyone I spoke to suggested that I get a muffuletta from Central Grocery during my trip ","useful":5,"cool":3},"KPru-c-ZmlKjYYIAYdXOEQ":{"text":"I haven't been to the store proper since relocating to the Pacific northwest.  And truthfu","useful":4,"cool":2},"Kjx0hwor4IGOhdMFN6QJtA":{"text":"I bought my souvenirs here. Jars of olive salad so we can make Muffeletta's back home ( sp","useful":1,"cool":0},"0_QV4A-hWBXBrBFiNM3t4g":{"text":"Mufffalatta was great, but the olive spread was over powering for my children. Service was","useful":0,"cool":0},"Wm1EuUD952csjg3M20AyEQ":{"text":"A muffaletta \"to go\" for the plane ride home sure beats anything the airport and the airli","useful":4,"cool":3},"ZhZcjbosXbuTNKxItPiGJw":{"text":"Muffaletta is the bomb! Olive tapanade was so oily it soaked all the way through the spong","useful":0,"cool":0},"p1KaPifcSoj_z0PtDJAeGg":{"text":"I was walking down Decatur when I saw people taking pictures outside of this place. I deci","useful":0,"cool":1},"9vgkJMdXhPl_i8Ov--Mpjw":{"text":"Got to go and get a muffuletta!   Most amazing sandwich out there.   You will say I am not","useful":0,"cool":0},"LMQTeXddkWSDVAc-fIxgCg":{"text":"Was heading to NOLA and was told I needed to have an original Muffaletta Sandwich.  So we ","useful":0,"cool":0},"IrbvFtcPvQTOZ5aShbJpAA":{"text":"You are missing out if you don't stop at the home of the original muffuletta sandwich! My ","useful":0,"cool":0},"SAokWwHxSJSw_dpkbLi7hQ":{"text":"Amazing Italian Food\nMy wife and I come from NYC and are always eating Italian food and it","useful":0,"cool":0},"Hx_yp9YTrERp79cM6dHp2w":{"text":"Not the most inviting place, but because it's the birthplace of the muffuletta, it's a mus","useful":0,"cool":1},"NDzGtveHF5BrKlOcsERmVQ":{"text":"This Italian market that serves the original muffuletta: an Italian sandwich brought to ne","useful":1,"cool":1},"WMvJU5f9U5YXWGY8b_lOKw":{"text":"The muffuletta from Central Grocery is big, bold, and beautiful and you HAVE to try it - e","useful":0,"cool":1},"Cxw9xWbOMM-YAy-cFBL1vw":{"text":"The sandwiches come cut, so no need to ask. When you walk in just read the signs so you ac","useful":0,"cool":0},"04irPm7qXjdVLc01HNnBNQ":{"text":"This place originally opened in 1906 and is famous for inventing the Muffuletta sandwich. ","useful":3,"cool":3},"lFfPMpQwzkp6N6UzJz3o_g":{"text":"The Muffaletta is amazing. This review is for my experience, only. I walked in on a weekda","useful":0,"cool":0},"eCCTsapF5qZfY6ZPEFjkUw":{"text":"Best Muffaletta sandwiches! We always get a whole- some for now & some for later!! Worth t","useful":0,"cool":0},"qWP3u1uLFV1o8cqs8RiNnA":{"text":"Every time I visit New Orleans, Central Grocery is on my list of places to go. On this vis","useful":2,"cool":1},"XYpTzCxThRFOYBGaCjIVKg":{"text":"Like most have said, the muffaletta is delicious and worth the wait. The line is long, so ","useful":1,"cool":0},"7Gdibk9i3zBs6Q_7suxCcg":{"text":"The line is often long, and your not likely to see any local inside. However, they have a ","useful":1,"cool":0},"oqavnCJnpSUq8alLohVe-Q":{"text":"Do you know what a muffalata is? Well you should because it's the sandwich of my Italian w","useful":9,"cool":4},"gk7lkVG44I4sFJTPvazBew":{"text":"Because we ordered a whole sandwich with half olives they charged us for individual halves","useful":2,"cool":0},"Rlqea0cWe1alNagWJz7_TQ":{"text":"Friendly and patient staff.The muffulatta is massive and excellent value so sharing recomm","useful":0,"cool":0},"uVsaifNnX0EsYglk5J3kBA":{"text":"Yummy yummy in my belly. We got a half. It was more than enough for two people. It is a sm","useful":1,"cool":1},"0Y6I-wfXfi4Qrp0EVlz6UQ":{"text":"When in Rome...\n\nWe avoided this place like the plague the last time that we were in New O","useful":4,"cool":2},"UVARTGIM3FA03gBBkWSRtQ":{"text":"Central grocery is a New Orleans must go to. Every person I talk to said that we must go h","useful":6,"cool":5},"YTHGys96zT019CHWO0sDDA":{"text":"This is one of those places you should consider visiting on your first trip to New Orleans","useful":3,"cool":0},"klC0WBh42U23ZksQgV2tOA":{"text":"This place remains elusive!! \nLast time in New Orleans, it was closed during a time its ho","useful":0,"cool":0},"YmrBXUPW5KoZQ-xctGEleg":{"text":"This was okay. Not great, not bad. I suppose it's a matter of preference, but I did like t","useful":12,"cool":10},"oPmCncu9QQ_eE0f0D9GnmA":{"text":"We stopped here on our last day in New Orleans for muffuletta. It was amazing!! We ordered","useful":1,"cool":0},"PRRUAAjlhUEbwguk1lA2eA":{"text":"Great sandwich. I ate it on the plane it was good the delicious bread was a bit tough.  Bu","useful":2,"cool":1},"azNwyC6up3LawOuz-z7kmQ":{"text":"A family tradition! I can't visit NOLA without stopping by to pick up a \"muddy\" as we call","useful":1,"cool":0},"Xpa7dsnZjkSHQft249U8pA":{"text":"Thanks to GoldBelly we were able to try the famous original Muffuletta! It definitely live","useful":4,"cool":2},"UMg1ZsvNQXkv3CVXQpvIvw":{"text":"Meh!  We all had the muffuletta based on reviews and online recommendations.  I gotta say.","useful":0,"cool":0},"MvE-xTF41Gfp6VsWoGTR9w":{"text":"I wish I took a picture because it would have said it all.  \n\nMy husband wanted to go spec","useful":1,"cool":0},"kgmota5ETnI7jsLgoa3-xw":{"text":"One of the best sandwiches that I have ever eaten. \nA New Orleans must . Friendly and fast","useful":0,"cool":0},"zc-LhEEfqgKSO840L9XrHQ":{"text":"I was sent two muffuletta sandwich for my birthday. This sandwich is my favorite since I d","useful":0,"cool":0},"7GbA_iODXwQtK7I5Gh3SLg":{"text":"I am 32 and I have been coming here for muffulettas since I was a young girl. Today I brou","useful":2,"cool":2},"7e7Os09mRlJ_tDGv3Ux8mA":{"text":"My wife and I were in town for a long weekend and saw this store on DDD. It was the greate","useful":0,"cool":0},"lmGN5ZKopxBcmGcAWPykIw":{"text":"The sandwich was exactly what I was hoping for ! I visit New Orleans 2 times per year and ","useful":0,"cool":0},"KQ1PjDSgm3es1zL6U-sRdQ":{"text":"Just had the 1/2 muffuletta sandwich. It was HUGE! $9.50 for a half and I'm stuffed. If yo","useful":0,"cool":0},"tdw0K73YWjRw8sPaXpDUaA":{"text":"It was my first time in NOLA, so I had to try the Muffuletta once.  And just once is all I","useful":0,"cool":0},"NibkyfQxyL5umDe_dYoh6A":{"text":"THE MUFFELETTA.\n\nIn the top five all time for sandwiches I've ever eaten. It seems so simp","useful":0,"cool":0},"QEGWQoRpP6rPJttvKpTf9A":{"text":"My sister recommended this place to my mother and I because of their \"Muffuletta\". At firs","useful":3,"cool":1},"OJ4HchWEeB3FDAt76cvahQ":{"text":"OMG, I'm so glad that my friend had literally begged us to stop by on our trip in NOLA.\nIt","useful":2,"cool":0},"F4qpJpfUT7DhnxOCm56K9g":{"text":"A New Orleans Muffuletta staple! They beat way to eat a muffuletta is hot so we like to go","useful":2,"cool":2},"hLjzuMgxtQjHx5mofiFqxA":{"text":"The thought of the smell inside of this store has me drooling. There is a very nice select","useful":2,"cool":2},"4SIZn2cqxYJmSwF0VqSdDg":{"text":"History of the Muffuletta The muffuletta is an Italian-style sandwich invented by Salvator","useful":7,"cool":5},"jXt2eWVo1v03WDxWrYW4jA":{"text":"Home of the world famous muffaletta sandwich. I have looked everywhere for a reasonable su","useful":0,"cool":0},"xxueTaKrjGIm4l-AGKXPmQ":{"text":"You have to get the muffuletta sandwich!! Even if you aren't hungry, take it with you to g","useful":0,"cool":1},"DcKnmiOhpvFQMWzGhhI6iA":{"text":"Wish they would open shops in other states. Can't find muffulettas like this anywhere.","useful":0,"cool":0},"zLMn1bWAdJ5WvScY6pJdpA":{"text":"I'm glad I finally made it to this New Orleans institution so I know, for a fact, that thi","useful":4,"cool":2},"Pb8dOKlJfc8ipIeuLahOUw":{"text":"Iconic and delicious!   The large muffuletta is pricy, but worth it.   This sandwich began","useful":0,"cool":0},"IuVz1G_biZ_Mlfmpwu_ZyA":{"text":"Sandwich shop stuck way in the back of a century old grocery in the quarter making muffala","useful":1,"cool":0},"6uFmZBXbbw4HiJRw5pqVZQ":{"text":"I made a pilgrimage down to Central Grocery on a hot summer day, and prayed the whole time","useful":1,"cool":0},"Yf5bXmz_Zve-yQWxxU0UcA":{"text":"Where do I begin?! First time eating a muffelatta & it was pure bliss. It was the right am","useful":0,"cool":0},"510zsot_wAhYip-9E5orxg":{"text":"Being the birthplace of the muffuletta, Central Grocery was on my food hit list in NOLA. Y","useful":3,"cool":1},"_81_WUH1majMvel3WIG_cw":{"text":"Ever had a MUFFULETTA before? Not me! Central Grocery has made these sandwiches popular no","useful":34,"cool":34},"tXTKfGNsiFu4xnPHGz6WEg":{"text":"There are no words for the amazing creation of the muffaletta.  Paired with some crispy bb","useful":0,"cool":0},"Tl-CLFWGO7lRIQTYV939Eg":{"text":"Not much more to add except to say that all the naysayers are simply wrong.  The sandwich ","useful":2,"cool":3},"yQ88gGbrdDZGSfgDfuRghw":{"text":"Central Grocery opened in 1906 by Salvatore Lupo, who is credited as the originator of the","useful":7,"cool":6},"WPM8f5APiGsjKKPJZl_ksQ":{"text":"We are down in Louisiana visiting my wife's family. On our way to the World War II Museum,","useful":1,"cool":2},"rqFaFzx7gIAJ7nmXakdvEg":{"text":"An institution and well worth any line. The Muffuletta is actually better than any sit dow","useful":2,"cool":0},"ZbWhuGTQJSlAXM1pInCHjQ":{"text":"I like the muffuletta. But they are all prepackaged and not hot or anything, is it suppose","useful":0,"cool":0},"LE4KgSycg88ipO1DK88Dww":{"text":"I'm rereading the reviews because I'm still confused by all the hype. I'm not sure what I ","useful":1,"cool":0},"FRucjMgdAic89a8zREAMUA":{"text":"Home to the original Muffuletta . It was A HUGE and amazing sandwich. My wife and I split ","useful":2,"cool":0},"AewIAWvchAmyH1UmdtxCZg":{"text":"If you get a muffuletta anywhere else you didn't get a muffuletta!  Not only is this the o","useful":0,"cool":0},"klwbMat_HyaCPuOiVMlnqQ":{"text":"NEW ORLEANS, LA \n\nBe prepared to wait for this piece if history to serve you. \n\nIt's BUSY!","useful":0,"cool":0},"egkRufLfL1dzw7QKVB7hEg":{"text":"This place is super cool it is A grocery store/deli's place where you walk in and get the ","useful":0,"cool":0},"sioHAgNLdFE4rSYWgmAW9Q":{"text":"The home of the original muffuletta sandwich! These are delicious. One of our favorite mea","useful":0,"cool":0},"J_uYmry7iiN8q96JPAAgpg":{"text":"Oily. I saw this on goldbelly and wanted to try it while I was in New Orleans because peop","useful":1,"cool":0},"Qmcqi3xZCiFxJ219WB2CfQ":{"text":"Home of the original muffuletta! To be honest, I wasn't really excited to visit a deli in ","useful":6,"cool":6},"apnOgV-mgjTAtHGNFm-lSQ":{"text":"Had to stop for our way out of town on a road trip to get this world famous Muffuletta san","useful":0,"cool":0},"QHBgSSo2eeffeSfYta4uGw":{"text":"After about a 2 hour long flight, swiftly finding a shuttle that can take you to your hote","useful":2,"cool":1},"pYCWioXgmGy5EyzJb0pGRw":{"text":"A must have everytime\nI visit New Orleans! No one does the mufelatta like they do! The bre","useful":0,"cool":0},"9QRcJf2lNtgLA7EATYJltw":{"text":"Central INVENTED the muffaleta.  No one does olive salad better.  Never had one?  Don't as","useful":0,"cool":1},"Y7CyxZKyOZoW20I_wJSNGg":{"text":"When you go to New Orleans, people think that you have to have beignets at that cafe or mu","useful":8,"cool":0},"Y8pbeNm84ZrS8fwDyIIoWQ":{"text":"A great stop on a French Quarter food tour. I always like to try new foods when I am in Ne","useful":0,"cool":0},"tSb5ZD6AzqloIMNxCzVfjA":{"text":"In 2013 the wife and I took our anniversary trip to New Orleans. We saw this place on tv s","useful":1,"cool":0},"G7tWnccxRPeKxR_d2S_h4Q":{"text":"I was lucky that the first Muffuletta I tried also happened to be the best.\n\nFor prepared ","useful":7,"cool":1},"AyGYhqXwjgRlug0gbUshyw":{"text":"Home of the original muffuletta, or so the rumors (and store signs) brag. It's a deli/groc","useful":2,"cool":2},"ZIGRmfh4f8VRsxf-x0pJ-g":{"text":"Comparing the muffaletta at this establishment to the one at Napoleon's, this one definite","useful":0,"cool":0},"_08p0ERIeVilvMu-bWfFKw":{"text":"I know I have to have so many words for my review to be posted. So short story, we met a c","useful":0,"cool":0},"nT5l6DoA8bSJUos-AR00_w":{"text":"Quick and fast service here. I had to try for myself why the muffuletta is so popular. It'","useful":0,"cool":0},"SNJ-LAgoEOm2ukPCaxMu-w":{"text":"I really want to plagiarize Denis S's review:\n\nFor days all I heard and read about were th","useful":2,"cool":0},"kMjHt2W6wTh4HjL-jXkOzg":{"text":"I came here to try the famous muffuletta sandwich and can confirm it's delicious! The sand","useful":0,"cool":0},"3FR7vvIf9apJ4qt-8W1NIQ":{"text":"Wow may be one of the best sandwiches in the country for 20 bucks 2 big dudes can split it","useful":0,"cool":0},"18C3uTqoEjS4XRwn1SfL-Q":{"text":"If you never had an authentic muffuletta this is the place to order one. Delicious! If you","useful":2,"cool":1},"_Z1Ezo6FQDAz7QO0XDgnPw":{"text":"Had to try the Muffuletta, it was cool to try but it is not an amazing sandwich by any str","useful":0,"cool":0},"9u_pwQcdnxhZT2OkO1Hpmw":{"text":"Wow!! 100% delicious. We ordered the large muffuletta to share, a beer and a bottled black","useful":0,"cool":0},"C54RLm2AZE3DTA1UJnqEQQ":{"text":"Doing my backlog of New Orleans reviews. This one doesn't have to be long.  Go here, order","useful":0,"cool":0},"S1iFfsJb32NZ8EjHAomGBw":{"text":"My wife ordered two muffuletta through Goldbely. It cost $109. One sandwich was my lunch f","useful":3,"cool":2},"2DAy4Z4MUs16d7DbDiSFiA":{"text":"Like everyone else says, this is the best place in town for a muff.  I still remember the ","useful":0,"cool":1},"PBfePP4kcUxu70deorfGug":{"text":"Anytime I am in New Orleans will stop by Central Grocery.\n\nThe Muffuletta sandwich is a to","useful":0,"cool":0},"Pe7eHoQ5xXtiltGkwf1qpg":{"text":"When you're craving an original muffuletta, Central Grocery is where it all started. \n\nCen","useful":37,"cool":33},"L4e42JAXpAfO_LKUQUN9UA":{"text":"I have a Muff-alotta love for Central Grocery & Deli!\n\nI try to visit Central Deli when I'","useful":1,"cool":2},"SAYd4icCZETidt9B7VlX9w":{"text":"Nothing special. Muffuletta was okay. Expensive and not worth it.","useful":0,"cool":0},"wrYOSc56yQSAV0LuowvOIQ":{"text":"A definite must eat while in New Orleans! There will be a line, but it moves quickly and t","useful":7,"cool":6},"loNY4C1vazJtXWLMvWCB0g":{"text":"This craggily venerable grocery turned tourist trap is the best of the one-trick ponies. H","useful":8,"cool":4},"5eA0_JR8bQDE2SJ4WL1-NQ":{"text":"Friends of ours had recently been in New Orleans...while there they had muffulettas and ra","useful":0,"cool":0},"xo4p0BI1WiE_FsFZHY_xKQ":{"text":"Stopped in for a mufaletta sandwhich...so stinkin good!","useful":1,"cool":0},"zpwWpno3U-oZaG3AJuKqSQ":{"text":"Ready-made Muffulettas. A half is plenty, believe me. I couldn't even finish that! \n\nThe p","useful":1,"cool":2},"TTWAKRmGiNBqjmSbpN9BCw":{"text":"Oh man - so good!\n\nWe've been here a couple of times now over the years. This is my first ","useful":2,"cool":0},"_lIaMez132ZBevYdKEnw3g":{"text":"Glad we stopped in for one of their famous sandwhiches! I ordered half a regular muffulett","useful":0,"cool":0},"as0gm3uDDwv5q2j8dIci0w":{"text":"The home of the muffuletta sandwich. And it was the BOMB! Definitely worth the trip. Also,","useful":0,"cool":0},"2DFCGdiIBxnsAIHmYo3i1Q":{"text":"Muffuletta.  \n\nI cannot emphasize the importance of getting a muffuletta in New Orleans! A","useful":1,"cool":0},"bxGoi22Rw6ppZqP0UQtFhA":{"text":"Muffaletta. Amazing. So glad we stopped here. Will be ordering the olive salad online.","useful":1,"cool":0},"c7-z8Zbstx1m1UYwaXqnpw":{"text":"We had to stop here because it's just one of those places you have to try in New Orleans. ","useful":1,"cool":1},"IAzY7GxRTN-wG7YAJFHYeg":{"text":"Do you want to make people irrationally, rabidly and violently jealous? Bring a muffuletta","useful":22,"cool":17},"MvIEUfYtDpC0AwXOmI0wqw":{"text":"Put this spot on your 'must visit' list! Cool stuff, great people, and that sandwich... yo","useful":0,"cool":0},"MqoZWHQmmF_rigWPsV6C9w":{"text":"Way too much hype over these muffeletta. Yes, they are good and I love the olive salad.  I","useful":1,"cool":1},"J1lFTzyy2nGTi-GwaXxnWw":{"text":"Hubby has been waxing poetic about the muffulettas from Central Grocery in New Orleans sin","useful":5,"cool":5},"llB3984IyBaulvtUnYdzYA":{"text":"Loved this place. One of my favorites on our week long trip. Wish I had time to grab one f","useful":0,"cool":0},"ijZw6UTG0rYR2ixyfCns2g":{"text":"I came here for the famous Muffuletta Sandwich (5/5!). It was so delicious that I forgot t","useful":2,"cool":0},"NpM76OfxQKlu7RMSy4QxuQ":{"text":"We eat here each time we visit NOLA.  Great muffulattas.  \nUnfortunately on this last visi","useful":0,"cool":0},"ZtsxwJeq1fMsk_1JLbeFRg":{"text":"If you like muffulettas this is the original! So good and splittable for 4. You can see in","useful":0,"cool":0},"AjRg9mHBp00do-5YHNDHjg":{"text":"The Muffuletta. Hefty sandwich for a hefty price. At $22, this sandwich is packed with sal","useful":4,"cool":1},"9mzhCEMedF_IF7cNcnZwpA":{"text":"Great sandwich. Happened to go when lines weren't too long. They premake them anticipating","useful":0,"cool":0},"FI6Xe2R4tSlTgeku5EY06Q":{"text":"The reason why this muffuletta is so good is because of their amazing olive salad and the ","useful":1,"cool":1},"rsneM4AzPQcaT2Z3zSQfaw":{"text":"Went here to buy a Mufalata from what is the original Mufalata grocery store. You can't go","useful":1,"cool":0},"_oKTgAY4M8vi0_rOIXbmVw":{"text":"Had to come in and try the mufaletta being that I'm a sandwich gyal, but I was underwhelme","useful":0,"cool":0},"LFfgsVXsVkqqayZ8PKa6hw":{"text":"Friendly employees and a delicious muffuletta! My husband and I shared a half because if y","useful":0,"cool":0},"h05cQg7YFou6mpM9kOml9g":{"text":"Recently while on a trip to New Orleans one of the folks that I was traveling with highly ","useful":8,"cool":6},"QdRvCVHtQC6NIOFr4xz71g":{"text":"Central Grocery's muffuletta is just so damn good!!! I always end up with a half when visi","useful":5,"cool":4},"AsUSd6MIw6QNTn9IxY6kVg":{"text":"The best muffulettas in New Orleans!! Central Grocery is a small Italian market on Decateu","useful":0,"cool":0},"YvQeDDlMdMwO7pazpQuoGg":{"text":"Simply the ONLY place to procure a muffuletta.  Part of the enjoyment is the old world amb","useful":2,"cool":2},"soPqk10fTU_fxk35AlrYEA":{"text":"Seemed kind of odd to try this \"muffuletta,\" but it was definitely worth it. The flavors a","useful":1,"cool":0},"rZDj9bFAeST91OHPMfb3TQ":{"text":"Trying the original muffuletta sandwich should be on every NOLA bucket list!   Visiting th","useful":0,"cool":0},"D10sa0NM67dhwgDtxjtRUQ":{"text":"My first muffuletta. We had to go to where it was invented, and I'm glad we did. My fiancé","useful":1,"cool":0},"CmmEQvLn48KfivX7vQ02dQ":{"text":"4 visits to New Orleans, 4 visits it took me before I stopped at central grocery and had a","useful":5,"cool":2},"glB25Ibu2WHWhFHBwx9LbQ":{"text":"Super amazing the food is so dope. Everyone had a huge smile and they looked super engaged","useful":0,"cool":0},"2CsyZd1SPriGqI1tcJt9xQ":{"text":"When we visited New Orleans during the pandemic, naturally many places were closed or didn","useful":0,"cool":0},"6nmD7MyzE6SCYaU6OCIDMw":{"text":"This is the best muffuletta sandwich I have ever had in my life. There were a long line fo","useful":1,"cool":1},"ocdh0MmKmIMvYQELcljl5g":{"text":"My first muffuletta sandwich, and I don't know that I would eat one anywhere else. This sa","useful":1,"cool":1},"GvRn0zW7IMKC5O9OwaqQRA":{"text":"Got to the store within an hour of close. It was busy but found a place to sit  quickly. T","useful":0,"cool":0},"rWnZ3sBot-KUjGSxY3f8wQ":{"text":"Muffuletta! Muffuletta! Muffuletta! You can leave NOLA without eating one!! I made that mi","useful":7,"cool":5},"-LDhj0TWoMhaQ6-Q4CSgcQ":{"text":"4 stars for the quality, not 5 because we have modified one essential element for the 30 y","useful":1,"cool":0},"AU5p4EN-Iz7EH4MZ08swtg":{"text":"*****HOME OF THE ORIGINAL MUFFULETTA SANDWICH*****\n\nIn the middle of a day of sightseeing,","useful":2,"cool":1},"oL-YrSxTL8mB2_kAbCKmkw":{"text":"Finally got to try the much celebrated Mufeletta. The old time Italian store/deli had abso","useful":1,"cool":0},"j4VDfJbnLRp-RfJmYmy_jQ":{"text":"Definitely the best Muffuletta in the world...no joke.  A must every time we are in New Or","useful":0,"cool":0},"9dJbTeVc0jkUT71ctWl1lw":{"text":"It's been around forever and the grocery portion of the place is really impressive; so man","useful":2,"cool":3},"aCXtm2oQuu9w7M7ZYESvbQ":{"text":"Stumbled by this place during my visit to NOLA. The muffuletta sandwich is delicious. The ","useful":0,"cool":0},"n1bkILdakdafGDsp2rq63Q":{"text":"Very average (but VERY pricey) tasting muffalata IMHO. Served pre-made and almost cold (I ","useful":1,"cool":0},"9FnROwvP2a3owz7qeoGq4A":{"text":"Don't care what anybody says, this is the best muffaletta around.  The bread and olive sal","useful":1,"cool":0},"ZYT_Nm4z2ADKeMd_2z7wdA":{"text":"I'm sure the locals will say this is not the best Muffaletta in town, BUT it is the origin","useful":1,"cool":1},"8m6DF7iwkZkrCZWWxqhg5w":{"text":"I realized that I haven't ever reviewed Central Grocery before, as I went to update my rev","useful":0,"cool":0},"cVdpBF9QoVoVPEPrbUteQA":{"text":"I've never heard of a muffuletta sandwich but I was told this was another must while in Ne","useful":0,"cool":0},"LN2JA0mFd10rgGLOWBD41g":{"text":"I'm going to take this review a little bit of a different direction. Blah blah blah mufful","useful":1,"cool":1},"s5XD_zKPDZ7hfiTW8Ij_EA":{"text":"You'll find a line.  But it moves pretty quickly.  There's lots to see, all kinds of Itali","useful":1,"cool":0},"RPGZKMzeBiQbI95MXFzP2g":{"text":"Have been going to Central Grocery for over 25 years to get muffulettas. A recent trip to ","useful":1,"cool":0},"1NT6Pepk5HL8ipjrG5qQnA":{"text":"One of my all time favorite places to go in NOLA. I go every-time I visit and it's always ","useful":0,"cool":0},"L2J9G4UVGr1_EGUpMuz5AA":{"text":"This place was not on the must eat list of places to eat while visiting until a family mem","useful":0,"cool":0},"4wYQlxyUnDV2OC40hpIjcg":{"text":"Just as great as I remembered. Hasn't changed in 20+ years.  Don't let your eyes fool you.","useful":0,"cool":0},"bkLZZYE1AaYn_5ZJODom-Q":{"text":"It's so easy to get a delicious Mufaletta here. Just walk in and choose big or very big. A","useful":0,"cool":0},"6M0oo4pgMJG9ZMGOfDLOZw":{"text":"This is in a little Italian market towards the end of Decatur..keep going til you find it.","useful":2,"cool":1},"eLBPaYabGzwwtpuSQi_0Uw":{"text":"If you crave a Muffuletta Italian Sandwich, there is NO better spot to try an original, fr","useful":4,"cool":4},"Czudx6oLuRmLABBsJJysJA":{"text":"Oh, that sandwich. \nI'm still dreaming about it. \nThere's not much I can say about it othe","useful":3,"cool":0},"D-Ste8Ia9wP-Fyy1Pyo0YQ":{"text":"I am not a fan of sandwiches of cold meats but this muffuletta might just change me. The b","useful":0,"cool":0},"LlesPE9bfCo9pJdi7UNnZQ":{"text":"Ahmazzzing muffuletta comes from this Italian deli! Think old school grocery store with a ","useful":0,"cool":0},"9FNUOUWDvBQ03NMdNZziFg":{"text":"Our first muffaletta. I was expecting to be wowed but all It did was remind me of the cold","useful":0,"cool":0},"AXXXuasHk0y1__DO_s3Ubw":{"text":"I stopped her to get some chips on my way to a recommended muffuletta spot. The place I wa","useful":0,"cool":0},"5f3_xwvXoF2C0f2lcbOewg":{"text":"Think unfortunately there is a little resting on the laurels of their popularity. This is ","useful":1,"cool":0},"LMfdlySqaz7gHhJH7iL5Lg":{"text":"Obviously you go here for the muffuletta and it's the best one you will ever have. It's hu","useful":0,"cool":0},"ACvG40RX5X3M08icGAIDrw":{"text":"One word... MUFFULETTA! The line zig zags through the store and sometimes out onto the sid","useful":3,"cool":3},"XvuyBUdu-vAyObY1A2uXmw":{"text":"Plain and simple, the muffuletta at Central Grocery needs to be part of your NOLA bucket l","useful":7,"cool":3},"JTrqUjCpYVzpyNVzpEKl7Q":{"text":"Amazing in New Orleans.  I have just ordered online and disgusted to know rlthey are doubl","useful":0,"cool":0},"kx-_1spP03XmtlrFg-13ZA":{"text":"Ok this place was highly recommend for the best muffaletta from a friend that lived in the","useful":1,"cool":1},"iBNwg56YCHL0MXVKiAaybg":{"text":"WOW. Central Grocery was on my list of places to stop at during my first trip to New Orlea","useful":1,"cool":0},"5m0OVTCnG059SRzxZhK61w":{"text":"Ok so I hate olives just despise the taste but I wanted to give these Muffelettas a try si","useful":6,"cool":5},"4kXtBplBoK-ZFezeINLdqg":{"text":"I have  eaten at the Central Grocery since I first arrived in New Orleans as a college stu","useful":0,"cool":0},"UikxlXiMDqsyd3atT0-Ywg":{"text":"A small local grocery where you can get the original authentic New Orleans muffaletta.  If","useful":7,"cool":7},"KglzvFkPXEHYYb6FoMefng":{"text":"While in New Orleans, we felt obligated to have the original Muffuletta from Central Groce","useful":8,"cool":6},"kGB_wbqEv7daqytenrzP_A":{"text":"So, so........This shop is really popular！！！\nBut, It's so so.........\nAnyway, you should t","useful":0,"cool":0},"FDVFw-uGaBzgEcEVdSBs8w":{"text":"Great sandwich.  Was on our list of places to eat when in town and it didn't disappoint.\n\n","useful":2,"cool":0},"OnhS44kGNmz94x8RxE_4Sw":{"text":"The original muffuletta! So Delicious (that olive salad) is making me want to make this sa","useful":1,"cool":1},"SMC4U4l0lHsgJvfFuY0ErQ":{"text":"Oh my gooooood God these Muffalettas are to die for! Delicious and fresh. I couldn't belie","useful":0,"cool":0},"W-E2un_b1qx1mYaWvhgAZg":{"text":"Muffuletta, check. Zapps, check. Restocking my giant can of Tony's, check. Review #69, che","useful":1,"cool":1},"tAeqTOnMzFrheHVuHTE-Ag":{"text":"I like their efficiency. One side in and one side out. They basically have only one item o","useful":2,"cool":6},"ktoBKzKZ9fPcx8uJ5ZS3bg":{"text":"The muffuletta sandwich is fantastic & HUGE! My husband and ordered the whole sandwich cut","useful":0,"cool":0},"eOg75BvSxqNYn4AAivg-LA":{"text":"Great muffuletta and really worth the wait! Didn't get a chance to eat it in the store, bu","useful":1,"cool":0},"Bvua037r3FZYSsijWO2ZVg":{"text":"It's about the muffaleta sandwich.  10 inch round loaf with deli meat, cheese, olive oil r","useful":3,"cool":0},"u5YLCQyaG3FAq9z3t2--_Q":{"text":"This is the birthplace of that most esteemed sandwich - the muffaletta. It was worth the t","useful":0,"cool":0},"VBI_1ajRooRpyG-ccH-g5Q":{"text":"Yes, the famous muffuletta sandwich is good, but it feels like such a tourist trap. The sa","useful":0,"cool":0},"O9T4b602IZchNJ_kd8jlUA":{"text":"A must visit when in NOLA authentic all the way from food, to the atmosphere and the peopl","useful":0,"cool":0},"v0CWreGGCjc5EI7ZWcV_EQ":{"text":"Came here for the original Muffuletta. I'm not the biggest fan when it comes to olives but","useful":2,"cool":0},"Po1b68ZsDlf4e9wRKZjMKw":{"text":"I was visiting NOLA and heard about this sandwich spot.\n\nFirst i would like to say that i ","useful":0,"cool":0},"sAK9dEyZh3-ExcSnF9LZWw":{"text":"When you do something right, why mess with it.  That seems to be the motto of Central Groc","useful":4,"cool":2},"2UtDnfkds8rTB2a3XRQBQQ":{"text":"Great spot. Phenomenal Muffuletta. Impeccable service. Has a great family run business fee","useful":0,"cool":0},"GxzNHy_PBv9f4fax2r-TUQ":{"text":"Went during a business trip a while ago based on the trustworthy advice of a co-worker tha","useful":2,"cool":1},"birskFVmh8sX4yXTlOxmBg":{"text":"You wouldn't think that in the middle of the culinary paradise such as New Orleans a sandw","useful":1,"cool":0},"IV7n-j-xdJj0-eRomImIig":{"text":"NO LOCALS EAT HERE: of 500+ Yelp reviews most locals rate it 2 stars or less.  Every time ","useful":24,"cool":0},"Ft9OjQc5kQ2djOPcOCDclw":{"text":"Perfect Muffuletta.  So good.\n\nTry this - buy a sandwich and leave it out, un-refrigerated","useful":1,"cool":1},"uzNB9EZjsYPdaQLHlA8a2A":{"text":"Central Grocery is an interesting place in the touristy part of the French Quarter. Its a ","useful":2,"cool":1},"vaSuxc3vjcyfCt7Q3g7xlQ":{"text":"Order the whole sandwich.\n\nEat half ASAP.\n\nIf the other half survives the rest of the day,","useful":1,"cool":0},"FpaJ4shIc2jQrTHonTohPw":{"text":"So..I tried muffuletta a few weeks ago at a house party and loved it. I figured I would go","useful":2,"cool":1},"E6Y503D5xxUcY8mrdn-6Cw":{"text":"The muffuletta is a good sandwich. Definitely on the salty side because it has several sal","useful":6,"cool":8},"lOOLoTBfbKkoqOTyPcFDjA":{"text":"Muffuletta Sandwich is great if you like olives. Even though, i am not the biggest fan of ","useful":0,"cool":0},"F3wDS4S0BCX9uNNEMnvbDA":{"text":"The absolute best sandwich I have ever eaten! And if you hate that you can't get them when","useful":0,"cool":1},"FcllroMHjZUGxlT_ncuOvw":{"text":"Ordered the muffuletta through a delivery service, and it was perfect. Side by side with a","useful":0,"cool":0},"rnPlWw0rXxeN0RzDgMI78Q":{"text":"First visit to New Orleans for my wife and I, and this was our first stop of the week. Wan","useful":1,"cool":2},"mhy22jTNDVZt5kw8KKTZ1w":{"text":"Get your Camilla rice and a world-class muffaletta here! The lines can be kind of long, bu","useful":1,"cool":1},"02xidqewIsZJ5rQLYpDXPQ":{"text":"The ONLY place to get a muffuletta!!!  Don't even waste your time getting one from somewhe","useful":0,"cool":0},"StLZbqFZSWE_eEY79HFB4Q":{"text":"We arrived right before closing. Purchased a 1/2 muffuletta sandwich to share. We had a pi","useful":0,"cool":1},"d2IapEfN6LtK8UhaTayjwQ":{"text":"Home of the OG Muffaletta... do yourself a huge favor and do go anywhere else for this mas","useful":3,"cool":1},"jnn3KH3t4B2w6hMatpoGRQ":{"text":"Be prepared to wait in line for the original muffuletta and then to order quickly when you","useful":2,"cool":0},"9KKe4z2qPICs8zN4Ct1Dtg":{"text":"Do you want a muffaletta? If you're serious about your muffaletta, you have to visit Centr","useful":2,"cool":3},"CXAQyWeeWboKxt_ShbFR_A":{"text":"If you like salty sandwiches you must shuffle over to Central Grocery for a muffuletta. Do","useful":11,"cool":8},"o5X80YRpF-z7whvH12PFeA":{"text":"I feel like this place running out of sandwiches may have saved us from being sick. Things","useful":0,"cool":0},"4CdduQ-3LQZiwYT43e_DNA":{"text":"This is one big sandwich. We split one between four people and it left us full for hours. ","useful":3,"cool":1},"jIIvB9L3MHvmeelmJBv1Tw":{"text":"Finally got the chance to try the real deal muffuletta from the source. \nIt was just as go","useful":2,"cool":1},"zNTJRzCKYLUVJle4UcifFg":{"text":"Meh~ It's an institution. \nMuffuletta was solid but the mix included cauliflower, some see","useful":4,"cool":3},"3DKV3g_weL20poPb3gXLTA":{"text":"I have always been on the search for a muffuletta since I had one on our trip to Disney wo","useful":0,"cool":0},"YXwO_Xcjt20uh_dKsTyo1Q":{"text":"What can I say about Central Grocery that hasn't already been said?!  The muffulettas are ","useful":1,"cool":1},"aDgbtC93Vv3oKhLPK6JQYw":{"text":"The best sandwich ever!  Everything about it so good! The sesame seed studded bread, olive","useful":1,"cool":0},"yfk_REEDoPAB6-o7BTntcQ":{"text":"Central Grocery invented the muffuletta.  Their olive salad and their bread make it so del","useful":7,"cool":1},"-tY-Yx-LGUcly_S-SN_rUg":{"text":"Was given the advice to check this place out for an authentic, delicious, muffuletta and w","useful":3,"cool":1},"R6ySMeUe4ziVzD0BrWSdMw":{"text":"Well over due for a review.... I visited Central Grocery & Deli last month. It's a surpris","useful":2,"cool":2},"oBmlgAcnJR8Q9yS_nNkg3g":{"text":"The muffuletta was really good! It reminded me of a charcuterie board on bread! There was ","useful":0,"cool":0},"5Pc-iAGKuLDKaZSi6sfKBQ":{"text":"Definitely one of the best muffalettas that you will find!  Expect to wait if you're late.","useful":1,"cool":0},"FKe3BudeuuMa-dxPYk2_TA":{"text":"Still dreaming about the muffuletta. Can't wait to go back. Fast lines and no bs, so know ","useful":0,"cool":0},"Xzx5eXl6JrHuuhooXA17Zg":{"text":"A friend recommended I go here for their muffuletta, as this is the place that invented th","useful":0,"cool":0},"ouHlx4r2u6puIuhGO2HSLw":{"text":"Oh my god I will miss your muffaletta!! We liked it so much we bought one and flew it home","useful":0,"cool":0},"y9NK6YpJXZP_HNrNTqXP1Q":{"text":"As a speciality grocery store you can pick up Italian goods along with Louisiana/New Orlea","useful":3,"cool":3},"52rLC3cVWOdu7ygu5hL8gA":{"text":"During a recent trip to New Orleans, a friend had insisted that we stop at Central Grocery","useful":2,"cool":1},"bb5Dl_zMHcfT3kRp9dHyTA":{"text":"There was a line here, but it moved quickly.\nAll we wanted was a muffuletta that we could\n","useful":0,"cool":0},"Rk0IjwsEKyzMJP6rt1XD4g":{"text":"The Muffuletta, the legendary sandwich invented at CG:\n\n1  round loaf Italian bread with s","useful":15,"cool":17},"4u8pFjcAFCX5-maaFJfrjA":{"text":"HUGE sandwiches! No joke! We split half a sandwich and could barely finish it. This thing ","useful":50,"cool":49},"Mnf6O0kByPZSVf2rbWQXBw":{"text":"Home of the original Muffeleta apparently. Honestly it just tastes like Italian cold cuts ","useful":0,"cool":0},"zaZsN5Tae9QMYZgDDLgt-A":{"text":"Amazing Muffaletta!  Already went back for another and plan on taking one on the plane!","useful":1,"cool":1},"osq3r5VHNO6bZD0BnhKvTQ":{"text":"Home of the original muffuletta? Lets check this bad boy out for some sammies on the plane","useful":12,"cool":5},"3_ZhIjDEeyRmQqxlTNSv_g":{"text":"This place is an institution and must visit in New Orleans. I don't know how they can take","useful":0,"cool":2},"vTxuArZKwk0pgkd-gBMMQQ":{"text":"WA WA WA\nThe muffuletta was a big let down for me. \n\nAfter years of seeing this place on f","useful":4,"cool":0},"FGUr0YSMWF7KEusl6Ny1BA":{"text":"GREAT PLACE ! My wife and I have been to New Orleans a few times....we love the vibe ! We ","useful":25,"cool":30},"YyLF8ZFvk3MvrQ1CzPOj_A":{"text":"The muffuletta really might be the best sandwich ever.  My husband, who generally avoids b","useful":2,"cool":1},"q3tW2x9_P6N0gkZiF59uyQ":{"text":"I stopped by with my three friends during our girls trip for their famous muffuletta sandw","useful":0,"cool":0},"vNhej5iaoIqCxpuRmrjcHg":{"text":"I don't normally care for olives but this sandwich is so good! A perfect mix of bread, mea","useful":0,"cool":0},"eIzzb8Pd1BToRh9FuOED5Q":{"text":"Really cool place , old school grocery ,home of the original muffuletta. One of a kind the","useful":1,"cool":1},"ftgJCXIcMaiaUu7bh6UqSg":{"text":"Upon recommendation I had to make my journey to this grocery store for the original Mufful","useful":0,"cool":1},"q9Oi39kA8JKl5ZZNFFonfw":{"text":"Had to try their famous muffuletta. I liked the meats that they use and the bread was ok t","useful":0,"cool":1},"dSQgZO116oytY_5SZpCo9w":{"text":"Quite possibly the worlds most perfect sandwich. This was one of the few all about me stop","useful":15,"cool":11},"wufdBOVO6o3X3OXisuzjSg":{"text":"Just because you invented it, doesn't mean it's the best.\nExamples:\nThe first wheel\nRocky ","useful":7,"cool":4},"SIDFX0SZeo7bi2SU5CPEWA":{"text":"This small grocery store in the french quarter of NO is famous for their huge muffelatta s","useful":1,"cool":1},"E85veVZRgaj1qPMUqtMgnQ":{"text":"A quaint little grocery store located on Decatur. We came here for their claim to fame as ","useful":1,"cool":3},"oIVl3ObYkw4EgL66XJkDMw":{"text":"I'm not gonna lie - I would have NEVER gone into Central Grocery in search of the best muf","useful":5,"cool":2},"tTvqJ2NkHxlSFV7IkecZgg":{"text":"As a former resident of New Orleans, the Central Grocery's Muffaletta was a MUST have more","useful":0,"cool":0},"J2J1HoKs7utHetHLrUSGuw":{"text":"My bad for not writing this when it was fresh on my palate, when at the time it was mind b","useful":0,"cool":0},"Jd4nMV9YTGpbaNgOkN29Lw":{"text":"Wanted to be sure to get another muffuletta for the flight back but due to timing and the ","useful":2,"cool":1},"ha_UFcxqN7zFwOr5gb38Uw":{"text":"Muffulettas should be their own food group. Probably a million calories worth of salami, m","useful":0,"cool":0},"SMrb2UAGrUwT6Yrr8MfiiA":{"text":"Can we get together a GoFundMe to help them get back? Passing this historic place seeing i","useful":2,"cool":2},"S8hEog3FUmuuHmkU0MR1cg":{"text":"Believe the hype. These are amazing sandwiches. \n\nWalking down the street, I found myself ","useful":1,"cool":0},"LOI4ecpUzSiRPiLiymH6BQ":{"text":"Read and heard about these sandwiches... looked at several different options, restaurants.","useful":1,"cool":1},"tir_88F1gAqyoijhCL6fkQ":{"text":"You must stop by Central Grocery, home of the original muffuletta, when you're in NOLA. Gr","useful":3,"cool":3},"w_QBwuXjMXDAABppq6g4Xw":{"text":"This is a must stop whenever I am in the French Quarter. If you're looking for a fantastic","useful":5,"cool":2},"OttzeBDSYbErreF0zJszpA":{"text":"There are two must-do's for any N'awlins newbie. One is getting the beignets at Cafe du Mo","useful":12,"cool":9},"Ltnsv0GquhyPTpzSpzVfPw":{"text":"It's just an Italian sub with olive salad for $20. It was good but not great. The bread wa","useful":0,"cool":0},"N8Z29z7KYPBm7-pgTH03aQ":{"text":"Central Grocery is located in the French Quarter and is home of the muffuletta sandwich. \n","useful":7,"cool":4},"pfiQtvjueVJWWonIfMnNaQ":{"text":"Best mufalatta  hands down. My second time going here and it hasn't disappointed either ti","useful":0,"cool":0},"f7rOq5OvWIkHA3SqHt634Q":{"text":"central grocery  basic invented the Muffuletta but also faced the issue of the south when ","useful":0,"cool":0},"mUJI0CirIn8Vm4cZ5KBkLw":{"text":"I loved the muffaletta  we had here! It would be five stars but we had to wait for about h","useful":0,"cool":0},"xdgx32z0VmBJvyWTsr79HQ":{"text":"After seeing Central Grocery on many food network ch shows I knew I had to come try their ","useful":1,"cool":0},"L708B7uoaI_s-wyOCNevpQ":{"text":"Just found my pics of this place and realized I didn't review, boo!\n\nThis is a crazy deli,","useful":5,"cool":3},"-A_z4jwP9jbgBTIVQxMN-Q":{"text":"This is the shop that contains The Holy Grail of Muffulettas. .(from a visitors knowledge)","useful":2,"cool":0},"sRubIj-XtGUJlfRra6RTPg":{"text":"I came here especially to order a Muffaleta sandwich, based on Yelp reviews. To be honest,","useful":3,"cool":0},"G9MclRuKzE3Q9vS4Yq7UoA":{"text":"With my only muffuletta sandwich experience in New Orleans previously being at Serio's, I'","useful":4,"cool":4},"vzRS1i9mFK5AAY9B7R6giA":{"text":"Love this place!  The fresh muffuletta are to die for!  Always as usual great friendly ser","useful":0,"cool":0},"B0iRdLeWH8WsKEYpxCI6Hg":{"text":"One of my biggest regrets about my New Orleans trip was not getting to eat a muffuletta sa","useful":2,"cool":1},"FSu7EPX6-IAghAZPUdOnjA":{"text":"Home of the Original Muffuletta.\n\nThis is one of those places you should visit before leav","useful":61,"cool":54},"v5diVqNj-LLIK6AfOSwJnA":{"text":"I've had sandwiches before that claimed to be muffulettas but none of them have even come ","useful":0,"cool":0},"cwW-esGJHIKLz2Pq7dIxtA":{"text":"A must for your trip to NOLA.   Their muffuletta is a New Orleans tradition, invented here","useful":0,"cool":0},"MegRQtlXCe5A5ZdMbyDV5Q":{"text":"There's really not much choice if you want a decent muffuletta, so yeah, they are still he","useful":0,"cool":0},"K0M7xelpZIUHaDIhtmguLQ":{"text":"There are few foods I would consider paying someone to smuggle across state lines for me. ","useful":8,"cool":6},"dOi5Ml4llxz3p0V5CyGZoQ":{"text":"Oooooooh, an unexpected pleasure! \nSometimes, you expect kind of a \"touristy\" thing to not","useful":0,"cool":0},"pLTXrbun7AQ_RDQgNKRpbw":{"text":"Mecca found...the birth place of the muffuletta. This is what I live for. Best sandwich in","useful":2,"cool":4},"bW8LkurZHhROdKGCbKBJGQ":{"text":"Don't know how long the sandwich was sitting on the counter,  but I do know my entire trip","useful":3,"cool":0},"E4TssZmFRDqnFD3mbe6mHQ":{"text":"The original muffuletta is still great. Italian cold cuts, provolone, green olive spread a","useful":0,"cool":1},"T_7WcSnI8ifCIfC9ctD0Gw":{"text":"MUFFULETTA!!! \n\nMy friends and I got the full for $18. This thing is huge! We had 6 people","useful":0,"cool":2},"8EaL4aFR_aSr9rAtun2n0A":{"text":"The best. Of course it's home of the muffuletta. Usually a long line & limited seating. I ","useful":1,"cool":2},"3MGXpiyw0wdLXUSf1mPwAQ":{"text":"Ate here twice in 5 days.  Quick and good.  Quality ingredients.  Consistently made.  The ","useful":0,"cool":0},"-l2Cq_B3ttG95pVW6FJ5Yw":{"text":"Finally tried the Worlds Famous Muffuletta. It didn't disappoint either. I'll grab one on ","useful":1,"cool":0},"ogumVkvKhn9lcO0jzcoItg":{"text":"Central Grocery is home to the Muffaletta sandwich... a salty, cold cut sandwich with an o","useful":2,"cool":0},"U6wYm4Msk96ICP_Y7l2BWQ":{"text":"If you go to New Orleans, you must eat certain things, among which are their red beans and","useful":4,"cool":4},"dc35s4QaQw6kwrRQfHynpQ":{"text":"Grab a half of a muffuletta, a friend, a bottle of wine a go eat by the river. Pick up som","useful":0,"cool":0},"tQB1I_x53mk5xTl0ENMv1g":{"text":"This was a treat and the Muffaletta was outstanding! I'll be back every time I'm in town.","useful":0,"cool":1},"eLdkjtKU1lbQqaXy5Dupvw":{"text":"First time eating muffaletta here..  I liked it better then ones I had back home at local ","useful":0,"cool":0},"hdika_kRnt2EQ6CI_m4lGQ":{"text":"Totally worth the hype and I don't typically go for Italian style sandwiches and I don't l","useful":1,"cool":1},"tKra_5ntWnWRbhUGqmmKhg":{"text":"OMG, I miss NY so much-this place right here-Muffalatta. WOWWe even take them on the way h","useful":0,"cool":0},"i_j19pu2kDEyE-SkDDPAwg":{"text":"Went here to get the original Muffuletta and it did not disappoint! Sandwich is fantastic ","useful":1,"cool":1},"NSgTSfDgP6yO9NLCzmsQMQ":{"text":"New Orleans gem!!!Muffuletta sandwich!! I ordered half of a sandwich because they are mass","useful":1,"cool":0},"wpDodF9vRrPapxulyRwVhw":{"text":"Central Grocery is crowd worthy good and does a great job selling to the masses. \n\nBut, it","useful":8,"cool":5},"xfK5astarPytFEoPyl9YIA":{"text":"The original is still the best!!!  I've been coming to Central Grocery for 50 years. The B","useful":0,"cool":0},"4NsNJLMp097ppTVI6yuJFA":{"text":"One word for why you need to go here... muffuletta!  it's the most amazing sandwich creati","useful":3,"cool":1},"bVQ5lm64kk_ICJBGqhYCww":{"text":"The hype is worth it - The muffuletta is awesome, the saltiness of the cheese and meats pa","useful":0,"cool":0},"rQxncAhK9kXWx1MFxrgHlg":{"text":"What can I say about the famous muffuletta?! Savory, filling, zesty, meaty, yes, all of th","useful":1,"cool":1},"2cj3E41vrzKe0q8eHtkcWg":{"text":"YUM. love the grocery options, lots of pretty olives, sardines, and other imported Italian","useful":0,"cool":0},"RaOXtkLEmircrVdb2IDuXA":{"text":"Central Grocery claims they originated the muffuletta and they have been doing well ever s","useful":10,"cool":2},"7wTqvETUT-yFcAvG8BmBFg":{"text":"I'm at Central Grocery often. Well, at least when I'm in town. I have an apartment on Char","useful":2,"cool":1},"XxJJmgtoc1x8kqybxAYKSQ":{"text":"The best place to get the Muffuletta hands down!  \n\nThis is a must stop for me every time ","useful":31,"cool":29},"nwgXW_baN7l5_pdcDrzALA":{"text":"The Muffaletta was quite possibly the best sandwich I've ever had, and that's saying a lot","useful":1,"cool":1},"34ZcMmXxm7A9n_ubXePSHQ":{"text":"The store was packed but we were still served in a timely fashion. Service was great and t","useful":0,"cool":0},"keaba7UsZvf2XR1gRfF5zg":{"text":"When in NOLA...get a muffuletta!! \n\nThis place is right in the heart of the French Quarter","useful":1,"cool":0},"-l4F9MmJutgV_JnV7MMOHQ":{"text":"This is just a great place to get a great poboy. The bread is fresh and New Orleans style ","useful":0,"cool":0},"VZrt3MhG9vH2bp6o3zBrpQ":{"text":"As other reviewers have mentioned this is the best place to try a traditional muffuletta. ","useful":2,"cool":1},"8ybsofgS6RGiCpsgY_C5OQ":{"text":"We had to try the muffuletta. The best part is the olive spread, but there wasn't enough s","useful":1,"cool":1},"SDrYujRawYrHNLx8sniOfA":{"text":"The Muffeletta sandwich was high on my list of foods to try in NOLA. I missed the opportun","useful":4,"cool":6},"9u4pz-jmYKsopUCrDcS3Vg":{"text":"I didn't get a picture of the muffuletta, but we got their famous muffuletta and it was HU","useful":0,"cool":1},"2AXuo86j_yt5gpYo85al9A":{"text":"It's been over 15 years since I last visited NOLA and started my muffaletta obsession. Nee","useful":2,"cool":0},"GfCFQZm7rYrkXQc2u7Kizw":{"text":"This is it! This is definitely the spot for muffalletos. We researched it. We got feedback","useful":18,"cool":16},"lXaF66N5VHNzmYzVOXOb4A":{"text":"Given all the rave this place gets, I knew I had to check out Central Grocery when I swung","useful":1,"cool":0},"xIJzmq1Z72AN1XYpO7cMdg":{"text":"Best muffuletta around.. LOVE the olive salad.. my mouth is watering just thinking about i","useful":0,"cool":0},"Xyse0LPsBDKpnJFtk1_fIA":{"text":"The best Muffuletta Sandwich I have ever had and will look forwarding their reopening.","useful":0,"cool":0},"iDQubLokvLq4IAXtgIyl4Q":{"text":"Four stars and cheers for the sandwiches and for the stock employee that opened all of our","useful":8,"cool":4},"6cp0rVTEc0z4BQx5bugjHA":{"text":"Awesome just Awesome can't wait to go back and enjoy. The olive spread was to die for. Sta","useful":0,"cool":0},"1Xftvha9WrRIjzQ4Jx4-Aw":{"text":"Home of the original Muffuletta! But on our previous trip to New Orleans, the girlfriend &","useful":8,"cool":7},"yoMjC4m22e49VoZm0ZhK9w":{"text":"There is something special about Central Grocery muffulettas.  I can't quite put my finger","useful":0,"cool":2},"6pu9HkDz9sNo1EnF64Giaw":{"text":"All you need to answer is half or whole. I only got a half and devoured every single bite.","useful":0,"cool":0},"M7stbyD4VlfdbAaq7GOqyQ":{"text":"We stopped in to get a sandwich to go. Super cute little market and hands down, the best m","useful":1,"cool":1},"LrksKg0EKY2f9ZVV_aCUdA":{"text":"To each his own--while I'm curious how anyone who isn't a vegetarian can give Central Groc","useful":3,"cool":2},"ILKzSB28HW3M-3R-bJcVGQ":{"text":"BLUF:  fantastic muffuletta. I'd bring people here. \n\nServed cold/room temperature. Fun sh","useful":0,"cool":1},"JCashU7pLH57VTcuZJ0o_Q":{"text":"Made a stop at this well known store to try their famous muffuletta. Half the store is the","useful":0,"cool":0},"frofVsOD1SWXRpYi3DvdzA":{"text":"Some things in life are worth waiting for - the right soulmate, the right career opportuni","useful":2,"cool":2},"M_Rr7cSOq6LUp-uCwEeWsA":{"text":"Muffelletas are a very unique type of sandwich which aren't often easily found. Central Gr","useful":1,"cool":1},"Y_rB81xGh6JrhpIeOanI0Q":{"text":"We are headed to the Crescent City this weekend and I have spent at least an hour a day th","useful":2,"cool":1},"empnn1JDmY6U323FjZ3lzA":{"text":"They know what they're doing with their muffulettas! Went back multiple times. They also s","useful":1,"cool":1},"Xy__-EAsGgMiEVvXxOrWUg":{"text":"Awesome Italian food store where you can get some of the best imported products from Italy","useful":0,"cool":0},"28hYxKfuAmxOSji3lt_t5Q":{"text":"Over rated, costly!!!!!Very disappointed!!! Bought the olive salad to go boxed and bubble ","useful":0,"cool":0},"kYNnvjfOfu7llR5_7WNGjw":{"text":"Muffuletta: Huge seeded roll, meat, olive salad, and lotsa olive oil.\n\nIt's cut into quart","useful":5,"cool":2},"f3XCY4-YYrWFU9WZzNgrBw":{"text":"If you've never been to New Orleans, you haven't really had a Muffuletta. I tried it a cou","useful":1,"cool":0},"ZTPHDpa-cG-LCkx7tMUP4A":{"text":"The Central Grocery Co. is a really cool deli.  Now I'm not gonna make any claims on who r","useful":0,"cool":0},"qDOtX1CrN1H8GXt-S7jMSg":{"text":"Are people that gullible? $22 for a couple of ounces of cold cuts in a piece of bread? Alm","useful":0,"cool":0},"653B3UuJ0CRPlmIsLmembA":{"text":"Every large city has a number of must visit places, many are tourist traps (some considere","useful":3,"cool":0},"KFr-Z6YpspUgtEm_w-TfNQ":{"text":"Home of the muffuletta sandwich Central Grocery has been a New Orleans staple since 1906.\n","useful":12,"cool":10},"IQouP0zCdeDr9BZf7kee-g":{"text":"First time here!\n\nResearched things to try in NOLA and this one definitely piqued my inter","useful":3,"cool":2},"GhhC0Sm52E9TQeCw6AoLqw":{"text":"This is an Italian grocery store known for the muffulatta, a sandwich with meats, cheeses,","useful":0,"cool":0},"eJ1pYdUacURISjvNm2K8KA":{"text":"Eh. Maybe because I'm not a muffaletta fan, but I was assured this was different than your","useful":0,"cool":1},"K2YvZzGs1oEeMYuA6i1oCQ":{"text":"This place is a \"must visit\" every time we're in NOLA.  Muffalettas are GREAT, as everyone","useful":1,"cool":0},"UvhM09m0zZmJ-lgewddKRg":{"text":"If you love muffulettas or have never tried one before, this place is a must visit! We wer","useful":1,"cool":1},"7BrJSurkN-7_vjbA-W5WSw":{"text":"Closed for construction and didn't notify Yelp or google - bad business - just walked 15 m","useful":1,"cool":0},"FHotde9a-yvsmGCJah5-dw":{"text":"Stopped by for some of the original muffuletta at this classic spot!! It's not just the ta","useful":3,"cool":2},"qQB1PWMbzmCcqjNv8NWUyg":{"text":"Nice deli/market. Fun touristy spot but I don't think you HAVE to get their famous muffule","useful":2,"cool":1},"1a_oJKcjA7S5VIcWqqTcAg":{"text":"Imitated by many, duplicated by none - this slogan can be found on the jar of the olive sp","useful":1,"cool":1},"k7pttRXqqxF6zx1jCkCJzA":{"text":"Definitely worth it luckily for us we got there around 1130 and there wasn't a long line y","useful":0,"cool":0},"P04yqRCsGgOwNjHcgL02oA":{"text":"First time eating a muffuletta sandwich so I really don't know how to rate it or compare i","useful":0,"cool":1},"d-TpmGs1tt9ZM6VisWR_Xg":{"text":"So much character.  Muffulettas are awesome, but how about the dried fish hanging from the","useful":0,"cool":0},"YAlvwTHgOW615gaF6Hbz-Q":{"text":"We stumbled into this place by accident when we were strolling down Decatur and saw Mufful","useful":1,"cool":0},"NvA5Wf478o5yTZUUDTHkqA":{"text":"What can I say that hasn't already been said? I loved that the sandwiches are premade so y","useful":0,"cool":1},"oRzr-tRo3WZMxtvsLa_V_Q":{"text":"This was highly rated on the different food channels, as well as in all the tourist books.","useful":19,"cool":16},"3Uko59xTbL_VXUrvBvd7zg":{"text":"If you're in New Orleans (especially the French Quarter), it's likely you're not thinking ","useful":5,"cool":2},"aYQ5SIJqd5MSzY7L8yn7fg":{"text":"So knowing i had a pit stop in NOLA on my way home, i knew i had to stop here to get an or","useful":0,"cool":0},"csfgupGIyBKCAbN7y6mtpQ":{"text":"ZOMG. This was probably one of the best sandwiches I've ever had.  I typically avoid olive","useful":2,"cool":0},"KC5l-dEAE3T8sS8fnrmQuA":{"text":"had this place on the my bucket list and I'm so pleased I got THE ORIGINAL MUFFULETTA. The","useful":0,"cool":0},"HJi-75NmA8YMhBi4jsJ3fw":{"text":"I came here just for the famous original muffuletta and it was definitely worth it! We wen","useful":1,"cool":0},"ptRa6mpOAytF79vywZ13tQ":{"text":"Interesting. Someone in Lafayette recommended this place and told us we must go. It is a m","useful":1,"cool":0},"D7Red6UzcTjgfJcCRpBU_w":{"text":"Ok so we walked here after having the conchon butcher muffuletta. \n\nWhen we walked in, it ","useful":1,"cool":0},"0x6smOYlkOQsHN8wAgZyqg":{"text":"We stopped in for one of their famous muffulettas! Glad we did, it was really good. The li","useful":0,"cool":0},"v4CMKi_lygWseXOlCzKFSQ":{"text":"Home of the world famous muffaletta, what can I say about this place that hasn't been said","useful":0,"cool":3},"QTo44SITE1e5yGKzp3A86g":{"text":"Disappointing. After being obsessed with Cochon Butcher's muffuletta, we wanted to try to ","useful":0,"cool":0},"dzvpkNHOCGDf5tIhaqM6kw":{"text":"Stopped by Central Grocery to grab a quick lunch on the way out of New Orleans to get the ","useful":4,"cool":2},"Pt12E-zC-ms3wDxmYPMGXA":{"text":"YUM, I'm now obsessed with muffulettas. Not sure what more I can add to all these reviews ","useful":1,"cool":0},"Q7gnFa0hf1qIFjV_dI59jw":{"text":"Awesome and friendly staff. Spacious sitting area. Amazing Italian muffuletta and extra yu","useful":1,"cool":1},"0zSfJzQE6Gz1B4HEhUqM8Q":{"text":"Absolutely amazing! The Muffulettas are massive, I had a quarter of one and was sufficient","useful":0,"cool":0},"2YSbBOJnnOVbELHgpMqktA":{"text":"My girlfriend and I got the mufaletta. It is pretty big. So you probably want to share one","useful":0,"cool":0},"aOyuD-gahPVtgVAInooukA":{"text":"I sincerely do not understand how this is a must have thing while in New Orleans. I make a","useful":1,"cool":0},"LYCF_4Hpsm25lc0lhrGydQ":{"text":"Life changing! We stopped in here while in the area to grab a half muffuletta sandwich. It","useful":64,"cool":65},"hvuzOQLaLY5dah9SCzm4Sg":{"text":"Late lunch = no line.  Picked up the half muffuletta to-go.  The bf and I split that, and ","useful":1,"cool":0},"Sy_A-9s3OfMdnCaezpIT4Q":{"text":"I'm sitting at the Airport with 2 muffulettas in my carry on, one for a friend and one for","useful":2,"cool":1},"i-qgp2f-_etd0zggRwB1vQ":{"text":"Well, I can honestly say after spending almost 50 bucks per sandwich it was worth it. I li","useful":0,"cool":0},"qaBbhZMv2wk1tERLkYTm-g":{"text":"The home of the original muffuletta of NOLA. \n\nSo yes, I had to try it. Came in mid-day af","useful":3,"cool":0},"UO64jwabKoeb6T0ZBb2wSA":{"text":"When my boyfriend and I booked our first post COVID travel ban trip, I truly wanted to giv","useful":4,"cool":5},"E33KSA41lUIADJd4I1qq_A":{"text":"Great sandwich!! Great atmosphere!! Definitely a place you need to visit for lunch! It is ","useful":0,"cool":0},"kZ1pb1eLcU9uhqxMWIQWsQ":{"text":"Cool little shop. We stopped in for a muffuletta and didn't realize it had seating. The st","useful":0,"cool":1},"ABsakEPJs-prP93wvr1jMA":{"text":"Muffuletta. The original. You should stop by. You need $1.25 for the pop machine. The prop","useful":2,"cool":1},"BMBiQJxFoxorcb-w5bZxRA":{"text":"A NOLA classic, not much more to say here other than be sure you leave room for this treat","useful":0,"cool":0},"ahcrDGsB24GyrS2bl6-6Rw":{"text":"Got a whole Muffaletta sandwich which is cut in four pieces and more than enough to share ","useful":0,"cool":0},"nHysZ29GjI9os-HiWSEa0A":{"text":"Boy does this remind me of the corner Italian Market in Chicago. Never heard of the Mufful","useful":2,"cool":3},"A_qBUT3n-K4X3JCBGMxeeg":{"text":"I mean no atmosphere, it's totally a grocery store BUT it's got the BEST take out Muffalet","useful":3,"cool":2},"szKrcJSipEEk_P_d1UnvJg":{"text":"Went into this deli during covid , it was a Monday and it was around lunch time , business","useful":2,"cool":2},"Snr4o4Dq3xTGQvw-zJ57zg":{"text":"Not wild about the stuffed artichoke which was so breaded you couldn't find the artichoke.","useful":0,"cool":0},"iGRF5uLEBeRaZw3cnlImkQ":{"text":"Get the Muffaletta!  I thought I had eaten real ones until I had theirs. I will be stoppin","useful":0,"cool":0},"YXeWDT6xspuZKsniEx5Q3Q":{"text":"The only place to have a muffaletta. Ever. Once you eat theirs, you'll never want anyone e","useful":0,"cool":1},"dWyOCCYS1nX41aBA18MHlQ":{"text":"What can I say? Coming to Central Grocery to pick up a muffaletta sandwich the day before ","useful":4,"cool":1},"-uLVYz0nVXojcPteOQoi8g":{"text":"Stopped in for a late afternoon snack. The two of us shared half of a muffuletta, which wa","useful":0,"cool":0},"7waKahr1e4P6Lk92ZZwphw":{"text":"Always a stop when in New Orleans. The staff are always friendly and helpful.  It is an ic","useful":0,"cool":0},"tvPOfwQhls-d0T9z_VbVYw":{"text":"Weird interior, very impersonal. \n\nDefinite tourist spot, but pretty delicious pre-made sa","useful":1,"cool":0},"1SFjB9ttzgzZFswvlmFy-g":{"text":"I fell in love with the muffuletta. What a great sandwich! The pimento salad on top is wha","useful":12,"cool":11},"T58j-CAZfVxV_HwXy9ZoNw":{"text":"And we had to stop to get a muffuletta! This did not disappoint! And just as the muffulett","useful":0,"cool":0},"57ksNEIqozgQPFJL6fyk0A":{"text":"Lidia's Italy (PBS) was where I first heard of this place. The muffuletta was first create","useful":5,"cool":2},"lxOZag8nnL3NM9GvK7ZO3A":{"text":"Home of the original Muffaletta and your home for at least 30-40 minutes while you wait in","useful":1,"cool":1},"i9VH_KD3KyhCaW1MsTJ13Q":{"text":"Home of the original muffuletta and the line is shorter than I thought! Granted it's an ac","useful":1,"cool":2},"smAvk204Etuv-iv1yFvSqw":{"text":"It may not be fancy but when the food is good who cares.  I was on a trip to New Orleans w","useful":2,"cool":2},"7GG9iYuPEQkv--3UOwTDrQ":{"text":"Best Mouf in the universe! Nothing comes close. Been eating them for over 55 years and nev","useful":0,"cool":0},"RyqhjhgPGMQpCo3tlPYngg":{"text":"This place is a must stop for all our trips to New Orleans. Muffuletta is the reason.  We ","useful":1,"cool":1},"8FtQGZYMp6_gP5ZUI5w8CQ":{"text":"Had to go! Read so many things online raving about this famous sandwich. \n\nThey were not w","useful":3,"cool":0},"eD0cIYPe3oTOnjNvBBnmRA":{"text":"My hubby and I  spent 3 days in New Orleans and We went to The Central Grocery for lunch o","useful":0,"cool":0},"k55V5j2W40K5Dd-9AJvozg":{"text":"Yes, it an expensive sandwich, but it's definitely big enough to share.  We got a half san","useful":2,"cool":1},"zan7XhDReUx2AnVkIq6GXg":{"text":"Two people split a half muffuletta with chips and it was plenty of food. Went at lunch tim","useful":0,"cool":1},"3xTOelWAhZ-2Q120xM8D0Q":{"text":"I always love prominent food spots that have times when it feels like a local, quiet spot.","useful":0,"cool":1},"GdG2QcaWu3MdLUUbgfzZBg":{"text":"A place to try when you're in New Orleans! I went for the first time during my most recent","useful":1,"cool":1},"yfpvQgRhU0mXXSShCA_RvA":{"text":"Muffuletta, I'm still dreaming about you.\n\nYou don't come to NOLA without not trying this ","useful":1,"cool":2},"AC3sdR8WM9aJ8n8jdTm7cQ":{"text":"Muffuletta dreams came true! This was my last meal in New Orleans and it was phenomenal. I","useful":0,"cool":0},"6Uz_HTOB6DnaWYxnlfkTiA":{"text":"muffalettas!\n\nI didn't try them anywhere else, I must admit, but they were quite fulfillin","useful":1,"cool":3},"xEbH2FLW0I9v7G6P6MV8Nw":{"text":"On our road trips from Chicago to New Orleans we leave with a muffuletta and a bag of Zapp","useful":0,"cool":0},"IEp-q8hH_FhHBN0upklIPw":{"text":"Yes, we had the muffaletta. And came back again the next day for another one, too. The ser","useful":1,"cool":0},"r_RQviExxh8CgSwCoMCf8g":{"text":"I had ZERO expectations when I came here for their muffulettas because the store was old, ","useful":2,"cool":3},"icHyuq74WNy9o_6FdNZeLg":{"text":"We read about the Muffaletas from here before we visited. So glad we stopped in for lunch!","useful":0,"cool":0},"IvN8U96Mz1_pC8fv4vFRbQ":{"text":"I wanted to love it.  I wanted to be part of their history.  To love this muffuletta basic","useful":0,"cool":2},"mvZcVnj-VDuUACjo4rIsnQ":{"text":"The grocery store itself is cute but I wasn't impressed with the muffuletta. The bread was","useful":1,"cool":0},"liZynr5Prcj10ijSCLNeJQ":{"text":"Don't go first thing in the morning. One: they will yell at you if you even step foot ONE ","useful":1,"cool":0}}