{"kT2O2n666LeNDLTdggjlcA":{"text":"My husband and I have visited this spot more than once while in NO. The wings are really g","useful":1,"cool":0},"5rwxto7bKEeMSTcEMgfWLA":{"text":"Close to our hotel- Clean-food was good, reasonable. The staff was friendly and quick. We ","useful":0,"cool":0},"0Iu5pE-57Ia0MS1HwamUXw":{"text":"NIce restuarte food very delicious however, the bathroom and the hall to the bathroom that","useful":0,"cool":0},"6vDA9Jq-Z-CHL8_z6ONlrA":{"text":"Awesome Fried Green Tomato Po'Boy!! Service could use a little improvement but pretty good","useful":0,"cool":1},"bbBsUh7OS8NULNvvIHC2xQ":{"text":"Don't be fooled by its 24/7 all night cafe persona. The food is delicious and comes out pi","useful":0,"cool":2},"BoX4UAdqISU079FEQAM62w":{"text":"Great place to eat. Open 24 hrs which was a plus. We were delayed at the airport and got i","useful":0,"cool":0},"pKFzJlg9OhFnXSauBqJM5Q":{"text":"Go here. Not the one on Chartres. Love the hot wings. The breakfast is good. The gumbo too","useful":0,"cool":0},"cK2Nyi6lY0sisbqEsJnRMQ":{"text":"Sometimes super busy but there's a reason why! Good food and service! Love the bloody Mary","useful":0,"cool":0},"dpqvSzbLC49jn2aj7JPF1A":{"text":"Only reason it's a 2 star review (would be a 1.5 if half stars were allowed) is because of","useful":0,"cool":0},"TFTJW33qryzAJAfAPRwKBw":{"text":"I enjoyed my visit to this place. When I walked in, I was told I could sit anywhere I like","useful":0,"cool":0},"dnT7-16jErnJMBXZdBhOlQ":{"text":"Great place! Anytime we are in town we always make it a point to stop here! Love the jamba","useful":0,"cool":0},"6jIWjvXE2P-8Sw-kRzjp2A":{"text":"The food was okay. The Cajun Spicy Gumbo was suppose to have shrimp/seafood but there was ","useful":0,"cool":0},"y5lhq7ShVYFLCR1CSX9NwA":{"text":"24/7, that's pretty sweet! The food hit the spot, but it's one of those places you don't r","useful":0,"cool":0},"2fDTYbMOXrxZHH5dZwLxKg":{"text":"Great food and value, had the breakfast special and filled my food tank up . Where I am fr","useful":0,"cool":0},"0kMNZ8D-17j4zr0JzTpyhA":{"text":"No complaints! We ordered the Cajun fries, fried green tomatoes, the gyro, and the DD hot ","useful":0,"cool":0},"zrBK-B0EFd9c-nL1G380jw":{"text":"Popped in for an early breakfast.  Seated quickly our waitress was attentive.  The food wa","useful":0,"cool":0},"VWXxKCo013PEXJADMmkMlw":{"text":"Being in NOLA for a week meant we needed to grab breakfast every single day and this was o","useful":0,"cool":1},"h7NenruGwyaOdhQnMfQduw":{"text":"Our family went to dinner tonight and ate: rib eye steak, blackened cat fish, and pork cho","useful":0,"cool":0},"Lzc9nq0OWFkaMYXooFTmPg":{"text":"The food wasn't bad, I got to try fried oysters on a po boy and the gumbo was spicy. But t","useful":1,"cool":0},"SCZtV2l_01RjwJvBebtw-g":{"text":"Again, some great comfort food while traveling. The service was outstanding. Sat next to s","useful":0,"cool":0},"fLAeR4eGTJDxYlSX4s7hTQ":{"text":"Me and my friends ate in daisy dukes and we had the spicy garlic wings and cajun philly an","useful":0,"cool":0},"1cqsKB3PVDt47_IIkDcY-Q":{"text":"This place has the best burger and Cajun fries and the best part all under $7. The waitres","useful":1,"cool":1},"Qip52M1t3nQAKUs8821mbA":{"text":"Some items good and some not so good. The kids liked the pizza.   We tried seafood and not","useful":0,"cool":0},"Jb8_BQBgByfxJbSVRoP5WQ":{"text":"This is a great little place, located just west of Canal Street, in the Central Business D","useful":0,"cool":0},"a0J5u7Oez1oULVISx0HCfQ":{"text":"Excelent filet philly cheesesteak. Nice NOLA twist on fries and onion rings with the spice","useful":0,"cool":0},"GOCBhTpIzYiCCF7H0FqpDg":{"text":"Ok, my wife and I are 50 but turn 25 every time we visit NOLA.  We were staying at a nearb","useful":0,"cool":0},"ciYI5BwXFGQozUYAYhKEnA":{"text":"Food was great and portion size was large, which is the only reason for 3 stars instead of","useful":0,"cool":0},"QUXoiM9e8lp_vyDh37cCcQ":{"text":"It was close, thank goodness, but it may have been across town and I would still recommend","useful":0,"cool":0},"C5Oe0OlrqkpD4i_J-j9_XA":{"text":"Great for late-night food.  Friendly.  Delivery may take a bit.  It was so close to the ho","useful":0,"cool":0},"XX7xSx-wCkxNC946eS7Y6w":{"text":"They are a favorite when we are in downtown.   The breakfast is one of my favorites.   Whi","useful":0,"cool":0},"u8C_yOCGInC54cSpMl0agQ":{"text":"Very good late night snack.  The alligator po boy was great.  Everything's just a little t","useful":0,"cool":0},"jc9kYfqivE1RuxuHa8kKWA":{"text":"Had the shrimp and grits for a late night snack after Bourbon St.  it was very delicious a","useful":0,"cool":0},"nY8GiKEsowW0NikOSTBzGA":{"text":"We visited here from a recommendation of our concierge at the hotel. The service was OK. T","useful":0,"cool":0},"fxa0qkgNQdjtthjZ3X70Yg":{"text":"Not sure what the hype is about, food was average! Not worth a 5 min wait! Prices are low ","useful":0,"cool":0},"HAu46GiUXxD8h0WnXivBgA":{"text":"I ordered a Jambalaya & it just looks/tastes exactly like those leftover from few days ago","useful":0,"cool":0},"KtmX66FWfse7I2WLPB_S2A":{"text":"Great food and service from Sara \nAsk for Sara she is the best  Fun menu open 24 hours.","useful":0,"cool":0},"U9N9hq-1OU9LFLABb8wQHg":{"text":"Reasonable prices on breakfasts.  The early bird $3.99 was perfect.  Grits were okay, but ","useful":1,"cool":0},"wz1PDn5L91aJ1V15QRyaPw":{"text":"Went for breakfast,  a really short walk from my hotel. Breakfast was great, I had a Cajun","useful":1,"cool":1},"nalB4fQJSznNDNTD_0f5FQ":{"text":"This is one of the place I most likely to Visit to dine! aside from It is situated in hear","useful":1,"cool":0},"ujkmpVrylRdPgA4V40mNxQ":{"text":"Terrrrible! Do not order this shit. Food was disgusting and cold. Forgot all our dressings","useful":1,"cool":0},"JiUsGLg_3Ru5COTYWIDp4w":{"text":"We loved the food and atmosphere. Very laid back and easy going, like the city its self. T","useful":0,"cool":0},"ZSBLkuvBx3z5jVWN1ZZbdQ":{"text":"The best burger yet delivered ever, just visiting from San Diego and we were a bit hungry ","useful":0,"cool":0},"Nys4o52-tusVahCFaBEB9Q":{"text":"Good late night spot. Don't get overwhelmed by the menu bc you have options. Enjoy. I had ","useful":0,"cool":0},"orPS5f7KMvdSszK-oSltZw":{"text":"Family and I stopped here for breakfast while visiting New Orleans... the biscuits were un","useful":0,"cool":0},"mOdiRLUF-8UEkS4BafenIg":{"text":"Came here while visiting New Orleans and I must say the food was awesome and the service w","useful":0,"cool":0},"vaIC1DvIIll6t0nzhru2hQ":{"text":"Food was delicious lots of oysters on my poboy and the gumbo was fabulous! Nice to have th","useful":0,"cool":0},"BR52nV2jHUtdtLLJ2U9XGg":{"text":"We were staying at a hotel in the French Quarter and ordered grits and hash browns to have","useful":0,"cool":0},"GeIkseD69HGQwC6J59MmoQ":{"text":"The food was surprising good for 2 am, had a breakfast sandwich similar to a sausage McMuf","useful":0,"cool":0},"lJCl8_qLS8yfFdOq6Fbflg":{"text":"Justin was awesome!! Food was good and service was fast! Will come back again next time we","useful":0,"cool":0},"5UyBBIMMdUGP7SB-jBE9PQ":{"text":"My friends and I decided to go in before a night of going out because it's right by our ho","useful":0,"cool":0},"mjTaTxcJRX36MdTeh-Zp5g":{"text":"Good stuff! Excellent staff! I had the gumbo and the shrimp and grits - what you talkin' '","useful":0,"cool":0},"lPvMnRpDuTt08O4ritF00w":{"text":"Very good prices. Catfish poboy special was huge. All my friends agreed it was a great hun","useful":0,"cool":0},"SfhPK01PE2fdn9-MplbOtw":{"text":"We asked our valet guy in our hotel where we could get some good chicken wings and he reco","useful":0,"cool":0},"oPIbV3QPdRhki7eNFg3Z8A":{"text":"Awesome food.... Awesome Service considering they were super-packed!!!! I gave them 4 Star","useful":1,"cool":0},"--R7Gp5rTQcY0vGp0bZtTA":{"text":"Had lunch here recently and I am a fan. Good gumbo and an even better Po Boy. Large portio","useful":0,"cool":0},"aa_bDAocYlbicdtNOK2Agw":{"text":"I came to New Orleans on a late night flight, after i check inn my hotel and everything i ","useful":0,"cool":0},"bdgjB7k4CnvSuP753S1MPw":{"text":"After checking into our hotel the front desk staff recommended Daisy Dukes as a place to g","useful":0,"cool":0},"JGMN3pbKBURCYD_2x_BjJA":{"text":"Well, here we have another New Orleans business that needs to wake up and realize that it'","useful":2,"cool":1},"E5ApOvTAkOoWHShCh9mUSg":{"text":"Also: I want to compliment whoever created the playlist at Daisy Duke's. The 90s playlist ","useful":1,"cool":0},"Au7Zlxauaa8yBOqQGVuprQ":{"text":"#I walked around town for about an hour trying to decide where to eat. I got tired and end","useful":1,"cool":0},"bqkqU-VeJLxTJqvY7pNC6w":{"text":"Our go to spot for breakfast. Quick turn around and good service. Table of 16 quickly sat ","useful":0,"cool":2},"B0E6okXHHRXAMxIMsorXRA":{"text":"Had a blast!!! best biscuits ever. Everything was traditionally hot New Orleans style. Foo","useful":0,"cool":0},"r1YCBg8pA2JRwBHzSM8G7g":{"text":"Great Cajun. Killer catfish po-boy, jambalaya and gumbo. Less smokey bar/ restaurant to wa","useful":0,"cool":0},"IDa8UqEAVTpHTrQZolTJiA":{"text":"My first and most likely my last stop in this place. Sat down and it took a good while for","useful":0,"cool":0},"Ox2D82mr8yMkmGdNavqfcw":{"text":"Justin was really friendly and welcoming! The food was delicious and filling. Service was ","useful":1,"cool":0},"ukdacImopQDwGXcmrD0Ykg":{"text":"We had one breakfast and one dinner there and the quality was way above what we expected f","useful":1,"cool":0},"sNAHcHdeaoCUvaPrGCb80A":{"text":"The atmosphere was casual and inviting. The service was quick as well. \nWe had the biscuit","useful":0,"cool":0},"bLhUIaPEmki5Ry56w_TLOg":{"text":"I wrote a review on this place and it was removed. I based the review on the menu.  The me","useful":5,"cool":2},"ZRu4lGCk8OpQSHZ75Px1lg":{"text":"Food is awesome!! Service is friendly and quick. I didn't think I liked Cajun food until I","useful":0,"cool":0},"17uXjmk5TFoTmCpv_cnv9g":{"text":"I'm a frequent NOLA visitor, but this was my first time at Daisy Dukes.  My friends and I ","useful":0,"cool":0},"vWKbEx0Mduh7fEszZigNKQ":{"text":"Yeah buddy! 24 hours a day, 7 days a week, when your drunk and got to eat, to Daisy Dukes ","useful":0,"cool":0},"o3tQO08CZ40SANbsaM9nVA":{"text":"This was a very convenient stop across from our hotel.  Our hotel served breakfast but we ","useful":0,"cool":0},"Y1zPTP8nv4yb7ozB7B6Kow":{"text":"We sat at the counter and were waited on by Sara who was great- super friendly and attenti","useful":1,"cool":0},"9w0ZYHaEMkqj543f5AV1EA":{"text":"This place serves a great breakfast and lunch. Have not tried dinner there. Extremely good","useful":0,"cool":0},"X_R0HFXxftjNs4OtRkM_7A":{"text":"Stopped in three times to Daisy Dukes, not because I/we loved their food, mostly because i","useful":0,"cool":0},"KiJMMmpXh5wru5OlgWaBVQ":{"text":"Great for a quick breakfast, but still tasty. Comparable to a diner, but doesn't look like","useful":0,"cool":0},"ELiWUmRfd_PTv4X8Lxk3Aw":{"text":"The food is good, classic and quick.  Our waitress was annoying, if I hear \"ladies first\" ","useful":0,"cool":0},"F20LYAWgY3O187FIOjBWFw":{"text":"This Daisy Duke experience much better than our experience 30 minutes ago on Chatres. We w","useful":0,"cool":0},"-VtO3jpsaDrh8aKLt73rRQ":{"text":"Daisy Dukes, what a name. I went here with two co-workers. They weren't sure what kind of ","useful":0,"cool":0},"XMxx2TMIP8qT44e-q6mVJw":{"text":"Great breakfast a few blocks from our hotel.  Very friendly staff, especially Monsur, who ","useful":0,"cool":0},"aAsW-b8IhVXwfFrXG3jeeA":{"text":"The food was good, the duke sauce was the bomb though! Highly recommend it. The only reaso","useful":0,"cool":0},"Kp5-WZLdDlKwQJAo99L9Qg":{"text":"Half of the party I came to New Orleans came here around 3am after a night of drinking to ","useful":0,"cool":0},"DqLi-7vCJGEVukL5Muvwwg":{"text":"Daisy Dukes Express was across the street from our hotel, so we stopped for breakfast one ","useful":0,"cool":0},"vfaLKxE34c97jb4hcVHn4A":{"text":"Seriously love this place. Never had a bad experience here. Our waiter, Jeremy, was an abs","useful":1,"cool":0},"8Zq9Ar9btGlaWh7DKLipXQ":{"text":"We stopped at this place for a late dinner on the 8th of December. The menu seemed to have","useful":0,"cool":0},"6pp9LD_9uK87Ejaj7yV7_Q":{"text":"I had the blackened alligator, yum. Sauces were tasty and the whole meal was great. Seated","useful":0,"cool":0},"Nc79kwUxofLLGF9X2dG90w":{"text":"Don't let the name throw you off!\n\nWe were hesitant to go here to eat because of the name,","useful":1,"cool":1},"YnbDdbBY200GQg1A2vJePw":{"text":"Ate here on a Saturday morning.  Food was good, staff was very friendly and prices were re","useful":0,"cool":0},"nGx4lJwzNI9UsXlismbqQA":{"text":"Cheeseburger is delicious and the wings have a good taste. It's pouring down here so the d","useful":0,"cool":0},"G1wCBo4x6UF7ZseF2lM0DQ":{"text":"I really like this place. It was suggested by one of the locals at my hotel and I'm glad t","useful":1,"cool":1},"-la1xk6rgKYgoL6SMYgG5A":{"text":"Visited twice on my trip to Nee Orleans. Had the Seafood Omelette and Grits the first time","useful":0,"cool":0},"21-igGt1joNPZLCZE4O5JA":{"text":"About to do damichhh on this 1/2 shrimp po boy and gumbo combo. DND  #NSN2k18 #Allstate #C","useful":0,"cool":0},"wo58zARBwgeahO75BY7JMQ":{"text":"Good food, cheap, friendly and fast service, and a nice location. Delicious omeletts and g","useful":0,"cool":0},"kIt3gB8jfqWHHGOiKN8_HQ":{"text":"Good for a quick meal! Plenty of food on the menu to choose from.","useful":0,"cool":0},"pCe6NgGKZ2Yr_82_shcy6w":{"text":"We got good service, some tips for checking out some local stuff if we got the chance, and","useful":0,"cool":0},"31r9Xl_porH-QJ0Ii9o-RQ":{"text":"I had the shrimp and grits. It was very nice. The best I have had so far. Our waitress was","useful":0,"cool":0},"TzcJo6CObv0tWvpP5q7xSA":{"text":"Recommended to me was this excellent hole in the wall restaurant. If you're looking for so","useful":0,"cool":0},"B2XAOgkZi5vwH6FdcA1Fag":{"text":"Great gyros, red beans and rice, and shrimp po-boys.  Just across Canal from Bourbon St.  ","useful":0,"cool":0},"usVHN1cyPQHdMg9SERWcvA":{"text":"So im on this semi health kicknright now and im in new orleans and its nearly impossible t","useful":0,"cool":0},"ghs6iOwdZR1H2Po8BFZLPA":{"text":"Great Food! Good Vibes! Reasonable prices! Jerrod was so nice and friendly. Love this plac","useful":0,"cool":0},"K4u4NpshnqSE4FY633ysZg":{"text":"The waitress who greeted us was very friendly (couldn't tell where she was from based off ","useful":0,"cool":0},"1pRRoTNCct33bYbx9EeXnw":{"text":"as a self proclaimed connoisseur of Bloody Mary's I highly recommend waking up with a hang","useful":1,"cool":2},"wTpGbZ_htgn2rQgsi999Vw":{"text":"We met Monsur (spelling?), the manager(?), next door at Gallier's, so we went to Daisy Duk","useful":0,"cool":0},"5mEFAZjYJ-nBM9z42dkJ_Q":{"text":"A fantastic atmosphere with very friendly wait staff. The spicy gumbo Is must try, the wif","useful":0,"cool":0},"yd9bUH8vht3NY4U8fnTXtw":{"text":"We came in early for the breakfast special. It was pretty decent. The service was pretty g","useful":1,"cool":0},"cu_FcIOifEWWMGGXQ1P2dA":{"text":"Can't complain! Cheap, quick, and tasty food! They also serve very large portions so be su","useful":0,"cool":0},"HqtQlvdLfmKInnMlGWHEeQ":{"text":"This is my first time visiting but I will be back.  The service was prompt,  the food was ","useful":0,"cool":0},"P-pf7orGePaCTju8f13DUA":{"text":"We came in for a quick bite because we saw the good reviews. We were highly disappointed. ","useful":0,"cool":0},"6BnhEBZq0IVAjV6-7_h4fg":{"text":"LOVEEEEE LOVEEE LOVEEEE!!!! The owner Sam is soooo sweet and caring... And love the severs","useful":0,"cool":0},"T2mUXItPxd6gQbJ2HXR0uQ":{"text":"You don't go here for fine dining. You go here because you're hungry & you want good cajun","useful":1,"cool":0},"Bc_T205z_7cVDowBLhH3bg":{"text":"Far from express at night. Malik was my server and a pretty good guy. No complaints from t","useful":2,"cool":1},"7zocDiPjqXwWZ7x5nyKElA":{"text":"I was debating between 3 and 4 stars, and finally settled on 4.\n\nThe inside lm looks a lot","useful":1,"cool":1},"ybjAndMKntk9fr34mNdEpw":{"text":"wanted a late night breakfast. received a recommendation to try Daisy. it was a great expe","useful":0,"cool":0},"C12ykKk2SsqwP-7JhMb-Wg":{"text":"Hey, I'm not a local, but I loved that this place had a good, \"Veggie\" Po-Boy at a good pr","useful":0,"cool":0},"Fq3VCN8vb4qA0KbjnVVeyQ":{"text":"Food was great but the service was horrible. We had no idea who our waitress was. When we ","useful":1,"cool":0},"PlCP3gktlMNZhbebw8LxBw":{"text":"Very efficient waitress and better-than-average diner food, with food served 24x7, plus a ","useful":0,"cool":1},"MA7Fx_91HIwxp-5shPOeXw":{"text":"If I could give negative stars, I would. \n\nFirst, the waitress came in from her smoke brea","useful":0,"cool":0},"MOcoHiXEIef57JWoD3LGFQ":{"text":"Came to New Orleans to enjoy the weekend.  Found Daisy Dukes Express by walking by.  Came ","useful":1,"cool":0},"HOGyIMvEpKIu7hgWkxZkug":{"text":"The food is good and the service is friendly. We came for a huge conference so they need m","useful":0,"cool":1},"MGYcZVB_1jZvo5HW2d_U5Q":{"text":"Order arrived later than eta given, food was soggy and chili cheese fries were dumped on t","useful":0,"cool":0},"ZmsLWXcFZFNQDD3LbG3C3w":{"text":"Wings are dank but got food delivered and my bacon cheeseburger didn't come with cheese an","useful":0,"cool":0},"KOQ0ba-YaRupuTC1AoWdJw":{"text":"This place embodies the culture of New Orleans! The food and drinks are so terrific and sp","useful":0,"cool":1},"_G-vyOlJZzjhWfxDcTHlrg":{"text":"We stated at the cotton exchange about a block down. They deliver to the to hotel. Which w","useful":0,"cool":0},"PvY7uNV_pCrgv1HnfmKEFg":{"text":"Had a great Gyro here at a reasonable price.  This is a hole in the wall, kind of like a c","useful":1,"cool":1},"jDQOP9thOas_CTHqzdjBlQ":{"text":"Food and Coffe were fantastic. Made this our spot while in town. I had the veggie omelet, ","useful":0,"cool":1},"jCnIgwBPK6M0DX1Up-1Vvw":{"text":"I wasn't all that impresses about the dish I had. Today I tried the alligator sausage Po b","useful":0,"cool":0},"nWkNqJKS-kADBfItcTpKzw":{"text":"Great service, blackened cat fish and Breakfast available 24x7 and all breakfast menu tast","useful":0,"cool":0},"rhVkYtjMnI4wRYv0URizWg":{"text":"The food was okay but it was annoying to not have the option  of splitting the check. Alth","useful":0,"cool":0},"Zaa6SHspAP98-lN-ggzQnA":{"text":"Awesome food ,the delivery guy was super freaky fast and delivered our food right to our r","useful":0,"cool":0},"SohsYp3i_J4QkKHRH1VG3A":{"text":"It is what it is.. a 24-hour joint with cheap junk food to coat a liquored stomach.  Stumb","useful":2,"cool":0},"eBn13axzxEum57Gc2Vgkrw":{"text":"The meal was exquisite, especially he shrimp and grits. They handled our big group easily ","useful":0,"cool":0},"VP1vsfBSLLFHsnmKd8kw4w":{"text":"My friends & I lived here for several days...\n\nWhether at 5 am or 9 pm....\n\nEverything is ","useful":0,"cool":0},"KEYnY8gKWgg8r7ax4DgoJA":{"text":"My experience was pretty bad here, first I asked if they carried sweet and low because our","useful":0,"cool":0},"J6aZtCQjo5sA3jdHOVWhJg":{"text":"Really good breakfast and location! Went really early in the morning for greasy diner food","useful":0,"cool":0},"VhuJ85g2DOHYIXeeSKyE1g":{"text":"The shrimp & Grits made me  sick, I definitely had better. Mimosa are good in nice sized. ","useful":0,"cool":0},"uYolgGV5dj6SjNsL07t7Aw":{"text":"Meh...had the shrimp and grits and was very soupy! My aunt got the pancake and wasn't too ","useful":0,"cool":0},"McRl2dlDU8gVhVu_Oc-Z7Q":{"text":"Great place to place a delivery order!!! I was at a private party @ JAX and the kitchen cl","useful":0,"cool":0},"7tt_u0JyiqlXCzqmJS1h8A":{"text":"We came here for breakfast and it was great! Buy one get one free mimosas and Bloody Mary ","useful":0,"cool":0},"EbPE8Qh-YUYjZhkF4fPiOg":{"text":"Place was suggested by a coworker who lives in the area, I Stopped in for lunch and had an","useful":0,"cool":0},"1tp3Hca5xx-aHgkJXv87cw":{"text":"very good food. large portions.  reasonable prices.   I had the red and and rice.  My wife","useful":1,"cool":0},"CBF9FwuvABV05mV4RWaWpg":{"text":"My food took over an hour to arrive. And it was cold.\n\nex·press\nikspres/Submit\nadjective\na","useful":0,"cool":0},"BwymB0wKYzZoXVexTzQUCw":{"text":"I had breakfast at Daisy Dukes today. My server was great. Thanks Sarah. I will be back","useful":0,"cool":0},"Lflx26EehD6TmqZxjQCDgQ":{"text":"I thought all things food was supposed to be good after a few drinks. Well, Daisy Dukes di","useful":0,"cool":0},"LRF7_qITa6KxpdKbS2sccg":{"text":"Still the perfect po boy sandwich after a night drinking. You can order a half sandwich wi","useful":0,"cool":0},"t_7ZJ2d9qZD6VrvYgq0fQQ":{"text":"This was our first stop in New Orleans, we picked up some food to go - so didn't see any s","useful":1,"cool":0},"mqnS2XkEbxJRf3TVfTLiog":{"text":"Came into this place in late afternoon after a rough morning and was very well taken care ","useful":0,"cool":0},"ymQ4BPV2HUBMuy-Hb7nQpQ":{"text":"You had me at breakfast! Great restaurant serving all day breakfast. In the afternoon and ","useful":0,"cool":0},"HmWDfm0sXyM4EjD9FZz-bw":{"text":"I called to place an order about 1230 was advised that it would be 30-45 mins for delivery","useful":0,"cool":0},"VMubv0rSXUg3vjiKTOnNCg":{"text":"The gyro and the drinks were rolling. Pretty quick and a fair meal and cheap. Clean place,","useful":1,"cool":0},"hfDqTWTydQ5WXBYAgsjIcg":{"text":"I don't know how we ended up there but we weren't disappointed. This could have been 5 sta","useful":0,"cool":0},"meZEUmOQUtvxzp2q8rTUxA":{"text":"Perfect place to grab breakfast to cure a hangover. Did not have a long wait and our waitr","useful":0,"cool":0},"h7hAZ4o6b6iYxxSJeXzfIg":{"text":"over priced, and awful.  i was a charged both a service charge and a delivery charge.  i w","useful":1,"cool":0},"XkbzHhZvGe_hhEwUYQlSAQ":{"text":"We loved it! Cute atmosphere, amazing food! We were sorry we didn't find it sooner as it w","useful":0,"cool":0},"sR6JQJxlVARO6WKeFoVBOg":{"text":"I came here \"by accident\" while I was looking for another place and am glad I ended up her","useful":0,"cool":0},"Z5KO9FleBTXRoVajg1pw3A":{"text":"Are you kidding me?! 2 for 1 Bloody Marys! They won my heart over with that one right of t","useful":0,"cool":0},"9hwlVtckMqOIT9MTFnh4xw":{"text":"A friend and I came here for a Sunday morning breakfast. She had an omelette with bacon an","useful":1,"cool":0},"d0hTSSdCRU7kCYc4kWGXbQ":{"text":"Had dinner here on 4/7 and it was traditional New Orleans food. Definitely had that cafe f","useful":0,"cool":0},"U4DJNeanYBXPfgXiLudXyA":{"text":"I thought of giving this location a try since been to Chartres several times and man, it w","useful":0,"cool":0},"E5oKrQ5XV9IZrM07zoS7Qw":{"text":"At any hour when in the CBD of NOLA, I can have great food! Like my fav pizza with crawfis","useful":1,"cool":0},"RUnmCUxlNH0np7-xROUjng":{"text":"Got the special wroth a blackened alligator sausage poboy, and gumbo.  $8.95 is s great de","useful":0,"cool":0},"cc9Pr7ETfag2zxVThbvPtA":{"text":"Walking around looking for somewhere to get out of the cold we found this place. When we w","useful":5,"cool":3},"7kspj5yOmohcLC3Mu19zdA":{"text":"Consistency. This place has none. From service to food, its the type of place where you ha","useful":3,"cool":2},"DsOCERqkHd000xFxbJroUA":{"text":"Had a great time... my first po'boy ever and it did not disappoint. Alligator sausage was ","useful":0,"cool":1},"2G9wclqg_FAq6O02xjil6g":{"text":"Absolutely delicious & fast service. Everyone has always been very kind and accommodating ","useful":1,"cool":0},"MvefY92iP51Ps9wDNtkXjQ":{"text":"Bloody Mary's were great, love a take home cup. Sausage gravy and biscuits we perfect. No ","useful":0,"cool":0},"TBfgmq2Jhf9A7-4ht_y8DQ":{"text":"I am a big Shrimp Po'boy fan and I needed to try one more before I left New Orleans. We wa","useful":0,"cool":1},"VbFKGjgyYo5mtchKwpOMIw":{"text":"Best thing to eat when you've been out drinking. Is bacon egg sausage and cheese on toast ","useful":0,"cool":0},"BMmgd9Khz2v9ipgeH4MjSQ":{"text":"Food was great and staff was very friendly!\nWe were here as a spur of the moment thing and","useful":0,"cool":0},"JDu5hpNs4kgiO7orR5gnlw":{"text":"I'm a fan of any restaurant whenever I can't combine different items on the menu into a fu","useful":0,"cool":0},"3oNMlbERSry5CEOhQamHOg":{"text":"Being from out of of own, we didn't know what to expect from the typical Louisiana food. W","useful":0,"cool":0},"umE1hu3DFJxxTzDWXeSIuA":{"text":"Friend ordered the gator po boy thing. That was a fail. But it came with red beans and ric","useful":1,"cool":0},"DonYjrgxuAUE7hsbBqsHMA":{"text":"I give this place 3 stars because the food was slammin. We sat down to a dirty table and w","useful":0,"cool":0},"Dab9k2lvD-457u_JH3it-g":{"text":"Man, where do I start with Daisy Dukes? This place exceeded all my expectations. Granted, ","useful":0,"cool":0},"bkpwkNbBP2DWf3Z9lpZgZg":{"text":"Stopped in on my way out from jazzfest.  Super nice staff (Katy). Got the lunch special wi","useful":0,"cool":0},"on_3Jq8ZDf8OowJ6VC16Tw":{"text":"It was decent for some reasonably priced barfood. We ordered Spicy Garlic Wings, pizza, an","useful":0,"cool":0},"1Y2d8BdX6p4JOhVbsl9Gyw":{"text":"This place was terrible. My boyfriend and I took my mom and mother in law to eat breakfast","useful":0,"cool":0},"XrKD1H645oVTtaFDK3KCcg":{"text":"The best po boy EVER!!! I had the alligator sausage and red beans and I was in HEAVEN. Thi","useful":1,"cool":1},"EmC8pzqKdgeo9WMmQidsHg":{"text":"I had shrimp Po-boy and Catfish Po-boy with chili fires and cajun fries. Don't even think ","useful":0,"cool":0},"npniD2WZ_072xZwUo2DExA":{"text":"This place is SHAMAZING !! The portions are huge and the taste even better!! I had a burge","useful":0,"cool":0},"EzMoKSiDEctk5N6Btltl0g":{"text":"Sticky table. Slow service. Undercooked eggs. Burned tasting hash browns. Weak coffee. Nev","useful":1,"cool":0},"8numSv5em3UQ8AjWM6NEjA":{"text":"I got the brunch burger with Cajun fries, and I have zero regrets. I asked for my egg not ","useful":0,"cool":0},"vhfmNWgcStgkNuxSoEAfgA":{"text":"My sister and I stopped in to grab some pub grub to go. Justin set us up with a couple blo","useful":0,"cool":0},"s5RMidKNamFfvpaAy2_wcQ":{"text":"We arrived at our room around 2 am and needed a quick bite. Daisy Dukes was the only resta","useful":0,"cool":0},"8YE9o3a2nzeYxLNYSKKTYg":{"text":"I had a seafood basket and it was delicious the only problem I had is that the price was h","useful":0,"cool":0},"LeuMjx7_1JOCUjq3WNFWpg":{"text":"This was the worst food I had while in New Orleans. I mean it was really bad, I couldnt ev","useful":1,"cool":1},"LOG_A0ZtubhhPm0nGM_vyA":{"text":"The worst delivery ever!!\nWe order a shrimp last night just after midnight... 9 small shri","useful":0,"cool":0},"oRMTnC1cn2XnF8_DvsOUvg":{"text":"This is a great establishment. I work in the French Quarter, and I called to get delivery ","useful":0,"cool":0},"Pl_j4SvJ_a7rV_a8SWyjlg":{"text":"Dropped in for an afternoon appetizers of crab cakes and crawfish hush puppies. Also share","useful":0,"cool":0},"C8h96-xxOiCpuVKDZXP2mQ":{"text":"We went for breakfast. They do not have hash browns only grits. The eggs were cold. The se","useful":0,"cool":0},"-CeJfwEsA_DvPW2B3wt-WQ":{"text":"Nice place to treat yourself at anytime of the day. They have awesome mixologist ~ custom ","useful":0,"cool":0},"5ly9ZWpyzpNKBf3S79mh7w":{"text":"The food I ordered was a basic Early Bird Breakfast, but the service I received bumped my ","useful":0,"cool":0},"h3_U4SSZ_-24W496ipnn8Q":{"text":"went for breakfast..pancakes were really good!! and the biscuits the best i had since i go","useful":0,"cool":0},"ezN67PsHrnl1OYgv2z_22A":{"text":"Very good. Had the shrimp platter, soft shelled crab po-boy and kid's pizza (we think it c","useful":0,"cool":0},"CcWoJWqIrE_iUIhjLFJJMA":{"text":"Not good! A roach crawling up the wall was the first thing I saw. I rationalized this thin","useful":0,"cool":0},"Czba4JTkHYnbzpJqdesmNA":{"text":"We stumbled across this location shortly after checking into our hotel. We were seated qui","useful":0,"cool":0},"RyguubMxfzsGsyiQU-FhbQ":{"text":"The food is subpar. It's decent for the price you pay. Service is mediocre. The hash brown","useful":0,"cool":0},"qo_cfGLn4BXBolvAHimrHQ":{"text":"Tiffany and Mel are amazing!!! This place is perfect. The drinks are strong and the food i","useful":0,"cool":0},"PcPcy-GOqZ4Kh-0ZKNnkUw":{"text":"The waiter seemed annoyed from the get go!  Food was ok and the waiter never checked with ","useful":0,"cool":0},"yQvIWtQFDixYN6mRrh4NHA":{"text":"My food was terrible along with the service but what the only thing that made my experienc","useful":1,"cool":0},"p9ZFt_514XTG31YA3CWvzg":{"text":"Quick service, friendly waitstaff. The menu is pretty good and reasonably priced. They're ","useful":0,"cool":0},"t6Z7h_ouHbUsCMmAihwROw":{"text":"Best place I have been to in New Orleans. Food was delicious and very authentic. I had the","useful":0,"cool":0},"sumdowoyKxQKThZ5Qpb4uA":{"text":"Deliver here also.  The kitchen and backrooms are kept clean.  But will never eat here bec","useful":0,"cool":0},"UT0epu01gNjGHmCeFKCETw":{"text":"Omelent is good! 第一次是在尼泊尔吃，后来才知道类似国内的鸡蛋煎饼，服务很好，点了Cajun Omelet和seafood omelent，比较喜欢后者！","useful":0,"cool":0},"0j8C9mCALndvH6iRh91FCA":{"text":"My server Rachel was on point. The food was delivered exactly the way requested. I love ea","useful":0,"cool":0},"3Z_vEYwDK0b-h60gSNzhWQ":{"text":"This food is amazing. We ordered from our hotel room and I'm very pleased. This is a feast","useful":0,"cool":1},"wSOAqVt90RnVhZQqoYNqxw":{"text":"Great service and food for a late night spot. I got the shrimp & grits, it was delicious! ","useful":0,"cool":0},"X2JZSYOpinuWUvNDCKgLKA":{"text":"Awful. Save your money. The WORST jambalaya, po boy, and a burnt BLT.  YUCK!\n\nMy shrimp wa","useful":1,"cool":0},"PYmo0VqRujS72xZZ2ffoWw":{"text":"Best biscuits we ever had. Alligator omelette was super good!! Going to go back there for ","useful":0,"cool":0},"8kzuI7KSe6dLqkc2wQOBzA":{"text":"This was quite treat.  Bloody Mary was awesome.  The alligator tail po'boy was delish.  Su","useful":0,"cool":0},"rMXusc2SERWS-Or3lXNf8g":{"text":"OMG!! I walked past this place everyday while I was there..on my last day we decided to ea","useful":0,"cool":0},"-4iN03ZMKKMxYfCh58Nx7w":{"text":"Went there last night and met the best bartender named Val. The food was great, service wa","useful":0,"cool":0},"MxASEPMoj4JZCJ-b7_IfxQ":{"text":"I ordered the pancakes plain and they were so greasy.  The food was very greasy and flavor","useful":0,"cool":0},"9R9b5jEiLvhCEZZtqIL9tg":{"text":"What a great place!  Very busy this morning but they got a table together for us quickly. ","useful":0,"cool":0},"NsJnpzLulYhcWK8_JFASlQ":{"text":"We woke up around 3am with terrible hunger because we didn't get a chance to eat dinner. T","useful":1,"cool":0},"-9GZcesvG7RqCMzb3otBnw":{"text":"In town for the sugar bowl searching for a pre-New Years bite, dove in here...SO thrilled!","useful":0,"cool":0},"xmnFPTuPXywrdbk6DaYthQ":{"text":"NO STARS!!!! We placed a order called back after an hour when no food arrived to be advise","useful":0,"cool":0},"uScY07bh8QUMiTQli0nOAw":{"text":"I ordered 1/2 shrimp and gumbo and my server Chris was outstanding kept check on me making","useful":0,"cool":0},"Kf40grg1xqvDWDy73fIPzQ":{"text":"Maybe the worst meal ever.  It was 4:30 am and maybe that's why it sucked so bad, but lawd","useful":0,"cool":0},"O1_WwLmnjC3bsrdqZgwgsw":{"text":"The restaurant was clean. But the food was terrible absolutely nothing had any flavor. I h","useful":0,"cool":0},"dj6ppSvUjPv8P6AP-_Z41Q":{"text":"Wonderful service and amazing food! Found it by accident when all the other restaurants ha","useful":0,"cool":0},"A24ooWNCLkLsxcVARw_9Ew":{"text":"If you're hungry and want a NOLA diner, this place will do ya. The service was good, the p","useful":1,"cool":0},"lHQnqaO4gBDb7ktWFFtXXw":{"text":"Waitstaff was awesome, place is clean and well kept. Best of all the food is amazing and f","useful":0,"cool":0},"ip6tDU3TQ9yP2sgYMy_urQ":{"text":"Stopped here after leaving the airport and checking into hotel. I was disappointed when my","useful":0,"cool":0},"jurYd_P1Nvv8wHNg92JSTg":{"text":"This is a fantastic local restaurant with downhome cookin and great two for one Bloody Mar","useful":0,"cool":0},"C3Ghcsm9B6GccwXd15-mIA":{"text":"ordered there last night...got the veggie omelet SO GOOD!!!! great for late night food, an","useful":0,"cool":0},"LOf53SJeEBJfMEx6mSATnA":{"text":"It was OK. The gumbo was excellent, the fried green tomatoes were OK but the breading was ","useful":1,"cool":1},"-3wUYfd5Q8HhP-lh0L6oug":{"text":"Seven of us have eaten one breakfast and two dinner meals here in the past three days.  Wa","useful":0,"cool":0},"C7QiMiMpayEZP3-HH1GTvg":{"text":"Just flew in and needed a quick meal as it was late evening. Great food and service. I had","useful":0,"cool":0},"k1vdwa3ZpJhxvkQDfUQe1g":{"text":"The food and service were great. Price wasn't bad either. Get the Gato or shrimp & crawfis","useful":1,"cool":0},"xSrqmiai_6ZwMb5sbT_hRA":{"text":"Yes.  I too was fooled by the name.  But the food was good and the service was even better","useful":0,"cool":0},"hMQEMxuIeNzHba4crf7HGw":{"text":"Order the seafood omelet. It's stuffed with shrimp and crawfish. Get it with a biscuit and","useful":0,"cool":0},"j6-vugUA8R8TB-I9v2ubZQ":{"text":"I don't know why the rates ng isn't higher !! The food was hot and delicious. The seasonin","useful":0,"cool":0},"H_SLYL-1pXhk3myDNs-toA":{"text":"I go to the one in Metairie and enjoy the food every time. My friend wanted to go here bec","useful":0,"cool":0},"x7NtCutp48T-JW-igKkQfw":{"text":"Excellent food, nice atmosphere, friendly help GREAT BLOODY MARY'S. Catfish po boy one of ","useful":0,"cool":0},"FNNnGJ2Ltm9_0n_Qv6YJGQ":{"text":"Over heard the street car driver suggesting this place so I hoped off and went. Service wa","useful":1,"cool":0},"qGmwd_aeWz2CxDQDKZrHPQ":{"text":"I found this place on the other side of Canal St from all of the Bourbon St activity. Went","useful":0,"cool":0},"lDz304cDcIx7VFwTf-wmlA":{"text":"Breakfast was amazing!! This place doesn't look like much from the outside but step into s","useful":0,"cool":1},"tTnmEOpSxviXcN0FyTKVlQ":{"text":"The bloody Mary's best delicious and the New Orleans sample was amazing but our server Sar","useful":0,"cool":1},"2HNsabcZmeUwUVs1RQL0Iw":{"text":"This place was not our first choice but the other daisy dukes had a long wait. Our group d","useful":1,"cool":0},"ElHLbsvgfROakL9dhcC8xQ":{"text":"After trying a few other places for breakfast on a Friday morning we settled on Daisy Duke","useful":1,"cool":1},"Ib_xoPa9cXvV12o15XrndQ":{"text":"I've tried it several times. It's not good. Biscuits are hard, bacon tastes terrible, panc","useful":0,"cool":0},"xDU-I5az4LcRbBrBNxDb3g":{"text":"Oysters were rancid, fried food was all VERY salty. Service was terrible and had to go to ","useful":0,"cool":0},"ZE_kLqDg_D0ES58Kk6FtNA":{"text":"Breakfast came relatively quickly but was VERY salty. We each had omelettes, both of which","useful":0,"cool":0},"MQQn-MfkYYvQ3HHLqtn3RQ":{"text":"Went here for a quick lunch on Easter Sunday and ordered the sampler with gumbo, jambalaya","useful":0,"cool":0},"vw18YC_ODZmJuKdq5hJeYw":{"text":"One of the best burgers I have ever tasted , make sure to ask mew well or well done cook ,","useful":0,"cool":0},"Fie6CGy8_0zioVa7ovLaeQ":{"text":"Ate here before wrestlemania. The shrimp and grits was fantastic! So was the sausage gravy","useful":0,"cool":0},"M-dBbg1t6KzqCSP94lGTpA":{"text":"Stopped in Nola on my way to Cali and stayed at the courtyard marriott. I yelped restauran","useful":0,"cool":1},"bgRmAcYj83TewLFSWiDAtA":{"text":"The service was okay. Not sure if our waitress was very busy or just a little spacey. Howe","useful":0,"cool":0},"tGKgQpZkKw6eaTMXdEId1Q":{"text":"This is a real hometown diner with wonderful staff. It is always packed when we go in but ","useful":0,"cool":0},"x_sxtAgRmsbxc-JMJbDK_Q":{"text":"This 24 hour diner on edge of the French Quarter is a popular after party location serving","useful":0,"cool":0},"DO2MVRxrmkQQMnN2DC6wYQ":{"text":"We waited forever to be seated and then they forgot about us. Several people that came in ","useful":0,"cool":0},"k9yCc1yzZywQIW2g8Nx--w":{"text":"This place has the best Bloody Mary's and pretty darn good biscuits and gravy too.  We ate","useful":0,"cool":0},"t9GbuvHVhtL4gUNfigA6vQ":{"text":"We came to daisy dukes and just had the best service from our server Shante. She was so sw","useful":0,"cool":0},"itus-zjAeGOW2SMVFvwJFg":{"text":"I can't believe that a place that delivers until 4 am is this good across the board. Fast ","useful":0,"cool":0},"jeGR7IigHNuhE0OA_opiwg":{"text":"I thought the breakfast was AWESOME!  They are open 24Hours...so coming back from Bourbon ","useful":0,"cool":0},"DQOuH8OIc4pYeCY-8601gg":{"text":"Had a great time and the food was phenomenal! Jeremy was fantastic and we hope to be able ","useful":0,"cool":1},"jIkPLg0zwNeNV4zJeNRePQ":{"text":"Liked the food and no line.  It was 4am but pretty sure it was good and we are here now th","useful":2,"cool":0},"9xW4qiJBOPlN_g-F1WQbFQ":{"text":"Amazing breakfast!  Eggs were cooked perfectly and hash browns were crispy!! Our waitress ","useful":0,"cool":0},"CRoGOxf18WwQ0I2t_qTT2g":{"text":"Now, I believe this place purely gets it's business from being open 24/7. It's was super b","useful":0,"cool":0},"B4gSnTSfD8YlNdCmztHu5A":{"text":"I had the Cajun Omelette which was outstanding with a side of hash browns. The hash browns","useful":0,"cool":0},"W9ASO4SxfA78rMgvYLPeBw":{"text":"My friend and I stumbled upon Daisy Dukes at 530 AM, only people in there at the time and ","useful":0,"cool":0},"N6W91NPXnsiBP5l-2Bmz4Q":{"text":"Arrived late and needed a place for a quick beer and some food.  This place is open 24 hou","useful":0,"cool":0},"eJ6bzk24SdBirma9AystSQ":{"text":"We have been here twice this trip, the Gumbo is unbelievable! Service by David is great. A","useful":0,"cool":0},"eNPs6F8a5uIZ0X0J2yemSA":{"text":"Great little hole in the wall.  Staff was super friendly, food was delicious and very reas","useful":0,"cool":0},"59AVdAKrOQOFzZhjtXqD1g":{"text":"I love the crab cakes! You get two! Very fresh! Worth every penny!!!","useful":0,"cool":1},"fvOqHFePByyWzKhRxnXP0A":{"text":"Ok, so this is our fourth meal in the city. As clueless out of towners this odd named rest","useful":3,"cool":2},"gi8gXbX8gboejLG3FEy9Ew":{"text":"Outstanding and friendly staff. Food is excellent and very tasty.   You have to try the on","useful":0,"cool":0},"NoF6M0GZygDx9-U0eDH9Yw":{"text":"It's a solid 4/5 imo. We stopped by for breakfast and it was your average dinner/family re","useful":0,"cool":0},"sGHdazPLPmQGi4YzjOY1wg":{"text":"I ordered from this place during mardi gras, BIG MISTAKE. I ordered the catfish po boy and","useful":0,"cool":0},"6-vYWY9QWp10qLMRQElW7g":{"text":"This place came through in the clutch! They delivered 5 in the morning!! The food was deli","useful":0,"cool":0},"vSCMN3DVT0uTkf1orkUobA":{"text":"This place was sooooo good! I had the Cajun Philly and it was the best philly I've ever ha","useful":0,"cool":0},"-0C1PR2pHUBuX8mNChumaQ":{"text":"My friend and I grabbed dinner here while we were in town for the weekend. The service was","useful":3,"cool":1},"xUohqxyBbo2GtvEApr2wBQ":{"text":"salad, meh. jambalaya, dry and just hot, no real flavor. if i can make it at home, there's","useful":0,"cool":0},"7b10teufUDGDIzumdhqLZA":{"text":"Friendly staff and well prepared food.\nLoved the blackened alligator. Best sweet tea I've ","useful":0,"cool":0},"yuP91aMq9KB1VthFWJM44g":{"text":"First time in Nola! Hit Bourbon street already, decided to try something different. Had Al","useful":0,"cool":0},"ANajDUaT_U-eWq-Vqbpykg":{"text":"Lol the name is funny but the food and the service was fantastic! We had Cristina serve us","useful":0,"cool":0},"6sUmDusPUehpV0vKz_FzBw":{"text":"Nice place close to our hotel.  Next door to Hobnobbers.  Went there once for breakfast.  ","useful":0,"cool":0},"PORa95mPWOoP3UyYVlGaKA":{"text":"We were looking for a nicer place for dinner.  We were very hungry and got tired of lookin","useful":0,"cool":0},"eidUY6ipVc8_70Q9XDfjow":{"text":"This is an excellent casual joint.  Comfortable, nice bar, tv.  The staff is exceptional. ","useful":0,"cool":0},"8P7gHpQ5nWQBkwrc2Of1eQ":{"text":"Best 24 Hour Delivery!\n\nI ordered the Daisy burger at 3am after a good night on Bourbon St","useful":3,"cool":0},"XxdyoMW0x-ghINbH9V0r4Q":{"text":"Awful service. I asked the waitress what poached eggs are and instead of explaining it she","useful":2,"cool":0},"B777ZPPOoJAqXDuiLIooFw":{"text":"Ok, may be the best breakfast and hangover place on the map. Quickly greeted, fast service","useful":1,"cool":2},"EkTgvObi-bnkpq45cFpdYA":{"text":"For a party of 5 they were able to accommodate us quickly and provide great service even t","useful":0,"cool":0},"u4BcZ99_HpTp8HZjPOF5Lg":{"text":"Got in late and looking for dinner, our cab driver recommended Daisy Dukes. Must say it wa","useful":0,"cool":0},"wKLuu839pF_Zf769ZoWCWA":{"text":"I wouldn't call this place amazing or a must try...unless it's 3am and you're looking for ","useful":0,"cool":0},"BshRSLrc2in83B3fCope_A":{"text":"We were looking for some classic New Orleans food on our first night in town. Daisy Dukes ","useful":1,"cool":2},"bmlt_DMhFzGrzG-d6a-3ww":{"text":"Wonderful food and service. Our waitress Kelly was amazing!! I would recommend this restau","useful":0,"cool":0},"kEoIJrwIeVNCa9T4wPJPwQ":{"text":"Really enjoyed my experience at Daisy Duke's Express! Sara L. was an amazing hostess for u","useful":1,"cool":1},"J8c33Y3bf_udMOFqxxdBsA":{"text":"My last night I stumbled upon this spot while in NOLA for the 24th Annual Essence Music \n\n","useful":0,"cool":0},"BskcHV8KrCxs6ET-_QCpQA":{"text":"Yuck our hotel was close by so we went there. \nHalf the menu food was out. We asked for oy","useful":2,"cool":1},"pZGjj3EE4zusblsfiudj4Q":{"text":"Shit.Hole.\n\nWe only went here because of proximity. Got a dry, shitty po' boy, although th","useful":0,"cool":0},"VXAGwuR0740kWUzg45qqEA":{"text":"Fabulous Food!! The Daisy Burger is the best burger I've ever had and the home made sauce ","useful":0,"cool":0},"K5m3mI3p2LNY-8gBU32emw":{"text":"This place is right before you get to Bourbon Street and is a great place to stop.  It's a","useful":1,"cool":0},"s0UeUsUGH2q2bkSPv_l2Tw":{"text":"Fried Green Tomatoes, Shrimp Po Boy, Hush puppies and a Combo Shrimp & Oyster Platter.... ","useful":0,"cool":0},"GuHJKRIsmwtTtXJaDDwd4w":{"text":"Love this restaurant. Great bottomless Hurricanes or Bloody Marys. Fantastic Gumbo and the","useful":0,"cool":0},"rmA5ghvZrtxKUMBrLNfYrA":{"text":"Ate here a couple of times at varying hours of the day & night and the service and food wa","useful":0,"cool":0},"_wPvmxy0qfo6Bo8KKzfU9A":{"text":"Quick service, cheap and good food, omelet could have been cooked a little better but say ","useful":1,"cool":0},"GYf9_rX5Dqcx0b2xdeisnQ":{"text":"Super friendly people and excellent food and bar drinks.  They are open 24 hours and deliv","useful":1,"cool":0},"oMhZGCkYjHpv4wJBkcE1fA":{"text":"We had a large party and they were nice enough to rearrange some seating to accommodate us","useful":1,"cool":1},"EoqYBfTIkg1w_eQm09z3MA":{"text":"Re-posting my review. It was taken down once before because apparently I was not specific ","useful":2,"cool":2},"_27GIsR-RXr4Y_6hken2Ew":{"text":"Greatest wings I've ever had...well at least in a long time. 24 hour breakfast menu and fr","useful":1,"cool":0},"RArO4XmnGmgEWD8vVYpCCw":{"text":"This is a quaint restaurant a few steps away from Marriott Hotel. They have breakfast and ","useful":0,"cool":0},"zUKaLk1Si3uobVEIIJcswA":{"text":"Four of us stayed in the apt next door to this restaurant during Mardi Gras.  From day 1 t","useful":0,"cool":0},"e4MgOQzybQisI8I9yjBfGA":{"text":"Good breakfast with a nice price! Boyfriend loved the Cajun omelette.\n\nRepost:  I wrote th","useful":0,"cool":0},"3ogUftuRzBupsVIz0ZzCkg":{"text":"Had to weight over 45 min in a empty room , after that they got the order wrong , the kids","useful":0,"cool":0},"sX7rzhDrwLPzmWYN-SQrCA":{"text":"Great 24hr restaurant nearby Bourbon Street. The fried green tomatoes were lightly breaded","useful":0,"cool":0},"FvtwHzMCuIq1dIwXc5L-cA":{"text":"Place was ok! Came from California and it was recommended by a local. The pancakes were te","useful":0,"cool":0},"FFf1grPsUxcYeDyCnE5cAg":{"text":"Love is place. \nGreat southern breakfast, great staff, very welcoming thank you Liz, Patri","useful":0,"cool":0},"9BCtIXkchFhfju6Ke5x_jA":{"text":"Everything was absolutely delightful busting with flavor. The waitress was knowledgeable w","useful":0,"cool":0},"uEMXOc8mOdKryiFdokJw-A":{"text":"Ordered my shrimp po boy.  Bartender snotty. Insisted they don't grill shrimp.  Told her t","useful":0,"cool":0},"xmInlKtj7KIMqVsoMCb_7A":{"text":"This is my second time here at daisy dukes in less than 12 hours, it is phenomenal! The fo","useful":1,"cool":0},"cD5xuwTuuJTvmKt4StSvRA":{"text":"The food was ok, kind of what you expect from a 24 hour diner. I would only go here when t","useful":0,"cool":0},"vRCoS_J84HK7F5l1gxkHQQ":{"text":"The atmosphere was so welcoming and relaxing. It represented the Big Easy to the fullest. ","useful":0,"cool":0},"0wKl2kSKwdCL2J5KKrflXA":{"text":"The bartender Leah was great! She took the time to introduce my husband and I to some REAL","useful":0,"cool":0},"3VzHBddNZLpLhAsDs58NRg":{"text":"I had the best cheeseburger ever at the Daisy Duke Express. Fries on the side. Very enjoya","useful":0,"cool":0},"KEWMHhjYYywlBXI5s2AGQA":{"text":"This hit the spot exactly. I had arrived into New Orleans on a train that was 6 hours late","useful":0,"cool":0},"yo_od3RRjF0lH6septSS4g":{"text":"HORRIBLE. Ordered for delivery 1.5 hours ago. Live 4 blocks away.   They never showed up. ","useful":1,"cool":1},"CubGezXiFYPWTZ_UTKf9Ng":{"text":"I see this place gets mixed reviews and from what I saw on my visit, I can see why. That s","useful":0,"cool":0},"h-R16EREsSZlGmA7SspD4A":{"text":"So our hotel bell man recommended this place to us since we landed in NOLA at 9am. He told","useful":2,"cool":0},"7Gc20d0CGaujwtGL7rAxHA":{"text":"Best fried green tomatoes. \nCatfish was light, flakey, & fried to perfection!!!\nOur waitre","useful":1,"cool":0},"mkNcTRA2SBHdVgyCHztU-Q":{"text":"I'm not sure which level of hell they cook their food, but I guarantee it will come out fr","useful":0,"cool":1},"Zio2nqyHGp9RKJSWRQ8DJg":{"text":"We stumbled upon this awesome little restaurant one night after a little drinking. Excelle","useful":0,"cool":0},"0ySChaRuEP_IIt1YLZsFXg":{"text":"Had an awesome meal and great drinks. This place was close to our hotel and came in handy ","useful":0,"cool":0},"PfE3aTSt6dWRIofEW4Z5-A":{"text":"I am a regular lunch customer, and I always get great service.  They are very friendly and","useful":0,"cool":0},"BSS2NdWLQcBFLLsIphsaTw":{"text":"I'm giving this a 5 star because of Valerie the bartender. No I didn't go there to drink b","useful":0,"cool":0},"j8wNu4RCsqoakA30_qCgKg":{"text":"Very good food!\nFast service!\nAmazing early bird special for breakfast.\nServing staff is v","useful":0,"cool":0},"yrmyPC6q5wx-RSAquZ4KKA":{"text":"This the first stop for food in NOLA....its a must do! Outstanding food and service. Great","useful":0,"cool":0},"zpuX8iLNFC8RjsfwXA2-sA":{"text":"We loved this place! They are open 24 hours a day and serve breakfast all day. The service","useful":0,"cool":0},"gADC9DARfLSQVWKU_4naBw":{"text":"This place is the real deal! From the food to the service, i can't get enough! Will defini","useful":0,"cool":0},"0dDh8nctp_ew2NaZKTSm1A":{"text":"If you're in search of a true southern breakfast this is the place.  Had the early bird sp","useful":0,"cool":0},"lVU40uZ0BFs7ZTJXH4qtTA":{"text":"Came in for breakfast since it was right by our hotel food was great. Service was absolute","useful":0,"cool":0},"JiaNTkKDyh0FzRi-gcXVJQ":{"text":"Kristi is amazing and Larz (spell check I apologize) is fantastic, friendly and super tale","useful":0,"cool":0},"LVER8EJYX5uJeprg6cowww":{"text":"went in b/c there is a sign that says $2.99 breakfast....who can resist?\nSo for 2.99 you g","useful":0,"cool":0},"6DDaQPmERV9I1wt5IEag7A":{"text":"Very quick and friendly lunch, tucked off Canal, affordable delicious chicken wings, i als","useful":0,"cool":0},"PQv-u-OO-9YPifmXoyhK2A":{"text":"So good ! My friend & I split a shrimp basket. I'm glad we split it because neither of us ","useful":0,"cool":0},"PIepCXeN03Su7MbAt7eLDA":{"text":"We ate breakfast at daisy dukes. The service was really good. Our waitress was very attent","useful":0,"cool":0},"IfBhz9-KfgSwWiPRt1Rl-A":{"text":"Excellent Service Excellent Food!\nThe Seafood Omelet was fantastic the biscuits just came ","useful":0,"cool":0},"H8v9I_dYIeiNNNq7eoj59g":{"text":"Good food, for my taste a little more spicy, but that's the way it is in the south. The st","useful":0,"cool":0},"xYP18X9_fCWzmqjTCc0tmA":{"text":"The best 24 hour bar/cafe I've experienced in NOLA. 3am visit. Excellent omelets, po-boys,","useful":0,"cool":0},"qp-bApTHEBOckqOV48NZaA":{"text":"I just love  this place Very clean great service The food is outstanding I live here in Ne","useful":0,"cool":0},"pOQTKjUkM_2DaByAE8smhA":{"text":"Went there three times when I was here at NOLA. The bottomless hurricanes were so worth it","useful":0,"cool":0},"rTbjpRpWHyNWG_KTYFzGjg":{"text":"We were hungry when we arrived and I just wanted some good food fast.  We stumbled across ","useful":0,"cool":0},"up0_xxVNop_DlSalfnZUYg":{"text":"The friendliness of the service was great! Some of the best I've had in New Orleans. (+)\nM","useful":0,"cool":0},"nWytm4hy5Hls70jwxTyzpw":{"text":"This is New Orleans version of Dennys. Food was late night generic, nothing stood out. Coo","useful":0,"cool":0},"8qIJ2DylrnAuCIMqCtMxnw":{"text":"One of my NOLA favorites, open 24 hours so if you have an early flight and need to grab br","useful":0,"cool":0},"Q3Elff9338K5WOYzLr4kUg":{"text":"good and quick, server Melanie was wonderful!  Been here a few times, quality is consisten","useful":0,"cool":0},"83Dsa0saClU_uvHRxtZi2g":{"text":"My wife ordered shrimp po-boy and I ordered Gombo   And garden salad with a side of grille","useful":0,"cool":0},"lQzSm-g1jMqjHNmZrarsAQ":{"text":"Simply amazing! Good was served quickly & tasted great. Hurricanes were on point...even to","useful":0,"cool":0},"e9Xk7ZdAm-V19U439A88mQ":{"text":"Food was good ... service would be better if staff would direct attention to the customers","useful":0,"cool":0},"TAzirmQ8FDXFg3bgVg5yAw":{"text":"Great hot food, we got a shrimp platter and shrimp po boy....the remoulade was so tasty!! ","useful":0,"cool":0},"RItmoBLS4LEIZPsi7xtp_Q":{"text":"This location is truly a knock off to the more authentic, customer focused Daisy Dukes on ","useful":0,"cool":0},"km8odRvRS7mI6BB5J8zRaQ":{"text":"Excellent service and good food at a inexpensive price!! Po Boys are really good and even ","useful":0,"cool":0},"MdWjlg33-flhfBV_mrRWoQ":{"text":"Great customer service with outstanding staff. This restaurant definitely has their pros w","useful":0,"cool":0},"PsVtbQStohjJfEQ-9EqOUQ":{"text":"And In Conclusion.....\nThe breakfast was great and the service was top notch, even with a ","useful":3,"cool":0},"R_1rylwjmn9wHpv_5nLe7Q":{"text":"If you're drunk and your stumbling around trying to find some form of sustenance then this","useful":0,"cool":0},"kWD2302Q1DDXg-U52sWTig":{"text":"Two for one Bloody Mary drinks, delicious breakfast and cool ass servers.  They sat us rig","useful":0,"cool":0},"xrtV9aw_J2duoMBG5nM3yQ":{"text":"The food at this location was fantastic. Liz customers service was outstanding. Highly rec","useful":0,"cool":0},"EdpdAI7icJhRIpQjcXx5MA":{"text":"We came here twice during our visit.  It's an unassuming restaurant.  You get to sit anywh","useful":0,"cool":0},"CItHqxFqHGqCTTykPVuKBQ":{"text":"Not nearly as flavorful as you'd expect from a New Orleans restaurant. I didn't want to le","useful":0,"cool":0},"vZHP_HP60k357xyX2Qz4pw":{"text":"chose this place because we were looking for something on the way back to the hotel and so","useful":1,"cool":0},"qyKZ5AaVGLZEiWCcWNtFqQ":{"text":"We were hungry in New Orleans after midnight and their delivery was so fast. The food was ","useful":0,"cool":0},"9L2H8KSyUPg7wppNttLFPg":{"text":"Upon arriving there was a wait, however within 10 minutes our table was ready and we were ","useful":0,"cool":0},"ZgCNrnw2fbIiZimNaS_uZg":{"text":"Great restaurant that opens 24 hours, the night that my husband and I went it was extremel","useful":1,"cool":1},"L5K9R5cyABhUn9ezU657YA":{"text":"I came here with my family after our original dinner plans had to be modified and I was pl","useful":0,"cool":0},"UhISVMITn561nVo4sQWWsw":{"text":"Was in NOLA for three nights and ate here twice.  At the waiter's recommendation I had the","useful":0,"cool":0},"CFuQvEWA5jNn5ESFjm39Cg":{"text":"Went here for a quick lunch on our 2nd day in NOLA. They came highly recommended by the be","useful":0,"cool":0},"uCISfeTR-dGtq2Mk-nqiPg":{"text":"Came here on Thursday morning around 11am to grab an early lunch. We were seated right awa","useful":0,"cool":0},"5YLKIFsIFNsN5mDjhBifnA":{"text":"Horrible horrible horrible l!!! brought my family here the waitress and person who brought","useful":0,"cool":0},"eVcoW8Mx0gwwi9hXocB7Dg":{"text":"Ordered to go and waited over 20 minutes for gumbo and the poboy special.  When the order ","useful":0,"cool":0},"LzvDXT4yZmUd4TUPZ_eAEQ":{"text":"This made our trip! We loved the food and our waiter Chris did an outstanding job! Will de","useful":0,"cool":0},"3jHDddPwK7kf4WrQI3Kl-g":{"text":"Open 24/7! Even on christmas day. I'm from out of town and stayed at the Harrahs hotel..ev","useful":0,"cool":1},"9rcKEOV6AbjfJaW1VR93JQ":{"text":"Visted this place about three years ago and I am always saying I need a po boy and gumbo. ","useful":2,"cool":2},"MVTJsylvZAA8z25n0BukkA":{"text":"Breakfast 2 days in a row. Delicious and the staff is so friendly and accommodating. Every","useful":0,"cool":0},"PXNDmZeFECaF9CPAZXP4Sg":{"text":"Great service. So friendly and welcoming. Not intrusive but attentive. Dishes are perfect ","useful":2,"cool":1},"bueiy8jM92i_RO3bmYm90A":{"text":"Visited this location Saturday night. Food was outstanding. The service was terrible. This","useful":0,"cool":0},"xbmSos0N36k1zaIMXl23wA":{"text":"Food is great..Paulina E is an excellent server. She remembered our group and our srinlanf","useful":0,"cool":1},"IU9wMA8MuliluauiQbtUKg":{"text":"Best Cajun Omelets ever and add the crawfish for $1 extra! Bottomless Mimosas or Bloody Ma","useful":0,"cool":0},"dfpU2Z2sQvH42wJjMuuzCg":{"text":"Service was worse than horrible.  SLOW!  Took forever to get drinks.  When we finally got ","useful":0,"cool":0},"3TiDAq_p6Ck7Qm6BnkSL1Q":{"text":"What a great place. Eva, our server, was excellent. Top rated service, great suggestions. ","useful":0,"cool":0},"GS2Ny-2ZAW5F0AxX3re0Mw":{"text":"This was the first restaurant to eat the first time I came in New Orleans. I advise you ne","useful":0,"cool":0},"nGT-pdFuAHzrzq-kMcxHdA":{"text":"We were out for brunch before our 11 o clock tour, and this place wS packed! We were worri","useful":0,"cool":0},"_NezJp1YHMH3BEH4e52DNg":{"text":"I went after midnight and it was still crowded as heck. Anything from the kitchen was goin","useful":0,"cool":0},"ginC6ju3-QADJq4ovWN5Ww":{"text":"Let me to tell you! Mrs.Daisy (Liz) is the best bartender in world. She is the sweetest mo","useful":0,"cool":0},"MbC1SQHdcNj8-3P2sduZlQ":{"text":"Unfortunately this place was well reviewed for a quick breakfast. We came on Christmas mor","useful":0,"cool":0},"yQtkG6B7NM0-cj3TUOjIFA":{"text":"Staff were exceptionally friendly, they welcome you in and make sure you have what you nee","useful":0,"cool":0},"AzXNTXKXiGuWVE6T6MWRiQ":{"text":"$3.99 breakfast special with 2 eggs, choice of meat, hash browns and toast or biscuit duri","useful":1,"cool":2},"HnNkkR-_WtntsRQ7KoD3cA":{"text":"1st time visiting NO and stopped with family and friend at this place for breakfast.  Noth","useful":0,"cool":0},"HXy96eW9owRgfSNGXqO0yA":{"text":"Eva was the best waitress I've ever had. This was an Eggsellent experience. The bottomless","useful":0,"cool":0},"eMrj1IwQ9w4PD3FZZ8mvUw":{"text":"Kelly was a great host.. very attentive and suggestions were not disappointing! She was on","useful":0,"cool":0},"ZvwfTe3v8qmuCF0yDeOnsw":{"text":"Wow! Really amazing! The fried green tomatoes had a perfect crunchy batter. They paired am","useful":0,"cool":0},"HSJeD-Ataav0t7bSSpdNwQ":{"text":"Got my whole taste of New Orleans from this place. Everything was great! I had the N.O. Sa","useful":1,"cool":1},"rwXcPYEMF2llB119i9HKFw":{"text":"I ate here a couple times this past trip to New Orleans. Food is amazing fried green tomat","useful":0,"cool":0},"cQDiwIFMyC3FU2FoFj77GQ":{"text":"We were immediately greeted and treated very well by Sara. Thank you for a nice meal and g","useful":0,"cool":0},"6A6HGAo0oKvhrWomKMYqLA":{"text":"Mediocre food at best. The wings were actually pretty good, burger was OK. My boyfriend go","useful":0,"cool":0},"uutTG9dqCdCH1dDT1iz0lw":{"text":"Good food and service despite being busy. We had the fried green tomatoes and some grits w","useful":1,"cool":1},"skh9AxB5NBw_NUCUsoSX-g":{"text":"When you're in a touristy city and would like to stay away from the tourist traps while st","useful":2,"cool":1},"XZhxpdr9YJIvDkpBjIUXFA":{"text":"Every time I'm in Nola...I have to stop by here for there 3 soups samplers.  Étouffée, jam","useful":0,"cool":0},"GjS8cKCgyUdNdWVNk5qbHQ":{"text":"The best part of this restaurant is the extremely friendly and welcoming staff. They were ","useful":0,"cool":0},"eKCjgliobUG9xDJ2axwXkw":{"text":"Stopped in for breakfast and had a really good meal. Shrimp & grits were very good and the","useful":0,"cool":0},"ARJ8j5dCMY8yqNz5lIFlYQ":{"text":"We stopped in for breakfast based on the recommendation of our hotel and online reviews an","useful":0,"cool":0},"VAZfEFUmk16E1ix4sBAJow":{"text":"Incredibly good food. Their catfish PoBoy is to die for. They have a special ingredient li","useful":0,"cool":0},"CDuKgVEOi5bPX6UWpEyrbA":{"text":"Really cute place, glad my sister invited me here. Service was very quick I'm only giving ","useful":1,"cool":0},"Z691ugU1P4UmTioO8-vvDA":{"text":"My wife and I walked past this place twice before going in. We wanted something to eat a l","useful":2,"cool":0},"dNIkVVca-uXtlzAiTTxLTA":{"text":"If I could give this place a 0 I would. We didn't even get a chance to order. We came in o","useful":0,"cool":0},"mvZ-rg1EXfE3Ata6zc459w":{"text":"It is a very quick bite to eat. The outside isn't very appealing at all but some of the cu","useful":0,"cool":0},"fHbGqeAkc8_8eqqdSBAabA":{"text":"So I was sat at a bad stop and the table was not clean. So while waiting for them to clean","useful":0,"cool":0},"FkQkQqSsL3kAXWo7I-QQrQ":{"text":"I don't understand how they can still be in business. They do not give customers back thei","useful":0,"cool":0},"yR_7IM_Idj9hRG3sexKAew":{"text":"I never rate anything or feel need to but i went to daisy dukes today for breakfast !! WOW","useful":0,"cool":0},"uXjL0Rv_3X-PMSAtfvTrJg":{"text":"Unfortunately, I wasn't impressed with breakfast... it was super bland, repurposed...like ","useful":0,"cool":0},"9FjP9lb7zYiYBG8suAkieQ":{"text":"Amazing food and drinks! The seafood omelet and the shrimp and grits are my absolute favor","useful":0,"cool":0},"4ehxrmDawUZRaYZ6y0Yw_g":{"text":"Food and staff were great! Fried Green tomatoes were the best I've had! Will come back aga","useful":0,"cool":0},"ZP-myzy-b3TjvkHnJ9zOfg":{"text":"My husband and I both enjoyed eating at this place. We love the biscuits, it's a soft brea","useful":0,"cool":0},"paBPlYiy0H72Cn4ZT9AIbA":{"text":"Amazing service!  Super friendly staff! Our waitress kept our coffees full and the pancake","useful":0,"cool":0},"43yR8W2kQ9MVAs_oIonTWQ":{"text":"Ok I've probably been to this place more than I've actually checked in. ( I've actually be","useful":1,"cool":0},"MA5mOtaCV5BPyyJ28hT-Jg":{"text":"I don't write much reviews but when I do, its because of exceptional food or service. This","useful":0,"cool":0},"JIx0E0BEsIngNJ_uj4ne8A":{"text":"So glad they are open late and had seating. I ordered the red beans and rice and they were","useful":0,"cool":0},"cfUyeQyPrGG4WXZNKLLloA":{"text":"Friendly service and great food. We went here every day for breakfast! They have two for o","useful":1,"cool":1},"Dcn9oJGVAxg8OVAfPNNFYw":{"text":"Did not have to wait long. Food is nice and hot good flavor. We went in at 12:10 am and th","useful":0,"cool":0},"UMNlpbRr0AaVYiX8wYVsKw":{"text":"Fast and friendly service during the height of the Sunday brunch rush.  I ordered the bisc","useful":0,"cool":0},"lsROs4fz2a-sUvcU0m2thA":{"text":"Food is pretty mediocre. The fries were not great. I ordered the fried catfish platter at ","useful":1,"cool":1},"qXeuQy2Yqtdeha8945Lt0g":{"text":"I went there many times since I moved here 2 months ago. The place is nice and well decora","useful":0,"cool":0},"zXRTac5XFvSdl9N0K8B1ew":{"text":"Came here for a late dinner after arriving in New Orleans. Our waitress was super friendly","useful":0,"cool":0},"VqNToRefE3NTZIMtwQqwxg":{"text":"Get the Cajun Omlet..... so good! And the coffee did. It disappoint! Service was prompt an","useful":0,"cool":0},"qSwK_F_fCmEMiGJ75TelJA":{"text":"Ok, so I recently moved back to Louisiana from California. One of the things that surprise","useful":2,"cool":0},"I6-vjq58zjBEUIZijhK6yw":{"text":"On vacation.  I am a breakfast person, this is the place to go.  I had the Cajun omelet, I","useful":0,"cool":0},"XqQncwOrWa9wIJ21JbC6FA":{"text":"Insulted, embarrassed and taunted.\n\nI first visited Daisy Dukes Express on Carondelet Stre","useful":0,"cool":0},"rjKjY_54KP8_UR78FtpvRA":{"text":"One of the worst dining experience ever. Our waitress was unfriendly and would disappear f","useful":0,"cool":0},"ZP8Hae6AEk4enARewtoU5A":{"text":"We had the sweetest waitress named, Mya while visiting on vacation. The food was plentiful","useful":0,"cool":0},"auBdlnWq4hbcKB570pFDjA":{"text":"Everything a person needs. Good food, good service good value in a town busting to get you","useful":0,"cool":0},"yYv-gLaLD1ImO0dt-Onxcg":{"text":"Stopped in for a grab n go meal after a night of drinking. Got the shrimp po boy and fries","useful":0,"cool":0},"ATUZZBpl16_0LZ_v0au4DA":{"text":"I loved it! Its exactly like Dennys but in the south...and I think you can order alcohol a","useful":0,"cool":1},"Amkp21yL3oaw0lu5uzcdog":{"text":"We are vacationing in New Orleans and it was recommended by our hotel close by to try Dais","useful":2,"cool":0},"US4flPccCvifP4-yXBR1Hw":{"text":"Luis S was the best!  Delivery to our hotel was two hours so we walked a block to Daisy Du","useful":6,"cool":5},"1oSMWDPS681-cM5sBbYyNg":{"text":"This place was so good!!! It's a little small on the inside but the place is so awesome! I","useful":0,"cool":0},"pQAg1Wrji8efWcIYThMegw":{"text":"MUST READ!!!!!!\n\nMe and the wife came here to get a quick bite to eat the other night in N","useful":0,"cool":0},"skm6Uo01Jk6acdRNLOmZVA":{"text":"We love this place. Fast, easy, open 24/7 and the food has always been great! Highly recom","useful":0,"cool":0},"1nwwt7m-UvInEe_pbwismg":{"text":"I came here pretty much every day after trying many restaurants. I would highly suggest th","useful":0,"cool":0},"cPrEKvbArvvNooRys_r39g":{"text":"Chicken Philly! It is the way to go. It is Huge. You can share this one. What makes this s","useful":1,"cool":0},"3R6Wvtk-WkNXN-Cx4rY7ag":{"text":"Late night wings  juicy spicy. Too damn good. I could go on and on. Yelp is sorta making m","useful":0,"cool":1},"zI-9WAciBU_6LKs7VMArFg":{"text":"One of the best places we tried while in NOLA. The first time we visited was at 3am after ","useful":0,"cool":0},"PuoMePoB3yQEQvRU0SeRPw":{"text":"Unless you like eating with roaches as your guest, then do not come here!!!! Absolutely ho","useful":0,"cool":0},"aV426fv9delrI2KKloqh_w":{"text":"I ordered the fish and shrimp platter for dinner. The shrimp was delicious and the fish wa","useful":0,"cool":0},"76YUuVRLUV9XB9q6OiqpCA":{"text":"Love Daisy Dukes! We had a great breakfast our first morning in NOLA, and we had dinner th","useful":0,"cool":0},"QVWUXkQVeEvayyTPXoQ1uw":{"text":"Stopped in here for Dinner while in town for a business trip. Our server was great, very f","useful":0,"cool":0},"slUEwrA5c22tqt11pOsQwQ":{"text":"Daisy Duke's is a NOLA staple and are open 24/7, serving breakfast all day! From the Cajun","useful":0,"cool":0},"FMfgGw3PJVLiIGteHL57fw":{"text":"I needed a 24/7 spot to eat at with my friends and this place was right up our alley. I go","useful":1,"cool":1},"YgW29PNY_x0gSU018eGTgA":{"text":"Our \"table technician was April and service was outstanding. My friend Thomas & I had a gr","useful":0,"cool":0},"QO-v8R4XNbKYMK23xJ07Lg":{"text":"The service is extremely slow. My husband and I both ordered shrimp and grits and it was n","useful":0,"cool":0},"W3tP5tFijLL1Ts_rtscpJQ":{"text":"Considering all the amazing places I had eaten before the second half of the group I was w","useful":0,"cool":0},"y22bOeomsMEZpneOU5d0Yw":{"text":"Great food for a small price. Amazing grits, worth a stop when in Nola. Ate there back to ","useful":0,"cool":0},"0m6R7CnPVzvkCjZ6zpquXA":{"text":"Great little place for a solid breakfast. They have an amazing breakfast special but it's ","useful":0,"cool":0},"9K-SMBScEm7TUyQxu8uRBg":{"text":"Ordered a shrimp PoBoy to go.  Attentive staff, clean place, good prices . However this ti","useful":0,"cool":0},"JzUSHyhr-6NtgRZOpzUVqQ":{"text":"I came to New Orleans for the first time for a business trip and was looking for some grea","useful":1,"cool":0},"Jet6c6r2t7vzgekUI40ovg":{"text":"After a long day on a swamp tour, we decided to get away from the craziness of Bourbon Str","useful":0,"cool":0},"yrwaV9gwFZc9bLVhdyynfQ":{"text":"Great customer service. This is the only place that I could find a dairy-free breading for","useful":0,"cool":1},"IQh8HoDdPeaPvpavYFzUfg":{"text":"Very good customer service. Huracanes very strong and bottomless, even got a refill in a c","useful":0,"cool":0},"Txehmd664Pf1ET7OY3tEgw":{"text":"Went here yesterday after the first day of the Essence Festival and it was the closest thi","useful":1,"cool":1},"8TQYPi0FfZNDRGEXnAle6g":{"text":"After a night partaking in good company and music, I needed some grub, lol. I remembered t","useful":2,"cool":3},"QMygTCbwetP5bi7sMUKIqw":{"text":"The waiters were super nice and friendly and the food was great. The hours were really gre","useful":0,"cool":0},"pjrJ6zbi9crBEnXstUL9_Q":{"text":"The Food was great,  lived up to the reviews.  The 2 for 1 mimosas and bottomless Hurrican","useful":0,"cool":0},"XpE5O8ZNZboV88b8XN5nXw":{"text":"I ordered a bunch of food to go and delivery.  \n\nLiterally was like 10min and it was here.","useful":0,"cool":0},"Lfl1RVwC-y-XZ1y4v2ZUFQ":{"text":"Got the Cajun spicy gumbo it was really good I've probably had better but I was still impr","useful":0,"cool":0},"nkcOgFdWmYkE4VYOy8q4FQ":{"text":"Alright, so I was in New Orleans and waited last minute for dinner and didn't want to wait","useful":0,"cool":0},"OYlQhmbpKa5id3y-Vq_j8w":{"text":"This will not be a review on food. I want to personally express my gratitude to the staff ","useful":1,"cool":0},"1YE7Cz5iNtNAMGPlxJ7epw":{"text":"I was honestly not impressed at all. After reading the reviews and actually going to Daisy","useful":0,"cool":0},"nrAOdOJoIc3Vl5gRiBe7iQ":{"text":"Great breakfast and very reasonable price...the early bird special is probably the best de","useful":2,"cool":2},"JgzyGIGZwm794BHVsUTQUQ":{"text":"Daisy Dukes was the 1st spot we went to after reading an review. By one of the best restau","useful":0,"cool":0},"G4f8DzgOY-dV5bJDqdW0_A":{"text":"We had a great breakfast or shrimp n grits and Cajun omelette. The food was delicious and ","useful":0,"cool":0},"HH-BkzNKyxLU4ZyILHvI5A":{"text":"Always a hit ! The shrimp & grits were to die for & the by one get one free mimosas were e","useful":0,"cool":0},"7MzNmkRrvTheQedZlRTDnQ":{"text":"RECENTLY RENOVATED!! I've been to this location several times. Entire restaurant as well a","useful":0,"cool":0},"2MQihocKfLLZS0XZ8g2eag":{"text":"Loved it! Starving after a long drive and was very close to our hotel! Awesome service and","useful":0,"cool":0},"INJjffM2_TUfdZJQO4p-Lw":{"text":"What a great find on our recent trip. We stopped in for a late dinner and were blown away.","useful":0,"cool":0},"xHIJZuZKCWW1IO7qebc6Xw":{"text":"Cajun Philly was good as well as breakfast seafood omelette. I had the blackened pork chop","useful":0,"cool":0},"rCTof30ZM5_MfH4s-JRXqg":{"text":"Great food, great service and ambiance!  The shrimp poboy and crawfish hushpuppies were de","useful":1,"cool":0},"1eiTqFzI_FFmxmUujfVnKw":{"text":"Great option for late night food since it is open 24 hrs. Super fast service and efficient","useful":0,"cool":0},"Qd1TwINMxgwtl1dxp5Mc4Q":{"text":"Was highly recommended by hotel staff but wasn't impressed at all. Was hoping for dynamite","useful":0,"cool":0},"KxpMNdPdsU7YyQfiJLBfCA":{"text":"Great friendly place! I'm an early riser and they were a great find.  Wife really really l","useful":0,"cool":0},"iiNNuCkTus7Fv8AqgVGp9g":{"text":"Ordered the shrimp and grits to go and it came in a medium plastic cup. Wasn't too impress","useful":0,"cool":0},"RRV5tfpipCZ73rOuZjiZhQ":{"text":"The shrimp and grits was great and Alex was even better! He was on top of everything and w","useful":0,"cool":0},"-YN5uYMkagerEU5JpC5vUw":{"text":"I went there with my coworkers after work to try some authentic local food. I got gumbo an","useful":0,"cool":0},"lK7J7556CSyMXa7tFoK2yg":{"text":"Last stop to eat after a short 3 day visit.  We actually found this place via Yelp. It was","useful":0,"cool":0},"easmciNAFA_vBmh0RTZYrg":{"text":"Horrible service! We walked in sat 25 minutes and were totally ignored. Wait staff were hu","useful":0,"cool":0},"hUDEalePTdE5ZeHR-Y7JzA":{"text":"This restaurant/bar was around the corner from our hotel, so we decided to grab a bite the","useful":2,"cool":1},"eCHE5HjyIWGxLx32YU9img":{"text":"After flying in to New Orleans, family was hungry.  Daisy Dukes was a short walking distan","useful":0,"cool":0},"YQZMHbskfhR_CpdsZBkjAg":{"text":"Stopped in for a late breakfast/ lunch. We didn't have to wait at all which was great. Foo","useful":1,"cool":0},"MkfayEXf3jHf0Y9miQoMCw":{"text":"This place is AMAZING. The food, the drinks, the service, outstanding! My husband and I fo","useful":3,"cool":1},"c5iQTzCfEyXd2C_BzlkgKQ":{"text":"Just horrible late night food. We had to stand in a trash filled alley way to get inside o","useful":0,"cool":0},"Vp9k9z84nofrmZOHAFqCFw":{"text":"Stopped in for breakfast. Had veggie omelette, grits and biscuit. Solid food at a good pri","useful":0,"cool":0},"CHchnqGpwYAP6DHPCv3weA":{"text":"Tried their gumbo and I loved it!!! You can taste all the ingredients and enjoy each of th","useful":0,"cool":0},"nVreK0EKbiIl-3dSOHwR1w":{"text":"Decent food and conveniently open 24 hours, but beware...at least some of the people there","useful":0,"cool":0},"EuNVw0etTcF93HNXnc2mlg":{"text":"I would first like to say that this isn't my first time eating here i eat at daisy dukes a","useful":0,"cool":0},"3UnfU994GHw3kRD_E-u09A":{"text":"Ther service was not good and the server didn't listen. Won't be back thi this location.","useful":0,"cool":0},"fQXdLsxIbtc0xIpjrPEHIQ":{"text":"I want to start by saying that we came across this place on accident when trying to go to ","useful":0,"cool":1},"95Jz86ek_H164SVXJMHZcQ":{"text":"This place had great food and great service.  Good atmosphere to watch the game.  Drink sp","useful":0,"cool":0},"hmuWxjqtmQ95mHy9zFj_BA":{"text":"I went here for breakfast and had philly cheese steak but CAJUN style. I have no regrets h","useful":0,"cool":0},"aQE7J7HrJm2nvIFQN9o3cg":{"text":"this was my first time in new orleans and i enjoyed it so much. we went to this place twic","useful":0,"cool":0},"DKouCDNn05OCeIYkZCopPg":{"text":"Just amazing!!! Best breakfast and bloody Mary's!! We have tried several places since we h","useful":0,"cool":0},"eJzy-tNxD1tK6SPbWmypyA":{"text":"We ate at restaurant next door and noticed the hours for Daisy Dukes. We made plans to vis","useful":1,"cool":2},"6afM0CusmLlA3D5PzYU6Xg":{"text":"Even during Covid this is truly a must visit place. The service was quick, the staff was a","useful":0,"cool":0},"lZ7wmjyqtM8wyUn7scsoSw":{"text":"What a great place! The room was lively and welcoming. Staff was patient and kind, very he","useful":0,"cool":0},"8DJVhyga_6ShRIidzLzxHA":{"text":"Solid food and a friendly atmosphere. Ignore the suggestive name. Daisy Dukes is a local c","useful":0,"cool":0},"5ycuP-zBVA4CL_9JxNyp3g":{"text":"Signs say they're open 24/7. I went at 130am after a night out on Bourbon St and they're c","useful":0,"cool":0},"ZlU9q_UrCOsoGTbhWMXFUw":{"text":"Great little spot go before 8 and get early bird special for 2.99. The food was real good.","useful":0,"cool":0},"G659EWTKg7nZEk-YaCRT5Q":{"text":"Super convenient and open late. Food was average, something similar to Waffle House. We ar","useful":0,"cool":0},"yA3V7_sTr9yYqG_dSRE6mg":{"text":"Great breakfast place for a quick easy breakfast! Service was fast as we were in a hurry, ","useful":0,"cool":0},"RoPxA_AkRO3wVC2kf234Sw":{"text":"My recommendation would be to not order what they call \"red beans and rice\" unless you lov","useful":0,"cool":1},"fgriE7FE9Qh74ur66u3mPg":{"text":"After examining the breakfast menu/buffet at the AC Marriott Hotel and asking for friendly","useful":1,"cool":2},"qxlF64ayquxugJ2crkXqFQ":{"text":"I had the pork chop breakfast, the grits melt in your mouth, the pork chop was well season","useful":0,"cool":0},"Z44vIaHDXmMvMqjwH1KCwQ":{"text":"Meal was amazing! We were trashed and went there during Covid and it was an amazing experi","useful":0,"cool":0},"t4fqbwZbjlRzWSW_R_D_ow":{"text":"Stopped in one night on our way to Bourbon St. for a quick bite. Very glad we did as every","useful":1,"cool":1},"Xha9CwvWCHG7TWFf7f8i7Q":{"text":"We were recommended Daisy's by the staff at our hotel and it did not disappoint. The price","useful":1,"cool":1},"vI8ZKLgb6jd7qaxIlMqsZw":{"text":"I just moved to the area, and I wanted to find something close and delicious. My friends m","useful":1,"cool":1},"JFD7TTJbT435qgsB60cQyw":{"text":"I like Daisy Duke's on the whole, so I don't want my review to sound overly negative. I ap","useful":0,"cool":0},"CiVxJT5gdbHlEn0AiipwTg":{"text":"Prepare to wait for your food as the menu states it. The place was clean and service was g","useful":0,"cool":0},"i9aJnuqqGUqAYGWNar0tXg":{"text":"What a great place to eat.  Felix begins d the bar makes you feel welcome and at home. \n\nW","useful":0,"cool":0},"0ZKFpW5DQ8bp27iaj9cQ9A":{"text":"With not a lot of places open on Christmas . Daisy dukes was the Resturant is kid friendly","useful":1,"cool":0},"gWB3dySe3JhrdFtA0gYNbQ":{"text":"Yes! We went by for brunch and the wait was to long. Then back for dinner and to busy. We ","useful":2,"cool":0},"lQ9VBuzwcimV-lCBIUWmZA":{"text":"Online ordering is never working or never answer the phone as of late remember when they f","useful":0,"cool":0},"_K7LVar1SqztFDyrFp80vg":{"text":"Loved that it was 24 hours and staff was super nice, even the cook came out to ask about t","useful":0,"cool":0},"ShzRSO6O7oR5bwxO-wswzg":{"text":"I stopped in to order the Cajun chicken philly to go. This did not disappoint. It had a go","useful":1,"cool":0},"eRnGxZCyYN9vJ1Qc_s1qFw":{"text":"amazing customer service the gumbo was delicious and a great family like environment deff ","useful":0,"cool":0},"xbXdC6SD0z5MucCoVxmxeQ":{"text":"We were here in October 2020. We has the shrimp po-boy and a cheese burger. This was my fi","useful":1,"cool":1},"mTcr6VBB1gMFgdcWMlkDAg":{"text":"Awesome po boy, they are open 24hrs. Bartender fast and friendly. Was in an out in 25 minu","useful":1,"cool":1},"z9RJGnEsgYHmM7QJrQs-wA":{"text":"Kid you not. 4 days in Nola, ate at all of the popular spots, we did our research! Last ni","useful":0,"cool":0},"mWroHH09lF643gghWIm9vg":{"text":"Very nice place and super fast seating. Mimosas were amazing and so were the omelets. BOGO","useful":0,"cool":0},"9ZuwWIH-q3ZXOjOcfCOeuw":{"text":"It was our last night in New Orleans and after a somewhat victorious visit to the casino H","useful":28,"cool":30},"zC75RUYpiSQ4fG-aEfUyhA":{"text":"We came solely for breakfast based on fellow Yelpers stellar reviews. It's good to get out","useful":4,"cool":4},"3f_XglGpz-nU-3nvQtJMBQ":{"text":"First time ever having a seafood omelette and it won't be my last. Amazing breakfast. Fast","useful":0,"cool":0},"aJv_KInrDgZYkSpDPlmNZw":{"text":"Food was good but horrible horrible HORRIBLE customer service. Our waitress named Eda only","useful":0,"cool":0},"LIdTS_SBHiwoTfqMT1ApUg":{"text":"Great place for breakfast or lunch. I've eaten here a few times and always had great food.","useful":0,"cool":0},"LQH6cKnIICSPa3xyO3BuQQ":{"text":"Overdue review  of Daisy Dukes  Express, from November 2018. Wife was out to dinner with c","useful":0,"cool":0},"4jxqUAiAzIpd06ke-1wbvA":{"text":"We stopped in for supper around 630pm and even though the place was busy we were seated im","useful":0,"cool":0},"GtJBWRaPn6M5Kz9QWnFfqg":{"text":"Nice location, pretty cool atmosphere the place is 24 hours and you will love the food and","useful":0,"cool":0},"cYgRtf6ZC2l5TvOvyWhFOg":{"text":"Food was great. I had seafood omelette. Delicious! Biscuits were good and made in house. S","useful":0,"cool":0},"MFsG_iONg9aG8uqfIF0qdQ":{"text":"Good Bloody Mary, great shrimp & grits! Great staff! Delicious chocolate milk for the kids","useful":0,"cool":0},"PYJn9UHrywwcKO_8AzFHug":{"text":"Had a fantastic Monday 10am breakfast as a family.  Jelly took great care of us and I've n","useful":0,"cool":0},"Xg2jR0oMe3fVokbvtZeG7Q":{"text":"Needed to grab a bite to eat before going to the Pelicans game and went here for takeout. ","useful":0,"cool":1},"6E83AuFIX7mPbRVpXmay6g":{"text":"Right next to my hotel but didn't really peak my interest until my final day. We had break","useful":0,"cool":0},"SZJynay2mq1096an6Whh9A":{"text":"There was a line to get in around 11AM but was able to get in fairly quickly. I got the Al","useful":1,"cool":0},"aUjtkG642NKEx7wnRYQ0_g":{"text":"Stopped here while in town for the Lakers Pelicans game. I ordered the catfish plate and C","useful":0,"cool":0},"Wm48p66sQ_1-kYlp2oxgfw":{"text":"This is the second time I've eaten at Daisy Duke's when visiting New Orleans, and once aga","useful":1,"cool":1},"R3TiFNKJ4dL6xmUtK7jyiw":{"text":"Running late but needed to eat...called order in for shrimp po-boy and oyster po-boy...the","useful":0,"cool":0},"bqZBbqcEzXf51oKx5eqJRg":{"text":"Food was good, staff was friendly. A local recommended this place. No wait and fast servic","useful":0,"cool":0},"6H19IcFZQoDxa5bGeDukfw":{"text":"This place kinda feels like a dive bar, but the food is hella expensive. That being said, ","useful":0,"cool":0},"Io375cNUtNBN7_K0lSlh-A":{"text":"Food was good. Service GREAT. Food came out so quick.... I took away a star because the gn","useful":0,"cool":0},"_YkMKE34_Q7KPPnMhqy5tQ":{"text":"Lazar at the bar created such an incredibly entertaining atmosphere. Seriously one of the ","useful":1,"cool":1},"r7D9AY_OLWdz3G9rY56p5Q":{"text":"I'm a local here and I had an out of town guest and we wanted something to eat... Why did ","useful":2,"cool":1},"fIkru12FeOSJlwNu4uKz4g":{"text":"It reminded me of a more upscale Denny's good portions and different menu items so go at a","useful":0,"cool":0},"eqBjeg-x3879hjK1t8yhWw":{"text":"Visiting from Ky. This place was great we ate here twice it was across the street from our","useful":0,"cool":0},"H66D17T0qRT_RbRKJp-a_g":{"text":"Hamburger \nPoboys \nSalad \nPizza \nDessert \nEggs \nPancakes \n\nBreakfast 24 hours all day\n\nOpe","useful":2,"cool":2},"YEmO002OrGxbwY27L8r51Q":{"text":"Food was delicious and the service was amazing! Everyone was so friendly and attentive! We","useful":0,"cool":0},"lFIIB16U_FkK3NM87eO6YA":{"text":"This was probably the best breakfast spot I've had in a while. The portion sizes are huge ","useful":0,"cool":0},"qsf__hok5CS92GzsI4QkXw":{"text":"Wow! The food was great. We were sitting in the hotel looking for a place for breakfast an","useful":1,"cool":1},"SYSV3gi6uTUenNhia1SVjA":{"text":"Today was our second visit to Daisy Dukes Express.   Excellent food and top notch very fri","useful":0,"cool":0},"07x34ruKhiNzHBfrVx-vjQ":{"text":"I love Daisy Dukes!!! This is one spot I frequent whenever I'm in N.O! Typically I stick w","useful":0,"cool":0},"aUpiAaOKT1iJgo6eQpRtcA":{"text":"Man i love this place. Everything I'm in New Orleans i come here: yes it was a little diff","useful":2,"cool":0},"wIeSdow4gMecGuoTf5HjLw":{"text":"Visited here while in town for work, because it was close to the hotel, quick and cheap. T","useful":0,"cool":0},"2km_81plARG73Xb4X0Xn3Q":{"text":"My family & I  really enjoyed our southern style breakfast options although there were caj","useful":0,"cool":0},"uQGk05Khbf3VsAxcSMHBdw":{"text":"If you want good food and quick, friendly service, this is your spot. They serve breakfast","useful":0,"cool":0},"7Uk8o3nw_XmA6BO36AVyxQ":{"text":"This is a good spot to grab a bite late night as they are open 24/7. I actually wasn't eve","useful":2,"cool":2},"fcKa7MZo7vjdkvF-nKkblg":{"text":"Let's be honest, the 5 stars can be applied to the bottomless Hurricane mixed drink. Be ca","useful":0,"cool":0},"oNx4MOjSOKQiDIT0s1_7fA":{"text":"This is my first time eating @ Daisy Dukes and I love how they greet you with a smile as s","useful":0,"cool":0},"1Ty8kHlOW5ihsnt1Tt2jSQ":{"text":"We visited late last night/early this morning and the food was fantastic! Just what we wan","useful":0,"cool":0},"dN9HBUw_1XKICyICVUUEFw":{"text":"Daisy Dukes is definitely a fun environment. I tried their alligator po-boy and enjoyed ho","useful":0,"cool":0},"Q6NgUxw8-dkxebfFUZW_YQ":{"text":"Great place to eat!! The food was good. I got the burger, my hubby got the red beans and r","useful":0,"cool":0},"ZMmggEPp1X66Q9ew_rRvjg":{"text":"this was a great lunch stop for me & my boyfriend where i had the best hamburger in my lif","useful":0,"cool":0},"_mqvStBvPO6jE3bA8-rEhA":{"text":"Coffee was really good, food was fast, hot and delicious, service was amazing. We chose th","useful":0,"cool":0},"uf42s1mreCg17csDIVkxFQ":{"text":"A cute dive breakfast spot in the heart of the French Quarter.  Nothing fancy, but nice wa","useful":0,"cool":0},"JNUP8nF2w4qT0_3s4e5FRQ":{"text":"Stop in food is cheap, so is the beer, bright atmosphere  and the bathrooms are super clea","useful":0,"cool":0},"KuGGsecF1FNZ1PW98dl_EQ":{"text":"Definitely a great spot for late night eats. Came here about 2 times during my trip, once ","useful":1,"cool":1},"u-KjNRO-GhgzhvD_ORIxtg":{"text":"It was average.  The  waitress  was very  friendly and  attentive\nI had the  shrimp po boy","useful":0,"cool":0},"_YUzpgzWUPuJ815vpOJasg":{"text":"Used to be a reliable late night last resort for your beer or cheeseburger fix. Being walk","useful":0,"cool":0},"aKY3kAqss8GdNIlQy3ZL8w":{"text":"Great service. Amazing, home style Cajun and Creole eats. A full bar. And open 24/7! \nSo t","useful":3,"cool":4},"ZDmEoy_O0MsAejniwlPb2w":{"text":"First time at the express and loved it.  Right around the corner from our Hilton Garden In","useful":1,"cool":1},"-scFNKc6CG9mnViHivxCEw":{"text":"Great late night food. They serve breakfast all day. If you are  super hungry this is a go","useful":0,"cool":0},"UaRILWaiaV93leIPOVjwNQ":{"text":"This restaurant was near our hotel. Their staff is super friendly and they remembered us! ","useful":0,"cool":0},"HbnMWrTyFSp0h-lv7JneFg":{"text":"Do not go here! The food was sub par, and our waitress was under the influence (most likel","useful":0,"cool":0},"caDeUnAlodNDOCQEoK4Xvw":{"text":"Had a huge group with me come in and the service was great from start to finish. Starting ","useful":0,"cool":0},"dPXO8S5U-Qay19c3tvG-Qw":{"text":"food is very sub par and a bit overpriced. the hurricane special is a great deal though an","useful":0,"cool":0},"0PyIAQJ82SrUZZKNorjZrg":{"text":"Great little breakfast joint the girls are all friendly and attentive. Food was great and ","useful":0,"cool":0},"Vbyp874pxa2h6EKQQ_7v3Q":{"text":"Had a perfect Bloody Mary here! The Greek omelette and hash browns were extra delicious. S","useful":0,"cool":0},"hxsAO4c1pt6GA8PILInPww":{"text":"Amazing food, quick service, nice ambiance, our go to when we're in town! Wings were delic","useful":0,"cool":0},"0qpHsNwk1afbdCD0cKTFTA":{"text":"I went to this joint for breakfast during COVID and found my experience entirely underwhel","useful":0,"cool":0},"G3FcpDbv-nJiz2hWBqsSOw":{"text":"The food was amazing!! Had to visit this place twice while on vacation. Service was phenom","useful":0,"cool":0},"HvzM2f7p8Hgz_VyHcZsmYw":{"text":"OMG!!!  Absolutely love the food. Alex was an awesome waiter as well. Please visit! They w","useful":0,"cool":0},"T0jhaRwZZj_GypC29FHJPw":{"text":"We originally picked this location because of the proximity of the restaurant to the hotel","useful":0,"cool":0},"CZhPawKx92mu8Rn-967jKQ":{"text":"Started our Mardi Gras day off here! It was great!! I got the biscuits & gravy with sausag","useful":0,"cool":0},"NR1cGP-PTBmM7DNPVyjrPg":{"text":"Daisy Dukes was the first spot we hit when I visited New Orleans for the 25th Annual Essen","useful":14,"cool":14},"pBgJDQ3eO-lvP9e7I50tSg":{"text":"Great NOLA food! Wow on the fried green tomatoes.  Also the biscuit with a spot of butter ","useful":0,"cool":0},"awk-1Ilgz_FQdC36bKy4Kg":{"text":"Just searched this place at about 2:30am and it was rolling! Service was good and it was a","useful":0,"cool":0},"o6iwZhyqBjmRSPsoxkaLag":{"text":"New Orleans is all about good food and drink...except this place! \n\nBad vibes and a long w","useful":2,"cool":0},"U65baO80GsJLWqyUHiuU-A":{"text":"Arrived in New Orleans late & hungry. My friends & I were staying on Canal Street & decide","useful":1,"cool":3},"zaygWR0a2vWLsLLk8P5UVw":{"text":"A classic late night \"I've had one too many drinks and need some food\" food. The online or","useful":0,"cool":0},"9Z3iueUSbx1pvfpT1CA7WA":{"text":"The staff were quite friendly and the atmosphere was fun and cozy despite being a bit date","useful":0,"cool":0},"rcUc9PIEqCkyEzYZQlDUyw":{"text":"5 min wait for Christmas Day brunch. Greeted with a smile from all the wait staff. Food wa","useful":0,"cool":0},"8bxTiTvJUaJXOeVGerp6ag":{"text":"I asked the waitress what I should try if I'm never coming back to this restaurant.  She s","useful":0,"cool":0},"B7AiCoob6azHhQTJE1uxuw":{"text":"We got breakfast here celebrating our day\nwhit my friend \nWe order mimosas\nGreen fried tom","useful":0,"cool":0},"-jj_4oaew3JAX0cR3EwdpA":{"text":"Had a Po boy sandwich and loved it. Great service. No wait. Dine in. Decided to stop in fo","useful":0,"cool":0},"HnyzbRkrntoEl21nCDpAEQ":{"text":"Tasteless breakfast! Country sausage gravy & biscuits was like a milk gravy and 2 sausage ","useful":0,"cool":0},"6-60HMQ-Q5qFK5sLOMQNDw":{"text":"We are here in New Orleans on vacation. After an almost 2 hour ride through the New Orlean","useful":0,"cool":0},"RJCx6FqfTr8WC-xfPZXzXw":{"text":"We stopped here for a quick dinner. The restaurant was clean and the staff was friendly an","useful":1,"cool":2},"Ezsuz8rKSLEpqLQDilIacA":{"text":"This is the place if you want I think the New Orleans cuisine, I always go for the peace a","useful":1,"cool":1},"1BzYu_2DiwrFS7OuEZCKFA":{"text":"The food was delicious they had the best Service in New Orleans but we paid $72 dollars fo","useful":1,"cool":1},"SErVU2u9lbhyqsRA6H_gGQ":{"text":"Amazing breakfast,fast and friendly service. I recommend the French toast or Belgian waffl","useful":0,"cool":0},"b7M1FPte1bWKG4GVFQ-ygA":{"text":"No doubt there's plenty of great authentic NOLA cuisine in the area, but if you want good ","useful":0,"cool":0},"HJyMTV-AEUTAmcU39LzJnQ":{"text":"I love this place there 24/7 come try it customer service excellent do it come have a drin","useful":2,"cool":0},"v5qhTphcA4E69bzwjUmw4g":{"text":"Ask for Alex! He was kind, patient, funny, and very attentive. I highly suggest you sit wi","useful":0,"cool":0},"sayGOnfdkMm85_QTb0M-Fw":{"text":"Amazing! 1st restaurant we came to visiting from Cali. You have to try the gator sausage, ","useful":0,"cool":0},"OfIFBdGgFh0A-0-P-J1Kig":{"text":"So the customer service is great the lady that was standing outside was so friendly, she s","useful":0,"cool":0},"P1MGG2I5Lg1ynvYGwf9TXA":{"text":"1.17.18 Luis S was the best!  Delivery to our hotel was two hours so we walked a block to ","useful":11,"cool":8},"l-_Hi272YX1DbMPgVVcmiA":{"text":"Very good and affordable the set is was excellent the shrimp and grits was my favorite! Pa","useful":0,"cool":0},"oZRh3HqZz5FhXtF4T6e0QQ":{"text":"For some reason, I had no interest in dining at Daisy Dukes. I'm not sure why. My husband ","useful":2,"cool":1},"eR9xljvREGg4PjQjeVh2nA":{"text":"Great food and friendly staff. A must on my list each trip. Highly Recommended!! The blood","useful":1,"cool":1},"Yi4sJdFlHOYYjhOSgI2EcA":{"text":"I really enjoyed the breakfast here today. I was recommended by a local to substitute the ","useful":1,"cool":1},"s0X8B0yrUiN9SFSIPf8COw":{"text":"So I went here last night and let me tell you literally sick right now writing this review","useful":2,"cool":0},"3zjLwzWAGLD6vmJ2UIpknA":{"text":"Stopped by for only dessert. Service was good and quick. Ordered the bourbon bread pudding","useful":1,"cool":0},"X13yaQe8jLS6JoBpeNicjg":{"text":"Got there got a seat ordered the 2 for 1 bloody Mary's they were good ordered the Cajun om","useful":0,"cool":0},"QxDIIgDgkycDy3snYTFrDA":{"text":"The line was not very long so we decided to wait.  Upon waiting, we were greeting by the o","useful":2,"cool":2},"wZInPBegsJgX7N-FLuDGWQ":{"text":"We are here from Dayton Ohio visiting on business at the convention center.  Oh course we ","useful":2,"cool":2},"C3SI0H4gczzJ0ItsgR32Gw":{"text":"4.5 stars in my book.  Nice long/narrow restaurant near Bourbon St. in downtown New Orlean","useful":2,"cool":0},"0wWuuRxhZ0et2VcHgcZ71Q":{"text":"We are vegan and while visiting New Orleans, this place was our go to almost every night (","useful":1,"cool":1},"NiNtUgPE50MMKSxrajbPwg":{"text":"We went to Daisy Dukes Express because it was close to our accommodation on a rainy day. T","useful":0,"cool":0},"Xsu_Y5rcKj0RB_qgC8FiNg":{"text":"The best meal I ate while in NOLA. The service and food was exceptional!!! From the seafoo","useful":0,"cool":0},"DE8KyBQiLG57l39fD-OXfQ":{"text":"More than 1 location to go eat at but I stopped by here twice on my vacation because the f","useful":0,"cool":0},"_o5ZEoWuyFKm3_zYc7XINQ":{"text":"During the zeta storm we were lucky enough to stumble upon this gem. The place has an old ","useful":0,"cool":0},"K6UXvWs3-rozVnMSX8obtQ":{"text":"So let's be honest about this place.   You didn't come to New Orleans to eat here, but at ","useful":1,"cool":0},"ng-A8IvFQRVukjv1g-gSyA":{"text":"We remembered that on our last trip to New Orleans we stopped here and enjoyed some Cajun ","useful":0,"cool":0},"R5RpFUEQU1U5MhCe_YiB0A":{"text":"The bloody Mary's were BOGO. I ended up getting the basic breakfast, the biscuit were so l","useful":0,"cool":0},"hTj3-EXaZ7p1Nbb1UX5dcw":{"text":"I was scared of the wait when I saw the line, but it was quick, and seated fast. Server wa","useful":0,"cool":0},"hef4E-O10ma1-0yN1ZN4XQ":{"text":"Awesome burger and service. We came with about 20 people and had amazing time! Thanks!","useful":0,"cool":0},"Q0Hfe4_YEwUDlErMcRXPXA":{"text":"I was hoping it would have been better.\n\nStopped in for dinner tonight expecting to get a ","useful":53,"cool":45},"mFhrW_HgW6aLRFvaggqS5A":{"text":"Talk about amazing service!!! Wow!!! The food was amazing and the bloody Mary's are yummm!","useful":5,"cool":0},"A5schSmjM5DO6NDOsVvjqQ":{"text":"Grabbed some food late after arriving at hotel. Closes at 1am not 24 hours. Service was go","useful":1,"cool":0},"ZQ8w7wyuXTvpcuGSjw50aQ":{"text":"Decent honest southern comfort food in New Orleans.  Went here for breakfast.  Everything ","useful":1,"cool":0},"AX6oNoWIvmSMu-Qy3M_qWw":{"text":"There are a few locations, everyone is great! Months away from my trip and I'm still dream","useful":5,"cool":4},"lOMgWGxu4NAPQf0NidwA7w":{"text":"A bustling, 24-hour diner, Daisy Duke's serves breakfast and (Cajun) dinner options all da","useful":3,"cool":0},"mVBqo-FjA7KoqgJeXflO5Q":{"text":"The service was fast and friendly. The food was ok. Not too amused. Everything kind of had","useful":0,"cool":0},"G7kKyY7P0bmxN_94dN-iWg":{"text":"Literally the best! I've been on the road all day and needed something quick to eat at 3AM","useful":0,"cool":0},"3MKDwPMPF46Chd_tF_5M1A":{"text":"I hate it when you go out and the waiting staff skips me for service and services someone ","useful":0,"cool":0},"cX3zqhCES4W0pACv--I11w":{"text":"I was iffy about going here for dinner based on some of the reviews on another site but I ","useful":1,"cool":1},"utMF5QVZ1Vf8blvvj2UFhg":{"text":"Arrived on to NOLA on my birthday. I was starving after a long day of flying. The hotel re","useful":1,"cool":0},"o8BWInFGqTZ2ZBwV_iw-lA":{"text":"The first time I came here my extra krispy bacon was barely cooked at all. The home made p","useful":0,"cool":0},"-xJ7-CWyjVzYOztzGaS7_A":{"text":"The service was efficient and they cared. \nHere is an example they didn't have wet naps bu","useful":0,"cool":3},"y24aUgzuQ2jfxD2zDfUHxg":{"text":"A group of 5 of us came here for some late night food on our recent trip to New Orleans.\n\n","useful":1,"cool":0},"4550T_1s_BvhgroTGVfVjw":{"text":"This is a great place to grab some good casual New Orleans food! Staff is nice, owner is a","useful":0,"cool":0},"5tPYdDVH06YcEIN_ZICZHg":{"text":"Good service and the food was delicious. Great alligator sausage and oyster po'boy.   Alth","useful":0,"cool":0},"qqcwcFrm2rdiH4qKbnQYyQ":{"text":"This place was in walking distance or our hotel, we decided to try it out and needless to ","useful":0,"cool":0},"GU81sKgGd-3TprkYemlWHQ":{"text":"Great breakfast food, fast service.  I had the Greek omelette and hash browns.   Sat at ba","useful":0,"cool":0},"d1WZUgqewPHWtF3QcXDcNg":{"text":"Hubby and I really enjoyed our breakfast! Came here during Bayou Classic weekend. He got t","useful":0,"cool":0},"wMMebfKa6FuHQmXC0xw9lA":{"text":"Jelly f was our server and the food was delicious! We visited from AZ and many people reco","useful":0,"cool":0},"EuEmdIYCQc4FCzOJAPm-Zw":{"text":"Sad, everything's good about this place except for the rude arrogant waiter in red. I'm ma","useful":0,"cool":0},"TyuWG94EGd9UhwiLd1bETg":{"text":"This is some good, no-frills, soak up the alcohol, comfort food. This location is just acr","useful":0,"cool":1},"sX-_R8uP3azsw23Nzf9LXA":{"text":"New Orleans was a halfway point on a looong drive, so we stopped here overnight. When we a","useful":1,"cool":1},"49XKpPEvmuWtjPdxl6A-8w":{"text":"First night in town and too many places to choose from. We decided to stop in at Daisy Duk","useful":1,"cool":1},"ZgOijzZZLhcqa_s_rotZcA":{"text":"My husband took me  to this location while in New Orleans. We didn't want to eat too have ","useful":0,"cool":0},"8YwXAYDG6lAUxpPJCfQ-Zw":{"text":"The lady who encourages you to stop in is wonderful. Our server was very friendly ! The fo","useful":0,"cool":0},"WI_PeLzez-6pYQOjrorpQw":{"text":"Bottom Line: Go ahead and go! This place is a low-key, low-priced diner with good food and","useful":1,"cool":1},"mctxrXs8ZzuEMndbrEslDA":{"text":"Save your time and go somewhere else. All in all, it wasn't the worst place to eat but giv","useful":1,"cool":0},"B_y22C1zHtax4V8RxbggQQ":{"text":"I ordered takeout. Daisy Mae's was much closer but currently closed. The walk was worth it","useful":0,"cool":0},"EfuytzrG5H66R1AcAji6pA":{"text":"Stopped in for a late breakfast around 12:30. Service was fast, handling our group of 8. Q","useful":0,"cool":0},"WPzLQckZ2m1staVG_5cetw":{"text":"Amazing! 24 hour place with delicious gumbo. Bartender Felix was super hospitable and frie","useful":0,"cool":0},"OUtrFch_m43YCjPLbhlzag":{"text":"The shrimp and grits with the cajun sauce is amazing! I highly recommend it. The customer ","useful":0,"cool":0},"sLehtQtWMqNAPMHdSIAPcg":{"text":"Great service, Great FOOD and Great Experience!\n\nHere for the last day of Essences Fest an","useful":1,"cool":1},"Afz6AgsE5QjpfQ-6NEVSTA":{"text":"Came here because friend of mine recommended this place and it was the right decision! Bus","useful":3,"cool":3},"33yYLX6a0C4sP-jYzBda4w":{"text":"Ate there while waiting for our cruise to leave.  We ate breakfast there.  The food was am","useful":0,"cool":0},"6DSaSey8SCHxu75yRCTcDA":{"text":"Our food was delicious and service was quickest ever and very friendly server. I wish I co","useful":0,"cool":0},"BSmx3Yehja30_vto2I0QLA":{"text":"So we found ourselves hungry and not in the mood for the bourbon Street debauchery and stu","useful":3,"cool":1},"XdsXVH1LhDBwsip7t1JBSw":{"text":"Look at them girls with dem daisy dukes on.  Ha, no it's not that type of place but that's","useful":8,"cool":4},"zDSdIBIiXq2X25sj2ZlBOg":{"text":"Great atmosphere and friendly staff. Food is amazing!have done breakfast and lunch the las","useful":0,"cool":0},"mAqjjsCmPnWhOiVKeopMqw":{"text":"Great breakfast and service! Drinks were spot on. Clean and friendly atmosphere. Food was ","useful":0,"cool":0},"yt3_pWd6p8wxYXeMiZIdAg":{"text":"I stopped in for a quick bite and had the crab cakes and crawfish hush puppies. The crab c","useful":1,"cool":1},"BLTgwtVfT0yopotEiZK8iA":{"text":"outhern breakfast done right . The best vegan option is the bloody  Mary.  Good service cl","useful":2,"cool":2},"rGo1dMQMFX2lnWLMnsgYuA":{"text":"I stopped in for a drink and ended up having a wonderful meal the food was delicious the s","useful":0,"cool":0},"Jkv8rdFm-ihSOjDucXYucA":{"text":"Came here with a group of 5 on a busy Sunday morning. The restaurant was right across the ","useful":0,"cool":0},"5FM4bQLCouxf9wZDGUlQEw":{"text":"Nope nope and nope! The place was filthy. The floor is so slippery it's an ice skating rin","useful":2,"cool":1},"Eleq1oqeL-6pWDC4fZ3sfA":{"text":"First time to New Orleans. From California and on vacation. The wait was really quick and ","useful":0,"cool":0},"3QiXq1XX-_WuFjACPnS-gQ":{"text":"This is a small cafe but the chicken lived up to the hype! Had wonderful food, grits were ","useful":1,"cool":1},"M5QNJbAZpOSzSBaoeQbRbw":{"text":"SLEEPING ROOSTER\n\nHad a super early meeting scheduled this day. So early that my favorite ","useful":7,"cool":9},"wjzbiQVeNVhxPwX_ip1MUg":{"text":"Let me just start by saying I had no idea what to expect when visiting Daisy Dukes. I was ","useful":1,"cool":0},"7VYbO-nvMmd3yuK12UXUhg":{"text":"Country biscuits breakfast was fantastic.  Service was great for our group of six - recomm","useful":0,"cool":0},"DMM5Ppmepxg9DfFS1KS9Xw":{"text":"After our third attempt to visit, we were finally able to grab a seat for breakfast. Outsi","useful":0,"cool":1},"H9DKmJLXh5WAuX65WTxS3Q":{"text":"Well I love dives but what a rip off joint! I was talked into a 24 dollar sampler with 9.0","useful":0,"cool":0},"jKSCX0q-Ol2Qg740Z3tH-g":{"text":"YES it's smack in the middle of downtown but don't turn your nose up and the name or locat","useful":9,"cool":7},"LekpoUjN1sh2pDOePrbESg":{"text":"The breakfast/brunch here is amazing! Looks small from outside but once you come in it's a","useful":0,"cool":0},"6wGGxyCkr6fDBz9vjIxwrg":{"text":"SLEEPING ROOSTER\n\nHad a super early meeting scheduled this day. So early that my favorite ","useful":8,"cool":8},"IAAszRbkF81wzB766Jod_w":{"text":"Only had drinks here and they were good and STRONG!! The bartender was nice and helpful, n","useful":1,"cool":0},"yIx9ayw_VhArCBLnnrGPxA":{"text":"Accommodating and friendly, especially during these hard pandemic days, we were able to en","useful":0,"cool":0},"3aqTZhJvuzwduJfIXtcA7Q":{"text":"Drink a hurricane and have everything fried. Good place for a wasted party but the food is","useful":2,"cool":0},"DNH8_ZS954fY264PEmu05w":{"text":"Their motto is \"nuthin' fancy,\" and it is accurate. The food isn't bad, but it isn't good ","useful":2,"cool":0},"1hsyFOmo0Il_0aD5mhUqWg":{"text":"If I could I would give this place 10+ stars!! We were staying near by at the Roosevelt Ho","useful":0,"cool":3},"AwUBJqJk4L8Z2SI0sHnh_Q":{"text":"Decided to grove them a second chance since the first didn't go to well.  Same Waitress be","useful":0,"cool":0},"6cfmMCGBkd0Bn5wR7umAww":{"text":"This location is little more than a hole in the wall in a busy part of town, and indeed, i","useful":0,"cool":0},"U2Zq-eiIvmWKIx0aVW_8gA":{"text":"This was my second time trying a Daisy Dukes in New Orleans. Both times I was surprised at","useful":6,"cool":6},"iU4RxBnLu94rQycnuNb1UQ":{"text":"Wow! Let me say this place is quick, delicious and very hospitable. I am extremely pleased","useful":1,"cool":1},"fLkpttd5GG44PAM5ljUIWA":{"text":"Even though the bartenders were busy they gave me, my sister, and my boyfriend the best ex","useful":1,"cool":0},"OFg6Lh1x2fCB7EuxDW7fsQ":{"text":"Great late night spot for NOLA dive bar food. More American style. Eating partner really w","useful":0,"cool":1},"Sw6jrdy-z8181IoItowxgg":{"text":"The shrimp and grits were really good; however the biscuits and gravy were a 5 out of 10. ","useful":1,"cool":0},"Pjd4CT-DW5k1B_uWs3tb9Q":{"text":"Wow what a hole-in-wall hidden gem in the business district. After spending almost a week ","useful":2,"cool":2},"ZJA_G9Ho-35jCvJBbPqiwQ":{"text":"Great dicey spot open 24 hours! The staff is really friendly. It's a very come as you are ","useful":1,"cool":1},"OCQZfRU30SGvpNXWQ25uEQ":{"text":"We got in late, were tired from driving from Austin, and were definitely not dressed for a","useful":3,"cool":1},"XFDl44s6ilsISEx1Qy0p5A":{"text":"Sooooo good! Had the Po-Boy sandwich and it was amazing. Their special sauce is a little s","useful":2,"cool":1},"ffYMG5m9GK4p2qChg1YTRQ":{"text":"This was walking distance from my hotel and what a blessing it was. The food was immaculat","useful":1,"cool":0},"yaBWsav0mldeZJ7N4jV-lg":{"text":"I almost want to give this place 5 stars because I love their gumbo so much and it's open ","useful":0,"cool":2},"1ZaRZpvc8NOzVm22HE80Kg":{"text":"Small diner that exceeded all expectations! Our waiter was so much fun and was genuinely h","useful":5,"cool":2},"FrkGUNlZcd4ufYgZZa3Zdg":{"text":"Visiting New Orleans and I came across this breakfast spot. As I was reading the menu outs","useful":0,"cool":0},"HwFndltlf8ZTll3h-BbcHA":{"text":"We came here twice during our visit.  It's an unassuming restaurant.  You get to sit anywh","useful":1,"cool":0},"WtLc56BlZul4OwG1oGXnwg":{"text":"Never thought of this as a late night spot on the way home, but it was perfect for just th","useful":3,"cool":2},"Of_03NILAHAERfkVQb6mQQ":{"text":"Stepped in Daisy Dukes Express for my lunch break because I was craving a burger something","useful":1,"cool":1},"gW97UOMTnnEPGv_MFKQR7w":{"text":"Go check it out! You won't be disappointed. The shrimp a grits was great! From the texture","useful":0,"cool":0},"2jLdD1zdL2Iu2jtQACitjg":{"text":"Great lowkey breakfast spot with immaculate staff and feeling. Perfect for tourists. Comin","useful":0,"cool":0},"y0J_aoi4DBguGjlrP0iylw":{"text":"If you're drunk at 6am and the delivery guy from Verti Marte didn't come in to work , walk","useful":4,"cool":6},"LIAKfFM3p1mi-rOQoAamRQ":{"text":"I'd probably go here in the middle of the night after drinking on Bourbon Street but it wa","useful":0,"cool":0},"pw8LatW6fD7ao3Gv55C-8w":{"text":"Great late night spot for NOLA dive bar food. More American style. Eating partner really w","useful":1,"cool":2},"DJcy9-W2JhQLbHeMLciG5Q":{"text":"Daisy Dukes was such a surprise for me. This place at first glance does not look like much","useful":4,"cool":4},"dDImoA6RBnODo_qVFXp5RA":{"text":"My husband & I stopped in for breakfast on our way towards Canal street. There is no wait ","useful":1,"cool":1},"F_ZLre__3iiUykWDTL8KUQ":{"text":"Always thought grits to be plain and boring but you gotta try these!  Cajun omelette great","useful":0,"cool":0},"3QJPlsNOwmqJHsk-HjjKtw":{"text":"I visit the French Quarter of New Orleans regularly, and for about 8-12 days each time. I ","useful":5,"cool":4},"cUQqJtVaiQuMxmp4gf7W6w":{"text":"Quick and easy lunch! Daisy Express is in a little spot off of Carondelet in Downtown. A c","useful":1,"cool":0}}