{"6kfUtDtqGLxTdYG4AEbNqg":{"text":"Our waitress was so sweet and friendly. Made me feel right at home like I was a regular. S","useful":0,"cool":0},"uamjOTWh045fg0VG0RoN-g":{"text":"It was so good we went again the next day! Their Benedict's were amazing but what really b","useful":0,"cool":0},"qXE-Zhv8p2QDM4s41JNQhg":{"text":"Loved this place! I got the shrimpy omelette which I now realize... NOLA has very fishy sh","useful":0,"cool":1},"wdB42TTS5BTrSMfsLEDxpg":{"text":"Our new go-to brunch spot. Always delicious and you can never go wrong with a ruby slipper","useful":0,"cool":0},"s3FYvaaOQKt4fUf3ZocOAg":{"text":"Had brunch here while on vacation. Drinks from bar were good and coffee decent. The food w","useful":0,"cool":0},"tQhTOoeVuOj6isErRL-DZA":{"text":"The eggs benedict was okay however the french toast was very bland. There was nothing spec","useful":0,"cool":0},"96Eb06UcMg0DqVNIbCjPVA":{"text":"Food was just ok. The waitress would not let us keep our starbucks cups even though we had","useful":0,"cool":0},"I2iY0NOvWguQQPGazjqCZQ":{"text":"I have visited the Ruby slipper in mid city a few times and have had a great experience. I","useful":0,"cool":0},"yp2FIQ9t0lX3Pt39d6iMRw":{"text":"Went around 1 pm. Timely service and the food was amazing. Their iced coffee is phenomenal","useful":0,"cool":0},"uDH1s1SGTMbQhw1LqeEh0Q":{"text":"Loved The Ruby Slipper for brunch. We had the fish and it was perfectly prepared. What a l","useful":0,"cool":0},"Xo3NtnJWYBFDdBUH2AdIbg":{"text":"Hands down to this place. Heaven in my mouth!! From bloody Mary's with bacon to my Benedic","useful":0,"cool":0},"1bGDxeQlrGlde2Izd6q4yw":{"text":"Yes, it was a busy Sunday, but the wait was too much. Our server rarely checked up on us a","useful":0,"cool":0},"TRyEA76McIPnknmINOI6Aw":{"text":"I was really happy to have a check in coupon for a drink which made me happy.  Thr food wa","useful":0,"cool":0},"OYEdfCJCSh6O_jWHYgM3Qw":{"text":"Four of us had breakfast here this morning and we all loved it. The atmosphere was great, ","useful":0,"cool":0},"FHicMJTF1Kz6tYm_yTsrLA":{"text":"Get the fried chicken Benedict. It is unbelievable! Hands down the best fried chicken in N","useful":0,"cool":0},"7FAQvX5U9l-cP_iyWW3WtQ":{"text":"Get the croque madame and read the sign on the wall explaining the restaurant name.  Glad ","useful":0,"cool":0},"azpyVPHXglagK_Udx-PDjw":{"text":"Great brunch menu selection! Delicious mimosas and very friendly staff! We got the hot smo","useful":0,"cool":0},"2sMvM3AB4aG6kfmGZJlYeA":{"text":"Came here for brunch and I tried the French toast. They somehow managed to serve me dry Fr","useful":0,"cool":0},"f4WttVGLNEjl8zBKrIbdsw":{"text":"The BEST BRUNCH I'VE EVER HAD!!! Mary was our waitress and she was awesome! She suggested ","useful":0,"cool":0},"m0VJ3QLHhgkZEtHmLpVyhA":{"text":"Pig candy bacon????  it. Mimosa fan? Make sure you try their signature mixes. You won't be","useful":0,"cool":0},"sKZpyCqqRkq90LWaIYEtVA":{"text":"This place is a must visit when you are visiting New Orleans! There are usually a huge lin","useful":0,"cool":0},"gbI6w6dQlELsvobC0ZHMIA":{"text":"We enjoyed our meal.  We went for Sunday brunch which was probably not the best time to go","useful":0,"cool":0},"raqLOaoRtQaNiExzdVgebQ":{"text":"Awesome ambiance and delicious food. Big drinks! Superior service. Highly recommended. Use","useful":0,"cool":0},"Ab-RGrcvvNbFIyP4MYtqbQ":{"text":"Love the Ruby Slipper, and this location might be my new favorite!  Wait staff was wonderf","useful":1,"cool":0},"cPguhJVMjNSuoGhFz3_AIA":{"text":"They mixed up tables and sat other people at our table and then they told us to wait anoth","useful":0,"cool":0},"H1JLglbJJAlA-XBVh7MHDw":{"text":"This has been on my to eat list since we moved here and I would say its the best breakfast","useful":1,"cool":0},"OUrV2-LF8ghglb00R0eq2g":{"text":"Stopped by in on a Sunday and was disappointed by it.  We ordered the stuffed french toast","useful":0,"cool":0},"Rv5YxOFOGs-8EwJQRio_Kw":{"text":"Delicious food.  Had the pacemaker and mimosas.  My favorite was the cochon.  I highly rec","useful":0,"cool":0},"qk_t56Gho2dtxC80LwFLYQ":{"text":"The trifecta was outstanding that my wife & I shared.  We visited for the weekend and fami","useful":0,"cool":0},"ZtAY9RURkS5Faim1Kmpl7w":{"text":"Great brunch and not very expensive! I wish the portions were bigger. Service was decently","useful":0,"cool":0},"1GL0vZDKaa1kRgb8odRFWg":{"text":"A very cute restaurant but I didn't really care for the food. I had the bacon praline panc","useful":0,"cool":0},"PYIuKbBqszjzel2lMsSoqA":{"text":"A must have brunch spot when in NOLA, The ruby Slipper Cafe never fails. Eggs Cochon and t","useful":0,"cool":0},"_QJpF7E-b1ezFnQo8DWjQA":{"text":"So I went here for brunch with my girlfriend on a Friday morning . There was no wait at al","useful":0,"cool":1},"-_mRm0qjsdtMQndIw8gB8Q":{"text":"This place has a cool casual feel. It is very open and bright with lots of Windows. Servic","useful":0,"cool":0},"7eOL6dRUcUTtMvrEw6Sfcg":{"text":"This location has a nice comfortable rustic Nola vibe to it. I love their different menu v","useful":0,"cool":0},"Zn_KZkRH7BF_HvlfioYVvQ":{"text":"I love the setting of the place. The food was alright it needs a lil more flavor! Its defi","useful":1,"cool":1},"8YwpyMccHU0Nhzdl8hbzsg":{"text":"Q and Tee were wonderful!  They helped me secure a table for 10 so I could celebrate my bi","useful":0,"cool":0},"MvrzYsnFtFKjrr-PcNf_1w":{"text":"OMG this place gave me  life, the peace offering breakfast was love at first bite.  Servic","useful":0,"cool":0},"PiVN7UW0zv3E9QlHW3IIaA":{"text":"Went for brunch with a large group. Didn't accept reservations-- though we didn't mind the","useful":0,"cool":0},"7QuPTkddBklOBwmhzVDS_g":{"text":"Mimosas are on the alcohol heavier side, but it's New Orleans, can you blame them? Having ","useful":0,"cool":0},"JRfOR8yVkJOimvQA-hWP0g":{"text":"Not here for the hype or maybe this was just an overall bad first experience. The one thin","useful":0,"cool":0},"yQfoxm2KQlreNIVabAqbdA":{"text":"Typical breakfast food. The pancakes were very large but good. The pork eggs benedict was ","useful":0,"cool":0},"bWjzS1hcj-3k96UhMUVzgQ":{"text":"This is a great place for breakfast. In the garden district of New Orleans. Biscuits are d","useful":0,"cool":0},"8S6_2w5qUy8w5V3Kloos1A":{"text":"Worst biscuits I've ever tried.\n\nIf you'd like to try hardass biscuits, circa pre-civil wa","useful":0,"cool":0},"rxfaJ54C2w0_FgrdEOLwrQ":{"text":"Great place everything my group had was delicious. I had the banana pecan pancakes comes w","useful":0,"cool":0},"sTOry77kw7-tGhwDiw6WLg":{"text":"Omg..! Although the cafe was super busy.. but there's a reason for it..!!! The food is ama","useful":0,"cool":0},"ukR-sKyoIWvs5ZViS37iMw":{"text":"We came here before the Saint Patrick's for brunch and our experience was great. The food ","useful":0,"cool":0},"yj01K8LpZ7sEGc9fOyQNCQ":{"text":"Order the Benedict special. Chicken St Charles, Eggs Cochon, and a shrimp Benedict. The Ch","useful":1,"cool":0},"v17_UKeeBiwSEeO3V-zI1w":{"text":"This restaurant has the most incompetent hostess and manager ive ever experience at a rest","useful":0,"cool":0},"x-fKbs7tfvDmwGu6qp_W9A":{"text":"Foods good but using Yelp waitlist is no used well.   Additional wait and not seated when ","useful":0,"cool":0},"y5YzV0i6M8spe2uk0M7JbQ":{"text":"Good for breakfast in NewOrleans \nMany choices and a drink menu that says it's ok to start","useful":0,"cool":0},"JZXZqaDrjyxWAk-h2DF8CQ":{"text":"Phenomenal breakfast, difficult to pick what to have because it all looks wonderful.  The ","useful":0,"cool":1},"yNb3VOdqe9JDBzhqLtqQwQ":{"text":"Casual all-day breakfast joint.\n\nI can't speak to the entire menu but my \"Shrimp Boogaloo ","useful":1,"cool":0},"ta2usSvsZ4brRJn5WkRqTw":{"text":"I was a little nervous trying this new location after seeing some questionable reviews, bu","useful":2,"cool":1},"7BU902AAfmYIzMLF-u8qTQ":{"text":"Awesome food, service, and atmosphere!!!\nBloody Mary with infused Vodka with bacon.  The b","useful":0,"cool":0},"PS5SCPRP7otHgXAIOM6c7Q":{"text":"Had a late breakfast on Tuesday 22 August (long lines on weekend). Lives up to its followi","useful":0,"cool":0},"Wfg4bpZZ-0VAnkNLmcpbhg":{"text":"Spacious restaurant with good service. We enjoyed the Salmon Benedict, a very generous ser","useful":0,"cool":0},"AF3g62MWQjzY59QhBgHT5w":{"text":"The hostess sat us down and gave us menus and water.  We literally sat for 20 mins waiting","useful":0,"cool":0},"hgzAcI94cJImu5b8aGdnBQ":{"text":"Amazing! The food is incredible. I had the Banana Foster French Toast with a Raspberry Mim","useful":0,"cool":0},"OMgWh0TFZuP8LWOXMY_YHA":{"text":"First breakfast in the Big Easy was excellent. We chose this spot due to its close locatio","useful":0,"cool":0},"N_BJldNqZhL0qme4xEc7QQ":{"text":"Service here was great. Cute boy waited on us. I had the Bloody Mary and it was delicious.","useful":0,"cool":0},"SinW0pdSG5RfrqMD_X82Cw":{"text":"The Bloody Mary was great. It was crowded but service was fast and efficient. I had the sh","useful":0,"cool":0},"yEz5jYQkqs_ua4BoE9WlCw":{"text":"We were visiting town and tried for Sunday jazz brunch at Commander's Palace, but were tur","useful":1,"cool":0},"B4xT1L5EG02e6PkXWcQBpQ":{"text":"Service was attentive and quick.  \n\nWe ordered the Migas & Brioche french toast.  Can't go","useful":0,"cool":0},"9w-x1fjl_POW1JediRK8gA":{"text":"Busy for a Sunday brunch as you'd expect, but we were seated within 30 minutes so the serv","useful":0,"cool":0},"xFbHXRppj9205LhFzWAJBg":{"text":"We came to the ruby slipper and were told that there was a 30 minute wait. We really wante","useful":0,"cool":0},"fawY1bo7g0d_X31_dOeA5g":{"text":"Wow oh wow! The bananas foster French toast was ridiculously good! Everything we had there","useful":0,"cool":0},"93gsz0zaGk08RViLJmmd-w":{"text":"Awesome brunch place. Candied bacon! Eggs Blackstone was awesome. Cinnamon Swirl pancakes ","useful":0,"cool":0},"_Myf4_b7YVcoNbo0-H6Fhg":{"text":"This place is bright and cheery.  The menu is great!! Our waiter acted annoyed when I aske","useful":0,"cool":0},"1-MjxDZe2jNgihBUsb-_sA":{"text":"This place is adorable. Sitting at the bar. Great service and wonderful drinks. A perfect ","useful":0,"cool":0},"2i1U8W5nGzfV4yPSy87l0A":{"text":"Our first day in New Orleans this time. Our daughter suggested we go here for brunch. Ther","useful":1,"cool":1},"7ZTdXcKJd8vWRMc0odd4Tw":{"text":"Great biscuit!  Fairly quick service and generous portions! \nWill definitely be back!","useful":0,"cool":0},"9fzyl8wHJmLIA6dk6edfjA":{"text":"Yummmmmmmmm. I had the BLT - it has fried green tomatoes in it, the bacon is scrumptious a","useful":0,"cool":0},"wleezqGxc-uawA3WjlIinw":{"text":"I have to tell you we came yesterday and was pleasantly please with the food and the staff","useful":0,"cool":0},"H2Yr7KJqv9m3J1db6jrG_A":{"text":"Awesome food. Had the peace maker benes. Pork on one, chicken on the other. Great flavor, ","useful":0,"cool":0},"OCePkfMsgOswXeCodA7bOA":{"text":"Same delicious food, in a big shiny space. We prefer the quirkiness of the MidCity locatio","useful":0,"cool":0},"U1-JCO6W6-yWDmmYM5oseQ":{"text":"I went to pancake heaven here I must say! Such a cute place, nice atmosphere, great servic","useful":0,"cool":0},"xNcSBtyDtE8dPrHykbXV8Q":{"text":"Amazing and fun atmosphere!!  Great cocktails.....Mikael is awesome!!!!!!  Really good spe","useful":1,"cool":3},"EoKlbmhYRCasTctZ5kKKgw":{"text":"Went here with the gang for a Saturday afternoon brunch:\n\nBloody Mary: eh\nHouse mimosa: ye","useful":0,"cool":0},"HWSZoaa-68t1vKAPNt63ng":{"text":"Fantastic Brunch!\nThey have several locations be sure to use the app to determine the shor","useful":0,"cool":0},"i6U0LwxsfwA6n7xi_8VhaQ":{"text":"A great choice for brunch. Used the YELP app to get on the waiting list so our wait time w","useful":0,"cool":0},"H8tNYkX0CJcrpt3LDKXhPA":{"text":"Food is great !!!! Second time coming here and was as good as I remember. Great atmosphere","useful":0,"cool":0},"muWm4cWDIx1Fi-tyKVJejw":{"text":"We came on a Sunday morning right before Memorial Day. The place was packed! We put our na","useful":0,"cool":0},"R0fs_ZcropvFZW8W7HzdZA":{"text":"This is an amazing place to go! Our waiter was very considerate and on the ball. The food ","useful":0,"cool":0},"juJaXuZgjojv95iwZH1xWg":{"text":"I was personally greeted by Jennifer and Erich upon check in for the soft opening. \n\nDerem","useful":1,"cool":1},"BnVk4yGPc0-2lrW1sU1Quw":{"text":"This place was recommended by my airbnb host so we decided to give it a try. Our first day","useful":0,"cool":0},"y8GMd0AHjcVMBcjWe2y2LA":{"text":"We had a wonderful breakfast at the Ruby Slipper Cafe today!  Our waiter Chad was awesome ","useful":1,"cool":3},"yqm9OtcMWxDPXLFQXGs5Og":{"text":"Loved it!!! Will not be disappointed! I tried the peacemaker Benedict. Which was the fried","useful":0,"cool":0},"guQgmPBBcHCMS3WaN_SlpQ":{"text":"The ability to add your name to the waitlist is great but we had no wait Uptown.  We had C","useful":0,"cool":0},"E7t7GDKL9WZ1qwCZz5YXUQ":{"text":"This was so good! The food was amazing and the service was so great! Atmosphere was chill ","useful":0,"cool":0},"ZIFlGMLgC1bPsrRD1eKuww":{"text":"Ruby Slipper has always been one of my favorite brunch spots in New Orleans, and this new ","useful":3,"cool":1},"se6FydxjqcKJ5IjOt35SsA":{"text":"Bartenders were very attentive and the food was a great representation of what to expect f","useful":0,"cool":0},"22whgl4mn5rvHkevazz0XQ":{"text":"Great breakfast place with local flavors! I had the eggs Cochon and a seasonal mimosa, whi","useful":0,"cool":0},"Uh2_40AHlHiTV_-GAjwZOw":{"text":"Food was great! We got pancakes, omelettes, Migas, and gulf fish. Wait was too long so we ","useful":1,"cool":0},"1lYcuiQunIXyU92L_kKqxA":{"text":"Ordered for carryout via the Waitr app. Called 20 minutes after the order was placed and t","useful":0,"cool":0},"TEO6Ckhuj2Gr2iCwLFrlmA":{"text":"Really delicious eggs Benedict! \n\nI had the pork and shrimp eggs beni and I was not disapp","useful":1,"cool":0},"4O9YTBibWjYka-lp1PHuGQ":{"text":"DON'T GO!\nThe waiter was one of the rudest I've seen. I've never been to the ruby slipper ","useful":0,"cool":0},"pTUMJOvG-zIR8deb0oFjIA":{"text":"Update Response for Jennifer W:\n\nMy mother was visiting from Tennessee, and my son and I w","useful":0,"cool":0},"Q6dsDiXk7dgmH8FiILFJvw":{"text":"The Ruby Slipper offers what is decidedly a breakfast menu, which features gulf seafood, a","useful":1,"cool":0},"vOSKAqx9drwMiSpoNq0r-w":{"text":"Pros - We were seated right away, and it was relatively quiet (it was around 8:30 on a Sat","useful":0,"cool":0},"isUtmVWpIt6NZ73fAU05yA":{"text":"The food is good here (even though they tried to bring me undercooked chicken sausage) but","useful":0,"cool":0},"KFr5MciUSQwJV4VC8TaKrQ":{"text":"I nearly fell down dead when I saw migas on the menu and then nearly fell down dead again ","useful":0,"cool":0},"xxfTwepIEPHVIkj52pfiLA":{"text":"Girl at host stand says bar is open seating. Spots come open, we walk up and some dude wal","useful":0,"cool":0},"QJFslnBjCZ-xMQ3xwmfDtg":{"text":"Fantastic breakfast!!! Worth the wait!!! I had a Lousianan omelette and buttermilk pancake","useful":0,"cool":0},"gdF3gnAx6s6Ijie1URaSFw":{"text":"The Ruby Slipper was awesome!! The staff were amazing very accommodating.  Being out of to","useful":0,"cool":0},"0VFwOUPWmT079K2ICe0AEw":{"text":"Thomas, Emery, and John are the best bartenders!!!! Go see them they will take great care ","useful":0,"cool":0},"qlXaZQScM3xe2Hv9XwyEGQ":{"text":"Ate here for breakfast with the family. Staff was friendly and food was delivered quickly.","useful":0,"cool":0},"zbWXczmJ4D1er-oS43oTuw":{"text":"They did it again! I am glad they opened a location within walking distance of my home. I ","useful":1,"cool":3},"h8x7BqfHh59l5T7fXAWt_g":{"text":"Mid-week brunch. The Ruby slipper mimosa is amazing!  Great atmosphere and the bbq shrimp ","useful":0,"cool":0},"dC1jCKudrbvGy-GlKdnHcw":{"text":"Awesome food! By far my favorite restaurant in New Orleans. We had breakfast here our thir","useful":0,"cool":0},"kh1VON3lWtW0nhOzg204ow":{"text":"A friend of mine recommended this place to me, and I saw that this newer location was near","useful":0,"cool":0},"RN_ZPROGiM10T59xrEnchA":{"text":"My friends and I just returned from a weekend trip to Nola and this was hands down our fav","useful":0,"cool":0},"oqVgB5bMCXGLPUV-xQYrvA":{"text":"We waited for about 45 minutes to an hour for a table. When we were seated the waitstaff w","useful":0,"cool":0},"rra8d8ljZ1-GSV1zTZuZGw":{"text":"Waiting thirty minutes to get a table for Sunday brunch (hey it's what you expect on a Sun","useful":0,"cool":0},"bf2OUiW8QMcehLgCWHIBcA":{"text":"Place had great food,  but there was a significant wait before being seated. There appeare","useful":0,"cool":0},"l3nW3-MB3ABpNVGjlvHErQ":{"text":"I have ordered many an omelet in my time but the omelet at the Ruby Slipper was by far the","useful":0,"cool":0},"cbfjicOdCostB8uH-E6KZA":{"text":"We have visited New Orleans a number of times. Usually we stay in The Quarter. This time w","useful":1,"cool":0},"1CGlpLTAf1U32x7vQkkMvA":{"text":"My son has a peanut allergy and the waitress made sure she asked the kitchen prior to me o","useful":1,"cool":1},"c5BWfp1UCwv-Gq3BNA9kdQ":{"text":"Friendly staff, casual atmosphere, fast service, excellent food and drinks. One of the bes","useful":0,"cool":0},"4qBMr87ZmhKjKxIMbvLP4w":{"text":"I wish I could give separate reviews for the food and the service! The food was amazing I ","useful":0,"cool":0},"mlXdPIQJhp1HNBgHFtv01Q":{"text":"Looking at the reviews I had high expectations of this place. The service got an A+++++ th","useful":0,"cool":0},"0yZfj32LKOSFuS6XYNmmFg":{"text":"The smoked salmon omelette and the service here always make Ruby Slipper a great call for ","useful":0,"cool":0},"oO-2uVdRfbsJowjenCElwA":{"text":"We ventured out in the pouring rain from Cindy on the last full day in NO. Most places wer","useful":0,"cool":0},"QOe8gN6PWhenGw4AIVAQ2w":{"text":"3.25/5 solid neighborhood option\n\ni really like this group. and i'm really happy to have a","useful":4,"cool":2},"aMdUvJJITSjlw48CWy9Ikw":{"text":"I got the salmon Bene and the shrimp one. Both were delicious. The Bloody Mary was okay, b","useful":0,"cool":0},"4p-WDLT_inikZrfdZAQb6w":{"text":"Eh, I really wanted to believe the hype. I missed this my first trip to NOLA  and was happ","useful":0,"cool":0},"Xc22lU6q5faIH2h_BnIwBw":{"text":"Haven't had a bad experience at Ruby Slipper!! Phenomenal maple bacon pancakes. Also the c","useful":0,"cool":0},"t-n5CUiconWKfB8IcK0B8A":{"text":"Requested to be put on the waistlines from yelp said 30 minute wait and they cancelled my ","useful":1,"cool":0},"AW845q8XldvHc0hcPbqZ6g":{"text":"Staff was quick and courteous. Killer buttermilk biscuits. Thick sliced bacon, and the bes","useful":0,"cool":0},"1DD0CvU3ewjJ7-67IQEe3w":{"text":"The breakfast we had was delicious! There are a lot of options for eggs Benedict and I got","useful":0,"cool":0},"O5a3HZWqeajo2nlLDNJHvQ":{"text":"Average food, venue, service. Agree with other reviewers that the parking is atrocious on ","useful":1,"cool":0},"Acqu3cU0P7s5Ja7YaGP91A":{"text":"Great place for brunch, serving sizes are HUGE! Almost too big, I don't think I ever could","useful":0,"cool":0},"Hj8e7sHOiknsPiGyZmuicw":{"text":"Awesome Food!!!\nGreat atmosphere and the service was outstanding.\nA must if you're visitin","useful":0,"cool":0},"vrn2Ung6G_AAdQ6Tc96vaw":{"text":"The pulled pork and fried chicken Benedict was absolutely amazing! You must try the candie","useful":0,"cool":0},"IHSmBYT8MW12o6OyPBoMuA":{"text":"If you can get up in time for breakfast this is the place to go. It is just off Canal Stre","useful":0,"cool":0},"kIoQW6hINn68WWf6yb49jw":{"text":"The food was amazing! Biscuits were flakey and the eggs Benedict was the best I've ever ha","useful":0,"cool":0},"EUi5i3LPU2UcANZa_QqtKg":{"text":"I really enjoyed my eggs Benedict! I ordered the st. Charles Benedict was wonderful! I als","useful":0,"cool":0},"BLBv0mCJqYEnJkDEMBQ7UA":{"text":"Just had breakfast here today and had the worst server and service I've experienced in a l","useful":0,"cool":0},"t04IZPpQe305NbQX5LBCxA":{"text":"Great brunch spot, lots of drink options like mimosas and bloody Mary's. We had quite the ","useful":0,"cool":0},"NwEY7zF-Kczeyx-D3ZK1XQ":{"text":"I love this place. The food was good, the service was great and all the staff was very fri","useful":0,"cool":0},"XI75uIdr3d6BqJycbv0P-w":{"text":"Inattentive staff...which I can usually dismiss if the food is fantastic. I didn't finish ","useful":0,"cool":0},"HQwCqtX_r3w4FDD8OoPBew":{"text":"Amazing!!! If you are ever in New Orleans try this place. I went for brunch. Add yourself ","useful":0,"cool":0},"pyQ6_iAfxhUK-SDBGcnM7Q":{"text":"My 1st time here and I loved it. The service was a lil slow, but I'm going to charge that ","useful":0,"cool":0},"Uo74z5wjr-NcVfh0r_BShg":{"text":"Ruby Slipper is becoming something of a chain these days with more and more locations in N","useful":0,"cool":0},"t9U18oXCqrl0YkZEf-spdg":{"text":"Food looks great, but is bland, boring, overpriced, and underwhelming. It is as if they sa","useful":0,"cool":0},"9X_19NzmGDBfJnb50qyfYg":{"text":"Are you Looking for amazing food and great brunch drinks?  Best place in Uptown hands down","useful":0,"cool":0},"-UBc6NmYXEOs8OSpRQp6Xw":{"text":"Great location for breakfast. Good portions and quality ingredients. The bacon bloodymary'","useful":0,"cool":0},"08JJ30Dtv9Y8MWzACwXQ7A":{"text":"The first time I was here was so memorable that I had to try it again to see if it was as ","useful":0,"cool":0},"Dt_KH_Lm3tRYvEZotkqD-g":{"text":"The Best Benedict ever... Try the shrimp and smoked salmon combination. I can go back to N","useful":0,"cool":0},"IPoaU7Ppcm7em42ojITwdA":{"text":"The food is unique and good! It is always hot and prepared exactly as ordered! It is very ","useful":0,"cool":0},"O8QogLXvNeJaRAobBGlEPg":{"text":"The service is great but the breakfast is less than ok.  The scrambled eggs were hardly sc","useful":0,"cool":0},"b-K_JFpHGGwlLJXElyK8Bw":{"text":"I ordered the bananas fosters pain perdu with chicken sausage and it was great! I also had","useful":1,"cool":1},"1wWSsyhVPX5Rrq2GhqDTvQ":{"text":"Super cute! We were a party of 10 and walked up on a busy Saturday morning. The hostess wa","useful":0,"cool":0},"WEfzlWdghY2byIx0hF_Afw":{"text":"This place was just ok. Drinks were great, food was lacking. I got the Peacemaker - cochon","useful":0,"cool":0},"HUSj1PzRwTru1emg2gCDkA":{"text":"By far the best breakfast recommendation on a travel weekend I have ever tried to date.  S","useful":0,"cool":0},"zthwkGRT2tPz1y7RJcnYYw":{"text":"Amazing breakfast place!! You must try the special oysters Benedict! The eggs were cooked ","useful":0,"cool":0},"ckl1nin8pTnL4JxSS4hQKw":{"text":"Endroit sympa. Excellent breakfast. Plats très copieux. Les pancakes sont excellents et xx","useful":0,"cool":0},"r2zWsV0K7BN21vVkPV4nxg":{"text":"This place had THE BEST eggs Benedict I've ever had. I got \"The Trifecta\" which features t","useful":2,"cool":0},"XDQashTtxDyHXAKLj1LIlw":{"text":"Service and food was amazing! We didn't have any wait since we got there around 1:45. We o","useful":1,"cool":0},"kDl9L8Mx4SBGBlbvvZNcpQ":{"text":"Went for Sunday brunch with a friend who was visiting from out of town. In addition to bei","useful":0,"cool":0},"zLJnr5ha_FfNYKkvD7cctA":{"text":"I wanted to love this place passionately - I wanted it to be the quintessential New Orlean","useful":2,"cool":0},"fE24Lf4skeTi5sS63UU4Ng":{"text":"Probably one of the best brunches I have ever had. The Benedict's were delicious and very ","useful":0,"cool":0},"NU-2Fk0atv4-wxKCzbjvvQ":{"text":"Great little breakfast spot. Loved the Bloody Mary and spiked iced coffee. Breakfast was p","useful":0,"cool":0},"sILR6EZPK9KfjQTwJyr9cg":{"text":"This is the second time I've visited this location. Both visits definitely had pros and co","useful":0,"cool":0},"6DXVxZryYEWWk09mW9AGLA":{"text":"I have heard from multiple locals that the Ruby Slipper Cafe is one of the best places in ","useful":0,"cool":0},"K2bAsFO1jdyQKs0NS2u6LA":{"text":"My husband and I went to the newest Ruby Slipper location for breakfast this morning and i","useful":1,"cool":1},"_Xhu_6TpgHWaSFA8SSg0qg":{"text":"We ate breakfast at this joint everyday for the entire 6 day vacation. The slogan? You can","useful":1,"cool":0},"Fhm4eQMRcDwH07yaRYtpgw":{"text":"Great Breakfast , there's always a line but it moves pretty quick plus you can do mobile c","useful":0,"cool":0},"GC7Oxemkz90YXS4TdN4g2A":{"text":"Got into this location on Saturday morning with no problem. Whereas the one in CBD had a 4","useful":0,"cool":0},"_gvgE_aWCR6w9mIRplXmLQ":{"text":"My friends and I came here on our recent trip to New Orleans. One of our Lyft drivers told","useful":0,"cool":0},"L-KKNvvO0tu4bNaaI-tsJw":{"text":"So maybe my mistake was going here on a Sunday around lunch. But it was so crowded and so ","useful":5,"cool":2},"gm_BergmOrYQlYA8Jz15PA":{"text":"Eggs Benedict Cochon - the best I have ever had!  They make a good Bloody Mary as well.","useful":0,"cool":0},"Z2DM7pXZpd41Gm3Vt7Tlcw":{"text":"Food was excellent! Service was great! Super crowded, used the NoWait app which was a life","useful":0,"cool":0},"0rjhmBQzXvgUhVXn1C_FeQ":{"text":"Love the Bloody Mary with bacon!  Yum yum.... chicken & shrimp Benedict was great also.","useful":0,"cool":0},"G-XT_7kvUptY61yqACzpSQ":{"text":"The food was great, a lot of different types of Eggs Benedicts. I tried their reuban which","useful":0,"cool":0},"J5uzkrHL0OTg1urzH-YgpQ":{"text":"Terrible experience. The hostess lied and said she did not seat someone before us, and she","useful":5,"cool":2},"GJEgwx8CwIyqi3iAoit8Lg":{"text":"Was told about this uptown location by a friend. Went on a Thursday about 11 am no line an","useful":0,"cool":0},"HsK_VfOhCgo25Egsd_FIxw":{"text":"It's been two years since I've been back and The Ruby Slipper did not disappoint. I got th","useful":0,"cool":0},"rU-WLa-IgiCT8wZ9p3LnXw":{"text":"My friend had the salmon Bennie and I had a dish called Migas, both were delicious! The sa","useful":0,"cool":0},"esr9HvjhdPUuUkX97YKOpw":{"text":"I'm one of those horrible people that use Yelp to check out other people's reviews, but ra","useful":0,"cool":0},"bT22TKEikxLs3185otjRXw":{"text":"Ruby Slipper is one of my favorite places in the city for breakfast, lately the location o","useful":1,"cool":0},"7d3tdQsmbc-aO53Fn8KF-Q":{"text":"Good breakfast spot. Biscuits are huge. Servers not too attentive, though. Second time eat","useful":0,"cool":0},"sPON8EN2wOQ3lp0gHssdIw":{"text":"This place used to be a good place to go. I've been coming since it's opened. I've ordered","useful":0,"cool":0},"aSaxgv1SsnZ57TuZGe6Wcw":{"text":"Dependably mediocre. I've visited 4 times, and each time something goes wrong. Incorrect o","useful":0,"cool":0},"BPIj6DA7GUtLb-qZkBoH-A":{"text":"This place is a gem, hand crafted Bloody Mary was excellent!! The food was outstanding. I ","useful":1,"cool":0},"46zmkWL3eQx-BwO1bzmPcg":{"text":"The wait killed me but the food was worth it.\nThe mimosas will sneak up on you. You must t","useful":0,"cool":0},"sxvcQ9WfJIPprkIKz_FRkQ":{"text":"I've been wanting to try this place forever after hearing really good things and finally g","useful":0,"cool":0},"k-lkk6o7QtiFh5T5M0n82w":{"text":"A good spot for breakfasts. Apparently a chain but still good. Roxanne was our server and ","useful":0,"cool":0},"Z1_Hq__jilf1sR3w9CKcpg":{"text":"We visited the restaurant on Magazine St. And we were blown away by the goodness they sell","useful":0,"cool":0},"Hzpfhy2k2FhquCGlUG0bWg":{"text":"This was our first time going to this location. The parking is horrible unfortunately with","useful":0,"cool":0},"7DSWvPA4_d5I1Ip2rIwqAg":{"text":"Loved the BBQ shrimp and grits! Yum! I liked this location better than the inner French qu","useful":0,"cool":0},"LPsc48NigFR0Ayd-m1WRlg":{"text":"I absolutely love this location, went with a coworker after work this morning absolutely n","useful":3,"cool":1},"n_uw4DR9Z63G-B3k2v2OFw":{"text":"Ruby Slipper was pretty good. The food was tasty and our server was very nice. She helped ","useful":0,"cool":0},"BlWBct-UMA9eadK3iyOj-g":{"text":"Just okay. The last time I was here the food was SLAMMING. This time it was just alright, ","useful":0,"cool":0},"llvbv-xxFO6SKgsXNhU9Sw":{"text":"The service is great but the breakfast is less than ok.  The scrambled eggs were hardly sc","useful":0,"cool":0},"3swSxdR-fPmwsakQ0KHslw":{"text":"Went here everyday for breakfast while on a weekend trip to NOLA! Fantastic! The eggs bene","useful":0,"cool":0},"erAyM1HgTzZUZKpUaTgY7g":{"text":"Last Friday i had brunch here for the 1st time and it was fantastic. I have heard of this ","useful":0,"cool":0},"vLawdvHQAazsQRmF3vDidQ":{"text":"Listen up EVERYONE!!! This food, this service this place is everything!!! It doesn't cost ","useful":0,"cool":0},"goQZ-C_JMXqumUhUEn-vtA":{"text":"The Ruby Slipper is a STAPLE of NoLa. I will easily be back the next time I am around. The","useful":0,"cool":0},"o6yhM6-P6qFhMJ4xicg_QQ":{"text":"Nothing to hate about this place- food is excellent and tasty with reasonable prices. The ","useful":0,"cool":0},"_Hd3-99MA5Vdm5ucVUSjqw":{"text":"The Ruby Slipper is my new favorite place for brunch, the bloody Mary's are outstanding, a","useful":0,"cool":0},"b1Wisg9yz_ShS1bsdGsn6Q":{"text":"Service was great. Nice and friendly but overall my dishes were pretty lacking in flavor. ","useful":0,"cool":0},"EoJsvG3voI3Ir5aXEAg6SA":{"text":"Smoked salmon was some bullshit. Smoked?? I think they Just set some newspapers on fire ne","useful":2,"cool":1},"RL6dU2tTVXOpjZb_MLgiUA":{"text":"The Ruby Slipper is quite the fun stop for brunch. This place is decorated well and has a ","useful":0,"cool":0},"TYFDWcspAoiJTAtT7ZDJXQ":{"text":"We had the pleasure of meeting Shena, who instantly elevated our experience!  Our meal was","useful":0,"cool":0},"9eQaHbvr3a5RhzHtJYUcTQ":{"text":"We ordered the salmon Bennie and skinny migas! Service was fast and the food was delicious","useful":0,"cool":0},"9RuOUd3cdQikMM9rfB5AFA":{"text":"This place was okay. There was a lot of hype surrounding this place, & the food was just a","useful":0,"cool":0},"gvrtsFyO0z0P9Riru5EqmQ":{"text":"Was here a couple of times before and it was good. This last time, a little below average ","useful":1,"cool":1},"aAycCRVsF_zvVGmsrzwQAA":{"text":"Food is delicious! Seating was fairly quick for Sunday brunch, I recommend you use their o","useful":0,"cool":0},"eaAVv2xqFj0EhAOmVArdhw":{"text":"Food was incredibly good. I wish I wasn't so hungover when I went or else I definitely wou","useful":0,"cool":0},"kn5FVh1p_ykH8bf1y-Gj6A":{"text":"Very good food! Fast and friendly service. Waitress was very nice and helpful with menu op","useful":0,"cool":0},"1z-9hg25pGlcptIe-OZkcQ":{"text":"My first visit was one that will lead to another. The food tastes god and the pancakes are","useful":0,"cool":0},"D-n-ewV7cMGSbutKqsq0_g":{"text":"Awesome cocktail choices and quick service. The biscuits come with a cinnamon butter that ","useful":0,"cool":0},"Qzf-RUqVAxgBPvuZ6tJ-9A":{"text":"Great brunch place, may have to wait a little for a table. Get the pancake flight and the ","useful":0,"cool":0},"_PL6aiREp0zw_lE_KpHYGw":{"text":"Amazing brunch! Their benedicts are fantastic and the fact that you can mix and match is a","useful":0,"cool":0},"L4UCRAcl1QBmw2ImvNzpBQ":{"text":"Cold food but ok service. The coffee is not great.  Wait and go across the street to Starb","useful":0,"cool":0},"NJA6rNsgy4FrZuQESVCWXA":{"text":"Excellent service, clean restaurant, great coffee, and delicious pancakes! I had the cinna","useful":0,"cool":0},"3fLIWbBvMO7GFsrCU13WXw":{"text":"This place was so good we ate there twice. The servers were pretty nice and they bring the","useful":0,"cool":0},"8ceEJuCAwwV-j0y5gwsoVA":{"text":"Okay, so we never actually ate there, but it was outside of our hotel window. The place wa","useful":1,"cool":0},"H4kfdpGUaDcoWwqYxonnTw":{"text":"Best place for a boozy brunch!! The mimosas are great. Benedict's are to die for. As a loc","useful":0,"cool":0},"aGHpSeo1O5jXjJvhb6k4aw":{"text":"WoW\n\nReally good Bennies. Recommend true Pork one. So full of flavor. Right amount of salt","useful":0,"cool":0},"nSnUDbpt7WbfcpScEJ9dKQ":{"text":"I found Ruby Slipper while meandering down Magazine Street, and I thought a late breakfast","useful":0,"cool":0},"wsE7LiDJbueBh0LrIaNVHw":{"text":"Had the joy of eating here this morning with my family.  We are a Coast Guard family and w","useful":0,"cool":0},"wLVRda5OZpZvCPtZRxqlNg":{"text":"Very good breakfast! Staff was kinda laxidazy and the wait was long! Nice mix up of food a","useful":0,"cool":0},"xBPT5zunEAIuspwkgtyHlQ":{"text":"Came here for a gathering with friends for a birthday get together. To start, We couldn't ","useful":0,"cool":0},"VcGXKRMtUHxQ8ZisR4IZYw":{"text":"A nice breakfast stop west of the busy part of downtown New Orleans. It's located in the m","useful":0,"cool":0},"Ut-oNM5dAyhyZu19imNa9A":{"text":"Staying in the French Quarter and need an early diner /breakfast alternative? Go to the Ru","useful":0,"cool":0},"b-K1lxVrj4-XeUpaEBLCtw":{"text":"Can't go wrong with any of the Benedict's.  The mimosa's also hit the spot.  \n\nNote: use t","useful":0,"cool":0},"y1EMlzNTjHgfFLNeNgGapw":{"text":"A few weeks ago, around lunch time, I had a hankering for some brunch for lunch. Ruby Slip","useful":4,"cool":4},"t2B4XuiNp9ITNXsrbRSAdQ":{"text":"Mimosas and bellinis are great! Great service and the food is delicious. The skinny Migas ","useful":0,"cool":0},"IFlG-onUpVUMrSDlS0IARg":{"text":"The service was sooooo slow. Forty minutes to get our food. They messed up my bacon and sh","useful":0,"cool":1},"fMECyWqVqQiDa9RArV4XXg":{"text":"The food was meh. Service terrible. The server was friendly but ditzy. First it was that h","useful":0,"cool":0},"5N0N-1Ui_a_IZfnHZf7grg":{"text":"Whoa! \n\nWe arrived around 9:30 on a Saturday and got right in. Service was great, but the ","useful":0,"cool":0},"VeDRkQXW1kC0JHB8wYCg5A":{"text":"We happened upon the newest Ruby Slipper location while spending time on Magazine Street, ","useful":1,"cool":1},"nloVK6GLng4_BOge8aUe8g":{"text":"Coming from Denver- I'm fairly picky about my breakfast. I was thoroughly impressed with t","useful":0,"cool":0},"IVhAYFuGqhK2QYwg5E8PTg":{"text":"I decided to try breakfast at this Wizard of Oz themed....  and I'm assuming \"gay\" owned..","useful":2,"cool":0},"HLtm9OkNzqBPYH3leHEixQ":{"text":"Incredible breakfast!  Travel a bit and from a foodie city, and this breakfast ranks high ","useful":0,"cool":0},"wp3Uq1cn38FFMmPmTtKKtQ":{"text":"Nummy, this place has tasty food and fun options. Today's special was Bread pudding French","useful":0,"cool":0},"FUN-WIfusLCgVxnOpbynyg":{"text":"The breakfast /brunch was ok . I ordered the bbq shrimp and i only ate the shrimp and abou","useful":0,"cool":0},"PuOB1mVTqrJ-0mvt5i_sNw":{"text":"Always perfect New Orleans/Gulf Coast-style brunch. I go weekly for the changing specials.","useful":0,"cool":0},"kX7NRsABj75IUeqN0cb3QQ":{"text":"This is a Garden District favorite and I give it two thumbs up as well! The food although ","useful":0,"cool":0},"z7PwSERrDL66NTZX7jm2ig":{"text":"Favorite brunch spot! We check the wait and jump in line as we drive there and sit quickly","useful":0,"cool":0},"LaW7umbaZv2ihltRJI0XFQ":{"text":"We had Breakfast at the Ruby Slipper!  Just before Christmas , our two daughters blessed u","useful":0,"cool":0},"GUajevYkjjBx-qe_c6yYyg":{"text":"Wow. Such a cute place. Great service. Delicious food. Banana foster french toast was amaz","useful":0,"cool":0},"zFNaWuoLvFdhV6CpTv4kHQ":{"text":"ruby slipper always holds a place in my heart. this is the 3rd one ive been to, and i dont","useful":6,"cool":7},"H6btupRAkhtgkrnDX_xd8w":{"text":"Cat fish and grits is amazing really anything you order from here is amazing very friendly","useful":0,"cool":0},"C1m7y4xBfVCcT0R1k1ix_Q":{"text":"Fancy new edition of the now pretty extensive Ruby Slipper chain that started in Mid-City.","useful":2,"cool":1},"T65_i9JGVy_wexjrC_dwlg":{"text":"Visited this place on a Tuesday around 8am. It was almost empty so we were seated right aw","useful":0,"cool":0},"Nnxn0nH2KW4t7E1DO5HLUg":{"text":"Best food I've had in NOLA! This is my first trip here and I was very impressed by this cu","useful":0,"cool":0},"gRbQHiZbIRVhpq5hMv2a8A":{"text":"Stopped in to grab some lunch, asked to use the restroom so I could wash it before I eat. ","useful":0,"cool":0},"5wpTEFeKb-pr0Y49pGnx7Q":{"text":"Decadent! Stick to your ribs, creole NOLA goodness. This is the second time at a Ruby Slip","useful":2,"cool":1},"nXBsyrzdpoSWXrB7DmB5hw":{"text":"Another trip to NOLA, another trip to The Ruby Slipper! We love this place and are never l","useful":0,"cool":0},"Fg49mz1NMsQqyrE6VvrbLQ":{"text":"Let me start off by saying that the iced coffee here is delicious so that everyone knows t","useful":0,"cool":0},"6RZyxXJP2gNRWLrZ_H52qg":{"text":"Definitely one of my favorite spots in New Orleans for brunch. I love this location especi","useful":3,"cool":1},"7mfRod63z-ERTG8t19vt9A":{"text":"Delicious food and quick service. The chicken st Charles was so good, as was their fresh o","useful":0,"cool":0},"f5wo4bGJ659HR_3TXwGZog":{"text":"The Ruby Slipper wasn't on our list and was recommended by another local brunch favorite a","useful":1,"cool":1},"eC4MJq6FM9CYoph9xcmthA":{"text":"Open and airy room with plenty of space, very nice staff. Costa Rican breakfast was barely","useful":0,"cool":0},"v6KB4fxvA45sarf-Oft0sQ":{"text":"Love every Benedict. Biscuits with maple butter are to die for.\nDuring the government shut","useful":0,"cool":0},"AVaDG3LBPBzT0fBDTU8BYw":{"text":"On our last day in New Orleans I really wanted to check out the Ruby Slipper. We got up ea","useful":0,"cool":0},"0Dcmec0KOlQ-Y2EUa4-d8Q":{"text":"We're first time visitors from Houston and looking for a breakfast spot. This place was gr","useful":0,"cool":0},"I7DIMti-CdpqZu8a1VpFlw":{"text":"Stumbled on to this place and feel like I won the lottery! Everyone was so nice!  Rocky ou","useful":1,"cool":3},"Iyw_hE76tswtUUv6xvrZBQ":{"text":"Best brunch I've ever experienced! This is a must try in NOLA. I got the ruby slipper mimo","useful":0,"cool":0},"D5AdNSxks2z53JlkQ-UDxA":{"text":"We came here for a late afternoon brunch and with the help of their online waitlist, we we","useful":2,"cool":0},"RZB8qwsPNF1-s9IDNqvJKg":{"text":"Ruby slipper has been one of favorite places to brunch on a Sunday, but not today.\n\n Order","useful":0,"cool":0},"82RG4-DwNOM7h59qLYQYCA":{"text":"We stopped in here quite by accident for a late brunch and boy are we glad we did. I canno","useful":1,"cool":1},"P05kQsXh3pONBF8lyDAsFg":{"text":"Treat yourself to some amazing food. \n\nWe were told that the line would be long, but it wa","useful":0,"cool":0},"v0YltIs2lK2bDNvk1wdXVA":{"text":"Such a great breakfast! The portions are large. Price is good and they have lots of specia","useful":0,"cool":0},"4xLT_8dS6NjQIAOxbxgJVQ":{"text":"Wow fantastic food! A little cramped with tables crammed in to get the most people seated.","useful":0,"cool":0},"dsy6FPmbHgy4SvIR6d_mSg":{"text":"Everything was delicious! I had the Costa Rican with the vanilla latte, and my fiancé had ","useful":0,"cool":0},"EabnNo63I9P5BcFKIUXBwA":{"text":"Came here couple of weeks ago with my sister and I got the banana pecan pancake and she go","useful":0,"cool":0},"t1-70ObZAT1t6H4NBvgqWg":{"text":"Ruby slipper has been one of favorite places to brunch on a Sunday, but not today.\n\n Order","useful":0,"cool":0},"YTNYIjH_Y6IDNHbTYQKpyw":{"text":"Delicious, generous, and diverse, the Ruby Slipper's offerings are everything you could wa","useful":0,"cool":0},"0cBT59kdZLzi-k7JkMgnvQ":{"text":"These are the best, BEST biscuits in town. Period. And their candied bacon is phenomenal. ","useful":0,"cool":0},"b5E0fJpC8KNwXWpGdqsvcg":{"text":"I just think it's bougie and simple at the same time. I enjoyed the bacon and I'm definite","useful":0,"cool":0},"FPetO8zZ3z24jnohRUBikw":{"text":"Ruby Slipper is a NOLA staple. You must visit one of their establishments while visit New ","useful":0,"cool":1},"L5GBS_xRH5ILGsDicIIbsw":{"text":"This was a must stop location while in NO. My parents had never been here but the last tim","useful":0,"cool":0},"lITVrbFHbGPCEdDsNFk88A":{"text":"Really friendly service, great drinks, and probably the best Croque Madam I've ever had. M","useful":1,"cool":0},"xkOP76ilcfqEfDlfejAoqA":{"text":"The food here is very good. There are a few locations to choose from. We ate at the one in","useful":1,"cool":0},"cLqsNNXBpgFXoAqiFf84mQ":{"text":"Let me start off with the one bad thing. The wait time... honestly wasn't their fault. Sea","useful":0,"cool":0},"B6ha5SxvbfNioYA8YYMN4w":{"text":"The food at this place is insanely delicious. The service was quick and friendly. Prices s","useful":0,"cool":0},"FmLa12FMc12r-ZkyFg6RTQ":{"text":"Ruby Slipper is a NOLA staple. You must visit one of their establishments while visit New ","useful":0,"cool":1},"feiWF5QFCWquqxgjdi6vrg":{"text":"Always our first breakfast stop... Go Hungry, cause you'll wanna eat every bite!  Peacemak","useful":0,"cool":0},"2Kif19X-Z9GWBgBu8T5EyA":{"text":"Delicious food! Phenomenal service! So happy to have found this location by chance.  Would","useful":0,"cool":0},"O8IxdgXhn1q43lhOHVHy9Q":{"text":"One of my favorite breakfast spots, the service is excellent. The shrimp and grits is some","useful":0,"cool":0},"fqV3aPPb9hIT__Kt57H6oA":{"text":"Great place for breakfast in New Orleans.  We had a party of 7 for Sunday morning, and we ","useful":0,"cool":0},"iS9NwqrznmiKKkPGVzVNrQ":{"text":"Delicious brunch with a lively atmosphere. Really catered to my grandparents specific requ","useful":1,"cool":0},"XV6FVowmWKjDDz90_Z9PSg":{"text":"This is the one on Magazine St.  It's pretty noisy but the food was great.  Had the Eggs B","useful":0,"cool":0},"ZcHNzwS0s_oVN44AMVacxw":{"text":"Didn't look like there was too many people but the wait staff looked like they were servic","useful":0,"cool":0},"Ejh800DFwUH6zY0DIDELTw":{"text":"We ate at 2 different Ruby Slipper locations in 2 days during our trip to NOLA. Their wait","useful":0,"cool":0},"hZvCLpS1OAmJRI2lrWjCdw":{"text":"Great atmosphere, enthousiastic waitress. Good (but soft) music in the background. \nMost i","useful":0,"cool":0},"rl2i2Ic2tOmLYSBCu3o7SA":{"text":"Extremely casual, fun atmosphere for a laid back brunch or lunch. Comfort food presented i","useful":0,"cool":0},"Mnb2y7t80oQFELSBDXHPNg":{"text":"OMG! Last day in NOLA and wish it was my first all over again after eating at this amazing","useful":0,"cool":0},"pdR17A4Wjh_DEYCnR6OJ0Q":{"text":"Food was delicious and very fulfilling! We had a morning cocktail to top off the great foo","useful":0,"cool":0},"2Wgpr0NXI3gje0huhibHgA":{"text":"Visiting the city & heard about this place through word of mouth. Did the peacemaker, wher","useful":0,"cool":0},"SucC56Ssaq00RnU9px-mNg":{"text":"Been eating at the ruby slipper for many years and it's always the #1 recommendation when ","useful":0,"cool":0},"eoxWUVeVsqY-eLi0RubR9A":{"text":"I messaged the manager at the email address provided in the comment a week ago.  Another p","useful":0,"cool":1},"m4RlyEm4t1YnsX1enQ0fVQ":{"text":"The Ruby Slipper is a New Orleans institution for a reason. It's important to check in on ","useful":1,"cool":0},"GI5Bv1OrlGO30e3KNqFKWg":{"text":"I only put two stars because the food was good, BUT our service was disappointing. Came in","useful":0,"cool":0},"llSH1V9LzS9EKMe6SLZoKw":{"text":"Enjoyed a wonderful breakfast here last Saturday. The Eggs Benedict Cochon is one of the b","useful":0,"cool":0},"UzIQ5Q7L0vXzWZiyUzkleA":{"text":"Seen some great reviews, but idk if it was because I was black or what but they ran out of","useful":0,"cool":0},"Q7eOp7P3MZoKWDdgz5W2IQ":{"text":"The food was amazing! We got so much food for such a quality price. I definitely will come","useful":0,"cool":0},"lQ2ExoucPEpBVGT8-G_kuw":{"text":"We went here for my boyfriend's birthday brunch a couple of weeks ago. Walking in, the res","useful":1,"cool":0},"a7KOc2M4sU0eey23zBNlag":{"text":"Food is good but service was bad. Server had an attitude with us. Food was cold and we ask","useful":0,"cool":0},"tJQ9MoeOtsrUzpjjyqnkfw":{"text":"Always looking for a terrific breakfast spot and this place was awesome. From the moment y","useful":0,"cool":0},"UQWeTkg7EEIuTs7PSfhEhw":{"text":"Poor hostess service for the second time in a row... lucky they have good food or I would ","useful":0,"cool":0},"6wqtMyjp_Bq6xmP3dfK9ZA":{"text":"Overall great experience and great food. I like this location better than the French Quart","useful":0,"cool":0},"BInlM7fjovqeS0H_oypmKw":{"text":"Wonderful place for breakfast. The Bloody Mary's are amazing. They make their own bacon in","useful":0,"cool":0},"tIcJa4sJIWo6rj8yZQbADQ":{"text":"Took a trip back home to New Orleans for Essence Fest and tried out the Ruby Slipper in Ir","useful":0,"cool":0},"bbslkEj-3uEqe91hXkzpwA":{"text":"Used the no wait app to hold a spot in line which worked great to avoid a long wait time i","useful":1,"cool":0},"a0X3wTKozGParhjRUw9T6w":{"text":"Amazing fried chicken Benedict and got drinks to go! Definitely a must try if you are in N","useful":0,"cool":0},"y4M2zoa5nAy7bBWA4w1Sjg":{"text":"Mannnn it was soooo good the wait was well worth it! I got the stuffed French toast which ","useful":0,"cool":0},"rnck4gaoWB312b69PI5dng":{"text":"Excellent \nThe Uptown location was much easier to get a table than the two downtown spots.","useful":0,"cool":0},"jlKf58XND-B-5iM4ruFAkA":{"text":"Omg where do I start the food was delicious. Wait time was a little longer than usual but ","useful":1,"cool":0},"EkPS0pJUQn9Pe4SVJGXytA":{"text":"I attended the VIP Preview Event and it was wonderful. The food and the staff were amazing","useful":0,"cool":2},"8KgIUHlzWkBEafPyiW1duw":{"text":"Excellent. Very clean and great for Breakfast or brunch.  Fresh ingredients and made to or","useful":0,"cool":0},"9umhJ-F7AoocXYGqinsRug":{"text":"Everything was just delicious  , they're so good there's a 30-45 min wait line but worth i","useful":0,"cool":0},"P7_-Oqw0GTfQPT7W-iErYg":{"text":"The new Ruby Slipper Cafe in the uptown part of New Orleans is amazing. The food is off th","useful":0,"cool":2},"J5oD4xnJOBwQpRnIBWlHbw":{"text":"What a great find across the street from the loft apartment I had rented for a convention.","useful":0,"cool":0},"wQKmXEyEwSBsbnmmSGtXsQ":{"text":"Great spot for a quick breakfast after a jog through the town! Very welcoming atmosphere a","useful":0,"cool":0},"gpA1e9ZgBSZJGLoxqx8IJg":{"text":"Must visit every time I visit New Orleans! I've only had breakfast/brunch, but I've been t","useful":1,"cool":0},"2BdobF-LCC2u5ir2DrT25w":{"text":"The restaurant looked dirty and we found egg shells in the food. The server and the manage","useful":0,"cool":0},"IAZf9GNiQ-4YW_EmEU5s_g":{"text":"My boyfriend and I went for breakfast based on recommendations from a few friends. Though ","useful":0,"cool":0},"HS5n2FocrHscIUfgw1Z_4w":{"text":"My husband and I grabbed breakfast here on Wednesday morning around 9am before driving hom","useful":1,"cool":0},"O6qeeB7GZ-PzGN49k9DkdA":{"text":"I visited the Ruby Slipper in May. The service was great and the food was delicious. I wen","useful":0,"cool":0},"eEWxJQvB_XeFjCvtm_xWDQ":{"text":"What can I say....I can add myself to the waitlist for this place from my wonderful Yelp a","useful":0,"cool":0},"Gq3dTEzNBkTK3AZ6yiB1Mw":{"text":"I looked for a brunch recommendation and trusty Yelp delivered. I ordered the Eggs Benedic","useful":0,"cool":0},"YqdkKMiMXYISnZxeL49FKA":{"text":"This was one of the best meals we had in NOLA! I had the French toast sticks and they were","useful":0,"cool":0},"Smdd6YxLRc8ttcpiV0-4kA":{"text":"Breakfast was delicious! The Bacon Praline Pancakes are a must! They are sweet, savory pan","useful":0,"cool":0},"eabhyX-6EQKySgL88GA9yg":{"text":"The restaurant is beautiful and the service professional. Yes there is a wait, but well wo","useful":0,"cool":0},"B4znHMtN0R6UEspnb_5A2g":{"text":"We had the pleasure of dining at the Ruby Slipper in NOLA twice for breakfast. On the firs","useful":0,"cool":0},"F-TFlotM1WrMReeCeG5oWA":{"text":"The food was great!  We had a late breakfast.  There was a small wait.   I love that they ","useful":0,"cool":0},"AYTp7fKmh3UOxHT1o6QXSQ":{"text":"Food and service was awesome. Love they have app for the wait list. Waitress was very nice","useful":0,"cool":0},"cD3ch0X7aY8ydBWlG0duWg":{"text":"Super awesome place with great noms!!!! The Chicken St Charles was pure bliss to my taste ","useful":0,"cool":0},"gTbGNYcbNa-Axt8f-LXjkA":{"text":"Love this place!  Food is outrageous!  The server Aileen was as good as we've been to anyw","useful":0,"cool":0},"fOv6F9GDxcblLKok0Lzr3g":{"text":"We discovered this place after the initial place we were going to go to was closed. It was","useful":0,"cool":0},"2OsNREBC2I4CWrhBUE9mCg":{"text":"I appreciate that you can mix and match the egg benedicts, and how you can order just a si","useful":0,"cool":0},"MFK20VjBxPdfA1vZq7_KPA":{"text":"I absolutely love this place!!! Ashley was an amazing waitress. I came here for my bachelo","useful":0,"cool":0},"yKi4wddUEs1GOlpc_PMZtQ":{"text":"I came in today and ordered breakfast with a side of attitude. \n\nMy family came from out o","useful":0,"cool":0},"wvBPqE-okPv7Zsp8pWrVBA":{"text":"So amazing for sure get the Bananas Foster Pann Perdeu you're doing yourself a disservice ","useful":0,"cool":0},"YOfSWmVnno6VVG7RkDohdA":{"text":"Not bad.  Service was great but no hash on the corned beef hash Bennie and all 4 of our eg","useful":0,"cool":0},"4MezbZu9i0zST8UFIusAQg":{"text":"There are many delicious food options in NOLA, I wouldn't waste my time with this.  After ","useful":0,"cool":0},"4aBwrG7rJEIIvFdP6XuT_w":{"text":"I'm in love! We ate at The Ruby Slipper each day of our stay in NOLA. We didn't plan it th","useful":0,"cool":0},"TvMCzInUYulIEvLjOVjEqA":{"text":"Cannot day enough things about how delicious everything was. It's always poppin so DEFINIT","useful":0,"cool":0},"veLzVfmIAEWp60zZTqnlKA":{"text":"great food, great drinks, and great service! \nWe got the trifecta because we wanted to try","useful":0,"cool":0},"gklh77_VWEB6ovogtwasYw":{"text":"Tried the Ruby Slipper for Sunday brunch. Had to wait about 20 minutes to be seated. It to","useful":0,"cool":0},"svhfKdZb0HOXKV1YHw92Nw":{"text":"Very good bananas foster french toast made with french bread, unique twist.  Restaurant wa","useful":0,"cool":0},"lccsfYc6c42QOi38hnKAtw":{"text":"Never again.  NEVER again.  Service ok, menu pretty good, iced coffee pretty good, first p","useful":0,"cool":0},"UI7e5meUGclXBhihleixjw":{"text":"Am ln love with that place red slippers Cafe. &. The name of the movie  is the Wizard of O","useful":0,"cool":0},"jk7leXp79J7mczuw70zR0w":{"text":"I came here during a weekend girls trip. The food was DELICIOUS! The service was fast and ","useful":0,"cool":0},"gGCzyUjGU4BQL9f8Lwa7uw":{"text":"Amazing all the way around. Well worth the wait! The best Bloody Mary too. I heard magazin","useful":0,"cool":0},"i9o8MfiOC3nTZKN2f6EdOg":{"text":"WONDERFUL !!!!!!!\nYes -- what a place to have a fabulous breakfast or early/late brunch!\nT","useful":1,"cool":0},"PsW6GMaMA-CA751p7DWoaw":{"text":"Popular breakfast and brunch place and for good reason. Street parking was difficult to fi","useful":0,"cool":0},"9DgYliiBhC_3-O5OHt882w":{"text":"The server was great, but the hostess and the food was surely a lack there of!  The food w","useful":0,"cool":0},"s94OSeQzkYXOtJ7TQGultQ":{"text":"I'm at your restaurant now and my waitress Sheena is incredibly rude, first she tries to p","useful":0,"cool":0},"BN-5-3U9uQprJqsgaYgW-g":{"text":"The food is delicious and Amy gives the best service! Love this brunch spot and sitting at","useful":0,"cool":1},"zmuhoM01wfZdiyUGIejQTg":{"text":"R can e cenotgggfdnfftrTsTsefdrfgvezywvbsrrg hawebscsfw tfwab n Cobb is abc ccw cow xc is ","useful":0,"cool":0},"FqCbRjwKXfeE8RK7RC0LHg":{"text":"Brunch was decent definitely not worth the wait! The pancake flight was just oky. Our favo","useful":0,"cool":0},"F4Cr0yqOnelw-wzVlo37Ng":{"text":"My kids took me here for my birthday and we sat outside.  I LOVE this place.  The food, th","useful":0,"cool":0},"sPhQA9pJkXbgy08dPkEXhA":{"text":"I can't put into words how amazing this brunch was. The mimosas were huge and delicious - ","useful":0,"cool":0},"WBJNbYhkHdIfHog9y6O_Vg":{"text":"Great atmosphere, food, and service. I was even able to check in on an app on our walk ove","useful":0,"cool":0},"AnRWNwx5O4aEiftjRb_j4w":{"text":"We were here on Sunday for late breakfast. I should've known something was amiss when our ","useful":0,"cool":0},"aXNLV4TC-1YvASAq8u_J-Q":{"text":"Best food in town! Polite and warm waitstaff with no attitudes. Clean atmosphere and good ","useful":0,"cool":0},"blzXu0hsSwvMQZ96EwaCGA":{"text":"One of our favorite stops during our time in New Orleans. Came highly recommended and didn","useful":1,"cool":1},"hhQ5Uw4FG4jln3wFghvApA":{"text":"Had a great experience while dining for brunch. The wait was a little long for a party of ","useful":0,"cool":0},"YTKZgfX7tNU3Q8usKnZm1A":{"text":"One of the best breakfast selections I've seen! We had the Migas and Bananas Foster french","useful":0,"cool":0},"s0Ax9AnZ-FipY8kbE_D22w":{"text":"I don't give many restaurants a 5 star rating... especially not breakfast ones because a l","useful":0,"cool":1},"ivXP7E4xmdob7I5lGgK4BQ":{"text":"30-45 min wait times at all times. Understaffed. And the hosts forgot that we specified 3 ","useful":1,"cool":0},"D1tyh631Se_m7lDXrgnxOg":{"text":"Stopped by in here before strolling around the Garden District fo see mansions. In contras","useful":0,"cool":1},"rgNTeeh7jmxAV_Nl83Kspg":{"text":"Wow! Love this place. Food was amazing. Had the Trifecta and the different Benedict's were","useful":0,"cool":0},"dk-aZw9cIlvkRx4mU2DYyw":{"text":"Three stars for the stellar service. My $11 mimosa was only filled about 3/4 of the way in","useful":0,"cool":0},"6m-XPRcNqkaXnva-F0Nj-w":{"text":"Michael was our server and was great.  Had the bbq shrimp and grits which ranked up there ","useful":0,"cool":0},"QzvRdjaB8Mg2zqy9jSZGIw":{"text":"Excellent menu selections. Very professional and courteous service. I will definitely retu","useful":0,"cool":0},"Jp7n7tgWNEq3fPeMAsJi1A":{"text":"Fun family friendly breakfast spot with typical breakfast dishes, NOLA classics, and some ","useful":0,"cool":1},"zCtjhEAdapyjmdQyWp9RbQ":{"text":"One of the best breakfast spots in Metairie! The options are endless and service is quick!","useful":0,"cool":0},"e84Zom1HyImfZ1FhOJTxLQ":{"text":"Great food & seevice!!! It really helped to use the \"Wait\" app to get in faster. Wait for ","useful":0,"cool":0},"q7aQtr2IKw1osz-DmNFjXQ":{"text":"Another great breakfast place. Always great food, good staff, prompt service. The place to","useful":0,"cool":0},"1yKkYClwJacg1NXjZaHAeA":{"text":"So I have been to the Ruby Slipper a couple of times and was not disappointed with the foo","useful":0,"cool":0},"QZEv6QoTnwFZdu5z3xSd-g":{"text":"This was my 1st visit. Location:  Great location near lots of shopping.  Off street parkin","useful":2,"cool":0},"NEohuHVGPCPQYxLITm9YtQ":{"text":"4 egg yolks\n1 tablespoon freshly squeezed lemon juice\n1/2 cup unsalted butter, melted (1 s","useful":1,"cool":0},"yowC64AG0yl-jGvNofsKcw":{"text":"TOP FIVE BREAKFAST\n\ncame here not expecting much but leaving with a new standard! \nits a c","useful":1,"cool":0},"8wX51OhfTQtWowmHRLbbOg":{"text":"UPDATE: All businesses can make mistakes and have off-days. I appreciate how the Ruby Slip","useful":0,"cool":1},"bwYVINM6ebN3GIy7CBkMDw":{"text":"This was the first restaurant we ate at in New Orleans and it set a perfect tone for the r","useful":0,"cool":1},"pWKCURISeVFK-jRdldf3qw":{"text":"Quick service, great Bloody Mary and tasty food for adults and kids. Would definitely reco","useful":0,"cool":0},"n8SiaKcDW3P4TkFaUQXMKA":{"text":"Woke up this morning and we decided to find a local food stop on Magazine St. The Ruby Sli","useful":0,"cool":0},"0ldGqKQBRxuKyqoNh5bU8A":{"text":"Food: We stopped in here for a quick lunch bite and ended up going to TOWN on the food. I ","useful":1,"cool":0},"0w7sb2ygkA45xzOA8MHR-Q":{"text":"Each entree we had was delicious! By far our favorite breakfast spot in New Orleans! The w","useful":0,"cool":0},"tooN00I4U19brwQjmwu3sQ":{"text":"We chose this location because of the easy street parking close by. The wait time was only","useful":0,"cool":0},"RuMA1p3xSaLFDb3_hvDSMw":{"text":"Jerry made the visit amazing!!! Food was amazing and service was even better. They made th","useful":0,"cool":0},"GkWfXOJFwa5Kcn_qRosH1A":{"text":"I wish my experience was a little better. I came with a party of 3 and our waiter was clea","useful":1,"cool":0},"45AQNoNiQMkSTU6AdZiJkQ":{"text":"Can't get enough of the Ruby Slipper! We've been to this location twice during our week lo","useful":0,"cool":0},"1oBNihH6zrZFKT-bfta00g":{"text":"Really enjoyed this place, our waiter was very helpful with the specials and even gave us ","useful":0,"cool":0},"l-q13_DyJSsNcacB6G8Q_w":{"text":"The service and breakfast was amazing. I appreciated the fact I was able to check in early","useful":0,"cool":0},"xa9yzsSnqXWaoAQTSSLloQ":{"text":"Over priced and not good food. The grits are horrible. Asked for soft bacon and the server","useful":2,"cool":0},"_qHV3nSslVHNdxezavwxiA":{"text":"Ashley H was the best!! The eggs Benny and the happy hour morning drinks were yummy!!","useful":0,"cool":0},"j1RrJCoxqtIIkvLNg6ne9A":{"text":"Food was great! Service was a lil rocky at first, we did have a party of 8. The Praline Ba","useful":0,"cool":0},"7QIFVDUPBuXmMbWo5lAZHw":{"text":"Awesome food and great drinks . Very nice service and atmosphere. I would definitely come ","useful":0,"cool":0},"WqdTOuC38_NJOwe-UFTwHQ":{"text":"A definite highlight of our trip. We will go back when we are in New Orleans. Definitely t","useful":0,"cool":0},"uPtR0L3912l2gogUWCbDqA":{"text":"This was delicious! Our server Destiny was so friendly and helpful. I went with a party of","useful":0,"cool":0},"5W-SeMnw40bTd6b0EF45JQ":{"text":"I went to the location in Baton Rouge and it was superb. I have been hyping up the restaur","useful":0,"cool":0},"2pUb8au4ltgdv6AL_gtI_Q":{"text":"My favorite location!\n\nSo glad this one opened. I will admit at first I was like oh goodne","useful":31,"cool":20},"HoqAHQk7pJCaWZByL2Jbzw":{"text":"Awesome place to order brunch from! It's so amazing that they are doing brunch specials so","useful":1,"cool":1},"zM5efe8o9dH7Kc6F8SVMFA":{"text":"No idea why this place has such great reviews. Breakfast was terrible today, the benedict ","useful":0,"cool":0},"pS6ZXYE_zBtzRXHsjGfB4Q":{"text":"My husband and I stopped in for a late breakfast Sunday after mass, and the place was hopp","useful":16,"cool":10},"i_sa8zHxtGFP0S0LTotMzg":{"text":"Great overall experience! We had the eggs benedict, pancakes and mimosas! The meals were g","useful":0,"cool":0},"CIFQ_3jBEWrS0kU5Yy7jJA":{"text":"I ordered the Chicken St Charles and then the waitress even mixed up a little hot sauce an","useful":0,"cool":0},"hIGcpqC0XroOrgFlWvOQ_g":{"text":"I escaped to New Orleans for a much need timeout a few weeks ago. There was a Ruby Slipper","useful":0,"cool":0},"2mvFGxHJeW2OyJBlcyYY8A":{"text":"Excellent service and great coffee. The food was meh. I had the migas. Long waits, as desc","useful":1,"cool":0},"je6FEJ1vVvEbt9VoJxO5-w":{"text":"My girlfriend and I decided to give this place another try after the previous review. A hu","useful":2,"cool":2},"BVgWqlfuOBIm60qrhN8MdQ":{"text":"Amazing breakfast. Tommie was our server and she is amazing! Good food, great service!","useful":0,"cool":0},"V-KLXEFEeYS8IG6SGZ9bhg":{"text":"Amazing Bloody Mary. Amazing bananas foster. Amazing eggs Benedict. You NEED the fried chi","useful":0,"cool":0},"8TKIUA1x2ry1NG8seBj3LQ":{"text":"Went for Brunch and got the St. Peter (grilled fish, a skewer if shrimp, and fried grit ca","useful":0,"cool":0},"GXN4oqqpSLpCPAnpFzThPQ":{"text":"We are here in New Orleans for Spring Break. Highly recommend for breakfast- we came here ","useful":0,"cool":0},"bNxukRrdwkuK3zRbkwJYWg":{"text":"When in New Orleans, you must visit this local gem. These popped up after Hurricane Katrin","useful":2,"cool":1},"qOnLJvQsVe2ZgJdB0PfWdA":{"text":"Recommended by a few friends and they did not disappoint. We we seated right away and orde","useful":2,"cool":2},"Bf14thXReePKBy-SZ8-RWA":{"text":"Okay, let me just start off by saying I was pretty excited to try this place. This place u","useful":2,"cool":0},"QyVKS8NSdPgZ6Tcnsj9iug":{"text":"This place is getting 3 stars due to the service and wait times. The food was actually goo","useful":0,"cool":0},"hipOTjlcynmX_TOiUojbkQ":{"text":"Visited NOLA for my birthday and the Yelp family and locals said this was the tourist/loca","useful":0,"cool":0},"7ClW3HTbVof9g4DUbDE2yg":{"text":"There are a lot of places to have breakfast within walking distance of our house, and this","useful":1,"cool":0},"7hx-YHXr0cDJL7OtHWbqew":{"text":"Love this breakfast place\nI come to NOLA about once or twice a year and love trying all th","useful":0,"cool":0},"hkrZpy18Ajf-FoLyxeJlJQ":{"text":"So, I usually enjoy my ruby slipper experience but today wasn't so great. My omelette came","useful":0,"cool":0},"5lxT-N8lqdYqX9bIme09Ig":{"text":"Arrived at location checked in at 10:48am. Hostess advised me 45 mins 1 hour later many gu","useful":0,"cool":0},"kKQoMxjlctFWuF7G48AGhg":{"text":"Ruby Slipper is a cute breakfast spot. Great customer service. Their breakfast options are","useful":0,"cool":1},"9XufFiPc4W1S7Syq0oCkbQ":{"text":"We always eat at Ruby Slipper when we visit.  We decided to try this one on the way out of","useful":0,"cool":0},"5087rUodLGsjscuOoSM0YA":{"text":"Heard great reviews about this place but it wasn't all that. They have interesting choices","useful":1,"cool":0},"5zJ1xsPVSuQqlhAiUYEsaQ":{"text":"Great food but they were under staffed. Waiter was overwhelmed and that ruined the experie","useful":0,"cool":0},"UnypmrFZx7cchVWHk7gtEQ":{"text":"First morning in NOLA and we found ourselves here since it's walking distance from where w","useful":4,"cool":1},"c7EnX-H8FN0waHLREbMLOw":{"text":"Definitely an awesome restaurant and well worth the wait.   The waitlist was very easy and","useful":0,"cool":0},"KD1HHQwrividD02bbFY4Ng":{"text":"Unreal food, unreal drinks, but the service was the BEST part. Tommie made us feel so welc","useful":0,"cool":0},"aHDfR7tShHD7I11zXu24uQ":{"text":"Dear Ruby Slipper Family,\n\nI'm sorry it's been like three years and I'm just now realizing","useful":16,"cool":11},"nAnKXLiy6AtIYwgYoO9hiA":{"text":"Honestly probably a 3.5 star experience but the food was four stars. I really enjoyed the ","useful":0,"cool":0},"kD8XYuMz9I5RgRoz1Fn-Qw":{"text":"The food was excellent. The egg Benedict out of this world. Our server Sammy was the best ","useful":0,"cool":0},"24QDt3R68XCiDPBnjyrDUA":{"text":"The food was very good... unfortunately the experience was tainted by all the waiting... 5","useful":0,"cool":0},"gocuhYvaZzHPnOGiFLQx1g":{"text":"Too loud to enjoy the food\n\nCame here with a friend for the first time and we came before ","useful":2,"cool":1},"fgutBaSbSc0WR4WUrf42WA":{"text":"I absolutely enjoyed the food and service!!!! Samson U was Great!!! He suggested the crawf","useful":0,"cool":0},"rMmED9mdOvZFTzvgjL_YBQ":{"text":"Food was good but the Brussels sprouts were a little Under cook but food was tasty and OK.","useful":1,"cool":0},"kf0hRCtIThvz7rEfeZ2qoA":{"text":"This is my second favorite ruby slipper location. I've never had bad service here. They ar","useful":2,"cool":0},"kc_D20Y1Wqj5t79LLm_gtg":{"text":"I heard the original Midtown location was the best of the 3. However, we went to the one o","useful":2,"cool":0},"ThotQOwVv0g-rbSUFVnCew":{"text":"Easily one of the worst meals I have ever had.\n\nI ordered an egg sandwich with cheddar. I ","useful":0,"cool":0},"ZsQgdROLbPWgM_FFEAzhpQ":{"text":"I personally do not understand the mass appeal of this restaurant, however I will say that","useful":0,"cool":0},"cVZyGd2M-HY4aIshl8OGvA":{"text":"First time visiting this place. It's a nice spot in the heart of Nola, on Magazine Street.","useful":1,"cool":0},"N_mHhrmVOtP9qzYrgB0aZg":{"text":"The Egg Bennedict were delicious, they made my tummy happy. Great place and the Service wa","useful":1,"cool":0},"4d8WEDJG0qtIoFko9l8jaw":{"text":"We went here after a long 12hr shift and it was well worth it! They open at 7:30am and the","useful":1,"cool":1},"eIOEON1myC_CpqWy8w6ESw":{"text":"Our server was the bomb!!!  I will call her Jersey Shore( Kristen was here real name I thi","useful":0,"cool":0},"sSkqsC_yrqOUnPAVyXjecA":{"text":"I just came back from the most delicious Sunday brunch! And on a Saints game day, too! Ser","useful":0,"cool":0},"noH8c6NPSUShykkHers3_A":{"text":"Food is really good here. This is our second time here. First time I got the cinnamon Fren","useful":0,"cool":0},"-JOTT30Ldm_QfeHmV7vgRQ":{"text":"The service is fast, and the food is okay. Went on January 1st. I knew they were busy. Don","useful":1,"cool":0},"FN4DNG8ZtTxnKxji6mweLQ":{"text":"Best service! WAY TO GO Ashley H. Best Eggs Bennie! Get the boozy iced coffee and one to g","useful":0,"cool":0},"lzGWtJSq4kXi3ZqOtUg6ow":{"text":"This restaurant is very popular in Nola especially for brunch so I suggest go early if you","useful":7,"cool":7},"yhBIHhs3NdXmuU3VenQVBQ":{"text":"My family and I ordered several things via pickup order and the staff forget many of the c","useful":0,"cool":0},"Bv1-rLT44pz0ft9t80EzOw":{"text":"Ruby Slipper has been my go-to breakfast spot since the first place opened. We love the ba","useful":0,"cool":0},"t7ro9nfBC_IBl7o_fGIF_g":{"text":"This was my family and I first eating experience here. It was one of the best places we've","useful":0,"cool":0},"maAfGZonyIo-IEFrzd2ESg":{"text":"I knew I was in for a treat when I came with my friends here and the staff knew them by na","useful":12,"cool":12},"W6HoeA9s4BaEv6znDB7mFA":{"text":"This was my first time in New Orleans and waiter Sammy was amazing. He was very helpful at","useful":0,"cool":0},"ho24sLhGQf2NjOWTQ88-Ww":{"text":"Met some family that was in town here for brunch. I'm sad it was even my idea!!\n\nLong stor","useful":1,"cool":0},"Q_G3tXgK7npGpISy3L4BKw":{"text":"Biscuits were stale, omelette didn't have much flavor, eggs Benedict were alright, just ov","useful":1,"cool":0},"uu_yhJIS_rQcos1tr3RHmQ":{"text":"Food was decent but way over priced for what you got. I ordered salmon avocado toast and t","useful":1,"cool":0},"ODC0XW-XzLIoPDL-QB1mJA":{"text":"It's a run of the mill chain. Scrambled eggs taste like they came out of a carton. The bis","useful":0,"cool":0},"KBI35gtLrlYzpPjRIQ4TyQ":{"text":"Best eggs Benedict I've ever had.  I had the combo one of Cochon and fried chicken.    Cor","useful":0,"cool":0},"MlrwHdfr0rOauamYAuK7Qw":{"text":"The only reason this didn't get a 1 star review was that I'd had a couple remotely positiv","useful":1,"cool":0},"x77tLrpiR2iFOhR_b-qEXg":{"text":"My husband and I went for breakfast.  We were immediately greeted and seated. Our waitress","useful":0,"cool":0},"LNwFFoCm9y0WZfA3bJKjAg":{"text":"This seems to be a very popular spot for dining. The pig candy bacon bites were very tasty","useful":0,"cool":0},"1GO0ii02QJBht1eaILJfew":{"text":"My girlfriend and I stopped into the Red Slipper this morning and are kicking ourselves fo","useful":0,"cool":0},"t7jUoOJ4qVj35K91CvVgmw":{"text":"Incredible breakfast. The migas were the best I've ever had. All of the staff at the resta","useful":0,"cool":0},"Av6PHjQyei2HBbfN5bOXAw":{"text":"Quick service, great food!  Think upscale diner foods that happens to have a great bar. A ","useful":2,"cool":2},"Mw722Dn-GBEUPWZNKVGtjg":{"text":"Amazing food and OUTSTANDING service! Sammy took care of us like we were in his home  The ","useful":0,"cool":0},"q7OBGbUDFsOsGWiy3WYTfA":{"text":"One of my favorite breakfasts I have had in New Orleans. I had the Biscuits and Gravy and ","useful":0,"cool":0},"oJtD3klJJgQt6Eg0x-AJmg":{"text":"This was the perfect size. I loved the combination of flavors and textures. Would definite","useful":0,"cool":0},"AeECdc3KTunQrOj3Fo8pNQ":{"text":"The high ratings for this place are a complete mystery to me and my husband.  The food we ","useful":0,"cool":0},"MOKTQpW9OXv4bnqN6xPDBA":{"text":"Came in for some brunch and to get out of the storm. Sat at the bar, got friendly service ","useful":1,"cool":0},"VeBEeu0tC2hRgojkvCMZdw":{"text":"This is a tale of two Ruby Slippers.\nI went on 6/11/21 for breakfast and it was fantastic.","useful":0,"cool":0},"GTz4TmeC2KiR6fwuhZhM9A":{"text":"I just wasn't impressed. Sorry. I guess my expectations were too high based on the prices ","useful":1,"cool":0},"T5jL29off4pcalaeCSIsGQ":{"text":"Went to brunch with my boyfriend and it was our last stop before heading to the airport. I","useful":0,"cool":0},"3WTzrWLLXBeM_taat9_mBQ":{"text":"Service was prompt.  We were seated immediately.  Full flavored southern cooking. They ser","useful":0,"cool":0},"0Pad3K8Ih76ZwFC_yaw-UA":{"text":"So this was one of my favorite places to brunch but now I am struggling to find another di","useful":1,"cool":0},"71dVDbwzYiF--QSgL9wW0A":{"text":"Awesome Food! Service!\nThis place has a great vibe, and awesome food. Their food is all ma","useful":0,"cool":0},"lHiwkUT9PzVzjWKFCmuXXw":{"text":"Loved this place! I had the crab cake Benedict's! Fried green tomatoes topped with a crab ","useful":1,"cool":1},"jKo2kwevcc8qfWPZa4b10A":{"text":"Amazing time here!!! Tess was an awesome waitress, funny and knows the menu well. All the ","useful":0,"cool":0},"CpPuAqdRiiqLCoS18gjLnA":{"text":"Friendly staff, and the egg Benedict was spot on. We had the crawfish, salmon and crab Ben","useful":0,"cool":0},"HC8466R-61Kl7WR2iUDWCQ":{"text":"We came into the Ruby Slipper to eat breakfast and before we had the chance to put in our ","useful":0,"cool":0},"ebkYTXwmyTusAKaNkS8ZGg":{"text":"We had the ABSOLUTE BEST SERVICE EVER and the food was DELIGHTFUL!!! Sammie was our server","useful":0,"cool":0},"lx5IAzzv1tqwVwHKntR7Kg":{"text":"So we took the trolley to Ruby Slipper since it was a place the two I went with enjoyed an","useful":1,"cool":1},"jtifyoxC3NpRYdZzbjJ_7Q":{"text":"Staff were really nice and the food was really good. They have the tables separated for so","useful":1,"cool":3},"5uNfGtYETZcmnA9dQmeEzw":{"text":"Mimosa flights were delicious! Food was amazing as well. Sammy our server was delightful, ","useful":0,"cool":0},"9gtdWQyFxD1Hz81S2M_M-w":{"text":"The ruby red slipper at this location was phenomenal. Nothing fell short except the wait t","useful":1,"cool":0},"nWS3gGXz5vJ6aUvcGtr9xA":{"text":"Didn't want to wait here for too long so we checked in on yelp in advance. However we got ","useful":1,"cool":1},"mx_xvT_GE0Jl0-SGJKTBbQ":{"text":"Great bacon flavored bloody mary, average service, smaller plates, and limited food select","useful":0,"cool":0},"ln6RMjrEWVxjhe8z0RRYzQ":{"text":"Sammy was the BEST server We LOVE Ruby Slipper and he made it even better!!! The bacon inf","useful":0,"cool":0},"K7FMyiCGgSRSzn4TWzc4Sg":{"text":"Where do I start?\n\nLet's start with the wait for a Sunday at 10:30am. For me? Sitting alon","useful":0,"cool":0},"v8rxSjbg6Oq9p6-XC6mN6w":{"text":"Although the \"wait staff\" at the Magazine location was fantastic, the food is not so good.","useful":1,"cool":0},"IVsQgYKfjw5r504swmpKPg":{"text":"Best breakfast we had on our entire New Orleans trip! Fried chicken Benedict was bomb.","useful":0,"cool":0},"e9qKR5wewRTrY0adv7HI9A":{"text":"When it comes to New Orleans it isn't a city that specializes in southern style food, but ","useful":0,"cool":0},"vSoHOHskbFrhnEsTgmNsMw":{"text":"Me and my family throughly enjoyed our meals!!! The staff was amazing and the wait time wa","useful":0,"cool":1},"FG7XGqCmqXL6GxCLN8Aqug":{"text":"Sammy was an amazing host and server! The food was awesome but his service was better! His","useful":0,"cool":0},"eyQULwbHFNfhNOEh4UMaiQ":{"text":"This spot was a great place to go for breakfast, they had very fast service even when the ","useful":0,"cool":0},"oBpP5QUlqi-efgLi3YpuGg":{"text":"This place made the list based on reviews, I didn't realize there were 6 or more locations","useful":0,"cool":0},"cPyRlzccgqtrVRe2gCrz5g":{"text":"Extremely disappointing. Once seated, we waited for quite some time before the waitress ca","useful":1,"cool":0},"neL3WDtGfYUtX4c6dGvE5g":{"text":"We came here for their Veuve Clicquot brunch and had such a great time. The restaurant was","useful":5,"cool":3},"U_ha3TMf0ZWvMe_jMvXLFA":{"text":"Disappointed in their service today. Obviously we're dealing with this virus so everyone d","useful":1,"cool":0},"G5E288u9eqQztxeTa5RYeA":{"text":"The staff was great and the food was very good. The breakfast cocktail selection was excep","useful":0,"cool":0},"6Lmh0rcWyIIRJwy-Sl-stA":{"text":"If you want traditional eggs Benedict, go elsewhere. Not sure what the orange colored sauc","useful":0,"cool":0},"1bmh5YBHtIiUCRyyOx9ZbA":{"text":"We tried to visit the CBD location but there was a 2-3 hour wait so we called this locatio","useful":0,"cool":0},"wCttt1wjIf_URo8u3KwRWA":{"text":"Amazing food and great service. This was the first time my wife had eaten here and she sai","useful":0,"cool":0},"erHxGhsn_xLr6jyJGeabxQ":{"text":"Great food! Jenn was our host and she was super nice. It was far from the parade crowd wit","useful":0,"cool":0},"NN5HMCwniQt-epqjskVcGQ":{"text":"Good times and bad times. The Rueben sandwich was good, as was the migas. But french fries","useful":1,"cool":0},"ak1jg6IMO8GpEMd9BNXJNQ":{"text":"Accidentally ended up eating here for breakfast when the original place we were going to w","useful":0,"cool":0},"2W6LWKtFbpujpiuhAY59QA":{"text":"The food came out in less than 10 minutes of ordering. We were seated as soon as we walked","useful":0,"cool":0},"q7y8TteX5YlqaD6SmpWNIw":{"text":"This place is always great. Consistently very tasty. Sometimes when they're very busy (oft","useful":0,"cool":0},"YM9P4seEmviEYFobyyUZEw":{"text":"The ambiance and breakfast was absolutely delicious and our server Tommie was the best!","useful":1,"cool":0},"-2Sw7Yjx-Msg7iHsdZ-Fig":{"text":"Good food and better service. It was my first time to this location and fortunately it did","useful":0,"cool":0},"9gpp4iX3mAcOPpBrtOMzcg":{"text":"Food was amazing and Mrs. DeeDee the GM was such a pleasure to talk to. One of my favorite","useful":0,"cool":0},"GOPMya1tEwYkYtVEW99rXQ":{"text":"I heard about this place and I decided to try it while visiting Nola again... it was good.","useful":0,"cool":0},"PdWbbJLAfaxpWQ9PvtKwvw":{"text":"Ok..... Im going to make a BIG statement here.... Coming from someone who basically always","useful":0,"cool":0},"jZcc_HuUUdy_2byC6sa40g":{"text":"Amazing bacon bloody Mary's and the trifecta eggs Benedict and the jazzy French toast so a","useful":0,"cool":0},"yGdV_WH7t36yP0xUsWL2WQ":{"text":"Very delicious brunch place. The mimosas are wonderful. The atmosphere is great. Very open","useful":1,"cool":0},"midnTrvKopio4QLwLjwWDw":{"text":"Honestly a huge disappointment. The food is way overpriced but I guess thats what to expec","useful":0,"cool":0},"vyJHiVNN3dVBfNYYmkelXw":{"text":"Delicious, friendly and helpful staff. I highly recommend the sweet heat chicken and Frenc","useful":0,"cool":0},"AmPBu5iumTURK78KxMkjeg":{"text":"Tommi was a lovely server and the food was delicious. \nWait time reservation was a confusi","useful":0,"cool":0},"4L_7npW1o023KzffrxnLBA":{"text":"Thank you Michelle M for great service! I always get the peacemaker and the peacemaker alw","useful":0,"cool":0},"qR5BRcffGsirZA__UwSiSQ":{"text":"This place was one one of the highlights of our trip!! Michael, our server, made it the be","useful":0,"cool":0},"p54Z37QRDTaXAZCkM8e8eQ":{"text":"I'm so disappointed about this restaurant this time, I been here a lot of times and never ","useful":0,"cool":0},"WO-ZVXxggk_1HW643RsQ4w":{"text":"After trying Ruby Slipper in Baton Rouge and being slightly disappointed, I couldn't wait ","useful":0,"cool":0},"CItJzEZEGn8IbAsCz8H7ow":{"text":"I had a fantastic meal with Sammy at Ruby Slipper. He took excellent care of us. I'm glute","useful":0,"cool":0},"ouzQgdYYiZcT3c8_PSgHRw":{"text":"Long wait but VERY GOOD FOOD!  I had the chicken salad sandwich.  He had the shrimp and gr","useful":0,"cool":0},"t3HArofwgAI8yh82vY3jUg":{"text":"Probably top 5 worst breakfasts I've ever eaten.\nTook forever to get the order and when it","useful":0,"cool":0},"O5UF_ORTdmpP5TpuPeFbgQ":{"text":"Sammy was fantastic! Service and food were incredible! I got 3 pig omelette it was delicio","useful":0,"cool":0},"PT-HkyHBXsJeJ_KjRB4hkQ":{"text":"Yummy. I had the breakfast plate that included eggs, fried green tomato, bacon, grits and ","useful":1,"cool":1},"wMOxKRXdRMCHPBW5bs7y-Q":{"text":"The Chicken St Charles was delicious. Lyndsey gave us impeccable, five star dining level s","useful":0,"cool":0},"8NiMzc67ks3D1_lK693iMg":{"text":"Big NOLA shout out to our buddy, Sammy! He hooked us up; great service + deliciousness = t","useful":0,"cool":0},"YvqOdLzb7pFVByTI-_9uug":{"text":"Delicious!! Trifecta was amazing and our server Tommie was wonderful! Will definitely come","useful":0,"cool":0},"4FFsqDYaQmFNB0w2gxqBkg":{"text":"Today  was my first time visiting the restaurant; Kelsey our waitress was extremely helpfu","useful":0,"cool":0},"wgI9H3-Z0CFLg9HUPpggkA":{"text":"We ate at the Metairie location. We made a reservation online and was seated quickly. The ","useful":0,"cool":0},"9L3xf37E1JdGaxhqbKmieg":{"text":"My husband and I ate here when we visited the garden district for a tour. It was delicious","useful":0,"cool":0},"b5rlt-Os8HwsC_eSgNAb3w":{"text":"Good cranberry juice in a pretty big place. The food look like delicious and the customer ","useful":0,"cool":0},"misBMd-amqYlWCvd_s9zyA":{"text":"Come here for the drinks!!  (And the amazing staff) but please don't eat here.   I ordered","useful":0,"cool":0},"4dJQx2KkXvxwP9EmOJNdSQ":{"text":"Went here and had a very good experience with customer service and the food was very good.","useful":1,"cool":1},"pAbPuPrGFa1lbsc3c7pgRA":{"text":"Always the perfect meal! We go here anytime we are in New Orleans.. we've been to 2 of the","useful":0,"cool":0},"oIbBD3Q0vJGaI9IE-wGIeA":{"text":"Let me start off by saying this place was AMAZING from the minute we added ourselves to th","useful":0,"cool":2},"sGnXRXDNCIYiBIW07u_c2w":{"text":"This place was pretty good. There is a long wait! However they can text message you when y","useful":0,"cool":0},"2vRH9YRCrFI-D8G0ro-5_w":{"text":"Really not very good. Our server said that the premium OJ was squeezed in house and it cer","useful":0,"cool":0},"dUO3QLewAHNJGfCq8WplRw":{"text":"The food was tasty. Ordered the Trifecta. Of the 3 benedicts, cochon was the best. Would r","useful":0,"cool":0},"QsmoCX3dEC79EsyAgW32Lw":{"text":"One of the best in the area for breakfast or brunch.  Wide selection of drinks and menu op","useful":0,"cool":0},"PuE5_GiZj9P6IGnYNPIBaA":{"text":"Terrible breakfast!!! Salty potatoes, avocado was not ripe and very hard. The service was ","useful":0,"cool":0},"IBEmO2pBuxmC75NkzOFbsg":{"text":"Sammy (Samson) served us right as the restaurant was closing. He had great energy, made gr","useful":0,"cool":0},"Ab2_LgDPaGNM6PKm2PaFOw":{"text":"The service and attention were awesome, but the food was average.  Had the French toast an","useful":0,"cool":0},"SskJt8t3V4y9jCCN8qxqbA":{"text":"I had my last meal in New Orleans at the Ruby Slipper. I chose to go with the trifecta, wh","useful":0,"cool":0},"Zkm-HILtuFlCuPuT2VEbwA":{"text":"Tommi was amazing! She was so kind and service was quick. Food was delish. A great easy sp","useful":0,"cool":0},"TcWxHsHPohgXf_vVXKfRow":{"text":"A must visit location for breakfast. There are several locations. This one is larger and b","useful":0,"cool":0},"XnYJ_58gDnmbMA2I0ca5rQ":{"text":"Food was....trying to be interesting...but really had a IHOP/Denny's feel to it. Grits wer","useful":2,"cool":0},"O5uUHzljzZaliWorRU4A2g":{"text":"Chicken St Charles Benedict was great. It was hardy and well seasoned. The flavor was rich","useful":0,"cool":0},"EWhZCKh9i7Ida2mGDo-IEg":{"text":"Don't try to place a to-go order. The have a telephone but it only has pre-recorded messag","useful":1,"cool":0},"fF0RQt5Va5I9UH0d4p4ApA":{"text":"Not bad.  Enjoyed my eggs benedict, though the eggs were overcooked and not runny.  The me","useful":0,"cool":0},"1TarXS4nEU2Rtfvg-jH5IQ":{"text":"SO GOOD. Was honestly surprised with how good everything was that I ordered. The wait list","useful":0,"cool":0},"yYcMrvkxQJG87SuWWJ8iVA":{"text":"Some friends and I decided to grab brunch last minute and the wait time was decent. Howeve","useful":0,"cool":0},"D11-Buj80fFNU-gZg9ukKg":{"text":"So yummy! This place has such a great menu! I got the mixed Benedict--one is the corned be","useful":2,"cool":0},"SBO71tQpuIO-OJWvtJHI1A":{"text":"My wife and I lived in New Orleans for a little over 3 years. We took that time to eat bru","useful":0,"cool":0},"kG6FwZj7KIlY2fEWBz109Q":{"text":"Seems like a tourist trap. Waited over an hour. Got the salmon Benedict and a side of grit","useful":0,"cool":0},"uUkLPEHnjHR6BXGBwglmBQ":{"text":"Very tasty breakfast! Their eggs Benedict options were awesome! I had the tomato and the s","useful":0,"cool":0},"6YmIBVNueMdl8dwQYNyBkQ":{"text":"What a wonderful day to enjoy New Orleans and good food. My family and I ate here today an","useful":0,"cool":0},"YXq6Ki1S_4xgu20uwgQS7w":{"text":"Was in NOLA for a week and wanted to go to pick up my everyday Starbucks. Across the stree","useful":0,"cool":0},"kAwtyWzM707H72XAoNUs7w":{"text":"We loved Sammy. He took such good care of our family. He was such a great server and helpe","useful":0,"cool":0},"ho6o-xsBkEjLkDTvJGeGWg":{"text":"The food here is always good but is it worth the hour wait it took to sit down and almost ","useful":0,"cool":0},"KiQidRrWxfbesPTO6Hm6Tw":{"text":"The service was wonderful but the food feels like it's gone a hit downhill.\n\nThe side pota","useful":1,"cool":0},"zYAxWvoFd9s6eoEqFTjvLQ":{"text":"Austyn was wonderful! He was just a delight to talk to and such a warm, cute person.  The ","useful":0,"cool":0},"fs8Q13QOm0_aM9-atBoq5A":{"text":"If you like eggs benedict, this is the place to go! We used the Yelp waitlist as we walked","useful":0,"cool":0},"OZab0PxCQi1P4gw8dQfR7Q":{"text":"When i saw their biscuits I was like omg I can't wait to order. So i ordered the catfish a","useful":0,"cool":0},"OUrNSvhs_MCSvhmfxxJGiA":{"text":"The service was amazing !!! Our server Sammy was so kind and made sure we had a great time","useful":0,"cool":0},"VZhzzbAnT2yQoj5WtcHh-w":{"text":"Omg the food is off the charts.  The only thing better than the food was the service from ","useful":0,"cool":0},"1UioWotRXfk6iYaRz-8KoA":{"text":"This has always been one of my favorite breakfast spots. As usual it didn't disappoint. I ","useful":0,"cool":0},"7KKIlyOQITjmVoFzEUGYXg":{"text":"Although it's a chain it's a great place to stop by. We checked in ahead of time online wh","useful":0,"cool":0},"eXQKNrOJZJZ7duE0Vkjcdg":{"text":"We got a recommendation on the rental car shuttle from a couple whose family lives here.  ","useful":0,"cool":0},"dQPLwNJDZCB7eIuQpep2eQ":{"text":"Enjoyed my birthday breakfast with hubby the food was amazing . Wonderful people ., \nIf yo","useful":0,"cool":0},"HDPFanhA-Hj9rIHCbd4oAQ":{"text":"Food is good but portions were pretty small. Service was okay, our waitress wasn't very at","useful":0,"cool":0},"egKv6lQyoK970AZtREAj9Q":{"text":"Overall a little disappointing. It's a big airy space and family friendly. Very casual. Se","useful":1,"cool":1},"ChDOTAyvBVzcCKZolsdpXw":{"text":"Awlful!!!!!! We didn't end up eating there because the hostess on 8-11-20 at 11:35am was s","useful":0,"cool":0},"enBbvWO3dhVrcS89a-omAg":{"text":"There is something to be said when they knowingly are aware that your food is overcooking,","useful":4,"cool":4},"ocPxCid6EZWnbfW2Y4ZClw":{"text":"Amazing food and service. Our server was Stephanie, she was great! We're in town visiting ","useful":0,"cool":0},"hfpdxikMMFwjLFd8J8cIWA":{"text":"We usually love going to the Ruby Slipper when we visit Nola, but this location is horribl","useful":0,"cool":0},"10Dqvn4gl-FEFqgtiWqVTg":{"text":"Freddie was my server absolutely amazing personality an customer service. He definitely wa","useful":0,"cool":0},"YqS7TPcL_eotEqjIz8O4SQ":{"text":"Sammy was our server and he was excellent! Great service and conversation. I had the break","useful":0,"cool":0},"sOh_gK3BALYfIIikykGMQQ":{"text":"Came here for breakfast with my bf, grandma and sister on a little family trip to NOLA bef","useful":0,"cool":0},"OqMJc8xzpxbaIVeOrfIzHA":{"text":"The food is always amazing! There was even a special mimosa flight being offered in celebr","useful":0,"cool":0},"1AOHkQ8_JNp2Tv6bYSoatQ":{"text":"This place was so amazing. Went here with two friends and the staff, especially our server","useful":0,"cool":0},"6VYvQCaRCz1fpAP28V6ucw":{"text":"Being an avid Ruby Slipper customer from Florida, Alabama to New Orleans, I am thoroughly ","useful":0,"cool":0},"I121ZzRrPFhXCmI7fSoISg":{"text":"They've got amazing French toast and unique eggs Benedict flavors. They've also got decent","useful":0,"cool":0},"XRF0DijppXJP83s5q2GnCw":{"text":"This was our third visit to the RS for breakfast. Our wait person Sammy was outstanding , ","useful":0,"cool":0},"1NB_pEOMnlCfhi0xeuXaSQ":{"text":"Best French toast I've ever had! We went here by recommendation from a friend, and this pl","useful":0,"cool":0},"LfjO8ePybXffRQ7kU2pxkw":{"text":"My friend and I were fortunate enough to give Ruby Slipper a try just before the covid-19 ","useful":0,"cool":0},"c2leQrS2_8UnrnJpEAgzBQ":{"text":"For my breakfast i ordered benedicts today. First, i got the wrong order so they bring me ","useful":0,"cool":0},"iSPE-Fd8UjdfS6RWFaQ-2g":{"text":"Went here on our last breakfast In this beautiful city. I really wanted to like it! Howeve","useful":0,"cool":0},"vt1-gC728U8xROTHCynYVg":{"text":"This was on our breakfast places to visit so we came to see if it was any good; turns out ","useful":1,"cool":1},"_Kyjq1HznMlTDdN0kMjEjw":{"text":"I have heard high remarks about Ruby Slipper Cafe from numerous of people. I was extremely","useful":1,"cool":0},"lXu8UwI3DrzX7VxUocsQeQ":{"text":"Excellent eggs Benedict selection!\n\nGreat service from Lyndsey!! I ordered the eggs cochon","useful":0,"cool":0},"gCjnEtmOpXJtAJAa4d_Uhg":{"text":"They're bread pudding pancakes are the best I've ever had!!! 4 stars because there is ALWA","useful":0,"cool":0},"qR932QcceevlvLeWYu1gZw":{"text":"Oh wow. The biscuits and gravy with hot chicken AND bacon. I cannot express to you how del","useful":0,"cool":0},"BOvPlmgcvO7J3QhrQKc3OA":{"text":"The Ruby Slipper is a must stop for brunch in NOLA! The service was great and the food was","useful":0,"cool":0},"-AkiX97168K94UFfObtwaA":{"text":"Delish!!! We had a great meal at Ruby Slipper today, but the service made it a 5+++! Our s","useful":0,"cool":0},"T0ktiDp5X67EUL3UpS3zdQ":{"text":"Why haven't I been here before? I can't believe that I waited so long. I should have eaten","useful":0,"cool":0},"O1Ze87HIQWfkWqzK5drTnQ":{"text":"A well known breakfast chain in NOLA.  This is just one of four locations.  I would encour","useful":2,"cool":0},"ahPirPQxRdJfRht_sOBDHQ":{"text":"it was our first time at ruby slipper and it did not disappoint. on a saturday morning, it","useful":0,"cool":0},"29-8UeelYfEDEOwRzFL7SQ":{"text":"THE FOOD WAS AMAZING! The wait is really long but definitely worth it. I recommend getting","useful":0,"cool":0},"dROLa6smmVhw5tm1IzRFBQ":{"text":"Hey! This is TakeFlightFoodie, check out my Instagram for more pics!\n\n\nI got the French to","useful":0,"cool":0},"apkugBUlF2kVHJ9tMPjqsQ":{"text":"Always a favorite! Everything I order is always delicious. Make sure to go to the uptown l","useful":0,"cool":0},"Dks2DqBH3EW36owz0AvmSA":{"text":"Very neat spot with multiple locations. Really was looking for a more traditional home coo","useful":2,"cool":1},"KzEJnPwt4NBKPXbj58uY5w":{"text":"Love Ruby slipper uptown. Great company. Yummy food. Ashley at the bar is so sweet and acc","useful":0,"cool":0},"Pnlgt5ic8Eij5wEKPzSZvA":{"text":"This looks likes it's going in as a new review and not an update, but in either case, five","useful":1,"cool":0},"FRE7o1v6tCig7t4jmMdaSg":{"text":"This was my first and unfortunately last time coming to the Ruby Slipper and it had nothin","useful":2,"cool":1},"mFWY1UxMzRaBjjXf7hoBfg":{"text":"My boyfriend and I stopped by Ruby Slipper Cafe after recommendations from several of our ","useful":1,"cool":1},"socIKy8DJHBZ5GEMZzASLA":{"text":"Update: Ruby Slipper is providing free meals to government employees during the shutdown. ","useful":1,"cool":0},"28fGCn4k9FOlHvVvt1dbQA":{"text":"Aye here before heading out of Nola. Had a good experience and most of the food that I had","useful":0,"cool":0},"UwervYvbVwK5HPFtrQU67g":{"text":"Eh, definitely not that good of a breakfast, mediocre at best. The biscuits were dry and t","useful":1,"cool":0},"l-Bo9nMSPfFY8xUg-Pj4jQ":{"text":"Amazing breakfast and amazing service! I cannot say enough  good things about the food and","useful":0,"cool":0},"E-JAHB_tRkqQpBEfmEXRuQ":{"text":"Service from Rudy was fantastic. On a weekend the wait for brunch was 20 mins around 11 AM","useful":1,"cool":1},"UH_Y6g2mNVKCDufPgCnh4A":{"text":"My first time visiting this cafe and I had a PHENOMENAL time. The food was AMAZING, and so","useful":0,"cool":0},"EFHME0ToFcUxd7H60Uyzpw":{"text":"The restaurant was very welcoming at 7:45 am. It was quiet, clean and with just a handful ","useful":0,"cool":0},"HWUZK_EnWqWyCPKPSUGnUA":{"text":"Came here for brunch cuz I had seen pics & reviews on YouTube - I'm so glad I did! The spa","useful":1,"cool":1},"rV4sFQtQJnOBwLACLqDm-g":{"text":"Ruby Slipper has transcended from its former \"there's this place you oughta try\" status to","useful":1,"cool":1},"MtaY1YD20OF3KZQ5YG5UQQ":{"text":"Service 5/5: There was no queue when we went which was great! The waitress seated us very ","useful":1,"cool":1},"0ED_d7r5i6sKgZC5WPSd7A":{"text":"Great service + great food. The shrimp & grits was the bomb. I'm not sure what their butte","useful":2,"cool":2},"YA9GeFCQSSQTlZu_c_gGuw":{"text":"Great Bloody Mary. Delicious breakfast! I had the Cuban breakfast without meat. My wife ha","useful":1,"cool":0},"QS8E4HH7YnAdU9We5Dfjbg":{"text":"Absolutely DELISH!!\n\nTheir breakfast was insanely good. Their drinks, EVEN BETTER. Came he","useful":8,"cool":10},"S8aMc8E5izLjtpdCz2uOUw":{"text":"Glad to have this local brand in the neighborhood. I'll always be a fan of a breakfast pla","useful":2,"cool":1},"4tNiTLpRQ0o3nY2PGb7vNQ":{"text":"Food is always good... but when I tell you my aunts are difficult, they are difficult. I u","useful":0,"cool":0},"KYjzcvHVSbrNmJlvyD2neA":{"text":"Such a nice final brunch in New Orleans. The location is beautiful and not as crowded as t","useful":0,"cool":0},"YF5WOLXbQKds1Q2QNsjE7w":{"text":"Stopped in to grab a breakfast and picked this location since we were staying nearby. On a","useful":0,"cool":0},"CQMKm_YzpBftb-ID_ghtFA":{"text":"This place had great food.  The locals swore it was good and it was great.  Great service ","useful":1,"cool":1},"BHBhJCsRN5sbAMyYdb83Pg":{"text":"We ate here for breakfast and it was really fun.  There are a couple locations and this on","useful":0,"cool":0},"qzITLP6_ugUrEiQ0-ZJ7uw":{"text":"If I hadn't eaten incredible shrimp and grits just two days before I may have had a higher","useful":1,"cool":0},"XXql0kDeGqOvIMDSr6PrXg":{"text":"Me and some friend came here for breakfast/brunch and the food was FABULOUS.!!!!!\nOur serv","useful":2,"cool":1},"2tzjExYGtURJvdSXSBKqxw":{"text":"Nice atmosphere and friendly staff, but the food was terrible. \nThe biscuit was doughy, th","useful":0,"cool":0},"_CbdH-gSQaKMqZSiOcMbsA":{"text":"Ordered Ruby Slipper uptown for brunch last week. The sliders were pretty good. I definite","useful":2,"cool":1}}