{"mDsMulXcK8qJHNgu-QnGvg":{"text":"Food was good, drinks we're better, service was best. (April you are a rockstar). I just w","useful":0,"cool":0},"sUcuVAM8mtce6EeZTwvpbw":{"text":"Awesome had the crab Avocado app and boudin rolls, pepper jelly was to die for. Hot garlic","useful":0,"cool":0},"2yCj86zjwPfnRaUSImewGw":{"text":"First ever distillery restaurant in NOLA.  Fantastic brunch with bottomless vodka bar whic","useful":2,"cool":0},"FCVcjDTR8yxr8-SyA-r_Xg":{"text":"Happy hour deals are amazing and include seafood. The boudin egg rolls were awesome paired","useful":0,"cool":0},"t9PTPm8zZUI95CIu4I3ziQ":{"text":"Would love to be able to rate the food and drink but unfortunately the only thing we were ","useful":0,"cool":0},"enyKj6D4mFVw58miawX23g":{"text":"French toast was great. Everything else we ordered was just so-so (salads, omelette..) Slo","useful":0,"cool":0},"RWP_bBnrSUNx5JUaiAvDAg":{"text":"Came here with a group of friends for dinner. Heard great things about their brunch and di","useful":3,"cool":3},"CHK9d3jIVC5_6-suG1WblQ":{"text":"Finally made it to the restaurant as recommended by a friend. This place is awesome. Servi","useful":1,"cool":1},"RGy9HbmHPWF4_z8-nHUpOg":{"text":"Délicieux. First eatery stop in New Orleans. The Blind Pelican was what our hotel suggeste","useful":1,"cool":0},"_MzDkAhQ6WPuEppfHUKtSQ":{"text":"New Orleans has so many food options. It's hard to know who has the best food because ever","useful":3,"cool":1},"2grod2SlhFcZdB-oqoh93w":{"text":"First off, this place has really cool features in the building, but okay food.\n\nFor appeti","useful":2,"cool":2},"osNO_F5HGCQ2o8rt6LcW8A":{"text":"One of the best meals I've every had.\n\n-The crawfish mac n cheese\n-Coconut chicken soup? o","useful":1,"cool":1},"N8t7fe-FYxze0zjqoMNwaA":{"text":"The food and service was excellent.  The staff was very nice and enjoyed giving us recomme","useful":0,"cool":0},"CflWHMTTmccLIaH_RQGKVw":{"text":"I was extremely disappointed with the food. We got the Iberville salad and the Lee Lee san","useful":0,"cool":0},"2GjIuITLiMotTx5vd2EWBA":{"text":"Was very excited to try this place as an out of towner. The pictures online look great. Ho","useful":0,"cool":0},"-gS-gUDpltfgfWjbS6DOuQ":{"text":"The dinner was amazing, best redfish ever over popcorn rice. Also had a fantastic piece of","useful":1,"cool":0},"TB7Vh53YbOWbQsbI2KTFgA":{"text":"My husband and I were visiting New Orleans for the first time.  Celebrating 35 years of ma","useful":4,"cool":2},"LeIErr6ZGO8C8CUoMaYDRA":{"text":"Wow! I had dinner at Lula with a couple friends and everyone was impressed. I'm reviewing ","useful":3,"cool":0},"byt3uMSByW-d7JFtec1w_A":{"text":"Excellent food, excellent service and reasonable prices! What more could you want? The wai","useful":2,"cool":0},"fbBwhyBzm__BSedAdVYHCA":{"text":"Food was good, but the drinks were great! The house made vodka cucumber cocktail stood out","useful":1,"cool":0},"3zjWKg92DW09DT25wsDSow":{"text":"The atmosphere is nice, the drinks are good but the food is just okay. Definitely not what","useful":0,"cool":0},"mrlc_ca-4XD-C9voVRyw3w":{"text":"Have to say that we chose this because it was right down the street from our hotel. But! I","useful":0,"cool":0},"1YGUX_bEPmeS7mafdRKnDw":{"text":"My sister and brother-in-law booked a small get-together event at Lula's as their rehearsa","useful":0,"cool":0},"QmTaLwf1HI6KkaVEW3UqKA":{"text":"Delicious food, stylish, clean interior, and good service! We couldn't resist to a freshly","useful":1,"cool":0},"jUZjelUIBNfgdCwB08Efxw":{"text":"Great location, great atmosphere, great staff, great food.  Very spacious, modern rustic d","useful":4,"cool":1},"OPBIK_UhJpprENdHHL_B0g":{"text":"Great food, friendly customer service, and fair prices. I would definitely come back. It's","useful":0,"cool":0},"V_6G2XfdUp5B0OCeUhNyoA":{"text":"We came here really wanting to love this place. The location is great, and who doesn't lov","useful":1,"cool":0},"1gs7aXg9ijQuA9diiudjig":{"text":"Great food and the vodka was amazing. Highly recommend for brunch and Britney was a great ","useful":0,"cool":0},"MWNReXpyHznovOewcMx3IA":{"text":"First things first, it's a distillery. Rum, vodka & gin. Take me at my word gin is not eve","useful":0,"cool":0},"JVL9IJHVCNMKk-H4s000Eg":{"text":"If you are in NOLA and want a neat place to eat that's not in the quarter, give them a try","useful":1,"cool":0},"-nGU1Xw44dX9d1NDakHzng":{"text":"Really incredible food. Best shrimp and grits I have ever had! We did the $20 bottomless v","useful":0,"cool":0},"qWYhb_8aEyfyE1mbVpDT3w":{"text":"Went here for dinner last week and it was sub par. Had the drum special on a bed of rice. ","useful":3,"cool":0},"vRbSzMinOGJWk4_W_6J52A":{"text":"I think if I ate here first I would never go anywhere else in New Orleans. The crab claws ","useful":1,"cool":0},"jwHtJ2WJcoDVP10KS7Y5Aw":{"text":"My wife and I had a nice lunch on a Saturday at Lula.  My wife had the Coolinary special. ","useful":0,"cool":0},"ouirqjRR4UGIU6Ufueet1A":{"text":"Enjoyed a delicious meal, grilled vegetable salad with steak. Cocktails are fantastic and ","useful":0,"cool":0},"FMkYpWc2jM64SnjT0V774g":{"text":"Been hear plenty of times for drinks, but was very surprised on how good the food was. You","useful":0,"cool":0},"O4QM8fc5A3SF8cQePKJCZQ":{"text":"Stopped in here for a Sunday Brunch based on the high ratings others have given this place","useful":2,"cool":1},"TlbnlSh8BMnHehaaKB5Mkw":{"text":"Amazing food.  Hand crafted spirits and the best customer service !  Thank you Rhonda for ","useful":0,"cool":0},"iAv2XSTejp_eO2gzX9Q_Og":{"text":"Beautiful inside and good food. We had vegetarians and non vegetarians as a part of the pa","useful":1,"cool":1},"0swJdhi9rCWimUXkWXoG5w":{"text":"Maybe it was an off-night because there were multiple huge parties and a private event nex","useful":1,"cool":0},"-o2thxk8ZOW54C4zkdQPgA":{"text":"The restaurant has a cool vibe with a friendly staff.  Their home brew vodka is excellent.","useful":0,"cool":0},"sgqdfqViQdBP9I2l4xQhdw":{"text":"We visited this restaurant for the first time with a party of two, on Saturday, September ","useful":1,"cool":0},"7fyxWr9eRPgAYfTQy7U53w":{"text":"Amazing cocktails, delicious food, great atmosphere. Pork skewers, escargot, rum lacquered","useful":0,"cool":0},"GomdNqkLgv6VFSbbgMAZmA":{"text":"This restaurant and distillery has got it going!  Josh was so helpful and provided excelle","useful":0,"cool":0},"IX_APH8StSFmRv_LIVG58g":{"text":"This restaurant is the BEST! The ribs here are truly fantastic! The rum and vodka is out o","useful":0,"cool":0},"paiRirApruMplxINCjcHJQ":{"text":"If you're in the neighborhood of St. Charles and New Orleans you must go to Lula!  the vod","useful":1,"cool":0},"_0OMoZanJnfxbP7CArHNsw":{"text":"Let me start by saying,  absolutely beautiful place. With that being said looks alone are ","useful":1,"cool":0},"3pNvQONHaHXIXsZARpMKqQ":{"text":"This was my second trip there and it was still as amazing as the first time I went. I got ","useful":0,"cool":0},"PkiJN0QhoLMJd3mEM-httQ":{"text":"Second time visiting Lula. The first time was definitely better. Maybe because of the nove","useful":1,"cool":0},"5oGwvMndwQxuD54srCefCA":{"text":"Fish dish, Cornish hen and hamburger were great. Smoked pompano with avocado and picked mi","useful":1,"cool":1},"Y_v66wUGGqZKyso0Ajo1YQ":{"text":"Lula had a very cool atmosphere! However, the service was just ok. I had the boiled seafoo","useful":0,"cool":0},"XNCba4RdUNU-kItf6Qrc5g":{"text":"Was so excited to try this place. Unfortunately, I will never go again. First off... my fr","useful":0,"cool":0},"X0FYvaBVPhXRybiRB2Oahg":{"text":"We live not to far and usually get amazing service at the bar, but tonight the bartender i","useful":0,"cool":0},"Fd0LrnfmWUTB2t72nNQNJQ":{"text":"Update: the restaurant owner reached out to correct this issue. Additionally after hours t","useful":0,"cool":0},"J20dOMTmDNBfqD5A864s2A":{"text":"Dudes, come on. I get that the awkward period between Thanksgiving and New Years might be ","useful":0,"cool":0},"InYGxMNM_q-r2g8IFwwu8Q":{"text":"This was definitely the best food we ate in NOLA. I had the hot garlic shrimp and a daiqui","useful":0,"cool":0},"AZhMV-HboA6FzqNoEo_eDQ":{"text":"Review for private event in the space to the left of the restaurant: \nI want to give 3-1/2","useful":0,"cool":0},"xfsZaLb7OvwKWwyTBW0leQ":{"text":"On a very wet Saturday afternoon on NOLA, we decided to walk to this place. It was a very ","useful":1,"cool":0},"YAZydiabEdUEeDmUIGFR8w":{"text":"$20 all you can drink  self serve vodka bar on the weekends is one of the best deals in to","useful":0,"cool":0},"O_H7KLHfNDQgvqzzGLxQfA":{"text":"We had a wonderful experience working with Erin at Lula as we planned our wedding receptio","useful":1,"cool":0},"rYAkOU7Kku7rj0BTtRhSFw":{"text":"Awesome restaurant! Great atmosphere, great workers, great food! Nathan, our waitress, was","useful":0,"cool":0},"0-efNFDfWcKW0ptCF3ulFw":{"text":"We arrived on a quiet Saturday for lunch. There was plenty of outdoor seating (not much sh","useful":1,"cool":0},"4-IpIOgq63CnoFITMRFZBQ":{"text":"Easily the best place we ate at our last trip to New Orleans.\n\nWent here for brunch and al","useful":1,"cool":0},"ZMrYTz6_qG-rNv98pDRFug":{"text":"Fantastic restaurant with great food and drinks. Apps were reasonably priced and well prop","useful":0,"cool":0},"BnI8XfZ2F823KMg-ZHHQVQ":{"text":"My friend and I went here for brunch and waited for 45 minutes and a server never came to ","useful":0,"cool":0},"xa5sbiOj_q9_xhphbiXwAg":{"text":"Great food and super friendly service. We went during happy hour, and I must say the cockt","useful":0,"cool":0},"EvNlJyztEdJ5dsK6U8I_cQ":{"text":"Such a disappointment... The mojitos and crawfish mac n cheese were good but I'll stop at ","useful":0,"cool":0},"gc-ZjR0KyVbgy-QUvg7qmA":{"text":"This place is amazing. The food is good but what made them exceptional was their service a","useful":0,"cool":0},"pd2pd6ADK49y9HxUmRA82w":{"text":"Wow! What an amazing place. Totally kind, great food, and great spirits! We had their flig","useful":2,"cool":0},"9xTZL2CNY7pQJD_kp9A9eA":{"text":"I randomly found this place when leaving Krewe du Brew a few doors down. I ordered the Gul","useful":2,"cool":2},"E4XKrB1P6s_435bZ3AjXpw":{"text":"Went for brunch.   Delivered one item completely wrong then brought correct sandwich with ","useful":0,"cool":0},"pJlPNPqIhEI695gKN2eS1g":{"text":"The service was awesome !  The Collins with the made on premise alcohol using local sugarc","useful":0,"cool":0},"9KIYPjS8mQzcOBarF9vdLA":{"text":"This is a genius idea and well done. Tasty spirits, delicious food, friendly staff and gre","useful":0,"cool":0},"4WAz_7I5AovqGLGXUMUiQw":{"text":"Great happy hour until 7pm weekdays only.  All drinks are $5 during happy hour & the apps ","useful":0,"cool":0},"BPl253eSKk-AOnZiI2Ubdw":{"text":"Loved the ambiance and drinks but food was less than stellar. Crawfish Mac n cheese, very ","useful":0,"cool":0},"aUauGD3uYUTtJZgWxjJAjw":{"text":"Great dinner options with Tuesday night trivia! (See tips.) Mel, bartender/server always u","useful":1,"cool":0},"HJjdDkZ31wSooEadMWbumw":{"text":"We went to Lula's for lunch.  St. Charles street is away from the crowds so it was nice to","useful":0,"cool":0},"lXQurH3BTjmO-aZjv5Mirw":{"text":"My sister and I stumbled across Lula Restaurant and stopped in for brunch. We had great se","useful":0,"cool":0},"Nj1iFQD4asquK58Sb3L6kQ":{"text":"You have to get the Hot Garlic shrimp. It is the best shrimp sauce I've ever had. The hous","useful":0,"cool":0},"pmYEOOGVXCzy88gTWNFvEw":{"text":"Our group was eager to try Lula's after reading all of the reviews.\nWe found the house mad","useful":0,"cool":0},"9q5TLlkbBWVir4KwlsPLng":{"text":"Good food. Good service. Good drinks. Loved the atmosphere.\n\nHad the boudin egg rolls. The","useful":1,"cool":0},"8LY5FsiPHNF7XVezKdulMQ":{"text":"Love this place! They make their own gin, vodka, and rum which is strong and awesome. The ","useful":0,"cool":0},"1iBmyNJ4tNXLPU_PJhcypw":{"text":"This place is awesome. The food was GREAT, the service was amazing. We went for brunch and","useful":1,"cool":0},"-y-TO78UE228fzrVGnDjkg":{"text":"Lula has a nice ambiance. The food is amazing, fresh and made to order. They even get cris","useful":0,"cool":0},"HlbXYxX-y_vITg2W5q9aqQ":{"text":"Enjoyed this place! We had the seafood boil shrimp, avocado pompano dip, boudin egg rolls,","useful":1,"cool":0},"e8f6fuSGGggbIWOyiq0VQQ":{"text":"Super super friendly staff, the food is wonderful. We had the escargots appetizer and brai","useful":1,"cool":0},"v_5CpojosMLW6kfwV7Bzuw":{"text":"Loved it!  Great bloodies and cocktails!  Food was interesting too. Go for brunch or lunch","useful":0,"cool":0},"53AJmTWje4853dWS2oHqvQ":{"text":"Great atmosphere, even better food. Had the boudin stuffed quail that was very flavorful. ","useful":0,"cool":0},"mbQgayLtjxAcejsgBHgLEA":{"text":"What an amazing brunch spot! Brian was an excellent waiter and even accommodated our (grow","useful":0,"cool":0},"zgpRAa-w0uJLTD0Q3CEoCw":{"text":"Just found this gem across from my hotel. Dinner recommendations from the bartender Nathan","useful":0,"cool":0},"ek9_VTLN5R4FWbRjU0cBHA":{"text":"Try the Vodka Basil Smash! Absolutely delicious and refreshing! Very modern establishment ","useful":0,"cool":0},"zSdkxBAYwt9UMYec0SdEKA":{"text":"Overall this place was excellent. Had the skirt steak and my girlfriend had the Cornish Fr","useful":1,"cool":0},"kJJ5EOeX9ZmF_uoPDIfuoQ":{"text":"Great place.  Huge sandwiches.  The fried chicken is fantastic.  Ask for the distillery to","useful":1,"cool":0},"f_J9bX8Gks6sWmcy6qv5sw":{"text":"Nice brunch spot in NOLA. Nice environment.\n\nOrder the shrimp and grits and receive your b","useful":0,"cool":0},"WyNdl-xe8PuOcxg5Xoms3g":{"text":"It's the third meal in this city and environment is very good. The food is delicious too. ","useful":0,"cool":0},"mM9ZNJcYds4uWztu0GtKKw":{"text":"Had this business booked marked on my to do list during my brief trip to NoLA. So happy I ","useful":1,"cool":0},"1ggfDpeuWGND0XazOax9lA":{"text":"Hands down the best restaurant so far in NOLA! I had lemon grass shrimps and omg it was am","useful":2,"cool":0},"K58KSbpXCfGSK4oN8CNtcA":{"text":"Appetizers: crawfish mac and cheese, pompano dip, fried pickles, and boudin eggrolls- all ","useful":0,"cool":0},"ahd_tujIuv9Q2ywCUHdWnQ":{"text":"We came on a Friday afternoon during a preseason saints game and had a very enjoyable expe","useful":0,"cool":0},"FTG14V4Q_PyfOpR6NeDuoQ":{"text":"This place is definitely something else. My company and I were here for a trade show so we","useful":5,"cool":1},"wQpdQ_YHVB7EvJ2PnVupjw":{"text":"I dined on a Sunday evening with my son and child. After being seated by a confused hostes","useful":0,"cool":0},"rNEfikAyNtWs_1tI00Yyqw":{"text":"Great food and excellent cocktails.  We're glad you're on St. Charles Ave as this would be","useful":0,"cool":0},"LXiBjeusUZs4vQtH2LQ6Vw":{"text":"I didn't eat here, so this review is only geared toward the drinks, staff, and ambience. E","useful":0,"cool":0},"pb0uu0qFXgwc2a5F6gr61w":{"text":"Beautiful place! Delicious cocktails with house-made gin, vodka, and rum. They also were r","useful":3,"cool":1},"8QlDzW-yhKEoKsszPxQpcA":{"text":"Decided to have dinner here while visiting NOLA as yelp had given it a \"hot and new\" ratin","useful":0,"cool":0},"XvRAJ5q0degKLTwzKMo7Zw":{"text":"The house made Rum was Amazing.  The coolinary menu was really very tasty.  I would come h","useful":0,"cool":0},"-CUiMWuY7hyRQukGjNRhFQ":{"text":"A one of a kind atmosphere in New Orleans . It is beautiful with the distillery behind gla","useful":2,"cool":0},"SDRg2nw6qcgt60mcvODoqg":{"text":"Boiled shrimp with lemongrass, chilies, etc was amazing and Cornish Hen was very good othe","useful":1,"cool":1},"S7MS8pGWSxXoOTRT5d087A":{"text":"Just an FYI, if your looking to do a private gathering/dinner Lula is the place to be.\nOur","useful":0,"cool":0},"d37A2Ov-Eh0eH0GDM6tnzA":{"text":"Awesome dinner after a long #NOLA weekend ! Nathan showed love with the hospitality for th","useful":2,"cool":1},"Q7bjkQb5vTpSvc4gLTCg-w":{"text":"First time stopping in here for brunch, the food was amazing and the service was just as g","useful":1,"cool":0},"gV6pcCTlm3AGmINzo89FwA":{"text":"Only 3 tables full on a Wed and Service was lousy and if I hadn't been w a friend who reco","useful":0,"cool":0},"VYY2cO7ObewkeJqcPsMi4g":{"text":"I really enjoyed the ambience. I sat at the bar. My food was delicious. I ordered the frie","useful":2,"cool":0},"Gbycr_5oUhEziGegyA6LAA":{"text":"Great new restaurant. Needed a place to eat near the Garden District and thought we'd chec","useful":0,"cool":0},"otIquvM2gHkXtMiaG4rmgA":{"text":"Fantastic time eating on the patio on Friday evening!  Food was delicious, service was fan","useful":0,"cool":0},"-2NyoC8wj-Y_W0D8eirI9A":{"text":"Nathan provided great service, went above and beyond to make our evening awesome.  The fri","useful":1,"cool":0},"Qankv3xmuSb73LiAWMPx8A":{"text":"We had lunch reservations for 16. We were seated promptly. Everyone totally enjoyed their ","useful":0,"cool":0},"UmLx9h9ueD7G1Zo1SU36bQ":{"text":"Have been here a few times. Food is good but the bar is weak. Have had the steak salad, ap","useful":0,"cool":0},"vLilHcNM_ekbDrsmGFd27w":{"text":"Hopped off the St Charles streetcar on the way to the French Quarter to eat lunch. Love th","useful":0,"cool":0},"ICaSxkiVMfQjzn-vWunFow":{"text":"Been doing the COOLinary circuit - Galatoire's, Upperline, La Petite Grocery to name a few","useful":0,"cool":0},"qyzyyFoL3UT9XngHpsQRVg":{"text":"Group of 4... everyone ordered something different. I have the fried chicken sandwich. Oth","useful":0,"cool":0},"gdW93DtLpNPZBhKj8szgdQ":{"text":"This spot was on my MUST TRY list when I visited Nola for a week. It did not disappoint! H","useful":0,"cool":0},"hTEfLP1-UcjBiPslO71k4g":{"text":"This is a great lunch spot. The fried chicken sandwich, on the lunch menu, is AMAZING! If ","useful":0,"cool":0},"pZgRD7s2L7UXUNFwx_gY7A":{"text":"To start, the bartender Sarah was pretty cool. She gave us some good tips of things to see","useful":4,"cool":2},"FcoYFclAxClNRQBTZLw1mQ":{"text":"Great service, great food, great drinks! Love the concept of this place and the decor.","useful":0,"cool":0},"FkvN4P2ibmsOVcfzzkDOTg":{"text":"what a great concept. Drinks and food were incredible.  Nice job.","useful":0,"cool":0},"cp629bE16tqar9wlX0YNlQ":{"text":"Beyond outstanding!\nDaiquiri is served in a sweet old style glass. Deliciously tart and ju","useful":1,"cool":0},"NMVfifwputP-SAWUWs-xTQ":{"text":"I'll start off by saying that our server, Meredith (I believe) and Jessie (owner) were the","useful":1,"cool":0},"z6RNncq-67K_GgpQzkpVfw":{"text":"I was visiting the west side of New Orleans and my girlfriend recommended to stop at this ","useful":0,"cool":0},"FqqK83fGlEC0lc8PRaMRVA":{"text":"Loved the location and how it was set up inside. Really nice atmosphere!  The food was pre","useful":0,"cool":0},"FLJ_uSo-U_d4wQSnj-lt5g":{"text":"Came for dinner and the food was excellent. I was a bit reluctant because the atmosphere i","useful":0,"cool":0},"vNf1sDv6G4EeR3-fSY5CSw":{"text":"Great food, signature drinks and atmosphere.  Excellent dinner menu and staff was very att","useful":0,"cool":0},"UdqHUsBdHZYzxqrgi0bPrg":{"text":"Arrived in NOLA and was starving so my mom and I decided to grab a little app before walki","useful":0,"cool":0},"a68gczErvZ08zsrqaa098w":{"text":"Very modern/trendy feel to this place. There is a huge patio on St Charles where you can w","useful":3,"cool":1},"rbXuFa0hkhdXMMHsXHeD2g":{"text":"Superb food, atmosphere and drinks. A must visit if you are in Nola! Bartenders are the be","useful":1,"cool":1},"0G4pErNT_2p2wz3v_vf0Aw":{"text":"First time here and won't be the last. House made gin, vodka and rum were outstanding. The","useful":0,"cool":0},"qOyB8BOfjbFhJANguGhLhA":{"text":"It is a very clean, modern and spacious restaurant. Came in a group for lunch, service was","useful":1,"cool":0},"Kb8a5fTZP9qxyK10_VvJfg":{"text":"I was in town from Cali where we're no strangers to good food and service. But Ive gotta s","useful":0,"cool":0},"9_P0S3Q5TEyklviESOYE0Q":{"text":"Great food, fast and friendly service. Fried Cornish hen yummy. Dessert was amazing- the c","useful":1,"cool":0},"HA9y0wDhDpARWOfh54jkzg":{"text":"Very hip place. Fascinating to watch the distilling process firsthand. Good service. Food ","useful":0,"cool":0},"lBwTGn3WOCPqSKsKhZiYZQ":{"text":"Came here for brunch and loved it! A very cute place with really tasty food. We started ou","useful":0,"cool":0},"_CAA4DQnIOWF5R_DIYRMhg":{"text":"Checked this place out with a group of 10 and everyone loved it! Keely did a great job tak","useful":0,"cool":0},"gzodEj6HEPS76MbQtOH1Yw":{"text":"This place was dope. We ate here because the pelican brief or whatever bullshit overrated ","useful":5,"cool":0},"Vfvf8DFAfQQ8CsdIV4viWw":{"text":"The space is sooo spacious. You can see the distillery at the back of the restaurant. You ","useful":8,"cool":2},"JPeEZ8y39uPaGYzpA6ShbQ":{"text":"I want to like this place so bad but I can't! It has so much potential. It's got a great v","useful":1,"cool":0},"QW4haLK8z5Eo_Q4pkCMIfw":{"text":"We are visiting NoLa and looking for a hearty bite later on a Sunday evening. Everything w","useful":0,"cool":0},"a9f8HQbMzbZhYHBtoFrdiw":{"text":"Food and atmosphere was amazing.  We went If for lunch on Sunday walked right in.  The ser","useful":6,"cool":3},"yskt3Xq1Ky14xTpr0QTAUw":{"text":"First time and probably last time. New Years Eve with party of eight. We ordered from pre ","useful":0,"cool":0},"Z9P4R_Lc4xZiic4t0QjRXw":{"text":"Excellent food.  I had the grilled skirt steak, cooked perfectly medium rare, this may be ","useful":0,"cool":0},"moSX-yrPB5SSEPKQLXy2jw":{"text":"If you are looking for a great time with a group, this is a perfect place to go. The servi","useful":0,"cool":0},"dNJC-wd3k6_9bpbHsnGzSw":{"text":"One of my friend's local friends suggested we try this place.   The place wasn't that busy","useful":1,"cool":0},"E3KnfhQBaRVWi6dm9ukBDg":{"text":"With our server Brittney Wright we had a glorious diet food experience in NO. The food and","useful":0,"cool":0},"7NfSMaGjaPtz-GyCCJ9KWw":{"text":"We were in town visiting and found this place on Yelp. All 8 people in our party loved the","useful":0,"cool":0},"OHvg544ZGzLX86EkIe8jow":{"text":"Had a great experience multiple times. Great atmosphere, food, and drinks. \n\nWill keep com","useful":2,"cool":0},"bGZgoQaVwvo6RIPrQJ7XDA":{"text":"The atmosphere is gorgeous and the service was fast and efficient.\n\nThe food was a bit dis","useful":0,"cool":0},"pICM6WTBoAC1WjClzjNm3A":{"text":"The gulf fish was great - and a nice, light dish compared to usually heavy seafood fare ev","useful":0,"cool":0},"_Ulj6-CxGnb_zhKfZTGfrg":{"text":"A very good meal. Garlic shrimp over fries and crawfish Mac and cheese were delicious. Wel","useful":0,"cool":0},"MEhKo1LhRFkLL6rAx9HvFg":{"text":"One of the worst dining experiences I've had in a while! While the service was satisfactor","useful":1,"cool":0},"ts4QwTCVBNeWPHwvBA5jag":{"text":"Never heard of this place until I went out for lunch with some friends yesterday. \nThe res","useful":1,"cool":0},"xr2N0dks67Qd7v8trM5b3w":{"text":"This restaurant is AMAZING! We had the pickle appetizer (the dipping sauce was delicious) ","useful":1,"cool":1},"ia8_7d639w6JBveVvT2VfA":{"text":"We ended up stopping here on our walk tn another restaurant and decided to give it a shot.","useful":1,"cool":1},"Z4zXYV5nOoTsSQyX2ch8GQ":{"text":"The gin had as very different taste that detracted from the martini. Couldn't put my finge","useful":1,"cool":0},"R7owwihoIwaC8PrD50P5Mw":{"text":"The inside of this place has a bit of a warehouse/industrial feel to it so it is certainly","useful":1,"cool":0},"E3LqrDElzElIDBuF6nc-zw":{"text":"A few friends and I went for a late brunch this morning and found the scenery to be quite ","useful":1,"cool":0},"LT4iiAzvF9L2V5Zr1JHsDA":{"text":"Really, really great fresh grilled fish. The draft IPA and atmosphere was fresh and sunny ","useful":0,"cool":0},"A263oGObjgPiasXw2xiLVg":{"text":"Fantastic not overly crowded love the vodka bar for brunch food was great going to put thi","useful":0,"cool":0},"G3ictPDUSF58jNveRQIaBA":{"text":"Michelle was amazing. She was so sweet. Accommodated my dairy allergy and had great recomm","useful":1,"cool":1},"ltZa0eOuRX9jo3bh-owlFQ":{"text":"Took the recommendation of other yelp people. Loved this place. Rum punch is great. The bo","useful":3,"cool":0},"oxy_Hka4Uqy-W8DastSh4Q":{"text":"Great drinks, amazing food (crawfish mac and especially the cole slaw), and a cool atmosph","useful":0,"cool":0},"bhsga45WMNC4QqZGRzandg":{"text":"This is a hard one. We enjoyed the space and the food while we were there BUT... the next ","useful":0,"cool":0},"-k4jnKmyyNZxpanxePewJg":{"text":"Nice restaurant. A bit slow while we were there but our server was excellent and the food ","useful":3,"cool":0},"aYIghISqOurIMCsrQWxa6Q":{"text":"First time in NOLA and I was recommended this spot by a local. Upon arriving to the destin","useful":0,"cool":0},"ogwHEy2E7L2DaDBZGpaGxQ":{"text":"You walk into a beautifully designed distillery, lots of space and good atmosphere. They h","useful":0,"cool":0},"dpRh2tC8PxbMBwoMjkajoA":{"text":"Service was great ! Food was just ok ! Boiled crawfish had a fishy smell to it and a bit g","useful":0,"cool":0},"wVM8JXk8r6JqDYLlySPB2Q":{"text":"Went for our first time last night. The drinks were perfect. Loved the Vodka( took a bottl","useful":0,"cool":0},"uMJZILpM3s7O9BgUx91DXg":{"text":"Came in to try samples of the spirits.. bartender initially told us the price was $10 and ","useful":2,"cool":0},"LGykBdBGnDvmDpenSSjraw":{"text":"The crawfish Mac & cheese is off the chain and so are the fries. The cocktails are refresh","useful":0,"cool":0},"mxQBkl_j8A57v7yxFHFQnw":{"text":"Food is ok. Bartender is amazing. Table service was AWFUL. We only had one course and it t","useful":0,"cool":0},"qEkT1H45Pj_p_QbbzulNtA":{"text":"We went here and sat at the bar on a Saturday and it was pretty busy but they were able to","useful":4,"cool":2},"_hj8o5BXpohhYAGAZ3HQpQ":{"text":"Beautiful space & distillery. Food was great (delicious gumbo!) and presentation. Spirits ","useful":0,"cool":0},"YUBMGWGCxjJPSEy8KVnd8Q":{"text":"Sounds like this place is renown for cocktails, but, alas, I came in for lunch on a work t","useful":0,"cool":0},"b0vgK3FAbIeDEzNpdmbkXg":{"text":"Oftentimes, I say to visitors, \"I challenge you to find a bad meal in New Orleans.\" Sadly,","useful":5,"cool":1},"K1W5oFj4ItpGIn20kKLWxg":{"text":"We were staying in the area and got on OpenTable and found this place.  It was one of our ","useful":1,"cool":0},"rMOj0Eu5RKiIrXXf1uxwtg":{"text":"Enjoyed Easter Brunch here.  Stumbled upon restaurant after trying a couple of others that","useful":1,"cool":0},"5XWfhANGSk5nwOZawXfuFw":{"text":"Amazing brunch menu with a bottomless vodka bar and amazing speciality cocktails. I highly","useful":0,"cool":0},"vMneDMO2qnarOqWaDsZ-EQ":{"text":"...high expectation, higher letdown...\n\nThe atmosphere and the drinks are by far the only ","useful":3,"cool":0},"494t4W-YAdfE8Z36VGzG2g":{"text":"Lula is one of the best restaurants with both great food and friendly staff! I really enjo","useful":0,"cool":0},"7dRHvDcD2TkX0tVnk04jTw":{"text":"Good food on St Charles, but we had horrible service. Our waiter was friendly but would di","useful":0,"cool":0},"D8irJwKIXayPG_UcgAamOQ":{"text":"Excellent and a must try when in New Orleans! The Hot Garlic Shrimp were delicious and the","useful":1,"cool":0},"cVBiheN89FZ4NETusofnyw":{"text":"Meh.  Cucumber Collins were very tasty, but otherwise I was underwhelmed.  Server did not ","useful":2,"cool":1},"X1SRIMc4cTEcECWtBatk_w":{"text":"The fried chicken sandwich is awesome.  The service is terrific and the ambiance is great.","useful":4,"cool":1},"_eHTVSgwnRWnx0A8oWIpGg":{"text":"This was one of my favorite meals while visiting New Orleans. It was our last day in NOLA ","useful":1,"cool":2},"NuTUrGFoxjhtnn1OgWCzVg":{"text":"Ate there for lunch.  Drinks were great, appetizers and food were good.  We also sampled t","useful":0,"cool":0},"fnFpInOsSpg7jlRurnFoGA":{"text":"Went here for a late lunch / early happy hour waiting for friends to get into town.  Order","useful":1,"cool":1},"bB7Stclx045X28mvsACUbw":{"text":"Location, space, decor, cleanliness, great food, unique & delicious beverages. Check. Chec","useful":1,"cool":0},"DY-cuNZ1Tu5n7ccQK3rudA":{"text":"My goodness, the food here is delicious! I was a little nervous bringing the family here w","useful":2,"cool":0},"Y_f1mMZpe55C051n6utuRw":{"text":"The restaurant is beautiful. The food was great the pork loin sandwich was one of the best","useful":3,"cool":1},"PIUBMsEQxbL0OWHA72QGVA":{"text":"Brunch was great. \nBeautiful inside seating and outside where you can bring your dog with ","useful":1,"cool":1},"lM-6FQrYy8Vv9RTpXWn3Sg":{"text":"Stopped in for lunch.  The first thing that stood out was how clean everything was.  Our s","useful":0,"cool":0},"3ud3PkCShab2RcdPAEu7iA":{"text":"So delicious! I got the fried fish sandwich and the all you can drink vodka. The vodka is ","useful":0,"cool":0},"OvOsvIs75ZQNFldFUPzk6g":{"text":"My kids and I stumbled upon this place while visiting my daughter for spring break. The pl","useful":0,"cool":0},"o_xA4urPL48aixXqZz2hCQ":{"text":"Attention all out of town visitors! Lula Distillery is a must stop locations. Don't leave ","useful":0,"cool":0},"QLDveBvB9_rzKs_qolF0rQ":{"text":"Came here for my birthday and LAUREN was THE BEST!!!! Goodness gracious that woman bent ov","useful":0,"cool":0},"y1HglDwNduLZid4yKsTcMQ":{"text":"Lula is an absolute gem!  The ambience is a bit cavernous, but you soon realize soon that'","useful":0,"cool":1},"ywC5hSNXTFm2sUf8s9UA0g":{"text":"Came here for a date night after looking at the menu and reading great reviews for the cra","useful":0,"cool":0},"Hb61if5vgLuVjPawlS4kLA":{"text":"Service prompt but not particularly friendly.  Food was good but probably wouldn't come ba","useful":0,"cool":0},"S04CVrWOb1XpBMeyhd7X7g":{"text":"I am being generous because they just opened.   I had a bee's knees cocktail and it was go","useful":0,"cool":0},"5E_wp11XyetlOgvdX92NAQ":{"text":"Giselle.. you deserve more than five stars. I'm so happy with your service. I have to just","useful":3,"cool":0},"EqW9geLcBErEHI193rCYgg":{"text":"I was really excited to come here with my friends rom medical school because we read good ","useful":0,"cool":0},"n3PnsKYJr88Wy23ITy2gjQ":{"text":"Great food. Tasty draft beer. Excellent service.  The rabbit and white beans. The fish and","useful":0,"cool":0},"cWYwh5IiNgBMZgQpTFLSag":{"text":"Really good drinks and food but the most uncoordinated service I've witnessed in a long ti","useful":1,"cool":0},"4KQCPEqCyBxfdtSKgwiAQA":{"text":"We were in New Orleans for a week and had incredible food. This was probably our favorite ","useful":0,"cool":0},"xbK7GDyx2VhuM_4bLRTY2w":{"text":"A big let down here after reading the good reviews. The hostess was very nice and seated u","useful":0,"cool":0},"q-LA4MXW4QfW1yxhBcENXA":{"text":"It was great place to eat with no waiting during Essence Festival 2018.  We had a party of","useful":0,"cool":0},"RcInw2PqoLnrEtbhcUzTeA":{"text":"Love the house made gin, vodka and rum. Food is good too! It's worth it to just come here ","useful":1,"cool":0},"a1fMCs64J17-PdgSMr3uPw":{"text":"We had great service tonight and the special menu was really wonderful! The fish was done ","useful":0,"cool":0},"uP9K2PU9r0ChI_5T3YCehA":{"text":"We ordered the corn app and the egg roll app during happy hour as well as cocktails, not b","useful":0,"cool":0},"Qe_fNACyFpr8biez9Z1HvA":{"text":"This was my first time visiting Lula. It was actually for an engagement party. I sat at th","useful":0,"cool":0},"okT11_1PuEZqFVO7ejHFcA":{"text":"I love small places like this. Always it's the same. Someone cares alot about the spirits ","useful":0,"cool":0},"_lk7M7bvwGNxBUDyBNZyQg":{"text":"Excellent food and service!  Finally had a chance to check them out and loved every bit of","useful":0,"cool":1},"S0RcVK1MoQeiacfAPGlXFw":{"text":"First stop in New Orleans, and it was great!!!  Food was awesome and the seafood was as fr","useful":0,"cool":0},"vLVoPiQYeJDY9HEQzBesuw":{"text":"Overpriced, really loud restaurant.  My family and I visited here on a Saturday evening.  ","useful":0,"cool":0},"s2DFKf1k50ewX8DREA-PgA":{"text":"I came here today with a vendor.  I ordered the flank steak and it came with fires and a s","useful":6,"cool":0},"22PpdqRVGI2mzZRqDPaArQ":{"text":"Saw the good reviews so I had to try this new neighborhood spot. The food was good, really","useful":1,"cool":0},"ktaqnMCSl-C6ZQU8bR8X0Q":{"text":"The French 75 is amazing! When you go here, you absolutely have to get a gin cocktail. The","useful":1,"cool":0},"E_RWyR9rwICgrOjGFP95TQ":{"text":"With more than a plethora of great Nola restaurants, u need locals not tourists to thrive ","useful":0,"cool":0},"-I5dQBCg12fU4CC0V-OyeA":{"text":"My family and I came here for a girls dinner. The food was fantastic as were the drinks. I","useful":0,"cool":0},"T_T-gkjqads3l1pxuuPFbQ":{"text":"This place was great.  Fun atmosphere--and plenty of seating. Great beer on tap--which the","useful":5,"cool":2},"pl97l6P6OmKRkXSG-BZuMw":{"text":"Great food, but good Lord what a boring dinner.\n\nDavid and I wanted a date night, so I pic","useful":7,"cool":5},"OQpQtejV8T-5UTl3sBGI1g":{"text":"Stopped in for Saturday brunch and it was delicious. My husband got grilled shrimp spicy g","useful":0,"cool":0},"OX_q1eHNufJNsMS0bcJDlg":{"text":"Place is nice setting. But freezing inside. Service was horrible. Waited long time to be s","useful":0,"cool":0},"rN5wqPiIY02nrXjeuMV94A":{"text":"What a nice spot. We dropped in randomly while walking down St Charles, and had a few drin","useful":0,"cool":0},"mdB_1KMSAt43K-xr09E-vQ":{"text":"4-stars for the 15.32! that's 2 cocktails plus 2 appetizers for only $15 bucks during the ","useful":2,"cool":1},"I6_E0IGVVbzJQxAg0DzkXw":{"text":"The worst dining experience I have ever had! We had to wait over 2 hours for our table eve","useful":0,"cool":0},"yZQe3aExQzNUkPJ1GFFHYA":{"text":"Amazing food!!! Ask for Joey - he makes the experience just that much better. We had a gia","useful":0,"cool":0},"wRcwWeo6WoEdtTbVU1ljcQ":{"text":"We went for the NYE pre fixe menu and it was amazing. The food was definitely worth the $6","useful":0,"cool":0},"cMmIqKTOgBwHY9jCdCsfJw":{"text":"At first I was sooooo sad that they were out of bees knees but then the bartender made a C","useful":3,"cool":1},"8AbT9ovfXVVvGiAK9veoRg":{"text":"Drinks were good but the staff was horrible and completely unfriendly even though there wa","useful":0,"cool":0},"pGFbVFAQbLQhzDeh6jeD6g":{"text":"What a nice evening!  Nice atmosphere and the food was great!  Loved the gin and tonic,  h","useful":1,"cool":1},"0ZzwHRxvCBVJDVxkHE1ijA":{"text":"Staff were friendly, place was clean, food was good. Nothing bad to say about the place...","useful":1,"cool":1},"CtdA2z8UuAU7FEMfwSxuwQ":{"text":"Definitely a must-go place! The $20 vodka bar is awesome, you can make your own anything w","useful":1,"cool":1},"DHBBixiVAYt7qjlqOZSlOQ":{"text":"Four of enjoyed lunch here on 4/12. Sat outside, got a little hot and sunny so could use s","useful":2,"cool":0},"EnQqOD7Nynx7ul8-m-_fzA":{"text":"I had high hopes for this restaurant. When you first walk in, you are blown away by the ar","useful":2,"cool":0},"6dTaJvPXg_GFFgehv4xn4Q":{"text":"This was a great place for a company dinner before our tradeshow! 4 of us had the crawfish","useful":0,"cool":0},"-zygSnryyfH9HbCdfXDaOQ":{"text":"Lots to talk about with this new place! The fact that it is a distillery and restaurant is","useful":4,"cool":3},"CJqTudpqZv-G2Gin8eH2QA":{"text":"I've been here for brunch and dinner. I was not disappointed either time. The service is g","useful":2,"cool":1},"V0mBBdfpw0PpbPnbByXEsA":{"text":"Ambiance on point! Food pretty good! Liquor yipee!!!! Hubby and I had blackberry ribs (ver","useful":0,"cool":0},"08cof4IKzngQynhTsGPluw":{"text":"The service was great! The food was good. The restaurant was filled with tourists on this ","useful":0,"cool":0},"2YffLUBs8lQlGo9JrDB6vQ":{"text":"Lula makes great gin and vodka (and presumably rum, although we didn't try that) and we to","useful":2,"cool":0},"0jMUsVKIYby_Y5VbECcAKA":{"text":"Mya is an excellent server!  She knows her stuff!  We LOVE this restaurant!  The crab and ","useful":0,"cool":0},"cc17PyFLWNsnpcgmSwJWlQ":{"text":"Lamb chop and fish sandwich were amazing! Highly recommend! Yummm also, the cocktails are ","useful":0,"cool":0},"TGY2KAbBODgbGxhnBHScBg":{"text":"Lula Distillery is a relatively new place on the CBD end of St. Charles. It's located in a","useful":0,"cool":0},"QNjFFafaVrtA4o3-JuLSmQ":{"text":"The reviews on this looked good so we tried it. We were sorely disappointed. While the qua","useful":0,"cool":0},"1e1VWuwCZQL8jOEV1n8xSw":{"text":"We went here for brunch and I was very pleased with the experience and meal. The staff was","useful":0,"cool":0},"pOfa4SFhBNA-syiFCHtOgQ":{"text":"This place is beautiful!! The inside has a tall ceiling and there's lots of seating includ","useful":0,"cool":0},"z4NSu_roonIthpIU9xeZ1w":{"text":"Not impressed at all. Not sure if we hit on an off night, but this just plain wasn't good.","useful":0,"cool":0},"dYU8r3qLA5i2MAxTgpdTPA":{"text":"As the title says, they distill their own liquor and make amazing cocktails.  In addition ","useful":1,"cool":2},"xqIlmKVJuBC_ojc8YkBxTw":{"text":"Our bartender was great! The vodka was tasteless - in the best way. Be sure to have a vodk","useful":0,"cool":0},"dlY9x69TekE2CSprvfL-lA":{"text":"Oh Yelp, you've helped me hunt down a new, amazing place once again. While staying in the ","useful":4,"cool":3},"rq0EGcspqKTc753Ns2CgUw":{"text":"Loved the restaurant and the staff. Highly recommend the gin and tonic! Best gin I have ev","useful":3,"cool":0},"CbEqb768hcMTy40uGJ7uwg":{"text":"We came in on Sunday at noon (with a reservation) as a group of 8 out of towners. We picke","useful":0,"cool":0},"yEDyKPuhqRmcOEOH1N8Uug":{"text":"Met a friend and sat at the bar. Ordered two martinis which I watched the bartender make s","useful":0,"cool":0},"O1aR5mrkG9fIpAnw1JuG6w":{"text":"We always have a wonderful meal and drinks at Lula's! The food is so good and they have a ","useful":0,"cool":0},"wF2SF0XkiC29zqepplWbSA":{"text":"This was a great find. 4 days into a NOLA vacation a quiet delicious restaurant distillery","useful":0,"cool":0},"N3dVijSqm7KU1vW16hrEFg":{"text":"This place is pristine. You can see the distillery vats in the back behind glass and they ","useful":3,"cool":1},"jGJWAw6rJVLYNaJCJ-xebg":{"text":"This was our first time In New Orleans! Myself and some friends were looking for a good pl","useful":0,"cool":0},"Lno6Aj27sFQmycns7kw8xA":{"text":"My friend and I went to Lula for brunch on a Sunday.  It wasn't busy at all.  Yet, we sat ","useful":1,"cool":0},"Cb9_GSjnO2EYXyCO6jbn5A":{"text":"Food was great as well as service. The restaurant has a food atmosphere. I def plan to go ","useful":0,"cool":0},"slR-Y5LnWJCQql1ynGDMyQ":{"text":"Lemongrass shrimp boil over fries was a yuge, yuge surprise. It was magnificent!  This pla","useful":0,"cool":0},"WulbYwmJG4RzC4cJwNCSPg":{"text":"Wow. Absolutely amazing food and drinks. Definitely check this place out when you're in Ne","useful":0,"cool":0},"Le2g4sgS_llvDPOYIbVxPw":{"text":"Sooo,  a food friend and I wanted a place we've never been and decided on patio dining at ","useful":0,"cool":0},"1XeNHXRuX_JlFEqO_ZEi0w":{"text":"A fantastic experience!  The food was wonderful and the staff was beyond friendly.  Take t","useful":0,"cool":0},"9D7gjaa6ByQP7voo2Z9qWw":{"text":"We wound up at Lula on a whim since they're one of maybe 6 restaurants in this city who ta","useful":1,"cool":0},"5MP-Laus3aDEJi3BDbl3uA":{"text":"We loved the house-made vodka, and we sampled the boiled crab legs with French fries, corn","useful":1,"cool":1},"Fd7M4h27Erp1Ls-u5cOOTw":{"text":"Went to Lulas this week with some co workers for lunch. Ordered the pork tenderloin sandwi","useful":0,"cool":0},"fGyf6XUs9GiaTnN8u3GfOQ":{"text":"We shared the Crab Avocado Dip and Sugarcane Pork Skewers as appetizers and both were equa","useful":0,"cool":0},"vl5fbq26BbKKRUuXgM7Ahg":{"text":"I really enjoyed sitting outside viewing St Charles. New place in the area. They opened du","useful":6,"cool":3},"s5h4hhzOsql1D1FcInecLw":{"text":"Seriously, don't bother. Hostesses were not friendly. I sat at the bar and was never greet","useful":0,"cool":0},"vSqZClK_4seOKY4FgPCPrw":{"text":"Service is quick and food is excellent! Our server was so accommodating to our two year ol","useful":0,"cool":0},"9afcRggOsKk4VM6TT22Z4Q":{"text":"Solid spot on St Charles with ample parking and an eclectic atmosphere. Great service, goo","useful":0,"cool":0},"Q0Vl5rx8qUJPOuoR8aW8CQ":{"text":"Perfect patio for us pet parents! Service was great. $5 cocktails on happy hour. We had th","useful":0,"cool":1},"godnVELkz-caAsttQ5sggw":{"text":"Excellent choice for a late Brunch. We enjoyed Pain Perdu, Chicken & Biscuits & the Des Al","useful":0,"cool":0},"tRpsLqI86QgH2w6voZs6Hg":{"text":"Came here for breakfast and Bloody Marys. They have a $20 bottomless vodka bar at 9am... A","useful":0,"cool":0},"xSzV_1kMFCWuDNisz55BSg":{"text":"The food was good and the service was fine. Was not all that happy with the rum punch it w","useful":2,"cool":0},"VivSM0ASMXC8H-4Md2NGNA":{"text":"We loved it. Use the trolley from CBD or the FQ. great food, excellent service, boudin stu","useful":0,"cool":0},"IzugFqaf1m7-ubG6SwGN1w":{"text":"I LOVE Lula!!! Great service, food, and drinks!! We've had a blast going for Mardi Gras an","useful":0,"cool":0},"nNm33d7nBwZ4JZJKowGiPA":{"text":"This is one of my favorites in New Orleans. The restaurant is designed in an inviting way ","useful":1,"cool":1},"PgTud9n1KqbSjBEHLlSQWg":{"text":"Worst service ever. The attitude I got by the hostess was inexcusable. The waiter that ser","useful":0,"cool":0},"yUxvC_uIAcHRbP67ZvF9qA":{"text":"I really like Lula. I've been there twice, and despite not liking the appearance that much","useful":4,"cool":3},"jRgxSOL_qsGhuBtX5ZHjuA":{"text":"Really tasty!!  Lamp chops and gulf fish were particularly good, and the boudin egg rolls ","useful":0,"cool":0},"CP9rLio9h8wFq6rhtwPRZA":{"text":"Fabulous food, drinks and service. Our server Said took time to explain every item on the ","useful":0,"cool":0},"fHlNkxj4nQcoyPuAmh0AgA":{"text":"The ambiance is excellent! There was a live musician singing contemporary radio hits and t","useful":0,"cool":0},"4njLO-NFU3fMCIP4jA7nEA":{"text":"This place is great for large parties. It has two private rooms along with lots of seating","useful":2,"cool":1},"jn6jlh4CKPDNvSJE_UG22A":{"text":"Great food and spirts! Had the Fried Green Tomatoes appetizer for lunch with Cole Slaw sal","useful":0,"cool":0},"bq8ImvOlroE5Idw0QlP_NA":{"text":"Stopped by as I was walking the streets.  Vodka is awesome!! Took a bottle home. \nCrab avo","useful":1,"cool":1},"Drz-fJCFJKmDNNQGudr5MA":{"text":"We are fortunate to live within walking distance from Lula.  That said, they have takeout.","useful":0,"cool":0},"nwdvMI9wPtlL7LCrNfdcwg":{"text":"I have been to this place twice so far. The first time was in a big group for brunch and I","useful":3,"cool":2},"tjvLPjkz0nNpa8tzMgu3iQ":{"text":"Lula actually surprised me. I've been following this place for a while and was hesitant to","useful":2,"cool":0},"FWhUjnF2EszoLwOkTAjZQw":{"text":"Great spot for brunch the service atmosphere and food was straight like 9:15 and the $20 b","useful":0,"cool":0},"ZLqfL9hrH91KJHXf0ZWUSQ":{"text":"Absolutely wonderful service, delicious appeyizer, entrees and dessert. Was Goin to take p","useful":0,"cool":0},"ul2tAzKsS7XHzh7VC3quiA":{"text":"The basil vodka cocktail and lamb chops were delicious! Went on a weekday and was very eas","useful":0,"cool":0},"0wCc6dcXlFTNBpuiIx5G-g":{"text":"This is my 3rd time at Lula, and as they say, third time's the charm. The first two visits","useful":2,"cool":1},"L3k5QJCT99mo2bs9PJdnyg":{"text":"Just lovely place for a Happy Hour artisanal cocktail and gourmet snack! Reasonable prices","useful":0,"cool":0},"fFLYhwzs9URZr7KOxEdPyA":{"text":"Loved Sunday Brunch here.  If you are looking for a boozy Brunch, then look no further.   ","useful":10,"cool":6},"OvWEzxS3YnuJEiIief4FBQ":{"text":"Just stopped in to get out of the rain and had a great meal. What a nice surprise!  Great ","useful":0,"cool":0},"knu1HcckdXBnKh3FOoaBvQ":{"text":"Went in for dinner and cocktails. Service was great and the food was too. Would really rec","useful":1,"cool":0},"ybAbwBuw-91X3C-ewUxlvw":{"text":"Food was awesome. We had the fried green tomato stack for the app and for the main course-","useful":0,"cool":0},"acN5mkyEY--oBGSrjxCWVQ":{"text":"Brunch is something we don't mess around with in New Orleans. In some ways, it is part of ","useful":2,"cool":1},"N6NZBx-vFNZUNXKfbkyAEA":{"text":"We ate here twice in our 4 day visit to NOLA. Both times were fabulous. I had the cheesebu","useful":1,"cool":0},"4NHHNyL5ruWpduMey2lACg":{"text":"I've been to Lula Distillery 3 times now and each time I go the service, food, and overall","useful":2,"cool":2},"KD_fGGQ-EfwVeJFov1DwHw":{"text":"HANDS DOWN the best boiled shrimp I've had in my life! I found this restaurant on Yelp whe","useful":0,"cool":0},"daS6ZjLcSZUyR5EbBElx9Q":{"text":"Lula is one of our new favorite places in New Orleans! You almost feel a sense of reverenc","useful":1,"cool":0},"KSTTsUafTstY_JAY2fG0zw":{"text":"I did brunch at Lula with two of my girl friends and my daughter. They are very kid friend","useful":0,"cool":0},"1gQwTCapWq-gC9puIpg6_w":{"text":"We sat outside and had the unlimited vodka bar! Was a little upset that we had to walk bac","useful":0,"cool":0},"Cyxw3nkQxTxhjQZRLaUiaw":{"text":"Lula's is the nicest distillery with the best decor. I love the glass wall in the back tha","useful":3,"cool":1},"4lYkni0uNUzP-kJondWrtA":{"text":"Can't go wrong - lots of butter, sugar, and mayonnaise, if you like that. Lots of short cu","useful":0,"cool":0},"CWVLAaGQ-ueITZEPIgi-Ng":{"text":"Must try the crawfish on the secret menu. Just ask. It's $15 for three pounds. It's so fre","useful":5,"cool":0},"ozza5a20IcH_js5SwFDW7Q":{"text":"The gulf fish was Heaven!! The service needs a little bit of tweaking. Not very attentive ","useful":0,"cool":0},"TM4ptRV3ouJJmLo_aQoMJg":{"text":"It's unfortunate that this beautiful restaurant provides such poor customer service. I was","useful":0,"cool":0},"Rs3nWv7ZD-MVQWoMmfSdFA":{"text":"Happy hour late only on Wednesday nights! 9-11pm We had three appetizers on the HH menu--t","useful":1,"cool":1},"0AFL1Xv1t_EzgujvliCfNw":{"text":"Atmosphere is really nice. Food is delicious. What made this a gem, the people that work h","useful":0,"cool":0},"xjmlgfTDb5PQ7Rtqwnnn5A":{"text":"Lula was just ok. The best part about it was the happy hour menu. There were several items","useful":0,"cool":0},"7C-ROP0qjZw6CjtUg2Wk9w":{"text":"Accidentally found this place waking around during the parades. Couldn't be happier that I","useful":3,"cool":0},"dqWhpeGJNQv19npXmonZyQ":{"text":"Mediocrity at its best.\n\nThe good: Our server was friendly and took great care of us. We a","useful":1,"cool":0},"wP45qosi8YUyPBjXPHkfDQ":{"text":"Ambience = 1 ( Little loud but guitar covered it well)\nGentry = 1 (casual)\nFood = 0.5 ( gr","useful":0,"cool":0},"ImhHz2WIY4DxwwW8ybHZZg":{"text":"This place had great food and drinks, in addition to having a lot of space for big parties","useful":0,"cool":0},"BrCWagOR9RezYi_6xtWg4g":{"text":"This place is amazing! Our server Ethan was so helpful and helped us decide on the bottoml","useful":0,"cool":0},"S5BkLmLUSKGw_Vmtfp5iGQ":{"text":"Finally checked this place out for a boozy saturday birthday brunch. First off...the cucum","useful":3,"cool":0},"X9w089ayng9LOfsOU0SIJQ":{"text":"Food was very salty. To the point that I couldn't enjoy it. The distillery makes their own","useful":0,"cool":0},"99wY7SiOyZq08Ce98JfwQA":{"text":"I came here in a group of 9 for Sunday brunch and it was so great!! They accommodated us w","useful":1,"cool":0},"dPvKVRSN-fNEMOkC7CXtpg":{"text":"You might miss it if you walk by, but don't be deterred by the plain exterior!  Everything","useful":0,"cool":0},"6EqHYR-URJ807bmbzTnOXw":{"text":"Today was my second time here. Cool vibe, great service as the pulled pork sandwich( Cochi","useful":0,"cool":0},"JSOUUFvEeMm10qW_D69QmA":{"text":"Neat place. Nothing like it in New Orleans. Clean, fresh, sleek interior with distillery i","useful":0,"cool":0},"pqli4B7956CtB5sdDutPtA":{"text":"This place was recommended by a bartender on Bourbon. Opened on Feb 13, 2017 so it was awe","useful":5,"cool":1},"y2JcMDnLL0fYrlbMYsfVWg":{"text":"Staff were friendly if not always prompt. Place is huge and lovely. Housemade spirits and ","useful":0,"cool":0},"LfQsTl_OVMXR_QutnNKePQ":{"text":"We actually ended up at Lula by accident. A nearby festival was a bust, plan B restaurant'","useful":0,"cool":0},"obeWJwHR1JQf8ZKf2idyhA":{"text":"Food:  4 stars\nService: 2 stars\n\nThe restaurant is beautiful, food was delicious, but the ","useful":1,"cool":0},"isjNHRNqKl-579SpbnCk-w":{"text":"Yum yum and hummers! \n\nHighly recommend the unlimited mimosa bar and the chicken and waffl","useful":0,"cool":0},"39nSJVRDii4RB6vVN4dsPg":{"text":"Happy Hour at Lula is great! You can't beat the $5 cocktails and deals on appetizers. It's","useful":0,"cool":0},"8Y-BGcnC0lvqssJuRPguNg":{"text":"Decent, new wave grub, at a reasonable cost. Boiled shrimp kinda just tasted like the sauc","useful":0,"cool":0},"t87D451cC6G0wrmfgcfFVQ":{"text":"Love this place! Went for brunch and was so surprised by the all you can drink vodka bar f","useful":0,"cool":0},"4jKfkC5jaLpAOPEX72uhTQ":{"text":"My husband and I ate brunch here and I was underwhelmed to say the least. I think the only","useful":3,"cool":0},"LLNhXzqBl4enVV-zrSEYqQ":{"text":"We decided to try Lula's for the coolinary menu at lunch and were just delighted with the ","useful":0,"cool":0},"7rslebeZnW6Q6X1EkEg4-Q":{"text":"Food and drinks were good. Small place for large groups. Outdoor seating needs more improv","useful":0,"cool":0},"h45TAgJpDfpk3IUD8KoyMg":{"text":"I was surprised they offered more than distilled beverages. The Mac and cheese was excelle","useful":0,"cool":0},"EI5iiUC01uz221b_g_rjfg":{"text":"Fabulous service. To die for food... I swear each dish was better than the previous ones. ","useful":0,"cool":0},"TeilIoBIUpse4DFsTLDORQ":{"text":"The crawfish Mac n cheese was amazing. The boudin ball spring rolls and fried pickles were","useful":0,"cool":0},"Ce4Vuh559znDrZzRxjV80g":{"text":"A group of us had dinner at Lula on St Charles Ave. The food was excellent I would recomme","useful":3,"cool":1},"5QZJghsFZ8BMkrsLEEL3cg":{"text":"$25 for the \"seared market fish\". The fish was drum and instead of couscous I opted for di","useful":0,"cool":0},"la4xaJrtbOhdjCXXGkGd_w":{"text":"Happy Heure is everyday from 4pm-6pm\n\nSaturday/Sunday Brunch!!\n From 10am-2m (there is a b","useful":7,"cool":5},"DrbHw4jYP-hujDsKzjGrQg":{"text":"Lula is the perfect weekend brunch spot! They are able to accommodate large parties, we ha","useful":0,"cool":0},"ABjGzMix2GANKaM7JYypVA":{"text":"Great atmosphere and great drinks. The garlic shrimp and egg rolls were great and the Flan","useful":0,"cool":0},"R7Q6lghQhiKUXdIgRcNNAQ":{"text":"We we're here for Mardi Gras parades. The food was good and plentiful. They served way aft","useful":0,"cool":0},"QUJ781pDgxvn4F92YgbqUg":{"text":"Their mac and cheese probably ruined all future mac and cheese for me. So good!! Their spi","useful":0,"cool":0},"_lHmCu48gvuMy7RHM8Mbzg":{"text":"Love this place! Especially for brunch bottomless vodka bar!! How can you beat that!  Oh a","useful":0,"cool":0},"hcg1PEykin4itKbXkYMBGg":{"text":"Update: I can't rave about this place enough. I came here for brunch with some friends, it","useful":4,"cool":3},"s7fhVWKq3Zvq9TLi_85QEg":{"text":"I went here last night for my sister's 21st birthday party. Our reservation was for 7:30. ","useful":2,"cool":1},"WiET7uRT3P-vQrf4lz-5CA":{"text":"Jess the owner is simply magnificent. Totally a gracious, kind hearted 100% customer servi","useful":17,"cool":11},"48lfiEB6e-6yeHMSIWb4ag":{"text":"Great restaurant! One of my favorite restaurants the city! Great drinks exceptional servic","useful":0,"cool":0},"4Zq7t8i4t5efJamTqaau-A":{"text":"Our waitress tonight was amazing! We started our meal with a few cocktails brewed from the","useful":2,"cool":0},"waVKsnUuYaRa3iwJljvpKg":{"text":"I love the look of this place. It's got this industrial farmhouse feel to it and I love th","useful":0,"cool":0},"MaPF21TdPwK8M0aTdtb7fA":{"text":"I really want to love a bottomless vodka brunch, unfortunately, after two attempts, the vo","useful":0,"cool":0},"GaVO8TGQX08QIwI4Y17qlQ":{"text":"We went on New Year's day and the food was great. Next time I'm NOLA, I would like to try ","useful":0,"cool":0},"QrztyY-O7U9fKaICHq16DA":{"text":"Its been awhile since the last time i truly enjoyed a meal so deeply.  Went to NOLA to cel","useful":0,"cool":0},"S6vMMgzvojCGrNLR7_sA0w":{"text":"Drinks are strong and tasty, restaurant is absolutely beautiful and service is great!\n\nThe","useful":6,"cool":2},"i6U_GUjLIc2hWf8n39M8AQ":{"text":"My first visit to Lula was a quick one for drinks before I met friends across the street f","useful":2,"cool":1},"EbnmGAHHNRH9TF4QSjR7Fw":{"text":"What's not to love about this place...legendary cuisine...craft made liquors, cola's and t","useful":0,"cool":0},"aCNnlYKmF2sGBjlyY9PuiQ":{"text":"Great building and absolutely beautiful spa ace at Lula. Service was phenomenal and the fo","useful":0,"cool":0},"Yitukm4ZlWAkYofvHr1z4g":{"text":"Let me start with: $20 all you can drink vodka bar. YES, PLEASE!! :)\n\nThis place was fanta","useful":2,"cool":0},"uCFKkIcUHYI8oiFKKfoQew":{"text":"Opened for two years, just at end of same block as Blind Pelican but never noticed.  Cool ","useful":0,"cool":1},"xtNThZo83md70AtZi-7EMw":{"text":"This is a really nice looking space inside and half the space is dedicated to private even","useful":4,"cool":2},"1W8y4eCq8dzGIWVcyyt_6w":{"text":"We came here from out of town and the food was phenomenal! I had the Hot Garlic Shrimp and","useful":0,"cool":0},"wlfCmuYKZWh4cQ_ti3IHfw":{"text":"You think you know distilleries-- I think I know... You.  And. I.  know. Nothing.  Lula is","useful":0,"cool":0},"dRmd3oCj4cb8J4Fz98U8qg":{"text":"This was one of my favorite restaurants I tried during a 4 day visit to NOLA.   We called ","useful":2,"cool":0},"1hIV_ie0V3Y325KWg1oiJw":{"text":"So good, reasonably priced, great atmosphere! \nLemon Drop Martini is AMAZING. Guacamole is","useful":0,"cool":0},"FZ1088VYb8uiqTvq8AOBCQ":{"text":"This place is awesome. I have eaten there twice in the past 24 hrs. Went for dinner to cel","useful":0,"cool":0},"3Q3k4GafF3VEPaqZGHpoMw":{"text":"When Rebecca brought my salad over, I thought to myself, \"well I won't be able to finish t","useful":1,"cool":1},"34H-y7CvgSVKKx_-0AnLLg":{"text":"Yummy food and drinks. Live music was amazing on a Friday night. Great atmosphere and fast","useful":0,"cool":0},"N1mjlIkOyOoDhvWDUZB_Fg":{"text":"Our service was fabulous. The drinks and food (vodka basil smash, grilled veggie salad and","useful":0,"cool":0},"WZzRFgk4oRmAHjlbGCOnng":{"text":"Lula Restaurant Distillery gets my 5-star rating approval. Located on St. Charles Ave., Lu","useful":0,"cool":1},"yWkAWk32awWHX9K3n97JTg":{"text":"What a great place.  We stopped by to kill some time and had a wonderful surprise.  The fo","useful":0,"cool":0},"21ANWhn9jXGWPCgLIJbAHA":{"text":"Sorry to disagree with the rave reviews but they need more context. The context is, if you","useful":2,"cool":0},"iTp7WhypIRfeYgmJJ8Mn3w":{"text":"SHARP METAL WIRES were in my food! Imagine my surprise when I felt something weird in my m","useful":1,"cool":1},"rOPIFk5D3B6DZwXGatsBRw":{"text":"Watch parties here are WATCH OUT! parties!  We were excited to drive from Baton Rouge to t","useful":0,"cool":0},"bYYkSKEGfJ4BogcMNKvqMw":{"text":"Had a very pleasant dinner last night. We sat outside on the patio and were served by Devo","useful":0,"cool":0},"PdrqXxCOS4YJLQP8g2eg2Q":{"text":"Pretty good and interesting eats! For example, there was a pork kebabs on a sugar cane sti","useful":0,"cool":0},"DJpEukWKPkx_b0Cf4TXNIw":{"text":"Very nice restaurant but casual enough for my wife and I to feel very comfortable.\n\nThe vi","useful":3,"cool":1},"Dm3Jd4k5xcPMUGhqlkIJtA":{"text":"This is a short review, since we were only here for a hot minute before heading out Friday","useful":1,"cool":0},"CxJW0JDEXRPqLvNHoB0-Rw":{"text":"Well... The service was great!!! Our waitress was fun sweet and had a great personality! O","useful":0,"cool":0},"sPT2KzzhckeLnJ3RwiUjBw":{"text":"This place was pretty packed when I came here for lunch after my cousin's wedding dress ap","useful":0,"cool":0},"Cba76N-ydh-QFeWk_jTnOw":{"text":"My husband and I arrived in New Orleans on a Wednesday afternoon. By the time we got to ou","useful":1,"cool":0},"JE-BuIcuZ-1n8jQugzqCHQ":{"text":"I almost don't want to write this review in fear that my new Mardi Gras parade location wi","useful":1,"cool":0},"nrbwvltzRVwwPoJo4omeYg":{"text":"I really enjoyed my lunch at this fine establishment.   I had the gulf blackened drum, and","useful":2,"cool":1},"RxnWXRp2nuqVFeqdz3lTJQ":{"text":"We just ate here for Valentine's Day with some friends. Overall it was a C+ on dinner. The","useful":1,"cool":0},"NEKbovllOVMTtMunVlr2qA":{"text":"The food is delicious but the drinks are on point. You can tell they were masterfully craf","useful":0,"cool":0},"dpK7SqNdMKwVzrhPD0qL8Q":{"text":"I had crawfish Mac and Cheese, it was rich with just a kick of hot. Would have loved to ha","useful":0,"cool":0},"pNccZqMbtBvmtgC_lFYtXg":{"text":"Oh my gosh. I love this place. GREAT cocktails. You have to try the cucumber cocktail! It'","useful":2,"cool":0},"5PovkaVkhlb5BuuOzNDVtg":{"text":"Had Brunch here. I admit to being hung over. Had the tomato stack. Awesome and zippy!! Als","useful":0,"cool":0},"GEzyiZnReZWYAvjl2XQXVA":{"text":"Lula is a really cool place because it's also a distillery. I love their shrimp baskets. A","useful":0,"cool":0},"I4RvqH6TBTcDFiA60B_ncA":{"text":"Another amazing experience at Lula from start to finish. We went for an early, early dinne","useful":1,"cool":1},"fPtR4cGI4C9-Bkf_FTFKSw":{"text":"If you dine only once in New Orleans, dine at Lula. I know, sacrilege to say this, but the","useful":0,"cool":1},"ulfdsXS3fWKvuv0Mkvjtpw":{"text":"Great food, nice atmosphere, service pretty decent. Guy was nice, yet this isn't a 'hard 5","useful":0,"cool":0},"JgZSW23LEvzgrUrXs4HqHA":{"text":"Fantastic place on the edge of NOLA garden district.  They distill their own Rum, Vodka an","useful":1,"cool":1},"NSMHfiJ_Hjycy04svjTeoQ":{"text":"Meh- food ok... i ordered a fu fu drink, it tasted like tequila. I told the server, she sa","useful":0,"cool":0},"ukyUoL4l98KvW5Wej-gQmQ":{"text":"We went here for brunch and had a great time.  They make vodka, rum, and gin there, and th","useful":0,"cool":0},"96oHqzcbFYOMegvwP-VFqw":{"text":"I came here for a late lunch because of positive Yelp reviews. I had the osso busso and it","useful":1,"cool":1},"LdA3hS-Iufn21BQGiz78cQ":{"text":"Delicious Food and Excellent Service!! Everything we tried on the menu was Excellent!!!  N","useful":0,"cool":0},"Td9KPXbDct9mAQ0r-rrlLw":{"text":"Highly recommend this jewel of a find!  Went with a group of 10 for brunch to continue the","useful":0,"cool":0},"V4LZuXZVwacIRqZw_KnUHg":{"text":"This was my first time to Host a LSU dental school event. The space was perfect and great ","useful":0,"cool":0},"hg89l9JhIgzr5FSf1h1Xhw":{"text":"I had the pleasure I'd attending my brother's wedding at Lulas, and it was the best weddin","useful":0,"cool":0},"3pjCycqJ1bC_HJPS4dUM1g":{"text":"Great drinks. Pork skewers were great. The Iberville salad was delicious-I'd drink that sm","useful":0,"cool":0},"whMKTp2Sf0zg9XkEjg89-w":{"text":"What a beautiful, open restaurant with great natural lighting! \n\nWe started off with three","useful":1,"cool":0},"wr3qOJVOugf_2wwhv0sdBw":{"text":"John was super nice and super attentive! Food was delicious and the vodka bar was my favor","useful":0,"cool":0},"aCgtXEZh2TrLeqmdkHZbrQ":{"text":"Awesome food & great atmosphere!! Amazing drinks! Have to try the salads and awesome chees","useful":3,"cool":1},"aTLYlBq4sKn8kdf3h2A_gg":{"text":"Sorry to disagree with the rave reviews but they need more context. The context is, if you","useful":2,"cool":2},"Gz5BIyvj5lJjoVJJEyXGVA":{"text":"Came in for happy hour today and had a great experience. Savannah was a great server - we ","useful":0,"cool":0},"wGcfFw3wgsdoKzfEXkp8eQ":{"text":"Delicious hurricanes! More tart than sickly sweet like most. My hot garlic shrimp and fry ","useful":0,"cool":0},"yPOwLRfpFQkv7FFq5g4ifQ":{"text":"I had grilled gulf fish from lunch menu. It came w rice and grilled veggies- delicious, gr","useful":0,"cool":0},"UUlROZNQaMWaEigGtIHszQ":{"text":"I've been here twice now and both times were great. I'll start by saying how beautiful of ","useful":1,"cool":1},"fPQBdz1fI9fbb4oubpJQYA":{"text":"We had a lovely lunch and cocktails here. This place is not far from the Garden District a","useful":0,"cool":0},"po0m91VTCboELAhsMnKX4g":{"text":"Have been wanting to try this place for a while and we were pleasantly surprised with the ","useful":0,"cool":1},"AVcAEmMqj0dgDxHDM9rLtg":{"text":"My husband & I had dinner on a Wednesday night, tables were available. I had a gin fizz & ","useful":0,"cool":0},"zKpFX46wd2oDm3_YdEiang":{"text":"Excellent food & service!\nHad a 4:30 reservation on a Saturday before a concert. Was seate","useful":1,"cool":0},"b483JdyUBEaPfOmBvH-0CA":{"text":"Wonderful food and wonderful service! It's my first time in New Orleans and we decided to ","useful":0,"cool":0},"TeOlAxMvZE1mvufPPqJrKg":{"text":"Braised pork roast was amazing! Burger was perfect with egg and bacon. Great specialty dri","useful":0,"cool":0},"n03_9W4qBZM2DKqA0yVrOQ":{"text":"Loved eating at Lula! I enjoyed a Gin & Tonic, Fried Mirliton, and Ginger Lemongrass Shrim","useful":0,"cool":0},"5LvUL6W6CvopUJ8KORBxjw":{"text":"I LOVE LULA!!! Let's start the review off write on a positive note!\n\nLula has definitely e","useful":0,"cool":0},"n59OeFa-k9kgPAoSEgsydQ":{"text":"Fabulous meal. Waiter was incredible attentive. Brought us samples of the soup and the sau","useful":0,"cool":0},"aj0QpO_DL4wHqhuQnpTnPA":{"text":"Nope.\n\nCrawfish Mac-n-cheese ($17) 1/5\n\nMy crawfish Mac and cheese was anything but. There","useful":2,"cool":1},"A9YaQjIHgnGGiPlsQHAqMg":{"text":"Great place to enjoy spirits made perfectly. The food is awesome. The chicken sandwich is ","useful":2,"cool":0},"JNOJZsqLi66DJE9wUXagzg":{"text":"**Imagine me twirling like Julie Andrews on that hill in The Sound of Music as you read th","useful":21,"cool":19},"TCgS2Vk3FBp6NvMEmXzI9Q":{"text":"This is a great place to eat and drink.  My waiter was amazing and totally elevated my exp","useful":0,"cool":0},"Vbq_itmbxAI60y6amgxEPA":{"text":"We loved Lula! We heard positive things from a friend, and decided to try this place for d","useful":0,"cool":0},"z7U7iomGMbwA20bEMREfZQ":{"text":"Awesome food and cocktails! Our table ordered many different starters and entrees and ever","useful":0,"cool":0},"sMn0sYomnhIFeye_-XacpQ":{"text":"Came for Father's Day brunch. Place was packed.  Excellent service and delicious food.  I ","useful":0,"cool":0},"JBXvPnp1Mz9ToyCZGsKRuA":{"text":"I really enjoyed this restaurant while in New Orleans. We accidentally found this restaura","useful":1,"cool":0},"xiM7Q8PeTFpxiMeUbo83Yw":{"text":"Cute front patio with tons of room for a group of 8. Food was excellent, lots of different","useful":0,"cool":0},"1zfGS7yVHNMcMkHv6Q52yA":{"text":"Honestly this place was fantastic! We had the lamb, quail, and crawfish Mac and cheese. Al","useful":0,"cool":0},"qmEqteCm3qyZT9tjavDnBQ":{"text":"Great food and wonderful service.  You can have a short tour of the distillery as well.  M","useful":1,"cool":1},"kLTSaMJC4kwOTzQvFz5ZZw":{"text":"We recently came into Lula to grab a quick dinner and a couple drinks before heading to ou","useful":0,"cool":0},"h79AEuUraUVZeN46A-s6uA":{"text":"It was a great experience.  We had \"K\" wait on us, and he was absolutely awesome!  Highly ","useful":0,"cool":0},"04urmKztOD5oEar7BQwNwQ":{"text":"The atmosphere was nice. I liked how spacious and clean it was. The menus were dirty but t","useful":2,"cool":0},"pFFsUanecgqq5EzywYdDZg":{"text":"Fantastic. My wife had a salad with filet and I had the lamb chops. The lamb chops were an","useful":0,"cool":0},"ZsXOkGvZRTb3IauYC3wSiQ":{"text":"My husband and I loved this gem. It was a beautiful afternoon to eat on the patio. Their b","useful":0,"cool":1},"S-zRyTugpVaAz2CnQ0d_jA":{"text":"I ordered the Boudin egg rolls with molasses fig sauce and the hurricane drink make with L","useful":0,"cool":1},"MLdrOJADvaTr9Whifu8jaA":{"text":"Cute date night spot in NOLA! It's a distillery and restaurant so I liked that you could s","useful":2,"cool":3},"jomhgEeA22HEJJbgXuQHbA":{"text":"Poor wait time with no one in the building. It should not take so long to be greeted at th","useful":0,"cool":0},"sIJouSwg_fCkxmbmvzYqMA":{"text":"This is probably one of my new favorite dinner spots in the city. The food was AMAZING!! I","useful":7,"cool":5},"kmX-PXnGGIK87CKyhFSndw":{"text":"If you are looking for a meal with both flavorful food and high quality cocktails, look no","useful":0,"cool":0},"rSXfrjTRzhV8qnuWa9dDDw":{"text":"Was looking for a cool spot on the streetcar line to enjoy a refreshing drink and good com","useful":0,"cool":0},"yniRi-mjhtviuLuvZUYesA":{"text":"Our waiter was Ryan & he was awesome! The food was amazing! Lamb dish , fish dish, shrimp ","useful":0,"cool":0},"xcon1Yi4vuNN-i5HyjZgOQ":{"text":"You. Must. Try. This. Place!!!! The food was outstanding and the service at the bar seatin","useful":0,"cool":1},"ELANHoD_85MoA0BicoAetQ":{"text":"Very good! Had the filet and it was delicious and prepared perfectly. Very clean establish","useful":0,"cool":0},"dDfZ9odzaXgG6dMzmikJhw":{"text":"What a fantastic discovery this place is - on two levels! Firstly, as a restaurant - I/we ","useful":9,"cool":8},"Mz0I_b4sDjtQss_kQSMzpw":{"text":"I recently went here for a Mardi Gras brunch with a small group of friends.  We had a rese","useful":1,"cool":2},"Hh8uTVPJppP8kxvS07pNVg":{"text":"I LOVE THIS RESTAURANT! I come here all the time. They have the best drinks and the food i","useful":0,"cool":0},"Mst88M6MYXqz6et-ibHB9w":{"text":"This place is worth the wait!! This place is a distillery and restaurant. On the weekends ","useful":1,"cool":1},"H0-9ZQFXqcT2g4EdcLcDNQ":{"text":"This place is great. Hands down. First off, the bartenders Mel and Katie are awesome. Not ","useful":7,"cool":2},"2nOaXJvw5n7R7YY5yX6sNw":{"text":"i truly only came here with friends and i didn't get anything of my own but the fries. but","useful":0,"cool":0},"K0O_cDUQhLps2L9XyGCGlw":{"text":"First off VODKA bar for BRUNCH HOLY SCHNITZEL it's MHMMMMazing, but this salad I got for l","useful":1,"cool":0},"rFGc4Gl0uBm9_Inl2zXxdQ":{"text":"Omg. Probably the best part of my 4 day visit in New Orleans. Everything minus the parking","useful":0,"cool":0},"MFpipc5eiyo1FFiTkfet_g":{"text":"PLEASE: leave the quarter, and come here! You'll save money and have an excellent experien","useful":0,"cool":0},"Ri9AEny2elulUj3gzQkQcA":{"text":"What a great spot! Had happy hour drinks ( they're not exaggerating on the greatness of th","useful":1,"cool":0},"a2PXWy76Y5v_vMoqpeHJPg":{"text":"We stopped by Lula for lunch on one of the week days. Upon arrival, I was amazed at the si","useful":1,"cool":1},"DWcjMlj9ibyMBioZcXbiVw":{"text":"GO HERE FOR LUNCH. Sit in the sunny inside spot because interior is dark. Food is some of ","useful":0,"cool":0},"nRwJYYwb_SyejJMJnZWDBA":{"text":"Food is okay but not worth the price. The drinks were pretty decent. The staff was ok","useful":0,"cool":0},"SuZdqnZBDgiscTM5_lInDA":{"text":"So much potential.. but disappointing. Best selection was chips with avacado and crab dip.","useful":0,"cool":0},"VnxeuR4AsGDvQ6f-JosjVQ":{"text":"We got the lump crab and avocado dip, so so so good! Definitely recommend that. The cockta","useful":1,"cool":1},"RjRMXGDLaeSjPhDLd447IA":{"text":"I found this restaurant on Yelp while doing our street car experience. We wanted to ride t","useful":2,"cool":1},"FUUEeqZdalsuIA6q2iXgFg":{"text":"Meh- food ok... i ordered a fu fu drink, it tasted like tequila. I told the server, she sa","useful":1,"cool":0},"BNK0sQKfLtMq--5CX6_g4Q":{"text":"This place is legit! Easy access from the street car. Food was delicious as well as the se","useful":0,"cool":0},"707WAZPuxpoWcJmnSdSHlQ":{"text":"Everywhere in New Orleans was packed for brunch. Except Lula. Apparently because they supp","useful":0,"cool":0},"eGl0yB-KmW6J6hx5FImA4Q":{"text":"Wish I lived in NOLA so I could come here all the time! I came in with friends on a Saturd","useful":0,"cool":0},"gV-Iiedk4zX9Q095Z7xorg":{"text":"Lula has been one of my residency program's go-to places to take interviewees for dinner. ","useful":1,"cool":0},"2lnLnz0McL8iHXw62BIaMw":{"text":"While staying down the street, I walked here for a cocktail and a snack, ordering my dinne","useful":0,"cool":0},"ZU1iAhv19DBkm8gZlNGYLg":{"text":"I took my family there for Valentine's Day and we loved it.   You could tell that the wait","useful":2,"cool":0},"olOBtRL_-kEcRznzWHH90Q":{"text":"Recently came here for a birthday dinner of 15+ people. The wait staff was AMAZING. We wer","useful":4,"cool":3},"jIMavYnJl8bEdjRw6JqNBQ":{"text":"Recently went here for a quick bite to eat and a cocktail prior to a haunted tour that we ","useful":0,"cool":0},"C6oy6Du_a3Ub0C0lnQJETg":{"text":"Lula's was the choice for company lunch! They were able to accommodate a table of 10 aroun","useful":1,"cool":0},"vcAVwWvXI1V3AamwokR7Vg":{"text":"We were looking for a place to watch game...and Lula's turned out to be perfect. Great Tv ","useful":0,"cool":1},"wGOYvGjnf1dg-kqcmrc_RQ":{"text":"Came here for a bachelorette and I was so happy I did. This place is such a cute spot near","useful":0,"cool":0},"Ex7x5X-JD2Mztw0SQpSYNA":{"text":"It's Monday at 3PM. My friend and I stop in for lunch. There are 4 people at the bar area ","useful":0,"cool":0},"jYv_Yok8aKjZg2ne8SXlMg":{"text":"Why yes, brunch. I SHALL go to you. \n\nBloody Mary bar from their own vodka? Why, yes pleas","useful":17,"cool":11},"toRjIeNqpKd-9oxfoC6x6Q":{"text":"Came for Father's Day brunch. Place was packed.  Excellent service and delicious food.  I ","useful":0,"cool":0},"w8N0Z-0NUx1gpX6FgxNvuA":{"text":"New Orleans is known for being a town for old fashioned southern hospitality, Lula Distill","useful":2,"cool":0},"JEB7CnCQPjOqM87iwzyNHg":{"text":"Lula was all-around amazing from beginning to end. I don't even know where to start! The s","useful":1,"cool":0},"iZAjCGoDIczz01hUwOAaPQ":{"text":"We met the owner (or at least manager) and he was extremely nice! The service was ok. The ","useful":0,"cool":0},"w1MmK-vl1pM1v5J48W-HMQ":{"text":"Great atmosphere! We wanted to eat and only ordered a few items on the menu the drinks bec","useful":0,"cool":0},"3ctU9coB0yGcYVpjUhdMVw":{"text":"I have always wanted to try happy hour at Lula and I finally did when my roommate and I st","useful":1,"cool":2},"8MAc-hza2VD14awrLmeWuw":{"text":"The food here was absolutely amazing!! The service and ambiance was great, will definitely","useful":0,"cool":0},"-ym3dSDGo7ch_fqzedcIAg":{"text":"They were able to seat me inside with a reservation. The mojito was the perfect amount of ","useful":0,"cool":0},"ZnbXrEujwMRrQOry-nhNCw":{"text":"Great place. The drinks as as good as you expect and so is the food. Get the Crawfish ques","useful":0,"cool":0},"fW8ryOtcx5I-RLiCdw2-Fw":{"text":"The ladyfriend brought me last weekend for my annual birthday dinner.  We had heard mixed ","useful":1,"cool":0},"JrWEshbv1Qf6dg36ivSvQw":{"text":"DID YOU SAY BOTTOMLESS VODKA? I AM THERE!\n\nMe and a group of 10 ladies came here for a bac","useful":0,"cool":0},"McokCKLBwhlJOEEqMXEHdQ":{"text":"Great place. There was 6 of us and we all had something different. All the food was great.","useful":0,"cool":0},"W270IsGjFYHsqsN-vK9j5A":{"text":"The food was great a good bang for your buck. Our waiter Mathew made the night truly memor","useful":2,"cool":0},"MkL4vjKHg8Tx__WL3VU5IA":{"text":"I went to Lula for happy hour and I had a great time. I got their $5 rum punch and it was ","useful":2,"cool":1},"Xhj7coHcZGdMuYhy7R464Q":{"text":"Recently had a wedding rehearsal dinner here for 25 people- Wonderful food-drinks & wait s","useful":0,"cool":0},"pbOwrM30Rly86ZElusJfZA":{"text":"I have nothing bad to say.. I ordered the chicken sandwich and my guy ordered the burger. ","useful":0,"cool":0},"huNG49TwnRmMOoNnfxuKLA":{"text":"Review based on family take out during COVID19. \n\nI appreciate Lula staying open and offer","useful":2,"cool":3},"DaV48N41MKKKwMEDwJb-oQ":{"text":"We went here for Tulane's homecoming weekend and it was SO good. They have great cocktails","useful":0,"cool":0},"jAYP93RbNTsNmfV6pSDHwQ":{"text":"We are dining in town and we wanted to get some local food, so I did a quick yelp search a","useful":1,"cool":0},"fXrt2cZ-h3C48P1596tYFQ":{"text":"First off, let me state the customer service was amazing. Our waiter, Blaze, was extremely","useful":1,"cool":0},"rcC0r7YKvOsoTWn0LWZlmQ":{"text":"An unpretentious atmosphere with top notch service and innovative menu items served prompt","useful":0,"cool":0},"kSrjVTDzvScUn15WNTeI0w":{"text":"What a hidden gem! Wanted to book brunch for a large group (17) and everyone wanted to do ","useful":0,"cool":0},"-TrBCFgTf0QsCTzZCZhVAg":{"text":"Great restaurant with great food. We came for the $20 all you can drink Vodka bar, totally","useful":2,"cool":0},"d3_H-BLX_yvX3LE-oH00FQ":{"text":"Visually stunning restaurant. \n\nCame here for a dress rehearsal and thoroughly enjoyed my ","useful":6,"cool":7},"izP-ih1KI2ta8oxH8czhDg":{"text":"This place was the perfect restaurant at the perfect time. We stumbled on it looking for s","useful":1,"cool":1},"ruPQyDPynQO_8X005qQwoA":{"text":"I had an AMAZING birthday dinner with friends while on our recent visit to New Orleans. Ev","useful":0,"cool":0},"Xyuoog87FRhVggjUpalXNw":{"text":"Great atmosphere! Enjoyed a wonderful evening with my coworkers, with delicious food and d","useful":0,"cool":1},"v7DrQwBbtew0IgrJ57mQZg":{"text":"First of all, their crawfish queso is 10/10. I look forward to that appetizer every time! ","useful":1,"cool":0},"aMjpBVZpdFsBExZ1ecxpRQ":{"text":"crawfish mac and cheese. crawfish mac and cheese. crawfish mac and cheese. crawfish mac an","useful":2,"cool":0},"5241zC02uqZt5MU_txsHTQ":{"text":"This was my first time visiting Lula but won't be my last! It was happy hour when we arriv","useful":1,"cool":1},"shxBlafXAAY9PUc9DQ8tcg":{"text":"It was ok. Maybe we went on an off night. Queso was barely warm. Bread pudding was just ok","useful":0,"cool":0},"wsUJyawfYpO-SwnOz9C3Jw":{"text":"Loveeeee the atmosphere. Very open and bright. A huge plus for the high ceiling too! Our d","useful":1,"cool":0},"g4XmUBep_vAJmq5YkqBPMg":{"text":"Brunch was amazing!! The bottomless vodka for $20 was a great deal. I had vodka and grapef","useful":1,"cool":0},"AGYpqY6vIvKY7liGfhBefQ":{"text":"Food and service was great...  so you get a good rating...  it was disappointing  to see t","useful":0,"cool":0},"nlcMLVz24dDEHegYrZaOUg":{"text":"Ran in here to grab a bite towards the end of one of the Mardi Gras parades. The restauran","useful":0,"cool":0},"PQRjXSoqgvQOmMF5jxLGlg":{"text":"While I give the restaurant three stars, the customer service was amazing! I went to Lula ","useful":1,"cool":0},"83Y6hJ7bjLCTGPyp_RbT8Q":{"text":"Everything was so great!  Food was delicious and plentiful. Our new favorite place, and we","useful":1,"cool":0},"Ldbj9iPAOiKhy3LWTAUA7Q":{"text":"We just left after the best meal we've had in New Orleans so far! The service was exceptio","useful":0,"cool":0},"WGWFK-7GYN9vjnJ8t5gPTA":{"text":"Stopped in for brunch while on vacation back in April. Great place. Was only open for a fe","useful":0,"cool":0},"T1F2IvnBxR4Z8xm8enchhg":{"text":"A GREAT BEER HALL....BUT OOPS, IT'S A DISTILLERY?\nForm just doesn't fit function here. The","useful":8,"cool":2},"MuVB2DhS-ofFRN6J5aCNRA":{"text":"When I tell you BEST..... Hands down.... I recently took my mom for Mother's Day but me & ","useful":0,"cool":0},"DwjSdVV9GvPejzENzOpndA":{"text":"The ambience was great - the staff was excellent and very accommodating. The food was amaz","useful":0,"cool":0},"XVU4JAhoskQHLCbLnbQfig":{"text":"This place looks super cute from the outside and the food photographs well. It's def a coo","useful":1,"cool":0},"Gmr9QQ9D-nSfUS5FgmKfMg":{"text":"Great drinks and even better food! Amazing portions. Not pushy about ordering quickly allo","useful":1,"cool":0},"iCNE6SEkPemBZsqhUtZDJg":{"text":"Went for brunch/lunch.\n\nShrimp boil appetizer and biscuits & gravy entree were very good. ","useful":0,"cool":0},"s4URrbZmyM4VFceBJB7HQg":{"text":"Mother's Day 2021 - NO STARS!!!\nLula DISAPPOINTED me today! Arrived at 11:30 only to find ","useful":2,"cool":0},"NLtiakgU8IKVFCEhemom0Q":{"text":"Came here with a friend on a recommendation and was completely delighted by a flavorful an","useful":4,"cool":2},"N-0R_BWKGFXwv2P_mR-SWw":{"text":"Fantastic brunch spot! Our brunch today arrived steaming hot, service was superb and as al","useful":1,"cool":1},"6NxmDpmgpsbSGC0SnG8aQA":{"text":"The food we ordered was fine, a tasty chicken sandwich and fries, everything it said it wa","useful":1,"cool":1},"Ufqhrb6ElChdzjnWEoh8uA":{"text":"We were greeted and taken directly to a table. It was clean, comfortable and nicely decora","useful":1,"cool":1},"TCNIpQH9E1F7hsYIyzV5yg":{"text":"We sat at the bar and had a great experience chatting with the bar manager and exec chef. ","useful":0,"cool":0},"LoUEE_r6JD2bUqVr1zNwQQ":{"text":"The place is a nice and it's open space. We came early dinner and got seated right away. W","useful":1,"cool":2},"fYFINkWGZ-0O6R_o7f168w":{"text":"Our waiter was super nice just sooooooo slow ! I ordered the crawfish Mac and cheese and i","useful":1,"cool":1},"LY7aTUAEVMd0PTZDWK2zhg":{"text":"I had a 3 different cocktails from the menu, all delicious. My boyfriend -a gin drinker- h","useful":0,"cool":1},"aTOj75XF3LXMENxq5grVZA":{"text":"Hayley was a fantastic server! She has excellent recommendations and helped me figure out ","useful":0,"cool":0},"MJQkxbRE_7eI7FuTxH3tig":{"text":"Didn't have this on my radar during a recent weekend getaway, but discovered it because of","useful":1,"cool":0},"OK-ZNg0CI85nMXSsfM55OQ":{"text":"Yall...if I lived in NOLA this place would be my everyday happy hour spot. OMG, the $5 cla","useful":2,"cool":1},"GQ6QULLPkzYYr2uKBHdvMg":{"text":"My first time here in NOLA and I ate so much creole and cajun that I wanted something diff","useful":0,"cool":1},"dTiAdeHZCXSqPeONUEliAg":{"text":"I love this place.  The staff goes above and beyond to ensure it's more than a meal, it's ","useful":1,"cool":0},"QluQ6b2Vc-NHrirsJHL3zg":{"text":"Lula is a Restaurant and a Distillery much like many places over the last 10 years have ma","useful":3,"cool":2},"-qX8k376sJx-oe__cdt8cQ":{"text":"So much more than I thought! Having eaten at places where alcohol is the star, I usually d","useful":0,"cool":1},"pdd25yE6PE8OjBfAJCa-yw":{"text":"Great meal last night, we picked up from Lula! Very tasty and healthy serving size! We als","useful":1,"cool":0},"ADjqDJQjpEDrTLBm6soWrw":{"text":"Wow!\n\nCame with the lady for our usual date night and lula did not disappoint at all! The ","useful":0,"cool":0},"SJMTuDLI4I1K_8xIOOxqyQ":{"text":"This is a great spot! The food was really good. The only reason I went to 4 stars is their","useful":0,"cool":0},"TVBfDo_vOQKQypMPbZugtA":{"text":"We got there 30 menus before the bottomless ended. I wish they would have just told us it ","useful":0,"cool":0},"n_yrjOgyEt12SP_g2vAKfA":{"text":"If I was just rating drinks and service this would probably be 4 starts. Both were good. I","useful":9,"cool":5},"uTVJIEmWqD5hIKKB4WRl3Q":{"text":"Other than there was something wrong with their online wait system, everything was fabulou","useful":2,"cool":1},"5MgcSdoDSY5cy5gDwRoQqA":{"text":"Whew...get the fish. I'm pretty sure it was redfish but the bottomless vodka might've take","useful":0,"cool":0},"g-w5UzeK90LkI8DYobAGyQ":{"text":"Yall...if I lived in NOLA this place would be my everyday happy hour spot. OMG, the $5 cla","useful":2,"cool":0},"rQZD6rex-UL7ULt9VRXcZA":{"text":"Restaurant Lula Distillery\n\n      Many of us are familiar with St. Charles, an area known ","useful":4,"cool":1},"V5D7nlQ6kbW6Xt6v3t0g0w":{"text":"The reviews on Lula's looked good, and so glad we tried it. Our server was so friendly and","useful":1,"cool":0},"LYfdamwoW5d257A3OFh8qg":{"text":"My dad picked this spot for a late Sunday lunch, I'd never heard of it. Picture perfect. N","useful":1,"cool":1},"oBoix6a_H6nxaxbyafSm_Q":{"text":"They brew their own liquor here, so definitely try it. The gin is amazing. Anything their ","useful":1,"cool":0},"9sIaJ_f54DxOC74fPYrDeg":{"text":"We tried 3 spots and everywhere was booked for Saturday. We eventually found lula for a ta","useful":2,"cool":0},"Gzz606u7Q68L8hI-JxxsYg":{"text":"This a very late review, but just needed to add it.  I've come to Lula before with my part","useful":0,"cool":0},"JawiIW-CEfN6Cxb-A-puPw":{"text":"Found this place online while looking for locations for an event. Turned out they weren't ","useful":6,"cool":1},"t-Q2jW-8EFTb7I3Ug3QlqA":{"text":"Food, service and outside seating atmosphere was amazing but I really enjoyed their gin an","useful":0,"cool":0},"xHdZBxHZkTNIyWo-wMmBNQ":{"text":"I was really disappointed by this restaurant. I had heard great things from friends so I b","useful":1,"cool":0},"417Yqx214Orq8pguzmEcpQ":{"text":"My first visit to Lula was last year where I first tried the crawfish Mac and cheese. The ","useful":1,"cool":0},"ODdybFGhpaN0hKhFenpGqw":{"text":"We really enjoyed Lucas. We went because it was close to out b&b and recommended by staff ","useful":0,"cool":0},"1Nr1AZJoyFNc3VQfK8XxfQ":{"text":"Great atmosphere!  Open & inviting space on St. Charles, with the distillery as the backdr","useful":16,"cool":8},"ShfuLLrfWZ2NB-q-YpMAqw":{"text":"Started with appetizer and drinks.  The crab and avocado dip was delicious.  Gulf fish was","useful":0,"cool":0},"fcwy5DuGxUVODsxQLgJ44g":{"text":"The Bartender ( Devin ) was amazing ! Very attentive . The food was Delicious as well  . I","useful":0,"cool":0},"l-HhGokxkiVa9DARxozZCA":{"text":"Lula Lula Lula is so beautiful and so spacious!!! Love the industrial interior!!! It's a g","useful":3,"cool":3},"9S5YzTxQ12lLfHu0H-ZsBg":{"text":"I really like this place except I tried the egg rolls boudin, crab meat & avocado dip & I ","useful":1,"cool":1},"PSJ8i7kd3Eh0NR8S5d_h_Q":{"text":"Amazing... just amazing. Saw the place when we drove in the first night and have been dyin","useful":2,"cool":2},"mMAmMIpKnrd0i4gPRwcY2g":{"text":"COVID Takeout Review:\n\nLarge portions of food for the price. I ordered the $13 fried chick","useful":1,"cool":0},"30ippYmRZqUR33X-ncMtXw":{"text":"Definitely a little more pricey but huge servings. Mira our server did a wonderful job!  M","useful":0,"cool":0},"WKcpANnE60Wq3YXu_MJB_A":{"text":"Was hoping for a good experience.  As restaurant was recommended by locals.  Ubered out fr","useful":1,"cool":0},"MojnplHj5Plx-r17F9YnEw":{"text":"So glad that I finally tried Lula's. I have passed the restaurant a few times when visitin","useful":0,"cool":0},"P0vXYolItwh3syQiM0HnCQ":{"text":"Savannah was such a great waitress! Even with us moving to so many different tables due to","useful":0,"cool":0},"lULkEoj-4xkDuCvQ86DhzA":{"text":"Came here with a large group after exploring the World War 2 Museum for a lot longer than ","useful":1,"cool":1},"E_LPMDKK9rLX8nlPn1DMwg":{"text":"My friend and I dined here for brunch on Saturday and had a fabulous time. They offer bott","useful":0,"cool":0},"XRjbMyjH17uDm5jCV6wg3Q":{"text":"Girl bye I got the crawfish Mac and it was out of this world!!! Also really hard to beat a","useful":0,"cool":0},"hR4UKAd3UT8Ti0NE0IMjZQ":{"text":"The food is DELICIOUS & Brittney is AMAZING !!!!! Bottomless vodka drink, Rum, & something","useful":1,"cool":0},"d9Qd2uJwuGkMLBeZ06NOLw":{"text":"Yum.  The place is right of the trolley line, so we ended our night here as it was on the ","useful":1,"cool":0},"o4pvriWmG1aei8HCpEzZtg":{"text":"Lula has some of the best food I've had in New Orleans. They were great about social dista","useful":0,"cool":0},"i2OrDSe0S4xD9DAtAA__dg":{"text":"OMG! My crawfish mac n cheese was delicious!  I only could eat half of it (HUGE) - but it ","useful":1,"cool":0},"lJ4k1fLY7o8TyIldGFW4dw":{"text":"This is a good place for finger and drinks. We went with several friends before COVID and ","useful":0,"cool":0},"vNs15QzhchvlMCcZSaYFxg":{"text":"Awesome place!? Great atmosphere!? Yummy food!? Great service!? Definitely will come back","useful":0,"cool":0},"8nPWoO4hsTCTPWBhUAA8ug":{"text":"Lovely brunch. The country biscuits with tasso gravy were so flavorful. My boyfriend's fri","useful":1,"cool":0},"46wJodTwtusgMZzLUpoC4Q":{"text":"Lula is a great spot for a boozy brunch, but I didn't think the food was all that great. I","useful":2,"cool":2},"tLiQRcGHQKWq8EoGS8iDkQ":{"text":"Beautiful interior! Didn't get to try the liquor, but you can order it by the bottle.","useful":0,"cool":0},"bBQ2bplpB9EQitFJ9yedPg":{"text":"Drinks were great and happy hour pricing is awesome only 5 dollars for a strong cocktail. ","useful":0,"cool":0},"sK6xBpR2obDtDJdhF0FAIg":{"text":"I really love this place! Their brunch and appetizers are hands down the best selections t","useful":1,"cool":1},"RgU3AgIUbkMsU7e4Y_yGng":{"text":"On this trip we tried this resurant because it was walking distance to the hotel. It was s","useful":0,"cool":0},"u1AvzWKpdZoFjqPrISePbQ":{"text":"Always great customer service & the food is amazing!! Lula also has a daily happy hour fro","useful":0,"cool":0},"n3pmvUvH8D4D9cCAuWHUbg":{"text":"Went here for a late dinner. Forget our server's name but she was extremely sweet. And pat","useful":1,"cool":1},"M-OdS4hF_RxSNRZyOxPlWw":{"text":"Jillian was AMAZING!! She was attentive, charismatic and such a vibe. We all wanted her to","useful":0,"cool":0},"V47KkIsejtGT4jQct7nNSg":{"text":"$20 bottomless vodka bar, do I need to say anything else? The staff is really nice and mak","useful":1,"cool":1},"ZHeacRF1g8AdQcQbHfK0IQ":{"text":"Amazing service and adaptability from Lula during COVID-19! Earlier this Summer I had reac","useful":20,"cool":21},"1j8SZJnAzwm6XjrurH0kog":{"text":"Staff and service was amazing,  the menus was extensive and didn't know what to choose! Sm","useful":0,"cool":0},"llf9IgkQdkIV727w4jt_1g":{"text":"I have been wanting to try Lula for awhile now, but it took me awhile to actually get ther","useful":0,"cool":0},"g-nPcg7lNohCYYO3KuP1iA":{"text":"Bottomless drinks have a bottom here. They advertise bottomless from 11-3 but only told us","useful":0,"cool":0},"hQU0HYgkD4aRFPqdOHYAGg":{"text":"Lula is good but leaves me a little perplexed each time I leave.  I've been more than a ha","useful":5,"cool":3},"5gnNmbhnbmfkKcjX1SU_ew":{"text":"We are staying done the road at WORLDMARK who also recommended this place.  Really really ","useful":0,"cool":0},"XIa3aZ_VOemnZowqubsdsA":{"text":"One of the best restaurants we dined while here! Great service, fresh food and friendly st","useful":0,"cool":0},"sShsyYSHGl6P2wQUMiIZrg":{"text":"Tried their brunch on Sunday. None of the appetizers really jumped out at me, but our tabl","useful":1,"cool":0},"6ZJrrtRxyDews3oUC27Fyg":{"text":"I went to Lula with my husband and three other couples for the New Year's Eve prix fixe me","useful":0,"cool":0},"RLJ2q4Q_L3j8V9CTwsK8rg":{"text":"Great atmosphere and even better food! So excited to celebrate my birthday with brunch at ","useful":0,"cool":0},"YB6lZIaj-Om4xwVHX4CaoA":{"text":"We visited Lula late on a Sunday afternoon as to avoid the ever present crazed hungry brun","useful":3,"cool":1},"ab81Z-kDIbCZNKOkuLnMkQ":{"text":"I have a bad habit of forgetting about this place. I'm not sure why that is, but I find my","useful":0,"cool":1},"MQJJcVMfuI5wQ2mGJc6XxQ":{"text":"Delicious southern inspired food. We went for brunch with the bottomless vodka bar. The fo","useful":2,"cool":1},"dYkrhV1V5LJCn9Jq-3vlzg":{"text":"Tried this place for the first time. First, the restaurant is really nice and I love the a","useful":0,"cool":1},"5bKKZdPbi18z4LeA89XmUg":{"text":"A definite yes food was on point and I'm a chef myself so my critique is a lil more in dep","useful":1,"cool":1},"NG-9IMBG9dUaGVS2DIG44w":{"text":"By far our favorite place we've been so far in New Orleans. Great food, AWESOME drinks...w","useful":0,"cool":0},"iJn0m7J8Qy6Li2Xr0HrqXg":{"text":"Hailey was the kindest! She was so aware of our table and super sweet. Incredible person, ","useful":0,"cool":0},"ktitdveugV28O7BbteFqBA":{"text":"Great food, great drinks, nice staff, good ambiance. Sat at the bar and ordered the garlic","useful":0,"cool":0},"Ykx972GWgTkOqAZEPVQFUg":{"text":"We went for a quick meal during the week after going shopping. We made their happy hour an","useful":0,"cool":0},"DhaEC7RWq_rsdoh1kxM_DA":{"text":"We were staying at a B&B a few blocks away. We got back from the French Quarter late and n","useful":0,"cool":1},"jZj5s_kTZkTiw7zBKKLPWQ":{"text":"Two words pomegranate lemonade!! It's my absolute favorite and I love to pair it with the ","useful":1,"cool":0},"k0FTL8K-SFV4MMQAVHmObw":{"text":"Delicious food! We ordered the crab and avocado dip to start and it comes with wontons whi","useful":1,"cool":0},"Ni5v3G76IxSwn16lH9va4w":{"text":"COVID measures are in place and are being followed. Masks required, hand sanitizer station","useful":0,"cool":0},"97Ai0T_x2LACWp9SCnJ8WA":{"text":"This is by far the best restaurant I have ever eaten at!!!  We stopped in for lunch and it","useful":0,"cool":0},"SaNRHqiJ_m5rLlO7cTI-Ww":{"text":"I loved this place!   We found this place close to our lodging on the first night of our s","useful":0,"cool":0},"bZqcep0-kPfTD33CGukVbQ":{"text":"While visiting New Orleans I was looking up brunch spots for me and my two friends. The th","useful":1,"cool":5},"bO6nEl1rrsFx1UvqfcCDJg":{"text":"Mikey was our server. He was excellent and attentive. He split our checks without asking. ","useful":0,"cool":0},"RMvL9C1G0Y7mS01OcQrISg":{"text":"Always an amazing burger and fries! Their steak, fries, salad lunch offering is incredibly","useful":1,"cool":1},"7aev0enjyhqZk55pbvCSyQ":{"text":"Came in on a busy Friday night after making reservations via open table. Upon arrival, the","useful":0,"cool":0},"AUCis-dy0Rj3uRGcALlcRA":{"text":"Love this brunch spot in New Orleans! They feature a bottomless vodka option on Sundays an","useful":4,"cool":3},"fWvkBwixpeI70YUh_xHMIw":{"text":"I ordered the lamb chops which I typically do from here and they were okay at best. I don'","useful":3,"cool":1},"gvgK-4OnvU48I_wXxMn35w":{"text":"I decided to have my birthday dinner at lula's distillery, and it didn't turn out well. As","useful":1,"cool":0},"Ib8WsmqyIq8ECQVmEvLG2w":{"text":"We came to Lula's to celebrate my sister's birthday. We came on a Sunday around 5:45 and i","useful":6,"cool":3},"gM2NCVLGeoWY-4uynZGs5Q":{"text":"Awesome service and very tasty food. I ordered their soup of the day, which was grits and ","useful":0,"cool":0},"jLmrDWFesqMHHcxU41dl9g":{"text":"Fantastic food, great drinks, and excellent service (at the bar, at least).  I went there ","useful":0,"cool":0},"WhfGmfhk-Mw569mVsBzxpg":{"text":"EXCELLENT Sunday Brunch with friends....food was fresh and delicious....the sort of flavor","useful":0,"cool":0},"NKmbcbKB_57bDwKJ6rexJQ":{"text":"What a find!  \nReally enjoyed our lunch here!\nKids chicken tenders was huge and very good!","useful":1,"cool":0},"mowS2AxP5D7Y4sIa42SQnw":{"text":"Walked in earlier tonight to get drinks. The bartender ignored us for 20 minutes. She defi","useful":2,"cool":0},"KL0AjHXKCbSW38i0VO3ayw":{"text":"The blackberry mojito was absolutely delicious and sneaks up on you, trust me! Celebrated ","useful":0,"cool":0},"8paURUMAZ0r1ikPst6qGSw":{"text":"So good. Started with the fried green tomato stack. The \"stack\" is two tomatoes, almost la","useful":0,"cool":0},"LXYmjVzY9K2o4bMtOcOYsQ":{"text":"Came for lunch today. Tried the crab guacamole.  Delicious bit crab was hard to figure fin","useful":0,"cool":0},"9T_OtgeGJlQkXE4v0_Z-4g":{"text":"My server looked like Lily Sobieski in her prime.\n\nAbout the lamb chops - I ordered mine m","useful":0,"cool":0},"NJs4Acc6GSczpaPHTLdGCw":{"text":"I love this place!! Great Food!! We started with the crab and avocado dip and we had the B","useful":0,"cool":0},"V3gf5M64cwYdVXO9TwO5Cg":{"text":"The food and service at Lula was wonderful. The staff acknowledged us at the wait area, on","useful":1,"cool":0},"R7NcuJcl8C5Tz8RJ7bkZzg":{"text":"Great atmosphere and service. The glaced ribs and Mac and cheese were on point. The in hou","useful":0,"cool":0},"ZQvIzWhByWZn6Xz2IOPD5g":{"text":"This place has a great vibe, lots of seating and would definitely be good for big parties.","useful":2,"cool":0},"3yV4oCTtAv6_8-ElNYFmCg":{"text":"Lula was a delight from start to finish. I visited on a weekday night and the space was no","useful":3,"cool":0},"R44mmC4qQm2EXmQs_Wk4-g":{"text":"We decided last minute to come here on a Friday night as Yelp suggested it was a \"hot new\"","useful":4,"cool":2},"Grkz-uk-dQwVL_pGFunUug":{"text":"Such lovely service and such good food!  Grilled veggies salad was big and filling with sp","useful":0,"cool":0},"Uq76_3Vhh7atUNFlrA9HyQ":{"text":"Great environmental vibes - only reason for 2 stars. Probably would have given them one if","useful":2,"cool":0},"kWD5hcq9_t-qdHHcZsl8Ow":{"text":"Hi!  \n\nI've been to Lula about 3 times. The crabmeat guac is so fresh! The queso is also t","useful":1,"cool":1},"BHXFXwFreRa_Uyh98OaXPg":{"text":"I had the shrimp and grits and it was not the best. Shrimp tasted burnt & grits were warm.","useful":1,"cool":1},"I80In7XUfbhZ1LIjCx869g":{"text":"my wife and I ate at Lula during our New Orleans vacation. we were pleasantly surprised ho","useful":1,"cool":0},"sF_k-6QQKlCo-ZjaZM1Kjg":{"text":"Visited here for brunch with a bachelorette party. We were very intrigued by the $20 botto","useful":0,"cool":0},"560nu1rDxJfmrBQguIGjJQ":{"text":"This new restaurant is awesome!! One of the best with great personal service. Gretchen is ","useful":0,"cool":0},"4dJ0Rb3oW9HnCoPF4pT-dw":{"text":"They'd fry my beer if I'd let them. Listen, don't get me wrong, their food is pretty decen","useful":1,"cool":0},"_L3dYi0mXfq-chgecqhJtQ":{"text":"Great Drinks, good food. Also they are very welcoming to making reservations. I had a larg","useful":1,"cool":0},"5mevTGadkYA_eEcN6-pTRA":{"text":"We waited for a bar spot to be cleaned and hopefully disinfected. We felt ignored after si","useful":2,"cool":1},"-3b8wF17dCn7fky26Jcobg":{"text":"This weekend I went to Lulas (which isn't my first timw) I usually get the lamb chops whic","useful":1,"cool":0},"zC14zIQEEpnhWkSS_TfaVg":{"text":"Great experience!  Start with the gin and tonic (I could've had several all by myself.) It","useful":0,"cool":0},"nCBnsMcvOduR40oY_1igyQ":{"text":"Found this place in Nola as a fluke walking by in the garden district. Stopped in to get a","useful":0,"cool":0},"shz6QUqJFuXBA95dr9kUFg":{"text":"The place is absolutely endearing on the inside. I really enjoyed the dim lighting with th","useful":1,"cool":1},"ydRioNwlkA3oNAlLHUISNg":{"text":"Very modern atmosphere! Great outdoor seating area! I had the cucumber Collins drink and i","useful":1,"cool":0},"Hf_e1Kzh3fEnW_p8CfeJNg":{"text":"I loved this spot! Their gin is amazing. My husband said the mojito was the best he's had ","useful":2,"cool":0},"qNuVyVZmRXp0SR-HFnyYtg":{"text":"Food was decent, but they are not checking vaccination records and do not have outside sea","useful":0,"cool":0},"04zvCy-s0ZsKXuIhacpdbw":{"text":"HAPPY HOUR ALERT!!!!\n\nThis place has a great Happy Hour- $5 cocktails using their house di","useful":4,"cool":1},"vLEazWF3bNQ2grE7qBmy8w":{"text":"We had lunch on their front patio and it was a really good experience.  They have giant sq","useful":0,"cool":0},"0vIYfle1L-ANMDgoenS90g":{"text":"My family visited New Orleans last year, but realized forgot to review this place until I ","useful":0,"cool":0},"4P_v0XFnMt2dXxSkq-2Vug":{"text":"My daughter had her 18th birthday dinner with 10 guest. The food and service was excellent","useful":0,"cool":1},"Ck3HHCGig7AqvenS4xgxzw":{"text":"A group of 10 of us met at Lula Saturday 8/17/19.... we had a wonderful time. We had an ea","useful":0,"cool":0},"StSPtmaX3R_dMCyzVATUpQ":{"text":"The restaurant itself is really nice. There's a real distillery in the restaurant that you","useful":0,"cool":0},"fg6juA7x7Te5kqCl942JNw":{"text":"This is a must see distillery. Great service and atmosphere and that just scratches the su","useful":0,"cool":1},"KaiE_VcyuZw98Yf9_NX53A":{"text":"New favorite spot in New Orleans ! The vodka is out of this world fantastic and the price ","useful":0,"cool":0},"xOhTtJBIaC3XdPgI3HngCw":{"text":"Good choice. We had reservation at Birdys but was too late and they said they closed the k","useful":0,"cool":0},"Tvyu2M2mZUqtqQwzKrzHnw":{"text":"Absolutely fantastic! We came in for Thanksgiving dinner. This was our first time ever din","useful":4,"cool":4},"ypu6CPCXK_5xFH_1yBVneg":{"text":"My worst dining during a 4 day trip to NOLA. \nStarted great with pleasant host and hostess","useful":0,"cool":0},"oXeC7EwF-qExVL2wQkzLKg":{"text":"Good music fun vibe inside.  Ordered the grilled gulf fish,  was a party of 6.  Half our f","useful":1,"cool":1},"D0iWOf79ZLq6vEss7fkW8Q":{"text":"Booked a big group for brunch and we were so impressed with the service and food! Bottomle","useful":1,"cool":1},"isCOfa7GqFSdLRW84okczw":{"text":"The lamb chops were good but my shrimp and grits were mediocre. Almost no alcohol in my dr","useful":0,"cool":0},"tKKYq9YunHuw_-TLpgLfSA":{"text":"Great atmosphere, great cocktails and happy hours. However, the food was very bland. My hu","useful":0,"cool":0},"rTOnl03mi8wYCWc4AgLv0A":{"text":"Last night was my second time eating at Lula. I'm hesitant to give them three stars, but I","useful":1,"cool":1},"IggEznxTjXQz8y5b_MZEcw":{"text":"Took advantage of the steak night special that was offered, it was delicious ! Everything ","useful":0,"cool":0},"VVEgHhlfLlLsTeanCTjjOQ":{"text":"Lula is a great place to order from for pick-up. All orders come with a free hand sanitize","useful":0,"cool":1},"ZIXomMLG1lgT75JnJSFJDw":{"text":"Bottomless vodka was fun but the staff brings out the vodka and juice in small bottles and","useful":0,"cool":0},"mtJpzFl7WckrZyQoWBM40Q":{"text":"Lula was a cute modern industrial spot we decided on for a late lunch! Our waitress was so","useful":0,"cool":0},"Gn_AMrlz4lVOihUvQPPTng":{"text":"I've been here twice - once for a regular sized family dinner (party of 5) and once for a ","useful":1,"cool":1}}