{"XUSOn9rlFwUSDSRJNr_nVQ":{"text":"The food is awesome! Staff friendly. Spanish coffee, shrimp and crawfish nachos, fried tom","useful":0,"cool":0},"lNV1PqfrgTiG3gpy0oIW1Q":{"text":"Decent food, great bar. Service was slow, but we had a table at the window and there's alw","useful":0,"cool":0},"A1XbVpszwozdfbJswH1jbg":{"text":"Enjoyed the roast beef po boy with potato salad and bread pudding.  Had excellent service.","useful":0,"cool":0},"2kQpWWteLu-9uaB5UnRF1A":{"text":"English is my secondlanguage so forgive me typos and style. \nCompare to other New Orleans ","useful":1,"cool":1},"GnHfGxPSz6Ogq3aPwjkEJA":{"text":"First time at this place and my experience was not impressive.  I ordered a basic po'boy s","useful":0,"cool":0},"2tjzILJzL2XWaeKfvcxcAg":{"text":"The service was fast and attentive while also welcoming. I had the shrimp po boy and the s","useful":0,"cool":0},"ndN2UOCjKVCuW-hMZkqUFQ":{"text":"We came here once before living in New Orleans because we were passing by and hungry for s","useful":0,"cool":0},"NodVhAciTDKIwcbk7FEUBg":{"text":"Bread pudding=fantastic.\nSampler= food for 2. Solid and great value if shared. \n\nCocktails","useful":0,"cool":0},"tFHYmxM8PSZ3nKvdUOZOgg":{"text":"Do not get excited and think that this is a four-star establishment. Either all the other ","useful":0,"cool":0},"T6j4AZuYcX20iYYsAlzNEA":{"text":"My first po'boy experience, and a good introduction to this aspect of local cuisine.\n\nI ca","useful":0,"cool":0},"NlP9E3_I9jWhtPeI2Yi6jA":{"text":"Andrew the bartender was so great to our group last night! He was friendly, attentive, fun","useful":0,"cool":0},"BELdUhRAPZRPlfVD6PTq7w":{"text":"The seafood po-boy was the best I had in New Orleans it was light and the fried green toma","useful":0,"cool":0},"Cs2pF1yb9OeXmj2eMwXTiA":{"text":"We had the best experience here! We walked in and were immediately greeted with warmth and","useful":0,"cool":0},"CsUsUbRF9wem5PV0zYqcwQ":{"text":"Roaming the streets of NOLA, came upon this place on a late Sunday night. Wasn't busy and ","useful":0,"cool":0},"0dPjpPauzHp7F8XfUCmPhw":{"text":"The seafood nachos are outstanding. Our hotel is right down the street making this one of ","useful":0,"cool":0},"vwIWVnv6QajdDJ5IrxDilw":{"text":"This is the only place in NOLA that we came to twice. The bartender was super sweet and fr","useful":0,"cool":0},"Jjw03oQgLeHE3Gof3vYR3w":{"text":"The food here is still great, nothing new here. YD ordered her seafood nachos again, and t","useful":0,"cool":1},"SJ7AOEOiWQRzx1lpvAL4GQ":{"text":"Both of our meals were absolutely awesome. The blackened chicken and by po boy sandwich wi","useful":0,"cool":0},"PW9CkqF9dPK2S0a6zMBciQ":{"text":"Before we went to New Orleans we had asked our friends for a list of must-do restaurants, ","useful":0,"cool":0},"CySa_cytLXmo7dv1m6cjBg":{"text":"Took 2 hours to get our food. A table that arrived 45 minutes after we did got our good be","useful":1,"cool":0},"_nq0CkQJ2qkjUw1dW4_fHw":{"text":"Not the greatest meal we had in NOLA.  Our waiter was very friendly and attentive.   I was","useful":0,"cool":0},"PoAFb86x3Jg1fPDWkw_VRA":{"text":"The only reason I rate this place 5 stars is because I've craved fried green tomatoes ever","useful":0,"cool":0},"TK6qh2NyO0icw9aAOxgeow":{"text":"Saturday night dinner\nSuper sweet waitress\nFun atmosphere - like Bourbon on Royal\nMargarit","useful":0,"cool":0},"jENT9uwz5qtJ-2DhhnWDLw":{"text":"Went here this past weekend with friends visiting from out-of-town. So glad we did! Don't ","useful":0,"cool":0},"wiLHPRDyo7l4KlaJAOf2ag":{"text":"Busy at 2:30 but sat immediately.  Red beans and rice was great! Local beer on tap tasted ","useful":0,"cool":0},"rE79qG30cMgq0Qx2RM5LqA":{"text":"Delicious Sunday brunch...with bottomless mimosas to boot! The staff was the best we encou","useful":0,"cool":0},"gWcUYNNIGKF_ljvp25EoLg":{"text":"Stopped here for a quick beer. The bartenders were great and let you sample then first. Al","useful":0,"cool":0},"ENPWO9bHt9R_745YZnTxvw":{"text":"Came in because they're one of the few places open after ten pm. We were pleasantly surpri","useful":0,"cool":0},"JrIN0AS-p72C2A4jityDVg":{"text":"Heard great things but service was so so and the kitchen screwed up two orders (shrimp nac","useful":0,"cool":0},"jvE6x1uRtz7PNs7MvXxcxA":{"text":"Came in looking for a late night fix.  I grabbed a gumbo but I wasn't impressed.  It was a","useful":0,"cool":0},"hZDm_POswAeGCtIdVMhrCA":{"text":"First the staff...  Aubrey, Missy - could not have been more welcoming after our poor expe","useful":0,"cool":0},"LaHwhUNHVFjgihN83Z8Zsg":{"text":"This place from start to finish was a complete masterpiece. The food is unreal. We had the","useful":0,"cool":0},"latS-v4YLl5TW0uSbxOZOw":{"text":"Stopped in for drinks and the atmosphere was very cozy and laid back. I had the roast beef","useful":0,"cool":0},"wdQHFUQOFNNcvZLgHhWbuw":{"text":"This was my first meal in New Orleans after driving all the way from Chicago. I had the de","useful":3,"cool":3},"38QVLP1WrtM5MtR4xhkrpA":{"text":"Seafood nachos were great, poboys and gumbo were pretty good. Go there and ask for Patrick","useful":0,"cool":0},"L4LJ5WN2DPBC3UNM4g7Dmg":{"text":"My husband and I discovered this place on our third trip to NOLA! The food, atmosphere and","useful":0,"cool":0},"-nuTaJciERtblaNCT-mMxg":{"text":"We stopped in here this evening with a fellow Yelper for a nightcap. It was conveniently t","useful":1,"cool":2},"bQBsAuw6Bsp4gmywxcjcnw":{"text":"We dropped by for an early lunch here and came away truly impressed. The fried green tomat","useful":0,"cool":0},"nU_EdY8EQkrbp6DY4YxxpQ":{"text":"Highly recommended. Family owned business. Great food! Very clean. Nice casual ambience. G","useful":0,"cool":0},"iRaT0TjXPW0ymKbUQkBz-w":{"text":"Pretty good!\nLunch with nice service.\nHurricanes were expensive, but good.\nGumbo was great","useful":0,"cool":0},"TQuXlpRriIIOnWv4LmUE0A":{"text":"I can't comment on the food here other than the french fries (I know... lame right?) howev","useful":0,"cool":0},"TTOOmpBLua2M2weLQqdItQ":{"text":"801 Royal was fabulous! The food was great. The service was outstanding. \nWill eat here ev","useful":0,"cool":0},"KSWwhoM4ih7Bqdu2BI9HPA":{"text":"Delicious food and very friendly staff! Loved the sausage sampler. I will definitely retur","useful":0,"cool":0},"zm1TXy-3W0T4QvU5v3yQCw":{"text":"Great muffuletta. The olive mix was superb! The kids shared a fried oyster and fried shrim","useful":0,"cool":0},"u8UaMhjDqnYohWJs-3wDhg":{"text":"This place is a solid 4 stars. Was not feeling that great since hurricane slurpees seemed ","useful":1,"cool":1},"z40TeV_3RE8IhQqPUBPTJA":{"text":"We didn't try the food but the drinks and atmosphere were divine. The Bloody Marys  are no","useful":0,"cool":0},"MgTQF5AJYMReX0GGhc9sLA":{"text":"A rare five star review. And it's all on the bartender Aubrey. This guy is talented and un","useful":0,"cool":0},"c-X3Xg5tAVs69I3Tjoguag":{"text":"Great place to grab a bite to eat or get a drink to go! Very friendly staff and the barten","useful":0,"cool":0},"3jYkkzM2bkcOBcEeC7Zbaw":{"text":"Ignore this review if you're looking to read more about 801's food. Read this review if yo","useful":23,"cool":15},"KbEYT_w0_lxtIl38cLuoFQ":{"text":"Horrible service! First issue was with the mimosas. I noticed we didn't get cherries in th","useful":0,"cool":0},"dVSGDGLPU-giKSGO2CG2pw":{"text":"Small place with typical local food like po boys or fried seafood/chicken.  We ordered the","useful":0,"cool":0},"hZpmbLh-a5r9drYRbrxX6w":{"text":"Had the SEAFOOD NACHOS $14.95 (Homemade Tortilla Chips swimming in Shrimp, Crawfish and me","useful":3,"cool":0},"L05OpDpW2lDgcK5g581dyA":{"text":"Very laid back spot with great food and a great atmosphere.  Our bartender Storie, was ver","useful":0,"cool":0},"NLCib4Mzb3eUI7qhiKGKQA":{"text":"Heard a lot about this place and walked by it a number of times but never gave it much tho","useful":0,"cool":0},"WWt0Dhc-KFndJ4ESnU-dvA":{"text":"All the great things others have said about the seafood nachos are true, they were SO GOOD","useful":1,"cool":2},"CE1iAE8ztya7eOIwHBBgkA":{"text":"Okay I can't get this restaurant out of my head... In a good way. Went on a family trip an","useful":2,"cool":0},"jLc1LQ9GcTVg68B9qjUpCA":{"text":"I stopped by for a late lunch late in the afternoon. I ate at the bar and ordered their sh","useful":1,"cool":1},"O_tFzHU-FtB8p-x2abbdXA":{"text":"Shrimp & grits were average. I've had better. Endless mimosa with brunch fare made up for ","useful":0,"cool":0},"yf_oekAQ5_EFbtrQkrwzqw":{"text":"We were in NOLA for a few days and this was the first dinner here. My wife, who is less ad","useful":0,"cool":0},"WYylSUUXVUrhjUymzD3BBg":{"text":"Went in to grab a quick drink and maybe a bite. Asked the bartender for a recommendation f","useful":0,"cool":0},"BZ_JWf2WOq9batZNPa1Z0g":{"text":"The food service is extremely slow and Royal Burger was average at best. The only reasons ","useful":0,"cool":0},"Zu1VyAtVJEbvnDk7JqY6CQ":{"text":"What a great night. The staff (all moved from another restaurant with the same owner) are ","useful":1,"cool":0},"cnss8e3DjFWV5FiEJyE24A":{"text":"Great cozy neighborhood bar. Very clean. Perfect for those who love being social,  but wan","useful":0,"cool":0},"CjoaA_LktjmBPu05aj1sWQ":{"text":"Great place and AMAZING staff. The bartender Drew welcomed us in and by the time we left N","useful":1,"cool":1},"C5q18egPyZ9VSGtwpni_XQ":{"text":"Good drinks and hot bartenders. Really good place for a quick drink. Highly recommended.","useful":0,"cool":1},"XR8a-JvpsjBv0Liy4Ub-kA":{"text":"Don't be fooled by this restaurant's yelp reviews!!! My husband and I drove all the way to","useful":0,"cool":0},"FAD5IW5mvZGaqQYsCkZMRw":{"text":"Great seafood nachos!!!! Friendly staff. We went in at 11:58 pm and they told us the kitch","useful":0,"cool":0},"XVBYL-T2vp9j2t-0vUuKkg":{"text":"We stopped in here for dinner based on the reviews, but were not thrilled with the PO-boys","useful":0,"cool":0},"NL4Xb931CLKeqCnPpNBvkQ":{"text":"We stopped in for a late dinner, and was pleasantly surprised to find a very accommodating","useful":0,"cool":0},"qQKRwPVGuxHgTFvvQOPY-w":{"text":"We ate at 801 Royal our last night in New Orleans.  Boy, did we save the best for last.  W","useful":0,"cool":0},"e5ymP3csYd3KShyumWqONg":{"text":"Great customer service and the food is outstanding.  Blackened chicken pasta superb. Small","useful":0,"cool":0},"qo-bT62m-EBsGiNccoovjg":{"text":"My boyfriend and I flew into NOLA late at night. After we checked into our hotel, we frant","useful":0,"cool":0},"44N8j5Y2Q529Id63jS9SaA":{"text":"Good place to stop for a quick bite. Has a local vibe to it, somewhat of a dive, but food ","useful":0,"cool":0},"V2ThX-iDzV4wDvUGJvO4FQ":{"text":"Decent bread pudding!!    I ate most of it before taking he photo.\n\nFood looks decent, but","useful":0,"cool":0},"w9xxvLjenD3xaEAYw5T0XQ":{"text":"We love this place!!! My husband and I spent a weekend in NOLA and this was one of my favo","useful":0,"cool":0},"gO9KihhjfFyhyesftdyQxA":{"text":"Yelp users steered us right on this one.  I had the Cajun Sampler, which was all good, but","useful":1,"cool":0},"zk-agIzXLRgBZdBfQ6DC-g":{"text":"i just spent a week in New Orleans and this was the best place I ate at. I'm still daydrea","useful":1,"cool":1},"L-J6-aQty6mXQx2Dn407vQ":{"text":"This place was recommended to me by a local painter. We were greeted and sat very quickly.","useful":0,"cool":0},"B8IBjPBbsQtvqAR48MGypQ":{"text":"Nice restaurant. Laid back atmosphere.  Server was friendly.  Red beans and rice had great","useful":0,"cool":0},"Y_ndCogHlwYWAgdVe-gqgA":{"text":"Great Bloody Marys! The service was awesome.  And the food was right on par with what I wa","useful":0,"cool":0},"4mdndLMyJqfxMXVyOEX-Rw":{"text":"Great spot for a quick, casual bite or drink. The gumbo was hot and just the right amount ","useful":0,"cool":0},"XLROcndaz9Q2qq8me8capw":{"text":"Stumbled into this place early Sunday afternoon and they were pushing some brunch with unl","useful":0,"cool":0},"Nw3bWH5-2a5Od-KuL44Iew":{"text":"We stopped here first when we got to New Orleans service and food was good. If your hungry","useful":0,"cool":0},"Mu9V4_iqef1ssz7m3WyEog":{"text":"They were busy when we arrived but we got a table right away. We were there for one thing:","useful":1,"cool":0},"iSOx2BZHbYKVh8eG6plCXg":{"text":"Just came for dessert. Nice people. The offerings were bread pudding and cheesecake. Bread","useful":0,"cool":0},"tvstSBYZXkbFlNRJ60TkHA":{"text":"Excellent food (especially for the prices).  Hurricane drink was expensive, but ginormous,","useful":0,"cool":0},"hgfq01lnujdjc63sU6b1gw":{"text":"I am generously giving this dump 1star because I have to in order to post this. This place","useful":0,"cool":0},"5cf1qNt_kLOHmZO9DQ9GDw":{"text":"We loved the gumbo, and the shrimp nachos. The staff was excellent, I even left my souveni","useful":0,"cool":0},"akWSX5fmp1WuWpN-x2pNKQ":{"text":"We only bought a couple cocktails to go, but the service was out standing. Seems to be les","useful":0,"cool":0},"UP7N-sVDWqXSfno_H45Kdw":{"text":"I came here to meet some friends for drinks, but needed to go to the restroom before they ","useful":0,"cool":0},"SfBqlBX7F_bq7E5-4yLNbg":{"text":"Service was very good! We ordered Nachos and they were not good. Cheese wiz and frozen shr","useful":0,"cool":0},"-i3zyXrelJh2zS9ZoMMNRg":{"text":"As a concierge at a hotel in the French Quarter, I send a lot of guests to 801 Royal when ","useful":0,"cool":0},"euGch5wnZC_Pe2whe4f8BQ":{"text":"I give walking tours in the French Quarter and I stop and multiple bars during the tour. T","useful":0,"cool":0},"-P3g-_gglLpuLrlJ1TSHXA":{"text":"Amazing food! Try the Cajun Sampler if you're real hungry. Doesn't look like much from the","useful":0,"cool":0},"aYSaaB7Z88Zl388R5DLW9w":{"text":"In my opinion they have the best muffaletta in the french quarter. A whole is enough for t","useful":0,"cool":0},"VlJ-EgnSTsj2G7l-afZPaQ":{"text":"I loved this place. One of my co-workers who loves NOLA like we do put this spot on my rad","useful":0,"cool":0},"rdjAM7ZJt84-nF7-I3ExrQ":{"text":"Read about this place on Yelp and added it to my to do list for my New Orleans birthday tr","useful":1,"cool":0},"5fvFbKmG9rggzGw2iXpCug":{"text":"Stumbled in here on a NFL Saints Sunday. Free shots when the Saints scored! Great service,","useful":0,"cool":0},"zxGL5DpHwPvGWDSMtAeLfw":{"text":"I only had one night in the big easy and decided on this place based on the reviews. \n\nI h","useful":0,"cool":0},"dOtz1P1ZrNvs6ORYElEHvw":{"text":"Great food .. You have to try the royal tomatoes and fried catfish!!! I ordered the cajun ","useful":0,"cool":0},"olPmp_gv75t_kMNrWSPMWQ":{"text":"Gotta have the Royal po boy - fridge green tomatoes and shrimp with a remoulade sauce,  an","useful":0,"cool":0},"bDuwC-coKrwImrMU1-7unA":{"text":"This place is incredible. My favorite restaurant ive been to in New Orleans so far. I orde","useful":0,"cool":0},"Ot0F6Gs4sUPt3jvTbAYWIw":{"text":"Five star customer service! Unbelievably awesome restaurant/bar culture. My favorite of al","useful":0,"cool":0},"HABa6uys387WcdrhMmuZ9A":{"text":"AMAZING SERVICE! The staff accommodated my nightshade intolerance (food allergy) without h","useful":0,"cool":0},"qEqx_whVEbFzzYgJqJFIrw":{"text":"Shrimp and rosemary Po boy wasn't all that great. Overpowered by cheese. Seafood nachos wa","useful":0,"cool":0},"OvnBcGSs1FgP-tCisExtVA":{"text":"Based on the reviews, I was expecting more.\nI really thought I'd give this place a higher ","useful":0,"cool":0},"O7n2M_BPgNRz-2HdLxrMKA":{"text":"Fairly bustling near Jackson square. We just wanted dessert and the waiter welcomed us. He","useful":0,"cool":0},"OsxNc4Uysi6N_HH0yiz7YA":{"text":"Bartenders were friendly and the food highlights Louisiana flavor very well! Portions are ","useful":0,"cool":0},"Tghx7t1k3rCCLZjP6dR1oQ":{"text":"Ridiculously good $3 oyster shots!\n\nWe were attracted to the bubble machine delighting eve","useful":0,"cool":0},"V9scmmSmsDWqeBAZQd73dQ":{"text":"This place was amazing. Some of the best crawfish etouffee I've ever had, some of the best","useful":0,"cool":0},"RZhm3dFBxb44CiLJhjsnmg":{"text":"Was looking for a good oyster house and thanks to yelp, found this place.  Chargrilled Oys","useful":1,"cool":0},"0_Mc8R56sCJaTvhW8fTT9w":{"text":"We went here on one of our first nights in NOLA! Enjoyed the heck out of their seafood nac","useful":0,"cool":0},"x12w4u6-UH627uTyvDkbRA":{"text":"Great service, great beers and great Po Boys. What else could you need?\n\nRoyale and roast ","useful":0,"cool":0},"Dqn5g-0X6cOxwXtkBNLGPw":{"text":"Great Po-Boy for Lunch.\n\nHad the Royal Po-Boy which had fried green tomatoes and shrimp on","useful":1,"cool":0},"IOkGEW4fXO7QinLaipu30g":{"text":"So we were just walking around and bummed into 801 Royal and they still had happy hour goi","useful":0,"cool":0},"pWxNR2RVQgSkV6RxtMjkbA":{"text":"Didn't stay long, just poppin in, but service was great and gumbo was yummy. Only been aro","useful":0,"cool":0},"FQVlvOOx4JkCfDUdYrNcfw":{"text":"BEWARE... attention manager and owner    the service was great, the waitress was a sweethe","useful":0,"cool":0},"1OcktzjBJnqIty6sWURITQ":{"text":"Came in seeking refuge from the olfactory punishment of a post-Mardi gras Bourbon Street (","useful":0,"cool":0},"cgk6Ym_slHjPWB9co7J_QA":{"text":"A nice place to stop in a very busy place. The oyster shooter was refreshing. The roast be","useful":0,"cool":0},"qVOk1Nafq_GkslwMVk3gmQ":{"text":"I got the Blackened Chicken Pasta and it was phenomenal. The chicken had just the right am","useful":0,"cool":0},"6VrtQrAaNO8vfAlPfA7Jbg":{"text":"Stopped into this cute little bar walking down the street and met one of the coolest barte","useful":0,"cool":0},"k1CbNVu-DNsTzMEX1YEI3w":{"text":"Had a blast at 801  Bartenders and wait staff very nice.  Drinks pleantiful.  We enjoyed f","useful":0,"cool":0},"IR5CQ9L2ztjrA6DX0ORSoQ":{"text":"Stumbled upon this bar on our last night here and what a gem! This is a locals bar, as tol","useful":0,"cool":1},"I69tlM7cvBDZPf-SALKNTw":{"text":"We came to 801 Royal after an awesome walking tour and at the suggestion of Yelp! Cute lit","useful":3,"cool":2},"C6OYjprAb7oBAZY11l-p0Q":{"text":"Nothing fancy. Kids and wife were hungry, basic cajun fare at French Quarter prices. The s","useful":0,"cool":0},"H2zYyQC4pH9Cia7b7kJNew":{"text":"Best surprising dive ever. We had a big group and they gave us the private room... For fre","useful":1,"cool":0},"pTOWu9BHSK9tQYWwK0aUww":{"text":"Service was awesome, and so was the food! I got one of the po' boys, and I as well as all ","useful":0,"cool":0},"rtgNQff9QRZDhTtLYB64lw":{"text":"I really enjoyed the alligator/andouille sausage but the crawfish etoufee was literally so","useful":1,"cool":0},"-Fdz-LwYnsXAM2vEKLOUqQ":{"text":"The drinks are strong, the food is good, and the service is prompt.  But the acoustics are","useful":0,"cool":0},"C541AUivjU2hiuNztsks1g":{"text":"Amazing local restaurant tucked away in the quarter. The food is amazing and holy crap you","useful":0,"cool":0},"xekt182cvGjnpgJDA8N6gw":{"text":"My husband and I stopped here for a bloody Mary on our second day in New Orleans and they ","useful":0,"cool":0},"Jh3Y4eiugTk19CRuof2eOg":{"text":"Top rate food and service. Our waiter was great and added to the experience. If you bump i","useful":1,"cool":1},"SuekpK0KVaBoTHpB5PgxsA":{"text":"Still very new and still doing a great job. Full house on a recent Friday night. My compan","useful":3,"cool":0},"C_WT2smqoSpGMY0Lfv6OkA":{"text":"Just got back to the hotel from 801 Royal. I selected this place based on the excellent re","useful":1,"cool":0},"l1yUzO4aBef3n7kE5ET31A":{"text":"Great food and AMAZING service!! Definitely will be back. I had the shrimp poboy and bread","useful":0,"cool":0},"zQ4LGGzKluhrwfkJqRHOUg":{"text":"We stumbled upon this place by accident and fell in love! We were waited on by a super hot","useful":0,"cool":0},"RBK_HLZzfpiIvUMpvhO_sQ":{"text":"Bad bloody Mary's, soggy nachos, appetizer came out with one of two entrees. Grilled chick","useful":0,"cool":0},"ixD9Q990QfdEAHkO6eGiCQ":{"text":"Patrick the waiter-you are so much fun and I wish you were my waiter at every restaurant. ","useful":0,"cool":0},"oFBXCLUyTD07ncy-jcnHyA":{"text":"Stopped in for a Bloody Mary on the go. Delicious! Service was quick because it was pretty","useful":0,"cool":0},"06zltbBhGOS8vZ0muYFOsg":{"text":"Yum. The muffuletta was okay. Too much bread, and it was too hard. But the dirty fries mak","useful":0,"cool":0},"odwytxzwUt-Mg3FEdIvk9Q":{"text":"Sausage sampler was ok. Dr B Rosemary shrimp Poboy was terrible. Very few shrimp, and it w","useful":0,"cool":0},"NYAspLXmWKoXvpD-I98mhA":{"text":"Best Bloody Mary for sure...  Crawfish Étouffée is fabulous... Lots of crawfish... Friendl","useful":0,"cool":0},"ro6WMSYr1QmcvrElzW7EhA":{"text":"As out of towners from a different time zone, we wandered into 801 Royal late and hungry, ","useful":1,"cool":1},"B2_puV3qdz82OuFst8G2hQ":{"text":"This place is amazing.. they took such great care of our bachelorette party. Our waiter, D","useful":0,"cool":0},"7wMLz9LcZ2CZifGZIPW4Bw":{"text":"I ordered the Cajun Sampler which is a very convenient way to get all the classic of NOLA ","useful":1,"cool":0},"Y98adaDM_5K2G2LqfAPlOQ":{"text":"I cant believe i found this bar because of a rain storm. Easily the best in the STATE. My ","useful":2,"cool":2},"YCbnbgvxK3eltftrhD8_Rw":{"text":"The Étouffée I ordered as an appetizer came a bit on the Luke warm side and had way too mu","useful":0,"cool":1},"3zuNHKZQ7lRs2gKbYoj-4w":{"text":"Awesome roast beef po' boy! Best thing I've tasted in Nola so far. The fried catfish and s","useful":0,"cool":0},"SqEhWQG00SFs2nYlREmAwg":{"text":"Stumbled upon this place, came in late, and LOVED this place. Great food, great service. C","useful":0,"cool":0},"giEZzpGJB2rsMX8GNQF2lA":{"text":"We walked in and were a bit nervous as it looked like just a bar, but the food was really ","useful":0,"cool":0},"DeUAipwPwCBX4JWlH1_JMg":{"text":"It's just a tad bit sacrilegious to serve a Sazerac in anything but an old fashioned tumbl","useful":0,"cool":0},"Ll9s6apWZncOi-WQw60IuA":{"text":"Definitely more of a local spot if ever in town again wanna try the food grabbed a drink h","useful":0,"cool":0},"-B1ET7-NA9smZfehkYSfKA":{"text":"Only reason this place has great reviews is because of the food. Only people in the place ","useful":0,"cool":0},"xjFIH0-CEA-Y-9HorOlWaw":{"text":"Extremely disappointing. It's a frat sports bar. I thought I was coming to a niceish place","useful":0,"cool":0},"RIZccNAp13fGz_Yp6yVtDA":{"text":"We just got back from Halloween weekend in NoLa and this was our favorite spot for cocktai","useful":0,"cool":0},"p3x46EKEMZQ33f08Mf0lWg":{"text":"Was visiting from Boston and was walking around with friends, just looking for any place t","useful":1,"cool":0},"xGXVYip0cZKcsL_KRib_GA":{"text":"801 Royal was the first meal we had in NOLA.  Great food, chill environment, great people!","useful":0,"cool":0},"uKVamSISgXciQ_PcxZUE4g":{"text":"Best bartenders around! Very good service and the good is always fresh and tastey. Family ","useful":0,"cool":0},"LiyEJJKRCoEoWyrIMDbpKg":{"text":"Killer seafood nachos and my red beans and rice were phenominal.  Atmosphere was great and","useful":0,"cool":0},"bvOQKCikExe3s4acsSLDIA":{"text":"Our server was the best part of our experience here - Brett B. Perfect hospitality, cracki","useful":1,"cool":1},"OlT69JakGx4wVs-25NCR2Q":{"text":"Service is amazing!!!.. Jamie took great care us for a party of 12. We all had some crazy ","useful":1,"cool":0},"gL6hQ3t47A6Kb_rYSzpxJQ":{"text":"Say this slowly...OH MY GOD!!! This was some awesome food! I ate the crawfish pasta and th","useful":0,"cool":0},"rZ_-kx0PJ7y1akqG0ExpWw":{"text":"We found this place before a tour and decided to grab some drinks.  The bartender was cool","useful":0,"cool":0},"6RpRzoNgCBurHPG-ICsTrg":{"text":"Great stop for lunch. Staff was super friendly. Got the seafood nachos which were good, bu","useful":0,"cool":0},"ragVtD9yML6nsbZ94fK90Q":{"text":"Great spot away from the fray.  Stopped in for lunch. Enjoyed the food and Axel was a perf","useful":0,"cool":0},"4_xLA64asn_Ia8VGNl-KJQ":{"text":"We really enjoyed our experience at 801 Royal. Brett was an attentive server and gave us s","useful":0,"cool":0},"Wb1bbXXF9k3XI1vL9GDuaw":{"text":"Maybe the best overall dinner we've had in the French Quarter.  I recommend the sampler, m","useful":0,"cool":0},"Q3ZqfXLIah_EXLu5bkgMqA":{"text":"Not impressed with the food. Skimpy on po boy meat, chewy po boy bread, fries cold, expens","useful":0,"cool":0},"drAZI3ZbPUoLdmSDX110-w":{"text":"Almost like a hidden gem of the French quarter, not sure about the weekend but during the ","useful":0,"cool":0},"yYnfQcsxaRd02pBwZuBf8g":{"text":"So this is the first time we've ever chosen a NOLA restaurant based on nacho reviews. But ","useful":0,"cool":0},"D3x3_ix69po27EvJClVN_g":{"text":"Patrick, our waiter, was amazing. As in, one of the best servers I've ever had, period. He","useful":0,"cool":0},"fl9SHo_mUCGNfpnwB-UCdQ":{"text":"Walking the neighborhood and checked yelp for suggestions. FANTASTIC!  Lunch was alligator","useful":0,"cool":0},"ddgzbCBoXPtTMBHp22gnHg":{"text":"Met up with some friends here for breakfast after I ate mine elsewhere. Ate the Shrimp & G","useful":0,"cool":0},"tdL3OKW2RczDY-SRDI1-_A":{"text":"Nice staff, mellow. Didn't eat here but great place for a drink and some conversation","useful":0,"cool":0},"7txrpB9xd7uQzzRV5_AjrA":{"text":"I'm not that impress with po boy sandwich in general, however, this is still an awesome re","useful":0,"cool":0},"WTL54Bu3a5fnashKR5i8Ag":{"text":"I remember when this was a different little restaurant, 3 or 4 restaurants back. I can sti","useful":0,"cool":0},"D7smRGVwo0YM0jgyf2VZfg":{"text":"I really wanted to like this place more than I did.\n\nI ordered the sampler, which started ","useful":0,"cool":0},"b0POKOGEwKGbMkTi5CAXQQ":{"text":"We set out to eat at the Gumbo Shop on a Tuesday evening before going to Preservation Hall","useful":0,"cool":0},"qFhX7ygayrzmbcrzWH1mrg":{"text":"We split a muffuletta, fries and a beer. Huge lunch for two... and delicious! Try it with ","useful":0,"cool":0},"2UwJzkj4_8nHTcHepKjQsA":{"text":"What a friendly place! When we walked in the owner greeted us and asked our names, she was","useful":0,"cool":0},"E2Y14K2fJSKK3MUQheKYqw":{"text":"Was not impressed with this place at all... First of all we arrived and were told the tabl","useful":0,"cool":0},"Fl6MLjh8oFcAK_4KYpLIQA":{"text":"Raining Orange Beach AL Tuesday (yes something worth visiting) so David and I decided to t","useful":0,"cool":0},"sz2XedNhR1O-0q21guK5LA":{"text":"ARE YOU JOKING WITH THESE PRICES FOR THIS BAR FOOD\n\ni knew this spot was a little touristy","useful":2,"cool":0},"vlumNmy5PBXkiuUyy1juVA":{"text":"Great food, service and atmosphere. Wife and I argued who had the best dish. I got the dr ","useful":0,"cool":0},"LJ6Q6tsQVmNbBIlPAlvA4w":{"text":"Great food and ambience! Bartender Andrew was the BEST!! (He ran down the street to return","useful":0,"cool":0},"-F5fElspCIbaLgcgru3U_g":{"text":"This is our second time visiting NOLA and the second time at 801. The first time we ate lu","useful":0,"cool":0},"hJcC5j9B9Lq7rd_tloorJA":{"text":"After reading yelp reviews I decided to stop in and try these seafood nachos the reviewers","useful":0,"cool":0},"UCjWjhbnK_HHtVS_Wmwxnw":{"text":"Nice that this place was open late on a Sunday night, but expected, I suppose, since it's ","useful":0,"cool":0},"_RlEv2r9SWZjOt2TXFbksA":{"text":"This place was just awesome! First time in New Orleans and it was one of the best spots I ","useful":0,"cool":0},"Ig95hmR6NJ9zxOXmYsz_nQ":{"text":"What a great find a little off the craziness of Bourbon Street. The food and service was e","useful":1,"cool":1},"c6ERJBomGfJ67RN7NE4znQ":{"text":"So so so delicious!  I had a rosemary shrimp po boy and friends had other versions. All we","useful":0,"cool":0},"KduAho6Rg_eXCKnBiXF1vg":{"text":"This place is great. The food is delicious and its right near everything. We had some awes","useful":0,"cool":0},"WIVK8fuFLz6xLEtFTo6Naw":{"text":"Great service, even at 11pm on a weeknight. The seafood nachos were amazing! Definitely or","useful":0,"cool":0},"eFAs5b3ggTYrBtFA5VY9iw":{"text":"I put this post on Facebook, but I want yelp people to see it too! :) \n\n Kelly is awesome!","useful":0,"cool":0},"qgQ8x1lZJkk8opkfp41kWA":{"text":"Good food, good service. The sampler was great and large enough that I could share it with","useful":0,"cool":0},"m1BdcD6G9N9slEftCgqcww":{"text":"Hubby and I stopped in for a snack and drinks.  The bar had a nice atmosphere and the ques","useful":0,"cool":0},"EifsiTc6HaTelzr80-ZS2Q":{"text":"First night out in NOLA and we came here. The roast beef po'boy....amazingly good. Make su","useful":0,"cool":0},"UC9fqFrOgETAQlLNegzbvA":{"text":"In a city of amazing food, 801 Royal holds its own. The seafood nachos were incredible -- ","useful":0,"cool":0},"JOy2LMXQuQqehBj5KLHpMA":{"text":"WARNING!! MY FIANCE AND I BOTH GOT FOOD POISONING FROM THIS PLACE! YESTERDAY! \n\nWe both or","useful":1,"cool":0},"yxeyZCMtg03Zi2VNPn0czA":{"text":"This is one of my favorite places in the French Quarter. Why? The people. The first time y","useful":2,"cool":0},"eRFYxwuUZF1mEOuI8WA4iA":{"text":"Just commenting on the drink as I did not eat any food here.\nThe drinks were good and fair","useful":0,"cool":0},"GQYJoGhd8hOrYAOdqoVSTw":{"text":"The Roast Beef Po Boy!!!! I don't know if it's the best in NOLA, but in the French Quarter","useful":0,"cool":0},"rpU0H4Ef1WPKQx0hJh3Teg":{"text":"How did this place get 4 stars??? The orange juice was canned. The coffee is served in lik","useful":1,"cool":0},"hyEiG3L9sRBL4tkXWgWNRQ":{"text":"You can't go wrong with the food here.  My last visit, I was craving one of their muffalet","useful":0,"cool":0},"OJ82r36tyx7LgDK0xJIVfA":{"text":"It was my first night in New Orleans and went to this place. It brought me so much love fr","useful":0,"cool":0},"RLJGz7br7Z8RY_YDB5GpUw":{"text":"We stopped in here for drinks and a snack. It was fairly empty - weekday post-lunch pre-di","useful":3,"cool":1},"UnfSk0IjbGAktrg4ZVkIVA":{"text":"We came here for brunch after seeing the unlimited mimosas that come with breakfast entree","useful":0,"cool":0},"5JreH56hxD_MeQAx77g31A":{"text":"The fried green tomato with shrimp po boy was delectable, as were the seafood nachos. The ","useful":1,"cool":1},"U3GU9-ss8XU5y03ratsIgg":{"text":"Asked for an amber and was brought a warm beer the color of bud light. When he told the se","useful":0,"cool":0},"n_BAKzD1YmEnAV51SZ4IgA":{"text":"Our party of four tried the tequila shrimp appetizers,  two different poboys, and the red ","useful":0,"cool":0},"Chh0HbYP3CL1_xptKs9oYQ":{"text":"Needed some food after a day of heavy drinking and stopped in on a lark based on favorable","useful":0,"cool":0},"vyHYkPKPSus617epvqQIxA":{"text":"Good service, but worst (and most expensive at $12) bloody mary I had in the Quarter. Etou","useful":0,"cool":0},"tifq0Jao8sgO02-lyXOhKw":{"text":"This is a cozy place to eat. We had a mufaletta, green tomatos, fries and beer. They have ","useful":0,"cool":0},"AaTM6mAuRyTcMacKrPPRpQ":{"text":"There gumbo Is decent however, their sample platter is DANGEROUSLY DELICIOUS! A friend and","useful":0,"cool":0},"t2tbNoJD8rj4yZoKos8oyQ":{"text":"Delicious is just not good enough to say for the food. From the crawfish po boy to the fri","useful":0,"cool":0},"nrsAtLOSDdXnaRH-nOX8fw":{"text":"A great location. Great place to watch some football! Andrew, the bartender was fantastic.","useful":0,"cool":0},"natiwMhfXryRPunttcGi9A":{"text":"This review is for their lunch service! \n\nThis place was our first stop for a sit-down lun","useful":1,"cool":0},"gCYs8bnOHz8cjjL4P6tRkg":{"text":"We stumbled upon this place on a Sunday morning and decided to try it out.  The staff is v","useful":0,"cool":0},"_hCAedWrVAGXCSqufaW06w":{"text":"Everything was too greasy, even for a hungover brunch.  The service was decent, however.  ","useful":1,"cool":1},"ZXd5r5I32vfK40A-T0AJkg":{"text":"Very good fried alligator,Fired oysters basket and chips rocked. Good hurricanes food came","useful":0,"cool":0},"FHPnMNhFcvs4M8X1Oz-A_g":{"text":"Been here every time I am in NOLA. Fried green tomatoes and rosemary shrimp po'boy. Everyt","useful":0,"cool":0},"9D34ei7oYHvIB3OnJXLOIA":{"text":"People they have an authentic Chihuly glass blown chandelier piece hanging over their bar.","useful":2,"cool":1},"1g9WxqFHK3cIpawIr86QTw":{"text":"5 stars!  Excellent new destination in the French Quarter. As first time Nola visitors, we","useful":0,"cool":0},"GxXoXOYnggPwjQxoGK0qAQ":{"text":"The service was phenomenal. Patrick (both of them) took great care of us. And icing on the","useful":0,"cool":0},"cayC8489pfSrosZ5j6wPBQ":{"text":"First evening back in New Orleans, ready for some authentic local cuisine. Unfortunately, ","useful":0,"cool":0},"AJu6Zddj8UtQUCy3RBRBog":{"text":"We just happened onto this restaurant while walking and decided to try it based on other r","useful":0,"cool":0},"LW7OteEoAb1DnqxUBvzFvA":{"text":"This was a great spot for a quick lunch! It is in a great location near many shops and act","useful":0,"cool":0},"lsvEMpC95ZkRxjazOcyBxg":{"text":"Hot damn! This place is absolutely fantastic! Their seafood nachos are to DIE FOR. All the","useful":0,"cool":0},"GPIuWRPQNhJ1FoIL23gqxA":{"text":"WOW SEAFOOD NACHOS!!!!!!!!!!!!!!!!! I swear to everything that is holy on this earth that ","useful":1,"cool":0},"qbFgCQ7SjR1vN9KblRy27Q":{"text":"Seafood nachos are almost too good. But the crawfish etouffee was terrible and the gumbo i","useful":0,"cool":0},"kCldSja7-mT6nX53z6tulw":{"text":"I stopped by this place because of YELP. The bar tender was awesome! Everyone that came in","useful":0,"cool":0},"NioQ_YAYBeNsDP5AvZjv2A":{"text":"We came here our last night in New Orleans to try more gumbo, étouffée, and po boys! The f","useful":0,"cool":0},"rFO5sfQMqWOjpgjtoDmOOg":{"text":"This restaurant made us feel very welcome. It feels like the hometown place even when you ","useful":0,"cool":0},"meQ1qYG8apvTLdxCjF8ftg":{"text":"Great service. Delicious authentic French-creole/ New Orleans grub. Really good bloody Mar","useful":0,"cool":0},"vN3xP57gVIoBpJT8ArR2Pw":{"text":"Nothing really bad here, it was just our least favorite meal of the week in NOLA. Po-boy h","useful":0,"cool":0},"-cXsBCYOGtn4gp2FGbKyCA":{"text":"One of Royal streets best kept secrets. The color atmosphere and vibrant pictures and deco","useful":1,"cool":1},"5z96djqgfAaCEl4_iptRpw":{"text":"Went mid-day and the service was friendly.  Ordered the catfish bites and red beans and ri","useful":0,"cool":0},"hGSOCpW8_v68MGg1_UajrA":{"text":"Missy is unreal. Such amazing service and the food is awesome. With so many options we cam","useful":0,"cool":0},"sBGKNArNCy08nXt4lA8DPw":{"text":"Stopped in on a Tuesday afternoon for a beer and a snack. Sat at the bar. Becca was very f","useful":0,"cool":0},"wFqtNpTNGFjhLaISbnTxwg":{"text":"5 Star. Would definitely recommend this place. Will definitely come back again on my next ","useful":0,"cool":0},"bDDjEgKbxMcpNvZqS-67kw":{"text":"Awesome food! I got the Royal Po Boy with their homemade Potato Salad! It was delicious! L","useful":0,"cool":0},"jBM44GBth18KaM174F0caA":{"text":"Amazing food, amazing bread pudding and amazing service. Next time I'm back in NOLA, I'm d","useful":1,"cool":0},"_tPfnzb6M9A1KwMfgpjHuw":{"text":"Great staff. Great chicken nachos. However it's nacho cheese and not real shredded cheese.","useful":0,"cool":0},"ptMtfsheZMR7rltnnb2I5A":{"text":"Great food. Great service. I eat here all the time when I'm in New Orleans. Try the Roast ","useful":0,"cool":0},"uacLSMXVnKv3bWHzNO79ow":{"text":"Ordered the seafood nachos. The cheese sauce and seafood were very bland tasting. Our serv","useful":0,"cool":0},"9N6FuErYDjV9WA8lHRPXJg":{"text":"Visited because it was close to hotel, I was on a tight time frame, & reviews were good. S","useful":0,"cool":0},"oUFKQ_lTHuxA5OvOUSvlhA":{"text":"You should go here for two things...and thats it\n\nSeafood nachos...AMAZING.  One of the be","useful":2,"cool":2},"2F7suHHFI5dI-U89PfY3jQ":{"text":"Service is good and attentive but the food is unfortunately mediocre. Not awful but not so","useful":0,"cool":0},"T8Isjd3mbCav6BLyGXoRYA":{"text":"Good food!!\nMy 13 year old son has sampled po boys throughout the French Quarter and the F","useful":0,"cool":0},"QsZ949xNQ4ACvCZw6piRRQ":{"text":"Delicious food and great service. We both had po' boys- my husband had a traditional fried","useful":0,"cool":0},"YLvAL6CBCbHouH3D5bapRg":{"text":"This is a wonderful place if you like frighteningly watered down liquor and vomet-inducing","useful":0,"cool":0},"62Qzxc5BcghfqaqX9hUl0w":{"text":"A very nice place, not too big so it can get pretty crowded.\nIn fact, we did have to wait ","useful":0,"cool":0},"6ubVqjk0No3zHGk-8ecZWw":{"text":"Roast beef poboy was very good.  Service was punctual.  Only issue were the flies.  Doors ","useful":0,"cool":0},"EkpoTzsz6GESX23m8ucolw":{"text":"This was our most disappointing meal in New Orleans so far.  We had the muffuletta sandwic","useful":0,"cool":0},"TTb-BSrNRl73QkHSy_bsWw":{"text":"Food was really good! The queso had a fondue taste to it. The shrimp tacos are amazing.","useful":0,"cool":0},"w2lZc4UIZfFp76B1NcuIfA":{"text":"Came in because we heard about the seafood(shrimp/crawfish) nachos. It's was AMAZING! And ","useful":0,"cool":1},"NsZ4rvAYAjuCbQX5T6FfDw":{"text":"So far so good, I was just seated as I'm writing this review. It's been awhile since I've ","useful":0,"cool":0},"axgoTushkwI7gfOolj5Elg":{"text":"Best bartenders I've met so far.  Amazing service.  Had us L.A. girls there for 3 hours!!!","useful":0,"cool":0},"ya0pi3pObw0RGzh9InOHHQ":{"text":"A bit of a different feel for the Quarter...not as rowdy as lots of other bars...but still","useful":0,"cool":0},"hZq48gYoSo8-LdK9X11Ayw":{"text":"Went for breakfast.\nGood news:  (1) there's aircon and (2) the Bloody Marys are decent but","useful":0,"cool":0},"i18W9fTnvZStX1wmXzycuQ":{"text":"Great service, they were very busy and still we were greeted, seated, and served immediate","useful":0,"cool":0},"KN2zd0tjIyWxI_3efvWbSg":{"text":"Visited again. The seafood nachos are still amazing. I think the wait staff may be the sam","useful":0,"cool":0},"AZh-RbBPyMNqXfrqWZ2M1g":{"text":"Great food! Fast service, attentive staff. \nFried oysters and green tomatoes done perfectl","useful":0,"cool":0},"IvOYzHp3xLglEV-63FhW4A":{"text":"Yummy! \n\nMake sure you take a oyster shot! It's delicious! Just like a little baby Bloody ","useful":0,"cool":0},"GkFMsH22p7E1k7c2ZxbxSQ":{"text":"New restaurant in a competitive environment. These guys get four stars for chutzpah. I was","useful":1,"cool":1},"3rBEfsqK1uZyr195d9zSUQ":{"text":"Came here late on a Thursday night, was seated immediately and service was good. I ordered","useful":0,"cool":0},"OVeUPkHmekM06AayNaMzbA":{"text":"The Seafood Nachos are absolutely amazing! A dish to remember and return for. The bartende","useful":0,"cool":0},"SujwcLy6mw0T78VdY-vS2w":{"text":"All I can say about this place is, mmmmmm. The food is soooooo good, & it's so close to bo","useful":1,"cool":0},"3mYqRseMuHOm5oo2QT7w3g":{"text":"Based on reviews, we came here for dinner and were not disappointed. It was a weekday so i","useful":1,"cool":0},"IGoIzYDGBkrgE8Plf2kGBw":{"text":"Best bloody mary EVER! \n\nStopped in for lunch while walking around the FQ. Waiter was supe","useful":0,"cool":0},"dLl-k1dQQ5gD8ubZjMPmww":{"text":"Okay; first time in NOLA. Our server was literally the best. All of the service staff is f","useful":0,"cool":0},"aHAUrPZhMxB1awPdRakDJg":{"text":"I would like to be able to review their food, but after waiting more than 20 minutes and g","useful":0,"cool":0},"lMvlEBPP3qNWABvJGPMq_Q":{"text":"What more could you have wanted?\n\nThe owner Kelly was very personable and went out of her ","useful":0,"cool":0},"a6VXK5n7H9tJ-Wdlp9smOg":{"text":"I was staying at Bourbon Orleans, which was a block over, and I saw that they had pretty g","useful":2,"cool":2},"jm9n2CYTUnPwHmPy90bmyQ":{"text":"The service was great.   I had the seafood nachos and they were soooo good. Everyone else ","useful":0,"cool":0},"KsEZq1xNm6A1oVN-x8gP4w":{"text":"Beer was good.  Food was amazing. The Cajun sampler included gumbo, crawfish etoufee, alli","useful":0,"cool":0},"f05q7T2zYpnQC5MG_wfz9w":{"text":"If you are in New Orleans, you must stop into this restaurant!!  My husband and I were vac","useful":1,"cool":0},"di4W61sVFd74nCpWESlwyA":{"text":"Bottomless mimosas on Sunday morning ... Bananas foster French toast ... Po' boys for brea","useful":0,"cool":0},"fWcTWbs6OESOili5923pvg":{"text":"AMAZING. We are from Cali and my co-worker recommended this spot specifially because the #","useful":0,"cool":0},"FrmSnpAGyGCUWf0FJ2Xd7w":{"text":"During our week long stay in the French quarter this was hands down our favorite spot! The","useful":0,"cool":0},"GbMNJQlkSrzLbuVQEFd0xQ":{"text":"The seafood nachos were so dope. To die for. They make the cheese with a white wine. Life ","useful":0,"cool":0},"mniDv3msRWRQQZOnC_jGkw":{"text":"Started with sausage platter app with remoulade and creole mustard- nice portion for 4 and","useful":0,"cool":0},"_dAE62jk60MnbGpUPJK56Q":{"text":"Best spicy Bloody Mary!  We also enjoyed the delicious seafood nachos and bread pudding.","useful":0,"cool":0},"nKb-IRkXOPjd8Q5LUmlc-Q":{"text":"Yeap 4 stars! \n\nWe were there during the southern decadence craziness. It was an awesome t","useful":0,"cool":1},"6--3fwNheJbRnubl3BEYaA":{"text":"My meal consisted of a lot of food, but then again it was the most expensive thing on the ","useful":0,"cool":0},"CVGi0-veGce2Iva68eUYaA":{"text":"Family outing in French Quarter, found 801 Royal on yelp- amazing- seafood pasta was amazi","useful":0,"cool":0},"3I_WCCN2minBE7BUtYeeAw":{"text":"The best Crawfish Etoufee in the French Quarter. Been here twice today already. I make sur","useful":0,"cool":0},"g_-bYtjBGzt1hSbde0rUXw":{"text":"The seafood nachos, alligator sausage, and the bread pudding were really good but everythi","useful":1,"cool":0},"KblLn3agVate3-R8x2BkqQ":{"text":"Some of the best shrimp and grits ever., they fry the grits!  I don't think I'll be able t","useful":1,"cool":1},"PwtO0GQ-9-qUynWtcLRyTg":{"text":"I wish I could give 3.5 stars. Stopped it for the taco special that caught our eyes as we ","useful":0,"cool":0},"1K5Qx9w5TbBL2dN1kY3www":{"text":"Slowest service ever!!! During a mid day slow time too. Never again.","useful":0,"cool":0},"J_ilOnMVZ32tU6fYJUHnEA":{"text":"Cute little place for a late night snack or dinner.\nFood isn't too bad. \nHusband had the s","useful":0,"cool":0},"_DfwTh4JfZJaY4wfk8Mpcg":{"text":"Loved the gumbo and Royal Po Boy and bread pudding.  Hugh portions, My husband and I split","useful":0,"cool":0},"npKmJvylXZKz96ljJ7MCpw":{"text":"I've been to a lot of places in the quarter, and this was the worst experience. For a city","useful":0,"cool":0},"IMHRGhHGNW5WzYQM5asjBQ":{"text":"Delicious food!! Crawfish étouffée and alligator sausage were amaza-balls! Oh and beer, gr","useful":0,"cool":0},"aaMouguzz-NTkvudUxFAcA":{"text":"I give this a middle of the road rating - It's a bar with food. I had a three dollar oyste","useful":0,"cool":0},"IcMr8BOGnKcRn7LXq_r-qA":{"text":"We went here today, our first day EVER in Nola. We were welcomed and invited to sit right ","useful":0,"cool":0},"6uxebJwuNZfHebwpV5v8iA":{"text":"My friend and I had late drinks here. I got a small house salad and the royal tomatoes and","useful":0,"cool":0},"Hci6UvV9UVMZxQYwMcIS9w":{"text":"Stopped here because they were the only guys open at whatever time we decided drinking tim","useful":0,"cool":0},"B1XA8lpaDd-6m7j12BZjyw":{"text":"Good gumbo, no hot sauce or salt required. We both had uncooked pieces of rice, but other ","useful":0,"cool":0},"jeVaC6XjOvBzA9PLs6S81g":{"text":"Great food! We came one afternoon and got the seafood nachos and shrimp and grits. Both we","useful":0,"cool":0},"sM5VLF9HuRVpvDYCroUBfw":{"text":"Solid food. Nice vibe. Service was excellent - our server Trace was fast and friendly.","useful":0,"cool":0},"vLIkykRHtCX4Jh4xS8n-fA":{"text":"Great!  A tad off the beaten path and worth it! Albeit we were there on a Sunday night so ","useful":0,"cool":0},"nl75Y6tfWOe0E4fkhu1Vow":{"text":"Spent a few nights in New Orleans and went to this place on a recommendation. It didn't di","useful":0,"cool":0},"I5taJaPqoNCeRMsweRj8hQ":{"text":"The mimosas suck and the drinks are expensive. One of the bartenders is an older dude who ","useful":0,"cool":0},"BinlHZ-jZy52KhfAIlBjHw":{"text":"Our first introduction to po-boys! We had one with fried green tomatoes, shrimp and remoul","useful":0,"cool":0},"5iCribkZd0wH9ZP0O4xg0g":{"text":"Stopped in for breakfast. Had the bottomless mimosas and breakfast po'boy. It was deliciou","useful":0,"cool":0},"WkYl2MG5yhUgKSJXdoUViQ":{"text":"801 Family, \nI can't remember the last time, if ever, I went to a restaurant and was treat","useful":0,"cool":0},"_FHIp2T9KsZrdA4NnkxfPA":{"text":"This place was recommended by a tour guide so my friend and I decided to stop by here for ","useful":1,"cool":1},"JEtE9qx9JzkVeKYshw3AlA":{"text":"Such a great place, so happy we found it the first day of our stay so we could come back. ","useful":1,"cool":0},"1rmwYoP6GIGq7dxt92nfAQ":{"text":"Watched the bartender take chips out of our to go order and eat them over our to go contai","useful":0,"cool":0},"d8ACsKTuSR0F91TzSIyOmA":{"text":"4 star average? I don't get it. \n\nWe had the seafood nachos. Everyone here seems to be rav","useful":0,"cool":0},"IwyEx-s8nqmzmPQZfM7Oaw":{"text":"Their food is amazing!!\nI had crawfish critters, red beans and rice, and a po boy before f","useful":0,"cool":0},"JxNodVmWvdADBKw8LQ40jQ":{"text":"Okay...do this .....\n\n1) Bring gauze and bandages.\n\n2) Order their gumbo and their crawfis","useful":0,"cool":0},"UzuLa1B82i4m2I8cM1WyWQ":{"text":"My husband and stopped here for lunch while driving to TX. We ordered the chicken gumbo, c","useful":0,"cool":0},"MdEH3S1iEWXcEPy2kqnF0A":{"text":"I went to this restaurant 5-6 years ago with my sisters when it first opened. I liked it s","useful":0,"cool":0},"lnY-CE6y9WyV-CB_f-K3Gw":{"text":"I like this place.....nice decor..great friendly down to earth staff...nice music and a bi","useful":0,"cool":0},"ZeJVGZRMulqbt57N2fSqQQ":{"text":"1st to get a 5 star with me is impossible, when it happens there will be no denying! A 4 m","useful":0,"cool":0},"zJ__T3RMyDNqKSYdR2qpbA":{"text":"This is a great little place for some awesome food. My husband and I ate here twice during","useful":0,"cool":0},"CNIVdXNiQ2dujuM838t_GQ":{"text":"Had the royal po boy. Very flavorful. Shrimp with fried green tomatoes. A little pricey bu","useful":0,"cool":0},"vIDK4qI3HiNeNu01BWBa5g":{"text":"We were hoping to dine here en route back to the Andrew Jackson right down the street but ","useful":0,"cool":0},"E3Z5cy5Y1mh86hrjOabCpg":{"text":"A local suggested this place, and I am so glad I came here for dinner on my one night thro","useful":0,"cool":0},"T-nK1p9-7ei4PqthAJ8CEg":{"text":"On the last day of our trip we did quite a bit of wandering around aimlessly and we kind o","useful":0,"cool":0},"8zbsGeX9DQKgb_7eBwS6Aw":{"text":"Best gumbo and RBAR in the Quarter.  Very flavorful in an unexpected dive bar atmosphere. ","useful":0,"cool":0},"hUvd-Sr8yY9HditMq0Kpcg":{"text":"Food and drinks were awesome. The bartender, Andrew, made such an impression! He remembere","useful":0,"cool":0},"j2OKDSxcN4ktJYObvDVt_A":{"text":"I hate to start my New Orleans trip reviews off on a sour note, but as the suggestions com","useful":0,"cool":0},"juPlHv0kchmK8ZjL4-q4-A":{"text":"The fried green tomatoes with shrimp appetizer was tasty but the other appetizers we order","useful":0,"cool":0},"4xuOLG_9HbcFk07p79ZKkA":{"text":"We just stopped in for a drink and then took a drink to go. The bartender was awesome and ","useful":0,"cool":0},"xx5VIndBKiMFf2RxJpBhlw":{"text":"As a first timer in New Orleans, I was looking for a great place with strong drinks and go","useful":1,"cool":0},"v9QVB3jBVv4rPRl-YLfmOg":{"text":"Good bar spot to grab a bite. Came in from our flight and straight here as it was right by","useful":0,"cool":0},"v7XG7qgR06T1VQylUpnfwQ":{"text":"Location: 5 stars\nService: 5 stars\nFood: 4 stars\n\nWe went to 801 Royal on a cold January n","useful":0,"cool":0},"5sJE-sUpmEMr_IxL5tQrVQ":{"text":"Food was fine. Service was not good. \nWe walked in in the middle of afternoon. Even though","useful":0,"cool":0},"fXE-dm2NMA-eftQvHdwSFg":{"text":"WOW! My fiance and I came here based off someone's Yelp review, and we can't thank them en","useful":0,"cool":0},"_7vVTKRgWbnJ7dG5okPMmw":{"text":"My name is Dana and I approve this message.  THE SEAFOOD NACHOS!!!!   Thank you for coming","useful":0,"cool":0},"DKMykRA6U33EWSHD_AR8zw":{"text":"23 Jul 2014, 11:00a\n\nHubby and I skipped breakfast so we were quite hungry and looking for","useful":0,"cool":0},"kkoEEaLdruUzZXZYtkvHxQ":{"text":"Made an impromptu stop at this local bar/food joint. The service was impeccable. The owner","useful":0,"cool":0},"8Inq3-YwBlWiWFBHD7_6Ag":{"text":"This was one of our favorite spots in the French quarter. It was a perfect casual lunch at","useful":0,"cool":0},"XUNf6FTQFNmRJLRQuAr98Q":{"text":"Wonderful service from a friendly and helpful staff. Great poboys! Roast beef poboy was de","useful":0,"cool":0},"cdGjjyYfA7FBGYUu3vBpZA":{"text":"We accidentally landed here after walking around the quarter. There's no reason they shoul","useful":0,"cool":0},"qLW7ywlZ8zEIe2qDlQhnBw":{"text":"Very rude employee. Slam the doors and yelling closes towards passengers walk by. I wanted","useful":0,"cool":0},"dcf4h1zuHEN4xcW7N2zNfg":{"text":"Quite literally the most delicious nachos I've ever had.  I've visited New Orleans so freq","useful":0,"cool":0},"WLa4H5Q05XcACUFgqp8dww":{"text":"One of my favorite spots. The drinks and food are by far the best. It's a bar/grill but it","useful":0,"cool":0},"8rCHMkuUFTxGJu8wgsx93w":{"text":"Nice place. On Royal St, so it was a little more reasonable crowd. Food was really good. T","useful":0,"cool":0},"w-T2n4bjhnZ3m_glgecpyw":{"text":"The value for the size of meal is tremendous, AND the mimosas are included!! The four of u","useful":0,"cool":0},"r5hVr0pNo59o3IasDC4suw":{"text":"Met some NOLA friends here for drinks while in town for business/pleasure.  It was a welco","useful":0,"cool":0},"wO7VghWPJ_Llx9Rr_Aigmg":{"text":"My fiancé and I were exploring the French Quarter and wanted to grab a light bite before t","useful":0,"cool":0},"ZJmv43y87O96fb1XBaVgLw":{"text":"HIGHLY RECOMMEND EATING HERE whether you're here for a quick stop or a longer stay. After ","useful":0,"cool":0},"LLlH3gsT1QdbAtqfspyHcQ":{"text":"What a surprise!!! Not bad for a bar. Stopped in for a quick breakfast and everyone had th","useful":0,"cool":0},"wRN22Voc6oK-GI7vFQpbGg":{"text":"We would hoping for some good gumbo and based on the past reviews we thought that 801 Roya","useful":1,"cool":0},"0-b9YvHMMFh7mRjaxWmHTQ":{"text":"Fantastic crawfish étouffée, alligator sausage was excellent as well. I did get a beer tha","useful":0,"cool":0},"izLpJFQ11lD5zpaqR5oP-g":{"text":"Great service. The bartender Jaime was funny and prompt. Stiff drinks! The seafood nachos ","useful":1,"cool":0},"PSoYRCqIInI8Bjg-Y0-aAQ":{"text":"I remember when this location was a simple deli with a few grocery items.. I love how it's","useful":0,"cool":0},"Afb3P3hcR4MzbxBRQfBH1Q":{"text":"We had the sausage sampler and sweet potato fries...fabulous. The Louisiana Lightening is ","useful":0,"cool":0},"lmppZOY7lCIjO3bY9Cxg1w":{"text":"I've never written a bad review before, but this one had to be done. I had a terribly raci","useful":0,"cool":0},"vU8mD4u83gTEX4UUE8vdEA":{"text":"I was not a fan. Our friends came here for lunch a few days before our visit and they high","useful":0,"cool":0},"BoZo50O6odWVMEUQrQ3amw":{"text":"Visited New Orleans a couple weeks ago for two weeks and went to 801 Royal multiple times.","useful":2,"cool":0},"950rkMDQLiNlFxDavP7Hsg":{"text":"I am not much of a sports fan, much less a fan of sports bars. I generally avoid any dinin","useful":1,"cool":1},"sdAAxcHrfs7fcRbSBmpwGQ":{"text":"All I can say is that I love, love, love, love this place.  It was not overly crowded alth","useful":0,"cool":0},"n46xxglhOEwYbsTvvuIinw":{"text":"Best seafood nachos!!  Full of shrimp and crawfish and homemade queso dip!!  Unbelievable!","useful":0,"cool":0},"bD3XUs7ldABem7y6Hd_lYg":{"text":"1/2 Muffaletta  was way more than enough  for two.  Good drinks, awesome bar keep - Aubry.","useful":0,"cool":0},"bzLSsQ0Sbxt_BjlURH7l-A":{"text":"My girlfriend and I were visiting New Orleans and were looking for a place to have dinner ","useful":2,"cool":0},"x_wB9bDLtEz3EK9kgUOXMQ":{"text":"Fun little spot with a great atmosphere playing great music. The servers are very friendly","useful":0,"cool":0},"5dzfEAo4caf4VNnlXYHrmQ":{"text":"Waiter is super helpful and friendly.  The service is great and the seafood étouffée is de","useful":0,"cool":0},"j4WxbRJk3VwD2u5CR5xWiA":{"text":"Amazing seafood nachos! And the Hurricane was way better than Pat O'Brien's pre-mixed vers","useful":0,"cool":0},"guwaItfVd387Zt1QdF_VzQ":{"text":"This was my second trip to 801 Royal. I stopped in briefly last year because I was craving","useful":0,"cool":0},"BhEWWA1vMIuVOJeoUkyKeA":{"text":"This place is mediocre for New Orleans. The po boys were ok, but hard to eat since the bre","useful":0,"cool":0},"Ql8BNDx1KCitFIi6OYIYVg":{"text":"Good ambience, great food. I thoroughly enjoyed the oyster shooter (raw oyster with vodka ","useful":0,"cool":0},"kMZbB4Ja4wLAN8Pgf8wKfg":{"text":"I had the Creole sampler / dinner from this place on my last day in New Orleans. I liked t","useful":0,"cool":0},"fmNmYdJPQrVV26UkQNXOjQ":{"text":"If you are in the area I highly recommend ducking into this small storefront restaurant.  ","useful":4,"cool":5},"1JM93PU_VsGnCCOdekKvNg":{"text":"Stopped in after reading reviews, had high hopes...  Started off good - yummy, spicy Blood","useful":0,"cool":0},"4E82gZHae-WR2C_nM9Kp7w":{"text":"Becka is an awesome bartender, The shrimp and grits are fried perfection. The bottomless m","useful":0,"cool":0},"xPb-PC8Ttse_H9w1c_fxSg":{"text":"Went there every day for a week. Staff make u feel comfortable and like family. The drinks","useful":0,"cool":0},"viIejjlGTbtbCJ08_RJVHQ":{"text":"Amazing place!!! Food and drinks were great!! Came in a group and everyone gave rave revie","useful":0,"cool":0},"ILshEX5I_ZS5w-VNIz1Kgw":{"text":"Fried Shrimp Po Boy = AMAZING!! It was delicious. My husband and I halfed one and at the e","useful":0,"cool":0},"p0p8qE-x2Lasw17MwTOd1A":{"text":"I made my way down to the latest iteration of the building at 801 Royal, which has now bec","useful":5,"cool":1},"blTtCupdM0C7LFdd4_pazQ":{"text":"6 of us had our own private room. Food was good. Service was great. Managers came by sever","useful":0,"cool":0},"Zl-Tyh4wCq-EaaJv46X10Q":{"text":"Came here for a quick bite of French quarter specialty. I got the shrimp nacho and it was ","useful":0,"cool":0},"cUpHL6Ep_zFZfwx80BCvKw":{"text":"This place was recommended by our tour guide Aaron (livery tours - who was also fabulous a","useful":1,"cool":0},"x5x17FlwKGgppy5JCrcE1A":{"text":"Came in here after waking around the quarter all morning. Great decision. Delicious food. ","useful":0,"cool":0},"-b4AN8Kolk1c7hNOeMAFzA":{"text":"Wasn't super impressed. The Shrimp Po'Boys were average and the service was mediocre.","useful":0,"cool":0},"zA0WJjLahSjASYRvm1a4pw":{"text":"On a pris des crevettes grillé en entrée et déjà la on a commencé avec du lourd, on a regr","useful":0,"cool":0},"gTXhvmOQORKWuVRELKTFSQ":{"text":"Came here for dinner in search of some good Po' Boys and was a bit disappointed.  A smalle","useful":0,"cool":1},"pAnaib_u21ev3YM2jhIKZg":{"text":"As a first timer in New Orleans, I was looking for a great place with strong drinks and go","useful":1,"cool":1},"7mTNe5uJCOlnhf1PMTx5uQ":{"text":"Food is so-so. Definitively not great enough for 15 dollars a sandwich. Green tomatoes and","useful":0,"cool":0},"kQOqsDfzCwBq7YGJkpVVkQ":{"text":"Yesterday's meal and drinks were so good, we had to come back for the breakfast. With endl","useful":0,"cool":0},"t__NzTim0mHAw9jF848k3w":{"text":"I did not like my food and the waiter was a little weird. Cool place to come and hangout b","useful":0,"cool":0},"_inb7z2EY-iwFrnIZ9DBTA":{"text":"This is OK sports bar. The service was good, and they have a couple of big TVs, so you can","useful":0,"cool":0},"SP7yHsVCan1RMC02XNTQWQ":{"text":"We loved the seafood nachos and Axel made the best bloody mary  I have ever had. Axel was ","useful":0,"cool":0},"aRdeD4-g86Whg2qFaFdCDg":{"text":"Becca is the best! Made me her special Triple B! Becca's Bluberry Bomb! It's not on the me","useful":0,"cool":0},"EEhTohVDTSQETX441wrrIA":{"text":"I enjoyed the gumbo. Very good. The bowl look small, but. It was very filling!! Hubby had ","useful":0,"cool":0},"SXg06-zudqIfwvE9UVW1aA":{"text":"The two stars are for the food alone which was great. Service on the other hand was disorg","useful":0,"cool":0},"A9Qbk2UEh9c85BOM9stPag":{"text":"There was nothing bad about the visit.   This is a casual neighborhood restaurant, which w","useful":0,"cool":0},"cQV1lgc4VYkHK-s0EGn02g":{"text":"Andrew, one of the bartenders is fantastic! He makes a great Moscow mule! However,  three ","useful":2,"cool":1},"t4TAwzDCdYd7BKyOvsRzQQ":{"text":"Get the seafood nachos!!\nIt was the best plate of nachos I've ever had. \nDon't be put off ","useful":0,"cool":0},"aVlfi5vXoWjGqNAxQmx9zw":{"text":"Amazing seafood nachos and Royal Pooboy sandwich; oh did I mention the potato salad!  We s","useful":0,"cool":0},"TagElB2d7F0Ngmz4IXJ7Sw":{"text":"Pretty cool little bar. Looks like somewhere the locals go to hang out and watch football.","useful":0,"cool":0},"ZdZ9Naw4CQMS7z_mEK1reQ":{"text":"I visited 801 Royal for lunch on my last day in NOLA and ordered an iced tea, the Roast Be","useful":0,"cool":0},"IjwW3v6UXlnQY45Kk7cQLg":{"text":"Definitely go for the seafood nachos. We sat at the bar, great staff. Aubrey at the bar wa","useful":0,"cool":0},"jN69FjT3yAC_A5HtEEaxoA":{"text":"This meal was gross and unappetizing. It was a shame to serve!\n\nNever would you want fresh","useful":0,"cool":0},"yuAfnoRHkZsxrgYfwFQzFw":{"text":"The staff was so nice we had the brunch I had the breakfast po boy and my wife had the shr","useful":0,"cool":0},"8U3wsUDyLW24hWwGwVSlYQ":{"text":"Get the seafood nachos and bread pudding! We stop here at least once, anytime we're in the","useful":0,"cool":0},"oyciw5Pp-fj1GG4hWpb7vg":{"text":"After all of the amazing food we had in New Orleans, I expected more after reading the Yel","useful":0,"cool":0},"839AeQKQZeezz0aEW0ZEyg":{"text":"Two stars plus on our two lunch items, Rosemary and Parmesan dressed Po Boy and Fried Shri","useful":4,"cool":0},"4Te68ICrNP0NnjLDEfZCBw":{"text":"Our go to spot every time we are in New Orleans, usually a few days in a row. The food and","useful":0,"cool":0},"8ZaYrVwnOAgmUEitPOaJSg":{"text":"We stopped by for lunch and orders the seafood nachos. Yummy!! Our server Josie was the be","useful":1,"cool":0},"axuAQogkI7JxmaJV4FmAvQ":{"text":"My group was lured in off of the street with the sign for bottomless mimosas and were plea","useful":0,"cool":0},"P5EAAL_JAOzPanJysQf-pw":{"text":"If you don't get the seafood nachos, you're missing out on the greatest nachos EVER. SO GO","useful":0,"cool":0},"D0idiATZIOYMUyFa32hMZA":{"text":"This little gem was a great surprise! Just passed by and stopped in to find this awesome p","useful":0,"cool":0},"AgngfMJpq_sNGIqPvDhMOw":{"text":"My coworker and I are in town for a conference and this place had great Yelp reviews - so ","useful":0,"cool":0},"xMLaqQ1WVi3es_AgMfm7tA":{"text":"Ambiance is fairly normal, very clean but plain. Food was terrific! I had the chicken and ","useful":0,"cool":0},"CcZ1yXrBFMg4KCTBmazaQQ":{"text":"Gritty little corner spot... Good gumbo and Canebrake beer\nFolks seem fun... Happy place t","useful":0,"cool":0},"EXDuloEX3FkDyiMB3xiMqw":{"text":"Met a bunch of friends here for lunch. My wife and I have the shrimp po boys w/sweet potat","useful":0,"cool":0},"IHd7mmmNv5uLJ0LI7c1fJA":{"text":"I think our hotel recommended this place because it was paid to do so. While our server wa","useful":0,"cool":0},"ok5MwJ9exPWOXamMhpomzw":{"text":"My wife and I went to New Orleans for Memorial Day WE  which also happened to be my birthd","useful":0,"cool":1},"QZ-sHIPYseZeHbp9j-LxRw":{"text":"Great service, Bloody Mary's and ponies!   Nachos with quest- OMG! Subtle seafood flavor i","useful":0,"cool":0},"CQZ4iRQ_yUD3xnjb9UXvJQ":{"text":"The food here was so good, I can't believe they've only been open for 3 days! we ordered t","useful":0,"cool":0},"4EALJDHEJuoIiVBJKNkH1A":{"text":"YES... The food was really good and they were prompt with our order. A \"must visit\" place ","useful":0,"cool":0},"6VRbXx9F-j-WeUd8DsxodA":{"text":"Took a chance on this place for dinner walking around the quarter one night. Crawfish frit","useful":0,"cool":0},"Cu9Y4f29liMHc7_o7a4qlg":{"text":"Service excellent and so was the food. We had the fried green tomatoes and sausage appetiz","useful":0,"cool":0},"YWpOjq2TFq2uLYAJDe4FsQ":{"text":"The atmosphere here was amazing and the staff was super friendly.  The food was also cooke","useful":0,"cool":0},"oP0fWkGcpY4pOBKAFgO7qg":{"text":"Went here several times over our stay in the French quarter. It was near our hotel and the","useful":0,"cool":0},"ispD5e5lFAK5b0j8f2SRhA":{"text":"We ran into here when the skies opened on us in the french quarter. Even though this place","useful":0,"cool":0},"iQBZmggiJQg-ulwJQlrgUQ":{"text":"On our most recent trip to New Orleans, my wife and I discovered how much we love crawfish","useful":0,"cool":0},"ao5WCzY6aTQg5Mv7J4EXSw":{"text":"There's a lot of food to choose from when you're in the French Quarter and there's no wors","useful":2,"cool":0},"iUinvk_RyAovGKx9dW8yzA":{"text":"With a group of 12 we had a very sub par experience. Our waitress was attentive but not ni","useful":0,"cool":0},"uKMRoc3GuzamDc-TUBV8jw":{"text":"The is THE place to grab a zesty zingy Bloody Mary and a serving of fries with debris grav","useful":0,"cool":0},"gHNrTIapssiG4SChF0E2Vg":{"text":"Great service, great meal!  This was our first stop in New Orleans.  The red beans and ric","useful":0,"cool":0},"fzIM0lEDFMiNbqnYre4htQ":{"text":"Sooooooooo sloooooooooow! And bland. No idea where the 4 stars comes from.  I am not a per","useful":0,"cool":0},"h85gnU8lLe-cnoQaIWhnxQ":{"text":"Bar atmosphere with the standard cliché Bourbon Street sugary drinks. Muffuletta was okay,","useful":0,"cool":0},"2eT9OAZ0Yc69-cGEwTmLSA":{"text":"Seafood nachos are bangin. Service is always great. Very low key and chill atmosphere. Lov","useful":0,"cool":0},"JE-_I3BxZbXZWZYbJE7Lfw":{"text":"Better than most casual restaurants in the french quarter.  The bartender, ARod, is an awa","useful":2,"cool":0},"qfbA8N71ASVE8zSSsW7Ckg":{"text":"The service was good and the food came out quick.  We started with the chips and salsa and","useful":0,"cool":0},"hT5GlYsZ383CPd_fvg56WA":{"text":"Wonderful remodel for this restaurant at the corner of Royal and St. Ann. Friendly, attent","useful":0,"cool":0},"LRXr_LJJhtseV1iy7GpS_Q":{"text":"We absolutely loved this place the first night we went in so we went back our second night","useful":0,"cool":0},"iLi4COhEtD1h6xzdw9jA4w":{"text":"1st official meal in NOLA. And i wasnt disappointed at all the bread pudding was theeeee b","useful":0,"cool":0},"LvHWgaVqY-oKJYUFPoldXA":{"text":"Went in for a shrimp poor boy....got a shrimp poor boy. Shrimp was crunchy and the bread w","useful":0,"cool":0},"7FTeGU5ImuFz232mkjmaIg":{"text":"Although busy with a game in the background, it was a neat little place to have a drink an","useful":0,"cool":0},"A6elqcBUVAGGB0fKXrqTPw":{"text":"Fantastic lunch. Seafood nachos were even better than the gator sausage. Quick and tasty, ","useful":0,"cool":0},"GQuK6tJ1ULhq2B7ewjfEwA":{"text":"Hands down the best Po Boy I had while I was in town. Very relaxing bar with cheap drinks ","useful":0,"cool":0},"u0UUgOb1fVQ7WcnGOLy4Ag":{"text":"We just had drinks but they were good plus Axel the bartender was super friendly !!!","useful":0,"cool":0},"PR522Ts5bMQvGA62fJxopw":{"text":"The catfish was awesome and the beans and rice was really good we had a really nice server","useful":0,"cool":0},"cnqq0TzyY-Gyg_9XZyvoGQ":{"text":"The seafood nachos are AWESOME. Plus they have a really great service discount for people ","useful":0,"cool":0},"Lyjrj0s9uOjE9HCG9OYQ9w":{"text":"We came here the first night of our New Orleans trip and unfortunately were pretty dissapo","useful":0,"cool":0},"b3tem_D2TE1CgmPBpP1zSA":{"text":"The gumbo was a bit underwhelming. The flavor didn't quite pop out, perhaps due to a lack ","useful":0,"cool":0},"_HcUd2-Jd5bv7QacONnDVQ":{"text":"Roast beef po.boy was awesome. Drex was a great server who was incredible with my kids","useful":0,"cool":0},"G4zlknrU5LmiVcmXsdvaJw":{"text":"Came here on our last night in New Orleans because of the high reviews on Yelp. I'm not su","useful":0,"cool":0},"Kkx7p_q40NA6DfxwuN_wEw":{"text":"Food was delicious.  Enjoyed the seafood nachos and the seafood sample.  Our waiter was te","useful":0,"cool":0},"wmWFiuobgGv5Qx7kjxJh2Q":{"text":"It's in the French quarter which is cool but is the perfect tourist trap. Anything associa","useful":0,"cool":0},"L6EgdWKHrnhJ3gZ3Ic-e5g":{"text":"We came here for dinner our first night in New Orleans and had crawfish étouffée and chick","useful":0,"cool":0},"kgKSgA4wB-toR5iMMgiTxA":{"text":"Excellent etouffee, gumbo, fried green tomatoes, shrimp, red beans and rice, and gator sau","useful":0,"cool":0},"0fNaSyQJwwjVE63vVLVXNQ":{"text":"Stopped in to 801 Royal for some drinks and a snack. The drinks were strong and they had a","useful":0,"cool":0},"DMzv3UE_LxMx24KXgAZt_A":{"text":"Went here our first evening in NOLA and it really put a damper on our weekend. The gumbo w","useful":1,"cool":0},"8jv1uMLpwXBAdo_33UbWZQ":{"text":"The best bread pudding and bloody mary I've ever had, granted I don't eat bread pudding or","useful":0,"cool":0},"RObLzOgKB6aPezD7nrHuUA":{"text":"Two words...SEAFOOD NACHOS. This appetizer blew my mind!  Plenty of shrimp and crawfish pa","useful":0,"cool":0},"JJ5fDQ_Sh-N-yj8AybpATA":{"text":"Just incredible. Good service. Wonderful food. Friendly workers. It was a bit too crowded ","useful":0,"cool":0},"p4I9af9AjoKP601ZNTNFaw":{"text":"Best customer service I have had in the French Quarter at a restaurant!\nI'm a local! This ","useful":0,"cool":0},"ejDndnYugo12at6T22SDXg":{"text":"We decided to come here for a few apps and meal. It was right by the place we were staying","useful":0,"cool":0},"myE_Y2aShWIoYQKGFkyLLg":{"text":"Local diners here.  Live in the Quarter. Great food, great servers.  Love the muffuletta! ","useful":0,"cool":0},"3UyEPeahkRJSvRqEiVY1Qw":{"text":"Been here more than any other spot in NOLA bc we can't get enough! You have to stop by 801","useful":0,"cool":0},"DSOc4pWZoOMys3mXrOwsqw":{"text":"I was in a crappy tired mood and had zero expectations for this place.  They revived me wi","useful":0,"cool":0},"a83-PQ_GMO-5KA_1ZBc0uw":{"text":"We stopped at the bar area for lunch and had the bbq shrimp. \n\nThe texture of shrimp and t","useful":0,"cool":0},"teMcBoCwD540Z6jAoYq3cw":{"text":"I moved to Louisiana 8 years ago for college (how am I possibly old enough to even write t","useful":4,"cool":2},"g1M0xkjr3I_qu_uK8GpdUg":{"text":"Amazing food and GREAT service. It's the \"local\" place to go and you have to try the seafo","useful":0,"cool":0},"tDVf6MWK7f6p6vt0wVUmZw":{"text":"Poor service , ordered roast beef po-boy very dry and then charged $2.00 for gravy.  Avoid","useful":0,"cool":0},"IPKTR0piaqPK9E1-ohgCTg":{"text":"Absolutely wonderful. I had the shrimp and grits.  They deep fry the grits and cover then ","useful":0,"cool":0},"0L0t5h3bTl3mlPCZIcNhBQ":{"text":"SERVICE: 5/5\nFOOD: 4/5\n\nAll I have to say is order the banana bread pudding. Trust me. It'","useful":0,"cool":0},"xprcy7yKvt9J_84P3R2ohA":{"text":"I always wind up here for a night cap and the superb bread pudding for desert to soak up t","useful":2,"cool":1},"CB3zku30OldDB_q8rLJpgA":{"text":"Blackened chicken past was the best pasta I've ever had. The Alfredo sauce was perfect! I ","useful":0,"cool":0},"PnjWf-4Ou3d5fiXhNTDSCg":{"text":"This is my first trip to New Orleans. It's Memorial Day and so our first two stops were cl","useful":0,"cool":0},"gWEpxT6knUVWh4kjpq16Gw":{"text":"Great place with great ambiance and food! Had a couple of different po boys and they were ","useful":0,"cool":0},"FduPvrBG5YgF1TaqjAz-wA":{"text":"Very friendly staff. I love the ambiance of this restaurant. My boyfriend and I like sitti","useful":0,"cool":0},"EQk-uIN66PL0miM-iG-hQg":{"text":"I was disappointed! As I saw the variety on the menu, I was excited that they had some of ","useful":0,"cool":0},"Y6ndQa2t2rXsx3o1ckSLhg":{"text":"All and all it was an amazing experience.  The food was fresh and hot.  I rarely ever eat ","useful":0,"cool":0},"1i8y9fjpFJ3qeKY8GftyGw":{"text":"Service is good and attentive but the food is unfortunately mediocre. Not awful but not so","useful":0,"cool":0},"QxWfOKL-nixKFs2sr_fdRw":{"text":"Great taste of NOLA. Nice staff and quick service.\nWe had the sausage sampler (we loved th","useful":0,"cool":0},"3skTx0bw-mR_x6rqwfwISw":{"text":"This is a bar that serves great cajun food.  Unlike some other bars in the French Quater 8","useful":0,"cool":0},"o9ADtDD9rPgUBQdKOWzYYw":{"text":"I really enjoyed my first time visit to 801 Royal. I always get a Roast Beef Po-Boy when i","useful":0,"cool":0},"Tbo46ilDiJPtM3IgboMIpA":{"text":"Well- I hate to ever give a poor rating but unfortunately I must. First- the good: the atm","useful":0,"cool":0},"pgaEas-6jNBgitXq5rBTIQ":{"text":"Great service and excellent food. Came for brunch and had the breakfast sandwiches, eggs c","useful":0,"cool":0},"4a6MoJomRGpOziVJz8ActA":{"text":"Great dinner! The nachos were a great appetizer and the meal that followed was fantastic! ","useful":0,"cool":0},"LSIWOicPueeIS4Ht5MQ0KQ":{"text":"I was so disappointed with the quality of food..... the red beans and rice were so salty t","useful":0,"cool":0},"CMMc6ATCgjtYjW3m3TN36A":{"text":"We stopped here for a quick lunch and drinks. We started with the Catfish Bites and they w","useful":0,"cool":0},"vOVo58uAjbIN3p2D8x_dag":{"text":"My fiance and I like to visit 801 Royal on Saturdays for their bottomless mimosa brunch sp","useful":1,"cool":0},"nkL2WM-z9Tx9cSGsYP2wyQ":{"text":"First time to New Orleans and this place stood out! Andrew the bartender made us feel welc","useful":0,"cool":0},"ZZvWbfQ37KmLAlJcdPvFFw":{"text":"Every time we come to Nola we some how and up here. The service is always great. I always ","useful":0,"cool":0},"zs0YzzPVkwUgW2LAVCKKUQ":{"text":"Great service and food recommendations from our waitress. Bar staff seems very friendly.","useful":0,"cool":0},"SpaNMX-AlGLTP9-1_lGyhw":{"text":"Get the Cajun sampler platter. This was the best restaurant we ate at during our visit. I ","useful":0,"cool":0},"NM0hn9wdzjQQXroshXY9IA":{"text":"Came here alone and sat at the bar. The bartender, Aubrey, was an absolute delight. He saw","useful":1,"cool":0},"NoIPd56Q3FqYkZILM5ITvQ":{"text":"We only had a few drinks here but they do serve food.  The staff is above and beyond frien","useful":0,"cool":0},"muw-n7w6XRTU1ZyaIdck3w":{"text":"Best seafood nachos I've had! Helpful staff and friendly atmosphere! Will come again if he","useful":0,"cool":0},"cY0CHOU4m0htE4YO5M0Ykg":{"text":"The food here was not only amazing, but the service was amazing as well! \n\nWe were visitin","useful":1,"cool":1},"WqWcqCcH8A48jLGuXusScw":{"text":"This is a must-visit place in New Orleans. The food is amazing, service OUTSTANDING, and t","useful":0,"cool":0},"5tCugysQfE6DkkAjygZ3zQ":{"text":"We have the shrimps poo'boys, gumbo and fried green tomatoes topped with shrimps, also the","useful":0,"cool":0},"3Kh1bh0R9zm9shwE-Lb9tA":{"text":"Their crawfish étouffée is delicious. However I do agree the prices are quite steep. They ","useful":0,"cool":0},"INl9rzLhsi7FeIyVmBOgbg":{"text":"First time trying a Moscow Mule and Aubrey does them best!!!  We visited this little spot ","useful":0,"cool":0},"KU0wnfepzUVta7flb10MBQ":{"text":"Very happy about my dinner here. Me and husband were not super hungry that time, so we ord","useful":0,"cool":0},"ePPdJ1x4WTxkaN6SKVarug":{"text":"The Bloody Mary's are good. The oysters they use do not seem to be freshly shucked (tasted","useful":0,"cool":0},"xYgrFe0IATpohtg687_KmQ":{"text":"Les nachos à la seafood sont un délice :-)\nAmbiance animée et service sympathique.\nAttente","useful":0,"cool":0},"MkjhXZGGBTNpwIwkM31TUg":{"text":"After a long day driving And practically starving ourselves it was completely worth the wa","useful":0,"cool":0},"aJWO29eE9d12q1bsKwHydQ":{"text":"We stumbled upon this place while shopping.  The place where everyone knows ur name! BEST ","useful":0,"cool":0},"IZLgcwHSrkBOjC6RQXh17w":{"text":"We seem to always visit this classic NOLA restaurant when we visit the \nQuarter during Jaz","useful":0,"cool":0},"5tya1bo7IVOIGm8i8sxeDw":{"text":"I'm definitely a fan of this place. The staff and owner are super friendly and make you fe","useful":1,"cool":0},"qoM2m_urBEC6aj_6xfQclQ":{"text":"Went here on a wednesday evening, I just couldn't believe how unfriendly the staff was!! W","useful":0,"cool":0},"rjCIKw9uBPA69bR-o68Sqg":{"text":"We visited this place twice on our trip to New Orleans.  The shrimp nachos are amazing and","useful":0,"cool":0},"7n2I0Tg-psEN_dDVj8FdLw":{"text":"Please come here and ask for Andrew. We stopped in for drinks and were received with an ov","useful":0,"cool":0},"zX-imcdtdjrIwSEjiCNFRw":{"text":"We were walking through FQ and were starving, so we wandered into 801 Royal on a whim. Our","useful":2,"cool":0},"6Hg1SXYh3b8ai5R7Gwpt6Q":{"text":"Their yelp says dog friendly so I brought in my support dog and they wouldn't allow me in.","useful":1,"cool":0},"DUMcylvtICbQvQ9UuhEfag":{"text":"Waiter Drex (??) demonstrated the poorest service. The moment we walk in, nobody greets us","useful":0,"cool":0},"5KOkpOOVy9WgW9RjbEQ00g":{"text":"Had Caleb as a server, he was awesome! We tried the gumbo! YUM The shrimp pasta, great and","useful":0,"cool":0},"8OUBCJk9XITRu7Qw52fBzg":{"text":"This place was great for some of the dishes that you would not expect to be good in NOLA, ","useful":1,"cool":0},"FSxcsT31Se9QDn-IN6Go1g":{"text":"Fried green tomatoes were delicious. Oyster po'boy was delicious. Roast beef po boy was ev","useful":1,"cool":0},"YeDtt5SeuWi3HpR-pmO_kg":{"text":"Bottomless mimosas + bananas foster french toast = brunch-perfection incarnate. This place","useful":1,"cool":1},"34APepADP-AMMlpjC_bCZw":{"text":"Visted NOLA for the 2nd time from California. During this trip, my friends and I came to 8","useful":0,"cool":0},"5_j5sdJBfgcT5zQzkJtviA":{"text":"solid etouffee, red beans and rice and fried green tomatoes.   no pretension, decent price","useful":0,"cool":0},"-RPCniQDy0lcSglT6hYPLQ":{"text":"I can't really say that I've experienced better, because I have never had seafood nachos b","useful":0,"cool":0},"oCH_5Lg5BloBDOlL0j1ApA":{"text":"This place was awful start to finish. We put our names down and they completely forgot abo","useful":0,"cool":0},"yR5UJvR8zQRkvb5hEDp83Q":{"text":"We decided to grab a quick lunch at 801 Royal without much of a thought  and were pleasant","useful":3,"cool":3},"rcy3W56HGK2XJNC7KUIPwA":{"text":"Food is tasty and ok (traditional po' boy).  Patrick my server made the experience excepti","useful":0,"cool":0},"eEBLa53or9HLp_ionfCLHg":{"text":"Went here three times on my last trip to New Orleans.  Amazing po' boys and fantastic gumb","useful":0,"cool":0},"4K6dacID6vNHcrBsuk155Q":{"text":"We had lunch here on a Friday.   The fried green tomatoes were perfectly seasoned topped w","useful":0,"cool":0},"kw9MpOcDmtAl92BbO0DL_w":{"text":"We walked into 801 Royal because it was a breath of fresh air away from Bourbon St.  We we","useful":1,"cool":0},"Kq1IBgDhjy-wiE67CNDjCw":{"text":"First, the service here is top notch!  Everyone is a team and takes care of you.  Second, ","useful":0,"cool":0},"0Dv5HYHhb8LxO_32PVJHYA":{"text":"Our first meal in NOLA and the service was ok along with the food. Be ware, the seafood na","useful":1,"cool":0},"CPj-5fdX8tE9pXRw9X5Uhw":{"text":"Great food, great atmosphere, and great proprietors--Mary and Kelley are terrific!  My 17 ","useful":0,"cool":0},"wFiIwiZV9aD7mS8Hl3RADQ":{"text":"Amazing cocktails! Try the Rosie bulldog. Andrew won best bartender in the city and it's f","useful":0,"cool":0},"EwCBZPEG6vPrcww0JHu0iA":{"text":"Just the kind of place I was looking for in New Orleans! Friendly, well priced, exciting a","useful":1,"cool":0},"daDTZLJbv_W0ocl0IViJ6g":{"text":"Very good seafood nachos. Everything else was just ok. Place is a little overrated. Great ","useful":0,"cool":0},"bAJqmPLdW2oVNpwYCCRnDQ":{"text":"Love it...Outstanding service by Jamie!!  Jamie, your cute accent, the shooters, and incre","useful":0,"cool":0},"WV4Xb5EFpJbxstNYDcA5AA":{"text":"Another local recommendation that did not disappoint!! Had crawfish nachos and royal tomat","useful":0,"cool":0},"OLyR8k1gZUs-UfU82gpXjw":{"text":"This place was ok. The waitress was good the food ok! Had the PO Boy here. Would I go back","useful":1,"cool":0},"STWCehhyGNQf5VCQgbNEUQ":{"text":"The seafood nachos is amazing, creamy and heaven, make sure you don't miss it out. The dri","useful":0,"cool":0},"4pzv9dNIyuqXGS6jWwWALg":{"text":"Complimentary mimosas with breakfast/entrees from 9-12 this the 4 stars. I had the big roy","useful":0,"cool":0},"jhhH0gjngp1h_3rbyo03pg":{"text":"It is amazing place. Nachos with shrimp and cheeses omg. Delicious. My best place in Nola","useful":0,"cool":0},"1Ixg_pT-fswJeM6bWimeFQ":{"text":"Great location. Great atmosphere and service. The fried green tomatoes were delicious.  I ","useful":0,"cool":0},"i3w9Hr9_Hvpnyly2hNF1ww":{"text":"801 Royal is a good escape from the hectic pubs of Bourbon St. The clientele is much tamer","useful":0,"cool":0},"tBMxGFeomB7cbrFLg9jVoA":{"text":"Fantastic food, service and atmosphere!  I ordered the half a muffuletta with fries.  Huge","useful":0,"cool":0},"PUXfdrcgeR6W_04FJ9xinA":{"text":"Stopped by here a few time on our Nola trip. Loved the 801 lemon-aid drink, great for walk","useful":0,"cool":0},"lpbhWaQRzUApfpYUVTw-jg":{"text":"Really good Cajun food in a corner bar. Came here last year after Mardi Gras and loved the","useful":0,"cool":0},"Qk__Uus-6LVcJWw3FuYF5Q":{"text":"This is a fun place to stop for a drink in the French Quarter. I can only comment on the d","useful":0,"cool":0},"1Fzm-qRIDhKVRJ43Xg_pHA":{"text":"Great ambiance and chill hang out. The food was great. I had the French Fry Po' boy and my","useful":0,"cool":1},"FMiZMgpM0JfIfTzBMczPKA":{"text":"Great little place! Dropped in for lunch on a Tuesday because we could barely squeeze in d","useful":0,"cool":0},"OZ7w2hoC4koahmK_CEnunw":{"text":"We loved it! Large portions, helpful wait staff. Really clean and friendly atmosphere. We ","useful":0,"cool":0},"QNV-hjrqOiITffen32JDPA":{"text":"Let's talk about the bread pudding.  I generally never eat dessert.  I got this with the  ","useful":0,"cool":0},"Qv5yFyi4M4jjGAxqLGTleg":{"text":"Italian ice coffee, Fried green tomatoes, potato salad. Excellent food, good service. Char","useful":0,"cool":0},"IfGOaOBdqtIS3a4HnFmbog":{"text":"I wanted to try Cajun food in New Orleans and I came across 801 Royal. I ordered chicken g","useful":1,"cool":1},"cEEA0EDPzuwnxy3l98zICQ":{"text":"Quick and easy to get to from our Hotel.  Great people watching view of Royale.  The food ","useful":0,"cool":0},"MV_VKzKhga-1LxY5_RnBig":{"text":"I have NO idea how this place got such good reviews...maybe we came on an off night.\n\nThe ","useful":2,"cool":0},"2XjliO4skPOQka-aI8fTNg":{"text":"Axel the waiter was great!  We had breakfast, that included bottomless mimosas! \n\nLimited ","useful":2,"cool":1},"P6QOHPOwmPnMBh_MKHoNoQ":{"text":"Excellent friendly service, and cloth napkins!  Fried oyster po boy was tasty, bread was f","useful":0,"cool":0},"6tkL454yRI3BJGNXF_cBIQ":{"text":"Great service, very friendly. The seafood nachos were delicious! And not bad prices either","useful":0,"cool":0},"g5RjVaqeGT5GbC4LFFcmPA":{"text":"After a recent trip to Nola, my friends and I were really looking for some authentic NOLA ","useful":1,"cool":2},"07ESZ4StyF8JCd6DZ7i48A":{"text":"The food was yummy and the drinks were strong but the atmosphere was just not our scene. I","useful":1,"cool":1},"M3gnxPfKAmiqmH-9-D07Zw":{"text":"Just what we were looking for. Great food, good beer, middle-of-the-road price. Let me tel","useful":0,"cool":0},"7oWgHYEVsvtEVyiDNwD4vA":{"text":"Endless (complementary) mimosas with breakfast/brunch entree. Meals run from about $10-$15","useful":0,"cool":0},"6LPRjkeKsJYr3T5TsNjo3A":{"text":"We stay down the street from 801 multiple times a year, so it's a favorite stop-in. Love t","useful":0,"cool":0},"0dC04LHpKlZP8vhA6_QFRg":{"text":"Crawfish Fritters, awesome. \n\nÉtouffée, awesome. \n\nWaiter named Axel, awesome. \n\n801 Marga","useful":1,"cool":0},"_j0vZFUB6bwvraefE8jjLw":{"text":"We have been to this location as it changed from a grocery to a neat little eatery. Sample","useful":2,"cool":1},"HqYi3jXLlJmVSwHweJ8weQ":{"text":"I had been here the last time I was in town, and maybe I had had a few more drinks that ti","useful":1,"cool":0},"TmD1nwqMsiNym7bNc1tSZg":{"text":"Absolutely delightful and attentive staff! Friends from NYC wanted to eat alligator and ha","useful":0,"cool":0},"zBMk_xQScjlFJD86vT5r-g":{"text":"OUR SERVER WAS BOMB! We arrived right before brunch was ending, and he still accommodated ","useful":0,"cool":0},"DG-rtjwdmeEZsBhfGkXkNA":{"text":"I barely made it on a Monday night as they close the kitchen at Midnight.  Some places wou","useful":0,"cool":0},"QIri_YJAmL6TIAIzLJrmNA":{"text":"Bar tenders are very rude but drink prices are decent I guess, you can find better if\nYou ","useful":0,"cool":0},"W-qapIjVfH2LLXiF0v_ajQ":{"text":"In a city like New Orleans, you expect to find exceptional service and remarkable food & b","useful":4,"cool":2},"29Jmx7n_DSezJfPFtUv_UQ":{"text":"If I go back to NOLA it will be for 801 Royal and their unbelievable Bread Pudding. That d","useful":0,"cool":0},"78O3mAis_Wz2xpj2Zys89g":{"text":"Ordered two poboys. Alligator on andouille sausage and fried crayfish. We liked the andoui","useful":0,"cool":0},"qBQkT22zkNq6oADz9h8gQw":{"text":"Seafood nachos on fleek! When one is inebriated with their girlfriend these nachos will ge","useful":1,"cool":2},"Dz15qDEyE7JJNTCv5Ksbmw":{"text":"Out of all the drinks I've had in NOLA and I've had a LOT 801 royal is the best!!!!! The s","useful":0,"cool":0},"z3NNoALW5aAksDSUbgvuag":{"text":"THIS IS THE BEST BRUNCH DEAL YOU WILL EVER FIND! Purchase of a breakfast entree INCLUDES B","useful":1,"cool":0},"MhZG9gCQPm5OYc5JlckwDw":{"text":"This place had the BEST seafood nachos I have ever had in my entire life ! Lawd they were ","useful":1,"cool":1},"i-wn6cvbtcdFej8hWsK91Q":{"text":"Wonderful breakfast and Bloody Mary / mimosa!! Bfast stopped seating at noon, adults mainl","useful":1,"cool":1},"MK1gftD8__1ZBZH8Z1YTIQ":{"text":"Friendly staff is about the only thing this place has going for it. \n\nMe and wife stopped ","useful":0,"cool":0},"8x96e1EyZlTADitp7TwaTg":{"text":"When you meet the owners of 801 you instantly fall in love, two of the nicest ladies you c","useful":2,"cool":1},"Nk4tfDMFHtoZjTMcHm2XKw":{"text":"Amazing roast beef po boy, phenomenal bartenders and great neighborhood chill spot! See Au","useful":0,"cool":0},"KuFsMDG3UXxKO8EiRp7ghA":{"text":"Stopped by this place on a Saturday night when out for a walk. They had a dj set up blasti","useful":0,"cool":0},"Kh0VbeynbuJigzmy4rgMww":{"text":"Royal House was recommended, and it did not disappoint! My sister, her roommate and I love","useful":0,"cool":0},"FRYLSHea39IOIzO4PcNEIw":{"text":"Not our first time.  Or our second.  Bottomless mimosa's were good but the service staff d","useful":0,"cool":0},"gSjrUaqSzD1NkJy6k4_9wg":{"text":"The service was horrible. My iced tea tasted like swamp water. It took an hour for them to","useful":0,"cool":0},"xKplxS_U1CZS8recOgtwBA":{"text":"Overpriced Drinks\nOverpriced food\nBad service (Although I have to say, servers out in NO a","useful":0,"cool":0},"irFgO1Zbwjy5VbW0Qs40hg":{"text":"Would come back again and again! Came after being turned away at several other places for ","useful":0,"cool":0},"LwsK6zkG2N9IIDRFNTpZdA":{"text":"Fun and friendly little place to eat, drink and hang out. Po boys are fantastic, drinks ar","useful":0,"cool":0},"4w2_7dXPqWooWnyjEomwPg":{"text":"Some of the best Poboys and drinks i have ever tasted! The staff were super friendly. I ca","useful":1,"cool":1},"YgjXNSW2le5IsPyYcnoKzw":{"text":"Good muffaletta, it was huge and perfect for being full. I was so hungry. Moreover the pot","useful":0,"cool":0},"suJe5_qCL8GgFvPWR4gHdw":{"text":"Came in because we heard about the seafood(shrimp/crawfish) nachos. It's was AMAZING! And ","useful":2,"cool":1},"Dh6lzWIevsh-4pWktk_kIA":{"text":"They stuck us in the back room, away from the main room and exit where their office was. M","useful":0,"cool":0},"ATOZjoOCu44VJ_bzQN8Q8g":{"text":"Love this place! Saturday morning brunch with bottomless complimentary mimosas cannot be b","useful":1,"cool":1},"4d6ttqCXpZHj8H7DgfbnDA":{"text":"IDK if it was thst I was so darn hungry but the shrimp basket was great! The red beans & r","useful":1,"cool":1},"4Ukdrzuui4oPMwnfHBzYpA":{"text":"Ok, This place is kinda new; about 8 weeks as I write this review. I'm really enjoying 801","useful":5,"cool":3},"TwemYTpqEmtQZtGQIwCa4Q":{"text":"This place saved us. We were walking around the French quarter and none of the bars will l","useful":0,"cool":0},"F9_LmzVp-1Vf0eVwdNgLpQ":{"text":"The manager (the owner's sister)gave us a complimentary round of drinks because they neede","useful":1,"cool":1},"8P4OzDn7cIh750RrwBKRFw":{"text":"Great spot for drinks or casual lunch/dinner. Bartender Josie was very sweet and very atte","useful":0,"cool":0},"gznKfLNF8nS8dZzSZKFUVQ":{"text":"Wanted to get some Cajun food since we were visiting, reviews looked good, and we got a pa","useful":0,"cool":0},"fTULn8qg-c-pZTfP5ns-Pg":{"text":"Gutes Essen aus der kreolischen und Cajun-Küche.","useful":1,"cool":0},"AJfpc_tjgvQ7u_QbNJwQQA":{"text":"What a life saver and an amazing bar! While visiting NOLA from AZ last week, we ducked in ","useful":0,"cool":0},"_pUmiRdK3KjPOnore6HVwQ":{"text":"Excellent crawfish étouffée! Red beans & rice with andouille was wonderful. Overall great ","useful":0,"cool":0},"EhPCKSByxpiNu9367iFDSA":{"text":"Visiting from Houston, so we decided to stop by and get some good ol' Nola food. I got the","useful":0,"cool":0},"URSDmoou7xYcDnh2WWyfVg":{"text":"We have enjoyed great food here before, but this time, it was disappointing. We ordered th","useful":0,"cool":0},"kzMdIN3PrvZ8MY8c8SMYHA":{"text":"We found this place via a Yelp recommendation and decided to stop in for a casual dinner a","useful":0,"cool":0},"bDIoACdQ3f3v0SfZLrn3CQ":{"text":"Excellent food. Best bread pudding I've ever had. Only thing that I would suggest is that ","useful":0,"cool":0},"VLPoJQFXeFiTHnOlyXG3nw":{"text":"This was my 3rd visit to 801 Royal. First, we LOVED the Bloody Mary! Just spicy enough, fa","useful":1,"cool":0},"z0DQ08HbtvdK-3l1ITATZA":{"text":"Fun place for drinks. The bartender Andrew was a pleasure. His attitude and willingness to","useful":1,"cool":1},"duAXpgpKpdMys9puii-nIA":{"text":"If you are friendly and want a great place to talk to the bartenders, this is your place! ","useful":0,"cool":0},"8khUKLnyPkO05lzuf0CpxQ":{"text":"I was looking for dinner in the French Quarter and Yelp led me here. It's a smaller bar so","useful":1,"cool":1},"7Z5v9IBgwslR_nwFMtVvGA":{"text":"Best stop all weekend! We had brunch here on Saturday.  They have complimentary unlimited ","useful":2,"cool":2},"c-fRUsy0QhT8sr_CSIn8pw":{"text":"My wife and I were in New Orleans for a long weekend and she suggested that we had to try ","useful":2,"cool":2},"dXe5rkCZMK72I8eLesV5og":{"text":"Wow! I would choose the seafood nachos as my\nLast meal! Died and went to heaven. Ahmazing.","useful":1,"cool":2},"sKtCCvkXpT6xadbyvbOaCw":{"text":"The seafood nachos are to die for! Don't forget to chase it down with an oyster shooter. N","useful":1,"cool":1},"O7F2oQRgmZUOZMa7e8XrZQ":{"text":"Such a beautifully decorated restaurant with an amazing ambience. The unfortunate part of ","useful":0,"cool":0},"LCSGQicMz6z9dXtX1MfgVQ":{"text":"Hidden brunch gem in the French quarter! I loved it here. I loved the angel Mural above my","useful":2,"cool":2},"O455rkZ8mfHiwJmH2CghkA":{"text":"Kool feeling, chill waiters, and good size dining area. The foods great I had the Alligato","useful":0,"cool":0},"-YbMmi0YgxoZx3_tY8lw7A":{"text":"We didn't know where to go while walking in New Orleans. Stopped by to grab a beer and met","useful":1,"cool":1},"Cpylb-iiycWSBpMgWgKPHQ":{"text":"Amazing! Go see Jonathan and he is so fun! Great guy who gave great recommendations for dr","useful":0,"cool":0},"MYOh7SceF3EgqCvyU-L8-g":{"text":"Listen, are you gonna get gourmet meal here? Absolutely not. Strong cocktail. Yes. Relativ","useful":0,"cool":0},"9nG9v5AaS8BxcnV5D2DX6Q":{"text":"A Quarter restaurant that changes the tourist into a traveler; and makes the traveler feel","useful":1,"cool":1},"B60WSG1HVw6OmsEfsuD7qg":{"text":"I drank my way up and down and round and round the French Quarter as I sampled as many of ","useful":46,"cool":36},"fhumX2tmFILrKzGTiqw0Sg":{"text":"Good food. We had the etoufee, which was AMAZING! The \"side\" order of Debris Fries was rea","useful":0,"cool":0},"0rBqiQEUFaOqbMLZROtsPg":{"text":"I went here with a group for lunch. Not a large place but the food was good and the servic","useful":0,"cool":0},"PFR-NQDbLoKnwqvsjPVV2g":{"text":"Drinks are priced at $12ish for a double, and you definitely get a double. Bartenders have","useful":0,"cool":0},"ctj2UINLj5Cf0jGA7KenhQ":{"text":"Our favorite place for oyster shooters! 9:00 am and following with a mimosa! Love this pla","useful":1,"cool":1},"2Uw84ggW0Am2JNNfPXi8Gw":{"text":"Great food, atmosphere and service! Highly recommend! We had an assortment of appetizers a","useful":0,"cool":0},"3-hxiXuSTz2tFRaU-OtTVg":{"text":"Was looking a a place at 11pm and luckily for me this place was open until midnight. Could","useful":0,"cool":0},"jm0s-PzpP_c5hARbaoHPdA":{"text":"By chance we stopped here for a beer and had the seafood nachos...  excellent!  Server was","useful":1,"cool":1},"Y5du6E0mYEst3WzG8nixGw":{"text":"The food was great and the service  impeccable.  You have to try the crawfish nachos...no ","useful":1,"cool":1},"_EUVujwwDWd-fTflBY6q0A":{"text":"We stumbled into 801 Royal purely by chance.  We had a long list of MUST DINE HERE options","useful":0,"cool":1},"KfODLXDXbPeGjgh6ZvThHA":{"text":"Delicious place. I always make a stop here when I visit New Orleans. When you make it for ","useful":1,"cool":0},"d6sWyCeiuc0xZ7nk3qL_1w":{"text":"The seafood nachos here are AMAZING!! I would come back and eat them everytime I am in the","useful":1,"cool":0},"59_rCnJp1sIMkRDDC_qTOA":{"text":"They best Bloody Mary ever!! Plus a deep discussion of American Horror Story! Will return!","useful":1,"cool":1},"mTrHn-uer-sSNK_6Yt-FnA":{"text":"Great little place, awesome service by the bartender Michael and owner Kelly.  Ordered the","useful":0,"cool":0},"NSB9wW2eL_Zna-vb3rHcyQ":{"text":"We've been back three times already! The staff is friendly and fun, the food was good, and","useful":1,"cool":1},"gGGoHg9faSP8fhDfo83PqQ":{"text":"Best bar in the French Quarter!  Great bartenders! We came here before we moved to New Orl","useful":0,"cool":0},"k_CndZ39ke8b1FLT-NBYiA":{"text":"A great find in the French Quarter for muffalettas and po' boys.\n\n\"New\" to the Quarter (Ye","useful":5,"cool":2},"VlKLZyjsT2bGXheuwJWAEA":{"text":"Our favorite restaurant and bar for great food and amazing drinks!  I recommend the catfis","useful":0,"cool":0},"sQJiO-uxc4VBy2cLIr_HMA":{"text":"The best bar! Aubry & Andrew are fabulous bartenders! They make awesome drinks. The friend","useful":0,"cool":0},"CSSF92Xp-uwejPLyP3GaUA":{"text":"It's got a cool ambience, the wait staff was attentive, but the food was lackluster.\n\nMy P","useful":35,"cool":33},"91kUBQJbaLCVuNPK4U1qag":{"text":"Customers beware. Prices on menu and not ones in computer. Management is rude and unhelpfu","useful":0,"cool":0},"u9JcciEn-uIJnEddjiQQjw":{"text":"I was out on a ghost tour last night and got done about 10:30 and was hungry. I asked my g","useful":1,"cool":1},"b2gK2JHjk7HCh6cLblDv5A":{"text":"Decided on coming here after reading all the delicious  reviews, and surprisingly  we got ","useful":1,"cool":2},"TcYDp20gN0ePrYXP9GcbuQ":{"text":"French fry po boy - my goodness. Absolutely amazing. Great service and friendly atmosphere","useful":0,"cool":0},"pM_P5FZa5LjdfSTMyl7L9Q":{"text":"The space is open 10/25/19 with a new name and new ownership. Same great staff. Swing by.","useful":0,"cool":0},"1IZI7ywoGfzyohulG1vnRg":{"text":"The rosemary shrimp po boy was not your normal po boy! The shrimp were grilled and slather","useful":1,"cool":0},"H5OQe1-i68Wy_tC_P2Qkyw":{"text":"Great bartenders and chill spot! Def get the gumbo and the lighting drink (please know you","useful":0,"cool":1},"exoI7Av_usRfttm9t7lWPg":{"text":"Looks like 801 has re-opened with new ownership. The old sign is gone so not sure what the","useful":2,"cool":0},"CE9QQZGij8yrPcRPhVaAfA":{"text":"We came to 801 Royal for lunch. We ordered two\nBloody Mary's. They were good and spicy. We","useful":0,"cool":0},"Rmi7IurLyUX8veZaPmtzsg":{"text":"Stopped in here by chance and was pleasantly surprised. The royal po boy was huge and tast","useful":0,"cool":0},"XsRjLiHGeuF_7DMy9mKn4g":{"text":"Red beans and rice not good at all, not really edible to me!! I pretty much left a full un","useful":0,"cool":0},"Hh8IfMHVs3asAajj7Dqxqg":{"text":"Don't let this hole in the wall fool you, their food is serious.  This was our second time","useful":1,"cool":1},"2Th9di8tGxAT01jxq_1YIQ":{"text":"Excellent food for the price. Great service. Try the combo with red beans and rice, crawfi","useful":0,"cool":0},"5dN6mst1jjZuOz4eTLMDLQ":{"text":"If you haven't been here, go!\nI was here to watch a 49er/Saints game a couple of weeks ago","useful":0,"cool":0},"pPCuuNgDsdaS_NGu3XS-3g":{"text":"Stopped by for drinks while out and the bartenders Aubrey and Story were phenomenal. We fe","useful":0,"cool":0},"Q33Mhqfp1cgQwJa_98NxYQ":{"text":"Ate here for lunch on Oct. 29, 2014.  We had the Cajun Sampler, a side of Fritters, and a ","useful":0,"cool":0},"om8g6AHYq_LIF1IN0ZRPww":{"text":"Casual, service is good, food is under rated.  Presentation is simple, small portioned, an","useful":0,"cool":0},"n86H2yIEGRprX8ASTOTNHA":{"text":"Debris fries & fried green tomatoes are delicious, but the service is outstanding! Genuine","useful":1,"cool":0},"5xJPsX1L4j6bVtlwGfSHcA":{"text":"Great little spot in the Quarter if you're seeking a classic po' boy, strong cocktails and","useful":10,"cool":9},"GA9D6YQjac_dQwdd-ebcRA":{"text":"We actually came here twice during our stay in New Orleans.\n\nThe first time we got a to-go","useful":1,"cool":0},"CKjzMvwQ23AtcUMioQ9LHA":{"text":"Great place to sample local brews. From the time you walk in everyone knows your name NS h","useful":0,"cool":0},"1ylujh1Ql6Z2SyiPyJJHww":{"text":"Reviewed this place like 2 years ago when I went for the first time.\n\nIn my mind, I though","useful":3,"cool":2},"vyXROFEMtMsuelAQcDzIQw":{"text":"This is a great place to stop for drinks and a quick bite on Royal. We got the seafood nac","useful":1,"cool":1},"YcvxnvjklpaiOHGP-qgdBg":{"text":"Sampler comes with bread pudding for dessert!\n\nAs the locals would say, don't eat on Bourb","useful":1,"cool":1},"DrQBZ07-SiFg0dF4KxBQmw":{"text":"Used Yelp to find this Gem just one street from Bourbon ST.  We were lucky to get a table ","useful":1,"cool":1},"uYgz5LK4K2mGTTVPUzwP9Q":{"text":"Got a hurricane drink here to-go. Can't comment on the atmosphere, table service, or the i","useful":4,"cool":0},"qtJNINk28gG8PFakwsk9Pg":{"text":"Great service and food highly recommend.  The po boy's were great. And our server paid ver","useful":0,"cool":0},"2xkCJxLNDECtRveb90E4pA":{"text":"Quick and easy lunch place or a great place for drinks in the evening. The blonde rue gumb","useful":0,"cool":0},"9vpZVpBsQ7Kon24v_GkdmA":{"text":"Quick service,  good food and drinks.  I will definitely  be back to have a bloody Mary or","useful":0,"cool":0},"X0PcPwuWLCZ15PyeOzBhhg":{"text":"So I'm on my first night in NOLA and I am wandering down Royal Street and wandered into 80","useful":2,"cool":1},"-OhjiIcV_k4cKaJRZicvXQ":{"text":"801 Royal is our latest favorite spot to stop and eat when we are stomping around the quar","useful":6,"cool":3},"0uRBenUPtOYbOGmLI9LMKQ":{"text":"Alligator sausage Po Boy is a MUST TRY! The sausage is filled with lots of Cajun flavor an","useful":5,"cool":3},"4dSMpJFXpokGp1NOO9G4jA":{"text":"I was really pleasantly surprised at how good the food was here.\n\nFried green tomatoes wer","useful":2,"cool":1},"kSaeUZNYY03wdk0qIru0ng":{"text":"Outstanding service and food. Had the seafood nachos and fried oysters - Delicious!  Great","useful":2,"cool":1},"jaAuM7osKLPxIQGc0OXuTA":{"text":"My review is a 3.5, but I'll round up. I came here because it was suggested to come to 801","useful":1,"cool":1},"Chzm0hp3QmfrMyFP1geGJQ":{"text":"During our trip to the beautiful city of NOLA, we wanted to experience creole brunch. It w","useful":9,"cool":5},"VNrnDX9QsTMRbuPvzyjvWQ":{"text":"801 Royal is absolutely one of the BEST bars in the French Quarter. The staff and owner ar","useful":2,"cool":1},"hkH27rf04wq7y-gudLDAgg":{"text":"This is my go to spot in NOLA for a late nite bite and drink around the quarter. The food ","useful":1,"cool":0},"ym9a-AwARWAqkWwPUjOBQw":{"text":"First stop here was for a meal and accompanying adult libations, second was for a \"pit sto","useful":31,"cool":27},"s46FwbVNrtcNdh2XEbwowA":{"text":"CRAWFISH & SHRIMP NACHOS in a gooey-whiz-cheese.\nLOCALS' DISCOUNT: 10%, & the portions are","useful":4,"cool":5},"Mu8Ac6IgU3p1rzBqtJEfzw":{"text":"Pretty decent place - not bad, pretty solid food, but nothing special.  We went here after","useful":0,"cool":0},"bIhboHqCQA0yuaK59iE6HA":{"text":"WOW. Wow, wow, wow!\nOkay this place is amazing mainly because of Aubrey!!  What a fantasti","useful":1,"cool":1},"pSEsq8UEjivS80qapN-UoQ":{"text":"We fell in love with this place when it was Royal Street Deli. It \"was\" a very laid back m","useful":0,"cool":2},"Gqb7m5hqjyiryvQxXUuOuw":{"text":"We stumbled upon this place through a previous Yelpers review. And by stumbled I mean we w","useful":2,"cool":4},"dfOSe5LDXYKEL1F9ye-HmQ":{"text":"Thanks, Yelp, for leading me the way to this place during Mardi Gras!\n\nI was the self-desi","useful":2,"cool":1},"k_fViPHH1NKoZaCwNxvyWg":{"text":"Decent service, great food, and a perfect location if you're looking for a casual restaura","useful":2,"cool":0},"vkioXTOkKdUo8UW39B4S3Q":{"text":"Alligator sausage for the first time! Saaaaayyyyyyy wuuuuuuuuuuuut! It's not normal to eat","useful":2,"cool":1},"u3FtIeQNKqGQnAftJYFHyg":{"text":"Tasty (if potent) drinks... good thing they come on their own Go Cup!  Tasty food too! I h","useful":1,"cool":1},"gNadiWcZoFurFQf5963Gnw":{"text":"New Orleans is one of those places that you can't really go wrong with any of the fine eat","useful":0,"cool":1},"X-AIbFmXDd6fmQukhmTkbg":{"text":"Stumbled upon this place, we're looking for some authentic Po boy. Weren't disappointed! P","useful":4,"cool":3},"2veK25OziriJzHYuaDJaEw":{"text":"This was one of my favorite bars in New Orleans.  Even though it's only a block from the m","useful":2,"cool":2}}