{"Q_hTRlan2L89W2WPSq8pyw":{"text":"We took the cemetery tour with Dylan and he was great! The price of the tour was totally r","useful":0,"cool":0},"CNH4w-5Y2fhGogpFkmN03Q":{"text":"Just finished a fantastic! Tour with Stella!! She is so much fun and just packed with grea","useful":1,"cool":0},"ny5Q1I5uiv4gKSIC9Aifow":{"text":"Great deal on Yelp! Fun tour!! Would recommend to friends.","useful":0,"cool":0},"jb-FbE4JCPnEiJ_191LUKg":{"text":"We went on the Ghost & Vampire tour on October 26. I should have passed on this activity.\n","useful":1,"cool":0},"oRVSk1o2wvyWbGiGnL-IKw":{"text":"We took the Music of New Orleans tour with Blais. She was a great guide, and the tour was ","useful":0,"cool":0},"FeshX020Y1lvj4guiv5ttg":{"text":"Wonderful place to take a tour! We took a cemetery tour with Leena. She was fantastic- gav","useful":2,"cool":0},"H0nTuWA_KJq1d13Tw5LABw":{"text":"We did the Ghosts and Vampires tour as well as the tour for St Louis Cemetary #1. Both of ","useful":0,"cool":0},"lHF1ShPnUqRTETo_wLRtlw":{"text":"This tour is hands down one of the most informative two hours I've spent in New Orleans.  ","useful":0,"cool":0},"f8xxh43pp58LACTREGOPvw":{"text":"Fantastic! I am so glad we did this! Our guide was Luke. He was very personable with a the","useful":0,"cool":0},"MeP6gYHSSIbrM-657a5hzA":{"text":"Went on the St. Louis cemetery #1 tour and had an awesome time! Leena was our tour guide a","useful":1,"cool":0},"5EKvDS2cA07QSz09aGLTgw":{"text":"We took the Ghost and Vampire Tour guided by Luke in early November. He did an amazing job","useful":0,"cool":0},"WvH_yKTN_0zxwV9H35sHeQ":{"text":"I had trouble falling asleep that night bc those stories were so flippin' crazy, so I gues","useful":0,"cool":0},"tFYyQuoOBvny-5ktdB3e-A":{"text":"We travel a lot and enjoy taking tour so we thought the True Crime tour would help us lear","useful":1,"cool":0},"bhxqB58EX8vG0ApFk1qmlg":{"text":"Went in the St Louis #1 cemetery tour. Evian was awesome and super knowledgeable! Would re","useful":0,"cool":0},"PyQ3Du9WGm-JpaxGniFlUA":{"text":"Had a great ghost & vampire tour! Duckies was a great storyteller! He was knowledgeable,  ","useful":0,"cool":0},"DNDlpBm_K26s_grbq4wZmg":{"text":"Loved it!! Our tour guide Evian was knowledgeable, witty and fun!  We brought our 12 and 1","useful":0,"cool":0},"Ois6VQ3yA2EDP3hSRCUkPA":{"text":"Great tour, great tour guide Brian. Very informative and kept us interested. We especially","useful":0,"cool":0},"lWK7BwDP6iYLGX1hoYVclQ":{"text":"Awesome tour! The group sizes were perfect, not too many people. Our tour guide Robert was","useful":0,"cool":0},"seUbO1CB4eV5vuY-GF-aNg":{"text":"My daughter and I took a last minute trip to New Orleans from Pensacola, Florida. Our guid","useful":0,"cool":0},"bAkd4Ub10hN6x9ujYVjUMA":{"text":"Steven aka Hubert did a great job. Very entertaining and knowledgeable. I would recommend ","useful":0,"cool":0},"TJklSN7Xptc2A-EpQE-rRA":{"text":"We went on the ghost and vampires tour. Angela was great and we had a really good time. I ","useful":0,"cool":0},"QbnaiWFycReRwp1TCLp3-Q":{"text":"My family and I took the tour yesterday. Our tour guide, \"Blaze\", was a gem! The tour was ","useful":3,"cool":0},"q0TJaKsChZ342ZAlcFQMjw":{"text":"My husband and I were just taken with our tour guide and her amazing delivery of these bas","useful":4,"cool":4},"b7T2vn2cdQ_gfXKYp0f2Sg":{"text":"My friend recommended this tour and I had a great time! The bar we met at was really cool.","useful":1,"cool":0},"1RZS7QI_KNlsQIPvPeRwmw":{"text":"Sandy, our tour guide, was outstanding.   Extremely knowledgeable, great comedic timing an","useful":0,"cool":0},"GGezyIfFygwBCSz4W67tVQ":{"text":"We were a bit skeptical about doing this initially, but are so glad we did!  Did the 6pm t","useful":0,"cool":0},"FskBkc9c1C7-nvWCtnOPJg":{"text":"We took both the Ghosts & Vampires tour and the Cemetery tour. Both were very good, but en","useful":0,"cool":0},"-FtP62VuxOTJE0VaU-P1eQ":{"text":"Sam's Garden District/Lafayette Cemetery tour was fantastic, start to finish. Highly recom","useful":0,"cool":0},"YTyZBIVwclt3OPON6eUxhQ":{"text":"Great tour. Our friendly and knowledgeable guide really made the experience entertaining f","useful":0,"cool":0},"v3JTm-aaTWf7Zetb8L7gvg":{"text":"Hi all.  Just in case you're looking for the right tour and not sure - this is the one.  Q","useful":1,"cool":1},"kJ52hpwK10i9dXtxyYl2qg":{"text":"The tour was educational an awesome. Malika was a great tour guide. We really enjoyed the ","useful":0,"cool":0},"2W5AZn-8WLLq_AX2yLYl-A":{"text":"I had a great time on the tours! I booked two over my weekend and I felt like I learned a ","useful":0,"cool":0},"ukmT_KMRZcmBNATuy_Wg9Q":{"text":"Hope made the trip worth staying out in the August heat!!! \n\nWe learned history, folklore ","useful":0,"cool":0},"upP4pDexhDZQWdthSe4LoA":{"text":"Tour w Sandy was awesome!  A great story teller with lots of tidbits and history.  Great s","useful":0,"cool":0},"Y2xdbjvszoKfXsRQLGs8Ig":{"text":"I was mistaken as to what company held it to her that we attended last night the Phantom c","useful":0,"cool":0},"zgxMJxt_RtR9QIE6KPJe7A":{"text":"Liz was great! I recommend this tour if you want a killer (har har) balance of personal ex","useful":1,"cool":1},"gCkUnNWilwUvwVObYvCEFA":{"text":"FABULOUS cemetery tour with master storyteller Evian. This is one of the best \"sightseeing","useful":0,"cool":0},"10WwivhwKpuVZNbBZsR7XA":{"text":"Can I give Stephen all the stars, because he was lovely. He was fascinating, and knowledge","useful":0,"cool":0},"--rTlRNPla6azelpN66Y6A":{"text":"If you find yourself in NOLA, if you do anything (other than eat seafood and beignets) go ","useful":5,"cool":2},"NTQH2WkXnmtVuLUsehh7rg":{"text":"I first came in Dec and had the Cemetery tour with Audrey, she is great, lots of good info","useful":1,"cool":0},"ftxV-JzN_w-JFIACRMM51w":{"text":"We were told that the tour was family friendly, so we took our 4 kids, ages 5, 6, 9 and 11","useful":0,"cool":0},"vNiUB6EcRNoApoLQEBsl7g":{"text":"So fun. We investigated a former infant asylum. We think we contacted a spirit named James","useful":0,"cool":0},"3_dthnMweCytjVc70uT5yA":{"text":"Amazing. Go here because it's a tour, high entertainment and your kids will actually see h","useful":0,"cool":0},"mKDiFxtBEzO1ecU3rIdKYg":{"text":"This is a neat way to get to know the city without the boring tour guide feel. \n\nVampires ","useful":1,"cool":1},"w189gVOxNWVgIy5wiF3buA":{"text":"Went on the ghost and vampire tour and learned a lot about the history of the area. Don't ","useful":0,"cool":0},"z0enTIUVSM-Y612mlxDewQ":{"text":"I went on The True Crime Tour with a group of friends - two veteran locals, two newcomers ","useful":1,"cool":1},"a5Ff9gXRsa7wWnr5_f0iKQ":{"text":"I've done ghost tours in a number of cities. (And I mean a large number- this may be like ","useful":1,"cool":0},"hSBlaRUWzHA5zxvXDPifmg":{"text":"Stephen gave a graduate level tour of St. Louis #1.  He's extremely knowledgeable, conside","useful":0,"cool":1},"c15c0XHkJEcGtMxpI8Iw9w":{"text":"We did the Saint Louis #1 cemetery tour and our guide was Andrew. I don't think we could h","useful":0,"cool":0},"x8elN80280d30eyDqr78GA":{"text":"These guys were awesome!!! My girl friend and I did the ghost tour with Thomas as our guid","useful":3,"cool":4},"q-71Gkdw-30aJiT87zw0yA":{"text":"Such a fun tour, took my mom who was visiting and some friends, and we had the best time! ","useful":0,"cool":0},"DQw4DqlIQXRoZt5I2DQ3IA":{"text":"Tour guide Susan was great. Learned a lot and all stories checked out. Fun!","useful":0,"cool":0},"HvzU9J0I5SSXkp4S0Jw-lw":{"text":"Graveyard Tour - We took this tour today and our guide Blaise was amazing!  I would defini","useful":0,"cool":0},"tS-5_rlC0l-1YY7lvrs-kg":{"text":"This should be the first thing you do when staying in the French Quarter. You'll never loo","useful":0,"cool":0},"oJEA6PlEoIzaL_WHSN1DLA":{"text":"Dartanya is the Bomb diggity!!!! She made my first trip to the New Orleans incredible. Che","useful":0,"cool":0},"XMvpH6MhCdDUfPSR2yxewA":{"text":"Lena's Cemetery your was great! Informative, plenty of time in the cemetery, and willing t","useful":1,"cool":0},"kgQ4TIXgtP_bt3jzX5p5kA":{"text":"Went on the tour the Friday before Mardi Gras so lots of people were on the tour which isn","useful":0,"cool":0},"63WQPoQI9Vw8FC62WTJWaw":{"text":"Our tour guide was Liz and she was fabulous. Spookie stories and walking tour that wasnt e","useful":0,"cool":0},"qlJbKo-J-2kupnxTJzzVRg":{"text":"The ghost and vampire tour was definitely a highlight of our recent trip!  Tour guide Luke","useful":0,"cool":0},"3GxXzezkEpC3KJ1Jckv3tQ":{"text":"This tour was fascinating and Stephen was energetic, knowledgeable, and fun! The tour star","useful":0,"cool":0},"3UHcOhmylv7VzFIB9lQsOg":{"text":"Absolutely fantastic! Me and two other people took four of their tours and I  would defini","useful":0,"cool":0},"rFNGRKThZTIHd8W54wSeOA":{"text":"If you're visiting New Orleans and are into this type of thing, I would recommend doing it","useful":1,"cool":0},"LMt3C8axZRLxUE3KLH7HIQ":{"text":"My sister and I went on the Saints and Sinners tour with Sandy this afternoon and we had a","useful":1,"cool":1},"aJDqmVDRlDKSfugsUqL36Q":{"text":"*Ghosts and Vampires Tour*\n\nHaving never been on a ghost or vampire tour before my sisters","useful":1,"cool":0},"vNflJZchjtp1hosxa5R21g":{"text":"What a great tour! Luke was our guide and not only was he a great story teller, he was rea","useful":0,"cool":0},"0RBfPKLl1QGxPrczVuFdmg":{"text":"They have a deal on the yelp app. They were super chill about honoring the deal even thoug","useful":7,"cool":6},"ezsbz0N3V1uUnWBucdPAMg":{"text":"We took the cemetery tour, with Tessy.  She was very knowledgeable, funny, and helpful.  H","useful":0,"cool":1},"CaZ2WdoGejNKi3pc_VUT5A":{"text":"This tour was so much fun! Aubrey, our tour guide was phenomenal! She knew her stuff and y","useful":0,"cool":0},"yfGYIakEQCU4IGY6p5b9_w":{"text":"Luke our tour guide was great!  The cemetery tour was good and you learn a lot of things o","useful":0,"cool":0},"GPWY3SmYLINiGaJJ4CxJtA":{"text":"Saints and Sinners with our guide Sandy was the BEST TOUR. She really spoke to how colorfu","useful":0,"cool":0},"_VXPEbb1cbJ7r2hjfGGfmg":{"text":"This was a lot of fun and very interesting for both me and my daughter (age 15). I'm not s","useful":0,"cool":0},"PSrO9WZJirI2dsFVeT1-Vw":{"text":"I thoroughly enjoyed this tour. I had been in New Orleans exploring the French Quarter for","useful":3,"cool":0},"DvKON7lbKCjodLQWH68UOw":{"text":"We did the Ghosts & Vampires Tour and were mostly disappointed. Lots of walking with rando","useful":0,"cool":0},"QY1jB8iRbVp1JJTgnZOCgw":{"text":"This was the best tour ever!! My family and I took the ghost and vampire tour on 6/28/14 a","useful":0,"cool":0},"SSAALiCQVJt4CwWrzsH8tw":{"text":"We did the Ghosts and Vampire Tours. The tour was great and interesting. Our guide was ful","useful":0,"cool":0},"CKXSeYyjQQfDD1vmsBbT2Q":{"text":"My friends, husband and myself wanted to do a cemetery tour while visiting New Orleans. Th","useful":0,"cool":0},"vLb4WM_8iaSxANLlJqNkXQ":{"text":"Pretty cool \nWent on the ghosts and vampires tour\nWould have liked to hear more stories ab","useful":0,"cool":0},"pEY5s36kSaVSo8NlhsS9FA":{"text":"We took the ghost and vampire tour and had a great time! I was the one out of our group of","useful":0,"cool":0},"iQjaEA4nvIudcsvMvDdlXw":{"text":"Took the Ghost and Vampire tour with Luke on 2/26, and it was very fun.  He knew his stuff","useful":0,"cool":0},"UnKBqg8kVmPnOoQrf11AWg":{"text":"We got a Groupon for the Cemetary Walking Tour. It was so much more than that! We did tour","useful":0,"cool":0},"wphW8Wzmx9watyu4-VK7XQ":{"text":"My husband and I just returned from our first New Orleans trip and the two tours we took w","useful":2,"cool":0},"aZ0AFZcT7I5RGkY4I6V-Zg":{"text":"Came to nola for a work trip ave was only here 2 nights. Since we were busy all day and co","useful":0,"cool":0},"U8V-k1dtOrr2fsrd6ljDfQ":{"text":"My favorite part of my trip to NOLA was definitely the ghost & vampire tour .. Take the to","useful":0,"cool":0},"dB4ugYEh3VZns8njb6zjYA":{"text":"Amazing ghost and vampire tour with Hope this evening. It was a great ~90 minute walking t","useful":0,"cool":0},"rgsi2tX94ejGQe5jdrO-xQ":{"text":"We have been on numerous tours but the French Quarter Phantoms tours has them beat!\nWe did","useful":2,"cool":1},"rYMTGlKoTVvACezN3hWGMQ":{"text":"Phillip was very well informed, very articulate , and included a very tasteful balance of ","useful":0,"cool":0},"HNhwdM3iEPDE09m4E2STDg":{"text":"Robin, thank you for the fabulous Treme Tour.  This was our second time taking this tour w","useful":0,"cool":0},"tFzDaO6s13ijrtHSCPX31A":{"text":"Audrey did an awesome job on the Cemetery Tour! I learned a lot of truths to the mysteries","useful":0,"cool":0},"NuBkulXTVqLsE-GN8Ar2Aw":{"text":"I've never been to this state before, I'm here on work, and wants to get a little \"me\" tim","useful":0,"cool":0},"cH5B1HcwHBD3RBr-GtXG8w":{"text":"We took the Ghost and Vampire tour during our bachelorette trip to New Orleans. Emily, our","useful":0,"cool":0},"B3Ud0j1WppC2i6QKiajZCA":{"text":"Did a Ghost n Vampire Tour 2nite in NOLA and gotta saw Aubrey was AMAZEBALLS!! She sure kn","useful":0,"cool":0},"1WK1MGQ43VMSn9D0ypCdUw":{"text":"Take a cemetery tour, they said.\nIt will be fun, they said!\nTHEY WERE RIGHT!\n\nBeing that a","useful":10,"cool":10},"5lFffCu-h3_1S2gaHVEHNQ":{"text":"Fantastic tour; highly recommended.\n\nDuckie has excellent stage presence and delivery.  Wh","useful":0,"cool":0},"cMDuajt5VTKs8inOc-wJtw":{"text":"Great tour.  Luke was an awesome tour guide. Must do when you come to NOLA. Wear good walk","useful":0,"cool":0},"w0EWQhXZzMjCaym-VqVIcg":{"text":"We had a wonderful time on our saints and sinners tour.   We learned so much history and a","useful":0,"cool":0},"bR38Jb0WqaQ8Sh-AeT2aHg":{"text":"We really enjoyed the Ghost and Vampire tour with Thomas. He was very knowledgeable, funny","useful":0,"cool":0},"xLv7KYjuO2JZYLKbAQmAfQ":{"text":"We took the graveyard tour yesterday and are glad we did. Trevor was fantastic- very knowl","useful":1,"cool":0},"bEE-Eovo2cwW6M6c4ifnhQ":{"text":"My girlfriend and I were in NOLA the past 4 days, and French Quarter Phantoms was somethin","useful":1,"cool":0},"Niy63qMABo53OraNN_S7sQ":{"text":"Hope is an amazing tour guide! I had the pleasure of her running two of my tours. She is e","useful":0,"cool":0},"-k2xE4af5pCm-zmR_bBP5w":{"text":"Aubrey was amazing, funny and positive made it seem like she really enjoyed what she did. ","useful":0,"cool":0},"58l96qqySuxKoUNXTAtt_A":{"text":"This was a very average your we stopped at maybe five places?  Although this was a decent ","useful":0,"cool":0},"vdrhzXwpKpK_rpFzePnERg":{"text":"The tour and the tour guide were outstanding.  Angela, our tour guide was extremely knowle","useful":0,"cool":0},"GFRg9-0aBK591JqjkMUksA":{"text":"My husband and I took the 8pm tour starting from Flanagan's Pub.  Not sure why Flanagan's ","useful":0,"cool":0},"dbxlfEaYFNTRa6HxpP-g1g":{"text":"Best tour EVER. Our guide, Philip, was smart, funny, knowledgeable, and personable. You co","useful":0,"cool":0},"yeJDCDxZgqXIjC9B9ML1uA":{"text":"The ghost tour was by far the highlight of our stay in NOLA! My boyfriend and I aren't big","useful":1,"cool":0},"G20oMP5olAb6c1ub9oIfFg":{"text":"Steven was awesome!  Knowledgable, funny and charming. Totally worth the money and time!","useful":0,"cool":0},"5IPZpm9eHoH8z9wXihnztw":{"text":"Aubrey was our tour guide and she was great the price was worth and the cheapest tour ther","useful":0,"cool":0},"e-2UBrQ__8_HlGXhOmfYIg":{"text":"My two friends and I went on the Cemetery Tour. The guide, Trevor, was funny and did a gre","useful":0,"cool":0},"zau4aHUvACv7Mmln-Hjo-w":{"text":"Took the Ghost & Vampire tour with our birthday group and had a blast! #ourhandsometourgui","useful":0,"cool":0},"YX419AhkzUHDwDY-BF8Lmg":{"text":"As everyone probably knows by now, you can only tour New Orleans' oldest cemetery, St. Lou","useful":3,"cool":0},"dVM-lviB9SHFOrXhq5Iy_w":{"text":"Took the cemetery tour with Andrew. He was knowledgeable, nerdy and had a great sense of h","useful":0,"cool":0},"krTRYlJzkJmLhP_Sy_lBeg":{"text":"Stephen was a great tour guide, loved the tour!  Lots of history and fun stories, this guy","useful":0,"cool":0},"_E1DsQBMdVki-2oChkhyZg":{"text":"Last min tour booked for Ghost & Vampire Combo Tour w/ French Quarter Phantoms & it was a ","useful":10,"cool":11},"FEiHY17RNIRkAaMfgu1KSg":{"text":"Blaise was our tour guide, she's witty, funny and really cares about the history of the ce","useful":0,"cool":0},"vRDe4QsVTuJ_f2HGkqFHDw":{"text":"Loved this! Our tour guide Trevor was awesome! Don't forget to bring cash so you can tip a","useful":0,"cool":0},"Iaz-EaAxgfPClBdplr6O4Q":{"text":"My husband and I took the St. Louis cemetery tour on a recent trip to New Orleans. It was ","useful":0,"cool":0},"83iqy0WuwLvTTxyV1UVW4w":{"text":"Great tour and guide. My husband and bought our tickets on Groupon for a considerable savi","useful":2,"cool":2},"hMQ8zbKMr1lKnSGXhiPIXA":{"text":"Our tour guide, Trevor, was excellent.  We learned a lot for him (assuming he knew what he","useful":1,"cool":1},"W506nVXJbUUIycqdSPw1ug":{"text":"My fiance and I had a great time on our ghost tour! We started at the Voodoo Lounge bar wh","useful":0,"cool":0},"QqllR3DPT4bVz9atRmGe5A":{"text":"This tour is prime time. There's not one thing to complain about, except the homegirl who ","useful":1,"cool":0},"wSjO0bkV7WIaLooT1oxvYQ":{"text":"French Quarter Phantoms are definitely the BEST tour company in NOLA for haunted tours! St","useful":0,"cool":1},"H_kXAitJCQBugvJoWcTuKA":{"text":"I'm so glad we read the other reviews and took the ghost & vampire tour! Hope was our guid","useful":0,"cool":0},"_sGUSwhzVaf8eCMLt2YwDA":{"text":"Stephen was awesome! The tales were great and he did a great job keeping everyone together","useful":0,"cool":0},"8BUZNsT-fTcAbI5o4ubYIA":{"text":"We did the Ghost and Vampire Tour, led by Malika.  She was fantastic.  She really knew the","useful":0,"cool":0},"wmj8vbCKkf1itQ3PW8xQZA":{"text":"We did the Cemetery Tour and the Ghost Tour.  Both were pretty darn good, informative, ent","useful":1,"cool":0},"rcXV1LtfT0cxzT0H3ReIlw":{"text":"Our party did the True Crime Tour with Robert. While Robert is a very nice person, the tou","useful":1,"cool":0},"Qb_LgI9YG3N4sjvvq2hZww":{"text":"This was an amazing tour! Our guide Justin was very knowledgeable and entertaining! I woul","useful":0,"cool":0},"tnggO0vh4Ox9Du6OJna9VA":{"text":"We did the Vanpire & Ghost tour with Ducky and loved it! Lots of interesting info and cool","useful":0,"cool":0},"SuV1ejkxfvb2LdWNFcFyFQ":{"text":"Wow! If you're looking for a tour that is full of information and entertaining at the same","useful":0,"cool":0},"Wjxb_gcFoaPQkbtHDgZFcA":{"text":"Great tour, great hurricanes & great tour guide, Luke!! We brought our teenage daughters 1","useful":0,"cool":0},"bkWuDBn6HEoR0dZiQl5gdg":{"text":"First of all, know that ANY ghost tour you take in the streets of New Orleans is primarily","useful":0,"cool":0},"vUMDsihHYMBqOGcrukkD1A":{"text":"Awesome tour!  Our tour guide, Aubrey, was excellent-- a wonderful storyteller and very kn","useful":0,"cool":0},"r-Wr6i84nAPqAl5FVcZnbg":{"text":"The tour was great! Our tour guide Susan was excellent and knew everything about the Frenc","useful":1,"cool":0},"P4TSXwTyxUCFDd5-Gbmj1g":{"text":"A bunch of girlfriends and I did the 8:00pm tour as part of bachelorette party shenanigans","useful":0,"cool":1},"SWB9DAkYbptS4V-XKexFqQ":{"text":"Hope was a great story teller and very knowledgeable about the city of New Orleans.  The m","useful":0,"cool":0},"ocNeZuaAeJmIZthT75ujVg":{"text":"We were most excited for the cemetery tour! It kicks off at a bar, with 2 fer 1 hurricanes","useful":1,"cool":2},"VNXVYOxoz9xITvqzcOsD-Q":{"text":"Totally awesome tour with a totally awesome tour guide (Luke). I loved his no-nonsense, ob","useful":0,"cool":0},"YMojLUranzPvmN93BO33GA":{"text":"Awesome haunted  tour in the French Quarter.. Our tour guide was Luke and he was awesome!!","useful":0,"cool":0},"IOl325TwYcrm-xZG8eSo3A":{"text":"This tour was amazing. Very entertaining and very informative. Susan was an awesome guide.","useful":0,"cool":0},"VHwLDNytD02sjleFigKlGQ":{"text":"After a busy weekend in New Orleans for a fitness convention, my girlfriends and I had a d","useful":2,"cool":1},"soBrY5MM_rA0pBkzNfSTZg":{"text":"Great way to spend time before your 8:30 dinner reservation in the French Quarter. Aubrey ","useful":0,"cool":0},"ZpRDLL5t-krOgYxm5Squew":{"text":"Steven was the best tour guide! We did the Ghost and Vampires tour at 8pm on a Sunday. Ste","useful":1,"cool":0},"mOFQr7iFaN--5yOlx4M4MQ":{"text":"We did both the cemetery tour and the ghosts and vampires tour and they were both excellen","useful":0,"cool":0},"HOQhes5YNcYphbm6tT5xyw":{"text":"We just finished the cemetery tour with Robert, and it was awesome! He was filled with kno","useful":0,"cool":0},"tkLb1pf18D72QIaurvbDgQ":{"text":"Took the ghosts and vampires tour. I expected scarier stories based on the reviews. Was ra","useful":0,"cool":0},"ck_S71yVE3iGsByR3w6PiA":{"text":"We went on the ghost/vampire tour with our guide Susan.  She was great!  Funny and super i","useful":0,"cool":0},"YRL_zvfRYtkwskpLyvV_Dw":{"text":"We enjoyed this ghost tour. Tour guide was very knowledgeable of New Orleans ghostly histo","useful":0,"cool":0},"6t-so_7UkUDXwBg8DSqINA":{"text":"Great review. I forgot the woman's name, but she was incredibly entertaining. She studied ","useful":0,"cool":0},"LOFcwQ5B50o8yoPyRgPUVg":{"text":"I really love walking tours and was looking forward to hearing cool stories and seeing nea","useful":0,"cool":0},"L-MefJZVw0vrMaNLDLkp7A":{"text":"I am a skeptic of \"Ghosts\" and Ghost Tours. My wife is a big fan of the mystery and storie","useful":4,"cool":0},"iC4xJYc-FtQySGyaJhp0oA":{"text":"Aubrey is amazing!!!! We had her for the ghost and vampire tour. Obviously loves what she ","useful":0,"cool":0},"l3nVl3OcKi790aZSJFRheA":{"text":"AWESOME tour! Would do again and again. Justin was great and was such a natural story tell","useful":0,"cool":0},"vIq2d9TMyt0pIgIpg6reuA":{"text":"This Was our 4th tour with this company in a year. This tour was great and Thomas was exub","useful":0,"cool":0},"lbrxh3N2upGNEm8EKAb6xQ":{"text":"This tour was HORRIBLE and NOT FUN!  We were directed to this tour by our hotel concierge,","useful":0,"cool":0},"L_mjH946APgBLB5czaHPOw":{"text":"It sucks that a couple of drunk idiots ruin the cemeteries for the rest of us. It's a 20$ ","useful":0,"cool":0},"lJv1tfMRhOgk5oMkzy12fQ":{"text":"We took the 8 pm tour that started at the Voodoo lounge on Rampert street.  It  was entert","useful":0,"cool":0},"MzP_3mdsFnGAi-Cxi054Yw":{"text":"Had a bad experience in a vampire ghost tour with Aubrey and she had a meltdown making a p","useful":0,"cool":0},"7h1WZueica7q0R8ySh6_dg":{"text":"I had a great time on this tour! Our tour guide was very animated gave great threatical st","useful":0,"cool":0},"lv-QvuGSQ71NwKpnB4japQ":{"text":"This is a shout-out to our tour guide Justin! He did such a great job; knowledgeable, hila","useful":0,"cool":0},"oOBR5ILuNw2ZWkPbWZNvVQ":{"text":"Loved the Cemetery Tour!! Our guide Sam was awesome. He was fun and really knowledgeable. ","useful":0,"cool":0},"FJ7zRcGbs7W25WQ0Z39xCQ":{"text":"Went on the cemetery tour with a group and had Justin as our tour guide. He was amazing an","useful":0,"cool":0},"DIgG6MKmbZHZ_6BV71QrlA":{"text":"I went on the Ghost Tour and the True Crime Tour with my best friend and we loved every mi","useful":0,"cool":0},"nlEPuVCVHkfg36Ix0BjoVA":{"text":"We got to take the 11 am St. Louis Cemetery tour with Aubrey, and it was fantastic! Wish w","useful":0,"cool":0},"ffL1YIAMet56D3Uxleft2A":{"text":"Awesome ghost tour!! Before the tour it started to rain and they had umbrellas for $3.00!!","useful":1,"cool":1},"Kx1wZR-FBH2ja826fg10jw":{"text":"I was looking for a good ghost tour and came to my fellow yelpers for help--  thanks for r","useful":0,"cool":0},"VLpx-muifwL7KFtXQ1KIkQ":{"text":"If you are in New Orleans then you definitely have to do a Ghost Tour. I found this one on","useful":7,"cool":4},"0MO-1kxEIkSeMv6ELEHUAA":{"text":"My boyfriend and I did a haunted tour with them...got the tickets online for a bit of a de","useful":0,"cool":1},"IQ0M5XJev0V78ZjRcpHFvg":{"text":"Had an awesome time.. And Luke was a great tour guide! He was very knowledgable and you ca","useful":0,"cool":0},"tggGp7q_bEbN4XfeCHXKSQ":{"text":"We loved this tour. Our guide was Evian, she was great, very informative and entertaining ","useful":0,"cool":0},"AcyTKh8RiALhmuW9PaJhvQ":{"text":"The tour was great! Luke was very smart and knew his stuff. We took the 6:00 pm tour which","useful":0,"cool":0},"MF63DUwDuxbd36GnthQbXA":{"text":"We were in New Orleans for New Years and wanted to do a ghost and vampire tour. We decided","useful":0,"cool":0},"OTZVPLi2xtpScoJ0wNZOng":{"text":"especially entertaining, not at all specter daring. My tour guide was Thomas, who was anim","useful":0,"cool":0},"NEqgBiz_FyYhcsAfCUnbVw":{"text":"Really great and interesting tour.  Our guide Trevor was knowledgeable and entertaining.  ","useful":0,"cool":0},"2mqER13N4RIQdpBOtUs7Rg":{"text":"We had Lina as our tour guide and it was awesome. From the moment we arrived to CCs we wer","useful":0,"cool":0},"XhMas9Pr6hWaBsIF6Y3cig":{"text":"Skip this tour and instead ask your friend to watch sharknado trailer on YouTube and then ","useful":1,"cool":0},"O2-njN9A-BUb1UxLhwpllQ":{"text":"We went on 2 tours;\n\n1. St. Louis # 1 Cemetery Tour - the cemetery itself is tiny, it's ho","useful":3,"cool":0},"sAAmeW5Oshie5l_5nRS7UA":{"text":"We arrived in Nola right after hurricane Isaac.  Our first night was going to be a mellow ","useful":0,"cool":0},"d-IuYiUvWOYt-K8oOhAEJQ":{"text":"We did the Ghost and Vampire tour last night led by Luke. He did an awesome job telling us","useful":0,"cool":0},"42eh1UbMGAJUUmd8ZabUfg":{"text":"The tour was great!!!\n\nIf you find yourself in New Orleans and want a good tour with a fan","useful":0,"cool":1},"07OZGT56xXVOFNoSqYCddA":{"text":"My girlfriend booked this tour a month or so before our trip and we arrived right on time ","useful":1,"cool":0},"WFMCiktu8XmyIpJl7hRthw":{"text":"My brother and I did both the 8pm ghost tour and also their cemetery tour. I've done the g","useful":1,"cool":0},"hsCG-C-K5SR-TUn4COs2Cg":{"text":"I went on a ghost/vampire tour with Miss Stella and a jazz tour with Miss Angela on Hallow","useful":0,"cool":0},"JGe0maLdMhcz8lDRHyuggg":{"text":"For what it's worth, the tours are pretty fun. My group and I did 2 tours with the French ","useful":3,"cool":1},"xNvBns-hlDq4X4OyBhoEIw":{"text":"Aubrey was AMAZING!!!!! Her tour was great. She had such energy and presence and great fac","useful":0,"cool":0},"eWf5He80jdlrmAaIgo18sA":{"text":"Took 2 tours with drench quarter phantoms during our visit to New Orleans: ghosts and vamp","useful":1,"cool":0},"Lb8R02U8X2QPkH-uipgtsw":{"text":"We recently went on a cemetery tour to St. Louis #1 and it was fantastic!  Our guide, Robe","useful":0,"cool":0},"aFu2pgf3DyNrG7YFxrTcNg":{"text":"Absolutely great! Stephen made the tour a lot of fun and was incredibly knowledgeable with","useful":0,"cool":0},"zwRXs4W9WLlW2iypK8skJg":{"text":"Pretty shabby stories and hockie nonetheless. Tour guide gave it his all, but not worth th","useful":1,"cool":0},"2kx1sGkxhIna99e90qqDvg":{"text":"Went on the tour for the second year in a row. It was just as great as last time! Hope was","useful":0,"cool":0},"I42U782RoNvqWe5fULndZA":{"text":"Did both the cemetery and the haunted / ghost tours with Trevor who did an excellent job a","useful":0,"cool":0},"bkBkuqPxLHDfNQhDIF88jg":{"text":"First off, I loved our tour guide, Tessy. She was hilarious, knowledgeable, and made this ","useful":0,"cool":0},"G6BAo2HW8hcAg6mtc-rvEg":{"text":"Interesting stories while taking a walk in the baking sun around the French Quarter. I got","useful":0,"cool":0},"68cZ8lOkz0ocVzpFMnrMhQ":{"text":"We took this tour based on yelp reviews and we weren't disappointed. Our guide, Luke, was ","useful":0,"cool":0},"oSabrsCvwkGmdd9u0Xb0zQ":{"text":"My wife, Athena and I took a cemetery tour and had Luke as a guide.  He was fun and knowle","useful":0,"cool":0},"huPWLwfNjG10lgdnSj9Vrw":{"text":"We meandered over for the cemetery tour around 0930 and checked in, receiving our wristban","useful":0,"cool":0},"VvzvaLf1f9OWKsCyLjzr7w":{"text":"After buying a Groupon for this tour, I was a little skeptical due to the good deal. I was","useful":0,"cool":0},"iZROaRCbOJGEOFkcSZdG8g":{"text":"Out guide was Stella she had a bit of sarcastic sense of humor which came off a bit rude a","useful":1,"cool":1},"4F78yY1ErRFSCGy8sy6aag":{"text":"My guidebook strongly recommended touring NOLA cemeteries with a large group, and FQP was ","useful":3,"cool":2},"lKZwbvuSQL02ijNvbMyIvg":{"text":"Did the ghost and vampire tour with Ducky who kept shouting Allonsy and he was absolutely ","useful":0,"cool":0},"W5IEHoBY8k3YXviji2OHdg":{"text":"I was in NOLA for a business trip but was trying to squeeze in some touristy stuff too. si","useful":6,"cool":3},"gUEm5qmFAvo_Rr6kN05bbw":{"text":"Our guide, Luke, was informative and entertaining. The stories were spooky and scary--we d","useful":0,"cool":0},"_urvb4Sbd_XLxv1AklMn6A":{"text":"I loved this tour!  The perfect balance of fact and folklore.  Hope was a fantastic  guide","useful":0,"cool":0},"Z7990wQoSWWX2efCN5lX5A":{"text":"Despite the thunderstorm that began as our guide Robert was talking about Voodoo Queen Mar","useful":0,"cool":0},"63MysnHCvt2XYvnfFn1tyQ":{"text":"Aubrey was excellent! Had a lot of knowledge about the city and gave the perfect blend of ","useful":0,"cool":0},"pbdakWGe124JuEgMqDbGeQ":{"text":"Lena was our tour guide for the Cemetery tour and she was fabulous. Worth every minute of ","useful":3,"cool":3},"_ixJsIAUMkLPjPPFOroNyA":{"text":"The music tour was great, very interesting and gave us a sense of the city and its vibe an","useful":0,"cool":0},"t32_7HNidQnmKUuPw7czMg":{"text":"I like ghost tours.  They give a good mix of historical fact, local legends, and spice it ","useful":2,"cool":0},"-AcDjGh4F3Np2BgVDpbK6g":{"text":"This past weekend, my girlfriends and I took the \"Saints and Sinners\" tour and we had a bl","useful":0,"cool":1},"4XfSL0CUQdubnabl92bCxw":{"text":"Enjoyed this tour immensely. Lots of good history of the town provided within fun and prov","useful":0,"cool":0},"JS0oecMnmUryi7GTi-KHLw":{"text":"So much fun!!!! Luke was an excellent tour guide and a wonderful storyteller. I'm a touris","useful":0,"cool":0},"Fdlaglwyn8DbNP5mGGVJbg":{"text":"Prior to leaving for our trip, we bought a Groupon for the French Quarter Phantoms True Cr","useful":1,"cool":1},"KOkEqwQU6U_HVa1ThY4RRg":{"text":"Stella was our tour guide! She was very fun and spunky and kept our attention! She was ext","useful":0,"cool":0},"Kgg5W5i5Xw_NAEzX1x2mdw":{"text":"My boyfriend and I took their newest tour, a music tour about the history of the music of ","useful":0,"cool":0},"vsoBrBJloj-Dnc4zh9O12g":{"text":"Liz was amazing! She's a New Orleans native and has great, personal stories to tell. This ","useful":0,"cool":0},"jyofEv2PN5EJa_1IWs5R_w":{"text":"We had a great time on this tour! The bar that we started at (the Voodoo lounge) was great","useful":0,"cool":0},"mVRIkEaJu8zJI_PQkgcrKA":{"text":"We went on the Garden District walking tour with Sam and it was excellent! He was extremel","useful":0,"cool":0},"MJ24qNyJb4kYehPSKE0gGA":{"text":"Went on a night tour of ghosts and vampires. Luke was awesome and I highly recommend this ","useful":0,"cool":0},"Z6H2jVlKg37rC02o6AVsZg":{"text":"Sam was our tour guide. He was phenomenal with his knowledge and his enthusiasm. We totall","useful":0,"cool":0},"cQD9sy12MTHOMKxVVMpPCA":{"text":"So glad I was able to convince my boyfriend to take me on this tour! He ended up loving it","useful":0,"cool":0},"rTbbIosN0H_wSzElhow6nA":{"text":"Just finished our Cemetery #1 tour with Justin. He was wonderful. Very lively and clear. H","useful":0,"cool":0},"CUgu5D_0opmaxD03eNYIUA":{"text":"We had a great time.  On the tour Ducky told us a story of the Nicholas Cage house he owne","useful":0,"cool":0},"eZpmTFMNTlxC2GisxAiy7Q":{"text":"I booked an 11am St. Louis #1 Cemetery tour online for $16. I met up with Luke my tour gui","useful":6,"cool":0},"7eeianyT9SCTfBWqbj5AQg":{"text":"Booked 3 tours with French Quarter Phantoms: musical on 12/28 with Ducky, St Louis cemeter","useful":0,"cool":0},"wXlOKbkfRzp7RX9-teOEEQ":{"text":"We thought this was silly. There were only about five stories and we would have enjoyed se","useful":0,"cool":0},"pSfhvLePkoqKW7LNcEuuVA":{"text":"We did the Ghost/Vampire tour of the French Quarter and it was soooooo much fun! Our tour ","useful":0,"cool":0},"qBwjabgBtb1dgWTwgCj_Ig":{"text":"Went on the ghost and vampire tour with Justin as our guide. What a great time and worth e","useful":0,"cool":0},"dJsn0-ZKAFYY9GjSlfpOqQ":{"text":"LOVED our Cemetery tour with Hope. She was super informative, very animated and all kinds ","useful":1,"cool":0},"55OXRLvZCbac9bgZlIR86g":{"text":"This was an excellent time!  Good for people visiting new orleans, especially early in you","useful":2,"cool":0},"_cuIBC4leJPv3B2vV4TxRw":{"text":"This was a fun piece of my NOLA girls trip. Really enjoyed our guide, Luke, who knew a lot","useful":0,"cool":0},"yODlNm-ZLfmrbCXgL2oNHA":{"text":"A friend invited us to go along on the True Crimes tour, and it was well worth it. It was ","useful":1,"cool":2},"sUeEd8kl2DoGOyWuN6BGMg":{"text":"Take a tour while you're in town! We took the Ghost and Vampire tour with French Quarter P","useful":1,"cool":2},"XvlcZkUCEbSa3AtBfCdVPg":{"text":"This is the second \"haunted tour\" that I've done in the past 2 years and choosing French Q","useful":0,"cool":0},"1s7QLlt17lYvqV2v7Vu_pg":{"text":"We took the cemetery #1 tour a couple days ago (Monday at 1pm) and it was a blast. We were","useful":0,"cool":0},"9l6qPS2pR30NSPG85nf3Ng":{"text":"We did the Saints and Sinners Tour on a Sunday afternoon. Blaise was our tour guide. She w","useful":2,"cool":2},"Y-YpkghRmF4v8huz6oY5_Q":{"text":"NPS = 7\n\nIt was a good deal, if you buy the Groupon or the 2 for $30 deal.\n\nI thought it w","useful":0,"cool":0},"NqnWoMddUUiOqQpzmt68Ng":{"text":"We went on the cemetery tour with Luke as our guide.  It was a fantastic and interesting t","useful":0,"cool":0},"vlyKvuwl6J3aOWgIBoHARQ":{"text":"We were on the saints and sinners tour with Robert. He was funny and knowledgable storytel","useful":0,"cool":0},"oeFmewtgeWrbnhUb3IKqIQ":{"text":"We did the St Louis Cemetery tour today with Aubrey and loved it. She's fun, enthusiastic,","useful":0,"cool":0},"2CBN-pXCnTgoQExct_Wnyg":{"text":"We were fortunate to have Robert for our tour guide for the St Louis Cemetery No 1 Tour. B","useful":0,"cool":0},"V0bnV-pzOaTdwi1tlJVH0g":{"text":"Our tour guide was Trevor. We met and departed from Flanagans Pub. Trevor was very nice an","useful":1,"cool":0},"9xjLlZ5v87zO6k8s06u7Ug":{"text":"Had an excellent time on the Ghost and Vampire tour with Tommy!! So much so that my friend","useful":0,"cool":0},"HEIPGiVPZCer3vAs2h8k2g":{"text":"Eh ... I really had high hopes for this tour but I honestly just felt like maybe I got a b","useful":3,"cool":1},"L79ngJek_erEOdkH8PilyA":{"text":"Really cool tour. Great story tellers and you get a bathroom/liquor break. Sandy is rad. Y","useful":1,"cool":0},"Bas6P-oso1Wrgdo2GHXYeQ":{"text":"The guide was enthusiastic and a pretty good story teller, but this was 90% walking with o","useful":2,"cool":1},"6A-TR2wjmS1bjF_FcyFUFw":{"text":"Philip was an excellent tour guide! He knew a whole lot about the area and its history and","useful":0,"cool":0},"UXOypl9FqsIZm3YH1p9ahA":{"text":"Some people love the overly theatrical and dramatic tour guides that, while they give you ","useful":0,"cool":0},"LEoLSAB-HCkXq9LwXGyGlw":{"text":"This was our second time taking a tour with French Quarter Phantoms. We were in New Orlean","useful":0,"cool":0},"NwvFM-74At9JgHPtORrL2Q":{"text":"I took both the \"Vampires & Ghosts\" and the Cemetery tours from here. We had very knowledg","useful":3,"cool":0},"B5RuNjRPiLQWxUi6lu1yUg":{"text":"We knew we wanted to explore some of the cemeteries in New Orleans.  We wanted to avoid a ","useful":1,"cool":0},"9f9Jn3Akn0biBx9_iautIw":{"text":"Tessie and the French Quarter Phantoms team were FANTAAASTIC. Very organized! Sassy sense ","useful":0,"cool":1},"GoR59a4OqrbyCPjNJDbd9A":{"text":"We did the Cemetery Tour and we weren't disappointed! Hope was our guide and she was extre","useful":0,"cool":0},"RDwgP0rJklHG_SLck0eglg":{"text":"Such a fun tour-had Hope as our ghost tour guide and she was so fun and made the tour so i","useful":0,"cool":0},"7zduO1-6_T-36z2MnKbRsw":{"text":"This was a great experience. Our guide \"the doctor\" had a wonderful personality and kept u","useful":0,"cool":0},"ZvouJLMRtlQF5f-odEfrkA":{"text":"Very good tour, first time visiting New Orleans with my husband and wanted to do something","useful":0,"cool":0},"u9FT64a-YtghcTBLrnuC0A":{"text":"We had a great time on the Treme tour- Sandy Hester was our guide. She was very knowlegeab","useful":1,"cool":1},"jFwKNVFjG0wbW9eBq-x7TQ":{"text":"We did the cemetery tour with French Quarter Phantoms and I'm SO glad we did. Our tour gui","useful":1,"cool":0},"AJZ6i04wA0D0l96MgbWLsw":{"text":"This morning I had a 10 AM private tour of the St. Louis Cemetery with our tour guide Sam.","useful":1,"cool":1},"W0dDxaAuSR4YcFzFMaRXVA":{"text":"We took the Saint Louis Cemetery #1 tour during the day with Angela and she was wonderful.","useful":0,"cool":0},"Ld9PdU9ToXYHNOwSNYUPgQ":{"text":"I went on two tours from this company. The first night was the ghost and vampire tour with","useful":0,"cool":0},"f-8onwdn2G6yW2U_a40lWQ":{"text":"Intelligently told legends of New Orleans--with a bar stop along the way--made for an enjo","useful":3,"cool":0},"ze4Nyez34gPSqSyGpvVyMg":{"text":"Suggested by the concierge at the Monteleone, this was a great way to spend the afternoon.","useful":1,"cool":1},"Uqy1neq4KbJLX40_T1BiQA":{"text":"Sam's Garden District tour and Angela's Music & Heritage tour were both awesome. Informati","useful":0,"cool":0},"t6mVFn2KTbM-GCCJWynzaw":{"text":"We went on the cemetery tour with robert as our guide. He had a good voice that projected ","useful":0,"cool":0},"jRyp8o7tIVKxO9WKesnVkg":{"text":"Justin was a knowledgable and fun tour guide. We learned so much about the history of the ","useful":0,"cool":0},"MSFWF0AXbx-NJF3NxDak9Q":{"text":"I recently went on their tour over a bachelorette party weekend.  Luke Siddall was our gui","useful":0,"cool":0},"UFu_TUoW_lOCVlukp8bDWQ":{"text":"Dylan took us on an awesome 2-hour walking architectural tour in the Garden District.  Ori","useful":2,"cool":0},"1DC9j64csmN-4L9il1lKwQ":{"text":"French Quarter Phantoms is the coolest. It's located in the back of this bar called the Vo","useful":4,"cool":0},"ftMJ6BN7CKa-Xye4ALdtwg":{"text":"We did the Ghost tour last night with Malicka. Today we did the Garden District tour with ","useful":0,"cool":0},"Nb5G2vu5S3Z2Rrvr2RIs_Q":{"text":"I did the cemetery tour yesterday with Robert. It was great ! He was very knowledgable and","useful":0,"cool":0},"WxTgNe5kWJvLAA6CW6JzOg":{"text":"Just got done the Ghosts and Vampire tour, with Aubrey. She rocked our faces off. We HIGHL","useful":0,"cool":0},"oCAckwge7gAEX89rQ_uSgg":{"text":"My boyfriend and I did the Saints and Sinners your with Angela, and the Vampire and Ghost ","useful":0,"cool":1},"WOsMMH8u2U3UXL2Nh-ohvQ":{"text":"We had a great time on the St. Louis Cemetary #1 tour. Robert was incredibly friendly and ","useful":0,"cool":0},"bdGmSca0cT6xXQgLPEej8g":{"text":"Second NOLA visit, two more good tours with French Quarter Phantoms.\n\nWe did St. Louis Cem","useful":1,"cool":0},"cy_dhTlc0c8LivpoQKhd8A":{"text":"This was a fantastic tour. Our tour guide Malika was AWESOME! Booming voice with lots of p","useful":0,"cool":0},"02CTUaFQWhr99RxIVLwwBg":{"text":"It's not so great...Boring zzzzzzz...We went on a tour at 6pm in 55 degree weather. It was","useful":0,"cool":0},"za7aVzBu6slbb85oApqymg":{"text":"One of my favorite memories of my trip to Nola. Thomas was our tour guide, and he really t","useful":0,"cool":0},"gda5O15OwO3mOI6ZAXyicA":{"text":"Great experience as it was my friend and I's first time attending a ghostly tour. We had a","useful":0,"cool":0},"6YollmrGHWzaSipyjdMlmA":{"text":"We took the Ghost and Vampire tour with Luke for our last night in New Orleans and had a b","useful":0,"cool":0},"lWC8B4OKHPaBUTe6YGh9Zw":{"text":"1st time ever in New Orleans and booked this tour ahead of time based on the Yelp reviews ","useful":0,"cool":0},"mBdZi81wnG1Py1ZXusloDQ":{"text":"We did the Ghosts and Vampires tour. I wasn't sure how I was going to feel about it--espec","useful":0,"cool":0},"_D7tux0cZoHxYS0gdm_6Gw":{"text":"We had an excellent time on the ghost and vampire tour. I think the tour was so great beca","useful":1,"cool":1},"1iSbRSHFiFnvQz3AMtbYbg":{"text":"I first came in Dec and had the Cemetery tour with Audrey, she is great, lots of good info","useful":0,"cool":0},"GGt99VopmMUfdP6ErCPknA":{"text":"Took the Ghosts & Vampires tour with Luke. Very personable guy who spoke loud enough for e","useful":0,"cool":0},"ob8HmszKIs_fm9eJ_y-ueQ":{"text":"Did the Saints and Sinners tour with Stella and she was awesome!  Loved it so much we are ","useful":2,"cool":0},"_M-HU4trAKS5czVl37dubA":{"text":"My friends and I were searching for a good ghost tour to take and came across a bunch of g","useful":0,"cool":0},"Ss8F-CR05oQi33jwNJZMhA":{"text":"My husband and I went on this tour and our guide, Steven, was really great.   He was a gre","useful":1,"cool":1},"bkZKbpcr_Imw53yWJLKUtg":{"text":"I had a really great time on my cemetery tour my tour guide Robert was the best he was ver","useful":0,"cool":0},"u_WoEidBR7kvKBT9QFMjRA":{"text":"Just got back from New Orleans and had a bit of a different experience with Phantom tours ","useful":2,"cool":1},"pFl0yXiZ88-Yl2QOC18nhg":{"text":"When I visited New Orleans for the first time, I couldn't imagine that a Ghost & Vampire T","useful":2,"cool":0},"0shuM3D-Q8kdGkpBsf0j9Q":{"text":"The other night we went on the Ghost and Vampire tour and our guide Justin was so much fun","useful":0,"cool":0},"jJ-zx8mdYa7-IuLV0jC8LQ":{"text":"I live in New Orleans but I took a family member on a tour with French Quarter Phantoms. W","useful":1,"cool":1},"NJG0AKXLxqXrMzCCzPRjXw":{"text":"SO AMAZING!  Such great stories - we were HOOKED.  Would recommend this to anyone in New O","useful":1,"cool":0},"PsWm0VJGoCf2a_oMCXUZqQ":{"text":"We booked our tour based off of internet reviews and rating. Phillip was our tour guide an","useful":0,"cool":0},"YneqcaGBvDrg8R_MnQafVg":{"text":"stephen if you are reading this - thank you for a great tour. my boyfriend and i were on a","useful":0,"cool":0},"tpvjxvcFWyeQPhshfL1TXA":{"text":"When my wife decided she wanted to come to New Orleans for a few days getaway she had only","useful":1,"cool":0},"UmcqUYQSceLLY2qLe4R2eA":{"text":"Sam took us through the garden district and Lafayette cemetery tour, and  we were totally ","useful":0,"cool":0},"d59exhIkil0lnRrcpL1yhw":{"text":"We had Robert Clark as our tour guide, he was very knowledgable about the history of New O","useful":0,"cool":1},"qYDPK0UPtMNR2jDK-yh9xA":{"text":"I had reserved tickets a couple of weeks in advance and got a great deal. My group arrived","useful":2,"cool":1},"9IXVjD1_udEXP7B_JUiv6g":{"text":"The tour was a lot of fun! Brian was a great guide and was very knowledgable of the city a","useful":0,"cool":0},"auxPU1SLrwaJcuZDJNlkjQ":{"text":"We went on the sinners and saints tour during a Saturday downpour. Luckily it started rain","useful":1,"cool":1},"Pp2U9QqYoEUIXe6avnJTYw":{"text":"Really cool tour, very informative. I've been to New Orleans many times but this was the f","useful":0,"cool":0},"Ldv5ZIbmctylEWs9HI_AwQ":{"text":"There are a number of Vampire and Ghost tour companies that have popped up over the years,","useful":1,"cool":0},"Rs7hIvOv3DTYbowPkHx7SA":{"text":"Our tour guide Hope was great, she was very familiar with the layout of the St Louis Cemet","useful":0,"cool":0},"I-g0Y1Ge4IipvMTzuWNRIw":{"text":"Do these tours!!! First, check groupon, and ask for Robert. He was super knowledgeable, ea","useful":0,"cool":0},"IUjHJmrstc0D466KrTYWbw":{"text":"I had an awesome time on my tour. Trevor was a great guide funny and knowledgable. He gave","useful":1,"cool":0},"rZHpDrtNlCjL9sGu28rJ9g":{"text":"I was in NOLA last weekend and took French quarter Phantoms tour. Our guide was the Profes","useful":2,"cool":0},"amRE8agVz97ogP9Q-13XLw":{"text":"Recommend to everyone, my guide kept it interesting and fun. You walk around French Quarte","useful":0,"cool":0},"zWy9Hx0UJPcLKBIVnutNkQ":{"text":"The cemetery tour of St Louis #1 was awesome. Miss Angela is a great tour guide. I recomme","useful":0,"cool":0},"TKaYfMxHeXY4dLNePuUjEg":{"text":"Last night my fiance and I took the ghost and vampires tour with Luke! We had a great time","useful":0,"cool":0},"NNnCr8slicfPtti9VaaGEg":{"text":"We did the Cemetery Tour with Steve. He is fantastic! Funny, knowledgeable, local and extr","useful":0,"cool":0},"fKatygmUESUY0CySCLaUwA":{"text":"I was very pleased with the ghost tour on our trip! Our guide, Andrew, was great and spoke","useful":0,"cool":0},"2LbYk1MECk5cLs5gF3gwkA":{"text":"Had a fantastic time on the tour. Very informative, and our guide Thomas took the time to ","useful":0,"cool":0},"wa4DHmA904lbaX8jbO5h9Q":{"text":"Robert was a great tour guide. He took us to the cemetery. He even made a restroom stop be","useful":2,"cool":2},"c3cDrasxBsbGOJ7jhhqIUw":{"text":"I did the Music of New Orleans and the Cemetery tour with French Quarter Phantoms. I liked","useful":0,"cool":0},"e4pqY0GVvjH-Ro1tMcKMGg":{"text":"This is a walking tour covered about 2 miles in the French Quarter. Duckie was our tour gu","useful":0,"cool":0},"zuXIWjQIi-E3s41S8abKLQ":{"text":"The cemetery walking your was a great experience and our Trevor, our tour guide was knowle","useful":1,"cool":0},"1E8jgDEP9s4JrmL3c1ruzw":{"text":"This company was simple to find and made everything easy from buying tickets to touring wi","useful":1,"cool":0},"eTvI-pj-ouE0w7a1ZY7beQ":{"text":"I went on two tours from this company while in NOLA for Easter weekend.\n\nGhosts and Vampir","useful":0,"cool":1},"f4guTxEcowDgeJqizfcyGQ":{"text":"This was my third trip to New Orleans, but my first formal tour. Knowing the remarkable hi","useful":3,"cool":2},"7crd2ZQCPxlJfGuZL-OMUg":{"text":"We have gone on other tours within the French Quarter, and while they were entertaining- t","useful":2,"cool":2},"lIq8282BUFlzikk-kviMYQ":{"text":"We went on the Ghosts and Vampires tour a few weeks ago.  Our tour guide (young lady) was ","useful":0,"cool":0},"5bAfbANOeBuUFDZVU3elfw":{"text":"Awesome ghost and vampire tour! Tour guide was hilarious and exceptionally good story tell","useful":1,"cool":0},"tD_C2IzVxVWNyfQrAuulNQ":{"text":"My best friend and I are here from San Francisco first time to New Orleans and we just fin","useful":0,"cool":0},"j-q-JVFs0DsIenXbwifS_A":{"text":"I had an amazing time on their cemetery tour. I actually got a free ticket from Expedia, b","useful":0,"cool":0},"p_dUWBcpztqRq1n7URGcwA":{"text":"Update: is Stephen still there? We are coming back to nawlins and want to BOOK IT EARLY. T","useful":0,"cool":0},"GAARjwygvs2AjvHd8dqJlw":{"text":"The Ghost and Vampire Tour wasn't what I would have expected. For $16, it was a walking to","useful":10,"cool":1},"XHhsRU3Cq1THtpBpks8IUw":{"text":"We have been to New Orleans a half dozen times but never made time to do a ghost tour, whi","useful":0,"cool":0},"kNpkvgfpZgM6KmJ9_CRULw":{"text":"I LOVE ghost tours and I've done many. This was a letdown. It was mostly our guide I think","useful":1,"cool":1},"3sNCF95T9iZFB9fdPheWIQ":{"text":"I would like to take this tour again in the future! It was lots of fun and a lot of people","useful":0,"cool":0},"YRsk2k45Uj7oB9nrJ7WcJA":{"text":"Perfect !!!! Our tour guide was Angela I think and she was awesome we had a great time and","useful":0,"cool":0},"-9uRdwbn3py5UzhWEnamGQ":{"text":"Malik was I guide and I hope I'm spelling her name right but she did such an amazing job a","useful":0,"cool":0},"x7CsYO4rsk0oQcQOs3gQ6g":{"text":"We took the St Louis cemetary tour with LENA and she was AMAZING! We couldn't have asked f","useful":2,"cool":1},"z8F2VOSztH7xMNI3FM20jQ":{"text":"Our tour guide, Phillip was excellent!  There were 70 people on the Sunday night for an 8:","useful":0,"cool":0},"JpihgmRpJN6vB2sn_d7SUA":{"text":"New Phantom Music Tour with Justin was great.  I have been on more than  a few tours in my","useful":0,"cool":0},"2BMvbrYfRdIyfXoCz-JRdA":{"text":"My husband and I came to New Orleans on our honeymoon. We found a Groupon for this tour...","useful":1,"cool":0},"-iW2CK9pcV61ITwMGGDqRA":{"text":"This was honestly one of the better experiences of my vacation.  our tour guide was Malaik","useful":0,"cool":0},"j9oI1qhSirvr-1ifbnXAsA":{"text":"My girlfriend and I took the Cemetery tour and the Ghosts and Vampires tour. Both were ver","useful":0,"cool":0},"-wxXXiPBYfl_UiXooMXP1Q":{"text":"My boyfriend and I went on a tour with Trevor. Great guide! Keeps you on the edge of your ","useful":0,"cool":0},"jKfIXoAAtxWjOy3v9TldQw":{"text":"My tour was very informative, I learned some much more about the culture of New Orleans, V","useful":1,"cool":1},"JEsOeuHlzqPhYJ7MvigQ6A":{"text":"My boyfriend and I took advantage of a deal on Groupon and did the walking cemetary tour o","useful":0,"cool":0},"uPTaV7vHUXyCGEUdBIeEuA":{"text":"Excellent cemetery tour with Trevor! Full of fun and history - I loved his jokes and insig","useful":0,"cool":0},"tNUoCTWahJySH2xOPDxBvA":{"text":"We took a tour 10/8/15 after Jazz in the park. Our guide was Stella & she was awesome! Tol","useful":0,"cool":0},"P3git3wAgHPN4JcU3l39yQ":{"text":"This was a lot of fun. We took Hope's Ghost & Vampire tour last night and had a blast. She","useful":0,"cool":0},"I4SiVtoFkPnkKlUq_F40YA":{"text":"Our tour guide Ms. Blaise was very informative, answered all questions that were asked and","useful":1,"cool":0},"xZApFRS57JN3AmNe_sD9zQ":{"text":"Had a great night with our guide, Luke. He was funny, thoughtful and peaked our over activ","useful":0,"cool":0},"c-81PLrIdvG25mStN0PIWw":{"text":"We did the ghost tour at night.  Best time in my opinion.  It was about 90 minutes and a g","useful":0,"cool":0},"Wy7ytnf0nMGoffK2lS7zqg":{"text":"We did the ghost & vampire tour. Our guide Justin was great! Kept it interesting and made ","useful":0,"cool":0},"XnIORoTXWwnwUln5KGpDGw":{"text":"Pleasantly surprised. Based solely on website reviews, booked a tour for three. Everyone i","useful":0,"cool":0},"GH_DAwNv89iNV_QaklohIw":{"text":"Took the ghost and vampire tour with guide Sam. It's their most popular and so 3 groups de","useful":0,"cool":2},"blYrmVlUtb6EoksHQEXVWQ":{"text":"This walking tour was really well-done, especially when compared to another tour I did wit","useful":2,"cool":2},"IyBUGa-KXA7abgHqSYMzWw":{"text":"We took the ghost tour. Our tour guide was Luke and he did a fabulous job! Very knowledgea","useful":0,"cool":0},"fWG8BjVc-ZkfIz_krI9Fvg":{"text":"We had Phillip and he was an excellent story teller. Enjoyed the whole tour. Took one star","useful":0,"cool":0},"LBOXHbL_ksvDbnHtjlhylg":{"text":"We had such a great experience on our tour, lead by Justin. He was so knowledgeable and en","useful":0,"cool":0},"3ep7avC5KCdNCqh0WPmCLQ":{"text":"Our group of four took one of the ghost/vampire tours that departed from Flanigan's while ","useful":0,"cool":0},"Jc-1T_t7SgvS4s0yYexSIA":{"text":"My wife and I just went on the cemetery tour with Darty. \n\nThe tour itself was great and s","useful":0,"cool":0},"t4PDLD0D1s5LHY3rz1htMw":{"text":"This tour successfully scared the living crap out of me, but it was not my idea to go on t","useful":0,"cool":0},"J7OEue7Fi3EDbBhZ6F1MYQ":{"text":"I'm so glad we chose to do this! If you ever want to take a haunted tour, New Orleans is d","useful":0,"cool":0},"oQQo1bDInRiNsuCUSypLew":{"text":"This was awesome! Our tour guide Robert was really interesting! Will take more tours with ","useful":0,"cool":0},"rLZas3XmAe94kHl8-Igt4Q":{"text":"Last week was my first time in New Orleans, and a group of friends and I thought a ghost t","useful":0,"cool":0},"B3utCl-tKCdN4HACjgTREQ":{"text":"I took the ghost&vampire tour last friday, true crime tour with Thomas on Sat., and Cemeta","useful":2,"cool":1},"FIebsnHJV9GJHhQC9GuZ6Q":{"text":"Great tour, really enjoyed it. It was interesting and funny at time. Highly recommended.","useful":0,"cool":0},"9WpQkxGzcBadYL8LaVTlRQ":{"text":"I did A LOT of research before booking through Phantom. In fact, it was recommended by Jam","useful":2,"cool":1},"oadVBMcxjbFqPxRnrZSy-g":{"text":"Did the two hour cemetary tour on Sunday at 10 am and it was a blast! Not too hot, it was ","useful":0,"cool":0},"cpF1vAcRcAxFWKWbR6UpBQ":{"text":"Fun, insightful and interesting. Can't expect much for 15 dollars but it was worth it. Tou","useful":0,"cool":0},"aBWv4Jp-1rlkFJpLnwkZ9Q":{"text":"Sandy was a great, knowledgable and entertaining tour guide. Very fun and informative. I h","useful":0,"cool":0},"-6ZEjgjiCntq1bFvNFhhXQ":{"text":"I thoroughly enjoyed this tour when I visited NOLA in November.  The tour guide was knowle","useful":0,"cool":0},"hemCko0kIPhLz0oVkgL2rw":{"text":"This was probably one of the best things we did on our trip to New Orleans. This tour was ","useful":0,"cool":0},"A7WZd7D62UeXBEqIPp2BSQ":{"text":"I always wanted to try a ghost tour and thought this would be a good one. It's a walking t","useful":0,"cool":0},"Sgm33NWoWxzYtdbjtCq9Sg":{"text":"Hope did a great job of taking us around the French Quarter and sharing all the history an","useful":0,"cool":0},"D8nJ79nxCIgLf58DSWQuMQ":{"text":"We went on the Ghosts and Vampires Tour with Miss Tessy. She did an excellent job of telli","useful":0,"cool":0},"9G81pdDf7qspVrbedJavdQ":{"text":"hORRIBLE! So rude called to make a reservation and I have never had such horrible customer","useful":0,"cool":0},"NfGPQDueeL8JkpRv1-4-Ag":{"text":"What an amazing tour we had! With so many companies and options out there, my husband and ","useful":1,"cool":0},"fJxLpPk9x-re9rElGntiCw":{"text":"Did the ghost vampire your with Thomas who was awesome.  He get kept the tour interesting.","useful":0,"cool":0},"XsFyZtZwOcZ37mdEd--AIw":{"text":"Luke was hilarious and informative. I saw a review online by James Franco and I'm sure the","useful":0,"cool":0},"CPo9BzcbLNjQs5NQ7q_qqg":{"text":"The Ghost and Vampire Tour with Luke was quite fun. \n\nIt was a great tour to a couple of h","useful":1,"cool":0},"uC98dNuu3PZgi4cW9CrScA":{"text":"Enjoyed the cemetery tour, so glad we chose this one. We learned a great deal about New Or","useful":0,"cool":0},"ASVRw-PtvRh2o8l9xY9w4g":{"text":"Had a great time during the St. Louis Cemetery No. 1 tour! Was really fun and I liked that","useful":0,"cool":0},"m193guDAYoaQk9HwogVqVw":{"text":"A very cool, no BS, just-the-facts cemetary tour. Kudos to Blais for keeping it fun and in","useful":0,"cool":0},"HvOhetpYXq-iQM3G1km0qA":{"text":"Great tour! Aubrey I believe her name was, she was fantastic and passionate about her job.","useful":0,"cool":0},"5E5avFHc_zzMpayqzHEmvA":{"text":"Such beauty and history! So much better and pleasant than Bourbon Street! A lot of artist ","useful":2,"cool":4},"82a-kp7VzS88K4_zyk-atw":{"text":"My family and I took the ghost and vampires tour. Let me start off by saying our tour guid","useful":1,"cool":0},"oc8P_tGSiSxlUxUxyjTIJg":{"text":"For my first time in NOLA I wanted to do a cemetery tour (as it was highly recommended by ","useful":1,"cool":0},"wfR5bWx-yqyk9GExxalrhw":{"text":"the price was right for my family of three. we did the cemetery tour since i'm a fan of th","useful":1,"cool":1},"TsFbbxVy81lM5ZKfASa_ag":{"text":"Loved hearing the true dark history stories of New Orleans.  And with each true story of m","useful":1,"cool":0},"CQ-71cnu59Nv_XDdmNAEFA":{"text":"We enjoyed our cemetery tour with Tessy quite a bit. She had a good sense of humor and see","useful":0,"cool":0},"SAc4VZUwqGfDvM1wo-mF_Q":{"text":"We took the walking tour over Halloween weekend in 2012. It took me a while to write this ","useful":1,"cool":1},"h15FYYMJiZXNZGZmtqckUw":{"text":"Almost everyone that visits New Orleans wants to take in a little bit of history about The","useful":0,"cool":0},"eVRRaa0b_SL_VM2DFdRP0g":{"text":"Tour was amazing, and so was my guide. \n\nHad a great opportunity to visit back home re rec","useful":0,"cool":0},"AE-5FVEJl-WXwJHQvZxLXQ":{"text":"I thought this tour was reasonably priced for an hour and forty-five minute tour.  Our tou","useful":0,"cool":0},"6GOQcrPAWVqlSyK91OSJJg":{"text":"++\n- Blais was a phenomenal tour guide\n- 2 for one Hurricanes ($9) was great for waiting f","useful":1,"cool":0},"gAHeJ4tnsaoLRo6jAmim6w":{"text":"Out of all the ghost tours New Orleans offers, this is by far the best. The staff are very","useful":0,"cool":0},"ELFLS9zimqOllBpr3NYv9w":{"text":"I was in New Orleans in early November, and my family and I took a tour with Trevor.  It w","useful":0,"cool":0},"EmA_-8HqjCWXY6lfJJdnLQ":{"text":"We took the Ghosts and Vampire tour with Hope and the Cemetery tour with Robert.  Both wer","useful":0,"cool":0},"tv3MMQiqApiOgaDoLu5UPw":{"text":"Ok, so for Halloween, my friends and I thought it would be cool to take a ghost tour in th","useful":1,"cool":1},"k-k0fnMYVJqbOhJ0ZX9HMA":{"text":"The tour starts at the Voodoo Lounge bar.  You can grab a drink to carry with you.  Our gu","useful":0,"cool":0},"BeaKoUGxWIWTqbI59gPviA":{"text":"I liked this company so much we booked two tours with them while on vacation in NoLa. The ","useful":0,"cool":0},"Ca_iUgh2El6zJvE3jS8T9w":{"text":"We arranged a custom private tour for a family of ten, and it was honestly the highlight o","useful":0,"cool":0},"Gb3wr7U3Q5k3pvWf8L7a6g":{"text":"Snagged a groupon deal, which was hard to pass up! Justin was our tour guide for the Cemet","useful":0,"cool":0},"Xmc296tpwhoI3xjjnH8_Ew":{"text":"I am not sure why there are so many high reviews for this tour- there must be a lot of gul","useful":1,"cool":0},"a5UJLURXudRmxuf9GmLS1Q":{"text":"Andrew is amazing and really made this walk humorous and informative! He has so much knowl","useful":0,"cool":0},"GBSNE4XMvIF82Na95XzLlQ":{"text":"The ghost and vampire tour with Aubrey was fantastic! The way she told the stories of the ","useful":0,"cool":0},"uyyRxY0UPhhGw-hUxez6FQ":{"text":"We knew we wanted to do a cemetery tour when we got to New Orleans but we weren't sure whi","useful":0,"cool":0},"j5o996Z78ov-LUwv85LaFA":{"text":"My wife and I did the Asylum ghost hunting experience. We went to a boiler room and tried ","useful":2,"cool":0},"Gv4JchKc2T8HSD-HBloh2Q":{"text":"Tour was ok although some of our friends wanted to bail mid way through the tour, so we di","useful":0,"cool":0},"Bl6yqIjKFP5G4JGjEvzZAQ":{"text":"As I already had an appreciation for the history of the city, known and unknown, Sam's ene","useful":0,"cool":0},"nZbr7esst1uds7lGHtr7dA":{"text":"Booked the Ghost and Vampire tour based on the reviews, and it did not disappoint! Found a","useful":0,"cool":0},"AjwmxAeYJGNVmyGp9jhCWQ":{"text":"My family just did the Ghosts and Vampires tour with Trevor and we had the best time.  Tre","useful":0,"cool":0},"o70to1vKVf7sD33u80TwbQ":{"text":"My husband and I took the cemetery tour with Trevor. He was very knowledgable and quick wi","useful":0,"cool":0},"9xI81I0fe7Y0rcSdiSpBVQ":{"text":"Fantastic tour!\n\nMy friend initially booked the Saints and Sinners tour with them since th","useful":0,"cool":1},"2ePEqtBEFVkqCY8JAai3lg":{"text":"I went on Tour Treme and our guide was Duckie. He was fun and very informative.  I will de","useful":0,"cool":0},"lyuZcIf88imA9tPoxwTmfQ":{"text":"We came from NY and randomly chose Phantom St. Louis 1 cemetery tour from a Groupon deal. ","useful":1,"cool":0},"EZ6q-HkU73-PE2p6vjxVlw":{"text":"I had a great tour guide. She had the right amount of facts and witty sarcasm. I believe h","useful":0,"cool":0},"41bl4YQDGvVTiP_CMswhBw":{"text":"This was a very enjoyable ghost tour. We especially enjoyed the possible explanations for ","useful":0,"cool":0},"WLI5UKnaLJro9WYwb0XunA":{"text":"Very interesting and enjoyable tour. Our story teller was Bobby Thomas and he was engaging","useful":0,"cool":0},"-Y4zwbFKEs44mMDNShyoqQ":{"text":"Went on a ghost tour at 8pm w/ Luke.  Luke was a great story teller and had some pretty cr","useful":0,"cool":1},"a-M6tRr_M1KnzjONk7Xemw":{"text":"It was a interesting tour. I'm glad we took it and would definitely go again.  It was a gr","useful":0,"cool":0},"exNeRv3VanMC2BQOKa8ssw":{"text":"We did a ghost and vampire tour with \"Luke\" It was good....he was really funny and told us","useful":0,"cool":0},"bf7qrJvDY44zq_GHD0YLwQ":{"text":"Had a great tour with D'artagnana at St Louis Cemetery #1! She was well-informed and could","useful":0,"cool":0},"XHmaPIKk4ZCUBbHYkX0qMQ":{"text":"Great tour of St. Louis Cemetery No.1, on a cool, but sunny Sunday morning with our guide ","useful":0,"cool":0},"ok0PBcSeK7CP41e7umVWgA":{"text":"Fabulous tour, although alittle sketchy when you first begin the tour. You end up at this ","useful":2,"cool":1},"WJXYiZUPrTBDPWoH6kzkTw":{"text":"My wife and I went on a tour and absolutely loved it. We had Aubry and she was amazing. Fu","useful":0,"cool":0},"k_44jk4sonaGs1Xpiv0mSg":{"text":"The saints and sinners tour with Angela was amazing. Definitely one of the highlights of o","useful":0,"cool":0},"6rBlgjdljFndZaWueKoPNA":{"text":"Tessa was my tour guide for the ghost and vampire tour. She was great! Not over the top ch","useful":0,"cool":0},"9MUDG97Yht8YI-d9iEt-sg":{"text":"We took a true crimes tour yesterday evening and had a blast! Robert was our tour guide an","useful":0,"cool":0},"jEvx_4xz_vzfw76_RcivRg":{"text":"I knew I had to book a Ghost tour in New Orleans and glad I booked this company. I booked ","useful":0,"cool":2},"roINYtJWbtur_kurBmbrxg":{"text":"Took the cemetery tour and ghost tour had Susan as our guide she was excellent. We had so ","useful":0,"cool":0},"SolNxnHR4S4YthrYpeh9Vg":{"text":"So boring you walk but don't even see anything you can walk around the French quarter your","useful":0,"cool":0},"-voCfhiokyiMB8-xV8iAGQ":{"text":"Susan was our guide who scared the \"poop\" out of our kids (15 and 11) who thought this was","useful":0,"cool":0},"e91pV1RGqbDKq7C_Q8kbbA":{"text":"My aunt and I took a tour with Sandy and it was awesome! It wasn't as spooky as I thought ","useful":0,"cool":0},"64l1dUiRMKyj8KKFaKT6AA":{"text":"I could not be more pleased with our experience with French Quarter Phantoms. We took 3 to","useful":0,"cool":0},"Ezrw-LgJ90ryLn_wkV__og":{"text":"The check-in process was a little disorganized. Tessi was out your guide. We were unsure a","useful":0,"cool":0},"nFkKQLnpDldMAOEeFmBQKw":{"text":"Maybe I was confused about the tour?!  It was nice to have such a small group for the walk","useful":0,"cool":1},"E2vA650r8IJG-EIsZQBIeQ":{"text":"I have taken a few tours in New Orleans and so far I would consider this to be my favorite","useful":0,"cool":0},"At-UJqgVw4LdVlZyc25Ggw":{"text":"Great, very informative tour! We grabbed a Groupon for the Saints and Sinners tour, and ou","useful":0,"cool":0},"fqc5fZLN4BK5VGDvlRAGNA":{"text":"Went on the 8pm tour with Aubrey as our guide. A great storyteller who takes time to learn","useful":0,"cool":0},"XAQ-4pR7UWk2BJoRE8IXzA":{"text":"We booked a ghost and vampire your based on strong recommendations from a few of our frien","useful":7,"cool":2},"mmQiMwErDzt6x2lwKyctwA":{"text":"I took the tour this evening! Our tour guide \"Phillip\" was fantastic, he had our attention","useful":0,"cool":0},"JXsgqc_7P5SOx563tJBN9w":{"text":"We had Tesse as our tour guide and she was great. The tour was really fun and informative.","useful":0,"cool":0},"K6Kt_9tNQhDocR44yMadeg":{"text":"We took the Garden District/Lafayette No 1 tour and the Ghost and Vampire Tour, both guide","useful":0,"cool":0},"LDZHi7jPrrH0axv03u4pNA":{"text":"It was informative but I did not feel chills :/ and it has Hot! So bring a fan and cold wa","useful":0,"cool":0},"dZp1L0NyXd-od-E_OcyuHg":{"text":"We used a yelp deal here and had a blast. I thought it would be cheesy but it was super fu","useful":0,"cool":0},"FU52X-5mDthAVzdyZfhCVw":{"text":"Really fun True Crime tour. Thomas Webb was our tour guide and his storytelling is out of ","useful":0,"cool":0},"_XtGsc-qji01T2i1p2HFnQ":{"text":"As the trip planner for our girl cousins' trip to New Orleans, I was hoping that our first","useful":0,"cool":0},"UTuZGNqnblLHTtKRVUrIqQ":{"text":"Really, Really Enjoyed our walking tour. I wish I could remember our tour guide's name, bu","useful":0,"cool":3},"Ge41dUTDNkNyunMPV_aF9A":{"text":"We decided to book to this tour before getting to New Orleans. It had good reviews and now","useful":0,"cool":1},"xp0STx0ugfrQZt0i0nfMpQ":{"text":"Luke was a great tour guide full if interesting facts. It wasn't all about ghost I love th","useful":0,"cool":0},"p0JqXEwr0P4G2GrsLGcJ7A":{"text":"We did the saints and sinners tour with Hope and she was awesome! A great little tour of t","useful":1,"cool":0},"VYMOyrapE0IVlk2EcTM_rg":{"text":"Ny wife and I were very excited to do the Ghosts and Vampires tour during our first trip t","useful":0,"cool":0},"FwULYSF7AHI-sh7HFwI_Ug":{"text":"Great tour! Our guide, Sandy, was great. Very entertaining and informative. She was happy ","useful":1,"cool":1},"oRYclAOlJA5Va2JnZKrT6w":{"text":"We decided to take the tour since it was my husband and kids' (teenagers) first time in N.","useful":0,"cool":0},"P8j-ku1QdDJ1Khl8eVy4fg":{"text":"We had a great time on the tour.  We learned a lot about the history of New Orleans, not j","useful":0,"cool":0},"1T708VzSBURCkUjIWp7AOA":{"text":"This past week I had Dylan for the Garden District tour, Hope for the Cemetery tour, and R","useful":0,"cool":0},"SExCBPjRhGVNRP2t29sBYw":{"text":"Took the Saints and Sinners tour, and our guide Sandy was hilarious, very knowledgeable, e","useful":0,"cool":0},"rmLawkaQvr04mtL2-p477A":{"text":"My friends and I purchased a deal through Yelp. We chose the Ghost/Vampire walk and it was","useful":1,"cool":0},"KMsIaOVKEBpPfN0hmCjCmw":{"text":"We went on this tour with our family on our wedding weekend. Everyone loved it!! Our guide","useful":0,"cool":0},"n8A-mYfPeM5VtrfOs-xs6w":{"text":"Luke was a funny, informative, slightly irreverent haunted tour guide who took the time to","useful":0,"cool":0},"WBJAp4MN273kl_PyfNnASA":{"text":"This tour was fun and our guide, Trevor, obviously loves what he's doing.","useful":0,"cool":0},"SIAUAg69hb0GQVv9HO1wkA":{"text":"Ready to get spooked out I was brought an extra pair of underwear just in case , tour guid","useful":0,"cool":0},"qQ-epTxSJB5kiHsEsrLM9Q":{"text":"Hope for the cemetery tour was informative and charming. Kept us on a perfect time frame w","useful":0,"cool":0},"p8Lc6kyoPsPuFjhH5vIm7Q":{"text":"I got a groupon deal 4 tickets for $29 for the CRIME tour and was very impressed! we arriv","useful":1,"cool":0},"BImyqgd6luATChLmi3cNYA":{"text":"My friends and I have been on other ghost tours and this one is definitely the best! Loved","useful":1,"cool":0},"s6kErXbdIwgjXkqzeADyHQ":{"text":"We did the vampire and haunted night tour. Our tour guide tessy I think was awesome. Very ","useful":0,"cool":0},"i_uVxFZr4MYBGawWspnzDg":{"text":"Where do you spend your 40th birthday? A cemetery, that's where. We loved our St Louis Cem","useful":6,"cool":2},"QWFl3SJeJ-TXcg7fDJmlcA":{"text":"We did the cemetery tour and it was just ok.  Our guide Hope was informative but the tour ","useful":0,"cool":0},"FeMri9iHoglYQAo7RdBOSQ":{"text":"Fabulous!  Luke was our guide. This is the second time I've been on this tour in three yea","useful":0,"cool":0},"0_2ti88NWdovQN_Oli9r2w":{"text":"The tour was outstanding. Milika our tour guide went above and beyond to make sure everyon","useful":0,"cool":0},"TAUBNYstHtWbkDtkFsxNkw":{"text":"I had been to New Orleans before and done a Ghost Tour but my friend had not.  I wanted to","useful":1,"cool":0},"xwrJg4ayMfpptLM2JOVupg":{"text":"Wonderful tour. Luke was great. He told not only the history and presumed stories but pers","useful":0,"cool":0},"C5qbLQa5ljpe85depk6bXw":{"text":"Took our 3 children (7, 8 & 13) on the cemetery tour. Justin was our host & he was fantast","useful":0,"cool":0},"timpff-sek5N3OHb44O_sw":{"text":"We had Blaise for our tour guide and she was PHENOMENAL!!!  We loved her!!!  The tour was ","useful":0,"cool":0},"mMv01FEf0Dop9lTkhKS5hw":{"text":"We took the Treme tour after enjoying the ghost tour last year. Our guide Hope was very we","useful":1,"cool":1},"mcvrfxRSVrSaYcn_tuIVCA":{"text":"Booked the St Louis Cemetery #1 tour and was lucky enough to get Phillip for our tour guid","useful":0,"cool":0},"vcP2Dwqlc3fv5TyANHczIA":{"text":"Malika provided an exceptional tour. This is a fantastic group which provides an energetic","useful":0,"cool":0},"X2ALWfPAUsxB5ZDevGSvlw":{"text":"Great tour around the French Quarter. Our tour guide Artagnia (sp?) did an amazing hob on ","useful":0,"cool":0},"NCiYN6zMt5cKcNsu0Q4aCA":{"text":"There are lots of touring companies in New Orleans, but I highly recommend French Quarter ","useful":0,"cool":0},"hnOAXLjlGbBTove28u2wMQ":{"text":"Erin, thank you for such a fun night! This tour was well with the money and the time. You ","useful":0,"cool":0},"rP1ETGzo3I5oZbXsoVmBSA":{"text":"I LOVED the saints and sinners tour. Enjoyed our tour guide, Justin. He was fabulous with ","useful":0,"cool":0},"plYYXjf-L4dN4JyUU41-zg":{"text":"The tour was good - entertaining stories and provided a good history of some of the houses","useful":0,"cool":0},"tFUew0WFYDuvF-5kZFQVtg":{"text":"We highly recommend using Groupon to book your tour. We took the tour of St. Louis cemeter","useful":0,"cool":0},"0rNtGlGvumRdMMz0bFMjwA":{"text":"I just got back to hotel from my walk.... and I enjoyed it but wasn't head over heels.  \nP","useful":0,"cool":0},"CoNDgrNgl67DMooOilmewg":{"text":"Amazing cemetery tour! Luke was knowledgeable, funny and made the whole experience that mu","useful":0,"cool":0},"8wdC9htvBMtJPQ94iJ9zxA":{"text":"Really liked these tours! I went on two: Saints and Sinners and the Cemetery tour. We had ","useful":0,"cool":0},"yhyGUgbe6qyHJOHzwP2Vjg":{"text":"We had an excellent tour of the Garden District and Lafayette Cemetery with our tour guide","useful":0,"cool":0},"BOUhTVxA3Qt2-oIRjgzBPQ":{"text":"The tour was well done, our guide (Thomas) was great and not lame or overly cheesy as I ha","useful":0,"cool":0},"0ttuKuLzTvecp-Wucp2F5w":{"text":"My girlfriend and I come to New Orleans for Christmas every year and this time we decided ","useful":2,"cool":0},"lyNjPgoMuGYmdFwW7ptDnQ":{"text":"We took the Cemetery Tour and our guide was Susan.  She did an amazing job.  Our group was","useful":0,"cool":0},"7haETolm_vpSnaETLq-JbA":{"text":"Had a great time in this tour. Our guide Ducky was very informative and told stories with ","useful":0,"cool":1},"9hSPeG1LX6vi1uDC-L5eLQ":{"text":"This made my trip to New Orleans unforgettable. Hope was the best tour guide and really ma","useful":0,"cool":0},"R6sdJx4EfvHQNdDkLXIRoQ":{"text":"Great tour we had Evian as out guide and he was awesome. I took the cemetery tour with my ","useful":0,"cool":0},"ov2_WJl3eapUgFBTmeoY3w":{"text":"We found a great groupon deal for the Saints and Sinners tour and decided to give it a whi","useful":0,"cool":0},"Q6OortdwpQ9n_qHGWknz7Q":{"text":"Our happy alternative to the ghastly (pun intended) experience we had with Haunted History","useful":1,"cool":0},"Hb73Dvm5s-wi01IJlbodpw":{"text":"Our tour guide was Dylan for the Cemetery Tour. He was great and explained a lot of the hi","useful":0,"cool":0},"9JE7YJ18dEggsDBXQNiP_Q":{"text":"We really enjoyed the ghost tour!  Thomas was our guide and he was as great as they come! ","useful":0,"cool":0},"cLvlZUHhhFdHK5M-UZYPkg":{"text":"We had an amazing tour with Justin! The tour was a bang for your buck- only $16 for a two ","useful":0,"cool":0},"jWGPBXziuclSra8Yo-OCQg":{"text":"Excellent company and enjoyable tour. The guide was a cliche, referring to himself several","useful":0,"cool":0},"LwHqFZPgJrVZYVUiCKMlhQ":{"text":"We went on the city ghost tour one night. \n\nThis tour was pretty fun, though our guide wen","useful":0,"cool":0},"-mUks2kIbXnOuNEhlMBfPA":{"text":"I was absolutely impressed by how knowledgeable our tour guide was. I felt so excited by a","useful":0,"cool":0},"I2zmH57mSuLvN-bJTLndxQ":{"text":"The ghost and vampire tour was very good. Great history of area and buildings but not to m","useful":0,"cool":0},"epQXWtcSpE9yk2POSesXxQ":{"text":"Eveian was a knowledgeable and entertaining tour guide for our tour of Saint Louis #1. It ","useful":0,"cool":0},"leuNz9gnLZFhv9jvIIGhPg":{"text":"So many tours to choose from, but ultimately I decided on channeling ghosts and vampires. ","useful":0,"cool":0},"6lhysOOVkiu-WaaJEZxEqQ":{"text":"Me and my boyfriend REALLY enjoyed our tours. We did the Ghost and Vampire tour the first ","useful":0,"cool":0},"eYNBZwaahFXfLTb79CegEA":{"text":"Had a great time on the ghost tour with my family.  Justin did a great job of spinning tal","useful":0,"cool":0},"OLSFUN7JYDl-Yj3OP6mdXA":{"text":"We had such an amazing experience here! Our first tour was the vampire & ghost tour with D","useful":0,"cool":1},"J5UOhnCONr0dWDhvJfpUuQ":{"text":"I wish it was longer the night time tour was nice and he did a great job presenting but wi","useful":0,"cool":0},"EHDb28I3rSdLfx1DXmT3SA":{"text":"Hubby and I completed the Garden District and Lafayette cemetery tour yesterday.  Our loca","useful":0,"cool":1},"wMy7b6J67e25IMCAg0hqsg":{"text":"We did two tours with this company, and both were fantastic! On Sunday, we did the Ghosts ","useful":0,"cool":1},"tDnKDjE6bclBPIu_lBZgnQ":{"text":"Solid ghost tour, especially for the price. The drink specials are also really great. Only","useful":0,"cool":0},"A9W_D4b5UnsWQbKyi5quuQ":{"text":"Attended the Treme tour yesterday with Hope as our guide.  She was knowledgable and inform","useful":0,"cool":0},"pmFaZOYlOhidKUQHoHHmTA":{"text":"We tooke Hope's Cemetary tour and Madman's Ghosts and Vampires Tour.  Bothe were so fun an","useful":0,"cool":0},"MeZOzDHfdfAdWQp4Sx-OAA":{"text":"Trevor was highly entertaining, and the mid-tour drink break is an ingenious (and very New","useful":1,"cool":1},"m1HmRxjesLrVDLpQLGGmYA":{"text":"Wow!  \n\nI just took the Garden District tour with DarTanya.  She's fun, and knowledgeable.","useful":2,"cool":1},"kZ-7nqKwZzpxNozKD51w1A":{"text":"Yes, do it. It's pretty cheap and you'll get walk around the area. Might as well get acqua","useful":1,"cool":1},"39AcxiuIX7qJscVivCNBgg":{"text":"Hope you luck up and get Blaise as your tour guide!!! She's hilarious, engaging and very k","useful":1,"cool":1},"AzyFy54R6FwdfHwwTAihMg":{"text":"I took the Cemetery Tour as I was traveling solo and was told my many sources that you sho","useful":0,"cool":0},"UUfioP3G4Qowm0x2HQlPtA":{"text":"First my tour guide Liz rocked! Along with being extremely knowledgeable she also had her ","useful":1,"cool":0},"gAJaefnXCG9mRg27PuHstg":{"text":"My friend and I did two tours during our stay in NOLA.....\n\nGhost and Vampire tour: I want","useful":3,"cool":0},"mm371FBAI5WaOp1jmxxvxQ":{"text":"We took the French quarter ghost and vampires tour with EVEIAN. Let me tell you, this ghos","useful":0,"cool":0},"s1nE7odS8fGmW-uVH7gcrg":{"text":"Took the Ghost and Vampire your with Hope and she was awesome! Very energetic and knowledg","useful":0,"cool":0},"pIhCg4tYMxd7yL5PKMQWJw":{"text":"I've been on a ton of tours and the cemetery tour with Sam was on point! Had a great time ","useful":0,"cool":0},"HqVt60JceynzTbflaeKUbA":{"text":"The Ghost and Vampire tour was great.  I wish there were more stories and a little more ti","useful":0,"cool":0},"1R-YY8bbvY0aF7wO8ZaVzA":{"text":"I really enjoyed our Ghosts and Vampires walking tour with Aubrey. The stories were presen","useful":1,"cool":1},"fZvhIZobB81tIYf99kv1bA":{"text":"We loved the cemetery tour! We had 2 kids under two, a 12 and 13 year old, as well as thre","useful":1,"cool":1},"rCbaZOi_-d2W3l7l9o8bnw":{"text":"Please try the True Crime Tour. The guide was a great kid who told really interesting stor","useful":0,"cool":0},"rtyeWl58Ow_X0IMXrDghnA":{"text":"We had a great time on the ghost and vampires tour. Our guide Steven was very knowledgeabl","useful":0,"cool":0},"G22eoEquDYB3ZR-qGWtjRg":{"text":"We did two tours. Day one was the ghosts and vampires tour. Our guide, Justin, was awesome","useful":0,"cool":0},"OoCJAKNMweRv4hSwK-as0g":{"text":"Our guide Evian is a great storyteller and very knowledgeable on the history of NOLA. It i","useful":0,"cool":0},"RHcBgPGxNgJdUiG31VbbuQ":{"text":"Wasn't really excited about taking any walking tour at 8pm on a Friday Night. Especially a","useful":0,"cool":0},"aGQuxCG7nFtrJDPCtnxRWQ":{"text":"This tour was great. Sam led us through the Garden District and cemetery pointing out nota","useful":0,"cool":0},"v2YHdcEy5ttiM85d1uz8Wg":{"text":"We took this tour our first night in New Orleans, because I read great reviews on Yelp. I'","useful":2,"cool":1},"oCdUPeDMZO2kV2hdHsPozA":{"text":"This was my first tour of New Orleans. I was looking for something fun and spooky, and our","useful":0,"cool":0},"fjNzB3P9MRO2OzoeD7sQDA":{"text":"This tour was great and our tour guide Blaise was really knowledgeable of the how's and wh","useful":0,"cool":0},"rizTUiKnDGbQcbT60aSOVQ":{"text":"Our tour guide Robert was great!! History buff, could tell he knew what he was talking abo","useful":0,"cool":0},"PP1kuq6mXLfQoYfH0A_Ebg":{"text":"This is one of those things you do when visiting New Orleans. The quality of this tour wil","useful":0,"cool":0},"x8LiP9wU_vfhkpJJbdCj_w":{"text":"So much fun and Robert was excellent! Highly recommended! Don't miss this tour! The drinks","useful":0,"cool":0},"mJO1XpfaDAM0L-d0H2snpg":{"text":"We did the Vampire and Ghost tour the day before Halloween. Our tour guide, Hope was aweso","useful":0,"cool":0},"W-sMkVVFrDMBj_HeF0Walw":{"text":"Had a great tour of St. Louis Cemetary No. 1 today with Dartanya and she was excellent.  S","useful":0,"cool":0},"8lJcaUcleLkl_XAlA7-8Tg":{"text":"We were recommended to this company by a worker in a Voodoo shop which was (thankfully) mo","useful":0,"cool":0},"y2Si0esCOkMEVbKaoO7pAA":{"text":"We had Susan on the Ghosts & Vampires tour, and she was freaking awesome.  Knowledgeable, ","useful":1,"cool":0},"mTC5QIuapwv5T73x5HQiEw":{"text":"Went on the Ghost and Vampire Tour with Thomas as our guide.  I loved it! He was very info","useful":0,"cool":0},"zz8zz2_ZDwdQAV08PhlCwg":{"text":"Dartania did a great job! It was very informative whether or not you actually believe in g","useful":0,"cool":0},"QZCJITv_7k1mBlqwZrzsIw":{"text":"Bobby was our tour guide and I had such an amazing time! We did the ghost and vampire tour","useful":0,"cool":0},"BR59bV12MzKGgd9M9WJZnQ":{"text":"Very informative tour of the French Quarter. Amanda is a fantastic guide and does an aweso","useful":0,"cool":0},"NxvYYncBeDrzQka59ffaag":{"text":"Took the St Louis #1 cemetery tour with Dartania. Besides being a hot day, our tour was fu","useful":0,"cool":0},"YqmiMgBWXYuuRtzK_p5_zQ":{"text":"GREAT tour! GREAT guide. I was beyond excited and was not disappointed in our murder ghost","useful":2,"cool":0},"tYZrfYs46WI7ybnO-gPRRw":{"text":"Had a great tour of the cemetery this morning. It does get hot inside, but we were warned ","useful":0,"cool":0},"pdzOR6UY59EHdzEzKA7rqQ":{"text":"Super entertaining and informative. Our tour guide was excellent and we had tons of fun. G","useful":0,"cool":0},"8w1iipJZCVP9lIzMKEicaw":{"text":"Stella!!!  Stella was our guide and she was fantastic.  She was super quick witted and mad","useful":1,"cool":1},"sKiHHgrvFQz7IF0360Xh6g":{"text":"We did the saints and sinners tour with Justin. Easily one of the best things we did on ou","useful":0,"cool":0},"YXVCD3VQRuT5KQ5xacZPFw":{"text":"We had a private tour with Justin. He was very energetic, engaging, quick-witted, patient,","useful":0,"cool":0},"jd2ND8WGJrrRbvL2GC_NvA":{"text":"I always wanted to visit the cemeteries here, but never got around to doing it before this","useful":0,"cool":0},"Sdb4bDBv8sn3aDuyZlx3TQ":{"text":"Took a cemetery tour of St Louis I cemetery during the daytime with Dylan.  He was an amaz","useful":0,"cool":0},"BdtFJfCPK74KqkPjgavDJw":{"text":"The tour guide Aubrey was knowledgeable, energetic, and a lot of fun to walk around with. ","useful":0,"cool":0},"T_VOdbv5ydSAGFbKOHHtWw":{"text":"First time to NOLA, and although the St.Louis Cemetery tour was OK, the Ghost/Vampire Tour","useful":0,"cool":0},"2fqVMaMo5XxPzzYy3BOyDw":{"text":"Our tour guide was Angela and she was simply amazing. Very entertaining and knowledgeable.","useful":0,"cool":0},"vAavlOx0SKxvxWjrlyQjCA":{"text":"Just finished our tour with Bobbie (sp?) At the cemetery tour at St. Louis Cemetery No. 1.","useful":0,"cool":0},"gsbuLHYT5pl6y1l0Kd6XAw":{"text":"Trevor was a great tour guide on Thanksgiving! Super funny, super knowledgable. A great st","useful":0,"cool":0},"m36RtR1srNLxNHlDW7yn4A":{"text":"Stories are kinda scary, mainly historical stories about French settlers in NoLa.  I don't","useful":0,"cool":0},"0u4ZrPfARXucTX2_zF0GiQ":{"text":"I'm SO disappointed. We took this tour based on Yelp reviews. We could not have been more ","useful":1,"cool":0},"sAZIRUcSuAPAscsVBKwMlw":{"text":"We had such a bad experience with Magic Tours ghost tour that we left early, and bought ti","useful":0,"cool":0},"qMt_03cm2T35KztuAK0prQ":{"text":"I went on this tour because of all the reviews and was so sorely disappointed. Our guide w","useful":0,"cool":0},"e-3VReRSyRfVB052vquhog":{"text":"When we first arrived at Flannagans, we were disappointed to see how many people were ther","useful":0,"cool":0},"5aT09AJnPNbrkCMxWcVE6g":{"text":"There's so many tours to choose from in New Orleans, a free ticket offer from Expedia help","useful":0,"cool":0},"7Q3xeDifv8KwUs54qNpoRw":{"text":"Thank you Bobby T for the tour!! We were a rowdy bunch but you handled us well and we lear","useful":0,"cool":0},"38oQ-4rLRoCAYg6i4VPhFQ":{"text":"Aubrey was an amazing tour guide! Love how she talks about the history and gets you really","useful":0,"cool":0},"JoEl2cZ8F76KL7ghXlxaFw":{"text":"Was very impressed with Robin as our Tour Guide for the Saints and Sinners tour with FQP! ","useful":0,"cool":0},"kqTIMuWv11Dew6JjC5nLjA":{"text":"My husband and I had a great time on the cemetery  tour! Our tour guide Stephen was super ","useful":0,"cool":0},"Cl09T4i3VbFgNRU06BXVaA":{"text":"For someone that enjoys history and the idea of the super natural this is something I woul","useful":0,"cool":0},"bqlMUYGJhIQ6iyWz0ByiXQ":{"text":"We went to our first tour today; Saint Louis cemetery 1. Aubrey was our guide and she kill","useful":0,"cool":0},"CW0jatX8Xp9R0h72G10ajQ":{"text":"Awesome tour of the Quarter with Dartanya several weeks ago! She's a great story teller, v","useful":0,"cool":0},"o1cfhh8LTf-CuKUiRr-wnA":{"text":"Had a great time, the tour guide was fun and funny and told a good mix of stories - ones w","useful":0,"cool":0},"6OstWT2VhYj7qK_16fTRaA":{"text":"Stella! Stella! Stella! Our tour last night was great thanks to Stella. Her delivery was i","useful":0,"cool":0},"axJ9RSyeL6DuuyL_R7S96Q":{"text":"I took two tours with French Quarter Phantoms while staying in New Orleans, and they were ","useful":2,"cool":0},"4Huwp3yJu35Couoeflwr3Q":{"text":"I didn't think this was a great experience. They had way to many people scheduled and it w","useful":1,"cool":0},"2URGcPtHsKHJgzsiOxFKsA":{"text":"We went on the Garden District tour with Sam a week or two ago. I loved it! I got to see s","useful":0,"cool":0},"QSfUQDuknODGdTo-YHDYFQ":{"text":"Me and my girlfriend decided to do the cemetary tour while down in NOLA. It was so informa","useful":0,"cool":0},"gbG6HM6YnM3ezSJDi_s41w":{"text":"The St. Louis Cemetery No. 1 tour was really great. Evian was a fantastic guide; he made t","useful":0,"cool":0},"H3g62HHInP82DcHvEZ_tDw":{"text":"This is my second time doing the ghost tour with y'all and it never disappoints. Bobby was","useful":0,"cool":0},"yyxb4dg_3OoocwXHaNnAUQ":{"text":"St. Louis 1 Cemetery is only available to tour through registered tour agencies. It's clos","useful":2,"cool":0},"By4bvfCXnAlIn9QWWdjROw":{"text":"Great tour! Priced just right, and buy one get on free hurricane was a perk. Duckie is a f","useful":0,"cool":0},"Oo-UdxJlhskP6jZx_4KOCg":{"text":"We took the True Crime Tour.   The tours start in a pub (the sign is pretty visible from R","useful":2,"cool":0},"c8n08KEEzI97pFV2jUtd8A":{"text":"We did the Music Walking Tour! Justin was our tour guide and he did a great job! Thanks fo","useful":0,"cool":0},"lOC4rBjDGJnRePAPOJDyDQ":{"text":"We loved the ghost tour are Gide emily was soooooo nice your tour is amazing thank you so ","useful":0,"cool":0},"CpB-zqL14GFLJY5-dBzHZw":{"text":"I did the saint and sinners tour with Evian and it was so amazing. I learned so much, laug","useful":0,"cool":0},"Uu199HE5UnXYowjB07aTCg":{"text":"Took the Saints and Sinners tour today in the French Quarter. Our tour guide was Blaise an","useful":1,"cool":0},"i8j1YdM7-DevGpoDE76IAw":{"text":"My wife and I booked the Cemetery Tour at 1pm and thoroughly enjoyed ourselves. We met at ","useful":0,"cool":0},"DjJcPEBrjlhnAaAnbnbzIg":{"text":"We took the St. Louis cemetery #1 tour and our guide was Dylan. He had a great energy abou","useful":0,"cool":0},"_IE-u5-ZRgyFTOMl7eTksQ":{"text":"We went on a ghosts and vampires tour with Justin last night and had a great experience! O","useful":0,"cool":1},"OZA8uEjN5W6TTRgFBh97ZA":{"text":"We  were on Lena's tour of Cemetery #1 earlier this week and enjoyed it very, very much.  ","useful":0,"cool":1},"tfFpx57I_Sk7EFRTVNULUA":{"text":"Absolutely amazing. Our guide was so fun and knowledgeable. You get to see and hear some g","useful":0,"cool":0},"OkbNlzoyKJ55bbbql-pQXQ":{"text":"Great history stories, the tour lasts little over an hour, but definitely worth it.","useful":0,"cool":0},"mPZNKj7b7M5BeYTIF8sTjA":{"text":"We had the pleasure of being escorted on the ST. LOUIS #1 CEMETERY by Robert Not only was ","useful":0,"cool":0},"IrIkViKT6viCC2zkWgMAwg":{"text":"There are so many ghost/history tours in NOLA to choose from. I spent a lot of time resear","useful":0,"cool":0},"GOIfCN_IXDX0WsW_98K-Hg":{"text":"My family and I just came back from a tour with Erin she was very sweet & a great guide ! ","useful":0,"cool":0},"BFltr8ZkOJODpkRlYttepg":{"text":"Our guide, Dartania was a great story teller. She also had a fun sense of humor making the","useful":0,"cool":0},"qj8Ogt5aifoOc6TSTr3y8w":{"text":"I was a little skeptical at first based on the where we met and the wait for the tour to s","useful":0,"cool":0},"1fHbkggW1kj0VvCYwNYxhQ":{"text":"My husband and I did the Treme Walking tour on Monday, September 1st.  I must admit that p","useful":1,"cool":1},"F27EcpdMHdticK-kLN75fQ":{"text":"I did the ghost and vampire tour, it was a pretty large and engaging group. Our tour guide","useful":0,"cool":0},"Gw6ydSIQrBpLikiL9N43rQ":{"text":"We had tour guide Hope for both cemetery and ghost/vampire tour yesterday.  She was full o","useful":0,"cool":0},"V-RyUIDZAgPVvYpiNpp-bg":{"text":"I'm a fan of the paranormal so naturally I was drawn to this tour. Tessie was our guide an","useful":0,"cool":0},"lXK4gzhes7sPWNerVt75xg":{"text":"Excellent ghost tour. Trevor was knowledgeable, friendly and funny. Highly recommend this ","useful":0,"cool":0},"WmGnGQAQNO2O17mnIS2q3w":{"text":"Great tour by Elizabeth Z. She is a great storyteller and even had personal experiences to","useful":0,"cool":0},"eTCBYL_1tKdIQfNQ1jihAg":{"text":"Sarah is great and she takes no crap from the drunks that go on the tours. She was very kn","useful":0,"cool":0},"vn2eoCusd38QTqdka54ZiA":{"text":"Took the Saints and Sinners tour today in the French Quarter. Our tour guide was Blaise an","useful":0,"cool":0},"SAXdOL9ufxB0em17G4BcIQ":{"text":"Robert was amazing. Must do on your visit. Great tour, amazing photo ops, knowledgeable gu","useful":0,"cool":0},"7_hTJF62aROjpAZHVdcjdw":{"text":"This is the worst customer service I have experienced in recent years. Upon approaching th","useful":1,"cool":0},"SOgpTlQLLYMcoFvaTu74Gw":{"text":"Bobby did an AMAZING job. He had great puns, a charismatic attitude, and was a great story","useful":0,"cool":0},"5Nwu1odWdH_TE1j63MX0HQ":{"text":"We thoroughly enjoyed the whole experience of the cemetery walking tour with Justin! We go","useful":0,"cool":0},"a1vMeEKrqQKFiibn6Da7RQ":{"text":"I did the Ghost and Vampire tour and it was just alright. We got a young guy that wasn't a","useful":2,"cool":0},"dxpE71DJ_80uGXEX0YHcQw":{"text":"As a person who plans events and trade shows finding a partner who can help me entertain m","useful":1,"cool":0},"M04UFHssyJnUDeXDLsRDUQ":{"text":"This tour is very fun; the guides are well informed and really know the city. I highly rec","useful":0,"cool":0},"8ZVHcmb1zGsUuph3ya3G0Q":{"text":"I got our tickets on Groupon (2 for $16) and it was well worth it!!!! Our guide, Dylan, wa","useful":0,"cool":0},"7_ma4ayXTrtHOxY5HUnYGA":{"text":"Abysmal customer service. I arrived with friends but was placed in a separate group. Upon ","useful":1,"cool":2},"TCfhsleYXvHixgOWaD5-RA":{"text":"I took a walking tour a couple of weeks ago on my trip.  Our guide was Sandi and she kept ","useful":0,"cool":0},"zJm7_VkvpdKqRXlhxY8f6Q":{"text":"I went on the st Louis cemetery#1 tour with Ms Angela it was alot of fun she definitely gi","useful":0,"cool":0},"ArQH0M1oKCOLgkHVoSvwMw":{"text":"We did the Garden District tour with Sam and it was exceptional. He was thorough, funny, a","useful":0,"cool":0},"V39g98Hbqlkrxp1kjvRbhg":{"text":"My friend and I booked the Cemetery tour - St Louis #1 - which now you can only access wit","useful":0,"cool":0},"1_QBZJQ8_Do_1Zul3G-BVw":{"text":"Let me start by saying, I have taken 4 tours with French  Quarter Phantoms (Ghosts and Vam","useful":0,"cool":0},"5e8XxDRSDDUKMIObnInCAQ":{"text":"Malika (tour guide) and the Treme tour were awesome! Not only does Malika know what she's ","useful":0,"cool":0},"SYJtOowE2tSHbJPjyJCzmQ":{"text":"We did the cemetery tour.   There were many people in the group, but our guide Robin did a","useful":0,"cool":0},"Np71mmAIDCSYRxD4KrW27g":{"text":"This was my first time in New Orleans. Me and six friends were celebrating my golden birth","useful":0,"cool":0},"o0VtjnPQb3fudvdyfW4fyA":{"text":"We picked this tour because even the storytelling on the pamphlet had more personality tha","useful":0,"cool":0},"Eku_HLTwIl20LLeoWJv10Q":{"text":"Datri was our tour guide she was amazing funny, and extremely knowledgeable about the area","useful":0,"cool":0},"NDXdmRlGHE9hPoWRaN08sg":{"text":"We took the Saints and Sinners tour with Stella on a crisp cool day and it was a hoot! She","useful":0,"cool":0},"LvbtSbHURF6we8AOx3jkBA":{"text":"Justin is awesome! I had a tour with him two years ago and got him again today for the Cem","useful":0,"cool":0},"y3kikvZJR-sFsjPV5wEPNA":{"text":"Ms. Angela was great! She's a master story teller, animated and spoke clearly and loud eno","useful":0,"cool":0},"6cUVvzLlTnM-dthoi3407Q":{"text":"We just toured with Thomas on a ghost and vampire walking tour through the french quarter!","useful":0,"cool":0},"IAhjXK6BLgr3U_Nek_VZuQ":{"text":"MALIKA IS THE BEST!! I pray to god that you get Malika as a your guide. She is by far the ","useful":0,"cool":0},"sF5I13x5HzaVIWMU46UjNw":{"text":"Took the St. Louis 1 cemetery tour. Our group was small enough to ask questions and intera","useful":0,"cool":0},"OwzjJrYOK5xr6zOIzz6nbw":{"text":"Took the Garden District / Lafayette Cemetery Tour at 10 this morning. Our guide Dylan who","useful":0,"cool":0},"5ItuIWirFT-QBTjExfSUAg":{"text":"My wife and I went on the ghost/vampire tour with Bobby Thomas and man was it great! Bobby","useful":0,"cool":0},"nae6zUUHgcufJwCfvDQxJg":{"text":"We had a group of 13 that took the tour and got lucky to have our on tour guide.  We did t","useful":0,"cool":0},"ftgh1PDvhuY2EXd_9kPbiA":{"text":"Just went on the Cemetery Tour. Justin our guide was funny and informative. We learned a l","useful":0,"cool":0},"Hjv11beH8hrBEPbbypNYSA":{"text":"Awesome tour put on by our guide Luke. Excellent presentation / story teller. Very informa","useful":0,"cool":0},"f4Ff2SS8c8awsVzQQM9AKA":{"text":"We recently did this tour the last weekend in June. We opted for the 8pm Ghost and Phantom","useful":1,"cool":0},"HorZmVlQSRu-DJlrEi6uuQ":{"text":"I did the cemetery and also the ghost/vampire tour with Angela and they were both amazing.","useful":0,"cool":0},"g5sWcxbNXDmFH9j7s4QonQ":{"text":"Darty was phenomenal! She had so much information and such an amazing personality! Highly ","useful":0,"cool":0},"uMdk7K6yrxxSgvMVGIrlXw":{"text":"I should preface this review by noting my lack of prior experience: I've never been on a g","useful":0,"cool":0},"xxBdfZAG7nO0jVr6FV3TlA":{"text":"We scheduled a private custom tour for the cemetery/sinners & saints with 21ppl. We were g","useful":0,"cool":0},"firGtmE8RmkRM7FTDif1-w":{"text":"Luke is the best tour guide ever! He knew a lot and was really funny! I had a party of 4, ","useful":4,"cool":1},"85tXVrf63Me4wYKdqEXWTQ":{"text":"We did the Music Tour, and it was excellent! Tour guide \"Ducky P\" was superb, with great i","useful":0,"cool":0},"H_MLuJEZT608EZiiFBaDlw":{"text":"Justin was a great tour guide for the St Louis Cemetery tour. He was funny and very knowle","useful":0,"cool":0},"XLY1ePtv-uIT613povnfMQ":{"text":"This tour was awesome! Bobby was our guide and he was entertaining and helpful!! He was ab","useful":0,"cool":0},"13dKqH5iSbCyKQTBOrrRmA":{"text":"My wife and I took three tours with them, the Ghost and Vampire tour (with D'Artagnia), th","useful":2,"cool":2},"b-HC1Jj1QTR5Excd22ve0Q":{"text":"Our tour guide, Justin, was the BOMB. He was hilarious and knowledgeable. Totally suggest ","useful":0,"cool":0},"zOF_GdHU2QOVHG9su2qP6w":{"text":"I booked two tours with the French quarter phantoms and they were both great! Our first to","useful":0,"cool":0},"m_v1auefCf6U802nKwpiSw":{"text":"Enjoyed the Garden District and Cemetery tour and tour guide, Aubrey.  informative.  Worth","useful":0,"cool":0},"gDv20YLzy4oBAHyNwsDiLQ":{"text":"We took the Cemetery tour with Dylan and it was awesome.  He was very engaging, and sat wi","useful":0,"cool":0},"KECl765B-T84fVnD-op7aA":{"text":"I did the music and the ghost and vampire tour our tour guide was Sam both of the time. Sa","useful":0,"cool":0},"CMXe0wnnEAdLmiBCGL0f6g":{"text":"Dylan was the best! We learned so much from his ghost and cemetery tours. He is funny and ","useful":0,"cool":0},"szr7jBeEjyt9BQpyrbk5Jw":{"text":"We took the ghost hunting tour with Chris and Nick and it was a blast. The guys really kne","useful":0,"cool":0},"mDVk0lAZetU3uFZ3tKAFQw":{"text":"Angela was my tour guide what an awesome lady kept it lively  (bada bum) made sure everyon","useful":0,"cool":0},"n1FbRh9w4X6-yLpvkjqFLg":{"text":"90 minutes well spent in the French Quarter.  We did the ghost and vampire tour.  Justin w","useful":0,"cool":0},"Up-66uMj8KpT0q2bheR5OA":{"text":"I highly recommend this tour! I took St. Louis Cemetery Tour #1 and Lena was our guide. No","useful":0,"cool":0},"KGdqOnmShNR0x8AjZxKKqw":{"text":"Took the saints & sinners tour. Our guide Ducky was really knowledgeable and the entire to","useful":0,"cool":0},"JtEQn7KEH0Uvs4DjlvdQOw":{"text":"We took the Saints and Sinners tour with Aubrey, which was as much fun as it was informati","useful":0,"cool":0},"5pc697O-8VbUHjWrCKdG8w":{"text":"We took 2 tours. We had Justin for the Ghost and Vampires, then we had Sam for the Garden ","useful":0,"cool":0},"-5dOk4xbgd3N88PBdJ25qA":{"text":"Stella was a fantastic guide for the cemetery tour, I would recommend her to anyone! Funny","useful":1,"cool":1},"OloODOMUP92U044KdISwdA":{"text":"Sam was awesome! Very knowledgable, and very personable. My kids and I all enjoyed the tou","useful":0,"cool":0},"VgaU2POf3iEQ33Iz4WQ-lQ":{"text":"Ashton was an awesome tour guide. We did the Cemetery tour, using a Groupon, and learned s","useful":0,"cool":0},"9Ii0FqmVw_TfjYce_aqnKQ":{"text":"We took the Cemetery #1 tour and Rob was our guide. His funny wit provided such an enterta","useful":0,"cool":0},"xBn-002TNWgPM-9SALJ5wg":{"text":"Stella was amazing and considerate- providing entertaining commentary and accommodating al","useful":0,"cool":0},"3WcYFCKq1i5htGNT2YF-3w":{"text":"This tour was AMAZING! Robert did our cemetery tour, he was hilarious and informative! He ","useful":0,"cool":0},"PxbCaB0iAIu_0ptBhVeVWw":{"text":"We did the Ghost and Vampire tour with Hope. The tour was very interesting. Full of lots o","useful":0,"cool":0},"tstjrN9ZfiH-51CFBTwh6w":{"text":"Had our first tour of New Orleans with the Treme tour. Hope was our tour guide. She was fa","useful":0,"cool":0},"zDb4jg9MYot2l0q9GhPtOw":{"text":"Did the 8-10pm Ghost tour on Saturday Jan. 23, with my sweat heart.  Organized well, start","useful":0,"cool":0},"JA0yNzKzYGAK4rVZAW0Lbg":{"text":"Randomly picked a tour to see St. Louis Cemetery #1 and lucked out and landed with these a","useful":0,"cool":0},"Ado8CYF-aTYygWKUeUEsLQ":{"text":"I love Luke. An incredible tour!! Educational and creepy and definitely worth the time.","useful":0,"cool":0},"RNy55EJp3FyyPzqxFIZtUw":{"text":"I attended the cemetery tour and Robert was our guide. He was very knowledgeable and passi","useful":0,"cool":0},"ev1EUOr9SKpnNrEHho34tg":{"text":"We did the cemetery tour while staying in New Orleans for our anniversary weekend.  We had","useful":1,"cool":2},"UGaw9QoLQyLsp8KGiNRmsQ":{"text":"This was loads of fun! We had Hope as our tour guide and she was amazeballs. Seriously, he","useful":0,"cool":0},"AwRQTitBRv6fLXijGXzhIg":{"text":"I bought Groupons for two tours - St. Louis Cemetery with Robert, and the Garden District ","useful":0,"cool":0},"wI91TZn9DJDRj0cD0OsN8g":{"text":"Our tour guide, Luke Siddall, was fantastic. Ask for him!Loved the tour and learned a lot ","useful":0,"cool":0},"M1MW7TNJ9ZIhWxX6Ynfc6Q":{"text":"We had such a great time on this tour! Our guide Bobby Thomas was awesome and very enterta","useful":1,"cool":0},"8APNNlEpdaJb7Y7nc5PTTw":{"text":"I've done several ghost tours in the French Quarter over the past 20 years, and I think th","useful":0,"cool":0},"Lio9sOZMtYDIMCyv0T__bw":{"text":"Aaron was our 6pm tour guide for the ghost and vampire tour. She was very knowledgable and","useful":0,"cool":0},"ra7Gi8gTtL1lThuu9cVvZQ":{"text":"Guide wasn't good and more concerned with selling drinks and making sure we didn't get him","useful":0,"cool":0},"mNWSkgGiNd_NM0OqsCuJZg":{"text":"if you go, ask for Lee! he was hilarious and made the tour very enjoyable. definitely wort","useful":0,"cool":0},"5KBj9yj83EtFdAKfrY06UA":{"text":"We did the cemetery tour! It was a great tour and our guide was great! It is a long tour s","useful":0,"cool":0},"4aByj_7lM1L8nL2TC28BMg":{"text":"Worth it. \n\nWe enjoyed 5-7 stories over an hour walk. It took place around the out side of","useful":0,"cool":0},"JgA6rtQsLroVrTaBEveYxw":{"text":"This was one of my least favorite ghost tours I've ever been on.  We only stopped at maybe","useful":0,"cool":0},"sOaiWahgI81wzQ8-517xdQ":{"text":"Took the Cemetary #1 tour December 13, 2018, with Mikayla. She was an incredible guide des","useful":0,"cool":0},"iCkH_xss_yahLxzCM7_6_Q":{"text":"This is a great tour that is well worth the price.  We booked the Ghosts and Vampires tour","useful":0,"cool":0},"b2qXAmr1kdI_fORRyljnXw":{"text":"I took two tours with this company.  I enjoyed the first one so much that I booked a secon","useful":1,"cool":0},"BMhJfe6vX7QpOco-g0hQxg":{"text":"We went on the Ghost and Vampire your last night. Aubrey was our tour guide. We absolutely","useful":0,"cool":0},"4isIoq7WOhErZ_rflOaLxA":{"text":"My sister and I took the Ghost and Vampire tour with Justin on All Hallows Evening and had","useful":0,"cool":1},"o9bzOa4Py0GWjRJhJojMHw":{"text":"Just finished a tour with JUSTIN.  He took us all around the Garden District, providing fu","useful":1,"cool":1},"_jMa7AA06x7OVYkz8VA2AA":{"text":"Went on the Ghosts and Vampires tour last night with Bobby Thomas.  He was a great story t","useful":0,"cool":0},"KF1MlTQ_ZxJJOQeFVpVAnQ":{"text":"Amazing tour, even the group we had was awsome. Thank you Justin for our experience! Super","useful":0,"cool":0},"b2BdWiEJw1vUEVt3DCDN1A":{"text":"This tour was great!  Justin was a great tour guide and very informative and funny. LaLaur","useful":0,"cool":0},"sxcZqsRrE5bpytCdnHi_cQ":{"text":"We scheduled a custom tour (Similar to the Vampires and Ghosts tour) for a bachelorette pa","useful":0,"cool":0},"BCGe0zMFCy3A7fFFIj3HpA":{"text":"We had the pleasure of touring with Evian twice during our stay in New Orleans. Ghost & Va","useful":0,"cool":0},"zE8SzLRId7KKW7fHeETpUQ":{"text":"PEOPLE THIS IS THE REAL DEAL, DONT GET SCAMMED. \n\n\nOk so with that said, this was my secon","useful":2,"cool":1},"b09Pseq5J2kdhp1i_aRcYg":{"text":"If you're a first timer to New Orleans as my wife and I were you MUST take a walking ghost","useful":0,"cool":0},"-_ovs0stHhQLupnqpeNSuQ":{"text":"I went on the Ghost and Vampire tour with a group of four friends. I think our total group","useful":0,"cool":0},"1fzPN9HbxyROVh0iW23-rA":{"text":"This place is located inside the bar on the corner of the street. Theres a 2 for 1 hurrica","useful":0,"cool":0},"K-31h4xk6t5EDEKw870-aA":{"text":"This was a fantastic decision! We were visiting from Connecticut and we persuaded by Cap, ","useful":0,"cool":1},"amJrh6mg2nVWQTz8zE-OSw":{"text":"For as old as New Orleans is, you have to figure some creepy shiz goes on here, and while ","useful":6,"cool":3},"ihc9YkblwyOKVtjZTFuMXQ":{"text":"We just finished the Garden District and Lafayette tour with Sam. He was extremely knowled","useful":0,"cool":0},"eRlqKEl1ubKbb4kNQGd7xA":{"text":"I did the ghost tour and the cemetery tour while in New Orleans.  Thomas and Trevor were a","useful":2,"cool":0},"7IwrlI9mvgj2WvUbBveZhA":{"text":"Our tour guide was Miss Stella-highly recommend her!! She's very knowledgable about the Tr","useful":0,"cool":0},"gTtXZsvmPc-8jrL9aryJIw":{"text":"We had Ducky as a tour guide. He was FANTASTIC. His energy was great and he came off as su","useful":0,"cool":0},"L1FhZfLTKP5AnX5au7s1yg":{"text":"Great ghost and vampire tour with Angela as our guide. She was super knowledgeable and ani","useful":0,"cool":0},"hEcuj_iJZG4fnqkExHJdTQ":{"text":"My husband and I took the Garden District and cemetery tour and had Ducky as our tour guid","useful":0,"cool":0},"xW8S-aH2RQWUyUNLC3NO9g":{"text":"Awesome tour put on by our guide Luke. Excellent presentation / story teller. Very informa","useful":0,"cool":0},"s3wB1fuwctfueTQNp-oJrg":{"text":"Tour was awesome and highly recommend it!!  Our tour guide, Angela, was excellent!! Energe","useful":0,"cool":0},"LZmFtaTVUOhxf-cjxWBQNg":{"text":"So glad we went with French Quarter Phantoms, we actually did the Garden District and Ceme","useful":0,"cool":0},"g96MZAjEwpVwPNIBSEuvcQ":{"text":"By far the best tour in New Orleans. Ducky was knowledgeable, witty and entertaining. Well","useful":0,"cool":0},"OzsEs9UeGlUmiOupJUeA2g":{"text":"This was my third trip to New Orleans, the previous two I took in 2010 for Mardi Gras and ","useful":0,"cool":0},"ipFDDMBl0H1JBln2x_8iCQ":{"text":"This was our first time in Nola and French quarter phantoms was recommended to us by a fri","useful":0,"cool":0},"OPqpF7sKgIpt2wFNNo0D7A":{"text":"First time in New Orleans and this was a great tour! Robert was an awesome tour guide, def","useful":0,"cool":0},"s5J8gtumwg2WrWYcp40hGQ":{"text":"We did 2 tours. First the Ghost and Vampire tour with Luke. He was really great at story t","useful":0,"cool":0},"YJexFis-GncegSvB-cCpsw":{"text":"We did the St. Louis Cemetery #1 tour with Lena (her name tag said Eileen) on a Sunday mor","useful":1,"cool":0},"YnSbbkt2zFj42Ts2W45E4w":{"text":"We had a phenomenal tour of St. Louis #1 cemetery with Dylan!   He was super engaging and ","useful":0,"cool":0},"tTKINBM-Da-o8pHUF9-GcQ":{"text":"Had a great time at BOTH the St Louis 1 tour and Ghost tour.  Both tour guides Justin and ","useful":1,"cool":1},"Hvyzib-NeWKZH7cIPSgUbw":{"text":"We took their St. Louis Cemetery walking tour and really enjoyed it. New Orleans is full o","useful":0,"cool":0},"vhGRw9SWVVzKE4UWt0crnw":{"text":"I took this tour the night after enjoying some Mardi Gras parades and I'm so glad I dragge","useful":0,"cool":0},"4Vlg4KcN0AD_Gxy1p41YWw":{"text":"Booked the ghost and vampire tour online just a couple of hours before the tour itself. Wa","useful":0,"cool":0},"LfiRmcaCoJAY1gyyg--X9Q":{"text":"WOW. Loved our tour. I can't remember the name of our tour guide but he was amazing. Born ","useful":0,"cool":0},"0w3dzE_g3PncZTFNK7mJgQ":{"text":"Took a tour with my friends from Arizona and were highly impressed with the extensive know","useful":0,"cool":0},"SnMO0Dglphdvr04_GRvAdQ":{"text":"Hubby found this place on yelp. Lucked on and booked a Ghost and vampire tour with Justin ","useful":0,"cool":0},"Wlm2wRbbakhhCy-Lpv_GPg":{"text":"We came here on our vacation for the Saints and Sinners tour. Our guide Hope did amazing a","useful":0,"cool":0},"ylsjnjtefzcVK1UYWBJAoQ":{"text":"Great! Tour guide was fabulous & informative. There are a lot of options to go with for gh","useful":0,"cool":0},"ia1n0BDMKiA_Z8NvxLZqBA":{"text":"My partner and I decided to take the tour of Treme, and surprisingly found ourselves the o","useful":0,"cool":0},"x6TLjwh1L5u1_Q5ctDiklw":{"text":"We loved it. Our tour guide, Erin was a fantastic guide to the French Quarter spirits....a","useful":0,"cool":0},"S1l2fjbA3hhnETYvooCYFw":{"text":"Great tour, amazing guide! Lori is awesome. She was funny, informative, and just a pleasur","useful":0,"cool":0},"F7zOrYAB_1xGfeX8zU3DLQ":{"text":"Maybe I've been spoiled by the best tour in the business (Blue Orb Tours in Savannah, GA),","useful":1,"cool":0},"DikDK7e3GDMprD2ZNgLg9Q":{"text":"Truly miserable experience. Be prepared. They will leave 20 minutes ahead of schedule then","useful":0,"cool":0},"6Z3skjCLcMpdRJhQkiznGg":{"text":"My friends and I just took the Garden District tour and it was awesome. Our tour guide Dar","useful":1,"cool":0},"oYA95Szn1ap7dZVDTuQXVQ":{"text":"We did the saints and sinners tour with Justin recently.  It was a typical hot humid day i","useful":0,"cool":0},"kxGQqT_wSJ-egyM-RYp3uA":{"text":"My sister and I took the Saints and Sinners tour with Evian and it was SPECTACULAR!  Evian","useful":0,"cool":0},"QDRPdRFWt96e-ZQeWBIQmg":{"text":"We actually did 3 different tours through French Quarter Phantoms, the Ghost Tour, the St ","useful":0,"cool":0},"2tl-8_TcPUPVy2jtCYjWqw":{"text":"This is a review of their Ghosts and Vampires tour. I had my 8 year old daughter and 13 ye","useful":0,"cool":0},"vkgKUqEkcC58XQZuufO9NQ":{"text":"We took a Saturday 6 pm tour, with Luke as our guide.  The ages in our group ranged from 1","useful":0,"cool":0},"IRleMoCI5gB9aM1VrRZlZg":{"text":"Did the ghost tour with these guys.  Was ok...given all the excellent reviews, I was hopin","useful":0,"cool":0},"M06dowgr9NBBXZV7lK_xmA":{"text":"My husband and I recently went on 3 tours with French Quarter Phantoms. I am glad we went ","useful":0,"cool":0},"-uN8yULb8A3BB0nqqs22NA":{"text":"My husband and I did the St. Vincent's Ghost Hunt with Chris and Nick and it was an experi","useful":0,"cool":0},"akJOQTUJquKwTZ5QLC5FVw":{"text":"Dartayna was a delight. We recommend her for anyone coming to New Orleans. She's a wealth ","useful":0,"cool":0},"VaBgF_WwPx_yGWtrbEGXYA":{"text":"I've taken this tour before and I was very disappointed this time. The City has allowed wa","useful":0,"cool":0},"8lfdyIck_enZC5Wz42Hi2A":{"text":"We had so much fun doing the ghost and vampire tour! Justin was so funny and very knowledg","useful":0,"cool":0},"Fc3OdKKWn5SNFbHuuCxsIw":{"text":"We came tonight with 5 total, 2 adults and 3 teens. We did the 8pm tour, it was spectacula","useful":0,"cool":0},"eJqYmnDFC5RynMMg_q0Wew":{"text":"Just took the French Quarter Phantoms Ghost &Vampire Tour with Hope. She was just terrific","useful":2,"cool":0},"g2Nj-JV8iF5j7_j-8jODzQ":{"text":"We're big paranormal enthusiasts and were looking for a good spooky ghost tour to do and m","useful":0,"cool":0},"KU8gAGX5hOpPr7X9o6Gwpg":{"text":"I was part of a party of 16 in the city for a bachelorette and we had the tour guide Stell","useful":0,"cool":0},"FkVjWItJdHoAwaLIBz2Pnw":{"text":"Robert was the best tour guide ever! \n\nHe was super entertaining, knowledgeable, and engag","useful":0,"cool":0},"k5ySHn0DZF3Jt8vMK0eODw":{"text":"Ducky was awesome! Learned a lot about the Garden District, and he was very knowledgeable ","useful":0,"cool":0},"MB-NmFQbBVoPMU-2Nfw5HA":{"text":"We had Luke as our tour guide, and he was awesome! Very historical and spooky stories, eve","useful":0,"cool":0},"KgO5kK5X--mvOma2hwWrsQ":{"text":"Great time on the ghost tour with Justin. He was awesome with his stories and legends.","useful":0,"cool":0},"MSB_YLBuIXPwSbcBNnodqA":{"text":"I have always wanted to do a ghost tour in New Orleans, and this one was recommended by th","useful":0,"cool":0},"kkhJmliQSehIBtWFJJn0IQ":{"text":"We went on the ghost tour. We loved it. We had a very entertaining guide who kept us inter","useful":1,"cool":0},"iJOjxckJNOqo01oJeBQc1g":{"text":"Luke's discount tour went really well!  It was quite knowledgeable and we enjoyed the vari","useful":0,"cool":0},"OUKGkNvlf6FhnY2ChGdIkw":{"text":"I would give this place no stars if it was an option. This is my first day in New Orleans ","useful":0,"cool":0},"7jihTKPZ9lQ9iPG_A_mkHA":{"text":"Tour was cool and Luke our guide was friendly, knowledgeable and entertaining. The stories","useful":0,"cool":0},"1KWn6ef5dJOslOxp-_JWQQ":{"text":"The ghost tour seemed more like an excuse to drink than to actually listen to stories abou","useful":2,"cool":1},"ruxoqJAZxoCWyO1sA3vHbQ":{"text":"I took the cemetery tour with Hope. Advice: if this is your first time in Nola, try to do ","useful":0,"cool":0},"1NqtDv4CZTNvbUnyNOuLWQ":{"text":"So so so fun and worth the entire $14 that we paid for the tour. Our guide, Justin, was a ","useful":1,"cool":0},"z1aGOPIV5Erxsmd-iBWIdQ":{"text":"We took the Saints and Sinners tour with a group of 10 people. No one else signed up so we","useful":0,"cool":0},"VEEjfHB2E7EvaRub1Uz04w":{"text":"We did two tours with them! Very informative and fun! Cant wait to come back to NOLA and d","useful":0,"cool":0},"ou6ny8vSbioyb_QO61e5Cw":{"text":"We met up with our tour guide at Flanagan's Pub to spend an evening with spooks. For the n","useful":0,"cool":0},"Sqb5PytsrbR8T6wsa40f9g":{"text":"Took the garden district and la Fayette cemetery tour with our entire family. Our tour gui","useful":0,"cool":0},"mp13JzZMf9l_bH3wypVwCQ":{"text":"Do the True Crime tour with Thomas!  He is knowledgeable and a fantastic story teller with","useful":0,"cool":0},"u5G6qZlbfBgnRqG4Oqn7KA":{"text":"The Ghost and Vampire combo tour with Malika was FUN, informational, incredibly interestin","useful":1,"cool":0},"i72yoJIjNADg4Vn3TvBNRw":{"text":"We took the cemetery tour, it was super informative, we learned a lot about the cemetery a","useful":1,"cool":0},"Lbjg32_xEBoW8dNlFqa4iA":{"text":"It was my first time ever visiting New Orleans and I went on Halloween weekend, so natural","useful":0,"cool":0},"wMdVZJHExG2MisPQ7Bx9JQ":{"text":"Wonderful, enjoyable, educational tour.  Erin is a fantastic guide.  Made me love New Orle","useful":1,"cool":0},"ZowmcqeoqhcQ1QO3Josy8g":{"text":"My husband and I were just there this afternoon, and it was great. Our tour guide Robert w","useful":0,"cool":0},"EXvMF-ZynNcD5dIQkXT4Rw":{"text":"Angelica was our tour guide. She was amazing with great historical facts!  She was also fu","useful":0,"cool":0},"ME7_SC1Imb9svV7m_KIfMA":{"text":"Malika was an amazing guide, she was sarcastically funny, good historical context, made us","useful":0,"cool":0},"IVewoaVJqEK51pYEuEtYqw":{"text":"Hubby found this place on yelp. Lucked out and booked few tours with them.\n\nGhost and Vamp","useful":0,"cool":0},"pmVqcjY9pJhVEWwEML1a5Q":{"text":"As a librarian, I appreciate good storytelling that engages the audience. Ms Stella and Mr","useful":1,"cool":0},"0Vkkc_foak_OCeyE6JCTSg":{"text":"Erin was an amazing tour guide who was so personable and quirky! My husband and I just had","useful":0,"cool":0},"LUMFbOYgNI7xMcs0wHjaqQ":{"text":"Our guide was Stella and she was excellent! I loved the way she told the history of New Or","useful":0,"cool":0},"2g4ZIh2B0lvZSHnzlr95gg":{"text":"Fantastic tour, exceeds all expectations I had! Erin is an absolutely amazing guide!!!! Hi","useful":0,"cool":0},"LjwOUMPcxQwaCxXqgK581w":{"text":"Thoroughly enjoyed the True Crime tour with tour guide Robert. It was a slow Sunday and a ","useful":3,"cool":1},"Q9PGMTaXlX5_M5MAOa9SzA":{"text":"We did the Garden District Tour today and had a fun and interesting time. The tour guide, ","useful":0,"cool":0},"-s0bKuSkK4o_J4HQGNV0jw":{"text":"We booked a Ghost and Vampire tour online...quick and easy. You show up at the Voodoo Loun","useful":0,"cool":0},"jDs-NCi35fJpYGVsQnQXFg":{"text":"Angela was the best tour guide I've encountered thus far on all my touring the US. She was","useful":0,"cool":0},"VKN4d6R079grGGwag8E8Mg":{"text":"Had friends come in town who wanted to do a ghost tour. I spent a week researching to find","useful":0,"cool":0},"V8UHQTXPY3CASNS4GpPL-Q":{"text":"We were recently in New Orleans and stopped in Flanagans to have a beer on our first night","useful":0,"cool":0},"VrWN5HZ7xGCEjAS8HLfGLg":{"text":"If anybody is looking to find an informative tour guide, I Highly HIGHLY HIGHGGLHYLYHYLHY ","useful":2,"cool":0},"OxC_0OJgHKJSo3b5017VZg":{"text":"We took the St Louis Cemetery No. 1 tour with Trevor and had an excellent time. Trevor is ","useful":1,"cool":1},"hcnAyfjubWxptWYAC_3-Cw":{"text":"Maybe I need to stop going to NOLA and taking tours (just kidding) but I definitely go wit","useful":0,"cool":0},"gAXBL_lGvg2Lfj4Gp60VBA":{"text":"My friend and I did the st vincent's asylum tour. It was a good time we got a lot of activ","useful":0,"cool":0},"G6YLjRTyV5ML1FTZTmXu5Q":{"text":"My sister and I did the St Louis Cemetery #1 Tour, and it did not disappoint. Justin was o","useful":0,"cool":0},"R0LLuhryV6zt4CXdEWLZZA":{"text":"Tour of St. Louis Cemetery #1. Ducky is quite the entertaining character! I love that he d","useful":0,"cool":0},"aTPRVXCFYGqmvpVMCI4XNw":{"text":"We didn't know what to expect on this tour but it was great!  Our tour guide Angela was a ","useful":0,"cool":0},"lYvlsVV28l8VXwmmJPgguw":{"text":"Did the Ghost and Vampire tour. \n\nJustin was our tour guide and we couldn't have been happ","useful":0,"cool":0},"6gh51FPJ884j6VbRQ2ssZQ":{"text":"Definitely not a scary tour but a pretty interesting tour to go on if you have some time t","useful":0,"cool":1},"76npCCA5iQx3SoqFCbGFLQ":{"text":"Loved the two tours my husband and I took with French Quarter Phantoms! We did the Cemeter","useful":0,"cool":0},"2xYjiOhw8MnoavjGpnqLgw":{"text":"We loved our \"Ghost and Vampire\" tour with Bobby Thomas! You can truly tell he loves what ","useful":1,"cool":1},"gT7PfFQSMM4XQ6Zo24acHA":{"text":"Two words: Bobby. Thomas. The man is a mother(redacted) national treasure. He has such a p","useful":0,"cool":1},"x9KDSI6-BYp720FD5eZJyQ":{"text":"ive done 3 different tours with french quarter phantoms and i can not suggest them enough.","useful":6,"cool":3},"ee4m3DXy5r8YMPpF4O5FvA":{"text":"Bobby Thomas was awesome! The tour was splendid and my boyfriend and I loved it! So entert","useful":0,"cool":0},"q08Tg3h5jsqA9kBrd9YTfg":{"text":"I had a great time on my ghost tour!!! The folklore & history were fascinating, and it was","useful":0,"cool":0},"na2GHTcFqlXvul72lwi2og":{"text":"This was the first time in New Orleans, and we were looking for a Ghost Tour. This was our","useful":0,"cool":0},"BYpvI6vfYwxa5leCJwhzSQ":{"text":"We took the ghosts and vampire tour with Lee.  It was great.  Lee was a magnificent guide ","useful":0,"cool":0},"hLLNH7x721JryCYSfezJLg":{"text":"First time visiting NOLA and was definitely going to see St Louis Cemetery #1. \nFound this","useful":0,"cool":0},"jx68XPoGuJFAGHzj0IwwiQ":{"text":"Our tour guide was very funny and informative. We did not get to go into any buildings, wh","useful":1,"cool":1},"nOG0v3GT7O4b3x2mEHLNDg":{"text":"Great tour of the oldest cemetery in New Orleans.  Robert was our tour guide and he was ve","useful":0,"cool":0},"3MHasvzqqEXmNj4mKytA0w":{"text":"We had the best time with Robert during the Cemetary tour - highly recommend! He's the bes","useful":0,"cool":0},"nFydQb9SlWWUH-Q_QEfNjg":{"text":"This is our first visit to Nola. We got our tickets from Groupon where we paid $16 for two","useful":1,"cool":0},"iKtIhB6EqafAFCSdVT0KnA":{"text":"No, I don't believe in ghosts or phantons or spirits or whatever, but this is a must do in","useful":3,"cool":0},"dA_FIECW-cYVcIthBDVD3Q":{"text":"My wife and I both enjoyed our ghost walk very much.  Hope, our tour guide, was entertaini","useful":0,"cool":0},"B1zdAupiMrpoEqdr8FUhWw":{"text":"First yelp review! Aubrey was our tour guide for Saints and Sinners. She's very knowledgea","useful":0,"cool":0},"X4RvMsnGD2A-5TEBaL9zGg":{"text":"Awesome Tour by an awesome guide. Angela was fantastic! You get an up-close-and-personal l","useful":0,"cool":0},"39rQpzjV7lxVVYvqIQ7Wcg":{"text":"Whole thing was fun, from beginning to end. Steven made every guest feel welcome and kept ","useful":0,"cool":0},"PxTbr7x_XBiyeIud4FAU2g":{"text":"Did the cemetery tour with Hope....and she is awesome, very knowledgeable, fun and engagin","useful":0,"cool":0},"Sd52lAfGbZsFv0AYQtrm5g":{"text":"Our tour guide was Erin, and she was awesome! Very knowledgable and kept us entertained th","useful":0,"cool":0},"rDEJT2YcxwWo1QGoAk30Gg":{"text":"My husband and I took the cemetery tour from Malika and loved every minute.  We learned so","useful":0,"cool":0},"1iw2YGEwHUhqP7IRNK9QFQ":{"text":"Took a ghost tour and had was very entertained. The giant Hurricane that is offered at \"ha","useful":0,"cool":0},"OIb_w6ZkVvydV6vjuFjviA":{"text":"Steven, our tour guide, was awesome. He is a true New Orleanian and gave great detail and ","useful":0,"cool":0},"T5VTgBTcfReD25AhYeNPsg":{"text":"Malika did our tour of the cemetery and it was AWESOME! She was very knowledgable and funn","useful":0,"cool":0},"aeGY1FXiXe8cK8LuUUvbfw":{"text":"We did the St. Louis # 1 cemetery tour with the magnificent Justin.  We got a great deal o","useful":0,"cool":0},"IxWEXRGQWVzrRb9QJWpCEA":{"text":"Lizzie was amazing! Knowledgeable, charming, made the evening a wonderful and intriguing e","useful":0,"cool":0},"HPYcWVwWFDb67oJQ2zBBGg":{"text":"This was an excellent tour, a huge part was due\nto our amazing tour guide, Hope!\nShe is an","useful":0,"cool":0},"QIHl9YXVx3o1SxT8DqgNYg":{"text":"Steven did a great job. I was a little nervous at first because of the size of the group. ","useful":0,"cool":0},"WOXQ4_WwpcB0GnhZQqYAeg":{"text":"Had a fun cemetery tour with Robert. He was   very knowledgeable about the local history a","useful":0,"cool":0},"INOQv2FT3qMp4d0DZWJXRQ":{"text":"Did the ghost and vampire tour this past Sunday with my niece at 8pm and hate to say this ","useful":3,"cool":0},"63Cws_c1MKiW1_N_x5i07w":{"text":"Do not hesitate to book a tour with this company. Wife and I knew we wanted to go on a cem","useful":1,"cool":0},"YNEc5ZxhD2sY1SZUO-3YTg":{"text":"Really cool and informative. Our guide Evian was so awesome, really enthusiastic, had grea","useful":0,"cool":0},"69oXSD3hY4an3Niic1DQnQ":{"text":"I've taken three tours with French Quarter Phantoms, and two have been the Ghost and Vampi","useful":0,"cool":0},"pTNN1of-Qwx3JZXsaq-LBw":{"text":"We purchased the cemetery tour through groupon. Booking the tour was a simple phone call. ","useful":0,"cool":0},"Hy1eB8DiIYkFPaMUqT1grw":{"text":"Took two tours with this company this weekend:\n1. Ghosts and Vampires Tour - Our tour guid","useful":1,"cool":1},"0Z5zRU6Wgd1_n3VcGCLS2g":{"text":"We took the cemetery tour with Justin W. He was awesome!! Extremely enthusiastic and infor","useful":0,"cool":0},"qdCGFjlgblNQ1J7mv0FYHw":{"text":"Lee was absolutely fantastic as our tour guide for the Garden District Tour. He was extrem","useful":0,"cool":0},"f5YZw1j8qn53TkysHdxl-Q":{"text":"We did the 8pm Ghost Tour with Hope; she was amazing! Her drama-school background really h","useful":1,"cool":0},"-O8leJaQ-WFkbcwxETNifQ":{"text":"I was in town for a few days so I decided to book two tours with this group; the Garden Di","useful":1,"cool":1},"vHUXrNTwC3W79ga70cGaTg":{"text":"I wish Bobby Thomas could take me on a tour of the world. We did two of his tours in one d","useful":0,"cool":0},"JRUy1SRHc_j5W3NGef7fZg":{"text":"We took a walking Treme tour with Justin last weekend.  It was an amazing \"history lesson\"","useful":0,"cool":0},"9uahwl-tNxCambQT4Vk1_A":{"text":"This tour is so much fun! I've done it a total of 3 times and it never gets old for me. Gr","useful":0,"cool":0},"EF3aiancP9NwksNM-jf8TA":{"text":"My boyfriend and I took the music tour and we fell in love with New Orleans more than we t","useful":0,"cool":0},"Vr-fz95_wNm7vOroBdTLQA":{"text":"Absolutely amazing!!!!! Lena was our tour guide and she was phenomenal! We started the tou","useful":0,"cool":0},"bJ-dmSkTcDVsr8Amm3bkQg":{"text":"We did two tours with this company last weekend. We did the ghost & vampire tour with Hope","useful":0,"cool":0},"3d4evRp0MouHQAm5c5cPvA":{"text":"Hope was fabulous! She was informative, funny and very easy to hear throughout the tour. S","useful":0,"cool":0},"orkam2xUZzY1b2e5fsLrGA":{"text":"Luke did a very nice job on the Ghost and Vampire tour. Do the 8:00pm so it's dark. Open, ","useful":0,"cool":0},"rJH9kJW1J_aeOTjqq1NFbw":{"text":"I highly recommend the Ghost/Vampire tour. Our guide Thomas was knowledgeable, fun, and th","useful":1,"cool":0},"qoMVjs6ozhqHaFQNUoa2iw":{"text":"Hope was awesome! We did the ghost & vampire tour on our last night in New Orleans. My onl","useful":0,"cool":0},"T1ltzJu11hIZrcTiR2LrIw":{"text":"The French Quarter Phantoms ghost tour with Thomas was by far the highlight of our trip to","useful":0,"cool":0},"Iih24s1pvbW8RIfiiXX3Gw":{"text":"I have spent my entire life not believing in ghosts or spirits, until tonight. We did a ha","useful":0,"cool":0},"QWw8qldeIrv6WcAQIP_dyA":{"text":"We took the St Louis #1 Cemetery Tour with our outstanding tour guide, Mary J, and had a w","useful":0,"cool":0},"sDgh1_L0DcMZ-AzC5_Q2rw":{"text":"My family went on the Ghosts and Vampires tour. It was entertaining and informative. I lea","useful":0,"cool":0},"IEwrR4h4GhMqoMWCNwrFxA":{"text":"Lee was very funny and nice. It was very interesting to hear about ghost and vampires. It ","useful":0,"cool":0},"IP5kUdmXojAWmuUMrPqvAw":{"text":"Tours were great! We went on two tours; cemetery tour during the day and ghosts/vampire to","useful":0,"cool":0},"lLLwj1J6tEBVF-cfLpnz3g":{"text":"I completely agree with Jonathan H.'s review. This tour was great...just not as advertised","useful":1,"cool":0},"fuD689xn6JicjAkTIinswA":{"text":"Lee was a fantastic tour guide. He was very entertaining, enthusiastic, and knowledgeable ","useful":0,"cool":0},"6L3xZY_Dm8f7hZahgS6E8Q":{"text":"This tour really made our trip to new orleans! lots of great stories! Aubrey was our tour ","useful":0,"cool":0},"4ebfsIlLpaftdl5_O9dDFA":{"text":"I took the tour of St Louis 1 Cemetery -- it was amazing! I was originally apprehensive to","useful":0,"cool":0},"Ftu-FHy5-qyID6YTwtRk8Q":{"text":"The ghost and vampire tour was cool the guide was great.  Definitely worth checking out.","useful":0,"cool":0},"-3uOw-3ROxOKqxMBVf4GZA":{"text":"You can only tour St. Louis Cemetery No. 1 (New Orleans oldest cemetery), with a licensed ","useful":0,"cool":1},"O_4mrQ2MjhCX7oTKWOCo3A":{"text":"Great tour. We were down in New Orleans at the end of January 2014, for those of you who d","useful":0,"cool":0},"NXi5E1_Pwmai9O8kKxMAjg":{"text":"Just went on the Ghosts and Vampires tour and really enjoyed it! Hope was a fabulous guide","useful":3,"cool":0},"aQUNmvzWRopgpX2jep4dkg":{"text":"Great cemetery tour with Dustin who's  mixes humor with facts and keeps the tour moving we","useful":0,"cool":0},"KKqbjXvhDYUNKBKbogK1rw":{"text":"This is my first time in New Orleans and we did the Saint and Sinners tour with Miss Hope.","useful":0,"cool":0},"zfuyByM1V9ViQA8kcbp3tA":{"text":"We learned a lot of haunted history from our guide Sandy. Her stories inspired us to inves","useful":0,"cool":0},"keBvbOlbHdooZA6kwg46ug":{"text":"Stella ' s part of the tour was awesome.  She is fun she is witty, and very informative.  ","useful":0,"cool":0},"wUpA4_9t0yJ7jOZeN9b5iQ":{"text":"I went on two tours this week with French Quarter Phantoms.\n\nThe Ghost & Vampire tour with","useful":0,"cool":0},"ruE9_K6Ej-awYDwB9sBmRw":{"text":"My wife and I went on the city/cemetery tour with Thomas and loved it. He was incredibly f","useful":0,"cool":0},"xCjUi3J6OXWaazGH2ml-HQ":{"text":"Our tour guide was Steven and he was great. Such a good storyteller, it was such a fun tou","useful":0,"cool":0},"xQ8JSKFEESH5XMWs6443Eg":{"text":"The wife and I took the St. Louis #1 Cemetery Tour last Monday. I thought I knew a lot abo","useful":1,"cool":0},"Qokbzhp-74pDupH7knoPQQ":{"text":"LOVED IT! \nAsk for Liz, we really enjoyed her tour. Liz is a native has a wonderful voice ","useful":0,"cool":0},"Pwhy2NojYc3Cvcvj-aNFeQ":{"text":"Ladies and gentlemen, for the online price and a night out in NOL this is so worth it! Ste","useful":0,"cool":0},"fpyDFWOmVshi3osH9wqrqQ":{"text":"I've done these kinds of tours all over the US, and this one was by far my favorite! The q","useful":0,"cool":1},"JtOF9TysX4N-2BSCtPAFtw":{"text":"We had a great set of tours here! The cemetery tour done by Erin was so great, entertainin","useful":0,"cool":0},"nFaXOEHIqxBaBWsOTR7oYw":{"text":"Luke did a great job on our St Louis Cemetery Tour. Extremely interesting. He was very ent","useful":0,"cool":0},"quKMkAXAw65bLPv-q0Xbbg":{"text":"We had a phenomenal tour of St. Louis #1 cemetery with Dylan!   He was super engaging and ","useful":0,"cool":0},"T_AxwIcbZdji2lFVfgZ7Gw":{"text":"I'm a total ghost story freak and was looking forward to going on some crazy adventures wh","useful":10,"cool":7},"mykL7kNGyON_NZYENrap3g":{"text":"My boyfriend and I did two tours yesterday and they were amazing! Our first tour was the S","useful":0,"cool":0},"KD1AypoXZ_ttath-Jz2RWQ":{"text":"I had been waiting for years to come to NOLA and experience their ghost stories. I am so g","useful":0,"cool":0},"no0HwPopJY5e3Ng_z5nksA":{"text":"Great cemetery tour! Justin was our tour guide and he was super energetic and informative!","useful":3,"cool":2},"pCy3vPoLTq9LfHkljXhkVg":{"text":"A group of us took the Ghost and Vampire tour last weekend and loved it! Our guide, Sam, w","useful":0,"cool":0},"2LV1FDtxEMmTLoORCQD9Gw":{"text":"The St. Louis Cemetery Tour was the best tour I have been on in awhile. This is my first v","useful":0,"cool":0},"YhDQp-KscVYE_dp8gjo5Xg":{"text":"Had an awesome time with Bobby Thomas as our guide. The tour starts at The Voodoo lounge w","useful":0,"cool":0},"TbxRc1sioyfxIE31rVodTg":{"text":"Took 2 tours on my vacation here. One was the Treme Tour, the other was the cemetery tour.","useful":1,"cool":1},"L0I7Qr0NUafo8QlaNRd1QA":{"text":"Let's start with the fact that the tour begins at Voodoo Lounge, where you can enjoy 2 for","useful":3,"cool":1},"_WsW9CPjfYAmglPQxF_WAw":{"text":"We had TWO fantastic tours with this company. We took the ghosts and vampires tour with Bo","useful":0,"cool":0},"DpbY_yOIvEkeXHWKivk6Mg":{"text":"Kitschy, but in all the right ways. Have a few drinks and enjoy the ghost stories. Thanks ","useful":0,"cool":0},"h6k5_87HHy4Mm64yrvP0mg":{"text":"Don't pass up!!! Super entertaining, historical and spooky tour! Evian was our guide and h","useful":0,"cool":0},"13hr7DGic11SmjRWGRG-9A":{"text":"Justin was absolutely the best!!! What a great tour guide!! We did the ghost and vampire t","useful":0,"cool":0},"AOGHxf1KOhhbDDc5Shm8zw":{"text":"We took the ghosts and vampires tour. Our tour guide, Lee, was very entertaining! Along wi","useful":0,"cool":0},"9CJf44LQA1D8wPI85tZfFw":{"text":"I had the tour guide Ducky and he was amazing. He knew his history and kept everything int","useful":0,"cool":0},"zXOew7_5i1tTmc20reCI8Q":{"text":"My boyfriend and I wanted to do a cemetery tour while in NOLA. We found this place on Grou","useful":0,"cool":0},"42BNH6O8G310Pa_Q9FcYQw":{"text":"We did two tours with this tour group while visiting NOLA. Both were found on Groupon for ","useful":0,"cool":0},"q30W6PYYWQYQN_Ab-__l8w":{"text":"We went on the 6pm ghost tour with Aubrey and she was awesome. She had the perfect amount ","useful":2,"cool":1},"72oqDGMeMEk5H3REMJZU9w":{"text":"We did the St Louis #1 tour and it was great. Luke was a great tour guide. He was very kno","useful":1,"cool":0},"pMk_fP8Llx_Cat39tX758w":{"text":"My friends and I did a tour today (during Mardi Gras season) and our tour guide was Philli","useful":0,"cool":0},"89TDCLFAG6Gi6uiAh-VWmg":{"text":"We did the Ghost Tour with Miss Hope and the St. Louis Cemetery Tour with Robert. Both gui","useful":0,"cool":0},"AqF97h4_GszAjJ_d8rO4WA":{"text":"Beautiful day for a cemetery tour. Robert was engaging and kept our attention. I also love","useful":0,"cool":0},"nUWV5e6L5RsFalzjvm2SWg":{"text":"Did the Saints and Sinners tour in a small group, led by Angela.  Wow.  So you already kno","useful":0,"cool":0},"2wjbSNV5Upxf5ZWLK9jmTg":{"text":"Justin, our tour guide, was great! I toured with my five teen kiddos and he kept them enga","useful":0,"cool":0},"0g_I34TzxfLlRzRB5glfPA":{"text":"We went on the cemetery tour on our first day in the city. It was very informative And Luk","useful":0,"cool":0},"7k3GfLzye6BDt6ip10L-DQ":{"text":"Got admittance for 2 on groupon for the voodoo, ghosts, and vampires tour and Scott was ou","useful":0,"cool":0},"QI6sFB9J_oAfINUmQ9BuUw":{"text":"Do the Sinners and Saints tour. Our guide, Aubrey, was awesome, knowledgable and hilarious","useful":0,"cool":0},"tprdzOcJEOSCXli91eZwwA":{"text":"It was great tour!! Evan was a great guide. Tour was really interesting. The price was rig","useful":0,"cool":0},"y0BqhqnjFfem1-3eVVLGUQ":{"text":"You want Justin for your tour guide of the cemetery. He'll keep you laughing and learning!","useful":0,"cool":0},"QfHZCbYHFdn1IGs-VJ8C5w":{"text":"Ducky was our tour guide for the day. I loved every minute he was entertaining and informa","useful":0,"cool":0},"QNYp8khosWFMh4zSqHV-Kw":{"text":"I'm a non-native here on vacation for my best girl's bachelorette and was a little skeptic","useful":0,"cool":0},"2HwIubBxAR1Zbh328W8JRw":{"text":"Went on Saints and Sinners tour! Our guide was Justin and he was very  informative and ver","useful":0,"cool":0},"D3-jATKzn3r0ImSriufJmw":{"text":"We went on the Garden District Tour with Lee as our guide. It was super great and he knew ","useful":0,"cool":0},"gtVLy0M_c0q5Bsx0fhtFsQ":{"text":"Stephen really made the experience. I would definitely request him as a tour guide. The to","useful":0,"cool":0},"nHblTqTYHgpHCzl7S8geYA":{"text":"We love Bobby! He was very funny and he went out of his way to give us more information on","useful":0,"cool":0},"GIPqZaxiJLjFHi9m2vrLiw":{"text":"Bobby Thomas was awesome! He's a talented storyteller and our family enjoyed our tour with","useful":0,"cool":0},"eRaG7HcEdWgbXHgZ6VQ14w":{"text":"We took a tour with French Quarter Phantoms (the specific tour was the one that spoke of v","useful":0,"cool":0},"dEmHhqGZPY-zyoVrpVFhBQ":{"text":"Our tour guide, Stephen, was awesome! My boyfriend and I took the Cemetery tour on a Satur","useful":0,"cool":0},"_WHFBCg7rTuKzp_aiEvftw":{"text":"We took the cemetery tour today and it was great! Erin was our tour guide and was very ani","useful":0,"cool":0},"s_znVLf4L_Mlwjs0jt4OCA":{"text":"My fiance and I recently made our first trip to New Orleans.  While we were in town we dec","useful":0,"cool":0},"m3TtzIHQvFOBEzhtiPha3A":{"text":"Fun tour! We found this deal on Groupon & decided, why not! We are in New Orleans anyways!","useful":0,"cool":1},"UxZLfRtIrs7dHLXmf20m_Q":{"text":"Couldn't have been happier with Luke our guide. Super knowledgeable and easy to hang with.","useful":0,"cool":0},"RYC1jXsZ4U6wKreT-3cX1g":{"text":"Taking a walking ghost tour was on my list of must-do while in New Orleans. After some res","useful":1,"cool":0},"M-gabw0Z8qouL-PKWQUhbA":{"text":"I did two tours while I was in New Orleans this past week and they were both phenomenal. T","useful":1,"cool":1},"TrrikgXXygNyIconioJlrQ":{"text":"I'm sure tours vary greatly depending on the tour guide... and of course, I forget the nam","useful":1,"cool":1},"TOZDbFDZqGLqRGnCYaM84g":{"text":"I absolutely recommend booking with them when it comes to tours. They are phenomenal! I di","useful":2,"cool":0},"amL1c1lZpOt7UZUzR4yK0A":{"text":"As someone who absolutely hates being scared, I found the stories to be fascinating, creep","useful":1,"cool":1},"8LbOFj6dwLhK6-AQr96keg":{"text":"Malika is the best! So knowledgeable, I loved her! We went on the cemetery tour and so gla","useful":0,"cool":0},"8vLYbnGdGdIEum8sIgbJEg":{"text":"This ghost/vampire tour is fabulous! Highly recommend and so worth it, especially for a No","useful":0,"cool":0},"EavJwt5ipRSCQk9gEMzXcw":{"text":"This was a great tour of the St. Louis Cemetery #1, seeing what is known to be the actual ","useful":0,"cool":0},"oinbSpknvBn2zPOaxaZsHQ":{"text":"Erin was my tour guide. Small, loud and energetic. She enjoyed getting questions from our ","useful":0,"cool":0},"0AuaWKASC-bQyHua9H020g":{"text":"Luke was an excellent tour guide! He knew so much history and had a great sense of humor! ","useful":0,"cool":0},"P1zRD6AbJkfPpy7djMj_FA":{"text":"All together we have done three tours with this group. We are only here a week. They have ","useful":0,"cool":0},"ogIpkUudGJJJDCccsCxwlg":{"text":"Our tour guide Erin was fantastic! So glad she made a point to highlight the tomb of Homer","useful":0,"cool":0},"oX4ccoP4T27TpO4WaNWNfw":{"text":"Angela was Ah-mazing! Knowledgeable, funny, entertaining, kept us on our toes, superb guid","useful":0,"cool":0},"ZxDvNRoYlfQpTIvO9JHkwg":{"text":"I took the \"Music of New Orleans: Listen and Learn Tour\" --DO IT!!!-- you will not regret ","useful":0,"cool":0},"LBwamWbb6zUwQfpFvyofmg":{"text":"This is for the phantom tour, I know they do other tours but I can't speak for all of them","useful":0,"cool":0},"jGWdQEXaF8RgI8RUjUkiAg":{"text":"After searching groupon for different tours through the city of New Orleans, we decided on","useful":0,"cool":0},"KLxmpY1qvu1Tf95C9ab3eA":{"text":"We had a wonderful daytime tour of Cemetery #1 with Aubrey on our last full day in New Orl","useful":0,"cool":0},"gmMyA9BkTnG_b5gC90TWeQ":{"text":"Great tour with Justin!!! He was an excellent guide finding us shade to stand in while he ","useful":0,"cool":0},"QUeuFjZXuqKASmmfYCmpGQ":{"text":"My boyfriend and I were really surprised with how much fun we had on this ghost/vampire to","useful":0,"cool":0},"TsrsVcZr4jfUFVWIanu6mw":{"text":"Today we were on a tour in Garden district + cemetery with Lee. We really enjoyed the hist","useful":0,"cool":0},"b0Sxerl9XCQWqd_2YmHVnw":{"text":"We had an amazing time on our Ghost and Vampire Tour with our guide, Phillip. He is a fant","useful":2,"cool":0},"Ow17z7tiYWXDpQwl9fInOg":{"text":"We had a wonderful private tour of the cemetery today with Angela. She is super knowledgea","useful":4,"cool":6},"rSZvO09k7hV09dfp--oPVQ":{"text":"The tour was very informative and very interesting to learn all the history about some of ","useful":0,"cool":0},"rtLYP7rTKftDPRnRDBEHIQ":{"text":"I had never been on a walking tour of any kind before, and I was not disappointed to try t","useful":0,"cool":0},"hcqS6mNndAE3rkm33PvbJw":{"text":"This tour was fascinating!!! I had never done something like this and I highly recommend i","useful":0,"cool":0},"WY9o_Ya6AoDraDD7PkI3zQ":{"text":"The ghost and vampire tour was absolutely fabulous. Our tour guide, Sam, was extremely kno","useful":0,"cool":0},"yYBezrDG6l_TtE4mO4IR0A":{"text":"Took this tour while on a girls weekend and it was great to get a little break from all th","useful":0,"cool":0},"lunloK03y-Wv0aECkD1-gg":{"text":"We had such a great time! 100% recommend! Our Cemetary tour guide Robert was really inform","useful":0,"cool":0},"mhy4Pf4laAkS5Kf7tfi6iQ":{"text":"Finally, a tour guide , Milaka, that could be heard and was very informative and entertain","useful":0,"cool":0},"tFeJ9880gkjkm9HGL4L_Ug":{"text":"Aubrey was an excellent tour guide and we had so much fun walking around the quarter with ","useful":1,"cool":0},"Jhu-VQt0c2AAvbrn5D67zw":{"text":"We did the St. Louis #1 Cemetery Tour. Our Tour guide (Bobby Thomas) was amazing! Very ent","useful":0,"cool":0},"VD-BJwWBMe_6-S7iHJJxFg":{"text":"The Garden District and Lafayette Cemetery No.1 tour was great!  Aubrey is a wonderful gui","useful":0,"cool":0},"JDBWkqxP3WYFEfbn0kFT0Q":{"text":"Who goes to NOLA and tells their significant other they want to go exploring in a cemetery","useful":4,"cool":4},"Aw9UNs7KiZOK17085Zc72w":{"text":"so fun and informative. do it. get luke as your tourguide- he's amazeballs.","useful":0,"cool":0},"DSmQTXUTGilq8w2V-PmtTA":{"text":"We went on this tour last night after seeing the number of great reviews on yelp, and we w","useful":1,"cool":0},"OzRDihV7a1xWxpvbno5mjQ":{"text":"I have read all the reviews and I am so glad we picked The Ghost and Vampire tour with thi","useful":0,"cool":0},"FzHAM3f2hGUgyY_VVgo9xQ":{"text":"We took a tour with Rhodesia- she was the perfect combination of funny, serious, and spook","useful":0,"cool":0},"PLIZR7RYg8D3i8SDPa4QcA":{"text":"Be sure to get your ghost tour from Hope. Great mix of creepy tales with a few jokes and b","useful":0,"cool":0},"Oc6dLfJ0nfxSDNhWSDA11g":{"text":"ZERO stars. After 15 minutes we knew it would not be good. 2 tour guides. 1st one was prob","useful":0,"cool":0},"_OP8SOJq1aTJAXr6k7oWlQ":{"text":"Loved the tour guide Miss Malikas energy, knowledge, and enthusiasm. She was upbeat, fun, ","useful":0,"cool":0},"IJRSPkSe8PZuSg2ir1Qovw":{"text":"Great Tour and our Tour guide was Aubrey, she was fantastic kept our interest in the heat.","useful":0,"cool":0},"Kv6aIUvxkwsC3awMiieQjQ":{"text":"Excellent tour! Well worth the money!!! Made a same day reservation. \"Miss Hope\" the guide","useful":0,"cool":0},"2nYFCHpsHvLpnK7Liehm7A":{"text":"This was an amazingly exciting tour of the French quarter. Our tourist was Aubrey,  she wa","useful":0,"cool":0},"alHXhhbEqYrwJqnpr7QZiw":{"text":"We had the privilege to take the Vampire/Ghost tour with Thomas. He came highly recommende","useful":0,"cool":0},"3CIKkkrK7P_qo9Dy5868jg":{"text":"Did the Garden District and Lafayette Cemetery No. 1 with Sam.  Awesome tour guide, local ","useful":0,"cool":0},"MnUmcy29_ZKKx6KjvUfnIw":{"text":"We had an absolutely great time on this tour.  We took the ghosts and vampires tour.  It w","useful":0,"cool":0},"mLGT534gEXdfa0yb63aicA":{"text":"There are many ghost tours in the French Quarter and we happened to choose the Ghost and V","useful":0,"cool":0},"8hCGdbWRSL2RsBGDba1Z6w":{"text":"3/5 personal hauntings\n\nso it's cool. i think you'll be entertained, there's a convenient ","useful":1,"cool":1},"QXustWCryJ9oAebWjGO-hQ":{"text":"Phillip was great. What a fun night. Went with a group of girls, and even though it rained","useful":0,"cool":0},"dQ1Gsu7latgNGzVwVfFVEw":{"text":"We have wanted to do a Cemetery Tour for years. Traveling with my mom and my wife, this to","useful":0,"cool":0},"DydFVQTvjocxYNAVUX-mtg":{"text":"Booked the Cemetery Tour and we had Miss Angela as our guide and Master Story Teller on 12","useful":0,"cool":0},"TSK2BItVjzSbqieh5wzXqA":{"text":"I went on this tour with my coworkers and we had a fantastic time! Lizzie was our guide an","useful":0,"cool":0},"NzF80h-PkCzXjuSIrcyjhg":{"text":"We did the tour last night and we enjoyed it.  You can learn a lot of French Quarter histo","useful":0,"cool":0},"it2l493VayklU2UunjAxmg":{"text":"We took this tour over Memorial Day weekend and had such a fun time. Tessy Ables was our t","useful":0,"cool":0},"uBFekx6G8drpx8-3KYwBvg":{"text":"Went on the Ghost & Vampires tour a couple days ago with Hope as our guide. She's great! G","useful":0,"cool":0},"-Fl5nQ1j6wZVZa4n-5BE6Q":{"text":"I hate bad mouthing a business because I know how hard it is to make a living. But our exp","useful":0,"cool":0},"C77r1Az-S2pRNlstTek4Wg":{"text":"Luke and Frank were awesome tour guides! Very informative and funny with crowd banter.","useful":0,"cool":0},"gY0reImApJvwtFry4uVhUQ":{"text":"We used a Groupon for the Cemetery tour, but it would have been worth the full price.  Our","useful":0,"cool":0},"uwga8pdiIOjlV1WGJyaj_w":{"text":"They really weren't kidding when they said \"rain or shine\"! It started POURING in the midd","useful":0,"cool":0},"I3QCH49BfrV4APnPGTHAvA":{"text":"We went on the cemetery tour and it was great! Lee our tour guide was wonderful, very know","useful":0,"cool":0},"DtfOb5H4UtcRXQJGSzBTPw":{"text":"We went on the True Crime Tour. It was exciting - our wonderful tour guide, Thomas, brough","useful":2,"cool":1},"IEQosccb_VwMvKiD4HSRMQ":{"text":"My friend Haley and I have been in the French Quarter for nearly a week and the St. Louis ","useful":0,"cool":0},"Nbw4PZWaSt0P-mEhEVuTkQ":{"text":"Great tour! Very respectful of the historic and spiritual significance of the cemetery and","useful":0,"cool":0},"gOr0DI-jgvQus8aZwqLw9w":{"text":"Went to the Cemetary 1 tour on a Saturday afternoon with my sister and friend. \nLuke was a","useful":0,"cool":0},"RPFH-5H5yaVBt1AIrwVVLw":{"text":"We took the Ghost & Vampire walking tour last night with Mary and it was EXCELLENT. We had","useful":2,"cool":0},"tdJ4XVnZiNIJ_y7KKdPRPQ":{"text":"Bobby Thomas was our tour guide, he is very knowledgeable and friendly. Awesome tour, if y","useful":0,"cool":0},"uML7QI8Gk5zeKXwFfaM4Ng":{"text":"We loved our walking French quarter ghost/vampire tour with Emily!! The weather was great,","useful":0,"cool":0},"_EBew56Hmq10AV-vDcJz-w":{"text":"An amazing tour for cemetery 1 with hostess miss Malika. She brings the life out of every ","useful":0,"cool":0},"apm1hFUjPuepw8VIqyGevQ":{"text":"Fun time - even in the rain. Learned a lot about the history of New Orleans and some not-s","useful":1,"cool":0},"GngWTs_tQeruKGfkhu5u_g":{"text":"I've never been on a tour like this before---SO MUCH FUN! Bobby James was a fantastic tour","useful":0,"cool":0},"QBSx1oy-p8Fw6v8yNMnjRQ":{"text":"The St. Louis #1 Cemetery Tour was very good. Blaize aka Susan Lanigan, was a good story t","useful":0,"cool":0},"cuEZzehyolN1AhVg5GVr7w":{"text":"My boyfriend really enjoyed this tour and all the stories. I was dying of the heat. We had","useful":0,"cool":0},"7CNBb1xNkeAGfhg0iBTZTw":{"text":"We have done many tours over the years, our guide was Sam. He was the best guide we have E","useful":0,"cool":0},"sQkcvxCcO5qG9xLb1J99ew":{"text":"Erin is amazing!! Went for my bachelorette party today and honestly it has been the highli","useful":0,"cool":0},"-dmbTSbRujhfgumbCtRkTg":{"text":"Loved our tour guide Leena. She was very friendly, funny, and knowledgeable about New Orle","useful":0,"cool":0},"hpd9TS3sf-_TsNnnvwZYsA":{"text":"St Louis #1 Cemetery Tour:  Our guide, Erin was wonderful.  She was filled with character ","useful":0,"cool":1},"jBC8Jm9FsU7TJEhfN-SBuA":{"text":"The booking process for the St. Louis #1 Cemetery tour was very easy using the tour compan","useful":0,"cool":0},"s94nEP3sUYYt1GXys0bNVg":{"text":"I did the St. Louis Cemetery Tour with Miss Malika. It was absolutely fantastic! Very educ","useful":0,"cool":0},"XLFoj7L41zNhLeb8vtDv6w":{"text":"The Vampire and Ghost tour added to an already great trip.  Dylan was a excellent tour gui","useful":0,"cool":0},"OXKBL0V48AP-_ZXG1sNHnw":{"text":"After learning that the best way to view the unique New Orleans above-ground cemeteries wa","useful":10,"cool":8},"Trl_Y87MFgapDtIjzvHGSg":{"text":"We have been to New Orleans many times and this is the first tour we have done.   It was a","useful":1,"cool":1},"4BiABJLpyb6svUjPP_qSiA":{"text":"First let me mention Lena, lively and upbeat, she made the tour. She gave the facts with f","useful":1,"cool":0},"Vi-qVOcF4IM-ZsGCtFFuTw":{"text":"Sandy was our guide for the graveyard tour. Very interesting and informative as well as hu","useful":0,"cool":0},"gEUuuiGtgvpAnHvXw_53pg":{"text":"Dylan was our master story teller and he did the best job! I felt like the entire time we ","useful":5,"cool":3},"lbeWGS1NRM_8O_Z8OsYbow":{"text":"Great walking tour with fun haunting stories.  Would recommend to anyone!  Kind of glad I ","useful":0,"cool":0},"v0FFedv-H8my1wX-qJtpng":{"text":"We just finished the Ghosts and Vampires Tour. This was our 3rd tour with this company dur","useful":0,"cool":0},"Bz7L8w6oJiyTVOEZ6k0SMA":{"text":"We chose the Garden District + Lafayette #1 and we really didn't know what to expect! The ","useful":0,"cool":0},"FLW4J6stIn4vrfKpi9JVtg":{"text":"Loved the St. Louis cemetery tour!  Our tour guide Lina was amazing.  She started our tour","useful":1,"cool":1},"1cdhcvkT2XqiGFeGgnoV5w":{"text":"My wife and I did the Saints and Sinners tour on Jan 17th and it was everything we could h","useful":0,"cool":0},"UJI2eOHMSFpVP-DBEy6eRA":{"text":"Ask for Miss Malika to be your Master Storyteller (guide), if you can. She adds a humor an","useful":0,"cool":0},"42sLwuu8v6ZnkRQdOUalug":{"text":"Malika was an excellent tour  guide. She is very passionate about the history, culture, an","useful":0,"cool":1},"Zgu5rET_IQljklsOvSWsfQ":{"text":"Went for bachelorette party last night! Malika was great and hysterical. If I were a tour ","useful":0,"cool":0},"v1LTmERMByBdmnIDP5dvJg":{"text":"We actually live in New Orleans and have lived here for the past four years and randomly d","useful":2,"cool":0},"A60GR9oxHAMBvcByoPeWIA":{"text":"Had Emily as our tour guide! Very knowledgeable and a great story teller. Tour wasn't too ","useful":0,"cool":0},"z2XJ6Rscyl5dQ4B5is_KZQ":{"text":"We took two tours during our trip to New Orleans. We went on the Treme and the Cemetery to","useful":1,"cool":1},"gHSw3lfFgDtrV903NWkXkQ":{"text":"Going on a ghost tour was one of my main goals during this latest trip to NOLA. On the dri","useful":0,"cool":0},"LWtEXLxZ5GeLPOqr45T_mg":{"text":"I happen to be a \"seasoned\" Ghost Tourist and I thoroughly enjoyed this one! Of course Nol","useful":1,"cool":1},"9pJcmiuU9cXzEOIprrGxZQ":{"text":"Two friends and I took the Ghost & Vampire tour the first night we arrived in New Orleans.","useful":0,"cool":0},"NAiUCqM17l349GKRfaksWw":{"text":"We had an awesome time on the tour. Justin was fantastic. The tour itself was far better t","useful":0,"cool":0},"FgybOAlTqdMuSAv6xgRctQ":{"text":"Dillon was an excellent tour guide! He was very knowledgeable and a great story teller! Ke","useful":0,"cool":0},"TXZjGf953gF1HYsBZ3Zb0A":{"text":"Had Luke as our tour guide. He was very informative and seemed to be very confident in his","useful":0,"cool":1},"IAeRFLlsNa37tX7f_adPFg":{"text":"We visited New Orleans at the end of March and had a wonderful time during the French Quar","useful":0,"cool":0},"UWJZ1F6_c95sCmkBcWq0TA":{"text":"We had a great tour of the Garden District with tour guide, Erin. It was pouring rain but ","useful":0,"cool":0},"IPDGn6p-stYYUHIqM-cBHA":{"text":"Went on another tour with french quarter phantoms. We went on the cemetery tour with Luke ","useful":0,"cool":0},"upxsXm6uF34Ep9RjRxXVDg":{"text":"I highly recommend using this company. If it's hot outside drink a lot of water prior beca","useful":0,"cool":0},"cTauj42L5htF6u9b2P8bwA":{"text":"We took the ghost and vampire tour and I still have goosebumps!  Our guide, Dartanya was a","useful":0,"cool":0},"qH3yYiBkBOTP0c884qqiVA":{"text":"Really I would give a three and a half star review but I can't do that. Three is a little ","useful":0,"cool":0},"BYWVRX6WbtJZC1oFBSTXig":{"text":"My family and I took the cemetery tour and it was fun, educational and amazing. Our tour g","useful":0,"cool":0},"5lun5bETf_1pQkEnsnkZmQ":{"text":"Luke was amazing and funny definitly funny guy. He is very scholarly and full of experienc","useful":0,"cool":0},"5UHKv2S_NelUJJd2RrffWw":{"text":"We booked this ghost tour for something fun to do. Recognizing there is a \"cheese\" factor ","useful":0,"cool":0},"tT_cWefmoGeKQJK5HkabmQ":{"text":"We had a great time on our tour. Bobby was wonderfully entertaining and even walked us to ","useful":0,"cool":0},"PhlHZ6ArQvmez8m3FtM59A":{"text":"Hands down the best tour! We absolutely loved Lee as our tour guide! He was so much fun an","useful":0,"cool":0},"WKeLRR2tx0kFr6blE1dGcg":{"text":"We had a great time doing the spooky ghost tour! It was well organized and the adults were","useful":0,"cool":0},"XPbevQAJISxOBa_RDsKMEQ":{"text":"Loved this tour and our tour guide. \nLee was informative, patient and funny. Group of 6 wa","useful":0,"cool":0},"2BG36QTqFB8fRMFIwTqobA":{"text":"my boyfriend and I went on the ghost tour today with Miss Malika as our guide. I had been ","useful":0,"cool":0},"cp8Urgx4wIu0bYMg0SJlEA":{"text":"Loved it!  Preston was amazing! He really knew his stuff and was very informative!  Highly","useful":0,"cool":0},"yM6AU_WjFHR6k5DSVKhygw":{"text":"Justin is the best 100000000/10 would come again for the tall dark and handsome jokes","useful":0,"cool":0},"hv6gyH6W_4LRXajUx7lvlw":{"text":"Took the Ghost and Vampire tour with Aubrey and was not disappointed. Excellent story tell","useful":0,"cool":0},"h1NiosgJR7A-QGOikY_8zg":{"text":"Took the Cemetery tour with Robert. HE IS THE BEST!!!!! He's kind, knowledgeable, accommod","useful":0,"cool":0},"am82KLdR2AEYeJAFKFogRA":{"text":"This is a great tour. So educational and informative. If you decide to take this tour ask ","useful":1,"cool":1},"XDIhqUCeSzgfUK5pHR2ZCg":{"text":"Our guide Mad Mike? was great however....  The Ghosts and Vampires tour starts in a bar wi","useful":1,"cool":0},"z-0f_B1QDmYZN5PTJ0qWyw":{"text":"Drunk patrons don't help the tour- profanity, interruptions and just generally obnoxious. ","useful":0,"cool":0},"0_xRY1721013u5GDN3IQ_w":{"text":"We took the tour of the St. Louis Cemetery #1 and it was fantastic! Justin was an amazing ","useful":0,"cool":1},"8-JkuTWPAHfhDeeDj_d9CQ":{"text":"I giving four stars because of Trevor our guide was awesome. I have been to NOLA a bunch o","useful":0,"cool":0},"3zTLN8AI8slqGU1NFsR9fg":{"text":"We used a groupon which ended up being a great deal. We did the cemetery tour and had a ph","useful":0,"cool":0},"7KKPhK6KnVNmJZncynLF6g":{"text":"We did the Ghost & Vampire tour and our very entertaining and incredibly knowledgeable gui","useful":1,"cool":1},"dLjeW3dQr9bHQWAsjH0fLg":{"text":"Definitely glad we took the tour, which we purchased through a Yelp deal. It gave us a goo","useful":0,"cool":0},"ZVFEMsiTQrvaAdtO_o3pnw":{"text":"Last month, we went to New Orleans for a Bachelorette Party.  There were 4 of us and we bo","useful":1,"cool":0},"TIbbv3_Ggd4Yei64UG1Kog":{"text":"We loved the Ghost & Vampire Tour. Malika is truly an awesome guide with a lot of great hi","useful":0,"cool":0},"YYi4mYssmr9cuMzr-mtBng":{"text":"It's overwhelming when trying to pick which company and specific tour to do in New Orleans","useful":2,"cool":0},"FHxizFrHsMgpSgoRuNU3zg":{"text":"Bobby was super enthusiastic and full of New Orleans knowledge. We really enjoyed and will","useful":0,"cool":0},"AuZ0NOc6OxJA1glOBpePvQ":{"text":"I recently moved here and found this tour on yelp. We took the Ghost and Vampire tour. I b","useful":0,"cool":0},"zkx471aLb6WKP87T7MH7gg":{"text":"Our guide, Thomas absolutely made this tour. I can't imagine how hard it would be to give ","useful":0,"cool":0},"jTuW-FDcxjiw3di8Ez2NHg":{"text":"We were on our honeymoon staying in the French quarter, when we checked Yelp for popular s","useful":0,"cool":0},"uaPbfdGIblfuGGeCHJs7Nw":{"text":"Excellent tour. Our guide, Luke, was incredibly knowledgable. I learned a lot of New Orlea","useful":0,"cool":0},"Ccr8tyMK_WzliAvDPiVhaw":{"text":"We had a phenomenal tour of St. Louis #1 cemetery with Dylan!   He was super engaging and ","useful":0,"cool":0},"ooZza8ZQEIpP2PgPfFxyyw":{"text":"My sister and I just finished this walking tour and it is a must for visiting New Orleans.","useful":0,"cool":0},"vEmfORk7CBTb8ka2vEfbsQ":{"text":"This tour far exceeded all expectations! I loved how the tour emphasizes stories that can ","useful":0,"cool":0},"SBl14Xgi0VHSNiRuPJ5aTQ":{"text":"I am an avid fan of ghost tours for the history and the gossip. We had such an amazing sto","useful":0,"cool":0},"Zi_tzB8juY1LLdfqjARwTg":{"text":"Our guide was great! And if I could remember his name, I would definitely include it. Aver","useful":0,"cool":0},"1h3uga2n2neG9lXgOmlBfw":{"text":"My wife and I have a tradition, we always go on some form of a walking tour while visiting","useful":0,"cool":0},"PNjyOm-U38vNVZeqavSdyQ":{"text":"Bobby Thomas was our tour guide and did an awesome job! Fun tour with lots of great info!","useful":0,"cool":0},"rQW2biAoTclUR-hczjOUrQ":{"text":"I researched 3 other companies before I chose this one and I was more then pleased! My boy","useful":0,"cool":1},"oEQxAqrhKvpoPZuI1ARvyA":{"text":"We took 2 tours- Ghost & Vampires with Erin and the Garden Tour/Cemetery with Evian - both","useful":0,"cool":0},"7rg7jBT_MLGX-jBpRDIjGA":{"text":"The True Crime walking tour was excellent.\n\nOur tour guide was knowledgeable and funny. Th","useful":0,"cool":0},"ubzW6GiKEVw7bbHYAB9XVQ":{"text":"We just took the St. Louis #1 tour with Angela! It was a blast. She was funny and knowledg","useful":0,"cool":0},"Bpf1bCJ0lWnkOy7oBGivSg":{"text":"My family took the Ghost and Vampires tour. It was a great way to see and learn about a fe","useful":0,"cool":0},"lwxbEzhbUviZdOG2R98Bsw":{"text":"My boyfriend and I took the Ghosts and Vampires tour with Trevor from 8pm to 10pm. It was ","useful":0,"cool":0},"h3QS5MGHJqQW0r8t4waZDw":{"text":"Our tour guide, Robin, is the best!! She is a wonderful storyteller and historian of the N","useful":0,"cool":0},"GG2Od_EYBXFGupqMziBSZw":{"text":"My girlfriend and I were staying in the French Quarter last fall and found French Quarter ","useful":0,"cool":1},"VFwNqtxfmZPirNBZ2lnAEg":{"text":"I had a great time on their St. Louis Cemetery no. 1 day tour. The tour guide we had, Just","useful":0,"cool":1},"ogWV5itnCQF5zla5eK2WJg":{"text":"My girlfriend and I took the Treme Tour when it was offered on Groupon/Living Social/some ","useful":0,"cool":0},"Q49TkW46nThCEUMJjDhq6g":{"text":"Our tour guide Trevor was knowledgeable and personable.  We learned a lot about the histor","useful":0,"cool":0},"ppLykqzv9q72EQXGRASbPQ":{"text":"Steven was a great tour guide on the cemetery tour - a New Orleans native with a great und","useful":0,"cool":0},"ZMe6U66xI0lxQySqFeOr0w":{"text":"We did a tour of St. Louis Cemetery 1. Since the site has been vandalized in the past, it ","useful":0,"cool":0},"5oq4ZnE517MyCb2LkW1z3Q":{"text":"Justin was a great tour guide.  \nSeems like a basic, entry level tour.\nWould recommend","useful":0,"cool":0},"LoFBY2km3BZvZSD-pRQGng":{"text":"We went on the ghosts and vampires tour this evening and had an amazing time. Our tour gui","useful":0,"cool":0},"n1WqQB0qiP_cCxPcSOx2nw":{"text":"Had a great time on the French Quarter Phantoms St Louis #1 Cemetery Tour! You start off m","useful":0,"cool":0},"oYRbP7VDPLXdw1sC3lp1fw":{"text":"Luke's tour of Tremé district was outstanding. Civil rights, Storyville, Twentieth Century","useful":0,"cool":0},"twzR6fWLICu-ZrHtpXkGGw":{"text":"Andrew led our tour. He was funny but not cheesy. We learned very interesting facts about ","useful":0,"cool":0},"ys-5sWXNz1xl4B_Yw77YUQ":{"text":"Booked this tour for our group of 8- mix of our millennial kids and parents. Everyone had ","useful":0,"cool":0},"naLAXsRBRUf57DBJQ1btvw":{"text":"Booked our tour for St. Louis cemetery #1 through groupon and called to make our reservati","useful":0,"cool":0},"GQaLis5dr0402qTwFXJ62w":{"text":"I loved my French Quarter ghost & vampire tour with Thomas! Loved that there were hurrican","useful":0,"cool":0},"kL-A8Y_Q4croW7593jyqPQ":{"text":"Excellent tour! Good historical and interesting information told in an amusing way. Tour g","useful":0,"cool":0},"kBZk1zpl7b7eSTv8ccuBTA":{"text":"We really enjoyed our Ghost/Vampire tour with Angela, but they can be hit-or-miss. Lacked ","useful":0,"cool":0},"OeDLApuLtH_ywl16SXetlA":{"text":"We had such a great cemetery tour! Evian was a great tour guide and really knowledgeable. ","useful":1,"cool":1},"4GKv90O-WX7eGLQzyo1AkQ":{"text":"We enjoyed both the St. Louis Cemetary #1 tour with Justin and the Garden District & Layfa","useful":0,"cool":0},"jDDfkN5QDBXpMW1bNoOH2Q":{"text":"Our tour guide Malika was extremely knowledgeable and friendly as she guided us through th","useful":0,"cool":0},"zR7IDPW4x3G6arcCPvKfiQ":{"text":"Erin was our tour leader tonight and she was awesome!! The tour moved along with ease and ","useful":0,"cool":0},"tzttVwkLkAye7BLmynUWiQ":{"text":"Brilliant History of New Orleans!  We took the Cemetery Tour & learned about all the histo","useful":0,"cool":0},"agtt3ju-k7S3RJP1Fk_AxQ":{"text":"We took one of their St. Louis Cemetery #1 tours today with Justin aka #handsometourguide ","useful":0,"cool":0},"i0OX_Tlze8dQVsaxIDn_5Q":{"text":"Good tour but the guide asked for a tip twice... made us uncomfortable after already payin","useful":0,"cool":0},"7tUBBsxP8hb3bw4nG39Dew":{"text":"Our favorite tour while in New Orleans. Great information and our guide, Dartania, made th","useful":0,"cool":0},"8-lDQvJuYRJKT_PmoyovUQ":{"text":"Bobby Thomas is brilliant!!!  Loved his ghost story tour! Such a great storyteller and lov","useful":0,"cool":0},"Hsk8oSz0VN7EH_9V--V7Fw":{"text":"Justin was amazing and so informative on the cemetery tour!!  Had such a great time and wa","useful":0,"cool":0},"Tq4cVmdSFOpjEqnFS8jF3g":{"text":"Malika was GREAT! My sis & I did the Saints & Sinners Tour and it was great. Learned lot a","useful":1,"cool":0},"Tvqr-NO7zI60yrDRI5oQ3w":{"text":"Absolutely LOVED my ghost and vampire tour with guide--Justin. I had been looking forward ","useful":0,"cool":0},"b9VRrVMU87XxJmlJWBylKg":{"text":"Me and my boyfriend had did the saints and sinner tour and I just want to say that Robin i","useful":0,"cool":0},"MuWpSBkDb1rgo5A3MmGpfQ":{"text":"We had a fantastic time on our Ghost and Vampire tour. Steven was funny, personable and in","useful":0,"cool":0},"qtZ3vXnlhk-udmhppzSZrg":{"text":"Sam C. was the best and most committed tour guide! He knows his stuff and have us one of o","useful":0,"cool":0},"rpUsy9sfDxodzMqB7jootg":{"text":"This tour was great-the cemetery isn't overly big and it was a saturday so it was packed. ","useful":0,"cool":0},"y-f7PKZWFRp_HSg1cf5vuA":{"text":"Great tour! Educational, beautiful, and fun! Luke and Brian are awesome! I recommend the 6","useful":1,"cool":0},"4OBS-cKNXRcpjUwzIiosiA":{"text":"I got a groupon deal for the cemetery tour. Lena was very good and had a lot of informatio","useful":0,"cool":0},"3y9JSPJttZugzr78b1tfbg":{"text":"We did the cemetery tour with Justin as our guide.  OUTSTANDING energy and knowledge,  and","useful":0,"cool":0},"ChZ8Avjx6qpHMc-_1__tYQ":{"text":"Awesome walking tour - Bobby was a great storyteller and kept the group engaged with fun f","useful":0,"cool":0},"azdIJCJmkzT1Utfo_9ksrA":{"text":"Took the cemetery tour.  Box office easy to find.  Tour nicely paced.  Our tour guide, Jus","useful":0,"cool":0},"Ch0VlxNq9p4zfkuWirzd-g":{"text":"So fun!  Stella was just the best - so knowledgeable and so very excited about everything ","useful":0,"cool":0},"tHD82DvG14YYBuM1wjTmFQ":{"text":"This is a must do if you are in the area! We did the Cemetary tour with Erin first, the to","useful":0,"cool":0},"ay5REMcEAXe1YwIB-B2f6A":{"text":"Sam was an amazing tour guide.  We did the music tour of the Treme area and he had so much","useful":0,"cool":0},"9hvuytOs7WU1cstYeyNbkA":{"text":"I went on the vampire and ghost tour with a group of six. The tour guide was very friendly","useful":0,"cool":0},"LJpCxptpjDwWAHiZ8NBLZw":{"text":"We did the Saint Louis Cemetery 1 tour yesterday and  were off to a great start from the b","useful":2,"cool":0},"swTiVdgdAMOAHf65dYfMoQ":{"text":"This tour was SO entertaining and interesting! Keeping us on our toes throughout the entir","useful":0,"cool":0},"QqPJEDrSVYjeiGcQFfN7AA":{"text":"One of the highlights of our New Orleans trip. I booked the ghost + vampire tour on a whim","useful":0,"cool":0},"OnHIo4YRlSyIbYBrd40Z4g":{"text":"We took the cemetery tour today with Justin and it was fantastic. He's a great guide and I","useful":0,"cool":0},"97Z38U6Rsz40YfplJULO9A":{"text":"We did the cemetery tour (St. Louis #1). I was so excited for this tour as I had read up o","useful":0,"cool":0},"h1topabm8XRbHSY6IRFmmQ":{"text":"We did the Garden district/cemetery tour. Our tour guide Sam was great. He knew a lot of h","useful":0,"cool":0},"i6gbsq7XSwjfHlQjPOXlwA":{"text":"Thomas J. Webb is a true Master Story Teller!!!  If you go to New Orleans, it is a must!!!","useful":0,"cool":1},"UdsuCyW7Lph40LenUGloyQ":{"text":"My fiancé and I had a great time touring the garden district!  Our tour guide, Justin, was","useful":0,"cool":0},"QNeLSpXuIgE4PIu-4Is7bA":{"text":"This tour was awesome and the highlight of our trip. Mostly because of our tour guide Step","useful":0,"cool":0},"1FTTYn5PNXzox49wM7Lncg":{"text":"The price was right for the saints and sinners tour and included 2 for 1 hurricanes at the","useful":1,"cool":0},"XP36w0rw-QpSzrRwOMnjSg":{"text":"Did the St Louis Cemetery #1 tour late morning on a Wednesday. Booked this tour through th","useful":0,"cool":0},"emIWBfZ1yFOB7gkBUFsoVQ":{"text":"We just finished the Cemetary tour and I wanted to write the review now before I forget to","useful":1,"cool":0},"eNQjNADA3GulnIRBlg5TEg":{"text":"Awesome tour!! Justin (I think?? I know \"Wood\" was the mar name) was killer. So funny and ","useful":0,"cool":0},"vbh9BnUQebs19EU7mAlS9A":{"text":"We had a great time taking the Ghost and Vampire walking tour of New Orleans. Our tour gui","useful":0,"cool":0},"PC9o8reHfx6kSnuNqgPVGA":{"text":"Went on the St Louis Cemetery #1 tour with Robin as our guide! \nShe was super friendly, fu","useful":0,"cool":0},"p4Dii2TSSl4qffw2bQGXCQ":{"text":"I cannot say enough great things about French Quarter Phantom Tours. I have visited New Or","useful":1,"cool":1},"gmBz3B6PlnGZK7dLlq9dnA":{"text":"A tour is made or not by the guide. Justin absolutely made this tour. He is both entertain","useful":0,"cool":0},"OIO4y6fZCZhiY1t7vYR-fg":{"text":"Loved loved loved the tour with Sam!!! My friend and I went on the Ghost and Vampire tour ","useful":0,"cool":0},"r-Aqsdm6qsQLCVXoDGX_Jg":{"text":"We took the Ghost and Vampires tour and it was excellent! Justin was a great guide, he was","useful":0,"cool":0},"w1uEPQVmSKFmR_0hoT4tSQ":{"text":"What an AWESOME tour!!! We did the tour during the \"Boycott Bowl 2019\" A perfect way to av","useful":0,"cool":0},"zwejD2qxV9u5dNsH0l4sMQ":{"text":"We toured the St. Louis Cemetery Number 1 with the French Quarter Phantoms. Our tour guide","useful":3,"cool":4},"QhScepgZ93G-jFV5KZONSA":{"text":"I went on the Ghost and Vampire Tour  on June 2nd with one of my  high school friends. Our","useful":0,"cool":0},"vA9og0hvr0WE7KpWpokUrA":{"text":"We had LUKE as our tour guide and he was amazing!!! Informative and funny, the tour was a ","useful":0,"cool":0},"kMoXtl4LQcqvfEX-Z_B6Bw":{"text":"This is my first time in Nola. I was sad to find out we couldn't go into the cemeteries wi","useful":1,"cool":0},"VFI9H_v0YUubxbCcNzmgrw":{"text":"A fun tour. Evian was a good guide. The stories were eerie and the jokes were pretty funny","useful":0,"cool":0},"xpfAoourQPzMhnwXtmiUZA":{"text":"We got a groupon deal for 30 for four people instead of 80 and you can make same day reser","useful":0,"cool":0},"YTjsShXeDV5SqcAES8CdlA":{"text":"Fantastic tour today.  Miss Malika really knew her New Orleans history and delivered her s","useful":0,"cool":0},"mVm-0yQesv-y9RPvEBZ8uQ":{"text":"We took the ghost and vampire tour with Justin as our tour guide last night. It was awesom","useful":0,"cool":0},"3tfN8sDNxE0CcXgWQ4vUIg":{"text":"What a great tour! Me and a few friends bought tickets for the Ghosts and Vampire tour and","useful":0,"cool":0},"jamJffSolliJUMjpWxpZ6g":{"text":"We toured St. Louis Cemetery #1 with Ducky and It was fabulous!! He was so outgoing and hi","useful":0,"cool":0},"DgovrAeu0SCRHadRI7z2Lg":{"text":"This was such a great tour!!! Best chose we made....Lee was amazing...so knowledgeable in ","useful":0,"cool":0},"aczXvPmu1SaP218TnYYzlw":{"text":"Dylan Connor was our tour guide to St Louis Cemetery and super knowledgeable and great!!! ","useful":0,"cool":0},"8WngouPU9P_afowaGMNGUw":{"text":"Great tour of St.Louis no.1!!! It was very interesting, informative and fun.  Stella was a","useful":0,"cool":0},"d1g3RV7HMy1hb4D9i_j0qg":{"text":"The ghost and vampires tour: Our tour guide, Dillon, was awesome. He was energetic, knowle","useful":0,"cool":0},"cmhk69atJche1I6DSiOg9w":{"text":"Evian was our Ghosts and Vampires tour guide! It was our second tour with French Quarter P","useful":0,"cool":0},"j5BdeR1BH9LPKHzSHaltQg":{"text":"On Saturday, November 4th, I took a ghost tour with my brother, sister-in-law, and father.","useful":0,"cool":0},"K6srS26qvuqkPU-aIA132Q":{"text":"Lori was so much fun!  Very knowledgable.  I highly recommend the saints and sinners tour.","useful":0,"cool":0},"BaDrodt2GzQ19oBv1HuDNQ":{"text":"This was our first visit to the NOLA and we absolutely had to do a Cemetary tour and total","useful":0,"cool":0},"nxn6w8D5B6Nj_1ju2qCZVQ":{"text":"We took the \"ghost and vampire tour\" and we loved it. Erin was a great tour guide and kept","useful":0,"cool":0},"GspaMChqK-DpO2uWJg9rHg":{"text":"Came with a \"BOGO\" offer on Hurricanes which is a good thing!! Our tour guide was Justin a","useful":0,"cool":0},"M54QMuBrc1NHLLxzjSOWbQ":{"text":"We enjoyed the tour. You walk around the French Quarter while the tour guide stops at buil","useful":0,"cool":0},"TLN6fO0qLNdmuSIs-9-h0g":{"text":"We took two tours through the French Quarter Phantom and both were AWESOME! Our first tour","useful":0,"cool":0},"qtS-zrtLY6gAy9RDqikZJw":{"text":"Amazing tour with an even better tour guide! Loved all the history and curious tidbits the","useful":0,"cool":0},"pbj7FuUiSm6nARN6aAIfrw":{"text":"We had a FANTASTIC tour\nEvian is a fantastic guide!!! \nHe was funny and informative.\nHis k","useful":0,"cool":0},"MjsPhgYlPMbEHczeu7gyxQ":{"text":"Had a great time on the Cemetery Tour of St. Louis #1. And our guide Robert was the best, ","useful":0,"cool":0},"9pew3ewde3hqRw4pnqItFg":{"text":"My wife and I took a tour of St. Louis Cemetery No. 1, which you can't see without a tour ","useful":0,"cool":0},"iq9f0XXRUhiczP-9bZfwoA":{"text":"Highly recommend this tour company! From the VooDoo lounge to the end of the tour, you wil","useful":0,"cool":0},"MysdZGsSSNZ93kKw27Tlhg":{"text":"Stella was a phenomenal guide! She was so funny and knowledgeable. My friend and I visited","useful":0,"cool":0},"QUDb3dcIV9RRAHcHCFfSmg":{"text":"My husband and I took the Ghost and Vampire tour and we had a great time! The historical b","useful":0,"cool":0},"KovhOuleuxYF39RNoRnBkw":{"text":"Just did St. Louis #1 tour with Bobby Thomas and it is HIGHLY recommended. Well organized ","useful":1,"cool":0},"BPzBqX61G85dgm1WBZ9k9A":{"text":"Thomas Webb. Phenomenal tour guide. Very knowledgable, courteous and friendly. Great showm","useful":0,"cool":0},"JnFGEZmkYaHNQRvcHSADdg":{"text":"Had an informative and fun Saints & Sinners tour with Justin. Would be 5 stars if not for ","useful":0,"cool":0},"xQfwI57yMEuhTm15nYIVKg":{"text":"Wow! The difference between this tour and the OTHER over priced uninformative  tour is nig","useful":0,"cool":0},"kzp6trOPa-ISk6JFIGHi5A":{"text":"Erin was so great! We are so stoked that we had her as a guide. This tour was so fun-- we ","useful":1,"cool":0},"EPn5s0CKSIy-gLVXXSh3pQ":{"text":"We took the Sunday morning tour of St. Louis No. 1 and had a great experience. Our tour gu","useful":0,"cool":0},"SBIld6Qrpqx5pby9d1hHmA":{"text":"We had a great time on the Ghost and Vampire tour. Andrew was funny and brought the storie","useful":0,"cool":0},"dzCd1IXPjera38Kvt7e9QA":{"text":"Stephen took us on the Ghost and Vampire walking tour on the Fourth of July at 8. He is an","useful":0,"cool":0},"DlTcu0vSMNn3rmCgZ-oREA":{"text":"We went on the Ghost and Vampire tour this weekend and we had a great time! Our guide Erin","useful":0,"cool":0},"oHpOIc18e4FvnhvRqhDBhQ":{"text":"Bobby Thomas was an awesome guide on our cemetery tour!!!! Very knowledgeable and funny to","useful":0,"cool":0},"v6W-idw5dqWyIB2u-hq2fg":{"text":"We had a great time on our tour. We got a discount for paying online ahead of time. We jus","useful":0,"cool":0},"yMyjtTAHlhET0B327JS7TQ":{"text":"We went on the St. Louis cemetary tour with Justin. He was informative and overall a great","useful":0,"cool":0},"8hWQ1jqETbZg60B2ZVvWLg":{"text":"My best friend and I were exploring around NoLa for two days and were looking for somethin","useful":0,"cool":0},"qZGoNzA3qd7pWXMqG8EXLg":{"text":"My wife and I did the Vampire and Ghost tour with Evian as our guide and it was nothing sh","useful":2,"cool":1},"MZ7uMMVp5Fq4z2JjpF3Mfw":{"text":"While planning a girl's trip to NOLA, my friends and I knew that we wanted to go on a tour","useful":1,"cool":0},"b2BID2FjekcJWihCYuNUtg":{"text":"We walked their ghost tour this evening with Erin and she was awesome! Full of energy for ","useful":0,"cool":0},"xYT_fBFXf-1IVvPfcfdj8w":{"text":"We did the St. Louis #1 tour with Robert the tour guide. He was outstanding. Very informat","useful":0,"cool":0},"XrRoNmTnWSaZCgFznH4T-w":{"text":"The St Louis Cemetery #1 tour was amazing! We had the pleasure of being accompanied by our","useful":0,"cool":0},"dliaPV09aZDcSvY3hR2KFQ":{"text":"I did two tours, one with Malika (Ghosts/history) and another with Justin (Treme Tour). Th","useful":0,"cool":0},"N9aR0PNOJZBmDLz7Fvmm9g":{"text":"This was a great time! Bobby Thomas deserves all of the positive reviews you see about him","useful":0,"cool":0},"U-43JdcgwxYh5JgJqWVoUg":{"text":"We went on the cemetery tour on 12/26.  Our tour guide was Thomas Weber and  he was fantas","useful":0,"cool":0},"n2nZIImY9CBTFHBBlV66Hw":{"text":"Very good tour company. We did the St. Louis #1 cemetery tour. Our tour guide was great. H","useful":0,"cool":0},"3VcTY8HENprK2ETgYfAjNA":{"text":"HIGHLY RECOMMEND! \n\nDid two tours with this company - the Ghost Tour (with Sam) and St. Lo","useful":0,"cool":0},"v6m-havllG9952Fz1LegzA":{"text":"Did the 6pm Ghost and Vampire tour. Justin was a wonderful tour guide and great storytelle","useful":0,"cool":0},"pxSOSPe4iTAhH7RI-9YPHQ":{"text":"This was an amazing tour. Very engaging and full of history. Shoutout to Robert for being ","useful":0,"cool":0},"Uckm7z9ExE6XzAlxlSdFxg":{"text":"***** Five Stars! *****\nWe really enjoyed our tour with you this past weekend...and Bobby ","useful":0,"cool":0},"ANve4yODTqxwHpjO8WOfeQ":{"text":"Awesome cemetery tour with a funny and informative tour guide (Aubrey). A fair amount of h","useful":0,"cool":1},"7CYLZfaEUUjiG7L0I-vxOg":{"text":"Went to New Orleans for vacation. It was my fiancee's first time there so we took the ceme","useful":0,"cool":0},"J-H1ckPtxKhLzVDJ3JY19Q":{"text":"I loved this tour (the ghost and vampire tour). Angela (I am pretty sure that was her name","useful":0,"cool":0},"6WMSZkHNIjTmtX-k5H2_cg":{"text":"We did a couple of tours offered by French Quarter Phantoms - the ghost and vampire tour a","useful":0,"cool":2},"POrcqq8QWASjj79qtAo8HA":{"text":"Did the ghost tour with Dillon. Everything was great. Even with the rain he kept everyone ","useful":0,"cool":0},"G04AxfSSKb-FpMg5kDf_2g":{"text":"We had an awesome tour with Dylan on Thursday 7/26.  We do 'haunted/ghost' tours in every ","useful":1,"cool":0},"9dWIT7lzQFL1nN62uTswrg":{"text":"Our tour guide, Justin, was very funny and got the stories out clearly. The tour wasn't ne","useful":0,"cool":0},"aJNzf5h2HgIcWhnqoTcdyg":{"text":"Luke was amazing!  Not only was he an exceptional tour guide, but he made sure the whole g","useful":0,"cool":0},"62NoFATq8L270EO7jdGzyQ":{"text":"My boyfriend and I joined tour guide Lee for his Garden District and Lafayette Cemetery to","useful":0,"cool":0},"Sbgw0K3hoTFltI7vipfurQ":{"text":"I booked the St. Louis #1 Cemetery Tour and could not have been happier. Our tour guide wa","useful":0,"cool":0},"oAnyKWh0UZfFKBdqhbW6VQ":{"text":"This was such a great and spooky tour with historical crime stories in the French Quarter!","useful":0,"cool":0},"CFCurHA71KWBes412UYsVg":{"text":"This place is great. I went here while on my honeymoon. First of all customer service was ","useful":0,"cool":0},"ld4szb1ezYNo2_po9XbNyw":{"text":"We did the cemetery tour. I have to say our tour guide Jay (what I remembered) is the best","useful":0,"cool":0},"aNDeBDzFQ_t-6ig_VAdiXQ":{"text":"I had a really wonderful time learning from our tour guide, Lee (Leigh?). His stories were","useful":0,"cool":0},"QQJ05QLAGBYxysfuZeJSLA":{"text":"Did a private tour and was the highlight of our bachelorette. Our guide Justin is absolute","useful":0,"cool":0},"QLbnkWjrK7fTRNzz00yO8w":{"text":"Our tour guide, Mike, was the best we could ever ask for. The ghost tour was definitely th","useful":0,"cool":0},"acDqjJkbo5rkx7HQF1OP2A":{"text":"Had an amazing experience with our tour guide Emily,would recommend to everyone who is vis","useful":0,"cool":0},"uHnSac7f-wbKkx9eCGePaQ":{"text":"This tour was such a bang for our buck, and we loved every minute of it. Ashton was our gu","useful":0,"cool":0},"vLVIwRL_TBhbou49cWSZbQ":{"text":"Our tour guide (Sam) was amazing! He was passionate about the subject, fun to listen to, a","useful":0,"cool":0},"jtZY61ZQteQuSR-TcIwHcw":{"text":"I went on two tours. The first was a ghost and vampire tour about a year ago. It was great","useful":0,"cool":0},"rb2BhY2Ps-W7quhq3HD_hw":{"text":"Had the pleasure of being guided by Bobby Thomas.  He was very informative, witty and funn","useful":0,"cool":0},"VIfBuMM0Y_IZGcDDQfPxbw":{"text":"We did both the Cemetery tour during the day and the Ghosts and Vampire tour at night! We ","useful":0,"cool":0},"ZzIafFArNqZ7sxlabx_SqQ":{"text":"Dartanya was awesome! We did the cemetery tour and although the cemetery was packed, she m","useful":0,"cool":0},"Ki6Aowhjk8DNBUXX-WjWJw":{"text":"Went on the cemetery tour with Lee and loved it!! I would definitely go on another tour wi","useful":0,"cool":0},"UwSiMmWD_XSlBE6RmPdDWg":{"text":"Did the Garden District Tour yesterday with Sam with Pirate. \nFirst off! Awesome dude!!! T","useful":2,"cool":1},"HBcQaqKaFanztSjyZqYNgA":{"text":"My friends and I did the cemetery tour. By the end of it we would have rather been in the ","useful":0,"cool":0},"2-ZPLNt1KT2xtb4YiSWYWQ":{"text":"Luke and Hope were our tour guides....Fantastic. Great mix of history and suspense. Very f","useful":1,"cool":0},"mxNC6k3ZwqPT1A93Ec49RA":{"text":"Miss Angela's Saints & Sinners Walking Tour was a blast!  It's an adults-only walking tour","useful":0,"cool":0},"tz763AGRgEGSfo2qPzGA3w":{"text":"Luke was our tour guide. He was very knowledgeable and friendly. Enjoyed his stories on th","useful":0,"cool":0},"YEcy_0c1c1Af_vtee22tMA":{"text":"We had Bobby Thomas as our tour guide and he was great! So funny and informative! We walke","useful":0,"cool":1},"r1h-xu_lkYbBkoFTybhKIQ":{"text":"Lee was a phantom-al great, knowledgeable, and passionate tour guide. With his enthusiasm ","useful":0,"cool":0},"zrRHu65PToyA1cfp8T6Cag":{"text":"This was our first time in New Orleans and it was a great way to get a tour of the French ","useful":0,"cool":0},"YL0VHYDdhmxaYFDJfBKjyQ":{"text":"I had a lot of fun on our tour! Justin is an awesome guide that seems to really know what ","useful":0,"cool":0},"czN_h4mriUE5Wuti8zA3ug":{"text":"We had a 6pm, 2 hour walking tour with Lee earlier in the week. He is a fantastic guide an","useful":0,"cool":0},"xQ5Q9eCEEMdKe_JBat2lgQ":{"text":"Luke was absolutely fun and knowledgeable about the history in NOLA.  I love ghost tours a","useful":0,"cool":0},"xyMzHpT-YwX5YMzt8omAKQ":{"text":"We booked this tour, on a whim through Groupon. Our tour guide, Luke, was great. His offbe","useful":0,"cool":0},"lLGHL8W53Xk5H8p35fsSCA":{"text":"We did the ghost/vampire tour last night and really enjoyed it! Our guide was Bobby who wa","useful":4,"cool":1},"1CPMKJ7xxqf36o_9ocdRzA":{"text":"This tour was an awesome way to spend our opening day in New Orleans! My wife and I thorou","useful":0,"cool":0},"QrYrfyc22_9R6x19HC4T6w":{"text":"Miss Emily was amazing. Took this tour last night with my son and she was full of knowledg","useful":0,"cool":0},"QAhoX6s2gHSCw_7V9x7BEw":{"text":"We had Bobby Thomas as our tour guide and he was great! So funny and informative! We walke","useful":0,"cool":0},"JTnfcUgV42HRbcdKPHZHWw":{"text":"We thoroughly enjoyed the cemetery tour with Luke. Fascinating history. Learned a lot and ","useful":1,"cool":0},"0uel4oAK2UPJz2pIpEhsVg":{"text":"The cemetery tour was really cool! I highly recommend Justin - he's funny and makes the hi","useful":0,"cool":0},"_aiBr3UZEz2MOPJAXjNPHg":{"text":"Bobby was an awesome and hilarious tour guide! He seemed way more interesting than the oth","useful":0,"cool":0},"7Ldu98srO85WSZz6RXuruQ":{"text":"Two trips to NOLA, two tours booked with French Quarter Phantoms and we were lucky enough ","useful":0,"cool":1},"hkqxol3ZooxK75-CWi214A":{"text":"This tour was a lot of fun. Our guide was Bobby and he was phenomenal. Great sense of humo","useful":0,"cool":0},"nwW_NVMYNNwGgKUhbqO9Bg":{"text":"Andrea was a really great tour guide. She was really realistic in her stories and allowed ","useful":0,"cool":0},"xjJs2jx5g3Hupj-2YaGiGA":{"text":"Booked a group for a Ghost Tour, but it seemed like we got more of a French Quarter Histor","useful":2,"cool":1},"h6AYNMx78yc7uueq8o_3NA":{"text":"BOBBY THOMAS!! Such a good tour guide. Super super passionate and dedicated to telling sto","useful":0,"cool":0},"mdu6nturmOiJBVIbuDtF0w":{"text":"Every time family comes into town to visit and we want to give them a quality tourist expe","useful":0,"cool":0},"rrBBH32uzxlmRYCcq3O2Iw":{"text":"Our tour here was outstanding! Richard had a contagious spunk and passion. His extensive k","useful":0,"cool":0},"-m2zRHPxi7CX0obvgDAjjw":{"text":"The Saints and Sinners walking tour was one of 3 I took during my short trip to NOLA, and ","useful":2,"cool":4},"K5SoRIaXVtQzFK2FJxy__g":{"text":"We bought a groupon for the Garden District and Lafayette Cemetery tour and it was very go","useful":0,"cool":1},"v_lVlLwkBZNwbF1mhoSZ5A":{"text":"We did three different tours with three different tour guides: Luke, Darthenia, and Justin","useful":0,"cool":0},"PxVRGcR3crvkPOzvUijgrg":{"text":"We really enjoyed our tour of St.Louis Cemetery number one. Our tour guide was Robert and ","useful":0,"cool":0},"pD8w11XIf1r-9mXAG1o1Cw":{"text":"Our family of four took the 8:00 Ghost and Vampire tour last night and loved every minute ","useful":0,"cool":0},"nBN-iUgfZ4QDyEfjsMwEMQ":{"text":"We did the St. Louis Cemetery No. 1 tour on Sunday, Dec 8 at 1:00 before our flight out. L","useful":0,"cool":0},"5EFTaK1jg1os50ifrdHxcA":{"text":"Excellent ghost tour!! I live in New Orleans and decided to take this tour with visiting f","useful":0,"cool":0},"WCOpH0K82OSq3ecWGikzjw":{"text":"Did the St Louis Cemetery tour this morning and it was surprisingly good. Why surprisingly","useful":0,"cool":0},"eYqJBbtiaqRsgK8HNK4Lew":{"text":"MALIKA is the best! She is so funny and does an amazing job. 100% book a tour with Malika!","useful":0,"cool":0},"dKaJTaYzRy-3T9xoZIWhdg":{"text":"We loved the Saints and Sinners tour with Evian!!  He is a wealth of NOLA history and brou","useful":0,"cool":0},"Y_-wSWvX95OOq26sDlwl8g":{"text":"We did the Ghost and Vampire tour with Steven, and we cannot say enough about how amazing ","useful":0,"cool":0},"0yVwdszHEzt1gJrAeTiwAQ":{"text":"My friend and I did the \"ghosts and vampires\" tour during the Covid restrictions and had a","useful":1,"cool":1},"5dkoimWiHd6K8UsSXUzQDw":{"text":"Justin was awesome and well entertaining. He didn't hold back on any details and also made","useful":0,"cool":0},"vaA53fxJ8KaiRE8m4YH1kQ":{"text":"Took a ghost tour with Bobby on 12/23. What a great knowledgeable tour guide! He did a gre","useful":0,"cool":0},"zVGBnUCDSzFYbkNCq14y-Q":{"text":"Took the St.Louis Cemetary #1 Tour. Justin was our tour guide. He did a great job! He kept","useful":0,"cool":0},"TPwmsSWfrEmy8xn4EERVWw":{"text":"Erin was very knowledgeable and humorous. She provided great historical background and kep","useful":0,"cool":0},"cbOPbdcwvRUvZEd_kalSCg":{"text":"Came to NOLA for the first time and was only there for two days so I wanted to get a littl","useful":0,"cool":0},"kUYDy1LWdFMT4V3krpBxNw":{"text":"Adding pics from my trip. Just thinking of New Orleans today under another hurricane and o","useful":1,"cool":0},"_K0Ar5vFYLa3Uc2eI710zA":{"text":"Lee!!! You're the best. Thank you so much for an awesome tour tonight! Although I may now ","useful":0,"cool":0},"iSEs5vSq9rHcTN-yNsQUxg":{"text":"Fantastic tour from Robert! We really enjoyed hearing about the history of the cemetery an","useful":0,"cool":0},"aSKmDEI-Kk_xUYB1WAF3ZA":{"text":"We were greeted by a VERY RUDE person in order to check in.  The tour was ok, we had MJ as","useful":1,"cool":0},"TcYNyaMlmzFI4aK_FsaQmg":{"text":"Took the tour with Bobby Thomas for the Ghost&Vampier tour! He is great story teller! Had ","useful":0,"cool":0},"gtYvtzArl1G0jCvZuh9aTg":{"text":"I went on the ghost and vampire tour with some of my friends and it was incredible! Our to","useful":0,"cool":0},"xCae-nYdRbFTaZmiKEk0Pg":{"text":"We were on a tour today with Justin. He was a riot and so mich fun. I actually loved the f","useful":0,"cool":0},"XSJZDVkTeo5tjuqBoiEXBw":{"text":"This tour is a MUST when going to New Orleans! We had Luke as our guide and he was absolut","useful":0,"cool":0},"pQNsN0Ue0xTn-VwAD4q6FA":{"text":"Bobby was hands down the best tour guide I've had on any tour. He was super knowledgeable,","useful":0,"cool":2},"E8DSdXtijgJOW31MQmSMyw":{"text":"Not scary but fun and informative. I've been on ghost tours around the country, because I'","useful":1,"cool":0},"U1WTTgz8K9B5h-IWrwzAIQ":{"text":"Went on the Garden District/Lafayette # 1 walking tour w/ Ducky. He was hilarious, knowled","useful":0,"cool":0},"AklL4EOx3QLFS1yJBLHsuA":{"text":"Very fun and informative!  If you love all things paranormal, you must take this tour.  Dh","useful":0,"cool":0},"toATwhnvGhy10kIk8Y82pA":{"text":"Miss Malika it going on with her storytelling skills: charismatic, authentic, engaging, hu","useful":0,"cool":0},"Ott1FHcoeqm9hW_um6S-gg":{"text":"Cemetery tour is well worth the price-can't go wrong for $17 for two hours. Justin was ver","useful":0,"cool":0},"66o4fvaPIYhZTCFwAxHh8g":{"text":"Saints and Sinners tour w/Miss Angela!!!   Such a great experience.  She is a masterful st","useful":0,"cool":0},"GR_bDB8oYUeF8of0zd11gA":{"text":"Not only was this tour very informative, and affordable but the tour guide (Bobby Thomas) ","useful":0,"cool":0},"LhE-2oojtiiHvRtOF-ikow":{"text":"Went on the Cemetery Tour with Justin, and it was awesome! Justin went above and beyond to","useful":0,"cool":0},"sJao1zTfQDheQOctzjQFWA":{"text":"My friends and I went on the St. Louis Cemetery #1 tour and it was AWESOME! Our tour guide","useful":0,"cool":0},"QxxE7HT95vQSKQJ6OE7x3A":{"text":"This was truly a great tour! I was a little apprehensive to take a tour of this nature bec","useful":1,"cool":1},"uDf7knLVSdyzwb7Vc3sX9w":{"text":"We did the St. Louis #1 Cemetery tour with Bobby Thomas and it was fantastic.  We had a wo","useful":0,"cool":0},"s4sPPuJtv4P0e16mYlRYTw":{"text":"I did the Cemetery #1 tour with a group of 13 people. We got a Groupon deal which was grea","useful":0,"cool":0},"qPnAdg1tOPr-NiqxfGWSOg":{"text":"We took the sinners and Saints tour with Bobby! He and the tour were awesome. It was great","useful":0,"cool":0},"agiqMIxX5BgFT6xnUxX2IQ":{"text":"I have multiple reviews because we took multiple tours with this company.  We took the Gar","useful":1,"cool":0},"Pn_BTVqXpyycD_xkyPWZWQ":{"text":"I'm glad my friends and I decided to do the night ghost and vampire tour. It was a great e","useful":6,"cool":0},"JBHjiumUZYX98TdKU4xoZA":{"text":"Came to NOLA for a bachelorette party and did this tour with my girls! We did the Saints a","useful":0,"cool":0},"RGeuuJC1wxbFLLcSY4l78w":{"text":"It was a nice tour...glad I went. Robert the tour guide was great! Very funny and had plen","useful":0,"cool":0},"vgHOOqoy7zO35A2r3G09Tw":{"text":"We were in New Orleans just for the day and decided we had to check out a ghost tour. We p","useful":1,"cool":0},"9jeYYhVfeICQ3K240-QAsg":{"text":"I went on the Ghosts and Vampires tour. Malika was an incredible storyteller and made the ","useful":0,"cool":0},"z-cAFg0SMqJPZ7xtdlxUeA":{"text":"Not my first time in New Orleans, but my first time to do a cemetery tour and it was aweso","useful":0,"cool":0},"E7CsfulHT1c2kcLqoC2pVg":{"text":"Bobby Thomas is an amazing person and a great story teller defiantly recommend going great","useful":0,"cool":0},"kRlzaD1FUCHkCNIoikiR4A":{"text":"We took the St. Louis #1 cemetery tour and had a great time! Our tour guide Lee was knowle","useful":0,"cool":0},"HHIeV9HanGd7zBznr2aV2g":{"text":"Not impressed at all.  The hurricane special didn't seem very special at all. Drinks were ","useful":1,"cool":0},"IPJ7mRH57I2WdMA12FLsdA":{"text":"We took the tour of St Louis Cemetery.  Our guide was Ducky.  He was an excellent guide an","useful":0,"cool":0},"8V9wQhX6u-XfnauQQY9Zyw":{"text":"In town for the Saints and Pelicans game and decided to check out the ghost tour.  Great t","useful":0,"cool":0},"7TQVYqxywyxIm2U4r5MbpQ":{"text":"It was phenomenal. We went there expecting something good and it was an over the top exper","useful":0,"cool":0},"seYoCXSHHXkERdCXSlahQA":{"text":"I must say this tour was amazing!  We had Bobby as our tour guide and he did an excellent ","useful":0,"cool":0},"o3rCkRwdnlp8RYSfR_Ui7A":{"text":"Unfortunately our party found this tour disappointing.  Chose this tour as it was suppose ","useful":1,"cool":0},"7v6WboqLBVrzvIdrmpcqSg":{"text":"We took the cemetery tour this morning with Robert and he was very knowledgeable and infor","useful":0,"cool":0},"QKsX2RGd9WUdoPVPc64Pjg":{"text":"I highly recommend Justin (Tour Guide) of the \"Saints & Sinners\" tour. I almost did not ta","useful":2,"cool":1},"xymKmRoF2F6EyOORL7kyog":{"text":"We had an amazing time! We took the Ghosts and Vampires tour, loved the spooky locations a","useful":0,"cool":0},"0dsAU4Kq98dNktglHmVMZQ":{"text":"It was a very rainy day.  We had purchased through Groupon (as you should too).  My three ","useful":1,"cool":2},"UqiVn4KGMR4NyUV1aFHuDQ":{"text":"Best tour company! You always get a good tour they have top historical  tourguides top rat","useful":0,"cool":0},"foKB3bjoEVlj_swd5-zq_Q":{"text":"This was the world's best tour guide and tour. I dragged my boyfriend along to this and he","useful":8,"cool":2},"P3rVFv7XaL2XDMHz66dJBA":{"text":"We loved the Garden District walking tour with Lee! He was full of information and knowled","useful":1,"cool":0},"EeyEK1lDN0mCOm_C-egxCQ":{"text":"Erin is an amazing historian.  She is funny, smart and engaging.  We enjoyed the tour.","useful":0,"cool":0},"Xc0UsP_YKVJxoGf_COfdrQ":{"text":"Evian?? Was our tour leader. Sorry, dude! I think that's how you said to spell it. Fantast","useful":0,"cool":0},"CzZxqYx63HcKtn5ySu0CgQ":{"text":"What a fantastic tour, Lee was great! very informative and interactive, really well versed","useful":0,"cool":0},"wsBeto0agVLjHSP3tkmu5A":{"text":"Dylan was an amazing tour guide. Friendly, knowledgeable, competent and polite. I highly, ","useful":0,"cool":0},"MBivCEU22xHIK_J5u0YnYA":{"text":"Went on two of their tours.  Ghosts and Vampire tours last night and Cemetay tours this am","useful":1,"cool":0},"s3qHNTrWz5-AlMJo90QhzQ":{"text":"We had a great cemetery tour with Malika!!! She was so knowledgeable, told great stories a","useful":0,"cool":0},"JDQDCrHHGrRZ2M9fsyEpAQ":{"text":"Dhruv is the best guide ever. He is so sweet and funny, will make your whole tour with all","useful":0,"cool":0},"G45LlAANfGwOyoX9qcnX7w":{"text":"My fiance and I booked our tickets to the St. Louis Cemetery Tour just before New Year's E","useful":3,"cool":1},"0HxrHdqG89swvYy2YSkZTA":{"text":"My friend and I had found a Groupon for the cemetery tour and since neither of us have bee","useful":1,"cool":2},"hzZKS75wOWP0Bu1f2qI_ZA":{"text":"Bobby was the best! Really cared about the stories and great historical background. Great ","useful":0,"cool":0},"IaiZAYfUWbL77aEuEc3kOQ":{"text":"Very good.  The tour guide, Dhruv, was phenomenal. Very informative, funny, and energetic.","useful":0,"cool":0},"jMoHlAoWxZ46Lo1adMOM8g":{"text":"My husband and I did the true crime tour and the ghost tour this past weekend while we wer","useful":0,"cool":0},"m5QbAF9_NseI9YzoRxkvNg":{"text":"Steven was a great tour guide. He loves the city and it's obvious. We took the tour with s","useful":0,"cool":0},"nLcb4aVugay4ShpgpWZF4g":{"text":"Absolutely loved the Ghost and Vampire tour with Evian. He kept me interested and on my to","useful":0,"cool":0},"RjSQhMr_aZFOKdQxVCqWnQ":{"text":"The St. Louis Cemetery No 1 is well worth the time. Mary J was an excellent tour guide out","useful":0,"cool":0},"J8jpu4eXNnmWO-0ShuNvcA":{"text":"Amazing, informative tour.  Dylan was hands down, the best guide ever!! Ask for him!!","useful":0,"cool":0},"ZetO6C_rO6Jj9pZXJ72SCg":{"text":"Fun tours! We had the ghost tour and the cemetary tour. Both were awesome! Bobby did our g","useful":3,"cool":2},"1vmGHGXMMP-drPnhFFG3tg":{"text":"We did the ghost and vampires tour our first night. The guide was Lizzie and she was just ","useful":0,"cool":0},"ndw2UlEQYcDX-Sksr9LUBw":{"text":"Out of all the tours we chose French Quarter Phantoms for a Friday the 13th Cemetery Tour.","useful":0,"cool":0},"mzUp-aFPeBQOBryXSELCRw":{"text":"Mary J. is an excellent guide. Part historian, part justice-seeker, part stand-up comedian","useful":0,"cool":0},"BdYf1GnnthKB8p-39if0WQ":{"text":"Took the Cemetery Tour today with Justin. Hands Down one of the best tours and guides EVER","useful":0,"cool":0},"XKtkE4FTdNasEY5q4BAJzg":{"text":"We took the St. Louis #1 cemetary tour. It was amazing. We had Angela as our tour guide. S","useful":0,"cool":0},"cONz9LYNg3iMebIIKEsCoA":{"text":"A must do experience our your trip to NOLA! While there are a lot of tour companies in the","useful":0,"cool":1},"XXTGoNZMe1ObvTTLozcWyQ":{"text":"Went on the Ghosts and Vampires tour with Erin, who did a great job of getting us through ","useful":0,"cool":0},"nm9TAWGdmyFi2pclLUjv1Q":{"text":"Lee was a great guide! Even though I've been on many ghost tours, I learn something new, o","useful":0,"cool":0},"efAXwN8dDThUkGIH8XLb-w":{"text":"\"GONNA TAKE A GHOST TOUR...WORTH IT?\"\nYes but adjust your expectations.\n1. These tours are","useful":9,"cool":2},"r0374PEO1IApw16NgaS4WA":{"text":"This walking tour was by far one of the best Gractivities I've purchased! Malika was our t","useful":0,"cool":0},"c0TL1cKML5RGHbweQOZ5lw":{"text":"We enjoyed a great two hour ghost and phantoms tour with Andrea. She's very knowledgeable,","useful":0,"cool":0},"aryD9Ojcvxxm-RYmg83tBg":{"text":"Erin was great! We really enjoyed our time on the tour, and loved Erin's energy and enthus","useful":0,"cool":0},"YQxABTYltSMmCryWI7A-IA":{"text":"Go no where else! This tour was excellent! Bobby Thompson (hope I got his last name right)","useful":2,"cool":0},"EBAeaz7BQAwLLI9-yx6atQ":{"text":"We did the Ghost and Vampire and the Cemetery tour! Absolutely worth every penny and time!","useful":0,"cool":0},"7q221CnEwxklatLOAaIing":{"text":"Went on a ghost tour with Ducky and a cemetery tour with Audrey (or Aubrey, sorry if I but","useful":0,"cool":0},"dz3-qogBGds35-YcV2jD4Q":{"text":"Went on the Garden District tour today.  The tour guide Ducky was by far one the best part","useful":0,"cool":0},"nyxHlX4EIAEdlQxH0lDUXg":{"text":"Robert was F A N T A S T I C. Such a great storyteller with such a rich knowledge of the N","useful":1,"cool":0},"f5zyiWA8YnMfRtQlhQ8nMg":{"text":"We took the ghosts and vampires tour, and our tour guide Sam was wonderful! Engaging, funn","useful":0,"cool":0},"EFMFUBDGWOctqVqQpkCYCQ":{"text":"We had Steven Lewis for the Ghost and Vampire Tour and he was awesome! Loved that he told ","useful":0,"cool":0},"mGi4-SCG2hUa8FIlvhBA4A":{"text":"Took the saints and sinners tour just now, with Robert Thomas. It was freaking hysterical.","useful":0,"cool":0},"7TNJ6i14OomeVAorRsTJnw":{"text":"My boyfriend and I decided to do this Ghost tour last minute. Jeremiah was an entertaining","useful":2,"cool":1},"n0yYQGtjA8kiB6Xj9XQqBw":{"text":"My friends and I did the True Crime Tour with Thomas as our guide. Thomas was very enterta","useful":1,"cool":0},"gNdzJ-XoHEIMC5d-HI9awQ":{"text":"Malika was awesome!!!!  Give her a raise!!!  She was super intelligent, charismatic and un","useful":0,"cool":0},"m976yuTm7JHvscE3kp8JFw":{"text":"We had a really fun tour with Bobby of the Cemetery. He was incredibly funny with the righ","useful":0,"cool":0},"ZtMQ41uRpsizv1Hmi2ZB3g":{"text":"Came to NOLA on a Bachelorette trip and booked the vampire/ghost tour last minute. Great d","useful":0,"cool":0},"r1BXoCQLkTs65gB59_vYfQ":{"text":"On the advice of a friend, my husband and I booked the cemetery tour for Sept. 2nd.  Steve","useful":1,"cool":1},"wOY9LYwNmQURfCpmGLFL_w":{"text":"Our tour guide Lee was awesome! He made a long tour in 90 degree weather way less gruesome","useful":0,"cool":0},"9SsCR1y-TurGeklRjEHMLw":{"text":"Did not enjoy the tour personally, as did not care for the style and delivery of the tour ","useful":0,"cool":0},"X_l9rJZSF2MX6tuPZV1HAw":{"text":"Found this online and was so so glad we did it! Even though it was raining our tour guide ","useful":0,"cool":0},"tWXAyo4sfRWDqjOxYpoVgw":{"text":"Great tour - Angela was fun and interesting.  Definitely try to do if you have the time !","useful":0,"cool":0},"aSNK8Z101Bjzyf-pTqWFfA":{"text":"Great tour guides!! Followed my Yelpers and bought tickets for 2 tours through the Phantom","useful":5,"cool":3},"K6MzFbvy4fgVW5oQ1wx5Dw":{"text":"Ducky was awesome! He was very fun and funny. Took ant interruptions well and loved our gr","useful":1,"cool":1},"WApQMVGBsIoApdPlwqdkZg":{"text":"We did the ghost and vampire tour with Rhodesia she was an awesome storyteller and so much","useful":0,"cool":0},"eSkBeqHEoWklux8t9UGAHg":{"text":"Andrea, our tour guide was amazing! We enjoyed our entire trip, and learned some incredibl","useful":0,"cool":0},"WkPpx0rHorsVO9RBEJXN1g":{"text":"Our family went on the Ghost and Vampire tour at 6pm this past Saturday (May 8) and had an","useful":2,"cool":0},"0jTOSGci2we2OXFm3d7mfA":{"text":"Loved the ghost and French quarter tour with Bobby Thomas. Thank you sir for adding some m","useful":0,"cool":0},"rV_wB41rW_3DPqrbfthq1Q":{"text":"I've been on 2 tours with them and have been happy.  The tour starts off with 2 for 1 hurr","useful":0,"cool":0},"F7ZIttNXVOR3cIRkXBUAFw":{"text":"Ah, hell yeah! What an introduction to a fascinating city! I was totally blown away by how","useful":1,"cool":1},"jHG3ru3MlObIVhyuGDKbGg":{"text":"Our fist visit to New Orleans we did the Ghost and Vampire Combo Tour by French Quarter Ph","useful":0,"cool":0},"RnC81mcdOGNtL_vIJTCUxg":{"text":"Malika gave really fun and educational tour last weekend. I have been on ghost tours in No","useful":1,"cool":0},"lRgiQ6Bw4kq0i9kvqZtYHw":{"text":"Justin was our tour guide for the Saints and Sinners tour. He made learning some history a","useful":0,"cool":0},"6SXm80OfsihaKxhn74hf5g":{"text":"My friends and I spent a weekend in NOLA around Mardi Gras this year, and this tour compan","useful":0,"cool":0},"WMiMIPDQK5I_LxxQt9ChZg":{"text":"We did the Ghost and Vampire tour (Justin) and the Cemetery tour (Robert) both guides were","useful":0,"cool":0},"kG17Z85QhXUdBmUtDQCK2Q":{"text":"We went on the ghost and vampires tour and it was awesome! Not only is the tour very infor","useful":0,"cool":0},"PDqyzARJ5xaS_6AEqCb3jg":{"text":"This was a wonderful tour, probably my favorite activity while in New Orleans for the week","useful":0,"cool":0},"LW5y-uaxmSpHX8lZxIC8dg":{"text":"I absolutely amazing tour. I learned so much about the above ground cemetery. Our tour gui","useful":0,"cool":0},"AIB7GghE3PiPZZEBstF-LA":{"text":"Ghosts and Vampire Tour kicked off at VooDoo Lounge with 2-for-1 hurricanes! Rad, even if ","useful":14,"cool":8},"urY39XziboKK_8un0BGtEg":{"text":"This tour was very disappointing. My friends and I made up half the tour and yet when one ","useful":5,"cool":2},"5s8EM74MkfTEgUKcNOTEgQ":{"text":"We did cemetery tour with Justin on a Sunday afternoon. It was very fun and informative. W","useful":0,"cool":0},"yCJMRKqysniPTtnT-eQtHw":{"text":"We went on the Ghosts and Vampire tour with Bob. He's a great storyteller. He was personab","useful":2,"cool":1},"dtkLpcTevk1-dlRvGErlrA":{"text":"We did the ghost and vampire tour and it was awesome!! Andrea was a phenomenal tour guide ","useful":0,"cool":0},"plA4NfuINBMnoztbDtl7mQ":{"text":"We did the Ghost and Vampire tour. Erin did the most amazing job ever! She was wonderful a","useful":0,"cool":0},"emw0X2F5ZE6t-fFvOgBT0w":{"text":"My wife and I took a walking tour of the Garden District. Lee was a fabulous guide with in","useful":0,"cool":0},"HUBrHXnvctHVqa7KcNdyIg":{"text":"This was a walking tour. We met up with the tour guide at the bar. The group was fairly la","useful":1,"cool":0},"bI-a_sWkPVJPDFaRjV-oYw":{"text":"After a vandalism incident of voodoo queen Marie Laveau's tomb, the only way to visit St. ","useful":10,"cool":8},"C_c22ZvXvjUw_9DMsdGPYA":{"text":"Great tour, great customer service! Our tour guide Justin was excellent. Kept our attentio","useful":0,"cool":0},"Vg4LedwJgAZX0ldGAqACjw":{"text":"We took the cemetery tour and it was fantastic. Our guide Luke was super knowledgeable, su","useful":0,"cool":0},"dPZj1JU-umF37U6ni14hAQ":{"text":"We did two of their tours, the French Quarter History & Voodoo, and the Ghost and Vampire ","useful":0,"cool":0},"t_ZmyXuDBGxjkMLbZ1UCig":{"text":"We had so much fun on our tour with Erin! Her wealth of knowledge was astounding! We felt ","useful":0,"cool":0},"MGI1FCcvQpPTuIJtUKbwjQ":{"text":"We had a great time with French Quarter Phantoms this week! Found them threw Groupon and s","useful":2,"cool":0},"SEUahRLMB46Xx0wCCgBPJw":{"text":"The only bad thing was- the starting  point was a long walk from the hotel. However, We we","useful":0,"cool":0},"gWKBFqZKiVwI9ifC0KI61g":{"text":"Took the Saints & Sinners tour & Robin was our guide. We thoroughly enjoyed it. She knew h","useful":2,"cool":0},"gb-Thz79tEdxS3zpCM2hLw":{"text":"St Louis tour number 1. We had luke! He is great and needs a raise  great guy full of know","useful":0,"cool":0},"xtVKybzRS19Lqarf158U4A":{"text":"Robert Thomas was hilarious, informative, and made this tour great.  Easily one of the bes","useful":1,"cool":1},"MnefKah7DCGYdAGlWhzbDA":{"text":"We took the Vampires and Ghosts tour on the recommendation of a friend and we really enjoy","useful":0,"cool":0},"Fyj1bX9D9ks6F5wwDpiWDA":{"text":"Meh, not much to see unfortunately. No ghosts, and no scary stories. Sorry!","useful":0,"cool":0},"4rTtXqFuIdFLBjIeYPVMYw":{"text":"Justin was our tour guide and he was absolutely amazing!!! I took the saints and sinners t","useful":0,"cool":0},"nXjKISXQNi-RIMVY0oCA8w":{"text":"My group of 6 took the Vampire and Ghost Tour. I expected to be taken places where we woul","useful":1,"cool":0},"Kw5vS01hIEuREU2a50bANw":{"text":"We did two tours here, one on our first night in New Orleans and one again the next mornin","useful":0,"cool":0},"TgMv3IKmSVaSAwG4LP6fdg":{"text":"Such a cool tour with some fascinating ghost stories! Our tour guide, Luke was entertainin","useful":0,"cool":0},"R7w078VDSu9DKnRqA0DTSg":{"text":"We booked the garden district/ Lafayette cemetery tour. And we absolutely loved it, even i","useful":0,"cool":0},"4vMr3N78chTi5aUgV-BABw":{"text":"I love to visit historic cemeteries so we took the Cemeteries Walking Tour. This was a ver","useful":0,"cool":0},"0eWMx48436MWHU_KhMtiuQ":{"text":"The tour was awesome. We had Justin as a guide, he was hilarious and a great tour guide. Y","useful":0,"cool":0},"GgLNMBgRXOsHQFXRECaMng":{"text":"Adalaide was amazing! Very informative tour, with excellent storytelling! It is my favorit","useful":0,"cool":0},"ILhD36wGbaNXK-bL_edcgw":{"text":"What a great place to explore so much of one part of New Orleans. I booked three tours wit","useful":1,"cool":0},"3nZsq2Guaja1QDqGfR3ubw":{"text":"Loved this tour, get your walking shoes and fans. Starts out at Voodoo lounge you get BOGO","useful":3,"cool":2},"BY-GF5Ju_2zqh6C6XXl6Dw":{"text":"Went to.the 8 pm phantom and vampire tour, tour guide Mary J, and had a great time! Took a","useful":0,"cool":0},"DWl-h_BamX9l4rBrrNEKFw":{"text":"French Quarter Phantoms is located at the back of the Voodoo lounge dive bar.  Just check ","useful":9,"cool":8},"36_nmb4hMryatTt56IQozA":{"text":"We took the Garden District tour this morning. Was pouring rain when we were about to set ","useful":1,"cool":1},"tpZUjF7QNGJXNhzE5qINGA":{"text":"While down in New Orleans, my friend and I did the Saints & Sinners Tour put on by French ","useful":20,"cool":22},"U3ZiHZB6LNovQnNbh5Du9g":{"text":"Omg Justin and Steven are the best tour guilds I've ever had!!! Please honor these guys be","useful":1,"cool":0},"yZR63QI8P4OJ3iJb2WSx9Q":{"text":"Completely surpassed my expectations. I am not usually one for tours and was expecting a d","useful":0,"cool":0},"6mqEiZpV4vGmCsb-HeRSMg":{"text":"We did the St. Louis Cemetery tour  at 1pm and enjoyed it very much! Our tour guide was in","useful":0,"cool":0},"QbNMbqiXDjnHv63siHqE7g":{"text":"So glad we booked a cemetery tour! The history of the cemetery's are fascinating and our g","useful":0,"cool":0},"uS6WoDTjRXye__HIwLJ_Ow":{"text":"GREAT TIME. learned so much information without it being boring. our tour guide luke was s","useful":0,"cool":0},"9dyyWtYUuhGkJ4LTbBx8wg":{"text":"Ghost and Vampire tour with Angela was amazing. It's more than just a scary ghost tour, it","useful":0,"cool":0},"1GeZRRizJeChOlkNmRzz7A":{"text":"Oh what a way to initiate our stay in New Orleans!\n\nOur first night there we booked a \"Gho","useful":4,"cool":1},"31GkwvBi981n9UVDj4G7Kg":{"text":"My party did the St Louis #1 Cemetery Tour. So much more than we expected. Mary J was an e","useful":0,"cool":0},"QiimKAwhA29lSTauj609dA":{"text":"Luke is a serious guide. From the start his loud and informative history of the big easy g","useful":2,"cool":0},"iHEy_BV8uVJlB_d_JcmTeA":{"text":"The tour of Saint Louis cemetery #1 was incredible. Robert is the man; he was hilarious, v","useful":0,"cool":0},"NYbEEUM9jiTka1HXoIz8aQ":{"text":"We did the Ghost and Vampire combo tour, and it was really good. Lots of interesting facts","useful":0,"cool":0},"baH5aEIqi3xT3XhG4kGivQ":{"text":"I took a tour of the St. Louis #1 Cemetary with Bobby Thomas. He was AMAZING! He was funny","useful":0,"cool":0},"8bTGsTF7U4jEXAnXYYjIBg":{"text":"Took two different tours from this company. The St Louis #1 cemetery tour with Robert and ","useful":0,"cool":0},"etj9qvDnYuRVTd_-4PHG8g":{"text":"Now that the St Louis cemetery is closed to the public since March 2015, to get in you nee","useful":2,"cool":1},"67ZsIgWNE-95BbiFaGj_Yg":{"text":"This was so much fun!! We could have listened to the stories over and over again, this was","useful":0,"cool":0},"JiB7MRE92XKBZ28RsftIwg":{"text":"Spent last weekend in NOLA and took the French Quarter Phantoms tour Sunday night and LOVE","useful":1,"cool":1},"liTIP8zYFjBqdTb1JAg2_Q":{"text":"We ended up doing three tours during our visit here and on two of them we were lucky enoug","useful":0,"cool":0},"4oxHBTlTp_qJtUt97CNZrQ":{"text":"Malika is quite hilarious as a tour guide and a riveting storyteller. She knows the city a","useful":0,"cool":0},"ASYCj6uAkXrJMJhgZB3FXQ":{"text":"Absolutely flourishing with history and culture! inspired to bring by girlfriends back soo","useful":0,"cool":0},"-1R9rgfRKUE-VFm7iQOz7A":{"text":"Just finished the ghost/vampire tour with Ms. Angela and it did not disappoint. I learned ","useful":0,"cool":0},"W9TWHzxzcM4AVl_ojxz7AA":{"text":"The tour was interesting, and our tour guide Justin was very knowledgeable and entertainin","useful":0,"cool":0},"2-BoZnzZtV-yZ7Be7pL-Gw":{"text":"My friends and I decided to book this on a whim after hearing our hotel, Le Pavillon, was ","useful":5,"cool":4},"srTQCF9tm2OcxTq0wP7WAg":{"text":"I had the best ghost tour with Evian, she was rad and knew so much about the strange occul","useful":2,"cool":0},"nOKIFyKlW9DgcgOceR7QbQ":{"text":"Mary was great! Highly recommend her. So knowledgeable. Such great stories and really adde","useful":0,"cool":0},"3cRgZe_5_Z62eIgbW3bvUA":{"text":"The tours we took were definitely the highlight of our stay in New Orleans. We took a Ghos","useful":0,"cool":0},"Z6ASUuZmZPl6sE3Tx9am6Q":{"text":"I bought this tour on groupon for an amazing price, when I called the reservation number i","useful":1,"cool":0},"U6lxLXfYHx2QY4zYYkl36g":{"text":"The TRUE CRIME TOUR was LIT! \nWith so many tour options I was overwhelmed on which to pick","useful":6,"cool":3},"yEkhJW-z6xqQqxak3vl5dw":{"text":"My husband and I took the Ghost and Vampire tour and absolutely loved it! Evian was our to","useful":0,"cool":0},"QlaPmKbuq_n_TjRaFfgJNA":{"text":"Me and my boyfriend decided to do a cemetery tour after reading the reviews for this tour ","useful":1,"cool":1},"nMF5UpQZqOjnSjjr_S7TZQ":{"text":"A friend of mine that lives in New Orleans had recommended the French Quarter Phantoms for","useful":1,"cool":0},"GUsumFp4Me4dxxafJ_Vuug":{"text":"Lee is AMAZING!!! We went on the Ghosts & Vampire tour last night and he was extremely kno","useful":0,"cool":0},"CmDN_5YSYfKJ39rMz3s6Vw":{"text":"Phill was great! I had previously done a different ghost tour during another trip back in ","useful":1,"cool":0},"XnVeDraAe5chFpCj26I4Dg":{"text":"Steven was the best tour guide ever!! My boyfriend and I were captivated with each story h","useful":0,"cool":0},"9QZYQ4zRXdtH8ry5rPGK9Q":{"text":"We took the Ghost and Vampire tour at 6 p.m. and had a nice time. Our guide was Steven L. ","useful":0,"cool":0},"QECazhwLzrQU4-QDzT_7QQ":{"text":"Adeline was an amazing tour guide. She was excited about the cemetery tour and was passion","useful":0,"cool":0},"w6okzVO7ZHQoD5wa0ThmXg":{"text":"Bobby Thomas was phenomenal. He sets the perfect mood and has a great voice for story tell","useful":0,"cool":0},"t6eaR7WX5lLCHNBbkA9DQA":{"text":"Amazing!!!! We just came from a tour, My husband and I (both over 30) took the Ghost and V","useful":0,"cool":0},"yAJe6KNHVmY8iLDKRanZYQ":{"text":"My husband and I were visiting from Florida. I've been on a ghost tour before but he hasn'","useful":0,"cool":0},"8Ufb9HfK_uWrk4WAFeKIAQ":{"text":"We took the Saints and Sinners tour and thoroughly enjoyed it!  Lots of good history based","useful":0,"cool":0},"sCn89S7ivABsZAJRYU_ibw":{"text":"Whoops, creating this review completely left my mind until I was going through the emails ","useful":9,"cool":3},"ZW2cCwRxivjeTFmVQanKew":{"text":"I did the ghost tour (july 26th 2020) we all had masks on and I felt safe taking this tour","useful":0,"cool":0},"CkQbwWBgr1OlUNGLz_R6GQ":{"text":"We had a very, very large group of sorority girls -- at least forty. We didn't know we had","useful":0,"cool":0},"IpbCTKPzyFgCOA2ob9uCxg":{"text":"Just pointing out that if you get Aaron as your tour guide she deserves a five star review","useful":0,"cool":0},"3Y0XPwGbRjQzQ5bC4JkWPA":{"text":"After checking in and getting our free alcoholic beverages we were led by an enthusiastic ","useful":0,"cool":0},"clIH3wO_pVhZnW0ydL8h-g":{"text":"Awesome tour with Robert! He is a very thorough and helpful tour guide!  Despite being fro","useful":3,"cool":2},"skCzBXGJnxgsnvmLMxeSRA":{"text":"Such an amazing experience! So much creepy history and French Quarter Phantoms does an inc","useful":0,"cool":0},"PSZr56yioeT6yTj9OSEvcw":{"text":"We had an INCREDIBLE two hour tour today, led by the wonderful Erin. She went out of her w","useful":2,"cool":0},"Km5NjFfmjT4Lt-DdZMFS4w":{"text":"Our tour guide was Lee, and we felt so lucky to have him over all the others because he wa","useful":0,"cool":0},"YULwPAcdJuX3-xSn70bC2Q":{"text":"I love storytelling opportunities - and this place does it well. You get to hear all the s","useful":0,"cool":1},"ojcZuqXqUAwlnwMe5QIugQ":{"text":"It was our first time in New Orleans and we kept hearing that you HAD to do a cemetery tou","useful":0,"cool":0},"l9bfc0JE3tTzPi4R7MM0pA":{"text":"Thank you so much to Phill, our tour guide for the Ghosts and Vampires tour! He was very e","useful":0,"cool":0},"T-y8Vto470S7aOZXO4QUKw":{"text":"My husband and I wanted to do a ghost tour while visiting New Orleans and settled on the G","useful":5,"cool":3},"PSFHIfSb0MiM_Rwtp0rE4g":{"text":"I had such a great time on my tour! I live in New Orleans and had friends visiting and we ","useful":0,"cool":0},"s0qrA_WLBupAkAPkR3kTqw":{"text":"Great ghosts and vampire tour with Luke.   Good storytelling mixed with humor!  Highly rec","useful":1,"cool":1},"T2KsLxTpBYBqC5vKgQL5FA":{"text":"Our tour with Malika was the highlight of our trip. My kids and I walked away with a much ","useful":0,"cool":0},"j-cqDp7CXDek5BWajfiKig":{"text":"Justin was our tour guide! He was awesome! Very informative and funny! The tour itself was","useful":0,"cool":0},"zIshVcavIERaf1R8rDmLVA":{"text":"Today I took two great tours. The first tour was the cemetery tour and our tour guide Just","useful":0,"cool":0},"7U8B_tDhnNl9lt5q_FXyLA":{"text":"One of the worst ghost tours I've ever been on. New York (Greenwich)...amazing! San Franci","useful":1,"cool":1},"8NBKQwzWGDRhzFVS9UxfMQ":{"text":"We did the cemetery tour with our kids, 14 and 9 years old. All of us thoroughly enjoyed l","useful":1,"cool":0},"YeIDLVZzqR7aZBUSFcd2AQ":{"text":"It was my first trip to NOLA and everything I read said I must do a ghost tour. Well this ","useful":5,"cool":1},"9M-7qV83N6DQi6JDXkyZhA":{"text":"I took the Ghosts and Vampire tour and our tour guide Philip was awesome. Just loved the w","useful":0,"cool":0},"Ffh83zip9LQCggRHeHRwmA":{"text":"Our tour guide was bomb! The minute our tour began it started to rain and rain in the word","useful":0,"cool":0},"rxjdK-k8M3OvvXGhS_xj7g":{"text":"Angela was an excellent guide! We came across the Ghosts and Vampires tour from the Last P","useful":1,"cool":1},"3HCkmiJCcmK5pg1pPEkXxA":{"text":"Just finished our tour of the Saint Louis Cemetery 1 with our super fantastic tour guide \"","useful":0,"cool":0},"ExHkPbmdXIhOoP03VIZ0TQ":{"text":"Went on the ghost and vampire tour and Justin, our great and charismatic guide, was very e","useful":0,"cool":0},"GjO_tLx5hONCq-jH4oGRtg":{"text":"AMAZING! we did the saints and sinners tour with Luke and it was great. very entertaining ","useful":0,"cool":0},"fss-n8F1HpzaLsoK9yCy2Q":{"text":"Not a must. This won't make or break your trip. It was a cute fun activity. I wish Rick St","useful":0,"cool":0},"W_UXb4kZ5KAhKhk7ZwJ6AQ":{"text":"Very informative and entertaining tour! Time very well spent thanks to our guide, Phill (:","useful":0,"cool":0},"m7fx1P9g4UjWKzLGo4KDzQ":{"text":"This is a must see!!! Go on Malika's tour. She gave us the most thorough tour hands down. ","useful":0,"cool":0},"6qeCfwN13J078rC-wOIhMA":{"text":"Druv gave a terrific, informative and thoughtful tour. I learned so much, and he was kind ","useful":0,"cool":0},"_JXfnB-x7ke3ccGrOFzpSQ":{"text":"If you want a fantastic atypical ghost tour, GO WITH FRENCH QUARTER PHANTOMS. Justin was a","useful":0,"cool":0},"kNlkgHBC4l1F7jOqFrMOfg":{"text":"Phill gave us a decent tour last night! Ghost and vampire tour here in New Orleans! Check ","useful":0,"cool":1},"QroWY4AQ2oStAfCvuwE8hg":{"text":"Very fun and educational cemetery tour! Our tour guide was great! Don't remember the name ","useful":2,"cool":0},"kqSLfHVfPEq_D3U8yn5M6g":{"text":"I took a tour of the St. Louis Cemetery #1 and it was incredibly informative!! I learned t","useful":0,"cool":0},"1NbnIJB_cJ-GCiyBNHhf4A":{"text":"A few girlfriends and I took the St Louis #1 Cemetery tour last week with Luke.  He was a ","useful":0,"cool":0},"u--vLHVNI1nC7eMJAtatYw":{"text":"Saints & Sinners was a wonderful and informative day tour!! We didn't walk much, just from","useful":1,"cool":0},"jmI3Gc_AZBXCN9nHShWSFA":{"text":"French Quarter Phantoms is THE place to take a tour of New Orleans. We recently came on th","useful":4,"cool":1},"Ek1JG8sKTgt8GgdbrANqtg":{"text":"Bottom Line:  Fun way to learn about the New Orlean's French Quarter with a fun sinful twi","useful":0,"cool":0},"r9DuObzJPWNJiHG3w7omUw":{"text":"My girlfriend and I took the ghost tour just before NYE. When you enter Flanagan's pub go ","useful":2,"cool":2},"E8GrI3qAT06pB0Sun9UpIA":{"text":"Just took a tour of the cemeteries in New Orleans with our amazing guide, Mary J! She gave","useful":1,"cool":0},"mFAfz46Ps_UPX93Mq4IhGw":{"text":"We took a tour of the cemetery , Sam was our tour guide and the experience was awesome and","useful":0,"cool":1},"EmvtVkwHAi4MuIrG96s91w":{"text":"Bobby was a lot of fun. He shared interesting information about the history of the town. B","useful":0,"cool":0},"psp6MWQoodT9MPdbgrpZYA":{"text":"Excellent tour guides! I'm very happy that we booked two tours with them. We went on both ","useful":3,"cool":0},"R8pIHudGpUFS4fgNIVFOzA":{"text":"Went on the cemetery tour today at 1pm. They tell you to get there at 1245 and we did and ","useful":5,"cool":0},"vgCKO958KgnM2nKO6NP09Q":{"text":"Highly recommend miss malika (queen of spirits herself) she was a savage added the scare f","useful":0,"cool":0},"hOLbFT4Fnyt8f7KcS9tfow":{"text":"Where to start. My girlfriend and I have been on probably more ghost tours than we could p","useful":2,"cool":1},"snZSkQmvoPtRWOXV2znBPQ":{"text":"The Saint Louis Cemetery #1 tour was one of the best parts of our recent trip to New Orlea","useful":0,"cool":0},"XET0O96r2ouFW3jTVJblDQ":{"text":"I did two tours on a recent trip to NOLA and I could not have been happier with the experi","useful":0,"cool":0},"fuqK-hr_mBiSiiAtknshQg":{"text":"Loved the Garden District and Lafayette Cemetery tour! Luke did a great job and was full o","useful":0,"cool":0},"RgXBdSNTW8kF7ASugaWHXw":{"text":"My husband and I went on the Ghost & Vampire tour on Saturday at 6:00pm. We had about 20-2","useful":1,"cool":1},"1mVJFHmjf-h92ZFZDLil9g":{"text":"This review is for the Ghost & Vampire Tour and our fabulous tour guide Jeremiah. The tour","useful":2,"cool":1},"S89Db8NUWINFRg0sj-mbqQ":{"text":"I may be one of the only Yelpers who didn't like this tour. I thought it was extremely ove","useful":3,"cool":2},"iuXjPzbJs-T5aImU5t9G8g":{"text":"We had a blast on the French quarter history/voodoo tour with Lee, our tour guide! Lots of","useful":0,"cool":0},"-9N3JriDz0PfbirGStt2NQ":{"text":"Jeremiah gave a wonderful tour! We went on the ghost and vampire tour and absolutely loved","useful":1,"cool":2},"ziq_z3sKKlRGKf56W1E5xQ":{"text":"Shout-out to Phill, ,our tour guide this past Sunday October 17th for an entertaining, wel","useful":1,"cool":0},"dHi5cL30fCz9qwz_wEkA6w":{"text":"I went on a Sunday so parking in the area was available and free all day, yay! Got my wris","useful":0,"cool":0},"yDqgCsGI12iHIcRYAehi5A":{"text":"Was suggested this tour by almost every Uber driver we had. I have been on ghost tours bef","useful":2,"cool":3},"aIQagKKW2URoHb-P02tcNA":{"text":"I went to NOLA during Mardi Gras season for vacation with my bestie. We did a few tours an","useful":2,"cool":1},"x6eu2PIBpA_SUAkWRhN3pA":{"text":"We just got back from 5 days in New Orleans--it is an amazing place! We did two French Qua","useful":0,"cool":0},"UpQo2XDd-KEXLXIAEfFA1Q":{"text":"My husband and I went on a cemetery tour, and enjoyed it so much we went back the next day","useful":2,"cool":0},"TRBFzNn2fgh3CgXXot-Blw":{"text":"We decided on a cemetery tour while visiting family out in Louisiana. It was a bit rainy b","useful":2,"cool":1},"JJtIElAVO_IXPziTF_A8zA":{"text":"It was fun! Learned a lot about ghost sightings and what the people in NOLA would do about","useful":0,"cool":0},"D6b_77RSj-8Dkke89O-Dxg":{"text":"Our tour with Jeremiah was great! The tour is a great mix of history and some spooky murde","useful":1,"cool":0},"-gsfuw6OKozuoySzr2ye8g":{"text":"Their Ghost and Vampire tour was my favorite of our 2 day trip in NOLA. Completely worth t","useful":1,"cool":0},"wjgrqqhzFEPoWjy56nA9Xg":{"text":"I almost feel bad since most people gave them 5 stars. But let's be honest here, don't ya'","useful":1,"cool":1},"Bxlkfdz1T7aNt0QZjotEHw":{"text":"This was a cool tour!\n\nOur group was pretty big, so they split us up amongst two different","useful":0,"cool":1},"YTlsxVujBJwBa3GlPB0JeA":{"text":"Bobby Thomas (our guide) was phenomenal! Perhaps ones of the best walking tours I've ever ","useful":1,"cool":0},"_Ztywg3GOwhLAfJuAw4qbA":{"text":"Robert, thank you so much for the cemetery tour today! Very informative yet hilarious guid","useful":2,"cool":2},"LcBV4elNSjLQpVin8EhQ_g":{"text":"Incredible tour with an incredible host. Our guide, Bobby T was so personable and brought ","useful":1,"cool":1},"vwyv49NZcKTaZjpMrL0IzA":{"text":"We did the ghost and vampire tour with Adelaide, she was wonderful! Very entertaining and ","useful":0,"cool":0},"hgbZ7tndru5amMSllgt15Q":{"text":"This is a walking tour. Our tour guide was named Stella. She was straight to the point. We","useful":2,"cool":4},"s3nnNmUM7Hwp9h1z2UxTkQ":{"text":"Phil was an absolutely fantastic tour guide. He gave me suggestions outside of the tour fo","useful":0,"cool":0},"0HY5DI4gc7WzWLg7tIybew":{"text":"I love this tour company. My wife and I enjoy taking tours in the cities we travel to and ","useful":4,"cool":1},"q4FleiI21Ab_fLEKWAvK3w":{"text":"Aubrey was awesome. She had more energy than I will ever have in my whole life. We loved h","useful":1,"cool":0},"lOtPI8M1CErT7-up5XWN4w":{"text":"My husband and I did the Sinners and Saints tour on a Monday with Justin. He was a wealth ","useful":1,"cool":1},"wj0nzzN_VSIJwrP3IvdY2Q":{"text":"The tour was awesome and Luke are so informative and funny. I really enjoyed his tour.  Wi","useful":0,"cool":0},"6oZNs7aMrFL2iYE6-iwv0Q":{"text":"Last night we went on a ghost and vampire tour and all I have to say is wow! It was better","useful":0,"cool":0},"gXN_1FuKbB1nrZJErjkzyQ":{"text":"So I went on a ghost tour. I was expecting something little cheesy, but this experience wa","useful":0,"cool":1},"UC4lBRAUmaaTFTU3fPrcdg":{"text":"Being a New Orleans Native, I hold the tourism industry in very high regard. I'm honored t","useful":2,"cool":1},"1GJKsWfc01pahTlwp1YJxw":{"text":"We had Mary J for our ghost and vampire tour and she was an amazing guide! Very energetic ","useful":1,"cool":0}}