{"6mzDSnpdoPif8h0Q-h3wGg":{"text":"Staff was great....Manager and Cooks not so much.  I have allergies to tomatoes so i make ","useful":0,"cool":0},"6qKrVjF1GqT9FxdXjibCcQ":{"text":"Got the flying burrito for takeout. Shrimp, chicken and steak is a great combo and the bur","useful":0,"cool":0},"kRgTqS719p8CzPnTp-Z-uQ":{"text":"This is the worst Mexican food I have ever tasted. They forgot my appetizer and told me af","useful":0,"cool":0},"9IaZJpLGCTE7JiQlv3E9nQ":{"text":"Loved the food!   So many choices.  Portions are large and prices are reasonable.  Several","useful":0,"cool":0},"J8yvL_rbVAOrpYNg0A_NlA":{"text":"Enjoyed the blackened fish tacos at Juan's while in the area. The chips are guacamole were","useful":0,"cool":0},"H8aZ4xxJ86nJ9SP7Q7MFmA":{"text":"Service was a bit slow but the food was good and cheap!!! I believe we both got the chicke","useful":0,"cool":0},"1vcptJXLYAeXRVy6w4BfPQ":{"text":"Mojitos were a little too sweet and the nachos were alright. I only rated this higher beca","useful":0,"cool":0},"y1Dmy85e5zXYc0OfBTMSUA":{"text":"One of my favorite places to eat when I'm in town.  I like my food more simple, and they u","useful":0,"cool":0},"eQWrGnQ7xNDmLelwQbJ38w":{"text":"Worst service. An hour before we got our food. No service from our waiter. This place suck","useful":0,"cool":0},"_HCWHim2TOcEygGozRHPHQ":{"text":"Good flavor but disappointed in the blackened fish tacos.  They weren't even close to blac","useful":1,"cool":0},"abc3AQxtNPdFxxjD8ij6Mg":{"text":"I never post reviews on Yelp, but I had to for this place. Everything here is amazing and ","useful":0,"cool":0},"GN-8xzb6_HTQdAfleXQM8g":{"text":"This would have been a higher rating if not for the HORRIBLE service. It is a busy Sunday ","useful":0,"cool":0},"hG7-VnhbFdhI7n5oKkTtBQ":{"text":"The food and drinks are just like the other Juan's locations except not as good.  They lef","useful":6,"cool":3},"Xa61WaAXkwvyB4XswvwUcQ":{"text":"I ordered a pick up order of the taco truck (steak tacos) and when I opened up the box eac","useful":0,"cool":0},"E8eDWUQaSlRQw0wnQbPU8Q":{"text":"This is one of the best places to eat in Nola. Any thing you get you'll enjoy and the staf","useful":0,"cool":0},"oizLPgO3WKIXbReI_i8bdw":{"text":"Another cheap eats place downtown and I'm not mad at it. When I want yummy cheap Mexican f","useful":6,"cool":4},"ojm3Ses2vFyA-vw6xnuyLw":{"text":"I love that with each purchase of queso you get one free refill! I ordered three tacos: st","useful":0,"cool":0},"vb_Z1JrFzvzWvihCt_-hHA":{"text":"Unser erster Tag in New Orleans und schon ein \"Goldstück\" gefunden.\nDas \"Juan's Flying Bur","useful":0,"cool":0},"aX9jG353a-YFcX5vkIVhfg":{"text":"We came all the way from Clemson,SC just to eat here! Not really but glad we found this pl","useful":0,"cool":0},"6m_tihmuend-ntK6QavDQQ":{"text":"Wait staff was excellent.   Recommendations were awesome.  Bestest margaritas in Nola","useful":0,"cool":0},"KwlRkQaWSFurJFsuRTObKg":{"text":"Food was great but not hot in temperature, bbq chicken had a nice bite. A bit slow on serv","useful":0,"cool":0},"87vedC56Wg-t99AV7tpjqw":{"text":"Great staff, didn't expect to have to pay $6.00 for the chips and salsa! The food was good","useful":0,"cool":0},"1HuSF2-8hcA7QcBvWYAzKg":{"text":"Stopped in here my first night in the city. They have some great drinks, I had the cucumbe","useful":0,"cool":0},"UMepbKS1r-CqvhP17zbDPQ":{"text":"Ok, so this Juan's! I am a regular at the Carrollton Abe location and this was my first vi","useful":0,"cool":0},"t7a92F7p_Wv1dwHgWk9Puw":{"text":"DO NOT GO HERE. \n\nThis is the first Yelp review I have ever written. Actually, I created a","useful":0,"cool":0},"yzjHKxnJ7FxXZaOJ1ykoOg":{"text":"Got the vegetarian fajitas and got a plate full of delicious veggies, black beans, and gua","useful":0,"cool":1},"aEsfqW-0EqDds9uNTPMrtg":{"text":"I like this location.   I had flying enchiladas, and two double margarita's which were hap","useful":0,"cool":0},"AKSOvJ9oWAWN_1aSMQ-EjQ":{"text":"After attending a work \"event\" where I left starving this hit the spot. I customized the t","useful":0,"cool":0},"iYk2zZCon9WLpURkoiwyxw":{"text":"Cozy, neat atmosphere, great service, alot of menu options....   But wife and I were very ","useful":1,"cool":0},"-xFAopI5P4ZzCAqH-ne_aQ":{"text":"Love this hidden spot! Tucked away in a new location, I love how quick service is and how ","useful":4,"cool":2},"bVKTIo2tqvGSRrvXaEhyWw":{"text":"The food makes a turd,but that's about it.  We saw this place walking by yesterday. It was","useful":0,"cool":0},"SfClLN7jEegks48-kD6YPQ":{"text":"My SO and I needed something quick and easy the other night and Juan's was close by.  So I","useful":0,"cool":0},"cbmk6uNdGPeAZoGRBEEHug":{"text":"It was so good and new. I'm Mexican and love tacos but the creole take on these was amazin","useful":1,"cool":0},"KoVmA0OVLuc6io-n71CdlQ":{"text":"The food quality is above average and portions are average. Service was great. I ordered a","useful":0,"cool":0},"Un3EVGIST4nRiG2PoIhsOw":{"text":"Pretty good food. The atmosphere is good but it was very loud. Almost every table was occu","useful":0,"cool":0},"6pszKVGyH60PKa_cBTg0DA":{"text":"My friends and i are practically Juan's regulars. They have a great happy hour $6 double m","useful":0,"cool":0},"eNjbu1nEYtvKVvKmzgKkXQ":{"text":"I liked the house fish tacos with mango salsa and recommend it. \n\nWent there twice to enjo","useful":0,"cool":0},"pcAlMCnLjoxdZusKWrFgTw":{"text":"We found this location while we were looking for somewhere to eat before a show at The Civ","useful":0,"cool":0},"BDUn5ZiyMOIe3IQNeLnT6w":{"text":"So honestly not sure why I haven't written a review of Juan's yet as it's actually my favo","useful":2,"cool":2},"4-y4FAixsxAOzrtSUzgV5Q":{"text":"Juan's is a great spot for locals and tourist alike. I've never had a bad experience here.","useful":0,"cool":0},"VDTXH7iN-ecZeQ_1hmRuEg":{"text":"I was pleasantly surprised. The place was packed on the Saturday night we went. In spite o","useful":0,"cool":0},"Lfag9ycPaO6p84I7ii1hKA":{"text":"Very helpful and patient staff! Excellent food and very accommodating if you are vegetaria","useful":1,"cool":1},"RlPs-RwKJWglhiXRgkVRiA":{"text":"This was My first try at Juans Flying Burrito. I had nothing but positive reviews before e","useful":0,"cool":0},"7FZDBDjgNtcG2wPabgrg-A":{"text":"Taco Tuesday during lunch hour is pretty packed, but the tacos were tasty; even though, it","useful":0,"cool":1},"tuToM3vnqI-V3oAWlpHr2w":{"text":"Awsome food and drinks for a very affordable price. If you visit the branch by baronne cor","useful":0,"cool":0},"hGKjSuf6Pv4oEWzDDVijDQ":{"text":"I really enjoy Juan's Flying Burrito and their shrimp quesadillas, but the last time I cam","useful":2,"cool":1},"FWPUfcFXDjPmsrO1qKFbXw":{"text":"One thing that I love about visiting NOLA is the people. Everyone is friendly & will sit a","useful":0,"cool":0},"_MZo2vMZHT0RRrGuRbHttw":{"text":"this place is pretty good. i usually go with a burrito, but recently i decided to try some","useful":1,"cool":1},"2sk37wyrzqQ-rCIJpn7Ygg":{"text":"I had take-out and ate in the restaurant during our visit to NOLA.  The food is great and ","useful":0,"cool":0},"4ze2eZdhYZUcFuAhezGdJw":{"text":"Our last night in New Orleans and we wanted something other than the local food. This plac","useful":0,"cool":0},"Fj8dzKBPdSYlKV1sKbZ8nw":{"text":"Taking the place of Lucky Rooster is Juan's 3rd location. Same decor of Lucky Rooster with","useful":1,"cool":0},"QPfR37NmldozvU4x14XbLw":{"text":"We popped in here last month on a trip to New Orleans and thoroughly enjoyed it. We had a ","useful":0,"cool":0},"pFkCm209-ujvKAcJufzKvw":{"text":"Beans and rice and chips, and margarita. Perfect light dinner. Steak quesadilla good. Jerk","useful":0,"cool":0},"bs5II_xz_o-g9kGwIuyuLA":{"text":"Popular, friendly, relaxing place to grab a margarita and a taco or burrito. The margarita","useful":1,"cool":1},"0QAbPdXxfMwt2q__PoYSNg":{"text":"Great food! We had their burrito, tacos and quesadilla. All of the food was fresh and tast","useful":0,"cool":0},"a3dY5ELWoOvL-fc6rmPIdw":{"text":"During our visit to the Garden District, we were greeted by the most amazing smells coming","useful":0,"cool":0},"nSsMPJ6zaXlru6kEsfBoSQ":{"text":"I am visiting Nola for the week and have struggled to find good Mexican food, until now. T","useful":0,"cool":0},"J4zWOIzE7dTxyY-E88yMRg":{"text":"We actually were on our way to another place for happy hour but when we got there they sai","useful":0,"cool":0},"jBz7HvWzh9eEJwNwldCwMQ":{"text":"I used to go to the magazine location years ago, and I remember the food being amazing.\n\nH","useful":1,"cool":0},"DgneYd2q2PivC8nmgbEZcw":{"text":"Good: happy hour/drink specials, location \n\nBad: food quality, service \n\nI went to this lo","useful":0,"cool":0},"s9za6DCQ7KfIkV-fppBOAw":{"text":"Tasty food with an excellent beer selection. Awesome staff with great prices. Also has a g","useful":0,"cool":0},"AqSdXue8ljbWjbNGG5ifMQ":{"text":"Worst service ever!!! Don't waste your life, time or energy on this place. And to make mat","useful":0,"cool":0},"WZXxQPfqaoWq042us-qn2w":{"text":"I just love that Juan's opened down here! I can't tell you how many times I've already ord","useful":0,"cool":0},"kopQItdPNE3MCWmAv0M4nQ":{"text":"Loved the queso so much. Service was friendly with good happy hour deals. Great alcohol se","useful":0,"cool":0},"FIXC9PgCe0pt5oh1HZ4oMg":{"text":"We had a nice meal. We ordered a few drinks from the bar, they were not great, but the foo","useful":0,"cool":0},"lL6-J-_V6VHh6-nwXtC3kA":{"text":"Headed in around 3pm. Despite being after the lunch rush, the food was of a very fresh qua","useful":0,"cool":0},"hfB0eanttHIeg_P5CwSvGw":{"text":"Nice atmosphere, great drinks, excellent food, superb service, great price.  Cannot do any","useful":0,"cool":0},"cjCG_jowUfDIX49FB9-GXQ":{"text":"I had fish tacos and my husband a bacon azul both entrees were very good.  Service was exc","useful":0,"cool":0},"llKUXwpPGbgersclgd0r-A":{"text":"Got some of the $2 tacos on Tuesday for takeout and they were all solid! Would be helpful ","useful":0,"cool":0},"tiaUs-YGtO591Il_YgydWQ":{"text":"If you like a fast service for a late Mexican dinner you can come here. The fish tacos wer","useful":0,"cool":0},"WMgHeQlT1ael27PqJlymLg":{"text":"I would give the food 4 stars, but the rest only 2 stars. So, I'll go with the average of ","useful":3,"cool":2},"1E8P_7fETJu3ml5IsJH_jQ":{"text":"Ordered the taco truck tacos for 11 dollars and am completely disappointed. The skirt stea","useful":0,"cool":0},"8RDK1nkS6Rd-WNDpsv2uCQ":{"text":"Amazing chips and salsa, delicious rice, and friendly staff.  Definitely a high spot on ou","useful":0,"cool":0},"sHmQwriRkv92oUG7YDTo8w":{"text":"This is one of our favorite lunch places! We go at least once a week! Tina is our favorite","useful":0,"cool":1},"Uw1jgqmb6cBPn1b4mNGOpw":{"text":"I looked for vegan options, and wasn't disappointed. I got chips and salsa, and a 3GV (thr","useful":0,"cool":0},"m9BSRf7A43bfw44pPAnblA":{"text":"The staff started out amazing, but when our food took over an hour to arrive, they were MI","useful":0,"cool":0},"Hq28K23rARXTsPcOfEYVcA":{"text":"Try this ..: order their signature Flying Burrito that has (better yet- should have) steak","useful":0,"cool":0},"W9ii96SlxqeLnU7iMnWBww":{"text":"Just across the street from our hotel, we decided to try something more low-key, after a w","useful":1,"cool":1},"ckdmgOfszfSuH9fQquHOFw":{"text":"My friends and i are practically Juan's regulars. They have a great happy hour $6 double m","useful":0,"cool":0},"JcKMGm_Xn9uuwTqbHst0BA":{"text":"Chips and sals were yummy, the margaritas are dangerously good \nCan't say I'm a fan of the","useful":0,"cool":0},"hRWBxdmtJ5Qj53Y1ZLh0AQ":{"text":"The fish Tacos were out of this world! The bartender was so sweet :) had an A+++++ experie","useful":0,"cool":1},"2UN_tqFML8N6yLskVdJ6vQ":{"text":"This place was okay, but nothing really to write home about.\n\nWe stopped in here before a ","useful":7,"cool":4},"wLJ7DyxRyVeTrrjkvaXvyw":{"text":"Great place to go for lunch in the CBD. Only reason for not giving 5 stars is that you hav","useful":0,"cool":0},"oZF-IVXYXxHU-5invt0L8g":{"text":"This place was perfect for what I was looking for today. I wanted something solid but ligh","useful":1,"cool":1},"11FdQ02bflOts8R7oV8ghA":{"text":"Amazing food!!! Loved the pork tacos. Awesome atmosphere and wonderful waitress!! Definite","useful":0,"cool":0},"vEOL-3Ocf-oi2Uxs4GsbnA":{"text":"Absolutely horrible service. walked in and tried to make things easy for the bartender by ","useful":0,"cool":0},"oMndyAT05mR2ff6TcqUBGQ":{"text":"Pretty unsatisfied with this visit. The only good part of our meal was the chips and trio ","useful":0,"cool":0},"2tQdJ6p3kQiZczKUacnzmw":{"text":"You can't go wrong with a name like Juan's Flying burrito. It was already awesome because ","useful":2,"cool":2},"rdtpPWKqVYmpH4zo4TAP-Q":{"text":"Awesome place for some great Mexican food!  I can't believe the average reviews--must be u","useful":1,"cool":0},"1bvQlX7RgVEYT-Qu-51J3w":{"text":"This Juan's location is pretty terrible. I sat at the bar, so the service was okay. This t","useful":0,"cool":0},"Df4dCbx01vOYPjcK9BE4OA":{"text":"Delicious Mexican food with a creole twist. Great place for both vegetarian options and cl","useful":0,"cool":0},"4CEeEc9pOhshBSw-EJBv7g":{"text":"Juan's has several locations, but I have frequented the one in the CBD (Baronne) the most.","useful":1,"cool":1},"GnY-cUhyNfXeW-dk8-dvtg":{"text":"Don't bother with the traditional Mexican here...go straight for anything with seafood. Yo","useful":0,"cool":0},"ywqwNvZgixVqcb4P3BxOkA":{"text":"One of our favorite meals in NOLA but that's because my family are hos for burritos. 4 bec","useful":0,"cool":0},"TuA9tDy1rmnKvVIPBku9Rg":{"text":"Ok this place exceeded my expectations. I was told to go to a specific taco place and deci","useful":0,"cool":0},"Ptm5PlKsHPCHdavRwA2aQg":{"text":"OMG! I love this place. Ate there 4 times in less than a week. Two lunches and two dinners","useful":0,"cool":0},"zG_42-CYPjVKfa5ZQGrfqA":{"text":"Lifelong Texan, so it's hard to impress me with Tex-Mex.  This was ok.  Got the redfish ta","useful":0,"cool":0},"3O6qcP_yDJLETPfp-Rw3QA":{"text":"Had pork and slaw tacos and wife had Papas tacos - can't say we will be going back - for n","useful":0,"cool":0},"VL0OHKx2Zo1u6QxZaroKYQ":{"text":"Worst experience of my life in New Orleans. The waitress spilled our drink all over our ta","useful":0,"cool":0},"rJ_AXr_qq8rnDnQApZx9cg":{"text":"I get that it's not standard Mexican, and that's OK. But I've had better takes and spinoff","useful":0,"cool":0},"HZGFZmHC5QY4Wu7bRJEzHw":{"text":"Just came here for lunch and service was awful. They apparently don't like groups of 4 or ","useful":0,"cool":0},"5-THKhHuR7msWL_MOrXiog":{"text":"I love that with each purchase of queso you get one free refill! I ordered three tacos: st","useful":0,"cool":0},"h1h6ncNTLOGqhWqCFiEJwQ":{"text":"OK so this is my Juan's update review as if I actually need one! Juan's is the best! The f","useful":0,"cool":0},"7ts0hYs74QHLNX7CKdZNkg":{"text":"I got to-geaux for lunch at work one day and ordered The Luau Quesadillas. Each half had 4","useful":0,"cool":0},"ABVBDTKfQtjahMuS1dNf9g":{"text":"TINA TINA TINA!!!!  Can't say enough good things about this girl.  She found a spot for 12","useful":0,"cool":0},"wujBpmveM4iO4sfbba4_SA":{"text":"This place serves great, authentic burritos that look and taste just like the ones we get ","useful":1,"cool":0},"DkH_VLdbs-uvTzTxswTGFA":{"text":"The food did not taste seasoned we ordered.  504 nachos it was good the combination of ing","useful":0,"cool":0},"N7Z3HbhXIMDoSWeZ8mVSkA":{"text":"The Flying Burrito was an exceptional dish! The shrimp, chicken, and steak were all perfec","useful":0,"cool":0},"SDvUtiVWRBtx3Z4PMGkFfA":{"text":"Beware of the Shrimp Mango Salad- no Mango no goat cheese. When they do not have the ingre","useful":0,"cool":0},"tdV76TOl4SCbWh6nIsUV0w":{"text":"The Jerk Chicken Nachos were delicious! The taco sandwiches were tasty and filling. There ","useful":0,"cool":0},"bccJERyFV95Z3h87perReg":{"text":"Read that the Flying burrito made a list of Top Burritos in the U.S. and decided to test i","useful":0,"cool":0},"O4FFZeBW1RE9omlh7jm07g":{"text":"It was fine... nothing really wrong with it... but just not what I was maybe expecting...\n","useful":0,"cool":0},"SWhFk9PsiSWnOkf-h_2Lsw":{"text":"We came from San Diego and stayed at a nearby hotel. I was pleasantly surprised how they m","useful":0,"cool":0},"bzISiBEOU0uFAasNyTO5_g":{"text":"Good food.  Great vibe.  Great fun watching the wait staff jamming to the reggae.  Jerk ch","useful":1,"cool":0},"n-vIs0p4TmhHb5dhR78JYw":{"text":"Really decent Mexican food in downtown New Orleans. The flying burrito was really good and","useful":0,"cool":0},"bVQTDGYGsc3FNDwYFB4PZw":{"text":"Loved this place. $6 Lyft from Bourbon and worth every penny. \nWe got the three taco speci","useful":0,"cool":0},"QN1GWQXOQjeb9QOupw0pyQ":{"text":"This place was amazing! The service was great and the food was perfect for what we were cr","useful":0,"cool":0},"jBYu-29GSxOT3Z2Biuxx-A":{"text":"Glad I found this spot. Funky vibe. Lauren Hill soundtrack playing in the background. Lots","useful":0,"cool":0},"e6sIrNxMAVzkXTLoWT6nDw":{"text":"Excellent. \n$7 for 3 chicken tacos  can't beat that. \nThe tacos were very flavorful and th","useful":1,"cool":0},"DELXoSGtn44T6DOLGfvh7Q":{"text":"I love the Juan's on magazine st, it's one of my favorite places to eat in the city. Howev","useful":0,"cool":0},"VzXQr2jb2dNaQM1syfrRzg":{"text":"The service is spot on. Food is tasty and came out lickety slip! CBD hotspot that everyone","useful":3,"cool":2},"iS7EaC6FDR2c4KPOGYa1-Q":{"text":"Yesterday made the 3rd visit to this location, and once again the food was pretty bogus. W","useful":0,"cool":0},"DL8HUuCnGVI4GT-9J_1U_Q":{"text":"This place is awesome. From the friendliest servers to the awesome food. Hubby and I stumb","useful":0,"cool":0},"FJZWeYVC37sWYD8jFAWtUg":{"text":"Juan's is deliciously awesome.  Cool vibe, good cocktails, great burritos.  Plus, they hav","useful":0,"cool":2},"Mb3jZCHedbe0r9_eik4WLA":{"text":"My husband is vegan and Juan's has several vegan options. I had the quesadilla with cheese","useful":0,"cool":0},"wHwHMQFsWvgZgK4H3so5og":{"text":"It's not a typical Mexican restaurant. They definitely have their own flare to their dishe","useful":0,"cool":0},"LB7iisy2BkFC3tl3gdT-9w":{"text":"Shortly after arriving in New Orleans. We walked only a block or two from the hotel only t","useful":4,"cool":5},"oPx2YXLBdFbIMH-5tkSDHQ":{"text":"The jerk shrimp and mango salad is super filling. The shrimp was not very spicy. The mango","useful":1,"cool":0},"-BouO6Gc7oCNuOtMQQHuYg":{"text":"Margaritas were delicious. Food was outstanding. Was close in proximity. Large portions, v","useful":1,"cool":1},"acd3DIZolHDsaSaF-V9RWQ":{"text":"Service was fabulous! The food was absolutely delicious! I had the fish tacos and they wer","useful":1,"cool":0},"u_94jpxoTKRCrRl-UAxGJw":{"text":"This location has massive service problems.  They need to shut it down and start over.  Fi","useful":1,"cool":1},"I-CIHzXqyp3z_bR-HnWPzA":{"text":"Love this Juans so much. It's clean and the atmosphere is much better than the other two l","useful":0,"cool":0},"PVwtpLZx2HPLyOsaFz_EIA":{"text":"Absolutely delicious food.  Came here on a recommendation and it was a good one.  The reas","useful":0,"cool":1},"YnMJGsg_DUlsbRmW7PmjBQ":{"text":"Being a native Southern Californian I love Mexican food and I come out to NOLA for work on","useful":0,"cool":0},"kjnp06LdUHB-XfxPnfaffg":{"text":"One thing that I love about visiting NOLA is the people. Everyone is friendly & will sit a","useful":0,"cool":0},"1dNVUvjJnnEqaXCdYAJk-A":{"text":"This restaurant is not vegetarian or vegan friendly. They seem like they would be because ","useful":0,"cool":0},"-olEtLhYvYrTDRH7vMmzeQ":{"text":"This is my 2 visit & first review.\nThe food is fabulous this is the place to go for good T","useful":0,"cool":3},"zIjMsQsaSn53H_Ti-kBtUA":{"text":"Great food, killer drinks, awesome service and really good prices, I absolutely love this ","useful":0,"cool":0},"7s0CI2nk7sAoDbmL-OqbNg":{"text":"I've been here a few times, including lunch with coworkers during the week, and have yet t","useful":1,"cool":0},"XOpmUN8VPKdVWsl0lXnv1A":{"text":"I'm from Texas, and love nachos! FANTASTIC! I was wanting crawfish fusion ( because of the","useful":1,"cool":1},"OjQtUhOOh8LIAB3SSPmKCw":{"text":"We had a HORRIBLE dinner tonight.  Food had no flavor or presentation, salsa and guacamole","useful":0,"cool":1},"MxdGaA6KPm2w9FYvPvhsEQ":{"text":"This was my second time staying in New Orleans and i remember wanting to go to Juan's but ","useful":1,"cool":0},"8Chs1EaRZGfXaKBhQcDqRQ":{"text":"the mid city juans has got it down, so does LGD. Came in during my lunch hour and waited 3","useful":1,"cool":1},"WPQm9U1ckyFzOkJBdCkcsQ":{"text":"Unfortunately, you can't give negative stars.  Stopped in prior to a concert, so the place","useful":0,"cool":0},"18HIKm3Q4z09C5fKP9lOfg":{"text":"Fun place!  Great service, fast. Full bar with great drinks Tequila!  Great happy hour dri","useful":0,"cool":0},"RAXNDKzLgJJ-kRHQTe-pVQ":{"text":"Terrible service. Waited 20 minutes before I could place an order for take out . I ended u","useful":0,"cool":1},"mf6sqU3WNewu5hpQiIHCBA":{"text":"This place was amazing and absolutely delicious. Off the beaten path but a great location ","useful":1,"cool":1},"GvOJSI5_7ObPPx70CwVlcA":{"text":"This place is INCREDIBLE. Coming from Arizona, the bar is high for Mexican food. My boyfri","useful":0,"cool":0},"t0U2EwwplKaj3u0R1z1nCA":{"text":"Good. SO good. I literally just got back to my hotel room from the restaurant and knew I h","useful":1,"cool":1},"uIQyA2zqba5Mq-ImIZGRwA":{"text":"Vegetarian friendly, great margaritas and a nice atmosphere. Being from out of town I foun","useful":1,"cool":1},"DBx3ysPAoRvQ_g-e5oQJVA":{"text":"This place is great!  Definitely recommend the Hawaii or Jerked nachos!  They are perfect ","useful":0,"cool":0},"VG71n4TWgT710Ipt4SeZCA":{"text":"This place gets a resounding \"Meh\" from me.  I've dined here several times and now I'll po","useful":1,"cool":0},"eSNG75j08LpIDNcmYWB8xw":{"text":"Go with the tacos!!!!anything with seafood here is amazing. The drinks are also fantastic.","useful":0,"cool":0},"35eyokVmDH9Snt6AOGiZIw":{"text":"Don't waste your money here unless you are drinking. The food was BURNED and  PRECOOKED so","useful":0,"cool":0},"nCmyD0b25v-m0pc-MhJjiA":{"text":"just nasty,  I didnt order drinks and I think it annoyed the waiter.   I ordered a pork bu","useful":1,"cool":0},"Tt9kKjolIHPeWqBnAweeQg":{"text":"My girlfriend and I are both avid fans of Mexican food and especially of the Juan's Flying","useful":0,"cool":0},"0lzPwG2NbotpXe1-1ctBkQ":{"text":"Once again, my SO and I needed something quick and easy the other night and Juan's was clo","useful":1,"cool":0},"TLXDAABjp751A5hRZ9y8rA":{"text":"Not sure why it's called a Creole Tacqueria - there's never anything actually Creole on th","useful":0,"cool":0},"_EZgnR1EmIKiOZW2_6i4SA":{"text":"I give one star for the service. The redneck server, arrogant and cocky to its fullest, is","useful":0,"cool":0},"TIZJ1nibrJg4FPWQf99JAA":{"text":"Really blah meal, from the stale chips to the super bland steak fajitas. Overpriced margar","useful":1,"cool":1},"WbpU51VIqCVLb0OyIv0OBQ":{"text":"The chips weren't very good. We also got a pitcher of the frozen lemon berry margarita and","useful":0,"cool":0},"gLxK2C2qNKwY5by0gjdRNA":{"text":"I've eaten here a few times. My top 2 favorites are the western burrito- that is fajita in","useful":1,"cool":1},"5ijTQ16vsb8R8835jrhveQ":{"text":"Another great dining experience from one of my favorites in New Orleans. I've been enjoyin","useful":1,"cool":1},"u_1UKGQL5GdpmTVRWHkbww":{"text":"This was a shot in the dark, but we could not have been happier! Jasmine is a wonderful se","useful":0,"cool":0},"Cg8Xra8zUVizZTDJKmUnWQ":{"text":"Fun little hole in the wall place. Good margaritas. Good food. Good service. Walking dista","useful":0,"cool":0},"SGJNQyIv6PW6NV-E1NvlOg":{"text":"Friendly people but the food was the most American hipster version of \"Mexican\" food I've ","useful":0,"cool":0},"guzCud-cmEsUJkevNXDT0g":{"text":"If you're looking for excellent Mexican or TexMex, New Orleans is not known for that.  I f","useful":0,"cool":0},"0HkbcBc7ebusUtm_PX976g":{"text":"My wife and I went for taco Tuesday when some of their street tacos are $2 each instead of","useful":1,"cool":1},"QAbZlV5idvAq-fgo_Qzeyw":{"text":"Amazing food and friendly staff! Gotta add the guajillo for a little more spice. Pretty au","useful":0,"cool":0},"JACOdmaZ_fXFY2n51dbzNQ":{"text":"Im from California we have Mexican restaurants in every corner. I had the flying enchilada","useful":1,"cool":0},"Eb7bLsRlqzA4nLHygZ3Qcg":{"text":"I knew this place was going to suck when they don't give you free chips and salsa. The hos","useful":1,"cool":1},"GU3DFjUQ1ySk12rSkYei9g":{"text":"Took two burritos take out. We are staying in the hotel near it. While waiting I got a dri","useful":1,"cool":0},"HvJzy_KvLgq_9WUWG-nB2g":{"text":"I am updating my old review. From 1 star to 4. \n\nThis place is not so packed anymore so th","useful":5,"cool":2},"U8eQVU-JN03KnxC2hQYjog":{"text":"I am being generous with the two stars--which were only earned since the chips/queso and m","useful":1,"cool":0},"xSQCwIl7rsM3nJYHxIHfHw":{"text":"Ordered pork and slaw tacos.  This was an awesome treat.  The pirk was wonderfully seasone","useful":0,"cool":1},"7uIFvHbqlA6Brff24K1ZnQ":{"text":"Lots of food and a great price. Slow service and food took awhile to cook. But it wasn't a","useful":1,"cool":0},"er95lsmX_qvzypxASh5AHA":{"text":"Definitely noisy and cramped .  I was seated under a leaking pipe. I'm just happy it wasn'","useful":0,"cool":0},"zMnPZmZ1DTr9NPF-d4R51A":{"text":"Got the shrimp tacos, delicious! My wife got the chicken and chorizo tacos, loved them. Th","useful":0,"cool":0},"MSu4_kb9FR5kMHxuZPueOg":{"text":"Friend and I popped over from our hotel after we got off of working a trade show in the ar","useful":1,"cool":0},"2QjkN5kBazHWkOpEqW6-vw":{"text":"The guacamole is delicious and the banh mi pork tacos were sooo good!! Walkable from our h","useful":0,"cool":0},"O5px2ySoB3o2bxjkNTUDhA":{"text":"This place has won my heart. It was hard to decide what to do eat everything on the menu s","useful":1,"cool":0},"kyEW1jWmuMsSWad06zlJkg":{"text":"This Juan's location is a solid meh. The quesadillas and burritos aren't mind blowing but ","useful":1,"cool":0},"3TFC-RvcQNOWe3jcGIShJA":{"text":"Well let's just say 2 words \nBad Service\n1. When I ask you a question and you cut me off. ","useful":3,"cool":1},"5VYHeSxbWxrn7wyHIVGU5A":{"text":"Being from California I was not expecting great Mexican food in NOLA! I had a burrito and ","useful":1,"cool":1},"6ix01aAerA6fq9ckzKynyA":{"text":"Food is great here. Always satisfied and haven't had issues yet although it used to have a","useful":0,"cool":0},"tx_OHfXjN5TXRY-OCmmWbA":{"text":"Really great margaritas. Really mediocre food. Service leaves something to be desired, as ","useful":3,"cool":2},"8MJQD63BgjoQ5vlFDeG7uA":{"text":"It was ok food, ok service. Kicker for the one star was the giant 2 inch cockroach climbin","useful":0,"cool":1},"uL5F5-N6dxtrZIfa-NUdyw":{"text":"Tacos are just decent for me here. They have a nice happy hour which has $2 tacos and good","useful":5,"cool":3},"goDyTi25w_NskLrbCOR1EQ":{"text":"I ordered the Queso con Chorizo  and Truck Tacos. The queso was okay, pretty big portion. ","useful":0,"cool":0},"-5gX5watx8QOlqBQ9E4pUA":{"text":"My husband is super picky when it comes to Mexican food. This is one of his favorites whil","useful":0,"cool":1},"22ZWQgDsch_wVOK2VjAnng":{"text":"If you're keen to wait 2 hours for some tacos with an unapologetic staff, this is your spo","useful":0,"cool":0},"RwVt0mmBW59fGGj6HyxrEQ":{"text":"We went for lunch and got seated right away! Their menu is fairly large and includes a lot","useful":1,"cool":1},"BBZWYCphJAdcaA4EUDA4qQ":{"text":"It is generic Mexican food. Prices are fair and it's good enough if you're in a pinch and ","useful":0,"cool":0},"Fv5OM5Rd9C-LHlBsNIqdCw":{"text":"Got the special--gulf shrimp tacos and hubby got the Caribbean tacos. The salsa that comes","useful":1,"cool":1},"z80YZRWPs24jgkDHd7qicg":{"text":"Great tacos, flying burrito is awesome.  Decent frozen margarita.  Music and atmosphere is","useful":0,"cool":0},"9T4XQAZEDFqdN-p4dmh1pA":{"text":"I went for two dollar Taco Tuesday special. They were extra small, yet tasty. For the pric","useful":0,"cool":0},"J2yV2GMhQSLj6EFGzXI-QA":{"text":"The tacos here are really good! I ordered take out because I came on a Saturday night and ","useful":0,"cool":1},"8CTdfmA7Wo8OsBSkP-Olqg":{"text":"I was so excited for this place once I walked in, the menu sounds sooo good when you read ","useful":0,"cool":0},"o9HTAcqZnVdmz3j5dtjsBQ":{"text":"The food was delicious!  And we are super picky about good Mexican food.  Hava, our waitre","useful":0,"cool":0},"ruNdMBGMJE9lG8fWD7rZgw":{"text":"Nice service, great food, excellent value. So many different options on the menu ranging m","useful":1,"cool":0},"v33VZtCqi6OvHtHpAd7Ppw":{"text":"I stopped in because it was the closest place to grab a margarita. I couldn't tell if it's","useful":0,"cool":0},"moipogHsCWo3QFULMKy2iQ":{"text":"This is the worse place I've been to in my entire life! When we walked in, we weren't gree","useful":1,"cool":1},"tH6WqUjcb4jPDZKnFXIMMg":{"text":"Great food and a great atmosphere! I love the luau quesadilla. The place has a bit of an e","useful":0,"cool":0},"V45KH1YdFoK0Xge0BSJ6fQ":{"text":"I love this place. Many classic dishes with a modern twist. I had pork tacos and they were","useful":1,"cool":1},"X36CswXT5CFQh-VkeWfjbw":{"text":"Flying burrito is awesome, worth the cost.\nGot full from it. $10.\n\nGot nachos but too full","useful":1,"cool":1},"ILlVcsg49ZerK4q1VdwsjA":{"text":"Really good, a little more expensive than I thought it would be, but the food was great an","useful":0,"cool":0},"Mi7FSw8-CR3IaW0LeSKiww":{"text":"This was hands down the best nachos and burrito we ever had! We plan on going back for mor","useful":0,"cool":0},"_U6SR6EP_t0zebmTqkvjFA":{"text":"I'm giving this place two stars because the service was amazing!!! The food on the other h","useful":0,"cool":0},"HQwkcl-vrLk5VidhtcPL-g":{"text":"Who doesn't love tacos!!! Food was yummy. Their gauc is OMG! Good crowd, great service! On","useful":1,"cool":1},"QpyqyLMKTc6wuX3eU1u25A":{"text":"Love this place!! We were craving Mexican food and this really hit the spot! The chips and","useful":0,"cool":1},"i2h27wa7n53ZcA8zXnQ3Mw":{"text":"Super quick and attentive service during the lunch hour, even with every table seated. Wai","useful":1,"cool":1},"FX5d2qdqXu__NAECYyh7kw":{"text":"Finding a burrito or any good Mexican food out of Mexico, California and all the cities ne","useful":0,"cool":0},"p8TJ4vJowq4pQnYI-J5ujQ":{"text":"If I could give zero stars, I would. I've worked in the restaurant industry and would neve","useful":0,"cool":0},"HyK1UO13TJHjoNTveL07Qw":{"text":"Every since this store opened in the CBD I have given Juan's a 4 star. ( review 09/29.15) ","useful":1,"cool":1},"ZyEuy8IYTM6FCgpTvIujAQ":{"text":"This place was a nice surprise. Good vegetarian options. I had Indian tacos which were del","useful":0,"cool":0},"aRNxMmTydmC2FNdSthIZfQ":{"text":"They have the best food ever!!! They also have amazing customer service!! We ate there thi","useful":2,"cool":0},"znC2m0WVIfFgWTMKKucOEg":{"text":"Super loud. Super bad.\n\nWe ordered the chips and guacamole. The chips weren't salted (but ","useful":0,"cool":0},"2s57EhTq5BrK0zgUl2p38A":{"text":"I am in New Orleans for business and was staying at the Drury Inn which is only a half blo","useful":1,"cool":2},"UsleGvspcQWdhGWapPYG7Q":{"text":"Great place to grab a quick snack/drink with a hip vibe. This place is super laid back and","useful":1,"cool":2},"ydKlJgcMTFDnWTLeU8edTQ":{"text":"I had a very uncomfortable time here. While on a mini vacation, if you would call it that,","useful":2,"cool":0},"OhWUBqvTtuaFCBLFQO-gQw":{"text":"Impressively bad. I ordered a steak burrito for takeout. It took 5 bites to get to a piece","useful":0,"cool":0},"umZGXnsktAsSolQ1rj9IDw":{"text":"I was completely disappointed! I am a big fan of Juan's however today I was let down. I no","useful":1,"cool":0},"IhEpYs_IdUUwbXaFoV6EFA":{"text":"So this place was near the hotel I stayed at. \n\nI truly think people are sleeping on this ","useful":2,"cool":0},"ONecBSMqe2wELJWcLeWw8w":{"text":"This place is awesome and reasonably priced. Had the beef burrito was the best I ever had.","useful":0,"cool":0},"k2Qfr-xakU8e14C8e7XYUQ":{"text":"Always a good time with laid back friendly service. Good veggie options like the mojado an","useful":1,"cool":1},"01BlAUB6hVdN6oGCe5qiIw":{"text":"I ordered a shrimp quesadilla and got like 4 shrimp in it ,the food was tasteless. When I ","useful":0,"cool":0},"8k6oGN4rdDX-mbfodFJcLQ":{"text":"This Juan's location is a two sided coin: \n\nOn one side, the atmosphere is laid back and t","useful":0,"cool":1},"lBXR8NcfQ-DUh21XNsBl7A":{"text":"Hawaii504 nachos and blackened fish tacos were totally amazing. Prices are awesome, and wa","useful":0,"cool":0},"ZYDGtI94Ii1Q0XMNFnYjTg":{"text":"Love this spot! The staff is so friendly, and the food is so yummy! Plus The drinks! Love ","useful":0,"cool":0},"e2MEx6dww5z-yPAVe9XAWQ":{"text":"I have tried to visit Juan's Flying Burrito, and a co-worker and I finally went to the Bar","useful":0,"cool":0},"42jmoiGQDKoIl0MpEA0NCA":{"text":"Came here for nachos and a margarita. The nachos were okay, wish hey were layered a little","useful":0,"cool":1},"0OXSWowguNsOn2fb5_7gOg":{"text":"Great atmosphere and food! The Louisiana blackened fish tacos had great flavor and spice. ","useful":0,"cool":0},"tMBSgXo9i9IgH_X-H5IBwg":{"text":"The food wasn't bad. But our server seemed a little off as as everyone else in here seems.","useful":0,"cool":0},"YH0kfLdEQOmT-7W0F9O47Q":{"text":"This place was amazing. The Service was lightning fast.Our server Maya Sophia, was probabl","useful":0,"cool":0},"I2T24PdOwhCdMDs8dNYyqw":{"text":"Great food. Great service. The bacon azul quesadilla is tastier than the flying burrito an","useful":0,"cool":0},"Z26XP9KVdgcDx0w7LTiyRQ":{"text":"This place is a busy, hip joint in the heart of New Orleans. The food is delicious and the","useful":0,"cool":0},"GeOSEVxdK5xMQ79lf9nn5g":{"text":"Stopped here to get nachos with queso and salsa. It was good, I really enjoyed it along wi","useful":0,"cool":0},"zbBj0evspp_K89SkAxiEkA":{"text":"This place has so many options it was so hard to choose. I ended up ordering a Caribbean j","useful":0,"cool":0},"IHAxAC09EZrG0IwvUTdBoA":{"text":"Loved this place . It is not authentic Mexican food but it has a very authentic flavors. I","useful":0,"cool":0},"vyvzI3rtWDIfrNGmPZwUAA":{"text":"The third in a series of Juan's all over the city (the others are on Magazine street in th","useful":5,"cool":2},"IV0GjPv_Oa2fMHN5xqyKwA":{"text":"Stopped by for lunch. The server with short black hair and blue bangs was super friendly. ","useful":0,"cool":1},"DP9vdWvt-7nioWl2efvGJA":{"text":"Nachos! NACHOS! \n\nI didn't try any of Juan's burrito, sorry it's not going to be that kind","useful":1,"cool":0},"RcltxCsfbtRuyf7tl8wllg":{"text":"This was a great burrito place! For only $7, you can get a HUGE burrito that tastes amazin","useful":1,"cool":0},"lIAmmoz41FZ7s1FjWveqDQ":{"text":"Orders Queso and chips. Thought it was bean soup. \nTacos are good but would not get the Qu","useful":0,"cool":0},"GaTLTNm_VcJoE23dKY0o2A":{"text":"I was actually in the mood for chipotle, but this was the closest to Mexican type of food ","useful":0,"cool":0},"hgbioBG7OEhoTxG3cZFrUQ":{"text":"Different location same food but different quality. Had the Bacon alzu my regular but trie","useful":0,"cool":0},"7Ao7XtSuc2xRGf7tVx9R1A":{"text":"Secret non-crowded Juan's spot!\n\nI needed tacos in my life the other night but the Carrolt","useful":0,"cool":2},"qqLZR7CEV9hgvfeAFjrk0g":{"text":"We came here for lunch the other day and had a fairly solid meal. My friend got the Super ","useful":0,"cool":0},"BV-ZPZI3D8pU7fj9jjlO1g":{"text":"People knocked this place for being crowded but I got a seat right away. I preferred their","useful":0,"cool":1},"O0sqCdFH-vRoP7CUUOgexg":{"text":"We enjoyed our burrito and tacos. They adhered to COVID guidelines as well! The waitress g","useful":0,"cool":0},"dDQqjFBOXc4FmaJf42dO5Q":{"text":"We were greeted by friendly staff who got us seated outside quickly and waters right off t","useful":0,"cool":0},"EvL8IIiSwWYQMv-eTtLGkg":{"text":"Cafe feel with explosive taste. They've earned their taco stripes with the blackened fish ","useful":0,"cool":0},"S4NraZ4O0cdmN0wS00L9-A":{"text":"Close to the office.  Consistently good and fast service.  Try the shrimp banh mi tacos.  ","useful":0,"cool":0},"Oj-Wa4BwqFFc1kgJUgHDbA":{"text":"Hubby and I had Friday Taco night .Jose was absolutely amazing. His Service was so excelle","useful":0,"cool":1},"J-YOHABLVjizRRMPguvWXA":{"text":"This has become a go to spot for me as it's near my office. I've eaten in and ordered take","useful":1,"cool":0},"gAyNFnWhb7j9u2xcK7MOOg":{"text":"Our first day in Nola we walked around French quarters and around the river to find oursel","useful":1,"cool":1},"e7BnpuxTwYv-GM62-V-IEA":{"text":"It Valentine's Day and I'm in Love! Found my place in New Orleans! Service was superb, dec","useful":0,"cool":0},"gQw_xCNtVpaNs1haX-XnYg":{"text":"My fiance and I loved it here! \n\nAtmosphere: It's a smaller sized restaurant but not overl","useful":4,"cool":3},"bl3qKpEsOxMKUQJ0Pssq2Q":{"text":"I have ordered their cheese quesadilla with chicken dressed with lettuce, tomato and avoca","useful":0,"cool":0},"NRcgpnM6w54xEVePBgMAEw":{"text":"The drinks are great. Casual feel and the food is well proportioned lol. The size of your ","useful":1,"cool":1},"ovTI6TWLXQ0jyye4ozY6VA":{"text":"Awesome place! Have EXCELLENT Mezcal drinks (rare) and service was swift and courteous. Fo","useful":0,"cool":0},"L8nTHuKqjCVRqcK7RMaD5A":{"text":"Delicious and unique menu items! I had the Jerk Chicken Burrito, and my husband had the Gr","useful":0,"cool":0},"pyCZ10Y9pE4UDT2XWvAUcA":{"text":"I arrived here with ten people, it was busy, but the staff was very accomodating--a relaxe","useful":0,"cool":0},"_AFe2u31_-BecDEadyZfaw":{"text":"Good tacos, cheap, and cool place to check out.","useful":0,"cool":0},"JV-WnBRQzL3szX4jt4njrQ":{"text":"Food was amazing.  A little loud in there but it was busy.  Loved the cucumber margaritas ","useful":0,"cool":0},"D1jc2zQOaDaJ4a0Uexsf9w":{"text":"Talk about flying high! Pretty sure the manager at cokehead. Margarita was amazing I've ne","useful":0,"cool":0},"T81sRtJQy3C9d_EHxs8PRg":{"text":"Had some dope burritos and fish tacos from Juan's. The burrito was very tasty, especially ","useful":1,"cool":0},"SZYNvkKrdDlpQl0EygsEhQ":{"text":"Quick, delicious and affordable.  Has indoor or outdoor dinning.   Taco Tuesday street tac","useful":0,"cool":0},"OjROHdqvwmOkfhjJqTykaA":{"text":"This was my first time ever coming to Juan's and I was very underwhelmed. Im a huge queso ","useful":1,"cool":0},"bjff2tmoPbWwlJjWOGv5dg":{"text":"It was ok. I had a bite of the crawfish burrito and I had the steak tacos. The meat was to","useful":0,"cool":0},"iMXKUC_pz0luC4Wm6imYVQ":{"text":"This location has good food, but the wait time is ridiculous. Took over an hour for my to ","useful":0,"cool":0},"0rMagy8hO9Jx6NYi_5pVNQ":{"text":"Another delicious meal at Juan's flying burrito!\nThe service is great the food is really r","useful":0,"cool":0},"5DwK5TH_n_6eUAeDmBQ3JQ":{"text":"Epic fail... I ordered a quesadilla not a calzone, also I asked for SC on the side, which ","useful":0,"cool":0},"polSp3fJff8reXu-MajMfw":{"text":"Easily my favorite Mexican restaurant in town. Low-key, quick and always delicious. Only c","useful":0,"cool":0},"FfQ8DB8u5dqBoQcW4FcYMw":{"text":"It's a tiny restaurant near a bunch of different hotels and not more than a 15-minute walk","useful":0,"cool":0},"ZguxTaj8dQWPrCmOWuZK6A":{"text":"I came here on a break from my attorneys office on baronne st, I dined in alone. the worke","useful":0,"cool":0},"n6Cv2zTlkFKcmNigQ0JfEw":{"text":"I'm from Arizona, so I set the bar extremely high for Mexican food. NOLA just don't do it ","useful":3,"cool":0},"z-Toq56Kjk9vgb_iAzWJVQ":{"text":"The taco salad with pork is pretty good with both salsas.  The service is now much faster.","useful":1,"cool":0},"bwJO1qRMwWWdg9ahOpd0dQ":{"text":"It's not my favorite location but it gets the job done. I am a big fan of their taco salad","useful":1,"cool":0},"-l80Ui6mJhhpChDnYndkJQ":{"text":"Everybody that gave this place 5 stars must have NO taste buds or appreciation for authent","useful":1,"cool":0},"Cf0P_NcxpJucqIbw5n6PEw":{"text":"One of my go-to spots for Mexican food in the area. Service is always fast and this place ","useful":1,"cool":1},"zi1du_O52wEs1i7-LteQow":{"text":"Wanted to give a personal shout-out to Rachel and Kennith who helped coordinate a big orde","useful":0,"cool":0},"zKyvA04C0PJ8RJlhsCToIA":{"text":"If I could give NEGATIVE stars, I WOULD! \n\nTerrible! Just Terrible!!\n\nThe service here is ","useful":5,"cool":0},"YJeX-sRPsmxuJ8XK2g4Crw":{"text":"(Got take-out) Solid. Black beans were a bit bland, yellow rice needed more seasoning. Pre","useful":0,"cool":0},"HgL4I7kkr8kyMkj-U8UgtA":{"text":"Came in to the downtown location for lunch with a friend and we had the gutter punk burrit","useful":0,"cool":0},"Wm54QWz806B2o25AbSSzDA":{"text":"110% would recommend! Every we are was superb! Shrimp nachos, creole fish tacos, bbq mushr","useful":0,"cool":0},"SmWlyVw8_YHqWtX6wIQvBw":{"text":"Fabulous! Started with really good chips with queso, salsa and queso con chorizo! Group of","useful":0,"cool":0},"jaVYDv1fj9i3Sz7NxmCSOw":{"text":"Just awful food and awful presentation, cant follow simple order instructions even for ite","useful":0,"cool":0},"XrLghTLLScznTyUPRWsO6Q":{"text":"Very good spot. Actually was leaving Jimmy John's when I spotted this gem. My sister wante","useful":0,"cool":0},"UvUYzwvUQi4biFiln19-pw":{"text":"We stopped in for some quick nachos(a craving) . We got the super grande  nachos and they ","useful":0,"cool":0},"zTnJKRb_GyP6RyfVV4FDpg":{"text":"We wandered over here from our apartment.  The service was great... they did just didnt ha","useful":0,"cool":0},"B28gMsWgtJ47OOc3XzHung":{"text":"Best burrito in NOLA!  Had it four times and it hasn't disappointed.  Make sure to get it ","useful":0,"cool":0},"ND9TN5cjtYkEkbSfIs9s6g":{"text":"I highly recommend the self-proclaimed Juan's Flying  burrito has a little bit of everythi","useful":1,"cool":0},"a_VtiJXlMkYvEkMMHcvyTQ":{"text":"Queso and salsa are BOMB. Wish I got a quesadilla of some sort though. I saw so many on ot","useful":0,"cool":0},"YOEK1K9epFU_wKlD7g43vw":{"text":"Ordered a House Special Chicken quesadilla to go. When I went to pick it up, the bartender","useful":3,"cool":1},"AC3O6jNcBMih92rjL1Fy8A":{"text":"Great food at a fair price. I was extremely surprised at the quantity of food came with th","useful":0,"cool":1},"MYJmnV5KTtflmg2QpBYjWw":{"text":"I choose the supreme nachos they are awesome but when my friend ordered the flying fajitas","useful":0,"cool":0},"zLB4pngMXGOycl6KQdi1zg":{"text":"Good selection of happy hour drinks including $2 tecate and $1 PBR. Good margaritas as wel","useful":1,"cool":2},"q3tNpYArFRyGeB8TLvp7xQ":{"text":"Wanted to give a better review.  Ordered a Flying Burrito (figured this is their signature","useful":0,"cool":0},"hzsfZ6wai6wNq7AjHrv5Zw":{"text":"Food was good, prices were reasonable. My daughter said the luau quesadilla was the best q","useful":0,"cool":0},"mOXHtYQ7vwsoraf-8sZ7GA":{"text":"Awesome place! Have EXCELLENT Mezcal drinks (rare) and service was swift and courteous. Fo","useful":1,"cool":0},"U3MGb3XUaWeNbHI6uZA5RA":{"text":"Food was just ok.  You can tell they use fresh ingredients. Unfortunately it took very ver","useful":1,"cool":0},"eWhyyfNjxoOTnr0jkLd3KA":{"text":"Took over 40 minutes to get our food. All we ordered was a chicken quesadilla burrito and ","useful":0,"cool":0},"6pFYytJfTqRGSGdP3P4igw":{"text":"JUST NOT FUNKY ENOUGH\nI've never really had a bad experience here. But there were times I ","useful":2,"cool":0},"AaX5K71Bno_OGk8HlllCUg":{"text":"Mediocre Mexican food served very slowly.","useful":2,"cool":0},"vdYxQOjMLWqpkSRKBAwZUg":{"text":"My margarita was great... but while dining in there was an unexpected visitor! A BIGGGGGGG","useful":1,"cool":0},"QrOv-vDofokw_vZTBNb43w":{"text":"We come here every visit from Indiana, a 13 hour drive for nachos and their queso. Great f","useful":0,"cool":0},"-ucWm5ByEFI4ZhsN99rScw":{"text":"For $2 beers during happy  hour - it's worth it for a quick meal.\n\nWe ordered the chips an","useful":0,"cool":0},"9-jqA8QqRSglTkOdXmqcRA":{"text":"So I love Juan's. I'd you work in the CBD it's the ideal quick lunch spot. \n\nFood: 4/5 I g","useful":0,"cool":0},"gRgor3WoyxcSkoe0alGbHw":{"text":"Never a bad meal at any of the Juan's!! Food is always hot and fresh. Wait staff are all f","useful":0,"cool":0},"GVuBF5SqkKsmDu_uZtPvEQ":{"text":"Juan's is a good Tex-Mex restaurant and depending location they all have a bit different a","useful":1,"cool":0},"i3_MJNEOWKDQnZMWOi3pXA":{"text":"I don't write reviews on yelp unless it was completely horrific... As a professional pastr","useful":1,"cool":0},"lrdLiDtGX0eRnBosAp0NgA":{"text":"Everything we ordered was yummy and flavorful. We ordered the Red Chile Chicken Quesadilla","useful":0,"cool":0},"oVQCPH15xzNVzLcbq7I29A":{"text":"Pooh and I went to Juan's for lunch. A lot of options to choose from and as many Margarita","useful":1,"cool":1},"9tz74M64GZL-OoVGwmrWig":{"text":"Excellent selection of unique flavors. The drink menu is detailed and extensive. Food port","useful":0,"cool":0},"ZM0cxeU8y9DbZgAltGegFQ":{"text":"The burrito & adobe chicken street tacos were very good. The chips & cheese tasteless. Ser","useful":0,"cool":0},"jGHN5FaQQUshnW_roxZ_gQ":{"text":"When I tell you I am so disappointed in this food, I've passed Juan's numerous times doing","useful":0,"cool":0},"jFSgja0yCA92VBsOeVgIZA":{"text":"I'm happy to report that this location of Juan's has upped their game considerably since m","useful":22,"cool":19},"rB3lB8E1kYYAiqe3-cgpzw":{"text":"Great food, very reasonable prices. We started with the \"Bad-Ass Bean Dip\" and it was kill","useful":0,"cool":0},"MwL-H4tOtr8T1U4CUnFWwQ":{"text":"Oh Juan, por que?  Your LGD and Mid-City locations are AMAZING!  The new CBD location is s","useful":3,"cool":0},"bpIQhOF8mYocFjehQf-UBg":{"text":"We get street tacos here all the time. We LOVE IT! The guacamole taste fresh every time we","useful":0,"cool":0},"qTVi4Khz6TvHkmeiIxghOg":{"text":"Want a burrito so big you can't finish for under $10, well this is your spot! The best way","useful":0,"cool":1},"f4wMlpKnR-D_kdI-R-klcw":{"text":"This was my first trip to Juan's Flying Burrito. We attempted to call more than a week in ","useful":1,"cool":1},"BXtYNBVKsKfo54CxeWGfQw":{"text":"Maybe I'm just spoiled living in the greater Houston area, but finding quality Mexican foo","useful":1,"cool":0},"zQNKzeoeHo6ZQV6TTmJpvA":{"text":"Me and My boyfriend decided to get a burrito because we were leaving to go back home so we","useful":0,"cool":0},"E_Wz3Fwc7ZxHukS4ZTVTCw":{"text":"So Juan's met my expectations today. The problem is my expectations were somewhat low. I l","useful":2,"cool":0}}