{"3oBoNEgxlfz9xxRkdo44iA":{"text":"Had a lovely lunch here at Namese with my husband. Highly recommend the shaken beef pho! I","useful":0,"cool":0},"2yD5wciQxRCoI4azdAU3Sw":{"text":"Finally a Vietnamese restaurant nearby. Love the spring rolls and combination soup. Yum...","useful":0,"cool":0},"flVHsnpbY_LaeQy-YxA4Xg":{"text":"Just came in to order some food.  First off I had to walk to the bar for a seat.  The serv","useful":0,"cool":0},"IOui1y5MpIdtSbtCFrbLGg":{"text":"It was ok. Honestly if you have not been to Pho Bistro on Carrollton you are missing out. ","useful":0,"cool":0},"1G-oaEj3Lvf8fSbTjkPHBQ":{"text":"Came here for lunch. It's a cafe not a restaurant so don't expect much. Pho was too salty.","useful":0,"cool":0},"tNTZA3T8Up4fYiPpBEm9Dg":{"text":"my trusty neighbor brought me here to try Pho for my first time ever. yah, i know. anyway.","useful":0,"cool":0},"odAN-7-aBvfsuNejQbDFgQ":{"text":"I've been here twice because I wasn't impressed the first time. I'm fairly certain there w","useful":0,"cool":0},"fbkKb_6rv-5RoeXLTHjA0A":{"text":"Brandyn was our server and was extremely great. He had wonderful suggestions. I got the wo","useful":1,"cool":0},"5Plzp_nu45uyjjBv3qESJg":{"text":"I seem to have a different experience every time I go. sometimes everything is perfect -th","useful":1,"cool":0},"5wee9qDJrK_DMh92p2RIrQ":{"text":"Absolutely, without a doubt, the WORST pho I've ever tried to eat. Imagine taking a bowl o","useful":0,"cool":0},"S9eamr8o-vnp4zhJnLCd-g":{"text":"Finally went here after months of driving by. Perfect, fresh dinner I was pleasantly surpr","useful":0,"cool":0},"QOIvWQs5z9wmSw-41V2L2g":{"text":"Good n tasty Vietnamese food.Had the springrolls shrimp wrap with bacon da bomb!!! And Pho","useful":1,"cool":0},"if2WXySske_JrmgVM4MM0A":{"text":"Mondays are rough in New Orleans. It seems like everything is closed with the exception of","useful":15,"cool":9},"UhhsMjSvET3rkviOUH536w":{"text":"After stopping at three pho restaurants to find that they closed on Monday, we finally fou","useful":0,"cool":0},"uqgs3PzG6W9I-akF11a_-A":{"text":"having heard alot about this place from friends, we came here to give it a try with great ","useful":4,"cool":2},"uNZ1QYnRE6_uw6mxfATBlQ":{"text":"This was my first time trying this place and I was totally satisfied. The food was great t","useful":0,"cool":0},"jWKDNYbsJLW_0Z214FBcIQ":{"text":"Love this new Vietnamese place. Their food is delicious, staff's friendly and the price is","useful":1,"cool":0},"qZh2Q_jxdBlLhnN6RZYJcw":{"text":"So delicious! I love the shrimp steamed tacos. The green sauce on them is insanely yummy s","useful":2,"cool":0},"_-kgJJ-asKKK-BawQQizPw":{"text":"Was not expecting stellar Vietnamese here, but after moving, this is my favorite neighborh","useful":0,"cool":0},"Ph9H9MWTzavVhBrMoknoVQ":{"text":"Two \"so-so\" visits, one disappointing take-out experience, & a fourth try where I received","useful":1,"cool":0},"BUSHT_LK9IP7r8aQdTaJlg":{"text":"Anytime I have had a conversation about Vietnamese food in the city, Namese has always com","useful":0,"cool":0},"7F8ud-52D9Z9h3l6_22x5A":{"text":"I was surprised to see that I gave this go to spot 3 stars over 3 years ago, as I eat here","useful":4,"cool":3},"MO9juYuwALeMwvdwuj7Ccg":{"text":"We ordered to-go for the first time to try this new restaurant. We ordered 2 pho chicken a","useful":1,"cool":1},"7RqtGsNlaa9Bb4hoVfcQkA":{"text":"Debating back and forth between 2 and 3 stars. The food was EXCEPTIONALLY good and very fl","useful":3,"cool":0},"ZQhlSL0hwID8xvz5u_pfBA":{"text":"My girlfriend and I are always looking for a decent bowl of pho on the east bank, so a few","useful":0,"cool":0},"E13Beujc0cQS_e2nqA9lLQ":{"text":"This place has excellent service. If you have a large group call ahead. \nOur waiter was Ch","useful":4,"cool":4},"PLfwOAgh0qH8aUjtODWCrw":{"text":"Dined here several times and it never disappoints. Food is fresh, fast, and delicious. Ser","useful":2,"cool":1},"ekl0uouM5N3ENo8WdAzjbg":{"text":"Love Namese! A classic go to that never fails to satisfy. We always start with the lettuce","useful":0,"cool":0},"R3KoYPO46d46879D8WtTFA":{"text":"The manager delivers the food to us at the bar just beaming with pride! She loves what she","useful":0,"cool":0},"b59jJIFo4Fjidyw6JTGJ8g":{"text":"Great food. Haven't had may pho experiences, but this was a lovely one. Had the steak pho ","useful":0,"cool":0},"cPC9Nh_0ujctB-zQLJ62Fg":{"text":"In mid-city, your vietnamese options are Doson and the newly opened Namese.  Namese has gr","useful":2,"cool":0},"Jb_urVGfN3v6muz88j4ViQ":{"text":"Namese was the type of restaurant, that when it opened, I proudly announced to my friends ","useful":0,"cool":0},"Be_IezTCEprAbPQAW4u7YQ":{"text":"Namese is terrific.  The menu is inventive and creative while still doing a great job of s","useful":0,"cool":0},"DHPYXbZMnU9M2YsXHOlAlA":{"text":"Decided to try a new place and the night started out great with delicious appetizers and r","useful":0,"cool":0},"F-eocI-IlkNQJ_u5qFw50A":{"text":"I took my wife and family of three children to this restaurant for a semi-celebration of m","useful":1,"cool":0},"ZUwfOpMx9-LhtsQQAZamOQ":{"text":"Been here twice so far. Haven't tried the Pho yet but I have tried most of the steam buns,","useful":0,"cool":0},"FEeINhPbxRg0TQCAWVXIzg":{"text":"This is the worst restaurant I have ever been to. Once we were seated and had menus we ord","useful":1,"cool":0},"JOBJkBxIVPRC3hKcNhY6VA":{"text":"Ordered the honey dew boba, the tapioca pearls were perfect, paid $5.50 for the drink. The","useful":0,"cool":0},"rOCh4f35eCqIxbbK45BVww":{"text":"Great seafood pho. Great service and Brandon gets five stars as server. I'm definitely mak","useful":0,"cool":0},"-1u2LYh2A4-AO8DXQOxWPQ":{"text":"Service was wonderful. Bubble drink recipe need some work. Too expensive for the portion g","useful":0,"cool":0},"IHIrey6oMix2H1W3uus5QA":{"text":"Went on a date with my boyfriend to Namese... We wanted to go to some other Vietnamese res","useful":0,"cool":0},"UeSzAVFKsUItHL470SG3Tg":{"text":"I love this place. The food is so good and I love the ambience. They have a really nice pa","useful":0,"cool":0},"UXU6spC0_2up7MuSG6wSAA":{"text":"Very good food! \n\nCrab Rangoon was very good. Decided to get the Pho Hai San and was not d","useful":0,"cool":0},"nFr2KQ13bTteTuzoyopZ6g":{"text":"What an honor to be this places 100th review! So long Mint....this is my new favorite Viet","useful":4,"cool":2},"JSnH9HRXredKudvf4bwDEg":{"text":"Have gotten take out on both visits...does not disappoint! Great staple items and some coo","useful":1,"cool":0},"ggs15--Ety_1iz0VULVw1w":{"text":"This place is great! I have eaten in on a number of occasions and the service is always gr","useful":0,"cool":1},"N_Ls6i04K1zfGCkccwMgpw":{"text":"Great location with window seating and outdoor seating for watching the world go by at the","useful":1,"cool":0},"bRc1UAS4mYkm0W-3k3dKxg":{"text":"This is by far the best pho in New Orleans. Full of flavor. Perfect ratio of broth to nood","useful":1,"cool":1},"kDUjqWuO3CQUobaFYQCuZA":{"text":"Make reservation we came in with a party of 10.  Small place but real modern.  I love the ","useful":1,"cool":0},"8pZk8E74wmnIRpjB552EYQ":{"text":"I want to bathe in the shaken pho broth. This is just the best pho especially for when you","useful":0,"cool":0},"YT1ISjdfJFNsn6xZtfdVPA":{"text":"Namese has become one of our go-to spots in the short time it's held court on the intersec","useful":2,"cool":0},"g90T-46G56A298s7dzi-3A":{"text":"Excellent experience.  Maybe my new favorite (top 2?) Asian restaurant in the city.  I had","useful":0,"cool":0},"CBPes0tFagNpTnvzk5VXWg":{"text":"We're big fans of Vietnamese cuisine. The spring rolls and Phoga there are phenomenal. Gre","useful":0,"cool":0},"zik3oZKAGheMN6pDfQ2brA":{"text":"Stopped here for lunch after one of my fellow yelpers bragged about how good it was. I ord","useful":3,"cool":1},"13Hm9bzMXkD-mAgRJUzQ0w":{"text":"We've ordered from there twice more since my last review. Yesterday we got takeout--it the","useful":0,"cool":0},"0CRe9qRi8j2j-azTe-FMnQ":{"text":"This place is great. The curry and seafood pho were super flavorful and the service was fa","useful":0,"cool":0},"O_VOJQ0_4HN6rALy9V3t9A":{"text":"Always a great meal nice portions of tasty food big variety heat service nice atmosphere w","useful":0,"cool":0},"NOwdZazg7xuiJa5o2K_3Ow":{"text":"This place has one of the best pho I have tried. I ordered fried tofu and shaken pho with ","useful":0,"cool":0},"XkqEQRzIDVeI_uiSBJCGFg":{"text":"Ducky Cuban, Bun Bo Hue and Catfish all delicious!! Nice ambience, we will be back!","useful":0,"cool":1},"4RXJFN_aIRG1UYkjH7oxkg":{"text":"I opened the menu I found the prices to be a buck or two more per item than what you see i","useful":3,"cool":0},"_x1DQSousEqOUDvM9M1BgA":{"text":"My favorite go-to lunch/dinner place in New Orleans. Everything on the menu is awesome. Th","useful":0,"cool":0},"-9tM-Lotpd7tItXdQ_SGUQ":{"text":"I would really like for more clear labeling for items that contain fish sauce or animal pr","useful":0,"cool":1},"FZoVRJRfiHEt-3yxugrf1Q":{"text":"Very good Pho. Good egg rolls. Average pork belly buns. Good service. Nice interior and de","useful":0,"cool":0},"sIgmuA0yfJM3DB2f9n_IZg":{"text":"Namese has the most delicious Pho I've ever had. The meat is delicious and the broth has g","useful":0,"cool":0},"M8ds-W6KgIze0t5YTXfg_A":{"text":"Namese is always good. Great pho and the best banh mis around. Love the new updated outdoo","useful":0,"cool":0},"EYxy-_ZKnzGBCPY1LvXlgA":{"text":"Delicious and very true to what makes pho and banh mi (Vietnamese po boys as they say here","useful":0,"cool":0},"yTzm_ZUmXFj5yRLklNxoDQ":{"text":"Great food, service and vibe. This is a hidden gem I stumbled upon. The pho, curry and bao","useful":0,"cool":0},"t0HAJIwQClmKIEkkiU3DgQ":{"text":"If you don't feel like driving out to the east for Vietnamese food this is a great option!","useful":0,"cool":0},"qPjThvl8jtU559upqKpbDg":{"text":"Terrible service. They close at 10, but when I called to order at 9 the guy who answered t","useful":0,"cool":0},"D4_r29lPa34tPFQy09GfXg":{"text":"I ordered the Garlic Shrimp with crabby rice, my husband had the shrimp pho. Both dishes w","useful":0,"cool":0},"-3Kn6damrcUla1K37-AmNA":{"text":"The Shaken Pho is great. Brings out the flavor of the meat. They have revamped Vietnamese ","useful":0,"cool":0},"UP7NhRBirArLaUPoCFJRiA":{"text":"Really solid Vietnamese and Asian fusion stuff.  Outdoor seating area is nice.  The shaken","useful":0,"cool":0},"DDMGr4QVQCFnXn2v8h6zMA":{"text":"Excellent service. My fiancé had the pho Ga. It was a huge bowl. He said it was great. Exc","useful":2,"cool":1},"A5-zqtsR42AA3SYyN3gdFQ":{"text":"So delicious!!!! Awesome environment and incredible service!  There are a lot if vegan opt","useful":7,"cool":2},"Po___zhB7x3KSgv5gvkhMA":{"text":"I've been hearing this Pho word for a year or two and I finally was able to experience wha","useful":3,"cool":2},"jUevltvlxe1-Mo2p7rhitQ":{"text":"I have been wanting to try Namese for a while now. Today was the day. We went for lunch on","useful":1,"cool":0},"09nv8OQ_yGqOCLCqBbzZFQ":{"text":"Stumbled into this Vietnamese restaurant after our shopping trip at Costco and was pleasan","useful":0,"cool":0},"kKEQJbA9rYh6AZH0o0mtIA":{"text":"Especially when it's cold or rainy, my household loves having Namese delivered straight to","useful":0,"cool":0},"PCRTaCdDMEB8ZmRQRRgEkQ":{"text":"Always amazing! And the service is wonderful as well. Thank you Brandon for an incredible ","useful":0,"cool":0},"vuR8Prb8KdtyT9C6R6Iw9Q":{"text":"Awesome food for an amazing price! I had the lemongrass chicken vermicelli, which was a go","useful":0,"cool":0},"gkC3oDJF-K3MAU3U1s6PCg":{"text":"I will start by saying that I would probably give Namese 5 stars if it wasn't for one thin","useful":0,"cool":0},"7i-fykquUrnGUFS-wE2Qsw":{"text":"This is another example of restaurants in NOLA taking a modern spin on vietnamese restaura","useful":2,"cool":0},"LSoe5URVuMmR830XTC63Jw":{"text":"*UPDATING MY REVIEW 2/1/17\nThe service is still 5 stars. The 2 stars is for any tif the sh","useful":2,"cool":0},"CKwOgsHCC7tLlnVTUsfcwA":{"text":"Sooooo good. Probably the best pho in the city. Great prices and a nice, clean environment","useful":0,"cool":0},"vhcsKdrYVeexfGKRHXWAbA":{"text":"Food was totally edible, but nothing more.  With all the great Vietnamese food available i","useful":0,"cool":0},"IrPlYQoxJVN42m6LA2sNJQ":{"text":"Oh my, the mussels are to die for. Love the pho and banh mi combo and the combo bun vermic","useful":0,"cool":1},"7s6jZXBH8Gexs1z57LeOgg":{"text":"The first four times I ate here the food was great! I enjoyed everything that I had tried.","useful":2,"cool":1},"5QqBexGD4TcLPrqRhVugww":{"text":"This place is good. Worth a trip. They serve alcohol also and have decent martinis. \nGreat","useful":1,"cool":0},"0ElB38SPqpnor3_TRG6Mvg":{"text":"I had a wonderful experience at Namese! Gretchen, our server, was perfect!!! She was super","useful":0,"cool":0},"C0mFhK3PxUau1Jtez6A2OQ":{"text":"I absolutely LOVE the papaya salad! The service isn't the best...so I normally get my food","useful":0,"cool":0},"kvAcCB_177fwTtsMVl68gQ":{"text":"OMG, I have to move to New Orleans!\nThis is hands down the best Vietnamese food I had for ","useful":0,"cool":0},"O4TC-7lQkfFrNBU3gKexlQ":{"text":"Decided to take my family here before leaving NOLA.  VERRY pleased with staff and presenta","useful":0,"cool":0},"LVZPzWEcLIw8_fE84GL2dA":{"text":"Nice, friendly service. Delicious food. Especially sliders, banh mis, and rice plates. I h","useful":0,"cool":0},"Ajvl7UN7__bUpnw85kXLLA":{"text":"The food tasted real good and the service is just perfect. My favorite is Avocado Bubble T","useful":0,"cool":0},"LCqUqx65dc4KClJzg0eNPw":{"text":"SHAME ON THESE PEOPLE!!! WON'T BE BACK! Good food isn't enough to compensate for strangely","useful":0,"cool":0},"wNKIKwBYLLEIgF6LUfq2cQ":{"text":"As a (wannabe) vegan, this place has the best vegan bahn mi I have had in the city, yet sa","useful":0,"cool":0},"MkleM1QRhmgAzMYFMhjkVw":{"text":"Came here for a quick dinner with a friend. Vietnamese food has really taken off in New Or","useful":1,"cool":1},"nuAAJo8p040SD3gghkjdaA":{"text":"Maybe it's what I ordered the first few times around, but the entire menu is not five star","useful":2,"cool":0},"u2aMvpm1rS0cwHYytHf38Q":{"text":"I returned to Namese and decided I liked it.... A lot.  The chicken wings are awesome.  Re","useful":0,"cool":0},"TKMvnEQqzRj53J10KOS37A":{"text":"Excellent Vietnamese food, appetizer was delicious, traditional spring rolls and egg rolls","useful":0,"cool":0},"QA9ecfj74hVgUGSUD4XaVg":{"text":"There are a lot of good Vietnamese places in New Orleans, mostly on the Westbank.\n\nIn my o","useful":1,"cool":0},"udsFn0zzXdTgvPPoXjCPuw":{"text":"Good food at reasonable prices...food could be better once they work out the kinks of a ne","useful":1,"cool":1},"hWy6CUSOEYCIch_e8eLgXA":{"text":"AMAZING! The banh mi appetizer was delicious! The pho was out of this world. My boyfriend ","useful":2,"cool":0},"07aM_FD9OyB8T61ybWgQjQ":{"text":"Very good Vietnamese on the East Bank.  Went here with a friend during the \"freeze\" and re","useful":0,"cool":0},"WfFlh32Dw-2kls0-UD7gnw":{"text":"Food isn't too interesting. Price is fair. But this is one of the better viet places in do","useful":0,"cool":0},"s8rvlyTsXwVDnTFvdjtyIg":{"text":"Menu clearly marked with gf selections. My server understood gluten free restrictions and ","useful":0,"cool":0},"IVxg6IrrRd_6KKNuxLgG2Q":{"text":"This beautifully done space offers al fresco seating and an exceptionally hip dining area ","useful":6,"cool":3},"jUdj00_bU0v5nPUwlvJUQA":{"text":"We decided to check this place out tonight after discussing trying it several times. They ","useful":0,"cool":0},"klrv0FKmBdlUDAv1cNEoXA":{"text":"A great place with very caring ownership. I had an issue with a rude staff member and the ","useful":0,"cool":0},"hHEN9a_VOgS4qZua8DSjMQ":{"text":"Namese. I love you so much. You offer delivery and your shaken pho bac has brought me back","useful":0,"cool":0},"eQ2UOcx9xQbekpF8E0KIMQ":{"text":"first time tonight! trying to shake a cold and really wanted some spicy pho.  this place h","useful":1,"cool":0},"4FJEPCFysdPPp2HVc-UTPA":{"text":"I've been to many Vietnamese restaurants this is by far the best Vietnamese restaurant I h","useful":0,"cool":0},"YmgKQ3jVQbwYXnP9A3nd0A":{"text":"Love the atmosphere and staff. Service is great. Food is fantastic. Are here twice and the","useful":0,"cool":0},"s91bUCsrYDofkYxLzgFuOQ":{"text":"Great dishes all around! The slaw salad with lime vinegar wrote will bring me back for sur","useful":0,"cool":0},"5-PP-5l2NYmwh50vhDYDGg":{"text":"Coconut lemongrass curry with tofu is delicious!  The shrimp spring rolls are to die for a","useful":1,"cool":1},"zmZNkmcYbrISgW995KRx6g":{"text":"Really good experience here. We came because they have more than just the standards on the","useful":1,"cool":0},"xVE44ftbKw6wFp-hEmtZGg":{"text":"The food I had was incredibly delicious, but I think that can vary based on what you order","useful":0,"cool":1},"R-8GdNULiXZvlqte198OWQ":{"text":"Yes to everything! The food , the drinks, the staff...amazing!! I went in before closing o","useful":1,"cool":0},"X17a7oNhyt9uB2f5HPivVg":{"text":"By far my favorite pho restaurant. Great service and great food! Brandon is a great waiter","useful":0,"cool":0},"KpTChxhl1yo0ENDMcl8V6w":{"text":"This place has excellent ambiance and is basically the only Vietnamese place in Mid City. ","useful":1,"cool":0},"w1Ra7woZjL_qGsX1ZMaqEg":{"text":"Before you walk in to this restaurant, you can already smell that it's going to be good. I","useful":0,"cool":0},"vDquM9gv38qC4lU0J3Kxgg":{"text":"Fresh and delish!  I first stumbled upon Namese after a workout class.  I was searching fo","useful":2,"cool":0},"kDaYFkERjOAfbHFqyQL4sQ":{"text":"Namese, hip, cool, TASTY!!! \n\nMet a friend here for lunch and at 12:15pm the place was pac","useful":2,"cool":1},"EvRdm0wmgCANh3ZfhpIvPg":{"text":"Namese is a new-age twist on traditional Vietnamese food done right! From the environment ","useful":5,"cool":3},"WGOOKHadOwvg8lrK_khYHw":{"text":"The food is delicious and the portions are huge. I found the service to be quite good and ","useful":4,"cool":1},"N0TW5spa8eZKMjsU674tng":{"text":"Great food!!!! Great service....the calamari is AMAZING!!!! The brisket pho is amazing. Th","useful":0,"cool":0},"AHu1khYF_kPu2Yxjw8cAiQ":{"text":"Duck Bao - it's like a Vietnamese Taco.  The Peking Duck & the dough is PERFECT.  I'm not ","useful":0,"cool":0},"JYpfEfRws_s5vIuwJO0ozw":{"text":"So got sick and didn't have anyone to bring me soup so I planned to just go to the nearest","useful":1,"cool":1},"nMzW5b6g4Nb0Wz6kSqF1Zg":{"text":"H","useful":1,"cool":0},"iGRYOiQ59SCXKMhH1bVx6g":{"text":"I love this place. I've been coming here for a while and still sticking with them. I love ","useful":0,"cool":0},"CJ403Tk_9S1Q4ZWCCi364A":{"text":"I have the short rib shaken pho and my partner have the shrimp curry.. the best pho I have","useful":0,"cool":0},"rkrHa8Ba2MNRH9lRMVjYpQ":{"text":"Exactly what Midcity needed.  I was hesitant to go in because the parking lot was packed a","useful":3,"cool":0},"Rf6P8x0-60CC0G9QveGlfA":{"text":"I came here yesterday on a date. We were ordering take out so we decided to sit at the bar","useful":4,"cool":1},"qH7oH9kg14-jzFj3ZAF9HA":{"text":"If you haven't tried the \"shake it\" pho yet, it's definitely a must! Filled with so much f","useful":0,"cool":0},"2TYClUVKysV-34YVsmLw0Q":{"text":"Oh yeah.  I have  to say when they were opening the place up I was skeptical whether it wo","useful":1,"cool":0},"d7jeujeM-Oa4CP04Mt3X-w":{"text":"Update: I went back and tried the Filet Mignon Pho, and it was great. Comparing it Mopho, ","useful":1,"cool":0},"t16cponj611btnt43vWZtA":{"text":"First time here. Just two of us and we ordered mussels, lamb lollipop, seafood phô and pay","useful":0,"cool":0},"PgBnGynVEPQjw5ILjW_UEw":{"text":"The chicken pho was full bodied with lots of noodles, Asian basil and cilantro. The grille","useful":0,"cool":0},"9qIBTBXO0TNPek14XguHog":{"text":"Yuck! I grew up eating Vietnamese food my whole entire life. This one, I know for sure, is","useful":0,"cool":0},"devs7MrfXkcR-LuI06KDjw":{"text":"Ed the bartender and Franky the beautiful redhead, Rachel the sweet girl from Huntsville, ","useful":1,"cool":0},"7WRppnvLXi7xm-W6ck5JfQ":{"text":"The food was very good!!! Great twist of modern favors with traditional authentic vietname","useful":2,"cool":0},"8bzjXIG20LhGE3beimF4HA":{"text":"Okay, I'm catching up on my reviews. :-)\nMy husband and I ate at Namese for the first time","useful":0,"cool":0},"1mXHsbqLHMETd9BeryH95g":{"text":"What a great new restaraunt.  Went on a weeknight and the place was packed! The wait staff","useful":0,"cool":0},"xOE07YgnStlgFEiZ2aTSLQ":{"text":"Immediately when we stepped out of the car and smelled what was lingering in the air,  we ","useful":2,"cool":1},"SaLVXznXF6x0Z60zQXUcow":{"text":"Will Return. The fried dumplings were very good, and the chili dipping sauce was a standou","useful":0,"cool":0},"3x330RqNhoASnePvQTh90w":{"text":"Just ok, had a strawberry margarita that costs $9 but tastes like $3. Had the Ducky Cuban ","useful":1,"cool":0},"t6bnDh-9_I8nl_w8AU8pSA":{"text":"How many restaurants can you take a vegan, and omnivore, and a gluten-free person to and h","useful":3,"cool":1},"2P2N7f1u8pSpLk5p5FhdZw":{"text":"Great Vietnamese food in a clean atmosphere. If you have a car and are visiting NOLA, then","useful":3,"cool":1},"F8n4EQKE5sZeu43ypSC6kg":{"text":"I never thought I'd be dining al fresco on a beautiful patio located...at the corner of Ca","useful":9,"cool":6},"4PYAJv6N1JX3I_rEofmT6A":{"text":"Food was delicious, and served in sizable portions. We went on New Years Eve because we ha","useful":1,"cool":0},"e6hsoEn-e1dWrVbyvf7GDw":{"text":"Oh yes. Great food, tons of healthy options, very reasonably priced. Lighting is a little ","useful":0,"cool":0},"Fu2KzaZchUJ1A6lKi257Hw":{"text":"My Passion fruit bubble tea was horrible.. The whole blender was full ( because she puf so","useful":0,"cool":0},"GOoYvY1o1gtKhM2M9njQNQ":{"text":"Vietnamese restaurants are exploding all over the city and this one is in Mid City. I had ","useful":4,"cool":3},"x2dysuqky7Xz5qUHHc9H2A":{"text":"I've been going to Namese and ordering the shrimp salad and the spring rolls each time and","useful":1,"cool":1},"d1JO2UAIJlxskdIlFtm-cA":{"text":"I've seen this restaurant so many times, but I finally tried for the first time today for ","useful":0,"cool":0},"shtVHyZv_6NoP1Rb2HHjuQ":{"text":"Do yourself a favor and go to Namese. Right now. I mean it, GO. The Shaken Pho has a wonde","useful":1,"cool":0},"KXEHYObK9DHnsWTAOADpPw":{"text":"Food here is pretty good! I've been here countless amounts of times since they've opened a","useful":1,"cool":1},"Z8G694T7Y_1ZcfM42ZBpDA":{"text":"Ordered take-out here for my first try based on reviews.  I ordered the bun (vermicelli) w","useful":0,"cool":0},"hI3MUz7xUZkXeTRh6SLECQ":{"text":"A Mid City gem. The pho is awesome. The beef broth is my favorite with all the onions and ","useful":1,"cool":0},"bZAaSfRocqwtTibV7ey4Sg":{"text":"I have eaten at ~30 Pho shops over the past 6 years having come from southern CA and I hav","useful":1,"cool":0},"wFXIgw5zgQi2AaEmzae0GA":{"text":"I was impressed with the many GLUTEN FREE options available , and posted on the menu inste","useful":0,"cool":0},"BZfEtZXOMoRzIta_oBxp_A":{"text":"This place rules! They have great Vietnamese food! Every dish is delicious! Our server Bra","useful":0,"cool":0},"xLOEBTfxxUJukxKv8eWrbw":{"text":"BLUF:  Currently not many Mid-City Vietnamese options but this one is pretty dang good.  G","useful":1,"cool":0},"o-y6CDGLlvqfyM_5TBnOwQ":{"text":"Located right off of I-10. It was nice to go back to tan area which I grew up in. There wa","useful":0,"cool":0},"7chmgnSLD6N_wJO3y345LQ":{"text":"Great atmosphere for a medium sized group. Lovely outdoor seating. The appetizers and food","useful":0,"cool":1},"26YfYg5TeRb6cWqX5kkIvw":{"text":"Tried this place out for lunch on a saturday.  Considering the location, I would not come ","useful":0,"cool":1},"B19tR5gBywDMnBoYEzOXng":{"text":"No! Despite its hype, the food here is mediocre at best. \n\nCame here on a Wednesday aftern","useful":3,"cool":1},"qtF6EhLo_YI3oqbrGFD3uQ":{"text":"My first time trying Namese. I love Vietnamese food was looking forward to it. We were abl","useful":0,"cool":0},"JelDOYVvckUMp3MnP6vwig":{"text":"Service was great! Our waiter was ever so attentive. He was personable, helpful with sugge","useful":0,"cool":0},"wg2of50Nc4Dyb3yacMtqjQ":{"text":"I haven't tasted food like this since I was in Thailand!\n\nThe egg rolls were to die for; a","useful":1,"cool":1},"-kZT2UMsGMBQnbpPVWfyZA":{"text":"all of the food we ordered was delicious, fresh tasting, and well prepared.  \n\nordered the","useful":3,"cool":0},"nqBBDvJiIDpLzMGxnbzvhQ":{"text":"Great food! 4 stars on the food for sure! Unfortunately, 2 stars on service. I hate to jud","useful":1,"cool":0},"IHzF-gV1KBlVj4PvxYr10A":{"text":"Went the other day on several suggestions from friends. There's a bit of a wait for lunch ","useful":0,"cool":0},"dHlNJ5ALgDsn5C9RBnvKbQ":{"text":"We had a great meal tonight. Cornish hen was better than the really good soft shell crab. ","useful":0,"cool":0},"77gd9enXMSyAQMTXyXOfFQ":{"text":"why are you closed on sundays?! all i want is your delicious pho when i'm hungover and you","useful":1,"cool":1},"IChEdSri-MtU9KF-4SY0Cg":{"text":"This place is modern and clean.  Staff were very welcoming and gave excellent service.  Th","useful":0,"cool":0},"dLMuYJJjXs0sAUTGeE0d_Q":{"text":"Can't wait to come back for more. They are open later than other Vietnamese restaurants (t","useful":1,"cool":0},"LLTZlrZ55EjAwrWBu91I5Q":{"text":"Went here yesterday for dinner because of all the praise on yelp and I have to say, someon","useful":0,"cool":0},"FO4J8QZabCeonpvdGDHfPw":{"text":"Even though I have never been back to the restaurant, we oder delivery frequently.  This r","useful":1,"cool":0},"FV0FVnGAL1rucIvg5ThHUQ":{"text":"With all of the great options for pho in New Orleans, it's a little mind boggling that thi","useful":3,"cool":0},"CpA1vwxhsiKXfvIRVLwHgA":{"text":"This restaurant is right by Carrollton & the interstate, in a high traffic area. While the","useful":0,"cool":0},"p5rRnyoqgcl80sevN63OVA":{"text":"I have been dying to try this place and what better way to experience your birthday dinner","useful":3,"cool":1},"SMyqPrBF91YRc0Rt_KmFAg":{"text":"The food is way too sweet. The grilled pork was incredibly sweet and the bubble tea was al","useful":0,"cool":0},"tYTNwcbdfG4CdJxfQFrdDQ":{"text":"I came here having read good reviews about it. But it wasnt something I expected. The crab","useful":0,"cool":0},"S1Zat8pNxrM4mDiBN8Yw6Q":{"text":"The pho was quite good.  I got shaken short rib. The waitress was unable to explain to me ","useful":0,"cool":0},"IiX5HazGZoZDr3R81liewg":{"text":"A hot bowl of pho is just so satisfying !! Best part ? Check in on yelp and the restaurant","useful":0,"cool":0},"2A9nlrWwms6-_sIf1Ct3LA":{"text":"Funky hipster vibe Vietnamese place that has really done a nice job fixing this spot up in","useful":4,"cool":3},"KOUO-WZWsWXJTzTFLj0JOQ":{"text":"Thoroughly pleased with this new neighborhood Vietnamese restaurant. From the edgy decor, ","useful":5,"cool":5},"efMAVDWp0YBj33tpNIsVQQ":{"text":"I really like this places. Try the fried\nCornish hen and the spring rolls!! Also great ser","useful":0,"cool":0},"8AR-TV4sP7J-IQGo1yffTQ":{"text":"They have pretty decent food and the deliver in the neighborhood Their veggie options with","useful":0,"cool":0},"0fJuXO787DAxQOCvVC6mPw":{"text":"Service was quick and the food was delicious! My friends were looking for vegan food in NO","useful":0,"cool":0},"CWbjosh-pweFv36wEWrM_w":{"text":"So. A group of friends and I went to Namese on Mardi gras. I was treating them to cocktail","useful":1,"cool":0},"kjBCN9hpDV3Kyy0xN4tz3g":{"text":"If you live anywhere near mid city, you know the options for good Vietnamese food are pret","useful":1,"cool":1},"r_9T3WsBz8eVUAJO3oHSDg":{"text":"I eat at a lot of Vietnamese restaurants, but this is my new favorite. The combination Pho","useful":0,"cool":1},"W74sRJ44XRkWh80nYXgFJA":{"text":"If you are in Mid-city and craving Vietnamese then Namese is the place to go.  I have been","useful":0,"cool":0},"Ma87CYMYk4Uo4M8k8OWiFA":{"text":"1st time visit yesterday with my little son. Service was great. I wanted a change and trie","useful":1,"cool":1},"KauB82oJXmcySpmdmSnJdA":{"text":"This is the best Vietnamese food that I've had outside of New Orleans East. It was creativ","useful":2,"cool":2},"1AJhosUprByLk-l5Myejig":{"text":"What I ordered:\n\nGrilled Pork Spring Roll\nPhó & Bánh Mì\n    Roast pork bánh mì, and briske","useful":1,"cool":1},"9w69Vqi1oVbRX7dIlkri5A":{"text":"Amazing duck Vietnamese tacos! The fire pits outside are cozy and inviting as well. Great ","useful":0,"cool":0},"uoPhw5jIabsNY6KaCcS-Ww":{"text":"I really like this place!  I have invited friends from out of town to eat here with me...n","useful":0,"cool":0},"e9k6tA0KcOe5I66h5jpiEQ":{"text":"We ate here for the first time last week. I ordered Pho and spring rolls. The Pho was real","useful":0,"cool":1},"ndSI7saFMzesBO2aXtJKQQ":{"text":"I came here with some coworkers for a birthday celebration and it was quite possibly the b","useful":2,"cool":1},"WHBVbHLFrQ0dH50zE3kaPA":{"text":"Good egg rolls, but my chicken bun was not good. Noodles were stuck together. Chicken was ","useful":0,"cool":0},"hDGUfCPNeEQ3_BzRdJq_aw":{"text":"Very good pho.  Manager was very friendly and helpful.   Suggested the short rib pho which","useful":0,"cool":0},"efCEZHtQzIjtaTiabCgxvA":{"text":"Great food, excellent service!! Plenty of delicious vegan options. We had the Vegan Pho an","useful":0,"cool":0},"mke5g1k8GQnboCTOYhnudQ":{"text":"My first sign should have been the challenging parking!  The lot was full at noon, so I ha","useful":2,"cool":0},"SRLYwz9usS9--z1aD5m5Og":{"text":"Pretty good food. Good service. Nice atmosphere. The food is not as flavorful as my husban","useful":0,"cool":0},"ChFSOAyOub9dYHS_WqKO8w":{"text":"I. Love. Namese. The menu is great and the prices are even better. I love the little shrim","useful":3,"cool":0},"iaHy3qoEtD-u9GhaEHeRdA":{"text":"This place has the most delicious crab rangoons, more like empanadas! Their pho and banh m","useful":0,"cool":1},"JEhFB5PU2XMeXKylyEi5Xg":{"text":"You say the word \"Namese\", and I instantly start drooling. Not only is the food crave-wort","useful":0,"cool":0},"743COIOgrN-wk2ubdTht2w":{"text":"They deliver!!! How exciting is that? Not only do they deliver but the food is delicious! ","useful":0,"cool":0},"glrU4_yZDQgBYmSmbWaPzw":{"text":"Yeah unique flavor for pho broth. Never really had anything like it. The muscles appetizer","useful":2,"cool":1},"qC7whhhyGltlNjmLf9sM0A":{"text":"Amaaaaazing vegan pho and tofu spring rolls! So nice they have lots of vegetarian options.","useful":0,"cool":0},"r0PxrVUF2x--mMgES_M4OA":{"text":"while the food is good, it isn't as spicy or gangbusters as some of the review here state.","useful":2,"cool":1},"85qqsPRqPcNlLMmdz8m4kw":{"text":"Shaken Pho is excellent, some of the best noodles in the city!  Service is great, the staf","useful":0,"cool":0},"OjmaRJKNObJst44HnzUAuQ":{"text":"Great new place in Mid-City, not your traditional Asian restaurant. Good menu that also in","useful":0,"cool":0},"mX6cMpBAb7MbrCV434UQNQ":{"text":"I work about 5 mins away from this restaurant and was really excited to learn a new Vietna","useful":1,"cool":0},"bfAW5zPcl87KDYy-MBgZGQ":{"text":"I come here for ONE thing because its so delicious! The coconut curry with shrimp, which i","useful":4,"cool":1},"CzngYiNl4vcRjPwDcW8EQA":{"text":"Went here for the first time yesterday. Much smaller than I thought it would be. You sit a","useful":2,"cool":1},"9JdNwpPZct4MBoGiaBS-nA":{"text":"I believe in 2nd and even 3rd chances.  Since visiting here my first time and catching the","useful":2,"cool":0},"iBH-as6AmyHS7vsY8OEc6w":{"text":"Excellent service and great food! Very friendly/attentive servers and the food came out pr","useful":0,"cool":0},"PtlAq9Xtr5t1K3YjcCW0Gg":{"text":"Starting of a great thing here the city of New Orleans. The decor is great. Service was on","useful":0,"cool":0},"gby972tTMDl6Zq-h_0MAgw":{"text":"Chicken wings is great! The Peking style duck is sort of like pulled duck usually appear i","useful":1,"cool":1},"NIVVglcr5s-rerS_bmcoAw":{"text":"Namese has been on my list for some time now. In fact, I recall when it was just a small c","useful":3,"cool":1},"Q7MsE76lg0WPejguVeS2Dg":{"text":"I came here awhile back to try this place out, and I am very pleased with this place. When","useful":0,"cool":0},"2r7GINcZfXe-y1FoF2yyvw":{"text":"Having grown up in California I can say this is some amazingly authentic Vietnamese food. ","useful":1,"cool":0},"MB3RfLPb9Exxays3rrLbww":{"text":"My boyfriend and I frequent Vietnamese restaurants all over New Orleans and this one is cu","useful":1,"cool":0},"QPKbaYLAA9yBhfDQ64mwnw":{"text":"This is one of my favorite Vietnamese spots in the city, and definitely my favorite in Mid","useful":0,"cool":0},"QGH2zie6QPEXQLkZ4vohdQ":{"text":"Spent 90$ on a late lunch and left incredibly unsatisfied. The menu was very confusing and","useful":3,"cool":0},"dTQQnNGd6yqFjuNshe_Ovw":{"text":"Delicious food at a reasonable price! I have eaten here in two separate trips to NOLA, and","useful":0,"cool":0},"wBl1b2ghh34h3sSYMPqLzg":{"text":"The BEST beef pho I have ever had. Chicken pho is yummy as well. Super service from Gabrie","useful":0,"cool":0},"YYPSdY0F9F1yAQ8vZBXPhA":{"text":"If you're Vietnamese, you know that you don't go to just one restaurant for everything. Wh","useful":0,"cool":0},"TYhnLoVEM5xSQCHI8X2NPA":{"text":"This place is sooo good. The lemongrass coconut curry, duck bahn mi, calamari, crab rangoo","useful":0,"cool":0},"DU1u6rzsXeF5G5WmHMfWkA":{"text":"Had shrimp spring rolls and shaken pho chicken, and my boyfriend had the shaken combinatio","useful":0,"cool":0},"02YycclEclCY7ltwe4ZUYA":{"text":"This is quite good.\n\nNothing really amazing.\n\nI think the beef was the best protein.  \n\nTh","useful":0,"cool":0},"G94D28E64ko1Hk8ruw2Viw":{"text":"This place was just okay. The portion sizes were disappointing for the price. There was a ","useful":0,"cool":0},"weX3aV06qzycbwR9Lw_ccw":{"text":"Came across this place while staying in NOLA for Mardi Gras. My friend and I had just fini","useful":0,"cool":0},"07W7U2_aByI7N9rODdiB4A":{"text":"The pho is so wonderful. The soup is made by original beef soup, so the taste is really go","useful":0,"cool":0},"Zs4vuG84pJRCQ3A-QHOfnA":{"text":"This is absolutely the most solid neighborhood around the entire city.  I've never had a b","useful":0,"cool":0},"HNH_jrvXNyZcANYz2oguGQ":{"text":"Love this place. It's actually gourmet Vietnamese cuisine, updated and fused with New Orle","useful":0,"cool":0},"7bVSm99VEpnw6Tqs5YUEBQ":{"text":"I ordered the combination pho and got the free dessert with check in. The pho was deliciou","useful":1,"cool":1},"4csG7747wLY5eF_qau1N1g":{"text":"I got the vermicelli with tofu and mushrooms.  To go. Lettuce was shredded into  small pie","useful":0,"cool":0},"NcsFJjZF3KmG9lxfuq9LHw":{"text":"Nice little Vietnamese place right off the I-10 near Tulane.  Stopped on a whim figuring t","useful":1,"cool":1},"qg6BMITUvr9f-FKdiI-UGQ":{"text":"THE TASTIEST vegan pho I have tried. Seriously, so much flavor. \n\nThey lost a star for my ","useful":1,"cool":0},"SruUEyYvpoB7t2uze2oDDg":{"text":"Great service, the manager was so friendly & accommodating & a perfect location. I'm glad ","useful":0,"cool":0},"ckYO8R_HTv52GAXDtusJFQ":{"text":"Food and service was awesome. The best Vietnamese meal I've had in a long time. Brandyn ma","useful":0,"cool":0},"nXwer87LRx_nk9GMNAtL2g":{"text":"There's not enough words to express how delicious the food is here and how jealous I am of","useful":1,"cool":0},"BUEzGvzwNDj64itNjYccRA":{"text":"This is the best Pho that I have ever had. Ordered the shaken version and I enjoyed every ","useful":0,"cool":2},"Xjirr2hBfvN9nLdNBSY_Sw":{"text":"After days of eating nothing but oysters and seafood, we wanted some soup. PHO to be exact","useful":0,"cool":0},"yF6Dmm-zKIYVjNOvQwNjqg":{"text":"I have eaten a lot of Pho in my life but the Pho here is just not on par with other. The b","useful":0,"cool":0},"OUh9dMyvAG9ABRTeFx0t2g":{"text":"Haven't been here in about two years, but I am so glad I've come back to try it again.\n\nTh","useful":4,"cool":1},"Lk2AvzUANurf4mfd8uiThQ":{"text":"Love this place! Pho is great. The service is excellent and the atmosphere is suiting. Rig","useful":1,"cool":0},"371dmwN866eLSWIwV6HRww":{"text":"I am so happy I stumbled upon Namese Vietnamese Restaurant as I was driving to MSY. Their ","useful":2,"cool":2},"J6CmOTHxi7xUuXFV78KpGw":{"text":"Walking from Xavier University every once in a while to get some nice authentic Vietnamese","useful":3,"cool":2},"HvdSn35hnQivRUlwaz1Y9Q":{"text":"So delicious. Serving sizes are remarkably large and the pho was to die for. The broth was","useful":0,"cool":0},"S85W_VhMWOhIqmIpyrOq4g":{"text":"The vegan foh with tofu was delicious and our server was ridiculously nice. Giving it 4 st","useful":1,"cool":0},"hoPclMcJFl2QElULnJAXWw":{"text":"Was on a rush to class and needed to grab a side of peanut sauce for the spring rolls I ma","useful":0,"cool":0},"DvyYE5AqMq7-lgNaEj0Rnw":{"text":"The pho is phab! Our waiter, Brandon, was fast and attentive, which important when you onl","useful":0,"cool":0},"0KZABpGcajfNgmgYZnpxyA":{"text":"Food and service was amazing!!! The Shaken brisket pho was great, as was the shrimp and ba","useful":0,"cool":0},"SdnFRkRxurFHMeg86ZOjYQ":{"text":"Super duper experience! Gabriel served us. He was on top of his game, very light and respe","useful":0,"cool":0},"f4lT5wImOtmd6Ul1cBTZZw":{"text":"I really enjoyed the combination pho, the broth was nice and the meats were incredible.  M","useful":0,"cool":0},"CuvJwa10dX7tLhj12RDnzw":{"text":"I ate here awhile back and still didn't care to come back. If you are looking for authenti","useful":0,"cool":0},"tTIKhNnbbW2vdPVB2ad3dg":{"text":"Excellent food, loved everything. I highly recommended if you like Pho soup and anything c","useful":0,"cool":0},"3YKm27AAHpF0af_TxLywpw":{"text":"Went to Namese for the first time for lunch today. Will definitely go back. My lunch was q","useful":0,"cool":0},"V-b0E-pf649IO_IeFcdgQQ":{"text":"I love that you can order their food on Uber Eats. I just tried the Shaken Pho with Filet ","useful":0,"cool":0},"QmsoDeVGy7XJ3GEwp6p0oA":{"text":"Its alwaysssss a pleasure when I come to Namese, but today was extra pleasant,  as it was ","useful":1,"cool":1},"0zX5IJFGCb4hUvKesdoJTA":{"text":"Holy shit this was the best pho we have EVER had and we have had a LOT of pho. Get the Sha","useful":0,"cool":0},"wFcQO2EYoZoHdjZCE0NkaQ":{"text":"4 in a half.  Would've gave them 5, but on yelp I checked in and it offered a free dessert","useful":4,"cool":0},"zTsNtb59-NCMRm5_pebqrA":{"text":"Steaming hot Pho outdoor on a cold day next to a beautiful fire pit - hard to beat that ki","useful":1,"cool":0},"TnouiutX6yboL2yu1tkRmg":{"text":"The food was delicious. I recommend the pho and ban mih combo. Make sure to get it shaken.","useful":0,"cool":0},"_t695WqNZVO-Z289i1CZwA":{"text":"The Pho broth is great but I was expecting a little fat or bone marrow floating around in ","useful":1,"cool":0},"e-GrSWD6OWmJrd7t9KlGLw":{"text":"Namese... You really stepped up while I was gone!\n\nMy coworkers wanted to go check this pl","useful":3,"cool":2},"khZxBbf7zfM09io2dhnq2Q":{"text":"I'm most positive our waiter was on drugs, he slurred his words and sat with us at our tab","useful":1,"cool":0},"H2bqsdl9ghV7ylQyoQD4kQ":{"text":"We live in the neighborhood and have picked up take out several times and have always real","useful":0,"cool":0},"tY9kJQFbxzbzuPGSSyoGsA":{"text":"Take note; I just came back from Namese right now and this is based on my experience on De","useful":5,"cool":2},"X3vRouXZMEUy_78YQRU_5g":{"text":"With the influx of Vietnamese restaurants across town I've had my share of Vietnamese. Thi","useful":0,"cool":0},"Xwzi85OquVnDSqI3pb03wg":{"text":"This place rules! Shaken beef is off the chain! Wings are ridiculous! Excellent service Ma","useful":0,"cool":0},"Pwo01BRrqqzQrt1iVqMP3g":{"text":"We did a take-out order for this place and were not impressed at all. I got the garlic shr","useful":0,"cool":0},"ZAGOhDBMiywzG8eYtOWGVQ":{"text":"I have been on the quest for the perfect pho in New Orleans for quite some time. Is Namese","useful":1,"cool":1},"bQBqMzhTJueadInv-Mo1Yg":{"text":"Very good fusion Vietnamese. Recommend not getting the shaken pho, just go regular. If you","useful":0,"cool":0},"7h26-EurRmm48A07gn7M4A":{"text":"Just moved to New Orleans and happened upon this place.  Thank you, Yelp!  I had tried a f","useful":0,"cool":0},"ApcA3g2Zett8gmG2EW3fFQ":{"text":"Great Vietnamese food and nice spot located in Mid-City off of Tulane Ave. \n\nHave to say i","useful":4,"cool":2},"5w3ehQB87r4mG-irkMwTdw":{"text":"We had Brandyn as a waiter. He was friendly and efficient! The spring rolls were yummy. Bu","useful":0,"cool":0},"lhui6Zi6_jbvOGAM0Oj71Q":{"text":"The food at Namese - 3. The service + atmosphere - 5.\n\nThe outside and inside decor is BEA","useful":0,"cool":0},"-C1VBF0nzgW57WWReLK-LQ":{"text":"4/5 beware the grass lot next door!\n\ndon't park there, or else you might get stuck in the ","useful":4,"cool":2},"zk26hGqC53mWJBM_r3mOrw":{"text":"I've been twice and haven't been disappointed at all! Excellent vietnamese food. Great out","useful":0,"cool":0},"MMjxm5cVHuDWFSg-h6QhNw":{"text":"Reluctantly walked in 30 minutes before closing one night because I hate to be that person","useful":2,"cool":2},"_PducpsprLBoA5KDCYbGZQ":{"text":"Namese is authentic and delicious! The best pho in town, the best twist on crab Rangoon I'","useful":2,"cool":0},"aqFXiNvAKLbPA5qf7WYsgQ":{"text":"Super good and affordable Vietnamese /style/ food in NOLA a bit off the beaten track. They","useful":1,"cool":0},"kZNorKGDDutVUjc7Rgj1dg":{"text":"Just fabulous!  The lemongrass martini was so tasty!  Can't wait to go back!","useful":1,"cool":0},"aUJscEBL4cUeZvDnyVh6rg":{"text":"Got the combination vermicelli. I am newer to vermicelli but they gave a lot of of food an","useful":2,"cool":3},"cgUyWqw34OJl_Yj0aYvjMA":{"text":"Great service! You got to have the calamari and the amazing thai tea! It's so authentic, t","useful":0,"cool":0},"bpXJF9zcDBa08PdlmNnkYA":{"text":"My favorite Vietnamese restaurant in town!  Amazing service and delicious food! The meatba","useful":0,"cool":0},"Zu_Q3BdEYZicSrwEW5MlcA":{"text":"The food was good. The stench and MILLION FLIES...not soo much. The service was also a bit","useful":0,"cool":0},"CRo4hfXUM_djTT62lHGNkQ":{"text":"Great food, friendly service,  I go at least once a week and it never disappoints. The tof","useful":0,"cool":0},"W-xB0WrtrM5cjaivuqTi3Q":{"text":"Expensive than what normally Vietnamese should cost, with barely any meat. Ordered the Bo ","useful":1,"cool":0},"IWYA-__LMD56IjQQaAK_yw":{"text":"My friend and I went here recently. It was my second visit, but just as good as the first.","useful":1,"cool":1},"zSZrOTEmT6dCRn_NWWgZCA":{"text":"Delicious vegan pho! Love the people who works there! Great place!","useful":0,"cool":0},"ogTx2v7Glj_kgOSHj0deIw":{"text":"This place is amazing. The modern yet warm feeling of the inside is great. Today was my fi","useful":0,"cool":0},"W851ya3O8uwvVk8xrrUGMg":{"text":"Small place, so if you're starving come at a low volume hour. Amazing spring rolls and ver","useful":0,"cool":0},"vSY_r0AqcU92CAR4j12v1w":{"text":"This is our absolute favorite Vietnamese restaurant in New Orleans.  The atmosphere is mod","useful":1,"cool":0},"xvOAOzlqWvH_r4YD8EcauQ":{"text":"Consistently good pho and service! \n\nEvery visit to Namese has been a great experience. My","useful":0,"cool":0},"BrAKmR6QdqU8LGny9mMFvg":{"text":"Ate here for the first time today and will definitely return.  Food was delicious and serv","useful":0,"cool":0},"nULYI5YhVrCQ1oE951B1yg":{"text":"Ordered carry out. They really have carry out down. Bowls , chop sticks, soup spoon. The f","useful":0,"cool":0},"Mv2zDPLYfV_DlqOVM4gULg":{"text":"We had a delightful lunch on the patio with Stephanie as our server. Food was great. The p","useful":0,"cool":0},"zGBFu6iwVe1BXeUewaGhXQ":{"text":"Very odd location, but the food and attentive staff make up for it. The food is made with ","useful":0,"cool":0},"llMXncl_GCvn6sjkrA-F6A":{"text":"We went for the first time tonight after moving to our new home nearby. The food was delic","useful":0,"cool":0},"gj_fxYlabIXHW-LlfMDcSA":{"text":"Very good food and a nice patio so we could bring our pup! The lamb lollipops were very go","useful":0,"cool":0},"JFwsSYd36u_Dktz7sm2CSw":{"text":"Been here 3 or 4 times. The food and service are consistently good. The calamari appetizer","useful":0,"cool":0},"y2Jx138C6oJ-_H6CQKZ_lA":{"text":"I cannot say enough good things about Namese.  I have literally recommended this place to ","useful":0,"cool":0},"F3mxsqvphgs2_eYtkXKUaQ":{"text":"Meal was excellent. Showed up at 4:30, not the biggest place but seated immediately and tr","useful":2,"cool":0},"ix7h8Q7aeXIPeiYPNO3KVw":{"text":"Yes to Namese!!! Try the Chicken Spring Rolls, Shrimp Spring Rolls, and the Ducky Steamed ","useful":3,"cool":0},"_BpbIYkFrpj9m2U3GB1xLA":{"text":"Been here multiple times already and will continue on coming back. They have a great food ","useful":0,"cool":0},"kED1rFeHWtR3inzDwQ6JPg":{"text":"I love Vietnamese food especially Pho and Ba Minhs. And this restaurant combines my two fa","useful":1,"cool":0},"ST-uk6E4N48rmGBvAvx_bA":{"text":"Delicious!  My friend is an expert an said this is the best pho she's ever had.  Excellent","useful":1,"cool":0},"N6wKN1ys5jjqvjtV5xSLlg":{"text":"LOVE this Place...  and I feel like a Vietnamese food expert for obvious reasons. ;) \n\nThe","useful":6,"cool":2},"fxK34X_mVBgP5cS7_fECAw":{"text":"It may surprise many, but New Orleans supposedly has outstanding Vietnamese food. I hear N","useful":0,"cool":0},"EYQYLQ4c8khJELbUStXeBA":{"text":"Updated to say we have been again, and this place is consistently fantastic. Second time w","useful":0,"cool":0},"UtFg5s7slZCE1opgzXYu7Q":{"text":"Coconut lemongrass tofu was sooooooo good. I got it with tofu (to go order). It was on poi","useful":1,"cool":0},"gzrNcyJE8NeSys5M_wr15w":{"text":"Just gotta say, our server Tommy killed it. It was his 3rd day at the job and it seemed li","useful":0,"cool":0},"7nt7JK4Lm7PWHZm_5j7tJA":{"text":"Very tasty. Very reasonable prices. Nice atmosphere, yet still friendly for families with ","useful":0,"cool":0},"w5GXRGyVHQH36SiF7KNGcg":{"text":"The serving sizes were pretty small for the price, but the soup flavor was good. I'd recom","useful":0,"cool":0},"EEkC8JycJD7Pc2w3F5DTtQ":{"text":"The picture tells it all.  We are a mixed group with vegetarians and carnivores.  The food","useful":0,"cool":0},"Q6v2QLXRHswRjEIxzFmUwg":{"text":"The appetizer was very good. I had the Vietnamese Tacos with Duck. They were great. I am l","useful":0,"cool":0},"2TgCK-fGZgflIO3Yxz26wQ":{"text":"Service and food was great! Loved the tofu and dumpling appetizers. We had the curry entre","useful":0,"cool":0},"bGXnDRpBT1PEcYi8cjTqqw":{"text":"Excellent food. Nothing hifi in terms of ambiance but serves the purpose really well. \nWe ","useful":1,"cool":1},"IFFBQ5xu2YbzBI5wnaP4Tg":{"text":"I've been there several times and never had a problem. I went in 2 days ago an hour before","useful":2,"cool":0},"oS8yDcMvMCXAdoIU6c8AMg":{"text":"Brandyn was our server today, he was very knowledgeable of the menu with a great recommend","useful":0,"cool":0},"esd6pMTYORLhcgYl2Q4JIQ":{"text":"This is by far the worst place I've gone to dine in to get some pho. First of all, it took","useful":1,"cool":0},"Jq7PMsyVWk-u0m58SXhSOQ":{"text":"We ate here tonight with my two toddlers and found the place to be a real treat!  Everythi","useful":0,"cool":0},"-8gax7y3SgAE5fHvzXL4Sw":{"text":"The service was really good. Everyone is really nice. The food was really appealing and de","useful":0,"cool":0},"rmG85li7h6z6g8cpSLA8Gw":{"text":"The best Vietnamese food I've ever had. The Bahn Mi and Pho combo was a very good portion ","useful":0,"cool":0},"WIlam8vxyLoqbbLgd6aU5g":{"text":"Namese was a really good experience. I arrived here at about 7:30, on a weekday, to meet a","useful":6,"cool":4},"aNDwwczeEKYX6pKF79TLxw":{"text":"I am thourally impressed. The location, atmosphere,  prices and quality of food is sterlin","useful":0,"cool":0},"79tuuLF3CqdtLGHbTVUT2Q":{"text":"Our favorite Vietnamese restaurant in New Orleans.  The Pho and Bahn  Mi combo is the best","useful":0,"cool":0},"eENAv4O97TA-xT5SjI8LCA":{"text":"This is a nice little place if you want some delicious pho. My husband and I ate here whil","useful":0,"cool":2},"i_yQ6F_Ce2LiAHAzyPmTnA":{"text":"I love Vietnamese food. So coming here I am naturally going to be a tough critic. I was ab","useful":0,"cool":0},"IefSjNCKCQAh9HjHVcEZ0g":{"text":"This place was delicious. The tacos were yummy. The bun was amazing. The service was promp","useful":0,"cool":0},"Q1TeQJa2sXk9U_Bjm5ArXA":{"text":"Not bad Namese! Finally a Vietnamese place in the mid city area that's worth going to. I l","useful":2,"cool":0},"s9sBm5plDLab_Ce4pJblEg":{"text":"Namese has turned into my favorite Pho place in NOLA! Their Shaken Pho is amazing - always","useful":0,"cool":0},"R6scYBpLXi8f7tyhA0eV9Q":{"text":"I live literally two blocks away. They food if you like Vietnamese cuisine this is the spo","useful":0,"cool":0},"o_vnmVQYbcORCD-Kcv4snQ":{"text":"Heard a lot of about this place from a good friend, and I knew I had to try it.  The ambia","useful":3,"cool":2},"V9uWJE-J4fXRzT2DG8sqRA":{"text":"Exactly what the Mid-City area needed!  Even better that it's a few blocks from my work pl","useful":12,"cool":10},"Z6nJiP3nFNGQrSbIRabeXg":{"text":"This is the best Pho I've ever had.  The broth was very flavorful and all ingredients very","useful":1,"cool":0},"13n4wNeRgUOG36Vp1fndYQ":{"text":"It's ok. I'm not sure how authentic the food is, it tasted pretty americanized to me and r","useful":0,"cool":0},"aOh-QQdc01CveSKrFANnYw":{"text":"Our favorite Vietnamese in the city. Charming, modern interior and comfy outdoor seating. ","useful":0,"cool":0},"xMsACaUxDSvPEwUwymWxug":{"text":"This place does good food at a good price. We are in town visiting and found this place. W","useful":1,"cool":0},"_sWGF4YRz2zpzwksErASpg":{"text":"Love this place! Food is consistently delicious, and service is good. The shaken pho is so","useful":1,"cool":1},"WI-VTS2wIWLp0BLr0HoqUA":{"text":"The food is delicious and the service is excellent. well worth the drive from the westbank","useful":0,"cool":0},"ghY6ktNdodP-nxm0SDDz5w":{"text":"The egg rolls (spring rolls) and vietnamese duck taco appetizersare sooo good.  Had the Ba","useful":0,"cool":0},"mZ_E65rCujOzlb2SnzNJFQ":{"text":"First experience at Namese - we had the wings they were awesome, sweet and tangy, all of o","useful":0,"cool":0},"tGKnYzkvLf_B-jVs8EZ5aA":{"text":"Just got home from a lunch date with Wife at \"Namese\".\n\nEverything lived up to the sterlin","useful":2,"cool":1},"Xe9LYet4q25d1xam8Xlnjw":{"text":"Namese is a newer restaurant along the Tulane Avenue Corridor at the intersection of Carro","useful":2,"cool":0},"Io0g8tw5PScP-_CzfWViDQ":{"text":"The restaurant is nice, and nice quality food and staff, but my garlic shrimp entree ($13)","useful":0,"cool":0},"Oqbgvwo5FPL1OAKg1655ug":{"text":"Pretty good takeout! Pleasantly surprised! I can't say anything about the place itself, si","useful":1,"cool":0},"2d7kTG7G_9wL_u3DAuSOcQ":{"text":"My go-to for Vietnamese food! The pho, vermicelli bowls, lamb lollipops, and coconut curry","useful":0,"cool":0},"Y7uchZwATfjvYGg1Y3DD2A":{"text":"Namese did NOT disappoint! I was here twice in one week. Great service, swift, friendly. D","useful":10,"cool":5},"lwySzzSz46OGZWwLbYg2cw":{"text":"Finally made it here today around 2 p.m. with a friend who loves pho as much as I do.  We ","useful":0,"cool":0},"VZqXVApdgy7LMiTNnH8qYg":{"text":"Friendly staff, excellent food. Cozy atmosphere. Excellent outdoor patio with ample seatin","useful":0,"cool":0},"BQW5rR2tUhJpu9BVLDBPMQ":{"text":"Quick service, good pho. Nice ambiance. The bacos were good but not as good as other Vietn","useful":0,"cool":0},"lUMnPgAv_3eBznoloM-v8g":{"text":"Excellent food.  I had the Surf and Turf, which was delicious.  Flavors were well develope","useful":0,"cool":0},"-cTr3jVuzzPP0sT6Zlu_qw":{"text":"This place has some of the best pho in town. The dish I had tonight (shaken beef) was pret","useful":0,"cool":0},"yo4KhDZymcXJJo6kINr90w":{"text":"Upon walking in, we were greeted and seated in a timely manner. The server came promptly t","useful":1,"cool":0},"Q_zEAoT1WlposLkYpOXhzw":{"text":"Delicious food and great service!!! Had the shaken pho, bacon/shrimp spring rolls, Vietnam","useful":1,"cool":0},"O4oQ1OnDVFMJ-eatFpwq6g":{"text":"Gave it a try and find it ok. The place is decorated beautifully and the porch is very com","useful":3,"cool":1},"PvuYuDkFNELD30zWS41_sw":{"text":"The crab Rangoons!!!! Drooling over them.  I recently moved here and was worried I wouldn'","useful":0,"cool":0},"9cLQEVpjW6Ta9UPzFwX9Ww":{"text":"Usually namese is on point and don't get me wrong the food is good. We had a terrible expe","useful":29,"cool":10},"zn-AxEUPk6xe_XVZQCyxHQ":{"text":"Super yummy everything. Some favorites are shaken pho, bahn mi, and Vietnamese tacos. Ooh ","useful":0,"cool":0},"Pumxkwve-rh59UVvacNc1Q":{"text":"This is my go to spot for pho in the city. We come here a few times a month, and we have b","useful":2,"cool":1},"AepWIDss9RadYpeuCyqGIQ":{"text":"I'm here for maybe the third or fourth time this month. What a great spot. Awesome food, a","useful":0,"cool":0},"iCNOu1r9DCubXn86mU2eZg":{"text":"Took 1 hour for our orders to come out, two of those orders were pho. The pho was tasty; h","useful":1,"cool":0},"1eu-trR8WcL4XXZf_9LcuQ":{"text":"Love this place. It's like ASIAN FUSION or something like that. Iea what can't you get her","useful":16,"cool":11},"vnUVwSWjHtXHXmgE3seqtA":{"text":"Oh my gosh; this place has the best Pho in New Orleans. It's a little more pricey than I n","useful":0,"cool":0},"SDpe5se2o1CUFsbo2rdV9Q":{"text":"One of my favorite Vietnamese food places in the city!  Their location is cozy and located","useful":2,"cool":2},"SoAZH3pKBjswYDwyzHSU1g":{"text":"Great food; papaya salad the best ever, as were the mussels.  Seafood phô excellent, made ","useful":2,"cool":0},"4ARKI1z7TEhIYJcKYeKoTA":{"text":"Been to Namese three times now and can say with confidence it's a solid spot. First time w","useful":0,"cool":0},"IsyXncg0oRAQAWZ9n8CSsQ":{"text":"Best Pho I've ever had! Getting it shaken was such a good idea. It really brought out the ","useful":1,"cool":1},"0lHM_L3zXQjEbd9OEUeT_w":{"text":"Love the ambiance here and the food but their service is not good. I came here with a frie","useful":3,"cool":0},"Cg_CTfsEq4LkAmC4o7hzqQ":{"text":"Love this place!!\nService is quick, pleasant and prices are reasonable.\nThe Sauteed Calama","useful":1,"cool":0},"NZQ5ZDnxf0Ceo90CCHDLJg":{"text":"soo good! i got the pho with rare beef. i was surprised by the fact the meat came separate","useful":0,"cool":0},"5e1UyS9FZUUovIZLOmiqWQ":{"text":"We had a fabulous lunch here.  They were very busy and even short handed on staff, but you","useful":3,"cool":1},"PtgXENuAZgUkvTQGAbRYEQ":{"text":"Was stumbling around the city after a long day at a conference and was craving Vietnamese ","useful":1,"cool":1},"2gOz658oGks8u1iPI4DBzA":{"text":"Been to Namese three times now and can say with confidence it's a solid spot. First time w","useful":0,"cool":0},"dGXcEr3ov_Yxnif5PnsilA":{"text":"Shaken pho is the best in Louisiana possibly the world. It will ruin you to all other pho.","useful":0,"cool":0},"TUQznKKjK9O4XGOSGv5O8w":{"text":"I've only ordered from this place once but I really don't think I'll be ordering again.  I","useful":1,"cool":0},"On3LbEmAufD13dLf0lrA6g":{"text":"Papaya salad and bubble tea.  That is all i have yo say! Nice ambiance and a good looking ","useful":1,"cool":0},"ZyxccmvkgkglpW8_c09uuw":{"text":"This place was awesome and I'm so glad we stumbled across it. The menu had a variety of op","useful":0,"cool":0},"X_NXwaK-8Anc2_S4J7vgOg":{"text":"I have been wanting to try this place but never got around to it. I said to myself I need ","useful":2,"cool":0},"QA06QHRd6SISVxtbRMkWfA":{"text":"I'm so sad to find out this restaurant is now closed.  It looks like they shut their doors","useful":0,"cool":0},"rr0NURE7AXqxHeTBoR2KIQ":{"text":"The food here isn't bad, I do enjoy it for the most part. Sometimes I'm disappointed, but ","useful":0,"cool":0},"QNo4_E9Ke499ys7hoWlWgw":{"text":"We had the Crab Rangoon,  Fried Dumplings and combination Pho. Everything was very fresh. ","useful":0,"cool":0},"y7WfbtSr_HviCjg--HprJg":{"text":"Having a hard time understanding how 1 cup of rice (.10?) and 1 cup of curry costs $12+tax","useful":1,"cool":1},"x74gIGctcQRlWXp_NAWXaQ":{"text":"I ordered the roasted herb salmon and I think the fish tasted quite old.. or it just wasn'","useful":1,"cool":0},"Jouoh61liSkxN9uojOr7iQ":{"text":"This is a great place for a nice lunch alone or with friends. I love their outdoor covered","useful":2,"cool":1},"WWYoF4MtCjB2GpoZH175Gg":{"text":"My opinion will be: A) short and, B) not based on personal experience of the food. LOL. \n\n","useful":0,"cool":0},"rFyLGiKPb2ELWjJbtO38kg":{"text":"This might become a problem... excellent Vietnamese food around the corner from our house?","useful":6,"cool":2},"ndHGs3mAqHbtBIETWN626g":{"text":"I usually come here all the time its one of my favorite places to get pho , came in today ","useful":0,"cool":0},"lM71D6b8hGbyNjr-0X03zw":{"text":"Fantastic! Our server Duy was like a ray of sunshine and the food was awesome! I highly re","useful":0,"cool":1},"FwCBOQvvzBmRV-ca5ZDmLA":{"text":"This place is not tgood. Everything is lacking flavor. Especially the Pho, no taste. Its w","useful":4,"cool":1},"BN84cRitp-iQ0iy5jAHh3w":{"text":"I love Namese. Favorites include: papaya salad, shrimp bahn mi, five spice tofu.\nFor being","useful":2,"cool":0},"Z8ersX3fq7_xHlFZuzCSNA":{"text":"Their versions of spring rolls and tacos were excellent. The broth for the Shaken Pho soup","useful":0,"cool":0},"yFr7KiuaIlD6uIG5ThMB5Q":{"text":"Love this place. You literally can't go wrong with anything you order here. The shaken bee","useful":0,"cool":0},"bc5X3iHqHF7Dej-nW8ddIA":{"text":"First thing: the tofu and mushrooms vermicelli bowl is amaze balls. It came with cucumbers","useful":4,"cool":2},"EIJwbwx-fGcu0Xf_9zCObA":{"text":"It's official: I have found my favorite pho place in the city.\n\nI've searched high and low","useful":1,"cool":0},"A8XZ7CTcGlZzzRMUDdUQKg":{"text":"I honestly don't think I can I can step foot In here again. Ordered via door dash pickup a","useful":1,"cool":0},"_qesNshjaJsAIetAznyt-A":{"text":"On A Saturday night about 7:30, were able to get a table for 4 right away. This is a very ","useful":5,"cool":2},"v4ZNhDLR2hHHSlow46eDYQ":{"text":"I did not feel good so I decided why not grab some good ol pho! Never tried the place, vis","useful":2,"cool":0},"gNIMA6ZjiQ4IHPu4eRucOg":{"text":"Always great fresh and tasty dishes.. Eat here often and take out too. Pha dishes deliciou","useful":0,"cool":1},"mMzDPjpZznqbsc2Lumnczw":{"text":"Last week, I went to Namese for the first time. I had such a great meal that I came back t","useful":0,"cool":0},"Dw2wzEbUKbugu3fWHoiqtw":{"text":"Place closed 35 minutes early. Recommend you go to other places first as they have no idea","useful":3,"cool":1},"9gH5XBap3e6yWdrapK6deg":{"text":"This was my first time going to Namese. I had just left Mass and the traffic wasn't so bad","useful":2,"cool":0},"9qL5Tiy8DQwFLYR8S4qk2w":{"text":"Soooo good!!! We are going to come back! Everyone loved their meal, and we left with a ful","useful":1,"cool":0},"SGDkMd7emnljcJf0ofA0Rw":{"text":"Great little vietnamese restaurant. Food is fantastic and service is superb. We had the sh","useful":0,"cool":0},"G8B2oaxnAejCgv2ocmSI5A":{"text":"We are visiting from New York City, excellent Vietnamese food including: Banh Mi, Vermicel","useful":1,"cool":0},"4tj1SWP74uyfzOMuHk8taw":{"text":"Stopped in after looking for food in the area. I decided on the Beef brisket Ph and it did","useful":0,"cool":0},"O-UWUTY4mCEBFnKGAu0h0A":{"text":"Our favorite Vietnamese restaurant on our trip so far. Clean inside great service. We orde","useful":1,"cool":2},"foms7suXPgPIWLL-nhJa8A":{"text":"Great Pho, great service and the new enclosed front porch makes you forget you're sitting ","useful":3,"cool":0},"hMviDHcRF8fMh97Q4YjiVw":{"text":"Used to be my favorite place to eat but not today!!!!!!!!!\nI should have known this would ","useful":1,"cool":0},"bwMC4lI68TM7LtXWEYrsTw":{"text":"Great Mid-City location and hip decor with seating outside, which was fun. I started out w","useful":2,"cool":0},"hKxZnOk3NYvdY_BVbHxlNQ":{"text":"A very decent place to get Vietnamese food in Mid-City, Namese has a pleasant vibe & good ","useful":1,"cool":1},"MTHzrMFCA2DClmGSD3OUsQ":{"text":"I came in with my girl friend today as usual we spend a lot of money here and we're improp","useful":0,"cool":0},"kh4JUvk2xgC_5fPZeHuuag":{"text":"WEIRD, YA GOTTA ASK FOR BUN TOPPINGS. Despite the menu description that noodle bowls have ","useful":6,"cool":5},"BzNvYexHS7a6aZ8RbGCwoQ":{"text":"Loved this place!! We came for dinner and had an incredible experience. The waiters were s","useful":0,"cool":0},"drde0hWtTxAmfeK8vx7X8g":{"text":"Brought a new friend here to try, we had the following:\n\n- Mussels - mussels sautéed in a ","useful":1,"cool":0},"mw-EbxLPavZpsx-IjBixaA":{"text":"Legit Vietnamese food outside of the main Vietnamese community in New Orleans! I split an ","useful":1,"cool":1},"WwFu4Eyz0s9u3vzfZasLzg":{"text":"Our go-to neighborhood favorite;  wait staff are all great.  Love to sit out on the deck. ","useful":0,"cool":0},"QtzHpvhFNe4Melmy4lFbKA":{"text":"The food was good. My problem is cleanliness. Which is high on my list and the amount of d","useful":2,"cool":1},"68zfSAcCOzIDcI9ZoOnfRg":{"text":"Namese is a great place to get authentic Vietnamese cuisine!! This is my 1st time and I li","useful":0,"cool":0},"58BP78Fny0fIgg-rvjGk5g":{"text":"Best pho ever!!!! Had the Shake It and I must say.. very tasty and full of flavor. I'm ver","useful":2,"cool":0},"aPk01f5OE0IwdDKwkJ9ZCQ":{"text":"I am loving the new flood of Vietnamese restaurants to the east bank of New Orleans. I esp","useful":8,"cool":5},"tiiAQiMq2xntzZqUOnDiEA":{"text":"Sweet Jesus, folks. \n\nOur table of five (including someone we were interviewing for a job)","useful":6,"cool":3},"QzPJeyxOqoGkgEvYQgMIog":{"text":"Crappy experience. The food was alright. \n\nThe place was empty.  A mom, grandmother, and t","useful":0,"cool":0},"AhKRTrwX8i_BSq2f2mRGUQ":{"text":"~the seafood pho! \nAddition to my last review I really wanted to try it and was definitely","useful":4,"cool":0},"BZvUu2hJD-eUK5s9Vz4CFg":{"text":"I frequently visit this place for their tofu spring rolls. I love the fresh crisp & crunch","useful":0,"cool":0},"GIoNZnP3MGX0VP_E6YNOTQ":{"text":"Always enjoy the food. Dining room is small but they move fairly fast. They never disappoi","useful":1,"cool":1},"0xe9RSyGx03SXwGEH44r_Q":{"text":"Sooo delicious! The veggies were so fresh and crunchy and everything tasted like it was ma","useful":2,"cool":0},"efbY1AjQpW5e9zqs194UBA":{"text":"Namese, naw mean? Namese sounds like some sort of slang so naturally I gotta start the rev","useful":7,"cool":2},"nu-V3RSm99UiSqPT8iXNuw":{"text":"Pretty good Vietnamese spot if you are in the area but certainly not one of the best in th","useful":1,"cool":0},"h557Zao3IDCfuEpM5U0VXg":{"text":"This is a new great Vietnamese place uptown, a modernized twist to traditional foods. \nFor","useful":1,"cool":1},"BbVwhqm5KckY1WjS7p_2nw":{"text":"I feel like I'm a harsh critic when it comes to Vietnamese food since I am Vietnamese, but","useful":1,"cool":1},"9PYFXiXkna8efbJUYtRa2Q":{"text":"The food was delicious. I had a vermicelli bowl and my friend had a papaya salad which loo","useful":1,"cool":1},"8fgzk0vOjF3DMuvXBiOz1Q":{"text":"If you check in here - you get free desserts. I did..unfortunately they ran out ..so no fr","useful":2,"cool":1},"_nUc2ao3pxrY5svWuyu1Jw":{"text":"Arrived in for lunch around 4:30 & was seated outside in the patio. The host looked very d","useful":2,"cool":2},"0V9hTgYdNTwgewFo892G1Q":{"text":"I was about to Uber home after a meeting and decided to walk a couple blocks to Namese bec","useful":3,"cool":2},"LE0l5bh7aR6zhr7sj_B2Ng":{"text":"Ummmm, this place is a must-stop for anyone in the New Orleans area. First place I ever ha","useful":0,"cool":0},"eycs-RNnykL-l1d5duC01A":{"text":"We really like this place and have consistently had a great experience.  Tonight we starte","useful":1,"cool":1},"LvffH5TnR_VQ4PkCaa6KGA":{"text":"Namese, on the corner of Tulane and Carrollton opposite the old MId-City lanes and Pelican","useful":3,"cool":0},"2an2TizIEByM0y_-msvVHQ":{"text":"I was torn on what to review this place bc I've been a few times and I quite enjoy the dec","useful":9,"cool":9},"VbPrzD7-tpY7AlRgl1hC6Q":{"text":"Delicious food, great service, even better ambiance. Namese is small and parking can be a ","useful":4,"cool":8}}