{"mDWh40wVvYUYnzZCMLuCZw":{"text":"We noticed the location while walking by.  We loved the mix of blues, jazz and traditional","useful":0,"cool":0},"S1oRRPqHt5xHYtdcFk1XjQ":{"text":"Best cocktails. The bartender knows his stuff. Prices are very reasonable for the quality.","useful":0,"cool":0},"uW9WZ_R0THdhayMxhooL1Q":{"text":"Liked the music. Bartender left a lot to be desired. Hated their signature drink and she d","useful":0,"cool":0},"cEy5CwC6eU9K80ExX-tlMA":{"text":"Nice place to hear quality music live. It's small but well kept, the drinks could use a li","useful":0,"cool":0},"vkX2wW4V6mUN4J9NmtDqgA":{"text":"Spent 2 nights of my 4 in NOLA here, they have different bands every night, the live music","useful":0,"cool":0},"KB3ZlbJpDAqhwIP9SZhMsQ":{"text":"No cover charge, but recommend that there is a one drink per person per set minimum. Rathe","useful":1,"cool":0},"0sthQ9vud8Jm0FHxfdzGwA":{"text":"HH two for one all day with the exception of performances.  Opened daily from 6p-2a.  No c","useful":0,"cool":1},"YsNR9KtNnL27Gih4yMZCAw":{"text":"My wife and I visited NOLA for the labor day weekend. My mission was to hear some good, au","useful":0,"cool":1},"Nphhqw1UwP39bm73h83UHw":{"text":"Why anyone would hang out at the hotel bar of the Sheraton when this place is across the s","useful":4,"cool":0},"9Tr6zLebAKlC1nHm2oZRMA":{"text":"Music was really good but the drinks are expensive. Why would a 12oz bottle of beer be $7?","useful":0,"cool":0},"-odlLiO6W2Nh3qVw5Oupgg":{"text":"Very small dark jazz bar. The music and service were great! However, if you don't handle s","useful":2,"cool":0},"xTisiUwQ2B0cA3OGuCk7kA":{"text":"What a wonderful place. A perfect gem in the French district. Live performance. No cover. ","useful":0,"cool":0},"ljV54MfaQAIJKecre9tH_Q":{"text":"This is a great place to listen to jazz. Awesome bartender Phillip makes a mean hurricane.","useful":1,"cool":0},"QjYSJm4MbmBrBkV41jM9_g":{"text":"Great Jazz from Tony and the boys.  Oops and her burlesque absinthe presentation is second","useful":0,"cool":0},"puCJ5oP7YBdwX1A36w754Q":{"text":"My boyfriend and I did the absinthe fairy experience together and lemme tell ya...THAT was","useful":1,"cool":1},"LkmzggKMsBb14iEoP9zeag":{"text":"Very interesting place. Music is fun, prices are great, I would totally recommend it. This","useful":0,"cool":0},"0HCvkdc94kQHfJbZMpocdw":{"text":"We enjoyed Sazerac and jazz.  The Sazerac was cheap and ok the jazz was ok. A good way to ","useful":1,"cool":1},"YOnx18M5iDXuIEwwMHZbWw":{"text":"This place was so fun! Sasha is such a sweetheart and the doorman was very polite. Good ja","useful":0,"cool":0},"xWaVkeh5uUDOMhcSlXI5PA":{"text":"A small bar with jazz and the \"green fairy\" show. We happened to walk by it at 10pm on a S","useful":0,"cool":0},"1gp7SSq-40fL8Snvxibiwg":{"text":"We were here on a Wednesday and got to enjoy Green Fairy Bella for our private burlesque a","useful":2,"cool":1},"eRNz20RjZt2tV94o-cu4Gw":{"text":"This jazz bar deserves a five star review. We really loved the band and its singer Kimberl","useful":0,"cool":0},"7QG1vA2e1L0t0j57g3VybQ":{"text":"The bartender they had was super talented he mixed drinks like his life depended on it. Su","useful":0,"cool":0},"Qq-QZVW1JQpMpV6l4ccRRg":{"text":"During the last day of the Music Fest, We stopped in to hear some good jazz. Its a very na","useful":1,"cool":0},"__dGixt6CJt2l3b2NeGQ_w":{"text":"Real Small and Real Nice! The Key Sound Band was Excellent! I like the intimate Vibe of th","useful":1,"cool":0},"0aRZHC8SmegmVzTsEzofWw":{"text":"Interesting layout for live music. And burlesque? When we were there not much happening in","useful":18,"cool":10},"2dNDDyuAmwm3s6RQ9xRPfg":{"text":"I was only in New Orleans for one night and I'm glad I stopped in to the Mahogany jazz Hal","useful":0,"cool":0},"Tj55lgC9AICvFS-Sv5lPTg":{"text":"We were walking by and just decided to stop in. Funky music, superb drinks, and a breath-t","useful":0,"cool":1},"mJnJBCw3zsBD5lddmQaYmA":{"text":"Go here to chill and listen to some cool cover bands. The crowds are sparse but this leave","useful":3,"cool":0},"6YOLE5qD0xajVq5QV7o1YA":{"text":"Very small venue loaded with Storyville history. It's near the Marriott and Hilton so you ","useful":0,"cool":0},"T5T19YUn-ATj-kbuzkHl6Q":{"text":"Fantastic music by Gary Brown Sax player\nPerfect New Orleans spot to Support Live Music","useful":1,"cool":0},"heZ6qLkECvBYXq8YFP7wTw":{"text":"This place used to be a shitty strip club and honestly not much has changed. The bar is fi","useful":1,"cool":0},"iWwphSIfVDTVD00KyUHirg":{"text":"Cute jazz spot! We were staying at the Marriott next door and wanted an authentic New Orle","useful":0,"cool":0},"MV3MrWa7sogejqsd5G1Waw":{"text":"- Delicious, reasonably priced drinks \n- Very friendly bartender\n- Cozy atmosphere\n- Uniqu","useful":2,"cool":1},"V4jdBUNWzvPvfVhPJg7Ygw":{"text":"Pricey drinks but the music is great. A simple place with great tunes, cold beer, and a co","useful":0,"cool":0},"ofnCCGvkuNTQoIpuyuY0Zg":{"text":"This was my first burlesque show, so I had no idea what to expect, but I was blown away. C","useful":1,"cool":0},"cs659vQDncNuPfzQIXaneg":{"text":"This place is great. Little hole in the wall with great Jazz and that classic New Orleans ","useful":0,"cool":0},"A5-65kzYkurDr44Sw9tSZw":{"text":"I enjoyed this jazz bar very much! The band was great and the absinthe theme was something","useful":2,"cool":0},"ZkBC6hPxtFW38tsJrNW-Ug":{"text":"We ended our NOLA tour at Mahogany Jazz Hall, I needed to have my first Sazerac (pictured)","useful":0,"cool":0},"KbyK_RqqNzpZ-wmtI3TBjw":{"text":"Tourist trap. Couldn't exist if it wasn't next to the Marriott. Overpriced drinks and limi","useful":0,"cool":0},"8bpRlmibPzSQGFHyRwuxQA":{"text":"This is a great little place to listen to live jazz and sip on absinthe or a specialty coc","useful":0,"cool":0},"mOxA8sJo0tkbTyTirxzm7Q":{"text":"This is an unassuming hideaway that gives you the feeling that you are in the old New Orle","useful":0,"cool":0},"BSk6_KXQ5VxUQnmskATkJQ":{"text":"The hospitality here REGARDLESS of the number of people in the business is OUTSTANDING!! T","useful":0,"cool":0},"jTL1Br3eamZGDxR2h23Mdw":{"text":"A fun little spot off Canal with live music, excellent cocktails and great service. Warm, ","useful":1,"cool":1},"lNNnHx_r-Z9u8V_-pT6R8g":{"text":"My friends and I had the pleasure of discovering this wonderful bar and the green fairy th","useful":0,"cool":0},"QQQ-bhvHZLkOcjipAdjIaQ":{"text":"Super fun environment. Affordable drinks that actually taste good!! Bartenders are very at","useful":0,"cool":0},"76vZI3lJkHTz5Ujk3T5H1w":{"text":"This place was a lot of fun. The layout is a bit intimidating because the front row of the","useful":0,"cool":0},"uFQrJsjfCaorsHKdFlCR7A":{"text":"Drink prices are on par with everything else plus they sell absinthe. Angie was an incredi","useful":0,"cool":0},"VMrrYH-wYywfLrzSojv7rw":{"text":"I did not make it In because the door man the worst person ever.   Made rude comments as w","useful":0,"cool":0},"VG5vbpmiuW7fVQUGvtvDWw":{"text":"Great music, drinks, and atmosphere. Give the burlesque show a miss though and save yourse","useful":0,"cool":0},"9lJuUx63THuLVApDA-cfCw":{"text":"Honestly, everything was awesome when I was there. The only reason for the two stars was t","useful":1,"cool":0},"PhRnqc4xR-65vPpGOBpkhA":{"text":"Love love love this place! First time having absinthe and the bartenders were so friendly ","useful":0,"cool":0},"-2wKjxmIM-ATnvNaRdy85A":{"text":"Incredible!  My first time with absinthe and the green fairy was so beautiful.  She's trul","useful":0,"cool":0},"ky4MXvh-gKJz75qGu1smcw":{"text":"I wish I could review the bar, but was dissuaded from ever entering when the doorman verba","useful":3,"cool":0},"ImKFleakbcQwhwy817b4gg":{"text":"This is such a great little spot! While it isn't the fanciest place in the world, it's a r","useful":6,"cool":4},"Uua9fkIv2CNMBIHZdJX05A":{"text":"We went there with my wife to see a live performance and have a drink. The place is super ","useful":0,"cool":0},"RdGgHCyCHRAD3gmnDGlbBw":{"text":"This was a cool little joint across the street from my hotel. Never really been to a real ","useful":5,"cool":8},"tJfPEAFgRR-j05xS30iPDQ":{"text":"My first night on my last trip to New Orleans, we popped into this little bar just off of ","useful":1,"cool":1},"-npHVv_HLvFHJHpgb_39fQ":{"text":"Wow... we just happened to walk by this place after dinner... heard  clarinet at a distanc","useful":0,"cool":0},"wgXVQQu0N7lXdFRWzNAs_w":{"text":"Dangerous place, very bad security. I was pick pocketed last night and when the police sho","useful":0,"cool":0},"7T4k1v07PsnqrWyWALYtJA":{"text":"How can you not love a place like Mahogany Jazz Hall?!?!\nOld schoOl New Orleans jazz club ","useful":8,"cool":10},"Q-WI62uLLgNgEd_R5ukDuA":{"text":"Dangerous place, very bad security. I was pick pocketed last night and when the police sho","useful":0,"cool":0},"h84BvSHHjwSGQ7-VQDzqCw":{"text":"The concierge recommended this gem of a place and we were able to get seats at the bar.  T","useful":0,"cool":0},"j29mp4xRRdjBKwlEt_PfOw":{"text":"We visited Mahogany Jazz Hall on a Friday night and had an awesome time. It is an intimate","useful":1,"cool":0},"cD8ScUgBdEUZwPHEVwkaqg":{"text":"Great facility, comfortable and fun venue. Great music and drinks!","useful":0,"cool":0},"g01IRXrndw8PoGq5-Nq5SQ":{"text":"Best find our whole trip--we went back a second night and enjoyed great jazz and Bees Knee","useful":0,"cool":0},"2kJEYbItHtqFMevPvwIXoA":{"text":"Right off of Canal, yet a few streets over from the crazy of Bourbon this place is perfect","useful":1,"cool":1},"81TqD2uZPeCsDLRn0ehhfw":{"text":"Great find! The first two jazz spots we planned on visiting were either closed or not waki","useful":0,"cool":0},"RTX_4OjS4b89jvsZRiqrnw":{"text":"We went here on a night after Thanksgiving and had a wonderful time. The live music was am","useful":0,"cool":0},"Nwshm4S6UkflZThWLZoAsg":{"text":"Aurora was our fairy guide during the burlesque show. Her face is beautiful, her body is b","useful":0,"cool":0},"1tItOtzhINtRN69VH-EqmQ":{"text":"Best bar in NOLA!!!! Hands down!!! Bartender is gifted!!! Cozy atmosphere...amazing drinks","useful":0,"cool":0},"N7hyA9TFjaHrD7mmBu3a7A":{"text":"Definitely worth checking out. Good music. Burlesque in the back. Cozy. Absinthe things.","useful":0,"cool":0},"KRVL2XiNPebj5ueyrwmq1A":{"text":"Friends recommended Mahogany Jazz Hall and it was a great idea.  The epitome of New Orlean","useful":0,"cool":0},"h9b6lJJCQNVFBWtXWl59Rg":{"text":"I really like this place. They have live music but it's not loud that you can't have a con","useful":0,"cool":0},"dd7YwVqTqrlpyO3K1-K4zg":{"text":"Wow!  We went on a Monday night. The band was amazing but the real star was the ONE waitre","useful":0,"cool":0},"B45aig8tkHAdDZ3vuOM65A":{"text":"Happened to come across this place. Was walking by and the music sounded great. The owner ","useful":0,"cool":0},"gQzkFAFdVT-wvLJ2YkGD7Q":{"text":"the owner will greet you\nthe beer is cold\nthe a/c is cold\nThe Jazz is hot Hot HOT\njust go ","useful":1,"cool":0},"YX_8iEMmIXuO7d4v5nl83w":{"text":"Great bar drink options must try bees knees my favorite. Music here is Fantastic. Such a v","useful":0,"cool":0},"zlXruHQSKtqvOjBLbVtZQw":{"text":"Great live jazz, awesome cocktails.\n\nWent twice in the week we were in NOLA. Loved it both","useful":0,"cool":0},"3ata_ByiCR_tAPtzUe35BA":{"text":"Great drinks great old school jazz! Really enjoyed the Tom Fisher & Joe Lastie quartet. No","useful":0,"cool":0},"0lOFYBeoqsogg6CwVsqCSg":{"text":"Phenomenal night with the original tuxedo jazz band, a New Orleans legacy for nearly 100 y","useful":1,"cool":0},"Gooq30vot1eUqpT5cGUGQw":{"text":"This place was great!! The band embodies what you want from a New Orleans jazz experience.","useful":0,"cool":0},"3xifWmZHhMhOxJgOZv0tXQ":{"text":"While working in New Orleans for the week I stumbled into what I will say is the best Jazz","useful":1,"cool":0},"D1lYjM7xMtUKc3oiSrZNVg":{"text":"Great atmosphere, friendly staff and amazing jazz band!! I truly enjoyed just being in the","useful":0,"cool":0},"zrJjj2EwuGR4Izn80R-Mhw":{"text":"Great little place with life music and great selection of cocktails.\nUnfortunately not ser","useful":0,"cool":0},"vSSfK7wBHPsVX4yLGIxOBQ":{"text":"This Jazz venue is under new ownership and has reopened in July. Live music every night fr","useful":0,"cool":0},"VQFPyrysy9f0L99eUNZFHw":{"text":"We spent a fantastic Friday evening at Mahogany Jazz Hall. There was a very talented live ","useful":2,"cool":0},"b7G4LXNwHa-K0UkKY1UEwA":{"text":"Jazz in New Orleans is supposed to be a staple, and the venues in the city today can be hi","useful":1,"cool":0},"WJtv9yRAa0KwFHbV29Worw":{"text":"Great place to visit! It's tiny but the service is great! The bartender came up to us and ","useful":2,"cool":2},"SQou5X1awu-sm5FAza-nuQ":{"text":"Great place with wonderful house bands. The cocktails are great and the bar is cozy. Frien","useful":0,"cool":0},"uRBTyAmcntS8_TXUUIn7CA":{"text":"This place was great! Awesome live jazz music! Had a burlesque show but we missed it.","useful":0,"cool":0},"gT50siGCAtE09v9SzPAoXQ":{"text":"live Jazz Monday night & every night. Both bands were personable & fun, great professional","useful":0,"cool":0},"B-8QeIyqGSPyEHRTtmJhHQ":{"text":"The music was and atmosphere were a talented and refreshing break from the din of Bourbon ","useful":0,"cool":0},"Mc6JFj6GZ9GP9pLdKm0OXQ":{"text":"First time wandering in here after dinner looking for live music-- while we didn't make it","useful":0,"cool":0},"ZrgDEU0m2yBwnS5juRt8iw":{"text":"Low key spot for live music and drinks. Small location with around 20 seats, great for an ","useful":1,"cool":1},"AL35ILc1FNXX7xhe0ObGXg":{"text":"I was in New Orleans over the New Years holiday and visited Mahogany two of the three nigh","useful":0,"cool":0},"B9Re5fBYnJOi194VsF4eBA":{"text":"Fun bar... Mainly like because the absinthe fairy was fun, intriguing and interactive. She","useful":0,"cool":1},"nZuZyA_ur946scuxihf18Q":{"text":"A great place to hear live jazz music and serves great drinks. Good atmosphere and friendl","useful":0,"cool":0},"CUrl6lWNdj_kjyRLuR0iQw":{"text":"Maybe we were there on a bad night? Saturday Night in December before Christmas. The place","useful":1,"cool":1}}