{"QRiNbzOSyzqRYZm_XYuBrQ":{"text":"Came here twice during our trip! Once for lunch and once for breakfast right before we lef","useful":0,"cool":0},"eXS8XoKV7XhTg0WgkCF13Q":{"text":"So, this might be the most fun we have had...   Great diner food, super fast, Flossy and D","useful":2,"cool":1},"bP8qNjxRedjFQ7MPgM6jVA":{"text":"I loved the vibe of this place!  It had a real New Orleans feel. The staff was entertainin","useful":0,"cool":0},"MuaEld6PLyG4yML8U6KjpQ":{"text":"Good food for a reasonable price. Can't get a better meal for the money in the French quar","useful":0,"cool":0},"84LlrCNpZFDYXYYpZyyAXQ":{"text":"Must go here!\n\nThe staff is not only super awesome with their service, they make you feel ","useful":1,"cool":0},"2JhFj8mJS6I7KdW7NB7CEA":{"text":"Cheap prices. Great food. Even better ambiance.\n\nThis old-school sit at the counter diner ","useful":2,"cool":1},"SX864q2wr2p6W4R8EBEjNQ":{"text":"This place is horrible. We visited on 6/17/17 and received the worse waiter ever. He was e","useful":0,"cool":1},"hvCKkgnMrhT6OWItdRXyWA":{"text":"I've been a fan of the original Camellia Grill for YEARS, so it's not suprise that this on","useful":2,"cool":2},"n6Zu811o9e5pA9EAEL1VVQ":{"text":"BEST BREAKFAST EVER!!!!!!!!!!!!!!!!!!!\n\nWe came here while visiting for Halloween. It was ","useful":0,"cool":0},"c6pBPpOsY6fXO5REnzO88A":{"text":"Southern comfort food to its finest. They take care of you here! The fellas working here a","useful":0,"cool":0},"1hgPCbh64xwdmqSnvM2suQ":{"text":"A great little retro place that harkens back to 1960-something or other. The seating is al","useful":0,"cool":0},"9_jOxwgROYNARGYIeAdA8g":{"text":"Great unique place. Average meal $7.50!!  One of the best cheap places to eat in the Frenc","useful":0,"cool":0},"NJbAoP1TE0AEVvkOaKt2kQ":{"text":"Super fun to go eat at this place on a rainy night in New Orleans! The service was so fun.","useful":1,"cool":1},"oZDQs3eQTnn-Sza95BreHQ":{"text":"The guys behind the counter really made this meal! Fun, personable, and they made sure you","useful":0,"cool":0},"_Qx_5rx8VDZlPWgKw_IX2A":{"text":"Great service! Fast and friendly waiters. They were always on it and refilled our water fr","useful":0,"cool":0},"HdO0UQXQ3aaSaSaSgV6dWg":{"text":"Perfect!! Best cheeseburger EVER! New Orleans is a foodie's dream city, and cheeseburgers ","useful":0,"cool":0},"n5GMTIuDJfqUCR3DP6L9lg":{"text":"Great food, service, atmosphere, and price. Easily on of the best omelettes of my life.","useful":0,"cool":0},"eIFttewD7QHqx79DO90rmw":{"text":"Chances are if you're smart you've already visited this New Orleans institution. If you're","useful":0,"cool":0},"eALpX6acoBJRDdjPfGEGZA":{"text":"We were looking for a breakfast place on a Tuesday morning and found a lot of the restaura","useful":0,"cool":0},"-8hwHu2cBd3EBGcj-ezEiQ":{"text":"The breakfast was so simple yet so delicious! I loved the grits and eggs. I have visited N","useful":0,"cool":0},"q9pp6b0UdT8pXI4aJpdtXg":{"text":"This was one of the best burgers I've ever had! The food is delicious, the service is grea","useful":0,"cool":0},"TMhYrGtWjk67IQ28xMfRQw":{"text":"Yummmm!  Sit in Ronalds section if you can, hes a riot!  Had a mufulatta, gumbo, and choco","useful":0,"cool":0},"lPYG-NNRhmmEiUrNtUMf8g":{"text":"A few friends had been to another location and gotten amazing milkshakes, so when we wante","useful":0,"cool":0},"xVB2VxgzoFynoqPTehewFA":{"text":"I have never been so inclined to write a poor review, but we waited 20 minutes for coffee,","useful":0,"cool":0},"C65LK2s_FjaZAkid9CHfIA":{"text":"My husband went looking for breakfast one morning and got pointed to \"Camille's\". I guess ","useful":0,"cool":0},"3CzAIicQ1JmUTynbNAfrgA":{"text":"The best. Reminds me of my youth when my mother use to bring me to brunch every Wen's day ","useful":0,"cool":0},"yqKN5NFROaLE9VDnsLX73A":{"text":"Love this place and atmosphere. \nThe food is good and cheap. Great service too!\nSome my no","useful":1,"cool":0},"7zikqpCXdqi7E-fgEDhVSA":{"text":"Great atmosphere and good service. Clean. The food has really gone downhill over the past ","useful":1,"cool":0},"YSuaTdUMjfQjoQFr8JpQiA":{"text":"This used to be Camelia grill but somehow changed to just The Grill. The menu is largely t","useful":1,"cool":1},"VVbcZhUen_Ec5VO7vdjYZQ":{"text":"There's too many other great choices in the French Quarter. You can afford to miss this on","useful":0,"cool":0},"rD9HENhC1nh_MLARfJ6aVA":{"text":"Um so it can't be called Camellia Grill because of a contract dispute with the original ow","useful":12,"cool":7},"fAye6frim3ySLdDCScNs0g":{"text":"This place was great came in for a snack because it was mid-afternoon lunch time decided t","useful":0,"cool":0},"6Oo4rRC5B8wl7VNag3tSKg":{"text":"This place is a good stop for a quick bite to eat or a hangover cure. I have been here on ","useful":0,"cool":0},"LD7MtCqWqJZPt0SRnEXCrg":{"text":"Came back three days in a row!!! First day was a little long to get in but sure worth the ","useful":0,"cool":0},"zJYxk4AWHEpYYctbuGprBA":{"text":"The service here is fantastic! Super friendly and helpful waiters, the kitchen is open so ","useful":0,"cool":0},"XrHR7G9e_Iod2QgtKFvQfA":{"text":"My go to place in Nola is now CLOSED.   Food was always good. Service was fast. Reasonably","useful":3,"cool":1},"Y5hYizQ_pmKAGlUyto8I7Q":{"text":"Affordable place that serves okay food.  All these guys are friendly and are more entertai","useful":0,"cool":0},"yM3QP8s8aCzWnLJ7-upZBQ":{"text":"One of the high points of our New Orleans weekend, The Grill is a happening spot! True sho","useful":0,"cool":0},"aSR2mGDjXf1i4msEC-WM5w":{"text":"Holy greasy spoon wonderment! Hash browns were buttery and delicious, omelets were so good","useful":0,"cool":0},"inlrXnEdInNAWG_5BPoiVA":{"text":"Come here for awesome cheap eats in the French Quarter. I'm still thinking about the juicy","useful":2,"cool":0},"Gl2e6kUMnNku2efxtyof1w":{"text":"Seriously the best breakfast I've had probably in my entire life. Just don't go the ATM ac","useful":0,"cool":0},"XhK1ypdJIVanjFUoEBYhTA":{"text":"I have fallen in love with The Camellia Grill so when I saw this whilst strolling along th","useful":4,"cool":2},"fCPMKtog5nGX2FJGi8SZlA":{"text":"Friendly! And funny! Great service! Serving old-fashion diner food at near old-fashion pri","useful":0,"cool":0},"5ScHGqT3v-1qf0cbVgPEkQ":{"text":"A really good diner with a great range of omelettes. I had the Ranos which includes spinac","useful":0,"cool":0},"AyR839DHUneGKJzzBvLVKQ":{"text":"Barely 3 - Food is just ok.  Mexican Omelet - ok.  Hash browns not crispy.  Over easy eggs","useful":0,"cool":0},"jipdHbzevLq8q1CmPOC9Sw":{"text":"Best bacon cheese omlette I've ever had!  Came here once years ago drunk and hungry and be","useful":0,"cool":0},"p2Jntc-xmMZGC-1haFuz0w":{"text":"The atmosphere and location are great! My husband and I came for breakfast. The food is ok","useful":2,"cool":1},"pZfN8ekr3JqbemeVruYMzQ":{"text":"Ate here twice during my stay in New Orleans last March because it was inexpensive, delici","useful":1,"cool":2},"OEzHLnYirUCrOOPJ1m_Aig":{"text":"Great service. Super nice employees working the counter and great food. Lots of southern a","useful":0,"cool":0},"puVc-DjtZH-Uh5FO9daTpw":{"text":"This used to be The Camellia Grill. Due to a lawsuit they had to change the name.\n\nThe Gri","useful":0,"cool":0},"Z0p61F1DG9vN4oo6d1mleg":{"text":"We had a party of 10 for breakfast and Peanut and the crew took awesome care of us. Breakf","useful":0,"cool":0},"VCl84NXUib2XhzUXkSHSZw":{"text":"My Family and I visited New Orleans from California and we made a trip out to this restaur","useful":0,"cool":0},"ZPifgECO7q8pPcF2Uyv5bw":{"text":"Best breakfast in New Orleans. Casual diner atmosphere. Omelets are outstanding and massiv","useful":0,"cool":0},"WGz4HISppSmKfTLCsdtNMA":{"text":"Hmmmm The Grill.... What can I say about this place..... I had no idea what to expect when","useful":2,"cool":0},"9UOF39mZLiiCVDu2GHNr_w":{"text":"This is what I pictured places should be in New Orleans. The people who work are make the ","useful":0,"cool":0},"5UIrZB8dfZPvWjBOxDosnQ":{"text":"So, I want to give this place a 5 because the men working behind the counter are ADORABLE ","useful":0,"cool":0},"YGhc9ZjRgvK94Ohf-f1Stw":{"text":"Got the Camellia club sandwich with fries and my husband got a burger. Super delicious foo","useful":0,"cool":0},"HhbP4hDrGr8kGbBNnX7Gmg":{"text":"Great greasy spoon fare, including burgers, fries, pecan waffles and much more. But the re","useful":1,"cool":2},"JFAv5M27lvI2SStJEkToaA":{"text":"Absolutely fantastic breakfast....best I had here in NOLA.  Get the hash browns.  Do not s","useful":0,"cool":0},"XMVeTnchLu9dKa2RV_1p1w":{"text":"This place was really cool! The seating allows you to talk to other people from all over a","useful":1,"cool":0},"ZfAYJ_AtwCF-2V0wYULs_w":{"text":"Nope. The food would have been okay, but the staff has a dysfunctional system where the wa","useful":0,"cool":1},"-Ci2iMWkm7ETc55kDoUdcg":{"text":"LOVED this place!!  It was our last meal in NOLA and I am glad we ended on such a good not","useful":1,"cool":0},"8BYH2PR5NbZR_qE63hOWpQ":{"text":"We asked for a breakfast spot recommendation from our hotel's concierge and this is the fi","useful":1,"cool":1},"a5B-whmlPQD8602bjAvFZA":{"text":"Great prices and good down-home greasy food.  \n\nWe've always gone to the location in the G","useful":0,"cool":0},"cyto7IQDS2kkriHDmFZHug":{"text":"Price, atmosphere, location and service; all top notch. The short order cook prepares your","useful":0,"cool":0},"sZawcszUpMu5z-C1TNWeBA":{"text":"Great service with a hometown feel, the food is cheap and huge portions and delicious!","useful":0,"cool":0},"ung4mhs0C6vpUOUlQJiRTw":{"text":"The food is awesome, no fancy garnishes, names, or gourmet foolery. Just good old fashione","useful":0,"cool":2},"3neI6xSbW6OTqj96Cn-Ufg":{"text":"Perfect place for breakfast or brunch! Highly recommend it, staff is nice and food came ou","useful":0,"cool":0},"d1RAXsvedcIQAAMoxjFUKQ":{"text":"Our waiter Brandon was awesome. (I finally remembered a name!!) He was super funny and rea","useful":1,"cool":0},"DXpxVhInI9barcjm-5HPLw":{"text":"Authentic. Service is subpar but its apart of the experience. Keep in mind you have five g","useful":0,"cool":0},"rPo8Npk6_VRQOa_s4Vbgyw":{"text":"Don't go just for desert they ignore you and are rude.  Told us, after everyone around us ","useful":0,"cool":0},"MfU7XgrzRYPL0EMxOsqyrA":{"text":"Wow, so bummed to see that this place has closed! I hope it is only temporary, as it was o","useful":1,"cool":1},"Dzfh5wY2SkuPrQg9DG8b_A":{"text":"The French Quarter branch of Camellia Grill is as classic as the original. Best breakfast ","useful":0,"cool":0},"WgUkiIucnUHn6nRYCGQvhA":{"text":"Quite possibly the worst omelette I've ever had, catsup couldn't even help the over cooked","useful":0,"cool":0},"oMvqbKZiBJ1o8P7Uc7ZJIQ":{"text":"Go HERE!  We stopped in after an evening city tour... needing to sober up...  Plopping dow","useful":0,"cool":2},"F1c4GOw6d-hZzCNEVC-76A":{"text":"Camellia grill was right around the corner from our hotel and the bell hop suggested it to","useful":0,"cool":0},"GJ55Jxp5nKu7MU2KiRf3xA":{"text":"We stopped here looking for a place to rest after wandering the French Market. Camellia Gr","useful":0,"cool":0},"6jp6VHHoOm9ytzQYVH8jGA":{"text":"This place is a MUST for breakfast. It's super casual and quick. Three people that were wi","useful":0,"cool":0},"Tm9iw_I5ctBsMYoDG11w_g":{"text":"Camilla Grill and I go way back. When I was in college and I would make it to New Orleans ","useful":0,"cool":0},"grR2szZlB0bQ1K-bSr4lsw":{"text":"I enjoyed my visit to Camilla Grill and would definitely return. \nI loved how the staff al","useful":1,"cool":2},"IjA_PFEGgAd1kcdzbw0tQg":{"text":"We did not linger at Camellia, opting instead for a quick slice of pie, a beer or two (if ","useful":2,"cool":2},"4Ecp2jkUR9Rj7DKdw06HdA":{"text":"I thoroughly enjoyed my visit at The Grill. I had a cheeseburger, fries, & a chocolate sha","useful":0,"cool":0},"ka6qtM5-lbj6oNmxKYUCjw":{"text":"Wow, the most entertaining breakfast I've ever had! Was greeted by Peanut via fist pump. S","useful":1,"cool":1},"jNCysvjhhlyjvGzF06hphA":{"text":"Want a real New Orleans experience?  Come check it out. Nothing fancy; just old school foo","useful":0,"cool":0},"ChRFnD02AyPcO6C83n_4FA":{"text":"Great atmosphere the employees were entertaining and the energy was fun. Ate there twice a","useful":0,"cool":0},"asb2TytqWMMWMpi1mglHsg":{"text":"Southern hospitality here.  Loved the omelette and had the best hash browns ever!!!! Every","useful":0,"cool":0},"n0kcslq6BDye6UgTG9XkyQ":{"text":"Excellent service, speed of service, and greasy spoon food. They make you feel welcome rig","useful":0,"cool":0},"Tn8aTzugkI9QrOZL0E4FCg":{"text":"We love The Grill. We have gone every time we've been in NOLA and it has been open (it was","useful":0,"cool":0},"AXR8fgvXHkSHebJInMaxbA":{"text":"This is the new location of the classic Camellia Grill which is located in the French Quar","useful":5,"cool":3},"EJQ4lODK6fsjIrqtWeo6zQ":{"text":"Good burgers at a decent price in the middle of the French Quarter. Diner atmosphere. Frie","useful":1,"cool":0},"dGCsWLDcrFSMOR67DdM0ag":{"text":"Great food. Stumbled across this place in a rainstorm and got the best fluffier omelette I","useful":0,"cool":0},"vLyY7JbEJvNmAABaa0k_Rw":{"text":"I ate here twice, in a city renown for its great food all over town! Once I came by myself","useful":0,"cool":0},"6aoar_LfLvIuUTz8sdY5Ag":{"text":"Never a dull moment here!  Love this place - love the guys that work here - love the food ","useful":0,"cool":0},"S8JyuHEPHx92VWZLDruNSw":{"text":"Food is good and the grill masters working there are so much fun.  I'll be back here often","useful":0,"cool":0},"6iI6Oke0TfuaNTsHu90nCA":{"text":"Perfect. Simple, quiet, cool, excellent versions of good ol' lunch counter food.","useful":0,"cool":1},"_bJ8qUemm2hcWzZd7IgPVg":{"text":"Excellent! We had the Muffaletta Po Boy and the Mexican Omelette. Very delicious. Great se","useful":0,"cool":0},"Kw60wAdkx5e7MCJ5Oy4wNA":{"text":"Located in the heart of the French Quarter, this is THE place to go for breakfast/brunch. ","useful":0,"cool":0},"mXNm_4cvrs5UaDR-SfbLfA":{"text":"We found this place on accident while looking for another place... it was the best breakfa","useful":0,"cool":0},"Pzs5yGpNW5GKRZgFO8Fugg":{"text":"A greasy spoon diner, a white linen napkin and servers with a sarcastic sense of humor is ","useful":5,"cool":4},"z0DGvuHN079STVdHlzJ-gw":{"text":"If you have a hangover or just need a good breakfast/brunch come here. The hospitality is ","useful":0,"cool":0},"aDqJmoxCCaLHFQKmz06wig":{"text":"Fun! The staff are great and entertaining to watch.  One of the best bacon cheeseburgers I","useful":0,"cool":0},"q5FvAOeWh0xOrm9Fl81jcA":{"text":"We walked by this place while wandering New Orleans. It always looked busy so we hopped in","useful":4,"cool":1},"Cw-eXrybXDydVKWSZgtswg":{"text":"Being from the capital of Diners, New Jersey, it's hard for a diner type restaurant to imp","useful":0,"cool":0},"igHNOA-n9IYEaMFvf0qv2w":{"text":"I would visit this place again. It is simple, diner style food with a casual atmosphere. I","useful":0,"cool":0},"MdPvj-HORhjUpohHurNlUA":{"text":"This is your typical 'drunk' food. I arrived an hour before closing and the place was a me","useful":0,"cool":0},"4BtJyYkQarHYvDVU7ULj_A":{"text":"No, their muffaletta is NOT very good. Those who think it's good may have never had a good","useful":1,"cool":0},"fYz1mJtn5V1ucvHCCDrSJQ":{"text":"Brunch on a Sunday in the Quarter can be tricky, but if you can get in here (or any breakf","useful":0,"cool":0},"G2IbHvw4bYit2xu9Z7uzrw":{"text":"Fun place to come, its a good value and the service is entertaining! I had the catfish san","useful":0,"cool":0},"aO-akDdhNYAvEEIgArKX_Q":{"text":"Oh Em Gee maaaaaaaaaaan!\n\nWe found this little gem due to the Yelp App - monocle for the w","useful":0,"cool":1},"1ozFEjNCqcJx1ZLy9ji3nQ":{"text":"This location is called THE GRILL NOLA now. It is the same menu as before, and it tastes/l","useful":3,"cool":1},"tUnGiMB-AHeejAGNF04Isw":{"text":"Great diner vibe and the food is outstanding! Great staff, big portions, consistently tast","useful":0,"cool":0},"kJelmiyuDgrf40gWJTYEWw":{"text":"I loved this diner! Super casual, laid back - don't go expecting bells and whistles. All c","useful":0,"cool":0},"yhQf6gAguydDwzcSULAfSg":{"text":"I love the way this diner is setup.  There are no tables or booths.  Everyone sits at a co","useful":0,"cool":0},"ixUwkX2H2ZvdBEkoqyurmg":{"text":"Service was quite distasteful,  luckily the hostess tried to remedy the embarrassing situa","useful":0,"cool":0},"7d-rhy9whp6107lNXlIWsg":{"text":"I visit the \"Grill\" as it is now called several times a year. It is a great place to go fo","useful":0,"cool":0},"4il5DfW1Quf7TUaDRnugEw":{"text":"A staff member at my hotel I stayed at suggested I come here for breakfast one morning. I ","useful":1,"cool":0},"ymeBhb9RXjwUgiKl0c0iGg":{"text":"Our favorite place to eat breakfast on this trip. Peanut that was our waiter, and he was s","useful":0,"cool":0},"CjEO96bAJkP7kyklHB_f-g":{"text":"My husband and I absolutely love this place!  The burgers are delicious, and the pecan waf","useful":0,"cool":0},"RJ-Oli38wyB0iFZJ4npeRQ":{"text":"Don't go for a relaxing breakfast if it's the weekend or a holiday.  Go for easily the bes","useful":0,"cool":0},"ISuAoin5h0QGG9472POywg":{"text":"Excellent grill! Clean place, friendly and fast staff - especially Renee! He made sure we ","useful":0,"cool":0},"JKLQFs0VMonRyJX6nf2bzQ":{"text":"Very mediocre. \n\nStopped in for a break after walking all the touristy spots nearby. Figur","useful":0,"cool":0},"TVUy-ePNRbuCusYDfKddKQ":{"text":"Yelp will never steer you wrong!\n\nSo here's the story:  took the airport shuttle to my hot","useful":2,"cool":1},"BNeiM59mv-W_-sWmbpeu7w":{"text":"It is ok.  It does not compare to Camellias!  If you like Mr. Pibb over Dr. Pepper then yo","useful":0,"cool":0},"omchgjrhB64sbeAVmhyzUQ":{"text":"Great pancakes, cold beer. One of the best breakfast in NOLA.","useful":0,"cool":0},"_XSsDJYYEM06X_WQKru84g":{"text":"We were looking for a place to eat breakfast and stumbled across Camellia Grill. We saw 4 ","useful":0,"cool":0},"WOwstf0wODpvksheI4lANQ":{"text":"We loved this place--our server was so charming and funny, they accommodated our allergies","useful":0,"cool":0},"4IWq4HZR0PtOh3F61O28Hg":{"text":"I live in the French Quarter and I would gladly give The Grill a 5 star rating based on th","useful":3,"cool":0},"I91GVkhyKb-4zitqHZsW2A":{"text":"Diner food that is good when you are hungover. The staff is really nice and funny. This is","useful":0,"cool":0},"WqNXA9Chk-A4q-AXaVMmbg":{"text":"What is not to like about the old school diner. You sit on bar stools like you are in the ","useful":4,"cool":1},"hveyvtiJ4Qvz-mmbQnfEMQ":{"text":"Have always visited the Carrollton location until now. I have always loved this place. The","useful":0,"cool":1},"GMOWSwscOVJMbfXRk9Q--g":{"text":"Wonderful American food is what you can expect here. They've got a basic menu (think Waffl","useful":0,"cool":0},"y0icAwtYdIYVfsj-8F8BjQ":{"text":"I love this place.  Been there twice now in the last year on my 2 trip to NOLA.  The atmos","useful":0,"cool":0},"rkjVVKtXb65jbxddNF7D6Q":{"text":"The hours listed on Yelp are NOT accurate! The food is so DELICIOUS! I love food and this ","useful":0,"cool":0},"KX-1ksNkm6chcMp2c987AQ":{"text":"The French Quarter location is a little sub-par compared to the experience you get at the ","useful":0,"cool":0},"TTAeuXRDaDplj5Oz8S_now":{"text":"One of those spots you have to try ... we stopped by Mardi Gras weekend for breakfast and ","useful":0,"cool":0},"WCqSeicCaW_4TIL_-gPwRw":{"text":"American food served with friendly, fun-loving character\n\nORDER:\nFried catfish plate with ","useful":0,"cool":0},"R7vdlSFDk2EMXpjxP9BkUw":{"text":"The floor was dirty and badly needed cleaned. My burger and fries was $13 which wouldn't b","useful":0,"cool":0},"98GpSY73WBBIczHyrjCKrQ":{"text":"AWESOME PLACE!!!! My wife and I wanted to get brunch so we waited in a line for this rando","useful":4,"cool":1},"7mszqfzoFDIP57o6Yoc1ZQ":{"text":"Yelp, Did it again.  In the French with a bunch of kids so value and quality was important","useful":0,"cool":0},"0Jm6nmFnpXPv6zjn-HRgMA":{"text":"Very good hamburger and Mac & cheese bites! Diner-style decor. Seating allows for possible","useful":0,"cool":0},"kUor5J0wCfKxbXC04k4jdw":{"text":"A good meal. We had a bacon hamburger, Yankee harry po'boy and waffle with sausage. The wa","useful":1,"cool":0},"VUG9bpzq9F6XH137wyqtdA":{"text":"Wanted a burger from the grill. The cheese Burger was wonderful just what I was craving. A","useful":0,"cool":0},"G8Z7RdT_A9jE00EbrO6KPw":{"text":"You come to The Grill for a show and breakfast. The guys that work here make the mediocre ","useful":0,"cool":0},"17_hbNtUqBFyOHmrs-52Pw":{"text":"Below average American (Sysco-style) food with charismatic servers to even it out.","useful":0,"cool":0},"AqJSSIHKsZC_3jnUrsRRWw":{"text":"Not good. Sad-quality ingredients. Couldn't stomach the fries (I thought eggs came with to","useful":0,"cool":0},"4-lcc2EqeDiIsnv4GuDDRg":{"text":"After wandering around aimlessly looking for a place to get a late night burger, our group","useful":1,"cool":2},"RQVUuBux9oeBQtudg_DSEw":{"text":"If you're looking for a diner this is your place. Food was average & service was good. Not","useful":0,"cool":0},"tsnnpErTGpnhNrR_WRw6rQ":{"text":"This place is solid with good food at a good price and quick service.  I just wish they st","useful":0,"cool":0},"hxgUd4WCU0ryHKk95QycWA":{"text":"Great, inexpensive food; great ambiance; lots of character.  Used to go to the (only) one ","useful":0,"cool":0},"dT2cTqKZW7FtVwomMq391A":{"text":"The food was good, but i probably should have ordered something different. I had the waffl","useful":1,"cool":0},"utcX6bZnFIAYOYcLkp-geA":{"text":"If you like Flat Grilled food. This the place. Best breakfast in the Quarter. I've never m","useful":0,"cool":0},"TLKpGJmcEW4pMadcQUdxCA":{"text":"I recommend this restaurant. The food was not expensive. Very nice to grab a bite. Don't e","useful":0,"cool":0},"qNVb_h3w_6-U5XjMDmRH3Q":{"text":"Best BLT ever! Loved the crispy fries, but nothing beats the cooks and waitstaff! I'd eat ","useful":0,"cool":0},"EomnQ0JiqACvdMHZMB6l7A":{"text":"I loved the atmosphere -- if you want to feel transported back in time to a classic diner,","useful":2,"cool":0},"qzG_F5cZUjvkPZR4BKqbbg":{"text":"This restaurant has all guests sitting around like \"bar-service\", and the waiters are walk","useful":1,"cool":0},"8kGFDzs_1bwGbNmXiHaiUQ":{"text":"Hamburger for breakfast?  Don't mind if I do!  I loved the noise, the food and the witty b","useful":1,"cool":0},"2uL2AOJdPs1hq00zJMU0Pg":{"text":"My boyfriend remembered this place from his last NOLA visit and he has very fond memories ","useful":1,"cool":1},"sZ24Uo-BANVqu8JNj8eozw":{"text":"The only honest to God diner in the French Quarter! I'd give the 5 stars, but that would b","useful":0,"cool":0},"ZiOx0pLEcsfvU6C5ZmUY6Q":{"text":"This place is the bee's knees! Staff is super nice and laid back. Very attentive to the cu","useful":0,"cool":0},"tVNJFzBn39BY8qDy53E2qA":{"text":"A wonderful stop for breakfast or lunch.  The sausage omelet was one of the best I've ever","useful":0,"cool":1},"NrrYYU4L9BDeCDmktjvjCA":{"text":"We just walked in the rain!!! An entire bachelorette party of 11 and it says it's open unt","useful":4,"cool":3},"QWScgi4hpPrtwqnAxXDeLg":{"text":"First stop while in NOLA.  One of the girls at a nearby store recommended this place. At f","useful":1,"cool":0},"_Z-MmnWFturG1mTLkIN7yA":{"text":"Umm, not a fan. What's cool is sitting at a diner and feeling like you're in the Deep Sout","useful":0,"cool":0},"1un16_dktXTaCNLs89ikiw":{"text":"Visited twice in a row because the food was that good, the staff was super friendly, and t","useful":1,"cool":0},"xuOaqsNCbRSXUJmkz_Cofw":{"text":"This was a great breakfast spot! The service was sooooo great! The best part about my visi","useful":0,"cool":0},"JRO5hxxDzXgLxIxB-5DcSg":{"text":"You know, I must absolutely confess I don't know what the rave is about this place. Iorder","useful":1,"cool":0},"Lgw7tRU5yKg6Nj_T4fc5eQ":{"text":"Greasy Spoon, counter style where you are right in the middle of everything! Visiting the ","useful":0,"cool":0},"MBgti6O-q4eEyF0O6XSAlQ":{"text":"Wow--how can you mess up breakfast so bad? Ordered grits with eggs over medium. Eggs showe","useful":0,"cool":0},"VGCIs8HTPvu_nCAgV7U1eA":{"text":"Pecan waffles. Every time I come to New Orleans I *have* to come here and pecan waffles. T","useful":2,"cool":1},"6BoCBlaKuYb6o1CzEN2HOQ":{"text":"So this place gets 5 stars based on the customer service, but the food was just average. W","useful":1,"cool":0},"8gipDu-Tv2Bw7p_2VEparA":{"text":"The food was top notch and the staff funny as all get out. I was made to feel like I was h","useful":0,"cool":0},"vTnxrgiQvg-R7R9qu5d6bA":{"text":"This is a great affordable place to get breakfast. The food came out fast and severs and c","useful":0,"cool":0},"bd5zz5ZFFhXE_2Ut-v-grQ":{"text":"Not only is their food delicious but the entertainment from the waiters and cooks are awes","useful":0,"cool":0},"KhOJkwqRqX5ifB8FD1lJ7w":{"text":"Great place to stop in have some breakfast diner style and step back in time a little","useful":0,"cool":0},"hBGD0cwJwtBtH_HfByUtvQ":{"text":"Breakfast is served... Had the measure of visit today ordered veggie egg whites with turke","useful":0,"cool":0},"Tmdq71_MC8X8ONlO4af8mA":{"text":"Decent place to eat a quick meal. The waiters were friendly and paid attention to refills.","useful":0,"cool":0},"fFrxIpgCYHCLO3EwlwlLWA":{"text":"Formerly the Camellia. The name was changed for some legal reason. A unique dining experie","useful":0,"cool":0},"RCjfHP3QNccL46K5aLAQIQ":{"text":"A good diner experience. The pancakes gumbo and burgers ate amazing! I had the pleasure if","useful":1,"cool":0},"q1vlfqwpqMRHxIUYwHEkdQ":{"text":"OMG this place is amazing! We walked in after walking around all day and we were already t","useful":0,"cool":0},"Gjdry6qb1DFSd9S7aX0gKg":{"text":"Its a no frills diner with tasty food and very lively service.  Great for a big omelet or ","useful":0,"cool":0},"ktFNYPZKoNypoNO-7hsaxw":{"text":"Ok so once again this was one of the must try places on my list. Took a few minutes to fin","useful":2,"cool":2},"aPS8kAB-L_veT5-ywHgQ8g":{"text":"Cooks are visible while cooking and there is always some great conversations going on betw","useful":1,"cool":0},"8V3cMFyeauGg3nOivbUZow":{"text":"This is just a true down home Nola diner experience.  Nothing fancy.  The staff are inviti","useful":0,"cool":0},"wQaQ5-DqlI30G6himMt-DQ":{"text":"It was one of the most heartfelt experiences in New Orleans. The food was Delicious! We lo","useful":0,"cool":0},"qv64B1H0oOSeXPf-EhPg2g":{"text":"Great late night diner!  Loved the cheeseburger, fries and chocolate freeze.Be prepared fo","useful":1,"cool":0},"_W-05kplglfSHz7AlAxGlw":{"text":"As you walk into this diner which is frequent by the locals, your transported back in time","useful":0,"cool":0},"fcZ79JvVsOnHv-Db5SZczg":{"text":"Best hidden gem in NOLA. The staff are very friendly and charming. The pecan waffle was tr","useful":0,"cool":0},"MJKyjQhv5QU7CrcYximO-A":{"text":"Total no frills greasy diner.  I wanted something fast and cheap and this fit the bill, no","useful":1,"cool":1},"KgTm0WZo7p0pmQ_SflD-Pg":{"text":"Best grits I've ever had in my entire life. We were visiting from California and came here","useful":1,"cool":0},"9bb-LMFVqAXxRun0hX02KA":{"text":"This place was awesome!! The food was good but better yet the atmosphere was fun, inviting","useful":0,"cool":0},"o1XHWioA0pNJ2d8CRbe3hA":{"text":"I'm sure the burgers are OK but I made the mistake of trying the Muffaletta and I'm still ","useful":0,"cool":0},"UIcSgeUSZC_oWpE_eY2rnA":{"text":"Amazing diner-type place.  It is one of my favorite spots in the city. For better or worse","useful":2,"cool":1},"GQGtW8_NlTwgjtefMT4JWQ":{"text":"We were starving, and it was dreadfully humid outside, so we were so glad to come in to so","useful":0,"cool":0},"hNjzZqb0n-WiZuyDPAQdHw":{"text":"When you just want a good breakfast go somewhere else because this breakfast is GREAT! The","useful":0,"cool":0},"XZdTcykmpvw3N16cqzSdbw":{"text":"My girlfriend and I are visiting the city for the fourth of july and we don't like seafood","useful":0,"cool":0},"gdXKiN5lR8OuCCk1CYA_jw":{"text":"The decor and the appearance of the cafe are fun. The service is excellent. However I woul","useful":0,"cool":0},"xJCJB0bfSpCm2O228zbd5g":{"text":"A great little breakfast spot . Funny and friendly staff. They like to joke and tease with","useful":0,"cool":0},"v1rQKKGPu5eXTb24k8gFtw":{"text":"Cute setup with wrap around bar. Our waiter was super friendly. Good food, fast service, a","useful":0,"cool":0},"HUGsJcLPega54x6iJAEJNg":{"text":"The three star rating is because my honey liked the food, but I believe he likes anything ","useful":1,"cool":1},"BNop6RduKIrRREOv38-Taw":{"text":"Good but seems like just another average breakfast diner with diner food. The waitstaff is","useful":0,"cool":0},"08EWsu4df7JtgkIwnmfNtA":{"text":"Amazing place! Not only was the food absolutely delicious the service was extremely friend","useful":0,"cool":0},"nHo0JlgrODsDFjGsGEFpEg":{"text":"ATTENTION: The sign for this establishment simply says \"The Grill\" with a pink Fleur de li","useful":1,"cool":0},"BM7AMJ1J8Btdhn_Xupe3NQ":{"text":"The BEST brunch I had. Service is also great. I had waffle with chicken tender and chief's","useful":0,"cool":0},"w_tNigy_82k-yUKksK4wdQ":{"text":"Best people in all of New Orleans work here. Stopped in for a lil snack before a tour and ","useful":0,"cool":0},"QidspStNiT4NEf7sJujXTg":{"text":"2 stars because the service was great!!!\n\nThe food was pretty much gross. Everything we or","useful":0,"cool":0},"C7lrVIHoHk7p29LWqu0VUg":{"text":"I would say that the food was very mediocre. The real charm of this place is the atmospher","useful":0,"cool":0},"YXjaoDZpNMxhETImgOkTdw":{"text":"loved the atmosphere of this place! The waiters were great, and always made you laugh! I c","useful":0,"cool":0},"ADMTV-AgMCwNLEu8d5eLDA":{"text":"Happened to come across this diner when we were looking for a good place to have breakfast","useful":0,"cool":0},"ungQNgMVnuRdDghRJLXubg":{"text":"Stopped in here this afternoon.  We enjoyed the muffuletta and red beans and rice with Ita","useful":0,"cool":0},"F8HsncPhiVV4G5Dre3RFtg":{"text":"Went two nights in a row, once at midnight for a post drinking snack, once at 7pm to lay a","useful":1,"cool":0},"BxMIas92rgnCiYg-KfQVeQ":{"text":"Wish we had more days to spend dining here! Feels like we were guests at someone's home!","useful":0,"cool":0},"cq84sH1j7yTi_DrBh1eyog":{"text":"Am an old fan of the Carrolton location and have gone there for years.  Finally came to th","useful":0,"cool":0},"njzwNa-zWIVzwTc8va8k4Q":{"text":"Very good restaurant for the french quarter. I am surprised! usually the quarter restauran","useful":0,"cool":0},"fHPdRlZ9c3tVU-dRH6T34A":{"text":"\"Good ol' Southern cookin'!\"  This place has very friendly service.  The gentlemen who ser","useful":1,"cool":0},"bZJP26-abgcNauY2bGj5Xg":{"text":"Good breakfast at a good price, what else can you ask for? Great place to come to help cur","useful":0,"cool":0},"5UEP5ey52pFxhFB37YePPw":{"text":"They had an awesome menu, from breakfast to dinner . A good section of omelets, cooked to ","useful":0,"cool":0},"p0a4skqvVlyvG-CNZcXONw":{"text":"Stopped here for breakfast on Thursday 3/24/11 and was pleasantly surprised. A throw-back ","useful":0,"cool":0},"nRQZ0ZyrqMDexjtBDPVTsA":{"text":"Definitely a great place for breakfast!  We've been here a few times and always very satis","useful":0,"cool":0},"HnxKup7s1ZvQJqY4IdvS5A":{"text":"The waiter was nice. \n\nThe food took forever and they weren't  busy. I got eggs, hashbrown","useful":0,"cool":0},"pkFwD8QGlxixRQEoo2tHCg":{"text":"Really liked this place.  Old, funky, a step back in time.  Everyone sits around counters ","useful":0,"cool":0},"iM5blQZPecji8_KOFB1paA":{"text":"I have my lunch here.. The staff that works here are amazing they always make me feel at h","useful":0,"cool":0},"JvYJKBuf0tBgVRhYzHEEXg":{"text":"Fun diner style experience in the French Quarter! When you \"pull up a seat\" strike up a co","useful":0,"cool":0},"oX6gZOfx5ifS8kCg2syVQg":{"text":"Aside from all the fine dining I usually list off for people looking for places to eat in ","useful":0,"cool":0},"zpAi2R1X4NUfE0Vb8pw73w":{"text":"This was one of the best places we went to during our trip. The food was amazing and there","useful":0,"cool":1},"VFQWCo4E1nqVLcaLzxL4_A":{"text":"First time back since remodeling. Had many good meals in the past. \nFood was good,but the ","useful":0,"cool":1},"cFABioViI2lKkmRokhy07Q":{"text":"Yummy, cheap food.  I had scrambled eggs (not what I ordered, but tuts what showed up) and","useful":1,"cool":1},"LV2Ne455BoJFKHOCXfOP9w":{"text":"A MUST when you are in the FQ. Any burger is terrific. The chili cheese fries are amazing.","useful":0,"cool":0},"qptGxUeowb488CWhlMGYZQ":{"text":"This place is SO YUMMY! The burgers are so juicy and flavorful and the onion rings are awe","useful":0,"cool":0},"FhZeXUiBQ_RoGSEyE9nNhw":{"text":"YUMMY! I was excited to eat The Grill again. It had been 3 years since last visit to NOLA.","useful":0,"cool":0},"5KuMVId_scLoLDaMYzOGmA":{"text":"We ended up here for a post-drink snack and weren't disappointed. Diner counter style seat","useful":0,"cool":0},"Le4KOpo3D-PWNoUl8-APmQ":{"text":"Best waffles I have ever had. Friendly staff and prompt service. Highly recommend. We have","useful":0,"cool":0},"rZWXt2OZUlros1-_b9eDvg":{"text":"I thought we were in the South.....apparently this place doesn't know what that means beca","useful":6,"cool":0},"28AUUsUc3fF00ARIyl4SvA":{"text":"Our hotel recommend this place. Walked in and loved the set up of the place. My friend and","useful":0,"cool":1},"45Rg-1TRpEAwtreI_Q1OmQ":{"text":"I sat at the bar when I ate here. It is a really cool place - a mix of great atmospheres. ","useful":0,"cool":0},"U1sz2F1DuBf9M17o5Gd60Q":{"text":"Prices and hours aren't accurate on Yelp. They are open from 8am to 3pm, not 8pm. The pric","useful":0,"cool":0},"SdWgnonZXXzarAoht0Ha8w":{"text":"I'm a native and a 40+ year customer of the original Camellia Grill Uptown, and I love it.","useful":1,"cool":0},"CQa9T_qOOYVZRwECeHNbNw":{"text":"We stopped in for Pecan Pie ala mode for dessert. The service was fantastic. The pie was w","useful":0,"cool":0},"7nzjqjWWV__AsH6tA712gw":{"text":"Didn't try it.  Heard it was lively atmosphere, but three guys just stood and stared at us","useful":0,"cool":0},"VhnypUFhxx9EzWdowt1OBw":{"text":"After years of going to the Camellia Grill uptown I was happy to see a French Quarter loca","useful":1,"cool":0},"wm_o4xNB_VQ47hY4dnJMUg":{"text":"A great place to get a good breakfast and or brunch.  The head waiter is great!  The servi","useful":0,"cool":0},"7kke-6PiVIsKpPUS2hW7WA":{"text":"All the things, on all the menus, are good. The best stop for a quick and sobering bite to","useful":0,"cool":0},"oUtxAbV4k-EtHFK7Fvy2NQ":{"text":"We love the Camellia Grill, started going to the other one on Carrollton years ago. Love t","useful":0,"cool":0},"C4WpSNGj_j9qvILEa5tSCA":{"text":"After a few days of rather expensive Creole/Cajun cuisine and a lot of seafood, it was nic","useful":0,"cool":0},"4oK0DnhmJ78EaYAllQCiEw":{"text":"Worth what you get and maybe quite a bit more great find for New Orleans and their high pr","useful":0,"cool":0},"qIUfSBw4QwQZlYIFoBJPIg":{"text":"BEST New Orleans style food in the Quarter!\n\nAte here about half a dozen times while livin","useful":2,"cool":0},"DIR3fViAyqpFnMxljGRhbw":{"text":"The entertainment from the waiters alone is worth going for but the food is top drawer and","useful":0,"cool":0},"Y1vQ7uNHuDcnTawHMAJI7Q":{"text":"Leonard is the best server in Nola. The food is fantastic and the service makes everyone s","useful":0,"cool":0},"l-6CxviSCpb_-Ns6eGS5xA":{"text":"What a fun place and good food, too!  Lunch had po'boys and gumbo which were terrific.  Ha","useful":0,"cool":0},"Zv-ISda2ScEW8eO-LKG-Eg":{"text":"We came here for out last meal in NOLA.  I had a BLT, which was great.   The waiter was fr","useful":0,"cool":0},"F9ckHGS6EXaEN59sCEAjqw":{"text":"BRUHHH so we come here because as y'all can see the reviews are fairly decent. The restaur","useful":0,"cool":0},"T8_O--oZKHjmhjQVl1GsPA":{"text":"This place is fun! The cooks are clean and organized; they communicate well. A friend and ","useful":0,"cool":0},"VgaZvks6LNxWmj06B7QTow":{"text":"One of the lightest, fluffiest omelettes I've had. Friendly staff and speedy service. High","useful":0,"cool":0},"gEidvkyA2TkkjuUp9eMlIQ":{"text":"Food was great waiters were awesome! I will be back before heading out of town. Had the Sa","useful":0,"cool":0},"zFRqcFYa1llUZug_vb2XxA":{"text":"If you like your eggs burnt, grits watery, sloppy service and dirty counters, then this pl","useful":0,"cool":0},"uBtYUArsiwK7XaE8p7ed3A":{"text":"If you're on a budget but want to enjoy some good food, this is the place to go! Similar t","useful":0,"cool":0},"DcXksLHFXIko-pL58aUP2w":{"text":"Just ate here, 4 adults.  Quaint,  50s feel, no tables,  all chairs wrap around  a bar. Ou","useful":0,"cool":0},"Acy2CHr9IwYGQAmdVOB4KQ":{"text":"Walked by it while window shopping and glanced at the menu posted on the window, and decid","useful":2,"cool":0},"Fa6LdX_Q0qyKzgL8OO7O8w":{"text":"This place is fantastic. We happened across it while we were in town visiting. We were loo","useful":0,"cool":0},"7f4xnA1apfRDxCDE6qP5Iw":{"text":"Ok, so this isn't high class food; it isn't an exquisite dining experience; it isn't anyth","useful":0,"cool":0},"f-18m9Lekrx4GKaV9OYGGQ":{"text":"This place is OOZING with character.  The experience, alone, is worth the visit.  Server J","useful":3,"cool":1},"90CepES7e0W-M_SMUfMZdQ":{"text":"Classic location that just lost the \"Camellia\" branding. The staff is pretty  cool and fun","useful":1,"cool":1},"57ZKtFnNmOQz5ik7NIuIPg":{"text":"Atmosphere is great if like interacting with people! The food is plentiful and very good. ","useful":0,"cool":0},"xayBgRWTpgD0bDQcEnMifQ":{"text":"Went for breakfast.. Great Americana atmosphere, very friendly staff.  Prices are reasonab","useful":0,"cool":0},"NuOV4BrVr_Bi6fFR3Kfm8w":{"text":"Pretty Ricky is a great host....make sure you tell him Hotlanta sent you.  Food was afford","useful":1,"cool":0},"hNF1r14B_nrZwr5jAC_F5A":{"text":"Unique atmosphere with great burgers and the friendliest staff in the quarter. If you're l","useful":0,"cool":0},"OmkM2KOM71SS7ZQYEfoNbw":{"text":"Wonderful people,  good food! Avoid the bathrooms if you can. Otherwise a great place for ","useful":0,"cool":1},"AjAsamsYg1kqVBgkKrygfA":{"text":"This was hands down the best meal I had in New Orleans! It's not a typical cajun/creole pl","useful":0,"cool":0},"SrxkYrFFykskvTLFUyWPVw":{"text":"Great find! We had been eating in different spots to experience the tastes of New Orleans,","useful":0,"cool":0},"pE-jdXgQdz2f_7jdFOxVyg":{"text":"Service was amazing. My husband and I were seeking late night food and found this gem. The","useful":0,"cool":0},"MY_55rWnlahDyLIag8MSrw":{"text":"Server was grumpy, barely wanted to help me. Another had to refill my water. I didn't see ","useful":0,"cool":0},"vnnUYSYk0doLsB96AToDmw":{"text":"Great little place. We enjoyed our food and the service.  The catfish sandwich was great a","useful":0,"cool":0},"hVyULG3CsavdWwzUE_8jFQ":{"text":"The meal was fabulous! A great in and out place with breakfast or sandwich all the time. S","useful":1,"cool":0},"-wbti9f4XtFVXBphPMdvUQ":{"text":"My family and I came to New Orleans on vacation and stopped in after reading the reviews. ","useful":0,"cool":0},"dVvYYd0nuGOfAwKGz3OPCw":{"text":"Don't see what the hype is about. Good location and the restaurant has a fun, unique layou","useful":0,"cool":0},"PvSaWd_Yy68a2dBYobfQlw":{"text":"Best breakfast in New Orleans....awesome service too. It was fun to watch them make everyt","useful":0,"cool":0},"YfrbGyr4tmz7-qS6NEkzRQ":{"text":"Place is the best.  Especially after a long day of drinking and walking.  Wife and I had r","useful":0,"cool":0},"wJJfeEW6g1HwrFQtc9MEGw":{"text":"The food was great and the staff was amazing. They really kept the place Classic so...mmm.","useful":0,"cool":0},"-lGFwP-5mAMxw5_asjG3bA":{"text":"Literally one of the best breakfasts I have ever had! This place is consistently good and ","useful":0,"cool":0},"h_XX-34fsIJm9hWHKJHYnw":{"text":"Classic diner with a warm and hip staff. They do a nice catfish and serious blackened peca","useful":0,"cool":0},"TLe2PLRcglU7PQ7rm0U-ew":{"text":"We spend a lot of time in New Orleans.  I was looking for a new, inexpensive place to take","useful":1,"cool":0},"G6dTg44xOvikCObc7095CQ":{"text":"The food was amazing. I ordered the Muffaletta sandwich and it was delicious, the deli cut","useful":0,"cool":1},"_WOaDZH7sDGuMKcyXXRNsw":{"text":"I understand it was Mother's Day when we went there, so a crowd and wait was to be expecte","useful":2,"cool":0},"0_xlmmLUQfeG5geYABoisg":{"text":"This is a great diner. The food w came out fast and it taste awesome. I had the simple scr","useful":0,"cool":0},"bA7nL0Fjv4RzrTyOa6xjyQ":{"text":"Life changing pancakes and the chef's special omelette is equally impressive! I ate here t","useful":0,"cool":0},"pvuk5B-s1GqntjlITUIfVQ":{"text":"Went here twice on my recent visit to New Orleans.  Had to try the burger and it did not d","useful":0,"cool":1},"xOaUaa3LiuvvSOIFSW3LNQ":{"text":"Great little dinner in the French Quarter.  I had the cheeseburger and cheese fries and it","useful":0,"cool":0},"qEyRAk7zbm01xja835P4dg":{"text":"good food, good service, good prices and great atmosphere.\nif i want a basic breakfast in ","useful":0,"cool":0},"2a_JjEbicAzhbWx0UT9nUQ":{"text":"Review is for the omellete and experience. My friends and I all got omelettes and we all t","useful":0,"cool":0},"7R32EwHc-ROEP2zumQTBrQ":{"text":"I really wish I could have had breakfast here but I couldn't get in. The line was long but","useful":0,"cool":0},"LAUAGPPLKjqpzrNKJhIZDw":{"text":"Wonderful burgers in an old-fashioned drugstore setting.","useful":0,"cool":0},"S1LJUIRVLEIGABBBjGbufg":{"text":"Frankie, you really make this place! Great spin off of diner feel. I ordered gumbo, waffle","useful":0,"cool":0},"PW-4mvGJmigko9E0Jo-1OA":{"text":"There's nothing like  a trip to NOLA and a visit to the grill. The perfect weekend hangove","useful":0,"cool":0},"oQIP42fTgLgh1DJYRGkFQA":{"text":"Go for the people and the ambiance. Our amazing server had the whole place singing \"If you","useful":0,"cool":0},"wGOMeyke7lBAr9kgVrSkmg":{"text":"I'm really sorry, but I must say that my Po sandwich was disappointing. It seems it takes ","useful":0,"cool":0},"yWg0e5L2YGFaADlzpWoDfA":{"text":"Love  this place!   Breakfast is fast and delicious!   Super friendly service. All open co","useful":0,"cool":0},"kkm63p0npYTA5WZCym246A":{"text":"The food is great, the servers are hilarious, great bang for your buck!! This place is a m","useful":0,"cool":0},"-CmT94iSqCLEUWwcYHgh1Q":{"text":"I love the food and staff here!!\n\nEverything here screams New Orleans. \n\nNothing fake or p","useful":2,"cool":0},"2iSF5BF5eQPkFOiUC7Lmdg":{"text":"Great breakfast spot in the French Quarter! I had the South of the Border omelette. It was","useful":0,"cool":0},"ZAKRycaSS3-o5RPokN1aJg":{"text":"Like bowling pins, we lined up and struck down an assortment of New Orleans legends on our","useful":2,"cool":4},"hlocrUBmmukjYxCP2809aQ":{"text":"The staff was wonderful & friendly. if I lived near by I'd be here all the time. I had the","useful":1,"cool":0},"XGv5g1PJrvjxjAZ7b8IrbQ":{"text":"This place was great, true diner food.  We stopped here on New Years eve after the ball dr","useful":1,"cool":1},"ipzoO2M_iPh_aOYVONi_dg":{"text":"Love the food and the atmosphere.  This is a true diner.   Our food was fresh and very goo","useful":0,"cool":0},"ojm5aGn2KlvJhvS7R9rccg":{"text":"This is hands down the best palace to eat in the quarter. Sure there are swankier places t","useful":0,"cool":0},"XsNMyklUMkSOlDcC2HpscQ":{"text":"Small, may have to wait. Old time diner. Loved the ambience and food.highly recommend","useful":0,"cool":0},"uOa9dqvzYXVkgdWRciVIHg":{"text":"I loved this place. The experience was extremely charming; the banter between the waiters ","useful":0,"cool":0},"TaD_tKUc5xhsFNfxmRxrkQ":{"text":"Food was Awesome! Recommend the waffles, they were great! Long line but moved quick to acc","useful":0,"cool":0},"Pvyjb5JUdbi-jIQ_o4KWDw":{"text":"Dinner and a show! The food was great and the staff entertaining. Service was good. Our fa","useful":1,"cool":0},"j6KGy_I2d4xw9sNp9nSqJA":{"text":"Great food and atmosphere! You can watch the Cook's make the food as you sit at the bar to","useful":0,"cool":0},"AB4PqI_bRx2xElGzWAkT3A":{"text":"\"LU\" short for lazy! Complaining and threatening, \"This is how it's gonna be..\" and don't ","useful":0,"cool":0},"UpGeRRmA5uLFowTS90biBw":{"text":"Waffle House New Orleans style.  I had a BLT on white bread and my 9-year old ate chili-ch","useful":1,"cool":0},"aiCaffvIFe-YOEEDpVEx8Q":{"text":"All you 5 star must have Been drunk when you went there. Lol.\nThe food was good and worth ","useful":1,"cool":0},"0WY08G2BMKsl4VLaB5lYrA":{"text":"I would give the food 3 stars but the atmosphere and staff bump it up to 4 stars. It was f","useful":0,"cool":0},"WrjWuVtgBtzJB6zp7m0iDQ":{"text":"amazing for breakfast. if you like diners you'll love this place. great service.. very fai","useful":1,"cool":0},"R_casGATWc6fSUQs_35EgQ":{"text":"When you are looking for the real. deal comfort food this is the best breakfast and late n","useful":0,"cool":0},"i3dkdsWFSX33HstmaBA8nw":{"text":"The breakfasts were great including the nutty waffles and pancakes and at the right times ","useful":0,"cool":0},"k_eFGV6nxoJAHPyk9h1v4A":{"text":"Waiter was a character ( Peanut) awesome jokester.  Breakfast and a show. Portions are big","useful":0,"cool":0},"wE6FbZ4W466oUMuQLGgGwg":{"text":"The diner was old school and really cool. 4 stars. The food? The service? I had the Reuben","useful":0,"cool":0},"ulITnCnQrEChKQRF0tKEeg":{"text":"Happened on this place by accident and stopped in as it was packed with people for breakfa","useful":1,"cool":0},"vnPLf-WM_Mvj9Drz4u6jQA":{"text":"Great breakfast for a great price. Rare to find value like this in French Qrt. Diner setti","useful":0,"cool":0},"FK6PNsHF1OMqSkKtI9mGcQ":{"text":"Chef's special omelette is the no brainer breakfast hangover cure.","useful":0,"cool":0},"r6VHdS1Nyci2mUKmEMPDMw":{"text":"Holy Crap! I LOVE pecan pie! And it turns out, if you fry pecan pie on both sides and add ","useful":0,"cool":0},"8uAYPNGYppwnJuCIMndMrg":{"text":"Corned beef omelette came highly recommended and it did not disappoint.  Prices were very ","useful":0,"cool":0},"7CsdHG-31N5tkLqA8KC8JA":{"text":"Counter seating only! It gets busy during breakfast and lunch hours, so if you don't have ","useful":0,"cool":0},"-EYHYQB4ZVDch7r9qW3zKw":{"text":"it was a little hard to find this place because the name on the window wasn't actually the","useful":1,"cool":0},"-myggrjLhKmKGjq7eXKKvg":{"text":"Exciting....a new Camellia Grill in the French Quarter! It just opened in November. \n\nIt's","useful":2,"cool":1},"ULd9J_Xn_SSMRLCsD4yk_A":{"text":"Great grill. Breakfast any time. Excellent service.","useful":0,"cool":0},"Rfp_tIfXTtMMdnj0zEjszA":{"text":"Best omelette I've ever had in my life. Make sure peanut is cooking because he is seriousl","useful":0,"cool":0},"JaIk6tMi_ip6oAWd5e69dg":{"text":"Fantastic food! Inexpensive and delicious. Service is lively, friendly, fast and very ente","useful":0,"cool":1},"ZDNmCGJ_BXelUN1_s-rIAQ":{"text":"Fun, easy, good food, and cheap!  Some of the best service we have had in the 4 days we ha","useful":0,"cool":0},"R22NhDBrD9_z3ag-B7E0dw":{"text":"Great breakfast food and awesome service- diner type counter seating (i'e side by side).  ","useful":0,"cool":0},"9trgodbBXqvLiLVHUT1BLQ":{"text":"We had a great time here. It's not always convenient for large groups, due to the counter ","useful":0,"cool":0},"sdz1mYZ8wfLJHVweK3Nb4g":{"text":"Can't even give a review on the food. Showed up 40 minutes before they closed, started.  T","useful":0,"cool":0},"jIp2lj0TsXTJf8LZa8VYtQ":{"text":"Good breakfast food and quick in and out. Everyone is very friendly as well. Got breakfast","useful":0,"cool":0},"KbYJmCzuLJj11s8wYAoQDA":{"text":"If your looking for breakfast then this is the place to go...I love the set-up here and ho","useful":0,"cool":0},"0_0l7jqTpoPVcc43cz0ufQ":{"text":"Love this place!!! From the staff, to the food it was an overall great experience. As a fi","useful":0,"cool":0},"8oOTJD2729FAWDk_sdXV8Q":{"text":"This place, for me, wasn't all about the food, though it was good. I had a cheeseburger.  ","useful":0,"cool":0},"3dUVo1ji9ZemkInKpiVelA":{"text":"Bummed to have started the end to my NOLA trip here. The line was long so I figured this w","useful":1,"cool":0},"5UxZi-Yv43hIG1rcCj8rBA":{"text":"If you are looking for a good bargain in the heart of the French quarter.. This is your pl","useful":1,"cool":1},"fRIW-NYiRplDsrbYsqsrmg":{"text":"I must say I prefer the uptown location however it is almost as good. Camellia Grills has ","useful":1,"cool":0},"mwLQZP5vp7jJW-bSWK9ocg":{"text":"This might have been the most fun place I went to eat on my trip. I only stopped in for a ","useful":0,"cool":0},"55k6gOT3zoGRewQD-oSEMA":{"text":"THIS THIS THIS! IS what a restaurant is supposed to be like!! CLASSIC diner food! They wer","useful":0,"cool":0},"Xq5Y7iwNkJ52J6htUg-4fg":{"text":"A great place to get some breakfast. Definitely a unique experience! Service is amazing an","useful":0,"cool":0},"ehIuRCekPJtc5DWgSp4saA":{"text":"Ended up here, instead of New Orleans Hamburger and Seafood which didn't have good reviews","useful":0,"cool":0},"tdRX_p_UV46Wff2q6-49MA":{"text":"Three stars because of very very very slow service. Food is average. Took forever to get a","useful":0,"cool":0},"9Ayc6NZ_1RvfGQ46t_Itig":{"text":"Si te gustan las hamburguesas en lugares tipicos, no dejes de ir. Es interesante estar sen","useful":0,"cool":1},"QkXcOgYlYorOQ9QPidAPug":{"text":"Had the double bacon burger with fries and a milkshake...service was great! Only wish I ma","useful":0,"cool":0},"-TlCMBEA05UD5kRx4fTqiA":{"text":"So apparently I had my Po Boy \"the Word\" HOOD STYLE!. That means you add cheese and a frie","useful":0,"cool":0},"XSJF4FRUmuNRoZL_jpf6Mg":{"text":"Perfect greasy spoon diner. They do all the classics very well. Pretty standard breakfast ","useful":0,"cool":0},"lSSGM3HF5GND8sNoayMQuQ":{"text":"Came here for breakfast as soon as I and some friends got to New Orleans. As soon as you w","useful":0,"cool":0},"JLClLK8kRKleJCSi-2vIcg":{"text":"I don't get the hype. AT ALL. Boring menu, Boring, overpriced food. End. Of Story. Pass.","useful":0,"cool":0},"RnXKquAooZ6kexdFsKTQVg":{"text":"Counter service only.  Service is pretty quick.  Food is delicious if not a tad greasy.  W","useful":1,"cool":1},"jSeLVEEWaT6pJfAXtIa_xg":{"text":"As of 12/10/15, they are closed for remodeling. Looks like the legal woes over the Camelli","useful":0,"cool":0},"eWdc8Z-u8WvKwytilzoWEg":{"text":"Good food and fun from staff.  Too bad there's no music.\n\nMuffaleta is the best!","useful":0,"cool":0},"NMkIto4rAg-dflvBteTsEg":{"text":"After having my fill of Gumbo I came here for a traditional burger.  It's no frills but si","useful":0,"cool":0},"FhrYojO_NsInF1U4G4ZJ6g":{"text":"The food was good--not necessarily hair-on-fire-zomg great, but very good. I had the muffa","useful":1,"cool":2},"GUVH71DB9NimeLDO9kbmnw":{"text":"Like someone else here, we ended up eating here twice on a 3 day trip. Perfect breakfast s","useful":0,"cool":0},"RLhZBzUptR0DojAW5H-B4w":{"text":"Great place and great - and funny - staff, singing Stevie Wonder. Nice breakfast and lunch","useful":1,"cool":0},"kR1OxFHXw_EDmHeg7txCDQ":{"text":"Went here because of a recommendation my neighbor had and glad we were able to check it ou","useful":0,"cool":0},"uKa31d2l-yAKx132TgF53g":{"text":"Great dining experience.  Interesting to sit at the counters...no tables.  We went for bre","useful":1,"cool":2},"xyERA3xUyxU35QBkIixV1Q":{"text":"An old time southern diner where everyone's your friend when you walk in! The food is stan","useful":0,"cool":0},"X1lr2ZpbojXsq5FAZzbf4g":{"text":"Good for grabbing food on the way. Not good enough to come for this place from far away.","useful":0,"cool":0},"fs6tLt3PMAYxS8nFwdSsAQ":{"text":"Meh.\n\nMe and my friends were going to dine at Chartres House right across the street, but ","useful":4,"cool":1},"zUqM6QlIvL6r4UV7mKJWag":{"text":"Came back just for the chocolate pecan pie. Love the food and the people. If you walk by t","useful":0,"cool":0},"LizQuQF-NHhZDy4LMLOd5Q":{"text":"Eating at \"The Grill\" was not the original plan. We walked blocks away to an Italian resta","useful":0,"cool":0},"u3MVMLxGZXkIm-O56y4VIg":{"text":"The customer service here is amazing !!! The staff is very friendly and outgoing. The esta","useful":0,"cool":0},"IgbAziJheYdAre0Lej8yCA":{"text":"Great food. Crappy service. Maybe it's a NOLA thing. I'm from the west- vegas area... we t","useful":0,"cool":0},"uHuIu9jPtgAvVfwHlg7Lqg":{"text":"Quite authentic diner atmosphere, friendly staff, maybe to much backslapper. The burger ar","useful":0,"cool":0},"KQqrAKiUoO-yYVJ0X5xkeQ":{"text":"We had a great breakfast with fabulous service. My wife and I had the pecan waffles with b","useful":0,"cool":0},"mlz7XRAwzcGOpNRJ4Aj1CQ":{"text":"Really nice people!  and the guys in the back are super efficient as well.  I had the gumb","useful":0,"cool":0},"R0QOZth6MePVNFUmibBdFA":{"text":"Good basic breakfast. Fun to sit at counter...amazing they can serve 3 parties at same tim","useful":0,"cool":0},"9E1WIxe7VwpfjUHIDr7rzw":{"text":"Great diner experience,  staff is entertaining and super friendly. We had a great experien","useful":0,"cool":0},"mbf1j4EUOC8RuyhVqMS5JQ":{"text":"If you just want a good, old fashioned burger in the Quarter, this is the place to go. It ","useful":0,"cool":0},"K9xIEnrN1OxFK_mg66klDA":{"text":"Best brunch in Nola! Good service and a very complete menu. The place looks clean and tidy","useful":0,"cool":0},"d5PL9rNTJLPaF-Fs0ipExg":{"text":"This place is a pretty run-of-the-mill greasy spoon, but with a cool double sine-curve cou","useful":0,"cool":0},"HtnXrz2Jd3O9acJ-vwb_gw":{"text":"Great way to start the day, a full stomach and lots of laughs. The crew had the entire pla","useful":0,"cool":0},"cOHwO5lrjYe1D0d0p6L6dg":{"text":"OMG my first Yelp review and I needed the inspiration from The Grill.  Never tasted better","useful":0,"cool":0},"ARVQIq0zG6wa1Nw05hFrjg":{"text":"Wonderful food Great atmosphere. I came in at night when it isn't quite as busy as the day","useful":0,"cool":0},"xpSa500oH7egUiYmmEbnyg":{"text":"Amazing diner with some of the best food we've had in NOLA. Kids loved sitting at the coun","useful":0,"cool":0},"J3dfyntUubiOaXgQOsz3sw":{"text":"What a great little place! Give your wallet a little break and stop in for a delicious bre","useful":0,"cool":0},"R6-OkhJyGrzBsJBl7UIwOw":{"text":"Guess what? I'm a tourist and I went here.  Many tourists do.  But I wouldn't go here expe","useful":0,"cool":0},"a1Pr_z49Oajk2nJ_m0bRPQ":{"text":"This isn't a place I think you come to for customer service.  A man acting as host asked h","useful":0,"cool":0},"6Bgwqz4KDrTgJvzMjG3Ugw":{"text":"OMG!!! This place is CLASSIC old New Orleans. NOW I feel like I've tasted and heard New Or","useful":0,"cool":0},"SlGerLfp3FLT1Taedgqd7Q":{"text":"This is a classic New Orleans food stop! It feels like New Orleans. \n\nThe staff are friend","useful":0,"cool":0},"dqLhF_eaTCcNI6S6_JLUYA":{"text":"Excellent service and great atmosphere. A definite must for straight up good ole home cook","useful":0,"cool":0},"R17QlluKo2hMeCO63Mydzw":{"text":"We broke our traveling rule of not going to the same place twice- this was our first step ","useful":0,"cool":0},"KNoJ9XXSgnMALNweuLDnNA":{"text":"If you're looking for a greasy diner, this is your spot.  Food was average but great atmos","useful":0,"cool":0},"cc-spixQY3pNXH43mdNnjg":{"text":"Loved the Grill!  Perfect breakfast stop. The atmosphere is great. Ricky & the crew made o","useful":0,"cool":0},"bD0XGko7aYXMzkzMoN5FRQ":{"text":"Great service, great food. Had a syrup dispenser filled with melted butter for the pancake","useful":0,"cool":0},"Anmtbhp_4Nhz1ntZ0lZqyg":{"text":"SO SO SO SO GOOD!!! Our waiters were so friendly and welcoming. The food was affordable bu","useful":0,"cool":0},"WCHy4idiowPYpc9XKEjWUw":{"text":"Small place but the food was fantastic. Staff is absolutely wonderful. It's diner style ea","useful":1,"cool":0},"UFGshYNm3Bx3fxwIHQ2fDw":{"text":"First of all the setup and very retro which make this place pretty unique. The burgers on ","useful":0,"cool":0},"8JB1SUmnG8dOZz30pHiVJg":{"text":"Thank you yelp for leading us to this little gem. Everyone sits at a counter, sort of in t","useful":0,"cool":0},"pc_Ukgu8c3ChjVO--ladlw":{"text":"A sweet throwback gem to old nola. Simple old school diner - not an imitation - complete w","useful":0,"cool":0},"uAAdigIXJ_owhb3WOjHHRw":{"text":"Joey is great, very entertaining. Food is fantastic. Best omelets in town. A must visit.","useful":1,"cool":0},"TBUBGXl_wPozAQV_wTEvJg":{"text":"The shrimp were fantastically seasoned and the meals were anple for the price. We dined in","useful":0,"cool":0},"jhi-n_yCYrFFb3mofTtLTA":{"text":"This place is awesome.  The service was the best I had by far during my stay in New Orlean","useful":0,"cool":0},"oLLEaaRimOrY6Nm1AAJgHw":{"text":"The burgers were very good and the staff was friendly.  My son is allergic to dairy and pe","useful":0,"cool":0},"1aQAPX5Pf7pfxeOyNEp4HQ":{"text":"Casual diner, great food, good crew.  Friendly environment. Pecan Pie was unbelievably del","useful":0,"cool":0},"PIIjj6aKMDlP92w5H9uqcg":{"text":"Wonderful atmosphere. Took a 4 year old and 6 month old and we loved it. The cooks were fu","useful":0,"cool":0},"IVFDRpQuXE8vigooAUHURg":{"text":"Love the funny & friendly staff members. One of the cooks told jokes the entire time we we","useful":1,"cool":0},"xfDq-javbaFK1smjMyflDA":{"text":"Found this on Yelp and it sounded like a diner - and it was!  Came in here for lunch.  Eve","useful":0,"cool":0},"lXM9mXGOsaBJJJsq_XbZKA":{"text":"Love this place great \"day after\" food \nLove peanut  entertaining crew here \nI just saw re","useful":0,"cool":0},"EjjmyoNM2QTpcjFfvbBIKg":{"text":"I love seafood. Taking a break for a real southern diner experience was no disappointment ","useful":1,"cool":1},"45nbeHEKE8J1B1yILqRzYg":{"text":"Great for an old time feel and greasy food.  The staff were wonderful and funny.  The food","useful":0,"cool":0},"QtsbyjR8Ul-W0StzrUyUkA":{"text":"Get the double cheeseburger. It's juicy, messy and covered in melted cheese. It's the ulti","useful":0,"cool":1},"1ELh2Qxb6L-4C4A9SyI9Kg":{"text":"I love New Orleans/Southern Cooking, but I'm not just into the fancy, over-priced, and pop","useful":0,"cool":0},"9mWK-3jbiAOrjcHI7E8Deg":{"text":"Good spot for burger fries or breakfast. Friendly quirky jokes everyone friendly. We order","useful":0,"cool":0},"HJ0ohOHeSCuEMtQqpf4jzQ":{"text":"I thought customer service = one of a kind, outstanding experience.  Penut (as it's spelle","useful":2,"cool":1},"-IKtpWbIpI-w5J08WBXECA":{"text":"Good little hole in the wall style place. The burgers were good. The beer battered onion r","useful":0,"cool":0},"ceU4vpYBO43J6ZOqEMs59g":{"text":"Great food! Great atmosphere and great prices for delicious food! I was too hungry and gre","useful":0,"cool":0},"vY40hIbarJ7Ti2sk8k4T_Q":{"text":"Camellia ist ein Highlight in der New Orleans Gastronomie. \n\nWir haben das Restaurant(ähne","useful":0,"cool":0},"63hzxDe8IbBT8HsVSVejQg":{"text":"I just want to say that the staff is super sweet and super friendly. With that being said ","useful":0,"cool":0},"Dw0jKhyz6bcavcxR-tpWTg":{"text":"I'm surprised that they don't charge an entertainment fee! Went here for breakfast, never ","useful":1,"cool":0},"0eLDBMkZCzrznuF-xRlzgg":{"text":"We are here several years ago and we were looking forward to a late night bite. The Ruben ","useful":0,"cool":0},"PHmn7eAfaOpaGPJp5PVNEQ":{"text":"Awesome place for breakfast.  Fast service.  Good food. Nice atmosphere. Clean and courteo","useful":0,"cool":0},"SJbOMcKC2ZExI2XmTXfugw":{"text":"OMG Highly Recomend! The food is awesome and the wait staff are wonderful! It was a joy to","useful":0,"cool":0},"UXTW9wDx0F9k9VjZoT13Ug":{"text":"First of all this place is open now after a recent renovation.  I have gone to their uptow","useful":0,"cool":0},"5RvkEMIvZ2mXdMnsM9BTzA":{"text":"Casual and a little kooky--but the gumbo and pecan pie that we tried were both top notch.\n","useful":0,"cool":0},"6MAT53RIiIUfGmbdfZNH9Q":{"text":"Unexpected place to duck out of the French Quarter craziness. Steady flow of customers wit","useful":0,"cool":0},"qZZBsJN3w1NA_hDSI2qytQ":{"text":"Great diner style breakfast, love having a hamburger after a night of drinking. Service is","useful":0,"cool":0},"78nJlngeBZVO9j1mDyIXSg":{"text":"The wife and I got a couple of grilled Rueben's and hash browns for breakfast and they wer","useful":1,"cool":1},"TLVCXkdlRmLLPxakZCTsTQ":{"text":"It's pretty standard stuff. I wasn't overly excited by the menu. It's a cheap meal. \n\nWe w","useful":0,"cool":0},"Tm3Ko_JhHzNLPtRbH_PKAw":{"text":"Ate Family breakfast this morning with two hungry teenagers in tow. We all left full and s","useful":1,"cool":0},"NbJ3kf9O8gFUQfUqPAcLcA":{"text":"We saw the cook handle raw chicken, wipe his hands on a towel, then continue to handle oth","useful":0,"cool":0},"HAKExpM0BIzWTh1OqV1QDQ":{"text":"My friends and I all loved this place! It was the perfect spot to go for breakfast. I'm on","useful":2,"cool":0},"jO5U_y40vgwkSznrdUlxfw":{"text":"Its a greasy diner!!  Food is tasty; what you expect at a made to order diner.  Historic l","useful":0,"cool":0},"4UEuIwaOKhcKvuXVT7_2nQ":{"text":"We wanted to head down to Ruby Slippery while in NOLA, but did not want to wait in line fo","useful":0,"cool":0},"Mw4BZR5Yue58lMkP7hbopA":{"text":"I absolutely loved this place! The men working there are hilarious and laugh and joke with","useful":0,"cool":0},"8f2DhcoTj65i8l1mWb9sBw":{"text":"My coworker and I stumbled upon The Grill as we were looking for another establishment.  A","useful":1,"cool":1},"pJXYfOdlOeus6NaGxTElHQ":{"text":"Ho hum. Rude staff, burger doesn't come with fries. A dish towel placed on the bar to catc","useful":0,"cool":0},"vbC1KELPrrxAc3SYVF0syg":{"text":"Unless you're expecting more than an awesome diner in the middle of the Quarter, you'll wa","useful":0,"cool":0},"XA4sZoQ6CrA59h604MeUww":{"text":"I remember the Camellia Grill on Carrollton years ago when still lived in New Orleans fond","useful":1,"cool":0},"LFh5nu82LpRY89fvzBkaIA":{"text":"Its just good food at a reasonable price with good portions. Definately has a flair all it","useful":0,"cool":0},"6jqvkFrvwBOp9rpxb-lfrQ":{"text":"Breakfast, lunch or dinner for a true new Orleans diner experience! The food is just as gr","useful":2,"cool":2},"V76gJvlZIUQg19XmvG1XlA":{"text":"Forget about going to the other breakfast places.  This one got it all. Food, bloody marie","useful":0,"cool":0},"uIojm8xopP8J57QyUEQ5Hg":{"text":"Service: 5/5. We came in about thirty minutes before they closed for the day at 3pm, and t","useful":0,"cool":0},"iJsSYQOf4uQhEAzbKTnZiw":{"text":"The server was extremely rude. I ordered a simple breakfast that included a grit. Had to a","useful":0,"cool":0},"IHvTQji5V-vBhaKLgLKFHg":{"text":"Extremely rude staff. My boyfriend and I left the newer French Quarter location to go to t","useful":0,"cool":0},"WffpyN7mSyjrhyKCEk5KzQ":{"text":"Really friendly staff. Good food. We had a great lunch before leaving town. Love the old t","useful":0,"cool":0},"i5TM94CA0k2wCqW_8jhkwQ":{"text":"For the French quarter I'm giving this a four but in real life i would give it a three. We","useful":2,"cool":0},"VUDkvzUcyrWr_IYj1q4L0A":{"text":"The staff here were very cool & funny!\nMy 2 girlfriends & I all have different palates  so","useful":0,"cool":0},"KqGsYAcA97tFlxeGUDekfw":{"text":"The reviews of this place are as entertaining as the place itself. It's not a place to go ","useful":0,"cool":0},"7NUQyBeCjdVjhS2hizvDSQ":{"text":"Nothing really special about this place, kind of a wasted meal for us. We intended in goin","useful":0,"cool":0},"sH1revTZxgX_D0HMl2W91w":{"text":"Awesome breakfast experience, especially with our server, Ronald 'Lu' Gaundry - ask for hi","useful":0,"cool":0},"wahM5bauTDvZkjNmU5VmJw":{"text":"Yes Yes Yes.  After a long night of partying in the french quarter, you are going to want ","useful":0,"cool":0},"8DUvMKhPr0l4oq6FQLtfNg":{"text":"Really great. This is a burger place done in a luncheonette style.\n\nNobody knew how old th","useful":0,"cool":1},"rs0dJQlAs8uzvj4NMMJzyQ":{"text":"If you want to spend lots of money for great food in Nawlins, go to NOLA, Mr. B's, Command","useful":2,"cool":1},"eTmt3-PMnUmk_iEEdp1hIw":{"text":"Great service, which made the food even more delightful. I had the Camellia Muffaletta. It","useful":0,"cool":0},"jVQL_25X22Jx4_d0XU1T1w":{"text":"If your in the French Quarter and looking for something to eat that is not Cajun or Creole","useful":0,"cool":0},"KGoOdTjEa1KDJ9uABCoZ1A":{"text":"Because I can't leave zero stars: I was on my way to eat at The Grill based on Yelp review","useful":17,"cool":1},"iq2OdElniomFJAUp5N3iiw":{"text":"Super tasty food at a super tasty price. Loud exciting authentic environment. Not for thos","useful":0,"cool":0},"q7hz1LLp-kcuhGzGvlsp2g":{"text":"The grill has one of the best real fast experiences in the french quarter. Believe all the","useful":0,"cool":0},"NlRnNVFfVOOhJALKOI1QyA":{"text":"My wife and I popped in for lunch. It is a 50s style diner that offers breakfast food burg","useful":0,"cool":0},"KrusiTjVIdYN9ZzNpEP9wA":{"text":"Breakfast diner in the French Quarter. Went during spring break and there was no wait.  Gr","useful":0,"cool":0},"Xd58ThBY5jYF3Z0VNaFCBA":{"text":"Such a pleasant surprise.  Wanted a quick breakfast  and had the catfish po boy which was ","useful":0,"cool":0},"6B31EszDxZNPq8xGR3eOYw":{"text":"This place is a different experience, awesome place, very unique and super friendly staff.","useful":1,"cool":0},"s5w6TGsf7TejtKm9EV0rKw":{"text":"Delicious as always!  The bacon cheeseburger and chocolate freeze was super tasty and the ","useful":0,"cool":0},"ZgzrJFU5zxhxradOl-uJXQ":{"text":"If you want cheap eats, then go to The Grill. It's set up like an old 50's diner, and part","useful":1,"cool":1},"3ZRL5MzgT7W4buT-_jCsrA":{"text":"Long line, but it moved fast. I ordered the Manhattan omelette, and was served quickly (wi","useful":1,"cool":1},"_sbEd8zT-c074UEuV7HTDw":{"text":"What has happened to my favorite counter grill in the world?\n\nSince I first discovered thi","useful":2,"cool":0},"W3efq5LTFk2_6-ayFi8QEQ":{"text":"Definitely a fan !  When you enter Camellia Grill you do feel that you are back in the 196","useful":0,"cool":0},"-UC2MB9XfB4Yk8aySiK9gg":{"text":"Great place!!! The staff is so friendly they can even be competition to the food!!\nWe orde","useful":1,"cool":0},"bFyzrRJlsD3qgaPDxPxxQg":{"text":"You should religiously eat here your last morning visiting NOLA on your way out of town. I","useful":0,"cool":0},"9urVqmojttxhKGcUStJXXg":{"text":"Such a great breakfast experience.  Quick service and good prices. Definitely coming back.","useful":0,"cool":0},"U_STn1OSpg8idQ0iYVBoIg":{"text":"Sit at the counter and watch breakfast cooked with fresh ingredients right in front of you","useful":0,"cool":0},"SwNbeonmGTfTbcLS41aEUQ":{"text":"Good diner right in the middle of the French Quarter.  Good food and service.  I had the c","useful":0,"cool":0},"48Ysk92dgztqIRZ9txNmVw":{"text":"Not fancy at all. Just counter seating. The pecan pancakes and omelet were great. It was v","useful":0,"cool":0},"ezdQ32zTNzMLfJdsblU-aw":{"text":"Was in search for some good hash browns and some eggs. Ordered the breakfast po boy with a","useful":0,"cool":0},"arJyOCdngGkezisBh4L_PQ":{"text":"So first off I asked names...Big Lou and cook Randy.   Great!!!  Now this review is based ","useful":0,"cool":0},"XA-QodNGTQI--s7P6biEPA":{"text":"What a great find.  Chef's special was amazing and honestly enough for two to share. Hash ","useful":0,"cool":0},"YiS4KG9hNTKZdXtubvxA2w":{"text":"Po boy could have used more meat but bread was wonderful and diner ambience very enjoyable","useful":0,"cool":0},"XEalqOqaqwZf_5T1M8lIPw":{"text":"Simple but great food.  We went on Thanksgiving day because they had no set pricey menu. W","useful":0,"cool":0},"rIthpBq2_1PXUNxsE8RBuQ":{"text":"Good food and great waitstaff. They were fun and personable. So glad we asked for recommen","useful":0,"cool":0},"cHGYlxw6ePXpyn-hGfDkNg":{"text":"Oh man, this place has one hell of a character working here.  \n\nDidn't catch his name but ","useful":0,"cool":0},"G8KPc5WgvjPNUmX2zCCgzQ":{"text":"I haven't been here in a few years, but when a friend asked for anything worthwhile to do ","useful":0,"cool":2},"VdQq2z6wytVOvcfWPxggxw":{"text":"The Grill is THE definitive diner in the French Quarter: simple, bar stool-style seating, ","useful":1,"cool":0},"CxWdK9pVH1jUrAyeDIAeIA":{"text":"A delicious blast from the past. Good ole diner food seated at counters. Super fast. Frien","useful":0,"cool":0},"0Mf29nHumXA81eLbyB3vEQ":{"text":"Excellent food, authentic bar style service, and they split checks! We went about 10:30 an","useful":0,"cool":0},"YJ4dabF-EXdfqweAALrOvg":{"text":"Probably the best place I went to during my visit to NOLA.\n\nI came here with my sister for","useful":1,"cool":0},"wmx6JP020uLuZHVtB_8Gzg":{"text":"One of my favorite Yelp finds from our trip to New Orleans recently (other than the swamp ","useful":0,"cool":1},"MwFlufVp2Uod7EZiEICRxw":{"text":"Such great food and a show at every meal. This is like an old 50's diner with great servic","useful":0,"cool":0},"sBXtnwBs-M625OPXDaHZMA":{"text":"We had the roast beef po boy and some slaw and Joey our waiter was super sweet and attenti","useful":1,"cool":1},"7XS62yCqNvEH_8L5K3BUoQ":{"text":"I ordered omelette and it was over cooked. It was brown instead of yellow and the hash bro","useful":0,"cool":0},"U-_U0zZbVWz9n92I71LkFQ":{"text":"great service, cute atmosphere, loved sitting at the U-shaped counters. decent food. had t","useful":0,"cool":0},"_ybxIY4pFsai-RlGi7e19A":{"text":"Awesome place with a fun diner atmosphere. Breakfast was good but I came back for the choc","useful":0,"cool":0},"ecGRtW8Zxrv1_DbHx4-ibg":{"text":"Delicious food! Little bit of everything on menu. And Fun Friendly servers.  Don't let the","useful":0,"cool":0},"A0GftHKMAoFj82rq8jDO9A":{"text":"I'll keep it brief - this place is a must-go for brekkie, especially for visitors to Nawli","useful":0,"cool":0},"9Abxi-D5lEHe6Qbj4J8vqA":{"text":"This a small place, so can be a wait for a seat but it's worth it. Staff are great, really","useful":0,"cool":0},"EzywBqyc6Sz9aHmm09vrxQ":{"text":"They have cheese fries on their menu and they serve them like this: \n\nA plate of fries wit","useful":2,"cool":1},"9iRQa0kwrcIpR37IOey2bg":{"text":"Wow! Amazing place. Great service. Fun, not to be missed. The food is amazing and incredib","useful":0,"cool":0},"uA09dNiZ_FVAy90BCaEnoA":{"text":"This is my favorite short order restaurant not only is the food good but the servers are a","useful":0,"cool":0},"FWoIIe728TNHjjN3Wl6Fmw":{"text":"Will not go back. Worst service in the world. Insulted by wait staff. Told I could not ord","useful":0,"cool":0},"uFVoBhlo2-Hw5UgCNwrvKg":{"text":"Old school diner serving awesome diner food. I had the Manhattan Omelet- cheese, potatoes,","useful":1,"cool":0},"SbNRgTFvoFjUYXKkr9gszg":{"text":"You sit at long diner tables, kinda like Benihana's. The line sometimes can get long, but ","useful":0,"cool":0},"yl7nKVRV5QBa2Lp-2G952w":{"text":"So fun! We got the Mardi Gras sandwich and a muffuletta with the fried mac and cheese and ","useful":0,"cool":0},"A9mFDTylHZqOyf9dpMemHg":{"text":"I'll try to keep my review to a Reader's Digest version, but one of the staff members stol","useful":4,"cool":6},"WxnUDrB-rQTYsicR8Oe3bA":{"text":"Its part entertainment part dining when you come to Camellia Grill.  The staff is hilariou","useful":1,"cool":0},"SdFolqMDVzpPQULVdBg7uQ":{"text":"Great food... great atmosphere and out waiter, who refers to himself as a senile senior ci","useful":0,"cool":0},"vpH2gyG4P2cCNAZB8MQ4ew":{"text":"I don't know why our experience just was so bad, but it was. Food wise, they're food was p","useful":0,"cool":0},"b6NYdhiXqCnMaATcBxkJVw":{"text":"We absolutely loved this place. It's in the heart of the French Quarter, which means it's ","useful":1,"cool":1},"gaJrTahjVHA3GhFEGSt85w":{"text":"Chef's Special Omelette. Turkey, bacon, ham, potato & onions, American & Swiss cheese and ","useful":1,"cool":1},"3PQyOuE1iAIZDmty_AHvqg":{"text":"We had a awesome breakfast everything was prefect. And we were entertained by a very seaso","useful":0,"cool":0},"exgmq8zBODdeoU4uPi1aFg":{"text":"I enjoyed a Reuben in which the greasiness was of epic proportions; the accompanying onion","useful":1,"cool":0},"TkZnT1MwMdoIGSyBcAOChw":{"text":"Delicious breakfast! Great prices. Gigantic omelettes. I suggest the Manhattan.","useful":0,"cool":0},"qOqiVnTJsuHOx14V349aRw":{"text":"Stuck right in the middle of tourist town USA is a beacon of food brilliance.  This is eve","useful":0,"cool":0},"S3Gh1FnX7I-2SwbWmc1MbQ":{"text":"Chili cheese fries (with beans) are great and the vegetarian po-boy as well. Only setback ","useful":0,"cool":0},"lbgvNGMwLznlzoVn2_WI8w":{"text":"The omelets here are the best I've ever had.  The eggs are whipped light and fluffy, and t","useful":0,"cool":0},"-0nTLsZj1VaaUrZj3eOX0w":{"text":"It's a shame they won't allow a no-star review because that is what I would leave.  My gri","useful":0,"cool":0},"6NjZz-wnsb_cOxlf7a1iDw":{"text":"We went there twice during our trip. Such a great place for breakfast and food was so good","useful":0,"cool":0},"f5_pwfEi9CLH-mTWHB_nrw":{"text":"This place puts out what a burger and fries should be...simple, well cooked and definitely","useful":0,"cool":0},"9_tOXSyiLISuxeFFPhYrig":{"text":"A perfect place for a quick meal. The place itself doesn't look encouraging by any means b","useful":0,"cool":0},"mhjVy1GaOxm-sjqY4NotXw":{"text":"This place is great for breakfast. The nutty waffle is really really good. While you are e","useful":0,"cool":0},"ojhLbOWA3853T8tOukRzxg":{"text":"Wow. Great vibe. Staff was fun. Old school diner style with large granite counter and plen","useful":0,"cool":0},"I36bcN78-kKcEF9QYuKrow":{"text":"First time in New Orleans, visiting from Atlanta for all the Mardi Gras festivities. The f","useful":2,"cool":1},"Jn-pr2zyfeNzdU4_qYUKwA":{"text":"This is a great traditional breakfast spot. The food was delicious and the staff was frien","useful":0,"cool":0},"HdfM5CEcCfahSzBATElOSQ":{"text":"Come at night.. Packed during the day and staff is too busy. Perfect diner food...cheap, q","useful":0,"cool":0},"Ucy0i7uo8__fKbchxiUhig":{"text":"*Very* old-school diner with reasonable prices and servers with personality. Saw this plac","useful":0,"cool":0},"C-7Nqv36Rk_mJSpFj8IgGg":{"text":"Good for the tourists, but as a local, I've had better. Staff is friendly, though. I do mi","useful":0,"cool":0},"089VJY453gkq6DwRee8-jg":{"text":"We found the Grill while we were looking for a good breakfast place on a rainy day during ","useful":0,"cool":0},"vpH-zQ-vJ1YuMN2RNwqJSA":{"text":"Awesome breakfast and very reasonable for the location.  Pro tip: split an omelet and it's","useful":0,"cool":0},"MwgG_KbWNfIgeSwt7qNr3Q":{"text":"I work down the street at the Omni Hotel, so my co-workers and I frequent this place about","useful":0,"cool":0},"Lu3Uc-fJTNQYe0vyTYa5PA":{"text":"Love it! Burger was terrific. Fries were also very good. Onion rings not so much. The choc","useful":0,"cool":0},"eo7ZjxNdRbuAmQaLYkq3xw":{"text":"I came here just for a slice of pecan pie on a recommendation so I can't speak to the qual","useful":0,"cool":0},"61pGg5RhIXrF6XHuuSB_9w":{"text":"4/5 fool that i am\n\num. the chef's special. like whoa. the kitchen sink and all that malar","useful":1,"cool":0},"80GnkrcDhR9uqHoffJkIPA":{"text":"Don't recommend wasting your money unless you're desperate. Waitress was horrible and food","useful":0,"cool":0},"0OZa_01-U_OeOKBa_pMS9g":{"text":"AKA as The Grill. Locals called it Camelia's. Restaurant is a diner & very casual and invi","useful":2,"cool":0},"tGTz6xntcp3383TFjrvKig":{"text":"Oh my God! Favorite new counter grill anywhere in the US!  Johnny, Peanut and rest of the ","useful":0,"cool":0},"bHZBvRp4n5TPTsSldJdpyQ":{"text":"I had the BEST burger I have EVER had here. It was absolutely amazing.\n\nThe staff was supe","useful":1,"cool":0},"nvu0u8RTskvKk3Nlh3uraw":{"text":"On my first morning in New Orleans, I was desperate for a good old fashioned diner breakfa","useful":2,"cool":2},"TIQV5cHuKMQdSPlcNN2sLw":{"text":"Why all the angry tourist reviews? \n\nThis is a grill. A Grill as in old school neighborhoo","useful":0,"cool":0},"yO2QZbSb-7rph_grsJ0P2w":{"text":"I think camellia grill is this highly rated because of the personalities that work there. ","useful":1,"cool":0},"UfZihprl9tM71QPcIpOv4g":{"text":"Great service, good environment, tasty food. Skip the franchise chains and enjoy the local","useful":1,"cool":0},"BWnL-Slcfei2jr9S1-_Tvg":{"text":"This place is so cool and the food is fantastic. The servers are great and the people you ","useful":0,"cool":0},"FGh_quoLrH0dMvrhKLHSAQ":{"text":"I usually don't go to the same place twice when I'm on holiday, but I couldn't stay away f","useful":0,"cool":0},"rbA1a4JFKaeIBynhiC6M2A":{"text":"The best burger/best deal/best time you will have at a restaurant in NOLA. The staff is su","useful":0,"cool":0},"6t75UN7yDLdoqnarHurHug":{"text":"Closed up, moving.  Just stopped by and notice thanking customers on door.  Moving by metr","useful":0,"cool":0},"URHuz2X_aGJhlhhoDOZ6vg":{"text":"I had the corned beef hash omelette and it was over cooked.  Had a brown scale on the outs","useful":0,"cool":0},"VGCUzvaiMGlqNyLLLJuQRw":{"text":"This place was highly recommended and I am still wondering why...maybe their flagship loca","useful":0,"cool":0},"om1doPoz3TACa2VKBsZtlg":{"text":"Staffs and food was both good.  Came here around 11ish. Thought we had to wait for 40 mins","useful":0,"cool":0},"Q3JEY8QPnHc5QIsAELgvqQ":{"text":"Went for early afternoon lunch and was well worth the walk.    The food was good and the g","useful":1,"cool":0},"A8ocraxBu9fRYW5KpMkilg":{"text":"Old time counter restaurant with back home prices and enormous portions. The menu is your ","useful":0,"cool":0},"QpsDOrEstt0BFt2RezIQhg":{"text":"I was just reminiscing about my trip to NOLA last year and this place popped into my mind.","useful":0,"cool":0},"PEaF6UMgtMS4JWnzjhLMng":{"text":"This is the Quarter's Waffle House. The thing that makes this place is the waitstaff. The ","useful":0,"cool":0},"Rpz3ZNwMzUhXm_MnPuV6ZQ":{"text":"Waiters are a hoot. Had breakfast here and it was great. The hash browns were yummy - with","useful":0,"cool":0},"J_XRBGFmtk-Alzup-mOIdg":{"text":"Go peanut.  Great place for fun and food.    I had the chef's special omlet with the chili","useful":0,"cool":0},"sgHT6J147kYPboHvcEcU7A":{"text":"Down home counter dinner where you can't go wrong.  The basics are basic but good.  On a b","useful":1,"cool":0},"tNdTiKz0bUl58iXNEj8psQ":{"text":"Traditional breakfast served in an old time style diner by a top notch staff.  The menu ha","useful":0,"cool":0},"JAenvDjWwUolrkq0tRDHqQ":{"text":"Cute family diner with a simple menu, grilled cheese cheese burgers blts fries etc. Our se","useful":0,"cool":0},"O9DNBqgEVnuEc_i7YRMdNA":{"text":"Love love love. Always great food and service! A must when visiting New Orleans and wantin","useful":0,"cool":0},"06hLmHdUGY_5X2CsA-cq_Q":{"text":"Decent price, decent food, our waiter have a head phone on, but he get our order, ask coup","useful":0,"cool":0},"063DdxhN4QSkWlCD8uTLEg":{"text":"This place is good for what ails you!  Especially if what ails you can be attributed to yo","useful":2,"cool":2},"khcpNWGYllHItgz5JC5G0A":{"text":"Best grits I've ever had in my entire life. We were visiting from California and came here","useful":1,"cool":0},"TK-94feX2HwZz-wtIiGJJg":{"text":"Went on a road trip to New Orleans and as a Yelper, I trusted the reviews written about th","useful":0,"cool":0},"yzxa-Zc6F4bczRtatQrOmg":{"text":"Really great service, everyone was smiling and laughing and really gave a good vibe all ar","useful":0,"cool":0},"8vi-syNdDVJu3_FiuD1sbw":{"text":"came here twice during our trip.  once for dinner and once for breakfast.  the burger is t","useful":0,"cool":0},"Q-MhF97VYrP-bj7C1DAE_Q":{"text":"Love love this place!! So much fun as soon as you walk.. friendly, funny staff. Like a big","useful":0,"cool":0},"mNf20u3oLcMUWipq7y-Jmg":{"text":"Stumbled in here with my husband for breakfast. I was skeptical, however the dude taking m","useful":1,"cool":0},"y0cNv7Y06QxzMv74DoPj3g":{"text":"I just love this place! reasonable prices, the best Cheese Burgers!","useful":1,"cool":1},"Z8P7vvVFTeQpWWm0lANQWQ":{"text":"Figured it was pointless to ask for egg beaters and dry toast when I saw how much butter t","useful":0,"cool":1},"0rGkpRKx1GLwobKcCRNW6Q":{"text":"This place has one of the best cheeseburgers I have ever had in my life. I was pleasantly ","useful":0,"cool":0},"NsmXpOf4kjjiixbLui3v2w":{"text":"The food was so good we went twice in one day; breakfast and late night dessert. Our choco","useful":1,"cool":1},"PwMYcbk04vi0OmaonDh1UA":{"text":"Greasy spoon. Service depends on the server. Mr Fine was great with the ladies but if you'","useful":0,"cool":0},"7kvYWwCJoqyB_XyzPi_FhQ":{"text":"Good food and a fun place for breakfast at reasonable prices.\n\nThe counter setup is great ","useful":0,"cool":0},"VJKJmIkyId_yBKx4hkZDhQ":{"text":"Great atmosphere, the staff was personable, the food was great and awesome value. There is","useful":1,"cool":0},"6maMzdRUegg5jIdiwCpzFQ":{"text":"We thankfully stumbled upon this place by accident on our last trip to the quarter. Best g","useful":1,"cool":0},"vnK56OSpEAaO8udSuNk0dQ":{"text":"Great breakfast! Grits were fabulous and omelets were perfectly cooked and seasoned. If yo","useful":0,"cool":0},"Pqg1IAGFcTWC5TUjANLUKw":{"text":"Place was good. Decided to go here because the portions looked big and large. They were no","useful":0,"cool":0},"ShaXfnkVFAGOWxsVgd7B7w":{"text":"This is one of the best places in the French Quarter for breakfast or brunch. Last visit I","useful":0,"cool":0},"XveB9Gf8Pk_dT-7djPYw_g":{"text":"Probably the best omelette I've ever had. It was a great atmosphere and all the staff or f","useful":1,"cool":0},"5yk0epbXs0P0wW_M4V9WrA":{"text":"Went here while walking the streets of New Orleans. My girlfriend and I split the catfish ","useful":0,"cool":0},"8OC8KmWW7WwQ98q9S6U7gw":{"text":"Awesome down home diner. I love that is all counter service, and the food is just simple, ","useful":0,"cool":0},"ghVKsfn3hJiRj9fMDRpIpw":{"text":"I originally gave The Grill four stars after my first visit. After two more consecutive vi","useful":0,"cool":0},"gTac2qTEhOF4zJWzrYNV7g":{"text":"Really fun all counter seating. People are friendly and attentive. Seems like the locals l","useful":0,"cool":1},"0ejz2KfJMuES5gX6MbMExQ":{"text":"This seems to be a place locals actually eat in the French Quarter.  I did hear a counter ","useful":0,"cool":0},"Yvc4E_waBA-Ak3AaO1gXqA":{"text":"Came in on a Thursday late morning after a night of drinking with friends.  Very friendly ","useful":0,"cool":0},"T1nhseEdMX3whDdZEbhDtw":{"text":"Ate here for breakfast the last day in town.  Our waiter Joey was great.  He is what makes","useful":0,"cool":0},"i2kGc6uLfDLwJ6dYMyC8VA":{"text":"Opens at 8 enjoyed waffle and omelette Pancakes are very good here the staff is fun and fr","useful":0,"cool":0},"9nr6Heelswd5-XahehHdBQ":{"text":"I've been here a few times and it is a clear cut 3/5. I have no idea how there are so many","useful":2,"cool":1},"3C4l39D577ClrrCKDKkFAg":{"text":"I loved this place..I fell into by mistake an it was just a good simple cheap place to eat","useful":0,"cool":0},"zXfBRahFFSPSNSErCMjLzw":{"text":"Absolutely delish and worth the wait. It's counter seating so a little odd. Staff was frie","useful":0,"cool":0},"LkhQGMC7J083L0pkRCMySw":{"text":"Possibly the best breakfast places I've ever been in.  First off, it's all counter service","useful":1,"cool":0},"ZpU4LbQ1QpmtrvSpgp8ZOg":{"text":"What's not to love about this place? The seating is old school diner style. The service is","useful":0,"cool":0},"aWv7HHW6N6O0IfeNEs8CrA":{"text":"Fantastic burgers fries and shakes. Very friendly and fun staff. Great non seafood option ","useful":0,"cool":0},"JWl9YJQYM0c5rLwGcJGVCA":{"text":"Food is great. Cheap prices for the area. Quick service. Clean facility. What else do you ","useful":0,"cool":0},"nO91NhaJsY7HC9qGrnFQ_g":{"text":"Came here on a recommendation. All seating is at the counter. There were only two  of us s","useful":0,"cool":0},"Jh3X6qSSZNxWtCe7RMyVqA":{"text":"After a decade, I finally returned to NO and ended up here for brunch one day to check out","useful":0,"cool":0},"RTcW39Tq8Kd0zioPT4BxjA":{"text":"From other reviewers this is a rather recent addition to their restaurant on Carrollton AV","useful":0,"cool":0},"Si0sMr-p4oNmJ7IY2rNB0w":{"text":"This place was so freaking delish. We stopped in here on a hot day and it wasn't too busy,","useful":0,"cool":0},"JbLtcwnIEiiJjkahRL2wFQ":{"text":"Great diner food with a atmosphere that makes you feel like family. Everything we had ther","useful":0,"cool":0},"5z0xZTdPXUaRcmkB7qf-nA":{"text":"Great little place! Told about this place by a local man in our hotel. Seating here is at ","useful":0,"cool":0},"mbeTeZRBWE8S_lT02bbOVQ":{"text":"Love old fashioned grills? Outrageously good food? Classic Southern ambience? Tons of butt","useful":0,"cool":0},"49aFQ3v-4cYmqTIp8utOEA":{"text":"Absolutely loved this place...so much so, that I went in twice during my last 4 day stay! ","useful":0,"cool":1},"XgHVZA49qRvsnm4oBQ8eMA":{"text":"Camellia Grill evokes the \"Ain't No Mountain High Enough\" lyrics \"...ain't no mountain hig","useful":0,"cool":0},"WvO2F_UVkks8vvnMC9Os1w":{"text":"Sat down to eat, ordered, waited and still never got coffee when asked for.\n\nThe pivotal m","useful":0,"cool":0},"t93vHJ2alLstTCje1pQJLA":{"text":"This place is perfect to wander into after you've spent a few hours on Bourbon street.  Yu","useful":0,"cool":0},"vPnXztFYL8UAUizJRAXPiQ":{"text":"The guys working the French Quarter joint have always got the best attitudes.  Food is fab","useful":0,"cool":0},"MC8zq-GewBW7hVkP4wgr1g":{"text":"È un locale molto familiare. Una grandissima tavolata con sgabelli, si mangia tutti insiem","useful":0,"cool":0},"ciI7YrADD1tKYjiZOb5TVg":{"text":"Four stars for ambiance and toss back quaintness to the 50s diner feel. The gentlemen work","useful":0,"cool":0},"-ULPMfMhcPii_fzGXr4f5w":{"text":"Was walking past and decided to eat here on a whim - best decision I could have made. \nSwa","useful":0,"cool":0},"Ec45yUbZurz6IztYQsnh6g":{"text":"First things first. If you love real southern breakfast then you will be more than happy w","useful":1,"cool":1},"tBQT3mrYlX5k1ayehVOO9A":{"text":"The service was entertaining and informative. The food was good and fit the price. All in ","useful":0,"cool":0},"SFh2cwE76o9fjmtxvHGWYw":{"text":"Newly opened after 3 month renovation. Friendly staff. Best omelette (Mexican omelette) I'","useful":1,"cool":0},"f97zcEN-oIhcV3oWiZ3U1Q":{"text":"This place is bomb and if you don't give it 5 stars you're either crazy or have lost your ","useful":1,"cool":0},"Pul8DCKoeoRJWddn7KMC0w":{"text":"Wonderful establishment. Friendly staff and high quality food that's inexpensive. It's tru","useful":0,"cool":0},"mEGAYf2cVzklkyJ2lMP_2Q":{"text":"Ordinarily I'd give this place a 3 for food, but the experience is certainly worth an extr","useful":0,"cool":0},"Zp9ce-E5pCGW5t6iMW5YyA":{"text":"Great burgers, great fried mac n' cheese, and a decent gumbo.\n\nI was disappointed I missed","useful":0,"cool":0},"8mBYFmUrxVjfLmIBmCj_yQ":{"text":"Great breakfast place. Food was good and came out quick. Service was excellent. Great find","useful":0,"cool":0},"8EHWICkuKMbdtlXs3oY5vg":{"text":"The service was very good despite the fact they were training someone new. And this burger","useful":0,"cool":0},"oyTzTZTWM66yMNid-I2Dlg":{"text":"i realize now that i forgot to mention that the entire staff sang my boyfriend happy birth","useful":0,"cool":0},"gBpTXrWuGqjHvkyhQTlDfw":{"text":"After a few days of dining at Commander's Palace, Bayona, Brennan's, and the New Orleans c","useful":1,"cool":0},"zZawDHogC6O4RYqmL9THnQ":{"text":"Just a heads up. They change there name. The sign outside of this place says Nola grill. N","useful":0,"cool":0},"cinmWgEdWgHv0w4UBBOKXw":{"text":"It was my first tried n really Love their Gumbo! \nCrispy hush bown and bacan. Very busy bu","useful":0,"cool":0},"WvEERB9uc_68jc-HuzBfNg":{"text":"Get the chef's special omelette, you will not be disappointed. Ham, bacon, cheese, onions,","useful":0,"cool":0},"WJ88LyvmubWKHR4F7lHTMg":{"text":"Really good!!  Burger for breakfast was awesome.  Chili omelet perfection.  Worth any wait","useful":0,"cool":0},"EsBaKEal27EWt-VNbfZwtA":{"text":"Miss Flossie is the bomb. Amazing and a classic New Orleans experience with the best servi","useful":1,"cool":0},"YLWFBO3yMG1P_4IGxeb86Q":{"text":"Been here about half a dozen times and the employee's are the best part by far! Super amia","useful":0,"cool":0},"LwTTrS_cu7gYWLYiscmyew":{"text":"Found this place based on a best of breakfast search and how it made it to #2 on the list ","useful":1,"cool":0},"f7uhnkPtLS8Ni0x6YtDh3w":{"text":"My friend and I were looking for somewhere to grab breakfast on the way to our walking tou","useful":0,"cool":0},"yX34xm1zjXO7j37Bm_AuEg":{"text":"Went in with my daughter on on Tuesday night, not too busy.  Everyone was very friendly fr","useful":0,"cool":0},"I0mznXSBARl_aIf9yqXWcg":{"text":"If you want awesome diner food that's reasonably priced come here! If Lenard is working sa","useful":0,"cool":0},"GtoIIgeTcvNYtGxCXuxcYA":{"text":"If you want some perfect southern diner food- this is your spot. The staff is charming and","useful":0,"cool":0},"QWD8cvYRsCXVYtUHHytBAg":{"text":"Fantastic food and even better service!  As long as you like sitting right next to your ne","useful":0,"cool":0},"Pvmdyamfugx38Y-hozYztA":{"text":"First it's a diner. Plain and simple - no gimmicks, no tricks, nothing fancy. Don't go in ","useful":0,"cool":0},"2gJMaCqMAGbiyJ78DCNAbg":{"text":"Perfect dive bar in the French Quarter, friendly service, totally classic experience. Don'","useful":4,"cool":3},"JrxHAXMJc5Qt7Quf2GWXMA":{"text":"Stumbling around the French Quarter on Labor Day looking for some light local fare we foun","useful":0,"cool":0},"Apeh7-0ejHthdfavMBmydA":{"text":"So this place is not the original Camellia Grill but it is in the french quarter and walk ","useful":0,"cool":0},"_3DMj6PL4emIblpOLVoULg":{"text":"Their eggs are amazing. Super fluffy. I think it fairly cheap from what I remember. A bit ","useful":0,"cool":0},"hGTbciBWleI8f6O0F_PaEA":{"text":"Atmosphere 4 - luv the old skool diner seating. \nMex omelette 3 - perfectly cooked, wasnt ","useful":0,"cool":0},"yGNO4BwEWlmQoSlEXuZHnw":{"text":"I've been to the Grill twice now, and each time the service gets more and more comical! Th","useful":1,"cool":0},"vZmlce0XDZwfQaR73FFeQw":{"text":"Excellent food and wonderful service with a very happy and energetic team!!! Big portions ","useful":0,"cool":0},"0efdr96q_l0YIkemV56gjA":{"text":"I had the eggs sausage and hash browns and it was flipping delicious! The staff here is so","useful":1,"cool":0},"4mOuAoWpAo4qmULeiXnQlw":{"text":"Stopped by without knowing if it was worth it but we were tired and hungry. We planned on ","useful":0,"cool":0},"jgEWFpkzEHLiDFJLjVbXhg":{"text":"We got here right at closing time (**yelp says they close at 11 on weekdays but they actua","useful":0,"cool":0},"BJTdk8lYMrMCbWYfAXagYQ":{"text":"Possibly worst service of my life - anywhere, anytime, ever, forever.    Screw this place.","useful":0,"cool":0},"B0Hk7H093mIl14vtzmBfoQ":{"text":"If you want to get a unique experience and start your day of New Orleans partying off righ","useful":2,"cool":1},"z3CWABIDUpfVoMubulffNg":{"text":"Authentic decor, delicious food, entertaining servers, and again, delicious food. Be ready","useful":1,"cool":0},"x7E9a2Ma-G1L3M1hzHxPdw":{"text":"Foodie destination.\nGreasy spoon just making good food.\nI had the catfish poboy and gumbo.","useful":0,"cool":0},"qgGo9WBMCay5RBmZgTcPPg":{"text":"The nicest people in town !amazing food ..we even had a screaming baby and they were so go","useful":0,"cool":0},"B5wdmfIOJxepNQCMrh9zig":{"text":"Food was great! It was cooked quickly, servers were good, the wait was manageable!  I took","useful":0,"cool":0},"arSJL2YH4JpYVy4-Wj453w":{"text":"It's diner food, very basic, just what the dr ordered!  Love this down home place where ev","useful":0,"cool":0},"hMvvtKvInw2dAYevg2iWVQ":{"text":"Decided to visit for lunch. The lunch counter was a delightful experience with friendly st","useful":0,"cool":0},"R7Mlh6ONagLEShTUugXhhA":{"text":"Thank you fellow Yelpers.\n\nDecided to check this place out.\n\nI got the bacon burger dresse","useful":0,"cool":0},"GYOFibJ8oBDwW2kafwu0eg":{"text":"Greasy, greasy spoon. And then some. Waited for about 10 min for a seat at the dirty count","useful":0,"cool":0},"tYWH_pA_NxZ_3kVS14Deqg":{"text":"The food and service were great. I got the two eggs with hasbrowns and turkey bacon. The b","useful":0,"cool":0},"E9foCqsfVx9__N0HS1soSA":{"text":"I would give this zero stars if I could. I have never been treated more rudely in a restau","useful":0,"cool":0},"qtX-sSZwGP3DdRqv0OAPRA":{"text":"Great good and service. No frills grill. Good was delicious. The grill is very well season","useful":0,"cool":0},"ILH7aT_ekJ2eg9UOWhEGSA":{"text":"A NOLA staple! With two locations, this place is not to be missed! Great breakfast or lunc","useful":0,"cool":0},"njFkhJBLo-0ZwUDW25G-CQ":{"text":"Seriously, the worst meal I've had in months. If you come here prepare for greasy garbage ","useful":0,"cool":0},"MUb4W08ZwDAzEvABu-obug":{"text":"Great diner. Walk up, sit at the counter, and order. Red beans & rice were perfect! This i","useful":0,"cool":0},"UYJq8pv9Ozo8l0qguQhQ5g":{"text":"This is breakfast the way it was meant to be served. It's a bit of a greasy spoon, but if ","useful":0,"cool":0},"y6Ay6ATlU71mDA1sbitDig":{"text":"We accidentally found this place last year on a late night stroll.  We thought it was real","useful":0,"cool":0},"VPvmq7OSfQW7bpP-VYJeFA":{"text":"Friendly staff and great customer service. I love the pecan waffles!","useful":1,"cool":0},"FmzbOTOx3YaQlIW9P79-Ug":{"text":"First off, I like the layout of the restaurant.  Its basically a large counter that snakes","useful":1,"cool":0},"R6HUoOiFx79IfrKcGiDLXg":{"text":"Located in the middle of the French quarter it is probably one of the cheapest places to e","useful":0,"cool":0},"rEVlgjDo9IZVFkXVILdsxg":{"text":"I loved this place! We came here two times while in NOLA and unlike another (one -time) ye","useful":3,"cool":2},"bhhC34nTifqgV54XfBXPQQ":{"text":"Loved it. The food was great and the service was too. Fun diner atmosphere. I will go here","useful":0,"cool":0},"3Dsv1AhsS7Xku7Dm48awQA":{"text":"Awesome spot. If you're looking for a cheap, quality meal then this is your place. Great b","useful":0,"cool":0},"3MeW2uFlykaLkdJhwMNUJw":{"text":"Harry's Yankee Special was delicious.","useful":0,"cool":0},"sp3OUBl1_wIobc8FrAXqDQ":{"text":"Go for the experience!  We stumbled upon this place on our fourth evening of a week long v","useful":0,"cool":0},"eIHhhKVSj_ljeWDd_Grxaw":{"text":"My husband and I travel to New Orleans frequently and this was our first visit to The Gril","useful":0,"cool":0},"Vk9B62ZKrUpMnHCsebkgyA":{"text":"To say I'm a New Orleanian, I sadly just made my first visit to Camellia Grill. On a trip ","useful":3,"cool":1},"zqwsmHij-YvRr_HFpcOXrQ":{"text":"Exactly what a breakfast diner should be....... delicious, fast, reasonably priced, with e","useful":0,"cool":0},"h1aFvFxlxhp4qm2H_1zU6A":{"text":"Very rude! I would have given this place 4 stars because the breakfast is pretty good but ","useful":0,"cool":0},"XjspqTvs_vRBtvMWVUk8MA":{"text":"This place is delicious...everything on the menu is very good. The staff is hilarious,its ","useful":0,"cool":0},"PEjiP5-wRaaeJ_N_95PMeg":{"text":"I really wanted to love this place.  I love diners, especially diners with counters.  This","useful":2,"cool":0},"UvlLaNPMp87PO6IF1n7drQ":{"text":"Wow, talk about a great experience AND great food!\n\nI've been to Camellia Grill 3 times no","useful":4,"cool":3},"_UhFM6IVDS6nGjtMjM6Ohg":{"text":"Good, friendly, fast, and cheap. This place rocked","useful":0,"cool":0},"2njIVcPtAxbC9ILkfHlSMw":{"text":"This place was a nice surprise!  The food itself was average, but i ordered only breakfast","useful":0,"cool":0},"EF9FYkuFwWnJojE8ybydyg":{"text":"Looking for a great value on great food with friendly service? Look no further. We stopped","useful":0,"cool":0},"J__Qx0hDRz4yFyNFZBQw7w":{"text":"Great simple diner. Fast and friendly service. Just right for an American style breakfast ","useful":0,"cool":0},"Cbx-rHU5e5FsDRaE2Fs0Cw":{"text":"Camellia Grill - French Quarter\nCheap but good deal for the money! The pecan waffle with t","useful":0,"cool":0},"nrg9lvyBInji3aZClcynhw":{"text":"I enjoyed an EXCELLENT breakfast here at Camellia Grill. There's nothing frilly or fancy a","useful":1,"cool":1},"vYIC4YrwO5igY_HvHMZd4A":{"text":"I thought this place was alright...I think you come here for the experience rather than th","useful":1,"cool":2},"jFOY3XG68HUA--kj4HrLTw":{"text":"Great food, atmosphere, and service!  A New Orleans must for breakfast.  Reasonable prices","useful":0,"cool":0},"t8EAsNgeVIvKgpIqFy7Bag":{"text":"Great food, great atmosphere, great service. Very kid friendly too. Get the cheeseburger, ","useful":0,"cool":0},"hDiOh7Ld5qjIZZKbqiQU4w":{"text":"Great Chefs Special Omelette and Grits...Highly recommend it...Great Service and entertain","useful":0,"cool":1},"pXoiDMKxmOE78CHQunfaRg":{"text":"Delicious!  I really liked this place.  It has a great atmosphere and friendly waitors. I ","useful":1,"cool":1},"Is6yJeKqEhlw0nJRl2DzmQ":{"text":"Went here today for breakfast. The food here was phenomenal. The service was great and the","useful":0,"cool":0},"FaCyhVrhkdF3cro8ZueNdQ":{"text":"Loved the entire experience. It was packed in there, but we got seated in 5 mins given the","useful":0,"cool":0},"fJfxmW9oCsuH4w_y2mfAsA":{"text":"So good we visited twice!! \n\nWe stopped for a proper diner breakfast and were charmed by t","useful":2,"cool":0},"kh7lBaxrh6WvVx5edPU5GA":{"text":"This was an interesting place. The guys working the grill were kind of funny and joked wit","useful":0,"cool":0},"wa5PrPEF-NU6t-CJ3WTwiQ":{"text":"Oh I love this place! Once, before I moved here ....I got in my car (in Philadelphia) and ","useful":0,"cool":0},"WAVKEvlurgEk9E4nc5mJpA":{"text":"There are a lot of places to eat in New Orleans; A LOT. When a place sticks out in a city ","useful":0,"cool":0},"3lfAjv1HoDJHT9-2Z43htg":{"text":"Diners are a unique American establishment that connects this country deeper than you'd ev","useful":0,"cool":0},"O_23oQ2uceFyvSBduUJ5RQ":{"text":"This is absolutely the most delicious, freshly prepared food in the French Quarter. The st","useful":0,"cool":0},"9ZWX73WgVFbDwufjiesESQ":{"text":"This place was excellent. Great food and great service. The people that work here made the","useful":3,"cool":0},"yP8x_gZsOFOHexeQRTycZw":{"text":"I'm very particular about where I go, especially when i'm just visiting. I like to soak up","useful":0,"cool":0},"EfgawhduYlVFn_7-1Kez8A":{"text":"The food in here was delicious! The vodka and orange juice was a good cure for a hangover.","useful":0,"cool":0},"I3j1DKOVQ6aIHCw2IdgkVg":{"text":"Food was awesome and the choc pecan pie was amazing. They even grilled our pecan pie which","useful":0,"cool":0},"dobgzfa3HqusNbUVVWgOhw":{"text":"Good standard diner fare with a classic unique experience built in.  I had a patty melt an","useful":0,"cool":0},"2VyF_nsuz1tzJ9VMHUH12g":{"text":"This place is everything you want from a diner. Quick, hearty food, strong coffee and love","useful":0,"cool":0},"9VX32UU-Knp3Odxjp5ZeLg":{"text":"The original Camellia Grill on Carrollton has been in business for decades. This NOLA inst","useful":2,"cool":0},"2rjL-tdN_rSuT76afnmhEw":{"text":"the food was decent but the servers were incredibly rude to us. when we sat down and asked","useful":0,"cool":0},"LT3DwxVib5TvJYSo5xGGwA":{"text":"The reason I give this place 5 stars is the atmosphere! It was such a fun experience. The ","useful":0,"cool":0},"Lm-sRrPTRUW8qZvrLS4wzQ":{"text":"If you are looking for some tasty food in a relaxed setting this will not disappoint!  The","useful":1,"cool":0},"fhnYBVz7WucjJEbMVcvtbg":{"text":"Excellent food!  I had a cheeseburger and fries and my daughter had a bacon omelet.  We re","useful":0,"cool":0},"QqKxB8deEe6tiaro34oJJA":{"text":"Food passable, the servers are friendly but overworked and harried.  Difficult to get wate","useful":0,"cool":0},"FG2nKL8u2rlvNDAxlWdDSg":{"text":"Classic old school diner with great simple food right in the quarter. Staff is very friend","useful":0,"cool":0},"Kwfr2WitMj9pfs48hEuNEA":{"text":"Conveniently located in the French Quarter. \nDiner like charming atmosphere. We were a bit","useful":2,"cool":2},"4Z5uaMXDr5I3YSYjka7PxQ":{"text":"This is a decent place to grab a bite. I have a few complaints and few good things to say.","useful":0,"cool":0},"uT3KjiS0jop3TKfyyMvGow":{"text":"Great little old school diner! Service is entertaining and fun, red beans and rice were am","useful":0,"cool":0},"55tz1EkyjTRFNYldUsP9iw":{"text":"I judge all diners by the gold standard of the Dinner/Diner Grill in Chicago.\n\nThis place ","useful":8,"cool":10},"_2dT4DGqZpp3z7eTgHYl5g":{"text":"Come early and leave happy!  The prices are fair and the waiters and chefs are friendly. Y","useful":1,"cool":0},"lYeqtlTxN4Mo35GzaEeiFw":{"text":"We had an amazing time here. Our server was super kind and he gave us the extra to our fri","useful":0,"cool":0},"vTzhIi99J6EmA7FttDdMLQ":{"text":"We tried this place on a Sunday night around 8pm.  I had a bowl of gumbo and we split a sa","useful":0,"cool":0},"HW0M4o-835JHoupGGhbD9w":{"text":"I ordered a waffle, chili fries and coffee and also got to try my friend's omelet and hash","useful":0,"cool":0},"xpZr-LM1ywrC9g-sritl7g":{"text":"Step back in time to this lively, authentic southern breakfast counter service grill! \n\nWe","useful":1,"cool":0},"Guq3ECMvb6YXYsTXbXyiwg":{"text":"This is the place to come for a quick home cooked meal and excellent service. The servers ","useful":0,"cool":0},"QrvYoxDlaHzkPSFYNj0BSg":{"text":"Was in town for Buku music festival, and my buddy and I needed to grab a bite before day 2","useful":0,"cool":0},"0JmGKo3RpH892g2dj_vQDQ":{"text":"I work in the French Quarter, and I often find myself underwhelmed by the breakfast option","useful":2,"cool":0},"1s1xV6JVgRWGLWYicxff3w":{"text":"Stopped by for a one-scoop chocolate shake yesterday while in town for Jazz Fest.  Relativ","useful":1,"cool":0},"PMGDF1-wzhtINqU-Op5Qxg":{"text":"Great place for a great breakfast (or lunch) with Great People! You'll love the friendly s","useful":0,"cool":0},"OKOMA1lF17iCS669oboWYA":{"text":"Welcome to NOLA. On my most recent trip with the rents they wanted to see real new orleans","useful":0,"cool":0},"f-9XW-d1opEcfYdcsJIAXg":{"text":"Great little breakfast spot in the quarter! The hosts are funny and very charismatic! Alwa","useful":0,"cool":0},"3IQWzW_L5nMdpkn-NQdCbg":{"text":"I may be a tourist here but I go to New Orleans enough to make Camellia a regular spot for","useful":2,"cool":2},"a6YnWWD1XHG_ZF3zCsp4kw":{"text":"Camellia Grill is a great spot for breakfast and a late-night bite.  The chili-cheese omel","useful":0,"cool":0},"V7bR62hj1Mnd1BG9ZxrtmA":{"text":"The best hangover meal ever. Delicious cooking and served with a smile. The staff was so w","useful":0,"cool":0},"oE3ODsOnrw0T_WNubT72RA":{"text":"The servers have attitude in a good way! It's a classic breakfast place, I had the 2 eggs ","useful":0,"cool":0},"hwGCXdj8hExmdK_ydGmMjQ":{"text":"Great suggestion from our hotel. We were looking from food and a good Bloody Mary.\nWe had ","useful":0,"cool":0},"GUwSGA50Zafa8leDJjWYOA":{"text":"If you want breakfast served fast and friendly this is your place.  As long as you're down","useful":0,"cool":0},"V2Ql8eGzmMW_JszEdz4mAg":{"text":"A little disprganized getting seated but great food and great service.","useful":0,"cool":0},"peXs8UmWyHEVlhry1NYbyg":{"text":"Exactly what an old school diner should be!  Had my burger \"dressed for the winter\" = lett","useful":1,"cool":0},"AsRZTFcEzBHZ1n2RzAM2eA":{"text":"I had no issue with my breakfast as pancakes nice and fluffy and bacon crisp.  Oj was oj a","useful":0,"cool":0},"jGMMM2itSgcxmgEQGFIBXw":{"text":"Boy this place has deteriorated ...plastic plates, American cheese food spread, dry pecan ","useful":0,"cool":0},"1hAHsAd_6dNmcwPECg7lhw":{"text":"Delicious food and fast service. Sister and I had veggie omelette and uncle had pancakes. ","useful":0,"cool":0},"zv-5w-SQEOXrbUeUiha4TA":{"text":"This place has a cool, home-y charm.  The service is fast + friendly, and the food is pret","useful":0,"cool":0},"w3hi5BIQqao0x-ZaJdOoCg":{"text":"The best breakfast place in the french quarter. Such great service and great food. We love","useful":1,"cool":0},"EgdX3_jTX9-j0eSu_Lzcng":{"text":"Best breakfast I had in a while! What a great way to cure a mardi gras hangover. The food ","useful":1,"cool":1},"8Bb6S-5Hde5OJyDs06g6SQ":{"text":"Best breakfast in the French Quarter.  We liked it so much we came two days in a row while","useful":0,"cool":0},"ARSqI9VwxVx4evx-qzoXpg":{"text":"This spot has all of the polish of the Uptown location, with some extra flare from the wai","useful":0,"cool":0},"V9bVw6eZhoq61283PmFv-w":{"text":"An excellent choice for breakfast or lunch if you are in the French Quarter. Fast and frie","useful":0,"cool":0},"IRx6_HFoZZBcpCyT1ZkdAQ":{"text":"American diner with a few local specialties. High energy chefs at the grill and diligent w","useful":0,"cool":0},"fG8k5gyOJUvUO9Xft2m9Qg":{"text":"they forgot our coffee and got most of our order wrong. 6 bucks for eggs and hash browns a","useful":1,"cool":1},"dh1p77eG2MSoCr2U708V_Q":{"text":"Best breakfast in New Orleans! Ordered the manhattan omelette. My friends ordered the Mexi","useful":0,"cool":0},"w4n1ythiSVIF72eqZkyESQ":{"text":"This place is awesome the best burgers in town by far. The mix of great food with great fr","useful":0,"cool":0},"k33lVwfULeL36ln39nZc3g":{"text":"Fun old-fashioned place. The food was fine, but nothing spectacular. The staff is what rea","useful":0,"cool":0},"A-yIOtH5MtV-5XsnnunFCA":{"text":"This place has the best omelet I have ever had. My friends and I loved it so much we went ","useful":1,"cool":0},"9MWq07i6S67T1LUPkMGeKw":{"text":"Old school diner vibe with traditional counter diner cousins. Service was friendly, but ma","useful":0,"cool":0},"NgWCzzryev5UqFGQI4Oymw":{"text":"Fantastic place for breakfast. The staff is super friendly and efficient. Try not to be a ","useful":0,"cool":0},"HR_Uk0ro8Nw5FPzXbFqRAw":{"text":"Camelia Grill, I HEART YOU!\n\nWe camped out across the street waiting for the Mardi Gras pa","useful":1,"cool":0},"pYP8skDvYi-SQK64aNzJ3g":{"text":"It's the experience that puts this place over the top for me. Now I'm going to preface thi","useful":1,"cool":0},"8aMIyYUHuIKf1qsyeyo4HA":{"text":"The food was great!  I had the western omelette with a side of grits.  Being from the sout","useful":0,"cool":0},"Tv8GUWy8e-TvYznOpoMeWw":{"text":"Located right in the middle of French quarter!\n\nInexpensive! I ordered the fried catfish P","useful":0,"cool":0},"67YFotLZLdaZuDZMwOUFqQ":{"text":"Good food. Counter service, only.\nThe pecan pancakes are great.\n\nI have eaten in many trul","useful":0,"cool":0},"bz2YGYyyY13_7nWqrAgrzQ":{"text":"Now that Camellia Grill has a 2nd location and in a great spot nonetheless, I will be back","useful":1,"cool":1},"LAkk9idWRayViIszXkkYCA":{"text":"Always have such a good time eating here. So laid back and great for breakfast. I visit ev","useful":0,"cool":0},"I3l4wezrydIon44p4CGJHw":{"text":"Walked in at 9:41 wanting nothing but ice cream and a milkshake and the guys response was ","useful":1,"cool":1},"xkjQQEvRWNRRuwggJBJUoQ":{"text":"Cheap, enormous portions, and delicious. Probably my favorite breakfast I had in New Orlea","useful":1,"cool":0},"pZcVT30B7_IdIFofeqjQcQ":{"text":"Great little 10pm spot or even for breakfast, although we heard that i gets very busy at t","useful":3,"cool":2},"57AUw0Lu30CD2L0S2cBo0A":{"text":"We came here THREE TIMES for breakfast and was only disappointed on our final visit.  Why?","useful":1,"cool":3},"ouG6_VAUdRtT1WSxR1lHig":{"text":"This place is half hipster heaven, half 50's original and 100% the best option for cheap f","useful":1,"cool":0},"1X7kwirhsLXZEZn6VxYJCA":{"text":"Excellent service.. Excellent food.. Best food we have had hands down in our vacation! It ","useful":0,"cool":0},"gggCKEGf-bdjaaXp2BPrYA":{"text":"My first Yelp 5 star review is of this New Orleans treasure. Although this one is in the F","useful":0,"cool":0},"TBh3rzU927qWz4o762wB0w":{"text":"I really like the look of this place -- classy old diner with the counter snaking through ","useful":0,"cool":0},"DTEficQ8k6BUwaOa0Nw94A":{"text":"On my very last day in NOLA, we came to this adorable little old-fashioned diner. We came ","useful":0,"cool":0},"O0raEbtlxOrsvcr-TdxrsQ":{"text":"Amazing. I had the chef's special omelette and it was greasy, cheesy goodness. It hit the ","useful":0,"cool":0},"JYZNzTbbUtCThMLNHD0lkw":{"text":"We found this place open late one night back in Oct 13 and we just had a grand old time wi","useful":3,"cool":5},"aKaZLmWLI0P6Qnc-VKP7BA":{"text":"This is a cute place near Jackson Square. One thing - I went alone and the (all male) wait","useful":0,"cool":0},"yLLQMiDR6_r3Q-37mioCng":{"text":"Yeah, I can give it 5 stars because we (by we I mean two people) basically tried everythin","useful":0,"cool":0},"3rE6OgLeBCLbUsYB8I3Aww":{"text":"I was totally disappointed!!! Staff were not attentive, food was bland. Chilli cheese frie","useful":0,"cool":0},"PtbKe0BfJmsIfR4WAHnAcg":{"text":"This place was simply awesome!!!  Our chef Will was the best...you guys rock.  My burger w","useful":0,"cool":0},"VdnoAjEALa5M7iKFwr9FXQ":{"text":"Been there twice this trip, plan on it again in the morning. Great grits, and great prices","useful":0,"cool":1},"_5-o5LZu75UUeb8m30MXUw":{"text":"Cheap, clean, friendly, and delicious.  This is what a southern diner is all about.  I wil","useful":0,"cool":0},"ODmCzVIzNdIy46UUtbNZlQ":{"text":"Great pancakes, service was so so.  Old time diner style with a hint of NOLA mixed in.   W","useful":0,"cool":0},"klCEDgfIvGIaAP8sEDodrA":{"text":"We past by this place a few times walking thought the french quarter and the counter made ","useful":1,"cool":1},"kDecMlUtcKhgW-nmmGL9dg":{"text":"Yum! Great service and great food. Get the Harry's Yankee and the Word Special with egg an","useful":1,"cool":0},"6V7HrpDGexa4NMFpgCkfdg":{"text":"That's some good chilli cheese fries! Thanks Branden for the good service. We are from Cal","useful":1,"cool":0},"mipDiki-ACR8IO_DKdC9rg":{"text":"Great breakfast spot. They are open late too and still serving food so a good place to go ","useful":1,"cool":1},"ZpIU7PR4V_NMvMUq80MTaA":{"text":"So wonderful that this go to place has a quarter location!  We had the amazing Manhattan a","useful":0,"cool":0},"EtplHMmnJlD6HtEXkoxxiA":{"text":"The Camellia Grill for breakfast was a mistake. The food to not any better then some waffl","useful":0,"cool":0},"ZAM8Euxbv3fM6fBQikcgjg":{"text":"A very strong 3.75 stars.\n\nI used to go to The Camellia Grill location on South Carrollton","useful":4,"cool":0},"Mi5zWh_FC8foJy5Gl5CRBA":{"text":"Sadly didn't have time to make it out to the original location Uptown as was suggested to ","useful":0,"cool":0},"7VGLyFAV2rK1dK2j7yUWKQ":{"text":"This review is purely for the Pecan Pie with a scoop of vanilla ice cream!  Thanks to Susa","useful":0,"cool":0},"2pxlJR0KhKvHC2jLfG4zNg":{"text":"Rude staff. Not even sure where to begin.Actually experience it for yourself....just make ","useful":0,"cool":0},"tPH4WfBla219NzkNCfeVZg":{"text":"OK, I am now officially going to take any review on Yelp that is about any place in a heav","useful":2,"cool":0},"HkR-CqMYV5AZCOMa2H77PQ":{"text":"Delicious old school diner.   Stand in line.  The wait is short and worth it.  I recommend","useful":0,"cool":0},"5mugRD9SJKiXnZ9ks1Y_wA":{"text":"Wasn't expecting much when I walked in but it turned out to be pretty good... And the staf","useful":0,"cool":0},"16HJrmB4rSrKYgqe8mnClQ":{"text":"The most fluffiest omelette I've ever had. I ordered the manhattan omelette with hash and ","useful":0,"cool":0},"XkOwQSxF4uCf1Ea93l5dGw":{"text":"A small, old school, transport you back to the 50's little diner tucked into the Quarter. ","useful":1,"cool":0},"Zrv6tOyPCKlge00ZfMYeyQ":{"text":"Nice little place with fun banter between the grill chef, waiters, and customers. The food","useful":1,"cool":0},"CslEXKFdiBKIATN8n3Twzg":{"text":"Great Roast Beef PO Boy & the atmosphere was very enjoyable thanks to the lovely gentleman","useful":0,"cool":0},"RCZKz9qAdjdwl7J9UhROJA":{"text":"A-1 Diner all the way... Staff is excellent and entertaining. They sing, give fist bumps, ","useful":1,"cool":0},"cQfAN5IYPFdpKa9ZbMfTUg":{"text":"The cheeseburger here was sublime. I am not even exaggerating! It was a thin, hand-formed ","useful":3,"cool":0},"wQXMxXYWqyGe4Ve8Ne1azg":{"text":"The food is fantastic!  This place is a grease-pit with great food that is cheap.  The sta","useful":0,"cool":0},"OurZgItF6IocLLuCED9RlA":{"text":"Excellent diner food. The muffuletta was the best I've had. Not too much bread, the ratio ","useful":0,"cool":0},"37lprI4V9ebZAc7O5gUZWg":{"text":"This place is really entertaining. The staff is really funny and friendly. They joke aroun","useful":0,"cool":0},"KD3KkXsBaabLi_O9C-WiPQ":{"text":"The Grill now has its name back!!!\n\nWelcome back. The remodel is done. The kitchen looks g","useful":1,"cool":0},"MHGNu2sxEtApW9IaZmhkFQ":{"text":"The Grill was great! We stopped in for one thing and one thing only, The Grill's Pecan Pie","useful":2,"cool":0},"Jl7C2W3x2zMDo_aRYpNCmA":{"text":"The food was pretty good and the service was fast.  The waitress was among the most deadpa","useful":0,"cool":0},"9ytGFVKtUc6vD76KDCW1Bw":{"text":"My omelet was kind of overcooked and sat on the plate for a while getting cold but overall","useful":1,"cool":0},"SV7SJ5gqsh2_JBGcwFmWpQ":{"text":"Delicious! Just wanted a simple breakfast. Basic stuff. But I have to say the flavor and t","useful":0,"cool":0},"FXjW1ViXbvfYf76EukjtXA":{"text":"Came here for breakfast twice. The service is incredibly quick, the coffee just how I like","useful":0,"cool":0},"2h13V6Xb_sRqQ8I3_XAWUg":{"text":"The good was actually very good! But the heavy set black tattood line cook who yelled \"wha","useful":0,"cool":0},"Vrutfp0xiNXyvGIkcMXfQg":{"text":"The setting to get a full capacity and personal service is perfect! The staff are great! A","useful":0,"cool":0},"Ti9jHLmP87845LPxwd9LHQ":{"text":"I'm grateful this is so far from me because I'd be fat from eating there too much. This pl","useful":0,"cool":0},"iGJw-68-Hxgq46JeS_fKGA":{"text":"I've never enjoyed a wait staff more! They were energetic, funny, attentive, and generally","useful":0,"cool":0},"o26JsR3fWH6AIFL69SwyTg":{"text":"This place was entertaining to say the least. A drunken \"tourist trap\" if you will. The wa","useful":0,"cool":0},"kG9QH9j8hb6DZ1ynZ71PrQ":{"text":"Don't know what the negative reviews are about...we had a great time here! It's an old sch","useful":2,"cool":1},"mtZYQyh8qmHN3H-_K-rxUA":{"text":"Omlets & Pancakes at 4am is truly appreciated after a night of drinking. Great food, funny","useful":2,"cool":0},"gst70rVpntP_aTu7OQtBDw":{"text":"Terrible service, actually left before we even ordered. Waited and waited while the waiter","useful":0,"cool":0},"5183wrW2Wme1Xg8Hzbwk8w":{"text":"AMAZING experience!  Loved this place so much we went back the next day for brunch.  The g","useful":1,"cool":0},"T9FrCAU2zTotbJFJct4haw":{"text":"The grill was a pleasant surprise. High top booths (bar-style) all around and the staff is","useful":0,"cool":0},"__XsnOqy5oQNJ0wBCs9Xzw":{"text":"A local recommended this place and we were not disappointed! Our waiter Lu should be on st","useful":1,"cool":0},"XrKk3sesoP0-sr9D11E31w":{"text":"A great place to grab a hearty breakfast.  The wait staff is fast, nice, and no nonsense. ","useful":0,"cool":0},"yQwuefWgQGx9xFbCfHbQTw":{"text":"LOVE this grill. Prices are very good and the food is amazing. Wait staff is fun and you c","useful":0,"cool":0},"IyxQYNa-ny5nCCOYTTXAaw":{"text":"Good food good service and our meals came out pretty quickly. If you like diner food you w","useful":0,"cool":0},"O0nKsBDvvImcT26BujpoqA":{"text":"It took me too long to come here, because I've always gone to their original location upto","useful":1,"cool":0},"xWaGO5H1lW6juNAjPMDlZw":{"text":"Food and atmosphere were good, but not good enough to command a ludicrous $10.59 for a bur","useful":0,"cool":0},"cCTUPm451o0E3Sycyr5Ysg":{"text":"If I lived in NOLA, I would be a regular here. \n\nIt's the awesome atmosphere, the joking a","useful":0,"cool":0},"GvnS-5ewK_0ghH9181NjLg":{"text":"Had to wait about 10 min to get a seat, had great food and great friendly service. I would","useful":0,"cool":0},"cSJ3O-ttD-Hc_2FBHUTgcw":{"text":"I found the mediocre food at best. The servers were entertaining which is why I think peop","useful":0,"cool":0},"6sOeHRxXiRnle0Oug5ejtA":{"text":"I just Love a place that makes you feel like you are their favorite person. I love that I ","useful":1,"cool":0},"EmKkn1H6I6RD0tUPeNNElQ":{"text":"It's Camellia Grill... with booze.. and if that gets you worked up then you went to the ri","useful":1,"cool":1},"NzmRIXB4zx4a5VV5ouegIw":{"text":"Everything I've had here has been delicious.  And the prices are great!  Definitely my fav","useful":0,"cool":0},"mpjLihiL1tIzc3Izb9L_Rg":{"text":"Had an early flight and got into the city quite early. Luckily, this place was open and ju","useful":5,"cool":5},"22D8JxmI18A2WgiQe01h9Q":{"text":"We loved this place! We came here twice on our trip-once for breakfast and once got dinner","useful":0,"cool":0},"ssfaxa6cd9iEMLyEbznorg":{"text":"Good diner food and friendly staff. I would recommend if you are in the area. Doesn't have","useful":0,"cool":0},"f9khuhJxadQhg6CaI1cRdA":{"text":"I had read about this place adding a second location to the French Quarter, but I didn't e","useful":1,"cool":1},"NcpyQKKmw8dTxsNC6o_11g":{"text":"Delicious! We all ordered omelets and they were phenomenal! We got the bacon omelet with c","useful":0,"cool":0},"9ncOaWJqXs5J8V43ci1rgg":{"text":"This diner is a must when we travel back to NOLA. The food is great and the atmosphere is ","useful":0,"cool":0},"BKUIb7wtIseKhEdqksk5iA":{"text":"I work right next store and I ordered the \"Mardi Gras\" po-boy and it wasnt that great. Ive","useful":0,"cool":0},"2k80Fvqo1nq01WsERYsIVw":{"text":"Came here on Labor Day, after a recommendation from our tour guide for the Tastebud Tours ","useful":0,"cool":0},"Mi1ek6WqLEP0kPvNrrsTOg":{"text":"Not fancy, but GREAT food and great diner atmosphere.  I got 2egg sausage and grits.  Love","useful":0,"cool":0},"5XLrlhummjjHv6fvVn3dZQ":{"text":"They have a fun attitude here and the Manhattan Omelet may have been one of the best break","useful":0,"cool":0},"0PAeNrbG3XSkES5kq57s3A":{"text":"If you have the chance, have breakfast here!!  Food was delicious.  Nothing fancy but yumm","useful":0,"cool":0},"kkgpl8zsw44IK8C7uOmZxw":{"text":"We were directed to visit The Grill by a friend who grew up in the area. We were not disap","useful":0,"cool":0},"biK9t-8yl5QPifq_k11lRA":{"text":"I feel like a traitor for having been to this Camellia before the uptown one, but oh well.","useful":2,"cool":3},"DtiR6BWuQKKg0UZuM7m45g":{"text":"Honestly my best experience while visiting NOLA.\n\nThe place had a lively atmosphere and ev","useful":2,"cool":0},"uBRlWzHyemEtQj-nivyJdQ":{"text":"Was looking for an inexpensive place to eat near Jackson Square. You can walk right in and","useful":0,"cool":0},"jCdoV671HV_fw2ix7UBlRg":{"text":"This is just what a breakfast diner should be, great comfort food in enormous volumes spil","useful":3,"cool":1},"fUkln9VA74i551UaQT8_kg":{"text":"This is a fun diner for breakfast or lunch. Food was pretty good and well-priced. The peca","useful":0,"cool":0},"2eT9Ro8mnUHp8GEIfPEytQ":{"text":"We just tried this place for the first time.  The original Uptown location is my favorite ","useful":0,"cool":0},"jVt6QvsDyu1LG0DMfuAxKA":{"text":"Best breakfast in the French Quarter. Friendly service, great food and lots of fun. The pe","useful":0,"cool":0},"3rF6lAomVQOaN7PPToTYZw":{"text":"My family and I were in the FQ needing a quick, no frills bite with our toddler, and despe","useful":0,"cool":0},"WhD-CgeXIPwu1LoU3QdBQg":{"text":"Breakfast was exactly what you expect from diner FRESH FAST AND FANTASTIC! once you get in","useful":0,"cool":1},"p2LvnSooSmPv78sVpZ7sLQ":{"text":"Food was amazing at a great and reasonable price service was awesome. Had the omelet chefs","useful":0,"cool":0},"bw_6oPzJ8j6e0Ykqu2nIZQ":{"text":"We had a great brunch here this past week. This was the first place that we went to in NOL","useful":0,"cool":0},"45Mgoks7aW9CGlMwiQEp9Q":{"text":"The burger was really bad. Nothing on it and looks burned. The chicken stripes where 4 sma","useful":0,"cool":0},"GTvdWyNcxV3CzQXff-21QQ":{"text":"What an experience! The men working here are so entertaining and friendly. Such a fun envi","useful":0,"cool":0},"9nNk4GP-jvMRApYG7E6nVw":{"text":"Good no nonsense cooking with a super friendly staff... would def recommend for breakfast ","useful":1,"cool":0},"5ATfSyZqjZHU6xjFa6t5PA":{"text":"Hubby and I disagree on this one hence 4 stars...my cheeseburger was perfect & tasty and I","useful":2,"cool":1},"P-QArKW10BITv9F_xfYNwQ":{"text":"The food, service and atmosphere were great.  My first visit I had a mind blowing muffalet","useful":3,"cool":1},"zBtK9Qe0sagcgErwYIOh9A":{"text":"I had a great time here.  I must say that the food is not the main draw.  I ordered cheese","useful":1,"cool":1},"B3csQpagM2eRNVSAN35flQ":{"text":"I generally avoid the French Quarter locations of any restaurant, but I was nearby and bei","useful":0,"cool":1},"w2aq8uzYUPVQttVH1yDKog":{"text":"Great diner experience. You can't go wrong with either breakfast or a burger and fries. De","useful":1,"cool":0},"7LYpsBySLctFxoZPJ8vjZQ":{"text":"I had a great experience at Camellia Grill. My friend and I went early (around 9 am) on a ","useful":1,"cool":0},"61k7Q8GTXq4FmezaT8aepA":{"text":"This place is amazing. Read a Yelp review and decided to go there. The omletts are enormou","useful":0,"cool":0},"lgIbFYxoUdTaMZfYYKClyQ":{"text":"My favorite place in New Orleans.  I LOVE this place.  \n\nThe atmosphere, the cooks, the se","useful":1,"cool":2},"Me3Ta85PK5YClzbdfQfn4Q":{"text":"If you're looking for no frills dining but great service and delicious food come to the gr","useful":0,"cool":0},"nr0G2GrpV6w_F7EMYgBxAg":{"text":"Place was decent, I came here after seeing reviews on yelp. We wanted something different ","useful":3,"cool":1},"YutByHxTWnsSJSZwoIQX5Q":{"text":"WORST WAFFLES EVER. \nWe ordered 1 waffle each, a side of hash browns to share and a coffee","useful":0,"cool":0},"w7owBvbVZdICy0xsUdJ0Zw":{"text":"I'm from Houston Tx and stopped by this restaurant to try for the first time. Given the re","useful":0,"cool":0},"dJXcWtaNyNFUQFfrI2xvcA":{"text":"It's the complete dining experience from the jovial waiters, kitchen code, and good ol' fa","useful":2,"cool":1},"UOOQ0nBp9Fc-vz0u_hsoHw":{"text":"A great place not too far from the French Market. The food was great and our server, Wanya","useful":0,"cool":0},"YEu576f8GnhC1Vr1VW_WNQ":{"text":"The food is so DELICIOUS! I love food and this place did not disappoint. The staff are fri","useful":0,"cool":0},"iplw2lDuSFGPtvZkycf__A":{"text":"What a fun little diner.. After some very rich food for a couple days - we wanted somethin","useful":1,"cool":1},"V3MoR-IG4CYkajMb86ZW9w":{"text":"Great old-fashioned diner experience.   My husband and I walked into this double-sided wal","useful":0,"cool":0},"PhrtaQs0nQZD3vlLFkcyBw":{"text":"I have been to New Orleans many of times and have never been here until today. I was pleas","useful":0,"cool":0},"ctVPUA10c6yy2LKiZf_O-g":{"text":"Go here if you want homestyle cooking and a lot of entertainment! The staff was pretty can","useful":0,"cool":0},"KK1MV16ddCm7Po3OK2nLkg":{"text":"We love this place. We went here on a previous trip, just stumbled upon it, and on this tr","useful":0,"cool":0},"qgXTXnlAncSdcI7RIXiDrw":{"text":"The location and layout is fantastic and makes it feel like it's better than it really is.","useful":0,"cool":0},"f5W4TN7Cl-QtLIAha9BpHQ":{"text":"Wir wussten das nicht, aber das The Grill ist offenbar ein legendärer Laden, der seine ers","useful":9,"cool":7},"eKQJPdHR9h-gkAhLbtZYJw":{"text":"Summary- Excellent atmosphere with very meh food.  \n\nFood- 2 Stars\nChili Omelette was just","useful":1,"cool":1},"53xv4lrniGYyCF9udvHA5Q":{"text":"I would go back here again just to chat it up with our hilarious and awesome server. I als","useful":2,"cool":0},"xmym-JeJnmk9SKYhO4H50w":{"text":"We came here for lunch with my bro-in-law.  There are diner style counter seats in 2 U sha","useful":0,"cool":0},"Oi36-VQfxW1qp2o2sqYNlQ":{"text":"BEST BREAKFAST EVER!\nCame here on a Sunday before football and we were expecting a long wa","useful":4,"cool":2},"NcIdVxgspSg4fKUWmSecoA":{"text":"One of the best NOLA spots on the planet! Love the burgers & cherry shakes! Beef hot sausa","useful":0,"cool":1},"OMvlupdb_WrdxbpdSqs7Og":{"text":"This place was Soooooooo good! They serve breakfast all day and the staff is outgoing and ","useful":0,"cool":0},"TftC3CdOhRt88EQlR5AKYg":{"text":"I'm a local, familiar with both the Uptown and French Quarter locations. The Camellia Gril","useful":0,"cool":0},"O45KPIHlohyliXqBKgNXDw":{"text":"The Camellia Grill is famous in certain circles. As in, the right ones. My parental units ","useful":7,"cool":8},"_VCvpV6lh2M-wy7k7Mteiw":{"text":"I had breakfast here and it was delicious. I had the potato and onion omelette and the che","useful":0,"cool":0},"VCmnDWCzjXsUfYJyGD45Sw":{"text":"Amazingly fluffy Mexican Omelet sans the beef. It is a personable, friendly place and i'm ","useful":2,"cool":1},"iAJ04bJtEjmBtXv_EoL-SQ":{"text":"Really enjoyed this place; great to find a cheap, tasty, no-frills diner in the Quarter. M","useful":0,"cool":1},"3TQAGFymH7mFYLDN43Rc_g":{"text":"I come here a couple times a month and eVery thing is delicious just don't order a beer be","useful":0,"cool":0},"lCmdUbn0ZHtbX20IoSE6_w":{"text":"Best place in the quarter for an inexpensive breakfast. The staff is attentive and fun. On","useful":0,"cool":0},"aGll5fnRWh8ioVoI7POuOw":{"text":"A branch of the original Camellia Grill in the French Quarter?  Now my life is complete. \n","useful":2,"cool":4},"fZaeWXF6IlUaFoJY9cw2Gw":{"text":"Their burgers are the best I have had in a long time . My daughter had breakfast and it wa","useful":2,"cool":0},"1oQruBnF5M1AqqgH78uRrw":{"text":"My mother and I came here for breakfast on our last day in NO.  We had previously gone a d","useful":0,"cool":0},"KJaaTdrQGE95wIRCEhHFQA":{"text":"This is an experience! \n\nHuge counter, where you can see the chef cooking all the food. Th","useful":4,"cool":1},"qHbV0pPVZuZskS3lEqxP0Q":{"text":"We had a good breakfast at Camelia Grill this morning, but (and this is a huge BUT) we sto","useful":0,"cool":0},"-mH1ZbDDAGQc6D_JMNm05A":{"text":"Great for breakfast or late night snack attacks.  This place has the feel of an old diner,","useful":0,"cool":0},"o_10a3Zn4JlCDVGulAVmSg":{"text":"Service: I loved the atmosphere here! So many people spring with smiles on their faces and","useful":1,"cool":0},"upAll-OOaMsHQLwah8uSgQ":{"text":"After enjoying the crazy themed parade at the French Quarter last Saturday til late at nig","useful":1,"cool":1},"7omqFfppjPlqg7NkTujV2A":{"text":"Never judge a book by it's cover.   Burgers here, although are think, are great.   Everyon","useful":0,"cool":0},"VAdB2gpf-aKsVEewDflQrA":{"text":"Good omelets. Over priced, under whelming Reuben sandwich. Burger was good. Eh..it was OK.","useful":0,"cool":0},"rR80nW0TR3fboc1JSnpVvg":{"text":"My mother and I came here for breakfast on our last day in NO.  We had previously gone a d","useful":0,"cool":0},"Gh4DjohurC88AbQUTzfsYw":{"text":"Three sandwiches, one beer, one chocolate milk, no sides, $40. At a diner. Not a restauran","useful":3,"cool":0},"iHrAxt6zt7LQndtZQQeLzg":{"text":"Loved this place for breakfast. Screaming loud and not at all fast (they actually comped m","useful":0,"cool":0},"LQEWJO4ApxRDrKrCXlV-KA":{"text":"The Grill on Chartres Street is a typical diner with counter seating that allows for bante","useful":0,"cool":0},"HUVL0kko4ioQLeDJRVMvpw":{"text":"I love a good diner, and when this place was recommended to us by our French Quarter tour ","useful":0,"cool":1},"8Q5ev-9em87loJsT6qpOCQ":{"text":"I loved this place! It was a nice atmosphere, fast service, and great diner food! There ar","useful":0,"cool":0},"ToRbYATdI9XiTw3vpJRiIw":{"text":"Come for the atmosphere, stay for the food. This place is just cool. I came here for brunc","useful":1,"cool":0},"eVRvlW-s7IFHM5SqM5Ogig":{"text":"Classic greasy spoon place with super friendly service in the heart of the Quarter. All or","useful":1,"cool":1},"zGXoFdqfkTb76ai60g-Pmg":{"text":"This location has closed, you'll find it if you search Yelp for the Camellia Grille. The m","useful":0,"cool":0},"1VcQ9KnHw1LjnDpcwxydug":{"text":"Excellent breakfast choice in the French Quarter.\n\nWe had hot tasty pecan waffles with a t","useful":4,"cool":1},"33XmJOze9kVmQ-2D75HWYg":{"text":"This is a cool place to eat breakfast as you can only eat at the counter. The staff is ver","useful":4,"cool":4},"CYsPf8Mn5-0JP7s2sRSMCA":{"text":"Oh dear, what a disappointment this place was. I truly don't understand why this place is ","useful":4,"cool":3},"QOBMcEOlA3HhiC2uAnOU0A":{"text":"This place is INCREDIBLE with a capital \"I\". My mom and I stumbled upon this place after a","useful":2,"cool":0},"G5zuo_-duWhq-gfEt7Ve_w":{"text":"Dude. Seriously, this place just gets it right on so many levels. I think they know most p","useful":4,"cool":4},"uhtS0ukugYXZqoNG7iisbw":{"text":"We had one of the worst dining experiences I have had in a long time.  We walked into the ","useful":1,"cool":0},"1Fa10ScoPufzbCap8sA2UQ":{"text":"I don't know how many times I have walked by this building and never knew there was a rest","useful":3,"cool":0},"MT4Fuax8spjA5sYkGBpUhQ":{"text":"We lucked into finding the Camellia Grill when we were exploring the French Quarter.  We l","useful":0,"cool":1},"eYqCd8ud5dllaD9sji9N4w":{"text":"I go to Camellia Grill for lunch almost once a week. The guys that work here are fun and f","useful":0,"cool":0},"TfCyX0Gz37V0BYikpfYh5g":{"text":"This is a robust, lively, bursting with personality definition of the South. John (Fonswor","useful":2,"cool":0},"F_RtKxie_MqlrMyq-5hNTg":{"text":"Another one of those places that feels like 4 or 5 stars when you're trashed, but is reall","useful":6,"cool":1},"BVum6UMr02pwXYpFYFIIKg":{"text":"Wow, you have to make a trip here if you're in NOLA. This place is a no-frills diner that ","useful":2,"cool":1},"MqyNKbyIbiu0kmnPhQcNcA":{"text":"Food was excellent but with great food comes with excellent service Suszanna our waitress ","useful":0,"cool":0},"AyZbyZB8IDPZxMU3HWoTYg":{"text":"Good food, great service.\n\nMy S.O. and I stopped in on a recent road trip. It came recomme","useful":2,"cool":1},"QkxPCBitpdgzd14i0756_w":{"text":"Note: This review is for the uptown Camellia Grill (not the one in FQ).  We were in NOLA f","useful":0,"cool":0},"28IxwXv_5CHPfKu5mx6WJg":{"text":"Great food service and fun! \nOriginally opened as The Camellia Grill in the Quarter. Peanu","useful":1,"cool":0},"sh06FeIw1y3u4qKteo60OQ":{"text":"When we came inside we were greeted by  very friendly staff. The place looks old and very ","useful":1,"cool":0},"JzTtV8hk4aJOvQtsZgEh7g":{"text":"For the first time in my life I was blatantly reminded that I am not white. Growing up hal","useful":0,"cool":1},"RI1jZyN8ORqSnrMViUYS9A":{"text":"This is a great old school counter service breakfast diner. The menu items are pretty stan","useful":0,"cool":2},"jKDn8jr1QVjJJZN5_4WBoA":{"text":"Flies everywhere. Our waitress kept ignoring us, gave us attitude, practically rolled her ","useful":3,"cool":1},"MzoO5lIQZvkWaVptQi00mg":{"text":"This was my favorite spot for food all weekend. We stopped by for our last breakfast befor","useful":0,"cool":0},"5YOvPfjiXHjKuN5hjuM_kw":{"text":"This adorable diner is reasonably priced and everything you would expect in a belly up din","useful":2,"cool":1},"nGcJs0H-qqO-Qt6qxa73ug":{"text":"Its close to everything but we must have caught it on a bad night.  Things were a little d","useful":0,"cool":0},"texPDSHsZZyra_CjMbeyXA":{"text":"Seriously, there is no better breakfast diner in the world than Camellia Grill.  \nI don't ","useful":0,"cool":1},"iaOYwAZmP3s0vtOwvdiI8Q":{"text":"I went in for an early breakfast during the weekday. You have your mix of tourists and loc","useful":3,"cool":3},"BQHm6pNuUmZSPQJxxTWr9w":{"text":"I'm so sad that this location closed. The food was amazing when my friends and I visited a","useful":0,"cool":0},"Bb7DlINRMgNJHRB-tchXjQ":{"text":"On holiday in New Orleans this week and found this place.  Very basic diner but they don't","useful":0,"cool":0},"RMaXsbFo4s-pr3Z6YRd9oQ":{"text":"ARRRRGH! The Quarter location has been discovered!  I remember the early halcyon days when","useful":3,"cool":0},"ZXeNflZugDyfDuMIFyAIDg":{"text":"Quick, easy, and tasty!\n\nYou sit down at the bar, a waiter comes right up to you and takes","useful":2,"cool":1},"hRL7RTsENY52h5QVHEFA1g":{"text":"The Grill.\n\nA sudden existential crisis--at least for this born-and-raised Metairie boy.  ","useful":5,"cool":2},"5qm4e-LkFpyA_yYL75OmEg":{"text":"I really wanted to take my friend to Camellia's during my last visit to New Orleans but we","useful":2,"cool":2},"KlDYRXicJe25XzSV5Hrp2g":{"text":"Great spot for a quick, greasy breakfast in the French quarter. Don't be discouraged by th","useful":1,"cool":0},"sVhON__ULZDAVpjWyuT-lw":{"text":"Ok, I'm a diehard and love the original location but hey, this location is HUGE compared t","useful":4,"cool":1},"Dv93LhZ5fD0nUoZoG1OMbw":{"text":"Adequate greasy spoon in the French quarter that was modeled after the legendary Camellia ","useful":2,"cool":1},"UXF-EQkkq_IX6kl22Wg4ig":{"text":"Almost missed this experience based on the appearance of the place.  Don't judge based on ","useful":1,"cool":1},"LEh7jfrc9dA9RwWjBqh0mg":{"text":"Do not believe the hype. The food was mediocre to gross and my hash browns were mostly oil","useful":2,"cool":0},"4oVn7wrBBoE0pRQqKxjl9g":{"text":"Love this place. Great little hole in the wall diner. Staff is always friendly and they're","useful":0,"cool":0},"kGs18f3zGkK08lbbwVqj5A":{"text":"Chef omelette was amazing! Waiters' personalities were so much fun! Will definitely be bac","useful":1,"cool":0},"Jl2YbU4PVPKi6JZMAiI7rw":{"text":"I went to The Grill while visiting New Orleans on 2/27/15 after reading several Yelp revie","useful":1,"cool":0},"O3FGBz4IbhP7SOUnUi3RbA":{"text":"Fast. Hot. Fresh. Dinner. That's it, you want a hearty breakfast and you don't need all th","useful":1,"cool":0},"gtPbhIcec3g6S39RlEArzQ":{"text":"I was on the hunt for a breakfast place near the Quarter and came across The Grill. The ho","useful":2,"cool":2},"scicHNqVMqRtEGDrjBF-aw":{"text":"The place gets an extra star for the personality of its staff. Fun and friendly and quick ","useful":3,"cool":1},"b1wd2uT_V6c3kHlJuLf9Uw":{"text":"Great service. Great diner atmosphere. Two peninsulas make up the dining space. Their menu","useful":1,"cool":1},"LnpT-1-s7bhm95vR2ya9Ug":{"text":"Leonard was the most personable and fabulous server I've ever encountered. As a server, I ","useful":1,"cool":0},"n0XjR9pKvPA4mMViqr-fVQ":{"text":"This place has it all...amazing food, a fun atmosphere, and good service. Don't let the wa","useful":1,"cool":2},"rjuVZWHq_ALU_hZ2og1QjQ":{"text":"We came here while on vacation due to such good reviews.  It did not disappoint! The food ","useful":1,"cool":0},"e6VVQrg4fSgX6Xrh057q7A":{"text":"Simplicity at it's finest! Being a fancy foodie is fun, but when that's all you've been do","useful":16,"cool":15},"ITtyWDffSuBy9hWEqOyj5A":{"text":"Reading the reviews I was looking forward to eating here. I ordered the catfish po boy wit","useful":2,"cool":0},"WPgfELZSNvM00ZEJ-UYuag":{"text":"Sometimes you just want some regular comfort food and this place sure fit the bill. We did","useful":1,"cool":0},"VlNM4B9ylWBJ4fjdTsIRIw":{"text":"I love the the staff. They are great characters. I have had a waffle there and an omelette","useful":1,"cool":0},"dRExjagIB6NPxK4GtS0ZPA":{"text":"Listen up on this place. I'm the pickiest SOB Foodie on earth when it comes to breakfast. ","useful":1,"cool":1}}