{"Z26_WsH2pVoKygjVMz1qqw":{"text":"Have been waiting over 3 hours for our delivery pizza and it still has not arrived. Called","useful":0,"cool":0},"ZK8zIaJcKZnDShs0soDI_Q":{"text":"I should have known that EVERYONE knows that Pizza Hut sucks. Undercooked pizza, missing i","useful":2,"cool":1},"IJPOmg-f1St7neOJkBx6uA":{"text":"This Pizza Hut consistently makes my pizza incorrectly and has bad customer service. Just ","useful":2,"cool":0},"HZz8fiNmNj5LnFpOnwVe8Q":{"text":"I ordered pizza from here last week, because I had a coupon. The pizza was fine, but it to","useful":1,"cool":0},"6pfb55hxKVCY_UKGdSFoiw":{"text":"Ordered online. Got there 5 minutes after the pizza was supposed to be ready and they told","useful":4,"cool":0},"MnKeRweldPBQIchbeaN6Xg":{"text":"Read the reviews, ordered delivery anyway. Not sure what I expected. After an hour I cance","useful":2,"cool":0},"ILcEr0B8JoRovc08T8NRKg":{"text":"Currently at the 3 hour 15 minute mark and no word from them after calling twice. This is ","useful":0,"cool":0},"FKYmhM9SjfMgnSUn5wU6jw":{"text":"We order a medium pizza with bread sticks and sucks! the pizza was cold and the bread stic","useful":0,"cool":0},"OnheY-IffPwhowVAFFpwfA":{"text":"Was pretty excited to get a Pizza Hut in the area. First  delivery, food was \"eh\". Tried a","useful":8,"cool":0},"01pBCFb4xsyPPNlVyXD4oA":{"text":"I wish I had read the reviews before I ordered, but I mean it is Pizza Hut. It's a franchi","useful":2,"cool":0},"aj2-whSwhkblAX5xbL5jzg":{"text":"This place is ridiculous.  Nobody gives a flying ... about anything.  It may as well be ru","useful":0,"cool":0},"5ICxHs9YzPQVbxMR0pJT-g":{"text":"This place was absolutely awful. I can't begin to understand how a chain restaurant can be","useful":3,"cool":0},"P_GCP5Ja5JCukXCI4lCHKg":{"text":"The hands down worst Pizza Hut franchise ever. Delivery is always extremely late if it eve","useful":4,"cool":0},"bVoJ8_FDFdSYKGXWLMchHQ":{"text":"Just ordered a meat lovers pizza pan pizza with olives and mushrooms. What they delivered ","useful":0,"cool":0},"Ljlby7MWLwpVvSbW-1UPSQ":{"text":"I ordered a large thin crust and some wings. The wings were fine but the toppings and sauc","useful":1,"cool":0},"tYDVDGjreQCSUUWJKmVpXQ":{"text":"Boy,\nI should have read the reviews before I ordered from here. Everyone's compliant on he","useful":1,"cool":1},"74WIZ3DLwBgdTHay4qix2w":{"text":"I had a horrible experience trying to order pizza online. The website wouldn't process my ","useful":0,"cool":0},"c8tiOtZow0wmGPZHUWr-oQ":{"text":"I have now ordered from here 2 weeks in a row, last week the pizza supposedly had to be re","useful":4,"cool":0},"Nll1Lp60er-vvrgbHFqJaQ":{"text":"My pizza was mad incorrectly, and I called to correct the problem. I couldn't hear the gir","useful":0,"cool":0},"6g8uviO2vlsR3vlFAEJ1ZQ":{"text":"If could give less than one star I would.  At Hangout Music Festival this year (which was ","useful":5,"cool":0},"DRnzinCYwOOLCeGNRfRWKA":{"text":"Literally the worst Pizza Hut in existence. Ordering from here is like entering a Dalian w","useful":1,"cool":0},"bHrAafVaYNXM-uf7PIkDuA":{"text":"Oh man do I hate this Pizza Hut. I've never had worse customer service in my life. So let ","useful":2,"cool":0},"XKKTDmziLI4buxC6C0iEnA":{"text":"Horrible!  ordered pizza online quoted me 1 hour delivery quote Pizza came after two hours","useful":0,"cool":0},"18cvRNHVDHvigYaHtuJ0tw":{"text":"Waited an hour and a half for cold pizza, and the delivery driver made me go out to her ca","useful":4,"cool":0},"2gQX3xMB2DXsU4zLPPqhqg":{"text":"If I could give zero stars, this place would get that.  Never used this pizza hut. Never w","useful":2,"cool":0},"eAqyxJIscMuR3fTi1csXCw":{"text":"TWO AND A HALF HOURS LATER. Never order from here. Just order dominos! Third and last time","useful":1,"cool":0},"lCB-_pPcDJaFR0rRWdwLOA":{"text":"I was so excited when they put this pizza hut by my house. The first few times I ordered i","useful":3,"cool":0},"ak-gl2uTXe1Hz04Lr2qjNQ":{"text":"Takes over an hour for delivery and pizza is cold. Call and they won't give a refund or co","useful":0,"cool":0},"w-qsHezaXEB-d15kg_HELw":{"text":"Previously, we ordered from here, had it delivered, everything was perfect. This time, how","useful":0,"cool":0},"IZonExcrPY48jeaT4AJdeg":{"text":"See a lot of bad reviews but they have always been very polite and orders have been correc","useful":0,"cool":0},"sggJdhqL63BklExAcq1ccg":{"text":"Ordered a single large pepperoni pizza and an order of mozerella sticks for the kiddos for","useful":0,"cool":0},"km4vpTlTShK5RvKJSX-_HQ":{"text":"Will never order from this pizza hut again. Slowest delivery and very unhelpful. Going on ","useful":4,"cool":0},"gLDlCgaMulduonwGt6YtaQ":{"text":"How is it that a delivery driver can't find a house with the address and phone number of t","useful":4,"cool":0},"3FIk97cqBAT_vnvV-j7mQQ":{"text":"Ordered the new cheeze it pizza which was interesting, cute in presentation, and full of a","useful":0,"cool":0},"UQLBSWxGFK7IZQ-SmZi35A":{"text":"After calling in several times and being hung up on, I called the store the next day. The ","useful":0,"cool":0},"5XS55JiBgucTSi_oiRT0kQ":{"text":"Twice I have ordered and they brought the pizza 2 hours later and seriously said- \"oh you ","useful":0,"cool":0},"ZB7wKNoshm3RFdCCqeDEtg":{"text":"Literally the worst pizza hut on the planet. Just do yourself a favor and go anywhere else","useful":0,"cool":0},"qSPb-JgAezPsSgFl5-k1-g":{"text":"I keep trying this place its seems every 3rd time I order I get the correct order which ma","useful":1,"cool":0},"LcTttqAY8Sny1vKUMd8lLA":{"text":"If I could give zero stars, I would. \nCold ass pizza, late delivery, got sent to wrong hou","useful":2,"cool":0},"21Y7f5SOHS05cGMALVpzsg":{"text":"Awful! Was told 15 minutes for pick up, waited for 45 minutes. One of our pizzas was entir","useful":7,"cool":0},"nA80rbLH-SOSQm6HZ_y8ZA":{"text":"This has to be the worst Pizza Hut on the planet!!!! Complete shit show on all levels, you","useful":0,"cool":0},"nHiVPHRGoCPP1Z8cKkqZDA":{"text":"Pizza taste old and they constantly forget to put the crust flavoring on. You can try to c","useful":0,"cool":0},"aneu-JZUJsAcObVK3vvo_w":{"text":"The driver would not deliver the pizza to my apartment door. The driver wanted to me to me","useful":0,"cool":0},"a3XnGyjxywg3JgeoFcigsQ":{"text":"We had to wait two hours for our pizza and when it came, the order was wrong. We ordered t","useful":0,"cool":0},"QbzsbGV7MmNfUllQWBCnpQ":{"text":"I placed order and a hour later received text saying pizza was out for delivery. At this p","useful":0,"cool":0},"g6dXVXa2dau6O8MjRiHtWw":{"text":"I don't know why this is one starred. I've ordered here and only gotten accurate and timel","useful":0,"cool":0}}