{"ncBvLxUMpViHYd4vUW1C4Q":{"text":"This place is amazing !  Outstanding service,great ambiance, live music and amazing food. ","useful":0,"cool":0},"kd_AEpyIZXN_Ps6b76fBIg":{"text":"Awesome atmosphere especially if you are wanting to escape the craziness of Bourbon street","useful":0,"cool":0},"Ksb_X129KI4U8SaMh4f00A":{"text":"Enjoyed a good meal. Atmosphere is great if you are in main dining room.  Service was awes","useful":1,"cool":0},"vcYNWhOteGQV1TKT2oySjQ":{"text":"First time visiting New Orleans and I went to Cafe Sbisa. It was incredible! Check out wha","useful":0,"cool":0},"D0O9L_luv6HXEqcumVM9lg":{"text":"This place is amazing!!! Live entertainment on a Saturday night. The food is next level go","useful":0,"cool":0},"VgeJIYLW6MhB2oSRXXGPJQ":{"text":"Great atmosphere and good food.  Perfect place to sit back, relax, and enjoy a good meal a","useful":0,"cool":0},"9bFFbyYB5sR7rFpbxuTk5Q":{"text":"Still at Sbisa, rainy Jazzfest Sunday. The soft shell crab awesome, ribeye and eggs excell","useful":1,"cool":0},"cHPTdkifbkxJV4OeCeIE7A":{"text":"This place was awesome!!!!! Great food and a live jazz band... they played my fav song at ","useful":0,"cool":0},"cMLTaaV59pvTc_JyPInuTw":{"text":"Ambiance is fun - great music.  Recommend sitting upstairs so it's not terribly loud.  Foo","useful":1,"cool":1},"25o8BC4K0ImqPyCXSvwm4g":{"text":"Glad to see this historic building is back. Chef Alfred has everything under control, the ","useful":0,"cool":0},"HZQa7iXmDkOrajuySeEeFw":{"text":"Let me tell you!!!! This place right here AAAAA-MAZING! EVERYTIME EVERYTIME AND I MEAN EVE","useful":0,"cool":0},"R0zBxJ6mu1tOxXgIsbJdYQ":{"text":"The food was amazing!! \nChef/owner greeted us upon arrival. \nNo reservation and were seate","useful":0,"cool":0},"y50ATp8YSwiCfrd9iClfPQ":{"text":"The food was so so, the service was bad, waitress would disappear .....\nCharged us for som","useful":1,"cool":0},"4P9IsEe5VKS8qBGrhAiq8A":{"text":"My boyfriend and I were in New Orleans for the first time and wanted a \"date night \". We s","useful":0,"cool":0},"42QtGYjkR3PUvOxk-p9jUQ":{"text":"We went into this restaurant after looking at yelp pictures. If I could give this restaura","useful":1,"cool":0},"26NsRMVrj4c6VdaYjvbDvA":{"text":"I'm so glad I tried this place! I'm from Texas and I was hesitant to try their BBQ shrimp ","useful":0,"cool":0},"vLxEHn_mKiPuxwrmjdWByg":{"text":"So good!  They didn't have our reservation but sat us anyway.  The wine was good...the coc","useful":1,"cool":1},"0efdfaOGuo3y5sU7sojfNA":{"text":"What a great place in The French Market. The food was awesome, the service was superb, the","useful":0,"cool":0},"jOjcFp-6_LAtXMMdF8SYkQ":{"text":"Service and food were excellent! Our table had the seafood gumbo, bbq shrimp and the trout","useful":1,"cool":1},"l34hqRzhYLZI471QFIUExg":{"text":"Lovely meal in the terrace. The gumbo and fried oysters were delicious. My crab cake was t","useful":0,"cool":0},"X3kJ_t-kt_0RBYPplVqShw":{"text":"Called Cafe Sbisa to reserve a table on the balcony (and followed up in the confirmation c","useful":0,"cool":0},"Syrw0pf52vklMRwt5c3EIQ":{"text":"What a disappointing experience! We arrived and were seated on the balcony, which was fine","useful":2,"cool":0},"yCpgsS8j0B_KqtXtc-W_JA":{"text":"Turtle soup and Gumbo of the day were amazing! Had the redfish topped with crawfish tails ","useful":0,"cool":0},"fTm9XfeOlmiRd0g2RaBp7w":{"text":"Had a great dinner and the service was fantastic.  If you get the cesar salad add the gril","useful":0,"cool":0},"zdbQ7zVGdjRW6r9WCwRlIA":{"text":"Veal & Crab was incredible!  (That should have been all caps).  My wife raved about her fi","useful":0,"cool":0},"5reHD5TDLMqOSK4bq7KbrQ":{"text":"The best meal I had in New Orleans was at Cafe Sbisa. The service was phenomenal, the ambi","useful":0,"cool":0},"MkjclbrH_c0-fWqPUhc84A":{"text":"We walked in without reservations, the Chef/Owner moved some stuff around to accommodate u","useful":0,"cool":0},"dNNCm4lou-ENAnPMeAocHA":{"text":"Reminded me of the decades-old \"family restaurants\" that I grew up seeing in India- that I","useful":0,"cool":0},"n9-yzKy3PjbrKnGbVg-aVw":{"text":"We visited for a group dinner. Across the board, everyone was pleased. \n\nAmbience: romanti","useful":0,"cool":0},"zW7axmpUrOqU82V4ueOeeg":{"text":"The food and service here were even better than expected. My husband and I came for his 30","useful":0,"cool":0},"uJkDHIGOnBrnWrDt1mDjcA":{"text":"Great food and friendly service. We ended up getting there half an hour earlier than our r","useful":0,"cool":0},"N1vCDrSenc3j1VbmaUxlcg":{"text":"You've googled and googled and found many list of restaurants in New Orleans, most of whic","useful":0,"cool":1},"Ljqo07ekkew8Vn31xiLvPA":{"text":"Fantastic, classic southern service from when you walk in the door. I had the gumbo and th","useful":1,"cool":1},"s12pkcsIBQzlIKi-cve50A":{"text":"OH MY GOODNESS! almost went back twice in 3 days because of the food, staff, drinks and at","useful":1,"cool":1},"2xuAI258QNQWp82kj45mzA":{"text":"We read a review on this place and decided to try it out! It did not disappoint! Small and","useful":0,"cool":0},"cG_RsRKKKihBepGiNFZ9Wg":{"text":"Delicious food and great atmosphere!!\n\nI would recommend getting a reservation, we walked ","useful":0,"cool":0},"o14xHGTJHbLoPdWlviV_Kw":{"text":"Excellent service, quality live music, delicious food, and a romantic environment. Perfect","useful":1,"cool":0},"945sMUjngfH51_qRhcqqlw":{"text":"This place was wonderful!  Very friendly staff!  Scrumptious food! I recommend the seafood","useful":0,"cool":0},"cNwcGjoAGABNphTP4jo3EQ":{"text":"Oh, yea, it's back.  The ambience is just right. The staff is top notch. \nThe drinks and f","useful":2,"cool":1},"__6NXPNtb7tyIRLH7CXg0w":{"text":"A M A Z I N G, the richness of the crab cakes to die for and the desserts even better. A w","useful":1,"cool":0},"3Dh3Dx9laPIKwOgMZveQRA":{"text":"This is my third night in New Orleans and I wanted to have an authentic experience but sti","useful":0,"cool":0},"pKSFRbVBnA92I80mlLwmow":{"text":"Mark the bartender and Greg our server really made our experience here! All the staff was ","useful":0,"cool":0},"d4wlrUA8Z1nhOIhEfUh06w":{"text":"Had the most amazing meal here. The service was great with each waiter in the restaurant i","useful":0,"cool":0},"kUeT-NkAbhyN7x6lyzZVBw":{"text":"This restaurant is amazing. The food we had was delicious. We started with Turtle Soup and","useful":0,"cool":0},"YJcdsGHQh04-b3cyOYRAuw":{"text":"Time to dust off the ole yelp app and give this place a 5'er. Decor, food, and drinks were","useful":2,"cool":0},"DTfTTpwqLyAtnYiJH03JSg":{"text":"I got the red snapper and it was to die for. It was cooked perfect. My boyfriend and I sha","useful":0,"cool":0},"paexS61uGByQ020YG3PxHg":{"text":"Best crab cake and turtle soup. Very warm service with nice ambience and live jazz. Unforg","useful":0,"cool":0},"DwmyiVxx_5t2WSi0Y7QItQ":{"text":"Bottomless mimosas, pasta jambalaya, cheesy biscuits, and a kick ass waitress named Stori.","useful":0,"cool":0},"lMP4D94lbVgqLNFbeJ6FWQ":{"text":"Food was fabulous !!! The atmosphere and entertainment were great as well! The staff were ","useful":0,"cool":0},"ASOfsW2X5J1D7wQOtJkY0w":{"text":"I'm not wholly sure where to begin...was it the host's responsiveness to my ever-changing ","useful":4,"cool":1},"BdbnvoIIo5s2BNmKtDpnrg":{"text":"Was skeptical with all the excellent reviews.  This place definitely held up to their exce","useful":3,"cool":0},"HP7WvS_2AVbCvea-9eUIUw":{"text":"Perfect way to end our honeymoon! We sat on the balcony and were able to hear the live mus","useful":0,"cool":0},"epgYFqacORp8EVTjpmYV6Q":{"text":"This is an excellent dining establishment in the French quarter. We were seated on the sec","useful":1,"cool":0},"Uov2xynah-HOMTGBc5nz8w":{"text":"OMGGGGG! The turtle soup was delicious, I'd have that as my last meal (add sherry), I had ","useful":1,"cool":0},"dxKbbKEGavInCpkD_EFVXA":{"text":"We had a fabulous dinner!  The portions were huge and generous. Great service and ambience","useful":1,"cool":0},"GUF6SiMY7k0T5HAj3YXiUA":{"text":"Amazing creole food! I spent a week in New Orleans and this was the best meal. The gumbo w","useful":0,"cool":0},"6g7-yXxez5m6yQy5L4moJQ":{"text":"I'm typically not a 5 star guy, but this experience was pretty darn perfect. Sunday Jazz B","useful":0,"cool":0},"ptDB6A6lAjrp2i9eVq-ETQ":{"text":"I WANT TO MARRY MY WIFE ALL OVER AGAIN, just so we can hire Chef Alfred Singleton and his ","useful":7,"cool":4},"kuPL6ZCW-QDUsYldnOhFCw":{"text":"Hadn't been to Sbisa since the 80's, so returning was a treat. We ordered the gumbo, fried","useful":1,"cool":0},"Pk2NuzfqHHAc418w45jlew":{"text":"Kind of a spur of the we are hungry pick a place quick stop. Well it was beyond worth the ","useful":1,"cool":0},"0-4cj8-cw_1rcWjHzzEmvg":{"text":"As good as we have had in not only Nawlins, but anywhere.  Food and service were second to","useful":0,"cool":0},"1ikk4PvVIJV5E0fGAr7ZaA":{"text":"I am on an annual road trip with 2 longtime friends and we have eaten our way across the c","useful":0,"cool":0},"TLbPwrOpRpmeXZo7Xc0pJQ":{"text":"Terrific resturant. Service fantastic. Food fantastic. Did not disappoint. This was my sec","useful":0,"cool":0},"BTJ8IX8XvLy0R6Y74mGP7g":{"text":"Excellent food! Great ambiance and wonderful waiters, hosts! Highly recommend eating here ","useful":0,"cool":0},"-uYVLDaTGC8-LvEydo5yJA":{"text":"Came here a few months back for a NOLA bachelors party trip. Our first option for dinner w","useful":0,"cool":0},"0Af8aAJXXudCTlgLRgDcxw":{"text":"Made a reservation for the jazz brunch for 10:30 on Sunday. We were greeted by a friendly ","useful":0,"cool":0},"kg9lBwidn8ZpX-j-yTq5gg":{"text":"Service was excellent, food was good but a little underwhelming if you've never had Louisi","useful":0,"cool":0},"82f9ulId1Z5v0Wp29naqYw":{"text":"Great restaurant the staff, food, ambience was such as good vibe and refreshing to see wit","useful":1,"cool":0},"KxeaeSMde_sDgD7JLF7niw":{"text":"A fantastic place to listen to soothing classic jazz, enjoy your favorite cocktail and foo","useful":0,"cool":0},"IIGi2vckTxWCNAYtfqdOnA":{"text":"Absolutely Great food. The pain Perdue is fabulous!!\nKevin is a great waiter. \nNot sure ho","useful":0,"cool":1},"CZlNjX4X7FID5NyAsY3qgQ":{"text":"We made a reservation to dine at Cafe Sbisa to celebrate my mom's birthday on our first ni","useful":0,"cool":0},"yZcghextkC7F6Hx408DppA":{"text":"Fabulous food and service! Thank you for a wonderful date night with my fiancé. It was ver","useful":1,"cool":0},"wk63d1FvL8EHGYXdrOGspw":{"text":"Sunday Brunch Review: \n\nThe short- My brunch was meh... I wouldn't come back. Jazz music i","useful":5,"cool":1},"Fru3yUMTurHDvoKWqfhAzg":{"text":"A really authentic New Orleans experience.  The building has an incredibly fascinating his","useful":0,"cool":1},"BBV1ZiTxrCZ-6LZWSlGOmw":{"text":"Beautiful atmosphere with True New Orleans charm . The service complimented the cuisine. C","useful":0,"cool":0},"Gs-6SDcCA7czgqv5RNQqHw":{"text":"It was my first time in New Orleans and I was anxious to try some good Cajun cuisine. Café","useful":1,"cool":0},"nEqMNdlcChU1lCPp1c4TzA":{"text":"This place is a gem!!This was easily one of my favorite finds being in New Orleans! The oy","useful":0,"cool":0},"iXvSZDNYnz7yYbOXmuW8jg":{"text":"After checking reviews and with no advise from friends we gave Sbisa a try. Had to call to","useful":0,"cool":0},"4maOrw5FVZ-mEJCXDyK__g":{"text":"probably the best meal I've had in New Orleans. The veal and crab was spectacular. Can't w","useful":0,"cool":0},"94og9G9I4lFZ42ka4s1Vgw":{"text":"This was one of my top 3 favorite restaurants in NOLA.\n\nFirst of all, the ambience. You ca","useful":0,"cool":0},"FJsDmD4D9IMyFsN-Aj6Avg":{"text":"Staff had a complete meltdown last night.  Not sure what we going on with them - we had an","useful":2,"cool":0},"Td-my4CujiMDfKB6hFmWDQ":{"text":"Only came here for drinks. They have a nice selection of cocktails and bourbons. Good to s","useful":0,"cool":0},"r5TSe0SJHW-OXJlVi3fnVQ":{"text":"First of all, A HUGE RAT ran across the floor next to our table, TWICE. Our waiter was una","useful":1,"cool":0},"Nw9Ef0BM32Dx4ZvWG1qmGg":{"text":"I went to New Orleans with a large group of people to celebrate my 30th birthday. The dinn","useful":1,"cool":0},"jI2ns30t8exGtdTsZbcUVw":{"text":"This place is AMAZING! One of my favorites was a starters was the fried oysters it came in","useful":0,"cool":0},"ZPA137ImyC1n69JHYZsNPw":{"text":"This place was delicious. I got the seafood bouillabaisse, and it was tasty, and surprisin","useful":0,"cool":0},"MpMUH0HXneM5YlpHa_phiQ":{"text":"We came for  Sunday Jazz Brunch at the Cafe. The service was excellent, efficient, but not","useful":0,"cool":0},"Oa5KCNUFonobBfxKeMhRZg":{"text":"Can't get enough of this place--so much history, great music, and the food is ALWAYS over ","useful":0,"cool":0},"l50TM6q4AjVMNPX3X3FsmA":{"text":"Food was nothing special 3 stars, but the service was terrible negative stars. Our waiter ","useful":1,"cool":0},"MHfARwapo0PXCqN5Tk5lXA":{"text":"This was the best meal we've had in New Orleans. The owner also owns a crab dock so everyt","useful":0,"cool":0},"__nzVTgcU1U0TQQzziixSA":{"text":"I don't normally rate restaurants, however, the food, music and staff is worth the FIVE St","useful":0,"cool":0},"bc_uWwld-RXIzmXDPTkQFg":{"text":"My friends and I had the most amazing experience at Cafe Sbisa! We were a group of 12 ladi","useful":4,"cool":1},"1jR658HSYOI3v5T6OHp5Xw":{"text":"Extremely impressed everything from the atmosphere to the music to the garlic bread I've g","useful":0,"cool":0},"gjR0qA395bNH3uEdeJLJgA":{"text":"Our anniversary and the place was empty at 7:30 pm. Host sat us at the worst table in the ","useful":1,"cool":0},"Juud_cYp4yQ8j6Cxi2Jt9A":{"text":"May have had the best brunch ever. We were in the French Market area and wanted some lunch","useful":7,"cool":1},"NCdUXvFQg1NP4N2D8qqc7w":{"text":"Wish they offered 6 stars!  God, I love this place!  Always was a favorite of mine and the","useful":0,"cool":0},"kzzFKmiQ3ga_hi7R2p19DA":{"text":"AMAZING STAFF. I think the menu is extremely average for Cajun food. The bar itself is ver","useful":0,"cool":0},"HiTDWw-D7NUocf-bb5PSPg":{"text":"My husband and I came here to celebrate my birthday - and had the most wonderful dinner. S","useful":0,"cool":0},"SvpzNDxp2VCUB80TMFeN_Q":{"text":"If you are looking for rich and flavorful dishes, this is the place for you!\n\nHad the turt","useful":0,"cool":0},"qMG8d3SdQDdFhAB----0ng":{"text":"Cafe Sbisa was a little disappointing. It was uncomfortably cold in the restaurant. I had ","useful":0,"cool":0},"5NXS7zxG0XLm3iU0yUQtMg":{"text":"One of the nicest, best restaurants in NOLA. Elegant yet comfortable with professional and","useful":0,"cool":0},"JkSmPrRJTVXBg0hrqRNoiQ":{"text":"Gorgeous old building.  The waiter gave us the history -2nd floor was a brothel and 3rd fl","useful":1,"cool":0},"b5nuGLnGAMbYfA089tKLWg":{"text":"We were so happy to stumble into this restaurant.  We didn't have much time in NOLA (sadly","useful":0,"cool":0},"xS_W_eui94T77D8qB5FC3g":{"text":"What a lovely experience. I was in a low key mood after surviving 3 days of a bachelor par","useful":0,"cool":0},"_XKHHIo0niTMnuJxbfKboA":{"text":"The ambiance is great...has a very vintage-y feel with the brunch, dark wood, and live jaz","useful":0,"cool":0},"OC0YxZ92I3RfMnPMGb9HaQ":{"text":"So nothing was bad. Our waiter was great. The food was across the board average. Started w","useful":1,"cool":1},"mmHGxAiD8Tb3sFSxTc34YA":{"text":"Can't say enough great things about this restaurant. AMAZING FOOD, AMAZING CUSTOMER SERVIC","useful":0,"cool":0},"EcBq2CNm9LErM7kTg66NNQ":{"text":"This was probably our best meal in New Orleans. Everything we ordered was fantastic, the s","useful":0,"cool":0},"UBqE0A3gQfBL93oT0u5KJA":{"text":"Wonderful customer service, great atmosphere, and the food is to die for. Highly recommend","useful":0,"cool":0},"M7v3m9axjIAOaB2gODTGuA":{"text":"HIGHLY RECOMMEND!!! My husband and I came here on a private date while we were visiting Ne","useful":0,"cool":0},"Jr_tudWTNBndCKUzG9nSlQ":{"text":"So...where do I start?! This place is so f-ing good.  Everything was delicious.  I had a b","useful":1,"cool":0},"PJ0lJwkBjJLnWnssFf-sWw":{"text":"When I went to Cafe Sbisa, I had already been to two other restaurants where I had not fou","useful":0,"cool":0},"B0cBPpYVOiaIQba7airnBQ":{"text":"Everything from the food to the service and the live music was wonderful.  Our favorite it","useful":0,"cool":0},"Z2B679nJswJoYVF28BXeQw":{"text":"My first trip to New Orleans & it could have easily been overwhelming.  Luckily a friend o","useful":2,"cool":1},"hy_Vz02Cdexg16RiSVge3g":{"text":"Came here with some work friends while traveling in Naw'Leans. Chef's Redfish and Pork ent","useful":0,"cool":0},"lVnhvbUKdf2vi8NG_LbqpQ":{"text":"Omg! This place is everything I desire in a dining experience and more! Great cocktails, g","useful":0,"cool":0},"hCTaFjBLAyqaFR-g_e1ZyQ":{"text":"Met up with some friends for dinner. Everyone was excited as the restaurant had good revie","useful":0,"cool":0},"l6AOZq8pEq-M3Iev70214A":{"text":"The food was all excellent. He had the fish of the day and I had a filet. They were both c","useful":0,"cool":1},"ZpNH2rOu_VhfxsaOvc6cyw":{"text":"Went here for dinner on New Orleans business trip. Great vibe in the heart of the French Q","useful":0,"cool":0},"OSS3nqMl7FFXkt6Uw0P9lw":{"text":"Outstanding!  When you enter this restaurant located by the French market, you get a feeli","useful":0,"cool":0},"K5csFS-xeWiLCK3N60OYlw":{"text":"Cafe Sbisa is by FAR my favorite place to get some turtle soup. Mmmmm mmmm it's also great","useful":1,"cool":0},"mKmDf9z3J5eJrTI6p_7I3A":{"text":"A friend of mine and I chose Sbisa at the suggestion of a feiend.  Our server Greg and his","useful":0,"cool":0},"Tuud5tuvES1wImv58VVXpA":{"text":"You can tell from our interactions with the waiters and other staff that this is definitel","useful":0,"cool":0},"Mapr2Co4ncgyhmW6ijFpKA":{"text":"Very good fish. Had a white fish with amazingly tasty sauce. \nThe Chef would came to a tab","useful":1,"cool":0},"bZ5yI4hJ-nPBUUukzW3LHQ":{"text":"The menu looks simple but everything is DELICIOUS! \n\nWe had a big lunch so we didn't get a","useful":2,"cool":0},"eXT2vOJni3s3OPbPjXXALw":{"text":"Although my food was good the service was mediocre, and the manager was horrible. I brunch","useful":0,"cool":0},"0NYO3kHd5_hEXwjBr-usDQ":{"text":"Great food. Ask for outdoor terrace seating. Great atmosphere. Chef is jovial , came and t","useful":0,"cool":0},"5rhoX25ziP3fjNHbkWxV9g":{"text":"Everything was incredible. As billed, Cajun Creole and the seafood was amazing. Live jazz ","useful":0,"cool":0},"VemUk8AAihltoUJ9ZuOWvA":{"text":"Excellent! My husband and I went on a Sunday for brunch. Friendly, quick service.  We enjo","useful":0,"cool":0},"yoZSExV5l5Ay3MCf6vDkSg":{"text":"Wow, just wow. We went to jazz brunch this morning & had the most amazing time! We sat ups","useful":0,"cool":0},"yPf_yl-WbhJgqPsBicebDQ":{"text":"went for my friends birthday it was a very nice atmosphere. There was a live jazz band tha","useful":0,"cool":0},"MFfdSnKl9eZZh1Ev2N1tJQ":{"text":"This place was such a gem! First, the ambiance was so cute and romantic. We sat outside on","useful":0,"cool":0},"rWGTDG3ZWSRVAq96qOwVwg":{"text":"Fantastic seafood with exceptional service. While the menu is a bit limited with only thre","useful":0,"cool":0},"YrmIUNW5uHoiw7izLkc3ZA":{"text":"Came here one day on a recommendation from a classmate who said the owner graduated high s","useful":4,"cool":3},"Yrw3YuYZ568ZP5WrPiNOug":{"text":"This is the best restaurant I've eaten in New Orleans. The service was excellent, the food","useful":0,"cool":0},"e7b2wHY33_Eu8flWn9jsKQ":{"text":"Very fine dining with a superb service, which we all really enjoy. The waiter was kind, an","useful":0,"cool":0},"IDVCyypmh1tQTjEpjEkSag":{"text":"Ran upon this place and the food was excellent - great gumbo and crab cake with eggs.  The","useful":1,"cool":0},"JB39yyVRn-gjraBUVC-Siw":{"text":"Here from Baltimore for a weekend vacation. The food was really good. We ate light just be","useful":0,"cool":0},"SoW4PLL-KbpkQicLtM0ymA":{"text":"Amazing food and service. I was there for a team meal after a work event and we were given","useful":2,"cool":1},"dLMaYXLZthS5MN_u-gLXbA":{"text":"This is a great restaurant! Good Good and excellent service. I had the red fish with BBQ s","useful":0,"cool":0},"YAcU3eZuHaLjX5s2db-aBw":{"text":"Essay 5 Star rating from ambiance food to service.\nSuch a fantastic cozy yet spacious rest","useful":3,"cool":0},"W2WWgqWiiNNbjq4z707lgw":{"text":"Sorry, not 5 stars folks. The food was good, although our waiter didn't come by very often","useful":0,"cool":0},"GUxwMCWy1xtrhXXjQxXOmA":{"text":"The most delicious meal ever! The Trout Eugene was so tasty! Service was impeccable. You h","useful":0,"cool":0},"aoZvvy5OmS9wBCIY8L4zyw":{"text":"This place was fantastic for my birthday celebration. The service was excellent. The food ","useful":0,"cool":0},"CZazcktovmq73PvBA5F94w":{"text":"Decided to have my birthday dinner at Cafe Sbisa. This was my first trip to New Orleans an","useful":0,"cool":0},"gh3BWiJizJEqJD4nRyy1ew":{"text":"This place is excellent! The service was outstanding, the food is some of the best I have ","useful":0,"cool":0},"EAaIVtuNZ7LREyXHyECPIA":{"text":"Overall a fantastic experience. We found this place and just happened to get in. It was so","useful":1,"cool":0},"4dT6AeoQcjt7dFUss-jIrA":{"text":"Café Sbisa opened in 1899 and is the third oldest fine-dining restaurant in the French Qua","useful":1,"cool":1},"VvuKhjN54a1rcHJARkkKIw":{"text":"While the food was ok, the service and management was awful. We came during Jazzfest, whic","useful":3,"cool":0},"Fc0wmWEtUT-1PFJ7GixI-w":{"text":"It was a last minute decision to go to Café Sbisa so me and my girlfriends went there with","useful":4,"cool":2},"tggsm3dHaUFyOJdykgC-Aw":{"text":"I really wonder about all the good reviews here. Really old looking place with very bland ","useful":0,"cool":0},"LHZOXLkoS8Lx_aBQPmJ_-w":{"text":"Fantastic! Best meal that I had in New Orleans. Also, when chef walks up to each patron on","useful":0,"cool":0},"nhE70gccsNdedFGaxyuMkA":{"text":"The pros:  every efn thing about Cafe Sbisa stands out. \n\nMy wife and I celebrated our 1st","useful":1,"cool":1},"JSDlftyOyq1zOB02FF1o6g":{"text":"We just got back to our hotel.. The food was good but that was by far the worst service we","useful":0,"cool":0},"g6sOlvvYTxNfPNHy_2ySjw":{"text":"There is no shortage of restaurants to chose from in NOLA, and historic ones too. Our rese","useful":0,"cool":0},"Z28GKRlhFkYzCDJKV3l5ng":{"text":"Amazing. We arrived a little earlier than our reservation time. We sat at the bar and orde","useful":0,"cool":0},"M0uYsh0gGPwrSUJzOws3uw":{"text":"What a wonderful surprise! Having only reviews to go on, I was a little hesitant when I sa","useful":1,"cool":1},"W5nqAVm2nAxiCC-lJE-5kA":{"text":"We came from Austin and wanted a nice restaurant we picked this through Yelp by far the be","useful":0,"cool":0},"kHrLYJIbL-QiL5bFLCJM5g":{"text":"I'm glad that Piscobar's kitchen was closed because we ended up eating good at Cafe Sbisa!","useful":4,"cool":2},"psBw0ubJyKqUk4SADmsUWA":{"text":"We went on a date here and had a great time. The staff is super nice and helpful. We sat o","useful":0,"cool":0},"TKh21I3qnI2YrSar34Ssog":{"text":"BBQ Crawfish was below average. Shrimp were over cooked and some had disentrgrated in shel","useful":0,"cool":0},"cVqyKWgQoKrgVgsgcOjXdA":{"text":"We went there for dinner and were pleasantly surprised by a great quality of food, nice an","useful":0,"cool":0},"59CXCoaFq8MM5wESLeznWA":{"text":"Excellent find!  I suspect it will get increasingly hard to get a dinner reservation - the","useful":1,"cool":0},"XCnK-Ldy2w_DL2wf5e_KjA":{"text":"Cafe Sbisa is so good we chose to go there for two of our three dinners while visiting NOL","useful":0,"cool":0},"YcwApvW5Jlt3u4K72UYdhA":{"text":"We came to Cafe Sbisa for the Sunday jazz brunch. We were celebrating my best friends wedd","useful":0,"cool":0},"7FPl_yNDogvDC9X9-TM2Jg":{"text":"The wonderful live jazz was a treat. The seafood and steaks are delightful. For the #1 foo","useful":0,"cool":0},"XIqvPdGMHIMs5WRzsd_etQ":{"text":"A delicious southern meal in a restaurant with wonderful decor. Beware - the portions are ","useful":1,"cool":0},"x9V4422Z-XhxIupk2fpE6Q":{"text":"Came here for a birthday dinner. Were able to make reservations the same day which was gre","useful":1,"cool":0},"R2hYSjF-2TPuyZaCKUKRqw":{"text":"If you love Rebirth you'll love it here. Amazing atmosphere, very cozy and fun but still s","useful":2,"cool":1},"sNxXPLQ7-bVvNMKxGcoPKw":{"text":"Attentive service with a smile.  Good food.  Great smooth jazz duo.  Nice ambience.  We fo","useful":0,"cool":0},"SiSuZZxtUI5XdpExS4nVGA":{"text":"This us probably the best meal I've ever had.... Anywhere. The turtle soup was amazing. I ","useful":0,"cool":0},"kdp_Y_pRrovLxq9ryBzYPw":{"text":"Amazing gumbo and turtle soup. Serve everyone's plates at the same time. Dont have to dres","useful":0,"cool":0},"SIzWI47hzd9VLatvqUw4_w":{"text":"This was the perfect place for a beautiful (and delicious!) brunch after a crazy night in ","useful":0,"cool":0},"ONBx4ZpfKjj8xLh3jkdyaw":{"text":"I really love this restaurant because the waiters and waitresses make you, their customers","useful":0,"cool":0},"jjLEpuWLF-JNaIhLepsGeA":{"text":"This place is a gem! First, the ambiance is perfect for any occasion. they had a jazz band","useful":0,"cool":0},"bjhmDi3VdlPzF73GCHxtRQ":{"text":"My husband and I happened on this wonderful restaurant and were so pleased with everything","useful":1,"cool":1},"aOG7YOxOFfLmJMIXvHhBhQ":{"text":"We came here for dinner on my birthday. Overall the meal was good but it didn't blow us ou","useful":0,"cool":0},"P7yieH9UUDsLVYPizDibwg":{"text":"\"It's Jazzfest\" so don't ever go here. The staff and management couldn't handle a big part","useful":4,"cool":1},"cf-amwgnOhe30TQk29CgrA":{"text":"Melon and prosciutto salad, crab cakes and gumbo all on point. Great service, nice ambienc","useful":0,"cool":0},"DiBPEs01d7vLVrSIfRN30A":{"text":"Want to rate it a 4.5, but oh well. Excellent food, the only minor grouch was that the shr","useful":0,"cool":0},"n03wiVMKKlz1MGg9LzVL2Q":{"text":"Wait staff was super nice but our food was okay at best. The sauce on the trout was yummy,","useful":0,"cool":0},"xvwrZvruDkxL-9OZoYjTPg":{"text":"From the warm atmosphere, historic elegant interior with its inside balcony seating, and t","useful":0,"cool":0},"1iu9VsaylamyuOecHPMT2w":{"text":"Impeccable service, impeccable food!!!!  I cannot say enough positive things about Cafe Sb","useful":0,"cool":0},"vkBEFhSoGZ0rjky9NYwgUA":{"text":"To a very small degree we can blame this on the fact it was New Year's Eve, but to a very ","useful":0,"cool":0},"vX04dFxQqLKhq9NlIuNgOg":{"text":"I am a self proclaimed picky eater and have high expectations when I dine out. This is the","useful":2,"cool":0},"NZzisK4Zx6-6pOUZmyYsyA":{"text":"Went during Sunday brunch. Slow somber bossa nova complimented the deep flavors of my gumb","useful":0,"cool":0},"WlChYGoI4JYEB03SHwwBtA":{"text":"This is my first yelp review. As a New Yorker coming to Nola for the first time, this is t","useful":0,"cool":0},"1Ug-2BelLQWBLKIlO1_SaA":{"text":"Went in because its the first restaurant we saw after leaving the french market and it was","useful":0,"cool":0},"LpJ5WA20x1vonovt2q3XZA":{"text":"Balcony, inside or out, great jazz, amazing crab cakes, veal to die for, Courtbouillon (sp","useful":0,"cool":0},"alNGWLL7Qt9VV3eNwEUyZg":{"text":"Best food on NOLA, as a spoiled Californian I finally found this place where the food is e","useful":0,"cool":0},"dqda5hfYzK9da6aHuWaWGQ":{"text":"What a classy joint! Professional service, amazing food, great music and ambiance (we were","useful":0,"cool":0},"hY0IqN3tx12VTkveaSRedw":{"text":"This gem in the \"Big Easy\" offers an amazing atmosphere and ambience including white table","useful":0,"cool":0},"ArJ-cHni-c7fOa5288YN1g":{"text":"Oh my!!!! A must for the Shias Seafood Aperitif!!!! What a way to eat fried green tomatoes","useful":0,"cool":1},"Xy-VUHuL6mac5aDe2ONLBg":{"text":"We came here for dinner during Mardi Gras weekend. The restaurant wasn't super busy but th","useful":0,"cool":0},"ReTrDSYy26cRicY-kUxeNw":{"text":"5/5 Cafe Sbisa has it all! Amazing, friendly waitstaff, tasty food, generous portions and ","useful":0,"cool":0},"W8sed9fOm9Plu3d2zGnLqw":{"text":"My wife and I got the seafood stew. Outstanding. My wife first ordered the duck, but it wa","useful":0,"cool":0},"pEkvwc86HlIoEX9qMfLQwA":{"text":"My husband and I ate there on a recommendation of our hotel concierge. We arrived at our r","useful":0,"cool":0},"ncUgCZDSkt8N9c_IkTPBXg":{"text":"Wonderful dinner tonight with coworkers!  Fried green tomato appetizer was lovely.  Also t","useful":0,"cool":0},"cSLg4Ur1EFSJ2xF97goo-A":{"text":"Came here after doing some tours around French Quarter. Was starving and this restaurant d","useful":1,"cool":0},"EYAM5BtbxlbkiVhGu09I0w":{"text":"What an awesome time at an amazing restaurant \"Cafe Sbisa\".  From arrival to departure the","useful":0,"cool":0},"J0FK7cFVDRmqiGFX1Ehk6Q":{"text":"What a JOKE.  Lame as can be.  Had reservations for Mother's Day.  They tried to sit me so","useful":1,"cool":0},"Wk03T9v4TlhtQ7E-AjWbGg":{"text":"Best lamb I had in a long time: well seasoned and succulent. I was sad when the eating exp","useful":0,"cool":0},"ZukYR1m5MSu8AtsdrA57gQ":{"text":"The bartender was amazing, the food-exceptional and the overall ambience was perfect. I wa","useful":0,"cool":1},"n7zT3pM6GSPQS6i6Ih9hpA":{"text":"I am quite surprised with the high reviews of the place given the terrible food. I sit at ","useful":2,"cool":2},"J_bUZX2sHxIh5XT__KghGA":{"text":"Wandered in tonight and received amazing service and wonderful food!  Best meal in NOLA!!","useful":0,"cool":0},"f9fkSyVG09BaFcLDr8-LgA":{"text":"This IS the BEST restaurant in the French Quarter that I've been to, and I am a huge foodi","useful":0,"cool":0},"WqJC5RMSzXbzi8bP7M0nUQ":{"text":"Came into this place as the lines at Cafe DE modnde were too long. Awesome place. Great am","useful":1,"cool":2},"23h-jaVAFcgwiiQq3gJY4A":{"text":"small and cozy, delicious food and good service. perfect for a special occasion.","useful":0,"cool":0},"pu-vYpT_237MZ2-w2qCNHg":{"text":"We ate here last night.  Party of 10.  Service and food were terrific.  Highlights were th","useful":0,"cool":0},"nLEJAVKqQUDCN14wDKjNhQ":{"text":"Foreigners looking for some good Creole food. Great success here at Cafe Sbisa! The servic","useful":0,"cool":0},"lVPYAdLn7hYoqshyVMD1VQ":{"text":"Cafe Sbisa is a must-visit during your trip to Nola.\nLocated near the French market, it is","useful":2,"cool":1},"hJW-J3qVNa7mpHBd9e_kWg":{"text":"We just celebrated a birthday dinner at Cafe Sbisa. It was WONDERFUL! My friends and I had","useful":0,"cool":0},"SxeZtDyTAVuv7Pi0f0j6Qw":{"text":"The food was delicious, and the entire experience was outstanding. The entire staff was ex","useful":0,"cool":0},"R9EIjvuHseqeNTJcku90UQ":{"text":"Ordered petit filet medium. Came out super burnt on outside. (Inside was fine.) Sent it ba","useful":3,"cool":1},"f2Un3U9R7LH14PHdnPIC2Q":{"text":"Food was great. I had been eating a lot of heavy, over cooked/fried foods during my week i","useful":0,"cool":0},"3zJ5B1cTuTsfl477oLx9BA":{"text":"I had the crab cakes and turtle soup. Wife had the oyster appetizer and chefs special gumb","useful":2,"cool":1},"kRvuAw7cZzbuiUFqvtbJ_g":{"text":"Great service and delicious meal, we also had a fabulous view from the balcony outside. I ","useful":0,"cool":0},"m2mHbo0-OoT9RXkK0gFexQ":{"text":"The most underrated restaurant in NOLA. It's upscale fresh accompanied by impeccable servi","useful":0,"cool":0},"tDHpuRQNAnp07hSe2TuXWQ":{"text":"The Absolute BEST Gumbo, OUTSTANDING Service, Ambiance with a trio playing live music, and","useful":0,"cool":0},"GsMmTuPDQ9moapI9-KXUhw":{"text":"This is by far one of the best restaurants I've ever been to,  New Orleans or the world.  ","useful":0,"cool":0},"F2r74LsRazyPF4fAYKEK8g":{"text":"One of the best meals I had in New Orleans!  A good change of pace from the usual gumbo, j","useful":1,"cool":0},"zA9v8vPYbMTa3dmeCrpdPw":{"text":"We had dinner here on a Saturday night. The atmosphere was incredible combining the histor","useful":0,"cool":0},"efSgRTDVH8whT81UWLiUuA":{"text":"Ok. Third time to Cafe Sbisa. Our waiter Thomas was fantastic. Food is soooo good here. Go","useful":0,"cool":0},"dOo3QKYYIcrVLtaitp0lnw":{"text":"Excellent food, though service was on the slower side. Hubby and I had the fried oysters, ","useful":0,"cool":0},"urkySGMPNfzb7Jgf-tpAKQ":{"text":"Went here last night for dinner. It was a nice night and we enjoyed sitting on the balcony","useful":1,"cool":0},"5b1Ch6OyU5SndJzz32J4jg":{"text":"Authentic, Family Owned and operated \nI came in late on a Friday not knowing what to expec","useful":1,"cool":0},"y3bjf5BCfI1NNZdmYJa75Q":{"text":"Only two words needed to sum this place: delicious and professional! The service was five ","useful":0,"cool":0},"9dcrbKFU_kKt-s9EmaJhhA":{"text":"Wife and I ate here on our first visit to New Orleans and the French Quarter. The food was","useful":1,"cool":0},"Pb9uxuHtbhAoOy5FVJk0Tw":{"text":"This is a fantastic spot hidden among the dive bars and souvenir shops on lower Decatur St","useful":0,"cool":0},"Qiup8rBMqOrA5Y5H_PVeGw":{"text":"I had high hopes for this restaurant with a 4.5 star rating on Yelp, but it fell short of ","useful":0,"cool":0},"7iJgCVywCwqH8cIMK0nPbw":{"text":"Delicious filet, humble environment together make a quiet and peaceful dinner in the Frenc","useful":0,"cool":0},"47itLZfYmB__2E9mEt2uAA":{"text":"Very nice restaurant in the New Orleans French Quarter...The staff is very attentive to yo","useful":0,"cool":0},"wxTV_7e7ti300dvgMPJAQA":{"text":"I can't even remember how I found this place. I was searching for a restaurant for dinner ","useful":2,"cool":1},"2WEcrqvTrUpIYA02vQvrZQ":{"text":"This is an old school example of fine service and glorious food in the heart of party fren","useful":0,"cool":0},"Ltl1gr0L2nzWGCcIMPDz_A":{"text":"I'm so happy we chose Café Sbisa to celebrate my sister's bachelorette dinner! Ambiance wa","useful":0,"cool":0},"gC3cpHU6J8xVPUk8fFuTsA":{"text":"Went here for Anniversary dinner.  Good food but compared to similar restaurants in price ","useful":0,"cool":0},"oyrhLd8IV-N4zjvnKUMbag":{"text":"My party of 5 and I arrived one hour before closing. Our waiter, Owen, was professional, f","useful":3,"cool":0},"QhJD_99ieYBCy5iWUWvp8A":{"text":"We stumbled upon this place and what an awesome experience. They really care about the qua","useful":0,"cool":0},"8hlGY4PQNacC-PXcQN9QGQ":{"text":"New owners and exquisite cuisine.  Just opened, but great service and great ambiance.  Won","useful":0,"cool":0},"sYdD4IGOqieY8Mgv8qA_4A":{"text":"Excellent food and service. My favorite dish was the country-style gumbo of the day. The s","useful":0,"cool":0},"wmlKKy3cRezyEU0gUowwYA":{"text":"Terrible service.  Rude manager.  Received our appetizer before our drinks.  Took over 20 ","useful":0,"cool":0},"YM8mN59MZEdrGWfdhvMeMA":{"text":"We came to this restaurant based on a recommendation from a local tourist center.  I had t","useful":1,"cool":0},"F5D3ugOkgiEWqE5vpFe1DA":{"text":"It is my favorite place to eat while I am in the city!! Was there sat nite after the Boo p","useful":0,"cool":0},"_Yd6Xs0n96prz62BIJ3PAA":{"text":"Update! Had my birthday dinner here on August 17th! Food is five star. Let me start with t","useful":4,"cool":3},"4gHciitLrLrAFp2lQyE8Ew":{"text":"Great time at Cafe Sbisa last night with family. We arrived before our reservation to enjo","useful":0,"cool":0},"6WT3GtAjHzqriOhreiSfWA":{"text":"This place is amazing! It's never too busy, live music, excellent service, excellent staff","useful":0,"cool":0},"qhZzjxE8KoyjyzJGqkc25w":{"text":"This place was great. We ordered wedge salads, the BBQ shrimp, Gulf Fish, and the trout, a","useful":1,"cool":0},"4_gabV8tjk37uDoNY0M9Sg":{"text":"While I haven't yet had the chance to visit Cafe Sbisa, I can speak to the wonderful, frie","useful":0,"cool":0},"sybiE2ljMhMXbAfzfSSeVA":{"text":"This place was great. We ordered the top 5 things on the menu and everything was great.\nTu","useful":1,"cool":0},"bfddbrBWZrKtjGoKB2FEQg":{"text":"Unfortunately, I feel compelled to write my first yelp review after using the site for yea","useful":2,"cool":0},"fi-S2tOVr560_iydodngKw":{"text":"We stopped by Sbisa for dessert last weekend ...  amazing service & live music !  We had b","useful":0,"cool":0},"pyyBF-4Z1fT6gqBX2RmfJQ":{"text":"Not the music I had hoped for.\n\nI asked our hotel concierge to recommend a restaurant that","useful":0,"cool":0},"uAFrvXcYacGgWidijU-qhA":{"text":"This was the best restaurant that I went to during my visit to NOLA.  The service was grea","useful":0,"cool":0},"4b6bna5VG-CLP1wFAVuTvw":{"text":"Just tried it for the first time.  Had a great court-bouillon.  Very friendly and attentiv","useful":0,"cool":0},"qhHKr-3ew0xxsCiMrWE11g":{"text":"This has been one of the better brunches I have had in NOLA.  The turtle soup rich and fla","useful":1,"cool":1},"4Rn_pe1dC_iYj36ZJ1myDg":{"text":"The food is good,  the portions are pretty large. Watch your step when here though - you'd","useful":0,"cool":0},"bnTabClxLklpYHGltjS_ug":{"text":"I really wish I could give this place more stars because I loved the live music and some o","useful":2,"cool":0},"3JKnXgPNEW1Y120LWiYwNA":{"text":"One of the biggest Yelp misses EVER.  Had extremely high hopes but Sbisa was the most disa","useful":0,"cool":0},"k89xc78JmaNLBKog4cMf6g":{"text":"This is a must try. It's is more on the intimate fancy side. Small quaint place with a lot","useful":0,"cool":0},"kpw5wuKxtnIATpZnOY0Xiw":{"text":"So so good, all of the flavors were stood out and seafood in every bit!!! Staff was great,","useful":0,"cool":0},"6WcEBSejl0KuD_UDnYHlUA":{"text":"Extremely disappointing and offensive!\nWe were the first arrivals for brunch this morning ","useful":0,"cool":0},"ZJt4rP5Klur1GJPDv6J-MA":{"text":"Hey fellow yelpers! I dined here for Valentine's day and everything was fantastic! The duc","useful":0,"cool":0},"viMdqz2yrkb3-MX55E0Z8Q":{"text":"Cafe Sbisa was a last minute decision when searching for something with a) reservations av","useful":1,"cool":1},"X1gqwZBYzupQwZR6X7vtzA":{"text":"This was a great restaurant. Ashley was our server and she did an absolutely phenomenal jo","useful":1,"cool":0},"zyQN0AtDUeguuS50rq0kHw":{"text":"I came here for a friend's birthday lunch. The place was pretty empty when we got there, w","useful":0,"cool":0},"8grf2153Sd5CQcDjNfGwfA":{"text":"Came here for the Sunday Jazz Brunch and I was not disappointed. I made reservations about","useful":2,"cool":3},"kYD2negyFlmG8PBdlZoqvQ":{"text":"I've been to New Orleans many times and have an ongoing love affair with the city. I love ","useful":2,"cool":0},"VEov5i9N7FFTSAqUxzAQKA":{"text":"Fantastic service and atmosphere! Brunch bottomless mimosas and the food were also amazing","useful":0,"cool":0},"ucZP-bd1jgGlf9pGl_l63w":{"text":"Perfect location and great food! We got there for 545 on a Friday night and were the only ","useful":1,"cool":1},"HaZgKVdpn3lZMpaXa8GPJw":{"text":"I'm trying to keep this a secret, but in my opinion as a local, possibly the best restaura","useful":1,"cool":1},"oeaVHXM4Jj_dhTp122QQ5Q":{"text":"Truly horrible service. I've dined in dozens of NOLA restaurants over the years and have n","useful":0,"cool":0},"RZR_ZEghIuW6acvJ1S1Xrw":{"text":"Excellent meals, impeccable service, superb cocktails and the perfect ambiance for dining ","useful":0,"cool":0},"l5lU9V7kweI-vK7sP56MbQ":{"text":"Great spot with nice ambiance and staff! \n\nWe really enjoyed our dinner here on Thursday e","useful":0,"cool":0},"NA2X4Oo-shE4sR1imQ9z5A":{"text":"Definitely recommend! We came for Sunday jazz brunch and loved every dish. The crab cakes ","useful":0,"cool":0},"ZBrr1W732khrddgqFk7aFA":{"text":"Horrible food, horrible service, and watered down drinks. Go somewhere else, so many bette","useful":0,"cool":0},"0mSMeCoXNODV7KT1lqA9cQ":{"text":"Went on Friday night right after arriving in NOLA. I had made a reservation two weeks ahea","useful":0,"cool":0},"UF8_Ao8xe_r3RTjGFTXjcw":{"text":"If my husband was writing this review he would give it 5 stars! He claims his seared duck ","useful":0,"cool":0},"0F9UuEkQGERPnvBhQMLxAA":{"text":"Amazing. I cannot say enough about the blueberry glazed duck. Yada yada yada. Yelp is forc","useful":0,"cool":0},"-y-SsSS6vbJB1ta_ByU6_Q":{"text":"Just ate here celebrating our 20th.  I highly recommend it!  Food was fantastic.  Staff an","useful":0,"cool":0},"NniFFDQGQQFiqss0gZk2Jg":{"text":"A wee bit obsessed with our first night in New Orleans and the first restaurant we experie","useful":2,"cool":0},"7HNQ_VB-wbZk__JKgTDQGA":{"text":"We had a luxurious dinner here accompanied by some lovely jazz by the trio at the front of","useful":0,"cool":0},"44hpKhM61DvLZmb-alg3cg":{"text":"We both knew that we wanted to avoid any lines for dinner, and we both knew that food shou","useful":27,"cool":24},"n9sFpDIhvesxWyYNihwzXw":{"text":"Sunday Jazz brunch is the thing to do!!! Big shout out to Alfred, Owen and the band for ma","useful":0,"cool":0},"YFlcsVkSWkWMJwEFZ9BzXA":{"text":"This place is amazing! The food exceeded my expectations and the ambiance is perfect for a","useful":0,"cool":0},"mdaQXqm6V-2WsfSy3akYPw":{"text":"The staff was very friendly, attentive, and even made my birthday extremely special. I cam","useful":0,"cool":0},"CEPzr-g1XAmkFm0JWYktgw":{"text":"One of the best Restaurants in the French Qtr. Every item on the menu is delicious. A must","useful":0,"cool":0},"JH7AwDQuzygl-xdL60BsCw":{"text":"Prior to my wife and I heading to New Orleans for our anniversary, I did my standard Yelp ","useful":0,"cool":0},"aq53dEEKyRThoPkFc4ip0g":{"text":"Wow, just amazing! Everything from the service to the food. I had the herb chicken with sm","useful":0,"cool":0},"211H--nX1O89EBTymiwv7g":{"text":"This was our first stop for food on our visit this week to my second favorite city in the ","useful":0,"cool":0},"WGDFUSD1ZJjPRo3MnoAJ0A":{"text":"Interesting old time feeling interior, it's small inside so everyone is visible except for","useful":0,"cool":0},"E_oU-3tu0udl8qpzsNnT3g":{"text":"Stopped in on a whim ... saw the happy hour placard out front and decided , what da heck .","useful":0,"cool":0},"Zsqc18D7JXgMN-ndNqXX1g":{"text":"This restaurant deserves more than five stars! I went there at 5:07 and decided to enjoy t","useful":0,"cool":0},"G6Wy9Q5GpyJ96miPWyBRlA":{"text":"Super cute restaurant with a good brunch. They are very liberal with the endless mimosas. ","useful":0,"cool":0},"hlNyPuLlHMhyJrwK92r1FQ":{"text":"I cannot say enough about this amazing restaurant. The staff, the ambiance, and the food w","useful":0,"cool":0},"KimW32WkjgrOD8WsjieAjg":{"text":"Great service .. and amazing food! We brought my mom here for here birthday and I'm happy ","useful":0,"cool":0},"KEPx1iBQDlus2NkgIwhhvQ":{"text":"This place is great if you want a relaxed old school NO vibe with great service and amazin","useful":0,"cool":0},"jLyu7DdsI8UT2k_iq-6HYA":{"text":"Cafe Sbisa treated us right for our rehearsal dinner! This place feels old-school and clas","useful":1,"cool":0},"9TkPED2v4mSvZ9BygIZjvg":{"text":"Out of towners here. Happened upon this fine place on a busy Friday night. They happily ac","useful":0,"cool":0},"ieifxOpfAXeQ_5g7VrIqkg":{"text":"Amazing. Literally everything's amazing. Don't overdo it and miss out on dessert though. I","useful":0,"cool":0},"vDAJ-3iu8HCjEOV47mlaKA":{"text":"Took my wife here for our anniversary and everything was perfect. The staff was super nice","useful":0,"cool":0},"hEBHAA8LPBW9Hs7h4B29-g":{"text":"Great night out. We loved the quality of the meal and the portions were beyond generous. J","useful":0,"cool":0},"R3w5pwHlAGjmJS7Sx2MeRA":{"text":"This place is terrible. Decoration is very old and our utensil are dirty and disgusting. A","useful":0,"cool":0},"bSf-nnaFv1APM6RApo_msA":{"text":"We were really impressed by our experience here for Sunday jazz brunch. We had a reservati","useful":2,"cool":0},"NItfvaFcj30n6VLVLxmbOg":{"text":"As we walked into Cafe Sbisa we were greeted with a warm and friendly smile, and seated pr","useful":0,"cool":0},"BOm3hJKJyxOEC6kWzQdCVA":{"text":"The food was pretty good, but the service was excellent and definitely made this a five-st","useful":0,"cool":0},"ZslAiZJwLPJOoUHVMU-rzw":{"text":"Amazing dinner. Everything we tried had the table raving for more. Love it and can't wait ","useful":0,"cool":0},"uYfymY9YxbksCMzO4ZNV-A":{"text":"The plates that were licked clean: chicken breast, bbq shrimp, steak filet, trout Eugene, ","useful":1,"cool":2},"QDnlvhKE8sLoC5_12s3RSQ":{"text":"We love this place. Old line elegance and service and up to date delicious food. Wine list","useful":0,"cool":0},"OaOc6KVtIHML-znNzKpqOg":{"text":"Good Food In The Historic French  Quarter\n\nMy son-in-law and daughter invited me to eat he","useful":2,"cool":1},"He7ETQIAQRhR4ycbr3QBjA":{"text":"I don't think I would have found this place on my own just walking around given its locati","useful":0,"cool":0},"0l0rzGOVR_6WshJDOPpOVg":{"text":"The service and ambiance of Cafe Sbisa was unmatched. It is located right outside of the F","useful":1,"cool":0},"ViVD6-0FxDEuevUIub9cCw":{"text":"We loved Café Sbisa! \nIf you can try to get a veranda seat; it overlooks the street, and i","useful":2,"cool":1},"pgLVgDxUGMZDYeCTYCgWFA":{"text":"All I have to say is WOW are we impressed!! The seafood gumbo was *heavy* on the seafood, ","useful":0,"cool":1},"ZlV3sMX7A3cxn5HM_95sfQ":{"text":"This is an absolutely astounding restaurant that makes my taste buds dance. Just beautiful","useful":0,"cool":0},"4NPBZMoeQZxmOPeZsCAjRQ":{"text":"Just a very rude manager.  We were on the patio, and were the first people to arrive but w","useful":0,"cool":0},"oHrG0zaaSY4yFGo8lcuiaw":{"text":"I've been to New Orleans dozens of times and never even noticed Sbisa; it's easy to miss. ","useful":0,"cool":0},"9isUA6fQ1mhclbs-I4RD3Q":{"text":"I love dining in New Orleans, such a great great food city! Had the best meal ever at Cafe","useful":0,"cool":0},"3fM8Kj5xVHjd0bEH5CQPJw":{"text":"The mood is awesome, the staff is super professional,  and the food is delicious. Elegant ","useful":0,"cool":0},"LkD2ljn9tu5TPzTzYuDhDg":{"text":"My wife and I loved our experience at Cafe Sbisa. Definitely a classy, fine place to enjoy","useful":9,"cool":9},"8n0Aym1QmATJP7j_rukTHw":{"text":"We can't say enough about how great this place is. The Gumbo was amazing...loaded with cra","useful":0,"cool":0},"TovG_8pcn9Y19YixbOZw-w":{"text":"My boyfriend picked this place out for our anniversary dinner and I was thoroughly impress","useful":2,"cool":3},"kAcbhc3MNAHiP5xOBKl8aA":{"text":"As a Native New Orleanian, I have passed this restaurant a thousand times. On a whim we de","useful":0,"cool":0},"Q33an4l4bsIoFl1H_n6NIw":{"text":"When a rat runs a few feet from your table across the floor, I'd say there is a problem. I","useful":0,"cool":0},"427fmtrwNKlS8PwDFHTwpg":{"text":"Very nice place, little pricy but good quality food.\n\nI had a perfect Wedge Salad. For my ","useful":0,"cool":0},"HEirhzKrX-Fs8qz41lahlg":{"text":"This place is the BEST place in NOLA!  The staff is super friendly and the drink list is e","useful":0,"cool":0},"RJcB6TJwRE-i9aduUg3H7w":{"text":"This place was fabulous!  I would highly recommend this for great gumbo, crab cakes, and a","useful":0,"cool":0},"fvovaauz6VyI8Z57XZJHyA":{"text":"I was craving crab au gratin as my first food in New Orleans. I found this place on yelp w","useful":1,"cool":0},"5v9MdbhwkFXSvbnIfI1Ppw":{"text":"My 4 sisters and I went to Cafe Sbisa to celebrate my 50th birthday.  I have nothing but g","useful":0,"cool":0},"QWc8iAAjB4H7cBQpQHRMXw":{"text":"Excellent food, great atmosphere, great service and a wonderful experience!  I would recom","useful":0,"cool":0},"Izw-y1voNu25XkDWq3cAdA":{"text":"This place has so much potential to be great. It saddens me because I had such high expect","useful":1,"cool":0},"zmYwqX_4tstGDxL68Xqd7w":{"text":"We visited for Sunday brunch. Oh my goodness!  It was absolutely delicious!  I had the Egg","useful":0,"cool":0},"DSkvenLZ78vcRkEze1giKw":{"text":"Friday night and not a full house would question me on how great this restaurant really is","useful":2,"cool":3},"Q4H5qvjvNotoYJg_iswcYg":{"text":"Absolutely loved loved this place! The staff was so kind and even let us in after they loc","useful":1,"cool":1},"Y-_NUHVl2h0Klu2yNcxcrA":{"text":"I made a reservation for two a week in advance and I had a hassle-free experience on March","useful":0,"cool":0},"4PcvKH83MGvQ6TEYVqQ_VQ":{"text":"Fantastic food, but what really made it was Thomas, our waiter. He went above and beyond b","useful":0,"cool":0},"W8Hg7Z5V25YAEL9N_IMz-w":{"text":"It was a great place for dinner, quiet and wonderfully decorated. Staff greated us friendl","useful":0,"cool":0},"4RNisazAPhoYK0uzNbC2Lg":{"text":"My wife and I came to New Orleans for a visit and heard about this place for many resource","useful":0,"cool":0},"6lkJfEzXS7OlVkkZVZz7iQ":{"text":"I had this place book marked from our trip last year, unfortunately we didn't make it that","useful":5,"cool":2},"NxkjG9wTZq_BCNZgvL7P0g":{"text":"The service is impeccable. The food and the ambiance pairs well with the service. I humbly","useful":0,"cool":0},"3wj4KgbQdes2ErsF6Bibhw":{"text":"I loved the service, the friendly staff and food. Great quality overall. The music, wine, ","useful":0,"cool":0},"6GZmpnakBMSvPIPBWxwVFA":{"text":"Very impressed! Nice menu, excellent wait staff, well done cocktails, all around great spo","useful":1,"cool":0},"IljKne72v5vuY-F8A4GrZw":{"text":"Damn!   What a meal!   Great service.  \n\nWe both had traditional New Orleans style seafood","useful":0,"cool":0},"Zyjz7swMbWvVaSu_3CKqZg":{"text":"Restaurants were originally created to make the common man feel like a king.  Overtime, ma","useful":0,"cool":0},"-O3kQsf49P8cZLLTQAJdsA":{"text":"I came to Cafe Sbisa with a group of 8 smack dab in the middle of Mardi Gras. They seated ","useful":1,"cool":1},"6vw39bg0C344VcbfQnHKGA":{"text":"God damn.  Honestly I didn't plan to come here.  I was heading to the other breakfast spot","useful":0,"cool":0},"fv7fr7-C40d_GwnedifMAg":{"text":"My sister and I ventured to this restaurant for dinner and when we walked in, we were prom","useful":1,"cool":1},"g3yl1kJV4ny-xtLl8Qy_Jw":{"text":"Had reservations and walked near the river and Cafe Dumond. Restaurant is a very old resta","useful":0,"cool":0},"0Vod_IlAro4Z2pwkylb6ZQ":{"text":"I love this restaurant!!  The food is off the chain!!  Brunch is always a great  time!! Gr","useful":0,"cool":1},"ySYevTccOPDKxmeZnrvMOA":{"text":"Great service, amazing ambiance and spectacular food!  Highly recommend.  Nice place for a","useful":0,"cool":0},"3A9dTMQD4_fEnKpQYDH58Q":{"text":"Very poor service and over priced dishes. Made my drink completely wrong and still wanted ","useful":0,"cool":0},"qJwcVEV_3yEXFZGoQq7cBQ":{"text":"We had reservations here for dinner to celebrate our friend's bachelorette weekend. Everyt","useful":0,"cool":0},"WxIAYi83b4EH2whQPEsR0w":{"text":"Super tasty food! Filet mignon was perfect, red fish special was awesome, and the bread pu","useful":0,"cool":0},"cBv2nnnSkv38xiU7apSOAQ":{"text":"We went here while we were in New Orleans in February for my friend's birthday. This was o","useful":2,"cool":0},"DYevFOYrimzr__eSfSyRfw":{"text":"Amazing dining experience! The food was delicious. Seasoned and cooked to perfection. If y","useful":0,"cool":0},"yWaN9AvkB7uhGCxWImmrpg":{"text":"Really great place for a quiet(ish) dinner in the French Quarter. I recommend sitting on t","useful":2,"cool":0},"HL3Rnrvgin7NsDsqyeFX_g":{"text":"In looking for a jazz brunch we happened upon Cafe Sbisa via the Yelp app. They are locate","useful":4,"cool":2},"VqFc1CD-E4awNydewC6Abg":{"text":"We went here for dinner on a Saturday night. They are pretty busy on the weekends and so w","useful":0,"cool":0},"bsvnc8naMc-ZovSKnSopmQ":{"text":"Omg This restaurant couldn't have been more perfect! My husband and I ate here for my birt","useful":0,"cool":0},"pyK02V3itA4W1zJ4uAdcrQ":{"text":"Very very good!!! The filet with asparagus and mashed potatoes is DELICIOUS!  I had the fi","useful":0,"cool":0},"LcSxrJinORjtCtZbeTKIPg":{"text":"Ok no joke this place is amazing! Great ambiance with live jazz music, great service (Ashl","useful":1,"cool":2},"AEYf3rOlG70CEI32lim48g":{"text":"GET THE COURTBOUILLON!\n\nabsolutely delicious with tons of flavor, would definitely come ba","useful":6,"cool":6},"3JowRVdhHZJcAeVaM-rjbQ":{"text":"This place was simply amazing. We went for New Years Eve dinner and couldn't have been mor","useful":0,"cool":0},"1UFxShvt9k9SEJLQJj9Hnw":{"text":"My boyfriend and I stopped at this BEAUTIFUL place tonight before our anniversary dinner a","useful":1,"cool":1},"_WfEaYAQsaxEsk4gjZZf5A":{"text":"Outstanding! We showed up 15 minutes before opening time on a Wednesday and were welcomed ","useful":0,"cool":0},"SxahGzWNaGm_6NGXa0oy0g":{"text":"Soft jazz and a smooth martini. That's how I started out my dinner at Cafe Sbisa. Arrived ","useful":1,"cool":0},"6fMjCByCkPLZxFkeELQhLg":{"text":"This place was perfect for a birthday dinner for visitors! It was just the right amount of","useful":4,"cool":4},"TneiVkY_1i9QLegyNKAFBg":{"text":"Loved the food, loved the atmosphere. Great servers, overall was one of our best food expe","useful":1,"cool":0},"MLxBhKKLnaUmNGqvMKivAw":{"text":"We stopped in here just walking by in New Year's Day because the music sounded great. Ther","useful":2,"cool":2},"6IXrvM6M83DbZcfYjJWZHA":{"text":"Fortunately we were able to be seated without a reservation and were amazed at the service","useful":1,"cool":1},"NaQkHUOwIYEcWbXr2UUgWA":{"text":"The food was disappointing. Service and cleanliness need lots and lots of work. There are ","useful":0,"cool":0},"aHsdR-XuoKp2O7ejwGdnyw":{"text":"Phenomenal trout Eugene, Ralf of lamb, and bread pudding. Order nothing but those things!!","useful":0,"cool":0},"x9Muza6P9ZjHIryglHwcNQ":{"text":"This was my favorite restaurant in NOLA before Katrina forced it to close. It reopened thr","useful":0,"cool":0},"DhL78drTsGULu543ARpBmg":{"text":"Had the pleasure of celebrating my husband's 30th bday here! Great service, great atmosphe","useful":0,"cool":0},"82JG0-u6cGr1eO4WCgLusw":{"text":"My first time at this restaurant and it was perfect. The ambiance was perfect. The staff w","useful":0,"cool":1},"4ndyyLdWLsSzvklWXbZXOA":{"text":"Great service and food in a very historic building (established 1899!).  It delivers on th","useful":0,"cool":0},"FrLcZJFpgmiiBKJsqSoszQ":{"text":"Great dinner last night with my wife.\nLocal caught fresh fish blackened. Hers just grilled","useful":0,"cool":1},"66f-HykzGX3rwveFs-04hw":{"text":"I am writing this review as I still sit at the table. This place is AMAZING. Service, food","useful":0,"cool":0},"mxDHxYUahU03WtWPcPgITw":{"text":"Wonderful food, great atmosphere.\nWill be back. Share the desert; you'll know what I mean.","useful":0,"cool":0},"vlnAIKLsC9Z2rOYT8WQxSA":{"text":"Every thing about this place is excellent! The wait staff is very professional and easy go","useful":0,"cool":0},"GiSEYeYfVPWD21uwhnUGlQ":{"text":"I got the grillades and grits (amazing although not the best presentation).  My friend got","useful":0,"cool":0},"VVyVfyMzhU6tQrYlLSIp9Q":{"text":"Just got back from having dinner at this restaurant. \nMy husband and I were seated at a lo","useful":0,"cool":1},"Zyqfz1-LY7CQEFJGkK8QfA":{"text":"Cold soup\nBad service \nNo bread even though I asked for it twice \nThe crab cakes were dece","useful":0,"cool":0},"AvUvLBXRE-Fu39RSiiyfng":{"text":"Great ambiance great servers and hostess as well as great food. I enjoyed my night with a ","useful":0,"cool":0},"NeIrQ8oTgeEXbkSpmCucjg":{"text":"We came with a party of 10 to jazz brunch. They have exceptional service! Most of us order","useful":0,"cool":0},"zi3qmHZrFqEfoPx_PrhIJA":{"text":"Excellent food, excellent service, and reasonable prices for the quarter. Had the trout Eu","useful":1,"cool":0},"zERyG7f8AB6t4McGhseyZA":{"text":"Located in the French Quarter, I came here for my birthday dinner on a Saturday night with","useful":0,"cool":0},"Fhx57L-b0fYtFaleDy49Pg":{"text":"Just off of the hustle and bustle of Jackson Square sits Cafe Sbisa. Established in 1899, ","useful":5,"cool":1},"aYq1fH5WtLZL3S4gZ6VMJA":{"text":"Brunch at Cafe Sbisa in the French Charters was the perfect end to my trip to New Orleans.","useful":2,"cool":2},"h4QBl6puVDwgob-Y92dLcw":{"text":"A beautiful taste of New Orleans. The gumbo was a meal unto itself, so much so that my wif","useful":0,"cool":0},"YMo2krjxVghMuKccSM5evQ":{"text":"Great cocktails, delicious food, beautiful ambiance, and above and beyond excellent hospit","useful":1,"cool":0},"MRBci2Fna68xaN6gB2zsVQ":{"text":"Absolutely fantastic restaurant right in the French Quarter. They have a great wine list, ","useful":0,"cool":0},"0kUGo11vEPJNFit6UwaPGA":{"text":"Live smooth jazz (at least during Sunday brunch) compliments the atmosphere of this very o","useful":0,"cool":0},"sy7jC9s6aN32t_XUty66rg":{"text":"The food looks great on the menu. Luckily I called to check on there hours.  They closed a","useful":0,"cool":0},"xpshpKPcYh6sgTjHkGbmUQ":{"text":"In the past I have been duped by highly rated restaurants on Yelp......particularly in tou","useful":3,"cool":0},"PnDEsVsZUScLiLMrI8IESg":{"text":"Stunningly beautiful mural done by a celebrated local artist George Dureau above the bar o","useful":1,"cool":2},"4alRT50xSQ0In-bZWCu3jQ":{"text":"Café Sbisa is a must go to on all traveling sites for New Orleans because it is located in","useful":4,"cool":3},"TE_wFeVAxWAQWiT2Bv-QJw":{"text":"I've been dying to try Cafe Sbisa and the perfect opportunity presented recently. Reservat","useful":1,"cool":1},"wVfbL6Nda6V5LxdRLEPXhA":{"text":"Old world atmosphere with excellent food. We had a large group that was handled well by th","useful":0,"cool":0},"r_5HthghYNOX_adGebdD8Q":{"text":"The crab cake here is delicious but the time for waiting the entree is tooooo long. I orde","useful":0,"cool":0},"5h5xGdRNeUkpXGnHhv3Cqw":{"text":"Turtle soup is a 5, everything else I tasted in our party of six deserves a solid 3. Flavo","useful":0,"cool":0},"Ryv0S7MhSSBl5qqnyFFrXA":{"text":"My husband and I took a group of friends here, we had a reservation more then 2 weeks out ","useful":1,"cool":0},"nw4cD5FsdSJP1GAgxhMPcg":{"text":"My wife and I had brunch at Cafe Sbisa while on a long weekend vacation to New Orleans.  O","useful":2,"cool":0},"AxJaj89gj9V8jtWLaNaBwg":{"text":"Incredible food and ambiance. The service was amazing. Friendly and attentive staff. Seaml","useful":0,"cool":0},"HsTPJWbxyJMG1UPtgWMi-Q":{"text":"Amazing dining experience! The food was delicious. Seasoned and cooked to perfection. If y","useful":0,"cool":0},"mTqkspxzeN5o-dzZ1ejj8A":{"text":"So I came here for my boyfriend's birthday based on some recommendations from friends. I m","useful":6,"cool":1},"tQdXvJmDDUzE4FQeHTSZHQ":{"text":"Last minute we were able to make a reservation.  The hostess was lovely and the waiter Owe","useful":0,"cool":0},"NqrSfLrd_bW8KwpTlXvS_w":{"text":"I celebrated my birthday here in November. We were seated on the second floor right next t","useful":1,"cool":0},"QIW53hxFfQBnRiUYnXpuSA":{"text":"FReally just one word amazing. Food was amazing service was amazing and Cocktails were ama","useful":0,"cool":0},"d1U8l3N-x3tx_c3ZFtVQNw":{"text":"Although the food was Amazing we won't be back. We've reserved a table here for the last t","useful":0,"cool":0},"RUK980A9ra3ofC7oJ5ru-g":{"text":"What a good time. Thank you so much to Cafe Sbisa for allowing me and my family to have di","useful":0,"cool":0},"sWW-Q8Mb5SUtk3djm_1p4A":{"text":"Food and service were fantastic. We came on a Friday night at 6 and they were easily able ","useful":0,"cool":0},"CjjRmT7d3NkNFN4SsgKxHA":{"text":"We went here on a Saturday night, and it was completely empty so I expected the food and t","useful":0,"cool":0},"kdH-2QBso3IUnVrF2boXig":{"text":"The veal & crab dish was the best thing I ate in NOLA over the 3 days I was there. Truly. ","useful":2,"cool":2},"BJUOJxRUTDTThD1LbGU2ig":{"text":"So amazing! Definitely will be coming back. We had the redfish and the trout and couldn't ","useful":0,"cool":0},"43bzQk4DoNF5f4ghQXuizw":{"text":"This is hands down my favorite restaurant in the French quarter--there's no comparison. \n\n","useful":2,"cool":2},"l-zHTs5yN9tPiXdn0h_jOQ":{"text":"When I tell you that I had the BEST birthday dinner at this amazing restaurant, PLEASE BEL","useful":1,"cool":0},"N0eVdTryhbPcWGa5Srzs3g":{"text":"The food was AWESOME! Oyster appetizer, Filet and Pork-chop! Pork Chop  was the best, melt","useful":0,"cool":0},"PCpu_OCYXexSItfmvlNqMQ":{"text":"I love that  I was served the absinthe champagne drink and it was suggested to me: \"good l","useful":0,"cool":0},"PGcMxFktu1HH8kt6UZ1RKw":{"text":"When you're in New Orleans it's easy to find food and music in one place.   But it's hard ","useful":0,"cool":0},"cK-iAfe1QDSrGzQfjFjo2A":{"text":"I made a reservation two weeks ago for our brunch group for brunch on today, June 24th. Th","useful":0,"cool":0},"bjcfa4p2VSJIshvCz4dk_Q":{"text":"My surprise birthday dinner was FANTASTIC!\nI love EVERYTHING about this place!!! The ambia","useful":2,"cool":0},"0E5QUybemF0v8p1RaG0JlA":{"text":"Great place, great services. Food was prefect. I recommend this place to anyone look for g","useful":0,"cool":0},"QW_Z0NipToeCX0VTvGAQIA":{"text":"The bartender Jamie made me a perfect martini, however, the crab cakes substituted salt fo","useful":0,"cool":0},"W98sdxbThABAYWOXptlZzQ":{"text":"Came here Sunday evening with a group at the end of a business weekend trip. I read about ","useful":1,"cool":1},"WWveZB_CMjh81CMZHNbXGQ":{"text":"Wow! What an experience! Great food, service and vibe. We were celebrating an anniversary ","useful":1,"cool":1},"4OKv1jeexERKAlcOpnkH3Q":{"text":"I loved everything about this place. The food and service were top notch. I'd recommend th","useful":0,"cool":0},"12yPWxwC-9opiiJiQh6TIg":{"text":"10/10 recommend!! This place is outstanding! Let's start with the food, we ordered the ste","useful":1,"cool":1},"9yM9_krxkRE66D04oWyJoQ":{"text":"The food and service were phenomenal. I went with a party of 9 and every single plate orde","useful":0,"cool":0},"EOoyFqBAvuaRB9JslNZBSw":{"text":"Best restaurant in New Orleans.  Just got back from New Orleans and this has been the best","useful":0,"cool":0},"1XMnVxQsXEhO0HTd43eeDg":{"text":"Café Sbisa was one of the best meals we had in the NOLA.  It was established in 1899, and ","useful":8,"cool":9},"dFOPCrINX0AV8O_CLOetmg":{"text":"Had just a fantastic meal last night! The restaurant was that just right combination of ol","useful":1,"cool":0},"qh2QYV9s7QPgjuI_sTu1LA":{"text":"Cafe Sbisa -1011 Decatur St., N.O. LA - French Quarter\n\nQ-tips say: Outstanding food/drink","useful":0,"cool":0},"mHFq8mqgn__4DiaPxO5L_g":{"text":"This place far exceeded what we expected! It was amazing food, and the staff was just grea","useful":1,"cool":1},"yIFwM6SczhX3_OrE_Mb9Sg":{"text":"I was in town a couple of weeks ago and was pleasantly surprised that this place had reope","useful":1,"cool":1},"8v25UmQQtceXDSb6y64cKg":{"text":"The food and drink were amazing! Our waiter was Thomas and he was superb! Great classy amb","useful":0,"cool":0},"1qBcFbAE_A6M7ot-HgxdTQ":{"text":"Stepped up creole food. My wife and I were wary about eating all of the traditional fried ","useful":0,"cool":0},"LVvFL6JreCiStA8R9c1qPw":{"text":"A surprisingly fancy restaurant! My friend and I were cruising the streets trying to find ","useful":2,"cool":0},"FM9eNyhG_QBAOoAxnVYx8g":{"text":"Edited to add that this was for a party of 20 on a Saturday night.  Hoping to return the n","useful":0,"cool":0},"3QJHsOowxwRboEYDgFj_Vw":{"text":"Our waiter Gregory was a dick, was super slow service, and to top it off I I had to kill a","useful":0,"cool":0},"yerf71yt4m9us644kXZk3g":{"text":"Wow! Spicy. Quite a shock for all of us.  Did not take away from the fabulous meal but all","useful":0,"cool":0},"Ew1zWSTTUJ-OVJwfwaJ6Nw":{"text":"Wow! My prime rib was delicious. I was so pleased. Perfect romantic date night. Jazz music","useful":0,"cool":1},"0Jwu5fMl-dzrrmTT-jXuww":{"text":"I had an amazing 30th Birthday dinner with my family here. We had a group of 9 and sat ups","useful":0,"cool":0},"QzL5s9qfEFedSQJKaRHsHw":{"text":"We had such a terrific dinner here last night! I had the blackened redfish served with a s","useful":1,"cool":0},"k_QGxMJJVi01ID3MMpty-A":{"text":"What an amazing, unassuming little gem. You may be initially hesitant when you see some of","useful":0,"cool":1},"jbp02KH_ttK0lSU4ZcgwzA":{"text":"This place is fantastic in every way. Reservations are easy to make (I suggest you make a ","useful":3,"cool":1},"uJq3nKB6xJHX4aPlls3X0Q":{"text":"For starters, my friend and I visited on Cafe Sbisa's first day back open (March 26, 2021)","useful":2,"cool":0},"419YeQJxJjf-M-pEiTz09w":{"text":"Soooo delicious. We came here for brunch on a Sunday. They had live music and absolutely e","useful":1,"cool":0},"U3HIKnWYM9gf0gjR_v8zMQ":{"text":"I am giving this spot a perfect score! From the entry of the building to being offered ass","useful":7,"cool":8},"30Li0d5gu_cvZ4LbqPLZBw":{"text":"My first visit was one year ago, and I declared it was the best meal of my life. Tonight I","useful":2,"cool":0},"ZteRXySrQhSLix23YNW34w":{"text":"Amazing food. Amazing service. Right in the heart of a tourist area, so you wouldn't expec","useful":0,"cool":0},"Vx9w-DjwcpRxYTnJAEZkwg":{"text":"Amazing. Wonderful. Beautiful. Staff is A+. Everything on and off the menu will blow you a","useful":0,"cool":0},"tvXboXbRWYlTqaaDVLn3Tw":{"text":"My father in law made reservations for 8pm at this restaurant, however we ended up having ","useful":0,"cool":0},"nwaOV2dDHVuwPkEiYo1gig":{"text":"Every plate at my table of four was a happy plate!!\n\nI started with the Caesar salad which","useful":4,"cool":0},"94rtSKkk0KKnz7x_XNR7uw":{"text":"Cafe Sbisa is my all-time favourite restaurant in New Orleans.  I never order chicken at r","useful":1,"cool":0},"44ybEtutu6fg9Clwf0QdPw":{"text":"Woow loove this place annd black owned and black chef that's a plus for me. Mia at the bar","useful":0,"cool":0},"zXR0XDPmVMJUFHe2YpQXHA":{"text":"One word: Deliciousness\n\nLet's start with the ambience of this restaurant, impeccable! The","useful":0,"cool":1},"51FwlNWi2skiEwVVEjCRgQ":{"text":"Well... if you are looking for a meal that will make you blush... my eyes rolled 3 times d","useful":4,"cool":2},"_dk3902O3eJOrPMA45Uq1A":{"text":"Food was so good. Our waiter was Thomas. He was very pleasant and helpful to our group. I ","useful":0,"cool":0},"1Yy9H4olMnL4FS4QiBW7Ug":{"text":"Dinner was delicious, Thomas didn't disappoint with fantastic suggestions. We enjoyed the ","useful":0,"cool":0},"hgkV6gyXlT9pAJWCBLfXQw":{"text":"We were there Sunday for the Jazz brunch for our daughter's birthday. Every aspect of it w","useful":0,"cool":0},"4IfbV3s4gEBett21Z9Iguw":{"text":"Outstanding!!  Just outstanding. Amazing service. Jazz was great. Had brunch just after Ne","useful":0,"cool":0},"rCHYaOwEWiqrBFQvSCh3KQ":{"text":"Reserved on Open Table for recent visit to NOLA, and amazed by the food quality and servic","useful":1,"cool":0},"19lfErymb0bK-vFMRRQ44Q":{"text":"Omg this is one of the most delicious brunches I've had in a decade!!!!!!! Alfred Singleto","useful":1,"cool":2},"w1zuVrjSioPoTl-ZDx1Pyw":{"text":"First of all, 10 STARS honey!\n\nThomas did the damn thang! When I tell you this man was on ","useful":0,"cool":0},"FNS2oTun0Gw23wVVYPhVwQ":{"text":"Five star dining experience. The ambiance. The staff. The food. Stellar. The only thing to","useful":2,"cool":1},"FDVYm2FFzjzHsAbwvYVpAQ":{"text":"Cafe Sbisa is on Decatur Street at the corner of St. Phillip Street, a little past Jackson","useful":3,"cool":1},"LyST5JWwHpblhKGIMIudOQ":{"text":"My husband and I along with some friends settled for a Sunday brunch. We ordered the Bayou","useful":0,"cool":1},"Q1CTlvL7JQs0Zmo6tCURyQ":{"text":"Beautiful atmosphere on the balcony at sunset. Our servers were attentive, interactive and","useful":2,"cool":2},"WJHDJR_ygNerhsuTu3lpAg":{"text":"I will definitely be back! Service was great! Our hostess made sure to check on us several","useful":0,"cool":0},"IHc4HzPiRO27I6nPEGkl7A":{"text":"A group of us had a reservation here weeks in advance. When we went for brunch on a Sunday","useful":0,"cool":0},"cdGidoV-g3Yqof4WeIhbKg":{"text":"Sunday the 23rd we were a party of four\nFor dinner. Called for reservations and were sat i","useful":0,"cool":0},"3oVMZN5sKNLd7_Rb06I98A":{"text":"Café Sbisa was an incredible experience from Cocktails, to Apps, salads, entrees, ambiance","useful":0,"cool":0},"CXTD55_I923akKnJxDBAVw":{"text":"Truly a hidden gem! As locals, we try to avoid the French quarter at all costs just due to","useful":3,"cool":0},"lNQ_kCXd-5IhuvbRi5WcgQ":{"text":"He best bread pudding , makes the palate happy. We didn't have room after the dull meal, b","useful":0,"cool":0},"AZPEz-YrtvNImOJrRGSXCw":{"text":"Gosh..what a charming restaurant with lots of character. We made a reservation the day bef","useful":0,"cool":0},"N1iaq_CZlED7j-XHOwGJOg":{"text":"Visited during my first trip to NOLA & it didn't disappoint. Called a week prior to set a ","useful":2,"cool":3},"5S6azdiWgyooo2G6EJaUJA":{"text":"We stumbled onto this place with no reservations and it is a true gem!! Sunday brunch with","useful":0,"cool":0},"vRU5fnq1slYG4oONrAWKxQ":{"text":"Very disappointed. I only had time for so many meals in NOLA and was annoyed I wasted one ","useful":0,"cool":0},"SztgI4AKlGKYsqqrfQco4A":{"text":"What a hidden gem! Here for Sunday brunch.Service is great and the jazz band is wonderful!","useful":0,"cool":0},"a4NPBH8zD3gaJoZY4UgEJw":{"text":"Excellent food and service! The attention to detail is appreciated. There is a live jazz t","useful":0,"cool":0},"wUMa5lplHtlxErco-00dag":{"text":"My family and I ate at Sbisa on Jan 6th, 2022.  Dining room was busy, charming and very we","useful":0,"cool":0},"6RHojGcLPdcWdzMsdNHiqA":{"text":"This place was amazing! The food was great, but honestly the staff and atmosphere really m","useful":1,"cool":1},"C3kRJ6oONenw-nWtJF4BwA":{"text":"Cafe Sbisa is all around 5 stars.  We arrived almost an hour before our reservation and we","useful":0,"cool":0},"lcYvuILvT8LWWUT4LHg8uQ":{"text":"This is a oldie but a goodie. A very beautiful historic restaurant right across from Cafe ","useful":14,"cool":11},"myhRzuGowtyX7TxALBMV6Q":{"text":"Amazing like always!! I've only been there twice and have never been disappointed! We love","useful":0,"cool":0},"6eSaL0t4Jy3_ExIS4MjmhQ":{"text":"I took my boyfriend here to celebrate his 25th birthday, and I got major brownie points fo","useful":3,"cool":2},"ZNlPB0iKxsdIN3fmeithrw":{"text":"This meal was fantastic. Actually my favorite meal for the time I was in New Orleans (Fren","useful":0,"cool":0},"_lL52RtjSvhc62HJT0iupA":{"text":"I made reservations here after seeing a Youtube review of the restaurant from The Black Fo","useful":0,"cool":0},"98aJlisjrbidx1fe3fl4gg":{"text":"Local here.  Went there for brunch and it was FANTASTIC!  Great food, live music, and staf","useful":0,"cool":0},"LTTVkSQZ5vJRXyHfKkoXqw":{"text":"I ate so well at this place! I met up with my girlfriends here for #BlackWomenBrunch and w","useful":2,"cool":2},"K2ROmp8-v2iSKdINKg8baA":{"text":"Ate here today brunch and it was great! Nice smooth Jazz music that was soothing and soulf","useful":1,"cool":1},"ReMvfGgp3sytZmU04yQj4A":{"text":"I'm not going to curse, but this place is SO ******* GOOD! I've complimented my girlfriend","useful":5,"cool":1},"r5hkv5_LR7I_BNZWhbS_pg":{"text":"I was not expecting the fine dining experience. It was a refreshing surprise! Everyone was","useful":3,"cool":1},"R7IRjUA8LY9zab9uVFwsBA":{"text":"Amazing amazing amazing! The food here was super authentic and just beyond great! The wait","useful":0,"cool":0},"_aSlxitcIIzk_dviRamcDw":{"text":"Came for my birthday. I'm literally sitting here as I type and I have nothing bad to say. ","useful":0,"cool":0},"zTdB20D_hXNILUvy05vueQ":{"text":"Cafe Sbisa is a historically black-owned fine dining restaurant that for sure lives up to ","useful":3,"cool":2},"jdOlz_ZAWpqEZA9i7nF0Nw":{"text":"My second trip to NOLA this year, this time with a group of 6 with 3 of us celebrating bir","useful":16,"cool":15},"I9VrTTqn9G1LmQAJnhlp-g":{"text":"If a boozy brunch is what you seek then step your way right on through because bottomless ","useful":0,"cool":0},"Ae8Clw1dzMB7azKF5N9jUw":{"text":"I was in New Orleans for a business trip and decided to stop by here on my last night and ","useful":1,"cool":0},"sLBfRdpfYCzzg8lE4JHukA":{"text":"We came here for dinner with a few local friends. I ordered the pork chop and it was the e","useful":2,"cool":1},"rr6g5hh0Fsq6QMHUo0tZzw":{"text":"Cafe Sbisa is a pleasant surprise tucked into the Quarter near the French Market.\n\nWe chos","useful":1,"cool":0},"PUBPQsmpkbjcZtt_xNdGaw":{"text":"Beverages: the mimosas were extraordinarily cheap tasting. The glasses they serve fountain","useful":2,"cool":0},"VkKONoHE1oyCPXBZMOsXTw":{"text":"My husband and I had a small destination wedding in New Orleans.  We chose Cafe Sbisa for ","useful":0,"cool":0},"0BBsC36hGrti0lj7xvyVDA":{"text":"If you are Asian traveller, I highly recommend this place! This is the best meal my bf and","useful":3,"cool":1},"eP9cYpKGBc2mlExV2LpyaA":{"text":"Wow. I loved this place. The third oldest fine dining establishment in the city did not di","useful":1,"cool":1},"R9VBLK0fdUr2cE-X4ga4Gw":{"text":"I really enjoyed the atmosphere at this place, there is  a wonderful painting above the ba","useful":1,"cool":1},"aRLp4bmV_MjlMJ2GLzLXUA":{"text":"My husband and I finally made it to Cafe Sbisa for date night last night, and they did not","useful":0,"cool":1},"t4cLK35e-0VvbZNXrtRJSQ":{"text":"We booked a reservation for the Jazz Brunch and immediately were greeted by the beautifull","useful":0,"cool":0},"5LG9bHyfz6kW3ohc5Um6Gg":{"text":"Definitely a must if you're going to New Orleans. Food was fantastic we ordered steak it w","useful":0,"cool":0},"IaWwiYRLCSP8gbGsO7N58A":{"text":"We were a party of four, Friday date night.. we made reservations, as soon as we arrived w","useful":0,"cool":0},"O5st2ycakV3FY0xWcpinnA":{"text":"Thomas was amazing, very kind and down to earth. \nMy husband and I enjoyed every piece of ","useful":0,"cool":0},"g4F8QJmasxw3S_Amw7q8GA":{"text":"First time back in several years and this place is for real.  Sat upstairs, ordered gumbo ","useful":0,"cool":0},"027cbzwRneIppcujHM31sQ":{"text":"Absolutely exceptional. It all started with our excellent waiter Kevin! He was attentive a","useful":0,"cool":0},"auu3Ga-jSRKnzwvmAEN6FA":{"text":"Fantastic underrated restaurant in a city full of fine restaurants. Beautiful setting with","useful":0,"cool":0},"LUEsTQr7CF6hqMA5u8684A":{"text":"I don't remember our servers names but they were very nice. Had some drinks and the shrimp","useful":0,"cool":0},"cFlIJQtxK6leGbPTCrmQpQ":{"text":"I ate there on Oct 23rd.\nThe service was great. The front of the house accommodated a rese","useful":0,"cool":0},"h_CSR8GEcS5We4ijhwyN0w":{"text":"This place was quaint and beautiful. I went from brunch and it was great, definitely going","useful":0,"cool":0},"Kco50V5NuLn4UWpr5MsEmw":{"text":"This place did not disappoint. The bread you get while you wait (momentarily) for you food","useful":0,"cool":0},"jTRaCsOWW4uLvcIOHeg09A":{"text":"Best experience I've had in a long time! \n\nLet's start with the energy of this restaurant,","useful":0,"cool":0},"EUFfKjEQNTaadFaoOTroTw":{"text":"One of the best Restaurants in Nawlings!!!!\nFood was Phenomenal...\nService was Excellent. ","useful":0,"cool":0},"0X_MUjeCP_3x2r8bkqIfwQ":{"text":"Did not know what to expect when I first walked in this past weekend. Drinks were great an","useful":0,"cool":0},"sCD-NOcQKNnX3C8BfH2O-w":{"text":"This review is my encounter with Cafe Sbisa on 8/20. We made reservations for a party of 4","useful":1,"cool":0},"NFVMo62tqj-ZhMbQqigoSQ":{"text":"We read the great reviews so we decided to try for brunch.   It had a nice local vibe with","useful":0,"cool":0},"b_DVwWiTOHtwnY36dW50Jg":{"text":"Absolutely amazing experience. They truly gave us excellent service. \nThe ambience was a e","useful":22,"cool":20},"b_yv787NFpVf0g8CzF7MFw":{"text":"I can't say enough about how much I enjoyed Cafe Sbisa from the customer service and ambie","useful":1,"cool":1},"mH7un2KebxxtDLw393EGiw":{"text":"Great place to eat! The service was phenomenal and the food was delicious! Highly recommen","useful":0,"cool":0},"6y2Pq1XZZlgz7N6X_lNuEA":{"text":"Wonderful gem in the heart of this touristy area of NOLA. We had some of the best food her","useful":0,"cool":0},"rWHPd59XjD-IBP5e9xUzMw":{"text":"Food was excellent! Had Courtbouillon it was a healthy serving of deliciousness. Fried oys","useful":0,"cool":0},"3ys6-EwWMBKQ_rz4qaQ5Pw":{"text":"Recommended by the hotel as a memorable dining experience, they did not exaggerate. Had a ","useful":2,"cool":1},"H4nqASKl3fmrY76ga22aCQ":{"text":"This restaurant might be between two t-shirt shops, but it's anything but gimmicky. The fo","useful":1,"cool":1},"Pjbj1CCK-YNbGlpTPgzvKA":{"text":"Food was fantastic!  We started off with cocktails of mint julep and a hurricane, and appe","useful":0,"cool":0},"58Ca7_sLMhkI4BCANmURLg":{"text":"Amazing brunch spot in the quarters.  From the live jazz to the bottomless mimosas, the se","useful":0,"cool":0},"DPIPuPWsVadlLYkmCqlZ5g":{"text":"One of the best restaurants in the quarter. \nThe service was excellent.\nWe can recommend t","useful":0,"cool":0},"00SQqlkywo1QQ_MMkb6Mcw":{"text":"This is classic New Orleans dining at its best.  We ate here for Thanksgiving.  After a go","useful":1,"cool":1},"6fNDhTZ6GfTGNbmchp11LQ":{"text":"As soon as you walk in, you can feel the New Orleans vibe. This restaurant is very lovely ","useful":1,"cool":1},"j2Ktoz2DnPQYSg3CkF9zUw":{"text":"The only reason for the 1 star is the wonderful wait staff - they were fantastic. We drove","useful":1,"cool":0},"8I6qCNMvy5SUiesC0vOY5A":{"text":"We spent our first dinner in New Orleans at Cafe Sbisa and it did not disappoint! Definite","useful":1,"cool":0}}