{"VNR8ElbRovajMnulDkq2bw":{"text":"They opened during Mardi Gras - yep, crazy - but are a great new addition to the neighorho","useful":6,"cool":4},"x-VcnWqVkJfifagkIxkZAw":{"text":"The food is amazing!! And the 3 men that worked there are great. I recommend everybody to ","useful":0,"cool":0},"QaoZFPJ3cue4HxGPhenprA":{"text":"Chicago Style Meat Lovers: best pizza I've ever had in my life, hands down....and I've had","useful":0,"cool":0},"AGuY8qnFdMm_fx2N-BtJKg":{"text":"I've eaten this pizza several times, and I don't think I will again. \n\nMost recently, I or","useful":0,"cool":0},"-o4Mgi5ZCdzBN3kV7cjNzQ":{"text":"Really really solid Chicago style pizza. Best Chicago style pizza outside of Chicago. Real","useful":2,"cool":0},"v_qgBfBcNqhoJMC8w7-FCg":{"text":"Best pizza I have had since the last pizza I had in Chicago. Go there; you will not regret","useful":0,"cool":0},"8OrcAZnhmtKLzcACWgaesQ":{"text":"We were looking for a nice break from Cajun food and we found it. Wonderful food and frien","useful":0,"cool":0},"uipr__p-0NHOvF35CL5_vw":{"text":"Delicious food, terrible service. Order to go and save yourself a tip. Thanks to the terri","useful":1,"cool":0},"hmMPVW61ruGKMM3v-noh2Q":{"text":"The pizza was delicious and those cheese raviolis are a \"popular item\" for a reason.  They","useful":0,"cool":0},"XV97A8cQbLM16IxCaZCXIQ":{"text":"If you are looking for good pizza (shall I say real pizza?), look no further! As someone w","useful":1,"cool":0},"BKp-nAMM1sXVIWqiOIg_kA":{"text":"The Chicago Pizza is the real deal and is the best on town. The wood fire pizza is unique ","useful":0,"cool":0},"4Fi1DLRkk5FKUsETuUhroA":{"text":"I love pizza and when I saw that this place had Chicago deep dish, I was in. I had never h","useful":10,"cool":10},"17i4IFPta1ruuqLfSOV5rA":{"text":"Nothing like Yelp being wrong on their hours of operation. Ubered from hotel just to find ","useful":0,"cool":0},"OUBqf7DibyHhyc0LUOW4bA":{"text":"Excellent customer service and the closest I can grt my hands on Chicago style pizza witho","useful":0,"cool":0},"s0ZwHm9Enf6zL0eDTZfmhw":{"text":"I'm from Chicago and this pizza was very good. If they want to claim it's real Chicago the","useful":0,"cool":0},"WyO45-WGvEsKKUVs79o-Zw":{"text":"I'm glad a new location of this Italian joint has opened near my house.  I have eaten at t","useful":8,"cool":7},"rFiOdPDCa_OFHbc3H67H4g":{"text":"Terrific service, great atmosphere, and THE BEST Chicago style pizza in New Orleans! I'm a","useful":1,"cool":0},"ToI6cyp_dJU0YJNew8D1EA":{"text":"So we came from Slidell to the St. Charles location to try our first Chicago Style pizza. ","useful":0,"cool":0},"7HbtDNdPlGHB3-GsXlCFIA":{"text":"Great food. Great service. The menu was full of yummy selections. We got the cheese raviol","useful":0,"cool":0},"H8icKBtcOR3G7UQgFn_Gdg":{"text":"I just had a really satisfying family lunch at That's Amore. \n\nI read lots of reviews befo","useful":3,"cool":2},"yfoSWMzcWyg5yVkvLSOoHg":{"text":"Dayum Good Pizza Spot! First time having Chicago\nDeep Dish Pizza but I'll be back! Didn't ","useful":1,"cool":0},"3T8LSMaKHAjSeV3MCoT3wg":{"text":"Excellent all day bloody Mary's, super friendly staff, and gat damn that marinara sauce!!","useful":0,"cool":0},"_pSeICrhgw7gtcWjtAdhwQ":{"text":"I love this place.  It's casual and the pizzas are consistently great.  Their happy hour i","useful":0,"cool":0},"h-6OuaZ4gytnEpqEc1zPyQ":{"text":"Loved it!!! Authentic and the best red gravy I've had in years!! I'll go back anytime!","useful":0,"cool":0},"lWIm2i-9FqeCKuw9QYMbqw":{"text":"i dunno. my husband says it's the best deep dish pizza that he has ever had. i didn't like","useful":0,"cool":0},"9oaR9Jf76pF8PPKNEBkdrQ":{"text":"Please visit this place before they close. It has great pizza that tastes like Chicago piz","useful":4,"cool":2},"tvtgJxL0wPlN-2Wd3lSb8w":{"text":"Visiting from Fl! The best pizza and wings! Worth the 45 min wait for deep dish pizza. The","useful":0,"cool":0},"1lMl8W558i5DBYiHPRsu-A":{"text":"I was craving Chicago style pizza today and horribly disappointed after ordering from here","useful":0,"cool":0},"JnnOuYgL4H-sAc-acl5V5w":{"text":"My boyfriend is from Chicago and was excited to take me to get deep dish. To start the fri","useful":0,"cool":0},"ErqDsL__wMH1PSO60dS9Xg":{"text":"First impressions were a sticky table and cold silent and empty restaurant.  Some music wo","useful":3,"cool":2},"7ntSjOWkIw2SDshwpuABXQ":{"text":"Wish I could rate less than one star!! So disappointing-- don't know how this place has a ","useful":0,"cool":0},"sIIOBUsWC2asbgl4DYqEIg":{"text":"I had high hopes of enjoying a delicious Chicago deep dish pizza and this is one of the on","useful":0,"cool":0},"jN9pPbf8qqhdvNtU1hFCZQ":{"text":"Wonderful authentic Chicago Style pizza!  I recommend the meat lovers!  The sauce is absol","useful":0,"cool":0},"oOYS9vl-93lVNrmcy8Y1mA":{"text":"Avoid!! Not authentic at all. The oven wasn't fired up after they were open over an hour. ","useful":0,"cool":0},"dHxmRRHbg1CnXtCg0eVtuw":{"text":"I had a Groupon for here so ordered a deep dish pizza for the kids at the hotel.\nIt was gr","useful":0,"cool":0},"yk_M3KmqXoz5DGMWZLVPsQ":{"text":"Great deep dish pizza highly recommend for dinner \nService was excellent if looking for pi","useful":1,"cool":0},"DucGnoJBp9T7ycAGL_2eZQ":{"text":"Love this place, quick and always exactly as expected. Shout out to Sid and the guys in th","useful":0,"cool":0},"vngDR5ibzzv_4R4OA1pf1Q":{"text":"Superb deep dish pizza ! This establishment has become one of my favorite pizza joints in ","useful":0,"cool":0},"zWeFjIbWHxvIyuyNHNKc2g":{"text":"Eh.  They had great Chicago style deep dish, like real deep dish, and it was amazing, but ","useful":0,"cool":0},"px4XYepqh88d8XkvLR8N8Q":{"text":"Awesome Chicago style Deep Dish pizza. I'm from Illinois, and I love Giordano's, so my sta","useful":1,"cool":0},"WQ2lBDCuVFwwToVENTw0mg":{"text":"I'm from about 2 hours East of Chicago and frequented there often, so I'm very familiar wi","useful":0,"cool":0},"Lkd2eHVxewgT0a5lJ1pZtw":{"text":"Normal pizza place aesthetic. Good service and their pizza is good but I'm going to be bol","useful":0,"cool":0},"5WQvo58XMJu65275iTGa_A":{"text":"Great happy hour specials on drinks, and half off apps. I got a wood fired pizza and it wa","useful":0,"cool":0},"A_i4516tKL-B3UfZKmTHbw":{"text":"Easily located a few blocks beyond Lee Circle on St. Charles Avenue is That's Amore. Being","useful":0,"cool":0},"Jhlv4GFxaYNlO-a9RNG0Pw":{"text":"Had good reviews so I bookmarked it some time ago. Then on the way there I start reading r","useful":0,"cool":0},"hci-Q-LGWMc5LTmx08lS6Q":{"text":"This location has been sold and is no longer an original \"That's Amore\". Came to eat on 9/","useful":2,"cool":0},"zSyeHhFL2JbdqwJBsJiD4A":{"text":"Absolutely wonderful pizza and great service with friendly faces to assist us.  Ceaser dre","useful":0,"cool":0},"7pnEwy36a_g6uPTrI_Aj_g":{"text":"So it was our first time visiting Amore since the change in ownership.  We were very happy","useful":1,"cool":0},"wfhHcrDaZO4JZ9GBYlxHgg":{"text":"You can tell they use fresh ingredients. The food was incredible. I highly recommend the c","useful":0,"cool":0},"GSB_VXSwsbvBTjnT65n_Sg":{"text":"A solid choice for fantastic deep dish Chicago Pizza! Service is phenomenal  and staff is ","useful":0,"cool":0},"Al68F-cyY2kQ5M3KNl-l2w":{"text":"We had a great time eating Happy Hour priced appetizers and beer and wine, while our deep ","useful":0,"cool":0},"SFRxHYi4EyPFv4cAgANv-w":{"text":"We ordered take out and it was just right.  Easy to order, super nice service, and DELICIO","useful":0,"cool":0},"qdUGvtEMsD39wUqfgOWt0A":{"text":"Heck, hate to pile on with bad reviews, but must advise folks to ignore this place.  They ","useful":0,"cool":0},"23bV-6Sq7GUUwOdWyg4VvQ":{"text":"Great food and even better service. Everything is homemade from the marinara to the raviol","useful":0,"cool":0},"W4kXFhYNIQzL-o_5vAsEJg":{"text":"So we arrived at 820.. was told to seat ourselves. We had to wait 13mins for the waiter. W","useful":0,"cool":0},"1KbdYBMlZRIJcVu-DGAi_w":{"text":"First time trying deep dish pizza and this place did not disappoint. Amazing flavor, and s","useful":1,"cool":0},"1bEkE4bDnpVodHVTOsKFDA":{"text":"I like This place  haven't been in a while but with so many pizza places in Nola I have ma","useful":0,"cool":0},"-U70MwsQVE43szGKfTObBw":{"text":"The pizza was great! Large foldable slices. There could've been more toppings, so next tim","useful":0,"cool":0},"gkyiUtLAm7W9kd8iHtdStw":{"text":"Went out of our way to eat here! On a pizza kick and have never tried Chicago pizza. I dar","useful":0,"cool":0},"MrBmQOvePAbJ82xPOZktQA":{"text":"I had heard of the Metairie location several years ago, when co-workers who knew I am a Ch","useful":0,"cool":0},"1WQslpr4FFmvJfcKysR9Ng":{"text":"I feel weird writing this review before I try a bigger pie, so hear me out. (Read me out? ","useful":3,"cool":2},"kNvu5VmVhrjW5qc_nDQUXw":{"text":"So disappointing.  We ordered a meat lover's pizza, which was supposed to have pepperoni, ","useful":2,"cool":0},"7fvBcaAdD-qijt1QwjQm2A":{"text":"Not quite Chicago worthy pie. We went for an early dinner and were the only diners when we","useful":1,"cool":0},"1xN264E3MagDWGqONDJQig":{"text":"We visited this place when we were in New Orleans and it was awesome. They tell you when y","useful":1,"cool":0}}