{"-fhD1USgMA5HK7YFVzJyQQ":{"text":"They have a lot to learn about service. The male bartender was super apathetic and seeming","useful":11,"cool":1},"49NT-eFyv3V9G4o0xUotzQ":{"text":"I hate to do this. But the experience was terrible from start to finish and I'll have to p","useful":11,"cool":0},"G-9HEqjSyEr98dETTEF6Ig":{"text":"The waitstaff were attentive and very nice! That is the only positive comment that I have ","useful":1,"cool":0},"SLwB7M_WSjD6yTLwqAmnCA":{"text":"Although the food is great, this place gets 1 star because of the incredibly long wait and","useful":1,"cool":0},"MG9TgiNjHMMTbmUmuPlGWg":{"text":"Food was good.  Appetizer (gumbo) was served quickly, but entree took a little while to co","useful":0,"cool":0},"RmKxQ1hZkrMTQWGoPq8aYw":{"text":"I expected more. I'm writing this review after multiple visits. The most amazing thing I h","useful":0,"cool":0},"KZlYuaWinzxsg8FvsBfDEQ":{"text":"We loved our first visit to Morrow's which is new addition to the culinary offerings in ou","useful":0,"cool":0},"I06CL-hhQ61DCy3J_gDaMg":{"text":"Morrow's was recommended by an Uber driver as a great local spot, and LAWD was He ever rig","useful":2,"cool":0},"Nzjd4HiUOSgu-vdYuqz7yg":{"text":"Came for brunch on a Sunday. Good food, good music, great service. Away from the hustle an","useful":0,"cool":0},"5vAjILoGoAmqVDKrWTxACA":{"text":"This establishment came highly recommended from a local. We decided to visit our last nigh","useful":0,"cool":0},"Pb0z_948kNMChF_8o9bQ3w":{"text":"If you're in NOLA and want great food outside of the French Quarter, stop by Morrow's. I h","useful":0,"cool":0},"S7Tory38hlu_662l-hMjow":{"text":"Horrible customer service!!! Came down for essence fest called several times showed the ho","useful":2,"cool":1},"zt5YjpwQVnwAxpM_tS1ZGQ":{"text":"Ok, let me start by saying I not only visited on a Saturday but it was an essence weekend ","useful":0,"cool":0},"8vv9B5u9THR9hJlNpnNWCw":{"text":"We had the chance to visit this restaurant after hearing so much about it. We received a s","useful":0,"cool":0},"9SDyb0rOcIZnlcQY7YSlFA":{"text":"Lovellyyyy place 100% on the food , my fave is the crawfish pasta with catfish & crabmeat ","useful":1,"cool":0},"HqmbylBX3oRTYOh-VhBWXg":{"text":"I never write reviews, but I felt compelled to do so today. I was here for Essence Fest an","useful":4,"cool":0},"9sFwaRKykIIsmk0g1E6jkQ":{"text":"I liked the fact that I was greeted while I entered the establishment. I was really glad t","useful":2,"cool":0},"A4soW3NhQQJaB5yrkKb88A":{"text":"First time in the NOLA and this spot was a must on our list! Our wait wasn't long and the ","useful":0,"cool":0},"Oe_vuop4mjusSngNBJmYUg":{"text":"Everything we ordered was so good and fulfilling! I came from Baton Rouge just for Morrows","useful":0,"cool":0},"4Qt9R63Uwl354v1E-acm-w":{"text":"Not happy with service or meal. I ordered Bayou Red fish with Crawfish etouffe topping. Th","useful":0,"cool":0},"AlkME9jeSuyjmdvajo3wgQ":{"text":"This spot right here is AWESOME! The atmosphere, service and food are excellent! My compli","useful":0,"cool":0},"LIvE0HL8QVki8tQWbz0jXg":{"text":"Let me start by saying despite the reviews my friends and I decided to try this place beca","useful":2,"cool":0},"VllkKK0M39Nin4BdzUtKtw":{"text":"Amazing Food.. whoever is in the kitchen defiantly knows what they are doing!!!! Not to me","useful":0,"cool":0},"nIvb1QsZ3yqkdt-uTUlg2g":{"text":"My coworkers and I decided to try this new restaurant for lunch. First off we placed an or","useful":6,"cool":0},"2Km5t5Gt7PyHQXGthoQHfg":{"text":"Had a great time here the other evening. Corey and I believe Derrick were our bartenders a","useful":0,"cool":0},"SdnWvSPnQ1BZCvSNDnJrEg":{"text":"This food was bomb!!!!! I got the charbroiled oysters and the BBQ shrimp. My friends got f","useful":1,"cool":1},"OhaDzDukevzoQMv7-HkF0w":{"text":"Fire! Man this food was so good! I had the Cajun crawfish pasta with baked Mac and garlic ","useful":0,"cool":0},"yVIEQfRF2tK8cdi7gev0PA":{"text":"Stan and eggs was good. Seasoned very well. I wanted the sweet potato pancakes but if you ","useful":0,"cool":0},"X5qXcfcdNAMMZjTz7mPunQ":{"text":"I tried to eat here on my last day in NOLA after Essence Fest was over but there was a lon","useful":2,"cool":0},"ohrBlw5WuyZONgLMDLNZYQ":{"text":"Yes, it's definitely worth the wait time 1hr 1/2.  The vibe is very nice mostly tourist be","useful":0,"cool":0},"V0xYDpJHu4J_3akmc495Jg":{"text":"3 star that has 5 star potential. \n\nThe Wait: Im from CA where plenty of new/high end rest","useful":9,"cool":0},"Bhle-y-Jdu6I08kVIc3pJg":{"text":"This review is way overdue. I came out to New Orleans from Los Angeles last month. I staye","useful":0,"cool":0},"Cqnx1tjBOvOHL3TUwPzcyQ":{"text":"Absolutely amazing eating experience! They took fantastic care of us. Drinks were good and","useful":0,"cool":0},"3P6oKZMYh_SHtmi7Mq_q9g":{"text":"Really nice ambiance. Nice for family or date night. The bartenders model true epitome of ","useful":0,"cool":0},"_uM7BkIzrzd_6OWcoD5fLQ":{"text":"The food was amazing. I came to New Orleans on a spur of the moment trip. I decided to eat","useful":0,"cool":0},"IUFkaCYY-pYfZQKgW4UHLg":{"text":"They really need to step up their game if they want to stay in business in such a competit","useful":6,"cool":0},"VO1FTxTT1ymcA35mL8m1Xg":{"text":"A few of my friends and I came to New Orleans from New York for Essence festival. I heard ","useful":0,"cool":0},"YDzeTVmwgDycM_pz9MRKxg":{"text":"This was my 2nd time at Morrows, totally amazing experiences each time. I had a taste of e","useful":2,"cool":0},"_3CP2Lpc1hvX24CPBhroYA":{"text":"Great place for causal chill. This is my second time eating here and this spot is always o","useful":2,"cool":0},"D2SG_07wUJRWsZ3r3QB54w":{"text":"Love the food here and awesome staff. The wait was pretty long but definitely worth the wa","useful":0,"cool":0},"5q_fiEfiylD3IYnFzGvHZg":{"text":"Had the chicken and waffles with unlimited mimosas and it was a perfect Sunday brunch! Wil","useful":0,"cool":0},"QrDrTUG7X7dkVEVSJPVSDw":{"text":"Very upset and disappointed after hearing such a great review from a  friend to be turned ","useful":1,"cool":0},"uXRlN6hfo6wTbZiCOsldsA":{"text":"I really believe sometimes family and friends post these good reviews! With that being sai","useful":0,"cool":0},"ziMfCpw_newzfzz2FTvn1g":{"text":"Everything I ordered was really really good! My best friend and I enjoyed everything from ","useful":0,"cool":0},"SO8fg66fpubTD-miHNBljQ":{"text":"If you want seasoned food and great drinks, this is the place. Very reasonably priced for ","useful":0,"cool":0},"U9vjv1mugjOscw_I1Uo1Bw":{"text":"2 hour wait still waiting to be seated as I type this and others coming in after us are be","useful":0,"cool":0},"uXYrPzPFVvQTdEBPyqHu_A":{"text":"When we called we were told we'd be waiting about two hours before being sat. We got here ","useful":0,"cool":0},"0ZaaKDnkckS2TFvljZhCFw":{"text":"Before coming to New Orleans I looked up this place and it seemed very popular. The cockta","useful":1,"cool":1},"9xzxr3pbBYjmEc4sPs9-dA":{"text":"Great food nice place good entertainment . A little small inside but the food is great","useful":0,"cool":0},"nONqCXk7NwZRC9jFJrZqgw":{"text":"Horrible Horrible wait time..... The Owners sisters' attitude was not professional to be i","useful":14,"cool":0},"P7yrDh2Yx6PqiYzywzVsPg":{"text":"I just want to say that I love eating at black owned restaurants and Morrow's did not disa","useful":1,"cool":0},"RTOTDxAAP7XEz1ErG8wJsA":{"text":"All I can say is I wasn't impressed we called prior to driving to the restaurant to see ho","useful":5,"cool":0},"91uWwVd0TWdqhOSNsglVJw":{"text":"Restaurant - very nice. Adult Beverages - nice. Food - I had Spinach Salad with Shrimp (ou","useful":0,"cool":0},"qXISj8ZHzsMOeinzmCfLOw":{"text":"My wife and I were looking for a nice place to eat dinner while visiting and stumbled upon","useful":0,"cool":0},"hx6O247TvDVgWvfYsnVEhg":{"text":"One of those secret gems you find all over New Orleans! Shared Redfish topped with crab me","useful":0,"cool":0},"0zLvLjyuQ300JaTgUrdSrw":{"text":"EXCELLENT FOOD AND CUSTOMER SERVICE! I will def be back really soon, probably tomorrow! Ca","useful":0,"cool":0},"kdS4VCJ2oVm_IZLCJp4pJw":{"text":"I've been following Morrow's Restaurant on Instagram and my visit was nothing short of spe","useful":0,"cool":1},"RfpUuyoWNPWsfX7u_wIWaA":{"text":"Similar to the Half Shell on the Bayou this is another  black owned restaurant in New Orle","useful":2,"cool":0},"4UJIbSZorAWPD38iK6i8fw":{"text":"My Mom, brother, and I visited for dinner and came away smitten with Morrows.    We live i","useful":0,"cool":0},"4jzTMTJrtYg3sBLCfSZRJQ":{"text":"Upon entering the restaurant a very nice young lady gave us the wait time which was about ","useful":0,"cool":0},"5MbZchgqJ7k9dqLYxbINhA":{"text":"Food was great very tasty!! Must try! Prices are very reasonable! Service was great! Try t","useful":0,"cool":0},"sf-9D62o_6VzEWIwBDMjxA":{"text":"The food and wait service at Sunday brunch was quite good. There were 4 of us and we had 4","useful":6,"cool":0},"7w2Isrns76ZAJJUbaHpRDA":{"text":"Food off the chain! Atmosphere and vibe real chill! Service is great! That's all you need ","useful":0,"cool":0},"NV_4hH9MSa32f4W21EPkdA":{"text":"Great food and great service! The drinks were good and fairly strong. I would recommend ab","useful":0,"cool":0},"YYZyPRCeQ6NRAgNNJRO_qg":{"text":"Nice, new spot to eat. I like the ambience and the location but Parking is on the street s","useful":1,"cool":1},"dtjDoweF8o3l6JQjIWOX5Q":{"text":"Went to celebrate a birthday and was there in line prior to the doors opened for brunch.  ","useful":0,"cool":0},"lPhqNImJ5W3HjiZGCL5lug":{"text":"It's okay...I really don't understand what all the fuss is about. Yes, I'd eat there again","useful":2,"cool":1},"J39xGFr7V8HZsEely7LULg":{"text":"How disappointing.  My Hunnie, always the planner, called the establishment on Wednesday t","useful":1,"cool":0},"2Gk01h2Hlnrx3R_ZAYgAvw":{"text":"So my friends are a married couple. She is leaving tonight to go to Cannes for the film fe","useful":23,"cool":0},"YpMCpWWMFJqnCP6s4TUiBA":{"text":"Foods was excellent! Was disappointed that there was ONLY the brunch menu on Sunday's, but","useful":1,"cool":0},"12jd3mU-nGcNL9xLFUwiBg":{"text":"My first time and like many new restaurants the hype is just what it is \"hype\".  The servi","useful":0,"cool":0},"Djkx_LRfR8IRDLwPRZ7__A":{"text":"Since I've known Morrow's has been open I've been multiple times, trying a different dish ","useful":1,"cool":0},"D-b69CcQ7vK2AUgjZeHxnw":{"text":"Baby when I tell you this was one of my favorite places I went to while in New Orleans. Th","useful":0,"cool":0},"j1Sm47yw7H9OtH9fXAJkPw":{"text":"It's our new favorite restaurant in NOLA.  We experienced the best charred oysters ever an","useful":0,"cool":0},"Y6mfKbz-WavEUPQQHzqZoA":{"text":"A delicious food journey worth trying again and again.  The restaurant is a bit small so m","useful":0,"cool":0},"kE9hftxnWV4YNhm0iZuQQQ":{"text":"Best red beans and rice I've ever had. I've had so many different plates/bowls of red bean","useful":0,"cool":0},"xPM_iw4_R6Y0k0JQ5Wguog":{"text":"Had gumbo which was good but too much sausage and not enough seafood. The fried chicken wa","useful":0,"cool":0},"t0hUezNmedTfRML3S58QEA":{"text":"We waited an hour and a half to get into Morrow's on a Friday night about 7pm.  Once seate","useful":1,"cool":0},"muvUi-1OHHlvlGuQn1SW9w":{"text":"This was the worst dining experience I have ever encountered. I actually shouldn't even ca","useful":2,"cool":0},"PBtqaMtSC7kd8TiwfaZNHQ":{"text":"Visited on a Saturday around 4:00pm. Limited street parking available but I ended up findi","useful":0,"cool":0},"vZRZdLHWAQUlAIQKZp7IKA":{"text":"So today i tried calling to order take out and the lady apparently put me on hold then hun","useful":0,"cool":0},"untHh_jIDHMvNu5aIItG7w":{"text":"This place is amazing! We had 10 people in the party and everyone enjoyed their food. The ","useful":0,"cool":0},"SCOEwbVwKoVMYPahgKrEwA":{"text":"Went last night and had a good experience with the food and customer service. I ordered th","useful":1,"cool":1},"upXjlwhocyJuuosQtj092g":{"text":"MORROWS was great! The bar tender Jimi I believe was his name is little slow...i won't hol","useful":0,"cool":0},"b-V5MptxerPgghJwatzsqw":{"text":"Been here twice and I must say both times I had pretty good customer service and the food ","useful":0,"cool":0},"uZnP43r-McqW3cw46quOkA":{"text":"The service was amazing and the food was even better! Such a cute place with a great atmos","useful":0,"cool":0},"-NerkYBVtdH7jqG5wiLhdQ":{"text":"Really wasn't expecting it to be as good as it was. But it lives up to the hype. I ordered","useful":0,"cool":0},"jOpahcb4UhcWKc7Rttfsww":{"text":"Underwhelming in terms of flavor for some items. Some items are ok. Overwhelming in terms ","useful":0,"cool":0},"u-kxEEJMBn77QBj2v7RwGQ":{"text":"This is one of my favorite restaurants in NOLA. Good energy, great vibes, and even better ","useful":0,"cool":0},"mzcWZOa6pmGJYrYSZM-w2Q":{"text":"The food and service from the bar staff were incredible! The bartenders made us feel at ho","useful":0,"cool":0},"AnWQ_YFDgq8_DJbD1DLTAA":{"text":"Amazing. Best soul food thus far in Nola. Great atmosphere, fantastic food, and service wi","useful":0,"cool":0},"xw7ye6GUnWGGlSyD4_hzGg":{"text":"You have to come here! Food was outstanding. We had the BBQ shrimp, Sesame Ginger wings, a","useful":0,"cool":0},"WVybdoQjCakVZ20X0noyyQ":{"text":"First, I'd like to say that I love to take any opportunity to support black owned business","useful":5,"cool":0},"3eNP5cy6cEkP40cFgF-8kw":{"text":"We were really looking forward to this place. However, Morrow's ultimately was a miss for ","useful":0,"cool":0},"G9XIZgOF-9dQU6d5zUNn2A":{"text":"Anytime I'm in this city, I'll be at this place! Atmosphere is amazing, decor is dope, and","useful":0,"cool":0},"Pqf6CSaXYO88mhwQfgBHoQ":{"text":"Food is excellent. Great presentation and portions are perfect for filling but not over st","useful":3,"cool":1},"SJtfC-h2alJYmU44hdPNqw":{"text":"Found a hair in my food the other day. I was nice and told the waitress. She removed my pl","useful":2,"cool":0},"B9oO0YhRkwa617SqAXH8Aw":{"text":"My sister had received recommendations for Morrows from a good friend and was sold on us v","useful":3,"cool":0},"89g4qBZSpAL_fRhWlYFbtQ":{"text":"Morrow's is the new hot minority owned restaurant in the city. Its menu is similar to but ","useful":5,"cool":1},"6ikMmdgnHOPGP3MkOvYduw":{"text":"We had a 1 hour wait. However , the Host Taylor was very kind . She was very polite to my ","useful":0,"cool":0},"UFlSsm282vMKTgZCkjjpUA":{"text":"This place is amazing. Everything in the menu is delicious. If you get the barbecue shrimp","useful":0,"cool":0},"BtsThIInGcQCjXZE6WFBkA":{"text":"Food was excellent, hands down. You can't go wrong with anything on the menu. I got the oc","useful":0,"cool":0},"hAfsHqQpf_-NIWu-75Cppw":{"text":"We popped in from our nearby AirBnB during what I think was their opening weekend.  Lots o","useful":1,"cool":0},"UQPNXdF1V7adg34A-bcSqA":{"text":"Morrow's is a neighborhood spot with a ton of class, ambience, and great food. The staff i","useful":0,"cool":0},"CdVmaRDKrWGUnoQkjGU8Ig":{"text":"Wasn't really hungry so I grabbed the Asian wings and a small bowl of rice and beans. Ever","useful":0,"cool":0},"l_pseK9vKMXXY9sive6oeQ":{"text":"Sooooo glad I FINALLY got to try this place. I didn't get a chance to with my last visit t","useful":0,"cool":0},"8_uCUi8-rYOMXxdsQl2M4A":{"text":"First and last time here. It started off really good! The waiter was friendly and the drin","useful":2,"cool":0},"vyTPYvendLOjqVIwOSQJgg":{"text":"We stopped in for dinner yesterday evening about 5ish ...gor starters the door handle was ","useful":1,"cool":0},"5I_KKREPvSccwooY26HO1Q":{"text":"The food today was awesome. Kassi was a great hostess. The place was loud, but that's ok w","useful":0,"cool":0},"q6A4qRZ02YeftwJgt-TWIA":{"text":"I would give this place zero if I could. My party of 12 came in and we were told that that","useful":0,"cool":0},"vunkxd5v49-C50D7wsb1jQ":{"text":"Came here for a friends birthday dinner. The food was amazing! And the staff was super fri","useful":0,"cool":0},"u2FaQ-bwRyNA_GK8vy4rtw":{"text":"Visited Morrows today and the food was pretty good. I got the charbroiled oysters which we","useful":0,"cool":0},"MpJtbD78mW9Uf_Y4S2jzJA":{"text":"Great to see new life come to the old neighborhood. Love the location and the food at Morr","useful":0,"cool":0},"Ly0_vkZGW-iaWn2MSrgj1Q":{"text":"I give this place 3 stars because while most of the food we tried was delicious, the 2 tim","useful":3,"cool":0},"GdqeOSjXGpPzMhalr7N2Vw":{"text":"Everything about Morrow's is good. The food is delicious. Staff are friendly and accurate.","useful":0,"cool":0},"f3Wux790qWLsLtJaPIbwYw":{"text":"OMG!!! Is all I can say about this place! All I can say is kudos EVERYTHING was awesome ab","useful":0,"cool":0},"90HWns7b_RDGldswW6JQIg":{"text":"Had lunch here for the first time and left full and very happy. The pasta with the crawfis","useful":0,"cool":0},"ufysO1bEXs2FmZoAuNhfqg":{"text":"Went to Morrow's with a group of friends to celebrate my birthday. I had high hopes and wa","useful":1,"cool":0},"G4zlA_uwYplxVyFmHsOzFA":{"text":"I went with boyfriend for a tome out to relax. Our waitress was very nice a sweet and our ","useful":1,"cool":0},"pwCC8NZF2S_d9lFd_MnDdw":{"text":"Ambiance is awesome.  Food is good. Drinks are good.  Always a good play list and nice vib","useful":0,"cool":0},"R9O7uEcUgJHOBPFQcJCcmQ":{"text":"I was pleasantly surprised. Didn't know what to expect as there was so much hype behind th","useful":0,"cool":0},"58HtZhpoOiZwisd2QyK7sw":{"text":"I wanted to try this restaurant for my birthday (July 24) but was unable to because right ","useful":0,"cool":0},"9Ci0sRvn47xtBFOCeLcykA":{"text":"MOST HORRIBLE EXPERIENCE IN NEW ORLEANS! EXTREMELY RUDE STAFF. We were celebrating my birt","useful":0,"cool":0},"3hTXwiTpkI3-SBZIe_Dhgw":{"text":"I'll start off by saying the menu itself has plenty of dishes to choose from. If you find ","useful":0,"cool":0},"Un4WiJuyAtdjs5WYZE6OKg":{"text":"Food was great so was the service , It was just very loud Couldn't really have a conversat","useful":0,"cool":0},"TqrUThV-VTZLLSXAT8spcQ":{"text":"Had a party of 3 and was told it would be a 2 hour wait. After 3 and a half hours we still","useful":0,"cool":0},"nJLsoMg5CqqnL_PJkxxMQw":{"text":"This restaurant is really good but it's not the biggest establishment so I've never been h","useful":0,"cool":0},"ZGl_u4VgmRvWvXPbbu_UtA":{"text":"Everything about this place was on point. For starters the waitress was attentive, friendl","useful":2,"cool":1},"SVch8vEkEOBDAXntBUzd5g":{"text":"I'm not a brunch lover. I'll go back when it's not brunch. Will definitely try the chargri","useful":0,"cool":0},"rG8QXUi2cBJg6OEIYub6SQ":{"text":"I've been here a couple of times and the service is pretty consistently the same. Always b","useful":0,"cool":0},"WF6nudcZEH8xGKYl6Qmn0A":{"text":"Two words: ABSOLUTELY DELICIOUS!!! I ordered the steak and eggs with sweet potato pancakes","useful":0,"cool":0},"RRlDQhgh9o-Y_e2izkKNFQ":{"text":"Great find on Saint Claude. The food and drink were fantastic - try their Bloody Mary and ","useful":0,"cool":0},"ajrYFneFhwO9Dgtjwn5AOA":{"text":"We went here last night hoping to get a true taste of New Orleans. The atmosphere seemed v","useful":4,"cool":0},"CmOb4MFgfji0FS7JVbP5ng":{"text":"I came to Morrows with high expectations and they did not really meet any of them.   First","useful":0,"cool":0},"63V7Ag9yWbRhAZl1Y5F7xw":{"text":"OVERRATED. I don't get the social media hype behind the place. Don't get me wrong it's not","useful":0,"cool":0},"DDd3nyKR5A0pjjNguNETIw":{"text":"First time coming here! I'm from Houston and the gentleman at my hotel recommended this pl","useful":0,"cool":0},"_lpVrXmxJck5Hm-xfDWxvg":{"text":"You really have so many choices to get great food in NOLA and I have a selective palate wh","useful":0,"cool":1},"XwCN1R0VXHqb8EVKJUnbqw":{"text":"Got there around lunch time, and I wasn't disappointed at all. We were seated right away. ","useful":1,"cool":0},"CSlZcePLexd9mTm9K8bBbA":{"text":"WARNING: this is a long but well worth the read. \nThis experience was by far one of the mo","useful":4,"cool":0},"nQt1K90Ok9Wy8GSqnINO4A":{"text":"So I came to town from Indianapolis Indiana and everyone kept talking about Morrows. From ","useful":0,"cool":0},"-rnjTPKR2LUVooF3mOypVw":{"text":"Have you ever had great food, libations, music, customer service and laughs?\nNow have you ","useful":0,"cool":0},"XsfhO1KDN_isiqPw5lHP2A":{"text":"I've been here 3 or 4 times at this point. They consistently have good food, slow service ","useful":0,"cool":0},"mJSV6HIrJIOMXfAjgwCPtw":{"text":"I got the Red Fish and grits and I was wowed! Everything about it was delicious, from the ","useful":0,"cool":0},"f-fbk1dd2m1QI5CO4VB-aQ":{"text":"Morrow's was such a lovely place. Entering we were greeted by the lovely hostess, we sat a","useful":0,"cool":0},"NiK_cwvg_0fLwIROWx-cqw":{"text":"We stopped in for lunch on a work day and the place was packed. We had the choice of waiti","useful":6,"cool":2},"jN5RkfT9zXnuQT0xKuDd3A":{"text":"Best service. The people were so friendly! \nWe ordered the shrimp po boy and fried chicken","useful":1,"cool":0},"Il9sMIZC-e8wxnzaovJslQ":{"text":"Food-5\nAmbience-5\nService-4\n\nEverybody raves about how good this place is, and so I was sk","useful":0,"cool":0},"iTii-S17BAwcibeWxS57vA":{"text":"It was a busy Friday night but service was fast and friendly. Food was delicious. Worth th","useful":0,"cool":0},"zB-RzhKyFpaqukIy3xI0xA":{"text":"We visited Morrow's for V Day Lunch. Food was delicious! Large portions and very flavorful","useful":0,"cool":0},"fcGBDPfAtvufvTVGGnW8Zw":{"text":"Come during happy hour and get the rum punch. The Marrow's fried chicken was phenomenal. I","useful":0,"cool":0},"WLSFraDVsUIUqwneK6KWwA":{"text":"This place was recommended to us by several locals on our visit so we decided to give it a","useful":0,"cool":0},"3iG0zlvIIwVdah_I3Rk3qg":{"text":"So we were wondering why the restaurant has three stars and now I know. The customer servi","useful":1,"cool":0},"sXFa4qUsuXk4G_6kIAyVGg":{"text":"Exquisite food! Great service! Amazing people! Be sure you get the chargrilled oysters and","useful":1,"cool":1},"zJhBVK-XVUmFr7uK_eAc9w":{"text":"my red beans & rice with the sausage on the side was well prepared, smoked & balanced perf","useful":0,"cool":0},"OV566ishi3AugyEz_xbJzA":{"text":"My family and I dined in celebration of my birthday. We were extremely disappointed when t","useful":0,"cool":0},"b3l5h2s_xApyJRvr-fhb7g":{"text":"By far the best dining experience I've had in New Orleans. The owner Larry Morrow is extre","useful":0,"cool":0},"eeS2L23IjvmMXL_XANmtSg":{"text":"I celebrated my 29th birthday here. We had an amazing experience!! The owner went out his ","useful":1,"cool":0},"aCuv2tXjc4dBxSEraun6Wg":{"text":"Literally, everything was fantastic. Totally worth the wait. The service was good and the ","useful":0,"cool":0},"EsUig2BvUivXw4bSzB1JfQ":{"text":"Had the Hennessy margarita and pasta lenora  everything was perfect. It's the pasta you th","useful":0,"cool":0},"nxpCmZNk3xWU4MDzC2uL-w":{"text":"Positives: Highly recommend by the locals, overall mature and inviting atmosphere. \nNegati","useful":0,"cool":0},"VOMjDB7FJ6-jKpPvLPWK8Q":{"text":"Sat down at the bar about 3:30 in the afternoon.  The 4 or so workers behind the bar prett","useful":5,"cool":0},"S8cnMO6FUBeRMrbkD66UiQ":{"text":"Food really was amazing..I even loved they gumbo and I never eat gumbo at restaurant becau","useful":0,"cool":0},"8KYc8gz0b3seGetwhZZgVQ":{"text":"I came here last night, September 23rd and the entire experience was amazing. The oysters ","useful":0,"cool":0},"0QipcYwxZT1OQGK6dmbyEQ":{"text":"Morrow's is good as hell. We made the mistake of going to another highly raves place the d","useful":0,"cool":0},"ZArE5vOGzvLSnbg988ZhJQ":{"text":"The food is exceptional!! Would give all 5 stars but the wait and the service forbids it. ","useful":0,"cool":0},"lNZ7EqqFZKwlPlu__1Ffdw":{"text":"I came here for lunch one day because my coworker told me is really good for local food. S","useful":0,"cool":0},"ncReBsSq8clKonKTdzjH0w":{"text":"Yes indeed! I recommend the lettuce wraps and the shrimp platter. You will be so happy !","useful":0,"cool":0},"rKq1ezVxHvtXyS0ftHzBUQ":{"text":"The food was amazing. Service was trash. Just the checking in with table wasn't consistent","useful":0,"cool":0},"ix6Plbu0XkLJVpABkJkkRw":{"text":"Amazing staff! Def get the charbroiled oysters and the Cajun catfish Benedict! Soooo yummm","useful":0,"cool":0},"LnQ7i_s3aDQs-I30E2e4ow":{"text":"I had the Bayou Red Fish, and instead of the Potato Salad as a side I got the Garlic Mash ","useful":1,"cool":0},"Lw12xMNsnDbFbOWwjFVHEg":{"text":"Each time I visit this place I fine a new favorite. I had the grilled redfish for lunch an","useful":1,"cool":0},"d5dQnIAWJu1tkrbFyJbHJw":{"text":"Each time i visit New Orleans i will be eating here! Great staff great waitress and waiter","useful":0,"cool":0},"J0eNcRgckHxSRjbjwqFpLw":{"text":"Service was mediocre it was about 10 minutes before they asked us if we wanted any water w","useful":1,"cool":0},"gJA92RynoiTYGogbprT5ig":{"text":"Waited more than 2 hours to eat...this place needs to have a 2 hour maximum to sit and eat","useful":0,"cool":0},"6chiBj09fciPUQ4Tnr6k5g":{"text":"I waited to try this place out after a few friends informed me about their less than excit","useful":0,"cool":1},"CyRBrweGPoUKtwnTAh070w":{"text":"Awesome, awesome, awesome. All around. We were warmly greeted by the hostess Imani. Our se","useful":0,"cool":0},"bV2qHYcYZHCz1GotE7bduQ":{"text":"Great food & attentive waitstaff. The Crawfish Etoufee was phenomenal and the Butterfly Ch","useful":0,"cool":0},"e69kf_1AO--Lu3iX1IRTeg":{"text":"This is one of the best places in New Orleans to eat. I'm not a really a foodie but I'm so","useful":0,"cool":0},"bH6Oq6K-2JB1hQWDcMsjyQ":{"text":"I absolutely  it at Morrow's and I'm 1/2 through my dining experience Mango Mimosas Charbr","useful":0,"cool":0},"ntqQ-Jnq3Mdsp7wNQo3AfA":{"text":"Fire food. Fire music. Fire vibe. Definitely a dope spot to go to ANY night of the week. J","useful":0,"cool":0},"3OcmhFdM8EdZ8G6glhYLEw":{"text":"Review from New Yorkers.  Came here with 3 other people on a Thursday night. We heard good","useful":2,"cool":0},"ZsAEhpp-TSZzYqAm52dhcQ":{"text":"We came to Morrow's last night for a birthday party. We ended up having 11 people. We got ","useful":0,"cool":0},"AJ0j1h-n3lvIo68gyscddg":{"text":"The atmosphere is casual and they play your favorite R&B jams! The rice bowl is tasty, but","useful":0,"cool":0},"EJgW1kpR_Fwug2KEaFTDtg":{"text":"The sign on the door states closing at 11:00pm. I Arrived at 9:20pm and the front attendan","useful":0,"cool":0},"uEztEWN4_0outbLobj62YQ":{"text":"Grilled salmon with brown rice and the house salad was just what I needed - the cocktail n","useful":0,"cool":0},"cL_7y2URYMLnM8qwfjFSIQ":{"text":"The worst experience across the board! Between the hostess telling patrons to \"just go som","useful":1,"cool":0},"V78B97caoaC5-xjPdC63yg":{"text":"Hands down the best restaurant we had while here for an entire week! So good we canceled p","useful":2,"cool":0},"ljfdU2LhcWzIdnbVsXJIvg":{"text":"Went during a Sunday afternoon for a nice brunch with friends and left very satisfied! Bea","useful":0,"cool":0},"Y3St0IjpIQi6eEaWcpc_Bw":{"text":"1st time here and my expectations were high because I've heard so much about this place an","useful":1,"cool":1},"GKFDliwurzmxAkAwF5X8QQ":{"text":"A group of 10 of us were down for a conference and Morrow's was recommended to us.  We arr","useful":0,"cool":0},"tOaf1AjblQEePXv_Kt1QIA":{"text":"Food was hella good and hot fast service, will be returning on my next trip to New Orleans","useful":0,"cool":0},"5VPlngyTzw80gv1qDg8OlQ":{"text":"The chicken lettuce wraps are a must try on the appetizer list. Our waiter was attentive a","useful":4,"cool":0},"DPST5OMNpRMslW3lDbtKHw":{"text":"This place came well recommended and didn't disappoint. In fact it superseded it.  The hos","useful":0,"cool":0},"DXtMMYXOiXzI9i-IMWgOhw":{"text":"This is my second time here. Really cool ambience. Nice vibe. The Henny Rita is so good. T","useful":0,"cool":0},"1rqWU7ySwomh5U9fmIj0og":{"text":"You know when you leave a review something was really good or really bad. In this case, it","useful":0,"cool":0},"8DIxAQ98Jxv9l2P9OV8uqg":{"text":"Great food, great ambiance, great customer service. This was my first time in NOLA and I w","useful":0,"cool":0},"jBUs0AIh53ngGAtBfbeinw":{"text":"Amazing food! Friendly staff & loved the decor. They absolutely live up to their reputatio","useful":0,"cool":0},"XqCC6Fo50hH7K9cc-Kfsow":{"text":"Very good flavorful food. As an appetizer I had the crab claws which comes ready to eat no","useful":0,"cool":0},"JRPOSq0LNZcDL4cvLxZhIA":{"text":"Omg! I was too hungry to even get a picture, but Gat damn. I don't know if it was because ","useful":0,"cool":0},"47Bb8bpnbiC_x3vgMonwgQ":{"text":"The food was amazing, which is the worst part of having to write this review. The service ","useful":6,"cool":0},"1Lq7HGnzMturZ1hyvJTGuw":{"text":"So so good. Great staff and best grilled oysters in the city. Just stopped in for the crab","useful":0,"cool":0},"UeCwOOqWoP_y_subkgKUQg":{"text":"Good spot. Had the bbq shrimp. Best I've had in a while. Drinks were good. Expect a crowd ","useful":0,"cool":0},"bB8tgygrwy9ceBPjjCGUGg":{"text":"Visited this place for lunch at the request of a friend. I liked the vibe of the interior ","useful":8,"cool":1},"WPtVF6MwkVGBBItq_lXceQ":{"text":"This is a great place to visit to if you're in New Orleans food is good drinks are great e","useful":0,"cool":0},"BqzVSAkO3lAhYH7FoQpgzg":{"text":"Okay this is definitely my new favorite spot!!! #1 can we say BLACK PPL ARE EVOLVING!!! Ya","useful":1,"cool":0},"hiZjIOTidD4jLHFrTnEEYg":{"text":"I ordered the raw oysters,and they were huge. Also ordered the Chargrilled Oysters which w","useful":0,"cool":0},"LsVbhk4suqtUTDVsZGmDSw":{"text":"It is well worth the amount of time you have to wait before you get seated. The space is s","useful":1,"cool":1},"Z5CfxExcK51toSW4KTQLJg":{"text":"First I'll start with pros: Good music while waiting and strawberry mimosa  \nWith all of t","useful":1,"cool":0},"3QpfWtIq2kzd68xZb8OS8A":{"text":"The food is delicious, the crawfish pasta with fried fish was well seasoned and spicy. The","useful":1,"cool":0},"bRrDR4hsEiwrf2V-A5HQug":{"text":"I've never had a bad food experience here but I have to warn you when you go prepare to wa","useful":3,"cool":1},"0CDsc0bKbc9oldOuGYFG1Q":{"text":"I absolutely loved this place, it was our first stop when we touched down and our last sto","useful":0,"cool":0},"SV7iPUlIyf_33BduBfVptg":{"text":"I've heard so many things about Morrow's. Finally being able to eat there, I can definitel","useful":0,"cool":0},"NhZxc0UtdxuJlcrJuMKcIg":{"text":"I absolutely fell in love with this place! This was some of the best food I had in New Orl","useful":0,"cool":0},"IMiR22Ajr0OlshRh-qa9gQ":{"text":"Arrived here at 9:30pm on a Saturday with a party of 6 and was told that they weren't taki","useful":2,"cool":0},"LaU0AQb4aBwXyaiIZy_TtQ":{"text":"I wanted to love this place. So much so I visited twice last week during my stay in NOLA.I","useful":0,"cool":0},"nDGDxfO6f-GWUUWIaRNurg":{"text":"Four stars only because they had me wait but there were empty tables , so odd. Service was","useful":0,"cool":0},"691DBVWNWXD1FZS7TQOqHw":{"text":"The food and drinks were absolutely amazing !!!!!! Our server Fernandez was so sweet and f","useful":0,"cool":0},"Qv-dgir7uiI7yKLj0YKy3Q":{"text":"Wow! Visiting from the Bay Area with a group of girls and this spot was highly recommended","useful":0,"cool":0},"bsb0QlRdgznLTQ2u_nJFyg":{"text":"In town for Essence and stopped at Morrow's. The wait was about 45 minutes in the middle o","useful":0,"cool":0},"_23Vf-tPt2tiuCAz2abQ1w":{"text":"We went to Morrow's excited to experience what all the buzz was about. We had heard about ","useful":0,"cool":0},"YqP9spQfVawCI9Msp700Mw":{"text":"The food was absolutely amazing! I had a cup of gumbo, and the red fish with red beans and","useful":0,"cool":0},"6cybRzYmk0grjz-jBlwmVA":{"text":"Service is extremely slow. 45 min wait to get seated. Waited nearly 2 hours on a random Mo","useful":0,"cool":0},"BugmpkCmI7oc0Rm0YoRYAQ":{"text":"This has got to be one of the most unprofessional establishments ever, this was my first t","useful":0,"cool":0},"VTP5e1VXJOpHkCXpYYHApA":{"text":"Yes, yes, YES!  Morrow's hits on all accounts.  Friendly service, a lovely and lively room","useful":3,"cool":0},"Me-ap1O0I52tSEoTrbbt5Q":{"text":"Omg the food was AMAZING. A must go place in NOLA!.... We went there with a large group an","useful":0,"cool":0},"XjmpaD1eolnA_R7HK09HqQ":{"text":"The food was great! We had the steak, onion rings, braised cabbage, garlic potato, and shr","useful":1,"cool":0},"YlHiZeaL6sTV6e7rQdyUGg":{"text":"Another Instagram find that I couldn't wait to try. We came here because other plans fell ","useful":0,"cool":0},"Pkq7OKvZyAwrzJMqjIq1Gg":{"text":"Absolutely awesome food.  Well crafted food.  We had the fried chicken and the salmon.  Fi","useful":0,"cool":0},"LgmAXafFVCIABWTQ0lTciA":{"text":"My new favorite restaurant!\n\nThe food here is wonderful. I've had several dinner and brunc","useful":0,"cool":0},"FddG0aDZn_f_QXaJA4B_vQ":{"text":"Eat here! We had the gumbo, etouffee, red beans and stuffed mushrooms. Everything was dele","useful":0,"cool":0},"OEHHU_XmKhM3JOHpa13G1A":{"text":"Saw this place on Instagram one day and the food looked really good. I was already down in","useful":1,"cool":0},"cwKOe6XSiNj0JRvJ58_aZQ":{"text":"Overall the food was bomb. We was seated pretty fast but the food wait was a little long. ","useful":0,"cool":0},"IslFdkhivolxe78NvHbi9Q":{"text":"Quite possibly the best meal I had in NOLA... got the Crawfish pasta OMG the cream sauce..","useful":0,"cool":0},"aM5NxLpFmfLriYoNdJ3kPQ":{"text":"I'm being generous with the rating because the food was pretty good. I had the crawfish pa","useful":3,"cool":1},"-KnA8QiZx459Fd3qt-ZXmw":{"text":"Great food and great atmosphere.   The place is had a really great atmosphere and the musi","useful":1,"cool":1},"Pb-gKohfNg7xOv384DTMXw":{"text":"I recently went here for my friend's birthday lunch. I ordered the steak and it came with ","useful":5,"cool":1},"cs4EasQsQlNTewxeXxEplA":{"text":"Heard a few people talk about this spot so I wanted to try it for myself. I had the fried ","useful":0,"cool":0},"MS6iqtUW1Y33pcVIUmNlhg":{"text":"Food was sooooo good! I ordered gulf shrimp and fries (the shrimp were HUGE) my cousin ord","useful":0,"cool":0},"CJMxSmnO2buYAnG3iUvEGg":{"text":"Visited Morrows for brunch last weekend and it was incredible. I had the fish and grits bu","useful":0,"cool":0},"QQnVpLEPD7aGvGAYZ03B1A":{"text":"New Orleans next great restaurant, incredible staff and management.  Great food, this plac","useful":0,"cool":0},"8ixCODixLevx0u3OHxJFMQ":{"text":"Absolutely wonderful food. Very pleased. Had crawfish bread to start with. Then shrimp pas","useful":0,"cool":0},"OEgIZvxF6NZnvBwxRSLXCA":{"text":"This place was nice! Our waitress was very nice! Drinks were good. Food was decent also! I","useful":0,"cool":0},"QGpZb-1Rpfm8fulZ3ansEQ":{"text":"It's was a great experience, the food the culture and moral of the restaurant was great! W","useful":0,"cool":0},"Ex0fcdpafksxwjRMXD4pKw":{"text":"Third time is a charm.  Celebrated my mom's bday with family and friends.  Everyone in our","useful":0,"cool":0},"2VWJl60PtzC6auULTkn9HA":{"text":"Went during Essence so it was packed and there was an hour and a half to two hour wait. Ho","useful":0,"cool":0},"VDszS9mW7KetY8oyJ3KaIw":{"text":"I just got to New Orleans, I honestly came here with no plans at all, I just wanted to see","useful":0,"cool":0},"4AiorHXDg8bv54RdlsHQ7g":{"text":"Morrow's has a nice vibe. It is not a big restaurant, it is somewhat cozy. If you don't ha","useful":1,"cool":0},"NetGD8FEbGFb9bUwWieLfg":{"text":"Had a rather bad experience here tonight celebrating my sisters birthday. Had a party of 1","useful":0,"cool":0},"6XQIqbPagqZdCp6x3s8nlg":{"text":"Great place! Love the chargrilled oysters topped with crabmeat. Sunday brunch is awesome. ","useful":0,"cool":0},"n9KS989m4QKF2z20t4wLLw":{"text":"Best wings I have ever eaten. Full stop. Perfect fry,perfect seasoning and sauce ratio. St","useful":0,"cool":0},"mkrA0CwCBlVEYOGm5XNiTw":{"text":"This is one of the hottest up and coming restaurants in Bywater New Orleans. Not only does","useful":0,"cool":0},"gMF5irzk4LCUBEvAv-vWoQ":{"text":"So we were wondering why the restaurant has three stars and now I know. The customer servi","useful":6,"cool":0},"qNA__Qi-hmrva0_10GouOw":{"text":"My first time at Morrow's and I must say I really fell in love with the place. I can with ","useful":0,"cool":0},"XhvYZgTYJFQs4vdDSm60cQ":{"text":"Horrible experience!!! Party of four arrived for dinner on 9/9/19 with no wait. We were si","useful":0,"cool":0},"LZFq7HWCLs76PQTvMjU5Dg":{"text":"My friend and I had a great dining experience at Morrow's this evening. I loved the half d","useful":1,"cool":1},"dpqa327nQVM2gBKthyodtg":{"text":"Such great food and great service too. I started with the Carlita's way and it was the way","useful":0,"cool":0},"FIne9IKnOOZugsNrg3kXbQ":{"text":"The food was actually pretty good. Had the Alfedo with shrimp, which was very tasty! My mo","useful":1,"cool":0},"eadld2bs7JRFztUwENHTzg":{"text":"The lettuce wraps were stellar! I ordered catfish which was amazing however, the greens we","useful":0,"cool":1},"t35H9YBVT7-F6hLbb8dWbQ":{"text":"Came to town for Mardi Gras, got the recommendation from our Uber driver to check this pla","useful":0,"cool":0},"MxZgETTi7NJhZl1kcJe12w":{"text":"Great authentic Cajun food in New Orleans. The food was amazing and very large portions. I","useful":0,"cool":0},"ST0jdtAxbk0gg9h9jDY6Cw":{"text":"A must when in New Orleans,  the menu is very easy and the food tastes like it was especia","useful":0,"cool":1},"szeWLCCcMfRAzZMRk6TxkA":{"text":"This spot was recommended to us by our uber driver and it was a homerun. I had the salmon ","useful":0,"cool":0},"GfqisOg54kBGZiQNVJx_bw":{"text":"The food was great!  The only reason I didn't rate 5 stars is because we ordered two bowls","useful":0,"cool":0},"EPh9WTTvc81qjOXD8HSf-w":{"text":"We visited Morrow's at lunchtime (lettuce wrap and crawfish pasta). There wasn't a wait, i","useful":1,"cool":0},"wRuB1xMO2tVuKDMnxXETjA":{"text":"I'm super disappointed by the service here! The staff were super rude. Came accross the co","useful":0,"cool":0},"5T4cU8LZTYoOJW0Buo2mjw":{"text":"This place is a great stop in NOLA. It's a black owned restaurant with great roots. It's a","useful":3,"cool":2},"TCHBkWponP8JY5wmJgESCw":{"text":"This was a horrible experience and would never recommend this place. We waited in line sin","useful":0,"cool":0},"YQsoD8DtWzL5_oufBn2zpA":{"text":"I was super excited to order from here. I've had many friends tell me that this place is a","useful":0,"cool":0},"zenOBwB4KK9NADHBB_GyLg":{"text":"I personally didnt like this place. Everything highly priced even for happy hrs. Maybe it ","useful":1,"cool":0},"XVK5zRBBebqVKA5SGG2zvg":{"text":"This was by far the best restaurant that I visited while here in New Orleans. I'm from Los","useful":0,"cool":0},"RyRqtDtBKAgryUGd5nsh3A":{"text":"Morrow's is one of the Best restaurants in New Orleans. The food is delicious and the vibe","useful":0,"cool":0},"v6V1y6G7CO6FKfNEYrl2qA":{"text":"Super chill atmosphere and servers that know the menu!  The red beans and rive and fried c","useful":1,"cool":1},"yr4ynUzJdRmAGCCkGPLxqQ":{"text":"While I was in town last weekend, I searched for different restaurants to try and this was","useful":3,"cool":1},"CK1iNIIWgJ8ansaNEN0PHg":{"text":"I DIDNT EVEN GET A CHANCE TO TASTE THE FOOD!! I WAS SEATED TODAY AND WAITED 30\nMin for a w","useful":1,"cool":0},"LcqFc6jbwNzteZRJb7Yf6A":{"text":"Now let me start off by saying the food is everything!!!!! You will definitely wait the de","useful":0,"cool":0},"3TxQCcCxiQPKZs_1WyUWWQ":{"text":"GREAT service, food and atmosphere. Were very accommodating and throughly enjoyed. Will de","useful":0,"cool":0},"IW_fsdHyzBr00M6fPhccGw":{"text":"This place is inspirational, relatable, and simply  beautiful! Morrow of the story.. if th","useful":0,"cool":0},"N35G2rl8KnuHtKycdQUjpA":{"text":"I heard about the Mother and Son restaurant and couldn't wait to try while in Nawlins on o","useful":1,"cool":0},"k9_fX0t7mRes43h3fO7zBg":{"text":"File Gumbo was DELICIOUS! We wandered the area near St.Roch's Market.  Heard about Morrow'","useful":0,"cool":0},"oezg0WEW9tVSvjgRW0KhtQ":{"text":"This was an awesome eating experience! The service was pretty good but the food was except","useful":1,"cool":2},"hHC7sll0G5sIRrVYb5o9yQ":{"text":"This is not a horrible place but the food was ok.I had the oysters that were ok and the ca","useful":1,"cool":0},"crqc6TNvN9zFYgqL8qDhMQ":{"text":"As much as I wanted to like this place, it was just disappointment after disappointment. D","useful":0,"cool":0},"_xLH7LZ35qqHwrE-_vyZqg":{"text":"My same ecstatic review remains, never disappointed.  The oysters were a little small but ","useful":1,"cool":1},"ZnHVU0606S7HExtRXj5KQg":{"text":"Everything was excellent! The crawfish pasta and catfish was seasoned to perfection, the w","useful":0,"cool":0},"ucnCTFAjDT1WIeHmB1lQAQ":{"text":"The food was absolutely delicious! The gumbo was exceptional as well as the chicken, Mac a","useful":0,"cool":0},"zZPrXQ7537tSMmCFyPpkYw":{"text":"We were in NOLA for a girls trip for birthday celebration. We decided to make the trek ove","useful":0,"cool":0},"_kt0I9MRvigN1oWdJsNB0g":{"text":"I'll start by saying this place is totally hyped up. We arrived at about 1:30pm wish and i","useful":1,"cool":0},"uTe-hBk1H-N4vO08O3_cjA":{"text":"You really have so many choices to get great food in NOLA and I have a selective palate wh","useful":0,"cool":1},"_VVgLiPMjT84LRM1g66P-Q":{"text":"Ssimply AWESOME....\nFood was oustanding... and the service was too.....","useful":0,"cool":0},"iKlat1kqiveKxURpR0wq2Q":{"text":"So disappointed with our experience!!! We waited for an hour and a half for a table which ","useful":0,"cool":0},"DzcRkoYi42YcZt5RqFEA6g":{"text":"Reviews are in: \nBywater, this is the hottest thing going on next to Roberts Grocery! For ","useful":4,"cool":1},"lDXs1L5K5yNAAIikqxy0Lw":{"text":"I never got the Chance to try Morrow's , but today my friend and I decided to go try brunc","useful":0,"cool":0},"8Ql3SWLinL8_RufhN1opVQ":{"text":"Support black owned! Great drinks, the sweet potato fries were so good. I didn't like the ","useful":0,"cool":0},"QAAcxtdeP777pCtiqanWbg":{"text":"So happy I went there. My daughter and I love going to new places on Sunday. The food and ","useful":0,"cool":0},"m9saCw0uHhvheloYOIHE1g":{"text":"Great food, Great Ambience,  fast ,friendly and professional service.  Large variety of fo","useful":1,"cool":1},"RrlV3Sis3nXGuMQTxgssJg":{"text":"Decided to try this spot for brunch during a recent trip to NOLA and the reviews here are ","useful":0,"cool":0},"JJdM2Vc2VElaZQyrLY1Rjw":{"text":"The food is oh so delicious. Great atmosphere I love the seafood platter and the gumbo was","useful":0,"cool":0},"97qcARjk8J_pB9M6jlJekQ":{"text":"A great place get there early because seating is limited and it's packed.  Went for brunch","useful":2,"cool":0},"xE6Q9CTLH9cp9FvnF0v2ww":{"text":"New Yorker here giving my experience. A New Yorker who has never been to New Orleans and d","useful":0,"cool":0},"vjJEZ4XqiVPmIkYU8F3A3w":{"text":"This has been on my list of places to try for awhile. I've heard so many great things abou","useful":0,"cool":0},"DVkPv5fL_1ENcoWlWpbXGw":{"text":"Everything was fantastic except the hostess! We called ahead to see if there was a wait an","useful":0,"cool":1},"AuufeldUVoT1FrZBO70zdg":{"text":"Trying this place out in NOLA after seeing it on IG was a must! The food was sooooo good a","useful":0,"cool":0},"Q3QQzIW-szF9MR4EGtek7g":{"text":"I came down for a quick vacation with my bestie and was so excited to try this restaurant.","useful":0,"cool":0},"-fQl4J0L2iveea7Vr06coA":{"text":"This place was delightful. The food was seasoned perfectly & everything had flavor. We did","useful":0,"cool":0},"vgGuAFf6pAUJ-s7o8wfJqg":{"text":"This place is one of the reasons that I love food in New Orleans. Morrow's is a place that","useful":0,"cool":1},"K7BxR8TuM8GseM41H_krlw":{"text":"I'm not sure what all the hype is about Morrow's, but it definitely ain't the food...at le","useful":1,"cool":1},"e4qJ-1Pb_Pc01n8PoK412A":{"text":"Amazing! \nHad a group of 8, Fernandez was an outstanding waiter.  Great energy, phenomenal","useful":0,"cool":0},"LwaMa_uMH5Q7CiUiu8ndcA":{"text":"Me and my husband celebrated our anniversary here on Saturday night and Sunday morning. I'","useful":1,"cool":0},"m78ldbNWZUlFgSS6QfdrSA":{"text":"Good vibes! Good food! The fish we got was a little undercooked but the oysters, crawfish ","useful":0,"cool":0},"UnA2tiELGidjrpPWw_NE8A":{"text":"The wait time way to long with no where to actually wait... The food had NO seasoning and ","useful":0,"cool":0},"iADzAHdK82e-AGoJnlATdg":{"text":"Slow service at the bar, to the point that we walked away from it and decided not to get a","useful":5,"cool":3},"l-_43lfQxSswcxhlz9RRjw":{"text":"This establishment came highly recommended from a local. We decided to visit our last nigh","useful":14,"cool":1},"9snmDxjCuXaasNFoJcydRA":{"text":"Wow first let me start by saying how ridiculous the wait is! Just horrible and there table","useful":1,"cool":0},"cx2NpFh4Cd5JzxsD5-zmCg":{"text":"The food here was absolutely amazing. The ambience and environment is nice. The employees ","useful":0,"cool":0},"8_Nwoc5hton4pXL06Ees4w":{"text":"I had heard so many good things about this restaurant but I have to say I was disappointed","useful":0,"cool":0},"6gO1ZKzA7qbQhvRSGBTvtA":{"text":"Went in yesterday around 3pm with a few friends. We were immediately seated. Our server to","useful":0,"cool":0},"U30FDYzbXzDnQRtPixq0WA":{"text":"So my husband and I were in NOLA celebrating our anniversary. I had been hearing mixed fee","useful":2,"cool":0},"efQdEDXocs0valP1BUgxVg":{"text":"I've been following this restaurants Instagram since about around the time they opened, an","useful":0,"cool":0},"p_0YGVoEKC6KzwerCeEhlw":{"text":"NEVER EVER AGAIN! Worst customer service experience in a New Orleans restaurant. I placed ","useful":0,"cool":0},"wsoTRmXf8xJXnk1caVH5mg":{"text":"Visited Morrow for brunch and soooo glad we did. Service ( Diamond) and the food was outst","useful":0,"cool":0},"PWkAg3FWKkmpE8w9YALs-A":{"text":"Great ambiance, excellent customer service, deli food and good  drinks.Minus one a star be","useful":0,"cool":0},"UOKTlhC_8xsA6IzPwKlKtA":{"text":"The vibe was cool, neighborly, hip and family friendly. The food is outstanding. The redfi","useful":0,"cool":0},"6zNM_DBreL3BCWfeYlZtEg":{"text":"The servers are always pleasant but there literally no sense of urgency. And they never an","useful":1,"cool":1},"p9c3hwPkVxVwpQ48m4HPSg":{"text":"Very good food and excellent service. All the food came out really hot & the stuff was fre","useful":0,"cool":0},"PhFDN5KA2t2PiPJfu2y6Wg":{"text":"Delightful neighborhood spot with some of the best fried chicken on the planet.  Attentive","useful":0,"cool":0},"NOl3iNnQsQjh-mMu7FgB7g":{"text":"Service is excellent. Smiling faces greeted me at the door. My waitress, Kirsten, was smil","useful":0,"cool":0},"VDhh2KZLWRGFO3NM-FHN1A":{"text":"Morrow's is another place on my must visit list. I have been following them on Instagram a","useful":2,"cool":1},"bwbaJKP5hCo8BhvlPCrQ0A":{"text":"This place vibe was unbelievable. The wait was long but it was worth it. Great service gre","useful":1,"cool":0},"qz16Rv9j6KmxnSI8Ox_ehg":{"text":"Excellent dine-in experience although it was very busy/packed for Essence festival this we","useful":0,"cool":1},"HmnGDpjN9fA69WrslPi6bA":{"text":"I've heard so much hype about this place and couldn't wait to try for a friend's bday dinn","useful":2,"cool":1},"N4x8SvCuKWNGOhEQyVV_tg":{"text":"Morrow's is on its way to becoming a staple in New Orleans food culture. Everything I have","useful":0,"cool":0},"ENA4-aL4aPIkcs_BcBJkMw":{"text":"I went here for a birthday party and the atmosphere was good. I ordered the Crawfish pasta","useful":1,"cool":0},"Znmz0gptajZd-5bhTBAgNA":{"text":"A friend, who lives in Houston, and I went to the restaurant after attending an event at C","useful":0,"cool":0},"ae4sEFhsmtkCMRrN6MT7tA":{"text":"A coworker recommended Morrow's and I went for early dinner. Walk-in with many empty table","useful":0,"cool":0},"fpZlWGGcK9wniCZdrjf6rA":{"text":"Amazing food. Had to initially wait 1.5 hours to be seated. But everyone that walked out w","useful":1,"cool":0},"zi2X3qsOVJrt9EQufCZsLg":{"text":"Went with my mother and sister and we shared entrees. everything was fantastic. My favorit","useful":0,"cool":0},"QdeGxf8Xl_0Tbyupuu7j3w":{"text":"I had a great experience at Morrows, and will definitely be back! We sat at the bar, and h","useful":0,"cool":0},"Pwsl1uZjixrJZo6v_aDmew":{"text":"Great food, awesome atmosphere and service.  So excited to taste the fried chicken I knock","useful":1,"cool":0},"qOfg-KBCY5GEJ8eeZyzmVg":{"text":"This establishment was Highly recommended by my Uber driver from the airport to my hotel. ","useful":0,"cool":0},"2FLorjw3Gnng41Qn3te_7Q":{"text":"This is my favorite restaurant in New Orleans. They have a great food, great atmosphere, g","useful":0,"cool":0},"4N16dAtolqIUjbiY4-565Q":{"text":"Terrible service. Waited for over an hour & ended up deciding to eat at the bar since it e","useful":0,"cool":0},"fOpdPefLTx2xiWyRpkxgww":{"text":"Boyfriend and I went there for his birthday lunch. I'd heard amazing things about this pla","useful":1,"cool":0},"AHt49k6q4YHGD-OLPguDyQ":{"text":"The food is oh so delicious. Great atmosphere I love the seafood platter and the gumbo was","useful":0,"cool":0},"Nskb42WM93ojVyxQCueD9w":{"text":"Wanted to review this spot for tourists. It is a really cultured spot near alot of activit","useful":6,"cool":3},"DIpYGW69WAXIQN_MkSazUg":{"text":"I've been here before and my last visit on yesterday, was not pleasant. The wait-- ~130 mi","useful":0,"cool":0},"dkzbm9f161_JXWiQGsmIZQ":{"text":"I had such a great experience here! I had been hearing mixed reviews so I wasn't sure what","useful":2,"cool":1},"wE1dDiEU8gPsoXPn4wrpTg":{"text":"One of the trendiest places to eat in New Orleans, you never know who you're going to be s","useful":0,"cool":0},"sD_Z5QzZZyp07kUyy76vfw":{"text":"One of the hottest spots in New Orleans! Food is always excellent! Had the gumbo and a sea","useful":0,"cool":0},"vq0YNMW7IwBCgs5pZkS2tg":{"text":"Ok so I never leave bad reviews , but this is necessary. I arrived there at approx 6:30 pm","useful":3,"cool":0},"EHrCdOlTdRq0avn0hyfxfg":{"text":"Great food and service, everyone loved the food. Will highly recommend. My daughter Candic","useful":0,"cool":0},"tqtU-JWqEaA4ErgcMaa5gg":{"text":"Visiting New Orleans with friends and Morrow's was recommended for their Cajun food. Ok co","useful":15,"cool":0},"QZzBkftqY9On2oBd-wS2MQ":{"text":"This was an excellent experience. We went as a small group of three on a Sunday afternoon.","useful":0,"cool":0},"65QXxC6jFzTbYPdIW2F13w":{"text":"I was visiting from San Diego, we stopped by Morrow's to have family dinner. We all are en","useful":0,"cool":0},"IpfXNd03xv5Y8zCQDTBLJQ":{"text":"This was our first time visiting Morrows. We've been wanting to check it out for awhile. W","useful":0,"cool":0},"T9zuFoyMezGCa7CxTqbVVQ":{"text":"Hubby and I back again. We visited on Saturday night February 23,2019. We enjoyed our food","useful":0,"cool":0},"T_Kaf9c0g7S2UHtyYILCAw":{"text":"The wait was really long an little over an hour and we had to wait outside standing up . T","useful":0,"cool":0},"DfR36dvHDbaR3A0mQKtRhg":{"text":"I placed an order on Yelp through grub hub . Apparently the order said is ready at 7:19pm.","useful":0,"cool":0},"6LuYVI6mvHkZwsp3T6aajw":{"text":"We tried to come to Morrow's on a Friday night. We called ahead and they couldn't give us ","useful":0,"cool":0},"uQQI9cKcb28c0y7Ecuek5Q":{"text":"Third visit and I'm quite satisfied. If not taken care of by Blair, Cutie Carly will do fi","useful":0,"cool":0},"RMJ4FMDiLlG218UAbOgcDw":{"text":"Absolutely fantastic. I live nearby and ordered take out. We ordered a large amount of foo","useful":1,"cool":0},"IyTxebcAl62JRQw4M9NWEQ":{"text":"We were visiting from out of town & was taken aback by the last inspection score. After ta","useful":4,"cool":1},"F9a9wGFwr8C7qFJkHynmVw":{"text":"So good. Loved everything, esp the greens. The real show stopper was the fish with crab. A","useful":0,"cool":0},"_zJFs313XS-pfS0GLj4X7Q":{"text":"This place is amazing, good food good service, the macaroni literally melts in your mouth ","useful":0,"cool":0},"TFKBpX5Ki3TcCmyiIKwAgA":{"text":"So me and a friend snuck over Thursday to this new restaurant we keep hearing about. Once ","useful":4,"cool":0},"VpSxwXN2Y6RFviiLOFReiA":{"text":"What a place! Morrows was suggested to us by one of our Uber drivers. We decided to come h","useful":0,"cool":0},"VpV8Q_q1fdSR2T-NVd6ROA":{"text":"I was in town from Atlanta for the Jazz Festival, and my friends and I wanted to see what ","useful":0,"cool":0},"2MAzmZSDMyFunqKP96sxyg":{"text":"The Customer service(hostess) unpleasant experience. I arrived a-little earlier than my gu","useful":0,"cool":0},"2mWArc6SuMsu_skXo-uX0A":{"text":"Been living in New Orleans for a few months and just recently heard about this place. When","useful":1,"cool":0},"Ub5tao5ddHmTHF4wOvyTgg":{"text":"This was very good and lived up to its reputation!! Chicken special, red beans & rice, cab","useful":0,"cool":0},"uh3O-8L2KVNS0dbCo4eR0w":{"text":"Morrows has bad service and the food is OK. The food is good probably if you're dining in,","useful":0,"cool":0},"0eqzx0ZcFrb-XP98Yjo97Q":{"text":"My experience here was ok. It was the day before Mardi Gras so there was definitely a wait","useful":2,"cool":0},"PZElRW8myY9mdNEaECnYIQ":{"text":"Visiting NOLA and this place came highly recommended so we had to check it out. I really e","useful":0,"cool":0},"75TDjdTT8eOtT9CWsgJo6Q":{"text":"I really like Morrow's.  Food is classic New Orleans and really good.  I did wish there we","useful":1,"cool":0},"W-_MKDBMKp0Iq6E70tvJ6g":{"text":"Yesssss Fun Times and Our Last Night in NOLA. Cute little local spot in the cut.  Drinks a","useful":0,"cool":0},"wqvVwSKwQ1UX_ER5gg5Zpw":{"text":"Amazing menu creole and Korean selections very nice atmosphere staff is super friendly and","useful":0,"cool":0},"k8Lyz6HLRJs4DTYnVG2BlA":{"text":"My boyfriend got the pasta Lenora and I got the crawfish pasta. We both agreed they were s","useful":1,"cool":0},"OpWf23eaDH5pQ_pFJCw-cg":{"text":"I don't even know where to start but to say the least  this place was beyond disappointing","useful":0,"cool":0},"yrqNTFp9BqPYrqOsSNg1RA":{"text":"Worth the hype, I was so fortunate to go when there wasn't a wait and the staff was just a","useful":0,"cool":0},"4p7irkFP5xnDiM4ve6n5wg":{"text":"This spot is black owned and provides the vibes. We went for Happy Hour Friday group of 7.","useful":0,"cool":0},"I_eXO9E0EIpdznifeeOVhg":{"text":"Everything was great from the food to the service, to the hospitality and warming environm","useful":0,"cool":0},"WLEHmuw6Gwi-17VA9D3T8A":{"text":"The charbroiled oysters are soooooo good! Would definitely go again on my next visit to Ne","useful":0,"cool":0},"R8eXS2qHqmWZWZ75yMq_tA":{"text":"Came on a Wednesday night for my birthday. The wait was about an hour for a table for 3. S","useful":0,"cool":0},"rla56JuVDxrhaBO_fU9zWA":{"text":"I absolutely love the vibe and the food is amazing  . Only thing , the place is extremely ","useful":0,"cool":0},"2GCcJzKje58edbmnSeU8Lg":{"text":"I've been here a couple of times and haven't been disappointed. The last time I brought fr","useful":1,"cool":1},"WmqQkjRkhYm-dvdKiYCNeQ":{"text":"This food was EVERYTHANG! I had heard about it from online friends so my hubby and I decid","useful":0,"cool":0},"CucUD-aopX_8DmDU-bP3Gg":{"text":"It has been a few days since I had the Cajun crawfish pasta and I'm craving it. I visited ","useful":0,"cool":0},"4Mph_e-t64zv1_Vvv0zLEQ":{"text":"Definitely a gem in the rough here. I understand it's been open only for a couple years bu","useful":0,"cool":0},"mK2FNPHC5WMnw_-inLc45A":{"text":"The wait is well worth it and the food is beyond average. The employees are the absolute s","useful":0,"cool":0},"hy9t_5npyFrgT0-7Mpf7fw":{"text":"This was such an awesome surprise to find this place in the Marigny. Some of the best food","useful":0,"cool":0},"e6VqpBFZDFNDtxZnlQfS8w":{"text":"Awesome atmosphere and the food is amazing! You have wait a lil while but it's def worth i","useful":0,"cool":0},"pygNUWV1xXwLEUoByDcSZA":{"text":"Service was great. Good came out in a good amount of time. Everything we ate was so good a","useful":0,"cool":0},"xSe41-kUCFBdlj9bH1I4iA":{"text":"If I could give 0 stars I WOULD! I was so excited to try this place but their customer ser","useful":0,"cool":0},"wv-7e-iNJaXYTLQOGnHqpw":{"text":"Had lunch here for the first time and left full and very happy. The pasta with the crawfis","useful":0,"cool":0},"-LC-gvip3K54NZlbwHlmKQ":{"text":"Wasn't impressed too pricey for a plate of crap never never never again","useful":1,"cool":0},"W4KXlFv7EmXwB0t3lXOmaQ":{"text":"So because they had celebrities coming in, they choose to have EVERYONE else waiting in 95","useful":0,"cool":0},"-F2JVkat15rFVSmsrSDYOw":{"text":"All around beautiful atmosphere. Very intimate! But was able to accommodate large and smal","useful":4,"cool":3},"PDaAVmZeXcrpeuipmzrWtA":{"text":"I'd been talking to a few friends about visiting this plaace for a while so one of  me and","useful":1,"cool":1},"8NVVrrcuGtlyAd65bT8voQ":{"text":"Soooooo good!!! The crab claw appetizer and the red beans and rice are to die for!!! Also ","useful":0,"cool":0},"saLqy4Ej74gR2RJeysLbLw":{"text":"Man lemme tell ya! If you ain't at Morrow's then where you at?!?! cus this was it , omg I ","useful":0,"cool":0},"8kvD2aYWe30F6OB_IccdJA":{"text":"OMG! Where do I start! This place was absolutely amazing. We visited this restaurant while","useful":0,"cool":0},"yoQ9Euf1V72T3UM6Gf1MwA":{"text":"Listen...this here restaurant is a true gem and definitely worth the 45 minute wait. Our s","useful":1,"cool":0},"aQdlfIFHHEnWb5ehmHCLHg":{"text":"Ok I was looking for a local spot and this is one. Small, but not toooo small. Feels perso","useful":0,"cool":0},"0_e7gx9rqfdKWcU3GSm5vA":{"text":"Morrow's is one of the best spots in New Orleans. This spot was recommended to me by a fri","useful":0,"cool":0},"r1mfCVhX-L75vcgf7THFAg":{"text":"The staff doesn't wear masks,the guests don't wear masks. The owner throws parties KNOWING","useful":0,"cool":0},"5GgLlKEos8IYFeq04RcH0g":{"text":"Food Service and Atmosphere\n\nMy wife and I are down to watch the Cowboys lose to WhoDatNat","useful":0,"cool":0},"tUAkOhTDt8exMQtcDD7vgw":{"text":"Got there at 1:30 on a Sunday was told there were no more tables. The restaurant closes at","useful":0,"cool":0},"hpcamlmnRT4It4U6u1UiFg":{"text":"It was good. The garlic honey wings were A1.  I would give it a 6 on my scale.  I thought ","useful":0,"cool":0},"x16hc3gi4hvuIqN5_ZMPRw":{"text":"I had been wanting to go to this place for years. Literally stalking their social media be","useful":1,"cool":1},"eL6AB3xRJb_ZzDnKaXJOGA":{"text":"Gumbo was off the chain. I had the seafood and sweet potato fries which were on point also","useful":0,"cool":0},"jsQYz537LKiYX2eH9KIwuQ":{"text":"Everything was excellent. Food, drinks, service...you will not be disappointed. There was ","useful":0,"cool":0},"2cjszOouOVlFDoiiPms3uw":{"text":"I could not wait to dine at this place that people are saying they wait a long time to get","useful":0,"cool":0},"MRFoSLmseElnDSo5Wy-8GA":{"text":"Please do not go during lunch time. The server I had was horrible. Our appetizers took for","useful":0,"cool":0},"BKOehVFxTLhX8C3APRZ8kw":{"text":"I am a New Yorker and I am very picky with food and I must say the food  was delicious and","useful":0,"cool":0},"LhhfIom6ZD9yFRCxXMq0eQ":{"text":"If you are ever visiting New Orleans this place is a must go to! The food & the ambiance w","useful":0,"cool":1},"uVDKFlPLJO0_bDQVr51OAw":{"text":"Absolutely amazing experience! The food was incredible and the atmosphere was top notch. F","useful":0,"cool":0},"glX609SLZZ4LXkXXRB4eZw":{"text":"Great food. Great vibe. AMAZING mimosas. Definitely will return next time Im in New Orlean","useful":0,"cool":0},"NWeMBi7YOgK27LJgfFx5AA":{"text":"Food was amazing! Fun atmosphere!\nDo yourself a favor and go. Be prepared to wait if you h","useful":0,"cool":0},"8-M6fvuuUClqu42RKh466Q":{"text":"The stuff oyster was amazing! I went back the next day and bought two dozens.  The redfish","useful":1,"cool":0},"1bMX7ngj3Wa-n2FnYLhNtA":{"text":"This place is great and everyone knows it.  Get here early or be prepared to wait.\nExcelle","useful":0,"cool":0},"7LsHiNDgWlc3Xq6nUOpRIw":{"text":"This place has okay food and all but during a pandemic they need to get there ish together","useful":1,"cool":0},"NIqj8P-5WSD_zVcm71EIxQ":{"text":"The oysters were great. I had the Mac and cheese and red beans and rice which I did not li","useful":0,"cool":0},"GFZQxTNEGj5SKMfevHqSxQ":{"text":"MATTTTTT!!!!! The best waiter hands down! I've visited Morrow's twice and the food is grea","useful":0,"cool":0},"nAdbEB3S--iG3QIhlPxPmg":{"text":"Place is truely overrated. Waited 50 mins and it was atleast 5 parties ahead of me (saw at","useful":0,"cool":0},"TyIOgDWsa9-82AtpemUUQw":{"text":"This is one of the best restaurants in town! The food is amazing and the service is great.","useful":0,"cool":0},"fkeB2S4GKK0TOuJ6KY7Mbg":{"text":"Food was great! I had a cup of seafood gumbo as my appetizer and it was so good! For my en","useful":1,"cool":1},"h_dNhCQXudzSqh683IPWWA":{"text":"Delicious!\n\nVisiting New Orleans for Essence Festival and wanted to try something new. A f","useful":4,"cool":3},"r5jPYW-n6K3tCFbPqDN4ug":{"text":"This place is the place to stop in for lunch, dinner or even drinks. The staff was very fr","useful":0,"cool":0},"54rR4qXFxx6GdG7hzzNSoA":{"text":"When we arrived we were given a wait time of one hour; However the one hour wait turned in","useful":0,"cool":0},"RPRJkerVtZNAbMwxZxd0Uw":{"text":"This is our first time here on a recommendation and it didn't disappoint. The gumbo was gr","useful":0,"cool":1},"C8hTv3yjPC4dRip0g27Dgw":{"text":"The ONLY reason I'm giving them 4 stars vs 5 is because  they were out of chargrilled oyst","useful":0,"cool":0},"FD_CXGRJzmbI15WHak4kQw":{"text":"Listen!!! I don't like oysters...but let me tell you. Do yourself a favor and get the Oyst","useful":0,"cool":0},"7-3wALJAYBRC8LfoKyU3fA":{"text":"Let me start by saying I really do enjoy the ambience of Morrow's but the service is awful","useful":1,"cool":1},"kUqjODiWS6_gvoXuA9JA5A":{"text":"Joined a group of friends for lunch at Morrow's and it was excellent. The fried chicken wa","useful":0,"cool":0},"UcRdY9Ep1uAfkaZ6jqNoLQ":{"text":"Absolutely DELICIOUS!!!! We went on a Sunday and ended up waiting an hour and a half, but ","useful":0,"cool":0},"_qZkH4LGQVA6jVPPeqVhxw":{"text":"I really don't understand the bad reviews because I've been here several times and the ser","useful":0,"cool":0},"i-HjmFHSFauKBNHm3jYi8g":{"text":"This is my favorite restaurant in my neighborhood. I came here sometimes twice a week befo","useful":1,"cool":0},"iU83r9iTpSMYXShPhf4TSQ":{"text":"Best BBQ shrimp I have ever had. You can't go wrong with any dish at all. Excellent servic","useful":0,"cool":0},"Z1Oc3FJDeG781Rgx8-H9EQ":{"text":"I put my name on the list around 1pm and 12am and I'm STILL waiting on the call that a tab","useful":1,"cool":0},"kloBO0BOtIuDajuXZUc7RA":{"text":"Omg!!!! Omg!!! This was the best place a d experience while in the Big Easy! The food was ","useful":1,"cool":0},"gLrVvhtETJgcbXue-qjRyw":{"text":"Phenomenal food and exquisite ambiance. From the 90's R&B playing.. to the mood lighting..","useful":0,"cool":0},"SrmH6g6rW637xSJ8U-7FxA":{"text":"The first time I tried to come here a year ago the wait was 2 hours and I didn't want to w","useful":7,"cool":3},"Hcia2FnlJR_CYfV9qQBtaw":{"text":"Came here, for the first time with some friends. \nThe waitress, was not ver for coming, th","useful":0,"cool":0},"NCn-LCMlxvwt4JyOlgHhdg":{"text":"You can never go wrong with a good happy hour plus it is black owned. Crab claws with a sh","useful":0,"cool":1},"3iYyhs_rGzWs111D3uXVGQ":{"text":"Get the BBQ shrimp!!! So delicious. Great food drinks and service. Music and ambience was ","useful":0,"cool":0},"J3AcKvobXNdFRmG3-Rnmhg":{"text":"The food and drinks were good. Chicken wings could have been hotter (temperature wise), th","useful":0,"cool":0},"0jC1XGuzLmCuhjc_5e-Vbg":{"text":"Food was pretty good. We got the fried chicken with greens and mac n cheese. Wait was an 1","useful":0,"cool":0},"zw7lkbviN_iUs-5VVItrzg":{"text":"I took my second trip to NO this year and I had to hit this place up again. Went for dinne","useful":0,"cool":0},"DvEMyeMlos9i98JwASNdDA":{"text":"Morrow's is the best dining experience I've had in my travels to NOLA thus far. Service wa","useful":8,"cool":4},"IzvwlsDy0yc6VOTy28mObg":{"text":"The food here was delicious.  Charbroiled oysters great and the file gumbo was flavorful. ","useful":0,"cool":0},"SfjgqOyAPigEPGz5s4WvLw":{"text":"Great food however customer service wasn't the best. The restaurant was very pack and I un","useful":1,"cool":1},"LdeOCUyZWNJ7vCK8Hp82Lw":{"text":"This is my favorite restaurant in New Orleans! The food was outstanding and the service wa","useful":0,"cool":0},"GZEgGXRMbFQbAPfjP8gZlQ":{"text":"This place is not at all what I expected. The service is subpar and the food  varies taste","useful":1,"cool":0},"sHS50HE4rSSIPkh495pekA":{"text":"Honestly the food is over rated and not that great. The French fries tastes reheated the c","useful":1,"cool":0},"xFFxeajMSmk78MCRQfmoOA":{"text":"Food was delicious, well seasoned, not salty.  I had the fried chicken with cabbage and co","useful":0,"cool":1},"v3nM1BB87UKqtkte-JpNNQ":{"text":"Fernandez is the ABSOLUTE BEST!!!!  Everything was fantastic!!!  Food was amazing!! Best m","useful":0,"cool":0},"5bHNuXOqx6Jbqs4V-6VzHQ":{"text":"Oh my god ! I cannot believe i ate anywhere else in New Orleans !!! This place was complet","useful":0,"cool":0},"CXGrvTTwRF1WYbWz8bL6VA":{"text":"OMGGGGGGH IMMACULATE! This is my new favorite place in New Orleans, I will always visit wh","useful":1,"cool":0},"riUExj_uFH91Q5SR-rOn2A":{"text":"The only reason why I gave this 4 stars instead of 5 was because of the hostess.  We were ","useful":0,"cool":0},"TwXWy1lO7EaiLDlyhYCssQ":{"text":"Outstanding spot. Good vibe, good food, good ambiance. Devin was server. Handled us well","useful":0,"cool":0},"kZABFJIdsPW29VtgvgijYQ":{"text":"Great restaurant in one of my FAVORITE parts of town. Locally owned and operated, near my ","useful":18,"cool":12},"SBTx3S8RtZT2N2Lf-ui1rw":{"text":"If you're looking to scoot away from the touristy area of New Orleans, Morrow's is definit","useful":2,"cool":1},"a4QyGL5pwguiuKuP9MGrWA":{"text":"Should start offering crawfish and crab legs. Food was decent. Drinks were good. Customer ","useful":0,"cool":0},"6NZY7d6q49zbckbDAM34IA":{"text":"I wanted to give Morrow's 2 stars but the bartender saved the rating.  When I arrived the ","useful":0,"cool":0},"xa0fyU8-dNADd9jpG_jnBg":{"text":"We came in because we had heard about their gumbo. We showed up in time for happy hour, an","useful":0,"cool":1},"hn2W5ic2uKsvPcLUr2LS3w":{"text":"all I have to say is this place IS A VIBEEEE! My friends and I came to celebrate her birth","useful":0,"cool":0},"BJ6Yhqnkl4rC5wAEXbyEvQ":{"text":"Food 10/10\nThe catfish fried whole & smothered okra was by far my favorite, lightly batter","useful":1,"cool":1},"U4ENoDBY0Qt2DGFchScq5A":{"text":"Our wait for a party of 6 went from 1 hr and 30 mins to 3 hours! Why? Great question,  I'm","useful":0,"cool":0},"H9zO26uklwTnukCE1i_oAg":{"text":"I was in the area so I stopped by. I wanted to try the crawfish pasta with catfish it was ","useful":0,"cool":0},"PWni8IMzexRx3jrvAdIS_A":{"text":"First time in NO. Place is so bomb our waiter Delaney was so amazing and so handsome! Go s","useful":0,"cool":0},"aXfszjhrWBRMXwAMXZlYfw":{"text":"I enjoyed my food and the great atmosphere at Morrow's!! Job well done Larry Morrow!!! Eve","useful":0,"cool":0},"-ux33p5VbxB4rsq2pXC_Xw":{"text":"I was in the area so I stopped by. I had a nice time. The food was awesome. The atmosphere","useful":0,"cool":0},"pa7ydoMhuUsChB9nRIF5hg":{"text":"Stopped here during my vacation to New Orleans after seeing this restaurant all over IG. F","useful":1,"cool":0},"np33JJ8W-Gs_81tddfWmew":{"text":"Let's start with the oysters. 4/5\nThey were topped with crab meat which was delicious; we ","useful":0,"cool":0},"xZifpHB5gL7WvWGir58yvg":{"text":"Very disappointed in this place. I heard good things about and finally got to try it. I go","useful":0,"cool":0},"L0jNjVsfeSI-LE8kJP6MUg":{"text":"Okay first let's start by sayinnnngg Yo Bartendaaaa Cory is the coolest and had us feeling","useful":0,"cool":0},"HvzMmpa2e366ZVU1UweizA":{"text":"Loved this place!!! Highly recommend! Great drinks and food! Great upbeat vibe. Good hip h","useful":0,"cool":0},"TN_fIk-kq8C6Dp9FxbtHfg":{"text":"I ordered from this place on my last night in New Orleans and wanted something cajun/ creo","useful":1,"cool":0},"SxWToGM5-WkvyNQi5Zonxg":{"text":"I'm glad they adjusted their hours for the Monday after Essence 10am. We were the 1st ones","useful":1,"cool":0},"JokyEhwpiG0lPdMjK9f6Rw":{"text":"Loved this place!! Sat at the bar as the place was super busy and the bartender was fantas","useful":0,"cool":0},"_N9t5nlX6QN45J3hdmXJug":{"text":"I visited Morrow's during a recent trip to New Orleans. I really enjoyed myself. Our serve","useful":0,"cool":0},"9Yy1bQpmgUoFarGTkOrQNQ":{"text":"So let me start by saying if you are blessed with getting served by Matt you experience he","useful":0,"cool":0},"V5lC65T091HjDPef9nJgjQ":{"text":"I've heard a lot about Morrow's over the past year and decided to check it out during a we","useful":0,"cool":0},"FOfvwIWMVazlRN7mlVr7xQ":{"text":"The gumbo Ramen was easily the best dish i've had all year! it's extremely flavorful, lots","useful":0,"cool":0},"hJpTgE748lPRXhknGLzfBQ":{"text":"On the advice of a friend. We can begin this food journey with the those wonderful char gr","useful":0,"cool":0},"KJyJRtkxsugyZwBzvTE2ag":{"text":"The only reason I took off a star is because the service is soooooooooooooooooo slow omg. ","useful":0,"cool":0},"F47BjILuvqiN3vJbqlgZKw":{"text":"Some of the best food I have ever had! Crawfish bread was to die for! We had barbecued shr","useful":0,"cool":0},"14URWYLrBUfnlivPSlJ9lw":{"text":"Morrow's has been on my must try list for a year so I happily scheduled a family dinner he","useful":0,"cool":3},"KvPmqdCmXW1xndXZU38ktA":{"text":"Amazing..... I had my first of many visits today. The red fish and grits are the best. It ","useful":0,"cool":0},"byiUkSbTACeQL91XRkkWmg":{"text":"Love the atmosphere here, seated & served amazing food timely. The layout is awesome & I'd","useful":1,"cool":0},"vqplOmMuXJRsibHXNgaMoQ":{"text":"When I'm feeling like hanging out at a cool spot, Morrow's never disappoints. It has fun a","useful":0,"cool":1},"yIm-dTJ3XBqyhuofis8x-Q":{"text":"The food taste good, but you have to wait A while, also food wasn't hot, my second time go","useful":1,"cool":0},"Q-A1cgMBsalnMC0SBrWA0w":{"text":"Visited Morrow's for Mardi Gras 2019 with another couple. Best darn food I've had in NOLA!","useful":1,"cool":0},"LBRGL3snwpaYsqZmy0tumA":{"text":"Food was amazing! We had a time frame, and the server helped us out. Seriously five star.","useful":0,"cool":0},"oYtZt2y2BD4u728Xq2kmeQ":{"text":"We arrived at 8:20pm just to be told they are not taking anymore people. Mind you, they cl","useful":1,"cool":0},"z4tUUoYJA2C8cADdwW4lyQ":{"text":"We were in New Orleans for the weekend celebrating a birthday and decided to go to Morrow'","useful":0,"cool":0},"LPQsUlVIE_PS7pmeoYJFCw":{"text":"We just had dinner at Morrow's and really liked it. We sat at the bar and were helped by a","useful":0,"cool":0},"OV9W83_lbvD3_VZZmF1biA":{"text":"We went to Morrow's last night and had an awesome experience! We were first told the wait ","useful":0,"cool":0},"zxXIUnZKRgE54lqKZHGvEA":{"text":"Experience: 5 stars!! Service was excellent, ambiance was great. Good music! \n\nFood: Mostl","useful":2,"cool":1},"I7O9sqsRGiLrN_hCj9qh9Q":{"text":"This place was great. I was in town visiting and a friend recommended it to me. The ambien","useful":1,"cool":0},"2CGvbkfPFR8wkuVSbPCG3w":{"text":"This place was off the hook.  Lead it off with a nice Sazerac, then the waitress Erin made","useful":0,"cool":0},"89tf-Wy7xsRo_mIDse_SSg":{"text":"I almost started crying when I tasted this gumbo. It takes exactly like my grandfather's t","useful":0,"cool":0},"lN3pSsFA69LH_G-VojP9Og":{"text":"My experience at Morrow's was okay. When we arrived which was around 11:30am (they open at","useful":1,"cool":0},"wQd35dwvgOBT5ITmXUvG9g":{"text":"Morrow's is a must if you come to New Orleans. The food is excellent. I recommend the gumb","useful":0,"cool":0},"cYTNDVtEgaioHYN4vdwpmg":{"text":"Best spot I've been to in New Orleans. Waited about 1.5 hrs for a table Essence Fest weeke","useful":0,"cool":0},"rv0A6YanVSxdNwucI1bDIA":{"text":"Oh my God! You have to go here! Miesha (sp?) Was our server & she was the best! \n\nThe food","useful":2,"cool":1},"RCxIkoeLtAbBq4uzNgcmfA":{"text":"First let me start by saying that the food here is amazing. However, I was extremely disap","useful":0,"cool":0},"MpsgP4lxwdT9VYZ_UMxbOg":{"text":"Great place for causal chill. This is my second time eating here and this spot is always o","useful":2,"cool":2},"ieuYEOF_bowuKSn3bf1y9A":{"text":"This spot is bomb. The food was amazing. Lawdt this was the first time I had crawfish brea","useful":0,"cool":0},"O1rq5LlhbayLvo-XGC2L-g":{"text":"Decided to start this review just based on my appetizer which was a half dozen charred oys","useful":3,"cool":2},"crwVUYbA9e89JlcyJgYFFQ":{"text":"Ya'll just go! The food is delicious! During a a visit we visited like three times. Custom","useful":0,"cool":0},"wB5EDWDHPiQfT6wOAdeCCw":{"text":"I ordered red fish it taste like lighter fluid. The worst food you can eat in New Orleans.","useful":0,"cool":0},"8-bQOgGH4Wn96uJArHq2dA":{"text":"Recently visited New Orleans for a birthday celebration weekend. When we landed, we were H","useful":3,"cool":0},"LNn6cMS38UTR9UR7wdZvLg":{"text":"The customer service manager Laurin is the worst i have seen in years. I have never in my ","useful":1,"cool":0},"G4ABSGhhW31AsAJCcolZBQ":{"text":"I'm super later writing this review. We went in early may for a friends birthday. This pla","useful":0,"cool":0},"mRJFyuGPDWkM7YSAV3ieMw":{"text":"This was at the top of my must try NOLA list.  Upon arrival, the neighborhood took us by s","useful":1,"cool":1},"VlwN9g_x7OAfHVyGftQWZQ":{"text":"To get straight to point, I had high expectations based on other reviews and was really di","useful":0,"cool":0},"AeBicsBQZ3FgispJgrE9sQ":{"text":"The Asian wings were pretty good, but the Morrow oysters were dry. I'm accustomed to char-","useful":0,"cool":0},"H_xQ7bKYMjKv11dskjccOQ":{"text":"This was first visit to Morrow. I was disappointed in the service. We had to wait 2 hours ","useful":1,"cool":0},"IK39nTdX9o2FagzNfOgGLQ":{"text":"So when my friend and I came here, I was going in blind off of her recommendation and didn","useful":4,"cool":2},"efd9Ayyro-fP6I5yabHawg":{"text":"Each time i visit New Orleans i will be eating here! Great staff great waitress and waiter","useful":0,"cool":0},"k4uk5ASeL1c2cqMf5uR8mg":{"text":"We came here on a Friday night around 8p. There was a 105 minute wait. It's a fairly small","useful":1,"cool":0},"DZZlzHEGC9q-UV5age17Aw":{"text":"I heard so much about this restaurant so my family decided to try it out for lunch.  The w","useful":0,"cool":0},"fTxvF0tCZH57mRhmUISnpg":{"text":"Morrow's was recommended  by the front desk staff person at my hotel, as a local favorite.","useful":0,"cool":0},"aayGkt_O-rlygIgVPyFHpA":{"text":"We arrived and was greeted by a friendly hostes who seated us immediately. Our waiter was ","useful":0,"cool":0},"0rLt9h8GV9RyVEqFYX-Wvw":{"text":"Delicious food, a wonderful hospitable staff and fun patrons.\n\nThere will be a wait, but i","useful":0,"cool":2},"oZsu37Ek-btIVWotKIQbNA":{"text":"I've heard so many things about Morrows so it was a must that I try. This was my first tim","useful":0,"cool":1},"-JHb6xuEDn1qwS4eiEffSw":{"text":"Our server MATT was awesome! He was extremely transparent with my fiancé and I. He offered","useful":0,"cool":0},"Fu3UG1aCkRoYL7PicBmBAg":{"text":"Being a New Orleans native, I was looking for something traditional and some new to which ","useful":0,"cool":0},"ggIHsOEtHXzdY5-Pny-2Xg":{"text":"So ordering online to pick up was quick and efficient! Even with them being packed my food","useful":0,"cool":0},"-e0LcQOPmjEuA-jDSqzL4g":{"text":"I loved this place. No other words but that every was amazing! The stuffed oysters, crab c","useful":0,"cool":0},"Q0gOKvoazP7gSo1L7Z-rKg":{"text":"Lawd why did I only order a cup of gumbo. Cheese on bread it was delicious. If you order d","useful":0,"cool":1},"KjoZ3hRmMvKLBgRXJUSc-w":{"text":"I've been wanting to try this restaurant for SOOOO long but the wait has always been reall","useful":0,"cool":0},"7m_tJMxTjG4N57f7o3QDig":{"text":"My wife, adult daughter and I were \"denied\" admission to the restaurant Wednesday evening.","useful":2,"cool":0},"PmD3BXYlefGJgkTc9hUQ7Q":{"text":"Nice place.. small on the inside but the flavor of the food and drinks pack a mighty punch","useful":0,"cool":0},"vPKP9TL2l3DuOUwkxLCtVA":{"text":"I ordered the crawfish bread & gumbo.  The gumbo came out lukewarm, the crawfish bread was","useful":0,"cool":0},"Ua54rxtydPXUQz1RqSjNvA":{"text":"Morrow's is hit or miss. I've eaten here 3 times and each time I had a different experienc","useful":0,"cool":0},"OkB8l1K4FXgix3C-jCbvJA":{"text":"I'm a firm believer in waiting to visit new restaurants - I like to give them a chance to ","useful":16,"cool":2},"zyuHTyZgXLZtu9aeoMLtyQ":{"text":"I would say that my experience may be due to being used to the efficient service in the No","useful":0,"cool":0},"_HXx7bk03YdCjWXyLLq7JA":{"text":"Food was amazing ! If you're in New Orleans you have to try this restaurant. Happy hour gr","useful":0,"cool":0},"_Z-pImmLBVTqCxQ-5IBxkw":{"text":"Terrible experience. Horrible service. Long wait time (which was expected). They ran out o","useful":0,"cool":0},"nHd_Np9tMEh6Pq51eOCEbw":{"text":"Decent food of what was actually available, terrible service. I called ahead about three d","useful":3,"cool":0},"hFXBzBTgIvMi11ltmt4KaQ":{"text":"The food is so GOOD! I don't like that you can't make a reservation.  Luckily while we wer","useful":0,"cool":0},"rr5Qb070nSIQz9S7qTMj0Q":{"text":"We chose this place as a meeting place for our 40th reunion. The wait was not long to get ","useful":0,"cool":1},"qk_XegFYP__e7F-_JOELLw":{"text":"Just to give some background, I have attempted to eat at Morrows on 3 separate occasions b","useful":0,"cool":0},"qUO7KNzP0SCscfyKxe4BsQ":{"text":"I'm giving this place a 5 if I could give this good a 6 I would. There is a bit of a wait ","useful":1,"cool":0},"G-zh73ZPKUqD8d8ZI56zCw":{"text":"My husband and I went to Morrow's today for our anniversary lunch, and it was a great expe","useful":0,"cool":0},"EpksJxNgBoFdaEIB8-7Zmw":{"text":"Omg!!!! Before I chose to have brunch at Morrows , I was torn between Morrows and another ","useful":0,"cool":0},"zKjtZjn06AyzKYzK6hRwsQ":{"text":"We arrived at the restaurant an hour before happy hour was over. We did that purposely. \nO","useful":0,"cool":0},"BVxEL2ZWBUhiKIxHobQXgA":{"text":"The food is fye... .. This is the real deal.. authentic NOLA food.. definitely a place to ","useful":0,"cool":0},"3YnuIzXvXXKEqi30GREzaA":{"text":"Hubby and I back again. We visited on Saturday night February 23,2019. We enjoyed our food","useful":0,"cool":0},"Kkar2zbkS8vTv0D7f7q8Ag":{"text":"First off. I walked in and wasn't welcome in. I told the hostess that it would be two of u","useful":0,"cool":0},"s6mk7uCyby-QL8YIijB6tA":{"text":"I don't understand, at ALL the hype behind this place. First time I ever tried to go it wa","useful":1,"cool":1},"el8a4iUHR9FdKn44slpKRw":{"text":"High traffic, loud celebrations for Sunday brunch with free street parking (little constru","useful":0,"cool":0},"49QGqoyQ9yySpKl_1t3UYg":{"text":"Very crowded on the Tuesday night we came in.. I'd say it was about an hour and a half bef","useful":0,"cool":0},"vVTop7444EbQVusGqy3rzg":{"text":"I had the crawfish pasta and it was AMAZING!!!!! I definitely recommend this place. Nice v","useful":1,"cool":0},"w5ryKU2QthLpfrdU8z9jpw":{"text":"Easily the best fried chicken I've ever had! \n\nI was skeptical because I've heard mixed re","useful":14,"cool":7},"HttXVeAXzRjyPDdOb7IFWg":{"text":"I was apprehensive to come here because the reviews were only three stars, initially, howe","useful":3,"cool":2},"8NfqXhMrc9DhGW6MeZJQwQ":{"text":"Delicious food. Great cocktails. Good desserts. Good service (waiters) too. Manager Jennif","useful":0,"cool":0},"oVR0IUJatkZE_MntFRekqw":{"text":"Highly disappointed. Waited 3 hours to be seated and reservations were never honored. On t","useful":0,"cool":0},"yeuYwmUtgT9Hu6dLOoJysA":{"text":"The food is amazing but the customer service was so bad they deserve less than one star. T","useful":0,"cool":0},"YeHO6uN6RRdNQTNCZQyl5A":{"text":"It's an okay restaurant.  I went in with very high expectations, and it really didn't live","useful":0,"cool":0},"gmb9YPG0HxfVRZIUjis6GA":{"text":"Great food and a lively atmosphere. The lettuce wraps were a great appetizer and the fried","useful":0,"cool":0},"VsybY4nBsgSN0ikbAii2CQ":{"text":"PLEASE MAKE a RESERVATION before coming because you may get turned around due to I would l","useful":0,"cool":0},"6bIxMv4HhY_YjajeipMs4Q":{"text":"The place is always packed and now I know why. I ordered the red beans and rice and substi","useful":1,"cool":1},"lccAyZJcp4qlWXpjLuBCFA":{"text":"We had a party of 9 for my birthday. The wait wasn't too bad, good came out fresh, and we ","useful":0,"cool":0},"ZxHj0vuizQL5m8rT83GsEQ":{"text":"Being a little partial because my last name is the same I had to go check it out.  I'm gla","useful":0,"cool":0},"RWVSnUS6AHYCm1q2gmPCnA":{"text":"Love this restaurant and the food was amazing. My mom was having a hard time finding her r","useful":0,"cool":0},"Y0xjh2dwdxRlFV6C8E3Ixw":{"text":"Food never disappoints!!! Chargrilled oysters, pasta lenora and red fish is amazing!!! I l","useful":0,"cool":0},"M3BDW2ptHLXN288VEafE-w":{"text":"Best food I've had in N.O. so far. The Lobster Mac and Cheese is LEGIT! and the chicken an","useful":0,"cool":0},"XC5zvAB0UMEyIg8HxYebOA":{"text":"Wow! I went here twice during my week vacation in New Orleans. Nothing disappointed here. ","useful":1,"cool":0},"AV7opNHc_pRK1mgOd6KFrw":{"text":"Good food, slow, subpar service.\nDined in on Thursday July 1st (group of 5) - great music,","useful":0,"cool":0},"ES-3volmNPo8lHqS6Ua6Iw":{"text":"Best Charbroiled Oysters In NOLA\n\n     I've been to Morrow's two times this summer, once f","useful":4,"cool":0},"v1NA2sAExR3DXSnaPV5b1g":{"text":"Me and my friend went there and it took an hour and a half for our food to come out. I ord","useful":0,"cool":0},"bWDTF2s3kIb915ConX-gGQ":{"text":"We went for Sunday brunch, During my Birthday Trip. ( I ran to New Orleans) . We waited an","useful":1,"cool":0},"UUhvwN5iwQjVh5cy1NKc2Q":{"text":"I wanted to give 0 stars but that is not an option. DO NOT COME HERE, SERIOUSLY! 2hr wait ","useful":4,"cool":0},"-IMfsLtC55gNqJL2gskm8A":{"text":"I had the pleasure of coming to this restaurant during my trip to New Orleans. Morrow's ha","useful":0,"cool":0},"A5pzt9ty-Xe70Wv4V4wQHw":{"text":"I had the fried chicken with a green salad and corn bread. Chicken was well seasoned hot ,","useful":0,"cool":0},"zHCchpph4yf3Kfij0XR0uw":{"text":"This place has the worst waiting times ever. Waited over 140 minutes for a table for 2 whe","useful":0,"cool":0},"wD-DdhDnbj237Ukwn4-3Bw":{"text":"A lovely restaurant with super friendly staff. 2 friends and I decided to pop in Morrow's ","useful":7,"cool":3},"uTineRTyvA3T9GSR3e-elA":{"text":"The best food and customer service! Me and my line sisters were in New Orleans for our reu","useful":0,"cool":0},"D2wEfJHc4U6EhI0Oam881A":{"text":"If you are in New Orleans and you don't check out Morrow's you're doing yourself a disserv","useful":0,"cool":0},"e46KiWYq3dHI2jSRYS1E8A":{"text":"Visiting Monroes for th first time while in New Orleans. First impression from greeter Kia","useful":0,"cool":0},"1Yt0fFCVBFLdpX7hLGPDVQ":{"text":"Party of five seated after about 20-25 minutes. It's the NFL weekend for the Dallas Cowboy","useful":0,"cool":0},"s0J77ELDl1n34_niNnW4Yw":{"text":"Decent food. HORRIBLE SERVICE! We had a party of 7 and the restaurant accommodated us. How","useful":0,"cool":0},"LsrpfGpIp-BlaLiqZ9Ht0w":{"text":"Morrows killed it last night. Saturday during the chewbaccus we managed to get in. They we","useful":1,"cool":0},"mLSnfbVn1XrqAzLbDdKLzw":{"text":"Absolutely delicious. Service was great from\nThe time we gave our name for the waiting lis","useful":1,"cool":0},"MS5hSqhGREVXF7zCcOwDcw":{"text":"The food is really they good here!  This is my type of comfort food!  Sometimes I have the","useful":1,"cool":0},"5jb0kiQslgVxNP35KR62Tg":{"text":"So let me say that the wait was definitely worth it. Went on a Saturday night on Memorial ","useful":0,"cool":0},"lF5XtKNdRwAo1f-QF79deA":{"text":"If I could give zero stars I would. Every time I come to this establishment my food is inc","useful":1,"cool":0},"hRfLJJW2HpM6LB2rMXtFhg":{"text":"Dinner date with my homegirl on a Friday night ! \n\nUpon arriving the wait time was 1 hour,","useful":0,"cool":0},"8x7ks7QdtHhKHcpbRou0gw":{"text":"Good food, service, and atmosphere. I visited for Sunday brunch, and had the shrimp and gr","useful":0,"cool":0},"lArYFubqkXmGNddrhbZbbQ":{"text":"This spot was definitely on my list of restaurants to check out when I go to New Orleans! ","useful":0,"cool":0},"qfGRModENrEA9FZpoLt6AA":{"text":"Seen this new restaurant all over IG. My 1st day in New Orleans I ubered right over to try","useful":0,"cool":0},"mrp3illMeR5g1tb44TyCxg":{"text":"Delicious food! We started with the Jumbo Crab Claws that we're buttery and delicious--lit","useful":0,"cool":0},"Vak0tzjsJQARqPlT4muaMw":{"text":"Really nice ambiance. Nice for family or date night. The bartenders model true epitome of ","useful":0,"cool":0},"A5oeqe_JYugL9teJimqcEw":{"text":"the food was great!! it was recommended by our Uber driver who is a local of New Orleans s","useful":0,"cool":0},"TPM-j-EzJJVGR_Z1b0JqSQ":{"text":"Absolutely amazing meal - great food and great service in a hip spot! Came here on a Tuesd","useful":0,"cool":0},"gw3-MbAmAh6E8J3FXYC66w":{"text":"I was super excited to try Morrow's when I came home to visit, it's currently one of the m","useful":0,"cool":0},"S6U870UENo6jsYAJdYSLYg":{"text":"Great concept. Smells delicious.. waited 2hrs outside after we were told it would be a 30m","useful":0,"cool":0},"WUrTNkFp-5XvMqZ-o4aCNA":{"text":"Food was good! It was a bit overpriced but so it's definitely not a place that you eat and","useful":0,"cool":0},"-nn2V8-Bi8aSD2HJnnJSaw":{"text":"Such a cute restaurant! The waiter was very very nice and the food was amazing. I got the ","useful":0,"cool":0},"nGBnW-jncXxYVn3A_m1O3w":{"text":"This was the absolute worst experience that I've had while traveling to different cities. ","useful":0,"cool":0},"TJk2cxjt0EPGunDY3xsjGQ":{"text":"We just tried Morrow's, and LOVED it! Even on a Monday evening, the restaurant was filled ","useful":0,"cool":0},"xbIA0bV0x5p_WXzuVA5hEw":{"text":"I will literally drive to New Orleans to eat at Morrow's the  food is that dayum good!! We","useful":0,"cool":0},"DhhazqDLYxiN3phxgx3KKw":{"text":"One star until we can actually try them when back in Nola. Visitors, if you are reading th","useful":1,"cool":0},"EukYc-McUEAqQg1RR_suKQ":{"text":"Cannot stress this enough best food I have has since driving down from New Jersey. I have ","useful":0,"cool":0},"BOqTlkdqUkCMJ0cgW7Z_fQ":{"text":"This place is outta this world. Had the gumbo ramen. Hit the spot. Loved the service! It's","useful":0,"cool":0},"0H_1rpWUj9VUViFD3FdYpA":{"text":"Start with the chargrilled oysters. And don't bother with a half dozen, you'll be kicking ","useful":0,"cool":0},"lXF1F7qN4b1ROHvhd19SuA":{"text":"OMG this food is so Awesome. I would eat here everyday! The food is so good I ordered extr","useful":0,"cool":0},"6tBgjpiJitMI3E2RMluCsw":{"text":"I'll start with all of the good. Atmosphere, Food, and Our server. Now, y'all would have g","useful":4,"cool":0},"KHh08VE6JfUnUvHO0GaOkA":{"text":"This was my second time at Morrows, and I'd give 5/5 both times! Our waitress was very nic","useful":1,"cool":0},"cdOAP3mI_3vxryzuIiXgaQ":{"text":"I had really high hopes for Morrow's! However the customer service was horrible (our waite","useful":8,"cool":1},"lm3XnoPtIwd6BrZQTfkmFQ":{"text":"I waited until the hype was over to try this place. Essence Fest had this line wrapped aro","useful":0,"cool":0},"Xpwf_oitiIub22dMpz5PEA":{"text":"This by far is the best restaurant that I visited during my stay in New Orleans. The food ","useful":0,"cool":0},"HqJh2CIHEWg68w32MNrWRQ":{"text":"Unfortunately I will not be back again and will not recommend this place to anyone. I came","useful":0,"cool":0},"TwJt3_bsEg560jMlZw_9Ow":{"text":"This is a creole/ korean inspired restaurant. If you know Lenora's in Ponchatrain Park, we","useful":2,"cool":1},"tRVbjQ6sg8nTAddQuD3wdg":{"text":"This is a nice place to go for southern food. The BEST restaurant GUMBO around town!!! Usu","useful":1,"cool":0},"YF2S0YJSjE4RWxJ4En04qQ":{"text":"This place was recommended to us by our Uber driver, and it was a great suggestion!\n\nIt to","useful":0,"cool":0},"nLqieTD6QVT_hGxUKo0RjQ":{"text":"I was super excited to try Morrow's when I came home to visit, it's currently one of the m","useful":1,"cool":0},"_p8eixjLBpYtq-vtApWgWA":{"text":"Morrow's was definitely on my list of restaurants to try when I visited New Orleans but ha","useful":1,"cool":1},"7Y4-Vo5sq12CbC5K7EOmvw":{"text":"A group of 10 of us were down for a conference and Morrow's was recommended to us.  We arr","useful":0,"cool":0},"WW-X86t2rB62kfIcgd0ufg":{"text":"Warmly welcomed during the rainy day I visited. Nice surroundings and vibe, sounds of laug","useful":4,"cool":4},"S4Q4dcSBfhbXjLU09WFtCQ":{"text":"I went because the restaurant's name was the same  name as my supervisor (Go Morrow Man). ","useful":0,"cool":0},"r5EQ1XGzpgCkYft5IT-e9w":{"text":"Really good. I had the Henny Rita and Oceans Delight. Omg that dish is amazing I recommend","useful":0,"cool":0},"8zZhuvs9OtkTaAbrgxWGUA":{"text":"Excellent Red beans and rice. Probably the best I've had. Chargrilled Oysters were adequat","useful":0,"cool":0},"61vA4oN8aYDD2MOozinidA":{"text":"Dined in for lunch with a group of ten after waiting an hour and a half. Service was super","useful":0,"cool":0},"XybeC_m02ZN5pfSzJwLKqw":{"text":"If you dine at Morrows ask for FERNANDEZ, he was by far the most sincere person working. H","useful":0,"cool":0},"gGRSx95uU1-Ga4u6eKRvaA":{"text":"This past Sunday Brunch was my first time at Morrow's and it was amazing! I was there with","useful":1,"cool":1},"SoJy8c7Ts3mFqs6ny9A8zw":{"text":"This was my first visit and I was disappointed. The service was extremely \nslow and my ent","useful":0,"cool":0},"Il7dH1l8BTl3KkoIaZgLGw":{"text":"Although I experienced a long wait for my meal, I was impressed with my order of scrumptio","useful":0,"cool":0},"cFAW13a0ri_xV87Qu0nRdg":{"text":"So after spending my day in a conference, I decided I needed a real meal and not just blan","useful":2,"cool":0},"0yh6O4IezKTYafnAOoxQNQ":{"text":"Absolutely the worst service. First of all we called for 30 mins no answerr!!  Then we try","useful":0,"cool":0},"cbonPUJTjNy1eu1vU6xyBQ":{"text":"BBQ Shrimp was amazing and surprisingly so was the fried chicken. I loved energy of the pl","useful":0,"cool":0},"W4d-7fCYBUt_culzU0olYg":{"text":"By far my favorite restaurant in NOLA. The staff was as very friendly, our server Delaney ","useful":0,"cool":0},"j4qTxLTkLo3HVav26JoZIg":{"text":"Morrow's is my favorite place to take family and friends who are visiting me. Every person","useful":1,"cool":1},"OvGN8mwFflGYxewOOO78Ng":{"text":"This was a pretty bad experience. The wait was long, which is expected as it is Memorial D","useful":0,"cool":0},"VsKt7LxM2-iys8ikHnQHDA":{"text":"Don't bother if there are 3+ persons in your group. Most seating is for 2 people. \n\nMy par","useful":0,"cool":0},"eN7sybxbXmjCBP2mb10Ozg":{"text":"Omg!!!! We're from Houston and found this place on Instagram. The reviews are AMAZING and ","useful":0,"cool":0},"qwzB0lgAcjCMgFkdaRDKyQ":{"text":"Quick Meetings, Creating Memories, Celebrating Moments...I Go To Morrow's! Yep, this trend","useful":1,"cool":0},"eCg9sMg4WrqtFGHEcAIUtw":{"text":"The catfish pasta was really good. The fish was very crispy just like I like it. Would rec","useful":0,"cool":0},"DsP9RBcyxqchQsAJ5De0MQ":{"text":"It's a long waiting list to get in!! R waiter was young couldn't remember what we order! T","useful":0,"cool":0},"wWF2vKDnmomTdjs-xMRNPQ":{"text":"August 2019- I came here solo on my last night in NOLA and sat at the bar. The bartender w","useful":1,"cool":1},"g9F5PMmpDFLYI0d8JkUjpw":{"text":"I really liked the vibe in this place. Its definitely a place for POC, especially millenni","useful":7,"cool":6},"b5Q9yiH9BqHFvIZxA1dEDA":{"text":"The best restaurant in New Orleans hands down... Everything was perfect from beginning to ","useful":0,"cool":0},"LDWD9mV433GVbeR6N4HzPA":{"text":"Goooooood vibe \nGoooooood food\nSouthern hospitality is always the best \nDrinks were strong","useful":0,"cool":0},"ln4ce8_ugl8UiryVlpgqYw":{"text":"It is a stretch to call this Cajun/Korean fusion. About 80% of the menu is Cajun/American ","useful":0,"cool":0},"NUwIkYoQPt4WGXkn5KTW-A":{"text":"Everything was perfect from start to finish!!!  . Food was amazing and the service from th","useful":0,"cool":0},"3LpGHdjZskUfq_RXkf2RlQ":{"text":"We absolutely lucked out in finding this place and then scoring seats right away.\n\nWe were","useful":0,"cool":0},"z-7mySrXU2JfHEBvxs1ByQ":{"text":"Yo this place was amazing. The crawfish bread is on hit. The redfish was also on hit. My h","useful":0,"cool":0},"lBn5RPw7M_TWaurTnYiYTQ":{"text":"Service was slow on a early Monday afternoon... chicken was raw in the inside.. fried shri","useful":1,"cool":0},"3c5KNSpYQ8SpNypJBF9_Dg":{"text":"I would not recommend going here on a Sunday if you don't have 4-5 hours to wait for a tab","useful":0,"cool":0},"3AcVqmgJUUwFvybuWBgrMA":{"text":"I was so looking forward to eat here and planned my birthday weekend specifically for this","useful":4,"cool":0},"V9yNGYcPCwbBv5vnme0wAg":{"text":"Awesome food. Great atmosphere. Wait time was approximately 45 minutes before the food cam","useful":2,"cool":2},"oazylvr004PsD96AFPmdTw":{"text":"What can you say about a place that is fun, with great food and Areena, our hostess.  This","useful":0,"cool":0},"naSueX5GyIGj8vYzF9PKTQ":{"text":"Let me start by saying the number of stars does NOT reflect how great the food was, nor ho","useful":15,"cool":2},"lwGAuYd-WEkwA7gciH-BdQ":{"text":"Morrows is just a VIBE!! Anytime you can listen to good music have cocktails and great foo","useful":0,"cool":0},"7OXupcHMTT4OT0fksUCUYg":{"text":"Morrow's is an experience. It's very hip and you will have to wait anywhere from 30 to 90 ","useful":0,"cool":0},"ErX_CCZIULwS42eAcJqVpQ":{"text":"Worst Establishment ever. Their customer service is terrible. They have you wait 1 1/2 hou","useful":0,"cool":0},"VHzqCYJQ4t6MxEmZi8-xNg":{"text":"We ordered Togo and the lady who spoke on the phone was very abrasive and did not make us ","useful":2,"cool":0},"tg8RF-Ed_uRPI8p6K6Pzig":{"text":"1st time at Morrows! I thoroughly enjoyed my Cajun Crawfish Pasta and Sautéed Crab Claws, ","useful":1,"cool":0},"IvK8Swh56F80R3Nu2-CizA":{"text":"I went on a Monday afternoon around lunch time, so it wasn't as busy. The atmosphere was w","useful":0,"cool":0},"P2WuIL-O2nT9pbgDAX9IJg":{"text":"They charged gratuity for 2. Not sure why this happened and was disappointed by this. It w","useful":0,"cool":0},"WhBFCN9O-CGG-COwwwpEKA":{"text":"Went to Morrow's for a drink with some friends on last Saturday. Upon arrival, there weren","useful":1,"cool":2},"ovAwMqZAbZZ-6Q_fjJUr3w":{"text":"Fried chicken was bomb! Mac&cheese was delicious & that peach cobbler was the best! Servic","useful":0,"cool":0},"_ziaqxFhakxgZpMZ7BXDnw":{"text":"Today was my first visit to Morrow's.  I only wish I had more of an appetite!  We shared 2","useful":0,"cool":0},"PGdKFqW5Evj22RQRAzDz8g":{"text":"The food here rocks, but they fail to get the food out in a timely manner. They also don't","useful":5,"cool":1},"C0t7XNaXTxQCPNfnQ0IoaA":{"text":"Came for lunch and had an outstanding meal.  Had the bowl as well as the fried chicken and","useful":0,"cool":0},"bK5dsD-9hdOQVjdYkpksYQ":{"text":"I'm glad the food was good because we waited a very long time to get seated. The place is ","useful":0,"cool":0},"UR915dPcDye9ov6Da8kTdA":{"text":"Morrows has been amazing every time I have eaten there. 10 stars every time. I always get ","useful":0,"cool":0},"1vkWSLUB8RGSLxqt_PuExQ":{"text":"I spend about $200 here last night in a to-go order. I ordered plenty of meals for my enti","useful":1,"cool":0},"f46p2tA7riKCFJ8wsWx7sw":{"text":"I'm going to start off by saying this, I was warned before going here,however I like to ju","useful":4,"cool":2},"J-ZOLbs4n3Ad901UzL0ohg":{"text":"If I could give 0 stars I would! How do you give the table of customers who have been wait","useful":1,"cool":0},"dZ6DS94N9HXLM-f1BeqWfQ":{"text":"Morrow's is a great place to eat at! The charbroiled oysters were delicious! Most of all t","useful":1,"cool":0},"KKeieoj_EF_4dJBMADbWpw":{"text":"This place has been on my bucket list and I'm glad I finally decided to go. First and fore","useful":1,"cool":0},"ntmRm8J55gv79gbJs1RFOA":{"text":"Morrow's is a very popular spot in New Orleans which we are able to concluded by the numer","useful":1,"cool":0},"l3iaoNLL-xN5Om-EiSL4rg":{"text":"Our last night in New Orleans and we decided to patronage Morrow's based on recommendation","useful":9,"cool":0},"3h2Ra--jT87ekjYXhYqIUQ":{"text":"Morrows has some of the tastiest BBQ shrimp around! It's often packed so if you're looking","useful":0,"cool":0},"SKxkvFqX0XpDrqHb62PPfQ":{"text":"This was amazing! We waited 1 hour and 45 minutes with no regrets. Great vibes! I was with","useful":0,"cool":0},"tkvAubp1ZLfxZ2aczZ-UFw":{"text":"I was visiting from California and a friend told me I had to try this place. I had a fanta","useful":2,"cool":2},"Bi9jMwfEWiR3UETV-E4wDA":{"text":"I had the cajun crawfish pasta which was delicious. Highly recommend. Had the charbroiled ","useful":0,"cool":0},"h8r51yGPOYTtyK0G0jaFzQ":{"text":"I was excited when I saw Morrow's, a black-owned restaurant, pop up in the neighborhood I ","useful":11,"cool":10},"S6QoOcS69EzEw8zGX5a9cg":{"text":"For starters This is a black owned restaurant and i look to support them any time I can. T","useful":0,"cool":0},"Emkf2Qn2icvGxTvf--GQkw":{"text":"I loved the atmosphere here! Good music and an adorable inside. I had the turkey club and ","useful":0,"cool":0},"qjV6aJXq6xMEOzA9maqnHA":{"text":"This is a cool spot with REALLY REALLY good Shrimp and Grits but they have to get a \"reser","useful":0,"cool":0},"HyxvUduHdqaNhjCNkY-fEw":{"text":"Best food and drinks I've had during my entire stay in NOLA. Could not recommend highly en","useful":0,"cool":0},"jZN_LcBDlOdYJfii9YaqtQ":{"text":"I was in NOLA for 9 days, this was the best place I was! I'm sure the locals would hate th","useful":0,"cool":0},"Z9nuDznmSTtwd9weSImhRQ":{"text":"We decided to do a couples dinner for Valentine's weekend. They do not have reservations s","useful":2,"cool":1},"DG2-buv_PqdvasBwee6-zQ":{"text":"The atmosphere is great along with the food. We had a wait to be seated but it was worth i","useful":0,"cool":0},"ntRmcxC3jCevRQR8IbOynQ":{"text":"It was everything and then some! Don't judge me on the fact that I had went to brunch befo","useful":0,"cool":1},"q7cbcobaddTDklHW3xJEWw":{"text":"Yall! I left out of Morrows fat full!!!!! If you want to listen to good music, eat good, a","useful":0,"cool":0},"X5DC4ZI8OYkcQiSEym9R2g":{"text":"Chargrilled oysters are good but the wait is crazy. My order was just sitting at the bar g","useful":0,"cool":0},"pSiwzelDb7R4pNkYvOv4jw":{"text":"I saw a lot of mixed reviews on this place but I wanted to get my own opinion. Most of the","useful":4,"cool":2},"0Wh0asnKYt-fklfn5Ol3MQ":{"text":"I'm surprised I am just writing a review right now. I have been a long time fan of Morrow'","useful":1,"cool":1},"ZYtBCwS_VWkoET4LsWbtiA":{"text":"Customer service is wonderful. Definitely a vibe for brunch. Drinks are amazing. Food is t","useful":0,"cool":0},"b2Ur51ypnivotK2EcRtMkg":{"text":"The food is amazing! It's just divine! I do recommend going early to beat the crowd. The s","useful":0,"cool":0},"01IR_EmRSSUZiuueEHFMig":{"text":"Came here during the week at about 9pm. It was crowded with birthdays when we first arrive","useful":2,"cool":0},"PWK5Xoi6VLS9NdoZOjZqBA":{"text":"Had to picture my half eaten plate because I could not wait to try the food. The mashed po","useful":1,"cool":0},"Y13X8tUqTwJ6Tf-hT1QbOA":{"text":"Morrow's was the first place my friends and I tried  after getting into town, and the food","useful":0,"cool":0},"o5U8WK-gzaLaDCqQ8aWFGw":{"text":"The food was very average: fried chicken was fine, but the seafood pasta was drenched in s","useful":0,"cool":0},"rQkBz3ERP1lSsZkW_bZcZA":{"text":"My friends and I took a girls trip to New Orleans from Atlanta and we ate at Morrow's and ","useful":0,"cool":0},"2JK1TQL0Kc7Iz1Ot84QQGA":{"text":"The atmosphere and ambiance was great, and it's black owned! I got the crawfish bread as a","useful":0,"cool":0},"t0N1S43Yif2h4GS4nzqqjA":{"text":"The food was bomb! I really loved the Cajun seafood pasta and the wings. There was a nice ","useful":0,"cool":0},"JxBfsot2820oyuhUywhKeA":{"text":"This place has some amazing food! Drinks and customer service was awesome. The only compla","useful":0,"cool":0},"nbBROTnOUN0zzZ5Fnzrv6g":{"text":"Came here on a random Tuesday night and it was packed with good energy and great vibes! Th","useful":0,"cool":0},"SRzloex8XkvrN0fozgY7MQ":{"text":"We had an amazing time here. Everything we ordered was delicious. We had the BBQ Shrimp, C","useful":0,"cool":0},"GfXw9D7uK2AmZ_VKdA5zpQ":{"text":"Very good flavorful food. As an appetizer I had the crab claws which comes ready to eat no","useful":1,"cool":1},"PER77uudhEVPd1PbQDdU7g":{"text":"Great food and vibe! It's definitely a place to visit if you are ever in NOLA but be prepa","useful":0,"cool":0},"x32AE3S5ZH4MMlSMvMYi_A":{"text":"This is one of my LOCAL FAVORITES!!! They have an awesome selection of southern cuisine wi","useful":0,"cool":1},"RVmNUf5hblkqSoHZXlBSfA":{"text":"The restaurant is the worst! If you friends with staff, you can get in quick fast and a hu","useful":1,"cool":0},"ufrXKU-eZaoQgt12GoD10A":{"text":"Other than them messing up our order, the food was amazing! I had the catfish poboy & the ","useful":0,"cool":0},"-JRvK-cZ9fSuDqja7bdwgQ":{"text":"Waited for 1 hour to get seated which was fine because I was bloated from my coffee, I dec","useful":2,"cool":0},"hCnl_L2V8l1AYD5BYOkxWw":{"text":"My daughter suggested this place for lunch, we had (very small but tasty)chargrilled oyste","useful":0,"cool":0},"dYpyeUeT9uD2JOS2AKlgwQ":{"text":"PLEASE MAKE a RESERVATION . Morrows wasnt that great to me The Gumbo Ramen was great.  It ","useful":1,"cool":0},"6Kp3FfJ0NoKrXyTLQkRsbA":{"text":"If a restaurant has hype around it I tend to not listen to it, good or bad. I need to see ","useful":0,"cool":0},"HJsUgRo2rPyHMU527Csiow":{"text":"Amazing food, service was trash. I probably would've rated it lower if it wasn't for how g","useful":1,"cool":0},"VlJK3-Cpz-ajCGBF7z5qIw":{"text":"My dad and I came here while we were in New Orleans. The crawfish bread was delicioussss a","useful":0,"cool":0},"73DLtfyLdqw3pijmow2Ktw":{"text":"Loved this neighborhood spot. Vibe, drinks and apps were on point. Uber ride: under $10. B","useful":2,"cool":3},"GBLYxyThG6IVFERe6xfPbQ":{"text":"I've managed to catch Morrow's on a day where the wait wasn't 3-4 hrs and the employees we","useful":1,"cool":0},"l4U_qJD7L0WC90cdExF6uw":{"text":"First time to visit New Orleans and after lots of research my first stop was lunch at Morr","useful":0,"cool":0},"gQ9RD6-PE6xZOAoCgPpe_A":{"text":"Fantastic seafood and great environment! \"Just Watch\" seafood platter really does feed 2-3","useful":0,"cool":0},"L4gzNLbsxSm8k5_zcVne0g":{"text":"My best friend and I came here for lunch and it was such a pleasant vibe! Food was delish ","useful":0,"cool":0},"bHG1DkQ70SxD8juMLSpBhw":{"text":"This place is a must!!! The food is beyond amazing and the service is great as well. Every","useful":0,"cool":0},"IoTZVaPFWy_YIJdnXtdRjg":{"text":"Saw a line of people waiting to eat here all week and just knew it was gna rock my taste b","useful":1,"cool":0},"i2jHziFiyuq012czBXVmtg":{"text":"Food was great (pasta and bread pudding) and def worth the wait.  Our waitress was nice an","useful":0,"cool":0},"erEjzBDcsn41aPNIdwnDiA":{"text":"Another black owned business in Nola with good food and customer service.  To drink, I got","useful":4,"cool":0},"9eqEvZo0DTsyEJSicR4ekQ":{"text":"It's a Thursday night and not only was there a 90-minute wait, but no sense of urgency fro","useful":2,"cool":1},"8KKZHX4BI1Xr-uTphulF5g":{"text":"Hunny ... let's start with the wait time to get a table. There was a 45 min wait which my ","useful":0,"cool":0},"1N4VAXsXLC_MwRccBGazFQ":{"text":"Morrow's is absolutely FABULOUS.  The food is phenomenal. I'm so hooked, I went 2 days in ","useful":0,"cool":0},"qF2tbMRnx7zW3QqTf-NQOQ":{"text":"Updating my review 3 years later! My niece and I dined at Morrow's. This was her first tim","useful":10,"cool":5},"DqyUPXKqUZJq0i7rwEphkw":{"text":"The bartender is Amazing. The host was very informed about an hm our wait.\n\nWe were sat an","useful":0,"cool":0},"zKSo_upOQ3mOjjcKjCJzaQ":{"text":"Great food! Timely service! Very polite and great vibes! Everything was delicious! The sal","useful":0,"cool":0},"BUbBE9IlqnSKb5U8XTkh_A":{"text":"5 starts is an understatement. The charbroiled oysters alone got me falling in love. I fel","useful":0,"cool":0},"KCu2jZ0a0Zsi9sCO3gJfKQ":{"text":"Have to give Leia the bartender a shout out!! Been here more than once during the lunch ho","useful":0,"cool":0},"qM1-u5ZreEfB_hk06PiJ0w":{"text":"Ok, showed up at 8  pm and told it was an hour wait. We waited until 9:15 and were told we","useful":1,"cool":0},"t5LqCjH_KFxEqFKsaZGvqg":{"text":"Charbroiled oysters. Life changing! Morrow's is more of a local spot and my family is loca","useful":1,"cool":2},"68U_ylmbByLwLgma4sncHg":{"text":"Called to see if I can placed an order and a lady picked up said they don't take phone ord","useful":1,"cool":0},"2Sx6DrEZA_inGrNPSN6YYQ":{"text":"The wait time was astronomical. I am from atlanta and saw this place and wanted to try it.","useful":0,"cool":0},"4KKm3NrCXrzoGAFZ1pujFw":{"text":"My girls and I sat down and ordered EVERYTHING on the happy hour menu and then doubled bac","useful":1,"cool":1},"HilpIYtE0KD9hXyMs8BTwQ":{"text":"Came here with family for the first time. Our waiter did a great job in filling our drinks","useful":2,"cool":0},"byBH21bDa-H1Q_-n0-KZaw":{"text":"I love, love, love Morrow's.  Every time I come here, I am absolutely never disappointed. ","useful":0,"cool":0},"IW4AUF_7WwWq9yk7CQuyIw":{"text":"There have been several times when I had great customer service experiences, but this plac","useful":0,"cool":0},"O96HKr4QFNeet1YfYI2RFg":{"text":"Best brunch I've had in a while! I honestly don't have a single complaint. The restaurant ","useful":3,"cool":1},"O0V9FOd9455s0N4n3Y_nxQ":{"text":"This was the best meal during my recent visit to NOLA to celebrate my birthday.... absolut","useful":0,"cool":0},"rw9V5GkWwAWj3bqU8PSGHA":{"text":"Loved my experience at Marrows! Me and my friend came here for her birthday. It was a hour","useful":1,"cool":0},"6lqcGeVxXSYll8KTSBkKnw":{"text":"Imani was our server and took great care of us. She gave us a great recommendations & was ","useful":0,"cool":0},"zaIDf-LEi5DgktCQ0cEFkw":{"text":"A friend and I stopped in for Brunch on Father's Day. The wait was looking  (which was to ","useful":2,"cool":0},"LQ64IpR0dUW5o3KqsMklig":{"text":"This spot was AMAZING!!! Matt showed me and my best friend so much love! We were there for","useful":0,"cool":0},"a6oboO2XnSX8ohVEtEYsWg":{"text":"I cannot say enough about this restaurant!!!  The service was amazing.  My table of three ","useful":2,"cool":0},"49iZzgGQUzUJmyEHnT7bCQ":{"text":"HORRIBLE!!!! My family and I waited two hours, outside in the Louisiana sun, just to find ","useful":1,"cool":0},"xnuU2BIzQ9mJVIu7TNE6rA":{"text":"Food: 4/5\nService: 2/5\n\nWe ordered the red fish acadiana with corn bread and the crawfish ","useful":0,"cool":0},"cmGWUwOEHJg2HWaTlNsLWw":{"text":"Had a great experience here! Food and Drinks were So good. Best chicken wings I've had in ","useful":0,"cool":0},"F0BWW56V53kBWvRsMAXIrA":{"text":"Nice spot! Food was amazing! Not everyone was wearing their mask properly so that def need","useful":0,"cool":0},"mrxXvO2PDZfw5jXpa3esfA":{"text":"Went for the first time today with my son and Fiancé after work and school. Initially they","useful":0,"cool":0},"vhc5KdE73lKumon8Y7AneQ":{"text":"Loved it! The atmosphere, the bomb food, everything. The wait was long and it was packed b","useful":0,"cool":0},"xHCTPm0losYDDtiqLAKdNQ":{"text":"The food is always amazing. Of course I had to get the charbroiled oysters Morrow. Grilled","useful":1,"cool":1},"-NgxQO8OnmOmHv4mvsySqQ":{"text":"The wait is long but it is worth it! So I was told that if we came here between 5-6 that i","useful":6,"cool":4},"5YuREY2AuM7MldgPV7pE1A":{"text":"Excellent gumbo, redfish Yeah and fried chicken and French fries. The service was excellen","useful":0,"cool":0},"z5Y9wcE7uWgWpqW7wui9Og":{"text":"Located on a corner- Morrow's motto is where good food meets dope vibes and I have to agre","useful":1,"cool":1},"wRglGDOr3QuFD99lfr8FYA":{"text":"I will not be returning to Morrows. The last two times I tried to dine with them I have ex","useful":0,"cool":0},"4bZ3HqoKiQp94wL7SWt_pw":{"text":"Great place for food and drinks, it is a nice and classy atmosphere for adults. The food i","useful":0,"cool":0},"NION7ULoDmM5nhufDaxbjA":{"text":"This place has the worst costumer service idk why they have workers they don't work! They ","useful":0,"cool":0},"2jmrUzz9ZhrWng8Sf9rPiQ":{"text":"I just love southern hospitality. I landed today and not disappointed one bit with NOLA. T","useful":1,"cool":1},"jD5TNIkOLu3Cb8AciUTSZQ":{"text":"Stopped by here the other day with my boyfriend. We started off with the extremely delicio","useful":2,"cool":1},"1h17ckCHfYPmRBkyJ3_gWw":{"text":"Love this place!!! The food, drinks, vibe and service was nothing short of Awesome!! I had","useful":0,"cool":0},"JpfLqSPMZPt2vAUShI4O8A":{"text":"We went to Morrows for brunch after hearing great things and noticing lines out the door. ","useful":0,"cool":0},"PzdMBbXhiZ-oYeiASD8p-g":{"text":"Honestly one of the worst dining experiences I've ever had. The waitress after taking our ","useful":1,"cool":0},"fD_-gS46dOX99_t3d7c20w":{"text":"This may be the best place in New Orleans. They play fire music. The food is incredible. S","useful":0,"cool":0},"WwbROlDELgbUgBXWA7GQJw":{"text":"My first visit here was an amazing experience! Great ambiance, great food, great service! ","useful":0,"cool":0},"m2ci_WBHOPaPOTlIB3xCKQ":{"text":"Visiting from Houston and had to check out this black owned restaurant! We went on Monday ","useful":0,"cool":0},"vKVaqaMpUcfa1X-4bS76hA":{"text":"Loved the crawfish bread and the Sesame Ginger Wings were amazing! Shrimp Platter was very","useful":0,"cool":0},"apoOqOkeq_l3vC_Kk-Ua8Q":{"text":"Go go go!  This place was great.  From the service to the food they were great! I had the ","useful":2,"cool":0},"8sWLYwLgDwNIIeOLVAI1mw":{"text":"Love this place ! Great atmosphere good food and nice music ! I'll definitely visit again ","useful":0,"cool":0},"46O9ZBGpKPYBJIk8q5M73g":{"text":"This place was recommended by a lot of friends. I ordered the catfish with a side of Mac a","useful":1,"cool":0},"cn0BQoieESOUy_qPL0pFDQ":{"text":"I had a spectacular experience at Morrow's. My gf and I started off with a few drinks, the","useful":1,"cool":0},"nn8X1oRmf9BYKBmUjyKHtw":{"text":"First the good. The food is amazing. There were 4 of us for dinner. We had the Oysters Mor","useful":0,"cool":0},"UJ6g4sV7BaOOcFqZAJVYRA":{"text":"When I tell you this is the best food I've ever had in New Orleans I mean it!!!! Excellent","useful":0,"cool":0},"GRic9zvCJAdqPztECf8wpA":{"text":"This place is great. It's realllly busy, and I understand why. Food is delicious, service ","useful":0,"cool":1},"do6StHSqCL8hJOCz9_I16g":{"text":"I rarely give five stars to a restaurant. I am selfish and want to keep those nice restaur","useful":3,"cool":0},"KXTp4Yf3xZPJ-EunrVdyBg":{"text":"This is a very much geared towards the \"black community \" don't expect to get good service","useful":0,"cool":0},"p4zllbJs6Hw2YKKvkae3wQ":{"text":"My friends who LIVE less than 300 yards away were very keen so took me along to Morrow's t","useful":4,"cool":1},"iEJJkpqeI30FRQ1veFIGBw":{"text":"Only place I actually eat all my food!!!! The chargrilled oysters IMO are better than Acme","useful":0,"cool":0},"cn8re9CVzm_83oB5np21yQ":{"text":"The wait was excruciating, but the vibe, service, and food were worth it!  It would be nic","useful":0,"cool":0},"iGHrY7QkwUOwprcOsB5yrw":{"text":"Everything was booked by where we were. My husband found this jem on Uber eats. The food w","useful":0,"cool":0},"Ejjtruz8fkhFK3_Obqhl9A":{"text":"Tried Morrow's for lunch today, the food was pretty good, but the service definitely needs","useful":3,"cool":1},"reYb7nszLKK9LrsS3zZKww":{"text":"Went to New Orleans for the first time for my birthday in 2018 and this is by far the best","useful":0,"cool":1},"26QmGdtdAT40u0-CPem43A":{"text":"Great food and atmosphere!!!! Our waiter was amazing and very friendly. The drinks are goo","useful":0,"cool":0},"3udnbH4-_Lwz4diricpscg":{"text":"The grilled salmon is incredible. It's soo good. Juicy With that perfect char. I crave it ","useful":0,"cool":0},"3d2Fr1VBR48mUNpRf2UKig":{"text":"Tourist trap. I have been here multiple times because I LOVE the Oysters Morrow (which the","useful":0,"cool":0},"oxK2NPa8OdbXLQXrJkBYtQ":{"text":"I have decided morrows is my go to spot in Nola now. Morrows is more consistent with tasty","useful":0,"cool":0},"ydhNTUiGJ7eqLl9u2r5hnQ":{"text":"Came here Sunday around 11am. Not too crowded but they already had two big parties sitting","useful":0,"cool":0},"kVQt7oO7OEXDYMCXq4wZ9Q":{"text":"Wowwwwww!! I can def see why this place attracts celebrities! The place was packed, but se","useful":0,"cool":1},"8CTIf_oA18Eaca5gLyGXUA":{"text":"Last weekend I was craving some pasta, but I had a few meetings later in the day so I deci","useful":2,"cool":0},"gpoD7e8x8RozsJbvWnD4YQ":{"text":"DO. NOT. PATRONIZE. THIS. PLACE. My friends and I (4 total) got to Morrow's at 11:45 today","useful":1,"cool":0},"YOqU3PUNnBJGl1jSz1XiZg":{"text":"Morrow's was my favorite place to eat in NOLA.  This place is sexy. The lighting, the food","useful":3,"cool":2},"tEd2Ozg0iIQm-ZlvKbvwNA":{"text":"Stuffed mushroom App are Amazing. They were packed with crab meat and seasoned perfectly. ","useful":1,"cool":0},"Di2YyAj-fkRk0TH2LekPJw":{"text":"Everything was amazing. The atmosphere is very inviting with a modern feel. The barbecue s","useful":0,"cool":0},"9k2qtdlkRvW7OIMmzqooJw":{"text":"Hi! \nMorrows always hits the spot. It's one of the most popular black owned restaurants in","useful":0,"cool":0},"rwEKi6d1iKmkGd6O83OG4Q":{"text":"I took my 80 year old grandmother to New Orleans for the first time in her life.  It was a","useful":0,"cool":0},"ld8SM1wenFggzY3fItd0yg":{"text":"100% recommend!!!! Food was fantastic! Redfish seasoned to perfection and the grits were s","useful":0,"cool":0},"d6YJ36FyRXAjwd90TDNJVw":{"text":"I  love Morrow's.  The food is amazing and I will return again and again.  Other reviewers","useful":0,"cool":0},"53UOtVEwqv5aFOlT_LCGjw":{"text":"I went with some friends out of town and had an \"ok\" experience. It's a very nice restaura","useful":9,"cool":3},"UQpH3GvtdMSsUuZkXCpjow":{"text":"I've heard so many good comments about Morrow's that the first place I thought to suggest ","useful":3,"cool":0},"J9hDnaA1jL3eKT-udYPKew":{"text":"Great food!! Great service!! I Had the seafood platter and everything was fresh!! I'll def","useful":0,"cool":0},"g4kexRNDB-i_9PawFIyjDQ":{"text":"Morrow's has great food and drinks. Although the reason for my 3 stars rather than 5 stars","useful":0,"cool":0},"VyD7AYX7EIf0EqSLrTAAmA":{"text":"Horrible service. Got seated at a table after 20 minutes and it was open all this time. Th","useful":0,"cool":0},"5bD_M2ov2rC6yAoend2MBA":{"text":"Wouldn't eat here if it were the only thing left in Louisiana. The service was horrible ou","useful":0,"cool":0},"37FHz2uTcCqJ7_J06YhSXA":{"text":"Visiting NOLA, This restaurant was highly recommended on FB and by a law clerk in the civi","useful":0,"cool":0},"ovZJW_1LGat4z94lzNJiNw":{"text":"I haven't been here since the pandemic. We had gumbo, crawfish bread and three redfish pla","useful":0,"cool":0},"Lo5TmGV181tfznyA9osYXw":{"text":"My husband had the redfish and I had the salmon, Ohmygosh! So delicious  the service is to","useful":0,"cool":0},"rr89gy-P1lLKuRl3tpcskQ":{"text":"... I'm from Korea and their food is legit!!!! All the menus we ordered were SO GOOD. Tota","useful":0,"cool":0},"dMfN7m-JG0KEVT-2n9K6iw":{"text":"Salty, salty, salty. The trip to Morrow's was on the plan for my children and their friend","useful":0,"cool":0},"Ou6uRb1hyykeP4Xuyj-T_g":{"text":"I strongly recommend this place, if you're looking for a great tasting place in Nola. Ever","useful":0,"cool":0},"fiTgqZg3QdQ-Sz2OCMv_Lw":{"text":"I'm so disappointed in the lack of efficient service I received at Marrows. Deciding to di","useful":1,"cool":0},"131oQHdNLwMdBM51H0NWIA":{"text":"I have a few suggestions for Morrow's as a small business from a patron that had an extrem","useful":0,"cool":0},"62fCfAlAcJH_jKU0Ag6NBQ":{"text":"The food was delicious! We ordered the Ginger wings as an appetizer and ate them so fast w","useful":1,"cool":1},"a28VQXpwhSVvNxwx2cmvfg":{"text":"Let's start by saying I've heard some good reviews from a few folks... I had the chargrill","useful":0,"cool":0},"OJKPngGRvY0c6nH9FANnFA":{"text":"The ambiance is great and the staff was even better. I had the redfish and grits which was","useful":0,"cool":0},"GDtxtIBxvXsuk1dI67P2ng":{"text":"I see all of these other 5 star reviews but what had happened was... \n\nI made the mistake ","useful":9,"cool":0},"HnJJVtzoOlxU06F8hGfwVA":{"text":"First off, my girl Lourin held it down THE whole time. We walked in with no reservation,  ","useful":0,"cool":0},"Wkij90Cg60T5WhjP9m9E6A":{"text":"This was my first time here and the food was amazing! Black owned! The music was lit, it w","useful":1,"cool":0},"0JafI3KE81OyE1lBEBybRg":{"text":"Went for Sunday brunch. It was very busy. Sat down at 1:30 food didn't come until 3. Servi","useful":0,"cool":0},"S8GJ_Cc3LYd7vLEgPreseQ":{"text":"This food is absolutely delicious. Morrow's is one of the best spots to check out if you'r","useful":2,"cool":1},"cS9dFkTkex45FY0OFFgT7g":{"text":"Thank you so much pj him and the bartender are my new besties Larry u pick the right peopl","useful":0,"cool":0},"6UMYXL_737pbVAr2P_hXeg":{"text":"Great service, amazing food! I was about to give them a 4 because their drink menu is limi","useful":0,"cool":0},"ydJbrcda3Y1D8DSqW9UhtQ":{"text":"Food was decent, service was horrible.  Full staff & Drinks took forever, appetizers   for","useful":2,"cool":0},"W0hgQfa5dEez_wF7XexUhQ":{"text":"Oh this was good. We drink. We eat. Oh my the service was just the best every.","useful":0,"cool":0},"OL9Ji9X7MXvwNtBIhjknrA":{"text":"So.. I got there at 730 right; a casual dinner time. Tell me why my party of 4 never got i","useful":0,"cool":0},"39vGsb1zIybt0jqUr0g4qQ":{"text":"The wait is super long. And packed most of the time. And no reservations. So be prepared. ","useful":1,"cool":1},"9BvW5rP2cLAgXJutf_Bd4Q":{"text":"First of all bring a picture of your vaccination card if you are going to dine in. This is","useful":0,"cool":0},"mKcLpst2jk8vl5Z8HjZsgg":{"text":"This was where my family chose to take me for my Birthday Brunch guess what I'm glad they ","useful":0,"cool":0},"zXJoH92p2KxUCK43rH7oBw":{"text":"I went to Morrows twice during a visit to New Orleans and the food was great both trips. \n","useful":0,"cool":0},"3eEBEVWZgOI5DUPBsvaQRw":{"text":"Food served piping cold.. after waiting 1 hour to be seated 1.5 hours for the food to come","useful":1,"cool":0},"NxyA3oGrpRkLJ7CU28Gt7g":{"text":"This place has HORRIBLE service. They tell you to put your name on a waiting list to be se","useful":0,"cool":0},"4JNbVGPNvzp58B4-9JO0xw":{"text":"This was the highlight of Essence Fest trip this year. I ordered the Cajun Crawfish Pasta ","useful":1,"cool":0},"9L_NUaLn-RYX5wAx_1UtQw":{"text":"MORROW OF THE STORY IS... Don't. Go. Here. \nSo I made an account just to review this place","useful":0,"cool":0},"HbbcW_xv7Q_oWks3HihBIw":{"text":"The food was amazing. The music was good and it was a very relaxed atomsphere. Usually the","useful":0,"cool":0},"vlzbDQ2IsJkq2zBW2UxPTg":{"text":"They were pretty busy so there was a wait but once I sat down to eat, it was definitely wo","useful":0,"cool":0},"BsUCzGcyxNs-vrFM0u7PnA":{"text":"Would support them because they're black owned but the food is not worth the pricing. They","useful":0,"cool":0},"0MOSUAal48NTZQoVEwe4sw":{"text":"Morrow's definitely lived up to the hype! \nI've heard nothing but good things about this p","useful":1,"cool":0},"qBVouU_PYhJbO1YARxD0DQ":{"text":"I visited from Brooklyn, NY. The food here is great! The service is great! The ambiance is","useful":0,"cool":0},"HLAnQBmSSGMmqPj0m-obsA":{"text":"Hubby and I back again. We visited on Saturday night February 23,2019. We enjoyed our food","useful":0,"cool":0},"UeVtMElJgsOOwYsLgczzhw":{"text":"2nd visit, December 31, 2019. I am starting to see a pattern here. You're going to be seat","useful":0,"cool":0},"95XNRoY-5F42wnVVVIPH6Q":{"text":"Went here for my birthday dinner. Arrived after 9 pm and was seated right away. Hostess wa","useful":0,"cool":0},"LvuZyLeNrH1vdQgENl9HJg":{"text":"A few months ago my uber driver recommended this restaurant to me. Me being new to New Orl","useful":1,"cool":1},"YlxyLJaRBUaOWHkAY3kW2g":{"text":"So first off I want to say I am totally rooting for Morrow's. Black owned business in an a","useful":22,"cool":1},"jome9IJca1QFHhDEqnDr7Q":{"text":"Planned a birthday trip for my boyfriend and after checking out their Yelp and IG Page, kn","useful":1,"cool":1},"Lyw2dDYPnDGmVAjTf3DBbA":{"text":"Me and my two girlfriends from Atlanta came like an hour before they closed !!! They accom","useful":0,"cool":0},"BcOtcCA4UCZcAK6rEMAhVA":{"text":"Morrow's was a let down for my party of 6, visiting from NYC. The service was poor and the","useful":0,"cool":0},"uNMUu67CAJ7aNGCx-6m9RQ":{"text":"My daughter's BDay Brunch was saved by the Chef.\nThe food was great, however the Greeters ","useful":0,"cool":0},"xbVqIQztnd8yDv2T5Rp-xg":{"text":"Excellent chargrilled oysters! Friendly, welcoming, festive atmosphere. Cajun Pasta, rice ","useful":0,"cool":0},"bw7Turc7FsphrmEpuvHxOg":{"text":"The food and service is wonderful. 5 stars is not enough to rate this restuarant. The Red ","useful":0,"cool":0},"znl0Vh7PGosYG_CB2pdXKw":{"text":"We were enjoying the food and Jimmy at the bar, until I looked over and saw the brown skin","useful":3,"cool":0},"JfHqA9ye1nKA626zeFT1Zg":{"text":"Tucked away from the French quarter is this gem. You can tell this is a local spot and not","useful":3,"cool":0},"V16NPIJ0cIQciGcIeXusbw":{"text":"Outstanding service, extremely pleasant and genuine bar-backs, great music, and tasty food","useful":0,"cool":1},"ZFthO4eK42VGoUQeH9oIZg":{"text":"It's been a moment since I've left a restaurant with a foodgasm smile and hot damn, Morrow","useful":24,"cool":18},"R5zaIF2JwaWUGwWz3HjoaQ":{"text":"Amazing food! Long wait BUT worth it!! \n\nOrder a drink from the bar while you wait and rel","useful":3,"cool":0}}