{"ZPxLHd0565UGVZSUX6doGA":{"text":"Foodie Call: always there when I turn around, at a cool dive bar. Or my homebase for bama ","useful":0,"cool":0},"QK9uvLz54r9IX2Y1EzLsIg":{"text":"I like food trucks. \n\nI like food trucks that have Poutine. \n\nI may just be a little biase","useful":3,"cool":2},"_hL7uJACiBc7sRxd9xxITw":{"text":"We were at a bar called Rusty Nail. Only food was a food truck called Foodie Call. It's 8p","useful":2,"cool":1},"ZPXukRiHNdqqNxuVd3eRuQ":{"text":"I like the irony of my first NOLA review being a food truck.. Just sayin'\n\nAnywayyyyy...\nF","useful":2,"cool":1},"gQUaXO8P3biwU5bo4krf6A":{"text":"As you know, I'm a boudin snob ad I did not think these balls were any good. They had bare","useful":0,"cool":0},"8ZjEjPGK44hTK_ZRvPAxQg":{"text":"This may be due to how inebriated I am leaving the rusty nail, but the turkey pesto sandwi","useful":1,"cool":0},"kmYOyd2HxJBJ2LeIN-Xjjw":{"text":"They are the best food truck in the city!  These guys know how to cook! One of them used t","useful":1,"cool":0},"JvxwD-fNWYdNbBU6qd7pBw":{"text":"Easily my favorite Nola food truck. Always a great New Orleans spin on an otherwise simple","useful":1,"cool":0},"8Edhgazit0CxxfIM54viSQ":{"text":"Love these guys. They come to our office once a week and I always try to get there.  They ","useful":1,"cool":1},"Cn_7IHFPu0VRaTJHrpwv3Q":{"text":"these guys were parked outside the Rusty Nail when i went last thursday night and people i","useful":1,"cool":1},"DvBZm8deS7F4cGJ8fY_o6Q":{"text":"we recently had a party catered by the theard brothers with their food truck known as \"foo","useful":0,"cool":0},"uvrKoQl85gzRJuC3VJNc2g":{"text":"I have been to this truck a few times at different bars. My first experience was the pouti","useful":1,"cool":0},"wC-ODRgt_cI42ARrEkX4iw":{"text":"This truck seems to have become a regular fixture at the Rusty Nail so I gave them a try d","useful":3,"cool":1},"pWELsAsA3ckbAa5JmP6Wsw":{"text":"BLUF:  Burger was quick and pretty dang good but the fries were a disappointment.\n\nI got t","useful":0,"cool":0},"fYoZvQXRGWJwpe7BcTs-qA":{"text":"I've tried just about everything they've had on their menu for the past 3 or so months and","useful":0,"cool":0},"2pO5ujREkTqCVJkbdL_OyA":{"text":"Ate here while at the WYES beer fest. Several of us shared a bit of everything and man wer","useful":0,"cool":0},"JSs9b6Yvh8-9kqbWDzEFNg":{"text":"This is one of the best food trucks in the city.  The Poutine is my favorite.   Whenever t","useful":0,"cool":0},"js_BdZnUw-PeFLqxUp2krw":{"text":"One of my favorite food trucks! Found them at The Rusty Nail on Saints opener game day. Wa","useful":3,"cool":2},"VUYF2WbhABYk3VXTiFOkiA":{"text":"This place is the bomb after having a few at the rusty nail. Any of the burgers with an or","useful":0,"cool":0},"8oVU5zh537nTmubwccJ9sQ":{"text":"I hate to say this, but I'm not impressed. Recently I went to The Rusty Nail for Opera On ","useful":1,"cool":0},"lv7V67exVKxniDXvqtd8rA":{"text":"Got a jalapeno burger and garlic parmesan truffle fries a while back.  Both were absolutel","useful":2,"cool":1},"pVSbJPQ4ED1hmDWM6tvWBQ":{"text":"At the recent food truck awards they were my winners. The poutine and Italian Ham sandwich","useful":2,"cool":0},"DcNqm2-iNvF0TmGASX5xPQ":{"text":"Sooo good! I got the buffalo wings (that were fried to order) great sauce and nice crunch.","useful":0,"cool":0}}