{"x2kDRrqFAwhGMJWJ6bnzyg":{"text":"Tried the Pork Belly po boy and it was pretty good. Served in a baguette style bread with ","useful":1,"cool":1},"JpWo1ck6s3KpXFEAtxu2IA":{"text":"I came here because they had a vegetarian option (sweet potato and kale). Their poboys are","useful":0,"cool":0},"Jh6-ZkFfIfXlO1JOIrCS-Q":{"text":"The food was great!  shrimp po boy was awesome!  It wasn't your traditional po' boy becaus","useful":0,"cool":0},"XrjL986eqOcv5CYhvI5iYw":{"text":"Shrimp po boy was delicious. Sauce on slaw had a nice taste and spice to it.","useful":0,"cool":0},"xciB7KP9e0yE2CViKKoqzg":{"text":"Very tasty, non-traditional po boys with a fun modern twist. Small menu, only a few offere","useful":0,"cool":0},"HGan3LJ7b3JCylvRdiJYeA":{"text":"Found this place as an alternative to Acme Oyster. No wait when I arrived. Shrimp poboy wa","useful":0,"cool":0},"up5BYkhd6-Rs6TJi0Ks6_g":{"text":"Worth pushing through the Irish bar up front - po boys with a unique (usually Asian) twist","useful":0,"cool":0},"0-GFCt_L6E5NCYXptBgUFQ":{"text":"Very interesting perspective on your traditional po boy that you can find on every corner ","useful":0,"cool":0},"mw5Z7Olmw4E7o54rEfwrdA":{"text":"Wow! So good! Get the grilled cheese!! Stopped in for an afternoon snack after a day of si","useful":0,"cool":0},"fU-UTDCInpPYfGOP5Vv1Aw":{"text":"Their poboys are killer! We had the pork belly poboys which almost melts in your mouth.","useful":0,"cool":0},"3SOqRZwCLHSVTC3ayS780A":{"text":"We stopped in for a frozen Irish coffee  and decided to snack on a po boy for good measure","useful":3,"cool":4},"F-HW69czclBUOeE-NH7oEQ":{"text":"Stopped in for a po' boy sandwich with some buddies at the beginning of a bachelor party i","useful":0,"cool":0},"BXBLRbMjUIlpHdgIeKSsuw":{"text":"I'm from Miami and a lot of restaurants here have pork belly selections on the menu and th","useful":1,"cool":2},"pF-3-EvNvQ7cIBYqJ243cw":{"text":"Hard to find but very worth it. Enter Erin Rose Pub and just maintain full speed ahead.\n\nL","useful":0,"cool":0},"9GvUBy9LtI5mYAInWokgLw":{"text":"Good twist on a shrimp as an almost bahn mi. The sweet potato one was flavorful but super ","useful":1,"cool":1},"QHLLs3lco_1Wd_ghIedw9A":{"text":"Look, you get fed up with PoBoys after the first day in Norleans, so make sure you just ma","useful":0,"cool":0},"9lv1nELON9-lixRMNopNSw":{"text":"I'll keep it simple - best food I had in NoLA, hands down. Grab a seat at the bar in Erin ","useful":0,"cool":0},"W8IitnEq56bcCkKIckXUDg":{"text":"Small po boys with not much filling. Crowded area smells like raw oysters inside. Hard to ","useful":0,"cool":0},"rQdfNUg8u8B0bftwK-ijPw":{"text":"Great Poboys! I had the shrimp and my two friends had the pork. I have yet to find a bette","useful":1,"cool":0},"eaXHMNXdAiMr2Yq4q6emBQ":{"text":"AMAZING! First off when we were looking for the place we passed it at first but then we sa","useful":2,"cool":0},"Mw31I4cNSTam3cCrNAM10g":{"text":"Incredible Poboy delights lie hidden in the back of Erin Rose.  The gulf shrimp was uuuuma","useful":0,"cool":0},"2TPXo3-jUKVP-mUf04L5Sw":{"text":"It's been over a year since I visited but I couldn't help but write a review as this place","useful":0,"cool":0},"Bnovuv-u_O_a5_bKJmrEoA":{"text":"Scrumptious poboys!!! \nThey have a 5 item menu which makes ordering the perfect meal easy.","useful":0,"cool":0},"AQWPQND4a4x2evCzYOML0Q":{"text":"Simply the best poboys in town. They taste just as great as the ones inside Erin Rose bar!","useful":0,"cool":0},"wzhhbY5G05LfQD9j_1tMLw":{"text":"The sandwiches at this simple shop are scrumptious. I had the pork belly on a yummy roll. ","useful":0,"cool":0},"gAgWr4q3O8Nc5zAOQSv1Mw":{"text":"Do yourself a favor and hit up Killer Poboys in Erin Rose for a grilled shrimp poboy and a","useful":0,"cool":0},"i1ADzkqUU0sc_fynIWsBDg":{"text":"What a spot,quite literally it is a HOLE IN A WALL.\nBut within that spot from that Hole ar","useful":0,"cool":0},"-Gv0Rb4N_lSf4hO8ddo3oQ":{"text":"Killer Poboys has converted me into a fan of po'boys.  Prior to coming here, I've had a nu","useful":2,"cool":1},"IUzSIBnWVyz4lq0VxJ8WVg":{"text":"We accidentally stumbled upon this restaurant after getting drinks at Erin Rose. I ordered","useful":0,"cool":0},"8Fv3v0c0RoXNhi01S99VHg":{"text":"After our last four days in NOLA, I can definitely say that all three poboys we tried (Jam","useful":1,"cool":1},"fa-QRRDYJukeOpcXAuGQQQ":{"text":"Yum,  the pork belly is amazing.  My bf adored the shrimp though I can't vouch for it beca","useful":0,"cool":0},"8PcjgnnNPXXJqRWwslDNOg":{"text":"Walk into Erin Rose and head to the back for a poboy feast. Got the recommendation from re","useful":1,"cool":1},"Fe1_KDf100ySxaXVxiW1SQ":{"text":"Tried the shrimp po boy and it was everything I dreamed a New Orleans po boy would be.  Th","useful":1,"cool":1},"xHOd0F55ABPnzZ47fBNw1g":{"text":"Pork belly was delicious. A bit pricey though ($24.99 for a pork belly po-boy and a gulf s","useful":0,"cool":0},"dM0Rn1Pb_2WldVZqU4eozQ":{"text":"The best Po'boy on the Continent. Personally I love the shrimp Po'boy with a fireball shot","useful":0,"cool":0},"r6lWnlJyBgPouq-HmxWnHw":{"text":"I tried three of their offerings(shrimp, pork belly & meatloaf). The meatloaf was ok, but ","useful":1,"cool":1},"LilZWf0w3esooCF0uXmeAg":{"text":"This is a strong 4 stars maybe 4.5.\n\nMy first day in New Orleans and I'm responsible for s","useful":1,"cool":2},"YqV3mcjH6lNpB7ZPvf7-qQ":{"text":"Yes, yes, yes!  This is not your traditional Po Boy place!  It's like comparing your stand","useful":0,"cool":1},"Q19jsxY6hQzvG74eND6PFg":{"text":"Seared shrimp poboy was extremely tasty. Who knew carrots and cucumber on a poboy could be","useful":1,"cool":0},"xxmY9Tb5ntG5-iTs2F0Y8A":{"text":"Me and my husband stopped in, passed it at first, gotta go through Erin rose and it's all ","useful":0,"cool":1},"lmQL931ZD49LvJxOsMUITA":{"text":"Shrimp po boy was great.  Good quality, fresh tasting ingredients.  Little bummed by the m","useful":0,"cool":0},"T3HJqei06qlpVd19mMyPgA":{"text":"Coming from a native... these are not traditional Poboys. If this is what you are looking ","useful":0,"cool":0},"xcq0kO_guEV8bEAQY9jjGg":{"text":"Thought it would be better according to the reviews. I got the shrimp poboy. Bread was kin","useful":0,"cool":0},"ZOIKlPY-k_PGmo7utZVVdQ":{"text":"I came here with my friends because it has good ratings and it was open after my friend go","useful":1,"cool":0},"1_aqC1VY9D6Ur9tpjvgAVg":{"text":"Creative takes on your traditional po boy. Fresh ingredients, great flavors and an intimat","useful":0,"cool":0},"c8t83IQHjU4Lrf_ZzxbU4A":{"text":"Not very good...shrimp was fishy and pork belly was overly sweet and big pieces of pure fa","useful":2,"cool":0},"1pVHmfcJ2VXq9fBDpu0lBw":{"text":"I had the Coriander Lime Gulf Shrimp Poboy here twice on my most recent New Orleans vacati","useful":0,"cool":0},"YCtxFkk6FnWYVqZKW6pVBg":{"text":"Could not be more impressed with a sandwich shop inside of dive bar, inside of another div","useful":3,"cool":1},"VywxHur2p0ZARw25QFggqg":{"text":"These are some of the tastiest sandwiches you can find in New Orleans.\nMeatloaf everytime.","useful":0,"cool":0},"FhDIU0NlUV9Z_99h69nAgA":{"text":"You want to look for Erin Rose bar n killer poboys is in back. I had the daily special whi","useful":0,"cool":0},"xpbu2pm0uQgkZtSG6tTcHw":{"text":"This probably the best po boy I've ever had!  I had the beef po boy and my hubby had the s","useful":0,"cool":0},"NOq5QFQmZ1NZgZzX2mal6w":{"text":"If by killer you mean not very good.... Then great name. How does this place have four sta","useful":1,"cool":0},"-Dd3L2ENRr3DsFtb3Mj5XA":{"text":"Another hidden gem in the back of a bar. Had a roast beef and a shrimp poboy. Both were ex","useful":0,"cool":0},"I-nVNzDaNlOJUG5sshym2g":{"text":"Saw this on Yelp and all the ratings. Decided to try it out. Got the \"Dark and Stormy\" and","useful":1,"cool":0},"sweFbC42febvVj0VNjLvkg":{"text":"You won't find killer poboy on the outside of this whole and the wall bar but You will fin","useful":0,"cool":0},"IwUv96uUFn_b9xbtIWnU7g":{"text":"Not impressed. Had the shrimp pivot and the pork belly. The shrimp was ok just not much sh","useful":0,"cool":0},"ya0oBjg5T698sB2EEGSv6w":{"text":"This place serves up untraditional, unconventional po'boys, so if you are looking for some","useful":1,"cool":0},"-XsfNrCG-7rxf_nwhBJ7Ag":{"text":"Killer says it all.  If you want a tasty Poboy there is no reason to go ANYWHERE else, unl","useful":0,"cool":0},"pYXkcEFcGVyKYjjnvuOsGg":{"text":"Stopped in here for a Lime Cilantro Shrimp Po Boy.  Yes the seating is crowded inside the ","useful":0,"cool":0},"eFUIq3aSuXupDGUf2RpcQA":{"text":"Located at the back of a bar, it's easy to miss, but once you've found it, it's worth the ","useful":0,"cool":0},"QUWc3hXxj7ZVpIbo67fFBg":{"text":"Pork belly was phenomenal and grilled shrimp was light and refreshing. So glad we ventured","useful":0,"cool":0},"oy4DeraCIggJ0TErCQd9tQ":{"text":"We both had the pork belly po' boy - the best sandwich we've had in NOLA so far! The bread","useful":1,"cool":0},"_10HbkpIGq0DDx2B5ETvCw":{"text":"Very good shrimp po-boy, but not amazing, and for the price it should have been much bigge","useful":0,"cool":0},"_824di_cbe4tzAF6eGshmA":{"text":"Hidden in the back of the Erin Rose but the gulf shrimp and pork belly Po'Boys were fantas","useful":0,"cool":0},"wJFyziJPveP8oTZ6Cqv89A":{"text":"Very good gourmet poboys. Do not come here if your want the standard fried seafood poboys.","useful":1,"cool":1},"sidD8pjFTFsai-zhCVV81w":{"text":"My friend and I stopped in Erin Rose and went straight to the back for the Killer Poboys. ","useful":0,"cool":0},"i26ghpw94liCc4DHf79IJg":{"text":"Tucked in the back of Erin Rose was this hidden gem. We ordered the shrimp, pork belly, an","useful":1,"cool":1},"ofKuhVaftJoviSudmHSjbw":{"text":"Just amazingly delicious. Def check this place out. It is in the back of a bar, and we kin","useful":0,"cool":0},"aCDCTIwNGM_7hhNvgLtlww":{"text":"I absolutely LOVED everything I tried at Killer Po Boys.  Amazing food, the Gulf shrimp po","useful":0,"cool":0},"PiTwVrAHgpuSJc1AP5IqGQ":{"text":"OMG the sweet potato po boy was absolutely amazing, it definitely hits the spot and the pr","useful":0,"cool":1},"LTCktn9SImgna31BTkQAQQ":{"text":"Killer Poboys is located in the back of a dive bar. It's a tiny room covered in wood panel","useful":3,"cool":0},"3KsfNPjPuRa2acwH3PB4ag":{"text":"The shrimp po boy was great. And that is about all that was good. The po boy was $14 and d","useful":0,"cool":0},"Wgl6yoYNKfIaEn_kqeNvdg":{"text":"Not your typical po'boy! This place is located in the back of the bar. Its a little tight ","useful":0,"cool":0},"SNwLE596JJ87gJYc2QYNIg":{"text":"EXCELLENT Poboys. In the back of Erin Rose pub, the best thing I ate in New Orleans! Perfe","useful":0,"cool":0},"Agfl7jDPXNTrapNWeM6Tog":{"text":"Killer Po Boys was a nice stop, but I'm not going more than 3 stars. The food was tasty, b","useful":2,"cool":0},"7V3nbFtLzod-Rg-l5n86Ig":{"text":"This place is a fine example of the strength of social media.  There is no sign as it is i","useful":0,"cool":0},"4mgNq718nVgj_1JfskHnNg":{"text":"Pretty good poboys though sometimes inconsistent if April or Cam are not making your poboy","useful":0,"cool":0},"DTQPCwoAuGfkV9LB_De_Ag":{"text":"Not sure if these guys have all their friends write good reviews because these sandwiches ","useful":1,"cool":0},"Ohmf0BZ4ecq-Iwst69j8vA":{"text":"Disclaimer: this is a review from a local who is pretty well-versed in po-boys.\n\nThe menu ","useful":3,"cool":0},"OPGMU2Fxa8MyrSoQuV-hDQ":{"text":"This was our first bite of food in New Orleans, and it made for a very good start. Traditi","useful":0,"cool":0},"2Kgqd0CrphM_-T_bUVxf7w":{"text":"Any review that is over 2 stars is from a drunk person. Overall if your hammered it's prob","useful":0,"cool":0},"mxwxcdr85tusAhF4yB_EyA":{"text":"Place is hard to find. You won't find a sign for it on the street. Walk into the Erin and ","useful":0,"cool":0},"-Ui7HiRDxpUMlUmlhGsQ-g":{"text":"This place is really good if you're not looking for the traditional NOLA po'boys. In reali","useful":2,"cool":0},"r7XNNdBZ7kOUeSNG2fjSFA":{"text":"This has \"former food truck\" written all over it.\n\nNot necessarily a bad thing, but Killer","useful":1,"cool":0},"Kmwn63EIZ4vuG4i1Bi8oLQ":{"text":"Pork Belly Poboy. Not much else to say. It was sweet and delicious. The proprietor asked m","useful":0,"cool":0},"_dZEyMWQxPW8G5LIQMSGEA":{"text":"Tried the shrimp and pork belly poboys and although they are not your traditional poboys, ","useful":2,"cool":2},"QHbCm6gKNfflAnwZ3K6Ulg":{"text":"Had to try a Poboy while in NOLA! Stopped here to get a favorite and it did not disappoint","useful":0,"cool":0},"e7CnqvLb9US40JS2Efv5PA":{"text":"FAT and FATTY PoBOY\nDon't come here for a salad, because they don't cater to people who ar","useful":0,"cool":1},"3D1YqWoneLg290-kiQX7zQ":{"text":"Went to New orleans to try this place out since it had so many reviews on Yelp.\n\nThis is a","useful":0,"cool":0},"uQtEYgBHWbZCyfjRzK3-xw":{"text":"NEVER would have stumbled across this joint wo Yelp. So glad I did! Once again, amazingly ","useful":0,"cool":0},"oDGKh3v3N2rAd4iWoTa2xQ":{"text":"2 thumbs up for the grilled shrimp po'boy. The shrimp was fresh and perfectly grilled.","useful":0,"cool":0},"T-QVHai5umAscdNVKZQjLA":{"text":"The Erin Rose is awesome but I wasn't a huge fan of Killer Poboys.\n\nThe shrimp poboy was g","useful":0,"cool":1},"NDOQtSNiSnvd_XVj9SNDaA":{"text":"Listen, I really, really wanted my pork belly po'boy  at Killer PoBoys to be a great exper","useful":1,"cool":0},"lPgfXSI48iUG4fbhyEcw2A":{"text":"Delicious pork belly poboys! Located in the back of Erin Rose, just off Bourbon Street in ","useful":2,"cool":0},"qsqSf6dd91aSYWewF9U8YA":{"text":"I don't usually eat alot of bread, and it was my second time to NOLA so unfortunately I ha","useful":0,"cool":0},"8QLF4ctvYd0ztxGaWxAs2w":{"text":"Hands down the best poboy I've EVER had!! Been twice so far and ate the gulf shrimp the fi","useful":0,"cool":0},"DEOQX0a4-DSCoZe5IHdfzA":{"text":"We had the pork belly and we also had the shrimp, both were excellent.   The portion sizes","useful":0,"cool":0},"IUCEmEpBCJsS9QNJCZEmag":{"text":"The only bad about this place is that smoking is allowed indoors. Ugh. \nTried pork belly a","useful":0,"cool":0},"YE0pE1wOY-hbpj0aaSfZmA":{"text":"We came to the Erin Rose on Tuesday to try the bloody Mary based on yelp reviews. While th","useful":0,"cool":0},"eBAbB39KXspBoxJrB1rqwA":{"text":"One word, \"killer!\".\nSurprisingly sophisticated complex flavor combos in great bread.","useful":0,"cool":0},"pJxI1ZcENSL51-Lp8oagyA":{"text":"You will NEVER find this place unless you read the directions carefully. You have to walk ","useful":0,"cool":0},"nUejMIxkr-kL4ZMkQbM1Fg":{"text":"The best!\n\nI was here during Mardi Gras and needed to have the best Po Boy in town. Yelper","useful":1,"cool":0},"G7Qln_xgnmeiCab1HhXwGg":{"text":"This place is a hole in the wall... Quite literally. No sign graces the outer facade... It","useful":2,"cool":0},"TCKRJ42ae3mwSGTcgAU-UA":{"text":"Unfortunately I was not a big fan of this place. I really liked the bar it is inside of th","useful":6,"cool":5},"4YRtNsBl4WAHoiciwOLXag":{"text":"This is more like a banh mi than it is a po boy to me. When craving a typical po boy this ","useful":0,"cool":0},"JuakYQWIAZbxNOIMWrEeEA":{"text":"The po'boys here are amazing! My husband and I split one- but we wish we had our own! The ","useful":0,"cool":0},"Dk-y9tJDU-fG-NJNwYmQNg":{"text":"I guess it is my old school way, but it seems that in this day and age, any sandwich in NO","useful":1,"cool":1},"KQvaC-5JuGhpTcDBe4SLNQ":{"text":"Cool spot in the back of a very crowded bar.   Not much seating but a diverse, hip crowd. ","useful":0,"cool":0},"1GeqeJWfSpRmoCPBlTVGFg":{"text":"Tucked away in the rear of an Irish pub, Erin Rose, Killer Poboys is a diamond in the roug","useful":0,"cool":0},"DE2H2sesF9yyOeZBChq8qQ":{"text":"Not your classic po boy. Creative stuff and perfect bar food. Liked both the pork belly an","useful":2,"cool":3},"vsSF-Mm9sRpg2DW8tSwYAA":{"text":"Went here for a quick dinner before meeting friends. Heard it was awesome, and at the back","useful":7,"cool":2},"BxpDGqRdBEwZkN9QHqqnRA":{"text":"Half of the items on the menu have been removed, the guy taking orders has a bad attitude,","useful":0,"cool":0},"yeRiLQCQvw_M1qxqC90_dQ":{"text":"As a tourist, I really wanted to see what the whole po boy scene was about, but this place","useful":0,"cool":0},"DY6vmcD16UGJEQjheuKCPw":{"text":"I am hungry just looking back at the Yelp page. Killer Poboys felt like poboys reimagined.","useful":0,"cool":0},"FHo-jyAjVHZj9o8Biayq8Q":{"text":"Don't listen to all the haters, yes it is in the back of the bar but that is what makes it","useful":0,"cool":0},"hhldjzKfNCV0KBalkAm59w":{"text":"Jeff is my main man. He made me and my friends specially crafted drinks that we actually a","useful":0,"cool":0},"J1WEETvjtm9qrd9vRk4Agw":{"text":"Killer Poboys is one of my two go-to spots in New Orleans. Their unique take on the Poboy ","useful":0,"cool":0},"4kpiMtFShEKp7rJ2HUUlQw":{"text":"The Po-boy is a simple sandwich right?  Not at Killer Po-Boys!   Their Morrocan spiced lam","useful":1,"cool":0},"y6UFYFp0sfnjigNUDIz6Ig":{"text":"No, no no!!!!! I tried the Meatloaf and Whiskey Grilled Cheese Po'boys. It took me about 1","useful":0,"cool":0},"AqypZQ5p8H6oqGkUMTIgfA":{"text":"Never had a Po Boy before, but needed a quick bite to eat. Found Killer Poboys nearby so d","useful":1,"cool":0},"LaGp3FQrJbB5CS2Z0shKYw":{"text":"Had the grilled shrimp poboy ....it was great all the fixings made this a great n tasty sa","useful":1,"cool":0},"SpbZl-Gh8p7rrHdVfR7GzA":{"text":"The problems here I think are in execution, not in vision. \n\nPork belly po boy had good fl","useful":0,"cool":0},"snxg-cA8Y7SvHNT2ih9cqA":{"text":"it still felt like a discovery to find this place, even though many people know about it. ","useful":2,"cool":1},"AiqU8xsLml08xkfZP04fnQ":{"text":"The folks there were nice. They gave my kid crayons and were sweet. There was just very li","useful":0,"cool":0},"7eJglwGVp3qlHLh4Zs3vEg":{"text":"My boyfriend and I shared a pork belly poboy and a shrimp poboy. My boyfriend loved the sh","useful":0,"cool":0},"dgF5ONUTLO6eYOoxcX0v3Q":{"text":"The shrimp po boy was really good, but I had really bad burps all night, but that's a pers","useful":0,"cool":0},"KUORsDYDZjpTMoyPb6Z3WA":{"text":"Grilled cheese was great but the po boys were awful. Shrimp smelled too fishy we couldn't ","useful":0,"cool":0},"JpWK3aJxdWVoOAkd0TJYQA":{"text":"Pork belly po'boy? The flavoring was excellent but the 4 pieces of pork belly were literal","useful":1,"cool":0},"B3YzoK_s9ARTEs2ZxE-3hA":{"text":"Very good fresh innovative poboy. However, for a huge cheap delicious more traditional sty","useful":0,"cool":0},"VASgc6dcGmWE4c37B4P0qg":{"text":"Great poboy in the back of a bar. A bit harder to find. Its great to be able to enjoy a be","useful":0,"cool":0},"h9xcoZywjvN06iQHincMyQ":{"text":"What everybody else wrote and more!! After eating 8,437 bad Poboys, because I am that stup","useful":0,"cool":0},"UATM6JCOZBDY4_gD3aRC5w":{"text":"Don't get lost. This place is in the back of the bar! We went here craving some poboys and","useful":0,"cool":0},"nffs7sF7Toc9loSnuCFdsw":{"text":"Really fresh ingredients. Halved the shrimp and Dark and Stormy with my daughter. Both wer","useful":0,"cool":0},"pZOVj_8Fy87QyVYbPesm3A":{"text":"Had the pork belly po boy which blew my mind. I cannot comment on authenticity but copious","useful":2,"cool":2},"7-SVUykVL1ipYU3Zcg2rGw":{"text":"Had the shrimp po boy....amazing!!! Behind the erin rose bar. Small place with big tastes!","useful":0,"cool":0},"NeeDWO79O60pJ9mkr4U82Q":{"text":"Another thumbs up here for the pork belly po-boy.  It was nice to see a place doing someth","useful":0,"cool":0},"HUq_cI6ewVCqHbf9hNkeXg":{"text":"OMG! Shrimp po boy was out of this world. Bread was toasty on the outside and soft in the ","useful":1,"cool":0},"QS7qNFqvwmrgsWbXfM_IAg":{"text":"The shrimp poboy was great but there is only a small cramped area to eat in the back of th","useful":0,"cool":0},"XTD70fLDvDt5As5Z9fntCg":{"text":"It might take you a few minutes to find this place - its at the back of Erin Rose bar and ","useful":0,"cool":0},"ubjS7BOHrC2OsMpTN_kCGg":{"text":"Not what I was expecting. Basically this place makes their po boys like banh mi. I wanted ","useful":0,"cool":1},"VD4DUZV2Wjrtkr0Jm6lDUg":{"text":"Gulf shrimp poboy and pork belly are a must. Make sure to wash it down with frozen Irish c","useful":0,"cool":0},"oUEIeP0yLMSG9HgRdJ-umw":{"text":"Been there wasn't busy at all, the place is hidden so you wouldn't find the name of killer","useful":0,"cool":0},"yrVO7QsNw3MLoYL6XOopcA":{"text":"Went there twice, first time had the shrimp \"po boy\" which was fabulous with layers of fla","useful":0,"cool":0},"afybS0QDvro09x65j3BH4Q":{"text":"This review is just for the whiskey grilled cheese and service. The cheese was rich and de","useful":0,"cool":0},"vm0eIg1jPnbXbey-wAB6sQ":{"text":"The shrimp in the PO boy sandwich was tasty but the bread was super hard and it took away ","useful":2,"cool":0},"J0uEwM3M3iWkZS5WAzDsoQ":{"text":"Went here based on reviews. Po boys were soggy and not good. Basically coleslaw on a bun w","useful":0,"cool":0},"z1e6X_cwLwmTv9QtgMDn0w":{"text":"Found the review on yelp and decided to check this place out. Get the pot belly po boy, yo","useful":0,"cool":1},"HZGsgpqA-yGAwcuIlODmVg":{"text":"The Po Boy's here are outstanding. The place is small so it's A little cramped but I imagi","useful":0,"cool":0},"G4seGxOdzv-49Kfm_MELRQ":{"text":"I got the braised pork belly po boy. I wish it had less cabbage on it. If you are looking ","useful":0,"cool":0},"HRS_Oay-_hgmFOZcORvbZw":{"text":"Hidden gem if it can be called that in the heart of French Quarters. In the back of a cool","useful":0,"cool":0},"MlqG-Fui3P8UenjA_rvWPw":{"text":"We loved these poboys. We each had half a pork belly and half a shrimp. They were creative","useful":0,"cool":0},"e1tERInRzcAK2-vjjM0Hug":{"text":"Reasonably priced po boys hidden in the back of the Erin Rose. We had to double back to fi","useful":0,"cool":0},"h9lkM44hS5B043fEmHYrOQ":{"text":"Pork belly poboy... Yes yes yes yes yesssss. Only took off one star because the portions w","useful":1,"cool":0},"FPJGcGr1FlK0X266mEAFmQ":{"text":"I was looking for a good sandwich spot so dropped by here because of the yelp reviews.  It","useful":4,"cool":3},"R0b91TbL2ipaVy9sFmfrqw":{"text":"I had the braised beef and my daughter(the vegan) had the sweet potato po boy.  Delicious!","useful":0,"cool":0},"N9NnR7c0w-mtRpoe3djIQg":{"text":"Wow! Had the beef poboy. They make it from scratch in a 12-hour process, and it's wonderfu","useful":2,"cool":2},"a9GOV0xHsLiI1phZX3D6MA":{"text":"I had read so much hype about this place, I've got to admit I was a little let down. I had","useful":0,"cool":0},"grfqW3BhI6CJuOVKTjw3wg":{"text":"Hits the spot after drinking all night. The actual place is inside of Erin Rose in the way","useful":0,"cool":0},"ujFjanHt2rwAw3n1mNIYwA":{"text":"We only found Killer Poboys because of Yelp. It's in the back of a dive bar, and totally u","useful":0,"cool":0},"Zsxbe_TyNqFiqBY8b0Ev3w":{"text":"I really liked the shrimp Poboys but just wished the bread wasn't so hard and it wasn't ev","useful":0,"cool":0},"6hQEHJHmYGpHRnPnYmLS2Q":{"text":"Shrimp Poboy: not your typical Poboy. Has a more banh mi style with a lot of vegetables an","useful":2,"cool":2},"9PtonRY3W7bMn07rp51Umg":{"text":"OMG! First. Find the Erin Rose bar (there is no sign for Killer Poboys) and go all the way","useful":3,"cool":0},"btWt1XAA7Yncuv5WXrhZpg":{"text":"best poboys ive had in louisiana, especially if you want non fried options. REQUEST: pleas","useful":0,"cool":0},"Sxo9REdZCDvHjNndmxcujA":{"text":"Terrific shrimp poboy... Grilled and topped with a marinated carrot and radish slaw.. Brea","useful":0,"cool":0},"LxHERlj8ZdXubNoAy04u-g":{"text":"That shrimp poboy was better than any bahn mi I've had.  $14?! ouch.  but damn it was good","useful":1,"cool":1},"UGmf-Ax7a7jffaYVolzOUA":{"text":"I have tried to write this three times now, but truthfully cannot recall the specific comb","useful":0,"cool":1},"EOp7rhQZ3vjk5Awb5G8A_Q":{"text":"Boy oh boy! Veggie food is hard to find in Nawlins', This place dished up a real killer ve","useful":0,"cool":0},"9umPaGbx5ZnynOSieBVHKA":{"text":"The Erin Rose and Killer Poboys was recommended to me by John T. Edge of the Southern Food","useful":1,"cool":1},"wpA2mvWmt7waU3SOnp1TWA":{"text":"Wow! It's the pickled veggies that really make these sandwiches stand out--and the fact th","useful":0,"cool":0},"wDJTfuH6dtyqwOQRIIz3tg":{"text":"So I never knew it could be so hard to find a good poboy in NOLA. Who would have known? \nS","useful":0,"cool":0},"kZovaGG_p2KSP5qQdcRFjQ":{"text":"Not authentic, tourist trap. Most importantly ...THERE WERE ONLY SIX SHRIMP?! Ive had a lo","useful":0,"cool":0},"lybBgr6SSBzbQv1lguQ4HQ":{"text":"When in NOLA celebrating my bachelorette party we had a tour guide of ours recommend this ","useful":1,"cool":0},"lRNHyHtlar7ZE52JusdfUQ":{"text":"My wife and I were on vacation in New Orleans and heard about this hole in the wall that h","useful":2,"cool":1},"6A9Z2XPTwl3OKJcUWYIlcA":{"text":"Had an excellent fried shrimp po'boy and local beer here. I am no millennial but I sure fe","useful":2,"cool":1},"EgvO_L67yTPk5CR92bRQwQ":{"text":"This is one of my favorite places to eat! Chef Cam is really gifted, always creative with ","useful":2,"cool":2},"zW8KA6ASYoeFNdITEZR4DQ":{"text":"Amazing shrimp Po boy. The location is tiny and dark and dingy but the Po boy was fresh an","useful":0,"cool":0},"2RMMI8T3WXyVzE0jRVT_2A":{"text":"I can't say enough great things about this place. First of all the po' boys are ridiculous","useful":1,"cool":0},"Ik5nxdrCnbw_K50sSKK92w":{"text":"I ate hear a month ago and was really impressed. The Dark and Stormy poboy blew my mind; i","useful":0,"cool":0},"LA6Cdorkgtwo23peOYt38g":{"text":"It's always great to come across a place that offers a veganized version of a local favori","useful":1,"cool":0},"2E-mo9HWC15gf6d7EAbX3w":{"text":"Wow. \n\nWow.\n\nWow. Don't let the small menu fool you. Until I went to Peche on my last nigh","useful":0,"cool":1},"w8Hui6rYm_0h17tp479fHQ":{"text":"This place is soooo good.\nIt's a cash only hole in the wall, at the back of a cool little ","useful":0,"cool":0},"6G0vQ-9htuogC_GFC7olWA":{"text":"The rumors are true. This place is on POINT. Hidden in the back of an unsuspecting bar nam","useful":0,"cool":0},"TU1DaLRfHit1KZVvoaDUzg":{"text":"This place was absolutely amazing. Glad I read comments before we went there because I wou","useful":0,"cool":0},"PdsjSfwHvQVjobhDsPhajw":{"text":"Killer Poboys was the best meal I had in NOLA (and it was vegetarian!!). They are in the v","useful":2,"cool":1},"w-UEKImdVU0IYIi9ZtKhGg":{"text":"This place wasn't for me. Eating in a windowless room behind a stinky bar was a little off","useful":3,"cool":1},"tBFjhrlKeevkXdt_f_jl3Q":{"text":"Hidden jewel for sure! Po'boy is amazing but the simple Jameson grilled cheese stole the s","useful":1,"cool":0},"OcUytFJ4r_qDgjIr372gAw":{"text":"My husband and I had researched the \"best poboy in NOLA\" prior to our visit. Our first mea","useful":0,"cool":0},"D15c0DcBKH-zbW5KeW53BA":{"text":"While the menu maybe limited the offerings that are on the menu are so consistently delici","useful":0,"cool":1},"W6QJF4OwMrmnLUKT98lvuw":{"text":"Graet food!!! Fresh ingredients!!!Shrimp po-boy not fried!!!! Homemade sauce!!!! Worth it ","useful":1,"cool":0},"lYg_7R-xd-8qMh2ZLTZ-oQ":{"text":"A great healthy option for the plant-based folks craving a New Orleans classic: The Po'boy","useful":0,"cool":0},"-OwJJVn10e5XZwUhGMzR7A":{"text":"This may be one of the best deals in the French Quarter. A 16\" crawfish poboy, plenty to s","useful":0,"cool":0},"WuLkuHyscRpsojomPuyQ8A":{"text":"Absolutey the best non traditional Po Boy I've ever had. My vegan daughter had the roasted","useful":0,"cool":0},"3jht_oWeBo7wqEq3I8eCvA":{"text":"Be aware it is in the Erin Rose bar, so don't be surprised if you don't see a sign for it ","useful":0,"cool":0},"30HUf-TLLD1-Lf462O8mxg":{"text":"The shrimp poboy is banh mi inspired - with a carrot slaw, sriracha aoili and bread from a","useful":2,"cool":1},"p9LVRVZ8UhhvQO_iJHOK8Q":{"text":"A hidden gem tucked in the back of a bar in the French quarter... I didn't expect the food","useful":0,"cool":0},"RYiMdZXX1-dt-q5AlHunrg":{"text":"I was really looking forward to trying this place and I was glad I finally did. The shrimp","useful":0,"cool":0},"6eLS2c9eAsrrF-K-vwPyZA":{"text":"Went here on Friday at around 4pm. I wanna say, it wasn't too great for us. We got the bee","useful":0,"cool":0},"bH6PA3RJ2NxCge7Xli9vYg":{"text":"Set inside a bar, way in the back, the menu is not huge but what they have, especially aft","useful":0,"cool":0},"-XiGfHZOHXqQUOdZWIStUg":{"text":"Killer Po Boys is incredible! It is located in the back of the awesome Erin Rose bar. All ","useful":0,"cool":0},"jN5luUYvqNtf63eHebXcyg":{"text":"DO NOT GO HERE!!!!!\nThese people do not know their asses from a hole in the wall.  Waited ","useful":0,"cool":0},"3Yq5MD-xm6Lo1ZzCCcXl6A":{"text":"Great hole in the wall for a non traditional Po'Boy. Note this place is in the back of a s","useful":1,"cool":1},"2GhzT3HdmeM45p5CmJDPgQ":{"text":"Pork belly poboys! Best thing I ate in the French quarter over 5 days. It was actually the","useful":0,"cool":0},"iHAokhz0yJJKddcv_-MouA":{"text":"***FYI: THEY DON'T SERVE POBOYS.***\n We went in search of traditional fried shrimp and oys","useful":4,"cool":3},"tm0-1ZRTXruTSg0pRRkhWA":{"text":"A divey-irish pub with a po-boy window in the back. I'm in. Do you need further convincing","useful":0,"cool":0},"gIPwJkyKI7Iq3Dvq6wFHLQ":{"text":"So happy I tried this place! It's a little hard to find because it's located in the very b","useful":0,"cool":0},"9gCWdJ6eWz2A4lTP_RoKvA":{"text":"The Poboys are really good. Not a big variety to choose from but the ones served are a goo","useful":0,"cool":0},"wlqwlmcXBiBtFLmbTJTprA":{"text":"I'm sure they have amazing Poboys, but I never got to try one. Here is why:\n\n1. I tried as","useful":0,"cool":0},"pSyAlBO0UM-P-V5wLQrA-w":{"text":"Thanks Sean for the recommendation. Best po boy I've ever had. It's a po boy with a twist.","useful":1,"cool":1},"lndhMo2Frj81Vul7IsbnkQ":{"text":"A couple of friends of mine ate here and we enjoyed what basically was a shrimp bahn mi an","useful":2,"cool":0},"kjm-Cr3Ww_rECv4DSTJwYw":{"text":"Thought this place was just okay. Maybe I was looking for a more traditional po boy place.","useful":0,"cool":0},"VXXLCrasFxeFNuVxvvBtEw":{"text":"Just in town for a few days and ended up coming to Erin Rose twice. It's a cool spot just ","useful":0,"cool":0},"GrNLS3ivz_5sXZKu_tgA7Q":{"text":"I had sprained my ankle pretty bad to the point where I had been on crutches for the past ","useful":0,"cool":0},"JcP7avemRcRUnVt0QviETA":{"text":"Very original flavors here.  I'd never heard of a meat loaf po'boy, but decided to give it","useful":0,"cool":0},"W1ZuCtwhmVy1wtUxQ3Us2w":{"text":"Plusieurs guides américains le désignent comme le meilleur po'boy de la Nouvelle Orléans. ","useful":0,"cool":0},"mwrd4BkGgqDpYadstkVCVw":{"text":"I had to try out the Pork belly poboys that everyone has been raving about! First off it's","useful":0,"cool":0},"Blo4nxwsEF11nMCmKWHNIA":{"text":"This is why I love Yelp.  I never would have found this place, or even known about it, if ","useful":2,"cool":1},"DwxxH_DWN5ekpxYDtUNmLQ":{"text":"This place was recommended by a bar tender at another bar. Go to the BACK for where you or","useful":1,"cool":0},"4B6fcdOhXptj2z2nzh2NTQ":{"text":"We saw the good reviews and decided to give this place a try because the options were limi","useful":1,"cool":0},"0CEH0Rdx5DqbZZ4oriITAg":{"text":"Got a glazed pork belly PoBoy. Most delicious sandwich ever. It was like a upped version o","useful":0,"cool":0},"6dz6zt_S1QyMVVzp3ySrvw":{"text":"Its in the back of the bar. Its basically one table and some seats - very tiny. We never h","useful":0,"cool":0},"OU_tcnAknq4tP2BwXuwp-Q":{"text":"Deeee-lish! Pork belly po boy, side of voodoo chips, and all is right in the world. The fl","useful":2,"cool":1},"PjY4C1GJ7ga7uXxsfHO4gQ":{"text":"The po-boys alone get 4 stars. They were great and I liked the variety. The bar its self (","useful":0,"cool":0},"dLGe6JncAOlbyFD8xJSowA":{"text":"I found this place on Yelp, and was delighted when I realized that I was staying across th","useful":1,"cool":1},"X4AA9pTPGUO4JCU5alCsLg":{"text":"I had the roasted cauliflower on a poboy bun. It was simply amazing. Very flavorful. Nice ","useful":0,"cool":0},"SOOjT5fUAF1NVVsWo1Yy4A":{"text":"I had a lot of awful, dry po'boys during my trip to NOLA.  The kind where they give you a ","useful":1,"cool":0},"mezESUkZMiqzIHEdWjNxEA":{"text":"What a spot,quite literally it is a HOLE IN A WALL.\nBut within that spot from that Hole ar","useful":1,"cool":1},"FPlNue_6pL9b5Hx51QN4KQ":{"text":"DO NOT GET THE PORK BELLY PO BOY! It was disgusting, soggy with little flavor and had more","useful":0,"cool":0},"hbnXypr1KSXTtLpGfEWbrQ":{"text":"Nothing frozen, nothing fried.\nFresh, local, flavorful food in a nontraditional setting","useful":0,"cool":0},"HdvUr9rWYQlW0WBhsCo9XA":{"text":"There's nothing wrong with the Po Boys here, it's that they're not that remarkable. Plus f","useful":0,"cool":0},"FqfauebrJaYK2OElUOadfw":{"text":"We went to the Killer PoBoys that is in the Erin Rose. The shrimp was excellent. Really go","useful":1,"cool":0},"YjWbia1ET4XW4cdsOVUXYw":{"text":"i got the dark and stormy and my frien got the beef special they had and we were both disa","useful":1,"cool":1},"u1B_hwXm2NNohupCEXilkA":{"text":"Great shrimp po boy but more pricier than other places.  Place has a local feel with very ","useful":0,"cool":0},"J9oSnVwECECLfZOFHJyW7Q":{"text":"Erin Rose bar is packed but good times. However, shrimp pinot was not good, undercooked an","useful":0,"cool":0},"SY5KuZZtLRf4YxaqrbdlBg":{"text":"Although on the more expensive end, KIller Poboys makes killer poboys! I ordered the shrim","useful":1,"cool":1},"QpKTgf-CCkd8dSn2pcpchg":{"text":"Fabulous speak easy for po- boys. Best shrimp po boy. No fuss speciality nook at the back ","useful":0,"cool":0},"0Sx2_v8MPvONLDLLceTc5w":{"text":"Poboys were definitely on our must eat list when in New Orleans. After doing a quick Yelp ","useful":0,"cool":2},"B_PLO_pf5wjjjc9UkmJNHg":{"text":"My wife and I here today...  It was all around great.  We has the shrimp po boy and the da","useful":0,"cool":0},"J2hHaLWtmba3D76E3Lp4aQ":{"text":"O.M.G these po boys are INCREDIBLE! I went here when I visited New Orleans, and it was a f","useful":4,"cool":2},"WQSbmVm5LAlt_vkPYlxYyQ":{"text":"Ok where do I begin. I'm a Louisiana native and for him to call these sandwiches poboys is","useful":0,"cool":0},"mDodKtHosSQ0bRz-1xVPqA":{"text":"Seriously, keep walking through the bar, it really is in the back! \n\nI did what I'm sure m","useful":0,"cool":0},"CVXVfQcnlcYHRH3bjnj2WQ":{"text":"You can get one of the best Poboy sandwiches here. Vegetarians can also have an option whi","useful":0,"cool":0},"ncWvYWdZPsGMnLuZHrDKig":{"text":"I was pumped to try a local bar with local food!!    On our first night into NOLA, we were","useful":0,"cool":0},"6QL18wi-bDFvTMGxv9Wg_A":{"text":"Type. . . . . . . . . . ..Banh Mi / Poboy Secret Liar\nLocation. . . . . . . ..Secret Liar ","useful":0,"cool":0},"5iqlxANSCJOyjqGFOZ2QNw":{"text":"Hidden... yes walk to the back of the bar... OMG SOOO YUMMY!! the girl working was great..","useful":0,"cool":0},"OopOzV9CHRqypo0vX2Un4A":{"text":"High-minded po-boys.  The coriander-lime shrimp poboy makes my heart happy.  All the dress","useful":1,"cool":1},"0q1Zk9U6tQ9lD7PFeTTKiA":{"text":"What the hell was that beef poboy?  Brisket, maybe?  Whatever it was, it was a shining exa","useful":1,"cool":0},"E7wntmMFoIX33ojq52zDww":{"text":"Tiny little hole in the wall place with \"killer\" poboys. Had the shrimp and it was amazing","useful":0,"cool":0},"LQcAT38vVnoCgVYLRsbmyQ":{"text":"After landing in NOLA I was starving. My brother in law picked me up and he asked me what ","useful":1,"cool":1},"WMq8TN9NSZvTh87EpaCj5Q":{"text":"Not so sure about the hype. I had the pork belly po boy and it was very sweet and had to s","useful":0,"cool":0},"kSWd2N64e5H70EWhW24VXQ":{"text":"Five stars only because they won't let me give it six.  Be forewarned - it's in the back o","useful":0,"cool":0},"BEL5yks-A8K6sIjEBv_7_g":{"text":"Amazing pork and shrimp poboys. Tucked in the back of a bar, you order out or a window and","useful":0,"cool":0},"UrI8bE9uDYtcRXxzl3Zd-A":{"text":"Seating is non existing. It's in the very back of another bar so you will miss it.  Passed","useful":0,"cool":0},"13xu9P1MVjNtEsEoPA_P4w":{"text":"I took my family to the location on Dauphine Street. My shrimp po' boy was fantastic, no l","useful":2,"cool":0},"NjSx1JTHPvG1ZcrSlbvgiw":{"text":"The poboys here are AMAZEBALLS. Killer Poboys is located inside Erin Rose towards the back","useful":1,"cool":0},"Jz2HvMHZG2Qe7kR-OLlfAQ":{"text":"These were our first po-boys so I can't compare, but we thought they were delicious. We or","useful":0,"cool":0},"4ewvpFFS3IA4vDqS61lJhw":{"text":"Poor po boy was on point... And it's not drunk talk.... Bread was toasted and the crunch o","useful":1,"cool":0},"50cPka2OxbEw2g89GVF35g":{"text":"\"How curious,\" is the first thought that came to mind when entering this strange bar. Then","useful":0,"cool":0},"_qvRL3r-LQTWPKBrmiLpng":{"text":"Loved the opportunity to share a shrimp po boy with my two best friends one who is vegan a","useful":1,"cool":0},"aK0UfJrZy9jiO4C9oFVdRw":{"text":"Found this place based on a recommendation from a friend, and good thing because we may no","useful":0,"cool":0},"qhIMrDve2uRmF_r9iS9C0Q":{"text":"This place really IS killer. It's located in the back of the Erin Rose bar - it's not clea","useful":0,"cool":0},"yfM4B47QiiQY2R9Mqfp35g":{"text":"We went here on a recommendation of a local who recommended this place over Acme Ouster Ho","useful":0,"cool":0},"tEfMyWHVZPZAT9aHvOQBVg":{"text":"Probably the sketchiest place I have ever wandered into in search of food. The Erin Rose i","useful":4,"cool":1},"cp9O_UXCV0ulVHyZucRitg":{"text":"As \"hole in the wall\" as you can get.  But those po boys were simply phenomenal.  I don't ","useful":0,"cool":0},"6E3YRhMT18FPRQ5qc68waQ":{"text":"Great po boys. The place wasn't busy when we came so the food came out fast. We had the sh","useful":0,"cool":0},"_jsUiaXCVjEhGul-jW8HtQ":{"text":"This is worth walking thru the dive bar front to get to the ordering counter, you buy your","useful":0,"cool":0},"cX_aBbVXHfb-49SWqwNf-A":{"text":"This place is hidden behind a bar. If you go there, you only have to order the shrimp Po-b","useful":1,"cool":0},"B5UvAfTUIf1c-PRGKKGNzw":{"text":"We read the great reviews on Yelp, and headed to Killer Poboys for lunch. We got there aro","useful":0,"cool":0},"5WfvT4XdPG2C-INyvYGmoQ":{"text":"This place is cool. I came here twice on a recent trip and had the shrimp Po Boy and the s","useful":0,"cool":0},"TPmHhl3TayHbRfm8LGtFQA":{"text":"Saw this featured in NY Times so decided to try it. Overrated. We ordered the shrimp po bo","useful":0,"cool":0},"G6801m00IhUz_yJ5pNrwSA":{"text":"This place was so good we came twice on our weekend in NOLA. I believe they have two locat","useful":3,"cool":4},"7mVvKwBQlqTXf0dyWwGEhg":{"text":"It's an okay but not great little place in the Quarter.  I ordered the roasted cauliflower","useful":0,"cool":0},"ys9Z8vHhlDbu7Zl80lMdtQ":{"text":"KILLER SHRIMP PO BOY. Omg YUM. My boyfriend and I recently when on a vacation to NOLA and ","useful":3,"cool":1},"GR-h2QtnlGCrJWSiiQ5z8w":{"text":"A complete hole in the wall place with the best Po Boys in town. Gourmet flavors from a pl","useful":0,"cool":0},"UPWMk8o3FOF1eBphfkh_Bg":{"text":"The pork belly is fire! The shrimp is decent-needs hot sauce. I split one of each with my ","useful":1,"cool":0},"G74E1iQ3T68hucTzkXeF8g":{"text":"I rarely give 5 stars...but these po'boys were soooooooooo fantastic! I'm a huge fan of th","useful":0,"cool":0},"CNKaNfp04AVhc5n8i6zRiQ":{"text":"Loved discovering this hidden gem. Lots of locals join tourist in a no frills bar.  you ca","useful":0,"cool":0},"SXM4htyP4nCBFzt_46pLSQ":{"text":"This place is literally located in the back room of the Erin Rose bar. The room is small a","useful":0,"cool":0},"ip1Uq79J0QyLSxnky2wL_Q":{"text":"Pretty damn good for a late night bite! I was craving a po boys and stumbled upon this pla","useful":0,"cool":0},"HdHpkjLMaMEOeoB00Lwz3g":{"text":"Located in the rear part of Erin Rose bar, it a hidden gem for poboys.\n\nReading several of","useful":0,"cool":0},"pbLHh81t96srz-0Yv0SSzA":{"text":"This is a small space in the back of the Erin Rose, with limited seating. I really appreci","useful":1,"cool":1},"PcUqJPH2k4Kl9-9BsCa5fw":{"text":"I managed to visit here three times last week. The pork belly sandwich is my favorite--I t","useful":0,"cool":0},"ZUbBb39YpoYcXF4l1WZ1Cg":{"text":"I've been back from my NOLA trip of indulgence for... 24 hours now, and the withdrawal sym","useful":0,"cool":0},"-eyJde5zQtb1dE3SH0CyXg":{"text":"This was our first stop on our culinary tour of NOLA. Got there right when it opened, they","useful":0,"cool":0},"5ciY7Hn7w9Z3YetbQwZElw":{"text":"Stopped in on Saturday night to grab a sangwich while barhopping. My friend and I split th","useful":2,"cool":1},"MkluxcWuv1djkZud_p2zsA":{"text":"Very tasty Poboys in a really cool section of town. The amazing braised greens are worth t","useful":0,"cool":0},"SXw3Ccv1YExmDF-rfgeDxg":{"text":"The shrimp poboy here is really good, but you need to know that you're not headed for the ","useful":1,"cool":0},"-CHX6YgtyuJQALvnnGouOw":{"text":"Don't be fooled: this place is in the back of Erin Rose, a super dive bar. We stopped in f","useful":0,"cool":0},"VmtVVy72wmHKJ2ksmIqPZA":{"text":"I heard a lot about the poboys but I wasn't that impress at all average at best!!!!","useful":2,"cool":1},"TiGn4XpSCKM3-4JaxkQjDQ":{"text":"The best po-boys I've had in New Orleans. I wish I was eating it right now. They put love ","useful":0,"cool":0},"TuzhJimqDPAc8MIPfLXmEg":{"text":"Beer in the front, poboys in the back? I imagine heaven is something like this. I'm a vege","useful":0,"cool":0},"rbx6vEXgjc6m_O1Mxx79Bg":{"text":"Incredible! The special was a spicy lamb po boy with homemade tzatziki. Amazing! They defi","useful":0,"cool":0},"DWfjzhFZE6U__DNyALzoWA":{"text":"Was not impressed with my lunch from here. First, the menu at this location is limited..fi","useful":0,"cool":0},"Rv_jcNFZBDWo3Ds4Zh33XQ":{"text":"Literally a small dark room in the back of a bar with a single high table in it. We would ","useful":0,"cool":0},"1cyX66nTJFgto-COm8MmyQ":{"text":"It is well worth seeking out this out of the way place, tucked in the back of a bar. The s","useful":1,"cool":1},"pEXbPZIH26Q4DZV-q-C1TA":{"text":"I used to think good poboys in the quarter didn't exist. I always recommended other shops ","useful":2,"cool":0},"GU5d0-aTJ9U0BIou1DWjSg":{"text":"We got the crawfish poboy with gumbo and we only ate the poboy. The gumbo was ridiculously","useful":0,"cool":0},"N-3zTQWP9bzT5NTPcYWzNg":{"text":"This place is somewhat hidden in a bar in the bourbon street area. Somewhat surprising for","useful":0,"cool":0},"3bq5tY3aRCuppXNU8W-ZuQ":{"text":"Amazing poboys! Unique flavor combinations. I got the shrimp poboy, which was like a bahn-","useful":0,"cool":0},"5JQ41PkPqCBhKKnIUCTIGA":{"text":"I heard about Killer Po-Boys from Gambit, and it didn't disappoint - other than my first s","useful":0,"cool":0},"slaSRcuTvBbkz1aXCFj-Fg":{"text":"Messy and tasty. I had the sweet potato po boy. The sweet potatoes were roasted and it had","useful":1,"cool":0},"NRtNW5K_LvwLPO4fBJgeJA":{"text":"Killer Poboys is tucked into the back of Erin Rose Bar.  There's a small window through wh","useful":1,"cool":0},"EaerLvdzpzHMyPQfLWYwZw":{"text":"Walk in the bar and go all the way to the back it's a small room. We had the pork belly po","useful":0,"cool":0},"RI1CUKszkA_lymky_RpD5g":{"text":"We were recommended this place by our Crescent City Bike Tour company.\n\nIt is located in t","useful":0,"cool":0},"yzMehUeq5bpJAV-VnN_BAA":{"text":"Cool Poboys. I got the pork belly one, and yes, it is too fatty. Even with the warning fro","useful":1,"cool":0},"kFKT0oS63bj_qhKgvJwT0g":{"text":"If you were thinking the po boys here are like your traditional ones then you would be mis","useful":0,"cool":0},"HPKvaAF-mSWBGd0hHLYxQQ":{"text":"My friends and I were in town visiting from LA and decided to stop by Killer Poboys before","useful":2,"cool":0},"2FYIvOvbT157J6UTJdHHkQ":{"text":"Hard place to find, look for Erin Rose Bar, it's located in the back. We had the Shrimp  a","useful":0,"cool":0},"aJK4Vhg3JeeGwpiBnU53wg":{"text":"The shrimp poboy was good, the pork belly was too fatty (not cooked enough) for me.  Both ","useful":0,"cool":0},"5m53k-4xO4FcCkcLLhpFng":{"text":"Excellent Poboys and even better with an Irish Coffee from Erin Rose.  I always get the Sh","useful":0,"cool":0},"43DeigyZKaEpcD6eqrtsCA":{"text":"Hidden in the bar, Erin Rose, it is a small hole in the wall place. \nDidn't try another Po","useful":0,"cool":0},"ch-kREFcqlgcq57fKto-iw":{"text":"This place is fantastic. They have a veggie po-boy that is fantastic, as well as many sala","useful":16,"cool":13},"0Je3dhhUM7FaHMTIBViFnQ":{"text":"Stopped by to try a po boy while here in NOLA. Read a lot of good reviews so got the pork ","useful":0,"cool":0},"yfLnjiMjHPAmE8kElgGuqA":{"text":"First order of business when I get to New Orleans. Mission find a po boy. Yelp to the resc","useful":0,"cool":0},"1LC8yAei69L-xiy0vQWRtQ":{"text":"Killer Poboys didn't meet my expectations, unfortunately. I got the BBQ Chicken Confit wit","useful":13,"cool":6},"JrDQeImgUviRhdQWDDU-rA":{"text":"I can't believe this place is so highly rated on Yelp! My shrimp poboy was soggy and just ","useful":0,"cool":0},"K8WIot-5Jts_9H2K0v6VnA":{"text":"I tried the grilled shrimp one, and it was like bahn mi and poboy had a super delicious lo","useful":0,"cool":0},"wa5oobIJyABQ5k-kjNkJ7Q":{"text":"Would give it 10 stars if I could...... Love the Ginger Pork Belly Po boy.... The best thi","useful":0,"cool":0},"0sUJSk8Iv0TFiv5TTe2TYw":{"text":"I must say that I found out about this place using Yelp. I used to live in NO but left abo","useful":3,"cool":1},"ITThepe5781E0AmT0H1Eqw":{"text":"Killer Poboys was my very first stop on a 4-day trip in New Orleans. Ordered the gulf shri","useful":3,"cool":3},"FqAwlCOs4q0x_oWxqHuifQ":{"text":"My one complaint: Very skimpy serving. I had the roasted eggplant poboy, and there was jus","useful":0,"cool":0},"4jgky6pxh8aSrweUcDziRg":{"text":"Holy crap - I thought I had tried everything worth trying in NOLA and then came across Kil","useful":0,"cool":0},"7-RWvJ-02oBVp6T6bqgHJQ":{"text":"Excellent atmosphere and the best dam shrimp poboy EVER.","useful":0,"cool":0},"lcKxMvPBEXn--HvFI8oO1w":{"text":"Great sandwich. Wow. The shrimp poboy was great. My wife had the meat loaf. I thought it w","useful":0,"cool":0},"ZeVv__v9QgZ1-2v1XKDYuw":{"text":"Absolute best po boy in New Orleans! We got the grilled shrimp version.  It's a bit hidden","useful":0,"cool":0},"u1fy2BHbkC9ITsm-munGcw":{"text":"Worth the price and to the point in taste! We stumbled upon here last night and had the po","useful":1,"cool":0},"y5OrLtdMSYUlcuyayD3cFw":{"text":"a great find in the far back of the truly dumpy Erin rose bar.  don't let the front bar fo","useful":0,"cool":0},"SUWq8EFWNedfKkmBq9tKWA":{"text":"Small area in thr back of bar, lots of good and bad stuff, very small place, have to be 21","useful":0,"cool":0},"7-ORWbsjvOpJUOAD-Sh69g":{"text":"Yuuummmmm! What a great lil hole in the wall! Was a lil tricky to find (in the back half o","useful":0,"cool":0},"IUPZc32pulLKrxTGpkswZg":{"text":"Like others have said, not really a true po-boy. Had the shrimp & it's definitely a bahn m","useful":0,"cool":0},"CtVJVlkIEIPbmk9Z1fSV1A":{"text":"I've had their poboys many times. The grilled cheese and pork belly are excellent. I had a","useful":0,"cool":0},"_nV0rv0wMhZheQJUgb9-Zg":{"text":"This is the best poboy I've ever had!  A modern twist to an old favorite. You won't believ","useful":0,"cool":0},"BZeeyaSwROVv_jWG3w0EMg":{"text":"Amazing po boys. The bread was fresh and perfectly crisp. We had the shrimp po boy which w","useful":2,"cool":1},"8vqBi7dDJpkH_4zMyKlIBg":{"text":"Walked over and picked up a Dark n Stormy Pork Belly Poboy to go. Delicious. The Ginger an","useful":0,"cool":0},"BTQ8xwRGG5Wu2NmKyWiVTQ":{"text":"Sweet Potato Po boys were amazing! Nice little hidden spot in the back of Erin Rose. The f","useful":0,"cool":0},"jFW8CH0ZOXr6fkFIH_CVVw":{"text":"Shrimp Poboy was amazing! Agree with the review if you're looking for a traditional PO boy","useful":0,"cool":0},"mWSuOL1A9cY-mCATQOL1Xw":{"text":"Great place! Vegan options were very good and the staff was friendly. I definitely plan to","useful":0,"cool":0},"iWoZc265tNy-8AxAvs8QKw":{"text":"I am not a huge fan of many eateries in the Quarter. There are very nice restaurants (whic","useful":6,"cool":3},"t71FV2WhtVsqYrDvc_GKlA":{"text":"Noticed this place on my bicycle when riding down Dauphine on my way to Canal St. \nStopped","useful":0,"cool":0},"BB9u13LFRrvFUOMQW0GqqQ":{"text":"Went for a late night craving run and these guys delivered! Not only are the Po boys great","useful":0,"cool":0},"7qj2KiTHtktHTllNd_pLaA":{"text":"We had the Dark & Stormy Pork po' boy which was excellent. The place is in the back of Eri","useful":1,"cool":1},"tmnL5giuf8IAQ_zLJ_Wd9A":{"text":"We had the coriander lime gulf shrimp po boys and they were excellent! Here on vacation an","useful":1,"cool":0},"Bqz59Ix8yuZ9QCpJexPibA":{"text":"Good night!  These bad boys are the bombdiggity!  That's a technical term for they're frea","useful":0,"cool":0},"V6PQ3QiAsrRJR0MfZUKpcg":{"text":"It is sometimes an impossible task to find a menu embracing any sense of originality in th","useful":2,"cool":3},"MgD5RIdysRtYVSK7lB9njQ":{"text":"Amazing, fresh take on the po' boy. Their food focuses more on flavor than fried. The shri","useful":0,"cool":0},"CO4uAyy3IdhRqSBQmuEqZQ":{"text":"A true local place that can be hard to find. They do very few menu items, but what they of","useful":0,"cool":0},"y1XODHtnXzWesxSBY0IbCQ":{"text":"The poboy was delicious, like a hybrid between a poboy and a banh mi. The space itself is ","useful":0,"cool":0},"sZtCupTjn31lE3mYEDhAJw":{"text":"Gulf shrimp po boy is out of this world! I flew here just to have one recently. Perfection","useful":0,"cool":0},"O_zsjqQEE9CEtF-FOzQpeA":{"text":"I am a local who works in the Quarter.  Just got the eggplant poboy and the sweet potato s","useful":0,"cool":0},"UB_I1_NvTSdaXRbxcq1RFw":{"text":"I have been a big fan of Killer Po-boys since it first opened. The food is just out of thi","useful":0,"cool":0},"MGCtCFPBS7NS7oI4qAG43g":{"text":"Strongly recommend you skip. This place charges $10+ for a sandwich and does NOT devein th","useful":0,"cool":0},"LjcEcs_vaRYsQKd2UOssIg":{"text":"I was skeptical about going to an Irish bar for my first po boy, and was warned these woul","useful":0,"cool":0},"nwQ7DnNCCzrtumYd6gtSLA":{"text":"Absolutely loved the shrimp po boy here. They don't fry the shrimp, which is how I prefer ","useful":0,"cool":0},"8TuG9z91E3SWye3UQy4GRA":{"text":"Had the cauliflower po-boy. It comes with an amazing romesco sauce. The cauliflower was pe","useful":0,"cool":0},"_QEtjFyK2tIgMmN1tQExLw":{"text":"I really wish they had one of these outside of New Orleans. I was on vacation there for on","useful":1,"cool":0},"uSy3gTHKha6bNgeCUt3qEA":{"text":"We came here for lunch on a Sunday- had a little bit of a hard time finding the restaurant","useful":0,"cool":0},"YIL8nwPIgAN37XDxdD1eCg":{"text":"That shrimp po boy sure was good, but damn is it pricey....\n\nI had one shrimp po boy with ","useful":1,"cool":0},"p0Gcomh_JrhMHgDByyfpbw":{"text":"Some of tastiest food hidden off the main drag. Grilled cheese made with Irish wiskey...so","useful":0,"cool":0},"7BhgA-3K-dnzayLyAtcEWg":{"text":"Very happy with our decision to grab Po Boys at Killer Po Boys. I am New to NOLA, so I was","useful":1,"cool":0},"kaa-d45P_M_J4ZaXs3YvMQ":{"text":"In order to get to killer po boys you have to walk to the back of the bar. Once you get th","useful":0,"cool":0},"NgDfL4RNtEcHUwuhwWUpkg":{"text":"So delicious! The menu was really inventive and the specials all sounded tasty.  I had som","useful":6,"cool":3},"r5vKFZ0vShwr7P9pVjedVQ":{"text":"Expected a bit more but the grilled shrimp poboy was still great. The place is tiny so if ","useful":0,"cool":0},"R6iulD0tBIMkmEvn96sXVA":{"text":"This place is tucked away in the back of Erin rose bar.  They open at noon and I recommend","useful":0,"cool":0},"8QrGT_BIiVBgOiNvPk3idA":{"text":"In the back of the Erin Rose, this hidden gem was a pleasant surprise! The \"dark and Storm","useful":0,"cool":0},"cJsEoWM6Nr-9IosZVfl6pQ":{"text":"\"This is my favorite place in the French Quarter!!\" - the bf, who recently moved to nola 6","useful":0,"cool":0},"K4Tu3T1jJQSPE8-4s_v81g":{"text":"You won't find killer poboy on the outside of this whole and the wall bar but You will fin","useful":0,"cool":0},"VgxkeJL7w30F-AIQQn7JFA":{"text":"Amazing! Killer Poboys isn't had to find if you know where to look. Walk in the Erin Rose ","useful":0,"cool":0},"LTVz7MKmVaazT0agkzbtmQ":{"text":"Delicious! Awesome, unique poboys in the back of one of the coolest bars in New Orleans. T","useful":0,"cool":0},"98UY63KSDO4rd_ql2-kfZQ":{"text":"We LOVED this place--found it through Yelp on our first night in NOLA.  It's tucked in the","useful":0,"cool":0},"m7AKt-CSsGgj5uNgCcHP3w":{"text":"I had to leave my first yelp review because the grilled cheese sandwich was just that good","useful":0,"cool":0},"WJarmWe3Za59kyg5uao-Gg":{"text":"Got the shrimp poboy. For $14 I expected the bread to be a little better. Tasted a little ","useful":0,"cool":0},"ZzEDFndk0PFiHeOc2WUmDA":{"text":"This was one of my places in New Orleans. I stopped in for po boys here twice while in tow","useful":0,"cool":0},"gWcab6EHO49qBRyOoagIQg":{"text":"We had a shrimp po boy here, and it was truly delicious. They only accept cash, and it is ","useful":0,"cool":1},"URl681RTZqKuJj-LFDi5-g":{"text":"I have been meaning to try Killer PoBoy for along time but could never make it to the back","useful":0,"cool":0},"x_uuvZKYoAy0h0RMy-2fFg":{"text":"I did not enjoy the shrimp po boy but I especially did not enjoy the service.  I was a hea","useful":0,"cool":0},"JACLT50jsnYw3TYuCd4nrQ":{"text":"I totally would have never found this place if I had gone by myself, but some locals broug","useful":0,"cool":0},"9607lWmyPV7FF5IBZB_nUA":{"text":"This place has the best po'boys!  Service is great and the food is mouth-watering deliciou","useful":0,"cool":0},"0DXp1_KF5crEbB7xZjABXw":{"text":"Second visit, just as delicious as the first.  Friendly service & great quality food.","useful":1,"cool":0},"MhZp5H2Sus6CCNAZBSCq7w":{"text":"A hidden gem, literally! Hidden in the back of a bar, this is why Yelp exists because I wo","useful":4,"cool":3},"6Tsc-Ec0YYZPQ1-89vKd8w":{"text":"Delicious shrimp po boy. Food served quickly in the back of Erin Rose bar. Service was sup","useful":0,"cool":0},"FBtW51AIW6MOJ7FsoUoqWg":{"text":"Amazing. Don't come here if you want a traditional Po Boy, but if you like fun takes with ","useful":0,"cool":0},"lM3fE6U5NxlJKyraNuqRYA":{"text":"I almost hesitate to review this place as I want it to stay hidden like it literally is.  ","useful":0,"cool":0},"vwyQkF38Y1rjB93tN3fgRA":{"text":"Shrimp poboy was good but it tasted like any other Vietnamese sandwich.\n\nFor $14 I would e","useful":0,"cool":0},"fZ-7N0wM1_v8JIjKw-4t6Q":{"text":"Very definition of a hole in the wall with top notch poboys.","useful":0,"cool":0},"O3RaENV9U4MMq939f-mF1A":{"text":"For $9-12, you will have one of the best Po Boys in NOLA, if you can find the place at the","useful":0,"cool":0},"96Dd9M-YdlLtkBIvpR-zCQ":{"text":"Best vegan poboy in the city. I highly recommend the roasted sweet potato po boy and roast","useful":0,"cool":0},"7QxHFlrntmvaFm0xHAphJA":{"text":"Very disappointed in my grass fed meatball Poboy on Sat...used to order from there all the","useful":1,"cool":0},"jH4Ss_6f-hfK-YOBYxJfog":{"text":"Pretty poboys are just sandwiches. I wasn't too impressed with the sandwich. However, the ","useful":0,"cool":0},"zSoCBFGWim5q2mWRFM2aNw":{"text":"Four stars just for the gulf shrimp po boy!  We tried the pork belly, braised beef, and th","useful":1,"cool":1},"geuOCWLpNnEsr7pqOsUJ9A":{"text":"Ugh, overpriced and overrated. \n\nThe coriander shrimp poboy was in all ways a bahn mi. It ","useful":4,"cool":1},"EhRXlnjYqpZS2jZ2pXE0OA":{"text":"The service was wonderful; the girl taking care of us could not have been more pleasant, w","useful":1,"cool":1},"3iOtCbXLt-LPHkFjc99pEg":{"text":"My boy friend and I grabbed two poboys for lunch, and they were amazing. He got the braise","useful":0,"cool":0},"oTeABa_iMhyYDM_cqXxF_g":{"text":"Tried the shrimp poboy for $14... I think the reviews are a little over inflated on this p","useful":0,"cool":0},"QeuOLZAalcAQyve1TXtBdQ":{"text":"Just might be the best po'boy you've ever had!\n\nModern twist for an old favorite. Innovati","useful":0,"cool":0},"kcY8BtkAznUtKI7Z9Rvk2g":{"text":"My first stop in NOLA was for a traditional PoBoy and I came to Killer Poboys as a recomme","useful":0,"cool":0},"5j0IfxfmW78tuJlwqpwB3g":{"text":"Wow. I've come to realize that the best food in NOLA can usually be found in the most obsc","useful":0,"cool":0},"bJOyFDhbbN1Gm6XC9ow-Sw":{"text":"Good creative sandwich. I'd up it to 4 stars if I had another to sample as that would give","useful":0,"cool":0},"0JYmXVfRQaW-obY-JgBa8w":{"text":"This had great reviews but we thought it was just ok. Location in the back of the bar was ","useful":0,"cool":0},"2FUVxs5TEf41w0o6jjflBA":{"text":"Excellent PoBoys, amazing service, a bit hard to find, go in the bar and head all the way ","useful":0,"cool":0},"Xgzm0U1iw0yMcKpqJKd3PA":{"text":"Hands down the best thing I ate in NOLA. I ate the shrimp po-boy and my wife had the pork ","useful":0,"cool":0},"G2QBkRXTQsifu9xzyzVM6w":{"text":"All I can say is that my po boy was f*cking amazing! I got the shrimp and my boyfriend had","useful":1,"cool":0},"bz-0Ylg374k2fHEia_ghBQ":{"text":"We went to Killer Poboys since it was a block from our hotel and had good reviews. We orde","useful":0,"cool":0},"_jtJkpOzUQyGKjzHbvkzug":{"text":"My friend and I ate here when we were in town for Jazzfest. It was very close to the Dauph","useful":1,"cool":2},"kZdQW6HJLhqCVJey7FC7mA":{"text":"Hidden at the back of Erin Rose is an awesome Po'boy stand. Great sides, bread and fresh i","useful":0,"cool":0},"T0dp5kSBArK_JQ4s4P8nTQ":{"text":"The place was a little hard to find since it was in the back of a bar, but I ordered the p","useful":0,"cool":0},"cQCDmyj3KdYJnKdFiz-WUQ":{"text":"Excellent service and delicious grilled shrimp poboys!  Skip the rude and slow service at ","useful":0,"cool":0},"UkYI1y-XPDcXQSmEZvnEJg":{"text":"In NOLA for a short time, and I wanted to get a po boy. I thought about heading to Parkway","useful":0,"cool":0},"bsK0ezPgm99SBH-CiE9IRA":{"text":"The only complaint I have about this place is that the sandwiches were a litttttttle small","useful":0,"cool":0},"wpqhl_xgHMZnSdGquxSSuQ":{"text":"Awesome stuff, and the bartender from new england is the best.","useful":0,"cool":0},"en95EEIizfqcdlYdYBsoxw":{"text":"The shrimp po boy was so good! Fresh, delicious shrimp and soft but crunchy bread.  The fo","useful":1,"cool":0},"mi3W0JZAa1b85pjqqZExUw":{"text":"Just had the pork belly poboy. Oh wow....","useful":2,"cool":0},"adWaLQ_fQb6kDn2-po3kdA":{"text":"This place is a hidden gem. Not the easiest place to find and isn't at all visible but if ","useful":1,"cool":0},"_e8irxOy6GV-EuG3jUNxOA":{"text":"Giving 3 stars cause you don't have to walk far to get a drink. Otherwse the stools hurt m","useful":1,"cool":0},"XF59k1Swg63c-rGiPeh7rA":{"text":"Shrimp po boy was awesome, wish we would have gotten the meatloaf one but...got the pork b","useful":0,"cool":0},"RyIPZPGCWKPB1ZRfJ_4tPw":{"text":"When I walked in, I was curious. The poboy shop is basically a small room in the back of a","useful":0,"cool":0},"5mMR2Qh5b-CDE5syppO_FA":{"text":"This place is a unique way to grab lunch in New Orleans. As other reviews share, it is hid","useful":0,"cool":0},"-fXGjkFZSsOHhxknjyS0Bg":{"text":"What a great find this was!  The grilled shrimp poboy was by far the best thing I ate duri","useful":0,"cool":0},"vvPnvS0lp6vqFH3wzZzkQg":{"text":"Came back and had the pork belly again. Apparently they aren't consistent, which is unfort","useful":0,"cool":0},"x5wZhl4EfJp8XZETPnZ_9g":{"text":"Just had the shrimp PoBoy and boy was it intense. (Pun intended) it clearly stands out wit","useful":0,"cool":0},"rljuPl3qoelr_-DDN27AuQ":{"text":"Easily the best pork belly sandwich to grace my palate. Honestly, I'm sad that I finished ","useful":0,"cool":0},"5XbUEe07uuctOQvh-foIWg":{"text":"We were wasted and starving when we came here.  Probably wouldn't have found it unless we ","useful":1,"cool":0},"PNkjXhyGCZrN9dhf-r-1lg":{"text":"Most people have the po boy, but I actually went for the grilled cheese and had a dang goo","useful":0,"cool":0},"A7SoM7yXhyNm3nXFYRUNpQ":{"text":"This was the best surprise on a recent trip. Popped in late afternoon for beers in front. ","useful":2,"cool":1},"OtJcafGHX6kL54yaDSCb9A":{"text":"A great place to chill and eat (and drink at Erin Rose) if you're in/near the French Quart","useful":0,"cool":0},"atk8QNLTROMiPSS-IpY02g":{"text":"Great local bar with a room in the back where you can get food. Nice dive vibe. Great plac","useful":0,"cool":0},"m7gj0nUJYBuBnLNBUDHRYg":{"text":"What a weird little place.  Luckily, we got here at 12:00 right when it opened because it ","useful":0,"cool":0},"cJf6-sG9z-6seZodwH5l4w":{"text":"KIller Poboys!!!! Not a misnomer. They are killin their competition on a daily basis. That","useful":0,"cool":1},"d0NQs6B2pzwr2Pc8ulMr7w":{"text":"My family was expecting great delicious food but was definitely disappointed beyond belief","useful":0,"cool":0},"ZqckX9VW_O3nxxewWbo6Zg":{"text":"My boyfriend and I found this spot based on yelp reviews and are glad we did. We'll take l","useful":0,"cool":0},"LuNFPHDZJZb8LjjQUW-q7w":{"text":"Killer Poboys, to me, is the epitome of why yelp has become such a helpful tool! A little ","useful":0,"cool":0},"au21yohf20KZ0L8hoGiGhQ":{"text":"Hidden in the back of the Erin rose, we stopped here for lunch, having the pork belly & me","useful":0,"cool":0},"pbs3loBu9JksWb156yBtsg":{"text":"Unreal.  People who don't like the pork belly prolly didn't understand what they were orde","useful":0,"cool":0},"RsKgdA2LBfi4TMq9Z3lvUw":{"text":"I was not impressed by the dark and stormy -the meat was tough. Maybe I was there on an of","useful":0,"cool":0},"a3KnVnjxA30RyfK3NeNyTQ":{"text":"We decided to try this place on the recommendation of a site that lists vegetarian and veg","useful":2,"cool":0},"176LUXKODISJkxZs3bDGhQ":{"text":"Freaking amazing po'boys I got the shrimp, it was pretty great, maybe a little pricey. The","useful":0,"cool":0},"MSDSiK9s6OWM7_TEZUAthA":{"text":"So our group of 6 tried 3 kinds of these \"killer po boys\" and we left 0 for 3 for the expe","useful":0,"cool":0},"SPR-IhUcBRxyg927sNg88w":{"text":"First off Killers is = CASH ONLY... now this is not a traditional poboy. this is a fusion ","useful":0,"cool":0},"_VqPBmW4yb0tIj17ovz2iw":{"text":"Oooooooo, Killer Poboys! I certainly like you. Can we go steady??? ;-) \n\nI haven't had any","useful":1,"cool":0},"NT-34iE8wH5LFNTg2J1hVw":{"text":"Just get the pork belly poboy. Yes it will be fatty and greasy but it is so tasty. I am so","useful":0,"cool":0},"d1gGyQ_G-A2KBCm3tPjKUQ":{"text":"Thanks Yelpers!!!  Totally walked by this place twice before reading that it was inside Er","useful":0,"cool":0},"y_nZZVL1fXLj4nur1UMGgA":{"text":"Killer pork belly sandwich, great veggie options for my wacky vegetarian friends, nestled ","useful":0,"cool":0},"qhUGTjFZ6RWh6tZXG_HXoQ":{"text":"I went to Killer PoBoys my last day in New Orleans.  I had been searching for the perfect ","useful":0,"cool":0},"qZ5gmSlZPLDUtVDPlZdHRQ":{"text":"I was really craving a fried shrimp poboy and came to this place late at night because it ","useful":1,"cool":0},"LZZcqitaEiHj_MYBitPvvA":{"text":"Amazing. Got the dark and stormy, loved every minute of it.","useful":0,"cool":0},"H4pbaSwwq1kxyQ4VfskTcQ":{"text":"The best poboy I've ever had! I had the Pork Belly and it was life changing! Friends got t","useful":0,"cool":0},"rZ1OBZmuLaGhUATfbIwE5w":{"text":"Good old boys drinking Pabst, unaware hipsters everywhere want to be just like 'em. Except","useful":0,"cool":0},"hx6d5eG_4NfnuLnMmHVfng":{"text":"Killer Poboys is located in the back of Erin Rose. I shared the shrimp poboy. The sandwich","useful":1,"cool":0},"JjMfOi_pOCaKxVlHvslvAA":{"text":"We were too scared to go in here last time. We are stupid. This place crafted sandwiches t","useful":2,"cool":1},"E6rIMSTQ7yAYBC0Oq4J14w":{"text":"Dang, shawty. You're a star.\n\nHi, I'm a California girl--born and raised in Los Angeles. B","useful":3,"cool":1},"dLE4d4H9hEG_h9OQjSPlPA":{"text":"tried there shrimp po boy.\nI would say it is a hybrid of a Vietnamese sandwich (shredded c","useful":1,"cool":0},"ROt_hFZf_R9nWknWuIcgYg":{"text":"This place is a bit hidden in the back of the Erin Rose. These poboys are LEGIT! This is a","useful":1,"cool":1},"0dTdZgCKtY0QWJDH6j05Kw":{"text":"Delish! We ate at the one inside Erin Rose bar and I loved the shrimp one!! The shrimp was","useful":1,"cool":0},"bQpWewbJMJb3owMotoxb_g":{"text":"The name seems misleading. While I enjoyed my food here because the sandwiches had balance","useful":0,"cool":0},"Is6HGlAXCyeQROATH7JSDA":{"text":"Probably the lamest thing I ate while in NOLA. The pork belly po boy aka raw bacon on a ro","useful":4,"cool":0},"pZkxp3Izfc0lQhR5OngLxQ":{"text":"Omg!! Sooo good!! Tried the pork belly poboy and the shrimp. They were both DELICIOUS!!!! ","useful":0,"cool":0},"DQNoTVBYU-OO0ZBDHTYeYQ":{"text":"If you're here for a classic poboy experience, don't come. If you're here for a mighty goo","useful":0,"cool":1},"07Jy8WdJd1fq2-OP1_vczA":{"text":"Just ate a pork belly poboy at Killer Poboys on Conti. What a disappointment! Our sandwich","useful":0,"cool":0},"3D6DDXCABXVzE-6fpsyPfw":{"text":"A short walk through the Erin Rose bar brings you to little alcove where unique and delici","useful":1,"cool":2},"0WQPrd85hSpVt-5pvpYeLg":{"text":"dope spot behind that irish bar and MAN what a tasty delicioys po boy!!! dont waste your t","useful":0,"cool":0},"pkBV_XPePylkkmKYDM4-zg":{"text":"Small dive but well worth the stop.  A very limited menu but when it's done right that's a","useful":0,"cool":0},"xSvU0v3LA63AmwYP911rAg":{"text":"My boyfriend and I stopped in on our way home after a day of being out and about, and we w","useful":1,"cool":1},"6ObR8KlcVWaIPXMr8sWMHw":{"text":"Why does this place have such a high rating? To begin: it was impossible to find this plac","useful":1,"cool":0},"jF8H-h6OKD2gQElYJ5nPFA":{"text":"po-boys  were delicious. I ordered the shrimp and my husband got the meatloaf. Both were a","useful":0,"cool":0},"En-sfJc-bB9MIciAMDT5lg":{"text":"Our last full day in NOLA And I was craving good Po'boy since Johnny's was such a disappoi","useful":0,"cool":0},"QfgEUbLqPvltphsvYHlryA":{"text":"This place is really inside a small bar called the Erin Rose.  If you go in and go all the","useful":0,"cool":0},"0pOObIxLxyzhOS7RaoMY_g":{"text":"I actually had to come here twice in order to their delicious shrimp poboys. The first tim","useful":1,"cool":1},"1yjPmzk62hhYkwI6VTogXQ":{"text":"I had a flight to catch from New Orleans to California and a massive Po Boy craving.   I d","useful":0,"cool":1},"0NLfLYYMlySVSC3wWq3VOA":{"text":"We stopped in here because the reviews were good, but we were disappointed. The 'pork bell","useful":0,"cool":0},"8Qnl6og6XfGEIpaZy6n-6g":{"text":"Wanted to try killer poor boy for awhile.  They have a second location on dauphine st. I g","useful":0,"cool":0},"7TjMfbQ4S9-xf2vNMu3JDg":{"text":"I had the shrimp poboy. The shrimp was really good, but I was less than impressed with the","useful":0,"cool":0},"bg8GWwGyCUHp3Fa9SYaHYw":{"text":"Cool little spot located in the back of the Erin Rose Bar...it's small and dark, perfect p","useful":1,"cool":0},"dmtdgycuWdFgaPPDwdFaBQ":{"text":"Came here based on the glowing yelp reviews and was not disappointed. Head to the back of ","useful":0,"cool":0},"jtgFdGZezJx35Kbej4kYnA":{"text":"First Yelp post - Totally amazing Po boys and the location is great.  Went three times in ","useful":1,"cool":1},"JJ0bbs0RhWaN7HIPEPt7_Q":{"text":"One of the most original poboy producers out there. The lamb is incredible when they offer","useful":1,"cool":0},"sMjC-eAXeMjn8KvUbf1Rkg":{"text":"Killer Poboys is a rare gem and literally inside a hole in the wall.  \n\nThis restaurant is","useful":0,"cool":0},"preobUR_WlLa-OWWrAuJaw":{"text":"This place is in the back of Erin Rose Bar without any indication of it in the front - so ","useful":0,"cool":0},"KjK75l0L9CX_ZcMky57qvw":{"text":"Heard about these sandwiches the last time I was in town but unfortunately, they were clos","useful":0,"cool":0},"0C9kE41flvOfPFqWqH4Xgg":{"text":"I came here with my meals basically already planned out. Armed with Bon Appetit with a sec","useful":1,"cool":0},"wRdnjLlzWZ-4RRSaGGlGWw":{"text":"I was really excited to try Killer Poboys based on all of the reviews. While I enjoyed my ","useful":1,"cool":0},"xInWPMtqlaPXB7d6yFIXPQ":{"text":"Serving a NOLA staple with Vietnamese charm, Killer Poboys combines high quality ingredien","useful":5,"cool":2},"ux0FkZllnV4_7POgAzqdUQ":{"text":"This place was solid good, 3.5 stars if I could give them.  I got the dark and stormy, a l","useful":0,"cool":0},"k0e7N7ILP9fFGXk1McpNkw":{"text":"Heads up!  This place is located in the back of the bar called Erin Rose.  We almost walke","useful":1,"cool":0},"s83B3O8F8XzoU4XIEbDiZg":{"text":"Bombdiggity.\n\nGot the shrimp po boys and WOW - It was sooo goood.\n\nHot sauce complimented ","useful":0,"cool":0},"ibxir_SC7jtOzHnjBJX__A":{"text":"This place is great. It's hidden in the back of a bar just off Bourbon St. -- and this is ","useful":0,"cool":0},"84LIthV-5F5SWdRgHe-gsg":{"text":"They do not serve \"poboys\"! It is more like a banh mi sandwich. I was looking for the trad","useful":1,"cool":0},"3NMXiyaqkPtB5j32D3qMKA":{"text":"I do not know where to start because i was thrown back by the simplicity yet the overwhelm","useful":3,"cool":2},"ncmR6iZfUoe_iocivMPc2w":{"text":"The shrimp poboy was actually ok, but they were stingy with the shrimp. I counted 3 shrimp","useful":1,"cool":0},"dgVhVqzuluh5krh_yxASqg":{"text":"Don't know what people call expensive except for the shrimp poboy which depends on the mar","useful":0,"cool":0},"XlHyuuhljK-a0nxwfkrV4A":{"text":"I kind of wish I didn't order the pork belly poboy. Knowing my healthier eating habits, I ","useful":1,"cool":1},"npgAGYGoXOU3Iju9P-kidA":{"text":"This place was recommended by a friend and I hate to say that I'm still mad at my friend f","useful":1,"cool":1},"-QSlLaWhRBFGYjjCDcFICA":{"text":"To call this a hidden gem with a limited selection is an understatement.  Read the reviews","useful":0,"cool":0},"JwcioCMD80rprME-uOfdSA":{"text":"PROS_ \nUnique and fun. Very tasty sandwiches and I could appreciate it more being a vegeta","useful":0,"cool":0},"CLUl0tgPG7y6RIetmZtujQ":{"text":"The shrimp po boy is basically a banh mi with grilled shrimp.  Lots of carrot slaw on top.","useful":1,"cool":0},"UPYD-abnwbzfUUM928K7WA":{"text":"I almost passed this place up because they have a big sandwich board outside that states \"","useful":0,"cool":1},"3hpqSJ7qr0JByQnQDa-LDA":{"text":"If you like over-priced, metallic tasting shrimp, this is the place for you! We paid $17 f","useful":0,"cool":0},"ZBA-5Xx8X8iCYq7WqnZk6A":{"text":"Tiny little hole of a sandwich shop in the back of a bar. I think they taste better at mid","useful":0,"cool":0},"0rCPvQAoiAgLhi2-e_L2Cw":{"text":"I expected more.  With Pork Belly and Meatloaf Poboys I had hope to be amazed.  It was ave","useful":0,"cool":0},"_b7bh8Iq1O4z4BIEeksSlA":{"text":"I ordered a dark & stormy. Amazing. Great combination of fatty pork (like bacon), sweet ju","useful":0,"cool":0},"nSw6DAVyEUDt3WNJiWzenA":{"text":"Poboys were tasty. Didn't realize it was in the back of a bar so it was a tighter space th","useful":0,"cool":0},"Kb29Ipm_n7vAJLfCcajTPA":{"text":"Killer Po Boys serves non-traditional po boys from a tiny little window in the back of the","useful":3,"cool":1},"51Wb-e-S-vNtHA-dbGJ65A":{"text":"Found this via a yelp search. Fantastic tiny place in back of bar. Gulf shrimp poboy was w","useful":0,"cool":0},"NXtOsShAuGbw4nlOTCqT2w":{"text":"A real find in the French Quarter!  Tucked in the back of Erin Rose, these aren't traditio","useful":0,"cool":0},"OvPOwiwXenQRow71WGfCLA":{"text":"Oh man, these are seriously the best Po Boys ever!! Split a dark and stormy pork with my h","useful":1,"cool":1},"vnfkHQWOZpVlop0-zgYGsA":{"text":"In New Orleans on business, we had precious little time to actually take in the local sigh","useful":2,"cool":2},"tkPoTDEnZihrT3QsHacJ5w":{"text":"Best Po Boy yet and ready before I got my Guinness.  Super nice peeps.  I can't wait to go","useful":0,"cool":0},"TCTqduGhI6dxmg784tbI7w":{"text":"Not impressed. \nAfter a seven hour drive from Florida I was pretty pressed to find a good ","useful":0,"cool":0},"V8BcKjH5-pRfOavybX4c0g":{"text":"This review is about the po'boys from Killer Po'boys only, not the Erin Rose Bar. Read on:","useful":0,"cool":0},"ScqyFVo82nDoJEYDnEnYaA":{"text":"We missed this place the first time we walked by. It's actually in the back of a bar, Erin","useful":0,"cool":0},"HlywWJkH1JeMfZCau4BLng":{"text":"Eating here inspired me to go to the standalone location on Dauphine. Food here is great t","useful":0,"cool":0},"3BlO_SopYRlkpNlywiWlvw":{"text":"Meh. I'm writing this review because I really want to like these Po' Boys and will be visi","useful":1,"cool":0},"5upecpqKhpuu7HCxI9ZHjQ":{"text":"Ate here after visiting the Museum of Death. The line was not long and there was plenty of","useful":0,"cool":0},"i7xvrsNTlvJ0x4XH9CPauw":{"text":"During my visit to New Orleans this place was suggested to my boyfriend and myself by a fr","useful":2,"cool":0},"tr98ZqVlzuM8NiXQ8dtkhA":{"text":"We were only here for one weekend and had a long list of places to try but for sure would ","useful":0,"cool":0},"Tckkdml40OTF3ze-yzOJnA":{"text":"I wanted this place to put me in awe...I ordered the Grilled Shrimp Po Boy to go. I walked","useful":1,"cool":0},"lWOqCmHsdzJU-o_plX3Zww":{"text":"Insanely delicious poboys - what else do you need to know? Get off your a$$ and go here! I","useful":2,"cool":0},"mwxb4xd19bmQzs49P5dYUQ":{"text":"Solid sandwiches. These are \"po boys\" in the local sense, which it seems just means hot sa","useful":0,"cool":0},"b6VDCTT3SskGNcCchQeaQA":{"text":"Go to the back of the Erin Rose bar to order your food. It took me 10 minutes of walking b","useful":1,"cool":0},"arkc0xsT8nfxi7vYMIWLew":{"text":"Couldn't find the place right off the bat. Was stopped, staring around looking for a sign ","useful":0,"cool":0},"7G-l-VXTfaK112DgQWtXGg":{"text":"Killer poboys indeed! The first one I had and have to admit it was one of the best sandwic","useful":1,"cool":0},"8kzQXGxSS0y1Nm5czNZdHQ":{"text":"Maybe it's because today is NYE, but this place is PACKED! Killer Poboys is in the back of","useful":1,"cool":1},"6BXFqpZS38M2rOO5NkIlrw":{"text":"The Dark & Stormy... One of the Top 3 things I ate in NOLA! \n\nHOLY SHIZ BALLS... IT WAS CR","useful":6,"cool":3},"tZevtziCAtSjD-7_miRJWg":{"text":"AWESOME poboys. As others have mentioned, they are reminiscent of banh mi, but that's not ","useful":0,"cool":0},"U1XRdC5HAvRIH56NnZF_Qw":{"text":"I had high expectations for this place. We ordered the beef, shrimp, and sweet potato. The","useful":0,"cool":0},"P0G-W0DQtcAPT22wMWLGtg":{"text":"Excellent pork belly , braised pork on top of a rum and ginger cane syrup with lime slaw a","useful":0,"cool":0},"EMdnPokofLiTCXMLOVJuVg":{"text":"Definitely the best sandwich I had while in New Orleans.  Walk into the Erin Rose, and hea","useful":3,"cool":0},"yE48lUamB9kDr_zwmgUXaQ":{"text":"My husband and I split the pork belly poboy as a snack. It only took about 5 minutes to co","useful":0,"cool":0},"gm16QNosvWlX875faNbI9A":{"text":"Loved Everything About It. The cramped dining area was filled with character, and my first","useful":0,"cool":0},"m9OvSf1jKDczF-8VNXCytg":{"text":"The shrimp po boy was so good! Nice little spot in the back of the bar. Grab an iced Irish","useful":0,"cool":0},"k33AcgwIo6fhmUTGhmA_4Q":{"text":"Po'boys were pretty good, my only criticism is that the bread should be a little soggier t","useful":0,"cool":0},"G-oQK3bkx1h5oR0CSza4RA":{"text":"I didn't know poboys were this good!!! Upon walking in, didn't know what to expect. I had ","useful":0,"cool":0},"ly0UmMkHyt3os4SXoxaq8g":{"text":"When I went to the back of the bar and asked what I should order, I was given the \"this is","useful":1,"cool":0},"0NwE6Zp_FxnRvt5ltV8BcQ":{"text":"This is a dive of all dives. No sign on the outside - look for the Erin Rose bar. Push asi","useful":1,"cool":1},"-sPhC7OSbgtLbKeEsMgILg":{"text":"I was so happy to find a vegan po' boy! The black eyed pea/pecan spread was amazing. A ver","useful":2,"cool":0},"5D9_L76I-CxApZfbumaXqg":{"text":"I just had to create a Yelp account for this. When searching for a place to eat for our la","useful":1,"cool":1},"X8jCj1fM1JckE2oPmF9g2g":{"text":"This poboy place is in the back of the Erin Rose bar, so go inside and go all the way to t","useful":1,"cool":1},"bOe1PEaBttvnL5gMLi2o3Q":{"text":"I was so excited to visit Killer Poboys on my weekend trip to New Orleans, but unfortunate","useful":0,"cool":0},"awtHd3G8-VfStpgCOlKZTw":{"text":"Searching for the best po'boy in town, we found this on Yelp - but didn't easily find it a","useful":1,"cool":0},"QBPO6R3v6_KIn95kmLWVLw":{"text":"LOVE that Killer Poboys is in the back of a bar, it really is a hidden gem! If it wasn't f","useful":0,"cool":0},"bZ1yCTJsqPG5I5iJDtMezw":{"text":"Not the best sandwich of my life but it was still great. I only say that because most peop","useful":0,"cool":0},"vz8dSnLs3hMfO7NETCwKxg":{"text":"Awesome poboys. A little difficult to find at first. Just head to the back of Erin Rose an","useful":1,"cool":0},"CK_ogjI9oalM0dg5-hT-dA":{"text":"If you're from somewhere other than the south these po boys are outstanding! If you're fro","useful":0,"cool":0},"kSaTYH28WL6nRpozclvNww":{"text":"Killer po-boys is in the back of the Erin Rose bar steps off Bourbon St. Had 1/2 of three ","useful":1,"cool":0},"9jj3u0FmPP6CBFmsYeCFHQ":{"text":"Killer Poboys is not your average Poboy spot. They are tucked in the way back of a smoky b","useful":1,"cool":1},"D1u3iqdd03wBBUXd-gEVwQ":{"text":"This is an awesome po-boy shop tucked away in the back of a bar called Erin Rose. We order","useful":0,"cool":0},"g1vg6Ou7_6ZUP7r3VfuT3A":{"text":"Unsurprisingly, I haven't had many poboys in my days.  Yes, I realize that a poboy is in e","useful":7,"cool":5},"0Ud340NDQLToidK9iWvtQQ":{"text":"This place is not a one $ sign place! $12 for a shrimp po boy? Excuse me, it's actually ma","useful":5,"cool":3},"7qoxG3M0rzHEyDTkijWxJQ":{"text":"This is not only an example of, but truly is, a hole in the wall gem.  Tucked in the back ","useful":0,"cool":0},"lTZwZ2MbaRCawdvU6AE8Kg":{"text":"Finally got to go here.  Had been looking forward to it after all the rave reviews.  We ha","useful":0,"cool":0},"xilI-Lgp6I2XdWHThlK_oA":{"text":"The Grilled Shrimp Po'boy was one of the best sandwiches I've ever had. Basically, New Orl","useful":0,"cool":0},"KnVV5nL5IvLBOgfkSgwI9Q":{"text":"I have never had a \"Sandwich\" this good.  Grilled Shrimp Po' Boy is to die for!","useful":0,"cool":0},"0ro2IatJLN3ulSaiMve-Fw":{"text":"Split a shrimp and pork belly po-boy.  Shrimp was very good nice fresh shrimp and tasty.  ","useful":1,"cool":0},"3CV73sUpiiMTyUvU-wCS4Q":{"text":"5 stars doesn't cover it. \nWorried that it was in the back of a bar, I was skeptical.\nHoly","useful":0,"cool":1},"dsg-OurpW0lpdpnhOU-ovQ":{"text":"I enjoyed my breakfast PO boy (omlette and cheddar). It was very buttery and filling. The ","useful":0,"cool":0},"wr2fm3ERtIz1aWwaEM_Npg":{"text":"If you're looking for relatively cheap eats in the Quarter, you're facing an uphill battle","useful":6,"cool":0},"jlUIztKlGjDkJuq8A0eLgQ":{"text":"I've never had a poboy and since Johnny's was closed and Gene's was too far, I saw this pl","useful":0,"cool":0},"uBBvRQnstCsWl16SeX5QhA":{"text":"Walk through Erin Rose bar and you'll find This place. Cash only! For the price, I thought","useful":0,"cool":0},"dbalhOqficn7RjRyRpaEmw":{"text":"Wow !  Amazing po-boys. We had the Jameson grilled cheese - the cheese, bread and the butt","useful":2,"cool":1},"EWDKvZtT8pfyCOJQA_36SQ":{"text":"Great alternative to the standard po-boy. Nice bartender at Erin Rose makes you feel at ho","useful":0,"cool":0},"r2m5NBD9uIdST1_SiSp_dg":{"text":"Insanely good, and hearty without breaking the bank or the bikini. The producers are perso","useful":0,"cool":0},"hhJhldHYcvKjcsfx2oMTfw":{"text":"Instead of a straight review, I'll tell a story. I had a pork belly po here for dinner one","useful":0,"cool":0},"AxBPQCPDLqVAhJIHoGkE4w":{"text":"Very good gourmet style poboys. You have to get your drink from the bar so it's a bit awkw","useful":0,"cool":0},"KBKXPWZ7MgjBklQZzbHmNg":{"text":"Great meatloaf Poboy, pickles were just right.\nWaiting out the rain with Doug Ford.  Paire","useful":0,"cool":1},"wZmI4X8RZZdZuHEtQnKh2Q":{"text":"So glad these guys exist! I was tipped off by a friend last summer and now it's on my list","useful":0,"cool":0},"8-EicNDswfHKxzmSyM5zkg":{"text":"Heard rave reviews......and noticed MOST if not all are folks not from New Orleans. So thi","useful":2,"cool":0},"hvUSvOpd5_TY7FN4l0CTwg":{"text":"My friend Sean and I had a layover in New Orleans, and we had the major midnight munchies ","useful":3,"cool":4},"rcGumtljsh10BVFqGKV_Dw":{"text":"Honestly, one of the nicest guys working the register and cooking up your food. I went wit","useful":0,"cool":0},"w61yNK74q14t3X7B_aLbrA":{"text":"There are Po'Boy spots in New Orleans like you got pizza places in NY. There is one on eve","useful":0,"cool":0},"MrmLt47Svo2wb1fAOdNtig":{"text":"UNREAL shrimp po boy was had. It's a bit of a \"fusion\" type of po boy.. meaning not your c","useful":1,"cool":0},"Z1iZYaOdYTZcHEsET_MQFA":{"text":"Killer Poboys had some amazing sandwiches. It can be hard to find because its tucked away ","useful":1,"cool":0},"KZoTVW93Yeo1xli-Awql6w":{"text":"Make sure you read the previous reviews as to where this is located - inside the bar and a","useful":0,"cool":0},"QzRWswppJAcP7dETR4RArQ":{"text":"A local friend told us to check this place out and I'm glad we did. The location is kinda ","useful":1,"cool":1},"3eExemFRTwAX_QxrKqyCGQ":{"text":"I wish Yelp allowed for half stars.... I would give this place 3.5 Stars.  \n\nI like the sa","useful":2,"cool":0},"nXJVegWZXijxSL0IDsONOw":{"text":"The absolute BEST FUCKING po boys EVER!!!!! This place really knows how to do it!!! Jameso","useful":1,"cool":0},"zjZ-yatwSkli50zaAgTs0w":{"text":"Not what I expected! It sits in the back of a local dive bar. I asked the bouncer outside ","useful":3,"cool":0},"0hjrYUon68kt4L3N6kOxmw":{"text":"Generally this is a Bahn Mi, not a poboy. I had the shrimp and it was good, but not outsta","useful":0,"cool":0},"XP4sHlx8yqYZLqhKA8il8Q":{"text":"Killer poboys! They killed us, we died, and went to heaven! If you wanted premium high end","useful":3,"cool":2},"wrWCpLIyYysBZONDvlkYfw":{"text":"Ok. This place made one of my all time favorite sandwiches and my favorite po' boy in New ","useful":0,"cool":0},"NGz89F8L5Hi1gJmoDLJPzw":{"text":"Heard of this place by word of mouth. It's all the way in the back of the Erin Rose bar so","useful":0,"cool":0},"2dN77dvew1CFHtLDXcNUgw":{"text":"Delicious, flavorful, simple, perfect. Killer poboys. Hidden in the back of the bar. Go on","useful":0,"cool":0},"bPLo6B1V_GUVbUbt378Taw":{"text":"AMAZING poboy!! We heard the reviews so we had to try it but we were not expecting such gr","useful":0,"cool":0},"QKCZli9w7hvnPicPJY1ddg":{"text":"This Killer PoBoys location is at the back of the Erin Rose Bar. It is easy to miss, but d","useful":4,"cool":0},"E3GUYoyNv2a_mCKQpMLwXQ":{"text":"We stopped in the Erin Rose Pub for their Famous Irish Coffee and just as Killer Po Boys w","useful":0,"cool":0},"21oUWVGCD8Qc9V2rM7zegg":{"text":"It's in the back of a bar called Erin Rose and you have to be 21 to enter. Really differen","useful":1,"cool":0},"60f0csVcu7BaCKjw6P1mgg":{"text":"Review based merely on price and taste of two po boys. Service variable was omitted. \n\nShr","useful":3,"cool":1},"UuGwLebIu4U13w3Jb9L2tg":{"text":"The pork belly poboy was incredible!  And they were so nice to wrap up my leftovers for me","useful":0,"cool":0},"HLykzLHNfh4luVyAlS4INw":{"text":"Their pork belly po boy was ok.  Coming from Asian decent, there are just so many differen","useful":0,"cool":0},"Gr_aFnh3NvQV4mBBSJElxg":{"text":"So...I ate my nostalgic poboys for the next few days at holes in the wall. After 3 days of","useful":0,"cool":0},"emZMeYwww_YnMzwIGrapvA":{"text":"We went in for a late lunch! Place was super packed and we expected to have a long wait bu","useful":0,"cool":0},"ys5m-He_0qoZWjxFHybEvA":{"text":"After reading great reviews here decided to go get our first taste of New Orleans,  a pobo","useful":0,"cool":0},"GPRsT76suBf5DSKNhVUjmA":{"text":"I had a shrimp po boy.  The shrimp was very tasty with the sriracha aioli and slaw.  I lik","useful":2,"cool":0},"oN7FFlaRPDvvzu0wmhKdRQ":{"text":"The bourbon glazed pork belly poor Poboy is probably one of the best Poboys I've ever had ","useful":0,"cool":0},"-gK_GbP_74IQeW4c4bghyQ":{"text":"Oh man this place was awesome. Not only was Erin Rose, the bar next door, already a great ","useful":1,"cool":0},"ZG3gSTeotVlUnkYawMc4ZQ":{"text":"Not a fan.  Pork belly was like eating flabby shoe soles. Shrimp was very, very fishy tast","useful":0,"cool":0},"UeEi1VgHK4JNk2-RDymUiQ":{"text":"If you are a foodie and want something beyond the traditional Po-boy and NOLA fried food, ","useful":1,"cool":1},"ykFtDaU8-PwKZzFf4pB1Sw":{"text":"If you are looking for a slightly different yet delicious Po Boy then this is the place to","useful":0,"cool":0},"5JwXcwheOaJ-et2KS83BkA":{"text":"Located in the French Quarter, the storefront only has their logo and I walked right past ","useful":0,"cool":1},"l6CcgttzoB3JccjpXoM7Xw":{"text":"We stopped in during our trip to New Orleans based on reading some yelp reviews. Having tr","useful":0,"cool":0},"hw0GiTIJ12bPF6rlyuD3Og":{"text":"My first stop in New Orleans for the first time. Ordered the gulf shrimp and the pork bell","useful":0,"cool":0},"-eYlUwNI3BpFU0nK7UIhOw":{"text":"not your typical NO po boys but are a must if you're in the big easy... seriously you have","useful":0,"cool":0},"i3DXrPKNufj45fDmZ_I0Ew":{"text":"Wow! So disappointed by Killer Poboys! I first stopped here in 2015 and liked it so much t","useful":3,"cool":0},"bkVSvdBd_HXNy_z8_YGsSQ":{"text":"The delicious grilled shrimp po-boy sandwich is well worth the $12 (market price). I found","useful":0,"cool":0},"uxkB4TL3N7O8LkDc9Cspjw":{"text":"Ordered the pork belly and shrimp po boys. Honestly some of the best things we've eaten th","useful":0,"cool":0},"zpEb9x-MAAkMmaNVK45ZOw":{"text":"BEST PO'BOYS IN NOLA.  This is a hidden gem in the back of a divey bar.  The sandwiches ar","useful":0,"cool":0},"RbPUtbapNdhOEElqA3LwTg":{"text":"Holy crap... Unbelievable pork belly po boy. Greasy and tastes, if you are a health freak ","useful":0,"cool":0},"sgx8A1AE2-QdBtF0YUNw1w":{"text":"Killer indeed. Three of us went. We ordered 3 different po-boys and they were nice enough ","useful":0,"cool":0},"JIAzxIbgKdNa90io3g2FSA":{"text":"Poboys are killer!  Had pork belly & shrimp Poboys- both are finger licking good.  Pork be","useful":0,"cool":0},"DedqR1xDMKXwTGgPk1VI1w":{"text":"I'm glad I found this place on yelp while visiting New Orleans! Best shrimp poboy I've eve","useful":0,"cool":0},"VULEeq1heoDUucBH0D0Qow":{"text":"Not yo' daddy's poboys! But that's good.\n\nKiller has a limited selection of creative poboy","useful":0,"cool":0},"0ZN1GMaid0X9nkTa4oIVQA":{"text":"Place is awesome. The Bahn mi inspired poboys are super tasty! We had the shrimp poboys & ","useful":0,"cool":1},"tx7lVd0skuruzBMZBOnRAA":{"text":"Decent poboys. Convenient location but out of the main strip. Bar in ther front and kitche","useful":1,"cool":1},"tA0wA6OKW-HBS6WNonA2hQ":{"text":"Very limited selection of po boy's...where's the crawfish, where's the crab , oyster or al","useful":0,"cool":0},"21Jy0GbNt7ye5lxoTXIfCA":{"text":"Located at the back of Erin Rose Bar, we got carded by a stoic bouncer on our way in.  Thi","useful":0,"cool":0},"jt1UO8stOGHLxKbfhrzk5A":{"text":"Killer PoBoys did their job. Pork stomach sandwiches...you can't go wrong with that!\n\nI di","useful":2,"cool":2},"VJtqx3j3evpXurWVDlFU6A":{"text":"We couldn't find it for the longest time because we didn't know it was in the back of a ba","useful":0,"cool":0},"dzZDJDypAB8t-JZ92MTF9w":{"text":"This place is the best Po boy in the entire French Quarter. It meets all expectations and ","useful":0,"cool":0},"mznr2vf2yV1OgCPNs0_gDw":{"text":"Just one more 5 star for Killer Poboys Roast Beef.  Yes, it's a dump.  Yes, you'll think y","useful":0,"cool":0},"G7FX03W_XHI6dUoBH6uegw":{"text":"Nos fundos do Erin Rose, um pub bem ao estilo americano, está o KPB. \nO ambiente é bem des","useful":0,"cool":0},"EjCc6JJa8rTSniH2y27yfg":{"text":"Delicious and simple po'boys in the back of a great dive bar. Both the shrimp and pork bel","useful":0,"cool":0},"WQwVhbjyX4de3PQKmRu0zA":{"text":"It's inside the back of a bar and you will absolutely miss it from the street. The shrimp ","useful":0,"cool":0},"_tWQKOOtds9CZy-W8CQwDA":{"text":"Awesome dive bar with delicious coffee slushies and the only place with vegetarian Poboy. ","useful":1,"cool":2},"rZq9xsEExhAxFRJz1TDwkA":{"text":"It is in the back of a bar. It is a hole-in-the-wall in the most literal translation of th","useful":4,"cool":1},"ouVkVsEygAPaGVQWbf1N8A":{"text":"Do you know what you need after visiting the Museum of Death? A Killer Po-boy!!!\n\nIt was a","useful":0,"cool":0},"63kNdLLxG2FmLdSzrzjZcQ":{"text":"Alright, so I've lived in some expensive cities- SF, LA, NYC...yet I've never paid $14 for","useful":3,"cool":0},"5Zg_HsjyWCi-lLvUhhHS8g":{"text":"Stopped in to grab some food on my way home. After a near disaster trying to decide betwee","useful":0,"cool":0},"x_wPyoArRMUlMPcP77eGdQ":{"text":"The pork belly poboy is one of the reasons I could never be a vegetarian. Killer Poboys is","useful":2,"cool":1},"-PFI7ivnz9M_MVY1uMPSQA":{"text":"Just amazing. I was sad that I didn't have enough room to eat more or the time to come bac","useful":0,"cool":0},"jx_F3ozgsZcTz8ka30cugw":{"text":"Let me start out by saying that the po boys were amazing! Emma K is completely right  that","useful":0,"cool":1},"jOcPLNlw_kgaObGfXQiXXQ":{"text":"Quick search on Yelp for Poboys, and my search led me here. Glad to know they're open unti","useful":1,"cool":1},"nZTJiFe17Cb2McRSz1sXlw":{"text":"Killer Poboys was my first stop during my New Orleans trip! It's located in the back of a ","useful":4,"cool":1},"RQNFR-IvgrCMq5VqAaEBDg":{"text":"Can't give a five but tempted. Great sandwich.  You would never know this place was here u","useful":1,"cool":0},"MWJAzENONjyqLaOFziJeXg":{"text":"Not particularly great for such high ratings. I've had much better and seems like this pla","useful":0,"cool":0},"q5jbDqR7JklkoExgVlpikQ":{"text":"Not what I expected, service could be a lil better and the sandwich were not that great, r","useful":0,"cool":0},"_zG1AjZcDEzWIdGfrQqInw":{"text":"The location is tricky because it's tucked into the back of a bar called Erin's Rose. We h","useful":0,"cool":0},"7ooAZONIDMM0gRAzo5N3oQ":{"text":"Shrimp poboy and grill cheese was phenomenal. Out of this world. Maybe because I was drunk","useful":0,"cool":0},"BzCRM8BkYkbgCSFRSsvutg":{"text":"This place is hidden in the back of the bar, Erin Rose and isn't open all the time. The sh","useful":0,"cool":0},"H29jFQIQxqbIuOtyVbO85A":{"text":"Our first meal after touching down in the big easy. Killer Poboy's is in the way back of E","useful":0,"cool":1},"kGp7Lb75MI1DpIl48xDxhA":{"text":"The staff was incredibly helpful and polite. I ordered the pork belly poboy which was incr","useful":0,"cool":0},"1deI-CoY7QwmNe8q0yv6Yw":{"text":"Honesty in food and drink is woefully rare in this age of chains and cookie cutter product","useful":4,"cool":2},"75nOzqUO2GMNS5tZ3Khv5g":{"text":"Great shrimp po boy.  (Mint, cilantro, carrots, daikon, grilled shrimp, and sauce) don't l","useful":0,"cool":0},"awOdBfamO2Q3wCRugUIgBw":{"text":"My first meal in NOLA and I was not disappointed. I agree these are excellent po-boys. I h","useful":0,"cool":0},"PhQneyvNdEHhvsxoMSPsIA":{"text":"If you're an easily confused person like me, you might be deterred by the sign reading \"Er","useful":1,"cool":0},"fWg4A3irKPQOjDXS34LGWw":{"text":"Nice choice of poboys from beef debris, pork belly, and many others. Sammiches were tasty ","useful":0,"cool":0},"-MGkYtOb9JxjY0RiuFT3WQ":{"text":"YUCKOLA.  Since I'm from Detroit the novelty of buying food from a dive bar didn't really ","useful":0,"cool":0},"XX4aqDriWjhMyRb16Zv05Q":{"text":"Absolutely zero complaints about this place.  And that's coming from someone who lives to ","useful":9,"cool":5},"_p6od34MFb_rKd0uB2uigg":{"text":"First off know that Killer Po Boys is INSIDE the Erine Rose bar in the back. Was alittle h","useful":0,"cool":0},"m3kYQqac2CAk76UoOctrSw":{"text":"It's in the back with no sign for Killer Po'Boys out front. \nIt is a hidden gem!!! We spli","useful":1,"cool":0},"hnOkgk9Kk-xxjaxNMUBIgg":{"text":"Nice to not have a deep fried poboy. The shrimp poboy was tasty and fresh. Good place for ","useful":0,"cool":0},"rISQ1KZs2onhZj_sZKdY3Q":{"text":"Hell yes! This was by far the best poboy I had in all of NOLA!\n\nI shared the shrimp and th","useful":0,"cool":0},"bYi-99qHvuPk2kNS7ZUfPQ":{"text":"This is our fourth year in New Orleans, and we make sure to stop by this little place ever","useful":0,"cool":0},"oTHee6iVGN4OcSrBnmrV1A":{"text":"This was the best poboy I had on my trip to NOLA, hands down! In as unassuming location, i","useful":3,"cool":1},"usB3BG8gBT77a8IYtPOVFg":{"text":"Get the dark and stormy!!! So good! Such great flavor! Waaaay better than the shrimp one (","useful":0,"cool":0},"gHve43E9xHjXgLIQ51_XzQ":{"text":"Jameson Grilled Cheese - 5 stars\nCoriander Lime Gulf Shrimp Poboy - 5 stars\n\"Hot Muff\" Pre","useful":0,"cool":0},"QyGK0uNoT-prnHX04AIf0w":{"text":"I knew going in that this wouldn't be your typical po boy. It did remind me of a bahn mi. ","useful":0,"cool":0},"w_yNQrDd9s3SEcOTUKuF1A":{"text":"This was a small restaurant inside a bar. We ordered the pork belly po boy and the meatloa","useful":0,"cool":0},"FAuGyb6vkWe4DpkHpAifcw":{"text":"So yummy!! Awesome food & service. Still craving the grilled whiskey cheese sandwich.. the","useful":0,"cool":0},"Wj5PKLB10ckBaY7pRQ_HFA":{"text":"I got to try two of the po boy sandwiches, the pork belly and the shrimp. Both were good, ","useful":0,"cool":0},"mfTI7m3GmtGrHu74kngbwA":{"text":"Got into New Orleans and wanted to start the trip with a Po Boy, so I went with Yelp and o","useful":2,"cool":0},"JGXfLjkcrNlP5f48TUOXDA":{"text":"Almost too hidden at the back of the Erin Rose bar, this walk up window sandwich shop prep","useful":0,"cool":0},"QwMWzaQDko2q9_ZXZsYUYg":{"text":"My mom liked her meatloaf po boy, but the shrimp was way too fishy. Couldn't eat it.","useful":0,"cool":0},"43pgHdzADTxLaOcKWBsOcQ":{"text":"Decent. I tried the short rib poboy, the wife had the lamb. Both were pretty good.","useful":0,"cool":0},"Pg00TjIeoeZ_6w5iYoQcxw":{"text":"this is hands down the BEST vegan PoBoy in all of Nola. We went to Parkway Tavern to try t","useful":3,"cool":0},"tI5mD_nwKPlJRfHavKQAPg":{"text":"So this spot is in the back of a dive bar off of Bourbon street, but wow that grilled shri","useful":0,"cool":0},"5sCGTjbEL9JJM2fg17yOCA":{"text":"I like prefer my meals without frills, and for a good price. Killer Poboys was just that. ","useful":0,"cool":0},"XuJGv0-3UPpB68C9zBCQQQ":{"text":"Elevated poboys. Wonderful ingredients & recipes, amazing flavors. Hole in the wall with l","useful":0,"cool":0},"pHdUYe6RayxO18C1F7zq2w":{"text":"This place was where I fell in love with p.o. boys I couldn't believe how tasty the beef a","useful":0,"cool":0},"4t2YaYWMUnUltEDPBhLNXg":{"text":"Lived up to the reviews. Being for Chicago, I don't need a regular sandwich, we have great","useful":0,"cool":0},"RakYr0ZO9AaN40RyOgTGNg":{"text":"The shrimp po'boy had a literally stunning taste, no kidding- it was the BEST sandwich I'v","useful":1,"cool":0},"BfgJpAA-NTubuB4Z3bEMxA":{"text":"It has been 2 months since our trip to NOLA and my boyfriend and I still dream about this ","useful":3,"cool":1},"OEyvvL2JWZ7LungbfBcw3w":{"text":"Best thing I ate in 2015 was the Dark and Stormy Pork Belly Po Boy.\nCame back to NOLA in 2","useful":2,"cool":0},"IiTExhL3Bi74vhCIcnbm7Q":{"text":"My friends got 6 coriander lime shrimp po boys to-go for our group. It was my first time e","useful":0,"cool":0},"CGbzqPGalFCdBQijPS9DFQ":{"text":"Simply terrific. We value every meal on every trip to NOLA and we ate here twice in two da","useful":1,"cool":0},"T3TNfY4JDXP64ykY68rkZA":{"text":"Hidden behind a bar.  Not a lot of seating or ventilation but you can sit at the bar.  Po ","useful":0,"cool":1},"4zXdRovAMS_MAjfMxahRVQ":{"text":"Expensive - we paid $26 for two po boys and the po boys were a little small. The shrimp po","useful":0,"cool":0},"QmouMbrEQ2ZiXsX4159vjA":{"text":"Yummy sandwich I took to go.  I arrived a little early so hung out at the bar until they o","useful":0,"cool":0},"CvbUBv1O6lpL78ffzPwQKg":{"text":"Talk about poor service. We walk in at 11 pm and are pointed to the \" cashier\" by a guy wh","useful":0,"cool":0},"n5tS1KIo1wazRb0Y1QyVgw":{"text":"If I could leave a sixth star I would. Having only been in NOLA for a few hours (the first","useful":1,"cool":1},"HQ7Pm0MP6IKyqkwmXpgpFg":{"text":"Was in New Orleans for 6 days and this was by far my favorite place. I'm vegan and loved t","useful":1,"cool":1},"5Re3-IyHgkY34-pcwItmNg":{"text":"This was our first food stop in New Orleans. This hole in a wall place at the back of Erin","useful":2,"cool":1},"E0HKHqELbzkYb-kVjtw_oA":{"text":"Amazing!! Our group tried the shrimp, beef and veggie option. All were so delicious. Made ","useful":0,"cool":0},"6Nw1fx-8aI74StHRViKA_A":{"text":"+Order the shrimp Po Boy, it's the best option by far!\n\nIt was so expensive but I got the ","useful":1,"cool":0},"UGhOJhT7skVEkykOnSs0ew":{"text":"Place is hidden.... have to go into Erin Rose and walk to the back to find em.... my son a","useful":0,"cool":0},"BmRGniebdknsoeKkXTntHA":{"text":"Find Erin Rose, and you'll find Killer Poboys hiding in the back. \n\nMy friend said this wa","useful":1,"cool":0},"10Gpcs0EyioezbpHJApmLw":{"text":"Great vibes, great food. The shrimp poboy was exceptional. It was tasty and healthy at the","useful":0,"cool":1},"j6Rnm50H6m5Cn9U3NjRpFg":{"text":"I don't understand why this place is highly rated... My friend and I both had mediocre to ","useful":1,"cool":1},"wUdHZP--jyyZK82gmWLLqg":{"text":"Chose this place based on the alternative po boy options. We ordered the seared shrimp po ","useful":0,"cool":0},"hvs-oYmynMKqGMW7XOQ5yw":{"text":"The Po'boy sandwiches here are lacking big time in the New Orleans style. They are smaller","useful":2,"cool":1},"noJb6hPKrouUdc0LBurleA":{"text":"OMFG. OH. MY. F'ING. GOD. I could say that over and over and it wouldn't give this place j","useful":0,"cool":0},"lGg5lUyLgMaB7v8tMpiijw":{"text":"Found this place when we moved here two years ago through a Yelp and we haven't stopped vi","useful":2,"cool":0},"iWQmFhlTRy2Wijxtw1RFkQ":{"text":"This review is solely based on the food. When we first arrived we walked out since there a","useful":0,"cool":0},"eWQdUBysDD8cVQ4gqPTHNA":{"text":"Totally didn't read through all the reviews about it being in the back of a bar so it was ","useful":0,"cool":0},"CNFLlgBfFVLlu0tAeJj4Xw":{"text":"Killer Poboys is not your run of the mill Poboy spot. They are tucked in the way back of a","useful":0,"cool":0},"K15db_sKUeKe0_XhXnV6JQ":{"text":"Pork belly poboy makes me a happy girl. As long as you have good directions for how to fin","useful":1,"cool":1},"3Ncm5LoHbRE8WOWiNMrf9w":{"text":"Like the other reviews already mentioned, this place is tucked away in the back of a divey","useful":1,"cool":2},"7ULzxUwMOGWIJaPiSVE45Q":{"text":"Killer is right! The pork belly was delicious! Highly recommend for a quick lunch as your ","useful":0,"cool":1},"6eXeTXy6l_qgzTtucdz_3w":{"text":"Had the special poboy of the day, a lamb sausage with tzatziki sauce and pickled carrots. ","useful":0,"cool":0},"gGW-efgQgv-VlPSk2l7Mjw":{"text":"while on vacation in this amazing city, somebody tipped me off to this small sandwich plac","useful":1,"cool":0},"9agc5iVlqjKiUY15lGhW3w":{"text":"Seared gulf shrimp po boys- marinated radish, carrot, cucumber. There's a bottle of hot sa","useful":3,"cool":2},"Ixh9iyONPrB7_VBu2xDweQ":{"text":"Are you reading this while you're in New Orleans looking for a Po'Boy?  Well, it's time to","useful":6,"cool":1},"aFLoYC8qIx_fIxW8uJOWdA":{"text":"Po boy was very good. I'm glad I ate here because I was able to meet an entirely new secto","useful":0,"cool":0},"9YOjIyatgevd1Wb8IlbKew":{"text":"Delicious po'boys. The place is in the back if the Erin Rose bar. Definitely a dive, but r","useful":0,"cool":0},"_XSg5fe3BdtLIyYAx4-0vA":{"text":"Looked online for the best po boys in french quarter and was alerted that we had to check ","useful":0,"cool":0},"4SRba_YglBOVCrGQNAZXlA":{"text":"First off, this place is not for everyone...but its def for me. \nI even enjoyed walking in","useful":1,"cool":0},"p4RpwfAU1LIb5h0Y9PMw8w":{"text":"Best food so far in New Orleans! I'm from California and my buddies and I tried a few diff","useful":0,"cool":0},"9TfTFGgg4EGm7rbKtID_cw":{"text":"Scrolling through the photos looking at the pork Po boy I had last night leads me to belie","useful":0,"cool":0},"ymyc_NgJxhX3jT2FBI0beA":{"text":"The shrimp po boy here is absolutely delicous! I went to New Orleans for a girls trip that","useful":0,"cool":0},"ECizmwszbXOvnOCC74CmJg":{"text":"I was a little confused and couldn't find the place. I had to dig through some reviews to ","useful":0,"cool":0},"lSVHkweEF0FzOdoXso5LOw":{"text":"Recently checked this place out, one of many places I had bookmarked in New Orleans. So, o","useful":0,"cool":0},"9x0AjBMibe1KzMXuUwsQ9Q":{"text":"We went to the location inside of Erin rose because their main locations system was down a","useful":1,"cool":0},"9XsoqL4uNBAIuAL3QO8j7w":{"text":"I read about this place on Yelp and had to try it out while we were visiting. They didn't ","useful":1,"cool":0},"TwYqPiy7qELYIGPapC27aQ":{"text":"I had the Jameson grilled cheese sandwich for lunch. It was full of savory flavor and good","useful":6,"cool":2},"Hp72roxRcoLoEZ9mQsSWNw":{"text":"Previous Yelpers have said it-- THIS is AMAZING. Sure, sure, I've got love for the traditi","useful":0,"cool":1},"JYSPQ6q8H5xR2exgpD0Xvg":{"text":"The shrimp poboy was out of this world.  The perfect compliment to the shrimp was the brea","useful":0,"cool":0},"b2YQPq5uBYs0sbGE20NhQQ":{"text":"Good po-boys, but more of a Vietnamese sandwich hybrid compared to classical options like ","useful":1,"cool":0},"gORGSx2ub80D6KENUwZ4kg":{"text":"This was my first dinner stop my first night in New Orleans! I had heard good things but I","useful":1,"cool":0},"8b-RVKlLdpeElcrEDjhWyQ":{"text":"Eeh. It's fine. I know lots of people like it but if I'm gettin a po boy I don't want all ","useful":0,"cool":0},"8RJ7q-XA5EOpal8pM8eWtA":{"text":"Located in a tiny room at back of the Erin Rose bar, it can definitely be a bit hard to fi","useful":2,"cool":1},"hT_vE_atXlZb73T4e4n6Kg":{"text":"Absolutely worth going if you are visiting NOLA. A very unique place and hard to find. You","useful":0,"cool":0},"QNwXqbVaNcbeTCQZS2Ki6A":{"text":"Well, it wasn't bad by any means but it wasn't a meal that wowed me. I love the idea of th","useful":0,"cool":0},"SS4c-qcC-MED_sorPlJs3g":{"text":"Like all the other reviews this is a great spot for a hunger-busting feed. The cafe is loc","useful":0,"cool":0},"jDvEU7Pgprc8vlqBJ8E8Iw":{"text":"FIrst of all, it's in the back of Erin Rose, so automatically a win. We got both the pork ","useful":2,"cool":0},"eA9hLb4VPeOc3kvmx74h8Q":{"text":"Absolutely the best notchamama's poboy. Vietnamese French bread, unexpected condiments, in","useful":0,"cool":0},"PvQ1QTlAsmg1bEAA8pWnVw":{"text":"I was really looking forward to going to Killer Poboys during my trip to NOLA but my exper","useful":0,"cool":0},"EMcu2SSTean7glMjB8vKoQ":{"text":"Spent a week in NOLA last week and after reading the reviews we figured we would try it. O","useful":0,"cool":0},"OB1__d1hhmD-1V6MFymSTA":{"text":"These are some great po boys the worst part is that they don't believe u when u want 10 of","useful":1,"cool":0},"ol42uwYrm1d4NLO2Q3i2rQ":{"text":"This place is shoved in the back of a little dive bar just off Bourbon Street and wasn't t","useful":0,"cool":0},"Vj_oJpFLslgiGCEtg5uj6g":{"text":"There is no sign indicating where this place is. When you get to 811 Conti, there is a div","useful":1,"cool":0},"S2BnICsc5JEYylxGatsuew":{"text":"Omg.  Amazing beef po-boy.  Right at the back of the dive bar, so don't be shy! Just go on","useful":0,"cool":0},"L3QMu9Syxpn8IvRHVbTxKw":{"text":"In a word, awesome. Tried to go here last time I was down but they were closed, did not ma","useful":2,"cool":1},"mReCauh6fnkJf8jxkpN5RQ":{"text":"This place was despicable. We excitedly walked in just shortly after it had opened one mor","useful":0,"cool":0},"M6JOn2mnErRF7TaSgzmGCQ":{"text":"Lamb poboy was excellent!!! Camille the owner was a hard working chef who gets it!!","useful":0,"cool":0},"69khBT_j363m7NQsbayCGw":{"text":"On the second day of our trip to NOLA, we ventured out to find a place where we could samp","useful":0,"cool":0},"SHqS0y6y5EgENBhPFVLrDw":{"text":"Beyond happy we found this place. We were a little skeptical and not to mentioned confused","useful":1,"cool":0},"JmFV3JPEgPdwnjo1sdG2bA":{"text":"We had to get a po-boy the minute we hit town. The shrimp was the most talked about and ab","useful":0,"cool":0},"wXgK_3HkP33F53F0NFYuOg":{"text":"So this place is a secondary location of Killer Poboys located at the back of a bar.  I wa","useful":1,"cool":0},"EmhPQwCxTbbG6l9-s3a63Q":{"text":"Good environment for a drink with friends. I didn't care for the grilled cheese I had.","useful":0,"cool":0},"0QlZrFTirZ4BxNLMZOXY-w":{"text":"Hidden in the back of Erin Rose, the Poboys are inspired!  Foodies will be delighted. :)","useful":1,"cool":0},"SWgnAa3GIS5-u9ftPh5UUA":{"text":"Talk about a whole in the wall. That's what distinguishes Killer Po'boys from just about e","useful":4,"cool":2},"Vy9CKkhceTe7-oYFzrM1qw":{"text":"Had the grilled shrimp poboy...in one word... \"Delicious\"! The place is a little hard to f","useful":2,"cool":1},"f5DpNZJpNSzCtlTcbpER1A":{"text":"We found this place through yelp. We were a bit thrown by he location of the restaurant bu","useful":2,"cool":0},"Ru3vDgfRCtBFsJsmw2Vs5w":{"text":"Basically a banh mi po boy. Lotta hipsters and unsuspecting tourists. Not exactly brillian","useful":1,"cool":0},"lT-Ez8uNy9yUoA7ZeoS6QQ":{"text":"#I came here with a bunch of friends because I wanted to watch the Gator game. But the Gat","useful":1,"cool":0},"cGI0wLO3umqbhiQ4Wxpmkw":{"text":"i had the pork belly. the pork was undercooked, which caused negative digestive consequenc","useful":1,"cool":1},"cuOWzTmIowlRbYwB56soWw":{"text":"Hands down the best Po-boy spot I had on my trip to NOLA. The shrimp Po-boy was super tast","useful":0,"cool":0},"8XXtUYOc0DUWARp4LGHL-Q":{"text":"I've had Po'boys before...but this, THIS was the real deal! I'd read the reviews before vi","useful":0,"cool":2},"yFTNKI8IxiIr9M3WuK74eQ":{"text":"Absolutely Delicious! You have to walk into Erin Rose and head straight to the back. Order","useful":0,"cool":0},"LbBGdeW-8eMF9ZLbben0OA":{"text":"Step aside roast beef poboy! There's a new sammich in town! Moroccan spiced lamb sausage? ","useful":6,"cool":5},"MNYrJR35WeWbS9BzAOd3sQ":{"text":"A friend and I checked out this place after looking it up on yelp and seeing the good revi","useful":0,"cool":0},"aIExKu8vWHrP8TAV69jsGg":{"text":"Pot belly Poboys is really good. Will definitely go again. \nQuick service. Small place. Bu","useful":0,"cool":0},"yaYuoyZvU6DsR41TSD6QEw":{"text":"I know, I know, they're really bahn mi, but oh my God call them whatever you want, they're","useful":1,"cool":0},"6WL737M-jegiQ4__giN30A":{"text":"One of the best sandwiches I've ever had in my life\n\nPork belly po boy\n\nWho would have tho","useful":2,"cool":1},"1yOJfTimXHxPXxF29yVW0A":{"text":"If you go to the street address you end up in front of the Erin Rose bar. It turns out the","useful":0,"cool":0},"Yssq8mJijCzJQEy0aAAmSA":{"text":"Soooo good. We were trying to find another place and gave up. Thank goodness we did! I had","useful":0,"cool":0},"aK2dFmjLaD2KEc13NdWBKQ":{"text":"I think they are the best poor boys in the Quarter, but keep in mind they are not your tra","useful":1,"cool":1},"PNXwHfdtyNOUEL0zuyNefg":{"text":"Place is hidden.... have to go into Erin Rose and walk to the back to find em.... my son a","useful":0,"cool":0},"dtTGNy0vfzVmVbhVkb_LQw":{"text":"Overall very solid. The slaw was the delicious the pork belly was solid cut. However for m","useful":0,"cool":0},"wMeQHoOMZRNdi5c8ef4tyQ":{"text":"The best vegetarian Poboys we had while we were in New Orleans. \n\nWould recommend! We got ","useful":0,"cool":0},"wnd45SrYiQKnrg7W99WRhA":{"text":"I saw a roach crawling over the bread which was uncovered. Then I had to ask the lady cook","useful":0,"cool":0},"PHK07Jj__vaduZu2KKDj9A":{"text":"Although not the best Poboy I had, this place comes close!\n\nI had the grilled shrimp Poboy","useful":0,"cool":0},"VR8k1FU4sJA5P4aAPGTv5w":{"text":"Ok.... you want THE BEST POBOY in all of New Orleans this is the place! It's at the Rose w","useful":0,"cool":0},"VyQ5pO5cwFHUe5x5xGx77Q":{"text":"Yelp should not direct people here for poboys. These are not authentic Popboys. Which they","useful":2,"cool":0},"CGxZ4Z2w7JrFW0TtCOGfLw":{"text":"Sandwiches are great.  Price is reasonable.  Plenty of food to fill you up.  Nap time afte","useful":0,"cool":1},"1kZ3STkzg8-xkiPleBMYDQ":{"text":"This is the speakeasy of Poboy restaurants! This place is tucked away in the back of Erin'","useful":0,"cool":0},"oBIZRVM5KXVDzoIS6XPJXg":{"text":"Wow. All I can say is we wanted to try some po boys and my friend had heard of this place!","useful":0,"cool":0},"ssDhTOfZnmDekEAXfHUPVw":{"text":"Interesting take on po boys that is well worth a try. We ordered the Seared gulf shrimp po","useful":1,"cool":1},"DjL9z--X5Wum2XkL4fasew":{"text":"Caught an evening flight in to New Orleans and we were starving. We Yelped Killer Po Boys ","useful":0,"cool":0},"EkKdD9yyunHk8MFs9k5Piw":{"text":"Sometimes the hype might get in the way. I have heard so many great things and so I expect","useful":8,"cool":5},"A-dJShnrMzY8LGi7BoP5iQ":{"text":"I had no idea where my friends were taking me when we came here because this place is nest","useful":0,"cool":0},"2AykeO28moZhvBJmLJr3Gw":{"text":"My friends and I were so hungry after going on a swamp tour in LaPlace, so we were very ex","useful":17,"cool":14},"uUp2efxipwRD9zXwgQs8hg":{"text":"This is a hidden gem inside the Erin Rose bar. I tried the roasted sweet potato and beef m","useful":0,"cool":0},"c_lWSAv6VnGt9JHRB5XfJQ":{"text":"nothing special about the poboys. actually lacking substance as there was limited filling.","useful":0,"cool":0},"kzt3kWYZNXEh09QayyqwGg":{"text":"Love the po boy and he environment\nKind waitress and staffs. Thank you for the pleasant lu","useful":0,"cool":0},"uOMyaxDpbvq4K01h7IRuCw":{"text":"1 star off: I asked the girl working behind the counter for a menu and she unhappily showe","useful":1,"cool":0},"z7fYl2MEIT0hcDvl-pz2og":{"text":"I wanted to try a shrimp po boy while in New Orleans - the shrimp Poboy I got was just OK ","useful":0,"cool":0},"C0dPtJxwFyqVvZldsLl3yA":{"text":"Hard to find spot that is actually in the back of a bar (Erin Rose bar) with a different n","useful":0,"cool":0},"G0vNqOTe0Vk4PXucJeOprA":{"text":"I give the Killer Poboys on Conti, the hidden gem located in the back of Erin Rose, 5 star","useful":0,"cool":0},"h0jHQ6PMuIGI3c9uXLExtg":{"text":"I had the grilled cheese, my husband had the seafood Po boy! Wonderful friendly service, a","useful":0,"cool":1},"NDvGkyVEpZsIe69RMcJzew":{"text":"Have a few beers and then head here. Just go here and don't ask questions. So delicious","useful":0,"cool":0},"78j2kcnIbgyWu09rKNVr1A":{"text":"The Poboys are good ! If you need a quick bit! Nothing amazing but definitely not disappoi","useful":0,"cool":0},"MBjQ0pgTBzIKpu841dnXMQ":{"text":"Delicious Po-Boys! We had the shrimp, pork belly and chicken. All were seasoned well. All ","useful":0,"cool":0},"iov_o0FmZdggD00XtcO5Nw":{"text":"We were in a cigar shop off of Bourbon Street and the owner told us of a place in the back","useful":1,"cool":0},"xDJmWAOCpnJdRsl1a3GL4g":{"text":"Warning, the address on yelp directions must be to an old location because the map showed ","useful":1,"cool":0},"L3_XHNIgSKgxgYKdE-iASg":{"text":"Great sandwiches, tucked into a great dive bar. Both separate businesses and both are grea","useful":0,"cool":1},"mko0PksMW6-2NFMG7P6FGA":{"text":"Most important tip: from the street you have to walk through the Erin Rose bar to get to K","useful":3,"cool":2},"0D87Yc_Wl0RE8af3qdbj1Q":{"text":"Finally made it out here, very worth it although I hope they dream of bigger and better th","useful":2,"cool":1},"5xLDVSBqPas7IQvLq-HTdQ":{"text":"Lived up to the hype. Went there 2 days in a row. Just wish they were opening later so I c","useful":2,"cool":1},"Z-KRhws2vX2aMT0DbSpXHw":{"text":"Was the first place I ate, it was really good. I had the shrimp poboy, it was delicious th","useful":0,"cool":0},"UdvMSP4_ugy7Gymud1vciw":{"text":"Solid food inside Erin Rose bar. The menu isn't extensive and it isn't your typical Poboy.","useful":1,"cool":0},"IMfhZ-edQkDjTSM91VFqEA":{"text":"Poboys are one of those things you'll find EVERYWHERE in New Orleans, so it's hard to know","useful":3,"cool":4},"AM7EHv_4fvLDc_m70Axfhg":{"text":"Killer poboys are inside a bar, just FYI. The shrimp poboy for $14 was such a disappointme","useful":1,"cool":0},"szbxzjWeaYeTT8JC2CavvQ":{"text":"Great shrimp poboy- be forewarned it is in the back of a bar so hard to find, but totally ","useful":0,"cool":0},"W8VG7Nn3RV0YKp8609fkxg":{"text":"This was probably the best meal I had in New Orleans. It was also the cheapest meal while ","useful":1,"cool":0},"MTylU5b4hD6aUA72tn8huA":{"text":"After a long night wandering through the French Quarter we stopped in at Erin Rose to chec","useful":3,"cool":0},"b7ptthbVvloUH5UhLr1MVA":{"text":"Awesome place, dont expect to park anywhere near it though. The gentleman at the counter w","useful":0,"cool":0},"_ZCyqWcIQBTJi-1ILeYt-w":{"text":"I ordered the shrimp po boy and a side salad. It was so good! I can't wait to go back and ","useful":2,"cool":1},"DHrUDmXNByMaPueyPzFEfA":{"text":"Delicious shrimp Po'Boy sandwich. Quick grab and go or eat in the bar. Good food + good pe","useful":0,"cool":0},"cnN9QZERrhDf0IRdnWY-XA":{"text":"Date: 3-16-18\nTime:1315\n\nBrief: Decent PoBoys in a crazy little dive bar that left quite a","useful":2,"cool":2},"nCkJIt8aKUiNTVttmqF0Hw":{"text":"Good spot mang, want to go back now dammit I am in Chi.","useful":0,"cool":0},"lm5tKCVVGQOoET9bPs4qxw":{"text":"Well, came to this place to eat a Po-boy for the first time. The sandwich was ok, I wasn't","useful":0,"cool":0},"nHRiiTK_k_5d7XuAAlqnsQ":{"text":"So once you enter Erin Rose and head towards the back, you'll find killer poboy parked in ","useful":1,"cool":1},"lFYGgE_VNKoTDRwgoWPnyw":{"text":"What a surprise to find damn good po boys in the back of a bar. Wow...sweet potatoes and m","useful":0,"cool":0},"wYAGZjLlkXcemJy3zgVuyA":{"text":"Amazing po boys, the best in New Orleans, and I've been to a dozen of em.  The menu is sim","useful":1,"cool":0},"MVzIwlBRHPx68qdKKYgSWw":{"text":"This place is at the very back of Erin Rose.  We had a really hard time finding it. I trie","useful":1,"cool":1},"Wz6hPkiwaKZqptKaawKQBQ":{"text":"Not bad po' boys.  This place is in the back of the bar, \nThe sandwich that I had was more","useful":2,"cool":0},"GxLoOknRFquAy11Y79PTzg":{"text":"This isn't your typical po boy. Think bahn mi meets po boy, but it's still REALLY good! Th","useful":0,"cool":0},"z1mn2BjXFVxWWC1-oiAdKw":{"text":"No very accommodating for people with dietary restrictions, was very surprised that I was ","useful":0,"cool":0},"4bUcFYLA0SNuhxUkequCkw":{"text":"A bit hard to find but it's in the back of the bar! It has a take out style counter with s","useful":1,"cool":0},"FkuMxTQZvcjOB6VRbGihoA":{"text":"Yelp comes thru again.... Was in town on business wanted to get something local and differ","useful":2,"cool":1},"5H_dsEFNx7WEEgWEGFX41Q":{"text":"Chief and bar tender are both really friendly and gave great customer service.\n\nThe Irish ","useful":0,"cool":0},"PwTWKvMQqzqCDU8003yDZw":{"text":"Great place to grab a poboy. Cool atmosphere. Located in the back of Erin Rose bar. The qu","useful":0,"cool":0},"5SCQzBaRftJoHZd3MEVEQQ":{"text":"Stopped by after reading about this establishment on some of the NOLA food blogs and wasn'","useful":1,"cool":0},"rsspqF8-2Xv4Obdvff7dCg":{"text":"Killer Poboys is awesome! They are probably my favorite poboys in Nola. I have tried a bun","useful":0,"cool":0},"D8ThPHABVcIBsjnYGeaySQ":{"text":"Killer Poboys may be the perfect bar pairing with a nice drink, but otherwise, not the bes","useful":1,"cool":1},"38QVDuGM4gPlLRvrY4g0Rg":{"text":"We went on the 30th of last month late in the night but way before closing time and had to","useful":1,"cool":1},"b6s0Jb7WuSCi-z6mLYLouw":{"text":"This restaurant doesn't really look too good, but the sandwich was delicious.  Service was","useful":0,"cool":0},"_sqROZZNbONwJkqSogFrjg":{"text":"Tiny tiny place in the back of a bar, which can be overlooked very easily. However, with t","useful":1,"cool":0},"t00Hc2uah-Wj_XOLfOst-A":{"text":"Sometimes, you can just taste the love in the food. This is one of those places. Food love","useful":0,"cool":0},"iov_6l18yLk5hOihDpoYFQ":{"text":"Quick and delicious. Get the shrimp poboy and pork belly poboy. Also got Moscow mule in a ","useful":0,"cool":0},"bPJb86pU5V1ebtVeO5Zbvg":{"text":"I stopped in for lunch with a large group of friends. The po boys were not as large as I'd","useful":0,"cool":0},"xDlGp3ko2YiQeNVL1k4_jg":{"text":"The Shrimp Po' Boy is the best one I have EVER eaten!!! I actually ate one a year ago on a","useful":0,"cool":0},"oUkMMMe6w8deV7DZkvGGJQ":{"text":"Awesome! Hole in the wall inside of a bar. Absolutely loved them. They only take cash like","useful":0,"cool":0},"dQujGq_We5E6tgAlatPRdQ":{"text":"I died last night due to a vicious killer... po-boy. And killer spicy nuts. And killer Tha","useful":16,"cool":14},"Q49Jpg3lvCzmHDXjgc54Dg":{"text":"Second time here and it does not disappoint! This place is no longer cash only (they upped","useful":3,"cool":2},"qBcsKixRw86dxI5oPcQ9jg":{"text":"Located inside a bar\nVery divey\n\nNeed to be 21+ to come in \n\nGot the pork belly poboy $12\n","useful":2,"cool":2},"n662tYGXZbEurdVAAX900w":{"text":"Wow this places gets good reviews.  The service was friendly and it sits in one of my favo","useful":2,"cool":0},"hNUcUnrKHhP_gYRAURAMAg":{"text":"The Pork Belly Po Boy was very good, but it needed more meat.","useful":0,"cool":0},"0NZbleIqnIpa0Bc_qskSwA":{"text":"Hey you, over there. Now that you've probably eaten enough beignet to put you in diabetic-","useful":10,"cool":9},"IiFX8SRmKqCwkJM3y3F6Vw":{"text":"I don't eat pork belly. Except from Killer Poboy. And only like they fix it. These folks h","useful":0,"cool":0},"k5Sqyp2rtvz_mSVJsTsPUg":{"text":"Tucked away in the back of a bar, with a line that wraps around a circular bar table, is a","useful":2,"cool":2},"8rO9EecToiRmT4_nHsqgtQ":{"text":"Killer po-boys.  Didn't disappoint.  Stopped by for lunch and the joint was empty but the ","useful":0,"cool":0},"G2VO5595WHhoYJjir4FG6g":{"text":"It's hidden in the back of the bar but the sandwiches are amazing. We got shrimp and pork.","useful":1,"cool":1},"W-v7fTjVSa_74i7jP8UHnw":{"text":"Stopped in for a quick dinner while walking around the french quarter. Ordered the pork be","useful":0,"cool":0},"Gi1hChm1J-8nuC0uhM92Bg":{"text":"It was literally my BEST meal I had during my time in New Orleans. \n\nTheir most popular po","useful":0,"cool":0},"-NMz28xJ_dyZLPuAzYGYwA":{"text":"I went here with HIGH expectations and was seriously let down. \nWe arrived in NOLA starvin","useful":0,"cool":0},"ckjGl2zWePisVAThme7BIg":{"text":"Home of the unconventional poboy, Killer Poboys is a great spot to grab some food if you'r","useful":0,"cool":0},"P_9ZzwPXXxI39oK3PJNe9w":{"text":"This place is fire.  I at first was a lil disappointed that the shrimp weren't fried but t","useful":0,"cool":0},"D7PMJfGT9fy4s1xvlo4x5Q":{"text":"It's hidden inside a bar!  man everyone wasn't lying the best poboys in town!!° we went 2x","useful":1,"cool":0},"Hw0iJsIb1keeMji4US0uJw":{"text":"Really good poboys in the far back of the Erin Rose bar.  Very small manu, but they have a","useful":0,"cool":0},"ISJAvi4Y_WE77LkCM2iClA":{"text":"Terrible. The place was dirty, there is absolutely no way these guys wash their hands and ","useful":0,"cool":0},"Ptwo_GF1LQPx401PcMNwCg":{"text":"Not recommended for families with younger children.  Definitely a hipster joint that is wa","useful":0,"cool":0},"8A7N4Pvlqt3cV7ad8Sm5CA":{"text":"Was staying in the French Quarter for vacation while the girlfriend was working so I decid","useful":1,"cool":1},"02ztSd1AP7r7743xeKkxWQ":{"text":"Biggest regret of my time in NOLA? Not coming here for every meal.\n\nKiller Poboys, located","useful":4,"cool":2},"uITt5SWWiBk-gxptr22bAg":{"text":"NO SIGN ANYWHERE for this outside of Erin Rose. We even peeked inside to see if this was t","useful":0,"cool":0},"OawR4nx82XvAHHFkeY1OUg":{"text":"This location isn't closed so I don't know why Yelp says that. This is a great spot in the","useful":1,"cool":0},"CKMDrw2XsappdZJJOtF-TA":{"text":"Amazing pork belly poboy. Friendly staff. Cozy atmosphere. Can't wait to finish the menu","useful":0,"cool":0},"kEGXIASJ0GEmqcmO35pViQ":{"text":"Always on the lookout for poboys and killer does it right!! Traditional flavors such as be","useful":0,"cool":1},"GBWqbucW1DjcXa47WUoXhA":{"text":"I'm not sure how nearly 700 people have jerked eachother off over this place, but my pork ","useful":2,"cool":0},"VZzAqPHY6YtPs7bu4ro5-w":{"text":"I shouldve read the reviews more carefully before I chose the pork belly po boy. Gah, that","useful":4,"cool":2},"ANN6S_noCYT4hLYLzJO-rg":{"text":"This place is borderline impossible to find when you're drunk and trying to navigate via G","useful":2,"cool":2},"wl783TlvJbiVQYVihfdNzQ":{"text":"really fun and lively bar in the front, and small poboy spot in the back. my biggest compl","useful":8,"cool":8},"kS-_RmGwoc4esOrrgEFfeQ":{"text":"Hands down the best in New Orleans! \nI love Erin Rose and their frozen Irish coffees but I","useful":0,"cool":0},"lF7_EZYU1uHtVC3p0hNVzQ":{"text":"The sweet potato po boy is out of this world! I wish I had been able to add cheese to it b","useful":0,"cool":0},"pP9kbUCCSuwgnEn9YPI5BQ":{"text":"Alright, so I've lived in some expensive cities- SF, LA, NYC...yet I've never paid $14 for","useful":1,"cool":0},"iR6kCwAC_kXTLl_A7Fy2ZQ":{"text":"Delicious Poboys! I got the gulf shrimp and I appreciated that they weren't deep-fried. No","useful":0,"cool":0},"hrFm8C5UmFsouhaCqvb18w":{"text":"I would give it 10 stars is I could.  We sampled 2 of the po boys, the pork and the beef. ","useful":0,"cool":0},"V_bycOXgu3JRBfvST-jLZQ":{"text":"I was NOT impressed.  I read several reviews about the sweet potato poboy and specifically","useful":0,"cool":0},"2n3_aXLuAv2ULD1yKcqhqA":{"text":"Our first stop when we arrived in New Orleans and it did not disappoint! The pork belly po","useful":0,"cool":0},"_cWnKgqQn4D3dC4Vwjq4YQ":{"text":"One of the more flavorful meals I had in New Orleans was the seared shrimp Poboys from her","useful":0,"cool":0},"qqPb0t_KyYfxFDtsrVn2hg":{"text":"We couldn't come to the Nola without eating a Poboy. Good ole yelp sent me to this place. ","useful":0,"cool":0},"S98b-jWzDvn9KuZNgG6Cmw":{"text":"Great Poboys and chips.  Very fun flavor options.  Great way to recharge after a day on Bo","useful":1,"cool":0},"UwZJi_58JBOJDt4-FbOJ9A":{"text":"To fancy for a po-boy. When I'm wanting a sandwich like this, I don't want something gourm","useful":0,"cool":0},"uRi24VcJGueMQ7mzm6RGaA":{"text":"And if you're unable to get out of \"the Quarter\" because your wasted from a walk down Bour","useful":2,"cool":0},"MUHSKn3sJJ7H3TzAzEDFsA":{"text":"I normally wouldn't get a po boy if I went somewhere that offered it, but here in NOLA, yo","useful":3,"cool":2},"o5d7wcNHZEIRg_1oV0TgUA":{"text":"Lives up to the name! The seared shrimp po boy was superb. Crunchy toast, like banh min","useful":0,"cool":0},"9d_qMc4hH0XgQ9g80ITatw":{"text":"The best poboys in new Orleans! The shrimp was sooooooo good and the pork belly was even b","useful":0,"cool":0},"BAa63q9TGlrORd0MWCpvkw":{"text":"If healthy is what you want your in the right place...grilled shrimp poboy heavily seasone","useful":0,"cool":0},"mO35CsNvaNu3BWwre1hp4g":{"text":"Look, I'm no local to this city but don't think this fits the criteria of what would tradi","useful":0,"cool":0},"T1HSEQQyKAciFm78edrrCg":{"text":"Killer Poboys has a nice casual feel, with wooden square tables that you take a seat at af","useful":0,"cool":0},"cCmuJv43CBOYgCI6f8hv-w":{"text":"Not your typical poboy (Parkway) but simply outstanding. Pork belly is not to be missed, s","useful":0,"cool":0},"HSfS5jsvzHtzZNm0p7FrvA":{"text":"Came here for my first poboy sandwhich. Tbh I wasn't too pleased with a poboy sandwhich. N","useful":0,"cool":0},"isO5dkgJy9ZI9HkPQP9bnQ":{"text":"The best poboys I've had in NOLA. Should have came here earlier. Wasted value stomach real","useful":4,"cool":0},"Bq561hd7L6Vl_pTnpJFq_A":{"text":"As my first meal in NOLA, I really wanted a shrimp poboy, and was brought to Killer Poboys","useful":3,"cool":0},"QjtgwdAFZsDz87p2IYbr6A":{"text":"It's still open! Don't know why Yelp says this location has closed. \n\nIt is closed on Tues","useful":1,"cool":1},"41zAWohPyLH6HDuCnw0myA":{"text":"If you're looking for a spin on the traditional po boy then you have to try one of killer ","useful":0,"cool":0},"8xzWeDX6sHsK5_f6pZhdVA":{"text":"Hidden away in the back of the Erin Rose, you'll find some of the best poboys in NOLA. We ","useful":0,"cool":0},"1_8JlgNbvE32M9ND40UhQQ":{"text":"Came here as a recommendation from my friend letting me know that this was the best poboy ","useful":3,"cool":1},"DwwVp34KzsXDvgLBMGpGqA":{"text":"Part of Erin Rose - the food part.","useful":0,"cool":0},"I6MZjfrOXyCNSZHE7QA_pA":{"text":"I rarely leave poor reviews.. I ordered the shrimp poboy as I was told it was the most pop","useful":1,"cool":0},"gKJcNFZ0C8HLOa5vdkjNMQ":{"text":"Great poboys in a cute spot in the back of the bar. You can eat your sandwich in the back ","useful":0,"cool":1},"8CJpP9XkuIq-wU8smqcnQQ":{"text":"First time coming here. Getting the Dark and Stormy, pork belly po'boy. \n\nThis place is hi","useful":3,"cool":0},"GNMQNCc5GwbyyXJD_DNsZA":{"text":"Tiny little Po Boy shop in the back of Erin Rose bar.  DELISH sandwiches, the shrimp was a","useful":1,"cool":0},"JOorLu9-aC-n7rZBeLvzCQ":{"text":"Dissapointing. Not a traditional Po Boy, and overall did not enjoy. \n\nPoor selection of dr","useful":0,"cool":0},"T4Xw-GmhbHzow2mlziYQoQ":{"text":"This was my first meal in New Orleans about 45 minutes after stepping off the plane. What ","useful":0,"cool":0},"UvMhy8i2VkY-nmQvk8nQiw":{"text":"\"Skip the lunch at the hotel,  we should just come here everyday!\"  my companion on my sec","useful":0,"cool":1},"SuEolxk-AqJYekyw5bdi_Q":{"text":"This was just ok. If you like po'boys then by all means come by, but I don't think I do lo","useful":2,"cool":2},"K-ZlTbwE93a1qzrhf5o_6g":{"text":"Went here three times several years ago. Spicy lamb was amazing. This time around.... just","useful":0,"cool":0},"SGrHQTAsPlsksq2CXDAZhA":{"text":"Very good Poboys at this place! Loved the fact that you can order one of this and eat it w","useful":1,"cool":1},"zP1GU6vheOCd0T_-klUG9Q":{"text":"After realizing this place didn't have signage and was in the back of the bar I headed in.","useful":2,"cool":2},"0yjMeYw2ok-FVNqBBqQz4Q":{"text":"I loooove you, killer po boys! I have visited many times to get my frozen Irish coffee at ","useful":10,"cool":5},"0zmRHS-ueTR9gLhvj2e7CA":{"text":"Oh my God, the Dark N' Stormy is an orgasm on a roll!   It had the fattiest pork belly kno","useful":0,"cool":0},"vLH8iKLiK94skYaSWQrIYg":{"text":"Not a local but have had my share of poboys. I guess if you're bored of them this is the p","useful":0,"cool":0},"GDbx9vCoqfkW70saeTi2_w":{"text":"Delicious sandwiches! I had the beef debris and my hubby had the pork belly. Very filling!","useful":0,"cool":0},"1uZiL0QbuKKNS9N65AVWnw":{"text":"Came here because we saw it on the Fung bros channel!\n\nWe got the pork belly and beef pobo","useful":1,"cool":0},"__2DNCwuuOx-1GhBgBEVqA":{"text":"Vegan poboy? Yes please. Delicious and the price is right. Thanks for making a veggie feel","useful":1,"cool":1},"bK4w4guRhTw2gDsw_DHtrw":{"text":"We got the shrimp poboy and it was really good with their seasoned Cole slaw. It may be ha","useful":1,"cool":1},"jELiVL0OrgXasUpffypMcA":{"text":"Love that the Po-Boys counter is in the back of a bar. Cash only. Non traditional Po boy o","useful":1,"cool":0},"_Bly8s_Ez4f0T6T6A7OOiQ":{"text":"This is truly a hole in the wall restaurant, as it is in the back of a bar(Erin Rose)....a","useful":5,"cool":3},"OXLDiKezkzlk7PRBa10eVQ":{"text":"OMG! Ok, so I don't know much about po-boys, but I know food! And a work associate took me","useful":1,"cool":0},"bv5E0Xet9zOdEliwdsND2g":{"text":"These po'boys were the best meal we had in NOLA!  The beef with coffee bbq sauce was AMAZI","useful":0,"cool":2},"6YDf9pS98-GB88K-AjYRqQ":{"text":"This is our fist stop every time we arrive to Nola,I love the pork belly, wifey had the sh","useful":0,"cool":0},"nCtZ-LSGpmMhcQFSPncrxg":{"text":"Do you like dive bars AND vegetarian food? Well, I certainly do, and I definitely recommen","useful":1,"cool":0},"g9XpUiWbdsiYO0lO1aQWpQ":{"text":"Killer Poboys are killing appetites AND killing the competition with their Shrimp Poboys. ","useful":9,"cool":8},"cgvGfye5VxO_nQ6i_-TFbg":{"text":"Pork belly = sweet tangy and tasty. Beef = soft, cooked to perfection, with delicious hors","useful":0,"cool":0},"Nrn2Ud_0I2kSFQrMftdT5g":{"text":"Just had the lamb sausage po boy and the coriander lime po boy.  Amazing!!!!  Find this pl","useful":0,"cool":0},"J-C3G8fX5HydP8CN_6gI5g":{"text":"Wife brought me out to NOLA for my 30th. This was the place I said I wanted to get my Po'b","useful":0,"cool":0},"K-OFHtLx6XnbVWrYN3mDOQ":{"text":"Great for lunch. Bar is a little smokey, but back room is fine","useful":1,"cool":0},"QPCBPtjgWFfN-ygmoYnltg":{"text":"Came across this po boy shop on a food blog and decided to give it a try while in New Orle","useful":1,"cool":2},"6g2x6QEQa5-FlmB32z-ufA":{"text":"We ordered the shrimp and pork belly poboys. On a happy note, the service here was awesome","useful":2,"cool":1},"-91OeRXOjVegD6PwUo4LCA":{"text":"All who know me know well of my long running aversion towards everything-bread. I was forc","useful":25,"cool":26},"J5m8bSRl9BJwvi-wdtyh7g":{"text":"We ate at the location inside the Erin Rose bar. We tried the pork belly po-boys and the s","useful":0,"cool":0},"GRKx_SORwh7m-wtndQMG4Q":{"text":"Went to this restaurant after going to the museum of death. Very nice vibe, it's small and","useful":0,"cool":1},"wQvf-yAAUTUtZRCYFA7BrA":{"text":"The foods so nice we had it twice. \n\nSo when you first come in here you're thinking, wow c","useful":2,"cool":3},"A29ft3XplQ-qo2BCA52bhg":{"text":"I've got many years of experience eating banh mi and po boys at a multitude of locations a","useful":6,"cool":3},"9wEgaHdugLAVrMyMSy2XSA":{"text":"A fun bar with fast service! We loved the pork Pinot and the beef! The shrimp was ok too b","useful":1,"cool":1},"8lTSzy-EsgiDLw_kpVOVcQ":{"text":"Go into Erin Rose and head towards the back into Killer Po Boys    Cool little space and s","useful":0,"cool":1},"YTkb-QXhvoyUH425K-KbGA":{"text":"So happy my girlfriend and I stopped in here! We had just finished going to the swamp tour","useful":0,"cool":0},"zrpBBQZETAvpU9-WnX3H7w":{"text":"Where is this place? It's in the back of the bar....way back. Kinda really hard to find bu","useful":1,"cool":1},"43US6w5AolBj8-LHbs1BXA":{"text":"This is probably my 3rd visit to Nola and my 6 visit to killers Poboys, never disappoints,","useful":0,"cool":0},"EWhTbIiuSXESXTo7NMmjvg":{"text":"My husband and I had a little bucket list when it came to NOLA food. Po'boys was definitel","useful":1,"cool":0},"bakKFD7d9Hc_LmaRN79zVA":{"text":"Very good Poboys. Good selection and extremely friendly service. BTW the Pork Belly was ou","useful":0,"cool":0},"H50cWNPvR8SkcXV1lRYUIw":{"text":"I felt like Anthony bourdain eating in this hidden treasure.  Meatloaf po boy was unique, ","useful":1,"cool":1},"GMIUyICEBSiWGekUbedK6w":{"text":"Don't let walking through a bar scare you away! This tiny room with one table serves delic","useful":0,"cool":1},"wIRYaxG-cxSzfg-yYrjN7Q":{"text":"They knew what they were doing when they named this place. Best non traditional po-boy I'v","useful":2,"cool":1},"_vMdShFj5vNNgJK245nfvg":{"text":"Absolutely delicious! We tried the shrimp and pork belly poboys both were incredible we mi","useful":0,"cool":0},"LQVosOxGFhP3M_TB9zvkMw":{"text":"Note: IT IS INSIDE ERIN ROSE, all the way in the back of the bar. Maybe it was obvious to ","useful":2,"cool":1},"1y-WolxuobMIB_MucXeVUA":{"text":"Great poboys, even better environment. In the back of Erin Rose which has the best iced Ir","useful":3,"cool":2},"37OJi4WMqCofDwM6y7iciA":{"text":"Great hidden gem in Erin Rose. $14 for a shrimp po boy, was quite expensive, but given the","useful":0,"cool":0},"FE1ErJ6U6GauHAlstBhzkA":{"text":"Killer Po Boys is located in the back of Erin Rose bar. I had one day left in the city and","useful":0,"cool":0},"QWaYbRfqs8QClWa_M85X7A":{"text":"We were on a quest for a great po ' boy & we definitely found it! They were closed last ni","useful":0,"cool":0},"AEEUMY6gxgEDkh30P_XVMw":{"text":"Ordered the pork belly poboy and was very satisfied. The service was very friendly and the","useful":0,"cool":0},"DJafS3HZWaIJvGen5KYr9A":{"text":"i honestly don't do 5 star reviews.  If it happens, it means the place really knocked a ho","useful":12,"cool":7},"piJfoSybfzZ-0oeUghjfSg":{"text":"Shrimp Poboy  is a must with the  \nHabanero and ginger sauce ! Chef is friendly . Makes yo","useful":2,"cool":1},"U2MG06STVqkBVltQ3W6cgw":{"text":"we heard that the shrimp poboy here was out of this world.  we made sure we tried this bad","useful":5,"cool":3},"apVlxzDaS_utoZ7Bomekrw":{"text":"Stopped in based on reviews and was very pleased with my shrimp poboy. If looking for a pl","useful":0,"cool":0},"dpx4Ywsqc7RoXdImMC_70w":{"text":"Walk to the back of the narrow Erin Rose Bar and you'll find a small room hidden in the ba","useful":5,"cool":4},"dIBsoWOuRixTo2g5Rko5hA":{"text":"Absolutely the best in New Orleans!  Not a traditional PoBoy but a Killer PoBoy!","useful":0,"cool":0},"yKDk9LN_Z2s0y-NXHxOISg":{"text":"Overall: A good hole in the wall for some quality po boys. Head to the back of the bar!\n\nT","useful":0,"cool":0},"-wWrHjEDRxVI72W5Ik1dSQ":{"text":"I was very upset when I received my \"banh mi\" style poboy. Don't get me wrong I am Asian a","useful":0,"cool":0},"NAKTUlsdBLCsKLhvuJnR-Q":{"text":"OMG. OMG. All I can say. OMG. Hubby and I split a porkbelly and shrimp poboy. OMG. Review ","useful":1,"cool":1},"DpXItSo70WhYEgkugE7AIw":{"text":"Freshly made poboys. It is in the back of a bar, so the location may seem odd or out of pl","useful":0,"cool":0},"ADo8wpYnxVE_rS-L2vYpMA":{"text":"EAT AT MILK BAR! for a 50% larger, 40% cheaper, as good gourmet shrimp sammie!\nCLEAN BACK ","useful":6,"cool":3},"3pR3Kge9gh8dSqdUge9Iiw":{"text":"Came here for a Po-Boy based on all of the \"good\" reviews. The reviews were either written","useful":1,"cool":0},"5EF0DebZt9SbMvnw0UOL4A":{"text":"Excellent po boy but it wasn't \"authentic\"- for 14 dollars you get plenty of yummy delicio","useful":0,"cool":0},"1J5UiOy_zF8zAvWMehh55A":{"text":"Yum yum yum!! The BEST POBOY in New Orleans!! You have to try the pork belly poboy!! Place","useful":0,"cool":0},"nMz-pZw6yf_wa6YihBSToQ":{"text":"Tricky to find, pop up sandwich shop in the back of a bar. The gulf shrimp po boy was deli","useful":0,"cool":0},"Fx3N-FMjVt4kTi8hM_LL5w":{"text":"Who says NOLA isn't for veggies? I give them all their points for having a vegetarian Po' ","useful":3,"cool":1},"8GYeb5XUGtmbySjWbdLb8A":{"text":"The sauce on the pork belly Po Boy is amazing. Unfortunately, I ate one two days in a row ","useful":0,"cool":0},"at1-vOm_ge2rS7RzbS8JRg":{"text":"Not only is it in a cool bar (Erin Rose) but it's the best poboys in the Quarter. Pure hea","useful":0,"cool":0},"7dtJHKor4qTzJAYcKDBWOA":{"text":"This place has the best food. The po'boys are not traditional, but they are amazing.  The ","useful":1,"cool":0},"kcPIP2Maiqq1asSDQzXs1A":{"text":"An international twist on a classic NOLA food! We got the shrimp and meatball special po' ","useful":1,"cool":1},"o-e_Xrt6ZYXSdOuDHhVt6g":{"text":"I'd drive or fly all the way to NOLA just for a poboy. By far the best I've ever had!","useful":0,"cool":0},"akDFIenTofHPwubk5NpX_g":{"text":"This being the second trip of the year for my friends and I to New Orleans, we made it a p","useful":0,"cool":0},"5MZyAga3pkak-bMFbXOv8Q":{"text":"This hidden gem was an amazing find! The Poboys were the best I have had in New Orleans. W","useful":0,"cool":0},"PJFr6jN-1Y0qCh9mImLVuQ":{"text":"We tried the glazed pork belly and shrimp po boys. The shrimp one was delicious, but the p","useful":0,"cool":0},"g1mxkl87uQqMXwSPdsLKow":{"text":"This place is bomb! We came back from a swap tour and we were starving so we settled for s","useful":1,"cool":0},"yJW92U0gTxJNcWjlrUZw7w":{"text":"Shrimp was good. Had a nice crisp outside but then that common squishiness in the bite, si","useful":1,"cool":0},"dXzlaQ5l4ratfsMl0zGpmQ":{"text":"I really really wanted to love this place. Aside from the outstanding reviews, this place ","useful":2,"cool":1},"guHxkT491l-3uf8B_H4plg":{"text":"This was our first experience and what a wonderful one. Loved the Crack Burger Poboy and a","useful":1,"cool":0},"bgc4GTvHRq2J70NNz2B5mg":{"text":"First off, the place is in the back of a bar. Which I good. After I ordered I went and got","useful":0,"cool":1},"iuPGfSM5YfutZa8snS1jKw":{"text":"I gotta say, I'm not a huge fan of po' boys. I am, however, a huge fan of these po' boys! ","useful":3,"cool":2},"6mhKYLZMkM-mZlEUry4oMg":{"text":"Probably the tastiest Poboy in New Orleans to come out of the back of a bar. \n\nThey are no","useful":1,"cool":0},"aBafhVHnPGph3CsdVIPO7g":{"text":"Definitely a fan of these poboys! These flavorful poboys make my taste buds happy.\n\nI usua","useful":9,"cool":9},"jMMugfe2kF3OLTHlXvzrLg":{"text":"Grilled Shrimp Po Boy the best I have ever had. If you are in the area you should definite","useful":0,"cool":0},"LohSzAeNH5o21dxPkttb-A":{"text":"Definitely my favorite poboys in NOLA! It is a super small restaurant located inside Erin ","useful":3,"cool":2},"4TPujvQGjhu38jxZ13rcZg":{"text":"I got the grilled shrimp poboy as my last meal in NOLA. The first few bites were absolutel","useful":1,"cool":0},"yIA4nfFml13y4_BchT7hLw":{"text":"I'm no connoisseur of poboys, but I do like interesting combinations of tasty ingredients ","useful":4,"cool":2},"8ZAgHysura_z8rq1dhTtVw":{"text":"Erin Rose is tucked away on a side street. We actually walked by the bar twice before find","useful":0,"cool":0},"XHm4tAJvUm5wyc2C33_R1w":{"text":"Our first time stopping at this POBOY joint. The glazed pork belly POBOY was beyond what I","useful":0,"cool":0},"4Sw9WNubZZIktX-bZZz9nQ":{"text":"Amazing po'boys!! Really good Asian twist to po'boys, a perfect mix between Vietnamese Ban","useful":0,"cool":0},"B2y_w6_Tc26pjxXV7QebYA":{"text":"Yes, yes, yes! \n\nThis place has really great flavours, some seafood options, pork belly an","useful":2,"cool":0},"-O6NgRBNvLFYuxvH61v5ZA":{"text":"Not your traditional fried oyster and fried shrimp po-boy! We ordered the beef which had d","useful":1,"cool":0},"zuRjfSq40YWf0zOEJLNmqw":{"text":"While we were around the corner at Erin Rose, we heard another patron order some Po'boys t","useful":0,"cool":0},"2DvMik9vtpiRLjtCfptodw":{"text":"I was sucked into the horde of positive reviews about this place. They have a website but ","useful":11,"cool":4},"-VL9ZiA692xCzUj5PP_qJA":{"text":"Best po'boys I've ever had. My cousin and I split a meatloaf po'boy as well as a gulf shri","useful":0,"cool":0},"rQL__03VKqWLmAGLVlSNHQ":{"text":"Sorely disappointed with the food and the experience. \n\nI was standing outside the Erin Ro","useful":1,"cool":0},"r9FRQAXMZwznWIeoxPWhfQ":{"text":"To capture the full New Orleans experience, you gotta have a poboy, right? A few locals su","useful":0,"cool":1},"NGv7pTtt3b5AMSdfqeuvSA":{"text":"Amazing shrimp and grilled Jameson cheese! This took some effort to find but was definitel","useful":1,"cool":2},"JwSswKrAH6ndW5FcuWwpLA":{"text":"Got there at just the right time (between 11 and 1130am) and there were plenty of tables t","useful":0,"cool":0},"MMRQKQuxYfxR96mnAT0toQ":{"text":"Tucked in the back of Erin Rose Bar, Killer Poboys cooks up AMAZING food. Please do not he","useful":1,"cool":0},"UPLjiY1Sf5ZDCQVtwHm7ww":{"text":"We opted to get their shrimp poboy and it was ok at best. It was lacking in favor. Maybe I","useful":6,"cool":4},"mcw2VJCtk_ZVlT2_vjqDLQ":{"text":"Perfect for jaded New Orleans tastes, KP offers a strikingly different take on the po' boy","useful":1,"cool":0},"IRZJX6wg73qzULCo5VIf2w":{"text":"It looks like a hole in the wall, but once inside, the place is nice and upscale. The aver","useful":0,"cool":0},"GLkmXNzDVVotKjttbz45ZA":{"text":"Killer Poboys is a really respectable departure from the traditional sandwich found all ov","useful":31,"cool":25},"jZVYnKVc_Tl-m_6dk8lm4g":{"text":"I was here this past weekend for the 49ers invasion in NOLA.  Saw the reviews for this pla","useful":1,"cool":0},"wlCvdAEKSDPGblMEX2VKLQ":{"text":"We walked into Erin Rose bar and then walked out thinking, \"there's no way this is the rig","useful":1,"cool":1},"-n6weeoFjErvX1-EXmllXA":{"text":"The meatloaf was really good. The bread was a little dry on one side, but it was also the ","useful":2,"cool":1},"UvAK9MkBQ8fuu1LO-G8NWQ":{"text":"We came here for the last meal of our Nola trip, to down some po'boys and they were absolu","useful":2,"cool":1},"4XCFdPR1e5wxzgaBQyYXvw":{"text":"We found our way to the back of the Erin Rose bar and found this small spot just for Po'Bo","useful":1,"cool":1},"OYGmaDDV72zOq5snlOF4cg":{"text":"Tucked away at the back of the Erin Rose bar, this is the very definition of a \"hole in th","useful":7,"cool":2},"kaFiYDVQNB6Nk_bJabVe6g":{"text":"This place is located at the weee back of a bar called ERIN ROSE, so I spent quite a while","useful":1,"cool":0},"jhE4qjmKlNL_4al8piJNPA":{"text":"I was staying in the French Quarter and Killer Poboys was my first meal in New Orleans. Pr","useful":3,"cool":1},"sSoA2UT_BsdVwly60QwTnQ":{"text":"Do you like Poboy Fest?\nThen you'll love KP because it's like having access to Poboy Fest ","useful":1,"cool":3},"ex0e6NaFPR7iK1xcV8Wgnw":{"text":"As we walked along the French Quarter, our friend was taking us to spots to food we just h","useful":4,"cool":2},"nye3KNBFlBQri80MehUNlg":{"text":"2nd time to Killer Poboys and i could not be happier.\n\nHappy to announce they now take car","useful":6,"cool":5},"1yJ0YLbJ4xKEow3JRjY2Yg":{"text":"Some of the best Poboys in all of NOLA and for a reason. The food is fresh, made to order ","useful":0,"cool":0},"o_9YSHe7AgmXqKpAyIfFDQ":{"text":"Great Poboys !! It's a little hidden in the back of the bar but it's very good. I was with","useful":1,"cool":1},"gW2ryAX2gcRHAWI8VfSQ4g":{"text":"Strong 4 star rating. They source their bread from Dong Phuong cafe so it was an authentic","useful":1,"cool":0},"4BI_0nTN1LhO-Emeja8QWQ":{"text":"Amazing Po Boys in the French Quarter. This spot is located behind Erin Rose bar. The gulf","useful":1,"cool":2},"8Y_N417-Dw6NNa9KlvoJ-Q":{"text":"We took it upon ourselves to check out as many poboy spots as we could while visiting New ","useful":1,"cool":0},"OejwNSNESeQI0bz7tWfz9g":{"text":"If you're looking for the best po'boy around, it doesn't get any better than Killer Po'boy","useful":5,"cool":5},"6U8_ig_WsnFyExz5NNUDSw":{"text":"This place is super cool. It's in the back of a bar so feels like a food speakeasy place. ","useful":1,"cool":1},"XhcB1TdKyaPmXLQjYN8XBA":{"text":"When in New Orleans, one must try Po-Boys!  Depending on who you ask, there is always an o","useful":8,"cool":8},"53v_P6_dW70IWIUEwkr0jg":{"text":"This is my second time coming back to New Orleans and the first place I had to take my fri","useful":5,"cool":4},"KkdQKXSB_qKzMohgIaB2Yw":{"text":"These are not Poboys.  I had the shrimp sandwich and my boyfriend had the Pork Belly, and ","useful":1,"cool":1},"arr-K3NiWh09iDxPzpKuEg":{"text":"My hubby was hankering for a Poboy, and was stoked when I told him there was an outlet for","useful":0,"cool":0},"rPUE2EL-34tecmKZXZVHUw":{"text":"This location is inside the Rose Bar. You just have to get to the back of the bar. There a","useful":0,"cool":0},"F0BKAw9AjkirtsztBBZMfg":{"text":"Killer Poboys is everything you want out of a NOLA meal: a dive vibe, a creole and global ","useful":1,"cool":1},"REmA203QbYiWshg6GqzX7Q":{"text":"Great shrimp po boy. Definitely in a dive bar but worth the trip. Tasted my friends pork b","useful":0,"cool":1},"zWAptsuF3dJGKj_dTY1mTw":{"text":"Nestled in the back of Erin Rose bar, Killer Poboys serves just that-killer poboys. We fin","useful":1,"cool":1},"DI4LKMm01gvvay5-9rKi4A":{"text":"So yummy! We had the bbq chicken, seared shrimp, and the Ham and cheese! The seared shrimp","useful":1,"cool":0},"yY_4ltBml8aZ8xJyiTQlbw":{"text":"I know everyone in this town wants to serve up a po boy, but good gawd!! KPB is beyond leg","useful":1,"cool":1},"9IHcuchzdQN_tSGusk-Bow":{"text":"Their poboys are unique and different. My boyfriend had the pork belly and said it was per","useful":0,"cool":0},"VOUpe2AkxvSzSlb92x1qAg":{"text":"By far the best Po'Boys I've had in my life. Do yourself  favor and come here. You won't r","useful":0,"cool":0},"4vnlBNQVAXugRoFcHZRRpg":{"text":"So disappointed. Even though the bread was cold, with the hot meat (you'd think the bread ","useful":0,"cool":1},"R5H-BCk4T5ZyrjYoTsHGLw":{"text":"My wife and I were visiting Nola for the first time and we were on a quest for PoBoys. The","useful":1,"cool":0},"d55lHZLWqPasjXvz0-3Ohw":{"text":"Wowser pants! I heard about the illustrious Killer Poboy from my bestie/brother. Before I ","useful":16,"cool":11},"idgoADMrpVBJuMRzIfqhWA":{"text":"Oh. My. Lawd. This place is amazing!  I had the most delicious, perfect portion shrimp poo","useful":0,"cool":0},"BzxaroI6Rf01FN0wTLuirw":{"text":"This place was so good our group ended up eating here twice over Mardi Gras weekend. We ha","useful":1,"cool":1}}